{"poster":"DailiUmineko","date":"2017-03-11T14:49:35.199+0000","title":"Kindred cambios?","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"pues es una idea, y queria ver si hay jugadores de la comunidad que quisieran poner ideas para cambios en ella. No me refiero a cambios de habilidad o visuales, si no en su jugabilidad y general, ya que recibi&oacute; demasiados nerfeos tantos que ya no es un campeon que se pickee generalmente, sobre todo desde que le quitaron el tema de curacion y la hiceron un champ totalmente y exclusivamente para jg.\r\n\r\naqui les va mi idea, en general kindred ahora no es un champ muy fuerte y la hicieron muy marca- dependiente, entonces solo escala con sus marcas, el tema es que las marcas a mi parecer estan muy dificiles, si lo miras por un lado pues dan buen bufeo pero son muy injustas, si nos ponemos a pensar hay 9 champs que pueden quitarle las marcas a kindred, porque tanto enemigos como aliados le pueden dejar sin la marca si lo rematan ellos (a excepcion de dragon, eraldo y baron) yo creo que al menos los champs aliados deberian poder ayudar en sus caserias, aveces es muy dificil juntar las marcas, y mas cuando tenes en jg a un jax que es counter y encima te elimina marcas, a mi parecer deberian hacer que los integrantes del equipo puedan ayudar conn la recoleccion de marcas o en su defecto que alguna que otra marca aparezca en la jungla propia, orque todas las marcas estan o  en rio o jungla enemiga, y se hace muy dificil si te toca un enemigo tan duro en jungla. por eso estaria bueno que al menos en las primeras marcas haya alguna de nuestro  lado de la jungla porque asi si te toca alguien tan duro al menos no te toque batallar con una cuchara,porque basicamente kindred no es nda sin marcas, esta demasiado marcadependiente.\r\n\r\nme gustaria opiniones de ello y en lo posible de gente que juegue o alla jugado a kindred para que puedan entender el punto.","replies":[{"poster":"Pibe Alfajor","date":"2017-03-11T14:53:25.816+0000","up_votes":1,"down_votes":0,"body":"Me parece muy buena la idea","replies":[{"poster":"Pibe Alfajor","date":"2017-03-11T14:56:25.705+0000","up_votes":1,"down_votes":0,"body":"Aunque estaría bueno que la E de Kindred al romperla Stuneara al rival para darle mas fuerza en la jungla como en los duelos","replies":[{"poster":"DailiUmineko","date":"2017-03-15T17:47:03.731+0000","up_votes":1,"down_votes":0,"body":"es lo mejor y no le desequilibraria, porque realmente cuando la nerfearon y le sacaron hasta la curación, quedo en muy mal estado, y ahora es un champ marcadependiente que su mejor rol es jg.","replies":[]}]}]},{"poster":"Kyo Hatori","date":"2017-03-11T15:38:03.719+0000","up_votes":1,"down_votes":0,"body":"Kindred considero que es un champ dificil de equilibrar. Admito que cuando tenía sustain, los main kindred eran abusivos. Era inmatable.\n\nTen en cuenta que es un champ con bastante movilidad, y con ataque a distancia, que aunque no lo creas la hace bastante fuerte.\n\nActualmente la considero que está en mejor estado que hace unos parches atrás, pero aún asi le cuesta la jg. Aunque kindred es un champ pensado para hacer presión todo el tiempo, hacer counter jg, farmear marcas. Este parche me gusta, porque renta mucho más, ya que la primera marca te sale si o si en un escurridiso, pero igual no me cuesta tanto farmear marcas. Lo que tenés que aprender es a saber jugar muy bien los primeros 10 minutos, ya que definen totalmente tu partida.\n\nSi tuviera que ayudarla un poco ummm . . . me gustaría que tuviera más cc. Y que su ulti no cure a los enemigos. No está mal que no los mate, pero si que no los cure, asi te daría una ventaja extra.\n\nTe digo que a pesar de eso, no está necesariamente mal. He subido de Bronce a plata 3 solo usando a kindred y nida, en su peor momento de ambas. Y te digo que se puede perfectamente a los jg como jax y yi. K6 y Shaco la descosen, pero en general es bastante abusiva bien llevada. Busca a RedKind en youtube que es un main kindred y da unos tips muy buenos con ella, es diamante 2 actualmente, usandola solo a ella.\n\nEn fin, aguante kindred que es un champ hermoso\n\nFElices Pesadillas {{sticker:slayer-jinx-catface}}","replies":[{"poster":"DailiUmineko","date":"2017-03-15T17:46:02.167+0000","up_votes":1,"down_votes":0,"body":"si esta en mejor estado desde el ultimo parche, pero esta en la lona, tiene un daño exposivo con muchas marcas, pero sigue siendo un flan como todo adc, igual cualquiera le explota con un stun o lo que sea, otros adc como vayne, jhin etc al menos tienen un stun defensivo, y ella ni eso tiene, creo que deberian darle eso como un pequeño apoyo.","replies":[]}]},{"poster":"Charlôtte","date":"2017-03-11T16:01:36.005+0000","up_votes":1,"down_votes":0,"body":"Ya lo dije, le falta marcar más su personalidad, que la gente tenga miedo de atacarle, no que sea fuerte, sólo que le teman.\nNadie le tiene miedo a un adc hoy en día. Necesita algo como un stun defensivo como tiene vayne, jhin o jinx. Algo para que digan \"si la ataco me vendo\"\n\nLa ulti debe curar a sus enemigos porque no sería justo para el combate general y para la temática de su ulti, donde nadie muere ni se cura (ni minions ni escurridizo) quizá hacer que al enemigo le cure menos sería buena idea.\n\nTambién dije que el daño de Kindred comienza a notarse tras un periodo de ataques, supongamos que tras aplicar los tres basicos de la E (que comienza a romperse la armadura con la cuchilla oscura. Y no es justo que intentando realizar todo venga uno y te reviente antes de poder apretar la R. \n\nGaren puede romper armadura con su habilidad ya que al girar silencia y tiene buena velocidad, entonce tiene tiempo suficiente de hacerte comer todo el daño. \nPero Kind no, hasta tiene la velocidad de movimiento base más baja que algunos tanques. \n\nEs más, hasta el escurridizo escapa mejor de los ataques, hasta el escurridizo.","replies":[{"poster":"DailiUmineko","date":"2017-03-15T17:43:11.052+0000","up_votes":1,"down_votes":0,"body":"tal vez si tuviera que tener un stun o algo se le podría poner al 3er golpe a la marca de la e, y a lo de la ulti, yo creo que en si esta bien, pero pues tanmpoco es mala idea que cure menos a enemigos, seria algo como no se el tunel de bardo, que los aliados pasan mas rapido por él que los enemigos. Lo de los basicos creo que es demasiado, ya que si tiene marcas se tira hasta a un {{champion:31}}  o un {{champion:54}} que aveces estan re duros, y pues si, su velocidad de movimiento no es muy alta, con suerte se salva a base de saltos, tal vez es algo a repensar si le dan mas movimiento, y pasa mucho lo del escurridizo xD.","replies":[]},{"poster":"ImNw","date":"2017-03-11T17:52:50.345+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LLC,realm=LAS,application-id=v7qsfXsE,discussion-id=EqfyFMvZ,comment-id=0002,timestamp=2017-03-11T16:01:36.005+0000)\n>\n> \n> Garen puede romper armadura con su habilidad ya que al girar silencia y tiene buena velocidad, entonce tiene tiempo suficiente de hacerte comer todo el daño. \n\nLee bien lo que escribiste, el concepto esta pero mezclaste mucho, o por lo menos separa con comas xD yo segun puedo leer metes el giro junto al silencio falto una coma, pero bueno nada ya fue xD","replies":[]},{"poster":"ImNw","date":"2017-03-11T16:10:47.143+0000","up_votes":1,"down_votes":0,"body":"Garen tiene el silencio en la Q y rompe armadura despues de stakear 4 golpes de su E(Cuando gira), o mezclaste mucho lo que escribias o le pifiaste feo","replies":[{"poster":"Charlôtte","date":"2017-03-11T16:51:21.542+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ImNw,realm=LAS,application-id=v7qsfXsE,discussion-id=EqfyFMvZ,comment-id=00020000,timestamp=2017-03-11T16:10:47.143+0000)\n>\n> Garen tiene el silencio en la Q y rompe armadura despues de stakear 4 golpes de su E(Cuando gira), o mezclaste mucho lo que escribias o le pifiaste feo\n\nEs lo que dije, al silenciarte quedás libre a sus giros y te rompe la armadura, tiene tiempo suficiente de aplicar sus habilidades sin que puedas tirar habilidades","replies":[]}]}]}]}