{"poster":"Dr Ruthless xD","date":"2016-08-28T14:41:45.869+0000","title":"Freeze after loading screen","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"First off, sorry if there's a thread about this already. I did search quite thoroughly before this but I couldn't find anything really helpful.\r\n\r\nI was playing a few practice games today, and after winning a few and playing quite well i decided that i might try a normal match. After being thrown into a game i chose my character, runes and spells as usual, and there was nothing out of the ordinary until the game itself launched and the load screen came up. Still nothing unusual up until the point where my status was 'spawning' and my computer completely froze. After giving it a few minutes to see if anything would happen, I gave up and restarted my computer.\r\nStarting LoL up after rebooting, i rejoined the match and the load screen ran perfectly, putting me in the game as soon as i was at 'ready' and we went on to win, despite me joining half way through and being 10 or so levels behind.\r\n\r\nI thought this was a one off freeze, so i decided to play another normal match. Same thing happens - freezes at 'spawning', reboot, rejoin and everything's fine and my team wins again.\r\n\r\nNow thinking this problem had something to do with joining normal matches, i decided to go back to a practice match, but the same thing happened yet again, and now I'm here looking for a solution.","replies":[{"poster":"Dr Ruthless xD","date":"2016-09-18T18:17:06.022+0000","up_votes":1,"down_votes":0,"body":"also i didnt type this comment i dont know who did either on my account but i dont use punctuation in my comments very often","replies":[]},{"poster":"trännie","date":"2016-08-28T19:50:27.195+0000","up_votes":1,"down_votes":0,"body":"This has been happening to me but it won't let me get into the game at all, it just freezes each time i try to load a game","replies":[{"poster":"Dr Ruthless xD","date":"2016-09-18T18:14:34.570+0000","up_votes":1,"down_votes":0,"body":"it let me get into the game but right after the load is when i froze","replies":[]}]},{"poster":"Dr Ruthless xD","date":"2016-09-18T18:13:55.648+0000","up_votes":1,"down_votes":0,"body":"it was actually my graphics needed an update","replies":[]},{"poster":"Targons Blade","date":"2016-08-29T18:48:18.658+0000","up_votes":1,"down_votes":0,"body":"It sounds like you're probably experiencing this due to some recent Windows 10 updates that enabled the Xbox game DVR feature by default. As a quick check, I recommend [disabling the feature](http://www.tenforums.com/tutorials/8637-game-bar-turn-off-windows-10-a.html) to see if anything changes.\n\nLet me know if this helped.","replies":[]}]}