{"poster":"Agente087","date":"2018-03-11T18:36:11.293+0000","title":"Dificultad de la comunidad","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Hola, yo de nuevo, estoy pesado hoy.\r\nBueno veo, y quizas ustedes tambien, que se habla mucho de la comunidad, bien es un tema interesante y llamativo, lo que no se dice mucho es lo que se nos complica compartir aqui.\r\n\r\nExplico, me encuentro con que el juego es una cosa, el cliente es otra, el foro otra, discord, ts3 cualquier canal de comunicacion otra distinta.\r\n\r\nDe esta manera se nos complica muchisimo conectar. Todos tenemos amigos y cada uno tiene diferente nivel, pero no hay un lugar especifico donde buscar informacion o gente de neustro nivel para jugar. Es mas, el otro dia pregunte proque no hay unu chat, y me mandaron el link de discoord, para hablar y debatir algo, tenemos que postear el tema aca, de ahi ir al discord a hablar mas fluido &quot;cuando hay alguien&quot; y de ahi al juego a probarlo.\r\n\r\nEs mucho camino. Me parece que podrian hacer todo menos engorroso y mas practico, deberia estar todo unido y relacionado. Uno deberia poder compartir, contactar y expresarse directamente desde el cliente, de una forma mucho mas comoda y fluida, y poder llegar aqui, o a una sala de chat de forma facil y sencilla.\r\n\r\nAdemas poder armar partidas con jugadores desde esa interfaz, ya chateando o aqui en el foro, poder invitar a cualquiera a mi partida por ejemplo.\r\n\r\nMe parece que mucho de lo &quot;malo de la comunidad&quot; esta asi porque es como que jugar es una cosa, y compartir otra. No es muy dificil ver lo egoista y dictatorial de muchos en esto, y creo yo que la falta de comunicacion no ayuda.\r\n\r\nEso, no es la gran cosa, solo hablo del tema y me gustaria algo mas fluido e interactivo para compartir con los demas.","replies":[{"poster":"Tortuguita","date":"2018-03-11T18:52:33.323+0000","up_votes":1,"down_votes":0,"body":"Me parece que en NA tienen un sistema de comunicación mas simple y conectado , eso me comentaron.","replies":[]}]}