{"poster":"rtbf244329118","date":"2018-10-03T10:34:56.244+0000","title":"Good champion with ability to absorb damage.","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"Hey!\r\n\r\nI&#039;m quite new to the game. I usually play with Talon, and his ability to absorb damage is really low, making it easy for me to get killed. Is there any good champion who can absorb damage, at the same time deal damage.\r\nIf you have any other suggestions, you&#039;re welcome.\r\n\r\nThanks.","replies":[{"poster":"Shukr4n","date":"2018-10-03T10:37:56.209+0000","up_votes":2,"down_votes":0,"body":"Riven\nVi\nTham\nOrnn\n\n[...]","replies":[{"poster":"rtbf244329118","date":"2018-10-03T10:48:11.731+0000","up_votes":1,"down_votes":0,"body":"Thank You.","replies":[]}]},{"poster":"Paroe","date":"2018-10-08T09:21:33.727+0000","up_votes":1,"down_votes":0,"body":"Im surprised no ones suggested {{champion:79}}. \nBuild {{item:3027}} {{item:3100}} {{item:3102}} {{item:3157}} {{item:1001}} and a situational defense item. You get about 300AP and you REALLY hurt as gragas, plus you have a ton of CC.","replies":[]},{"poster":"Sir Prepuzius","date":"2018-10-03T10:56:59.612+0000","up_votes":1,"down_votes":0,"body":"tank pyke support can absorb damage like crazy.. he won't deal a lot of damage tho it can get plenty of kills/assist with his ult","replies":[{"poster":"rtbf244329118","date":"2018-10-06T15:29:36.691+0000","up_votes":1,"down_votes":0,"body":"Really? In stats, it shows he is poor in absorbing damage.","replies":[{"poster":"Sir Prepuzius","date":"2018-10-08T09:11:13.966+0000","up_votes":1,"down_votes":0,"body":"stats? where? anyway i meant that he tanks some damage, press w and then he goes back almost full health thanks to his grey health","replies":[]}]}]},{"poster":"Paíntchip","date":"2018-10-06T15:40:59.730+0000","up_votes":1,"down_votes":0,"body":"There is also this guy {{champion:157}} . If you die alot no one will think twice about it, he was actually designed. To be played under opposing teams turrets.","replies":[]},{"poster":"Paíntchip","date":"2018-10-06T15:35:33.128+0000","up_votes":1,"down_votes":0,"body":"New to game, all you need is this guy {{champion:86}} ! No mana, hits like frieght train, can’t be slowed, can’t be caught and he just doesn’t die! Not to mention he is one of the cheapest champs to get, if he isn’t free.\n\nAlso, he dominates all 5 roles!","replies":[]},{"poster":"Kitsunes Lust","date":"2018-10-06T15:34:58.943+0000","up_votes":1,"down_votes":0,"body":"personally, i LOVE swain. he's an AP sustain mage, that deals tons of damage, but has really good healing and 2 forms of cc (root and a draw-in) and he is sort of basic to learn as well.\n\nbut for general list of people, here's what i think\n\n{{champion:266}} (essentailly a sustain god)\n{{champion:36}} (he just does way too much frekin damage and hes very tanky as well)\n{{champion:3}} (great against AP heavy teams, and you can build him pseudo tanky and he can dish out some good damage all while tanking up some good stuff)\n{{champion:86}} (do i even need to explain him....)\n{{champion:420}} (just.....beyond broken and tanky)\n{{champion:39}} (can dish out really good damage and has high mobility, and has some really good sustain with items, along side a 50% damage reduction W)\n{{champion:141}} (Rhaast.)\n{{champion:75}} (farm this puppy up...just...one shot everyone)\n{{champion:58}} (really good damage and can take a good hit or 2)\n{{champion:50}} (absurd damage with his EW passive Q combo, and his ult gives him extra temporary HP and allows for some really good sustain, combine it with zhonyas and spirit visage, zhonyas in the middle of the team and get back all of your hp)\n{{champion:8}} (whole kit revolves around HP pretty much. Q steals and recovers HP, E uses set amount of HP as damage, R recovers a whole ton of HP, and the more HP you have the more AP you get and the more AP you have the more HP you get (doesnt stack with each other tho)\n{{champion:6}} (hes has suprisingly good sustain and does really good damage along with a execute ult)\n{{champion:19}} (its warwick...the god of heals....)\n{{champion:106}} (can be built tank, and can deal a really good amount of damage the more missing HP the opponet has)\n{{champion:83}} (love splitpushing forever? love high damage? love being naturally tanky? yorick is pretty good)\n\n\nthese are just a few i can think of off the top of my head that are pretty decent. i dont play any of them only like 2 or 3 of them listed, but basically Juggernauts, Divers, and a few Wardens are in this rage imo","replies":[]},{"poster":"giannishannibal","date":"2018-10-03T10:58:09.214+0000","up_votes":1,"down_votes":0,"body":"Well pyke,renekton,jax,vi,gragas,graves,irelia,riven,fiora are picks that build damage the first 2 items at least but they have some healing or gain resistances and can be hard to burst. Picks like malphite, ornn,poppy are great tanks with sort of shield, high bases damage like maplphite and max heath damage abilities like poppy q and ornn w, so these pick survive long enough to do 2 or 3 rotations with abilities in long teamfights, but lack the bust of the first ones. And there is rammus who can solo the adc with cinderhulk,thornail,ninja tabi any time of the day in 1vs1 unless of course the enemy adc is so fed that burst you then u need 4 items before you can all in 1vs2 (adc and supp)","replies":[{"poster":"rtbf244329118","date":"2018-10-06T15:32:28.218+0000","up_votes":1,"down_votes":0,"body":"I've played with Riven and Fiora, and they suit best for my gameplay style (Which sucks). I'm confused which one to get.","replies":[]}]},{"poster":"Kelg","date":"2018-10-03T13:35:04.394+0000","up_votes":1,"down_votes":0,"body":"{{champion:82}} Mordekaiser does just that. His passive gives him a shield for doing damage. His damage is insanely high, and he drains a shitton of HP from enemies. Problem is he's been nerfed into oblivion and left weak on purpose until his kit is reworked. \n\nYou can try him at least, I think he's like 1000 ip at this point. I've mained him since I started the game a few years back. He's not totally useless and can work since no one knows what he does. Plus, getting the enemy champs and the dragon as a pet is cool and fun.","replies":[{"poster":"rtbf244329118","date":"2018-10-06T15:26:57.875+0000","up_votes":1,"down_votes":0,"body":"Mordekaiser seems great. Yeah, he's available for 1350 BE (IP). But I find Tanks too difficult to play with.","replies":[]}]},{"poster":"Pika Fox","date":"2018-10-03T13:56:29.978+0000","up_votes":1,"down_votes":0,"body":"If you like jungling, amumu is cheap and fairly straight forward. As a tank, he can take a lot of punishment, but deals a lot of magic damage for a tank as well as provides good catch potential.","replies":[{"poster":"rtbf244329118","date":"2018-10-06T15:25:15.804+0000","up_votes":1,"down_votes":0,"body":"Thanks. I'll check Amumu.","replies":[]}]},{"poster":"Alzon","date":"2018-10-03T14:02:40.495+0000","up_votes":1,"down_votes":0,"body":"Yup, Mordekaiser is the epitome of “absorb and deal damage” because that’s literally all he does.  However, his target access (and retention) is incredibly low.  While he does work as a mid laner, if you want a champion for the mid lane who soaks damage while still being a threat, Cho’Gath and Galio are more reliable picks.","replies":[{"poster":"rtbf244329118","date":"2018-10-06T15:24:25.114+0000","up_votes":1,"down_votes":0,"body":"Yeah, Mordekaiser and Galio seems good. But I find Tanks too difficult to play with.","replies":[]}]},{"poster":"ShadWooo","date":"2018-10-03T12:16:54.206+0000","up_votes":1,"down_votes":0,"body":"Hi, it seems you just started. Talon is an assassin, champion that excels in killing squishy champions quickly. His low survivality is a tradeoff for this.\n\nImo Talon is very good champion right now, but consider this: take ignite instead of heal, and make custom runepage with Domination primary (Electrocute, Sudden Impact, Eyeball Collection, Relentless Hunter and Sorcery second: Celerity, Nimbus Cloak other good runes from sorcery are Waterwalking and Manaflow Band (if you have mana issues in lane)).\n\nYour role is to kill enemy marksman or support or mage. You should not stay visible to enemy team even when both teams group. You should stay behind wall/trees or hidden in bush untill fight starts and enemies uses some of their abilities and spells, ie. you go in when they start focusing others, do your job and then you try to apply additional damage to whoever still stands without dying if possible,","replies":[{"poster":"rtbf244329118","date":"2018-10-06T15:19:59.536+0000","up_votes":1,"down_votes":0,"body":"Thanks for this suggestion. Very helpful.\n\nI usually do good in Intermediate Coop vs AI games. But in Normal Blind Pick, I screw up badly. Fiora and Riven best suit my gameplay style, but I don't have them in my collection.","replies":[]}]}]}