{"poster":"sYndoo","date":"2017-09-13T18:20:52.529+0000","title":"Suche clan Community zum Fun Spielen","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Moin Moin \r\nIch suche auf diesen wege ein nettes Team clan oder community zum fun gamen bin 33 Jahre Spiele lol seid anfang des Jahres und bin zur zeit in Bronze unterwegs was wohl normal ist...  suche nette leute zum Ruhigen Spielen die extrem esports zeit ist vorbei bei mir aber spiele immer noch gerne 5 on 5 oder andere Sachen also mich ist nicht wichtig das ihr die super Helden des spielt seit (auch nix da gegen wenn sehr gute spieler da sind wo mann noch viel lernen kann) aber ich suche haupts&auml;chlich for fun und was sich dann endwickelt wird mann sehen! addet mich einfach in game und schreibt mich an oder lasst hier ein kontakt da..\r\nachso ihr d&uuml;rft gerne &Auml;lter sein und locker beim spielen keine lust auf leute die nur am flamen sind oder bei jeden lose gleich tillten den darvon treffe ich mehr als genung im ranked! \r\nmfg sYndoo","replies":[{"poster":"Kevknoll","date":"2017-09-13T20:20:39.085+0000","up_votes":2,"down_votes":1,"body":"Herzlichen Glückwunsch sYndoo \ndu hast so eben den ersten Schritt gemacht in der größte geschlossene deutschen Moderrierte Multigamming Community einzutreten.\n\nSehr gut Bro und Sister ;)\n\nBei uns wirst du keine Freunde finden, sondern eine Familie! Damit auch du nach dem Feierabend, Schule, Studium oder Arbeit\nvoll relaxen kannst.\n\nUnsere League of Legends Bereich braucht dich ! Wir suchen DICH!\nEgal ob du gerade erst angefangen hast oder seit Jahren dabei bist bei uns bist du willkommen ;)\n\nWir sind eine Community mit viel Spaß bis in die Nacht, bei dem viel gezockt, geredet und da wird auch viel gelacht. Darum herrscht hier keine anwesenheits-Pflicht, wir respektieren dein Privat leben und sind Familienfreundlich. Mit unseren gegen Cyber-Mobbing Stempel zeigen wir, das hier keiner ausgeschlossen wird und jeder egal ob weiblich, männlich, alt oder jung. Jeder ist hier herzlich willkommen ist. AUCH DU!\nMit diesen Vorsätzen wollen wir DIE besondere Community sein, auf der sich jeder Abends freut online zu kommen.\n\nUm das zu ermöglichen geben sich unsere Communityleiter stets die mühe immer neue Sachen zu implantieren damit du Spaß und Freude hast hier herzukommen.\nSei es Gewinnspiele im Form von Pay-Safe-Cards oder Adventskalender in der Weihnachtszeit. Dazu gehören auch Game-Events, in dem sich unsere begabten programmieren und technischen Köpfe Events ausdenke, oder einen privaten Server aufsetzt um in Ruhe verschieden spiele zu zocken können.\n\nWir versuchen ganz einfach einen Ort zu schaffen, wo jeder Spaß hat und es keinen streit gibt.\n\nWenn du jetzt auch zu unseren verrückten Familie dazu gehören willst ist das nicht so schwer.\nKomm dazu einfach auf den Teampspeak (Adresse: ballerkneipe.teamspeak.de)\n\nHomepage: www.ballerkneipe.de\nTeamspeak: ballerkneipe.teamspeak.de\n\nEin Bier auf dich, Bro ! prost Bis gleich :)\n\nPs. komm einfach vorbei, dann wird sich ein Moderator von uns direkt um dich kümmern. Sag dort einfach das du durch Limberg zur Ballerkneipe gekommen bist ;)","replies":[{"poster":"CBanisch5","date":"2017-09-13T20:31:53.625+0000","up_votes":1,"down_votes":0,"body":"Alter, schon wieder ey? xD","replies":[{"poster":"Kevknoll","date":"2017-09-13T22:59:04.819+0000","up_votes":1,"down_votes":0,"body":"Jip,ich mal wieder \nder Freundliche Beschwörer von Nebenan ;)","replies":[]}]}]},{"poster":"NCS Nythoxx","date":"2017-12-23T21:03:47.993+0000","up_votes":1,"down_votes":0,"body":"Hallo Leute,\n\nwenn ihr nicht gerne alleine spielen wollt und nicht immer einsam vor eurem Bildschirm sitzen wollt dann seit ihr bei uns genau richtig.\nSchaut vorbei auf dem Community Ts von Millenniumgaming.\n\nBei uns findet ihr Mitspieler für Fortnite, League of Legends, Overwatch , CSGO und PUBG.\nEs wird immer Spaßig sein und ihr könnt immer mit euren Freunden Zeit verbringen.\nVielleicht findet ihr neue Freunde zum spielen und zum gemeinsam Abhängen.\n\nEs wird mehrere Tuniere im laufe der Zeit geben die ihr nicht verpassen solltet.\nMillenniumgaming hat ein gut organisiertes Team bestehend aus dem Vorstandsvorsitzenden Feather | Felix seiner rechten Hand Erpic Fail | Eric und\nden Leadern NCS Demon | Kevin und Doctor | Joschua.\n\nIn der Community könnt ihr euch immer weiter hochkämpfen und verschiedene Ränge erreichen.\nMit Hilfbereitschaft, Managment und Marketing könnt ihr euch bei den jeweils Supervisor bewerben.\nFalls ihr interresse Zeigt freuen wir uns auf deinen Besuch und viel Spaß in der Community.\n\nIP: 84.200.101.179","replies":[]}]}