{"poster":"NoxiousIce","date":"2014-08-09T05:39:05.924+0000","title":"The Loading Screen: A Story of Wasted Potential","subforum":"Gameplay","up_votes":112,"down_votes":5,"body":"For a long time now my father (whom I introduced to the game over a year ago) has been complaining to me that the load screen is an area rife with wasted space, and potential. I've been putting off posting this for a long time, but I agree with him entirely.\r\n\r\nBack when he was new to the game he had to learn a LOT of champions, and spent the loading screen of every match tabbed out and looking at the wiki to see what the enemy team could do. He did this because if he just read through the entire wiki, he would have to sit down and dedicate a lot of previously free time to the game, and then when he got to the game, there would be no guarantee that he would remember any of it, so doing this during the loading screen was the ideal time. It was time that he had already decided belonged to LoL, and he could immediately go and apply his knowledge solidifying it in a much more permanent way.\r\n\r\nBut that's just it, he had to go tab out to do this, and while he is one of the fortunate people who have and know how to effectively use two monitors, not everyone can do this, and additionally it seems silly to both him and I that he cant actually acquire this information in game during the loading screen.\r\n\r\nWe're not asking for anything complicated in terms of visuals, or CPU heavy. The change that we're asking for could be as simple as making the ability blocks -  that you see while hovering over champions in champ select - appear during the loading screen while hovering over an ally or enemy. \r\n\r\nNot only would this feature seriously improve the loading screen experience, but it would also impact the game experience for newer players. Instead of being raged at for feeding a champion they know nothing about, now they could perhaps have a fighting chance. Bad players will still end up losing, but the burden of knowledge for the game would be a much easier thing to overcome with this ultimately small change.\r\n\r\nTL:DR - Loading screen does nothing, make it to where you can hover to see a champions abilities to make life better for newbies.","replies":[{"poster":"ArtoriusIV","date":"2014-08-09T07:27:56.477+0000","up_votes":24,"down_votes":0,"body":"I love this idea, as the knowledge curve for league is massive, this feature would be very nice, even for veteran's after a patch/rework or seeing a uncommon pick(urgot, yorick anyone?)","replies":[{"poster":"Tapu Fini","date":"2014-08-09T11:47:56.603+0000","up_votes":5,"down_votes":1,"body":"I definitely agree, for new players especially this could be a godsend. \n\nAs for veterans... Can you really call yourself a veteran if you don't know what a champion's kit is?","replies":[{"poster":"GundayMonday","date":"2014-08-09T16:18:54.668+0000","up_votes":4,"down_votes":0,"body":"I know all the kits, but am always a little fuzzy on the cooldowns. Especially when patches like the most recent one changes 30-40 champs. Would be fantastic idea since I tab out to remember cooldowns on my single monitor laptop every game anyway.","replies":[{"poster":"Rafael Merlo","date":"2014-08-09T22:34:19.617+0000","up_votes":3,"down_votes":0,"body":"Exactly. One time two friends challenged me and I had memorized EVERY SINGLE ABILITY NAME OF EVERY CHAMP. But numbers, especially Cooldowns, are different. This would be a huge up in the onboarding experience, and help veterans in the Mastery pillar through Game Knowledge. Do it, Riot.\n\n# **Rito pls**\n\nAnd OP, congratulations for showing League to your father :D","replies":[]}]},{"poster":"ArtoriusIV","date":"2014-08-09T14:09:33.351+0000","up_votes":4,"down_votes":1,"body":"Yes, new champions are released and reworks. Champion kits do change, and there are so many champions in league, that do you remember every ability of every champion and their subtle uses? being able to read it quickly before a game would still be helpful.","replies":[]},{"poster":"Emperor of Arima","date":"2014-10-23T09:01:47.750+0000","up_votes":1,"down_votes":0,"body":"I'm not a complete noob, but I know pretty much everyone's kit except morde and yorick (only today i figured out exactly how yorick's ult works... i think)","replies":[]},{"poster":"OblongOtter","date":"2014-08-10T01:25:03.149+0000","up_votes":1,"down_votes":0,"body":"(As someone who actually enjoys learning everything about the game and it's kits and stuff, even though I've only been playing for a year) I'd say yes, considering being a veteran only means you've had a lot of experience in the field.  You could have played this game from day one, be the longest standing veteran of this game, and not know that say, Darius passive gives him movement speed.","replies":[]},{"poster":"Doomsabre","date":"2014-08-09T22:28:52.349+0000","up_votes":1,"down_votes":0,"body":"I think it'd be a healthy reminder even to veterans if the display was to also show scaling, base damages and range, this way everyone could benefit from it.","replies":[]}]}]},{"poster":"Ryjax","date":"2014-08-09T16:01:13.940+0000","up_votes":14,"down_votes":2,"body":"This and add a simple chat bar along an edge and that'd be awesome","replies":[{"poster":"Thunder Dreamss","date":"2014-08-09T18:27:03.452+0000","up_votes":6,"down_votes":0,"body":"Team chat during loading would do wonders to help solo-queue actually plan and strategize.  There's not much time for it in champ select and once you get in game everyone has things to do so large amounts of typing isn't particularly feasible for most players.","replies":[{"poster":"Grimlyn","date":"2014-08-10T01:28:31.273+0000","up_votes":2,"down_votes":0,"body":"I agree entirely with both of these ideas. I was in team builder just the other day and 3 out of 4 people had never seen someone play Hecarim let alone play along side him, so i took the time to simply explain his W because lets face it, if no one knows to go in with him and chicken out, Hecarim will die almost every time. If players had more time and access to pre-game information as well as the ability to discuss strategies both Team work and individual playing skills would highly increase. Its like the ability and video explanations for Champions now. Those didnt always exist and if you never played or owned a champion or didnt watch a spotlight on them you were at an extreme disadvantage. I for one do not take those videos for granted and implore all new players yo utilize them to the fullest.","replies":[]}]},{"poster":"MugyvrNinja","date":"2014-08-09T19:18:32.977+0000","up_votes":2,"down_votes":16,"body":"lol hell no I think they should remove the chat from the game.","replies":[]}]},{"poster":"CupcakeTrap","date":"2014-08-09T17:30:06.885+0000","up_votes":2,"down_votes":0,"body":"Personally, I'd also like to see a graph of physical vs. magic damage. Easily computed from actual match data (physical damage dealt to Champions, magic damage dealt to Champions).","replies":[{"poster":"Thunder Dreamss","date":"2014-08-09T18:38:35.479+0000","up_votes":10,"down_votes":0,"body":"That gets into one of my biggest gripes when I as new.  How the fuck are new players supposed to know what resistance to build?\n\nPantheon is throwing spears at me?  Well spears seem physical so I should build armor.\nNow Nidalee is throwing spears at me?  Well spears still seem physical so I should build more armor...","replies":[{"poster":"CupcakeTrap","date":"2014-08-09T18:42:11.118+0000","up_votes":5,"down_votes":0,"body":"I think it'd also be nice to have a damage recap window we can open even if we aren't dead. If I'm getting wrecked by a midlaner, I'd like to be able to check what percent magic damage they're doing to me.","replies":[]},{"poster":"Grimlyn","date":"2014-08-10T01:34:31.636+0000","up_votes":1,"down_votes":0,"body":"There is Graphical information on Physical vs Magical damage. Its in the expanded match histories. Now if you mean in game, its your job as a summoner to be able to read into the items your Enemy teams have. Are they building ap or ad items? And you do this by pressing the TAB button. That should be all the information you need otherwise do more research online, i know they don't give (ad vs ap) scaling information in the Champion infos, which they should, but you can look it up on any league wiki.","replies":[{"poster":"RowGo","date":"2014-10-14T03:41:56.605+0000","up_votes":1,"down_votes":0,"body":"I remember when I was a noob I built ap on shyvana cause her w does magic damage so I thought it was an ap ratio.\nI still stomped with her but I didn't learn other wise till my friend told me.","replies":[]},{"poster":"FFirebrandd","date":"2014-10-13T18:37:17.514+0000","up_votes":1,"down_votes":0,"body":"And then you get weird abilities like Miss Fortune's ult... where it does both physical and magic damage and building AD scales its magic damage and building AP increases its physical damage...\n\nEdit: and added onto that you have abilites that scale off of health... looking at the champ's items won't help you know what kind of damage it is doing at all.","replies":[]},{"poster":"Thunder Dreamss","date":"2014-08-10T04:35:58.352+0000","up_votes":1,"down_votes":0,"body":"I'm not sure if you're trolling or not so I'll treat this as a genuine response.\n\nThis isn't about things experiences players know.  This is about new players.  You know, the one's who just get recommended items because they don't know what's good?  The one's who have only memorized the couple champs they play and the most common 5ish FotM's?\n\nYes, once you're experienced you know to check whether that support Annie is building support items or if she's building AP to burst you down.  This is about new players who don't know AP generally means magic damage.  There's no uniformity in champion visuals to indicate what kind of damage they deal and this makes is unclear to new players why they are dying or what they can do about it.  Heck, even the AP = Magic thing isn't innately obvious because there are plenty of **Abilities** that do physical damage and if you have more **Ability Power** you should be dealing more physical damage with those, right?\n\nedit: lets not forget people like Eve who build AD to deal magic damage.  At least Hate Spike *looks* magic.","replies":[]}]}]}]},{"poster":"Syvenon","date":"2014-08-10T02:57:40.649+0000","up_votes":3,"down_votes":0,"body":"More than anything I'd just like chat. It would make lane switching way easier to pull off in solo queue.","replies":[]},{"poster":"Quantum Weeb","date":"2014-08-09T19:19:42.229+0000","up_votes":3,"down_votes":0,"body":"Great idea, although I would like an option to turn it off. While I wouldn't use it, I cans see how handy it would be to new players.","replies":[]},{"poster":"MugyvrNinja","date":"2014-08-09T19:19:29.915+0000","up_votes":3,"down_votes":0,"body":"This is a great idea +1","replies":[]},{"poster":"Wullf","date":"2014-08-10T09:51:02.161+0000","up_votes":2,"down_votes":0,"body":"I would also appreciate chat window on loading screen","replies":[]},{"poster":"GidoMeta","date":"2014-08-09T15:40:24.768+0000","up_votes":2,"down_votes":0,"body":"Geniussssssss haha","replies":[]},{"poster":"Lord Gallizum","date":"2015-04-29T20:47:32.291+0000","up_votes":1,"down_votes":0,"body":"I think we may see this someday or at least more features hence they add skin names and a background. I wouldn't rule that riot may add more features some day. We should be patient.","replies":[]},{"poster":"Leaf of the lake","date":"2015-04-29T07:07:19.771+0000","up_votes":1,"down_votes":0,"body":"I think even more than this, players need to be able to chat with their team during loading screen. They could solidify team strategies during this time, establishing a strong basis of teamwork before the game even begins. This would be far better than possibly talking about team strats during team select, being forced into a several minute long loadscreen, and then expecting to continue that conversation when the game loads. It would also give a lot more time to figure out if a team wants to invade or lane swap or something, rather than trying to get stuff like that done in the 15 seconds before the gates open.","replies":[{"poster":"Teemo Zalium","date":"2015-04-29T07:11:33.663+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Leaf of the lake,realm=NA,application-id=3ErqAdtq,discussion-id=zvEHUE7f,comment-id=0015,timestamp=2015-04-29T07:07:19.771+0000)\n>\n> I think even more than this, players need to be able to chat with their team during loading screen. They could solidify team strategies during this time, establishing a strong basis of teamwork before the game even begins. This would be far better than possibly talking about team strats during team select, being forced into a several minute long loadscreen, and then expecting to continue that conversation when the game loads. It would also give a lot more time to figure out if a team wants to invade or lane swap or something, rather than trying to get stuff like that done in the 15 seconds before the gates open.\n\nI agree like sometimes if I play draft I see someone pick jax and assume he is going top only to see someone else pick someone else top and jax jungle. What if they countered you? It would be good to chat about a strategy or lane swap. At times I've gone into a game in the middle of talking to friends and it would be nice for me not to have to wait 10 min for the game to start to reply.","replies":[]}]},{"poster":"Teemo Zalium","date":"2015-04-29T06:58:22.209+0000","up_votes":1,"down_votes":0,"body":"I really love this idea. I think even some of the more veteran players could use this for champs they don't see as much. I have hence they recently added a background the SR load screen. I would just be patient new things are being added all the time and riot does read these types of threads imo contrary to popular belief.","replies":[]},{"poster":"SolidPooh","date":"2014-10-23T11:29:23.344+0000","up_votes":1,"down_votes":0,"body":"Im all for this, add a chat pop up for the lobby and rune select until every player equates to 80% loaded and were in business lol","replies":[]},{"poster":"iRetribution","date":"2014-08-23T03:34:04.117+0000","up_votes":1,"down_votes":0,"body":"Would be awesome, but one of the last few patches (cant remember which) reduced the loadscreen times, and I think what Riot ultimately wants to do is remove the loading screen so people can get straight into the game.\nNot official, of course, but I would hate to see this put into loading screens and then have loading screens become so fast that the information would hard to grab in the short time span.","replies":[{"poster":"junglerboy16","date":"2014-10-13T18:41:46.043+0000","up_votes":1,"down_votes":0,"body":"well, this ould be something great to do until they do get rid of the loading screen, sort of like the tips they have but more in depth for each champ loading.","replies":[]}]},{"poster":"Demonsolder21","date":"2014-08-12T01:20:26.662+0000","up_votes":1,"down_votes":0,"body":"I'm with everyone riot please implant a chat thingy within the loading screen.","replies":[]},{"poster":"FantasySniper","date":"2014-08-11T19:25:31.266+0000","up_votes":1,"down_votes":0,"body":"The time is nigh for Rito to work on an interactive load screen.\n\nAnd for them to allow use to exit the client without having to kill our computers.","replies":[]},{"poster":"exiledFromBadmen","date":"2014-08-10T14:24:39.050+0000","up_votes":1,"down_votes":0,"body":"Great idea!","replies":[]},{"poster":"Drogeist","date":"2014-08-10T08:34:02.713+0000","up_votes":1,"down_votes":0,"body":"An awesome idea.  I like it, and think at least something could be added to loading screen.  I've always wondered about team-only chat to help plan pre-game strategy (like invade and buff warding).  \n\nOnly potential downside I can think of besides resource demands on low-end machines (they are trying to making loading *faster* not slower!), would be that it potentially takes focus away from champion splash art which is part of what makes Riot the most money (paid skins).\n\nRegardless, neat idea.","replies":[]},{"poster":"DeadIsTaken","date":"2014-08-10T07:34:41.656+0000","up_votes":1,"down_votes":0,"body":"This would be awesome. As someone who is still trying to learn league, it would be a godsend to not have to alt tab during the loading screen because I don't know {{champion:111}}'s passive, or \n\nsomething like that.","replies":[]},{"poster":"F0ND","date":"2014-08-10T04:38:49.291+0000","up_votes":1,"down_votes":0,"body":"Holy amazing post. I wholeheartedly agree and support this, it's always nice to read a bit about a champion youre facing, and considering I've been trying other MOBAS I know how frustrating it is to have no idea what the enemy team can do.","replies":[]},{"poster":"Berz3rker4Life","date":"2014-08-10T02:44:12.960+0000","up_votes":1,"down_votes":0,"body":"I have the same thought, But i wish if you hovered over a character you could read a little lore if you wanted, some tips on how to play or either fight them. Idk Just something new and I would love to see something change with loading screen. In that time I just like to sit on youtube and listen to songs and decide which playlist to listen to. Other than that it's either getting up and walking around or just sitting, and waiting while nothing happens but a number goes up... 1%-100%","replies":[]},{"poster":"XNasusXDeathyX3","date":"2014-08-10T01:54:20.031+0000","up_votes":1,"down_votes":0,"body":"riot should make a sexy Nasus loading screen. pls roit","replies":[]},{"poster":"TysonDragonica","date":"2014-08-10T01:12:08.659+0000","up_votes":1,"down_votes":0,"body":"I think that the loading screen has a lot of potential for not only giving simple information but also things like allowing a few extra seconds to chose runes and masteries or things like that. I was even thinking about the idea of having a simple chat box in the loading screen to allow more time for team strategy discussion or even small talk between teams. Over all, it's just a lot of wasted potential.","replies":[]},{"poster":"Music Hypes Me","date":"2014-08-09T23:49:07.352+0000","up_votes":1,"down_votes":0,"body":"I love this Idea! Something simple, when you hover over the champion you can see ability facts or just simple tips!\nIt would help lots of newbies and I believe would also help lots of low elo players too, to understand what they are facing up against.","replies":[]}]}