{"poster":"NoxiousIce","date":"2014-02-19T04:36:02.240+0000","title":"I Don't Get Excited to Play Anymore and Here is Why (@riot)","subforum":"[ARCHIVED] Miscellaneous","up_votes":3,"down_votes":2,"body":"This post is going to be mostly directed @Riot, because I'm still holding on to the idea that they care. Maybe they don't always respond, or have time to read every post, but they do care, at least I hope.\r\n\r\n**The TLDR is basically the bolded stuff**.\r\n\r\n**I don't like your recent decisions Riot**, and quite honestly, **I've lost basically all enthusiasm for the game**. I used to get excited for the game, and boot up a game on my own, or invite my friends to play. I have brought my father, my brother, and several of my friends to the game all because I was excited to play and I was having fun. I used to stalk redtrackers and read everything that Xelnath and pretty much anyone else on the reworks side of thing posted. Not anymore.\r\n\r\nThese days I don't start up the game on my own, and when my friends/father/brother want to play, I groan a little bit to my self, and get slightly depressed. Your game has changed a lot since I've started (this is actually my second account, and my first account was there for the release of Shen, but got wiped due to some inactivity thanks to personal issues) but that isn't what has me not wanting to play. The game itself still revolves around the same basic and fun gameplay, the community is still a steaming pile of crap like it has always been, but I deal with it, it was worth it before. It honestly hasn't gotten too much worse, its just more visual now because there are more people. What has me so disenfranchised, so terribly morose about the idea of playing a game is your more recent direction Riot.\r\n\r\nAs a warning things are about to devolve into specifics in order to build up to my final statement. This will probably be long, obviously not everyone will agree with everything I have to say, and I have a tendency to go a little bit off on to tangents. I will try to reign myself in, and chop out unimportant bits, but no guarantees. Everything after this point will probably be a mess. \r\n\r\n**It basically started with the Karma rework.** I didn't actually play Karma a whole not (honestly no one did) but when I did, I had a blast with her! **She was really fun**, she had a very clear theme, and everything with her made sense in relation to the rest of her kit. **She suffered from a few problems** (only having three abilities, her line being completely useless basically made it two, and she didn't fit well into the support meta of the time,) **but she was fun and unique**. **Then the rework** came through, what made her thematically whole was stripped, she was given new and painful voice acting, her look was changed, **the things that made her fun before were taken away**, and most of the problems she suffered from remained. She now has no passive (that passive doesn't count, it should just be part of her ultimate to make it less shitty,) she is still outclassed by majority of supports, in fact the only thing that the rework accomplished was killing any interest I had in Karma. Her playstyle is completely different, she isn't nearly as good as a mid or top, and she **STILL has that STUPID** **line ability**. Its a bit different, but **no one liked the line** **at all** and you kept that instead of the fans, which people really liked. I wont count the time it took to do the rework against you because I'm aware that it had to be restarted many times over. Holy crap though, seriously? No one plays Karma even today. All you accomplished was taking the fun out of her for people who actually enjoyed her before, and all you had to do was replace that line ability, make the ult level up, and allow it to ult itself for a fourth ability. Worse still is that you ended up giving her ulti to Heimer too, so Karma isn't even unique any more. **Lux and Morgana have more in common than New and Old Karma.**\r\n\r\nNow this whole **Skarner Rework disaster**. You've managed to do the same thing over again. I played Skarner for a bit, really liked old Skarner, for a time each me, and two of my friends mained old Skarner, even after his ult lost all reliability. We were having fun. Admittedly he had problems, but that's why he was up for a rework. Unfortunately all of **the concerns of old Skarner players were ignored**, the rework went through, and basically every problem that you were told he was going to have, he now has. **He is extremely underwhelming**, disappointing, and the thing that made him fun is gone **under the guise of \"anti-fun\"**. **Yet Teemo** - who has been anti-fun for WAY longer, and WAY more people dislike him, and is also MUCH more of a problem due to his popularity - **remains untouched**. Sure Skarner's numbers will be tweaked EVENTUALLY, but for now old Skarner players are disenfranchised, and Skarner wont garner any new attention until he gets buffed enough that pro-players are picking him every game, at which point he will be nerfed into the ground, and be right back where we are now.\r\n\r\nXerath and Heimer both seem pretty alright, which is good. There is **one problem with Xerath** though. We were promised that you would **fix his Ultimate's animations and sound** before he got released. You were told MANY times that it felt underwhelming and **didn't feel cool to use**, and you said you would fix it. Well, here he is, released, and it's not fixed. I feel like it probably never will be either, because you have this tendency to ignore things like that once they're released. What the hell is PBE for if you don't actually listen to the people playing on it.\r\n\r\nI feel like Riot has its ears open, but its mind shut. **I feel like you're hearing us, but you're not listening**. I admit that its hard to sort through everything the community has to say, and I understand that **Riot isn't a singular person**, that its **lots of people** who **have to communicate**, and that due to that **sometimes** things get dropped, forgotten, and **mistakes are made**.\r\n\r\nSo before I go to the really big thing that has me not wanting to play, lets summarize the other things so far: **Several reworks have been released, and they have killed my enjoyment of those champions. It feels like Riot is inconsistent in their design decisions, complaining about anti-fun, but only tackling some of it, saying that they don't want this or that in the game, and then two champions later they do just that. I feel like Riot has very selective listening skills when it comes to champion reworks**.\r\n\r\nThe big thing is this: I'm afraid that the next champion they touch will be Diana, and I'm afraid they're going to massively change what makes her fun. **Diana is my absolute favorite champion**. I love everything about her. I love her unique play style, I love her theme, I love the music that was released with her - I seriously listen to it all the time, and sing it in the shower 2/3 times that I take a shower - I love her lore, I love her personality, did I mention that I love her lore? Seriously, if Diana wasn't at risk of changing, I would get the Lunari Symbol as a tattoo, and I have no tattoos, and prior to Diana I couldn't even conceptually grasp why someone would ever brand their skin with an image forever. I love the dichotomy of Leona and Diana as a pair, I love their conflict, I seriously cannot get enough of Diana. I'm terrified though! You have stated that Diana is a problem because **she is a bruiser-assassin**, but that's what makes her fun and unique. **You have branded her has wrong-fun**, and we aren't allowed to have wrong-fun. Her kit allows her this play style that is a cross between a tanky initiator and an assassin. She dives in, and has the potential to kill someone fairly quickly, but if its in a group, she can create a great initiation for her team depending on how she built. The trade off is that she has no escape. She has to pick her moments carefully because if she goes into a full team and her team isn't ready, it'll at best be a one for one exchange, and leave her team without an initiator. That is what makes her fun. She can be what her team needs her to be. **If she is changed, it can either go the route of the assassin, or the tanky initiator**. Unfortunately if you take her in either of those directions she will never be played. **If you pigeon hole her into an assassin role then any assassin with an escape will be better. If you pigeon hole her into a tanky bruiser role, any bruiser with an escape, a more reliable engagement, or more cc will be better.** **I don't want Diana homogenized**, and that is where this is all heading. Maybe Diana wont be next, someone else will, but **Diana will come eventually**. Make no mistake though, this isn't a \"please don't touch my champion\" thread, this is a \"Riot seriously, start listening better\" thread. You're doing great on the community interaction Riot, but **I don't want to play a game and invest money into it if I fear that you're just going to change everything I love about the game like you have been.**","replies":[{"poster":"Rubitonabuilding","date":"2014-03-05T01:11:49.909+0000","up_votes":1,"down_votes":0,"body":"TLDR: qq","replies":[]},{"poster":"blizbrake","date":"2014-02-19T08:30:54.120+0000","up_votes":1,"down_votes":0,"body":"yeah","replies":[]}]}