{"poster":"Kxnlei","date":"2019-07-29T19:41:45.661+0000","title":"Punishment System","subforum":"Player Behavior","up_votes":2,"down_votes":13,"body":"[Please don't vote if you don't intend to read my explanations/suggestions - it's a waste of your time, and mine]\n\nBefore you comment, I would like you to note that I believe a punishment system is a great idea to at least prevent toxicity for a period of time and hopefully that player will reform in some way. However, what's more notable is that players almost never reform after being punished. Secondly, I'm not among 0.006% players to get banned. If you count the smurfs, I'm probably among the 90% **unique **players to get eternally banned.\n\nWhat I think Riot could do is:\n1. Either balance the game properly and to a better standard - It is extremely tilting and frustrating to play against these unbalanced, safe-pick champs. Playing almost anything into Zed feels like Riot telling you to go AFK.\n2.  Or change the punishment system - My main focus here is on toxic encounters. Yes; someone flamed in chat. Probably for a good reason, if  we're going to be honest in this discussion.  Lets be completely real in this context: you have someone 0/3. Logically, you wouldn't have to say anything to them because you would automatically expect them to at least try and stay safe. Maybe farm under tower, stop overextending and quit engaging in fights until they get a gank. Regardless, they don't. At all. They run it down their lane because they know Riot won't ban them since it's not intentional, it's just stupidity. If you start flaming one of these people in my games? I'm not gonna stop you. Can I join in? Although restricting chat is a great idea (it's going to help them get used to not using chat at all), I believe that banning, regardless of time period, is completely stupid. What is that going to teach them? How to make a new account? Can you not just eternally increase the penalties until their honour resets? It would be more beneficial to both the player and the people they encounter if they just couldn't use chat, rather than have them make a new account to ruin some new player's day.","replies":[{"poster":"rujitra","date":"2019-07-29T20:00:50.828+0000","up_votes":3,"down_votes":1,"body":"1. There are champs that are stronger than average. There is not a single champ that is a guaranteed lost lane/game. Learning to play against all champs and learning to counter/be countered in lane is part of the game.\n\n2. Your frustration doesn't give you the right to make other people have a worse time by being negative in chat. Banning players succeeds in making a majority of them leave the game, which is the goal if they refuse to behave.","replies":[{"poster":"Kxnlei","date":"2019-07-30T04:31:54.368+0000","up_votes":1,"down_votes":8,"body":"Although I see where you're coming from, you're missing the point. There is a huge, overblown meta for League and it's becoming a joke. Zed, Nasus, Urgot, Illaoi. Unstoppable champs especially if all on the same team. Secondly, that's actually a very, very, very untrue statement. If you took your time to read Riot's Summoner's Code: we don't encourage any players to leave the game, regardless of the mistake they make. 'Specialist' huh.","replies":[{"poster":"Umbral Regent","date":"2019-07-30T06:48:15.732+0000","up_votes":1,"down_votes":0,"body":"> ...you're missing the point. There is a huge, overblown meta for League and it's becoming a joke. Zed, Nasus, Urgot, Illaoi. Unstoppable champs especially if all on the same team.\n\nFirst of all, if you're talking about meta stuff, there are comically minimal chances of seeing those four Champions _all_ on the same team, considering that _three_ of them are traditionally played top lane.\n\nBeyond that; if you don't like going up against a specific Champion? Ban them. That's what bans are for, is to get rid of a Champion who, for whatever reason, proves to be a problem factor in your games, whether it be meta dominance or personal vendetta.\n\nRiot generally avoids trying to tamper with/dictate the meta, and they sure as hell aren't going to arbitrarily throw a spanner in it just because you don't like seeing Zeds or watching your top lane get crushed. Play better around the Champions, or ban them, but don't expect Riot to alleviate your issues with the meta.\n\nAnd with that said; the meta is not a subject of discussion for _Player Behavior_, so I'm leaving that half at that.\n\n> Secondly, that's actually a very, very, very untrue statement. If you took your time to read Riot's Summoner's Code: we don't encourage any players to leave the game, regardless of the mistake they make.\n\nThe Summoner's Code is a guideline for players to follow. Riot issues bans to players who choose _not_ to follow that guideline (alongside the rules) consistently. Riot issues bans (particularly permanent bans) with the goal of making that player leave the game - that is literally the express goal of the permanent ban.\n\nAdditionally, you may want to take some time to re-read the [Summoner's Code](https://na.leagueoflegends.com/en/featured/summoners-code) yourself. The section you're referring to reads as follows;\n\n> **Lead the way for newbies, be helpful.**\n>\n> Never forget the excitement you felt when you first set foot on the Rift. Don't mock newbies who are still learning the ropes or urge them to give up on League. Instead offer a hand when they stumble.\n\nIt tells players not to deride newer, less-experienced players or encourage them to quit the game just because they don't perform well, and to instead help them to improve.\n\nIt says nothing about the goal of permanent suspensions, so, whether you think so or not, rujitra's comment is a very, very, very true statement.","replies":[{"poster":"Kxnlei","date":"2019-07-31T06:01:28.777+0000","up_votes":1,"down_votes":4,"body":"Ohhh! I get it now. If they're experienced at the game then sure, force them to quit. Great attitude.","replies":[]},{"poster":"Kxnlei","date":"2019-07-31T06:00:29.489+0000","up_votes":1,"down_votes":5,"body":"Zed mid. Illaoi top. Nasus jungle. Urgot support. You were saying tradition? Can I just say that off-meta exists too? :D Just because they are 'traditionally' played in top lane, doesn't mean they are strictly limited to that lane.","replies":[]}]}]}]},{"poster":"GatekeeperTDS","date":"2019-07-29T19:51:59.797+0000","up_votes":5,"down_votes":4,"body":"I voted, in the negative, without reading your post.\n\nBecause you know why? You shouldn't start off a post in an antagonistic fashion.\n\n> [Please don't vote if you don't intend to read my explanations/suggestions - it's a waste of your time, and mine]\n\nIf you don't want opinions, don't come to a public forum.","replies":[{"poster":"Kxnlei","date":"2019-07-30T04:27:13.706+0000","up_votes":1,"down_votes":5,"body":"***","replies":[{"poster":"CharDeeMcDenniz","date":"2019-07-30T10:45:45.317+0000","up_votes":1,"down_votes":0,"body":"judging by the current results, he was probably on to something...","replies":[{"poster":"Kxnlei","date":"2019-07-31T05:59:15.688+0000","up_votes":1,"down_votes":2,"body":"I used something that was considered offensive in these strict rules. Does not mean his argument was any 'better' than mine. So no, he probably wasn't.","replies":[{"poster":"CharDeeMcDenniz","date":"2019-07-31T12:19:31.455+0000","up_votes":1,"down_votes":0,"body":"im not saying his argument was \"better\"\n\nim saying that his point that you would get a more accurate and better quality response from the forum if you dont start your post with insults is accurate \n\nwhen you consider how completely lopsided your poll results were it's not hard to imagine different results if you have a more neutral tone\n\nbut hey, thats just my opinion, this thread is already a flop so who cares","replies":[]}]}]}]},{"poster":"Kxnlei","date":"2019-07-30T06:35:26.816+0000","up_votes":1,"down_votes":6,"body":"Also. Learning the definition of antagonistic might help you make a stronger point with the word next time.","replies":[]}]},{"poster":"KFCeytron","date":"2019-07-30T11:22:15.630+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Kxnlei,realm=EUW,application-id=ZGEFLEUQ,discussion-id=HNqZ79w3,comment-id=,timestamp=2019-07-29T19:41:45.661+0000)\n>\n> players almost never reform after being punished.\n\nThis is factually incorrect.\n\n> [{quoted}](name=Kxnlei,realm=EUW,application-id=ZGEFLEUQ,discussion-id=HNqZ79w3,comment-id=,timestamp=2019-07-29T19:41:45.661+0000)\n>\n> Secondly, I'm not among 0.006% players to get banned. If you count the smurfs, I'm probably among the 90% **unique **players to get eternally banned.\n\nI don't understand what you mean by \"90% unique players to get eternally banned.\"\n\n> [{quoted}](name=Kxnlei,realm=EUW,application-id=ZGEFLEUQ,discussion-id=HNqZ79w3,comment-id=,timestamp=2019-07-29T19:41:45.661+0000)\n>\n> Probably for a good reason, if  we're going to be honest in this discussion.\n\nOnly children think there's a good reason to flame in a game, which is why the way society generally functions is that parents teach children how to behave.\n\n> [{quoted}](name=Kxnlei,realm=EUW,application-id=ZGEFLEUQ,discussion-id=HNqZ79w3,comment-id=,timestamp=2019-07-29T19:41:45.661+0000)\n>\n> Lets be completely real in this context: you have someone 0/3. Logically, you wouldn't have to say anything to them because you would automatically expect them to at least try and stay safe. Maybe farm under tower, stop overextending and quit engaging in fights until they get a gank. Regardless, they don't. At all. They run it down their lane because they know Riot won't ban them since it's not intentional, it's just stupidity.\n\nIf you freely admit that you know it's not intentional and they're just bad, what's the point of saying anything beyond \"hey, try to play a bit safer\" and then clamming up if they're obviously not listening to you?\n\n> [{quoted}](name=Kxnlei,realm=EUW,application-id=ZGEFLEUQ,discussion-id=HNqZ79w3,comment-id=,timestamp=2019-07-29T19:41:45.661+0000)\n>\n> banning, regardless of time period, is completely stupid. What is that going to teach them? How to make a new account?\n\nThe ability to play on a new account doesn't negate the benefits of permabanning toxic players. If every single one of them did that, then it would at least be a minor punishment, taking away their unlocked skins, icons, champs, and so on. Any who don't do that are removed from the game and the problem is solved in at least those instances. Quite frankly, Riot and 99.994% of the playerbase (people without permabans, according to Riot's figures on this, which I see no reason to doubt) don't give one whit for how permabanned players feel about being ejected from the game for consistently appalling behavior. Most permabanned players stop playing the game. It's extremely rare for a permabanned player to be so oblivious and/or unbalanced that they accumulate multiple permabans on a series of accounts. Riot does not have the wherewithal to prevent that except when a highly-visible player (such as a popular streamer) engages in this behavior, in which case they may issue an ID ban (Riot employees manually ban any account that such a player is seen to use).\n\n> [{quoted}](name=Kxnlei,realm=EUW,application-id=ZGEFLEUQ,discussion-id=HNqZ79w3,comment-id=,timestamp=2019-07-29T19:41:45.661+0000)\n>\n> It would be more beneficial to both the player\n\nYou're missing a key fact: as I said above, nobody but permabanned players cares about what would be beneficial for permabanned players. All we care about is that they go away.\n\n> [{quoted}](name=Kxnlei,realm=EUW,application-id=ZGEFLEUQ,discussion-id=HNqZ79w3,comment-id=,timestamp=2019-07-29T19:41:45.661+0000)\n>\n> and the people they encounter if they just couldn't use chat, rather than have them make a new account to ruin some new player's day.\n\nRiot's punishment system used to hand out stacking chat restrictions, such that consistently toxic players basically had a permanent chat restriction. Unfortunately, it turns out that such players used their few chat opportunities to be toxic, and, when they couldn't be as toxic as they wanted to, they resorted to committing non-chat offenses such as griefing (following someone around and taking their farm, using wall abilities to interfere with their play, etc.) or inting. The purpose of the punishment system is to eliminate rule-breaking, not make it worse. Thus, if a couple chat restrictions don't make any difference in a player's misbehavior, the system ramps up the punishments until the player is permabanned and thus unable to use that account to break any more rules ever again.\n\nRiot used to give toxic players a long series of gradually-increasing suspensions. However, they found that players who got more than a few punishments would never stop misbehaving and receiving punishments. As the goal of the punishment system is to eliminate rule-breaking and Riot has absolutely no interest in coddling toxic players, the system was changed to eliminate this long tail of irredeemable players. Compared to the hundreds or even thousands of typical players who are bothered over dozens or hundreds of matches ruined by a toxic player, that one player's ability to annoy people merits no sympathy or concern. The preferred outcome of punishing a misbehaving player is reform: according to Riot's figures, most players who get one punishment never get another. However, when a player refuses to stop breaking the rules after a few warnings (punishments), they are removed from the game with a permaban because Riot no longer believes them capable of reform.","replies":[{"poster":"Kxnlei","date":"2019-07-31T05:58:23.463+0000","up_votes":1,"down_votes":3,"body":"If you're going to claim that I am FACTUALLY incorrect, provide the facts. Secondly, flaming someone is a way to vent and it's human nature. Simply calling it childish? Subjective and ignorant. Stacking chat restrictions is a great idea. AS I SAID: it lets the player get used to not using chat. Why don't they make it so after say, *x* amount of chat restrictions, you can no longer use text? Only pings. That way, no one has to lose money (which btw Riot commit fraudulent representation - but I won't get into that today) and no one has to experience that players toxic attitude. But also, making a new account definitely does negate the 'benefit' of banning a Summoner's account. Your argument in that piece was that 'riot don't lose money, they do'. So what you're saying is that Summoner is probably going to come back and give Riot more money, even after previously losing it to some trivial bad encounters.","replies":[{"poster":"KFCeytron","date":"2019-07-31T06:11:35.426+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Kxnlei,realm=EUW,application-id=ZGEFLEUQ,discussion-id=HNqZ79w3,comment-id=00020000,timestamp=2019-07-31T05:58:23.463+0000)\n>\n> If you're going to claim that I am FACTUALLY incorrect, provide the facts. Secondly, flaming someone is a way to vent and it's human nature. Simply calling it childish? Subjective and ignorant. Stacking chat restrictions is a great idea. AS I SAID: it lets the player get used to not using chat. Why don't they make it so after say, *x* amount of chat restrictions, you can no longer use text? Only pings. That way, no one has to lose money (which btw Riot commit fraudulent representation - but I won't get into that today) and no one has to experience that players toxic attitude. But also, making a new account definitely does negate the 'benefit' of banning a Summoner's account. Your argument in that piece was that 'riot don't lose money, they do'. So what you're saying is that Summoner is probably going to come back and give Riot more money, even after previously losing it to some trivial bad encounters.\n\nThe fact is that the vast majority of punished players reform after one punishment and are never punished again.\n\nFlaming isn't \"human nature.\" It's the nature of people who haven't learned how to interact with others in a civil manner. This is generally seen in children, who are still learning about the world around them. Thus, it isn't \"subjective\"; it's a plain fact. It's not \"ignorant\"; it's rather obvious.\n\nStacking chat restrictions _seems_ like a great idea, and it was tried. But it didn't work, so continuing to believe that it's a great idea is... odd, to say the least. I mean, they literally tried it. Why are you still praising it?\n\nRiot isn't committing fraud when they permaban an account. Players own nothing in LoL. Riot owns everything. When a player signs up to play, they agree to terms stating as much. When you buy RP, you're paying Riot to change a number in their system, which they graciously allow you to access until they don't want to anymore. They can revoke such access at any time and for any or no reason. That's right: they are totally within their rights to randomly select an account and permaban it. People would be outraged, of course, but it's not illegal for a private entity to restrict access to their private property.\n\nYes, others do have to experience a chat-restricted player's toxic attitude, because - as I said, but as you apparently didn't read - such players find other ways to grief when they can't do it via chat. This is not a guess. It is historical fact.\n\nMost permabanned players - as I said - don't make new accounts. Thus, permabans are largely effective.\n\nI don't know what you mean when you put the words \"riot don't lose money, they do\" into my mouth, but what I am actually saying is that permabanned players are probably _not_ going to come back. As I said - and I quote - \"Most permabanned players stop playing the game.\"","replies":[]}]}]}]}