{"poster":"oPuredo","date":"2018-03-30T07:59:44.919+0000","title":"Legal Trolling?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"I saw a game loading &quot;tip&quot;(?), which said we can &quot;competitively&quot; trash talk or troll.\r\nWhat the hell does that mean?\r\n\r\nGive me examples. Thanks.\r\n\r\nExtra question: Am I allowed to troll in the pre-game chat / in-game chat with fake scripts? Or will that get me banned? I&#039;d love to see how little kids react to that.\r\nE.g. \r\nautoaim=true\r\nsetcooldown=false\r\nbegin(&#039;{{champion:53}} .bot&#039;)","replies":[{"poster":"TheHobbits","date":"2018-03-31T22:48:18.667+0000","up_votes":2,"down_votes":0,"body":"Examples\n\nCompetitive trash talk:\n(Enemy interrupts you dancing or teleporting back to base) \n “How rude.”\n\n(Enemy tower dives you and loses the engage)\n“Greedy” \n\n(You die from a misplay)\n“That was silly.”\n\nTroll trash talk:\n(You nuke a squishy Mage as an assassain)\n“You are so sh*t”\n\n(Mentioning anyone rank after anything happens)\n“You bronze piece of ...”\n\n\n\nChoice of words is key.","replies":[{"poster":"Iloveyoubabygirl","date":"2018-04-01T10:17:42.348+0000","up_votes":1,"down_votes":0,"body":"> when the enemies tower dives you\n\nlmfao.keksides","replies":[]}]},{"poster":"WoadKethunt","date":"2018-03-30T10:31:32.580+0000","up_votes":1,"down_votes":1,"body":"the tip says competitive bm/trash talking is ok\n\ntrolling is iffy, if your trolling  is resulting in a unfair advantage for the enemy team (stealing camps/telling the enemy where your jungler is) that should be bannable, it use to be refereed to assisting the enemy team and it should still be a report able offense. if your just saying dumb shit in your team chat trying to bait out a response your not going to get punished unless your saying offensive stuff or unless you get reported to high hell over multiple games \n\nas for bm/trashtalking that means saying git gud, rekt cy@ and the likes after outplaying someone. even just telling someone \"you suck at the game\" is ok what is ok is saying \"your fucking garbage, uninstall and kys\". what isn't ok is when you get aggressive telling people to kys swearing at someone.\n\n if i get ganked and say in my team chat \"fuck me i got dicked\" thats fine, if i say in /all \"fuck you, your a dick\" thats bad\n\nyou can't get punished for dropping a \"?\" in allchat after killing someone its bm but not nearly bad enough to be ban-worthy. contrary to what people whine about on the forums its relatively hard to get banned\n\n\nwhen it comes to speach marcos i dont think its against the rules but if you assblast the chat you will get reported for it. but i dont see anything wrong with a chat marco to call your position in blind pick for you ","replies":[{"poster":"oPuredo","date":"2018-03-30T11:07:23.775+0000","up_votes":1,"down_votes":2,"body":">  its relatively hard to get banned\n\nI have to disagree.\n\nSo basically, I'm allowed to make people get angry and break the rules, then report them, as long as I don't use swear words or real life threats...\n\nFairly simple.\n\nThis is the dumbest rule/tip I've ever seen any game implement.","replies":[]}]}]}