{"poster":"Afterpay","date":"2018-10-27T08:01:46.880+0000","title":"what honor Level do you need for ranked rewards?","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"what honor level do you need for ranked rewards","replies":[{"poster":"Ninox","date":"2018-10-27T12:27:37.466+0000","up_votes":1,"down_votes":0,"body":"Nightjar is correct :) Honour 2. Unless you've received a punishment there is no way to be below level 2. Good luck on the rift!","replies":[{"poster":"GreasedLightning","date":"2018-10-28T23:00:40.711+0000","up_votes":1,"down_votes":0,"body":"hey seras ive been having issues with my honor level, any idea why its so much harder to raise honor level on an account with heaps of use as opposed to a new account?","replies":[{"poster":"Ninox","date":"2018-10-29T03:54:40.280+0000","up_votes":2,"down_votes":0,"body":"Generally this would occur because of what standing your account is in. While I don't know your accounts history, there isn't any other reason this should be happening so I'll elaborate.\n\nIt seems obvious, but to earn honour you have to actually be honourable, or at the very least neutral (which will offer slower progression but still some). You don't earn honour just by avoiding punishments. \n\nIt seems likely that on your main account you are being reported (valid reports, false reports don't do anything) for minor stuff reasonably frequently. Nothing that would earn you a punishment, but that constitutes dishonourable behaviour, thus preventing you from earning honour for those games. \n\nOn a new account you would have a fresh history, so some minor hiccups aren't going to affect your honour as much and you'll earn it faster. The stakes are also lower on a fresh account (people care less about losing) so the frustration factor tends to be lower, though I couldn't say if this applies to you.\n\nBasically, if you can improve your behaviour on your main, you'll start earning honour at the rate you do on your fresh account. Maintaining the same behaviour will result in progress on your fresh account slowing down as well.","replies":[{"poster":"Nightjar","date":"2018-10-29T10:36:42.811+0000","up_votes":1,"down_votes":0,"body":"I'm going to disagree with you on the 'honorable' behavior being far faster than 'neutral' behavior for climbing honour lvl.\nIt's more about number of games, getting honour is only slightly faster, despite what Riot might like you to believe.","replies":[{"poster":"Ninox","date":"2018-10-29T11:40:44.496+0000","up_votes":2,"down_votes":0,"body":"I can't speak for how much faster it is really, I know accounts that are positive levelled faster than accounts that said nothing at all, though not by a huge amount. That's only from personal experience and those on my friends list mind you. I can definitively say that salt lords level their honour a lot slower. I know a few people who, while their behaviour is always reasonably well below the punishment line, just aren't all that fun to play with and almost certainly see a lot of reports, and their honour is practically stagnant.\n\nAs for number of games, my honour progress was comparable to that of a friend who plays triple+ the games I do with similar behaviour, so I think it's more about consistency than games played, though number of games does seem to have a minor impact (he hit Honour 5 a week or two before I did). But again, that's only from personal experience, and honour is inherently tailored so I'm sure those experiences differ.","replies":[]}]}]}]}]},{"poster":"Nightjar","date":"2018-10-27T12:10:20.776+0000","up_votes":1,"down_votes":0,"body":"you need an honour level of 2 or more I think, which you have by default unless you've been toxic and inting.","replies":[{"poster":"Essembie","date":"2018-10-29T08:28:49.960+0000","up_votes":1,"down_votes":1,"body":"or if you get frustrated at a troll who intentionally ruins multiple games and then reports you because you asked them to pay your oncology fees because they gave you cancer with their trolling.","replies":[]}]}]}