{"poster":"xSleth","date":"2015-09-03T22:37:41.063+0000","title":"Kann mich nicht zum Chat connecten","subforum":"Melde einen Bug","up_votes":2,"down_votes":0,"body":"Hi also ich wollte nur fragen wieso ich mich nicht zum lol chat connecten kann mein internet funktioniert prima.","replies":[{"poster":"LuckingFegendary","date":"2015-09-04T13:18:01.132+0000","up_votes":2,"down_votes":0,"body":"Selbes Problem hier, die Lösungsansätze von xCillion haben leider nicht geholfen, nun muss man halt Teambuilder spielen....\n\nEDIT: Bei mir hat die Reparierfunktion geholfen.","replies":[]},{"poster":"HerrDerGeisel","date":"2015-09-08T23:19:53.007+0000","up_votes":1,"down_votes":0,"body":"Das gleiche Problem habe ich seit heute ebenfalls. Kaum, dass ich eingeloggt bin, habe ich die Meldung, dass ich nicht mit pvp.net connecten kann. Und irgendwann ist die Verbindung wieder da oder auch nicht.","replies":[]},{"poster":"xSleth","date":"2015-09-05T00:12:49.879+0000","up_votes":1,"down_votes":0,"body":"Danke an alle. Geht jetzt wieder !! {{summoner:31}}","replies":[]},{"poster":"Tundrag","date":"2015-09-04T21:17:24.586+0000","up_votes":1,"down_votes":0,"body":"Bei mir gehts auch wieder der routor hat ein update gebraucht einfach auf routor draufschalten und updaten vieleicht gehts wieder","replies":[]},{"poster":"Tundrag","date":"2015-09-04T09:10:21.007+0000","up_votes":1,"down_votes":0,"body":"hab das gleiche problem seit gestern bist du zufällig auch bei televersa ?","replies":[]},{"poster":"owndby Kev","date":"2015-09-04T00:31:26.939+0000","up_votes":1,"down_votes":0,"body":"Oder wenn Du in Chaträumen bist - das Auto Connecten ausmachen (=","replies":[]},{"poster":"xCillion","date":"2015-09-03T22:47:27.000+0000","up_votes":1,"down_votes":0,"body":"Grüße\n(ich brauch was anderes.. auf deutsch sieht das echt komisch aus.. aber egal..)\n\n\nFalls das Problem nur darin besteht das der client chat nicht connected, aber sonst alles super läuft auch ingame, versuch mal folgendes:\n\n - Öffne das Startmenü. Das kannst du über die Windows/Start-Taste tun.\n - Suche nach „Dienste“ und klicke auf Services.msc. Es kann sein, dass auch nur „Lokale Dienste“ mit einem Zahnrad daneben aufgeführt ist.\n - Suche den IP-Hilfsdienst heraus, rechtsklicke darauf und wähle Eigenschaften.\n - Dort wählst du unter Starttyp Deaktiviert aus.\n - Unter Dienststatus klickst du auf Beenden. Anschließend bestätigst du mit Übernehmen.\n\nFalls das nicht hilft, drück mal [hier drauf](https://chat.euw1.lol.riotgames.com:5223/) und sag mir was du siehst.\n(wenn du zum chat server connecten kannst steht da unter anderem sowas \"This XML file does not appear to have any style information associated with it. The document tree is shown below.\")","replies":[]}]}