{"poster":"Qase 1","date":"2016-03-23T20:28:29.644+0000","title":"Hasta aca llegue,  simplemente me canse.","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":1,"body":"La intencion es no ofender a nadie, acabo de jugar 4 partidas con kalista 3 en ellas ninguno de mi team queria ir soporte y termine solo en linea &quot;3 partidas&quot; y una ademas de unos cuantos reports no validos sin insultar ni hablar a nadie porque obviamente voy a perder linea y fedear, la cuarta partida  &quot;un soporte&quot; que me lashiteaba los minions y no dejaba jugar, mi pregunta es, &iquest;como se puede ser tan mala leche y basura en un simple juego?  no me imagino como sera en la vida cotidiana de estos &quot;nenes&quot; capaz exagero jaja pero yo simplemente quiero divertirme y la vez tomarlo como algo de serio al juego, es increible que de cada 10 partidas pueda jugar 2 bien o pasables, no me vengan a defender a capa y espada a el servidor las porque bien que mas de una vez les toco estos &quot;personajes&quot; vivo reportando y me vive tocando esta gente tan mala onda y a eso sumale los que no paran de flamear y denigrarte por el pais que sos o de como jugas, Gracias por el tiempo saludos.","replies":[{"poster":"Fiky","date":"2016-03-23T20:48:24.254+0000","up_votes":2,"down_votes":0,"body":"jugas nomales blind (a ciegas) o reclutamiento o sea normales o rankeds? \n\nhablando de ese tema, los que joden así a la gente en los juegos online son boluditos que no tienen otra satisfacción en la vida que molestar a los demás, parece cualquiera lo que digo pero es la posta, se sienten importantes pero es falta de atención que no le dan en la casa, obvio que hay quienes tienen el gen de la maldad","replies":[]},{"poster":"ZayDusk","date":"2016-03-27T20:55:20.583+0000","up_votes":1,"down_votes":0,"body":"yo puedo ser tu supp <3","replies":[]},{"poster":"Café Viennois","date":"2016-03-24T03:01:58.041+0000","up_votes":1,"down_votes":0,"body":"Yo igual me cansé, me aburrí que siempre esté la misma gente que te arruina la partidas. Recién yendo adc me tocó una sona que se armó full ap, nunca me ayudó absolutamente en nada, ulteaba mal, se dejaba morir y así fue como perdimos. Y no es sólo \"1 partida mala\", no... cada vez que entro a jugar siempre hay alguien que trollea, se va afk o cualquier otra cosa. Y de qué te sirve el report? de nada, porque a Riot sólo le interesa llenarse de plata los bolsillos y nada más. No intenta cambiar absolutamente nada, son increíblemente inútiles. \n\nAsí que mejor hice que me bannearan así no entro nunca más a ésta porquería de juego que tiene la peor comunidad en la que he estado, sinceramente ya me da asco todo lo referido a Lol.","replies":[]},{"poster":"ViirusSGameS","date":"2016-03-24T01:03:18.130+0000","up_votes":1,"down_votes":0,"body":"simple yo juego con amigos por skype y solo con ellos los findes porque trabajo.\npero lo mas divertido es jugar y trollearlos y escuchar sus puteadas,\nmaineo sup si queres agregame y algun finde jugamos :p","replies":[{"poster":"agusyagami","date":"2016-03-24T02:01:48.980+0000","up_votes":1,"down_votes":0,"body":"si trolleas... paso XD","replies":[]}]},{"poster":"Zed SSJ Blue","date":"2016-03-24T01:07:46.421+0000","up_votes":1,"down_votes":0,"body":"El League of Legends es un juego Genial,pero aveces luego de jugar Todos los días y soportar la gente,aunque intentemos negarlo,todos nos afecta en lo mas recondito de nuestros sentimientos (?.Pero hablando en serio,te recomiendo jugar con amigos por Skype Ts3 Curse o otras cosas y cagarte de la risa,no te lo tomes enserio en fin es un juego para divertirse,quemarse por los boluditos solo te estresa,no te quemes juga en premades por Skype y reite de todo.Salu3\n\n\n                                                                                                                                                                                                                                                                  -Tricknick LATAM Sur","replies":[]},{"poster":"abirdblue","date":"2016-03-24T00:14:24.081+0000","up_votes":1,"down_votes":0,"body":"agregame y te suporteo :3 \nno soy la mejor pero si es mi rol favorito \n{{champion:34}}","replies":[]},{"poster":"Fleur","date":"2016-03-23T23:32:34.786+0000","up_votes":1,"down_votes":0,"body":"Juga draft pick y el 99% de los casos boludeces como esas no pasan.","replies":[]},{"poster":"Burundanger","date":"2016-03-23T22:38:05.210+0000","up_votes":1,"down_votes":0,"body":"Agregame y te suporteo pap (?)\nSoy main support se podria decir, es la linea en la que mejor me desempeño y en la que mas me divierto, y es super divertido suportear kalistas <3 \nNunca falta la gente de mierda, pero depende que tanta suerte tengas. Yo tengo el mismo problema pero con los adc mediocres que parecieran ser lvl 5 :''''v","replies":[]},{"poster":"DieOrSovngarde","date":"2016-03-23T22:21:17.022+0000","up_votes":1,"down_votes":0,"body":"Si jugas armador de equipos, te tocan suports....","replies":[]},{"poster":"Maximus5130","date":"2016-03-23T20:32:04.959+0000","up_votes":1,"down_votes":0,"body":"Te la hago facil? hace como yo y muchas personas, juntate un team y juga con ellos siempre que puedas, si queres te suporteo aunque no me gusta mucho ir de suport (me gusta ir de suport pero no muy seguido pero voy). Maximus5130 Agregame y te suporteo si queres pero la unica opccion es que no flamees al team y mutees a todos y me hables por privado (/r). Si queres agregame y mandame mp con cualquier mensaje","replies":[]},{"poster":"StupidLoveStory","date":"2016-03-23T20:31:51.449+0000","up_votes":1,"down_votes":0,"body":"No juegues mas y ya, así son los juegos competitivos (sin generalizar)","replies":[]},{"poster":"Auren Seven","date":"2016-03-23T20:31:46.953+0000","up_votes":1,"down_votes":0,"body":"Queres que te suportee con mi smurf?","replies":[]},{"poster":"CW Skyfall ","date":"2016-03-23T20:34:54.275+0000","up_votes":1,"down_votes":1,"body":"es un chiste las","replies":[]}]}