{"poster":"kaboomblah","date":"2018-03-24T10:20:22.887+0000","title":"Don't offer supp fill your carry role","subforum":"Miscellaneous","up_votes":2,"down_votes":1,"body":"Rhetorical question: If they haven&#039;t learnt how to support yet, do you think they will be a good carry?\r\n\r\nHad a guy who said he wasn&#039;t that great at supp, that he got filled, so I offered to swap mid. He said it was his preferred role. He just completely stunk.\r\n\r\nThat&#039;s when I realised: &quot;Hey, hold on. What made me think that this guy who can&#039;t support can play any other role - no matter what he believes?&quot;\r\n\r\nDo not fall for the &quot;I got supp fill&quot; guy. He won&#039;t be competent anywhere else either, so do not give him a carry role.","replies":[{"poster":"Lord Sesshomaru","date":"2018-03-24T14:04:17.630+0000","up_votes":2,"down_votes":0,"body":"I think we can all relate to this.\nEveryone at some point has likely come across similar antics in champ select.\n\nFor me, champion select is just as much about figuring out the players as it is the champs.\nI like to have a good idea of how my team mates are going to act in game, so that I can best adjust for it.\n\nPersonally, I think you can tell a LOT about someone's ability and from the champion select screen. In my experience, you can tell who is most likely to be a competent player by how adaptable they are. I sometimes measure this in stages.\n\n______________________\n\n\n\n#Stage 1: Reading your own team comp.\n\nThis is the first thing people should be adaptable around; keeping your team-comp balanced. \nYou need to make sure your team has **AT LEAST:** _1 AD heavy champ, 1 AP heavy champ, 1 Tank._ Those are the _base requirements_. Everything other than that is flexible for me. Obviously I would prefer if the team became even better balanced by evening out sustained damage and burt damage champs, making sure we have an even spread of engage/poke etc etc. But as a baseline, all I ask for is _1 AD, 1 AP, 1 Tank._\n\nI don't care what their excuse is, if my team doesn't have at least that base skeleton, I will put absolutely 0 stock in any of their ability to perform in game, and will not trust them to make correct decisions at any point. Therefore, I will play incredibly selfishly when playing with these people, I won't go in unless I know I don't need their backup. I won't rely on them to help me take objectives, and I won't rely on them to follow up if I make a call. I will wait for them to do something and then play around it, or I will only choose plays that don't require relying on them knowing what to do. I will take kills, I will take full charge of the game, but expect none of them to follow my calls anyway.\n\n_______________________\n\n#Stage 2: Reading your lane counter.\n\nThis the second thing I judge people for adapting around. This is far from the most important step, however it is basic common sense, so It is one of the first things I look for after Step 1, when judging people's competence.\nLike Step 1, this is simple common sense: Maybe if they have picked Jax, I won't pick Udyr. Maybe if they have picked Fizz, I wont pick Lux. Etc.\n\nHowever this NEEDS to take 2nd priority after Step 1:\nE.g. Yes Teemo may counter Nasus, but if we are already heavy AP and have no tank, and you pick Teemo, I WILL mentally write you off!\n\nIf someone has completed both Step 1 and Step 2, I trust them with the basic functions of the game. I have relative faith that they wont hard feed, I'm mostly confident they'll be able to read objective importance, and I assume they know there is a minimap with the baddies' locations on it, somewhere on the screen.\n\nI will put a decent amount of trust in these players. Ill make calls if I see that no one else will, but overall I trust these people to know what needs to be done. And I trust them to put the same faith in me.\n\n_______________________\n\n\n#Step 3: Reading the enemy team comp.\n\nThis is more important than Step 2 imo. But its harder and so I'm _slightly_ more forgiving if people don't adapt around it. Hence it being the 3rd thing I judge people on.\n\nIf the enemy team keeps picking tanky champs, and I see our ADC change pick intent from Jhin to Kog, or our mid laner change from Akali to Azir. My faith in them will soar. Especially if they switch to a champ that is countered by their lane opponent! that shows me that they are considering the game as a whole, and not just the first 10 minutes of their 1 lane. If people are thinking like this in champ select, then I trust that their competence stretches into in-game decision making as well. And so will put myself in riskier situations knowing they will have my back.\n\nIf people complete Step 1, 2 and 3. They get my tick of approval, they are playing with the same level of awareness as I am, and no one can ask more than that! That is all the proof I need to put my faith and trust in this group of random strangers.\n\n_________________________\n\n#Step 4: Champ synergy within the team.\n\nNow we are getting into the realms of fiction, _(at my elo at least)_, if my team mates are capable of adapting around all previous steps AND THEN also consider champion synergy, I put myself in their adept hands. Ill follow their calls without question, and back them up in their plays. I have the upmost faith in their ability.\n\nIm not talking about braindead synergy like Yasuo/Malphite or Xayah/Rakan that everyone knows without even thinking. That doesn't help me figure out a person's ability.\n\nWhat I'm talking about is actual thought, thinking about how the game will play out.\n\n**E.g.** _If the enemy picks Miss Fortune, and our ADC puts in pick intent of Ezreal, but the enemy team keeps picking tanky champs, and they change intent to Kalista, but then see me pick Taliyah and change again to Vayne._\n\nThat shows me that they are considering all options, they're predicting MF's zone control and picking high mobility to escape from it, then when the tankiness factor is added, they're considering ways to play around Miss Fortune while keeping an anti-tank strategy in mind, then when they see Taliyah roams come into the equation, they play that scenario out in their head and pick someone who can play around MF, deal with tanks, AND optimise Taliyah's abilities for their own gain, all with the short time of champ select. If they can do that, I have no doubt that their critical thought translates into game sense as well.\n\nAnything above this step is over my head and I probably wont even pick up on the fact that you've done it. Its you that should be worried about me now.\n\n\n\n___________________________\n\n\n\n#Warning Signs!\n\n\nThere are things that set off red flags for me, that override the steps and instantly blacklists a player in champ select for me.\n\n**No. 1** on this list is what this discussion is about. _\"I can't play X position.\"_\nYou say that to me in a ranked game. You're dead to me.\n\nIve been playing for over 6 years, I expect to me matched with people who at least know the basics of each position, _(theres only 5, it's not rocket science)_.\nIf you don't know how to play support, then it means you don't know how the position works, if you don't know that, then you don't know the dynamics of ADC. and if you don't know that, that's already half the team that is a mystery to you. How are you supposed to rely on your team mates if you don't know what they are and aren't capable of?\n\n_________________\n\nAnother red flag is instapicking a champ. If you're not first pick, and you have had Zed in your pick intent since the moment we got into champ select, and when it gets to your turn to pick, you don't even let 1 second go on the timer before clicking 'lock in'. \n\nThat raises my suspicions. \n\n_________________\n\nSomething else I don't like is One-Trick-Ponies. This sends alarm bells off in my brain.\nSure, you might be excellent mechanically at that 1 champ _(maybe even 2 champs)_. But **A.** you're not thinking of ether team comp, and **B.** you have less _(or no)_ experience with many of the other champions. How are you supposed to get a feel for the availability of Azir's soldiers if you haven't given him a decent go? How are you supposed to know the range on Morgana's Q down to a T if you only ever play Trynd top?\n\nNot to mention you are 100% useless if your champ _(usually a cancer champ anyway, with a high ban rate)_ gets banned. \n\n1-tricks are always a risk. And I like to minimise risk.\n\n_________________\n\nSomething else that also makes me a little wary is just the champion you pick.\nIf you pick Master Yi or Tryndamere, I'm happy that we have that BS on the team, but I'm also a little cautious, because the people who pick those kind of champs, are more often than not people who either **A.** can't play other champs, or **B.** are playing them because they're 'free win' champs, and don't know how to play them, but got smashed by one last game and just assume that having one on the team means a win.\n\nIf you pick Yasuo, it makes me worry becasue Yasuo usually has a track record of 50%. Either he's a frickin god and you might as well just go make a cuppa while he wins you the game, OR he _thinks_ he's a god and rage-quits this _'trash team, wasting his time'_ when he reaches the score 0/13.\n\nOn the other hand, if you pick someone like Syndra or Viktor, my hopes go up. Not a huge amount of people play those champs, and they aren't easy to begin with. So if you are playing them, its probably because you're confident with them, and have a decent amount of play-time under you belt. \n\nIt's nothing personal, each champ just has its own stigma.\n\n___________________\n\n#Conclusion\n\nOverall in a ranked game, I don't care how mechanically good you are, all I care about is that you can make competent decisions. And if you can't, I want to know about it in advance, before it gets me or someone else killed! That is the sole purpose of this whole process. It's not to be mean or critical, it's to give me an idea of what you're most likely going to do, using only the limited information I have. So that I'm prepared and can plan around it.\n\nIf you feed Darius because he had better skill than you and outplayed you in every engage, I don't mind at all _(honestly!)_. Thats okay, it's always a 50% chance that your opponent will be better or worse than you, and you can only improve from it. What I do mind, is you farming jungle in top lane instead of pushing tower, when its a 4v5 bot lane. Or you consistently overstaying in pushes.\n\nSome people value mechanics more. some value game sense more.\nBoth can win or lose games. I just happen to value the latter more, and so I try to get a good feel of how my team mates will perform in that sense, before the game even begins, so I can plan. And I'm sure that they are doing the same with me.\n\nWow that was long... \nOops. Good luck! xD","replies":[{"poster":"kaboomblah","date":"2018-03-24T14:38:58.350+0000","up_votes":2,"down_votes":1,"body":"Well said! Very comprehensive.","replies":[]}]},{"poster":"Bookbash","date":"2018-03-25T12:08:51.595+0000","up_votes":1,"down_votes":1,"body":"You could check op.gg/multi before the game to see where the noobs are in your team. It helps with dodging and identifying stuff that will happen in the game.\n\nGenerally though, if people can't play every role competently, they shouldn't be playing serious games of ranked.","replies":[{"poster":"Iloveyoubabygirl","date":"2018-04-01T12:56:35.242+0000","up_votes":1,"down_votes":0,"body":"checking op.gg in oce pub is equivalent usefulness of splitting hairs on a silverback gorilla","replies":[]}]},{"poster":"Sulbatamol","date":"2018-03-31T13:45:00.097+0000","up_votes":1,"down_votes":1,"body":"When it happends just dodge unless the person has a good record in a particular lane. But supp is not a bad role becuz you can create a beast time to time","replies":[{"poster":"Iloveyoubabygirl","date":"2018-04-01T12:55:07.695+0000","up_votes":1,"down_votes":0,"body":"good sups will roam on elise/alistar/twitch else thats why bad ppl traditionally fill sup role, that or you wanna play blitz one shot kek","replies":[]}]},{"poster":"18cent","date":"2018-03-24T11:58:14.059+0000","up_votes":1,"down_votes":1,"body":"if you cannot play every role you should not play ranked, it absolutely tilts tf out of me when someone says pls no support i main mid then they end upv going 1-5 before 10 mins like um ok.","replies":[{"poster":"oOMoonLordOo","date":"2018-03-24T14:12:30.391+0000","up_votes":1,"down_votes":1,"body":"People that played every roles. They are know to have atleast 3 roles they will FEED in. To say that you can play every roles and climb, it would be saying this game is too easy, i can climb with every single position; That is PURE shit and you know it.\n\nThere are roles people just cant play well. Dont expect a tank jgler or top main to play adc well and not feed. He would servely lack the knowledge to lane 2v2 due to, insufficient games played as that role, champion play time, and grasp on match up.","replies":[{"poster":"kaboomblah","date":"2018-03-24T14:46:59.426+0000","up_votes":1,"down_votes":1,"body":"Really? I don't feed in any role.\n\nI lose lane sometimes in every role, but I never feed. I understand match-up. If I get rolled, I go defensive items and play conservative to stop the bleeding, and will play macro game to be relevant again.\n\nI am 100% reliable in every role.","replies":[{"poster":"oOMoonLordOo","date":"2018-03-25T00:54:40.436+0000","up_votes":1,"down_votes":0,"body":"Being a none factor untill you get items to be relevant due to being set back is not a good way to climb. If anything, you are reliance on your team mate to win. And not feeding. \n\nYour 3 weakest role is as expected. worst to best. adc>top>support. Your win rates on those roles are lower compare to your mid and jgl; given the # of games played.","replies":[{"poster":"Nightjar","date":"2018-03-25T03:26:00.445+0000","up_votes":1,"down_votes":0,"body":"last season I had my main, the support>jungle>top, and a smurf in top>mid>adc. I did this to test myself and my capabilities, since I didn't want to be a 'support only' player. At the end of the season both accounts had around the same rank (Gold 5) give or take a few lp (I have since inexplicably gotten worse and both accounts have sunk to mid silver, but that's another story).\n\nThat said I felt most comfortable in support/top and a bit of jungling if I had to take the average across both accounts, and I'd say that in toplane, with the exception of riven, I still mostly played tanks. Anyway, I found my performance in adc was very hit or miss, and sometimes on my 'not support or jungle' smurf, I would feel like I could carry harder playing support, but I did kind of play 5 roles. I wasn't good at it, and there was only a handful of champions I could feel like I was good at (Janna, Nautilus, Rammus, Renekton, Veigar, Victor).\n\nAnyway I feel alot of what makes me a player is gameknowledge and macro since mechanics is kind of nonviable on my laptop.\n\nI don't think it's out of the question to have a 'fill type player' but I tend to believe that such players, tend to have very definite things they aren't good at. For me Leblanc, Lee sin, Zed, Vayne and Yasou all feel like champions that I will never be able to learn, but there are also a wide range of champions that I more or less understand the basics of, and a few that really click.\n\nEveryone has different strengths and weaknesses, and also Tank toplaner is basically support, but now instead of trying to roam and control vision, it's mostly about freezing, denying and drawing pressure top, and occasionally 1v2ing when the enemy team screws up.","replies":[{"poster":"Shana Rei","date":"2018-03-25T23:31:12.413+0000","up_votes":1,"down_votes":0,"body":"I climbed 3 accounts to plat 5 this season so far. First account was my main role which is support. Second account I played top and third account i played jungle.\n\nI haven't played mid to plat but I play a mean velkoz/annie/zyra/karma so I'm confident I could climb a mid only account to plat. The only role I genuinely think I'd struggle to get out of silver is, is adc. I ALWAYS ask to swap that if I get it, everything else is none factor. I can play all lanes to at least plat level.\n\nFor support I played Janna/Taric/Velkoz. For Top I played Fiora/Taric/Gnar and for Jungle I played Evelynn/Skarner/Taric. In that order preference to matchups.\n\nAll of my top lane promotion games (to get in to plat) I played on Taric.\n\nIf I have to play ADC I play MF, she is the only one that I can remotely pilot.\n\nI do agree that trading is tilting if they can't do well, especially from someone decent in every position. I know being an every-man isn't good and probably the only role I could climb higher than plat is jungle. Ironically it's my least preferred role but I do the best at it? Makes sense lol","replies":[]}]},{"poster":"kaboomblah","date":"2018-03-25T04:36:35.791+0000","up_votes":1,"down_votes":0,"body":"I am a support and top main.\n\nWith ADC, I am a bit crap. Just farm and close game - but never do much damage.\n\nIf you watch me play support, your jaw will hit the floor from my mechanics - especially Thresh. I am crazy.\n\nMid and Jungle are my new roles. I am having a lot of fun with them. They seem like OP roles for climbing because you can bring your team back by yourself. As support, forget it - if your carries are under-performing, there is really not much you can do.","replies":[]}]}]}]},{"poster":"kaboomblah","date":"2018-03-24T12:14:44.737+0000","up_votes":1,"down_votes":1,"body":"Yeah, so tilting when you see them feeding over and over again. Impossible to stay pozzo.","replies":[]}]}]}