{"poster":"kaboomblah","date":"2016-11-05T01:32:52.205+0000","title":"OCE Things - Top","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":1,"body":"By far the easiest and most important lane. But that means nothing for OCEtards.\n\n#1 UNDERSTANDING MATCH-UP\n\n&quot;Hey, Malph, [INSERT ONE-DIMENSIONAL, EARLY-KILL-DEPENDENT, COMPLETELY-NULLIFIABLE-WITH-A-BIT-OF-MACRO-PLAY CHAMP NAME HERE] is useless if you don&#039;t feed and snowball them. Feel free to fall behind on CS, we don&#039;t mind. Just keep up in levels and try to keep your turret somewhat healthy. You will be much more useful come mid-game, given you haven&#039;t given [INSERT ONE-DIMENSIONAL, EARLY-KILL-DEPENDENT, COMPLETELY-NULLIFIABLE-WITH-A-BIT-OF-MACRO-PLAY CHAMP NAME HERE] the capacity to 3v1 in mid-game or just completely swing a team-fight singlehandedly.&quot;\n\n&quot;Okay, I&#039;ll try.&quot;\n\n&quot;Not try - do. Like, no-one will judge you for being behind in CS. Just don&#039;t give up levels and kills. Try not to let the turret bounce waves if possible - but that&#039;s an afterthought. That is [INSERT ONE-DIMENSIONAL, EARLY-KILL-DEPENDENT, COMPLETELY-NULLIFIABLE-WITH-A-BIT-OF-MACRO-PLAY CHAMP NAME HERE]&#039;s one win condition.\n\n&quot;Sorry, I gave FB. I really wanted that cannon minion.&quot;\n\n**Five minutes later**\n\n&quot;Sorry... wow, he/she is so strong... I just wanted to trade a bit. Jungle, can I get a gank?&quot;\n\n&quot;[INSERT ONE-DIMENSIONAL, EARLY-KILL-DEPENDENT, COMPLETELY-NULLIFIABLE-WITH-A-BIT-OF-MACRO-PLAY CHAMP NAME HERE] can probably 2v1. He/she is level 10, we&#039;re level 7...&quot;\n\n#2 MAP AWARENESS\n\n&quot;Hey, Malph, I got a cheeky ward behind their bot lane. We&#039;ll turn the aggression on. Come in when you see them commit.&quot;\n\n**Minute after no TP play has been made**\n\n&quot;Sorry! I didn&#039;t see the ward! I didn&#039;t know what you meant by &#039;behind their bot lane&#039;.&quot;","replies":[{"poster":"SIy Marbo","date":"2016-11-05T03:22:53.403+0000","up_votes":1,"down_votes":0,"body":"Top isn't the easiest lane, playing adc in laning phase is the easiest role (changes later on). However these are mistakes that people make everywhere, especially in low elo. Top lane is the most fragile lane of them all, once a small lead is made by one of the laners it's nearly impossible to make it back without serious jungle intervention (the good ol' double gank after they TP, for example. Once you start losing lane to a Kennen, Jayce, Irelia, Nasus etc it becomes almost impossible to make that lead back. There is scarcely anyone to help you. \n\nI'm a top main in Plat 2 elo and I can tell you that even one slip up in top is it for the laning phase. \n\nAnyway it sounds like you're angry at one type of player, but just be rational about it.","replies":[{"poster":"kaboomblah","date":"2016-11-05T04:07:31.145+0000","up_votes":1,"down_votes":0,"body":"Top is the easiest lane, ADC being second. I 1,000,000% prefer Support because it's so intricate and fun, but I got sick of being Silver so I resorted to spamming top and ADC. As soon as I hit Gold, I stopped caring again and went back to Supporting.\n\nIf I solely played Top and ADC, I'd be a Challenger.","replies":[{"poster":"KawtYouNow","date":"2016-11-06T09:37:59.461+0000","up_votes":1,"down_votes":0,"body":"this is a load of crap. Im sorry but it is. Firstly, no you wouldn't be challenger get your head out of your arse mate. Secondly, i would agree adc is the easiest role to play but it doesn't mean \"oh adc and top take no skill\". I felt like you were insinuating that from everything you've said here and its not true at all. I think you're really just exaggurating a bit.","replies":[{"poster":"kaboomblah","date":"2016-11-07T05:57:03.635+0000","up_votes":1,"down_votes":0,"body":"I would be Challenger if I played Top and ADC only. I guarantee it.","replies":[{"poster":"SIy Marbo","date":"2017-01-20T22:34:41.094+0000","up_votes":1,"down_votes":0,"body":"No. I don't think you realise the actual difference between Gold and Challenger. It's monumental, even Diamond and Challenger are completely different.","replies":[]}]}]}]}]}]}