{"poster":"kaboomblah","date":"2018-06-16T17:13:37.096+0000","title":"I can't help but feel cursed","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":1,"body":"Any game that I win, I have to absolutely hard carry out of my mind.\n\nAny game that I lose, it&#039;s because i was unable to do the above.\n\nLook at my match history. I can&#039;t get help from any other role. If one other role could just hold their own, I could climb. But seriously, every other lane/role loses.\n\nI know it sounds like an almighty whinge, but it isn&#039;t. Check my match history. I am literally getting Tops and ADCs that die 10+ times in a 20-odd-minute game.\n\nJust use today's games as an example. I am highest damage, highest kills, and literally the only one who is matching or out-levelling the enemy. I had a game where every other role was 2+ levels behind their counterpart.\n\nIs Riot punishing me like this instead of giving me a chat restriction or some shit? I feel so tin-foil-hat even thinking it, but... how... why... how am I getting such zeroes for teammates?","replies":[{"poster":"WandererYoshinon","date":"2018-06-26T12:04:12.493+0000","up_votes":1,"down_votes":0,"body":"Going off of this, it looks like you're a mid lane main which means you have all the initiative in the world to stop this from happening. It sucks that it happens but if you, instead of trying to carry hard, maybe roamed a a lot instead and gave your team the tools to carry with you, you'd probably see a significant increase in winrate.","replies":[]},{"poster":"Zeekie","date":"2018-06-19T01:17:19.900+0000","up_votes":1,"down_votes":1,"body":"Unfortunately this game is actually ridiculous, it only takes one person in your team to lose a match. The state of the game is so unhealthy, it doesn't even matter if you're the best player on your team that gets fed, you simply cannot carry. Not to mention the matchmaking BS that occurs in ranked. The algorithm is actually dumb that you can't proliferate a long winning streak without having people in a completely lower rank for example (4 people in your team are Silver 3 + one Bronze 2 while the other team has one Gold 5, three Silver 3's and one unranked). \n\nThere's no quality of life improvements to make it easier for people to be put in teams where all individuals are of equal skill. Riot knows this, they do nothing about it and are happy to say we try our best to make sure matchmaking is fair in ranked but on the rare occasion it would skew one team in favour over the other - which by the way happens all the time.","replies":[{"poster":"Bookbash","date":"2018-06-19T01:50:34.134+0000","up_votes":1,"down_votes":0,"body":"Don't worry, [League of Memories](http://leagueofmemories.com/index) is coming soon.\n\nHere is a really good video [explaining why the real gamers are quitting the game](https://www.youtube.com/watch?v=iqem7TI0XR4).","replies":[]}]},{"poster":"HeavyLift","date":"2018-06-18T13:52:16.629+0000","up_votes":1,"down_votes":0,"body":"Add me up, i'm happy to duo. Can help each other out. \n\nHeavylift","replies":[]},{"poster":"Bookbash","date":"2018-06-18T00:43:13.048+0000","up_votes":1,"down_votes":1,"body":"It's been like this for a while now - and why popular streamers have quit the game.","replies":[]}]}