{"poster":"kaboomblah","date":"2017-02-10T23:16:12.604+0000","title":"Support and Jungle, stop doing this, especially when your team is behind","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":1,"body":"Don&#039;t go into a lane that has a huge minion wave and just tax the entire wave. Ping it for a carry. If it&#039;s about to crash into the turret and circumstances permit, prevent it from crashing by absorbing damage and aggro until the minion wave arrives. \r\n\r\nI&#039;m sorry, but this gold simply does not belong to you.\r\n\r\nToo often have I seen this poor ADC, who is quite behind, go to farm a substantial wave and there&#039;s a jungler absolutely smashing the shit out of this wave as well, taking half the CS with him. You know you&#039;ve been that disgusting all-damage-build Lee Sin just E&#039;ing away 15 ranged minions, Q&#039;ing away the cannon. It&#039;s so disgusting to watch.\r\n\r\nSupports - I know some of you are completely and utterly lost in this role, but there is no need to hold your ADC&#039;s hand while they are farming a big wave that has pushed all the way to the second turret. You should be out there warding and sweeping. If you are concerned that your ADC suffers from over-extenditis, then ward for them instead of hovering around them.","replies":[{"poster":"Nightjar","date":"2017-02-10T23:36:36.837+0000","up_votes":1,"down_votes":0,"body":"problem is some adcs don't have rapid waveclear, or just don't have the same levels of movespeed across the map as a jungler or certain supports have, and I get tired of my adc always being somewhere off to the side slowly clearing out a wave while a teamfight is going down mid or around the baron, or alternatively, the adc stays mid and farms there but someone needs to clear side waves and set them to accumulate and push back and I don't see many adc mains in low elo who understand how to do this by leaving a certain number of enemy minions alive and yet we still need to address this issue. A huge minion wave is alot of map pressure to be resolved, and the jungler and sometimes the support or toplaner (all depending on the teamcomp) is usually the best equipped to deal with this wave.\n\nAlso greedy adcs who start pushing down a lane thirsty for cs. I can ward up all I can and it still won't matter if you get cut off or extend beyond where I can ward and sweep effectively. Especially if we've lost alot of towers and map pressure. I have 3 trinkets and a Control ward in my inventory also a sweeper. I can't ward an entire side of the map alone, I can cover common choke points or sources of likely ambush when the team is moving as a whole, but this isn't nearly as much warding coverage as you adc mains think it is. Even standing in a cut off just outside of xp range but within a protective distance so I can save the adc (which puts me behind in experience and gold but does help you catch up in levels) gives a little extra vision but doesn't give me enough vision control to make me feel safe with you splitpushed.\n\nAlso around lategame when a leesin extends to push out a huge sidelane minion wave, he can actually get to it safely alot easier than a far less mobile and squishier adc can, at least without the support (and or the tank) to escort them there, and this basically moves the team to another side of the map which may be bad if we're trying to contest baron or dragon.","replies":[{"poster":"Nightjar","date":"2017-02-10T23:50:27.656+0000","up_votes":1,"down_votes":0,"body":"I will admit I don't ward as much as I should, still working on improving in this area, but your argument doesn't take into account alot of the vulnerabilities and costs of an adc in a sidelane. Sidelanes are dangerous and hard to ward and can force the team to have to move with you, whereas whilst a little inefficient, having our toplaner like renekton or tryndamere, jungler like lee sin, zac or shaco or waveclear support like morgana, zilean or lux, to clear it out can just be more efficient in a range of situations and less likely to have someone die on our team when the wave is forming at around 1st tier tower (the usual time to clear out a massive minion wave before the enemy tries to pressure the other side of the map).","replies":[]}]}]}