{"poster":"Saikoo","date":"2016-05-31T01:05:42.801+0000","title":"Les vengo a contar mi historia ( sobre un flamer que casi hace llorar a un amigo)","subforum":"Charlas Generales","up_votes":4,"down_votes":4,"body":"En esta historia hay ma&ntilde;as palabras ( como me decian de chiquito) si eres sencible o sufres de odioalosflamerciteser no te recomiendo que lo leas  \r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n.\r\n* empieza la partida y uno de mis amigos gana adc {{champion:67}}  , mi padre supp {{champion:111}}  y mi otro amigo top {{champion:31}}   , llega este jugador y dice gane adc y pickea {{champion:222}}   y hasta mi padre que jamas me defiende en el lol dice no el otro gano adc , luego de eso el otro jugador dice adc o troll y mi amigo se va mid {{champion:45}}   , yo iba jungla {{champion:102}}  , comienza la partida y hago los campamentos sin ayuda de nadie ya que el {{champion:31}} se quedo dos segundos afk y yo no lo podia esperar muchoy la adc empieza shiva noob minuto 1 de la partida y ningun gankeo pasa el tiempo no hacen la primera sangre y empieza &uml;petes&uml; (no me gusta decir esa palabra pero eso dijo ) y sigui&oacute; as&iacute; hasta el minuto 10 diciendo no veo blue y ella era la adc osea re cualquiera  y empezo con la famosa frase de todo buen flamer hijo de puta tu mama se muri&oacute; de sida por verte jugar  ( enfermedad muy grave con la que no se puede molestar )  y un amigo que un familiar esta sufriendo una enfermedad grave se puso mal y se fue de la partida por que ya no aguantaba y la adc se puso a flamear en el /All nos cansamos perdimos la partida y se llevo 4 reports que espero que la banen de por vida a este  ser humano   , yo se que juge mal pero env&eacute;s de ayudar o guiar flamea y lastima gente por que si  .\r\n\r\nasi salio nuestro equipo \r\n{{champion:102}} 5/12/4\r\n{{champion:222}} 7/7/5\r\n{{champion:111}} 4/9/8\r\n{{champion:45}} 10/9/5\r\n{{champion:31}} 0/5/0 ( su build era {{item:2009}} {{item:1054}} {{item:3010}} )","replies":[{"poster":"vaVav","date":"2016-05-31T01:16:58.271+0000","up_votes":2,"down_votes":1,"body":"Me pasó algo similar, estaba en partida, cuando uno de mi team le dijo a otro: \"O aprendes a jugar o andá y morite de cáncer\". Yo quedé re mal por que por esa época, un primo mio sufría de leucemia. Entonces le dije: \"Tampoco hace falta meterse con esa enfermedad, tengo un familiar que la padece\", a lo que me respondió \"¿Crees que me importa?, ¿crees que voy a sentir lastima por alguien que no conozco?\"\n\nNo jugué en casi toda una semana después de ese bajón que me dio ese jugador.","replies":[{"poster":"Green jester","date":"2016-05-31T06:35:31.162+0000","up_votes":2,"down_votes":3,"body":"porque no desearle lo mismo? no es necesario que algo asi te afecte, puedes meterte con su familia tambien.","replies":[{"poster":"vaVav","date":"2016-05-31T22:28:23.553+0000","up_votes":2,"down_votes":0,"body":"Es lo mas inmaduro y estúpido que podría hacer.","replies":[{"poster":"Green jester","date":"2016-06-08T03:10:42.099+0000","up_votes":1,"down_votes":0,"body":"na","replies":[]}]}]},{"poster":"Bot Oro","date":"2016-05-31T01:51:49.596+0000","up_votes":2,"down_votes":2,"body":"dejaste de jugar una semana solo por algo que alguien te dijo en un juego ??","replies":[{"poster":"Adheliøs","date":"2016-06-01T00:30:47.178+0000","up_votes":1,"down_votes":0,"body":"Amigo, no todos somos iguales, hay gente que es sensible a ciertos temas, que a ti no te afecten no quiere decir que a nadie deba afectarle \"solo porque es un juego\", los flamers son lo peor que hay, curiosamente siempre hay uno que otro flamer que sin saber nada de mi vida le desea enfermedades a mi madre que ni siquiera vive,  a veces es difícil soportar ciertas cosas :)","replies":[]},{"poster":"vaVav","date":"2016-05-31T02:10:33.779+0000","up_votes":2,"down_votes":2,"body":"No solo es algo que te digan, luego de eso viene la pena. Ojalas no pases por el sufrimiento de que de lo único que hablen en la familia es de últimos momentos..","replies":[{"poster":"Bot Oro","date":"2016-05-31T02:16:07.511+0000","up_votes":2,"down_votes":2,"body":"y quien dice que nunca pase por algo asi??? ademas amigo es solo un juego :/ y ponerse tan mal solo por eso \nPD:Eso de si crees que voy a sentir lastima por alguien que no conozco el tiene toda la razon :s(por lo menos para mi)","replies":[{"poster":"vaVav","date":"2016-05-31T02:58:00.841+0000","up_votes":1,"down_votes":0,"body":"No lo digo por el juego, me chupa un huevo el juego, lo que dijo hizo que me sienta mal, por que diga por donde lo diga, lo importante es lo que dijo.\n\nPD: Sienta lastima o no, un comentario así hay que ahorrárselo.","replies":[]}]}]}]}]},{"poster":"wintermoon","date":"2016-05-31T14:53:49.626+0000","up_votes":2,"down_votes":0,"body":"A mi amigo le paso algo similar,estabamos jugando una partida cuando de repente uno del otro team se puso a insultar asu madre,el me conto que casi llora xq su mama había muerto hace poco.No se como es que esta gente es capaz de decir cosas asi.","replies":[]},{"poster":"S2NE","date":"2016-05-31T14:48:39.434+0000","up_votes":1,"down_votes":0,"body":"Mutealo capo\n\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Kput","date":"2016-05-31T14:43:17.244+0000","up_votes":1,"down_votes":0,"body":"No soy de insultar a la gente, pero encuentro que este tipo de post están totalmente de más, no es por defender al tipo ese, pero realmente no sacas nada con venir a llorar al foro y si son tan sensibles mejor juegen algo off line donde no deban tener que lidiar con gente, ya que si no saben manejar cosas así necesitan un replantearse si pueden jugar cosas online.","replies":[]},{"poster":"WE Cat","date":"2016-05-31T07:53:21.506+0000","up_votes":1,"down_votes":0,"body":"con razon flameaba jinx xd","replies":[]},{"poster":"lanchi123","date":"2016-05-31T06:37:44.378+0000","up_votes":1,"down_votes":0,"body":"No entiendo cual es la razón del post. No pretendo naturalizar los insultos en las partidas pero lamentablemente es moneda corriente. \n La queja por lo flammer, troll o por el instalock?\n Y con respecto a quienes consideran que hay inmadurez en dejarse afectar por los insultos si se consideran tan ''adultos'' deberían saber que todos asimilan las agresiones de distintas maneras así como varios compartieron que les afecta mucho a otros simplemente les da igual por lo que deberíamos tener más tolerancia con los jugadores más sensibles (sin dramatizar, obviamente)","replies":[]},{"poster":"Eskiel","date":"2016-05-31T02:24:35.510+0000","up_votes":1,"down_votes":0,"body":"Mute","replies":[]},{"poster":"Hellkus","date":"2016-05-31T02:20:14.653+0000","up_votes":1,"down_votes":0,"body":"existe el comando mute amigo, la gente es muy mala y de malos sentimientos y eso no va a cambiar, solo tienes qu ignorarlos y listo problem a solucionado. saludos\n","replies":[]},{"poster":"Yrox the Third","date":"2016-05-31T01:32:19.802+0000","up_votes":1,"down_votes":0,"body":"Mute y report,  con eso estas listo.","replies":[]},{"poster":"Whitesse","date":"2016-05-31T01:21:34.737+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"iCasteGoDx","date":"2016-05-31T01:18:21.495+0000","up_votes":1,"down_votes":0,"body":"OK","replies":[]},{"poster":"Runth","date":"2016-05-31T03:02:09.082+0000","up_votes":1,"down_votes":2,"body":"ok, q quieres, un abrazo para quitar tus lamentos por una partida? madura!!!","replies":[]},{"poster":"PoMeLiTox","date":"2016-05-31T01:18:58.299+0000","up_votes":2,"down_votes":6,"body":"***","replies":[{"poster":"vaVav","date":"2016-05-31T01:26:22.000+0000","up_votes":2,"down_votes":3,"body":"¿Son de nacimiento o los adquiriste luego?","replies":[]}]}]}