{"poster":"KAID0","date":"2017-01-22T19:58:47.024+0000","title":"Help me ban these players..","subforum":"Player Behavior","embed":{"description":null,"url":"http://imgur.com/CW9LR0Q","image":"http://imgur.com/CW9LR0Qs.png"},"up_votes":1,"down_votes":0,"body":"i have been getting so much toxic players its actually unreal every game i play someone has BM, i have a few snapshots at the end of the game, it would be nice if a riot employee would check the ingame chat because they were even worse  (don&#039;t let these players get away with being so toxic)\r\n[](http://imgur.com/CW9LR0Q)","replies":[{"poster":"Kei143","date":"2017-01-22T20:01:32.170+0000","up_votes":2,"down_votes":0,"body":"if you reported them then that's enough for the system to detect their toxicitiy.\n\nKeep in mind that you won't see a punishment notification unless your game was the one that punished them, not while it is building towards their case.","replies":[{"poster":"Zezockary","date":"2017-01-22T20:09:40.211+0000","up_votes":1,"down_votes":0,"body":"Basically the post I am replying to is right. Riot believes that allowing people to reform is extremely important to building a fair system, so it will take a couple games of behavior like this for them to be punished, probably a chat restriction for this level of toxicity, and then they will rise through the tier system to a permaban if they continue their toxic behavior.\n\nThe best thing you can do is mute, report, and move on. Best for the system, best for Riot, and best for your mental well being.","replies":[{"poster":"KAID0","date":"2017-01-22T20:34:17.962+0000","up_votes":1,"down_votes":0,"body":"yea im going to take a break and just mute the enemy team next game","replies":[{"poster":"Kei143","date":"2017-01-22T21:22:08.573+0000","up_votes":1,"down_votes":0,"body":"oh that was the enemy team? they just salty and trying to tilt you off your game.","replies":[{"poster":"KAID0","date":"2017-01-22T21:36:02.495+0000","up_votes":1,"down_votes":0,"body":"they won the game... :( they are some toxic players lol it was really bad in the ingame chat","replies":[{"poster":"Zezockary","date":"2017-01-22T22:04:18.305+0000","up_votes":1,"down_votes":0,"body":"To be completely honest, tilting the enemy team is a very good tactic from the standpoint that \"anything that helps you win is a good thing\". If they are tilted they are likely more frustrated and therefore will make more rash decisions which in a strategy game is a good way to lose.\n\nHowever that does not make it right, I would suggest muting and reporting anyone doing that and doing your very best to ignore enemies doing it. I like to make it into a joke if at all possible, typing back to them things that would make them laugh. It helps my team not get frustrated (its hard to be mad if you are laughing) and it makes the enemy realize \"we aren't falling for your stuff so stop trying\".\n\nIn a recent game the jax on our team in an aram match jumped into the enemy team when our team was not around in an attempt to stun them and finish off a couple of low people. When he failed a member of the enemy team said, \"jax, you are hilarious.\" I replied \"I know right? Dude fights with a lamp post.\" They friended me after the game XD","replies":[]}]}]}]}]}]},{"poster":"Mus","date":"2017-01-23T01:15:07.081+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cap N Clippers,realm=NA,application-id=ZGEFLEUQ,discussion-id=dkzTAFRn,comment-id=,timestamp=2017-01-22T19:58:47.024+0000)\n>\n> i have been getting so much toxic players its actually unreal every game i play someone has BM, i have a few snapshots at the end of the game, it would be nice if a riot employee would check the ingame chat because they were even worse  (don&amp;#039;t let these players get away with being so toxic)\n> [](http://imgur.com/CW9LR0Q)\n\nIf you reported them, then that's all you need to do for the system to look into it. I reported my jungler who spammed mia pings and harassed my team. I muted him before I said something I would regret :)  but it took about a day for said player to get penalize. It takes time, but your report is looked into. Friendly advice, always add information of what happens in the textbox. \n{{champion:76}} \nNyaaa","replies":[]},{"poster":"Magical Player","date":"2017-01-22T20:37:33.598+0000","up_votes":1,"down_votes":0,"body":"open a support ticket if you feel your report is not enough","replies":[]},{"poster":"GoleBilon","date":"2017-01-22T20:07:33.585+0000","up_votes":1,"down_votes":0,"body":"they called you bad , yea its not nice but you can report them after the game and suck it up. As the summoner code says \n\n_And remember, while nobody likes being insulted, it pays to take a moment to consider the circumstances. Remember that this is a competitive game, and, more often than not, the other player is just venting their frustration. Try not to take it personally. Everyone has a breaking point and everyone rages sometimes. At some point you may find yourself in the other person's shoes_\n\nMaybe those guys were tilted , maybe they did not understood you , maybe they are nice people but the frustration from the game got to them. Yea you can report them but try getting into their shoes first and understand their frustration, if they were just douches and harrased you go on and report them, but if they were for example in their last promo game and you know you cost them a game give them a break because one time action does not mean they arent great helpfull summoners on daily basis","replies":[{"poster":"KAID0","date":"2017-01-22T20:33:46.261+0000","up_votes":1,"down_votes":0,"body":"they were not tilted they won the game lol, and all were pretty fed ingame and plus dude thats just the end game chat, they were a lot worse ingame lol but thanks for commenting im going to take a break for a while but next time im going to just mute.","replies":[{"poster":"GoleBilon","date":"2017-01-22T20:37:19.157+0000","up_votes":1,"down_votes":0,"body":"then  they are just douches and if you reported them they will sooner or later get deserved punsihment, no matter them you shouldnt get people like that get in your head because its only thing they want and from the long term perspective you will never meet them again most likely so why bother with douches :D","replies":[]}]}]},{"poster":"YOU LOST LMAO","date":"2017-01-22T21:52:46.491+0000","up_votes":1,"down_votes":3,"body":"lol umad kid?","replies":[]}]}