{"poster":"PeroMeFocusearan","date":"2016-11-21T15:04:18.442+0000","title":"Cuenta Migrada sin autorizacion","subforum":"Problemas Técnicos","up_votes":2,"down_votes":1,"body":"Buenas a todos!! el dia de ayer despuse de unas horas fuera de casa, quise loguear con mi cuenta para jugar unas partidas antes de dormir, pero resulta que me encuentro con lo siguiente,  mi cuenta no estaba en LAS (originalmente juego en el servidor de LAS por una cuestion de que vivo en latino america sur)  y mi pregunta fue, a donde se fue? me banearon?   NO! alguien que se dedica a sacar cuentas ( seguramente ) entro a mi cuenta, se la llevo a UE WEST, cambio de Nombre y se puso a jugar con algo que no le corresponde... ya mande 2 tikets explicando mi problema, pero armo un tema en el foro para mantener al tanto del problema.\r\n\r\nEn lo que pueda colaborar para poder recuperar la cuenta, estoy a plena disposicion\r\nSaludos!! y muchas gracias de antemano.\r\n\r\nPD: Estaria bueno, agregar como seguridad para evitar migraciones no permitidas, que te envie un PIN al email para autorizar el proceso...","replies":[{"poster":"Excalibeer","date":"2016-11-21T15:15:57.723+0000","up_votes":3,"down_votes":0,"body":"De qué cuenta hablas?  Porque ésta cuenta está en LAS y no veo tickets al respecto.\n\n-Excalibeer","replies":[{"poster":"PeroMeFocusearan","date":"2016-11-21T17:34:55.063+0000","up_votes":2,"down_votes":1,"body":"Buenos Excalibeer!!  mande los tiquets y me respondio :  DrZoitberg (Riot Games Player Support) \n\nMi cuenta  invocador es Akitane, jugue la ultima partida el 19-11-2016, el domingo 20-11-2016 quiero entrar a jugar y me  encuentro con que mi cuenta no estaba en la Region... \n\ny ahi fue donde :\n\n1º Mande Tiket a RIOT , mejor dicho 2 tikets \n24358025 \tRecuperación de cuenta \t                                hace 15 horas \thace unos cuantos segundos \tAbierta\n24358272 \tRecupero de Cuenta Cambiada de Region \thace 14 horas \thace 2 horas\n2º Busque en el historial de Partida a mi invocador: Akitane y resulta que le cambiaron el nombre por \"Shacouillot\"\n3º Busque en Las.Op.GG y me puso que en LAS no habia ningun invocador con ese nombre y busco en todas las regiones y lo encontro en UEwest en la cual cambie la clave, cambie el cliente de region y pude loguear a mi cuenta que me la transladaron.\n\nla cuenta PeroMeFocusearan la arme para tener una segunda cuenta pero en este momento solo me sirve para comunicarme en el foro...\nestoy en un estado de desesperacion y enojo, desesperado por recuperar mi cuenta y enojado por que me sacaron la cuenta...\n\ny la frutilla del postre... el Desgraciado se puso a jugar ranked.. Trolleo y lo banearon... hoy me llego el email...lo siguiente\n\n\"Greetings shacouillot,\n\nActions that have been performed on your account are in violation of the League of Legends Terms of Use. You can review these terms at http://www.leagueoflegends.com/legal/termsofuse\n\nDue to the severity of this violation, your League of Legends account has been banned until Mon Feb 22 22:22:22 UTC 2100\n\nIf you have any questions, contact our Player Support team at https://support.leagueoflegends.com/home\n\nRiot Games Player Support\"\n\nDoble enojo... \n\ndisculpen por las molestias... pero nunca me habia pasado\n\nSaludos cordialeS!","replies":[{"poster":"Excalibeer","date":"2016-11-21T18:04:59.363+0000","up_votes":1,"down_votes":0,"body":"Okas, ya tienen tus tickets y están revisando el caso.\n\n-Excalibeer","replies":[{"poster":"PeroMeFocusearan","date":"2016-11-21T18:10:29.201+0000","up_votes":1,"down_votes":0,"body":"Muchisimas Gracias Excalibeer!! Se que tengo todo en orden y estoy a plena disposicion de ustedes!! \n\nMuchisimas gracias!!","replies":[]}]}]}]},{"poster":"Tazztania","date":"2016-11-21T16:07:55.488+0000","up_votes":2,"down_votes":0,"body":"quizás te pasó lo que me pasó a mi con el cliente nuevo... como ilusa que soy... \nvi el idioma y que podías cambiarlo y dije \"NO, RITO NOS DEJA CAMBIAR EL IDIOMA SIN IMPORTAR NADA\" y lo cambié a ingles pero en verdad estaba cambiando de region y ya no te descargaba todo como antes sino que te permitía hacerlo sin demoras y quizas quedaste en otra region, fijate si fue eso y que estes en la region que coorresponde","replies":[{"poster":"PeroMeFocusearan","date":"2016-11-21T17:37:56.989+0000","up_votes":1,"down_votes":0,"body":"Hola Tazztania !! No!! realmente no... en esas cosas siempre fui muy precavido! aparte.. Jugue el Sabado 19-11-2016  en mi casa... y el Domingo 20-11-2016 en mi casa vuelvo a querer loguear para jugar y me encuentro con que la cuenta no estaba en la Region! y me qude pensando... si en ningun momento migre micuenta... y ahi me puse a bucar.. antes de desesperarme...","replies":[]}]}]}