{"poster":"Insane Rage Mode","date":"2019-06-28T07:09:51.082+0000","title":"League crashed","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey, ich weiß, dass es vermutlich nicht am Client liegt, allerdings habe ich folgendes Problem.\r\n\r\nWenn ich ingame bin, tabbed mein Bildschirm regelmäßig raus und wieder rein, was dazu führt, dass meine Grafikkarte crashed. \r\nZur Folge kommt ein Bugsplat und ich darf wieder einmal reconnecten. Woran kann das liegen, oder besser noch wie kann ich das beheben? \r\nIch habe dieses Problem seit einigen Wochen und es wird nicht besser.\r\nWerde gleich mal neue Wärmeleitpaste kaufen und das nachfüllen, vielleicht hilft das. Allerdings wenn nicht bin ich überfragt. \r\nIch habe dieses Problem ausschließlich bei League, nicht bei anderen Spielen, allerdings verbrauchen die anderen Spiele auch nicht die Leistung, die League fordert sondern deutlich weniger","replies":[{"poster":"Jiggys DIEary","date":"2019-06-28T17:32:50.789+0000","up_votes":1,"down_votes":0,"body":"Eine Standardantwort ist meist: Grafikkartentreiber updaten. Die Antwort klingt zwar mittlerweile echt alt und langweilig, aber es ist unglaublich, wie viel Ärger ein verbuggter Treiber verursachen kann (Vor allem wenns Beta Versionen sind).\nAndernfalls kannst du mal LoL im Fenstermodus/Randlosmodus ausprobieren. Das hilft echt ungemein. Das mache ich nämlich mittlerweile, denn seit irgendeinem Update dauert es äußerst lange (ca 10 sec) bis ich mich wieder eintabben oder austabben kann aus LoL. Wird nämlich für 10 sec ca. schwarz, bis mein Bildschirm endlich erscheint. Oder wenn ich mich wieder eintabbe erneut 10 sec schwarz, bis ich wieder ins Spiel komme. Das war früher nicht so, aber seit irgendeinem Update ist es leider so, weswegen ich von Fullscreen auf Randlos/Fenstermodus umgestiegen bin. Auf diese Weise geht das Tabben in nur einer Sekunde.\nFullscreen ist immer so eine Sache, vor allem wenn Vsync noch dabei ist. Also wenn du nichts gegen Fenstermodus/Randlosmodus hast, probier das mal, dann crasht es vllt nicht mehr! :) Ansonsten halt mal schauen, ob du nicht versehentlich einen Beta-Grafikartenreiber installiert hast, als es mal ein Udapte gab. (AMD emfpiehlt bspw. sehr gern Beta Updates, da kann man sich leicht vertun und mal versehentlich \"Optionale Updates\" runterladen. Diese sind nämlich Beta und nicht Stable)","replies":[]}]}