{"poster":"alucard21383","date":"2016-04-16T08:05:57.257+0000","title":"Schade, das Flames in privatem Chat erlaubt sind - siehe hier","subforum":"Spielerverhalten & Moderation","up_votes":5,"down_votes":4,"body":"Schade, das Flames wie im Titel angekündigt erlaubt sind. \nEs sind 2 verschiedene Spieler, einer davon war ein Test Account, den ich mit einem Kumpel gemacht habe um zu schauen, ob Riot dagegen vorgeht oder nicht. Einer war ein anderer Spieler - der mich geflamed hat, weil ich ein schlechtes Spiel in Aram hatte.\n\nAlso nochmal zum verdeutlichen: \nSpieler 1: Account, was ein Freund erstellt hat, hat mich per Whisper beleidigt. an 5 verschiedenen Tagen, 5 mal mit Beleidigungen Spam.\nWir haben vorher noch ein Spiel in Aram zusammen gespielt, wo er oder ich nix gesagt haben. Danach hat er mich eingeladen. Flame Spam abgeladen. Gelöscht. Ich habe dies per Riot Support Mail und dem After Game Report gemeldet. Er kann sich weiterhin einloggen und nix passiert. Und da waren einfache Beleidigungen, bis hin zu den Oberkrachern mit dabei.\n\nSpieler 2: Ein Random Spieler, den ich nicht kenne, hat mich nach dem Spiel geaddet, geflamed. Dann bisschen noch weiter gemacht. Riot Support Mail. Er spielt auch weiterhin.\n\nFazit: Ingame sind Beleidigungen nicht erlaubt. Geschehen diese Beleidigungen aber per Whisper, ist dies von Riot erlaubt und auch toleriert, weil sie vllt. nicht erkennen können, ob es ein Freund ist oder nicht, da er ja auf meiner Freundesliste ist...\n\nVllt. wird mein Thread nun gedownvoted (was ich nicht verstehen könnte...) das ich nicht verstehen könnte, da ich euch auch frage, ob dies schon mal bei euch vorkam. Würde halt sehr gerne wissen, ob jemand schon mal die Beleidigungen after Game hatte, per Whisper, dieser gemeldet wurde und anscheinend nix passierte. (in Form von Bans - Chatbans kann man schwer herausfinden).\n\nAber dazu sage ich ja auch: mein Freund hat an 5 Tagen mich beleidigt und nix passiert. Und dies ist auch ca. 1-2 Wochen her, also Zeit genug um dagegen was zu unternehmen.\n\nhttp://www.directupload.net/file/d/4326/8i7ssuil_jpg.htm\nhttp://www.directupload.net/file/d/4326/mutmt3q7_jpg.htm\nhttp://www.directupload.net/file/d/4326/kwc7v63z_jpg.htm","replies":[{"poster":"Wernicke","date":"2016-04-16T08:35:23.097+0000","up_votes":1,"down_votes":6,"body":"Du wirst hier keine dich zufriedend stellende Antwort bekommen, da jeglicher negativer Sachverhalt, sowie jegliche fragwürdige Handlungen, von den üblichen Personen mit den immer gleichen Sprüchen gerechtfertigt werden wird.\n\nP.s.: \"stop or i report you\" darfste nicht mal schreiben ^^","replies":[{"poster":"alucard21383","date":"2016-04-16T08:45:31.432+0000","up_votes":3,"down_votes":2,"body":"Du darfst soweit ich weiß nicht andere auffordern zu reporten wie, pls report XYZ because he flamed me / afk / troll oder sonstiges.\nDu darfst aber (und hier kann ich mir vorstellen, dass es nichts schlimmes ist) sagen, pls stop or i report you, grade, wenn es im privaten Chat um Beleidigungen übelster Art und Weise geht. Sonst könnte er sich rechtfertigen mit, er hat mir ja nix gesagt.\n\nKlar, kann man hier keine zufriedenstellende Antwort erhalten, wenn es grade nicht von einem Riot Mitarbeiter kommt...\nAber, ich habe ja schon einen Hinweis oder eine Antwort erhalten, dass Flames egal wie schlimm sie sind, per whisper ok sind. was mich ehrlich gesagt traurig stimmt.","replies":[{"poster":"Vincere","date":"2016-04-16T09:09:52.087+0000","up_votes":2,"down_votes":2,"body":"Jetzt mal ganz ehrlich, das ist alles heulen auf großen Niveau.\nWozu gibts verdammt nochmal die Blockfunktion ?\nAls ob der Support nicht so schon genug zu tun hat.","replies":[{"poster":"Protective Puppy","date":"2016-04-16T12:13:55.734+0000","up_votes":4,"down_votes":0,"body":"Das ist kein Argument. Immerhin gibts ingame auch die Mute-Funktion.\nTrotzdem kann man dennoch reporten.\nIst reporten jetzt auch \"heulen auf großem Niveau\"?","replies":[]},{"poster":"alucard21383","date":"2016-04-16T10:21:50.633+0000","up_votes":5,"down_votes":2,"body":"Ich weiß, es gibt die Blockfunktion - und dennoch schützt das vor der Strafe nicht.\nWie ich bereits sagte. Wenn ein Spieler dich im Spiel nicht flamed, obwohl du ein mieses Game hast und vllt. sogar der Grund für den Lose bist, er dich dann addet, dann nimmt man \"normalerweise\" an, weil vllt. hat er eine Frage, will Duo spielen oder dir Tipps geben usw.\n\nUnd wenn er dann los legt, dann kann ich blockieren. Ja, das stimmt. Aber das ist nicht großes Heulen auf großem Niveau. Sonst kann ich auch sagen, oh dann lasst uns ingame flamen? Es geht hier ums Prinzip und es heißt, keine Flames. Egal ob das großes Heulen ist oder nicht.","replies":[]}]},{"poster":"eingew","date":"2016-04-16T12:42:30.615+0000","up_votes":1,"down_votes":1,"body":"Also ingame würde ich Drohungen als relativ fragwürdig betrachten. Im Privatchat wirst du dafür wohl kaum belangt.","replies":[]}]},{"poster":"DigiDeity","date":"2016-04-18T08:57:50.237+0000","up_votes":1,"down_votes":0,"body":"Die Community hat echt einen Stock im Poppes. :D","replies":[]}]},{"poster":"Killerkante","date":"2016-04-16T09:09:24.760+0000","up_votes":1,"down_votes":0,"body":"Im Unterschied zum game kannst du solche Spieler doch einfach von der f-list kicken, da musst du dich auch keine 30 Minuten oder mehr mit denen rumprügeln, ist zwar Scheiße dass sowas vorkommt aber manchmal versteh ich nicht wieso man sich so stark Gedanken drüber macht, im Spiel hat das auch eine ganz andere Wirkung wie ausserhalb.\n\nIch gehör aber generell eher zu denen die sich aus einer Beleidigung vorerst nichts machen, das einzige was ich dadurch feststelle ist das ungefähre alter der Personen .. und ich bin der Meinung dass man sich mit Pubertierenden Kindern die meinen sich irgendwie beweisen zu müssen oder wie in den meisten Fällen von älteren einfach Menschen mit minderem Selbstbewusstsein nicht abgeben sollte.\n\nAusserdem, nichts gegen dich, aber wenn du eine Freundsschaftsanfrage annimmst, wo der Spieler dich vorher schon verbal belästigt hat bist du schon fast selber Schuld.","replies":[{"poster":"alucard21383","date":"2016-04-16T10:23:29.670+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Killerkante,realm=EUW,application-id=KYnfKGf0,discussion-id=Atr4fi3V,comment-id=0002,timestamp=2016-04-16T09:09:24.760+0000)\n>\n> Im Unterschied zum game kannst du solche Spieler doch einfach von der f-list kicken, da musst du dich auch keine 30 Minuten oder mehr mit denen rumprügeln, ist zwar Scheiße dass sowas vorkommt aber manchmal versteh ich nicht wieso man sich so stark Gedanken drüber macht, im Spiel hat das auch eine ganz andere Wirkung wie ausserhalb.\n> \n> Ich gehör aber generell eher zu denen die sich aus einer Beleidigung vorerst nichts machen, das einzige was ich dadurch feststelle ist das ungefähre alter der Personen .. und ich bin der Meinung dass man sich mit Pubertierenden Kindern die meinen sich irgendwie beweisen zu müssen oder wie in den meisten Fällen von älteren einfach Menschen mit minderem Selbstbewusstsein nicht abgeben sollte.\n> \n> Ausserdem, nichts gegen dich, aber wenn du eine Freundsschaftsanfrage annimmst, wo der Spieler dich vorher schon verbal belästigt hat bist du schon fast selber Schuld.\n\nSiehe oben. Ingame - keine Flames. After Game Chat - keine Flames.\nFreundschaftsanfrage. Angenommen. Flames.\nWie soll ich das voraussehen, dass er sowas macht? Und nochmal, es geht hier nur ums Prinzip - wieso das nicht auch geahndet wird. Mehr nicht.\nUnd ja ich kicke die ja danach - aber es geht hier einfach nur ums Prinzip.","replies":[{"poster":"Killerkante","date":"2016-04-16T12:45:59.210+0000","up_votes":2,"down_votes":0,"body":"Das ist jetzt nur verallgemeinert.\n\nWenn das spiel nicht so gut gelaufen ist, ists schon recht vorrausschaubar, außerdem bezweifle ich dass derjenige absolut garnichts im Spiel geschrieben hatte, wie sehr du mir auch das Gegenteil erzählen willst.\n\nIch schätze allerdings Riot geht Privatchats nicht hinterher, weil sowas recht leicht fake-bar ist ... und weil es nunmal \"Privatchat\" ist.\n\nIch kann deinem Freund aber übrigens empfehlen ingame als test zu flamen, wenn er immernoch austesten will ob solche Spieler gestraft werden, am besten zu dir damit keiner mental zu Schaden kommt.\n\nIch wette mit dir um einen Ultimate Skin dass spätestens je nach härte, nach 10 Spielen der erste Bann eintritt, ich hatte es nämlich auch mal getestet, vor der großen Bannwelle um mich selber zu vergewissern ... da ich es mir ziemlich schwer getan hab mit flamern.\n\n(2 Accounts gebannt, hab leider vergessen einen Thread aufzumachen mit einer kleinen flame Historie um den Leuten ans Herz zu legen sich im spiel zu benehmen und der Einstellung entgegenzuwirken dass man doch eh nicht gebannt wird)","replies":[{"poster":"Sirrkas","date":"2016-04-16T19:36:14.503+0000","up_votes":1,"down_votes":0,"body":"Die Wette wirst du wahrscheinlich verlieren, solange da keine wirklich harten Sachen geschrieben werden oder du mit Bann auch eine CR meinst.","replies":[{"poster":"Killerkante","date":"2016-04-16T20:21:01.494+0000","up_votes":1,"down_votes":0,"body":"CR included! :)","replies":[]}]}]},{"poster":"Waldschrat86","date":"2016-04-16T15:40:00.118+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=alucard21383,realm=EUW,application-id=KYnfKGf0,discussion-id=Atr4fi3V,comment-id=00020000,timestamp=2016-04-16T10:23:29.670+0000)\n>\n> Siehe oben. Ingame - keine Flames. After Game Chat - keine Flames.\n> Freundschaftsanfrage. Angenommen. Flames.\n> Wie soll ich das voraussehen, dass er sowas macht? Und nochmal, es geht hier nur ums Prinzip - wieso das nicht auch geahndet wird. Mehr nicht.\n> Und ja ich kicke die ja danach - aber es geht hier einfach nur ums Prinzip.\n\nStimmt schon, kannst du nicht vorraussehn, aber du musst es nur 1 x sehen. Die Blockierfunktion ist dein persönlicher (permanenter) Chatban/Mute für den Vogel. Wozu brauchst du da noch Riot?\n\nOder streifst du auch durch unmoderierte Foren, sammelst alles beleidigende und lieferst es jede Woche bei den Bullen ab mit Anzeigen gegen Unbekannt?\n\nIh habe es wannanders hier schonmal geschrieben, Beleidigung und Co. sind zwar unschön, aber sie interessieren mich nicht, alles schon gehört. Was mich aber interessiert, ist deren Auswirkungen ingame. Die gibt es allerdings auserhalb des Spiels nicht und damit uninteressant für mich, blockiert und fertig.","replies":[]}]}]},{"poster":"Lotus Angel","date":"2019-06-12T18:18:12.272+0000","up_votes":1,"down_votes":0,"body":"warum nimmst du die Freundschaftsanfrage an? Kommt mir so vor als ob du einfach geflamed werden möchtest","replies":[]},{"poster":"JoseJalalapeno","date":"2016-04-17T08:50:02.179+0000","up_votes":1,"down_votes":0,"body":"ich versteh nicht wie einen das so aufregen kann, dass man hier gleich so n Wind drum macht?\n\nNen privaten Chat kannst du zumachen, denjenigen von der Liste kicken und die Sache ist **FÜR IMMER **vom Tisch (wenn du nicht grad im ranked so hoch bist, dass du denjenigen öfter siehst)\nDu hast genau 10 Sekunden damit zu tun, du musst nicht 30min+ mit ihm in einem Spiel verbringen. \n\nWenn er sich ingame zusammenreisst, ist das doch gut, dann haben ein paar reports die zu ner CR geführt haben schonmal geholfen. \nWenn er meint ausserhalb einen auf dicke Hose zu machen, ist er einfach nur bemitleidenswert.\nAber hier einen auf carebear zu machen um sich selbst und andere vor privaten flames zu beschützen ist zu viel des guten, das sollte jeder für sich selbst regeln können","replies":[]},{"poster":"Oules","date":"2016-04-16T18:32:42.335+0000","up_votes":1,"down_votes":0,"body":"Ja, mir schon, ich hatte ein schlechtes Spiel hinterlegt (da die Gegner besser waren als mein Team (ich hatte da noch keine Ahnung wie ich Bronze \"nieder hauen\" kann)) und der hat mich nachden spiel Reported/und geadded und meinte er würde mich beim Support anschwärtzen, ich hatte mich hier im Forum Informiert und sagten das die nix machen könnten.\n\n(er hatte gehofft das ich gebannt werde wegen feeden :D) Aber da Rito DAGEGEN nix macht.. das ist schon ein wenig traurig...{{champion:43}}","replies":[{"poster":"Sirrkas","date":"2016-04-16T19:37:42.262+0000","up_votes":1,"down_votes":0,"body":"Naja, seine Reports werden ignoriert, wenn er dauernd unsinnige Meldungen verteilt.","replies":[{"poster":"Oules","date":"2016-04-16T20:06:25.884+0000","up_votes":1,"down_votes":0,"body":"Ich hatte mir auch erst sorgen gemacht, aber ich sehe sowas schon als bluff an :D\nRiot könnte evtl einen \"button\" bei \"zuletzt gespielten mit spieler\" (oder so) hin basteln das man die noch nach träglich reporten kann, falls man dies vergessen sollte","replies":[{"poster":"Sirrkas","date":"2016-04-16T20:36:00.522+0000","up_votes":1,"down_votes":0,"body":"Wenn man vergisst sie zu melden, war es wohl eh nicht so schlimm.","replies":[{"poster":"Oules","date":"2016-04-17T08:21:44.223+0000","up_votes":1,"down_votes":0,"body":"Wenn diese \"großen Kinder\" alle und jeden beleidigen, kann man sowas für Wut schon mal vergessen... (ist mir schon oft passiert)\nDie fangen an deine ganze Familie zu beleidigen, dich.\nIch frage mich ob die überhaupt Reports von anderen Team Mitglieder bekomen..","replies":[{"poster":"Sirrkas","date":"2016-04-17T08:25:37.754+0000","up_votes":1,"down_votes":0,"body":"Wenn sie mit Randoms spielen, sollten sie von den Mitspielern auch regelmäßig Reports kriegen. Kann aber auch sein, dass die andere Flamer im Team haben, die so etwas für normal halten.","replies":[]}]}]}]}]}]},{"poster":"Sirrkas","date":"2016-04-16T08:18:26.034+0000","up_votes":1,"down_votes":0,"body":"Riot verfolgt den privaten Chat nicht, weil es da zu schwierig wäre zu erkennen, ob das ernst gemeint ist. Sieht man ja auch gut an deinem Beispiel. Du hast dich von deinem Freund beleidigen lassen, da war das ja in Ordnung, ihr wusstet ja beide, dass das nicht so gemeint ist. Den kann man jetzt aber schlecht von jemandem unterscheiden, der dich wirklich ernsthaft flamen will. Selbst wenn die erste Nachricht von dem Spieler Beleidigungen sind, kann das immer noch wer sein, den du zum Beispiel schon kennst und das im TS euer normaler Umgangston wäre.\n\nDeswegen wird der private Chat nicht nachverfolgt. Ich verstehe ohnehin nicht, warum man einen Flamer in die Freundesliste aufnimmt, wenn man mit dem nichts zu tun haben will.","replies":[{"poster":"alucard21383","date":"2016-04-16T08:22:32.682+0000","up_votes":2,"down_votes":2,"body":"Ich wusste ja nicht, dass er mich privat beleidigen will. Er hatte ingame nichts gesagt und nachher meinte er auch im privaten Chat, Riot verfolgt den privaten Chat nicht da sie nicht wissen, ob es ernst gemeint ist. Was vollkommener Blödsinn ist.\n\nDenn 1., wenn das für mich normal wäre, dass mein Freund mich so beleidigt, dann würde ich ihn nicht reporten.\n2. Selbst dann, wäre es trotzdem nicht ok, solche Beleidigungen wie %%%%%% Tumor usw. zu schreiben und 3.\nWas am wichtigsten ist: Wenn ich im Chat schreibe, stop or i report you und er macht weiter, sollte doch Riot wissen, dass man das nicht will und es nun \"ernster\" wird.\n\nAlso merken: Beleidigungen bitte per Whisper und nicht ingame? Was soll der Mist ganz ehrlich?","replies":[]}]}]}