{"poster":"2drunk4yøu","date":"2018-09-20T07:01:23.650+0000","title":"Seite für Tier liste","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Gibt es eine Seite, die die momentanen starken Champions anzeigen und vlt noch den jeweiligen Build dazu. \r\nWeil immer wieder mal so Korean Builds rauskommen die ziemlich op sind und ich dann erst Monate sp&auml;ter davon erfahre.","replies":[{"poster":"Drachenlord1510","date":"2018-09-20T07:33:48.458+0000","up_votes":3,"down_votes":0,"body":"Ich empfehle lolalytics.com für Tier List und Builds. Gute Seite, die eine sehr große Menge an Spielen analysiert und dabei nicht nur wie op.gg Korea betrachtet.\nDa sieht man auch seltener gespielte Item-Kombinationen und deren Winrate.","replies":[{"poster":"2drunk4yøu","date":"2018-09-20T09:42:04.247+0000","up_votes":1,"down_votes":0,"body":"Dankeschön, lolalytics schaut gut aus. Bei manchen Items ist eine Zeitangabe. Ist die die durchschnitts Minute welche es im spiel gebaut wurde?","replies":[{"poster":"Drachenlord1510","date":"2018-09-20T12:02:38.867+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=2drunk4yøu,realm=EUW,application-id=Wj1wcocU,discussion-id=EKHIeAqF,comment-id=00010000,timestamp=2018-09-20T09:42:04.247+0000)\n>\n> Dankeschön, lolalytics schaut gut aus. Bei manchen Items ist eine Zeitangabe. Ist die die durchschnitts Minute welche es im spiel gebaut wurde?\n\nJa","replies":[]}]}]},{"poster":"Awsane","date":"2018-09-20T10:26:51.961+0000","up_votes":2,"down_votes":0,"body":"Also Für Champions Allgemein\n\nhttps://lolalytics.com/ranked/worldwide/platinum/plus/home/ (hier finde ich die Tierliste besser)\nund\nhttps://champion.gg/ (hier kann man win/ban/playrate besser sehen)\n\nfür Builds\nhttps://www.probuilds.net/","replies":[{"poster":"2drunk4yøu","date":"2018-09-20T10:46:39.462+0000","up_votes":1,"down_votes":0,"body":"Wie findest du Mobafire für builds?","replies":[{"poster":"Awsane","date":"2018-09-20T11:35:14.708+0000","up_votes":1,"down_votes":0,"body":"generell bin ich nicht so der Mabafire Fan.\n\nUm mal ne Idee zu bekommen ist das okay. Aber man muss da unbedingt alles hinterfragen. Also mehr als bei den anderen Sachen (ich finde da auf Statistiken schauen besser als Guids (von Leuten die ggf nicht mal ne Reputation haben))\n\nDas liegt einfach daran, dass dort auch viele ich nenne sie mal confortbuilds sind, die dem Spieler aus bestimmten Gründen spielen , weil sie z.B. seinem Spielstiel gut passen. Gerade bei unter high dia Guids sind die oft suboptimal. Also sie holen nicht 100% aus dem Champ raus und das ist eigentlich mein Anspruch.\n\nOft erkennt man das auch in den Guids in denen bestimmte Sachen geraten werden zu tun, die vllt in der Elo Funktionieren aber nicht das eigentlich richtige sind. Und wenn man dann genug aufgestiegen ist muss man sich wieder umstellen. Das richtige zu tun ist vlt initial anstrengender und anspruchsvoller, aber im Endeffekt ist es besser, als wenn man sich immer wieder neu anpassen muss.\n\nKlar in unteren Elos kann das auch funktionieren, aber warum etwas suboptimales spielen wenn es auch besser geht. Das ist ja dann einfach Bequemlichkeit/Faulheit (weils oft einfacher oder eindimensionaler ist) und das will ich eigentlich nicht unterstützen.","replies":[{"poster":"2drunk4yøu","date":"2018-09-20T11:48:14.447+0000","up_votes":1,"down_votes":0,"body":"hmm hab oft in der letzten Zeit meine Builds daraus geholt und oft bemerkt, dass oft komische konstellationen gemacht haben welche funktioniert aber auch nicht funktioniert haben. Aber danke für deine Meinung, das zeigt mir das ich mich bisschen mehr auf Kleinigkeiten achten muss👍🏻","replies":[{"poster":"Awsane","date":"2018-09-20T12:05:40.720+0000","up_votes":1,"down_votes":0,"body":"also das beste was man machen kann ist sowieso pros beim spielen zusehen und schauen was die machen und dass dann mit seinen eigenen replays vergleichen und dabei alles hinterfragen. Also warum item xy, warum pick xy in der Situation. Und wenn man keine antwort hat kann man ja in streams fragen oder sich nen Coach holen oder hier im Forum fragen.","replies":[{"poster":"2drunk4yøu","date":"2018-09-20T14:10:20.276+0000","up_votes":1,"down_votes":0,"body":"Jo das ist wohl am besten.","replies":[]}]}]}]}]}]},{"poster":"GamingHabe","date":"2018-09-21T15:54:12.110+0000","up_votes":1,"down_votes":0,"body":"Damit sollte deine Frage geklärt sein :D https://champion.gg","replies":[{"poster":"2drunk4yøu","date":"2018-09-21T20:50:01.525+0000","up_votes":1,"down_votes":0,"body":"Naja ich muss wirklich sagen das Lolalytics doch ziemlich nice ist :D","replies":[]}]},{"poster":"Mjölnir Kind","date":"2018-09-20T07:03:07.700+0000","up_votes":1,"down_votes":1,"body":"Champion.gg\nund für die Builds für ich dir Probuilds.net empfehlen","replies":[]}]}