{"poster":"crazzytattoo","date":"2015-05-13T16:48:35.091+0000","title":"actualizacion del parche 5.8","subforum":"Guias y consejos","up_votes":0,"down_votes":0,"body":"tengo una duda. el internet de mi casa anda muy bien. pero cuando la actualizacion del parche 5.8 nunca se termina de descargar. en ocaciones me baja los KBps a 0 y se clava ahi. y tengo que volver a cerrarlo y abrirlo nuevamente. alguna ayuda o solucion?\r\nrespuestas rapidas porfavor. que estoy manija de jugar jajaja","replies":[{"poster":"Time Lord","date":"2015-05-14T12:59:58.266+0000","up_votes":1,"down_votes":0,"body":"En la primera pantalla del launcher, en la pestaña del opciones (como unas tuerquitas en la esquina superior derecha) desmarcas la casilla de transferencia entre pares.","replies":[]},{"poster":"Time Lord","date":"2015-05-13T18:02:10.550+0000","up_votes":1,"down_votes":0,"body":"Ah y desactiven la opción de P2P en el cliente, generalmente eso ayuda a que descargue mejor con conex lentas.","replies":[{"poster":"crazzytattoo","date":"2015-05-14T04:52:45.089+0000","up_votes":1,"down_votes":0,"body":"y como desactivo eso '¿","replies":[]}]},{"poster":"Time Lord","date":"2015-05-13T18:01:25.398+0000","up_votes":1,"down_votes":0,"body":"Porque no siempre está bajando archivos, a veces simplemente está parchando cosas en tu maquina y dependiendo de la velocidad de tu procesador eso puede ser lento o muy rápido. Simplemente deja al cliente tranquilo y ya.","replies":[]},{"poster":"crazzytattoo","date":"2015-05-13T17:16:48.766+0000","up_votes":1,"down_votes":0,"body":"pasa que no se porque motivo me anda mejor el wifi que el cable jajaja ahora me esta bajando a 70KBps pero va bajando. despacio pero baja","replies":[]},{"poster":"Neoburstx","date":"2015-05-13T17:01:27.633+0000","up_votes":1,"down_votes":0,"body":"Hola!\na mi me sucedio algo similar cuando se instalo el parche 5.8, se pegaba en 3% y no avanzaba pero lo deje y no cerre el launcher y al cabo de 10 minutos avanzo de 8% a 90% en cosa de segundos.\n\nSiempre cuando juego/actualizo utilizo el cable fijo ethernet por que con wifi se me cae a cada rato.\n\nSaludos{{champion:150}}","replies":[]}]}