{"poster":"Hecey","date":"2018-01-11T22:19:07.994+0000","title":"Imposible ser support.","subforum":"Charlas Generales","up_votes":5,"down_votes":6,"body":"Ir&eacute; al grano, 2/0/13 con Janna, para sacar una misera A+.\r\nTy riot, como si support no fuera uno de los roles m&aacute;s dedicados ni siquiera se premia bien.\r\nPd: 12/6/11 con Ahri y me dieron S(? Regalada la maestr&iacute;a con un mago, gracias.","replies":[{"poster":"EstebanGG","date":"2018-01-11T22:55:43.378+0000","up_votes":3,"down_votes":1,"body":"se ve como si la calificación s+ ,s , s- . fuera algo aleatorio en cuanto al score. pero no es tan asi. Se toman cálculos matemáticos como cuanto farm llevas en la partida, cuanto daño has hecho, toma de decisiones,objetivos , ect.\n\ntalves en la partida de ahri sacaste s porque tomaste mas mejores decisiones , o tuviste mas wort que ayudaron a aser snowall a tu equipo y terminar con la partida\n\ny en la partida de janna no moriste , pero uno que otro error te llevaron a sacar esa a+. talves huvieron momentos en los que pudiste tener mas asistencias o esas 2 kill no le dieron el oro al que ase el mayor daño en team fight , etc.\n\npero principalmente las estadisticas de una partida determinaran tu calificacion s, no las kill.\n\nES MI PUNTO DE VISTA.\n\nespero que te ayude con tus dudas. :)","replies":[]},{"poster":"xDragonCarmesi","date":"2018-01-11T22:55:41.460+0000","up_votes":2,"down_votes":1,"body":"Las S no se consiguen solo con buenos KDAs, influyen otras cosas; como Daño, Vision, Control de Masas,curaciones, daño mitigado,oro conseguido,etc.","replies":[]},{"poster":"Monokai","date":"2018-01-11T22:19:47.621+0000","up_votes":1,"down_votes":1,"body":"tenes que tener como 23 asistencias minimo","replies":[{"poster":"Hecey","date":"2018-01-11T22:23:01.632+0000","up_votes":2,"down_votes":1,"body":"Lástima que la terminamos rápido y no se pudo sacar más.","replies":[]},{"poster":"RGuerreroZ","date":"2018-01-11T22:40:35.860+0000","up_votes":1,"down_votes":1,"body":"no necesariamente, tiene que ver con el daño mitigado, daño curado, control de masas, daño a las torres, daño a campeones, etc, no es directamente con la asistencia","replies":[]}]},{"poster":"Hecey","date":"2018-01-14T18:38:02.289+0000","up_votes":1,"down_votes":0,"body":"¡Gracias a todos los que se tomaron la molestia de contestar, tendré en cuenta todo lo que han puesto para intentar mejorar!","replies":[]},{"poster":"xaxesis","date":"2018-01-12T00:48:40.604+0000","up_votes":1,"down_votes":1,"body":"yo no me andare con explicaciones tecnicas ni de numeros ni scores ni nada tengo muchos campeones con S, S+ S- y con el tiempo uno se da cuenta que no tiene nada que ver las asistencias asesinatos ni kills ni farmeo le dara S- como minimo siempre y cuando este en todos o casi todos los teamfigth que tenga el equipo mientras mas tiempo usted este en la accion y menos tiempo en base le daran mas probabilidades de sacarsela","replies":[{"poster":"EstebanGG","date":"2018-01-12T03:54:37.953+0000","up_votes":1,"down_votes":1,"body":"jajaja ste men te falto face de lineas","replies":[]}]},{"poster":"NicoelSagaPro","date":"2018-01-11T22:51:08.601+0000","up_votes":1,"down_votes":1,"body":"algun main supp acka para jugar?","replies":[]},{"poster":"ImTheGreatShadow","date":"2018-01-11T22:46:47.008+0000","up_votes":1,"down_votes":1,"body":"Recuerdo que Janna era mi suport de emergencia por el comodín y eso \npero en la temporada pasada me regalaban las S llovían las S Dx  y moría un montón xDD","replies":[]},{"poster":"Defg45333","date":"2018-01-11T22:44:00.711+0000","up_votes":1,"down_votes":1,"body":"El kda no es todo, en el caso de supp te cuenta también el dmg mitigado, curaciones, escudos, visión, etc.\nYo tengo la cajita con todos mis supps menos Janna (también he tenido partidas buenas y medias decentes, con todos mis supps menos Janna :v)","replies":[]},{"poster":"RGuerreroZ","date":"2018-01-11T22:42:44.496+0000","up_votes":1,"down_votes":1,"body":"es dificil, pero tiene que ver cuanto daño lograste mitigar con escudos, curar con la r, cuanto cc metiste a campeones enemigos, el daño a ellos, el daño a las torres, etc, todo eso influye, como en el adc es el farm, el daño a campeones, a las torres, el tanque es aguantar daño, daño hecho ca campeones y torre, y cc que has metido, todo lo que tiene que ver con el campeon, no solo el KDA","replies":[]},{"poster":"bombastico","date":"2018-01-12T02:51:13.880+0000","up_votes":1,"down_votes":2,"body":"Creo que el sistema te compara con las demás jannas del servidor, mientras mejor jueguen todos, mas costara destacar y sacar S.","replies":[]},{"poster":"WhiteMax","date":"2018-01-12T00:24:06.439+0000","up_votes":2,"down_votes":3,"body":"A lo mejor te falto algo, yo juego Thresh, termino 1/2/14 en partida de 25 a 30 min aproximadamente y eso es S-. Haciendo obviamente todo lo que debe hacer el sup, wardear, tanquear, dar peel, curar, aplicar el item de sup, etc (lo mas importante es no morir).","replies":[]}]}