{"poster":"ImtheNOSE","date":"2020-01-01T16:11:58.929+0000","title":"Eigene Beobachtung: \"get cancer\"","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":1,"body":"Hallo, habe mir gedacht, ich versuche mal was: (nein ich schreibe nicht \"get cancer\" in einem Spiel)\nHeute wurde mir (wieder mal) gewünscht, dass ich doch Krebs kriegen sollte. Vollkommen alltäglich für jeden von uns. Hab wie immer einen Report geschrieben und mir diesmal auch den Namen des Spielers angeschaut. Werde den Account jetzt in nächster Zeit hin und wieder checken und schauen, ob der irgendwann nicht spielt oder so (bzw ob ein Ban zu erkennen ist).\n(Den Namen des Spielers werde ich hier nicht nennen, weil das wahrscheinlich verboten ist oder nicht zum Guten Ton gehört, keine Ahnung)\n\nMeine Beobachtungen werde ich (vermutlich nicht, weil ich vergesse, aber ich nehme es mir vor) hier teilen, falls es jemanden interessiert.\n\nGrüße \nImtheNOSE\n\nUpdates: zwischen dem Report und jetzt(04.01.2020 16:12): 21 Spiele gespielt. \nKein Ban. \nbisher also vollkommenes Versagen des Systems\n\nAn dieser Stelle frage ich mich, wie dieses automatisierte System funktioniert. Filtert es Wörter? Ja, oder? \"get cancer\" wird aber nicht gefiltert? oder wie genau darf ich das verstehen?\n\nHabe nun mit einem Ticket eine Meldung geschrieben, mal sehen, ob das etwas bringt\n\nIch beobachte hier nun einen weiteren Fall: offensichtlicher int/dem Gegner zuspielen (nein, der war nicht nur schlecht sondern ist in unser team TPd und hat sich dann töten lassen)\nHabe ein Ticket geschrieben und ingame gemeldet und mal schauen was passiert\n\nUpdate: zumindest einer der gemeldeten Spieler hat seit 6 Tagen kein Spiel gespielt. Leider hab ich das Vergehen vergessen und bin durcheinander gekommen.\n\nHeute habe ich zwei Spieler gemeldet, die \"retard\" bzw \"retarded\" geschrieben haben. Mal sehen ob das erlaubt ist oder bestraft wird.\n\nGrüße","replies":[{"poster":"Angel Ayume","date":"2020-01-01T17:41:10.186+0000","up_votes":5,"down_votes":1,"body":"Also vollkommen alltäglich ist \"get cancer\" oder diverse andere Dinge bei mir keinesfalls. Das sind eher Ausnahmen. \nDas was zumindest in jedem 2. oder 3. Game vorkommt ist der allgemeine Blame, wenn jemand einen Fehler macht oder die Schuld für einen verlorene Fight oder gar das Game bei einem Spieler gesucht wird.","replies":[]},{"poster":"Scream555","date":"2020-01-11T07:07:03.311+0000","up_votes":1,"down_votes":1,"body":"Du brauchst den Account nicht beobachten wenn er gebannt wird kriegst du im Client eine Nachricht das einer deiner Reports in der letzten Zeit zu einem Ban geführt hat","replies":[{"poster":"Bettnachleger","date":"2020-01-11T07:15:30.821+0000","up_votes":2,"down_votes":0,"body":"Nope.\nNur in ganz wenigen Faellen.","replies":[]}]},{"poster":"Sirrkas","date":"2020-01-01T18:14:07.413+0000","up_votes":2,"down_votes":1,"body":"Ich hoffe du hast auch die richtige Kategorie beim Report gewählt. Aus dem Gedächtniss sollte Hetzrede hier das passendste sein.","replies":[{"poster":"ImtheNOSE","date":"2020-01-04T15:06:50.629+0000","up_votes":1,"down_votes":0,"body":"Hetzrede? ich habe \"verbal abuse\" gewählt, wenn ich mich recht erinnere. Kenne mich mit den Kategorien, was worein gehört aber auch wenig aus. Du offenbar besser, kannst du mir da bisshchen was erklären vielleicht? Oder hast du einen Link mit Erklärungen? :)","replies":[{"poster":"Sirrkas","date":"2020-01-04T20:43:54.357+0000","up_votes":1,"down_votes":0,"body":"Tut mir leid, ich war über die Tage nicht online.\n\nIch bin nicht sicher, ob ich alle Kategorien aus dem Stegreif gerade auflisten kann.\n\nNegative Einstellung/Negative Attitude:\nDas ist im Grunde sinnloses Genörgel. Spieler, die ständig schreiben, das Spiel ist verloren und man soll doch aufgeben oder in der Base warten. Auch etwas wie \"you suck\", \"better jungler wins\" oder \"you lost us the game\" würde ich hierunter melden, da man damit andere nieder macht.\n\nVerbal Abuse (zu Deutsch etwa Beleidigung/Belästigung)\nDarunter fallen dann etwa die Beldigungen und ich denke, man kann auch diese \"you suck\" Nachrichten hierüber melden. Im Zweifel lieber eine Kategorie zu viel ankreuzen.\n\nHate Speech/Hetzrede (ich bin mir gerade bei der deutschen Bezeichnung nicht sicher)\nDarunter fallen Sachen wie Rassismus, Homophobie, Diskriminierung wegen der Religionszugehörigkeit und ähnliches. Für diesen Meldegrund ist meine Beobachtung, das Schuldige Spieler gerne mal sofort den 2 Wochenbann erreichen können. \n\nAuch solche Dinge wie Todesdrohungen, -wünsche und Selbstmordaufforderungen passen gut hier rein. Und für ein paar mal \"kys\" (Kill yourself) sind schon einige hier aufgeschlagen, die sofort den 2 Wochenbann erhalten haben.\n\nDer Rest sollte selbsterlklärend sein. Spieler die AFK gehen meldet man für AFK und verlassen des Spieles. Wenn du glaubst, jemand schummelt, etwa weil ein Skript aktiv sein könnte oder da ein Account von einem Bot gesteuert wild, meldet man für Betrug.\nWenn der Name anstößig ist, meldet man den Spieler für den Beschwörernamen. Das würde ich auch bei Clubtags und Clubnamen machen, da aber noch das Kommentarfeld nutzen.","replies":[{"poster":"Zavolta","date":"2020-01-05T04:05:05.637+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=Abp2AIEk,comment-id=000300000000,timestamp=2020-01-04T20:43:54.357+0000)\n\n> Wenn der Name anstößig ist, meldet man den Spieler für den Beschwörernamen. Das würde ich auch bei Clubtags und Clubnamen machen, da aber noch das Kommentarfeld nutzen.\n\nKommentare auf deutsch oder in englisch reinschreiben?","replies":[{"poster":"Sirrkas","date":"2020-01-05T12:19:58.105+0000","up_votes":1,"down_votes":0,"body":"Ich mache das meist auf Deutsch. Aber ich weiß nicht, ob Englisch nicht besser wäre. Ich gehe mal davon aus, dass jeder Supportmitarbeiter für EUW Englisch beherrscht. Es ist auch gut möglich, dass wenn ein deutscher Kommentar geprüft wird, dass an einen deutschen Mitarbeiter weiter geleitet wird, falls es nötig ist.\n\nWenn man etwas wie:\n'Er hat den Clubtag \"Pen1s\". '\nschreibt, kann das aber sicher auch jeder englischsprachige Support erkennen.","replies":[]}]},{"poster":"ImtheNOSE","date":"2020-01-04T21:22:35.327+0000","up_votes":1,"down_votes":0,"body":"danke für die Mühe! &lt;3\nwird mir sehr helfen :)","replies":[]}]}]}]},{"poster":"CptPICHU","date":"2020-01-01T17:33:05.353+0000","up_votes":2,"down_votes":1,"body":"Jo, gut so.\nWenn sich jemand nicht benehmen kann, immer schön melden.\n\nDas bringt auch was. Hab ich schon oft genug mitbekommen! ^^","replies":[]},{"poster":"HPJebaitedjet","date":"2020-01-10T04:00:28.857+0000","up_votes":1,"down_votes":0,"body":"Nun, was lernen wir jedes mal daraus? Egal wie viele male solche Spiele schlechte Sachen sagen, oder sich dazu äussern, oder sogar das Spiel mit Absicht  verlassen (finde ich jetzt viel schlimmer) es kommt immer einer welcher eine Schippe dazu legt. Ich wünsche dir jedenfalls weiterhin viel Spass bei deinen Spielen ;)","replies":[]},{"poster":"Zavolta","date":"2020-01-01T16:56:44.308+0000","up_votes":1,"down_votes":0,"body":"Warum so kompliziert... gibt doch diverse lol-stats-seiten, bei denen man auch nach Spielern suchen kann und jeweils die letzten X Spiele anschauen.... ich setze die jeweiligen Spieler immer als Lesezeichen in meinen LOL-Troll-Firefox-Ordner... und schaue dann mal immer nach... einige hatten in der Tat eine seltsame 14 Tage Abstinenz... \n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"ImtheNOSE","date":"2020-01-08T15:35:25.411+0000","up_votes":1,"down_votes":0,"body":"gute idee mache ich inziwschen auch :)","replies":[{"poster":"Zavolta","date":"2020-01-08T17:23:04.040+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ImtheNOSE,realm=EUW,application-id=KYnfKGf0,discussion-id=Abp2AIEk,comment-id=00000000,timestamp=2020-01-08T15:35:25.411+0000)\n>\n> gute idee mache ich inziwschen auch :)\n\n{{sticker:slayer-jinx-catface}}","replies":[]}]}]},{"poster":"Vorzüglich","date":"2020-01-01T21:20:10.063+0000","up_votes":2,"down_votes":6,"body":"Na da braucht es viel mehr, du bist noch ganz am Anfang des \"Report Stalking\".\n\nWirst schon noch rausfinden wie \"toll\" das System tatsächlich funktioniert.\n\nUnd da spielt die liebe Kategorie fast so eine hohe Rolle, wie ob es einer oder mehrere reporten^^\n\nGar nicht.\n\nAlle Funktionen sind rein Placebo, in jenem Placebo System.\n\nAber ich will dich nicht abhalten^^","replies":[{"poster":"Zavolta","date":"2020-01-02T06:27:08.110+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Vorzüglich,realm=EUW,application-id=KYnfKGf0,discussion-id=Abp2AIEk,comment-id=0004,timestamp=2020-01-01T21:20:10.063+0000)\n>\n> Na da braucht es viel mehr, du bist noch ganz am Anfang des \"Report Stalking\".\n> \n> Wirst schon noch rausfinden wie \"toll\" das System tatsächlich funktioniert.\n> \n> Und da spielt die liebe Kategorie fast so eine hohe Rolle, wie ob es einer oder mehrere reporten^^\n> \n> Gar nicht.\n> \n> Alle Funktionen sind rein Placebo, in jenem Placebo System.\n> \n> Aber ich will dich nicht abhalten^^\n\nNiedlich.\nSo einen hatte ich auch mal im Team. Hat das System verlacht und angegeben, dass er seit langen Zeiten toxisch ist und weiß, wie er trollen muss, damit ihm nichts passiert und so...\n... naja, hab von all seinen Chat-Beiträgen Screenshots gemacht und danach ein Ticket geschrieben.  2 Tage später hat dieser Spieler keine Spiele mehr gemacht, für genau 14 Tage.\n\nAbgesehen davon: hier kann man doch immer schön lesen, dass das System funktioniert...bei den vielen \"Warum wurde ich gebannt\" Themen.\n{{sticker:slayer-jinx-wink}} ","replies":[{"poster":"ImtheNOSE","date":"2020-01-04T15:09:48.745+0000","up_votes":1,"down_votes":0,"body":"Kannst du mir kurz erklären, worauf es beim Ticket schreiben ankommt und wie am besten vorzugehen ist? Klingt effektiv :)\nund das System ingame ist echt bedauernswert","replies":[]},{"poster":"Vorzüglich","date":"2020-01-02T21:17:37.552+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Zavolta,realm=EUW,application-id=KYnfKGf0,discussion-id=Abp2AIEk,comment-id=00040000,timestamp=2020-01-02T06:27:08.110+0000)\n>\n> Niedlich.\n> So einen hatte ich auch mal im Team. Hat das System verlacht und angegeben, dass er seit langen Zeiten toxisch ist und weiß, wie er trollen muss, damit ihm nichts passiert und so...\n> ... naja, hab von all seinen Chat-Beiträgen Screenshots gemacht und danach ein Ticket geschrieben.  2 Tage später hat dieser Spieler keine Spiele mehr gemacht, für genau 14 Tage.\n> \n> Abgesehen davon: hier kann man doch immer schön lesen, dass das System funktioniert...bei den vielen \"Warum wurde ich gebannt\" Themen.\n> {{sticker:slayer-jinx-wink}}\n\nSehr niedlich sogar, du bezeugst ja mit deinen eigenen Aussagen dass das System nicht alleine funktioniert, wenn du erst ein ticket schreiben musst, zeigt das ja auf, dass dass System allein nichts taugt. \nDanke für deine Bestätigung meiner Aussage.\n\nBtw. 14 Tage Ban^^ wow allerhand, da meinst wohl hätte der Support dir einen Gefallen getan^^ \nDer Typ wird lol wahrscheinlich noch länger \"spielen\" als du selbst.\n\nUnd dir ist schon klar, wieviel % hier von den Spielern das InGame Spiel repräsentieren?\nIst schon sehr repräsentabel das Forum hier...\nSollte dich nachdenklich stimmen^^","replies":[{"poster":"Zavolta","date":"2020-01-03T05:58:21.973+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Vorzüglich,realm=EUW,application-id=KYnfKGf0,discussion-id=Abp2AIEk,comment-id=000400000000,timestamp=2020-01-02T21:17:37.552+0000)\n>\n> Sehr niedlich sogar, du bezeugst ja mit deinen eigenen Aussagen dass das System nicht alleine funktioniert, wenn du erst ein ticket schreiben musst, zeigt das ja auf, dass dass System allein nichts taugt. \n> Danke für deine Bestätigung meiner Aussage.\n> \n> Btw. 14 Tage Ban^^ wow allerhand, da meinst wohl hätte der Support dir einen Gefallen getan^^ \n> Der Typ wird lol wahrscheinlich noch länger \"spielen\" als du selbst.\n> \n> Und dir ist schon klar, wieviel % hier von den Spielern das InGame Spiel repräsentieren?\n> Ist schon sehr repräsentabel das Forum hier...\n> Sollte dich nachdenklich stimmen^^\n\n{{champion:48}}","replies":[]},{"poster":"Angel Ayume","date":"2020-01-05T10:59:40.028+0000","up_votes":1,"down_votes":0,"body":"Ich habe auch schon genug Rückmeldungen über eine Strafe erhalten OHNE ein Ticket schreiben zu müssen.\nOder willste jetzt etwa behaupten die Meldungen ploppen random auf damit es so aussieht als wäre was passiert? :D","replies":[]}]}]}]},{"poster":"AramStufe Rot","date":"2020-01-02T11:16:07.460+0000","up_votes":1,"down_votes":0,"body":"get cancer, kys, hope u die sind in meinen spielen zum glück auch eher die ausnahme\nnur das normale rumgepöbel wenn man mal was verkackt oder wieder nen op champ im gegner team ist\n\ngestern kam mir seit ewigkeiten mal wieder ein \"gay retards\" unter","replies":[]},{"poster":"Kira Rengami","date":"2020-01-02T03:45:32.891+0000","up_votes":1,"down_votes":0,"body":"Jop, ist leider alltäglich und vollkommen normal in League.\nEInfach nicht so ernst nehmen.","replies":[]}]}