{"poster":"Adelvert","date":"2019-11-02T17:47:12.476+0000","title":"Ahora entiendo el AURF","subforum":"Charlas Generales","up_votes":27,"down_votes":7,"body":"Después de varias partidas en el URF clásico entiendo por que se hizo que sea aleatorio el pick.\r\n\r\nLos mismos 4 campeones siempre.. ni 1 idea se les cae.. Zed / Ziggs / Malphite / Lee Sin / Akali etc etc\r\n\r\n150 campeones y solo se ven los mismos.\r\n\r\nComo en su momento me queje de Riot por hacerlo ALEATORIO .. ahora nobleza obliga a decir GRACIAS.\r\n\r\nGRACIAS RIOT POR HACER EL MODO ALEATORIO Y QUE EL EVENTO NO SEA ABURRIDAMENTE REPETITIVO\r\n\r\nGRACIAS\r\n\r\n {{sticker:slayer-pantheon-thumbs}} !!!!!!!!!!!!!!!!!!","replies":[{"poster":"LolisOfLove","date":"2019-11-02T19:02:24.797+0000","up_votes":17,"down_votes":2,"body":"Personalmente a mi me aburrió ya xD al principio es divertido pero despues de cuatro o cinco games en el que salis 20/0 o 0/20 termino prefiriendo relajarme con un aram.","replies":[{"poster":"el papu escanor","date":"2019-11-02T19:45:28.642+0000","up_votes":7,"down_votes":1,"body":"aram is life  uWu","replies":[]}]},{"poster":"Dog Bulling","date":"2019-11-02T19:27:54.945+0000","up_votes":12,"down_votes":1,"body":"¿Que te puedo decir? SIEMPRE que explicaba como el antiguo URF no era tan buen modo, era absurdamente repetitivo a mediano plazo, y prefería tener picks aleatorios antes que el URF original, me cargaban a negativos. Supongo que la gente se dio cuenta recién ahora de porque decía aquello, tanto yo como algunos miembros de riot en ese \"preguntale a riot\".\n\nSinceramente, siento que URF en general tiene muchos problemas, sobretodo el hacerte olvidar que es un juego PvP y no PvE, lo cual causa una experiencia frustrante con demasiada frecuencia en comparación a otros modos. Prefiero muchas veces el One for All debido al concepto del Wombo-combo y el tener que usar varios personajes.","replies":[{"poster":"Adheliøs","date":"2019-11-03T02:28:25.602+0000","up_votes":6,"down_votes":2,"body":"Pensaba que todos los jugadores antiguos entendian porque existia el AURF xD si cuando salio jugabas un game y ya aburria y frustraba y ahora igual.","replies":[]}]},{"poster":"Mazoku","date":"2019-11-02T17:48:19.735+0000","up_votes":12,"down_votes":2,"body":"Te tomo su tiempo eh.","replies":[{"poster":"Adelvert","date":"2019-11-02T17:49:39.614+0000","up_votes":7,"down_votes":4,"body":"> [{quoted}](name=Mazoku,realm=LAS,application-id=v7qsfXsE,discussion-id=fkZZ0K2s,comment-id=0000,timestamp=2019-11-02T17:48:19.735+0000)\n>\n> Te tomo su tiempo eh.\n\nNunca es tarde para aceptar los errores.","replies":[{"poster":"Mazoku","date":"2019-11-02T23:06:13.684+0000","up_votes":3,"down_votes":2,"body":"Si, aveces es tarde.\n\nComo en este caso que una resolucion ya fue tomada.","replies":[]}]}]},{"poster":"Løtus Flower","date":"2019-11-02T22:46:18.487+0000","up_votes":2,"down_votes":0,"body":"Es lo mismo, pasa que solo no te encontrás con los clásicos picks. Me explico, cuando se jugaba aleatorio, dependias del azar para que te tocará un buen champ o una buena composición. En pocas palabras, la frustración es igual, ya que aveces te aburrias pq no te salía algo tan roto como al resto.","replies":[{"poster":"VenganceZ","date":"2019-11-03T03:14:39.954+0000","up_votes":7,"down_votes":0,"body":"En Aram es exactamente igual y mucha gente lo juega","replies":[{"poster":"Dog Bulling","date":"2019-11-03T14:14:20.647+0000","up_votes":3,"down_votes":0,"body":"Y encima ARAM tiene algo que le salva: Un ritmo relativamente calmado de juego, en el cual se da marco para remontadas, a diferencia de URF.","replies":[]}]},{"poster":"TeamSayori","date":"2019-11-03T07:27:22.217+0000","up_votes":2,"down_votes":1,"body":"esa es la gracia, la suerte","replies":[]}]},{"poster":"Zetsubou Jhin","date":"2019-11-02T18:53:48.254+0000","up_votes":9,"down_votes":2,"body":"Es jugar lo que esta fuerte o frustrarse. Por algo rito dice que este modo es el que más daña lol","replies":[{"poster":"BoomRx","date":"2019-11-02T23:29:39.161+0000","up_votes":3,"down_votes":2,"body":"Es lo que mas daña a lol porque cuando urf termina la gente se va del juego, ponele que un 100% estandar esta jugando, llegan un 40% mas de jugadores porque esta urf, cuando urf termina queda un 60% de los jugadores estandar, es eso lo que los caga, que la gente despues de tener urf encuentra aburridos los demas modos, cosa que a mi personalmente me ha pasado en otras ocasiones.","replies":[{"poster":"YlHADlSTA","date":"2019-11-03T03:58:30.433+0000","up_votes":4,"down_votes":5,"body":"URF es aburrido, la gente no sabe ni jugar un URF. Son aburridos, van a la linea y esperan 2 min hasta que salgan los minions. Te toca un chabon que elige TF y en 15 min de URF participa en 4 asesinatos nomás. Eso es aburrido de URF, te lo pintan como que es re copado y la gente es demasiado aburrida y noob hasta para URF.","replies":[{"poster":"BoomRx","date":"2019-11-03T20:00:45.396+0000","up_votes":2,"down_votes":0,"body":"Creeme que en arurf pasaba exactamente lo mismo, con la diferencia de que la mayoria de partidas te va a salir un champion al azar que no te gusta y te vas a aburrir x2, y era peor la frustracion sabiendo que al team enemigo le sale un champ que te hace kk y a vos no te sale nada decente.\n\nPor desgracia uno no controla a la gente, lo que no entiendo es la gente que se queja no jugaba arurf? no se acuerdan lo aburrido que era la experiencia de jugar cait vs sivir? yorick vs ahri? cualquier pick contra zed o la akali recien reworkeada? tener que estar poco mas y afk con un champ que no les guste?","replies":[]}]}]}]},{"poster":"Mahler3599","date":"2019-11-02T18:47:12.904+0000","up_votes":8,"down_votes":2,"body":"Jajaja recién ahora se dan cuenta, encima es un modo de juego monótono que a la larga aburre.","replies":[]},{"poster":"BoomRx","date":"2019-11-02T18:17:34.290+0000","up_votes":6,"down_votes":7,"body":"Estas mal, si queres jugar los 150 champ uno por uno sos libre de hacerlo, dejale al resto disfrutar los campeones que quieran jugar, yo en lo personal he visto 1 solo ziggs en mas de 30 partidas, y he visto wukons, karmas, ornns, iverns e incluso singeds, viendo esos picks no me parece tampoco decir que no hay gente que juege otros champs.\n\nEn lo personal prefiero ver gente repitiendo campeones y poder jugar lo que me gusta, que tener que jugar caitlin vayne y twitch 20 veces seguidas para poder jugar una partida con un champ que me llege a gustar (claro que con suerte en 1 de 200 partidas juege el champ que quiero, si el modo arurf dura lo suficiente para que lleges a eso)","replies":[{"poster":"YlHADlSTA","date":"2019-11-03T03:55:01.449+0000","up_votes":5,"down_votes":0,"body":"Bro, no pasa por que el otro juegue lo que quiere. No tenes que ser tan hater.\nSe refiere a que solo eligen los mismos campeones nomás. \nYo no sé que urf jugas vos, pero eligen ziggs, fizz si esta abierto, jhin, lux, lee, shaco, cait, y dos o tres más casi todas las partidas. \nTiene razón lo que dice, es muy repetitivo a veces.","replies":[]}]},{"poster":"Zeirøx Notwênd","date":"2019-11-02T18:15:48.241+0000","up_votes":9,"down_votes":4,"body":"Para mi con ARURF era mas que suficiente, los que siempre pidieron URF clásico al parecer se olvidaron lo frustrante que era en aquel tiempo que siempre estén los mismos picks...","replies":[]},{"poster":"Stalker Zer0","date":"2019-11-02T18:42:11.604+0000","up_votes":4,"down_votes":2,"body":"Te apoyo y no solo eso, también uno tampoco puede probar otro campeón de lo que ya mencionas ya que si o si pierdes la partida, todo porque otros campeones: lee sin, akali, zed, etc. Te deletean tu campeon en micro segundo literalmente y lo digo por experiencia propia, ni Aurelion sol puedo probar sin que un shaco o lee me deletee en segundos","replies":[{"poster":"Mahler3599","date":"2019-11-02T18:45:49.847+0000","up_votes":3,"down_votes":25,"body":"Perdón pero URF, no es para probar champ.","replies":[{"poster":"Aniryth","date":"2019-11-02T20:08:08.643+0000","up_votes":7,"down_votes":1,"body":"Perdón pero URF es un modo de juego que se supone esta hecho para divertirse.. si quiero probar champ, lo hago :v","replies":[{"poster":"Adelvert","date":"2019-11-02T20:17:48.537+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Aniryth,realm=LAS,application-id=v7qsfXsE,discussion-id=fkZZ0K2s,comment-id=000300000001,timestamp=2019-11-02T20:08:08.643+0000)\n>\n> Perdón pero URF es un modo de juego que se supone esta hecho para divertirse.. si quiero probar champ, lo hago :v\n\nEl detalle es que nadie prueban nada.. todos usan lo mismo... son raros los casos de ver alguien con un campeon fuera de lo comun.","replies":[{"poster":"Aniryth","date":"2019-11-03T16:09:37.810+0000","up_votes":2,"down_votes":1,"body":"Las primeras partidas que jugue intente probar champs, pero me salian en contra puros champs rotos y gente con complejo de trynda que se dedicaba a matar y pushear nada más. Así que me aburri y ahora ando a puro Shaco :'v","replies":[]}]}]}]}]},{"poster":"TheNydra","date":"2019-11-03T15:36:09.031+0000","up_votes":3,"down_votes":0,"body":"Prefiero por mucho el tener la posibilidad de elegir yo lo que voy a jugar, si bien es normal que 1 de cada 2 partidas te encuentres con los mismos campeones el juego, aunque cueste creerlo, esta bastante balanceado si te viene un Zed podes salvarte y matarlo sin mucho problema con casi cualquier campeón\nMientras que en el modo aleatorio no soluciona para nada el tema de ver y/o jugar con los mismos campeones de siempre, los juegos van mucho de la suerte que hayas tenido en el draft\ny si perdes lo unico que puede salir de vos es decir ``ah, perdi porque me toco jugar Janna, Kindred vs Kai´sa, Yummi´´ en lugar de ver tus errores y intentar jugarla mejor y divertirte \n\nEn mi caso los campeones que siempre me salian en aleatorio era siempre Alistar, Janna y Nidale y era aburridisimo no poder jugar con mi Rengar o LeBlanc que son mis main y lo que me divierte mas","replies":[{"poster":"BoomRx","date":"2019-11-03T19:46:20.500+0000","up_votes":3,"down_votes":0,"body":"Yo el ultimo arurf queria jugar blitz, me juge como 100 partidas y me salio una sola vez, y en esa partida justo tube 2 afks, divertidisimo todo","replies":[]}]},{"poster":"Zelos From Jonia","date":"2019-11-03T10:51:31.677+0000","up_votes":1,"down_votes":0,"body":"Poner o sacar un modo, cambiar algunas variables o modificar algun ratio no es tan simple como \"estan posteando mucho que quieren que ashe use tp en la e\"...\n\nLo digo porque pasan muchas cosas de ambos lados, por parte de los jugadores, pocos expresan su pensamiento, y de los que lo hacen (que en realidad no son una muestra representativa como lo veo yo) tienen una tendencia.\nAhora, ¿cuantos usan el foro? Con la cantidad de gente que juega lol, tenes 150.000 jugadores diarios, ves el foro lleno con 1000 post de poner **URF** normal, lo pones, pero pasa que no tenes en cuenta a los otros 149000 que capaz ni entran al foro PORQUE ASI ESTABA PERFECTO.\n\nPor otro lado, tenes la vision de riot, que de la poca info y sesgada que le da el jugador trata de balancear dentro de lo que puede hacer. Dice ok probemos esto (que es algo pedido por la comunidad) y resulta que es un desastre total, y todos salen a pegarle a riot, cuando en realidad riot esta tratando de darles el gusto.\n\nResumen:\nComo son pocos los que se expresan siempre va a haber un MONTON de gente descontenta hagan lo que hagan.\nHaga lo que haga Riot siempre va a recibir palos (creo que ya aprendieron a vivir con eso)\nTodo es en funcion de tener una mejor experiencia de juego.\nGana SKT sabelo.","replies":[{"poster":"TheNydra","date":"2019-11-03T15:24:43.836+0000","up_votes":3,"down_votes":0,"body":"F por SKT","replies":[]}]},{"poster":"Borriic III","date":"2019-11-02T20:36:24.812+0000","up_votes":6,"down_votes":3,"body":"mas que por los champs repetitivos, es por la actitud pelotuda de la gente que abunda en el modo de juego que este pierde la gracia\n\nme da igual si alguien quiere ponerse a junglear con akali o sacar una ahri adc o un braum de velocidad de ataque, para eso esta el modo, para probar cosas ridiculas y que igual y esten rotas, pero que hacen todos los boluditos? lo tryhardean como si fuera su promo a challenger y por algun motivo los que mas lo hacen son silvers y goldies ... como que alimentan el meme realmente\n\nquieren sacar shaco o fiora o fizz porque saben que estan rotos ta bien, se sabe que la van a stompear y demas bien por ellos, pero que ganan con pushear todo 24/7, tryhardear al que se cayo al inicio y esta lvl 1 mientras son lv 9 o spamear maestrias e \"izis\" por el chat? lo unico que demuestran es que son altos forros si hacen eso, es mas, deberia haber un boton de reporte para este evento de \"tryhard\" o algo asi porque este es justamente el evento en el que NO TENES QUE JUGAR PARA GANAR sino para divertirte\n\ny ya para que hablar de las jinx o tristanas que entran a splitpushear toda la partida... ni gracia tiene\n\n#una vez mas la comunidad destruye un modo de juego genial","replies":[{"poster":"TeamSayori","date":"2019-11-03T07:37:33.591+0000","up_votes":3,"down_votes":0,"body":"nose porque te dieron negativo si en parte tenes razon, los que cagan el modo son la misma gente que tryhardea como si fuese ranked en lugar de divertirse un poco xD","replies":[{"poster":"Mahler3599","date":"2019-11-04T14:13:39.129+0000","up_votes":2,"down_votes":0,"body":"Le dan negativo por qué la comunidad de las es un cáncer, no pensás como ellos y ya te insultan , así estamos. Tampoco se sientan a leer y analizar lo que la gente quiere decir.","replies":[{"poster":"Koto","date":"2019-11-05T21:17:23.403+0000","up_votes":1,"down_votes":0,"body":"Opino lo mismo que vos","replies":[]}]}]},{"poster":"Koto","date":"2019-11-02T22:04:49.854+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"Borriic III","date":"2019-11-03T05:56:49.412+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Koto,realm=LAS,application-id=v7qsfXsE,discussion-id=fkZZ0K2s,comment-id=000b0000,timestamp=2019-11-02T22:04:49.854+0000)\n>\n> Que tiene querer ganar? gil\n\nSeria bueno que aplicaras la misma filosofia para las rankeds :)\n\nCorre que se te acaba la season\n\nSaludos","replies":[{"poster":"Koto","date":"2019-11-05T21:16:06.182+0000","up_votes":1,"down_votes":1,"body":"Hace banda estoy en oro en las 2 colas papi, ya tengo las recompensas. Para que querría subir más ligas? para un icono y un marquito que no demuestran nada? seguí matandote por intentar subir a diamante y más arriba que ganas una banda de cosas esforzandote tanto.  \n\nSaludos","replies":[{"poster":"Borriic III","date":"2019-11-05T21:53:53.202+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Koto,realm=LAS,application-id=v7qsfXsE,discussion-id=fkZZ0K2s,comment-id=000b000000000000,timestamp=2019-11-05T21:16:06.182+0000)\n>\n> Hace banda estoy en oro en las 2 colas papi, ya tengo las recompensas. Para que querría subir más ligas? para un icono y un marquito que no demuestran nada? seguí matandote por intentar subir a diamante y más arriba que ganas una banda de cosas esforzandote tanto.  \n> \n> Saludos\n\ncon un KDA menor de 2 con tu \"mejor\" champ :D seguro que no subis porque no queres? \n\nPD: hace banda que ya soy diamond :) pero gracias por tus buenos deseos {{sticker:sg-ahri-2}}","replies":[{"poster":"Koto","date":"2019-11-09T01:38:51.198+0000","up_votes":1,"down_votes":1,"body":"Cuál es mi mejor champ? Felicidades por ser Diamond, que ganaste siendolo? Plata? Respeto? Buenos momentos? Perdiste tiempo nada más. Igual si a vos te llena el corazón porque no tenes más nada la verdad estoy muy feliz por vos","replies":[{"poster":"Borriic III","date":"2019-11-10T04:07:29.574+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Koto,realm=LAS,application-id=v7qsfXsE,discussion-id=fkZZ0K2s,comment-id=000b00000000000000000000,timestamp=2019-11-09T01:38:51.198+0000)\n>\n> Cuál es mi mejor champ? Felicidades por ser Diamond, que ganaste siendolo? Plata? Respeto? Buenos momentos? Perdiste tiempo nada más. Igual si a vos te llena el corazón porque no tenes más nada la verdad estoy muy feliz por vos\n\n-plata no porque no quise, toma mucho tiempo generar contenido y empezar a ver monedas\n-respeto quiza, la gente te trata mejor dentro del juego cuando sos diamante y no estas stuckeado en bronce/plata/oro\n-buenos momentos definitivamente, si juego para mejorar y divertirme con amigos :) \n.\ny si, la verdad es que mi mina es mas feliz cuando le puede comentar a sus amigos frikis que su novio es diamond y bueno tambien puede sacar mas chistes respecto a eso asi que nos reimos mas, en la uni la mayoria de la gente juega y que te tengan en consideracion para ir a jugar los torneos locales igual se siente bien aunque casi nunca voy porque no tengo tiempo, incluso en el laburo cuando hace ocio uno conversa con los colegas sobre lol porque mucha gente juega .-. asi que si vieja la verdad llena bastante el cora tener un tema mas de conversacion\n.\nme alegra compartirte mi felicidad :3 \n\nPD: sigue practicando duro esa fiora, cuando llegues a los 3 de KDA fijo tiras a platino facil a punta de carrear quesos :D","replies":[{"poster":"Koto","date":"2019-11-10T07:58:37.664+0000","up_votes":1,"down_votes":1,"body":"No me cuentes tu vida amigo porfavor, leí lo primero y el pd nada más. Y fiora no es mi main, no sé que flasheas jajaja\n\nPlata no ganas no porque no quieras, si no porque no podes, respeto? respeto no te dan hasta master, en diamante son todos re tóxicos y para abajo igual, más cuando ves un \"diamante\" jugando como plata y buenos momentos nada más ganas jugando con amigos en ranked, pero no creo que hayas jugado tus 200 partidas acompañado","replies":[]}]}]}]}]}]}]},{"poster":"Aniryth","date":"2019-11-03T16:11:57.035+0000","up_votes":2,"down_votes":0,"body":"Eso que dices de tryhardear es muy cierto, no me ha tocado un team que no se dedique a pushear todo el rato y de verdad es estresante.","replies":[]}]},{"poster":"ŁńĆ Łøvę","date":"2019-11-03T01:53:09.124+0000","up_votes":3,"down_votes":0,"body":"Posta que aburre ver los mismos picks, saca una zyra aunque sea. Re aburridos jajaja son re competitivos en ese modo que se tiltean por todo.","replies":[]},{"poster":"FL Nordin","date":"2019-11-02T21:29:26.351+0000","up_votes":3,"down_votes":0,"body":"No se ustedes, pero jugar Sion con Letalidad o Criticos es divertido","replies":[]},{"poster":"Nyandryx","date":"2019-11-02T19:02:22.533+0000","up_votes":3,"down_votes":0,"body":"Es un evento destacado que dura solo 1 semana o 2, por qué habría que \"balancear\" Urf así, yo sigo decepcionado porque no pusieron el tp y hayan dejado el caño la vrd","replies":[{"poster":"Garoü","date":"2019-11-04T04:09:13.944+0000","up_votes":1,"down_votes":0,"body":"Imagínate como la tryhardearian los xpeke con tp a la partida, sería repugnante","replies":[]}]},{"poster":"Neeko","date":"2019-11-02T22:55:33.916+0000","up_votes":5,"down_votes":2,"body":"jajaja lo más divertido es no jugar ninguno de los dos urfs, salu2","replies":[{"poster":"VenganceZ","date":"2019-11-03T03:13:44.019+0000","up_votes":2,"down_votes":0,"body":"El macho","replies":[]}]},{"poster":"StephenLegends","date":"2019-11-03T16:07:53.825+0000","up_votes":2,"down_votes":0,"body":"No sé que tipo de URF estás jugando tú, pero de los campeones que mencionas (los más \"OP\" por decirlo de una manera) siempre los pasan baneando, ahora sí en las partidas que has jugado tú no es así, pues que lástima. Además, he jugado bastantes URF's y de todas esas veces sólo dos he podido elegir Zed, para que dimensiones el ban ratio que presenta en partidas de este estilo.","replies":[]},{"poster":"SrLarge","date":"2019-11-03T05:19:49.978+0000","up_votes":3,"down_votes":1,"body":"Yo tengo mi cuenta main en brasil, y jugue urf en ese servidor no en este  y de verdad mucho mas entretenido. acá se nota lo noob q es la gente para el juego.","replies":[]},{"poster":"Elige Tu Supp","date":"2019-11-02T21:42:37.906+0000","up_votes":2,"down_votes":1,"body":"A pesar de que entiendo el punto de vista y es claro... yo solo uso urf para distenderme de las ranked, en especial cuando perdi una partida y ando medio tilt, comprendo la finalidad de urf y me cago de risa con las cosas que se pueden hacer solo por diversion. ni te cuento cuando se agarran a madrasos en el all chat, solo porque se mueren XD","replies":[]}]}