{"poster":"MonkWithAttitude","date":"2016-07-16T09:17:11.596+0000","title":"Ho perso 16 LP con il Remake!","subforum":"Aiuto e supporto","up_votes":8,"down_votes":3,"body":"Salve a tutti!\r\nIeri sera, dopo aver startato una partita classificata con Kindred, io e la mia squadra ci accorgiamo di avere un nostro compagno afk (Gnar), quindi decidiamo tutti insieme di utilizzare il remake, e quindi di rimanere tutti in base per aspettando il terzo minuto per non fare o subire uccisioni.\r\nAttuato il remake, alla schermata di &quot;fine game&quot; mi appare un avviso che dice che per le prossime 5 partite subir&ograve; una coda di 20 minuti. Come se ci&ograve; non bastasse, tonato sul mio profilo , mi accorgo che oltre ad aver ricevuto una coda a bassa priorit&agrave;, mi sono ritrovato con ben 16 LP IN MENO!\r\nInoltre, alla persona andata afk non &egrave; stata data NESSUNA sanzione, ma al contrario, le &egrave; stata attribuita la sconfitta normale, come se non avesse fatto niente. In pratica il sistema ha riconosciuto ingiustamente in me la persona andata afk (e quindi da sanzionare), e nel mio compagno di squadra la persona a cui attribuire la sconfitta normale.\r\nVorrei chiedere spiegazioni a riguardo poich&egrave; io non ho infranto nessuna regola, n&egrave; durante questa partita, e n&egrave; durante quelli\r\n precedenti, infatti si pu&ograve; notare come io abbia anche acquistato gli oggetti iniziali appena startato il game. Vorrei capire il perch&egrave; di questa sanzione assolutamente ingiusta nei miei confronti. Questo &egrave; un errore gravissimo da parte del sistema ed ESIGO almeno la restituzione degli lp ingiustamente tolti, poich&egrave; ,ripeto, io non ho infranto nessuna regola, ma ho solo rispettato i requisiti che il remake richiede.\r\nSpero che qualche Wrenchman, o magari anche qualche Rioter legga questo post e cerchi di aiutarmi.\r\nGrazie per le eventuali risposte! :D\r\n\r\nNome in game: MonkWithAttitude{{champion:64}}","replies":[{"poster":"BrattishSolid6","date":"2016-07-16T12:50:36.483+0000","up_votes":2,"down_votes":0,"body":"Ti consiglio di aprire subito un ticket al Supporto (qui: https://support.riotgames.com/hc/it ). Nessuno sul Forum può provvedere a un'eventuale restituzione di LP :/ Buona fortuna, e facci sapere come va a finire ^^\n\nN.B. Apri **UN SOLO** ticket al Supporto. Se ne apri di più semplicemente ogni volta verrai messo in fondo alla coda","replies":[{"poster":"MonkWithAttitude","date":"2016-07-16T13:13:53.622+0000","up_votes":1,"down_votes":0,"body":"Grazie per il consiglio per quanto riguarda il ticket ^^ ho già provveduto ad inviarlo e spero di ricevere al più presto una risposta dal Supporto :D","replies":[{"poster":"dP Nebula","date":"2016-07-16T15:15:20.968+0000","up_votes":3,"down_votes":0,"body":"Questo succede solo tra  premades diamond, perché parlate senza sapere le cose.","replies":[]}]},{"poster":"InsanityGame","date":"2016-07-16T12:57:50.889+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BrattishSolid6,realm=EUW,application-id=98NGV4Al,discussion-id=aocbzvxK,comment-id=0002,timestamp=2016-07-16T12:50:36.483+0000)\n>\n> Ti consiglio di aprire subito un ticket al Supporto (qui: https://support.riotgames.com/hc/it). Nessuno sul Forum può provvedere a un eventuale restituzione di LP :/ Buona fortuna, e facci sapere come va a finire ^^\n> \n> N.B. Apri UN SOLO ticket al Supporto. Se ne apri di più semplicemente ogni volta verrai messo in fondo alla coda\n\nhai messo il link con la parentesi ( parentesi chiusa )  attaccata per cui riporta ad una pagina del sito giusto ma con la scritta \"errore\" enorme rossa .\navevo scritto lo stesso post , l'ho cancellato dopo aver visto il tuo .\n\nhttps://support.riotgames.com/hc/it","replies":[{"poster":"BrattishSolid6","date":"2016-07-16T13:06:48.709+0000","up_votes":2,"down_votes":0,"body":"Corretto.\nGrazie mille per l'avviso, mi era proprio sfuggito ^^","replies":[]}]}]},{"poster":"Menfrix","date":"2016-07-16T14:35:01.868+0000","up_votes":2,"down_votes":1,"body":"Eri premade con l'afk? nel caso non c'è nessun errore, i punti vengono giustamente tolti anche al compagno dell'afk...\nAl contrario, aspetta risposta al ticket che hai già mandato...","replies":[]},{"poster":"ÐamnatioMemoriae","date":"2016-07-16T10:45:59.568+0000","up_votes":1,"down_votes":2,"body":"Gli lp persi sono persi icsdi.\nEd esigere non è un verbo che un player può utilizzare xdxd","replies":[{"poster":"MonkWithAttitude","date":"2016-07-16T11:25:59.253+0000","up_votes":1,"down_votes":0,"body":"Scusami, forse mi sono espresso male. Volevo solo chiedere se esiste la possibilità che gli Lp che mi hanno tolto ingiustamente mi vengano restituiti..","replies":[]}]},{"poster":"TSB Sharp","date":"2016-07-16T10:47:00.871+0000","up_votes":1,"down_votes":0,"body":"Probabilmente, la sconfitta piena ed il leaverbuster sono stati dati a tutti in quanto stare fermi alla fontana viene contato dal sistema come stare afk.\nLa prossima volta considera il fatto che, se il first blood viene fatto dopo che il tizio fa afk, il remake sarà ancora possibile.","replies":[{"poster":"MonkWithAttitude","date":"2016-07-16T10:53:53.041+0000","up_votes":1,"down_votes":0,"body":"Purtroppo le sanzioni sono state date soltanto a me, in quanto io stavo giocando con un premade, e lui non ha ricevuto niente, anche rimanendo alla fontana insieme ad il resto del team.","replies":[{"poster":"TSB Sharp","date":"2016-07-16T11:03:31.551+0000","up_votes":1,"down_votes":0,"body":"Avevi precedenti recenti per afk?","replies":[{"poster":"MonkWithAttitude","date":"2016-07-16T11:15:55.262+0000","up_votes":1,"down_votes":0,"body":"Si, 2 giorni fa mi è capitato di andare afk per problemi di connessione, ma si trattava di  una normal. Inoltre ho ricevuto comunque una coda a bassa priorità per quella partita, che, senza alcun dubbio meritavo.\nMa non credo che la perdita di Lp sia collegato a questo precedente, poichè si è trattato di una normal, e credo che sanzioni ricevute in esse(tra l'altro già scontate)  non dovrebbero avere ripercussioni sulle partite classificate..","replies":[]}]}]}]}]}