{"poster":"CPB4P8enYF","date":"2016-07-16T19:33:44.211+0000","title":"BarbaKahn y una suspensión/cancelación de sus cuentas.","subforum":"Comportamiento del jugador","up_votes":19,"down_votes":148,"body":"La razón por la que hago este post es irrelevante, vengo a dejar varias pruebas de por que BarbaKahn debe ser suspendido inmediatamente o recibir un castigo.\r\nVi a Barba desde que inicio en Youtube (más o menos) y es una falta de respeto que jamás lo hayan baneado (sin contar su main acc que estuvo baneada por temas monetarios), es una mala influencia para el codigo de conducta del invocador.\r\nSacando ese tema de lado, recuerdo que hace mucho tiempo a barbakahn le habia tocado un zed enemigo que era un elo booster (los old de hmm izi lo van a recordar) y el habia hecho un post para que le banearan la cuenta, y la terminaron baneando.\r\nÉl esta utilizando cuentas que no son suyas y nadie hace o dice nada, desde 2014 él era oro v y cuando empezó con su serie de los bronzas en las/lan se podría considerar que el estaba haciendo \"elo boost\", actualmente el no tiene un buen nivel de juego y es por eso que no se lo puede considerar como elo booster pero en ese entonces sí (a rabia también le banearon su cuenta cuando estaba haciendo un \"bronze to challenger\" en NA porque no cumplia con los términos y condiciones)\r\nMás allá de eso, solicito que sea castigado como toda persona normal que juega a league of legends y acepta los términos y condiciones de este.\r\n\"Suspensión/Cancelación.\r\n1.Por parte de Riot Games. HASTA DONDE LO PERMITA LA LEY APLICABLE, RIOT GAMES SE RESERVA EL DERECHO DE SUSPENDER, CANCELAR, MODIFICAR O ELIMINAR LA CUENTA DEL USUARIO A DISCRECIÓN RAZONABLE Y SIN PREVIO AVISO\r\n3.Por parte de la comunidad, por mayoría. (...) los miembros de la comunidad, incluido el usuario, pueden enviar descripciones de las actividades y acciones de otros usuarios del juego, y determinar colectivamente si un usuario en concreto está cumpliendo las políticas de Riot Games en cuando a conducta, incluidas, entre otras, las del Código del Invocador y el Código de conducta.\"\r\nSin mucho mas que decir, dejo links de los videos en los cuales barba dice sin ningún problema que las cuentas son regaladas por los hijos de odin (lo comunica en los primeros minutos de los videos). \r\n\r\n\"Los Bronzas en LAS || Ep1 || BarbaKahn\" : https://www.youtube.com/watch?v=7SfPHnDIxD8\r\n\"Los Bronzas en LAN || Ep 1 || The Best Nocturne Somalia\" : https://www.youtube.com/watch?v=zPgLNvmrNQs","replies":[{"poster":"BarbaKahn","date":"2016-07-16T20:28:11.573+0000","up_votes":65,"down_votes":6,"body":"\"Sin mucho mas que decir, dejo links de los videos en los cuales barba dice sin ningún problema que las cuentas son regaladas por los hijos de odin (lo comunica en los primeros minutos de los videos).\"\n\nExactamente, tal cual dijistes, me las regalaron y me la entregaron las cuentas siendo bronce v, sin runas, con 20 campeones, sin skins, etc cual es el problema? Ahora son mis mains cuentas esas, las tengo hace 2 años mas o menos y encima sigo sin poder de salir de bronce {{champion:2}}","replies":[{"poster":"CPB4P8enYF","date":"2016-07-16T20:32:00.064+0000","up_votes":5,"down_votes":43,"body":"sigue quebrantando las reglas y normas, lamento que nadie de los que comenta lo entienda, pero es en contra de lo que aceptaste marcando el cuadrado de he leído y acepto (...) me da igual que me llenen de dislikes. \nBanean a un monton de gente y vos no deberias ser la excepción porque sos conocido.\neso de que te la regalaron hace tanto tiempo no es excusa.","replies":[{"poster":"dscpnak","date":"2016-07-16T20:36:06.685+0000","up_votes":31,"down_votes":0,"body":"persa promedio","replies":[]}]},{"poster":"Kao Loi","date":"2016-07-16T21:09:33.508+0000","up_votes":5,"down_votes":2,"body":"este tipo quiere atencion, como los especiales y diferentes :V","replies":[{"poster":"TSP AtØry","date":"2016-07-16T21:25:17.794+0000","up_votes":7,"down_votes":1,"body":"Awantiaaaa, gordito diamante","replies":[]}]},{"poster":"Retarded Autist","date":"2016-07-16T21:28:02.015+0000","up_votes":4,"down_votes":15,"body":"Dale Barba, seguí publicando fotos de menores para que tus seguidores les hagan cyberbulling.\nVos seguí así, en tu personaje tóxico, insoportable y con falta de habilidad. Ese personaje que te da tantos seguidores.\n\nYoutubers como vos están demás. Siempre que me encuentro con fans tuyos en el LoL es gente tóxica, lo de falto de habilidad es otra cosa, se puede ser malo pero al menos tener una actitud positiva.\n\nOjalá cambiaras, fueras como otro tipo de youtubers. Se puede ser gracioso sin estar SIEMPRE insultando a una persona o grupo de personas.\n\nPara mi, aunque merecerías ser baneado del juego por tu actitud, eso no fue lo peor. Lo peor fue en el momento en el que ya empezaste a hacer bullying a otros chicos, compartir sus fotos, independientemente de si eran menores o no. Con la excusa de que si estan en el grupo que se la banquen; Como si por entrar al grupo firmaras un acuerdo en el que vos podes hacer lo que quieras con la imagen de uno.","replies":[{"poster":"LaSopitaKawaii","date":"2016-07-16T21:34:48.800+0000","up_votes":11,"down_votes":3,"body":"ñiññiñiiñiñiñ quiero paaan ñiñiñiiñi{{champion:29}} {{champion:29}}","replies":[]}]}]},{"poster":"Caipirinhã","date":"2016-07-16T19:45:26.426+0000","up_votes":27,"down_votes":2,"body":"De los creadores de \" Deberian banear a REVENANT por jugar TF jungla\" llega \" Baneen a BarbaKhan porque es una mala influencia\".\nPD: A Coolife que le hacemos?","replies":[]},{"poster":"Sordon","date":"2016-07-16T19:53:18.126+0000","up_votes":23,"down_votes":2,"body":"\" Sin mucho mas que decir, dejo links de los videos en los cuales barba dice sin ningún problema que las cuentas son regaladas por los hijos de odin (lo comunica en los primeros minutos de los videos\"\nVos mismo lo dijiste, son cuenta regaladas por sus fans entonces no es elooboost porque fueron un regalo son de el esas cuentas\n\nPD: donde esta matias lawwliet cuando se lo nesecita? :v ","replies":[{"poster":"Zindan","date":"2016-07-16T20:29:07.183+0000","up_votes":4,"down_votes":6,"body":"Va encontra de las reglas utilizar cuentas que no creaste vos.","replies":[{"poster":"MAGIVER G4","date":"2017-02-13T00:22:22.735+0000","up_votes":2,"down_votes":0,"body":"Si te las regalan, ya son propiedad tuya, por lo cuál, todo lo que le pase en el futuro a la cuenta caen en el peso de Barba.","replies":[]},{"poster":"SARPADO SCRIPT","date":"2016-07-16T20:48:58.413+0000","up_votes":2,"down_votes":0,"body":"Si, pero si se las regalaron pasan a ser de él.","replies":[]}]}]},{"poster":"Chisolin","date":"2016-07-16T19:36:32.198+0000","up_votes":15,"down_votes":0,"body":"Se viene el {{champion:432}} papá!!","replies":[]},{"poster":"Kou","date":"2016-07-16T19:45:00.770+0000","up_votes":14,"down_votes":0,"body":"Minimamente si vas a acusar/denunciar a alguien pibe hacelo con tu cuenta real payaso da la cara","replies":[{"poster":"Yafue","date":"2016-07-17T09:51:08.332+0000","up_votes":2,"down_votes":0,"body":"Mira como esta esa cuenta lv 7 papá!","replies":[]}]},{"poster":"Ryûjin Ronin","date":"2016-07-16T19:49:30.076+0000","up_votes":11,"down_votes":2,"body":"A ver\nVos decís que el esta usando cuentas que le regalaron, y ¿Cual es el problema? Barbakahn tiene esas cuentas en bronce, no las esta subiendo de liga ni nada por el estilo, no le esta haciendo mal a nadie.\nNo es como el tema de coscu que lo banearon porque era terrible flamer in game (O sea que jodía a cualquiera que estuviera en su team o en el contrario).\nY antes de que me vengas a decir que vengo a defenderlo solo porque es barbakahn, no es así, si alguien no le esta haciendo mal a nadie ¿para que vas a amargarle la vida?\nLo que estoy planteándote es mas por tu actitud que por el ban que le tienen o que deberían meterle.\nSaludos.","replies":[]},{"poster":"Krimmer","date":"2016-07-16T20:16:29.613+0000","up_votes":8,"down_votes":0,"body":"Pide ban con una cuenta nivel 7. Ni cagón el amiwo.","replies":[]},{"poster":"Be a tony stark","date":"2016-07-16T21:53:29.187+0000","up_votes":6,"down_votes":0,"body":"Las reglas tambien dicen que las cuentas son personales y que riot no se hace cargo de lo que hagamos con ellas... esto quiere decir que si yo regalo mi cuenta es problema mio y no de riot o ni de cualquier otra persona","replies":[]},{"poster":"burzako","date":"2016-07-16T19:55:15.293+0000","up_votes":6,"down_votes":0,"body":"vos sos el ekko del ultimo video del barba??","replies":[]},{"poster":"ZileanUItedJesus","date":"2016-07-16T20:59:38.386+0000","up_votes":7,"down_votes":1,"body":"me logeé para darte -1\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"SKYFALL  47","date":"2016-07-17T07:13:33.307+0000","up_votes":2,"down_votes":0,"body":"jajaja buena negro logeado papa{{sticker:slayer-pantheon-popcorn}}","replies":[]}]},{"poster":"Nabuze","date":"2016-07-16T21:41:27.418+0000","up_votes":5,"down_votes":0,"body":"Creo que tu bronca, odio, o como quieras llamarle, hacia Barbakahn no viene por partes de actitudes del lol, es mas bien por cosas que hace o dice en you tube y cosas que hace en facebook. Desde mi punto de vista algo que hizo barba te molesto y buscaste el método mas directo de ver como le podías generar mal a él, recurriste a un foro a denunciarlo sin pensar a la primera regla que viste que el podría estar infringiendo y no te diste cuenta de que estabas violando reglas al hacerlo ya que no se puede denunciar a alguien abiertamente vía foro.","replies":[]},{"poster":"Worst Shadow Na","date":"2016-07-16T19:54:11.394+0000","up_votes":5,"down_votes":0,"body":"Solo para recalcarlo y viendo que has leído las normas del juego, deberías saber que hacer denuncias de personas en el foro esta prohibido y es castigado también si quieres hacer algo realmente vaya al soporte y deje de buscar atención pequeño bebesito {{champion:29}} {{champion:29}} {{champion:29}} {{champion:29}}","replies":[]},{"poster":"TGP Shark27","date":"2016-07-16T21:26:56.453+0000","up_votes":4,"down_votes":0,"body":"Seguro es el ryze del 1 vs 1 :v","replies":[]},{"poster":"Forever Jinx","date":"2016-07-16T21:02:50.075+0000","up_votes":2,"down_votes":4,"body":"compa,concuerdo y apoyo tu topico sobre que es mala influencia y cosas asi,hay varias cosas que analizar de todas maneras,aunque la arena venga a todos nosotros tenes que entender y tiene que entender que barba tiene un nivel mucho mas que de oro,simplemente es un personaje las varias cuentas que tiene,bien el seguramente tiene una cuenta main que no hace videos sino que rankea de forma correcta y sin el personaje de erik,como lo haras vos o yo o la gran mayoria que juega para ganar sin flammear blabla bla,que no farme como hasta un bronce regular lo hace que no use wards etc no significa que no tenga un buen nivel,el flaco hace mucho que juega y el men sabe pero repito es el personaje,el cual no muchos logran ver y se piensan que es un manco enserio flamerino y que se queja del lag la gente \"rata\" entre otros motivos aparte de sus chat y sus videos desfasados con lo que ocurre en el video(graba el video y hace un tipo de video reaccion de su partida en un tiempo real como si jugara en ese momento entre otras cosas,volviendo al tema de la conducta correcta del invocador,ese es el tema principal donde los chicos de riot deberian tomarse manos a la obra porque la gran mayoria de los compañeros que tocan a uno (en mi caso personal en el 50 o 60% de las partidas simepre estan los tipicos \"pija por el culo\" \"o veni chiquia\" \"aguante el barba\" que son toxicos y usan las mismas expresiones que el barba para flamear a mas no poder muriendo en el medio del rio para flamear porque uno tiene un farm horrible o porque el jungla no gankea o porque soraka se dejo \"pijear\" por salvar justificadamente al adc. y los chicos mas chicos que rankean se lo toman muy enserio al barba y eh visto muchas lux jungla muchos shacos seguidores del barba muchos jax que dicen \"DALE VOLI\" cuando uno usa otro personaje ensima y porlomenos yo termino muteando a casi todos antes del minuto 15 porque simplemente mueren por putearme o putear al supp al jg o al adc,pero ellos son todos unos challengers por mirar al barba,yo aveces miro los videos de erik y me hizo reir mucho y me cago de risa cuando lo veo pero una cosa no quita la otra,que la gente se toma muy enserio el personaje del barba y lo imitan y se va marchitando la comunidad,y ni hablar de los platinos que se crean cuentas,para rankear y terminar 1/10/2 darius full ap o shen con 6 anillos de doran,las suspenciones de chat tendrian que ser un poco mas sencibles al tema del flameo o ciertas frases que se hacen iconicas no solo de barbakhan sino de otros youtubers que tambien flamean o tiene un personaje de la onda de barba,realmente espero que no se tomen con odio mi comentario,yo soy seguidor del barba pero se tiene que ver que no solo es un personaje sino que tambien es medio danino para la comunidad joven y para los que no tiene mucha materia gris y te insultan porque no pudiste ayudarlo por estar peleando conta tu adversario en la lane y espero que mi comentario sea un granito de arena para que mejore la comunidad,porque disfruto mucho rankear y soy un manco asqueroso pero los chicos que se toman a pecho el papel del barba tambien dificultan las cosas,mientras que uno es manco y le pone ganas y te tocan los flamerinos y que no cooperan se complica mas la cosa\nun saludo y no me odien :V {{champion:55}}","replies":[{"poster":"DOLARLANDIA","date":"2016-07-16T21:21:07.327+0000","up_votes":4,"down_votes":0,"body":"bienvenido a internet amigo es asi nadie te pide que juegues un juego, nadie te obliga que comer, nadie te pide nada vos, haces lo que tengas  ganas de hacer ahora decir que barba es mala influencia en internet? tantas personas hay en internet que hacen muchisimo mas daño que el y van a pedir que lo saquen de un juego que es gratuito que vos ni yo pagamos por jugar? creo que deberias replantearte un poco mejor tus prioridades a la hora de criticar, estas acusando a un ladrón de carteras mientras al lado tuyo están subiendo pedofilia, pornografia infantil y muchas cosas mas. es un juego gratuito no te olvides podes salir y entrar cuando gustes","replies":[]},{"poster":"CPB4P8enYF","date":"2016-07-16T21:07:12.820+0000","up_votes":2,"down_votes":4,"body":"gracias por el comentario con sentido, a diferencia de el resto que comenta vos mostras otra cosa.\nsin embargo mas alla de eso, el utiliza cuentas que no son de él sin importar si es un personaje o no. No cumple con las normas y debe ser sancionado.","replies":[{"poster":"Forever Jinx","date":"2016-07-16T21:14:59.471+0000","up_votes":2,"down_votes":0,"body":"realmente desconozco esas normas,yo porlome menos hablo desde lo que veo y conozco y vivo\ny esto off topic,concuerdo con barba por usar una cuenta level 7 y no tu principal,tus razones tendras","replies":[{"poster":"CPB4P8enYF","date":"2016-07-16T21:18:02.716+0000","up_votes":1,"down_votes":4,"body":"la desinformación mata. fijate y lee mas arriba, ya explique 3 veces por que no tengo cuenta.","replies":[{"poster":"Forever Jinx","date":"2016-07-16T21:21:37.566+0000","up_votes":2,"down_votes":0,"body":"muchos comentarios se dificulta mucho leer todo esto :V dale sigo leyendo","replies":[]}]}]}]}]},{"poster":"sniper2526","date":"2016-07-16T20:32:38.546+0000","up_votes":2,"down_votes":1,"body":"Otro hater maricon no le hagan caso, es como cualquier hater solo crítica para provocar a barba y Seguro no pasa los 13 años u.u","replies":[{"poster":"Trash kíd","date":"2016-07-16T20:57:45.365+0000","up_votes":4,"down_votes":0,"body":"Hater maricon? , Acaso te parece correcto fomentar el flammeo y la burla hacia los bronces en la comunidad?","replies":[]}]},{"poster":"Bigbywolfmoon","date":"2016-07-16T19:50:52.161+0000","up_votes":4,"down_votes":0,"body":"Hay un \"TOPO\" En Hmmm izi... jajaj {{item:3649}}","replies":[]},{"poster":"xM4XIx","date":"2017-05-05T04:06:32.561+0000","up_votes":3,"down_votes":0,"body":"Ñiñiñiiii....ñiñiñiñi quiero pannn...ñiñiñi jajaj","replies":[]},{"poster":"KingOfApples","date":"2017-02-12T02:19:16.966+0000","up_votes":3,"down_votes":0,"body":"ñiñiiñ soy main yasuo y este main olaf me molesta ñiñiñiñi","replies":[]},{"poster":"Aquile Nazco","date":"2016-07-18T02:25:56.806+0000","up_votes":3,"down_votes":0,"body":"Hay peor gente en el juego y te venís a quejar de un youtuber ? jajaja seguro vos tambien flammeas a todos jaja","replies":[]},{"poster":"Carpaccio","date":"2016-07-17T15:59:00.182+0000","up_votes":3,"down_votes":0,"body":"Hace Elo Boost ... Sigue en Bronze :v\nY lo otro,mala influencia no es,yo lo veo siempre y cuando entro al LoL no le voy a gritar al Voli o al Amumu por un error o cosas por estilo.Que hay niños influenciables,de eso no lo niego,pero se diria que son el 20% o maximo el 40% de la gente que lo mira y copia.\nSaludos bro.\nPD:Se re nota que es una Multicuenta,sos LVL 7,alguien normalmente entra a los Foro recien cuando es 30 por que tiene algo de entendimiento del juego,comportamientos,bugs,ETC.","replies":[]},{"poster":"Izayoi","date":"2016-07-17T01:22:48.877+0000","up_votes":3,"down_votes":0,"body":"Como  cuando tenes rencor, pero sos tan cobarde de dar la cara y usas una acc lvl 7 :v{{champion:32}} {{champion:32}} {{champion:32}} {{champion:32}} {{champion:32}} {{champion:32}} {{champion:32}} {{champion:32}} {{champion:32}} {{champion:32}} {{champion:32}} {{champion:32}}","replies":[]},{"poster":"Shyphoniths","date":"2016-07-16T22:45:21.256+0000","up_votes":3,"down_votes":0,"body":"tiene razon si no hacen algo es carta libre hacer ese tipo de cosas y ahi esta la prueba","replies":[]},{"poster":"Chisolin","date":"2016-07-16T19:58:14.218+0000","up_votes":3,"down_votes":0,"body":"Sorprendente que todavía nadie haya publicado esto en el grupo de Hmmm izi\nPero cuando lo hagan...\nhttp://k33.kn3.net/taringa/2/7/1/8/8/F/JosLaz03/747.jpg","replies":[{"poster":"GandalfTheSolo","date":"2016-07-16T20:02:17.986+0000","up_votes":3,"down_votes":0,"body":"Vengo de ahí (?)","replies":[]}]},{"poster":"El Socialismo No","date":"2016-07-16T19:42:17.693+0000","up_votes":3,"down_votes":0,"body":"Ni azir puedo controlar la tormenta de arena que estás levantando :v","replies":[]},{"poster":"lanchi123","date":"2016-07-16T19:38:16.904+0000","up_votes":3,"down_votes":0,"body":"Solo dejo un  {{item:2043}}  para no perderme ningún detalle de la sangrienta batalla que se avecina.","replies":[]},{"poster":"MrsTobyuura","date":"2016-07-16T20:45:59.923+0000","up_votes":2,"down_votes":0,"body":"Amigo, vienes a quejarte de que le regalaron una cuenta hace mil años? Rlly? Es como si yo hoy decidiera dejar el lol y le digo a alguien: mira, va, toma mi cuenta (La de LAN que se llama igual que esta, sólo que no me deja comentar desde esa) y entonces quieres reportar a esa persona? por recibir un regalo? No es como que le este subiendo la cuenta ni nada parecido, ok, no era su cuenta, pero esas personas jamás las volvieron a usar y básicamente él se hizo cargo de ellas. Tipo regalas a tu gato y esa persona se vuelve su dueño y no le veo nada de malo a eso xD La verdad ese argumento lo veo muy tonto de tu parte, pero bueno. On tan mis pinshis hermanos Sauron para darte ban e irme. {{sticker:zombie-nunu-bummed}}","replies":[{"poster":"CPB4P8enYF","date":"2016-07-16T20:56:27.295+0000","up_votes":2,"down_votes":7,"body":"ese argumento tambien tendrian que darlo en el caso de que una chica violada quiera sacar a la luz la historia 3 años despues, amigo no importa cuanto tiempo haya pasado, sigue siendo en contra de las normas.","replies":[{"poster":"DOLARLANDIA","date":"2016-07-16T21:24:33.313+0000","up_votes":4,"down_votes":0,"body":"viejo sos un payaso no se que tiene que ver con el lol tu reclamo de youtube entedes man?{{champion:29}}","replies":[]}]}]},{"poster":"Im Gloria Borger","date":"2016-07-16T19:49:02.779+0000","up_votes":4,"down_votes":1,"body":"Pero mira ese desertor papá, alto jeiter :v","replies":[]},{"poster":"Trash kíd","date":"2016-07-16T20:52:04.174+0000","up_votes":1,"down_votes":7,"body":"Es obvio si posteas contra barbakhan llegaran todas sus ratas a defender lo indefendible , Es una mala influencia para la comunidad , Aparte el ultimo video que subio ridiculizando a un pobre pibe me parecio inmaduro y patetico , fomenta el flammeo y la burlas hacia los bronces {{champion:29}}","replies":[{"poster":"DOLARLANDIA","date":"2016-07-16T21:26:18.589+0000","up_votes":3,"down_votes":0,"body":"podes elegir no verlo en youtube?........... a si.  no lo veas entonces como te digo que tiene que ver riot con youtube?","replies":[]}]},{"poster":"Hwaxinghz","date":"2016-07-17T20:15:20.421+0000","up_votes":2,"down_votes":0,"body":"Menos 87 xD","replies":[]}]}