{"poster":"SSJTHREE","date":"2015-05-05T13:39:02.222+0000","title":"Wie carryt man ein Game?","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hey Leute.\r\n\r\nIch spiele LoL seit knapp 3 Monaten unf seit nem halben Monat ranked.\r\nNach meinen placements war ich in sil4 eingestuft worden und nun bin ich silv5.\r\nIch spiele alle Rollen wenn es von mir verlangt wird und kann auf jeder Position 2 champs. Mein Problem ist, dass ich h&auml;ufig Probleme habe was in Rankeds zu bewerkstelligen.\r\n\r\nVorhin hatte ich mit Talon gegen Katarina ein 16-5, habe massig geroamt aber das half nicht viel weil unser Toplaner afk war f&uuml;r 10 Minuten und unsere Botlane hart verloren hat.\r\n\r\nDer gegnerische Supp hat dann 3 Leute aus unserem Team gebaitet und alle 3 wurden daraufhin von einer 0/4 Katarina getripplet.\r\n\r\nSie snowballte ab dann und das team reagierte nicht wenn ich drum gebeten habe nicht dem supp nachzuchasen.\r\n\r\nWir verloren letztendlich und Katarina hatte um die 17 kills\r\n\r\nWas kann man in solchen F&auml;llen tun und wie woll ich dann reagieren?\r\nMit rauf und riskieren dass Kata einen quadra kriegt?\r\n\r\ndanke im voraus.\r\n\r\n*nebenbei ich poste das von meinem smurf, kann mich HIER irgendwie nicht bei meinem normalen account einloggen.","replies":[{"poster":"malleusmintaka","date":"2015-05-05T16:27:10.621+0000","up_votes":2,"down_votes":2,"body":"Gar nicht.\n\nCarrien impliziert, dass du es alleien gewinnst, und wenn du der Meinugn bist, ein Spiel alleine gewinnen zu können, dann bist du hier beim falcshen Spiel.","replies":[{"poster":"SSJTHREE","date":"2015-05-05T16:37:07.291+0000","up_votes":1,"down_votes":0,"body":"wie sorge ich dann dafür dass ich meine games gewinne?","replies":[{"poster":"eingew","date":"2015-05-06T10:52:22.119+0000","up_votes":1,"down_votes":0,"body":"Was ich noch immer wichtig finde ist die Moral. Wenn jemand ne gute Aktion bringt, dann kann ein \"gj\" im Chat nicht Schaden. Außer man übertreibt es, aber wenn du das jedesmal schreibst, wenn du bei der Aktion dabei bist, dann kommt Lob eigentlich immer gut an.","replies":[{"poster":"Evenrider","date":"2015-05-06T11:35:24.953+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=vatevpvi,discussion-id=yA1mAEOG,comment-id=000500000001,timestamp=2015-05-06T10:52:22.119+0000)\n>\n> Was ich noch immer wichtig finde ist die Moral. Wenn jemand ne gute Aktion bringt, dann kann ein \"gj\" im Chat nicht Schaden. Außer man übertreibt es, aber wenn du das jedesmal schreibst, wenn du bei der Aktion dabei bist, dann kommt Lob eigentlich immer gut an.\n\nIch empfehle hierbei noch die Angesprochene Person hinzuzufügen\nz.B. gj Varus oder eben gj SummonerName\nDenn ich hatte es schonmal, dass ich als ADC meinem Support ein \"gj\" geben wollte, denn er hat mir einen Doppelkill herbeigeführt, dies auch geschrieben habe, sich allerdings unser Toplaner angesprochen fühlte und dachte ich meinte das Ironisch, da sie gerade gegen ihren Gegner gestorben war.\nDa bei mir auf der Botlane Action war habe ich ihren Tod nicht mitbekommen und sie hat unseren Doppelkill nicht mitbekommen, da bei ihr Action war. :D","replies":[]}]},{"poster":"malleusmintaka","date":"2015-05-05T17:18:16.242+0000","up_votes":1,"down_votes":0,"body":"am besten mti deinem team zusammenspielen.\nWenn jeder seine Aufgabe erfüllt, dann solltet ihr das Spiel gewinnen.\nZum Beispiel solltest du dich darauf konzentrieren, die Lane zu gewinnen und gut zu farmen, später dann die richtigen Calls zu machen (das kann man am ehesten als carrien bezeichnen) und m Teamfiht die richtigen Sachen machen. Generell Tipps sind schwierig, weil ich nicht weiß, was genau du spielst und wie. \nDie nächsten 50 Spiele versuchst du, jeden Creep zu bekommen und nach JEDEM creep auf die minimap zu schauen.\n\nWenn du alles richtig machst, wirst du weiterhin spiele wegen deinem team verlieren, aber alels in allem steigst du dann.\n\nZu dem SPiel kann ich dir schwer einen Tipp geben, aber es gibt eben manche, in denen man einfach verliert, dann kann man ncihts machen außer sich die eigenen Fehler zu merken und versuchen ab dann zu vermeiden.\n\nIch hoffe, ich konnte dir helfen","replies":[]}]},{"poster":"Sh ee N n Kill a","date":"2015-05-05T19:50:25.523+0000","up_votes":3,"down_votes":0,"body":"Naja, alleine von anfang an (1 vs 5 ) geht auch nicht aber wenn du richtig fed bist könnte es schon gehen...... Hatte mal ein Diana game, (32/1/15) ich fand meine mates manchmal im end game einfach überflüssig.... Einen Penta ganz solo geschafft. Aber ich denke so ein game wird man höchstens 1 mal haben.","replies":[{"poster":"malleusmintaka","date":"2015-05-06T10:49:35.266+0000","up_votes":1,"down_votes":0,"body":"Hat NIEMAND von deinen mates gewardet? Dich unterstützt? Seine Lane gewonnen? Carrien wäre, wenn du wirklich 1v5 gewinnst. Jeder verliert seine Lane, keiner kann spielen, also im Grunde das gleiche, wie wenn du ein freies Spiel aufmachst und gegen 5 auf deiner Elo spielst. DAS wäre carrien, und ich bezweifle sehr, dass das funktionieren würde. \n\nJeder Creep, jeder Autoattack, den dein Team auf die Gegner macht, hilft dir (allgemein gesagt).\n\n\n\nUnd ja, ich weiß was du meinst, und nein, ich bin nciht der Meinung, dass man einen Teamfight alleine nicht gewinnen kann, aber jede Situation im Spiel zählt.","replies":[{"poster":"Sh ee N n Kill a","date":"2015-05-09T20:38:26.018+0000","up_votes":1,"down_votes":0,"body":"ok wenn du das unter carrien verstehst ;D\nIch verstehe unter carrien dass  das team ohne einen ziemlich am Arsch wäre. D.h. du hast sorgst dafür das die tf gewonnen werden, evtl. roamst oder ähnliches....","replies":[{"poster":"malleusmintaka","date":"2015-05-10T09:38:53.766+0000","up_votes":1,"down_votes":0,"body":"zu viert wäre jedes team ziemlich am arsch","replies":[]}]}]}]},{"poster":"God Bjerg","date":"2015-06-01T01:33:21.460+0000","up_votes":1,"down_votes":0,"body":"So ein dummes Gelaber. Man kann sein Team doch carrien. Das bedeutet ja nicht, dass man 1v5 spielt. Sondern gemeinsam das Team mit eigener exzellenter Leistung zum Sieg führt. Nicht mehr, aber auch nicht weniger. \n\nOder behauptest du etwa das z.B. ein Bjergsen sein Team nicht carriet? Natürlich tut er das. Aber deswegen ist es doch immer noch ein Teamgame. Nur weil einer die Leader Rolle inne hat, Calls gibt, und im Teamfight den entscheidenden Unterschied aus macht (= carriet), spielt er doch nicht solo. \n\nBsp: Eine Vayne die nicht carriet aa einfach den der ihr am nächsten steht. Und eine Vayne die carriet (vgl. Gosu / Impatique / etc.) macht halt crazy Plays und haut in nem Teamfight um den gegnerischen Tank herum auch mal alle 4 um. Das die Kill Contribution natürlich (fast) nie 100% beträgt ist doch klar. \n\nIch finde es zumindest unterste Schublade was du dem TE hier \"unterschieben\" willst (von wegen solo game und so). Carrien zu wollen ist ganz legitim. Und wer das nicht kann wird auch nie aufsteigen (Plat, Dia, etc ...). So wie du.","replies":[{"poster":"malleusmintaka","date":"2015-06-01T12:21:56.747+0000","up_votes":1,"down_votes":0,"body":"Deine Aussage ist im Grunde, dass du nicht fähig bist, ein Argument zu finden, das ewas zählt, und du deswegen persönlich angreifst.\n\nWenn du nciht verstehst, was ich geschrieben habe, dann solltest du es auch nciht in irgend einer Weise kommentieren","replies":[{"poster":"God Bjerg","date":"2015-06-02T05:23:37.981+0000","up_votes":1,"down_votes":0,"body":"Entschuldige ich vergas den Ironie Smiley. Aber alles bis auf den letzten Satz (den ich zurück nehme, war nicht ganz so gemeint) stimmt. Frag Profis. Challenger. Master. Sie werden es dir alle bestätigen.","replies":[{"poster":"malleusmintaka","date":"2015-06-02T11:36:23.011+0000","up_votes":2,"down_votes":0,"body":"Ich stimme dir vollkommen zu, dass man, wenn man um sehr viel besser spielt als das Team, dieses zum Sieg führen kann, mich stört nur die exzessive Verwendung des Wortes carrien, da es inzwischen für ALLES benutzt wird und gerade in niedriger Elo oft zu dem Schluss führt, dass, wenn Spieler hoher Elo sagen, sie carrien das Game, meinen, dass der absolut einzige Grund, warum sie gewinnen, sie selbst sind, und dies, auf sich selbst übernommen,  führt oft zu der Annahme, dass man selbst der einzige fähige Spieler in der jeweiligen Runde ist, und infolgedessen flamen sie herum und sind der Meinung, dass es völlig egal ist, was die anderen machen, sie gewinnen so oder so, und wenn sie aber verlieren, flamen sie, weil es können ja nur die Fehler der anderen gewesen sein.\n\n\nIch hoffe, du kannst jetzt besser verstehen, was ich meine, ich sage nicht, dass es nciht möglich ist zu carrien, ich störe mich nur an der Verwendung des Wortes.\n\n\nUnd bezüglich TE, es gibt eben Spiele, dei man verliert, wenn man da aber kommt mit \"ich habe gecarriert\", dann ist das genau die Mentalität die ich meine.","replies":[]}]}]}]},{"poster":"Adanio","date":"2015-05-11T04:15:02.750+0000","up_votes":1,"down_votes":0,"body":"Ein Spiel kann man durchaus \"allein\" gewinnen. Das kommt immer drauf an wie man es interpretiert.","replies":[{"poster":"malleusmintaka","date":"2015-05-11T11:32:14.676+0000","up_votes":1,"down_votes":0,"body":"\" to carry sb/sth = jdn/etw tragen \"\n\nDas heißt, ohne den Carry könnte sb/sth nicht gehen(gewinnen).  Rechne einen beliebigen Spieler von Anfang an weg(also auch in der Pick/Banphase), wie viele Spiele kannst du 4 gegen 5 gewinnen?","replies":[{"poster":"Adanio","date":"2015-05-11T19:05:55.477+0000","up_votes":1,"down_votes":0,"body":"Ein challenger \"könnte\" auch 3v5 in der Bronze Elo gewinnen.","replies":[{"poster":"malleusmintaka","date":"2015-05-12T13:10:00.745+0000","up_votes":1,"down_votes":0,"body":"3 v 5 ist nicht 1 v 5.\nAbgesehen davon, ein Challenger SPIELT nicht in bronze elo","replies":[{"poster":"Adanio","date":"2015-05-12T16:32:33.011+0000","up_votes":1,"down_votes":0,"body":"Ok. Ein Challenger \"könnte\" durchaus 1v5 in der Bronze elo gewinnen.","replies":[{"poster":"malleusmintaka","date":"2015-05-13T05:04:59.498+0000","up_votes":1,"down_votes":0,"body":"Ein Challenger wäre nicht Bronze. Ich gehe von einem Ranked aus, und wir glauben ja alle an ein funktionierendes Matchmaking, oder?","replies":[{"poster":"Adanio","date":"2015-05-13T13:20:40.553+0000","up_votes":1,"down_votes":0,"body":"ich sagte es kommt drauf an wie man es intenpretiert. Bin nicht von einen Ranked aus gegangen.\nWenn dieser Challenger elo boosting betreibt dann wäre er zb. Bronze um denjenigen hoch zu carryen.\nOder wenn er auf den acc von einem Freund spielt der Bronze ist und eine sehr niedrige MMR hat. Dann wäre er auch Bronze = Er würde gegen Bronze spielen.\nErgo: Ein Challenger \"könnte\" durchaus 1v5 in der Bronze elo gewinnen.","replies":[]}]}]}]}]}]}]}]},{"poster":"G13 Smoke","date":"2015-05-05T14:57:27.519+0000","up_votes":2,"down_votes":0,"body":"man kann nicht jedes game gewinnen, aber solange du jedes game so gute stats hast, wirste auch bald aufsteigen.\n\nes is vill doof sowas in silber zu sagen und ich weiß nicht wie dein team sonst noch so war, aber talon is nich so der beste pick gegen ne kata\nauf der lane vill n bisschen dominierend, aber ohne sein silence, kann er halt nichts gegen ihre ult im late machen. und da du nicht in diese elo gehörst, bist du besser als alle die um dich herum spielen, dass heißt du musst sie carryn, DU musst auf sowas wichtiges achten, wie ne kata ult zu unterbrechen, DU musst warden, so dass deine teammates sehen, wenn sie geganked werden, oder kata romen kommt. du spielst ranked=du denkst du bist besser als deine elo=alle anderen spielen schlechter als du=du musst ihre fehler ausgleichen.\n(klingt vill doof aber so is es nicht immer, aber oft. das heißt vorallem wenn du gefeedet und so viel gold hast, kauf n pink, upgrate dein trinked und mach die crap)\n\ndann noch n tipp, der nicht so dumm is wie der erste, tower gewinnen n game!!!! das heißt pushen, du zerstörst deine lane? dann push den ersten tower weg, rome bot und helfe denen auch ihren tower weg zupushen \ndas nächste is, drakes!!! da in silber die spiele sehr oft ins krasse late gehen sprich so min 50(wo dann jeder aus deinem und dem gegner team full build ist) probiert die drakes zu bekommen. 5 drakes is eine extrem gute ausgangssituration für einen tf. also animiere deinen jungler den drake zu machen, wenn dein jungler so ne totale pflaume is, dann rome bot, ward den drake pink und mach ihn mit der bot zusammen( n bisschen riskant, aber meistens klappt es). und dann schreib dienem jungler, \"1 min drake\" ;\"30 sec draek, lets group drake\" etc.\nbaron natürlich auch, obwohl du da seeehhhr vorsichtig sein musst, n schlechter fight beim baron kann dein spiel auch verlieren.\n\nund solange du im durchschnit 7 von 10 spielen gewinnst, bist du n guter spieler und wirst aufsteigen. man hat immer games die man wegen seinen teams verlieren wird, man kann nicht alles carryn!!!\nso good luck ;)","replies":[]},{"poster":"Sirrkas","date":"2015-05-05T13:43:32.992+0000","up_votes":2,"down_votes":0,"body":"Wenn du merkst, dass es eine Falle sein könnte, kannst du versuchen, deine Mitspieler mit Pings zum Rückzug zu bewegen.","replies":[{"poster":"SSJTHREE","date":"2015-05-05T13:51:08.325+0000","up_votes":1,"down_votes":0,"body":"Ja das tue ich dann auch, aber das bringt in dem Moment nicht viel. Ich habe das Gefühl, dass manchen dieser eine Kill mehr bedeutet als das Spiel zu gewinnen. Es ist schließlich nur ein Support, der gerade mal 300gold wert ist. \nWas anderes als pingen kann ich nicht tun und deshalb verlieren ist auch doof.","replies":[]}]},{"poster":"EpicDieterBohlen","date":"2015-05-05T15:17:18.249+0000","up_votes":1,"down_votes":0,"body":"wenn du erst 3 monate spielst fehlt es dir massiv an erfahrung.\n//Wenn kata 0/4 ist scheint sie nicht besonders stark zu sein wie soll sie 1v4 schaffen? vor allem da ziemlich sicher wer dabei ist der ihre ulti unterbricht. ","replies":[]},{"poster":"B1G Kr1T","date":"2015-05-05T14:36:20.269+0000","up_votes":1,"down_votes":0,"body":"Deine Aufgabe wie in dem Fall mit Talon besteht darin den gegnerischen Adc insta zu killen. Wenn du das schaffst und vlt auch noch Kata mitnimmst hast du deinen Part erledigt. Wenn dein Team nicht klar kommt und nicht auf Pings etc. hört ist es schwer das Ding alleine nachhause zu holen!\nEinfach weiter machen und dann kommt Gold und Platin bald!!","replies":[{"poster":"SSJTHREE","date":"2015-05-05T14:54:11.882+0000","up_votes":1,"down_votes":0,"body":"ich glaube gold kommt nicht so einfach.... ich hab kata und sivir mehrere male rausgenommen, starb dann aber unser adc hatte null plan vom positioning.\n\nich glaube ich werde nur noch maokai spielen, habe mit ihm die beste winrate und er ist einfach super tanky und bringt cc mit.","replies":[]}]},{"poster":"PlanetenPlatzer","date":"2015-05-05T14:44:32.861+0000","up_votes":1,"down_votes":0,"body":"Nur aufgrund einer Dreifachtötung kann Katarina euch nicht sofort töten. Du müsstest als Talon immernoch viel stärker sein.","replies":[{"poster":"SSJTHREE","date":"2015-05-05T14:52:32.208+0000","up_votes":1,"down_votes":0,"body":"das stimmt, ich hab aber nicht damit gerechnet dass NUR kata dort ist. sona lief halt sehr seltsam um unseren blue herum und drake war up. wir hatten keine vision und ich könnte sie alleine insta rausnehmen, aber dachte da wären noch andere.. muss wohl viel mehr warden.","replies":[]}]}]}