{"poster":"Ricky Spanish v2","date":"2016-02-16T10:30:49.750+0000","title":"Primär/sekundäre Rolle ungleichheit bei der Rollenvergabe","subforum":"Karten & Spielmodi","up_votes":8,"down_votes":1,"body":"Hallo,\r\n\r\nAls das neue System live ging hab ich mich sehr gefreut. Endlich keinen Zoff mehr in der Champion Selection, keine &quot;Instalocks&quot; u.s.w..\r\nZu erst einmal muss ich sagen das das neue System sehr viele tolle Vorteile hat und ich es an sich sehr gut finde. Doch nachdem es jetzt einige Wochen live ist ist mir aufgefallen wie ungleich die Rollenvergabe ist. Ich z.B. spiele haupts&auml;chlich Jungle/Support. \r\nAus diesem Grund habe ich immer Prim&auml;r: Dschungel Sekund&auml;r: Support. Zu Anfang hab ich ca 50/50 % Jungle/Support bekommen, was okay ist, aber auch nicht optimal, da ich ja haupts&auml;chlich Jungle will - somit sollte eine 70% Chance bestehen das man auch Jungle bekommt. Da es aber oft an willigen Spielern fehlt die die Support Rolle einnehmen, wurde ich auch oft als Support &quot;eingew&auml;hlt&quot;. So weit so Gut. \r\nNun nach den ersten Wochen ist mir immer mehr aufgefallen das ich so langsam eig. nie Jungle bekomme obwohl ich Prim&auml;r-Jungle ausw&auml;hle. Ich hab Angefangen Statistik zu f&uuml;hren. Von meinen letzten 30 Ranked Games, in dennen ich immer Prim&auml;r-Jungle Sekund&auml;r-Support gew&auml;hlt habe, hab ich geschlagene 4x Jungle bekommen. \r\nWenn ich PRIM&Auml;R - Jungle w&auml;hle dann will ich auch das das System versucht mir dies zu geben und mich nicht immer dahin zu stecken wo es gerade passt nur weil es an Supportern fehlt. Es sollt mind. eine 50/50 Chance sein. Ich warte lieber etwas l&auml;nger bekomme daf&uuml;r aber auch Jungle anstatt das ich jedes mal Support muss. Wenn man eine Rolle als Prim&auml;r kennzeichnet dann sollte diese auch Prim&auml;r sein und nicht die selbe Priorit&auml;t, oder in meinem Fall sogar niedrigere Priorit&auml;t, haben als die sek&uuml;nd&auml;r Rolle. Zusammenfassend - Das neue System ist gut und bietet viele Vorteile doch die Priorit&auml;t in der Rollenverteilung l&auml;sst mich etwas w&uuml;tend werden. Wenn ich nach 10 Support Games wieder SUpport muss obwohl ich eig. Jungle als meine Hauptrolle kennzeichne. Ich habe kein Problem Support zu spielen, das mal am Rande erw&auml;hnt. Doch will ich nicht derjenige sein der &quot;ausf&uuml;llen muss&quot; nur weil ich auch gerne Support spiele und dadurch meine eig. Hauptrolle bzw. das was ich am liebsten spiele &uuml;berhaupt nicht beachtet wird. \r\n\r\nIch w&uuml;rde mich &uuml;ber eure R&uuml;ckmeldungen und Eindr&uuml;cke von dem neuen System sehr freuen und wie eure bisherigen Erfahrungen mit der Rollenverteilung verlaufen sind. \r\n\r\nBis dahin gl &amp; hf in Game. {{summoner:21}}","replies":[{"poster":"MeMyselfandBaal","date":"2016-02-16T11:12:40.368+0000","up_votes":2,"down_votes":0,"body":"Auch auf die Gefahr hin, dass ich mich wiederhole: Riot sollte sich einfach merken, wie oft in Folge man nicht seine Main Rolle bekommen hat. Und dann mit jedem Mal die Wahrscheinlichkeit, dass man seinen Main bekommt, hochsetzen. So dass man spätestens nach 5 Spielen als Support 2nd garantiert wenigstens ein Mal seine Main Mid Rolle bekommt... (auch wenn man in dem Spiel dann dann mit längeren Warteschlangen leben muss).\nUnd das sage ich als Sup Main Mid 2nd, der in 95% seiner Spiele seine Main Rolle bekommt...","replies":[{"poster":"MisterZiup","date":"2016-03-04T18:23:54.704+0000","up_votes":1,"down_votes":0,"body":"Diese Idee kam mir auch schon. Ich habe genau dasselbe Problem mit Jungle/Supp. Ich spiele normalerweise auch gerne mal Support, \naber wie in dem Hauptbeitrag erwähnt, es ist nicht meine Priorität. Hoffen wir mal, dass sich Riot diese Threads auch durchließt und beschließt, das System nochmal zu überdenken. So gehen nur noch mehr potentzielle Supporter verloren, die dann beschließen Jungle/Top oder ähnliches zu spielen.","replies":[]}]},{"poster":"Parunpata","date":"2016-02-16T10:33:39.297+0000","up_votes":2,"down_votes":0,"body":"Hey das Problem ist, dass es viele gibt, die Support als sekundäre Rolle hatten. Dadurch dass diejenigen dadurch immer so oft Support spielen mussten, haben sie angefangen, als sekundäre Rolle z.B. Mid zu nehmen, damit sie ihre primäre Rolle bekommen. \nDadurch gibt es eben immer weniger Supporter und die, die Support immernoch auswählen, müssen es noch öfters spielen als ohnehin schon.\n\nUnd ja, ich bin auch einer von denen.","replies":[]},{"poster":"Zausel","date":"2016-04-24T18:21:43.543+0000","up_votes":1,"down_votes":0,"body":"ich für meinen teil, finde es auch ziemlich nervig. va, weil mmn das alte system so ok war, wie es war. man gibt die rolle vorher an, die man spielen WILL und bekommt diese auch. da muß man manchmal vielleicht etwas warten, aber das war ok.\nich für meinen teil bin main supporter. ich will nix anderes spielen und ich kann auch nix anderes spielen. da ist mir das ehrlich gesagt zu dumm, mich zu etwas zwingen zu lassen, worauf ich keine lust habe. \ndas ist immer noch ein SPIEL, was man spielt um mal 45minuten pro runde spaß zu haben. \nda seh ich es nicht ein, mir irgendeine \"sekundär\"-rolle aufzwingen zu lassen, auf die ich keine lust habe.\n\ndie fairste lösung wäre doch, beide auswahl möglichkeiten zu lassen. jetzt gibt es diese absolut sinnlose ja auch, wo der, der als erste mid schreit, in die mid kommt. \nnehmt doch lieber diesen käse raus und fügt das alte auswahlsystem wieder ein, wo man vorher lane und rolle wählen kann. wer keine lust auf wartezeiten hat, nimmt halt das aktuelle primär- sekundär system.","replies":[]},{"poster":"Soúp","date":"2016-02-17T10:15:12.738+0000","up_votes":1,"down_votes":0,"body":"Bin ein wenig enttäuscht vom System. Die Idee ist super, keine Frage, aber für mich als Main-Midlaner eine Katastrophe, weil ich meine Primärrolle so gut wie _nie_ bekomme :-( \nMir ist klar, dass viele Spieler in die Mitte wollen.. Ich würde auch längere Wartezeiten in Kauf nehmen, hauptsache ich bekomme dann auch irgendwann mal meine Primärrolle :-/","replies":[{"poster":"Sirrkas","date":"2016-02-17T10:24:01.414+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist leider, dass wenn alle Midlaner das sagen, von denen einige Stundenlang in der Warteschlange sein werden, bis sich genug erbarmt haben Support zu spielen.","replies":[{"poster":"MisterZiup","date":"2016-03-04T18:26:45.172+0000","up_votes":1,"down_votes":0,"body":"Das ist dann aber deren eigene Entscheidung. So werden allen die sich auch ab und zu mal dran erfreuen zu Supporten die Rolle permanent aufgedrängt. Was ist besser, alle übrigen Supporter die lust nehmen oder etwas Wartezeit in kauf zu nehmen?","replies":[{"poster":"Sirrkas","date":"2016-03-04T20:51:53.376+0000","up_votes":1,"down_votes":0,"body":"Keines von beiden. Am besten für alle wäre es, wenn sich mehr finden, die Support spielen wollen. Dann warten alle weniger. \n\nLängere Wartezeiten in Kauf nehmen, bedeutet, dass alle länger warten, solange ein Mangel an einer Rolle besteht. Ich weiß jetzt nicht mehr, was genau hier für Lösungen vorgeschlagen wurden.\n\nWenn jemand unbedingt Mitte spielen will, bietet sich ein 3er Premadeteam an. Für zwei Spieler kann man dann die Lanes erzwingen. Wenn alle von denen sogar manchmal Support spielen würden, können die sich ja abwechseln. Dann werden alle Beteiligten in 66 % der Fällen ihre Mainrolle kriegen, solange sie nicht die selbe wollen.","replies":[]}]}]}]},{"poster":"ü ö","date":"2016-02-17T06:51:42.934+0000","up_votes":1,"down_votes":0,"body":"Joa, ich hatte am Anfang auch ab und zu Support als sekundäre Rolle, da ich kein Problem damit habe mal zu supporten, da ich allerdings in 90% der Spiele dann auch supporten musste, hab ich das gelassen...","replies":[{"poster":"MisterZiup","date":"2016-03-04T18:28:06.682+0000","up_votes":1,"down_votes":0,"body":"Geht mir genau so","replies":[]}]},{"poster":"eQ Fortimbras","date":"2016-02-17T11:17:37.786+0000","up_votes":1,"down_votes":0,"body":"Als Main Support bekomm ich zu 90% meine Rolle, weil ja niemand Support spielen will.\n\nAber vor kurzem hatte ich ein Spiel mit einem Premade indem er Unten/Support und ich Support/Mitte gewählt hatten.\nEr hat dann Support und ich Mitte bekommen, wobei unsere Wartezeit wie üblich bei weit unter 10 Sekunden lag.\n\nDas lässt vermuten, dass das System gravierende Mängel hat und die Erst- und Zweitrolle gleich bewertet.\nIch vermute fast, dass einfach nur willkürlich 10 Spieler mit passender Elo zusammen geworfen werden aus deren 10 Rollen sich zwei Teams bauen lassen.","replies":[]},{"poster":"JackTheStrípper","date":"2016-02-16T16:26:55.750+0000","up_votes":1,"down_votes":5,"body":"Immer sind die Leute am rumheulen... Entweder weil Sie nicht hauptsächlich ihre Wunschrolle bekommen oder weil Sie zu lange Wartezeiten haben um ihre Wunschrolle zu bekommen. Rumheuler gibts immer. In jedem Game. Und dann gibts noch diejenigen die etwas tun bzw. aus dem eigenen Leid einen Nutzen ziehen. Damit will ich sagen: Es war verdammt nochmal, niemals, jemals, so verdammt, unverschähmt einfach sich als Supporter hochzucarrien. \nDenn 90% aller Teams haben einen Supporter der eigentlich ein Rumheuler ist und kein \"Macher\". Trifft so ein Team gegen ein Team an, dass einen SUpporter hat der mit Leidenschaft hinter seiner Rolle steht braucht man sich die Gewinnquoten nicht mehr auszurechnen.\nAusserdem hab ich das Gefühl, dass alle diese Rumheuler keine Freunde haben. Sonst könnten sie ja diese einladen. Irgend ein Kumpel der Supporter maint gibts immer. \n\nOver and Out","replies":[{"poster":"KeylanX","date":"2016-02-17T08:42:40.103+0000","up_votes":2,"down_votes":0,"body":"Die Rumheuler, welche über Runheuler rumheulen sterben aber auch nicht aus ;o)\n\nWenn irgend etwas nicht so läuft wie man es gerne hätte, oder wie es sollte, dann spricht man es an.\nWir nennen es auch gerne \"Kritik\", die dazu dient Dinge zu verbessern.\n\nWenn du allerdings keine Verbesserungen willst/brauchst, und alles zufrieden schluckst (egal wie mies es ist), oder weil dir die nötige Empathie fehlt (ICH habe kein Problem, also GIBT ES KEIN PROBLEM), tja... dann wird \"Kritik\" eben zu \"Rumheulen\" ;o)\n\nEventuell liegt es an deiner Sicht, das es (für dich) so viele Rumheuler gibt, wo andere vielleicht nur \"Kritiker\" sehen.\n\nAber keine Sorge... wir machen die Dinge auch für dich besser, also bleib ruhig wie du bist!","replies":[{"poster":"JackTheStrípper","date":"2016-02-17T09:10:03.826+0000","up_votes":1,"down_votes":0,"body":"Ich will doch gar nicht, dass Dinge für mich \"besser\" gemacht werden. Mir ist schon klar das mein Beitrag sehr provokativ war. Aber gut gegeben btw. ;))","replies":[{"poster":"KeylanX","date":"2016-02-17T09:53:25.064+0000","up_votes":1,"down_votes":0,"body":"Ist sicher auch nicht leicht, wenn man selbst mit einem Thema durch ist und endlich Ruhe haben will, andere jedoch noch Diskussionsbedarf haben. Ich kann dich da natürlich auch verstehen. Aber so ist das im Forum, wir diskutieren halt gern ;o)","replies":[]}]}]}]},{"poster":"Segojan","date":"2016-02-16T12:46:11.053+0000","up_votes":1,"down_votes":0,"body":"lasst doch den Support-Mains ihre Rolle -.-\nmich als support only nervt es, dass ich bei 10 Games gefühlt 4-5 Top gehen muss und wir als dank einen Full AP/AD Support auf der Botlane  haben, der nicht mal den Sightstone kauft....\nKlar ich bau in letzter Zeit auch vermehrt auf Dmg als support, da ich einfach das Gefühl habe, dass sehr viele ADC nicht wissen was sie eigentlich tun müssen. \nAber das liegt daran das es doch relativ viele leute gibt die den Auffüllen-Buttom benutzen und dann herum flamen warum sie laufen Rolle XY bekommen.  \n\nDeswegen wäre ich dafür, dass der Auffüll-Buttom wegfallen soll.\n\nAber etwas Positives hat es schon, dadurch hab ich mich ungemein beim Last-Hit verbessert :)","replies":[]},{"poster":"Shacoláde","date":"2016-02-16T10:53:06.236+0000","up_votes":1,"down_votes":0,"body":"Es gibt dazu ein ganz einfache Lösung\n\nwähle einfach Jungle-Mid. Bekommst du 80% Jungle.\n\nVorrausgesetzt du kannst auch mitte alternative spielen.","replies":[]},{"poster":"Untouchable ProX","date":"2016-02-16T11:45:17.712+0000","up_votes":1,"down_votes":1,"body":"Ihr spricht hier von einen ''System'', ein Computer-Programm.\nKeiner hier kennt genau die Programierung nach welche Verfahren die Rollen angewendet werden.\nZudem selbst wenn die Wahrscheinlichkeit XYZ beträgt, redet man immer noch über Wahrscheinlichkeiten.\nSelbst bei 90% 1th Pick, kann man 10x hintereinander second Role bekommen.\nWenn hier keiner sagen kann, wie dies genau arbeitet und man sich nur über Wahrscheinlichkeiten aufregt die unbekannt sind, dann bringt dies alles doch relativ wenig.\n\nIch kann verstehen wie ärgerlich dies scheint zu sein, wenn man umbeding eine Rolle spielen will, aber seinen sekundäre bekommt.\nJedoch finde ich dies immer noch weitaus besser als der alte Modus mit dem reinen ''Chat-spamen''.\nMan muss aber auch beachten, Riot will auch einen flüssigen und schnellen Spielablauf leisten. Würde man nur die primäre Rolle geben, fehlen also die Hälfte aller Rollen weg und es würde Wahrscheinlich umso länger dauern.","replies":[]}]}