{"poster":"LastKíng","date":"2016-10-28T02:23:48.720+0000","title":"account löschen","subforum":"Hilfe & Support","up_votes":1,"down_votes":3,"body":"Gibts in diesem drecksspiel keine funktion um den account zu l&ouml;schen?","replies":[{"poster":"silibum","date":"2016-10-28T06:55:18.447+0000","up_votes":2,"down_votes":0,"body":"Siehe [hier](https://support.riotgames.com/hc/de/articles/202647784) - Deine Ausdrucksweise scheint mir stark verbesserungswürdig.","replies":[]},{"poster":"Homunculi","date":"2016-10-28T06:25:36.799+0000","up_votes":1,"down_votes":0,"body":"Es gibt eine oder zwei, etwas umständliche Methoden wie du nie wieder an deinen Account kommst.\n\n1. Erstelle eine neue E-Mail Adresse, nimm als Namen irgendwas kryptisches, sowas wie \"Kopf auf Tastatur\"@irgendwas.de, als Passwort nimmst du auch nur iwas was du auf die Tastatur gehämmert hast, am besten natürlich vorher irgendwo in eine .txt Datei speichern. Das gleiche oder auch ein anderes Passwort kannst du dann für deinen Account hernehmen.\n\nSo jetzt, gehst du in dein Profil, sollte ja über die Webseite gehen, und änderst einmal die E-Mail Adresse und danach das Passwort, mit den kopierten Passwort.","replies":[{"poster":"CustomKunibert","date":"2016-10-28T06:41:38.104+0000","up_votes":1,"down_votes":0,"body":"direkt den Account zu löschen ist bei LoL nicht möglich?\nNaja zur Not kann man immer noch einen Permabann erzwingen :P","replies":[{"poster":"Alustus100","date":"2016-10-28T07:12:50.108+0000","up_votes":1,"down_votes":0,"body":"Geht auch über den Support, wobei ich denn Sinn nicht verstehe.\n\nWenn ich keinen Bock  mehr auf lol habe dann deinstalliere ich das Spiel mehr ist da mMn nicht  nötig.","replies":[{"poster":"5weeds","date":"2016-10-28T07:24:36.412+0000","up_votes":1,"down_votes":0,"body":"Ich glaube Ihmfried geht es vor allem darum, dass seine persönlichen Daten (E-Mail und so weiter) im Internet rumfliegen, wenn Riot sie eigentlich nicht mehr braucht.\nOder er ist einfach sauer, weil er n schlechtes Spiel oder so hatte....","replies":[]}]},{"poster":"Homunculi","date":"2016-10-28T07:00:26.875+0000","up_votes":1,"down_votes":0,"body":"Das wollte ich eigtl. auch vorschlagen, aber hab es lieber gelassen, weil das dann Anstiftung zu falschem Verhalten gewesen wäre.","replies":[{"poster":"CustomKunibert","date":"2016-10-28T07:19:44.381+0000","up_votes":1,"down_votes":0,"body":"Da hast du ehrlich gesagt recht, nicht jeder würde die Ironie dahinter verstehen =/","replies":[]}]}]}]},{"poster":"Megamaexx","date":"2016-10-28T04:14:58.889+0000","up_votes":1,"down_votes":0,"body":"Schon mal beim Support angefragt? Löschen wird bestimmt nicht möglich sein, aber man kann in der Regel die Löschung persönlicher Daten beantragen.","replies":[]}]}