{"poster":"myk0ntra","date":"2015-11-24T18:53:14.817+0000","title":"Ilaoi <-- ist riot mit dem hammer getauft ??","subforum":"Champions & Gameplay","up_votes":2,"down_votes":21,"body":"was zum teufel hat sich riot mit so einen champ gedacht sag mal tickt ihr noch ganz sauber so einen mist auf den markt zu schmeissen ich w&uuml;rde euch mal empfehelen champs vor dem release zu spielen das zum thema anpassen und alles champs auf ihr art und wei&szlig;e gleich stark zu machen und dann so einen OP mist auf den markt zu schmeissen und ihn dann auch noch in die pre season zu setzen ich glaube ihr wurdet alle mit dem hammer getauft kein wunder wenn euch die leute weiter weg rennen zu den alternativen und ihr nur noch flam kiddys hier rum springen in den seasons \nich glaube da arbeiten nuir noch hammerdolle die auf die kohle scharf sind die alle raus hauen f&uuml;r champs uns skins","replies":[{"poster":"Bladewind515","date":"2015-11-24T19:09:00.018+0000","up_votes":5,"down_votes":0,"body":"Illaoi ist sehr stark wie alle neuen chmamps weil die meisten nicht wissen wie man mit ihnen umgeht/gegen sie spielt.Zum beispiel hat illaoi keine chanche gegen vayne und trotzdem wird sie nicht gut genug generft.sie ist erst seit eine. Tag draußen also pls heul net rum XD","replies":[]},{"poster":"Sirrkas","date":"2015-11-24T22:57:42.973+0000","up_votes":3,"down_votes":0,"body":"Die Illaois die ich gesehen habe, wurden bisher alle zerstört. Nasus hat eine auf der Top klein gehalten und sich an den Tentakeln hochgefarmt und die Jungle Illaoi war jetzt kein so gefährlicher Ganker.","replies":[{"poster":"OrangeBubble","date":"2015-11-25T08:11:15.326+0000","up_votes":1,"down_votes":0,"body":"Same here.\nDie, die ich jetzt hatte, waren nicht so der burner.","replies":[]}]},{"poster":"gyyyr","date":"2015-11-24T20:05:57.603+0000","up_votes":1,"down_votes":0,"body":"wieso ist die denn überhaupt schon spielbar, in den patchnotes hies es \"Illaoi, die Krakenpriesterin, wird während Patch 5.23 veröffentlicht.\" und es ist noch nicht einmal ein Tag vergangen. Mir ist schon klar dass das auch \"während dem Patch 5.23\" ist, aber trotzdem, bringt die Champs doch ein paar tage später raus wenn ihr schon so etwas in die Patchnotes schreibt.","replies":[]},{"poster":"Kartoffelking983","date":"2015-11-24T19:59:09.033+0000","up_votes":1,"down_votes":0,"body":"also ich fand sie auch extrem op in der review und von pbe gameplayer aber in meinen letzten 3 games war sie recht schwach..vllt hatte ich aber auch nur glück","replies":[]},{"poster":"Fermi Paradox","date":"2015-11-24T20:47:42.697+0000","up_votes":3,"down_votes":3,"body":"Jetzt nochmal bitte mit Punk, Komma und verständlicher Grammatik, so ist das ja ein Graus, den Text überhaupt zu entziffern.\nR.I.P. Deutsche Zeichensetzung und Rechtschreibung","replies":[]},{"poster":"Sephi51","date":"2015-11-24T21:39:12.424+0000","up_votes":1,"down_votes":5,"body":"Keine Sorge, Rengar war bei release auch zu stark und wurde danach gebufft. \nAbfall livedesign team eben.","replies":[{"poster":"Ireliα","date":"2015-11-26T00:27:46.872+0000","up_votes":1,"down_votes":0,"body":"made my day :D","replies":[]}]}]}