{"poster":"G2 Bacter1a","date":"2015-06-22T03:46:43.478+0000","title":"Puntos De Maestrias","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"Por que si juegas una partida de aquellas y pierdes ganas 200 pts de maestr&iacute;as? Encuentro que es injusto que por el solo hecho de que el team enemigo sea superior en composici&oacute;n (y deleteen con 2 habilidades en tf) o que tu equipo sea incarreable, pero tu juegas bien ganes tan pocos puntos. Por otra parte, hay match&#039;s donde te consideras a ti mismo digno de Madera o Papel Lustre V, pero te carrean ganas 1200 o 1500 pts de maestr&iacute;a. Creo que este sistema deber&iacute;a basarse en tu desempe&ntilde;o individual en la partida; haces una partidaza 1200 o mas pts, juegas como un Madera V 200 independiente el resultado de la partida. Es tedioso que te esfuerces con todo tu corazoncillo de bronce por ganar y carrear la partida, no puedas y te den 200 miseros puntos. Espero alguien de Riot lo lea y ustedes invocadores que sienten el mismo desaz&oacute;n comenten en este tema para podamos arreglar este asunto.\r\n\r\nSe despide fraternalmente\r\n\r\nSK Bacteria{{item:1055}}","replies":[{"poster":"cirok58","date":"2015-06-22T04:32:32.147+0000","up_votes":1,"down_votes":0,"body":"Los puntos de maestría no te los dan dependiendo si ganas o pierdes, te los dan por tirar torres y que tu score sea mas o menos balanceado, pero si matas mucho y no tiras ninguna torre y tienes poco farm no te darán puntos prácticamente, en cambio aunque tengas pocas kills y algunas muertes, pero con buen farm y habiendo tirado o ayudado a tirar torres aumenta la cantidad de puntos pues el juego no se gana por kills se gana tirando torres ;) un saludo","replies":[{"poster":"G2 Bacter1a","date":"2015-06-22T21:22:10.375+0000","up_votes":1,"down_votes":0,"body":"No es tan asi como dices tu, o al menos eso creo yo. Soy main ADC (o al menos lo intento) y mi farm esta siempre por sobre los 300 (regular), me gusta hacer split push y jugar a botar torres. En la noche de ayer con {{champion:67}} hice 17/6/7 (KDA 4), 222 miseros creeps (partida dificil) pero aun asi gane 200 pts de maestria. Creo yo que es demasiado injusto.\n\nSaludos y gracias por comentar :)","replies":[{"poster":"cirok58","date":"2015-06-25T04:23:52.893+0000","up_votes":1,"down_votes":0,"body":"Recuerda que no solo es el farm y kill, también es tirar torres y sacar objetivos, si no son esas cosas entonces no se como evalúa riot pero estoy convencido de que es así, al meno así lo veo yo n.n\nP.D: Así me gustan los juegos! botar torres da partidas","replies":[]}]}]},{"poster":"FurchiDC","date":"2015-06-22T07:17:13.439+0000","up_votes":1,"down_votes":0,"body":"Tal cual. Ayer perdí una partida jugando {{champion:84}} donde terminé 16/13/15 (KDA de 2.38, dentro de todo bien) y me dio 250 puntos más o menos. Anteriormente gané una partida con un KDA malísimo que no recuerdo pero menor a 1 y me dio como 1300 puntos. O SEA, ¡VAMOS RITO!","replies":[{"poster":"cirok58","date":"2015-06-25T04:23:19.228+0000","up_votes":1,"down_votes":0,"body":"Si tiraste torres y farmeaste bien ademas de ayudar al equipo esos 1300 puntos están bien evaluados","replies":[]}]},{"poster":"Ks Erwyn","date":"2015-06-23T00:18:27.695+0000","up_votes":1,"down_votes":0,"body":"si, si claro un sistema basado solo en el KDA claro, asi empiezan luego lo pedirán para ranked................","replies":[{"poster":"G2 Bacter1a","date":"2015-06-23T02:07:36.679+0000","up_votes":1,"down_votes":0,"body":"Si no es asi como veran tu dominio del personaje? Si hay partidas donde tu juegas como nunca o ya tienes un dominio sobre cierto campeon, pero el otro equipo tiene mas sinergia, mejor tf o lo que sea y pierdes, recibes muy pocos puntos, pese a que tu desempeño con el champ fue bueno o excelente. Yo considero que eso es demasiado injusto","replies":[]}]},{"poster":"Nombre ofensivo","date":"2015-06-22T04:11:09.678+0000","up_votes":1,"down_votes":0,"body":"no lo diria con esas palabras pero si estoy de acuerdo. ","replies":[]}]}