{"poster":"DrOpossum","date":"2018-10-17T19:55:20.822+0000","title":"OpossumTS.net - Öffentlicher TeamSpeak mit LoL-Integration","subforum":"Clans & Teams","embed":{"description":"Hey! OpossumTS.net ist ein TS, fokussiert auf LoL. Wenn du Mitspieler suchst oder dir einen kostenlosen Channel erstellen möchtest, schau gerne vorbei.","url":"https://www.opossumts.net","image":"https://optimized-cdn.opossum.media/www.opossumts.net/link-us-content/opossumts-logo-grau.png"},"up_votes":1,"down_votes":0,"body":"Hallo zusammen! \n\nIm folgenden stelle ich euch die TeamSpeak-Community OpossumTS.net vor :) Wem der Text zu lang ist, der findet unten nochmals Stichworte.\n\n**Wer sind wir?**\n\nWir sind eine Gemeinschaft von Spielern und Spielerinnen, die in ihrer Freizeit die verschiedensten Videospiele spielen. Den gr&ouml;&szlig;ten Spa&szlig; im Spiel ziehen wir daraus, neue Spieler kennen zulernen und uns gemeinsam mit ihnen den Herausforderungen im Spiel zu stellen. Unsere Community besteht, zum gr&ouml;&szlig;ten Teil, aus deutschsprachigen Spielern und Spielerinnen.\n\n**Was wollen wir?**\n\nUnser Ziel ist es, unseren Spielspa&szlig; mit anderen zu teilen. Wir m&ouml;chten dir die M&ouml;glichkeit geben, ebenfalls Spieler kennen zulernen, um dann Gemeinsamkeiten zu entdecken. Alle Spieler und Gruppen sollen bei uns die Gelegenheit erhalten, gemeinsam Events auszurichten, sich an Wettbewerben zu beteiligen oder neue Mitglieder zu finden. Deshalb stellen wird jedem Nutzer einen Teamspeak-Channel zur Verf&uuml;gung, in dem er mit seinen Freunden zusammen spielen kann.\n\n_Hier noch ein paar Stichworte:_\n\n**Finde neue Mitspieler**\nDu kannst die Spielersuche-Channel verwenden, um neue Teammates f&uuml;r League of Legends, Fortnite oder andere Spiele zu finden.\n\n**Fokussiert auf LoL**\nUnser TeamSpeak bietet besondere Unterst&uuml;tzung f&uuml;r League of Legends. Stelle deine Main-Champs &amp; Elo f&uuml;r alle sichbar &uuml;ber Servergruppen dar und finde so eventuelle Mitspieler! Die Gruppen werden dir automatisch zugewiesen. Sobald du deinen Account mit dem TeamSpeak verbunden hast werden dir, sobald du ein Match startest, Details &uuml;ber deine Gegner via TeamSpeak geschickt!\n\n**Spielen mit Freunden**\nWir bieten neutrale Channel, damit du dich mit Bekannten in einer kleinen Gruppe zur&uuml;ckziehen kannst.\n\n**Eigene Channel**\nIhr k&ouml;nnt euch gerne einen permanenten Channel &uuml;ber unsere Website erstellen, in dem ihr tun k&ouml;nnt, was ihr wollt. Der Channel bleibt bestehen bis er 30 Tage nicht genutzt wird. \n\n**24/7 online**\nDer TS-Server ist nat&uuml;rlich rund um die Uhr online - und bleibt dies Dank starker Protection auch.\n\n**Ranksystem**\nF&uuml;hle dich f&uuml;r deine Anwesenheit belohnt, dank intuitivem Levelsystem. Mit dem Aufstieg erhaltet ihr einige komfortable Rechte.\n\n**Commands im TeamSpeak**\n&Uuml;ber Commands direkt im TeamSpeak kannst du Statistiken von LoL, Fortnite und Rainbow6 Siege abfragen.\n\n**Platz f&uuml;r deinen Stream**\nF&uuml;r Streamer bieten wir eigene, von den anderen abgehobene Channel die dank Online-Anzeige, Schnellreise f&uuml;r neue User und angepassten Channelgruppen optimal zum Streamen geeignet sind. \n\n**Musikbots**\nNat&uuml;rlich ist bei uns auch mit mehreren Musikbots f&uuml;r ausreichend Musik gesorgt.\n\nIntresse geweckt? Schaut vorbei! Bei Fragen, meldet euch gerne hier oder auf dem TeamSpeak :)\n\nDen TeamSpeak erreicht ihr unter: **OpossumTS.net**\n\n{{sticker:poppy-wink}} \n","replies":[{"poster":"TriggerDinger","date":"2018-10-17T19:58:42.510+0000","up_votes":2,"down_votes":0,"body":"Das ist ein richtig nicer TS. Kommt alle schnell vorbei!!!!! \n{{sticker:sg-lux}} {{sticker:sg-lux}} {{sticker:sg-lux}}","replies":[{"poster":"DrOpossum","date":"2018-10-17T20:56:53.790+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-ahri-2}}","replies":[]}]},{"poster":"DrOpossum","date":"2018-11-11T15:53:57.082+0000","up_votes":1,"down_votes":0,"body":"Pussshhh ^_^","replies":[]},{"poster":"DrOpossum","date":"2018-10-25T09:39:07.011+0000","up_votes":1,"down_votes":0,"body":"Noch ein Push 😊👌","replies":[]},{"poster":"DrOpossum","date":"2018-10-23T20:04:45.443+0000","up_votes":1,"down_votes":0,"body":"Auf nach oben :D","replies":[]},{"poster":"DrOpossum","date":"2018-10-19T18:12:50.404+0000","up_votes":1,"down_votes":0,"body":"Kleiner Push ^_^","replies":[]},{"poster":"DrOpossum","date":"2018-10-18T09:36:02.885+0000","up_votes":1,"down_votes":0,"body":"Push ^_^","replies":[]}]}