{"poster":"Loveless Vagrant","date":"2020-01-15T17:51:15.124+0000","title":"[fanfic] El despertar de Thresh","subforum":"Creaciones de la comunidad","up_votes":5,"down_votes":1,"body":"hay cosas que es mejor que nunca salgan a la superficie, que queden enterradas en el mismo lugar donde estuvieron siempre porque cuando emergan a la superficie el terror y la devastacion que pueden llegar a causar es algo calamitoso, tal es el caso de Thresh, un hombre amoral que perdio lentamente la cordura y su humanidad dejandose llevar por sus macabras maquinaciones al torturar una y otra y otra vez a aquellos objetos magicos a los que se le habia encomendado proteger, el disfrutaba profundamente pasar los dias sembrando el terror en ellos pero habia algo que lo tenia insatisfecho, despues de todos esos años de encierro el deseo de saber que tan resistente era la carne se volvia mas y mas y mas fuerte al punto de consumir la poca cordura que quedaba en el, los dias se volvian eternos y la satisfaccion que sentia al realizar sus atrocidades se volvia cada vez mas y mas insipida, despues de todo el era solo un hombre recluido entre objetos magicos, vivos pero inertes al mismo tiempo. \r\n\r\nVarias veces penso en escapar de su deber y saciar su curiosidad pero su cuerpo carente de toda fuerza por años de abandono no podria llegar muy lejos antes de que cayera rendido ante el cansancio, Thresh empezaba a pensar que la idea de haberse ofrecido para ser el guardian de aquel lugar habia sido una idea estupida y de ello hablaba consigo mismo durante los dias y las largas noches que pasaba insomne. Pero un dia paso algo que Thresh no esperaba, algo que le daria sentido a su existencia una vez mas. A las islas donde el vivia arribo un rey poderoso y arrogante quien creia que su poder todo lo podia... incluso revivir a su difunta esposa. Los monjes del templo de la isla se negaron rotundamente a ejecutar esa orden lo que enfurecio al rey quien cegado por su ira desato una carniceria sangrienta blandiendo su espada contra aquellos monjes inocentes hasta que por fin los pocos que quedaban temiendo por su vida accedieron a realizar el ritual prohibido y el rey  aprendio de la forma mas dificil que nadie, ni siquiera el, podia vencer a la muerte cuando el cuerpo de su esposa se convirtio en una masa de carne y musculos palpitante que emitio un horrible alarido antes de desangrarse hasta morir.\r\n\r\nEl rey no podia creer lo que habia visto, como su hermosa y amada esposa se habia convertido en aquella aberracion deforme en vez de haber vuelto a la vida como le habian prometido que pasaria. El rey una vez mas empuño su espada cegado por la ira y el dolor... pero no pudo hacer mucho porque un dolor intenso y punzante recorrio todo su cuerpo haciendolo sentir una profunda agonia mientras veia como una niebla negra comenzaba a surgir desde lo que fue el cuerpo de su esposa y lo envolvia todo, acabando con toda vida que tocase; plantas, animales, personas... todos los seres vivos que habitaban las islas se hundieron en una agonia mortal que los fue consumiendo lentamente hasta que no quedo nada de ellos, solo sus cuerpos sin alma pudriendose sobre la tierra negra y marchita. Pero ese no fue el caso de Thresh, al ser alcanzado por la niebla el dolor se convirtio en satisfaccion, por fin podia saber que tan fragil era la carne y el mismo era parte de su macabro experimento hasta que su debil cuerpo no soporto mas, pero ese no fue su fin, su alma era muy fuerte como para dejarse arrastrar por la niebla y sus deseos de experimentar nuevos tipos de tormento fueron lo que le permitieron vencer a la corriente y ser libre, reviviendo como un ser espectral de aspecto temible rodeado de un aura aterradora que helaba la sangre, al ver su nueva forma Thresh solto una carcajada que resono por todas las catacumbas y sin perder tiempo salio hacia la superfice, al ver semejante festin de muerte y agonia sintio como su determinacion se volvia mas y mas fuerte, quizas no quedase nadie vivo en aquel paramo desolado... pero Runaterra era grande... MUY grande y estaba dispuesto a convertirla en su patio de juegos.\r\n\r\nLa historia de las abominaciones causadas por thresh es bien conocida por todos en Runaterra, la lista de atrocidades que realizo y sigue realizando es vasta y el se enorgullece de ello, su galeria de experimentos: empalar personas de distintas edades y sexos para ver cuanto tardaban en morir, degollar vivas a personas con su guadaña hasta que el sangrado y la agonia los hacian colapsar, de estrujar cuellos y quebrar huesos lenta y metodicamente para que los gritos de sus victimas se oyesen lo mas fuerte y claro posible, desgarrar lentamente el pecho de sus victimas y ver cuantos organos podia arrebatar antes de que muriesen... y como si eso no fuera sufieciente Thresh siempre robaba las almas de sus victimas encerrandolas para siempre en su linterna asi siempre podria escuchar los gritos agonicos de aquellos que encontraron la muerte en sus manos. Una eternidad de tormento y sufriemiento que el se alegraba de poder darles.\r\n\r\nSe dice que nadie sobrevive una vez que Thresh lanza su guadaña contra ellos, pero siempre deja testigos vivos para que difundan la palabra de su existencia y de sus macabros juegos\r\n\r\n-Que quien soy? ja ja ja, pues... soy aquel que mora en las sombras, aquel monstruo que vive debajo de la cama... ese es quien soy.\r\n\r\nes lo que siempre decia a los aterrados testigos antes de fundirse en la oscuridad de la cual vino mientras su carcajada espectral corrompia las almas de todos aquellos que no habian muerto, pero que, eventualmente, terminarian cantando aquella cancion desesperada en su linterna por toda la eternidad.","replies":[{"poster":"JuhnJuhn","date":"2020-01-15T18:03:47.069+0000","up_votes":1,"down_votes":0,"body":"falta mejorar la redacción y la ortografía :(","replies":[]},{"poster":"JACKY FANBOY","date":"2020-01-15T18:11:08.731+0000","up_votes":1,"down_votes":1,"body":">-Que quien soy? ja ja ja, pues... soy aquel que mora en las sombras, aquel monstruo que vive debajo de la cama... ese es quien soy.\n\nNo suena a algo que diria thresh\n y lo de dejar sobrevivientes era de los piratas del caribe, dudo que alguien como thresh le importe si su \"leyenda\" se sabe o no","replies":[]}]}