{"poster":"Warthogh","date":"2016-01-31T19:37:43.781+0000","title":"Partite da 7 minuti","subforum":"Aiuto e supporto","up_votes":1,"down_votes":9,"body":"Oggi ho fatto qualche partita della durata di 7 minuti&quot;trollando&quot; per guadagnare ip facili. Un tipo mi ha reportato e mi ha detto che sarei stato bannato, ma io non ci ho creduto, dato che non ritengo che farmare ip in questo modo sia qualcosa di illegale. Durante la partita successiva alcuni player mi hanno detto che la riot avrebbe bannato per questo, perci&ograve; io mi sono preoccupato, anche perch&egrave; avevo ricevuto un report e quindi se fosse vero avrei il ban assicurato. Alla fine di questa partita ho tentato di informarmi ma su internet non ho trovato nulla che parlasse di questo ban o comunque del fatto che non si dovessero fare i 7 mins match. Cosa sapete dirmi su questo?","replies":[{"poster":"WitchHunterZer0","date":"2016-01-31T19:41:32.938+0000","up_votes":2,"down_votes":0,"body":"Come ha scritto Riot Judge \"Al momento questa pratica viene punita se qualcuno del team avversario non è d'accordo, mentre se c'è accordo tra tutti e 10 i giocatori non c'è punizione.\nPersonalmente credo che questa cosa non dovrebbe esserci e spero che venga rimossa in futuro :)\" \n\nQui troverai link del post\n\nhttp://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/KEHmepgn-cosa-ne-pensano-i-rioter-del-nuovo-trend-per-farmare-ip?comment=000a","replies":[{"poster":"Warthogh","date":"2016-01-31T21:01:19.231+0000","up_votes":2,"down_votes":1,"body":"Risposta a tutti i post: non sono stato reportato per feeding intenzionale, ma per comportamento scorretto in gioco. E comunque a quanto ricordo quando il player contrario ha rivelato di esserlo era ormai troppo tardi perchè avevamo già iniziato a feedare, dunque non avremmo comunque potuto giocare una partita bilanciata.","replies":[]}]},{"poster":"Chroniicles","date":"2016-01-31T19:41:25.427+0000","up_votes":2,"down_votes":0,"body":"In un commento ufficiale dei rioter è stato detto che quella pratica è consentita solo se c è accordo tra tutti i giocatori. Anche perché, in caso contrario, staresti rovinando l'esperienza altrui.\nSe cerchi nel forum trovi il post e tutti i dettagli","replies":[]},{"poster":"Firenheit","date":"2016-01-31T19:41:36.443+0000","up_votes":2,"down_votes":2,"body":"Si, l'\"open mid\" è punibile ed è strano che tu non lo sia già stato. \nLo si può fare SOLO se tutti e 10 i partecipanti sono d'accordo, perché sono affari vostri come giocare, ma dal momento che un team o parte di esso non è d'accordo il tutto si trasforma in feeding intenzionale, aiuto alla squadra amica, trolling e qualsiasi cosa affina. \nAprire mid vuol dire rovinare una partita a chi ha loggato per giocare, per questo un comportamento tossico. \n\nSei vuoi un consiglio, sei fortunato a non aver ricevuto una punizione e ti consiglio di smetterla :)","replies":[{"poster":"Zedant","date":"2016-02-01T19:25:33.403+0000","up_votes":1,"down_votes":0,"body":"di solito si fa 5 premade(quelli intelligenti) e ai nemici di solito piace o non dicono niente.","replies":[{"poster":"Firenheit","date":"2016-02-01T19:32:41.101+0000","up_votes":1,"down_votes":0,"body":"Non esiste il di solito, esistono solo i casi.\nSe tutti e 10 sono d'accordo, ok, altrimenti ne basta 1 che sia punibile. \nSe qualcuno reporta vuol dire che non tutti erano d'accordo.","replies":[{"poster":"Zedant","date":"2016-02-12T14:34:05.032+0000","up_votes":1,"down_votes":0,"body":"oppure era un monello","replies":[]}]}]}]},{"poster":"Capoz","date":"2016-01-31T19:51:28.209+0000","up_votes":1,"down_votes":0,"body":"Quindi se io ti ritrovassi in partita me lo dovrei prendere nel c**o per \"7 minuti\" solo perchè devi fare IP veloci? \nQuindi se ti incontro in ranked, magari durante la tua promo, e decidessi di fare \"ip facili\" tu non mi reporteresti, giusto?\nO reporti solo gli altri troller?\nCome siamo caduti in basso...","replies":[{"poster":"Zedant","date":"2016-02-01T19:24:39.176+0000","up_votes":1,"down_votes":0,"body":"se tu fai ip facili in ranked hai qualche problema,comunque si puo reportare se ti hanno influenzato l eseperrienza di gioco(se sei 5 premade e un altro storia e ai nemici piace praticamente sempre).","replies":[{"poster":"Capoz","date":"2016-02-01T20:02:50.421+0000","up_votes":1,"down_votes":0,"body":"Non hai colto appieno il punto","replies":[]}]}]},{"poster":"SideshowEMS","date":"2016-01-31T20:10:37.999+0000","up_votes":1,"down_votes":0,"body":"Non avevo mai sentito questa cosa dei 7 minuti. \nCi sono cose che è meglio non sapere.","replies":[]}]}