{"poster":"TSFeed Mastro","date":"2017-03-06T14:43:49.137+0000","title":"SCHERMO NERO","subforum":"Segnalazioni bug Client Alpha","up_votes":2,"down_votes":3,"body":"mi sono rotto i coglioni di startare le ranked e come entro in queque lo schermo diventa nero e non posso pickare il champion\n\nho preso limitazione x afk e perso molti pl per sti bug del caxxo &egrave; gia la 4 volta che mi succede\n\nVOGLIO CHE MI VENGANO IMMEDIATAMENTE RIDATI I PL E CHE VI VENGA TOLTA LA LIMITAZIONE PER AFK","replies":[{"poster":"BeardSergio","date":"2017-03-06T14:53:40.180+0000","up_votes":2,"down_votes":1,"body":"Considera che sarebbe comunque il caso di moderare i toni.\nDetto questo direi che potresti provare con un repair del gioco ([o usare questo tool ](https://support.riotgames.com/hc/it/articles/224826367-Risoluzione-problemi-automatizzata-strumento-di-riparazione-Hextech) ed un aggiornamento dei driver della scheda video.\nLe punizioni non possono essere tolte se non in rari casi, puoi provare a contattare il supporto ma gli errori lato client spesso dipendono da cose non funzionanti nel pc.\nProva a fare qualche personalizzata dopo aver eseguito i passaggi che ti ho detto così almeno eviti le punizioni in caso di malfunzionamento.\n\nUn consiglio: per le prossime, se hai un problema, non insistere a fare le ranked a meno che tu non sia sicuro di averlo risolto","replies":[{"poster":"TSFeed Mastro","date":"2017-03-06T14:57:46.390+0000","up_votes":1,"down_votes":2,"body":"gia fatto sia repair di gioco che driver di scheda video. \nnon è che ogni volta che accade un problema è SEMPRE COLPA DEL COMPUTER perchè qwuesto è un problema della riot e del client.\n\ngioc a lol da 6 anni e questa è la prima volta che mi capita una cosa del genere","replies":[{"poster":"BeardSergio","date":"2017-03-06T17:59:06.819+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TSFeed Mastro,realm=EUW,application-id=H6akLONL,discussion-id=HXHUrtAM,comment-id=00020000,timestamp=2017-03-06T14:57:46.390+0000)\n>\n> gia fatto sia repair di gioco che driver di scheda video. \n> non è che ogni volta che accade un problema è SEMPRE COLPA DEL COMPUTER perchè qwuesto è un problema della riot e del client.\n> \n> gioc a lol da 6 anni e questa è la prima volta che mi capita una cosa del genere\n\nFosse un bug verrebbero afflitti tutti o quasi. Il fatto che l'ultimo update possa darti problemi ci può stare ma fosse colpa della riot avremmo tutti lo stesso problema. \nHai provato ad eseguire il tool che ti ho linkato? \n\n6 anni di gioco e questo è il primo problema che hai avuto. Mi sembra un'ottima media no? Io non mi arrabbierei così tanto. Mi sembra tu abbia goduto di un gran bel servizio sino ad oggi.\n\nTi ricordo comunque che puoi sempre sentire il supporto tecnico nel caso tu non riesca a sistemare. Proverei anche a disabilitare le animazioni del client nuovo per vedere se cambia qualcosa. ","replies":[{"poster":"Khail the Crow","date":"2017-03-06T20:33:40.847+0000","up_votes":1,"down_votes":0,"body":"Questo non vuol dire niente. Avere un problema di compatibilità (ammesso sia quello) che genera un bug con componenti hardware o software (o combinazioni di questi) è una cosa che compete sempre e comunque alla casa produttrice. \nIn caso ci siano delle specifiche di incompatibilità vanno segnalate. Diversamente è, appunto, un bug del client.\n\n@ Mastro: tieni sempre d'occhio gli annunci sul forum, hanno segnalato il problema, anche se non proprio tempestivamente.","replies":[{"poster":"BeardSergio","date":"2017-03-07T06:12:34.619+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Khail the Crow,realm=EUW,application-id=H6akLONL,discussion-id=HXHUrtAM,comment-id=0002000000000000,timestamp=2017-03-06T20:33:40.847+0000)\n>\n> Questo non vuol dire niente. Avere un problema di compatibilità (ammesso sia quello) che genera un bug con componenti hardware o software (o combinazioni di questi) è una cosa che compete sempre e comunque alla casa produttrice. \n> In caso ci siano delle specifiche di incompatibilità vanno segnalate. Diversamente è, appunto, un bug del client.\n> \n> @ Mastro: tieni sempre d&#x27;occhio gli annunci sul forum, hanno segnalato il problema, anche se non proprio tempestivamente.\n\nNi. Se il tuo pc non è aggiornato, ha componenti corrotte o semplicemente non ci fai mai manutenzione non posso sapere se il mio programma aggiornato funzionerà. Il fatto che possa essere un problema di compatibilità non è una cosa certa. Consideriamo comunque che si tratta di una beta e quindi ci può stare che ci siano problemi. Se dovessi tryhardare sicuramente continuerei ad usare il client vecchio.","replies":[{"poster":"Khail the Crow","date":"2017-03-07T09:51:54.960+0000","up_votes":1,"down_votes":0,"body":"Vabbè chiaro che se la macchina è un trabiccolo è un conto, per il resto tutti i giochi hanno una lista dei sistemi operativi compatibili (per dirne una) e sui componenti hardware consigliati.","replies":[{"poster":"BeardSergio","date":"2017-03-07T10:11:07.139+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Khail the Crow,realm=EUW,application-id=H6akLONL,discussion-id=HXHUrtAM,comment-id=000200000000000000000000,timestamp=2017-03-07T09:51:54.960+0000)\n>\n> Vabbè chiaro che se la macchina è un trabiccolo è un conto, per il resto tutti i giochi hanno una lista dei sistemi operativi compatibili (per dirne una) e sui componenti hardware consigliati.\n\nSì ma non darei per scontato che venga letta. Molto spesso i requisiti minimi vengono presi come per i consigliati e la manutenzione del sistema operativo non viene mai fatta finchè non funzionano anche le cose basilari tipo browser, cestino e cartelle XD","replies":[]}]}]}]}]}]}]},{"poster":"Dodop","date":"2017-03-06T21:57:26.888+0000","up_votes":1,"down_votes":0,"body":"Da quello che ho capito è un problema momentaneo del client alpha (è stato segnalato più volte in questo forum dall'uscita della patch 7.4), ho avuto questo problema anche io l'altro giorno per la 1° volta, mentre la Riot sta cercando di fixarlo, ti consiglio di usare il vecchio client per non rischiare.\nInoltre il supporto suggerisce di chiudere le finestre chat e le caselle della friend list per ridurre la probabilità che il problema si presenta (nel nuovo client).\n\nIn ogni caso ti consiglio di abbassare i toni qui nel forum perché noi non siamo costretti ad aiutarti. Inoltre gli LP non possono esserti restituiti.","replies":[]},{"poster":"Khail the Crow","date":"2017-03-06T15:56:09.750+0000","up_votes":1,"down_votes":0,"body":"Bé, onestamente toni o meno ha ragione. Un problema del genera genera un no match in cui solo la persona affetta dal bug ci perde qualcosa.","replies":[]},{"poster":"mangialavandini","date":"2017-03-06T14:48:22.318+0000","up_votes":1,"down_votes":0,"body":"Vedo nero\nCoi miei occhi\nVedo nero\nE non c'è pace per me\nPerdo il pelo\nShock the monkey\nVedo nero\nE non capisco cos'è\n\nmetti il vecchio client e ti incazzi meno, invece di pretendere cose che sai di non potere avere","replies":[]},{"poster":"TSFeed Mastro","date":"2017-03-06T14:53:35.612+0000","up_votes":1,"down_votes":3,"body":"beh non solo quotidianamente tocca combattere con ritardati e incapaci che ti fanno perdere le partite poi ci si mette pure la riot cons ti bug a danneggiarti ancor di  piu","replies":[]}]}