{"poster":"ChernobogH","date":"2015-06-16T17:41:42.249+0000","title":"League of Legends: a dark future (pt.4)","subforum":"Creazioni della community","up_votes":4,"down_votes":0,"body":"-Signor Graves, come glielo devo dire?! Non pu&ograve; fumare nella sala di un ospedale!-\r\n-Scusi signorina &hellip;- disse Malcolm spegnendo il sigaro a malincuore.\r\n-Gi&agrave; abbiamo allontanato gli altri pazienti per le sue battute, cosa le &egrave; preso?- chiese Akali con alle spalle i lettini vuoti.\r\n-La morte mette paura e bene o male arriva sempre, io cerco solo di sminuirne la paura.-\r\nL&rsquo;infermiera rassegnata si gir&ograve; per raccogliere la cenere ma si rialz&ograve; subito gridando &ndash;Signor Graves!-\r\n-Scusi, e che ha un cos&igrave; bel sedere.-\r\n_______________________________________________________________________________________\r\nUna serie di cadaveri si trovavano alle loro spalle. Varus puntava l&rsquo;arco verso la poltrona e le lame di irelia erano pronte a colpire. La tunica bianca era macchiato da una lunga linea rossa che partiva dalla spalla destra.\r\nIl fuoco scoppiettava nel caminetto e l&rsquo;uomo seduto di fronte a loro reggeva un bicchiere di vino.\r\n-Sapete cosa mi manca di pi&ugrave;? I sapori. Ma &egrave; un sacrificio pi&ugrave; che accettabile per l&rsquo;evoluzione.- disse Viktor alzandosi deciso a guardarli. &ndash;&Egrave; un peccato che ora voi due dobbiate morire, sareste stati utili per l&rsquo;evoluzione.-\r\n-Cosa ti fa pensare che tu possa sopravvivere? Basta una mia freccia o una delle sue lame, ed il tuo cervello si ritrova in frantumi per quanto pu&ograve; essere grande-.\r\n-Temo che una proiezione olografica non possa morire, per quanto possa essere realistica-.\r\nUna delle lame di Irelia part&igrave; facendo scomparire la proiezione, ma non la voce.\r\n-Mi spiace se sono un cos&igrave; cattivo ospite da non accogliervi, ma spero che vi accontentiate di lui. Io ho altri due ospiti inattesi da ricevere-.\r\nIl mecha poteva ricordare una cavalletta, una cavalletta di metallo con due lame pericolosissime, in puro e freddo metallo e con un viso spaventoso.\r\nMentre Kha&rsquo;Zix saltellava nella stanza rispondendo alle frecce con missili e parava le lame con gli artigli Viktor continuava a parlare &ndash;Lo riconoscete? &Egrave; uno dei primi modelli che furono creati per contrastare l&rsquo;invasione dal Void, ma spero che possa essere un buon intrattenimento-.\r\nQuando ora mai non si sentiva pi&ugrave; la voce di Viktor, Irelia piant&ograve; le lame nelle sue ali. Varus spar&ograve; una freccia potenziata trapassando il corpo robot.\r\n-Non sembra troppo forte.- disse Irelia incredula.\r\n-Il suo compito non era ucciderci, era distrarci&hellip;- Part&igrave; un esplosione.\r\n-Cosa facciamo?- chiese l&rsquo;assassina.\r\n-Stringimi.- disse Varus portandola verso di se.\r\n-Senti Varus, lo so che stiamo per morire ma&hellip;-\r\nScocc&ograve; una freccia esplosiva e Varus stringendo l&rsquo;assassina, fece partire dalla pistola un rampino diretto verso uno strano oggetto in aria.\r\nMentre i due corpi salivano l&rsquo;intera struttura crollava alzando polvere e neve.\r\n\r\n-Ho una notizia buona ed una cattiva.- disse l&rsquo;arciere fissando il trabiccolo &ndash;La buona &egrave; che tra poco saremo in una delle nostre basi. La cattiva&hellip;- Il fumo si fece sempre pi&ugrave; pesante e il R-16 crollo.\r\nRotolarono sulla neve senza subire troppi danni. Una volta arrestati Irelia fece &ndash;Scusa Varus potresti toglierti di dosso? E poi scusa ma sei felice di vedermi o hai una pistola nei pantaloni?- e Varus mostr&ograve; una seconda pistola a rampino.\r\n-Ah, scusa&hellip;-\r\n_______________________________________________________________________________________\r\n-Incredibile.- fece Heimerdinger fissando lo schermo.\r\n-Cosa c&rsquo;&egrave; di incredibile? &Egrave; soltanto un cyborg che per poco non mi faceva la festa.- disse Teemo chiaramente irritato.\r\n-Non capisci. Ho rivisto i dati registrati dal tuo elmetto ed ho potuto notare una cosa: rispetto a tutti i cyborg che avevano la sua forza, lui ha un upgrade minino, solo un esoscheletro esterno e dei potenziamenti minimali-.\r\n-Aspetta un momento, tu vuoi farmi credere che quello era una bestia gi&agrave; da uomo? Ora capisco perch&eacute; se ne stava da solo rispetto agli altri: ha trucidato tre professionisti della guerra senza troppi problemi e&hellip;-\r\nUn rumore dalla stanza affianco interruppe la discussione.\r\n-Doc, pensavo che fossi il solo qui dentro. Se &egrave; cos&igrave; mi sa che hai una bella infestazione-.\r\n-&Egrave; Jayce. Notte e giorno sta attaccato a quella &lsquo;&rsquo;tomba hextech&rsquo;&rsquo;. Ognuno di noi ha subito traumi a causa della guerra ed appena ha saputo che Caitlyn era in pericolo si &egrave; rinchiuso l&igrave; e non vuole nemmeno parlarmi.-\r\n_______________________________________________________________________________________\r\nIl monaco poteva sentire chiaramente la voce del deserto. Si lamentava per lo scempio portato dal &lsquo;&rsquo;folle&rsquo;&rsquo; ed ora rivendicava giustizia. Era lontano dalla sua casa e dal suo clima, ma quel posto aveva bisogno di aiuto.\r\nI tre cyborg non distoglievano i fucili dalla direzione della figura incappucciata. &ndash;Chi sei?! Identificati.-\r\nFaceva la voce grossa ma si poteva fiutare la paura, sebbene dai loro corpi non si sentiva alcun odore animale.\r\n-Chi sono?- chiese il monaco. La sua voce riecheggi&ograve; come un ruggito facendo indietreggiare i tre nemici. Lasci&ograve; andare la veste mostrando una tunica da monaco legata alla vita, una collana da buddista scendeva dalla spalla sinistra soprastando il fisico scolpito e delle cicatrici sul petto.\r\n-Io sono Udyr, e voi siete gi&agrave; morti!-\r\n\r\nOggi mi sentivo ispirato (sar&agrave; l&#039;acquisto della Ps4, la sessione intensiva su Metal Gear Ring o il cannone del mio amico), perci&ograve; non abituatevi a sto lusso. Ah! Mi sono dimenticato di una cosetta alla fine: You wa shock! \r\nLink alla biblioteca dove troverete molte altre storie, non solo mie http://boards.euw.leagueoflegends.com/en/c/creazioni-della-community-it/dvvixXez-piccola-biblioteca-alessandrina","replies":[{"poster":"ViaMalinconiaN9","date":"2015-06-16T18:51:16.317+0000","up_votes":2,"down_votes":0,"body":"Yeahh, vai con i Cannonii {{champion:104}} \nè inutile che commento, i miei +1 so meritati.","replies":[{"poster":"ChernobogH","date":"2015-06-17T08:46:44.995+0000","up_votes":1,"down_votes":0,"body":"Allora Graves è uno dei tuoi personaggi preferiti... Bene (parte una risata malvagia).","replies":[{"poster":"ViaMalinconiaN9","date":"2015-06-17T11:25:57.760+0000","up_votes":1,"down_votes":0,"body":"No veramente non lo sopporto in game, non l'ho mai usato se no in free rotation xD\nIl/la mio/a adc preferito/a è e rimarrà {{champion:133}} (Unico champ con la Q à.à che figata)","replies":[]}]}]}]}