{"poster":"ChernobogH","date":"2015-06-19T21:30:44.560+0000","title":"Bloccare i campioni.","subforum":"Campioni e gameplay","up_votes":3,"down_votes":0,"body":"Riven, Katarina, Master Yi e tanti altri campioni possono essere considerati inarrestabili. Questa mia discussione ha lo scopo di radunare tutti i vostri consigli su come fermare campioni altrimenti inarrestabili. Non voglio alzare il solito polverone &#039;&#039;Noob Champ&quot; ma voglio i vostri commenti per trovare tali risposte tanto agognate da un nabbetto come me e da tanti altri.\r\nVi prego, se avete le risposte mettetele qui, grazie.","replies":[{"poster":"Menfrix","date":"2015-06-19T21:34:59.146+0000","up_votes":6,"down_votes":0,"body":"Il consiglio che ti posso dare e di giocarli, ti renderai conto di quali sono i punti forti e i punti deboli.\nAd esempio se kata e yi li stunni \"muoiono male\"","replies":[{"poster":"Howlight","date":"2015-06-19T22:05:24.431+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Menfrix,realm=EUW,application-id=cAOZwaUi,discussion-id=lQaLELzR,comment-id=0000,timestamp=2015-06-19T21:34:59.146+0000)\n>\n> Il consiglio che ti posso dare e di giocarli, ti renderai conto di quali sono i punti forti e i punti deboli.\n> Ad esempio se kata e yi li stunni \"muoiono male\"\n\n\nConcordo pienamente con quello che e stato detto!!\n\n\npero considera che sono campioni che hanno meccaniche molto semplici e che sfruttano l'early game.. per contrastarli basta stare attenti a nn favorirli in early e scegliere campioni con un'utilita maggiore. Ogni campione ha i suoi metodi per contrastarlo io trovo molto interessante cio che scrivono su questo sito:   http://www.championselect.net/champions/katarina ( ho messo kata come esempio ma li trovi tutti )\n\nse vuoi qualche altra info in piu chiedi pure ;-)","replies":[{"poster":"Darth Ponzius","date":"2015-06-20T16:00:44.747+0000","up_votes":2,"down_votes":0,"body":"master yi da quando è da early game? idem kata che non è che abbia tutto questo dominio in laning fase","replies":[{"poster":"Howlight","date":"2015-06-20T16:21:24.532+0000","up_votes":1,"down_votes":0,"body":"direi che sono da early per via degli oggetti no? nn hanno bisogno di molto oltre che schiacciare R e forse un altro tasto\n\nkata nn consuma mana puoi buildare subito ap al primo back ha sicuramento un potenziale di kill maggiore rispetto alla maggior parte dei mid laner (vedi anche come scala la R su ap e dimmi quanti altri campioni hanno un rapporto simile)\n\nper master yi visto che si parla di jungla nn ha problemi a pulire campi velocemente e a resistere in jungla permettendogli di ottimizzare il primo giro e ottenere un vantaggio rispetto a jungler tank.. poi ti ricordo che tra ulti e q ha un gap close eccezzionale sta solo al cervello della persona utilizzarli nel momento opportuno\n\nse poi dici che per entrambi basta uno stun e gg concordo pienamente ma questo nn vuol dire che nn abbiano dominio","replies":[{"poster":"Darth Ponzius","date":"2015-06-20T19:16:31.125+0000","up_votes":2,"down_votes":0,"body":"Master yi è un carry melee (come Tryndamere e Fiora) che per definizione ha bisogno di oggetti per arrivare a fare un buon danno. Più hanno gold da kill, farm ecc più diventano pericolosi. Ti sei mai chiesto perchè i master yi tendono più a farmare che a gankare? Perchè non avendo cc fanno affidamento solo sul loro danno e as che senza oggetti non sono molto alti. Yi è la definizione di champ da late game. \nAnche per Kata non è che esiste solo il danno, altrimenti giochiamo gli assassin e gg. Kata per farmare deve entrare in range melee, non ha cc e il danno non è altissimo all'inizio, quindi è facile che venga harassata da gente che può usufruire di attacchi dalla distanza rimanendo anche safe. La fase di lane è quella dove latita di più. Infatti deve roamare per cercare di prendere kill ed evitare confronti diretti che in lane la vdrebbero svantaggiata e limiterebbero il suo potenziale.","replies":[]}]}]}]},{"poster":"franz94","date":"2015-06-19T21:57:02.136+0000","up_votes":1,"down_votes":0,"body":"cosa che si può dire con tutti i champ specialmente carry, pero è vero che si deve mantenere un cc per loro perché se no ti possono fare anche una penta...","replies":[]}]},{"poster":"Lotus Senpai","date":"2015-06-19T23:26:01.909+0000","up_votes":3,"down_votes":0,"body":"CC","replies":[]},{"poster":"LionHeartV","date":"2015-06-20T16:23:45.008+0000","up_votes":1,"down_votes":0,"body":"{{champion:82}} sbriciola katarina se lo si sa usare","replies":[{"poster":"ChernobogH","date":"2015-06-20T19:54:39.715+0000","up_votes":1,"down_votes":0,"body":"Lo so usare e mi diverto ad ogni game, ma non posso usarlo sempre.","replies":[]}]},{"poster":"Sorcio84","date":"2015-06-20T13:06:34.021+0000","up_votes":1,"down_votes":0,"body":"Contrastare {{champion:11}} \nLa Q gli AA sono la sua unica fonte di danno .\n- builda full tank con {{item:3075}} {{item:3026}} \n- {{item:3102}} per annullare la sua Q al 100\n\nContrastare {{champion:55}} \nKata se non sbaglio fa : salto > pugnale > final\nDiciamo che con uno stun esplode ma se sei AP puoi usare la {{item:3157}} per invulnerabilizzarti quando lancia la final.\n\nSpero di aver dato un aiuto anche piccolo","replies":[]},{"poster":"Ste the ripper","date":"2015-06-20T08:03:44.057+0000","up_votes":1,"down_votes":0,"body":"Kata inarrestabile, vallo a dire quel pirillo che nella mia promotion non mi lascia la mid, va con kata e chiude in 9 18... ma porca...\nSinceramente riven, kata e yi sono champ che allo stato attuale perdono quasi sempre, non è il loro meta, c'è un solo assassino che nonostante i nerf e nonostante il meta di tank continua a fare veramente danni: le blanc, tutti gli altri non contano","replies":[{"poster":"ChernobogH","date":"2015-06-20T09:57:50.312+0000","up_votes":1,"down_votes":0,"body":"Se sei un coglione a giocare rimani un coglione, ma in mano a gente brava fa veramente male. Comunque questa discussione non deve essere solo su loro tre, ci sono tanti altri campioni che per un motivo o per un altro fanno molto male.","replies":[]}]},{"poster":"SideshowEMS","date":"2015-06-19T22:00:31.004+0000","up_votes":1,"down_votes":0,"body":"Ti dico solo che nella mia ultima partita con Katarina su 10 Ulti di Ashe, 8 me le sono beccate io. Quindi la risposta è semplice. Tanto lo sai quando usa la R. \n\nCon Yi magari è un po' più difficile, ma resta pur sempre un assassino. Anche qui, mi ricordo di una partita che vincemmo perché l'unico con un CC ero io. Ed ero Singed ! Appena Yi provava a curarsi lo lanciavo addosso ai miei.\n\nRiven non l'ho mai considerata inarrestabile. Quindi boh, apparte non darle millanta kill in corsia, non mi viene in mente niente di particolare.\n Ah, se usi un minimo di cervello la puoi battere anche in corsia, o al peggio, non ti fai ammazzare, che è comunque un gran risultato visto come tutti giocano contro Riven ( Devo farmare a tutti i costi = finisce di rompere lo spadone sulla tua testa )","replies":[]}]}