{"poster":"xDaRex","date":"2017-07-11T14:16:47.737+0000","title":"Support Tickets","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey,\nIch habe das gef&uuml;hl das die Mitarbeiter von Riot die meine Tickets bearbeiten garnicht deutsch k&ouml;nnen oder sich garnicht die m&uuml;he machen sich ein wenig zeit zu nehmen um sich darum zu k&uuml;mmern. \nIch habe jetzt zum zweitenmal eine Copy Paste antwort gekriegt, warum gibts es denn dann &uuml;berhaupt ein Ticket System wenn die Mitarbeiter sich nichtmal die zeit nehmen oder kein Deutsch k&ouml;nnen um sich richtig darum zu k&uuml;mmern. Das ist doch alles zeitverschwendung f&uuml;r die Riot Mitarbeiter und uns den Spielern.\n\nKann mir einer das erkl&auml;ren warum ich immer nur Copy paste antworten kriege und mir dann daf&uuml;r die m&uuml;he machen soll.\n\nWenn ich das im falschen forum gepostet habe tut es mir leid, ist mein erster Post.\n\nMfg","replies":[{"poster":"Marcusflo","date":"2017-07-11T16:08:48.614+0000","up_votes":1,"down_votes":1,"body":"Naja das riot Support system ist Eigentlich eine Richtige Schande, Es macht garkein spaß und du kriegst immer ein \"danke für deine Trolle Co-op\" Oder so n Müll. Niemand interessieren die Bugs die du & andere hast. Wegen Eines problemes Mit lol Konnte ich kein lol mehr spielen, worauf ich erst nach 1 1/2 wochen zum Technischen support geschickt wurde, Wo ich eigentlich Schon lange sein sollte, aber mir niemand Half dort hin zu gelangen (weil die supporter den Technischen supportern bescheid sagen, und die das dann übernehmen) Aber dann nach 3 Wochen Kam die Gloreiche erlösung, League of legends hatt sich selbst Repariert, Bzw. es hatt auf einmal wieder gefuntzt, der support bringt rein garnichts und is auch bei Report kaum Bis Garnicht vorhanden (habe 500 Stunden spielzeit) und habe bei ca. sagen wir mal 60 Reports Nur 5 mal die meldung bekommen das der Eine für sein schlechtes verhalten bekommen hat! \nFazit: Google ist dein freund, weil Riot trotz Langem Supporting es nicht Gebacken Bekommt\n(Naja, dazu muss ich aber noch hinzufügen das es doch schon eine hand voll nette Supporter gibt die dir gerne helfen) {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Darkr3sQ","date":"2018-03-08T11:59:39.007+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Marcusflo,realm=EUW,application-id=7hciEY9w,discussion-id=ZukHJ4gw,comment-id=0002,timestamp=2017-07-11T16:08:48.614+0000)\n>\n> Naja das riot Support system ist Eigentlich eine Richtige Schande, Es macht garkein spaß und du kriegst immer ein &quot;danke für deine Trolle Co-op&quot; Oder so n Müll. Niemand interessieren die Bugs die du &amp; andere hast. Wegen Eines problemes Mit lol Konnte ich kein lol mehr spielen, worauf ich erst nach 1 1/2 wochen zum Technischen support geschickt wurde, Wo ich eigentlich Schon lange sein sollte, aber mir niemand Half dort hin zu gelangen (weil die supporter den Technischen supportern bescheid sagen, und die das dann übernehmen) Aber dann nach 3 Wochen Kam die Gloreiche erlösung, League of legends hatt sich selbst Repariert, Bzw. es hatt auf einmal wieder gefuntzt, der support bringt rein garnichts und ...\n\n\nDir ist aber bewusst, dass eigentlich jeder Support von größeren unternehmen mit Textbausteinen arbeitet?\nWas mir in meinem Supporterdasein aufgefallen ist, ist der Trend bei Kunden alles erst  einmal haarklein zu erzählen und auszuführen, bis sie zu dem, für mich eigentlich wichtigen Teil, Problem kommen.\nWenn man ein Ticket nun aber so aufbaut, dass man kurz und prägnant sein Problem mitteilt (z.B. \"mein Windows-Client des Spiels stürzt immer nach der CS ab\") und danach noch kurz ausführt, auf welchem Betriebssystem und unter welchen Umständen das Problem auftritt, sowie, wenn durchgeführt, was Du alles zur Problembehebung unternommen hast, kommst Du deutlich schneller in die für das Problem zuständige Abteilung und Du bekommst deutlich schneller eine Antwort.\nEine riesige Wall of Text durchzulesen, wo man 5 Minuten braucht, um überhaupt zu dem Problem zu kommen, kann einfach kein Support aus Effizienzgründen leisten. Wenn täglich mehrere 100 bis 1000 Tickets ankommen, kann kein Supporter sich erst einmal 10 bis 15 Minuten mit Deinem Ticket auseinandersetzen. Wenn nicht direkt im ersten Satz Dein Problem ersichtlich ist, wird der Text kurz überflogen und die Antwort geschickt, die nach Einschätzung des Supporters am ehesten zu dem passt, was er beim drüberfliegen als Problem gefunden hat. Ist nicht verwerflich sondern hat mit Effizienz zu tun.\n\n> ... is auch bei Report kaum Bis Garnicht vorhanden (habe 500 Stunden spielzeit) und habe bei ca. sagen wir mal 60 Reports Nur 5 mal die meldung bekommen das der Eine für sein schlechtes verhalten bekommen hat! \n\n\nNur so zur Info: das Reportsystem funktioniert vollkommen autonom und wird vom Support in keiner Weise betreut. Die Antworten, die Du sporadisch bekommst, sind von RIOT so selten eingestellt. Daran die Qualität des Supports messen zu wollen ist schlicht und ergreifend nicht möglich.\n\n> Fazit: Google ist dein freund, weil Riot trotz Langem Supporting es nicht Gebacken Bekommt\n> (Naja, dazu muss ich aber noch hinzufügen das es doch schon eine hand voll nette Supporter gibt die dir gerne helfen) {{sticker:slayer-jinx-wink}}\n\nJap, bei vielen Problemen hilft Google oder die Community in dem Forum.  Aber teilweise liegt das subjektive Empfinden, dass der Support schlecht ist, auch bei dem Spieler, der in seinem Ticket statt sein Problem direkt am Anfang ganz klar zu benennen erst einmal groß und breit erklärt warum das Problem so nervig ist und eine riesige Wall of Text schreibt.","replies":[{"poster":"Sirrkas","date":"2018-03-08T12:06:04.857+0000","up_votes":1,"down_votes":0,"body":"Ich weiß zwar nicht, warum du auf einen 8 Monate alten Thread geantwortet hast. Der Teil hier:\n\n>Aber teilweise liegt das subjektive Empfinden, dass der Support schlecht ist, auch bei dem Spieler, der in seinem Ticket statt sein Problem direkt am Anfang ganz klar zu benennen erst einmal groß und breit erklärt warum das Problem so nervig ist und eine riesige Wall of Text schreibt.\n\nKönnte fast genau so, für Threads im Spielerverhalten zu Banns verwendet werden. Bei dem statt dem Chatlog erst mal eine Din A4 Seite Erläuterungen kommen, warum man flamen musste.","replies":[{"poster":"Darkr3sQ","date":"2018-03-08T12:12:22.943+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=7hciEY9w,discussion-id=ZukHJ4gw,comment-id=000200000000,timestamp=2018-03-08T12:06:04.857+0000)\n>\n> Ich weiß zwar nicht, warum du auf einen 8 Monate alten Thread geantwortet hast. Der Teil hier:\n> \n> Könnte fast genau so, für Threads im Spielerverhalten zu Banns verwendet werden. Bei dem statt dem Chatlog erst mal eine Din A4 Seite Erläuterungen kommen, warum man flamen musste.\n\nNaja, durch ProfessorHodor, der auf den Thread geantwortet hatte, wurde er mir oben in meiner Liste angezeigt, und ich habe halt den Fehler gemacht, nicht darauf zu achten, wann das alles geschrieben wurde.\nMea Culpa.\n\nAber jap, das kann man auf fast alles anwenden ;)","replies":[{"poster":"Sirrkas","date":"2018-03-08T12:54:45.236+0000","up_votes":1,"down_votes":0,"body":"Den Post habe ich danach auch noch gesehen^^","replies":[]}]}]}]}]},{"poster":"legofreak1","date":"2017-07-11T16:36:53.015+0000","up_votes":1,"down_votes":0,"body":"Der Support von Riot Games, wie wahrscheinlich andere Supports auch, verwendet aus mehreren Gründen vorgefertigte Textbausteine in seinen Supporttickets. Damit lässt sich die Antwortzeit deutlich reduzieren, die Antworten sind konsistent untereinander und sobald man einmal ein gute Antwort hat, kann man diese wiederverwenden. Ein Großteil der Supporttickets wird mit diesen Antworten bereits ausreichend beantwortet, eine weitere Antwort ist dann meistens persönlicher. Dies geht sogar so weit, dass für den Accountrecovery-Prozess nahezu vollständig ein Bot eingesetzt werden kann.\nWürde jedes Ticket einzeln und persönlich beantwortet, dann dauert die Bearbeitung eines Tickets anstatt 1-2 Minuten schonmal 10-15, also mindestens 5 mal so lange. Um das zu kompensieren, müssen mehr Leute eingestellt werden oder die Qualität geht massiv nach unten. Dazu kommt, dass man in persönlichen Antworten auch schonmal einzelne Sachen vergisst, welche dann erneuter Klarstellung bedürfen.\nUm Spielern hier im Forum zu helfen verwende ich für die gängigsten Problemen und Antworten ebenfalls Makros, welche mir einen guten Teil des Tippens und Formatierens meines Posts abnehmen. Für diesen Text habe ich nun mehrere Minuten benötigt und ich vermute, dass du hierauf mit weiteren Fragen antworten wirst. Ein ähnlich langer Text zur Fehlerbehebung geht in etwa in einer Minute, weil ich die dafür passenden Stellen vorgefertigt habe. Danach erwarte ich dann meist nur weitere Logdateien oder Informationen, welche ich in meinem Post angefragt habe. Nachfragen kommen eher selten vor, da ich auf Stellen, die unklar waren, meist bereits vorher aufmerksam gemacht wurde und diese daraufhin in meiner Vorlage angepasst habe.\nIch denke, du siehst, dass vorgefertigte Antworten nicht unbedingt etwas schlechtes sind, sondern allgemein nützlich und sogar die Qualität des Supports verbessern können.","replies":[{"poster":"xDaRex","date":"2017-07-13T11:46:03.424+0000","up_votes":1,"down_votes":1,"body":"Ja ich verstehe das die einzelnen Supporter natürlich keine Schuld trift und das sie so vorgehen müssen,\naber das ganze System ist irgendwie nicht so gut für beide Seiten leider.\n\nMal was anderes ich rate euch nicht soviel im Spiel zu schreiben, ratet mal was passiert wenn ihr in einem ungefähr 30 Minuten langem Spiel ungefähr 65 mal was schreibt ohne beleidigung. Ihr kriegt eine Chatsperre für Spam xD Also am besten garnicht mehr schreiben ingame.\n\n","replies":[{"poster":"Darkr3sQ","date":"2018-03-08T11:38:09.086+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xDaRex,realm=EUW,application-id=7hciEY9w,discussion-id=ZukHJ4gw,comment-id=00030000,timestamp=2017-07-13T11:46:03.424+0000)\n>\n> Ja ich verstehe das die einzelnen Supporter natürlich keine Schuld trift und das sie so vorgehen müssen,\n> aber das ganze System ist irgendwie nicht so gut für beide Seiten leider.\n> \n\nVorgefertigte Antworten, wie Legofreak1 schon ausführlich erläuterte, sind bei so ziemlich allen größeren Supports vorgefertigte Antworten Gang und gebe.\nWas mir in meinem Supporterdasein häufig auffällt ist, dass Kunden offenbar der Meinung sind, alles bis in kleinste Detail erklären zu müssen bis sie überhaupt zu ihrer eigentlichen Frage kommen. Kein Supporter kann sich eine riesige Wall of Test durchlesen, bei der so ziemlich am Ende dann das eigentliche Problem erklärt wird.\nWenn man kurz und prägnant erst einmal mitteilt, welches Problem man hat, dann kann auch der Supporter direkt eine auf Deine Frage angepasste Antwort zuschicken. Und glaube mir: wenn ich für das Durchlesen des Tickets erst einmal 5 Minuten brauche bis ich zum eigentlichen Problem komme, wird nur kurz überflogen was das Problem sein könnte, und dann wird ein entsprechender Textbaustein als Antwort geschickt. Das hat nichts mit schlechter Support oder so zu tun, sondern ist bei der Menge der Tickets, die jeden Tag reinkommen nicht anders möglich.\n\n\n> Mal was anderes ich rate euch nicht soviel im Spiel zu schreiben, ratet mal was passiert wenn ihr in einem ungefähr 30 Minuten langem Spiel ungefähr 65 mal was schreibt ohne beleidigung. Ihr kriegt eine Chatsperre für Spam xD Also am besten garnicht mehr schreiben ingame.\n\nHierzu hätte ich gerne den Chatlog als Beleg.","replies":[]}]}]},{"poster":"Evil Hai","date":"2017-07-11T14:46:55.496+0000","up_votes":1,"down_votes":0,"body":"Sie Supporten dich schon normal wenn sie etwas nicht als Copy Paste haben , weil würden immer die selbe fragen anders beantworten wäre das zu viel unnötige Zeit Verschwendung.","replies":[]},{"poster":"LosMichus","date":"2017-07-11T14:30:59.387+0000","up_votes":1,"down_votes":1,"body":"Es ist halt bekannt, dass sich Riot nicht so gut um die Spieler kümmert. Nur wenn es in LCS/LCK entdeckt wird, wird sic darum gekümmert...","replies":[{"poster":"xDaRex","date":"2017-07-11T14:36:32.834+0000","up_votes":1,"down_votes":0,"body":"Das ist ziemlich traurig das ein so großes Unternehmen wie Riot es nicht hinkriegt einen ordentlichen Support zu haben. Es gibt nur das Ticket System und dann wird sich nichtmal darum gekümmert sondern nur eine vorgefertigte antwort gegeben auch wenn es keinen Sinn mit der Frage ergibt. Ich muss ehrlich sagen das ich jetzt sogar nach dem Ticket noch mehr angepisst bin auf Riot.\nWürde es denn was bringen wenn ich auf englisch geschrieben hätte? Weil es wird einem ja nicht gesagt ob man in englisch oder deutsch schreiben kann, also habe ich in deutsch geschrieben.","replies":[{"poster":"ProfessorHodor","date":"2018-03-07T03:59:01.589+0000","up_votes":1,"down_votes":1,"body":"Q.E.D.","replies":[]}]}]}]}