{"poster":"ComJohnShepard","date":"2017-08-23T23:13:44.571+0000","title":"La linea sottile che divide gli sfottò ed i comportamenti antisportivi ?","subforum":"Discussioni generali","up_votes":4,"down_votes":5,"body":"Mi chiedevo,se un giocatore che spamma risate e mastery,meriti davvero una segnalazione e conseguenti provvedimenti per condotta anti sportiva,oppure possa essere considerato un semplice modo per scherzare con gli avversari.\r\nSono entrambi strumenti messi a disposizione dalla Riot ,quindi suppongo  che siamo liberi di usarli come e quando vogliamo(il che praticamente &egrave; possibile,perch&egrave; non c&#039;&egrave; un limite allo spam come nel caso dei ping e nemmeno &egrave; consentito mutare ed ignorare entrambe le cose).\r\nOra se andiamo a volgere i nostri sguardi altrove,possiamo trovare molte discipline dove di sfott&ograve; e prese in giro soft se ne vedono spesso e nessuno si &egrave; mai lamentato.\r\nIn questo E-Sport,come in altri,oltre alle capacit&agrave; tecniche ed alle conoscenze &egrave; anche RICHIESTA UNA TENUTA PSICOLOGICA CHE NON SIA QUELLA DI UN CRICETO,il che non significa che si devono sopportare offese o mancanze di rispetto,ma nemmeno si pu&ograve; condannare ogni giocatore che &egrave; un giocherellone e si diverte senza scrivere nulla in chat.\r\nLa Riot dovrebbe definire molto bene questi argomenti,che tra l&#039;altro ho anche chiesto al supporto tramite ticket,e la risposta molto chiara &egrave; stata :\r\n&quot;Le maestrie o la risata del campione sono funzionalit&agrave; introdotte, pertanto utilizzarle o meno non comporta alcun tipo di problema. Il consiglio &egrave; per&ograve; di non abusarne&quot;.\r\nQuindi te le mettono a disposizione,non rischi nulla PERO TI CONSIGLIANO DI NON ABUSARNE, perch&egrave; probabilmente rischi di essere bannato lo stesso,se nella chat log di qualche game hai scritto esclamazioni come &quot;fuck,shit&quot;(rivolte verso il nulla,semplici esclamazioni),il sistema ti punir&agrave;!\r\n\r\nMi sento abbastanza confuso riguardo questo argomento,e voi bella gente cosa ne pensate?","replies":[{"poster":"ComJohnShepard","date":"2017-08-24T13:53:42.411+0000","up_votes":2,"down_votes":2,"body":"Purtroppo in altre discussioni,tipo in una dove si discuteva se è giusto reportare chi dice \"Ez\", ho letto una quantità di commenti a favore del report per chi spamma risate e mastery imabarazzante ragazzi.\nLeague of rosiconi che non sanno perdere","replies":[{"poster":"Floppyz","date":"2017-08-24T14:57:30.024+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ComJohnShepard,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=0005,timestamp=2017-08-24T13:53:42.411+0000)\n>\n> Purtroppo in altre discussioni,tipo in una dove si discuteva se è giusto reportare chi dice &quot;Ez&quot;, ho letto una quantità di commenti ~~a favore del report per~~ di chi spamma risate e mastery imabarazzante ragazzi.\n> League of ~~rosiconi ~~ maleducati che non sanno ~~perdere~~ vincere\n\nFixed.","replies":[{"poster":"ComJohnShepard","date":"2017-08-24T15:10:03.796+0000","up_votes":1,"down_votes":0,"body":"Non volevo essere offensivo, la prossima volta userò un altro termine sorry.","replies":[{"poster":"Floppyz","date":"2017-08-24T15:14:52.391+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=ComJohnShepard,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=000500000000,timestamp=2017-08-24T15:10:03.796+0000)\n>\n> Non volevo essere offensivo, la prossima volta userò un altro termine sorry.\n\nNon volevo dire che sei stato offensivo, volevo solo dire che, anche se io, personalmente, non segnalerei un giocatore perché mi spamma mastery, risate e roba varia, quello non è comunque un comportamento sportivo.\n\n\n\nP.S.\n\nMi sembrava ci fosse già un topic che parlava di questi discorsi... La prossima volta per favore continua lì, che è un peccato avere la stessa discussione divisa su due topic (oltre al fatto che si generano commenti dindondanti).","replies":[{"poster":"ComJohnShepard","date":"2017-08-24T15:22:04.598+0000","up_votes":1,"down_votes":1,"body":"Ma allora,la Riot non dovrebbe definire con PRECISIONE E CHIAREZZA, questi termini?\nMi spiego, loro mi danno questi strumenti, a cosa servono? E se non mi limitano nell'utilizzo perchè devo rischiare un ban semplicemente usando i loro strumenti? \nSul codice di condotta si parla di comportamento antisportivo e tante belle parole, ma non si specifica su alcuni argomenti ambigui tipo questo ad esempio.\nVorrei solo una cavolo di regola ben definita,nella vita reale esistono le leggi di fronte alle quali l'ignoranza non è una giustificazione, qui invece questa ambiguità porta come risultato la chiusura ingiusta di molti account,il che conviene tantissimo alla Riot.\nReputo molto diseducativa questa politica,che non fa altro che sfornare low elo players capaci solo di lamentarsi per i propri team e di sfogarsi segnalando avversari piu bravi invece di guardarsi il bellissimo ed utilissimo replay per capire come non incappare lo stesso in quella sitazione...MA NO!\nMeglio segnalare ogni player che respira ed avere 800 game in silver gg","replies":[{"poster":"Laiho88","date":"2017-08-24T15:32:25.098+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=ComJohnShepard,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=00050000000000000001,timestamp=2017-08-24T15:22:04.598+0000)\n>\n> Ma allora,la Riot non dovrebbe definire con PRECISIONE E CHIAREZZA, questi termini?\n> Mi spiego, loro mi danno questi strumenti, a cosa servono? E se non mi limitano nell&#x27;utilizzo perchè devo rischiare un ban semplicemente usando i loro strumenti? \n> Sul codice di condotta si parla di comportamento antisportivo e tante belle parole, ma non si specifica su alcuni argomenti ambigui tipo questo ad esempio.\n> Vorrei solo una cavolo di regola ben definita,nella vita reale esistono le leggi di fronte alle quali l&#x27;ignoranza non è una giustificazione, qui invece questa ambiguità porta come risultato la chiusura ingiusta di molti account,il che conviene tantissimo alla Riot.\n> Reputo molto diseducativa questa politica,che non fa altro che sfornare low elo players capaci solo di lamentarsi per i propri team e di sfogarsi segnalando avversari piu bravi invece di guardarsi il bellissimo ed utilissimo replay per capire come non incappare lo stesso in quella sitazione...MA NO!\n> Meglio segnalare ogni player che respira ed avere 800 game in silver gg\n\n1) Loro ti danno gli strumenti per un uso ottimale degli stessi, sei tu che dovresti essere abbastanza intelligente da capire ciò che è giusto o sbagliato (non è che perché si vendono coltelli hai il diritto di andare in giro ad accoltellare persone)\n\n2) hai detto che vuoi delle leggi dove l'ignoranza non sia una giustificazione beh, basta farsi guidare dal buon senso e non invece cercare la scappatoia per comportarsi male senza essere puniti (infatti nel nostro ordinamento le leggi sono astratte, non è possibile prevedere ogni fattispecie reale e quindi sono soggette ad interpretazione nel momento in cui vengono applicate a fatti concreti)\n\n3) Se hai bisogno di avere una lista per iscritto di cosa puoi e non puoi fare verso altri giocatori ti consiglio di rivedere la tua educazione, qualunque persona educata a dovere SA BENISSIMO qual'è il comportamento da tenere verso gli altri.","replies":[{"poster":"ComJohnShepard","date":"2017-08-24T15:52:18.638+0000","up_votes":2,"down_votes":1,"body":"Chiaramente non mi serve una lista di parole da poter o non poter usare grazie,ma vorrei solo una spiegazione piu chiara sull utilizzo di alcuni strumenti tutto qui,apprezzo il tuo consiglio di rivedere la mia educazione ma grazie a dio i miei genitori hanno fatto un bel lavoro :)\nTi prego inoltre di non darmi piu consigli sulla mia vita personale,si parla del gioco,non della nostra educazione,tale argomento esula dai tuoi campi di competenza, mi sento abusato verbalmente ed umiliato.\nForse dovresti evitare di superare alcuni confini solo perchè siamo dentro uno schermo non credi?","replies":[{"poster":"Laiho88","date":"2017-08-24T16:03:48.711+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=ComJohnShepard,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=0005000000000000000100000000,timestamp=2017-08-24T15:52:18.638+0000)\n>\n> Chiaramente non mi serve una lista di parole da poter o non poter usare grazie,ma vorrei solo una spiegazione piu chiara sull utilizzo di alcuni strumenti tutto qui,apprezzo il tuo consiglio di rivedere la mia educazione ma grazie a dio i miei genitori hanno fatto un bel lavoro :)\n> Ti prego inoltre di non darmi piu consigli sulla mia vita personale,si parla del gioco,non della nostra educazione,tale argomento esula dai tuoi campi di competenza, mi sento abusato verbalmente ed umiliato.\n> Forse dovresti evitare di superare alcuni confini solo perchè siamo dentro uno schermo non credi?\n\nSe non riesci a capire che determinati atteggiamenti possono risultare fastidiosi nei confronti di altri giocatori fatti due domande.\nPS: stai tranquillo che , come Ciak può confermare, nonostante sia dietro uno schermo mi sto trattenendo parecchio.","replies":[{"poster":"ComJohnShepard","date":"2017-08-24T16:13:30.631+0000","up_votes":2,"down_votes":1,"body":"Se ad alcuni giocatori danno fastidio delle cose cosi blande,tanto per dare un colpo alla botte ed una al cerchio,non è che magari hanno problemi di autostima o cose del genere?\nQuindi assunto che magari un giocatore ha dei problemi personali, è giusto che io debba limitarmi a causa della sua condizione di fragilità?\nInsomma la verità è nel mezzo dai, non è che per ogni cosa che da fastidio si deve sempre fare un dramma.\n\nPS : abbiamo entrambi 30 anni circa, non dovresti sentire nessun impulso che ti spinge a trattenerti sai, siamo in un mondo virtuale e non ci conosciamo,anche io fossi in te me le farei 2 domande ;)","replies":[{"poster":"Laiho88","date":"2017-08-24T16:21:40.064+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ComJohnShepard,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=000500000000000000010000000000000000,timestamp=2017-08-24T16:13:30.631+0000)\n>\n> Se ad alcuni giocatori danno fastidio delle cose cosi blande,tanto per dare un colpo alla botte ed una al cerchio,non è che magari hanno problemi di autostima o cose del genere?\n> Quindi assunto che magari un giocatore ha dei problemi personali, è giusto che io debba limitarmi a causa della sua condizione di fragilità?\n> Insomma la verità è nel mezzo dai, non è che per ogni cosa che da fastidio si deve sempre fare un dramma.\n> \n> PS : abbiamo entrambi 30 anni circa, non dovresti sentire nessun impulso che ti spinge a trattenerti sai, siamo in un mondo virtuale e non ci conosciamo,anche io fossi in te me le farei 2 domande ;)\n\nGuarda, la proprio libertà termina nel momento in cui comincia quella degli altri, alla fine sai che lo fai per dispetto, se continui sapendo che all altro da fastidio ma a te diverte una cosa così infantile, forse due domande dovreste fartele anche tu....\nPraticamente l'hai messa in questo modo: siccome non è punibile io lo faccio e affari loro se da fastidio, perfetto....\n\nTi faccio un altro esempio: io suono metal, se abitassi affianco casa tua potrei tranquillamente mettermi dalle 3 del pomeriggio fino a mezzanotte precisa a fare bordello a volume sparato (entro i limiti di tollerabilità che, fidati, sono parecchio alti e difficilmente sopportabili da chi abita affianco, te lo dico per esperienza), a te potrebbe anche dar fastidio ma io me ne sbatterei tranquillamente i cosiddetti perché tanto sarebbe un problema tuo, io rientrando totalmente nei limiti di legge non verrei cmq punito. Sembra un esempio un pò estremo ma alla fine il succo del discorso è lo stesso: 0 rispetto per l'altro.","replies":[{"poster":"Diyoza","date":"2017-08-24T16:31:47.623+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Laiho88,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=0005000000000000000100000000000000000000,timestamp=2017-08-24T16:21:40.064+0000)\n>\n> Guarda, la proprio libertà termina nel momento in cui comincia quella degli altri, alla fine sai che lo fai per dispetto, se continui sapendo che all altro da fastidio ma a te diverte una cosa così infantile, forse due domande dovreste fartele anche tu....\n> Praticamente l&#x27;hai messa in questo modo: siccome non è punibile io lo faccio e affari loro se da fastidio, perfetto....\n> \n> Ti faccio un altro esempio: io suono metal, se abitassi affianco casa tua potrei tranquillamente mettermi dalle 3 del pomeriggio fino a mezzanotte precisa a fare bordello a volume sparato (entro i limiti di tollerabilità che, fidati, sono parecchio alti e difficilmente sopportabili da chi abita affianco, te lo dico per esperienza), a te potrebbe anche dar fastidio ma io me ne sbatterei tranquillamente i cosiddetti perché tanto sarebbe un problema tuo, io rientrando totalmente nei limiti di legge non verrei cmq punito. Sembra un esempio un pò estremo ma alla fine il succo del discorso è lo stesso: 0 rispetto per l&#x27;altro.\n\ncome dice Se6SaltySali la mastery si può mutare, il tuo strumento no... XD cioè se c'è un abuso della mastery e il giocatore si ritiene offeso esso reporta e la riot giudicherà , andate in pace <3","replies":[{"poster":"Laiho88","date":"2017-08-24T16:36:18.929+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=QuietCode,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=00050000000000000001000000000000000000000000,timestamp=2017-08-24T16:31:47.623+0000)\n>\n> come dice Se6SaltySali la mastery si può mutare, il tuo strumento no... XD cioè se c&#x27;è un abuso della mastery e il giocatore si ritiene offeso esso reporta e la riot giudicherà , andate in pace &lt;3\n\nCerto che si può, basta mettere tripli vetri e ti chiudi dentro ;)","replies":[{"poster":"Diyoza","date":"2017-08-24T16:39:04.804+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Laiho88,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=000500000000000000010000000000000000000000000000,timestamp=2017-08-24T16:36:18.929+0000)\n>\n> Certo che si può, basta mettere tripli vetri e ti chiudi dentro ;)\n\nmi dispiace ma il triplo vetro ha un isolamento solo di tipo termico <_<","replies":[{"poster":"Floppyz","date":"2017-08-24T17:36:30.092+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=QuietCode,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=00050000000000000001000000000000000000000000000000000004,timestamp=2017-08-24T17:34:12.893+0000)\n>\n> problema tuo, ignora giusto no? e cerca di leccare il culo di meno.\n> \n> stammi bene. :)\n\nQuietCode, non ci allarghiamo. Anche se i toni si sono un po' accesi la discussione è ancora sui binari, cerchiamo di non farla deragliare, che sennò poi ci scappa il ferito.","replies":[]},{"poster":"ComJohnShepard","date":"2017-08-24T16:43:15.219+0000","up_votes":3,"down_votes":0,"body":"niente battute,potrebbe esserci un vetraio qui che si offende...che mondo insensibile","replies":[]},{"poster":"Floppyz","date":"2017-08-24T17:47:41.796+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=QuietCode,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=00050000000000000001000000000000000000000000000000000006,timestamp=2017-08-24T17:38:16.957+0000)\n>\n> sse altri utenti si allargano, io lo faccio pure eccome, mi dispiace ciack, se vuoi far scappare il ferito fallo.\n\nNo, se a tuo avviso altri utenti si allargano tu (se credi) li segnali con l'apposita funzione, ma non rispondi in quella maniera. Qui non ci si fa _giustizia_ da soli e non voglio tornare sul discorso. Fine dell'OT.","replies":[]},{"poster":"Diyoza","date":"2017-08-24T16:46:44.754+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Laiho88,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=00050000000000000001000000000000000000000000000000000000,timestamp=2017-08-24T16:41:08.680+0000)\n>\n> era una battuta....\n\nlo so ti ho risposto in modo ironico, se devi fare battute falle serie e coerenti XD cmq basta altrimenti andiamo OT  e ciack ci annienta tutti","replies":[]},{"poster":"Laiho88","date":"2017-08-24T17:06:49.257+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=QuietCode,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=00050000000000000001000000000000000000000000000000000002,timestamp=2017-08-24T16:46:44.754+0000)\n>\n> lo so ti ho risposto in modo ironico, se devi fare battute falle serie e coerenti XD cmq basta altrimenti andiamo OT  e ciack ci annienta tutti\n\nTanto lo abbiamo capito tutti che ti attacchi alle piccolezze per cercare in qualche modo di \"sopraffare\" l'altro....ti ho dato già troppe attenzioni quindi adesso vado, mi raccomando continua pure nel tuo atteggiamento e spera davvero che non sia punibile.\nStammi bene.","replies":[]},{"poster":"Laiho88","date":"2017-08-24T16:41:08.680+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=QuietCode,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=0005000000000000000100000000000000000000000000000000,timestamp=2017-08-24T16:39:04.804+0000)\n>\n> mi dispiace ma il triplo vetro ha un isolamento solo di tipo termico &lt;_&lt;\n\nera una battuta....","replies":[]},{"poster":"Diyoza","date":"2017-08-24T17:38:16.957+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Ciack,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=00050000000000000001000000000000000000000000000000000005,timestamp=2017-08-24T17:36:30.092+0000)\n>\n> QuietCode, non ci allarghiamo. Anche se i toni si sono un po&#x27; accesi la discussione è ancora sui binari, cerchiamo di non farla deragliare, che sennò poi ci scappa il ferito.\n\nsse altri utenti si allargano, io lo faccio pure eccome, mi dispiace ciack, se vuoi far scappare il ferito fallo.","replies":[]},{"poster":"Diyoza","date":"2017-08-24T17:34:12.893+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Laiho88,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=00050000000000000001000000000000000000000000000000000003,timestamp=2017-08-24T17:06:49.257+0000)\n>\n> Tanto lo abbiamo capito tutti che ti attacchi alle piccolezze per cercare in qualche modo di &quot;sopraffare&quot; l&#x27;altro....ti ho dato già troppe attenzioni quindi adesso vado, mi raccomando continua pure nel tuo atteggiamento e spera davvero che non sia punibile.\n> Stammi bene.\n\nproblema tuo, ignora giusto no? e cerca di leccare il culo di meno.\n\nstammi bene. :)","replies":[]}]}]}]},{"poster":"ComJohnShepard","date":"2017-08-24T16:32:59.038+0000","up_votes":1,"down_votes":1,"body":"Esatto!!! Se non è punibile io lo faccio e se ti da fastidio non mi interessa,non posso farmi il problema per ogni cosa che da fastidio agli altri (qualora si parli di cose demenziali tipo mastery e risate,non di cose serie sia chiaro sono una persona molto rispettosa anche se non lo sembro da queste conversazioni).\n\nPer quanto riguarda l'inquinamento acustico, ci sono le regole e gli orari condominiali,basta rispettare quelli e se a qualcuno non stanno bene che cambi casa o quartiere o giurisdizione e vada in un posto con leggi e regole di suo gradimento.\nSe poi tu sei cosi buono e bravo da andare incontro a quel cristiano,tanto di cappello per il gesto nobile,ma se non lo fai non stai sbagliando,ti stai solo attenendo ad un codice che serve per vivere bene in una comunità,quindi se un buon cittadino anche se il tuo vicino impazzisce.\nAl massimo mandalo da un analista","replies":[]}]}]}]}]}]},{"poster":"Floppyz","date":"2017-08-24T15:35:21.000+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ComJohnShepard,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=00050000000000000001,timestamp=2017-08-24T15:22:04.598+0000)\n>\n> Ma allora,la Riot non dovrebbe definire con PRECISIONE E CHIAREZZA, questi termini?\n\nNon è che si può fare una lista di tutte le parole del vocabolario e le possibili frasi che sono considerate inappropriate... Ma credo non sia neanche così complicato capire cosa non è sportivo. Siamo sinceri: secondo te è sportivo scrivere _ez_ ai nemici alla fine della partita? Se la risposta è noi, sai già da te che non devi farlo, senza dover spulciare un regolamento.\n\n> Mi spiego, loro mi danno questi strumenti, a cosa servono? E se non mi limitano nell&#x27;utilizzo perchè devo rischiare un ban semplicemente usando i loro strumenti? \n\nPremesso che non credo (ma non ne sono sicuro eh) che siano previste punizioni per l'abuso di emote, il tuo non è un discorso valido: Riot ti da anche una chat, ma pure con quella, se usata impropriamente rischi un ban. Il cartolaio ti può vendere un paio di forbici, ma se ci tagli i capelli alle bambole della vicina di casa, senza il suo permesso, non è che te la puoi prendere col cartolaio che te le ha vendute.\n\n> Sul codice di condotta si parla di comportamento antisportivo e tante belle parole, ma non si specifica su alcuni argomenti ambigui tipo questo ad esempio.\n> Vorrei solo una cavolo di regola ben definita,nella vita reale esistono le leggi di fronte alle quali l&#x27;ignoranza non è una giustificazione\n\nLe regole, in quanto tali, non prevedono mai casi specifici, ma li fanno rientrare in definizioni più ampie, a me però sembra abbastanza chiaro il codice di condotta. Se poi hai il dubbio ti basta pensare se qualcuno potrebbe ragionevolmente offendersi per quel che stai facendo, o anche solo al perché lo stai facendo. Se la risposta alla prima domanda è sì, o alla seconda è _per fare arrabbiare qualcuno._, è possibile che tu stia violando il regolamento.\n\n> qui invece questa ambiguità porta come risultato la chiusura ingiusta di molti account,il che conviene tantissimo alla Riot.\n\nNon credo di aver mai sentito di un permaban perché qualcuno usava un po' troppo le emote per fare arrabbiare i nemici, il fatto che sia fastidioso poi non mi sembra sia in discussione, ne convieni?\n\n> Reputo molto diseducativa questa politica,che non fa altro che sfornare low elo players capaci solo di lamentarsi per i propri team e di sfogarsi segnalando avversari piu bravi invece di guardarsi il bellissimo ed utilissimo replay per capire come non incappare lo stesso in quella sitazione...MA NO!\n\nIo invece reputo molto diseducativo(?) spammare un emote con l'unico scopo di fare arrabbiare un altra persona contro cui hai **giocato**. Non vuoi avere problemi? Comportati bene, è facile! Non te la puoi prendere con gli altri perché non accettano tuoi comportamenti negativi...\n\n> Meglio segnalare ogni player che respira ed avere 800 game in silver gg\n\nNon esiste alcun legame fra le due cose.","replies":[{"poster":"ComJohnShepard","date":"2017-08-24T16:03:36.213+0000","up_votes":1,"down_votes":0,"body":"Ciak il tuo discorso è molto ragionevole,la cosa su cui vorrei piu chiarezza è solo quella delle mastery e delle risate,per quanto riguarda offese ed abusi verbali non serve nemmeno parlarne.\nSe vieni reportato tante volte anche se non hai scritto nulla i rischi di incappare in una punizione aumentano e lo sappiamo entrambi,quindi puoi essere bannato con una facilità estrema.\nLo scopo non è fare arrabbiare l'avversario,ma inibirlo e metterlo in sudditanza psicologica durante la fase di lane,accostando un gameplay punitivo ed aggressivo insieme alle risate ed alle mastery.\nAllora Cassius Clay,uno dei piu grandi boxer della storia,era estremamente antisportivo?\nVorresti dirmi che lui,un atleta completo sotto ogni aspetto,solo perchè accostava la psicologia insieme alla tecnica era antisportivo?\nSe ti innervosisci per motivi cosi blandi,la colpa non è del tuo avversario ma della tua debolezza mentale.\n\nE si il legame c'è eccome,ho giocato in molti elo differenti e piu si va in low elo e piu partono i report verso chi ti stompa,perchè chi ha un buon  mind set ed è decente a giocare,invece di prendersela si concentra e si impegna,climbando.Un player in low elo non ci sta per vie delle sue basse abilità(anche perchè in low elo ci sono molti giocatori bravissimi tecnicamente), ma per la sua attitudine e la sua tenuta psicologica in game.","replies":[{"poster":"Floppyz","date":"2017-08-24T16:12:52.951+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ComJohnShepard,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=0005000000000000000100010000,timestamp=2017-08-24T16:03:36.213+0000)\n>\n> Ciak\n\n*Ciack\n\n> il tuo discorso è molto ragionevole,la cosa su cui vorrei piu chiarezza è solo quella delle mastery e delle risate,per quanto riguarda offese ed abusi verbali non serve nemmeno parlarne.\n\nA cosa ti serve una risposta certa? :)\n\n> Se vieni reportato tante volte anche se non hai scritto nulla i rischi di incappare in una punizione aumentano e lo sappiamo entrambi,quindi puoi essere bannato con una facilità estrema.\n\nSbagliato. Tutte le segnalazioni infondate non hanno alcun valore, e vengono ignorate dal sistema, fossero una o un milione.\n\n> Lo scopo non è fare arrabbiare l&#x27;avversario,ma inibirlo e metterlo in sudditanza psicologica durante la fase di lane,accostando un gameplay punitivo ed aggressivo insieme alle risate ed alle mastery.\n\nNon mi sembra un comportamento molto sportivo, a te sì? Hai mai guardato una partita di scacchi? Ti pare che si fanno le linguacce per distrarre l'avversario e quindi avvantaggiarsi con mezzucci, o si adoperano per batterlo con le loro capacità, su cui il gioco è stato progettato?\n\n> Allora Cassius Clay,uno dei piu grandi boxer della storia,era estremamente antisportivo?\n> Vorresti dirmi che lui,un atleta completo sotto ogni aspetto,solo perchè accostava la psicologia insieme alla tecnica era antisportivo?\n> Se ti innervosisci per motivi cosi blandi,la colpa non è del tuo avversario ma della tua debolezza mentale.\n\nSorry non seguo la boxe (è boxe, vero?) quindi risponderei a sproposito.\n\n> E si il legame c&#x27;è eccome,ho giocato in molti elo differenti e piu si va in low elo e piu partono i report verso chi ti stompa,perchè chi ha un buon  mind set ed è decente a giocare,invece di prendersela si concentra e si impegna,climbando.Un player in low elo non ci sta per vie delle sue basse abilità(anche perchè in low elo ci sono molti giocatori bravissimi tecnicamente), ma per la sua attitudine e la sua tenuta psicologica in game.\n\nTu comunque cerchi di sfruttare un aspetto che non è insito nel gioco, cerchi in pratica una scorciatoia o un exploit per avvantaggiarti sul tuo avversario, tramite qualcosa che non è la skill di gioco. È vero o no?","replies":[{"poster":"ComJohnShepard","date":"2017-08-24T16:24:46.592+0000","up_votes":2,"down_votes":0,"body":"Scusa per il nome non mi ero accorto di averlo digitato male !\n\nLa risposta certa mi serve perchè voglio usare correttamente i strumenti a mia disposizione senza incappare in sanzioni.\n\nOkay l'esempio degli scacchi regge tanto quanto il mio della boxe (ho fatto tornei di scacchi con la UISP per anni,ed anche li c'è il fattore psicologico che tu lo voglia o meno,solo che è piu sottile ed intelligente ed ovviamente non si fanno le pernacchie!)\n\nCassius Clay sul ring, abbassava la guardia, schivando i colpi senza pararsi,si metteva da solo alle corde e invitava l'avversario a colpirlo e sorrideva.Per voi è antisportivo,per me è parte del gioco, se sei stupido e sprechi il 30% delle tue energie al 3 round in un incontro che ne dura 12,non è certo colpa di Clay ma della tua mancanza di saggezza.(scusa se mi sono dilungato ma sono un appassionato).\n\nNon cerco un exploit per vincere,penso solo che mentre giochiamo top lane e non ti faccio farmare,mi piazzo davanti la wave e sto li fermo,ogni tanto rido e freezo,se vinco un trade alzo la mastery e anche quando ti killo.\nTi levo la vision e ti impedisco di fare qualunque cosa,do fastidio al tuo jungler ecc.\n\nL'aspetto psicologico è piu che insito nel gioco,non è una scorciatoia,ed in piu se il mio avversario è cosi fragile da essere urtato per mastery e risate,io sono già in vantaggio dal livello 1 per il mind set differente,quindi a quel punto sarebbe irrilevante :)\n\nEd infine spero che ti rendi conto,che se io sono piu bravo di te puoi ridermi in faccia quanto vuoi,al primo errore che fa ti ti castigo aspettando con pazienza,quindi come può un giocatore scarso vincere con questi ehm \"exploit\" ?","replies":[{"poster":"Floppyz","date":"2017-08-24T17:33:52.583+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ComJohnShepard,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=000500000000000000010001000000000000,timestamp=2017-08-24T16:24:46.592+0000)\n>\n> Scusa per il nome non mi ero accorto di averlo digitato male !\n\nFigùrati, tanto lo sbagliano tutti... Finché non si libera il **mio** nick me ne farò una ragione.\n\n> La risposta certa mi serve perchè voglio usare correttamente i strumenti a mia disposizione senza incappare in sanzioni.\n\nFacciamo così, anziché una risposta certa ti do un suggerimento che fa contenti tutti: certo che puoi usare le emote, ma essendo tu un adulto con un cervello penso sia in grado di capire quando si passa da uso ad abuso, con l'unico scopo di far arrabbiare un altro giocatore che vuole solo farsi una partita a un videogame. Ekko, quando hai il dubbio di superare quel limite, fermati.\n\n> Okay l&#x27;esempio degli scacchi regge tanto quanto il mio della boxe (ho fatto tornei di scacchi con la UISP per anni,ed anche li c&#x27;è il fattore psicologico che tu lo voglia o meno,solo che è piu sottile ed intelligente ed ovviamente non si fanno le pernacchie!)\n\nOk, allora facciamo che LOL è più simile agli scacchi (strategia, pianificazione, e via dicendo) che alla boxe (cazzottate, finte e via dicendo).\n\n> Cassius Clay sul ring, abbassava la guardia, schivando i colpi senza pararsi,si metteva da solo alle corde e invitava l&#x27;avversario a colpirlo e sorrideva.Per voi è antisportivo,per me è parte del gioco, se sei stupido e sprechi il 30% delle tue energie al 3 round in un incontro che ne dura 12,non è certo colpa di Clay ma della tua mancanza di saggezza.(scusa se mi sono dilungato ma sono un appassionato).\n\nCapisci però che un incontro professionale di boxe è diverso da spammare un emote su un videogame, magari contro un ragazzino che vuole solo rilassarsi... È la differenza fra cercare un vantaggio ammissibile in un ambiente professionale dove è visto come ammissibile, e **infierire contro uno sconosciuto** mentre ci **giochi** contro su un videogame **per passare il tempo o rilassarti**.\n\n> Non cerco un exploit per vincere,penso solo che mentre giochiamo top lane e non ti faccio farmare,mi piazzo davanti la wave e sto li fermo,ogni tanto rido e freezo,se vinco un trade alzo la mastery e anche quando ti killo.\n\nSe credi fallo, ma date le premesse che ho fatto sopra, a me non sembra un comportamento sportivo: se sei più bravo del tuo avversario puoi vincere anche senza, ciò posto, non sto dicendo che si debba essere crocifissi per uno sfottò, ci sono anche momenti in cui ci può stare, basta non esagerare.\n\nKillare lo Yasuo avversario che scappa con 1 hp quando entra nel bush in cui siete in 4 e scrivergli in chat ('na volta eh, non tutta la partita)\n\n_A wild Yasuo appears!_\n\ne\n\nspammare emote sopra il cadavere del (nostro Signore) Teemo avversario mentre si distrugge il nexus avversario\n\nsono due cose diverse, dal mio punto di vista.\n\n> Ti levo la vision e ti impedisco di fare qualunque cosa,do fastidio al tuo jungler ecc.\n\nQuello lo fai giocando: distruggere le ward o harassare un jungler è parte integrante del gioco, sono meccaniche di gioco. Spammare emote no, non c'entrano niente con le meccaniche di gioco: sono un di più, come le skin e i poro.\n\n> L&#x27;aspetto psicologico è piu che insito nel gioco,non è una scorciatoia,ed in piu se il mio avversario è cosi fragile da essere urtato per mastery e risate,io sono già in vantaggio dal livello 1 per il mind set differente,quindi a quel punto sarebbe irrilevante :)\n\nNon sono d'accordo, o meglio, visto che conosci gli scacchi ti faccio un paragone: un conto è fare certe giocate per intimidire l'avversario o indurlo in errore volutamente, un altro, come dicevo prima, è fargli delle pernacchie perché così lo metti in difficoltà; e di certo sai che gli scacchi sono un gioco anche più psicologico di LOL, però non ti sogneresti mai di fare le pernacchie all'avversario, magari durante un'amichevole con un ragazzino, giusto? Come mai?\n\n> Ed infine spero che ti rendi conto,che se io sono piu bravo di te puoi ridermi in faccia quanto vuoi,al primo errore che fa ti ti castigo aspettando con pazienza,quindi come può un giocatore scarso vincere con questi ehm &quot;exploit&quot; ?\n\nNon è questo il punto.\n\nSe posso permettermi di riprendere l'esempio di laiho (con cui raramente sono d'accordo), secondo la legge tu puoi suonare più o meno tutto il giorno (sì lo so che non è proprio così) fino ad un certo orario.\n\n_Ciao ragazzi! Prendete la vostra chitarra elettrica ed attaccatela allo stereo di papà a con l'impianto a 9000 gigawatt. Fatto? Bravi! Adesso, cominciate alle 9 di mattina a suonare ininterrottamente ad alto volume fino alle 10 di sera, con l'intenzione di farlo tutti i giorni. Mi raccomando, non fermatevi neanche per mangiare o andare in bagno, nel dubbio suonate seduti sul water._\n\n_Ffffatta? Bbbbravi!_\n\n_Ora, quando il vostro vicino di casa il giorno verrà a spiegarvi che ha un neonato e che dovrebbe dormire dalle 14 alle 16, chiedendovi di non suonare in quell'orario..._\n\n_1) ...Ditegli mandatelo a quel paese (mi raccomando, fatevi aiutare da un adulto!) e ridetegli in faccia dicendo che sono problemi suoi, perché la legge vi tutela!_\n\n_2) ...Mettete via le forbicine arrotondate (sia mai che vogliate dargli un'accorciatina alla vita) e assecondate il vostro vicino, per il bene dei rapporti di buon vicinato!_\n\n_Cccciao ragazzi, alla prossima!_\n\nCerto, è un esempio estremo, ma il principio, che credo volesse far risaltare laiho è esattamente lo stesso: rispettare gli altri nonostante le regole ti consentano di non farlo, oppure abusare delle regole per dar fastidio agli altri.","replies":[{"poster":"ComJohnShepard","date":"2017-08-24T18:41:55.835+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ciack,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=0005000000000000000100010000000000000001,timestamp=2017-08-24T17:33:52.583+0000)\n>\n> Figùrati, tanto lo sbagliano tutti... Finché non si libera il **mio** nick me ne farò una ragione.\n> Spero che il tuo nick si liberi in fretta allora good luck :D\n\n> Sinceramente non mi ritengo un individuo stupido,eppure fino a prima di leggere alcune discussioni su questo forum non avrei mai immaginato che qualcuno potesse prendersela cosi tanto per delle risate o delle emote,e questo è un mio limite in quanto raramente tendo a prendere le cose sul personale in ambiti come questo.\n\n> Molto vero\n\n\n> Questa è un ottima argomentazione,ma qui mi pongo un quesito : è rispettoso giocare partite classificate con il solo scopo di rilassarsi e di divertirsi? Non bisognerebbe essere competitivi al massimo e fare di tutto e di piu per vincere il game?\nNon sarebbe meglio fare delle normal o altre modalità o comunque dei giochi in cui il tuo operato non influenzi quello di tutta la squadra?\nNon è un altra forma di mancanza di rispetto nei confronti degli altri 4 quello di giocare le ranked a mò di \"mo me sparo na partita a flipper e sticavoli\"(per me è negative attitude )\n\n\n> Certamente si può vincere anche senza,ma ora ti sfido a non spammare la risata di ziggs annie o nami,o di altri campioni molto fastidiosi..io lo trovo estremamente divertente anche quando lo fanno gli altri !\n\n\n> Vero,non l'avevo mai considerata sotto questo aspetto.\nPerò se un giocatore tilta perchè viene camperato,o perchè non gli viene concesso il farm,cosa dovremmo fare?\nNon è antisportivo rovinare l'esperienza di un top laner che dopo essere appena respawnato ed aver usato flash,si trova il jungler che lo intercetta insieme al nemico prima che torni in torre?\nLa differenza sta solo sul fatto che questi sono playstyle,quella è un emote..ma il problema è sempre di chi tilta suppongo non di chi gioca per vincere e non flamma!\n\n\n> Pernacchie no,ma sorridere tutto il tempo ed annuire lievemente quando l'avversario fa delle mosse lasciandogli intendere che l'avevi calcolato,e mostrarti pienamente padrone della situazione,sono tutti fattori psicologici che esulano dalle meccaniche di gioco ma che hanno un impatto notevole sul risultato della competizione se l'avversario ha una mente fragile.\nNessuno si è \n\n\n> Invece in parte penso lo sia,perchè è la dimostrazione che una persona con un pochino di resistenza mentale,non subisce nessun effetto negativo da mastery e risate,perchè è una persona sana che non prende troppo male queste sottigliezze :)\n\nSemmai un giocatore dovesse essere cosi poco arrogante ed umile,da chiedermi di smettere di spammare queste cavolate lo farei all'istante.\nMa chissà perchè nessuno lo chiede,le persone si arrabbiano e basta e ti reportano per sfogarsi.\nChi è veramente  tossico in questa situazione?\nPer me quello che perde la testa in tutta onestà..\n\nP.s. invece di fare le emote e le risate dovrei imparare ad usare i forum...il mio tallone d'achille!\nScusa ho fatto un po di disordine nella risposta ma ogni punto è una risposta ai punti da te sopra citati.","replies":[{"poster":"Floppyz","date":"2017-08-24T19:16:31.474+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=ComJohnShepard,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=00050000000000000001000100000000000000010000,timestamp=2017-08-24T18:41:55.835+0000)\n>\n\n> è rispettoso giocare partite classificate con il solo scopo di rilassarsi e di divertirsi?\n\nSi può giocare per vincere anche rilassandosi (vabbè non troppo) e divertendosi, se diventa solo un impegno allora non è più un gioco, ma un lavoro. Io se vado (arivabbè, _andavo_) a giocare a calcio coi miei amici ovviamente cerco di vincere, e anche se ci sono persone che lo fanno, non mi passerebbe neanche per la testa di prendere in giro gli avversari o magari farmi tutta la partita in panchina perché è più importante vincere, e non me la farei manco se giocassi in FIGC, a meno di essere in serie A, però vedi, a quel punto sarebbe un lavoro, e siamo disposti a fare dei sacrifici per il lavoro, ma non per una ranked di LOL (in generale).\n\n> Non bisognerebbe essere competitivi al massimo e fare di tutto e di piu per vincere il game?\n\nCerto, ma ci sono dei limiti di decenza.\n\n> Non sarebbe meglio fare delle normal o altre modalità o comunque dei giochi in cui il tuo operato non influenzi quello di tutta la squadra?\n\nSe non vuoi giocare competitivamente, quindi magari vuoi allenarti, provare delle build, o semplicemente non impegnarti troppo sì, ma questi sono i casi; scendere a patti con la propria coscienza pur di vincere mi sembra un po' eccessivo, per un gioco. Anche se è _competitivo_ (lo scrivo in corsivo perché qui non stiamo parlando di LCS, ma del corrispettivo della partitella di calcio).\n\n> Non è un altra forma di mancanza di rispetto nei confronti degli altri 4 quello di giocare le ranked a mò di \"mo me sparo na partita a flipper e sticavoli\"(per me è negative attitude )\n\nA mio avviso è una mancanza di rispetto (non qualcosa che merita una segnalazione, sia chiaro), ma non è quel di cui stavo parlando o la condotta che auspico.\n\n> Certamente si può vincere anche senza,ma ora ti sfido a non spammare la risata di ziggs annie o nami,o di altri campioni molto fastidiosi..io lo trovo estremamente divertente anche quando lo fanno gli altri !\n\nCapiscimi, se lo fai per sentirla te non c'è problema, se la fai per sottolineare un errore dell'avversario o una tua bella giocata, ci può anche stare, ma spammarla continuamente, senza alcun motivo che non sia cercare di deconcentrare l'avversario, beh... io non lo trovo _estremamente divertente_.\n\n\n>se un giocatore tilta perchè viene camperato,o perchè non gli viene concesso il farm,cosa dovremmo fare?\n\nNiente, quello è un problema suo: quello è il modo in cui lo puoi mettere in difficoltà, **giocando**.\n\n> Non è antisportivo rovinare l'esperienza di un top laner che dopo essere appena respawnato ed aver usato flash,si trova il jungler che lo intercetta insieme al nemico prima che torni in torre?\n\nNo, quello fa parte del gioco, ed è una tattica ammissibile.\n\n> La differenza sta solo sul fatto che questi sono playstyle,quella è un emote..ma il problema è sempre di chi tilta suppongo non di chi gioca per vincere e non flamma!\n\nCi sei vicino: la differenza è che quello è parte integrante del gioco, nel senso che per compiere quelle azioni tu **giochi** (inteso come utilizzare il tuo campione e le sue abilità), e compi quelle azioni che sono previste dal gioco per raggiungere obiettivi che il gioco ti pone.\n\nSpammare emote non è usare il champion: non lo stai muovendo, non stai usando le sue abilità, stai usando un mezzo che **_non è parte di quel campione_** per compiere un'azione che il gioco non prevede né incoraggia in alcun modo, e questo è palese.\n\n> Pernacchie no,ma sorridere tutto il tempo ed annuire lievemente quando l'avversario fa delle mosse lasciandogli intendere che l'avevi calcolato,e mostrarti pienamente padrone della situazione,sono tutti fattori psicologici che esulano dalle meccaniche di gioco ma che hanno un impatto notevole sul risultato della competizione se l'avversario ha una mente fragile.\n\nVa bene, ma non è una condotta irrispettosa. Semplifichiamo dicendo che le pernacchie sono lo spam di emote, mentre il sorridere tutto il tempo può essere giocare una lane molto aggressiva (magari così gli fai credere che un gank sia prossimo) o mostrarsi molto calmi, o magari impauriti per indurlo a essere più aggressivo mentre prepari un gank. **Questa** è la psicologia non antisportiva su LOL.\n\n\n> Invece in parte penso lo sia,perchè è la dimostrazione che una persona con un pochino di resistenza mentale,non subisce nessun effetto negativo da mastery e risate,perchè è una persona sana che non prende troppo male queste sottigliezze :)\n\nNon siamo tutti uguali. C'è il bambino a cui gli dici che è ciccione e ti molla un manrovescio, e poi c'è quello che invece scoppia a piangere. Tu nel dubbio prenderesti in giro un bambino perché è ciccione, perché se non sa accettare la realtà è un problema suo?\n\nÈ un discorso che abbiamo già affrontato altre volte sul forum: non si può essere irrispettosi nascondendosi dietro la sincerità, perché sappiamo benissimo che con certe nostre azioni o parole stiamo offendendo una persona, anche se non facciamo altro che rimarcare l'ovvio.\n\nSe sei ospite a cena dalla famiglia della tua nuova ragazza, e sua madre ti chiede com'era la cena, anche se era pessima, non ti passerebbe manco per l'anticamera del cervello di dirgli che faceva schifo, no? Eppure sarebbe la verità, non dovrebbe arrabbiarsi, è un problema suo se non accetta che non sa cucinare, ma tant'è...\n\n>Chi è veramente  tossico in questa situazione?\nPer me quello che perde la testa in tutta onestà..\n\nIo sono dell'idea che provocare sia forse peggio di reagire, perché lo si fa scientemente, con il chiaro intento di ottenere una reazione (negativa), mentre reagire è una scelta impulsiva, dettata appunto da un impulso, che il primo cerca di provocare. Esempio:\n\nSe io ti pungolo con una matita appuntita per ore, e tu poi mi tiri un cazzotto e mi fai un bel livido (perché io sono solo un piccolo Yordle), chi è veramente il tossico in questa situazione? Tu che hai perso la testa? Pensaci.\n\n>P.s. invece di fare le emote e le risate dovrei imparare ad usare i forum...il mio tallone d'achille!\nScusa ho fatto un po di disordine nella risposta ma ogni punto è una risposta ai punti da te sopra citati.\n\nForse preferirei giocare contro uno Yasuo che mi spamma le emote che rispondere a un altro post così incasinato...\nPro tip: quando rispondi puoi spezzare il testo della persona a cui vuoi rispondere, anteponendo a oggi singolo pezzo che vuoi citare, il simbolo _**>**_\n\nEsempio:\nhttp://i.imgur.com/YovriHD.png\ndiventa\nhttp://i.imgur.com/3VQQmFD.png","replies":[{"poster":"ComJohnShepard","date":"2017-08-24T19:54:01.158+0000","up_votes":1,"down_votes":0,"body":"><Forse preferirei giocare contro uno Yasuo che mi spamma le emote che rispondere a un altro post così incasinato...\nPro tip: quando rispondi puoi spezzare il testo della persona a cui vuoi rispondere, anteponendo a oggi singolo pezzo che vuoi citare, il simbolo\n\nHahahahah certo lo capisco :)\nHo messo il simbolo all'inizio ed alla fine spero che abbia capito bene.\nComunque Ciack ho apprezzato tantissimo la tua pazienza e soprattutto il tuo punto di vista sulla questione,oltre alla tua cortesia ed educazione.\nLa tua ottica sulla questione mi ha dato un ottimo spunto di riflessione e la conversazione almeno per me è stata estremamente costruttiva\nIl problema in fondo è che sono un bm che cerca dei cavilli a cui attaccarsi per fare uscire un po della mia tossicità in modi leciti,ed ho sempre pensato che la Riot abbia messo a disposizione questi 2 strumenti per \"incanalare\" tutto ciò,ma suppongo di aver pensato male.\n\nIn futuro cercherò di non abusare di queste meccaniche, e magari di diventare anche un pochino meno infame mentre gioco :D\n\nGrazie,spero che qualora dovessi fare un altra discussione tu sarai uno dei partecipanti,buona serata ed in bocca al lupo per tutto !\n\nP.S. ci sono riuscito ommiddio che bello T_T :D:D","replies":[{"poster":"ComJohnShepard","date":"2017-08-25T14:14:12.413+0000","up_votes":3,"down_votes":1,"body":">Alla fine l'hai capito per fortuna....\nSe vuoi sfogarti trovati un attività piuttosto. E vorrei farti notare un piccolo dettaglio: hai accusato me di comportarmi in un certo modo solo perché sto dietro a un monitor, ma tu volevi incanalare la tua tossicità cercando scappatoie in un gioco, DIETRO A UN MONITOR.\n\n\nWOW ahahahahahaahhaahhahaahhaHAHHAHHHAHHHHHHGJFKASDGYLHUKTYRJRBYUJGW6T3LUBYN6TLU6YAWLIAQU46HYB6IUTRYNLAIU64KYFwbogteruiyLI5YUTF\n\nSfogo la tossicità che sviluppo in game per colpa della gente che mi fa 0/7 in lane ogni game, la tossicità che ti danno i troll impuniti, ma soprattutto caro il mio LAIHO88 , la tossicità che mi si crea in corpo quando vedo dei giocatori ancora piu tossici di me,MA CHE LA MASCHERANO CON UNA SORTA DI FINTO BUONISMO e di \"rispetto\" .\nEcco i low elo tossici frustrati e mascherati  che si sfogano sugli altri tossici,questo si che mi fa arrabbiare.\nE poi smettila di essere cosi salty nei miei confronti, mi stai troppo simpatico !\nP.s. non sfogo la mia vita personale qui,anche perchè sinceramente se nella mia vita ci fosse una persona tossica,la rimuoverei dalla mia cerchia,mentre QUI DEVO ASPETTARE IL SURRENDER,E NEMMENO SURRENDANO. \n\nP.P.s. e non l'ho capito alla fine, ho solo deciso di ammetterlo perchè Ciack con le sue argomentazioni sensate e non mirate ad attaccare una persona ad buffum, mi ha fatto riflettere. Tu invece attacchi sempre tutti, non mi sembro io quello che va nei forum a sfogarsi con gli altri che vogliono solo un confronto di opinioni !","replies":[]}]}]}]}]},{"poster":"Laiho88","date":"2017-08-24T16:29:52.259+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ComJohnShepard,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=000500000000000000010001000000000000,timestamp=2017-08-24T16:24:46.592+0000)\n>\n> Scusa per il nome non mi ero accorto di averlo digitato male !\n> \n> La risposta certa mi serve perchè voglio usare correttamente i strumenti a mia disposizione senza incappare in sanzioni.\n> \n> Okay l&#x27;esempio degli scacchi regge tanto quanto il mio della boxe (ho fatto tornei di scacchi con la UISP per anni,ed anche li c&#x27;è il fattore psicologico che tu lo voglia o meno,solo che è piu sottile ed intelligente ed ovviamente non si fanno le pernacchie!)\n> \n> Cassius Clay sul ring, abbassava la guardia, schivando i colpi senza pararsi,si metteva da solo alle corde e invitava l&#x27;avversario a colpirlo e sorrideva.Per voi è antisportivo,per me è parte del gioco, se sei stupido e sprechi il 30% delle tue energie al 3 round in un incontro che ne dura 12,non è certo colpa di Clay ma della tua mancanza di saggezza.(scusa se mi sono dilungato ma sono un appassionato).\n> \n> Non cerco un exploit per vincere,penso solo che mentre giochiamo top lane e non ti faccio farmare,mi piazzo davanti la wave e sto li fermo,ogni tanto rido e freezo,se vinco un trade alzo la mastery e anche quando ti killo.\n> Ti levo la vision e ti impedisco di fare qualunque cosa,do fastidio al tuo jungler ecc.\n> \n> L&#x27;aspetto psicologico è piu che insito nel gioco,non è una scorciatoia,ed in piu se il mio avversario è cosi fragile da essere urtato per mastery e risate,io sono già in vantaggio dal livello 1 per il mind set differente,quindi a quel punto sarebbe irrilevante :)\n> \n> Ed infine spero che ti rendi conto,che se io sono piu bravo di te puoi ridermi in faccia quanto vuoi,al primo errore che fa ti ti castigo aspettando con pazienza,quindi come può un giocatore scarso vincere con questi ehm &quot;exploit&quot; ?\n\nNon ho letto tutto, ho letto di sfuggita solo il fatto dei mezzucci: se sei disposto ad usare mezzi simili ad un gioco online dove alla fine non si vince non si perde nulla, figuriamoci cosa saresti disposto a fare nella realtà.....Per esempio io, nella mia azienda, non assumerei MAI persone del genere, non sai mai cosa siano capaci di fare.....\n\n\nE con questo chiudo, adesso vedetevela voi tanto le mie parole stanno al vento....","replies":[{"poster":"ComJohnShepard","date":"2017-08-24T16:40:06.533+0000","up_votes":1,"down_votes":0,"body":"Non mi sembra che le tue parole stanno al vento,ho letto tutto ciò che hai scritto con attenzione,non mi sono fermato .\nQuesto è un confronto ed uno scambio di idee.\nNon capisco questa abitudine di parlare della vita reale e personale quando si parla di un gioco,come fai a dire cosa sarei disposto a fare nella realtà?\nMa ti rendo conto ???? \nNemmeno mi conosci.\nP.s. non lavorerei mai nella tua azienda poi sia mai che faccio una battuta ad un collega e mi segnala e mi licenzi...ahahahahahahahh","replies":[]}]}]}]}]}]}]},{"poster":"SIcuraMENTEnonIT","date":"2017-08-25T21:45:17.002+0000","up_votes":1,"down_votes":3,"body":"Giusto per capire , la riot mette la chat , e quella non si puo' usare perchè tutto è flame , mette i joke e le risate e nemmeno quelle si possono usare , inserisce le emote e sorpresa ?!?! Anche quello è considerato antisportivo , c'è qualcosa che si puo' fare allora ?\nPerchè non rimuovere tutto a questo punto ?","replies":[{"poster":"Floppyz","date":"2017-08-25T21:49:11.702+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=SIcuraMENTEnonIT,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=00050000000000000003,timestamp=2017-08-25T21:45:17.002+0000)\n>\n> Giusto per capire , la riot mette la chat , e quella non si puo&#x27; usare perchè tutto è flame , mette i joke e le risate e nemmeno quelle si possono usare , inserisce le emote e sorpresa ?!?! Anche quello è considerato antisportivo , c&#x27;è qualcosa che si puo&#x27; fare allora ?\n> Perchè non rimuovere tutto a questo punto ?\n\nNon è quello che ho detto e non è così che stanno le cose. E secondo me lo sai bene.","replies":[{"poster":"SIcuraMENTEnonIT","date":"2017-08-25T21:58:56.587+0000","up_votes":1,"down_votes":1,"body":">  anche se io, personalmente, non segnalerei un giocatore perché mi spamma mastery, risate e roba varia, quello **non è comunque un comportamento sportivo**.\n\nSi che ho sonno e ho molte ore di lavoro sulle spalle , ma credo di saper ancora leggere un minimo , eh ...\n\np.s. Hey bro' are you still mad ? Non fare cosi che poi mi saltano le idee di cospirazione , visto che non è per nulla vero che ora stai insinuando qualcosa ... vero ?","replies":[{"poster":"Floppyz","date":"2017-08-25T22:24:45.159+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=SIcuraMENTEnonIT,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=0005000000000000000300000000,timestamp=2017-08-25T21:58:56.587+0000)\n>\n> Si che ho sonno e ho molte ore di lavoro sulle spalle , ma credo di saper ancora leggere un minimo , eh ...\n\nCome vedi, io non ho scritto né che la chat non si può usare, né che non si possono usare le emote, né che usare queste cose è considerato antisportivo da Riot. Fugo ogni tuo dubbio cercando di spiegarti cosa ho scritto: ho scritto che **io**, **personalmente** (testuali parole, quindi non Riot) non segnalerei lo spam di emote, anche se ritengo **lo spam di emote** un comportamento antisportivo. Come vedi non parlo della chat, né di un uso normale delle emote, ma di uno spam insensato orientato solo a far arrabbiare l'avversario, e questa, nel caso ancora non fosse chiaro, è la mia personale opinione. Tu non sei d'accordo? Va bene, hai tutto il diritto di pensarla diversamente.\n\n> p.s. Hey bro&#x27; are you still mad ? Non fare cosi che poi mi saltano le idee di cospirazione , visto che non è per nulla vero che ora stai insinuando qualcosa ... vero ?\n\nCorretto: non sto insinuando niente, e visto che vuoi solo attaccar briga, per quanto mi riguarda la discussione finisce qui, quindi non ti risponderò oltre, pensa quel che vuoi.\n\nAh, bentornato sul forum, mi raccomando, comportati bene.","replies":[]}]}]}]},{"poster":"ComJohnShepard","date":"2017-08-24T16:34:42.711+0000","up_votes":1,"down_votes":0,"body":"Si parlava di Ez e non di mastery e risate,altrimenti lo avrei fatto !","replies":[]},{"poster":"Laiho88","date":"2017-08-24T15:21:09.761+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Ciack,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=0005000000000000,timestamp=2017-08-24T15:14:52.391+0000)\n>\n> Non volevo dire che sei stato offensivo, volevo solo dire che, anche se io, personalmente, non segnalerei un giocatore perché mi spamma mastery, risate e roba varia, quello non è comunque un comportamento sportivo.\n\nevoglia a spiegarglielo, finché non verrà bannato e verrà qui a piangere per il \"permaban ingiusto, non ho fatto niente\" non lo capirà mai....","replies":[{"poster":"ComJohnShepard","date":"2017-08-24T15:53:24.917+0000","up_votes":2,"down_votes":1,"body":"Scusa Laiho 88 non mi sembra di essere il tipo di persona che si va a lagnare e si lamenta,al contrario di tanti altri che invece non sopportano una risata ;)","replies":[{"poster":"Laiho88","date":"2017-08-24T16:05:18.388+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=ComJohnShepard,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=000500000000000000000000,timestamp=2017-08-24T15:53:24.917+0000)\n>\n> Scusa Laiho 88 non mi sembra di essere il tipo di persona che si va a lagnare e si lamenta,al contrario di tanti altri che invece non sopportano una risata ;)\n\nnon si tratta di non sopportare una risata, uno sfottò, si tratta di non sopportare un comportamento che non si limita al singolo episodio ma si protrae per più tempo rovinando del tutto la partita agli altri.\n\nIo ho capito il tuo ragionamento: siccome non è reportabile spammo e chissenefrega se agli altri la cosa infastidisce.","replies":[]}]}]}]}]}]}]},{"poster":"Laiho88","date":"2017-08-24T10:09:03.728+0000","up_votes":2,"down_votes":6,"body":"Spam di mastery e risate è comportamento antisportivo, accetto una o due volte per scherzo ma quanto la cosa è continuativa il report arriva tutto....\nE non venitemi a dire che sono esagerato, il regolamento (che non faccio io) dice chiaramente che i comportamenti antisportivi vengono puniti, e quello, che piaccia o no, lo diventa se si esagera.","replies":[{"poster":"5Dragon66","date":"2017-08-24T13:20:08.306+0000","up_votes":2,"down_votes":2,"body":"Contento tu, ogni report inutile che fai diminuisce la credibilità dei tuo report futuri.\nAh e la riot NON e sottolineo NON ha mai detto che lo spamm di mastery e di risata è antisportivo\n1) Perchè la maestria  SI PUO' MUTARE, LO DICONO DA MESI IMPARATELO VI PREGO, la risata no, ma ma puoi comunque togliere la voce dei campioni nelle impostazioni se vuoi\n2) Cosa ci sarebbe di antisportivo nel far notare che hai la mastery? Sono curioso","replies":[{"poster":"Laiho88","date":"2017-08-24T14:13:58.870+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Se6SaltySali,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=00040001,timestamp=2017-08-24T13:20:08.306+0000)\n>\n> Contento tu, ogni report inutile che fai diminuisce la credibilità dei tuo report futuri.\n> Ah e la riot NON e sottolineo NON ha mai detto che lo spamm di mastery e di risata è antisportivo\n> 1) Perchè la maestria  SI PUO&#x27; MUTARE, LO DICONO DA MESI IMPARATELO VI PREGO, la risata no, ma ma puoi comunque togliere la voce dei campioni nelle impostazioni se vuoi\n> 2) Cosa ci sarebbe di antisportivo nel far notare che hai la mastery? Sono curioso\nSe per questo la riot non ha mai detto che augurare la morte è reportabile, non è che deve dirlo mamma riot che una cosa è reprotabile, ovviamente da delle definizioni generiche sta poi alla persona rendersi conto...\n\nUn conto e far vedere che hai la mastery, magari qualche sfottò ci sta pure per carità, ma quando lo spammano dall'inizio alla fine del game per il solo gusto di prenderti in giro beh, quello è un comportamento antisportivo a tutti gli effetti.\nSe giochi a calcio prova a prendere in giro gli avversari ogni 2 minuti e vedi se torni a casa incolume....","replies":[{"poster":"5Dragon66","date":"2017-08-24T16:18:04.924+0000","up_votes":3,"down_votes":0,"body":"Cosa non riesci a capire nella parte in cui dico \"SI PUO' MUTARE LA MASTERY\"\nNon penso sia una cosa difficile, basta che muti il player, tanto è un antisportivo perchè spamma la mastery no? PDubito che tu voglia leggere i suoi messaggi.\nChe poi continuo a non capire che problema ti dia , non è che ti sta spammando \"SONO PIU' FORTE DI TE FAI SCHIFO\" è semplicemente un main yasuo depresso per la sua vita triste che ti mostra la sua mastery 8, quindi? Boh","replies":[{"poster":"Laiho88","date":"2017-08-24T16:25:48.481+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Se6SaltySali,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=0004000100000001,timestamp=2017-08-24T16:18:04.924+0000)\n>\n> Cosa non riesci a capire nella parte in cui dico &quot;SI PUO&#x27; MUTARE LA MASTERY&quot;\n> Non penso sia una cosa difficile, basta che muti il player, tanto è un antisportivo perchè spamma la mastery no? PDubito che tu voglia leggere i suoi messaggi.\n> Che poi continuo a non capire che problema ti dia , non è che ti sta spammando &quot;SONO PIU&#x27; FORTE DI TE FAI SCHIFO&quot; è semplicemente un main yasuo depresso per la sua vita triste che ti mostra la sua mastery 8, quindi? Boh\n\nChe problema mi da? Io ODIO determinati atteggiamenti e mutando la mastery non cambierebbe nulla perché saprei cmq dell'atteggiamento tenuto....\nE una cosa: un conto è MOSTRARE (verso cui non ho nulla in contrario ci mancherebbe altro), un conto è SPAMMARE ( che significa che ti sta prendendo per il culo)","replies":[]}]},{"poster":"ComJohnShepard","date":"2017-08-24T15:08:57.990+0000","up_votes":1,"down_votes":0,"body":"Ah beh quindi è giusto, uno mi sfotte io lo picchio perchè sono scarso a pallone e vengo sconfitto,comodo sfogare la frustrazione sugli altri :)","replies":[{"poster":"Laiho88","date":"2017-08-24T15:13:20.573+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ComJohnShepard,realm=EUW,application-id=MJVj50Jw,discussion-id=7XqFRxGW,comment-id=0004000100000000,timestamp=2017-08-24T15:08:57.990+0000)\n>\n> Ah beh quindi è giusto, uno mi sfotte io lo picchio perchè sono scarso a pallone e vengo sconfitto,comodo sfogare la frustrazione sugli altri :)\n\nnon sto dicendo che è giusto, sto dicendo che il troppo storpia, lo sfottò va bene una volta, due volte, poi basta, e se si esagera e giusto che certi comportamenti vengano puniti.\nLa non punibilità di certi atteggiamenti la considero un vuoto normativo....","replies":[]}]}]}]}]},{"poster":"5Dragon66","date":"2017-08-24T01:06:56.922+0000","up_votes":4,"down_votes":1,"body":"Non ho neanche letto tutto ma\n1) No non è reportabile lo spammare risata/mastery e la riot NON bannerà mai questa cosa (per fortuna)\n2)La mastery puoi mutarla, basta che muti il player, la risata non ne ho idea sinceramente\n3)Cristo divertitevi come fate a tiltare per una mastery wtf","replies":[{"poster":"MyXanadu","date":"2017-08-24T09:22:28.783+0000","up_votes":6,"down_votes":6,"body":"Ma veramente, quando mi spammano la mastery mi viene da pensare solo a una delle seguenti:\n\n- lo fa apposta per farmi arrabbiare --> non ci cascherò\n- si crede bravo perchè usa un champ imbecille (darius/yasuo/syndra etc) --> non mi tange\n- mi ha appena ucciso in un duello onesto --> si merita di spammare la mastery\n\nNon riesco a credere che ci sia gente che addirittura REPORTA per lo spam di mastery e risata.\nRoba da matti.","replies":[]}]}]}