{"poster":"uFere","date":"2019-02-16T20:17:37.495+0000","title":"Storie di Ranked fallite","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve a tutti, dopo il mio periodo di ban mi sono deciso ad essere il pi&ugrave; positivo possibile cercando di puntare al migliorarmi come player e sopratutto come persona (non trovo sia maturo incazzarsi in game e passare pi&ugrave; tempo a scrivere che a giocare), tuttavia nonostante trattenga battutine o osservazioni che potrebbero essere offensive vedo cose che veramente mi fanno torcere lo stomaco tipo qui:\r\nhttps://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/3930785109/225466403?tab=overview\r\n\r\nCome potete ben osservare, il nostro eroe ha pickato {{champion:58}} contro {{champion:2}}, esiste una qualche ragione per autocounterpickarsi? Quando un renekton sarebbe capace di vincere contro uno olaf che oltre ad avere il vantaggio della distanza pu&ograve; anche liberarsi dall&#039;unico modo che renekton ha per vincere un trade, ci sarebbe arrivato chiunque qui no? \r\nMa passiamo al secondo eroe del game, la nuova new entry {{champion:517}}, davvero? Perch&eacute; si dovrebbe pickare un champ che non si sa usare in ranked? Non sapr&ograve; mai cosa stesse passando per la testa a codesto individuo.\r\nNon cito {{champion:90}} Apc che sarebbe come sparare sulla croce rossa.\r\nAmmetto di aver sbagliato itemizzazione qui.\r\n\r\nSecondo game: https://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/3931556374/225466403?tab=overview\r\n\r\nGi&agrave; essere first pick non mi piace ma sono confident col champ e mi capita un matchup meh, vinco nonostante tutto.\r\nPremo tab, vedo {{champion:24}} , piango. Sul serio. Ok feedare {{champion:114}} ma anche {{champion:141}} su, ballava il tip tap sulla sua tomba praticamente..Qui mi ritrovo due lane feedate+ il jungler e niente. Go Next.\r\n\r\nTerzo game: https://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/3933239178/225466403?tab=overview\r\n\r\nAncora first pick..\r\nOk andiamo, lane contro {{champion:81}} Ap, ok facile, la si vince, si romma, si, ma esattamente come ha fatto {{champion:75}} a vincere contro {{champion:6}}? Boh, le meraviglie del bronzo direi. Come il {{champion:63}} 5/12 che non ha capito che, magari, si potrebbe buildare uno stopwatch o farsi una banshee se proprio non riesce a stare safe o sbaglio?\r\n\r\nSe siete arrivati qui sono convinto che vi chiederete il perch&eacute; di questo post, vi rispondo tranquilli. Pura e semplice osservazione che volevo condividere con chi magari sta a un elo pi&ugrave; alto del mio, il &quot;Se sei forte sali&quot; &egrave; falso, dovrebbe essere &quot;Se sei forte e hai fortuna sali&quot;, non riesco a sentirmi in colpa per aver perso questi 3 game perch&eacute; so di essermi impegnato: ho cercato build, letto guide, visto partite pure per 2-3 ore, mi sono migliorato nel mio piccolo, ho chiesto consigli a persone di elo alto e mi sono dato una calmata sopratutto, non sono tiltato, semplicemente ho grossi punti interrogativi sul perch&eacute; queste mie ultime ranked siano proprio andate in malora. Cosa ne pensate voi? Sono solo vittima di una serie di sfortunate partite o potrei migliorare in qualcosa?","replies":[{"poster":"Jiro is my waifu","date":"2019-02-16T21:34:30.617+0000","up_votes":1,"down_votes":0,"body":"domanda,io sono un ex gold 2 di merda,come si spiega il fatto che se gioco con l'account del mio miglior amico,che è attualmente in bronzo 1/silver 4 riesco a vincere giocando anche cose non esattamente convenzionali come il mio amato sion jng? sono semplicemente fortunato all'inverosimile o semplicemente il fattore fortuna conta circa il 10% del totale? considerando che la costante nelle partite sei tu,e che suddetti tizi quando sono nel team nemico non li noti perché tanto tu vinci,ma se perdi è solo colpa loro?Consiglio personale,tu gioca, se devi salire,alla lunga (ma neanche troppo) salirai,altrimenti meriti di stare all'elo dove sei.","replies":[{"poster":"uFere","date":"2019-02-16T21:43:39.655+0000","up_votes":2,"down_votes":1,"body":"Mi sono espresso male: ritengo che il climb non sia altro che una combinazione di fortuna e skill. Evidentemente tu sali perché magari vieni matchato con giocatori discreti rispetto all'elo in cui si trovano che combinati alla tua bravura ti rendono in grado di carriare ma non penso che esistano game in cui sia possibile fare letteralmente 1vs9, se no  sarebbe Call Of Duty. Gioco dalla s6 ma questa è la mia seconda season di rank effettivo, ho trovato un champ che mi piace e mi sto impegnando, sento di poter andare oltre il silver ma com questi presupposti non so, la season è appena iniziata, magari posso fare di meglio..","replies":[{"poster":"AebelothAngel","date":"2019-02-17T01:26:45.109+0000","up_votes":1,"down_votes":0,"body":"La fortuna è relativa, se non hai la skill per arrivare ad un certo elo non ci arrivi. Può capitare la giornata no, o il periodo no, in cui perdi molti game un po' perchè giochi male, un po' perchè oggettivamente, ti capitano scimmie in team ma, se è così sali subito, così come se sali per fortuna alla fine scendi subito. Morale della favola non raggiungi mai un elo superiore a quello che realmente meriti, magari la fortuna ti aiuta e sali di 2-3 divisioni in più ma su per giù il tuo elo sempre quello rimane.\nComunque, il consiglio che ti do è di pensare meno a come gioca il tuo team a che champion pickano etc. e ci concentrarti sul tuo gameplay e cercare di capire come carriare il game. Spesso a silver si perdono game in cui si è feedati per via di errori di macro e si finisce con l'incolpare il team quando invece, se sei feedato e alla fine perdi, la colpa è tua che non sei stato capace di guidare il tuo team alla vittoria.","replies":[{"poster":"uFere","date":"2019-02-17T08:19:14.879+0000","up_votes":1,"down_votes":0,"body":"In game sono concentrato esclusivamente su di me, massimo dò qualche incoraggiamento, magari se qualcuno muore scrivo \"Dw man, keep calm and we'll win this\", il problema viene dopo quando effettivamente il laner che feeda è esattamente quello che si autocounterpickato e penso \"Perché?\". Tutto qui. Vorrà a dire che ci metterò più impegno.","replies":[{"poster":"AebelothAngel","date":"2019-02-17T14:42:46.054+0000","up_votes":1,"down_votes":0,"body":"Senti io sono g2 quindi gioco contro i platino e i platino me li ritrovo pure in team e credi che non è la stessa cosa? counterpickano volutamente anche loro anzi, anche io spesso lo faccio avendo una champion pool ristretta ( cosa consigliabile se si vuol salire di elo ). Il punto non è il counterpick che decidi di giocare ma come lo giochi. In ogni caso non devi pensare a cosa decidono di giocare gli altri, se vuoi vincere un game prendi la tua corsiglia, sfonda il laner con tutta la tua e punta dritto all'inibitore, questo è il metodo per salire il resto non conta, se sei di un elo superiore se capace di carriare anche quelli che tu reputi scimmie","replies":[{"poster":"uFere","date":"2019-02-17T18:37:58.813+0000","up_votes":1,"down_votes":0,"body":"Champion pool ristretta? Gioco praticamente solo {{champion:126}} {{champion:86}} in soloduo, occasionalmente {{champion:555}} {{champion:53}} se sono premade bot, vorrei provare ad impararne altri ma in normal mi ritrovo gente che tryharda più che in ranked..\n\n>  se vuoi vincere un game prendi la tua corsiglia, sfonda il laner con tutta la tua e punta dritto all'inibitore\n\nMi sembra sensato questo, Jayce pusha che è una meraviglia..","replies":[]}]}]}]}]}]},{"poster":"Clearωay","date":"2019-02-17T11:52:42.974+0000","up_votes":1,"down_votes":1,"body":"Ti faccio un esempio banale per farti capire una cosa: il renekton che nel primo game si è counterpickato ha concluso 13-8 con 40 minion più di te, ovvero più o meno 700-800 gold più di te SOLO dai minion. 160 minion in 35 minuti sono pochissimi, 158 minion in 31 minuti del secondo game sono pochissimi, 204 minion del terzo game in 39 minuti fanno schifo, ne dovresti avere quasi il doppio. \nPensa a te stesso e vedrai che già qui fai un passo avanti. \nParli di fortuna e skill... quindi quando ho giocato a silver/gold poche settimane fa facendo 27 win e 1 lose ho avuto tutti team fortunati uniti alla mia skill? O forse ero io che facevo 25 kill a game e vincevo da solo ogni partita? \nSe sei forte sali non è riferito al breve periodo, ma al lungo periodo, perché i game storti, la giornata storta capitano a tutti, ma in un mese i game diventano tanti e il fattore \"se sei forte sali\" già si vedrà di più. Sei otp jayce, comincia a migliorare sul tuo champ, sulle meccaniche, sulle tue macro che evidentemente non sono chissà quanto sviluppate se perdi questi game, SUL FARM, che solo da questi 3 game si vede quanto sia scarso. \nSei bronzo quindi penso che di cose da poter migliorare tu ne abbia milioni, ignora gli altri, pensa a te stesso. Un post del genere lo fai solo se pensi agli altri. Ma cosa te ne importa di jax che va 1-9, di urgot che perde contro nasus ecc? Non li rivedrai mai più quei giocatori. \nPensa a te stesso, a cominciare dal tuo farm osceno :P \n(lo dico in modo costruttivo sia chiaro)","replies":[{"poster":"Im in pain","date":"2019-02-19T16:17:23.412+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ClearWater,realm=EUW,application-id=MJVj50Jw,discussion-id=rQEqRvPB,comment-id=0005,timestamp=2019-02-17T11:52:42.974+0000)\n>\n> Ti faccio un esempio banale per farti capire una cosa: il renekton che nel primo game si è counterpickato ha concluso 13-8 con 40 minion più di te, ovvero più o meno 700-800 gold più di te SOLO dai minion. 160 minion in 35 minuti sono pochissimi, 158 minion in 31 minuti del secondo game sono pochissimi, 204 minion del terzo game in 39 minuti fanno schifo, ne dovresti avere quasi il doppio. \n> Pensa a te stesso e vedrai che già qui fai un passo avanti. \n> Parli di fortuna e skill... quindi quando ho giocato a silver/gold poche settimane fa facendo 27 win e 1 lose ho avuto tutti team fortunati uniti alla mia skill? O forse ero io che facevo 25 kill a game e vincevo da solo ogni partita? \n> Se sei forte sali non è riferito al breve periodo, ma al lungo periodo, perché i game storti, la giornata storta capitano a tutti, ma in un mese i game diventano tanti e il fattore &quot;se sei forte sali&quot; già si vedrà di più. Sei otp jayce, comincia a migliorare sul tuo champ, sulle meccaniche, sulle tue macro che evidentemente non sono chissà quanto sviluppate se perdi questi game, SUL FARM, che solo da questi 3 game si vede quanto sia scarso. \n> Sei bronzo quindi penso che di cose da poter migliorare tu ne abbia milioni, ignora gli altri, pensa a te stesso. Un post del genere lo fai solo se pensi agli altri. Ma cosa te ne importa di jax che va 1-9, di urgot che perde contro nasus ecc? Non li rivedrai mai più quei giocatori. \n> Pensa a te stesso, a cominciare dal tuo farm osceno :P \n> (lo dico in modo costruttivo sia chiaro)\n\n\"quando ho giocato a silver/gold poche settimane fa facendo 27 win e 1 lose ho avuto tutti team fortunati uniti alla mia skill? O forse ero io che facevo 25 kill a game e vincevo da solo ogni partita?\" e \"lo dico in modo costruttivo sia chiaro\" non vanno molto d'accordo, ha ragione il ragazzo a dire di volerti mandare a quel paese xd","replies":[{"poster":"Clearωay","date":"2019-02-19T18:10:06.266+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Im in pain,realm=EUW,application-id=MJVj50Jw,discussion-id=rQEqRvPB,comment-id=00050001,timestamp=2019-02-19T16:17:23.412+0000)\n>\n> &quot;quando ho giocato a silver/gold poche settimane fa facendo 27 win e 1 lose ho avuto tutti team fortunati uniti alla mia skill? O forse ero io che facevo 25 kill a game e vincevo da solo ogni partita?&quot; e &quot;lo dico in modo costruttivo sia chiaro&quot; non vanno molto d&#x27;accordo, ha ragione il ragazzo a dire di volerti mandare a quel paese xd\n\nMa chi sei? Chi ti ha chiesto niente? Cosa c'entri nella nostra discussione? Anche perché mi sembra che ne abbiamo parlato io e lui e nessuno se l'è presa. Il mio era un commento costruttivo e anche il commento dopo, altrimenti non avrei perso tempo a commentare","replies":[{"poster":"Im in pain","date":"2019-02-19T19:43:35.722+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ClearWater,realm=EUW,application-id=MJVj50Jw,discussion-id=rQEqRvPB,comment-id=000500010000,timestamp=2019-02-19T18:10:06.266+0000)\n>\n> Ma chi sei? Chi ti ha chiesto niente? Cosa c&#x27;entri nella nostra discussione? Anche perché mi sembra che ne abbiamo parlato io e lui e nessuno se l&#x27;è presa. Il mio era un commento costruttivo e anche il commento dopo, altrimenti non avrei perso tempo a commentare\n\nHey piano con le domande.Tu hai detto la tua opinione e io la mia ovvero che non mi sembra affatto un commento come dici tu \"costruttivo\" ma più una presa per il culo nei suoi atteggiamenti e te lo ha fatto notare anche lui ;)","replies":[{"poster":"Clearωay","date":"2019-02-19T19:58:16.691+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Im in pain,realm=EUW,application-id=MJVj50Jw,discussion-id=rQEqRvPB,comment-id=0005000100000000,timestamp=2019-02-19T19:43:35.722+0000)\n>\n> Hey piano con le domande.Tu hai detto la tua opinione e io la mia ovvero che non mi sembra affatto un commento come dici tu \"costruttivo\" ma più una presa per il culo nei suoi atteggiamenti e te lo ha fatto notare anche lui ;)\n\nSe hai problemi di comprensione dei messaggi non è un problema mio, pace amico :)","replies":[{"poster":"Im in pain","date":"2019-02-19T21:36:49.332+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ClearWater,realm=EUW,application-id=MJVj50Jw,discussion-id=rQEqRvPB,comment-id=00050001000000000000,timestamp=2019-02-19T19:58:16.691+0000)\n>\n> Se hai problemi di comprensione dei messaggi non è un problema mio, pace amico :)\n\nTe lo spiego in parole povere dato che mi sembra che sia tu quello che non riesce a comprendere il pensiero altrui: \nTi sei palesemente vantato di essere di \"elo alto\" con qualcuno di elo più basso e a me irrita vedere episodi del genere.Pongo fine qui alla nostra discussione :))","replies":[{"poster":"Clearωay","date":"2019-02-20T00:52:40.442+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Im in pain,realm=EUW,application-id=MJVj50Jw,discussion-id=rQEqRvPB,comment-id=000500010000000000000000,timestamp=2019-02-19T21:36:49.332+0000)\n>\n> Te lo spiego in parole povere dato che mi sembra che sia tu quello che non riesce a comprendere il pensiero altrui: \n> Ti sei palesemente vantato di essere di \"elo alto\" con qualcuno di elo più basso e a me irrita vedere episodi del genere.Pongo fine qui alla nostra discussione :))\n\nCome vuoi mate, ognuno capisce ciò che vuole capire","replies":[]}]}]}]}]}]},{"poster":"uFere","date":"2019-02-17T12:18:48.253+0000","up_votes":1,"down_votes":0,"body":"Ok","replies":[{"poster":"Clearωay","date":"2019-02-17T13:21:43.476+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Jàycé,realm=EUW,application-id=MJVj50Jw,discussion-id=rQEqRvPB,comment-id=00050000,timestamp=2019-02-17T12:18:48.253+0000)\n>\n> Ok\n\nVolevi dei consigli da qualcuno di elo più alto :P","replies":[{"poster":"uFere","date":"2019-02-17T18:34:01.292+0000","up_votes":1,"down_votes":0,"body":"Istintivamente ti avrei mandato a quel paese dopo aver letto il post, visto che mi sono calmato? Dai che posso migliorare {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Clearωay","date":"2019-02-17T19:24:17.165+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Jàycé,realm=EUW,application-id=MJVj50Jw,discussion-id=rQEqRvPB,comment-id=0005000000000000,timestamp=2019-02-17T18:34:01.292+0000)\n>\n> Istintivamente ti avrei mandato a quel paese dopo aver letto il post, visto che mi sono calmato? Dai che posso migliorare {{sticker:slayer-jinx-wink}}\n\nIl mio voleva essere un commento costruttivo quindi sono felice che ti sia trattenuto :P\nPensa a te stesso, a vedere dai tuoi score le meccaniche per essere di elo un po' più decente le hai, quindi concentrati sul farm e sulle macro dove probabilmente sei più carente! Guarda streaming, vedi come giocano giocatori più bravi di te, serve molto fidati","replies":[{"poster":"uFere","date":"2019-02-17T23:50:47.770+0000","up_votes":1,"down_votes":0,"body":"Questo è un commento che cercavo, almeno lol mi ha aiutato ad imparare come mantenere la calma xD\nMi è chiaro il concetto \"prendi vantaggio e convertilo in obbiettivo,2 più che altro non so come comportarmi al meglio in determinate situazioni come nel caso di nasus, li non sapevo proprio che pesci pigliare dato che da solo uccideva mezzo team, se c'è qualcuno di grosso nel team nemico cosa dovrei fare?","replies":[{"poster":"Clearωay","date":"2019-02-18T02:10:32.289+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jàycé,realm=EUW,application-id=MJVj50Jw,discussion-id=rQEqRvPB,comment-id=000500000000000000000000,timestamp=2019-02-17T23:50:47.770+0000)\n>\n> Questo è un commento che cercavo, almeno lol mi ha aiutato ad imparare come mantenere la calma xD\n> Mi è chiaro il concetto &quot;prendi vantaggio e convertilo in obbiettivo,2 più che altro non so come comportarmi al meglio in determinate situazioni come nel caso di nasus, li non sapevo proprio che pesci pigliare dato che da solo uccideva mezzo team, se c&#x27;è qualcuno di grosso nel team nemico cosa dovrei fare?\n\nNel caso di nasus la cosa più sensata sarebbe ignorarlo e prendere obiettivi altrove, ma nel momento in cui diventa troppo grosso purtroppo il game è difficilmente recuperabile a meno che non ci sia qualcuno di altrettanto grosso nel vostro team. Dipende molto dai casi, da che champion ti trovi ultra feddato e dai due team. Per farti capire alcune cose dovrei guardare alcuni tuoi game e spiegartele perché così è un po' difficile :P","replies":[]}]}]}]}]}]}]},{"poster":"Erax157","date":"2019-02-16T22:18:32.109+0000","up_votes":1,"down_votes":0,"body":"Ho vissuto la tua stessa situazione, tale che smisi di giocare ranked per un periodo, ma non perchè mi fossi stufato. Scrissi anche io un post come il tuo e quello che realizzai è che una partita persa è persa e poco c'è da fare. Non puoi cambiare i giocatori che trovi, tutto cio che puoi fare e migliorare te stesso. Cio che feci fu smettere di rankare e fare draft a manetta con il mio main{{champion:134}} . E ora sono pronto a rankare di nuovo. Ovviamente non devi fare per forza come me, ma cio che voglio farti capire e che sempre ci sarà gente così, ma non puoi farci nulla e lamentarsi serve a poco. L'unica cosa che puoi fare e migliorare te stesso, poi naturalmente non riuscirai sempre a vincere o a carryare quei maiali ma almeno saprai per certo di aver dato il massimo.","replies":[{"poster":"uFere","date":"2019-02-17T08:26:15.679+0000","up_votes":1,"down_votes":0,"body":"Non si tratta nemmeno di tilt, è più il Perché di certe azioni che mi fa pensare. Immagino che dovrò migliorare ancora col main e poi riprovare a rankare.","replies":[{"poster":"Erax157","date":"2019-02-17T22:45:14.375+0000","up_votes":1,"down_votes":0,"body":"Giusto per farti un esempio io oggi in ranked avevo Darius toplanr contro soraka. Si hai capito bene. E un darius con la maestria 7 è riuscito a perdere da una soraka livello 30. Non dico niente","replies":[]}]}]},{"poster":"Gìove","date":"2019-02-17T08:58:24.515+0000","up_votes":1,"down_votes":0,"body":"Ti dirò, in questo forum il Name Shaming è bandito, ma qua faccio un eccezione. _(Sempre se non mi beccano gli Emissary)_\nPrincipalmente la questione di trovare dei compagni decenti è basata su una forma molto matematica e giusta che da milioni di anni, il genere umano, cerca la risposta. ~~il culo~~ La fortuna.\nComunque, la situazione è strana in questo inizio season, per dirti che io ho fatto B4 (7W/3L) ma invece di giocare ancora, aspetto che i rank si stabilizzano.\n\nCon questo, ti dico, buona fortuna.","replies":[{"poster":"uFere","date":"2019-02-17T12:05:24.054+0000","up_votes":1,"down_votes":0,"body":"> in questo forum il Name Shaming è bandito\n\nSe va contro le regole rimuovo senza problemi","replies":[]}]},{"poster":"SUN Void ","date":"2019-02-16T23:49:38.601+0000","up_votes":1,"down_votes":0,"body":"Io ti consiglio di riguardare le stat dei 3 game in questione con attenzione, per esempio nel secondo game avrai anche giocato bene là lane a quanto dichiari, ma la tua pressione e il tuo contributo sugli obiettivi era basso","replies":[{"poster":"uFere","date":"2019-02-17T08:23:30.570+0000","up_votes":1,"down_votes":0,"body":"Quando ho i jungler feedati contro ho paura di rommare, specie se non ho vision, quel kayn mi tirava giù con una W mentre fiora se mi guardava male morivo. Apprezzo il consiglio, proverò a rommare di più e a dare più priorità agli obbiettivi.","replies":[]}]},{"poster":"The Fluffy Lamb","date":"2019-02-17T01:07:25.641+0000","up_votes":1,"down_votes":0,"body":"Self made soluzione!\n\nIo vinco se ho un kda positivo e un farm decente :D\n\nFanculo il resto, 3/4 delle volte è tempo perso{{sticker:sg-miss-fortune}}","replies":[]}]}