{"poster":"uFere","date":"2017-03-01T20:24:51.302+0000","title":"Jarvan Top/Jungle","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Ho deciso di non rankare in questo periodo e quindi mi sono messo a provare i champ in rotazione, mi &egrave; piaciuto fin da subito j4, da qui &egrave; sorto un problema, ci ho fatto un paio di &quot;disastrose&quot; partite e...vi lascio immaginare cosa sia successo.\r\nCome dovrei giocarlo sia top che jung? Come buildarlo?","replies":[{"poster":"vondarck","date":"2017-03-02T10:37:32.148+0000","up_votes":1,"down_votes":0,"body":"Jarvan è quella categoria di champion che ha un kit molto amplio ma non eccelle in niente\n\nE un champion molto forte in early game\nLa Q rompe l'armor avversaria\nLa w è uno scudo + slow\nLa E oltre a fare una quantità decente di danno base ti serve per zonare e buffare i tuoi alleati\nLa R fa un danno discreto ma si countera con dash e flash\n\nData l'abbondanza del suo kit può essere settato brusier tank o assasin\nLa assassin è efficace se si chiude in fretta la partita data la sua pressapoco nulla possiblita di disingaggio una volta andato in all in\n\nIn generale j4 è forte in early e deve snowballare\n\nLa buld più classica e\n\nSmite rosso gemma del guerriero-idra famelica-black cleaver-malmortis-mercury-corazza dell uomo morto (standard brusier)\n\nSe se molto indietro puoi andare più tanky, data l'utility della tua ulti, la tua W e il debuff della Q\n\nQuindi gemma del colosso cernireo- idra titanica-spirit visage-omen du randuin-mercury-corazza uomo morto/spinata\n\nNel caso hai un AP support con motlo danno puoi spostarti anche MOLTO utility\n\ngemma del colosso-mercury- + support item solari-redenzione-zzportal-voto del cavaliere (in base alla situazione)\n\nPer le mastery andrei sempre di thunderlord.. Gli altri sono imho molto situazionali","replies":[{"poster":"L0pHO3n1X","date":"2017-03-02T15:26:28.100+0000","up_votes":1,"down_votes":0,"body":"Da un paio di settimane mi sto chiudendo con j4 e sono abbastanza d'accordo su quello che hai detto.\nIn early è fortissimo se sai sfruttare le occasioni giuste e sai gankare ( cercando di non usare subito E+Q).\nPurtroppo è un champ piuttosto squishy e se usi la combo E+Q per ingaggiare può succedere che vieni shottato dal team avversario senza la possibilità di un escape (a meno che non hai flash up). \nQuindi o snowballi come dicevi tu e puoi permetterti di andare full ad, shottare i nemici e sperare nel frattempo di non essere shottato a tua volta dal team nemico, altrimenti consiglio una build mezza ad e mezza tank (per esempio titanic hydra piuttosto che famelic). \nAttualmente le build con cui mi trovo meglio sono:\n\n{{item:1412}} {{item:3748}} {{item:3742}} {{item:3071}} {{item:3053}} {{item:3111}}  oppure {{item:3047}}  a seconda dei casi\n\n{{item:1412}} {{item:3071}} {{item:3748}} {{item:3142}}  oppure {{item:3814}} {{item:3742}} {{item:3111}}","replies":[{"poster":"vondarck","date":"2017-03-03T09:13:54.923+0000","up_votes":2,"down_votes":0,"body":"A me piace la malmortis su un jarvan AD perché da lifesteal da tutte le fonti, e anche 50+20 di ad, rispetto allo sterak lo preferisco se non ho un trinity","replies":[]},{"poster":"uFere","date":"2017-03-02T19:01:55.786+0000","up_votes":1,"down_votes":0,"body":"> ( cercando di non usare subito E+Q).\n\nIn che senso? Aspetto sempre che il laner flashi o dashi prima di tirargli la E dietro e knockapparlo con Q, devo fare così giusto?\n\n> Purtroppo è un champ piuttosto squishy e se usi la combo E+Q per ingaggiare può succedere che vieni shottato dal team avversario senza la possibilità di un escape\n\n:'( Si, vero, per questo lo buildo semi tank, anche se non so bene se jarvan debba essere giocato cosi, quando lo uso jungle prendo sempre {{item:1401}} {{item:3748}}  poi tank in base al team nemico\n\n> (per esempio titanic hydra piuttosto che famelic)\n\nBuildo sempre la titanic?","replies":[{"poster":"L0pHO3n1X","date":"2017-03-03T07:32:19.790+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fehlix99,realm=EUW,application-id=cAOZwaUi,discussion-id=ZdWL2a4z,comment-id=000000000000,timestamp=2017-03-02T19:01:55.786+0000)\n>\n> In che senso? Aspetto sempre che il laner flashi o dashi prima di tirargli la E dietro e knockapparlo con Q, devo fare così giusto?\n\nDipende dai casi..a volte ti troverai costretto ad usare subito E+Q per cercare di salvare un tuo alleato. In altri casi invece puoi far usare il flash ai nemici solamente correndogli incontro. Ho visto dei flash nemici ridicoli usando Jarvan. Appena vedono che arrivi da dietro la loro lane si cagano sotto e spesso flashano prima che tu usi la E+Q. Per quanto riguarda i primi due item da buildare ti consiglierei di non andare così tank fin da subito. Invece dell'oggetto da jungla che ti da vita ti consiglio di prendere AD per snowballare meglio e prendere qualche kill in early. \n\n {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"uFere","date":"2017-03-03T19:50:47.210+0000","up_votes":1,"down_votes":0,"body":"Grazie dei tips, vedrò di usarli al meglio ;)","replies":[]}]}]}]},{"poster":"uFere","date":"2017-03-02T18:58:18.759+0000","up_votes":1,"down_votes":0,"body":"Grazie come sempre vondarck, sei sempre disponibile ;)\n\nComunque non essendo propriamente esperto del ruolo di jungler, ho provato a farmi {{item:1401}} {{item:3748}} per poi andare completamente tank, credo che fosse worth dato che nel 90% dei casi manca un frontliner, in più mi permetteva di stare nel mezzo ai fight, mi piace giocato così, più in là proverò qualche build più aggressiva, mi serve solo il tempo di prendere confidenza col champ.\nCoi danni credo di stare apposto in early dato che uso rune Ad quando gioco j4 (Rosse e Quintessenze dell'AD, Gialle Armatura e Blu Resistenza magica), va bene così o mi conviene comprare qualche item da danno in più?","replies":[{"poster":"vondarck","date":"2017-03-03T08:52:01.250+0000","up_votes":1,"down_votes":0,"body":"Io ho imparato a giocare j4 perche cercavo un jungler forte in 5v5 premade.\n\nLe rune che gli usavo erano\nRosse: AD\nGialle: arm\nBlu: mr scaling/cdr scailing+mrscailng (per avere il 10% al 18)\n5th: AS\n\nGiocavo ste pagine in base a se volevo andare tank (allora 10% cdr) o se volevo andare full AD (allora mr x livello)\nIl motivo sostanziale è il warrior+ black cleaver+ malmortis (40% CDR)\n\nL'evoluzione del tiamat a scelta..\nAnche la gemma del colosso cernireo ha senso, dopo l'aumento degli hp della BC quasi quasi la metterei core anche come tank item (e fai un tank con amor pen)\n\nAndresti di cirnireo - titanica - bc / cuore giacciato/ uanto del gelo- corazza spirituale - mercury - e un item situazionale come omen, thormail, sterak ecc.. Sei un discreto mix tra diesa e offesa","replies":[{"poster":"uFere","date":"2017-03-03T19:48:56.090+0000","up_votes":1,"down_votes":0,"body":"Grazie dei consigli, vedrò di usarli ;)","replies":[]}]}]}]}]}