{"poster":"uFere","date":"2016-06-08T10:51:36.273+0000","title":"Consigli per Nautilus","subforum":"Campioni e gameplay","up_votes":2,"down_votes":0,"body":"Salve a tutti, ho da poco acquistato nautilus, mi piace e mi ci trovo anche bene, qualcuno ha consigli per questo bestione? Anche build se ne avete\r\nLo gioco prevalentemente in top e come support","replies":[{"poster":"Asvalon","date":"2016-06-15T07:36:02.183+0000","up_votes":1,"down_votes":0,"body":"Io lo preferisco supp, soprattutto se hai un adc aggressivo. Basta che ti butti in mezzo ai nemici, li stunni, usi la W per proteggerti e poi li rallenti con la E. Nel frattempo un bravo adc dovrebbe fare il suo dovere e uccidere xD. Se proprio tentano di scappare hai pure la ulti che blocca la fuga. Io buildo full tank visto che la W scala con la salute {{item:3068}} {{item:3065}} {{item:3083}} \nHo provato ad usarlo in top lane ma personalmente fa pochi danni ed ha un sustain molto elevato. Quindi se non hai un ottimo jungler che ganka rischi di passare 20 minuti noiosissimi senza che accada nulla di interessante.","replies":[{"poster":"uFere","date":"2016-06-16T12:21:10.394+0000","up_votes":1,"down_votes":0,"body":"Solitamente con una combo attacco base, r, e, q, w a livello 6 riesco a mettere in fuga se non ad uccidere il top\n\nAnche come support e jungler non è male","replies":[{"poster":"Asvalon","date":"2016-06-17T08:33:00.542+0000","up_votes":1,"down_votes":0,"body":"Riesci a mettere in fuga e forse a uccidere...ma così non sarai mai feedato, e non potrai essere il buon top laner che carria la partita :P","replies":[{"poster":"uFere","date":"2016-06-17T16:36:16.456+0000","up_votes":1,"down_votes":0,"body":"L'importante è non feedare il team avversario e non perdere la lane, giusto?","replies":[{"poster":"Asvalon","date":"2016-06-18T06:28:53.831+0000","up_votes":1,"down_votes":0,"body":"Se hai un buon jungler e le altre lane vanno bene :P","replies":[{"poster":"uFere","date":"2016-06-18T07:44:43.621+0000","up_votes":1,"down_votes":0,"body":"Beh LoL è anche fortuna, fortuna di non capitare con feeders haha","replies":[]}]}]}]}]}]},{"poster":"vondarck","date":"2016-06-16T14:15:46.061+0000","up_votes":1,"down_votes":0,"body":"sono ignorante sul barilotto..\n\nma giocarlo con {{item:3151}} {{item:3001}} {{item:3075}}  e il resto full tanky? (parlo a top/jung)","replies":[{"poster":"uFere","date":"2016-06-16T16:54:14.822+0000","up_votes":1,"down_votes":0,"body":"Mhh dovrei provare, io ho trovato una build specifica su un forum, magari la posto se vuoi","replies":[]}]},{"poster":"P4p3","date":"2016-06-08T10:58:07.012+0000","up_votes":1,"down_votes":0,"body":"Per me ora come ora è meglio in top rispetto al supp. Non si puo piu giocarlo in jungle , è più forte in early - mid game rispetto al late. Essendo un cc vivente cerca sempre di giocarlo in team in cui c'è tanto danno , perchè in late praticamente non ne fa. Ho provato a buildarlo RoA + Gauntlet ma comunque oltre i 25 minuti il suo danno si azzera praticamente mentre prima riesce facilmente a vincere i trade. In 1v1 cerca di attivare lo scudo solo dopo che il tuo avversario ha usato le sue principali spell da danno, più lo scudo dura , più danni fai.","replies":[{"poster":"uFere","date":"2016-06-08T11:11:53.443+0000","up_votes":1,"down_votes":0,"body":"Ho notato i danni in late, è una pecca, se provassi ad alzare di più i danni magici?\n\nIn 1vs1 non ho problemi, una volta ridotto in fin di vita, lo grabbo con la q e mi prendo la kill","replies":[{"poster":"P4p3","date":"2016-06-08T13:42:35.605+0000","up_votes":1,"down_votes":0,"body":"Non ne vale la pena perchè ha poco AP ratio sulle spell... L'unica maniera \"efficace\" per fare più danni è comprare item come gauntlet (che sinergizza bene con la sua passiva) oppure sunfire... Insomma non puntare su AP o AD :)","replies":[]}]}]},{"poster":"xThoon","date":"2016-06-08T10:55:05.365+0000","up_votes":1,"down_votes":0,"body":"l'unico consiglio che poso darti cerca di morire il meno possibile e di ottenere il maggior numero di kill/assist","replies":[{"poster":"uFere","date":"2016-06-08T11:08:56.557+0000","up_votes":1,"down_votes":0,"body":"Su questo non ho problemi coi tank, massimo 2-3 morti a partita,  con le uccisioni e assist poi dipende anche da come va il team","replies":[]}]}]}