{"poster":"uFere","date":"2016-08-21T21:06:54.711+0000","title":"Shen","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Shen &egrave; un pick frequente nelle ranked in low elo? Oppure nessuno lo conosce e non lo si usa molto?\r\nMeglio buildarlo full tank o bruiser? Tendo a buildarlo sempre con {{item:3748}} {{item:3751}}, gli altri item li adatto in base alla situazione, faccio bene o dovrei cambiare?","replies":[{"poster":"Ryukito","date":"2016-08-21T21:44:51.478+0000","up_votes":2,"down_votes":0,"body":"Shen è un pick di circostanza. Non lo si picka perche serve un tank, ma lo si picka se c è un tank bot o un fighter/tank in giungla. Come ben sai la ulti richiede qualche secondo di cast e se viene usata su uno squishy che viene killato in 0.5s, è tutto inutile. L'idra su Shen è ottima, consente di infliggere molto danno e di pushare le lanes velocemente per poi andare in soccorso degli alleati con la ulti. Io per prima cosa stacko l'item che ti da heal permanente, \"pugno di Jaurim\", poi vado di sunfire e di resistenza magica. L'idra la chiudo come terzo item dopo gli stivali.","replies":[{"poster":"uFere","date":"2016-08-22T08:45:34.826+0000","up_votes":1,"down_votes":0,"body":"Solitamente, tengo costantemente d'occhio la minimappa quando uso shen, appena vedo qualcosa avviso subito, e mi tengo pronto ad ultare, non credo che a bronzo sappiano killare cosi velocemente. L'idra è un must per me su shen bruiser, l'armor lo buildo in base alla situazione","replies":[{"poster":"Ryukito","date":"2016-08-22T13:31:24.648+0000","up_votes":1,"down_votes":0,"body":"Non sottovalutare nessuno in game, neanche i bronzi.","replies":[{"poster":"uFere","date":"2016-08-24T08:47:11.304+0000","up_votes":1,"down_votes":0,"body":"Una lezione che non dimenticherò facilmente dopo l'ultimo game","replies":[]}]}]}]},{"poster":"zYaichi","date":"2016-08-22T09:46:26.099+0000","up_votes":1,"down_votes":0,"body":"Shen è forte se in fase di lane ulti mid o bot salvando qualcuno,ma potresti essere seguito dal tuo avversario in top e perdere o vincere il trade.Hai un taunt e una W che blocca i danni dagli AA devi avere qualcuno che ingaggia o una cc-chain altrimenti se hai solo shen come ingaggio non è molto efficace,diciamo che dovresti pensare di pickare shen come un tham top o una lulu top,è più efficace a proteggere che a ingaggiare e non so quanto possa essere utile a unranked,ma non voglio scoraggiarti è un buon pick e decisamente meglio di altri.\nSecondo me l'unico item offensivo di cui ha bisogno shen è il sunfire gli da splitpush e danni sostenuti massimo un martello il resto è situazionale.","replies":[{"poster":"uFere","date":"2016-08-24T08:52:43.680+0000","up_votes":1,"down_votes":0,"body":"In unranked mi capita di trovare persone che non conoscono shen, infatti si buttano con ogni auto attack possibile su di me, ignorando che ho 2 scudi (passiva e w)\nSolitamente gioco top con shen e riesco quasi sempre a vincere, l'ho ammetto, shen non è forte negli 1vs1, ma si può feedare usando la ulti  (meccanica che io amo dato che può trasformare gli 1vs1 in 2vs1 a mio vantaggio) e rubando kill (amo i flame, anche se certe volte la gente non sa se ringraziarmi perché l'ho salvata o flammare perché gli ho appena rubato la kill)\nMi sto esercitando molto col taunt, voglio dare il massimo nelle ranked e non essere un peso, comunque buildo hydra o martello asseconda del team che ho","replies":[{"poster":"zYaichi","date":"2016-08-24T09:45:40.331+0000","up_votes":1,"down_votes":0,"body":"Se vuoi esercitarti con il taunt impara anche il taunt flash prima che finisca il dash  su chi vuoi tauntare,funziona provalo contro i bot.","replies":[]}]}]},{"poster":"vondarck","date":"2016-08-22T08:57:33.072+0000","up_votes":1,"down_votes":0,"body":"io lo gioco con danni discreti (se non faccio danni tilto)\n\n{{item:3068}} {{item:3748}} {{item:3078}} {{item:3053}} {{item:3158}} {{item:3065}} \n\nquesta è la mia build \"standard\"\novvio che se mi piglio uno yasuo a top devo valutare altre opzioni\n\nse devo prendere un full tank a top prendo {{champion:14}} piuttosto...","replies":[{"poster":"uFere","date":"2016-08-24T08:54:21.364+0000","up_votes":1,"down_votes":0,"body":"Mhh gli stivali li adatto in base al team nemico, spesso uso {{item:3083}}, credo sia vitale per i team fight quando ci sono molti adc o assassini, la trinity non la uso mai","replies":[{"poster":"vondarck","date":"2016-08-24T09:14:54.097+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fehlix99,realm=EUW,application-id=cAOZwaUi,discussion-id=80XFdMcE,comment-id=00020000,timestamp=2016-08-24T08:54:21.364+0000)\n>\n> Mhh gli stivali li adatto in base al team nemico, spesso uso {{item:3083}}, credo sia vitale per i team fight quando ci sono molti adc o assassini, la trinity non la uso mai\n\ngli stivali uso SEMPRE gli ionia perchè in linea farmo molto e tengo sotto occhio la mappa, solo che se ulto in giro poi devo tornare fast a top e quindi devo avere sempre il TP viabile\n\nin oltre con 40% cdr la Q è quesi a 2 secondi di cd, rendendolo un vero MOSTRO in lategame, altra nota, in team fight è meglio {{item:3053}} perchè assorbe un burst e ti da altro danno base (che procca sulla trinity)\n\nla build che ho messo io prevede almeno 1 altro tank, tra support e jung","replies":[]}]}]},{"poster":"Pls Buff Shen","date":"2016-08-22T00:27:22.005+0000","up_votes":1,"down_votes":0,"body":"Lo Shen bruiser con {{item:3748}} può sembrare buono ma modestamente a me non piace, i danni in più che ricavi non ti serviranno a niente visto che il tuo compito in fight è tauntare più persone possibili per poi peelare per i tuoi compagni quindi l'idra è del tutto inutile e anche se arrivi all'adc nemico per lui è una cazzata kitare uno shen e ti ritrovi a morire male, la build che uso io a mio parere è molto più utile{{item:3068}} {{item:3065}} {{item:3111}} /{{item:3047}} {{item:3742}} {{item:3102}} e infine un preziossimo {{item:3022}} Questo item è schifosamente forte, con lui appena prendi un nemico puoi semplicemente camminargli in faccia e ucciderlo, diventi inkitabile e tutto il team nemico deve girarsi su di te offrendo ai tuoi alleati l'opportunita di vincere il fight,poi alla fine uno lo gioca come vuole questo è solo un consiglio^^","replies":[{"poster":"uFere","date":"2016-08-22T08:29:47.096+0000","up_votes":1,"down_votes":0,"body":"Non ci avevo mai pensato di equipaggiare il martello ghiacciato, in effetti, può essere utile ...\nPer precisare, l'idra la uso prevalentemente per splint pushare e mettere pressione sulle lane dove non c'è nessuno in modo da far distaccare il team nemico, stranamente viene sempre e solo 1 a fermarmi anche quando sto feedato, cosi tolgo potere alla squadra avversaria: mentre quello che viene a fermarmi perderà tempo coi minion, io posso catapultarmi nel fight e portare qualche assist/kill a casa. Questa tattica a me sembra efficente, sarà perché sono ancora unraked, ma avvolte sembra che gli altri non ragionino minimamente, cosa che va tutto a mio vantaggio\nPer il resto buildo armor in base alla situazione","replies":[]}]}]}