{"poster":"Preâcher","date":"2015-11-06T00:19:15.120+0000","title":"Passt dies hier rein?","subforum":"Spielerverhalten & Moderation","embed":{"description":"Check your Summoner statistics, MMR, realtime spectate and using powerful global LoL Charts!","url":"http://euw.op.gg/summoner/userName=iLivin","image":"http://attach.s.op.gg/logo/20151020214421.1704429b08e66bb65a8bbb1f665a9479.PNG"},"up_votes":1,"down_votes":10,"body":"Hallo liebe LoL Comunity!\r\n\r\nUnd zwar geht es um &quot; Low Priority&quot;.....Ich habe in den letzen Monaten kein Spiel verlassen (Ja letztes Game mit Leona hatte ich ein Windos Update zwischen drinnen -.-) aber ich hatte gerade erst eine &quot; 5 Spiele 10 Minuten Priority&quot; obwohl ich kein Spiel AKF oder Verlassen habe......so nun nach dem lezten Game (Mit Leona wo ich mein Windows Update hatte) habe ich f&uuml;r 5 Spiele eine 20 min &quot;Low Priority&quot;...ich frage mich...WIESO??? Ich verlasse nie ein Spiel und wieso bekomme ich eine Low Priority??????? Mir leuchtet es nicht ein.......nie ein Spiel verlassen udn 5 mal eine 10 min Sperre...dachte mir so....Ok warum??.....aber jetzt.....5 mal 20 min sperre..:ERNSTHAFT?????????????? ICH VERLASSE NIE EIN SPIEL SCHAUT AUCH IN MEINEM SPIELVERLAUF NACH VERDAMMT............das regt mich echt auf!!!!! GM&acute;s oder Supports oder was auch immer....schaut da bitte nach das kann nicht sein das ich 10 min wegen einem windows update nich spielen kann, trotzdem noch in spiel joine und so gut wie m&ouml;glich helfe und dann noch eine sperre kassiere...ernshaft..:SCHAUT NACH!!!!!!!!!!!!!! Schaut auf meinen geposteten Link oder auch mit meinem Beschw&ouml;rernamen im LoL Client!!!!!!! DAS GIBTS NICHT!!! BITTE EIN GM oder SUPP soll da nachforschen!!!!! \r\n\r\n\r\nLG\r\niLivin","replies":[{"poster":"Preâcher","date":"2015-11-06T01:16:58.212+0000","up_votes":1,"down_votes":4,"body":"Ok, dieses Spiel habe ich noch sehr gut im kopf........ Denke nicht^^ Aber dennoch...kann sein das ich eventuell schlecht gespielt habe wei ich den \"neuen\" GP zum ersten mal gezockt habe.....aber habe mit GP nie ein Spiel beendet bzw. verlassen....ich habe den ausprobiert und dieser ist leider nicht mein Champ.....also nein.....ich habe dies Spiel nicht verlassen. Anschließend gleich 5x 10 min Sperre.....und jetzt 5x 20 min Sperre?? For Real??....Denke nicht^^ ...Ich habe kein Spiel verlassen.  Es war zwar ein Ranked.....aber dennoch ich dachte das dieser GP sich nicht viel von dem alten unterscheidet...tja so kann man sich täuschen^^...aber ich war weder afk noch habe ich das Game verlassen.......aber natürlich diese 5x low priority MUSS ich ja über mich ergehen lassen...da kann ich machen was ich will...aber anscheinend funktioniert dieses \"AFk melden\" nach dem Game nicht entsprechend wie es sein sollte.....\n\nLG iLivin","replies":[{"poster":"MeMyselfandBaal","date":"2015-11-06T01:34:09.876+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=iLivin,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=0001,timestamp=2015-11-06T01:16:58.212+0000)\n>\n> Ok, dieses Spiel habe ich noch sehr gut im kopf........ Denke nicht^^ Aber dennoch...kann sein das ich eventuell schlecht gespielt habe wei ich den \"neuen\" GP zum ersten mal gezockt habe.....aber habe mit GP nie ein Spiel beendet bzw. verlassen....ich habe den ausprobiert und dieser ist leider nicht mein Champ.....also nein.....ich habe dies Spiel nicht verlassen. Anschließend gleich 5x 10 min Sperre.....und jetzt 5x 20 min Sperre?? For Real??....Denke nicht^^ ...Ich habe kein Spiel verlassen.\n\ndu weißt schon, dass du nicht unbedingt das Spiel verlassen musst, um dem Leaverbuster negativ aufzufallen? Einfach in der Basis zu stehen, während du Zeitung liest/ 5 Minuten auf Klos gehst etc. pp reicht auch. Oder in der Basis Emotes spammen oder im Kreis laufen... \n\nIch würde spontan vermuten, dass du beim 1-3-1 Leona Spiel (da hast du es sogar zugegeben), beim 1-3-2 Morgana Spiel und beim 0-2-0 Gankplank Spiel nicht die gesamte Zeit über am Spiel teilgenommen hast. Warum? Nun ja, weil es einfach ungewöhnlich ist, dass man so viel weniger Levels hat als seine Teammates. Es sei denn man stirbt extrem häufig, was du ja nicht getan hast.\n\nUnd ja: Nur weil du schlecht spielst, hast du nach 23 Minuten nicht nur halb so viele Levels wie der gegnerische Toplaner... oder weniger als dein eigener Support. Das schafft man als Toplaner mit 0-2-0 Statistiken nur, wenn man AFK in der Basis rumsteht.\n\nUnd das sind halt 3 Spiele, die einem sofort suspekt vorkommen, wenn man sich deine Ranked Match History anguckt. Da kommt man dann schon zu dem Schluss, dass das passen wird.","replies":[{"poster":"Preâcher","date":"2015-11-06T02:08:24.945+0000","up_votes":1,"down_votes":6,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=00010000,timestamp=2015-11-06T01:34:09.876+0000)\n>\n> du weißt schon, dass du nicht unbedingt das Spiel verlassen musst, um dem Leaverbuster negativ aufzufallen? Einfach in der Basis zu stehen, während du Zeitung liest/ 5 Minuten auf Klos gehst etc. pp reicht auch. Oder in der Basis Emotes spammen oder im Kreis laufen... \n> \n> Ich würde spontan vermuten, dass du beim 1-3-1 Leona Spiel (da hast du es sogar zugegeben), beim 1-3-2 Morgana Spiel und beim 0-2-0 Gankplank Spiel nicht die gesamte Zeit über am Spiel teilgenommen hast. Warum? Nun ja, weil es einfach ungewöhnlich ist, dass man so viel weniger Levels hat als seine Teammates. Es sei denn man stirbt extrem häufig, was du ja nicht getan hast.\n> \n> Und ja: Nur weil du schlecht spielst, hast du nach 23 Minuten nicht nur halb so viele Levels wie der gegnerische Toplaner... oder weniger als dein eigener Support. Das schafft man als Toplaner mit 0-2-0 Statistiken nur, wenn man AFK in der Basis rumsteht.\n> \n> Und das sind halt 3 Spiele, die einem sofort suspekt vorkommen, wenn man sich deine Ranked Match History anguckt. Da kommt man dann schon zu dem Schluss, dass das passen wird.\n\nErnsthaft.....nach 3 Games die ich nicht ganz da war??? in meiner ganzen Season? 2x hintereinander Sperre?? Ja ich war vl nich das \"ganze Game da, aber ich habe weder Emotes oder sontiges gespammt oder so etwas.......nach 3 Games bekommt man 5x 10 min sperre und gleich danach 5x 20 min sperre?? Wirklich??? Ich meine da haben andere Spieler wirklich mehr Spiele verlassen oder AFK verbracht....also in dem Sinne war ich echt brav......aber echt nach 3 Games \"Halb AFK\" wird gleich 5x 10 min und gleich danach 5x 20 min Sperre gemacht??.......Da haben...wie erwähnt...manch andere Spieler ganz icher weit mehr \"AFk\" Spiele als wie ich ...:/","replies":[{"poster":"MeMyselfandBaal","date":"2015-11-06T02:21:36.566+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=iLivin,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=000100000000,timestamp=2015-11-06T02:08:24.945+0000)\n>\n> Ernsthaft.....nach 3 Games die ich nicht ganz da war??? in meiner ganzen Season? 2x hintereinander Sperre?? Ja ich war vl nich das \"ganze Game da, aber ich habe weder Emotes oder sontiges gespammt oder so etwas.......nach 3 Games bekommt man 5x 10 min sperre und gleich danach 5x 20 min sperre?? Wirklich??? Ich meine da haben andere Spieler wirklich mehr Spiele verlassen oder AFK verbracht....also in dem Sinne war ich echt brav......aber echt nach 3 Games \"Halb AFK\" wird gleich 5x 10 min und gleich danach 5x 20 min Sperre gemacht??.......Da haben...wie erwähnt...manch andere Spieler ganz icher weit mehr \"AFk\" Spiele als wie ich ...:/\n\nJetzt wird aus \"ich hatte in das eine Mal ein Windows Update\" schon ein \"ich war doch nur 3 mal halb AFK\"... Interessant... \nUnd ja, 3 Spiele in 15 Tagen (nebenbei alle 3 im Ranked, die Normal Games habe ich mir gar nicht angeguckt) rechtfertigen so eine Sperre. Zumindest meiner Meinung nach.\n\nSei einfach in jedem Spiel egal wie es läuft immer \"ganz da\" und spiele sie konsequent zu Ende, dann wirst du diesem Problem auch nicht mehr begegnen.","replies":[]},{"poster":"Waldschrat86","date":"2015-11-06T02:58:30.937+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=iLivin,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=000100000000,timestamp=2015-11-06T02:08:24.945+0000)\n>\n> Ernsthaft.....nach 3 Games die ich nicht ganz da war??? in meiner ganzen Season? 2x hintereinander Sperre?? Ja ich war vl nich das \"ganze Game da, aber ich habe weder Emotes oder sontiges gespammt oder so etwas.......nach 3 Games bekommt man 5x 10 min sperre und gleich danach 5x 20 min sperre?? Wirklich??? Ich meine da haben andere Spieler wirklich mehr Spiele verlassen oder AFK verbracht....also in dem Sinne war ich echt brav......aber echt nach 3 Games \"Halb AFK\" wird gleich 5x 10 min und gleich danach 5x 20 min Sperre gemacht??.......Da haben...wie erwähnt...manch andere Spieler ganz icher weit mehr \"AFk\" Spiele als wie ich ...:/\n\nVorhin war es noch eins, nach der Recherche sind es jetzt bereits 3, wieviel werden es dann in Wahrheit insgesamt sein?\nAußerdem sind 3 Spiele in Rankeds mit guter MMR eine Division (ohne Promo), da wird strenger geahndet, aber wenn du sowas schon in Rankeds machst, wirst du in Normals, ARAM oder Botgames noch weniger Hemmungen haben einfach mal nicht da zu sein.\nEs ist nunmal herzlich egal, ob du ein ganzes Spiel nicht teilnimmst, ein halbes, ein viertelses oder nur wenige Minuten.\nGenauso wie es egal ist, ob du dabei Emotes spammst, Wards setzt, ob das ein Rolle spielen würde, die Strafe gibt es für Nichtteilnahme am Spiel. Der LB registriert da alles, tja und die Zeit wird in Spielen gemessen, wenn du in den Monaten, in denen du angeblich nie afk oder dct warst kaum Spiele gemacht hast oder dachtest das greift nur beim Schließen des Spiels oder in Rankeds, Pech gehabt Unwissenheit schützt vor Strafe nicht. Jetzt weißt dus besser.\nAchja und Spieler, die weit mehr afk Spiele als du haben, haben dann entweder direkt die 20erQ oder sogar gar nichts, weil sie auch viel mehr Spiele ohne AFK-Zeit als du haben. Ich mein , der LB behandelt jeden gleich, es gibt eine immer noch recht großzügige Toleranzgrenze, die man erstmal überschreiten muss, normalerweise gibt es noch die 5MinQ, die hast du ja sogar übersprungen.\nAber ernsthaft nach dem, was du hier geschrieben hast besteht zumindest für mich kein Zweifel daran, dass du zu den Spielern gehörst, die die Toleranzgrenze direkt ausnutzen würden, wäre sie ihnen denn bekannt. Mal einfach öfters längere Zeit weg zu sein, hast du dir ja auch nur rausgenommen, weil du dachtest das System checkt das nicht bzw. wertet es nicht als AFK. Und kommm jetzt bitte nicht mit Notfällen, technischem Versagen oder dem Winupdate, denn genau dafür ist die Toleranz da.","replies":[{"poster":"Preâcher","date":"2015-11-06T03:17:11.668+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Waldschrat86,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=0001000000000001,timestamp=2015-11-06T02:58:30.937+0000)\n>\n> Vorhin war es noch eins, nach der Recherche sind es jetzt bereits 3, wieviel werden es dann in Wahrheit insgesamt sein?\n> Außerdem sind 3 Spiele in Rankeds mit guter MMR eine Division (ohne Promo), da wird strenger geahndet, aber wenn du sowas schon in Rankeds machst, wirst du in Normals, ARAM oder Botgames noch weniger Hemmungen haben einfach mal nicht da zu sein.\n> Es ist nunmal herzlich egal, ob du ein ganzes Spiel nicht teilnimmst, ein halbes, ein viertelses oder nur wenige Minuten.\n> Genauso wie es egal ist, ob du dabei Emotes spammst, Wards setzt, ob das ein Rolle spielen würde, die Strafe gibt es für Nichtteilnahme am Spiel. Der LB registriert da alles, tja und die Zeit wird in Spielen gemessen, wenn du in den Monaten, in denen du angeblich nie afk oder dct warst kaum Spiele gemacht hast oder dachtest das greift nur beim Schließen des Spiels oder in Rankeds, Pech gehabt Unwissenheit schützt vor Strafe nicht. Jetzt weißt dus besser.\n> Achja und Spieler, die weit mehr afk Spiele als du haben, haben dann entweder direkt die 20erQ oder sogar gar nichts, weil sie auch viel mehr Spiele ohne AFK-Zeit als du haben. Ich mein , der LB behandelt jeden gleich, es gibt eine immer noch recht großzügige Toleranzgrenze, die man erstmal überschreiten muss, normalerweise gibt es noch die 5MinQ, die hast du ja sogar übersprungen.\n> Aber ernsthaft nach dem, was du hier geschrieben hast besteht zumindest für mich kein Zweifel daran, dass du zu den Spielern gehörst, die die Toleranzgrenze direkt ausnutzen würden, wäre sie ihnen denn bekannt. Mal einfach öfters längere Zeit weg zu sein, hast du dir ja auch nur rausgenommen, weil du dachtest das System checkt das nicht bzw. wertet es nicht als AFK. Und kommm jetzt bitte nicht mit Notfällen, technischem Versagen oder dem Winupdate, denn genau dafür ist die Toleranz da.\n\nBevor du über mich urteilst lernst du mich bitte besser kennen, ich nutze garnichts aus...die 3 Spiele die ich nur \"Halb\" bzw in manchen Augen \"garnicht\" da war einfach nur ein Fehler meines Computers drinnen, und ja es zählt natürlich als DC, aber was soll ich machen, ich nehme natürlich die Strafe an! Und achja...du redest von \"Strafe übersprungen\". Nein dies stimmt leider nicht, ich habe alle 5 Spiele mit einer 10 min Sperre gemacht und anschließend direkt eine 5x 20 min Sperre bekommen. Ich rate dir nur eines, behandle mich nicht wie so ein 13-jähriges Kind , ich weiß sehr wohl wenn und wann ich etwas falsch gemacht haben sollte. Und ich wollte mich eben nur wegen dieser \"Low Priority\" Sperre erkundigen bzw wollte ich mich natürlich auch rechtfertigen, aber wenn dies (wie ich in diesem Thread erfahren habe) im \"Ranked\" strenger geahndet wird (auch wenn mein Computer dafür die Schuld trägt), nehme ich diese Strafe auch an. Also junger Mann, wirf mit deinen Vorurteilen nicht so in einem Thread herum, denn es könnten manche älter sein als wie du denkst. Und btw. es gibt tatsächlich technisches Versagen in Bezug auf Software oder Hardware, also weihe du mich nicht darin ein denn ich habe die Berufung darin junger Mann.","replies":[{"poster":"MeMyselfandBaal","date":"2015-11-06T10:22:06.439+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=iLivin,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=00010000000000010000,timestamp=2015-11-06T03:17:11.668+0000)\n>\n> Bevor du über mich urteilst lernst du mich bitte besser kennen, ich nutze garnichts aus...die 3 Spiele die ich nur \"Halb\" bzw in manchen Augen \"garnicht\" da war einfach nur ein Fehler meines Computers drinnen\n\nDu musst dich mal entscheiden... denn gestern hieß es noch: \"Ok, dieses Spiel habe ich noch sehr gut im kopf........ Denke nicht^^ Aber dennoch...kann sein das ich eventuell schlecht gespielt habe wei ich den \"neuen\" GP zum ersten mal gezockt habe....\" \nUnd wie ich dir erklärt habe, warst du in diesem Spiel mit 90%iger Sicherheit AFK. Das kann man an den Statistiken ablesen. Ob du das Spiel dabei verlassen hast oder nicht, spielt keine Rolle: Dein Champ stand eine ungewöhnlich lange Zeit in der Basis rum.\n\nHeute hattest du in dem Spiel, an dass du dich ach so genau erinnerst, technische Probleme, von denen gestern noch keine Rede war.","replies":[]},{"poster":"Waldschrat86","date":"2015-11-06T04:20:03.807+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=iLivin,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=00010000000000010000,timestamp=2015-11-06T03:17:11.668+0000)\n>\n> Bevor du über mich urteilst lernst du mich bitte besser kennen, ich nutze garnichts aus...die 3 Spiele die ich nur \"Halb\" bzw in manchen Augen \"garnicht\" da war einfach nur ein Fehler meines Computers drinnen, und ja es zählt natürlich als DC, aber was soll ich machen, ich nehme natürlich die Strafe an! \n\nNur leider reicht das never ever für 2 Strafen aus, die 3 für die 2. vlt. schon wegen der Vorbelastung. Übrigens nutzt keiner das aus, was ich gemutmaßt habe, aber viele würden es, würde die Toleranz offengelegt. Ich bezog mich dabei auch mehr auf die Aussage zur ersten Strafe, die du ja angblich ohne Abwesenheit erhalten haben willst.\n\n>Und achja...du redet von \"Strafe übersprungen\". Nein dies stimmt leider nicht, ich habe alle 5 Spiele mit einer 10 min Sperre gemacht und anschließend direkt eine 5x 20 min Sperre bekommen.\nIch rate dir nur eines, behandle mich nicht wie so einen 13-jährigen LoL Spieler, ich weiß sehr wohl wenn und wann ich etwas falsch gemacht haben sollte. \n\nJa und ich rate dir Texte gescheit zu lesen, ich schrieb nämlich es gibt noch eine 5MinQ, wenn du direkt mit 10MinQ gestartet bist, na was hast du dann gemacht? Ahja genau die erste Stufe=5MinQ übersprungen. Und wenn du gewusst hättest, was du wann wo wie oft falsch gemacht hast, hätte es diesen Thread gar nicht gebraucht.\n\n>und ich wollte mich eben nur wegen dieser \"Low Priority\" Sperre erkundigen bzw wollte ich mich natürlich auch rechtfertigen, aber wenn dies im \"Ranked\" strenger geahndet wird (auch wenn mein Computer dafür die Schuld trägt), nehme ich diese Strafe auch an.\n\nIst ja löblich, dennoch trägt daran nicht dein Computer Schuld, der hat höchstens das Fass zum Überlaufen gebracht.\n\n>Also junger Mann, wird mit deinen Vorurteilen nicht so in einem Thrwad herum, denn es könnten manche älter sein als wie du denkst. Und btw. es gibt tatsächlich technisches Versagen in Bezug auf Software oder Hardware, also weihe du mich nicht darin ein denn ich habe die Berufung darin junger Mann.\n\nNaja der einzige der hier gerade mit Alter um sich wirft bist ja wohl jetzt du. Gibt da ein tolles Sprichwort: Alter schützt vor Torheit nicht.\nAußerdem sind es eher Nachurteile denn Vorurteile, immerhin wurden ja schon zwei Urteile gefällt und im Bezug zum ersten steht ja immer noch nur die Aussage:\n\n>aber ich hatte gerade erst eine \" 5 Spiele 10 Minuten Priority\" obwohl ich kein Spiel AKF oder Verlassen habe.....\n\nDesweiteren hab ich nie verneint, dass es technisches Versagen gibt, sondern lediglich gesagt, dass es genau dafür eine Toleranzgrenze gibt und da du ja vor den 3 Spielen bzw. dem einen schon eine Strafe hattest, war die da schon erschöpft, das wird dir jeder, der Ahnung vom System hat, bestätigen, egal ob 13, fast 30 wie ich oder älter.\n\nUnd noch ein kleiner Tipp eines Jungspundes WinUpdate ist kein technisches Versagen, sondern ein Versäumnis, das kann man einstellen, dass es den Neustart und/oder Download erst nach Bestätigung beginnt. Ich hatte das nämlich auch schon, ganz ohne irgendwelche LB-Maßnahmen, ich bin ganz allein auf diese Idee gekommen bevor meine Toleranz aufgebraucht war.\n\nViel Erfolg beim Umsetzen der neuen Erkenntnisse.","replies":[]}]}]}]},{"poster":"GooCommitAlivent","date":"2015-11-06T21:41:25.880+0000","up_votes":1,"down_votes":7,"body":"\"du weißt schon, dass du nicht unbedingt das Spiel verlassen musst, um dem Leaverbuster negativ aufzufallen? Einfach in der Basis zu stehen, während du Zeitung liest/ 5 Minuten auf Klos gehst etc. pp reicht auch. Oder in der Basis Emotes spammen oder im Kreis laufen...?\"\n\nDein ernst? Also zur Erinnerung.. Das ist League of Legends.. ein Spiel.. ein verdammtes Spiel.. nicht Arbeit ich mein what the fuck? Im ernst? Aufs Klo gehen? Kurz am Handy was schreiben oder telln und 2 min afk sein? Das ist ein Spiel alter und wenn ein Spiel schon versucht mich mit Zeitstrafe zubedrohen damit ich nicht auf mein Handy antworte oder aufs Klo gehe weil das Spiel wichtiger ist dann sollte sich RIOT schon Gedanken darüber machen wie sie mit den Spielern umgehen!","replies":[{"poster":"GummibaumXYZ","date":"2015-11-06T22:02:15.963+0000","up_votes":3,"down_votes":0,"body":"Vielleicht solltest du dir Gedanken darum machen, wie du mit anderen Spielern umgehst. Denen gegenüber ist es nämlich nicht ok einfach mal minutenlang afk zu sein. Und das sind 4 in deinem Team (und 5 im Gegnerteam) denen du damit den Spielspaß kaputt machst.","replies":[{"poster":"Patter91","date":"2015-11-06T22:03:30.553+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=GummibaumXYZ,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=0001000000010000,timestamp=2015-11-06T22:02:15.963+0000)\n>\n> Vielleicht solltest du dir Gedanken darum machen, wie du mit anderen Spielern umgehst. Denen gegenüber ist es nämlich nicht ok einfach mal minutenlang afk zu sein. Und das sind 4 in deinem Team (und 5 im Gegnerteam) denen du damit den Spielspaß kaputt machst.\n\nAber aber aber... seine überaus wichtigen Handynachrichten, die keine 20 Minuten warten können! Er ist doch so überaus wichtig, wenn er nicht sofort reagiert, bricht die Welt zusammen!","replies":[]},{"poster":"GooCommitAlivent","date":"2015-11-09T22:12:42.982+0000","up_votes":1,"down_votes":4,"body":"War klar.. da schlägt mal wieder die \"ach so tolle LoL Community wieder zu\".. kein Wunder das jeder sagt, dass LoL die dümmste Community hat bzw. schlechteste. Also.. nochmal für die die mal jeden Scheiss übertreiben wollen.. aufs Klo gehen.. was 1 Minute dauert.. ich hab noch nie jemanden gesehen der dumm genug ist um sich aufzuregen weil der Sup oder Jungler für eine einzige Minute Afk war. Ich weiß nicht ob du so einer bist aber ist nicht mein Problem. Zum Glück hab ich nicht solche Leute gesehen. Ich war einmal 4 Minuten AFK weil mein Internert abgestürzt ist und als ich rein ging hab ich mich entschuldigt und was hat mein Team gesagt? Kein Problem kann passieren ist eh ein normal oder chill ist eh nur ein Game. \n\nDie LoL Community nimmt wirklich das Spiel einfach viel viel viel zu ernst...\n\nund weißt du was traurig ist? Früher war das nicht so..","replies":[]}]},{"poster":"Der Großmugister","date":"2015-11-07T07:57:46.242+0000","up_votes":4,"down_votes":0,"body":"Wenn es ein Singleplayer wäre, hättest du Recht.\nDa es ein Moba ist, hat es aber enfach was mit Höflichkeit gegenüber deinen Mitspielern zutun, vor Allem, da der Leaverbuster sich nciht einschaltet, wenn du in einem von 50 Spielen mal spontan weg musst, sondern wenn du andauernd afk bist.\nDas ist einfach eine Frage des Respekts deinen Mitspielern gegenüber.","replies":[]},{"poster":"Waldschrat86","date":"2015-11-07T05:19:01.203+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kashîma,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=000100000001,timestamp=2015-11-06T21:41:25.880+0000)\n>\n> \"du weißt schon, dass du nicht unbedingt das Spiel verlassen musst, um dem Leaverbuster negativ aufzufallen? Einfach in der Basis zu stehen, während du Zeitung liest/ 5 Minuten auf Klos gehst etc. pp reicht auch. Oder in der Basis Emotes spammen oder im Kreis laufen...?\"\n> \n> Dein ernst? Also zur Erinnerung.. Das ist League of Legends.. ein Spiel.. ein verdammtes Spiel.. nicht Arbeit ich mein what the fuck? Im ernst? Aufs Klo gehen? Kurz am Handy was schreiben oder telln und 2 min afk sein? Das ist ein Spiel alter und wenn ein Spiel schon versucht mich mit Zeitstrafe zubedrohen damit ich nicht auf mein Handy antworte oder aufs Klo gehe weil das Spiel wichtiger ist dann sollte sich RIOT schon Gedanken darüber machen wie sie mit den Spielern umgehen!\n\nTja und Spiele haben Regeln, sogar Klassiker wie Verstecken oder Fangen. Ud wenn man die bricht gibt es n Rüffel oder Ausschluss.","replies":[{"poster":"GooCommitAlivent","date":"2015-11-09T22:14:09.004+0000","up_votes":1,"down_votes":1,"body":"Im Verstecken spielst du auch mit sozialen Leuten wo du auch mal aufs Klo darfst ;)","replies":[{"poster":"Waldschrat86","date":"2015-11-09T22:55:29.975+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kashîma,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=00010000000100020000,timestamp=2015-11-09T22:14:09.004+0000)\n>\n> Im Verstecken spielst du auch mit sozialen Leuten wo du auch mal aufs Klo darfst ;)\n\nDann ist aber dein Versteck für die Katz oder eingenässt oder, was wiederum vergleichbar mit dem AFK in LoL wäre, man ist der Sucher und statt zu suchen geht man halt mal einen abseilen und lässt die Leute darben :D","replies":[{"poster":"GooCommitAlivent","date":"2015-11-10T18:26:45.823+0000","up_votes":1,"down_votes":1,"body":"Die Leute haben aber nichts dagegen weil sie im Gegensatz zu Riot einsehen das Pissen etwas wichtiges ist für deine Gesundheit :D","replies":[]}]}]}]},{"poster":"MeMyselfandBaal","date":"2015-11-06T23:24:42.251+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kashîma,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=000100000001,timestamp=2015-11-06T21:41:25.880+0000)\n> Dein ernst? Also zur Erinnerung.. Das ist League of Legends.. ein Spiel.. ein verdammtes Spiel.. nicht Arbeit ich mein what the fuck? Im ernst? Aufs Klo gehen? Kurz am Handy was schreiben oder telln und 2 min afk sein? Das ist ein Spiel alter und wenn ein Spiel schon versucht mich mit Zeitstrafe zubedrohen damit ich nicht auf mein Handy antworte oder aufs Klo gehe weil das Spiel wichtiger ist dann sollte sich RIOT schon Gedanken darüber machen wie sie mit den Spielern umgehen!\n\nDu hast nicht verstanden, worauf ich hinaus wolllte... das er bewusst sagt, dass er kein Bock mehr auf das Spiel hat, sich den Spiegel nimmt und auf Klo verschwindet um diesen zu lesen, während seine 4 Teammates versuchen das Spiel zu drehen, geht halt nicht. Das meinte ich mit auf Klo gehen.\n\nVon 2 Min hat doch keiner was gesagt... es kriegt auch keiner einer Strafe, wenn ihm die Natur so kommt.","replies":[]}]}]}]},{"poster":"clair de lune289","date":"2015-11-06T00:58:19.976+0000","up_votes":3,"down_votes":0,"body":"das 0/2/0 ganplan game deutet sehr star auf afk/afk farm/spiel verlassen hin.\n29 cs , level 7 (1 level niedriger als der support) in 23 min?","replies":[]},{"poster":"Preâcher","date":"2015-11-06T02:25:38.490+0000","up_votes":1,"down_votes":4,"body":"Ich spiele ja diese Spiele immer zu Ende!! Nur wenn ein Windows Update oder andres zwecks meinem Computer zwischen kommen, ist das nicht so toll :(....Ok ich nehme natürlich die Strafe an ohne mich weiter zu rechtfertigen.....entschuldiung an die Spieler die mit mir in einem Team waren! :)","replies":[{"poster":"Veezey","date":"2015-11-06T17:59:00.306+0000","up_votes":1,"down_votes":0,"body":"Man kann das automatische updaten auch deaktivieren ;)","replies":[{"poster":"Waldschrat86","date":"2015-11-06T18:40:15.674+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Veezey,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=00030000,timestamp=2015-11-06T17:59:00.306+0000)\n>\n> Man kann das automatische updaten auch deaktivieren ;)\n\nStöre seine Kreise nicht\n\n> Und btw. es gibt tatsächlich technisches Versagen in Bezug auf Software oder Hardware, also weihe du mich nicht darin ein denn ich habe die Berufung darin junger Mann.\n\nIch feier den Satz immer noch, hat beinahe was prophetisches :D","replies":[{"poster":"Veezey","date":"2015-11-06T18:41:56.278+0000","up_votes":1,"down_votes":0,"body":"Sollte nur ein gut gemeinter Tipp sein. Das hat mich auch mal genervt :D","replies":[{"poster":"Waldschrat86","date":"2015-11-06T18:53:49.884+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Veezey,realm=EUW,application-id=KYnfKGf0,discussion-id=QmksqoIs,comment-id=0003000000000000,timestamp=2015-11-06T18:41:56.278+0000)\n>\n> Sollte nur ein gut gemeinter Tipp sein. Das hat mich auch mal genervt :D\n\nDen Tipp bzw. etwas ähnliches hab ich ihm ja auch bereits empfohlen, denn mir ist das ja auch nicht fremd :D","replies":[]}]}]}]}]},{"poster":"Lagbeard","date":"2015-11-07T11:12:04.467+0000","up_votes":1,"down_votes":0,"body":"RIOT hält sich auch hier Möglichkeiten offen. Irgendwo in den Tiefen der AGB´s steht sinngemäß, dass jeder Spieler für seine technischen Vorraussetzungen selbst verantwortlich ist. Da du diesen AGB zugesimmt hast (vermutlich ohne sie zu lesen), hast du damit bestätigt, dass du in der Lage bist, ohne technische Schwierigkeiten Spielen zu können. Sollte dies nciht der Fall sein, hast du die AGB´s verletzt und RIOT ist (nur rechtlich, moralisch liegt der Fall anders) auf der sicheren Seite dich auch nach einem Vorfall zu bestrafen. Dir wurden schließlich nirgends freie DC´s zugesichert.\n\nMan kann davon halten was man will, aber der Fall liegt nun mal so, dass das Vergehen an sich zählt, nicht die Anzahl der Vergehen, wenn RIOT es komplett darauf anlegt, dich zu bestrafen. Was aber nur selten der Fall ist, man möchte die Spieler ja eigentlich behalten :D","replies":[{"poster":"GooCommitAlivent","date":"2015-11-09T22:15:58.485+0000","up_votes":1,"down_votes":1,"body":"Tut mir leid.. aber dann sollte niemand die AGB akzeptieren. NIEMAND ist verantwortlich auf seine technischen Probleme. Alles kann einfach so passieren.","replies":[{"poster":"Lagbeard","date":"2015-11-10T17:46:38.637+0000","up_votes":1,"down_votes":0,"body":"Offensichtlich hast du es getan.","replies":[{"poster":"GooCommitAlivent","date":"2015-11-10T18:24:57.419+0000","up_votes":1,"down_votes":1,"body":"Tja ich versuche Menschlichkeit zu bewahren.","replies":[{"poster":"Lagbeard","date":"2015-11-11T19:34:47.617+0000","up_votes":1,"down_votes":0,"body":"Ich hab keinerlei Meinung geäußert. Ich hab nur festgestellt, dass RIOT theoretisch rechtlich abgesichert wäre, sollte es da Zweifel geben. Das ist eine Tatsache, und ob ich das menschlich finde oder nicht spielt hier keine Rolle. Ich hab die AGB´s nicht geschrieben, nur akzeptiert. Und du auch, also warst du ja offensichtlich einverstanden damit ;)","replies":[]}]}]}]}]},{"poster":"Powerjen","date":"2015-11-06T11:48:32.309+0000","up_votes":1,"down_votes":0,"body":"> DAS GIBTS NICHT!!! BITTE EIN GM oder SUPP soll da nachforschen!!!!! \n\nDann schreib auch den Support an. Kann ja nicht soo schwer sein. Du rennst ja auch nicht zur Polizei, wenn Du Hunger hast.","replies":[]},{"poster":"i had fun once","date":"2015-11-06T01:25:32.355+0000","up_votes":1,"down_votes":0,"body":"Das System tritt in Kraft, wenn du öfters mal untätig bist. AFK, DC was auch immer. Das System erkennt auch wenn du nur dumm rumstehst, aber noch eingeloggt bist. Das System bewertet dich Härter je öfters du so etwas machst.","replies":[]}]}