{"poster":"iTzFinnHD","date":"2015-06-21T17:43:06.432+0000","title":"Questi drophack cominciano a rompere...","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"&egrave; la decima volta che perdo partite perfette per colpa dei drophack... mi hanno stufato! e ogni volta mi viene in mente una domanda, MA NON LI AVEVATE TOLTI?!?!","replies":[{"poster":"FaFFe","date":"2015-06-21T18:05:28.771+0000","up_votes":2,"down_votes":0,"body":"Diciamo che bloccare completamente i drophack è molto difficile per la natura stessa dell'attacco. Esso si basa sull'invio di richieste di connessioni perfettamente naturali per un server, sarebbe quindi molto complicato differenziare le richieste normali da quelle maligne.\nTrovare i fautori dell'attacco è al contempo molto complicato in quanto la partita a cui partecipavano semplicemente sparisce nel nulla rendendo così impossibile risalire ai giocatori.\nInfine, essendo sul server ospitate più partite, è molto probabile che l'attacco sia stato eseguito da un player di un'altra partita proprio perchè gli effetti del drophack sono riscontrabili su tutti match istanziati sulla macchina.","replies":[{"poster":"kirchhoff","date":"2015-06-21T21:57:36.598+0000","up_votes":1,"down_votes":0,"body":"^\nse trovi una soluzione al ddos penso che un lavoro a paga alta te lo trovano istantaneamente\nil problema sta nella natura della rete\nnel momento che capisci che un pacchetto è da scartare è troppo tardi, ormai è arrivato ed ha occupato banda\nse ne arrivano milioni insieme cosa ci puoi fare?","replies":[{"poster":"DeDiam0nd","date":"2015-06-22T10:58:10.245+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=kirchhoff,realm=EUW,application-id=MJVj50Jw,discussion-id=JlEKiN6d,comment-id=00010001,timestamp=2015-06-21T21:57:36.598+0000)\n>\n> ^\n> se trovi una soluzione al ddos penso che un lavoro a paga alta te lo trovano istantaneamente\n> il problema sta nella natura della rete\n> nel momento che capisci che un pacchetto è da scartare è troppo tardi, ormai è arrivato ed ha occupato banda\n> se ne arrivano milioni insieme cosa ci puoi fare?\n\nguarda che esistono sistemi antiddos per mitigare il ddos...di solito le attua il Services provider se paghi il servizio.\nDove lavoro io abbiamo questo sistema.","replies":[{"poster":"FaFFe","date":"2015-06-22T11:38:08.680+0000","up_votes":1,"down_votes":0,"body":"Non ne sono sicuro completamente ma credo che certi sistemi si basino più sulla mitigazione dell'attacco utilizzando altri server o sul ban di determinati indrizi ip ritenuti malvagi. \nQuesti stratagemmi \"semplici\" non credo riescano a proteggere da attacchi provenienti da botnet estese composte da centinaia di pc.","replies":[{"poster":"DeDiam0nd","date":"2015-06-22T11:47:12.450+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FaFFe,realm=EUW,application-id=MJVj50Jw,discussion-id=JlEKiN6d,comment-id=0001000100000000,timestamp=2015-06-22T11:38:08.680+0000)\n>\n> Non ne sono sicuro completamente ma credo che certi sistemi si basino più sulla mitigazione dell'attacco utilizzando altri server o sul ban di determinati indrizi ip ritenuti malvagi. \n> Questi stratagemmi \"semplici\" non credo riescano a proteggere da attacchi provenienti da botnet estese composte da centinaia di pc.\n\nSi bhe non è che puoi bloccarlo completamente ma ci sono certi servizi che appunto mitigano facendo in modo che non ti blocchino il servizio.","replies":[]}]}]}]},{"poster":"Shınko","date":"2015-06-21T18:19:44.693+0000","up_votes":1,"down_votes":0,"body":"Io ti posso solo dire che in quella partita mi hanno reportato per comportamento negativo e mi hanno accusato di essere bannato solo perchè avevano gli screen di non so cosa (che alla fine io avevo lo screen di questo che aveva fatto riprendere la partita) e alla fine ho pensato che erano si i server, ma loro non hanno ragionato e dicono ancora che sono io, volevo mandargli lo screen, ma non accettavano la richiesta che gli ho mandato.  Alla fine comunque ci rimetto sempre io.","replies":[{"poster":"FaFFe","date":"2015-06-21T18:24:37.219+0000","up_votes":2,"down_votes":0,"body":"Il \"nome has unpaused the game\" è irrilevante, non indica chi ha eseguito il drophack.\nComunque non credo che ti banneranno, devono avere prove concrete per questo...","replies":[{"poster":"Shınko","date":"2015-06-21T18:28:51.863+0000","up_votes":1,"down_votes":0,"body":"Speriamo proprio, loro insistevano sul dire che ero perchè probabilmente gli era uscito quel messaggio, però non volevano ragionare, spero che non mi bannino per quel che hai detto e grazie per aver partecipato alla conversazione.","replies":[]}]}]}]},{"poster":"Shınko","date":"2015-06-21T17:56:18.593+0000","up_votes":2,"down_votes":0,"body":"Allora, sono suo amico ed ero nella sua stessa partita e mentre la partita si era fermata appare in chat questo messaggio: Morkso ha fatto riprendere il gioco. Ho scritto in all informazioni e dicevano che non erano loro e che eravamo noi, non ci stavamo più capendo niente. Spiegazioni? Mi sono stufato!","replies":[{"poster":"Sorcio84","date":"2015-06-22T08:49:51.135+0000","up_votes":1,"down_votes":0,"body":"Trattandpsi di un hack , potrebbe aver generato pure quella riga cotando un giocatore a caso, non è detyo che sia lui, ma la riot comunque **deve investigare** perchè è anche nel suo interesse economico.","replies":[]},{"poster":"Shınko","date":"2015-06-21T18:13:00.510+0000","up_votes":1,"down_votes":0,"body":"Alla fine mi hanno pure reportato perchè pensavano che ero io... E mi hanno minacciato di essere bannato... Guarda se non mi danno l'icona festa in piscina me ne vado via guarda, non so proprio cosa dire... Dicevano che avevano gli screen, ma come ho postato prima pure io gli avevo. Odio le persone che fanno cosi, anche tanto.","replies":[]}]},{"poster":"DeDiam0nd","date":"2015-06-22T10:57:03.272+0000","up_votes":1,"down_votes":0,"body":"Io ieri stavo giocando una ranked e la stavo vincendo..ad un certo punto lag e partita fantasma..\nLa partita non esisteva più quindi possibile vittoria andata a farsi benedire...il fatto è che nessuno dei miei amici che giocavano altre partite hanno avuto problemi..quindi dubito sia stato un problema del server.\nL'unica cosa che mi rincuora e che posso anche perdere una partita ma chi vince con i drophack prima o poi scenderà nell'oblio piu totale,...","replies":[]}]}