{"poster":"serfar","date":"2016-11-10T14:17:20.505+0000","title":"que No vuelva el reclutamiento!","subforum":"Charlas Generales","up_votes":8,"down_votes":31,"body":"si, no estoy loco, es mi primera temporada y jugue normales como 600 partidas y despues jugue ranked... rompieron las bolas con la famosa cola dinamica para q la saquen y vuelva la anterior y ahora rompen con esto, la cola nueva en ranked tendra 2 partes, una dinamica y otra solo q duo, como querian, mas la normal ya son 3 colas, yo no quiero esperar 14 minutos para empezar una partida... piensen un poco antes de seguir todos algo q no tiene mucho sentido.. algo hay que sacrificar para q las rankeds sean decentes... saludos y es mi opinion, si no saben respetar lo q piensan los demas o alguien q piensa distinto abstenganse de comentar...","replies":[{"poster":"Rebkans","date":"2016-11-10T14:24:07.992+0000","up_votes":4,"down_votes":0,"body":"¿Y? ¿Que tiene que ver que haya 3, 4 o 5 colas de emparejamiento?\n\nBlind pick es un nido de flamers, trolls, instalockers y no hace mas que generar conflictos desde antes que empiece la partida. Una cola, deberia ser esa y dejar el modo Reclutamiento, el cual se agilizaria y cada uno iria a la linea que quisiera.","replies":[{"poster":"LeonardoSB","date":"2016-11-10T14:34:19.498+0000","up_votes":1,"down_votes":5,"body":"la cola no tiene la culpa de ser un nido de todo lo que dijiste, es que el juego es así, estan en las colas dynamicas, las soloQ, blind pick, aram, draft, estan en todos lados, pasa que blind pick es el mas usado y te das cuenta rapido.\n\npero no estás esquivando todo lo que mencionaste en la cola de draft, es más, te podria decir que se incrementa, ya que o uno se sacrifica para ir de soporte, o estan 3 horas esperando a que un main soporte vaya y tire el rol para posteriormente flamearlo.","replies":[{"poster":"Rebkans","date":"2016-11-10T14:46:54.686+0000","up_votes":3,"down_votes":0,"body":"Tanto en Draft, como en Aram, bosque retorcido, Dominion,  o cualquiera que sea el modo, nunca vas a leer el tipico \"mid o trolleo\", \"voy support garen\" y gracias a eso empiezan los insultos ya en el champ selection.  Ya  durante la partida, es evidente que  te puede tocar la misma gente. La diferencia es que en draft te ahorras una pelea estupida por la linea y podes  jugar mas tranquilo.\nEn el modo draft casi nunca se ve gente peleando por una linea comparado con las Blind pick ya que siempre  te toca una de las dos lineas que elegiste previamente y en cuanto la demora, puede tardar hata un promedio de 5 minutos nomas.\n\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/3yA2TU5w-bitacora-propia-del-blind-pick-real-pero-gracioso Esto no se veia en Draft practicamente","replies":[{"poster":"LeonardoSB","date":"2016-11-10T15:23:36.390+0000","up_votes":1,"down_votes":0,"body":"pues yo lo he leido en clasificatorias, que tiene el formato draft y soy gold...","replies":[]}]}]},{"poster":"serfar","date":"2016-11-10T15:18:44.888+0000","up_votes":1,"down_votes":0,"body":"tiene q ver en la espera q tenes para poder jugar... entre otras cosas!\ny hay mas troll flamers y pelotudos q cagan el juego en ranked q en normal con eso te digo todo! hay en todos lados","replies":[{"poster":"Rebkans","date":"2016-11-10T15:38:11.123+0000","up_votes":1,"down_votes":0,"body":"La espera es de 5 minutos como maximo, aunque rara vez se llega esperar ese tiempo. Por lo general suele tardar 3 minutos.\n\n > hay mas troll flamers y pelotudos q cagan el juego en ranked q en normal con eso te digo todo\n\nNo, no me decis nada ya que estas comparando dos modos de juego diferentes.\nSi queres ver en donde hay mas trolls, entonces que habiliten el modo blind pick  ranked y compararlas con las rankeds en el modo draft.\n\nTal como pasaba en la S3, habian mas trolls en las rankeds que en las normales (ambas blind picks) y por eso fue que pusieron el creador de equipos y posteriormente, el modo reclutamiento.","replies":[{"poster":"serfar","date":"2016-11-10T15:46:45.142+0000","up_votes":1,"down_votes":0,"body":"puede ser, pero por eso me baso en el tiempo de espera, si dejas reclutamiento mas normal mas ranked mas la otra ranked mas los modos aram etc etc no hay tanta gente en nuestro server como para todo eso! y un reclutamiento no te garantiza una buena partida.. algo hay q sacrificar...las normales no te gustan, pero la mayoria de la gente juega eso...no las van a sacar!","replies":[{"poster":"Rebkans","date":"2016-11-11T02:09:21.541+0000","up_votes":1,"down_votes":0,"body":"Yo no digo que saquen las normales, yo digo que si tienen que sacar una cola, que saquen la blind pick.\nLa idea es evitar la toxicidad innecesaria, no fomentarla.\nYo tambien apenas tiempo para jugar, y cuando lo hago, no hay ganas de ponerse a discutir con alguien que te quiere robar la linea y encima te amenaza con trollear.\n\nEsta decision de Riot es terrible, volvemos para atras y tiran a la basura los avances que se logró en la S6 y la comunidad en todas las regiones se lo está reclamando a Riot. No es que un puñado de 3 gatos se anda quejando.\n\nA Riot hay que felicitarlo cuando hace las cosas bien y reclamarle cuando se manda una macana.","replies":[]},{"poster":"Dildo de Moria","date":"2016-11-10T17:19:15.610+0000","up_votes":1,"down_votes":0,"body":"Y qué tal NO poner la \"cola flexible\" que es una DynamicQ con otro nombre y que nadie quiere que pongan y dejar el modo reclutamiento que a muchos nos gusta y nos parece la forma más organizada y saludable de llevar una buena experiencia al menos antes de la partida?","replies":[{"poster":"serfar","date":"2016-11-10T17:57:49.136+0000","up_votes":1,"down_votes":0,"body":"y esa no es mala idea... pasa q hay gente q quiere rankear con amigos supongo...","replies":[]}]}]}]}]}]},{"poster":"LeonardoSB","date":"2016-11-10T14:21:07.775+0000","up_votes":1,"down_votes":9,"body":"POSTA, EN MIS TIEMPO SE INSTALOCKEABA COMO TODO MACHO PECHO PELUO QUE ERAS.\n\naparte o tenias una buena pc, o eras el designado soporte. y si no les gusta todo lo que tienen que hacer es comprarse una pc nueva y listorti :P.\n(o trolear de soporte)\n\n\nyo creo que las normales blind pick hay mas competitividad que en las de draft. primero porque vas a pickear tu mejor campeon, o si quieres practicar con uno te lo vas a pensar 2 veces por si te encontras con un mirror lane (cosa que es la mejor puta cosa que te puede pasar) probablemente te rompa el ano.\n\npasa que bueno, como no les gustan a los ratitas que puedan romperle el ano, sucede esto de las quejas.","replies":[{"poster":"Dildo de Moria","date":"2016-11-10T17:24:07.316+0000","up_votes":1,"down_votes":0,"body":"O podes optar por empezar seleccionando la linea que querés y ahorrarte lo de comprarte una compu y encima poder hacer una selección más táctica pudiendo bloquear campeones que puedan arruinarte la composición y la estrategia. Además de ahorrarte el \"yo gané mid\" \"troleo ps\"","replies":[{"poster":"LeonardoSB","date":"2016-11-10T17:36:39.022+0000","up_votes":1,"down_votes":0,"body":"osea la solucion para pobres :v.\n\npara eso podrian tomarse el juego mas seriamente e intentar jugar rankeds ;)","replies":[{"poster":"Dildo de Moria","date":"2016-11-10T19:45:12.349+0000","up_votes":1,"down_votes":0,"body":"Pero y el que no quiere jugar ranked? El Draft era lo más cercano a ranked, hay que obligarlos a jugar ranked?","replies":[{"poster":"serfar","date":"2016-11-10T20:57:43.201+0000","up_votes":2,"down_votes":0,"body":"esto hay que hacer y listo chau problem!!\nAuroraExecution (LATS)\n- about 22 hours ago\n\nJueguen ranked flexible. Si quieren rankear mas \"seriamente\" se meten al Solo Q.\n\nSi parten de la base que no les interesa rankear, la cola flexible les viene bien.\n\nA mi particularmente, me interesa rankear \"seriamenten\" en Solo Q, asi que la cola flexible la voy a usar para practicar.","replies":[]},{"poster":"LeonardoSB","date":"2016-11-11T18:58:57.767+0000","up_votes":1,"down_votes":0,"body":"la cola flexible no es ranked... es otra cola que esta entre las normales draft pick y las rankeds con draft pick.","replies":[]}]}]}]},{"poster":"serfar","date":"2016-11-10T15:24:18.025+0000","up_votes":1,"down_votes":2,"body":"coincido","replies":[]}]},{"poster":"Mazoku","date":"2016-11-10T14:21:27.365+0000","up_votes":2,"down_votes":0,"body":">  si no saben respetar lo q piensan los demas o alguien q piensa distinto abstenganse de comentar...\n\nNo es algo contradictorio esto considerando que estas en un foro publico?","replies":[]},{"poster":"Runth","date":"2016-11-10T21:03:20.751+0000","up_votes":1,"down_votes":0,"body":"-1 por ser un chupamedias como espinita\n\nhttps://www.youtube.com/watch?v=58enUp3W7qc&spfreload=5","replies":[]},{"poster":"Dildo de Moria","date":"2016-11-10T17:21:13.122+0000","up_votes":1,"down_votes":0,"body":"Decis que se respete la opinión y tomas a los que no piensan como vos como \"rompehuevos\" y que se quejan por algo sin sentido.","replies":[{"poster":"serfar","date":"2016-11-10T17:59:52.583+0000","up_votes":1,"down_votes":0,"body":"es una forma de hablar, hacer 544523 posts con lo mismo es tb romper los huevos a los q queremos leer otras cosas del juego...","replies":[{"poster":"Dildo de Moria","date":"2016-11-10T19:47:26.543+0000","up_votes":1,"down_votes":0,"body":"Si la mayoría de la gente se queja (incluyendo Na y Br) es por algo.","replies":[]}]}]},{"poster":"ArqueroEbrio","date":"2016-11-10T15:03:07.933+0000","up_votes":1,"down_votes":0,"body":"Vienes a cosechar negativos verdad?","replies":[{"poster":"serfar","date":"2016-11-10T15:19:54.300+0000","up_votes":1,"down_votes":1,"body":"es mi opinion! mas q nada basada en el  tiempo de espera, yo no puedo jugar tanto por dia y me gusta empezar rapido...","replies":[{"poster":"Dildo de Moria","date":"2016-11-10T17:21:45.660+0000","up_votes":1,"down_votes":0,"body":"No podes esperar 3 minutos?","replies":[{"poster":"serfar","date":"2016-11-10T18:02:12.188+0000","up_votes":1,"down_votes":0,"body":"3 si, 8 10 o 14 no, pq yo trabajo y juego una o dos con suerte 3 partidas los dias q juego y si a esos minutos de espera le sumas la gente q dodgea, los remake, etc etc etc a veces pasa media hora par ajugar una partida.. eso para mi le quita gente al juego...cuando un juego es popular y esta en apogeo todo va bien, pero nada dura para siempre y cuando el juego ya no tenga la gente de hoy la cosa va a cambiar...","replies":[{"poster":"Dildo de Moria","date":"2016-11-10T19:46:44.068+0000","up_votes":1,"down_votes":0,"body":"Y la solución es dejar el modo más tóxico, claro.","replies":[]}]}]}]}]},{"poster":"serfar","date":"2016-11-10T17:05:00.741+0000","up_votes":1,"down_votes":0,"body":"esto hay que hacer y listo chau problem!! \nAuroraExecution (LATS)\n - about 22 hours ago\n\nJueguen ranked flexible. Si quieren rankear mas \"seriamente\" se meten al Solo Q.\n\nSi parten de la base que no les interesa rankear, la cola flexible les viene bien.\n\nA mi particularmente, me interesa rankear \"seriamenten\" en Solo Q, asi que la cola flexible la voy a usar para practicar.","replies":[]},{"poster":"MLCPWhatsApp","date":"2016-11-10T14:24:55.889+0000","up_votes":1,"down_votes":0,"body":"+1 pa... los q rankeamos 24/7, esto es como un urf para nosotros, nos desestresamos...","replies":[]},{"poster":"Mecha Sétt","date":"2016-11-10T14:26:16.006+0000","up_votes":1,"down_votes":1,"body":"Tranquilos compadres, (como dice mi amigo TOBIAS, el huaso fate). Es una opinion y deben respetarla. AL igual que otros respetan la suya.","replies":[]}]}