{"poster":"MyDogHasAut1sm","date":"2016-08-25T15:54:46.959+0000","title":"Yorick e l'AI dei minion","subforum":"Campioni e gameplay","up_votes":2,"down_votes":1,"body":"Sarebbe molto bello se la riot migliorasse l&#039;AI dei minion di yorick. :c\r\nQuello che mi piacerebbe avere, giocando yorick, &egrave; la possibilit&agrave; di controllare i minion a tuo piacimento dentro un certo range e magari lasciare il controllo dei minion evocati dalla R alla vergine stessa, a sua volta controllata da te impartendo comandi.\r\nUna piccola parte di questo tipo di gameplay si ha effettivamente quando si gioca yorick jungle, finch&egrave; non attraversi una  lane e per qualche motivo i minion ti abbandonano e muoiono perch&egrave; escono dal range della tua passiva.","replies":[{"poster":"Oinegue","date":"2016-08-25T17:03:07.743+0000","up_votes":4,"down_votes":0,"body":"\"In sostanza, è un personaggio che mette alla prova le vostre capacità di adattamento alle azioni prevedibili dell'IA.” dice Solcrushed. “Gli Erranti della Nebbia sono degli alleati IA abbastanza semplici. Proprio come un pastore che guida il suo gregge di pecore.\"\n\n\nHanno deciso che le IA fetenti facciano parte dell'identità di Yorick. Dubito che faranno un passo indietro :(","replies":[]},{"poster":"HaIIeIujah","date":"2016-08-25T16:07:39.510+0000","up_votes":3,"down_votes":0,"body":"Beh, il fatto che i minion entrino in lane è specificato dalla passiva stessa. L'idea è che in jungle ti seguono normalmente e puoi usarli tranquillamente per tankare i campi, ma in lane si comportano come melee minions piu' offensivi. Puoi comunque dirigerli un minimo con l E, nello stesso modo in cui Malz dirige i suoi.","replies":[]},{"poster":"ilmejoop","date":"2016-08-26T11:50:35.075+0000","up_votes":2,"down_votes":0,"body":"E fatto apposta sennò la E sarebbe inutile.\nIn sostanza ora come ora se manchi la E sei fottuto","replies":[]},{"poster":"oroora6","date":"2016-08-25T16:45:24.105+0000","up_votes":1,"down_votes":0,"body":"credo sia fatto aposta, puoi guidare la maiden ma i piccolini possono essere guidati o solo dalla maiden o usando la e, credo sia per rendere un pochettino più difficile per yorick il pokkare il champ nemico come accadeva prima del rework","replies":[{"poster":"MyDogHasAut1sm","date":"2016-08-25T16:47:14.948+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=oroora6,realm=EUW,application-id=cAOZwaUi,discussion-id=E6N6lJls,comment-id=0003,timestamp=2016-08-25T16:45:24.105+0000)\n>\n> credo sia fatto aposta, puoi guidare la maiden ma i piccolini possono essere guidati o solo dalla maiden o usando la e, credo sia per rendere un pochettino più difficile per yorick il pokkare il champ nemico come accadeva prima del rework\n\nla vergine non puo essere guidata, la molli e fa quello che vuole apparte focussare i champ che ti attaccano se ci stai vicino","replies":[{"poster":"oroora6","date":"2016-08-25T16:48:20.543+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xPhantom98x,realm=EUW,application-id=cAOZwaUi,discussion-id=E6N6lJls,comment-id=00030000,timestamp=2016-08-25T16:47:14.948+0000)\n>\n> la vergine non puo essere guidata, la molli e fa quello che vuole apparte focussare i champ che ti attaccano se ci stai vicino\n\na me pareva che con il classico alt+ destro si potesse muovere, comunque la cosa buona della maiden è che con yorick puoi andare a farti i giretti mentre lei pusha la lane","replies":[{"poster":"MyDogHasAut1sm","date":"2016-08-25T16:52:32.320+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=oroora6,realm=EUW,application-id=cAOZwaUi,discussion-id=E6N6lJls,comment-id=000300000000,timestamp=2016-08-25T16:48:20.543+0000)\n>\n> a me pareva che con il classico alt+ destro si potesse muovere, comunque la cosa buona della maiden è che con yorick puoi andare a farti i giretti mentre lei pusha la lane\n\nla vergine ha l'AI simile ai minion, quindi può benissimo tankarsi la torre per prima e morirci in 4 colpi","replies":[{"poster":"oroora6","date":"2016-08-25T16:54:29.723+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=xPhantom98x,realm=EUW,application-id=cAOZwaUi,discussion-id=E6N6lJls,comment-id=0003000000000000,timestamp=2016-08-25T16:52:32.320+0000)\n>\n> la vergine ha l&#x27;AI simile ai minion, quindi può benissimo tankarsi la torre per prima e morirci in 4 colpi\n\nallora credo sia il momento di imparare a non missare la e >->","replies":[]}]}]}]}]},{"poster":"zYaichi","date":"2016-08-25T16:26:38.411+0000","up_votes":2,"down_votes":0,"body":"Non ho provato yorick ma è rimasto un bullo da lane e uno splitpusher,più che un juggernaut AD secondo me quindi è normale che non si possano controllare minion di yorick in lane sarebbe unhealthy per l'avversario .Anche se i minion focussano i minion di yorick,basterebbe portarli nel bush per far perdere l'aggro e potresti lasciarli lì finche l'avversario non pusha e a quel punto freezare la lane e abusare dei minion bullando l'avversario","replies":[]},{"poster":"MyDogHasAut1sm","date":"2016-08-25T16:44:15.822+0000","up_votes":1,"down_votes":0,"body":"In effetti il completo controllo dei minion puo rivelarsi un problema, magari averceli vicino come i ragnetti di elise puo essere fattibile? Quando giocherò yorick vorrei almeno che i minion seguano chi gli ha creati, non io che seguo i minion :/","replies":[{"poster":"Oinegue","date":"2016-08-26T11:52:32.486+0000","up_votes":1,"down_votes":0,"body":"il mio rework era così http://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/Erlbn07E-yorick-rework-idee\n\nmi sarebbe piaciuto tanto fatto così (escludendo il mio schizzo orrendo)","replies":[]}]}]}