{"poster":"uthorion","date":"2017-06-16T04:10:04.961+0000","title":"caos vs luz","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"diganme, ustedes porque eligieron cada bando? yo elegi caos no por yasuo, si no por lo que predica: es la misma pelea que kayle y morgana, morgana siguio sus ideales y por eso fue desterrada, los malvados no necesariamente son los verdaderos villanos","replies":[{"poster":"Xeport","date":"2017-06-16T04:20:10.106+0000","up_votes":2,"down_votes":0,"body":"Wow comparto tu pensamiento yo creo que en cierto modo yasuo tiene razón ya que seguir la luz no es mas de controlar de otras formas a la gente. Eso y que yasuo me dijo que tenían calaveritas de azúcar {{sticker:slayer-jinx-catface}}","replies":[{"poster":"uthorion","date":"2017-06-16T05:19:17.259+0000","up_votes":1,"down_votes":0,"body":"calaveritas de azúcar khe","replies":[{"poster":"Xeport","date":"2017-06-16T15:17:27.117+0000","up_votes":2,"down_votes":0,"body":"XDDDD si ves en las frases de yasuo con la skin nueva dice \"unete al caos tenemos calaveritas de azucar\"","replies":[]}]}]},{"poster":"Mazer Rakham","date":"2017-06-16T16:13:20.441+0000","up_votes":1,"down_votes":0,"body":"Orden. No me gusta Yasuo y me agrada más La idea del orden. Aparte de las posibilidades de conseguir Annie Hextech (odio a Vayne)","replies":[]},{"poster":"DrakoMza95","date":"2017-06-16T12:48:17.694+0000","up_votes":1,"down_votes":0,"body":"Yo elegi caos mas que nada por que me gusto mucho mas el tema del fuego y la oscuridad... y también que a yasuo le pego muy bien esa skin... eso de las lucecitas y todo muy bonito el mundo no jaja... (aparte odio a riven)","replies":[]},{"poster":"2801","date":"2017-06-16T12:41:25.737+0000","up_votes":1,"down_votes":1,"body":"Yo elegí Yasuo, que ademas de ser mi main numero 1, que lo amo con toda el alma y tengo todas sus skins (No me falta ni la nueva) me gusta mas el caos que el orden, siento que el orden es como una cosa por asi decirlo ''el heroe'' y no me convence demasiado que digamos xD","replies":[]}]}