{"poster":"Bot Murloc","date":"2018-07-22T20:13:51.048+0000","title":"imposible aprender a usar al nuevo GP","subforum":"Charlas Generales","up_votes":4,"down_votes":4,"body":"trato,trato y traaaaaato de jugarlo, y lo unico q logre es llegar a un nivel de tilt q cuando me matan una sola vez me quedo bajo torre y dejo morir al equipo\n\nlo unico q me genera es tilt, ni siquiera me genera satisfaccion, por q nunca llegue a tener el da&ntilde;o suficiente para hacer un da&ntilde;o espeluznante como se ve en muchos videitos... de lo q vengo jguando a gp para practicar, no hay champ q no sea fuerte contra gp, gp si no te engancha un combo con el barril, perdes un gank, no lo hacen en tf, podes llegar a perder la tf, no l oahces bien en linea... perdiste la linea asi de facil\n\njuego gp mid, me pickean zoe, juego gp top, me pickean trundle... los huevos inflados me tiene q todo el rato sea asi, le sacan los criticos del barril, aaaaah pero mf si te rebota la Q con un minion chau mitad de vida con un solo item, pero yo pego una Q y si no es un supp como sona no puedo ni llegar a la mitad de vida, un adc me come vivo si no pongo los barriles, un jg me come vivo si no pongo los barriles, HASTA UN PUT* SUPP ME VA A DESINTEGRAR SI NO PONGO BIEN LOS BARRILES\n\nCUAL ES LA NECESIDAD DE FORZAR UNA MECANICA ASI?!?!?! \n\njuego contra un gp, es lo mas facil del mundo, uno puede cagarle a un gp con kayn por ejemplo\n\nuna curva de skill tan pronunciada asi para jugarlo de manera decente al maldito campeon es demasiado al pedo, si no es un tanque sin da&ntilde;o, sin movildiad y solo cc capaz ahi le pueda hacer pelea en early\n\nes un crypost y ahi arriba tienen la flechita para hacer lo q se les cante de los huevos, me tenia q poner a quejar en algun lado\ny lo q mas brocna me da es q le tengo q llenar de trabajo al resto del equipo por un jguador como yo q no entiendo una mrda de como usar a esta basura de champ, le saco ganks a bot y mid por usar esta mrda\n","replies":[{"poster":"0nlyRenektonSolo","date":"2018-07-22T20:22:54.425+0000","up_votes":5,"down_votes":0,"body":"***","replies":[{"poster":"Bot Murloc","date":"2018-07-22T20:28:24.149+0000","up_votes":1,"down_votes":1,"body":"hoy habia llegado a un punto donde nunca llegue antes, y fue llorar de frustracion e impotencia por no poder hacer nada con un champ\n\naunque parezca extraño o imposible q yo no haya llorado antes por venir a quejarme del nuevo gp, nunca lo hice por un juego, de enojarme si, pero de llorar no\n\nno puedo aprender, quiero jguar blind pick y me ganan top, osea, 0 posibilidades de jguar gp por q mid siempre son los primeros, voy a draft y siempre me hacen counter, o capaz ni son mis counter me hacen mrda igual chabon","replies":[]}]},{"poster":"HopelessRomantic","date":"2018-07-22T20:42:45.054+0000","up_votes":2,"down_votes":0,"body":"Gangplank en las manos correctas es un pick monstruoso. En LCK ya son dos veces que Gangplank se lo come a Darius en top.\n\nPara mí que lo estás jugando mal, el nuevo Gangplank depende mucho de sus barriles, y si no podés meter barriles, obvio que no vas a servir de nada menos una Q y una R. Pero cuando ponés bien los barriles... oh jojo. Podes ganar una teamfight solo, están tratando de romper torres? Zonealos con tus barriles, si se acercan se los comen en la cara. \n\nAdmito que actualmente no se lo ve tan viable ya que el juego está demasiado centrado en obtener ventajas en early, y Gangplank en early contra bruisers y duelistas y esos junglers que te campean la línea... Hay que ser bueno para ganarles. Farmea no más en early, no pelees. Gangplank es un carry, y necesita de niveles y items para rendir.\n\nhttp://las.op.gg/summoner/userName=eyejoker Con el nuevo Gangplank subí de Oro II a Diamante V en sólo dos semanas creo en la temporada 6. Meses después ya casi ni lo podía jugar porque era perma ban hasta que lo nerfearon.","replies":[{"poster":"Bot Murloc","date":"2018-07-22T21:15:12.531+0000","up_votes":1,"down_votes":0,"body":"no puedo ganar con gp, nunca eh podido y cai en frustracion, el pico de habilidad es demasiado exagerado para mi, y doy todas mis ganas para aprender a jugarlo pero no puedo tradear, con nadie, soy solo un peso muerte en una tf, encajo barriles para los ganks e igual piuerdo en el gank, le matan a mi jg o me matan a mi, me hacen un gank y cague, me matan\nman me quiero suicidar, llegue a oro jguando top y ahora me siento como un virgen, un bueno para nada, no se q hacer con mi vida, caundo le puse tantas horas a este juego, en diferentes cuentas y ahora soy solo un fracasado q no puede salir de plata y jguar al puto gp nuevo","replies":[{"poster":"Vąletõ Jõestąr","date":"2018-07-22T23:00:11.749+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Bot Murloc,realm=LAS,application-id=v7qsfXsE,discussion-id=R4IlLn0X,comment-id=00010000,timestamp=2018-07-22T21:15:12.531+0000)\n>\n> no puedo ganar con gp, nunca eh podido y cai en frustracion, el pico de habilidad es demasiado exagerado para mi, y doy todas mis ganas para aprender a jugarlo pero no puedo tradear, con nadie, soy solo un peso muerte en una tf, encajo barriles para los ganks e igual piuerdo en el gank, le matan a mi jg o me matan a mi, me hacen un gank y cague, me matan\n> man me quiero suicidar, llegue a oro jguando top y ahora me siento como un virgen, un bueno para nada, no se q hacer con mi vida, caundo le puse tantas horas a este juego, en diferentes cuentas y ahora soy solo un fracasado q no puede salir de plata y jguar al puto gp nuevo\n\nY subí jugando otra cosa man, algo con lo que carries más facil, mi campeón favorito del juego es Lee Sin, soy only jg pero no pase de plata a platino jugando solo Lee Sin, fuí jugando los champs que estaban más en el meta y cosas así, aparte porque decir eso de suicidarte (igual se que no es en serio...espero) si es un juego man, como se te ocurre hacerte daño por esto xd","replies":[{"poster":"Bot Murloc","date":"2018-07-23T00:14:58.698+0000","up_votes":1,"down_votes":0,"body":"porq  no tengo nada mas q hacer\ncon decirte q el amor y las parejas me parecen una perdida de tiempo te podes imaginar como soy","replies":[{"poster":"Vąletõ Jõestąr","date":"2018-07-23T01:16:13.124+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bot Murloc,realm=LAS,application-id=v7qsfXsE,discussion-id=R4IlLn0X,comment-id=0001000000000000,timestamp=2018-07-23T00:14:58.698+0000)\n>\n> porq  no tengo nada mas q hacer\n> con decirte q el amor y las parejas me parecen una perdida de tiempo te podes imaginar como soy\n\nY estudia, trabaja, que se yo,yo te digo que pase por una epoca en la que este juego se me volvio super adictivo que me iba para el culo en el colegio, a veces ni iba o iba re dormido por quedarme jugando toda la noche, tenía problemitas y todo, y estaba con una actitud así, me puse a hacer ejercicio y a salir más y todo joya, busca algo aparte que te guste hacer y listo bro, yo en ese tiempo estaba trabajando también, como para distraerme y obviamente por platita, pero no digas esas cosas ni te trates así de mal, trata de mejorar que si te esforzas lo vas a lograr, ya sea afuera o en este juegito, que se yo, es lo que se me ocurre, no es la mejor ayuda pero una idea es.","replies":[{"poster":"Bot Murloc","date":"2018-07-23T11:21:57.415+0000","up_votes":2,"down_votes":0,"body":"na, si, no sos el primero q me dice eso de buscar algo q me interese mas, estoy laburando como secretario mientras estudio administracion de empresas, voy por mi segundo año y me va bastante bien, por el momento no quede libre en ninguna\n\npero igual en ese momento en el cual te respondi eso, estaba enojado y frustrado completamente de la vida, pero ahora q estoy normal, calmado como normalmente soy fuera del juego, te digo q me siento vacio, pero al jugar league o jugar en la pc concretamente me siento vivo\n\ncapaz sean la barrera q me impide saltar del balcon xd, gracias por el interes de paso","replies":[]}]}]}]},{"poster":"HopelessRomantic","date":"2018-07-23T00:41:33.077+0000","up_votes":1,"down_votes":0,"body":"Como dijo el otro pibe. Jugá otra cosa. Si sólo querés subir entonces abusá campeones que estén en meta. Para más información.\nhttps://champion.gg/ O lo que los pros pickean en LCK, LPL, etc.","replies":[]}]}]},{"poster":"Deigex","date":"2018-07-22T21:43:18.815+0000","up_votes":2,"down_votes":0,"body":"Gankplank tiene un skillfloor de los mas elevados del juego, no es un campeon que se domine sus mecanicas base en pocas partidas y necesitas conocer no solo bien tu campeon sino cada matchup que juegues,  son skillmachup siempre, no es como jugar tanques.\n\nSi no tenes paciencia no juegues campeones dificiles.","replies":[{"poster":"Bot Murloc","date":"2018-07-22T22:44:36.542+0000","up_votes":1,"down_votes":0,"body":"deberia seguir probandolo mas adelante","replies":[]}]},{"poster":"Borriic III","date":"2018-07-22T21:05:17.371+0000","up_votes":2,"down_votes":0,"body":"Creo que entiendo un poco la frustacion que sientes, yo tambien juego gp y en ocasiones da mucha bronca tener que clavar un combo de barriles perfecto para pegar lo mismo que una mf con el rebote de una Q o que una zoe con una Q-R, sobre todo porque actualmente con lo poco que duran los barriles en el mapa se vuelve muy predecible, ya no puedes tener oculto un barril en el bush para pillar gente desprevenida y en linea el cd de los barriles simplemente no da como para pegar una seguidilla de 3 barriles, y seamos sinceros, hay que ser muy malo para comerse un combo de 2 barriles, es muy obvio cuando te lo van a tirar, ademas matar con la Q ya no restaura mana y el personaje no es que tenga una cantidad enorme como para spamear daño directo\n\nes un buen champ pero con una curva de skill excesiva y aunque cuando lo dominas medianamente bien obtienes resultados, basta con que el que tienes en frente sepa medio usar a su champ meta para que te deje en la ruina","replies":[{"poster":"Bot Murloc","date":"2018-07-22T22:45:21.588+0000","up_votes":1,"down_votes":0,"body":"es un buen champ, pero despues de tantos cambios su curva de skill se elevo, aunque sigue fuerte, lo se","replies":[]}]}]}