{"poster":"HDpanda","date":"2017-01-11T02:43:02.992+0000","title":"Queue not popping resulting in bans","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"As of recently, my client has been very buggy. I have tried reinstalling it and repairing it 4 times now. But anytime i try to queue up outside of arams, the client (probably 75% of the time) will not pop up with the afk check; resulting in a plethora of 30 minute bans preventing me from playing due to other time restrictions outside of league. My question is, why am I being punished for not accepting the queue when it doesn't even pop up?\r\n\r\n Is it something on my end I need to repair? It happens to some of my buddies as well. Really not sure what to do, but it is taking a toll on the overall experience of the game. I've played for 6 years now and it's only become prevalent as of roughly 18-20 months ago. any tips??\r\n\r\n\r\nThanks!","replies":[{"poster":"Targons Blade","date":"2017-01-11T03:02:44.878+0000","up_votes":1,"down_votes":0,"body":"I typically see this behavior when there's an unstable or fluctuating connection to our PvP.net service, which is the one responsible for popping up those queue invites. Basically, what happens is the queue technically pops up, but due to a poor connection to the service that gives notifications, there isn't an indication that you've been invited to the champ select. This results in the servers thinking you're simply dodging queues nonstop, which eventually turns into those *low-priority queues* you've been seeing on your account. Our [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) will walk you through configuring your network settings for the most compatibility with League, so I strongly recommend giving those steps a go, since this issue is commonly caused by some of those settings.\n\nLet me know how those steps ended up working for you.","replies":[{"poster":"HDpanda","date":"2017-01-13T01:33:01.002+0000","up_votes":1,"down_votes":0,"body":"Thanks for the input!\n\nI must add that it ONLY happens in the new queue. It happens roughly 80% less in the aram queue","replies":[]}]}]}