{"poster":"Firerider","date":"2016-06-14T21:08:48.843+0000","title":"Es ist soweit: Der erste Trainingstermin meines Teams der wegen Riot ausfällt","subforum":"Allgemeiner Chat","up_votes":13,"down_votes":2,"body":"Guten Abend Leute,\r\nich habe ja letztens schon einen kurzen Meinungsbericht geschrieben, bez&uuml;glich der neuen Dynamic-Queue &Auml;nderungen. Heute ist unser erster Traingstermin deswegen ausgefallen, einfach weil wir kein Ranked mehr zu 5 spielen k&ouml;nnen. Ich m&ouml;chte an dieser Stelle nur eins sagen: Ich bin echt entt&auml;uscht. Man arbeitet an seinem Team, versucht es zum Laufen zu bringen, und alles was Riot macht, ist uns Kn&uuml;ppel zwischen die Beine zu werfen f&uuml;r unsere M&uuml;hen. Wir verlangen gar nicht viel, alles was wir uns w&uuml;nschen ist einfach eine Queue, wo wir jederzeit zu 5 einfach mal Trainieren k&ouml;nnen. Es geht sicher vielen gew&ouml;hnlichen Dia-Teams wie uns. Es macht mich traurig das es so weit gekommen ist, keine Ahnung wie wir jetzt weitermachen sollen.\r\nEuch w&uuml;nsche ich trotz allem einen sch&ouml;nen Abend\r\nder traurige p Firerider","replies":[{"poster":"Skagerak","date":"2016-06-14T21:21:22.835+0000","up_votes":3,"down_votes":0,"body":"Geht mir genauso mein main acc ist Dia sobald auch mein Smurf Dia ist (plat 1 70lp) dann kann ich es ganz lassen mit dem ranked team :/ . und es brauch auch keiner kommen mit \"lass den acc doch einfach in Platin lol\"  geht schlecht wenn man immer sein bestes gibt und mit Absicht werd ich mich nicht runterziehen.","replies":[{"poster":"Firerider","date":"2016-06-14T21:31:07.538+0000","up_votes":3,"down_votes":2,"body":"Wir stecken wohl beide im selbem Boot, tut mir Leid das es bei euch auch so ist\nmit freundlichen Grüßen p Firerider","replies":[{"poster":"Ryu Copeland","date":"2016-06-14T23:41:23.531+0000","up_votes":2,"down_votes":2,"body":"habe euch beiden mal ne Anfrage geschickt, da wir ein Team gegründet haben und auf der Suche nach möglichen Scrim Partner sind, wenn ihr Interesse haben solltet.  ^^","replies":[{"poster":"Firerider","date":"2016-06-15T05:35:40.324+0000","up_votes":2,"down_votes":2,"body":"Schauen wir mal ;)","replies":[]}]}]},{"poster":"Sanji29","date":"2016-06-15T11:19:08.543+0000","up_votes":4,"down_votes":4,"body":"***","replies":[{"poster":"CommonTroll","date":"2016-06-15T11:32:07.198+0000","up_votes":2,"down_votes":4,"body":"wollt nur mal sagen das hier geht wirklich, hab das schon mal gesehen in twitch. falls ein paar von euch es nicht kennen. es IST KEIN WITZ , SPAM oder sonstiges!!!!","replies":[{"poster":"Firerider","date":"2016-06-17T06:49:52.824+0000","up_votes":1,"down_votes":0,"body":"Spam woanders!","replies":[]}]}]}]},{"poster":"AG Luckyskill","date":"2016-06-15T09:25:34.916+0000","up_votes":2,"down_votes":0,"body":"Fühlt sich bisschen an wie 10 Jahre zurück versetzt für mich, als man noch auf ESL musste und sich dort seine Gegner suchen, weil es kein Matchmaking gab.\nIrgendwie lächerlich, dass Riot die Rankedteams einfach so zerstört hat. Nur mal so aus Neugierde, gibt's irgendwo eine vernünftige Begründung warum man die Teamwertung raus genommen hat außer \"Dynamik wird das schon regeln\" und \"wir waren zu unfähig das gescheit umzusetzen und es wurde von jedem nur ausgenutzt?\"","replies":[{"poster":"Awsane","date":"2016-06-15T10:46:28.697+0000","up_votes":1,"down_votes":0,"body":"Der Grund warum Teamranked abgeschafft wurde liegt an massiven Problemen, die es früher mit diesem Modus im high Elo Bereich gab\nwie unter anderen\n- extrem lange Wartezeiten\n- sehr unausgeglichene Spiele\n- das man sich darüber für die challenger series qualli konnte und es Teams gab, wenn sie genug punkte hatte einfach nicht mehr gespielt haben und so Team die besser waren keine Chance hatten diese Teams zu überholen. (weil die dann nur gegen schlechtere Teams gespielt haben und kaum punkte bekommen haben)\n\nProbleme auf allen Elos\n\n-das es sehr viele spieler gab die ein Team gegründet haben, die einstufungsspiele gemacht haben\nmit dem Ergebniss nicht zufrieden waren und einen neuen versuch gestartet haben und es dadurch passiert ist, das es in den einstufungsspielen ein totalels chaos an skillunterschied gab\n-es durch den oberen punkt passiert ist, das man random selbst wann man schon lange eingerankt war sehr unausgegliechene spiele hatte wo ein Team das deutlich besser war als man selber am durchrushen war was zu einem sehr negativen spielgefühl geführt hat\n- das es einfach nur sehr wenig konstante Teams gab\n- das durch teamhopping (sowohl in high elo as auch in unterer elo) das matchmaking garnicht funktionieren konnte, so konnte in einem Team aus 10 leuten bsp als krassester fall, 5 bronze duds die einfürungs spiele machen, und danach spielen dann aus dem selben Team 5 master leute weiter was zu chaos geführt hat\n- Teamranked wurde Systematisch von einigen benutz um gegen schlechtere Spieler zu spielen.\n\nLG Awsane","replies":[{"poster":"Firerider","date":"2016-06-17T06:54:35.280+0000","up_votes":1,"down_votes":0,"body":"Du fasst es gut zusammen. Aber es hätte einen alternativ Schritt gegeben. Sie hätten einfach Teamranked durch Belohnungen und bessere Anreize ebenfalls viel beliebter machen können. Auch hätte Riot mehr eigene Turnierserien wie den Battleground bahalten können aber nein. Es zu entfernen was die leichte Lösung, meiner Ansicht nach aber die Falsche!\nlg p Firerider","replies":[]}]}]},{"poster":"okbückdich","date":"2016-06-14T22:32:38.804+0000","up_votes":1,"down_votes":0,"body":"mhm ein training gegen 5 nichts premades wäre eh nicht aussagekräftig und besonders hilfreich \nweil die teamstrategie nicht gecountert werden kann\n\nes gibt eine lösung :\nSuche im Forum andere teams für scrimms ... es gibt genug dia + teams die  gerne trainiren wollen ....\nvll wird riot teamranked doch wieder auf eine art veröffentlichen bis dahin: worauf wartest du noch wette es dauert nicht mal 12h bis du/ihr gleichgesinnte gefundenhabt :)","replies":[{"poster":"Firerider","date":"2016-06-15T05:39:10.017+0000","up_votes":1,"down_votes":0,"body":"Stimmt, das könnten wir machen. Aber ist es nicht irgendwie etwas traurig das sich Spieler mitlerweile selbst irgendwie zusammenschließen müssen, nur um etwas so simples zu erreichen?\nmit freundlichen Grüßen\np Firerider","replies":[{"poster":"CustomKunibert","date":"2016-06-15T08:15:59.409+0000","up_votes":2,"down_votes":0,"body":"Erklärt mir jemand kurz, was ein Scrim ist? Vielen Dank! :D","replies":[{"poster":"SFCFlo","date":"2016-06-15T09:22:49.508+0000","up_votes":1,"down_votes":0,"body":"Ist eigentlich ganz einfach.\n2 Teams spielen Trainingsspiele gegeneinander um für ihr Teamplay zu trainieren und um Teamcomps zu testen.\n\nIn der LCS Challenger werden wöchentlich Scrims abseits der Liga gespielt um meistens an Teamkompositionen zu arbeiten.\nEs dürfen aber nur eine gewisse Anzahl an Scrims gespielt werden und es gibt auch keine Scrims gegen Teams denen man in den darauf folgenden Woche spielt.","replies":[{"poster":"CustomKunibert","date":"2016-06-15T11:04:52.189+0000","up_votes":1,"down_votes":0,"body":"Achso, alles klar. Danke für die Info!","replies":[]}]}]},{"poster":"okbückdich","date":"2016-06-15T10:52:31.813+0000","up_votes":1,"down_votes":0,"body":"Es ist doof und ich finde es ehrlich gesagt auch nicht richtig  ( 2 warteschleifen wären vernünftiger  ( eine mit 2/3 oder fünf spielern und eine nur für solo player . was solo q sehr viel aussagekräftiger machen würde )\naber jetzt ist es eben so :/","replies":[{"poster":"Firerider","date":"2016-06-17T06:59:04.868+0000","up_votes":1,"down_votes":0,"body":"Gäbe es eine SoloQ Wertung wäre die DynamicQ wertlos. Es ist ja ganz einfach, wer schaut denn bitte auf den Rang den jemand sich mit anderen Spielern erkämpft hat, wenn er stattdessen schauen kann wie gut sich der Spieler alleine schlägt. Kurzum, niemand würde die DynamicQ ernst nehmen wenn es die SoloQ noch gäbe\nlg p Firerider","replies":[{"poster":"okbückdich","date":"2016-06-17T10:17:44.943+0000","up_votes":1,"down_votes":0,"body":"wäre gut : dynamic q sagt jetzt auch nichts aus","replies":[{"poster":"Firerider","date":"2016-06-17T12:10:46.767+0000","up_votes":1,"down_votes":0,"body":"Du hast es erfasst mein Freund :D\nlg p Firerider","replies":[{"poster":"okbückdich","date":"2016-06-17T19:23:14.921+0000","up_votes":1,"down_votes":0,"body":"bin Boostet bro :*","replies":[{"poster":"Firerider","date":"2016-06-20T07:09:40.583+0000","up_votes":1,"down_votes":0,"body":"AHHHHAAAAA??? :D\nlg p Firerider","replies":[]}]}]}]}]}]}]}]},{"poster":"Der Großmugister","date":"2016-06-15T07:10:20.209+0000","up_votes":2,"down_votes":0,"body":"Eine der wenigen Entwicklungen von Riot, die ich durch und durch bescheuert finde.\nIch hoffe die Leute da oben sehen ihren Fehler ein und rudern einfach mal zurück, das Schlimmste wäre, wenn sie es nun wie andere Spieleschmieden machen und ihren eindeutigen Fauxpas, mit allen Mitteln schön reden und drum herum patchen, bis am Ende doch alles ist wie vorher, nur viel komplizierter.\n\nWenn eine Äußerung in Richtung \"Wir sind sehr zufrieden damit, wie sich die neue Ranglisteverschadelung verhält und werden unseren Kurs fortführen\", auftaucht, muss ich meine Einstellung zu Riot, als kundenfreundlichstes Spieleunternehmen überdenken, dann könnte ich mich auch wieder von Blizzard veräppeln lassen.","replies":[{"poster":"Firerider","date":"2016-06-17T06:57:03.777+0000","up_votes":1,"down_votes":0,"body":"Spielerfreundlich ist Riot schon lange nicht mehr. Sie kümmern sich mit jeder Season weniger um ihre gewöhnlichen Mitspieler, Sie kürzen RP Belohnungen, führen Patches ein, die eigentlich keiner will und sie reden sich bei allem mit imaginären Daten raus, die sie nie offen vorlegen\nlg p Firerider","replies":[]}]},{"poster":"HHaie tabbian","date":"2016-06-14T22:15:59.692+0000","up_votes":2,"down_votes":0,"body":"Ich bin in einem Club, indem oft nach Scrimgegner im Diabereich gesucht werden (das ist auch sein einziger Zweck). Wenn du willst, kann ich dich da mal vorschlagen.\nFinde das, was Riot da veranstaltet aber auch nur lächerlich.","replies":[{"poster":"Firerider","date":"2016-06-15T05:37:51.431+0000","up_votes":1,"down_votes":0,"body":"Das wäre natürlich super, ich wäre echt dankbar\nmit freundlichen Grüßen\np Firerider","replies":[]}]},{"poster":"DanionVibit","date":"2016-06-15T05:03:54.150+0000","up_votes":1,"down_votes":0,"body":"Jetzt wo ich es so lese, fällt mir wieder so ne Idee ein. Viele Personen haben wegen dieser Problematik ja smurfs. Was ist denn wenn man die smurfs so lange benutzt bis der andere account durch Inaktivität decreased. Die MMR bleibt ja meine ich die selbe und wenn Riot nichts macht die einzige Lösung die mir einfällt :S","replies":[{"poster":"Firerider","date":"2016-06-15T05:37:04.488+0000","up_votes":1,"down_votes":0,"body":"Das wäre zwar eine Lösung, aber keine die wirklich erstrebenswert ist, für jemanden der Dia 3 ist dauert das ja ewig, selbst für nen Dia 4 Spieler für mich dauert das einfach viel zu lange\nmit freundlichen Grüßen\np Firerider","replies":[{"poster":"DanionVibit","date":"2016-06-15T05:46:20.891+0000","up_votes":1,"down_votes":0,"body":"Ja stimmt wohl nach 4 Wochen fängt es an und dann jede weitere Woche. In Diamant war es glaub ich 50 oder 40 lp pro decrease.","replies":[]}]}]}]}