{"poster":"Firerider","date":"2015-09-15T16:15:00.997+0000","title":"Clans - Was bringen sie uns eigentlich?","subforum":"Allgemeiner Chat","up_votes":5,"down_votes":0,"body":"Clans existieren schon solang wie Computerspiele existieren. Egal welches Spiel, solange es eine M&ouml;glichkeit gibt mit anderen Spielern zu interagieren kann ein Clan existieren, teilweise sogar ohne diese M&ouml;glichkeit. Seitdem die Welt der Onlinespiele rasant expandiert ist, ist auch die Anzahl der verschiedenen Clans rasant angestiegen. So sehr sich die verschiedenen Clans sich auch unterscheiden, so haben sie doch alle etwas gemeinsam: Die Leidenschaft an ihren Spielen!\n\n**Was sind Clans eigentlich?**\nF&uuml;r den Augenblick ist es sicher hilfreich wenn wir uns nochmal vor Augen f&uuml;hren was Clans eigentlich sind. Clans unterliegen keiner wirklich gro&szlig;en oder schweren Definition. Grunds&auml;tzlich bezeichnet man damit einen Zusammenschluss mehrerer Spieler, um das jeweilige Spiel etwas koordinierter oder professioneller angehen zu k&ouml;nnen. Hierbei ist zu beachten das man nicht wirklich eine Zahlengrenze hat, ab wann eine Spielergruppe als Clan einzustufen ist. Jedoch kann man an und f&uuml;r sich sagen, dass man erst bei mehr als 10 Leuten von einer kleinen Spielgemeinschaft oder einem Clan sprechen kann. Clans besitzen hierbei unterschiedliche Gr&ouml;&szlig;en, die kleineren haben meistens kaum mehr als 20-60 Mitglieder, w&auml;hrend gr&ouml;&szlig;ere Clans deutlich mehr als 100 Mitglieder besitzen. W&auml;hrend diese kleinere Clans meist nach k&uuml;rzester Zeit wieder verschwinden, halten sich die gr&ouml;&szlig;eren Clans meist wesentlich l&auml;nger. Woran dies liegt ist klar, n&auml;mlich in den Unterschieden der Clans.\n\n**Worin unterscheiden sich Clans?**\nClans haben meistens bemerkbare Unterschiede, das macht sich in der Mitgliederzahl, Lebensdauer und der Organisation bemerkbar. Daher ist es auch nicht erstaunlich, dass ein paar Freunde die Leute zum Zocken auf ihren Ts einladen keine gro&szlig;en Clans anf&uuml;hren. Gute und lang existierende Clans zeichnen sich durch gewisse Merkmale aus. Wichtigste Grundlage ist dabei stets eine genaue F&uuml;hrungshierarchie . Man muss genau wissen wer im Clan &uuml;ber wem steht und wer das Sagen hat, da ansonsten Chaos herrscht und jeder tut was er will. Mit der Hierarchie ist es auch wichtig eine stetige Informationspolitik und Vernetzung voranzutreiben, um die einzelnen Mitglieder des Clans st&auml;rker aneinander zu binden und den Gemeinschaftssinn zu erh&ouml;hen. Ebenfalls wichtig ist eine vielf&auml;ltige Anzahl von Programmen f&uuml;r die Mitglieder; das k&ouml;nnen Teamf&ouml;rderungen, Turniere, Coaching oder dergleichen sein. Schlechte Clans bieten meist nichts in dieser Richtung an, sondern spielen meist wild drauf los, ohne Sinn, Ziel und Verstand. Wichtig ist nat&uuml;rlich die Mitgliederzahl und die Rekrutierung von neuen Mitgliedern. Sollte ein Clan darauf verzichten Mitglieder aktiv anzuwerben, so werden sie wohl kaum eine gro&szlig;e Zahl von Mitgliedern erreichen. Man kann also Zusammenfassen, dass ein guter Clan eine genaue Struktur, Mitgliedervernetzung, gute Programme und eine akzeptable Mitgliederzahl besitzt. Ein schlechterer Clan dagegen erf&uuml;llt entweder einzelne Kriterien nicht oder gar keins.\n\n**Was bringt ein Clan?**\nNat&uuml;rlich ist die eigentlich zentrale Frage, was ein Clan genau f&uuml;r den einfachen Spieler tut. Sollte es sich um einen schlechten Clan handeln wird meist wenig f&uuml;r den Spieler getan, lediglich ein TS f&uuml;r seine Kommunikation mit Freunden zur Verf&uuml;gung gestellt. Da jedoch auch Skype derartiges k&ouml;nnte, ist es nicht wirklich lohnend f&uuml;r einen Spieler sich einen Clan zu suchen der nur dieses anbietet. Gute Clans dagegen bieten vielf&auml;ltige M&ouml;glichkeiten f&uuml;r den einzelnen Spieler. Zum einen findet man meistens eine freundliche und lustige Spielerscharr, mit denen man einige entspannte Runden spielen kann, wann immer es einem passt. Zum anderen k&ouml;nnen dort viele Dinge erreicht werden, die man als einsamer Wolf, mit einem halben Dutzend Freunden nicht schafft. Gute Clans bieten oftmals Events wie Turniere oder anderes an, diese sind meistens auf Freundschaftsbasis und machen durchaus Spa&szlig;, jedoch kann man dabei auch &ouml;fter mal gute Preise gewinnen hat.\nEin weiterer sehr wichtiger Punkt sind Teams. Viele Spieler w&uuml;nschen sich oftmals verzweifelt ein Team, kriegen es jedoch aufgrund mangelnder Erfahrung in diesem Bereich einfach nicht hin ein stabiles Team zu gr&uuml;nden und aufrecht zu erhalten. Hierbei kann ein Clan eine gro&szlig;e Hilfe sein, da dieser nicht nur Betreuer und Coaches stellen kann, welche dir Leute vermitteln und euch Tipps geben, sondern auch &uuml;ber erfahrene Teams verf&uuml;gt, welche vor allem neueren Teams eine gro&szlig;e Hilfe sein k&ouml;nnen, da diese ja schon l&auml;nger existieren und stets mit Tat und Rat zur Seite stehen k&ouml;nnen. Sollte man ein l&auml;nger existierendes Team haben kann man im Clan gut Trainingspartner finden um sich f&uuml;r gr&ouml;&szlig;ere Events, wie den Battleground, vorzubereiten. Ihr seht also das Clans eine Vielzahl von M&ouml;glichkeiten bieten von denen man nur profitieren kann. Insgesamt verschafft ein Clan einem Spiel einfach eine gr&ouml;&szlig;ere Tiefe. Aber wie sieht das mit den Clans bei Lol eigentlich aus?\n\n**Ist Lol Clanfreundlich?**\nEine gute Frage die sich nat&uuml;rlich stellt. Manche Spiele f&ouml;rdern Clans aktiv und bieten viele Vorteile im Spiel selbst, sollte man einem angeh&ouml;ren. Lol dagegen bietet hier eine Ausnahme. Es gibt in Lol kein Clan System, ein Team zu gr&uuml;nden ist hierbei das h&ouml;chste der Gef&uuml;hle. Auch ist nicht bekannt ob Lol jemals ein Clan System implementieren wird, ich wage jedoch es zu bezweifeln. Auch wenn Lol kein Clan System besitzt, sind Lol Clans jedoch sehr gefragt und es besteht ein st&auml;ndiger Bedarf nach solchen. In Lol bringt einen ein Clan zwar nicht merklich weiter, da dieser nur au&szlig;erhalb des Spiels auf einer anderen Ebene existiert, jedoch bringt es eben die oben genannten Vorteile mit sich.\n\n**Wie wird die Zukunft aussehen?**\nLol besitzt kein Clansystem und wird wahrscheinlich auch keins bekommen. Dennoch werden Lol-Clans weiterhin an Zuwachs erhalten. Da Lol nun mal eines der beliebtesten Onlinespiele ist, liegt der Wunsch der Spieler sich zusammenzuschlie&szlig;en, um mehr zu erreichen, nah. Viele Spieler k&ouml;nnen sich mit ihrem Clan identifizieren und stehen fest hinter ihren Kameraden. Es werden wie seit Beginn weiterhin Clans gegr&uuml;ndet werden aber es werden auch immer wieder welche zugrunde gehen. Dies stellt einen nat&uuml;rlichen Kreislauf dar. Denn nur die Clans mit den oben genannten Kriterien haben &uuml;berhaupt die Aussicht l&auml;nger zu bestehen und derartige Lol-Clans lassen sich an einer Hand abz&auml;hlen.\n\n**Fazit:**\nLange habe ich nun &uuml;ber Clans gesprochen, da wird es nun Zeit ein Fazit zu ziehen. Clans sind, insofern sie gut sind, f&uuml;r jeden Spieler lohnenswert, und das ohne Ausnahme. Die Vorteile sprechen schlie&szlig;lich f&uuml;r sich, und sichtbare Nachteile besitzen Clans bis auf seltene Ausnahmen auch nicht. Daher kann ich nur empfehlen sich einen guten Clan zu suchen und in diesem so lange wie m&ouml;glich zu verweilen. Helft eurem Clan so gut ihr k&ouml;nnt und arbeitet mit damit es noch besser wird, denn denkt daran: Der Clan ist f&uuml;r euch da!","replies":[{"poster":"StitchStar","date":"2015-09-15T17:13:42.733+0000","up_votes":1,"down_votes":0,"body":"Die meisten kostenlosen Clans sind einfach nicht zu gebrauchen oder Sie kümmern sich hauptsächlich nur um Ihren Kern und die sehr guten Spieler, damit die nicht unzufrieden sind! Die anderen Spieler werden nur gebraucht um Trafik zu generieren für die Sponsoren oder den Sponsor. Ich hatte mal einen Clan da sollte man jeden Tag im Forum was Posten und ja das war eine Regel.\n\nDann gibt es noch paar gute Clans, die haben aber entweder alle eine monatliche Gebühr, sind überfüllt, haben oft zu viel Regeln oder alles zusammen.\n\nIch hab die kleinen Clans vergessen, die können meist nicht viel bieten und haben nicht so viel Mitspieler! Wenn man viel Glück hat kann man hier vielleicht den passenden finden.\n\nFazit:\nIch werde so schnell keinem Clan beitreten außer ich hab Lust RL-Zeit und/oder Geld dafür zu opfern! Zumindest nicht für LOL, wo man auch prima ohne Clan auskommt.","replies":[{"poster":"Firerider","date":"2015-09-15T17:27:03.334+0000","up_votes":2,"down_votes":0,"body":"Schade des du so negative Erfahrungen gemacht hast :(\nlg Fire Rider","replies":[]}]},{"poster":"Kaito","date":"2015-09-15T16:16:37.436+0000","up_votes":1,"down_votes":0,"body":"Schöner Text, aber was genau wird jetzt hier von mir verlangt? :o","replies":[{"poster":"Firerider","date":"2015-09-15T17:25:09.843+0000","up_votes":2,"down_votes":0,"body":"NICHTS. Ich wollte dich nur inspirieren^^\nlg Fire Rider","replies":[]}]},{"poster":"Taloz","date":"2015-09-16T04:40:19.846+0000","up_votes":3,"down_votes":2,"body":"Leider waren \"Clans\" für mich immer wieder dasselbe, weswegen ich auch eine immense Abneigung gegen besagte entwickelt habe.\n\nDer durchschnittliche Clan bestand bisher bei mir ausschließlich aus solchen Personen:\n\n- \"Der Träumer\": Meist der Clangründer oder Mitbegründer. Hat eigentlich 24/7 die Vorstellung im Kopf wie groß sein Clan einmal werden **könnte** und wie super     das alles werden wird. Hat mehr als 10 Billionen Ideen, bekommt aber nicht eine einzige umgesetzt.\n\n- \"Der Prolet\": Auch meist Clangründer oder Mitbegründer. Oft auch nur Admin auf dem Teamspeak.\n  Diese Personengattung hat sich aufgrund sozialer Defizite im Reallife einem Clan angeschlossen, um hierarchisch auch mal über anderen zu stehen.\n  Er nutzt jede Gelegenheit um auf seinen \"Status\" aufmerksam zu machen.\n  Typische Beispielsätze wären: \"Denk daran, ich kann dich jederzeit bannen.\" oder auch \"Wartet doch mal, Mama hat mir gerade mein Essen an den Tisch  gebracht!\"\n\n- \"Die Attentionwhore\": Oft von Zweifel und zu schwachem Selbstbewusstsein geprägt, so bekommt sie jedoch in einem Teamspeak aus sexhungrigen Nerds mehr Bestätigung als jemals zuvor. Diese Wesen gehören nahezu immer den von \"Best Morgana EuW\" beschriebenen 95% der weiblichen Retortenmenschen an, entwickeln jedoch meist aus der anschließend übermäßigen Aufmerksamkeit einen sich selbst überschätzenden \"Prinzessinnen Komplex\".\n\nHier geht´s zu der Definition der besagten 95%. http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/YF0ihUih-lol-anfaangerin-sucht-netten-coach-d\n\n- \"Der Mitläufer\": Diese Kategorie Mensch ist froh überhaupt sozial interagieren zu können, auch wenn es sich auf ein Kommunikationsprogramm auf dem PC beschränkt. Deshalb schreckt der Mitläufer nicht davor zurück, sich vom **im Internet** eher dominanten Proleten oder auch von der \"Attentionwhore\" mit antrainiertem Prinzessinnen Komplex regelmäßig dumme (zumeist sehr unwitzige) Sprüche drücken zu lassen. Hierbei nimmt er furchtlos die Rolle des Omega in der Gruppe ein.\n\n\nHinzu kommt noch die endlose Werbung aufgrund der schieren Anzahl beschissen organisierter und unwichtiger Clans, welche sich nach im Bestfall zwei Wochen wieder auflösen, weil der besagte \"Träumer\" für einen kurzen Moment von Prof. Dr. Realität angestupst wurde.\n\nAußerdem negativ anzumerken wäre:\n\n- Der Onlinezwang: Manche Träumer haben soviel Angst davor, das sich niemand für ihr Projekt interessiert, dass sie schon bei der Aufnahme in den Clan von einer gewissen **Besuchsregelmäßigkeit als Aufnahmebedingung** sprechen. Hierbei gehen einige sogar soweit, bei einer größeren Zeitspanne der Abwesenheit eine mündliche Abmeldung zu verlangen.\nDies erscheint mir in einer Gemeinschaft für Freizeitaktivität so absurd, das es mich als ich das erste mal davon hörte, zum lautstarken Lachen veranlasste.\n\n- Die Registrierung: Um Prestige für ihren in zwei Wochen in der Versenkung verendenden Clan zu generieren, wird oft die Registrierung auf irgendeiner zwielichtigen Clanhomepage gefordert. Meist noch bevor man überhaupt erste Eindrücke gewinnen konnte, so wird man mindestens alle 2 Minuten vom Träumer und/oder Proleten dazu aufgefordert, sich doch bitte auf der Website zu registrieren.\n\n- Die falschen Versprechungen: In jedem permanent und fast in regelmäßig erscheinenden Abständen Werbungsthread für irgendeinen 0815 Schrottclan werden die selben Dinge versprochen. Nämlich sämtliche die Fire Rider hier oben angegeben hat. Witziger Weise sind ca. 8/10 Clans komplett unorganisiert und es läuft letztendlich nur auf den Teamspeak hinaus. Die Homepage für die Registration existiert aber (egal wie schäbig sie auch sein mag) nahezu immer.\n\n\nHier mal meine Eindrücke von \"Clans\" und solchen die es gerne werden wollen.\n\nMfG Taloz","replies":[{"poster":"StitchStar","date":"2015-09-16T08:33:06.412+0000","up_votes":1,"down_votes":0,"body":"Ja das passt alles noch ganz gut ins Bild und kann da nur zustimmen.","replies":[]},{"poster":"Firerider","date":"2015-09-16T05:18:28.803+0000","up_votes":1,"down_votes":0,"body":"Ich habe ja nur ein allgemeines Bild abgegeben, aber deine Thesen sind auch gut^^\nlg Fire Rider","replies":[{"poster":"Taloz","date":"2015-09-16T06:39:35.670+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fire Rider,realm=EUW,application-id=YnZkMR0R,discussion-id=mU1pyj6t,comment-id=00030000,timestamp=2015-09-16T05:18:28.803+0000)\n>\n> Ich habe ja nur ein allgemeines Bild abgegeben, aber deine Thesen sind auch gut^^\n> lg Fire Rider\n\nWar ja auch keine Wertung an deinem Geschriebenen sondern meine vergangenen Eindrücke.","replies":[{"poster":"Firerider","date":"2015-09-16T07:09:44.614+0000","up_votes":1,"down_votes":0,"body":"JO, aber ich fühlte mich an einige alte Bekannte erinnert^^\nlg Fire Rider","replies":[]}]}]}]},{"poster":"Firerider","date":"2015-09-15T16:15:22.470+0000","up_votes":1,"down_votes":0,"body":"Sry fürs nochmal posten, des letzte mal ging es in den falschen Teil^^","replies":[{"poster":"eingew","date":"2015-09-15T17:19:02.675+0000","up_votes":1,"down_votes":0,"body":"Einfach löschen... dann muss es kein Mod machen und es wird nie in unserer Liste deiner Vergehen auftauchen :P","replies":[{"poster":"Firerider","date":"2015-09-15T17:25:34.710+0000","up_votes":1,"down_votes":0,"body":"Kann ich das einfach so?^^\nlg Fire Rider","replies":[{"poster":"eingew","date":"2015-09-15T17:53:47.000+0000","up_votes":1,"down_votes":0,"body":"Klar, gibt ja keinen Grund mehr, warum der offen bleiben sollte ;) Deine eigenen Threads kannst du sowieso löschen wie du lustig bist.","replies":[{"poster":"Firerider","date":"2015-09-15T18:34:00.622+0000","up_votes":1,"down_votes":0,"body":"juhu^^","replies":[]}]}]}]}]}]}