{"poster":"Josh The Locke","date":"2015-01-19T03:51:43.412+0000","title":"Katarina or Akali?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"i've seen both Akali's and Kats in action they both have roughly the same moves (dash,throw weapon which leaves a mark and a spin) but kat has her death lotus but Akali has her twilight shroud? WHICAH IS BETTER???","replies":[{"poster":"BazingaPunkBBT","date":"2015-01-19T07:38:20.155+0000","up_votes":2,"down_votes":0,"body":"akali is better cause she can dash 3 times and she has an oops I fcked up button (her w)","replies":[]},{"poster":"Kiean515","date":"2015-02-28T09:21:43.440+0000","up_votes":1,"down_votes":0,"body":"As an {{champion:84}}  and {{champion:55}}  main, i personally think {{champion:84}}  is better, {{champion:55}}  is now nerfed with his passive, u need to kill ur target within 3 seconds or u dont get the reset, even though {{champion:84}}  is weak pre- 6, u could still get the kill if ur about to die but just reached 6, if u know what I mean, to be short, {{champion:84}}  can pull more outplays than {{champion:55}} , plus {{champion:84}}  is super fun to play when ur fed, just Q R E and ur enemie is dead","replies":[{"poster":"Kiean515","date":"2015-09-08T09:00:08.358+0000","up_votes":1,"down_votes":0,"body":"Nevermind this post Akali sucks now (higher lvl matchups)","replies":[]}]},{"poster":"Josh The Locke","date":"2015-01-29T05:24:07.981+0000","up_votes":1,"down_votes":0,"body":"well after the new nerf to {{champion:84}} 's E she's gonna be much weaker :( WHY RITO!????","replies":[]},{"poster":"WEETBIX 4 BREKKI","date":"2015-01-19T13:57:40.186+0000","up_votes":1,"down_votes":0,"body":"Kat with resets is scarier than Akali most of the time.","replies":[]},{"poster":"RNG Remilia","date":"2015-01-19T08:28:58.874+0000","up_votes":1,"down_votes":0,"body":"Well a good Kat player is difficult to shutdown but a good Akali player takes nothing more than a pink and CC to deal.","replies":[]},{"poster":"Ultra7651","date":"2015-01-19T08:03:08.803+0000","up_votes":1,"down_votes":0,"body":"I used to main Katarina and I really enjoyed the games I played with her. I recently picked up Akali and have played only 1 PvP game with her.\n\nThey are both great roamers but I'd say that I find Akali better at ganking. I got a few kills early from my Jungler and then sat bot lane for a bit and just ate from the buffet. Personally I find Akali easier and more fun to play because once I was 5-10 kills in I understood why people called her broken.\n\nAkali has I higher damage from her AA's, meaning that once I've popped my combo I still can dish out more damage in a 1v1. Katarina's laning is probably easier and is less reliant on her ultimate for trades. She is resource-less meaning you only have to keep track of your cooldowns, however Akali is less dependent on picking up a few kills in teamfights as it's easy to get caught out as Katarina if you don't fully kill your target with the combo and have to AA them because all your abilities are on cooldown and you have no means of easy escapes (-Flash of course). \n\nOverall I think both champions are fun but I'm leaning more towards Akali. Less people play her anyway.","replies":[]},{"poster":"P1 GTR","date":"2015-01-19T07:16:39.462+0000","up_votes":1,"down_votes":0,"body":"the answer to ur question all lies in this question, who gets more pentas?","replies":[]},{"poster":"BarryButcher","date":"2015-01-19T07:07:48.014+0000","up_votes":1,"down_votes":0,"body":"Don't what you mean by \"better\"\n\nThey are both equally annoying. I'd say I hate a fed Akali more than a fed Kat though.","replies":[]}]}