{"poster":"LittleBearded","date":"2018-04-12T18:58:36.357+0000","title":"Leavebuster","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Buongiorno! Scrivo perch&eacute; mi &egrave; sorto un dubbio: ultimamente il mio client ha avuto problemi, continui crash durante le partite e tentativi di riconnessione falliti (ho controllato la connessione e non mi d&agrave; nessun problema al di fuori di lol, quindi non penso sia causa sua). Ho ricevuto due penalit&agrave; immediate: la prima volta 5 minuti di attesa per coda a bassa priorit&agrave;, dopo qualche settimana mi &egrave; ricapitato e subito altra penalit&agrave; (10 minuti). Ci&ograve; che mi ha spinto a scrivervi (dopo tentate disinstallazioni e installazioni) &egrave; che oggi ho fatto una partita di prova in una draft e non ho avuto problemi, ma appena ho joinato una ranked il client mi impediva di connettermi. Premo un paio di volte il tasto per riconnettersi ma nulla. Chiudo allora il client e lo riapro, ma qua accade la cosa strana: non mi si apre la schermata di caricamento, ma solo quella della home principale del profilo. Provo allora ad iniziare una nuova partita ma stranamente non parte. Premevo il tasto per trovare una partita ed entrare in coda, ma niente. Come se non avessi premuto. Tento allora di riavviarlo ancora ma stessa storia. Provo a creare una partita di addestramento, ma compare il messaggio: &quot;non puoi creare una nuova partita perch&eacute; ne stai gi&agrave; giocando un altra&quot;. Onestamente sono rimasto un po&#039; perplesso, perch&eacute; non avevo modo di rientrare in questa partita che, secondo il client, io stavo ancora giocando. Dopo qualche secondo compare un messaggio di leavebuster: 20 minuti di attesa prima di ogni partita. \r\nOra mi chiedo:\r\n1- posso fare qualcosa per togliere questa penalit&agrave; che in tutta onest&agrave; mi sembra poco corretta?\r\n2- quali sarebbero le penalit&agrave; successive a questa (in ordine)? Giusto per sapere cosa mi aspetterebbe in caso dovessero crearsi problemi del genere nuovamente.\r\nGrazie in anticipo.","replies":[{"poster":"Orniflex","date":"2018-04-13T11:21:19.473+0000","up_votes":1,"down_votes":1,"body":"Cioé a sto punto te lo merito bello mio. È palese che in questo forum dilaga l'ignoranza sul tema \"informatica\"!. Poi, propio non comprendo, perché startate ranked sapendo che avete dei problemi di connessione/client? È perché vi lamentate per una giusta punizione attribuita alla vostra più assoluta negligenza?\n\nÈ logico risolvere il problema prima di farsi dare punizioni, poiché ad ogni successivo abbandono la coda aumenta come tempo, inoltre è impossibile la revoca della suddetta perché rilasciata da un sistema automatico.","replies":[{"poster":"LittleBearded","date":"2018-04-13T11:42:07.071+0000","up_votes":1,"down_votes":1,"body":"Ho scritto questo post per avere eventuali risposte, non critiche. Prima di definirla \"giusta punizione per assoluta negligenza\" vorrei specificare che ho riscontrato questi problemi ultimamente solo con ranked. Tentando di fare aram o draft (come già specificato) il problema non c'era, quindi non avrei potuto saperlo senza aver fatto ranked. La mia altra domanda era quali sono le punizioni successive a questa, perché che aumentava col tempo l'avevo già capito e scritto nella prima parte del topic. Grazie per la risposta.","replies":[{"poster":"Orniflex","date":"2018-04-14T07:13:51.947+0000","up_votes":1,"down_votes":1,"body":"La risposta l'ho data, se poi non riuscite a comprendere l'idioma italico non è una mia colpa.\nTra l'altro per ricevere la punizione devi andare afk un numero considerevole di volte, quindi basta dire falsita!\nCon una volta non ricevi la coda.\nPoi il fatto che ti si verifica solo in ranked... fammi il piacere! È un bug del client o del tuo provider internet, non c'entrano nulla le ranked.\nÈ si l'ignoranza dilaga.","replies":[{"poster":"LittleBearded","date":"2018-04-14T08:40:07.335+0000","up_votes":2,"down_votes":1,"body":"Ho esposto le cose come stanno senza dire falsità. Se non hai nulla di considerevole o che possa aiutare da dire, non rispondere. Grazie. Con questo chiudo la discussione","replies":[]},{"poster":"Aurelion Shmoll","date":"2018-04-14T15:25:44.644+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Orniflex,realm=EUW,application-id=98NGV4Al,discussion-id=xA5ABg1j,comment-id=000300000000,timestamp=2018-04-14T07:13:51.947+0000)\n>\n> La risposta l&#x27;ho data, se poi non riuscite a comprendere l&#x27;idioma italico non è una mia colpa.\n> Tra l&#x27;altro per ricevere la punizione devi andare afk un numero considerevole di volte, quindi basta dire falsita!\n> Con una volta non ricevi la coda.\n> Poi il fatto che ti si verifica solo in ranked... fammi il piacere! È un bug del client o del tuo provider internet, non c&#x27;entrano nulla le ranked.\n> È si l&#x27;ignoranza dilaga.\n\nMi spiace, parlo solo fiorentino volgare, niente roba italica pizza margherita.\n\n:v","replies":[]}]}]}]},{"poster":"Aurelion Shmoll","date":"2018-04-14T15:24:51.198+0000","up_votes":1,"down_votes":0,"body":":v","replies":[]},{"poster":"Menfrix","date":"2018-04-13T02:08:27.368+0000","up_votes":1,"down_votes":0,"body":"Inutile dire che se il problema fosse imputabile a qualche problema nei server o nelle patch/client rilasciati da RIOT ci sarebbero diverse centinaia di migliaia di persone con questo problema e i vari forum sarebbero intasati di tread al riguardo.\n\nPiù probabilmente il problema si crea in \"locale\", cioè sul tuo pc (qualche programma crea conflitti, l'installazione non è avvenuta in maniera corretta) o avviene qualche problema di comunicazione tra il tuo pc e i loro server che può essere causato da qualche programma sul pc o causato dal provider che ti fornisce la connessione ad internet (fare uno speed test non ha alcun valore, più indicativo sarebbe un traceroute sui loro indirizzi ip).\n\nQuello che puoi fare è inviare un ticket al supporto e seguire alla lettera quello che ti viene detto di fare.\n\nLe punizioni non vengono tolte se il problema non è causato dai loro server.\nCome hai già scritto, fai bene a non giocare ulteriori ranked finchè non risolvi il problema.","replies":[{"poster":"LittleBearded","date":"2018-04-13T11:43:32.294+0000","up_votes":1,"down_votes":1,"body":"Prima di inviare un ticket, quali possono essere i programmi che interferiscono? Ho letto da qualche parte che forse un antivirus creava problemi, quindi ne ho installato un altro. Ma forse è anche peggio così :/","replies":[{"poster":"Menfrix","date":"2018-04-13T15:31:33.695+0000","up_votes":1,"down_votes":0,"body":"Non conosco i programmi che potrebbero interferire non essendo un tecnico informatico riot, come già hai saputo il più comune è l'antivirus (a me su un altro gioco interferiva il programmino che gestiva la chiavetta 3g per internet), ma i loro tecnici sapranno sicuramente più cose di me...","replies":[{"poster":"LittleBearded","date":"2018-04-14T08:38:08.145+0000","up_votes":1,"down_votes":1,"body":"Ok! Grazie!!","replies":[]}]}]}]},{"poster":"iTzGabbo99","date":"2018-04-12T21:43:21.838+0000","up_votes":1,"down_votes":0,"body":"Anche a me è successa la stessa cosa oggi... Entrai in una ranked e avevo il ping a 10000 ms fissi, controllai la connessione attraverso lo speedtest e andava a 9 mega al secondo... Inutile dire che mi beccai una pena di 20 minuti di coda a bassa priorità così a caso... Ancora però non sono riuscito a capire da cosa possa essere causato questo problema e non è la prima volta che mi capita","replies":[]},{"poster":"LittleBearded","date":"2018-04-12T19:08:55.147+0000","up_votes":1,"down_votes":1,"body":"* Aggiorno con una notizia appena arrivata e poco piacevole: mentre scrivevo il messaggio stavo per cominciare una ranked, dopo 20 minuti di attesa per la coda a bassa priorità: nessun problema durante la selezione del campione, ma appena parte il caricamento esce un messaggio con \"Ci dispiace! Abbiamo rilevato un problema con l'installazione che hai eseguito. Cercheremo di riparare i file interessati.\" e si è riaperta la home del profilo. Inutile dire che per un po' non farò più ranked, ma ho appena reinstallato lol e alla prima partita si presenta quel messaggio. Come mai? Cosa posso fare?","replies":[]}]}