{"poster":"YmK Nacro","date":"2016-02-23T15:40:29.368+0000","title":"Imposible jugar","subforum":"Problemas Técnicos","up_votes":34,"down_votes":0,"body":"Ahora mismo entre en una partida, 3 de los 5 de nuestro team tenia un Delay que se les pega el Champ y no pueden hacer nada, despu&eacute;s de unos 15 seg se tira todo lo que apretaste... llega un momento que te llega a salir reanudando conexi&oacute;n.\r\n\r\nYa me canse de jugar as&iacute;, que mi enemigo me gane solo por matarme afk o por lvl, y tambi&eacute;n creo que los dem&aacute;s que sufren de este Delay deben de estar cansados.... Riot si nos ayudas o al menos saber que pasa con esto me calmar&iacute;a un poco mas, no es mi Internet lo comparto con mis hermanos y a ellos no les pasa esto, tampoco son mis fps porque no me baja en ning&uacute;n momento. juego otras cosas y no se me pega como en el LoL\r\n\r\nPD: Darle un +1 para que riot vea esto pls","replies":[{"poster":"FranRanger","date":"2016-02-23T17:47:54.987+0000","up_votes":7,"down_votes":0,"body":"Lo mismo ahora 2 partidas perdidas por problemas de conexión, menos mal que juego aram últimamente. Pense que era el unico...\nBásicamente delay, reanudando, y hay veces que ni te conecta a la partida al principio.","replies":[]},{"poster":"happykidd","date":"2016-02-23T16:55:09.587+0000","up_votes":7,"down_votes":0,"body":"Ayer y hoy me ha pasado lo mismo, sin tener lag o un ms alto, tengo ese delay, y despues de 10 segundos el champ tira todo lo que quise tirar anteriormente, o me quedo parado afk. {{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Arikster","date":"2016-02-24T01:44:11.195+0000","up_votes":6,"down_votes":0,"body":"Me pasa lo mismo que a ustedes, entro a una partida personalizada solo y a los tres minutos aparece el lag, con subidones de 300, 500, 2000 y despues 7218372181748... reanudando conexión! No se, ya estoy aburrido del LOL. Prefiero desperdiciar mi tiempo en otros juegos...","replies":[{"poster":"ZperKS","date":"2016-02-24T03:29:05.010+0000","up_votes":4,"down_votes":0,"body":"Hay que hacer eso, jugar a otra cosa, encima riot no da respuesta","replies":[]}]},{"poster":"Blink Sh4dow","date":"2016-02-23T17:04:56.401+0000","up_votes":6,"down_votes":0,"body":"me pasa exactamente lo mismo, en algunas partidas me quedo pegado y me da un delay de 10 a 20 segundos en los que no puedo hacer nada :/","replies":[]},{"poster":"XVII The Star","date":"2016-02-23T21:07:09.099+0000","up_votes":5,"down_votes":0,"body":"Perdí una ranked por lo mismo >:C","replies":[]},{"poster":"PipeStriker","date":"2016-02-23T20:29:52.273+0000","up_votes":3,"down_votes":0,"body":"a mi me dieron leave buster por esta cosa de que no se me mueve el champ\npense que era problemas del server me sali y me meti al terminar la partida me dieron esta cosa","replies":[]},{"poster":"Rolandkun","date":"2016-02-23T20:26:04.208+0000","up_votes":3,"down_votes":0,"body":"el delay esta horrible en el server pero eso a los rioter no les interesa , prefieren atender cosas inutiles como siempre .","replies":[]},{"poster":"Radox","date":"2016-02-23T19:34:23.796+0000","up_votes":3,"down_votes":0,"body":"Realmente es desesperante , tengo tu mismo problema , cada 10 segundos , el champ pegado por 2 a 4 segundos , despues Reanudando conección y todo el partido así , intenté pedir ayuda a Soporte pero me dicen que configure mi router porque bloquea los puertos de LOL pero todo me funciona perfecto menos LOL , facebook ,, youtube , de hecho hace 1 semana que cambié de 40 megas a 80 y el tema empeora , no se que problema tendrá RIOT con el servidor de LAS en particular pero necesitamos una solución","replies":[]},{"poster":"Micromoon","date":"2016-02-23T21:42:16.512+0000","up_votes":4,"down_votes":1,"body":"debes ser en una parte específica de argentina porque yo estoy jugando lo mas bien hace meses","replies":[{"poster":"Weón Down","date":"2016-02-24T19:18:11.202+0000","up_votes":2,"down_votes":0,"body":"Creo que no es solo Argentina, soy de Chile y tengo ese Delay.. hace unos 3 o 4 dias.","replies":[]}]},{"poster":"Jopomon","date":"2016-02-24T23:35:15.864+0000","up_votes":2,"down_votes":0,"body":"de los dos años que llevo jugando esto en la misma pc (una pc bastante buena a decir verdad) nunca he tenido lag ni subidones de ms hasta hace dos dias atrás....he encontrado ese sentimiento llamado ira xD ...por poco rompo mi mouse de la rabia....asi que ni ganas de jugar lol esta semana....una lástima.{{item:3151}}","replies":[]},{"poster":"Psycho Dominator","date":"2016-02-24T20:12:17.964+0000","up_votes":2,"down_votes":0,"body":"Yo soy de chile Zona norte, tengo vtr de 80mbs y tengo subidas de ping, con 40ms no me reacciona el champ etc. no se que sucede eh reclamado varias veces a mi compañia pero creo que esta ves no es culpa de ellos ya no se que hacer llevo 2 semanas asi :S","replies":[]},{"poster":"GT ISAT","date":"2016-02-24T19:41:58.143+0000","up_votes":2,"down_votes":0,"body":"Estamos en la misma situacion... llega a generar cansancio esto...","replies":[]},{"poster":"2l2","date":"2016-02-23T20:37:56.142+0000","up_votes":2,"down_votes":0,"body":"A mi me pasa cuando mi hermana usa el wifi.\n\nJugare una para ver si hay delay, pero rara vez me anda mal el server","replies":[]},{"poster":"BOT Yásuo","date":"2016-02-23T19:56:19.841+0000","up_votes":2,"down_votes":0,"body":"Llevo 5 minutos conectandome en el login, ni me quiero imaginar como es el ingame...\n\nEDIT: Al inicio me aparecía offline y tuve que usar el Thereisnourflevel para poder entrar...","replies":[]},{"poster":"EzrealSupportOP","date":"2016-02-23T19:23:49.680+0000","up_votes":2,"down_votes":0,"body":"Que raro, yo he jugado 2 partidas recientes y nadie ha tenido problemas.","replies":[{"poster":"YmK Nacro","date":"2016-02-23T19:28:59.634+0000","up_votes":1,"down_votes":0,"body":"solo a algunos les pasa, nose porque a otros no :L","replies":[]}]},{"poster":"MATARUBIUS","date":"2016-02-24T02:19:01.518+0000","up_votes":3,"down_votes":1,"body":"Acabo de jugar una ranked con yasuo, 500 600 MS y no bajan lok, encima ese delay que tiras toooodooo y despues de una hora tira, que basura loko...","replies":[]},{"poster":"PSU Ránkiádó ","date":"2016-04-27T01:18:54.845+0000","up_votes":1,"down_votes":0,"body":"Jajajajajjajajajjaja les tengo una buena noticia esto le pasa a mucha gente ya investigue hable con mi compañia (VTR en Chile) y me dijieron que el modem no estaba bloquiando ningun tipo de señal y que ellos ya conocian invocadores con el mismo problema pero ellos no puede hacer nada ya que Riot no esta prestando ayuda en la busqueda del problema y su solucion.\nCual es el problema? El problema segun rito en uno de sus post es una perdida de paquetes que segun ellos es culpa de la compañia pero yo segui todos los pasos y la verdad es que el problema persiste, tengo pruebas de esto, el % de perdida de paquetes mis ms (19), mis Fps (130) pero como dices hay un delay que empieza en un momento predeterminado de la partida y no para de suceder a no ser que te desconectes constantemente hasta que vuelva a funcionar y luego ya no hay ningun problema sin embargo pasa en un aprox de el 80% de mis partidas.\nNo segun Vtr no hay solucion y riot no me deja preguntar ni ayudar ya que al enviar mi peticion al soporte el boton donde sale \"enviar\" se enisgrece y todo mi informe con todas mis evidencias quedan pegadas en la pagina sin poder ser enviadas la verdad es una lata ya no puedo jugar tranquilo era platino por culpa de estos pertinentes afk soy plata en esta temporada y las normales ya me aburrieron.\nSaludos.","replies":[]},{"poster":"T4N","date":"2016-02-24T19:11:09.832+0000","up_votes":1,"down_votes":0,"body":"Fibertel + GBA (zona sur) tiene inconvenientes. No se si con el nodo o algún cable que produce perdida de paquetes.\n\nedit: Digo gba zona sur por que soy del sur, pero no se cuantas zonas estarían sufriendo este problema.\n\nejecuten el cmd  y hagan ping www.google.com -t y si les aparece un mensaje \"tiempo de espera agotado\" el problema es suyo y no de riot.","replies":[]}]}