{"poster":"StigtriX","date":"2016-11-28T12:52:56.394+0000","title":"LoL exclusive sound issues with Razer Kraken 7.1","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I have a sound issue with League of Legends. It does not matter if I use the old or the new client. There is extreme hissing noises in the background, which does not happen with any other game, or when I listen to music or stream.\r\n\r\nThe sounds that are played when I select things in menus are followed by a hiss. When in a game, the hissing is constant. The hissing is also constant for the music played by the client before I log in. It does not matter if I set the headset to 2.0 or 7.1, or if I turn on or off effects - it is still the same. Nor does it help to re-install drivers. It really seems like League of Legends is to blame for this. Playing with the options in League of Legends does not help either.\r\n\r\nCould you please try to cooperate with Razer to see if the error is on your end? I have sent them the very same information.","replies":[{"poster":"Targons Blade","date":"2016-11-29T02:51:00.445+0000","up_votes":1,"down_votes":0,"body":"Does this issue still occur if you *completely uninstall* or close out Razer Synapse? This application has caused a number of issues for League players in the past, so I'm interested if it's becoming problematic again.\n\nLet me know what you experience with Synapse gone.","replies":[{"poster":"StigtriX","date":"2016-12-07T14:36:42.117+0000","up_votes":1,"down_votes":0,"body":"Yes, it does. I have cooperated with both League of Legends Player Support and Razer Support, and the issue seems to be Razer Synapse and maybe hardware too.\n\nThe issue is there, even without Razer Synapse, but it is taken to the extreme with Razer Synapse. There is some hissing regardless of what I do, but that seems to just be poor hardware or poor software, as this has not always been a problem. For games, the hissing and noises are worse. For League of Legends, the hissing and noises get so loud and obnoxious that it ruins the experience. It is akin to the sound quality of the cheapest pair of IEMs you get with China products for $ 1 (even worse than Apple's oldest pair).\n\nUnfortunately, Razer had no fix. I have contacted the place I bought the headset from, and might get Razer Kraken 7.1 v2 instead that I can test and compare.","replies":[]}]},{"poster":"Axxuka","date":"2016-11-29T03:00:16.051+0000","up_votes":1,"down_votes":0,"body":"It happens to me whenever I'm doing something and the client is in the background (I'm in champ select when it happens with Weird Frame lag).\n\nNot using any special headphones or mouse.","replies":[]}]}