{"poster":"Pablonis Honeyr","date":"2015-07-17T13:38:57.057+0000","title":"Ma che è sta \"gemma runica\"?","subforum":"Aiuto e supporto","up_votes":3,"down_votes":0,"body":"Ragazzi, scusate il post, ma torno su lol dopo un po&#039; di tempo, e ho notato un casino di post su sta presunta gemma runica, allora vado in negozio, la cerco e non la trovo, forse perch&eacute; si chiama in un altro modo o che ne so... qualcuno potrebbe spiegarmi dove la trovo? Dove posso leggere una sua descrizione dettagliata? Perch&eacute; non mi appare nell&#039;account? Saranno di certo domande idiote e la soluzione sar&agrave; pi&ugrave; stupida di quel che penso, ma non sto trovando riscontro da nessuna parte..! Grazie mille in anticipo per chi mi degner&agrave; di attenzione.","replies":[{"poster":"Nevict","date":"2015-07-18T09:06:14.390+0000","up_votes":1,"down_votes":0,"body":"è un oggetto pensato per i junglers ma che viene usato anche dai laners a causa del basso costo. Campioni come Ezreal, Diana e chipiùnehapiùnemetta ottengono un grande vantaggio da questo oggetto.","replies":[]},{"poster":"Rampollox","date":"2015-07-17T23:51:17.300+0000","up_votes":1,"down_votes":0,"body":"E' l'oggetto ap da jungler che si uppa dalla lama del cacciatore(cerca questa nel negozio e troverai la gemma runica).\nGemma runica:\n+50 potere magico\n+200 mana\n+10% riduzione ricarica\n\nAbilità passiva UNICA - Lama incantata: dopo aver usato un'abilità, il prossimo attacco base viene convertito in danni magici e infligge danni magici bonus sul colpo in un'area intorno al bersaglio (1.5 secondi di ricarica). Quando attacchi un mostro ripristina anche 8% del tuo mana mancante.\n\nSe ti trovi contro un ezreal mid con smite, scappa! {{summoner:6}}","replies":[]},{"poster":"Pablonis Honeyr","date":"2015-07-17T13:52:52.247+0000","up_votes":1,"down_votes":0,"body":"Ahhhh ok, visto. Perfetto, grazie mille!","replies":[]},{"poster":"ubercodlegend200","date":"2015-07-17T13:43:19.563+0000","up_votes":1,"down_votes":0,"body":"{{item:3716}} è la gemma blu una versione meno costosa dell litch in pratica ma permette il recupero di mana tutto qui","replies":[]},{"poster":"Vileblood Pyke","date":"2015-07-17T13:43:04.098+0000","up_votes":1,"down_votes":0,"body":"{{item:3708}} {{item:3716}} {{item:3720}} {{item:3724}}","replies":[]}]}