{"poster":"KaZuToKiyoshi","date":"2016-08-23T20:21:45.004+0000","title":"auf der suche nach leute zum ranken ( Bronze - Silber)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"hey leute ich 21 bin auf der suche nach netten flamefreien leuten zum ranken :)\r\nes kann sich jeder melden der lust auf entspannte runden hat .\r\nbin selber main adc mid, kann mich aber auch anpassen.\r\nich hoffe auf ein paar anfragen bis dann freunde.\r\nmfg hoodridge","replies":[{"poster":"KAPPOBY","date":"2016-08-24T07:03:37.775+0000","up_votes":1,"down_votes":0,"body":"Du hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]},{"poster":"NGC Polyxena","date":"2016-08-24T05:37:04.780+0000","up_votes":1,"down_votes":1,"body":"Moin moin Hoodridge,\n\negal ob entspannte Normals oder spannende Rankeds, bei uns findest du für jede Gelegenheit das passende Umfeld. Doch wer wir eigentlich sind erfährst du hier:\n\n[★ Nerds Go Casual ★ Ü18 multigaming Community lädt zum Zocken ein ★](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/FmAmLUvt-a-nerds-go-casual-a-a18-multigaming-community-laadt-zum-zocken-ein-a)\n\nSeit April 2016 haben wir die Tore zu unserer Community geöffnet und sind seither stetig auf der Suche nach freundlichen, aktiven LoL Spieler/innen für den optimalen Spielspaß.\n\nAlso wer weiß, vielleicht dürfen wir auch bald von dir lesen?\n\nLiebe Grüße\nP0lyxena | Julia","replies":[]}]}