{"poster":"gastritis","date":"2017-10-08T15:15:41.361+0000","title":"¿Cual fue su partida mas epica/divertida que  hayan jugado?","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"me gustaria que comenten cual fue su mejor partida y por que \r\npor ejemplo :  hace unos meses jugue una partida con gp y me hice un backdoor aprobechandoq estaban en tf y tire la ulti para cancelar las vuelta a base\r\ncomenten cual fue su mejor partida , puede contar graciosa , bugs , etc","replies":[{"poster":"Desired Game","date":"2017-10-09T02:29:26.505+0000","up_votes":2,"down_votes":0,"body":"Mi partida más épica. Estaba jugando Elise jg y mi amigo Caitlyn adc. \nCuestión que jugamos un muy buen early game, teníamos bastante ventaja en oro y el se había feedeado. Ya estábamos para cerrar la partida pero a eso del minuto 35 nuestro mid y support se van afk, nuestra moral estaba por los suelos (?.\nÉramos 3 (Elise, Caitlyn e Irelia) vs 5.\nYa alrededor del minuto 50 (habíamos defendido bastante bien) ellos empiezan a pushear por medio para intentar tirar la torre del inhibidor, es ahí cuando dijimos \"hay que pelear sí o sí, se pudre todo\" (a todo esto yo me había buildeado Redención, Promesa del caballero, etc. para hacer el máximo peel). \nEs ahí cuando, bajo nuestra torre, le puedo meter una e a su adc que estaba mal posicionado y conseguimos matarlo, después mi amigo empezó a repartir plomo para todos lados y la Irelia hizo una muy buena jugada, hicimos exterminio y pudimos endear la partida porque ellos no llegaban a defender.\nDespués de eso nos hicimos amigos de la Irelia y jugamos de vez en cuando recordando esa partida.\n\nY la partida más divertida que jugué fue un One for all en la season 6. Eramos 5 amigos en Skype y habíamos elegido Jinx.  Me cagué de risa con las tácticas que hacíamos, cómo por ejemplo ir todos al bush de bot al lvl 1 y sacar primera sangre o ultear todos al mismo tiempo a una persona xD \n\nMoraleja: El LoL siempre es mejor con amigos x)","replies":[{"poster":"gastritis","date":"2017-10-15T23:49:36.742+0000","up_votes":2,"down_votes":0,"body":"la semana pasada tambien gane un 3vs5 ja ! \nes verdad con amigos el lo mas y esxtraño uno para todos es mi modo de juego preferido  {{sticker:slayer-jinx-catface}}","replies":[{"poster":"Desired Game","date":"2017-10-17T04:04:54.246+0000","up_votes":1,"down_votes":0,"body":"Si :c","replies":[]}]}]},{"poster":"Ks Erwyn","date":"2017-10-15T23:54:45.008+0000","up_votes":1,"down_votes":0,"body":"Nami supp, ranked tras un parche , se cayeron 7 jugadores  , quedamos yo y un termo aliado VS un Malph hiperfedeado , casi nos  la gana , hasta que me arme full ad/vel. de atk .","replies":[]},{"poster":"StąrDust","date":"2017-10-09T01:39:00.169+0000","up_votes":1,"down_votes":0,"body":"Mi partida más épica fue al principio de la temporada 4, estaba en promo para ir a plata 5 (empecé desde bronce 3) y resulta que el urgot (top) en selección de campeón dijo que iba a trollear, nadie se animó a quitar ( yo estuve a punto de hacerlo pero saque Annie mid), bueno cargo la partida y empezamos a jugar, ni bien empezó el urgot ya regalaba kills, lo mataron 3 veces y se fue afk. Luego la Vi (jg) dice \"gg me rindo report urgot, me voy afk\", quedamos 3 vs 5. Empecé a fedearme y a hacer roaming a bot y a veces a defender a top, después de un rato estábamos en total desventaja, nos habían tirado 2 torres de top, 2 de bot y una de mid, y apenas yo tire una de mid.\nLlegamos a mid game y empezaron a hacer tfs. En las primeras tfs perdiamos pero matabamos 4, a veces sobrevivía el support (creo que era una soraka) o era el jg (era un Lee). Llega un momento en que me calente y les dije a los de mi team que estemos juntos en mid, yo voy a wardear a barón y los enemigos empezaron a atacar a mi team q estaban defendiendo, murieron los 2 y los enemigos estaban en full vida.\n\nBueno quedaba yo solo me dije, así que me decidí a atacar yo solo a los 5, era a matar o morir. Tire flash y últi (oh tibbers mi fiel compañero) luego la W y murieron 2, luego con la Q mate a otro. Tenía todo en cd así q Tiro el zonhya, cuando termina ese efecto mató a los 2 siguientes , uno lo mato tibbers y otro lo mate yo. Bien había ganado la tf yo solo pero no me apareció el PENTAKILL!!!!! si no que decía racha de asesinatos ( no sé si fue un bug o paso mucho tiempo). En fin apareció el adc y el support y tiramos primero mid hasta el inhibidor, backeamos, tuvimos otra tf en donde ganamos y tiramos el nexo. Yo me sentí re powerfull, gane una ranked 3 vs 5 y es así q ascendí a plata 5. \n\nSaludos","replies":[]},{"poster":"corrupted acstil","date":"2017-10-08T17:41:15.130+0000","up_votes":1,"down_votes":0,"body":"una vez estaba en premade de 5 y me toco 2 veces contra el mismo team de 5 y jugamos a bailarnos durante toda la partida y fue una fiesta de bailar en drake los 10 hasta que alguno atacara fue re divertida","replies":[{"poster":"UnMainMordeTonto","date":"2017-10-08T18:26:16.871+0000","up_votes":1,"down_votes":0,"body":"Jajaja, me paso algo parecido, le dije al top enemigo: “No golpees hasta late”, total me dijo que si y estuvimos 25 m en lane farmeando (cabe recalcar que las dos veces que me gankeo el jg ella no hizo nada xD)","replies":[]}]},{"poster":"UnMainMordeTonto","date":"2017-10-08T18:22:20.546+0000","up_votes":1,"down_votes":0,"body":"Pues iba yo Con mi duo tan bonito. Total yo iba supp (Kayle) y el Jg (Vi). El problema es que cuando mi duo me dijo: “apreta tab”, pude ver que el jg (Yi) enemigo iba 15/0. “Listo nos van a romper el culo” dije yo. Mi duo iba bastante bien 3/1 y yo hice mi máximo, supportee bastante bien (al final me saque s- uwu), el problema es que ni el top, ni el adc ni el mid ayudaban (típica partida en la que el mid y el adc le dejan toda la carga al supp y jg), igual los pibes bien, apenas se flamearon (al principio flamearon al teemo por feedear al jg). El caso que el Yi seguía sacando kills, pero mi duo y yo lo matábamos juntos, en eso, el teemo vaya a saber porque, se feedea solo y nos dimos cuenta que mataba al Yi en 1v1. Al final terminamos remontando una partida que iba 40/15 (las TF nos salvaban porque yo y mi duo estábamos re op). La ganamos, y yo me saque S- (nadie mas se saco s), me lleve dos honores y bueno, esa fue mi mejor partida.\n\nPD: Tengo otras partidas buenas (44/4 Fiora, 33/4 Fiora xD y una von riven que ganamos al minuto 10)","replies":[]},{"poster":"Stailuz","date":"2017-10-08T17:46:40.154+0000","up_votes":1,"down_votes":0,"body":"La mejor y más épica partida fue una en la que estaba con 2 amigos y teníamos 2 premades mas como aliados, éramos 5 obviamente, sinceramente solo me acuerdo que usaba a varus y un amigo a blitzcrank, esa partida la íbamos destrozando, rompiendo todo y llega un punto en el que los otros dos premades se van afk y no vuelven más en toda la partida (quedamos 3 vs 5) y seguíamos tirando e intentando ganar. Lo que pasa después es épico, se nos va uno de nuestros premades, y así es como queramos 2 vs 5, y dijimos con mi amigo \"y bueno, vamos, total estamos feed y ganamos la tf si la hacemos bien\" y fue en ese momento, que entre 2 ganamos una tf, mi amigo se murió pero nosotros le matamos a 4 de ellos, y quedaba un enemigo vivo y yo casi sin vida, y me dispongo a pegarle al nexo rogando por romperlo antes de que llegue el enemigo. En todo eso sale y se me tira encima, tiro un flash a un costado y le doy el último básico al nexo y lo ganamos :D. Esa fue la partida más épica que jugue, ganar un 2 vs 5 es algo que me dio tanta adrenalina que termine temblando y con una sonrisa de oreja a oreja.","replies":[]},{"poster":"TheFalc","date":"2017-10-08T16:33:22.187+0000","up_votes":1,"down_votes":0,"body":"Yo era taric.\nYa habíamos destruido las dos torres de nexo, a mi el backdoor no me gusta nada, pero mi tf lo quería hacer y no tenía opción.\nLe tiro W y R mientras Twisted channeleaba la ulti. Entonces aparece en la base enemiga con media ulti mía cargada, empieza a atacar el nexo.\nAparece en Draven enemigo salvaje que estaba feedeado. Le tira un hachazo al gitano, y media vida, pero sólo tenía una Q activa, por ende si siguiente ataque básico no mete tanto.\nPaso seguido mi ulti entra en acción y Twisted se hace invencible justo cuando Draven tenía su Hacha Giratoria. Tf fue invencible el tiempo suficiente como para destruir el nexo.\nhttps://m.youtube.com/watch?v=Plkdw18j0_U","replies":[]},{"poster":"FedecarboneroUY","date":"2017-10-08T16:21:36.086+0000","up_votes":1,"down_votes":0,"body":"No fue la mejor ni la más divertida pero fue épica:\n\nResulta que un día, estaban todo el \"grupito\" conectado, yo iba a jugar una partida con mis 2 primos, mi novia y un primo de ellos y nos preguntaron si queríamos jugar una personalizada 5vs5, les dijimos que no porque quedaba muy robado, nos metimos en cola y cuando estábamos en pantalla de carga pum! nos tocó contra ellos XD\n\nEramos: top mi novia, sólo maineaba rumble, jg mi primo mayor (jugaba 1 vez por mes), mid mi otro primo que también, jugaba de manera muuuuy casual, supp un primo de mis primos que era bronce 5 0pl y adc yo, que nisiquiera maineaba.\n\nEllos tenían: top platino, jg oro, mid oro, adc platino y supp plata.\n\nLa jugamos y casi la ganamos jugamos toditos muy pero muy bien, a pesar de haberla perdido yo los felicité a todos (literal), esa partida  fue inolvidable , la personalizada que no quisimos jugar se convirtió en partida por culpa de Riot xD","replies":[]},{"poster":"elzeta123","date":"2017-10-08T16:14:10.912+0000","up_votes":1,"down_votes":0,"body":"Hubo una vez que me hice 2 cuadrakills con draven en la misma partida, nunca pude matar al morde :c siempre estaba afuera y lejos","replies":[]},{"poster":"Tomyrex143","date":"2017-10-08T15:27:14.466+0000","up_votes":1,"down_votes":0,"body":"Tengo más de 2k de partidas, no me acuerdo.. pero de lo mejor que hice fue un robo de baron con la R de gp a ciegas\nVideo : https://www.twitch.tv/videos/131120374","replies":[]},{"poster":"iEban","date":"2017-10-08T15:30:21.873+0000","up_votes":1,"down_votes":1,"body":"No recuerdo una partida en particular, pero me divierte mucho matar gente con Redención cuando se están escapando. Se siente re troll jaj. Obviamente de cada 10 veces que lo intento me sale una, pero es muy gracioso.\n\nAhora que lo pienso me acuerdo que en promo a Platino 2 gané la primera, perdí la segunda con esos teams que son super flamers, molestos, insoportables y quedé medio tilteado. Entro a jugar la tercera y veo que mi Mid saca Kog'Maw. Claramente no iba a dodgear por estar en promo así que intenté que dodgeen ellos sacando Soraka top (que me gusta jugarla en normales, me divierte) y no dodgeó nadie. Terminamos ganando me la pasé suporteando al Kog.","replies":[]},{"poster":"SKT T1 Bank","date":"2017-10-08T15:28:29.005+0000","up_votes":1,"down_votes":3,"body":"Ya no recuerdo lo que es reir. {{sticker:darius-angry}}","replies":[]}]}