{"poster":"Archangel Raiden","date":"2017-02-20T03:06:57.507+0000","title":"(Champion-Konzept) Zaryn Die Hüterin der Schwertkunst","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":2,"body":"Name: Zaryn Die H&uuml;terin der Schwertkunst \nHerkunft: Unabh&auml;ngig \nRolle: K&auml;mpfer/Assassine\nRasse: Mensch Weiblich\nAussehen: Zaryn hat Wei&szlig;es Haar und Wei&szlig;e Augen, sie tr&auml;gt einen Kapuzen Umhang der ihr bis zur H&uuml;fte geht. Ein Bauch freies Top das beide Arme bedeckt und ein Dreieck &uuml;ber dem Bauchnabel hat. Armschoner die ihre Unterarme Sch&uuml;tzen, und eine Leichte Schulter R&uuml;stung die die Oberarme bedecken. Sie tr&auml;gt eine Schwertscheide auf dem R&uuml;cken. Ein G&uuml;rtel und eine enge Hose die mit Schlangen Linien verziert ist, eine Leichte H&uuml;ftpanzerung die verbunden ist mit der Oberschenkel Panzerung. Hochhackige Schuhe und Schienbeinschoner.  \n ______________________________________________________________________________________\n\nhttp://www.bilder-upload.eu/upload/dff5e8-1487559585.jpg\n\nDas Bild habe ich selbst entworfen und ja ich weiß es ist nicht besonders gut aber so stelle ich mir ihr Aussehen vor nur mit den Farben konnte ich mich nicht entscheiden was ich nehme und wie sie am Ende mit Farben aussieht und es soll so Aussehen als würde sie auf dem Bild Laufen \n ______________________________________________________________________________________\n\nAngriffsschaden: (8/10)\nVerteidigung: (3/10)\nF&auml;higkeitsst&auml;rke: (2/10)\nSchwierigkeit: (5/10)\n ______________________________________________________________________________________\n\n* Attribute\n\nLeben: 605 (+90 pro Stufe)   \nLebensregen: 8.34 (+0.65 pro Stufe) \nAngriffsschaden: 61 (+3.3 pro Stufe) \nAngriffstempo: 0.694 (+3.1% pro Stufe) \nAngriffsreichweite: 125\nRüstung: 26.55 (+3.5 pro Stufe) \nMagieresistenz: 32.1 (+1.25 pro Stufe) \nLauftempo: 345\n______________________________________________________________________________________\n\n* F&auml;higkeiten \n\n* Passive: Volle Konzentration \n\nReichweite: 2000\n\nZaryn animiert ihre Verb&uuml;ndete sich zu Konzentrieren wodurch alle Verb&uuml;ndeten 5 Ad in ihrer n&auml;he bekommen und sie selbst 5 Ad f&uuml;r jeden sichtbaren Gegner in der n&auml;he  \n______________________________________________________________________________________\n\n* Q Skill: Herausfordern  \n\nKosten: 40/45/50/55/60 Mana erneutes Dr&uuml;cken 40 Mana\nReichweite: 600 \nAbklingzeit: 15/14/13/12/10 Sekunden\n\nZaryn macht einen Sprung nach vorne und Fordert ihr Ziel heraus so das der Gegner gegen Zaryn K&auml;mpfen muss hat Zaryn einen Gegnerischen Champion herausgefordert kann sie die Attacke erneut wirken wodurch sie 2 schnell gezielte Schl&auml;ge vollf&uuml;hrt und Schaden verursacht \n\nZaryn macht einen Sprung nach vorne und Fordert ihr Ziel heraus so das der Gegner f&uuml;r 1 Sekunde gegen Zaryn K&auml;mpfen muss hat Zaryn einen Gegnerischen Champion herausgefordert kann sie die Attacke erneut wirken wodurch sie 2 schnell gezielte Schl&auml;ge vollf&uuml;hrt die 40/60/80/100/120 (+70%) normalen Schaden verursachen \n______________________________________________________________________________________\n \n* W Skill: Einsame Wanderin\n\nKosten: 5 Mana pro Sekunde\nReichweite: 1\nAbklingzeit: 5 Sekunden\n\nZaryn holstert ihr Schwert auf dem R&uuml;cken wodurch sie sich schneller bewegen kann Zaryn ist w&auml;hrend der F&auml;higkeit Kampfunf&auml;hig Zaryn ben&ouml;tigt eine kurze Zeit um das Schwert zu Holstern und um es wieder zu Ziehen \n\nZaryn holstert ihr Schwert auf dem R&uuml;cken wodurch sie +10/20/30/40/50 Lauftempo bekommt Zaryn ist w&auml;hrend der F&auml;higkeit Kampfunf&auml;hig und ist um 60% resistenter gegen Verlangsamungen Zaryn ben&ouml;tigt jeweils 1 Sekunde um das Schwert zu Holstern und um es wieder zu Ziehen \n______________________________________________________________________________________\n\n* E Skill: Schallbruch \n\nKosten: 60/65/70/75/80\nReichweite: 800\nAbklingzeit: 11/10/9/8/7 Sekunden \n\nZaryn schneidet mit enormer Geschwindigkeit ein X in die Luft das in eine Richtung fliegt alle getroffene Vasallen und Monster werden durchdrungen trifft Schallbruch einen Gegnerischen Champion so wird er verlangsamt und erh&auml;lt Schaden der Schaden wird bei Vasallen und Monster halbiert \n\nZaryn schneidet mit enormer Geschwindigkeit ein X in die Luft das in eine Richtung fliegt alle getroffene Vasallen und Monster werden durchdrungen trifft Schallbruch einen Gegnerischen Champion wird 20/40/60/80/100 (+60%) normalen Schaden verursacht und  1/1,25/1,50/1,75/2 Sekunden um 50% verlangsamt der Schaden wird bei Vasallen und Monster halbiert \n______________________________________________________________________________________\n\n* R Skill: Tanz der 5 Schwerter\n\nKosten: 100 Mana\nReichweite: 450\nAbklingzeit: 110/80/60 Sekunden\n\nZaryn beschw&ouml;rt 5 Phantom Schwerter die &uuml;ber einem ausgew&auml;hlten ziel kreisen trifft sie das Ziel 5 mal durchdringen die Schwerter das Ziel und verursachen Schaden\n\nZaryn beschw&ouml;rt 5 Phantom Schwerter die &uuml;ber einem ausgew&auml;hltem ziel kreisen trifft sie das Ziel 5 mal durchdringen die Schwerter das Ziel und verursachen 100/200/350 (+100%) normalen Schaden Tanz der 5 Schwerter bleibt 6 Sekunden lang Aktiv bevor die Attacke Abklingt \n\nPassiv: Ist Tanz der 5 Schwerter aktiv werden die n&auml;chsten 5 Angriffe auf das Ziel +20 absoluten Schaden verursachen\n______________________________________________________________________________________\n\n\n* Geschichte \n \nSeit Hunderten von Jahren gibt es einen Geheimen Orden dessen Existenz jedoch unbekannt ist. Dieser Orden widmete sich der Lehre von geheimen Schriften, Magie K&uuml;nsten bis zu vergessenen Kampfk&uuml;nsten, um jene davon abzuhalten deren Macht zu missbrauchen. Und um diese zu erlangen haben die Gr&uuml;nder des Ordens, ihre eigenen Kinder und rekrutierte Kinder ausgebildet, um die vergessenen Schriften zu suchen. 200 Jahre vergingen als Zaryn rekrutiert wurde, nach all den Jahren ist es zur Tradition geworden, das Wissen einer Familie an den n&auml;chsten weiterzugeben. Zaryn stammt aus einer Familie die im Orden, als die H&uuml;ter des Ordens bekannt sind. Dieser Name tr&auml;gt Zaryn&#039;s Familie schon seit 120 Jahre und normalerweise werden die weiblichen Mitglieder, als Magierinnen oder Heilerinnen gelehrt. Doch Zaryn zog es zur Schwertkunst und so lehrte sie sich 3 verschiedene Schwertk&uuml;nste. Zaryn war ein Naturtalent und das machten die jetzigen Anf&uuml;hrer aufmerksam auf das gerade mal 12 Jahre alte M&auml;dchen. Was Zaryn nicht wusste, ist das der Orden schon seit geraumer Zeit einen Feind hatte, der die alten Schriften benutzen will um all jene zu unterjochen die sich nicht seinem Willen beugen. W&auml;hrend einer Mission, die &auml;lteste Schwerkunst Schriftrolle die im inneren einen Magischen Stein h&uuml;tet, aus einem alten Ionischen l&auml;ngst vergessenen Tempel zu bergen. Die besagt, der Auserw&auml;hlte solle mich Ber&uuml;hren, solle wissen was ich sah, solle mich f&uuml;hren und Bezwingen das B&ouml;se, um zu besch&uuml;tzen das verborgene der Welt. Als sie die Schriftrolle hatten und zum Orden bringen wollten, wurde die Einheit &uuml;berfallen. Doch sie konnten die Schriftrolle erfolgreich verteidigen. Nur Zaryn&#039;s Vater kam mit dem Leben davon, doch war schwer verwundet. Als er zur&uuml;ckkehrte, lief er zu den &Auml;ltesten und berichtete was vorgefallen war und das sie wissen wo wir sind. So beschlossen sie, die wichtigen Schriftrollen den Kindern zu geben und sie wegzuschicken, so das der Orden im Untergrund weiterbestehen kann. Die Erwachsenen blieben und versuchten alles zu zerst&ouml;ren und verbrennen, so das der Feind sie nicht bekommt. Doch die feindlichen Einheiten, sind bereits eingedrungen. Zaryn&#039;s Vater rannte zu ihr und gab ihr die Schriftrolle und sagte lauf weg so weit du nur kannst,  verstecke die Schriftrolle und vergiss alles was du von dem Orden wei&szlig;t. W&auml;hrend die Einheiten K&auml;mpften und starben, nahm Zaryn die Schriftrolle und sp&uuml;rte eine Kraft die sie durchstr&ouml;mt. Die Schriftrolle begann zu leuchten und Zaryn&#039;s Augen wurden wei&szlig; und leuchteten ebenfalls. Ihr Vater sah sie mit gro&szlig;en Augen an und sagte du bist die Auserw&auml;hlte. All das Wissen und die Kraft der Schriftrolle, str&ouml;mte durch sie hindurch und sie begann zu Schweben. Der Stein im inneren der Schriftrolle verwandelte sich in ein Schwert. Sie bekam den K&ouml;rper einer Erwachsenen Frau, ihre Harre f&auml;rbten sich Wei&szlig;, wie auch ihre Pupillen. Als sie wieder den Boden Ber&uuml;hrte und aufh&ouml;rte zu Leuchten war sie nicht wiederzuerkennen. Sie hatte einen Blick der so kalt war wie 1000 Jahre altes Eis. Sie st&uuml;rmte auf die Feindlichen Einheiten zu und metzelte einen nach dem anderen nieder. Eine Stunde verging und Zaryn hatte alle Feinde get&ouml;tet. Blut &uuml;berstr&ouml;mt stand sie zwischen hunderten Leichen und die &uuml;berlebenden Ordensmitglieder guckten sie mit Angsterf&uuml;llten Augen an. Die &Auml;ltesten wussten das ihre Arbeit getan war, sie gingen zu Zaryn und sagten du bist Auserw&auml;hlt, all das wissen der Schwertkunst vor dem B&ouml;sen zu besch&uuml;tzen. Zaryn guckte ihn an und blieb stumm als Auserw&auml;hlte wurde sie unsterblich und somit zu einer Legende der Welt. Man erz&auml;hlte sich, wen Zaryn einen Ort aufsuchen w&uuml;rde, sp&uuml;re man ihre Anwesenheit, doch nur wenige Menschen haben sie bisher zu Gesicht bekommen oder wissen wie sie aussieht. Ihre Pr&auml;senz sei so stark, das man in ihrer n&auml;he erstarren w&uuml;rde. Die &uuml;berlebenden des Ordens, berichteten &uuml;ber sie was an diesem Tag geschah. Und auch nach all den Jahren, h&ouml;rte man immer wieder von ihr. Und ihre Geschichte wurde von Generation zu Generation der Ordensmitgliedern weitergegeben, verpflichtet die Geschichte der Auserw&auml;hlten zu erz&auml;hlen, sammelten die Ordensmitglieder Informationen &uuml;ber sie und es schien als w&auml;re sie nach so langer Zeit sehr einsam und doch verteidigt sie weiterhin die alten Schriften. Aber immer &ouml;fter, berichten Schwertk&auml;mpfer das sie die Auserw&auml;hlte gesehen haben und sogar gegen sie k&auml;mpften, aber nicht um sie zu T&ouml;ten oder von ihr get&ouml;tet zu werden, nein durch ihre Einsamkeit hat sie begonnen Schwertk&auml;mpfer herauszufordern, weshalb sie das tut ist uns nie so richtig bewusst gewesen. Doch eines Tages, traf sie auf einen Samurai, der wie sie alleine durch die Welt schreitet. Sie forderte ihn heraus, sie K&auml;mpften unerm&uuml;dlich ohne den kleinsten Laut von sich zu geben. Jeder Schwertschlag, jeder Schwung, soll gewesen sein, als w&uuml;rden sie mit einander Tanzen. Es hei&szlig;t, sie k&auml;mpften 3 Tage und N&auml;chte, bis sie die Schwerter niederlegten. Der Samurai k&auml;mpfte mit einer Schwertkunst die selbst sie nicht kannte. Nach diesem Tage, war sie nicht mehr die einsame Auserw&auml;hlte, sie hatte jemanden gefunden, der wie sie das wissen &uuml;ber eine l&auml;ngst vergessene Schwertkunst tr&auml;gt. So erz&auml;hlt man sich es in der Legende. Diese Geschichte haben mir meine Eltern hundert mal erz&auml;hlt, ich selber erz&auml;hle sie bis heute weiter, so das die Legende nie vergessen wird. Ich habe mich immer gefragt, was mit ihr geschah, da man nie wieder, was von ihr oder dem Samurai h&ouml;rte. Die Leute haben sich ihre eigenen Geschichten erfunden, was mit ihr geschah, manche glaubten sie k&auml;mpften bis sie beide starben, andere sagten sie haben sich Verliebt und zu Ruhe Gesetzt und ein normales Leben gef&uuml;hrt haben und wiederum andere sagten, sie zogen gemeinsam durch die Welt. Was genau mit denen beiden geschah, das wissen nur einige Leute des Ordens. die ihre Geschichte verfolgten und ich bin eine davon. W&auml;hrend dem Massaker im Tempel des Ordens, starb Zaryn&#039;s Vater. Sie begrub ihn auf einem Berg in einem abgelegen Teil der Welt. Jedes Jahr, geht sie dort hin und besucht ihn. Doch auch dort begrub sie den Samurai, es stimmt vermutlich das sie ihn geliebt hat. Doch war er nicht wie sie an diese Welt gebunden. Die die Wahrheit kennen, wissen auch, das als der Samurai starb Zaryn verschwand und nie mehr gesehen wurde. Nur wir wissen wo sie sich einmal im Jahr aufh&auml;lt. Das ist die Legende von Zaryn die H&uuml;terin der Schwertkunst.\n\n...Zitat der Erz&auml;hlerin...\n...Die Liebe vermag selbst den St&auml;rksten zu Brechen...","replies":[{"poster":"jimmk","date":"2017-02-25T13:57:37.069+0000","up_votes":1,"down_votes":0,"body":"Interessantes Konzept, allerdings muss ich sagen das die W von ihr auch als Passive mit timer gehen könnte. Als W wäre dann eine art Ausweich-mechanik denkbar, also das der Champ für eine bestimmte Zeit jegliche Angriffe pariert und selbst zur seite ausweicht (In Richtung des Mauszeigers vorzugsweise?).\n\nAuch sehe ich leichtes Overscaling bei der Q. 70% extra Schaden kann schnell mehr als nur ein leichtes Pieksen sein!\n\nAnsonsten sehr gutes Konzept! Weitermachen! :)","replies":[]},{"poster":"Bladewind515","date":"2017-02-20T14:39:47.085+0000","up_votes":1,"down_votes":0,"body":"Ich finde das Konzept sehr gut weil es sich solide und spaßig anhört. Nur die Passive ist so.. naja.. passiv^^.  Die KÖNNTE man eventuell etwas ändern aber ales in allen ist das echt nen gutes Konzept:)\n\nMfg Bladewind","replies":[{"poster":"Archangel Raiden","date":"2017-02-20T18:44:21.687+0000","up_votes":1,"down_votes":0,"body":"freut mich zu hören mit der passive bin ich auchnicht wirklich zufrieden leider habe ich heute keine zeit mehr werde mich aber morgen nochmal dran setzen ^^ und danke für deine Kritik","replies":[]}]},{"poster":"Archangel Raiden","date":"2017-02-20T03:16:17.472+0000","up_votes":1,"down_votes":0,"body":"Hoffe das sie euch genau so gut gefällt wie mir ^^ und freue mich über jede Kritik ","replies":[]}]}