{"poster":"IsIsGankedParis","date":"2014-07-08T23:43:20.316+0000","title":"@Riot I got an idea for a Malzahar Skin.","subforum":"Champions & Skins","up_votes":5,"down_votes":1,"body":"He would be in a snow suit and would say quotes like it's freezing or some other stuff like that, the skin would be 1350 because of some particle effects.\r\n\r\nThe voiding would be a poro that spawns every 4 spells. His Q would be 2 ice balls and snow comes out. His W would be like a frozen lake, his E would have a cloud with snow coming down on the enemy as they get chillier by the second. His R would be like a snowblower blowing snow into somebody's face.\r\n\r\n\r\n\r\n\r\nEdit: It could also show a poro snax above an enemy with his E on them, idk.","replies":[{"poster":"Riot Sotere","date":"2014-07-10T08:16:56.542+0000","up_votes":6,"down_votes":0,"body":"I feel like you're cheating. Anytime you can squeeze a poro into a skin idea I want it.","replies":[]},{"poster":"hartar","date":"2014-07-10T10:31:39.161+0000","up_votes":2,"down_votes":0,"body":"There is one problem with this skin.Nobody is going to attack the poro.","replies":[{"poster":"Hyrum Graff","date":"2014-07-10T15:22:16.106+0000","up_votes":1,"down_votes":0,"body":"This is what I've said about all of these type of ideas. **Poro skins aren't OK if it's possible to attack the poro.**","replies":[]}]},{"poster":"621jimmy","date":"2014-07-09T01:04:11.213+0000","up_votes":2,"down_votes":0,"body":"10/10, would buy.\n\nSnowdown skin?","replies":[]},{"poster":"Draessi","date":"2014-07-09T19:16:26.676+0000","up_votes":1,"down_votes":0,"body":"The skin idea seems awesome! The ideas of poros and snow doesn't really fit Malzahar though.. He's like, a human that entered the void and was corrupted. Having poros as a skill would make it seem unfair since no one else gets them :P","replies":[]},{"poster":"MarkofShame","date":"2014-07-09T06:22:02.708+0000","up_votes":1,"down_votes":1,"body":"While its an interesting concept I dont personally like it. I mean thematically it feels really forced. like Snowmerdinger is he's a snowman and so ice stuff makes sense. Snow day ziggs he throws snow balls instead of bombs and theres complete cohesion, but a rag tag half poro/snow half like weather person who also has a snow blower? Yes I know skins dont require that sort of cohesion, but I dont think that idea is as cool as it coul be thats for sure.","replies":[]}]}