{"poster":"IsIsGankedParis","date":"2014-11-25T20:51:08.213+0000","title":"Oh Look another champion with high mobility mixed with high damage","subforum":"Gameplay","up_votes":17,"down_votes":7,"body":"And they said mobility will pay with less damage, silly Riot, if that's the case then why doesn't mordekaiser have WAY more damage for having no spell involve his or anybodys mobility?","replies":[{"poster":"TehNACHO","date":"2014-11-25T20:58:07.680+0000","up_votes":11,"down_votes":1,"body":"They already released the numbers on her kit?\n\nNo but seriously though, her ult doesn't even apparently do damage. Everything about Rek'Sai's kit as we know it now screams \"Auto Attack Fighter with mobility based utility\". Unless you're one of those players who thinks Volibear's damage is op, I really don't see any point in complaining about Rek'Sai yet.","replies":[{"poster":"MrBuffington","date":"2014-11-26T03:48:24.250+0000","up_votes":1,"down_votes":0,"body":"[They have some numbers on S@20](http://www.surrenderat20.net/2014/11/1125-pbe-update.html). I'm really excited :D","replies":[]}]},{"poster":"Meddler","date":"2014-11-25T23:26:22.565+0000","up_votes":14,"down_votes":5,"body":"Our goal is that Rek'sai's be highly mobile, particularly in a strategic sense (pre-placed tunnels, ultimate, Tremor Sense) while lacking the ability to burst down a target. Her Q's damage is spread over a few hits, her E requires her to build up Fury to maximize its damage and a fair bit of her damage comes from auto attacking too. She's also got limited inherent crowd control or tankiness, so while she can be very mobile the intent is she's both paying a significant price for that and has her mobility gated by how well she's set up previously.","replies":[{"poster":"shppy","date":"2014-11-25T23:52:00.536+0000","up_votes":11,"down_votes":4,"body":"> Our goal is that Rek'sai's be highly mobile, particularly in a strategic sense (pre-placed tunnels, ultimate, Tremor Sense) while lacking the ability to burst down a target.\n\n\nYeah man, cuz there's no way champions can buy more Burst than their kit innately possesses... oh wait: {{item:3074}} {{item:3078}} {{item:3100}} {{item:3128}} {{item:3153}}\n\nMeanwhile buying ways to make up for a lack of mobility doesn't exist. Hence the reason even when you 'take away the damage' of a highly mobile champ they'll still be better than immobiles... they can build out of their weaknesses.\n\nHell, that's the reason anyone with half a brain knew 'taking away the damage' from Kalista wouldn't do much of anything... can she build crit and IE? Then take away all the damage from her abilities that you want, it's irrelevant.","replies":[{"poster":"MrBuffington","date":"2014-11-26T02:54:27.282+0000","up_votes":6,"down_votes":1,"body":">Meanwhile buying ways to make up for a lack of mobility doesn't exist\n\n{{item:3800}} {{item:3069}} {{item:3142}} , not to mention a plethora of items that offer move speed or mechanics that allow for bonus mobility, like Phage passive or BotRK active.\n\nAlso boots.\n\nSure it isn't a dash, but have you tried Righteous Glory? It's like Talisman and Randuin's had a kid; it's really awesome\n\nAs far as damage goes, Kalista actually has comparatively low damage to other ADCs (hypercarries in particular; she's utility, thus has similar damage to other utility ADCs like Ashe), it's just clouded by the fact that ADC itemization as a whole is too strong.","replies":[{"poster":"shppy","date":"2014-11-26T22:01:55.671+0000","up_votes":2,"down_votes":0,"body":"Generally speaking, buying movespeed isn't 'making up for a lack of mobility'. Comparing movespeed increases to moveblocks is like comparing a bicycle to a car, and it's definitely not comparable to the potential for purchasing burst as a low-burst champ.\n\nFor starters, movespeed is painfully easy to cancel out, especially with the overabundance of ranged slows nowadays... it only takes a measely 40% slow to more-than-cancel out Glory's haste, only 30% to outdo Talisman. Moveblocks ignore slows, completely. Actually, they pretty much ignore harder (non-displacement) cc too, unlike movespeed boosts.\n\nSecond, movement via movespeed is WAY slower, and generally doesn't last long enough to make up for it. Glory will let a champ cover roughly ~475 units of extra distance over the 3 seconds (ex: ~375 MS x 1.6 = 600, softcap drops that to 530. You'd move an extra 155 units per second for 3 seconds, 465 in total, assuming no slows). Most dashes cover a greater distance than that in a fraction of the time. Ghost is one of the few non-kit-based increased MS choices that has a long enough duration to actually render it better at covering distance than a typical dash, and even that's not by much (for the 375 MS mentioned above, ghost allows you to cover an additional 890 units over 10 seconds assuming no slows) and it takes a damn long time to do so.\n\nAnd finally, 'mobile' champs are fully capable of benefiting from those increased MS options as well, as a level of mobility that would be considered 'enough' or 'wastefully excessive' pretty much doesn't exist. On the other hand, the means I mentioned for adding onto the burst of a character lacking burst are not always the best choices for champs that already possess high burst... there is such a thing as having 'enough' or 'wastefully excessive' burst damage. Pretty much this comes down to is the 'haves' of mobility get to benefit just as much as the 'have nots' of mobility from the various increased movespeed options that exist, while the 'haves' of burst generally don't have as much to gain as the 'have nots' of burst when it comes to itemizing burst damage.\n\nHaving low mobility is MUCH harder and less effective to buy your way out of than having low burst.","replies":[{"poster":"MrBuffington","date":"2014-11-26T23:18:56.483+0000","up_votes":2,"down_votes":1,"body":">buying movespeed isn't 'making up for a lack of mobility'\n\n...then what is it? All you're arguing is that MS is generally worse than a dash (which isn't always true; for example a lot of pro players opt for Ghost instead of Flash on certain champions). Immobile champions are balanced with that in mind; same thing for mobile champions. Ryze was an absolute menace in top lane (also occasionally in mid lane) for months until Riot gutted him. Orianna has been queen of mid lane for the past two years. Kog'Maw is arguably the most powerful late game ADC in the game. Janna was one of if not the most played support at Worlds, had something like a 70% win rate. On the flipside, when LeBlanc got gutted, was her mobility enough to save her for pro play? When Kassadin got reworked, he basically disappeared from pro play for a long time. Ezreal is one of the slipperiest champions in the game and I've seen him in maybe one pro game in the past year, and I'm pretty sure he lost. You're acting like mobility is the only thing in this game that matters; it's not.\n\nA few more things:\n\n1. Tenacity exists to counter CC like slows. Champs that build items like Righteous Glory are generally going to build tenacity, or have some sort of innate CC reduction (ie. Olaf)\n2. There is absolutely 'enough' and 'wastefully excessive' mobility. You will never, ever see a carry build Righteous Glory or Talisman (unless they're trolling or something). Kassadin can go through a game not even buying boots cause hey, he has a flash on a 3 second cooldown (he'll just buy more damage or mana). Late game ADCs will actually sell their boots in favor of something like a Zephyr, actually losing mobility. They don't need the mobility; they're not going to build it.\n3. For the record, the 465 units you calculated is actually 65 units greater than Flash. Also it's on a 60 second cooldown, so there's that.\n\nLook, I'm not saying that MS buffs are better than dashes (this was in my original comment); I'm not saying they're worse either. I'm saying this game is infinitely more complicated than \"lulz mobile champions win\". Need I remind you that Ryze counters Fizz (and most mobile, melee assassins, actually)?","replies":[{"poster":"shppy","date":"2014-11-26T23:54:59.589+0000","up_votes":1,"down_votes":0,"body":"1) As I pointed out, Ghost is pretty much the only non-kit-based MS boost that's comparable to a dash, because of the sheer duration. Believe me, I know, I run Ghost on damn near every melee. Other itemizable MS boosts generally don't compare.\n\n2) Tenacity does exist, but Glory+Tenacity still isn't that impressive in the face of slows... as I pointed out a mere 40% is more than enough to cancel out Glory's increased mobility range, all it'd take is a little higher % or a little longer duration. Or something harder than a slow. Not to mention slow fields are also becoming increasingly common, which are effectively unreduceable through tenacity.\n\n3) My implication was 'enough' within the realm of similar stat prioritization. As in, an immobile ADc versus a mobile ADc with regards to Youmu's, or a mobile tank/initiator versus an immobile tank/initiator with regards to Glory. Having innate moveblocks generally doesn't mean you disregard build options with more mobility, the same way having moveblocks generally doesn't stop people from taking Flash.\n\n4) Flash is also one of the shorter range moveblocks in the game. The majority of innate dashes are considerably longer range than flash; Glory may compete with Flash in terms of distance covered, but it doesn't compare well with most kit-based dashes, especially since it also takes longer.\n\n5) Ryze counters Fizz because Ryze counters melee, not because Ryze counters mobility. As a generality, X (targeted) range > X-distance moveblock, as range fulfills the same basic purposes as mobility (extending own imminent threat radius, staying out of enemy imminent threat radius) with less exposure to risk and without having to worry about limited usage (like using up cds).","replies":[{"poster":"MrBuffington","date":"2014-11-27T00:30:18.485+0000","up_votes":1,"down_votes":0,"body":"1. Right, so this still undermines your point that MS doesn't compare to dashes. If you want to talk about itemization, it's equally possible imo that bursty items are more prioritized over mobility items since champions value burst more than mobility (read: mobility isn't as important)\n2. I would say hard CC is becoming just as common, which counters dashes and MS, arguably counters dashes more since MS durations can actually exceed the hard CC.\n3. Correct me if I'm wrong, but Youmuu's isn't exactly a core buy on Kog'Maw; Lucian can build all the mobility he wants but come late game Kog'Maw will still out-duel him. Honestly I'm more afraid of a full-tank Olaf running at me with RG than a full tank J4 jumping on me with like, Randuins.\n4. Well you have to ask should it be able to compare? Again, immobile champions are balanced with their immobility in mind. Items are more meant to enhance a champion's strengths, and to a lesser degree, compensate for some weaknesses. I mean sure, you can give everyone the option to buy a Kass ult, and then give everyone the option to buy Veigar's one shot potential, but what kind of game does that turn into?\n5. Ryze counters Fizz, to my understanding, because he has an instant targeted root, which negates Fizz's mobility and cannot be dodged by the troll pole. He struggles against long range mages because he himself is pretty short ranged.\n\nThe point I'm trying to make is that this game is very nuanced. You'll see J4 initate a fight more than say, Mundo, since J4 actually has the tools to do so. Once he's in the fight, though, his impact falls off, where if Mundo gets into the middle of a team, everyone starts melting. Different champions have different strengths and weaknesses, the game is balanced around that. Yes mobility is a huge part of this game, yes there are some problems associated with it, and yes some of the older champions are outdated, maybe because of a lack of mobility, maybe because a lack of counterplay to mobility, more likely because they're just not designed for the current game.\n\nIt's hardly as critical or binary as you're making it seem, though. I've seen Doublelift and Sneaky play the Kalista-Kog'Maw match up on both sides, both times Kog'Maw was the clear winner by a long shot. Sure Kalista counters immobile melee champions; that's why you don't stubbornly pick immobile melee champions into Kalista. Other champions will counter Kalista. And other champions will counter those. Somewhere along the line immobile melee champions have their place.\n\nEDIT: Now, are immobile melee's balanced? Maybe, maybe not; they introduced Righteous Glory for a reason; to give immobile champions a way to respond to mobility. I'm more trying to make a theoretical point that you don't need a dash to compete with champions that do, as shown by champions I've mentioned (Ori, Ryze, Kog, etc).","replies":[]}]}]}]}]},{"poster":"Narasimha","date":"2014-11-26T04:45:11.540+0000","up_votes":3,"down_votes":0,"body":"> Hell, that's the reason anyone with half a brain knew 'taking away the damage' from Kalista wouldn't do much of anything... can she build crit and IE? Then take away all the damage from her abilities that you want, it's irrelevant.\n\nIts also why people with most of a brain realized that {{item:3110}} or {{item:3143}} counters her twice as hard as other adcs. Not only loss of attack speed, but there goes her mobility as well.","replies":[{"poster":"Dig Dux","date":"2014-11-26T17:59:41.600+0000","up_votes":2,"down_votes":0,"body":"In exchange for getting slowed by attack speed debuffs she also does not have to build as much movement speed.\n\nzeal is not needed\npd is not needed\nshe is very resistant to normal slows due to her primary movement being her dash making it easier to kite champions such as skarner and olaf.\nzerkers is the only boots she will ever buy and even then you can stall off buying boots for longer than on most other adcs.\n\nKeep in mind attack speed slows got destroyed last season when nasus was highly visible.","replies":[{"poster":"MrBuffington","date":"2014-11-26T23:05:16.057+0000","up_votes":2,"down_votes":0,"body":"ADCs don't build Zeal for the MS. They build it for the attack speed and crit.","replies":[]}]}]},{"poster":"Fury and Emperor","date":"2014-11-26T18:06:33.002+0000","up_votes":2,"down_votes":0,"body":"> Meanwhile buying ways to make up for a lack of mobility doesn't exist. Hence the reason even when you 'take away the damage' of a highly mobile champ they'll still be better than immobiles... they can build out of their weaknesses.\n\nSo, do you think there should be an item with an active that prevents the use of mobility skills?","replies":[{"poster":"Dig Dux","date":"2014-11-26T18:11:05.720+0000","up_votes":2,"down_votes":0,"body":"I kind of like the idea of a forced root item (cause roots prevent dashes), the active of {{item:3092}} is pretty useless against any champion with a dash but easily destroys olaf, skarner, udyr, among others.\n\nIf only silence was still a thing... but it destroyed low mobility champions even more than high mobility champions due to the fact the targeted silences are scary as hell.","replies":[{"poster":"shppy","date":"2014-11-26T21:22:30.335+0000","up_votes":1,"down_votes":0,"body":"you don't want hard cc to be itemizable, trust me. And a root would still punish immobiles harder than mobiles anyway (both can't move for the duration, but the ground enemies will gain on an immobile during the root is far more valuable than the ground they'll gain on a mobile champ... the mobile can open up space after the root ends far more easily than the immobile)\n\n\nI believe there should be a new form of cc (call it something like 'dizzy' or 'crippled') that disables moveblock skills only (including flash) without actually impairing anything else. No root or slow attached, no disabling of other abilities. \n\n(I could argue it wouldn't be bad to have it disable increased movespeed effects besides 'enhanced movement' from boots while active as well, be they from temporary buffs or permanent increases... it wouldn't actually provide a slow on its own, it'd just cancel out bonuses. But for initial testing I'd keep it as solely an anti-moveblock thing before taking it any further.)\n\nAnyway, this cc should be reworked into a bunch of kits (pretty much only onto melees, whose potential is hurt far worse by opposing mobility), either in place of harder ccs that are imbalanced/unhealthy (like Irelia's stun, or Talon's former silence, or Lee's MS slow) or to help out kits that have gotten phased out by mobility (such as adding it onto Darius's W instead of one of the slows, or adding it onto Morde's Q). And if this cc were implemented, it wouldn't be horrible to add it onto an item as an active either, as long as the item pays an appreciable price for the active, and ideally has rather limited range.","replies":[{"poster":"Dig Dux","date":"2014-11-28T12:04:49.134+0000","up_votes":1,"down_votes":0,"body":"Yeah I thought about the problem a root would add to melees :(\n\nI was thinking about \"entangled\" which is the status effect on Ammumu's ult since it hurts ranged and melee adc champions equally.\n\nbut Yeah itemizable cc would be brutal.\n\nA combined slow and \"moveblock\" would likely work best since lower mobility champions would still have the option to dual it out for a few seconds or use hard cc to escape while this soft cc would really hurt high reward low risk champions like katarina, zed, and most of the new champions.\n\nPoor Riot is so out of date the additional changes they put in for season 5 make me laugh and cry at the same time.","replies":[]}]}]}]}]},{"poster":"Ptarlorr","date":"2014-11-26T01:28:40.187+0000","up_votes":3,"down_votes":0,"body":"As opposed to Kass and Kalista who can just sorta move 3 feet away whenever. Neat idea. The tunnels remind me of Maokai saplings what with the forethought and all, but Rek'sai seems more of a long-term playmaker. I like it.","replies":[]},{"poster":"Velasan","date":"2014-11-26T02:50:23.629+0000","up_votes":2,"down_votes":0,"body":"Meddler whatever anyone else says I approve of the new champion and I want to play it soon.  I play a lot of mixed damage champions.\n\nTremor sense looks like a really cool mechanic.","replies":[]},{"poster":"Totalwanabe","date":"2014-11-25T23:47:20.805+0000","up_votes":2,"down_votes":0,"body":"i've been playing long enough to tell you that jungle will be her 2nd role her main role will be top tank, extreme mobility, cd/fury bar, good dmg beside good engage/disengage and your wrong about the lee sin sure she can't counter jungle but if you build her tank she will destroy him in a duel or make him run away.","replies":[]},{"poster":"Marenjii","date":"2014-11-25T23:30:38.636+0000","up_votes":4,"down_votes":3,"body":"> Our goal is that Rek'sai's be highly mobile, particularly in a strategic sense (pre-placed tunnels, ultimate, Tremor Sense) while lacking the ability to burst down a target. Her Q's damage is spread over a few hits, her E requires her to build up Fury to maximize its damage and a fair bit of her damage comes from auto attacking too. She's also got limited inherent crowd control or tankiness, so while she can be very mobile the intent is she's both paying a significant price for that and has her mobility gated by how well she's set up previously.\n\nCan you now explain to people why Kalista is not OP please? Apparently mobility is the end all be all on these forums.","replies":[{"poster":"Totalwanabe","date":"2014-11-25T23:48:42.303+0000","up_votes":2,"down_votes":1,"body":"kalista start has a support and transcend into an adc her strong point is also her weakness","replies":[]},{"poster":"Meep Man","date":"2014-11-25T23:40:31.465+0000","up_votes":1,"down_votes":0,"body":"Because she is super squishy if caught out.","replies":[]}]},{"poster":"Svddenly","date":"2014-11-26T14:45:13.505+0000","up_votes":1,"down_votes":0,"body":"She is so damn slow w/o tunnels or ult. Can hardly catch people when I have Furor boots, Mallet, and Tri-Force.","replies":[]}]},{"poster":"Meep Man","date":"2014-11-25T23:38:22.605+0000","up_votes":3,"down_votes":0,"body":"If a champion was compensated for a lack of crowd control and/or mobility, Mordekaiser would be DESTROYING! But in truth, he does a lot of damage especially since he mainly does AoE. He can also go 2v1 effectively if he can kill one of them. ALSO, we don't know the damage of her yet.","replies":[]},{"poster":"Xtremey","date":"2014-11-25T23:52:45.782+0000","up_votes":1,"down_votes":0,"body":"I can see the full build now: devourer into full tank. If she is a jungler, which i doubt.","replies":[]},{"poster":"Cale017","date":"2014-11-25T21:47:35.430+0000","up_votes":1,"down_votes":0,"body":"From what they showed, the highest her damage can get is with a full fury bar, which means you're going to have to build significant tank to be able to duel someone long enough for that to happen in a 1v1 situation. She also lacks CC outside of a knockup, which means that while yeah she's highly mobile, she doesn't exactly lock targets down, and neither does she put out so much damage that you can't overcome it. From the look of things she's also going to be pretty easy to kite like any other tanky melee jungler, and she can't auto attack while she's burrowed which means that if she uses it to chase you down she's healing, yes, but she's also losing the resource that builds up to give her bite more damage while she is. So in order to keep up with someone who's kiting her, she's going to be losing out on damage potential.\n\nBuild a Frozen Mallet or Rylai's Crystal Scepter and you'll be k. I promise.","replies":[{"poster":"Totalwanabe","date":"2014-11-25T23:49:49.427+0000","up_votes":1,"down_votes":1,"body":"she's a better version of gnar if she's builded tanky","replies":[]}]}]}