{"poster":"IsIsGankedParis","date":"2014-12-26T18:36:49.500+0000","title":"People complain that Darius is too oppresive vs melees at top","subforum":"Gameplay","up_votes":29,"down_votes":11,"body":"Why the fuck do these same people not give a shit about Karma, Nidalee, Quinn, and many more ranged top laners being WAY more oppressive to these same melee champions?\n\nYou have no fucking chance vs these ranged top lane as if you get in range they will just smack you away or have escapes out the ass.","replies":[{"poster":"BeatzBoyFTW","date":"2014-12-26T19:23:28.628+0000","up_votes":5,"down_votes":18,"body":"Rocks in early game, kinda scales suckish late game \n-{{champion:43}} {{champion:76}} {{champion:133}}","replies":[{"poster":"Keyoshi","date":"2014-12-26T20:48:58.609+0000","up_votes":22,"down_votes":2,"body":"I don't know what your talking about, quinn is amazing late game. She can duel anyone with 6 items","replies":[{"poster":"Narasimha","date":"2014-12-26T22:32:13.939+0000","up_votes":2,"down_votes":9,"body":"...What?\nThe only people who even go for 1v1 late game are assassins, and she stands no chance against those.","replies":[{"poster":"Black Star 1299","date":"2014-12-26T22:41:03.330+0000","up_votes":1,"down_votes":6,"body":"Only three she can't duel are {{champion:84}} ,{{champion:105}} , and{{champion:91}} . The rest, either she can run away from them safely, or win against.  I'd say that's pretty good for number of champs one can 1v1 against late game. Ecspecially for an adc, which is pretty darn vital for survival against assassins in teamfights when there's less peel in solo queue. (Note on why Lucian, Vayne, Corki, or Tristana were or are favored at some point in the game, they still could run/ 1v1 assasins)\n\nMaster Yi is utterly useless for 1.5 seconds, Rengar is the same thing too, Zed gets kicked in the face when he ults, Kat wastes her jump and her ult everytime she goes in (and facekicked).\n\n(Quinn's an adc for a reason, people. She does pretty decent damage, and can handle most threats pretty well.)","replies":[{"poster":"Narasimha","date":"2014-12-26T22:56:59.901+0000","up_votes":1,"down_votes":1,"body":"Ren can burst her before she can even blink, and Zed can just use W to jump to her again.\nKha also stomps her, as do Diana, Leblanc, and Shaco.\n\nAlso, theres a reason she's not played as an adc, and is more favored as a top lane ranged bruiser.","replies":[{"poster":"Keyoshi","date":"2014-12-26T23:00:44.850+0000","up_votes":6,"down_votes":0,"body":"Valor's pretty much an assassin. That blind throws people off. People seem to forget she has a blind and thats why she can duel so well.","replies":[{"poster":"Thighlander","date":"2014-12-26T23:39:00.345+0000","up_votes":1,"down_votes":0,"body":"It's probably because the two blinds in the game are really buggy and potentially do nothing that they don't realize she has a blind.\n\nBut then again, the giant gray text is pretty hard to miss.","replies":[]}]},{"poster":"Brenticus12","date":"2014-12-26T23:48:19.393+0000","up_votes":1,"down_votes":0,"body":"She's not played ADC because her range makes it easy to harass her. \nRen won't be able to touch her after his ult because a simple Q invalidates his burst.\n\nKha gets destroyed by a single passive-E-Q combo.\nDiana, idk, never gone up against her as Quinn.\nShaco gets destroyed easily.\nLB, £'m not so sure either even though I have defeated 1 or 2 in lane before.","replies":[]}]}]},{"poster":"Brenticus12","date":"2014-12-26T23:43:26.228+0000","up_votes":1,"down_votes":0,"body":"She does, as long as you don't waste your E before they gap closer. Some harder ones to fight against would be Fizz and Akali but she can still duel with many other assassins like Zed and Kassadin.","replies":[]}]},{"poster":"Minuano","date":"2014-12-27T00:25:04.854+0000","up_votes":3,"down_votes":0,"body":"{{champion:24}}","replies":[{"poster":"Keyoshi","date":"2014-12-27T02:52:16.819+0000","up_votes":2,"down_votes":1,"body":"what about him?","replies":[{"poster":"Minuano","date":"2014-12-27T06:56:05.502+0000","up_votes":1,"down_votes":0,"body":"Can duel Quinn.","replies":[{"poster":"Keyoshi","date":"2014-12-27T13:13:40.257+0000","up_votes":1,"down_votes":0,"body":"I feel pretty confident quinn would win, both saying they have the same skill level. Quinn/valor is strong people really underestimate her damage.","replies":[]}]}]}]},{"poster":"Cindikle","date":"2014-12-27T21:40:05.213+0000","up_votes":1,"down_votes":0,"body":"Yes Quinn does in fact scale very well. \n\nBut falling off late game has more to do with viability in a teamfight than dps.\n\nIn terms of what Quinn brings to a teamfight, it's not much outside of being very good at chasing targets. Otherwise you can always pick another champion that can do better from each lane. \n\nUnless she gets ahead in lane(easy enough to do) her team will suffer for having her. Overall you win at midgame with her and avoid seeing lategame.","replies":[]},{"poster":"5G8Nri0B54","date":"2014-12-26T21:07:19.036+0000","up_votes":3,"down_votes":4,"body":"Yeah and you're still dueling in late game why? Especially if you're an **ADC**.\n\n\nVayne can be an amazing duelist too, be she also wrecks in team-fights.","replies":[{"poster":"Keyoshi","date":"2014-12-26T22:57:35.663+0000","up_votes":1,"down_votes":1,"body":"It's called catching someone out. Why wouldn't you be dueling someone late game. Quinn can get in and get out pretty quick, She's pretty much an assassin late game.","replies":[]}]}]}]},{"poster":"Kuroi86","date":"2014-12-26T20:16:39.021+0000","up_votes":10,"down_votes":17,"body":"{{champion:80}} vs {{champion:43}} ,{{champion:133}}  or {{champion:76}} = Okay, I've got a shot, gotta play smart.\n\n{{champion:80}}  vs {{champion:122}}  = FUUUUU I'm boned.  Mk jungle, focus on the other lanes, I'm gonna try not to feed too hard...","replies":[{"poster":"IsIsGankedParis","date":"2014-12-26T21:05:26.524+0000","up_votes":17,"down_votes":2,"body":"Pantheon isn't boned vs Darius, he can easily beat him.\n\nStart flask and proceed to spam spears for day, get a mana potion too.\n\nDarius pulls you? Stun him and walk away.","replies":[{"poster":"googlemaster","date":"2014-12-26T21:21:49.290+0000","up_votes":14,"down_votes":1,"body":"yeah panth probably wasnt the best thing to pick to compare. he is also an early game bully.","replies":[]},{"poster":"Kuroi86","date":"2014-12-29T07:01:33.704+0000","up_votes":1,"down_votes":1,"body":"To a degree you're right, but it's still a difficult match up.  Especially when he hits six.\nOf any champ I've faced top lane with Panth, I'd willing face any of them, except Darius because of how powerful his trades are early game.\nNow, if you can get a lead on Darius, you've probably won lane.  If he gets a lead, well I've never seen a way to come back from Darius getting a lead in lane.","replies":[]},{"poster":"Knight SoIaire ","date":"2014-12-26T22:39:48.039+0000","up_votes":1,"down_votes":1,"body":"or use your w to create a gap if minions stand in a good spot","replies":[]}]},{"poster":"youngjake93","date":"2014-12-26T23:52:46.582+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Kuroi86,realm=NA,application-id=3ErqAdtq,discussion-id=Lxg6KQBv,comment-id=0005,timestamp=2014-12-26T20:16:39.021+0000)\n>\n> {{champion:80}} vs {{champion:43}} ,{{champion:133}}  or {{champion:76}} = Okay, I've got a shot, gotta play smart.\n> \n> {{champion:80}}  vs {{champion:122}}  = FUUUUU I'm boned.  Mk jungle, focus on the other lanes, I'm gonna try not to feed too hard...\n\nLol Pantheon counters basically every top laner that isn't Rumble/Maokai/Ryze(goes even with Maokai and Ryze imo). You must be the worst Pantheon player because he was probably the only reliable hard counter to AD Nidalee before her nerf. He has ranged poke to play around Darius's skills and his passive+burst playstyle basically counters Darius's passive+extended trades playstyle.\n\n\n\nAlso, on the subject of melee tops that beat Darius, I've only played the Mundo vs Darius matchup once but it kinda seems like Darius can't do shit to Mundo. Like Mundo basically gains health as Darius attacks him with 5 stacks.","replies":[{"poster":"Kuroi86","date":"2014-12-29T07:02:52.083+0000","up_votes":1,"down_votes":1,"body":"Actually, I've managed well against those three with Panth.\n\nI don't mean to say he's unbeatable.  But his early game is massive, Panth is powerful, but Darius is friggen beastly in the right hands.","replies":[]}]}]},{"poster":"AHeroNamedHawke","date":"2014-12-26T18:43:23.262+0000","up_votes":13,"down_votes":2,"body":"Because they also scale past 20 minutes\n\n...wait lemme try that again","replies":[]},{"poster":"Risurin","date":"2014-12-26T23:18:39.418+0000","up_votes":4,"down_votes":3,"body":"> [{quoted}](name=Varin Omega,realm=NA,application-id=3ErqAdtq,discussion-id=Lxg6KQBv,comment-id=,timestamp=2014-12-26T18:36:49.500+0000)\n>\n> Why the fuck do these same people not give a shit about Karma, Nidalee, Quinn, and many more ranged top laners being WAY more oppressive to these same melee champions?\n> \n> You have no fucking chance vs these ranged top lane as if you get in range they will just smack you away or have escapes out the ass.\n\nimo, because darius is basicly a worst male version of riven. both of them have good early game, that they need to capitalize on to take over the game. but both of them are also at risk of falling completly out of the game, if they get behind in the same early game. The difference is that riven has mobility and a shield that scale with AD, so going full AD actually make sense, whereas darius has negative mobility and need to have a bunch of tank item or else he get kited and get destroyed late. (but we both know that too many darius jsut go full ad afk top forever until they lose, wonder why and blame team xD","replies":[{"poster":"A Slime Appears","date":"2014-12-26T23:47:43.526+0000","up_votes":9,"down_votes":0,"body":"Riven is a very mobile assassin with a shield that scales off offense and a lot of AoE damage, Darius is an immobile tank with a long ass CD \"gap closer\" and a lot of 1v1 damage.  So basically they are the same except they aren't.  At all, really.","replies":[{"poster":"Risurin","date":"2014-12-26T23:58:54.564+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=A Slime Appears,realm=NA,application-id=3ErqAdtq,discussion-id=Lxg6KQBv,comment-id=000a0000,timestamp=2014-12-26T23:47:43.526+0000)\n>\n> Riven is a very mobile assassin with a shield that scales off offense and a lot of AoE damage, Darius is an immobile tank with a long ass CD \"gap closer\" and a lot of 1v1 damage.  So basically they are the same except they aren't.  At all, really.\n\nMy point was that both of them will either crush or get crushed in their lane, and their usefulness for midgame teamfights depends on the outcome of this. aside of that both have AoE damage, an ability used to execute (granted darius doesnt have % damage on ult, but it has true damage instead of just physical, so its still pretty good of an execute (+reset on kills)), and both are really strong opponents in a 1v1 toplane scenario. As i said, the big difference is that Riven has more mobility and a more interesting itemization since her survivability is basicly the strength of her shield + her mobility, and not dependant entierly on tank items. aside of that, yes you have 2 different champion, but they basicly have a similar role/utility, except riven does it better and with less risk.","replies":[]}]}]},{"poster":"Matezoide","date":"2014-12-27T00:23:05.233+0000","up_votes":6,"down_votes":0,"body":"Karma, Ryze, Nidalee, Quinn, etc bully tops harder than Darius ever did.\n\nAt least you can beat Darius by farming early game and out-scalling. The others have a much easier time punishing you when you try to CS and will out-scale anyway.","replies":[]},{"poster":"DrNova","date":"2014-12-26T22:11:44.593+0000","up_votes":4,"down_votes":0,"body":"Weird, because I havent heard anyone complain about Darius (outside of the random champ post like this, usually after someone gets rocked by said random champ I assume).\n\nI dont even see Darius picked often. And when I have laned against him I always had a chance, I know how he works and do my best to avoid getting caught.  I dont see the issue.","replies":[]},{"poster":"Gunpoint","date":"2014-12-27T05:45:40.880+0000","up_votes":3,"down_votes":0,"body":"I find Riven to be more oppresive than Darius against anyone, including some ranged champions.","replies":[]},{"poster":"Mannysmoker","date":"2014-12-27T03:08:22.346+0000","up_votes":1,"down_votes":2,"body":"{{champion:266}} {{champion:31}} {{champion:86}} {{champion:78}} {{champion:58}} {{champion:59}} {{champion:48}}{{champion:39}}    gives no krapp about daius","replies":[{"poster":"MetalGearTeemu","date":"2014-12-27T03:50:39.314+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mannysmoker,realm=NA,application-id=3ErqAdtq,discussion-id=Lxg6KQBv,comment-id=0010,timestamp=2014-12-27T03:08:22.346+0000)\n>\n> {{champion:266}} {{champion:31}} {{champion:86}} {{champion:78}} {{champion:58}} {{champion:59}} {{champion:48}}{{champion:39}}    gives no krapp about daius\n\nGaren actually loses the lane with Darius at all stages.","replies":[{"poster":"DeathByWaffle","date":"2014-12-27T04:56:54.141+0000","up_votes":3,"down_votes":0,"body":"Actually, a lot of the champions he just listed lose to Darius.","replies":[{"poster":"Mannysmoker","date":"2014-12-27T13:28:39.082+0000","up_votes":1,"down_votes":1,"body":"then who of those don't lose to {{champion:122}}..cuz i have done in the past pretty much all excepting {{champion:48}} {{champion:78}} and i have had good results, because the point versus {{champion:122}} is baiting out his Decimate.. when i play {{champion:266}}  i literally   allow him to pull me so i can fight him in close...","replies":[{"poster":"DeathByWaffle","date":"2014-12-28T02:24:36.935+0000","up_votes":1,"down_votes":0,"body":"Well, the only one Darius loses to out of them is... actually no one, now that I think about it. In all the match ups, he either has the advantage or it is, at worst, a skill match up. \n\nIf you're losing to them, it ain't Darius. It's you.","replies":[]}]}]}]}]},{"poster":"Sammystorm","date":"2014-12-27T01:18:29.001+0000","up_votes":4,"down_votes":1,"body":"I called it the jayce syndrome. The trend of having ranged top started with jayce.","replies":[{"poster":"Sire Hippington","date":"2014-12-27T02:29:00.192+0000","up_votes":1,"down_votes":1,"body":"kennen actually was first^^","replies":[{"poster":"Sammystorm","date":"2014-12-27T05:56:22.381+0000","up_votes":1,"down_votes":1,"body":"I don't really remember kenned being picked in top in season 2. I remember kennen top being a thing in season 3.","replies":[{"poster":"Sire Hippington","date":"2014-12-27T20:26:13.658+0000","up_votes":1,"down_votes":1,"body":"kennen and vlad both were seen top, usually with cassio mid, rushing WotA for the double spellvamp aura","replies":[]}]}]}]},{"poster":"5G8Nri0B54","date":"2014-12-26T21:04:21.419+0000","up_votes":1,"down_votes":13,"body":"{{champion:43}} Okay she has more gold than me...so? She's oppressive and she can do some stuff. But I'll just kill her once I become 6.\n\n{{champion:76}} She's beating me now, but I'll crush her once I become 6\n\n{{champion:133}} People play her?\n\n\nAnd in the end, as annoying as those 3 bitches can be, you have a shot provided you have the burst and mobility/CC to deal with them. Disadvantaged but not completely.\n\nHowever\n.\n.\n.\n\n{{champion:122}} (back during his release): Give him even an inch and there's no taking it back unlike those 3 above. It's gg if he gets even a kill on you.","replies":[{"poster":"IsIsGankedParis","date":"2014-12-26T21:06:48.173+0000","up_votes":7,"down_votes":1,"body":"I agree release Darius was op mainly due to the grace period of his ult but his damage from back then and today is almost the exact same except he no longer has a full refreshing ult.\n\nYou don't have a shot vs those 3 unless they play stupid if you decide to play Darius, Garen, Olaf, Volibear, etc.","replies":[{"poster":"5G8Nri0B54","date":"2014-12-26T21:10:20.961+0000","up_votes":3,"down_votes":1,"body":"Okay first of all...Olaf...\n\n\n\nSecondly, I don't disagree with you that champions like Volibear, Garen, etc. have serious viability issues. You're also right that someone like Garen will never defeat a half-decent Karma/Nidalee/Quinn.\n\n\nHowever...you don't need to be any of those 3 champions to rather effortlessly beat these champions you mentioned. Or in Garen's case, beat and outscale.","replies":[{"poster":"IsIsGankedParis","date":"2014-12-26T21:47:38.640+0000","up_votes":3,"down_votes":1,"body":"How is olaf going to catch them? He misses 1 axe and he's boned.","replies":[]}]}]}]},{"poster":"Skorzen","date":"2014-12-28T06:56:57.621+0000","up_votes":1,"down_votes":0,"body":"Saw the thread name, completely agreed that Darius was an oppressive top. You point out other champs that you considered to be just as oppressive, but the key difference between them and Darius is that Darius has much more late-game/utility and zoning potential than any of the ones you listed (Yes this is a very unsupported claim because you could argue for days that Quinn has more late game because she does more damage late-game or that some other champ is better late game. However the main point I mean by late-game is that if you go any top that you listed, your team usually won't be a very good comp). What I mean by zoning potential, is that early game Darius Q does significantly more poke than any of the champs you listed. Since Darius is melee, and after 6 he can insta kill you with pull, he can completely zone you during lane where the champs you listed really can't. Darius has the typical bruiser issue, his scaling is too high in comparison to other champs and it just leads to him having a brutal laning phase.","replies":[{"poster":"IsIsGankedParis","date":"2014-12-28T07:05:52.157+0000","up_votes":2,"down_votes":0,"body":"He has poor scaling unless he builds full AD, he can't insta kill ANYBODY when he pulls them unless they were already below 40% health, he can't completely zone as he is a very easy to bait champion with or without jungler help. \n\nDarius does not have more zoning than a Quinn, Nidalee, Lissandra, etc, they can poke you down for days before getting bored and all inning you as they get it easy in lane vs melees.\n\nThere's a reason these ranged champs are played top, it's because they got nerfed out or were never viable in their actual places and Top lane is easy for them to abuse.","replies":[]}]},{"poster":"Ariel the Cruel","date":"2014-12-27T08:21:19.003+0000","up_votes":2,"down_votes":0,"body":">You have no fucking chance vs these ranged top lane as if you get in range they will just smack you away or have escapes out the ass.\n\n{{champion:127}} I don't know what you're talking about.","replies":[{"poster":"Rinky Dinky","date":"2014-12-27T20:05:13.296+0000","up_votes":1,"down_votes":1,"body":"Look at that ranged champ","replies":[]}]},{"poster":"Mecha MaIphite","date":"2014-12-26T23:52:29.484+0000","up_votes":3,"down_votes":1,"body":"Every time I play Nasus (no h8 pls) against Darius, I just farm and not die until I can 1v1 him, which happens at around 10 or 15 minutes in.\n\nWith someone like Quinn, I just get blinded (which negates my Q entirely), and then kited, and eventually shredded (because BoTrK).","replies":[]},{"poster":"Dark Nephthys","date":"2014-12-28T03:49:51.753+0000","up_votes":1,"down_votes":0,"body":"When you're playing a melee champion top lane and you're against a ranged you generally have 2 options. Depending on the actual champion you are playing and facing, if you have some form of dash/jump or mobility in general that is better then the ranged champions...you could just jump/dash to them and start fighting back early. Since you are melee, you generally have better early game stats then most ranged champions, and if you have more mobility or some form of CC, you can actually fight them. However, if you do not have any form of CC or mobility over the ranged top, you could always just play safe under tower and let them push to your tower. Just farm under tower until they either get greedy and turret dive you or your jungler comes around. Once Mid/Late game hits, you will generally out scale them and be a bigger threat then them.\n\nHowever, if you're a melee champion and you are facing Darius that's completely different. Darius is designed to easily win trades against other melees early game, and can go tank and still easily out damage you. Sure you can still let him push to your tower and farm under it but he could easily get to the point that he will dive you and still walk away alive. Most melee champions will easily get destroyed against Darius, and there's only a few that probably can go even with him early.\n\nAlso you can't just build full tank and expect to win against him once he hits level 6. However, you could always go full tank against a ranged damage and still do decent against them (well...most ranged champs anyways)","replies":[]},{"poster":"NoMonku","date":"2014-12-27T07:37:48.421+0000","up_votes":1,"down_votes":0,"body":"I feel it is more because it is a melee vs. melee match up.  When it is ranged vs. melee, they accept that they should be able to be poked down by the ranged, but in most cases if you catch that ranged champion, you can win later, even if you fall behind early.  Against Darius he can just dunk you and snowball super hard off of that, while still also going tanky, which is why I think a lot of people complain about him more.","replies":[]}]}