{"poster":"TEA Capital","date":"2017-09-09T13:29:34.077+0000","title":"Platin 5 ADC sucht Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Einen Guten Abend w&uuml;nsche ich, mein Name ist Niklas ich bin 18 Jahre Jung und spiele  &quot;League&quot; seit ende Season 2.\r\n\r\nIch habe in der letzten Zeit ADC &quot;lieben&quot; gelernt und spiele ihn auf einem recht guten Platin Niveau. Meine Momentane Elo in Solo Q ist Platin 5 und in Flex Gold 2. ich bin Kritikf&auml;hig bzw. habe kein Problem wenn -Konstruktive Kritik- gegen mich anf&auml;llt.\r\n\r\nIch bin eine Positive Person die nicht gegen andere &quot;shooted&quot;, besitze TS3 sowie ein gutes Mikrofon.\r\n\r\nMain-Champions (ADC) : {{champion:51}} {{champion:22}} {{champion:498}} {{champion:15}} {{champion:110}} {{champion:29}} {{champion:18}} {{champion:429}} {{champion:202}} \r\n\r\nIch bin stark daran Interessiert wieder in einem Team zu spielen, da ich schon in 4 Teams (je &uuml;ber 4 Monate zusammenarbeit) Erfahrung sammeln durfte.\r\n\r\nAufgrund meiner Momentanen Arbeit bin ich ab 17:30Uhr Einsatzbereit. Am WE ja nach Absprache.\r\n\r\nIngame bin ich ein Absoluter &quot;Tryhard&quot; daher mag ich es nicht besonders, wenn meine eigenen &quot;Mates&quot; das Spiel nicht ernst nehmen aufgrund, dass es zb. &quot;zu easy&quot; ist. Ich versuche mein Bestes in solchen Momenten, das Team wieder auf die Spur zu bringen, dadurch kann es auch mal zu einer &quot;Standpauke&quot; kommen allerdings ohne Beleidigung nat&uuml;rlich.\r\n\r\nNegatives zu mir: Aufgrund einer angeborenen Sprachst&ouml;rung ist leichtes Stottern bitte zu Entschuldigen. Zum jetzigen Zeitpunkt [5.9.17] bin ich etwas Erk&auml;ltet sodass meine Stimme etwas eingeschrankt ist auch das bitte ich zu Entschuldigen\r\n\r\nIch hoffe das ich Sie mit diesen Zeilen zu einer Positiven R&uuml;ckmeldung bewegt konnte, denn ich brenne darauf wieder in einem &quot;Full Tryhard Team&quot; zu spielen.\r\n\r\nMit allerbesten Gr&uuml;&szlig;en,\r\n                                            ~Niklas\r\n\r\nAnhang: Plays.tv: http://plays.tv/u/15th_March_2000\r\n               OP.GG: https://euw.op.gg/summoner/userName=S04%20Nick","replies":[]}