{"poster":"Hiding Tonight","date":"2016-03-20T03:26:08.314+0000","title":"Un campeon muy malo que se me ocurrio basandome en Undertale.","subforum":"Creaciones de la comunidad","up_votes":1,"down_votes":6,"body":"Como es de Undertale le decidi dar el super creativo nombre de Sans.\nComo Sans esta op, decidi que este Sans tambien estaria op!\n\n\nSu taunt seria que se le parpadea el ojo.\nSu joke seria una broma de esqueletos.\nSu frase de selección de campeon seria \"Do you want to have a bad time? 'Cause if you take another step forward you're NOT going to like what comes next.\"\n \nSu pasiva seria que cada 10 segundos, su ojo parpadee y cada vez que tenga la pasiva y use un ataque basico hara da&ntilde;o real.\n\nSu Q seria &quot;Wall Slamming&quot;; agarra a un campeon/esbirro enemigo, lo stunea y lo choca contra las paredes 5 veces, haciendole da&ntilde;o real.\n\nSu W seria &quot;Teleporting&quot;; Sans se teletransporta a un area elegida, haciendo da&ntilde;o magico. (Alta copia de Ezreal, pero despues de todo se presume que Sans tiene poderes de teletransportacion por los atajos que toma para ir a Grillbys y el MTT resort)\n\nSu E seria una pasiva; cada habilidad o basico dejara al enemigo con DPS por 5 segundos.\n\nSu R seria &quot;Bad Time&quot;; Sans agarra a un campeon, lo stunea y lo empieza a chocar contra las paredes 7 veces, lo tira contra el suelo mientras saca huesos de el, lo deja en el suelo mientras aparecen Gaster Blasters en las 4 esquinas y le empiezan a disparar sin cesar, haciendo da&ntilde;o real devastador y casi siempre letal para el enemigo.\n\nYa se, es muy malo, pero Sans es mi personaje favorito de Undertale.","replies":[{"poster":"Hiding Tonight","date":"2016-03-22T00:57:03.745+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"rokushoger","date":"2016-03-23T12:57:54.337+0000","up_votes":1,"down_votes":0,"body":"La razón para darle negativos es el kit horrible, que no tiene historia, que es una copia de otra cosa, y etc etc.","replies":[{"poster":"Hiding Tonight","date":"2016-03-23T13:54:08.059+0000","up_votes":1,"down_votes":0,"body":"ya he aclarado que era horrible :P","replies":[{"poster":"rokushoger","date":"2016-03-23T13:58:04.677+0000","up_votes":1,"down_votes":0,"body":"Yo lo que te aclaro es que no es porque no conozcan undertale, es porque justamente es malo como tu mismo lo dices XD","replies":[{"poster":"Hiding Tonight","date":"2016-03-23T14:42:13.584+0000","up_votes":1,"down_votes":0,"body":"pues a aprender a tomarselo con humor! xD","replies":[{"poster":"rokushoger","date":"2016-03-23T14:53:49.149+0000","up_votes":1,"down_votes":0,"body":"Era la idea hasta que aclaraste que era horrible ajajajajjajaj me pa que ninguno de los dos transmitió bien lo que quería {{sticker:zombie-brand-facepalm}}","replies":[]}]}]}]},{"poster":"Hiding Tonight","date":"2016-03-23T13:54:58.847+0000","up_votes":1,"down_votes":0,"body":"ya he aclarado que no es bueno :P\nademas, esto lo hice en 5 minutos porque estaba aburrido, no es una propuesta en serio","replies":[]}]}]},{"poster":"FallenDemonX","date":"2016-03-20T16:56:55.865+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=B2jVbSI9H4o\n\nY al final uno queda como \"Pa que m****a hice la genocide run...\"","replies":[{"poster":"Hiding Tonight","date":"2016-03-22T00:56:26.630+0000","up_votes":1,"down_votes":0,"body":"La peor run del juego\nYo me baje los archivos de Flowey's Time Machine solo para pelear contra sans \n\n{{sticker:zombie-nunu-bummed}}","replies":[]}]}]}