{"poster":"La Kill","date":"2016-11-29T15:17:20.526+0000","title":"[Suche Guide] Vom nicht mehr ganz Anfänger zum Fortgeschrittenen Supporter","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hi liebe Community\n\nIch bin nun seit einem Jahr Level 30 uns spiele auch seit dieser Zeit Rankeds.\nZur Zeit bin ich Silber 4 und mit meiner Platzierung ziemlich zufrieden, da ich nie speziell Aufwand betrieben habe um besser zu werden.\n\nNun bin ich an einem Punkt an dem ich gerne mal beginnen w&uuml;rde etwas aufzusteigen (Gold / evtl. Platin als ein l&auml;ngerfristiges Ziel). Ich finde ziemlich viele Support Guides, doch sind die so wie ich sehe eher f&uuml;r blutige Anf&auml;nger. \n\nIch suche nun ein Support Guid f&uuml;r Fortgeschrittene Mechaniken. Was es genau heisst einen besseren Support zu sein weiss ich noch nicht genau, jedoch f&auml;nde ich Guides zu folgenden Themen interessant:\n> * Wann und wie traden, ab wann ist ein trade gewonnen? Ich bin meist zufrieden, wenn ich dem ADC einen guten schaden geben konnte, da ich mehr Cookies habe, als er oder gar Zugriff auf Heilzauber habe (Bard main).\n* Wann kann ich roamen ohne meinem ADC zu schaden?\n* Was mache ich wenn mein ADC einfach schlecht ist, um trozdem einen positiven Einfluss auf das Spiel zu nehmen? (Ich will damit nicht sagen, dass es die Schuld des ADCs ist, wenn ich verliere. Doch es kann vorkommen ;) )\n* Wo / wann warden ? ich versuche meist an Stellen die in den n&auml;chsten Minuten wichtig sind zu warden. Doch oft, verlagert sich das Spiel auch stark, so dass die wards an etwas bis stark Relevanz verlieren. Zudem gehen mir die Wards meist schnell aus und ich muss zur&uuml;ck um den Sightstone aufzuladen. Sprich: ich habe strakes verbesserungspotential.\n* Was macht einen guten Supp aus? Auf was muss ich achten? Was machen viele fortgeschrittene Anf&auml;nger falsch? Wo liegen die Hauptunterschiede zwischen Silber und sagen wir mal Platin Supports? Wie &uuml;berwinde ich diese Unterschiede?\n\nNun zum Kern der Frage:\nKennt jemand ein einigermassen aktuelles Guide (muss kein Video sein, ich kann auch lesen)? Oder hat jemand lust eines zu schreiben, welches die oberen Themen gut behandelt?\n\nVielen Dank und liebe Gr&uuml;sse\n\nJissax","replies":[{"poster":"RAG Ryve","date":"2016-11-29T15:59:17.526+0000","up_votes":2,"down_votes":0,"body":"Wenn du Ts besitzt können wir uns gern mal zusammensetzen und über die Punkte so verteilt reden, ich habe früher Support gemaint und spiele  jetzt noch ab und zu, dazu spiele ich als Sekundärrolle Adc und das seid der Preseason irgendwie sehr oft. XD    Dadurch kann ich dir alle Tipps geben die ich selbst so gelernt habe.","replies":[{"poster":"La Kill","date":"2016-11-29T16:16:37.462+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank.\n\nIch melde mich wenn ich zuhause bin bei dir per PN.","replies":[]}]},{"poster":"Kata Ga Kill","date":"2016-12-02T10:07:31.881+0000","up_votes":1,"down_votes":0,"body":"Mein ultimativer Tip denn dir bisher keiner empfohlen hat weil keiner drauf kommt:\n\nSpiel selbst mal paar Wochen ausgiebig ADC.\nVerrückt? Ja.\n\nDadurch lernste deinen Horrizont kennen, was geht und was nicht für beide Rollen, den als Supporter musste auch oder wohl übel wissen was ein ADC kann und was er nicht kann um noch effektiver zu sein als Support.\n\nDu lernst damit auch wertzuschätzen was ein odentlicher Support tun muss für den ADC.\nDesweiteren steigert es deine Teamfähigkeit auf der Botlane.","replies":[]},{"poster":"OSaftKiller","date":"2016-12-01T22:07:21.601+0000","up_votes":1,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/de/c/level-up-guides-tipps-de/B2M9LErf-support-guide-far-einsteiger-und-leute-die-aufsteigen-wollen-bis-gold","replies":[]},{"poster":"Teilzeitmain","date":"2016-12-01T22:06:24.100+0000","up_votes":1,"down_votes":0,"body":"Hallihallo!\n\nzunächst einmal.. ich bin Mainsupporter seit 3 Saisons und im Allgemeinen eher ein Taktiker/Analyst als effektiv guter Spieler. Trotzdem halte ich mich im Diamondbereich.\nSeit etwa nem halben Jahr habe ich angefangen auch auf Youtube einen Kanal hauptsächlich rund um das Supporten aufzubauen.\n\nhttps://www.youtube.com/user/Flotidus100\n\nDeine Fragen direkt zu beantworten ist schwer und ich streu das immer in meinen Gameplays mit ein. Teilweise mache ich auch direkte Guides zu Thematiken. \nZum Thema Traden habe ich hier ein kleinen SupportTalk gemacht: https://www.youtube.com/watch?v=6_ILi5wtPFY\nEventuell ist da irgendwo was dabei was dir hilft.. ansonsten frag einfach =) \n\nAnsonsten kannst du mich gerne auch adden und wild drauf los fragen. Wenn ich online bin, helfe ich gerne!\n\nVielen dank für die Aufmerksamkeit =) Tschüss gemüs!\n\nFlotidus","replies":[]},{"poster":"Die Bohrmaschine","date":"2016-11-29T16:18:23.133+0000","up_votes":1,"down_votes":0,"body":"Hallo Jissax,\nfür viele deiner gennanten Punkte gibt es keine einfach zu nennende Lösung. Vielmehr musst du ein Gefühl dafür entwickeln wann du z.B. roamen kannst ohne dass Gefahr für deinen ADC besteht. Einer der wichtigsten Punkte beim aufsteigen ist es, sich nicht aufs gewinnen (nur zum Teil) sonder hauptsächlich auf das Besser werden zu konzentrieren. Such dir jede/n Tag/Woche einen Fehler von dir Raus und arbeite explizit nur an dem Fehler. Nach einiger Zeit musst du dich nicht mehr auf diesen Fehler konzentrieren da du es automatisch machst.\nWenn du möchtest kann auch ich dir anbieten dir mal nen paar Games zuzuschauen und Fragen zu beantworten bzw. direkt Tipps zu geben.\nWenn du interesse hast adde mich einfach. Bin Platin 3 Main Support.\nMfG xQ WalkingWard.","replies":[{"poster":"La Kill","date":"2016-11-29T16:52:31.048+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank\nAdde dich gleich.","replies":[]}]}]}