{"poster":"you lovemee","date":"2015-05-08T05:32:34.869+0000","title":"Dota almost at $7 million","subforum":"Esports","up_votes":4,"down_votes":4,"body":"That is scary, their price pool is going up at a higher rate compared to last year (ended up with $11 million), imagine they actually get $15 million.\r\n\r\nhttp://dota2.prizetrac.kr/international2015","replies":[{"poster":"Xonra","date":"2015-05-08T07:11:44.953+0000","up_votes":3,"down_votes":2,"body":"Hate to be \"that guy\" but no one here actually cares, outside of us telling you that \"This isn't the Dota 2\" forums, and \"we don't care\".\n\nIt has been stated over and over again, if Riot did some cheap ploy to make money, the LoL prize pool would easily blast that out of the water. Riot just doesn't need some cheap ploy to make money, hiding behind the guise of a prize pool. \n\nRiot doesn't need to do that - Valve does. 7 mil sounds like a lot, but considering the amount of money LoL players (I didn't say pros, cause some non-pros make bank just streaming, which is still more than pro Dota 2 players make yearly) make from streaming and salary alone, compared to the lack there of that even the best streamer for Dota 2 makes....well...that not sound as impressive.","replies":[{"poster":"SLangedEdge","date":"2015-05-09T01:29:28.622+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Xonra,realm=NA,application-id=9hBQwnEU,discussion-id=jvG9lnAT,comment-id=0001,timestamp=2015-05-08T07:11:44.953+0000)\n>\n> Hate to be \"that guy\" but no one here actually cares, outside of us telling you that \"This isn't the Dota 2\" forums, and \"we don't care\".\n> \n> It has been stated over and over again, if Riot did some cheap ploy to make money, the LoL prize pool would easily blast that out of the water. Riot just doesn't need some cheap ploy to make money, hiding behind the guise of a prize pool. \n> \n> Riot doesn't need to do that - Valve does. 7 mil sounds like a lot, but considering the amount of money LoL players (I didn't say pros, cause some non-pros make bank just streaming, which is still more than pro Dota 2 players make yearly) make from streaming and salary alone, compared to the lack there of that even the best streamer for Dota 2 makes....well...that not sound as impressive.\n\n\"Cheap ploy\", you mean the garbage chroma skins we have, icons, etc?  LoL could easily do what valve is doing to drum up more prize pool money.  I believe the reason they don't is 2 fold, having community driven prize pool is double edged (imagine if they don't come close to hitting last years goal, would be telling that the game was losing steam).  The 2nd reason is that LoL doesn't have enough compelling features on deck to tie into stretch goals.\n\nValve doesn't \"need\" to do it either, i'm sure most of this is just happenstance, they make their money on steam impressions, which a triple A game such as dota would resutl in.\n\nLoL is very good in creating a way to sustain pro competition by paying everyone, but there's something really cool about being a multi millionaire playing a game as opposed to a 6figure kinda guy.  The lowest grossing dota player i'm sure is paid much less than the lowest grossing LoL player, but most winningest dota player/team is prolly paid more than the entire LoL community. (just a guess tho)","replies":[]},{"poster":"you lovemee","date":"2015-05-08T16:56:01.036+0000","up_votes":2,"down_votes":0,"body":"I don't mind Riot release a $11 skin bundle with 3-4 skins and 1 ward skin and a couple icons and 25% of its money goes to the world championship. I'm sure most people would be happy about that deal. I didn't know LoL pros make over 2-3 million dollars yearly from streaming, where did you get that from?","replies":[]}]},{"poster":"Kholdstare13","date":"2015-05-08T19:58:11.161+0000","up_votes":1,"down_votes":0,"body":"Dominion tournaments have a ~$250 in RP prize pool, not even real money, and they're STILL more fun to watch than anything in the LCS.  Prize pool means nothing.  The game just has to be exciting to watch.","replies":[]},{"poster":"TheGosuStandard","date":"2015-05-08T07:13:37.971+0000","up_votes":1,"down_votes":0,"body":"Doesn't their prize pool come from part of the in game purchases of skins?","replies":[{"poster":"Vixanys","date":"2015-05-08T17:54:40.432+0000","up_votes":1,"down_votes":0,"body":"They buy tickets to watch the event as a spectator in the Dota2 client. 50% of the proceeds for the ticket go towards prize pool support. I just can't understand what this comment is doing on a League of Legends forum. T.T","replies":[]}]},{"poster":"Rhlax","date":"2015-05-08T13:01:17.475+0000","up_votes":2,"down_votes":2,"body":"Pac-Mayweather fight had a 300million prize pool. \nIt doesn't make boxing all of a sudden better.","replies":[]},{"poster":"Wulf Helhammer","date":"2015-05-08T07:03:30.018+0000","up_votes":2,"down_votes":2,"body":"And your point is.....?","replies":[]}]}