{"poster":"Metalmonni","date":"2018-09-27T06:38:13.241+0000","title":"[TGSG] Mitten im Leben","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":9,"body":"Hallo zusammen...\n\nDa heute bisher noch nichts kam, lasse ich euch nochmal an meinem Leben teilhaben, wie sich das als Person, welche in der &Ouml;ffentlichkeit steht nun mal so geh&ouml;rt ^^.\n\nWie manche von euch wissen, hatte ich gestern einen recht wichtigen Testtag, namentlich eine &quot;psychologische Eignungsuntersuchung&quot;, die bei meinem Arbeitgeber seit ca. einem Jahr bei bestimmten Arbeitsinhalten Pflicht ist und nun f&uuml;r alle relevanten Kollegen nachgeholt wird. Entsprechend schon geeignet, einem die berufliche Zukunft zu behindern, wenn man da durchf&auml;llt ^^. \n\nDementsprechend ernst nimmt der Arbeitgeber diese Eignungsuntersuchung und bereitet umfassend mit Informationsbrosch&uuml;ren und Tipps darauf vor, einer dieser Hinweise war: &quot;Erscheinen Sie unbedingt fit und ausgeschlafen!&quot;\n\nGesagt getan, f&uuml;r den morgen davor Homeoffice angemeldet um sich den Arbeitsweg zu sparen, Extra fr&uuml;hes losfahren eingeplant und dann um 22:30 am Dienstag ins Bett gegangen... Nur um dann um 00:30 wieder geweckt zu werden. Von Metallica.\n\nWer mich etwas l&auml;nger kennt wird wissen, dass ich Metallica sehr sch&auml;tze. Auch wenn das nach einigen Songs in Rammstein &uuml;bergeht bin ich prinzipiell nicht abgeneigt, ich mag diese Bands. Ich bin auch prinzipiell Freund einer Lautst&auml;rke, die mir ein sinnvolles Mitsingen erm&ouml;glicht. \n\n**Aber ich mag das nicht, wenn es nachts um 00:30 Uhr durch meine Schlafzimmerdecke kommt.**\n\nAlso was tun. Zwei Songs abgewartet, Switch von Metallica auf &quot;Engel&quot; von Rammstein. Nicht unbedingt ein Schlaflied. Also ab nach oben. Eigentlich bin ich ja leidgepr&uuml;ft, da wohnte vorher ein alter verwirrter Mann, der &ouml;fter mal nachts rumgebr&uuml;llt hat.. Den hab ich aber aus R&uuml;cksicht auf seinen Gesundheitszustand gelassen, vor allem hat er immer nach einigen Minuten damit aufgeh&ouml;rt. Also wohnen da jetzt neue Mieter. Aber was f&uuml;r welche, damit konnte keiner rechnen. \n\nDenn dort oben wohnt jetzt ein Assi. Ein Knasti-Assi, von dem ich jetzt einfach mal hoffe, dass er nicht lol spielt oder Forum liest und sich hier wiedererkennt, wenn ja tut es mir Leid und ich biete hiermit eine Aussprache an xD. Mit macht also ein Typ in Unterhose und Unterhemd die Tür auf, mit einem Gesichtsausdruck der aussagt, dass meine Zähne wirklich ziemlich gern in Richtung Boden wollen. Wurscht, hab immerhin geklingelt. Von mir also ein nachbarschaftliches \"Hey, könnt ihr bitte ein bisschen leiser machen?\". Als Antwort kam immerhin kein Angriff aber auch nichts Konstruktives. \n\n\"Jaja, mach ich.\" Tür zugehauen, Musik wird wenige Sekunden später *lauter* gedreht. Nun gut. Ich stehe ein wenig ratlos im Flur, schon kommen weitere Nachbarn dazu, die sich ebenfalls beschweren wollen... Trotz mehrfachem Klingeln, Klopfen und durch die Tür rufen wird diese jedoch nicht mehr geöffnet. \n\nWie ich nun mal bin und da sich sonst keiner traut ergreife ich also die Initiative und wähle auf meinem Telefon die 110, um festzustellen wie die deutsche Polizei bei marginalen Problemen reagiert ^^.\n\n- Die (freundliche) Dame, welche ich beim Notruf spreche, verweist mich im Falle von Ruhestörung an die örtliche Polizeizentrale und gibt mir netterweise gleich die Nummer.\n- Der (sehr freundliche) Herr bei der Zentrale verweist mich im Falle von Ruhestörung an das für mich zuständige Revier und gibt mir netterweise gleich die Nummer. \n- Der Mann beim Revier ist wenig begeistert und sehr unfreundlich. Kein Wunder, dass die mich haben anrufen lassen xD. \n\nJedenfalls sagten die, wir können in unsere Wohnungen gehen, sie schicken jemanden. ist dann auch passiert, es wurde für Ruhe gesorgt. Bei mir wurde nochmal geklingelt, ich hab die Story ein wenig ausgebreitet und Zeugen genannt... Dann wurde ich darauf aufmerksam gemacht, das nächste mal solle ich doch bitte *mehr* selbst versuchen bevor ich die Polizei rufe. Ja danke. \n\nNaja... Aus Angst vor Rache hab ich dann noch die Kette vorgelegt, aber alles blieb ruhig. Vielleicht hab ich den Kollegen oben ja auch falsch eingeschätzt, aber der erste Eindruck war schon ziemlich speziell. \n\nAlso um gut 03:00 Uhr früh ab ins Bett. Den Anfang der Arbeit, der eigentlich um 07:00 ist hab ich dann mal gepflegt verschlafen, aber nach den zurückliegenden, sehr stressigen, Wochen passiert momentan ohnehin nicht viel. Dennoch bin ich mit viel zu wenig Schlaf zu dieser Eignungsuntersuchung gefahren... \n\nIch hatte eigentlich mal gehofft, nach dem alten Mann, der minutenlang Beleidigungen und Todesdrohungen brüllt, holen sie da oben mal einen sinnvollen Mieter rein xD. \n\nUnd bei euch so? ^^","replies":[{"poster":"4 For Maggie","date":"2018-09-27T13:13:02.970+0000","up_votes":1,"down_votes":0,"body":"Laaaaaaaaaaaaaaaangweilig","replies":[{"poster":"Veezey","date":"2018-09-27T13:57:13.297+0000","up_votes":1,"down_votes":0,"body":"Ich hab gleich Pizza :>","replies":[{"poster":"Qbert","date":"2018-09-27T14:05:45.723+0000","up_votes":1,"down_votes":0,"body":"da bin ich ja schon neidisch :(\n\nIch arbeite noch etwa eine Stunden, dann nach Hause ... aber wir kochen heute etwas leckeres!\nGebratenen Reis mit Gemüse - jammi!","replies":[{"poster":"Veezey","date":"2018-09-27T14:12:21.857+0000","up_votes":1,"down_votes":0,"body":"ugh Gemüse xD\nAber Reis klingt gut! :D","replies":[{"poster":"Qbert","date":"2018-09-27T14:15:50.026+0000","up_votes":1,"down_votes":0,"body":"doch doch, so eine chinesische Pfanne eben! Voll lecker!\nWir machen da folgendes Rein:\n-Fenchel\n-Zuckerschoten\n-rote Paprika\n-Mungobohnensprossen\n-Lauchzwiebeln","replies":[{"poster":"Veezey","date":"2018-09-27T14:36:45.458+0000","up_votes":1,"down_votes":0,"body":"Keine Ahnung wie das schmeckt, aber die Pizza war gut lecker :D","replies":[{"poster":"Qbert","date":"2018-09-27T14:38:48.611+0000","up_votes":1,"down_votes":0,"body":"lecker!\nWie beim Chinesen um die Ecke, wenn du dir da gebratenen Reis bestellst :)\n\nWas für eine Pizza war es denn?\nLiefern lassen oder TK oder selbst gemacht?","replies":[{"poster":"Veezey","date":"2018-09-27T21:06:16.557+0000","up_votes":1,"down_votes":0,"body":"Das war ne Tiefkühlpizza, allerdings hab ich die mit einem Gutschein bekommen :D","replies":[]},{"poster":"Metalmonni","date":"2018-09-27T16:58:11.217+0000","up_votes":1,"down_votes":0,"body":"Ich bestelle morgen Abend zur Feier des Urlaubsbeginns ^^","replies":[]}]}]}]}]}]}]},{"poster":"Metalmonni","date":"2018-09-27T13:27:03.938+0000","up_votes":1,"down_votes":0,"body":"Mach's wie ich und geh einfach heim wenn's langweilig wird.","replies":[{"poster":"4 For Maggie","date":"2018-09-27T13:29:24.870+0000","up_votes":1,"down_votes":0,"body":"x.x Wie schön das wäre wenn es funktionieren würde","replies":[{"poster":"Metalmonni","date":"2018-09-27T13:30:08.605+0000","up_votes":1,"down_votes":0,"body":"Ich bin dann mal auf dem Heimweg ^^. Man liest sich morgen :P","replies":[{"poster":"4 For Maggie","date":"2018-09-27T13:39:04.409+0000","up_votes":1,"down_votes":0,"body":"MOBBING D:\n\n\\>.< fast eine halbe Stunde \"arbeiten\" und eine Stunde bis ein für mich relevanter Bus kommt!","replies":[{"poster":"Qbert","date":"2018-09-27T13:40:28.692+0000","up_votes":1,"down_votes":0,"body":"ohje ohje\n\n*auf die Schulter hüpf und ankuschel*\n\nMagst du? hab noch einen übrig *Keks hinhalt*","replies":[{"poster":"4 For Maggie","date":"2018-09-27T13:42:28.911+0000","up_votes":1,"down_votes":0,"body":"Danke, aber ich hab keinen Hunger x.x","replies":[{"poster":"Qbert","date":"2018-09-27T13:43:35.726+0000","up_votes":1,"down_votes":0,"body":"okay! *mümmel*\n\ndann nur kuscheln :)","replies":[{"poster":"4 For Maggie","date":"2018-09-27T13:47:34.969+0000","up_votes":1,"down_votes":0,"body":"*Knuffel das Köpfchen streichel*\n\n\\*.* kuscheln ist fein!","replies":[{"poster":"Qbert","date":"2018-09-27T13:53:52.503+0000","up_votes":1,"down_votes":0,"body":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTyEuqxlB7sp0mJIedZd8pAqO7DasM-B0OvgjMHMMxitxN7_C1j","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Nordwolf87","date":"2018-09-27T13:17:20.050+0000","up_votes":1,"down_votes":0,"body":"Dann dreh dich mim Bürosessel und schau wieviele Runden du schaffst und versuch es immer zu übertreffen :D","replies":[{"poster":"4 For Maggie","date":"2018-09-27T13:21:36.052+0000","up_votes":1,"down_votes":0,"body":"Näääääää da wird mir ja schlecht :o","replies":[{"poster":"Nordwolf87","date":"2018-09-27T13:26:40.892+0000","up_votes":1,"down_votes":0,"body":"Drehrichtung abwechseln ist das geheimnis :P","replies":[{"poster":"4 For Maggie","date":"2018-09-27T13:28:27.675+0000","up_votes":1,"down_votes":0,"body":"Glaub der Stuhl fliegt eh nach maximal zehn Umdrehungen auseinander xD","replies":[]}]}]}]}]},{"poster":"INoKami","date":"2018-09-27T15:56:15.759+0000","up_votes":1,"down_votes":0,"body":"**[Der TGSG-Blog] Geschichten eines Azubis, Tag 13**\n\nSo langsam befürchte ich, dass die deutsche Bahn an einer Identitätskrise leidet. Zum mittlerweile zweiten Mal wurden auf der Anzeigetafel nur zwei S-Bahn-Waggons angezeigt, aber es sind immer drei in den Bahnhof gerollt. Irgendwie amüsant.\n\nRest des Tages war relativ unspektakulär bis auf 20 Minuten Wartezeit beim Chinesen auf mein Mittagessen, die man locker besser hätte managen können (die nehmen nur neue Bestellungen an, wenn die erste ausgeteilt wurde. Mit anderen Worten: Eine Bestellung alle 10 Minuten) und meinem ersten Arbeitstag im Labor, auch wenn wir nur simple Einführungen wie \"Kochsalz in Wasser lösen\" und \"Bunsenbrenner 1o1\" gemacht haben. Quasi das Tutorial.\n\nNutzen wir aber mal die Gelegenheit für eine kleine Zwischenfrage, rein aus Neugierde: Wann liest ihr euch eigentlich meine Täglichen Geschichten durch? Noch am selben Tag? Erst am nächsten Tag, wenn ihr wieder am Arbeitsplatz das Forum aufmacht? Gar nicht (-> alle, die nicht in die ersten zwei Kategorien fallen)? Erzählt doch mal :)","replies":[{"poster":"INoKami","date":"2018-09-27T20:01:55.506+0000","up_votes":1,"down_votes":0,"body":"Awwwwwwww f+ckf+ckf+ck, jetzt erst gemerkt, dass das schon Tag 14 sein müsste...\nNicht mal 3 Wochen Ausbildung und schon solche Aussetzer im Gehirn. Hätte nicht gedacht, dass mein geistiger Verfall schon so schnell einsetzt... -_-\n(Gestern Tag 12 statt 13 geschrieben und demnach Folgefehler heute...)","replies":[]},{"poster":"Eibert Rümmel","date":"2018-09-27T17:57:44.478+0000","up_votes":1,"down_votes":0,"body":"ich kommentiere halt nur wenn ich was beitaen kann. finde deinen blog aber sehr lesenswert. wie wäre es mit einem Sammelthread. In dem du alle Blogeinträge als eine art Tagebuch nochmal reinkopierst.\n\ndann lesen das vlt ein paar leute die das spannend finden, aber Tgsg Threads nicht anrühren","replies":[{"poster":"INoKami","date":"2018-09-27T18:07:38.796+0000","up_votes":1,"down_votes":0,"body":"Schwer. Weil der auf kurz oder lang in der Masse anderer Threads untergehen wird und ich jeden täglich anstupsen müsste, dass ein neuer Eintrag da ist, weil ich nicht glaube, dass man sich länger als drei Tage dazu zwingen kann, jedes Mal einen veralteten Thread aus der Historie rauszukramen, wenn man nicht ständig eine neue Nachricht erhält (die es nicht gibt, wenn ich keinen Reply schreibe).\nUnd ich bin dann doch zu unwichtig, als dass mein Sammelthread angepinnt werden würde :*\n\n_\nOder?_","replies":[{"poster":"Eibert Rümmel","date":"2018-09-27T18:11:48.382+0000","up_votes":1,"down_votes":0,"body":"jeden neuen beitrag als reply reinposten?","replies":[{"poster":"INoKami","date":"2018-09-27T18:27:30.451+0000","up_votes":1,"down_votes":0,"body":"Aber das sieht niemand, solange der Reply nicht direkt an den User geschrieben wird, das ist eben das Problem. Oder man müsste irgendwie einen gigantischen Post aufbauen, in den man sich quasi \"reinabbonieren\" kann und dafür bin ich einfach zu faul...^^\nAlso mache ich es einfach auf der einzigen Plattform hier, die ein halbwegs tägliches Format mit sich bringt.","replies":[{"poster":"Metalmonni","date":"2018-09-27T18:32:48.676+0000","up_votes":1,"down_votes":0,"body":"Ich schätze deine Posts, würdest du sie als Podcast einsprechen würde ich sie mir auf dem Heimweg anhören ^^","replies":[{"poster":"INoKami","date":"2018-09-27T18:41:31.030+0000","up_votes":1,"down_votes":0,"body":"Ist eine witzige Idee, bräuchte nur ein Mikro und eine Plattform, auf der ich es hochladen kann...\n\nAnsonsten würde ich es fast mal probieren.\n{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"Metalmonni","date":"2018-09-27T19:26:22.123+0000","up_votes":1,"down_votes":0,"body":"Im Zweifel YouTube mit irgendeinem statischen Hintergrundbild","replies":[]}]}]}]}]}]}]},{"poster":"Metalmonni","date":"2018-09-27T16:56:53.212+0000","up_votes":1,"down_votes":0,"body":"Das kommt ganz darauf an, wann das kommt. Selten kommt mal was vor 16 uhr, dann lese ich das noch auf der Arbeit... meistens kommt es aber später, dann lese ich es meistens irgendwann Abends. \n\nEntweder daheim, wenn ich beim (alleine) Essen nochmal im Forum rum fahre oder wie jetzt auf dem Handy, wenn ich mit meiner Freundin Serie gucke...\n\nGanz selten, wenn ich Abends nicht dazu komme, lese ich es am nächsten Morgen auf der Arbeit, wenn es noch keinen neuen Thread gibt ^^.","replies":[{"poster":"INoKami","date":"2018-09-27T17:09:00.728+0000","up_votes":1,"down_votes":0,"body":"Na immerhin. Ich kann halt auch schlecht was posten, wenn ich bis 4 Mittagsschule habe und ich mich nicht auf meinem Handy anmelden kann (for whatever reason) und dann noch eine Std Heimweg habe.\nIch finde es nur interessant, zu beobachten, wie viel Rückmeldung immer zu meinen Geschichten reinkommt. Also kaum. Ok, ich fordere jetzt nicht, dass jeder Eintrag in epischer Länge ausdiskutiert wird, aber hin und wieder ein Kommentar fühlt sich doch schön an :)","replies":[{"poster":"Metalmonni","date":"2018-09-27T17:14:39.092+0000","up_votes":1,"down_votes":0,"body":"Das liegt halt daran, dass der Thread ab 16 Uhr stirbt, weil alle Feierabend haben... Daheim guckt nur selten nochmal jemand rein... Das hier ist ja immer Zeitvertreib bei der Arbeit :).\n\nAber sei beruhigt, zumindest ich verfolge deinen Blog mit Interesse ;)","replies":[]}]}]}]},{"poster":"Nordwolf87","date":"2018-09-27T12:32:50.498+0000","up_votes":1,"down_votes":0,"body":"Könntest du am ende ein tl;dr machen? :D\n\nHallo zusammen übrigens :)","replies":[{"poster":"4 For Maggie","date":"2018-09-27T12:40:32.076+0000","up_votes":1,"down_votes":0,"body":":> Hallo du Einer.\n\nGurke?","replies":[{"poster":"Nordwolf87","date":"2018-09-27T13:15:03.112+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-poppy}} Damkö! Karotte? Banane? :>","replies":[{"poster":"4 For Maggie","date":"2018-09-27T13:27:46.238+0000","up_votes":1,"down_votes":0,"body":":> Statt du mir Erdbeeren oder so anbietest... du Schlingel","replies":[{"poster":"Nordwolf87","date":"2018-09-27T13:51:25.644+0000","up_votes":1,"down_votes":0,"body":"Disclaimer: Diese Früchte wurden rein zufällig ausgewählt! Ich schwörs! \n\nAber du hast mit der Gurke angefangen :>","replies":[{"poster":"4 For Maggie","date":"2018-09-27T13:52:58.397+0000","up_votes":1,"down_votes":0,"body":":* Klar doch","replies":[{"poster":"Nordwolf87","date":"2018-09-27T14:03:55.829+0000","up_votes":1,"down_votes":0,"body":"{{sticker:galio-happy}}","replies":[]}]}]}]}]}]},{"poster":"Metalmonni","date":"2018-09-27T12:42:12.379+0000","up_votes":1,"down_votes":0,"body":"Das Ganze ist ja nur eine Geschichte aus meinem Leben, gedacht als pure Unterhaltung für Leute die gern so was lesen und / oder meinen Schreibstil mögen ^^.\n\nEs gibt keine tiefere Message darin oder eine Conclusio am Ende, die man zusammenfassen müsste ^^. Wenn ich einen [TGSG] Thread erstelle, habe ich eigentlich immer etwas aus meinem Leben zu erzählen, was ich auf meine ganz eigene Weise in Worte fasse. Wenn das jemanden interessiert liest er das und ich freu mich ^^. Wenn nicht dann nicht :P.","replies":[{"poster":"Nordwolf87","date":"2018-09-27T13:15:58.483+0000","up_votes":1,"down_votes":0,"body":"Dann les ichs mir zu Hause in ruhe durch, am handy werd ich sonst blind xD","replies":[{"poster":"Metalmonni","date":"2018-09-27T13:26:16.978+0000","up_votes":1,"down_votes":0,"body":"Ich freu mich immer über jeden, der meinen Quatsch liest ^^","replies":[]}]}]}]},{"poster":"Qbert","date":"2018-09-27T13:16:10.929+0000","up_votes":1,"down_votes":0,"body":"Hat da jemand *Kekse*  gesagt?!","replies":[{"poster":"Nordwolf87","date":"2018-09-27T13:19:12.172+0000","up_votes":1,"down_votes":0,"body":"{{item:2054}} {{item:2010}} {{item:2054}} {{item:2010}} {{item:2054}} {{item:2010}} {{item:2054}} {{item:2010}} {{item:2054}} {{item:2010}} {{item:2054}} {{item:2010}} {{item:2054}} {{item:2010}} {{item:2054}} {{item:2010}} {{item:2054}} {{item:2010}} {{item:2054}} {{item:2010}} {{item:2054}} {{item:2010}} {{item:2054}} {{item:2010}}","replies":[{"poster":"Qbert","date":"2018-09-27T13:25:01.849+0000","up_votes":1,"down_votes":0,"body":"http://pic.pc6.com/up/2015-12/20151221171252.jpg","replies":[]}]}]},{"poster":"4 For Maggie","date":"2018-09-27T08:32:52.222+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Metalmonni,realm=EUW,application-id=YnZkMR0R,discussion-id=V6ERUHZ9,comment-id=0002000100000001000000000000000000000000000000000000,timestamp=2018-09-27T07:58:17.030+0000)\n>\n> Fahr mit deinem Tommy Guns mal zu den Leuten die meine literarisch wertvolle Wall of Text da oben konsequent downvoten ^^ Ich weiß, das passiert immer, aber ich hab mir viel Mühe damit gegeben und so ein bisschen kratzt es mich ja schon :P\n\nHilft zwar vermutlich nicht, aber...\nIch musste so lachen bei der Geschichte xD hab mir bei dem Knasti direkt jemanden in dreckigem weißen Unterhemd vorgestellt mit Schnäuzer und 'ner Bierdose in der Hand der dir rülpsend die Türe öffnet xD danke dafür Hollywood!\n\nAlso ich hätte ja jetzt Angst in die Wohnung zurück zu kehren c.c der Kerl wird nicht arbeiten und vielleicht lauert er dir auf. Wer weiß wegen was er gesessen hat D:\n\nMir sagt heute jeder wie krank ich mich anhöre c.c Mir geht's auch beschissen aber morgen und Montag wollt ich schon noch durchziehen. Ich hätte nicht mit geschlossenem Fenster schlafen dürfen >.< das war mein Todesurteil.","replies":[{"poster":"Metalmonni","date":"2018-09-27T08:40:56.976+0000","up_votes":1,"down_votes":0,"body":"Zieh die Bierdose und den Schnäuzer ab und du hast den Typen vor Augen xD. \n\nTatsächlich rechne ich jeden Tag damit, eine tote Maus oder so was im Briefkasten zu haben ^^. Aber trotzdem ist es schön zu wissen, dass mein Geschreibsel dich amüsiert hat ^^.","replies":[{"poster":"4 For Maggie","date":"2018-09-27T09:17:16.205+0000","up_votes":1,"down_votes":0,"body":"Vor allem das er die Musik lauter gemacht hat, nach dem er sie doch leiser machen sollte :D Richtig frech das Kerlchen! Meine Schwester hat das früher auch so gemacht wenn sie sauer xD ... ... ...","replies":[]}]}]}]}