{"poster":"Belezebell","date":"2015-12-10T22:22:33.726+0000","title":"Was haltet ihr von Bard?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Jo, w&uuml;rde gern eure Meinungen &uuml;ber Bard erfahren, also wie ihr zu ihm steht, ob ihr ihn gern als Supp habt oder lieber gar nicht, was f&uuml;r Vorteile er hat bzw ob und wie er &uuml;berhaupt zu gebrauchen ist","replies":[{"poster":"Megamaexx","date":"2015-12-10T22:40:33.093+0000","up_votes":2,"down_votes":0,"body":"Ich mag Bard so sehr, dass ich einen am Kinn habe!\nAlso Bard ist nicht nur als Gesichtsbehaarung gut, sondern auch so ein wunderbarer Supporter. Auch wenn er nur seinen Q hat, um für CC zu sorgen, ist er ein guter Support. Man kann super seine Verbündeten mit dem Weg nach Narnia sichern und sobald ein oder mehrere Gegner folgen, bis zu 2 von denen sicher betäuben. Seine Heilung+Lauftempobuff sind auch strategisch sehr wertvoll. Er ist eben recht schwierig, da wirklich alles zum einen von Skill, zum anderen von Wissen abhängt. Er ist ein enorm komplexer Champion, der falsch gespielt total nutzlos ist. Einmal eine falsche Ult oder deine Q betäubt nicht, deine Heilteile sind nicht in Reichweite oder der Weg nach Narnia führt die Gegner zu deinen Freunden, die dann daran sterben. Aber mit etwas Übung läuft das sicher, ich werd ihn mir auch holen, sobald ich wieder Punkte hab :D","replies":[]},{"poster":"Belezebell","date":"2015-12-11T09:39:20.178+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank für eure Antworten, hat mir alles sehr gut weiter geholfen :)","replies":[]},{"poster":"Spicavius","date":"2015-12-11T00:24:47.360+0000","up_votes":1,"down_votes":0,"body":"Guter Champion. Sehr Teamabhängig/Kommunikationsabhängig, denn sein Roaming-Spielstil ist nunmal sehr spezifisch, weswegen man mit seinem Adc alles absprechen muss, bevor man roamen geht.\nDenn sonst ist dein Adc alleine und stirbt...\nUlti ist auch sehr Kommunikationsabhängig/Teamabhängig, denn wenn einer aus deinem Team die Ulti abkriegt und eigentlich gerade engagen wollte, ist es auch für die Katz.\nKleines Beispiel : Fiddlesticks springt mit seiner Ulti in die Gegner, während Bard seine Ulti auf die Gegner castet...\nIst alles schon passiert. :D","replies":[]},{"poster":"Doo ","date":"2015-12-11T00:02:31.370+0000","up_votes":1,"down_votes":0,"body":"Heute erworben, finde ich echt klasse. Nur dauert es sehr, sehr lange bist du wirklich behaupten kannst das du ihn gut spielst.","replies":[]},{"poster":"Im a Papaya","date":"2015-12-10T22:39:28.548+0000","up_votes":1,"down_votes":0,"body":"Ich spiele Support und adc gerne und überlege mir Bard zu holen und zu spielen, allerdings ist er mir persönlich als adc zu unstabil. Ein wenig poke, ein wenig Sustain und sehr schwer zu treffender cc ist in der laning Phase halt für die meisten adcs die im early auf kills gehen eher eine Last als eine hilfe, hinzukommt das er ständig die Lane verlassen muss um stärker zu werden und dich in eine 2 v 1 Situation zwingt wo dann schon ein 1 Sekunden stun den Schneeball der Bot lane ins rollen bringen kann. Jeder wird sich jetzt fragen warum ich ihn mir holen will ^^\nBards Fähigkeiten sind sehr einzigartig und erlauben dir unglaubliche plays zu machen die kein anderer Support sonst hinbekommen könnte. Ich hab mal einen Bard gesehen der im 5 v 5 unseren inhib Tower plus 2 Leute geultet hat und damit quasi den gesamten Teamfight quasi im Alleingang gewonnen hat. \nHinzukommt noch eine sehr simple Begründung: Bard ist als Champ einzigartig, vom Aussehen, Kit und Geschichte her, er bietet eine Abwechslung zu all den Kriegern die mir erzählen wie einfach diese Hinrichtung doch war {{champion:122}} oder Was für eine Blutgruppe sie gerne haben {{champion:8}} Bard ist einfach nur ein Aufpasser und genau das ist die Identität die ich als Supporter haben will.","replies":[{"poster":"SorisDynasty","date":"2015-12-10T22:46:27.313+0000","up_votes":1,"down_votes":0,"body":"Kluge Bards werden ihre Zeiten zum Sammeln der Glocken so timen, dass der ADC nicht in Gefahr kommt. :] Mit etwas Übung hat mans raus.","replies":[]}]}]}