{"poster":"Luxaryon","date":"2016-05-04T13:59:57.710+0000","title":"Vi, la nueva Bully de la Grieta","subforum":"Charlas Generales","up_votes":2,"down_votes":5,"body":"Acabo de jugar Vi JG con el &quot;nuevo devorador&quot;, rey arruinado, malmortius, berserker graves, black cleaver y sterak. Fue un completo abuso, 16% de la vida m&aacute;xima cada 3 b&aacute;sicos. Creo que el nerf se acerca. :v\r\n\r\n{{item:3931}} + {{item:3153}} + {{item:3006}} + {{item:3156}} + {{item:3071}} + {{item:3053}} = GG Easy.","replies":[{"poster":"HornBore","date":"2016-05-04T15:12:04.020+0000","up_votes":4,"down_votes":0,"body":"La verdad no, me sigue pareciendo mejor guerrero + trinity\n\nAun así si te vas a hacer una build como esa necesitas tanquear un poco.\n\nP.D: los escudos de la malmortius y el sterak ya no se acumulan.","replies":[]},{"poster":"Condor","date":"2016-05-04T16:55:11.879+0000","up_votes":2,"down_votes":0,"body":"prueba al nuevo veigar....esa weá si que está rota.","replies":[]},{"poster":"Vi Sexual","date":"2016-05-04T20:02:26.972+0000","up_votes":1,"down_votes":0,"body":"Llego el Vest Vi (pun intended) y la verdad que....\n\nPrimero que Fauces y Sterak ya no se stakean, revisa eso amigo. Y aun asi, Vi sigue siendo flexible, la \"build\" (un tanto erronea) que sugeris es para una Vi dps, y lo mas conveniente es poder ser offtank para poder resistir al tirar ulti, o si no venis \"dominando\" desde un principio (vamos, Vi es un campeon **asesino**/luchador, si vas jungla y tu early no fue bueno, dejale el daño al resto de tu team, y convertite en un iniciador), total la W de Vi con el machete de velocidad hace todo el daño sostenido que quieras (guiandome con el antiguo devorador, saciado o no).\nAun asi me gustaria probarlo por mi cuenta, aunque viendo los cambios del parche, la verdad que le sigo siendo fiel a mi hermoso Guerrero + Trinidad/Guantelete (Brillo, bah) ....\n\nEn mi opinion:  Vi Burst> Vi DPS","replies":[]},{"poster":"skysoul fenrir","date":"2016-05-04T15:39:48.854+0000","up_votes":1,"down_votes":0,"body":"hermano, te estas equivocando muy gravemente con lo del 16%, o no pusiste bien un item en la lista o simplemente te confundiste, la cuchilla de sangre inflige 3% de la vida MAXIMA del campeon como daño fijo, mientras que el rey arruinado inflije 6% de la vida ACTUAL, en otras palabras, es efectivo pero va decreciendo con el rato","replies":[]},{"poster":"Kyousuke","date":"2016-05-04T14:04:56.842+0000","up_votes":1,"down_votes":1,"body":"en realidad no creo que la nerfeen por que para hacer el daño debe estar a mele y aunque tenga iniciación fuerte en una tf si se tira mal la comen aunque tenga robo de vida\nigualmente 2 cosas \n1. vi devorador era mejor con el otro por que metia 20% de 4 golpes que serian 2 + la e \n2. esta mal la build por el simple hecho de que llevas garras y malmorthius, ahora no se acumulan sus escudos y tienen igual cd es mejor sacar otro item y uno de esos 2","replies":[{"poster":"Luxaryon","date":"2016-05-04T14:06:22.744+0000","up_votes":1,"down_votes":0,"body":"Acabo de darme cuenta que el Malmortius ya no hace daño por falta de vida. xD","replies":[{"poster":"Kyousuke","date":"2016-05-04T14:41:19.576+0000","up_votes":1,"down_votes":0,"body":"LOOOOOOOOOOL pero si eso lo sacaron hace rato D:","replies":[]}]}]}]}