{"poster":"Pentarelia","date":"2015-03-31T23:57:28.795+0000","title":"Leona E trifft auch wenn sie daneben geht","subforum":"Melde einen Bug","up_votes":1,"down_votes":1,"body":"Mir ist in den letzten Spielen etwas an der Leona &quot;E&quot; aufgefallen. Als ich gegen sie spielte und sie diese einsetzte, ging sie optisch sehr deutlich daneben, aber traf mich trotzdem. Anfangs dachte ich, es sei vielleicht nur Gl&uuml;ck gewesen, doch im weiteren Laufe des Spieles war dieses &quot;Ph&auml;nomen&quot; mehrmals zu sehen.","replies":[{"poster":"Schesam","date":"2015-04-01T11:49:46.755+0000","up_votes":1,"down_votes":0,"body":"Nein, sie blockt den Dmg mit der e und weil meist direkt die q hinterherkommt, die sie auhc stunned, bleibt sie auch stehen. Ob sie nur vom e allein stehen bleibt hab ich nie drauf geachtet, da die q eh stunned","replies":[{"poster":"BM Vilich","date":"2015-04-01T13:30:31.152+0000","up_votes":2,"down_votes":0,"body":"Welcher Depp blockt denn Leonas E mit dem Spellshield??","replies":[]}]},{"poster":"Schesam","date":"2015-04-01T06:32:18.046+0000","up_votes":1,"down_votes":0,"body":"Genauso trifft Leonas e obwohl Sivirs Spellshield es blockt, so kommt einfach nur der DMg ncih durch, sie jump trz dran :3 Also Leo main find ich das zwar nützlich aber auch iwo fragwürdig :D","replies":[{"poster":"Fairtrade Milk","date":"2015-04-01T12:01:00.313+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Schesäm,realm=EUW,application-id=ImBE6GqA,discussion-id=QdA7JnPf,comment-id=0002,timestamp=2015-04-01T06:32:18.046+0000)\n>\n> Genauso trifft Leonas e obwohl Sivirs Spellshield es blockt, so kommt einfach nur der DMg ncih durch, sie jump trz dran :3 Also Leo main find ich das zwar nützlich aber auch iwo fragwürdig :D\n\ngenauso müsste auch die blitz hook funktionieren\nman wird rangezogen aber der Schaden wird 0 gesetzt..\n\nLeona ist wie Annie und Morgana einer der nervigsten Supporter gegen die man spielen muss","replies":[{"poster":"SorisDynasty","date":"2015-04-01T12:16:23.097+0000","up_votes":1,"down_votes":0,"body":"Nein. Warum?\nBlitz Q displaced ein Ziel, also Sivir. Das wird geblockt. Leona's E verändert ja nicht die Position des Gegners. Daher wird man weiterhin rangezogen, Sivir wird lediglich nicht gesnared und blockt den Schaden.\n\nKurzfassung Sivirs Spellshield: (Fast) Alles, was sie beeinflusst, kann sie blocken. Alles, was dich selber zu ihr zieht, wird weiterhin fortgesetzt (Beispiel wäre noch Amumu Q)","replies":[]}]},{"poster":"Alustus","date":"2015-04-01T09:11:45.782+0000","up_votes":1,"down_votes":0,"body":"kann sivier dennoch weiterlaufen?\nWenn ja könnte ich mir vorstellen, dass dies so gewollt ist.\n\nAußerdem sind die sivirs of genau ein bisschen zu spät mit ihrem shild","replies":[]}]},{"poster":"M4UR1C31234","date":"2015-04-01T04:35:48.262+0000","up_votes":1,"down_votes":0,"body":"Das könnte ein wenig an der Leitung der jeweiligen Spieler liegen. (Schlechte Leitung kann zu skillshoot treffern führen obwohl diese nicht treffen)\n\nMit Freundlichen Grüßen","replies":[{"poster":"Alustus","date":"2015-04-01T09:09:43.871+0000","up_votes":1,"down_votes":0,"body":"Naja dan aber nur auf dem bildschirm bei der Person, welche die lags hat.\n\nIch denke schon das Riot die Daten die bei ihren Serven ankommen Verwenden.\n\nWie schon gesagt die hitbox ist größer als die animation. (bzw die champion hitbox ist auch größer als der champ an sich, behaupte ich mal)","replies":[]}]},{"poster":"BM Vilich","date":"2015-04-01T04:46:44.070+0000","up_votes":1,"down_votes":0,"body":"Die Hitbox von Leonas E ist einfach ein bisschen grösser als die Animation.","replies":[]}]}