{"poster":"my time to ch1me","date":"2015-10-18T11:17:55.916+0000","title":"Brauch dringend Hilfe!","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Leute, wie schon im Titel drinsteht, ich brauch Hilfe.  Ich wei&szlig; ich soll riot&#039;s supporter anschreiben bei gr&ouml;&szlig;eren Problemen usw. aber das habe ich schon getan und der war keine gro&szlig;e Hilfe, daf&uuml;r dass ich 5 Tage auf die Antwort warten musste :) . So ich beschreibe kurz und knapp mein Problem, wenn einer schon so was &Auml;hnliches hatte, sagt mir bitte wie ihr das gel&ouml;st habt.\r\n\r\nIch habe ca. seit 8.10.2015 Verbindungsprobleme mit League (alle anderen Internetseiten funktionieren einwandfrei). Wenn ich im Spiel drin bin,  l&auml;uft alles kurze Zeit (1-5 min) normal ab und dann gehen die Disconnects los, und zwar so, dass ich erst nach einigen Minuten die &quot;Verbindungsaufbau&quot; Schrift zu sehen bekomme. Ich kann mich nicht bewegen, Nichts anklicken, aber alle anderen Spieler laufen normal rum, bis die Aufschrift &quot;Verbindungsaufbau&quot; kommt, dann reconnecte ich mich, komm wieder ins Spiel rein und das Ganze geht erneut los. Ich habe gestern mein PC komplett auf den Anfangszustand gebracht (Wiederherstellung). Heut morgens habe ich ein  ganzes Spiel  ohne dc durchgespielt, hab gedacht, dass die Wiederherstellung geholfen hat, aber falsch gedacht ;( hab das Problem noch immer. \r\n\r\nMein Bruder spielt auch League und er hat das gleiche Problem. Unser Anbieter ist Kabel Deutschland.  \r\n\r\nIch entschuldige mich f&uuml;r alle Fehler, die ich in diesem &quot;kurzen&quot;  Text gemacht habe :) \r\n\r\nMit freundlichen Gr&uuml;&szlig;en \r\n\r\nSierra 1110101 ( bin&auml;r f&uuml;r 117 )","replies":[{"poster":"CaptainDomerica","date":"2015-10-18T11:32:05.208+0000","up_votes":1,"down_votes":0,"body":"Lieber Sierra 1110101,\n\nich habe das selbe Problem seit Heute. Dem Support habe ich diese Problem auch schon mitgeteilt. Ich denke das darauf aber kein Verlass sein wird. Das einzige was ich mit vorstellen kann ist, das es an dem neuen Patch liegt da ja eigentlich immer irgendwas aktualisiert wird. Deshalb denke ich das es damit zu tun hat, ich bin aber natürlich keine zuverlässige Quelle und vermute das generell nur. Bleibt leider nichts anderes als abzuwarten. Ich hatte aber schon Angst das ich der Einzige mit diesem Problem bin. Ich drücke dir die Daumen das es bei dir bald wieder funktioniert!\n\nLiebe Grüße, \nCaptainDomerica","replies":[]}]}