{"poster":"Eedat","date":"2016-10-07T16:27:04.330+0000","title":"If those Rylai's changes go through, Morde is dumpstered","subforum":"Gameplay","up_votes":13,"down_votes":4,"body":"Removing the HP and adding mana/cdr would make it completely unviable on Morde. Morde is completely reliant on Rylai&#039;s at the moment just to function at all. Now you&#039;re going to remove the HP he needs to survive as a completely immobile melee champ and add mana that is literally a wasted stat on him. This makes it completely cost ineffective on him.\r\n\r\nSo how does Morde function now? I understand something needs to be done about Rylai&#039;s being abused on certain champs, but if these changes go through you absolutely **must** do something with Morde. He&#039;s going to need a mini rework at least.","replies":[{"poster":"Dracocrash","date":"2016-10-07T16:29:34.466+0000","up_votes":5,"down_votes":0,"body":"If you had the time to research the changes to rylies, you should also have had time to research how riot will deal with the situation for champs who build it for HP.\n\nRiot said they will change other items if necesarry to keep champions like morde/vlad/rumble relevant, one example given was changing dead mans plate.","replies":[{"poster":"Selegun","date":"2016-10-07T16:40:18.898+0000","up_votes":4,"down_votes":0,"body":"Glad someone else read over that entire post.  Looking forward to what they might do with Deadmans Plate.  Maybe revert the slow back up to what it was originally.","replies":[{"poster":"Meep Man","date":"2016-10-07T19:14:05.299+0000","up_votes":1,"down_votes":0,"body":"Likely means increasing the slow duration of the empowered attack and making it not decay (like a 50% slow for 1.5-3~ seconds based on level)","replies":[{"poster":"Selegun","date":"2016-10-07T19:32:31.292+0000","up_votes":1,"down_votes":0,"body":"The decay is fine, its the momentum loss that needs worked on.  Maybe something like 50ish momentum and up applies the slow while 100 gives the damage amp.  Never feels fair that I have to trudge through all the artillery just to get tagged by some other slow at the last moment and not get to stay on target because they could still run without using a flash.","replies":[]}]}]},{"poster":"Azrael Jiraco","date":"2016-10-08T09:17:08.357+0000","up_votes":1,"down_votes":0,"body":"Like Malicious, I will remain anxious until I know what the replacement is. I really don't want to be rushing a Deadman's Plate and being useless in the early and mid game. Morde players generally don't want to see the game get to late stages, either.\n\nUnless they're planning on changing DMP to a bruiser item instead of a full tank item, how will it help? Oh look, I landed a slow, now to do nothing for the rest of the fight. But don't worry, we'll counteract that by keeping dragon ghost! Your success now fully depends on your team's ability to contest dragon! *cries*\n\nBut it's all 'wait and see' as to what the final changes are. I just remember being this anxious about the juggernaught patch, and those feelings were justified!\n\nLike Malicious, if Morde is gutted from a tier 5 champ to a 'this guy is so bad he gets his own tier' champ, I'll probably switch to Overwatch as my main game.","replies":[]}]},{"poster":"Rivuo","date":"2016-10-07T16:29:00.171+0000","up_votes":5,"down_votes":0,"body":"A champion shouldnt be completely reliant on one item to be viable..\n\nI hope they fix mordes problems after the rylais fix, because a good morde is always oppressive i mean fun to watch","replies":[{"poster":"Mira Arya Enthe","date":"2016-10-07T17:23:26.378+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ApexCH,realm=NA,application-id=3ErqAdtq,discussion-id=FfGr9Wwi,comment-id=0000,timestamp=2016-10-07T16:29:00.171+0000)\n>\n> A champion shouldnt be completely reliant on one item to be viable..\n> \n> I hope they fix mordes problems after the rylais fix, because a good morde is always oppressive i mean fun to watch\n\nI made an entire post about how champions should be internally balanced, not based around specific items. It got downvoted to hell. Good luck though.","replies":[{"poster":"GULAG 4 U","date":"2016-10-08T01:24:09.510+0000","up_votes":3,"down_votes":0,"body":"How do you get upvoted by making a post based on logic? To get upvoted you need to hate Yasuo.","replies":[{"poster":"Mira Arya Enthe","date":"2016-10-08T01:46:23.236+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XTRMN00B1337,realm=NA,application-id=3ErqAdtq,discussion-id=FfGr9Wwi,comment-id=000000000000,timestamp=2016-10-08T01:24:09.510+0000)\n>\n> How do you get upvoted by making a post based on logic? To get upvoted you need to hate Yasuo.\n\nXD tru","replies":[{"poster":"GULAG 4 U","date":"2016-10-08T02:18:24.995+0000","up_votes":1,"down_votes":0,"body":"How many posts out there are even based on logic and aren't full of bias anyways, especially about game balance.","replies":[]}]}]}]}]},{"poster":"Abandon","date":"2016-10-08T03:20:18.405+0000","up_votes":4,"down_votes":0,"body":"I think Mordekaiser just needs to be 'Ryzed'. You fail 5 different reworks, until you find something just right. Being completely reliant on an item is a pretty bad balance decision.","replies":[{"poster":"GULAG 4 U","date":"2016-10-08T14:05:27.638+0000","up_votes":1,"down_votes":0,"body":"I'm still pissed at rito for ryzing ryze when they could have spent some time to fix f*ckin aatrox","replies":[]}]},{"poster":"Wolfram Oxford","date":"2016-10-07T18:59:05.641+0000","up_votes":1,"down_votes":1,"body":"I don't see how there are people who actually care about Mordekaiser. In my opinion he is one of the most, if not the most, bland designs in LoL. But back to Rylai's and him, I think he will be fine, perhaps with a different build such as.\n\n{{item:3022}} {{item:3078}} {{item:3146}}","replies":[{"poster":"Maximum Morde","date":"2016-10-07T19:12:34.323+0000","up_votes":2,"down_votes":0,"body":"That build offers almost nothing that would allow Mordekaiser to do well in lane. Gunblade and Triforce have terrible build path(for Mordekaiser) so can't really be first items as they delay power spike too much, and Frozen Mallet lacks punch. Suppose you could get close enough to melee someone in the first place, you still would have no way to actually kill them because the damage isn't there with Frozen Mallet as first item.\n\nBasically, trying to build any of those as your first item is just saying hey, I didn't want to win my lane anyway. If you can't get rolling early as Morde, you are probably gonna have a bad time.","replies":[]},{"poster":"Boulderox","date":"2016-10-08T02:23:30.330+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wolfram Oxford,realm=NA,application-id=3ErqAdtq,discussion-id=FfGr9Wwi,comment-id=0003,timestamp=2016-10-07T18:59:05.641+0000)\n>\n> I don&#x27;t see how there are people who actually care about Mordekaiser. In my opinion he is one of the most, if not the most, bland designs in LoL. But back to Rylai&#x27;s and him, I think he will be fine, perhaps with a different build such as.\n> \n> {{item:3022}} {{item:3078}} {{item:3146}}\n\n{{champion:266}} i used to build {{item:3022}} until {{champion:150}} made it so nobody can build it but him...\n\nbut fun fact, the change was a revert from 5.22 actually...","replies":[]}]},{"poster":"Wulf Helhammer","date":"2016-10-07T18:59:06.895+0000","up_votes":2,"down_votes":0,"body":"Also recall that THE CHANGES AREN'T FINALIZED! In the slightest!!","replies":[]},{"poster":"specter424","date":"2016-10-07T16:43:39.643+0000","up_votes":2,"down_votes":1,"body":"Nothing good will come from this. Remember the \"compensation\" they gave Veigar right after DFG was removed? He was god fucking awful until they buffed him numerous times.","replies":[]},{"poster":"PulsarPollo","date":"2016-10-12T05:39:36.022+0000","up_votes":1,"down_votes":0,"body":"**Cringe**","replies":[]},{"poster":"CerealBoxOfDoom","date":"2016-10-08T01:24:53.807+0000","up_votes":1,"down_votes":0,"body":"put your damn links!","replies":[]},{"poster":"MunchCrunchLunch","date":"2016-10-07T19:46:39.286+0000","up_votes":1,"down_votes":0,"body":"good","replies":[]},{"poster":"Carnerox","date":"2016-10-07T19:36:46.853+0000","up_votes":1,"down_votes":0,"body":"Source???","replies":[]},{"poster":"PermabannedGaren","date":"2016-10-07T19:05:40.379+0000","up_votes":1,"down_votes":0,"body":"So am I missing something?\n\nIsn't that change just an experimental direction Meddler said they were considering, but was in no way the final solution, and also said that the already suggested idea of just increasing the health and lowering the HP was another direction they were considering?","replies":[]}]}