{"poster":"Eedat","date":"2016-09-05T20:35:31.181+0000","title":"I made it!","subforum":"Gameplay","up_votes":28,"down_votes":4,"body":"http://imgur.com/iZjyTPV\n\nFinally clawed my way in Gold! 67% overall winrate and it took 61 games to climb from Silver 5 to Gold 5\n\nAs a Solo-only player as well :)\n\nhttp://imgur.com/6CRatV4\n\nYes, I&#039;m aware Gold is still &quot;low ELO&quot;, but it was my goal and I made it\n\nEDIT: I ALSO UNLOCKED MY LAST CHAMPION TODAY! A good day indeed :) (It was Zed)\n\nhttp://imgur.com/XBVtbbH\n\nhttp://imgur.com/kGL2Uv0","replies":[{"poster":"Bagguette","date":"2016-09-05T21:16:27.981+0000","up_votes":21,"down_votes":0,"body":"Gold is good. Don't let those asshole plat and diamond players tell you whats an acomplishment and whats not.","replies":[{"poster":"Enloct","date":"2016-09-06T03:24:12.637+0000","up_votes":3,"down_votes":0,"body":"There is no objective measure of skill. Thus, the only thing we can objectively point to is how many people you are better than compared to how many people you are worse than. That is of course, approximately where you are on the ladder (if the ladder is accurate). \n\nThus, at gold, you can at least say you're better than most. And you can also observe that people are still making tons of mistakes right up into pro play.\n\nSo yeah, gold is good.","replies":[]},{"poster":"jaymc1130","date":"2016-09-05T21:20:39.100+0000","up_votes":7,"down_votes":16,"body":"> [{quoted}](name=Bagguette,realm=NA,application-id=3ErqAdtq,discussion-id=E31f6tA2,comment-id=0009,timestamp=2016-09-05T21:16:27.981+0000)\n>\n> Gold is good. Don&#x27;t let those asshole plat and diamond players tell you whats an acomplishment and whats not.\n\nLets be honest here mate, Diamond ain't much of an achievement. And 80% of pro players flat out suck balls.\n\nThere are like 15 good players in the whole world. I'm perfectly aware of just how much of a scrub I am despite being a one time Master Tier player.\n\nSince we all suck balls at this game ANY personal best achievement is worth celebrating and being proud of. That's all your hard work and effort paying off, even if you still suck balls after having accomplished your goal. Haters gun hate, but never let em bring ya down.","replies":[{"poster":"Ritesh","date":"2016-09-06T02:02:14.902+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=jaymc1130,realm=NA,application-id=3ErqAdtq,discussion-id=E31f6tA2,comment-id=00090000,timestamp=2016-09-05T21:20:39.100+0000)\n>\n> Lets be honest here mate, Diamond ain&#x27;t much of an achievement. And 80% of pro players flat out suck balls.\n> \n> There are like 15 good players in the whole world. I&#x27;m perfectly aware of just how much of a scrub I am despite being a one time Master Tier player.\n> \n> Since we all suck balls at this game ANY personal best achievement is worth celebrating and being proud of. That&#x27;s all your hard work and effort paying off, even if you still suck balls after having accomplished your goal. Haters gun hate, but never let em bring ya down.\n\nDiamond is the top 1.6%. That's 25,684/7,534,214 players. I wouldn't say it's \"aint much of an achievement\"\n","replies":[]},{"poster":"Ackelope","date":"2016-09-06T05:12:52.002+0000","up_votes":1,"down_votes":0,"body":"the thing is, being good at something is just relative to how good at it other people are. So as long as diamond remains to be the top 2% of players, they can reliably say they're good at this game, simply because they're better than most everyone else.","replies":[{"poster":"jaymc1130","date":"2016-09-06T13:27:27.815+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Ackelope,realm=NA,application-id=3ErqAdtq,discussion-id=E31f6tA2,comment-id=000900000002,timestamp=2016-09-06T05:12:52.002+0000)\n>\n> the thing is, being good at something is just relative to how good at it other people are. So as long as diamond remains to be the top 2% of players, they can reliably say they&#x27;re good at this game, simply because they&#x27;re better than most everyone else.\n\nSure, fair point. It comes down to a personal interpretation of what \"good\" is. I see so many bronze level mistakes made by top 1% players every single game that I don't consider those of us in the top 1% to be very \"good\". I see those same mistakes from most members of the professional scene. I don't consider them very good either.\n\nWhen I think of a good baseball player I don't think of guys like Eric Dubios, Brett Lawrie, and Scott Hatterberg. I think of guys like Nolan Ryan, Mike Schmidt, and Ken Griffey Jr. Despite all 6 of these players being top 1% ball players in the world.\n\nYou could say I'm good at this game because I've been a 1% player for many years now. But you'd be wrong. Ask the players who have played with me here on the boards. Lol. They will tell you the truth, they know I'm a scrub.","replies":[]}]},{"poster":"Dukues","date":"2016-09-06T15:40:07.402+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=jaymc1130,realm=NA,application-id=3ErqAdtq,discussion-id=E31f6tA2,comment-id=00090000,timestamp=2016-09-05T21:20:39.100+0000)\n>\n> Lets be honest here mate, Diamond ain&#x27;t much of an achievement. And 80% of pro players flat out suck balls.\n> \n> There are like 15 good players in the whole world. I&#x27;m perfectly aware of just how much of a scrub I am despite being a one time Master Tier player.\n> \n> Since we all suck balls at this game ANY personal best achievement is worth celebrating and being proud of. That&#x27;s all your hard work and effort paying off, even if you still suck balls after having accomplished your goal. Haters gun hate, but never let em bring ya down.\n\nNot sure why so many down votes probably because of the 80% of pro players suck balls part. I disagree with you there, but do agree most of us are scrubs at this game. I am fine with being a scrub just happy to achieve my goal as well this season.","replies":[{"poster":"jaymc1130","date":"2016-09-06T15:47:30.602+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dukues,realm=NA,application-id=3ErqAdtq,discussion-id=E31f6tA2,comment-id=000900000004,timestamp=2016-09-06T15:40:07.402+0000)\n>\n> Not sure why so many down votes probably because of the 80% of pro players suck balls part. I disagree with you there, but do agree most of us are scrubs at this game. I am fine with being a scrub just happy to achieve my goal as well this season.\n\nIt got downvoted? Some people don't like to hear the truth. Couldn't care less tbh.\n\nIn any case, any personal achievements any player makes at any point in time to register a personal best are not only worthy of celebration and no small amount of pride, but are the exact kinds of goals players should strive to achieve as it shows they are willing to work hard and put in the effort to constantly improve at the game. If you set a goal for yourself and you achieve it, regardless of what any one thinks of you achieving that goal, you should be proud of yourself for having done it. Not because the goal was some grand thing, but because you have discipline and show a good work ethic and these things are fundamental aspects to success in life in general. Having these qualities is ALWAYS a good thing and something each person should desire to have and improve on each day.","replies":[{"poster":"Dukues","date":"2016-09-06T16:43:17.150+0000","up_votes":1,"down_votes":0,"body":"Yea haha I agree. I also find your perspective interesting and agree when talking about the different elos.","replies":[]}]}]}]},{"poster":"KoggyStyle","date":"2016-09-07T00:46:31.935+0000","up_votes":1,"down_votes":0,"body":"dont let the boosted bronzies put you down.\n\n FTFY","replies":[]}]},{"poster":"S0kaX","date":"2016-09-05T20:36:36.195+0000","up_votes":8,"down_votes":0,"body":"Good job, take these biscuits {{item:2010}}  {{item:2010}}  {{item:2010}}  {{item:2010}}","replies":[{"poster":"Eedat","date":"2016-09-05T20:42:56.255+0000","up_votes":4,"down_votes":1,"body":"*noms*","replies":[]}]},{"poster":"MagicFlyingLlama","date":"2016-09-05T20:39:36.308+0000","up_votes":6,"down_votes":2,"body":"Playing, of course, cheese top laners. \nIs giving in to the dark side the only way to climb in solo games?","replies":[{"poster":"jaymc1130","date":"2016-09-05T20:41:24.077+0000","up_votes":9,"down_votes":1,"body":"> [{quoted}](name=MagicFlyingLlama,realm=NA,application-id=3ErqAdtq,discussion-id=E31f6tA2,comment-id=0002,timestamp=2016-09-05T20:39:36.308+0000)\n>\n> Playing, of course, cheese top laners. \n> Is giving in to the dark side the only way to climb in solo games?\n\nYah.\n\nhttps://i.gyazo.com/68077eb031be2b68b77e7f4fbae8f49e.png","replies":[]},{"poster":"Eedat","date":"2016-09-05T20:42:31.953+0000","up_votes":3,"down_votes":0,"body":"Actually I main jungle :)","replies":[]},{"poster":"Renascent","date":"2016-09-05T21:32:08.166+0000","up_votes":2,"down_votes":1,"body":"Cheese top laners? His match history looks more like a one-trick Wukong main.","replies":[{"poster":"FantasySniper","date":"2016-09-05T22:59:58.742+0000","up_votes":2,"down_votes":0,"body":"Wukong has been secret OP for 3 seasons now.","replies":[{"poster":"Renascent","date":"2016-09-05T23:04:38.238+0000","up_votes":2,"down_votes":0,"body":"I was referring to the statement \"cheese top laners\", which one can infer that the person making the claim was stating that the OP had a pool of cheese champions to pick from when going top lane. In which case I was pointing out that the OP was only playing one champion in ranked, in which case the statement \"cheese top laners\" is undoubtedly invalidated. \n\nThe correct sentence for this situation would therefore be \"Playing, of course, **a cheese top laner.**\"","replies":[]}]}]},{"poster":"KoggyStyle","date":"2016-09-07T00:49:27.829+0000","up_votes":1,"down_votes":0,"body":"uhm.... teemo and quinn are the only cheese tops... my fave top can be outplayed... if your good... then again im a baddie.","replies":[]}]},{"poster":"Koala Frenzy","date":"2016-09-05T21:34:30.438+0000","up_votes":5,"down_votes":0,"body":"Gold 5 is top 25%. Pretty good.","replies":[]},{"poster":"cinomenapplebae","date":"2016-09-06T00:02:04.899+0000","up_votes":4,"down_votes":0,"body":"TBh why is no one else noticing all the skins you have in hextech crafting","replies":[{"poster":"Eedat","date":"2016-09-06T01:28:04.734+0000","up_votes":3,"down_votes":0,"body":":^)","replies":[]}]},{"poster":"FantasySniper","date":"2016-09-05T22:59:14.242+0000","up_votes":3,"down_votes":0,"body":"67% is really good, but expect it to drop to 58% at least by the time you're in high gold.","replies":[{"poster":"Amasa Delano","date":"2016-09-06T17:01:10.911+0000","up_votes":1,"down_votes":0,"body":"Anything oer 50% is still climbing.","replies":[]}]},{"poster":"DREADN0UGHT","date":"2016-09-06T15:58:06.993+0000","up_votes":1,"down_votes":0,"body":"So you mean to tell me that you owned Aatrox, but not Zed before today?","replies":[{"poster":"jaymc1130","date":"2016-09-06T16:16:35.520+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Galacticamaru,realm=NA,application-id=3ErqAdtq,discussion-id=E31f6tA2,comment-id=0018,timestamp=2016-09-06T15:58:06.993+0000)\n>\n> So you mean to tell me that you owned Aatrox, but not Zed before today?\n\nWhen you purchase champs in alphabetical order that seems only natural.","replies":[]}]},{"poster":"Limrick","date":"2016-09-06T04:54:25.605+0000","up_votes":2,"down_votes":0,"body":"Gold is high Elo, given that the absolute average is Silver V.  You made it m8, you're officially good at the game!","replies":[]},{"poster":"jaymc1130","date":"2016-09-05T20:39:58.054+0000","up_votes":2,"down_votes":0,"body":"Congrats!","replies":[]},{"poster":"Navarune","date":"2016-09-05T20:39:05.399+0000","up_votes":2,"down_votes":0,"body":"Congrats!","replies":[]},{"poster":"oSEXYPLATYPUSo","date":"2016-09-05T23:34:48.874+0000","up_votes":3,"down_votes":1,"body":"{{sticker:zombie-brand-clap}} {{sticker:zombie-brand-clap}} {{sticker:zombie-brand-clap}} \n\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"I wear Givenchy","date":"2016-09-05T20:50:25.850+0000","up_votes":4,"down_votes":3,"body":"Congrats. You're not boosted like the rest of America...","replies":[{"poster":"Eedat","date":"2016-09-05T20:58:22.807+0000","up_votes":1,"down_votes":0,"body":"LOL take a look at what Gold 5 looks like :^)\n\nhttp://imgur.com/a/fyFXo","replies":[{"poster":"Kingdom Corn","date":"2016-09-06T04:17:13.061+0000","up_votes":1,"down_votes":0,"body":"So no one was lying when I was told 90% of players in gold are boosted.... Damn feels really bad man","replies":[]}]}]},{"poster":"dunder kill","date":"2016-09-05T21:10:05.932+0000","up_votes":2,"down_votes":1,"body":"> EDIT: I ALSO UNLOCKED MY LAST CHAMPION TODAY! A good day indeed :) (It was Zed)\n> \n> http://imgur.com/XBVtbbH\n> \n> http://imgur.com/kGL2Uv0\n\nLast champion Zed. Good man. +1","replies":[]},{"poster":"Niyumi","date":"2016-09-07T03:43:19.404+0000","up_votes":1,"down_votes":0,"body":"Congrats.\n\nI wish I could be lucky enough to climb to gold, but, where I'm 3/1 mid game, everyone else is 1/10. 4,000 games in silver and counting. ^^","replies":[]},{"poster":"Unstoppable Monk","date":"2016-09-07T03:43:06.408+0000","up_votes":1,"down_votes":0,"body":"Nice to know someone got lucky at the potato dumpter that is to Bronze 2 to Silver 4.  I'm busy watching my teammates throw my lane and then the game later when I eventually make a play that can win the game, after my MMR/ranked got dumpstered to cocky group queues that I trusted unwisely.","replies":[]},{"poster":"KoggyStyle","date":"2016-09-07T00:45:48.444+0000","up_votes":1,"down_votes":0,"body":"Grats on shiny bronze... now go rise! and put those boosted bronzies in they place.\n\nEdit. Grats on last champ, i got 29 to go!","replies":[]},{"poster":"Swiftstrike4","date":"2016-09-06T17:35:02.823+0000","up_votes":1,"down_votes":0,"body":"Nice job. Maintaining Gold may be at first difficult since you will have to adapt your playstyle more. \n\nI don't think there is much of a difference in skill with most high Silver and Gold V players. Just perhaps fewer mistakes in game.\n\nI started noticing player improvements when I hit high Gold 4 and Gold 3. Players were more responsive and understood tactics besides \"grouping and going mid\".\n\nMy experience in Gold is that the players are way less toxic and usually know how to play from behind.","replies":[]},{"poster":"Randomonium","date":"2016-09-06T15:59:41.280+0000","up_votes":1,"down_votes":0,"body":"Congrats. I'm hoping to reach my gold promos sometime this week. I had some eureka moments and lately I've been averaging an 80% win rate so hopefully I'll make it there soon.","replies":[]},{"poster":"Hot Belly Dancer","date":"2016-09-06T04:43:41.017+0000","up_votes":1,"down_votes":0,"body":"Welcome to gold, where you'll tilt as you never have before! where you'll question whether its Gold or Bacteria 5. Where you'll ask yourself, what you did to deserve getting matched with all those boosted animals who got guts to flame you when they fed their asses off! congratulations my friend {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Dukues","date":"2016-09-06T15:45:58.089+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hot Belly Dancer,realm=NA,application-id=3ErqAdtq,discussion-id=E31f6tA2,comment-id=0013,timestamp=2016-09-06T04:43:41.017+0000)\n>\n> Welcome to gold, where you&#x27;ll tilt as you never have before! where you&#x27;ll question whether its Gold or Bacteria 5. Where you&#x27;ll ask yourself, what you did to deserve getting matched with all those boosted animals who got guts to flame you when they fed their asses off! congratulations my friend {{sticker:slayer-jinx-wink}}\n\nHaven't noticed that much yet. Just more seems to me like everyone from low plat to  gold seems the same. I assume higher ranking players are better but I have stopped noticing a huge difference. Maybe there is not supposed to be or maybe their used to be before this season. All I know is I go into each game just assuming we all the same and been doing alright. Only gold 4 though, probably gets harder the lower you go in gold. For some reason I just been switching out games on 3 accounts so they all gold 4 but haven't really tried to super push ranking up on any of them. My most played account I use to play with friends and call it my dynamic boost account. Granted, they all lower rank than me and I am not that good so we end up losing more than winning or at least staying around 50%. Was up to like 80 lp in gold 4 on that account playing solo, but then played with friends now I am back down to like 30 :((.","replies":[{"poster":"jaymc1130","date":"2016-09-06T15:55:32.880+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dukues,realm=NA,application-id=3ErqAdtq,discussion-id=E31f6tA2,comment-id=00130000,timestamp=2016-09-06T15:45:58.089+0000)\n>\n> Haven&#x27;t noticed that much yet. Just more seems to me like everyone from low plat to  gold seems the same. I assume higher ranking players are better but I have stopped noticing a huge difference. Maybe there is not supposed to be or maybe their used to be before this season. All I know is I go into each game just assuming we all the same and been doing alright. Only gold 4 though, probably gets harder the lower you go in gold. For some reason I just been switching out games on 3 accounts so they all gold 4 but haven&#x27;t really tried to super push ranking up on any of them. My most played account I use to play with friends and call it my dynamic boost account. Granted, they all lower rank than me and I am not that good so we end up losing more than winning or at least staying around 50%. Was up to like 80 lp in gold 4 on that account playing solo, but then played with friends now I am back down to like 30 :((.\n\nThere's a pretty significant difference bewteen a bronze player and a silver-plat player. But there is very little difference between a silver player and a platinum player, just slightly better mechanics and/or game knowledge. There is a pretty significant difference between a low diamond player and a high diamond player, and a huge difference between a Master Tier or better player and your average or even a high level diamond.\n\nEssentially, there are less skill tiers than people think. Bronze is one level. Silver through low diamond tends to be another. Diamond is a third. And Master+ is the last before one hits professional levels of skill.\n\nThe biggest real difference between most of these skill ranges tends to be attitude. Bronze players have non existent attitudes and mentalities. Silver-Plat tend to have very poor attitudes and mentalities. Low diamonds have moderate attitudes and mentalities. High diamonds have good attitudes and mentalities. Master Tier and up tend to have excellent attitudes and mentalities. This is not to say that all players have an attitude or mentality that corresponds to these ranges, but merely that those attitudes are the most common occurrence for players in those ranges. Attitudes of all types and forms can be found in each level of play.","replies":[]}]}]},{"poster":"Delphinium","date":"2016-09-06T14:57:18.997+0000","up_votes":1,"down_votes":0,"body":"Congrats!","replies":[]}]}