{"poster":"Eedat","date":"2017-02-17T02:13:02.996+0000","title":"Mages have been doing True Damage to squishies with just boots literally for years.","subforum":"Gameplay","up_votes":16,"down_votes":19,"body":"Hey, since people might not know, I figured I would point out that Mages have been doing True damage to squishies for years now with absolutely nothing but Runes, Masteries, and Boots.\n\nHow?\n\nWell lets take a look at something that you might not know. As it is currently, half of the champions in LoL have a base MR of 30 at level 1 and get ZERO MR/Level. This leaves them with 30 MR from levels 1 to 18 unless they go out of the way to build some.\n\nSo lets take a look at the numbers.\n\nStarting with 30 MR:\n\n- minus {{item:3020}} = 15\n\n- minus Magic Pen Marks =  7.2\n\n- minus Precision (Mastery) = -1.2\n\nSo with just runes, masteries, and 1100G boots, Mages have been capable of dealing true damage to squishies for years now.\n\nFor comparison, The LOWEST base armor at 18 is Orianna with 68 Armor. With the exceptions of Thresh who has his passive and Gnar who has different values in Mini/Mega.\n\nSo if we&#039;re going to be fair about this, True Damage to squishies has existed for a very long time.\n\nSome food for thought.","replies":[{"poster":"DrCyanide","date":"2017-02-17T02:17:06.194+0000","up_votes":19,"down_votes":5,"body":"And every last mage has been balanced around doing that damage. Can the same be said for Lethality?","replies":[{"poster":"Eedat","date":"2017-02-17T02:20:30.195+0000","up_votes":11,"down_votes":8,"body":"Every single last mage is balanced? What? Going to disagree with you there.","replies":[{"poster":"MavenSong","date":"2017-02-17T02:55:48.990+0000","up_votes":17,"down_votes":0,"body":"To be fair he said balanced around that. he didnt say they themselves were balanced, rather was a balance point.","replies":[{"poster":"Snowman Arc","date":"2017-02-17T06:01:47.814+0000","up_votes":1,"down_votes":3,"body":"So you're saying that mages were balanced around the point of them building Sorc shoes? What about those who don't build those? Are they left out? Are they lacking damage because of it? Because if they do, then that's not correct balancing.","replies":[{"poster":"Votable Jester","date":"2017-02-17T08:26:08.170+0000","up_votes":3,"down_votes":0,"body":"Yes, if you build a defensive item rather than an offensive item, you do less damage.\n\nIt's quite surprising isn't it?  Btw Boots of Lucidity are a common buy for mages as well.  Sorc boots aren't required, just give optimal damage.","replies":[]}]}]}]}]},{"poster":"dunder kill","date":"2017-02-17T02:16:57.045+0000","up_votes":14,"down_votes":0,"body":"http://i.imgur.com/YAGpXPd.png?fb","replies":[]},{"poster":"SchmidttyGames","date":"2017-02-17T02:22:56.858+0000","up_votes":7,"down_votes":1,"body":"With a few notable exceptions like Ryze, most Mages can't spam spells like every champion can spam Auto Attacks.","replies":[{"poster":"McFatal","date":"2017-02-17T02:35:25.452+0000","up_votes":6,"down_votes":3,"body":"> [{quoted}](name=RAMP Schmidtty,realm=NA,application-id=3ErqAdtq,discussion-id=jJO86szh,comment-id=0005,timestamp=2017-02-17T02:22:56.858+0000)\n>\n> With a few notable exceptions like Ryze, most Mages can&#x27;t spam spells like every champion can spam Auto Attacks.\n\n{{champion:55}} {{champion:7}} {{champion:134}} {{champion:112}} {{champion:161}} {{champion:45}} {{champion:115}} \n\nthe late game version of these champs are machine gun spells being thrown out","replies":[{"poster":"Fondling Gems","date":"2017-02-17T03:25:41.324+0000","up_votes":11,"down_votes":0,"body":"Wow two people listing spam mages and Karthus is forgotten.  Feels bad.","replies":[{"poster":"Eedat","date":"2017-02-17T03:59:54.131+0000","up_votes":2,"down_votes":0,"body":"Wow. All the credit to {{champion:30}} and none for {{champion:69}} {{champion:268}}? I see how it is","replies":[{"poster":"Fondling Gems","date":"2017-02-17T06:35:10.736+0000","up_votes":2,"down_votes":0,"body":"TBF Karthus was the original spammer though which is why I brought him up since it is always sad when the originator of a group is forgotten in a discussion of that group.","replies":[{"poster":"LordGeovanni","date":"2017-02-17T06:41:31.300+0000","up_votes":1,"down_votes":0,"body":"That would be ryze?","replies":[{"poster":"Fondling Gems","date":"2017-02-17T06:45:48.568+0000","up_votes":1,"down_votes":0,"body":"I never really felt like Ryze was the spammy mage pre rework.  During his ult he shat out a lot of abilities but most of the time he didn't feel any different from most mages to me.","replies":[{"poster":"LordGeovanni","date":"2017-02-17T09:21:39.155+0000","up_votes":1,"down_votes":0,"body":"ryze was always as spammy as lets say syndra  before he had more time where he had to scale though due to mage items being more expensive and in general mage cooldowns being higher where ryze q was about 4 seconds the average mage poke spell was 8-10 now mages almost all have a 6 or less second poke spell before cdr is even applied.","replies":[{"poster":"Fondling Gems","date":"2017-02-17T18:01:23.142+0000","up_votes":1,"down_votes":0,"body":"Compared to 1 second karthus Q at all levels.","replies":[{"poster":"LordGeovanni","date":"2017-02-18T17:01:22.398+0000","up_votes":1,"down_votes":0,"body":"even if karthus has spam qs on 1 second at all levels syndra comes more to mind as a spam mage because her qs are actually hard to dodge because it has a shorter delay when being summoned and its over a wider area does more damage that isnt hampered by touching multiple things  etc. karthus has always been more about his e for me because it had more benifits i leveled it first because it gave more constant damage that i didnt have to aim and because it gave more mana back i may be doing it wrong but karthus q gives too little when it hits multiple targets before its 4th point in it","replies":[{"poster":"Fondling Gems","date":"2017-02-18T20:37:39.295+0000","up_votes":1,"down_votes":0,"body":"Yeah but Karthus came out long before Syndra and personally I find him spammier because you are still pressing more buttons.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"TyrekGoldenspear","date":"2017-02-17T03:04:14.970+0000","up_votes":3,"down_votes":0,"body":"Not necessarily Viktor, because depending on his itemization his CDR building takes second priority.","replies":[]}]},{"poster":"Eedat","date":"2017-02-17T02:31:35.073+0000","up_votes":4,"down_votes":0,"body":"Thats why ADs lack AoE damage for the most part. With exceptions like {{champion:21}} {{champion:110}} for example","replies":[]}]},{"poster":"dakota saturn","date":"2017-02-17T02:15:56.944+0000","up_votes":5,"down_votes":4,"body":"However, between edge, maw, and quicksilver, so-called squishies have a lot of options - and any fed ad with a brain is going to buy one or more of these if there's a fed ap on the enemy team.  There are a lot less mpen options than lethality options.\n\nhttps://s27.postimg.org/w9v0ry4zn/148394996760638.jpg","replies":[{"poster":"Eedat","date":"2017-02-17T02:19:08.227+0000","up_votes":8,"down_votes":0,"body":"Thats not a coincidence.\n\nYou ever think there's less MPen because there's less MR in the game to begin with?\n\nAlso, {{item:3135}} works on TOTAL magic resist, so its still very effective vs squishies","replies":[{"poster":"BakedLotion","date":"2017-02-17T04:50:04.171+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Eedat,realm=NA,application-id=3ErqAdtq,discussion-id=jJO86szh,comment-id=00000001,timestamp=2017-02-17T02:19:08.227+0000)\n>\n> Thats not a coincidence.\n> \n> You ever think there&#x27;s less MPen because there&#x27;s less MR in the game to begin with?\n> \n> Also, {{item:3135}} works on TOTAL magic resist, so its still very effective vs squishies\n\nlet's just forget maw/qss/edge of night/steraks\ncan attack while using any of these, cancels cc, spell shield, instant antiburst shield, additional steroids when shield procs, lethality\n\nnow lets see the options mages have for AD burst \nzhonyas\nStasis. invincibility. Can't even attack when using it. 120 sec cd. AP,CDR,Armor. All low amounts.\n\nif you give some lame excuse about how mages can buy roa/ryalis, they're not good on a ton of AP champions and if you do include these, u can include frozen mallet.\n\n:)\n\nalso: better build path for AD\n\na simple hexdrinker completely negates burst, while seeker's armguard only gives u flat stats","replies":[{"poster":"LordGeovanni","date":"2017-02-17T06:50:33.187+0000","up_votes":1,"down_votes":0,"body":"frozen mallet isnt overlaoded with abunch of offensive stats while haveing shit ton of health and utility like the other two items you mentioned that are GOOD on every mana using mage even if not BETTER that the top options that DOES NOT mean the item is not good. mages and adc mains want too much things that are good in every situation with out sacrificeing anything while the real ads fighters get all their items nerfed offensive and defensive every time riot sees a  marksmen look too hard at them or a mage cries too loud that tanky characters arent susceptable to burst.","replies":[{"poster":"BakedLotion","date":"2017-02-17T14:53:36.710+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=LordGeovanni,realm=NA,application-id=3ErqAdtq,discussion-id=jJO86szh,comment-id=0000000100010000,timestamp=2017-02-17T06:50:33.187+0000)\n>\n> frozen mallet isnt overlaoded with abunch of offensive stats while haveing shit ton of health and utility like the other two items you mentioned that are GOOD on every mana using mage even if not BETTER that the top options that DOES NOT mean the item is not good. mages and adc mains want too much things that are good in every situation with out sacrificeing anything while the real ads fighters get all their items nerfed offensive and defensive every time riot sees a  marksmen look too hard at them or a mage cries too loud that tanky characters arent susceptable to burst.\n\nRoa gives health mana and ap and a barely noticeable heal.\nRylais is essentially frozen mallet. \nWhats your point","replies":[{"poster":"LordGeovanni","date":"2017-02-18T17:11:42.007+0000","up_votes":1,"down_votes":0,"body":"Rylias still has too much ap to be compared to frozen mallet and frozen mallet 's usefulness is determined on how much you can stick to your target not how much spam spells you have from range. The heal on RoA is bearly noticeable but when its on champions useing a spell every 6 or less seconds its better sustain than anything tanks have besides warmogs which requires being out of battle for 30 or more seconds to do anything. \nWith either of these 2 items mages reach 3000 hp at level 18 which tanks need to build 3 hp based items to reach mages have lower spell cooldowns initially and better items while not giving up damage for cooldown while tanks and fighters have to give up cooldown for raw damage. you guys want that and more penetration but if a penetration item comes out ant it doesnt have 80 or more ap on it its a trash item which is likely why there wont be any comming out as there is an item with 80 ap and penetration and its barely picked up  because max health damage is supposedly bad and not for all mages even though the penetration also helps with squishy champions too.","replies":[]}]}]}]}]},{"poster":"McFatal","date":"2017-02-17T02:16:52.164+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=dakota saturn,realm=NA,application-id=3ErqAdtq,discussion-id=jJO86szh,comment-id=0000,timestamp=2017-02-17T02:15:56.944+0000)\n>\n> However, between edge, maw, and quicksilver, so-called squishies have a lot of options - and any fed ad with a brain is going to buy one or more of these if there&#x27;s a fed ap on the enemy team.  There are a lot less mpen options than lethality options.\n> \n> https://s27.postimg.org/w9v0ry4zn/148394996760638.jpg\n\nlets look at the defensive/damage items for bruisers and the defensive/damage items for mages.\n\nneed i say more?","replies":[]}]},{"poster":"Doctor Jarvis","date":"2017-02-17T02:20:17.055+0000","up_votes":8,"down_votes":3,"body":"Mages don't scale 1 to 1 with AP. They can't stack a CDR to get 2 of their best spells per second. They can't build items that make their spells deal double damage without simple stat-stacking. The two don't seem comparable.","replies":[{"poster":"Eedat","date":"2017-02-17T02:29:19.717+0000","up_votes":8,"down_votes":2,"body":"Thats why AP is much cheaper than AD and easier to stack. 600 AP is easily obtainable by any mage in the game, but actually impossible for any AD champs that dont have a gimmick that gives them extra AD","replies":[{"poster":"HeresyHorus","date":"2017-02-17T08:14:47.840+0000","up_votes":1,"down_votes":0,"body":"> 600 AP is easily obtainable by any mage in the game\n\nmost mages have mediocre AP scalings ( around %70 even on ults ) and only 3 damaging spells from a total of 5.\n\nad champs have their 1:1 aa + many of them have + %100 bonus and/or TOTAL ad scaling on their spells and have more damaging spells than mages.\n\njust look at cait, corki, jayce, quinn, mf, panth, talon and kha6 scalings.\n\nalso ad champs have + AS and + CDR ( both can translate into a DPS increase while mages have only CDR ).","replies":[]},{"poster":"LankPants","date":"2017-02-17T07:54:25.343+0000","up_votes":1,"down_votes":0,"body":"Yes, but the average AD ratio on a caster is also higher than the average AP ratio on a caster to offset this. \n\nTake Zed for example, his Q has a 90% AD ratio on a single Shuriken hit. That's already high but his multi Q drives it even higher, a double Q has a ratio of 144% and his triple Q has 198%. Mages just don't have these sorts of ratios and certainly not on basic abilities.\n\nWhen we're talking AD and AP casters the difference between endgame AD and endgame AP is accounted for on their kits.\n\nAD casters have more base damage on their kit when you account for AAs, they just do more damage. This has traditionally been offset by base armour, but as it stands base armour is worthless which is why AD casters are so broken right now.","replies":[]}]}]},{"poster":"Leo1024","date":"2017-02-17T03:32:47.730+0000","up_votes":5,"down_votes":0,"body":"Mages can't right click you to death tho, dodge their skill shots and they're useless for the next 8 seconds or so","replies":[{"poster":"Eedat","date":"2017-02-17T03:58:51.600+0000","up_votes":4,"down_votes":1,"body":"Thats why ADC tend to lack AoE. The exceptions to this like {{champion:21}} {{champion:104}} {{champion:110}} are the ones turning out to be the biggest problems correct? Again, not a coincidence.","replies":[{"poster":"Leo1024","date":"2017-02-17T12:47:33.860+0000","up_votes":1,"down_votes":0,"body":"again, cait doesn't care about no aoe because she'll crit 3 shot you, vayne will shred through anyone and so will jhin, right click richter click right click, they can miss every skillshot and still deal massive damage with their passive and aa","replies":[]}]}]},{"poster":"Unreformed Shaco","date":"2017-02-17T03:36:38.220+0000","up_votes":3,"down_votes":0,"body":"The difference is ALL mages damage comes from their skills.\n\nAssassins get hard hitting skills and then they have massive 400 damage autos to back it up.\n\n\nAlso, if you are going to include MPen marks (standard) you have to include Magic Resist Glyphs (standard) which give 12.","replies":[]},{"poster":"Sagan Forever","date":"2017-02-17T03:29:34.735+0000","up_votes":3,"down_votes":0,"body":"Don't most people have mr blues? Just a question if you are looking at runes only looking at the pen runes is deceiving.","replies":[{"poster":"5000000000000000","date":"2017-02-17T03:50:26.373+0000","up_votes":1,"down_votes":0,"body":"That brings up MR to 42 from 30. Mages itemizing for true damage often build haunting guise, too.","replies":[{"poster":"Sagan Forever","date":"2017-02-17T04:42:32.559+0000","up_votes":1,"down_votes":0,"body":"Then it is not true damage from boots? Not saying magic pen is weak, but that something as common as mr blues should not be excluded.","replies":[{"poster":"5000000000000000","date":"2017-02-17T04:48:06.881+0000","up_votes":1,"down_votes":0,"body":"Technically no, it's not just from boots. It still stands that completely removing magic resist from squishies is relatively easy, though.\nAlso, A lot of mages go for scaling CDR blues, too, and many enchanter supports get AP. I'm pretty sure all the ADC rune pages include MR blues.\n\nNot saying you're wrong, just trying to add to the discussion.","replies":[{"poster":"Sagan Forever","date":"2017-02-17T14:07:01.639+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}]},{"poster":"Dark Nephthys","date":"2017-02-17T02:39:38.272+0000","up_votes":4,"down_votes":1,"body":"Magic Pen only works with spells which is limited by CDR, while Armor pen works with Auto attacks and Abilities, not to mention that AD champions are all about adding extra modifiers and on-hit to their auto attacks be it Crit, Life steal, or just extra damage from items like {{item:3078}} {{item:3153}} {{item:3091}}.\n\nAlso magic pen takes a bit to even be useful since it's not as useful as Armor pen early and you need to build up enough AP to even get any use out of magic pen. Lethality comes on more items then Magic pen on AP items and all of the Lethality items are very good items that can be rushed as a first item. Not every AP champion can afford to rush a {{item:3151}} as their first item but for {{champion:63}} {{champion:68}} {{champion:17}} {{champion:143}} and maybe {{champion:90}}, everyone else won't even think about grabbing it until it's their 3/4th item and that is even if they need it at that point.","replies":[{"poster":"LordGeovanni","date":"2017-02-17T07:50:44.655+0000","up_votes":1,"down_votes":0,"body":"{{item:3091}}  benefits from magic pen and is such a useless item no one builds it. I used to on taric before his rework and on braum and leona before tarics rework but you cant even get melee supports bot lane any more. \nYes magic spells are gated by cooldowns and most mages dont have siginificant cooldowns and have nuke spells  compared to ad spells which are often lower base values and less scaleing than ap spells which also have higher numbers on their items and most of their items come with free cdr that makes it rather hard to not itemize cdr and get good items with good effects. you shouldnt have penetration automaticly in your build for every mage or adc that is a situational choice.","replies":[{"poster":"Dark Nephthys","date":"2017-02-17T12:06:55.666+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LordGeovanni,realm=NA,application-id=3ErqAdtq,discussion-id=jJO86szh,comment-id=00060000,timestamp=2017-02-17T07:50:44.655+0000)\n>\n> {{item:3091}}  benefits from magic pen and is such a useless item no one builds it. I used to on taric before his rework and on braum and leona before tarics rework but you cant even get melee supports bot lane any more. \n> Yes magic spells are gated by cooldowns and most mages dont have siginificant cooldowns and have nuke spells  compared to ad spells which are often lower base values and less scaleing than ap spells which also have higher numbers on their items and most of their items come with free cdr that makes it rather hard to not itemize cdr and get good items with good effects. you shouldnt have penetration automaticly in your build for every mage or adc that is a situational choice.\n\nWhile AP spells usually do more damage than AD spells, the AD champion still gets use out of Armor pen for their auto attacks as well which AP champions do not, which is why I said Magic pen is gated by CDs while AD champions are not. Even for AD Casters, that auto attack is generally huge late game. Then if you look at ADCs who might build 1-2 Lethality and then go Crit, they can easily do close to or over 1k damage on an auto attack which is un-dodgable (unless Blind/Jax etc) and is much faster and will hit you more then any AP's spells but for maybe {{champion:69}}.\n\nAD champions can also go full Lethality runes which gives them 24 of it (14 at level 1, which is still higher then mage's magic Pen) and will scale up higher.","replies":[{"poster":"LordGeovanni","date":"2017-02-18T17:19:03.602+0000","up_votes":1,"down_votes":0,"body":"many ap champions have magic damage on their auto attacks that they often refuse to use because their class is mage they dont see a reason to auto attack between spells where they will benifit from the armor penetration and the magic penetration.\nmage spells do more than ad spells AND have lower cooldowns with often equal or better cc on them\n{{item:3115}} {{item:3091}}  \n{{champion:131}}  {{champion:61}} {{champion:268}} {{champion:245}} {{champion:31}} {{champion:60}} etc","replies":[]}]},{"poster":"MrHaZeYo","date":"2017-02-17T09:30:37.092+0000","up_votes":1,"down_votes":0,"body":"Uh what? Shyv, Teemo, Kayle, Udyr, really any AS champ can make decent use out of it. Even if they do no Magical Damage becuase if they're on a heavy Ap team (such as the standard meta before this patch with a Mage Mid, Mage Supp and sometimes Magical Damagers Top/Jg, they enable them to do more damage.","replies":[]}]}]},{"poster":"LankPants","date":"2017-02-17T07:46:44.416+0000","up_votes":2,"down_votes":0,"body":"Mages on average have a lot lower damage on their kit than someone like Zed does. Zed's burst is a lot more extreme than even the strongest burst mages because it assumes even Zed's squishiest targets will have some armour. When they have no armour the damage is just straight up out of line.","replies":[]},{"poster":"sobi999","date":"2017-02-17T07:38:40.901+0000","up_votes":2,"down_votes":0,"body":"Magic pen has been balanced for ages dude. Lethality comes out and causes havoc straight away. AD champs mostly rely on AA unlike mages which have CD on abilities. Mages are usually always burst able but nowadays AD champs can sustain with lifesteal, burst with lethality and even have great actives on them. Most of them even have better base health than us. You basically have 100x more options in combination of items than we do. If you're moaning about mages bursting squishy AD which is meant to be their role then GL.","replies":[]},{"poster":"ValyrianBlade","date":"2017-02-17T04:09:42.301+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Eedat,realm=NA,application-id=3ErqAdtq,discussion-id=jJO86szh,comment-id=,timestamp=2017-02-17T02:13:02.996+0000)\n>\n> Hey, since people might not know, I figured I would point out that Mages have been doing True damage to squishies for years now with absolutely nothing but Runes, Masteries, and Boots.\n> \n> How?\n> \n> Well lets take a look at something that you might not know. As it is currently, half of the champions in LoL have a base MR of 30 at level 1 and get ZERO MR/Level. This leaves them with 30 MR from levels 1 to 18 unless they go out of the way to build some.\n> \n> So lets take a look at the numbers.\n> \n> Starting with 30 MR:\n> \n> - minus {{item:3020}} = 15\n> \n> - minus Magic Pen Marks =  7.2\n> \n> - minus Precision (Mastery) = -1.2\n> \n> So with just runes, masteries, and 1100G boots, Mages have been capable of dealing true damage to squishies for years now.\n> \n> For comparison, The LOWEST base armor at 18 is Orianna with 68 Armor. With the exceptions of Thresh who has his passive and Gnar who has different values in Mini/Mega.\n> \n> So if we&amp;#039;re going to be fair about this, True Damage to squishies has existed for a very long time.\n> \n> Some food for thought.\n\nExcept for that entire duration until now, {{item:3105}} was a core support item built almost ever game that gave an aura of MR to all allies (I think the component had it, Locket had it for sure). So they wouldn't take true damage because allies gave them MR.\n\nAlso, most ADCs take flat MR glyphs. Smart ones took scaling MR glyphs unless against an AP lane bully (which was less common back then). 27 MR at level 18 from Glyphs helps cancel it out a lot too.\n\nFinally, a lot of items have crept in ({{item:3152}} {{item:3285}}) which introduced additional AP ratios to champion's kits which required the reduction of AP across the board because of the ridiculous damage output (not to mention masteries). \n\nThen finally, while ADCs were weak to mages they were supposed to be. Meanwhile any AD mid laner has always been able to buy a simple {{item:3155}} (and ADCs could buy it too) and suddenly become immune to being bursted. Fun for the mage.\n\nReally itemization-wise, Mages have had the short end of the stick in the AP v AD matchup. Mages get great unique items, but nothing specifically to make them unkillable while gaining the ability to kill their opponents. Even old 120AP {{item:3157}} wasn't enough since if you used the stasis for pretty much anything other than a Zed ult, you're just sitting there as a free target for their entire kit when you come out (in lane, late game it's a whole different story).","replies":[]},{"poster":"Arakadia","date":"2017-02-17T03:34:34.178+0000","up_votes":1,"down_votes":0,"body":"Not everyone brings flat magic pen runes.","replies":[{"poster":"Unreformed Shaco","date":"2017-02-17T03:35:44.353+0000","up_votes":2,"down_votes":0,"body":"Marks are standard cause no other mark is viable for ap mid.","replies":[]}]},{"poster":"idontgiveabother","date":"2017-02-17T03:14:45.596+0000","up_votes":3,"down_votes":1,"body":"But thats at level 1. Just gonna say that.","replies":[]}]}