{"poster":"Ser Cmax","date":"2015-03-06T15:34:25.258+0000","title":"ordine build Jayce","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"come da titolo volevo sapere da chi gioca Jayce da più tempo di me se dopo aver preso la goccia è meglio chiuderla subito nella manamune o se è meglio prendere un brutalizer, e successivamente in cosa chiuderlo . Per adesso sto partendo di {{item:2041}}  poi prendo la {{item:3070}}  la chiudo nella manamune, stivali e {{item:3134}} . Poi  {{item:3035}}  o se sono fiddato {{item:3072}}  e infine un oggetto difensivo a seconda di quello che mi serve e chiudo il brutalizer. La {{item:3071}}  è stata sostituita dalla {{item:3142}}  ma personalmente vedo la prima più utile su jayce, specialmente in late. Ditemi cosa ne pensate","replies":[{"poster":"SKFF1R SubZero","date":"2015-03-06T17:56:48.198+0000","up_votes":1,"down_votes":0,"body":"{{champion:126}} è stato il mio primo Top Laner all'incirca un anno e mezzo fa e lo so usare discretamente.\n\nIo parto di Crystalline + 2 pozioni della vita e 2 del mana (2 e 2 perchè, se aspetti circa 5 secondi in base, hai abbastanza per prendere una pozione extra e arrivare in lane senza perdere esperienza, soprattutto se usi continuamente la R per la Movement Speed Bonus)\n\nAl primo back, cerco di avere abbastanza per la Tear e per gli stivali base. \n\nAl secondo back, almeno chiudo gli Stivali (Ionian per la CDR che su Jayce sono ottimi) e ci buildo il Brutalizer se ho abbastanza.\n\nAl terzo back, chiudo la Muramana e chiudo la Cleaver. \n\nDa qui in poi, è tutto situational, in base a chi è feeddato o a cosa serve al team (Jayce Off-Tank non è malaccio con un Randuin e un Frozen Mallet oltre ai sopraddetti oggetti)\n\nQuando ho contro un AP TOP, mi piace iniziare di Tear e di prendere subito {{item:3155}} per la passiva dello scudo, per poi chiuderlo in {{item:3156}} all'incirca come 4° o 5° oggetto (4° se ci sono 3 AP, 5° se ce ne son 2 tra Mid e Top)\n\nSpero di aver risposto :D","replies":[{"poster":"Ser Cmax","date":"2015-03-06T19:55:24.205+0000","up_votes":1,"down_votes":0,"body":"una cosa che mi sono dimenticato di dire è che per adesso lo sto usando principalmente mid, è la lane in cui mi trovo più a mio agio :) le build coincidono e anche il trucchetto delle flask lo uso, ma in mid è più problematico dovendo fare una strada più breve :/ secondo te con che rune rende meglio ad o armorpen? Per adesso uso 3 quinte ad, marchi ad, gialle meta hpxlv e metà armor e poi mres sui glifi","replies":[{"poster":"SKFF1R SubZero","date":"2015-03-06T21:20:36.964+0000","up_votes":1,"down_votes":0,"body":"Ah, il cosiddetto Jayce full AD-Assassin :D\n\nDipende da chi hai contro in lane, almeno per come la vedo io. \n\nSe hai un mid fisico (Yasuo, Zed, Talon, ecc.), partire come dici tu va bene ma metterei full Armor sui Glifi pure.\nSe hai un mid magico (Ahri, Lissandra, Annie ecc.) metterei i glifi full magic res con anche magic res su metà dei seal.\n\nPer il resto, direi che vanno benissimo. \nL'ArmorPen non credo convenga semplicemente perchè buildi Black Cleaver e Last Whisper e in early, specialmente in mid, nessuno builda Armor come primo oggetto mentre le rune che puoi avere contro saranno al massimo 9 di Armor, e con 9 di Armor sono meglio 4 AD in più che 7 di Armor Pen :)","replies":[{"poster":"Ser Cmax","date":"2015-03-06T22:04:40.612+0000","up_votes":2,"down_votes":0,"body":"sono d'accordo con tutto, di armorpen ne hai abbastanza dagli item. Visti i suoi alti scaling ad se sto bene ancora prima del lastwisper ho anche provato a prende la blood e se riesci a chiuderla in fretta non riescono a fermarti se non con una catena di cc. Gran bel champ comunque","replies":[{"poster":"SKFF1R SubZero","date":"2015-03-06T22:51:30.049+0000","up_votes":1,"down_votes":0,"body":"Se vai top però l'ARMORPEN non è affatto male da avere, dato che contro Jayce i tank startano di tanta armor di base con le rune, attenzione!\n\nJayce è stato il mio primo TOP e me ne sono innamorato: ha 6 skill, è molto difficile usarlo bene ma ti riescono certe giocate.. \n\nTipo Q sulla rana, switch a martello e Q sulla rana per andare dall'altro lato per scappare da un gank magari. O magari metti il trinket e fai prima XD","replies":[]}]}]}]}]},{"poster":"I am her Weapon","date":"2015-03-07T14:50:42.369+0000","up_votes":1,"down_votes":0,"body":"Io ho giocato per un bel po' di tempo {{champion:126}}  top, mid è comunque viable e abbastanza forte.\nCome build la tua non sembra essere male, la tear va benissimo come first item e lo start di {{item:2041}}  è molto dipendente dal tuo playstyle.\nUn altro start potrebbe essere {{item:1055}} (+ pozza) per una lane molto più aggressiva nella quale sei sicuro di avere la FB.\nIl secondo item (prima o dopo la chiusura della tear dipende dai tuoi gold nel secondo back) è solitamente il {{item:3134}} che si può chiudere in {{item:3071}} o {{item:3142}}; \nLa mannaia viene usata specialmente contro i tank, il tuo team ti ringrazierà! ( w + meno armor per tutti alla velocità della luce = op). Se invece vai di ghostblade hai sicuramente più possibilità di gapclose su un nemico con molta mobility. Di norma si chiude come quarto item. \nCome terzo invece un {{item:3035}} è un'ottima scelta contro un team molto tankoso, non sottovalutare però la {{item:3072}} che è davvero molto utile soprattutto come sustain in lane per compensare la early tear. (se starti di doran e vuoi avere lo stesso sustain prendendo un LW allora ti consiglio un'altra early doran!)\nNon dimenticare l'{{item:3155}} se sei contro un heavy ap team o vedi che non riesci a sopportare il poke/burst dell'apc nemico.\nCome ultimo oggetto decidi tu che cosa fare, se concludere con un altro oggetto offensivo come l'{{item:3031}}  oppure se andare più sul difensivo con una {{item:3102}} o {{item:3026}} !\nLa build è comunque molto dipendente dal tuo playstyle masteries e rune, se ti servono altre info contattami pure in game !\nGl Hf in the summoner's rift!\n-ShastaMichGG","replies":[{"poster":"Ser Cmax","date":"2015-03-08T17:24:27.811+0000","up_votes":1,"down_votes":0,"body":"trovo che uno dei punti di forza di questo champ sia proprio la possibilità di variare la build in diversi modi a seconda di vari fattori ottenendo spesso ottimi risultati :) grazie dei consigli, in molte cose mi ritrovo con quanto detto con sanji992.","replies":[]}]}]}