{"poster":"Droglin","date":"2016-06-29T23:07:29.719+0000","title":"Tengo ping altisimo e inestable constantemente  y YA NO SE CUAL ES LA CAUSA","subforum":"Off-topic y temas personales","up_votes":1,"down_votes":0,"body":"Desde ya agradezco a quien responda a mi problema, para explicarles hace 4 meses que vengo teniendo lag inestable picos enormes etc, hice de todo para arreglarlo y no hay caso, mi pc se que no es el problema porque la probe en otros lugares con otro internet y anda perfecto.\r\nYo jugaba siempre por wifi en mi casa, antes andaba perfecto pero hasta hace poco no se que paso, tambien probe jugar conectado por cable, pero no hay caso. ya no se que hacer. mi proveedor de internet es solunet 3mb; suele andar bien por la ma&ntilde;ana hasta el medio dia y a la madrugada, pero despues todo el dia funciona mal. Hice de todo baje programas para arreglarlo, llame literalmente 11 veces a solunet para pedir una solucion pero lo unico que hacen es chamuyarte que te reinician el internet o no se que o te dicen que no pueden hacer nada al respecto. \r\nSi pueden darme la soluci&oacute;n a este problema se los agradeceria de coraz&oacute;n. Tambien cambie los servidores dns por los de google y open dns y no hay caso &iquest;Que hago gente? sera el router? sera la antena de afuera? no se :(","replies":[{"poster":"4GClaroARG","date":"2016-08-03T23:42:09.521+0000","up_votes":1,"down_votes":0,"body":"Es por que Solunet no es por cable es satelite, osea vas a tener siempre ping a la hora donde mas se usa","replies":[]},{"poster":"Grunge69","date":"2016-07-05T18:49:43.867+0000","up_votes":1,"down_votes":0,"body":"Yo tambien tengo un ping alto (200) a cualquier hora del dia, lo que es raro ya que solo en league of legends me va tan alto, en otros juegos como team fortress 2 o cs go me va bastante decente. (80-100)","replies":[]},{"poster":"Rolando Magic","date":"2016-06-29T23:13:21.230+0000","up_votes":1,"down_votes":0,"body":"Lo mas probable es que tu proveedor sea bastante malo","replies":[{"poster":"Droglin","date":"2016-06-29T23:20:48.479+0000","up_votes":1,"down_votes":0,"body":"pero o sea, en los celulares o netflix y esas cosas anda bien, tampoco es un problema de que haya muchos conectados a la red, vivo solo jaja","replies":[{"poster":"Rolando Magic","date":"2016-06-29T23:25:37.191+0000","up_votes":1,"down_votes":0,"body":"Pero por la conexion que hace desde tu casa hasta el srvr de Riot no debe ser la mejor, debe dar bastantes vueltas inecesarias","replies":[{"poster":"Droglin","date":"2016-06-30T00:09:13.531+0000","up_votes":1,"down_votes":0,"body":"pero si antes  me andaba perfecto, no se que onda","replies":[{"poster":"Rolando Magic","date":"2016-06-30T00:14:15.124+0000","up_votes":1,"down_votes":0,"body":"Proba mandar un ticket al soporte y ver que te dicen","replies":[{"poster":"Droglin","date":"2016-06-30T02:12:21.912+0000","up_votes":1,"down_votes":0,"body":"Que seria un ticket?","replies":[{"poster":"Rolando Magic","date":"2016-06-30T05:58:46.779+0000","up_votes":1,"down_votes":0,"body":"Es mandar una peticion al soporte, para que traten de solucionar o ayudarte a solucionar el problema\nTe dejo un post de como hacer mandar uno  http://boards.las.leagueoflegends.com/es/c/guias-y-consejos/ku4F2JEP-tutorial-camo-mandar-ticket-a-soporte","replies":[]}]}]}]}]}]}]},{"poster":"Exit","date":"2016-06-30T00:28:47.281+0000","up_votes":1,"down_votes":0,"body":"que raro yo tengo 30 ms y soy de arg jaja es tu inet","replies":[]}]}