{"poster":"im ICEMAN","date":"2018-06-20T17:52:48.830+0000","title":"Game Logs (SCIENCE EXPERIMENT) Ft. Seras Dragon    -     Participants Needed","subforum":"Player Behaviour","embed":{"description":"Keep in mind that I probably encounter blatant toxicity and/or griefers 8/10 games and /mute all 80% of those games as soon as I get an inclination.","url":"https://boards.oce.leagueoflegends.com/en/c/player-behaviour/s6TjXJqk-chat-log-review-request-yikes","image":"https://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":2,"down_votes":0,"body":"**INTRODUCTION**\n\nOne of the Emissarys Seras Dragon suggested I start a Game Log, recording my behaviour and the behaviour others after each game.\n\n**I would like to extend the invitation to others as without more data this trend of around 70% toxicity is just anecdotal**\n> I would challenge you to keep an active log of every game and to mark each game with at least a 0-10, 0 being noone trolled or was toxic and 10 being everyone did (yes I think you should include yourself). Bear in mind than when I say trolling I mean actual trolling not just \"he made a different call than me and I dont like that\".\n>  \n> Negativity bias is a powerful force, and while some players will be luckier than others due to rank bracket, times of play, premade size and so on, 80% is a huge number. In fact I would argue that if 80% of your games were that bad you wouldnt still be playing, nor would you have a near 50% winrate.\n\n\n**METHOD**\n\nRecord the behaviours of self and others in the game after every match in a text document, record the date at the start of each play session along with the position and champion played. \n\n**RESULTS**\n\n>19/6 12 pm\n> \n>1. lucian adc (6): Support called jungle some chinese swarewords and typed &quot;ok&quot; after every mistake a team matemade. Jungle responded with a questionmark to the insult only. Rest was fine. I type some basic stuff about about faking a leash because jg was starting top then nothing else all match.\n> \n>2. Soraka support (7): ADC ended the game 0/7/1 after instalocking in champ select, top lanner flamed him for feeding but then carried regardless. I typed some basic calls this game and followed top around after we lost first tower.\n> \n>3. Blitz support (6): ADC called the jungler a %%%% at first buff. Top lanner flaming ADC and jungler for not \"Following up\" despite tping to a forward location that initiated the fight while the accused were at base. I dont type this game.\n> \n>4. Rakan support (8): Mid Yasuo finds himself in a 1v4 at dragon and dies, calls bot lane \"chaonima\" and \"trash\" for \"not looking at thier map\". Also tells top hes a feeder, top argues with him in Chinese. Top complains that adc Brand is a troll and is inting. Rengar jungle (diamond) doesnt talk and neither do I. \n> \n>5. Rakan support (7): extremely toxic mid fizz who was having a bad game(6/15/7), used alot of chinese sware words. I got told \"sb\" multiple times&quot;. Fizz told irelia that she was playing an OP champion and was bad for not carrying. Our diamond jungler was nice, I didnt type.\n> \n>6. Rakan Support (7): Yasuo mid lane flammed top for not coming to a fight for about 2-3 mins. ADC Ashe tried really hard but mid kept flaming her about building onhit instead of crit. I typed once at the end of the game to Ashe \"build is fine you went lethal tempo so onhit seems good. Crit is expensive and slow to first spike now and team was behind so bork being the cheaper build path makes sense\".\n> \n>7. Pyke support (6): Jungle graves wasnt having a good game, flamed me for missing a pyke hook on a gank saying \"sb\" then some other chinese i didnt understand. Played with a duo mid laner this game who I roamed and carried with. Didnt type as mid and I were on coms.\n> \n>8. Pyke support (4): Got an s+ on pyke but whole team was premade, didnt speak english and would gang up and spam me with questionmark pings when a fight went bad. I think this is potentialy why I didnt get any honour (I didnt type once).\n> \n>9. Twitch adc (9): support lost call on top lane, went teemo support and intentionally fed. I typed in chat that teemo was feeding intentionally. Top agreed with me but flamed support and jungle and mid flamed top and I (\"called me chao ni ma\"). I typed in all chat at one point to ask the enemy to pitch in for a report after the game (I assumed mid jg and sup were premade). Enemy zed mid called me a \"trash white pig\" and told me I was being reported. I had to mute all  at this point because otherwise I would reply. \n> \n>10. Alistar Support (2): didnt play too great but game was slow so was able to type positive encouragement to team (died typing once and got flamed for typing positive stuff by adc)\n> \n>21/06  1am\n> \n>11. Pyke support (9): Top lanner had a bad game and when jg started calling her out for it they decided to just run down the lane back to back 6-8 times. Mid Rage quit after dying to his lanner 6 times back to back. I typed something like &quot;dont stress yasuo we can still win, youre doing fine&quot; Jungler mocked me for it. \n> \n>12. Pyke support (0): Filled into a 4 man premade that was chill and I typed a lot this game mostly just banter with mid and adc who were premade\n> \n>13. Pyke support (4): ADC yasuo had a very bad game, died 18 times. No1 complained in English but there was an argument in Chinese (Yasuo typed &quot;Chaonima&quot; which i think is bad). Only reason I wasnt flamed (and the jungler was) I think, was because I was playing much better then the yasuo (who was playing very poorly) but the jungler hadn&#039;t ganked. I just roamed with the jungler after this who ended the game 17/5/14, I ended the game 12/2/14 and top ended the game 23/13/8.  (I didn&#039;t type at all this game)\n> \n>14. Xayah adc (8): Jungler died early and copped some flame from top for &quot;ruining his lane&quot; Jungler then died in every lane before heading top and dying 3 more times (I think it was intentional, but he never admitted it in chat). Only positive thing in chat that happened all game was support and top complimented me when I got a 1v4 quad when the mid and jg came to dive me. This actually really pissed me off, I shouldnt have been in the situation to get dove 1v4 and feel like I gave them validation to try it themselves in their next ranked game (I didnt type anything in chat this game).\n>Top 0/5/0, mid 2/5/0, jg 0/6/2, sup 1/6/2. adc (me) 6/2/0 surrendered at 15\n\n\n**CONCLUSION**\n\n1. 10/14 games were above a 5 in toxicity  \n2. Good players didnt type\n3. Not typing didnt stop griefing\n4. Typing compliments that were up building stopped toxicity but didnt improve game play. \n5. A lot of toxicity was in Chinese due to the majority of team mates being Chinese\n\n**DISCUSSION**\n\n>Negativity bias is a powerful force, and while some players will be luckier than others due to rank bracket, times of play, premade size and so on, 80% is a huge number. In fact I would argue that if 80% of your games were that bad you wouldn&#039;t still be playing, nor would you have a near 50% winrate.\n\nIt appears that there was as Seras Dragon predicted, negativity bias in my hypothesised 80% toxicity which was interesting to disprove. Only 71.4% of my games contained toxicity however my sample size of 14 games was small and not all of my games were solo que. \n\n>I would argue that if 80% of your games were that bad you wouldn&#039;t still be playing, nor would you have a near 50% winrate.\n\nIm going to take a break of league and play Rainbow 6 Siege instead, I had plans to climb to plat this uni break (4 weeks) but will put this on hold given the events of the past week (the account I wanted to play on got chat restricted (appears to be a mistake given the provided logs) and the support ticket page still wont work for me despite trying all the work arounds.\n\nI would however argue that my win rate is due to me recently one tricking a hard carry ADC during a patch where they were the strongest role. (And spending twice as much out of game time reviewing vods and being coached)\nMy almost 5 KDA, 70% winrate one tricking Twitch adc or Jg (it was 80% for about 40 games) is probably what got me a decent winrate. I found recently that typing positive comments reduced toxicity but also made me play worse, lowering my API considerably. Required me to not mute chat and become mentally affected by how others were behaving.\n\n\n**More participants are needed in order for any conclusions to be drawn as this study as it stands is purely anecdotal.**\n\n**If anyone has results of their own I would be interesting to see (please post in a reply)**","replies":[{"poster":"Exarch Leona","date":"2018-06-23T01:37:05.238+0000","up_votes":1,"down_votes":0,"body":"Seras Dragons probs the worst person to give evidence about toxicity to to be honest.\nDude doesn't play.","replies":[{"poster":"Ninox","date":"2018-06-23T01:40:24.647+0000","up_votes":1,"down_votes":1,"body":"Heaven forbid I have a job or a life lol. League isn't the only game I play. \n\nBesides, I didn't suggest it so he could give the evidence to me, that was entirely not the point. The point was for them to find some perspective since noone can convince them to consider changing their perspective except themselves. What they choose to take from the experiment is entirely up to them.","replies":[]}]},{"poster":"talknerdytome","date":"2018-06-20T19:18:24.618+0000","up_votes":1,"down_votes":0,"body":"good idea but way too much effort","replies":[]}]}