{"poster":"EpicDieterBohlen","date":"2015-07-22T16:04:30.737+0000","title":"Altes HUD","subforum":"Champions & Gameplay","up_votes":3,"down_votes":5,"body":"Ich mag das neue HUD wirklich &uuml;berhaupt nicht, ich hab schon versucht damit klar zu kommen aber ich kann es gibt einfach zu viele informationen die so schlecht aufgeteilt sind... und die ganzen anderen symbole. und wenn man einen skill ready bekommt denkt man, dass man oom ist weil es so blau blinkt....\r\nBitte gebt uns die m&ouml;glichkeit das alte HUD benutzen zu k&ouml;nnen.","replies":[{"poster":"Leeerzeichen","date":"2015-07-22T16:32:08.336+0000","up_votes":2,"down_votes":2,"body":"Kommt nicht. Haben sie schon ca. 1000 mal gesagt während es auf dem PBE war","replies":[{"poster":"EpicDieterBohlen","date":"2015-07-22T17:01:47.057+0000","up_votes":1,"down_votes":2,"body":"eben genau darüber sollte sich riot mal gedangen machen...","replies":[{"poster":"Leeerzeichen","date":"2015-07-22T18:14:01.673+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=DemoH4ck,realm=EUW,application-id=Wj1wcocU,discussion-id=22ia5rzi,comment-id=00000000,timestamp=2015-07-22T17:01:47.057+0000)\n>\n> eben genau darüber sollte sich riot mal gedangen machen...\n\nGründe warum sie es nicht tun werden:\n-unfaire Spielvorteile, weil sich beide Huds von den Features unterscheiden\n-doppelte Wartung\n-verhinderung von Features die das neure Hud benötigen","replies":[{"poster":"EpicDieterBohlen","date":"2015-07-22T18:17:26.946+0000","up_votes":2,"down_votes":0,"body":"warum spielvorteile? jeder spieler kann das hud nehmen was ihm am besten liegt. da gibt es rein gar keinen vorteil.\ndoppelte wartung? es würde einfach einen reiter für \"altes und neues hud \" geben. \ninwiefern werden die features verhindert? blödsinn","replies":[{"poster":"Leeerzeichen","date":"2015-07-22T19:10:19.702+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DemoH4ck,realm=EUW,application-id=Wj1wcocU,discussion-id=22ia5rzi,comment-id=0000000000000000,timestamp=2015-07-22T18:17:26.946+0000)\n>\n> warum spielvorteile? jeder spieler kann das hud nehmen was ihm am besten liegt. da gibt es rein gar keinen vorteil.\n> doppelte wartung? es würde einfach einen reiter für \"altes und neues hud \" geben. \n> inwiefern werden die features verhindert? blödsinn\n\nz.B zeigt das Neue Hud den Cooldown von sums + ults ==> spieler mit dem alten Hud haben einen Nachteil\nUnd was ändert ein Reiter daran dass beide Huds gewartet werden müssen?\nNein, kein Blödsinn. Wenn man Sachen neu programmiert, ändert man immer die Sachen, die einen Vorher gestört haben. z.B könnte im alten hud die zahl der skills auf 4 festglegt sein, während sie beim neuen variable ist.","replies":[]}]}]}]}]},{"poster":"Cuté Ventus","date":"2015-07-22T17:48:05.746+0000","up_votes":2,"down_votes":0,"body":"Habe es auch ausprobiert.. :/ Ich kann leider nicht mehr so toll sehen, da fällt es mir schwer dort was zu erkennen, alles ist so eng aneinander und minimal gehalten.  Habe nach ~30 Minuten Kopfschmerzen bekommen deswegen.   :(","replies":[]},{"poster":"MeDontEnglish","date":"2015-07-22T17:22:16.725+0000","up_votes":2,"down_votes":0,"body":"Das HUD ist ja auch noch nicht perfekt, logisch, was ist das schon am Anfang?\n\nGebt Riot doch mal Zeit, sie werden bestimmt auf einige Wünsche eingehen und das HUD wird noch einige Änderungen erfahren.\n\nIch persönlich habe mich schon nach 2 Spielen daran gewöhnt das die Inventarseite jetzt rechts ist... alles eine Gewöhnungssache!\n\nDie meisten meckern wenn was neues kommt, aber was neues ist was gutes - wenn man ihm auch eine Chance gibt!","replies":[]},{"poster":"13900IPForRem","date":"2015-07-22T16:36:20.691+0000","up_votes":2,"down_votes":1,"body":"Wie sich 95% der Spieler drüber aufregen.\nHabt ihr bei der neuen Summoners Rift auch gemacht und jetzt spielt sie jeder ohne zu nörgeln.","replies":[{"poster":"EpicDieterBohlen","date":"2015-07-22T16:38:28.079+0000","up_votes":2,"down_votes":1,"body":"über das neue rift haben sich so gut wie alle gefreut lel. das einzige wo genau so genörgelt wurde war bei der alten 3v3 map :P.\nich finde das neue hud einfach nicht schön. die namen der spieler kann man nicht lesen und alles ist so eng zusammengequetscht :(","replies":[]}]},{"poster":"Schlossknacker","date":"2015-07-22T23:11:40.993+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Hamrio,realm=EUW,application-id=YnZkMR0R,discussion-id=zV1vbZ9q,comment-id=0002,timestamp=2015-07-22T15:39:12.385+0000)\n>\n> wenn dich das HUD stört dann nimm etwas edding und schmier das alte auf deinen bildschirm","replies":[]},{"poster":"Schlossknacker","date":"2015-07-22T22:53:01.226+0000","up_votes":1,"down_votes":1,"body":"Srsly es nervt. Dann leavt doch LoL. Fakt ist das das neue HUD effizienter ist, und mehr Informationen gibt. Wie schon gesagt, gibt dem Zeit, Riot wird das noch besser machen!","replies":[]},{"poster":"Tigerkralle99","date":"2015-07-22T16:44:50.347+0000","up_votes":1,"down_votes":2,"body":"Da gib ich DemoH4ck voll und ganz recht, das neue hud ist fürn arsch und roit verliert nur spieler. Ich und viele andere werden bis es ein mod gibt was das alte hud wieder bringt, oder bis roit es wieder bring nicht mehr spielen. guckt einfach in den forum, hab so (auch anderssprachig) 30-40 einträge gefunden, und das sind nur die die sich dazu äusern, wieviele sich nicht äusern und nicht mehr spielen ist die frage.\n\nLeague of Legends broken","replies":[{"poster":"NG Drakuboy","date":"2015-07-22T17:50:58.152+0000","up_votes":1,"down_votes":1,"body":"Riot würde noch mehr Spieler verlieren wenn sie 20 Jahre lang die selbe Grafik hätten. Tschüss","replies":[]},{"poster":"XIII BTLmovies","date":"2015-07-22T17:19:34.278+0000","up_votes":1,"down_votes":1,"body":"Dann tschüss. Willst du ernsthaft erwarten dass du Riot damit umstimmen kannst?\nWie Hamrio gesagt hat, gewöhnt euch erstmal dran.\nDas ist jetzt erst 10h draußen und schon wieder nörgeln alle.\nMan muss sich damit erstmal auseinander setzen, wo alles ist.\nDer Aufbau vom HUD ist eben komplett anderser, nicht wie bei der Summoners Rift, wo vom Prinzip alles gleich ist.\nDu bekommst zudem alles auf EINEN BLICK!\nDu musst eh ganze Zeit zur Karte schauen, deswegen ist alles in Kartennähe.\nZudem durch \"C\" bekommst du viel mehr Sachen angezeigt als früher.\nMan muss sich reinfinden, die Symbole sich merken und eben merken welches geräusch für was war.\nGewöhnungssache.\nErstmal 2 Wochen damit spielen, ein Jahr spielen und dann nochmal schreiben.\n\nAls ich angefangen habe, war für mich auch alles neu, ich habe alles mit allem verwechselt, aber habe mich dran gewöhnt.\n","replies":[]}]},{"poster":"Hamrio","date":"2015-07-22T16:43:54.453+0000","up_votes":2,"down_votes":2,"body":"Junge gib dem ding zeit man muss sich an alles gewöhnen da ist grad mal 10h draußen","replies":[]}]}