{"poster":"Buckarooz","date":"2016-08-29T21:19:33.867+0000","title":"How Yorick Summons Ghouls","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"Hi all I had a few thoughts about the new Yorick rework and how he summons his ghouls.  I don&#039;t have a PBE account so of course I haven&#039;t actually played him but have played a considerable amount on his soon to be replaced live version.  Watching and reading a lot of the feedback and opinions specifically about his Q ability and the mist walker&#039;s I had a comment and suggestion.\r\n\r\nComment:\r\nFirst that I can agree with many of those that have given negative feedback towards the challenge of summoning the ghouls and their functionality.  I personally don&#039;t see their &quot;AI&quot; level to be a problem but just how much work you have to go to in order to get your ghouls.  Early lane phase seems okay but still his reliance on having a minion wave present and having the time to last hit 3 minions to get his ghouls going seems a little much.  Especially as a he is intended to be a top lane champion it seems to me that unless he is L6 with his ult up his teleport/team support value is very minimal.  Just too much work for an only localized power presence.\r\n\r\nSo I thought that a little tweak to the method of his ghoul summons would balance out a lot of the issues.  It most likely has been considered but maybe not so here goes.\r\n\r\nSuggestion:\r\nQ Ability - Last hitting would instead general a &quot;Soul Charge&quot; for Yorick.  He would still need to generate at least 3 charges before summoning ghouls.  Just as it currently is Yorick would need to put his Q on CD first (Which in the current PBE state as I have observed you don&#039;t actually have to hit anything with it you can just Q and then Q again if there are enough graves nearby to then summon your ghouls) then the second use of his Q would cause him to &quot;Dig up three Or more graves&quot; to summon his mist walkers.\r\n\r\nAnimation - Already exists from his backing animation he sticks his shovel straight into the ground, he could do that and then when he pulls it out, up pop your graves and the minions crawl out.\r\n\r\nWhy - Well it would give Yorick an easier way of re-locating with his minions.  Yes his ult does the instant summon too but that can conceivably be on an incredibly long CD if she isn&#039;t killed right away.  Then when it is on CD he has a lot of work to do only when an enemy minion wave/jg camp is available.  So balance the power give him mobile summon of the mist walkers and take away the instant summon mistwalkers currently on his ult so it summons the maiden.  She should still be able to summon additional ghouls like she does but only after she shows up.\r\n\r\nRe-cap\r\n1) It seems like a fair balance as he still has to go through the last hitting process to generate his charges so he can&#039;t just completely swarm you with minions all the time, and it&#039;s not a plain instant minion dump.\r\n2) They still would be coming in waves giving him power highs/lows.  Giving enemy champs the flow of combat that is more fun.\r\n3) If you add a character animation similar to Aurelian Sol or Dr. Mundo&#039;s based on how many souls he has stacked will let opposing players decide how they want to counter play Yorick when he shows up, 3 or more souls...maybe not charge him, call for back up.\r\n4) Gives him more roaming ability and more of the I&#039;m a grave digging summoner feel.  (Currently doesn&#039;t do any digging...)\r\n5) I think the additional power of moving and summoning the mist walkers where Yorick wants to summon them would relieve some of their current lack of effectiveness of the mist walkers as reported by many summoners.  They may be weak but now they are a whole lot more functional and Yorick doesn&#039;t have to camp his butt in a minion wave or hope everyone leaves him alone with a JG camp long enough to summon up his minions.  He can kill one here, kill a few there, and then summon minions where and when he needs them.\r\n6) Gives you probably an easier way to give more value to killing a lesser minion/cannon minion/large JG monster/Champion/Drag/Etc.\r\n\r\nAgain don&#039;t have any way of sharing on the PBE discussion and I haven&#039;t yet played the new yorick but am really looking forward to it.  But just from observation it does look like he has very long windows where he is just a dude with a shovel and way to easy/desirable to just walk somewhere else an push a different objective leaving him at a big disadvantage.  So hopefully this thought makes it&#039;s way over to RiotSolcrushed, thanks for reading.","replies":[{"poster":"Oleandervine","date":"2016-08-29T21:33:48.660+0000","up_votes":1,"down_votes":0,"body":"Also, he doesn't solely rely on last hitting to spawn graves. They naturally spawn every couple of deaths nearby him.","replies":[]},{"poster":"MagicFlyingLlama","date":"2016-08-29T21:31:33.941+0000","up_votes":1,"down_votes":0,"body":"The whole point is he is not meant to teleport into a fight and wreck everyone. He puts constant, heavy pressure on one, or with his ult, possibly two, lanes. His team may be fighting a 4v5, but the other team just lost two towers.\nAlternatively, they have to spare two people to deal with him pushing one lane while a zz'rot and maiden of the mists pushes the other.","replies":[]}]}