{"poster":"ApathyAndGrief","date":"2019-03-25T21:42:43.380+0000","title":"League Of Legends is NOT an anime","subforum":"Rant","up_votes":1,"down_votes":0,"body":"I've been noticing a severe cater to the people who watch/read anime and manga. And this cater is very biased and unfair to the people who genuinely enjoy the original fantasy that this game provides, only for Riot to be dishing out all this weeb crap. League Of Legends in itself is not a freaking anime gameplay wise and lore wise. \n\nLet's start with the skins, OH BOY, the skins.\n\nIf you've noticed all the \"Waifus\" ({{champion:103}} {{champion:28}} {{champion:99}} {{champion:222}} ) or \"Edgy self-insert anime protags\" ({{champion:157}} {{champion:238}} {{champion:81}}) have been getting a large influx of skins recently, meanwhile the actual interesting characters (Which I'll get to) get hardly any attention at all.\n\nIn a business perspective, catering to the anime fandom or whatever is a really good marketing pratice, but it gets to point where you wonder; is this even the identity of the game we once knew? What happened to our design value, or any passion for our game? You can't freaking tell me all of your \"Creative\" ideas are for {{champion:103}} and {{champion:99}} all the freaking time! That's bullcrap! \n\nAs for lore, let's address the elephant in the room\n\nTHERE IS A CLEAR BIAS FOR IONIA\n\nEvery year Riot NEVER, almost NEVER fails to make some sort of addition to Ionia or put all of their efforts on Ionian lore. They try to tell us \"Oh, Noxus is deep and not evil!\" but then always portray them as Villains anyways. They have a clear favoritism on this generic nation over everyone else and it's stupid! \n\n\"Noxus isn't evil, they just do things that are a bit extreme.\" \n\nThen they PROCEED TO MAKE EVERYONE FROM IONIA THE \"HEROES\" AGAINST THE NOXIAN INVASION IN THE AWAKEN CINEMATIC, PORTRAYING THEM AS BAD GUYS BECAUSE HAVING ANY POLITICAL GAIN = BAD GUYS NOW\n\nShurima, despite how interesting they are, never get ANYTHING new.\n\nNo one gives a crap about whats going on in the Shadow Isles anymore.\n\nDemacia is the typical \"Hurr durr we good guys but also xenophobes against magic\" \n\nFreljord hasn't been relevant since, ever.\n\nPiltover and Zaun lost their significance after 2014 passed. \n\nSeriously, whens the last time Riot's put out content about THE INTERESTING CHARACTERS? {{champion:202}} {{champion:122}} {{champion:50}} {{champion:555}} {{champion:268}} {{champion:83}} {{champion:136}} WHEN HAVE THESE GUYS EVER GOTTEN SOMETHNG ACTUALLY RECENT AFTER THEIR RELEASES AND REWORKS?\n\nLast thing: The Gameplay\n\nLeague\n\nIs\n\nNot\n\nAn\n\nAnime\n\nIt's a team game. You're not the protagonist who gets to hyper carry the game all the time. You don't have bullshit plot armor. You don't get the girl in the end. There is no \"Secret power/transformation\" within. It's a moba. League requires patience, teamwork, and long endurance. You're not special because you main Irelia/Master Yi/Lee sin or whatever. You're not the main character. The team doesn't revolve around you. The game doesn't revolve around you. \n\nLeague is not an Anime.","replies":[{"poster":"SilverStorm53","date":"2019-03-28T03:13:00.565+0000","up_votes":1,"down_votes":0,"body":"Uh...Rito is a BUSINESS WITH PAID EMPLOYEES, if anime like skins and whatnot reap the most revenue, OF FREAKING COURSE THEYRE GOING TO GO THAT ROUTE. Quite frankly, majority vote wins. Not everyone will be happy with ideas they dish out, so, as a business should, they try to please AS MANY PEOPLE AS THEY CAN. \n\nJust like you mentioned, League is a team game that \"doesnt revolve around you\". \n\nIm sorry if you do not like the anime like themes, but so far, majority of league players do. \n\nBut I agree theyre definitely overlooking some things, but I do happen to love their anime like themes, so I cant completely agree with your rant.","replies":[]},{"poster":"xDogMeatx","date":"2019-03-26T00:45:27.709+0000","up_votes":1,"down_votes":0,"body":"actually noxians are not evil innately they have saying like \" the powerful must rule over all\"  therefore has a theme in their kit of overpowering their enemies either by raw power or sustain. while ionians have a saying like \"precision over brute force\" which is outplay chances or agility. i can explain more on themeatic powers if you wish.","replies":[]}]}