{"poster":"Shovel","date":"2018-07-22T23:53:46.218+0000","title":"Help with permanent ban.","subforum":"Player Behaviour","up_votes":3,"down_votes":2,"body":"Since I was probably a bit overly emotional and abrasive when I first posted the last thread seems to have been removed! So ill try again :)\n\nLast night in my promos to platinum I was playing ezreal and was SUPPOSED to be laning with a zilean support, I decided to take teleport instead of heal this game for the laning phase! However when we got to lane as soon as the first waves hit each other the enemy bottom lane (alistar and ashe) walked up to my support ali flashed on him stunned him and thennnnn they killed him. Now once this happened the zilean started spamming my teleport in chat over and over (even though like i said they flashed on him so the fight was behind our wave and close to our turret so he could have flashed away himself to live! he also did not use his exhaust!) he then proceeded to continue spam pinging my summoner spell, come back to lane and begin to use his abilities on the wave taking farm and intentionally feeding the enemy team :) then came the following!\n\nJUST FOR CLARITY THIS PLAYER DIED STARTED SPAM PINGING ME AND STARTED ACTIVELY TROLLING BEFORE ANY OF THE FOLLOWING WAS SAID IN CHAT.\n\nGame 1\nIn-Game\nShovel: ?\nShovel: if ziean will troll\nShovel: ill just afk\nShovel: this kid is taking my cs because he died lv 1\nShovel: enjoy free win\nShovel: report zilean ff 15\nShovel: yer\nShovel: tp is standard\nShovel: u silver trash\nShovel: hes taking cs\nShovel: and inting\nShovel: i cant play\nShovel: killk him pls\nShovel: its my promos too\nShovel: i CANT PLAY\nShovel: HE IS TAKING FARM\nShovel: WTF U WANT ME TO DO\nShovel: ?\nShovel: wow\nShovel: %%%%s are dense on this game\nShovel: hes pushing\nShovel: the wave\nShovel: ..\nShovel: yer\nShovel: im cancer\nShovel: because hes trollng\nShovel: holy shit this server\nShovel: hes bronze\nShovel: just kill zil lol\nShovel: hes trolling because i have tp\nShovel: ??????????????????????????????????????????????????\nShovel: WOOOOOOOOOOOOOOOOOOOW\nShovel: hes actual bronze\nShovel: like\nShovel: legit\nShovel: inted lvl 1\nShovel: then trolled\nShovel: the whole game\nShovel: m8\nShovel: ur a joke\nShovel: how the fuck\nShovel: am i a kid\nShovel: ?\nShovel: like how\nShovel: explain what i did wrong\nShovel: explain how im the kid\nShovel: when did i say i dont want to win\nShovel: im literally trying to win\nShovel: how did i give up\nShovel: ?\nShovel: im playing?\nShovel: because he just lets them kill me\nShovel: if i go into lane\nShovel: yer ok pantheon\nShovel: hope u get this zil on ur team\nShovel: :)\nShovel: yasuo\nShovel: its these asians\nShovel: they full racist\nShovel: dont care if they hard int\nShovel: just blame anybody who isnt asian\nShovel: rly sad\nShovel: duo with z ilean taliyah\nPost-Game\nShovel: yoo\nShovel: piss off\nShovel: loser\n\nNow before anybody starts saying \"Shovel: %%%%s are dense on this game\" was a racist comment no it was C**TS now i dont deny that i shouldnt have said the word (even though you have a language filter built into the game that is enabled by default...........................) but i was, in my opinion understandably frustrated. This player decided to troll from the TWO MINUTE MARK because he didnt like my summoner spell choice and misplayed and died at level one in my promos which as we all know can be quite stressful :) He flamed me, continued the whole game to spam ping my teleport and run it down bot lane feeding and taking cs. I was unable to lane because if i walked into lane he would walk up with me then just back off and leave me 2v1 or bomb the wave and proceed to run away :) SO then the taliyah and pantheon on my team began to flame me too (not the inting guy who had a tantrum over literally nothing for whatever reason i can only assume they are friends of his) if a RIOT employee checks what the other players in the game were saying and how they were behaving towards ME it will perhaps give some context to my chat log (the yasuo on my team even states in chat while they are flaming me that its clearly the zilean and not me who is ruining the game) \n\nNow im not trying to exscuse my behavior YES i took the bait and was toxic in chat as well, but it was REALLY frustrating as i was trying reallllly hard this weekend to promote to platinum if you take a look at my match history here https://matchhistory.oce.leagueoflegends.com/en/#match-history/OC1/200467320 you will see i had been trying really hard the last couple of days! you will also see the game in question where i was playing ezreal and my \"support\" finishes the game 0 - 6 - 0 with 130 cs. I would really like if a red could at least take a LOOK at my account and the game in question because i have been trying my HARDEST to reform (a couple of games before this i even recieved notification that i had reached a checkpoint to gaining my honor back which as people know isnt the easiest) so yes i was toxic in chat but so were the group of 3 friends? one of which literally intentionally fed and ruined the game because of my summoner spell choice and his OWN misplay. I love this game and my account meant alot to me it took me alot of work to get to my rank and while it isnt the highest i was proud of it. I feel that this ban was unfair and that these players abused the system to get me banned please at least take a look into my account riot i was trying my absolute best to reform and was receiveing honor almost EVERY single game.\n\nI was told by another player on these boards that the rioter gehirn might be able to take a look at my case.\n\n","replies":[{"poster":"Project Xayah","date":"2018-07-23T01:05:26.220+0000","up_votes":4,"down_votes":1,"body":"You would have received a punishment for sure based on the logs provided. While there is one racist comment, that's typically not enough to cause a full escalation, and certainly not to a perma-ban. Whether that punishment should be a perma-ban would depend whether you have previously received a 14-day ban (at the very least, 25 game chat restriction).\n\nAs for appealing the punishment, you will need to submit a ticket to [Support](https://support.riotgames.com/hc/en-us/requests/new) (choose the option \"I have a question about a suspension or restriction on my account\") and deal with the process with them (I feel like I should warn you to not expect them to change anything, considering).\n\nI think it's important to note at this point that when I was constructing this post your previous thread regarding this topic was still showing for me and I had time to take a look at it. Don't know why it \"persisted\" so long for me, however.\n\n> I was told by another player on these boards that the rioter gehirn might be able to take a look at my case.\n\nI'm going to be very clear here, the Rioter's themselves wont look at this case. They will *only* deal with cases that legitimately look like false positives (which are *extremely* rare) and that Support don't handle properly, and, quite frankly, it's clear that this should have resulted in *some* punishment (as I said before, which punishment may be up for debate). I don't know who's gone and told you that you should request one of the Rioter's personally look it over (couldn't find any such comment directed at you based on your posting history), but it seems they obviously don't know what they're talking about in this case.","replies":[{"poster":"Shovel","date":"2018-07-23T01:16:24.610+0000","up_votes":1,"down_votes":4,"body":"Ok well i understand that the way i behaved was wrong ALSO but is context just completely ignored? that seems really unfair like i said i was recieving honor almost every. single. game up until this point even reaching checkpoints to regain my honor. This player had a tantrum and just trolled and intentionally fed and thats ok? but i react and i get permanently banned? yes i took the bait but thats just it? somebody does something and i react badly ONE TIME after trying my best to reform and thats just it? \n\nCan you please point out the racist part of my chat log for me no you cant because there was no racism (if you come back and try to tell me saying \"these asians\" is RACISM i will laugh in your face) as far as bans being over turned and you for whatever reason trying to act smug and say that this other person doesnt know what they are talking about well they do because the rioter did. it was a similar case and the person WAS unbanned. whether i will be or not is not for you to say. you also dont work for riot so you wouldnt know anything and i see spend all your time on these boards basically laughing at people for being banned you seem like a real class act.","replies":[{"poster":"Project Xayah","date":"2018-07-23T05:19:24.732+0000","up_votes":3,"down_votes":1,"body":"> is context just completely ignored?\n\nIt's important to note that you will be judged on your own behaviour, not the behaviour of others. You may call it \"context\", but really it's not that relevant to the fact that *you* did the wrong thing.\n\n> This player had a tantrum and just trolled and intentionally fed and thats ok?\n\nNo. Why would you think it's ok? Just because it happened?\n\nBottom line is that harassment and abuse aren't tolerated, whether you're the instigator or retaliator.\n\n> Can you please point out the racist part of my chat log for me\n\nSure:\n> Shovel: its these asians\nShovel: they full racist\n\nYou've basically just implied that Asians in general are racist with these comments, which *is* racist in itself, believe it or not. That said, it's only *one* instance so it shouldn't cause any escalation to occur.\n\n> as far as bans being over turned and you for whatever reason trying to act smug and say that this other person doesnt know what they are talking about well they do because the rioter did. it was a similar case and the person WAS unbanned. whether i will be or not is not for you to say. you also dont work for riot so you wouldnt know anything and i see spend all your time on these boards basically laughing at people for being banned you seem like a real class act.\n\nI feel it's relevant to point out that I spend about 6 months as a volunteer, dealing with a *lot* of players coming onto the boards with ban appeals. In that time, there were maybe one or two cases that actually got referred to a Rioter, and that was *after* the player had dealt with Support. As someone who has spent *plenty* of time dealing with this kind of stuff, and has *plenty* of experience regarding it and a thorough understand of how Riot's systems work, I can confidently say, with 100% certainty, that you wont end up even getting your case forwarded to any Rioters. I'm not \"trying to act smug\", it's just a simple fact.\n\nSo far as your chat logs go, you've exhibited a constant negative attitude, thrown around several insults (including the one I just pointed out could be considered racist) and threatened to afk just because of a bad situation (regardless of whether you followed through). As I have already told you, these logs indicate that you *should* have received a punishment of some kind, but without further information on previous punishments you have/haven't received I can't say, with *any* certainty, which punishment seems appropriate. That's something you'll have to take up with Support (as I directed you to do earlier), unless you're willing to discuss that further here by providing the relevant information.\n\nNow, you can sit there and act all smug by \"calling me out\" for my supposed \"laughing at people for being banned\" but the bottom line is that I know a *lot* more about all of this stuff, in regards to Riot's systems, them the *vast majority* of players, due to actually finding out information on it and spending a couple years or so actually actively trying to help people by explaining why what they've said/done is against the rules and directing them to the place they need to be to appeal.\n\nNow, unless you have anything further to say that is *constructive*, don't bother.","replies":[{"poster":"kaboomblah","date":"2018-07-23T07:36:17.818+0000","up_votes":4,"down_votes":0,"body":"Out of the dozens of ban appeals I've seen, only one ever seemed legit.\n\nIt was this dude who was quoting another person while defending himself. He said, \"He told me to kys\".\n\nShovel, you won't get your account back. Get on your bike and get out of here.","replies":[{"poster":"Shovel","date":"2018-07-23T08:20:11.830+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Shovel","date":"2018-07-23T08:26:42.734+0000","up_votes":1,"down_votes":4,"body":"all anybody has said ANYTHING about is me saying \"THESE ASIANS ARE RACIST\" LOL. nothing in regards to the actual game or the WHY of it all despite ALL evidence and context ive provided. how sad","replies":[{"poster":"kaboomblah","date":"2018-07-23T08:57:42.740+0000","up_votes":3,"down_votes":0,"body":"IT'S A SEPARATE MATTER!!!\n\nIt's like you beating someone up because they robbed you!\n\nYou'll get punished for your crime, they for theirs!","replies":[{"poster":"Shovel","date":"2018-07-23T09:12:43.229+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Ninox","date":"2018-07-23T10:26:15.453+0000","up_votes":4,"down_votes":0,"body":">[**WHY WAS I PUNISHED WHEN THE OTHER PERSON WAS WORSE OR STARTED IT!**](https://support.riotgames.com/hc/en-us/articles/207489286-Instant-Feedback-System-FAQ-#h1q7)\n\n>[Simply speaking, retaliation is not an acceptable or justifiable behavior. An argument between two players can easily create a negative experience for the rest of the players in the game with you. Regardless of the other player’s actions, this does not justify your own behavior. You alone are responsible for your actions within the game.](https://support.riotgames.com/hc/en-us/articles/207489286-Instant-Feedback-System-FAQ-#h1q7)\n\nIt may not be what you want to hear, but it's the standards the wider community and Riot has set. Noone wants an inter in their game, but they also don't want someone hurling negativity around *constantly*. Even if you don't think your behaviour was that bad, you have to a the very least accept that by the standards of the community you are participating in it is not ok.\n\nYou wouldn't have received a permanent suspension for a first offense unless cheating or some such was involved, that's not how the system works, so you've had at least one prior punishment, and more than likely a 14 day ban at some point. In the reform card for that 14 day punishment you would have been informed that any further violations of community guidelines would result in a permanent suspension of your account.\n\nIf you have any further questions, feel free to ask. If you wish to appeal your punishment, submit a ticket to support as HeartVine suggested. If you've received that 14 day punishment, then I can pretty much guarantee you won't get your account back. If not, you ***might*** (HUGE emphasis on that might) have a case for a reduction, but it's not a strong one.","replies":[{"poster":"Shovel","date":"2018-07-23T10:59:31.194+0000","up_votes":2,"down_votes":4,"body":"tbh at this point im not fussed look at the blatant hypocrisy, racism and bias in this thread you can have your \"community\" ive been here longer than any of you and i remember when the game wasnt run by quiet racists and sjws time to move on keep the fuckin account l0l.\n\nfact of the matter is i presented all the evidence that this player INTENTIONALLY ruined a game over dying level 1 over a summoner spell choice and all ANY of you could point to is me retaliating in chat :) shove it tbh cya!","replies":[{"poster":"TheDemonEmperor","date":"2018-07-23T11:11:52.802+0000","up_votes":4,"down_votes":0,"body":"Hey, Zil acts it out. You words it out. Do you understand you and Zil are a cut from the same cloth? \n\nZil take advantage of the system. You, played right into his hand. There was sooooo many things you can do and says to Zil that would quell your anger and not get yourself banned. Such as typing in all chat about Zil's terrible attitude, and how a player like him should be reported and banned; Give other players the details of zil's toxic behaviors. But nope, you took the wrong route little boy. Instead of targeting one guy, you blur out your rage at the whole crowd. That is one battle the like of you'll never win.","replies":[{"poster":"Shovel","date":"2018-07-23T11:22:25.337+0000","up_votes":1,"down_votes":2,"body":"no he also \"words\" it out or are you ignoring the part of my post where i said he spam pinged and flamed me?  albeit in their ugly broken english as is tradition but thats all well and good because somebody reacted no we arent the same because i didnt troll, flame and intentionally feed because i died. its not me \"playing into his hand\" its riot oce :) when this server is dead and all you have are non english speaking flaming asians playing because literally ANY level headed individual can see how ridiculous this whole system is and they have all moved on well see how things are! keep your community cya later! ","replies":[{"poster":"kaboomblah","date":"2018-07-23T11:47:11.092+0000","up_votes":3,"down_votes":0,"body":"All that effort put into telling people you're not racist, and you end up wearing it like a badge of pride.\n\nSlow clap for you, Shovel!\n\nHow many times are you going to say goodbye? Jesus. Talk about hanging around.","replies":[]},{"poster":"TheDemonEmperor","date":"2018-07-23T12:30:15.197+0000","up_votes":1,"down_votes":0,"body":"Again, your phrasing of \"Asian\". Why are you so keen on berating a whole race and not the individual? \n\nYou've both exchanged insults back and forth with each other? And it just happen, that you're doing all of the above while on your last leg. who's to say, the other guy is not going to meet the same fate? Then he will either get over it, or come here to say his piece.\n\nSeriously, think about it. You just dont know how to effectively argues your points. You'll have to layout and details down what to says; To have the effect that you want, without going against the status Quo. \n\nIn other words, if you are trying not to get ban, you'll probly have a high chance of evading the ban. \n\nWhen i was actively playing league, i flamed almost every games. But i choose my words, and tip toe arround the system. I've settled my anger with other players using insults; But i've kept it within the allotted limit.\n\nBut on this forum, i couldnt careless. I've pretty much speaks whatever, and if they want to delete, ban or warn me, so be it. And they have. \n\nThe point is, if you're trying to evade the worst outcome with careful thinking, the chance that you'll succeed is pretty good. You can take this as a leason; Of character development mile stone in your life. Or, stay as you are. You'll be the judge of where that'll lead, years from now.\n\nAnd believe me, group indentity resentment lead to dark places. There are many empirical data to back up my claim.","replies":[{"poster":"TheDemonEmperor","date":"2018-07-23T13:17:23.406+0000","up_votes":1,"down_votes":0,"body":"I learned that being part of a system mean droping your niche opinions as an individual. \n\nWhen working for large organization; The you as an individual dont exist. It is better to defer your believes and views so that you can intergrate into the \"society\" of said structure. That is if you want to be apart of it. \n\nThe structure of an organization does not change for the individual. It is the individual that'll have to decide, if they are willing to be part of the system. Or garner enough of a major shift to alter the current structure. Which, rarely ever happen. \n\nThe 2 standard paths, is either to reject or accept it. If you accept it, then play by it rule. If you reject it, play something else.\n\nThere will always be a wide flux of trolls and people that make it their goal inlife to see you suffer. Their low resolution method of actions would often, if not always; Causes hates and resentments to follow in it wake. Dont bother with it, say what you think of their statement, carefully. But dont expect them to change their mind. You cant do that so briefly. \n\nIf you want to have victory over those types, you want society to view them as the oppressor. In an arguement; It is the eloquent speaker who speak carefully and with consideration is viewed as the winner. Not one who can throw the most vitriolic insults.","replies":[]},{"poster":"Shovel","date":"2018-07-23T14:07:57.109+0000","up_votes":1,"down_votes":1,"body":"fair call buddy i get what youre saying and agree with it on the whole and in a real life situation yes but i cant really justify applying it to a damn videogame that im supposed to be enjoying so i guess i have to take option number two and move on which is tough since as i said ive been here since preseason 1 but yeah i guess the community has simply outgrown me or i it maybe im wrong and some good eggs like you will keep the game alive but personally ive had enough!","replies":[]},{"poster":"Shovel","date":"2018-07-23T12:48:13.231+0000","up_votes":1,"down_votes":1,"body":"you seem like a nice guy and i understand what you are saying but tbh the system is fundamentally flawed i shouldnt have to cowtow to people for the privelege of playing this game and it WILL and already has been a HUGE contributor to the MASSIVE decline in this servers population and quality of games i have been here since the beginning since before we even had a server since before there even was divisions i have been top 50 challenger on this server i have sat in diamond and seen the effects these players have had and now as a decidedly gold/low platinum player see it there and WORSE than ever the server is absolutely riddled with flaming non english speaking trolling players who have carte blanche to abuse this terrible system riot has implemented on this server. i appreciate you being so level headed and at least trying to be civil rather than being inflammatory from the get to but im of the opinion that we shouldnt HAVE to bow down to these leeches who show no respect for the server or any person who doesnt share their asian heritage :)\n\njust so we are clear i have several close asian friends whom i deeply respect and have no problems with asian people at all on the whole this is not the point and honestly i think people are just honing in REALLY hard on the fact that somebody said \"asians\" rather than seeing the whole picture and understanding how and why that came about. can you honestly look me in the eye and say you havent experienced what i am talking about on this server? honestly?","replies":[]}]}]}]}]}]},{"poster":"kaboomblah","date":"2018-07-23T09:59:12.920+0000","up_votes":2,"down_votes":0,"body":"Of course that %%%% should be instantly banned too. As long as you're telling us the entire truth, of course.\n\nYeah, you did ruin the game. You were a %%%%.\n\nYeah, I've got an IRL persona - which is a bit different from how I'm conduct myself online - gasp! But if I see an idiot crying because he's contesting a ban after he's been a racist twat, I'm probably gonna say stuff to them - much like I'm saying stuff to you.\n\nYeah, I'm racist to a server. That's very possible.","replies":[]}]}]}]},{"poster":"kaboomblah","date":"2018-07-23T08:29:09.498+0000","up_votes":4,"down_votes":0,"body":"What an absolute tit.\n\nStereotyping an entire ethnicity by broadly attributing qualities is racism.\n\nExamples:\n\nAsians on this server are racist.\nCaucasians can't jump.\nBlack people are good at basketball.\n\nNow, whether it be derogatory or insulting is another matter. But it is racism. Don't worry, you'll learn logic when you go to uni.","replies":[]}]}]}]}]}]},{"poster":"Hellopolite","date":"2018-07-23T02:59:23.973+0000","up_votes":3,"down_votes":1,"body":"dont give riot or tencent a cent.","replies":[{"poster":"Miçro Rivèn","date":"2018-08-02T10:26:38.802+0000","up_votes":1,"down_votes":0,"body":"tencent is not as bad as riot at banning people's account, and i truely dont believe only 0.006% of the player has been banned for toxicity\n100M player overall that means only 6k players has been banned? realy dont believe that, that is even including second accounts","replies":[]},{"poster":"Shovel","date":"2018-07-23T08:27:11.225+0000","up_votes":2,"down_votes":3,"body":"yer wont be lol. the game can die as it should.","replies":[]}]}]}