{"poster":"666 APM ADCARRY","date":"2018-11-22T07:44:48.220+0000","title":"ADC sucht Supp-Main","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey, \r\n\r\nADC-Main sucht einen Support-Main f&uuml;r &quot;Tryhard-Games&quot;.\r\nInfo: Ich bin seit Season 5 dabei habe es bisher nie wirklich geschafft konstant zu tryharden, da ich schnell in den Tilt verfalle, wenn mein Support nicht das macht ... nunja ... was er machen sollte ^^\r\n\r\nAn sich bin ich ein chilliger, fokussierter Dude - kann jeden AD-Champ spielen - wei&szlig; wann zu traden ist ...etc.\r\nDer Begriff Wavecontrole wird von mir zelebriert und zudem bin ich ein Freak was das CS&#039;ing angeht. \r\n(Z&auml;hle die missed CS und &auml;rgere mich af dar&uuml;ber ^^)\r\nDeswegen w&auml;re es schon von Vorteil wenn du bescheid wei&szlig;t, wie das vorbereiten als Supp unter gewissen ADC&#039;s funktioniert.\r\n                                                    \r\n                                              - Und nat&uuml;rlich solltest du &auml;hnlich gestrickt sein :) -\r\n\r\n\r\nLetzte Season habe ich es leider nur Solo gen Plat 3 - 80 LP geschafft und danach kam der Tilt :&#039;D ... Trolls everywhere \r\n\r\nAlso wenn du dich angesprochen f&uuml;hlst, melde dich gerne hier oder Ingame \r\n- Adde mich: &quot;666 APM ADCARRY&quot;\r\n\r\nLG Alex","replies":[{"poster":"ToxicRedPanda","date":"2018-11-22T07:55:59.163+0000","up_votes":1,"down_votes":0,"body":">  habe es bisher nie wirklich geschafft konstant zu tryharden, da ich schnell in den Tilt verfalle, wenn mein Support nicht das macht ... nunja ... was er machen sollte ^^\n\nBin immer wieder froh als Supportmain solche ADCs zu bekommen, gibt nichts besseres. Richtig angenehm wenn man für nicht nur für die eigenen Fehler geflamed wird sondern auch für die des Lanepartners.","replies":[{"poster":"Qbert","date":"2018-11-22T07:57:27.317+0000","up_votes":1,"down_votes":0,"body":"weil wir Support Mains auch einfach Schuld dran sind. Punkt. Aus. Ende.","replies":[{"poster":"666 APM ADCARRY","date":"2018-11-22T08:05:53.135+0000","up_votes":1,"down_votes":0,"body":"Ich habe nix von Flame erwähnt.\nEher im Gegenteil - neige ich zum motivieren, falls mal etwas schief läuft.\nEs ging mir darum: Wenn du einen Rnd Supp bekommst, zu dem du keinen Bezug hast, welcher dich im \"Idealfall\" noch \"trollt\", indem er dir mit Absicht CS denied ... das tilted.\n\n... da ich u.a. Ingame zu RND's sage bzw pinge, welche CS sie für mich preparen sollten - viele es aber für einen Witz halten und einen feuchten auf das preparen geben.\n\nAlso net falsch verstehen :)","replies":[{"poster":"Qbert","date":"2018-11-22T08:08:41.902+0000","up_votes":2,"down_votes":0,"body":"Das war aber auch nicht auf dich gemünzt :)\nEs gibt aber (leider oft) Leute, die fest davon überzeugt sind, die Fehler die passieren sind ausschließlich durch die anderen verursacht und dein Thread hatte ein wenig diesen Anschein.","replies":[]},{"poster":"ToxicRedPanda","date":"2018-11-22T08:16:58.706+0000","up_votes":1,"down_votes":0,"body":"Das mit dem CS preparen ist so eine Sache, ich kann das persönlich nicht und es würde wohl darauf hinauslaufen das ich meinem ADC eher schade als ihm zu helfen. Kann sein das es auch anderen so geht, vor allem bei Autofilled Supportern.\n\nWenn jemand schreibt das er schnell tilted ist, weckt das bei mir immer den Verdacht das er auch zum flamen neigt. Sorry dafür, ist eine schlechte Angewohnheit von mir.","replies":[]}]},{"poster":"ToxicRedPanda","date":"2018-11-22T07:59:28.819+0000","up_votes":1,"down_votes":0,"body":"Ach stimmt ja, vergess ich immer.","replies":[{"poster":"Qbert","date":"2018-11-22T08:01:38.766+0000","up_votes":1,"down_votes":0,"body":"ich wollte gestern auch disengagen, weil der gegnerische ADC 2-0 stand, mein Draven wollte kämpfen .... er auch knapp, aber er flamed mich dann \"1-2 autohits und er wäre tot gewesen\" ... dass ich davor aber auch gestorben wäre usw. wurde einfach ignoriert :D\n\nNaja, Preseason halt, alle sind irgendwie komisch drauf ... weiß nicht wieso","replies":[{"poster":"ToxicRedPanda","date":"2018-11-22T08:11:48.466+0000","up_votes":1,"down_votes":0,"body":"Ich durfte gestern als Pyke eine Jinx supporten. Ich glaube sie war noch realativ neu in League oder zumindest hatte sie wenig Erfahrung mit Pyke. Es kommt zu einem 2v2 auf der Botlane. Ich hole mit meiner Ult 2 Kills und wir beide überleben. Ich wollte gerade \"GJ\" schreiben, da kamen aber auch schon die ?-Pings mit der nicht so ganz nett formulierten Aufforderung  ich solle doch bitte aufhören KS zu betreiben. \n\nIch habe dann versucht zu erklären das sie 2 Items bekommen hat die Gold geben wenn man sie nur einmal kurz benutzt, leider ohne Erfolg.","replies":[]}]}]}]}]}]}