{"poster":"Worst Yásuo","date":"2015-02-15T09:24:31.120+0000","title":"Bessere Tower","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":0,"body":"Moin Leute ,\r\nich wollte mal eure Meinung zu den Türmen hören , ich finde sie nicht gut. Meiner Meinung nach sollten die ersten Türme mehr Rüstung und Leben bekommen und der zweite auch , die Lasertürme brauchen mehr Schaden und auch mehr Leben und Rüstung . Was sagt ihr dazu ?\r\nAls beispiel der erste Turm kann innerhalb von 5 Minuten zerstört werden wenn man gegankt wird  und jetzt die Lasertürme als Beispiel nehmen wir Braum wenn Braum/Malphite mit sehr viel Rüstung und Leben können sie  locker eine sehr lange zeit in den Lasertürmen stehen bleiben und somit Teamkämpfe in der Gegnerischen locker für ihr Team entscheiden","replies":[{"poster":"Gohrbie","date":"2015-02-16T00:47:05.977+0000","up_votes":2,"down_votes":0,"body":"Ich finde die ersten Türme kann man so lassen, da sie auf der Mid-Lane relativ lange halten, solange kein Jungler sitted oder man gegen Talon oder Zed spielt. \nJedoch finde ich die Inhib Türme zu schwach. Sie sollen zwar beim verteidigen unterstützen. allerdings kann man unter ihnen einfach diven, da sie etwas brauchen um ihre volle Stärke zu entwickeln. Ich würde ihnen weniger Gsundheit, aber einen höheren Schadens Output geben.","replies":[]},{"poster":"TheKreamCs","date":"2015-02-24T06:01:30.851+0000","up_votes":1,"down_votes":0,"body":"Macht die Türme wie die aus DotA ( ich will jetzt nicht die beiden Games gleichstellen!) Nur wenn man bedenkt wie schnell die Türme bei DotA ballern und die aus LoL, dann sind die shots vom LoL Tower wesentlich langsamer und machen kaum Schaden zumindest wenn man schon lvl 6 ist.","replies":[]},{"poster":"Nuckmuck","date":"2015-02-15T10:18:17.730+0000","up_votes":1,"down_votes":1,"body":"Die Türme wurden in der Vergangenheit schon mehrmals gebufft. Sie sind gut so wie sie jetzt sind. \n\nDie Türme sollen keine unpassierbaren Hindernisse sein. Der Lasertrum ist schon extrem Stark da der Laser A immer mehr schaden macht je länger er schießt und B rüstung ignoriert sowie verlangsamt. Das hält auch ein Malph nicht so lange aus. (Auf jeden Fall nicht so lange wie auf der alten Map)\n\n\nWas würde ein Rüstungs/Leben buff bringen ? Garnichts ! Außer das die Spielzeit für ein Spiel in die Länge gezogen wird.","replies":[]}]}