{"poster":"Nerwal","date":"2016-09-06T03:37:52.393+0000","title":"Ya no da para mas?","subforum":"Charlas Generales","up_votes":3,"down_votes":8,"body":"4ta partida seguida trolleada, ya no da para mas el juego?, se centra solo en el trolleo?, tan bajo cayo el juego?, no da para mas?, es que te trolleen o que te trolleen pero tambien esta la opcion que te trolleen, te vas afk y te comes cola de 5 partidas?, asi de justo es el juego?.\r\nTe obligan a jugar con los trolls si o si porque sino te castigan?, privilegios a los trolls?, donde?, si reportas a un tipo con 30 muertes, que tuvo 6 pares de botas toda la partida y te vuelve a tocar el mismo tipo en otra partida, la justicia? entonces se volvio esto el juego?, la justicia para los trolls, tenes que jugar si o si con ellos, tenes que mutear, tenes que reportar, el perjudicado tiene que hacer todo, pero despues de bancarte 40 min con dolor de cabeza por estos subnormales, lo ves tranquilos haciendo de las suyas en otras partidas. Pero eso si, el perjudicado, tiene la culpa por no mutear, tiene la culpa por no salir desde el loby y que lo castiguen, tiene la culpa por irse afk de la partida ya por cansancio y ser castigado por eso, siempre tiene la culpa de todo, pero el troll no, el troll es intocable, no se metan con el troll.","replies":[{"poster":"VectöR","date":"2016-09-06T03:42:02.674+0000","up_votes":3,"down_votes":0,"body":"welcome to league of legends.","replies":[{"poster":"Nerwal","date":"2016-09-06T03:43:49.712+0000","up_votes":3,"down_votes":2,"body":"Se volvio patetico este juego, de lo mas bajo y humillante","replies":[{"poster":"ZyXEL 001","date":"2016-09-06T04:38:54.306+0000","up_votes":2,"down_votes":0,"body":"Pero si vos sos igual o peor que ellos, vos mismo lo dijiste.","replies":[]}]}]},{"poster":"Adelvert","date":"2016-09-06T08:19:12.187+0000","up_votes":2,"down_votes":1,"body":"en serio esperas encontrar una respuesta a eso en este foro?\n\nolvidate aca esta lleno de señores pro.\n\nlo se por experiencia.\n\npensa que los tipos atras de la pc tienen 12 años con aires de faker.\n\nsi esperas algo razonable en este foro que no sea una estupidez te aviso que olvidate.","replies":[{"poster":"rokushoger","date":"2016-09-06T11:18:47.052+0000","up_votes":2,"down_votes":0,"body":"No sabía que conocias a todos y cada uno de los que escribimos acá... Te agradecería no nos metas a todos en la misma bolsa.","replies":[]}]},{"poster":"rokushoger","date":"2016-09-06T11:26:10.017+0000","up_votes":1,"down_votes":0,"body":"No se si tanto como todo el tiempo, pero últimamente tocan más trolls que nunca, de hecho hace como 1 semana que no toco el juego porque no ando con mucha paciencia y me venían tocando emparejamientos re feos más allá de ganarla o no ganarla (una partida ganada pero que tuviste un troll, o flamers, o mala onda en general es una partida de porquería igual para mí).\nNo obstante me parece que la culpa tampoco se le puede tirar solo a Riot, el verdadero culpable es el troll, y si la comunidad no los reporta consistentemente no se bloquea.","replies":[]},{"poster":"9081913DEL1","date":"2016-09-06T11:02:16.888+0000","up_votes":1,"down_votes":0,"body":"Reportar, blockear, y si te toca dos veces ticket a soporte(?).\n\nPues nada con esos no se puede hacer nada, disfrutar tu juego y hacer como que no existen. En si no comprenden el juego, si quieren trolear hay miles de juegos para eso que no tenes que jugar en equipo. Si no lo entienden no te esfuerces, tu a lo tuyo, haz premade con tus compis o busca con quien hacerlo.\n\nCada tanto se banea gente, el tema es que casi nunca se toman el tiempo de explicar o de reportar tan sencillo como eso, llegan miles de reportes diarios y no todos son logicos, asique si das explicacion y se repite ban.\n\nSaludos.","replies":[]},{"poster":"F de Flan","date":"2016-09-06T04:00:05.225+0000","up_votes":1,"down_votes":3,"body":"no tan bajo como venir a llorar al foro papu!\n\nSaludos!\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Nerwal","date":"2016-09-06T04:28:08.560+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"F de Flan","date":"2016-09-06T04:37:36.315+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nerwal,realm=LAS,application-id=v7qsfXsE,discussion-id=ARaMam8G,comment-id=00010000,timestamp=2016-09-06T04:28:08.560+0000)\n>\n> Con razon tenes tantos negativos en tus publicaciones, sos un troll mas, niño mañana hay escuela que no son responsables tus padres?\n\nUy! Me tomas de niño, me siento realmente ofendido, te daré un negativo!!!\n\nCon todo eso que lloras, difícilmente pueda creerte que no seas terrible rata y flammer.\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Nerwal","date":"2016-09-06T04:42:00.036+0000","up_votes":1,"down_votes":0,"body":"Vamos duerme que vas a bajar las notas","replies":[]}]}]}]}]}