{"poster":"Zeds Dead","date":"2017-09-20T12:15:44.150+0000","title":"Attempting to reconnect....","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Lately from the 7.18 patch I have been receiving lag so bad that usually occurs around 8-10 minutes in. I have no problems up until that time then I constantly receive these messages and moonwalk all around usually resulting in my death, then I am just fine back to lane. for it to happen so frequently I cannot do anything. I did the hextech repair tool, I reset my router, I did the lag report which showed my internet connection as GREAT! I checked with my isp and same thing. GREAT connection. I even Changed my graphics to lowest setting which I have never had to do since playing in 2012. This is extremely frustrating as some games are completely fine, yet a majority it sends me in an unplayable state and I am frequently losing games, I refuse to play ranked as I refuse to hinder my team as I have lately walking in to team fights just to watch everyone freeze then unfreeze to a gray screen and see my entire team dead. my ping sits at 45-47 which is normal for me and FPS will go from 60 down to 05-00 sometimes but the attempting to reconnect is the major issue and it only started happening Sunday. \r\n\r\nWould like some advice on if other players are experiencing this or if they have fixes. I have pretty high end internet and firewalls have exceptions and the whole nine yards as I said never had this problem in 5 years of playing.{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Broporo","date":"2017-09-20T22:40:50.906+0000","up_votes":1,"down_votes":0,"body":"Getting that attempting to reconnect over and over is a pretty clear sign that something isn't quite right with your connection as it travels to our servers. Let's take a look at what's going on by having this [**log reader**](https://support.riotgames.com/hc/en-us/articles/209765743) scan your latest network logs that had this issue. Post a screenshot of what it gives you here for me to take a look at!","replies":[]}]}