{"poster":"SHDRaven","date":"2018-04-18T16:31:46.117+0000","title":"Verrückt, Gaming-/Anime-Liebhaber und auf Communitysuche? Schau mal bei uns vorbei!","subforum":"Clans & Teams","embed":{"description":"Dieses Bild wurde am 18.04.2018 hochgeladen.","url":"http://www.directupload.net/file/d/5061/gnsw7sem_jpg.htm","image":"http://fs1.directupload.net/images/180418/gnsw7sem.jpg"},"up_votes":1,"down_votes":0,"body":"Hallo ihr leute da drau&szlig;em in aller Welt und WIllkommen zu unserem Vorstellungspost der ShadowSociety!\r\n\r\nWir sind derzeit auf der Suche nach Mitgliedern, welche uns bei dem Wiederaufbau unserer ehemaligen Community helfen.\r\nUnsere Community hat eine etwas l&auml;ngere Geschichte hinter sich und dem entsprechend haben unsere (derzeit nur 2) Communityleiter auch bereits einiges an Erfahrungen sammeln k&ouml;nnen. Einige Ereignisse haben leider daf&uuml;r gesorgt, dass unsere Community relativ leer wurde und auch einige Zeit lang so gelassen wurde. Nach einiger Zeit der Ruhe haben wir uns nun dazu entschlossen, unsere Gesellschaft der Schatten wieder aufleben zu lassen!\r\n-------------------------------------------------\r\nUnsere Ziele:\r\n- Wir wollen die unterschiedlichsten Personen (unabh&auml;ngig von Name, Elo, Spielen oder &auml;hnlichen Faktoren) zusammenbringen\r\n- Unserer Discordserver soll eine Art Treffpunkt dieser Personen sein, sowie eine Plattform zum Unterhalten und gemeinsamen Zeit verbringen werden\r\n- Unser aktuell gr&ouml;&szlig;tes Ziel ist es, so viele Member wie m&ouml;glich zu sammeln\r\n- Wir planen ein System zu entwickeln, &uuml;ber welches die Mitglieder Punkte auf die unterschiedlichste Art und Weise verdienen k&ouml;nnen und nach einen Zeitabschnitt derjenige, welcher die meisten Punkte hat, eine kleine Belohnung als Dankesch&ouml;n f&uuml;r die Aktivit&auml;t bekommt\r\n- Events (welche allerdings eine gewisse Memberanzahl vorraussetzen) sind ebenfalls eines unserer Ziele\r\n- Falls sich gen&uuml;gend Leute mit entsprechendem Interesse finden lassen, besteht auch die M&ouml;glichkeit, sich hin und wieder offline zu treffen\r\n-----------------------------------------------\r\nDa es in der Vergangenheit unserer Community bereits einige Vorf&auml;lle gab, wird es bei uns, wie bei vielen anderen Communities auch, Regeln geben.\r\n\r\nRegelwerk:\r\n1. Mindestbeitrittsalter ist 16 Jahre.\r\n\r\n2. Jeder, der auf den Server kommt, wird ohne R&auml;nge als Gast betrachtet. Falls du unserer Community beitreten m&ouml;chtest, musst du uns dies auch mitteilen. Schreib dazu einfach ein Teammitglied an oder komm zu uns in den Voicechat und teile uns dein Interesse mit. (Falls du dich mit Discord nicht auskennst, kannst du mich auch alternativ im LoL-Client adden und anschreiben.)\r\n\r\n3. Jeder auf dem Discordserver hat darauf zu achten, einen angemessenen Ton und entsprechende Umgangsformen mitzubringen, um Probleme zu vermeiden und die allgemeine Stimmung nicht zu ruinieren.\r\n\r\n4. Es wird darum gebeten, den Anweisungen der Teammitglieder Folge zu leisten. Diese Anweisungen werden gr&ouml;&szlig;tenteils nur zur Problembeseitigung gegeben. Falls du ein Problem einem Teammitglied hast, kannst du dich an ein anderes Teammitglied oder den Master wenden.\r\n\r\n5. Falls ihr einen der Voicechats des Servers benutzt, versucht bitte, eine gute Qualit&auml;t aufrecht zu halten. Probleme k&ouml;nnen immer auftreten, aber versucht wenigstens, diese so weit wie m&ouml;glich zu beheben, damit eine problemfreie Kommunikation m&ouml;glich ist.\r\n\r\n6. Das Spammen in Chats ist untersagt. Ebenfalls untersagt sind rassistische und andersweitig extreme Aussagen und Aktionen.\r\n\r\n7. Auch wenn es nicht immer m&ouml;glich sein wird, wird darum gebeten, auf alle R&uuml;cksicht zu nehmen.\r\n-------------------------------------------------\r\n\r\nAlso, falls ihr auf der Suche seid nach einer (noch) kleinen Community, bei der die Teammitglieder sich auch richtig um die Mitglieder k&uuml;mmert und wir mit diesem Text euer Interesse wecken konnten, schaut doch gerne mal auf unserem Discordserver vorbei.\r\nWir freuen uns darauf, eure Bekanntschaft zu machen!\r\n\r\nMit freundlichen Gr&uuml;&szlig;en\r\nSHD\r\n\r\nDiscordserver:\r\nhttps://discord.gg/FMFwdhd","replies":[]}