{"poster":"idc if u report","date":"2018-02-09T22:25:34.058+0000","title":"The reason why the Report System might aswell not exist.","subforum":"Player Behavior","up_votes":1,"down_votes":8,"body":"(The reason why the report system might aswell get rid of some specific report options*)\n\nI was inspired to write this post because as I was looking through old posts. I saw [this one](https://gyazo.com/3f3d3f6c0263eaa6ee482d08729cc9c8), and I said wow I really agree with this. Then I saw it was -4.\n\nPlayers in Soloq are often very sensitive and insecure. Due to this, they will reply to and engage in many negative natured conversations/arguements that end up hurting their feelings. They do have multiple other options, which myself I have not fully understood why they chose not to use, such as muting, removing the chat, ignoring people, ect..)~ If you respond to toxic natured messages, it sparks the toxicity even more. It&#039;s fighting fire with fire. When you continue to REPORT the people that you responded to, it seriously becomes a problem, because to the extent it was YOUR choice to respond to them and take the verbal abuse, you should not have the option to report them. Muting does not fix some things like int, poor performance ect. but can prevent it.\n\n~~ I don&#039;t report people anymore. Not in my ranked promos/pre10&#039;s even where I had multiple inters who said they were inting due to tax etc. ~~\nI was watching Dong Huap live a few days ago. He had a flamer and didn&#039;t report because he said that it wasn&#039;t reportable (roughly Can&#039;t remember exactly what he said) ","replies":[{"poster":"Chermorg","date":"2018-02-09T22:42:07.481+0000","up_votes":9,"down_votes":0,"body":"Here's my take on it: I mute you so **I** don't have to deal with your toxicity anymore. I report you so **nobody else** has to deal with your toxicity anymore.","replies":[{"poster":"idc if u report","date":"2018-02-09T22:46:59.456+0000","up_votes":1,"down_votes":4,"body":"Other people can mute aswell, and if the toxic player gets banned they will make a new account and then introduce new players to this toxicity, which in my opinion is even worse.","replies":[{"poster":"Chermorg","date":"2018-02-09T22:50:35.050+0000","up_votes":2,"down_votes":0,"body":"Well, first of all, the statistics show that a majority of players who are permanently banned say \"fuck it\" and leave the game - or they play *very* infrequently. Many of the ones who *do* keep playing are not toxic when they return. Only a small handful of players are continually toxic across multiple accounts.\n\nThat aside, other players **shouldn't have to mute**. That's why I personally report - if I saw enough to have to mute you, I don't want other players to have to deal with you that long, then mute. When someone mutes another player, the damage *has already been done*.","replies":[{"poster":"Lyndris","date":"2018-02-09T23:04:25.312+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Chermorg,realm=NA,application-id=ZGEFLEUQ,discussion-id=pd6pV7pQ,comment-id=000200000001,timestamp=2018-02-09T22:50:35.050+0000)\n> \n> That aside, other players **shouldn&#x27;t have to mute**. That&#x27;s why I personally report - if I saw enough to have to mute you, I don&#x27;t want other players to have to deal with you that long, then mute\n\nThis is the very reason I report. IDC so much that people are _somewhat_ toxic, but not everyone is able to say \"whatever\" and it is _annoying_ to listen to. Plus, there are kids and some with real issues playing, they don't need jerks causing problems in their games.\n\nTLDR: I report to help make LoL better as a whole.","replies":[]}]},{"poster":"AeroWaffle","date":"2018-02-09T22:50:11.377+0000","up_votes":2,"down_votes":0,"body":"You're assuming that every person is willing to jump right back into the game after having all their progress set back to zero.","replies":[]},{"poster":"Periscope","date":"2018-02-10T04:28:11.812+0000","up_votes":1,"down_votes":0,"body":"Hey, if people want to play like Sisyphus, who's to stop them?","replies":[]}]},{"poster":"CheapKill","date":"2018-02-09T22:50:06.518+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chermorg,realm=NA,application-id=ZGEFLEUQ,discussion-id=pd6pV7pQ,comment-id=0002,timestamp=2018-02-09T22:42:07.481+0000)\n>\n> Here&#x27;s my take on it: I mute you so **I** don&#x27;t have to deal with your toxicity anymore. I report you so **nobody else** has to deal with your toxicity anymore.\n\nWell put.","replies":[]}]},{"poster":"MagicFlyingLlama","date":"2018-02-09T22:30:08.468+0000","up_votes":3,"down_votes":1,"body":"https://i.imgur.com/UQACgIw.png","replies":[]},{"poster":"AJStarhiker","date":"2018-02-10T05:09:54.418+0000","up_votes":1,"down_votes":0,"body":"I recently played a game where 3 enemy players argued and/or responded to teammates' comments in all chat (some really odd non sequiters).  All that did was tell my team how badly they tilted and capitalize on it.  I took the relatively easy win.  Then I reported all three.  By the time I was ready to play another game, I had gotten a \"Player you reported...\" notice.  So yeah, it does work.  It's just not as visible as a lot of us would like.","replies":[]},{"poster":"Telephone Booth","date":"2018-02-10T03:00:50.700+0000","up_votes":1,"down_votes":0,"body":"The thread you cite is why the tribunal doesn't exist anymore. People who decide to punish for petty things like just seeing the word stupid. \n\nNow that there is an automated system, I will report people just because I know if I talked like them, I would get punished. So why do I have to use my willpower to stop myself from insulting players, but they dont have to? No, you're getting a report because you don't get a free pass, when the rest of us have to follow the rules. This is sort of beside your point, I know.\n\nNow, I don't believe that Riot implemented rules against verbal abuse just because they thought it was morally wrong to verbally abuse people. It seems more logical to me that they would have people who study things like player satisfaction and complaints. They see millions of players complaining about toxicity, so they decide to make their players happy by implementing rules against toxicity. After all, they are a business... They want to have the largest playerbase possible to maximize potential profit, and if people don't want to play league because of the toxicity, you better believe a company is going to do whatever they can to fix that problem and appease the MAJORITY. That's all they care about. The majority.\n\nSo it's really people and society in general that causes rules like these. It's like legislation that punishes people for calling someone by the wrong pronoun intentionally and consistently, except this isn't breaking any constitutional rights. I can understand Riot having these rules much better than I can understand a free country implementing rules that restrict your freedom of speech.\n\nMuting of course helps mitigate the problem, but unfortunately, it isn't enough for some people. Usually people mute after the damage has already been done. You can't predict who's gonna tell you you're worthless trash who should go commit suicide. \n\nSo in the end, this is why we have the system we have. I personally disagree with it, but I can at least understand why it exists. And I completely disagree with you as to why it \"might as well not exist\". But I do understand why you would think that. Just try to do the same and understand their side too... beyond simple things like \"well you can just mute\".","replies":[]},{"poster":"Xidphel","date":"2018-02-09T22:33:03.956+0000","up_votes":1,"down_votes":0,"body":"That picture is from 2012. We're in 2018.\n\n[So here's my counter-argument:](https://na.leagueoflegends.com/en/legal/termsofuse#code-conduct)\n\n>5.1. Can I troll, flame, threaten or harass people while using the Riot Services? (No. If you do, you might get banned.)\nWhile using the Riot Services, you must comply with all laws, rules and regulations in the jurisdiction in which you reside. You must also comply with certain additional rules that govern your use of the Riot Services (the “Code of Conduct”). The Code of Conduct is not meant to be exhaustive, and we reserve the right to modify it at any time, as well as take appropriate disciplinary measures including account termination and deletion to protect the integrity and spirit of the Riot Services, regardless of whether a specific behavior is listed in the policy as inappropriate. In addition to the Code of Conduct, please review the Summoner’s Code for additional guidance on exemplary gameplay behavior.\n\nNot anyone's fault they break that rule even while muted except theirs because turns out, muting is not a get-out-of-trouble-free card.","replies":[{"poster":"idc if u report","date":"2018-02-09T22:37:06.080+0000","up_votes":1,"down_votes":0,"body":"The point of the thread is saying that this rule has no point. Might aswell just get rid of muting then.","replies":[]}]}]}