{"poster":"Nice Doggo","date":"2017-03-04T11:16:33.540+0000","title":"Ieri sera ho sentito la chiamata...","subforum":"Discussioni generali","up_votes":9,"down_votes":9,"body":"e ho pickato nuovamente leona mid vs una katarina main.\r\n\r\nRisultato??\r\n\r\nHo vinto la lane, katarina ha tiltato male e niente, il team che in champ select mi voleva reportare poi mi ha onorato, non capisco... perch&eacute; quando giochi male sei uno str*** e quando giochi bene... aspetta che ti chiedo l&#039; amicizia!!\r\n\r\n\r\nboh\r\n\r\nComunque niente, tornando a cose serie, penso che leona sia un perfetto counter pick di katarina:\r\nKata non pu&ograve; fare assolutamente niente, ah.... che goduria, provatela x) e poi leona prima del 6 ha dei danni ASSURDI &deg;_&deg;\r\nComunque l&#039; ho pickata perch&eacute; il nostro supp era Annie, quindi in late avremmo comunque colmato i miei non danni da midlaner x)\r\n\r\nggwp, provate leona mid pls","replies":[{"poster":"wattbatt","date":"2017-03-04T11:27:29.797+0000","up_votes":3,"down_votes":1,"body":"io questo forum non lo capisco. post che hanno -1 senza una spiegazione razionale, mah...","replies":[{"poster":"HaIIeIujah","date":"2017-03-04T11:31:00.225+0000","up_votes":4,"down_votes":2,"body":"Se dovessi ipotizzare: \"Alla gente non piace essere consigliati di giocare Leona Mid\", specie quando l'unica giustificazione data è \"funziona in low elo\"","replies":[{"poster":"Nice Doggo","date":"2017-03-04T11:33:01.049+0000","up_votes":4,"down_votes":3,"body":"Ma io sono un giocatore low elo, che vince contro low elo... l' 80% dei player è low elo.. cosa c'è di male? xD","replies":[{"poster":"HaIIeIujah","date":"2017-03-04T11:37:11.840+0000","up_votes":7,"down_votes":3,"body":"Che in low elo, il campione che usi è praticamente irrilevante. Chiunque può vincere contro qualunque cosa purchè conosca il proprio campione meglio dell'avversario.\n\nLeona Mid è spazzatura senza redenzione, ed il fatto che qualcuno ci vinca in silver non la rende viabile. Pertanto, il post che si conclude con \"Giocate Leona Mid, funziona!\" sa di pagliacciata.","replies":[{"poster":"Nice Doggo","date":"2017-03-04T11:55:50.499+0000","up_votes":3,"down_votes":3,"body":"Io ho detto di **provarla **e non che funziona, e pertanto il tuo post è al quanto di cattivo gusto, pensi mai quando scrivi qualcosa? {{champion:89}} e sopratutto, magari leggi bene e poi prova a scrivere, senza usare termini che degradano il senso della discussione x)","replies":[{"poster":"HaIIeIujah","date":"2017-03-04T11:59:08.137+0000","up_votes":4,"down_votes":2,"body":"> Io ho detto di provarla e non che funziona,\n\nQuindi le alternative sono due: ho hai detto di provarla perché funziona, nel qual caso non capisco perché lo stai negando;\no hai detto di provare qualcosa che sai non funzionare, nel qual caso direi che i -1 sono perfettamente giustificati.\n\nSe trovi una cosa qualunque di ciò che ho scritto di cattivo gusto, quello è un tuo problema personale. Non ho detto nulla se non fatti. Prendere offesa è una scelta.","replies":[{"poster":"Nevict","date":"2017-03-04T16:15:53.539+0000","up_votes":2,"down_votes":1,"body":"I counter picks sono famosi anche in high elo. Se leona è buona contro katarina, stai certo che inizieranno a notarla e usarla presto.","replies":[{"poster":"HaIIeIujah","date":"2017-03-04T16:19:21.975+0000","up_votes":2,"down_votes":0,"body":"Stai certo che se provi a prendere Leona Mid contro Katarina in qualunque cosa sopra platino capirai il vero significato della parola \"dolore\" nel giro di undici minuti.\n\nPer darti una prospettiva migliore, se leona fosse buona contro katarina la userebbero in alto elo.","replies":[{"poster":"Bastonliegi","date":"2017-03-05T13:02:32.647+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shin Tera SIN,realm=EUW,application-id=MJVj50Jw,discussion-id=6pY0Byye,comment-id=00000000000000000000000000010000,timestamp=2017-03-04T16:19:21.975+0000)\n>\n> Stai certo che se provi a prendere Leona Mid contro Katarina in qualunque cosa sopra platino capirai il vero significato della parola &quot;dolore&quot; nel giro di undici minuti.\n> \n> Per darti una prospettiva migliore, se leona fosse buona contro katarina la userebbero in alto elo.\n\nUna volta, in Streaming, Jizuke ha perso hard la Mid con Katarina contro un Maokai (buildato Tank, non AP)","replies":[]},{"poster":"Nevict","date":"2017-03-05T10:06:29.217+0000","up_votes":1,"down_votes":0,"body":"Giusto.","replies":[]}]}]},{"poster":"kroinel","date":"2017-03-04T15:01:08.534+0000","up_votes":1,"down_votes":0,"body":"ricorda che ce modo e modo di dire le cose {{sticker:slayer-jinx-catface}}","replies":[{"poster":"mangialavandini","date":"2017-03-05T15:53:21.254+0000","up_votes":1,"down_votes":0,"body":"esatto sei un bronzo fai schifo....{{sticker:slayer-jinx-wink}} ...ehm...","replies":[{"poster":"kroinel","date":"2017-03-21T16:17:29.236+0000","up_votes":1,"down_votes":0,"body":"si ma io..\ne poi..\ncolpa del junglerr..\nno\ncolpa di tutto il team..\nbasta, vado a cagare in champ select","replies":[]}]}]}]}]},{"poster":"DonCavallo","date":"2017-03-04T20:04:32.117+0000","up_votes":1,"down_votes":0,"body":"Leona mid funziona in Low Elo (facciamo che sia vero, non ho mai testato). Pertanto funziona per l'80% dei giocatori.\nLeona mid non funziona in High Elo, quindi, ipoteticamente, nel 20% delle situazioni.\n\nStatisticamente Leona funziona otto volte su dieci circa. Conoscere meglio un campione o fare discorsi del tipo \"voi non capite\" non intacca il fatto che nella maggioranza dei casi, secondo questo discorso, Leona funziona.\n\nVedendo gente, in elo alto, usare Sion Mid, si direbbe che sia un buon pick. Invece non lo usa nessuno. Eppure in elo alto lo fanno (o comunque l'ho visto fare più di una volta).\nE cose così. Faker picka Olaf in mid e tutti a farlo. E si prendono botte. (anche se Olaf lo ritengo viabile mid XD)","replies":[{"poster":"HaIIeIujah","date":"2017-03-04T20:21:46.254+0000","up_votes":2,"down_votes":1,"body":"Ripeto: il 100% dei campioni funziona in low elo.\n\nIl fatto che un campione funzioni in low elo non è un dato utile.  Questo discorso può essere ripetuto per ogni campione del gioco.","replies":[{"poster":"DonCavallo","date":"2017-03-04T20:32:21.093+0000","up_votes":2,"down_votes":1,"body":"Non è vero che funziona tutto. Funziona quello che sai usare meglio del tuo avversario. Ma ci sono MU che non funzionano in ogni caso.\n\nSe funzionasse tutto avremmo un range di champ allucinante, invece dei soliti 20-30. Ti sfido a prendere un account unranked e portarlo all'Elo in cui ti trovi usando solo Urgot.","replies":[{"poster":"HaIIeIujah","date":"2017-03-04T20:37:04.351+0000","up_votes":2,"down_votes":1,"body":"> Non è vero che funziona tutto. Funziona quello che sai usare meglio del tuo avversario. \n\nQuoto da quel che ho detto prima: \n\n>  Chiunque può vincere contro qualunque cosa purchè conosca il proprio campione meglio dell'avversario.\n\npoi.\n\n> Se funzionasse tutto avremmo un range di champ allucinante, \n\nInfatti la distribuzione di pick rate [si restringe con l'aumentare del rank](http://www.leagueofgraphs.com/champions/stats/silver), man mano che i campioni più in meta assorbono più pick nel loro ruolo.","replies":[{"poster":"DonCavallo","date":"2017-03-04T20:38:58.224+0000","up_votes":1,"down_votes":1,"body":"Hai detto che funziona tutto, prova la sfida di Urgot. Non ti ho dato limite di tempo, è solo per vedere se è vero quello che dici.","replies":[{"poster":"HaIIeIujah","date":"2017-03-04T20:41:35.774+0000","up_votes":1,"down_votes":0,"body":"Il mio elo attuale è PIV, con un po' di fortuna in salita. Se provassi a giocare Urgot in post plat verrei massacrato, a meno di non impiegare parecchie e parecchie ore a imparare il campione, ora che devo impiegare per tornare in diamond.\n\nSe la sfida era semplicemente \"stompa in low elo con un champ random\" ho fatto da Silver V a Silver II con AP Alistair top 2 season fa, se può valere la pena.","replies":[{"poster":"DonCavallo","date":"2017-03-04T20:43:41.082+0000","up_votes":1,"down_votes":0,"body":"Ma si, volevo solo provocare.\nIntendevo che, essendo Plat 4 come hai detto (non ho l'abitudine di controllare il livello della gente), dovresti avere un livello superiore di meccaniche, quindi perderesti poco tempo a mainare Urgot per poterlo usare per stompare i bronzini ecc. fino ad arrivare al plat 4","replies":[{"poster":"HaIIeIujah","date":"2017-03-04T20:47:15.982+0000","up_votes":1,"down_votes":0,"body":"Non in Plat, ma sono relativamente confident di poter arrivare in Gold I/II unicamente con Urgot.\n\nAggiungimi su league, e nei tempi morti sono disposto a convertire il mio smurf in un OTP Urgot per una scommessa amichevole. Unranked to Gold II, solo Urgot, entro fine season, se vinco mi paghi il name change dello smurf?","replies":[{"poster":"DonCavallo","date":"2017-03-08T10:27:17.919+0000","up_votes":1,"down_votes":0,"body":"Sembra divertente e ti chiederei di andare duo se non sembrasse che ti chiederei di boostarmi ahahah\nSono fuori casa e non giocherò a LoL per qualche settimana, ma al ritorno ti addo dal mio account principale. Ricordamelo!\n(sto scrivendo dal telefono XD)","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"SirZeel","date":"2017-03-04T20:18:28.735+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Artuel,realm=EUW,application-id=MJVj50Jw,discussion-id=6pY0Byye,comment-id=,timestamp=2017-03-04T11:16:33.540+0000)\n> Ho vinto la lane, katarina ha tiltato male e niente, il team che in champ select mi voleva reportare poi mi ha onorato, non capisco... perchè quando giochi male sei uno str*** e quando giochi bene... aspetta che ti chiedo l'amicizia!!\n\nStai chiedendo perché una persona che ti porta beneficio è più gradita di una che ti porta una perdita?\nSicuramente devo aver capito male.","replies":[]}]}