{"poster":"Its All Skillzz","date":"2019-01-01T06:28:10.891+0000","title":"Remove this fucking item, your game has gone downhill since its inception","subforum":"Gameplay","up_votes":113,"down_votes":66,"body":"{{item:3147}} \r\nThe game has literally gone to complete trash since this item was created and all the ones who abused it have been nothin but trouble in solo Q. who cares about pro play and how viable shitssins are when they are ruining the game for your player base that keeps your game running. stop buffing the champs who abuse this item an delete it permantly and gut kha zix, zed, talon, rengar, kayn and everyone else who abuses it.","replies":[{"poster":"Cats Are Food","date":"2019-01-01T06:35:49.995+0000","up_votes":47,"down_votes":8,"body":"He's not WRONG...\n\nNot sure it's the problem, but he's not wrong.","replies":[{"poster":"Divewing","date":"2019-01-01T23:57:15.752+0000","up_votes":13,"down_votes":2,"body":"Is he?\n\nHe opens saying Duskblade needs to be removed, then later says that all ad assassins who use it should be gutted.\n\nI don't understand this logic, if the problem is duskblade, the champs wont need nerfing, if they do need nerfing anyway, then does that mean it's really duskblade causing the problems?\n\nI get the feeling this is the kind of person who will sit incredibly far up the lane with no vision as a squishball adc, expecting he can compete with champions who are literally designed to pick off isolated targets quickly and efficiently.\n\nContrary to what everyone seems to believe, Assassins don't magically 1-shot people out of nowhere. They 1-shot people out of nowhere after getting a few kills, and maintaining that lead. Until that point, most of them have perfectly reasonable counterplay that it's more on you if you die to them.","replies":[{"poster":"Tennousu","date":"2019-01-02T00:17:11.998+0000","up_votes":3,"down_votes":0,"body":"Adding to this, I could have sworn that the entire reason DuskBlade was added to the game in the first place was to purposely give AD assassins an item that they needed to rely on, and therefore could be used as an extra balancing lever for them.","replies":[]}]}]},{"poster":"MagicFlyingLlama","date":"2019-01-01T07:20:58.961+0000","up_votes":24,"down_votes":5,"body":"There are bigger problems than gankblade of zedtharr.","replies":[]},{"poster":"l MrD l","date":"2019-01-01T14:47:49.742+0000","up_votes":23,"down_votes":6,"body":"If they remove duskblade and remove true damage from conqueror the game would be a lot more playable ....","replies":[{"poster":"Lhuhz","date":"2019-01-01T15:41:03.428+0000","up_votes":3,"down_votes":7,"body":"Why, you are not explaining why Conqueror or Duskblade are problematic","replies":[{"poster":"KARABICA JEBAC ","date":"2019-01-01T17:34:20.150+0000","up_votes":17,"down_votes":3,"body":"Because it doesnt matter how many defenses tanks build they still get melted in matter of 2 seconds.","replies":[{"poster":"Lhuhz","date":"2019-01-01T18:15:44.146+0000","up_votes":3,"down_votes":8,"body":"You know why Conqueror was released in the first place ?\n\nBecause some bruisers lacked a keystone and were being beated up by tanks in pure 1vs1 while also having more teamfight pressence.\n\nBruisers counter tanks, that how it should be and that's how it is since Conqueror, and it's not like Conqueror is used by everyone, you dont usuario count more than 1 Conque per te on your games.","replies":[{"poster":"GigglesO","date":"2019-01-01T18:28:27.385+0000","up_votes":7,"down_votes":2,"body":"But now it’s just generally as good as other runes at base armor values, and then gets crazy when anyone looks at getting armor. \n\nIt should be a niche keystone instead of a generic generalist rune.","replies":[]}]}]}]},{"poster":"AR URF","date":"2019-01-02T22:40:52.614+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=l MrD l,realm=NA,application-id=3ErqAdtq,discussion-id=Xs9xf62g,comment-id=0014,timestamp=2019-01-01T14:47:49.742+0000)\n>\n> If they remove duskblade and remove true damage from conqueror the game would be a lot more playable ....\n\nYES YES YES SO MUCH THIS.","replies":[]}]},{"poster":"ankoanko19","date":"2019-01-01T12:44:28.607+0000","up_votes":26,"down_votes":13,"body":"This is why I love the boards. They complain about assassins when any assassin who is not Khazix or Leblanc are complete garbage while champs like Galio ruins midlane so hard. hahahaha xDDD.","replies":[{"poster":"Abibyama II","date":"2019-01-01T14:06:22.811+0000","up_votes":14,"down_votes":2,"body":"Aftershock is balanced :)","replies":[{"poster":"Lhuhz","date":"2019-01-01T15:36:47.135+0000","up_votes":2,"down_votes":1,"body":"I like your flair, if you know what I mean.","replies":[{"poster":"Abibyama II","date":"2019-01-01T17:19:58.139+0000","up_votes":2,"down_votes":1,"body":"Thanks fam","replies":[]}]}]},{"poster":"Zardo","date":"2019-01-02T00:56:22.059+0000","up_votes":2,"down_votes":1,"body":"You know, i'm looking through champion statistics and i'm not seeing \"complete garbage\"(aside from akali). I'm seeing a bunch of reasonable(49-51%) winrate champions with respectable pickrates. Admittedly they aren't currently the most picked champions right now(mid lane at least, jungle is another story). \n\nBut i'm not really seeing a problem with the post. If duskblade gets removed, champions will have the damage compensated in more healthy ways than a point and click nuke of an AA. Just because something isn't in the forefront of the meta does not mean it cannot use work to be more healthy to play as and against.","replies":[{"poster":"ankoanko19","date":"2019-01-02T02:04:03.736+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Zardo,realm=NA,application-id=3ErqAdtq,discussion-id=Xs9xf62g,comment-id=000d0002,timestamp=2019-01-02T00:56:22.059+0000)\n>\n> You know, i&#x27;m looking through champion statistics and i&#x27;m not seeing &quot;complete garbage&quot;(aside from akali). I&#x27;m seeing a bunch of reasonable(49-51%) winrate champions with respectable pickrates. Admittedly they aren&#x27;t currently the most picked champions right now(mid lane at least, jungle is another story). \n> \n> But i&#x27;m not really seeing a problem with the post. If duskblade gets removed, champions will have the damage compensated in more healthy ways than a point and click nuke of an AA. Just because something isn&#x27;t in the forefront of the meta does not mean it cannot use work to be more healthy to play as and against.\n\nThis is ultimately the problem with the boards. You only analyze winrates and for Platinum aswell. Shyvana should apparently be a fairly strong champ because of her 50.2% wr, right? The higher the ladder goes, the less and less of assassins you see.\n\n''I'm not seeing a problem with this post''. There is a problem: OP wants ad assassins to get gutted while there's only 1 that shines currently. Assassins arent strong in this meta but the boards prefer to bitch about them over someone whos actually oppressive and op like Galio/Liss, simply because Galio isnt an assassin (but his dmg output is like one tho lol).","replies":[{"poster":"Zardo","date":"2019-01-02T02:12:29.848+0000","up_votes":2,"down_votes":1,"body":"> You only analyze winrates and for Platinum aswell.\n\nNo, I look at both plat+ stats and diamond+ stats. I look at KR, CN, EU, and global champion statistics.\n\n>boards prefer to bitch about them over someone whos actually oppressive and op like Galio/Liss,\n\nFirst off- How is lissandra oppressive? She's good at being able to deny an enemy a snowball, not completely dominate lanes like other champions can.\n\nSecond, The reason the boards complains about this is because they don't like playing against it and they perceive it as \"op\" or \"broken\". They may be fine with playing against champions like galio, but not the ones they post about. That's fine, they're entitled to their opinion. \n\nIt's also important to note that something doesn't have to be broken to be be unhealthy- EG. Old akali wasn't overpowered, but she was extremely unhealthy.","replies":[]}]}]}]},{"poster":"Icy Hot Shoto","date":"2019-01-01T06:33:15.677+0000","up_votes":9,"down_votes":17,"body":"Not to mention all lethality items. Or just remove the lethality on them in general.\n\nHonestly, Duskblade probably wouldn't be that bad if it wasn't for the lethality on it. Sure, the passive could still use less damage more than likely, but when it can basically do true damage to an adc/mage/support, then it's a problem. Remove lethality and it becomes less of a problem.\n\nAlso, this game was going downhill ever since Runes Reforged. Not because they added Duskblade.","replies":[{"poster":"Its All Skillzz","date":"2019-01-01T07:05:32.224+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Ranmaru Kurosaki,realm=NA,application-id=3ErqAdtq,discussion-id=Xs9xf62g,comment-id=0000,timestamp=2019-01-01T06:33:15.677+0000)\n>\n> Not to mention all lethality items. Or just remove the lethality on them in general.\n> \n> Honestly, Duskblade probably wouldn&#x27;t be that bad if it wasn&#x27;t for the lethality on it. Sure, the passive could still use less damage more than likely, but when it can basically do true damage to an adc/mage/support, then it&#x27;s a problem. Remove lethality and it becomes less of a problem.\n> \n> Also, this game was going downhill ever since Runes Reforged. Not because they added Duskblade.\n\ni mean do you not know the hidden power in duskblade??? the damage is not what im talking about, im talking about the other broken ass passive that allows free clearing of wards for just walking near one. it literally removes all counterplay you have to a fed player cause they will clear your wards and either wait in that bush to gib someone or come back later, not to mention there is always 2-3 of these stupid things in 1 game. it makes preventing ambushes almost impossible.","replies":[{"poster":"Icy Hot Shoto","date":"2019-01-01T08:31:00.695+0000","up_votes":4,"down_votes":4,"body":"> [{quoted}](name=Its All Skillzz,realm=NA,application-id=3ErqAdtq,discussion-id=Xs9xf62g,comment-id=00000000,timestamp=2019-01-01T07:05:32.224+0000)\n>\n> i mean do you not know the hidden power in duskblade??? the damage is not what im talking about, im talking about the other broken ass passive that allows free clearing of wards for just walking near one. it literally removes all counterplay you have to a fed player cause they will clear your wards and either wait in that bush to gib someone or come back later, not to mention there is always 2-3 of these stupid things in 1 game. it makes preventing ambushes almost impossible.\n\nSo then remove that ability as well? Or increase the cooldown of that passive in general? Duskblade currently has I think a 90sec cd for that passive. Not to mention, you get only what? One ward from the passive? By this point, you might as well complain about Sweeper and demand that be removed because you can get rid of multiple wards with that.","replies":[{"poster":"Yago","date":"2019-01-01T09:27:42.148+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Ranmaru Kurosaki,realm=NA,application-id=3ErqAdtq,discussion-id=Xs9xf62g,comment-id=000000000000,timestamp=2019-01-01T08:31:00.695+0000)\n>\n> So then remove that ability as well? Or increase the cooldown of that passive in general? Duskblade currently has I think a 90sec cd for that passive. Not to mention, you get only what? One ward from the passive? By this point, you might as well complain about Sweeper and demand that be removed because you can get rid of multiple wards with that.\n\nEven when it is on CD it tells you when the enemy team can see you.","replies":[]},{"poster":"Lord Malpercio","date":"2019-01-01T13:35:17.501+0000","up_votes":4,"down_votes":0,"body":"I can honestly get 2-3 wards with the passive","replies":[]}]}]}]},{"poster":"GFREEMEN","date":"2019-01-01T09:21:12.981+0000","up_votes":13,"down_votes":8,"body":"And this one {{item:3124}}","replies":[]},{"poster":"Wetter Ramen","date":"2019-01-02T19:48:10.486+0000","up_votes":4,"down_votes":0,"body":"Anyone remember when it was basically just Zed's passive... haha... wtf was riot thinking","replies":[]},{"poster":"the shy top","date":"2019-01-02T00:33:10.797+0000","up_votes":5,"down_votes":1,"body":"They removed banner of command cos it couldnt be balanced. Just remove duskblade it really isnt that hard.","replies":[]},{"poster":"dafrog1","date":"2019-01-03T18:55:31.866+0000","up_votes":3,"down_votes":0,"body":"You realize you haven’t actually given a viable reason. Your personal vendetta against Assassins doesn’t mean they need to get gutted heck it’s arguable most Assassins need a buff","replies":[]},{"poster":"Naalith","date":"2019-01-01T10:06:04.828+0000","up_votes":8,"down_votes":6,"body":"Meh, I don't hate duskblade that much. I know everyone hates it but I think it's about the overtuned mid laning assassins rather than the item itself. I think {{item:3095}} {{item:3124}} are worse items for game balance in their own right. I'm okay with Duskblade being an upfront damage burst item for an upfront damage burst class... which is why Stormrazer is shit design since it's made for AD's and should be more about sustained damage.","replies":[{"poster":"Illabethe","date":"2019-01-01T10:35:27.344+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Naalith,realm=NA,application-id=3ErqAdtq,discussion-id=Xs9xf62g,comment-id=0004,timestamp=2019-01-01T10:06:04.828+0000)\n>\n> Meh, I don&#x27;t hate duskblade that much. I know everyone hates it but I think it&#x27;s about the overtuned mid laning assassins rather than the item itself. I think {{item:3095}} {{item:3124}} are worse items for game balance in their own right. I&#x27;m okay with Duskblade being an upfront damage burst item for an upfront damage burst class... which is why Stormrazer is shit design since it&#x27;s made for AD&#x27;s and should be more about sustained damage.\n\nThe current Guinsoo's really isnt that bad. They nerfed it just enough in the post season imo. It's no longer a stat stick, which was its primary problem. Now.... it's just an alternative penetration source with small base stats and attack speed. That's manageable.","replies":[{"poster":"Infernape","date":"2019-01-01T11:46:11.396+0000","up_votes":4,"down_votes":1,"body":"As long as it has the phantom hit passive, it will always be  a stat check item. Especially as it enables champs like Yi to stat check harder.","replies":[{"poster":"LTK KoRo","date":"2019-01-01T13:42:32.394+0000","up_votes":4,"down_votes":1,"body":"Also Phantom Hit breaks champions which rely on X hit passives (Examples: Vayne, Gnar)","replies":[{"poster":"Mc Raton","date":"2019-01-01T15:09:22.611+0000","up_votes":5,"down_votes":2,"body":"> [{quoted}](name=LTK KoRo,realm=EUW,application-id=3ErqAdtq,discussion-id=Xs9xf62g,comment-id=0004000000000000,timestamp=2019-01-01T13:42:32.394+0000)\n>\n> Also Phantom Hit breaks champions which rely on X hit passives (Examples: Vayne, Gnar)\n\nVayne is the best exemple. Two item power spike is not okay. Blade of ruined king + Guinsoo's Rageblade.","replies":[{"poster":"Ragnaveil","date":"2019-01-01T21:13:47.456+0000","up_votes":2,"down_votes":0,"body":"Now, if her W was changed to be healthier, it would be tolerable. But meh, who cares about this % max health true damage that makes anyone who buys one health item beg for forgiveness.","replies":[]}]}]}]}]}]},{"poster":"Bladerunner7777","date":"2019-01-03T06:49:43.960+0000","up_votes":2,"down_votes":0,"body":"Bold claim you got there\n\n>stop buffing the champs who abuse this item an delete it permantly and gut kha zix, zed, talon, rengar, kayn and everyone else who abuses it.\n\nuh oh, shitter alert","replies":[]},{"poster":"GodlyBane","date":"2019-01-03T03:47:45.655+0000","up_votes":2,"down_votes":0,"body":"Your blaming all your shit on duskblade. But hey lets just forget the fact that it wasnt even that impactful at 300 fucking damage. Lets pretend like dark harvest and electric and all thkse high ass damage runes arent the problem. Lets fuck AD assasins even more, good idea","replies":[]},{"poster":"Inkling Commando","date":"2019-01-03T00:38:54.004+0000","up_votes":2,"down_votes":0,"body":"without even reading it I legit thought this was another person crying over {{item:3095}}","replies":[]},{"poster":"Somebody Love Me","date":"2019-01-02T21:52:24.895+0000","up_votes":2,"down_votes":0,"body":"The moment duskblade was introduced, everything went downhill for me at least.\n\n\nFrom everyone and their mother using armor pen, to the assassin rework, to lethality buffs/meta, to the duskblade rework/second lethality meta, to runes reforged/third lethality meta, to stormrazor, to now.\n\n\nEver since duskblade became a thing I've been having less and less fun with the game and it's been more and more about one shots.","replies":[]},{"poster":"Cutey eGirl owo","date":"2019-01-02T20:10:13.102+0000","up_votes":2,"down_votes":0,"body":"NERF ASSASSINS,\n\nBUT DON'T CREATE A TANK META\n\nNERFS TANKS,\n\nBUT DON'T CREATE AN ASSASSIN META\n\nREVERT CRIT, \n\nBUT DON'T CREATE A TANK META\n\nBRING BACK DFG\n\nBUT DON'T MAKE MAGES OP AGAIN","replies":[]},{"poster":"gabetheguy","date":"2019-01-02T19:22:22.149+0000","up_votes":2,"down_votes":0,"body":"riot bad. damage bad. upboat please.","replies":[]},{"poster":"WeaselRune","date":"2019-01-01T22:52:28.260+0000","up_votes":2,"down_votes":0,"body":"Its not the item....\n\nIts the _**mentality**_ that designed, tested, and said \"This should be in the game.\"\n\nIf we could get them to remove the toxic design mentality, then the items will go away on their own.\n\n{{item:3147}} isnt the problem, its a symptom.","replies":[]},{"poster":"Zed genius","date":"2019-01-01T18:58:02.189+0000","up_votes":2,"down_votes":0,"body":"I wish they would just revert all the armor pen changes they did in the \"Assassin Update\" or whatever they called it","replies":[]},{"poster":"Eldeazar","date":"2019-01-01T12:33:15.545+0000","up_votes":2,"down_votes":0,"body":"I knew it was duskblade before opening the thread. Yup, that item is quite something...","replies":[]},{"poster":"Meany Sting","date":"2019-01-01T19:36:49.258+0000","up_votes":3,"down_votes":1,"body":"Sorry but I'm kind of tired of half assed threads.\n\nSO here is a counter argument you should see. If zed rushes rushes duskblade, and you rush zhonyas you will counter zeds  early with seekers armguard. Complete zhonyas not only counters passive of duskblade,  but also counters zeds ulti with its active. \nBOTH give CDR, stats to counter enemy laner and are  good items in the lategame as well.\n\nSo what does seem to be the problem?\nWell in my opinion people almost stoped counterbuilding and unless you are bruiser or juggernauts people just don't buy items to counter their counterparts.\n\nEveryone just rushes their damage and mages just go for their ludens,  some irelias just go for sheen when they allready can't survive a full combo from enemy lane etc. Even if tanks suck at the moment a little bit of resistances or hp help, and some people need to understand your counter play does not necessarily  come from your skill set, but from your build options. If your champ can counter enemy lane by buying 1 item, it is counter play and you need to use it","replies":[]},{"poster":"13900 BE extra","date":"2019-01-01T11:34:51.318+0000","up_votes":7,"down_votes":12,"body":"***","replies":[{"poster":"xDelightifyx","date":"2019-01-01T12:23:19.363+0000","up_votes":8,"down_votes":3,"body":"akali shroud.","replies":[{"poster":"LTK KoRo","date":"2019-01-01T12:24:48.209+0000","up_votes":6,"down_votes":4,"body":"AoE","replies":[{"poster":"Tobykachu","date":"2019-01-01T13:27:44.344+0000","up_votes":3,"down_votes":3,"body":"The number of AoE abilities that cover the range of her shroud is almost non existent. Realistically, which abilities give you a good chance of hitting her?","replies":[{"poster":"Lord Malpercio","date":"2019-01-01T13:33:07.210+0000","up_votes":2,"down_votes":1,"body":"{{champion:3}} Lock this dude, go to whatever lane Akali does - proceed to make her cry.","replies":[{"poster":"Tobykachu","date":"2019-01-01T16:48:03.573+0000","up_votes":3,"down_votes":1,"body":"True, but is one champion really an adequate amount of counters?","replies":[]}]}]}]}]}]}]}