{"poster":"Team88 LePen","date":"2018-08-06T20:42:07.183+0000","title":"Account leveln","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey!\r\nIch suche Mitspieler f&uuml;r ein paar entspannte Normals, bin momentan lvl 25. Teamspeak w&auml;re gut.","replies":[{"poster":"Don Brando","date":"2018-08-06T20:53:29.675+0000","up_votes":2,"down_votes":0,"body":"Team88 LePen... Ähm, NEIN!","replies":[{"poster":"Team88 LePen","date":"2018-08-07T00:10:03.959+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Don Brando","date":"2018-08-07T08:43:13.725+0000","up_votes":3,"down_votes":0,"body":"Willst du nun, dass ich erkläre, was ich schrieb? Oder soll ich mich fernhaften, wankelmütiges Wesen?\n\nIch werde darauf antworten, zum einen, weil du dies vorangestellt hast und es dir somit wohl wichtig ist. Da du nicht darauf hingewiesen hast, dass eine Fehlanzeige nicht nötig ist, hab ich mich vorsorglich abgemeldet. Ich finde nichts, was daran anstößig wäre.\n\nGanz im Gegensatz zu dem was du geschrieben hast. Nur weil ich deine Anfrage nicht positiv beantworte, bin ich anormal, wozu mich eine besondere Art der Behinderung gemacht hat. Sehr interessant.\n\nJemand wie du, der sich bewusst für einen solchen Beschwöreramen entschieden hat, steht diese Art der Empfindlichkeit überhaupt nicht. Wer bei einem kleinen Pieks quiekt wie eine Sau kurz vorm Schlachten, sollte dann vielleicht weniger polarisieren wollen?\n\nZum zweiten antworte ich deshalb, weil mir diese achso coole 88 Scheiße ziemlich gegen den Strich geht. Also nein, ich werde mich in Zukunft nicht von deinen Anfragen fernhaften.\n\nDas ist nämlich das Schöne an der Toleranz. Hat nichts mit toll finden zu tun, sondern mit „aushalten“. Du mich und ich dich. You know O_o","replies":[{"poster":"Team88 LePen","date":"2018-08-07T11:26:54.030+0000","up_votes":1,"down_votes":0,"body":"Es geht nicht darum dass du meine Anfrage nicht positiv beantwortet hast, sondern darum dass du unnötigerweise deinen Komnmentar dazu abgegeben hast. Ich habe nach Leuten gesucht die mit mir spielen wollen, und  nicht nach welchen die es nicht wollen. \nMir war bisher nicht bewusst, dass eine Zahl cool sein kann, ich bin davon ausgegangen dass es einfach nur eine Zahl ist. Wenn du irgendwelche irrationalen Probleme mit einer bestimmten Zahl hast solltest du dich vielleicht mal untersuchen lassen.\nÜbrigens finde ich es großartig wie sehr du meinen Kommentar toleriert hast, wahrscheinlich hast du ihn nur versehentlich gemeldet. Kann passieren.","replies":[{"poster":"Huiiiiiiiiiiiii","date":"2018-08-07T12:26:05.023+0000","up_votes":2,"down_votes":0,"body":"Nunja, die 88 deutet nunmal auf einen weit verbreiteten Gruß aus der Nazi-Zeit hin. Da LePen nun auch nicht unbedingt dem linken Flügel zuzuordnen ist, kann man in etwa auf eine entsprechende politische Gesinnung schließen.\n\nIch möchte mit solchen Leuten auch nichts zu tun haben, weshalb mein Beitrag somit ebenfalls Offtopic ist. Hierfür entschuldige ich mich.","replies":[]},{"poster":"Don Brando","date":"2018-08-07T15:27:37.485+0000","up_votes":1,"down_votes":0,"body":"Wer in einem Spieleforum postet, muss davon ausgehen, dass sich unter einem Thema Leute zu Wort melden, die das Spiel auch spielen. Diese Beiträge können dem dann, unter anderem, positiv oder negativ gegenüberstehen. Manche setzen sich mit dem Thema auch gar nicht auseinander. Was dann wohl in Richtung Trollbeitrag geht. Ich fand es sehr nötig dir meine Ablehnung mitzuteilen. Somit ist doch die Relevanz gegeben.\n\nWenn du behauptest davon auszugehen, hier nur einfach eine Zahl für deinen Beschwörernamen zu gebrauchen, dann ist das halt sehr dünn. Zumal du später zugibst, dass sie einen Bezug zu deinem Geburtsjahr herstellen soll. Würde es wenigstens Team1988 heißen, ok. Aber so wie es hier steht, ist es im geringsten Fall deine Art zu provozieren, dann steh dazu und halte es aus. Oder es ist deine Überzeugung. Dann hast du hier aber nichts verloren.\n\nZudem weiß ich nicht, warum du mir immer nahelegst mich in ärztliche Behandlung zu begeben. Nur weil ich von deiner Meinung abweiche, muss es mir doch nicht so schlecht gehen ;)\n\nWenn ich Kommentare melde, dann stehe ich übrigens auch dazu. So wie bei dem obigen. Da du in deinem gelöschten Beitrag gefordert hast, ich sei aufgrund einer besonderen Behinderung nicht ganz normal und bedürfe deshalb einer Behandlung, hab ich es gemeldet. Das ist diskriminirend und hat nicht im Mindesten etwas mit Toleranz zu tun.\n\nIronisch ist, dass die massenhafte (Zwangs-)Behandlung \"von der Norm Abweichender\" **mehrmals** in der Geschichte versucht und durchgeführt wurde. Gebracht hatte es nichts. Aber es ist natürlich einfacher als sich mit dem Gegenüber auseinanader zu setzen.\nVerstehe ich.","replies":[]}]}]}]}]}]}