{"poster":"Kostenlos0815","date":"2015-12-11T22:55:03.289+0000","title":"Komisches Spielverhalten im Modus Aram und TT","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":1,"body":"Hallo zusammen,\r\n\r\nmir ist in den kommenden Wochen verst&auml;rkt aufgefallen, das in den beiden oben genannten Modis relativ viele...komische Mitspieler auftauchen. Die Eigenheiten zeigen sich wie folgt auf: \r\n\r\n- Starten das Spiel erst nach 5-10 Minuten\r\n- Laufen direkt am Anfang direkt unter dem Tower...der Gegner wird nat&uuml;rlich &uuml;berhaupt nicht beachtet\r\n- Items...braucht man nicht\r\n- Laufen alleine in die gegnerische Gruppe rein\r\n- Greifen in Teamfights die Minions an\r\n\r\nNat&uuml;rlich hat jeder mal einen schlechten Tag, und jeder macht Fehler. Aber das ganze Spiel &uuml;ber den gleichen Mist zu machen ist schon seltsam.\r\nUnd nein, es gab vorher kein geflame oder sonstiges. Mir kommt es fast so vor als w&auml;ren die Spieler von einer schlechten KI gesteuert.\r\n\r\nHat jemand &auml;hnliche Erfahrungen gemacht?","replies":[{"poster":"Metalmonni","date":"2015-12-13T11:53:35.448+0000","up_votes":2,"down_votes":0,"body":"Sehe so etwas manchmal in botgames. Ich bin sehr froh, dass es mittlerweile einen Reportgrund für Drittanbieterprogramme gibt, früher hab ich diese Spieler immer direkt beim Support gemeldet.","replies":[]},{"poster":"p0nki3","date":"2015-12-12T21:22:31.034+0000","up_votes":2,"down_votes":0,"body":"Das kommt aber auch in 3 vs 3 Normal vor. Da laufen auch solche rum. Die Spielen einfach nur wie Bots.","replies":[]},{"poster":"Lagbeard","date":"2015-12-11T22:58:00.282+0000","up_votes":2,"down_votes":0,"body":"Bisher nicht. Aber an deiner Stelle würde ich es einfach melden, entweder unter vorsätzlichem Feeden oder wegen Bot/Drittanbieterprogramm. Der Support überprüft das ganze dann und kümmert sich darum.","replies":[]},{"poster":"Im a Papaya","date":"2015-12-11T22:57:27.236+0000","up_votes":2,"down_votes":0,"body":"Das sind Bots zum Account farmen damit man einen Account verkaufen kann oder in der Hinterhand hat bei nen bann","replies":[{"poster":"N1ngendo","date":"2015-12-11T23:49:15.934+0000","up_votes":1,"down_votes":0,"body":"Jo das stimmt. Freundin hat nen Level 7 Account und da sieht man das besonders im Dominion sehr oft. \nEinfach melden für Betrug und weiterspielen anders geht es nicht","replies":[]}]},{"poster":"thecrazykangaroo","date":"2015-12-14T19:28:01.154+0000","up_votes":1,"down_votes":0,"body":"Sind das mehr geworden? Hatte gleich 2 solche spiele (5v5 Botgame) mit meinen kleinen Bruder zusammen auf dem Smurf. Das tut mir echt leid für die ganzen Anfänger die keinen dabei haben der sie gegen solchen feeder durchbringt.","replies":[{"poster":"Mephisto70","date":"2015-12-31T20:01:52.613+0000","up_votes":1,"down_votes":0,"body":"Ich beobachte derartiges Verhalten an manchen Tagen bei bis zu 4 oder 5 Runden. Neulinge alleine (welche das Spiel gerade frisch anfangen) haben's extrem schwer ein 9v1 zu schaffen. Weil man ständig auf zwei Lanes \"aufpassen\" muß (meist  Bot und Top zugleich).\nAn dem oben beschriebenem Verhalten kann man die recht gut erkennen. Meist \"versammeln\" die sich Mid, manchmal rennen die aber auch gleich wie Lemminge in den feindlichen Tower {{summoner:3}} \nMeist erkennt man's auch schon vorher am Namen (nicht  immer aber sehr häufig). Ebenso daran das ALLE meist maximal Lvl5-8 sind (sieht man aber erst am Ende der Runde). Was ich besonders \"lustig\" (Achtung Ironie) finde ist manche können sogar schreiben: \"Frozen\" oder \"push\" mehr kommt von denen niemals :D Oder sie pingen den Nexus vom Gegner gleich zu beginn an *Facepalm*\nIch glaube das dies Verhalten jeder schon beobachtet hat, würde mich doch sehr wundern wenn nicht :D","replies":[]}]}]}