{"poster":"S0NSTAR","date":"2015-12-15T23:41:56.566+0000","title":"Can the ARAM format be changed already?","subforum":"Gameplay","up_votes":214,"down_votes":15,"body":"Personally, playing ARAM is the most fun part about this game as I&#039;ve gotten burnt out from playing ranked, but it feels like I&#039;m being punished for playing it too much. What I mean by that is that I&#039;m matched with all ARAM accounts now. I see the same OP ARAM champs in every single game I play and games are so stompy. I&#039;m fine with losing ARAMs because sometimes it&#039;s not under our control, since it is supposed to be &quot;all random&quot;, but it&#039;s not random. It&#039;s a bunch of accounts, with OP champs on there, who get a pick of the litter of an abusive champ in ARAM. So, why can&#039;t every champion be unlocked,  and have &quot;All Random, All Mid&quot; be truly random? Am I missing something here? I&#039;m fed up with it at this point and cannot see how the negatives of this be worse than what ARAM is now.\n\nEdit: I've read all your comments and I appreciate the discussion going on here. Unlocking all of the champions may be a little too drastic, or maybe not, but I personally like the idea. In the end, I do think there needs to be some sort of change, whether or not my proposed idea is that change. Some people are worried about getting champs they're unfamiliar with, but isn't it just as likely that the enemy team will get champions they're unfamiliar with too? I personally think it's okay if, in some games, you get an unfamiliar champ because at least it's TRUELY RANDOM. Bite the bullet and move on. That's just my two cents; Keep this going so hopefully someone from Riot can reply on this topic :)","replies":[{"poster":"58738074DEL1","date":"2015-12-15T23:44:40.708+0000","up_votes":119,"down_votes":2,"body":"***","replies":[{"poster":"It Hertz When IP","date":"2015-12-16T01:13:48.707+0000","up_votes":50,"down_votes":2,"body":"This has been suggested before. Someone brings it up, the army of ARAM smurfs starts spewing BS reasons as to why they should be able to continue cheating the system, and Riot never pays attention because any mode other than Summoner's Rift classic mode is left by the wayside to be forgotten.","replies":[{"poster":"ChaoticPinecone","date":"2015-12-16T01:21:59.609+0000","up_votes":2,"down_votes":47,"body":"Its not BS, nor is it cheating the system.\n\nI have all champions unlocked. I play mostly ARAM - 1309 wins and 1258 losses. The champ select is NOT random, because if it was, you would see mirror matches from time to time. I dont think ive seen a mirror since the early days.","replies":[{"poster":"Penguin Eclipse","date":"2015-12-16T01:59:28.687+0000","up_votes":24,"down_votes":0,"body":"> [{quoted}](name=ChaoticPinecone,realm=NA,application-id=3ErqAdtq,discussion-id=KjtxHta2,comment-id=000100010000,timestamp=2015-12-16T01:21:59.609+0000)\n>\n> Its not BS, nor is it cheating the system.\n> \n> I have all champions unlocked. I play mostly ARAM - 1309 wins and 1258 losses. The champ select is NOT random, because if it was, you would see mirror matches from time to time. I dont think ive seen a mirror since the early days.\n\nMirror matches were intentionally disabled. They came back in a patch as a bug about a year ago.","replies":[]},{"poster":"TurquoiseYoshi","date":"2015-12-16T02:06:44.355+0000","up_votes":9,"down_votes":0,"body":"Okay, so other than mirrors not being there (intentionally), what proof do you have that it's not random?","replies":[{"poster":"ChaoticPinecone","date":"2015-12-16T04:08:07.245+0000","up_votes":3,"down_votes":16,"body":"because if mirrors are disabled its not random 5 champs for your team","replies":[{"poster":"TurquoiseYoshi","date":"2015-12-16T04:24:38.574+0000","up_votes":9,"down_votes":0,"body":"With that exception, what else is there? You seemed to imply that it was completely non-random, but only really have one reason.","replies":[]},{"poster":"Sire Hippington","date":"2015-12-16T18:34:46.834+0000","up_votes":2,"down_votes":0,"body":"Just because the events are mutally exclusive(meaning no champ appears more than once in this case), does not mean it's not random....\n\n","replies":[{"poster":"ChaoticPinecone","date":"2015-12-16T21:39:42.757+0000","up_votes":2,"down_votes":2,"body":"I think you need to read the definition of mutually exclusive and random in terms of statistics (which this is, since it is supposedly \"random\" as pulling numbers out of a hat). \n\nAnd my point is that RIot already screwed with what \"random\" means. Random could mean what the community meant it to mean (as ARAM is a community creation) as to a randomly chosen champion on your team. Or you can do what Riot did and add limitations. \n\nOnce the limitations are in, then its no longer a simple random sample. And as its no longer a simple random sample, you can limit the champions that will be picked to the ones the player owns, and it will still be considered \"random\". Once you stop using a simple random sample, you can stratify the picks however you want and call it a random sampling with X limitations - which is what Riot did.","replies":[{"poster":"Delioth","date":"2015-12-17T04:26:03.397+0000","up_votes":2,"down_votes":0,"body":"Are you implying that picking numbers out of a hat without replacing them isn't random?","replies":[]},{"poster":"Sire Hippington","date":"2015-12-17T00:04:18.545+0000","up_votes":2,"down_votes":0,"body":"i'm not native englishspeaking, so i might lack the right wording here i guess, as normally mutually exclusive would mean you can get A **or** B, but not both at once...\n\nHowever, what i meant is, useing the pulling numbers out of a hat as example, the current system does not throw numbers back in a fter they have been pulled, which is why i added the part in () to hopefully make my point clear.\n\nhowever, just because the stochastic formula changes a bit makes it no less random. And even with mirrormatches it still wouldn't be the 'simple random sample', as it still is limited to each champ only once per team.\nFor the 'simple random sample', it needs to also to be possible of haveing the same champion multiple times per team, which would mean a potential one for all, even if the chances are incredible low.\n\nHowever you're right in that drawing from the full champ pool would not make it 'more randome' or 'truely random'.\nIt still is a good idea to let it draw from the full pool, as it would no longer be biased based on individuel champion pools.\n\nUseing the very simplified model of 'pulling numbers out of a hat' for current aram, people draw numbers out off different hats that contain different numbers, and if we asume that the 'win' condition is getting the highest number, those that have a higher average in their respective hat do have a higher probabillity of winning.\nTo asure that the odds are equall amongst all participants, they all need to draw from the same hat, and if you want to go the full way, then either they do that smiultanously or the number gets thrown back into the hat","replies":[]}]}]}]}]}]},{"poster":"revliledpembroke","date":"2015-12-16T01:57:19.275+0000","up_votes":2,"down_votes":23,"body":"What BS reasons might those be? \"Oh, I don't want to play a character I have never seen before!\" Totally bullshit.","replies":[{"poster":"Penguin Eclipse","date":"2015-12-16T02:02:51.245+0000","up_votes":14,"down_votes":3,"body":"> [{quoted}](name=revliledpembroke,realm=NA,application-id=3ErqAdtq,discussion-id=KjtxHta2,comment-id=000100010002,timestamp=2015-12-16T01:57:19.275+0000)\n>\n> What BS reasons might those be? \"Oh, I don't want to play a character I have never seen before!\" Totally bullshit.\n\nIf you have never seen a particular champion before then ARAM might be the place to learn, no?","replies":[{"poster":"revliledpembroke","date":"2015-12-16T02:16:49.896+0000","up_votes":3,"down_votes":25,"body":"No. Not in a team wide capacity with people you don't know and can't account for any sort of team wide strategy. I like learning my champs in custom bot games until I feel sure I have he mechanics down. Being thrown to the proverbial sharks is not my idea of a good learning experience. It's a feeding frenzy.","replies":[{"poster":"Penguin Eclipse","date":"2015-12-16T02:19:25.326+0000","up_votes":20,"down_votes":4,"body":"> [{quoted}](name=revliledpembroke,realm=NA,application-id=3ErqAdtq,discussion-id=KjtxHta2,comment-id=00010001000200000000,timestamp=2015-12-16T02:16:49.896+0000)\n>\n> No. Not in a team wide capacity with people you don't know and can't account for any sort of team wide strategy. I like learning my champs in custom bot games until I feel sure I have he mechanics down. Being thrown to the proverbial sharks is not my idea of a good learning experience. It's a feeding frenzy.\n\nYou really miss the point of ARAM.","replies":[{"poster":"revliledpembroke","date":"2015-12-16T02:31:45.161+0000","up_votes":2,"down_votes":15,"body":"It's having fun, right? I bet it's having fun. And I most emphatically do NOT have any fun trying to work out complicated mechanics of champions I have no idea how to play. This is at least one reason why the rerolls and champion switching exist. So I (he who tends to favor mages and tanks over every other group) don't end up with Leblanc and become a traveling pot of gold for the enemy team to find. I am awful at just about every assassin I try and I don't have fun with them either. Just about Smite's Mercury and League's Shaco and Master Yi are the only assassins I am moderately decent with.","replies":[{"poster":"RIP Tahm Kench","date":"2015-12-16T02:36:55.912+0000","up_votes":8,"down_votes":3,"body":"And so we're doing you a favor then because you will be able to swap with absolutely anyone if you roll a champion you don't play. The worst feeling as someone who owns all champs in the game is zero rerolls, and nobody else owns my champ (but I man up and deal with it because it's the point of aram).","replies":[{"poster":"Dllesh","date":"2015-12-16T15:37:04.152+0000","up_votes":4,"down_votes":0,"body":"i just wanted to mention someone owning the same champ as you and having the ability to switch does not mean they will...\n\nand i agree, the point of this game, aram or otherwise is fun","replies":[]}]}]}]}]}]}]},{"poster":"S0NSTAR","date":"2015-12-16T01:23:31.936+0000","up_votes":7,"down_votes":1,"body":"Yeah, I was trying to think of the possible reasons as to why they wouldn't want to implement this. The only reason I could come up with is that they don't care about ARAM. You're supposed to get random champs on ARAM, whether you know how to play them or not. There's no excuse not to change it.","replies":[{"poster":"Migrañaboy","date":"2015-12-16T18:09:44.675+0000","up_votes":3,"down_votes":0,"body":"It's lie they don't care, it's just that it may hurt the business model if they unlock all champions. After all, f2p games partly profit from people's impatiente.","replies":[{"poster":"Sire Hippington","date":"2015-12-16T18:43:49.809+0000","up_votes":3,"down_votes":0,"body":"Who says i hurts their profit? After all, if someone gets a champ he didn't play befor in aram and finds him fun, chances are that he wants the champ and buys it.\nIt's prettymuch like the free weak champs, you can get a test ride, but not more, as you're not ensured to get the champ in your next games.","replies":[]}]}]}]},{"poster":"Stillname","date":"2015-12-16T17:12:19.697+0000","up_votes":5,"down_votes":0,"body":"That actually ruins the game mode for a vast majority of the players who play it just for fun. They don't like getting champions they haven't bought because they don't like playing them.\n\nI am actually way more sick of people dodging because they didn't get the team comp they wanted. There should be a more severe punishment if someone dodges and a reward if you are in a game that was dodged.\n\nCould take away their rerolls if they dodge and give rerolls to the people who aren't in a party with the dodger as if they had just played an aram.","replies":[{"poster":"cuddlykitten4","date":"2015-12-16T17:26:15.152+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Stillname,realm=NA,application-id=3ErqAdtq,discussion-id=KjtxHta2,comment-id=00010004,timestamp=2015-12-16T17:12:19.697+0000)\n>\n> That actually ruins the game mode for a vast majority of the players who play it just for fun. They don't like getting champions they haven't bought because they don't like playing them.\n> \n> I am actually way more sick of people dodging because they didn't get the team comp they wanted. There should be a more severe punishment if someone dodges and a reward if you are in a game that was dodged.\n> \n> Could take away their rerolls if they dodge and give rerolls to the people who aren't in a party with the dodger as if they had just played an aram.\n\nYou couldn't do the reward for staying because it would be abused by party ques.","replies":[{"poster":"Stillname","date":"2015-12-16T17:45:32.737+0000","up_votes":4,"down_votes":0,"body":"Yeah as I mentioned in the last sentence it would have to reward only people who aren't in a party with the dodger.","replies":[{"poster":"cuddlykitten4","date":"2015-12-16T18:05:37.972+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Stillname,realm=NA,application-id=3ErqAdtq,discussion-id=KjtxHta2,comment-id=0001000400000000,timestamp=2015-12-16T17:45:32.737+0000)\n>\n> Yeah as I mentioned in the last sentence it would have to reward only people who aren't in a party with the dodger.\n\nI will admit that that is a solution to that part, but I still fear that it might breed a situation where people (party ques but not exclusively to them) try to harass people into dodging. I've seen it in ranked a lot. Someone will take something like top tristana so two or three people will verbally abuse that individual to no end in an attempt to make them dodge. It doesn't always work, but that person still shouldn't have to endure through that. Other than that, I fully back your idea. I just fear that those two types of situations could get out of hand. Then again, players are gonna find a way to hate on each other if they're wanting to spread some hate so there's not really any finite way to fix it so I say LET'S DO THIS SHIT!!! :D lol. Also, I find it notable that you're response contained zero hatred and flaming, and provided a logical counterpoint to what I said while not trying to force me out of the conversation. You, good sir, are the kind of player that we need more of. I value your opinion, and thank you for sharing it with me. You made my day with something as small and simple as that :)","replies":[]}]}]}]},{"poster":"S0NSTAR","date":"2015-12-15T23:45:26.044+0000","up_votes":7,"down_votes":2,"body":"God bless you.","replies":[]}]},{"poster":"Saianna","date":"2015-12-16T01:41:23.137+0000","up_votes":26,"down_votes":2,"body":"SoNSTAR, Every True-ARAM-fan agrees with you. This idea has been posted countless of times, really.\nThe first one came in about 20 minutes after update bringing ARAM (that fast).\n\nProblem is: Riot does NOT want to make ARAM truly random, because they'd lose money from players who buy champions via real money (that's it). There are lots of ARAM-only accounts with at least few champions bought using real cash. Riot doesn't want to lose this unfortunately :/\n\nP.S.\nAs someone with about 4-5k games played in ARAM (and about 700 custom-ARAMs) I agree with you 101% :)","replies":[{"poster":"Wimbledofy","date":"2015-12-16T23:28:23.466+0000","up_votes":1,"down_votes":0,"body":"Wow nice way of trying to generalize everyone. So if someone disagrees they somehow arent a true aram fan?","replies":[{"poster":"Saianna","date":"2015-12-17T00:01:00.029+0000","up_votes":3,"down_votes":0,"body":"For that one has to know what ARAM means first.\n\nWhich is:  **ALL RANDOM all mid**\n\nIf you disagree on all random part, then tell me, how can you be called a true fan of ARAM?\n\n---\nJust to clear possible misunderstanding:\nPlayers with ARAM-only account with most OP champions for this gamemode rely only on \"all mid\" aspect, as they have already abused sorry excuse of a \"all random\" system.\n\nYou could still enjoy \"all mid\" part, really. In customs there's possible to play ARAM map with draft/blind pick (which isn't ARAM mode). But if you start an ARAM game modewith random champion generator, then you should consider abiding to the \"all random rules\", which in turn makes you a true-ARAM fan :)","replies":[]}]}]},{"poster":"Chrome Raven","date":"2015-12-15T23:44:40.349+0000","up_votes":25,"down_votes":2,"body":"theres a new standard for how low some people are. trolls/intent feeders are low. but to make an account specifically for a gamemode with the most broken champions is just beyond pathetic. i am DISGUSTEEEEEEEEEEEEEEDDDDDDD","replies":[]},{"poster":"Ch0c0lateJesus","date":"2015-12-16T07:13:41.458+0000","up_votes":10,"down_votes":0,"body":"The game mode is close to being really good, but every time anyone suggests improving the balance, a bunch of tards come on the boards downvoting and saying \"who cares about aram blah blah\"\n\nI play mostly ARAM, and for one, it could really use some \"help\" with the randomisation so I dont randomly get Eve 4 out of every 10 games even though I have like 100 champs unlocked.\n\nI know that things like this can happen if the process is \"truely random\", but it shouldnt be truely random, there should be a bias toward not giving me the same champ every damn time. And also not giving the ARAM account player Varus every damn time.","replies":[]},{"poster":"TwistedInk6645","date":"2015-12-16T07:11:10.060+0000","up_votes":9,"down_votes":0,"body":"Well instead why don't they make a champ rotation of about 20 champs just for Aram only and it changes same time normal free champ rotation does, and your champ you play for that game will be picked randomly out of that 20 champions... Just an idea feel free to hate :P","replies":[]},{"poster":"DevlinCrow","date":"2015-12-16T09:43:48.969+0000","up_votes":7,"down_votes":0,"body":"Wait, people just buy the OP ARAM champs for their pool and do only ARAM?\n\nI can see why you made this post and I agree!","replies":[]},{"poster":"Pool Party Nasus","date":"2015-12-16T09:21:16.595+0000","up_votes":7,"down_votes":0,"body":"The \"I don't wanna play a champ I don't know\" logic is flawed : Champion in the free rotation can be picked in ARAM. If that's the reason behind the lack of change, there is obviously a lack of consistency from Riot on this point. \nBut the most likely reason is that they don't want to lose money, or are just too lazy to change anything in ARAM.","replies":[]},{"poster":"Dessim8","date":"2015-12-16T01:48:02.373+0000","up_votes":2,"down_votes":0,"body":"Do people prefer the random aspect or the All mid aspect?","replies":[{"poster":"Only Play Darius","date":"2015-12-16T02:14:20.443+0000","up_votes":7,"down_votes":0,"body":"They like both aspects. If you take out the random aspect you get poro king mode where you see people abusing the same exact champions every single game\n\nIf you take out the mid aspect then you end up with shitty team comps that can't all play the position they might get forced in\n\nARAM is a beautiful concept but it clearly isn't working when out of 125 champions you see Lux and Veigar every single game (often on the same team no less)","replies":[]}]},{"poster":"Drugoth","date":"2015-12-16T12:28:18.890+0000","up_votes":6,"down_votes":0,"body":"ARAM, the one game mode that PUNISHES you for having a larger champion roster.  >_>","replies":[{"poster":"League of Potato","date":"2015-12-16T16:01:36.664+0000","up_votes":3,"down_votes":0,"body":"eh i have every champ except for like 5 of them and i only get about 20 of them on a regular basis. Most of my champion pool never shows up and that's kinda shitty because I enjoy playing all of them...except for {{champion:28}} she's just bad in aram","replies":[]}]},{"poster":"LadyRenly","date":"2015-12-15T23:45:33.871+0000","up_votes":5,"down_votes":0,"body":"being able to get lux, ziggs, karma, varus jayce and xerath every game sure sounds like fun.","replies":[{"poster":"58738074DEL1","date":"2015-12-15T23:49:23.638+0000","up_votes":6,"down_votes":0,"body":"***","replies":[{"poster":"Saianna","date":"2015-12-16T01:43:16.098+0000","up_votes":3,"down_votes":6,"body":"Karthus isn't even close to be OP in ARAM.\nWhat you want isn't heavy nuke on super long CD, but spammable nukes. That's what makes enemy players scared to engage.","replies":[{"poster":"Full Brain","date":"2015-12-16T06:19:26.717+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Saianna,realm=EUNE,application-id=3ErqAdtq,discussion-id=KjtxHta2,comment-id=000200000001,timestamp=2015-12-16T01:43:16.098+0000)\n>\n> Karthus isn't even close to be OP in ARAM.\n> What you want isn't heavy nuke on super long CD, but spammable nukes. That's what makes enemy players scared to engage.\n\nYou don't know what you are talking about. His ult doesn't even really matter that isn't what makes him insane in aram. He covers the entire width of the lane with damage and a slowing wall and you can suicide charge and sit on towers while your team downs them if you have ranged adc and the other team can either die to you or let you take the tower.\n\nhttp://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2000398646/40886913?tab=overview","replies":[]},{"poster":"Only Play Darius","date":"2015-12-16T02:28:11.675+0000","up_votes":3,"down_votes":0,"body":"To be fair, since you can't heal at your fountain champions are often forced to walk around with low HP for extended periods of time, Karthus likes that. Same reason {{champion:55}} gets the most braindead pentakills in that mode","replies":[{"poster":"Saianna","date":"2015-12-16T03:21:47.847+0000","up_votes":2,"down_votes":1,"body":"Problem is about his CD on R.\nThat's why champions like EZ or Lux are better for finishing off low hp targets hiding behind turrets.","replies":[{"poster":"21028037DEL1","date":"2015-12-16T07:41:43.374+0000","up_votes":3,"down_votes":0,"body":"If you are Karthus and waiting around for your ultimate to finish off people in ARAM, you're playing him wrong.\n\nKarthus in ARAM is:\n-Build only pure AP dmg and Magic Pen items (cdr not necessary).\n-Snowball into enemy team (even if under tower, better if you can stay just out of range of it)\n-Feel free to die. Just start spamming spells and damaging the enemy. \n\nSince the enemy cannot heal at base in this game mode, the damage sticks. As Karthus, you come back to lane with slightly better items, full health, and more damage. Most people do not balance their health pool in this game mode (a.k.a. - knowing when to die in ARAM). A lot of players will sit under their tower with less than 40% HP, sticking their head out every now and then to poke. Most champions will die doing this. Karthus loves it when people stay under turret, because he just snowballs in, dies, and then damages everyone around him.\n\nEventually, Karthus just outdamages everyone and everything (other than certain champs who poke from afar, like Lux).","replies":[]}]}]}]}]}]},{"poster":"Just Blame Jenny","date":"2015-12-16T02:54:59.668+0000","up_votes":2,"down_votes":0,"body":"{{champion:32}} {{champion:1}} {{champion:63}} {{champion:41}} {{champion:150}} {{champion:43}} {{champion:30}} {{champion:55}} {{champion:85}} {{champion:99}} {{champion:25}} {{champion:75}} {{champion:35}} {{champion:14}} {{champion:37}} {{champion:16}} {{champion:45}} {{champion:161}} {{champion:101}} {{champion:115}} {{champion:110}} \n\nLooks reasonable to me.","replies":[{"poster":"Whoandwhatever","date":"2015-12-16T03:03:12.463+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=jpersinne,realm=NA,application-id=3ErqAdtq,discussion-id=KjtxHta2,comment-id=000b,timestamp=2015-12-16T02:54:59.668+0000)\n>\n> {{champion:32}} {{champion:1}} {{champion:63}} {{champion:41}} {{champion:150}} {{champion:43}} {{champion:30}} {{champion:55}} {{champion:85}} {{champion:99}} {{champion:25}} {{champion:75}} {{champion:35}} {{champion:14}} {{champion:37}} {{champion:16}} {{champion:45}} {{champion:161}} {{champion:101}} {{champion:115}} {{champion:110}} \n> \n> Looks reasonable to me.\n\nAny OP ARAM champ list that doesn't have Fiddlesticks and Miss Fortune  in it isn't a good list. Both are stupidly powerful in ARAM.","replies":[]}]},{"poster":"Heedprime","date":"2015-12-16T20:18:41.843+0000","up_votes":3,"down_votes":0,"body":"Maybe ARAM should be truly random but give you an option to randomly pick between EVERY champion in the game, or randomly pick between every champion you own BUT require you to own 50+ champions in order to select that option.","replies":[]},{"poster":"DogIsGod","date":"2015-12-16T13:23:35.341+0000","up_votes":3,"down_votes":0,"body":"ARAM should randomly select out of **all the champions, skins and summoner spells**. I think it'd be pretty damn fun.","replies":[]},{"poster":"Spoofghoul","date":"2015-12-16T12:51:25.446+0000","up_votes":3,"down_votes":0,"body":"Some ppl just want to play all mid and leave the all random out of it so they make aram smurfs.\n\nThe main problem with this is that these people are playing their own all mid game in other peoples all random all mid games.\n\nToo fix this two things need to happen.\n\n1. Make ARAM truly random, all champion are unlocked and you can get any of them.\n2. Make an AM (all mid) version with champions select like the current poro king, with or without boss doesn't really matter.\n\nThen almost everyone should be happy","replies":[]}]}