{"poster":"HoneyHH","date":"2017-02-02T02:18:27.950+0000","title":"\"Malas jugadoras\"","subforum":"Comportamiento del jugador","up_votes":12,"down_votes":4,"body":"Como muchos saben en los &uacute;ltimos a&ntilde;os se ha incrementado la cantidad de jugadoras mujeres en el juego, en un 70% mas o menos seg&uacute;n las estad&iacute;sticas, ya no es raro toparse a una mujer jugando normal o ranked pero aun as&iacute; para algunos jugadores sigue siendo tema.\r\nSiempre hay dos caras de la moneda: Las que juegan bien y otras que no tanto.\r\nA lo que voy es &iquest;Por qu&eacute; a la mayor&iacute;a se les trata de mancas? Como mujer muchas veces me a tocado leer por el chat &quot;Con raz&oacute;n es mala si es mujer&quot; o &quot;No deber&iacute;as jugar manca&quot;, a la mayor&iacute;a de las mujeres se nos estigmatiza de &quot;malas jugadoras&quot; obviamente todos tenemos nuestras  partidas que desear&iacute;amos no a ver apretado el bot&oacute;n de jugar, pero &iquest;por qu&eacute; pasa esto de que gran parte de la comunidad piensa eso? Es algo que siempre me he preguntado en estos 4 a&ntilde;os que juego League of Leguends.\r\nHoy me toco en ranked experimentar por qu&eacute; muchos jugadores se quejan de las mujeres pero como les dije anteriormente siempre hay dos caras de la moneda y eso se aplica tanto para hombres como para mujeres.\r\nEsta mujer que me toco supportear en ranked era bastante flamer insoportable la verdad, tenia una muy mala conducta y absolutamente reportable por todos los t&eacute;rminos que salen! y me di cuenta que por mujeres que tienen sobre todo mala conducta en juego ya sea flameando o troleando la partida se nos cataloga de &quot;malas jugadoras&quot;\r\n&iexcl;PERO! esta la otra parte de la comunidad femenina de LOL que no abusa verbalmente ni trolea las partidas si no, que ayuda a su equipo a ganar y tener unos 20-30 min agradables.\r\nHe jugado con ambas caras la moneda para aclarar as&iacute; que les pregunto &iquest;Por qu&eacute; tener esa noci&oacute;n de malas jugadoras si solo son un grupo las que no tienen buena conducta dentro la partida?\r\nObviamente no todos piensan igual sobre la comunidad femenina de LOL! :)","replies":[{"poster":"ZanahoriaAsesina","date":"2017-02-02T02:39:52.713+0000","up_votes":9,"down_votes":0,"body":"Porque generalizar es fácil, no requiere de mucho esfuerzo, no trates de descifrar la razón porque no la hay o tal vez sí, puede que sea  falta de educación o solo copian un comportamiento que vieron en algún lado.\n\nTodos somos únicos, puede que nos comportemos de manera similar pero no somos iguales al fin y al cabo.Los que generalizan no lo entienden y hacen lo siguiente con el único objetivo de hacerte sentir menos, de que te enfades o simplemente te encasillan porque sí.\n\nSolo hay verlo como un insulto más pero menos ingenioso.\n\n>Todas las mujeres son -> [Añade adjetivo descalificativo]\nTodos los hombres son ->  [Añade adjetivo descalificativo]","replies":[{"poster":"HoneyHH","date":"2017-02-02T02:54:17.678+0000","up_votes":3,"down_votes":0,"body":"Obvio, generalizar es lo mas facil que hay para cualquier cosa y diarimente en la vida cotidiana lo podemos apreciar la verdad. Como he dicho en otros comentarios el tema para mi era de cierta manera ver por qué se pensaba así, ya sea en league of legends o en cualquier otro juego o hasta en empleos si se entiende? \nGracias por la opinion se valora!{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"ZanahoriaAsesina","date":"2017-02-02T03:26:50.572+0000","up_votes":4,"down_votes":0,"body":"> Por qué se pensaba así, ya sea en league of legends o en cualquier otro juego o hasta en empleos si se entiende?\n\n**¿Por que se encasillan a las jugadoras de toxicas?\n**\n\n Fácil, porque nos acordamos más de los malos momentos que de los buenos, y como dije antes, es más fácil y rápido el generalizar para descargarse o hacer enojar a la otra parte.\n\nSi combinamos ambas cosas, podemos llegar a la conclusión que la mayoria de los jugadores y jugadoras tienden a generalizar en base a sus malos momentos y no piensan en los buenos, por lo tanto no importa que sean **solo un grupo pequeño de jugadoras toxicas**...","replies":[]}]}]},{"poster":"Zinc","date":"2017-02-02T02:27:24.986+0000","up_votes":5,"down_votes":0,"body":"Me pregunto que causa del destino hizo que esto se ponga de moda en el foro.\n\nAmiga, nadie cree que vos o las mujeres sean mancas, creeme, nadie NADIE lo cree.\n\nPero cuando te quieren flamear todo sirve, y generalmente lo mas basico es tambien lo mas efectivo.\n\nSi en ves de tener ese nombre te llamabas \"aguanteChile\" te iban a decir que todos los chilenos son mancos, si eras \"BoliviaRules\" te iban a mandar al mar... que no tenes, si eras \"UruguayPaTodoElMundo\" los provincianos no saben jugar.\n\n\nA q quiero llegar; Al flamer le interesa hacerte sentir mal, si sos mujer o no LE CHUPA UN HUEVO.","replies":[{"poster":"Forero","date":"2017-02-02T02:38:06.111+0000","up_votes":3,"down_votes":1,"body":"Prefiero una pseudo \"moda\" para debatir que más spam de la cosa de los hoteles (hay los que tienen gracia, pero gran parte es spam puro)","replies":[{"poster":"Zinc","date":"2017-02-02T03:15:15.069+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Forero,realm=LAS,application-id=PJAKt7ph,discussion-id=cLNVuLk4,comment-id=00020000,timestamp=2017-02-02T02:38:06.111+0000)\n>\n> Prefiero una pseudo &quot;moda&quot; para debatir que más spam de la cosa de los hoteles (hay los que tienen gracia, pero gran parte es spam puro)\n\nSe, pero eso solo te vuelve parte del rebaño. Cuando estuvo de moda hablar del aborto nadie se acorde de la adopcion de menores por parte de homosexuales, y cuando se debatio por eso nadie se acordo si amamantar en publico estaba bien o no, y ahora que en Argentina salio un video de 3 minas mostrando las tetas en la playa va ser el tema de moda almenos hasta que se termine la semana, hasta q alguien se le ocurra hablar si la marihuana debe ser legal o no, y asi vamos, jugando al ping pong entre tematicas.\n\nCon la unica diferencia que los temas q yo cito si son -en mayor o menor medida- importantes o de interes general, esto de las mujeres y el LOL es una bobada y siempre lo va ser.","replies":[]}]},{"poster":"HoneyHH","date":"2017-02-02T02:42:37.439+0000","up_votes":1,"down_votes":0,"body":"Me refiero a por qué algunos, porque claramente no todos piensan igual, piensan eso. Tanto en hombres como en mujeres pasa lo de los flamers es algo muy comun pero lee la pregunta que me hice a mi misma? yo creo que por mujeres que son flamers piensan que la mayoria lo son. \na ver si se entendio ahora el punto.{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Zinc","date":"2017-02-02T03:11:48.325+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=HoneyHH,realm=LAS,application-id=PJAKt7ph,discussion-id=cLNVuLk4,comment-id=00020001,timestamp=2017-02-02T02:42:37.439+0000)\n>\n> Me refiero a por qué algunos, porque claramente no todos piensan igual, piensan eso. Tanto en hombres como en mujeres pasa lo de los flamers es algo muy comun pero lee la pregunta que me hice a mi misma? yo creo que por mujeres que son flamers piensan que la mayoria lo son. \n> a ver si se entendio ahora el punto.{{sticker:slayer-jinx-catface}}\n\nQuiza no me exprese bien, asi que voy de nuevo:\n\nEn tu post en varias frases te referis a las mujeres como un colectivo (\"Siempre hay dos caras de la moneda: Las que juegan bien y otras que no tanto.\",\"¿Por qué a la mayoría se les trata de mancas?\",\"¿por qué pasa esto de que gran parte de la comunidad piensa eso?\" por citar algunos), lo cual desde el vamos es un error. \n\nLas mujeres no juegan bien ni mal al lol, ni son buenas o malas en matematica, ni nada en absoluto. Cada cual tiene destresas individuales, puntos fuertes, debiles, gustos, etc. que las hacer perfectamente diferentes.\n\nY vos pensaras \"wow, descrubiste america pibe...\" pero lo cierto es que si, descubri america. Realmente tu percepcion de la realidad esta errada, basicamente xq nadie (o una infima cantidad de usuarios que no fueron a la escuela) piensa lo que vos expones en el post.\n\n\"¿Qué hace generalmente una mala jugadora?\"\n\nLo mismo que hace un mal jugador hombre o transexual sin ir mas lejos.\n\n¿Me explico ahora?, realmente no hay ningun fundamento valido que puedas citar para sostener tu hipotesis, xq basicamente como te vengo diciendo, cuando alguien te bardea aunque sea con cosas generales (sos chileno, sos mujer, sos gay) realmente no ataca al colectivo, solo te ataca a vos, y asi mismo no lo hace representando a un colectivo (ej po wea weon aweonao qlo malo sos mujer manca) realmente no son LOS CHILENOS, es solo un flamer cualquiera del monton.","replies":[{"poster":"HoneyHH","date":"2017-02-02T03:25:42.650+0000","up_votes":1,"down_votes":0,"body":"Quizas si este errada no lo sé es solo mi percepción y es la primera vez que saco el tema a flote en un foro! \nPrimero todos somos buenos en algo tenemos cualidades diferentes como dicen cada persona es un mundo:)\n\"¿Que hace generalmente una mala jugadora?\" y si, tambien lo hace un mal jugador.\ncomo ya sabemos todos en la comunidad hay siempre hay flamers y esas cosas.","replies":[]}]}]}]},{"poster":"ZeNch","date":"2017-02-02T04:43:42.936+0000","up_votes":3,"down_votes":0,"body":"Te respondo algo que no preguntas.\n\nel comun de las mujeres suele sufrir mayor ansiedad que el comun masculino, eso conlleva a malas decisiones tanto en objetivos como TF... como en su comunicacion con el team (se rayan mas facil, la mayoria)\n\npero hay otra cara de la moneda... hay mujeres diamantes? si y challenger seguro que tambien habra. y son mejores que todos los que estan por debajo (supuestamente) pero como los videojuegos es un ambito donde mayormente hay hombres... se dice de que hay mas hombres en elo alto o que no hay mujeres en competitivo (remilia es un caso aparte el cual es delicado de hablarlo).\n\na que voy con esto? que la mayoria habla pelotudeces viendo lo que quiere ver...\n\nes sierto que las mujeres se tiltean mas rapido (en promedio) si... pero tambien es sierto que hay mujeres que no tiltean (y hombres que si).\n\nYo la mayoria de mujeres que veo que juegan lo hacen por pelotudear, pasar el rato, como si se tratace de un candy crush... (fedeando en bronce 5 y similares). Las que se lo toman en serio son muy pocas y eso conlleva a todo lo que explicaste.\n\nDesde que salio Braum (2014 mediados) que juego lol y nunca tuve ni una restriccion de chat ni NADA, a pesar de haberme excedido a en situaciones limite muuuuuy rara vez, no soy santo pero lo intento.","replies":[{"poster":"Ellora","date":"2017-02-02T12:03:59.144+0000","up_votes":2,"down_votes":0,"body":"Solo te voy a decir lo de remilia es puro marketing e Hype.\nNo dio la talla en competitivo ni en NA ni en LAS y siempre fue desapareciendo.","replies":[{"poster":"ZeNch","date":"2017-02-07T03:22:05.488+0000","up_votes":1,"down_votes":0,"body":"su problema es actitud y la forma en la que interactua con los compañeros pero es muy buen player","replies":[]}]}]},{"poster":"Avant Garde","date":"2017-02-02T05:12:40.572+0000","up_votes":4,"down_votes":1,"body":"Me recuerda que el otro dia jugue una ranked flex con un duo premade, Annie mid tenia 30 de farm al minuto 30. No se si era mujer, pero no podes ser tan malo farmeando.","replies":[]},{"poster":"Kyousuke","date":"2017-02-02T03:26:18.109+0000","up_votes":4,"down_votes":1,"body":"vos misma respondiste a tu pregunta\n\n>  por mujeres que tienen sobre todo mala conducta en juego\n\n.\n\n\n> ¡PERO! esta la otra parte de la comunidad \n\nes exactamente lo mismo con los hombres por eso odio cuando generalizan tanto, no son las diosas del juego como para decir \"es mujer hay que respetarlas y no insultarlas\" , por ser mujer no vas a salirte sin insultos si te toca un flammer, un flammer te va a insultar seas HOMBRE, MUJER, TRANSEXUAL o una patata kawaii, los flammer no discriminan en genero y solo buscan peleas o insultar a alguien mas por sus propios errores, no es tema de la comunidad flammea a las mujeres, es LA COMUNIDAD FLAMMEA.\n\nque hace un/a mal/a jugador/a? no respetar el código del invocador","replies":[{"poster":"martincarp","date":"2017-02-02T03:31:42.100+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=yuichikun,realm=LAS,application-id=PJAKt7ph,discussion-id=cLNVuLk4,comment-id=0011,timestamp=2017-02-02T03:26:18.109+0000)\n>\n> vos misma respondiste a tu pregunta\n> \n> .\n> \n> es exactamente lo mismo con los hombres por eso odio cuando generalizan tanto, no son las diosas del juego como para decir &quot;es mujer hay que respetarlas y no insultarlas&quot; , por ser mujer no vas a salirte sin insultos si te toca un flammer, un flammer te va a insultar seas HOMBRE, MUJER, TRANSEXUAL o una patata kawaii, los flammer no discriminan en genero y solo buscan peleas o insultar a alguien mas por sus propios errores, no es tema de la comunidad flammea a las mujeres, es LA COMUNIDAD FLAMMEA.\n> \n> que hace un/a mal/a jugador/a? no respetar el código del invocador\n\nNOOO!!! No te metas con la patata kawaii!!!! D;\n{{sticker:zombie-nunu-tears}}","replies":[{"poster":"Kyousuke","date":"2017-02-02T03:33:53.477+0000","up_votes":2,"down_votes":0,"body":"http://i.imgur.com/yp7qR8L.jpg","replies":[{"poster":"martincarp","date":"2017-02-02T03:37:32.632+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=yuichikun,realm=LAS,application-id=PJAKt7ph,discussion-id=cLNVuLk4,comment-id=001100000001,timestamp=2017-02-02T03:33:53.477+0000)\n>\n> http://i.imgur.com/yp7qR8L.jpg\n\nEspero que sepas que acabas de destrozar un corazón....\n\nEspero que duermas tranquilo esta noche.","replies":[{"poster":"Kyousuke","date":"2017-02-02T03:39:49.776+0000","up_votes":2,"down_votes":0,"body":"luego de leer esto dormire como un bebe{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}]},{"poster":"RNGesus","date":"2017-02-02T12:37:40.470+0000","up_votes":2,"down_votes":0,"body":"Flaites/Turros basicamente (ese tipo de gente es la que te causa esa incomodidad al jugar)  realmente no importa como jueges, todos podemos jugar mal, independientemente del genero, creo que deberias sentirte mas comoda jugando y no tan al tanto de lo que diga tu team, las mujeres siempre traen polemica por el tema de que crean un ambiente comodo dependiendo de la personalidad o tambien puede ser que en una charla via skype todos se queden callados jaja, edita el tema y pone \"que hace un mal jugador\" asi esta mucho mejor, sabes cual es la diferencia? quizas ustedes no se toman tan a pecho el juego, solo se divierten, no digo que no sean competitivas, solo digo que no se estresan tanto por ir mal y no se centran en ponerse a insultar, solo juegan y ya, por cierto que significa HH?","replies":[]},{"poster":"9081913DEL1","date":"2017-02-02T10:43:02.780+0000","up_votes":2,"down_votes":0,"body":"Con todo respeto, si juego solo q, me da totalmente igual quien juega del otro lado o a mi lado. Yo me dedico a cumplir mi rol. Si alguien falla, o si es malo, da igual su genero es un lastre de todas maneras y debere esforzarme el doble.\nSi alguien es bueno ayudara mas, no cambia que tenga pantalon o pollera. \nLas interlocuciones sexistas son la necesidad de expresion propia, como pueden aportar mas que al folcklore popular si no influyen en absolutamente nada.\n\nEs un juego, todos manejamos un campeon, nada tiene que ver si sos alto, rubio, azulado o naciste en kripton, las reglas son las mismas para todos.\n\n> ¡PERO! esta la otra parte de la comunidad femenina de LOL que no abusa verbalmente ni trolea las partidas si no, que ayuda a su equipo a ganar y tener unos 20-30 min agradables.\n\nQue sea hombre o mujer que cambia?\n\nMe parece un debate forzado en un lugar donde no tiene lugar ni razon de ser.\nCada uno lo vera a su manera desde su ordenador, pero influye en nada lo que hagas como invocador.\n\nDe hecho puedes usar a garen hasta siendo ciego, no por ser ciego usaran lee sin XD.\n\nSaludos.","replies":[]},{"poster":"Hnk Kenshiro","date":"2017-02-02T02:31:10.810+0000","up_votes":2,"down_votes":1,"body":"Si se estigmatiza, es por falta de razón, no importa el caso.\n\nBuenas jugadoras hay varias, yo le hago pero a karma under en sus jugadas suicidas y me hace carrito, por nombrar sólo a una.\n\nUna mala jugadora hace lo mismo que un mal jugador, el sexo no hace diferencia.\n\n\n-_-\n\nKarma, tu Talon, mi Shen, cc y kills, piénsalo.","replies":[{"poster":"HoneyHH","date":"2017-02-02T02:51:02.836+0000","up_votes":1,"down_votes":0,"body":"Si no hay diferencia entre un mal jugador o mala jugadora, por eso siempre hay dos caras de la moneda y se aplica en hombres y mujeres! solo me hice la pregunta como puse  de \" por que se piensa asi\" que factor hace que la comunidad piense de esa manera :)\nMuchas gracias por tu opinion!","replies":[]}]},{"poster":"ŚKT Shen","date":"2017-02-06T19:38:49.971+0000","up_votes":1,"down_votes":0,"body":"Te estan tratando igual que un hombre...\n''Igualdad de genero''\nNo me digas que dices que es machismo que te digan ''Manca'' si a muchos nos han dicho eso mas de 1 vez...","replies":[]},{"poster":"Wretched Egg","date":"2017-02-03T06:51:09.891+0000","up_votes":1,"down_votes":0,"body":"Yo pensé que se las estigmatiza de soportes : v","replies":[]},{"poster":"LaReinaPingüino","date":"2017-02-02T17:03:22.915+0000","up_votes":1,"down_votes":0,"body":"Si dicen: \"Con razón es manca, si es mujer\", es machismo. Nadie le dice a un manco: \"Con razón juega mal, es hombre\".\n\nDe por sí ya es machista separar mancos de mancas, da lo mismo el género, por qué afecta si un mal jugador es hombre o mujer?  Qué diferencia hace?","replies":[]},{"poster":"Aaron","date":"2017-02-02T16:32:04.440+0000","up_votes":1,"down_votes":0,"body":"Yo conocí a una chica, SAKURAA, parece que era su nick, la verdad es que era muy buena jugadora hasta el punto en que le di un skin por el buen desempeño que tenia, después la elimine de la lista de amigos porque sus amigos argentos pubertos (ella era argentina), ademas de andar con la poronga parada todo el tiempo por la niña esta, se ponian a trolear o molestar a los demas al punto en que les dije y se sintieron ofendidos porque yo también les molestaba, les gustaba molestar pero no ser molestados.\n\nEsa es mi historia :v\n\nEdit: sobre la encuesta, la mayoria de las veces que me eh topado con una chica jugando casi siempre termina flameando, muy pocas veces abandonan una partida o se ponen a trolear, reconozco que al menos las que me eh topado tratan de seguir jugando.","replies":[]},{"poster":"EdxxEdxx","date":"2017-02-02T16:27:13.300+0000","up_votes":1,"down_votes":0,"body":"Pobres de nosotros quienes a pesar de todo lo que nos tiren o nos digan, nos aguantamos todo e intentamos evitar cualquier tipo de insulto, sólo para no ayudar a la causa del mal ambiente, pero no somos nombrados. También mis pesares a aquellos hombres que no discriminan ni dicen nada a una mujer, por el hecho de ser mujer, no tuvieron nombre en un post donde se habla de mujeres con buena conducta y mala conducta.\n\nVolviendo al tema, la verdad es que últimamente he visto muchísimo despelote con el tema de las mujeres en la sociedad, que si el feminismo, que si esto o lo otro, nunca le di importancia a estos temas y la verdad que ahora estuve por ahi viendo y fue como: *\"wtf tanto quilombo hay\"*. Pero bueno, retomando, veamos... no, no es que se generalice en si el típico *\"sos mujer sos manca\"*... nooo noo, estás mirando algo por el mal lado, y es que decirle eso a una mujer en este juego, es suficiente motivo para que las mismas se molesten, y se enojen. Bien, a qué voy con esto, bastante simple, lo que intento decir es que no es un \"generalizar\" en si, sino que simplemente **es un insulto**. A las mujeres les enoja que se les diga esto, tanto como a un hombre le puede enojar que le digan cualquier otra cosa, ¿me explico? no es que estén específicamente generalizando, el tema es que **son simples flammers promedios**, y como flammers que son, **necesitan** de algo que moleste a la otra persona para sentirse bien, es un insulto, nada más ni nada menos. ¿Te dicen que eres mal jugador? JA, ¿a quién no?, como si no encontraras gente así en una gran cantidad de partidas, que insultan por cualquier cosa, ¿es novedad? no, no lo es, entonces, si ellos saben que a las mujeres les da una molestia **extra** por insultarlas y decirles *\"mala jugadora\"* con el término *\"mujer tenías que ser\"*, entonces... ¿por qué no usarlo?. ¿Entiendes la mentalidad tan estúpida que tienen los flammers? va por un lado distinto a todo lo que te estás quejando, y es que lo que hacen es simplemente insultarte con algo **que saben que te va a molestar EXTRA**, de lo que ya te molestaría que te insulten.\n\n**Conclusión:**\n\nPor favor, simplemente son estúpidos que carecen de la habilidad pensar y reflexionar, o del simple razonamiento, no es necesario, **como a cualquier otro flammer**, que se les preste atención. Si te ponés a discutir con una persona así porque te insulta con eso... no te puedo decir nada, más que **dejes de hacerlo**, es inútil, no tiene sentido, no entienden, NO LO HAGAS. Mutealo al más mínimo indicio de que sea un flammer. No estamos en la vida real para imponerles el miedo de un piñaso en la cara, no van a dejar de insultarte y molestarte, aún sabiendo que su sanción va a ser inminente si siguen con esa conducta. Ingoralos, es lo mejor.","replies":[]},{"poster":"Orbis Tertius","date":"2017-02-02T14:43:41.825+0000","up_votes":1,"down_votes":0,"body":"No he visto esos casos, o no los recuerdo. Si se enteran que hay una mina, sale el mas profundo buitre que llevamos dentro. He jugado con mujeres que son buenas y otras que no, pero es como todo el mundo, asi que da igual. Si enloquecen es porque tienen su mal día, son así, son unos/as niños/as o alguien bastante inmaduro que quiere molestar.","replies":[]},{"poster":"Shuper","date":"2017-02-02T13:29:22.290+0000","up_votes":1,"down_votes":0,"body":"Me llama la atención quienes dicen cosas como: \"las mujeres se tiltean más en promedio\" o \"las mujeres no se toman muy a pecho\", las mujeres esto y esto otro... ¿En base a que estudio dicen eso? ¿Hay alguna estadística?\n\nComo una persona dijo por acá, todos tenemos cualidades diferentes, independiente del genero. Algunos se tiltean rápido, otros les gusta flamear, otros usan mute /all al minuto 1 ya que les afecta lo que dicen los demás, otros juegan y no le interesa lo que se escriba, otros se vuelven toxicos si existe alguien flameando, unos estan más atentos al mapa, otros saben farmear mejor y así podría seguir infinitamente. El tema es que de los 10 jugadores, te puede tocar una mezcla de cualquiera de ellos...\n\nPor otro lado, los que insultan (o creen que insultan) se van por lo más fácil, quieren insultar a alguien con sobrepeso en la calle \"correte guaton *l\" o a alguien de tercera edad: \"viejo *tm\". Lo mismo pasa en el lol, ven un nick de mujer e insultan algo encontra de su genero.\n\nEn fin... en resumen no se calienten la cabeza, muteen a quien flamea y reportenlo al final de la partida.\n\n{{summoner:11}}","replies":[]},{"poster":"Elyasviel","date":"2017-02-02T13:22:49.007+0000","up_votes":1,"down_votes":0,"body":"Nena no te victimices tanto, soy mujer también, pero es algo de lo que tenés que acostumbrarte.\nNo te diste cuenta a lo largo de tu estadía en el juego? Acá hay insultos para todos y para todas así que simplemente usás a la vieja confiable, los muteas o no te haces el famoso \"soy mujer no me lastimen pls\" así cuaquiera va a encontrar insultos para darte.","replies":[]},{"poster":"Nuke","date":"2017-02-02T02:28:16.803+0000","up_votes":1,"down_votes":0,"body":"Todo lo que dices que supuestamente puede caracterizar a las mujeres, caracteriza a los hombres. Fisica y culturalmente hay muchisimas diferencias ente generos. Sin embargo, mentalmente somos todos iguales, con las mismas capacidades psiquicas y psicologicas, con el mismo potencial de inteligencia.\n\nEs una tonteria, y perdonen la palabra, diferenciar generos en un juego de estrategia. Los E-Sports no tienen division por genero ya que ambos pensamos igual, en cambio deportes fisicos si, que es algo completamente distinto.\n\nCreo que los comportamientos y pensamientos entre un jugador y una jugadora, son igual de aleatorios y con los mismos porcentajes de mala conducta.\nAsi que, la encuesta me parece completamente fuera de lugar\n\nEsta es mi OPinion, espero que me digan que piensan sobre ella y compartan las suyas\n ¡Un saludo!","replies":[]},{"poster":"Chase me","date":"2017-02-02T02:54:31.104+0000","up_votes":1,"down_votes":0,"body":"Oye HoneyHH, no es porque seas mujer, es porque INTERNET saca el lado feo de la gente, dicen cosas que no le dirian nunca a otra persona desconocida en la cara. \n\n¿Eres mujer? Bueno, te flamearan diciendote \"vete a la cocina\". ¿No eres atractivo? Bueno, te diran feo. ¿Tienes tetas pero eres hombre? Bueno, eres un gordo asocial. ¿Eres sobre diamante? Bueno, no tienes vida.\n\nNo te creas el centro del universo porque te flamean, no creo que la gente cambie su forma de comportarse en internet si acudes a estos medios, menos acerca del machismo. El machismo o cualquier molestia solo pueden reprimirse mediante una buena enseñanza desde pequeño, de alguien que influya en la persona.\n\nYo voy en contra del machismo completamente, soy hombre, pero por favor, no estas ni cerca del eje del universo.","replies":[{"poster":"HoneyHH","date":"2017-02-02T03:03:18.169+0000","up_votes":1,"down_votes":0,"body":"Primero! no es por creerme el centro del universo ni nada por el estilo! siempre habran personas que tienen un mal comportamiento como es el flameo ( a ambos generos no se hace diferencia) la interrogante que me hacia y que lo he dicho en muuuchos comentarios es de ¿Por qué algunos y algunas (si porque tambien quizas mujeres piensan asi uno no sabe) pensaban de esa manera? cual era un de los factores que les llevara a que pensaran asi\n¿Se entiende? no soy muy buena explicando! Gracias por el comentario! saludos!","replies":[{"poster":"Chase me","date":"2017-02-02T03:27:01.422+0000","up_votes":1,"down_votes":0,"body":"Si, se entiende, eso se debe al famoso y reconocido \"patriarcado\", el cual se puede resumir en la situacion actual en la que se encuentra el pensamiento cotidiando acerca de la posición social de los hombres y mujeres. \n\nHonestamente me da lata eso, aunque supongo que me beneficia en el ambito laboral (igual no xD no se que me depara el futuro) pero asi es la cosa ps. Yo ya asistí a una marcha feminista xD fue divertido, pero igual chato por la gente.","replies":[{"poster":"JudioDePrimera","date":"2017-02-02T10:43:39.848+0000","up_votes":1,"down_votes":0,"body":"\"El \"patriarcado\" es un tema muy serio. los hombres tienen mas derechos que las mujeres, las mujeres estamos indefensas contra ellos legalmente, siempre se quedan con la custodia de nuestros hijos y debemos de mantenerlos, no somos esclavas de nadie. Somos feministas, somos mujeres libres.\"\n\nSupongo que eso dijeron en la marcha...no?","replies":[]}]}]}]},{"poster":"davichost","date":"2017-02-02T07:02:35.002+0000","up_votes":1,"down_votes":0,"body":"Dejen de pedirle ayuda al amiguito y lleguen a oro por si solas ( mensaje solo para los que lo hacen)","replies":[]},{"poster":"Nísta","date":"2017-02-02T06:59:01.477+0000","up_votes":1,"down_votes":0,"body":"4 años jugando al League of Leguends?","replies":[]},{"poster":"EpicHit","date":"2017-02-02T02:41:06.091+0000","up_votes":1,"down_votes":4,"body":"La verdad la mayoría que me tope deberían estar nivel 10-15 ya que no tienen el nivel de estar nivel 30, por lo general al juego las meten sus novios y les levean las cuentas, para luego jugar con Jinx y tener 20 de farm al minuto 20 e ir 1/12.\n\nNo te lo tomes a mal, si me he encontrado buenas jugadoras (Las que salen de la bot lane y prueban otros champs) porque la verdad la mayoría juegan Jinx, Janna, Lux, etc. Por lo general champs del genero femenino.","replies":[{"poster":"HoneyHH","date":"2017-02-02T03:12:46.168+0000","up_votes":2,"down_votes":1,"body":"Es tu opinion y siempre las opiniones se valoran por eso escribi el post! asi que gracias por opinar :)\nDebo admitir que yo tambien me la paso jugando la mayoria con champs femeninos se me dan bien(?) y si como tu dices a veces las meten sus novios o amigos personas que juegan LOL.\nSiempre habra buenas jugadoras o jugadores como tambien siempre abra malos jugadoras o jugadores. {{sticker:slayer-jinx-wink}}","replies":[{"poster":"EpicHit","date":"2017-02-02T05:56:43.706+0000","up_votes":1,"down_votes":0,"body":"Exactamente","replies":[]}]}]},{"poster":"God Won","date":"2017-02-02T03:48:50.456+0000","up_votes":1,"down_votes":0,"body":"yo a algunas las defiendo y me dicen ''UY SI LA QUIERE'' y yo tipo ''te gano la linea pe******'' c:","replies":[]},{"poster":"HoneyHH","date":"2017-02-02T03:30:18.415+0000","up_votes":1,"down_votes":0,"body":"Muchaas gracias por los comentarios todos se aprecian y en lo personal me agrada que compartan su opinion! Espero que la comunidad de LOL siga creciendo y que seamos muchos mas, que nos respetemos en el juego :D asi podemos pasar entre todos un tiempo agradable y divertirnos! {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Lord Maxlum","date":"2017-02-02T03:12:29.539+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"HoneyHH","date":"2017-02-02T03:27:52.596+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}  Es bueno que todos nos respetemos en el juego asi sera una comunidad mas agradable!","replies":[]}]},{"poster":"Forero","date":"2017-02-02T02:35:34.917+0000","up_votes":1,"down_votes":0,"body":"No se puede negar que están y no juegan en serio, dejan que las carren algún premade y básicamente no juegan ni un poco en serio.\n\nPero no hay distinción, un hombre hace lo mismo y es algo más \"común\" sólo por haber más hombres.\n\nSimplemente seamos amables y juguemos juntos, verán que es más divertido si alguien te apoya, incluso si sólo lo verás por única partida en la vida.","replies":[{"poster":"HoneyHH","date":"2017-02-02T03:17:50.328+0000","up_votes":1,"down_votes":0,"body":"La idea es que se diviertan los jugadores para eso son los videojuegos para la entretencion, pasarlo bien ya sea solo o con tus amigos. La pregunta que me hacia yo misma era ¿Por qué los jugadores creian eso? (lo del texto) y lo que yo pude observar como factor fue la conducta que se tiene! claramente esta conducta esta en hombres y mujeres no hay distincion.\nGracias por el comentario!","replies":[]}]},{"poster":"Yoen","date":"2017-02-02T02:40:47.280+0000","up_votes":1,"down_votes":0,"body":"En el transcurso de mis rankeds\n\nla verdad me  ha tocado supports y adc mujeres la mayoría, \nsin ofender,  van con premades esto implica que no tengan \nexperiencia  a veces en su rol independiente en solo Q que \nes decisivo en las rankeds Q.\n\nPor eso y reitero que no es necesario tender a saber que si \nes mujer u hombre, porque cometen los mismos errores\nnaturalmente.\n\nEn caso de las mujeres, siempre, por estadísticas me han \ntocado con premades, y muchas veces vi como le terminan \nganando sus partidas, y que no desempeñaron su rol tan eficiente \ncomo uno espera en solo Q, por estar dependiente de las jugadas\nde otros y no suelen hacer sus propias jugadas.\n\nY si, flamean igual que los hombres, pero no todas.\ntambien suelen burlarse, me ha pasado.\n\nLo ultimo que vi, es que también eligen campeones poco habituales \ncomo Nidalee, Lux, Lulu, Rengar en bot xD, me ha pasado.\n\nEsto debiese responder las preguntas de tu post. Aunque se trata de lo \nque vi en mis rankeds.\n\nBuen Dia","replies":[]}]}