{"poster":"Blackmagemasher","date":"2016-08-18T16:57:13.876+0000","title":"Awkward lagging in games","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"I don't know what or why it is happening, but I feel like their has been a lot of unusual lag as of late. I don't know how else to describe this lag. I typically get 65ms ping in a match, and on the higher end about 120ms. It is a manageable amount, but enough to make me jealous of people who claim their is 30ms. But lately I will start initiating combat with the other player(s), and I feel like all my moves stop working. I will look up at my ping and it jumps to 600-800ms. When I die or recall (or just retreat enough) it seems to go down. It is very peculiar...\r\n\r\nI had thought it was my PC, ran the Hextech repair tool (because your website's log tracker shows that i get amazing packet loss randomly) but that doesnt seem to have worked.\r\n\r\nThe weird part of all this is that both my brother who plays league with me, and a co-worker friend of mine have also been complaining of this exact problem. I also see people complaining in chat about constantly as well.\r\n\r\nI don't know what or why it is happening, but I know if no one complains about it, no one will know to fix it","replies":[{"poster":"Porocles","date":"2016-08-18T20:58:59.245+0000","up_votes":1,"down_votes":0,"body":"Thanks for taking the steps so far to troubleshoot this.   Confirming packet loss with the log reader also helps a lot!  The hextech repair tool is a great resources, but it doesn't fix everything!  I recommend also going over our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) issues guide to help strengthen your PC.  If that doesn't fix you up, then your ISP could also be routing a long distance to reach our game servers.  Let me know if the connection issues guide helps, otherwise we'll go from there!","replies":[{"poster":"RevelASIAN","date":"2016-08-18T21:36:14.736+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Porocles,realm=NA,application-id=osqw6G4M,discussion-id=g6U4c78o,comment-id=0000,timestamp=2016-08-18T20:58:59.245+0000)\n>\n> Thanks for taking the steps so far to troubleshoot this.   Confirming packet loss with the log reader also helps a lot!  The hextech repair tool is a great resources, but it doesn&#x27;t fix everything!  I recommend also going over our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) issues guide to help strengthen your PC.  If that doesn&#x27;t fix you up, then your ISP could also be routing a long distance to reach our game servers.  Let me know if the connection issues guide helps, otherwise we&#x27;ll go from there!\n\nPorocles, are you able to look at individual tickets? I sent in a ticket (with appropriate logs) about 5 days ago, but I received a very unhelpful response and starting to get a little impatient with getting some help regarding my issue.","replies":[{"poster":"Porocles","date":"2016-08-18T21:50:38.996+0000","up_votes":1,"down_votes":0,"body":"Sure thing!  It looks like the specialist gave some context based on the period of time you put in the ticket and the nature of your issue.  I see that you've replied with more context, so he'll be able to get back to you as soon as possible.  Solid logs were also provided, so you should be good.  He's a cool dude, so you'll be in good hands.  Hang tight!","replies":[]}]}]}]}