{"poster":"Lord Coffee","date":"2017-07-13T13:49:59.095+0000","title":"Why does Kayn need the ability to walk through walls?","subforum":"Gameplay","up_votes":10,"down_votes":7,"body":"Just played a ranked vs Kayn and it was so annoying how he can just walk through a wall when a fight doesnt go his way. I dont understand why a mechanic like that needs to be put in the game. At least with Talon you know he will go over in the direction he jumped and with Bard you can follow him. But Kayn can just wait to see what you&#039;re going to do first.  As a volibear main this season it makes me sad the voli is pushed even farther down the tier list. When every new champion has a dash/self peel or built in wall hax. Like shouldn&#039;t we choose champions who have the ability to peel our carries? shouldn&#039;t champions have trade offs? instead of every carry/top/jung/mid  having their own personal root/dash/wallhax. \r\n\r\nI personally think abilities like Shadowstep and Assassins path are just high reward low risk abilities that aren&#039;t healthy for the game.  I also don&#039;t understand why these abilities need to be on high damage assassins. It doesnt even matter if they are out of position, they have a get out of jail free card. Maybe instead of these abilities riot should just give them a dash or a charge system on those abilities.\r\n\r\nImo, it just isnt fun to play against when your only solution to follow up is flash. Rant over you can flame me now.","replies":[{"poster":"Based Yager","date":"2017-07-13T14:46:56.015+0000","up_votes":4,"down_votes":1,"body":"They're running out of ideas so they need ridiculous abilities to keep the game look appealing to new players.","replies":[{"poster":"Lord Coffee","date":"2017-07-13T14:54:08.810+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Based Yager,realm=NA,application-id=3ErqAdtq,discussion-id=kknOxWMn,comment-id=0002,timestamp=2017-07-13T14:46:56.015+0000)\n>\n> They&#x27;re running out of ideas so they need ridiculous abilities to keep the game look appealing to new players.\n\ni think they can do that without giving a champion a literal wall hack.","replies":[{"poster":"Based Yager","date":"2017-07-13T15:04:19.026+0000","up_votes":4,"down_votes":0,"body":"I agree with you. I was against his release since he was announced. Wall phasing is broken and unhealthy even for League standards. It was bad enough where Talon can ult, 100-0 a carry then hop over a wall before you can attempt to \"counterplay\" him but now we have to deal with someone who can phase through walls while healing from it lmao. Sick gameplay.","replies":[]}]}]},{"poster":"BLACK REALM GOD","date":"2017-07-13T14:09:56.318+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Lord Coffee,realm=NA,application-id=3ErqAdtq,discussion-id=kknOxWMn,comment-id=,timestamp=2017-07-13T13:49:59.095+0000)\n>\n> Just played a ranked vs Kayn \n> **Imo, it just isnt fun to play against when your only solution to follow up is flash. Rant over you can flame me now.**\n\nif you hit kayn with any ability or attack you put him in combat. if he's in combat he cant wall walk for as long. we're talking about a 1-2 second wall walk if you're lucky. when not in combat kayn can wall walk for 10 or so seconds if he enters a wall. if he doesnt then he can waste the ability for roughly 5 seconds. its not that powerful and it takes up one of his damage ability options same as zed's shadow to provide a new approach to gameplay.","replies":[{"poster":"Lord Coffee","date":"2017-07-13T14:24:43.085+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=BLACK REALM GOD,realm=NA,application-id=3ErqAdtq,discussion-id=kknOxWMn,comment-id=0001,timestamp=2017-07-13T14:09:56.318+0000)\n>\n> if you hit kayn with any ability or attack you put him in combat. if he&#x27;s in combat he cant wall walk for as long. we&#x27;re talking about a 1-2 second wall walk if you&#x27;re lucky. when not in combat kayn can wall walk for 10 or so seconds if he enters a wall. if he doesnt then he can waste the ability for roughly 5 seconds. its not that powerful and it takes up one of his damage ability options same as zed&#x27;s shadow to provide a new approach to gameplay.\n\n1-2 is long enough to get through a wall in most situations especially since he gets increased MS. Also E is usually the utility spell IE: dashes for most champions.","replies":[{"poster":"BLACK REALM GOD","date":"2017-07-13T17:01:30.625+0000","up_votes":1,"down_votes":1,"body":"it's not enough time. his movement speed is only 330. with boots if you attack him and he activates his E right beside the wall it will just cancel the E and push him back out of the wall. it's like taliyahs R in how she can ride the wall, but you can knock her off.\n\nand by saying that most champions have a utility spell you're just hurting your argument by pointing out that that the ability is not unusual.","replies":[{"poster":"Lord Coffee","date":"2017-07-13T18:33:54.323+0000","up_votes":2,"down_votes":0,"body":"in most situations it is enough time. especially when he being chased by someone without a built in dash.\n\na utility spell just isnt a dash it could be a slow/stun/zoning aoe etc.\n\nHe is just way to safe to play.","replies":[{"poster":"BLACK REALM GOD","date":"2017-07-14T04:44:31.677+0000","up_votes":1,"down_votes":1,"body":"i politely disagree.","replies":[]}]}]},{"poster":"48983507DEL1","date":"2017-07-13T15:16:37.184+0000","up_votes":1,"down_votes":0,"body":"He only gets increased movement speed when he's Blue Form. As an assassin, he should be naturally hard to pin down. That's what separates them from Divers.","replies":[]},{"poster":"Lord Coffee","date":"2017-07-13T14:25:52.597+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Lord Coffee,realm=NA,application-id=3ErqAdtq,discussion-id=kknOxWMn,comment-id=00010000,timestamp=2017-07-13T14:24:43.085+0000)\n>\n> 1-2 is long enough to get through a wall in most situations especially since he gets increased MS. Also E is usually the utility spell IE: dashes for most champions.\n\nHe is way to safe to play for a champion that can go assassin or bruiser.","replies":[]}]}]},{"poster":"PlsTouchMeGently","date":"2017-07-13T14:47:57.246+0000","up_votes":2,"down_votes":1,"body":"> just played ranked vs Kayn\n\nYour first mistake was not banning the new champion lol.","replies":[{"poster":"Lord Coffee","date":"2017-07-13T14:53:13.739+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sang Noir,realm=NA,application-id=3ErqAdtq,discussion-id=kknOxWMn,comment-id=0003,timestamp=2017-07-13T14:47:57.246+0000)\n>\n> Your first mistake was not banning the new champion lol.\n\nI won the game. but its annoying how safe he is.","replies":[{"poster":"PlsTouchMeGently","date":"2017-07-13T14:57:26.408+0000","up_votes":1,"down_votes":1,"body":"Ah, well then the enemy's mistake was not banning the new champion :-D","replies":[]}]}]},{"poster":"Junkο","date":"2017-07-13T14:05:28.718+0000","up_votes":1,"down_votes":3,"body":"How is this any different from just any other champion dashing, blinking, etc over a wall?","replies":[{"poster":"Lord Coffee","date":"2017-07-13T14:10:55.565+0000","up_votes":2,"down_votes":0,"body":"Those blinks or dashes vary in the length of wall they can cross over and with blinks and dashes its strait forward and predictable. the problem i see with shadowstep is he can literally walk inside the terrain even topside and bot side.","replies":[]}]}]}