{"poster":"Biebz","date":"2018-02-05T00:40:38.031+0000","title":"Riot needs too do THEIR part in reforming players","subforum":"General Discussion","up_votes":0,"down_votes":8,"body":"Summoner: Biebz \r\n\r\nThe punishment system does not work, yeah there may be stats showing people are less toxic after a ban, but there has too be further action on your (Riot) part too help the community get better. How am I (recently banned player) supposed too get better if all I&#039;m told is &quot;stop being toxic&quot; you aren&#039;t going too tell someone with the fear of heights too stop going into tall building, that&#039;s not how progressive action works. How can you actually evaluate that your community is improving?  The process that I&#039;m seeing in place now is, the Riot Support Team &quot;gets rid of&quot; the toxic players just for them too get onto another account and do the same. I was talking too a Rioter (Mr. Feeny) recently about this and he said &quot;I absolutely do and I want players to be able to make an improvement in themselves&quot;  but how can someone make an improvement with no help from the other end? For example, You aren&#039;t going too tell your dog too sit and expect it too learn too sit, you need too work with that dog, teach it, connect with it, help it learn how too sit before it actually can sit. What I&#039;m trying too get at is there should be a process that players can go through to show they get better, show that they care enough too do something about how they were acting. Banning someone is a &quot;warning&quot; but there is no action on your (Riot) part beyond that too help them be better. When a player gets their account banned whos to tell them they cant make another account and do the same thing they just did, only continueing their toxic behavior as a &quot;new person.&quot;\r\n\r\nToo sum it up,\r\nIf Riot really does want too see change in their community there needs to be a way that players can learn actively, and progressively show that they are getting better. Throwing someone too the curb and telling them too stop is not how a community will prosper.","replies":[]}