{"poster":"BreaKeRofDeaTHH","date":"2017-08-16T16:30:00.479+0000","title":"forma de selecciono de campeón","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":2,"body":"Creo que el L.O.L tiene un asunto pendiente con la forma de elecci&oacute;n que se vasa en pedir la linea que uno decea y ala vez elegir el campe&oacute;n , pero que pasa si yo ped&iacute;  una linea antes que todos y el campe&oacute;n que deceo para tal linea esta siendo marcado por otro jugador que en este caso llevaba 30 segundos seleccionando el campe&oacute;n pero a su vez ya hab&iacute;a perdido linea, yo me sent&iacute; sometido contra el tiempo y el se hizo el desentendido hasta que quedaban 2 segundos y para yo no salirme de la cola para que el se saliera eleg&iacute; otro campe&oacute;n y el a l segundo eligi&oacute; el que era de mi linea solicitada y mi campe&oacute;n preferentemente a elegir , frente a eso me vi sobre pasado por otro jugador y sin protecci&oacute;n alguna a yo reclamar mi derecho y desconforme con lo pasado decido preguntar a todos los jugadores que si pod&iacute;an reportar lo sucedido para yo poder jugar con normalidad o definitivamente solicitar surrender y remakiar el juego, teniendo yo una respuesta en forma de burla del equipo contrario y no sinti&eacute;ndome apoyado por el equipo y viendo mas encima al jugador que me hab&iacute;a quitado linea y campe&oacute;n quedarse afk decid&iacute; en forma inquebrantable dar muerte a mi campe&oacute;n para impedir que el juego de mi equipo que ene ese momento era 4v5 ya con lo que me hab&iacute;a pasado entre burlas y la poco que val&iacute;a el pedir la linea y la palabra de &quot;hombre&quot;(solo por explicarlo de esa forma), me tome o que yo creia justo para no dar un juego al que yo crei no merecerlo , pese a todo esto la compa&ntilde;&iacute;a, su compa&ntilde;&iacute;a decide bloquearme 15 dias por comportamiento inadecuado , en vez de dar soluciones a un problema que en otro juego como DOTA no pasa, veo que castigan al que ve un defecto y no se preguntan como un usuario puede estar mas conforme y feliz y seguro dentro de esta plataforma, y jamas me respondieron el reporte que yo hice al mismo tiempo osea cualquiera pasa en sima de uno no sirve pedir linea si uno elige antes que otro y las buenas costumbre , valores morales y el juego honorable al que tanto apuntan se desase en sus propias pol&iacute;ticas del juego se contradicen .\r\n     {{champion:22}}","replies":[{"poster":"Ks Erwyn","date":"2017-08-16T16:39:59.031+0000","up_votes":2,"down_votes":0,"body":"TL;DR, demasiado largo para explicaer tu punto, son las reglas del blind pick, le peor cola existente, RITO no la elimina por el grueso(randoms, novatos, nocturnos) del server es la que mas elige, cuando no juegan Ranked, reclutamiento esta limitado por horarios, las demás colas apestan o nadie las juega por los que los emparejamientos son malos y las colas largas.\n\nDesde que elimino tema builder RITO debió buscar una mejor opción tanto para reclutamiento como blid pick, pero son costumbristas...\n\nNo hay mucha ciencia, solo debe eliminar blind pick y mejorar reclutamiento para novatos(lvl bajos), los que tienen pocos champs,  nada de runas y todos felices jugando lo que quiera sin peleas previas en chat por linea o pick...","replies":[{"poster":"BreaKeRofDeaTHH","date":"2017-08-17T16:44:13.591+0000","up_votes":1,"down_votes":0,"body":"tienes razón quizás me hice mucho problema pero encuentro naque ver que si las reglasen este juego sea pedir linea y luego escoger pick cualquier persona pueda violar eso a lo que tanto apelan creo que da vergüenza la forma de elección del hero","replies":[]}]},{"poster":"ref","date":"2017-08-16T17:00:02.407+0000","up_votes":1,"down_votes":0,"body":"la blind pick, deberia llamarse la wild pick, si no tenes huevos no entres, anda a reclutamiento.","replies":[{"poster":"Urxnium","date":"2017-08-19T00:49:16.453+0000","up_votes":1,"down_votes":0,"body":"Pero reclutamiento está hasta las 00:00 horas.","replies":[{"poster":"ref","date":"2017-08-19T01:24:58.729+0000","up_votes":1,"down_votes":0,"body":"entonces ranked.","replies":[{"poster":"Urxnium","date":"2017-08-19T02:15:16.779+0000","up_votes":1,"down_votes":0,"body":"Y si no quiere jugar ranked?","replies":[{"poster":"ref","date":"2017-08-19T13:40:52.126+0000","up_votes":1,"down_votes":0,"body":"entonces que no juegue.","replies":[{"poster":"Urxnium","date":"2017-08-19T23:26:49.874+0000","up_votes":1,"down_votes":0,"body":"Y si tiene ganas de jugar?","replies":[{"poster":"ref","date":"2017-08-20T13:22:37.846+0000","up_votes":1,"down_votes":0,"body":"que juegue ranked.","replies":[{"poster":"Urxnium","date":"2017-08-27T00:38:48.808+0000","up_votes":1,"down_votes":0,"body":"Y si quiere probar un champ?","replies":[{"poster":"ref","date":"2017-09-02T21:48:50.275+0000","up_votes":1,"down_votes":0,"body":"que juegue contra ia","replies":[{"poster":"Urxnium","date":"2017-09-03T02:46:35.134+0000","up_votes":1,"down_votes":0,"body":"Y si quiere jugar contra personas reales y que no estén siendo manejadas por una IA?","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Br1bkn","date":"2017-08-17T00:19:12.555+0000","up_votes":1,"down_votes":0,"body":"ganaste línea pero si te pickearon el campeón mala cuea son las reglas, y el ban es perfectamente justificado por haber trolleado","replies":[{"poster":"BreaKeRofDeaTHH","date":"2017-08-19T01:55:16.931+0000","up_votes":1,"down_votes":0,"body":"pero el baneo de la cuenta por 15 dias es execivo\npara alguien que jamas se gano ni una cola por sancion jamas eh quedado afk ni nada era intachable hasta ese incidente que mas que nada queria mostrar mi punto 0 criterio RIOT aparte si tu gnas linea no te pueden pickear el campeon se supone que tienes preferencia si se juega por honor donde estan los actos honorables? es totalmente anti politica porque no el segano el ban por poco espiritu de compañerismo","replies":[]},{"poster":"BreaKeRofDeaTHH","date":"2017-08-19T01:53:34.909+0000","up_votes":1,"down_votes":0,"body":"pero el baneo de la cuenta por 15 dias es execivo\npara alguien que jamas se gano ni una cola por sancion jamas eh quedado afk ni nada era intachable hasta ese incidente que mas que nada queria mostrar mi punto 0 criterio RIOT","replies":[]}]}]}