{"poster":"vz2SheUPGM","date":"2016-03-26T18:54:51.553+0000","title":"Can We Vote on New Splash Arts?","subforum":"Story, Art, & Sound","up_votes":22,"down_votes":3,"body":"Viewing the new splash arts on s@20, some of them are great. The new Irelia splash is wonderful. I&#039;m confused by the direction of some of it, though. For example, Arctic Warfare Caitlyn looks so realistic, but Karma&#039;s look so anime. Where is Riot trying to go with this? (I get the goal of unifying the art, but in terms of what the art looks like, what is their goal?)\r\n\r\nI was also disappointed to see changes I didn&#039;t like to some of my personal favorite skins (Exiled Morg, Prom Queen Annie, Emumu) as well as a few skins I don&#039;t even have but really like (Boom Boom Blitz). Having noticed other threads on a few skins, I have this suggestion. Why don&#039;t you let the community vote between the two versions for each changed splash? (I realize some are not &quot;new&quot; and only new to NA.) In the case of skin splashes (or maybe just legacy skins), perhaps it should be restricted to players who have that skin voting--or maybe not. Idk. I want to say, too, that I realize that some of these splashes are new and represent a lot of work by the artists at Riot. I can sympathize with how this can look to them as though we&#039;re saying &quot;Wow, your work sucks,&quot; but that&#039;s not what we&#039;re trying to say. Just sometimes you hit and sometimes you miss. Some of the new splashes (the Wukong ones, for example) look sick. Just some others don&#039;t. So can the community possibly have a say so where each potential splash change gets voted on? Thanks for the consideration, Riot.\r\n\r\n(This is my first time creating a thread on the boards. I don&#039;t imagine that I&#039;ve violated any protocol, but if so, please let me know.)","replies":[{"poster":"epicgizmo519","date":"2016-03-27T16:56:58.153+0000","up_votes":2,"down_votes":0,"body":"its already done u know if its announced on pbe it will be happening","replies":[]},{"poster":"Sukishoo","date":"2016-03-27T16:59:03.744+0000","up_votes":1,"down_votes":0,"body":"Yeah they are already happening since they've been put on PBE.   Plus most of them are just to hold us over till they fix the splashes over all.","replies":[]},{"poster":"Hellioning","date":"2016-03-27T16:42:24.799+0000","up_votes":1,"down_votes":0,"body":"I'd imagine it'd be fairly difficult to set that poll up in every single region.","replies":[]},{"poster":"TallyZrg","date":"2016-03-28T19:22:07.119+0000","up_votes":1,"down_votes":1,"body":"Lol you think this is a democracy? If you want to vote, vote with how much you play league, along with about 50 million of your close friends.\n\nThen, _maybe_ you'll get a big corporation like Riot to listen to you, but not likely.","replies":[]}]}