{"poster":"HeroOfGallifrey","date":"2016-03-12T22:08:11.509+0000","title":"Trollende Teammates","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":3,"body":"Hallo zusammen\r\n\r\nWie geht ihr damit um, wenn die Teammates beabsichtigt den Main Champ bannen? (Neu kann man ja den Champ schon Anfangs eingeben)\r\nHabe dies jetzt heute schon zweimal erlebt, wo es zwei lustig fanden, den eigenen Teammitgliedern die Champs wegzubanen...","replies":[{"poster":"Portus82","date":"2016-03-15T12:32:34.877+0000","up_votes":1,"down_votes":3,"body":"Habe auch einen komplett neuen Thread mit direkter Fragestellung an Riot erstellt in gutem Deutsch ohne Toxic zu sein oder Sonstiges und wurde gelöscht. Riot geht dort null auf die Spieler ein. Schätze die haben hierfür keinerlei Lösungsansätze und ersticken daher diese Kritik im Keim, einfach mal schön die Leute weiterhin mit Zeitstrafen bestrafen die aufgrund Fairness das Team verlassen! Einige im Teamchat meinten sogar Sie würden es verstehen und es ist ok wenn ich jetzt rausgehe. Es ist ein Teamspiel und ich spiele nicht mit Trollen. Melde auch Leute die in MEINEM Team spielen und am Ende des Spiels \"Easy\" schreiben. So etwas gehört sich nicht, genau wie man auch nicht den Champion bannt, den ein TEAM-Mitglied gerade gewählt hat....\n\nGrund: Ich habe den Namen eines Trolls genannt... Anstatt dagegen vorzugehen wird der Thread gelöscht... Man hätte auch den Namen löschen können und gut is :p","replies":[{"poster":"Waldschrat86","date":"2016-03-15T18:04:24.060+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Portus82,realm=EUW,application-id=KYnfKGf0,discussion-id=PGlfwXUE,comment-id=0006,timestamp=2016-03-15T12:32:34.877+0000)\n>\n> Habe auch einen komplett neuen Thread mit direkter Fragestellung an Riot erstellt in gutem Deutsch ohne Toxic zu sein oder Sonstiges und wurde gelöscht. Riot geht dort null auf die Spieler ein. Schätze die haben hierfür keinerlei Lösungsansätze und ersticken daher diese Kritik im Keim, einfach mal schön die Leute weiterhin mit Zeitstrafen bestrafen die aufgrund Fairness das Team verlassen! Einige im Teamchat meinten sogar Sie würden es verstehen und es ist ok wenn ich jetzt rausgehe. Es ist ein Teamspiel und ich spiele nicht mit Trollen. Melde auch Leute die in MEINEM Team spielen und am Ende des Spiels \"Easy\" schreiben. So etwas gehört sich nicht, genau wie man auch nicht den Champion bannt, den ein TEAM-Mitglied gerade gewählt hat....\n> \n> Grund: Ich habe den Namen eines Trolls genannt... Anstatt dagegen vorzugehen wird der Thread gelöscht... Man hätte auch den Namen löschen können und gut is :p\n\nAha auf Grund von Fairness das Spiel verlassen... Was soll das bitte sein?\n\nIch kann es auch immer wieder nur betonen, das Team besteht aus 5 Leuten und nicht nur dem Troll und dir.\nMir als Teammitglied kann es sowas von egal sein, warum du dich jetzt mit dem Jungler oder sonstwem in die Haare bekommst und dann quittest, scheiß egal, ob der trollt, nur Dinge macht die dir nicht passen, schlecht ist.\nDie einzige Konsequenz, die ich daraus ziehe, ja gut nicht nur ein report für den Troll, sondern 2, seis halt so.\n\nUnd zum Thema Namecall:\n\nPortus82 ist ein Flamer und Troll.\n\nUnd nun? Du bist im Userforum, nicht im Gespräch mit Riot, hier hat niemand mehr Einblick als auf den Spielverlauf.\nGut da sieht man dann recht schnell, dass ich mit dem Nick in keinem deiner Spiele auftauche, aber praktischerweise, ist es ja nicht verboten mehrere Accs. zu haben, dann stalke ich eben selber deine Matchhistory, such mir schlechte Spiele raus und behaupte der und der Acc. von den Spielen mit miesen Stats deinerseits, wären Smurfs von mir.\nJetzt beweis mal das Gegenteil. Musst du nicht? Stimmt. Und das ist mit ein Grund, warum das hier nicht geduldet wird.","replies":[]},{"poster":"RankaxTuuAmazing","date":"2016-03-16T12:28:12.625+0000","up_votes":1,"down_votes":1,"body":"Tja Riot ist eben auch nur ein egoistischer Konzern, die es nicht primär interessiert, was die Spieler wirklich brauchen.","replies":[{"poster":"Rainbow Dashie","date":"2016-03-16T22:03:05.795+0000","up_votes":1,"down_votes":0,"body":"was brauchen denn die Spieler \"wirklich\" außer einer nicht allzu toxischen Community?","replies":[{"poster":"RankaxTuuAmazing","date":"2016-03-17T08:20:53.460+0000","up_votes":1,"down_votes":1,"body":"Das hängt von den Spielern und deren Bedürfnissen ab. Das kann ich nicht wirklich bestimmten, sonst wäre ich ja eine Art Diktator. Um da sinnvolle Entscheidungen für die Gesellschaft und Gemeinwohl zu treffen, müsste ich sehr genau über diese Bescheid wissen, was ich denke ich nicht tue. Es gibt gewisse Dinge, die man nennen könnte, aber eine Garantie dafür geben kann man nicht unbedingt.\n\nFakt ist aber, dass ein gewinnorientiertes Unternehmen primär wie der Name schon sagt auf Gewinn ausgerichtet ist und erst dann die Wohlfahrt kommt. Diese wird dem im Prinzip immer erst untergeordnet. Solange es nicht dem Primärziel Gewinn dient, sind Gemeinwohl Bestreben schwer umsetzbar. (Siehe auch Gefangenendilemma, das ist ein ähnliches Problem)","replies":[{"poster":"Rainbow Dashie","date":"2016-03-17T13:10:32.926+0000","up_votes":1,"down_votes":0,"body":"Du stellst also die These auf das Riot nicht das umsetzt was die Spieler wirklich brauchen und lieferst auf eine direkte Fragen dazu nur die Definition von gewinnorientiert?\n\nSollte nicht spätestens nach der Frage zur aufgestellten These die Fakten kommen um diese zu untermauern?","replies":[]}]}]}]},{"poster":"legofreak1","date":"2016-03-15T22:55:29.589+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Portus82,realm=EUW,application-id=KYnfKGf0,discussion-id=PGlfwXUE,comment-id=0006,timestamp=2016-03-15T12:32:34.877+0000)\n>\n> Grund: Ich habe den Namen eines Trolls genannt... Anstatt dagegen vorzugehen wird der Thread gelöscht... Man hätte auch den Namen löschen können und gut is :p\n\nEs ist nicht die Aufgabe von uns Mods dafür zu sorgen, dass Spieler die Regeln einhalten. Wir sind nicht die Forenmutti, die hinter euch aufräumt und verbessert, was ihr falsch gemacht habt, sondern ahnden Regelverstöße.\n\nGenausogut kannst du deine Diskussion auch wieder neu eröffnen, dann aber so, dass du darin keine Spieler anprangerst.","replies":[]}]},{"poster":"Shiggyvara","date":"2016-03-13T08:14:54.720+0000","up_votes":2,"down_votes":0,"body":"WennS wirklich mit Absicht und ohne guten Grund is...\nNimm nen Champ, den du üben willst /mute all und dann in ruhe sehen, was bei rauskommt.","replies":[]},{"poster":"Günther OhMad","date":"2016-03-13T07:22:42.821+0000","up_votes":3,"down_votes":1,"body":"Naja das kann sein weil ein Teamade nicht aufpasst, das kann sein das du denen zu spät picks (Laspick mit OP-Champs bleibt gegfäährlich da der Gegner sie eher wählen kann) und grade in der niedriegen Elo werden auch öfters mal Trollpicks gebannt... Ich seh sowas einfach locker... Man kann ja nicht nur einen CChamp spielen, oder?","replies":[]},{"poster":"Julian Chopper","date":"2016-03-12T22:09:32.382+0000","up_votes":4,"down_votes":3,"body":"Vllt. habt ihr auch einfach Champs ausgewählt, die die Gegner nicht bekommen sollten?","replies":[]},{"poster":"Portus82","date":"2016-03-13T19:59:04.351+0000","up_votes":2,"down_votes":1,"body":"Geht mir momentan auch so und ist mir schon echt häufig passiert... Bin deshalb echt angepisst um ehrlich zu sein und kommt nicht mit: Nimm doch einfach nicht deinen Main... Das ist doch Quatsch, man nimmt den Champion gerade damit er NICHT gebannt wird und es ist ein TEAMSPIEL. Es nervt einfach nur noch und das Niveau sinkt und sinkt... Echt traurig! Wenn ich da mal nur zwei Jahre zurückdenke, da sah es wirklich anders aus.","replies":[]},{"poster":"PapaJLBaer","date":"2016-03-15T22:51:02.307+0000","up_votes":1,"down_votes":5,"body":"Das habe ich auch schon gemacht und denke werde es weiter machen.\nbin Main supp und banne den ADC sein Champ weg.\n\nHat sogar so geklappt wie ich es mir erhofft habe, er hat das Spiel verlassen.\nWar Teil eine 3 Premads Trios.\n\nJetzt werde ich es aus den einfachen Grund machen weil man es kann und nicht verboten ist Op Champs zu bannen.\n\nBitte nehmt es mir nicht persönlich, wenn ich euren Champ banne. Ist ne Sache zwischen mir und Riot.\nAlso sorry wenn ihr darunter Leiden müsst, aber ich versuche alles erlaubte zu tun was das Game versaut.\nRiot nutzt auch das Argument es sei erlaubt, auch wenn ich es als Negativ für das Spiel sehe.","replies":[{"poster":"Zulwar","date":"2016-03-16T06:21:35.855+0000","up_votes":1,"down_votes":0,"body":"Dann ist ja gut, das du max. nur einen Bann haben kannst.\nSonst müsste man selber ja auch einen Trollpick auspacken.\nVladimir Bot oder so. _mhm vielleicht mal testen._","replies":[{"poster":"Rainbow Dashie","date":"2016-03-16T09:46:16.073+0000","up_votes":1,"down_votes":0,"body":"für das Vladimir Bot empfehle ich dieses [Video ](https://www.youtube.com/watch?v=PQUThIKdpSk) xD","replies":[{"poster":"Zulwar","date":"2016-03-16T09:50:07.329+0000","up_votes":1,"down_votes":0,"body":"Stimmt die haben ja Vlad mit Lulu kombiniert. Deswegen kam mir wahrscheinlich der Gedanke :D","replies":[]}]}]},{"poster":"Eibert Rümmel","date":"2016-03-15T22:56:44.278+0000","up_votes":2,"down_votes":0,"body":"13 oder hängengeblieben in der Pupertät?\n\nedit sagt: kein weiterer Kommentar wert","replies":[{"poster":"Rainbow Dashie","date":"2016-03-16T05:06:22.341+0000","up_votes":1,"down_votes":0,"body":"einfacher Troll auf unterstem Niveau der Premades und Teamspeak/Skype für Cheating und Bannable hält weil es ihnen einen \"unfairen Vorteil\" gibt.","replies":[{"poster":"PapaJLBaer","date":"2016-03-16T22:23:12.450+0000","up_votes":1,"down_votes":4,"body":"Weist du, das ich Smurf und Premads für einen größeren Abschaum der Gesellschaft halte als Pädophilie.\n Pädophilie können nichts da für Smurf und Premdas schon.\n\nEin tieferes Niveau kann man als Mensch nicht mehr erreichen. Selbst Tolle leben höher.","replies":[{"poster":"Waldschrat86","date":"2016-03-17T00:55:05.217+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=PapaJLBaer,realm=EUW,application-id=KYnfKGf0,discussion-id=PGlfwXUE,comment-id=0008000000000000,timestamp=2016-03-16T22:23:12.450+0000)\n>\n> Weist du, das ich Smurf und Premads für einen größeren Abschaum der Gesellschaft halte als Pädophilie.\n>  Pädophilie können nichts da für Smurf und Premdas schon.\n> \n> Ein tieferes Niveau kann man als Mensch nicht mehr erreichen. Selbst Tolle leben höher.\n\nGenau Teambildung in einem Teamgame ist ja sowas von unfair, auch dann wenn premade-Gruppen in der Regel gegen Premadegruppen derselben Größe gematcht werden.\n\nWürdest du fordern, dass das \"in der Regel\" die 100% erreichen sollte, würdest du hier auch Zuspruch finden und von Leuten, denen es egal ist zumindest Akzeptanz. \nAber so wie du argumentierst und überziehst ist es einfach nur BS.\n\nP.S.: Es gibt auch Leute, die tatsächlich nichts, und hier reicht ja nur gamen, alleine machen wollen und da gibt es sicher wie auch bei deinem überzogenen Bsp. genug, die das nicht nur wollen, sondern tatsächlich nicht können. Ich hoffe echt, dass du kein echter Papa bist.","replies":[{"poster":"PapaJLBaer","date":"2016-03-18T22:48:19.365+0000","up_votes":1,"down_votes":1,"body":"Ja . Premadegruppen  werden mit  Premadegruppen  der selben Größe gematcht . 4 vs 4","replies":[]}]}]}]},{"poster":"PapaJLBaer","date":"2016-03-16T22:16:52.477+0000","up_votes":1,"down_votes":3,"body":"Nein einfach Anders.\n\nNenn es verrückt / radikal / oder einfach Fair.\n\nMeine Ansichten haben halt ein ganz andere Level als ihr es habt.","replies":[]}]}]},{"poster":"Wernicke","date":"2016-03-15T14:49:59.972+0000","up_votes":1,"down_votes":0,"body":"Nun, manchmal ist es einfach \"notwendig\".\nBzw, wenn ich weiß das ich das nich des trollen wegens mache, sondern davon überzeugt bin mit der Entscheidung meinem team zu helfen, kann ich das in bestimmten Fällen mit reinem Gewissen machen.\nBeispiel: Der lastpick in meinem team sucht sich einen champion aus der im aktuellen patch abgeht wie ne Kanone. Da denk ich mir doch, ne den bann ich lieber sonst picken Gegner den vorher was suboptimal wäre. \nMan könnte diese Situation auch umgehen, in dem man den firstpick bittet champ xy für ihn zu picken und dann zu tauschen, aber so eine vorangehensweise, oder allgemein vernünftige Kommunikation, findet in meinem low mmr Bereich eher gar nicht statt... \n\nGeschieht so ein bann natürlich ohne jeglichen erkennbaren Grund, oder weil der der bannen muss gerade mal nicht aufpasst, ist es natürlich einfach nur nervig und deprimierend.","replies":[]},{"poster":"MilliDieFrau","date":"2016-03-14T09:42:05.478+0000","up_votes":1,"down_votes":0,"body":"Ich hatte mal einen, der nicht wollte, dass ich Gnar als Supp spiele; habs auch eher als einen Joke als Champion meiner Wahl genommen. Der konnte aber nicht bannen, und hat Gnar dann gepickt und gesagt, dass er lieber Gnar das spielt, obwohl er den nicht kann, als dass er einen Troll im Team hat. Fand ich ziemlich witzig.\n\nAber generell passiert mir persönlich sowas kaum. Was ich mir aber vorstellen kann, ist, dass manche Leute das Risiko nicht eingehen wollen, dass der besagte Champ dann beim Gegner landet und anstatt dann zu kommunizieren, bannen sie den dann weg.\nOder einer hat mal nicht aufgepasst und übersehen, dass du den Champ spielen wolltest.\n\nDann aber von vornherein einen anderen Champ anzugeben finde ich blöd, ist ja eigentlich nicht Sinn der Sache.\n\nLiebe Grüße,\nMilli","replies":[]},{"poster":"ü ö","date":"2016-03-13T05:54:11.470+0000","up_votes":1,"down_votes":1,"body":"Dann wähl deinen Main einfach nicht in der Banphase aus, sondern erst wenn du mit Picken dran bist..","replies":[]}]}