{"poster":"Forge8","date":"2015-03-05T06:30:47.003+0000","title":"Teaching/Leveling Up","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"So I'm a level 26 mid main. I was wondering if there is any possible way to level up 30 slightly faster. I am already versing mid bronze and occasionally a low silver so I would like to get to ranked. I am still in high school so I can only really play Friday, Saturday and Sunday. I was also wondering if there was anyone willing just to maybe help me learn other roles (more specifically support and jungle, they're my weakest, I can play top and adc decently). Nothing too serious. This is mainly just someone to play with and give me tips as I don't have the money for proper coaching. I know this is a lot to ask but it would be greatly appreciated.","replies":[{"poster":"Crusader charlie","date":"2015-03-05T22:57:15.668+0000","up_votes":2,"down_votes":0,"body":"well I can give you a good idea on which supports to take (personally chosen);\n\nbraum:\nhe is excellent against projectile based opponents such as ezreal,caitlyn, jinx, nidalee etc.\nyou will most likely see these champions bot atleast once so it's good to have him there.\nhe is also tanky, can build solid health and defences, and very mobile on the field.\n\ntips:\nmark as many opponents as you can, as quickly as possible. this will set up great multichamp stuns and a good teamfight if you are lucky\n\ndon't just use your W to jump to champions, it can be used to leap to minions just to keep your manoeuvrability.\n\nremember that you can also use your ult to delay a chase and escape\nnautilous:\nremember to basic attack every now and then to stun,\nyour ultimate is a CC train but people can dodge it so make sure they are mostly spent on that or that you have the element of surprise.\nyou are practically bullet proof after a few items so don't be afraid to body block AA's and projectiles (unless its a vayne)\nalso, use your Q wisely as it can decide battles sometimes. you can also use it to escape, dont forget that.\n\nthresh:\nthresh is excellent because he has great lane control and defensive abilities against ganks.\nif you play him right you can use them to punch through the enemies tower with ease.\nthresh Is all about utility and positioning so don't worry too much about how much damage you deal,\nor how much you can hold the enemy down, because in the end its all about being in the right place at the right time.\nyou can lock down most with a Q>R>E combo if you land it properly but it can be wiser to run if need be.\n\n\nxerath:\nxerath may sound weird to most but his w and E are great for lane control, he can prevent ganks to an extent and also lock down enemies for the adc to wipe out. how-ever he should probably be played with a sustainable adc who you can trust eachother with, due to being less defensive than the regular tanky choice, and not having any heals or mana sustain.\nif played well he can be excellent as a support, or if played bad he can be a calamity.\n\nblitz:\nprobably the simplest of any champion, he can hook in his enemies from the turret, he can silence them, he has a knock up and a movement speed bonus, not to mention the silence and shield.\nwith him he can tank most things and pull the enemy team in around him, so your adc can burn out most of their abilities safely.\n\n\nnote:\ncan't stress this enough; to play an effective bot lane you *must* have a solid trust and familiarity with your laning buddy, unlike other lanes, the bot lane relies on team-work right from the start where as other lanes worry about objectives.\n\nI cant tell you about adc's or anything so I hope I helped anyway","replies":[]}]}