{"poster":"Rhøbyn","date":"2017-08-31T03:52:40.127+0000","title":"Amo jugar LoL...","subforum":"Comportamiento del jugador","up_votes":7,"down_votes":3,"body":"Amo jugar League of Legends... Pero Me Rindo. \r\nComo todos, tambi&eacute;n me he molestado alguna vez y dije &quot;GG&quot; pero la mayor&iacute;a de mis partidas intento enfocarme en ganar y en que mi equipo tambi&eacute;n se enfoque y no se distraigan marcando los errores de otro. Incluso a veces llego a invertir varios minutos de la partida en motivar a mis compa&ntilde;eros y guiarnos a la victoria mediante el apoyo mutuo.\r\nNormalmente, de lunes a viernes dedico al menos 12 horas a mis estudios cada d&iacute;a y al final del d&iacute;a no hay mejor manera para despejarme que unas partidas. Incluso me hab&iacute;a propuesto retomar las rankeds luego de medio a&ntilde;o sin jugarlas, sub&iacute; a plata en pocos d&iacute;as. Todo iba excelente, pero todo lo bueno acaba...\r\n_&quot;Maldita perra est&uacute;pida&quot; &quot;ojal&aacute; tus padres mueran hijo de p...&quot; &quot;Eres tan in&uacute;til que deber&iacute;as suicidarte&quot;_ son s&oacute;lo algunos de los insultos que he recibido, cada d&iacute;a, en cada partida, las ultimas semanas han sido una pesadilla. Intento mejorar y aprender, dominar nuevos campeones, quer&iacute;a retomar el rol de adc, el cual hab&iacute;a dejado hac&iacute;a un tiempo, pero s&oacute;lo recibo insultos, insultos y m&aacute;s insultos. S&eacute; bien que los insultos son moneda corriente en el juego, pero nunca hab&iacute;a sido acosada al punto de sentirme una basura como ahora, cuando uno de esos tantos cobardes me deseo la muerte de mis padres estuve a punto de soltar l&aacute;grimas, mi padre muri&oacute; cuando ten&iacute;a 6 a&ntilde;os y es a&uacute;n una herida abierta.\r\nSiempre he intentado poner la mejor cara, evitar los insultos entre compa&ntilde;eros, mejorar como jugadora... ahora s&oacute;lo me pregunto, &iquest;Por qu&eacute; he intentado tanto si no he progresado?&iquest;Y si soy realmente tan basura como me dicen? Al principio los ignoraba y muteaba pero a este punto ya es igual, ya han conseguido que crea sus insultos.\r\n\r\nEstoy al punto de rendirme, de dejar uno de los pocos pasatiempos que tanto disfruto, realmente el acoso en cada partida me ha arrastrado a un pozo de desmotivaci&oacute;n enorme. Quiz&aacute;s ah&iacute; fuera, detr&aacute;s de otra pantalla, haya alguien que pueda darme un consejo o una forma de afrontar esto.\r\nSi has llegado a este punto, gracias por tomarte un momento y leer este peque&ntilde;o descargo de mis recientes experiencias.","replies":[{"poster":"Kouker","date":"2017-08-31T13:13:39.887+0000","up_votes":2,"down_votes":0,"body":"Hola! Creo que llego algo tarde, no sé, pero acá te van mis consejos.\n\n-Lo más importante, no hay que prestarle atención a esos comentarios, gente tóxica hay en todo el mundo lastimosamente y también hay gente que te va a desear todo el mal posible, por que simplemente, son unos ignorantes (perdón la expresión, pero es así) Soy main Thresh con 600.000 puntos, actualmente en Oro, muchas veces me han flameado por mis ganchos, me han dicho de todo, hasta se han burlado de mi por tener éste nombre y errarlos, por que tengo días que no doy ni uno, y eso a veces me desmotiva, dejé de jugar support por ésto, sólo juego de support si juego duo con alguien que vaya ADC, puedo entender un poco tú descargo :), lo mejor que podes hacer es mutearlos.\n\n-Otro consejo es que, no eres basura, todos fuimos malos en algún momento con algún campeón,  y todo se resuelve con practica, mucha practica y paciencia, más que nada ADC, que es un rol bastante dificil ahora mismo, te recomiendo ver vídeos en Youtube para mejorar, no de los de 10 minutos que te enseñan poco del campeón, vídeos de 40 minutos (partidas enteras), también puedes ver personas que hagan directos con el campeón que quieras aprender a jugar (todo ésto si te da el tiempo claramente, si no, igual aprenderás practicando)\n\nNo te rindas, sé fuerte, y ánimos, siempre hay gente para aconsejarte y ayudarte, mucha suerte y ojalá consigas mejorar. Ah, si gustas y no te incomoda, puedes agregarme. Gracias por tomarte el tiempo en leer ésto, no sé si te sirva por que llego algo tarde, pero no pierdo nada intentándolo.","replies":[{"poster":"Rhøbyn","date":"2017-08-31T17:55:04.468+0000","up_votes":1,"down_votes":0,"body":"Hola! Saber que aún hay gente tan razonable y comprensiva me da muchos ánimos, intentaré seguir mejorando e ignorar la lluvia de insultos. Muchas gracias :)","replies":[]}]},{"poster":"Lucio22","date":"2017-08-31T05:52:57.823+0000","up_votes":2,"down_votes":0,"body":"discupa, no quiero ofender a nadie ni darle el visto bueno a quienes dicen eso, pero no deberia importante tanto (en ralidad, nada) lo que digan unos randoms. es como que te pongas mal porque un loco en la calle grita \"puto\" en tu direccion. simplemente lo ignoras y listo (en el caso del lol, mute, report y listo).\nno lo digo con mala intencion, sino que no creo que sea bueno para nadie que le afecte lo que un tarado que no conoce le diga detras de un monitor.\n\npor otro lado, siempre estan los arams (suelo jugarlos mucho y no suelo encontrar flamers) u otros juegos, si es que queres dejar el lol. recomendacion: no cierres la cuenta, capaz dentro de un tiempo te dan ganas de volver y asi no tenes que empezar de 0","replies":[]},{"poster":"xNeriaj","date":"2017-08-31T05:03:18.194+0000","up_votes":2,"down_votes":0,"body":"Te entiendo completamente... Si tratas de probar un nuevo campeón o una posicion especifica, muchas veces te diran algo que te molestara.. Pero oye, levanta ese animo y sonrie, si realmente te gusta, sigue adelante y no te rindas. Si quieres puedes optar por la opcion de jugar con alguien mas o más personas. Yo quiero probar varios campeones de support xD Y tu quieres volver a jugar adc.. Tranquila, no flammeo ~","replies":[{"poster":"Rhøbyn","date":"2017-08-31T10:10:39.625+0000","up_votes":1,"down_votes":0,"body":"Me parece una buena idea, entrare en la tarde y te agrego ^^  gracias por el apoyo","replies":[]}]},{"poster":"lilmonix","date":"2017-08-31T04:07:25.621+0000","up_votes":2,"down_votes":0,"body":"hay mucha gente en tu posición, creo que lo mejor es tratar de ignorar a la gente que te dice esas cosas y la otra es intentar establecer una \" amistad \" con la gente simpatica que encontras\nvolvi a jugar despues de un tiempo unica y exclusivamente porque me toco la nueva skin de Cait en cajita (?) si queres agregame y juga conmigo y mi grupo de amigos, son bastante relajados y no toxiquean a nadie, jugamos para divertirnos, a menos que juguemos rankeds que try hardeamos y nos puteamos (?) pero en discord\npalideszx es mi nombre en el juego","replies":[{"poster":"Rhøbyn","date":"2017-08-31T10:11:38.362+0000","up_votes":1,"down_votes":0,"body":"Genial!  Realmente no quiero dejarlo pero tampoco tenia muchos con quien jugar jeje    en la tarde te agrego :)","replies":[]}]},{"poster":"ElchinoRecoba","date":"2017-09-01T01:45:42.695+0000","up_votes":1,"down_votes":0,"body":"hola, recién termino de leer tu \"descargo\".\nPrimer punto y principal, no te sientas mal por lo que te digan esa gente, no te desanimes como comentabas que andabas mal, no es así, no debes de sentirte mal o desanimada, al fin y al cabo es un juego.\nSegundo; creo que la persona que flamea es porque son la gran mayoria nenes de mama que no tienen idea de nada y no hacen nada. En lo personal te recomiendo reirse de lo que dicen porque no vale nada, no te desanimes trata de siempre tener una sonrisa y reirte, no le des importancia no vale la pena.\nTercero y ultimo, si queres ayuda en algo agregame y hablamos, te puedo dar una mano en tratar de que subas de liga.\nEn fin, NO LE DES BOLA A ESTOS NIÑOS DE MAMA, no vale al pena el que termina perdiendo acá sos vos, no ellos, reite  de lo bobos que son por insultar a alguien en un juego.\nSaludos no te desanimes y seguí adelante.","replies":[]},{"poster":"PDaka","date":"2017-08-31T16:37:31.961+0000","up_votes":1,"down_votes":0,"body":"Lo mejor que puedes hacer es buscarte una premade de 5, encontrar a la gente descente y sera mejor :P","replies":[]},{"poster":"Phantasm","date":"2017-08-31T16:09:40.482+0000","up_votes":1,"down_votes":0,"body":"Porque tomarse tan enserio lo que te dicen personas random y mas en un moba donde se creen \"pros\" y no llegan a nada en su vida, creo que leo lo que dicen en el chat y me dicen a veces y ni razón tienen en justificar sus propias fallas en la partida ni me molesto en apretar enter sigo jugando y viendo como hablan sus boludec e s simple.","replies":[]},{"poster":"Link1n","date":"2017-08-31T07:35:21.264+0000","up_votes":1,"down_votes":0,"body":"pff pasa q muchos les dan bola a lo q dicen mutealos y fue si te joden,yo me cago de risa xDD o los jodo me importa un carajo lo que digan.\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"ona3","date":"2017-08-31T03:59:18.165+0000","up_votes":1,"down_votes":0,"body":"mira a un flamer se lo mute y se lo ignora, eso es todo no hay que llevar el apunte a esas cosas, hoy jugando adc con sivir luego de que mi sup muriera 2 veces y yo 1 me dijo \"gg y dat sivir\" no le respondí y lo mutee segui jugando mi juego a los 10 min ya iba 5 1 yo y sabes que, terminamos ganando la partida, Mi consejo es que si el juego te trata tan mal como dices lo dejes porque no vale la pena sufrir por un juego que te quita mas de lo que te da \nsalu2 y buena suerte","replies":[]},{"poster":"OneHourPhoto","date":"2017-08-31T04:01:53.283+0000","up_votes":1,"down_votes":4,"body":"lo mejor es dejar de jugar, ni riot ni la comunidad valen la pena, primero que riot son incompetentes en 1 millon de cosas, el matchmaking siendo la numero uno, la comunidad despues es un desastre pero bueno, es un moba donde la mayoria son adolecentes inmaduros sin cerebro\n\nyo tambien voy a dejar de jugar, vamos a ser mas felices","replies":[]}]}