{"poster":"Annie Bot Sucks","date":"2015-07-27T13:47:06.161+0000","title":"Xerath rework turned a unique champion into cancer","subforum":"Gameplay","up_votes":14,"down_votes":13,"body":"Laning against him now is dodgeball. Old Xerath had a unique concept and a very clear weakness. If he wants power, he has to give up mobility. If you jump on him, he dies. With new Xerath, jumping on him equates to getting a stun in the face, a slow, and another Q while he kites back and out of range. Amazing.\r\nHe never runs oom. Perma pushes/harasses you in lane, and once he gets ahead, he will kill you from 2 screens away. I'd rather deal with f*cking LeBlanc, at least she has to get in range to kill me.","replies":[{"poster":"Dreadlocks","date":"2015-07-27T14:26:22.394+0000","up_votes":4,"down_votes":0,"body":"\"at least she has to get in range to kill me\" So... get in range to kill him? Hes a squishy immobile mage.","replies":[{"poster":"Annie Bot Sucks","date":"2015-07-27T15:04:17.972+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=xApexPredator,realm=NA,application-id=3ErqAdtq,discussion-id=6fdkMYpi,comment-id=0000,timestamp=2015-07-27T14:26:22.394+0000)\n>\n> \"at least she has to get in range to kill me\" So... get in range to kill him? Hes a squishy immobile mage.\n\n\"Get in range of him\"\n\nRofl. He's two fucking screens away, good luck.","replies":[{"poster":"Dreadlocks","date":"2015-07-27T15:21:00.331+0000","up_votes":2,"down_votes":1,"body":"So close the gap? Most assassins will absolutely destroy him. {{champion:84}} {{champion:91}} {{champion:55}} {{champion:131}} and {{champion:107}} if you are jungle. Just to name a few... The list goes on though.. you could even play someone like {{champion:157}} wall his abilties, use E to dash/dodge them. Get in his face.. If you play at a distance, you are just playing at Xerath's strength.","replies":[{"poster":"Vistha Kai","date":"2015-07-27T15:30:51.112+0000","up_votes":4,"down_votes":1,"body":"Yasuo can only wall the stun. That's exactly ONE ability.","replies":[{"poster":"Dreadlocks","date":"2015-07-27T15:56:38.574+0000","up_votes":1,"down_votes":4,"body":"and the Q? thats 2. =]","replies":[{"poster":"Vistha Kai","date":"2015-07-27T15:58:46.304+0000","up_votes":8,"down_votes":0,"body":"Go ahead and try to block Xerath's Q with the Windwall.\n\nTell me how successful you will be.","replies":[]}]},{"poster":"Abyssphere","date":"2015-07-27T16:36:39.279+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Vistha Kai,realm=EUNE,application-id=3ErqAdtq,discussion-id=6fdkMYpi,comment-id=0000000000000000,timestamp=2015-07-27T15:30:51.112+0000)\n>\n> Yasuo can only wall the stun. That's exactly ONE ability.\n\nTbf it's the most important ability to block when you want to kill him.","replies":[{"poster":"Vistha Kai","date":"2015-07-27T19:40:18.162+0000","up_votes":1,"down_votes":0,"body":"Except Yasuo can't Wall in the middle of a Sweeping Blade, so he's a free meat.\n\nI can see why Xerath might have a problem, but when it comes to killing Yasuo is at a disadvantage.","replies":[{"poster":"Abyssphere","date":"2015-07-27T23:31:30.551+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Vistha Kai,realm=EUNE,application-id=3ErqAdtq,discussion-id=6fdkMYpi,comment-id=000000000000000000010000,timestamp=2015-07-27T19:40:18.162+0000)\n>\n> Except Yasuo can't Wall in the middle of a Sweeping Blade, so he's a free meat.\n> \n> I can see why Xerath might have a problem, but when it comes to killing Yasuo is at a disadvantage.\n\nI know, I wasn't really making a point that Yas can counter him or anything. Just saying if I had to choose a Xerath ability to be able to Windwall, it'd probably be his stun.","replies":[]}]}]}]},{"poster":"Manwalrus","date":"2015-07-27T17:49:39.815+0000","up_votes":1,"down_votes":0,"body":"Don't forget Fizz","replies":[{"poster":"Dreadlocks","date":"2015-07-27T18:26:51.890+0000","up_votes":1,"down_votes":0,"body":"yeah i was just naming a few, i left out Zed too :)","replies":[]}]}]}]},{"poster":"LadyRenly","date":"2015-07-27T15:24:25.452+0000","up_votes":1,"down_votes":0,"body":"In lane, that's never going to happen.","replies":[{"poster":"Dreadlocks","date":"2015-07-27T15:26:50.234+0000","up_votes":1,"down_votes":0,"body":"Happens all the time :O","replies":[]}]}]},{"poster":"Spider Chief","date":"2015-07-27T15:25:11.307+0000","up_votes":1,"down_votes":0,"body":"Either I'm bad at this game or his ult is borderline undodgeable.","replies":[{"poster":"Vistha Kai","date":"2015-07-27T15:29:33.925+0000","up_votes":7,"down_votes":0,"body":"Either I'm bad at this game or his ult is borderline impossible to hit with.\n\nSeriously. Even fucken minions are dodging it... ._.","replies":[]},{"poster":"DrNova","date":"2015-07-27T18:25:24.030+0000","up_votes":1,"down_votes":0,"body":"lol that ult is easy to dodge, hard to hit. Dont run straight away from him.  When you see he ults, run right, then back, then foward, then left, hell stop once.   He HAS to lead the shot to hit you if you are moving, if you change directions every second, it is hard as hell to land.","replies":[]}]},{"poster":"Zair Umbras","date":"2015-07-27T17:01:07.617+0000","up_votes":6,"down_votes":0,"body":"The old Xerath actually used to kill you from two screens away by pressing W. He also didn't need a Void Staff since his W gave him the penetration he needed, his Q was much harder to dodge, and his current W was his R. His E was a targeted ability that used to be able to hit you near cross-screen when pressing W, plus it was targeted, so all you had to do was land the easy to land R to stun after and unload the other 2 R's and a Q.\n\nHonestly, his old kit made him a sitting duck, but he had way too much range and far too much hidden power with his W. It gave him 40% MPen, which is what a Void gave back then, now it's 35%, and it made all of his abilities hit cross-screen. He was a niche pick at best, but if you wanted to snipe some one, his old kit was the kit. Plus, he also laughed at anything that did physical damage since you'd go for the 600-800 AP and end up with enough armor to make a Rammus jealous. lol.\n\nI should also mention that he wasn't very commonly picked since he, much like Ahri, were champions that people had NO idea how to play or even build. For the longest time, everyone and their mother rushed RoA on Ahri until S3 when we had DFG and Athenes rushing Ahris because of ProPlay. lol. Even Gragas was a RoA rusher until LCS brought in Athene's Unholy Grail on him with actual AP items. People were stupid as hell back then and people wondered why 70% of the community was below 1300 ELO. lol. No one knew how to play. At all. At least in NA. ","replies":[]},{"poster":"Stiv1234","date":"2015-07-27T16:12:55.036+0000","up_votes":3,"down_votes":0,"body":"> and once he gets ahead, he will kill you from 2 screens away.\n\nNo. He does not do that. He will poke you really hard, but unless he hits his stun, he has very low kill potential on you, since his ult is really easy to dodge. Thats why they reworked him in the first place, with old Xerath, if you hit your EQ post six, the opponent was dead. The new Xerath cannot combo his ult with his other skills, so he cant really oneshot you till late mid game. Not to mention the % mpen was quite stupid.","replies":[]},{"poster":"Annie Bot Sucks","date":"2015-07-27T17:40:57.099+0000","up_votes":1,"down_votes":1,"body":"Why does a poke oriented mage with infinite range and AoE pushing power given a fucking infinite mana sustain passive?","replies":[{"poster":"ChaosThief","date":"2015-07-27T18:16:35.800+0000","up_votes":2,"down_votes":0,"body":"Considering he has to walk up to something and auto attack it, I would say it's fine.\n\nHe only gets a good amount of mana for auto attacking champions, after all.","replies":[]}]},{"poster":"Fasmodey","date":"2015-07-27T16:47:23.147+0000","up_votes":2,"down_votes":1,"body":"cry more","replies":[]},{"poster":"Catastrop","date":"2015-07-27T23:51:41.205+0000","up_votes":1,"down_votes":0,"body":"Yeah no, infinite mana sustain? Most of the time he'll be attacking minions because he can't to you for an AA and that isn't much mana being restored. Even when he has chalice, his already high mana costs don't help because he has to wait like like 15 seconds just to get back enough for a Q. Place a preemptive ward further in his lane so you see him charging up when you're pushed so you have a heads up and you're fine.","replies":[]},{"poster":"Titanium70","date":"2015-07-27T23:37:37.971+0000","up_votes":1,"down_votes":0,"body":"While I do agree with you in a way (the old selfe root was a really nice Spell)... Old Xeraths E-R combo was pure cancer as well, high range, basicly undodgeable and a guaranted One-Shot if Xerath had a tiny lead. :P","replies":[]},{"poster":"warpenguin555","date":"2015-07-27T23:07:06.354+0000","up_votes":1,"down_votes":0,"body":"dude, I fucking love dodgeball","replies":[]},{"poster":"DrNova","date":"2015-07-27T18:21:59.541+0000","up_votes":1,"down_votes":0,"body":"Old Xerath would, i believe, be impossible to play with mobility creep.\n\nIf you jump on Xerath he still usually dies.  The closer you are to him when he lands the stun, the less time it lasts.\nHe can push lanes pretty easy, and leaves him very open to ganks, and he is an easy gank.\n\nAnd his sustain is pretty low unless he is hitting a champ, or not using enough spells for you to complain about.\n\nFace it, this is another \"I lost to/I dont know how to play against X champ\" thread.","replies":[{"poster":"Annie Bot Sucks","date":"2015-07-27T18:24:13.026+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=DrNova,realm=NA,application-id=3ErqAdtq,discussion-id=6fdkMYpi,comment-id=0007,timestamp=2015-07-27T18:21:59.541+0000)\n>\n> Old Xerath would, i believe, be impossible to play with mobility creep.\n> \n> If you jump on Xerath he still usually dies.  The closer you are to him when he lands the stun, the less time it lasts.\n> He can push lanes pretty easy, and leaves him very open to ganks, and he is an easy gank.\n> \n> And his sustain is pretty low unless he is hitting a champ, or not using enough spells for you to complain about.\n> \n> Face it, this is another \"I lost to/I dont know how to play against X champ\" thread.\n\n\"He is an easy gank\"\n While he pushes the lane from under his turret.","replies":[{"poster":"DrNova","date":"2015-07-27T23:00:09.837+0000","up_votes":1,"down_votes":0,"body":"He cant push to your tower from under his turrent, nor will most players just sit at their turrent all day. And if they do you can stall lane on your side and cs while he gets nothing. \nStop exaggerating and being a drama queen.","replies":[]},{"poster":"Feathermane","date":"2015-07-27T18:34:49.856+0000","up_votes":1,"down_votes":0,"body":"And gankers care about turrets?","replies":[]}]}]},{"poster":"Chespin2013","date":"2015-07-27T19:06:06.890+0000","up_votes":1,"down_votes":0,"body":"Considering your summoner name your main would most likely be Annie a champion that is countered by Xerath. Pretty sure Annie is more of a problem champion than Xerath ever will be. If anything Xerath is easier to play around since all of his spells are skillshots and can be pretty easy to avoid since they show lot of visual effects to play around to dodge them.","replies":[]},{"poster":"A Miss Fortune","date":"2015-07-27T16:58:26.438+0000","up_votes":1,"down_votes":0,"body":"As much as I want to disagree, I don't really think I can.\n\nThey designed Xerath as a REALLY safe Mage that spams his abilities from the first second he steps into lane. Not only is his Q hitbox pretty bad, but it comes on such an enormous range and since his passive allows him to have so much mana sustain, it's really not that fun to go up against him in lane. I wouldn't really call Xerath overpowered, broken, overloaded, etc, but he's very counter-fun since you can't really do much besides play dodgeball until the laning phase is over.","replies":[{"poster":"DrNova","date":"2015-07-27T18:24:01.493+0000","up_votes":1,"down_votes":0,"body":"You can let him push, as he will easily do if he i spamming spels, then call for an easy gank from jung.  His sustain isnt that high, only high if he auto's a champ.  If he is spamming spells so much his lane WILL be pushed, and he is slow and squiishy.","replies":[]}]},{"poster":"Swollwonder","date":"2015-07-27T18:22:38.523+0000","up_votes":1,"down_votes":0,"body":"Play the champ and learn its weakness. How do you hit people with Xerath? Let your minions give you vision and snipe them when they cs. So to counter? Go up to the creeps expecting  a laser. \n\n\"But but...then I miss cs\". Well get over it. Or take a laser to the face I dont care.\n\n\"But Xerath will just get mana back with his passive\" Yeah. Eventually. With his close range autoattack that you can close which is his counter. \n\nXerath is a THE example of a niche pick and he occupies it perfectly.","replies":[]}]}