{"poster":"Doca","date":"2018-06-16T01:44:45.657+0000","title":"RE: /DEV: COMENTARIOS SOBRE LAS CLASIFICATORIAS 2019","subforum":"Creaciones de la comunidad","embed":{"description":"¡Hola! Soy Ed \"SapMagic\" Altorfer, director de Clasificatorias. Hace algunas semanas hicimos un resumen de los comentarios sobre nuestro anuncio inicial de las actualizaciones que realizaremos a las Clasificatorias durante el próximo año. Desde entonces, hemos trabajado arduamente para entregar soluciones que puedan mitigar tus preocupaciones (y también las nuestras) sobre la experiencia.","url":"https://nexus.leagueoflegends.com/es-ar/2018/06/dev-addressing-your-feedback-on-ranked-for-2019/","image":"https://nexus.leagueoflegends.com/wp-content/uploads/2018/06/LOL_CMS_214_Social_1200_pwf8dgnruk2rbjvsqcdh.jpg"},"up_votes":1,"down_votes":0,"body":"&quot;TE PREOCUPA QUE EXISTAN ABUSOS EN EL EMPAREJAMIENTO DE POSICIONES.&quot;\r\n\r\n&quot;existen algunos problemas a resolver: los jugadores podr&iacute;an intercambiar posiciones constantemente con un compa&ntilde;ero en d&uacute;o o colocarse en colas para nuevas posiciones y arrasar con los jugadores con menos habilidad.&quot;\r\n\r\n\r\n\r\n\r\npero igual, no es necesario hacer swap en medio de la seleccion de campeon, ya que como van a jugar entre los 2, simplemente le dec&iacute;s a tu amigo q pike lo que quiera y vos igual, y luego cuando inicie la partida van a las lineas que van en sus roles main, es imposible detectar que a un vladimir fue realmente a la posici&oacute;n de sup, o que un thresh fue mid y menos aun si son campeones como brand o taric, me explico?. Ademas para riot no existen los piks trolls, (ej: taric mid), osea, ES IMPOSIBLE CONTROLAR ESTO!!!","replies":[{"poster":"Love Scars 618","date":"2018-06-16T02:14:54.826+0000","up_votes":2,"down_votes":0,"body":"yo tengo una duda sobre esto: \"ADEMÁS DE UN AYUDANTE DE PROMOCIÓN EN CADA SERIE, LO QUE SIGNIFICA QUE TE PROMOVERÁN MÁS RÁPIDO.\", osea que a principio de temporada habrá promo helper en platino y diamante?","replies":[{"poster":"Doca","date":"2018-06-16T03:32:29.244+0000","up_votes":1,"down_votes":0,"body":"parece q va a ser mas facil subir de elo PARECE no lo se XD","replies":[]}]},{"poster":"HyDoX","date":"2018-06-18T19:49:49.188+0000","up_votes":1,"down_votes":0,"body":"Gente una consulta si yo termino Platino V en esta liga osea en la siguiente arrancaria de 0?  y aparte si llegara a quedar oro 1 en todas las pocisiones x ejemplo el marco de platino de este año me duraria solo 3 meses ya que se divide la  2019 en 3 partes?. porfavor tengo esas dudas alguien sabe?\n\nprofavor responanme x email hydox00@gmail.com o wasap: 11 2390 2529","replies":[]},{"poster":"DEBIRUMAN","date":"2018-06-16T03:40:23.213+0000","up_votes":1,"down_votes":0,"body":"CREO que estableces 2 roles principales que estaran determinados quiza por los champs que más uses o los hechizos\nahora lo que NO ENTIENDO PARA NADA es la parte de \"podras subir rapido más de un carril pero al mismo tiempo si trolleas o pierdes tambien (+/- 3; +/- 10 y +/-15)\" esto me parece ridiculo mira si perdes por afk o 2 trolls seguidos que \"justicia\" que te bajen más puntos \ndeberian hacer como dijo un comentario: calcular los puntos por KDA (que se puede mediante el sistema de las S A B C D) asi si jugas bien y perdes no te bajan puntos","replies":[{"poster":"Doca","date":"2018-06-16T04:18:18.440+0000","up_votes":1,"down_votes":0,"body":"no, ya que si tenes un afk, al intentar ganar la partida igual es probable q mueras igual y seamos sinceros, es mas dificil sacar S cuando perdes que cuando ganas, ademas de que muchas veces haces exelentes partidas y no te dan buena nota. ej: a mi en 3 partidas seguidas me puse a probar a ez, y aunque no saque S aunque fui el que mas daño aporto del team, por lo general mi score al final de la partida fueron algo super normalitos, 3/2/14. osea, jugue bien, aporte mucho daño pero aun asi no me dieron S","replies":[]}]},{"poster":"Wawüz","date":"2018-06-16T03:04:18.545+0000","up_votes":1,"down_votes":0,"body":"Dijeron algo respecto a eso, que de alguna forma iban a saber que linea fuiste, tal vez algo como: le hiciste mucho daño al {{champion:516}} que era el TOP enemigo y casi nada al {{champion:13}} que era el MID, participaste tirando la torre de TOP y no la de MID y resulta que tu deberias haber ido MID. Entonces tal vez el sistema detecta algo raro y se aplica la sancion, pueden hacer algo por el estilo, realmente no lo se, no soy programador y no se cuales son los limites de esto.","replies":[{"poster":"Doca","date":"2018-06-16T03:32:06.166+0000","up_votes":1,"down_votes":0,"body":"si no se, puede ser, pero parece medio complicado. sobre todo si hablamos en terminos de pl. que pasa si te mataron y tu top tiro tp a bot y por ende tiraron bot, vos haces la rotacion a top y vos tiras la torre de top. no se si me explico\n\nsinceramente me parece algo medio complicado que tome una decision tan importante con tan solo esos datos, sobre todo cuando hablamos de que te puede o no tocar tus pl correspondientes segun lo que interpreto el sistema.","replies":[]}]}]}