{"poster":"Doca","date":"2018-09-15T14:30:46.812+0000","title":"Como hacer para que el jugo me vaya a los maximos fps posibles","subforum":"Problemas Técnicos","up_votes":7,"down_votes":0,"body":"ya se que tengo un monitor de 60hz y que si me dice que el juego va a 500 fps a mi solo me va a mostrar 60, pero por simple curiosidad me gustaria saber cuntos fps me puede dar mi pc en este juego. La cosa es que he toquetiado las opcienes de arriba a abajo, y no importa si el juego esta al minimo o al maximo a mi me va a 60 fps (aun cuando puse en la otra casilla que los fps fueran &quot;sin limite&quot;)","replies":[{"poster":"Falkon","date":"2018-09-15T14:37:29.732+0000","up_votes":5,"down_votes":0,"body":"No se como hacer para que un jugo de manzana se vea a 60 cuadros por segundo.","replies":[{"poster":"Turing Test","date":"2018-09-15T18:21:24.790+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FalkonPunchRah,realm=LAS,application-id=X54mVVp0,discussion-id=5bFOsOdE,comment-id=0000,timestamp=2018-09-15T14:37:29.732+0000)\n>\n> No se como hacer para que un jugo de manzana se vea a 60 cuadros por segundo.\n\nVelo en una Apple {{sticker:sg-ahri-2}}","replies":[]}]},{"poster":"Turing Test","date":"2018-09-15T18:25:14.814+0000","up_votes":1,"down_votes":0,"body":"[nVidia Profile Inspector](https://www.guru3d.com/files-details/nvidia-profile-inspector-download.html)\n\nhttps://i.imgur.com/jMGcFpz.png\nhttps://i.imgur.com/eP65U8b.png\n\nSi no te abre el Profile Inspector, probá una versión más vieja\nA propósito, solo tarjetas nVidia. Para AMD hay otras utilidades","replies":[]},{"poster":"Paco87","date":"2018-09-15T17:27:32.231+0000","up_votes":1,"down_votes":0,"body":"Seguramente algo como la config de tus gráficos no le está permitiendo subir de 60 FPS.\n**La sincronización vertical NO TIENE que estar activada, y el límite de fps lo ideal sería que lo decidas vos.**\nAcordate que lo que realmente un gamer debería querer es **ESTABILIDAD**, y no FPS guasos...\n\nEl ojo humano no nota diferencia en la imagen pasados los 90FPS\n(y algunos dicen que más de 80 ya da igual),\ncon eso en mente, uno debería querer estabilidad, es decir, que los FPS no se muevan mucho.\nPrefiero FPS entre 70 y 90, y no que se muevan entre 70 y 130, me explico?\n\n\nAsegurate de lo que dije primero, y googleá a pleno, y cualquier cosa agregame y lo solucionamos pa.\n\nUn saludo","replies":[]},{"poster":"ghost134","date":"2018-09-15T14:48:20.466+0000","up_votes":1,"down_votes":0,"body":"por ahi tenes la v-sync activado, eso limita los fps a no mas de 60. Si lo desactivas va subir mas los fps .","replies":[{"poster":"Doca","date":"2018-09-15T15:55:06.983+0000","up_votes":1,"down_votes":0,"body":"no, actidavada o desactivada no me pasa de los 60 fps, y no importa si esta en modo \"sin limite\" y no importa la calidad de los graficos","replies":[]}]}]}