{"poster":"Tupaco","date":"2017-04-05T00:00:08.848+0000","title":"PBE account gone?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Last month I finally got a pbe account and played a bit then EOC's and ACT's came up. So I barely had time to play pbe so I only played a bit of normals here and there but I come back after seeing new support champion and my account itself is gone... help!","replies":[{"poster":"Porocles","date":"2017-04-06T17:45:19.463+0000","up_votes":1,"down_votes":0,"body":"What's EOC and ACT?  Are you getting an account disabled message, or is it coming up with invalid credentials?  Let me know with more details on what's happening when trying to get onto the PBE.  I'm happy to take a look!","replies":[{"poster":"Tupaco","date":"2017-04-07T15:31:19.753+0000","up_votes":1,"down_votes":0,"body":"EOC and ACT are tests in louisana. Anyway I've tried logging in it act like account doesn't exist. I tried recovering information VIA email recover haven't gotten anything at all. Unless account recovery was down, It seems like my account is completely gone or just un accessible","replies":[{"poster":"Porocles","date":"2017-04-07T15:43:56.342+0000","up_votes":1,"down_votes":0,"body":"Aha, thanks that clears things up!  Sending am email was a solid plan, so our account recovery team can assist!  Do you have a ticket number?\n  Also, make sure that you're also logged into the correct region on your patcher!","replies":[{"poster":"Tupaco","date":"2017-04-07T15:52:36.072+0000","up_votes":1,"down_votes":0,"body":"Yea I'm in correct region. I didn't submit a ticket. I will now.","replies":[{"poster":"Porocles","date":"2017-04-07T15:53:50.780+0000","up_votes":1,"down_votes":0,"body":"Gotcha!  Fill out an [account recovery form](https://support.riotgames.com/hc/en-us/requests/new?ticket_form_id=72416) in this case, which will go directly to our account recovery team.  We'll see you there!","replies":[]}]}]}]}]},{"poster":"LostMyBalsInNAMI","date":"2017-04-05T10:11:08.055+0000","up_votes":1,"down_votes":0,"body":"good to know im not the only one experiencing this issue! been trying my username and password nonstop and it simply just acts like my account never existed saying incorrect user and pass when ive had the same info for a year and a half now ;/. Also tried creating a new account but all of the PBE signup links are not working or the web pages are down for them....","replies":[]}]}