{"poster":"Syphur","date":"2015-04-16T13:07:08.167+0000","title":"Spoiler-free Shoutcasting","subforum":"Esports","up_votes":6,"down_votes":0,"body":"Dear Riot Shoutcasters,\r\n\r\nCan you please try not to reveal the outcome of other games during a game? I&#039;m in the Air Force and my job has me out of the house for 4 days at a time and I can&#039;t stream the games live and watch all the games in exact order. I have to watch them on YouTube very slowly since the Internet where I work is extremely slow. It was a little disheartening to watch the TSM and TIP playoff series and learn that C9 had won the other series before I had a chance to watch it.\r\n\r\nI&#039;m not trying to offend the shoutcasters in any way whatsoever, I would just like to request that if you can try to keep other games&#039; outcomes disclosed until the anylyst desk. This would be much appreciated.\r\n\r\n                                                                                        Sincerely,\r\n A huge LCS fan.","replies":[{"poster":"Syphur","date":"2015-04-17T00:54:17.214+0000","up_votes":1,"down_votes":0,"body":"Yeah I suppose you get into the moment and forget but it's such a let down. Half the fun of watching a BO5 series is not knowing who is going to make it in the end.\n\nI got to see the UOL vs SK gaming series spoiler-free and I was on the edge of my seat the whole series, especially the last game. I would have been devasted if I knew the outcome of that series ahead of time.","replies":[{"poster":"Vixanys","date":"2015-04-17T14:40:55.639+0000","up_votes":1,"down_votes":0,"body":"This is understandable, there are so many ways for games to be spoiled. Social Media, Reddit, LoL Forums, the added mis-step from a caster is just another in the pile of things looking to spoil the fun.","replies":[]}]},{"poster":"Vixanys","date":"2015-04-16T19:59:07.527+0000","up_votes":1,"down_votes":0,"body":"It should be that way anyways. They specifically promote the VODs as Spoiler Free. Just seems like some casters get excitable and forget about that.","replies":[]}]}