{"poster":"Seungsoo","date":"2019-02-01T10:40:39.393+0000","title":"Third party software causing game to crash?","subforum":"Help & Support (OCE)","embed":{"description":null,"url":"https://imgur.com/s7Docik","image":null},"up_votes":1,"down_votes":0,"body":"Since the 9.2 patch I have been experiencing an issue where my game would crash during game.\r\n\r\nThe error message that appears states that a third party software may be causing this. I do not play with any other app or software open while playing League, not even the League client. I have never seen this message nor has my game ever crashed before the 9.2 patch so maybe something is related? I have tried using the Hextech Repair Tool to do a clean uninstall and reinstall however it was no use.\r\n\r\n[Error message that appears](https://imgur.com/s7Docik)\r\n\r\nIn detail this is the order of events of what happens:\r\n1. Game runs normally to the 30 minute mark\r\n2. Soon after 30 minutes it will crash, appearing with the error message and windows error sound, forcing me to ALT + F4\r\n3. Game closes and I am given the choice to reconnect via the client that open by itself\r\n4. Soon after reconnecting I get the error but I can&#039;t ALT + F4 or close the game in any way\r\n\r\nThis results in me having to restart my PC completely, which usually by the time I do so, the game has ended with a loss and sometimes a penalty.\r\n\r\nSome help would be appreciated otherwise for the time being I will have to quit playing League.","replies":[{"poster":"Ninox","date":"2019-02-02T02:46:11.119+0000","up_votes":2,"down_votes":0,"body":"There was a configuration issue that caused this some time ago (a couple weeks?) but I was under the impression that had been fixed. I'd recommend submitting a ticket to player support detailing the issue for now: https://support.riotgames.com/hc/en-us/requests/new","replies":[{"poster":"Seungsoo","date":"2019-02-02T11:10:41.260+0000","up_votes":1,"down_votes":0,"body":"I have contacted them and I am currently in the process of getting help. Thank you for the suggestion!","replies":[]}]},{"poster":"Animato","date":"2019-02-01T13:52:04.376+0000","up_votes":1,"down_votes":0,"body":"Same here!","replies":[{"poster":"WhyDidYouDie","date":"2019-02-04T08:37:49.420+0000","up_votes":1,"down_votes":0,"body":"a fix has been found - if youre on windows its the xbox gaming display, you disable the overlay, aswell as its monitoring capablitlies.","replies":[]}]},{"poster":"Mithquissir","date":"2019-02-02T18:41:34.866+0000","up_votes":1,"down_votes":0,"body":"My game crashes around 30-32 min in game and after I reconect starts happening every 5 min.I tried to reinstal my game repair client and even reinstal windows and still have same problem.Lost my last 4 ranked games coz of that.This is the msg I get when it crashes:\n\n“A critical error has occurred and the process must be terminated.\nThis is usually do to the result of incompatible 3rd party software being installed on your machine.\nPlease disable any overlay, streaming, or experience ‘enhancment’ software. Additionally, you may need to whitelist this application with your security software.”","replies":[]},{"poster":"WhyDidYouDie","date":"2019-02-02T01:43:25.021+0000","up_votes":1,"down_votes":0,"body":"same problem here, many people are having this problem. not only on oceania server either. but so far no answers.\ni got put in leaver buster and demoted twice despite reconnecting every time it reloaded .","replies":[]}]}