{"poster":"BP RedoX","date":"2018-05-31T07:54:51.207+0000","title":"Clan Eröffnung. Suche einen Co-Admin der lust hat einen League Clan zu eröffnen","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Der Plan ist einen Clan zu er&ouml;ffnen wo Spieler sich treffen k&ouml;nnen um zu Zocken For Fun oder auch TryHarden :) Die leute sollen  Spa&szlig; miteinander haben und einfach einen Platz wo sie hin kommen k&ouml;nnen um miteinander Spa&szlig; zu haben :D #Community . Supporter und Moderatoren werden gesucht . Innerhalb des Clan k&ouml;nnen Teams zum Comp. spielen er&ouml;ffnet werden. Der Clan dient als Oberstelle . Du hast lust ? Dann adde mich einfach in League ^^ Ign : RedoXLUL","replies":[{"poster":"Izaya Kumiho","date":"2018-05-31T15:10:32.468+0000","up_votes":1,"down_votes":0,"body":"Alright,...\nda du grade nicht ingame erreichbar bist, schreibe ich dir einfach hier meine Fragen hin und so o/\n\n1. Warum genau möchtest du einen eigenen Clan aufmachen, anstatt dich i-wo anzuschließen?\n\n2. Was wird deinen Clan besonders machen? Was sind die Gründe, um genau deinem Clan zu joinen, wenn die meisten Clans bereits die selben Möglichkeiten bieten?\n\n3. Was glaubst du, wie hoch die Chance auf neue/ mehr Mitglieder ist, wenn es für jeden dritten Spieler einen eigenen Clan gibt, welcher nicht groß wird und trotzdem Werbung auf verschiedenen Plattformen macht?\n\n4. Soll es sich hier um einen League-only-clan handeln, oder eher Multigaming betrieben werden?\n\n5. Discord oder TS3?\n\n6. Teilweise gehen Clans unter, weil sie sich keine Gedanken über das Regelwerk gemacht haben. Hast du bereits ein Regelwerk, welches nicht \"der Standardkrams\" ist? Schließlich hat jeder Clan ein anderes Verständnis für den so genannten \"Standard\".\n\n7. Wie soll der Name des Clans und der Tag lauten?\n\n8. Wie sehen die weiteren Zukunftspläne aus? Willst du mit deinem Clan später beim Tectum sein, oder von alleine zu einer Masseninv-gruppe werden? Soll die Community eher klein bleiben?\n\n9. Was tust du, wenn du zwar Member bekommst, diese aber nicht mehr wieder kommen nach 1-2 Tagen?\n\n10. Was tust du, wenn du gar keine Member über einen längeren Zeitraum bekommst und du dadurch deine aktuellen Leute verlierst? \n\n11. Welche Anforderungen möchtest du stellen? \n\n12.Was wird in der Zukunft angeboten werden können? Kommen mehr Punkte dazu?\n\n_______________\n\nIch frage nur, weil viele Clans sich niemals diese Fragen selbst stellen und unter anderem dann daran zu Grunde gehen.\nEs ist wichtig, alles genau zu planen und so D:\n\nIch möchte dich natürlich auch nicht entmutigen! Ich bin mir sicher, dass das sogar etwas werden könnte, wenn du den Kampfgeist dafür hast.\n\nedited: die punkte wurden falsch angezeigt ._. rip","replies":[]}]}