{"poster":"mauro71404","date":"2015-03-21T21:07:23.051+0000","title":"¿Cúales son los campeones que más odias?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Comenta en este post 9 campeones que crees que son los más molestos o que odias según tu opinión,  y también si quieres poner porqué lo odias.\r\n\r\n1- Blitzcrank : Odio a este campeón porque siempre si te agarra con su Q no hay forma de salir vivo, no importa si te pones atras de los minions para que no te agarre, si el se pone runas y maestrias full tanke ese campeón le da igual todo.\r\n\r\n2- Tresh : Odio a este campeón porque hace lo mismo que blitzcrank pero el tiene más cc y es un poco más difícil de usar.\r\n\r\n3- Malzahar : La W de malzahar hace un daño increíble, su ultimate dura tanto que te puedes ir a preparar un café con tortas y terminarlo de comer, pero lamentablemente ya estarás muerto.\r\n\r\n4- Hecarim : Este campeón se rushea una trinity force, unas botas de movilidad y ya puede hacer lo que quiera, corre demasiado y hace mucho daño, además que su R es otro método de escape, corre y corre, y cuando llega el momento de la TF le da cabezasos al teclado y con eso ya darás la partida entera a tu favór.\r\n\r\n5- Viktor : El daño de su E es free elo, tiene muchísimo AP teniendo pocos objetos, y con la build llena... wow... definitivamente puedes destruir el mundo entero.\r\n\r\n6- Renekton : Este campeón compres lo que le compres aguanta demasiado, con solo una capa solar tener posibilidades de tankear más de 10 torretasos, movilidad buena con su E, un stun que tiene buena duración, se cura 500 de vida con su Q, etc.\r\n\r\n7- Swain : El campeón que más odio de lol es este, Swain provoca terror en sus enemigos adoptando la forma de un cuervo temporalmente. Durante este tiempo, los cuervos arremeten contra hasta 3 enemigos cercanos. Cada cuervo inflige daño y le cura a Swain la mitad del daño causado.\r\nEnfriamiento: 8 segundos\r\n\r\nActivación: Swain se transforma en un cuervo. Durante este tiempo, hasta 3 cuervos menores arremeten contra los enemigos cercanos cada segundo, prefiriendo a los campeones. Cada cuervo inflige 90 (+0.2) puntos de daño mágico y cura a Swain un 75% del daño infligido contra campeones, y un 25% contra súbditos. O_O {{champion:222}} \r\n\r\n8- Fidlesticks : Este campeón te tira su Q y puedes ir a mirar un vídeo de vegeta777 de esos de minecraft de 1 hora y cuando vuelvas tendrás ya estarás muerto por su equipo ya que les diste mucha ventaja, o también te puede tirar un silence de 1 año, también es una opción.\r\n\r\n9- Rengar : Un rengar fedeado es 100% imposible de contrarrestar si eres un adc, si eres una leblanc con zhonyas existe la posibilidad que vivas claro, pero con un adc es 100% imposible, se tira ultimate, luego da clic derecho al adc y empieza a darle puñetazos al teclado y mueres en 0,1 segundos. Si tienes un ángel guardían puedes vivir si tu equipo supo hacer bien la tf, si no morirás devuelta {{champion:17}} .","replies":[{"poster":"Alfacito","date":"2015-03-21T22:58:06.009+0000","up_votes":2,"down_votes":0,"body":"{{champion:7}} Todo el daño y nada de cd.\n{{champion:238}} Creo que este es obvio porque\n{{champion:54}} Si va ap te saca todo el daño de una sin dejarte reaccionar a tirar zonhya o flashear\n{{champion:64}} lo vi tantas veces en la jg que ya lo odio\n{{champion:35}} solo odio a los shacos que campean todo el dia. en una partida un shaco me gankeo 6 veces seguidas y no pudo ni sacarme el flash ni matarme\n{{champion:67}}  No odio a vayne, odio a casi toda la gente que la usa. casi todos se creen buenos porque hacen una o dos kills y se creen lo mejor del mundo por esquivar una habilidad. encima casi todos los \"main vayne\" son re toxicos\n{{champion:89}} Ese stunlock que no te deja hacer NADA","replies":[]},{"poster":"Ruphian","date":"2015-03-22T04:15:16.262+0000","up_votes":1,"down_votes":1,"body":"Cualquier campeon fideado te va a joder, tu odio hacia Rengar es infundado.","replies":[{"poster":"mauro71404","date":"2015-03-22T04:51:32.505+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PantheraVolt,realm=LAS,application-id=v7qsfXsE,discussion-id=EGuetOYv,comment-id=0008,timestamp=2015-03-22T04:15:16.262+0000)\n>\n> Cualquier campeon fideado te va a joder, tu odio hacia Rengar es infundado.\n\nCallate K-PO","replies":[]}]},{"poster":"RNGesus","date":"2015-03-21T23:52:30.394+0000","up_votes":1,"down_votes":0,"body":"Todos los que te ccean haciendo click {{champion:72}} {{champion:13}} {{champion:80}} {{champion:33}} {{champion:90}} {{champion:57}} {{champion:117}} {{champion:127}} {{champion:111}} {{champion:44}} {{champion:19}} {{champion:77}} {{champion:4}} {{champion:86}} {{champion:1}} {{champion:89}} {{champion:254}} {{champion:9}}  , los detesto x que tienen habilidades sin counterplay","replies":[]},{"poster":"Devoto Lunari","date":"2015-03-21T22:34:37.607+0000","up_votes":1,"down_votes":0,"body":"teemo\n\n\n{{champion:17}} = satanas","replies":[]},{"poster":"Estoy AFK","date":"2015-03-21T22:04:44.993+0000","up_votes":1,"down_votes":0,"body":"frutarina.","replies":[]},{"poster":"Lucrexio","date":"2015-03-21T21:58:09.333+0000","up_votes":1,"down_votes":0,"body":"{{champion:12}} {{champion:1}} {{champion:42}} {{champion:81}} {{champion:105}} {{champion:104}} {{champion:126}} {{champion:43}} {{champion:117}} {{champion:99}} {{champion:20}} {{champion:35}} {{champion:17}} {{champion:44}} {{champion:45}} {{champion:62}} {{champion:26}} \nSimplemente son seres despreciables a mi gusto.","replies":[]},{"poster":"JB Fan Girl","date":"2015-03-21T21:57:18.595+0000","up_votes":1,"down_votes":0,"body":"Katarina","replies":[]},{"poster":"Jack310","date":"2015-03-21T21:40:43.130+0000","up_votes":1,"down_votes":0,"body":"SOLO ODIO A 1 SOLO CAPEON Y ESE ES {{champion:119}}  POR QUE porque es {{champion:119}}","replies":[]},{"poster":"el Loko Deniss","date":"2015-03-21T21:12:00.789+0000","up_votes":1,"down_votes":0,"body":"draveennnnnnnnnnnnnnnnnn\"!!!!!!!!!!!!","replies":[]}]}