{"poster":"MisterZiup","date":"2016-03-04T17:37:51.331+0000","title":"Stört denn keinen dieses Matchmaking?","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":2,"body":"Seit dem Update, nachdem man aussuchen musste welche Position man haben m&ouml;chte, kann ich nicht mehr ernsthaft meine Positionen angeben.\r\nIch bin main Jungle und Support. Man kann sich sicher denken, welche ich zu 100% spiele, selbst wenn sich Sie als zweite Wahl angebe.\r\nDie &uuml;blichen Ratschl&auml;ge waren bisher: &quot;W&auml;hle doch die Mitte als zweite priorit&auml;t. Die bekommst du dann eh nicht&quot;. - Pustekuchen\r\nUnd das ist ja auch nicht der Sinn dieses Auswahlsystems.\r\nIch w&uuml;rde gerne wieder eine ausgeglichene Anzahl an Jungle und Support spielen haben.\r\nMeinungen und Tipps h&ouml;re ich mir gerne an\r\nLG Ziup","replies":[{"poster":"MisterZiup","date":"2016-03-04T17:59:23.626+0000","up_votes":3,"down_votes":0,"body":"Das ganze Problem kennt man ja schon von dem Teambuilder. Warteschlangen auf anderen Postionen brauchten alle recht lange.\nBei der alten Queue hat man wenigstens durch die Platzierung ab und zu mal glück gehabt und oben gestanden. Das hieß dann wenigsten alle paar spiele\nkonnte man genau das spielen was man haben wollte. \nAber dann sollen die doch einfach ein Punktesystem machen. 3,4 mal wird die zweite wahl genommen, wenn gefüllt werden muss und spätestens dann wird die 1. Rolle vergeben. Ich habe nicht dagegen ggf. ein paar Minuten darauf zu warten. \nMomentan bewirkt das System nur, dass ich keine Lust mehr auf Supporten habe und mich für Top/Jungle eintrage.","replies":[]},{"poster":"Sihari","date":"2016-03-04T17:57:05.833+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist, dass die Support-Position immer unbeliebter wird (woran auch diese Warteschlange eine Mitschuld trägt) und somit die, die Support angeben auch zu 100% dort hin müssen, um überhaupt ein paar Spiele starten lassen zu können.\nMich selbst stört das auch ziemlich und ich erwische mich immer öffter dabei, wie ich anstatt Top/Support Top/Mid angebe, weil ich einfach keine Lust mehr darauf habe, ständig zu supporten.","replies":[{"poster":"NuKulaR85","date":"2016-03-08T08:45:41.454+0000","up_votes":1,"down_votes":0,"body":"Stimmt so nicht ganz, ich queue meisten mit \"Supp / Fill\" oder nur \"Fill\".\nBekomme recht häufig Top und Jungle...","replies":[{"poster":"Sihari","date":"2016-03-08T09:22:18.377+0000","up_votes":1,"down_votes":0,"body":"Dann kann ich Riots System noch weniger verstehen... Wenn ich mit Top/Support antrete, dann werd ich auch in 99% der Fälle Support. Wenn ich auf diese Weise häufig Top bekommen würde, dann wäre ich glücklich und hätte mich niemals beschwert. Aber Riot möchte mich wohl ärgern...\n(Oder, Achtung Verschwörungstheorie, das System erkennt, dass ich in der Vergangenheit sehr gern supportet habe und denkt, dass es mir damit etwas gutes tut!)","replies":[]}]},{"poster":"MisterZiup","date":"2016-03-04T18:05:11.043+0000","up_votes":1,"down_votes":0,"body":"Das ist mittlerweile auch meine Lösung. Ich fange an Toplane zu trainieren, damit ich Top/Jungle wählen kann.\nEigendlich schade :(","replies":[]}]},{"poster":"Porogeddon","date":"2016-03-04T17:57:46.148+0000","up_votes":1,"down_votes":0,"body":"Ich bin auch Top und Supp spieler.\nalso spiel ich zu 99% Supp.\n\nIst doch Gut \n\n\nAlso auf deine Frage.\n**_Nein es stört mich nicht._**","replies":[{"poster":"MisterZiup","date":"2016-03-04T18:03:18.203+0000","up_votes":1,"down_votes":0,"body":"Dich stört es nicht, weil du mit dauernd nur Supporten zufrieden bist. Es gibt aber auch leute, die gerne auf anderen Positionen auch noch spielen würden. Du bist von dem Problem genau so wenig betroffen wie jemand, der main Jungle/Mid spielt und hast deshalb selbstverständlich kein Problem damit.","replies":[{"poster":"Porogeddon","date":"2016-03-05T11:09:36.718+0000","up_votes":1,"down_votes":0,"body":"ich versteh was du meinst.\nABER\nwenn ich was anders spielen will,\nSpiel ich Normels oder geh in irgendeinen Chat und such mir 4 Leute.\nEs ist also alles in allen recht schnell gelöst das problem.","replies":[{"poster":"MisterZiup","date":"2016-03-05T13:46:12.685+0000","up_votes":1,"down_votes":0,"body":"Gut das kann man machen, aber ich möchte ja grade überwiegend Jungle spielen. Das ist meine Main position - ich spiele dort noch besser als beim supporten","replies":[]}]}]}]},{"poster":"Glaskanone","date":"2016-03-04T17:55:31.836+0000","up_votes":1,"down_votes":0,"body":"Spiel einfach mit jemand der Main Support ist, dann ist doch das Problem gelöst.","replies":[]},{"poster":"Alustus","date":"2016-03-04T17:51:33.035+0000","up_votes":1,"down_votes":0,"body":"Das st leider nicht machbar da es viel weniger Support Spieler gibt als Jungle/Mid/ADC/Top\n\nSmoit ist der Random faktor ziemlich gering.\n\nmich stört es auch aber riot wird es nicht ändern da die Warteschlangen noch länger dauern würden als jetzt, und schon jetzt wird diese kritisiert","replies":[]}]}