{"poster":"Kawaii Nai","date":"2019-01-12T05:43:32.120+0000","title":"Neeko - Bitte Dmg basierend des HP des Gegners.","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Neeko macht zu viel Dmg auf squishys, bei Tanks aber gef&uuml;hlt null.\r\nMan kann 500 AP haben, wenn der gegner um die 120 Mr hat und um die 3k Leben macht man als Neeko einfach kein schaden.\r\n\r\nIch w&auml;re daf&uuml;r von der Q und Ult n bisschen schaden runter zu nehmen, damit man squishys nicht mit einer Q oder nur mit der Ult instant killen kann, daf&uuml;r aber eine Skalierung basierend des Maximalen lebens des ziels. Damit man nicht unn&ouml;tig gegen Tanks ist.","replies":[{"poster":"DerPunkt","date":"2019-01-12T07:14:57.728+0000","up_votes":6,"down_votes":0,"body":"NEIN NEIN NEIN\n\nEs gibt einen Grund wieso sie keinen Schaden an Tanks machen soll.\n\nDa kannst du gleich allen Champs die selben stats geben, denn dann haben wir wahrlich die League of DMG, werr zuerst R drückt gewinnt.\n\nEs ist OK dass sie mich als ADC in ihrer Ult oneshottet, wenn sie es schafft soweit in die Backline zu kommen oder ich soweit und aggressiv Vorne stehe, dann geht das klar, wenn ich keinen Flash habe oder anhand ihrer Bewegung nicht vorhersehen kann was passiert.\n\nWelchen guten Grund gibt es, dass Neeko jetzt auch noch ein Tankbuster sein soll? Sie ist an sich an einem guten Punkt. Sie haut böse rein, kann aber komplett denied werden wenn ein Tank oder Bruiser sich mit ihr befasst, genau so sollte es in League sein, wenn du weißt was dein Job ist und du in erledigst gewinnst du. \nSonst will ich bitte auch ein passives Zhonyas für alle ADC damit sie nicht von einem über die Wanddaschenden Assassin getötet werden, denn dass ist ja auch unfair. kappa","replies":[]},{"poster":"Amycos Cyrus","date":"2019-01-12T09:56:34.920+0000","up_votes":2,"down_votes":0,"body":"Rein von dem, wie Neeko präsentiert wurde handelt es sich bei Neeko um eine so genante Burst-Mage.\nSie wird also in den Möglichkeiten das Leisten, was auch die anderen Burst-Mages leisten.\n\nHierzu einfach mal alle Burst-Mages laut Lol.wikia, da die offiziellen Seiten von Riot diese Kategorisierung nicht durchgängig nutzen. (Leider)\n{{champion:103}} {{champion:1}} {{champion:63}} {{champion:43}} {{champion:7}} {{champion:127}} {{champion:99}} {{champion:518}} {{champion:61}} {{champion:134}} {{champion:4}} {{champion:45}} {{champion:142}} {{champion:143}} \n\nMal von der Brand-Passive abgesehen, macht keiner dieser Champions prozentualen Schaden und es ist auch von keinem dieser Champions die Aufgabe einen Tank zu töten. Sie sind in gewisser Hinsicht stabilere Attentäter, die halt unterschiedlich ausgeprägt auch deren Charakteristika besitzen.\n\nDen Schaden runter zu nehmen kann ich mir gut vorstellen, jedoch ihn durch %-Schaden zu ersetzen ist definitiv nicht der Weg, den Neeko beschreiten sollte/kann.","replies":[]},{"poster":"Cenâreth","date":"2019-01-15T11:31:24.884+0000","up_votes":1,"down_votes":0,"body":"Gebt ihr True Dmg wie allen anderen auch, dann ist die Welt ja wieder in Ordnung ...","replies":[]},{"poster":"Veezey","date":"2019-01-12T22:40:36.256+0000","up_votes":1,"down_votes":0,"body":"Hier Burstmage dies das finde ich niocht gut diese muss ich sagen, weil diese ist nicht gut weißt bescheid.","replies":[]}]}