{"poster":"piNuz88","date":"2015-04-21T16:16:24.824+0000","title":"Drop Hack","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve a tutti!\r\nDurante un duo in Ranked (eravamo messi bene diciamo) all&#039;improvviso crasha tutto (tentativo di riconessione...). Dopo esserci informati sull&#039;accaduto anche con altri player di LoL, scopriamo che siamo stati vittima di drop hack.\r\n\r\nOra, essendoci rassegnati sulla vittoria, e vabb&egrave;...ma quanto tempo ci vuole perch&egrave; sia possibile rifare una nuova partita? Perch&egrave; &egrave; da mezz&#039;ora che sui nostri client di Lol c&#039;&egrave; solo il pulsante riconnetti, che ovviamente, non si riconette a niente.\r\nSoluzioni?\r\n\r\nP.S. Ma non si pu&ograve; fare qualcosa di serio per i player che usano quest&#039;altissima forma di rosicata nucleare?\r\nGrazie.","replies":[{"poster":"Dottyx","date":"2015-04-21T23:55:49.437+0000","up_votes":1,"down_votes":0,"body":"è successo anche a me ed altri 3 miei amici, sono gia 45 minuti, mentre altri miei amici che giocavano per conto loro non hanno avuto probemi","replies":[]},{"poster":"TheNamelessOne89","date":"2015-04-21T19:07:12.998+0000","up_votes":1,"down_votes":0,"body":"Il drop back ve lo fa il server riot crashando... Ma che pensate che arrivi un tizio qualunque prema 2 tasti a casaccio, e automaticamente vi disconnetta dalla partita -.-","replies":[]},{"poster":"ThePwner33","date":"2015-04-21T18:43:30.476+0000","up_votes":1,"down_votes":0,"body":"Scusate l'ignoranza ma cos'è il drop hack?","replies":[{"poster":"Nutria di Droga","date":"2015-04-21T18:46:24.541+0000","up_votes":1,"down_votes":0,"body":"a quanto ho capito sti qui che stanno a perde ti bloccano nella schermata in cui appare la scritta riconnettiti alla partita e se tu schiacci il pulsante non ti riconnette a nulla io è da 2 ore e mezza ormai che sto ad aspettare xD","replies":[]}]},{"poster":"Nutria di Droga","date":"2015-04-21T18:34:46.862+0000","up_votes":1,"down_votes":0,"body":"Idem a me in aram ho contattato il support che in sto periodo mi sta aiutando parecchio stavo vincendo malamente con xerath e si blocca ero in premade quindi anche il mio amico era bloccato aspetto che dyoh mi dia un risposta e magari riferisco a voi","replies":[]},{"poster":"Pasticcionex","date":"2015-04-21T18:09:59.442+0000","up_votes":1,"down_votes":0,"body":"devi aspettare! e anche parecchi alcuno volte quindi rassegnati non si può fare niente solo aspettare e aspettare e aspettare ;P","replies":[]},{"poster":"whatwhywho","date":"2015-04-21T17:53:02.134+0000","up_votes":1,"down_votes":0,"body":"Successa la stessa identica cosa in ranked, la stavamo vincendo MALAMENTE poi si blocca tutto. Pensavo fossero i server.","replies":[]}]}