{"poster":"Linkimaru 2099","date":"2019-06-23T07:29:56.057+0000","title":"Il mio più grande errore","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"E' stato quello di chiudere il pbe l'altra sera dopo aver giocato 4/5 partite al TFT, ho pensato: \"massì faccio spazio ad altri tanto domani mattina mi rimetto in coda così la sera ci gioco di nuovo\" cit. \r\n\r\nAdesso la situazione è peggiorata ci vogliono 30 ore per entrare e non più le canoniche 10/11 ore che ti permettevano di metterti in coda la mattina per giocare la sera.\r\nMorale: bisogna sempre essere egoisti in questo mondo altrimenti ve la mettono nel deretano.","replies":[{"poster":"Erax157","date":"2019-06-23T16:49:57.477+0000","up_votes":1,"down_votes":0,"body":"La riot avrebbe dovuto fare tipo, dopo un'ora di inattività il client si chiude automaticamente, almeno le persone avrebbero evitato di lasciare il client aperto egoisticamente.\n\nPs. Non ho mai fatto una partita a tft, ma tanto esce questo martedi-mercoledì, non vale neanche la pena di mettersi in coda","replies":[]},{"poster":"Linkimaru 2099","date":"2019-06-23T10:29:48.132+0000","up_votes":1,"down_votes":0,"body":"inspiegabilmente adesso dice che manca solo 1 ora!!! dai","replies":[]},{"poster":"IceEragon","date":"2019-06-23T09:01:05.524+0000","up_votes":1,"down_votes":0,"body":"Io solo una volta sono riuscito ad accedere alla PBE il giorno dell'uscita della mode TFT.. Stranamente quella modalità non funziona se hai le impostazioni settate su LOW, ora non so se hanno sistemato perché mandai feedback, ma da quel giorno è impossibile entrare, devi tenere minimo il pc in coda per mezza giornata se non di più.\n\nMi sembra anche che ci sia la coda per i match del TFT di circa 10 minuti quindi secondo me non conviene stare lì a cercare di entrare","replies":[{"poster":"Lo Scoiattolo","date":"2019-06-23T09:15:30.313+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IceEragon,realm=EUW,application-id=MJVj50Jw,discussion-id=1hgTuiQb,comment-id=0001,timestamp=2019-06-23T09:01:05.524+0000)\n>\n> Io solo una volta sono riuscito ad accedere alla PBE il giorno dell'uscita della mode TFT.. Stranamente quella modalità non funziona se hai le impostazioni settate su LOW, ora non so se hanno sistemato perché mandai feedback, ma da quel giorno è impossibile entrare, devi tenere minimo il pc in coda per mezza giornata se non di più.\n> \n> Mi sembra anche che ci sia la coda per i match del TFT di circa 10 minuti quindi secondo me non conviene stare lì a cercare di entrare\n\nieri sera la coda era di 10 secondi quando ho giocato io per quelle 2-3 partite alle 2 di notte... il problema rimane il fatto dell'entrare dentro il client{{sticker:sg-shisa}}","replies":[]}]},{"poster":"Power Mac","date":"2019-06-23T07:46:20.754+0000","up_votes":1,"down_votes":0,"body":"Eh, non è abbastanza Linkimaru: io ti avevo già battuto ieri pomeriggio, quando il client minacciava quasi 37 ore di coda. Adesso sono sceso a 10:30, è possibile che il client tenda a privilegiare chi non ha mai eseguito l'accesso negli ultimi giorni?","replies":[{"poster":"IceEragon","date":"2019-06-23T09:02:24.209+0000","up_votes":1,"down_votes":0,"body":"Ho letto che chi ha creato un account PBE stesso quel giorno è riuscito a loggarsi senza problemi...\nma queste sono solo voci di \"quartiere\" poi bho...","replies":[]},{"poster":"Linkimaru 2099","date":"2019-06-23T08:00:39.942+0000","up_votes":1,"down_votes":0,"body":"a me adesso ne segna 18 penso vada a caso","replies":[]}]}]}