{"poster":"Linkimaru 2099","date":"2019-11-25T17:18:03.246+0000","title":"Il dilemma dei Top Laner","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Volevo fare un piccola riflessione sul ruolo del top, \"teoricamente\" è stato detto dalla riot che questa season grazie al doppio heral ed alla maggiore exp per i solo laner la top lane avrebbe acquisito maggior importanza rispetto al passato e di conseguenza  (si suppone) un maggior impatto sul gioco in soloQ.\r\n\r\nBe ad oggi mi sembra che la situazione sia in realtà peggiorata anzichè migliorata, con i nuovi draghi (ed il bonus quando ne hai 3) il 90% delle partite l'attenzione dei jungler è ovviamente orientata verso la mid e la bot in modo da accaparrarsi più draghi possibili. Del doppio herald sinceramente non frega quasi niente a nessuno (soprattutto ad elo non molto alto) e della maggiore exp non ho sentito una grossa differenza rispetto a prima.\r\n\r\nPurtroppo in top esistono fondamentalmente 2 tipologie di campioni: gli splitpusher e quelli da teamfight (tipicamente i tankoni). \r\nSe giochi Splitpusher hai si buone probabilità di vincere la lane, peccato che superata la laning phase quasi sempre il tuo team non saprà come gestire un compagno che splitta e si lamenterà per l'intero game dicendo che non gruppi e che non li aiuti nei fight morendo a destra e a sinistra catturati dai nemici. Se giochi un tank da teamfight la lane non la vinci (a meno che non vieni camperato dal tuo jungler, cosa più unica che rara) e puoi solo farmare buono buono in attesa del late game, peccato che comunque arrivato in late se le altre due lane ed il jungler stanno perdendo malamente per quanto tu possa portare utilità nei fight non avrete mai i danni per vincere.\r\n\r\nIl morale della favola è che sia che giochi \"egoista\" ovvero splitpusher sia che giochi \"per il team\" ovvero il classico tankone rimarrai comunque isolato per almeno 10/15 minuti di game se non anche di più, e non hai nessun modo di impattare nel game se non stompando la lane 1vs1, cosa che comunque conta relativamente poco quando poi arrivi in mid game e gli avversari hanno bot e mid uberfeeddati e 3 draghi dalla loro con tanto di bonus perenne che danno adesso. Il fatto di avere due herald dalla tua non serve quasi a nulla, primo perchè per prendere l'herald in modo sicuro ti serve l'aiuto del jungler ma come detto inizialmente se già prima i jungler solitamente ignoravano la top lane adesso con i nuovi draghi proprio hanno metà mappa cancellata nel loro schermo, secondo perchè anche con l'herald al più riesci a prendere un paio di torri cosa che conta comunque molto meno rispetto ad avere diversi draghi  più bonus perenne che ti danno quando ne hai 3. \r\nIn particolare in soloQ dove la strategia di squadra è ridotta del 70% rispetto al gioco da team competitivo il fatto di avere un herald e di mettere pressione sulla top lane è quasi ininfluente visto che il game si concluderà quasi certamente con la classica \"clawnfiesta\" o aram mid dove chi è più fiddato ed ha più bonus vince il fight decisivo e tira dritto in base.\r\n\r\nTLDR. tutti i cambiamenti introdotti nella pre season non fanno che affossare ancora di più il ruolo del top laner rispetto la season scorsa, rendendolo forse il peggior ruolo in assoluto in soloQ per carriare di sempre, ditemi che ne pensate.","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-11-25T18:21:23.594+0000","up_votes":1,"down_votes":0,"body":"A mio parere la situazione in top é migliorata in maniera abissale rispetto alle 2 scorse.\nIl doppio Herald fa abbastanza schifo sia chiaro, ma:\n- i primi due draghi non potendo stackare sono relativamente inutili, dando quindi possibilità al top laner di essere presente alla contesa del 3+ drago,quelli che contano realmente.\n- l'enorme divario di livelli conferisce in caso di stomp, un vantaggio così grande da gestire anche le bot lane feedate, che da canto loro risultano pure più deboli visto la riduzione di exp facendo molta più fatica anche a sfruttare un eventuale snowball.\n- un top che riesce a gestire i gank del jng avversario, lo manda così indietro  da punirlo alla grande.\n- il nuovo conquistatore é più forte verso i carry o tf in generale\n- gli infernal hanno perso danni e i Mountain aumentano le resistenze, entrambe condizioni ottimali per i top laner.\n- la rimozione della clepto ha cancellato dalla top lane i vari ranged \n- l'herald per quanto sia peggiorato, con il doppio apre la possibilità di creare 2 situazioni e 2 lane dove gli avversari DEVONO gruppare per fermarti.\nPer quanto mi riguarda in top ho carriato la quasi totalità dei game dalla preseason in poi (nonostante abbia pure un sacco di problemi con i drop di fps o delay sulle skill),a prescindere da quanto la mia bot feedasse, cosa che negli ultimi 2 anni mi capitava 1 game su 50 se andava bene. Questi cambiamenti in gran parte semplicemente creano un lasso di tempo abbastanza ampio per la top di avere un grosso impatto sottoforma di \"raid boss\", quindi ovvio,se il game va per le lunghe il problema si ripresenta nel caso si siano persi troppi obbiettivi, ma come é giusto che sia \n\nTLDR: season scorsa ( a parte qualche sporadica eccezione) le wr dei top laner erano sempre per tutti intorno al 50%,proprio perché quasi  ininfluenti. Da questa patch invece svariati top hanno guadagnato dall'1 al 3% di wr rispetto a prima, con bruiser rimasti costanti nonostante la rimozione dei danni puri e della Shojin. Sono probabilmente pure dati destinati a migliorare considerando che i main top erano ormai spariti. Segni inequivocabili che la top abbia un impatto decisamente maggiore","replies":[]}]}