{"poster":"krasusXD","date":"2015-02-21T21:35:14.078+0000","title":"CUANDO VAN A BAJAR EL COSTO DE MANA DE LAS HABILIDADES DE YORICK","subforum":"Charlas Generales","up_votes":2,"down_votes":5,"body":"Hola esto lo hago porque lo uso últimamente y se me termina el mana rapidísimo por eso el campeon ya no se usa,yo lo uso porque como no lo usa nadie por ahi te encontras gente que no save ir contra el.Bueno espero le bajen el costo de mana porque asi ciomo esta ahora no lo va a usar nadie si quieren q yorick renasca tienen que cambiar esto","replies":[{"poster":"El Impostor","date":"2015-02-21T22:25:06.459+0000","up_votes":4,"down_votes":0,"body":"Por eso mismo se le arma la lágrima.","replies":[]},{"poster":"Mr Bard Times","date":"2015-02-21T22:20:37.456+0000","up_votes":4,"down_votes":0,"body":"Hay un item muy bueno con yorick {{item:3004}} que soluciona tus problemas de mana.","replies":[]},{"poster":"zKevin","date":"2015-02-22T08:32:19.110+0000","up_votes":1,"down_votes":0,"body":"MANAMUNE","replies":[]},{"poster":"Manaos de Sandía","date":"2015-02-21T21:52:50.934+0000","up_votes":1,"down_votes":0,"body":"Yorick está bien ahora, no vengan a hacer posts QQ sobre yorick habiendo casi 20 campeones que necesitan nerfs urgentemente","replies":[]},{"poster":"Pascut","date":"2015-02-21T21:46:23.720+0000","up_votes":1,"down_votes":0,"body":"Si costara menos mana ahí si que sería aun más molesto que ahora, y eso que ya es muy molesto .-.","replies":[]},{"poster":"redeven","date":"2015-02-21T21:52:07.585+0000","up_votes":1,"down_votes":1,"body":"Yorick no se usa porque es como Urgot. Es bueno, pero su techo de habilidad es bastante más bajo que el de otros campeones del meta, y muy poca gente logra usarlo \"al máximo\". \n\nSin embargo, tiene una fase de líneas tan segura, que bajarle los costos de maná sería estúpido. Como ya mencionaron, en todo caso habría que subirle el enfriamiento de todas sus habilidades para que las usen menos. \nIgualmente, ya está en cola de rework así que no lo buffearán.","replies":[]},{"poster":"iMonsterQ8","date":"2015-02-21T21:42:07.166+0000","up_votes":1,"down_votes":1,"body":"No, Le haran rework, Y la verdadera solucion sera subirle el enfriamiento a las habilidades y ahi no va a gastar tanto mana, Ademas si lo sabes ocupar deberias Controlar el Mana que gastas","replies":[]}]}