{"poster":"CallMeSamurai","date":"2015-05-08T07:36:13.486+0000","title":"fnatic vs tsm","subforum":"Discussioni generali","embed":{"description":"Uploaded by EpicSkillshot on 2015-05-07.","url":"https://www.youtube.com/watch?v=A58evYmeRzI","image":"https://i.ytimg.com/vi/A58evYmeRzI/hqdefault.jpg"},"up_votes":1,"down_votes":0,"body":"provateli a fermare!!","replies":[{"poster":"Darki200","date":"2015-05-08T08:20:37.440+0000","up_votes":4,"down_votes":0,"body":"Il first blood di dyrus è una tradizione lol","replies":[]},{"poster":"Vodka xPro","date":"2015-05-08T10:08:06.459+0000","up_votes":1,"down_votes":2,"body":"TSM non ha giocato per vincere ma for fun lo ha detto Bjerg che nei pick hanno trollato","replies":[{"poster":"Polarize","date":"2015-05-08T10:21:10.528+0000","up_votes":2,"down_votes":0,"body":"Mah, mi sembra una scusa a cazzo.\nSono notevolmente in tilt e stanno giocando in maniera totalmente diversa dal solito, okay che sono meglio nei bo3/5 che bo1 ma non da giocare così male lol","replies":[]},{"poster":"CallMeSamurai","date":"2015-05-08T10:10:10.891+0000","up_votes":1,"down_votes":0,"body":"qnd un evento abbastanza importante hanno trollato...e se vincevano magari \"abbiamo fatto tutto per vincere, per noi questo evento è importantissimo\"...dove  hai sentito questa cosa che ha detto bj?","replies":[{"poster":"Vodka xPro","date":"2015-05-08T11:07:02.249+0000","up_votes":1,"down_votes":0,"body":"Bjerg 5 giorni prima dei MSI ha fatto una livestream dove ha detto sono pronto per i MSI non ci dobbiamo allenare tanto, TSM punta a cose piu in alto come i Worlds :)","replies":[{"poster":"Tensar","date":"2015-05-08T12:17:00.337+0000","up_votes":1,"down_votes":0,"body":"Aaaaaaaaaaahhhhhhhhhhhhh, Quanto mi piace il suono dei pianti dei BimbiMinkia Fanboy NA e TSM che trovano scuse singhiozzando!\n\nInfatti i TSM sono tanto sopra a tutti che ad un'evento come l'MSI, secondo solo al Worlds trollano! Ragazzi cercate di far ragionare la testolina e cercate scuse migliori.","replies":[]}]}]}]},{"poster":"Tensar","date":"2015-05-08T12:24:00.231+0000","up_votes":1,"down_votes":0,"body":"Basta parlare di Dyrus e basta! Purtroppo ogni player passa dei momenti critici, e di solito si prende una pausa di un'annetto per ricaricarsi, poi tornano tutti! Dyrus a causa di fama ed altro ha tirato troppo la corda ed anche se e cmq un campione nn gioca piu cm prima forse............ DAI! Non ho mai trovato ness'un altro top-laner a que livelli che feddasse cosi tanto uno Gnar anche se degli SKT.\n\nCmq detto e confermando che EU > NA Confirmed, ce da dire che la corea e la cina sono superiori agli altri ancora. A qnt sembra.","replies":[]},{"poster":"Dr LouD","date":"2015-05-08T07:46:05.384+0000","up_votes":1,"down_votes":0,"body":"Dat Stomp.\n\nBan 6 Top Laner, lol\n\nBjerg che picka Chogat contro LeBlanc, come autocounterarsi.\n\nHuni e Reign devastanti, hanno praticamente carriato loro la partita\n\nSi vede che Dyrus ormai gioca senza voglia, mi dispiace ci sono molto affezionato ma a vederlo giocare così mi si spezza il cuore :'c","replies":[{"poster":"Heavenly Yasha","date":"2015-05-08T09:59:12.913+0000","up_votes":1,"down_votes":0,"body":"Sinceramente non darei la colpa a Dyrus per questo game. Sicuramente se avesse messo il trinket nel tribush si sarebbe accorto prima di Reignover e sarebbe potuto fuggire entrambe le volte. Inoltre Cassiopeia è un matchup davvero difficile per Gnar e allo stesso tempo è facilissima da gankare.\n\nC'è anche da dire che Santorin ha avuto 0 presenza sulla mappa. Reignover ha gankato tutte le lane, 2 volte la mid con successo, 2 volte la top con successo e ha tentato una volta in botlane mentre Santorin ha esclusivamente farmato fino al minuto 8, tranne che per un tentativo fallito di gank in midlane (che era la più difficile da gankare e che stava comunque vincendo a livello di farm).\n\nAnche a livello di visione i FNC in early erano molto più coperti dei TSM, e anche questo ha impedito ai TSM di conoscere i movimenti di Gragas anche solo per un eventuale countergank. Quindi prendersela con Dyrus mi sembra eccessivo, anche perchè nei fight si è comportato davvero bene, o comunque come meglio ha potuto.\n\nAnche il pick di Bjergsen secondo me non era così male. Alla fine è un campione che sta giocando davvero molto ultimamente e stava comunque outfarmando Febiven. Magari gli sarebbe stata difficile la kill in 1v1 ma alla fine se l'ha pickato era perchè sapeva come comportarsi. \n\nP.S. Dyrus is love <3","replies":[{"poster":"Dr LouD","date":"2015-05-08T10:06:27.951+0000","up_votes":1,"down_votes":0,"body":"Il commento a Dyrus è riferito agli ultimi tempi, non a questo game specifico\nDyrus si è chiaramente stancato, è nella scena da troppo tempo e si vede che non ce la fa più.\n\nLo disse anche qualche mese fa con un tweet che finita questa season al 99% si ritirerà.\n\nE' un peccato, lo stimo tantissimo :(","replies":[{"poster":"CallMeSamurai","date":"2015-05-08T10:20:46.874+0000","up_votes":1,"down_votes":0,"body":"non la sapevo questo cosa...che peccato mi è presa a male...anche perchè dyrus è il primo streamer che ho conosciuto qnd ho iniziato a giocare a lol e grazie a lui ho capito tantissime meccaniche per la top (la mia lane). che pezza....non ci credo....","replies":[{"poster":"Heavenly Yasha","date":"2015-05-08T10:32:10.938+0000","up_votes":1,"down_votes":0,"body":"Ogni toplaner, nel bene o nel male vuole bene a Dyrone. \nggwp Dyrus </3","replies":[{"poster":"CallMeSamurai","date":"2015-05-08T10:36:45.752+0000","up_votes":1,"down_votes":0,"body":"e come fai a non volerne! grazie a lui ho imparato ad usare molti campioni per la top ...diciamo che è il mio maestro...anche se lui non sa che sono un suo allievo","replies":[{"poster":"Dr LouD","date":"2015-05-08T10:47:58.085+0000","up_votes":1,"down_votes":0,"body":"Dyrone è il maestro di ogni top laner </3","replies":[]}]}]},{"poster":"Dr LouD","date":"2015-05-08T10:29:52.019+0000","up_votes":1,"down_votes":0,"body":"Si ritirerà dalla scena competitiva, penso che comunque rimarrà a streammare come ha fatto e fa anche Imaqtpie :)","replies":[{"poster":"CallMeSamurai","date":"2015-05-08T10:31:30.076+0000","up_votes":1,"down_votes":0,"body":"questo mi fa stare tranquillo.","replies":[]}]}]}]}]},{"poster":"CallMeSamurai","date":"2015-05-08T07:56:55.817+0000","up_votes":1,"down_votes":0,"body":"è vero anche a me sembra che non abbia voglia di giocare...è strano. più che huni e reign  penso che yellow abbia carriato il game ha creato cosi tanti engage che solo chi ha visto la partita lo sa. grandissimi fnatic.","replies":[{"poster":"Dr LouD","date":"2015-05-08T08:08:07.403+0000","up_votes":1,"down_votes":0,"body":"Concordo su Yellow, ha fatto engage pazzeschi, però Huni e Reign hanno completamente stravolto il mid game con la loro pressione, i gank sono stati perfetti e ha fatto snowballare tutte le lanes, hanno macinato torri su torri con il loro push, per non parlare del Baron a 20 minuti tirato giù in nemmeno 15 secondi grazie a Cassio, robe impressionanti. GG ai Fnatic!","replies":[]}]}]},{"poster":"Nibbio Bianco","date":"2015-05-08T10:32:58.548+0000","up_votes":1,"down_votes":0,"body":"Né i TSM né i fnatic sono team che meritano di vincere. Hanno parecchie lacune, i primi non hanno un toplaner capace di utilizzare toplaner che carryano, in un meta dove in top si giocano hecarim, rumble, cassiopeia, gnar, preferisce fare da supporto al team pickando Sion, Lulu, Morgana, Maokai. Preferivo il Dyrus testardo da Singed e Vladimir, attualmente Dyrus è un grave punto debole per i tsm, è come giocare ogni partita 5vs4+1.\n\nI fnatic, invece, sanno giocare molto bene in team, ma non hanno grandissime capacità individuali. Riescono ad attuare bene le stesse strategie che hanno portato alla vittoria i samsung white, ma rispetto a loro c'è un divario a livello di abilità individuale. O riescono a prendere un grande vantaggio in early game, oppure non riescono a fare molto. Huni è l'unico giocatore di valore nel loro team. \n\nAttualmente tutte le squadre, comunque, sono deludenti, i samsung white e blue dell'anno scorso rasentavano la perfezione, attualmente però non vi sono squadre in grado in raggiungere il livello delle squadre dell'anno scorso, ecco perché in molti sperano che questo sia l'anno dei tsm agli lcs, con tutte le squadre imperfette vincerà la squadra \"meno peggio\".","replies":[]},{"poster":"Giovarco","date":"2015-05-08T09:43:44.101+0000","up_votes":1,"down_votes":0,"body":"Ma dove si vedono la lista dei match già svolti?","replies":[{"poster":"Heavenly Yasha","date":"2015-05-08T10:02:46.294+0000","up_votes":1,"down_votes":0,"body":"http://euw.lolesports.com/","replies":[]}]}]}