{"poster":"dunder kill","date":"2018-02-17T16:51:04.825+0000","title":"Brand support does way too much damage","subforum":"Gameplay","up_votes":189,"down_votes":55,"body":"http://champion.gg/statistics/#?sortBy=general.totalDamageDealtToChampions&amp;order=descend\r\n\r\nLiterally averages more damage than 95% of mids, tops, jungles ***and even ADCs***. There is absolutely zero justification you can give for intentionally depriving an APC of gold and still having him pump out insane levels of damage. Undo his passive buffs. Nerf his base damage and give him higher AP ratios to compensate. AP Carry supports should never EVER be a thing. Carries should have to have gold to be effective.","replies":[{"poster":"Totally Not Jinx","date":"2018-02-22T17:58:52.023+0000","up_votes":3,"down_votes":7,"body":"I understand that this conversation is hot right now (pun possibly intended), but please keep conversations and disagreements respectful to one another and follow the [Universal Rules](https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/4LgZ2EwM-universal-rules). I'm going through and editing comments that I see which do not follow the rules, and tagging them appropriately.\n\nIf you have questions, feel free to talk to us in the The [Boards Moderation Discord](https://boards.na.leagueoflegends.com/en/c/community-moderation/qVlculPP-boards-moderation-discord) or the [Discuss the Boards](https://boards.na.leagueoflegends.com/en/c/community-moderation) sub-board.","replies":[]},{"poster":"Death by Glamour","date":"2018-02-17T16:58:16.193+0000","up_votes":78,"down_votes":7,"body":"You will liekly get alot of hate for this but i for one are in agreement with you.\n\nIt always bothers me when supports do well in a solo lane they get nerfed but a mage with one stun is allowed to pester the botlane","replies":[{"poster":"2Charmnot2Charm","date":"2018-02-17T20:01:36.666+0000","up_votes":5,"down_votes":0,"body":"I'm ready to permaban him when the ap item changes come out next week. Till then i'm staying Karma free.","replies":[{"poster":"The Stabby Tabby","date":"2018-02-17T21:05:32.471+0000","up_votes":8,"down_votes":0,"body":"I'm already at the point where I permaban Brand.","replies":[]},{"poster":"Thefrostyviking","date":"2018-02-17T21:36:23.657+0000","up_votes":5,"down_votes":0,"body":"If that liandry thing with max health really goes through then any AP with a dot becomes worthy of a perma ban.\n\nJust imagine Teemo for one, you´d lose like 20%+ max health per shroom between the base damage and liandry ticks even with magic resistance.","replies":[{"poster":"What Is Smite","date":"2018-02-18T00:35:43.440+0000","up_votes":5,"down_votes":0,"body":"{{champion:82}} ? Rank 3 ult does base 35% max hp with + 4% for every 100AP\n\nEDIT: Also to note Rank 1 is base 25% max hp, Rank 2 is base 30% max hp","replies":[{"poster":"leakinb","date":"2018-02-18T04:11:31.668+0000","up_votes":5,"down_votes":0,"body":"{{champion:63}} 4% per hit, 12% for 3 stacks + passive AOE explosion (12~16%+1.5% per 100AP) for ONE full combo\nAlmost (12+[12-16]+3) 30% per combo\n{{champion:82}} 25-35% over 10 sec for 120-90sec ULT","replies":[{"poster":"What Is Smite","date":"2018-02-18T06:41:07.167+0000","up_votes":4,"down_votes":0,"body":"A general morde build right now is: {{item:3151}} {{item:3116}} {{item:3020}} {{item:3285}} {{item:3146}} {{item:3135}} \n\n{{item:3151}} : 80AP\n{{item:3116}} : 75AP\n{{item:3285}} : 100AP\n{{item:3146}} : 80 AP\n{{item:3135}} : 80 AP\nRunes: 24 AP (Aery w/o gathering storm)\n\n439 AP build adding on 17% max hp damage, however when you look at the ult number in-game for the extra %hp added on it factors in the Mpen so the number usually get around to 70% max HP as magic damage.\n\nAnyways putting aside arguements, DoT mages are going to be pretty damn strong come next patch. I can already hear the baby rage. {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Thefrostyviking","date":"2018-02-18T10:34:36.182+0000","up_votes":1,"down_votes":0,"body":"The cooldown is a bit long, and while you can heal or stack barriers against that in a fight you´d can't really have everyone protected against shrooms whenever they try to move around.\n\nJust imagine, you try to leave base into the jungle from a wall exit as a tanky diver, and you step on a shroom, when it finally stops ticking and the slow is gone you´d lost like 20-30% health.\n\nThen you walk forward a few steps after and bam....another shroom, which forces you to recall and sit in base waiting for some health to come back.\n\n\nMeanwhile Teemo under that entire duration was just splitpushing some lane and didn't even pay any attention to the damage he did, and no one on your team even got close to the little bugger before he got to a tower x)\n\n\nThat or you try to push against Teemo and he drops some shrooms around his tower, it´d be a miracle if you got away with more than 50% health just because of minions stepping on things x)\n\n-------\n\nI have a minor trauma from playing against fed Teemo´s and just Teemo in general when he was strong x)","replies":[{"poster":"What Is Smite","date":"2018-02-18T10:51:56.982+0000","up_votes":2,"down_votes":0,"body":"you're not the only one with that Trauma my friend, tbh from what I can see he is long overdue for a rework along with some other champions (Nasus, Tryndamere, and Trundle for example)","replies":[]}]}]}]}]}]},{"poster":"1wolfpack","date":"2018-02-17T17:43:15.560+0000","up_votes":45,"down_votes":20,"body":"I agree that brand is a little too strong as a support, however I like that AP supports is a thing, it diversifies the support role, a role mind you that few people actually want to play, it makes the role more fun, otherwise ur stuck being a tank support or a utility support. Riot needs to make the support role more appealing for people to play and diversifying that role is a good place to start.","replies":[{"poster":"dunder kill","date":"2018-02-17T18:07:41.230+0000","up_votes":67,"down_votes":18,"body":"Lmao no. There is absolutely zero reason why a carry that is intentionally gold deprived should be outputting more damage than 95% of champs that have an entire lane of farm and xp to themselves. None. Zero. Xip. Nada. That's not \"diversity\". That's \"base damage are WAAAAAAYYYY too fucking high\". How about we make support Twitch viable for the sake of \"diversity\"? How is that any different whatsoever? We should make it so Twitch does more damage with 10 farm than 95% of every other champ in the game in any role. See how shitty that sounds? How is it in any way different than Brand? Please explain how Carry Brand support is different than Carry Twitch support.\n\nA carry should have to have gold to function ***PERIOD***. AP Carry supports should be absolutely gutted and not be allowed to exist at all ever","replies":[{"poster":"Madsin25","date":"2018-02-17T18:16:12.243+0000","up_votes":33,"down_votes":0,"body":"% max hp damage on every single ability is pretty cancerous.\n\nEspecially when the explosion is also %max hp like wtf.\n\nDreading the new lyandries not gonna lie.","replies":[]},{"poster":"Quort","date":"2018-02-17T19:02:24.389+0000","up_votes":9,"down_votes":9,"body":"Supports generally aren't as gold deprived as they were in the past and Brand actually makes great use of Spellthief's Edge's passive gold generation ability. Brand also tends to build exclusively damage items, has excellent area of effect presence and damage over time effects, and spends the majority of the game focused on harassing enemies in the Support role; it's completely understandable that he deals so much damage. You also have to consider that the majority of his damage can be avoided by playing intelligently (dodging his Pillar of Flame and Sear, moving away from your allies when he casts Pyroclasm, and being aware of Conflagration's short range and ability to spread Blaze).\n\nYou might be able to argue that Brand's currently too strong; that's acceptable. Your statements about AP Supports, however, are misguided because, while they do bring significant damage, they have their own weaknesses that can be exploited.","replies":[{"poster":"Eedat","date":"2018-02-17T19:11:34.249+0000","up_votes":20,"down_votes":3,"body":"\"Just dodge the skillshot\" is such an awful and tired counterargument. If this was true then 90% of the champion roster would be instantly gutted. There's so much more that goes into it than \"well it ***can*** be dodge\"","replies":[{"poster":"Neptunia xoxo","date":"2018-02-17T21:14:59.366+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Eedat,realm=NA,application-id=3ErqAdtq,discussion-id=3ZE9R8kx,comment-id=0004000000020000,timestamp=2018-02-17T19:11:34.249+0000)\n>\n> &quot;Just dodge the skillshot&quot; is such an awful and tired counterargument. If this was true than 90% of the champion roster would be instantly gutted. There&#x27;s so much more that goes into it than &quot;well it ***can*** be dodge&quot;\n\nWell in alot of cases it is true with Brand, If you dodge his stun then it becomes alot easier to dodge his W and to try and avoid stacking for his ulti OR you can simply just 100-0 him before he can do anything.\nI mean it's not like Brand is some sort of unkillable tank that can 1 shot you in a milisecond.","replies":[{"poster":"Eedat","date":"2018-02-17T22:28:15.796+0000","up_votes":5,"down_votes":0,"body":"> Well in alot of cases it is true with Brand, If you dodge his stun then it becomes alot easier to dodge his W and to try and avoid stacking for his ulti OR you can simply just 100-0 him before he can do anything.\n\nCome on man you can say this about any champ with skillshots. The reality is he builds Rylais then presses E in you which makes the rest of his combo easy to hit. Even without the Rylais it's not like his Q is hard to hit. He also builds Rylais and Liandry which gives him an extra 600 HP which doesn't make him the easiest to 100-0 before he can react at all","replies":[]}]}]},{"poster":"douglah","date":"2018-02-17T20:49:02.412+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Quort,realm=NA,application-id=3ErqAdtq,discussion-id=3ZE9R8kx,comment-id=000400000002,timestamp=2018-02-17T19:02:24.389+0000)\nBrand also tends to build exclusively damage items, has \n> \n> You might be able to argue that Brand&#x27;s currently too strong; that&#x27;s acceptable. Your statements about AP Supports, however, are misguided because, while they do bring significant damage, they have their own weaknesses that can be exploited.\n\nExcept that the  \"exclusive damage items\" that he builds are ALSO tanky-defense-mage items.  Liandry and Rylai's are his core,  sometimes getting an ROA in between them.\n\nAnd with this he ends up doing more late-game damage than a pure-caster AP mage who had solo xp and gold farm the entire laning phase....","replies":[]}]},{"poster":"1wolfpack","date":"2018-02-17T18:29:25.544+0000","up_votes":5,"down_votes":3,"body":"If it works then why not, I would be fine with any champion in any lane if the player can make it work.","replies":[]}]},{"poster":"It Hertz When IP","date":"2018-02-17T18:17:47.488+0000","up_votes":15,"down_votes":1,"body":"No. No it's not. Because then you don't have a support anymore, you just have another APC that you parked in botlane and made able to BE an APC without an actual gold income. Meanwhile, the real supports are tired of facing an enemy \"support\" whose ENTIRE attention is solely devoted to chunking you for stupid amounts of damage from alarming range.","replies":[{"poster":"1wolfpack","date":"2018-02-17T18:27:14.280+0000","up_votes":6,"down_votes":2,"body":"I thought the point of the game was the win the match, so if APC supports are so strong then people she be advocating for there team-mates to play AP supports more often.","replies":[{"poster":"flibitydoo","date":"2018-02-17T19:56:18.298+0000","up_votes":2,"down_votes":0,"body":"it's also shitty because it means you can literally pick brand mid, int, go 0/10 by 10 mins.\n\nand guess what? come a teamfight because you have those base dmgs you still deal more dmg than the guy who's been consistently outplaying you both in CS, trading and skirmishing, just because you brainlessly picked a champ. What is the point of even playing the game when that's a reality? Carry type champions should never be given base dmg, they should have to work otherwise the games just get decided in champ select with zero gameplay involved.","replies":[]}]}]},{"poster":"Pot3ncy","date":"2018-11-11T02:57:41.384+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=1wolfpack,realm=NA,application-id=3ErqAdtq,discussion-id=3ZE9R8kx,comment-id=0004,timestamp=2018-02-17T17:43:15.560+0000)\n>\n> I agree that brand is a little too strong as a support, however I like that AP supports is a thing, it diversifies the support role, a role mind you that few people actually want to play, it makes the role more fun, otherwise ur stuck being a tank support or a utility support. Riot needs to make the support role more appealing for people to play and diversifying that role is a good place to start.\n\nI agree tbh, but Brand just does a stupid amount of it. The dude literally hits people up with a 12% max hp passive burn, excluding the 4% or so he already does baseline. Bard, for instance, is a good ap support. Does respectable burst early game with electrocute, but not oppressively so that he insta-wins every fight because you're getting 1 shot by a support.","replies":[]}]},{"poster":"IvernBramblefoot","date":"2018-02-17T17:06:06.838+0000","up_votes":42,"down_votes":9,"body":"Brand is total fucking bullshit botlane and he ruins the entire game for both adc and support.","replies":[]},{"poster":"SlampieceHawke","date":"2018-02-17T17:41:16.272+0000","up_votes":17,"down_votes":28,"body":"It's not even a problem if you've played Brand support yourself a few times.  Being on the receiving end as an adc we can easily avoid his cheese during lane phase, knowing what he's all about.  Seriously, a had a brand against me, played smart, and when my {{champion:12}}  support engaged and locked down his squishy self, I murdered him.  Wasn't even playing a kill lane adc, was playing {{champion:15}} .  Easiest game of my life.  During the late game just don't all clump together.","replies":[{"poster":"dunder kill","date":"2018-02-17T19:00:24.561+0000","up_votes":26,"down_votes":2,"body":"You seem to not understand what averages mean. ***On average*** Brand deals more damage as support than 95% of every champ in the game regardless of role or position. That means if you take a look at*** all his good games AND bad games COMBINED***, he deals more damage than actual carries with 20 times as much farm and more XP. Completely unexcusable and unacceptable. \"Well this one time he had a bad game\" is ***completely irrelevant*** because the average encompasses all the data.","replies":[]},{"poster":"SlampieceHawke","date":"2018-02-17T18:05:24.069+0000","up_votes":17,"down_votes":25,"body":"I'm receiving downvotes for informing how to play against him, typical.  Maybe yall should consider that a brand support does booka damage because he doesn't even build support items like a typical support?  He only needs this{{item:3092}}  and then builds as a mid brand would... or at least I do.  You have to realize that he's not building helpful items for his ADC and so it's kinda a no brainer that brand sup does damage.  It's a different playstyle from a barrier/healing/amplifying sup or tank/engage/peel sup.  All you need to do is adjust to it.  A brand support typically leaves their adc naked and vulnerable to assassins for one.","replies":[{"poster":"Madsin25","date":"2018-02-17T18:31:13.152+0000","up_votes":8,"down_votes":1,"body":"He has counters like long range engage supports and other AP supps like zyra and xerath. \n\nHe is very opressive against supports like tahm kench and enchanters. There's nothing you can really do.","replies":[]}]}]},{"poster":"KlydeFrog","date":"2018-02-17T18:23:37.430+0000","up_votes":4,"down_votes":11,"body":"lol dude because he dots.........also karma will actually outdamage him bot lane","replies":[{"poster":"Death by Glamour","date":"2018-02-17T18:25:31.594+0000","up_votes":17,"down_votes":0,"body":"No she wont.\n\nOver the corse of the game she will move away from mantra qs to mantra E. Only reason she uses her other abilities is to reduce the cd on mantra for more REs.","replies":[]},{"poster":"JarodDempsey","date":"2018-02-17T18:40:30.007+0000","up_votes":3,"down_votes":0,"body":"I also have to disagree. Karma's damage is primarily blocked by minions where as brands is ground targeted, this lets him connect a lot more of his damage. Also, I main kayle and by the time i get idol i can completely counter a mantra'd q from a karma who is rushing q when im rushing my heal. Brand can do almost as much burst with his gtaoe but that plus the burning as well as the frequency due to not having to mantra it leaves my adc with notably less health after heal than vs a karma.","replies":[{"poster":"JarodDempsey","date":"2018-02-17T18:41:16.122+0000","up_votes":4,"down_votes":0,"body":"also brands cc is significantly better than karmas and basically guarantees he procs his moderately damaging passive","replies":[]}]}]},{"poster":"Quinzley","date":"2018-02-17T17:23:43.973+0000","up_votes":10,"down_votes":1,"body":"True. It's even worse when you're an adc with short range...","replies":[]},{"poster":"Cosnirak","date":"2018-02-17T21:09:21.772+0000","up_votes":11,"down_votes":2,"body":"Here's the thing though, his win rate isn't out of line (at least as far as I could see, feel free to provide evidence otherwise). Why do you think his win rate is normal while his damage is so high? Is it because he makes trade offs for that damage? Is it because his damage done is a bit inflated compared to the _effectiveness_ of that damage? Both?\n\nI've noticed that any time I build liandry's on a champion that can easily apply it in an aoe my damage dealt at the end of the game is pretty damn high. But I've also noticed that my meaningful damage done in those games isn't really as high as the stats at the end make it look.\n\nImagine if every time you play an adc and get into a fight you got a free auto attack of damage on the worst target possible. Typically someone who survived and would have survived the fight even despite that extra damage. Or on someone who it would have just overkilled anyways because they were definitely not getting away or living long enough to change the outcome with or without that extra auto from you. At the end of the game your damage dealt would be higher sure, but much of the time it wouldn't actually matter. This is what being Brand is often like. It's not _actually_ that simple, but it's along those lines. Brand _does_ do high damage to his primary target as well, but not to the levels the end of game damage done stat implies, and he makes significant trade offs for that damage.\n\nThis is how Brand has always been. Reverting his passive buff wouldn't change this at all, he was already outdamaging most champions, whether as support or mid, even when he's struggling winrate wise. It's fine if you don't like the design of his kit, just don't expect major changes to it any time soon.","replies":[]},{"poster":"Troll for Trump","date":"2018-02-18T06:18:10.151+0000","up_votes":5,"down_votes":0,"body":"Because he's been shit in solo lane for so long.\n\nWhenever you nerf supp, you'll nerf his solo lane out of commission. It's happened before, and it'll happen again if you nerf him.\n\nEven if you nerf base dmg and compensate with bonus AP ratios, he still has trouble clearing waves early, which is one of the reasons that he's been kept out of mid.\n\nThe Brand support problem isn't that he's too good of a mid, it's that he's too shitty of a solo laner.\n\nKarma, Leona, Naut, Zyra, Blitz, Annie, Fidd, and a few other have/have had this problem before.\n\nThe issue is how do you buff him mid without nerfing him support.","replies":[]},{"poster":"Neptunia xoxo","date":"2018-02-17T21:12:57.663+0000","up_votes":10,"down_votes":5,"body":"Actually Brand has always done high/most damage in games because of his passive burn and liandry's rylai combo. I don't see a problem with Brand at all actually since his winrate jumps from 43% to 48% back and forth at the moment. I think he needs to be buffed atm if anything like upping the cast range of his E.\nBrand support can be annoying depending on your bot lane comp but hes not even that good right now as a support lol he gets destroyed by alistar blitz leona ect any champion that has engage and an adc that can follow up on it and hes actually weak to things like Zyra support because it has catch potential and high burst while Brand has to setup his burst and catch (his stun needing passive first.) \n\nBrand is already outclassed by alot of mid laner mages right now due to range difference and how safe a mage is compared to him since Brand is immobile and relies on his stun so much to hit that if something like a Xin / Fiora / Yi connects to him and he does not have stun or he misses or just does not have the items to burst someone down then he dies very easily or if any CC lands on him.\n\nTL;dr \nBrand is fine and if anything he needs some sort of buff so his mid lane game can actually be decent compared to other meta champions.","replies":[]},{"poster":"Failnewb","date":"2018-02-19T02:57:18.661+0000","up_votes":3,"down_votes":0,"body":"Basically just a rant. don't bother reading this. \n\n\nSupport main. Brand is my Perma-ban although for slightly different reasons then the ones outlined here. \n1) the concept of support is to funnel gold while still being useful with utility? He has utility but also does damage with low gold in-come. \n2) If you say it's dodgeable, so is every skillshot. but people aren't dodging every skillshot so it still matters. \n3) AP support mages can be a thing (Morgana) without doing top damage. \n\n4) The real reason Brand is perma-ban for me is because he is not only a lane bully but a team-fight bully the rest of the game. If your team has to worry about ever accidentally stepping within Brand ult range of each other its a huge liability. You can't fight over dragon pit, baron pit, in the jungle, you can't take champs like rakkan/taric/braum that want to be close to their adc to protect them. \n\n5) part of why brand's damage is so high is because the support items while low on AP give high CDR/mana regen and as a support its more okay for him to sit back and wait for ideal times to throw his spells. \n\n6) He additionally is somewhat safe for warding b/c of checking bushes with long range skills, can escape b/c stun, and has solid wave clear which is a major liability (intentional) for a lot of supports. \n\n7) Personally I enjoy the fun of playing against brand b/c trying to outplay him is fun but a brand can just threaten ult over any objectives you try to group on and if positioned properly essentially ruins a teams ability to group over objectives. (with good warding from the brand as well). and he can even do assassin crap in the jungle by unloading all his skills.","replies":[]},{"poster":"trashbagz","date":"2018-02-17T20:57:34.532+0000","up_votes":3,"down_votes":1,"body":"***","replies":[{"poster":"FullmuteAll play","date":"2018-02-17T21:26:59.929+0000","up_votes":4,"down_votes":1,"body":"As Brand main with 190k points with him, shut up and enjoy while you can","replies":[]},{"poster":"The Stabby Tabby","date":"2018-02-17T21:11:10.625+0000","up_votes":2,"down_votes":0,"body":"I think it's more that he didn't need to be buffed in the way he was, the passive change was too much. I'd rather see buffs to his scalings on his basic abilities.","replies":[]}]},{"poster":"RISE Shlack123","date":"2018-02-18T22:16:53.272+0000","up_votes":2,"down_votes":0,"body":"As much as I hate Brand support, I've learned how to deal with him.  I main support, and I see him pop up every now and again.  Sometimes he's good, and sometimes he's an autofill.  You can tell the difference pretty quickly.  \n\nI'm someone who plays actual supports most of the time, sprinkling in the occasional Zyra (but she's actually got supportive abilities and zoning tools, and building Locket on her doesn't punish her in the slightest).  So when facing a Brand, I tend to prioritize Locket and Redemption over all else.  He can't kill you if you can sustain it back up.  He can poke, but if you manage it, he ends up running oom and is very squishy if caught.\n\nHis kit is annoying, and I, too, scoffed at the recent buff he received, as it was not needed.  Scorch is a thing, and he didn't need his passive burn to be buffed.  But that just means playing a support that can deal with a potential Brand is important.  Taric to absorb damage and sustain.  Leona or Alistar to engage if he gets out of position.  Braum to block his ult.  Janna, Lulu, Nami, Morgana to shield, sustain, and/or mitigate his damage.  \n\nOnce you get past Brand, his ADC is usually without peel.  So you have to understand what you need to do against Brand and execute.  Rush Locket.  Rush boots to help dodge his skills (don't run Magical Footwear if you see a Brand support).  Punish his ADC for not having a peeling support.  \n\nWith all that being said, yes Brand is a little too strong.  But you have to adapt and learn to deal with him.  Even if that means ADCs speccing into Sorcery for Nullifying Orb.  Adapt your playstyle, itemization, and rune setup.  Complaining about something is one thing, but if you consistently lose to it, that means you're doing something wrong.","replies":[]},{"poster":"Blessed By RNG","date":"2018-02-18T14:31:19.298+0000","up_votes":2,"down_votes":0,"body":"Brand has a pickrate of 3 % in botlane and a winrate of 49& so i dont get why you are complaining, alistar, blitzcrank, thresh, leona, janna have all way higher pickrates and win rates so nerf them instead, ur just mad cus u lost 1 game to a brand support get over it","replies":[]},{"poster":"Old Man Thyme","date":"2018-02-18T07:05:33.736+0000","up_votes":2,"down_votes":0,"body":"So \"OP\" that's why he's trash tier lol\nAlistar support literally picked every game.","replies":[]},{"poster":"Carnicore","date":"2018-02-17T23:18:39.857+0000","up_votes":1,"down_votes":0,"body":"He had low damage on release, and he was awful. Since then they just buffed him in every way until he became a balanced champion. He does a lot of damage because his Q and passive are basically perfect for short, periodic trades and skirmishes. You could nerf his damage, but you would have to compensate him somewhere. Increase his tankiness? Maybe, but he is a mobile ranged champion and should remain squishy. Increase his healing? That makes his gameplay more boring because W is his least interactive spell. Improve his Magical Journey in some way? That won't help him much because enemy champions can also use the tunnel. Improve his ultimate? How? The only way I can think of buffing it is by lowering the cooldown, but I think that's dangerous because it's such a strong tool for making picks as it is.","replies":[{"poster":"lolibus","date":"2018-02-18T00:33:58.647+0000","up_votes":2,"down_votes":0,"body":"I always thought Brand is pretty useless in botlane since he is a sitting duck and you can easily dodge his Q and if you are lucky his W. Thats kinda the only thing these supports got going on, if you nerf their damage there is no reason to pick then anymore.\n\n> [{quoted}](name=Carnicore,realm=NA,application-id=3ErqAdtq,discussion-id=3ZE9R8kx,comment-id=0021,timestamp=2018-02-17T23:18:39.857+0000)\n>\n> He had low damage on release, and he was awful. Since then they just buffed him in every way until he became a balanced champion. He does a lot of damage because his Q and passive are basically perfect for short, periodic trades and skirmishes. You could nerf his damage, but you would have to compensate him somewhere. Increase his tankiness? Maybe, but he is a mobile ranged champion and should remain squishy. Increase his healing? That makes his gameplay more boring because W is his least interactive spell. Improve his Magical Journey in some way? That won&#x27;t help him much because enemy champions can also use the tunnel. Improve his ultimate? How? The only way I can think of buffing it is by lowering the cooldown, but I think that&#x27;s dangerous because it&#x27;s such a strong tool for making picks as it is.\n\nPeople are talking about {{champion:63}} not {{champion:432}} lol","replies":[]}]},{"poster":"Bruh im ok","date":"2018-02-17T22:51:45.944+0000","up_votes":2,"down_votes":0,"body":"just get mr and stop complaining","replies":[]},{"poster":"CoolKnightST","date":"2018-02-18T16:04:25.975+0000","up_votes":3,"down_votes":1,"body":"> http://champion.gg/statistics/#?sortBy=general.totalDamageDealtToChampions&order=descend\n\nYou need to filter out the support picks. The top 3 damage dealers in the support role are:\n\n1. {{champion:63}} 23009 damage; 51.75% winrate\n2. {{champion:161}} 22162 damage; 49.35% winrate\n3. {{champion:143}} 21186 damage; 50.38% winrate\n\nFor midlane Brand the damage is much different:\n\n2) {{champion:63}} 25640 damage; 52.59% winrate\n3) {{champion:161}} 25370 damage; 52.66% winrate\n\nWhen compairing both chart you come to the conclusion Brand in the top 7 damage dealers. However keep in mind that that both {{champion:142}} as {{champion:50}} are in the top 10. So that damage charts are really really strange and it probally will even get worse ones the new AP items are released.\n\nOveral I can agrea that Brands buffs where a little bit overkill. However I do suggest to wait to see how the new AP items work on him. Brand support will probally rush {{item:3116}} again what will reduce his damage output without actually nerfing his numbers. Overal most support have a very low winrate right now so it's fair to say to wait until the meta is stablized. Right now whe are on the tank patch. However next patch relic will be nerfed and coin buffed where catchers will probally shine again.\n\n> Nerf his base damage and give him higher AP ratios to compensate. \n\nThat would kill his rylai / liandries build. Brand suppose to work like this.\n\n>  AP Carry supports should never EVER be a thing. Carries should have to have gold to be effective.\n\nTime for a reality check. This is never going to happen. In fact the reason why it's such a problem is because riot doesn't ballance arround it. The support {{champion:143}} is litterly the only champion that riot is currently ballancing as an AP carry in the botlane. AP carries are already a thing and they are their to stay. They are crucial elements for a teamcomp that goes full AD and picking one can litterly increase the chances of winning that game. They are also great when paired with lanebullies for better snowballing.\n\n* Currently their are two AP's (in fact 3 that are ballanced for the support role by riot). These are {{champion:143}} {{champion:25}} & {{champion:43}} with her off-build.\n* Than their are picks that riot now marks as support options in rotations like {{champion:161}} {{champion:63}}\n* Than their are picks that are not recognized by riot but still popup in the meta sometimes like {{champion:90}} {{champion:9}} {{champion:1}} \n* Than their are picks that riot really want to remove out that lane but they still apear now and than like {{champion:101}} {{champion:99}} {{champion:74}} {{champion:45}} {{champion:142}} \n\nMost AP supports are perfectly fine in the support role. They often have an early powerspike and than slowly get outscaled by other supports. Additionally most AP support have massive weakness (they are squishy and have little to no disengage) that you can exploit.","replies":[]},{"poster":"Mast3rMahan","date":"2018-02-18T06:17:36.420+0000","up_votes":3,"down_votes":1,"body":"Learn to play champs like Blitz, Ali, and Leona and you will do fine. The problem. Isn't that he has no counters, the problem is that YOU won't play them. Leona can stun lock him pre six and he will get blown up because he is so squishy. After 6 it just gets worse since she can ult stun you and can't be punished like her Q E combo. Alistair has easy engages and Blitz Q outranges all of Brands skills. Instead of complaining that someone is OP because you can't kill them as the champion they counter, learn how to counter them.","replies":[]},{"poster":"Jinx Hunter","date":"2018-02-18T00:13:11.838+0000","up_votes":4,"down_votes":2,"body":"Maybe if he wasn't dog shit for mid he wouldn't go bot, hmm its almost like giving champions a lot of inbuilt damage over scaling is a bad thing and forces them to go bot instead of building AP over pen and going mid {{champion:143}} {{champion:63}}\n\nZyra and Brand should have better scaling, much better AP scaling and less base/passive damage. (I am a fond believer and player of Zyra and Brand mid and believe the belong there not in bot.)","replies":[]},{"poster":"Handy Sandy ","date":"2018-02-17T18:11:08.736+0000","up_votes":4,"down_votes":2,"body":"Well he doesn't offer much of anything else...","replies":[]},{"poster":"Devilreaper XIII","date":"2018-02-17T18:14:36.767+0000","up_votes":5,"down_votes":8,"body":"brand is overall a bit too much, they should either remove his stun since its easy to hit....\nand he does alot of damage yes, OR lower his damage or range.\nhes not just doing too much damage on bot.","replies":[]}]}