{"poster":"kiskeni","date":"2019-06-05T22:59:15.736+0000","title":"Telhetetlen kliens","up_votes":1,"down_votes":0,"body":"Olyan normál esetben létezhet, hogy EUNE-n játszva attól függetlenül, hogy szűz (frissen letöltött) kliensről van-e szó vagy sem, képes ez a szutyok kliens a háttérben 50%-ot (vagy többet egészen 60%-ig) bekajálni a procimból, miközben tulajdonképpen semmit sem csinál, csak háttérben van míg játszom? Miért csinálja ezt, és ami még érdekesebb kérdés, PBE-n miért fogyaszt konkrétan semmit sem játék közben a háttérben megnyitva álló kliens? Ez csak afféle EUNE-kliens sajátosság?\nA másik dolog, ami még a kedvencem, az a GPU-fogyasztás akár háttérben is. Nehogy már egy tétlen kliens egy RX560-at 25%-ig képes legyen már felpörgetni... Először YT közben vettem észre, mivel akadozott a videó ha mozgattam az egeret a videóra és onnan el.\n\nJó, amúgy nincs egy combos gépem (G4400, RX560 4GB nem butított változat, 8GB 2133MHz RAM), de ne mondja már nekem senki, hogy egy ennyire semmilyen grafikájú játékhoz ilyen egy erőforrás zabáló/pocsékoló romhalmaz kliens kell...\n\nPersze lehet, hogy nálam van valami hiba, amire eléggé 0 az esély, de ki tudja... Elvileg Win10 clean install után is, a megfelelő illesztőprogramok megléte mellett is ugyanilyen attól a pillanattól kezdve, hogy felkerül a LoL a gépre. A PBE kliens sokkal-sokkal takarékosabb, kb. annyi erőforrást köt le, amennyi reális, nem pedig az összeset (is)... Komolyan kellene ennek a (már bocsánat a szóhasználatért) sz*rnak a 4 mag? Ez röhej...\n\nTesómnál amúgy sokkal jobban fut a gép megnyitott klienssel, bár mondjuk neki pont egy Ryzen 3 2200G procija van 8GB 3000MHz DualChannel RAM-al és így értelemszerűen Vega 8 IGP-vel.\n\nÍrok értelemszerűen a Riot Support-nak is ez ügyben, bár nem hinném, hogy ez hiba. Nekem nagyon úgy fest, hogy a kliens szimplán csak telhetetlen és egyszerűen nem éri be egy viszonylag még modern, de 2 magos és 2 szálas, 3.3GHz-en ketyegő procival. Nesze neked 6. generációs Pentium...\n\nSzerk.: tudom, hogy létezik az opció, ami bezárja a klienst játék közben és tudom, hogy hasznos lenne, ugyanis azért néha igencsak képes hullámvasutazni ez az fps-emmel, de attól még nem akarom ezt bekapcsolni. Lassabban jutok úgy a játék végi képernyőre, meg hát -mint említettem- irreálisnak tartom ezt a mértékű erőforrás zabálást egy ilyen együgyű grafikájú játéknál.","replies":[{"poster":"Shikaichi","date":"2019-06-06T11:51:16.108+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem lehet, hogy túl sok minden fut a háttérben? Tudom [ez ](https://support.riotgames.com/hc/hu/articles/201752684)a cikk az FPS problémákra íródott, de alapvetően a gép gyorsítása a cél a legtöbb lépésben. Itt egyébként a harmadik tippre kérdeztem rá, és így lehet javítani.\nAz tény, hogy sokat használ a memóriából, de ilyeneket nem produkál nekem, hogy a YT videó elkezd szakadozni.","replies":[{"poster":"kiskeni","date":"2019-06-06T14:45:50.834+0000","title":null,"up_votes":1,"down_votes":0,"body":"Up: ha leteszem tálcára a klienst, nem pedig csak átváltok egy másik programra, akkor jelentős mértékben csökken az erőforrás-használat. A GPU 5% köré esik a 18% helyett, ha használom is a klienst, akkor lehet 30% körül, a proci pedig szintén valahogy így, olyan 20%-ról vissza egészen 5% köré. Attól még ha használom a klienst, nem is bánik kegyesen a gépemmel :D","replies":[{"poster":"Shikaichi","date":"2019-06-06T16:02:40.986+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem indulnak a Windowssal együtt feleslegesen programok? Amiket például nem is használnál egyébként aznap. Én minden hülyeséget kilőttem, ami csak feleslegesen terhelte a gépet, és nem is tudtam róla, hogy az a háttérben mindig futott. Ezt is ott a fentebbi cikk, 3. pontjában tudod megtenni. \nEgyébként nekem is hasonló, de mint írtam, komolyan nem lassítja a gépet, csak nagyon ritkán veszem észre, hogy akadozás van. Nekem ha nincs megnyitva a kliens akkor a processzor használat 0 és 10 százalék között mozog, ha meg van nyitva, de a tálcán van, akkor 20 és 30 között, ha épp az az aktív ablak, akkor nagyon változó, attól függ, hogy csinálok-e valamit éppen benne. Maximum 40%-ra ugrik fel ilyenkor. A videokártyát nem tudom, mert az Advanced System Care nem mutatja. Amúgy ezzel a programmal szoktam takarítani is a gépet, nekem sosem csinált még galibát a registrykkel.\nAz én gépem:\nIntel Core i5-3230M 2.60 GHz\nNvidia Geforce 710M 2 GB VRAM\n6 GB RAM\n700 GB HDD winchester","replies":[{"poster":"kiskeni","date":"2019-06-06T18:47:49.387+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hát igen, a te procid HT-s, 4 szálon képes dolgozni. Hiába régebbi, ez sokat jelenthet ennek a kliensnek önmagában is.\n\nAmi az induló programokat illeti, nincs olyan, ami ne kellene vagy ne lenne a rendszer szerves része. Mint mondtam, csak a számomra tényleg szükséges programok vannak fent, ami nem is olyan sok, PBE-t, LoL-t leszámítva 19db (+illesztőprogramok). Ezeknek csak a töredéke olyan, amiknek állandóan a háttérben kell futniuk (egérkezelő szoftver, illesztőprogramok, néha torrent kb.). Az Office Click-to-Run az egyetlen, amitől eddig nem tudtam szabadulni, de egy jó ideje már nagyon jól viselkedik és nem eszi a gépet véletlenül sem. Most találtam egy lehetséges megoldást, elvileg a Szolgáltatások között meg fogom találni és le fogom tudni tiltani, mert hogy az automatikusan induló programok között nem szerepel (Feladatkezelő Indítás fül). Sőt, most nézem, hogy meg is találtam :D Múltkor mikor kerestem csak azért nem leltem rá, mert magyarra fordítva van a Szolgáltatások között, nem pedig angolul, ahogy a folyamatok között is... Mindegy, 1-el kevesebb.\n\nSzerk.: nem akartam regényt írni, így töröltem a hsz-em egy tetemes részét :D A lényeg ennyi.","replies":[{"poster":"Shikaichi","date":"2019-06-06T19:26:20.514+0000","title":null,"up_votes":1,"down_votes":0,"body":"Őszintén akkor nem tudom még mit lehetne tenni. Talán még az Alsó kategóriás módot tudnám ajánlani, de ez is csak használat közben kapcsol ki animációkat. A játék közbeni kliens bezárás nekem sem vált be amúgy, borzasztó lassan tölti be utána újra, a honorálásról le is maradok szinte.","replies":[{"poster":"kiskeni","date":"2019-06-07T15:25:36.721+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem akkor gépújítással fogok véget vetni ennek. Használhatónak így is bőven használható, tehát úgy összességében élvezhető, de amikor gond van, akkor képes elég durván is problémázni akár. Amúgy is tervben van, csak lövésem sincs, hogy mikor lesz rá lehetőségem.","replies":[{"poster":"Shikaichi","date":"2019-06-07T15:45:45.544+0000","title":null,"up_votes":2,"down_votes":0,"body":"Igazából szerintem is ez a legjobb megoldás, ha nem is mindent, de például a processzort cserélni. A RAM például nem olyan borzasztó még, nekem is csak 6 van benne.","replies":[]}]}]}]}]}]},{"poster":"kiskeni","date":"2019-06-06T14:42:16.431+0000","title":null,"up_votes":1,"down_votes":0,"body":"A sok memóriahasználat nem probléma, a 8GB RAM-omból így is nagyon maximum 55%-ot használ el, az én felhasználási szokásaimmal pedig amúgy olyan 45% körül, tehát bőven elfér még a háttérben sok más folyamat is, a RAM-omon nem múlik. Az a probléma, hogy a processzort, illetve újabban a videókártyámat is irreális mértékben zabálja a kliens, míg PBE-n egyáltalán nem ilyen falánk. A videó ezért akadozik legfőképp, mert képes ez a retek 30%-ot is üresjáratban akár lecsippenteni az RX560-amból, holott semmi oka nem lenne rá, legalábbis eddig nem használt konkrétan semmit sem a kliens. Fontos, nem a játékról beszélek, hanem a kliensről (mivel hogy a játék és a kliens külön folyamatokban futnak). Ha nem használna semmit a GPU-ból, ahogy az eddig is volt, akkor talán nem jelentene gondot a magasabb processzor kihasználtság és nem szaggatna a YT videó, ha ráviszem a videó ablakra vagy leviszem arról az egeret. Amúgy ha megnyitom a böngészőt és a kliens is nyitva van, de nem nyúlok hozzá, tehát nem viszem rá az egeret a videóablakra, akkor szépen megy a videó szaggatás nélkül. A processzor kihasználtságot sem tudom igazán hova tenni, a kezdetekben mikor váltottam elég szépen futott az új kliens, aztán egyszer csak megmakkant, azóta pedig mindegy, hogy friss (clean install utáni) rendszer és friss (letöltött) kliens, mindig keményen megdolgoztatja szegény G4400-amat. Árulkodó, hogy játék közben az elvileg csak memóriában álló, semmit (vagy nem sok mindent) csináló kliens megpörgeti 60%-ra a procit.\n\nEgyébként elolvastam a linkelt cikket, csak sajnos ezek nem segítenek semmit. Töredezettségmentesítés nálam automatikus a Windows 10 beépített Meghajtó optimalizáló programjával, ami képes különbséget tenni SSD és HDD között, illetve aszerint eljárni (optimalizálni/töredezettség-mentesíteni). Registry-ben nem matatok, inkább nem telepítgetek semmit sem, meg hát amúgy is felesleges (és esetenként kockázatos is) lenne, mivel ki tudja mikor hibázik a CCleaner is. +1, hogy SSD-m van, ami nem arról híres, hogy belassul, főleg ha legalább 25% feletti szabad tárhely van rajta mindig (ami nálam pl. 60+%, pedig a kliens is a 120GB-os SSD-n van). Minden egyéb grafikai, illetve ingame beállítás is az én szempontomból irreleváns, elméletileg bőven meghaladja az ajánlott gépigényt a konfigom, nem szabadna ennek gondot okoznia és nem is okoz gondot, mivel 200+fps-ekkel indítok eleve max grafika mellett FullHD-ban. A sérült kliens fájlokat is kizárhatom többszörösen is, ha csak nem eleve sérült fájlokat szedett le a kliens az újra letöltésekkor. Ez esetben én tehetetlen vagyok. A hűtés is megfelelő, folyamat figyelem a gépet és takarítom/újra pasztázom. Az illesztőprogramokkal sem lehet gond, a legfrissebbet szedem le mindig és naprakészen is tartom mindet. Egy időben az energiagazdálkodásnál a Vezérlőpultban belőttem a Teljesítmény üzemmódot, de az sem dob semmit a latba, így az utóbbi 2-3 Windows clean install után ezt nem állítottam már be. Az gondolom már kiderült, de nem kívánatos programokat nem használok (tudtomon kívül sincs fent ilyesmi, tudnék róla), mivel mint említettem, ezen a gépen nagyon ritkán telepítek fel bármit is. Rendszer újratelepítéskor egyszer letudom ezt a részét, és onnantól kezdve nem igazán rakok fel mást. Mókolni torrentes játékokkal már nem akarok, felesleges pénzem játékokra nincs, a konfigom amúgy is max 2014-ig (elvétve egy-két 15-ös cím) elegendő játékokhoz, tehát az igazán izgalmas új címek PC-n számomra két szempontból is ki vannak lőve. Programokból megvan a kis magam készlete, én azzal tökéletesen megvagyok, sosincs olyan alkalom, hogy ne tudnám ezt és azt a fájltípust megnyitni, vagy ezt meg azt elvégezni programhiány miatt.\n\nOlyan anomáliák, amik ellen max ideiglenesen tudok tenni azért szoktak előfordulni. Pl. nem elég, hogy a kliens sem kíméletes a procimmal, néha egy-egy amúgy békés folyamat/Windows rendszerfolyamat is megbolondul és úgy zabálja a procit, mintha nem lenne holnap. Ezek a folyamatok már megmakkantak párszor: WebHelper (32bites) - messze ez volt a legdurvább a maga 96%-os proci kihasználásával, Antimalaware Service Executable (alias Windows Defender), Microsoft Office Click-to-Run - Office programcsomag, néha kell. Ezek közül 2-t le tudtam lőni feladatkezelőből, a Defender folyamatot pedig értelemszerűen védi a rendszer, így azt még rendszergazdai fiókkal sem tudod lelőni. Ilyenkor átmeneti megoldásképp ki kellett nyomnom a Defender-t annak beállítasi között, ami hát ugye újraindítás/ki-bekapcsolás után önkényesen visszakapcsol.\n\nŐszintén szólva eléggé ötlettelen vagyok, miért csinálja ezt a kliens. Alapból nincs okom panaszra a géppel kapcsolatban, de ha fut a háttérben a kliens, akkor sokkal döcögősebb minden. Játék közben sosem hagyok nyitva semmi mást a kliensen kívül, ezzel is minimalizálva a gép terhelést, és bár alapból szépen fut a játék, de azért néha-néha besokall a pc-m az elvárhatóhoz képest magas kliens általi proci/GPU használattól és akadozik is akkor a játék. Ez fps-számban nem mutatkozik meg különösebben, 70 alá így sem esik be soha, ám ilyenkor mintha mégis bőven 70 alatt lenne, úgy néz ki legalábbis.\n\nBocs a hosszas válaszért, csak a lehető legrészletesebben szeretnék a válaszolók számára rálátást biztosítani az esetre, hátha akad végül megoldás, ami visszalendíti normális szintre az erőforrás-használatot.","replies":[]}]}]}