{"poster":"kiskeni","date":"2019-08-24T16:57:08.635+0000","title":"Ranked játékosok","subforum":"Általános beszélgetés","up_votes":3,"down_votes":0,"body":"Üdv, rövid leszek (és olykor nyers).\r\n\r\nMit lehet tenni az ellen, ha a \"boosted plat majomja\" (szófordulat) 0/24 pofázik és CSAKIS mást hibáztat? Mert ez kegyetlen mértékben rombolja a játékot (mármint ez a rengeteg chat használat). Hisz bár összességében elégedett vagyok azzal, ameddig eljutottam, de úgy érzem még összejöhet a Diamond is, viszont ez a plat3 egy kegyetlen szopóág... Játszok már egy ideje, de ilyen önpusztító, saját magának vereséget okozó, chat-en időt pazarló játékosokkal nem találkoztam még... Vagy ezt csak valahogy ellensúlyoznom kellene? Netán kezdem elérni a maximumomat rangban és a feljebbjutáshoz túl kéne teljesítenem a diamond alján levő játékosokat is? Vagy micsoda? Csak szerintem vannak most különösképp meghülyülve a játékosok? Vagy csak balszerencsés lennék? Mert ingame nem érzem magam annak, sőt, igazából úgy megy, mint eddig.","replies":[{"poster":"Dyromic","date":"2019-08-26T19:00:21.349+0000","up_votes":3,"down_votes":0,"body":"Én feladtam a climbot erre a seasonre. A P2 egy olyan fal, amit egyszerűen nincs kedvem megmászni. Lehet sikerülne az a diamond 100+ gamemel, de hogy a mentális  egészségem rámenne az is biztos.","replies":[]},{"poster":"kiskeni","date":"2019-08-27T13:31:02.647+0000","up_votes":2,"down_votes":0,"body":"Biztató :D Egyébként lehet elég komolyan le fog redukálódni a LoL-ra fordítható időm, szóval lehet nem lesz így diamond. Elvégre már tényleg a küszöbön van lassan a szezonzárás, a kapott lp-k is szépen leredukálódtak 16-18-ra, de szerencsére nem is bukok többet (még). A némítás parancsot elkezdtem amúgy használni és volt egy \"dübűérzéssel\" session-öm, amiben 3x wint húztam be és a 4-ediket buktam, ami amúgy p3 promoba rakott volna (megint), de ez attól még nem változtat a tényen, hogy a többiek bődületes mennyiségű időt áldoznak fel a chat-re egy meccsen, ami meg is látszik a teljesítményükön. Nekem összességében csak ez a bajom (meg nyilván a poszt írásakor kicsit frusztrált voltam). Az lenne jó, ha valahogy elfelejtené mindenki a chat-et, már ez is önmagában egy sokkal kiegyensúlyozottabb és ferebb meccset eredményezne. Deeeeee nem, a vérpistikék mindig vergődni fognak...","replies":[]},{"poster":"AxeCap","date":"2019-09-04T12:59:09.961+0000","up_votes":1,"down_votes":0,"body":"Gyakorlatilag ez diában csont ugyanígy történik, csak nem pofáznak, hanem szimplán kilépnek. Sajnos 10/8 játékban az egyik lane biztosan hard lose-ol (5-6 halál), és onnantól nem sok értelme van folytatni. Szerencse kérdése, hogy a csapattársad nyeri, vagy az ellenfélé. Nem csoda, hogy a nagy lane pressure-el rendelkező champek (Zed, Yasuo, Irelia) ennyire népszerűek.","replies":[]},{"poster":"Jack Eron","date":"2019-08-27T08:35:04.336+0000","up_votes":1,"down_votes":0,"body":"Hagyd a fenébe az egészet. A ranked dia1-2 fölött lesz viszonylag oké, addig olyan, mint a normál, csak \"tétje is van\" a meccseknek. Ahhoz, hogy oylan eloban játszhass, ahol értelmes embereket kapsz, annyi időt kell befektetned, és annyi agysejtedet kell elhasználnod a sok idióta között, hogy egyszerűen nem éri meg. Semmit sem profitál belőle az ember.","replies":[]},{"poster":"LegendWizard08","date":"2019-08-26T13:34:47.917+0000","up_votes":1,"down_votes":1,"body":"/mute all amit tudsz tenni (bár gondolom tudsz erről) ez a játék ilyen rengeteg game van amit az ember nem nyerhet meg de mégis mimdhez úgy kell hozzá állni mintha megnyerhetnéd a teamekkel nem kell foglalkozni csak azzal hogy te mit tudtál volna jobban csolinálni. Rögtön 2 gamem is eszembe jut ahol tudom hogy letudtam volna hozni ha jobban játszok igaz hogy egyikben se volt túl jó a team. De velük valószínűleg nem lesz több meccsed csak magaddal. De igazából a feederekkel/flamerekkel/trollokkal nem tudsz mit kezdeni csak report és reméled hogy büntetik.","replies":[{"poster":"Jack Eron","date":"2019-08-27T08:33:25.956+0000","up_votes":1,"down_votes":0,"body":"Ezaz, hogy a lényeggel az ember nem tud mit kezdeni. Akinek jár a szája, annak megy a mute és kész. De más esetben... a hozzáállásom sajnos nem változtatja meg a tényeket. Csinálhatok úgy, mintha elhinném, hogy minden nyerhető, és nem muszáj foglalkoznom az ad soraka toppal, de 99%-os valószínűséggel ennyi volt. Attól, hogy azzal foglalkozom, hogy én mit csinálhattam volna jobban, még egyik csapattárs sem fog jobban játszani, és a troll sem fog leállni...","replies":[]},{"poster":"Martyn19984","date":"2019-08-26T20:05:04.978+0000","up_votes":1,"down_votes":1,"body":"Nincs igazad. Ha te tudod hogy mindent jól csinálsz, mellékesen a teamed is elismert, de a hard feeder troll csapattársad annyira nyomja hogy legyen az 5v5 helyett 4v6 vagy 3v7,hogy Te az ellen már semmit nem tehetsz. A trollt lehet flameli és blamelni is nyugodtan.","replies":[]}]}]}