{"poster":"andrulp","date":"2016-02-09T17:03:23.110+0000","title":"Lo que yo noto!!","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":1,"body":"Bueno llendo al grano el problema de la colas de &quot;Reclutamiento Normal&quot; es que al igual que pasa con la selecci&oacute;n normal es que muy pocos quieren ir de support, en mi caso particular e llegado a estar 40 min en cola y sin ning&uacute;n resultado y al poner de segundas &quot;Relleno&quot; puedo asegurar que siempre me toca support.\r\n\r\n&iquest;C&oacute;mo solucionarlo?\r\n\r\nSencillo dando una peque&ntilde;a mejora de pi ya sea del 10% o el 20% para alguien que quiere conseguir desbloquear m&aacute;s campeones tendr&aacute; la opci&oacute;n de elegir de primeras su l&iacute;nea preferida y de segunda relleno y si de casualidad le toca relleno que obtenga el beneficio del aumento de pi, al igual que si alguien pone relleno de primeras que autom&aacute;ticamente tenga un beneficio mayo (digamos un 30%) porque seamos sincero seguro le toca support.\r\n\r\n&iquest;No es poco un 30%?\r\n\r\nNo, porque saquemos cuenta si la una partida normal te da entre 70 y 100 pi el beneficio ser&iacute;a de 30 pi aproximadamente lo cual al cabo de 3 partidas ser&aacute; lo mismo que aver jugado 4 no es mucho ni es poco y seria un cambio muy considerable al tiempo de espera de la selecci&oacute;n de reclutamiento.\r\n\r\nSaludos.","replies":[{"poster":"ANNIE QUILADO","date":"2016-02-10T17:55:42.726+0000","up_votes":1,"down_votes":0,"body":"me da risa que la cola de draft pick sea tan larga, tanto tiempo muchisima gente quejandose de que le gustaria tener esta cola. y ahora? nadie la juega o que pasa?","replies":[]},{"poster":"Pablove90","date":"2016-02-09T17:32:54.201+0000","up_votes":1,"down_votes":0,"body":"Para mi... asi como esta, esta bien lo de suports... ser support te da mas ''todo'' ya...\nsiendo supp conseguis muchos puntos (digamos) de mmr por todo lo que haces... siempre el 2do o 1er mejor kda es del suport por las asistencias que cuentan como kills a pesar de que no te las paga en oro,  los wards, sacar vision, absorver daño curar, aguantar en linea morir poco, etc son cosas que suman tanto que realmente deve ser la linea mejor ''paga'' por asi desirlo .. conseguis muchos pl, exp en maestrias y ensima  es casi normal tener clasificacion S, S+ .. para que sirve esto? lo nuevo de las cajas hetchs vienen si llegas a esaas calificaciones\nsi a esto le sumamos pi extra seria mucho ya... y creo que no cambiaria que aya mas suports.. y mejor que asi sea... ser support es algo que te tiene que gustar...  ayudar, que no te importe tu score, acompañar a tu team, desidir cuando es el momento de inciar, mirar constantemente TODO el mapa, morir si es necesario para que tu compañero viva y q no pierda tiempo de farmeo, etc .... \nnunca voy a entender por que no eligen esta linea.. esta jgla creo q son 2 lineas que si las dominas no dejas mas ... es muy raro que un 1 player gane la partida, porque si del otro lado hay team no tiene nada que hacer ni el mid mas op.. y el sup y el jgla SON el team...(no soy jugla aclaro pero los respeto muchisimo)","replies":[{"poster":"Ruphian","date":"2016-02-09T17:44:08.617+0000","up_votes":1,"down_votes":0,"body":"Nah, ademas, como que el mejor kda si tenes que morir para proteger al adc?","replies":[{"poster":"Pablove90","date":"2016-02-09T19:24:08.110+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PantheraVolt,realm=LAS,application-id=PJAKt7ph,discussion-id=6iiyLZ4F,comment-id=00010000,timestamp=2016-02-09T17:44:08.617+0000)\n>\n> Nah, ademas, como que el mejor kda si tenes que morir para proteger al adc?\n\nno es necesario morir... pero aveces pasa q te vas a nada de vida junto con tu adc y el quedo atras.. y bueno volves y haces todo por que no lo maten..  pero ser supp no es ser suicida jajaja\nmira mi historial y fijate que al menos mi kda safa no sera el mejor de las partidas peero bueno es lu que hay\ny otra cosa.. no tenes que proteger al adc por ser supp.. si empesas con el porque es el mas debil y tiene 0 movilidad.,.. pero despues de tirar torre pasas a reforzar lineas, dar vision, sacar, asegurar objetivos, pushear lineas, etc.. osea el adc se tiene q arreglar solito ya, que esa es la eterna discusion de los supps.. no somos la sombra del adc somo del team.. si el adc pushea solo, se manda solo a la jgla.. o el simple hecho de pisar el rio solo es problema del adc...  en juego tardio somo una especie de jgla mas y el adc tiene que farmear seguro... pusheando con vision, mirando el mapa, y pidiendo un poco de farm al jglero...","replies":[]}]}]},{"poster":"Mazer Rakham","date":"2016-02-09T18:05:49.103+0000","up_votes":1,"down_votes":0,"body":"Y por qué no buscás main supp para jugar? Te evitarías mucho tiempo. Siempre que hay un supp en mi grupo salimos al toque, porque top, mid, adc y jg se consiguen enseguida.","replies":[]},{"poster":"Rentorar","date":"2016-02-09T17:52:41.034+0000","up_votes":1,"down_votes":0,"body":"También pasa que la gente nota eso y va a jugar normal selección oculta , para no tener colas tan largas , mira yo siempre voy con la opción relleno (fill) y me a tocado bastante variado no siempre support (adc y jungla bastante seguido)  , pero si comparas en ranked las colas ni son largas son instantáneas , es una cuestión de costumbre.\n\nAntes también estaba reclutamiento y en otros server estaba desde antes de la nueva selección y tenían el mismo problema , la gente no le agarra tanto cariño ni al modo ni al tiempo de espera , es como que dicen , para jugar reclutamiento voy a ranked directamente , y esa costumbre es lo que también genera que las colas sean largas , si la gente se acostumbrara desde que consigue champions suficientes para ir a reclutamiento normal las cosas serías distintas, pero por cuestión de costumbre sigue siendo selección oculta la elegida por mayoría amplia de servidor para normal","replies":[]},{"poster":"Nombre ofensivo","date":"2016-02-09T17:07:02.658+0000","up_votes":1,"down_votes":0,"body":"ya dijeron que contemplaban esa posibilidad si es que tenían problemas en las colas","replies":[]},{"poster":"leonidaslorenzot","date":"2016-02-09T18:03:29.331+0000","up_votes":0,"down_votes":0,"body":"mira no se si les pasa a todos pero para mi y mis amigos el problema no es el suport (ya que me gusta ir suport me pongo polivalente porque igual me da ir suport o jungla o top o mid ) el problema son las personas que tienen retraso y se ponen principal jungla y dicen dejen top o troleo pero volviendo al tema  no se por que todos ven mal al suport de no ser por nosotros los agrandados  que nos tocan de ADC saldrian 0/27/0 la cantidad de veses que como suport se salva al adc ya sea tapando avilidades o corriendo a los enemigos lejos del equipo o hasta wardeando cosa que ultimamente estamos poniendo wards los suports y los lee sin nomas (sin ofender pero nisiquieran wardean bien wardean para ponerse un escudo y salvarse de la bronza que hicieron en menos de 2 segundos sin ofender yo tambien soy bronze y no pongo wards en la mitad de la linea en la que el top ni teleport lleva ) el suport es el mas callado y el que mas sirve porque por ejemplo {{champion:53}}  se encarga de que su adc o mid quede re vendido entre todo tu equipo pero el credito es para el que se lleva la kill al fin los suport salimos 0/15/29 y somos feeders por el score pero si le hacemos ks se vuelven satan todo el mundo y empiezan report suport troll o report suport ks al final todo lo malo que pasa es culpa nuestra (si se hacen baron es culpa nuestra por no tener mas ward y si matan a alguien es culpa nuestra porque justo estabamos ayudando al jungla y al adc con el dragon  y mas te vale que tu equipo mire el mini mapa que havisas 20 veses con alertas que el enemigo desaparecio y el {{champion:157}}  de mid sigue pusheando y lo agrran entre una bukake de a 4 y la culpa es tulla aunque este todo wardeado (sin ofender no todos los yasuos son iguales me an tocados yasuos que si miran el mapa y si deciden quedarse pusheando admiten que es culpa sulla) bueno al final me encanta ir suport para cagarme de risa y para aclarar todo  lo de antes : el suport tiene la misma o mas inportancia que las demas posiciones y para los ADC que dicen yo no necesito suport esta nomas para curarme jugen adc solos y que su suport se valla con el mid o con el top que lo van a apreciar mas (y cuando lo maten 5 veses y pierda por 300 de farm les van a rogar que vuelvan ) por lo tanto si alguna ves te pasa algo que te insultan por cualquier boludes como ks en una tf o algo asi lo que les recomiendo es silenciarlos y juga total es un juego es para divertirse  mano arriva esos suports que no tenemos verguenza en divertirnos salvando a todo nuestro equipo y despues de la partida quedamos como heroes olvidados pero orgullosos de nuestro trabajo \n\nPD: perdon los orrores de ortografia","replies":[]}]}