{"poster":"blade405","date":"2016-08-07T06:24:34.618+0000","title":"Leave buster","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Leave buster is broken, My system crashed i came back on and finished the game. Now i have a 5 game low priority wait of 20 minutes.","replies":[{"poster":"Targons Blade","date":"2016-08-07T18:43:23.975+0000","up_votes":1,"down_votes":1,"body":"Disconnecting from a match negatively affects everyone in the match, regardless of the reason for the disconnection. This is a key reason why [Leaverbuster](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ) treats all disconnections equally and why penalties cannot me removed or modified. Additionally, you'll never get a penalty for just a single disconnection, as it takes a trend of disconnections before you end up with a 5x 20min queue timer.\n\nFull-on system lockups or crashes are often caused by hardware or operating system issues, so I recommend working through [this guide](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes).\n\nIf you continue to see these crashes after working through that guide, let me know.","replies":[{"poster":"D15turbed","date":"2016-08-07T23:23:15.173+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Targons Blade,realm=NA,application-id=osqw6G4M,discussion-id=3Jbk3e8o,comment-id=0000,timestamp=2016-08-07T18:43:23.975+0000)\n>\n> Disconnecting from a match negatively affects everyone in the match, regardless of the reason for the disconnection. This is a key reason why [Leaverbuster](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ) treats all disconnections equally and why penalties cannot me removed or modified. Additionally, you&#x27;ll never get a penalty for just a single disconnection, as it takes a trend of disconnections before you end up with a 5x 20min queue timer.\n> \n> Full-on system lockups or crashes are often caused by hardware or operating system issues, so I recommend working through [this guide](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes).\n> \n> If you continue to see these crashes after working through that guide, let me know.\n\nI join a 5 player rank que.. one of the players had a ban of 20 mins... after 2 min left in the ban waiting one of the players had to go ..could not play .. so when the player left the que... the 4 other players had to wait another 20 mins because one of the 5 players had to go .. why is that???? that not right for the other 4 players that waiting that long to have a game going.... fix that roit","replies":[{"poster":"Targons Blade","date":"2016-08-08T15:13:25.931+0000","up_votes":1,"down_votes":0,"body":"That an unfortunate circumstance, however, it sounds like the system worked as intended. Low priority queue timers reset if you don't wait out the entire time for any reason. This is a reason why it's good to get confirmation from everyone in the lobby that they have the time available to commit to playing the match before entering queue. For complete details on how the system works, check out our [FAQ.](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ)\n\nLet me know if you have any questions.","replies":[]}]}]}]}