{"poster":"TCS Ejen","date":"2016-11-13T20:39:24.753+0000","title":"Vorschlag für riot","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Ich w&uuml;rde an dem alpha ver&auml;ndern das man z.B. die Freundesliste weg machen kann und dann kann man vielleicht ein gameplay von master oder challanger spielern zugucken , oder man kann den neuen patch sehen . An der lolfriends app w&uuml;rde ich auch gerne sehen k&ouml;nnen wie meine freunde stehen , weil wenn man mal nicht zuhause kann man dann sehen wie die freunde stehen ob sie verlieren oder ob sie gewinnen , weil mich es pers&ouml;nlich st&ouml;rt  wenn deine freunde schreiben gewinnst du ? oder verlierst du . Vielleich sieht das riot und nimm diesen vorschlag an das w&auml;re sehr nice {{summoner:14}} {{champion:76}}","replies":[{"poster":"MGP","date":"2016-11-14T01:47:06.167+0000","up_votes":1,"down_votes":0,"body":"Deinen ersten Punkt lasse ich mal außen vor, da er mich persönlich nicht stört!!\n\nBei deinem zweiten Punkt, den bezüglich des gewinnst du oder verlierst du, würde ich doch gerne mal etwas mehr hören. Vor allem, was du dir darunter vorstellst.\n\nSoll da neben dem Namen dann ein gewinnt gerade oder ein verliert gerade stehen?\nWenn ja mit welchem Algorithmus möchtest du das denn umsetzen, das Spiel ist schließlich nicht gerade einfach, sonder ziemlich komplex!!\n\nOder möchtest du da einfach ein par Informationen zum Spiel haben:\nZum Beispiel Stats der Team Gold Differenz Türme, etc","replies":[{"poster":"TCS Ejen","date":"2016-11-15T21:52:34.114+0000","up_votes":1,"down_votes":0,"body":"Ja ich möchte sehen Welche Champions die spielen und wie sie dem entsprechend auch stehen","replies":[{"poster":"MGP","date":"2016-11-15T22:56:52.965+0000","up_votes":1,"down_votes":0,"body":"Hmm wenn dir das wichtig ist meinetwegen\ndu kannst das ja mal im Unterforum Mobile-App Diskussion posten!!\n\nDa hast du eher chancen das, dass bei den richtigen Leuten gehör findet\n\nHier gehört das nicht so wirklich hin","replies":[]}]}]}]}