{"poster":"2use4pro","date":"2016-07-19T21:54:24.306+0000","title":"LP System Bei einem AFK","subforum":"Allgemeiner Chat","up_votes":0,"down_votes":17,"body":"_**Verbesserung GEGEN ELO HELL**_\nHi spiele in Letzter Zeit wieder etwas mehr Ranket in Silber 5 momentan ich f&auml;nde es gut wenn es f&uuml;r ein gewonnendes Spiel mit einem AFK Mehr LP Giebt\nUnd f&uuml;r ein Verlorendes weniger Verliert. In Bronce und anscheinend auch in Silber w&auml;hre es sehr hilfreich um Die Leute besser in ihre Elo einzuteilen.\nman muss ja nicht gleich 1000 mal so viel lp bekommen und garnichts verliern aber doppelt so viel und halb so viel W&auml;hre doch angemessen oder nicht Vieleicht kann man diesen Vorschlag ja Umsetzen pder jedenfals in die richtung gehen. \nZb. ich heute nach hause nach langer zeit vorgenommen wieder mehr Ranket zu spielen und in richtung Gold zu klimben hoch mutiwirt in die q \nnach 10 minuten geht der erste Bronce Hecarim AFK und unserer Top lane Teemo steht schon 0 4 0 mit 10 farm ...\nich ein Support (dem nach meiner Meinung Mehr M&ouml;glichkeiten gegeben werden m&uuml;ssten ein solches Game noch zu Drehen) stehe 0 1 7 als alista\nund helfe einen lucian gefeedet zu werden w&auml;hrend dessen muss man in s noch den (jungler) aufwecken um den Drachen anzugehen ...\nich habe zusammen mit dem mitlaner dem adc und am ende den Teemo dieses Game gewonnen und durch 3 montain drakes die kontrolle &uuml;ber die T&uuml;rme erlangt da ich die Grenze von 0 lp oft bei s 5 genutzt habe verstehe ich das ich nicht 100 lp bekommen sollte aber vielecht f&uuml;r ein 4 vs 5 als support mehr als 16 eher 40 LP bekommen sollte? w&auml;hre auch ein Anreiz nicht direkt zu surrendern ( wie es der Teemo versuchte ) xD\nso danke das Spiel ist mir wirklich heute so Passiert (LRS falls viele Rechtschreibfehler drinne sind ) danke w&auml;hre sch&ouml;n sollte das in riotler xD lesen das ich eine nachricht bekomme nur weil es sch&ouml;n ist zu Helfen ein fast Perfectes Spiel zu Perfectionieren.\n\n\n\n\nNeu: eine Ide von Euch !\nOK ich habe jetzt einen einfach zu verstehenden STRG+C Text formuliert!\nda ich zu viele Nachfragen zu diesen Thema bekommen habe habe ich etwas gelernt : bei komplizierten dingen ist es nie so einfach wie es aussieht .\nich möchte mit diesem beitrag in League of legends etwas bewirken , dass es hier so viele Fragen giebt und sooo viel zu diskutieren werde ich nun versuchen einen Text zu vormulieren der haupt sächlich logischer Natur ist.\n\nZiel: egal ob du glück hast oder Pech mit AFK ´s im Game du sollst eine 50% chance IMMER haben LP zu bekommen oder zu verlieren .Diese chance soll natürlich durch (skill)erhöt werden oder durch gutes spielen.\nEs geht dabei nicht darum alle faktoren wie Feeder ,trolls ,usw. aus der Gewinnchance heraus zu nehmen.\n\nIdee: ich habe nach langen diskutieren mit euch in diesem forum etwas heraus gefunden : ich muss alles strukturiert        auflisten also zeig ich euch Den Weg den ich gefunden habe um das ziel punkt genau zu treffen!!!!\n\nVorschlag: ich habe hierzu eine Formel ausgedacht( rechnerisch gefunden) die ich erkläre!\n\n\nFORMEL:     Gewinnchance (mit 5 spielern in beiden teams) / Gewinnchance (mit der Anzahl an Spielern im team\n                                                                                                                                                beim gewinnen / verlieren )\n                                                                                                            X Die LP!!\n\nBeispiel:       Vorraus (in lol ist die gewinchance aller spieler durchschnittlich 50% zusammengerechent)\n                      Zum Test haben wir mit 4 spielern im team eine 25% gewinnchance und mit 4 im Gegner team eine 75%                                            chance\n                       außerdem kriegen wir 20 lp fürs gewinnen und verlieren !!\n\n                            ( man kann glück haben und pech mit afk´s wir überprüfen beides)\n\n                          Pech zb.   12 games afk´s(im team) und 0 games afk´s(im gegner Team)\n                         \n                         wenn wir durchschnitlich spielen nicht schlecht nicht gut !   gewinnen wir von den 12 bei 25% \n\n\n\n                         3 Spiele in 3 spielen kriegen wir nach der formel   50% / 25% = 2       2 x 20 Lp 40 Lp pro spiel \n                         3 x 40 =  120Lp\n                         durch die verlorenden verliern wir  nach der Formel    50% / 75%    = 0,66 periode * 20LP = 13,3periode\n                        9 x 13,3 = 120 LP \n                                                                \n                        so ich habe hehört es ist unmölich versucht es selber mit anderen Zahlen !!!!!! \n                        wir verlieren  und gewinnen genau so viel egal wie oft einer afk geht                                                                                  \n                           .Wenn wir gut spielen gewinnen wir lp und wenn wir   schlecht spieln  verlieren wir welche !!!!  es ist egal ob afk oder nicht !!! \n\nFazip: mit dieser Formel kann man das glück wie viele afk´s im gegner teams oder im eigenen team sind beseitigen und die lp verteilung dach skill fortsetzen auch wenn es afk s giebt \n\n um diese Umzusetzen : müsste man die wirkliche win rate mit der anzahl von 4 bz w 3 spielern heraus finden und ein setzen die hier genommenden werte 25% und 75% sind schätzwerte !!!\n\nDANKEEE!!! an euch für die diskosionen und eure Meinungen zu dem Thema \n    ps: wenn man es verstanden hat ist es nicht schwer ^^ ","replies":[{"poster":"CMan","date":"2016-07-19T22:24:31.712+0000","up_votes":3,"down_votes":0,"body":"Es gibt keine Elohell.","replies":[{"poster":"2use4pro","date":"2016-07-20T12:55:56.300+0000","up_votes":1,"down_votes":1,"body":"neinjedoch giebt es afk s die das aufsteigen verlangsammen und durch eine veränderung hier würde man kein glück mehr beim Aufsteigen haben sondern müsste sich auf skil verlassen ^^ zb ich 120 games 6 mal die gegner ein afk 1 mal wir so jetzt hab ich mehr lp als verdient oder nicht ? (nur ein Beispiel)","replies":[{"poster":"CMan","date":"2016-07-20T13:06:31.697+0000","up_votes":2,"down_votes":0,"body":"Aufsteigen hatte nie und hat auch heute nichts mit Glück zu tun.\n\nAFKs sind langfristig immer in beiden Teams vertreten und gleichen sich aus. Nennt sich Statistik.\nDas hat nichts mit verlangsamen zu tun. 4 Randoms = 4 potentielle AFKs in deinem Team, 5 drüben. Per se ein Win für alle, die mit ordentlichem Equipment spielen und sich anständig verhalten.\n\nDer einzige Faktor, der für das Rating relevant ist ist die Performance von einem selbst (+ggf. die von regelmäßigen Premades). Sonst nichts. Das war schon immer so.\n\nUnd zuletzt ist das \"Problem\" mit AFKs keinesfalls auf LP bezogen. (s.o.) Nein, die Sache ist, dass der Spielspaß leidet. Niemand hat Bock auf 4v5. Das werden aber keine LP-verändernden Maßnahmen ändern.","replies":[{"poster":"2use4pro","date":"2016-07-20T13:13:40.635+0000","up_votes":1,"down_votes":5,"body":"ICh KENNE das Gesetz der großen Zahlen so nennt man das ^^ \njedoch ist es ja nicht so das du das du 1000 games ranket spielst so lange du nicht unendlich spiele spielst ist die Wahrscheinlichkeit auf eine unausgeglichenheit immer SEHR hoch und auch das diese sehr groß ist wir haben wahrscheinlichkeitrechnungen in mathe es ist Glück da es Eine super geringe wahrscheinlichkeit ist das es ausgeglichen ist wenn du das nicht verstehst bring ich dir wahrscheinlichkeits rechnungen mit stochastik bei ^^ so danke ! es ist bei 10 % ausgeglichen das ist gerechnet ! der rest hatte pech oder glück mit meinem system währen alle ausgeglichen denk mal nach !","replies":[{"poster":"Thoky","date":"2016-07-20T13:51:59.648+0000","up_votes":1,"down_votes":0,"body":"Hättest du die Stochastik richtig verstanden wüsstest du, dass die Wahrscheinlichkeit dass sich die von Klemens angegeben Gleichung auflöst mit jedem Spiel erhöht.\nAber hier nochmal die Erklärung: \nDein System ist indirekt im Spiel vorhanden denn deine Stochastik sagt simpel dargestellt folgendes:\n\n10 Spieler im Spiel\nAnzahl gegnerisches Team Spieler > Anzahl eigenes Team -1\n (die -1 ergibt sich daraus dass du der unmögliche Faktor bist und ja logischerweise in deinem Team)\n\nalso 5 > 4\n\n100/9\n11,11 periode\n\nGegner Team:\n5x 11,11 periode = 55,5 periode\n\nDein Team\n4x 11,11 periode = 44,4 periode\n\nIch weiß und entschuldige mich dass dies sehr simpel dargestellt ist, aber im Grunde bedeutet dies, dass sollte ein afk vorhanden sein, du in deinem Team potentiell in jeder runde zu 44,44% den afk hast und das Gegenteam zu 55,55% und an diesen wert wirst du dich mit jedem gespieltem Ranked annähern, sprich mehr Lp fürs nicht afk gehen erhalten.\n\nHab jetzt drüber nachgedacht und Klemens hat immer noch recht kannst mir das bitte erklären ?","replies":[{"poster":"2use4pro","date":"2016-07-20T14:15:30.055+0000","up_votes":1,"down_votes":2,"body":"so sehr nett eine logische antwort wir sehen also mehr Games genauerer Wert oder besser gesagt : eine höheree warscheinlichkeit ein genaueren wert zu erlangen dass nennt man glück auch wenn nach 10000 games die wahrscheinlichkeit bei 0,000001 % liegt 100 afk´s gehabt zu haben und bei den gegnern keinen ist die wahrscheinlicheit dar \nüberlege mit mein system hast du auch die chance bei 100 afk leuten aufzusteigen wenn du sieser 0,0000001 % typ bist hast du immer noch durch meine wariante die 50 % cance aufzusteigen und wenn du Glück hast und die gegner nur afk´s ebenfals 50% man muss sich nicht auf % verlassen es wirs auch ausgeglichen wenn du pech hast und einer von 100000 tausend bist die glück oder pech haben .. so endscheidet NUR dein spielstil ob du aufsteigst oder nich!!! danke","replies":[{"poster":"Thoky","date":"2016-07-20T14:34:48.048+0000","up_votes":1,"down_votes":0,"body":"Was du Versuchst ist den Faktor Glück auszuhebeln, was schlichtweg unmöglich ist mit egal welchem System.\nWenn du versuchst Afks zu beheben, musst du laut deiner Argumentation auch dinge wie Feeder, Trolle, Smurfs und viele andere Faktoren in der Lp Vergabe beachten.\n\nSchreib mir das System welches dass kann und du kriegst nen Nobelpreis glaubs mir :) \n\nSowas währe anwendbar auf unzählig viele Dinge, wie die Notenvergabe in der Schule oder im Studium, psychologischen Analysen und und und..... \n\nSolche ein System gibt es leider nicht und wird es auch nie geben, da der Faktor Glück wie du sicher auch in der Schule gelernt hast immer vorhanden ist und durch keinen bekannten weg beeinflusst werden kann.\n\nAlso siehst du worauf es hinausläuft wenn du deinen logischen weg folgst {{summoner:21}}","replies":[{"poster":"2use4pro","date":"2016-07-20T16:38:39.711+0000","up_votes":1,"down_votes":1,"body":"OK ich habe jetzt einen einfach zu verstehenden STRG+C Text formuliert!\nda ich zu viele Nachfragen zu diesen Thema bekommen habe habe ich etwas gelernt : bei komplizierten dingen ist es nie so einfach wie es aussieht .\nich möchte mit diesem beitrag in League of legends etwas bewirken , dass es hier so viele Fragen giebt und sooo viel zu diskutieren werde ich nun versuchen einen Text zu vormulieren der haupt sächlich logischer Natur ist.\n\nZiel: egal ob du glück hast oder Pech mit AFK ´s im Game du sollst eine 50% chance IMMER haben LP zu bekommen oder zu verlieren .Diese chance soll natürlich durch (skill)erhöt werden oder durch gutes spielen.\nEs geht dabei nicht darum alle faktoren wie Feeder ,trolls ,usw. aus der Gewinnchance heraus zu nehmen.\n\nIdee: ich habe nach langen diskutieren mit euch in diesem forum etwas heraus gefunden : ich muss alles strukturiert        auflisten also zeig ich euch Den Weg den ich gefunden habe um das ziel punkt genau zu treffen!!!!\n\nVorschlag: ich habe hierzu eine Formel ausgedacht( rechnerisch gefunden) die ich erkläre!\n\n\nFORMEL:     Gewinnchance (mit 5 spielern in beiden teams) / Gewinnchance (mit der Anzahl an Spielern im team\n                                                                                                                                                beim gewinnen / verlieren )\n                                                                                                            X Die LP!!\n\nBeispiel:       Vorraus (in lol ist die gewinchance aller spieler durchschnittlich 50% zusammengerechent)\n                      Zum Test haben wir mit 4 spielern im team eine 25% gewinnchance und mit 4 im Gegner team eine 75%                                            chance\n                       außerdem kriegen wir 20 lp fürs gewinnen und verlieren !!\n\n                            ( man kann glück haben und pech mit afk´s wir überprüfen beides)\n\n                          Pech zb.   12 games afk´s(im team) und 0 games afk´s(im gegner Team)\n                         \n                         wenn wir durchschnitlich spielen nicht schlecht nicht gut !   gewinnen wir von den 12 bei 25% \n\n\n\n                         3 Spiele in 3 spielen kriegen wir nach der formel   50% / 25% = 2       2 x 20 Lp 40 Lp pro spiel \n                         3 x 40 =  120Lp\n                         durch die verlorenden verliern wir  nach der Formel    50% / 75%    = 0,66 periode * 20LP = 13,3periode\n                        9 x 13,3 = 120 LP \n                                                                \n                        so ich habe hehört es ist unmölich versucht es selber mit anderen Zahlen !!!!!! \n                        wir verlieren  und gewinnen genau so viel egal wie oft einer afk geht                                                                                  \n                           .Wenn wir gut spielen gewinnen wir lp und wenn wir   schlecht spieln  verlieren wir welche !!!!  es ist egal ob afk oder nicht !!! \n\nFazip: mit dieser Formel kann man das glück wie viele afk´s im gegner teams oder im eigenen team sind beseitigen und die lp verteilung dach skill fortsetzen auch wenn es afk s giebt \n\n um diese Umzusetzen : müsste man die wirkliche win rate mit der anzahl von 4 bz w 3 spielern heraus finden und ein setzen die hier genommenden werte 25% und 75% sind schätzwerte !!!\n\nDANKEEE!!! an euch für die diskosionen und eure Meinungen zu dem Thema \n    ps: wenn man es verstanden hat ist es nicht schwer ^^","replies":[]}]}]}]}]}]}]}]},{"poster":"Megamaexx","date":"2016-07-19T22:19:37.298+0000","up_votes":3,"down_votes":0,"body":"Das doppelte ist eine brutale Menge, die viel zu hoch ist. Und für 40 anstatt 16 LP hättest du ein 2v5 gewinnen müssen, wenn man das mal etwas mathematisch betrachtet.\nWenn du aber 16 Punkte bei einem Sieg erhältst, wirst du bereits als “richtig in deiner Elo“ angesehen. Also warum da hin wo man schon längst ist? ;)\n\nBesser dich einfach konstant, dann wirst du auch halbwegs konstant aufsteigen.","replies":[{"poster":"2use4pro","date":"2016-07-20T12:53:28.978+0000","up_votes":1,"down_votes":2,"body":"die cahnce ein 4 vs 5 zu gewinnen liegt bei 17 % aber naja wenn man das schaft gehört man nicht dort hinein wo man ist oder die gegner xD \nund naja richtig in s 5 wenn ich letzte seson gold 4 war naja wenn du meinst ^^ \nwoher soll LOL wissen wo ich hin gehöre wenn nur auf die win rate und nicht meine Leistung geachtet wird und ich zb bin in 5 tagen von b 5 zu s 5 \nmit einer win rate von 85% beim tryharden naja und in silber 5 hab ich meinen spaß und traharde nicht sondern spiel mehr als locker insofern wenn ich mich anstrenge komm ich wieder Gold ^^ nur so etwas verlänget den prozezz AFK Leute in sofern das man mit 5 leuten eine 50% chance hat und die chance bei 4 naja 3 mal kleiner ist währe für eine 3 fach kleinere chance doch das doppelte angebracht ! ? also 32 .\nSolltest du wieder Antworten bitte ich dich zu argumentieren und nicht zu schreiben Wenn man das mal mathematisch sieht das hab ich hier gerade und um Bei 20 games mit afk s hoch zu kommen oder nicht runter müsste man um dies mit der standart win rate auszugleichen das 3 fache bekommen das doppelte währe nur ein schritt in die richtige richtung ich sage auch nicht das 40 richtig sind aber diese Lp rate bei einem afk höher zu stellen währe sicherlich nicht falsch (wobei man darauf achten müsste das dies nicht ausgenutzt wird)","replies":[{"poster":"Megamaexx","date":"2016-07-20T13:12:49.514+0000","up_votes":3,"down_votes":0,"body":"Deine Rechnung geht davon aus, dass man ein 4v5 zu 17% gewinnt. Ich vermute mal, der Wert basiert nicht auf Mathematik, sondern auf Praxisauswertungen. Aber belassen wir das einfach dabei.\n\nDeine Winrate ist echt von 85% auf 52% innerhalb von Silber 5 gedroppt? Oo das klingt sehr seltsam.\n\nJetzt aber mal angenommen, man würde Punkte mehr nach Teamleistung verteilen. Das hätte zur Folge, dass wenn man ein 5v4 gewinnt, man nur (nach deiner Rechnung) 1/3 der Punkte verdient hätte. Da die Chancen auf einen AFK im Team theoretisch ausgeglichen, bzw in deinem Team geringer sind (du gehst ja schließlich nicht AFK), müsstest du auf lange Sicht weniger Punkte bekommen als nach dem jetzigen System. Klingt unfair, obwohl es doch schon Sinn macht xD\n\nDann kommen wir aber schon zum Knackpunkt: Ausnutzen. Das steigert den Flame potentiell, denn es werden sich vermehrt Spieler gegen den Feeder des Teams stellen und ihn auffordern, AFK zu gehen, damit man selbst weniger Punkte verliert. Da die Community eh schon einen schlechten Ruf hat und Riot das weiß, scheitert es an diesem Punkt","replies":[{"poster":"2use4pro","date":"2016-07-20T13:30:32.528+0000","up_votes":1,"down_votes":0,"body":"lies dir meine antwort zu Klemens an hatte die selbe frege und das man darauf achten muss das dies nicht ausgenutzt wird hab ich geschrieben man kann gucken wie lang jemand afk war !","replies":[{"poster":"Megamaexx","date":"2016-07-20T13:35:36.273+0000","up_votes":1,"down_votes":0,"body":"Das schließt Ausnutzung nicht aus und auch nicht den Versuch, Spieler aus dem Spiel zu vergraulen","replies":[{"poster":"2use4pro","date":"2016-07-20T13:52:31.393+0000","up_votes":1,"down_votes":0,"body":"wiebitte was ich hab anfangs geschrieben dass man auf die Ausnutzung achten muss !!!!!!!!","replies":[{"poster":"Megamaexx","date":"2016-07-20T13:56:42.701+0000","up_votes":1,"down_votes":0,"body":"Ja aber es gibt keinen mir bekannten Weg, Ausnutzung nicht möglich zu machen. (So wie bei remake, was man echt nicht ausnutzen kann)","replies":[{"poster":"2use4pro","date":"2016-07-20T14:23:43.584+0000","up_votes":1,"down_votes":1,"body":"ok sorry das system soll ein helfen wer das ausnutzt ist selber schult !!! aber wie findist du die ide ???????? dies bei afk s zu verbessern ??? das ist meine frage wie man das regelt will ich nicht wissen!","replies":[{"poster":"Megamaexx","date":"2016-07-20T14:53:14.307+0000","up_votes":1,"down_votes":0,"body":"Tut mir leid, aber bei Ideen denke ich eben auch immer daran, ob man es gut umsetzen könnte, ohne dass irgendwer benachteiligt wird oder welche Folgen dies hätte.\nLetztendlich bricht dadurch das Gleichgewicht der Elo und ich mag Gleichgewicht.","replies":[{"poster":"2use4pro","date":"2016-07-20T16:39:38.306+0000","up_votes":1,"down_votes":1,"body":"OK ich habe jetzt einen einfach zu verstehenden STRG+C Text formuliert!\nda ich zu viele Nachfragen zu diesen Thema bekommen habe habe ich etwas gelernt : bei komplizierten dingen ist es nie so einfach wie es aussieht .\nich möchte mit diesem beitrag in League of legends etwas bewirken , dass es hier so viele Fragen giebt und sooo viel zu diskutieren werde ich nun versuchen einen Text zu vormulieren der haupt sächlich logischer Natur ist.\n\nZiel: egal ob du glück hast oder Pech mit AFK ´s im Game du sollst eine 50% chance IMMER haben LP zu bekommen oder zu verlieren .Diese chance soll natürlich durch (skill)erhöt werden oder durch gutes spielen.\nEs geht dabei nicht darum alle faktoren wie Feeder ,trolls ,usw. aus der Gewinnchance heraus zu nehmen.\n\nIdee: ich habe nach langen diskutieren mit euch in diesem forum etwas heraus gefunden : ich muss alles strukturiert        auflisten also zeig ich euch Den Weg den ich gefunden habe um das ziel punkt genau zu treffen!!!!\n\nVorschlag: ich habe hierzu eine Formel ausgedacht( rechnerisch gefunden) die ich erkläre!\n\n\nFORMEL:     Gewinnchance (mit 5 spielern in beiden teams) / Gewinnchance (mit der Anzahl an Spielern im team\n                                                                                                                                                beim gewinnen / verlieren )\n                                                                                                            X Die LP!!\n\nBeispiel:       Vorraus (in lol ist die gewinchance aller spieler durchschnittlich 50% zusammengerechent)\n                      Zum Test haben wir mit 4 spielern im team eine 25% gewinnchance und mit 4 im Gegner team eine 75%                                            chance\n                       außerdem kriegen wir 20 lp fürs gewinnen und verlieren !!\n\n                            ( man kann glück haben und pech mit afk´s wir überprüfen beides)\n\n                          Pech zb.   12 games afk´s(im team) und 0 games afk´s(im gegner Team)\n                         \n                         wenn wir durchschnitlich spielen nicht schlecht nicht gut !   gewinnen wir von den 12 bei 25% \n\n\n\n                         3 Spiele in 3 spielen kriegen wir nach der formel   50% / 25% = 2       2 x 20 Lp 40 Lp pro spiel \n                         3 x 40 =  120Lp\n                         durch die verlorenden verliern wir  nach der Formel    50% / 75%    = 0,66 periode * 20LP = 13,3periode\n                        9 x 13,3 = 120 LP \n                                                                \n                        so ich habe hehört es ist unmölich versucht es selber mit anderen Zahlen !!!!!! \n                        wir verlieren  und gewinnen genau so viel egal wie oft einer afk geht                                                                                  \n                           .Wenn wir gut spielen gewinnen wir lp und wenn wir   schlecht spieln  verlieren wir welche !!!!  es ist egal ob afk oder nicht !!! \n\nFazip: mit dieser Formel kann man das glück wie viele afk´s im gegner teams oder im eigenen team sind beseitigen und die lp verteilung dach skill fortsetzen auch wenn es afk s giebt \n\n um diese Umzusetzen : müsste man die wirkliche win rate mit der anzahl von 4 bz w 3 spielern heraus finden und ein setzen die hier genommenden werte 25% und 75% sind schätzwerte !!!\n\nDANKEEE!!! an euch für die diskosionen und eure Meinungen zu dem Thema \n    ps: wenn man es verstanden hat ist es nicht schwer ^^","replies":[]}]}]}]}]}]}]}]},{"poster":"SorisDynasty","date":"2016-07-20T13:28:39.084+0000","up_votes":2,"down_votes":0,"body":"Woher League das wissen soll? Anhand deiner MMR. Diese ist die wahre Elo, mit der du auch in Spielen gematched wirst. Deine LP-Vergabe hängt von deiner Liga abhängig zur MMR ab. Wenn du mehr Punkte gewinnst als du verlierst, ist deine MMR höher als deine momentane Liga - das System pushed dich nach oben. Sind Punktegewinn und -verlust ausgeglichen, bist du auf der Liga, die deiner MMR angemessen ist. Und wenn du mehr Punkte verlierst als du gewinnst - dann ist deine MMR niedriger und das System möchte dich nach unten platzieren.\n16 LP sind allgemein schon an der Grenze zu wenig, sollte gerade noch so für die momentane Division hinhauen. \n\nMomentan, bis du es beweist, gehörst du also nicht höher. Wenn du höher gehörst - sieg und steig auf.","replies":[{"poster":"2use4pro","date":"2016-07-20T13:46:34.353+0000","up_votes":1,"down_votes":0,"body":"darum get es mir nicht es geht nicht um meine ELOOOOOO auf unendlich games währen afks ausgeglichen bei den gegner und bei mir die chance das es jedoch ausgeglichen ist bei wenigen spielen oder sogar bei 1000 gams liegt bei 10 % dies würde mit dem system beim ersten spiel mit einem afk Auf min 75% steigen und konstant bleiben !!!!!!!!!! ein anreiz weiter zu spielen und bei afks immer noch lust zu haben danke ! es geht nicht um meine elo SONDERN UM das LP bei afk system danke ! es ist auf algemeine Bezogen soll es jedenfals nicht nur auf mich sonst würde mein beitrag heißen falsch in meiner Elo wegen afks !","replies":[{"poster":"SorisDynasty","date":"2016-07-20T13:50:25.172+0000","up_votes":2,"down_votes":0,"body":"Ganz ehrlich, ich mein es nicht böse, aber: Bitte, **bitte** gib dir etwas Mühe, wenn du deine Texte schreibst. LSR hin oder her - Mühe geben, den Text leserlich zu gestalten kann man trotzdem. Es gibt mehr als genug Menschen mit LSR, die das auch hinbekommen. Einen Text 5x lesen zu müssen, bis man ihn versteht, nur aufgrund von massenhaft Fehlern... nicht schön.\n...Und ich versteh immer noch nicht ganz, was du überhaupt aussagen möchtest.","replies":[{"poster":"2use4pro","date":"2016-07-20T14:07:43.552+0000","up_votes":1,"down_votes":2,"body":"Ok sorry ich finde es gut, dass du so antwortest ! viele hier antworten schlecht und nicht gut argumentiert ... so erkläre ich dir gerne ,was ich meine(oder aussagen möchte). \nEs geht darum dass wenn ich zb. 120 Spiele spiele  die wahrscheinlcihkeit 3 mal in mein Team und 3 mal im Gegner Team ein afk zu haben gering ist ! die Wahrscheinlichkeit ist sehr hoch das ich durch Zufall mehr oder weniger LP bekomme(mehr oder wenger afk´s in mein team als im Gegner team, oder anders herum zu haben).mit dem System das man wenn man ein 4 vs 5 gewinnt die 2 fache LP  und beim verlieren die hälfte der lp bekommt bewirkt man dass  : \n1. dass es nicht dem zu fall überlassen ist wie viel Lp ich dank afk´s bekomme oder verliere\n2.ich auch bei Afk´s lust habe zu spielen da ich viel gewinnen könnte \n3. und das auch wenn ich pech habe und 100 man ein afk hatte und die gegner nicht eine chance habe aufzusteigen , oder nicht abzusteigen (bestenfalz von 50%) ... \n\nschließlich sollte die LP vom skill oder besser dem können ein spiel zu gewinnen entschieden werden und nicht von Glück\nDanke ich habe jetliche fragen die bei dieser Erklärung aufkommen könnten schon anderen beantwortet schau doch dort bitte erst vorbei befor du eine Frage stellst Danke!","replies":[]}]}]}]}]}]},{"poster":"CYPHΕR","date":"2016-07-20T11:11:46.155+0000","up_votes":1,"down_votes":0,"body":"\"Wie entsteht eine LP-Inflation. Kapitel 1: Grundlagen...\"","replies":[{"poster":"HyperionCH","date":"2016-07-20T13:08:49.707+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CypherHD,realm=EUW,application-id=YnZkMR0R,discussion-id=EpqEt5FL,comment-id=0002,timestamp=2016-07-20T11:11:46.155+0000)\n>\n> &quot;Wie entsteht eine LP-Inflation. Kapitel 1: Grundlagen...&quot;\n\nMittel- und langfristig gibt es keine LP-Inflation.\nDenn man verliert/gewinnt ja dann immer noch gleich viel (Hidden) Elo. Die LP, die man gem. Vorschlag nun weniger verliert bzw. mehr gewinnt, bekommt man dann in den folgenden Rankeds nicht.\n\nKurz gesagt: es gibt ein paar Games später gar keinen Effekt.\n\nWarum also etwas ändern, was nach z.B. 10 weiteren Games gar keinen Effekt bringt?","replies":[{"poster":"2use4pro","date":"2016-07-20T13:36:12.961+0000","up_votes":1,"down_votes":2,"body":"lies dir meine andtwort zu Klemens durch ihr habt alle die gleichen argumente es liegt bei 10 % das dies ausgeglichen ist und währe erst ausgeglichen bei unendlich games so geht die ausgeglichen heit ab dem esten spiel los !!!!","replies":[{"poster":"HyperionCH","date":"2016-07-20T14:01:42.932+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=2use4pro,realm=EUW,application-id=YnZkMR0R,discussion-id=EpqEt5FL,comment-id=000200000000,timestamp=2016-07-20T13:36:12.961+0000)\n>\n> lies dir meine andtwort zu Klemens durch ihr habt alle die gleichen argumente es liegt bei 10 % das dies ausgeglichen ist und währe erst ausgeglichen bei unendlich games so geht die ausgeglichen heit ab dem esten spiel los !!!!\n\nNein, mein Argument war ein anderes, sorry!\n\nEs geht nicht um die Häufigkeit/Wahrscheinlichkeit/dem Glücksfaktor, sondern um die Berechnungsfunktion der LP-Vergabe.\n\nSo lange sich nichts an der Elo (aka Hidden MMR) verändert, wird sich mittelfristig mit \"LP-Geschenken\" rein gar nichts ändern.\n\nKurzes Beispiel:\n\nWenn du jetzt z.B. Gold 3 bist mit 50 LP und nun einer deiner Mates afk ist und dann 19 weitere Games wieder 5vs5 spielst.\nNehmen wir an, du wärst (mit dem alten, jetzigen System) dann Gold 3 mit 70 LP.\nMit deinem Vorschlag wärst du nach diesen 20 Games höchstwahrscheinlich bei: Gold 3 mit 70 LP\n\nDein Voschläg ändert einfach gar nichts.","replies":[{"poster":"2use4pro","date":"2016-07-20T14:21:26.285+0000","up_votes":1,"down_votes":2,"body":"doch ES nimmt das wahrscheinlich weg \nstellen wir uns vor du hast ein 6 er im lotto und 10000 afk´s nach einander in deinem team bringt dir das system trotz dem eine 50% wahrscheinlichkeit LP zu gewinnen /zu verlieren ohne dieses system hast du jaaa mit den lp eher eine geringe chance bei solch einer pech srene es Verändert das Wahrscheinlich zu : \ndu gewinnst wenn du besser bist als deine ELO LP lies dir fragen der anderen durch un meine Antworten ! befor du etwas fragst ich werde dir nicht mehr antworten ich hoffe giermit ist die klar geworden das dies das glück oder pech dener elo genommen werden soll \nund dass egeal wie viel pech du mit afk s hast es auf dein play stil ankommen würde!!!","replies":[{"poster":"Sirrkas","date":"2016-07-20T18:22:27.460+0000","up_votes":2,"down_votes":0,"body":"Es ändert sich vielleicht ganz kurzfristig etwas. \n\nWenn du bei einem 4vs5 gewinnst und 30 statt 20 LP kriegst, bestünde nur dann ein nennenswerter Unterschied, wenn die Bonus-LP zu einer Promo führen. Solange die MMR aber nicht dadurch beeinflusst wird, erhält man in den nächsten 5 Spielen zum Beispiel 2 LP Abzug (um die +10 wegen dem Leaver auszugleichen), wodurch man nach den insgesamt 6 Spielen keinen Unterschied zu 6 Spielen ohne Systemänderung hat.","replies":[{"poster":"HyperionCH","date":"2016-07-21T08:15:38.043+0000","up_votes":1,"down_votes":0,"body":"Korrekt erklärt. :)\n\nWobei selbst das \"Promo-Szenario\" (also dass man dank den Bonus-LP in eine Promo kommt) sehe ich nicht als nennenswert.\nMittelfristig steigt ein Spieler auch ohne diesen Bonus-LP auf, sollte man den nötigen Skill haben.","replies":[]}]}]}]}]}]}]},{"poster":"Thoky","date":"2016-07-20T13:34:23.510+0000","up_votes":2,"down_votes":0,"body":"ok 2 punkte:\n\n1. Deine Grammatik ist unter aller sau und du solltest im Deutschunterricht besser aufpassen.\nWenn es dafür zu spät ist tuts mir leid für dich.\n\n2. Das Problem welches sich bei einem solche System auftun würde ist, dass haufenweise Leute es abusen würden, indem sie mit nem Smurf duo quen, einer afk geht und sich dann die anderen 4 vom Smurf carryn lassen.\nDas Remake System ist aktuell schon gut so wies ist und sollte in den meisten fällen auch afk games vorbeugen.","replies":[{"poster":"2use4pro","date":"2016-07-20T13:51:12.494+0000","up_votes":1,"down_votes":6,"body":"ALLTTEERRRR wo ist mal einer der Kein grammar NAZIE ist sondern was von mathe und logik versteht und lies dier mein text duch \n1. LRS \n2. spät abens im bett geschrieben \n3.ich habe erwähnt das man probleme wie das ausnutzen beacheten müssteeeee da ich mitlerweile weiss was du antwortest lies dir doch bitte die fragen der anderen durch da wird deine dabei sein zwar nicht Gamatikalisch korekt beantwortet aber LOGISCH und mathematisch ! \nach ja Du solltest mein text durch lesen befor du antwortest\n4. pass im Mathe untericht besser auf !!!","replies":[{"poster":"Thoky","date":"2016-07-20T14:02:40.708+0000","up_votes":1,"down_votes":0,"body":"Ich bin kein grammar Nazie, aber alter irgendwo is schicht im Schacht. \nDas ist kein Deutsch mehr da oben und zum Thema Logik hast nen extra post von mir bekommen du Mathe Genie :)","replies":[]},{"poster":"Thoky","date":"2016-07-20T14:00:04.455+0000","up_votes":1,"down_votes":0,"body":"krieg ich kein Kommi auf mein 2tes Kommentar ? :)","replies":[{"poster":"2use4pro","date":"2016-07-20T14:26:48.252+0000","up_votes":1,"down_votes":2,"body":"jaja ich bin seit 1 h dabei den leuten das zu erkähren hab glaub ich geantwortet sehr nett von dir  ! sorry für grammar nazi ! xD \nes ist alles sehr anstrengend jeder fragt das gleiche ich habe mehr als 10 Minuten überlegt ob das system sinvoll ist . Wenn noch einer nach 1 min nachdenken eine antwort schreibt dann.... kp ich geh weg  antowrte weiter wenn ich wieder da bin xD","replies":[]}]}]}]}]}