{"poster":"ZZard","date":"2016-02-07T21:48:12.518+0000","title":"Was kann ich gegen Trolle, Feeder etc. tun ?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":7,"body":"Hallo Community,\n\nIch spiele jetzt seit ca. 2 Jahren LoL und habe immer mehr das Gef&uuml;hl das Spieler die  Trollen und/oder mit absicht die Gegner feeden immer h&auml;ufiger werden, Jetzt frage ich mich : Was kann ich gegen diese Spieler tun ? gegen diese Feeder und Trolle ich meine es  muss doch auch noch andere M&ouml;glichkeiten geben als nur mit Reports um sich zu werfen weil st&auml;ndig einer feedet oder trollt.\nMeine Freunde auch immer mehr so werden vor allem mit dieser neuen Dynamic Q wenn man seinen bevorzugten Pick am Anfang preisgibt bannen sie ihn aber ich w&uuml;rde das ganze ohne gro&szlig;es Geschrei und Geflame l&ouml;sen was kann ich dagegen tun? Wenn ich gar nix Einlocke leaven sie und behaupten ich w&auml;re ein Noob...\nD\n\nMeine Frage im Grunde ist einfach was kann ICH SELBST gegen feeder, trolle, flamer etc. machen au&szlig;er nicht selbst damit anfangen und hier und da mal ein wenig in der Lane helfen ?{{champion:32}} {{item:3070}}","replies":[{"poster":"HyperionCH","date":"2016-02-08T10:17:04.133+0000","up_votes":3,"down_votes":0,"body":"Gegen Flamer:\nIgronieren (allenfalls muten) und nach dem Spiel stillschweigend reporten (es braucht keine Report-Aufrufe).\n\nGegen Trolle:\nHabe ich sehr, sehr selten. Hier solltest du \"Trolling\" auch definieren, was du darunter verstehst.\nEs ist kein Trolling, wenn dir jemand deinen Wunsch-Champ banned. Wenn dein Mate ihn als OP ansieht (was wohl auch ein Grund ist, warum du ihn picken möchtest), aber befrüchtet, der Champ könnte beim Gegner landen, dann ist sein ban berechtigt. Sehr gut möglich, dass er den Champ auch gebannt hätte, wenn du ihn nicht als Wunsch-Champ gepickt hättest.\n\nGegen Feeding:\nHier ist nur absichtliches Feeden verboten und diese reportet man stillschweigend nach dem Game.\nJedoch bezweifle ich, dass du wirklich oft absichtliche Feeder im Team hast. Zumal du in den letzten 3 Rankeds jeweils jener Spieler warst, der am häufigsten gestorben bist und auch sonst eine recht hohe Death-Zahl im Schnitt (letzte 20 Rankeds: 9.5 Deaths pro Game). Da solltest du ehrlich gesagt eher vorsichtig sein, wenn du deinen Mates \"feeding\" vorwirfst.\n\n\nBezüglich \"dominiere oft meine Lane\":\nIch habe kurz deine letzten 5 Rankeds geschaut, wo du nicht Jgl oder Sup gespielt hast (die zählen natürlich nicht bezüglich \"outfarmen\"). \nDu hast 3x die Lane verloren (einmal sehr klar), 1x war es ein Unentschieden (etwa gleich viel Gold in der Laning-Phase) und 1x hast du die Lane klar gewonnen (wobei der Gegner doch sehr schwach war mit 59 CS -> du warst mit 104 CS nach 23 Min. auch nicht gut).\n\nEs scheint so, dass deine Selbsteinschätzung nicht die beste ist. Denn \"ich dominiere oft die Lane\" finde ich nicht wirklich. Selbst bei deinem letzten Ranked, wo du dominert hast, hattest du am wenigsten Farm (exkl. Jgl und Sup) und dein Lane-Gegner war einfach sehr schwach.\n\nDu solltest deshalb etwas selbstkritischer sein, wenn du dich verbessern möchtest.","replies":[]},{"poster":"Revelate","date":"2016-02-07T21:57:21.541+0000","up_votes":3,"down_votes":0,"body":"btw. in den letzten 50 deiner Spiele hattest du 3-4 mal gute stats und 3-4 mal ok stats ansonsten immer hart am sterben.","replies":[{"poster":"ZZard","date":"2016-02-10T20:25:20.931+0000","up_votes":1,"down_votes":0,"body":"Überaus hilfreich was meine Frage angeht... -.-","replies":[]}]},{"poster":"FriendlyShaco","date":"2016-02-08T11:50:31.493+0000","up_votes":1,"down_votes":0,"body":"Ich verstehe wie sich das schlecht anfühl und kenne das auch (weiter oben gibt es immer noch flames und trolls und zwar mehr als genug) \n\nWas ich an dir nicht verstehe ist dein Spielverhalten\n\nErstens, wenn du aufsteigen willst dann nimm dir eine mainposition und spiele nur die und lege dir einen main champ an UND DEN SPILST DU DANN es bringt nichts einen counterpick zu suchen wenn du den nicht spielen kannst\n\nZweitens, wenn einer dich flamed MUTEN sag einfach nichts, dann wird es ihm zu doof und hört auf\n\nDrittens, wenn du wirklich glaubst du gehörst in eine höhere Liga dann spiele so, gewinne deine Lane zu 80% und sei nach der laningphase nützlich, du solltest nie einfach nur nach min 15 nur noch in die midlane rennen und jeden angreifen den du siehst\n\nViertens, wenn du deine lane verlierst spiele deffensiv, FEEDE NICHT als ich in silber war, war es immer so jemand steht 0/10 oder 10/0 es gab nie einen der halt einfach seine lane mit 0/2 hält\n\nDu wrst sehen es bringt was dies zu befolgen und dann werden deine flamer auch bald weniger","replies":[{"poster":"ZZard","date":"2016-02-10T20:33:51.023+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Antwort,\nIch denke ich verstehe was du sagen willst vor allem über das mit dem \"such keinen Counter Pick den du nicht spielen kannst\" darüber hab ich echt noch nie so nachgedacht und ich werde jetzt einfach mal Fiora Top suchten bis mir die Stimme und das Splash Art dieses Champions zu den Ohren raushängt mal sehen was sich in dieser Zeit so tut.\nJetzt hab ich nochmal eine Frage an dich bezüglich des \"troll\" bannen von Freunden wenn du deinen Bevorzugten Pick zeigst was würdest du dagegen machen? außer natürlich nichts zu picken weil sonst ist man ja automatisch ein Noob und sie leaven! Das macht mich Wahnsinnig (@_@)\n\nWas meinst du eigentlich genau mit : \"was ich nicht verstehe ist dein Spielverhalten\"?\n\nMFG","replies":[{"poster":"FriendlyShaco","date":"2016-02-11T09:19:54.904+0000","up_votes":1,"down_votes":0,"body":"Das ding mit den Trollbans hatte ich nur einmal und da war es ausversehen, ich denke das ist wohl eher in silber bronze weil man schnell vorurteile über einen champ hat\n\nWie du gesagt hast nichts picken oder einfach etwas anderes vlt maokai dann ist jeder beruhigt und dann kannst du  einfach zu fiora wechseln\n\nMit Spielverhalten meinte ich deine picks (habe etwas dein lolking profil angeguckt:) ) und du hattest keinen richtigen Main oder Style wie tanky top oder so, es ist einfach so wenn du was mainst wirst du besser= gewinnst mehr\n\nFiora OP viel spass mit ihr wirst du sicher haben und viel Glück\n\nLG Troublemaker11","replies":[{"poster":"ZZard","date":"2016-02-11T10:09:29.694+0000","up_votes":1,"down_votes":0,"body":"Ah OK nun  dann werde ich wie gesagt jetzt einfach nur Fiora spielen.\nWas machst du wenn dein Team jetzt sagt ich will Shaco Jungle, Soraka Support, Vayne Adc und Yasou Mid Spielen ich meine man sollte sich dann doch ein wenig dem Team anpassen und einen Tank oder AP Top laner spielen können, oder ?","replies":[{"poster":"FriendlyShaco","date":"2016-02-11T11:23:43.311+0000","up_votes":2,"down_votes":0,"body":"Ja klar, du mainst eine Lane und kannst da einige champs spielen und halt einen oder zwei unglaublich gut was dann auch dein Blind-Pick wäre (picken vor dem gegnerischen toplaner)\n\nDas anpassen solltest du natürlich auch beherrschen kommt auch ganz von alleine\n\nDieses Team würde ich feiern, finde es persönlich hammer. Ich würde sofort malph picken op mit yasuo hat ap dmg und braucht fast keinen Skill :) .\n\nDas ist auch zu raten, du hast dann eben in deinem fall fiora als main, nun hat der gegner vlt eine vi jgl und einen rammus top dann wäre fiora top ja fast nutzlos und dann ist es eben gut andere toplaner auch zu können (es hilft wenn du dann einfach auf NOSKILL champs zurückgreifst wie malphite maokai swain galio tahm halt solche die nützlich sind auch wenn man keine ahnung von denen hätte)\n\nLG Troublemaker11","replies":[]}]}]}]}]},{"poster":"Natascha ","date":"2016-02-07T22:40:16.557+0000","up_votes":1,"down_votes":0,"body":"such dirn festes team","replies":[{"poster":"ZZard","date":"2016-02-11T10:11:10.246+0000","up_votes":1,"down_votes":0,"body":"Lies meinen Kommentar bitte nochmal ganz genau ich hab geschrieben dass auch meine Freunde immer mehr so werden.","replies":[]}]},{"poster":"SurpRyze Idiot","date":"2016-02-09T09:36:56.412+0000","up_votes":1,"down_votes":0,"body":">Was macht ihr wenn ihr in einer LoL Partie richtig wütend seid ?\n Nichts du bleibst Ruhig \n\nWütend und ruhig sind zwei verschiedene Zustände.Deine Umfrage vorraussetzt,dass man bereits wütend ist.Dann ist es schlicht nicht möglich,wieder ruhig zu **bleiben**.\n\nAber da du fragst,was man gegen Trolls und Feeder machen kann:\n\n1.Nichts.Lebe mit denen.Wenn sie bereits feeden oder trollen,kannst du dich nur um die Symptome kümmern,welche gefeedete Gegner sind.Und wie kümmert man sich darum?\nIndem man gud gitted.Ganz einfach.Benutz /mute all und carry das Game.Ganz einfach.Oder nicht.Liegt dran ob du selbst snowballest oder feedest.Solange du snowballest und deinem Team Gold einbringst,carriest du.Wenn du reinfeedest,hast du schlechte Karten.","replies":[{"poster":"ZZard","date":"2016-02-10T20:26:44.343+0000","up_votes":1,"down_votes":0,"body":"Jaa ich geb zu das ist echt schlecht formuliert{{sticker:slayer-jinx-unamused}}","replies":[]}]},{"poster":"NiP Thanatos","date":"2016-02-08T16:48:23.800+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Shacoláde","date":"2016-02-08T10:11:44.577+0000","up_votes":1,"down_votes":0,"body":"Ganze einfach... nichts!!! \nWenn Sie selber wissen das sie feeded, hilft es auch nichts ihnen zu sagen das sie feeden --> Hilft also nichts\nWenn Sie es nicht wissen, denken sie andere der Realität vorbei --> Wird also genauso wenig helfen es ihnen zu sagen.\nDie \"Flamer/Feeder/Trolle\" werden sich nicht ändern. Jmd in 30min ingame ändern zu wollen, meinst das das Früchte trägt?\nWürd mich mal ne Statistik interessiern wieviel wirklich erkannt haben, nachdem sie draufhingewiesen worden sind, dass sie damit wirklich aufhören .\nMeist wird es eher noch schlimmer und du fängst dann auch noch an zu Flamen.\nDu bist das einzige was du ändern kannst. Stell dich auf die Gegebenheiten ein. Wenn du es nicht kannst, spiel im Team.\nWenn das auch nicht hilft, spiel an anderes Game. \nEin Spiel ist da um Spass zu haben. Sich täglich drüber aufzuregen ist es nicht wert. Das alles nur wegen einem vergebenen Sieg bzw. einen fiktiven Rahmen am Ende der Saison? Ist das dir es wirklich wert?\nIch geb jedes Game mein bestens wenn das fürs Team nicht reicht, dann ist es so. Ich steigere mich da schon lang nicht mehr rein.\nNeue Game neues Glück.","replies":[]},{"poster":"dugg","date":"2016-02-08T09:42:28.315+0000","up_votes":1,"down_votes":0,"body":"> Ich schreibe das jetzt auch weil meine Freunde auch immer mehr so werden vor allem mit dieser neuen Dynamic Q wenn man seinen bevorzugten Pick am Anfang preisgibt bannen sie ihn aber ich würde das ganze ohne großes Geschrei und Geflame lösen was kann ich dagegen tun?\n\nIch finde es auch ziemlich bad mannered, wenn jemand seinen favorisierten Champion vorgibt und dieser vom eigenen Team  verbannt wird. Dennoch ist dann nichts dagegen zu machen. Warum sollte ich dann anfangen zu schimpfen, trollen oder sonst etwas? Ich kann die Championauswahl verlassen, bekomme dann meine \"Strafe\" oder ich akzeptiere es, dass ich einen anderen Champion spielen muss. Ich würde lediglich das darauf hinweisen, dass das Spiel nun etwas schwächer von deiner Seite aus wird, weil du nicht dein Main bekommen hast.\n\nSolltest du nicht der betroffene Spieler sein, dann können die anderen doch laut werden wie sie wollen. Du und dein Team muss sich mit der Entscheidung arrangieren. \n\n> Meine Frage im Grunde ist einfach was kann ICH SELBST gegen feeder, trolle, flamer etc. machen außer nicht selbst damit anfangen und hier und da mal ein wenig in der Lane helfen ? \n\nDu kannst nichts gegen diese Leute in diesem Moment tun. Bleib einfach ruhig, spiel das Spiel zu Ende. Dann reportest du die Streithähne, machst einen Haken dran und spielst weiter.","replies":[]}]}