{"poster":"R0vina","date":"2018-08-02T15:21:09.651+0000","title":"League of Legends: il gioco più insensato di sempre.","subforum":"Campioni e gameplay","up_votes":2,"down_votes":11,"body":"Finalmente dopo tanto tempo ho deciso di disinstallare questo gioco. ce l&#039;ho fatta. \r\nParto subito dicendo che secondo me i moba hanno rovinato il gaming. questo genere di giochi prevede una collaborazione da parte di tutto il team. il gioco di squadra &egrave; la parte fondamentale del gioco. Ma allora perch&egrave; esistono le ranked in solo? per permettere di giocare tutti e quando vogliono. \r\nquesto &egrave; il primo e completo controsenso. perch&egrave; come diamine &egrave; possibile giocare di squadra con uno sconosciuto? soprattutto nella societ&agrave; di oggi in cui siamo messi tutti uno contro l&#039;altro? infatti la community dei moba e in realt&agrave; soprattutto di questo gioco fa completamente schifo. \r\nperch&egrave; &egrave; molto difficile incontrare un team che collabori tranquillamente se non in leghe alte.\r\nora parliamo del sistema delle ranked di lol. \r\ntutti sanno che lascia a desiderare.\r\nma pochi esaminano tutti i fattori che lo rendono completamente senza senso.\r\nrecentemente molti miei amici hanno iniziato a giocare. \r\ndopo le 10 ranked di piazzamento sono stati messi in silver come accadde anche a me quando iniziai a giocare.\r\ncredo che non sia una cosa razionalmente normale e oltretutto non serve un genio per risolvere un problema cosi grande.\r\nevidentemente questo accade per un motivo.\r\nin una partita da come ho notato ci sono infinite variabili che ti possono portare alla vittoria e alla sconfitta.\r\nsi parte dalla scelta del campione. per avere un team perfetto si dovrebbero scegliere dei campioni che workano nel miglior modo tra di loro con le giuste rune, maestrie e incantesimi basate sul tuo stile di gioco. ovviamente questo sappiamo bene che non accade. rune e maestrie sono un copia e incolla da internet per comodit&agrave; la maggior parte delle volte come anche io spesso faccio quando voglio giocare un champ nuovo e la maggior parte della gente non considera l&#039;importanza della composizione del team. \r\nla gestione dei punti non ha completamente senso. ho perso delle partite in cui ho fatto di tutto. parlo di segnalare le cose alla squadra, killare e focussare bene, evitare di flammare e incoraggiare i compagni e ho vinto partite in cui ho fatto lo schifo pi&ugrave; assoluto. ed &egrave; capitato spesso. anzi capita sempre. \r\nperch&egrave; league of legends &egrave; un gioco confuso che non ha skill fino a leghe molto alte. &egrave; tutto un fattore di fortuna nient&#039;altro. anzi. mi correggo se sei bravo sali ed &egrave; vero. sono uscito dalla bronzo V anche in poco tempo perci&ograve; si &egrave; cos&igrave;. ma quanto tempo devi spendere per salire? fin troppo. \r\n&egrave; un gioco che ti toglie la vita e infatti su questo gioco domina chi non la ha. \r\nse sei fortunato sali anche velocemente e se sei sfortunato? gente che dalla silver 1 riscende in bronzo e poi risale in silver perch&egrave; non si scoraggia. \r\nragazzi questo &egrave; un fottuto gioco e dovrebbe essere divertente non frustrante.  dopo che impieghi un mese per salire magari riscendi per sfortuna?\r\nma di che cosa stiamo parlando? \r\nbasta osservare i colori, le cose che introducono e quelle che non risolvono per capire che &egrave; un gioco basato sulla dipendenza come un droga,\r\ne infatti fa uscire il peggio di se alle persone.\r\n\r\ndetto questo aspetto i vostri commenti da dipendenti come lo ero io.","replies":[{"poster":"Aurelion Shmoll","date":"2018-08-02T15:27:39.238+0000","up_votes":7,"down_votes":4,"body":"tl:dr\n\nQuesto gioco è brutto perché non sono in grado di imparare e dopo 4 anni sono allo stesso livello di un novizio. Se sali o sei estremamente fortunato o non hai una vita sociale.\n\nPrego","replies":[{"poster":"Maximise","date":"2018-08-02T15:40:30.818+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Maggiormenta,realm=EUW,application-id=cAOZwaUi,discussion-id=NEJ00nBL,comment-id=0000,timestamp=2018-08-02T15:27:39.238+0000)\n>\n> tl:dr\n> \n> Questo gioco è brutto perché non sono in grado di imparare e dopo 4 anni sono allo stesso livello di un novizio. Se sali o sei estremamente fortunato o non hai una vita sociale.\n> \n> Prego\n\nDa quando non avere una vita sociale è un'offesa scusa?","replies":[]}]},{"poster":"Cutiebird","date":"2018-08-04T04:42:37.081+0000","up_votes":2,"down_votes":1,"body":"Dunque, posto che hai scritto un'accozzaglia di cose poco chiare, considerato che il più delle volte ti sei contraddetto da solo ( es. \" puoi salire solo tramite botte di culo. Ah no scherzavo, io ho fatto il gold in poco tempo \" ), personalmente credo che se permetti ad un gioco di influenzare così tanto la tua vita, arrivando addirittura a paragonarlo ad una dipendenza, hai fatto più che bene a disinstallare. Ti consiglio di staccare la spina per un po' e ristabilire le tue priorità, magari ritorna quando sarai più chilled.","replies":[]},{"poster":"Giorgio di villa","date":"2018-08-02T15:54:26.540+0000","up_votes":2,"down_votes":1,"body":"> Parto subito dicendo che secondo me i moba hanno rovinato il gaming.\n\n**COFF** Battle royale **COFF**\n\n> detto questo aspetto i vostri commenti da dipendenti _come lo ero io_.\n\nhttps://lh3.googleusercontent.com/-seYHh91XfmM/VTQ8vI4qccI/AAAAAAAADJI/smmy-Os8rJU/w500-h205-n/t.jpg","replies":[]},{"poster":"Darkinknight","date":"2018-08-05T14:27:25.441+0000","up_votes":1,"down_votes":0,"body":"In linea generale bene o male tutto quello che hai detto è vero,eccetto per una cosa. Se sei forte sali e ci metti pure poco. Un diamond che inizia uno smurf ritornera a circa diamond in si e no 80-100 game (probabilmente 40 per arrivare gia a platino).\n- i top player (intendo top player non diamond) sono gente che ci spende la vita? Chiaro,come qualsiasi altro gioco (online e non). Non vedo il problema,piu spendi tempo in una cosa piu potrai farla meglio.\n- le ranked intese come soloQ non hanno senso perche hai a che fare con un team? Eeee quindi? È una condizione obbligatoria a qualsiasi gioco dove joini e da solo e ti trovi con team vs team. Piuttosto posso trovare stupido il fattp di permettere il rankare con champ mai utilizzati.\n- hai vinto partite dove hai fatto schifo ecc ecc..premettendo che (specialmente a low elo) praticamente quasi la totalità dei game è vincibile, la ovvia risposta è una. Quando credi di aver fatto bene potevi fare meglio,e quando hai fatto male un tuo compagno (o piu) hanno fatto abbastanza bene per trascinare anche te. Ci si vede ininfluenti quando si è raggiunto lo skill cap.\n- scendi di molte division,non è per la sfortuna. Capita quando giochi da tiltato o ci sono cambi radicali al meta/nerf al champ op che abusavi.\n- team comp. Qui concordo quasi completamente. Lol ha lasciato cosi tanta liberta e poca diversificazione fra i punti di forza/debolezza dei champ da non rendere necessario la creazione di specifiche team comp (il classico warrior,ranged,mago,healer,assasin cosi per fare un esempio)\n- frustrante? Indubbiamente\n- il gioco crea una sorta di dipendenza? Ovvio,a come qualsiasi altro gioco che sopravvive per piu di 2 mesi. A differenza di altri qui pero non ci perdi nulla a fare un fermo di mesi (se non la perdita personale di skill)","replies":[]},{"poster":"astragor","date":"2018-08-03T17:50:10.094+0000","up_votes":1,"down_votes":0,"body":"Non ti piace il gioco?\nSemplice non giocarci \nNon puoi cambiare il gioco? Ti lamenti? \nNon giocarci\nCiao","replies":[]},{"poster":"ITP MENNY","date":"2018-08-02T22:55:03.372+0000","up_votes":1,"down_votes":0,"body":"C'è da dire che la maggior parte dei problemi da te evidenziati era già noti da tutti, come qualsiasi gioco free to play lo si può provare e scartare se non ti piace, io, personalmente, ci gioco dal 2015, ho avuto i miei alti e bassi ma cmq non abbandonerei mai il gioco, non mi ritengo senza vita sociale,anzi,credo che Lol sia un capolavoro, un gioco che dal 2009 domina qualsiasi classifica di giochi: dai free to play ai normali game.Vero che per molti è una droga ma è anche vero che basta un po' di autocontrollo per regolarsi. Fai la tua scelta e seguila, sarai come la massa e andrai a giocare a fortnite perché è la moda, come lo fu owerwatch ai tempi.\n Buona notte","replies":[]},{"poster":"MisogiKumagawa","date":"2018-08-02T20:14:30.631+0000","up_votes":1,"down_votes":0,"body":"\"Ci vuole tanto a salire\" ho letteralmente fatto il gold in questa season(mia prima season in cui ranko anche se gioco da 2 season) giocando forse 3 game ranked al mese e 40 game in totale,facendo da s5 a g5 così,se per te 40 game sono tanti c'è qualcosa che non quadra","replies":[]},{"poster":"Honey Queen","date":"2018-08-14T12:27:45.263+0000","up_votes":1,"down_votes":1,"body":"Io non sono così drastico, però due giorni fa ero arrivato a silver 1 rankando per circa un mese, il gold era alle porte. Poi così insipegabilmente mi capitano 3 game con pik troll e afk, che mi fanno riscendere in silver 2, e da qui una lose strike di altre 6 partite. sono silver 2 con 2 lp adesso e sinceramente siccome ho una vita e devo studiare per l'università non ho più il tempo per ritentare la scalata... è davvero frustrante però perchè mi mancava davvero poco... sembra tutto fatto a posta per non farti salire al benedetto gold {{sticker:sg-soraka}}","replies":[]}]}