{"poster":"Kumaito","date":"2016-08-08T23:41:19.019+0000","title":"Poppy","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Ich wollte euch mal fragen was ihr 1. Von der neuen  {{champion:78}}  haltet und ob es sich lohnen w&uuml;rde  Poppy zu mainen? 2. Was w&auml;ren ihre St&auml;rken? Und Schwächen natürlich (Kenn mich Poppy nicht so aus bzw. mit der neuen Poppy nicht so aus also sry wenn ich frage :D).","replies":[{"poster":"Tecnica","date":"2016-08-09T00:23:51.218+0000","up_votes":2,"down_votes":0,"body":"Poppy hat es im moment ein wenig schwer. Ihr fehlt etweder der konstante Schaden, oder die tankiness um sich von anderen Helden hervorzuheben. \nDie wahrscheinlich beste Möglichkeit für sie ist momentan auf einen Sunfire zu gehen, was sie an und für sich gar nicht mag, weil sie im early-midgame gerne cdr hätte um konsistent zu sein.\nIhr laning kann sehr agressiv sein und ist nach wie vor ziemlich snowbally. Der einzige unterschied ist, ist dass sie nicht mehr unbedingt von items scaled sondern von LvLs. Auch das ist irgendwo ein Problem, da im SoloQ teleport immer schwächer wird und eine große stärke von Poppy das roamen ist.\n\nZu der Frage ob man sie Mainen kann - Ja klar. Sie bietet echt vielfalt wie, hartes roampotential und gute gank recovery. Mmn ist sie ein guter Lehrer darin Toplane nicht mehr als Insel wahrzunehmen und den Gegnerischen Jungle ordentlich unter Druck zu setzen. \nIhre W ist gigantisch um deinen ADC zu peelen, falls der mal eine große Rolle spielen sollte.\nAllgemein ist Poppy ziemlich gut darin zu peelen und unaufmerksame Gegner dingfest zu machen.\n\nIch empfehle gerade wenn du sie lernst auf das laning zu pfeifen und ein kurzes Farmfest daraus zu machen und deine Runen mit cdr und movementspeed zu füllen. Auch würde ich idr auf 6/6/18 gehen und nicht 12/0/18 um noch mehr movementspeed mitzunehmen. Das alles hat eben den Grund das Poppy keine Werte, sondern LvL brauch.\n\nEdit: Nicht direkt objektiv aber, ich finde wenn es dir um Spaß und Liga geht, ist Poppy sehr Nett, da sie wenig gespielt wird und alles was wenig gespielt wird, ist von gut geführter Hand op ~ Season release Trundle otp","replies":[]},{"poster":"Glaums","date":"2016-08-12T10:18:34.894+0000","up_votes":1,"down_votes":0,"body":"Ich spiele sie sehr gerne im Dschungel. Mit der Ulti und dem E hast du zwei Stuns. Gerade im Early sichert mir das E so ganz gerne mal den FirstBlood.","replies":[]},{"poster":"TerrorRaven","date":"2016-08-09T07:02:33.468+0000","up_votes":1,"down_votes":0,"body":"Die neue Poppy ist nicht schlecht (wenn auch nicht mehr so geistesgestört wie die Alte).\nIhre Stärke ist, dass sie Tank Items dank ihrer W-Passive viel besser verwertet als andere Champs.\nLeider ist sie sehr Item-Abhängig.","replies":[]},{"poster":"Uranbrennstab","date":"2016-08-09T06:53:23.541+0000","up_votes":1,"down_votes":0,"body":"Ist neben Olaf einer der besten Irelia counter zur Zeit.","replies":[]}]}