{"poster":"Koobox","date":"2018-10-10T19:36:43.480+0000","title":"Toxic Community","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":5,"body":"Hallo League of Legends Community,\r\n\r\nIch habe League of Legends lange gespielt und auch viele Menschen gesehen die sich im Chat auch nicht benommen haben.\r\nWenn ich mir anschaue wie viele Leute ihr Unwesen treiben trollen und wer wei&szlig; was noch so. \r\nDann will ich gern wissen, warum solche Leute nicht sofort gebannt werden?\r\nAls ich damals auch sehr oft geraged habe im Chat und das sogar sehr lange und wann kam mein Ban?\r\nGenau erst in einem Jahr, da habe ich mich ernsthaft gefragt warum das nicht fr&uuml;her kam. \r\nViele von euch kennen das bestimmt auch, das wenn man mit Freunden ganz normal spielen will einfach aus Spa&szlig;,\r\nDann kommt eine Witzfigur und denkt sich das es das komplette Match trollt und einfach nur beleidigt.\r\nDas ist nicht der Grund warum ich League of Legends installiert habe. \r\nIch bitte Riot Games &amp; die Community sich zusammen schlie&szlig;t und vielleicht auch mal sich Spieler holt,\r\ndie Freiwillig als Chat Moderatoren agieren werden.\r\nDamit k&ouml;nnen sie die Matches anschauen und dann die Strafe entscheiden, und somit haben die Riot Mitarbeiter weniger Arbeit.\r\nDurch die Community k&ouml;nnen wir eine nette Gemeinschaft haben und helfen das keine anderen Spieler sind Spa&szlig; von anderen Leuten vermissen.\r\nAlso nochmal als Bitte nimmt diesen Vorschlag an.\r\n\r\nMit freundlichen gr&uuml;&szlig;en, Koobox","replies":[{"poster":"Vogeljunges","date":"2018-10-11T06:55:09.087+0000","up_votes":2,"down_votes":0,"body":"Natürlich werden die toxic Spieler sofort ihr Verhalten einsehen und brav werden, wenn sie nicht länger durch einen automatischen Chatfilter überführt werden, sondern durch menschliche Beobachter... am besten kann man diesen \"Schiedsrichter\" dann auch noch direkt anschreiben...\n\nhmm.. je länger ich darüber nachdenke, desto absurder finde ich diese Vorstellung, sorry. \n\nDeine gute Absicht in allen Ehren, aber das würde mitnichten zu einer Verbesserung führen und zu einer LoL-Welt, in der alle sich glücklich einen wundervollen Tag wünschen - dem alleine widerspricht schon dass man entweder gewinnt oder verliert und nicht gemeinsam in der Kluft Minions streichelt.","replies":[{"poster":"Sirrkas","date":"2018-10-11T10:05:27.480+0000","up_votes":2,"down_votes":0,"body":">oder verliert und nicht gemeinsam in der Kluft Minions streichelt.\n\nSummoners Rift Streichelzoo\n\nKlingt nach einem brauchbaren Modus. Wer mehr Poros und Wölfe füttert, gewinnt.","replies":[{"poster":"Qbert","date":"2018-10-11T10:07:05.843+0000","up_votes":2,"down_votes":0,"body":"ich stelle mich als Poro gerne zum füttern bereit \n\nhttps://pbs.twimg.com/profile_images/907289673289969665/mUa1DrlT_400x400.jpg","replies":[]}]}]},{"poster":"OT Riku","date":"2018-10-10T20:45:55.213+0000","up_votes":2,"down_votes":0,"body":"Das gab's schonmal nannte sich Tribunal war zu langsam.\nDas jetzige System ist nicht perfekt aber effizienter als das Tribunal.","replies":[]},{"poster":"Kanra Kumiho","date":"2018-10-10T21:24:06.511+0000","up_votes":3,"down_votes":1,"body":">Dann will ich gern wissen, warum solche Leute nicht sofort gebannt werden?\n\nWeil du nicht für einen einzigen Fehler gebannt werden möchtest.\n\nEine andere Sache ist, dass das Reporten von Gegnern und Mitspielern oft nicht richtig, oder gar nicht erfolgt.\n\nViele sind sich nicht bewusst, wie man die Auswahl nutzt und was nun wirklich reportbar ist. Dafür kann man aber nicht die Leute blamen. Das Umfeld spielt hier auch eine große Rolle. Wenn sich Freunde und Familie mit einer ungepflegten Wortwahl verständigen, kann es auch dazu kommen, dass Beleidigungen nicht nur untereinander als \"normal\" und \"unernst\" gesehen werden, sondern auch in der Öffentlichkeit.\n\n>die Freiwillig als Chat Moderatoren agieren werden.\n\nDas wird wie das alte Tribunal viel zu schnell missbraucht werden.\n\nAußerdem haben wir bereits freundliche Freiwillige, die sich deinen Chatlog gerne ansehen und dir die Stellen rausfiltern, welche ein Problem sein könnten. Damit bekommst du eine Unterstützung, um dein Verhalten bessern zu können ;0","replies":[]}]}