{"poster":"RabGeIsebnu","date":"2018-06-16T11:43:19.172+0000","title":"Chat Restriction, Wieso?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":7,"body":"Hallo zusammen,\nWieder einmal will Riot mir meinen Account wegnehmen und unterstellt mir ein Chatverhalten, das &quot;far below the standards&quot; ist. Wir alle wissen was League of Legends Standard/Alltag ist.Ich verhalte mich deutlich besser und spreche die Beleidigungen, die tats&auml;chlich LoL Standard sind, niemals aus. Dennoch wurde ich chat restricted. bitte zeigt mir die genaue stelle, wo ich z.b. Toxisch war.\nMir ist wichtig zu begreifen, was ich falsch gemacht habe. Wenn ich nicht wei&szlig; was ich falsch mache, kann ich mich nicht verbessern. In ALL meinen Spielen verhalte ich mich weiterhin so wie in diesem Chatverlauf, weil ich absolut kein toxisches Verhalten sehe. Bitte erkl&auml;rt es mir.\nDie Screenshots reiche ich jettzt nach, das dauert aber warscheinlich 20 Minuten, da es insgesamt ca. 20 Bilder sein werden, weil im Lol Client selbst auf h&ouml;chster Aufl&ouml;sung nur 7 Textzeilen gezeigt werden.Bis dahin k&ouml;nnt ihr davon ausgehen, das der Chatlog komplett ist und wahrheitsgem&auml;&szlig; und bereits kommentieren!\n\nVielen Dank\n\nEdit 1:\nIch habe mir die Freihiet genommen und den chat ausgeschnitten (bis auf das erste bild) und zusammenzuschieben, sonst wären das ins 40 bilder. https://ibb.co/dgeaXy\nhttps://ibb.co/coASed\nhttps://ibb.co/ekSUsy\n\n\n\nGame 1\nPre-Game\n1v9GodCarryBeast: dodge or carry\nIn-Game\n1v9GodCarryBeast: ez show penguin\n1v9GodCarryBeast: again\n1v9GodCarryBeast: yeee\n1v9GodCarryBeast: camille: 1 Kayn: 0 ganks\n1v9GodCarryBeast: itso k vel happened to me 5 times already ( on my team i mean=)9\n1v9GodCarryBeast: so i got used toit\n1v9GodCarryBeast: to losing games etdc\n1v9GodCarryBeast: i still report tho bro its allowed\n1v9GodCarryBeast: camille top 4rth time\n1v9GodCarryBeast: i dont know how i can win this 1v3\n1v9GodCarryBeast: shes 2 lvlss ahead\n1v9GodCarryBeast: thats all\n1v9GodCarryBeast: i want to have fun too\n1v9GodCarryBeast: i waited the entire 11 min\n1v9GodCarryBeast: 0 gnaks\n1v9GodCarryBeast: now its my time to have fun\n1v9GodCarryBeast: cool wave is pushing to me now\n1v9GodCarryBeast: xD\n1v9GodCarryBeast: do oyu mean i should give up and int? not my style bro\n1v9GodCarryBeast: ?\n1v9GodCarryBeast: i just got 3 manned and then 4 times ganked by u\n1v9GodCarryBeast: what do you mean bro :)\n1v9GodCarryBeast: After ur gank\n1v9GodCarryBeast: sure\n1v9GodCarryBeast: the 1v2 :)\n1v9GodCarryBeast: gotcvha\n1v9GodCarryBeast: ?\n1v9GodCarryBeast: the only reason i didnt run back was i didnt give asist to u\n1v9GodCarryBeast: ?\n1v9GodCarryBeast: what do you want acamille?\n1v9GodCarryBeast: stop harrasing me or i have to report u\n1v9GodCarryBeast: and hes still going\n1v9GodCarryBeast: incredible\n1v9GodCarryBeast: can we all report camille plz?\n1v9GodCarryBeast: hoily\n1v9GodCarryBeast: leave me alone\n1v9GodCarryBeast: wow so toxic this camile report her plz\n1v9GodCarryBeast: camille muted and reported\n1v9GodCarryBeast: no u mad cuase u died?\n1v9GodCarryBeast: wahts that piungign?\n1v9GodCarryBeast: stop spam pinging\n1v9GodCarryBeast: good.\n1v9GodCarryBeast: ofc im in the position to chat\n1v9GodCarryBeast: everyone is\n1v9GodCarryBeast: its a human right\n1v9GodCarryBeast: what kind of regime are you trying to create?\n1v9GodCarryBeast: i split bot now\n1v9GodCarryBeast: 2 towers to get\n1v9GodCarryBeast: botlane ur top now\n1v9GodCarryBeast: ?\n1v9GodCarryBeast: geegee\n1v9GodCarryBeast: sry camille cant read ur tilt i muted u\n1v9GodCarryBeast: damn i missed it- maybe i sshouldnt mute u\n1v9GodCarryBeast: ?\n1v9GodCarryBeast: i 1v9 this shitt\n1v9GodCarryBeast: the carry hjas awaken\n1v9GodCarryBeast: has*\n1v9GodCarryBeast: open ur eyes dude\n1v9GodCarryBeast: farem lvl 18\n1v9GodCarryBeast: and we win\n1v9GodCarryBeast: im focused\n1v9GodCarryBeast: gg\nPost-Game\n1v9GodCarryBeast: more dmg than poppy\n1v9GodCarryBeast: gg\nGame 2\nPre-Game\n1v9GodCarryBeast: is thsi tryout q?\n1v9GodCarryBeast: casue ima tryout new stuff then too\n1v9GodCarryBeast: fur fun q\n1v9GodCarryBeast: elo aint matter\n1v9GodCarryBeast: tell me\n1v9GodCarryBeast: dodge or carry\nIn-Game\n1v9GodCarryBeast: another troll botlane\n1v9GodCarryBeast: epiuc\n1v9GodCarryBeast: i jsut keep losing losing elo due to troll botlnaes\n1v9GodCarryBeast: why do they stack up on my team laways&szlig;\n1v9GodCarryBeast: LAWAYS\n1v9GodCarryBeast: fuk it\n1v9GodCarryBeast: why did u ping me shaco\n1v9GodCarryBeast: stop tilting me\n1v9GodCarryBeast: im romaing now\n1v9GodCarryBeast: lets go\n1v9GodCarryBeast: this meta\n1v9GodCarryBeast: its all babout crushing early\n1v9GodCarryBeast: lets go\n1v9GodCarryBeast: omw bot\n1v9GodCarryBeast: summs bot?\n1v9GodCarryBeast: shield?\n1v9GodCarryBeast: as u want lulu\n1v9GodCarryBeast: enjoy  it\n1v9GodCarryBeast: as u want\n1v9GodCarryBeast: omw mid\n1v9GodCarryBeast: omw bot\n1v9GodCarryBeast: gan k\n1v9GodCarryBeast: stop in\n1v9GodCarryBeast: sry im bad\n1v9GodCarryBeast: at least i gave my best\n1v9GodCarryBeast: hi vlad\n1v9GodCarryBeast: hows it going?\n1v9GodCarryBeast: enjoyng it?\n1v9GodCarryBeast: good luck everyone\n1v9GodCarryBeast: hmm i think attacking u makes no sense\n1v9GodCarryBeast: u jsut healed my entire combo\n1v9GodCarryBeast: report orianna insult thank u\n1v9GodCarryBeast: all im saying is thats why im standing supersave behind tower incase vald is wondering\n1v9GodCarryBeast: cause he will only hit towers not me\n1v9GodCarryBeast: at all\n1v9GodCarryBeast: dont know if its fun\n1v9GodCarryBeast: why do u ping me?\n1v9GodCarryBeast: if i def i die\n1v9GodCarryBeast: i dont int\n1v9GodCarryBeast: i dont troll\n1v9GodCarryBeast: now i have to be even more save\n1v9GodCarryBeast: cuase no flash\n1v9GodCarryBeast: why r eport im jsut having a bad game\n1v9GodCarryBeast: but why?\n1v9GodCarryBeast: they want to report me cause i dont fdef tower/ inhib\n1v9GodCarryBeast: iu would die if i do\n1v9GodCarryBeast: right vald?=\n1v9GodCarryBeast: why?\n1v9GodCarryBeast: im not soft inting\n1v9GodCarryBeast: mnaybe it was the wrong choiuce to roam after i lsot lane\n1v9GodCarryBeast: cuase\n1v9GodCarryBeast: ?\n1v9GodCarryBeast: now was that inting by vald?\n1v9GodCarryBeast: dojnt worry vlad i wont report u\n1v9GodCarryBeast: cuase u didsnt int just liek i didnt int/ soft int\n1v9GodCarryBeast: Gg\n1v9GodCarryBeast: thx\nPost-Game\n1v9GodCarryBeast: wait a sec\n1v9GodCarryBeast: botlane goes 0/12\n1v9GodCarryBeast: im 4/5\n1v9GodCarryBeast: and i int?\n1v9GodCarryBeast: well report botlane too then at least if u report me thank u\n1v9GodCarryBeast: let riot decide\n1v9GodCarryBeast: &lt;3 thank u all\nGame 3\nIn-Game\n1v9GodCarryBeast: u got executed?\n1v9GodCarryBeast: i had gragas solo\n1v9GodCarryBeast: u fuked my lane kha\n1v9GodCarryBeast: leave ME ALONE\n1v9GodCarryBeast: i had him solo\n1v9GodCarryBeast: u stole the gkill\n1v9GodCarryBeast: now carry !\n1v9GodCarryBeast: no ult\n1v9GodCarryBeast: i said DO NOT COME TOP\n1v9GodCarryBeast: report kha insult\n1v9GodCarryBeast: kha muted and reported\n1v9GodCarryBeast: report braum insult\n1v9GodCarryBeast: braum muted and reported\n1v9GodCarryBeast: i remember u all who to report and why, i got the quotes listed\n1v9GodCarryBeast: i knew it he cant carry.\n1v9GodCarryBeast: look at kha top\n1v9GodCarryBeast: cfarmin mmy lane\n1v9GodCarryBeast: look\n1v9GodCarryBeast: im not inting, my main jax got banned thats all, im an otp\n1v9GodCarryBeast: im just bad on other champs\n1v9GodCarryBeast: gg wp all\n1v9GodCarryBeast: btw i had to mute klha and braum cause the were constantly harassing me, its ok tho\n1v9GodCarryBeast: nah im fine win some lose some\n1v9GodCarryBeast: i cant escapoe\n1v9GodCarryBeast: gg wp\nPost-Game\n1v9GodCarryBeast: so, khazix insulted me with &quot;2 digit iq&quot; and braum insulted with....let me think\n1v9GodCarryBeast: what was it again\n1v9GodCarryBeast: uhm\n1v9GodCarryBeast: i dont eremember the exact word\n1v9GodCarryBeast: but im 100% he insulted me\n1v9GodCarryBeast: gg wp efverywone\n1v9GodCarryBeast: what was it kah said again\n1v9GodCarryBeast: there are so many one tricks in challenger\n1v9GodCarryBeast: /high elo\n1v9GodCarryBeast: i feel like no sense in learning newe champs\n1v9GodCarryBeast: until i learn the game first\n1v9GodCarryBeast: i wish i was tilt free\n1v9GodCarryBeast: but im only human\n1v9GodCarryBeast: like u are\n1v9GodCarryBeast: look our team tilted and flamed me\n1v9GodCarryBeast: and i tilted after khas first gank\n1v9GodCarryBeast: i chipped away\n1v9GodCarryBeast: wave for wave\n1v9GodCarryBeast: on gragas healrth\n1v9GodCarryBeast: for liek 5 min\n1v9GodCarryBeast: then he was low like 200hp\n1v9GodCarryBeast: i coulkd solo gragas\n1v9GodCarryBeast: kha came in and jsut destroyed ita ll\n1v9GodCarryBeast: i couldnt focuis anymore, i tried to\n1v9GodCarryBeast: somehow it went downhill from there\n1v9GodCarryBeast: u2","replies":[{"poster":"RabGeIsebnu","date":"2018-06-16T12:21:16.033+0000","up_votes":6,"down_votes":0,"body":"Vielen dank Für eure Kommentare, ich wusste gar nicht, dass mein Verhalten schon reportbar/bannable ist. aber jetzt hab ichs gelernt. D.h. im Umkehrschluss  muss ich oft viele Mitglieder meines Teams schon viel früher reporten, als ich es dachte. Ich finds nämlich unfair, das ich bestraft werde für das verhalten oben, andere nicht. Jedes einzelne herausgearbeitete \"griefing\" oder \"ban request\" werde ich auch ahnden und reporten. \nIch hoffe das LoL so toxic free wird und ich mir nie wieder deren Verhalten angewöhne und durchwegs ein positiver Spieler bleibe.\nVielen dank!","replies":[{"poster":"Lotuskobra","date":"2018-06-16T18:08:28.989+0000","up_votes":2,"down_votes":0,"body":"Ich füg mal zusätzlich meinen Kommentar aus einem anderen Thread an, der das hier geschriebene unterstützt, auch wenn du es ja scheinbar schon verstanden hast. Es hilft ja leider nicht viel, sich nur über andere zu beschweren, sondern nur selbst mit gutem Beispiel voranzugehen.\n\nDie Chatrestriction ist ja nicht wirklich schlimm (bis Clash wird es eh noch ein paar Wochen dauern) und das wichtigste ist ja passiert: Du weißt, warum du die Stafe bekommen hast und kannst dich anders verhalten. Ich weiß, dass sich viele Spieler da draußen strafbar verhalten und oft keinen Dämpfer bekommen, da sie es nicht regelmäßig genug tun. Teilweise liegt es aber auch daran, dass nicht ausreichend genug reportet wird. Bleib im Spiel ruhig, mute die Leute (schreiben brauchst du das nicht extra) und versuch dich selber zu verbessern, schließlich geht es ja um deinen Spielspaß und deine Elo.\n\nhttps://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/w85dAAAm-chatbanns?comment=0003\n\nViel Erfolg und beste Grüße","replies":[{"poster":"RabGeIsebnu","date":"2018-06-17T16:34:10.102+0000","up_votes":2,"down_votes":1,"body":"Genau es wird zu wenig reportet. daher mute ich sofort jemanden bei der ersten negativität und instareport. gnadenlos.\nIch gebe zu, es ist auch aus Frust, da ich verglichen zu den leuten in meinen games sehr nett bin und meine mitspieler iene ganze ecke brutaler und härter chatten, beleidigungen eingeschlossen. wenn ich mich nicht per chat verteidigen darf dann per reportspam. spam daher, da in jedem game die hälfte der spieler reported wird, da ich jeden reportcall ebenso bestrafe, wie ich bestraft wurde.\n\nEdit: Ich möchte an dieser Stelle noch anmerken, das, falls gehäufte reports ihre wertigkeit verlieren, weil sie gespammt werden (ähnlich wie das honoren in der letzten Season) dann ergibt es schon allein dadurch durchaus sinn, reportcalls zu tätigen. Solange riot nicht komplett offen legt, wie das report system funktioniert, befürworte ich jeden reportcall bei unangebrachtem verhalten. \naußerdem sollte riot das reportsystem auch deshalb offen legen, damit ich ganz sicher begreifen kann, wo ich denn toxisch war. man kann nur vermuten ala: ja warschl alles zusammen viel geschrieben und immer nur leute runtergezogen- bullshit, algorhythmen funktienieren nicht so wie menschen, die sich den ganzen text angucken. es muss einige wenige stellen geben im chat, wo das reportsystem getriggert wurde und ich will mich ja nach dem summoners code verhalten. wieso markieren die nicht eben diese chat stellen im chatlog ROT damit ich mich verbessern kann? jetzt darf ich garnix mehr schreiben. ich finde, man sollte auch das reecht haben, im spiel zu diskutieren, wieso der und der play besser wäre. nein ist negative. darfst nicht. wirst gebannt.","replies":[{"poster":"Lotuskobra","date":"2018-06-17T17:27:06.298+0000","up_votes":5,"down_votes":0,"body":"Es gibt dazu eine ganze Menge Beiträge im Forum, die leider aufgrund der Suchfunktion (die nicht die beste ist – nett ausgedrückt), so gut wie nicht zu finden sind. Ich versuche mal, das wichtigste kurz und knapp zusammenzufassen –> als Quellen kann ich dir anschließend die Website der Volunteers anbieten, in der gesammelte und zusammengeschriebene Dokumente zu Aussagen und Veröffentlichungen von Riot beiliegen.\n\nZunächst mal so viel:\n\n1. Das Reportvalue, welches du meinst, gab es mal (Season 3-5 herum soweit ich richtig informiert bin), wurde aber abgeschafft, da das IFS dieses nicht benötigt. Damals wurden Spieler, die zu viele unberechtigte Reports getätigt haben, auf diese Art und Weise abgestraft, um das System nicht zu überlasten.\n\n2. Wenn du jemanden meldest, läuft es bisher so ab: Deine Meldung wird registriert und das IFS (Instant-Feedback-System) beurteilt anhand der ihm vorgegebenen Parameter, ob diese Meldung korrekt ist. Sollte dies der Fall sein, wird der entsprechende Spieler basierend auf seinen Vergehen (wieder eine Frage der Vorgaben und erlernten Dinge des Systems (es ist zum Teil selbstlernend)) bestraft. Sollte dein Report unberechtigt sein, wird diese Meldung lediglich gespeichert. Sammelt ein Spieler zu viele davon in kurzer Zeit an (vom System also als unberechtigte Reports eingestufte Meldungen), wird eine Überprüfung durch einen Riot-Support Mitarbeiter eingeleitet. Auf dich als reportenden Spieler hat dies jedoch keinerlei Einfluss. Zudem ist es damit egal, ob 1er, 5 oder 9 Spieler denjenigen melden, da das System nur einen Report braucht um eine Überprüfung auszulösen.\n\n3. Aufgrund von Punkt 2 ist Reportcalling einerseits nicht notwendig und wird, sofern man es penetrant im Chat anwendet auch als negatives Chatverhalten gewertet. Es hat schlicht keinen Mehrwert und zieht nur das eigene Team runter, da es ja offensichtliches Missfallen ausdrückt.\n\nDer Punkt der kompletten oder großflächigen Offenlegung ist im Forum schon oft heiß diskutiert worden, ich möchte dir hierzu schlicht meinen Meinung wiedergeben – kann aber deinen Standpunkt absolut nachvollziehen:\n\nZunächst mal sollten wir selber alle realisieren, dass das grundlegende Verhalten in League of Legends nichts mit irgend einem Summoners Code oder ähnlichem zu tun hat, sondern schlicht mit Anstand, Erziehung und Respekt. Das in der Hitze des Gefechtes diese Tugenden teilweise verloren gehen, beziehungsweise einige Mitspieler nicht über die nötige Erziehung/Reife verfügen um sich angemessen zu verhalten, ist uns allen auch klar. Riot verlangt aber im Grunde nicht viel von uns:\n\nMan stelle sich vor, man unterhält sich mit einem wildfremden Menschen oder (für einige ist dieser Vergleich noch passender) mit den eigenen Eltern. Wie in drei Teufelsnamen möchte man denn ernsthaft in den Spiegel gucken, wenn man mit Menschn im echten Leben so reden würde, wie es teilweise im League-Chat geschiet. Die Anonymität gibt vielen Kraft, Sicherheit und vor allem eines, ein riesiges, geschwollenes Internetgemächt.\n\nDie Grundregeln/Leitlinien, die im Summoners Code und den AGB auftauchen, sind doch nur die Zusammenfassung dieser Verhaltensregeln. Im BGB steht auch keine genaue Liste, welche Wörter als Schimpfwörter empfunden werden und welche nicht. Es werden Grundbegriffe wie Würde, Respekt und Nächstenliebe in nahezu allen Gesellschaften groß geschrieben und eigentlich sollte man keinen Kodex brauchen, der einem dies alles haarklein auflistet.\n\nBeleidige niemanden, bleib positiv und ziehe deine Teamkameraden nicht runter – wer das nicht versteht, hat nicht nur in League ein Problem, sondern muss/sollte ernsthaft an seiner Sozialkompentenz arbeiten.\n\nEs hat zudem einen weiteren Nachteil, alles zu veröffentlichen:\n\nSobald klar ist, welche Begriffe verboten sind, wissen alle leidenschaftlichen Flamer genau, was nicht bestrat wird. Wo ein System ist, ist auch immer jemand, der es sabotieren möchte oder es so zu nutzen weiß, dass er anderen damit eins in Boxhorn jagt. Unzählige Leute würden es ausnutzen, fröhlich beleidigen, ohne einen wirklichen Mehrgewinn für die Spielerschaft mit dieser Veröffentlichung zu generieren.\n\nWenn ich abschließend noch ein paar Punkte ansprechen darf, eigentlich hab ich schon wieder viel zu viel geschrieben:\n\nWo Riot wirklich etwas machen sollte, ist die Prävention von Flame, mit Hilfe von Ingame-Geschichten, Aufklärung und dem Tutorial. Spieler sollten gezwungen werden, sich die Regeln einerseits wirklich durchlesen zu müssen (oder das ganze spielerlich in einem Tutorial zu lernen) und andererseits durch regelmäßige Verhaltensprogramme im Client und auf der Website, eine permanente Auffrischung zu bekommen, was vorbildliches und gewolltes Verhalten in League bedeutet.\n\nZudem wird Riot auf kurz oder lang wieder ein System finden müssen, um Trolle, \"Disco-Nunu\"-Spieler und \"Ich flashe in den Gegnerturm und sterbe absichtlich\"-Spieler und dergleichen zu detektieren und mit ihnen hart ins Gericht zu gehen, da das IFS an diesem Punkt wirkliche Schwächen hat.\n\nQuelle: http://en.volu-eu.org/","replies":[{"poster":"Haudruppmoor","date":"2018-06-18T07:33:11.127+0000","up_votes":2,"down_votes":1,"body":"Richtig toll geschrieben , Respekt ! \n\n{{sticker:slayer-pantheon-thumbs}} \n\nDu hättest auch definitiv das Zeug zum Grünen ! Mir gefallen Deine Ausführungen. Die sind nachvollziehbar und man kann sich damit identifizieren .\n\nmfg\nMB","replies":[{"poster":"Lotuskobra","date":"2018-06-18T20:29:03.743+0000","up_votes":1,"down_votes":0,"body":"Ich hatte mal überlegt mich zu bewerben, allerdings habe ich mittlerweile so wenig Freizeit, dass das schlicht keinen Sinn machen würde, zudem machen unsere Volus doch nen super Job (auch wenn das nicht jeder so sehen möchte).","replies":[]}]}]}]}]}]},{"poster":"Izaya Kumiho","date":"2018-06-16T12:06:42.260+0000","up_votes":5,"down_votes":0,"body":">Dennoch wurde ich chat restricted. bitte zeigt mir die genaue stelle, wo ich z.b. Toxisch war.\n\nAs you wish.\n\n>1v9GodCarryBeast: ez show penguin\n\nEz wird als \"easy\" gesehen btw.\n\n>1v9GodCarryBeast: so i got used toit\n1v9GodCarryBeast: to losing games etdc\n1v9GodCarryBeast: i still report tho bro its allowed\n\ngriefing, reportcall (negative behaviour)\n\n>1v9GodCarryBeast: can we all report camille plz?\n\nreportcall (NB)\n\n>1v9GodCarryBeast: wow so toxic this camile report her plz\n1v9GodCarryBeast: camille muted and reported\n\nreportcall (nb)\n\n\n>1v9GodCarryBeast: sry camille cant read ur tilt i muted u\n1v9GodCarryBeast: damn i missed it- maybe i sshouldnt mute u\n\nNegative behaviour/unsportsmanlike\n\n>1v9GodCarryBeast: i jsut keep losing losing elo due to troll botlnaes\n\ngriefing,blaming\n\n>1v9GodCarryBeast: report orianna insult thank u\n\nreportcall (nb)\n\n>1v9GodCarryBeast: well report botlane too then at least if u report me thank u\n\nreportcall (nb)\n\n>1v9GodCarryBeast: u fuked my lane kha\n\nverbal blaming\n\n>1v9GodCarryBeast: report kha insult\n1v9GodCarryBeast: kha muted and reported\n\nreportcall again...\n\n>1v9GodCarryBeast: report braum insult\n1v9GodCarryBeast: braum muted and reported\n\nReportcall......\n\n>1v9GodCarryBeast: btw i had to mute klha and braum cause the were constantly harassing me, its ok tho\n\nblaming\n\n>1v9GodCarryBeast: look our team tilted and flamed me\n\nblaming....\n\n_______________________________________\n**Result**\n_**viel negatives Verhalten in Forum von Reportcalls, Blaming und allgemeines unsportliches Verhalten**_\n________________________________________\n\nAch und noch was:\n\n>1v9GodCarryBeast: ofc im in the position to chat\n1v9GodCarryBeast: everyone is\n1v9GodCarryBeast: its a human right\n>1v9GodCarryBeast: dodge or carry\n\nDas ist ja nur dein Team,welches unter deiner Einstellung leiden muss... <_< \n\nMöchtest du wirklich so mit den Leuten umgehen und genauso behandelt werden?","replies":[{"poster":"khamzat2000","date":"2018-06-16T15:13:45.613+0000","up_votes":1,"down_votes":4,"body":"***","replies":[{"poster":"Izaya Kumiho","date":"2018-06-16T16:29:45.670+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=khamzat2000,realm=EUW,application-id=KYnfKGf0,discussion-id=kOnpQ5Fr,comment-id=00040000,timestamp=2018-06-16T15:13:45.613+0000)\n>\n> Du hast viel negatives Verhalten in &quot;forum&quot; nicht in Form geschrieben... als grüner sollte man eigl die deutsche rs beherrschen\n\n..eh?","replies":[]},{"poster":"eingew","date":"2018-06-16T15:22:59.843+0000","up_votes":1,"down_votes":0,"body":"Erbsenzähler ;).","replies":[]}]}]},{"poster":"Veezey","date":"2018-06-16T15:23:42.357+0000","up_votes":4,"down_votes":0,"body":"Also ich finde du schreibst viel zu viel. Wenn dich jemand nervt, dann mute ihn einfach. Solltest du das nicht können ohne einen Kommentar dazulassen, dann versuche es freundlich zu tun.","replies":[]},{"poster":"Noxempire","date":"2018-06-16T12:02:36.466+0000","up_votes":4,"down_votes":0,"body":"Die Devise ist: Schreib was produktives fürs Team oder Moral, ansonsten nichts. \n\nAlles was nur dazu dient sich zu rechtfertigen oder das eigene Ego zu befriedigen, ist nutzlos und mehr oder weniger verboten.","replies":[{"poster":"RabGeIsebnu","date":"2018-06-16T12:46:19.179+0000","up_votes":2,"down_votes":0,"body":"Ok ich werde den Chat nur noch wie du es sagst benutzen (um meinen account zu behalten) Aber ich werde genauso negatives verhalten ahnden und nun deutlich mehr reporten. ehrlich gesagt ist es gut möglich, dass ich in jedem Spiel mehrere Leute reporten muss, wenn lol toxic free werden soll.","replies":[]}]},{"poster":"Zyzyx","date":"2018-06-16T11:50:51.275+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Hakkuu","date":"2018-06-16T11:57:34.292+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Zyzyx,realm=EUW,application-id=KYnfKGf0,discussion-id=kOnpQ5Fr,comment-id=0000,timestamp=2018-06-16T11:50:51.275+0000)\n>\n> Mensch, da erklärt man dir grade dass du aufhören sollst zu spammen, da postest du einfach eine exakte Kopie deines vorherigen Threads, völlig ohne Grund. Man könnte meinen du WILLST für Spam gebannt werden.\n> \n> Hier findest du deinen alten Thread: https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/K4qe2ZOb-chat-restriction-wieso\n\nDa muss ich ihn verteidigen. Es ist nicht der gleiche Thread, und der alte wurde wegen der angesprochenen rechtlichen Schritte deaktiviert, die jetzt hier nicht mehr drinnen sind.","replies":[{"poster":"Zyzyx","date":"2018-06-16T12:03:18.136+0000","up_votes":3,"down_votes":0,"body":"Jep, mein Fehler. Hab's direkt nach abschicken gemerkt und gleich wieder gelöscht. Aber wohl nicht schnell genug für euch ;)","replies":[{"poster":"Hakkuu","date":"2018-06-16T12:09:45.969+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zyzyx,realm=EUW,application-id=KYnfKGf0,discussion-id=kOnpQ5Fr,comment-id=000000000000,timestamp=2018-06-16T12:03:18.136+0000)\n>\n> Jep, mein Fehler. Hab&#x27;s direkt nach abschicken gemerkt und gleich wieder gelöscht. Aber wohl nicht schnell genug für euch ;)\n\nSorry, hat es nicht aktualisiert während dem Tippen :)","replies":[]}]}]},{"poster":"Alustus","date":"2018-06-16T11:57:37.545+0000","up_votes":2,"down_votes":0,"body":"Naja dieser wurde von den Moderatoren geschlossen, da er rechtliche Schritte angekündigt hat.\nWodurch er kein Feedback bekommen hat.","replies":[]}]},{"poster":"Alustus","date":"2018-06-16T11:52:14.702+0000","up_votes":3,"down_votes":0,"body":"Es ist nicht so dass du böse Wörter benutzt, aber dein Chatverlauf sieht zumindest für mich (und scheinbar auch für Riot) so aus als wolltest du nur bewirken, dass sich dein Team schlecht fühlt bzw. dass dieses keinen Spaß hat.\n\nDu regst dich kontinuierlich auf.\nDu redest deine Teammates schlecht.\nDu erwähnst gefühlt 100x das du Spieler x,y gemutet hast und probierst damit gefühlt den Spieler noch weiter zu reizen.\n\nJetzt nur mal als Vergleich wie meine Chatverläufe in etwa aussehen:\n\nhi\ngj\nits okay\npls stop talking and focus (wenn weiterhin geflamt wird mute)\ndo Drake?\ndo nash after tower?\ngo base and finish as 5?\ngj\ngg wp\n\nEgal ob da jetzt ein Idiot dabei ist oder nicht, dieser wird einfach gemutet oder ignoriert.\nWenn es scheiße läuft dann werden auch kleinigkeiten gelobt, aber nicht auf Teammates verbal eingebrügelt wie schlecht er doch ist und dass er doch von der Lane verschwinden soll.\nOder dass die Teammates für die Gegner spielen.\nUnd was für sinnloser negativer schwachsinn sonst noch von dir geschrieben wird, welcher niemanden hilft bzw. die Ganze Situation noch mehr eskalieren lässt.\n\n\nVerwende den Chat um das Spiel in eine positive Richtung zu bringen oder um Calls/Ideen einzubringen aber nicht als Stressabbau und um irgendwie dein Leben zu erleichtern wenn du einen oder mehrere Sündenböcke suchst.","replies":[]},{"poster":"Atsùra","date":"2018-06-16T19:48:07.142+0000","up_votes":2,"down_votes":0,"body":"Ich zitiere hier mal aus dem Film Bambi\n\n\"wenn man nichts nettes zu sagen hat, sollte man den Mund halten\"\n\nDu schreibst zu viel und eindeutig zu viel rc, blaming etc etc. Das zieht runter. Stell dir vor, du datest ein Mädel und neben dir sitzt einer, der dich permanent runter zieht.","replies":[{"poster":"RabGeIsebnu","date":"2018-06-17T16:17:36.079+0000","up_votes":2,"down_votes":1,"body":"Ich werde hier immer so dargestellt als wäre ich der Agressor. könntei ch euch den chatverlauf des gesamten spiels zeigen, würdet ihr sehen, dass ich bambi war. oder lässt sich bambi im film dauernd schlagen und darf nichts erwidern?\nman sieht immer wieder stellen wie:\nleave me alone\nstop spam pinging me\nxy muted and reported\nwell report botlane too then at least if u report me thank u\n\nist das etwa toxisch?","replies":[{"poster":"Atsùra","date":"2018-06-20T15:11:32.525+0000","up_votes":1,"down_votes":0,"body":"Bambi würde nie und nimmer eine Chatrestriction bekommen. Der würde still lächelnd weiter spielen, die Flamer und Blamer und Inter am Ende reporten und ohne schlechtes Gewissen das nächste Spiel starten. Am Ende kann es dir sowieso scheiß egal sein, was die anderen Ingame tun. Die siehst du nie wieder und dann brauchst du auch keine ewig langen Romane zu schreiben, wieso weshalb warum dir die anderen auf den Sack gehen.","replies":[]},{"poster":"Lotuskobra","date":"2018-06-18T07:21:45.400+0000","up_votes":1,"down_votes":0,"body":"> Ist das etwa toxisch?\n\nJa, es wird vom System genau so angesehen, da es einerseits einem bestimmten Zweck dienen soll und andererseits auf eine bestimmte Art und Weise programmiert ist:\n\n**Der Zweck**\n\nDas System soll die Spieler erkennen, die sich nicht an die vorgegebenen Regeln halten – und zwar alle. Dementsprechend sollen alle Spieler bestraft werden, die überhaupt potenziell negativen Chat aufweisen und somit vom System erkannt werden. Dabei spielt es auch keinen Rolle, ob der eine schlimmer als der andere ist, es geht doch darum das Verhalten eines jeden einzelnen zu verbessern. Spieler die sehr hart zulangen bekommen eine etwas härtere Strafe, Spieler, die wie du keine harten Kraftausdrücke oder Beleidigungen benutzen bekommen eine Chatrestricion – die mildeste Strafe (für den Anfang).\n\n**Die Art und Weise**\n\nDas System hat auf Basis des alten Tribunals Wörter, Wortfetzen, Sätze, Abkürzungen, Leetspeak und andere Chatelemente einprogrammiert bekommen, die als negativ gewertet werden. Zudem lernt es schrittweise dazu, wenn neue Begriffe im Chat erscheinen, die oft der Grund für Reports sind und nimmt diese mit in diese \"Blacklist\" auf. Tippt ein Spieler regelmäßig und oft, Elemente aus diesem Pool in den Chat, sammelt er berechtigte Reports an. Übersteigt diese Menge ein gewisses Maß (stell es dir wie ein Fass vor), wird eine Strafe verhängt, um dem Spieler zu zeigen: Hey so geht es nicht weiter, halte dich an die Regeln oder wir werden dich immer härter bestrafen, damit du lernst, dass dein Verhalten nicht in Ordnung ist –> bis zum Permabann, wenn nötig.\n\nDein Problem sind nicht deine Teammates, sondern du selbst, indem du sie nicht ignorierst und mutest, sondern fröhlich mitdiskutierst und versuchst deine Meinung klar zu stellen. Warum eigentlich? Wie viele Debatten wurden im LoL Chat denn schon von dir gewonnen? Der Chat ist für diese Art der Kommunikation schlicht nicht gedacht.\n\n> ...oder lässt sich bambi im film dauernd schlagen und darf nichts erwidern?\n\nBambi versucht nicht dem Jäger deutlich zu machen, was für ein böser Mensch er doch ist, dass er seine Mutter erschossen hat, geschweigedenn versucht es, ihn selber zu töten (gleiches mit gleichem). Zudem vergleichst du Äpfel mit Birnen:\n\n**In LoL ist dir doch ein perfektes Mittel zum Abstellen von Flame gegben:**\nDu kannst alle muten –> und dann kann dich niemand mehr belästigen.\n\n**Vergleichbar im echten Leben:**\nJemand versucht bei dir einzubrechen, du holst die Polizei und derjenige kommt hinter Gitter und kann mit dir so weder reden, noch weiter einbrechen (bis er wieder frei ist, er hat schließlich keinen Permabann).\n\nLerne dich mit den richtigen Mitteln zu verteidigen, mute die Spieler, die dir auf den Knispel gehen und hör mit deinem sinnlosen gechatte auf. Der Chat ist eigentlich nur ein weiteres Kommunikationstool um taktisch besser zusammenzuspielen, dass er von etlichen nicht als solches genutzt wird, ist schade, aber sei bitte nicht derjenige, der das auch tut. Das hier gehört in den Chat:\n\n\"glhf\", \"he freezes top\", \"top is divable\", \"I tp back\", \"bot summs?\", \"ggwp\" sowie alle Arten von Timern, Pings, und Goldbeträge für Items. Den Rest kannst du dir komplett sparen, wirst nicht bestraft, sondern deine flamenden Teammitglieder bekommen ihr Fett weg und du bist fein raus.\n\n–> Damit wirst du auf Dauer tiltfreier spielen, da du die ganze Grütze deiner Teammitglieder (sofern sie den Chat nicht sachgemäß benutzen) nicht lesen musst, dich auf's Spiel konzentrieren kannst (das kannst du mit deiner Schreibmenge schlichtweg nicht) und deinen Fokus so (auch in schlechten Spielen) vom Chat auf dich selbst legst.","replies":[]}]}]},{"poster":"Zyzyx","date":"2018-06-16T11:53:08.534+0000","up_votes":1,"down_votes":0,"body":"Blaming, Reportdrohungen, Reportaufforderungen.","replies":[]},{"poster":"khamzat2000","date":"2018-06-16T15:12:02.876+0000","up_votes":2,"down_votes":7,"body":"***","replies":[{"poster":"RabGeIsebnu","date":"2018-06-17T16:25:58.461+0000","up_votes":1,"down_votes":0,"body":"Weißt du, lass es mich am besten mit einem Beispiel erklären:\nDu schlägst keine Leute.davon bin ich überzeugt, du bist normal\nJetzt stell dir vor LoL ist MMA wo du in diesem Ring bist mit nem Gitter um dich herum. aber nicht 1v1 sondern 5v5\nund auf idch wird jetzt permanent eingeschlagen (flame, insult) wirst du dann sagen: hi teammate, i dont like this. please stop, thank u. oder glaubst du nicht, dass du irgendwann selbst zuschlägst? und so nach und nach entwickelst du dich zu einem SPieler, der auch zurückschreibt. der antwortet. der sich verteidigt. könnte ich dir den gesamten chatlog zeigen ( von jedem spieler) würdest du sehen, wer toxisch ist und wer ein Engel (ich).\n\nWürde nun riot sofort jeden bestrafen wäre ich ja happy und niemand würde sich mehr so verhalten. leider dauert es ewig, bis was passiert.daher gibt es immernoch flame und insults etc.\nich finde mein chatlog ist nicht normal für lol sondern supernett. 0beleidigungen.0 kys. 0 uninstall your bad oder sonstwas. \nnur reportaufrufe nachdem ich beleidigt.misshandelt wurde. und das darf ich nicht. ich reporte ab jezt jeden und alles, was negativ ist. und das ist leider in JEDEM spiel mindestens 4 Personen.\n\nich verstehe nicht wieso dein post auf -4 war. ich hab ihn direkt geupvotet auf -3. die mods haben hier viel zu viel gewalt/kontrolle.","replies":[]}]}]}