{"poster":"Kelfi","date":"2015-03-13T11:50:58.856+0000","title":"IEM Katowice","subforum":"Esports","up_votes":4,"down_votes":0,"body":"Heute startet die IEM in Katowice mit insgesamt 8 Teams:\n\n[Leaguepedia Übersicht](http://lol.gamepedia.com/League_of_Legends_Wiki)\n\nStreams:\n\n[englisch](http://www.twitch.tv/esl_lol)\n[deutsch](http://www.twitch.tv/esl_summonersinn)\n\nGruppe A:\n\n[Cloud9](http://lol.gamepedia.com/Cloud9)\n[GE Tigers](http://lol.gamepedia.com/GE_Tigers)\n[SK Gaming](http://lol.gamepedia.com/SK_Gaming)\n[yoe Flash Wolves](http://lol.gamepedia.com/Yoe_Flash_Wolves)\n\nGruppe B:\n\n[Gambit Gaming](http://lol.gamepedia.com/Gambit_Gaming)\n[CJ Entus](http://lol.gamepedia.com/CJ_Entus)\n[Team Solo Mid](http://lol.gamepedia.com/Team_SoloMid)\n[Team WE](http://lol.gamepedia.com/Team_WE)\n\n\nGespielt wird im Format \"Double Elimination Groupstage \", wobei die Top 2 in das Halbfinale einziehen.\n\nHalbfinale wird im Bo3 und Finale im Bo5 gespielt, alle anderen Begegnungen sind Bo1.\n\nSpielplan:\n\nFreitag 13.03.2015 Start 13 Uhr.\n\nGrp A:\n\n1. C9 - **GE**\n2. **SK **- FW\n3. **GE **- SK (Gewinner geht ins HF)\n4. C9 - **FW**\n\nGrp B:\n\n5. GG - **CJ**\n6. **TSM **- WE\n7. CJ - **TSM **(Gewinner geht ins HF)\n8. GG - **WE**\n\nSamstag 14.03.2015 Start 13 Uhr.\n\n9. SK - FW (Gewinner geht ins HF)\n10. CJ - WE (Gewinner geht ins HF)\nHF1. GE - Sieger 10\nHF2. TSM - Sieger 9\n\nSonntag 15.03.2015 Start 18 Uhr\n\nGrand Final.\n\nViel Spass bei den Spielen! :)\n","replies":[{"poster":"KingVegetaa","date":"2015-03-15T21:40:51.782+0000","up_votes":1,"down_votes":0,"body":"PS: War das nun wirklich die Weltmeisterschaft? Nein, oder?\nIch weiß doofe Frage und ich entschuldige mich dafür.","replies":[{"poster":"ü ö","date":"2015-03-15T21:42:57.285+0000","up_votes":2,"down_votes":0,"body":"Das waren die IEM Worlds. Die richtige S5 World Championship ist noch 'ne lange Weile hin. Sozusagen die \"Europa League\" von LoL.","replies":[{"poster":"KingVegetaa","date":"2015-03-15T23:09:44.720+0000","up_votes":1,"down_votes":0,"body":"Danke.\nDachte schon, he das kann doch nicht wirklich S5 World Championship sein...","replies":[]}]}]},{"poster":"Kaitri","date":"2015-03-15T20:45:41.531+0000","up_votes":2,"down_votes":0,"body":"tsm wird wohl ein 3/0 spielen. respekt tsm. \nschade das eu schon länger nichts mehr vorzuweisen hatte :/","replies":[{"poster":"KingVegetaa","date":"2015-03-15T21:38:19.253+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kaitri,realm=EUW,application-id=hGYdiTd1,discussion-id=nmQnGlZA,comment-id=0020,timestamp=2015-03-15T20:45:41.531+0000)\n>\n> tsm wird wohl ein 3/0 spielen. respekt tsm. \n> schade das eu schon länger nichts mehr vorzuweisen hatte :/\n\nich sage immer, ohne Bjergsen wäre TSM rein gar nix. Ist meine Meinung. Haben sich einen sehr talentierten Mid Laner gekauft aus EU der ihr Spiel sehr hard carried. Damals mit Reginald haben sie nix auf die Reihe bekommen. Bjergsen kam und TSM ist stärker und stärker geworden.\n\nIn rein NA gibt es keinen richtig guten Midlaner... Link - Hai von CLG und Cloud 9 wären hier zu erwähnen.\nUnd die verlieren \"sehr oft\" gegen Bjergsen in 1vs1.\n\nErgo, es ist keines NA Team.\n\nStellt euch vor, ich wäre ein Milliardär und kaufe mir alle perfekten Spieler aus der Welt.\nUnd mache ein Team in XYZ Server auf wo sie halt für mich spielen sollen.\nDann sind das nicht Spieler aus der Region sondern weltweit und daher für mich nicht NA EU Korea usw.\n\nJa ich weiß, die besten Spieler können anhand der Kommunikation total schlecht sein, aber es geht hier ums Prinzip.","replies":[{"poster":"Kaitri","date":"2015-03-15T21:59:56.662+0000","up_votes":1,"down_votes":0,"body":"ja schon nur spielt bjergsen jetzt halt für die na und damit sind sie ein gutes na team. auch wenn du voll und ganz recht hast, na \"erkauft\" sich viele wins/gute spieler aber wer kann der kann. usa unterstützt esports halt viel mehr.\nich kann nur von mir als österreicher reden, seit meinen 13 jahren schule habe ich noch nie eine person getroffen die mir 1 online spiel nennen kann außer WoW. eu gibt einfach einen... f... auf esports","replies":[{"poster":"KingVegetaa","date":"2015-03-15T23:11:44.440+0000","up_votes":1,"down_votes":0,"body":"Oh in Österreich kann ich nix dazu sagen und in meinem Freundeskreis ist halt die PS4 und Xbox mit Fifa halt der Dauerrenner.\nein paar Online Freunde kennen zwar lol, aber können es nicht zocken :)\n\nUnd ja es ist natürlich legitim, aber wie ich sagte, ich bin kein \"Fan\" davon und wenn ich die Fanboys von TSM dann spammen sehe denke ich mir omg, Europa macht die Arbeit und Jail Dyrus kriegt den Ruhm :P","replies":[]}]}]},{"poster":"Pilze","date":"2015-03-15T20:48:43.207+0000","up_votes":1,"down_votes":0,"body":"Also ich finde das liegt daran das in EU immer das selbe gespielt wird, die Teams picken 95% immer das selbe und die Taktiken sind auch immer die selben. Da kommt keine Überraschung oder mal was neues. Sie spielen das was wo anders schon Out ist und können dann nicht mehr mithalten. Und die anderen Teams wissen was sie spielen müssen um sie einfach weg zu fegen.","replies":[{"poster":"Kaitri","date":"2015-03-15T21:01:15.308+0000","up_votes":1,"down_votes":0,"body":"naja und eu kriegt auch nicht soviel zuwachs. na hat spieler aus china und korea da kommt schon bisschen strategie mit. \naber ja denke mir bei jedem turnier wo die eu spielt so oft in der pick und bann phase \"warum eu warum!?\"\nist halt schade. würde gern mal wieder für ein eu team chearen können :/","replies":[]}]}]},{"poster":"ü ö","date":"2015-03-14T20:51:10.499+0000","up_votes":2,"down_votes":0,"body":"Ach du Sch... Was ein Event, so ziemlich alles läuft anders als man es erwarten würde. Das schlechteste!!!! Chinesische Team besiegt die ungeschlagenen!!! Koreaner, auch noch mit Subs! Beide Koreanischen Vertreter vorm Finale raus, wer hätte das gedacht.. ich nicht. \n\nAlso dann, WE - TSM!","replies":[]},{"poster":"Kaitri","date":"2015-03-14T13:03:58.960+0000","up_votes":2,"down_votes":0,"body":"sk ist raus. leider. ich finde es schade das eu nicht ins halbfinale kam. hätte sehr gerne sk gegen tsm gesehen. hätte zwar auf tsm gesetzt aber trotzdem.\nwas glaubt ihr hätte sk gegen tsm gewonnen?","replies":[]},{"poster":"StitchStar","date":"2015-03-14T13:04:15.055+0000","up_votes":2,"down_votes":1,"body":"Voll schlecht von SK von einem NR 1. Team erwarte ich viel mehr als das was SK gezeigt hat bis auf Freddy sahen fast alle irgendwie durch die Bank nicht gut aus und Freddy sah ab und zu auch solala aus. nRated und Fox sah überhaupt nicht gut aus.\n\nTotal die Blamage für EU dieses IEM Turnier. NA kann wenigstens behaupten das ein Team sehr gut performt hat auch wenn C9 total schlecht aussah.\n","replies":[{"poster":"Kaitri","date":"2015-03-14T13:12:47.610+0000","up_votes":2,"down_votes":1,"body":"ist das nicht meistens so das na weiter kommt als eu? :/","replies":[{"poster":"ü ö","date":"2015-03-14T13:15:41.504+0000","up_votes":1,"down_votes":0,"body":"Wie in den Worlds.. NA kam immerhin aus der Gruppenphase raus auch wenn dann beide von Samsung weggeklatscht wurden. (Aber immerhin jeweils ein Spiel abgetrotzt haben was bei SSW bis zum Finale die einzige Niederlage war)","replies":[]}]},{"poster":"KingVegetaa","date":"2015-03-14T16:12:14.201+0000","up_votes":1,"down_votes":0,"body":"ist immer das gleiche -speziell bei SK Gaming- es liegt an den Picks.\n\nWenn ich sehe, dass man Mid Lane (gestern gegen GE) eine Diana pickt, dann darf man sich nicht wundern, dass man verprügelt wird.\nWarum nicht einfach Xerath, Ahri, Orianna. Mit Poke und guten Ultis.","replies":[]}]},{"poster":"ü ö","date":"2015-03-15T20:47:18.614+0000","up_votes":1,"down_votes":0,"body":"Sieht sehr gut aus, beim 2-0 gabs eigentlich zu keinem Zeitpunkt mehr eine Chance das noch rumzureißen für WE, fand es allerdings beeindruckend wie aus dem 3-7 in nichtmal 10 minuten ein 12-7 wurde.","replies":[{"poster":"Pilze","date":"2015-03-15T20:54:36.585+0000","up_votes":1,"down_votes":0,"body":"Ganz ehrlich. Ich verstehe den Jarvan Pick nicht. Der bringt nichts und jedesmal ist er der Jenige der alles versaust.","replies":[{"poster":"Kaitri","date":"2015-03-15T21:01:40.609+0000","up_votes":1,"down_votes":0,"body":"*hust* adc ez useless *hust*\nund einfach 3mal j4. sie lernen es nicht lol","replies":[{"poster":"ü ö","date":"2015-03-15T21:03:02.599+0000","up_votes":1,"down_votes":0,"body":"*hust* Jarvan IV zum dritten *hust*\n\nSoll mir als TSM Fan Recht sein.","replies":[{"poster":"Kaitri","date":"2015-03-15T21:07:53.995+0000","up_votes":1,"down_votes":0,"body":"man muss ja tsm fan sein. sonst gibt es kein team das nicht von den asiatischen teams fertig gemacht wird.","replies":[{"poster":"ü ö","date":"2015-03-15T21:13:14.081+0000","up_votes":1,"down_votes":0,"body":"Ich bin schon länger als 3 Tage Fan, und davor wurde TSM genau wie alle anderen von Korea fertig gemacht (SSW)","replies":[{"poster":"Kaitri","date":"2015-03-15T21:20:37.506+0000","up_votes":1,"down_votes":0,"body":"ja schon aber tsm war halt das team (mehr oder weniger neben c9) das manchmal doch was gerissen hat. \nwas man von der eu nicht behaupten kann. season 4 war generell nur traurig für eu\nund season 5 sieht nicht viel besser aus. wenn man bedenkt vor paar wochen war sk noch unbesiegt und jetzt gehts auch nur mehr bergab","replies":[{"poster":"ü ö","date":"2015-03-15T21:29:09.184+0000","up_votes":1,"down_votes":0,"body":"Das gab es in EU aber auch (mal): Fnatic. Sehe aber in EU ebenfalls bis auf jenes Fnatic wenig bis gar kein Potential. Das angebliche Spitzenteam Elements ist schon lange wieder raus, Gambit und SK sind offensichtlich auch (noch) lange nicht bereit und bei H2k bin ich mir nicht sicher, denke aber dass das auch nix werden wird. \n\nAber deiner Argumentation folgend könnte ich auch sagen ich bin GE Tigers fan bzw war SSW Fan..","replies":[{"poster":"Kaitri","date":"2015-03-15T22:00:57.213+0000","up_votes":1,"down_votes":0,"body":"naja ich war ssw fan da ich eu na lcs und ogn/lck schaue und damals schon auf ssw und ssb abgefahren bin. damals mehr auf ssb :D","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Bezar","date":"2015-03-15T21:24:05.242+0000","up_votes":1,"down_votes":0,"body":"Das ist grad ein Schlachtfest für TSM. :)\n\nBei WE fängt es schon in der Bannphase an, warum zum Teufel sollte man Viktor gegen Bjergsen bannen? Aber es gibt eh soviele Champs, dass die Bannphase nur dann effektiv ist, wenn ein Gegenspieler bloss 1-2 Mains hat.","replies":[]},{"poster":"Pilze","date":"2015-03-15T20:30:44.540+0000","up_votes":1,"down_votes":0,"body":"Ich hätte nicht gedacht das die Spiele so Temporeich sein würden...die geben ja richtig Gas und machen ziemlich Druck...","replies":[]},{"poster":"ü ö","date":"2015-03-15T19:53:18.796+0000","up_votes":1,"down_votes":0,"body":"Sah wieder schlecht aus, aber es ist mittlerweile beinahe Fakt, dass TSM ein unglaubliches Comeback Potential hat, was man hier wieder gesehen hat. Klasse Fights, würde sagen der Titel ist möglich!\n\nIch fand es ja übrigens schon gestern interessant, wie ein WE Spieler (War es Aluka?) meinte, dass WE TSM im ersten Spiel unterschätzt hat und dass sie höchstwahrscheinlich gewinnen werden. Klang für mich extrem überheblich, vorallem wenn man bedenkt dass die 12. sind, wie können die es sich eigentlich leisten IRGENDWEN zu unterschätzen, und dann auch noch einen 1.? Kein Wunder dass die 12. sind.. *facepalm*","replies":[]},{"poster":"hshtagniemehrcdu","date":"2015-03-15T19:44:45.274+0000","up_votes":1,"down_votes":0,"body":"**Das** ist das schlechteste Team in China?\nWtf...","replies":[]},{"poster":"Bezar","date":"2015-03-15T18:48:01.562+0000","up_votes":1,"down_votes":0,"body":"Endlich gehts los...","replies":[{"poster":"Pilze","date":"2015-03-15T19:01:54.250+0000","up_votes":1,"down_votes":0,"body":"Ja, ich bin echt gespannt. Kann echt nicht sagen wer das Rennen macht...beide Teams haben sich durch geschlagen und stehen zurecht im Finale","replies":[]}]},{"poster":"Pilze","date":"2015-03-15T18:30:22.382+0000","up_votes":1,"down_votes":0,"body":"naja dann warten wir halt noch ein bisschen. kann ja nicht so lange dauern...hoffe ich zumindest","replies":[]},{"poster":"Bezar","date":"2015-03-15T18:16:38.257+0000","up_votes":1,"down_votes":0,"body":"... Sorry die Ausdrucksweise... aber welcher Vollidiot kam auf die Idee, dass die beiden Spiele auf derselben Stage ausgetragen werden? ...","replies":[]},{"poster":"ü ö","date":"2015-03-15T17:09:22.225+0000","up_votes":1,"down_votes":0,"body":"Was ist denn mit dem ESL Kanal? Dachte das Finale fängt um 18:00 an, aber der Stream ist offline? Und im deutschen wird außer Solo/Duoq auch nix gezeigt??\n\nEdit:\n\nVerzögert sich wegen Starcraft II um rund eine Stunde.","replies":[]},{"poster":"Zero000","date":"2015-03-14T20:51:48.072+0000","up_votes":1,"down_votes":0,"body":"Da reden alle (viele) im Vorhinein von einem rein Koreanischen Finale und nun hat es kein einziges koreanisches Team ins Final gepackt...","replies":[]},{"poster":"hshtagniemehrcdu","date":"2015-03-14T20:51:07.696+0000","up_votes":1,"down_votes":0,"body":"Ein saftiger Tritt in die Weichteile für alle Korea-Fans.","replies":[]},{"poster":"Bezar","date":"2015-03-14T20:02:18.108+0000","up_votes":1,"down_votes":0,"body":"Respekt für Team WE! Dass die sich nach der ersten Niederlage nicht haben demotivieren lassen! \n\n\n\nDAS IST SEIT LANGEM DAS WOHL BESTE, WAS ICH IN LETZTER ZEIT SCHAUEN DURFTE!!!!!! Team WE macht grad einen auf Gambit :p","replies":[]},{"poster":"Kaitri","date":"2015-03-14T19:56:11.583+0000","up_votes":1,"down_votes":0,"body":"das GE Tigers gerade sein 1. spiel verliert, gegen eines der aktuell letzten teams in china, finde ich sehr interessant. so wie ich die koreaner kenne wird sich jeder aufregen das nicht sie ge tigers besiegt haben :D\n\nedit: korea sieht diese season ja generell nicht so stark aus wie sonst... könnte es wirklich sein das china diese season gewinnt? oder vielleicht sogar na??? \n\nc9 muss so baff sein wenn sie sich die games ansehn","replies":[]},{"poster":"Kaitri","date":"2015-03-14T17:53:52.901+0000","up_votes":1,"down_votes":0,"body":"tsm könnte wirklich das 1. team sein das ge tigers besiegt. ist inzwischen wirklich realistisch!","replies":[]},{"poster":"Bezar","date":"2015-03-14T15:45:00.955+0000","up_votes":1,"down_votes":0,"body":"Holy Sh......\n\n TSM hat grad von den Flash Wolves aufs Maul bekommen... o.O","replies":[]},{"poster":"ü ö","date":"2015-03-14T13:34:05.983+0000","up_votes":1,"down_votes":0,"body":"Meine Tipps für das restliche Tunier:\n\nTeam WE - CJ Entus 0-1\n\nyoe FW - TSM 0-2\n\nGE Tigers - CJ Entus 2-1\n\nTSM - GE Tigers \n\nHier wirds dann schwer, so wie TSM gestern gespielt hat würde ich denen sogar ein 3-2 zutrauen, allerdings geht es eben immernoch gegen das Top (ungeschlagene!) Team aus Korea.. weswegen ich sage entweder 3-2 oder 1-3.","replies":[{"poster":"Kaitri","date":"2015-03-14T13:52:33.585+0000","up_votes":1,"down_votes":0,"body":"ich bezweifle das ge tigers - cj 2/1 sein wird. ge tigers ist in korea nicht umsonst ungeschlagen.","replies":[{"poster":"ü ö","date":"2015-03-14T14:24:44.379+0000","up_votes":1,"down_votes":0,"body":"Ok, GE Tigers - Team WE 2-0 :P\n\nKrass wie das läuft.. also kickt der 12.! aus China den 3. aus Korea raus, EU ist auch schon weg und jetzt gibts Tigers - WE.. Wer weiß was jetzt noch passiert, am ende gewinnt WE das Tunier {{champion:48}} ","replies":[]}]}]},{"poster":"Pilze","date":"2015-03-13T20:33:06.681+0000","up_votes":1,"down_votes":3,"body":"Stream ist mal wieder am laggen, das die das nicht lernen. Twitch ist echt mist....","replies":[{"poster":"Kaitri","date":"2015-03-13T21:51:26.392+0000","up_votes":1,"down_votes":0,"body":"ich hab keine laggs. und ich hab ne 0,8k leitung. wenn ich mit meiner bauernleitung keine probleme hab...","replies":[]}]},{"poster":"ü ö","date":"2015-03-13T19:57:43.503+0000","up_votes":1,"down_votes":0,"body":"Gutes Spiel von TSM auch wenn es \"nur\" gegen den 12. aus China ging.\n\n\nWow. Geiles Spiel gegen CJ, hätte ich nicht erwartet. Madlife findet nicht ins Spiel und TSM nutzt das super aus -> super Decisionmaking, klasse TF's am Ende, was soll man da noch sagen, Klasse!","replies":[]}]}