{"poster":"mirzamagix","date":"2018-09-18T15:32:24.369+0000","title":"Welcher Champion ist empfehlenswert?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo zusammen! \r\n\r\nIch spiele LoL jetzt erst seit ca. 2 Wochen und bin gerade lvl. 20 geworden. Da ich gerne besser werden w&uuml;rde, wollte ich anfangen einen bestimmten Champ zu mainen. Ich bin mir sicher, dass der ein oder andere eine gute Empfehlung f&uuml;r mich hat, welchen Champ ich spielen sollte. Am besten einen f&uuml;r jede Lane und Jungle. Die kosten spielen erstmal keine Rolle solange es kein RP kostet. \r\nVielen Dank schon mal im Voraus!\r\n\r\nMfg mirza","replies":[{"poster":"Villaine v3","date":"2018-09-18T15:40:20.710+0000","up_votes":2,"down_votes":0,"body":"Garen für die Top lane.. Viel sustain.. hat quasi immer ne Top winrate selbst wenn er generft wurde. Simple Spells\n\nWarwick für den Jungle.. Stumpfer spielstyle und gewinnt fast gegen jeden anderen jungler im early mühelos nur durch stumpfe autoattacks.\n\nSona, Nami oder wenn ein Tank gebraucht wird Leona oder Alistar als support\n\nMid lane kann ich nicht viel zu sagen.. Veigar und Malhazar\n\nADC. Miss fortune.. einfach zu spielen und ne top winrate","replies":[{"poster":"mirzamagix","date":"2018-09-18T15:42:32.916+0000","up_votes":1,"down_votes":0,"body":"Ok, vielen Dank :D","replies":[]}]},{"poster":"LegendaryXenon","date":"2018-09-18T15:37:43.352+0000","up_votes":2,"down_votes":0,"body":"Spiel erstmal alle aus der Rota, damit du die kennenlernst.\n\nTop: Poppy/ Garen/ Irelia/ Jax\nJgl: Xin Zhao/ Udyr/Yi/ Shyvana\nMitte: schwierig, die Guten sind alle nicht so einfach. Irelia/ Akali\nSupport: Janna/ Alistar/ Morgana/ Leona\nAdc: Jhin/ Kai'sa und Recht einfach: Miss Fortune\n\n\nIst keine vollständige Liste. Die Champs haben nicht unbedingt alle hohe Winrates, aber sollten ein extrem solides Gerüst sein. ","replies":[{"poster":"mirzamagix","date":"2018-09-18T15:43:16.807+0000","up_votes":1,"down_votes":0,"body":"Ok, Danke","replies":[]}]},{"poster":"GamingHabe","date":"2018-09-21T15:59:44.687+0000","up_votes":1,"down_votes":0,"body":"\"Wollte ich anfangen einen bestimmten Champ zu mainen.\" \nAls Anfänger würde ich dir erstmal einfacher Champions wie Master Yi Jungle/ Garen Top/ Lux  Midlane/Ashe ADC / Alistar Support ans Herz legen wenn du dann merkst das die jeweiligen Champions zu einfach sind kannst übergehen zu Xin Zhao , Warwick Jungle / Teemo, Sion Toplane/ Ahri Katarina Midlane/Catilyn Jhin ADC / Thresh Blitzcrank Support.\n\nIch hoffe ich konnte dir behilflig sein :D","replies":[]},{"poster":"Cenâreth","date":"2018-09-21T14:00:23.133+0000","up_votes":1,"down_votes":0,"body":"Spiel {{champion:17}}  {{champion:161}}  oder {{champion:74}} AP Supp full AP du bist der King dort unten. ADC kann gar nichts machen und jeder Shield Supporter oder Heal Supporter wird schnell tilted werden.\n\nOder Olaf Jungle mit Predator Boots, Relentless Hunter und {{item:3800}} und danach komplett voll Tanky, zerstörst du damit nicht nur jede Botlane oder Midlane, sondern gewinnst mindestens 2-3 Fights im Teamfight im aktuellen Patch. Vorallem mit deiner Ult, die ja ähnlich wie Yi seine Ult ist. Cho'Gath Top full Tank geht absolut geil ab, Nasus AD/AP Mischung habe ich auch schon gesehen dürfte auch funktionieren. Midlane Leblanc wenn du die Kombo hinbekommst bist du ein Traum für jedes Team. Als ADC sind aktuell nur MF und Kai'Sa und Twitch recht viable und vielleicht noch Kog'Maw.\n\nUnd Support wie gesagt AP Support und Leona/Nautilus/Alistar und Braum.","replies":[]},{"poster":"Humpelstilzche","date":"2018-09-18T15:50:34.465+0000","up_votes":1,"down_votes":0,"body":"> wollte ich anfangen einen bestimmten Champ zu mainen\n\nMeine Empfehlung ist das erst mal nicht zu tun. Als Anfänger ist es vor allem erstmal wichtig, alle Aspekte des Spiels grob kennen zu lernen, sprich alle (oder fast alle) Champions zu spielen und zu wissen was sie tun und einschätzen zu können, wie stark sie in welcher Situation sind. Das allein dauert schon eine halb Ewigkeit, ist aber ein wichtige Basis. Sich zu früh zu spezialisieren wird deinem Lern-Prozess nicht gut tun. \nEinen Main sucht man sich auch nicht, er kommt zu dir. Du merkst schon irgendwann, welcher Champ zu deiner Spielweise passt und/oder dir besonders Spaß macht. Tadaa, Main gefunden!\nBis dahin spiel einfach worauf du spontan Lust hast und probier immer mal wieder was neues aus.","replies":[{"poster":"mirzamagix","date":"2018-09-18T16:12:51.906+0000","up_votes":1,"down_votes":0,"body":"Ok, Danke :D","replies":[]}]}]}