{"poster":"AEX DK Chaotix","date":"2017-12-14T19:39:34.404+0000","title":"Support und Jungle Main Suchen Team für Turnier Modus und 5er Flex","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Deutsch:\r\nIch (DK Chaotix) 22 Jahre und mein Duoq Partner (DK Shaddix) 23 Jahre suchen ein Team f&uuml;r den Tournament Modus/Flex 5er .Wir beide spielen seit Season 2 und mindestestens 3x die Woche. Letzte Season erreichten wir Gold 5 und Platin 4 in Soloque und Gold 3 und Gold 1 in Flexque durch die gemeinsame Zeit sind wir ein eingeschwei&szlig;tes Team und harmonieren sehr gut miteinander.Desweiteren wissen wir &uuml;ber Lanemanipulation,Roams,Invades,Combos,Map Awareness,etc. Bescheid. Ich bin Support Main (Leona,Tresh,Sona,uvm.), er spielt Main Jungle (Kha&acute;zix,Jarvan,Trundle,uvm.).Wir hatten schon mehrere Turniere in der Esl bestritten mehr oder weniger Erfolgreich und hatten und waren in mehreren Teams. Wenn wir euer Intresse erwecken konnten dann addet mich einfach oder schreibt hier im Forum. Wir haben TeamSpeak und Discord. Danke f&uuml;r euer Intresse :)\r\n\r\nEnglish:\r\nHello me (DK Chaotix) and my Duoq Partner (DK Shaddix) are looking for a Team. We both play since Season 2 and play each Week 3 days.Last Season we reached Gold 5 and Platinum 4 in Solo/Duoque, in Flex we reached Gold 3 and Gold 1 because we play since Season 2 we have a good Harmony and know what the other Part thinking.Also we know About: Lanemanipulation,Roams,Invades,Combos,Map Awareness and so on. I&acute;m a Support Main (play Leona,Thresh,Sona,and much more.), he&acute;s a Main Jungler( and Plays Kha&acute;zix,Jarvan,Trundle,and much more.).We played on ESL for a couple month and stayed in much Teams. When we got ur interest add me on League or leave a Comment below. We have Teamspeak and Discord. Thank you :)\r\n\r\nWir erwarten: \r\n- mindestens Gold/Platin Elo \r\n-Teamspeak/Discord\r\n-Erfahrung (Roaming,Lane Swaps,)\r\n-Freundlichkeit und Zuverl&auml;ssigkeit\r\n\r\nWir bieten: \r\n- Zuverl&auml;ssigkeit\r\n- einen Jungler und einen Support beide gold/platin Elo\r\n- sehr viel Wissen (notfalls Coaching)\r\n-bei weiteren Fragen einfach mich adden und dann k&ouml;nnen wir alles Besprechen","replies":[]}