{"poster":"NightPhoeníx","date":"2016-11-05T16:08:16.934+0000","title":"Toplaner sucht Arbeit","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey Leute,\r\n\r\nIch suche ein ernsthaftes Team, das sich dauerhaft verbessern m&ouml;chte und als Ziel EAS, EPS, Amateur Tournaments etc. hat.\r\n\r\nZu mir: Ich bin 23 Jahre alt, war ne Zeit inaktiv, habe &quot;fr&uuml;her&quot; Dia 3 gespielt, Teamranked Diamond 5, G4lol Viertelfinale sowie Amateur Tournaments 2-3 Platz jedoch als Jungler.\r\n\r\nDies ist ein Smurf, ich habe Aktuell noch ein Platin 2 Account, jedoch bespiele ich diesen Account hier nurnoch, da ich mich auf die Toplane einspielen m&ouml;chte.\r\n\r\nIch freue mich auf adds und hoffe nen gutes Team im High Platin/Dia bereich zu finden :)\r\n\r\nmfg NightPhoen&iacute;x","replies":[{"poster":"SecretLine","date":"2016-11-05T16:09:00.073+0000","up_votes":2,"down_votes":0,"body":"https://jobboerse.arbeitsagentur.de/","replies":[]},{"poster":"onidefaker","date":"2016-11-05T17:00:52.942+0000","up_votes":1,"down_votes":0,"body":"Wir suchen genau jemanden wie dich für unsere Toplane wir sind ein highplat/dia team gut organisiert und aktiv. Ziele sind vorallem Turniere und dia in Teamrankeds :)\nHab dich mal geaddet damit ich hier keinen roman schreiben muss das können wir ja auch privat dann :)!","replies":[]},{"poster":"Doomy McLovin","date":"2016-11-05T16:43:34.178+0000","up_votes":1,"down_votes":0,"body":"Hi NightPhoeníx,\n\nHast du schon einmal an eine Community gedacht in der du oft im Team spielen kannst ? Mit einem eingespielten Team im Rift zu zocken steigert sehr oft die Erfolgsquote .-)\n\nWenn ja, wären wir da vielleicht eine Option für dich :)\nWir sind eine Ü18-Community, die außer Normals auch (Team-)Rankeds spielen.\nDa wir auf den Umgang miteinander achten, sind wir eine sehr harmonische Community,\ndie trotz ihrer Größe einen Zusammenhalt der Community zeigt.\n\nWir freuen uns auf Besuch und bei Fragen oder Interesse kann man mich gerne adden :)\n[★ Nerds Go Casual ★](https://nerdsgocasual.de/community)\n\nLiebe Grüße\nStephan (Inagme: Doomy McLovin)","replies":[]}]}