{"poster":"SpankyRou","date":"2019-06-01T11:28:23.792+0000","title":"Heute 18 Uhr LOL Turnier mit hohen Prämien - Noch schnell eintragen","subforum":"Turniere & Veranstaltungen","embed":{"description":"Dear fellow players!Voller Vorfreude präsentieren wir euch unser neues Turnier. Bleibt gespannt und rafft euch in 5er...","url":"https://battlefy.com/maikunity/lga-lol-5vs5-turnier-organizer-maikunity/5cd2eb6a34b496033b11c85f/info?infoTab=details","image":"https://firebasestorage.googleapis.com/v0/b/battlefy-2f59d.appspot.com/o/user-imgs%2F5ca0f32176d6fe032ef36b53%2F1557326075297.gif?alt=media&token=eb1e7370-a97a-452b-b3fa-c5a4d2aad383"},"up_votes":1,"down_votes":1,"body":"eln von League of Legends bei einem 5vs5, am wichtigsten ist hier vor allem die Kooperation mit uns. Ohne Kommunikation und Verständnis klappt bekanntermaßen nichts. Beachtet bitte, dass euer Teamcaptain spätestens zum Beginn des Turniers auf unserem Teamspeak erscheint. Hier gibt es einen eingerichteten Eventbereich, welcher automatisch Channel erstellt. Bei Fragen werden wir euch gerne zur Seite stehen, euch über den Spieleablauf beraten und euch dort (und auch nur dort!) die Prämien aushändigen. Vorteilhaft wäre beim letzteren, dass das vollständige Team anwesend ist. (Nach dem Motto: Zusammenhalt bis zum bitteren Ende!)\r\n\r\n\r\n\r\nScheut euch nicht, uns auch vor Beginn des Turniers fragen zu stellen. Wir sind immer gerne für euch erreichbar!\r\n\r\n\r\n\r\n---> MAIKUNITY.TS3INDEX.DE &lt;---\r\n\r\n\r\n\r\nAlso, cheerio! meine Lieben und hoffentlich auf ein baldiges Zusammenstoßen!\r\n\r\n\r\n\r\n+++ACHTUNG: Das Turnier könnte bei zu geringer Teilnehmerzahl nicht stattfinden+++","replies":[{"poster":"Xayah Strife","date":"2019-06-01T11:45:50.090+0000","up_votes":0,"down_votes":1,"body":"Heute Abend ist doch Champion League Finale.\nDa wird sich wohl kaum jemand für lol finden lassen leider","replies":[{"poster":"MidlaneGod115","date":"2019-06-01T12:34:23.768+0000","up_votes":1,"down_votes":0,"body":"Was ist denn bitte eine Champions League?","replies":[{"poster":"Xayah Strife","date":"2019-06-01T13:27:45.985+0000","up_votes":1,"down_votes":0,"body":"Fussball :)","replies":[{"poster":"MidlaneGod115","date":"2019-06-01T14:52:41.705+0000","up_votes":1,"down_votes":0,"body":"Achsoo der Sport bei dem die Spieler zu absurden Preisen verkauft werden und sich im Endeffekt keiner für interessiert? \n\nDann weiß ich was du meinst :D\nVor allem wenn in dem Europokalfinale nur 50% der Plätze besetzt sind ;)","replies":[]}]}]},{"poster":"SpankyRou","date":"2019-06-01T11:46:51.341+0000","up_votes":1,"down_votes":0,"body":"Es sind bereits einige Teams angemeldet. Das Finale beginnt um 21 Uhr und das Turnier um 18 Uhr. Das wird weit vor 21 Uhr beendet sein. ^^","replies":[]}]}]}