{"poster":"IIManeoxII","date":"2016-03-07T02:15:54.001+0000","title":"No quedaste en la division que querias? entra que te explico!","subforum":"Torneos y Eventos de la Comunidad","up_votes":1,"down_votes":13,"body":"Bien desde que se reseto las ranked muchas personas se quejaron de que no les toco la division que querian o que ellos &quot;merecian&quot; bueno les explico asi:   si vos ganaste las 10 partidas y quedaste en bronce 5 es porque jugaste mal las 10 o algunas no importa si ganas o perdes las 10 lo que importa es como jugaste osea si en las 10 partidas ibas 1/16/3 es seguro que vas a decender de liga ! ahora si vos perdiste las 10 partidas y en casi todas saliste  12/1/3 seguramente acenderas y porque? porque no es por partidas lo que subis si no por la habilidad que tenes al jugar ! asi que espero que leas esto y no andes diciendo que &quot; merecia estar en plata 2 porque el a&ntilde;o pasado estuve&quot; no no es asi ! no importa si ganaste o perdiste las 10 es la habilidad lo que te sube de liga!","replies":[{"poster":"LGBT Valentina","date":"2016-03-07T04:19:00.597+0000","up_votes":3,"down_votes":0,"body":"Todo mal lo que dijistes\n\nPor dios gente, que se les meta en la cabeza\nNo importa el KDA o tu habilidad\nEl sistema de MMR, se basa en tu MMR y el del otro\n\nSi estabas plata 5 y las ganas 10 provicionales, te emparejan con bronzes 5 a 3, no esperen que terminen en la misma liga o mas alto, no importa si salen con kda 100/0/0\nEl juego no dectecta tu habilidad de como jugas, no tiene el mas minimo sentido\nSi existiera un programa que detectara la habilidad del jugador (de todos los de lol), la LCS no tendria gracia, el mundial tampoco, faker no seria nadie, etc\n\nEs simple: Si te toca gente mejor que vos, mas MMR (mas puntos y te sacan menos al perder). Si te toca gente con peor MMR que vos (pocos pts y te va a sacar mas)\nSi perdes de forma seguida con gente peor que vos, el sistema deduce que no tenes que estar en esa liga\nSi ganas de forma continua con gente peor que vos de forma lenta te va a emparejar con gente de mas mmr (logicamente + pts)\n\nPodes estar plata 5, pero tener un mmr de hasta bronze 2 o 3 o ser plata 5 y tener un mmr de gold 3 (y te tira 30 pts x win)","replies":[]},{"poster":"Czdr","date":"2016-03-07T09:44:20.250+0000","up_votes":1,"down_votes":0,"body":"Osea wat?\n{{sticker:slayer-pantheon-rainbows}} {{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"martincarp","date":"2016-03-07T02:39:34.623+0000","up_votes":1,"down_votes":0,"body":"Estás bastante equivocado.\nLo único que se tiene en cuenta al momento de modificar el MMR (ya sea en una partida normal de temporada regular o una de las 10 de posicionamiento) son los MMR de ambos equipos y el tuyo en comparación con el resto.\n\nFuente: https://support.riotgames.com/hc/es-419/articles/201752994-Preguntas-Frecuentes-de-la-Temporada-2014#h3q1","replies":[{"poster":"IIManeoxII","date":"2016-03-07T02:55:09.777+0000","up_votes":1,"down_votes":0,"body":"entonces porque de las 10 partidas gane solo 2  y quede en bronce 2? en las otras partidas que perdia no moria casi nada solo 2 o 3 veces y tenia mas de 10 kills! ! para mi que es asi!","replies":[{"poster":"martincarp","date":"2016-03-07T07:43:35.938+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IIManeoxII,realm=LAS,application-id=QXeEMrF7,discussion-id=ImfIMrEc,comment-id=00010000,timestamp=2016-03-07T02:55:09.777+0000)\n>\n> entonces porque de las 10 partidas gane solo 2  y quede en bronce 2? en las otras partidas que perdia no moria casi nada solo 2 o 3 veces y tenia mas de 10 kills! ! para mi que es asi!\n\nQuedaste Bronce II porque es así como funciona el sistema en las primeras 10 clasificatorias.\nEn general, cuando uno rankea por primera vez con unas 4 victorias le alcanza para quedar en Plata V (SOLO en las primeras 10, en los reinicios de temporada es otra la historia), por lo tanto normalmente con 3 victorias quedas en Bronce I, y en tu caso, como podrás ver, quedaste en Bronce II porque tenías 2 victorias.\nIgual aclaro que no tiene que ver solo el resultado final, otro factor a tener muy en cuenta es el orden en el que ganas las partidas, porque por ejemplo, en tu caso habrás ganado las 2 partidas cuando todavía te emparejaban con platas bajos, por lo que el sistema decidió que eras capaz de jugar a ese nivel y no te dejo demasiado lejos. En cambio, si una persona pierde 8 partidas seguidas, lo más probable es que las últimas ya las juegue con bronces V y IV (ya que derrota a derrota te va bajando el nivel de emparejamiento de manera bastante brusca), por lo que aunque gane las últimas 2 es MUY probable que esas victorias solo le alcancen para quedar en Bronce IV o III.","replies":[]}]}]},{"poster":"Hvitserk ","date":"2016-03-07T03:11:41.608+0000","up_votes":1,"down_votes":0,"body":"Yo gane 5 quede en plata 3 , en la preseason rankee y quede en plata 1 . ahora en esta season gane 7 y volvi a quedar en plata 1 , no depende de las kill que tengas :s","replies":[{"poster":"IIManeoxII","date":"2016-03-07T03:17:24.483+0000","up_votes":1,"down_votes":0,"body":"yo nunca dije depende de las kills que tengas! si no en la habilidad en que jugas! lo que puse hay solo fue un ejemplo! si sos bueno no creo que mueras muchas veces viste!","replies":[]}]},{"poster":"Yrox the Third","date":"2016-03-07T02:22:20.089+0000","up_votes":1,"down_votes":0,"body":"No se base 100% en las primeras rankeds,  se basa en tu ELO final de la preseason. \n\nVale decir que en esta season el ELO necesario para cada division aumento.","replies":[{"poster":"IIManeoxII","date":"2016-03-07T02:24:17.955+0000","up_votes":1,"down_votes":1,"body":"si por eso es que a mi me paso osea yo nunca rankee y cuando lo hice solo gane 2 de las 10 y quede en bronce 2 ! pero las otras jugaba bastante bien y perdíamos por diferencias en el equipo nada mas!","replies":[]}]}]}