{"poster":"Marcoxp","date":"2015-07-17T23:20:12.765+0000","title":"Reports","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":11,"body":"Ich werde immer wieder von Troll Spieler reported und bekomme deswegen Chat Block??? Das ist nicht Fair! Ihr solltet das Report System abschalten\r\n, das deswegen immer mehr unschuldige Personen einen Chat Block bekommen und deswegen kaum mit den Team kommunizieren k&ouml;nnen. Zudem ist man nicht in der Lage sich zu wehren , wenn jemand ohne Grund im All Chat behauptet, dass man Flamet ! Ich verlange deswegen, dass mein Chat Block unverz&uuml;glich behoben wird , da mir dies den Spa&szlig; am Spielen verdirbt!","replies":[{"poster":"Alustus","date":"2015-07-18T02:12:46.606+0000","up_votes":2,"down_votes":0,"body":"Informier dich bitte über das System bevor du unwahrheiten verbreitest.\n\nReports alleine Lösen keine Speere aus.\n\nReports bewirken nur, dass dein Chatverlauf überprüft wird.\nSollte das System keine auffälligkeiten entdecken wirst du auch keine Strafe bekommen.\n\n\nSomit ist dein Chatbann gerechtfertigt und nicht durch Troll reports entstanden.","replies":[{"poster":"Marcoxp","date":"2015-07-21T20:01:46.470+0000","up_votes":1,"down_votes":1,"body":"Hauptsache das Spiel gibt mir weider ohne Grund 75 Tage Chat Sperre. GJ Riot suck Eier","replies":[{"poster":"Alustus","date":"2015-07-21T20:21:16.780+0000","up_votes":1,"down_votes":0,"body":"Ich glaube du hast das nicht verstanden.\n\nEine Cr bekommst du nur wenn du dich auch dementsprechend verhalten hast.\n\nDein Chatverlauf wird überprüft von einem Automatischen system, also hast du die Strafe nicht von einem Schlecht gelaunten Mitarbeiter bekommen sondern von einem sachlichem Programm was sich nicht von Tagesstimmungen beeinflussen lässt.\n\nSomit ist die strafe nicht ohne grund und gerechtfertigt!","replies":[]}]}]},{"poster":"Busty Botter","date":"2015-07-17T23:25:44.168+0000","up_votes":1,"down_votes":0,"body":"Ich bekomme auf div. Accounts (ja ich besitzte mehrere) öfters die Meldung, ich wurde reported für XY. Jedoch habe ich noch nie eine Strage bekommen. Und da du schon zugibst \"du wehrst dich im Allchat\", will ich nicht wissen wie du dies tust!","replies":[{"poster":"Nuckmuck","date":"2015-07-18T10:24:59.665+0000","up_votes":1,"down_votes":0,"body":"Das System unterscheidet nicht zwischen normalen flame und flame aus ... ka notwehr ? \n\nBeleidigt dich jemand im RL und du beleidigst ihn zurück bekommt ihr auch beide eine Anzeige wegen beleidigung.","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2015-07-18T04:01:06.966+0000","up_votes":1,"down_votes":0,"body":"es hat noch niemand eine Chatsperre bekommen, weil die Mitspieler im All Chat behauptet haben, dass man flamet.\n\nUnd ähm... du solltest dich vielleicht mal damit auseinandersetzen, dass die überwältigende Mehrzahl der Spieler niemals mit einer Chat Restriction in Berührung kommen. Um mal dein \"immer mehr\" zu relativieren...","replies":[]}]}