{"poster":"àce boogie","date":"2017-10-19T06:48:28.226+0000","title":"I’m quitting league, and here’s why","subforum":"General Discussion","up_votes":2,"down_votes":6,"body":"I love league.\r\nIt was the first and only MOBA i&rsquo;ve Ever played, and will forever remain my true love. But I have had enough.\r\n\r\nI&rsquo;m aware that my money and my time means nothing to Rito, with thousands(millions) of players there to replace me. I&rsquo;m just a drop in the bucket.\r\n\r\nThis goes back to last season, where the frustration begins. The mage update was the beginning of the mess we have now. They turned Malz into an uninteractive, strong as hell champ. They made Vladimir an almost unbalanceable, blatantly overpowered mess. They left Zyra and Brand(especially brand) to 1v2 in the bot lane like no other &ldquo;support&rdquo; can do. They made zhonya a trash item. Then they reworked my favorite champ of all time, Ryze, gave him an extremely powerful ultimate (and the rest of his kit, quite honestly) and gated it, claiming that they changed Ryze from a champion with a steep learning curve with big risk (short ranged, relatively weak early game and scaling reliant) to a champion that is &ldquo;supposed to be accessible to almost all levels of play, yet his highest ceiling could only be reached by masters of the champion&rdquo;. But I could see why they reworked him. Even though I didn&rsquo;t agree with it and I still prefer old Ryze, I adapted.\r\n\r\nThen the assassin rework came. And with it came &ldquo;adc in 2016/2017 LUL&rdquo;. The WHOLE TIME I was saying that it was a result of not adc&rsquo;s being weak but rather other classes and subclasses being overturned. I mean for goodness sake you could go from red to krugs for an ez lvl 3, gank bot with your lee sin and at the very least blow summs. ADC mains consistently whined everywhere and sadly riot listened and power creeped the ENTIRE class to the point where they have no counters in this meta. They nerfed mages (rylai nerf. Zhonya nerf, along with items being too expensive for not enough value). Bruisers are not viable in solo queue , unless you manage to stomp lane with your renekton or Irelia or tryndamere and manage to split push your way to victory(same with Jayce and kennen) because honestly you are better off picking a tank that can 5v5 and build knights vow/locket and peel for the adc in team fights. Then they delayed assassins burst and gave them more counter play. Now this would be fine, had riot not introduced Redemption/knights vow, and subsequently made a lot of important support items cheaper with better effects, and, the icing on the cake, made GA an AD item along with reducing the costs for almost all crit items because ADC mains whined that they wanted an earlier power spike. They got this, and in turn with games being more snowbally in general (realistically the game is over at 10-15 minutes even though it may take the team a bit longer to end or even throw the game) ADC&rsquo;s has gotten what they wanted. Almost every other class of champions were progressively nerfed into near unviability (the same 3 mages are picked in LC$ along with the same few tanks and the same few bruisers, when rarely picked), with the best strategy now to pick an ardent support, a hypercarry, a tank jungle and a to planet that can build knights vow or locket, and a wave clear midlane mage.\r\n\r\n\r\nBut the last straw was ardent censer. Riot justified the removal of DFG (ty dfg) and devourer claiming that these are mechanics and items that are unhealthy and uninteractive for the game (which was true), BUT YET DOES THOSE TWO TERMS NOT DESCRIBE ARDENT CENSER? It takes minimal effort and little to no risk for a lulu or a Janna (at least they saw sense and nerfed her somewhat timely thank god) or even a Rakan or a taric to apply ardent censer for a gigantic gain. There is no other way to say it; this item is on par with devourer and dfg (ty dfg) with the game warping effects it has. Riot removed the life drain and added onhit damage, declaring it now healthy for the game. ITS A LIE! Ardent is still bullshit. It needs to go. It simply does not deserve to be in the game. A support that completes ardent before the other support literally singlehandedly swings the botlane and thus the game in their favor.\r\n\r\nLast of all, Riot needs to do some soul searching with their balance team. Honestly , what are they even thinking? Like, I understand that they have to keep the game perpetually unbalanced to keep it interesting. But you have to wonder if they play their own game sometimes. Deaths dance draven in his state since the tank rework and it took them till September to do something about how broken he was? I see a lot people complaining about twitch and rightfully so. But what you fail to realize is that Twitch has had a 53+ winrate since the assassin rework which is COMPLETELY UNACCEPTABLE for a &ldquo; late game hypercarry&rdquo; and yet they&rsquo;re STILL holding off on his nerfs till preseason? They left Ryze in the gutter for almost the whole season then they gave him a buff to Rune Prison and suddenly people think it&rsquo;s okay to do what they did? They released a btoken mess of a champ in Camille. Made LB and renter simultaneously less fun to play whilst making them significantly more busted. The list goes on. And on. And on. And on.\r\n\r\nThe point im trying to make is that the decisions riot has made for their game for almost two years now have not been well thought out and poorly executed with almost no hindsight which is unacceptable for how big of a game League is. And I&rsquo;ve had enough. The game isn&rsquo;t fun for me when i can go 3/0 toplane with my renekton but I tp botlane to try to make a play and get 2v3&rsquo;d by the Janna and Kalista/kog/cait/trist. Its not fun when getting fed as top or jung or mid doesn&rsquo;t matter at all if the enemy botlane won. Its not fun getting statchecked by 2300g item with no very real counterplay. Its not fun having my LP depend on who completes ardent first or whichever botlane gets fed first. Remember when jungle was OP early this season and riot nerfed them for the fact that they had too much impact and influence over a game? Right now Azir is very strong and you will see it. He&rsquo;s really back to his old problems just with slightly shorter range. They have unjustifiably left Morde in the gutter with his 200+ bugs. They continue to allow bad champion designs in enchanters to exist in the game.\r\n\r\nI will give them their props though, with almost every rework, the exception being ryze&rsquo;s many reworks, they have been very successful on that front.\r\n\r\nIf you can keep playing and keep having fun, all the power to you.\r\nBut I simply cannot do this anymore.\r\nJust my 2 cents.","replies":[]}