{"poster":"Apszin","date":"2020-02-14T13:17:26.823+0000","title":"Miért játszak ezzel a játékal? Vagyis lehet hogy inkább nem kelene.........","subforum":"Általános beszélgetés","up_votes":8,"down_votes":1,"body":"Gondom igen egyszerű mivel a League of Legends számára az a lényeg hogy minél többen játszanak ezért jó látják hogyan is lehet ezt meg valósítani.\r\nA játékkal játszók java az rankedezik  és az ott elért eredményeik alapján ítélik meg a játékot amivel nem is volna gond ha nem a fentebb említett politika alapján járna el a játék azaz a rangsorlt játékok színvonalának erős alacsony szinten tartása. Mivel ha koszos bronzos vagy akkor nincs mire arcoskodni. De ha a promóban már ingyen winek vannak és semilyen  kritériuma nincs a rankednek eljutunk oda mint ahol jelenleg járunk.\r\nSupport item nélküli vagy wardolni nem tudó deffenziven csapatban játszani nem tudó hulladék negatív emberekhez akik teherként csüngenek a nyakadon és lényegtelen hogy te mit teszel ő/ők lehúznak. Nem törekednek jobb játékra nem foglalkoznak semmivel csak tolják neki mert előbb utóbb meglesz az a platin ha eleget játszol és ugye ez a lényeg h sokat játssz. Te pedig aki normálisan játszol haladsz felfele elvárnád hogy a játékhoz inkompetens játékosok mocsarából kikerülj hogy olyanokkal érj el eredményeket akik a te szinteden vannak és hogy ne arról szóljon egy játék hogy melyik csapatban vannak többen az inkompetensek akiken 10 perc alatt el lehet feedelődni. Kezd ez a játék igen kiábrándító lenni más játékban még a silvernek is van nívója itt meg még a platinának se. Én meg gondolkodom a játék törlésén mert miért játsszak idegesítő emberekkel akik elrontják a játékom és a kedvem. Kedves League of Legends 10 év után lassan lehet hogy a ranked játékoknak valami színvonalat kellene biztosítani és nem a feljebb jutást könnyíteni a selejteknek hogy minél többet játszanak és szórják anyuci pénzét. Ja de az nem gazdaságos szóval bocs ilyen nem lessz....... Üdv a szurdokban a trollok arénájában ;)","replies":[{"poster":"Risy95","date":"2020-02-17T12:01:11.609+0000","up_votes":2,"down_votes":0,"body":"Ha nem tudsz elég jó okot találni a játék folytatására, akkor csak hagyd abba, és csinálj helyette mást, amit élvezel. Rengeteg fiatal, talán főleg gyerek úgy gondolja, hogy a LoL menő, ezért elkezdenek játszani. Ez is az egyik oka annak, hogy csökken a színvonal. A másik dolog pedig az, ahogy kezelve vannak a játékosok (jutalmak, büntetések stb...).\nTöbbször abbahagytam már a LoL-t. Azért játszom most is, mert minden meccs tartogat valamiféle kihívást, érdekességet, és ezt élvezem. Sajnos a csapatmunka és a nyerni akarás hiánya elrontja annyira az élményt, hogy csak pár meccset játszak, és nem minden nap.\nA feljutással kapcsolatban: Sokat lehet úgy játszani, hogy igazából nem is/alig fejlődünk, nem tudom, meddig lehet így eljutni... Viszont aki kicsit komolyan veszi és megérti a játékot, annak szerintem a Gyémánt rang előbb utóbb meglesz, már ha nem kedvetleníti el a rengeteg nem törekvő játékos. Sajnos úgy hallom, hogy még azután sem fog sokat javulni a helyzet, szóval egyszerű: Ha élvezed, játssz, ha nem, akkor csak hagyd abba.\n\nSzerk: Én Plat 2-ig mentem fel előző szezonban, de ott egy időre elegem lett belőle.","replies":[]},{"poster":"StickOs","date":"2020-02-16T09:07:17.769+0000","up_votes":2,"down_votes":0,"body":"Sokszor elgondolkodom hogy egy ilyen játék során ahol egyes ösvényeket nem érdekel semmi nem jobb kilépni és csak csendben abbahagyni mivel így nem csesz fel és nyugodt is maradsz. Úgy sincs értelme folytatni mivel a csapatodat nem érdekli már a játék. Csak egymás agyát húzzák.","replies":[{"poster":"Shikaichi","date":"2020-02-16T11:06:52.865+0000","up_votes":2,"down_votes":1,"body":"Én végig szoktam játszani, már azért is, hogy ne legyek aztán kilépő, meg sosem tudhatod. Persze vannak reménytelen esetek, ott megpróbálok feladást szavaztatni, de sokszor nem akarják, nem fogadják el. Előfordul mondjuk jobb is, mert megtörténik a csoda, és megnyerjük. Az ellenfél is emberből van, itt meg egy hiba is végzetes lehet, plusz számít a választott hősök is, hogy azok inkább a játék elején, közepén vagy végén erősebbek. Ha mégis elveszítjük feladás nélkül, akkor mindig eszembe jut magamban, hogy én megmondtam, hogy időpazarlás... De kilépni sosem fogok, azzal egyenes ágon elkönyvelem, hogy cserben hagyom inkább a csapattársaimat, hosszú távon, pedig büntetést is kaphatok érte.","replies":[]},{"poster":"Jack Eron","date":"2020-02-16T10:18:17.039+0000","up_votes":2,"down_votes":1,"body":"Nekem már régen ez a stratégiám. Hogyha hard lose van, brutális hátrány, akkor elmegyek farmolni a játék végéig vagy a spawn körül maradok. Aki szereti bámulni a szürke képernyőt, az megteheti nélkülem is.","replies":[]}]},{"poster":"Kadegrow","date":"2020-02-16T11:07:09.030+0000","up_votes":2,"down_votes":1,"body":"A baj az, hogy divattá vált ebben a játékban a trollkodás a leszarom a nem tudok játszani 0-5 4 perc alatt és írom, hogy FF. Ez minden meccsen így van!!!\nNem beszélve, hogy a Riot rá tesz egy lapáttal is. Egyre több az autofill. Meccsenként minimum 2 ember az. Régen nem volt ennyire retardált ez a pickelés sem. Inkább vitatkoznék komolyan mondom a régi rendszerben, hogy FIRST SAY SUPPORT és hagyom menni, mint fölöslegesen válasszak lane-t mert úgyis máshova dob.\nÍrták régen, hogy befogják vezetni azt, hogyha én main support vagyok, akkor csak annak a lane-re ad rankedet. Röviden support gold2, de ha mideznék, akkor meg ironban kezdek. Ami igazságos is lenne. Komolyan mondom inkább várok 10 percet csak normális emberek legyenek. Őszinte leszek most volt egy meccsem ki is léptem a ge...be 24 halál 14 perc alatt. Jobban féltek egy Jannatól torony alatt, mint az ADC-mtől. Szerintetek kaptam valamit? Riot elnéző mindenkivel és még jól is jártam mert kevesebb pontot vont le.\nMég az a szerencse, hogy kurvára keveset játszok már én is ezzel a fos szar játékkal. Tény és való semmi jelentősége nincs már, hogy hol van az ember. For Honorozok jelenleg ahol gyerekekkel nem nagyon találkozok akik ne tudnának játszani.\nA report rendszer egy rakás szar a meccskeresés is a lane rendszer is. Röviden 10. szülinapjukra jól beújítottak.\nAz a baj a Riottal, hogy inkább lehúznak 1 jó játékost, mint kibannoljanak 10 hülye gyereket akik játszani nem akarással ( 2 perc 0-3 say FF 15 ) intelik el a játékot. Mert ugye 10 1 es arányban a Riotnak ez nagy kiesés bevételbe globálisan nézve.\nSzánalmas, hogy úgy megyek be és nem csak én, hogy akárhogyan játszok bármit csinálok úgyis kikapok.\nEgyszerűen nincs értelme a játéknak, de előbb vagy utóbb nagyon nagyot fognak bukni ezzel csak még teljen el pár év.\nNincs bajom aki nem tud játszani, de az mit keres gold környékén? Mi értelme, hogy én rankedezek? Semmi. Röhej, hogy egy ekkora cég ilyen problémákkal küszködik és nem akar ellen semmit tenni. Majd, akkor fog kapálózni mikor a sok előfizetőt ( nem kötelező fizetni ezért a játékért, de a 15 éves nem is fog ) elveszti a Riot. A barátok az egyetlen ok amiért még itt vagyok.","replies":[]},{"poster":"Imiking ","date":"2020-02-15T21:02:01.441+0000","up_votes":2,"down_votes":1,"body":"Pár napja megint elkezdtem LoLon rankedezni, Iron 3-ból most felmásztam Iron 1-be, és most kicsit stuckolok (pedig előző szezonban b3-as voltam). A kedvenc csapattársaim akikkel az utóbbi időben játszottam azok a 0/3as Yasuo top aki kiafkolt miután nem gankeltem, a másik pedig a thresh mid (aki egyébként jó volt de lategameben szart sem ért), és hasonló csodálatos csapattársak. Ez a játék már csak a bálnákért van","replies":[]},{"poster":"Gresident","date":"2020-02-16T10:46:11.364+0000","up_votes":1,"down_votes":1,"body":"Nem értem, hogy ez miben más mint a többi 1001 ugyanilyen téma.\nAz összes többi ilyen téma mérföldekkel le van húzva, ez miért kaphatott ennyi pozitívumot?\n\nNéha azért vannak elgondolkodtató dolgok, persze biztosan \"más\" emberek szavaztak, nem azok akik szoktak...\nEddig mindig a \"pozitív\" játékosok szavaztak, akik szerint minden rendben van a játékban, mi történhetett?","replies":[{"poster":"Storiaron","date":"2020-02-20T03:23:37.746+0000","up_votes":1,"down_votes":0,"body":"pláne amikor az egyik problmája (ingyen win promoban) teljesen érthetetlen, sőt nem is létező platinumtól...","replies":[{"poster":"Apszin","date":"2020-02-23T09:22:13.713+0000","up_votes":1,"down_votes":0,"body":"Ha valami egyértelmű nincs le írva az nem azért nincs mert hülye aki a posztot írta, hanem mert egyértelmű ha esetleg neked nem volna az. Ha ennek ragozására szorulnál kérlek szólj szívesen segítek neked.","replies":[]}]}]},{"poster":"FURRY V2","date":"2020-02-17T06:29:59.809+0000","up_votes":1,"down_votes":0,"body":"Adok egy plusszt, ha kijavítod a helyesírási hibákat.","replies":[{"poster":"Apszin","date":"2020-02-17T17:30:26.462+0000","up_votes":1,"down_votes":0,"body":"Diszlexia, diszgráfia a helyesírás javító pedig ennyit tudott segíteni xD","replies":[]}]},{"poster":"The One ESCANOR","date":"2020-02-16T11:28:27.779+0000","up_votes":1,"down_votes":0,"body":"Egyszerűen csak túl sok kezdő játékost vonz be még mindig a Riot és itt az eredménye. A gyerek eléri a 30-as szintet és kezdi is a rankedot. Nem érdekli őt hogy pl. jungel rolet hogyan is kell rendesen játszani, hogy nem csak abból áll a jungel hogy farmolok 20.percig és leszarom a többi lanet még ha veszít is. Aztán mikor 1v5 bemegy is meghal akkor a csapattársak a retardáltak és FF. \n\nEz itt a baj, sok playernek fingja sincs arról hogy is kell a laneket játszani de ha Nightblue,Jankos, Tarzaned, TFBlade és a többiek carryzik a laneket akkor még se lehet olyan nehéz a játék...gondolja ezt a 12 éves friss accounttal rankedező player.","replies":[]}]}