{"poster":"Apszin","date":"2018-07-19T09:31:52.359+0000","title":"Hogyan válhatna jobbá a ranked?","subforum":"Általános beszélgetés","up_votes":3,"down_votes":2,"body":"Mindenki aki lolozik szereti a rankedet, hogy megmutassa mit is tud, de sajnos ennek nincsenek vagy csak nagyon elhanyagolhat&oacute; krit&eacute;riumai. \r\nSzerintem ez probl&eacute;ma mivel a ranked j&aacute;t&eacute;knak sokkal nagyobb s&uacute;llyal kellene ezen t&eacute;ren b&iacute;rnia.\r\nItt gondolok az &eacute;letkorra is &eacute;s a j&aacute;t&eacute;kos k&eacute;pess&eacute;geire is. A korhat&aacute;rt szerintem egy egyszerű matematikai k&eacute;plettel amit havonta vagy 3-om havonta feltesz a j&aacute;t&eacute;k egyszerűen le lehetne tesztelni. Az pedig hogy ranked j&aacute;t&eacute;kon r&eacute;szt vehess ahoz kelljenek olyan karakterek amikkel gyakorlott vagy &eacute;s itt kellene bevezetni azt, hogy minden l&eacute;nre legal&aacute;bb 3-4 karakterrel kelljen rendelkeznie az illetőnek lvl6 de ink&aacute;bb 7-es hős ismerettel. Ezen k&iacute;v&uuml;l minimum 2. kit&uuml;ntet&eacute;sessel kelljen rendelkeznie. Lehet hogy ezek t&uacute;l szigor&uacute;nak tűnnek, de gondoljatok bele a sokk hozz&aacute; nem&eacute;rtő embert akikkel gyakran &ouml;ssze lehet futni &eacute;s m&eacute;g annyit sem vesznek &eacute;szre hogy ha nem tudj&aacute;k nyerni a lanet akkor legal&aacute;bb ne feedeljenek hanem passz&iacute;van faroljanak.\r\nTov&aacute;bb&aacute; s&uacute;jt&oacute;sabb b&uuml;ntet&eacute;sek is kellen&eacute;nek mert m&eacute;g mindig rengeteg afk-val futni &ouml;ssze.\r\nEz a j&aacute;t&eacute;k fixen ig&eacute;nnyel kb. 30 percet +- 10 perc ezzel &iacute;gy lehet sz&aacute;molni, ha az ember nem tudja előre hogy lesz-e ennyi ideje akkor ne &iacute;ndics&oacute;n &uacute;j mecsetet vagy az esti &oacute;r&aacute;kban amikor anyuci lenyomja a netet mert a nyamvadt k&ouml;l&ouml;k m&eacute;g nem alszik ........\r\nLehetne solo k&uuml;ldet&eacute;seket is csin&aacute;lni amikben fix c&eacute;l van hogy fejlessze a j&aacute;t&eacute;kos tud&aacute;s&aacute;t pl. wardok kihelyez&eacute;se mert rengetegszer tal&aacute;lkozom olyannal hogy wardos item n&eacute;lk&uuml;l t&ouml;bbet wardolok mint a szupport itemmel.\r\nVagy a kor&aacute;bban emlitett passz&iacute;v farmol&aacute;s, hogy a j&aacute;t&eacute;k olyan ellenfelet adjon akit &uacute;gy sem tudsz legyőzni, de ha a farmra koncentr&aacute;lsz turett alatt akkor azzal seg&iacute;ted a team-et &eacute;s sz&aacute;mos hasonl&oacute;t lehetne k&eacute;sz&iacute;teni.\r\n\r\nK&iacute;v&aacute;ncsian  v&aacute;rom a v&eacute;lem&eacute;nyeket.","replies":[{"poster":"Gregori","date":"2018-07-19T10:33:04.246+0000","up_votes":3,"down_votes":0,"body":"Szerintem ez nem ilyen egyszerű. Most például a matekpéldát egy szülő, barát, rokon vagy bárki más is megtudja oldani, másfelől meg vannak kevésbé tanult emberek is. Szóval ez nem egy életképes megoldás. Ennyi erővel IQ tesztet meg személyiség vizsgálatot is végezhetnének.\n\nA mastery szűrés már jogosabb, mert a smurfölést meg a felhasználó megosztást is teljesen kiszűrhetné akár, ide kapcsolódóan a boostolást is.  De azért mert valakinek van 1 millió pontja egy hőssel, az még távolról sem jelenti azt, hogy ő profi szinten tud vele játszani. Sőt, alapvetően, ha megnézed kik vetetik a toplistákat azok általában bronz-silver kategóriába esnek. Persze jogosan szeretnénk azt hinni, hogy aki sokat játszik egy hőssel, az ismeri annak minden csínját bínját, de ehhez elő sorban érzék kell.\n\nEsetleg egy olyan lvl2-3 amit eltudnék képzelni, ezekhez kevesebb mint 10 meccs kell, az viszonylag kevés, és egy karaktert ennyiből már körülbelül meglehet tanulni annyira, hogy ne csak feedelj vele.\nCsak itt megint ide lehetne kapcsolni a smurf témát, meg hogy lehet valakinek 2 meccs is elég, stb, szóval érzékeny téma. Szerintem a Riotosokra kéne hagyni. Ha tényleg annyira el fog burjánzani a ranked remélhetőleg fellépnek ellene.\n\nA baj inkább az, hogy míg régen egy teljesen kezdőt bedobott b5-s4 közé jó eséllyel, addig manapság szinte mindenki s4 környékén kezd. Így pedig ha nem oda \"való\" akkor még elég sok meccset kell kikapnia, elég sok játékosnak kell elrontania a meccsét ahhoz, hogy a rendszer szerint megérdemelt rankját \"elérje\".\n\nAmúgy meg szörnyen korlátolt az ötleted, így semmiféleképpen sem életképes. Van olyan helyzet is, amikor az ember ráér, leülne játszani, de hirtelen történik valami, ami miatt ott kell hagynia, vagy bármi. Erről nem tehet emberünk, hisz ő úgy ült le, hogy ráér. De még a technikai dolgok is ide tartoznak, bekrepál a gép, elmegy az áram, elmegy a net, és még sorolhatnám. Ezekre pont hogy valami \"kedvezményt\" kéne kapni, nem hogy büntetést.","replies":[{"poster":"Apszin","date":"2018-07-19T11:36:21.708+0000","up_votes":1,"down_votes":2,"body":"Értem én, csak jó lenne látni hogy azért valami komolyságot addnak a játék ezen részének és ha nem is 100% os szürés amit javasoltam de legalább ha már 20-30 % on müködő képes volna szerintem már megérné. A hősismeret is azért kellene mert számtalanszor tapasztalom hogy kijön pl. egy új hős és mindenki azzal feedel rankeden, még 2-3 mecse sincs vele  és ott szerencsétlenkedik vele, és lehet h késség szinten megy neki a játék, de pl szart sem és egy tapasztalt játékos ellen aki keni vágja a karakterét bármilyen helyzetben.  Aki meg csak játszani akar 1-2 mecset az üljön le aramozni vagy normálra, a net probléma meg a játék hibákra annó volt  a hibaüzenet küldése a Riot-nak és akkor nem vesztetél lp-t ami ma már ugyan nincs de lehetne mert nem volt hülyeség.","replies":[{"poster":"Gregori","date":"2018-07-19T12:56:13.268+0000","up_votes":2,"down_votes":0,"body":"Csak ha például reworkölnek egy hőst, akkor az lenne a korrekt, ha elvennék a hősismereti pontokat is, hogy tiszta lappal lehessen kezdeni a szűrést. Ez pedig hidd el rengeteg felháborodással járna, szóval ez már is kizárja ez egészet. Sajnos a legjobb megoldás a bannolás, én mindig kiteszem a frissen kijött új hősöket vagy reworköket, ezzel biztosítva magamat. Esetleg addig nem rankedezek amíg az új hős mániája le nem cseng egy kicsit.\n\nValóban jó lenne, ha műszaki hiba miatt megint visszakaphatnánk az elveszített LP-t, de szerintem szaporodott a visszaélések száma, és ezért törölték el ezt a rendszert. Azt pedig szűrni, hogy elment az áram, vagy csak kihúztam a net kábelt aligha lehet, szóval nem látok reményt arra, hogy visszakerül.\nÉn inkább olyan rendszert tudnék elképzelni, hogy mondjuk havi de inkább évi szinten 1 leavet \"elfelejt\" a rendszer, de csak akkor ha mondjuk mér játszottál xy meccset. Így lenne egy minimális biztosíték, habár még ez is kihasználható.","replies":[{"poster":"Apszin","date":"2018-07-19T14:19:44.152+0000","up_votes":1,"down_votes":0,"body":"Semmi sem tökéletek, egyépként meg az hogy egy rework esetén ugrik minden tartalom egy karakterel kapcsolatban kivéve ami fizetős az szerintem természetes volna miven azok a statok már nem ahoz a karakterhez tartoznak igy illogikus megtartani mivel a nevébenis a hősismeret található meg, esetleg az ipt ami a lvl 6-7 hez kellet azt vissza tériteni.\nAm én csak néhány tippet kivántam felsorolni a játék ezen részének javitására komolyitására ammik esetleg jók vagy jobbakat inspirálnak és ha ezek nem is jók azért szerintem valamilyen formában ezekhez hasónló modositás ráférne a játék ranked részére. \n\nA játék  azon része pedig h elmegy a net vagy  csak kilépet, az kicsit nehezebb téma valóban, de akkor is ott van az amikor zsinórban van 4 remeke-m ami olyan 30 perc magában  + a várakozási idő mire ősszedob a játék és az ilyen eléggé zavaró és elveszi az ember kedvét. A játék menett alati kilépés/afk is elégg iritáló de az szerencsére kevésbé gyakori ott esetleg  a többi játékostol csak fele annyi LP-t vonhatna a játék meg 38perc mecsből mondjuk 20-at afk-olt a lvl6-os jg aki mondjuk még van 2-3 kill is.","replies":[{"poster":"Gregori","date":"2018-07-19T14:50:36.203+0000","up_votes":1,"down_votes":0,"body":"Szerintem úgy lenne logikus, ha azok is elvesznének, pláne egy totális rework esetében, viszont próbáld magad beleképzelni egy ilyen helyzetbe. Nekem, ha az egyik mainemet alakítanák át, igen csak fájna a szívem, ha azt a (számomra) sok megszerzett pontot elbuknám. Így is sokszor arra szoktam gondolni, hogy ha ez a rendszer már él volna, amikor elkezdtem a játékot, most hol tartanék, hisz akkor sokkal több időm volt.\n\nA reameke-vel egyetértek. Szerintem az sem lenne hülyeség, hogy ha már ilyenkor semmit nem kapunk azért, hogy elpocsékoltuk azt az 5-10 percet, legalább némi KE üthetné a markunkat. Hisz alapvetően, ez számít a befektetett időnk fizetségéül.\n\nA fél LP levonás sem hangzik rosszul igazából, és még a visszaélési potenciálját is elég alacsonynak látom.","replies":[]}]}]}]}]},{"poster":"Mind The Gap","date":"2018-07-19T13:30:31.354+0000","up_votes":5,"down_votes":2,"body":"A Champion Mastery-s elméletedet tovább gondoltam...\n\nNem hinném, hogy Riotnél ez így rendben lenne-e, hogy így lekorlátozzák az embert. Viszont el tudnék képzelni egy olyan rendszert, ahol a játékosokat **motiválnák** azzal, hogy ha olyan champet választanak, akivel minimum 4-es szint megvan, akkor több LP-t kapjanak. Ha úgy tetszik, akkor az LP mennyiség több lenne minden szinten 4 felett vagy csak egyszerűen kevesebb LP-t kapnak 1-2-3 szinteken. Rövid távon nem igazán tetszene azoknak, akik 50 percet játszanak le és végeznek egy comebackkel, hosszú távon viszont az embereknek motivációt adna az, hogy gyorsabb fejlődés érdekében válasszanak olyan champet, akivel nem first play-t mennek.","replies":[{"poster":"Temp65432","date":"2018-07-19T16:01:59.003+0000","up_votes":3,"down_votes":2,"body":"Miért lenne a korlátozással gond? Túl nagy kérés elvárni hogy legyen fogalma arról mit csinál?","replies":[]},{"poster":"ScreamForMeBaby","date":"2018-07-20T10:24:23.494+0000","up_votes":2,"down_votes":1,"body":"Ha minden lvl7 yasuo main után kapnék egy lángost akik úgy feedelnek mintha muszáj lenne akkor én a legdagadtabb és legboldogabb ember a világon. Silver-bronz-gold játékosok is tele vannak lvl7 karakterekkel, mégsem tudnak a játékról semmit. Gyakorlatilag a hősismeret és a játéktudás között semmilyen relevancia sincs.","replies":[{"poster":"Temp65432","date":"2018-07-22T10:17:09.956+0000","up_votes":1,"down_votes":1,"body":"az igaz , de ha bepickel egy lv7es karaktert és szétfeedeli az agyát, akkor szerinted mi fog történni ha olyat visz aminek életében nem látta még a képességeit? Az, hogy valamivel van 2-300k pontja és teljesen szar azt jelenti, hogy ha új karaktert visz be még annyira se fog tudni játszani.","replies":[]}]},{"poster":"40 iq or less","date":"2018-07-19T17:46:56.953+0000","up_votes":1,"down_votes":0,"body":"azert igy is eleg osszetett a mostani MMR rendszer, nem hiszem hogy ez a masterys dolog akkora problema lenne peldaul silver felett. igy meg ugye a tapasztalt jatekosokkal csesznenek ki. ha valaki fillkent bekap egy supportot es van valami jo pocketpickje mastery nelkul akkor pickelje be a magas szintu sorakat amit blitz counterel?","replies":[]},{"poster":"Gresident","date":"2018-07-19T19:20:24.349+0000","up_votes":1,"down_votes":1,"body":"Kellene egy másik játékmód, ahol csak a lv5 vagy magasabb hősök érhetőek el.","replies":[]}]},{"poster":"Shirodrake","date":"2018-07-19T17:36:04.360+0000","up_votes":1,"down_votes":3,"body":"Mint játékos szempontból a ranked valamivel értékesebb, mint a normál. Mind a kettőnél megkapod az XP-t, valamint eventeknél a questekből származó loot-ot is. Ugyanakkor ranked esetében ha csak átlag 50%-os győzelmi aránnyal rendelkezel, akkor is szép lassan kúszni fogsz felfelé. \n\nSzeritnem nem is igazán a rankedet kellene korlátozni, hanem vonzóbbá kellene tenni a normált.\n\nPár ötlet:\n(megj: normal esetében mindig a draft pick-et értek)\n\n**Meccsekért járó XP **\nA ranked mecseken legyen 25%-kevesebb, a normal meccseken pedig 50%-al több. \n\n**Eventek korlátozása**\nA küldetéseket ne lehessen elvégezni ranked mecsekkel.\n\n**Folyamatos \"mini\" küldetések normalra.**\nTop, Mid és ADC esetében a farm vizsgálata a 10. és a 20. percben aszerint, hogy az adott ligában, divizióban mi az átlagos.\nHa legalább 15%-al jobb vagy az átlagnál kapnál egy pontot. (jobb arány esetében több pont, negatív arány esettében pedig pont levonás járna)\nSupport esetében akkor járna pont, ha egy wardal felfedezel egy felétek közeledő ellenfelet aki nem az adott lane-ről származik. (Jungle, Mid, Top) \nPont járna, ha rálátásod vana sárkányra, baronra, mikötben az ellenfél el akarja vinni, és ti sikeresen megakadályozzátok. \n\nJungle esetében a smite-al való sikeres objektív gyilkosságért,a mennyiben az ellenfél is részt vesz a harcban.\n\nHa a KDA átlagod az adott meccsen 3 felett van szintén bónusz pontot érne. (Ha 1,5 alatt van, akkor pontlevonás)\nA KDA-ért jűró pozitív pontokat a győztes meccsek dupláznák, a vesztes meccsek feleznék. \n\nPontok járna a részvételi arányért is. Ha 65% feletti járna pont, de ha 35% alatti, akkor levonásra kerülne a sor.\n\nstb...\n\nA meccs végéna szerint, hogy hány pozitív vagy negatív pontot szereztél módosítókat kapnál a meccs után járó XP-re.\n\n\nA pozitiv pontok megnövelnék, a negatív pontok csökkentenék.\n\nPozitív pontok esetében, bizonyos érték felett, kaphatsz kék illetve narancs eszenciát, kulcstöredéket.\nIlletve \"magas\" pontszám esetén pedig token-t kapnál. 10 token-t pedig be tudnál váltani egy ládára.\n\nEsetleg lehetnének külön csak a tokenekkel megszerezhető jutalmak (ikonok, hangulatjelek, wardok, keretek...stb)\n\nA meccs végén pedig kapnál egy részletesebb visszajelzést, hogy a különféle feladatokban hogyan szerepeltél.\nItt lehetne egy automatikus üzenet rendszer is. Aszerint, hogy miben voltál sikeres, illetve, hogy miben kellene fejlődnöd.\n\n\n**Ranked LP módosítás**\n\nRankeden megnövelném a meccsekért járó LP m mennyiségét legalább 50%-al a mostanihoz képest.  (megjegyzem ez a levonásra is vonatkozna)\n\nHa túl sok ranked meccset játszol egymás után, akkor...\n\nGyőzelem esetén\n3. meccs után 25%-al kevesebb LP\n5. meccs után 50%-al kevesebb LP\n7. meccs után 75%-al kevesebb LP\n\nVereség esetén\n5. meccs után 10%-al több LP levonás\n7. meccs után 25%-al több LP levonás\n9. meccs után 50%-al több LP levonás\n\nAz alap állapot egy normalon elért győzelem, vagy 5 nap után állna vissza.\n\n\n**Lehetőség automatikus bónusz LP-re**\n\n ha 95 és 99 pont között vagy az alapján, hogy a legutóbbi normál meccseken mennyire voltak pozitívak az eredményeid.\nHa 99. pontod van, akkor elég ha csak a legutóbbi meccsen kaptál pozitív pontokat.\nViszont 95 LP esetében már a legutóbbi öt normal meccs mindegyikén pozitv eredményed kell, hogy legyen, hogy megkapd a bónusz LP-t.\n\nTehát igen, akár normal meccsekekel is lehetne LP-t szerezni. Pontosabban, ha normalon jól szerepelsz, és csak pár LP kell a promóhoz, akkora rendszer automatiksuan kiegészítené 100-ra.\n\n(A nomral meccseket még azelőtt kellene lejátszani a bónusz LP-hez, mielőtt a ranked győzelemmel elérted volna a minimum 95 LP-t.)\n\n\nUI.: Az értékek példa jellegűek.","replies":[{"poster":"40 iq or less","date":"2018-07-19T17:43:10.049+0000","up_votes":3,"down_votes":0,"body":"Győzelem esetén\n3. meccs után 25%-al kevesebb LP\n5. meccs után 50%-al kevesebb LP\n7. meccs után 75%-al kevesebb LP\n\nVereség esetén\n5. meccs után 10%-al több LP levonás\n7. meccs után 25%-al több LP levonás\n9. meccs után 50%-al több LP levonás\n\n\n\nsot, ha 10 meccset nyertel ne is kapj lpt","replies":[{"poster":"Gregori","date":"2018-07-20T16:05:11.471+0000","up_votes":1,"down_votes":0,"body":"11 után meg vonjon le.","replies":[]}]},{"poster":"Gregori","date":"2018-07-20T16:07:09.502+0000","up_votes":1,"down_votes":0,"body":"> Top, Mid és ADC esetében a farm vizsgálata a 10. és a 20. percben aszerint, hogy az adott ligában, divizióban mi az átlagos.\n> Ha legalább 15%-al jobb vagy az átlagnál kapnál egy pontot. (jobb arány esetében több pont, negatív arány esettében pedig pont levonás járna)\n\nSzóval ha a lane ellenfelem erősebb nálam, én pedig csak elvétve tudok farmolni, mert nem áll szándékomban elfeedelni, akkor a rendszered szerint rosszul játszom, ezért kevesebb pontot kapok. Mesélj még...","replies":[]}]},{"poster":"RekteloMaci","date":"2018-07-19T20:04:38.249+0000","up_votes":1,"down_votes":0,"body":"a rito a skinekkel és reworkokkel foglalkozik ilyen kis piti jelentéktelen dolgok nem érdeklik őket","replies":[{"poster":"R3wan","date":"2018-07-20T10:01:06.184+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RekteloMaci,realm=EUNE,application-id=VFnq5EbB,discussion-id=a6xsAiap,comment-id=0005,timestamp=2018-07-19T20:04:38.249+0000)\n>\n> a rito a skinekkel és reworkokkel foglalkozik ilyen kis piti jelentéktelen dolgok nem érdeklik őket\n\nA ritonak több külön csapata van, ami külön területekkel foglalkozik. Egy a skinekkel, míg megint másik csapat új hősökkel vagy más dolgokkal. Persze könnyebb ezt a 'rito inkább a játékkal, ne skinekkel foglalkozzon' baromságot bedobni ezredszer, mint felfogni ezt.","replies":[]}]},{"poster":"VincentPapa","date":"2018-07-24T09:00:04.830+0000","up_votes":1,"down_votes":0,"body":"Ha nem is lenne. Akkor lenne az igazi. Ebben a szezonban már nem is játszok. Teljesen felesleges.","replies":[]},{"poster":"The One ESCANOR","date":"2018-07-19T14:14:43.587+0000","up_votes":1,"down_votes":0,"body":"Afkokról nem tudok nyilatkozni, igen baromi idegesítő mikor a random csákó pingeli az 1000+ ms-t és ki-be lépeget de tudsz vele mit kezdeni ? Én pl. várok annyit hogy 1x max 2x kilépjen a player és vissza. Ha akkor sem jó neki akkor szépen leírom kulturáltan hogy \"haver vegyél netet és köszi a -18 LP-t \" és folytatom a játékot :D","replies":[{"poster":"Apszin","date":"2018-07-19T14:22:48.086+0000","up_votes":1,"down_votes":0,"body":"Bizonyos fps vagy ms alat a játéknak be sem kellene engednie lépni, nem hogy rankedra hanem úgy alapjáraton player vs player mecsresem.","replies":[{"poster":"Gregori","date":"2018-07-19T14:42:08.306+0000","up_votes":1,"down_votes":0,"body":"Ebben már van valami. Korábban volt szó ilyen ping tesztről, viszont mivel az a konkrét szerver amin játszani fogtok kérdéses még a meccs elkezdése előtt, így nem lehet pontos szűrést adni. Esetleg átlagolás jelleggel lehet megnézni, de ilyen téren egy szigorítás nem lenne hülyeség. Stabil 200-as ping mellett még úgy ahogy lehet játszani, de ha ingadozik vagy 300 feletti akkor már valóban élvezhetetlen.","replies":[{"poster":"Apszin","date":"2018-07-20T14:29:24.026+0000","up_votes":1,"down_votes":0,"body":"Most így jókedvemben hozzá fűzném hogy megérdemelnének egy ordas-nagy büntetést az ilyen retardált nyomorultak akik rengár szupportot kenen jg és hasonlókat hoznak. Használhatatlanok a játék alatt  és semmibe veszik a posztjukat support ki sem veszi a warditemet de ha mégis akkor sem tesz le egy db wardot sem, vagy a jg ki sem építi a jg itemet ami még nem volna olyan nagy probléma de ezzel jelzi a csapatféle h ő biza nem jg és ne is számítssunkrá abban a pozícióban.\nMost hogy 3-ra lose-lom ki az 3. 3-om mecset az 5-ből és vagy afk  valaki vagy a fentebb soroltak közül az egyik és hogy promómecsben dob össze a ritó ilyen a játékhoz köze sincs trollokal miközben én igyekszem a legjobbat kihozni magamból, ez kibaszotul demotiváló és a játéktól veszi el a kedvem elmondhatatlan módon. És a végén Te leszel a szar, Te ott Te a monitor előtt aki próbálkozik normálisan játszani...............................","replies":[{"poster":"Gregori","date":"2018-07-20T15:56:13.501+0000","up_votes":1,"down_votes":0,"body":"Sajnos csak annyit tehetsz, hogy reportolod őket, és reménykedsz abban, hogy majd megkapják a büntetésüket.","replies":[]}]}]}]}]},{"poster":"FranklinDelanoR","date":"2018-07-20T15:55:46.634+0000","up_votes":1,"down_votes":0,"body":"Következő seasonban átalakul a ranked rendszer. Már megvannak a részletek is, ha utánnanézel egy kicsit. Addig felesleges crypostolni, meg amúgy is itt nincs semmilyen riotos kolléga. \n\nRossz most a ranked rendszer? Nem, szar.\nLehet ennél rosszabb? Nehezen, de ki tudja, talán mégis.","replies":[]},{"poster":"AsD The Dreamer","date":"2018-07-19T16:50:29.178+0000","up_votes":1,"down_votes":0,"body":"Beírja a googlebe a feladatot azt kiszámolja neki a számológép, ennyit a matekosról.","replies":[]}]}