{"poster":"jk Skulman","date":"2015-08-08T21:58:53.961+0000","title":"Fiora Rework","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Hallo Leute,\r\nIch habe die neue Fiora etwas angetestet und muss sagen ich bin relativ zufrieden. Das Gameplay ist fl&uuml;ssiger, der neue Q ist um einiges st&auml;rker als der alte vor allem, dass der Cooldown reduziert wird wenn man eine Einheit trifft ist extream geil im Late-Game hat man den Q einfach alle 2.5 sekunden. Was mir auch sehr gut gef&auml;llt ist der neue W er ist viel st&auml;rker als der alte ern&ouml;glicht gesundes counterplay und hat einen ATTACKSPEED-SLOW ! extrem geil.\r\nDer E ist ok der Slow und Crit ist ziemlich n&uuml;tzlich.\r\nDie Ult ist stark aber schwer durchzubekommen. Wenn man sie meistert zieht die Ult allein bis zu 30% des maximalen gegnerischen Lebens als absoluten Schaden was wirklich viel ist und der Heal ist ebenfalls angenehm zum towerdiven z.b. oder einfach um das Team zu supporten.\r\nWas mir aufgefallen ist nachdem ich Fiora ein paar mal angetestet habe ist, dass die Range in der man einen f&uuml;r die Ult markieren kann ziemlich gering ist. Ich habe nicht nachgeschaut wie hoch sie ist aber es f&uuml;hlt sich nach 450-500 (bitte korriegen falls falsch) an was weniger wie die vayne attack range w&auml;re. Ich w&uuml;rde mich einfach freuen wenn man einen Gegner schon von einer weiteren Distanz aus markieren k&ouml;nnte. Was ebenfalls gew&ouml;hnungs bed&uuml;rftigt ist, ist dass der Q seine Ziele selbst sucht. Es w&auml;re aber wirklich cool wenn man anstatt dem gew&ouml;hnlichem Flash Q um zu einem Gegner aufzuschliesen Q und direkt danach Flash benutzen k&ouml;nnte (&auml;hnlich wie bei Vi Q Gragas E usw.) Ich habe es ein paar mal ausprobiert jedoch findet der Q dann kein Ziel mehr :(. \r\n\r\nHoffe ich werde angeh&ouml;rt und ein paar dieser Ideen finden Anklang. Die aktuelle Fiora winrate in meinem Elobereich (Plat - Dia) von 39% spricht f&uuml;r sich.\r\n\r\nMfG Skulman","replies":[{"poster":"Cdsfas","date":"2015-08-09T11:44:02.354+0000","up_votes":1,"down_votes":0,"body":"Neue W-skill gibt keinen zusaetzlichen Schaden mehr und Attribute wie HP move Geschwindichkeit und normaler Schaden wird nocheinmal reduziert.Das ist wichtig und ihr merkt es nicht.(tryndamere ist gutes Beispiel)Q sollt eingentlich automatisch schwache Seite angreifen aber es funktioniert manchmal nicht richtig(Q hat 400 attack range）W hat zuviel cooldown.Gib lieber 2~3s weniger  cooldown als ATTACKSPEED-SLOW(ganz einfach wenn man richtig W benuzt wird 1.5s stun geben und ich weiss nicht was zum Teufel brauch ich attackspeed-slow)Fuer ULT wuerd ich etwas sagen,bitte reduzieren Sie den Wert des Heals.(Der Heal spielt grosse Rolle im teamfight.Neue Fiora hat ein Problem:Team fuehrt das Spiel=Heal passiert nach dem towerdiven WOW Op!Wenn dein Team sehr zurueck ist Xd nutzlos)Was ist denn los mit R,entweder treffst du alle 4 schwache Seite (unmoeglich im teamfight) oder enemy stirbt(eine schwache Seite noetig).Fiora ist immer ein champion ,die gegen den Wind nicht segeln kann?Nach rework hab ich nicht einmal mit der Fiora mein Team in meinem Elobereich(durschnittlichDia 3) carried .OKAY vor patch kann ich sehr einfach mit Fiora andere champions losschlagen(Full ad Riven Apc ohne hourglass Adc ohne guardian angel...)                                                            \nIch finde mannigfaltige Fiora nicht gut.Die kann ihre Position einfach nicht mehr finden.yoho Fiora kann alles(stun! slow! heal! ture damage! sich Verschiebung=flash! alles blockieren innerhalb0.75s=unbesiegbar!)","replies":[]},{"poster":"Who is Taliyah","date":"2015-08-08T22:03:47.461+0000","up_votes":1,"down_votes":0,"body":"Ich habe die neue Fiora in den letzten 2 Tagen ziemlich gespamt. Ich glaube, ich habe neben der Supportrolle jetzt meinen 2. Main gefunden. Fiora macht unglaublich viel spaß jetzt und wenn man sie richtig baut, kriegt sie ihre Ult in einem Teamfight locker durch und macht dennoch enorm viel dmg.","replies":[]}]}