{"poster":"Celebi","date":"2018-12-23T21:34:21.085+0000","title":"Precio de RP en las nubes?","subforum":"Charlas Generales","up_votes":37,"down_votes":3,"body":"Muy buenas tardes invocadores de latinoamerica, queria conocer la opinion de aquellos que compran RP de forma regular especialmente en Argentina ya que soy de alli y queria saber si les parece o no el precio no se si es estandar o es exclusivo de el pais, llevo un rato pensando y hoy dio que me encontre esto mirando unas rebajas http://prntscr.com/lyr2w9 a esto se me ocurre darlo vuelta y pasarlo a dolares http://prntscr.com/lyr38s (350 ars = 9.22 dolares para quien no quiera abrir el link).\r\nLuego abro la tienda de lol y veo que http://prntscr.com/lyr3nm 10 dolares es lo que nos est&aacute; saliendo 1 skin estandar ya que el minimo actual es de 1350 debido a que los dise&ntilde;adores han aumentado la calidad minima de cada skin y ya no se realizan m&aacute;s de 975 hacia abajo.\r\n\r\nTeniendo todo esto en cuenta y entendiendo que es un juego triple A pero de OFERTA al fin y al cabo, que opinan sobre el precio del RP actualmente?","replies":[{"poster":"FlORA TOP","date":"2018-12-23T23:07:30.902+0000","up_votes":19,"down_votes":0,"body":"Mira, yo soy un jugador que estoy desde la season 3. He gastado muchísima cantidad de dinero en este juego. Solo este año gaste aproximadamente 500 ARS por mes. A partir del aumento anterior empecé a consumir menos, unos 200 o 300 porque me parecía que había aumentado bastante y no valía tanto la pena como antes.. Pero cuando vi que volvieron a aumentar no compre más nada. No es tanto el problema de que el precio este en dolares. Si no que te dan una miseria. En mi tienda tengo el skin proyecto fiora al 60% lo que me sale algo de 540 Rp si no me falla la memoria. Para comprarlo tengo que cargar el mínimo que es de 5 dolares (siempre pago con débito) osea 200 pesos argentinos y te dan 750 Rp. Me parece que no vale la pena. Hoy por 200 pesos solamente te compras un skin esos viejos de 520 Rp nada más. Es una vergüenza. Y por más que riot haya hecho esto porque compraban de otras regiones tiene que pensar un poco más en la situación de cada región.. Lamentablemente se nota que están vendiendo menos porque ya sacaron unas \"promociónes\" nuevas que nunca en mi vida las vi desde que juego a esto. Es una lastima para gente que disfrutar de consumir rp. No voy a comprar hasta que hagan una buena reforma a esos precios. Saludos","replies":[{"poster":"WhiteMax","date":"2018-12-24T14:56:44.799+0000","up_votes":2,"down_votes":1,"body":"> Y por más que riot haya hecho esto porque compraban de otras regiones tiene que pensar un poco más en la situación de cada región.. \n\nQue tenia que ver la region si los que van mal son Argentina y Venezuela.{{sticker:sg-lux-2}} ","replies":[{"poster":"FlORA TOP","date":"2018-12-24T17:06:02.469+0000","up_votes":1,"down_votes":0,"body":"Creo que se entiende lo que quiero decir. Tal vez me exprese mal pero el significado es el mismo. Región, país, nación, como quieras entenderlo..","replies":[]}]},{"poster":"Identi","date":"2018-12-24T15:12:38.133+0000","up_votes":1,"down_votes":0,"body":"Yo tambien gastaba algo en los meses, y tengo la skin de 3sh de fuego esa que no se como se llama al 60 % tamb en la tienda y tampoco pienso cargar para comprarla , que se la guarden donde ya saben ! Dependo de los cofres nomas para las skin nomas !","replies":[]}]},{"poster":"Uli con azúcar","date":"2018-12-23T23:13:46.509+0000","up_votes":16,"down_votes":0,"body":"Es una barbaridad lo que cuesta el RP","replies":[]},{"poster":"Martin75","date":"2018-12-23T21:58:52.794+0000","up_votes":15,"down_votes":0,"body":"No compres RP\nAl fin y al cabo los que pierden son (((ellos)))","replies":[{"poster":"Nuke","date":"2018-12-24T01:57:43.920+0000","up_votes":4,"down_votes":14,"body":"Uff si pierden mucho xD\n http://cdn5.upsocl.com/wp-content/uploads/2016/06/12-7.jpg","replies":[{"poster":"IIIIIIIIIIIIIIII","date":"2018-12-24T04:29:01.250+0000","up_votes":2,"down_votes":0,"body":"{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Nuke","date":"2018-12-24T06:32:18.832+0000","up_votes":2,"down_votes":1,"body":"{{sticker:zombie-brand-clap}}","replies":[]}]},{"poster":"LoIo","date":"2018-12-24T15:42:52.923+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nuke,realm=LAS,application-id=v7qsfXsE,discussion-id=gTVF0VQu,comment-id=00020000,timestamp=2018-12-24T01:57:43.920+0000)\n>\n> Uff si pierden mucho xD\n>  http://cdn5.upsocl.com/wp-content/uploads/2016/06/12-7.jpg\n\nNo sé por qué tantos votos negativos a esto si es verdad, no creo que LAS represente ni el 10% de sus ganancias sinceramente.","replies":[{"poster":"Nuke","date":"2018-12-24T17:35:04.207+0000","up_votes":1,"down_votes":0,"body":"Es que ellos quieren sentirse especiales y que realmente están cambiando algo cuando realmente son solo nenes caprichosos llorando en el piso porque no les dan sus dulces xD...","replies":[]}]},{"poster":"Alessa Ghoul","date":"2018-12-24T04:30:40.630+0000","up_votes":1,"down_votes":0,"body":"claro, por eso sacan personal latino en riot despues de perdidas de ingreso , con esto no va a quedar ni skyshock","replies":[{"poster":"Christoph","date":"2018-12-24T17:16:54.915+0000","up_votes":1,"down_votes":0,"body":"Se fueron porque el competitivo no rendía y no iban a tener dos oficinas transmitiendo lo mismo en el mismo idioma para la misma región competitiva, yo quiero que se vayan varios rioters y pongan más competentes, no los caster esos me chupan un huevo al fin y al cabo no todo diferencia","replies":[]},{"poster":"Nuke","date":"2018-12-24T06:03:47.721+0000","up_votes":1,"down_votes":2,"body":"Muchos rioters ya se fueron, Skyshock sería otro más en la lista. Y no se de dónde sacaste lo de que fue por pérdida de ingresos xD...","replies":[]}]}]},{"poster":"WhiteMax","date":"2018-12-24T19:28:29.843+0000","up_votes":1,"down_votes":0,"body":"Es una moneda virtual, no pierden nada. Si la gente les compra bien y sino bueno, al menos esta ahi por si alguno les sigue comprando (y de ultima desahabilitan el juego para los paises que no le aportan nada).","replies":[]}]},{"poster":"StąrDust","date":"2018-12-23T22:24:15.653+0000","up_votes":12,"down_votes":0,"body":"Está muy caro.","replies":[]},{"poster":"Hombre Venenoso","date":"2018-12-23T22:26:27.604+0000","up_votes":13,"down_votes":1,"body":"actualmente prefiero pagarme el vicio de comprar sobres en herathstone que comprar rp en el lol, comprar rp es decir \"ROBAME PORFAVOR\" siempre va a venir alguien diciendo \"no es culpa de riot la devaluacion\" a lo que le respondo, el rp es algo virtual y no tiene perdida como cuando vendes un alfajor, esto es una prueba de riot para ver que tanto pueden cobrar","replies":[{"poster":"Soy Gardel","date":"2018-12-23T23:02:13.664+0000","up_votes":5,"down_votes":22,"body":"????????????????????????????????? \"no tienen perdida\" sabes donde esta la perida? En una persona que viene de Europa, se transfiere a las, compra lo que para el son 100 euros de rp (5000 pesos Argentinos) que a nosotros nos seria inimaginable gastar esa plata en RP de una sentada, pero para ellos no es mucho, y vuelven a Europa, y que pasa como resultado de esto? Una de la regiones mas grandes y que mas ganancias le genera a Riot le genera por lo menos el 50% de ingresos, vos sos un pibe que no entiende mucho de numeros, o sos tan terco que no queres entender que SI hay motivo para hacer ese cambio. Y ojo, despues del cambio del RP no pienso comprar rp en mi puta vida de vuelta, mis dolares no se tocan, pero se entender el motivo. \nSalu69.","replies":[{"poster":"Hayato","date":"2018-12-24T02:35:12.380+0000","up_votes":12,"down_votes":0,"body":"> [{quoted}](name=Soy Gardel,realm=LAS,application-id=v7qsfXsE,discussion-id=gTVF0VQu,comment-id=00040000,timestamp=2018-12-23T23:02:13.664+0000)\n>\n> ????????????????????????????????? &quot;no tienen perdida&quot; sabes donde esta la perida? En una persona que viene de Europa, se transfiere a las, compra lo que para el son 100 euros de rp (5000 pesos Argentinos) que a nosotros nos seria inimaginable gastar esa plata en RP de una sentada, pero para ellos no es mucho, y vuelven a Europa, y que pasa como resultado de esto? Una de la regiones mas grandes y que mas ganancias le genera a Riot le genera por lo menos el 50% de ingresos, vos sos un pibe que no entiende mucho de numeros, o sos tan terco que no queres entender que SI hay motivo para hacer ese cambio. Y ojo, despues del cambio del RP no pienso comprar rp en mi puta vida de vuelta, mis dolares no se tocan, pero se entender el motivo. \n> Salu69.\n\nSabes como se soluciona eso? Haciendo que la tienda sea por pais y no abierta. Pones que los precios de Arg. los pague solamente gente de Arg. como hacen steam y blizzard y listo, no aumentás los precios y todos contentos.","replies":[]},{"poster":"Alessa Ghoul","date":"2018-12-24T04:32:22.164+0000","up_votes":4,"down_votes":0,"body":"Jajajaja nadie hace eso, parece que a vos te pagan por hacerte el economista pero no te sale, se piensa que es una pelicula de esas re flasheras , mira si un europeo va a pagar tanto para pasarse en argentina, le cuesta lo mismo con el pase de region, no seas tan niño rata","replies":[{"poster":"AdcInANutshell","date":"2018-12-24T06:37:22.696+0000","up_votes":1,"down_votes":2,"body":"acaso no viste el post de un jugador de EUW mostrando esta idea de pasarse a LAS para conseguir rp barato e incluso volver a su server teniendo ganancias?","replies":[{"poster":"Nabuze","date":"2018-12-24T16:28:04.718+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MaxDLoL,realm=LAS,application-id=v7qsfXsE,discussion-id=gTVF0VQu,comment-id=0004000000030001,timestamp=2018-12-24T06:37:22.696+0000)\n>\n> acaso no viste el post de un jugador de EUW mostrando esta idea de pasarse a LAS para conseguir rp barato e incluso volver a su server teniendo ganancias?\n\nNadie tiene cuenta en EUW para ir y bardearlo al creador de ese post (?","replies":[]}]}]}]}]},{"poster":"ToxicRunner","date":"2018-12-23T21:38:29.804+0000","up_votes":14,"down_votes":5,"body":"Te voy dar la respuesta que todos dan.\nComprar Skins no es obligatorio, no te otorga ninguna ventaja.\nSi tú prefieres comprarte un juego triple A puedes perfectamente hacerlo, incluso lo disfrutarás mucho más que el skin.\nYo dejé de comprar Skins por lo mismo.","replies":[]},{"poster":"Mascheranox","date":"2018-12-23T23:18:52.812+0000","up_votes":8,"down_votes":0,"body":"por las nubes es poco, se fue al carajo","replies":[]},{"poster":"SpectreChazer","date":"2018-12-23T21:45:13.158+0000","up_votes":9,"down_votes":1,"body":"sale casi 200 pesos 750 de Rp...","replies":[]},{"poster":"VAK Bruno","date":"2018-12-24T00:22:30.561+0000","up_votes":8,"down_votes":1,"body":"Si esta caro , lo gracioso es ver como estan desesperados por que nadie les compra ya , estan sacando videos en todos lados de como cargar rp , ahora sacan unas tarjetas coleccionables etc . Es gracioso por que seguro que RIOT LAS  no puede bajar los preciosos por ordenes de NA o por que simplemente no quieren pero estan subestimando a los fans , poco a poco a riot le va  a pasar lo mismo que a blizzard..","replies":[]},{"poster":"Little Tiny","date":"2018-12-24T03:33:07.967+0000","up_votes":5,"down_votes":1,"body":"Yo opino que el precio **en dolares** esta bien, ahora, ellos a sabiendas que nuestra moneda pasa por un mal momento nos clavaron los dolares que estan practicamente 40 ARS por dolar.\nNo es que el precio de RP este muy alto, nuestra moneda esta por debajo de los suelos y ellos quieren exprimirnos lo mas que puedan.","replies":[]},{"poster":"El Ninja Purpura","date":"2018-12-24T12:44:07.438+0000","up_votes":1,"down_votes":0,"body":"Buenas, yo al igual que muchos dejamos de comprar es carisimo, teniendo en cuenta que algunos skins te salen lo mismo que un juego completo, por mi parte dejare de comprar y mira que el dia que me entere que subian mande un correo al soporte para saber cuanta plata habia gastado hasta ese momento y era mucha! tengo 886 skins para mi los skins eran mis figuritas queria llenar el album pero lo voy a dejar en espera","replies":[{"poster":"Identi","date":"2018-12-24T15:03:29.299+0000","up_votes":3,"down_votes":0,"body":"Yo tambien deje de comprar. Le di prioridad a mejorar mi hardware y a comprar juegos nuevos. Que basicamente en oferta estan casi igual que una skin !","replies":[]}]},{"poster":"Gogeta SSJ Blue","date":"2018-12-23T23:44:50.522+0000","up_votes":3,"down_votes":0,"body":"Pero encima ya no solo el precio carísimo, si no que casi ni aumentaron la cantidad de rp que te dan. \nCuando aumentaron en Agosto por 1.600$ te daban 10.500 más o menos, ahora el paquete más caro sale 80 dólares y te da 14.500 aprox entonces como el dólar en Argentina está entre 37 y 38 pesos: 80 x 37 = 2.960; 80 x 38 = 3.040. O sea, estas pagando a día de hoy 1.300 pesos más de lo que pagabas por el anterior paquete mas caro y solamente te dan 4.000 rp más, es bastante estupido.","replies":[{"poster":"Identi","date":"2018-12-24T15:09:37.801+0000","up_votes":1,"down_votes":0,"body":"Esta a 39 pa !","replies":[]}]},{"poster":"Holox1","date":"2018-12-24T14:52:14.107+0000","up_votes":2,"down_votes":0,"body":"Bueno no es culpa de Riot que argentina sea una mierda y tengamos un presidente de mierda.\n\nSi el dolar baja el rp sería mas barato.","replies":[{"poster":"Identi","date":"2018-12-24T15:02:08.550+0000","up_votes":2,"down_votes":0,"body":"Pero si lo pones en contraparte , no deja de salir mas caro que un puto juego que tiene records en ventas !","replies":[]},{"poster":"SBL Nightel","date":"2018-12-24T22:52:14.896+0000","up_votes":1,"down_votes":0,"body":"Creo que habria que dejar de justificar con lo de argentina es una mierda. Si, la economia Argentina actualmente esta muy mal pero es solo el 50% del problema. La otra mitad del problema es de Riot, como el poder adquisitivo de aca es bajo, si aumentas a valor dolar la gente va a dejar de comprar por lo que el aumento no justifica. Si el aumento hubiera sido menor no hubieran perdido a tanta gente por lo que estoy casi 100% seguro que ganarian mas dinero de lo que lo hacen con este aumento.","replies":[]},{"poster":"Hayato","date":"2018-12-24T14:55:39.865+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Holox1,realm=LAS,application-id=v7qsfXsE,discussion-id=gTVF0VQu,comment-id=0018,timestamp=2018-12-24T14:52:14.107+0000)\n>\n> Bueno no es culpa de Riot que argentina sea una mierda y tengamos un presidente de mierda.\n> \n> Si el dolar baja el rp sería mas barato.\n\nTotalmente! Felices Fiestas!","replies":[]}]},{"poster":"Identi","date":"2018-12-24T15:00:59.855+0000","up_votes":2,"down_votes":0,"body":"La verdad que no le habia dado bola. Hace tiempo que no recargo. Pero seamos sincero estamos poniendo en contra parte a GTA V contra una skin , la verdad que estan demasiado caras , deberían por lo menos valer la mitad ! Es un puto juego el otro, esto una misera skin !","replies":[]},{"poster":"bow down","date":"2018-12-24T00:19:37.163+0000","up_votes":2,"down_votes":0,"body":"Piensa que al menos puedes ganar skins de las cajas hextech. Antes ni en pe2. Todo se compraba.","replies":[{"poster":"Identi","date":"2018-12-24T15:08:43.342+0000","up_votes":1,"down_votes":0,"body":"Si ultimamente apuesto a las cajas nomas, ya ni compro RP !","replies":[]}]},{"poster":"Diosmo","date":"2018-12-23T23:13:04.821+0000","up_votes":2,"down_votes":0,"body":"+1","replies":[]},{"poster":"Winter Lion","date":"2018-12-24T04:36:28.109+0000","up_votes":3,"down_votes":1,"body":"es mas worth comprar el juego que la skin, tambien pase por el mismo dilema. El precio del rp en argentina se va a mantener incomprable por años, hasta que la situacion economica del pais mejore","replies":[]},{"poster":"Tur1nTur4mb4r ","date":"2018-12-24T02:12:01.546+0000","up_votes":2,"down_votes":1,"body":"El rp no esta por las nubes, lo que esta por las nubes es el dolar en nuestro pais y ahi el conflicto","replies":[{"poster":"Hayato","date":"2018-12-24T02:36:08.196+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Tur1nTur4mb4r ,realm=LAS,application-id=v7qsfXsE,discussion-id=gTVF0VQu,comment-id=000e,timestamp=2018-12-24T02:12:01.546+0000)\n>\n> El rp no esta por las nubes, lo que esta por las nubes es el dolar en nuestro pais y ahi el conflicto\n\nEn realidad el dolar no esta por las nubes, 1 dolar es un dolar.. l oqque esta por el piso es nuestra moneda que perdió poder adquisitvo frente al dolar.","replies":[{"poster":"Tur1nTur4mb4r ","date":"2018-12-24T14:27:09.876+0000","up_votes":1,"down_votes":0,"body":"Lo que se entiende es que el valor del dólar está por las nubes, lo que a nosotros nos cuesta comprar un 1dlr. Podría haberlo expresado de otra manera quizás, pero bueno la expresión es asi","replies":[]}]}]},{"poster":"OzymandiasV","date":"2018-12-24T00:53:32.968+0000","up_votes":3,"down_votes":1,"body":"Se fue todo a la mierda por la devaluación, la economía Argentina está tan mal como en el 2001.Antes de los aumentos compraba 7000 o 12000 rp, ahora con suerte compro 4000.\nSi no fuese por el aguinaldo y el bono de fin de año no hubiese comprado.\nDe ahora en más,si compro, será alguna skin puntual.Antes cargaba para comprar muchos cofres y buscar skins de legado.Por suerte, tengo el 90% de los skins de los champ que maineo.","replies":[]},{"poster":"Fenrito","date":"2018-12-24T18:31:25.240+0000","up_votes":1,"down_votes":0,"body":"Antes compraba packs de marcos y las skines ni bien salian, ahora creo que es mejor aguantarme a la oferta temprana y ver si se puede desbloquear el marco con alguna misión o algo\n\nHay que mencionar que otro problema es que ahora sacan pura skin de 1350 para arriba y cuando hacen skinsa mas baratas las hacen sin ganas como evelyn luna sangrienta. 10 dolares una skin, si no es muy buena no vale la pena","replies":[]},{"poster":"Visoka","date":"2018-12-24T18:10:46.935+0000","up_votes":1,"down_votes":0,"body":"Se supone que subieron los precios en argentina por la cantidad de chilenos que al comprar rp cambiaba el país al de arg y salía mucho mas barato, pero hace relativamente poco eliminaron la opción de argentina al cambiar el país pero mantuvieron los precios los muy garcas","replies":[]},{"poster":"PasoPackXHonores","date":"2018-12-24T17:02:48.060+0000","up_votes":1,"down_votes":0,"body":"Obvio que esta carisimo. Por suerte me sacó las ganas de jugar para siempre (? va 1 mes que no juego xD) o he jugado 3 partidas en el mes. Solo entro a revisar el foro. Buen trabajo RITO","replies":[]},{"poster":"Alessa Ghoul","date":"2018-12-24T04:28:23.891+0000","up_votes":1,"down_votes":0,"body":"Sip, se fue mucho el RP yo tenia plata para comprar cosas ahora en navidad pero como esta tan caro decidi comprarme otras cosas, por ejemplo un skin de 1k para arriba te sale alrededor de 1000$ , prefiero gastarme esa plata en un juego que en un skin , no vale la pena comprar rp estando tan caro, ya me compre un monton de juegos en oferta que estan buenisimos antes de gastar la misma plata en 3 o 4 skin que la verdad al precio que estan ni se disfruta tenerlos","replies":[{"poster":"Identi","date":"2018-12-24T15:05:44.388+0000","up_votes":1,"down_votes":0,"body":"Yo tambien . Me compre el guild of wards 2 con las expansiones con ese precio !","replies":[]},{"poster":"Hayato","date":"2018-12-24T14:55:06.337+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alessa Ghoul,realm=LAS,application-id=v7qsfXsE,discussion-id=gTVF0VQu,comment-id=0013,timestamp=2018-12-24T04:28:23.891+0000)\n>\n> Sip, se fue mucho el RP yo tenia plata para comprar cosas ahora en navidad pero como esta tan caro decidi comprarme otras cosas, por ejemplo un skin de 1k para arriba te sale alrededor de 1000$ , prefiero gastarme esa plata en un juego que en un skin , no vale la pena comprar rp estando tan caro, ya me compre un monton de juegos en oferta que estan buenisimos antes de gastar la misma plata en 3 o 4 skin que la verdad al precio que estan ni se disfruta tenerlos\n\nObvio, solo queria comentar que pudieron haberlo solucionado de forma menos traumatica. Felices Fiestas!","replies":[]}]}]}