{"poster":"Rich Lucky","date":"2015-02-11T05:58:55.383+0000","title":"Nadie le da las gracias a Rito","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"Como bien lo dice el titulo ya nadie le da las gracias a rito puras discuciones por el estado del server o porq el ping, a la mas minima cosa ya la toman como un gran problema, yo imagino todo el esfuerso que deben hacer los trabajadores de riot para darnos la experiencia de juego optima y no entiendo como cada dia ai mas personas que insultan al lol o incluso no valoran el esfuerzo y la dedicacion que tienen hacia nosotros los trabajadores de riot, nos traen videos, skins, personajes, modos de juegos, grandes historias que dia a dia me hace querer seguir jugando, este juego me cambio la vida y creo que a muchos tambien. a estar madrugadas teniendo partidas de mas de 1 hora o esas partidas que perdias pero por dentro decias que gran partida, a conocer gente tener amistades. me enceño muchas cosas como el trabajo en equipo o el esfuerzo para progresar y en cada partida aprender algo. creo que deverian haber mas gracias y menos insultos para una mejor comunidad...\n\nen fin Gracias a Riot Por Todo Esfuerzo y Dedicacion Que Se Toman\npor ultimo queria dejarles este video que hace no mucho lo vi y creo que muchos se van a indentificar:\nhttps://www.youtube.com/watch?v=t9BG2b0ONS4\n\npor favor gente volvamos a una comunidad como la de antes","replies":[{"poster":"Fraguita","date":"2015-02-11T07:06:03.476+0000","up_votes":1,"down_votes":0,"body":"Ese video no habla de league of legends. Asi es la vida. No tiene nada que ver. Esto es un juego. Jugarlo te divierte y te distrae. No te emociona o te hace mas feliz. Las personas y dios nos hacen felices. Esto es solo un juego. Pero en fin esta muy que lo veas asi. Pero ese video no habla de lol habla de cambiar el mundo. Cambiando vos. Jugando a la computadora te vas a divertir no vas a cambiar el mundo. De todas formas gracias por publicarlo","replies":[]},{"poster":"El Capitan Moco","date":"2015-02-11T06:43:05.323+0000","up_votes":1,"down_votes":0,"body":"emm lo de dar las gracias esta demas, pero lo de mejorar la comunidad rata de LAS tenes razon pibe.. el servidor lo hace la gente.","replies":[]},{"poster":"RITO BRONZODIA V","date":"2015-02-11T06:33:10.491+0000","up_votes":1,"down_votes":0,"body":"no funciona swain AD es mejor teemo AD pero no es recomendable ya que te flamean","replies":[]},{"poster":"Rich Lucky","date":"2015-02-11T06:22:56.077+0000","up_votes":1,"down_votes":0,"body":"solo pones el enlace amigo","replies":[{"poster":"Devoto Lunari","date":"2015-02-11T06:25:59.810+0000","up_votes":1,"down_votes":0,"body":"gracias","replies":[]}]},{"poster":"Devoto Lunari","date":"2015-02-11T06:03:14.985+0000","up_votes":1,"down_votes":0,"body":"como colocaste el vídeo, y sobre lo del post si tienes razón......pero enserio ¿como lo hiciste?","replies":[]},{"poster":"Lady Galor","date":"2015-02-11T06:02:05.291+0000","up_votes":1,"down_votes":0,"body":"Les das asilo en un servidor que la mayor parte del tiempo esta bien, pero se cae durante hora y media y la gente lo odia para siempre.","replies":[]}]}