{"poster":"BronzaKaiser","date":"2015-08-19T17:06:31.352+0000","title":"Sobre el caso de Mordekaiser y Riot - Parche 5.16","subforum":"Charlas Generales","up_votes":10,"down_votes":2,"body":"Antes que nada, esto es con mucho respeto. Es una opinión sobre lo sucedido con {{champion:82}} , y como ha impactado a la comunidad.\n\nAhora vamos a ver. Me est&aacute;n diciendo que NOS OBLIGAN a usar a Morde en bot lane como un ADC? Porque con esto, Mordekaiser en solo lane ya es medianamente obsoleto &iquest;saben?. Esto ya no es algo como: \"Con este cambio queremos que Mordekaiser se vea no solo en TOP y Mid sino que tambi&eacute;n como ADC\". No. Con esto ya en TOP y Mid nuestro Morde se fu&eacute; a la B, dado a que no tendr&aacute;s todo el potencial de tu kit de habilidades disponibles (el mayor de los errores, la W en general).\n\n**&iquest;Qu&eacute; es lo que dec&iacute;an hace unos parches atr&aacute;s?** Cito textual: \"_&iquest;MORDEKAISER CON DA&Ntilde;O DE ATAQUE? NI PENSARLO_\" - Parche 5.4 en la secci&oacute;n de balance de Mordekaiser. \n&iquest;Es alguna clase de burla?. Ahora bien, &iquest;que dec&iacute;an con respecto a la jugabilidad de los Colosos? Se supone que iban a cambiar en cierto modo la jugabilidad de los campeones sin desperfilar el concepto del mismo. En pocas palabras, el rework iba a surtir un fuerte efecto sin cambiar la personalidad del campe&oacute;n, &iquest;o no? &iquest;Me est&aacute;n diciendo que Mordekaiser siempre necesit&oacute; de una ni&ntilde;era para infligir da&ntilde;o?. Con Garen y Darius fue magn&iacute;fico, perfecto: Garen reparte Justicia (literalmente), mientras que Darius inflige dolor y sed de sangre (nuevamente, literal). Pero Mordekaiser, un guerrero tit&aacute;n fr&iacute;o, sin coraz&oacute;n, despiadado, solitario... ahora necesita de un amiguito para poder atacar e infligir dolor y agon&iacute;a a sus enemigos. Vamos que no me lo creo.\n\nQuiero adem&aacute;s refrescar la memoria. Hace 3 meses atr&aacute;s, Riot Gaussrik (que he de decir, es un excelente Rioter, sin desmerecer al resto por supuesto) public&oacute; un interesante tema el cual ten&iacute;a por t&iacute;tulo: \"**Hablemos del Meta!**\" (Link: http://boards.las.leagueoflegends.com/es/c/charlas-generales/79G8gouo-hablemos-del-meta )... hasta ah&iacute; todo bien. Pero leamos lo que escribe: \"_Riot no controla el Meta_\"... antes que nada, claramente explica muchas cosas como que los jugadores lo influencian, que puede no estar correcto. Pero al final, puede que Riot SI controla el meta. Si RIOT no lo controlase... &iquest;c&oacute;mo se puede explicar el cambio del cl&aacute;sico Mordekaiser luchador top/mid a la l&iacute;nea... *se r&iacute;e levemente* bot? Dado a su cambio, reitero, nos est&aacute;n OBLIGANDO a jugar a un campe&oacute;n para una l&iacute;nea que muchos NO quieren jugar. Por lo tanto, nos EXIGEN romper el meta. Entonces, &iquest;qu&eacute; fue ese post? Nuevamente con esto, puede que se est&eacute;n contradiciendo (que novedad). \n\nMuchos quiz&aacute;s no lo saben... &iquest;pero saben que sucedi&oacute; finalmente con el feedback de Mordekaiser en el PBE? **CertainlyT**, la mente maligna detr&aacute;s de este rid&iacute;culo cambio, lo dejo tirado.\n( Link: http://boards.pbe.leagueoflegends.com/en/c/champions-gameplay-feedback/KhcvQBlG-mordekaiser-change-summary-feedback-thread ).\nNo respondi&oacute; m&aacute;s. &iquest;Por qu&eacute;? -39 votos siendo el tema peor valorado, m&aacute;s de 400 comentarios dici&eacute;ndole que lo que est&aacute; haciendo no es correcto, que destruir&aacute; a Mordekaiser y que no quieren verse obligados a usar a Morde de ADC. &iquest;Que hizo &eacute;l? M&aacute;s all&aacute; de limitarse a decir algo como: \"Este cambio debi&oacute; ocurrir, yo tengo la raz&oacute;n como siempre y ustedes no\", parti&oacute;, se fue del hilo y no volvi&oacute; m&aacute;s.\n\n&iquest;Lo gracioso? En un tema de NA, corri&oacute; el rumor de que volvi&oacute; a escribir diciendo que estaba triste por las quejas de los usuarios, por eso dejo el hilo y hasta ahora no ha respondido nada m&aacute;s acerca del rework de Mordekaiser. Si al final, fue **Morello** quien salto a la palestra a publicar un tema en donde explicaba el porqu&eacute; del cambi&oacute;, y que estar&iacute;an escuchando las quejas de los usuarios. Pero haber... aqu&iacute; es en donde me agarro la cabeza y pienso de  nuevo: Prometen escuchar la quejas de los usuarios no?... &iexcl;&iexcl;&iquest;&iquest;PERO Y LAS QUEJAS QUE YA SE PUBLICARON EN EL PBE??!! Lo que pienso es que claro, quieren ver m&aacute;s opiniones primero antes de hacer algo, dado a que no todos tienen acceso al PBE. Pero de igual manera deber&iacute;an al menos tener un poco de m&aacute;s inter&eacute;s en esos reportes de feedback, por algo supongo que los que tienen el acceso al mismo, han de ser jugadores profesionales o bien, jugadores que entienden mejor la manera de aplicar una jugabilidad a algun campe&oacute;n en particular. \n\nHay un sin fin de post del error cometido con Mordekaiser tanto en los foros de NA, EUNE, EUW (me limite a publicar algunos solamente de NA) y PBE, que esa es una direcci&oacute;n err&oacute;nea... (Algunos son chistosos, pero son la realidad).\n1) http://boards.na.leagueoflegends.com/en/c/gameplay-balance/AFgsaz6L-certainlyts-reasoning-behind-forcing-morde-into-bot\n2) http://boards.na.leagueoflegends.com/en/c/gameplay-balance/AxpyeAIV-we-want-morde-to-be-picked-instead-of-an-ad-carry\n3) http://boards.na.leagueoflegends.com/en/c/GD/aVxPj9R8-certainlyt-made-the-new-mordekaiser\n4) http://boards.na.leagueoflegends.com/en/c/gameplay-balance/6UQOmVTv-we-should-rework-every-champion-like-certainty-t-reworked-mordekaiser\n\nEstos son m&aacute;s interesantes dado a diversos puntos:\n5) http://boards.na.leagueoflegends.com/en/c/gameplay-balance/s1JauvO3-mordekaisers-changes-completely-destroy-his-solo-lane-potential\n6) http://boards.na.leagueoflegends.com/en/c/gameplay-balance/PkrLGiJo-problems-with-mordekaisers-power-budget-and-how-to-fix-it\n\nY este otro, figurando que si pens&aacute;bamos que RIOT no pod&iacute;a empeorar las cosas como lo hizo con el parche 5.4, nos lanzan el 5.16: \n7) http://boards.na.leagueoflegends.com/en/c/gameplay-balance/n1KJiBUl-516-looks-like-literally-one-the-dumbest-patches-in-the-history-of-the-game-item-change-analysis\n\n&iquest;Y quieren saber una cosa? En ninguno aparece un Rioter... es m&aacute;s ni siquiera el due&ntilde;o bestia de este infame, irrisorio, rid&iacute;culo, nefasto rework, CertainlyT, hace acto de presencia.\n\nQu&eacute; m&aacute;s puedo decir... &iquest;mataron a {{champion:82}} ? Si. &iquest;Riot lee los feedback? Cuando los felicitan S&iacute; (rework de Gangplank), cuando se mandan una embarrada y no la reconocen, pues No (rework de Mordekaiser).\n\nCuando part&iacute; escribiendo esto, tuve que apretar los dientes para no levantarlos y bajarlos a improperios (lo admito). Aunque lo s&eacute;, la culpa no es de ustedes como Rioters de LAS, sino es en NA en donde segun parece, est&aacute; el problema. Pero el coraje se me paso, porque ya di por perdido a Mordekaiser. Yo en particular no lo podr&eacute; volver a usar nunca m&aacute;s... han de decir: \"_Pero dale una oportunidad en la bot lane_\". Pues NO. Para bot lane ya tengo a mi campe&oacute;n favorito que es Ezreal, Graves y la negrura de Lucian. En Top mi campe&oacute;n favorito era Mordekaiser, Malphite y Shen, ahora lo son solo Malphite y Shen (hasta que CertainlyT decida meterles alg&uacute;n rework).\n\nBueno, eso es todo. Si llegaron hasta aqu&iacute; les agradezco que se hayan dado el tiempo de leer este walltext.\nEs una opini&oacute;n m&iacute;a tambi&eacute;n, adem&aacute;s del como he observado durante estas semanas la negativa aceptaci&oacute;n de Morde ADC, y pese a ello, Riot pues parece que le import&oacute; entre poco y nada. &iquest;Triste verdad? GG WP {{champion:82}} .\n\nSaludos!","replies":[{"poster":"Neo Gaussrik","date":"2015-08-19T19:54:15.368+0000","up_votes":17,"down_votes":2,"body":"Hola, Carlosman!\n\nTu muro de texto es un tanto intimidante, pero tratemos de ir punto a punto. :)\n\n> Me están diciendo que NOS OBLIGAN a usar a Morde en bot lane como un ADC?\n\nEl nerf a la W ciertamente lo hace mucho mas debil como mid. Tendria que jugarlo a ver si es completamente inutil, pero la verdad la W vieja no era muy util en la fase de lineas igual.\n\n> Pero Mordekaiser, un guerrero titán frío, sin corazón, despiadado, solitario... ahora necesita de un amiguito para poder atacar e infligir dolor y agonía a sus enemigos. Vamos que no me lo creo.\n\nHm.\n\nEl problema es que Mordekaiser nunca fue un campeon \"completo\"; siempre ha necesitado la ayuda de alguien mas para hacer lo suyo.\n\nCada vez que Morde ha llegado a un nivel de poder para ser independiente (Deathfire Grasp?), la falta de interactividad de su kit de habilidades nos ha llevado a nerfearlo.\n\nEntonces, en lugar de seguir pretendiendo que Morde no necesita un amiguito, el equipo decidio simplemente aceptar la realidad y darle a Morde la capacidad de ser funcional junto con un aliado que \"complete\" su kit.\n\n> Pero leamos lo que escribe: \"Riot no controla el Meta\"... antes que nada, claramente explica muchas cosas como que los jugadores lo influencian, que puede no estar correcto. Pero al final, puede que Riot SI controla el meta. Si RIOT no lo controlase... ¿cómo se puede explicar el cambio del clásico Mordekaiser luchador top/mid a la línea... se ríe levemente bot?\n\nNo creo que los dos hechos sean contradictorios.\n\nCiertamente podemos balancear a Morde para que vaya bot, pero de ahi a que sea popular y que hayan jugadores en efecto usandolo (y ganando) con un duo AP-support en bot es otra cosa.\n\nSi resulta que esta OP, es posible que popularize a ADCs que pueden ir en otros carriles (Quinn, Varus?). Si resulta estar debil, el meta no se da por enterado.\n\nObviamente Riot tiene la capacidad de, digamos, hacer que un campeon no sea elegido nunca (reduce todas sus estadisticas a 0 y nadie lo usara excepto trolls), pero a la vez, no somos capaces de hacer que la comunidad juegue campeones que estan fuertes (e.g. Sejuani en S4) hasta que pasa algo que cambie su opinion.\n\nEn otras palabras, el Meta es un conjunto de creencias, y estas creencias se basan en algunas cosas que controlamos (como el balance objetivo del juego) y otras que no (como la popularidad de distintos campeones o las modas que se dan).\n\n> ¿Y quieren saber una cosa? En ninguno aparece un Rioter... es más ni siquiera el dueño bestia de este infame, irrisorio, ridículo, nefasto rework, CertainlyT, hace acto de presencia.\n\nY bien, CertainlyT ha tenido una experiencia muy negativa comunicandose directamente con la comunidad. Esta haciendo algo riesgoso y los jugadores son aversos al cambio, asi que entiendo por que preferiria evitar comunicarse al respecto.\n\nAhora, dicho esto, no significa que los Rioters, como conjunto, no estemos dispuestos a hablar de Morde.\n\n> Qué más puedo decir... ¿mataron a  ? Si. ¿Riot lee los feedback? Cuando los felicitan Sí (rework de Gangplank), cuando se mandan una embarrada y no la reconocen, pues No (rework de Mordekaiser).\n\nHay una diferencia entre leer feedback y regirse por el feedback. Nuestro equipo de diseño sabe bien como hacer un excelente juego, y a veces tienen ideas que inmediatamente son apreciadas por la comunidad (ver: nuevo Sion), y otras que son recibidas de manera muy negativa (ver: nueva Fiora), y en algunas cosas estamos dispuestos a ceder (ver: arte de nueva Fiora), y en otras no.\n\nLeague of Legends fue creado desafiando el conocimiento convencional (fijate! Esta en nuestro manifesto: http://www.riotgames.com/riot-manifesto ), asi que en efecto hay situaciones en las que genuinamente creemos saber lo que estamos haciendo y estamos dispuestos a tomar un riesgo.\n\nY bien, si resulta que despues de intentarlo, el nuevo Morde resulta ser un rotundo fracaso, tambien tenemos la humildad para aceptar que nos equivocamos e intentar de nuevo.\n\nPero te pediria que lo pruebes antes de dar tu sentencia.","replies":[{"poster":"BronzaKaiser","date":"2015-08-19T20:46:55.243+0000","up_votes":6,"down_votes":0,"body":"Muchas gracias por responder Guassrik. Ya tuve la oportunidad de probarlo en el PBE, y pues sinceramente a mí (en particular yo) no lo veo. \nPero sin ir más lejos, y como bien dices: Habrá que esperar que sucede con Morde. \n\nPor otro lado, no quería hacer un muro de texto \"intimidante\", lo siento mucho! Es que como dije más abajo, comence a escribirlo enfurecido, pero conforme iba avanzando se me pasaba por lo mismo, la resignación de despedir a mi tan querido Morde Top.\n\nTe admiro porque siempre estás ahí pendiente xD! Cada vez que te leo te imagino con una sonrisa indeleble frente al monitor. Si es que no te imagino enojado nunca!\nSaludos! y reitero mi gratitud por darte el tiempo de leer esto!","replies":[{"poster":"Neo Gaussrik","date":"2015-08-19T21:05:11.481+0000","up_votes":3,"down_votes":0,"body":"Un gusto! :) Seguro hablaremos de nuevo una vez que salga el parche!","replies":[]}]},{"poster":"Revolución","date":"2015-08-19T20:03:18.642+0000","up_votes":1,"down_votes":0,"body":"hago bien en esperar un \"Poder oculto: Mordekaiser\" en los próximos días?","replies":[{"poster":"Neo Gaussrik","date":"2015-08-19T20:05:43.536+0000","up_votes":4,"down_votes":0,"body":":)\n\nQue bueno ver un fan de Poder Oculto. :D\n\nLa verdad, despues de los primeros 3, estoy re-evaluando el impacto de los articulos para tratar que los siguientes sean mejores, asi que puede pasar algun tiempo antes del siguiente Poder Oculto.\n\nYa veras varios articulos nuevo del estilo pronto! (Aunque no acerca de Morde aun, ya que yo mismo no domino el nuevo Morde!)","replies":[]}]},{"poster":"Elbaccio","date":"2015-08-19T20:20:16.582+0000","up_votes":3,"down_votes":0,"body":"Con todo el respeto, que la W vieja no era muy util??, encerio???? quiero creer y suponer que jugaste a mordekaiser gaussrik. Porque esa w se la podia meter a un minion y de paso te quedaba a ti, y podias ir desgastando al enemigo. No soy un main mordekaiser, pero creo que se les va la pinza a veces. Aparte esa W servia cuando tenias que quedarte a melee. Quizas tenemos distintas definiciones de \"utilidad\", ademas en la fase de linea era bueno si al menos sabias jugarlo un poco. Era un campeon de un juego mas tactico, y no de comprar un objeto, apretar 3 teclas y leer el anuncio\" has matado a un enemigo\". Solo espero que se den cuenta de los espantoso que hicieron con mordekaiser, y se vean forzados a sacar un parche solo para reparlo, y leer \"Lo sentimos se nos fue la mano con el rework de morde, se los devolvemos como estaba\"","replies":[{"poster":"Neo Gaussrik","date":"2015-08-19T21:08:08.890+0000","up_votes":2,"down_votes":0,"body":"Si, claro que jugue a Mordekaiser. Fue mi main por algun tiempo antes de sacar a bardo.\n\nEl truquito de tirarle la W a un subdito para pasarle daño a un enemigo era util contra yasuo en particular (ideal para quitarle el escudo), pero sobreestimas el daño; asumiendo que el oponente se sale de contacto con el subdito de inmediato, es raro que pase mas daño que la vida que te cuesta el lanzar la W.\n\nPrincipalmente, en la fase de lineas, se usaba para cargar tu escudo con daño a los subditos, pero esto es compensado por la mejorada generacion de escudo de sus otras habilidades.\n\nAntes que suponer que no sabemos lo que estamos haciendo, por que no partes asumiendo que nuestros diseñadores entienden el juego y pruebas los cambios primero? No garantizo que te guste, pero al menos podras tener una opinion mas informada. :)","replies":[{"poster":"sebaplay UY","date":"2015-08-19T22:19:22.717+0000","up_votes":2,"down_votes":0,"body":"de echo era una habilidad que se puede usar para zonear al rival debido a que los mele deben estar a ''mele'' para farmear yo creo que erraron con el cambio , en mi opinión cambiar una habilidad como podría ser la w y darle un dash o un aumento de movilidad era lo idóneo pero claro es el juego de riot games y ellos deciden como cambiarlo nosotros somos guías en que le gusta y que no a la comunidad","replies":[]},{"poster":"Elbaccio","date":"2015-08-20T03:05:35.456+0000","up_votes":1,"down_votes":0,"body":"He visto los cambios en el pbe Gaussrik y de verdad no me han gustado,  vi varias partidas para ver si cambiaba mi opinion. Pero no, por eso fue que decidi lanzar el comentario de arriba. Es cierto que sus diseñadores entienden el juego,  es cierto que el campeon tiene carencias respecto a otros mid laners o top laners, pero creo que este rework que le han puesto no a sido lo mas acertado. Quizas algun stunt o algo de moviento le habria venido mas en cuenta, pero bueno es cuestion de esperar que lancen el parche, y ver que es lo dice el resto de la gente. Desde ya gracias por responder y disculpa si el primer comentario sono a soberbia o de rabieta.","replies":[]},{"poster":"HizoKas","date":"2015-08-23T06:42:02.129+0000","up_votes":0,"down_votes":0,"body":"Hay descontento señores por lo que le an hecho a mordekaiser. Tomen en cuenta la opinion de sus usuarios y no sean tan arbitrarios, ya lo probe varias veces y lo e usado desde comienzos de la season 3 y siempre fui muy habil y bueno con el sin quejarme jamas de la falta de CC ni mucho menos. Sencillamente mordekaiser a perdido su independencia, cualquier ADC abajo podria valerse solo en caso de un suport AFK o en el caso de un suport que trolee por el mapa, pero mordekaiser es sencillamente inservible jugandolo solo. Es mlesto para un veterano de mordekaiser tener que estar dependiendo de un compañero para usar su W y su E pega una burla. Si bien su Q pega arto de aqui a que lleges vivo a tu oponente sin la ayuda de alguien es una gran molestia por que en el juego uno nunca estara acompañado siempre y uno tambien debe poder valerse solo. Los equipos son fuertes si hay coperacion entre sus miembros para que alla un buen juego en equipo, pero para que un equipo tambien sea bueno cada jugador debe poder valerse y tener las herramientas para arreglarselas solo sin ser un estorbo para sus compañeros. Mi equipo quedo indignado por lo que le hicieron a mi campeon numero uno y la e pasado muy mal usandolo.","replies":[]}]}]},{"poster":"Tsuyeon","date":"2015-08-20T02:34:17.884+0000","up_votes":1,"down_votes":0,"body":"la verdad es que hay que probarlo. primero ver que tan bien queda en mid/top. yo digo que con el aumento de daño a la Q/E y ese aumento al escudo no se le va a notar mucho la falta de W, aparte de que te da sustain si tu jungla gankea. y en bot lo tendremos que ver como va a estar tanto como supp como de apc y con quien iria mejor para poder ver si esta mejor o peor. \npor mi parte felizitaciones al lograr lo que querian con skarner, darius, garen y fiora (ya que con morde no se sabe)","replies":[]},{"poster":"FallenDemonX","date":"2015-08-20T02:04:33.246+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=l6QpRyvc,comment-id=0003,timestamp=2015-08-19T19:54:15.368+0000)\n>\n> Hola, Carlosman!\n> \n> Tu muro de texto es un tanto intimidante, pero tratemos de ir punto a punto. :)\n> \n> El nerf a la W ciertamente lo hace mucho mas debil como mid. Tendria que jugarlo a ver si es completamente inutil, pero la verdad la W vieja no era muy util en la fase de lineas igual.\n> \n> Hm.\n> \n> El problema es que Mordekaiser nunca fue un campeon \"completo\"; siempre ha necesitado la ayuda de alguien mas para hacer lo suyo.\n> \n> Cada vez que Morde ha llegado a un nivel de poder para ser independiente (Deathfire Grasp?), la falta de interactividad de su kit de habilidades nos ha llevado a nerfearlo.\n> \n> Entonces, en lugar de seguir pretendiendo que Morde no necesita un amiguito, el equipo decidio simplemente aceptar la realidad y darle a Morde la capacidad de ser funcional junto con un aliado que \"complete\" su kit.\n> \n> No creo que los dos hechos sean contradictorios.\n> \n> Ciertamente podemos balancear a Morde para que vaya bot, pero de ahi a que sea popular y que hayan jugadores en efecto usandolo (y ganando) con un duo AP-support en bot es otra cosa.\n> \n> Si resulta que esta OP, es posible que popularize a ADCs que pueden ir en otros carriles (Quinn, Varus?). Si resulta estar debil, el meta no se da por enterado.\n> \n> Obviamente Riot tiene la capacidad de, digamos, hacer que un campeon no sea elegido nunca (reduce todas sus estadisticas a 0 y nadie lo usara excepto trolls), pero a la vez, no somos capaces de hacer que la comunidad juegue campeones que estan fuertes (e.g. Sejuani en S4) hasta que pasa algo que cambie su opinion.\n> \n> En otras palabras, el Meta es un conjunto de creencias, y estas creencias se basan en algunas cosas que controlamos (como el balance objetivo del juego) y otras que no (como la popularidad de distintos campeones o las modas que se dan).\n> \n> Y bien, CertainlyT ha tenido una experiencia muy negativa comunicandose directamente con la comunidad. Esta haciendo algo riesgoso y los jugadores son aversos al cambio, asi que entiendo por que preferiria evitar comunicarse al respecto.\n> \n> Ahora, dicho esto, no significa que los Rioters, como conjunto, no estemos dispuestos a hablar de Morde.\n> \n> Hay una diferencia entre leer feedback y regirse por el feedback. Nuestro equipo de diseño sabe bien como hacer un excelente juego, y a veces tienen ideas que inmediatamente son apreciadas por la comunidad (ver: nuevo Sion), y otras que son recibidas de manera muy negativa (ver: nueva Fiora), y en algunas cosas estamos dispuestos a ceder (ver: arte de nueva Fiora), y en otras no.\n> \n> League of Legends fue creado desafiando el conocimiento convencional (fijate! Esta en nuestro manifesto: http://www.riotgames.com/riot-manifesto ), asi que en efecto hay situaciones en las que genuinamente creemos saber lo que estamos haciendo y estamos dispuestos a tomar un riesgo.\n> \n> Y bien, si resulta que despues de intentarlo, el nuevo Morde resulta ser un rotundo fracaso, tambien tenemos la humildad para aceptar que nos equivocamos e intentar de nuevo.\n> \n> Pero te pediria que lo pruebes antes de dar tu sentencia.\n\n\n\n\nEstoy de acuerdo que {{champion:82}} necesitaba un cambio. Estoy de acuerdo que hay que probarlo antes de juzgar.\n\nPero hay cosas que deben decirse:  {{champion:82}} pierde flexibilidad con este cambio. La antigua W era un buen harrass tool en solo top/mid, recargaba tu escudo y curaba lindo en caso de tener {{item:3146}} o {{item:3152}}. ¿Que la nueva es muy debil para el nuevo rol? Para nada! Es muy util con supps de engage + CC. Solo digo que no deberian ir con la... como decirlo... \"excusa\" de \"admitimos que {{champion:82}} siempre anda con amigos (cosa que solo ocurre por su falta de CC o daño en early) y quisimos enfatizarlo en eso\". \n\nY digo yo, en lugar de darle \"magia de la amistad\" como requisito para no perderse el 30% approx de su kit, ¿Por que no hacerlo un solitario? El siempre tuvo el concepto de \"muerte lenta pero inevitable\", \"ente inmutable que se robara tu alma\" . Saber que debe andar con alguien al lado todo el rato le quita mucha personalidad. \n\nAdmito que sigue teniendo la idea de \"ser poderoso al que no debes acercarte\" (comillas, comillas everywhere) ya que cualquiera que le haga engage muere seguro. Pero el simple hecho de que algo asi sea necesario es un poco ridiculo.\n\n\nCon respecto a {{champion:14}}...\n\n {{champion:14}} viejo: Mucho daño, algo de cc, sustain, muy tanky, problema con escalas sin sentido.\n\n {{champion:14}} nuevo : Buen daño, mucho CC, sustain, muy tanky, escalados bien pensados.\n\nCon {{champion:14}} se supo que hacer (es uno de mis champs favoritos de hecho) sin quitarle la esencia de lo que es. Al viejo lo podias meter JG, Top, Mid o Supp. Al nuevo, Top, JG, Supp; en todos los casos sin dañar su desempeño en otros carriles.\n\nEntonces diran ¿Y {{champion:429}} ? Bueno, la fantasmita aqui presente requiere a otro para aprovechar todo el kit, si. Pero {{champion:429}} se BASA en eso, en conectarse con otro en la Bot Lane. Su kit es un balance entre habilidades potentes en un Tirador (Pasiva, Q, W activa, E) y habilidades con sinergia con tu compañero (W pasiva, Ult). Y la diseñaron, planearon y visualizaron como un ADC META y COMPETITIVO que va BOT LANE DUO  y nada mas (ahora le toca a las mayúsculas XD).\n\nEspero con paciencia su respuesta y comprendo que no quiera responderme, en caso de que asi sea.\n\nGoodbye! And may the odds be ever in your favour!","replies":[]},{"poster":"HizoKas","date":"2015-08-31T04:17:16.425+0000","up_votes":0,"down_votes":1,"body":"Mordekaiser no llega vivo para mandar sus Q ante campeones con ataque a distancia. Perdio mucho rango y ahora es mas lento que antes, es mas debil al gankeo, dependes mucho de un aliado y eso molesta y si te dejan solo eres inservible. E pasado las peores verguenzas con mi main que con un campeon nuevo de mi elenco.  Pudieron mejorar una habilidad para que tuviera C.C antes de hacerle semejante cambio.","replies":[]}]},{"poster":"Escrache","date":"2015-08-19T17:41:15.761+0000","up_votes":6,"down_votes":2,"body":"Esto fue un gran error por parte de RIOT.. y hay algo que me molesta mucho, es la señal que indica que garen ya puede ultear para matar a su objetivo.. Garen es un campeón para \"tontos\" (Sin ofender a nadie) y ahora lo convierte en un campeón para tontos guiados.. el próximo rework que va a ser? que le marquen al adc cuando tiene que hitear al minion para llevarse el oro?","replies":[{"poster":"Master Revan","date":"2015-08-20T01:37:09.654+0000","up_votes":1,"down_votes":0,"body":"Lol, no sabía eso, ¿es entonces como la marca de Cho'Gat o la de Zed?\nSiempre me parecieron mal esos indicadores, me parece mejor idea que no esté, porque el \"main\" de esos campeones sabe calcular el daño, y que el jugador casual puede cometer errores y dejar el oponente a poca vida","replies":[]}]},{"poster":"Gravitys Rainbow","date":"2015-08-19T22:33:16.709+0000","up_votes":4,"down_votes":1,"body":"Sabes cuando lol empezo por haya por el 2010, morde se jugaba \"adc\" o mejor dicho se jugaba en carril en pareja, fue de los mas poderosos junto a la dupla de Xin/Taric, este cambio que se le hace no es tan malo, en realidad el no viene a jugarse de \"adc\" solo se viene a cambiar un poco su fase de linea, lo que si riot lo hace bien podremos ver un break de meta bastante interesante, quizas volvamos a ver esas comp de la S1 con los adc en mid, los magos en top, y una duobotllane de luchadores, esto le da mas variedad al juego, ciertamente... aunque bueno, quizas para alguien que esta muy acostumbrado a jugar a morde en top o mid, ese estilo mas solitario, quizas vea reacio el cambio, pero en general es algo que a la larga sera bastante mejor, es bueno que el juego tenga estos cambios porque sino se estanca... y mucho.","replies":[]},{"poster":"Fenderwenger","date":"2015-08-20T11:47:47.889+0000","up_votes":2,"down_votes":0,"body":"Es que los que los asesoran trabajan para d0t* y estan saboteando este juego desde adentro.","replies":[]},{"poster":"KortakabezasFG","date":"2015-08-20T11:44:01.296+0000","up_votes":2,"down_votes":0,"body":"Han destrozado por completo a mordekaiser, mid y top ya es completamente inviable si no queremos jugar sin W, el cono ahora quita la mitad...se nota muchisimo, el fantasma quita la mitad, somos mas lentos.\n\nEntiendo que el adc ahora debiera ir a mid para que mordekaiser  pueda jugar de AP y tenemos un AP con la Q de daño melee y la E que ahora pega la mitad de lo que pegaba antes.\nEsto no es un simple nerfeo...esto es cargarse por completo un personaje.","replies":[]},{"poster":"Revolución","date":"2015-08-19T19:49:34.801+0000","up_votes":3,"down_votes":1,"body":"Muy contundente, buen trabajo.","replies":[]},{"poster":"Sonyvia","date":"2015-08-19T18:53:29.877+0000","up_votes":2,"down_votes":1,"body":"Totalmente de acuerdo,arruinan a Morde,y Garen ya esta re op podes tirarte 1vs5 matar a 1 y salir tranquilamente,encima ahora es mas facil... aunque lo que mas me molesta es lo del pobre Morde.","replies":[]},{"poster":"CJ14","date":"2015-08-20T01:53:09.225+0000","up_votes":1,"down_votes":0,"body":"No juzgen hasta que prueben. Use  Mordekaiser en el PBE, fui ADC con una Janna de supp y carreo mas heavy que una Caitlyn. Si Thresh y Yasuo pueden rendir en ADC, Mordekaiser con el buff esta rotisimo. Ojala lo cambien, porque simplemente no esta equilibrado","replies":[{"poster":"HizoKas","date":"2015-08-31T04:09:51.670+0000","up_votes":1,"down_votes":0,"body":"Amigo mordekaiser ya esta mas que probado. Fue siempre mi gran jefe del elenco. Ahora es mas lento qur antes, su ulti esta reducida en rango y es verdad que su Q pega arto pero no alcanzas a llegar a tu rival sin quedar en cero. Mordekaiser a perdido su esencia como campeon. Si el comentario de riot, ese de que mordekaiser era incompleto por ultimo le hubieran puesto relentizar a su W o E pero no hacerle semejante cambio tan radical. Antes de hacer ese tipo de cambios deberian respetar un poco mas a sus usuarios.","replies":[]}]},{"poster":"Essos","date":"2015-08-20T13:32:50.102+0000","up_votes":1,"down_votes":2,"body":"No se pq lloran tanto con el rework de morde.\n\nLa verdad se quejan pero no se ve tan seguido a este champ.\nNo se, ahora mismo, hace meses que no me cruzo a ninguno ni en normal ni ranked. Y nunca fue un champ que se utilize mucho, a pesar de que siempre ha estado medio OP si lo sabes utilizar.\n\nEs mas, hace mucho que no esta en la Free-week.\n\nA mi me parece interesante que hagan esas cosas. Por cierto se va a poder utilizar de supp. Asi como esta esta re OP. Al menos yo no veo viable cambiar un adc de distancia larga como pueden ser cait o sivir, por un morde.\n\nPa todos los q lloran: Mordekaiser supp maxeando la W OP\n\nhttps://www.youtube.com/watch?v=LOQUv0EMZ2c","replies":[{"poster":"TheFalc","date":"2015-08-27T20:27:03.648+0000","up_votes":1,"down_votes":0,"body":"estuvo hace un mes o un mes y medio creo.","replies":[]}]},{"poster":"Revolución","date":"2015-08-20T13:43:06.302+0000","up_votes":1,"down_votes":1,"body":"Lo probé en bot y me gustó.\n\nEs muy raro, sí, y no creo que sea algo conveniente en cualquier composición o contra cualquier rival. Pero sí puedo decir que es una variante divertida de la cual me interesaría ver cómo modifica las rotaciones, no me parece una locura que pueda llegar a competencia. Lo más importante para jugarlo es tener la cabeza abierta.","replies":[{"poster":"lordeman10","date":"2015-08-23T13:09:42.837+0000","up_votes":1,"down_votes":0,"body":"yo lo probé y no me gustó, más alla de que esté feliz de tener un nuevo support y que me haya ido relativamente bien en la linea, senti que me faltaban skills para proteger y mi build no me permitia sacar visión\n\npero bueno fue apenas 1 vez que lo usé","replies":[{"poster":"Revolución","date":"2015-08-23T14:30:59.839+0000","up_votes":1,"down_votes":0,"body":"No se supone que Mordekaiser sea support, se supone que ocupa el lugar de campeón que farmea en bot lane. Entiendo que es muy complicado de asimilar, pero no necesariamente significa dejar sin tirador o DPS de rango a un equipo, puede ir muy bien con composiciones que tengan un campeón de esas características en otro carril.\n\nCuando digo que no me parece una locura verlo en competencia, me refiero a que Mordekaiser en bot con un soporte es capaz de farmear a la par y hasta mejor que un adc rival. Sube muy rápido de nivel, llega a 6 incluso antes que sus rivales a 5 y con esto puede generar un all in temprano y matar a los 2 rivales de bot o sacarlos de línea al menos para poder ir a hacer el dragón, y con el fantasma del dragón es muy factible tirar la torreta muy temprano. Para composiciones de asedio es una excelente opción, pero hace falta entender que Mordekaiser no es un \"adc\", sino un luchador en bot lane, y si el equipo necesita un adc debe tenerlo en otro lado para que funcione y en este caso romper la lógica de \"en bot debe haber un adc y un support\".","replies":[{"poster":"lordeman10","date":"2015-08-23T14:35:15.716+0000","up_votes":1,"down_votes":0,"body":"si tenés razón creo que esa es la idea del nuevo morde.. igual muy raro que saquen algo tan anti-meta","replies":[{"poster":"Revolución","date":"2015-08-23T14:47:22.575+0000","up_votes":1,"down_votes":0,"body":"Es raro el concepto, pero creo que más anti-meta es una opción adaptable al meta (de competencia). La composición de un equipo que tenga por ejemplo en top a Lulu, en mid a Corki, en jungla a Rek' Sai y en bot a Mordekaiser y Thresh en team fight tendría las mismas características casi que un equipo que tuviera a Mordekaiser en mid y a Corki en bot. La fase de líneas es relativamente diferente, pero con las rotaciones y demás no termina siendo tan anti-meta como parece. Lo que modifica el meta es tener en bot en el lugar del adc a un campeón que te puede asegurar objetivos tempranos, pero convengamos que ningún otro bruiser tiene las características que tiene el actual Mordekaiser para esto, y no pueden haber 2 Mordekaiser en partidas competitivas, por lo cual es más bien una variante estratégica orientada a asegurar el early game y en realidad lo que más me interesa ver es cuál es la contracara para enfrentar a Mordekaiser en bot cuando se perfeccione esta idea.\nAclaro, tampoco creo que esta idea de Mordekaiser busque modificar el meta y sacar a los adc de bot. Mordekaiser es un caso particular de un bruiser que se ve beneficiado de tener un soporte, pero existen tiradores (Kalista, ejem) que también tienen estas características de tener mejor sinergía con un aliado cerca y da la casualidad de que en el meta de competencia es baneada/pickeada todas las partidas (por algo será). Entonces, repito, no lo veo como un cambo radical al meta o una variante anti-meta, sino como una estrategia más dentro de un gran abanico de posibilidades.","replies":[]}]}]}]}]},{"poster":"Aaron","date":"2015-08-20T01:33:08.195+0000","up_votes":1,"down_votes":1,"body":"Esto dejara marcas y puedo estar seguro que no tendrá buen final.\nQue mal ese cambio a Mordekaiser","replies":[{"poster":"HizoKas","date":"2015-08-23T06:01:01.893+0000","up_votes":1,"down_votes":0,"body":"Para mi es demaciado tragico. Mordekaiser lo uso desde que conoci lol a comienzos de la season 3 y de ahi siempre a sido mi top y mid, jamas nunca anduve pidiendo ayuda ni gankeos con el. Me podia arreglar contra quien fuera y esto de que n tenia CC pff nunca me significo la gran cosa. Mi campeon numero uno ahora no es nada mas que una porqueria... Lo probe en 3v3, en mid y en top y no es lo mismo, ahora es muy debil su E y su Q pega arto pero... por favor de ahi a que llegues a tu objetivo ya esta muerto. Riot game me mataron a mi mejor campeon con el que me mande hasta 26 kills ! lo mas grande que tenia en linea y con quien mas emocionaba jugar, ahora es simplemente un mordekaiser tierno que depende de alguien para sacarle poencial a sus habilidades. Con esto y las pruebas que e hecho ya con el  no lo usare mas.","replies":[]}]},{"poster":"Saykan","date":"2015-08-20T08:48:11.596+0000","up_votes":1,"down_votes":0,"body":"Para mi es la tipica llorar por algo que después no se termina usando para nada, lloran por el rework de morder cuando en partidas actuales lo ves 2-5 veces de 50-100 partidas, posiblemente ahora pueda ser mas popular de lo que es actualmente aunque sea en bot. \n\n ( sacando un ejp nada que ver y a la ves igual el caso del GRAN Y APRECIADO SKINS DE ZAC desde que sacaron el skin e visto no mas de 5-6 y para colmo la mayoria sin skin )\n\n Lo del meta (obligado) realmente es algo muy muy :/  de ignorantes que tratan de seguir siempre una linea y si alguien se sale de esta es un troll, juega mal, bronce, etc. cuando hay casos donde hay teemo challengers, sonas mid challengers, etc etc...........\n\nrealmente el juego consiste en fase de linea la habilidad del jugador y hacer cosas que el otro no se espera, despues si se complementa con el team o no ya no es problema del campeon si no como jugaste despues de terminar la fase de linea. como te podes adaptar con la composicion de tu team, como jugo el mismo, como se adaptan a vos y a tu forma de jugar. \n\n ( ejp desde que salio Ekko yo lo jugue practicamente despues de jugarlo 10 partidas y en TF por ser Ekko no te acopañaban te dejaban morir ni siquiera se molestaban en mirar los objetos que tenias ni siquiera diciendoles que soy tank te salian con \"JAJSAJSJAS EKKO TANK BRONCE NO SOS TANK\" por mas que yo tenia 4k de vida 250+ de armadura 150+ de mr.......)\n\nhay muchos casos donde esta el tipico nasus top farmer 24/7 que no sale de la linea aun teniendo 5/0 de score (cumple la meta pero no cumple las obligaciones que tiene que hacer con el team) cuando podes ir con un personaje totalmente al azar quinn top ganar la linea y usar tu ulti para hacer roaming mid si no llegas a tener tp (otro meta de cual todos molestan TOP = TP con personajes que hasta ni siquiera es necesario tener un TP por que ya tienen uno en sus habilidad o similar......... )\n\nrealmente me pone de mal humor tambien que el meta cambie por torneos menores o campeonatos solamente y no por innovaciones que lo haga la comunidad ( la gente tiene que esta totalmente obligada a ver un Fizz AD en la LCS para que sea viable ver un Ekko tank ap o ad para que sea viable teemo ad o ap o directamente ver a teemo en un campeonato para que deje de ser un campeon \"troll\" ) ._.\n\nhablando mas del caso de morder realmente los cambios que le hicieron, son algo innovadores si obviamente raros pero innovadores.  \nyo realmente no juego morder por que es el tipico caso de Yorick en la actualidad E > W > Q > R  con morder  tenes un poquito mas de mecanicas que Yorick pero sigue siendo totalmente simple  E > Q tirarle la W a un minion o a vos mismo  pushear la linea con  R ( ES TOTALMENTE ABURRIDO JUGAR UN MORDER ACTUALMENTE )","replies":[{"poster":"Dammerung","date":"2015-08-20T15:21:56.522+0000","up_votes":1,"down_votes":0,"body":"No es aburrido en linea, y por lo menos escribi bien que no se llama MordeRkaiser es Mordekaiser -.-","replies":[]}]},{"poster":"Professor Pro","date":"2015-08-22T21:07:07.747+0000","up_votes":1,"down_votes":1,"body":"Bueno yo estoy de acuerdo ahora morde no sera como antes pero ahora sera funcional y directamente yo me enfoco que adaptarnos al nuevo morde, me parece que su kit de habilidades esta bien. Lo unico que rescato es que bajaron mucho el rango de la r de Morde que antes era muy necesario en tf para llegar al adc o mid. Pero bueno les dejo una guia http://www.salsalol.com/guias/mordekaiser/guia-mordekaiser-adc-parche-5-16-platino-huehue-11222 para que la vean","replies":[]},{"poster":"Sir Crucifix ","date":"2015-08-20T16:22:57.455+0000","up_votes":1,"down_votes":1,"body":"Yo lo voy hacer AD como siempre","replies":[]}]}