{"poster":"Eurasio","date":"2015-10-08T06:24:39.468+0000","title":"Suche Tipps und Leute zum leveln!","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Heyho Community!\r\n\r\nIch spiele jetzt seit kurzem aktiv LOL und bin durch einen guten Freund auf das Spiel aufmerksam geworden. \r\nHabe mir dann zu Anfang einige Streams und Videos auf Youtube angeschaut, um die Grundprinzipien zu verstehen.\r\nMein Augenmerk ist dann auf {{champion:92}} gefallen, da sie irgendwie alles verbindet was mir Spa&szlig; macht. Habe \r\nsie mir dann auch gekauft und einige Games auf der Toplane bestritten. Doch irgendwie klappt es gar nicht so gut \r\nmit ihr :( Normalerweise spielt man ja im sp&auml;teren Verlauf alleine auf der Toplane oder? Liegt es vielleicht daran,\r\ndass ich mit ihr nicht so gut klar komme oder muss ich sie einfach nur oft genug spielen? Ich m&ouml;chte Riven schon\r\ngerne lernen, auch wenn sie schwer zu spielen ist.\r\n\r\nMein Freund hat mir was von sogenannten Smurfs erz&auml;hlt. Die grobe Bedeutung habe ich verstanden. Ich habe manchmal\r\neinfach das Gef&uuml;hl, dass selbst ich auf solche Personen im Game treffe. Denn in letzter Zeit f&auml;llt mir sehr oft auf, dass sehr\r\nviele Leute besser sind als ich. Ob jetzt im Gegnerteam oder im eigenen, man merkt es einfach. Was kann man dagegen tun?\r\n\r\nSo zum Schluss w&uuml;rde ich gerne noch einen kleinen Aufruf starten, da ich Leute zum gemeinsamen Spielen suche. Bin 22 Jahre \r\njung und momentan LVL 7.\r\n\r\nGruss","replies":[{"poster":"xXSlowpoke","date":"2015-10-08T23:05:51.844+0000","up_votes":1,"down_votes":0,"body":"wenn du willst kannst mich gerne adden\n\nign: SLP Shadow","replies":[]},{"poster":"leonthefirefly","date":"2015-10-08T08:50:54.435+0000","up_votes":1,"down_votes":0,"body":"Also ich zocke auch noch nich so lange lol und hatte ähnliche probleme... ja gerade in den ersten lvl trifft man viiiiiiele smurfs. Ich kann mich noch an ne weile erinnern wo ich in jedem Spiel mindesten ein smurf war (und das nur in unserem team)^^. Aber das legt sich deren hiden mmr steigt schätzungs weise ziemlich schnell und man kann in ruhe spielen. Aber nicht jeder der dich komplett zerstört ist n smurf es gibt einfach auch gewisse champs die auf unserem niveau sehr leicht sehr dominant werden können eins der besten bsp Shaco... der ging mir ne weile dermaßen auf den Geist dann hab ich ihn mir selber gekauft und direkt ausprobiert... 23/5/10 im ersten Match. Oder auch champs die leichte mechanics haben. (riven gehört da jetzt glaub ich nicht umbedingt dazu)\n\nTop lane spielt man eig alleine das problem auf deinem lvl ist das da die wenigsten {{summoner:11}}  haben/jgln können sobald sich das ändert hast du die top lane für dich allein.","replies":[]},{"poster":"DeadIyRain","date":"2015-10-08T07:24:13.114+0000","up_votes":1,"down_votes":0,"body":"Guten Morgen,\n\nich kenne das Problem, da ich erst vor etwa einem halben Jahr angefangen hab zu spielen.\n\nMan fühlt sich nach einer Zeit so als wäre man der einzige Anfänger in dem Spiel :D \nAber ich habe einfach so viele CHamps in der Rotation ausprobiert bis ich mit einem \"gute\" Stats am spielende hatte und habe dann erstmal mit dem gespielt (Kha' zix) und mir die Grundlagen angeeignet (z.B. Lasthitten, Warden, Skills lernen). \n\nAuch habe ich viel im Forum gelesen was zu beachten ist. Als ich mich mit dem Champ sicherer fühlte hab ich einen nächsten gespielt usw. \n\nBin jetzt zwar auch erst lvl 25 aber fühle mich mit 5 -7 Champs sehr sicher ingame.\n\nWenn du willst können wir auch mal ein paar normals zocken ;) vllt kann auch ein newbie wie ich dir was erklären oder so.\n\nKannst mich einfach Adden ;)\n\nMein Beschwörername ist DeadIyRain (das kleine \"L\" ist in wirklichkeit ein großes \"i\" :D)\n\n{{champion:35}}","replies":[]},{"poster":"Nephirelle","date":"2015-10-08T06:59:32.593+0000","up_votes":1,"down_votes":0,"body":"Prinzipiell heißt es bei allen Champs üben, üben, üben. Nur so weißt du, was du in den unterschiedlichen Situationen am besten mit deinem Champ anstellst und reagierst auch schnell genug.\n\nJa, Smurfs kommen vor, aber du solltest nicht jede Niederlage auf Smurfs schieben und dich darauf ausruhen. Es gibt auch neue Spieler, die sich einfach sehr schnell zurechtfinden und dich zerstören können. Überlege nach solchen Situationen, wie du den einen oder anderen Tod hättest verhindern können und merk dir die Fähigkeiten des gegnerischen Champs, falls du noch einmal auf ihn treffen solltest.\n\n\"Im späteren Verlauf\" solltest du auf keinen Fall auf der Toplane kleben bleiben. Behalte immer die Karte im Blick (das kann man gar nicht früh genug lernen) und greife ein, wo du helfen kannst. Spätestens wenn sich ein Team sammelt, um auf einer Lane durch zu pushen, ist auch für dich die Zeit gekommen, deine Lane ggf. zu verlassen. Das ist aber auch alles sehr Situationsabhängig und vieles lernt man mit der Zeit auch intuitiv. Nur nicht ungeduldig werden :)","replies":[]},{"poster":"BlancPaíN","date":"2015-10-08T06:56:13.971+0000","up_votes":1,"down_votes":0,"body":"add mich mal lg {{summoner:6}} ","replies":[]}]}