{"poster":"Nagga Syn","date":"2016-09-13T18:59:36.497+0000","title":"Que vuelvan los iconos de cada linea actualizados","subforum":"Discusiones sobre el Cliente","embed":{"description":null,"url":"http://i.imgur.com/AC6xOSA.png","image":"http://imgur.com/AC6xOSAs.png"},"up_votes":45,"down_votes":12,"body":"* 1. * &gt; Hola que tal soy nagga syn y traigo como propuesta para riot volver a implementar los iconos seg&uacute;n el rol que nos desempe&ntilde;amos actualmente en la grieta del invocador, hay muchas cosas y logros que nos gusta tener ya sea las maestr&iacute;as que representan la jugabilidad que alcanzamos con nuestros campeones favoritos, la forma en que ganamos nuestras partidas clasificatorias, pero tambien seria interesante volver a ver estos iconos que fuero tan bien dise&ntilde;ados y representaban cada carril y funci&oacute;n del equipo muchos jugadores se sienten orgullosos de la linea que dominan y esto seria una buena idea para incentivar a jugar cada vez mejor en aquella linea para ganar la insignia de su carril, pero para esto se podria dise&ntilde;ar un sistema en donde uno tuviera que jugar cierto numero de partidas en ese carril para desbloquear el icono seria algo asi como maestria de la grieta o maestria de la linea en la cual uno se desempe&ntilde;a. en lo que a mi respecta me parece bastante interesante y ludico lucir la maestria de mi carril que me dicen los demas, es algo que algunos jugadores nuevos se han perdido y algunos jugadores mas antiguos no alcanzaron quiza a desbloquear todos los iconos por eso seria una buena idea para que todos tengamos la posibilidad tener estos iconos que de verdad estan estupendos...saludos y pueden dejarme su opinion en los comentarios.{{champion:43}}","replies":[{"poster":"Seven Teemo Army","date":"2016-09-13T19:39:49.481+0000","up_votes":16,"down_votes":2,"body":"No deberían volver.","replies":[{"poster":"Nombre ofensivo","date":"2016-09-13T20:56:48.183+0000","up_votes":5,"down_votes":0,"body":"Asi es, esas colas de 20 minutos para ir top merecen una recompensa {{item:3157}}","replies":[{"poster":"LFG Sand Soldier","date":"2016-09-15T01:16:37.194+0000","up_votes":1,"down_votes":0,"body":"xD yo llegue a estar como una hora esperando :p asi llegue a conocer amigos que tambien esperaban xD lo malo es que como tardaba tanto no jugue esas partidas ya que no sabia que iban a sacar esa cola :C","replies":[]}]},{"poster":"Nagga Syn","date":"2016-09-14T01:13:39.785+0000","up_votes":1,"down_votes":0,"body":"por que no amigo?","replies":[{"poster":"Seven Teemo Army","date":"2016-09-14T01:42:28.915+0000","up_votes":1,"down_votes":1,"body":"Porque las personas que los tienen se esforzaron mucho en conseguirlos y no es justo que los vuelvan a poner y sean menos exclusivos, lo mismo con Reiven de Campeonato\n.","replies":[{"poster":"Maedme","date":"2016-09-14T06:48:52.918+0000","up_votes":3,"down_votes":0,"body":"Nadie dijo que no se esforzaria la gente para jugar, yo creo que estaria bien que se desbloqueen con 30 juegos y que sean OTROS iconos mas actualizados, por ende los que ya tenemos los iconos volveriamos a desbloquear otros pero mejor diseñados ♥","replies":[{"poster":"Seven Teemo Army","date":"2016-09-14T06:53:26.814+0000","up_votes":2,"down_votes":4,"body":"Iconos nuevos pero mas malos estarian bien en mi opinion.","replies":[{"poster":"Maedme","date":"2016-09-15T00:04:42.547+0000","up_votes":2,"down_votes":0,"body":"no tendría sentido gastar tiempo en crear un diseño de menor calidad a los actuales xD","replies":[{"poster":"Seven Teemo Army","date":"2016-09-15T00:40:50.815+0000","up_votes":1,"down_votes":0,"body":"De hecho si, les daría más exclusividad a los viejos pero dejaría que nuevos jugadores también los tengan.","replies":[]}]}]}]},{"poster":"lArturianol","date":"2016-09-14T14:46:59.619+0000","up_votes":1,"down_votes":0,"body":"esforzaron mucho? jugar 5 partidas en una misma linea es mucho esfuerzo? no era malo el sistema, pero tampoco era el peor castigo del mundo tener que jugar 5 partidas, que la mayoría que juegue habitualmente, las juega en 1 día...","replies":[{"poster":"sevaaas1","date":"2016-10-13T21:00:29.621+0000","up_votes":1,"down_votes":0,"body":"las esperas duraban horas... solo logre sacar 2 iconos por eso mismo, un dia espere un dia entero para jugar solo una, para colmo tenias que llenar el team de antes o casi todos se salian","replies":[]}]},{"poster":"Schwarzer Wolf","date":"2016-09-15T20:45:26.802+0000","up_votes":1,"down_votes":0,"body":"por eso darle otrves oprtunidad a las nuevas personas q ganen en ranked me parece mejor","replies":[]},{"poster":"JustoxGames","date":"2016-09-14T12:14:12.502+0000","up_votes":1,"down_votes":0,"body":"No seran menos exclusivos, la gente nueva debera hacer lo mismo que tu para conseguir esos iconos.","replies":[]}]}]},{"poster":"STÜTZLAGER","date":"2016-10-18T23:31:58.245+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Seven Teemo Army,realm=LAS,application-id=VG4wEFg7,discussion-id=2dZyE6xs,comment-id=0001,timestamp=2016-09-13T19:39:49.481+0000)\n>\n> No deberían volver.\n\nTotalmente, fue algo único del team builder.","replies":[]}]},{"poster":"MatiLee","date":"2016-09-13T19:36:32.962+0000","up_votes":15,"down_votes":4,"body":"Esos íconos eran una recompensa por jugar 5 partidas con cada rol en el Creador de Equipos. Me parece que deberían quedar así, y que no se vuelvan a entregar.","replies":[{"poster":"Zabivaka","date":"2016-09-13T23:19:22.177+0000","up_votes":5,"down_votes":2,"body":"Riven de campeonato también debería haber quedado en el olvido para los jugadores veteranos y sin embargo volvió, así que no sabemos que va a hacer riot","replies":[{"poster":"Nagga Syn","date":"2016-09-14T01:14:52.753+0000","up_votes":1,"down_votes":0,"body":"a mi me gustaria que los volvieran a lanzar si son los mismos para los jugadores nuevos y si son diferentes a ver que tan way son los iconos por que estan muy bien diseñados","replies":[]}]},{"poster":"JustoxGames","date":"2016-09-14T12:14:59.822+0000","up_votes":1,"down_votes":0,"body":"Pero si vuelven a Implementar el Creador de Equipos estaria bien, que los volvieran a poner.","replies":[]},{"poster":"Maedme","date":"2016-09-14T06:49:24.976+0000","up_votes":1,"down_votes":1,"body":"estaria bien que se desbloqueen con 30 juegos y que sean OTROS iconos mas actualizados, por ende los que ya tenemos los iconos volveriamos a desbloquear otros pero mejor diseñados ♥","replies":[]}]},{"poster":"Ryûjin Ronin","date":"2016-09-13T20:09:21.506+0000","up_votes":4,"down_votes":0,"body":"Era cualquier cosa lo de los iconos. Yo los saque todos jugando la misma linea, capaz ahora con la nueva selección sirva mas.","replies":[{"poster":"XxlentaoxX","date":"2016-09-13T23:05:48.419+0000","up_votes":1,"down_votes":2,"body":"Ponele... Yo me ponía Kassadin mid con rol de support y solo me funcionó pocas veces, por lo general te echaban de los grupos siendo que eso del rol era irrelevante, si te pones Kassadin mid es obvio que vas a ir asesino, por mas rol support que te pongas y es obvio que estás intentando conseguir el icono nada más. Muy pocas veces funcionaba por dicha razón, así que normalmente había que usar el rol y el campeón donde pertenecía.","replies":[{"poster":"Benedict","date":"2016-09-14T06:20:24.227+0000","up_votes":2,"down_votes":0,"body":"Hola lo hiciste mal jajaja la idea para obtenerlos todos era la siguiente, por ejemplo marcabas como línea para elegir Supp, pero en rol del personaje ponías Asesino y jugabas supp tranquilo con el que vos quisieras, al final de 5 partidas ibas a obtener el icono de Asesino jugando la línea de supp sin trolear. Por lo menos que yo recuerde se hacia asi. Éxito en tus partidas","replies":[{"poster":"XxlentaoxX","date":"2016-09-15T02:38:27.831+0000","up_votes":1,"down_votes":0,"body":"Eso es lo que dije que hacía...","replies":[]}]}]}]},{"poster":"V for Vice","date":"2016-09-13T20:05:46.409+0000","up_votes":2,"down_votes":1,"body":"No deben volver, son íconos que ganabas estando en ese evento específico y no sería gracia para los que los sacaron que volvieran permanentemente, ni siquiera temporalmente.\n\nSi haces eso con estos íconos, deberías hacerlo con todos los demás que ya no están disponibles.","replies":[]},{"poster":"Mascheranox","date":"2016-09-14T14:31:51.260+0000","up_votes":1,"down_votes":0,"body":"si abre jugado de Supp con imagen de asesino y la gente me decia que iria troll xD\ndesbloquear el icono maestria de tu carril, de 10 a 20 partidas estaria bien \nasi aprenden a jugar cada linea :D","replies":[]},{"poster":"Support KR","date":"2016-09-14T07:51:13.089+0000","up_votes":1,"down_votes":0,"body":"apoyo tu post","replies":[]},{"poster":"StevensLion","date":"2016-09-14T06:05:00.485+0000","up_votes":1,"down_votes":0,"body":"Me faltaban muchas para conseguir las que quería, pero las sigo queriendo.","replies":[]},{"poster":"SebaMinecraftero","date":"2016-09-14T03:39:12.197+0000","up_votes":1,"down_votes":0,"body":"No jugué en ese tiempo pero un día me apareció el icono de mago de la nada D:","replies":[]},{"poster":"Xpé","date":"2016-09-14T02:58:13.456+0000","up_votes":1,"down_votes":0,"body":"Yo quería el de mago, pero no sabia como conseguirlo :(","replies":[]},{"poster":"Glorfindel esdla","date":"2016-09-14T01:01:31.542+0000","up_votes":1,"down_votes":0,"body":"A mi me faltaban 2 victorias para el ícono de asesino hasta que...\nDesapareció modo creador de equipos.","replies":[]},{"poster":"DanielGarrita","date":"2016-09-13T22:00:33.565+0000","up_votes":1,"down_votes":0,"body":"Cual es el icono de martillo ? un amigo lo tiene pero yo no soy tan antiguo.","replies":[{"poster":"Ozarcus","date":"2016-09-13T22:24:31.530+0000","up_votes":1,"down_votes":0,"body":"Es el ícono de rol \"Tanque\"\n\nSalu2","replies":[]}]},{"poster":"Small Dik Rengar","date":"2016-09-13T22:23:55.477+0000","up_votes":1,"down_votes":0,"body":"Yo no se porque pero los tengo todos y jamas jugue ni tirador ni mago en el creador de equipos, pero no me quejo, me gusta mucho el de mago, los otros si me los gane jugando.","replies":[]},{"poster":"resnov15","date":"2016-09-13T21:20:27.571+0000","up_votes":1,"down_votes":0,"body":"Los sacaron por que tenian un bug que no te lo daba","replies":[]},{"poster":"Shichi","date":"2016-09-13T20:48:12.200+0000","up_votes":1,"down_votes":0,"body":"Yo los tengo a todos (?","replies":[]},{"poster":"Danza De Fuego","date":"2016-09-13T20:29:59.094+0000","up_votes":1,"down_votes":0,"body":"yo tenia solo el de asesino... pero un dia asi como asi me dieron todos los demas(? \nIS MAGIC {{sticker:slayer-pantheon-rainbows}}","replies":[]},{"poster":"pl4yer","date":"2016-09-14T07:44:39.556+0000","up_votes":2,"down_votes":3,"body":"Esos iconos no deben volver.. no estuviste en esa época, mal por ti muchacho.. si es así yo quiero iconos de la S1 que no jugué... €_€","replies":[{"poster":"lArturianol","date":"2016-09-14T14:44:34.017+0000","up_votes":1,"down_votes":0,"body":"es irrelevante tu comentario.. no me parece mala la idea de volver a dar una recompensa por jugar siempre una misma linea, cuantos se quejan de ir supp? nadie quiere ser supp en los elos bajos al menos... dando una minima recompensa como un simple icono, alentas a los jugadores nuevos a conocer y desempeñarse de manera efectiva en una linea.","replies":[]}]},{"poster":"juli83394","date":"2016-09-14T00:31:30.078+0000","up_votes":1,"down_votes":3,"body":"Querido Riot ultimamente me estan tocando en mis team gente de mierda que flamea, sin jugabilidad, trolls y afk en casi todas mis partidas tanto normals como ranks, ahora solo te pediria que me pudieras emparejar con gente que este al mismo nivel de jugabilidad en la que yo estoy, por que es inaceptable que durantes las 2 ultimas semanas eh perdido casi el 90% de mis partidas, porfabor espero que puedas responder a mi solicitud y que puedas cambiar esto para ser una mejor comunidad, Thanks You ;)","replies":[{"poster":"JustoxGames","date":"2016-09-14T12:12:01.948+0000","up_votes":1,"down_votes":0,"body":"._.","replies":[]}]},{"poster":"zelaya19","date":"2016-09-13T21:55:39.097+0000","up_votes":1,"down_votes":2,"body":"No, hubiesen jugado creador de equipos (Team builder).","replies":[]}]}