{"poster":"The Hanshmear","date":"2017-04-19T13:26:06.539+0000","title":"SSS FINALIST: Four","subforum":"FanFiction","up_votes":9,"down_votes":1,"body":"The sun glistened gently, atop a cyan paste sky\nThe wind carried a tumble weed, who slowly rolled on by\nThe air felt tense I thought to myself, as I slowly clench my fists\nI knew right then and there, that something was amiss\n\nOn the crest of Piltover&rsquo;s border, a shady western town\nYou head west on to Krexor, then West some more and down\nA place without a government, but a community just the same\nBut all this isolation, had driven some insane\n\nThe folks were all a chirpy, just minding their own ways\nThey&rsquo;re working, sleeping, working, just blurring all their days\nToday though, it was something, as people walked with care\nUnwarranted paranoia, something was in the air\n\nI kept my shotgun loaded, with confidence in my draw\nOnce upon a gunslinger, I&rsquo;d left plenty folk in awe\nI&rsquo;d hoped I wouldn&rsquo;t need it, but I kept prepared instead\n&lsquo;Cause letting one&rsquo;s guard down, is how folks wound up dead\n\nAt that moment I heard it, a gunshot from the hills\nI dash sharp to the left, as the bullet misses its kill\nI raise my hand up to my eyes, blocking out the sun\nA daunting voice is heard, as it clearly shouts out &ldquo;One&rdquo;\n\nThere are many country whisperings, of this High Noon Jhin\nHis killcount to his mannerisms, where do I begin?\nHis fourth shot never misses, and that was bullet one\nI realise that then and there, something must be done\n\nI manage to get a decent look, upon the madman&rsquo;s bluff\nHis rifle overbearing, I think I&rsquo;ve seen enough\nI notice just a minor glint, as his goggles reflect the light\nThe killer is staring at me, a man prepared to fight\n\nI dive behind some barrels, with both hands on my gun\nDodging bullets ain&rsquo;t easy, but I&rsquo;ve already managed one\nThe air is solemn quiet, but I hear the distant click\nAs the barrels shatter behind me, by a bullet fast and thick\n\n&ldquo;Two!&rdquo; Shouts the madman, as my blood runs cold\nMy cover blown to bits, I got nowhere left to go\nMy weapon is outmatched here, at such a lengthy distance\nBut I&rsquo;m a man who&rsquo;s been through hell, damn right I have persistence\n\nI can&rsquo;t make the gap between us, nobody here&rsquo;s that fast\nBut every second wasted, brings me closer to my last\nThere&rsquo;s a building to my left, but I doubt that it would stop\nHigh Noon Jhin&rsquo;s precision, and his deadly final shot\n\nI can&rsquo;t think about that now, as I&rsquo;m staring at my fate\nI need to think of a plan, or it will be too late\nAll I can think right now, is to dodge bullet three\nThe imminent gunshot&rsquo;s coming, but don&rsquo;t know when it&rsquo;ll be.\n\nA feeling arises within me, an impulse to dive\nI feel a bullet coming, and one I intend to survive\nI dash to the right, but then no bullet comes\nI predicted incorrectly, and now I might be done\n\nI look up to the madman, whose head faces the sky\nThen slowly looks on down, his gaze catches my eye\nHe then squares me up, just aiming down his sights\nHe still hasn&rsquo;t shot yet, but something isn&rsquo;t right\n\nHe breaks the country silence, as he calmly shouts out &ldquo;Three&rdquo;\nAnd then he pulls the trigger, just barely missing me\nWith every single advantage, he still doesn&rsquo;t shoot to win\nHe&rsquo;s enjoying the anticipation, this is all just fun to him\n\nI refuse to be a victim, to a psycho with a gun\nA madman assassin, kills for sport performance and fun\nHis fourth bullet&rsquo;s a comin&rsquo;, to blow me to bits\nI need a bright idea, and then finally one hits\n\nI&rsquo;ll just create a smokescreen, obstruct the madman&rsquo;s view\nI&rsquo;ve only moments to act, but there&rsquo;s still so much to do\nI carefully place the smoke grenade, in the barrel of my gun\nTook aim at the madman, then tilted towards the sun\n\nI pulled the trigger hard, the canister flew into the air\nAs High Noon Jhin just watched it, and didn&rsquo;t seem to care\nI holster my shotgun quickly, as my hands went to my waist\nGot plenty of smoke grenades left, and I&rsquo;ll give this town a taste\n\nPulled six pins in a second, and threw them to the floor\nI got a chance here at survival, with these tactics I implore\nI throw the smoke grenades everywhere, as I dash off to the right\nThe airborne one exploded, I&rsquo;ve broken line of sight\n\nThis madman was a clever one, will track you on your path\nJust getting out of vision, ain&rsquo;t enough to escape his wrath\nMy mission&rsquo;s not yet over, I need to outsmart High Noon Jhin\nThat&rsquo;s when I have a thought, the smartest that&rsquo;s ever been\n\nYou see the man&rsquo;s a thinker, knows everything that&rsquo;s in your head\nAnd that go me to thinkin, why not just stop thinkin instead?\nIf he knows just how I&rsquo;m movin, then I ain&rsquo;t movin at all\nI stand there steady, a little nervous, but I&rsquo;ve made my call\n\nHigh noon Jhin, he couldn&rsquo;t see, a cloud sat in the air\nTo make things worse, the town&rsquo;s engulfed, there&rsquo;s smoke just everywhere\nHe saw his target running, and knew it was a bluff\n&ldquo;He&rsquo;s gonna turn and bolt&rdquo; he thinks, &ldquo;I swear, I&rsquo;ve had enough&rdquo;\n\nContent with all that&rsquo;s been so far, and happy to end the score\nHe brings his finger to the trigger, and then he screams out four\nThe final bullet fires hard, destroying the saloon\nHe takes a breath of air in, his target&rsquo;s met his doom\n\nAnd now we head on back to graves, whose standing in the dust\nHe called a bluff, and made the play, when he could have well gone bust\nThe smoke and debris settle, and Graves sees High Noon Jhin\nThe man&rsquo;s reaction was furious, the angriest he&rsquo;d been\n\nYou see no one had escaped him, his art was his kill\nHe thought no one could outsmart him, and that no one ever will\nHis only failed mission, he&rsquo;ll remember all his days\nWhen he tried to kill the legend, the outlaw known as Graves","replies":[{"poster":"Jason","date":"2017-04-29T11:30:27.509+0000","up_votes":2,"down_votes":0,"body":"now that it won't affect voting proceedures;  https://www.youtube.com/watch?v=tvQQL4iwgDU&t=331s\n\nI made a video with this and turned it into a song. Enjoy!","replies":[{"poster":"The Hanshmear","date":"2017-05-04T12:24:15.586+0000","up_votes":1,"down_votes":0,"body":"Such a rad video Jason! How'd you put together the backing track?","replies":[{"poster":"Jason","date":"2017-05-05T05:10:28.091+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Hanshmear,realm=OCE,application-id=wJE2nAgV,discussion-id=bKhuFwAX,comment-id=00010000,timestamp=2017-05-04T12:24:15.586+0000)\n>\n> Such a rad video Jason! How&#x27;d you put together the backing track?\n\nI found a Johnny cash instrumental, applied a basic bass filter to it so it'd miss automatic content detection, then cut one small part and put it on loop, having a second small part exclusive for the end of each verse.\n\nI've done voice acting a lot, but never really done audio production or editing that wasn't just a voice, so I'm quite proud of how it all came together :)","replies":[]}]}]},{"poster":"Ahri Ahri Ahri","date":"2017-04-20T06:22:49.070+0000","up_votes":2,"down_votes":0,"body":"Logged in to up vote. This was incredible. Hope you do well. <3","replies":[]}]}