{"poster":"WardMachïne","date":"2017-05-30T17:29:08.438+0000","title":"Silber Team sucht ADC","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Welcome to Summoner&#039;s Rift...\r\n\r\nein Spruch, den wir alle kennen, lieben und manchmal auch hassen.\r\n\r\nWir sind ein aktives Team, welches mehrere Male pro Woche trainiert. Unsere Trainingszeiten sind abh&auml;ngig von der aktuell verf&uuml;gbaren Zeit unserer Teammitglieder. Wir entscheiden jede Woche auf&#039;s Neue &uuml;ber die Trainingszeiten f&uuml;r die kommende Woche, um auf private Bed&uuml;rfnisse besser eingehen zu k&ouml;nnen. Daf&uuml;r nutzen wir ein Online-Dokument, in welches jeder seine verf&uuml;gbare Zeit f&uuml;r die kommende Woche eintr&auml;gt. Eines ist klar, das Privatleben geht vor und wird von allen respektiert!\r\n\r\nDie Elo unseres Team&#039;s liegt im Silber Bereich. Ziel ist es, im Flex-Ranked aufzusteigen, uns zusammen zu verbessern und eventuell einmal an Amateur-Turnieren teilzunehmen. Da sich unser Team in einem festen Clan befindet, ist ein Beitritt zu diesem, Foxes-Empire, erforderlich (sowie die Anmeldung in unserem Forum). Pflichten kommen dabei jedoch nicht auf euch zu (weder Online-Aktivit&auml;t noch sonstiges).\r\n\r\nAufgrund des Ausstieges unserer ADC&#039;s, suchen wir daher einen neuen ADC im Silber Bereich. Dein Alter sollte bevorzugt 18+ sein, jedoch lassen wir uns auch gern unterhalb dieser Grenze von deiner geistigen Reife &uuml;berzeugen. Teilnahme am Teamspeak ist w&auml;hrend unseres Trainings pflicht. Au&szlig;erdem legen wir viel Wert auf Kommunikation. Sich berieseln lassen gibt es bei uns nicht, wir wollen deine Stimme auch h&ouml;ren ;) .\r\n\r\nIhr k&ouml;nnt euch gern pers&ouml;nlich bei mir (Mada&iuml;on) melden, auch wenn ihr zus&auml;tzliche Informationen ben&ouml;tigt. (Das &iuml; wird mit gehaltener &quot;alt&quot; Taste und dem Tippen von 0239 auf dem Nummernpad erzeugt)\r\n\r\nMit freundlichen Gr&uuml;&szlig;en,\r\nMoritz","replies":[{"poster":"LoLFighter1910","date":"2017-05-30T21:28:17.002+0000","up_votes":1,"down_votes":0,"body":"Ich bin 14 Jahre alt und beherrsche die adc Rolle recht gut.\nAm positioning könnte man noch arbeiten aber mechanisch bin ich ziemlich gut.\nMit einem guten supporter auf der lane(mit dem ich mich auch gut verstehe) dürften wir die botlane zu 70% gewinnen.\nAußerdem suche ich ein team, da meine Freunde meist keine Zeit oder Lust haben, LoL zu spielen.\nAlso bringe ich auch Zeit mit.\nIch werde dir morgen eine Freundschaftsanfrage schicken.\nMfG Benedikt aka LoLFighter1910","replies":[]},{"poster":"MakeMeFamous","date":"2017-05-30T21:19:06.687+0000","up_votes":1,"down_votes":0,"body":"Guten Abend, ich habe dich einmal geaddet wegen der Suche nach einem ADC.\nZu meiner person, ich bin männlich, 20 Jahre alt und spiele jetzt seit ca einem Jahr ADC und bin auch auf vielen erfolgreich. Aktuell bin ich in Soloq Silber 4 und in Flex B3. Auf meinem 2. Acc bin ich lustigerweise Gold5.\nIch würde mich gerne dazu bereitstellen mich weiter vorzustellen (teamspeak sowie Skype und Discord sind vorhanden):)\nMfg","replies":[]},{"poster":"ËXË","date":"2017-05-30T19:18:08.552+0000","up_votes":1,"down_votes":0,"body":"Guten Tag Madaïon falls ihr noch einen ADC sucht würde ich mich gerne dafür bewerben. Habe dir eine Freundschaftsanfrage Ingame gesendet","replies":[]},{"poster":"InFamE775","date":"2017-05-30T19:05:13.989+0000","up_votes":1,"down_votes":1,"body":"Hallo ich bin erst 14 denke aber das ich mich gut benehmen kann. Momentan B3 aber ich climbe im Moment um wieder auf Silber zu kommen.","replies":[]}]}