{"poster":"Abiura","date":"2015-03-31T19:11:45.591+0000","title":"Lo schifo di sistema delle placements","subforum":"Discussioni generali","up_votes":1,"down_votes":3,"body":"Io non riesco a capire come diavolo funziona il sistema di posizionamento nelle ranked, la scorsa stagione ero argento 4, ho fatto poco fa la mia ultima ranked e sono finito con 8 ranked vinte e 2 perse. Speravo almeno in un silver 3, e invece mi hanno lasciato in silver 4. Boh, e poi ci sono quelli che hanno finito con 6 vinte e 4 perse e stanno in silver 2 da silver 4. Se qualcuno sa come funziona me lo spieghi per favore dato che queste cose mi fanno solo salire il veleno","replies":[{"poster":"BluFoxer","date":"2015-03-31T19:19:51.363+0000","up_votes":1,"down_votes":0,"body":"Probabilmente hai giocato nella pre-stagione e hai perso molte più ranked del dovuto e quindi il tuo mmr si è abbassato un pò.\n{{champion:9}}","replies":[{"poster":"Abiura","date":"2015-04-06T19:44:46.465+0000","up_votes":1,"down_votes":0,"body":"Ho perso solo 2 ranked mentre giocavo nella pre-season... Ma comunque pensandoci non so nemmeno in base a cosa si calcola l'mmr, quindi forse un po' me lo merito di stare li xD. Grazie comunque {{summoner:2}}","replies":[]}]},{"poster":"Dr LouD","date":"2015-04-01T10:10:05.930+0000","up_votes":1,"down_votes":0,"body":"Sei sei stato già rankato nella season precedente, nella nuova subisci un \"soft reset\", ovvero il sistema ti abbassa leggermente l'mmr quando andrà a calcolare il tuo piazzamento.\n\nIn più conta anche in che modo hai giocato le ranked, le serie di vittorie e sconfitte influiscono davvero molto le prime 10 ranked.\nPer esempio, perderne alcune di fila all'inizio ti pregiudica molto l'mmr, che cala a picco.\n\nEsempio banale:\nvvvvvvvvpp > ppvvvvvvvv\nPartendo da Silver 5, con la prima potresti arrivare anche gold, con la seconda resti in Silver\n\nPS: ovviamente sono esempi casuali e non del tutto veritieri, giusto per far capire il concetto","replies":[{"poster":"Abiura","date":"2015-04-06T19:43:02.004+0000","up_votes":1,"down_votes":0,"body":"Ok, la prima cosa proprio non la sapevo perciò ti ringrazio :D.\nCiò che continuo a non capire invece è proprio quello che mi dici dopo, è successo (tra le altre cose) esattamente come hai detto tu, e cioè le prime 8 le ho vinte e poi ho perso le ultime due... Non saprei proprio. Grazie mille in ogni caso","replies":[]}]}]}