{"poster":"XxlentaoxX","date":"2016-11-21T21:15:21.516+0000","title":"¿Riot y Coca-Cola juntos?","subforum":"Charlas Generales","up_votes":1,"down_votes":20,"body":"Riot est&aacute; realizando publicidad a Coca-Cola con su ultima skin, esa de Braum pap&aacute; noel (viejito pascuero jajajajajaajajajajajajajaja)...","replies":[{"poster":"pajarit0","date":"2016-11-21T21:16:24.396+0000","up_votes":3,"down_votes":0,"body":"papa noel o santa para el resto del mundo","replies":[{"poster":"FedecarboneroUY","date":"2016-11-21T21:29:10.367+0000","up_votes":5,"down_votes":0,"body":"Papá Noel lo creo la Coca Cola, por eso posteó eso.\nDe todas formas me parece mal el post, porque ya hay skins así de papa noél como Gragas, Zilean y no sé cuáles más..","replies":[{"poster":"Yitán","date":"2016-11-22T03:45:20.910+0000","up_votes":1,"down_votes":0,"body":"que yo sepa no lo creó coca cola, solo adoptó su imagen y/o compró los derechos.\nsi buscas en internet, te sale que papa noel tenia traje verde hasta que coca cola lo compró y lo cambió por uno rojo","replies":[{"poster":"FedecarboneroUY","date":"2016-11-22T04:11:45.641+0000","up_votes":1,"down_votes":0,"body":"No sabría pasártelo porque yo lo sé porque lo leí en una revista que daban en mi país cuando era chico (se llamaba Charoná xd), acá lo busque y dice: \"Sin embargo, el Papá Noel tal y como todos lo conocemos en la actualidad nació en 1931, por encargo de la agencia de publicidad de Coca-Cola al dibujante Haddon Sundblom. El objetivo era crear un personaje a medio camino entre lo simbólico y lo real, la personificación del espíritu navideño y la felicidad de Coca-Cola. Para ello, el ilustrador se inspiró en el poema «A Visit From St. Nicholas» de Clement Clark Moore.\"\n\nhttp://www.cocacolaespana.es/historias/historia-papa-noel\n\nLa imagen de Papa Noel, la imagen de ese hombre \"gordo\" y con esa ropa la creo la Coca Cola para publicidad.","replies":[{"poster":"Yitán","date":"2016-11-22T04:43:49.185+0000","up_votes":1,"down_votes":0,"body":"claro, pero el concepto ya estaba, coca cola le hizo el rework","replies":[]}]}]},{"poster":"vaz2001","date":"2016-11-21T22:46:49.362+0000","up_votes":1,"down_votes":0,"body":"Veigar y el Yeti de Nunu","replies":[{"poster":"FedecarboneroUY","date":"2016-11-21T22:54:53.016+0000","up_votes":1,"down_votes":0,"body":"Iba a decir el Nunu pero me pareció como que no era Papa Noel xD","replies":[{"poster":"vaz2001","date":"2016-11-22T00:24:58.173+0000","up_votes":1,"down_votes":0,"body":"Es que Nunu es un elfo y Wilump(creo que se llama así el Yeti) santa :P","replies":[{"poster":"FedecarboneroUY","date":"2016-11-22T00:45:04.839+0000","up_votes":1,"down_votes":0,"body":"aahha xD","replies":[]}]}]}]}]}]},{"poster":"Sir Crucifix ","date":"2016-11-21T22:37:06.934+0000","up_votes":2,"down_votes":0,"body":"deberian hacer y con un codigo que valga por RP","replies":[]},{"poster":"Runth","date":"2016-11-21T22:37:35.348+0000","up_votes":2,"down_votes":1,"body":"callad y dame una pepsi","replies":[]},{"poster":"LaReinaPingüino","date":"2018-09-10T22:14:44.118+0000","up_votes":1,"down_votes":0,"body":"Pfff... la bebida con azúcar es lo más engordador, (el azúcar es adictiva, engordadora, inhibe la reproducción celular y la producción del cuerpo de colágeno, cuñausa retención de líquidos e inflamación a nivel celular y causa desbalances hormonales y cambios hormonales, mas encima estudios recientes prueban que el exceso de azúcar a la larga puede causar depresión y alzáimer, porque hace que el cerebro no pueda metabolizar glusñcosa, y el cerebro necesita energía para duncionar bien, entonces al no metabolizar la glucosa se termina atrofiando a la larga). Osea aunque seas delgado y muy activo el azúcar igual daña la salud a largo plazo.\n\nY aunque la bebida no tenga azúcar uno se llena de gas, además gracias al gas x cada vaso de bebida uno comienza a botar el calcio de los huesos por la orina por 2 días (lo que aparte de descalcificar los huesos a la larga produce cálculos en los riñones o en los conductos urinarios o en la vesícula).\n\nSólo le veo útil si queren tener cálculos o andar por la vida gaseosos y con mala calidad de piel, etc. Unos cuantos RP no lo valen.","replies":[]}]}