{"poster":"xShadowLotus","date":"2017-07-18T16:42:09.468+0000","title":"Curiosità sul forum","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Girando sul forum eune ho trovato questo\n\nhttps://boards.na.leagueoflegends.com/en/c/gameplay-balance/jLGvQ3Wk-before-you-make-a-post-about-balance\n\nVorrei sapere se si puó tradurre e mettere in evidenza pure qui \nGrazie dell aiuto","replies":[{"poster":"Don Draven","date":"2017-07-18T17:15:08.319+0000","up_votes":3,"down_votes":0,"body":"Nah lascia stare,troppo lavoro e troppo intelligente come topic{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"xShadowLotus","date":"2017-07-18T17:24:29.505+0000","up_votes":3,"down_votes":0,"body":"Non perdere le speranze su questa comunity","replies":[{"poster":"Don Draven","date":"2017-07-18T17:33:08.838+0000","up_votes":1,"down_votes":0,"body":"Le speranze le perdo nel momento in qui cerco di scrivere una frase di senso compiuto sulla tastiera del telefono :P,per questo non posso aiutare,mi spiace.\n\nL'idea è bella e intendo il tuo goal ma dopo 30 minuti di ranked dove il tizio vede il suo team grindato dalla quadrupla di {{champion:20}}  verrà sempre a dannare l'anima !","replies":[]}]}]},{"poster":"TrueZarro","date":"2017-07-20T08:23:49.227+0000","up_votes":1,"down_votes":1,"body":"Mi sono sbattuto, ho cercato di tradurre in maniera che anche i modi di dire utilizzati da chi ha scritto il post originale possano avere un significato in italiano.\nSpero effettivamente qualcuno legga perchè sono considerazioni interessanti. :)\n\n    \n1) Livello di abilità\nSi può discutere quanto si vuole ma campioni differenti avranno minore o maggiore impatto a seconda del livello di abilità. Alla fine dei conti diventa una questione se sarai più abile a sfruttare gli errori avversari (come ad esempio con blitzcrank) o a sfruttare i punti di forza del campione (come ad esempio Lee sin). Sappiate perciò che quando le persone commentano sul forum, potrebbero star valutando la situazione in maniera differente a seconda della loro esperienza con i campioni.\n\n    2) Gioco competitivo\nPer poter parlare in maniera adeguata della forza di un campione in termini di bilanciamento, è necessario considerare una situazione equilibrata di gioco. Al di fuori della scena competitiva infatti il livello di abilità del giocatore può influire sulla sconfitta del team tanto quanto lo possa fare la forza del campione preso in esame e questo crea una situazione NON equilibrata che porta a valutazioni errate. La scena competitiva è quanto di più vicino si possa avere ad una situazione equilibrata, ed è quinid possibile valutare in maniera effettiva i punti di forza e debolezza dei campioni insieme con il sistema di bilanciamento stesso.\nQuesto non implica che parlare di bilanciamento anche nei livelli di gioco più bassi sia errato, tuttavia questo accade con meno frequenza poiché è difficile andare a bilanciare qualcosa senza creare squilibri dall'altra parte.\nTutto questo in ogni caso non mira a invalidare le opinioni di chi scrive e commenta, ma è mio desiderio poter far comprendere la ragione per cui l'impatto che un campione ha sulla scena competitiva porta a cambiamenti in maniera molto più drastica e veloce rispetto a quello che potrebbe succedere nella scena non competitiva.\n\n    3) Core Design\nCome affermato da Scarizard esistono molti fattori che giocano la loro parte all'interno delle decisioni sul bilanciamento. Uno dei punti più importanti su cui si focalizza la filosofia della Riot riguarda il fatto che sia possibile parlare di bilanciamento a partire dalla divisione Platino, a salire. Questo perchè le partite al di sotto di questo rank solitamente hanno una disparità tale tra i livelli di abilità e di conoscenze dei giocatori che non è possibile parlare di bilanciamento in maniera oggettiva.\nQuesto non vuole svalutare in alcuna maniera le opinioni o i feedback che i giocatori di livello inferiore al platino possono esprimere, ma quando si hanno le idee confuse riguardo al bilanciamento è importante ricordarsi che il sistema tende a riferirsi alle situazioni di gioco a partire dal platino.\n\n    4) Motivazioni\n\nSe non spieghi il motivo per cui non sei felice riguardo all'attuale bilanciamento del gioco, per quale ragione noi dovremmo leggere un tuo post? In che maniera potremmo mai provare \"empatia\" nei tuoi confronti? In altre parole, \"ho perso\" non è una valida ragione per affermare che un campione sia fortissimo oppure scarsissimo.\n\n    5) Attuale sistema\n\nMolte volte può succedere all'interno di una stagione che un campione, il quale non ha mai avuto cambiamenti/ non è stato giocato, improvvisamente diventi un pick dominante e ultra popolare. Questo potrebbe essere determinato dal fatto che il meta attorno a quel campione sia cambiato in maniera favorevole, rendendolo di fatto un pick solido. Ricordatevi di questo quando rimanete interdetti di fronte a eventuali buff o nerf che un campione sembra ricevere dal nulla.\n\n\n    6) Focalizzarsi sulla discussione\nSe state commentando aspettandovi una risposta dalla Riot in persona, e non ascoltate nessun'altro commento al di fuori di quello di un Rioter, devo purtroppo comunicarvi che rimarrete delusi. Sono molto più alte le probabilità che un Rioter possa intervenire in una discussione portata avanti dalla Community, piuttosto che un suo intervento riguardo uno specifico post di un utente.\nMolte persone creano involontariamente post non chiari sul bilanciamento. Post che spaziano su numerosi argomenti anche molto diversi fra loro, in questa maniera risulta anche molto difficile per chi legge e commenta poter  controbbatere sulle argomentazioni di chi ha scritto il post.\nRicordatevi dovete essere disposti ad ascoltare se vi aspettate di essere ascoltati.","replies":[]}]}