{"poster":"Lapou","date":"2015-10-11T20:26:14.472+0000","title":"Hasta en Diamantes hay toxicos","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":6,"body":"Soy plata 1, voy a jugar una normal con Kennen de support, tengo un adc afk pero no pasa nada con el team la carrileamos 4 vs 5.\nMin mas o menos 35 el lee sin empieza a flamear porque se muere solo,  en una se van a hacer baron estoy yo y el jarvan Diamante, solos, el jarvan se tira solo suicida se muere despues entra el ekko con el stun y entro yo me ago un triple , el jarvan me dice porque me armo Gloria justiciera(se nota q no mira el mundial) y me dice platita de mierda, total que me quedo en base y pierden a los 5 minutos.\n\nhttp://i.imgur.com/DuzsqZZ.jpg\nhttp://i.imgur.com/PXJtDqf.jpg\n\nhttp://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/254471042/200557452?tab=overview","replies":[{"poster":"Annie Botz","date":"2015-10-11T20:31:33.511+0000","up_votes":1,"down_votes":0,"body":"Qué tiene que sea diamante ..\nAparte una normal es diferente a una rank, tal vez no jugó en serio sin mucha importancia por esa razón.\nY claro, en todas las ligas/divisiones hay flamer's o simplemente gente de poca paciencia, tienes que mutearlos y listo","replies":[{"poster":"Lapou","date":"2015-10-11T20:38:25.455+0000","up_votes":1,"down_votes":0,"body":"No digo que me importen las criticas destructivas(que no me importan) digo que como diamante debe o debería dar el ejemplo a los jugadores de ligas inferiores, es una falta de moral y de sinceridad. \nMe decepcionan los jugadores que son buenos pero tiene una actitud de mierda.","replies":[{"poster":"Annie Botz","date":"2015-10-11T20:47:17.966+0000","up_votes":2,"down_votes":0,"body":"Y bueno, si con esa actitud llegaron a Diamante bien por ellos, a mi también me pasa a veces, no soy capaz de soportar errores como cuando aviso algo y mueren igual.\nSi fuera de dar el \"ejemplo a seguir\" no existiría el eloboost.\nY ser buen jugador no significa ser amable con la gente.\nEn las rank que juego que son con platinos hay veces que no dicen una palabra y así todo el game.. aunque de todas formas se pierde por falta de comunicación. Yo prefiero a alguien que escriba todo el rato y que a pesar de quejarse aporte un poco (como timear spells) antes que alguien que se queda callado todo el game y que solo responde \"gj\" \"u2\".\nEn el fondo el que insulta da a conocer los problemas y no se queda callado, no digo que esté bien pero para mí es preferible (aunque lo termine muteando :v)","replies":[]}]}]},{"poster":"WáF WíthoütEquál","date":"2015-10-11T21:07:41.667+0000","up_votes":2,"down_votes":1,"body":"''y me dice platita de mierda, total que me quedo en base y pierden a los 5 minutos.'' Eso no se hace, por muy enojado que estes, te mereces un ban.","replies":[]},{"poster":"Zhaggy","date":"2015-10-14T18:50:33.912+0000","up_votes":1,"down_votes":0,"body":"\"SE NOTA QUE NO MIRA EL MUNDIAL\" AJJAJAJAJAJ parece que los \"pleier\" de LAS no saben diferenciar el mundial/lcs que es totalmente diferente del solo queue jajaja","replies":[]},{"poster":"Gannicüs","date":"2015-10-13T12:04:05.332+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo no hacer lo que hacen en el mundial, si vos estarias a ese nivel estarias jugando ahi, por gente como vos no se puede jugar ranked, miran videos y despues se creen que les dan las manos para hacerlo y gg partida","replies":[{"poster":"Lapou","date":"2015-10-14T11:22:13.884+0000","up_votes":1,"down_votes":0,"body":"No me parece","replies":[]}]},{"poster":"Salfate Otaku","date":"2015-10-12T00:34:10.493+0000","up_votes":1,"down_votes":0,"body":"mira te voy a decir si xpeke es ultra flamer y esta en el mundial tu crees que aran algo con el ese xD ( pd : si defienden a peke jueguen una partida con el en ranked o normal y se daran cuenta lo que digo ) en resumen en todos lados ahy flamers sea plata oro diamantes challenguer o mundial o cualquier servidor solo asle mute y report y si te quedas afk te perjudicas solo x que estas haciendo algo peor que el {{summoner:2}} {{summoner:2}}","replies":[]},{"poster":"Abrezzi","date":"2015-10-12T00:17:39.944+0000","up_votes":1,"down_votes":0,"body":"Una división no cambia la personalidad de nadie, estoy seguro que hasta en Challenger hay flamer y tóxicos que no se bancan perder","replies":[]},{"poster":"ll Leoh ll","date":"2015-10-11T20:35:26.580+0000","up_votes":1,"down_votes":0,"body":"hasta en challenger hay tóxicos así que preocúpate de jugar como te gusta a ti, mutea y los reportas al final","replies":[{"poster":"Lapou","date":"2015-10-11T20:41:31.288+0000","up_votes":1,"down_votes":3,"body":"Igual era una normal xD me importó 3 cominos lo q decian pero ta.. lastimosamente en plata hay gente que capaz no juegua como diamantes pero son mas respetuosos y autocriticos","replies":[{"poster":"Ing Mecanico","date":"2015-10-13T05:31:31.647+0000","up_votes":2,"down_votes":0,"body":"TE IMPORTO Y MUCHO POR ALGO LO POSTEASTE.","replies":[]}]}]}]}