{"poster":"kaijukitten","date":"2019-07-13T06:18:04.420+0000","title":"Please make more comps viable.","subforum":"Teamfight Tactics","up_votes":2,"down_votes":0,"body":"Some comps are almost never seen because it's too hard to get enough (Guardian, Demon, Dragon) while others are much too prevalent or overpowered (Elementalist, Assassin, Glacial). \r\n\r\nSomething needs to be done to improve the champion pool, because there are many times you lose a game either because you can't get a coherent team comp, and/or you can't upgrade any units even if no one else is buying them. It's a tad ridiculous.","replies":[{"poster":"RavenMagus","date":"2019-07-13T06:36:09.025+0000","up_votes":1,"down_votes":0,"body":"I feel like sorcerers are auto-trash simply because they can't beat the dragon PvE rounds due to them being spell immune.\n\nGuardians and Dragons are fine because they're only 2-unit synergies, they can serve as a nice addon to other comps just like Phantom is.  Although dragon is more of a selfish comp than the others so they don't matter as much.\n\nI think most of the synergies are fine, it's just individual champion balance that is rather whack in some cases.\n\nExcept for maybe assassins, which is just ridiculously strong for how easy it is to build.","replies":[{"poster":"PikemanDim","date":"2019-07-13T06:42:08.418+0000","up_votes":1,"down_votes":0,"body":"Sorcerers are how I win most of my games. Just combo them with a few other units that benefit well from the 100% Increased spell damage. Sorcerer-Wild is always a good one if you ask me. Just enough of a tanky from line to handle dragons/rift herald and the back line casters (Karthus, Sol, Ahri) just blow up ranged and a well placed Morgana just recks most assassin teams.","replies":[{"poster":"RavenMagus","date":"2019-07-13T16:09:19.977+0000","up_votes":1,"down_votes":0,"body":"I have won a couple games off buff Ahri and Karthus carries but going pure sorcerer just hasn't been working out lately.  Even a buff Warwick/Kassadin frontline can't save me from dragon because I have zero damage against it and it two-three shots everything.  Assassin comps tend to auto win me too (morgana dies in 2 hits) unless I get several phantom cancers for my backline.\n\nI like the sorcerers but unless I get really lucky with dupes early on (and I usually don't) then it has a very hard time transitioning to lategame.\n\nAnd even Ahri/Asol don't carry nearly as hard as Draven with a good teamcomp.","replies":[]},{"poster":"ShadWooo","date":"2019-07-13T07:49:32.336+0000","up_votes":1,"down_votes":0,"body":"Tried Sorceres three times. Three times 8th, three times died to golems and wolves and if I got that far then to raptors as well.\n\nI even had frontline, had level2 kassa and garen serving as frontline for my Yuumi Varus/Veigar and lulu but every single time game wass offering me anythign else than these champions and I was losing from start. In the end I swapped Varus for level 2 Kenen with Yuumi, but it didn't help I got facerolled by assassins and wild/shapeshifter comps super hard.\n\nI know this comp gets really strong when you get 6 of them, but I have no idea how to reliably get to that phase. Going nobles or assassins early only so you could sell all units and buy 6 sorcerers and hope you get them to level2? Even if that worked, only 1 of the sorcerers is a bit tanky and that is Kassadin and he doesn't seems to be enough for early and midgame at least.\n\nIs this comp relying on Force of Nature or 2+ Yuumi spatulas?","replies":[]}]}]},{"poster":"Z3SIeeper","date":"2019-07-13T07:56:13.645+0000","up_votes":1,"down_votes":0,"body":"Nonono. We had Dragons powerful once and it was horrendously overpowered. Sol and Shyv are still good units.\n\nGuardian got buffed and it's actually extremely strong for only 2 units.\n\nDemon has a rework on the PBE (removing proc chance scaling, adding 1x/2x/4x damage scaling).","replies":[{"poster":"kaijukitten","date":"2019-07-13T08:48:21.653+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Z3Sleepier,realm=NA,application-id=RaE1aOE7,discussion-id=LXPBpGiG,comment-id=0001,timestamp=2019-07-13T07:56:13.645+0000)\n>\n> Nonono. We had Dragons powerful once and it was horrendously overpowered. Sol and Shyv are still good units.\n> \n> Guardian got buffed and it's actually extremely strong for only 2 units.\n> \n> Demon has a rework on the PBE (removing proc chance scaling, adding 1x/2x/4x damage scaling).\n\nI meant more that you barely ever see them enough to get the dragon comp to even work. I've barely ever seen Aurelion Sol in any of my games, Shyvana being a tad less rare, so actually being able to proc the dragon comp seems to be a very rare thing. I'd like it if more comps were both visible and viable than just the same Assassins, Glacial, Pirate, Noble. You see those comps all the time, and they're also good comps so everyone wants them, it'd be nice if the other comps were as prevalent or worthwhile.","replies":[]}]}]}