{"poster":"ZunGlide","date":"2015-07-12T21:57:32.258+0000","title":"Desconexiones repentinas durante el juego!","subforum":"Problemas Técnicos","up_votes":7,"down_votes":0,"body":"Hola Gente! Bueno, hago este post b&aacute;sicamente por que eh sufrido varios problemas con la conexi&oacute;n durante algunas de mis partidas.\nTodo esto comenz&oacute; hace unos d&iacute;as, no quiero mentir, pero me parece que desde el lanzamiento del parche 5.13. Lo que sucede es que se me desconecta del servidor, puedo seguir moviendo a mi campe&oacute;n, pero no puedo castear habilidades ni ver a los dem&aacute;s. Tambi&eacute;n suele aparecerme el cartel de Reanudando Conexi&oacute;n. \nAnte estos problemas, contact&eacute; a mi proveedor de Internet el cual no report&oacute; ninguna perdida de paquetes, ni perdida de conexi&oacute;n durante las horas en cuesti&oacute;n. Para descartar por &uacute;ltimo alg&uacute;n problema propio, eh podido comprobar que mi Internet sigue funcionando normalmente cuando estoy desconectado del servidor, abriendo alguna p&aacute;gina web, o stream, etc.\nPara agregar, y lo m&aacute;s raro, es que a amigos (con los cuales hablo en dichos momentos por TS) no les sucede nada; sin embargo a compa&ntilde;eros de equipo de mi partida si les sucede.\nNo se si tendr&aacute; algo que ver, pero el primer d&iacute;a que not&eacute; esto, volvi a conectarme a la tarde/noche y hab&iacute;a en el cliente, un aviso de Riot que dec&iacute;a que estaban sufriendo desconexiones con algunos jugadores, y estaban trabajando en ello para solucionarlo.\nNecesitar&iacute;a saber si a alguien tambi&eacute;n le sucede, o saben de algo al respecto. Y me gustar&iacute;a que alguno me ayude a solucionarlo o, en caso de que sea alg&uacute;n problema del servidor, saber si se esta solucionando.\nDesde ya muchas gracias!\n\nEDIT: Algo que me pareció importante agregar es que durante las desconexiones, mi ping permanece normal, alrededor de los 40 ms","replies":[{"poster":"BlackFuture","date":"2015-07-12T22:53:37.268+0000","up_votes":4,"down_votes":0,"body":"Tengo el mismo problema, recien en una aram se me desconecto facil mas de 10 veces, \"reanudando conexion\" y 500ms de ping durante eso es lo que me sale, jugando otrs juegos online me va lo mas bien, por ahora recomiendo no jugar","replies":[]},{"poster":"Peppa Píg","date":"2015-07-12T22:20:41.765+0000","up_votes":2,"down_votes":0,"body":"Igual... no aparece nadie dando solución alguna.\nTelefonica Speedy Arg{{summoner:3}}","replies":[]},{"poster":"MM Vanry","date":"2015-07-14T23:21:00.950+0000","up_votes":1,"down_votes":0,"body":"Alguien ha solucionado el problema? Yo sigo con lo mismo :/  no puedo jugar TT_TT tambien chequeo las conexiones y no hay problema :/ ayuda plz !!!","replies":[]},{"poster":"Blednar","date":"2015-07-13T22:59:09.743+0000","up_votes":1,"down_votes":0,"body":"A mi se me \"cayo el Internet\" cuando estaba hablando con amigos por skype, y encima la partida me fue borrada del historial.\nPD: A TODOS mis amigos también se les cayo, mientras estábamos por skype.","replies":[]},{"poster":"YellowStar1","date":"2015-07-13T01:17:21.297+0000","up_votes":1,"down_votes":0,"body":"Mismo problema, estoy de lo más bien y de repente se corta la conexión y me dice ''Reanudando conexión'' y vuelve cuando termina la pelea, Lo peor es que no pierdo la conexión en otros dispositivos, sólo en LoL A si que asumo que sera un problema de este no ¿?, Ojalá riot responda pronto es muy muy molestoso\n{{champion:429}}","replies":[{"poster":"ZunGlide","date":"2015-07-13T13:20:04.642+0000","up_votes":1,"down_votes":0,"body":"Exactamente lo mismo me sucede :/","replies":[]}]},{"poster":"MM Vanry","date":"2015-07-13T02:37:53.583+0000","up_votes":1,"down_votes":0,"body":"Hola, seria bueno que dijieses tu Compañia, ya que yo tengo VTR y desde el parche 5.13 me da exactamente el mismo problema, ojala puedas responder, hablamos","replies":[{"poster":"ZunGlide","date":"2015-07-13T13:18:19.225+0000","up_votes":1,"down_votes":0,"body":"Hola y gracias por comentar! Mi compañia es Fibertel, pero como dije, no creo que sea problemas de proveedor pro que estuve hablando con ellos mediante la Atención al Cliente y demás. \nOjalá encontremos solución :)","replies":[]}]},{"poster":"MM Vanry","date":"2015-07-13T05:09:10.829+0000","up_votes":1,"down_votes":0,"body":"Riot plz ! ayuda con este tema !! somos varios con el mismo problema !! :/","replies":[]},{"poster":"NightRed","date":"2015-07-13T04:31:25.009+0000","up_votes":1,"down_votes":0,"body":"a mi me pasa que tengo de ping 25 y de repente me da lag y sale el cartel de reanudando conexión y nose porque pasa eso ayer hice pruebas ping a google, speedtest, etc. y todos salieron con ping 25 a 30, se nota que el problema es con el servidor del juego porque cuando entro a jugar da lag y aparezco muerto por culpa de eso, ojala riot lo solucione porque a nadie le gusta jugar con lag ni nada por el estilo :/","replies":[]},{"poster":"ChristaSNK","date":"2015-07-13T03:02:56.143+0000","up_votes":1,"down_votes":0,"body":"Me sucede lo mismo, luego de desconectarme y volver entrar veo todo pegado, los jugadores quietos, yo no puedo ver cuando uso una habilidad, puedo moverme sin dificultad por el mapa pero no puedo ver lo que sucede. Algo que me pareció extraño fue que si puedo ver lo que escriben en el chat. Lo único diferente es que me sucede desde antes de la 5.13. No creo que sea problema de mi proveedor (vtr) ya que al jugar otros juegos en linea no me ocurre este problema. \nEs tercera vez que tengo baja prioridad por este problema, si encuentran alguna solución seria de utilidad.{{summoner:31}}","replies":[]},{"poster":"Luishipor","date":"2015-07-13T02:47:06.940+0000","up_votes":1,"down_votes":0,"body":"a la mañana entre bien pero no me aparecio el login ese {{champion:32}} {{summoner:3}} {{item:3151}}","replies":[]},{"poster":"YellowStar1","date":"2015-07-13T02:25:59.026+0000","up_votes":1,"down_votes":0,"body":"Tampoco funciona este post http://boards.las.leagueoflegends.com/es/c/charlas-generales/G5qamAfp-errores-de-desconexian-de-pvpnet Eh estado probando y nada.. \n{{champion:429}}","replies":[]},{"poster":"FireVot","date":"2015-07-13T02:00:22.153+0000","up_votes":1,"down_votes":0,"body":"Nunca me paso a mi este problema","replies":[]},{"poster":"collote1980","date":"2015-07-13T01:53:53.519+0000","up_votes":1,"down_votes":0,"body":"les dejo la solucion mas facil porque no creo que los de riot se molesten en arreglar el server porque ellos la plata la ganan igual la solucion es pasarse a L A N ahi no hay desconexiones ni tirones  de lag por lo menos ahi se preocupan por los que juegan saludos espero haberles ayudado","replies":[]},{"poster":"Gian7","date":"2015-07-13T00:46:14.787+0000","up_votes":1,"down_votes":0,"body":"a mi me pasa lo mismo entro juego un rato y se me va no me deja reconectarme hasta que termina toda la partida nadie me usa internet ni nada ta todo bien y de la nada se traba y chau por culpa de esto tengo cola en 5 partidas y no me quize ir de ninguna porque las estaba ganando{{champion:32}}","replies":[]},{"poster":"sonizskk","date":"2015-07-13T00:40:24.126+0000","up_votes":1,"down_votes":0,"body":"tengo el mismo problema desde VTR- Temuco   {{champion:17}}","replies":[]},{"poster":"NicolasBj","date":"2015-07-12T23:56:50.848+0000","up_votes":1,"down_votes":0,"body":"Nose para que actualizan el lol ,si tengo alto lag ahora como vos amigo","replies":[]}]}