{"poster":"LukeRyanRaso","date":"2016-09-29T00:31:29.579+0000","title":"Someone Help Me To Fix The Maestro Error (Mac)","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"So I play league of legends religiously and 2 days ago I joined into a game, and my game closed. I tried opening league of legends, and it wouldnt open, it would bounce once and not do anything. I clicked on LoLClient and it brought me to terminal, and opened up league straight to the login screen. A message came up saying \"There was an error connecting with Maestro. League Of Legends will now exit. Please try restarting the client.\" If anyone could help me that would be amazing and much appreciated !!! Thanks everyone. I just want to play my Silver 1 to Gold 5 Promos.","replies":[{"poster":"SephirothSG","date":"2016-10-02T01:55:52.544+0000","up_votes":1,"down_votes":0,"body":"Hey there,\n\nCould you try running through the [Troubleshooting Connection Issues (Mac)](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#section-mac) support article for me, let me know if anything helps.","replies":[{"poster":"LukeRyanRaso","date":"2016-10-02T05:49:04.606+0000","up_votes":1,"down_votes":0,"body":"Hey SephirothSG, thank you so much, but now, my League Of Legends has deleted, i've tried reinstalling it off the internet. When ever i try and open it, its says \"League Of Legends is an application downloaded off the internet, are you sure you want to open it?\" I click open and then it says \"League Of Legends cannot run from the DMG. Please select an install location for League Of Legends.\" So i click \"ok\". It brings me to all my applications and only the folders are selected that i can click on, when i click on any of my folders it says \"The directory you have chosen is invalid. Please verify you have write permissions or select another directory.\" If you could help then that would be sooooo lovely!!! {{champion:32}}","replies":[{"poster":"SephirothSG","date":"2016-10-05T07:52:24.202+0000","up_votes":1,"down_votes":0,"body":"I do apologise for taking so long to reply, Real life has taken over.\n\nAre you sure you're attempting to install league of legends correctly? Please follow the steps outlined in [this support article](https://support.riotgames.com/hc/en-us/articles/202539040-Reinstalling-League-of-Legends#section-mac) about installing league on mac.","replies":[{"poster":"LukeRyanRaso","date":"2016-10-08T07:00:15.037+0000","up_votes":1,"down_votes":0,"body":"OMG! Thank you soooo much! I can finally play league after 2 weeks of being bored.... I made the common mistake of when installing league,  i would double-click league, and i just read your link that u sent me above, and it said that i needed to drag, i had a massive brain fart, so sorry for wasting your time! XD and thank you sooooo much!{{champion:119}}","replies":[]}]}]},{"poster":"ZooMa","date":"2016-10-08T02:56:51.729+0000","up_votes":1,"down_votes":0,"body":"Please read my comment, i just get bugsplats after champ select.","replies":[]}]},{"poster":"ZooMa","date":"2016-10-08T02:55:53.134+0000","up_votes":1,"down_votes":0,"body":"Hey, ive had an issue for about 1-2 weeks where i haven't been able to play league at all. Its a crash after champ select, ive done a lot to try fix (reinstalling, repairing, turning off protection settings) but nothing is working. Please help me!","replies":[]},{"poster":"ABlueQuaker","date":"2016-10-07T05:19:12.338+0000","up_votes":1,"down_votes":0,"body":"Only help I can give you for Mac involves your Hard drive and a hammer.","replies":[]}]}