{"poster":"Endless Paradõx","date":"2017-04-28T19:22:32.011+0000","title":"¿Algo que está mal implementado?","subforum":"Discusiones sobre el Cliente","up_votes":4,"down_votes":0,"body":"_Buenas invocadores y rioters. Quer&iacute;a hacer uso del buen foro que tiene esta comunidad para que den opiniones y respuestas a cada una de las siguientes preguntas y situaciones que me pasaron desde que llego el nuevo cliente._ \r\n {{sticker:slayer-pantheon-thumbs}} \r\n\r\n**&iquest;Por donde comenzar?**\r\n_Tal vez lo que har&iacute;a un profesional, es dar los fallos del nuevo cliente y respectivas soluciones para el mejor uso de este. Pero me gustar&iacute;a dar los plus/contras que tiene._\r\n\r\n&gt; &iquest;Que queres o&iacute;r primero? &iquest;Lo bueno o lo malo?\r\n&gt; - Lo malo primero y despu&eacute;s la buena noticia\r\n\r\n**Lo malo del nuevo cliente:**\r\n1. Tiene muchos errores. (Claro que en todas las actualizaciones, tanto como en el juego y personajes hay errores).\r\n2. Le faltan funciones que el viejo cliente tiene. (Una de ellas es cuando podiamos crear nuestra propia tienda personalizada).\r\n3. Teni&eacute;ndolo en Alto/Bajo no sirve de mucho, ya que tendr&iacute;a que tener un modelo standar para que funcione igual para todos.\r\n4. Se crashea o detiene cada tantas partidas. (Tengo que explicar algo mas sobre esto al final del post){{item:3642}} \r\n5. No te deja hablar con amigos mientras estas en selecci&oacute;n de campe&oacute;n.\r\n\r\n**Pasemos con lo bueno:**\r\n1. Tiene un genial dise&ntilde;o, y es mucho mas f&aacute;cil usar que el anterior.\r\n2. Tiene aspectos que funcionan mejor en el nuevo cliente. (La tienda, la artesan&iacute;a, los perfiles, etc.)\r\n3. Se Puede revisar el historial de mensajes de amigos que se encuentran desconectados. (Era algo que me molestaba del viejo cliente jajaja){{summoner:3}} \r\n4. Recibe el nuevo modo de entrenamiento, que es algo que se esperaba por la comunidad.\r\n5. Podes grabar, guardar las partidas del historial.\r\n\r\n\r\n**Aspectos nuevos que se tendr&iacute;a que incorporar en el nuevo cliente:**\r\n1. Tendr&iacute;a que llamar mas la atenci&oacute;n de la gente o hacer un manual de instrucciones para aquellos que no sepan usarlo.\r\n2. Implementar un sistema de voz en las partidas. (Esto se hablo pero jamas se confirmo hasta que saquen el cliente del legado ya que si hac&iacute;an para un cliente, tendr&iacute;an que hacerlo para ambos. Me gustar&iacute;a que me confirmen si es cierto esto.)\r\n3. Arreglar algunos de las malas cosas que tiene el mismo.\r\n\r\nBueno sin mas, quer&iacute;a decirles gracias por tomarse el tiempo de leer y que dejen sus opiniones, casos que les haya pasado algo malo o bueno.\r\nMi reacci&oacute;n con el nuevo cliente es un{{sticker:zombie-nunu-hearts}} pero se que puede ser algo mas. Y nos sorprender&aacute;n mas.\r\n\r\n**Felicito aquellos que lo hicieron posible.**\r\n\r\n&gt; Una cosa que quer&iacute;a contarles y que tal vez deber&iacute;an arreglar en el juego. Cuando en el juego se suban datos, updates, splasharts, cosas m&iacute;nimas que te piden actualizar el juego, no te dejen mandarte en games y te salga un prevent/aviso diciendo que se subi&oacute; algo. **&iquest;Por que lo digo?** Ayer estaba a las 01:15 am rankeando. En selecci&oacute;n de campe&oacute;n logr&eacute; pickear y se me crashea el juego (No responde league of legends) esper&eacute; unos segundos para que se mande la ranked y as&iacute; autom&aacute;ticamente relogear. A todo esto, cuando abro el juego me tira una actualizaci&oacute;n  de algo. Tard&oacute; como 3-5 minutos y cuando logre entrar la partida ya se hab&iacute;a dado en ~~REMAKE~~. Por suerte, nunca me voy afk y no me salto una penalizaci&oacute;n, pero me descontaron 15 pl que se pod&iacute;an haber evitado con un aviso o algo. Si me podr&iacute;an ayudar a que esto le llegue a un rioter para que me de una soluci&oacute;n o una explicaci&oacute;n se los agradeceria.\r\n\r\nGracias por todo y saludos!{{sticker:slayer-pantheon-rainbows}}","replies":[]}