{"poster":"Gabrymax","date":"2017-06-08T11:39:09.260+0000","title":"Twich jungle","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Tralasciando il periodo di merda che sicuramente avr&agrave; contribuito, non riesco pi&ugrave; a vincere la lane da un po&#039;. Ma quel che &egrave; successo in quel game mi ha lasciato un po&#039; perplesso... ma come cazzo giochi se hai contro un twich jungle che ha un paio di mani? \r\nLane: fiora (io) vs irelia, ancora livello 1, primi last hit, gank di twich, mi salvo a culo, constretto a recallare uso flash e tp... un minuto dopo first blood di twich sul mid lane (stesso replay che &egrave; successo top ma il mid laner &egrave; stato meno fortunato). Inizio a giocare safe regalando vantaggio a irelia la quale inizia a zonarmi come vuole, lv 6 primo gank del mio jungler (kayle :|) ingaggio, ma twich counter ganka double e first tower per loro... a sto punto ero totalmente inutile non avevo cs non avevo Kill e irelia aveva un vantaggio enorme. Wardo compro la Pink e freezo twich non contento torna top e mi scioglie  (poco pi&ugrave; in l&agrave; della t2). La nostra bot era leggermente in vantaggio, mid, top e jungle praticamente distrutti. Non potendo farmare, iniziano i fight dove risulto totalmente inutile, per lo meno il mid annie e il jungler kayle tra cc e ulti portavano utilit&agrave; al team, io con fiora non potevo fare nulla, non facevo danni ne tankavo, un super minion era pi&ugrave; utile... Cosa avrei potuto fare? Come mi devo comportare contro un twich o eventualmente una brava evelyn jungle (oltre a comprare le Pink che gi&agrave; lo faccio normalmente) ? Sono gold 2 ma in quella partita non lo meritavo minimamente...","replies":[{"poster":"Gabrymax","date":"2017-06-08T12:44:11.783+0000","up_votes":1,"down_votes":0,"body":"Quindi da quel che ho capito, da top c'è poco che posso fare se questo mi campera... è normale che vada sotto di cs e di livelli? L'unico modo è avere un jugler altrettanto bravo che lo counterjungli oppure aspettare la late?","replies":[{"poster":"LKV2","date":"2017-06-08T12:50:26.515+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gabrymax,realm=EUW,application-id=cAOZwaUi,discussion-id=xsq4ZjlE,comment-id=0002,timestamp=2017-06-08T12:44:11.783+0000)\n>\n> Quindi da quel che ho capito, da top c&#x27;è poco che posso fare se questo mi campera... è normale che vada sotto di cs e di livelli? L&#x27;unico modo è avere un jugler altrettanto bravo che lo counterjungli oppure aspettare la late?\n\nSe twitch jungle ti campera o freezi la lane oppure preghi e speri che i tuoi compagni snowballino.","replies":[{"poster":"Gabrymax","date":"2017-06-08T12:53:24.788+0000","up_votes":1,"down_votes":0,"body":"Devo imparare a freezare come si deve, non mi reputo molto bravo nelle wave control; nonostante cerco di tener vivi i minion range nemici, dopo un paio di wave mi trovo la lane che pusha -.-","replies":[]}]}]},{"poster":"Mh012","date":"2017-06-08T12:38:54.043+0000","up_votes":1,"down_votes":0,"body":"{{champion:10}} jungle XD\nWarda {{item:3341}}. Non potenziarlo. Fighta con il laner nemico quando vedi {{champion:29}} nella lane opposta. Fatti babysittare se continua a gankarti.\nNo Q, no escape (il cd però si azzera se uccide o fa assist su un champ con Carica Veleno). Evita la W che slowa e ti applica Cariche di Veleno. La R una volta attivata mi pare che i suoi aa diventino skillshot, ma non ne sono sicuro. {{item:3102}} {{item:3814}} sono inutili e non bloccheranno mai nella vita la E.\n\nSe è oom e lo prendete con un hard CC, implode peché non ha arm XD Sempre se non è feeddato/full build, sennò succhia peggio di {{champion:266}} con un buon AS ed un item da lifesteal.","replies":[]},{"poster":"vondarck","date":"2017-06-08T12:36:58.479+0000","up_votes":1,"down_votes":0,"body":"anche se di elo più basso di te ti dico la mia\n\n{{champion:29}} è un pik un po situazionale, è un hypercarry ma sbilancia un po sull offensivo il suo team, è molto fastidioso in early appunto per i gank \"a sorpresa\" e a lungo raggio, ma è abbastanza sensibile ad un buon jungler da early come {{champion:60}} {{champion:64}} {{champion:76}} {{champion:35}} {{champion:121}} e di anti carry che si terranno tutto il loro kit non appena \"appari\" solo per vederlo saltare in aria come {{champion:254}} {{champion:131}} {{champion:120}} {{champion:24}} {{champion:56}} {{champion:421}} {{champion:80}}  {{champion:107}} (in quel caso dovrà essere peelato adeguatamente)\n\nal di la di queste considerazioni c'è poco da dire da top puoi solo wardare e poi sperare che i l tuo jungler counterganki/invada e faccia l'argogranchio","replies":[]}]}