{"poster":"AavatarisII","date":"2018-08-20T23:18:26.213+0000","title":"Ayer me Banearon, hoy se RETRACTARON","subforum":"Charlas Generales","embed":{"description":"Image INJUSTICIA hosted in imgbb.com","url":"https://ibb.co/hhSXfz","image":"https://image.ibb.co/mheOne/INJUSTICIA.png"},"up_votes":26,"down_votes":11,"body":"Me banearon permanentemente por 3 partidas (soy supp) en las que reporte:\n\n- Un Yasuo ADC flamer que se regalaba sin parar y me culpaba de todo. Le dije que se callara, me burle de que me flamear por &quot;farmear con item de supp&quot;, lo mutie y ped&iacute; report. No insulte ni maltrate a nadie.\n- Una Vayne ADC que se puso a insultarme a m&aacute;s no poder, de manera absolutamente toxica, por todo. Su premade Jg y &eacute;l me flameaban y culpaban. Me puse a supportear al MID y fuimos los &uacute;nicos que jugamos bien. Mute ambos, ped&iacute; report y les dije lo t&oacute;xicos que eran (sin flamear ni maltratar a nadie).\n- Un Aatrox Top que perdi&oacute; linea y se puso a TROLLEAR INTENCIONAL, regalando la partida, y un Jax Jg enemigo al que carrearon completamente y flameaba t&oacute;xico para creerse porque en bot lo matabamos cada vez que gankeaba. No insulte, pero insist&iacute; repetidamente a Aatrox que ayudara y dejara de feedear.\n\n(esas fueron las partidas que el cliente mostr&oacute;)\n\nAcaban de revisar los &uacute;ltimos 4 meses de mi cuenta, **no encontraron NING&Uacute;N INSULTO de mi parte**, y mi &quot;peor&quot; comportamiento es DISCUTIR (defenderme, tratar de &quot;dialogar&quot; para que no trolleen y EVIDENCIAR actitudes t&oacute;xicas en /all para report) **antes de MUTEAR**.\n**As&iacute; que reconocieron que la sanci&oacute;n fue equivocada** y, LITERALMENTE, por acumulaci&oacute;n de reportes (premades trolls/flamers reportando). Eso dijeron.\n\n_**Me quitaron el perma-ban, pero me dejaron con 14 d&iacute;as de sanci&oacute;n, sin haber hecho NADA y argumentando que era lo mejor que pod&iacute;an hacer.**_\n-----\nLoL es el juego m&aacute;s t&oacute;xico del mundo, reconocido por todas las redes sociales, porque su sistema de moderaci&oacute;n autom&aacute;tico es un chiste (donde los que **no tenemos premades permanentes pagamos**). Se concentran en sancionar MUCHO y R&Aacute;PIDO, pero no con criterio, ni contexto, NI EVIDENCIA ....y ya no s&eacute; como demostrarlo.\nhttps://ibb.co/hhSXfz\n\nP.D.: Tengo excelente comportamiento (muteo, no trolleo, no AFK, apoyo y trato dialogar), literalmente, el único cambio que puedo hacer es: \n\"Quedarme callado y esperar a perder de 20 a 50 minutos por trolles y tóxicos (mientras me pasan por encima y la moderación no cumple), pasándolo pésimo, en vez de INTENTAR razonar con ellos. Esperando/suponiendo que los reporten los demás, y algo cambie en un sistema que lleva AÑOS penalizando a los que no tenemos premades y, en general, empeorando.\"\n-----\nP.D.: Para todos los que **SUPONEN cosas**, defienden CIEGAMENTE el sistema (**reconocido como disfuncional**) y me **ACUSAN sin saber**, aquí pongo el chat de la ultima partida, el mismo que pego el de Soporte al Jugador (después de **retractarse**, pero decir que **igual no podían ayudarme más**) como **mi \"PEOR\"** chat (con su aclaración):\n\nEsta sería la partida **\"más tóxica\" por mi parte**, pero creo que se entiende estar \"algo cabreado\" con 1 troll intencional y 3 flamers tóxicos:\n1:03] Janna: solo de supp \n[1:24] Janna: ahora solo ulti y curacion \n_ (no recuerdo que nos decíamos)_\n[7:01] Janna: aatrox, ponte armadura y R;M y deja de feedear, por favor \n[7:08] Janna: bajo torre si es necesario \n_ (Aatrox feedeando sin parar y sigue, culpando al Yi, nuestro Jg)_\n[9:55] Janna: gg \n_ (tiramos torre en bot y vamos ganando linea, igualamos las kills de los rivales)_\n[15:58] [All] Janna: y aatrox hablando de sus ideas mientras akali llega feed a destrozar toda la carreada ¬¬ \n_ (Aatrox esta bajo torre y en base, hablando por /all, nos deja solos contra la Akali feed)_\n[16:29] [All] Janna: claro, te feedean, no juega \n_ (Akali se burla, diciendo que \"él es muy bueno para nosotros\", etc, mientras Aatrox dice cosas como que \"se aburrió\")_\n[18:56] Janna: gg, estoy jugando solo?\n[21:46] Janna: dee tam \n[22:00] Janna: de team??? he echo todo, y sivir igual si no es porque parece tiene lag \n_ (Yi se pone a flamear, diciéndonos que somo bronces, que no le ayudamos, etc. cuando solo persigue la kill y feedea, además tiene el descaro de insultar al ADC, que con LAG jugo 10 veces mejor que el Yi)_\n[22:31] Janna: si no es por bot no tenemos \"team\" \n[22:46] Janna: si se, por eso ...nmo puedo jugar solo \n_ (le aclaro a Sivir que si sé que tiene LAG, que no lo culpo)_\n[23:07] [All] Janna: report aatrox TROLL que intencionalmente prefiere seguir perdiendo y no ayudar, para \"charlar\" y excusarse el feedeae \n_ (pido report contra Aatrox, que sigue trolleando y, ahora, se burla)_\n[25:36] [All] Janna: shh \n[28:42] [All] Janna: mentira \n_ (Aatrox pide report a GP, y **miente** con que lo esta flameando)_\n[30:43] Janna: si tuvieramos top tendriamos iniciador yi, pero no, asi que en vez de tirar la puteada agradece que gane la TF \n_ (Yi muere por tirarse a la kill, nos insulta a todos y culpa, los otros 3 ganamos TF y en algún momento me lleve 1 kill \"suya\", Janna 3/8/29 ...igual nos flamea)_\n[33:19] [All] Janna: callate, te la regalaron y te crees \n[33:36] [All] Janna: report aatrox troll intencional TODO el juego, con registro en el chat y regalo top \n[33:58] [All] Janna: shh... te feedearon en early y trollearon el resto del juego, callate \n[34:27] [All] Janna: mute y reportado tambien \n_ (Akali ahora si se burla con todo y Aatrox igual, mute a ambos)_\n[35:00] [All] Janna: no he dicho nada malo y obvio estoy picado por 1 troll y un toxico burlandose\n[35:15] [All] Janna: resentido de vida?mira quien es toxico jax carreado \n[35:38] [All] Janna: hiciste 3 gank en bot y te matamos los 3, callado, carreado. eres toxico \n[35:40] [All] Janna: mute \n_ (Jax, que hizo mal todos sus ganks en bot y ahora esta siendo carreado **nos insulta y flamea de sobremanera** a bot, mute)_\n[36:40] Janna: callate yi, tienes un asesino iniciador y no tneemos top, agradece que te carriemos desde bot \n[44:30] Janna: grande iniciada yi, 1 vs 4? \n[44:57] [All] Janna: que lindo, carrear 40 minuto con un troll para que yi se siga tiradno por LA KILL pensando que carrea \n_ (Yi nos vuelve a insultar, porque se tira contra varios y en desventaja, **solo flamea y persigue las kills**, muteado)_\n[48:32] [All] Janna: report aatrox troll intencional por más de 30 minutos y jax toxico carreadisimo ¬¬ \n_ (nos destrozan tras casi 50 minutos de intentar carrear con un Troll tóxico y Yi flamenado y culpando a todos, pido report denuevo)_\n\nImagen del pantallaso: https://ibb.co/msghXe\n","replies":[{"poster":"Cesth","date":"2018-08-20T23:25:14.882+0000","up_votes":8,"down_votes":0,"body":"Small indie company.","replies":[]},{"poster":"Esbern","date":"2018-08-21T00:35:53.133+0000","up_votes":7,"down_votes":1,"body":"Te apoyo totalmente.\nSabes lo que pasa? el sistema es un mierdººº ya que si vos pedís que esos trolls dejen de suicidarse o algo por el estilo esos mismos trolls se vengan de vos reportandote. Entonces generas una acumulación de reportes en tu contra y cualquier cosa que escribas en chat, cualquiera es tomada como ofensiva. Y soporte como el sistema considera que escribir en el chat es mas castigable que suicidarse 8 veces y después pasear por el mapa dando kill o no ayudando total \" es una mala partida\" o \"lo que hacen los demás no justifican tu actitud\" \nLa política de riot es: no ver, no escribir y después jugar otra partida rogando que no te toque uno de esos yasuos riven zed\nMe canse de discutir esto, me canse de llevar pruebas pero es al pedo no lo ven ni lo quieren ver.\nLo siento por lo de tu cuenta pero seguramente no te sacaran el ban, mi consejo es no decir nada pero nada en el chat y cuando termine la partida romperle las pelotas a soporte llevándole las pruebas a ver si se dan cuenta de cuantos trolls hay y cuantas partidas te arruinan. Tal vez algún día vean que su sistema es una mierdººº","replies":[{"poster":"DIOS TUTI","date":"2018-08-21T01:30:33.524+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=Franrmns,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=0004,timestamp=2018-08-21T00:35:53.133+0000)\n>\n> Te apoyo totalmente.\n> Sabes lo que pasa? el sistema es un mierdººº ya que si vos pedís que esos trolls dejen de suicidarse o algo por el estilo esos mismos trolls se vengan de vos reportandote. Entonces generas una acumulación de reportes en tu contra y cualquier cosa que escribas en chat, cualquiera es tomada como ofensiva. Y soporte como el sistema considera que escribir en el chat es mas castigable que suicidarse 8 veces y después pasear por el mapa dando kill o no ayudando total &quot; es una mala partida&quot; o &quot;lo que hacen los demás no justifican tu actitud&quot; \n> La política de riot es: no ver, no escribir y después jugar otra partida rogando que no te toque uno de esos yasuos riven zed\n> Me canse de discutir esto, me canse de llevar pruebas pero es al pedo no lo ven ni lo quieren ver.\n> Lo siento por lo de tu cuenta pero seguramente no te sacaran el ban, mi consejo es no decir nada pero nada en el chat y cuando termine la partida romperle las pelotas a soporte llevándole las pruebas a ver si se dan cuenta de cuantos trolls hay y cuantas partidas te arruinan. Tal vez algún día vean que su sistema es una mierdººº\n\nese es el problema que no entendes, vos lo que tenes que hacer, es no escribir NADA en el chat, y reportar al final de la partida (y por soporte si queres tambien), y el troll/flamer va a ser penalizado, capaz no en tu partida, pero si lo sigue haciendo si.\nel bot es \"perfecto\" (osea, si vos conoces como actua, y no haces nada que sea penalizable, no te va a sancionar, porque es una inteligencia artificial). obviamente que tiene sus falencias, pero es cuestion de conocerlas y no cometer esas faltas injustas, para que no te penalice la IA.","replies":[{"poster":"Kale","date":"2018-08-21T06:42:39.988+0000","up_votes":4,"down_votes":1,"body":"El bot es \"perfecto\"? es perfectamente inutil.\n\nLeague of Legends es, (por no decir EL) uno de los juegos mas jugados del mundo, me vas a decir que no pueden contratar a un grupito de gente que te verifique y penalice con un criterio mas razonable? Obviamente en el momento que reportes no va a penalizar a otro jugador al momento y casi seguro que tarde unas semanas, la cosa es que seria lento pero EFECTIVO.  O por lo menos, mandar primero esas penalizaciones que hace el \"bot perfecto\" a esta gente y que le den el ok para efectuarlo. \n\nEstoy hasta los huevos de tener que cerrar la boca en todas las partidas para que yo no ligue un ban de chat o algo y el troll/afk/flamer/etc siga jugando muy a gusto...","replies":[{"poster":"DIOS TUTI","date":"2018-08-21T12:24:53.036+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=ALEE21,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=000400000000,timestamp=2018-08-21T06:42:39.988+0000)\n>\n> El bot es &quot;perfecto&quot;? es perfectamente inutil.\n> \n> League of Legends es, (por no decir EL) uno de los juegos mas jugados del mundo, me vas a decir que no pueden contratar a un grupito de gente que te verifique y penalice con un criterio mas razonable? Obviamente en el momento que reportes no va a penalizar a otro jugador al momento y casi seguro que tarde unas semanas, la cosa es que seria lento pero EFECTIVO.  O por lo menos, mandar primero esas penalizaciones que hace el &quot;bot perfecto&quot; a esta gente y que le den el ok para efectuarlo. \n> \n> Estoy hasta los huevos de tener que cerrar la boca en todas las partidas para que yo no ligue un ban de chat o algo y el troll/afk/flamer/etc siga jugando muy a gusto...\n\npero, que necesidad tenes de hablarles a toxicos, trolls, afks, y demas.\n\nte los vas a cruzar 1 partida solamente (osea, a la persona, no a los trolls flamers y demas) simplemente reportalo al final, no tenes porque hablarle ni discutir con el.","replies":[{"poster":"Kale","date":"2018-08-21T23:28:04.746+0000","up_votes":3,"down_votes":1,"body":"Es que vos podes ser la persona mas buena del mundo, un pan de dios, pero si te sale un troll o algo en cada partida que jugas inevitablemente vas a terminar diciendo algo, por mas que no lo insultes y eso ya te perjudica.\n\nEso tomando en cuenta que son partidas normales o rankeds \"comunes\". Ahora que pasa si es una promo que te costo un huevo llegar? no podes quedarte en el molde despues de comerte 43 flamers que te putean por \"robarle un minion\"","replies":[{"poster":"DIOS TUTI","date":"2018-08-21T23:37:46.709+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=ALEE21,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=00040000000000000000,timestamp=2018-08-21T23:28:04.746+0000)\n>no podes quedarte en el molde despues de comerte 43 flamers que te putean por &quot;robarle un minion&quot;\n\neso es mentira. no en todas las partidas hay trolls, toxicos y demas.\n\na lo sumo tener una mala racha que te toquen muchos seguidos.","replies":[{"poster":"Kale","date":"2018-08-22T02:11:28.713+0000","up_votes":2,"down_votes":0,"body":"Nunca dije que en todas las partidas los hayan pero en la gran mayoria si las hay.\n\n Yo jugando CON 3 PREMADES (O sea que somos 4 amigos) nos viven tocando flamers, trolls, afk's y demas, SIENDO 4, ahora imaginate la gente que juega sola...","replies":[]}]}]}]}]}]}]},{"poster":"Hell Darking","date":"2018-08-20T23:24:47.610+0000","up_votes":7,"down_votes":2,"body":"\"este juego te pone a prueba con estas cosas\" vaya respuesta mas de mierda (se que me borraran el comentario con esto) pero por dios, saben a quien se parecen? al cura que daba misa en la iglesia donde vivia antes\n\"si Dios te puso a prueba con eso, para ver si eres buena persona\" anda ya..","replies":[{"poster":"DIOS TUTI","date":"2018-08-20T23:27:13.599+0000","up_votes":4,"down_votes":10,"body":"> [{quoted}](name=Hell Darking,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=0001,timestamp=2018-08-20T23:24:47.610+0000)\n>\n> &quot;este juego te pone a prueba con estas cosas&quot; vaya respuesta mas de mierda (se que me borraran el comentario con esto) pero por dios, saben a quien se parecen? al cura que daba misa en la iglesia donde vivia antes\n> &quot;si Dios te puso a prueba con eso, para ver si eres buena persona&quot; anda ya..\n\nno tiene nada que ver tu comparacion, porque los que \"te ponen a prueba\" son otras personas que seguramente sean baneadas en un futuro, no un dios.","replies":[{"poster":"AavatarisII","date":"2018-08-20T23:30:29.094+0000","up_votes":6,"down_votes":2,"body":"Es más bien como una dictadura: Gobierno que hace lo que quiere, sanciona como se le da la gana, sin revisar las evidencias y castigando a las minorías (los que no tienen premades), por votación popular. \n\nInjusto y tóxico","replies":[{"poster":"DIOS TUTI","date":"2018-08-20T23:40:37.672+0000","up_votes":4,"down_votes":6,"body":"> [{quoted}](name=AavatarisII,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=000100000000,timestamp=2018-08-20T23:30:29.094+0000)\n>\n> Es más bien como una dictadura: Gobierno que hace lo que quiere, sanciona como se le da la gana, sin revisar las evidencias y castigando a las minorías (los que no tienen premades), por votación popular. \n> \n> Injusto y tóxico\n\nel bot no hace lo que quiere, investiga patrones y penaliza por eso, en tu caso fue por discutir en el chat, lo cual esta mal, como tambien esta mal que te troleen los demas, o flameen, y si revisa evidencias.\nlo de los premades, tengo entendido que un report de 4 premades cuenta como solo un report, igual si no hiciste nada malo, no te van a sancionar, vos discutiste con los premades, te sancionaron por eso, capaz a los otros no porque no lo hacen con regularidad, van a caer tarde o temprano si siguen siendo asi.","replies":[{"poster":"AavatarisII","date":"2018-08-20T23:45:43.151+0000","up_votes":4,"down_votes":2,"body":"El bot acumula reports, y es LITERALMENTE lo que me dijo el soporte\n\nMi ultima mala actitud fue, mínimo, hace más de 4 meses, pero aún así me sanciona.\n\n\"vos discutiste con los premades, te sancionaron por eso\" ...super coherente y justo ¬¬","replies":[{"poster":"DIOS TUTI","date":"2018-08-20T23:48:54.513+0000","up_votes":4,"down_votes":6,"body":"> [{quoted}](name=AavatarisII,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=00010000000000000000,timestamp=2018-08-20T23:45:43.151+0000)\n>\n> El bot acumula reports, y es LITERALMENTE lo que me dijo el soporte\n> \n> Mi ultima mala actitud fue, mínimo, hace más de 4 meses, pero aún así me sanciona.\n> \n> &quot;vos discutiste con los premades, te sancionaron por eso&quot; ...super coherente y justo ¬¬\n\nno, tu mala actitud es discutir por el chat, que segun me decis lo haces a menudo, no importa si es con premades o con tu amigo imaginario, porque el bot solo mira tus chats.\n\ny si, es literalmente lo que te dijo, porque te reportaron muchas personas, y el bot investigo y es posta que discutiste, y te baneo.\n\npasa que un empleado de riot, no te puede decir con 2 dedos de frente que te baneo por discutir, porque es injusto, pero es asi. no tenes que pretender cambiar el sistema, tenes que conocerlo y actuar a tu favor segun como es el sistema.","replies":[{"poster":"AavatarisII","date":"2018-08-21T00:22:33.119+0000","up_votes":6,"down_votes":2,"body":"\"discutir\", pidiendo que no trollen, no flameen, no ostiguen etc, es malo? (y antes de mutear)\n\nTe estoy poniendo **EVIDENCIA CONCRETA de que el sistema se equivoco** (por que no sirve realmente, cada año es más tóxico) ...pero tu insistes en defenderlo y te enojas (y \"me das negativo\") porque te lo \"discuto\"?\n\nVes lo que defiendes? ...porque si \"juegas con premades\"","replies":[]}]}]}]}]}]}]},{"poster":"N4V1D4D","date":"2018-08-21T15:58:02.160+0000","up_votes":4,"down_votes":0,"body":"El tema es simple riot ni se calienta en revisar los casos amigo,desde hace años que el sistema funciona automáticamente solo les dan bola  los casos como vos que seguro te quejaste y vieron recién que onda y te la devolvieron pero generalmente todo es automático,les importamos una mierda amigo,solo quieren guita y fue","replies":[]},{"poster":"Jinxie","date":"2018-08-21T01:47:25.604+0000","up_votes":1,"down_votes":0,"body":"Pues me paso igual xd , me fue mal en una partida y me llego ban permanente por sacrificio intencional , aunque solo me lo podian bajar a 14 dias, lo tome igualmente , no era mala opcion","replies":[{"poster":"AavatarisII","date":"2018-08-21T03:07:55.825+0000","up_votes":4,"down_votes":0,"body":"De hecho, si, es bien mala, te salva del perma ban, pero:\n- Sigues en la lista negra (te pueden banear por cualquier cosa)\n- Demuestra que el sistema no sirve (beneficia premades, sean trolls o no)\n- No quita el hecho de que te estén penalizando por nada (indistintamente de tu comportamiento)","replies":[]}]},{"poster":"DIOS TUTI","date":"2018-08-20T23:23:22.705+0000","up_votes":7,"down_votes":19,"body":"aprovecha la oportunidad y cambia la actitud de escribir en el chat antes de que el bot te banee permanentemente (lo cual esta bien, no tenes porque discutir en el chat, si te trollearon reporta, si te flamearon reporta, no quieras cambiar a la gente), no sirve para nada el chat, menos para discutir, tenes los pings.","replies":[{"poster":"AavatarisII","date":"2018-08-20T23:26:01.215+0000","up_votes":6,"down_votes":6,"body":"Tengo excelente comportamiento (muteo, no trolleo, no AFK, apoyo y trato dialogar), literalmente, el único cambio que puedo hacer es: \n\nQuedarme callado y esperar a perder de 20 a 40 minutos por trolles y tóxicos (mientras me pasan por encima y la moderación no cumple), en vez de INTENTAR razonar con ellos, esperando que los reporten los demás.","replies":[{"poster":"DIOS TUTI","date":"2018-08-20T23:34:52.953+0000","up_votes":9,"down_votes":5,"body":"> [{quoted}](name=AavatarisII,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=00000000,timestamp=2018-08-20T23:26:01.215+0000)\n>\n> Tengo excelente comportamiento (muteo, no trolleo, no AFK, apoyo y trato dialogar), literalmente, el único cambio que puedo hacer es: \n> \n> Quedarme callado y esperar a perder 20 minutos por trolles y tóxicos, en vez de INTENTAR razonar con ellos, esperando que los reporten los demás.\n\nese es el problema, y es por lo que te penalizaron, si te trollean ya está, es bancartelo 20 minutos, tratar de carrear la partida con los que no esten trolleando y reportarlo al final, ami en mi smurf (donde hay muchos mas toxicos que en esta cuenta, por cuestiones de emparejamiento), me viven saltando feedbacks de reportes que hice.\nsi es toxico, es mas facil, un botoncito y nos vemos, el problema es cuando el toxico se pone a trollear (que ahi ya te perjudica).\nen fin, no tenes que escribir por el chat, ni para bien ni para mal, solamente algun timing de algun objetivo/summoner (que para eso tenes pings tambien, pero en partidas normales no podes esperar que hagan la cuenta del tiempo que falta para que tenga el summoner, porque no saben ni el cd del summoner directamente).\nte digo esto porque vivo puteando al aire en mi casa cuando me toca alguien asi, me parezco al tano pasman, y soy honor 5 por no escribirselo, es simplemente eso, hay que entender el sistema.","replies":[{"poster":"AavatarisII","date":"2018-08-20T23:48:40.012+0000","up_votes":5,"down_votes":4,"body":"Juegas con premades? Te parece bien tener que callar y agachar la cabeza, aguantando una toxicidad que solo empeora cada año (y no hablo de buscar \"putear devuelta\", sino DIALOGAR)?\n\nEl sistema es pésimo, acumula reports y palabras censurables ....y mientras lo defiendan ciegamente los que **no tenemos premades** constantes vamos a seguir pagando","replies":[{"poster":"NovaZupp","date":"2018-08-21T00:09:50.357+0000","up_votes":3,"down_votes":0,"body":"Yo callo. Mas bien muteo a todos apenas se empieza la partida y juego mi juego. Se siente bastante mejor aunque hay ocaciones que sabes que estan super flameando ya sea tu team o el enemigo. Tengo amigos a los cuales les recomende esto pero vienen con la escusa que en este juego se necesita comunicación pero después terminan peliandose y escribiendo mas de lo que juegan. Al fin y al cabo y desde mi punto de vista el chat es innecesario la mayoria de las veces porque una mayoria le da un uso indebido.","replies":[{"poster":"AavatarisII","date":"2018-08-21T00:13:28.922+0000","up_votes":3,"down_votes":1,"body":"Hice eso mucho tiempo (/mute all), pero, si, algunas veces me hacia falta comunicación.\n\nAdemás, igual eso no salva del trolleo ...\"al menos te deja reportar a los flamers y ayudar a las victimas de estos\" (o eso creía yo)","replies":[]}]},{"poster":"DIOS TUTI","date":"2018-08-20T23:57:21.420+0000","up_votes":8,"down_votes":5,"body":"> [{quoted}](name=AavatarisII,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=0000000000000000,timestamp=2018-08-20T23:48:40.012+0000)\n>\n> Juegas con premades? Te parece bien tener que callar y agachar la cabeza, aguantando una toxicidad que solo empeora cada año (y no hablo de buscar &quot;putear devuelta&quot;, sino DIALOGAR)?\n> \n> El sistema es pésimo, acumula reports y palabras censurables ....y mientras lo defiendan ciegamente los que **no tenemos premades** constantes vamos a seguir pagando\n\njuego con premades, pero no discuto con nadie tenga o no tenga premades, no hago nada que el bot penalice, y aca me tenes.\n\nhttps://imgur.com/ABX8jPl\n\nno es \"callar y agachar la cabeza\", es simplemente mutear y reportar, porque vos aumentas la toxicidad de un nene de 15 años al discutirle, tenes que darte cuenta que no vale la pena un toxico/troll.\n\nel sistema no es pesimo, es solamente entenderlo y \"abusar\" de el. (pongo esta palabra, no en el contexto de toxiquear y no ser penalizado, sino de conocerlo y no hacer nada que el bot penalice).\n\nno es porque te reportaron premades bro, entendelo, es por que discutiste, te dije ya en mi anterior cita, no importa si discutis con premades, con vos mismo, con otro, con un amigo imaginario, el bot te va a penalizar porque es una inteligencia artificial, no entiende el motivo por el cual discutis, ni discrimina si es un buen o mal motivo, o un motivo justo.","replies":[{"poster":"AavatarisII","date":"2018-08-20T23:59:38.553+0000","up_votes":4,"down_votes":7,"body":"\"juego con premades\" ...o sea que no tienes ni idea de lo que es tener que jugar con otros premades, troll/flamers, en tu team?\n\nAsí debe ser fácil tener ese honor y hablar sobre la tóxicidad, entre premades","replies":[{"poster":"DIOS TUTI","date":"2018-08-21T00:04:49.749+0000","up_votes":7,"down_votes":4,"body":"> [{quoted}](name=AavatarisII,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=000000000000000000000000,timestamp=2018-08-20T23:59:38.553+0000)\n>\n> &quot;juego con premades&quot; ...o sea que no tienes ni idea de lo que es tener que jugar con otros premades, troll/flamers, en tu team?\n> \n> Así debe ser fácil tener ese honor y hablar sobre la tóxicidad, entre premades\n\ny llego el momento donde te pongo el negativo.\n\njuego con premades, porque juego con gente, no es que juego con premades TODAS las partidas.\n\nobviamente juego solo, cuando no tengo a nadie conectado a la mañana o cuando recien logueo al lol y mis amigos estan jugando ya.\n\nestas cegado, te estoy diciendo como funciona el bot, te estoy diciendo que haces mal, que tenes que cambiar para que el bot no te penalice (lo que no importa si no te gusta como funciona, ni tampoco importa si me gusta ami como funciona, ni nadie), y vos me venis a atacar diciendo que no tengo ni idea porque juego algunas partidas con premades.\n\ny si, es facil tener el honor 5 cuando entendes el sistema y entendes que no importa tu opinion sobre el bot.","replies":[{"poster":"AavatarisII","date":"2018-08-21T00:10:49.797+0000","up_votes":4,"down_votes":3,"body":"\"Me pones el negativo\" porque no te doy la razón y te argumento? ok\n\nTe tengo en lista y te veo con 3 o 4 personas formando partida generalmente ¬¬\n\nPero si defender a uno de los peores sistemas (del juego más tóxico de internet)  y regocijarte en un Honor producto de jugar con premades (por lo que desconoces una toxicidad contante que se encuentra en el juego) vale \"darme negativo\", pues... \"ok\"","replies":[{"poster":"DIOS TUTI","date":"2018-08-21T00:21:40.213+0000","up_votes":5,"down_votes":4,"body":"> [{quoted}](name=AavatarisII,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=00000000000000000000000000000000,timestamp=2018-08-21T00:10:49.797+0000)\n>\n> &quot;Me pones el negativo&quot; porque no te doy la razón y te argumento? ok\n> \n> Te tengo en lista y te veo con 3 o 4 personas formando partida generalmente ¬¬\n> \n> Pero si defender a uno de los peores sistemas (del juego más tóxico de internet)  y regocijarte en un Honor producto de jugar con premades (por lo que desconoces una toxicidad contante que se encuentra en el juego) vale &quot;darme negativo&quot;, pues... &quot;ok&quot;\n\nno, eso lo decis vos, te doy negativo porque me empezas a juzgar, diciendo que desconozco la toxicidad que hay en el juego, cuando yo tuve el mismo problema que vos hace un año, fui honor 0 por discutir con pibitos, y ademas lo vivo actualmente porque estoy jugando en una smurf lvl bajo (osea, partidas seleccion oculta) donde la mayoria que me emparejan son los baneados por este sistema, y creeme que todos son toxicos. y ahi juego solo o duo con un amigo que esta subiendo una smurf tambien.\n\nte invito a releer las otras citas que te hice, donde te explique como funciona el bot y que tenes que hacer para que no te sancione, obvio, si queres entender como funciona, porque si seguis asi el bot te va a seguir sancionando.","replies":[{"poster":"AavatarisII","date":"2018-08-21T00:27:26.457+0000","up_votes":4,"down_votes":4,"body":"No te juzgue \n(de hecho, fue una pregunta, literalmente, ya que no podrías saber que es jugar sin premades si siempre juegas con premades. Lo que tu dijiste, no?)\n\nBuscaste sentirte atacado, porque no te doy la razón y me llevas la contra (y \"das negativo\") ...al final, solo eres insensible con quienes no tenemos premades permanentes (o muy constantes).\n\nP.D.: \"Discutir es malo\", pidiendo que no trollen, no flameen y se comporten? (y antes de mutear) Ok","replies":[{"poster":"DIOS TUTI","date":"2018-08-21T00:39:09.989+0000","up_votes":4,"down_votes":5,"body":"> [{quoted}](name=AavatarisII,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=0000000000000000000000000000000000000000,timestamp=2018-08-21T00:27:26.457+0000)\n>\n> No te juzgue\n> (de hecho, fue una pregunta, literalmente, ya que no podrías saber que es jugar sin premades si siempre juegas con premades. Lo que tu dijiste, no?)\n\nte cito lo que me pusiste, y te cito lo que te puse, releelo y decime devuelta \"no te juzgue\".\n\n1:\n\n\"juego con premades\" ...o sea que no tienes ni idea de lo que es tener que jugar con otros premades, troll/flamers, en tu team?\n\nAsí debe ser fácil tener ese honor y hablar sobre la tóxicidad, entre premades\"\n\n2:\n\n\"Me pones el negativo\" porque no te doy la razón y te argumento? ok\n\nTe tengo en lista y te veo con 3 o 4 personas formando partida generalmente ¬¬\n\nPero si defender a uno de los peores sistemas (del juego más tóxico de internet) y regocijarte en un Honor producto de jugar con premades (por lo que desconoces una toxicidad contante que se encuentra en el juego) vale \"darme negativo\", pues... \"ok\"\n\nmi cita:\n\n\"te doy negativo porque me empezas a juzgar, diciendo que desconozco la toxicidad que hay en el juego, cuando yo tuve el mismo problema que vos hace un año, fui honor 0 por discutir con pibitos, y ademas lo vivo actualmente porque estoy jugando en una smurf lvl bajo (osea, partidas seleccion oculta) donde la mayoria que me emparejan son los baneados por este sistema, y creeme que todos son toxicos. y ahi juego solo o duo con un amigo que esta subiendo una smurf tambien\"\n\n> Buscaste sentirte atacado, porque no te doy la razón y me llevas la contra (y &quot;das negativo&quot;) ...al final, solo eres insensible con quienes no tenemos premades permanentes (o muy constantes).\n\neso lo decis vos, no te llevo la contra, estoy diciendote lo que aprendi con la experiencia (porque fui sancionado en un pasado, y como entendi el bot y use ese conocimiento a mi favor, y subi a honor 5), pero vos pensas que te lo estoy enrostrando en la cara, en vez de leer todo lo que te puse para ayudarte a entender como funciona, y que no te sancione mas.\nel que lleva la contra y quiere modificar al sistema sos vos, hablabas de dictadura y vos queres ser la revolucion.\n\n> P.D.: &quot;Discutir es malo&quot;, pidiendo que no trollen, no flameen y se comporten? (y antes de mutear) Ok\n\ndiscutir no es malo, discutir en el chat de lol si.","replies":[{"poster":"AavatarisII","date":"2018-08-21T00:47:00.268+0000","up_votes":4,"down_votes":2,"body":"Oye, \"ok\", no soy yo el que defiende al sistema que hace más de 3 años es reconocido como el \"nido de ratas\" **más tóxico entre todos los juegos**.\n\n\"discutir no es malo, discutir en el chat de lol si\" (aún si es apelando porque no trollen, no flamean, etc, y muteando)\nBien dicho, eso lo resume todo.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Nerf Aery","date":"2018-08-21T18:46:58.471+0000","up_votes":1,"down_votes":1,"body":"Si, pero esa vayne que puteo durante 30 mins de game y salió 19/8 y te carreo lo reportan por eso, a pesar de que les dio un win porque son cuatro subnormales que no saben jugar a late y esperar a que vayne escale, el sistema no funciona, nunca funcionó ni va a funcionar, por dos motivos, uno se reporta y eso se acumula, capaz dijiste dos palabras y es motivo válido.\nY en segunda, porque siempre que uno va al soporte dicen pelotudeces como \"ay lamentamos que tengas esa experiencia\", uno las tiene porque más de una vez llevaron pruebas duras y el troll de turno sigue jugando, al punto de que reporté a un flaco por comprar una cuenta, el pibe lo admitió ingame, siguió jugando como si nada.","replies":[{"poster":"DIOS TUTI","date":"2018-08-21T18:57:35.343+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Little Lasombra,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=0000000000000001,timestamp=2018-08-21T18:46:58.471+0000)\n>\n> Si, pero esa vayne que puteo durante 30 mins de game y salió 19/8 y te carreo lo reportan por eso, a pesar de que les dio un win porque son cuatro subnormales que no saben jugar a late y esperar a que vayne escale, el sistema no funciona, nunca funcionó ni va a funcionar, por dos motivos, uno se reporta y eso se acumula, capaz dijiste dos palabras y es motivo válido.\n> Y en segunda, porque siempre que uno va al soporte dicen pelotudeces como &quot;ay lamentamos que tengas esa experiencia&quot;, uno las tiene porque más de una vez llevaron pruebas duras y el troll de turno sigue jugando, al punto de que reporté a un flaco por comprar una cuenta, el pibe lo admitió ingame, siguió jugando como si nada.\n\nme citaste ami? no encuentro el post al que me citaste, si me podes decir cual..","replies":[{"poster":"Nerf Aery","date":"2018-08-21T23:56:46.763+0000","up_votes":2,"down_votes":0,"body":"Nope. Me refiero a que el sistema no sirve.","replies":[]}]}]}]},{"poster":"WhiteMax","date":"2018-08-21T00:47:37.790+0000","up_votes":3,"down_votes":3,"body":"Solo vos intentas razonar con alguien que evidentemente quiere trollear.","replies":[{"poster":"AavatarisII","date":"2018-08-21T00:57:50.388+0000","up_votes":3,"down_votes":0,"body":"Pues la alternativa es aguantar los 20 y 40 minutos, desperdiciarlos y esperar que el sistema mediocre cumpla (cuando solo cuenta mayoría de reports).\n\nDialogar y mutear si te responden mal ....es motivo de sanción al menos? quizás es \"ingenuo\", pero eso y ya ¬¬","replies":[{"poster":"WhiteMax","date":"2018-08-21T01:28:41.628+0000","up_votes":2,"down_votes":3,"body":"Los tenes que aguantar igual. La diferencia esta en que si hablas con respeto o directamente no hablas entonces no te pasa nada. \n\n> Dialogar y mutear si te responden mal ....es motivo de sanción al menos? \n\nNo. Y si te sancionan es porque algo hiciste. Al sistema no le importa la conversacion, solo las palabras. A los que les importa la conversacion es a los de soporte a la hora de querer reclamarles por sancion mal aplicada.","replies":[{"poster":"AavatarisII","date":"2018-08-21T01:41:55.295+0000","up_votes":3,"down_votes":1,"body":"No, de hecho, en todo el rato que pregunte \"porque\" no me pudieron responder con nada concreto. \nMe comporte excelente, y solo por \"discutir\", pidiendo que no trollen, no flameen, etc. y luego muteando \"...meresco 14 días de ban\".\n\nTuve buen comportamiento y el pésimo sistema me sanciono, pero la **evidencia de eso** es que me **desbanearon el baneo permanente** ...aún así, aunque me reconocieron mi comportamiento, igual salí mal parado.","replies":[{"poster":"WhiteMax","date":"2018-08-21T01:45:46.713+0000","up_votes":3,"down_votes":3,"body":"A ver, mostrame el Chat de la partida (puedes hacer copiar y pegar).\n\n> Tuve buen comportamiento, el pésimo sistema me sanciono, y la evidencia de eso es que me desbanearon el baneo permanente, pero igual salí mal parado.\n\nNo te confundas, que te quitaran el ban porque en dichas partidas el sistema se equivocara, NO SIGNIFICA que no tuvieras reportes acumulados justificados de partidas anteriores. Si tu comportamiento fuera bueno eventualmente al pasar el tiempo tu nivel de sancion se reduciria hasta volver a ban chat de 10 partidas. Si te salto el ban permanente de una es porque ya habias recibido las otras 3 sanciones previamente, o no?","replies":[{"poster":"AavatarisII","date":"2018-08-21T03:05:36.861+0000","up_votes":3,"down_votes":1,"body":"Mira estas suponiendo cosas, y forzadamente, solo por apoyar un pésimo sistema.\n**ELLOS tuvieron que RETRACTARSE**, lo que **ya evidencie** ...eso no es porque yo este mintiendo (menos siendo Riot, que no suelen ceder)\n\nPero si ni aún así quieres creerme, es tu cuento \n(pero conste que tu comentario inicial fue \"Solo vos intentas razonar con alguien que evidentemente quiere trollear\" ...super \"empático\" y \"simpático\")","replies":[{"poster":"WhiteMax","date":"2018-08-21T13:36:45.332+0000","up_votes":3,"down_votes":2,"body":"Mira man vos sos el que viene respondiendo con una pesima actitud, a mi me sancionaron 3 veces por error, las 3 veces fui a soporte y las 3 veces me lo quitaron.\n\n> Pero si ni aún así quieres creerme, es tu cuento\n\nPorque iba a creerle a alguien que no conosco y que no puedo saber si miente o viene a hacerse la victima? es como que tu no me hagas caso a mi, porque me creerias a mi?\n\n> (pero conste que tu comentario inicial fue \"Solo vos intentas razonar con alguien que evidentemente quiere trollear\" ...super \"empático\" y \"simpático\")\n\nY esta es la señal de cuando ya no hay que prestarte atencion, te vas de tema por algo que no tiene nada que ver siendo encima que lo te dije es algo obvio. Si el tipo viene con la intencion de trollear que le va a importar lo que le tengas que decir.\n\nPD: en ese chat log claramente sos toxico, amenazando con reporte y acosando, que no digas \"malas palabras\" no significa que no lo seas.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Neith Erebus","date":"2018-08-22T01:22:34.699+0000","up_votes":3,"down_votes":0,"body":"no me sorprende de riot. Hace 4 dias que ni se aparecen por los foros, deben estar muy ocupados gritandose unos a otros.\n\nOjalá tener un team soporte decente. Pero eso es solo para KR.","replies":[]},{"poster":"Hasaki4Ever","date":"2018-08-21T20:20:05.699+0000","up_votes":3,"down_votes":0,"body":"Y ningún Rioter responde. Xd","replies":[]},{"poster":"m de mein","date":"2018-08-21T16:17:38.802+0000","up_votes":3,"down_votes":0,"body":"El sistema de reportes es una porqueria.\n\n Se sanciona al jugador que se frustra, pero no al que causa la frustracion.\n Muchos cuando le sugeris que se dejen de suicidar o no hagan X cosa, se lo toman a mal y empiezan a toxiquear.","replies":[]},{"poster":"ENSEÑENME AJUG4R","date":"2018-08-21T03:45:28.836+0000","up_votes":2,"down_votes":5,"body":"ensima que te desbanean tu cuenta sabiendo qeu supongamos que se equivocaron seguis reclamando,no hay verga que te venga bien.no tendrian que a verte quitado el ban,ensima que riot se equivoco todos no podemos equivocar lo solucionaron y por miseros 14 dias venis a postear a riot,haciendolos quedar mal.","replies":[{"poster":"pajarit0","date":"2018-08-21T03:50:19.172+0000","up_votes":4,"down_votes":0,"body":"anda comer tu queso mejor","replies":[]}]},{"poster":"DIOS TUTI","date":"2018-08-21T14:01:32.046+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=AavatarisII,realm=LAS,application-id=v7qsfXsE,discussion-id=yvygGnxc,comment-id=,timestamp=2018-08-20T23:18:26.213+0000)\n\n> 1:03] Janna: solo de supp \n> [1:24] Janna: ahora solo ulti y curacion \n> _ (no recuerdo que nos decíamos)_\n> [7:01] Janna: aatrox, ponte armadura y R;M y deja de feedear, por favor \n> [7:08] Janna: bajo torre si es necesario \n> _ (Aatrox feedeando sin parar y sigue, culpando al Yi, nuestro Jg)_\n> [9:55] Janna: gg \n> _ (tiramos torre en bot y vamos ganando linea, igualamos las kills de los rivales)_\n> [15:58] [All] Janna: y aatrox hablando de sus ideas mientras akali llega feed a destrozar toda la carreada ¬¬ \n> _ (Aatrox esta bajo torre y en base, hablando por /all, nos deja solos contra la Akali feed)_\n> [16:29] [All] Janna: claro, te feedean, no juega \n> _ (Akali se burla, diciendo que &quot;él es muy bueno para nosotros&quot;, etc, mientras Aatrox dice cosas como que &quot;se aburrió&quot;)_\n> [18:56] Janna: gg, estoy jugando solo?\n> [21:46] Janna: dee tam \n> [22:00] Janna: de team??? he echo todo, y sivir igual si no es porque parece tiene lag \n> _ (Yi se pone a flamear, diciéndonos que somo bronces, que no le ayudamos, etc. cuando solo persigue la kill y feedea, además tiene el descaro de insultar al ADC, que con LAG jugo 10 veces mejor que el Yi)_\n> [22:31] Janna: si no es por bot no tenemos &quot;team&quot; \n> [22:46] Janna: si se, por eso ...nmo puedo jugar solo \n> _ (le aclaro a Sivir que si sé que tiene LAG, que no lo culpo)_\n> [23:07] [All] Janna: report aatrox TROLL que intencionalmente prefiere seguir perdiendo y no ayudar, para &quot;charlar&quot; y excusarse el feedeae \n> _ (pido report contra Aatrox, que sigue trolleando y, ahora, se burla)_\n> [25:36] [All] Janna: shh \n> [28:42] [All] Janna: mentira \n> _ (Aatrox pide report a GP, y **miente** con que lo esta flameando)_\n> [30:43] Janna: si tuvieramos top tendriamos iniciador yi, pero no, asi que en vez de tirar la puteada agradece que gane la TF \n> _ (Yi muere por tirarse a la kill, nos insulta a todos y culpa, los otros 3 ganamos TF y en algún momento me lleve 1 kill &quot;suya&quot;, Janna 3/8/29 ...igual nos flamea)_\n> [33:19] [All] Janna: callate, te la regalaron y te crees \n> [33:36] [All] Janna: report aatrox troll intencional TODO el juego, con registro en el chat y regalo top \n> [33:58] [All] Janna: shh... te feedearon en early y trollearon el resto del juego, callate \n> [34:27] [All] Janna: mute y reportado tambien \n> _ (Akali ahora si se burla con todo y Aatrox igual, mute a ambos)_\n> [35:00] [All] Janna: no he dicho nada malo y obvio estoy picado por 1 troll y un toxico burlandose\n> [35:15] [All] Janna: resentido de vida?mira quien es toxico jax carreado \n> [35:38] [All] Janna: hiciste 3 gank en bot y te matamos los 3, callado, carreado. eres toxico \n> [35:40] [All] Janna: mute \n> _ (Jax, que hizo mal todos sus ganks en bot y ahora esta siendo carreado **nos insulta y flamea de sobremanera** a bot, mute)_\n> [36:40] Janna: callate yi, tienes un asesino iniciador y no tneemos top, agradece que te carriemos desde bot \n> [44:30] Janna: grande iniciada yi, 1 vs 4? \n> [44:57] [All] Janna: que lindo, carrear 40 minuto con un troll para que yi se siga tiradno por LA KILL pensando que carrea \n> _ (Yi nos vuelve a insultar, porque se tira contra varios y en desventaja, **solo flamea y persigue las kills**, muteado)_\n> [48:32] [All] Janna: report aatrox troll intencional por más de 30 minutos y jax toxico carreadisimo ¬¬ \n> _ (nos destrozan tras casi 50 minutos de intentar carrear con un Troll tóxico y Yi flamenado y culpando a todos, pido report denuevo)_\n> \n> Imagen del pantallaso: https://ibb.co/msghXe\n\ngenerosisimo el rioter.\n\nya te dije en posts anteriores lo que tenes que hacer para que el bot no te penalice, y ahora confirmo una vez mas, que el bot funciona como pienso.","replies":[{"poster":"AavatarisII","date":"2018-08-21T14:08:19.480+0000","up_votes":1,"down_votes":0,"body":"1) Tu mismo dijiste que sueles jugar con premades (así que te expones menos a estos comportamientos).\n2) Tu mismo buscaste sentirte atacado por algo que no dije (y te lo remarque), porque quieres tener la razón, pero no empatizar con quienes no tenemos premades seguido.\n3) No puedes negar esos puntos, porque te tengo en lista y te he visto armando partidas de preamdes generalmente.\n4) Solo apoyas el PÉSIMO sistema, del juego más tóxico del mundo, ciegamente. Ahora exagerando un comportamiento mínimo, perfectamente justificado (y el \"peor\" de los mios), solo para \"tener la razón\".\n5) Tu mismo has buscado hasta ser desagradable aquí, así que no me reprochen mi actitud cuando te han llenado de \"-1\" por tu actitud, forzada (\"ahora confirmo una vez mas, que el bot funciona como pienso\"?? OK).","replies":[]}]}]}