{"poster":"AavatarisII","date":"2018-08-03T20:40:36.960+0000","title":"Ruleta de campeones","subforum":"Charlas Generales","up_votes":3,"down_votes":2,"body":"En el Facebook de LoL, latinoamerica, publicaron un .gif que ten&iacute;a como funcionalidad &quot;**sorprenderte con tu pr&oacute;ximo champ a usar**&quot;. \nPues, hace tiempo arme este excel que se puede editar seg&uacute;n tus campeones, lineas y otras preferencias. \nEs m&aacute;s o menos la idea, &quot;una ruleta&quot; (que te asigna una linea y/o campe&oacute;n seg&uacute;n necesitas en el momento y te permite probar cosas ...e, idealmente, evita peleas por linea). \n\nCon mi intenci&oacute;n de aportar, creo que ese enlace sirve (por ahora): http://filesharing24.com/d/BnN\n\nP.D.: Esta con mis opciones por defecto, pero se puede cambiar todo a antojo, y describe su uso. No usa macros, as&iacute; que no hay riesgo de virus y es sencillo.\nP.D.: También lo compartí ahí y lo están usando. Comenten como les funciona.","replies":[{"poster":"dringun","date":"2019-01-11T23:20:14.598+0000","up_votes":1,"down_votes":0,"body":"hola lo podrías re subir o pasármelo por privado? me interesa bastante pero se cayo el link de descarga. Saludos!","replies":[]},{"poster":"AavatarisII","date":"2018-08-06T20:11:00.747+0000","up_votes":1,"down_votes":0,"body":"De verdad espero ayude a elegir, según la situación, en vez de trollear o flamear por haber perdido linea.","replies":[]},{"poster":"I A","date":"2018-08-03T22:27:32.616+0000","up_votes":1,"down_votes":0,"body":"Gran conocimiento de excel, aunque no te daré like porque le pusiste contraseña y no me dejó ver como la hiciste. \nhttps://www.ultractm.com/wp-content/uploads/2017/12/Captura-de-pantalla-2017-12-11-a-las-12.13.08.png\nEdit: igual le saqué la contraseña pero no entendí nada, algun dia haré un curso de excel jaja","replies":[{"poster":"AavatarisII","date":"2018-08-03T23:01:09.371+0000","up_votes":1,"down_votes":0,"body":"Pero el like ayuda a difundir y agradece la intención de aportar ;)\n:)","replies":[]}]}]}