{"poster":"AavatarisII","date":"2018-06-13T14:14:39.957+0000","title":"Pueden dejar, AL MENOS, una!?!","subforum":"Charlas Generales","up_votes":8,"down_votes":7,"body":"&iquest;&iquest;Pueden dejar **al menos 1 runa funcional para los Supports de pokeo y/o utilidad** en la segunda linea de Hechicer&iacute;a??\n\nYa me da igual lo que haga (si quieren, que haga que los wards sean m&aacute;s bonitos ...pfff... &not;&not; ), pero quitaron la &Uacute;NICA runa que serv&iacute;a para Supports (El Sombrero Definitivo) entre esas 3.\n\n- Orbe Anulador solo se activa con da&ntilde;o m&aacute;gico, en una linea donde casi todo el da&ntilde;o es f&iacute;sico, del ADC, y a veces ni hay da&ntilde;o m&aacute;gico en bot enemigo. Es para enfrentarse a los magos en MID, o quiz&aacute;s TOP, o para el late (donde poco te sirve para cumplir tu rol y si te focusean es un gran error del enemigo).\n- la Banda de Man&aacute; no es necesaria para soportes (ni siquiera de pokeo), con suerte la he llegado a usar con 1 o 2 champs (y ni siquiera son &quot;sopportes&quot; como tal), es para magos en MID que no quieren acabarse el man&aacute;. Deber&iacute;a darte ventaja en early, pero solo se desperdicia.\n- Y la nueva Runa (Capa Nimbus?) es para persecuciones con ultis potentes que buscan la kill (como con Rengar, Swain, Kennen, etc.). Pero, incluso, en ciertos Supp es p&eacute;sima! como Janna que el efecto empieza tras cancelar la ulti o terminar todo el efecto, o Karma que la desperdiciar&iacute;a sin querer.\n\nP.D.: Como me aportaron: Podrían poner una 4ta runa que ayude a Supps, pero no al farmear {{item:3098}}. O podrían haber dejado Sombrero y poner que no se puede combinar con Cazador Definitivo (o que juntas aportan el bono final, pero no se suma el inicial ...algo así). **El tema es ...que realmente exista una ELECCIÓN con IMPACTO entre las runas.**\n\n_UPDATE: Tema cerrado por moderación ya que algunos no sabéis comportaros y dialogar pacíficamente =(_","replies":[{"poster":"rokushoger","date":"2018-06-13T14:18:29.963+0000","up_votes":1,"down_votes":1,"body":"Es cierto eso, la única útil hasta cierto punto es el orbe anulador si es que tenés enfrente algún soporte con pokeo mágico como sona, pero poco más. Creo que dentro de lo useless la de mana es la más útil. Actualmente está mejor dominación para soportes.","replies":[{"poster":"AavatarisII","date":"2018-06-13T14:25:36.556+0000","up_votes":1,"down_votes":0,"body":"Dominación para Supps de daño que aprovechan el cc al lazarse de cara a meter daño o spameo rápido de habilidades, pero no para los de pokeo (cambiando un pokeo más seguro, por uno que debe aprovechar la oportunidad o requerir un combo) y menos para los de utilidad.\n\nHechicería, con Aery, Cometa y las demás runas que no solo aportan daño sino también utilidad y pokeo controlado, estaba hecho para esa clase de Supps. \nDe hecho, sigue funcionando, pero es me parece ridículo que la ELECCIÓN en la segunda linea sea irrelevante (o casi).","replies":[{"poster":"rokushoger","date":"2018-06-13T15:45:57.768+0000","up_votes":1,"down_votes":0,"body":"No te creas, no es tan difícil meter el relampago con los support actuales de pokeo. \nIgual te doy la razón que los support de utilidad se han quedado sin nada en el camino azul.","replies":[{"poster":"AavatarisII","date":"2018-06-13T15:55:34.000+0000","up_votes":2,"down_votes":0,"body":"Gracias, pero (solo aclarando) no es un tema de \"dificultad\", sino de seguridad:\n- Efectuar un combo (1 básico + 2 habilidades en enfriamiento, y a veces las 3) muchas veces te deja con menos herramientas para peel, escape u otro fin.\n- Muchas veces, efectuar el combo te expone de por si al pokeo enemigo. Decidir entre un pokeo controlado (que también te añade velocidad, un escudo para tu ADC y te permite jugar defensivo si estas en desventaja) puede ser una buena elección para **ciertos supp sobre otros** más agresivos, enfocados al cc y daño explosivo.\n\nPero gracias por decirlo. \nComo digo, me gusta el sistema actual de Runas, el tener OPCIONES, y me gustaría volver a tener al menos 1 entre esas que **si tenga IMPACTO** en la partida de los Supp de pokeo/utilidad (añadiendo una 4ta o cambiando alguna de las 3).","replies":[{"poster":"rokushoger","date":"2018-06-13T16:17:44.848+0000","up_votes":2,"down_votes":0,"body":"Coincido en todo eso. +1","replies":[]}]}]}]}]},{"poster":"Miroh","date":"2018-06-13T15:17:17.678+0000","up_votes":2,"down_votes":0,"body":"la banda de mana y la capa del nimbo se me hacen runas utiles para los champ q uso, me gustan, aun asi pienso que deberian agregar una cuarta maestria exclusiva para soportes y con exclusiva me refiero a que tenga un efecto similar a la del {{item:3303}}  para que te multen por farmear y asi no la puedan usar los carrileros","replies":[{"poster":"AavatarisII","date":"2018-06-13T15:39:02.234+0000","up_votes":1,"down_votes":0,"body":"De hecho! por ultimo podrían haber dejado Sombrero y poner que no se puede combinar con Cazador Definitivo (o que juntas aportan más bono inicial, pero no se suma el final algo así).\n\nEl tema es que... no cuesta nada poner una 4ta que ayude a los Supp","replies":[]}]},{"poster":"Kyousuke","date":"2018-06-13T14:43:03.486+0000","up_votes":2,"down_votes":1,"body":"podes seguir usando brujería con dominación para tener aery+sombrero definitivo y ward fantasma o poro fantasma, no se como haces para sobrevivir sin banda de mana en soporte, siempre me termino comiendo todo el mana sin darme cuenta. igualmente el combo de capa de nimbus+ celeridad es muy bueno para varios soportes {{champion:497}} es el mas destacado , {{champion:111}} {{champion:25}} {{champion:201}} {{champion:267}} {{champion:555}}","replies":[{"poster":"AavatarisII","date":"2018-06-13T15:01:13.297+0000","up_votes":1,"down_votes":2,"body":"1) Prefiero NO tener la copia de Sombrero Definitivo (de Dominación), que **perder las runas y bonos de stats que me dan las demás combinaciones** con Resolución e Inspiración (daño + vida o aún más daño).\n\n2) No me interesa realmente el Sombrero, me interesa que **vuelvan a poner algo útil para Supps** de pokeo/utilidad entre esas 3. Prácticamente, lo que sea ¬¬\n\n3) Ni por sea caso me llega a hacer falta el maná, menos con los **objetos de Supp (que evitan específicamente eso)**. La Banda de maná es un verdadero desperdicio como Supp (la he necesitado por ir con ...Quinn Supp, a ese nivel XD ), a menos que seas **realmente malo y gastes maná a locas**.\n\n4) Digamos que \"se le puedes sacar partido\" a esos **casos puntuales**, pero minimamente (como a Braum, Nami y Nautilus; donde ulteas y  lo demás es alcanzar enemigos). Te creo con Pyke o Rakan, donde se benefician directamente de la activación de la runa en la ulti, pero siguen siendo solo **casos PUNTUALES** ...y con Morgana lo dejo a prueba, ya que el efecto se activa después de terminada la ulti, no?","replies":[{"poster":"Kyousuke","date":"2018-06-13T15:14:10.038+0000","up_votes":2,"down_votes":1,"body":"ahí va el asunto, todos los soportes van a brujería lo que dejaba el spam a full de ultis a cada rato sin perder la vida extra o ganando el cronometro para arruinar cualquier posibilidad de dive o gank efectivo, entonces decidieron moverlo a otra rama donde deban sacrificar algo importante para ellos si quieren spamearla, a mi me duele ya que sombrero me encanta con los asesinos y ahora tengo que usarla y no me deja lugar a usar las otras de velocidad de movimiento que tanto me gustan :/ pero es verdad que deja la posibilidad de mas combos por el lado de dominación \nyo cuando no la tengo con rakan sufro bastante del mana, soy de pockear mucho con el y hacer trades rápidos pero no me considero malo, es el único soporte que uso y considero que tengo buen nivel con el \naveces los ultis de naut y nami se extienden demasiado hasta llegar a su objetivo, esa velocidad extra para continuar con el cc viene bastante bien, lo de morgana tengo entendido que se deberia activar nada mas lanzarla","replies":[{"poster":"AavatarisII","date":"2018-06-13T15:34:56.001+0000","up_votes":1,"down_votes":4,"body":"No estas leyendo:\n\"No me interesa que sacaran el Sombrero y que \"debilitaran hechicería (falso, se le saca igual provecho)\", me interesa que **entre 3 runas a ELECCIÓN no están dejando NINGUNA para supports, en un árbol que usan mucho los supp**\"\n(Lo resumo y repito, para que dejes de insistir con el Sombrero, algo por lo que yo no estoy alegando).\n-----\nPues uso 75 champs de supp (muchos de esos, que ni son supp reales, esperando a manejar bien otros 30) y no necesito una runa que da maná en early (más que con 1 o 2, que exactamente no son supp). Aún menos con los **objetos que se encargan de prevenir el gasto**, y en una linea donde el gasto de maná es para defensa, armar o pokear (como cualquier linea), pero **sin farmear**. \nUn típico error con Rakan es fallar repetidamente el pokeo de la Q, desperdiciando maná y sin efectuar curación. Quizás ese es el problema.\n\nRespecto a esos 3 champs y la nueva runa:\n    - Morgana: Si es una habilidad canalizada, el efecto se activa después de la ulti, no debería ser distinto para ella. No lo he probado, pero: \"Channeled ultimates will trigger Nimbus Cloak once the channel ends.\"\n    - Con Nami y su ulti de 2750 unidades de alcance quizás si sea \"buena\", para alcanzar la TF ...pero con Naut, sigue siendo una runa que poco aporta, con una ulti de poco alcance, avance lento y que stunea, que para esparcirse necesita precisamente que el enemigo se mueva convenientemente, y teniendo aun a disposición la Q ...sobra bastante.\nCon eso, son Nami, Rakan y Pyke: 3 casos **puntuales** a los que se les \"podría\" sacar provecho con esa runa.","replies":[{"poster":"Kyousuke","date":"2018-06-13T16:45:22.778+0000","up_votes":3,"down_votes":1,"body":"yo te digo la razón por la cual sacaron el sombrero de lugar y debilitaron la rama para algunos champs y algunos combos, nada mas... para mi las runas siguen teniendo su utilidad y se sigue jugando por algo \norbe de anulación es perfecta para enfrentar a combos de daño mágico, puede que sea inútil si van {{champion:78}} /{{champion:555}} +{{champion:51}} o {{champion:429}}  pero el 90% de los champs de botlane tienen daño mágico y el orbe te salva de muchas ademas de baitear perfecto \nel anillo sirve para los que les gusta pockear o no tienen un 100% de hitbox en habilidades, ademas siempre se agradece un poco de mana extra en algunas situaciones de alta presión \nla capa ya dije los beneficios \nceleridad ahora sera muy buena para bastantes champs ya que, aunque nerfearon el movimiento, da mucho ap gracias a la conversión y con tantos items de soportes que dan movimiento adicional o activas de eso hace que pueda aprovecharse mucho mas esa runa, caminata sobre el agua es muy util para ayudar a tu jungla a la hora de cangrejos o counterjugleo, ademas de que en peleas de drake, nashor o cangrejo puede darte la vida y ayudarte a salvarte huyendo por rio, sin mencionar el roaming rápido. \ntrascendencia sirve para los soportes que acumulan cdr por su build core y les gusta mas el ap que consiguen con eso, la runa que nunca me termina de convencer es concentración profunda, pero con pjs de sustain o que puedan permanecer atrás sin recibir tanto daño es una runa de la cual sacaran partido \ntodas las runas de brujería están inspiradas en ganar recursos y potenciar movilidad, puede que despues agreguen otras mas para soportes pero hasta ahora nunca vi problema con esas runas base.\n\nsobre de lo naut, es mejor acercarte sin gastar la Q, es un recurso muy importante y si podes meter cc sin gastar tu único método de movilidad pues perfecto, casos similares son {{champion:412}} y{{champion:53}} cualquier main te dirá que es mejor guardar las Q para cuando gasten su dash o flash \n\nacabo de probar a morgana en entrenamiento y te da la velocidad de movimiento cuando la lanzas, aunque parece que esta algo bug y tarda un momento en activarse, pero funciona","replies":[{"poster":"AavatarisII","date":"2018-06-13T16:58:05.110+0000","up_votes":1,"down_votes":5,"body":"\"perfecta para enfrentar a combos de daño mágico\", situación puntual, especifica que no aplica a muchos casos para una linea basada principalmente (o totalmente) en daño físico, con daño mágico despreciable en gran parte de los mismos (como dije desde el comienzo).\n\n\"la capa ya dije los beneficios\"? No, fallaste al FORZAR ejemplos malos que rebatí con datos concretos.\nY la Banda de Maná: Yo juego al full pokeo y no se me acaba el maná, sera que tu si la necesitas.\n-----\nMira... ni sé cual es tu punto. Que tu \"si necesitas esas runas porque sino te quedas corto\", a pesar de los items de supp? pucha, ok\nHay quieres realmente no las necesitamos y quisiéramos una (o varias) OPCIONES que si sean útiles para Supports, con IMPACTO en el juego, en un árbol que usan los Supp de pokeo/utilidad \n...**y no cuesta nada agregar una 4ta runa (la que sea, pero sirva). Eso te molesta??**","replies":[{"poster":"Kyousuke","date":"2018-06-13T17:28:37.438+0000","up_votes":2,"down_votes":1,"body":"> que no aplica a muchos caso\n\ncasi todos los adc tienen habilidad de daño mágico y los soportes peor aun, casi todos los campeones en general tienen habilidad de daño mágico sin importa con que escale \nno force nada, solo di los ejemplos que se me ocurrieron y las situaciones beneficiosas o la razón del porque usaría esa runa pero estas totalmente en modo \"no me importa nada, si digo que esta mal entonces esta mal\" \ntodas las opciones son útiles y todas tienen su forma de funcionar, incluso combos entre si pero te negas a aceptar las cosas, la velocidad de movimiento es algo esencial en los soportes y es el árbol donde mas vas a conseguirla \nnunca dije que no puedan agregarla, arriba mismo lo mencione \n\n> puede que después agreguen otras mas para soportes\n\nmientras mas variedad y cosas metan al juego mejor para mi, pero deberías considerar opiniones externas","replies":[{"poster":"AavatarisII","date":"2018-06-13T17:37:23.725+0000","up_votes":1,"down_votes":3,"body":"Mucho de ese daño mágico es ínfimo o porcentual, mucho escala con AP, en ADC que no se arman AP, etc.\n\nNo es que \"no considere tu opinión\", pero: \nEn serio, a que vas? a que \"todas sirven\"? \nEn el mismo post remarco porque su función es despreciable, en comparación y en esa linea, para luego argumentar y rebatir a lo que, se resume, \"a ti si te hacen falta\" XS\nSi a ti te hacen falta esas runas, ok. Si te gusta escribir mucho con referencias forzadas, ok. Si quieres discutir porque si, ok. ...es que sigo creyendo que fuerzas malos argumentos (y sigo sin saber cual es tu punto! A alguien le haría mal una runa más que ayude a los Supp en ese árbol?)","replies":[{"poster":"Kyousuke","date":"2018-06-13T17:49:14.788+0000","up_votes":3,"down_votes":1,"body":"{{champion:145}} escala con ad y tiene pasiva y w daño mágico \n{{champion:81}} escala con ad y tiene w y r daño mágico \n{{champion:236}} W daño mágico y no es que pegue poco\n{{champion:96}} daño mágico en W,E Y R \n{{champion:110}}  daño mágico pasiva, W y R \n{{champion:42}} casi todo daño mágico \n{{champion:18}}la W si no mal recuerdo \n{{champion:22}}  la r y no es que pegue poco \ntodos los soportes casi hacen daño mágico\n\nentonces supongo que dejo la conver hasta acá, estas muy ciego a lo tuyo. suerte esperando las nuevas runas que sean de tu agrado","replies":[{"poster":"AavatarisII","date":"2018-06-13T17:54:37.018+0000","up_votes":1,"down_votes":3,"body":"Ok... oye, ok... lo que digas.\nTienes \"toda la razón\" (aunque no tienes un punto)\n\nSolo remarcas lo **limitado que TU te quedas sin esas runas** (todo un \"pro\"), tu necesidad de discutir (sin razón concreta) y, finalmente, TU **DECIDES \"cortar la conversación\" en la que no te puede llevar la razón** (sin buenos argumentos) y, otra vez, irte a lo personal (tachandome tu a mi de lo que se te da la gana, denuevo sin argumentos. \"ciego\"? \"si digo que esta mal esta mal\"?).\n\n\"linda\" actitud ¬¬","replies":[{"poster":"Kyousuke","date":"2018-06-13T18:01:24.136+0000","up_votes":2,"down_votes":1,"body":"Te doy datos de las runas y situaciones de uso, los campeones que le sacan provecho, los combos con las runas y las estrategias, la razón del porque dan esas estadísticas y funcionan de esa manera, la ventaja que da la utilidad y movilidad de las runas a los soportes y aun así seguís insistiendo conque las runas actuales no te dan ninguna ventaja con los soportes.... estas completamente cerrado a pensar que las runas son inutiles y tampoco veo que des argumentos, solo decís que no dejan ninguna útil para soportes y ya cuando todas son buenas y tienen su utilidad y valor.\nvos no queres ver el punto de la conversación y no tiene sentido seguir porque no abrirás los ojos sin importar lo que diga","replies":[{"poster":"AavatarisII","date":"2018-06-13T18:05:54.839+0000","up_votes":1,"down_votes":6,"body":"Si, oye, si campeón, lo que quieras...\nVuelve a revisar tus primeros \"argumentos\", como los rebatí y luego como respondiste ardido, que realmente no me interesa leerte con tu actitud, \"pro\" ;)","replies":[{"poster":"Kyousuke","date":"2018-06-13T18:11:22.050+0000","up_votes":2,"down_votes":1,"body":"y con esa respuesta se nota que tenias 0 intenciones de tratar de conseguir entendimiento sobre las runas y la situación \nbye bye","replies":[{"poster":"Kyousuke","date":"2018-06-13T18:17:05.571+0000","up_votes":2,"down_votes":1,"body":"y parece que no tenes mucho que decir y salio a la luz tu actitud toxica. \nsi es tu cuenta principal porque seguís unranked? \nno rebatiste nada XD solo te cerraste en tu burbuja","replies":[]},{"poster":"AavatarisII","date":"2018-06-13T18:18:20.176+0000","up_votes":1,"down_votes":1,"body":"Si, si campeón, lo que quieras...\nSigue comentando sin sentido (dandote la razón solo) y siendo despectivo engreidamente. \n...y vuelve a revisar tus primeros \"argumentos\", como los rebatí y luego como respondiste ardido, que realmente no me interesa leerte con tu actitud, \"pro\" ;)","replies":[]},{"poster":"AavatarisII","date":"2018-06-13T18:13:41.512+0000","up_votes":1,"down_votes":1,"body":"Si, si campeón, lo que quieras... \nSigue comentando sin sentido y siendo despectivo engreidamente. Y vuelve a revisar tus primeros \"argumentos\", como los rebatí y luego como respondiste ardido, que realmente no me interesa leerte con tu actitud, \"pro\" ;)","replies":[]}]}]}]}]}]}]}]},{"poster":"Zinc","date":"2018-06-13T18:28:29.283+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=AavatarisII,realm=LAS,application-id=v7qsfXsE,discussion-id=lJZ1jbKO,comment-id=000100000000000000000000,timestamp=2018-06-13T16:58:05.110+0000)\n>\n> &quot;perfecta para enfrentar a combos de daño mágico&quot;, situación puntual, especifica que no aplica a muchos casos para una linea basada principalmente (o totalmente) en daño físico, con daño mágico despreciable en gran parte de los mismos (como dije desde el comienzo).\n> \n> &quot;la capa ya dije los beneficios&quot;? No, fallaste al FORZAR ejemplos malos que rebatí con datos concretos.\n> Y la Banda de Maná: Yo juego al full pokeo y no se me acaba el maná, sera que tu si la necesitas.\n> -----\n> Mira... ni sé cual es tu punto. Que tu &quot;si necesitas esas runas porque sino te quedas corto&quot;, a pesar de los items de supp? pucha, ok\n> Hay quieres realmente no las necesitamos y quisiéramos una (o varias) OPCIONES que si sean útiles para Supports, con IMPACTO en el juego, en un árbol que usan los Supp de pokeo/utilidad \n> ...**y no cuesta nada agregar una 4ta runa (la que sea, pero sirva). Eso te molesta??**\n\nChe sin animo de ofender ni de defender al otro usuario, tenes una actitud extremadamente prepotente e irrespetuosa a la hora de responderle a aquellos que no estan deacuerdo contigo. \n\nDesde hace ya bastante tiempo que m llamas poderosamente la atencion la agresividad que mostras antes ideas diferentes. \n\nCapaz estaria bueno que te tomes la opinion del resto con mas calma, por ejemplo la mia que lo veo desde afuera y siento bastante toxicidad en tu manera de respoinderle a otros.\n\nSolo es un consejo.","replies":[]}]}]}]}]}]}]},{"poster":"fenixerege","date":"2018-06-13T15:57:07.548+0000","up_votes":1,"down_votes":0,"body":"la cuestion en si es que lo ultimo que faltaba nerfear eran los escudos y ahi esta el nerf, va a ser frustrante esa linea si juegas ADC y SUPP tradicional, ahora si juegas duos que tengan sinergia demas esta decir que estara mas decente el jugar bot","replies":[]}]}