{"poster":"luXiuSs","date":"2017-03-19T13:30:25.674+0000","title":"Jugadores Que Roban Linea en la Seleccion de Campeones","subforum":"Comportamiento del jugador","up_votes":9,"down_votes":0,"body":"Hola, buenos dias.\r\nEstoy escribiendo esto ya que me acaba de pasar que me toco la misma persona en 3 selecciones de campeon seguidas y cuando yo ganaba el rol de ad carry, el simplemente decia, no gane yo, y lockeaba vayne. Y como yo no queria jugar con gente como el, dodgeaba. La cuestion es que despues el que se tenia que esperar el tiempo de espera para poder jugar una partida nuevamente, era yo, no el troll que me quiera robar linea. El punto es que creo que deberia haber un tipo de solucion a estos porblemas, yo si pierdo linea suelo ir lo que quede, no me quejo, pero no soporto que me lo hagan a mi, espero que alguuien me responda, desde ya\r\nMuchas Gracias.\r\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"EnsaladaViolenta","date":"2017-03-19T17:32:41.547+0000","up_votes":6,"down_votes":0,"body":"Como es normal, varias soluciones. Lokeas tamh lo comes y lo tiras en medio de los 5 o no lo dejas salir de base (: , solución 2, vas adc igual, por que ganaste linea y estas en tu derecho y farmeas lo mas tranqui y si sos medio malo en lasthit te llevas una annie o zigs y le cagas todo el farm. Después de eso el tipo se va a pensar 2 veces si va a querer jugar asi. Soluciones sanas y que te alivian el alma. Tambien esta de resignarte y suportiarlo\n, pero alguien que lokea no va a ser un buen player y te vas a tiltear mas todavía. Pd: Y al final lo reportas obvio.","replies":[]},{"poster":"SBL Nightel","date":"2017-03-19T18:47:34.304+0000","up_votes":5,"down_votes":0,"body":"Lo peor es que si ganas la lane, hay un troll que pickea para ir al mismo rol que vos y decidis ir igual porque estás en tu derecho el resto del team te reporta a vos también. Increíble.","replies":[{"poster":"Spíroz","date":"2017-03-22T04:13:06.740+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nightel,realm=LAS,application-id=PJAKt7ph,discussion-id=XYbLG6Qu,comment-id=0003,timestamp=2017-03-19T18:47:34.304+0000)\n>\n> Lo peor es que si ganas la lane, hay un troll que pickea para ir al mismo rol que vos y decidis ir igual porque estás en tu derecho el resto del team te reporta a vos también. Increíble.\nPERO OVIAMENTE,SI VOS TE QUEJAS POR UN TROLL Y TERMINAS HACIENDO UNA PEOR QUE EL,EL TROLL QUIZA PIKE UNA LINEA QUE NO LE PERTENECE,PERO NO LLEVA UN SUPORT A TOP PARA TROLLEAR,O UN DOBLE MID,O DOBLE ADC....un poco de logica a tu comentario,por que me parece una \"azquerozidad\" las personas que hacen lo que vos haces.","replies":[]}]},{"poster":"9081913DEL1","date":"2017-03-19T15:13:02.778+0000","up_votes":3,"down_votes":0,"body":"Estas hablando de normales, en normales el dodge te afecta en cuanto al leavebuster.\n\nEn si tenes que tener en cuenta 3 cosas: \n1- Si hay una actitud negativa sos libre de reportar. Deberias de hecho.\n2- Si bloqueas a la persona probablemente no te salga en la proxima partida.\n3- Si vienes tiltado jugar inmediatamente no te dara buenos resultados, tomate 5 minutos, despues de casi una hora entre seleccion y fin de partida 5 minutos no es tanto y lo ganas en salud. (Ademas te ayudara revisar que paso en la partida, que podrias haber hecho distinto, y que hiciste bien.)\n\nSaludos!","replies":[{"poster":"Lich King MPH","date":"2017-03-19T18:43:37.773+0000","up_votes":1,"down_votes":0,"body":"Sabes xual es el problema... solo podes  bloquear a 30 personas...  jajaja y yo ya no tengo mas espacio. Me paso que me hicieron instalock, kitearon y a la siguiente me vuelve hacer lo mismo el mismo invocador, y conste que al querer bloquearlo no me dejo al tener ya los 30 bloqueos. Jajajaj xB","replies":[{"poster":"Sherpard","date":"2017-03-19T21:05:33.037+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Azir,realm=LAS,application-id=PJAKt7ph,discussion-id=XYbLG6Qu,comment-id=00010000,timestamp=2017-03-19T18:43:37.773+0000)\n>\n> Sabes xual es el problema... solo podes  bloquear a 30 personas...  jajaja y yo ya no tengo mas espacio. Me paso que me hicieron instalock, kitearon y a la siguiente me vuelve hacer lo mismo el mismo invocador, y conste que al querer bloquearlo no me dejo al tener ya los 30 bloqueos. Jajajaj xB\n\nDe todas formas el bloquear a alguien no sirve, puede tocarte en la siguiente partida o en una partida futura.\n\nEsta mas bien para no tener que leer su chat en una partida proxima.","replies":[]}]}]},{"poster":"EdxxEdxx","date":"2017-03-19T15:02:54.662+0000","up_votes":1,"down_votes":0,"body":"Lo podrías reportar por \"actitud antideportiva\", y especificar por qué en el reporte. Hacer dodge es algo que se puede, si, pero cuando haces dodge lo haces sabiendo perfectamente cuáles son las consecuencias. Que te sancionen está perfecto, te sancionan tanto a vos como a cualquiera que está molestando dodgeando partidas, y además hacer dodge no es la mejor solución tampoco :/.\n\nNo te podría dar una solución, al menos yo no XD, pero lo que te puedo decir es que intentes no dodgear porque salís perjudicado vos, ¿que son molestos? si, lo son, pero no te queda otra más que jugar y reportarlos al final de la partida. Si tu equipo también lo reporta por esa actitud dentro de poco lo van a terminar sancionando. Deberías olvidarte de esa gente y centrarte en jugar otra partida o lo que quieras, yo cuando me pasan esas cosas me enojo en la partida, pero como siempre juego soporte, si alguien tiene esa actitud en ADC... te podés imaginar.\n\nNo pero hablando serio, me enojo por esa partida y a la próxima ni me acuerdo de él, no deberías vos tampoco de hacerte mucho quilombo por esos individuos maliciosos :p","replies":[]}]}