{"poster":"xTHZx DevilNova","date":"2016-08-06T03:43:55.685+0000","title":"OLD BUT GOLD","subforum":"Karten & Spielmodi","up_votes":3,"down_votes":3,"body":"wie w&auml;re es denn mit einem modi der die alte map alten items und auch die alten champions animationen +skins beinhaltet ich wei&szlig; hier werden vieeeele flamen und sagen das riot das nicht macht weil das zeit aufwenig ist nurmal sooo nebenbei die alten daten werden niemals gel&ouml;scht wieso das so kann ich nicht sagen aber stellt euch mal vor mit den alten champs wieder zuspielen den alten sion ryze ashe uvm dazu noch die items die rausgenommen wurden bsp letzter atemzug das erste schwarze beil der alte blutd&uuml;rster die stackitems f&uuml;r leben und ad klar das w&auml;re wieder mal op aber es ist ein modi und die modis sind f&uuml;r fun fun und noch mal fun stellt es euch doch mal bildlich vor mal wieder in der beta phase zuspielen da konnte man zumindest noch nicht 1shotten ^^\r\n\r\nLG xTHzx DevilNova{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"LightsEUW","date":"2016-08-06T09:44:19.898+0000","up_votes":1,"down_votes":0,"body":"**Würde Probleme mit neuen Champions bla bla geben, also leider nein. =(**","replies":[{"poster":"xTHZx DevilNova","date":"2016-08-08T09:37:43.747+0000","up_votes":1,"down_votes":0,"body":"inwiefern probleme erleutere dann mal deine aussage","replies":[{"poster":"LightsEUW","date":"2016-08-08T16:12:35.291+0000","up_votes":1,"down_votes":0,"body":"Mit dem System und den Codierungen, es würde ein riesiger Spaghetti-Code werden wenn man alles wieder zurück updatet","replies":[{"poster":"xTHZx DevilNova","date":"2016-08-08T23:19:53.558+0000","up_votes":1,"down_votes":0,"body":"hmmmmmm man könnte dies schon iiirgendwie regeln aber es kann auch sein dass, das team es schon ma versucht hat ich bin mir sicher das es auch irgendwie einfacher geht nur ich wüsste nicht wie würde ich das alles vor mir haben könnte ich das versuchen aber soooo ohne direkten blick drauf is es natürlich unmöglich","replies":[]}]}]}]},{"poster":"Aenrikr","date":"2016-08-08T10:05:43.480+0000","up_votes":1,"down_votes":0,"body":"Ich würde hier meinen wollen, dass es die Entwickler vor die gleichen Probleme stellen würde wie Blizzard mit den Legacy Servern.\nZu wenig Nachfrage, zu großer Aufwand, zu teuer.\n\nIch meine, was wäre nötig:\n\n- Seperater Client - Als ob der Live, PTR und Alpha Client nicht schon genug wären ^^\n\n- Seperate Server - Das Ganze müsste man als vollständig eigenständiges Spiel behandeln und dementsprechend neue Serverstrukuren aufbauen, die Kosten wären immens\n\n- Werben - Wirb mal LoL Classic ... veraltete Technik ist nicht wirklich als werbekräftig zu bezeichnen\n\n- Doppelt zahlen - Juhuuuu, natürlich geb ich nochmal hunderte von Euros aus um mir die Champs und Skins erneut zu kaufen\n\n- Keine Weiterentwicklung - soll ja alt bleiben, ist bestimmt motivierend ^^ Ist ja nicht so, dass die Fans jetzt schon auf die Barrikaden gehen weil sie ein paar Tage auf einen Skin warten müssen (Siehe \"Projekt-Whine\" um mal ein aktuelles Beispiel zu nennen). Will gar nicht wissen wie man auf Stillstand reagieren würde XD\n\n- Verwaltung - darf man nicht vergessen, neue Leute einstellen die das Ganze warten müssen. Inklusive Putzfrau die einmal die Woche die laufenden Server feucht abwischt um für Ausfälle derselben zu sorgen, die gehören nämlich mit zum Klassik-Feeling XD\n\nSry Keule, kein Bedarf ^^","replies":[{"poster":"xTHZx DevilNova","date":"2016-08-08T12:49:41.232+0000","up_votes":1,"down_votes":0,"body":"wer redet von neu kaufen es soll ein modus sein wie urf oder son scheiß und kein neues game also n bissel sollte man schon acht drauf geben was man kommentiert wozu n seperaten client machen wenn die so oder so noch den alten client haben werden wozu ein weiteren server wenn das nur ein zusatz werden soll und kein neues spiel?! ist zwar schlau geredet aber in den thead geteilt\n{{sticker:slayer-jinx-unamused}} ","replies":[]}]}]}