{"poster":"LoL Genocide","date":"2016-12-14T02:02:02.851+0000","title":"League locks up after game, can't talk in game","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"League black screens starting game, can't talk in game, league locks up my computer after game. Happens in Legacy and beta clients...HELP?","replies":[{"poster":"Targons Blade","date":"2016-12-14T02:57:53.011+0000","up_votes":2,"down_votes":0,"body":"This definitely sounds like something related to your Graphics Card or display device. Most of these types of issues are caused by either driver issues or hardware failure. We've consolidated the most common fixes inside our [**FPS Guide**](https://support.riotgames.com/hc/en-us/articles/201752684-Low-Frame-Rate-FPS-Troubleshooting) (this covers all display issues, not just FPS) so I'd like you to try those steps.\n\nLet me know if this caused any change.","replies":[{"poster":"LoL Genocide","date":"2016-12-14T03:34:16.212+0000","up_votes":2,"down_votes":0,"body":"I think you may be right, I disconnected one of my monitors, haven't had the issue again as of yet. Thank you","replies":[]},{"poster":"LoL Genocide","date":"2016-12-16T07:35:13.430+0000","up_votes":1,"down_votes":0,"body":"I lied. Did it again, I run 3 monitors, down to 1 now, did it to me again. Swapped from 960 graphics card back to 760, did it to me again. It's like 1 out of 5 games. Please help. All drivers are up to date, except chipset driver, which my computer will not allow me to update.","replies":[{"poster":"Targons Blade","date":"2016-12-18T21:26:08.119+0000","up_votes":1,"down_votes":0,"body":"Since you're still seeing issues after taking all the steps in that Guide, we'll need to escalate this to our tech team in order to troubleshoot further. I recommend grabbing some system logs using our [**HRT App**](https://support.riotgames.com/hc/en-us/articles/224826367), then attach them to a [**support ticket**](https://support.riotgames.com/hc/en-us/requests/new) so one of our techs can take a look at get back in touch with you.\n\nLet me know if you encounter issues.","replies":[]}]}]}]}