{"poster":"Pyrithegethon","date":"2018-07-11T16:36:16.572+0000","title":"How come Swain ult doesn't drain stealthed/enemies in bushes?","subforum":"Gameplay","up_votes":28,"down_votes":0,"body":"If you don&#039;t have vision on an enemy champion whether they are stealthed or in a bush right next to him that he doesn&#039;t have vision in his ultimate won&#039;t do any drain damage. \r\n\r\nEasy to test this, have an Akali use W and stand in her shroud with an enemy Swain having ult active and standing in the shroud. \r\n\r\nOr have a Swain ult then walk into a bush he has no vision in.","replies":[{"poster":"OurLestrade","date":"2018-07-11T17:08:10.196+0000","up_votes":2,"down_votes":0,"body":"Perhaps it's an analogy and metaphor?","replies":[{"poster":"Pyrithegethon","date":"2018-07-11T17:37:40.784+0000","up_votes":1,"down_votes":0,"body":"What analogy?","replies":[{"poster":"OurLestrade","date":"2018-07-11T18:00:01.061+0000","up_votes":43,"down_votes":1,"body":"> [{quoted}](name=Pyrithegethon,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=00000000,timestamp=2018-07-11T17:37:40.784+0000)\n>\n> What analogy?\n\nMayhaps it is the leader of an Imperial nation, the ultimate antithesis to nature, ironically being countered by the brush - grass, the most basic foundation of the natural order itself. Potentially could Riot be implying that industry and human expansion cannot trump nature, for life always finds a way? It makes one think, it truly does.","replies":[{"poster":"Chembaron Yamada","date":"2018-07-11T20:18:33.005+0000","up_votes":48,"down_votes":1,"body":"On a scale from 1 to Ivern, how high are you?","replies":[{"poster":"OurLestrade","date":"2018-07-11T20:35:08.968+0000","up_votes":38,"down_votes":1,"body":"> [{quoted}](name=SatomiKun,realm=EUW,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=0000000000000000,timestamp=2018-07-11T20:18:33.005+0000)\n>\n> On a scale from 1 to Ivern, how high are you?\n\nYes.","replies":[{"poster":"Tokogawaruf","date":"2018-07-12T00:00:57.411+0000","up_votes":4,"down_votes":0,"body":"You just made my Day.","replies":[]}]},{"poster":"AmazoX","date":"2018-07-12T08:01:15.479+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SatomiKun,realm=EUW,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=0000000000000000,timestamp=2018-07-11T20:18:33.005+0000)\n>\n> On a scale from 1 to Ivern, how high are you?\n\nLOL","replies":[]},{"poster":"Lord Malpercio","date":"2018-07-12T00:18:03.866+0000","up_votes":2,"down_votes":0,"body":"{{champion:78}} ulti knockup high","replies":[]},{"poster":"Velzard of Koz","date":"2018-07-11T21:24:00.559+0000","up_votes":2,"down_votes":0,"body":"Snoop Dog","replies":[]}]},{"poster":"Riot Wav3Break","date":"2018-07-14T03:47:42.210+0000","up_votes":3,"down_votes":0,"body":"I like this answer better than mine. Disregard everything I’ve said.\n\nLife will always find a way, but Noxus will win in the end >:).","replies":[]}]}]}]},{"poster":"Riot Wav3Break","date":"2018-07-12T07:55:28.921+0000","up_votes":15,"down_votes":14,"body":"This is by intent. Felt that this interaction preserves more counter play and gives more room for the ultimate to be powerful when used in better situations.","replies":[{"poster":"Teridax68","date":"2018-07-12T08:26:29.888+0000","up_votes":21,"down_votes":2,"body":"Isn't this kind of inconsistent with other abilities, though? Like, for sure, this is a great reason to not have an ability target stealthed enemies, but when there are abilities like Morgana's ult, Katarina's ult, Kennen's W, etc. to name but a few examples of abilities that do target stealthed champions, having all of these abilities do one thing, and having one ability that does very similar things, with this one exception, isn't really clear to players. Do developers consider consistency when deciding on these mechanics, and if so, how important is consistency to them?","replies":[{"poster":"Nevrankroaton","date":"2018-07-12T08:33:54.029+0000","up_votes":2,"down_votes":1,"body":"Isn't that kinda also because of the coding?\n\nMorgana tether doesn't break when you get in stealth because it suceeded to connect in the first place.\nKennen marked you, which make his W auto track.\n\nI feel the comparaison with Katarina is fair kinda, but katarina doesn't move when she is ulting while swain can move and use his abilities, I feel that \"by nature\", it is far more oppressive.","replies":[{"poster":"Teridax68","date":"2018-07-12T09:28:33.586+0000","up_votes":7,"down_votes":1,"body":"Hecarim's W leaves a particle effect and damages stealthed enemies, even when he's on the move, Camille's Hookshot gains extra range against stealthed champions, even if they're invisible, and Zombie Brand infamously had this issue where he'd start doing his zombie walk when near _any_ champion, including champions that were invisible to him. It should therefore not be a coding issue, since we have plenty of abilities in-game that can detect invisible enemies on the fly, plus Wav3Break mentioned that Swain's special case was intended.","replies":[{"poster":"TonyWolf77","date":"2018-07-12T20:44:03.448+0000","up_votes":3,"down_votes":0,"body":"Here's a fun one! I play Evelynn when I go jungle. After you hit level six and get your stealth passive your \"sighted\" indicator goes off even whenever a stealthed enemy is around, making you a real neat trinket with legs. {{sticker:slayer-jinx-wink}}","replies":[]}]}]},{"poster":"Riot Wav3Break","date":"2018-07-14T03:04:45.450+0000","up_votes":2,"down_votes":1,"body":"Your point is fair and I also agree that consistency is important. In this particular case there's 1 main reason why I valued this interaction over consistency. The biggest difference between the spells you've named and Swain's ultimate is duration of effects. This to me was the crux of my decision making at the time. I wanted to carve out power budget in Swain's kit to maximize the duration of his ultimate in order to better reflect the experience of his old ult. I saw this mechanic as a minor design optimization that gave me valuable room in pursuing that goal. \n\nFrom an adjacent angle, the burden of play for the spells you've mentioned are also much higher since they resolve much faster, have shorter range, are un-castable when there are no valid enemies nearby and include mechanics like keeping in range for X time / marking enemies before hand. All of these aspects make them much more contextual than Swain's ultimate and it would feel like unnecessary counter play for them to also adhere to vision rules strictly. \n\nI think you can make a reasonable argument that the amount of power budget I'm actually buying for Swain's ult duration isn't worth the consistency/expectation cost, but at the time this was the rationale I had for it being a reasonable trade off. \n\nMy personal taste is to preserve the power of vision control when possible. Another place on Swain I'd highlight is that his E doesn't reveal targets it roots (we are pretty inconsistent on this stuff as well) but his W is a semi-global reveal which offsets that. I felt dis-empowering the base-line functionality of E here actually created more synergy in his kit internally and made accessing his power feel more intentional.","replies":[{"poster":"Teridax68","date":"2018-07-14T04:22:22.090+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Wav3Break,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a00020004,timestamp=2018-07-14T03:04:45.450+0000)\n> \n> I think you can make a reasonable argument that the amount of power budget I&#x27;m actually buying for Swain&#x27;s ult duration isn&#x27;t worth the consistency/expectation cost, but at the time this was the rationale I had for it being a reasonable trade off. \n\nI mean, at the end of the day it comes down to how much one values micro-optimizations over consistency, though at the same time I'm personally averse to making exceptions to a general rule for reasons that are not themselves exceptional. In this particular case, power budget is a vast, general thing that could be approached from a bunch of different ways, many of which would not incur a long-term cost such as a degradation to the game's consistency. While it was an honorable decision to try to preserve the old ult's duration, at this point I feel the focus has nonetheless shifted from the drain to the explosion at the end, so players have an incentive to shorten the duration as much as possible in most cases. In this respect, I feel removing this exception may not affect Swain or his power budget as drastically as had been anticipated.\n\nOn the subject of vision and stealth detection, though, I also very much agree that vision should be kept sparse, yet clearly impactful. In this respect, it may perhaps be better to flip the situation, and remove stealth detection from a whole bunch of abilities, instead of adding it on Swain. In general, vision still feels like largely unexplored territory on champion kits, and is also a hotbed of inconsistent behavior: some abilities reveal the area where they land, other don't, some will reveal enemies they hit, others just have an impact sound, and some give strictly no response to whether or not they hit out of vision. Almost every time, there is no explanation on the ability tooltips for this kind of behavior.\n\nI very much like Swain's W as an ability whose clear, central purpose is to provide vision as a tactical advantage, and I feel this could help define vision across more abilities: if the ability is specifically intended to supply information as utility, then it should likely provide vision or some equivalent, but otherwise it likely shouldn't. With this in mind, I'd personally be okay with Swain's ult not working against invisible enemies, so long as more effects were then retroactively changed to lose their own implicit stealth detection. Once more, we'd be back to a more consistent environment, and ideally one where vision and detection could have a chance to stand out better.","replies":[]}]},{"poster":"SlowChemical","date":"2018-07-12T19:32:28.376+0000","up_votes":2,"down_votes":0,"body":"Really good question, would love to hear a follow up red response.","replies":[]},{"poster":"5050BS","date":"2018-07-12T09:13:07.383+0000","up_votes":2,"down_votes":1,"body":"His Old Ult would Drain Stealthed champs.  I loved going vs Akali and Shaco then.  I would ult and could follow the Crows.\n\nRiot GUTTED his ult.  The whole \"Souls\" thing was wasted in his rework and is used to hamstring his Ult even more.  Im not sure why because his WHOLE Kit is less then he was before and less then a TON of current champs.","replies":[]},{"poster":"The Djinn","date":"2018-07-12T16:26:04.472+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Teridax68,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a0002,timestamp=2018-07-12T08:26:29.888+0000)\n>\n> Isn&#x27;t this kind of inconsistent with other abilities, though? Like, for sure, this is a great reason to not have an ability target stealthed enemies, but when there are abilities like Morgana&#x27;s ult, Katarina&#x27;s ult, Kennen&#x27;s W, etc. to name but a few examples of abilities that do target stealthed champions, having all of these abilities do one thing, and having one ability that does very similar things, with this one exception, isn&#x27;t really clear to players. Do developers consider consistency when deciding on these mechanics, and if so, how important is consistency to them?\n\nIt could definitely benefit from a clarity pass, I think. **Deals damage to the X closest [or all] enemies** vs. **Targets the X closest enemies, doing damage to each** seems like it would help clear up whether the effect ticks through vision/stealth (the former) or requires a visible target (the latter).","replies":[{"poster":"Teridax68","date":"2018-07-12T18:50:50.020+0000","up_votes":1,"down_votes":0,"body":"For sure, changing the wording could clarify things, particularly if one were to specify whether the ability damaged visible nearby enemies, or all enemies. However, that also kind of dodges the issue, in that it doesn't justify by itself why one ability should do one thing, and another ability that works in a very similar manner should do that thing differently. In this particular case, if it's healthier for Swain's ult to not target invisible opponents, why doesn't this reasoning apply to other auto-targeted abilities? There are effectively two types of inconsistency at work: inconsistency in presentation, in that two very similar abilities can differ in ways the players cannot reasonably expect, but also inconsistency in reasoning, in which those two abilities work differently purely because they stem from two different trains of thought, neither of which were done with consideration for the other. Your proposal solves the first issue, but not the second.","replies":[{"poster":"The Djinn","date":"2018-07-12T18:55:01.402+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Teridax68,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a000200020000,timestamp=2018-07-12T18:50:50.020+0000)However, that also kind of dodges the issue, in that it doesn&#x27;t justify by itself why one ability should do one thing, and another ability that works in a very similar manner should do that thing differently.\n\nI guess my suggestion was to help clarify that they aren't intended to work in a similar manner. If one is an \"all enemies\" effect and one is a \"visible targets only\" effect that the distinction becomes clearer.\n\n>In this particular case, if it's healthier for Swain's ult to not target invisible opponents, why doesn't this reasoning apply to other auto-targeting abilities?\n\nBecause a lot of AoEs don't target -- they're ticking effects. To me this thematically is fairly clear -- effects that set up a \"kill zone\" don't require visible targets (such as a field of fire), while those that imply action on the part of the champion (throwing knives, sucking souls, etc) do. Now, I also fully understand that you (or others) may disagree on the clarity here, but I think there's definitely room for AoE effects that do require visible targets AND AoE effects that don't, provided the line between them is a bit more clear than it currently is.","replies":[{"poster":"Teridax68","date":"2018-07-12T19:13:54.218+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a0002000200000000,timestamp=2018-07-12T18:55:01.402+0000)\n>\n> Because a lot of AoEs don&#x27;t target -- they&#x27;re ticking effects. To me this thematically is fairly clear -- effects that set up a &quot;kill zone&quot; don&#x27;t require visible targets (such as a field of fire), while those that imply action on the part of the champion (throwing knives, sucking souls, etc) do. Now, I also fully understand that you (or others) may disagree on the clarity here, but I think there&#x27;s definitely room for AoE effects that do require visible targets AND AoE effects that don&#x27;t, provided the line between them is a bit more clear than it currently is.\n\nOkay, but then we also have a lot of effects that _aren't_ static kill zones: I mentioned this in another post, but we also have stuff like Hecarim's W and Camille's W which impact upon stealthed opponents, and even Morgana's own ult has the same functionality. Whether you like it or not, these abilities have stealth detection, no matter how implicit. For sure, it's _possible_ to do abilities differently, and it could be perfectly valid, but in order to be so there needs to be consistent justification, which should also be clear to players. Here, there does not appear to be any such justification, which is also why many players are pointing out the resulting inconsistency.","replies":[{"poster":"The Djinn","date":"2018-07-12T19:41:52.129+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Teridax68,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a00020002000000000000,timestamp=2018-07-12T19:13:54.218+0000)Okay, but then we also have a lot of effects that _aren&#x27;t_ static kill zones: I mentioned this in another post, but we also have stuff like Hecarim&#x27;s W and Camille&#x27;s W which impact upon stealthed opponents, and even Morgana&#x27;s own ult has the same functionality. \n\nSee, to me that isn't a disconnect still -- Morgana's ult specifically grants vision as part of its effect and Hecarim's W is a ticking damage zone, while Camille's is a non-targeted AoE. I guess in my brain any effect that isn't champion-specific in its animation (and Swain's is, as it pulls particles from them to Swain) will logically hit everything regardless of visibility.\n\nNow, there are some weird exceptions to this that I don't like -- namely Katarina, who I don't think respects target visibility, but I must admit I'm not certain.\n\nIn short, I think it's a reasonable and intentional chance that only suffers from a lack of clarify because other similar effects (like Katarina's) aren't clear one the distinction, and that it definitely needs a *clarity* pass so that abilities with enemy-specific animations traveling from targets to the champion or from the champion to the targets follow one set of rules while target-agnostic effects that simply apply to everyone in the area follow a second -- but that the mechanical functionality is fine.","replies":[{"poster":"Teridax68","date":"2018-07-12T20:29:43.235+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a000200020000000000000000,timestamp=2018-07-12T19:41:52.129+0000)\n>\n> See, to me that isn&#x27;t a disconnect still -- \n\nTo you, perhaps, but the very existence of this thread proves that your opinion is not the only one out there, and that many more people do feel a disconnect. Moreover, the argument as you're presenting it is subjective: it is ultimately what _you_ think is the justification for the difference between these abilities, even if this may have strictly nothing to do with actual reasoning from the developers, if reasoning there was. With enough digging, anyone could easily come up with some particular argument to justify inconsistencies in functionality such as these; that does not mean doing so justifies anything or addresses the issue at hand.","replies":[{"poster":"The Djinn","date":"2018-07-12T20:33:23.106+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Teridax68,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a0002000200000000000000000000,timestamp=2018-07-12T20:29:43.235+0000)To you, perhaps, but the very existence of this thread proves that your opinion is not the only one out there, and that many more people do feel a disconnect. \n\nI never said my opinion was the only one -- just sharing my thoughts since we're talking about it. :)\n\n>With enough digging, anyone could easily come up with some particular argument to justify inconsistencies in functionality such as these; that does not mean doing so justifies anything or addresses the issue at hand.\n\nIt's true that there are several solutions to this. I'm simply proposing the one I think might be the best course of action given Riot's apparent desire to keep these different functionalities in place. 'tis all. :)","replies":[{"poster":"Teridax68","date":"2018-07-12T21:22:16.271+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a00020002000000000000000000000000,timestamp=2018-07-12T20:33:23.106+0000)\n>\n> I never said my opinion was the only one -- just sharing my thoughts since we&#x27;re talking about it. :)\n\nSure, but sharing one's thoughts does not automatically contribute to discussion. Everyone has an opinion, and is capable of conjecture, but unless those relate to the context of the discussion and address it, neither will automatically move it forward. \"I feel this certain type of way\" is certainly an opinion, but provides no opportunity for discussion in and of itself, because ultimately it is just an opinion, untethered by context or fact. By contrast, statements like \"several people feel this way\", \"Riot said X, so this is their official reasoning\", or \"ability A clearly differs from ability B in this minute component, despite being so similar\" are all falsifiable, i.e. verifiable in a manner that cannot be reduced to opinion, and are therefore capable of truly adding to the conversation.\n\n> [{quoted}](name=The Djinn,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a00020002000000000000000000000000,timestamp=2018-07-12T20:33:23.106+0000)\n> \n> It&#x27;s true that there are several solutions to this. I&#x27;m simply proposing the one I think might be the best course of action given Riot&#x27;s apparent desire to keep these different functionalities in place. &#x27;tis all. :)\n\nBut it's not really a solution though? For sure, improving the wording would help with some portion of the clarity issues, but as mentioned above, that addresses only one of the inconsistencies at hand. Giving out your personal opinion on how you think there's no contradiction between the implementation of certain abilities, doesn't magically solve the problem of many other people still finding those implementations to be inconsistent.","replies":[{"poster":"The Djinn","date":"2018-07-12T21:51:46.709+0000","up_votes":1,"down_votes":0,"body":">Sure, but sharing one's thoughts does not automatically contribute to discussion.\n\nDesign is all about thoughts though. There's no really objective way to judge \"is this ability fun\" or \"would this character be more fun if we replaced their W, and, if so, what with?\" At some level all of these decisions are, ultimately, a bit subjective. What feels right for you may not feel right for me, and vice versa. It doesn't make one of us wrong -- it just means that we don't agree on what the solution to a problem should be in an ideal game state, because we may not agree on the definition of what the ideal game state is.\n\nIf you don't personally feel my thoughts are helpful to the discussion you want to have, I encourage you to ignore those thoughts.\n\n> [{quoted}](name=Teridax68,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a000200020000000000000000000000000000,timestamp=2018-07-12T21:22:16.271+0000)...or \"ability A clearly differs from ability B in this minute component, despite being so similar\" are all falsifiable, i.e. verifiable in a manner that cannot be reduced to opinion, and are therefore capable of truly adding to the conversation.\n\nI think I did do this, but the miscommunication here may stem from the fact that I'm not sure we agree on the issue.\n\nYour issue appears to to be an inconsistency with how area-of-effect effects select targets.\n\nMy issue is that I see two distinct types of AoE effects (all targets within the area, and *specific* targets within the area), and I think the clarity between them and the way they are represented needs to be improved.\n\n> But it's not really a solution though?\n\nI mean, I think it is, yes. Drawing better lines regarding the different types of AoE targeting and thinking about how to represent that visually is an equally viable solution to making all AoE effects have similar targeting. Both accomplish the same goal of clarifying \"why did I get hit/not get hit,\" just both do so in different ways.","replies":[{"poster":"Teridax68","date":"2018-07-12T22:15:54.912+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a0002000200000000000000000000000000000000,timestamp=2018-07-12T21:51:46.709+0000)\n>\n> Design is all about thoughts though. There&#x27;s no really objective way to judge &quot;is this ability fun&quot; or &quot;would this character be more fun if we replaced their W, and, if so, what with?&quot; At some level all of these decisions are, ultimately, a bit subjective. What feels right for you may not feel right for me, and vice versa. It doesn&#x27;t make one of us wrong -- it just means that we don&#x27;t agree on what the solution to a problem should be in an ideal game state, because we may not agree on the definition of what the ideal game state is.\n\nSure, but design does not operate in a vacuum either. No matter how good you feel about your opinion, it's not going to achieve anything if it doesn't fit into a larger context, or if it doesn't work with whichever audience you are presenting it to. Note that my issue here is not that I disagree with you; rather, the fact that your justification for presenting your opinion as some general solution is that all of design is subjective, to me indicates that it did not go through this process of context and analysis, and therefore cannot really help with the topic at hand, beyond just giving out one more opinion.\n\n> [{quoted}](name=The Djinn,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a0002000200000000000000000000000000000000,timestamp=2018-07-12T21:51:46.709+0000)\n> \n> Your issue appears to to be an inconsistency with how area-of-effect effects select targets.\n\nIndeed, and this is, in fact, the topic of discussion I put forth in my very first reply here, which you then responded to in your own first reply. I'm glad we're finally checking in on this to resolve whichever misunderstanding may have arisen.\n\n> [{quoted}](name=The Djinn,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a0002000200000000000000000000000000000000,timestamp=2018-07-12T21:51:46.709+0000)\n> \n> My issue is that I see two distinct types of AoE effects (all targets within the area, and *specific* targets within the area), and I think the clarity between them and the way they are represented needs to be improved.\n> \n> I mean, I think it is, yes. Drawing better lines regarding the different types of AoE targeting and thinking about how to represent that visually is an equally viable solution to making all AoE effects have similar targeting. Both accomplish the same goal of clarifying &quot;why did I get hit/not get hit,&quot; just both do so in different ways.\n\nOkay, but then by your own admission, you took a discussion, tried to turn it into a different discussion, and then proposed a \"solution\" to the latter discussion as framed in your own terms. You are certainly having a discussion, and proposing a solution to that discussion, but are doing so in complete isolation. Meanwhile, I was having a discussion of my own, using axioms that differ from yours, and thought your reply would be a continuation of that, only to find out that you instead wanted to talk about your own stuff without considering mine. I don't believe in the separation of abilities you've described, a separation that you've admitted to being wholly subjective, so if your entire argument relies on this unfounded assumption, we're just going to have to agree to disagree, and leave it at that.","replies":[{"poster":"The Djinn","date":"2018-07-12T22:26:24.297+0000","up_votes":1,"down_votes":0,"body":"> Okay, but then by your own admission, you took a discussion, tried to turn it into a different discussion, and then proposed a &quot;solution&quot; to the latter discussion as framed in your own terms.\n\nIf the point of a discussion is to only discuss a single viewpoint of the situation, then yes, I did, and I apologize if that was your intent. To me we were talking about the same problem from two different viewpoints, which I assumed would be interesting to anyone trying to get a holistic view of the clarity and consistency issue as seen by multiple members of the community.\n\nIf you do not agree with that interpretation that's fine, and I'm sorry if you see it as me disrailing your discussion.","replies":[{"poster":"Teridax68","date":"2018-07-12T23:01:28.915+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a0002000200000000000000000000000000000000000000000001,timestamp=2018-07-12T22:45:41.341+0000)\n>\n> For the record, it was actually intended as a legitimate apology. I do not apologize for making the post in good faith, but I am sorry if you did not see it the way I intended. It is in no way an attempt to blame you for that feeling, but merely my apology that my post bothered you.\n\nOkay, and this would have been appreciated, had you not repeated the exact mistake I pointed out. \"I'm sorry _I_ did something that made you feel this way\" is a valid apology, \"I'm sorry _you_ feel this way about what I did\" is not. Your apology as formulated in your third sentence does this properly, but the one in your second sentence does not. Even if it was not your intention to come off as rude, please be mindful of this in your future posts.","replies":[]},{"poster":"The Djinn","date":"2018-07-12T22:45:41.341+0000","up_votes":1,"down_votes":0,"body":"For the record, it was actually intended as a legitimate apology. I do not apologize for making the post in good faith, but I am sorry if you did not see it the way I intended. It is in no way an attempt to blame you for that feeling, but merely my apology that my post bothered you.\n\nYou can accept my apology or not, and you can believe it to be in good faith or not. What I have told you here is the truth however: I am sorry if my post offended.","replies":[]},{"poster":"Teridax68","date":"2018-07-12T22:41:13.845+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a000200020000000000000000000000000000000000000000,timestamp=2018-07-12T22:26:24.297+0000)\n>\n> If the point of a discussion is to only discuss a single viewpoint of the situation, then yes, I did, and I apologize if that was your intent. To me we were talking about the same problem from two different viewpoints, which I assumed would be interesting to anyone trying to get a holistic view of the clarity and consistency issue as seen by multiple members of the community.\n\nBut that's not it at all, though. We started off sharing our different viewpoints on the topic of inconsistency, a topic many others have been able to discuss, and share their own viewpoints, without derailing the conversation. \"This is the topic of discussion, and we have different viewpoints\" is different from \"I have a different viewpoint, so I'm making my own discussion happen, even if it wasn't the discussion at hand\". That you do not see inconsistencies with the way different abilities are implemented is fine, but to to go on to try to argue based on this opinion means I have no means of continuing further discussion with you on the matter, other than by repeating that I disagree with the premise, and was trying to talk about something a little different long before you gave your first input. What exactly were you expecting me to say?\n\n> [{quoted}](name=The Djinn,realm=NA,application-id=3ErqAdtq,discussion-id=roxpMzNU,comment-id=000a000200020000000000000000000000000000000000000000,timestamp=2018-07-12T22:26:24.297+0000)\n> \n> If you do not agree with that interpretation that&#x27;s fine, and I&#x27;m sorry if you see it as me disrailing your discussion.\n\n\"I'm sorry you feel that way\" merely displaces blame on the other person by putting the focus on their reaction, rather than on whatever it is you did that may have caused the situation in the first place. It is not a genuine apology, and is disrespectful to the person you are producing this fake apology to. As a moderator in charge of monitoring player behavior and leading by example, you should know better, and it is disappointing to see this kind of attitude in what has otherwise been a civil discussion.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Z3Sleeper","date":"2018-07-12T11:17:57.219+0000","up_votes":4,"down_votes":0,"body":"Reconsider. Almost every other proximity targeted AoE effect targets stealth champions as well.\n\nTo name a few (if not all):\n\n{{champion:55}} R\n{{champion:23}} W\n{{champion:25}} R\n{{champion:29}} E\n{{champion:85}} W\n\nFor the sake of consistency, allow it to. Old Swain would target stealthed units with his ult as well. Doesn't quite make sense for him to be the only exclusion.\n\nEdit: I guess Ahri W and Zoe W both also don't target stealth.","replies":[]},{"poster":"nm1010","date":"2018-07-12T12:41:20.116+0000","up_votes":2,"down_votes":1,"body":"Ah so throw consistency out the window for \"counter play\", maybe the counter play should be not letting the slow short range battlemage get close to you? The ultimate is a tether and should function as such, stop making exceptions to rules that don't need them.","replies":[]},{"poster":"NaturesMayhem","date":"2018-07-12T18:56:53.597+0000","up_votes":1,"down_votes":0,"body":"I personally think this is smart. Giving champions more counter-play and allowing for a higher skill ceiling on the champ is what this game needs. Yes as others people have said, champions have similar abilities that work similarly. But I believe that's irrelevant as regardless of how similar a ability is, they are different champs, and each ability has it's own quirk. Every movement speed ability isn't the same, every invisibility ability isn't the same and so on, why should every AoE ult proc on invisible champions then?","replies":[]},{"poster":"Cosnirak","date":"2018-07-12T17:35:58.022+0000","up_votes":1,"down_votes":0,"body":"If almost no one knows it works that way then almost no one can use it as counterplay. It's so inconsistent with the intuition and expectations of players that this thread exists and that should be a huge red flag. I suggest changing it.","replies":[]}]},{"poster":"Velzard of Koz","date":"2018-07-11T21:25:02.138+0000","up_votes":12,"down_votes":0,"body":"It's funny though that Fiddle crow (at least in ARAM) will always find a way to hit you, even when not seen. Doesn't even reveal you on-hit, just you see this crow randomly hitting something.","replies":[{"poster":"Friendly Ram","date":"2018-07-12T00:59:06.309+0000","up_votes":2,"down_votes":0,"body":"I love when the enemy team has a shaco as fidd. Kills off of his boxes are so fun.","replies":[]}]},{"poster":"woodvsmurph","date":"2018-07-11T17:39:10.492+0000","up_votes":6,"down_votes":1,"body":"{{champion:17}} the ULTIMATE swain counter?","replies":[]},{"poster":"Dokueki Kenshin","date":"2018-07-11T20:19:01.115+0000","up_votes":1,"down_votes":0,"body":"Maybe a bug? Try reporting it in tech support.","replies":[{"poster":"Pyrithegethon","date":"2018-07-11T21:43:33.435+0000","up_votes":4,"down_votes":0,"body":"Do they actually look there?","replies":[]}]},{"poster":"Eeyore","date":"2018-07-11T23:34:36.843+0000","up_votes":3,"down_votes":2,"body":"Because Riot tosses a coin whenever they design an ability as to whether it is consistent or not with other abilities. Whether or not you can affect unseen targets is just whether or not that champion's designer felt like it.","replies":[{"poster":"Infernape","date":"2018-07-12T00:38:30.734+0000","up_votes":3,"down_votes":0,"body":"-cough- Zoe being able to recast Q while being silenced,  stunned, pacified, knocked up or in stasis -cough-","replies":[{"poster":"2Charmnot2Charm","date":"2018-07-12T02:33:01.441+0000","up_votes":1,"down_votes":0,"body":"I'm still waiting for that to be removed.","replies":[{"poster":"Infernape","date":"2018-07-12T09:09:06.925+0000","up_votes":3,"down_votes":1,"body":"It never will. It's one of those CertainlyT exclusive buffs. Like yasuo being placed as far away from a turrets range as possible.","replies":[{"poster":"remakoro","date":"2018-07-12T10:19:34.721+0000","up_votes":2,"down_votes":0,"body":"Most fucking tilting thing possible. He just runs in your face and E+Q\nCounterplay that shit. And then he is outside of turret range for some reason.\nTank first shot with his flow shield and another one with his recharged by his ult flow shield. 0 dmg taken from tower. NICE.","replies":[]}]}]}]},{"poster":"Teridax68","date":"2018-07-12T08:28:27.995+0000","up_votes":2,"down_votes":0,"body":"This is pretty much it. There are a ton of inconsistencies to the finer mechanics of many abilities, sometimes for stuff as basic as deciding whether to name some scaling \"total health\" or \"maximum health\". This sort of thing is not good for clarity, despite the latter having once been a core design pillar for Riot.","replies":[{"poster":"Infernape","date":"2018-07-12T17:34:39.735+0000","up_votes":2,"down_votes":0,"body":"Can we just make you spokesperson for the boards in terms of gameplay?","replies":[]}]}]},{"poster":"ankoanko19","date":"2018-07-11T21:00:56.657+0000","up_votes":3,"down_votes":0,"body":"Old Irelia passive lmao. How to know if someone is hiding in a bush. Its not a fun mechanic to play against.","replies":[]}]}