{"poster":"Pyrithegethon","date":"2016-04-14T07:13:42.238+0000","title":"@Meddler are the Illaoi changes coming to 6.9?","subforum":"Gameplay","up_votes":4,"down_votes":1,"body":"I remember hearing changes are before mage rework, so will it happen in 6.9?","replies":[{"poster":"Meddler","date":"2016-04-14T16:34:07.397+0000","up_votes":23,"down_votes":2,"body":"Hopefully in 6.9. What we're currently considering:\n\n* Tentacles no longer appear in FoW for enemies\n* Vessel duration cut dramatically (been testing values in the 10-15s range, down from 60s)\n* Vessel state spawns nearby tentacles much faster 3-5s instead of 10s)\n* Tentacles can spawn closer to each other if spawning from vessels\n\nI suspect we'll then need to do some follow up balance changes depending on the power impact of the above (or something like it). First thing though is getting an improved structure in place, in terms of how the Vessel state works. ","replies":[{"poster":"Meddler","date":"2016-04-14T19:07:18.768+0000","up_votes":16,"down_votes":3,"body":"Oh, couple of other things I missed, apologies:\n\n* Killing tentacles no longer allows you to clear the Vessel debuff\n* Tentacles are no longer prevented from spawning if the vessel is recalling","replies":[{"poster":"GhostOfShrimpmas","date":"2016-04-14T19:23:38.197+0000","up_votes":12,"down_votes":2,"body":"So, losing your spirit no longer means you have to fight to get it back, but instead just run around? Will you at least make her \"You're making good progress, keep going\" lines play one third and two thirds of the way through the vessel duration?\n\nThe change sounds nice mechanically, but I worry about the loss of thematics.","replies":[]},{"poster":"FirCone","date":"2016-04-14T22:03:32.392+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=L3NFw4FB,comment-id=00000005,timestamp=2016-04-14T19:07:18.768+0000)\n> * Killing tentacles no longer allows you to clear the Vessel debuff\n\nThen you need to give the victim a different counterplay option that's in line with what Gangplank did (aka fighting back through sheer willpower and strength). Otherwise her entire lore and quotes are basically nullified.","replies":[{"poster":"Narrenprinz","date":"2016-04-14T23:08:13.661+0000","up_votes":5,"down_votes":1,"body":"what else counterplay do you want after these changes? A 10-15 second vessel is the debuff you have to deal with when you get hit. You also dont have much counterplay when you let a Blitzcrank hook hit you. Counterplay for this situation is to dodge^^\n\nThematically, to survive the 15 seconds as vessel is enough challenge for me, her quotes are still pretty matching.","replies":[{"poster":"Herocoder","date":"2016-04-29T18:43:07.521+0000","up_votes":1,"down_votes":1,"body":"Counterplay for Blitzcrank Hook .. lets see .. Sivir Spellshield .. Ezreal E .. Nocturne spell shield .. Fiora W .. hmm .. whats the counterplay for vessel .. oh dont give it any? u on dope?","replies":[{"poster":"Dioskurii","date":"2016-04-30T03:44:54.109+0000","up_votes":1,"down_votes":0,"body":"Those counterplay options are only available to certain champions, though. Can you seriously call it \"counterplay\" if only certain champions have access to it? Also, Sivir Spellshield, Ezreal E, and Nocturne spellshield should all block Illaoi's vessel if you time it right. The point is to spellshield the spell itself.","replies":[]}]}]},{"poster":"RocketRelm","date":"2016-04-14T23:35:20.284+0000","up_votes":3,"down_votes":0,"body":"{{champion:43}}  \"Yeah, we definitely can't have that happen.\"","replies":[]},{"poster":"charcharmunro","date":"2016-04-22T13:16:54.953+0000","up_votes":1,"down_votes":0,"body":"I mean, you can still reduce the time your spirit is out by attacking her.","replies":[]},{"poster":"QuadraKev","date":"2016-04-15T09:32:41.826+0000","up_votes":1,"down_votes":0,"body":"You mean like dodging these slow-ass tentacles whose spawning is telegraphed","replies":[]}]},{"poster":"colmby","date":"2016-04-14T19:48:00.537+0000","up_votes":3,"down_votes":0,"body":"Hey Meddler, I know this may have been asked before, but are there any QoL changes planned for her W? I love Illaoi but the most frustrating thing for me when playing her is the W animation - it can get really clunky/buggy/slow/weird when trying to use it on a target with multiple others around, and just in general really. Thanks for the updates!","replies":[]},{"poster":"Ćougar","date":"2016-04-14T23:39:38.248+0000","up_votes":1,"down_votes":0,"body":"From what I've heard, her biggest weakness is the lack of hard CC. I think an interesting (yet difficult) mechanic to make her more viable would be a stun with the duration depending on how many tentacles hit you. 1 second for 2 tentacles, 1.5 for 2 tentacles, 2 for 3 tentacles and so on. Obviously you could change the timings and everything but I think this would make her challenging to be great with, but viable if you're only average with her. Obviously added a stun to someone's kit might mean she would need some other slight damage nerfs/adjustments but I think this could up her play rate tremendously.","replies":[{"poster":"TURBO 5OOO","date":"2016-04-15T00:10:49.824+0000","up_votes":1,"down_votes":0,"body":"That would be an overkill with her ultimate","replies":[{"poster":"Ćougar","date":"2016-04-15T01:01:11.580+0000","up_votes":1,"down_votes":0,"body":"Yes, however it is still difficult to perform outside of the ulty. And there is outplay potential (she's slow and kiteable/hard engage before she can set up for the fight) maybe shorten he stun durations to like .5 seconds for 2 tentacles? I feel like it would make her viable but not disgustingly broken","replies":[{"poster":"Zatch Nakarie","date":"2016-04-15T08:28:36.305+0000","up_votes":2,"down_votes":0,"body":"Illaois biggest weakness is that she is immobile and kiteable. Yet it really breaks her strength since she has to force people to come to her, making her a niche pick with the right teams. Having a small stun on her tentacles might help her an incredible amount. \n\nYet putting that stun on her ultimate puts even more pressure on landing it; so why not swap it to her normal tentacle smash as well. The stun would not scale with tentacles (as a good ultimate, while rare, would be devastating).","replies":[]}]}]},{"poster":"TsZ IronPhoenix","date":"2016-04-30T13:53:05.012+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cougar Fetish,realm=NA,application-id=3ErqAdtq,discussion-id=L3NFw4FB,comment-id=000000050006,timestamp=2016-04-14T23:39:38.248+0000)\n>\n> From what I&#x27;ve heard, her biggest weakness is the lack of hard CC. I think an interesting (yet difficult) mechanic to make her more viable would be a stun with the duration depending on how many tentacles hit you. 1 second for 2 tentacles, 1.5 for 2 tentacles, 2 for 3 tentacles and so on. Obviously you could change the timings and everything but I think this would make her challenging to be great with, but viable if you&#x27;re only average with her. Obviously added a stun to someone&#x27;s kit might mean she would need some other slight damage nerfs/adjustments but I think this could up her play rate tremendously.\n\nThis Sounds really interesting. For example do it like with Kennens passive. Additional Stuns have reduced duration on the target.","replies":[]}]},{"poster":"Corporate Golfer","date":"2016-04-15T05:15:05.019+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=L3NFw4FB,comment-id=00000005,timestamp=2016-04-14T19:07:18.768+0000)\n>\n> Oh, couple of other things I missed, apologies:\n> \n> * Killing tentacles no longer allows you to clear the Vessel debuff\n> * Tentacles are no longer prevented from spawning if the vessel is recalling\n\n\nIf that's the case, can the damage done to return your spirit not be based on the number of hits so champions without fast attacks have some counterplay - as the ability to remove the vessel is gone.","replies":[]},{"poster":"Twin Headed Emu","date":"2016-04-14T21:25:56.947+0000","up_votes":2,"down_votes":1,"body":"Umm, I had a comment going until a misplace backspace went back a page (RIP me), but here is just one guy's thoughts.  But basically it is the fact that the tentacles deal stupid big damage (easily close to 600 physical damage around lvl 18) and with destroying the spirit dealing ~60% of the current hp of the target.  Why not have the test of spirit actually be a challenge for Illaoi to be in.  Illaoi basically forces the target to run away to become a vessel, unless they are super tanky in which case it does not even matter.  Something like Illaoi has a spirit come out too, and if you can kill hers first, then she gets stunned or something.  Because there is almost no risk for such a punishing ability.","replies":[]}]},{"poster":"straydogsit","date":"2016-04-14T18:36:20.564+0000","up_votes":7,"down_votes":6,"body":"I seriously do not get the overall nerf. You want to change it, alright then, just don't nerf her. Her winrate and usability is alredy very limited, she's not a lane bully at all, it's just frustrating to be vessel but it is easily removable. It does not improve her gameplay, rather makes her far weaker in the laning phase.\n\n60 sec vessel state, 10 sec per tentacle spawn = around 6 tentacles\nas you are planning..\n15 sec vessel state, 5 sec spawn = 3 tentacles spawn\n\nIt's a slow skillshot, easily avoidable, 3 tentacles? really? \n\nJust think carefully on shaping her kit, don't rush anything. This champ is already super underplayer, no need to nerf it even more. One solution may be changing the speed at which every tentacle swing. This may actually sounds \"a lil bit of both, nerf and buff\", as you explained it's just a nerf.\n\nEDIT: I talk as a Illaoi player, I play her quite a lot and as ELO raise she become way and way less useful since her kit define her as an immobile tank easily kitable with no hard cc; \n\nEDIT2: just look her winrate from plat+ : http://champion.gg/statistics/#?sortBy=general.winPercent&order=descend&roleSort=Top (46%). Sure, if an unexperienced player wants to trade in her ult when Illa lands a correct E it sounds extremely powerful, but let's see in the right perspective: any player who have already played 2-3 times  against her knows how to deal with her kit and ult and most of the top meta have dash/decent mobility to just avoid her damage potential.. Nerfing her E = destroying her laning phase, and since she's not a late-game champ this means completely removing every reason to pick her at all.","replies":[{"poster":"Quepha","date":"2016-04-14T19:09:11.290+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=straydogsit,realm=EUW,application-id=3ErqAdtq,discussion-id=L3NFw4FB,comment-id=00000004,timestamp=2016-04-14T18:36:20.564+0000)\n>\n> I seriously do not get the overall nerf.\n\nIt's not a nerf. The vessel debuff spawns more tentacles over a shorter period of time. A 3s spawn timer means the enemy basically can never stop moving and recalling during the period is impossible.","replies":[{"poster":"Meddler","date":"2016-04-14T19:13:13.350+0000","up_votes":10,"down_votes":3,"body":"It might be a nerf, we'll need to look at the power impact after the changes go out and follow up with buffs/nerfs as needed. Big thing for us is getting the mechanics to the right spot, then we can adjust damage etc where appropriate. ","replies":[{"poster":"TURBO 5OOO","date":"2016-04-14T23:12:42.261+0000","up_votes":2,"down_votes":2,"body":"I do main Illaoi actually, but that will destroy her completely. Her E is so freaking important for her. The long duration is the reason why it is so much important.  DOnt make it another yorick. SHe will be completely useless","replies":[{"poster":"Narrenprinz","date":"2016-04-14T23:18:44.352+0000","up_votes":2,"down_votes":1,"body":"dude, why? In my opinion her main problem is that most champs can easily deal with the frequency of tentacle spawn and attack as vessel. With this shortened but intensified time window she and her enemies can deal way better with the vessel debuff.","replies":[{"poster":"TURBO 5OOO","date":"2016-04-15T00:07:27.800+0000","up_votes":2,"down_votes":2,"body":"Because the enemy is busy for a very long time. If i do hit with my E, i know i can farm for <at least> 30 seconds pretty safe. As long as the debuff is online, all the tentacles ry to hit her, if he comes near to my tentacles that i placed. He cant attack me for that time and if he does he is 90% dead. If they reduce the time to 10-15 seconds, he is mor busy at the very very very short duration, but can full attack easily after this. That is a drastically nerf.","replies":[{"poster":"SSJTribe","date":"2016-04-15T01:30:02.918+0000","up_votes":5,"down_votes":2,"body":"I think you highlighted exactly why this change is needed. You should never be able to farm for **30 SECONDS** pretty safely. That is absolutely ridiculous. Go play farmville if you don't want to interact with your lane opponent.","replies":[{"poster":"MIM Reathe","date":"2016-04-15T07:50:37.104+0000","up_votes":2,"down_votes":0,"body":"Cough.. Azir ... Cough","replies":[]},{"poster":"TURBO 5OOO","date":"2016-04-15T11:36:56.634+0000","up_votes":1,"down_votes":2,"body":"That is wrong, because if i miss my E (that happenes easily but the projectile speed and width. You hit with blitzcrank Q 20 times better) you are instantly forced back and can do literary nothing at that time. \n\nSecond parts is the teamfight and this is another really important one. If the debuff is in the team before the fight starts, they have instantly much more trouble, because the must avoid the lashes from that one with the debuff and your own lashes with Q and W. Your Q and W is easily avoidable. It is very slow and does just moderate damage. With the debuff it happens nt just from you so u have to watch him too. If that part is missing (most of the time i can get 2 people with that debuff before the fight start) then her strength is cut, i would say, 1/3.\n\nSo you have an EXTREMELY lane nerf and a really really big teamfight nerf. I guess that is exactly what a 45% win champ needs","replies":[{"poster":"WarlockLaw","date":"2016-04-15T15:35:06.628+0000","up_votes":1,"down_votes":0,"body":"She has huge counterplay issues with the way her E currently works during laning phase, it needed to happen one way or another. Whether or not they should have given more compensation with it is something we will only know after the change goes live, champions with the debuff are going to be spawning tentacles more frequently, especially when near already active tentacles.","replies":[]}]}]}]}]}]},{"poster":"Dlanor A","date":"2016-04-14T23:32:51.397+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=L3NFw4FB,comment-id=0000000400010000,timestamp=2016-04-14T19:13:13.350+0000)\n>\n> It might be a nerf, we&#x27;ll need to look at the power impact after the changes go out and follow up with buffs/nerfs as needed. Big thing for us is getting the mechanics to the right spot, then we can adjust damage etc where appropriate.\n\n\nHave you considered letting her have the grounded debuff in her kit somewhere? It feels like out of every champion in League, she's the one most suited to have it - whether it's on her Vessel slow, or just her W.","replies":[{"poster":"Meddler","date":"2016-04-15T01:15:34.781+0000","up_votes":1,"down_votes":1,"body":"We'd like to assess how Grounded works on Cass before considering it for other champions. Hopefully it's something we can add to a few other places certainly and Illaoi might need a bit more utility so she's not quite so raw damage or nothing. Not immediately sure if there's a good space for it on Illaoi's kit. Wouldn't want to put it on the W, while Grounded is weaker than a Silence it's still not something we'd want being applied as frequently as that would allow. E already has a lot going on and you need to be able to dash out of R counterplay wise.","replies":[{"poster":"Meep Man","date":"2016-04-22T15:44:15.648+0000","up_votes":2,"down_votes":0,"body":"Could be put on her Q. It kind of slams them into the ground, so it's not exactly not thematic.","replies":[]},{"poster":"LankPants","date":"2016-04-15T01:22:23.439+0000","up_votes":2,"down_votes":0,"body":"I'd say grounded should be considered on par with an ~50% slow. When you look at it grounded isn't a global status effect. I don't give a fuck if I get grounded as Ashe, it just doesn't effect me.\n\nI really think into the future grounded should be treated more at the level of a slow than a harder CC like a silence. Adding it to items and more kits in general could really help add options into the game to actually deal with mobility, which is something that's been missing from the game for the last 3 or 4 years.","replies":[{"poster":"5050BS","date":"2016-04-15T01:24:52.023+0000","up_votes":2,"down_votes":0,"body":"Im not sure what \"Grounded\" does but it sounds like it stops Dashed/TP ect\n\nAnything to counter the stupid amounts of mobility for those that dont is good.","replies":[{"poster":"LankPants","date":"2016-04-15T01:27:12.707+0000","up_votes":1,"down_votes":0,"body":"You can't cast mobility moves while under its effect, you might still be able to TP, I'm not sure since it's not came out on the PBE yet. It deffinitly disables things like Kass ult, Lee W, Flash ect. though.","replies":[{"poster":"TallyZrg","date":"2016-04-15T16:30:05.867+0000","up_votes":1,"down_votes":0,"body":"It stops TP too, as well as blink. Basically anything that could move your champion gets stopped unless affected by an outside source (e.g Kalista Ult)\n\nThe grounded effect from Cassiopeia's MYMU was on the PBE accidentally for a weekend and this is what repitoiree said.","replies":[]}]}]}]},{"poster":"WarlockLaw","date":"2016-04-15T15:30:36.148+0000","up_votes":1,"down_votes":0,"body":"Imo grounded would be too much for Illaoi as she needs to leave her opponents the option to get away. She's very strong when fighting on her terms, we don't need her to also tell you that you can't run away.\n\nThat said I hope you find grounded to be successful and consider adding it to more champions as you buff/update them. Ever since I started playing Smite and found out about their cc called Cripple (their name for Grounded) I've been wanting League to add it to counter highly mobile champions , though I haven't been particularly vocal about it.","replies":[]},{"poster":"Solarus17","date":"2016-04-15T15:13:20.045+0000","up_votes":1,"down_votes":0,"body":"Can you take a look at aatrox like actually play him, test him against other champs. Because as an aatrox main 680k mastery points with him, and finished diamond 4 only playing aatrox. Ithe feels very unrewarding because he is so underpowered. The champ is fun the mechanics are fun the passive is fun but when you lose lane and scale really bad, there's an issue you have no strengths, give him at least early game strength, or make it easier to scale. The reason why he's so dependant on snowballing, is because HE SCALES HORRIBLY, so he needs to snowball in order to do well. And he doesn't snowball any harder than a kathy or zed or Reventon or tryndamere or jax or irelia","replies":[]},{"poster":"warpenguin555","date":"2016-04-15T15:05:42.494+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=L3NFw4FB,comment-id=000000040001000000030001,timestamp=2016-04-15T01:15:34.781+0000)\n>\n> We&#x27;d like to assess how Grounded works on Cass before considering it for other champions. Hopefully it&#x27;s something we can add to a few other places certainly and Illaoi might need a bit more utility so she&#x27;s not quite so raw damage or nothing. Not immediately sure if there&#x27;s a good space for it on Illaoi&#x27;s kit. Wouldn&#x27;t want to put it on the W, while Grounded is weaker than a Silence it&#x27;s still not something we&#x27;d want being applied as frequently as that would allow. E already has a lot going on and you need to be able to dash out of R counterplay wise.\n\nOr just walk away from it. Like everyone does","replies":[]},{"poster":"Azuran","date":"2016-04-15T12:18:14.561+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=L3NFw4FB,comment-id=000000040001000000030001,timestamp=2016-04-15T01:15:34.781+0000)\n>\n> **allow. E** already has a lot going on\n\nPhreak is that you?","replies":[]},{"poster":"toymachine","date":"2016-04-15T07:24:32.905+0000","up_votes":1,"down_votes":0,"body":"Is it possible that her tentacles heal could work against monsters (NOT minions)? Then she could prolly be played in the jungle as well?","replies":[{"poster":"TURBO 5OOO","date":"2016-04-15T11:39:09.381+0000","up_votes":1,"down_votes":0,"body":"That wouldnt help much. She does not enough dmg for the jungle. She is not tanky and has no dmg at the early lvls.","replies":[{"poster":"toymachine","date":"2016-04-15T12:18:02.176+0000","up_votes":1,"down_votes":0,"body":"They could easily change Q to deal 130% damage to jungle monsters as well.\n\nW healing working vs jungle monsters and Q dealing 130% damage to jungle monsters would make Illaoi a viable jungler while not affecting her laning performance.","replies":[]}]}]}]}]}]}]},{"poster":"Ashenvall","date":"2016-04-14T19:03:48.007+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=straydogsit,realm=EUW,application-id=3ErqAdtq,discussion-id=L3NFw4FB,comment-id=00000004,timestamp=2016-04-14T18:36:20.564+0000)\n>\n> I seriously do not get the overall nerf. You want to change it, alright then, just don&#x27;t nerf her. Her winrate and usability is alredy very limited, she&#x27;s not a lane bully at all, it&#x27;s just frustrating to be vessel but it is easily removable. It does not improve her gameplay, rather makes her far weaker in the laning phase.\n> \n> 60 sec vessel state, 10 sec per tentacle spawn = around 6 tentacles\n> as you are planning..\n> 15 sec vessel state, 5 sec spawn = 3 tentacles spawn\n> \n> It&#x27;s a slow skillshot, easily avoidable, 3 tentacles? really? \n> \n> Just think carefully on shaping her kit, don&#x27;t rush anything. This champ is already super underplayer, no need to nerf it even more. One solution may be changing the speed at which every tentacle swing. This may actually sounds &quot;a lil bit of both, nerf and buff&quot;, as you explained it&#x27;s just a nerf.\n> \n> EDIT: I talk as a Illaoi player, I play her quite a lot and as ELO raise she become way and way less useful since her kit define her as an immobile tank easily kitable with no hard cc; \n> \n> EDIT2: just look her winrate from plat+ : http://champion.gg/statistics/#?sortBy=general.winPercent&amp;order=descend&amp;roleSort=Top (46%). Sure, if an unexperienced player wants to trade in her ult when Illa lands a correct E it sounds extremely powerful, but let&#x27;s see in the right perspective: any player who have already played 2-3 times  against her knows how to deal with her kit and ult and most of the top meta have dash/decent mobility to just avoid her damage potential.. Nerfing her E = destroying her laning phase, and since she&#x27;s not a late-game champ this means completely removing every reason to pick her at all.\n\nI play very often with her and I agree without this ability she is weak","replies":[]},{"poster":"5050BS","date":"2016-04-14T19:31:35.849+0000","up_votes":4,"down_votes":1,"body":"Her Ult needs to give her a shield or heal her the 5% missing HP based on how many enemies she hits.\n\nAn Illaoi ult takes a full 3s before any damage is done to enemies and it is easy to CC/Kill her in those 3s.\n\nUlt Combo is (E,R,W) each one of those takes .5-.75s animation and tentacles is .25-.5 animation\n\nBy the time she gets to using the W ( where all the damage comes from) you have had 2s+ to react and MANY and I mean MANY champs can kill her in that time or CC or get away.  \n\nIn a team fight if the enemy team has ANY hard CC she is dead before her ult can do any Tentacle damage.","replies":[{"poster":"straydogsit","date":"2016-04-14T20:06:21.167+0000","up_votes":3,"down_votes":0,"body":"This is exactly what I meant....","replies":[]}]}]},{"poster":"TotalJerk","date":"2016-04-14T16:37:19.917+0000","up_votes":6,"down_votes":1,"body":"Thank god for the vessel duration cut. Being forced to make the decision between being a walking minefield for your team or completely removing yourself from a fight longer than any CC in the game could was extremely anti fun. Plus sometimes it feels like Illaoi's E could potentially remove you from lane early game longer than forcing a back.","replies":[{"poster":"straydogsit","date":"2016-04-14T18:47:13.546+0000","up_votes":2,"down_votes":1,"body":"It's a superslow skillshot.. you can easily juke E...","replies":[]}]},{"poster":"thresholden","date":"2016-04-14T20:44:38.458+0000","up_votes":3,"down_votes":0,"body":"Hey, Meddler. I just tested the damage on Illaoi tentacles when 2 tentacles hit the same target at once. It seems that the second tentacle deals 50% reduced damage to the target. This is not stated in the tooltip or wiki. Is this intentional? If it isn't, this would be a huge buff to Illaoi if you fixed it: https://www.reddit.com/r/Illaoi/comments/4esrt9/found_a_post_claiming_multiple_tentacles_do/","replies":[]},{"poster":"Herocoder","date":"2016-04-29T19:12:34.977+0000","up_votes":2,"down_votes":1,"body":"Dear Sir, \n\nI really want to take it from the top again \n\nthe current issues with illaoi are:\n\n1) Illaoi is really powerful in teamfights and lane when well-farmed and can be a total bully\n2) Illaoi still is not really viable with her 45% win ratio and not really a favourite champ\n3) 60s for the vessel is really long and annoying given the time of tentacle spawn to be free of being a vessel\n\n1) Her ult and her kit makes this part of the champ really hard to avoid - I do not see a way of solving this issue unless reducing the base dmg of her tentacles. So far she is all about stacking hp and surviving enough in teamfights with heals from the tentacles.\n\n2) Her lack of hard CC is an issue making her less viable. But given her raw damage it will be overkill if it was a straightforward hard CC. \n\nI have a suggestion to make here: Make her Q stun / root the enemy champ if he/she is already a vessel. Makes more incentive to kill the spirit and landing your E as well as rewarding when done right. The killing of the three tentacles as counterplay is pretty necessary here as well as makes opportunities for interesting plays when trying to do so.\n\n3) vesssel state to 15s is still an eternity if I manage to survive an all-in fight with Illaoi and ending up as a vessel and cannot back with the very low hp I managed to get into my tower safety. So maybe the backporting spawning might be unfair. but if tentacle base dmg is reduced .. and the time is 12s .. so maybe yeah.","replies":[]}]}]}