{"poster":"Maddin0078","date":"2017-02-01T09:20:53.925+0000","title":"[Bronze-Silver] Top/Jungle sucht DouQ Mates","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey,\r\nmein Name ist Martin und ich suche Mitspieler, mit denen ich zusammen DouQ spielen kann. Ich habe S6 wenig gespielt und war Silver, S5 Gold. Ich spiele Main Top, Second Jungleund werde zur neuen Season mich auf einen kleinen Championpool beschr&auml;nken, wobei ich Tanks mit CC bevorzuge (Poppy, Seju, Voli, Cho, Sion). Ich suche vor allem Mitspieler, da es mir hilft mich auf das Spiel zu konzentrieren. Kommunikation sollte daher &uuml;ber nen VoiceChat ablaufen (Skype, TS etc.).\r\nDa ich am liebsten Top/Junglespiele suche ich bevorzugt Leute die entweder Top oder Mid mainen, weil Synergie und so.\r\nZiel dieses Posts soll es sein ein paar Leute auf seiner Friendlist zu haben mit denen man spontan ne Runde zocken kann, da ich immer recht spontan und auch nicht &uuml;berm&auml;&szlig;ig viel zocke.\r\nKurz ein paar Infos zu mir: Ich bin 32 und spiele LoL nun seit knapp 2 Jahren, wobei jetzt erst wieder etwas aktiver.\r\nAlso meldet euch.\r\nBeste Gr&uuml;&szlig;e\r\nMartin aka Maddin078","replies":[{"poster":"NGC Polyxena","date":"2017-02-01T10:07:30.895+0000","up_votes":1,"down_votes":0,"body":"Hey Martin,\n\nich würde dir gerne anbieten, dir Mal die ü18 Community \"Nerds Go Casual\" anzuschauen: [♣ ƝЄƦƊƧ ƓƠ ƇƛƧƲƛԼ ♣ Ü18 multigaming Community lädt zum Zocken ein ♣](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/eERAnrLZ-oe-i-a-l-oe-a18-multigaming-community-laadt-zum-zocken-ein-oe)\n\nBei uns findest du jeden Abend genug Mitstreiter für ein paar gemütliche Runden LoL. Egal ob Unranked oder Dia, Student oder Schichtarbeiter, Halb-Nerd oder Voll-Nerd, jeder ist willkommen der sich zu benehmen weiß und respektvoll mit seinen Mitmenschen umgeht.\n\nEs würde mich sehr freuen, wenn du das Mal durch den Kopf gehen lässt und wünsche dir noch viel Spaß beim Zocken!\n\n\nLiebe Grüße,\nP0lyxena | Julia _(O = Null) _","replies":[]}]}