{"poster":"Tryhardeando","date":"2016-03-06T02:40:57.498+0000","title":"Merecemos la posibilidad desban !!!","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":32,"body":"Saludos !! Bueno soy una de las miles de personas Que esta arrepentida por tener mal uso verbal.\r\n                          Somos personas Nos equivocamos cada persona tiene diferentes ritmo  de aprender  Muchas personas juegan Por n motivos\r\nEncuentro Que tambi&eacute;n deben entender Los malos d&iacute;as ratos de las personas  El sacrificio de tiempo dinero invertido en el juego Duele mucho perder algo tan f&aacute;cilmente. \r\n        Solicito Obtener una posibilidad de habilitar la cuenta nuevamente, Ahora si ya se encuentra una posibilidad  H&aacute;ganlo saber.\r\n\r\n Pensamiento personal :\r\n\r\n1.- encuentro Que los ban No deber&iacute;an ser acumulables .\r\n2.- En vez de optar con un ban Permanente   Podr&iacute;an Mirar opciones de desabilitar La  cuenta por mas tiempo  Progresivo Ej: 14 dias ,  28 dias, 1 mes 14 dias, 2 meses , 3 meses.....6 meses.... 1 a&ntilde;o---&gt; igual lleva su mismo fin Que permanente y es mas viable,Evitaran perder gente un fin de cosas + .   \r\n3.- Ban permanente deber&iacute;a ser  Para casos ya absurdos Ej: Insultar foro , elo booster ect. \r\n \r\n\r\n                                                                                   Gracias por leer !!!!!!!!!!   \r\nPD: Quiero una posibilidad de habilitar mi cuenta.","replies":[{"poster":"Condor","date":"2016-03-06T02:46:11.584+0000","up_votes":10,"down_votes":0,"body":"Son varias oportunidades las que te dan, no porque flamees un tiempo vas directo al van permanente......\nademás si estás arrepentido perfectamente puedes empezar de 0 y demostrarlo.","replies":[{"poster":"Tryhardeando","date":"2016-03-06T02:55:26.179+0000","up_votes":1,"down_votes":12,"body":"Es cosa de pensar un poco tiempo dinero perdido no muchos volverán a jugar de 0.","replies":[{"poster":"YanXi","date":"2016-03-06T03:01:06.518+0000","up_votes":9,"down_votes":0,"body":"Y debieron pensarlo cuando dieron las advertencia.\n\n-Saludos","replies":[]},{"poster":"Selah","date":"2016-03-06T04:41:03.740+0000","up_votes":1,"down_votes":0,"body":"Para que aprendas y dejes de flamear. Mas si a Riot le importara el dinero que una persona puede darle.","replies":[]}]}]},{"poster":"AresC","date":"2016-03-06T02:57:08.597+0000","up_votes":5,"down_votes":0,"body":"¿Crees que el _eloboosting_ es más grave que la toxicidad? :P {{summoner:31}} ","replies":[{"poster":"Tryhardeando","date":"2016-03-06T03:04:26.608+0000","up_votes":1,"down_votes":9,"body":"Obvio Que es mucho mas grave no Es  de pensar mucho.  \nHace perder tiempo  a muchas personas Hace rabiar  hace bajar de división  se lleva un conjunto de gente  ect...","replies":[{"poster":"AresC","date":"2016-03-06T03:08:51.180+0000","up_votes":11,"down_votes":0,"body":"¿Y qué sobre los tóxicos? Sinceramente prefiero tener en mi equipo alguien que no juega a mi nivel a tener alguien que insulta, trata mal y desprecia a los otros, afectando el juego de **todos** los integrantes del equipo.","replies":[]},{"poster":"panchote15","date":"2016-03-06T03:10:47.345+0000","up_votes":6,"down_votes":0,"body":"bueno mejor flameo a una persona como juega antes de ayudarlo que soy un genio, así le bajara el animo moral y jugara peor, primero piensa las consecuencias de flamear antes de ayudar, que flameando le bajas la moral a uno e imagínate si es un niño ay si ya estas perdido porque son mas sensibles ","replies":[{"poster":"Tryhardeando","date":"2016-03-06T03:23:00.567+0000","up_votes":1,"down_votes":9,"body":"Niños de hoy en día te mandan a la punta del cerro y son los que mas trolean sensibles ? D: me topo con un niño me sube y baja en ranked. le dices algo y trolea.","replies":[{"poster":"panchote15","date":"2016-03-06T03:26:33.265+0000","up_votes":3,"down_votes":0,"body":"tengo 16 años y juego con mi primo de 12 años y sus amigos e imagínate no trolean porque nadie les flamea nada piensa que personas se suicidan porque lo molestan imagínate en un juego que puede hartas opciones si te flamean","replies":[]}]}]}]}]},{"poster":"Yrox the Third","date":"2016-03-06T02:42:16.150+0000","up_votes":6,"down_votes":0,"body":"Oportunidades tuviste, el ban permanente es la ultima opcion.\nEste es un castigo por tus acciones, no un regalo para motivarte a seguir.","replies":[{"poster":"Tryhardeando","date":"2016-03-06T02:59:00.469+0000","up_votes":1,"down_votes":8,"body":"Esta bien un castigo por mis acciones pero no es criterio para ser permanente Al final en este juego aparece cada personaje cada elo bosteado cada persona que te  Trolea un fin de cosas mas que te  desafía.  No es grato  tampoco.","replies":[{"poster":"Yrox the Third","date":"2016-03-06T03:02:32.381+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Tryhardeando,realm=LAS,application-id=PJAKt7ph,discussion-id=mLUsEF2M,comment-id=00000000,timestamp=2016-03-06T02:59:00.469+0000)\n>\n> Esta bien un castigo por mis acciones pero no es criterio para ser permanente Al final en este juego aparece cada personaje cada elo bosteado cada persona que te  Trolea un fin de cosas mas que te  desafía.  No es grato  tampoco.\n\nObvio que no es grato, ES UN CASTIGO, ademas en algun punto todos los que se lo merecen son castigados.\nOportunidades tuviste y varias, de hecho, mas de lo que alguien se merece.","replies":[]}]}]},{"poster":"oscuro1914","date":"2016-03-06T03:12:38.061+0000","up_votes":1,"down_votes":8,"body":"Perro te encuentro toda la razón , me acaban de banear permanentemente y se que pucha últimamente he flameado mucho , pero es que da mucha rabia , la prioridad del ban debería ser para los troll , afk y eloboosteados. .. es mucho peor un troll que te hace perder a propósito que un flamer ... flamear esta bien , yo con esto ya aprendí mi lección y me gustara una última oportunidad , por que de verdad me gusta league of legends y juego de la s3 y más encima he invertido bastante dinero en esto .... se que esta mal flamear y estoy arrepentido de verdad .... oscuro1914 saludosss","replies":[{"poster":"Tryhardeando","date":"2016-03-06T03:19:59.384+0000","up_votes":1,"down_votes":5,"body":"Un flamer te flamea una partida cada 10  a 20 juegos con razones tontas pero con razones. un troll te trolea siempre sin razón   porque no le interesa el juego solo reir .  un elo booster  se lleva 20 30 tipos   en todas sus ranked de perdidas sin tomar ninguna sanción Que yo sepa porque  le dan prioridad  los flamer y des conexión.","replies":[{"poster":"Selah","date":"2016-03-06T04:43:09.579+0000","up_votes":6,"down_votes":0,"body":"Si flameas, mereces el ban permanente, como todos los que mencionaste.","replies":[]}]},{"poster":"panchote15","date":"2016-03-06T03:16:23.712+0000","up_votes":3,"down_votes":0,"body":"bueno mejor flameo a una persona como juega antes de ayudarlo que soy un genio, así le bajara el animo moral y jugara peor, primero piensa las consecuencias de flamear antes de ayudar, que flameando le bajas la moral a uno e imagínate si es un niño ay si ya estas perdido porque son mas sensibles. es mucho peor un flamer de echo un flamer puede provocar que las personas se enojen y les baja la moral que piensan hasta salirse del juego para dejar de leer comentarios basuras insultando porque no los pueden ayudar. De echo la mayoría de las provocaciones de trolear e irse afk es por los flamers, por culpa de flamers me he preguntado porque sigo jugando lol con una comunidad así  ","replies":[]},{"poster":"The Fall of Troy","date":"2016-03-06T05:23:49.772+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=oscuro1914,realm=LAS,application-id=PJAKt7ph,discussion-id=mLUsEF2M,comment-id=0004,timestamp=2016-03-06T03:12:38.061+0000)\n>\n> Perro te encuentro toda la razón , me acaban de banear permanentemente y se que pucha últimamente he flameado mucho , pero es que da mucha rabia , la prioridad del ban debería ser para los troll , afk y eloboosteados. .. es mucho peor un troll que te hace perder a propósito que un flamer ... flamear esta bien , yo con esto ya aprendí mi lección y me gustara una última oportunidad , por que de verdad me gusta league of legends y juego de la s3 y más encima he invertido bastante dinero en esto .... se que esta mal flamear y estoy arrepentido de verdad .... oscuro1914 saludosss\n\naaaaaaaaaaay por el amor de diooooooooos no te cabe en la cabeza? flameaste como si no hubiera un mañana y shiot no tuvo otra que banearte, vale madres si inviertes muchiiiiiiisimo dinero o juegas desde que a alguien se le ocurrio siquiera el nombre del juego, PERMABAN es PERMABAN y punto y crees que flamear esta bien? pooooooooooor diooooos ste men, los toxicos son flamers trolls y darle prioridad a los trolls afk y bosteados no tiene ningun sentido y si te gustara el juego no hubieras flameado hasta el permaban, a llorar a la iglesia mijo","replies":[]}]},{"poster":"PaawN ","date":"2016-03-06T13:23:00.918+0000","up_votes":3,"down_votes":0,"body":"Ver que le banearon permanentemente la cuenta a un flamer me alegra el dia espero que le sirva de ejemplo a esas miles de personas toxicas de LAS\n\n\nSuerte en la vuelta al lvl 1 Maquinola !","replies":[]},{"poster":"The Fall of Troy","date":"2016-03-06T05:27:18.718+0000","up_votes":3,"down_votes":0,"body":"quieres recuperar tu cuenta? para seguir flameando? arbol que crece torcido nunca se endereza y peor es con un flamer como tu que llego al punto de permaban, la verdad me dan mucha risa gente como tu llorando en el foro por sus cuentas perdidas","replies":[]},{"poster":"EzrealSupportOP","date":"2016-03-06T04:39:51.140+0000","up_votes":3,"down_votes":0,"body":"Ahorrate la verguenza, si estas permabaneado es porque te lo mereces, tuviste tus oportunidades y las desaprovechaste.","replies":[]},{"poster":"Warshen","date":"2016-03-06T04:27:02.025+0000","up_votes":3,"down_votes":0,"body":"¿Y que te hace pensar que mereces otra oportunidad?\nAunque de hecho ya te dieron, y no una, sino demasiadas.","replies":[]},{"poster":"Seraus Leunamme","date":"2016-03-06T04:25:12.366+0000","up_votes":3,"down_votes":0,"body":"Las reglas son bien claras, si no te gusta seguirlas, aguantate cuando te caiga la ley.\n\n\"Don't do the crime if you can't do the time.\"","replies":[]},{"poster":"Mazer Rakham","date":"2016-03-06T04:01:03.873+0000","up_votes":3,"down_votes":0,"body":"jajajaj si fueran ban de un año estarían quejándose igual y no aprenderían. Así es la vida. No te gustan las reglas y las rompes porque sí? a llorar a la iglesia querido. Oportunidades se te dieron. -no las supiste aprovechar? Lola.","replies":[]},{"poster":"AuroraExecution","date":"2016-03-06T03:51:40.780+0000","up_votes":3,"down_votes":0,"body":"Que bueno que te banearon. La comunidad esta feliz por sacarse de encima a gente como vos","replies":[]},{"poster":"Rebkans","date":"2016-03-06T03:08:10.959+0000","up_votes":3,"down_votes":0,"body":"Te dieron varias advertencias y oportunidades, ademas te dan castigos temporales como el ban de 14 dias, donde tenes tiempo de sobra para recapacitar y aprender a comportarte bien.\nEl ban permanente es un caso extremo para la gente que ignora lo mencionado anteriormente.\nYa no hay vuelta atras.","replies":[{"poster":"Tryhardeando","date":"2016-03-06T03:14:54.172+0000","up_votes":1,"down_votes":6,"body":"Varias advertencias  de chat de restricción  si , Ban 14 dia  si no me equiboco fueron 2   Un ban de 14 dias x conexión 1 por flamer  el 3 fue  al pedo por insultar  un troll elo boster  ni siquiera escribí mucho tampoco....","replies":[{"poster":"dinamoooo","date":"2016-03-06T03:26:33.491+0000","up_votes":3,"down_votes":0,"body":"En otras palabras , caundo kabe kabe , a llorar a la iglesia","replies":[]},{"poster":"The Fall of Troy","date":"2016-03-06T05:25:46.526+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Tryhardeando,realm=LAS,application-id=PJAKt7ph,discussion-id=mLUsEF2M,comment-id=00030000,timestamp=2016-03-06T03:14:54.172+0000)\n>\n> Varias advertencias  de chat de restricción  si , Ban 14 dia  si no me equiboco fueron 2   Un ban de 14 dias x conexión 1 por flamer  el 3 fue  al pedo por insultar  un troll elo boster  ni siquiera escribí mucho tampoco....\n\nahi la tienes papu, flamear nunca esta bien aunque estes ultra hiper mega enojado, te lo aguantas y si no dices algo que sea importante como para ganar la partida actual, entonces cierra la boca","replies":[]}]}]},{"poster":"Zabivaka","date":"2016-03-07T01:56:41.756+0000","up_votes":2,"down_votes":0,"body":"+1 Si quieren que también permabaneen las cuentas del foro para no ver más posts como estos.\nMás que nada para que los permaneados se queden con un poquito de dignidad porque es muy gracioso ver como lloran por las cuentas.","replies":[]},{"poster":"Shikuh","date":"2016-03-06T18:55:00.263+0000","up_votes":2,"down_votes":0,"body":"¿Cuantas veces es necesario que seas baneado para que aprendas?  No te molestes en pedir tu cuenta, tus suspenciones anteriores eran para que reflexionaras sobre tu comportamiento. El permaban es consecuencia de que no aprendiste nada y el server ya no puede aguantarte mas.","replies":[]},{"poster":"JACKY FANBOY","date":"2016-03-06T04:13:57.365+0000","up_votes":2,"down_votes":0,"body":"y en los bans anteriors que te dieron no aprendiste nada??\nsi dieran la opcion de habilitar la cuenta nuevamente seguirias flameando porque sabes que te la devolveran asi que no tiene sentido\n\nPD: es mucho mejor un eloobosteado que un flamer","replies":[]},{"poster":"Exit","date":"2016-03-07T02:09:07.699+0000","up_votes":1,"down_votes":0,"body":"Rekt","replies":[]}]}