{"poster":"MyWaifuRem","date":"2019-10-19T22:08:15.586+0000","title":"Matchmaking stark fragwürdig","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Hallo,\r\nich habe ein interessantes Game gehabt. Ich war in der Promo zu Gold 2 und trotzdem hätte ich, wenn ich es gesehen hätte, das Spiel gedodged. Das wär mein zweiter Loose aber das wär egal gewesen. Ich möchte betonen das niemand diesen Spieler geblamed hat oder toxic zu ihm war. Zu seiner Person wurde nur die Aussage gemacht Silber 4 mit 19% Winrate und ob er wirklich Silber ist.\r\n\r\nIch habe also in einem Promo Game zu Gold 2 einen Silber 4 Spieler mit einer 19% WR gehabt. Im Laufe des Spiels habe ich persönlich, auf Grund dessen was er geschrieben hat, die Vermutung er ist ein Troll. Es fing an mit Sätzen, ohne das etwas geschrieben wurde, \"u guys are so disgusting\", dann habe ich geschrieben \"nobody did something\", \" sie darauf \"yes ur majesty u so much better then me all my fault\" und ja, irgendwie ging das dann so das restliche game so weiter. \r\n\r\nWie kann es aber sein, ich habe nachgeschaut, dass sie ohne Premade in ein Gold Spiel kommt? \r\n\r\nIch möchte an dieser Stelle erwähnen sollte dieser Spieler kein Troll sein etc. ich will nicht ihn dafür blamen, dass er in ein Game kommt wo die Gegner offensichtlich einfach besser sind und er deswegen nicht klar kommt. Auch wenn wir das Game verloren hätten, meine Leistung war auch nicht so viel besser in dem Game aber das ist etwas anderes. Ich ärger mich in solchen Momentan dann aber schon etwas über das Matchmaking, dass hier einen Fehler gemacht hat (Riot macht sowas ja nicht mit absicht).\r\n\r\nHat jemand ähnliche Erfahrungen gemacht? Passiert sowas öfter, auch in anderen Elos?","replies":[{"poster":"Rumcoca","date":"2019-10-19T22:24:23.104+0000","up_votes":3,"down_votes":0,"body":"Besagter Spieler war Silber in Flex und wurde mit dir gematched, weil er letzte Season Gold war und sich gerade in den Placements befindet.\n\nFlex != SoloQ, die Silberelo im Flex wird überhaupt nicht beachtet wenn du ein SoloQ-Spiel suchst.","replies":[]},{"poster":"Aesto","date":"2019-10-22T22:22:00.922+0000","up_votes":1,"down_votes":0,"body":"Ich spiele fast nur ARAMS, habe mal ein ranked gemacht und wurde gegen Diamonds gematched….ist zugegeben aber auch schon 2 Seasons her.  Dennoch sagt es mir, dass etwas mit dem Matchmaking-System überhaupt nicht stimmt.","replies":[]},{"poster":"CzReLoaded","date":"2019-10-21T11:52:06.905+0000","up_votes":1,"down_votes":0,"body":"Jetzt gerade, zu Ende der Season ist meist alles durcheinander gewürfelt, bei mir ist es auch normal, dass ich als Platin Spieler der kurz vor seiner nächsten Promo steht mit den Silberlegenden von Gott belohnt wird, entweder es sind Smurfs oder Reinfälle. Irgendwann muss man isch damit abfinden, was nicht bedeutet, dass es einen einfach stört und demotiviert.","replies":[]},{"poster":"4EsDeath4","date":"2019-10-19T23:09:41.836+0000","up_votes":1,"down_votes":0,"body":"So wie der Silberspieler fühle ich mich zurzeit leider auch.\nIch habe vor einigen Wochen angefangen LoL zu spielen, bin auf lvl 30 gekommen und habe ranked gespielt.\nLaut Leagueofgraphs sind meine Gegner durchschnittlich bronze 1. Macht mir nicht viel aus, habe nicht erwartet direkt Platin zu sein.\nAlso gehe ich ins Ranked, und was sehe ich? Richtig, der niedriegste in der Runde is Silber 1, der höchste Gold 2.\nMeine Vorübergehende Elo war danach Bronze 1 70 LP.\nAber auch im zweiten Match wurde ich gegen Golds gematched.\nInwiefern ist das fair?! \nIch habe zwar nicht komplett reinge-intet, aber das macht doch keinen Sinn einen Bronze-Spieler gegen Gold-spieler zu matchen.\n\nWas hat Riot denn erwartet? Das ich gegen Leute mit mehr Gameknowledge und Erfahrung hardcarry oder was?","replies":[]}]}