{"poster":"arqueozoología","date":"2016-10-04T01:24:25.481+0000","title":"Rage Quit, ¿Qué hacer al respecto?","subforum":"Comportamiento del jugador","embed":{"description":"Captured with Lightshot","url":"http://prntscr.com/cpizal","image":"http://image.prntscr.com/image/464ad9e240dc438194b686eda5cd34d1.png"},"up_votes":2,"down_votes":0,"body":"Acabo de terminar una clasificatoria en la cual mi mid (Talon) luego de morir un par de veces comenz&oacute; a molestarse con todo mundo, al punto de decir &quot;GG partida&quot; al minuto 8-10. En ese momento la diferencia de asesinatos/torres/oro no era mucha (solo Talon tenia muertes, y un par en bot) pero el tipo sigui&oacute; y sigui&oacute; con su actitud, hasta el punto de amenazar con estar afk durante el resto del juego... &iquest;Qu&eacute; sucedi&oacute; despu&eacute;s? Aproximadamente en el minuto 14 Talon dio las gracias, escribi&oacute; &quot;/all Suerte&quot; y nos dese&oacute; buenas noches, luego se desconect&oacute;. \r\n\r\n&iquest;Qu&eacute; puedo hacer en casos as&iacute;? &iquest;C&oacute;mo puedo evitar que un aliado se desconecte? \r\n\r\nPD: Mando un screenshot sobre los resultados de la partida.\r\n\r\nSuerte a todos en sus Ranks, se despide NaKKa c:","replies":[{"poster":"Gretta Thunberg","date":"2016-10-04T01:38:10.249+0000","up_votes":3,"down_votes":1,"body":"no sabes cual es el problema? rito no hace nada tu pude ignorarlo y todo pero este tipo va a seguir haciendoloc rito deberia de cancelarle el ip a la primera, seria la unica solucion por que si le banneas la cuenta se crean otra pero la mentalidad no cambia al final solo arruina la exp de otros jugadores","replies":[]},{"poster":"Hell Darking","date":"2016-10-04T02:35:45.848+0000","up_votes":3,"down_votes":2,"body":"nada, que vas a hacer? reportar? ahora mismo te banearan del foro por publicar nicks de otros jugadores.. \nhace como yo que hace tiempo que ya apenas comienza la partida pngo muteall\nel sistema de reportes no funciona y hay que admitirlo (no faltaran los que digan que si funciona, porque son casos sacados con pinzas y/o contados con los dedos de la mano)","replies":[]},{"poster":"martincarp","date":"2016-10-04T01:32:08.231+0000","up_votes":2,"down_votes":1,"body":"Ignorarlo.\nUno al escribirle a una persona que está en un estado tóxico o de negatividad extremo solo puede generar algo bueno o algo malo, blanco o negro, no hay término medio. Así que si no quieres experimentar psicología barata en plena clasificatoria es mejor directamente no escribir nada, ya que cada vez que presiones Enter te estás arriesgando a que digas algo que moleste aún más al jugador.\nEn cambio si sigues jugando, y las cosas salen bien, sigues enfocado y concentrado, el invocador verá por su cuenta que su top laner va 3/0 y está presionando una torre de grado 2 al minuto 15, o que abajo el ADC le saca una ventaja de 30 súbditos al rival más un dragón a favor. En cuanto vea que la partida sigue su curso y no está perdida empezará a calmarse y dar todo de si para mejorar su juego (obviamente en el mejor de los casos).\nY si nada de eso sucede entonces la partida se pierde, pero al menos lo intentaste.","replies":[]},{"poster":"TheSystruction","date":"2016-10-06T00:39:33.570+0000","up_votes":1,"down_votes":0,"body":"meeee, la próxima ranked a jugar y a intentar ganar, listo, hoy un rumble chileno se re tilteo poque yo iba 1/7 con zyra suport xD, me insultaba hasta por los codos, sabes que le respondi?: primero, a mi háblame bien, con propiedad. Digo puta el wn  y algo mas, y no volvió a escribir , al menos no a mi{{sticker:slayer-jinx-wink}} , yo quede con 14lp de 30 que tenia, peor contando que gane mi promo con zyra support(siendo main  adc), me siento feliz por hoy, fue un lindo dia, de a poco se va aprendiendo uno a acostumbrar xD. Todavía falta un mes, hay tiempo para llegar a por esa skin {{champion:57}}  xD, con paciencia se aprende.","replies":[]},{"poster":"Reztav","date":"2016-10-04T04:13:20.621+0000","up_votes":1,"down_votes":0,"body":"Recién me ocurrió algo parecido. En promo para ascender a Oro, un vladimir top lo mataron 3 veces y luego dijo que se iba y se fue afk. Perdimos la partida. Igual se pide a los demás que lo reporten. Ya es la segunda vez que en promo salen trolls/afk/flamers... Sólo se puede reportar a quien tiene un mal comportamiento. Con suerte te llega un anuncio que ha sido sancionado ese jugador... pero hasta allí. \n\nHay que inventar un sistema de sanciones (o prevención) diferente. Los trollers/afkers/flamers arruinan por completo la experiencia del juego. \n\nAhora, Por qué es ilegal publicar nombres de invocadoreS?. Ojala se pueda poner en publico a todos los trolles para que los bloqueen y no jueguen con ellos.","replies":[{"poster":"martincarp","date":"2016-10-04T04:42:10.462+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Reztav,realm=LAS,application-id=PJAKt7ph,discussion-id=Ptlk2tI6,comment-id=0004,timestamp=2016-10-04T04:13:20.621+0000)\n>\n> Recién me ocurrió algo parecido. En promo para ascender a Oro, un vladimir top lo mataron 3 veces y luego dijo que se iba y se fue afk. Perdimos la partida. Igual se pide a los demás que lo reporten. Ya es la segunda vez que en promo salen trolls/afk/flamers... Sólo se puede reportar a quien tiene un mal comportamiento. Con suerte te llega un anuncio que ha sido sancionado ese jugador... pero hasta allí. \n> \n> Hay que inventar un sistema de sanciones (o prevención) diferente. Los trollers/afkers/flamers arruinan por completo la experiencia del juego. \n> \n> Ahora, Por qué es ilegal publicar nombres de invocadoreS?. Ojala se pueda poner en publico a todos los trolles para que los bloqueen y no jueguen con ellos.\n\nVa contra las reglas porque muchos vienen al foro a publicar algo así:\n\"Pedritomaincra777\" me trolleo la promo, se la pasó flameando y todos lo reportamos, tengan cuidado si se topan con él.\n\nPero quizá Pedritomaincra777  lo único que hizo fue reaccionar a los insultos y acosos del que creó el post y le dijo \"me tienes podrido hdp, te muteo\", y nosotros (lectores del foro) solo recibimos la mitad de la historia y le hacemos pagar todo a Pedrito siendo que no hizo nada malo (más allá de ese \"hdp\"), y todo porque alguien publicó algo con la mitad de la historia.\nAlgo similar podría suceder incluso con capturas de pantalla, tranquilamente el creador puede poner una captura donde sale pedrito diciendo por el /all \"estos pelotudos me tienen podrido\", y queda como flamer, siendo que está reaccionando a los acosos del creador del post.\n\nEntonces para evitar una gran cacería de brujas donde pagarían tanto inocentes como culpables Rito decidió que esté prohibido acusar gente en el foro publicando sus nombres, porque si bien algún que otro culpable caería, también la pagarían muchos inocentes, y es mejor tener un sistema donde SÓLO la pagan culpables (sistema de reportes actual) que un sistema hecho a medias en manos de una comunidad en parte tóxica (algo similar a lo que sucedía con el viejo tribunal).","replies":[]}]},{"poster":"Zinc","date":"2016-10-04T02:24:34.879+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NaKKa Sempai,realm=LAS,application-id=PJAKt7ph,discussion-id=Ptlk2tI6,comment-id=,timestamp=2016-10-04T01:24:25.481+0000)\n>\n> Acabo de terminar una clasificatoria en la cual mi mid (Talon) luego de morir un par de veces comenz&amp;oacute; a molestarse con todo mundo, al punto de decir &amp;quot;GG partida&amp;quot; al minuto 8-10. En ese momento la diferencia de asesinatos/torres/oro no era mucha (solo Talon tenia muertes, y un par en bot) pero el tipo sigui&amp;oacute; y sigui&amp;oacute; con su actitud, hasta el punto de amenazar con estar afk durante el resto del juego... &amp;iquest;Qu&amp;eacute; sucedi&amp;oacute; despu&amp;eacute;s? Aproximadamente en el minuto 14 Talon dio las gracias, escribi&amp;oacute; &amp;quot;/all Suerte&amp;quot; y nos dese&amp;oacute; buenas noches, luego se desconect&amp;oacute;. \n> \n> &amp;iquest;Qu&amp;eacute; puedo hacer en casos as&amp;iacute;? &amp;iquest;C&amp;oacute;mo puedo evitar que un aliado se desconecte? \n> \n> PD: Mando un screenshot sobre los resultados de la partida.\n> \n> Suerte a todos en sus Ranks, se despide NaKKa c:\n\nEl problema radica en que algunas personas piensan que juegan contra los bots, y que todo lo malo que pasa gira en torno a la falta de manos de su team en lugar del merito propio del equipo rival. O lo que le pasa a este tipo, se piensa que es bueno y el mismo se delata: si no juega cn el equipo q lleva la delantera se pone a llorar. La cantidad de veces que vi gente dar por perdida la partida al minuto 10 es una cosa de locos, aparte en situaciones completamente remontables. \n\nUna pena lo que te paso >_<","replies":[]},{"poster":"9081913DEL1","date":"2016-10-04T12:24:50.503+0000","up_votes":1,"down_votes":2,"body":"Mute y report al final de la partida, que se encargue el sistema.\nVos volves a rankear, el a discutir con el leavebuster XD.\n\nSaludos!","replies":[]}]}