{"poster":"Throwing up rain","date":"2015-03-26T06:41:54.379+0000","title":"Ma è possibile che i troll non vengono bannati?","subforum":"Discussioni generali","up_votes":1,"down_votes":9,"body":"No, la cosa sta divenando davvero stancante.\r\nSono silver V e nelle ultimate due partite, durante i pick, ho beccato 4 TROLL CHE NON RISPETTAVANO I PICK E ANDAVANO CON SMITE IN ALTRE LANE.\r\nPer fortuna qualcuno ha quittato durante il pick, senn&ograve; erano definitivamente perse.\r\nMa io ora mi chiedo, la Riot da 50 restricted a persone che magari dicono &#039;&#039;idiot, gna gna feed&#039;&#039;, ma per queste persone?\r\nI flamer alla fine rompono le scatole e basta, mentre queste persone fanno perdere proprio le partite in modo volontario alla gente.\r\n\r\nIo boh, sinceramente penso di disinstallare, se devo trovare in ogni fottuta ranked di merda degli individui del genere che fanno perdere le partite allora non ne vale la pena.\r\n\r\nContinuate pure ad avere la fissa per le punizioni nei confronti dei flamer, ma intanto in giro ci sono teste di cazzo che trollano e feedano intenzionalmente e voi non fate un bel nulla.","replies":[{"poster":"Jolly Roger","date":"2015-03-27T01:13:28.290+0000","up_votes":1,"down_votes":2,"body":"i troll non vengono bannati, esatto.\nchi incappa in un ban è solo chi flamma, insulta, insomma che lascia un segno in chat.\nogni tipo di comportamento antisposrtivo non viene punito, bisogna farci il callo.\nma tanto, che vuoi farci, è un F2p e come giusto che sia è gestito peggio di un cesso pubblico.","replies":[{"poster":"DeDiam0nd","date":"2015-04-01T10:50:00.640+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jolly Roger,realm=EUW,application-id=MJVj50Jw,discussion-id=KOraJdW1,comment-id=0004,timestamp=2015-03-27T01:13:28.290+0000)\n>\n> i troll non vengono bannati, esatto.\n> chi incappa in un ban è solo chi flamma, insulta, insomma che lascia un segno in chat.\n> ogni tipo di comportamento antisposrtivo non viene punito, bisogna farci il callo.\n> ma tanto, che vuoi farci, è un F2p e come giusto che sia è gestito peggio di un cesso pubblico.\n\ncerto che tu sei negativo al massimo..ogni tuo commento che leggo è sempre negativo..se disprezzi questo gioco nessuno ti obbliga a giocarci ^^","replies":[{"poster":"Jolly Roger","date":"2015-04-01T16:46:07.645+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=fraf1988,realm=EUW,application-id=MJVj50Jw,discussion-id=KOraJdW1,comment-id=00040000,timestamp=2015-04-01T10:50:00.640+0000)\n>\n> certo che tu sei negativo al massimo..ogni tuo commento che leggo è sempre negativo..se disprezzi questo gioco nessuno ti obbliga a giocarci ^^\n\nessere negativi non è un problema.. del resto così funziona il sistema di punizioni, non è un mistero eh.\ned è così, inutile far finta di nulla o girarci attorno.. si beccano tutti i giorni troll/intentional feeder e vai a vedere il loro profilo ti accorgi che hanno una serie di 15/20 partite tutte con score simili.\npoi mandi segnalazioni inutili, tanto risposte non ne avrai mai e non si possono \"bannare\" i player perchè \"una partita storta possono averla tutti\". quindi perchè mentire?\nmando segnalazione, controlli che ha 15 ranked con intentional feeding 0/30/0? lo banni, punto. se non lo fai sei un ritardato.\nio oramai mi limito a fare il finto afk o trollare di peso senza usare la chat.. 0 punizioni e tanto flame che verrà punito. this is LOL.","replies":[]}]}]},{"poster":"IrrationalNumber","date":"2015-03-26T07:47:36.426+0000","up_votes":1,"down_votes":0,"body":"Sono Gold I, ho avuto un genio prendere Evelynn mid. Che dovevamo fare? Certa gente te la carry di peso fino al nexus nemico.\n\nNon aveva trasgredito le regole comunque, non puoi bannare per strategie inusuali.","replies":[{"poster":"Jolly Roger","date":"2015-03-27T01:14:56.211+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Tomatotimer,realm=EUW,application-id=MJVj50Jw,discussion-id=KOraJdW1,comment-id=0001,timestamp=2015-03-26T07:47:36.426+0000)\n>\n> Sono Gold I, ho avuto un genio prendere Evelynn mid. Che dovevamo fare? Certa gente te la carry di peso fino al nexus nemico.\n> \n> Non aveva trasgredito le regole comunque, non puoi bannare per strategie inusuali.\n\ne carryare spastici è una sorta di eloboost involontario che premia chi non merita. ma del resto si sa.. i rioter in primis che non superano il bronzo o il silver cercano compagni di duo per salire. figurati per il resto cosa si può vedere.","replies":[{"poster":"IrrationalNumber","date":"2015-03-27T09:27:26.588+0000","up_votes":2,"down_votes":0,"body":"Ogni tanto vengo carryato, ogni tanto carryo, lo spastico che fa sempre lo spastico prima o poi cala.","replies":[]}]}]},{"poster":"Aramanthis","date":"2015-03-27T00:01:30.150+0000","up_votes":2,"down_votes":0,"body":"{{champion:48}} è il momento di TROLLARE!!!!","replies":[]},{"poster":"BluFoxer","date":"2015-03-26T07:22:52.611+0000","up_votes":2,"down_votes":0,"body":"Purtroppo se il troll decide di trollare il game ma non parla oppure flamma, tecnicamente la Rito non può sapere che è un troll perchè gioca tutta la partite, la gioca male ma non afka oppure flamma. Poi c'è il troll che flamma e afka, la buona notizia è che se reporti quelli la Riot può prendere provvedimenti concreti :)  Tu cerca di essere positivo e invita il troll a giocare bene, se fa cagare poi lo flammi...ahah scherzo. \nPerò seriamente non flammare e non scrivere cose in chat, so che è difficile ma ci si può riuscire, alla fine troverai un buon team oppure vai sulle chat italiane con \"leagueofrito\" oppure \"lolforumita\" e magari trovi qualcuno che gioca con te diminuendo la possibilità che becchi un troll. {{champion:9}}","replies":[]},{"poster":"IST Dima123","date":"2015-03-26T08:27:03.527+0000","up_votes":3,"down_votes":2,"body":"Trollano? quitti e -3 punti easy.","replies":[{"poster":"UnknownEV","date":"2015-03-26T11:18:44.929+0000","up_votes":1,"down_votes":2,"body":"Vergognati tu che vai Afk.","replies":[{"poster":"Darki200","date":"2015-03-27T06:37:15.258+0000","up_votes":3,"down_votes":1,"body":"Quitti in champ select, cosa C'entra l'afk?","replies":[]}]}]},{"poster":"Judge Drakoo","date":"2015-03-27T12:27:14.577+0000","up_votes":1,"down_votes":0,"body":"Le punizioni ricevute non sono pubbliche, quindi on puoi sapere se hanno ricevuto chat restriction o altro. Alcuni cambiano le maestrie all'ultimo secondo comunque, magari perché non sono nel ruolo che vorrebbero e sperano che qualcuno abbandoni la partita.","replies":[]},{"poster":"Frattaglia","date":"2015-03-27T12:15:51.339+0000","up_votes":1,"down_votes":0,"body":"Questa settimana ho vinto una partita con LeBlanc adc (non trollava, aveva solo sbagliato a pickare) e un'altra con doppio top (il secondo trollava perché non aveva potuto avere la jungla, e il primo top è andato con gangplank mid).","replies":[]},{"poster":"Nabbomaster","date":"2015-03-27T10:39:55.230+0000","up_votes":1,"down_votes":0,"body":"pensa che io ho fatto doppio jungler con i miei amici, e abbiamo vinto nonstante il jungler nemico fosse diamond\nsinceramente io un occassione la do a tutti anche perche mi e' sempre capitato che chi in genere flamma gli altri per troll pick e il primo a perdere la sua lane con un cosi detto champion tradizionale","replies":[]},{"poster":"Supernova Burst","date":"2015-04-01T10:45:28.052+0000","up_votes":1,"down_votes":1,"body":"ci vorrebbe il ripristino del tribunale almeno SOLO per i casi di trolling, un sistema automatico non riuscirà mai a scovarli, è pazzesco e avete il coraggio di chiamarlo \"sport\"? conoscete le basi  umane dello sport e del comportamento sportivo?","replies":[]}]}