{"poster":"GamerLedigSucht","date":"2018-05-30T13:18:49.803+0000","title":"[HELP!!!] Zu hoch eingeranked und unfähig beim farmen","subforum":"Level Up: Guides & Tipps","up_votes":2,"down_votes":0,"body":"Hi\r\n\r\nIch habe gleich zwei Probleme die mir den Spass am Spiel nehmen.\r\n\r\nVorweg:\r\nIch habe in Season 3 mit LoL begonnen, ca. 1 Jahr gespielt und nur die Rolle Support gespielt.\r\nNun habe ich vor einiger zeit wieder ein Account gemacht und wieder begonnen zu spielen (haupts&auml;chlich weil mein Bruder aufgeh&ouml;rt hat und den PC nicht mehr dauerhaft belegt).\r\n\r\n1. Problem: Ranking\r\nNun habe ich mich im laufe der Zeit (in den letzten Monaten) wieder auf Level 30 gespielt und wollte nun die ADC-Rolle lernen. Nach meinen 10 Promo-Games wurde ich direkt in Silber 3 eingestuft. Das Problem: Ich bekomme nur auf die Fresse. W&auml;hrend ich noch versuche die Kamera am Spielgeschehen nachzufahren, werde ich auch bereits get&ouml;tet. Ich habe keine Chance. Meist l&auml;uft es daurauf hinaus, dass wenn ich mein erstes Item fertig habe, der Gegner bereits am dritten ist.\r\nNun: Wie kann ich schnell mein Ranking nach unten korrigieren? Momentan tuhen mir meine Team-Kameraden nur leid, da ich un-carry-bar das Spiel im alleingang verliere. Ich bin nun durch meine ersten 3-4 verlorenen Runden immer noch S3 und sehe es auch nicht, dass ich in den n&auml;chsten 5-10 Spielen ein passenderes ranking habe und ich m&ouml;chte nun nicht 10-30 Spiele verlieren, bis ich in der passenden Stufe angekommen bin. Das w&uuml;rde bedeuten dass ich 40-120 Spielern ein &quot;Loss&quot; einbringen m&uuml;sste, bis es wieder beginnt spass zu machen.\r\n\r\n2. Problem: Farmen\r\nIch kann nicht farmen. Und ich werde auch nicht besser!\r\nIch habe einige Videos geschaut und auch oft im practis-tool nach den Methoden aus Tutorials trainiert.\r\nAber ich werde nicht besser. Und ich habe sehr viel ge&uuml;bt, doch in der Regel habe ich troz sturem &quot;auf der lane hocken und farmen&quot; meist den schlechtesten Farm.\r\nNun wollte ich fragen, ob jemand von euch sich auch so schwer getan hat im erlernen des farmings? Und ob diese Person evtl. mehr Tipps f&uuml;r mich hat?\r\n\r\nIch weiss ich bin schlecht. Aber ich schaffe es nicht besser zu werden und werde nur in den Boden gestampft. Das macht keine freude mehr und das Spiel nervt mich nur zu tode. BRAUCHE DRINGEND HILFE!\r\n\r\n(Und wieso muss das farmen &uuml;berhaupt so schwer gestalltet worden sein?! MACHT ES EINFACHER!)\r\n\r\nGruss\r\n\r\nIch","replies":[{"poster":"SeaHorseCalamity","date":"2018-05-30T13:25:56.312+0000","up_votes":3,"down_votes":0,"body":"Naja was Farm angeht: Da gibts keine Abkürzung. Das ist stumpfe Übung, nichts Anderes. Es einfacher zu machen ist immer so eine Sache. Wie macht man das, ohne indirekt in die Balance einzugreifen? -> mehr Schaden gegen Minions? -> Waveclear ist zu einfach. Nur mehr Schaden mit Autohits? -> Mages benachteiligt, Attackspeed bevorzugt. Es ließe sich bestimmt eine Lösung finden, die Frage ist halt, ob es notwendig ist. Es ist immerhin ein Mittel, sich einen Vorteil zu verschaffen, wenn man besser lasthittet als der Gegner. Das zu entfernen nimmt dann wiedermal etwas Tiefe aus dem Game.\n\nWas die Elo angeht: Spiele normale Spiele, bis du in etwa auf Silberniveasu spielst, ansonsten wirst du wohl deinen Teammates weiter Niederlagen bescheren, bis du in deiner Elo bist (Vieles daran wird auf die Basics zurückzuführen sein, was durch einfache Übung besser wird). Normals sind dein Freund. Oder such dir Leute, die mit dir spielen und dir evtl Tipps geben können. Oder adde mich, dann können wir die \"learning by burning\"-Variante ausprobieren, da du recht gute Gegner kriegst, die dir dann zeigen, wie mans richtig macht xD","replies":[{"poster":"GamerLedigSucht","date":"2018-05-30T13:29:40.013+0000","up_votes":1,"down_votes":0,"body":"Danke ich adde dich wenn ich zuhause bin!","replies":[]}]},{"poster":"I Anivia Main I","date":"2018-05-31T19:10:03.312+0000","up_votes":1,"down_votes":0,"body":"Spiele mit Personen die schlecht eingerankt wurden (oder mit Personen wie mir, die sich absichtlich schlecht eingerankt lassen haben), damit du nicht solch starke Gegner bekommst. wenn du leichter farmen willst empfehle ich dir Champions wie Anivia, da ihre ultimative Fähigkeit quasie für das farmen erschaffen wurde (habe 500k mastery points auf Anivia, da sie der erste champ war den ich \"gemaint\" habe und das fast 3 jahre lang mit einer ca. 80-90% Spielrate weshalb ich sagen kann, dieser Champion ist eine sehr gute Wahl für einen niedrigen Elo bereich in der Mid Lane ) P.s : Ich habe mich absichtlich in bronze 2 platzieren lassen, wobei ich im Bereich solo/duo queue silber 1 bin.","replies":[]},{"poster":"RM Heartmeander","date":"2018-05-30T16:10:03.502+0000","up_votes":1,"down_votes":0,"body":"Also zu Punkt 1 gibt es folgendes.\nEntweder du nutzt die feste Kamera, die auf deinen Champ zentriert ist und die du durch drücken der Leertaste aushebeln kannst oder du nimmst die freie Kamera, die du mithilfe von der Leertaste zentrieren kannst.\nSomit kannst du die Übersicht behalten.\n\nZu Punkt 2 das Farmen.\nWie schon die anderen geschrieben haben, hilft da nur üben üben üben.\nHier hast du nun 2 Möglichkeiten:\n1. Du spielst so etwas wie Draven, der dank seiner q recht viel Schaden hat und schon im early gut farmen kann\n2. Du übst mit Anivia oder Karthus, die AA haben die so scheisse sind dass du sobald du was anderes spielst easy lasthitten kannst\n\nSchlussendlich hilft nur üben wenn du besser farmen willst.","replies":[]},{"poster":"Nikonek","date":"2018-05-30T13:21:09.200+0000","up_votes":1,"down_votes":0,"body":"Spiel einfach normal games, in bronze abzusteigen wird womöglich auch nicht die beste spielerfahrung sein","replies":[{"poster":"GamerLedigSucht","date":"2018-05-30T13:23:21.721+0000","up_votes":1,"down_votes":0,"body":"Auch in Normals bekomme ich auf die Fresse. Ich wollte ja das Ranking, damit ich gleich schlechte Gegner bekomme. Jedoch bin ich in Silber3 gelandet (wie auch immer das geht).","replies":[{"poster":"Nikonek","date":"2018-05-30T13:25:41.027+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GamerLedigSucht,realm=EUW,application-id=vatevpvi,discussion-id=WkElqE1o,comment-id=00000000,timestamp=2018-05-30T13:23:21.721+0000)\n>\n> Auch in Normals bekomme ich auf die Fresse. Ich wollte ja das Ranking, damit ich gleich schlechte Gegner bekomme. Jedoch bin ich in Silber3 gelandet (wie auch immer das geht).\n\nVlt fortnite?","replies":[{"poster":"GamerLedigSucht","date":"2018-05-30T13:27:28.456+0000","up_votes":1,"down_votes":0,"body":"Fortnite interessiert mich nicht, danke.","replies":[]}]}]}]},{"poster":"Pure Cynicism","date":"2018-05-30T13:22:06.188+0000","up_votes":1,"down_votes":0,"body":"So wie ich das sehe, hast du zwei Möglichkeiten:\n\n1. Im Custom Game das Farming üben. Du hast da grundsätzlich drei Arten von Champs, mit denen du das machen solltest: Adcs, damit ist es am einfachsten, Nahkämpfer und Mages, damit ist es mMn am schwierigsten. Du wirst dich dann schon nach wenigen Stunden stark verbessern. Nachteil: Langweilig.\n\n2. Weiterspielen. Wenn du wirklich zu schlecht bist, wirst du schnell absteigen.\n\nAber um ehrlich zu sein: Für Silber III ist dein Farm ok. Klar, könnte besser sein, aber daran liegt es nicht, dass du verlierst.","replies":[{"poster":"GamerLedigSucht","date":"2018-05-30T13:26:30.522+0000","up_votes":1,"down_votes":0,"body":"Den Farm den du siehts habe ich nur, weil ich Ezreal genau deshalb gespielt habe. (Das Farmen geht mit deinem Q viel einfacher.)\nIm Practis-Tool übe ich regelmässig das Farmen nach einer Methode die in den meisten Farming-Tutorials gezeigt wird.","replies":[]}]}]}