{"poster":"ETM sono ITA","date":"2015-09-10T21:12:03.663+0000","title":"sejuami","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"mi potreste dare qualche consiglio come potrei  giocare al meglio questo champ ? buil ruolo  e consglio sulle skill  (mi piace la jungle e champ  tank  ma che facciano un buon  danno?","replies":[{"poster":"SickAnto","date":"2015-09-10T22:39:14.855+0000","up_votes":1,"down_votes":0,"body":"Per la build ripeto ciò che avevo scritto nell'altro post\n\n\nIn genere devi farti full tank, io la sua build di solito la facevo così:{{item:3725}} o {{item:3717}} poi {{item:3110}} {{item:3117}}{{item:3083}} {{item:3143}} {{item:3102}} .\nAltri item ottimi su di lei, sono:\n{{item:3151}} per fare altri danni AP e la sua passiva è molto forte.\n {{item:3800}} ti da sustain e la attiva è ottima per inseguire i nemici.\n {{item:3075}} Se il team nemico sono tutti AD è sempre una buona idea buildarlo.\n {{item:3742}} Non l'ho ancora provata su di lei, ma come item ora è molto forte.\n\n\nStarti di W, dal gromp(la rana per intenderci), poi al 2 sblocchi la E, ti fai i lupi, poi i polli, gli argogranchi (sono importanti per avere visione del river così puoi anticipare gank nemiche) al 3 puoi benissimo gankare le lane che necessitano aiuto, non perdere tempo troppo in una lane, maxa per prima la W e poi alterna fra Q ed E, cerca di risparmiare la ulti per il tf, Sejuani ha buoni danni, ma lei deve tankarsi tutto non deve portare danni e credimi buttarsi di Q in mezzo al team nemico è divertente, ci metteranno un'ora ad ammazzarti, ovviamente se non sono fiddati, cerca di evitare scontri il jungler nemico in early, lei è debole e non è abbastanza tank da sostenere uno scontro in quel momento, ovviamente, ogni volta che ne ha l'occasione, fatti il drago con l'aiuto della botlane.","replies":[{"poster":"Whommy","date":"2015-09-11T08:34:18.466+0000","up_votes":1,"down_votes":0,"body":"No, mai prendere la E come seconda skill, non fa danno è solo un rallentamento totalmente inutile in early per pulire i campi.\n\nObbligatorio W-Q-W-E-W-R, ecc...\nSi maxa W, poi Q esolo alla fine la E (R quando disponibile).\n\nPer la build sempre e solo fulltank.\n{{item:3725}} {{item:3111}} (obbligatori, per lo stack con la passiva) {{item:3110}} {{item:3102}} {{item:3083}} {{item:3065}} \n\n{{item:3075}} Situazionale\n{{item:3800}} Situazionale dopo il nerf\n\n\n\nRune\n9xPen Ibrida\n9x Armor\n9xMRxlv\n2 quinte AP e 1 vel movimento o 3 quinte AP.","replies":[{"poster":"SickAnto","date":"2015-09-11T09:59:01.363+0000","up_votes":1,"down_votes":0,"body":"> No, mai prendere la E come seconda skill\n\nNon ho detto quello, ho detto che si alterna fra Q e E.\nSi prega di stare attenti quando si legge : P","replies":[{"poster":"Whommy","date":"2015-09-11T10:26:12.868+0000","up_votes":2,"down_votes":0,"body":">  poi al 2 sblocchi la E\n\n-_-\"","replies":[{"poster":"SickAnto","date":"2015-09-11T11:49:50.998+0000","up_votes":1,"down_votes":1,"body":"Sbloccare non maxare, preferisco in questo modo per farmare con lei, visti i cd bassi della W ed E rispetto alla Q.\nTi sei sbagliato di nuovo : P","replies":[{"poster":"Whommy","date":"2015-09-11T12:46:26.193+0000","up_votes":1,"down_votes":0,"body":"appunto, che ho scritto io?\n\nNo, mai **prendere** la E come seconda skill, non fa danno è solo un rallentamento totalmente inutile in early per pulire i campi.\n\nNon ho detto Maxare.\n\nLa E non serve a fare danno ma a rallentare i nemici, cosa ti serve a lv2 rallentare i campi di giungla e fare si e no 60 danni con 10s di CD??\n\nA niente.\n\nLv1 W\nLiv 2 Q\nLiv 3 W\nLiv 4 E\nLiv 5 W\nLiv 6 R","replies":[]}]}]}]},{"poster":"l  Ferox  l","date":"2015-09-11T09:33:53.841+0000","up_votes":1,"down_votes":0,"body":"In molti usano l'attack speed sui Marchi e 3 quinte AP","replies":[{"poster":"Whommy","date":"2015-09-11T10:18:59.075+0000","up_votes":1,"down_votes":0,"body":"l'AS serve per proccare più spesso il  buff dei golem e prendere qualche danno in meno in early, aumentando anche il DPS generale.\n\nSejuani è un tank basato sui CC, danno continuato AOE (W+{{item:3751}} ), in più è un late champion l'AS in late serve a poco dato che non è un champ basato sugli AA.\nLe ibride aiutano un pò in giungla e migliorano il danno sia delle skill che del tizzone.","replies":[]}]}]}]},{"poster":"ETM sono ITA","date":"2015-09-10T21:12:21.611+0000","up_votes":1,"down_votes":0,"body":"sejuani* scusate ho sbagliato","replies":[]}]}