{"poster":"ETM sono ITA","date":"2016-06-12T16:46:35.047+0000","title":"quele support vorresti avere in squadra?","subforum":"Discussioni generali","up_votes":5,"down_votes":1,"body":"sono un main support ... parto dicendo di non essere fortissimo sono solo s4  vorrei per&ograve; chiedere a tutti gli adc della comunity quali sono i support che pi&ugrave; gli piace avere nella lane senza parlare di bravura ecc ... ma solo del campione chi vi piacerebbe avere con voi ? es. soraka, sona, aistar quali sono per voi i support migliori e quali vi possono aiutare di pi&ugrave; per ivncere in bot lane ?","replies":[{"poster":"x A N D R E","date":"2016-06-12T20:21:19.929+0000","up_votes":1,"down_votes":0,"body":"Sona e il più completo, per questo la preferisco","replies":[{"poster":"wellyT93","date":"2016-06-12T20:24:30.297+0000","up_votes":3,"down_votes":0,"body":"Sona il support più completo?\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"x A N D R E","date":"2016-06-12T20:27:45.301+0000","up_votes":1,"down_votes":0,"body":"Perché no?, cosa le manca?","replies":[{"poster":"wellyT93","date":"2016-06-12T20:36:29.738+0000","up_votes":5,"down_votes":1,"body":"Disengage, peeling, tankiness, range...\nSona è un champ squishyssimo, conterabilissimo da tantissimi supports, con danni buoni praticamente solo in lane (anche se il range è veramente basso e i problemi di mana si sentono), con un peeling per l'adc veramente mediocre.\nLe uniche cose buone sono il poke ai primi livelli e l'ulti che è un buon engage. \n\n{{champion:412}} a mio avviso può essere considerato \"il support più completo\".","replies":[{"poster":"Filthyrocker","date":"2016-06-13T10:21:41.008+0000","up_votes":1,"down_votes":0,"body":"Sona e' un buon supp,bisogna solo saperlo usare.Un po come con tutti i champ bene o male.E' squishy? beh si e' un supp mage,che ti aspettavi.Anche Soraka e Nami non sono Tankosissime.Il range e' basso ma considera che il poke ha l'auto targeting per 2 bersagli,e inoltre e' uno dei healer migliori.\n\nThresh? si probabilmente e' il supp piu completo","replies":[{"poster":"wellyT93","date":"2016-06-13T11:26:58.450+0000","up_votes":1,"down_votes":0,"body":"> Sona e&#x27; un buon supp,bisogna solo saperlo usare.Un po come con tutti i champ bene o male.\n\nMai detto il contrario mi pare, {{champion:37}} per me è un high risk high rewards, se riesci a pokare safe in lane senza mai farti prendere riesci, da solo, praticamente a bullizzare fuori dalla lane l'adc nemico, facendogli perdere exp e cs, quindi, vincendo la lane da solo, ma non è semplice, anzi.\n\n>E&#x27; squishy? beh si e&#x27; un supp mage,che ti aspettavi. Anche Soraka e Nami non sono Tankosissime. Il range e&#x27; basso ma considera che il poke ha l&#x27;auto targeting per 2 bersagli\n\nIl fatto non è l'essere squishy in se (e c'è da dire che a livello di statistiche di base è il più squishy, ma vabhè), ma il fatto di avere un range bassissimo vuol dire dover sporsi per pokare, e se non hai niente per disingaggiare immediatamente è un facilissimo bersaglio dei nemici, soprattutto quelli con hard engage, dato che sopra il bronzo i support non stanno a prendersi poke gratis senza reagire, per non parlare del jgl nemico. \nE' un insieme di cose (squishy, low mobility, no escape, low range, mana hungry). \n\n> e inoltre e&#x27; uno dei healer migliori.\n\nBhè, quanti sono gli healer su LoL? 3, se non contiamo {{champion:12}} {{champion:44}} come healers. \nSono: {{champion:16}} {{champion:267}} {{champion:37}}, e tra questi 3 lei è al [terzo posto](http://champion.gg/statistics/#?roleSort=Support&sortBy=general.totalHeal&order=descend). \n\n> Thresh? si probabilmente e&#x27; il supp piu completo\n\nSenza dubbi.","replies":[{"poster":"Filthyrocker","date":"2016-06-14T09:32:53.711+0000","up_votes":1,"down_votes":0,"body":">Bhè, quanti sono gli healer su LoL? 3, se non contiamo{{champion:12}} {{champion:44}}  come healers.\n\nBeh,ci sarebbero anche Bard,Janna,Kayle che hanno il heal come utility.Quindi non sono cosi pochi alla fine.\nNami non cura meglio di Sona pero'.Lei puo curare fino a 2 bersagli,il suo heal ha un cd minore di quello di Nami e inoltre da anche una barriera bonus per tutti champ alleati intorno a lei.Cio' rende la sua W versatile sia in lane che in Team fight.Secondo me il heal di Sona e' un po sottovalutato come utility,almeno da alcuni.","replies":[]}]}]}]}]}]}]},{"poster":"Kopoo","date":"2016-06-13T08:36:41.041+0000","up_votes":1,"down_votes":0,"body":"{{champion:40}} {{champion:201}} {{champion:412}} {{champion:12}} \nSono quelli che preferisco.","replies":[{"poster":"wellyT93","date":"2016-06-13T16:45:10.781+0000","up_votes":2,"down_votes":0,"body":"I migliori {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Dragonik VP","date":"2016-06-13T16:35:00.332+0000","up_votes":1,"down_votes":0,"body":"Parto dal presupposto che sono un support. Non esistono champions completi ma champions che sanno adattarsi più facilmente all'andamento della partita e risultare più incisivi rispetto ad altri.\n\n- Morgana è sicuramente un support da imparare, il suo blackshield è straordinariamente forte contro champions dotati di innumerevoli controls.\n- Braum è il tank per eccellenza, bilanciato e resistente in grado di bloccare danni ingenti grazie a unbreakable.\n- Thresh credo sia il più completo ma al tempo stesso il più complicato da gestire, la sua lanterna fa miracoli usata sia per agevolare le ganks del jungler sia per salvare il tuo compagno di squadra da una morte certa.\n\nHo scelto i tre migliori champions suddivisi per categoria tralasciando champions forti ma che non riescono a carriare un game come Soraka e Janna (tanto per citarne alcuni) in quanto sono troppo dipendenti dalla maestria del proprio adc.\n\nCi sarebbe molto altro da dire, non vorrei dilungarmi troppo e risultare pesante. Spero di esserti stato utile.","replies":[]},{"poster":"Hikayaler","date":"2016-06-13T10:00:54.200+0000","up_votes":1,"down_votes":0,"body":"I support che preferisco sono:\n{{champion:12}} {{champion:201}} {{champion:267}} {{champion:412}} {{champion:44}} \nMa ovviamente bisogna saperli usare! Dipende molto dalle pick :)","replies":[]},{"poster":"Nibbio Bianco","date":"2016-06-13T09:36:22.299+0000","up_votes":1,"down_votes":0,"body":"Uno sveglio che sa mettere presenza.","replies":[]},{"poster":" HegeKyras","date":"2016-06-13T08:30:59.181+0000","up_votes":1,"down_votes":0,"body":"usando Ashe come ADC il supp che preferisco avere è Morgana che usata bene fa danni è rallenta gli avversari lasciandoli indifesi dalla mia raffica di frecce","replies":[]},{"poster":"Yoriyoshi","date":"2016-06-13T08:18:14.609+0000","up_votes":1,"down_votes":0,"body":"Thresh saputo usare, tutta la vita.","replies":[]},{"poster":"Linkimaru GX","date":"2016-06-13T07:53:05.791+0000","up_votes":1,"down_votes":0,"body":"Vorrei NON avere: karma, sona, zyra, soraka.\nIl resto vanno tutti bene.","replies":[]},{"poster":"Dantazzo","date":"2016-06-12T23:14:48.334+0000","up_votes":1,"down_votes":0,"body":"Io so solo che di sicuro non vorrei Bard in nessuna partita.\nPer il resto dipende da troppi fattori.","replies":[]},{"poster":"Darkinknight","date":"2016-06-12T23:01:52.923+0000","up_votes":1,"down_votes":0,"body":"Il supp che preferisco è {{champion:412}} ma dato che è dura usarlo è un terno al lotto..se pickano {{champion:12}} sono sempre contento,x quanto chi lo usa non abbia le mani è impossibile non fare nulla di buono con sto coso","replies":[]},{"poster":"Sorcio84","date":"2016-06-12T20:28:34.113+0000","up_votes":1,"down_votes":0,"body":"{{champion:16}} {{champion:40}} {{champion:25}} \n\nSono quelli che uso io e sugli adc che ho {{champion:29}} {{champion:96}} {{champion:22}} vanno benissimo. No amo gli hard engage. Preferisco difesa , heal, o al massimo poke mage.","replies":[]},{"poster":"Mytlix","date":"2016-06-12T20:00:42.401+0000","up_votes":1,"down_votes":0,"body":"{{champion:12}} {{champion:201}} {{champion:53}} {{champion:412}} {{champion:25}} Li amo tutti ma forse Braum e Alistar un pizzichino di più.\n\nInvece il support che non vorrei mai avere in low elo:\n{{champion:432}}  Non beccano un fottuto stun.","replies":[]},{"poster":"Pls Buff Shen","date":"2016-06-12T19:20:28.443+0000","up_votes":1,"down_votes":0,"body":"amo 3 champ support {{champion:40}} ti da scudi, ti aumenta l'ad, ti slowa tutti, ti cura, è perfetta\n{{champion:12}} IGNORANZA PURA, lo guardi andare 1 vs 2 uccidendo il carry nemico e tu ti prendi gli assist, e se provano ad avvicinarsi a te vengono scagliati via\n{{champion:412}} il supp completo e , se usato bene, carrya da solo.","replies":[]},{"poster":"The Marksman N95","date":"2016-06-12T18:33:49.877+0000","up_votes":1,"down_votes":0,"body":"Personalmente amo giocare con i Tank Sup. Tra i tanti i miei preferiti sono Braum e Alistar hanno delle buone sinergie con i miei champs preferiti. :){{champion:51}} {{champion:81}}","replies":[]},{"poster":"BrattishSolid6","date":"2016-06-12T18:23:52.106+0000","up_votes":1,"down_votes":0,"body":"Personalmente mi piace molto il support tank. Da engage / disengage come Alistar, Leona, Braum. Da utility come Blitzcrank, Thresh, Tahm Kench (anche se troppo nerfato imho ora). Support che portano sempre utility e che possono scalare bene buildando resistenze.","replies":[]},{"poster":"Dainsleif09","date":"2016-06-12T18:23:26.255+0000","up_votes":1,"down_votes":0,"body":"non gioco molto il ruolo di adc,perché preferisco fare io il supp piuttosto che mi becco il solito supp che si fa la sightstone a 20 mins e non la usa neppure alla fine.\nTRUE STORY","replies":[]},{"poster":"zYaichi","date":"2016-06-12T18:14:41.310+0000","up_votes":1,"down_votes":0,"body":"Non gioco adc ma vorrei tanto avere  thresh ha un kit completo e la lanterna,fate santo chi l'ha inventata che ti salva quando sei un assassin e fai il tuo lavoro {{champion:35}}","replies":[]},{"poster":"Piemoo","date":"2016-06-12T17:42:18.456+0000","up_votes":1,"down_votes":0,"body":"Quando startavo le ranked tutte le mie champ select erano più o meno così:\n\nAlly1: \"pick a tank\nAlly2: \"yes, take a tanky supp\"\nAlly3: \"plz, leona\"\nMe: \"no worries\"\nPrendo Nami\nAlly2: \"omg, ggwp\"\nAlly1: \"ff@20 report nami\"\n\nCredo che oltre al campione dipende molto come lo usi, ovviamente al mio elo. Magari più in alto inizia ad esserci un minimo di counter pick.","replies":[]},{"poster":"Yamero Senpai","date":"2016-06-12T17:33:26.533+0000","up_votes":1,"down_votes":0,"body":"tahm kench se quel cancro di zed non è stato bannato, braum perché braum è un sleeper, ovver è OP ma nessuno lo sa.Zilean  se il carry nemico prende qualcuno scarso in early tipo twitch kog maw vayne varus eccetera, alistar per le wombo combo e per contuerare blitz, sona se pickano soraka, blitz non mi piace averlo in team. thresh se sei bravo, karma accompagnato da un hyper carry aka gente tipo kog maw che sono in grado di avere i danni  che mancano al carry, leona se sei in bronzo è un must, velkoz/zyra/lux se vuoi fare i big danni","replies":[]},{"poster":"Tommy Haw","date":"2016-06-12T17:09:13.403+0000","up_votes":1,"down_votes":0,"body":"da main adc ti dico: dipende da moltissimi fattori tra cui\n\n-adc avversario\n-support avversario\n-adc che sto giocando\n\npartendo dal fondo, se sto giocando champ che devono scalare {{champion:67}} {{champion:96}} {{champion:222}}  ad esempio mi piace avere o {{champion:40}} o healer, oppure hard engage con buoni cc {{champion:89}} {{champion:12}}  ma anche qua dipende dal support nemico e dall'adc nemico\n\nin generale\n\nse la botlane avversaria ha un supp healer prendi o healer/scudi o hard engage\nse la botlane avversaria ha un hard engage prendi hard engage (oppure se il tuo adc deve scalare healer o mage)\n\ncome vedi dipende da troppi troppi troppi fattori\n\ne tutti i main adc diranno che dipende da che adc giocano :)","replies":[]},{"poster":"Aevaar","date":"2016-06-12T16:55:02.854+0000","up_votes":1,"down_votes":0,"body":"Gioco veramente pochissimo adcarry, però generalmente non amo i supporti healer.\nMi piace avere un tankone che ingaggi per bene, ma anche qui è questione di gusti.","replies":[]}]}