{"poster":"Main Evelynn","date":"2016-06-12T22:30:41.668+0000","title":"Algun main Singed por ahi que me de consejos?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Hola, estoy empezando a utilizar a Singed, pero no le capto la mecanica al champ mas alla de ponerse a correr tirando veneno, hay alguno de ustedes que lo mainee y me de consejos de builds, mecanicas, maneras de iniciar, farmeo, etc, etc..??\r\n\r\n{{champion:27}}","replies":[{"poster":"Gipiloco","date":"2016-09-26T12:18:40.418+0000","up_votes":1,"down_votes":0,"body":"farmear, {{item:3027}}  de primeras, luego o {{item:3116}}   o {{item:3065}} por si estas jodido pero perderas daño, el {{item:3512}} es muy importante ademas del {{item:3151}} para hacer mucho mas daño, con eso estarias encarrilado...tenes que ser tanke y casi imposible de gankear  una ves tengas esto.\nla estrategia es splitpushear y hacer proxy farming, simplemente anda hacia una linea y empujala a muerte, wardea mucho para saber cuando te vienen y guardate el ulti y el {{summoner:6}}  por si te vienen para escapar, o si puedes matar estaria perfecto. guardate siempre el {{summoner:12}}  para ir a gankear, o a una tf que te convenga pelear, tu E es de mucha ayuda. tenes que variar entre splitpushear y pelear tf porque en tf no sos de gran gran ayuda como otros.\nsinged es un gran campeón contra bronzas, porque si te persiguen se mataran a si mismos y en bronce se volveran locos con verte splitpushear.\nlo mejor es {{summoner:6}}  y {{summoner:12}} , pero puedes ir con {{summoner:6}} {{summoner:14}}  si estas muy seguro de poder abusarte del enemigo, pero singed es mas pasivo.","replies":[]},{"poster":"Bizantine","date":"2016-06-21T01:58:11.228+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo tambien hacer uso en algún momento importante(botar torre,pushear o generar emboscadas) , hacer uso de estos 2 objetos:\n\n{{item:3056}}  Te vendra de utilidad tanto para divear en casos de ataque, escape y  casos de tanqueo.  Gracias a su principal uso, te evitaras los 3 ataques de las torres y conseguiras bonificaciones de velocidad en terreno . Lo veo ideal para botar las torretas de entrada al nexo enemigo, sobre todo por las posibles necesidades tanquear y tf que se generan ahí.\n\n{{item:3512}} Si tienes un oponente que le puede generar muchos problemas a singed para farmear o moverse entre la línea, te puede ser de utilidad.  Los seres del vacíos, te ayudaran ya sea a pushear o equilibrar en ciertos caso las línea. Usalo cuando debas pushear las torres exteriores del nexo, cuando debas intentes evitar una emboscada o generarla. También tienen un bono de velocidad, tanto en torres como en donde lo coloques.\n\nEn temas de dragon o barón. Yo te recomendaría estar por la zona donde entrara el enemigo, para generar un distracción precisa y dejarle a tu equipo la seguridad de poder llevarse la bonificación sin problemas o luchas. Avisales, wardea las posibles entradas, vigila y evita que entre el equipo enemigo.\n\nEn el tema de hechizos, la composición que mas le sirve a singed es esta: {{summoner:12}} & {{summoner:6}} . Ambos tienen la utilidad en singed, sobre todo este {{summoner:6}}  que en los últimos parches, se ha reducido su enfriamiento.\n\nSaludos.","replies":[]},{"poster":"Salvor","date":"2016-06-13T01:24:44.256+0000","up_votes":1,"down_votes":0,"body":"A mi me encanta el concepto de campeon, pero lo encuentro muy en desventaja con la mayoría de tops, me parece que le vendría bien un pequeño reworkr o un buff.","replies":[]},{"poster":"LastHope17","date":"2016-06-12T23:44:56.389+0000","up_votes":1,"down_votes":0,"body":"Iba a dejarte algunos consejos pero no hay nada fuera de lo normal para usar a singed, mas que nada se basa en runas build y saber cuando podes hacer proxy  y cuando no, ademas con los testamentos de los otros que te contestaron seguro que lo que digo ya lo dijeron xD","replies":[]},{"poster":"Tecnicomando","date":"2016-06-12T22:50:47.701+0000","up_votes":1,"down_votes":0,"body":"Control de mapa...\n\nSaber donde esta cada quien ,ejercer tal presión que te persiguen todos y tu equipo rompe cosas,farmea,obtiene objetivos gratis...\n\nTankearte al punto de dar vuelta una partida solamente corriendo a travez de todo la tf enemiga, lanzando atras al adc y tu equipo pase la escoba...\n\nusando singed en solo 10 partidas valide mi oro...\n\nHay que tener 2 bolas bien grandes y perder el miedo,singed es bien tanke y mete mucho daño pero nita farm\n\nsalu2\n\npd:ahora mismo estoy probando build`s y cosas rancias que vi por alli \n\nhttp://las.op.gg/summoner/userName=tecnicomando","replies":[{"poster":"Hnk Kenshiro","date":"2016-06-12T23:17:25.895+0000","up_votes":1,"down_votes":0,"body":"¿Cuales son los items standars que recomienda?","replies":[]}]},{"poster":"Rolando Magic","date":"2016-06-12T22:32:31.459+0000","up_votes":1,"down_votes":1,"body":"Pero si correr tirando veneno es la único que tenes que hacer y la única \"mecanica\"","replies":[{"poster":"Hnk Kenshiro","date":"2016-06-12T22:44:00.173+0000","up_votes":1,"down_votes":0,"body":"Aun asi existe el mejor corredor y tirador de veneno del mundo,","replies":[]},{"poster":"Main Evelynn","date":"2016-06-12T22:39:20.758+0000","up_votes":1,"down_votes":0,"body":"claro pero como tiene la E y la W  capaz se usa en algun momento...sinceramente no se nada sobre el champ, lo mismo con la ulti, cuando activarla y cuando no.","replies":[{"poster":"Rolando Magic","date":"2016-06-12T22:43:38.085+0000","up_votes":1,"down_votes":0,"body":"Y mira no es muy difícil, la W es un slow úsala para alcanzar a tu objetivo, la E para mal posicionarlo y a la vez hacerle daño con tu veneno, y por ultimo la ulti la podes usar para iniciar corriendo hacia el enemigo o escapar ya que te da MS y aumento de regeneraciones","replies":[]}]}]},{"poster":"xX TuOniichan Xx","date":"2016-06-12T23:35:29.446+0000","up_votes":1,"down_votes":1,"body":"No es mi Main pero me gusta mucho el personaje. Singed es uno de esos campeones que jamás lo verás atacando directamente a alguien, es como un Soporte, depende de sus aliados para matar. Tendrias que tener un rival muy malo para matarlo (Las cosas como son xD).\n\nLa Q de Singed, es un veneno que queda en el aire y envenena a los enemigos que entran en él. Su daño es prolongado por lo que nunca busques ganar una pelea en un solo trade, Singed necesita de varios intercambios de daño con su rival, esparcir veneno y retroceder ya evita que pierdas vida y el enemigo pensará que no hiciste nada mientras de a poco vas consumiendole la vida.\n\nLa W de Singed es un circulo pegajoso (Creo que así la describe, no recuerdo xD), que lentea a los enemigos dentro de él, si Singed lanza a un rival dentro de este queda stuneado. Si bien este es un combo muy bueno en el papel, yo jamás he visto que se haga mucho, yo personalmente lo he hecho un par de veces y seria. La W se usa mas para atrapar enemigos que intentan escapar en los ganks y esas cosas.\n\nLa E de Singed, lanza hacia la espalda de Singed a un enemigo. Esta habilidad es una de las mas utiles de Singed ya que te da la opción de envenenar a un enemigo que tengas delante con tu Q, y desposicionarlo. Y aun que no es recomendable, te aconsejo que lo hagas contra un Volibear, es divertido ver como levanta a un oso como si nada xD.\n\nLa R de Singed, es un aumento de combate. Mejora tu regeneración de Vida, Maná, Resistencia Fisica y Magica, además de darle velocidad de movimiento y aumento de poder de habilidad. Salvo que vayas muy feed (Cosa que es dificil), se recomienda no buscar combates 1 vs 1 o entrar en TF's sin ultimate, ya que este aumento mejora todas sus estadisticas y es cuando Singed es mas fuerte.\n\nLa Estrategia de Singed es complicada, ya que a diferencia de otros campeones, Singed no tiene un kit de habilidades que te indique que debes estar cerca de tu enemigo, pero tampoco puedes poquearle como otros magos. Pero en teoria, es simple. En linea, utilizas tu veneno para pushear la linea un poco y meterle algo de veneno al enemigo, cuando el enemigo recibe veneno retrocedes. Si él intenta seguirte ganas, por que el veneno que vas dejando aumentan el tiempo que él estará recibiendo daño, y mientras corres es dificil que pueda hacerte mas daño que el que tu le estas haciendo.\nLa E no la utilizarás salvo que ya tengas algun item que te de maná y en realidad, si no puedes matarlo solo o no viene tu jungla, no conviene. La E de Singed consume mucho maná, y es mejor usarla cuando te da una ventaja real, probablemente tengas que backear por falta de maná luego de usarla a si que, usarla cuando creas que tu rival va a morir es lo mejor (No para matarlo, es para evitar que escape y tu o tu jungla maten al enemigo).\nUna estrategia mas osada es el Proxy Farm, que consiste en farmear detrás de la torre del enemigo, esto hace que tus subditos impacten directamente contra la torre, haciendo perder farm a tu enemigo e imposibilitando que pueda pushear. Generalmente cuando haces esto, no tendrás problemas hasta que venga el jungla enemigo, y la unica forma de parar esta estrategia es matar al Singed que lo haga, esta estrategia yo la uso cuando ya he perdido la linea, y generalmente termino con un score de 1/10 xD, pero es otra forma de ganar, una menos elegante pero mas inteligente. Lo ideal es dominar y entender la estrategia para usarla, ya que debes tener un control de visión bueno para no morir inutilmente.\n\nLa build de Singed tiene dos items que deben ir si o si. Uno es el de maná, Singed gana vida por el maná que tenga, a si que hacerte un item de maná te hará un poco mas tanque. {{item:3040}} o {{item:3027}} son las mejores opciones, aún que la primera yo la recomiendo para Aram u algún modo de juego. Vara de las Edades te da sustain, ya que según el maná que gastes te da vida, y según la vida que pierdas te da maná, ideal para un campeón que se basa en hacer daño y recibirlo buscando salir bien parado. El Segundo item es {{item:3116}} , y es obvio, si tu veneno lentea a tus enemigos te será facil obligarlos a tragarse tus gases toxicos. Lo demás es dependiendo del equipo, para un equipo con mucho daño fisico {{item:3742}} es una buena opción, te da velocidad de movimiento y carga tu proximo ataque basico, como no te interesa darle ese ataque, utiliza la velocidad para correr delante de él y envenenarlo. {{item:3111}} y {{item:3065}} ideales cuando el daño es mas magico, es casi imposible no creer que si esta es la opción, no tengan tambien mucho CC, a si que las botas harán su trabajo. {{item:3009}} son las botas para ser intocable, a si que esta es la opción cuando no tienen CC o no demasiado. Como item extra de daño, {{item:3151}} ...Un veneno que lentea y hace daño por porcentaje de vida es bastante bueno contra cualquier equipo, pero es ideal contra tanques. Obviamente solo da vida en lo que respecta a ser tanque, a si que hay que tener cuidado con eso, sacrificas resistencia por daño y no siempre es conveniente ya que nunca verás a Singed Oneshotear, incluso si vas feed.\n\nRecomendaciones extra: Nunca optar por el daño primero, lo idea es hacerte algo que te de maná, y luego seguir con algo de resistencia fisica o magica, ya que Singed no es nadie sin ser algo tanque. En Team Fights, la labor de Singed es sacar a alguien con poca movilidad como un ADC, arrojarlo hacia tu equipo y salir. No te interesa comer demasiado daño, y si el enemigo intenta rescatarlo, tu veneno servirá para bajarles la vida y que tu equipo haga el resto. Y obviamente, si te enfrentras a uno...Nunca sigas a un Singed xD. Saludos.","replies":[]}]}