{"poster":"GER Freestyler","date":"2016-03-25T22:26:42.384+0000","title":"FPS seit 6.6 niedrig (Mac)","subforum":"Hilfe & Support","up_votes":6,"down_votes":0,"body":"Ich habe bisher auf meinem iMac LoL immer mit 60 FPS genie&szlig;en k&ouml;nnen, leider sind seit patch 6.6 meine frames bei 35 und in teamfights sogar zwischen 2-5... hat jemand &auml;hnliche Probleme auf dem Mac oder kann mir weiterhelfen? Danke schonmal im Vorraus :)","replies":[{"poster":"TagC","date":"2016-03-26T02:38:03.222+0000","up_votes":3,"down_votes":0,"body":"Kann von dem gleichen Problem berichten. Versuche morgen mal ob das mit dem deaktivieren funzt. Berichte dann notfalls.","replies":[]},{"poster":"ProLikeMagic","date":"2016-03-26T02:08:15.386+0000","up_votes":2,"down_votes":0,"body":"Ich hab mich gerade auf reddit umgesehen und ein paar Einträge zu dem Problem gefunden. Es ist angeblich ein Soundbug der die FPS drops hervorruft. Dieser tritt beim Mac-Client seit Patch 6.6 auf und sollte durch das Ausschalten des Sounds umgehbar sein. Das folgende hat ein Riot Mitarbeiter auf Reddit gepostet:\n> If you disable the sound, then hit okay, then reenable the sound it sometimes fixes the bug. This deloads then loads the sound banks back in. I play on Mac and this was happening to me last night, I just thought my computer was trash until I saw this thread.\n\n Hier ist noch ein Link zu dem Reddit Post den ich zu dem Problem gefunden hab: https://www.reddit.com/r/leagueoflegends/comments/4brdiq/mac_users_experiencing_sound_issues_and_huge_fps/","replies":[{"poster":"5 FPS","date":"2016-03-26T12:51:07.426+0000","up_votes":1,"down_votes":0,"body":"ich hatte auch einige soundprobleme seit 6.6 und den FPS drops. Das mit dem Aktivieren und reaktivieren hat bei mir leider nicht geklappt, dennoch werden wir dann warscheinlich ohne Sound spielen müssen falls sich nur so die Drops verhindern lassen...{{item:3070}}","replies":[{"poster":"TagC","date":"2016-03-26T18:10:32.703+0000","up_votes":2,"down_votes":0,"body":"Kann leider auch nur ohne sound zocken -.- Mit Sound büße ich harte laggs in Teamfights ein. \n*Offtopic*\nMeiner Meinung nach könnte Riot ein bisschen mehr Arbeit in den Mac-Client stecken da von anderen Macusern desöfteren von Disconnects gesprochen wird. *Offtopic*","replies":[]}]}]},{"poster":"OSaftKiller","date":"2016-03-26T01:34:59.470+0000","up_votes":1,"down_votes":0,"body":"Ich habe in Teamfights krasse Framedrops, aber schon was länger. Die FPS fallen dann mal eben von 200 auf 70 oder 80. Theoretisch genug FPS aber bei solchen dropps ist das Brutal. Bei mir hat es was gebracht die FPS auf 80 zu limitieren, scheint ein CPU Limit zu sein, da meine GPU maximal zu 20 % ausgelastet wird.\n\nHoffe Riot verbessert die Performance irgendwann mal, das dass Spiel mal mehr als nur von einem CPU Thread Gebrauch macht, wenn ich Spiele ist der erste Thread immer zu 100 % ausgelastet und alle anderen machen nichts xD\n\nHab wohl Windows, ist glaub seit 6.5 bei mir so.\n\n@ TE, neuen Grafiktreiber mal probiert zu installieren, sofern man das muss? Kenn mich mit Macs nicht so gut aus.","replies":[]}]}