{"poster":"cazis 2","date":"2016-08-25T14:51:50.174+0000","title":"Quiero saber su opinión","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"&iquest;piensan que este server es malo a comparaci&oacute;n de otros?\r\n\r\n personalmente me parece que no es tan malo existe el mute , reportas si ves algo mal , implementaron cosas que me gustaron (cofres y fragmentos de campe&oacute;n ) y no todo es gente mala aca hay gente buena onda\r\n\r\ngracias por su tiempo \r\n\r\nsaludos","replies":[{"poster":"NO THIS IS DOG","date":"2016-08-25T15:21:24.584+0000","up_votes":2,"down_votes":0,"body":"Creo que el problema se exagera demasiado, mucho más desde que está lleno de grupos de fb y en el foro mismo donde uno se ceba con los comentarios de los demás\n\nYo juego hace un año, me encontré con todo lo siempre mencionan, lag, trolls, smurf, feeders, ultra toxicos, rage quiters, caidas del server, hacks y lo que se te ocurra, pero la verdaaaaaaad que no me afectó  para nada, si, ocasionalmente pierdo una partida por estas cosas, ok, me jode haber perdido ese tiempo, pero tampoco es mucho, ni taaaaan frecuente.\nPero como están todos tan sensible, te toca un troll o un pibe se fue afk y ya vienen al foro o a cualquier lado a hacer un crypost de que Riot se caga en los jugadores y que se van a ir y que GG LAS vamos a BR (?)\n\nTL;DR: La gente está re histérica, ese el problema, no el server :v","replies":[]},{"poster":"Smufr","date":"2016-08-25T15:16:03.454+0000","up_votes":2,"down_votes":0,"body":"El servidor no es malo el problema es la comunidad :P","replies":[{"poster":"cazis 2","date":"2016-08-25T15:30:36.229+0000","up_votes":1,"down_votes":0,"body":"Bueno si te guías por eso siempre va a ser mala la comunidad , ya que entran niños que no pasan 10 años en muchos casos y son algo inmaduros cabe resaltar , ademas el juego al ser free to play fomenta esto en mayor medida y ademas esta lo de  que se insultan paises XD","replies":[]}]},{"poster":"Sirek","date":"2016-08-25T16:02:47.460+0000","up_votes":1,"down_votes":0,"body":"El servidor es bueno, Riot esta haciendo muchos cambios y agregando otras cosas muy interesantes, el juego sigue siendo gratuito y el servidor es muy estable. \n\nAdemás piensa en los trabajos que esta haciendo Riot para mejorar la conexión con Argentina y Uruguay y pronto se pondrán a trabajar en Perú. \n\nEl servidor esta muy bien y esta cada día siendo más profesional, pero el problema como todos lo sabemos es la comunidad y que su mayor defecto no son los trolls, no los AFK ni los problemas de conexión.... si no que son los flamers. Aquellos que no perdonan el mínimo error y esperan que el equipo juegue a un nivel igual o superior que la LCS.\n\nEsa es mi opinión, en el foro tenemos una agradable comunidad y que cualquier consulta que tengas aparece algún buen samaritano que te ayudara.","replies":[]}]}