{"poster":"petscabies","date":"2017-10-22T09:57:34.911+0000","title":"Account Hacked/recovered/banned","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Recently attempted to start playing again after an absence of a few years. Password wasnt working so I tried to do the recovery email thing. No emails came my way for 2 days.  I then looked my account up on lolking and noticed it was recently active. Someone was using my account and had changed the email so I wasnt getting the password recovery emails?\r\nSo I wrote in a support ticket and got the support ticket confirmation email... but alongside it I also got a password recovery email... in like the same minute. So I reset my password and started playing. played maybe 5 games and then got banned. Didnt do anything wrong in game.. so I assume I was banned because of the sketchy business with the passwords?? Also worth mentioning is that I used to live in Canada when I was playing before but I now live in Japan.. and who knows where the hacker who was playing my account was located. Anyway, I have ample proof that the account was created by me and I want it unbanned because I didnt do shit! \r\n\r\nI have tried emailing riot but have gotten no response. Any suggestions?","replies":[{"poster":"Broporo","date":"2017-10-22T22:26:34.530+0000","up_votes":1,"down_votes":0,"body":"It looks like this account was banned from a ticket having admitted the buying/selling of this account which is against the ToU. You're welcome to hit us back up in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new) for more context though!","replies":[{"poster":"petscabies","date":"2017-10-23T01:35:11.821+0000","up_votes":1,"down_votes":0,"body":"October 20th 2017, 9:55:13 pm\nHey, after a few years off from the game I tried to log into my old account la few days ago but password was incorrect and I cant get a recovery email. I looked the account up on lolking and apparently someone has been playing it recently... I never sold it or gave anyone the password or anything like that...\n\nAnyway I had some rp and skins and a fully lvled account that I want to get back!! I dont care about the rp I just want the account with its champions and runes etc.\n\nThanks guys!!\n\n\n****\n\nThat was the ticket I submitted.. I admitted to buying or selling my account???","replies":[]}]},{"poster":"petscabies","date":"2017-10-23T01:29:52.097+0000","up_votes":1,"down_votes":0,"body":"What?!? I never bought nor sold this account. thats bullshit. the ticket I submitted said nothing of the sort!!","replies":[]}]}