{"poster":"Get Jïnxed","date":"2018-04-08T01:52:13.144+0000","title":"amo league of legends, pero odio jugarlo","subforum":"Charlas Generales","up_votes":2,"down_votes":11,"body":"&iquest;Que pasar&iacute;a si te dijera &quot;Yo Amo League of Legends, Pero odio Jugarlo&quot;\r\n\r\nUno de los juegos que amo fue lentamente transform&aacute;ndose en alguien demente, y es el que me ha dado HORAS de entretenimiento lentamente hizo que me preguntara \r\n\r\nPor que lo sigo jugando?\r\n\r\nPero nunca terminara..\r\n\r\nUna vez albert einstein dijo &quot;Locura es hacer la misma cosa una y otra vez esperando que el resultado cambie&quot; Mira, por mucho tiempo cre&iacute; que mis acciones ten&iacute;an un efecto en la comunidad alcanzando a todos los jugadores... pero nunca llegamos a eso\r\n\r\nEn el momento que descargamos el juego elegimos un nombre de invocador pero no sab&iacute;amos que seriamos colocados en un mundo en el que sentir&iacute;amos como si estuvi&eacute;semos pasando por emociones\r\n\r\nEl mundo no sabia que cuando comenz&aacute;ramos nuestra primera partida yo se que tu recuerdas, yo se que tu puedes recordar eso que cuando la partida comenz&oacute; que nac&iacute;a alguien mejor dentro de nosotros y que dese&aacute;bamos Vencer!\r\n\r\nAlgo que nosotros dese&aacute;bamos, algo que nos pas&aacute;bamos la noche para conseguir, el juego era bonito.. m&aacute;gico.. y apenas te dabas cuenta que no hab&iacute;a ninguna meta ninguna composici&oacute;n de equipo era mejor que la otra pues todo jugador era inocente pues no sab&iacute;amos la diferencia entre poder de habilidad o poder de ataque y diariamente perd&iacute;amos la partida intentando jugar un swain AD\r\n\r\nPero no nos importaba.. pues est&aacute;bamos muy ocupados intentando comprar ese filo del infinito o cualquier otra cosa que quisi&eacute;semos comprar, y como resultado Ellos fedearon, nosotros fedeamos pero de alguna u otra forma eventualmente despu&eacute;s de lo que parec&iacute;a haber sido una eternidad conseguimos terminar con nuestra primera victoria y al final todo eso vali&oacute; la pena...\r\n\r\nToda la frustraci&oacute;n..\r\nToda la falta de comunicaci&oacute;n..\r\nLas veces que perdimos la paciencia NO IMPORTARON\r\n\r\nPORQUE LA VICTORIA ERA UN MOMENTO DEFINITIVO QUE PROBABA QUE HAB&Iacute;AMOS MEJORADO\r\n\r\nUsamos algunas skills, llegamos a top de alguna forma NADA NOS POD&Iacute;A PARAR, LA BATALLA ESTABA GANADA! ESTO SE HAB&Iacute;A ACABADO.. TERMINADO, Fuimos tan felices...\r\n\r\nMas dentro del dif&iacute;cil camino fue donde todo comenz&oacute; incluso ahora no lo comprendo por que ellos no sab&iacute;an donde fallamos pero en alg&uacute;n lugar de la linea pensamos que Conseguir una victoria era mas importante que nuestros compa&ntilde;eros y jugar este juego paso de ser una lucha para mejorar a ser una excusa para insultar\r\n\r\nY as&iacute; fue decidido quien era realmente mejor \r\nComo si nunca hubi&eacute;semos cometido el mismo error\r\nDe intentar jugar fuera de la meta\r\nPero en vez de mostrar algo de paciencia se llenan de odio\r\n\r\nY ahora siempre que veo a un player insultando a otro..\r\nSiento como si mi coraz&oacute;n se quebrara..\r\nPor que esas personas que consideramos TOXICA\r\nEs alguien que NOSOTROS creamos.. y me duele\r\n\r\nY ese sentimiento no consigue encontrar una sola partida en que las personas traten las unas a las otras decentemente\r\n\r\nY me duele ver a las personas Insultando solamente por que alguien no le gusto algo\r\n\r\nYA TENGO 5 ENEMIGOS EN EL OTRO TEAM, PORQUE TENGO QUE LIDIAR CON OTROS 4 ENEMIGOS EN MI TEAM SOLO POR QUE FALLE EL SMITE\r\n\r\nLas personas tratan a la comunidad como si no fueran parte de ella.. Pero lo somos, no tenemos como esconder eso\r\n\r\nSi league of legends fuera una cosa viva estar&iacute;amos destruidos ahora mismo.. esto necesita parar\r\n\r\nAhora mismo estoy dando el paso inicial\r\n\r\nYo amo league of legends pero odio jugarlo\r\n\r\n&iquest;Quieres una raz&oacute;n para cambiar? escoge una\r\n\r\nMi raz&oacute;n es que quiero ese sentimiento de vuelta\r\n\r\nQuiero esa sensaci&oacute;n de estar en una partida con completos extra&ntilde;os pero verlos como IGUALES\r\n\r\nTraigamos eso de vuelta, extra&ntilde;o sentir eso \r\n\r\nTu tienes que ser el cambio que deseas ver en el mundo \r\n\r\nEntonces cambia...","replies":[{"poster":"Rynx","date":"2018-04-08T01:53:04.571+0000","up_votes":8,"down_votes":0,"body":"Si vas a hacer el copy paste del video, por lo menos pone el original en ingles.","replies":[{"poster":"Champi4UP","date":"2018-04-08T02:44:08.496+0000","up_votes":1,"down_votes":0,"body":"Link del vídeo porfa","replies":[{"poster":"Get Jïnxed","date":"2018-04-08T03:55:57.744+0000","up_votes":2,"down_votes":0,"body":"aqui hay uno no sabia q habia hasta video xD https://www.youtube.com/watch?v=nmKKMn1uyrQ","replies":[{"poster":"Champi4UP","date":"2018-04-08T04:09:29.741+0000","up_votes":1,"down_votes":0,"body":"Pasa que el texto por sí solo no provoca la misma sensación que la voz del tipo (en inglés), la música y el video con todo lo viejo, la emoción que le pone, esa cosa te da ganas de hasta llorar, y recordé que ya lo había visto hace 4 años :v","replies":[]}]}]},{"poster":"Get Jïnxed","date":"2018-04-08T01:56:45.726+0000","up_votes":1,"down_votes":0,"body":"+1 por pillo","replies":[{"poster":"Get Jïnxed","date":"2018-04-08T01:57:34.544+0000","up_votes":1,"down_votes":0,"body":"es la primera vez q lo leo y queria q otra gente lo viera :)","replies":[]}]}]},{"poster":"Katastrofica","date":"2018-04-08T02:07:14.314+0000","up_votes":4,"down_votes":0,"body":"Si tuviese una runa por cada vez que veo un post sobre este video Ya habría terminado de correr {{champion:13}}","replies":[]},{"poster":"Get Jïnxed","date":"2018-04-08T03:26:55.454+0000","up_votes":1,"down_votes":0,"body":"jajaj no sabia q todos conocian esto pero bueno lo comparti y ya no tiene nada de malo","replies":[]},{"poster":"MEU DEUS MANITO","date":"2018-04-08T03:11:28.634+0000","up_votes":1,"down_votes":0,"body":"mira vos che","replies":[]},{"poster":"Score","date":"2018-04-08T02:15:29.324+0000","up_votes":1,"down_votes":0,"body":"Porque no lo borras y ya.. nadie te extrañara","replies":[]},{"poster":"ParedSinRevoque","date":"2018-04-08T02:02:08.235+0000","up_votes":1,"down_votes":0,"body":"¿No era mas facil el video? osea poner el link y ya.\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}