{"poster":"Kim114","date":"2017-06-04T22:25:22.146+0000","title":"Insulti selezione campione: soluzioni?","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Vengo insultato nelle selezioni campioni spesso per pick poco piacevoli come Fizz o Ekko full ap top, oppure Sion jng full tank, che la gente non conosce e/o odia e mi flamma con aggettivi che non ho mai tradotto per mia grande paura come Dumb, P****y che s&ograve;, oppure kid (bambino, questo lo so), fu**ing troller ecc.\r\nio rispondo con TY e starto, e spesso doggiano, ma non mi sembra giusto che restino impuniti...","replies":[{"poster":"Jon Moxley","date":"2017-06-04T22:31:59.918+0000","up_votes":2,"down_votes":0,"body":"In champ select e nella schermata di fine game possono augurarti le peggio cose e non è reportabile, sorry. Fin tanto che non flammano in game non stanno infrangendo nessuna regola","replies":[{"poster":"Kim114","date":"2017-06-05T08:18:19.416+0000","up_votes":1,"down_votes":0,"body":"Allora devo aspettare di entrare in game? Oooook ty","replies":[]}]},{"poster":"Etoclas","date":"2017-06-05T11:05:52.987+0000","up_votes":1,"down_votes":0,"body":"Significa che ancora ascolti gli altri giocatori offensivi. Non farlo più e ti godrai questo bel gioco, che purtroppo molti non vedono come tale, ma come un posto dove sfogarsi.","replies":[{"poster":"Kim114","date":"2017-06-05T13:43:01.836+0000","up_votes":1,"down_votes":0,"body":"io li ignoro, ma mi dispiace che continuano indisturbati, ecco tutto","replies":[{"poster":"Etoclas","date":"2017-06-06T07:19:30.088+0000","up_votes":1,"down_votes":0,"body":"Anche nella vita di tutti i giorni esistono persone del genere, sta a te dar loro la giusta importanza.\nLa mamma dei cretini è sempre incinta.","replies":[{"poster":"Kim114","date":"2017-06-06T15:04:59.533+0000","up_votes":1,"down_votes":0,"body":"Gg","replies":[]}]}]}]},{"poster":"JRobich","date":"2017-06-06T07:24:03.225+0000","up_votes":1,"down_votes":0,"body":"se già in champ select flammano allora fai un troll pick tipo soraka jung e cerca di far dodgare qualcuno altrimenti dodga tu... tanto quasi sicuramente è game lose....","replies":[]},{"poster":"Master Caos98","date":"2017-06-05T08:46:04.146+0000","up_votes":1,"down_votes":0,"body":"Fregatene,gioca è basta.","replies":[]},{"poster":"Nabbomaster","date":"2017-06-04T23:01:39.091+0000","up_votes":1,"down_votes":0,"body":"ma e semplice preselezioni, poi te ne vai su google, tanto quando tocca a te ritorna la schermata di lol, locki e torni su google finche non senti il suono di quando si tippano i campioni alla fontana","replies":[]},{"poster":"xBlitza","date":"2017-06-05T00:36:35.248+0000","up_votes":1,"down_votes":1,"body":"Ekko top è un pick normalissimo, come Akali o Lissandra, che hanno in testa quelli?","replies":[]}]}