{"poster":"Kim114","date":"2016-08-12T22:25:18.437+0000","title":"Surrend","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Questo video &egrave; la prova...\r\nA volte il surrend non serve, serve solo mettersi d&#039;impegno\r\nhttps://m.youtube.com/watch?v=uKeahtql4tI{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"I Homura I","date":"2016-08-13T07:09:25.667+0000","up_votes":2,"down_votes":0,"body":"Io non surrendo mai a meno che non mi sto più divertendo. La partita non finisce finchè i nemici non distruggono il nexus.","replies":[]},{"poster":"MainLuxSupport","date":"2016-08-13T08:10:19.970+0000","up_votes":2,"down_votes":1,"body":"una persona mentalmente sana non parlerebbe di impegno ma di stupidità, idiozia o usa quale altro termine che vuoi per rappresentare LeeSin che ha giocato sempre da solo, all'interno della base nemica ad inibitori distrutti.\nquesti video sono il male della community perché esaltano prestazioni che andrebbero in realtà punite.\nQuesto significa come trasformare una FreeWin in una sconfitta a discapito di altri 4 che sono costretti a perdere per l'egoismo, idiozita, stupidità etc di un singolo sfigato.\nsi vede come era in vantaggio di 3 livelli e finisce stando sotto di 5. palese malato mentale.","replies":[{"poster":"JLuke","date":"2016-08-14T11:44:40.826+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MainLuxSupport,realm=EUW,application-id=MJVj50Jw,discussion-id=hl1dUggk,comment-id=0001,timestamp=2016-08-13T08:10:19.970+0000)\n>\n> una persona mentalmente sana non parlerebbe di impegno ma di stupidità, idiozia o usa quale altro termine che vuoi per rappresentare LeeSin che ha giocato sempre da solo, all&#x27;interno della base nemica ad inibitori distrutti.\n> questi video sono il male della community perché esaltano prestazioni che andrebbero in realtà punite.\n> Questo significa come trasformare una FreeWin in una sconfitta a discapito di altri 4 che sono costretti a perdere per l&#x27;egoismo, idiozita, stupidità etc di un singolo sfigato.\n> si vede come era in vantaggio di 3 livelli e finisce stando sotto di 5. palese malato mentale.\n\nPotevi dirlo in un modo più carino? Comunque hai ragione. +1 :3","replies":[]}]}]}