{"poster":"Kim114","date":"2017-08-15T22:24:33.693+0000","title":"Aiuto per un niubbo","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Non faccio molte ranked e sono nuovo del mestiere, quindi chiedo a chi fa soloranked 24/24, come faccio quando ho un troll in team?\r\nmi riferisco alla selezione campione, con first time {{champion:6}} con {{summoner:1}} {{summoner:14}} in jng (game di 2 giorni fa)\r\noppure quello appena finito con Kayn mid e Annie top, con 3 ignite in team e e 0 tp\r\nse per ogni game cos&igrave; dovrei leftare, finirei almeno 1/4 della giornata ad aspettare per le code...","replies":[{"poster":"Ahrity","date":"2017-08-17T16:52:21.787+0000","up_votes":2,"down_votes":0,"body":"Già anche io trovo molti troll, feeder e perfino gente che va afk, molto stressante ma senti una cosa, non importa quanta coda ti danno e quanto tempo dovrai aspettare se vedi che il tuo team non ti piace quitta.","replies":[]},{"poster":"Dr LouD","date":"2017-08-16T07:38:13.863+0000","up_votes":1,"down_votes":0,"body":"Passi avanti\n\nIl troll ti puo capitare 1 game su 20, sono gli altri 19 che contano\n\nSemplicemente lefta o se non vuoi gioca e reporta il troll.","replies":[{"poster":"Kim114","date":"2017-08-16T12:25:28.190+0000","up_votes":1,"down_votes":1,"body":"Da B5 a S5 ho incontrato almeno 1'troll a game, o un hardfeeder che non conosceva la legge de:\nUna situazione uguale non può portare ad una situazione diversa; O ACCIDENTI SE SEI 0/7 LA SMETTI DI DARE ALTRE KILL PROVANDO A FARE 1 V 1 CON QUELLO 10/0!?!!!","replies":[{"poster":"Dr LouD","date":"2017-08-16T12:27:28.681+0000","up_votes":2,"down_votes":0,"body":"Troll =/= giocatore scarso\n\nCapite la differenza","replies":[{"poster":"Kim114","date":"2017-08-16T12:44:27.035+0000","up_votes":1,"down_votes":0,"body":"Un giocatore scarso però di solito accettq i consigli del team, questo ignorqva tutto e tutti e andava 1v5...","replies":[{"poster":"Dr LouD","date":"2017-08-16T13:29:27.545+0000","up_votes":2,"down_votes":0,"body":"Un giocatore scarso che accetta i consigli non rimane scarso per sempre\n\nUn giocatore scarso che non accetta i consigli rimane un giocatore scarso\n\nEsistono tutti e due i tipi, l'uno non esclude l'altro","replies":[]}]}]}]}]},{"poster":"zYaichi","date":"2017-08-15T23:12:09.142+0000","up_votes":2,"down_votes":0,"body":"Aspetti che il game finisce\n0 tp =/= troll","replies":[{"poster":"Kim114","date":"2017-08-16T12:22:38.035+0000","up_votes":1,"down_votes":0,"body":"In game si sono comportati esattamente come avevo previsto \nAnnie ha fatto schifo, l ho gankata ma è stato inutile perché anche se si feedava quel poco, mandava la R nella direazione opposta o missava le spell... ho gankato, ha continuato a farmare e dopo che sono morto mi ha flammato\nKayn almeno era decente, ho fatto 3 gank e ha fatto 2 kill lui e io una, ma dopo tutto ha continuato a non poter fare nulla da solo, ma almeno evitava di feedare","replies":[]}]},{"poster":"mikellazzo","date":"2017-08-15T22:40:24.558+0000","up_votes":2,"down_votes":0,"body":"carria","replies":[]}]}