{"poster":"Neo Gaussrik","date":"2015-06-19T20:50:33.901+0000","title":"Jugadores que se molestan en seleccion de campeones","subforum":"Charlas Generales","up_votes":16,"down_votes":2,"body":"Como jugador, soy del tipo de persona que a menudo va por los campeones menos populares, y como consecuencia, me toca mucho ver este tipo de situaciones.\r\n\r\nDa la impresion de que la comunidad tiene una lista (implicita) de &quot;campeones que no sirven&quot;, y luego saltan a criticar o directamente a insultar cuando muestras que los eliges.\r\n\r\nQuisiera dejar en claro que no hablo acerca de jugadores que eligen campeones tratando de dar la impresion de trollear- claro que entraria en panico si veo a alguien elegir a {{champion:268}} , tomar {{summoner:2}} y {{summoner:21}} , y decir que va jg. Me refiero a cuando alguien simplemente elige un campeon que se ve poco (por ejemplo, {{champion:83}} ) y lo lleva en el carril y el rol para el cual el campeon fue dise&ntilde;ado.\r\n\r\nQue hacen en estas circumstancias? Claramente, si tus compa&ntilde;eros te insultan por chat entonces de acuerdo al codigo es correcto reportarlos por abuso verbal, pero si simplemente empiezan a alegar acerca de tu eleccion y luego te culpan cuando alguna jugada sale mal- como reaccionan? Como piensan que un jugador ideal debiera reaccionar?","replies":[{"poster":"DLeppard","date":"2015-06-19T21:00:44.719+0000","up_votes":5,"down_votes":0,"body":"Miren si yo fuera rioter y me insultaran de tal manera , moveria hilos internos de cualquier manera posible y les banearia las cuentas.\n\nMas de uno lo habra pensado e.e","replies":[{"poster":"Neo Gaussrik","date":"2015-06-19T21:05:15.290+0000","up_votes":14,"down_votes":0,"body":"No se trata acerca de si puedo o no.\n\nSi yo, como Rioter, vivo una realidad de juego distinta a la de los jugadores- si me aislo de los trolls y los AFKs y los insultos y la toxicidad- entonces no tendria conocimiento absolutamente critico para mejorar la experiencia de los jugadores.\n\nAsi que, si, chicos, les aseguro que a nosotros tambien nos pasan todas estas cosas- y a menudo. Y por eso espero ansioso a que se aplique el nuevo sistema de comportamiento para que mejore el servidor.\n\nPero, no, no voy a banear a nadie porque \"soy Rioter\". :P Si me trollean, voy a usar las mismas herramientas que ustedes (reportar), y si siento que no pasa nada me voy a frustrar igual que ustedes.","replies":[{"poster":"Accelerator","date":"2015-06-19T21:16:04.336+0000","up_votes":5,"down_votes":0,"body":"Se desmintió el mito de que los Rioters NO tienen sentimientos ;) D","replies":[]}]}]},{"poster":"Accelerator","date":"2015-06-19T21:05:26.889+0000","up_votes":6,"down_votes":0,"body":"ME pasa exactamente lo mismo cuando pickeo {{champion:133}}  Top... :( la verdad da bronca te insultan si te matan,no te gankea el jungla,y si ganas linea no dicen nada... {{item:3073}}","replies":[{"poster":"Neo Gaussrik","date":"2015-06-19T21:06:44.351+0000","up_votes":11,"down_votes":0,"body":"Jugando a Bardo, me ha pasado sentir que el mayor elogio posible es cuando tu equipo finalmente se calla y deja de insultarte por elegirlo. XD\n\nAhi es cuando sabes que realmente lo estas haciendo bien!","replies":[{"poster":"Main Lee Cýrus","date":"2015-06-20T01:05:45.883+0000","up_votes":3,"down_votes":0,"body":"El gordo Bardo esta op pero solo los coreanos saben apreciar su habilidad con las campanas\n\n{{champion:432}} {{champion:432}} {{champion:432}} {{champion:432}} {{champion:432}} {{champion:432}}","replies":[]},{"poster":"Accelerator","date":"2015-06-19T21:12:52.372+0000","up_votes":3,"down_votes":0,"body":"Amén hermano!Jajaja :D","replies":[]},{"poster":"Master Sicarius","date":"2015-06-20T20:18:49.110+0000","up_votes":1,"down_votes":0,"body":"Yo odio jugar con bardo pero no porque es mal supp sino porque los otros no saben como aprovecharlo,pones un altar no lo usan gastan las pociones o se matan,tiras un portal y lo siguen por torre en vez de meterse y despues cuando salis a juntar campanitas te echan la culpa de que no ayudas (cuando le dejaste altares y no lo agarran) de que no estas(cuando con un portal llegas en un segundo)y que la manqueas con la ulti(cuando con esa ulti cagaste un dragon [LIKE A BOSS]... pero despues tienen razon la manqueo mucho XD)","replies":[]}]}]},{"poster":"Desaroll","date":"2015-06-19T21:17:39.681+0000","up_votes":5,"down_votes":0,"body":"Es cierto que si llevas campeones \"populares\" en sus lineas \"populares\", puedes jugar mal y no te dirán demasiado.\n\nPero, si juegas mal en una linea o un champ impopular, y te va mal, ahí es donde llegan las criticas a montones.\n\n--------------------------------------------------------------\n\nDesde el punto de vista de jugadores a los que les toca alguien con un pick raro, opino:\n\nLo correcto, creo  yo, cuando llevas un champ que \"no está en la meta\", como dicen, es que hayas evaluado bien la viablidad de tal campeón en la linea.\n\nMuchos, intentando imitar a youtubers famosos, hacen combinaciones no convencionales, pero, se olvidan del detalle de que muchos de esos youtubers piensan en detalle lo que harán, como y por qué.\n\nPersonalmente, me molestan los picks \"raros\", cuando:\n\n1) No son avisados y arruinan la combinación de equipos: La combinación de equipo clasica actual es: Top: Tanque, Jg: Tanque/Daño, Mid: APC, Bot: Tirador ADC y Support. Si vas a ir un mid de daño fisico, avisale al top y al jungla, que son los que tendrán que cubrir la falta de daño magico.\n\n2) No pensaron en como enfrentarse al escenario tipico: Si vas con un \"adc\" melee a bot, pero no pensaste en que la falta de rango te hará comerte mucho poke del muy probable tirador enemigo, estás regalando una linea, practicamente.\n\n3) Las necesidades de ese champ en esa posición afectan al equipo: Si vas con un champ jg que necesitarán que le ayuden con el primer, segundo o hasta tercer campamento, estás molestando al equipo.\n\nFuera de eso, no me molesta lo que hagas. Yo voy support. Señalame al que tengo que ayudar, y listo. No me importa si es un Xerath ADC o lo que sea. (Tendré mis dudas, pero no afectará mi juego).\n\n--------------------------------------------------------------\n\nDesde el punto de vista de un jugador que hace un pick raro, y es molestado al respecto:\n\n1) Analiza tu partida. ¿Realmente hiciste algo mal, o el otro solo buscó una excusa? No mires solo el KDA, examina el farm, el daño hecho, el daño recibido, y tu colaboración en objetivos. A veces, ese Garen AP top puede tener buen KDA y buen farm, pero si para eso dejaste que el otro top asegurara dragón y hiciera ganks a tu equipo, algo estás haciendo mal.\n\n2) Fuiste con un pick raro, tienes que estar preparado para las criticas. No por nada son picks raros. En muchos casos, lo son por que perdieron viabilidad por X motivo. Si crees que no es cierto, por las dudas, examina tu partida. Si te critican, algo vió el resto. Antes de creer que es prejuicio, asegurate de no haber cometido errores con el pick que hiciste.\n\n3) Si estás seguro que tu pick no tuvo fallas (¿Poca armadura en las runas?, ¿Malas maestrias?, ¿Nada de nada? ¿Seguro?), si no que fué un counterpick del contrario, el problema que hubo fue una jugada del equipo enemigo para debilitarte (Jungla campeando, darle el buff a tu adversario de linea para ayudarle, etc.), o otro error de tu equipo (No recibiste ganks, o buffs, cuando los pediste y distes oportunidades para que te los den, por ejemplo), trata de explicar la situación. A pesar de las palabras agresivas, del otro lado de la PC de tus compañeros hay una persona que habla y piensa. Aunque en ese momento no te crea, o te siga acusando, puede que tus palabras le hagan pensar y, tal vez, solo tal vez, hay una posibilidad entre cien de que corrija su error, compense la jugada contraria, o, al menos, te deje de criticar sin fundamentos.\n\nEn resumen: Si vas con un pick considerado \"raro\", debes estar listo para ser criticado, y tomarlo de forma constructiva. Ahora, si eres \"flameado\", insultado, o directamente molestado, report y confía en Riot. Los castigos, aunque a veces tarde, terminan llegando.\n\n----------------------------------------------------------------\n\nUps, quise poner una opinión y se convirtió en Coloquio.\n\nSuerte!\n\n{{champion:117}}","replies":[]},{"poster":"LuciusMagnum","date":"2015-06-19T21:10:34.093+0000","up_votes":1,"down_votes":8,"body":"y la verdad es que hablando sinceramente por lo menos a mi si me molesta que pickeen campeones \"malos\". No me pongo a flamear ni nada pero uno intenta ver los campeones \"ideales\" en su equipo para armarse de confianza. Por ej en vez de una {{champion:133}} top como dijo el de arriba, prefiero que vaya un tanque como {{champion:122}} {{champion:54}} {{champion:86}} etc, para tener un equilibrio en el equipo","replies":[{"poster":"Neo Gaussrik","date":"2015-06-19T21:12:08.695+0000","up_votes":1,"down_votes":0,"body":"Me parece valido.\n\nQue campeon consideras \"malo\", y por que?\n\nEdit: Aps, respondi antes de que alcanzaras a editar.\n\nOK, pero entonces tu alegato es mas que nada por balance del equipo? Que tal si tu equipo ya tuviera a {{champion:113}} en la jungla, y a {{champion:201}} de soporte? Todavia te molestaria ver a {{champion:133}} en top?","replies":[{"poster":"LuciusMagnum","date":"2015-06-19T21:13:58.228+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=e5XX6l3y,comment-id=00030000,timestamp=2015-06-19T21:12:08.695+0000)\n>\n> Me parece valido.\n> \n> Que campeon consideras \"malo\", y por que?\n\nCampeones como {{champion:133}} en top porque ya hay un adc en bot, y se necesita tener mas equilibrio en el equipo. Principalmente si tengo un equipo lleno de tanques me da mas tranquilidad.\n\nEn ese caso no creo que me molestaria, porque por lo menos ya hay tanques. A menos que decida ir con {{champion:133}} contra algun campeon que sea obvio que no va a poder ganarle","replies":[{"poster":"iMonsterQ8","date":"2015-06-19T21:59:52.770+0000","up_votes":1,"down_votes":0,"body":"Si eso pasa en Blind pick, {{champion:133}} no tiene la culpa de que le halla tocado una{{champion:92}} o{{champion:24}}\n\nEDIT: Puedes ganar con cualquiér campeón contra cualquiér campeón... Siempre que sepas ocuparlo... o el jg te gankee seguido y el enemigo no compre wards.","replies":[{"poster":"LuciusMagnum","date":"2015-06-20T00:06:36.285+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=iMonsterQ8,realm=LAS,application-id=v7qsfXsE,discussion-id=e5XX6l3y,comment-id=0003000000000000,timestamp=2015-06-19T21:59:52.770+0000)\n>\n> Si eso pasa en Blind pick, {{champion:133}} no tiene la culpa de que le halla tocado una{{champion:92}} o{{champion:24}}\n> \n> EDIT: Puedes ganar con cualquiér campeón contra cualquiér campeón... Siempre que sepas ocuparlo... o el jg te gankee seguido y el enemigo no compre wards.\n\nsisi obvio que se puede ganar pero solo me da mas tranquilidad un top como {{champion:86}} , etc que un adc. Despues uno nunca sabe que pasa en la partida","replies":[{"poster":"iMonsterQ8","date":"2015-06-20T00:49:46.008+0000","up_votes":4,"down_votes":0,"body":"**Claro, Pero no por eso tienes que llamarlos campeones MALOS**","replies":[]}]},{"poster":"Kaziklí Bey","date":"2015-06-20T22:11:51.358+0000","up_votes":2,"down_votes":0,"body":"{{champion:6}} top el  unico counter q le encontre es el jungla porq la verdad no e conocido top q me gane aun asi me bardean porq llevo {{summoner:14}}  y no {{summoner:12}}  es bastante molesto","replies":[]}]},{"poster":"Funes7","date":"2015-06-19T22:31:14.203+0000","up_votes":3,"down_votes":0,"body":"Dejame decirte hermano mio que estas equivocado en algo que es fundamental.\nCito: \"principalmente si tengo un equipo lleno de tanques me da mas tranquilidad\".\n\n¿Sabes una cosa? el juego es versatil, si no lo fuera tener mas de 100 campeones no serviria y ranked se jugaria con  todos los tankes.\n\nHay campeones que no son tankes pero hacen daño en % de vida. que son el terror para los tankes como {{champion:28}} {{champion:96}}  etc.\n\nEntonces la composiciion a veces pasa mas por tener buenas TF que por tener o no tener tankes.\n\nSi yo en un equipo soy heimer (por decir alguno) y mis 4 compañeros son {{champion:432}} {{champion:36}} {{champion:12}} {{champion:32}} \nNo estaria \"seguro\" sino triste, ya que no tendria daño suficiente el equipo. Dandole la posibilidad al rival de eliminar el \"carry\" de mi team (siendo heimer por ejemplo) y despreocupandose de los tankes que dañan poco.\n\nAdemas de lo que ya respondieron todos como que todos los campeones son buenos, solo resta saber jugarlos.\nY que pueden elegir a un {{champion:122}} y ser horrible y elegir a un {{champion:3}} y ser OP (como yo :P)","replies":[]}]}]}]},{"poster":"J7ycjHAfiL","date":"2015-06-19T22:17:49.315+0000","up_votes":4,"down_votes":0,"body":"En esas \"circumstancias\" como decirlo... desde ya no me importa lo que digan los demas sobre que campeon uso, porque el objetivo de este juego para mi.. mi meta es usar lo que yo elijo sin usar las metas de los demas. ese es mi nindo.\n\nEs lo que me divierte del juego, porque voy a pickear cosas que usan en el torneo mundial?, yo tengo mente unica.. y mientras yo tenga en mis manos.. a la poderosa Annie.. quien sabe que pasara de mis enemigos cuando ella camine en la grieta directo hacia ellos..{{champion:1}} \n\nEn resumen.. lo que cualquier persona puede pensar sobre \"oh dios, me han dicho que no es del meta annie mid, que hare, fallare fallare perdeere\" yo lo gasto en pensar en como carrear la partida.. \n\nAtte: Dasant ko best annie all servers {{champion:1}}","replies":[{"poster":"ALEXKOND","date":"2015-06-20T01:55:39.925+0000","up_votes":2,"down_votes":0,"body":"Te apoyo, aunque en mi caso uso a la mudita {{champion:37}} , el sentimiento es compartido","replies":[]}]},{"poster":"Brightram","date":"2015-06-19T21:33:12.990+0000","up_votes":4,"down_votes":0,"body":"Gaussrik, la verdad sos una joya de la comunidad. Sí, hay Rioters que se preocupan y que participan comentando y dando opiniones, pero vos sos el más  \"Humano\" que vi. Estás siempre comentando desde el lado del jugador, de los que hacen a lol lo que es, buscando soluciones para beneficiarnos todos tantolos players como el mismo Riot, sinceramente GRACIAS por este tipo de post y demás comentarios. (Soy una Fangirl) PD: sos Diamond III? Que tipo pro :P","replies":[]},{"poster":"Crappy","date":"2015-06-20T17:20:35.715+0000","up_votes":1,"down_votes":3,"body":"Mira yo estoy en contra de la gente que no respeta metas... aveces puedo ser un poco intolerante, lo reconozco, pero seamos sinceros, si jugamos ranked, COMO MINIMO, (sobre todo en ligas bajas) pretendo ver picks que respeten la meta... No podes pickear una {{champion:67}}  top un {{champion:35}}  jungla {{champion:40}}  supp {{champion:22}}  adc y {{champion:61}}  mid en una misma partida.... Estas regalando la posibilidad de que con 1 champ \"Facil\" te ganen horriblemente.. estamos en la meta de los tanques y aveces veo que sacan {{champion:35}}  contra {{champion:254}} , o contra {{champion:32}} .... que pensas que va a suceder??  son composiciones situacionales que pueden servir, pero solo si todos tienen afinidad y saben a que van a jugar... Ayer Gonto estubo en el P&R y dijo algo que muchos no tienen en cuenta \" Shaco no rinde en la meta actual\" No es por agarrarmela con ese champ en particular... pero es verdad le cuesta limpiar jg, sus ganks ya no son TAN efectivos, y  son esos champs que necesitan lvls e items... 2 cosas que para los jg en early y casi casi hasta mid game, podes no tener e igual seguir en competición... (MI OPNION)","replies":[{"poster":"HornBore","date":"2015-06-20T17:45:20.796+0000","up_votes":4,"down_votes":0,"body":"Jajaja sos el típico que dice \"Shaco useless\", reconozco que Shaco en esta temporada bajó mucho su poderio con respecto al meta anterior. Pero de ahi a insultar a alguien solamente por elegirse a Shaco... después el Shaco stompea y te quedás callado (como hace la mayoria).\n\nP.D: Shaco es counter de amumu.","replies":[{"poster":"Crappy","date":"2015-06-20T18:09:50.349+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=HornBore,realm=LAS,application-id=v7qsfXsE,discussion-id=e5XX6l3y,comment-id=00280000,timestamp=2015-06-20T17:45:20.796+0000)\n>\n> Jajaja sos el típico que dice \"Shaco useless\", reconozco que Shaco en esta temporada bajó mucho su poderio con respecto al meta anterior. Pero de ahi a insultar a alguien solamente por elegirse a Shaco... después el Shaco stompea y te quedás callado (como hace la mayoria).\n> \n> P.D: Shaco es counter de amumu.\n\nmira yo uso amumu y no pierdo contra shaco en esta season... No dije que lo puteo, dije que me da bronca... porque dispones la partida a las manos de shaco y no al team.... Si el stompea ganamos y si el juega medio pelo estamos todos en problemas porque el top tampoco es tanque... entonces que nos queda? pushiemos porque te ven y estas muerto... Olvidate de la tf... en quien vas a dividir el daño?","replies":[{"poster":"IGNORE ALL","date":"2015-06-20T21:57:26.862+0000","up_votes":1,"down_votes":0,"body":"Yo juego shaco mid ap :D","replies":[]}]}]},{"poster":"MilaN PR","date":"2015-06-20T23:46:05.908+0000","up_votes":1,"down_votes":0,"body":"Si sabes usar a {{champion:35}} , a un {{champion:32}}  lo destruis en su propia jungla y la partida si tu equipo no la deja estar la ganas, ya contra {{champion:254}}  es otra cosa... \n\nPero porque hay que seguir un meta? a mi me bardeaban cuando usaba {{champion:42}}  y ahora es uno de los mejores para soloQ , lo mismo pasa con mi querida {{champion:78}} no la puedo usar ni en normal xq es un campeon \"inutil\" y no te gankean y te dicen que perdes x su culpa, si tan solo supieran que si le ayudas en early dsps es GG {{item:3070}}","replies":[{"poster":"tacito92","date":"2015-06-23T22:02:05.837+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MilaNPR,realm=LAS,application-id=v7qsfXsE,discussion-id=e5XX6l3y,comment-id=00280001,timestamp=2015-06-20T23:46:05.908+0000)\n>\n> Si sabes usar a {{champion:35}} , a un {{champion:32}}  lo destruis en su propia jungla y la partida si tu equipo no la deja estar la ganas, ya contra {{champion:254}}  es otra cosa... \n> \n> Pero porque hay que seguir un meta? a mi me bardeaban cuando usaba {{champion:42}}  y ahora es uno de los mejores para soloQ , lo mismo pasa con mi querida {{champion:78}} no la puedo usar ni en normal xq es un campeon \"inutil\" y no te gankean y te dicen que perdes x su culpa, si tan solo supieran que si le ayudas en early dsps es GG {{item:3070}}\n\nyo lo jugue en solo q al corki y me flamearon :C","replies":[]},{"poster":"SrElite","date":"2015-06-22T03:23:15.040+0000","up_votes":1,"down_votes":0,"body":"Poppy es una mierda en fase de líneas, pero si la sabes usar, no morirás, farmearás bien y en mid/late vas a ser una bestia, lástima que no se valore como lo que es...","replies":[]}]}]},{"poster":"Arshei","date":"2015-06-20T20:26:52.692+0000","up_votes":1,"down_votes":1,"body":"so pickieas a Urgot top no esperes insulto, es un champ que deja sintank al team, y que su ulti es suicidio","replies":[{"poster":"Kaziklí Bey","date":"2015-06-20T22:22:37.419+0000","up_votes":3,"down_votes":0,"body":"eso me demuestra q no sabes usar a urgot o q nunca lo usaste porq estas totalmente equivocado","replies":[]},{"poster":"LaReinaPingüino","date":"2015-06-22T01:43:09.439+0000","up_votes":1,"down_votes":0,"body":"Las veces que he usado a urgot lo he encontrado op, y no he visto ni guias de él, si no fuera tan horrible sería mi main","replies":[]}]},{"poster":"NA MAN GG","date":"2015-06-19T21:40:02.524+0000","up_votes":3,"down_votes":0,"body":"PROPONGO ALGO , que un rioter juege con La comunidad :3 Llenenos de sabiduria","replies":[{"poster":"iMonsterQ8","date":"2015-06-19T21:58:28.701+0000","up_votes":3,"down_votes":1,"body":"Que nos abra nuestro agujero... Y lo llene de sabíduria... \n\n\n\nMalpensados.","replies":[{"poster":"Neo Gaussrik","date":"2015-06-19T22:39:34.680+0000","up_votes":3,"down_votes":0,"body":"Er... pero cada vez que jugamos jugamos con la comunidad, o no? ;)","replies":[]}]}]},{"poster":"DonSai","date":"2015-06-20T07:22:11.612+0000","up_votes":1,"down_votes":0,"body":"suele pasarme un monton cuando pickeo a {{champion:17}}  en top, es un personaje que me divierte bastante usarlo, suelo sufrir un poco contra los asesinos, pero a los tanks los obligo a no poder hacer roaming y de por si teemo es un rompe {{item:3069}}  xD \nuna vez hasta quicieron reportarme desde que inicio la partida practicamente (supuestamente era mi culpa que las lineas estaban perdiendo cuando yo era el unico ganando linea y a parte romeando... o sea que mas quieren? ) que paso? sin querer termine carreando la partida, mid y adc deleteados, runan envenenando al resto de su equipo, muriendo yo pero dejando lo suficientemente bajos de vida al resto para que ganen la tf, pero hay si que se quedaron callados los muy... -_- o sea, en ranked puedo llegar a entender que se enojen por \"salirse del meta\", pero en normales? eso ya es estupido, y según sé, teemo puede ir top o mid asi que :/","replies":[{"poster":"Neo Gaussrik","date":"2015-06-20T18:19:15.352+0000","up_votes":1,"down_votes":0,"body":"Teemo es uno de esos campeones que siempre van a ser conflictivos, porque el es muy poderoso haciendo lo suyo (transformando una seccion del mapa en una trampa y ganando peleas injustas en esa area), pero a la vez viene con el costo de que no es muy confiable en TF debido a su poca resistencia y corto rango.\n\nComo consecuencia, cuando un equipo tiene a Teemo, tiene que adecuarse a que van a tener muchas situaciones de 4v5, y que tienen que buscar peleas en que el equipo enemigo inicie en una zona en la que hay zetas- o evitar las peleas por completo mientras Teemo se lleva objetivos.\n\nA alguna gente no le gusta que otra persona elija sus estrategias por ellos, pero hay muchos campeones que terminan funcionando asi. Por eso, siento que es una lastima cuando un equipo se vuelve muy acido con alguien que esta tratando de ganar, aunque sea a su manera.\n\nTotal, en la variedad esta la diversion, no?","replies":[{"poster":"SrElite","date":"2015-06-20T19:08:45.223+0000","up_votes":2,"down_votes":0,"body":"Zetas? En serio Gauss? {{item:3151}} .","replies":[{"poster":"Neo Gaussrik","date":"2015-06-22T01:53:45.077+0000","up_votes":1,"down_votes":0,"body":"Whoops. O.o","replies":[{"poster":"tacito92","date":"2015-06-23T22:00:51.355+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=e5XX6l3y,comment-id=0021000000000000,timestamp=2015-06-22T01:53:45.077+0000)\n>\n> Whoops. O.o\n\nyo necesito aprender a ignorar pero me da cosa cuando no hay trabajo de equipo y hay bardo en el chat. :C\nhelp :c","replies":[]}]}]}]}]},{"poster":"OG Noah do Bree","date":"2015-06-20T14:59:45.258+0000","up_votes":1,"down_votes":0,"body":"Cuando veo que eligen un campeón en el rol correcto para el que fue diseñado no tengo reacción alguna, si para mi debería ser normal ver a un {{champion:83}} top o un {{champion:432}}  supp, no hay nada troll en eso. \nAhora la cosa es cuando te salís del meta del campeón, ahí me quedo expectante a ver que pasa. Como que me divierto viendo la idea de mis aliados. De hecho el pick mas antimeta de mi equipo es {{champion:53}} mid full ap, y desde que lo usa mi amigo solo perdió una vez, eso si, siempre ganando su linea.\nEse es el tema de los picks \"trolls\" te sacan de la comodidad, ¿como le jugas a ese blitz? eso es lo que me divierte al ver a un aliado desconocido haciendo un pick raro. Siento la necesidad de ver si esa idea funciona y me divierto el triple si lo logra ganar la linea. Por eso creo que la partida que mas disfrute fue en la que fui con {{champion:37}} mid (que me parece una abusadora de linea si se la llevar full ap) terminando 3/0 la fase de lineas.\nEl único problema que tengo es cuando al hacer un pick anti meta, el aliado se queja porque le salio mal, me paso de ver una {{champion:51}} que pidió ir mid cuando le ofrecí ser adc. Se paso toda la partida quejándose del jg porque no estaba siempre en su linea y lo culpaba de su muerte, ahí es donde le pregunte ¿para que vas con un campeón en una posición que no es la mas favorable si te vas a enojar por perder la linea?\nPor eso mi respuesta al post seria:\n¿Tenes ganas de jugar un campeón poco usado? dale total para eso esta\n¿queres jugar un pick raro? es es algo que quiero ver\n¿queres usar a {{champion:268}} supp? Úsalo si me enseñas a hacer un azir-insec","replies":[{"poster":"Neo Gaussrik","date":"2015-06-20T18:23:54.105+0000","up_votes":2,"down_votes":0,"body":"Azir support es el camino. :D","replies":[]}]},{"poster":"d DeadRabbit b","date":"2015-06-20T01:52:34.118+0000","up_votes":1,"down_votes":0,"body":"Todo sería más fácil si los campeones fueran balanceados. League of Legends no es un juego en donde gana los más habilidosos si no los que mejor sabe elegir. ","replies":[{"poster":"Neo Gaussrik","date":"2015-06-20T18:14:46.494+0000","up_votes":2,"down_votes":0,"body":"Realmente sientes eso?\n\nInteresantemente, LoL es uno de los juegos mas balanceados que hay; nuestra comunidad tiene tanta experiencia jugando, que un cambio tan minusculo como incrementar el daño de un campeon en un 2% puede cambiar por completo el meta y llevar a todos a la conclusion de que dicho campeon esta \"Mega OP\"\n\nSiempre van a haber campeones mas y menos poderosos, y ciertamente podemos mejorar, pero a menudo me causan gracia los altos estandares de balance de nuestros jugadores. :)","replies":[{"poster":"Kaziklí Bey","date":"2015-06-20T22:28:03.862+0000","up_votes":1,"down_votes":0,"body":"jajaja nunca jugaste al hon o el dota por dios eso es no estar balanceado en lo personal prefiero el lol","replies":[]}]}]},{"poster":"GødLîkë","date":"2015-06-19T23:33:23.291+0000","up_votes":1,"down_votes":0,"body":"en la s3 se usaba mucho pantheon support, pero todavia no he podido jugarlo d nuevo ya que apenas lo selecciono me flamean :( someday i will pick you panadero (no el del gas pimienta)","replies":[{"poster":"Neo Gaussrik","date":"2015-06-20T18:09:07.830+0000","up_votes":2,"down_votes":0,"body":"Los kill lanes como pantheon o jarvan support dan miedo- hay muchos jugadores que no saben hacerles frente, y terminas saliendo de la linea con muchos kills.\n\nEl problema siendo cuando te topas con un bot enemigo con mucha experiencia, y logran salir de la linea sin morir- y bien, supongo que ahi esta el riesgo de jugar campeones en posiciones no convencionales, no? :)","replies":[]}]},{"poster":"Proteina Whey","date":"2015-06-19T23:12:49.515+0000","up_votes":2,"down_votes":0,"body":"Yo la verdad soy muy novato, apenas juego desde la season 4 y aún  me falta experiencia pero por suerte veo a un Youtuber muy bueno (eldelabarrapan) que es Platino y juega hace muchísimo, el es jungler y de vez en cuando en sus partidas les toca como vos decis {{champion:83}} Top por ejemplo y el nunca flamea ni nada, el lo que hace es adaptarse a ese campeón  y saber cuando y como gankear, dar consejos de que hace mal y que hace bien y todo eso... la verdad gracias a él aprendí a respetar los pick de la gente a los que no estoy acostumbrado, después de todo si lo eligen por algo será. \n\n\nSaludos!","replies":[]},{"poster":"Clary Volve ","date":"2015-06-19T22:08:50.306+0000","up_votes":1,"down_votes":0,"body":"No puedo usar a bardo, O me insultan o trollean, También me paso que uso urgot adc desde que por el lvl 20 me toco en aram y me gusto el champ, Cuando Bjersen lo uso yo lo use  al otro día sali medio mal y me dijieron -\"Tipico rata que ve algo en la Lcs y ya lo copia\" ¿Por qué en U.R.F nadie se enojaba? porque no existia la meta","replies":[{"poster":"Neo Gaussrik","date":"2015-06-19T22:42:48.136+0000","up_votes":2,"down_votes":0,"body":":/ Lamento oir eso!\n\nSi quieres, te puedo dar algunos tips para jugar a bardo y que tu equipo lo reciba mejor?","replies":[{"poster":"Clary Volve ","date":"2015-06-19T22:48:58.526+0000","up_votes":2,"down_votes":1,"body":"Lo tengo en lvl 5 y se jugarlo muy bien, El problem es no poder pickearlo porque me amenazan de trollear, Creo que ese fue el motivo por el cual ahora solo juego clasificatorias por equipo y normals con 4 amigos. Igual cracias Gaussrik sos de los riotters mas copados (por no decir el mejor)","replies":[]}]},{"poster":"Kinniku Buster","date":"2015-06-19T22:33:26.422+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Phoenixgol,realm=LAS,application-id=v7qsfXsE,discussion-id=e5XX6l3y,comment-id=000b,timestamp=2015-06-19T22:08:50.306+0000)\n>\n> No puedo usar a bardo, O me insultan o trollean, También me paso que uso urgot adc desde que por el lvl 20 me toco en aram y me gusto el champ, Cuando Bjersen lo uso yo lo use  al otro día sali medio mal y me dijieron -\"Tipico rata que ve algo en la Lcs y ya lo copia\" ¿Por qué en U.R.F nadie se enojaba? porque no existia la meta\n\nUrgot ADC bien empleado es un pick muy molesto y seguro de hecho. Lo he probado varias veces como suplemento de AD/Tank cuando ves que todo tu equipo es super flan (yi top y k6 jg por ejemplo) viene de maravilla. Lo mejor, como eres carry la gente te focusea, pero nadie sabe que secretamente eres el tanke....nadie. Ademas prácticamente inutiliza a Katarina que es muy popular en mid casualmente. Es cuestión de practicar nomas con el, confianza en uno mismo y mutear a la gente. EL resto, hazlo como te salga!.","replies":[]}]}]}