{"poster":"Neo Gaussrik","date":"2015-07-29T16:19:51.470+0000","title":"Que representa la curacion?","subforum":"Charlas Generales","embed":{"description":null,"url":"http://img1.wikia.nocookie.net/__cb20121002162226/leagueoflegends/images/6/66/Soraka_OriginalSkin.jpg","image":null},"up_votes":10,"down_votes":2,"body":"Que es la curacion en League of Legends?\r\n\r\nSi han estado prestando atencion a los foros esta ultima semana, probablemente han notado multiples instancias de personas diciendo cosas como:\r\n&quot;Que sentido tiene que una luchadora/espadachina cure?&quot;\r\n\r\nExaminemos esta pregunta. ^^\r\n\r\nPrimero: Quienes curan en LoL?\r\n\r\nLo primero que se viene a la mente es, obviamente, {{champion:16}} , una campeona cuya historia y kit estan centradas en su capacidad como curandera. Un ente espiritual encarnado, Soraka es capaz de magicamente restaurar la salud a un cuerpo herido.\r\n\r\nLuego, tienes campeones que curan mediante medios inusuales, pero tampoco son cuestionados, pues son &quot;magicos&quot; y tienen una especie de logica estetica. Asi sea mojando {{champion:267}}, soplando {{champion:40}}, tocando musica {{champion:37}} o simplemente porque &quot;cristales&quot; {{champion:44}}, la curacion magica esta mas o menos bien establecida y aceptada.\r\n\r\nPero, esperen: estos no son todos los campeones con habilidades curativas, verdad?\r\n\r\nPor ejemplo, no olvidemos a {{champion:8}} , quien no cura a otros pero se cura a si mismo mucho. Su explicacion tambien es magica- robarle la sangre a un enemigo sirviendo para curar vida tambien tiene un sentido estetico. Un poco menos obvio es {{champion:50}} , quien te lanza... cuervos? Y, por algun motivo magico, esto lo cura tambien.\r\n\r\n... como pueden ver, la lista se vuelve extra&ntilde;a.\r\n\r\nPero esperen! No todas las curaciones son &quot;magicas&quot; en el sentido de alguien lanzando hechizos. Tambien tenemos aquellos campeones que se curan por sustancias; {{champion:36}} ha sido transformado en una bestia que regenera por sus experimentos, y {{champion:27}} bebe alguna especie de mezcla quimica para activar su regeneracion.\r\n\r\nPero que hay de {{champion:19}} ? El hambre que siente lo... cura? Cuando te golpea con su garra?\r\n\r\n{{champion:5}} ? Su grito de guerra lo cura cuando golpea a alguien con una lanza? Que exactamente acerca del estilo Hiten cura las heridas de {{champion:39}} , y por que el lanzar sus espadas la revitaliza?\r\n\r\n&quot;Pero espera, Gaussrik; todos esos campeones se curan a si mismos. Curar a otros es distinto.&quot;\r\n\r\nAh, si? Que me dicen de {{champion:12}} ? Sus rugidos curan a otros de la misma manera que los gritos de Xin Zhao lo curan a el.\r\n\r\nQue esta pasando aqui?\r\n\r\nY bien, volvemos al problema real: que representa la barra de vida de un campeon? En verdad es Vayne una mujer tan dura que puede sobrevivir y moverse normalmente tras tres tiros del rifle de Caitlyn?\r\n\r\nAl final, las barras de vida representan muchas cosas. Pueden ser heridas fisicas; de acuerdo a su propia logica, Soraka puede curar estas. Pero tambien puede ser cansancio, o sentirse desmoralizado y derrotado; un rugido triunfal de un aliado bien puede devolverte los animos para seguir luchando.\r\n\r\nY bien, espero que esto les sea de ayuda para entender la logica detras de las curaciones, y porque aunque algunas ({{champion:16}} ) nos sean mas intuitivas que otras ({{champion:39}} ), hay cabida para todas en nuestro juego.\r\n\r\nSaludos, y suerte en sus partidas!","replies":[{"poster":"Kyousuke","date":"2015-07-29T16:24:23.849+0000","up_votes":2,"down_votes":0,"body":"yo sigo esperando un paladin :/ al estilo garen o rework a garen con una cura al estilo pala del wow XD","replies":[{"poster":"ALEXKOND","date":"2015-07-29T16:26:41.151+0000","up_votes":6,"down_votes":0,"body":"Bien podría ser el rework de Taric que ocupe ese rol","replies":[]},{"poster":"Neo Gaussrik","date":"2015-07-29T17:24:17.355+0000","up_votes":3,"down_votes":1,"body":"Evitamos crear campeones que sean tan estereotipicos; si lo puedes describir tan facilmente como \"Un paladin\" o \"Un pirata\", entonces va en contra de nuestros objetivos.\n\nSi, \"un pirata\". Hay una razon por la cual re-hicimos a Gangplank, y hay todo un evento para darle mas contexto y profundidad.","replies":[{"poster":"ALEXKOND","date":"2015-07-29T17:28:42.892+0000","up_votes":1,"down_votes":0,"body":"No entiendo bien a que te referís. Todo en Gangplank grita pirata {{summoner:31}}","replies":[{"poster":"rokushoger","date":"2015-07-29T17:42:57.547+0000","up_votes":1,"down_votes":0,"body":"Totalmente de acuerdo, y mf que es? una constructora? obviamente es una pirata, como galio es una gargola, y como shivana es un wyvern, no hay vuelta.","replies":[{"poster":"Neo Gaussrik","date":"2015-07-29T18:07:03.676+0000","up_votes":5,"down_votes":4,"body":"Miss Fortune no es pirata y se sentiria tremendamente ofendida se la llamaras asi.","replies":[{"poster":"rokushoger","date":"2015-07-29T18:25:45.981+0000","up_votes":3,"down_votes":0,"body":"Definición de pirata rae:\nhttp://buscon.rae.es/drae/srv/search?id=GNNOVsNfFDXX2mckbaf0\nLore en la página de Lol de Miss Fortune:\nhttp://gameinfo.las.leagueoflegends.com/es/game-info/champions/missfortune/\n\nAhí en la Real Academia Española dice en uno de los significados que Pirata significa \"Persona que, junto con otras de igual condición, se dedica al abordaje de barcos en el mar para robar.\"\nDado que para que algo quede comprendido en un término debe cumplir al menos con uno de sus significados, y teniendo en cuenta que Sara Fortune tiene un barco (según el lore, dice \"Su éxito le proporcionó los medios necesarios para adquirir de forma legítima su propio barco\") con el cual persigue barcos piratas con el fin de (según de nuevo el lore) \"encontrar al pirata que mató a su madre\" (digo, supongo que persigue en mar abierto, dado que para algo tiene un barco, y además es difícil que un pirata se quede siempre en tierra). Y dado que no creo que tenga un lindo trabajo de oficina, y a que debe pasar bastante tiempo en el mar, creo que podemos dar por hecho que el abordaje a barcos de otros piratas y (posterior a capturarlos o no) la apropiación de sus riquezas es lo que le da su sustento (o sea les roba a los ladrones, pero sigue siendo robo) entonces yo creo que si, podemos llamarla pirata según la definición en idioma español. \nAhora claro, si \"pirata\" en su juego significa otra cosa, please ilustrennos y cuenten su definición y que sería Miss Fortune.\nAdemás de todo eso, como que la vestimenta está un poco inclinada a la que usa un pirata no? O sea es una Gankplank mujer.","replies":[{"poster":"Neo Gaussrik","date":"2015-07-29T19:00:25.517+0000","up_votes":2,"down_votes":1,"body":"Lo que ella hace es cazar recompensas.\n\nCuando alguna autoridad (o lo que pasa por autoridad en Aguas Turbias) pone una recompensa por la captura o muerte de algun criminal, ella va en su busqueda.\n\nEs distinto a estar abordando barcos con el proposito de robar.","replies":[{"poster":"Yrox the Third","date":"2015-07-29T20:39:32.617+0000","up_votes":4,"down_votes":0,"body":"So the bootyhunting for the bountyhunter?","replies":[]},{"poster":"rokushoger","date":"2015-07-29T19:48:31.282+0000","up_votes":1,"down_votes":0,"body":"A, buen punto ahí, o sea que a ella le pagan por capturar a esos criminales, o sea que no se lleva los botines de los barcos pirata que asalta, entonces está bien y tenés razón. \nhttp://41.media.tumblr.com/tumblr_lvrfsv7mdR1qibz0jo1_r2_500.png\nEs de macho aceptar los errores XD","replies":[{"poster":"Excorpion","date":"2015-07-29T20:38:38.129+0000","up_votes":1,"down_votes":0,"body":"Los Caza Recompensas no necesariamente son personas que obedecen a la ley, y Miss Fortune es una de ellas. Caza Recompensas es un oficio, no una forma de vida, ser Pirata, es una forma de vida. Un Caza recompensas puede ser bueno, puede ser malo, la cosa es que en lo que es su oficio se desempeña de manera perfecta, lo que haga después es cosa suya, incluso, obedecer o no el objetivo que le hayan dado.","replies":[{"poster":"rokushoger","date":"2015-07-29T22:30:00.997+0000","up_votes":1,"down_votes":0,"body":"Perdón, no entendí tu punto, que quisiste decir?","replies":[]}]}]}]}]},{"poster":"Pwao","date":"2015-07-29T18:10:58.237+0000","up_votes":4,"down_votes":0,"body":"MF si es una pirata, sólo que es como Luffy, una pirata \"buena\" que está muy buena.","replies":[]}]},{"poster":"ALEXKOND","date":"2015-07-29T18:57:56.449+0000","up_votes":1,"down_votes":0,"body":"Siempre me molesto que sea mitad \"dragón\". Es mitad wyvern, rito pls fix","replies":[{"poster":"rokushoger","date":"2015-07-29T19:51:06.988+0000","up_votes":1,"down_votes":0,"body":"Sep, membranas entre las alas en vez de apendices separados como alas, no hay vuelta.","replies":[{"poster":"Pwao","date":"2015-07-29T20:19:11.156+0000","up_votes":1,"down_votes":0,"body":"Yo creo que es mitad dragón (Porque su padre era un dragón), pero como Shyvana es un híbrido, se trasforma en un wyvern, o en un dragón que es similar a un wyvern, producto de la hibridación, por no ser un dragón completo. Así que decir que es mitad wyvern sería incorrecto, si su padre es un dragón.","replies":[{"poster":"rokushoger","date":"2015-07-29T22:31:56.618+0000","up_votes":1,"down_votes":0,"body":"Pero nunca de una cruza entre humano y dragon puede salir un wyvern, o sea es como decir que entre un hombre y un toro sale un medio gallina en vez de minotauro XD, además que tiene todas las características de un wyvern y ninguna de un dragón, incluso la forma en que tira fuego es de wyvern XD. Capaz que nos estan diciendo que el padre era dragón y en realidad es otro wyvern más XD.","replies":[{"poster":"Pwao","date":"2015-07-29T23:07:13.291+0000","up_votes":1,"down_votes":0,"body":"Ok:\n\n-Tú dices que es un wyvern porque lo parece (No tiene las alas separadas de los brazos, etc.)\n-Yo digo que es semidragón, que producto de la hibridación, parece un wyvern.\n-Dependería de rito aclarar esa parte, pero yo expongo la que me parece la explicación más lógica. Si rito dice que el padre de Shyvana era un dragón, sería razonable pensar que en el mundo del lol, un híbrido entre humano y dragón puede parecer similar a un wyvern, ya que se produce una modificación estructural producto de la recombinación genética.\n\n-La comparación con el toro y la gallina etc., es absurda, no tiene lógica. En la fantasía es común que los dragones (De todos los tipos, de todos los elementos), dracos, wyrm, wyvern, e incluso los long (Dragones orientales), etc., se relacionen, que se parezcan, y que están emparentados. Todos se consideran dragones de distintos tipo, y son polimórficos como los perros. Eres el primer individuo que leo que dice que entre un hombre y un toro sale un medio gallina. Eso no tiene sentido ni siquiera como ejemplo para tratar de ridiculizar mi razonamiento.","replies":[{"poster":"rokushoger","date":"2015-07-30T11:08:28.716+0000","up_votes":1,"down_votes":0,"body":"Pucha che, estan todos sensibles, no te intentaba ridiculizar nada, fue solo un paralelismo para mostrar como ME SONÓ A MÍ, nada más.\nEstá bien son dos puntos de vista, solo te digo que según lo que he leído de la mitología los wyvern son una especie de lagartos super desarrollados que no estan emparentados con los dragones, mientras que los dragones no pertenecen a otra sub especie de animal, son dragones y punto (por eso lo del toro y la gallina, que son dos especies distintas). Pero está bien, nunca hice el comentario con intención de ofender, te pido disculpas si te lo tomaste mal, me parece que debe ser mi forma de expresarme porque ya me pasó con otro usuario hoy mismo XD.","replies":[]}]}]}]}]}]}]},{"poster":"Neo Gaussrik","date":"2015-07-29T18:09:50.537+0000","up_votes":2,"down_votes":3,"body":"Antes, si te encontrabas con alguien disfrazado de Gangplank, era facil confundirlo con alguien simplemente usando un tipico disfraz \"de pirata\".\n\nAhora al menos requires un disfraz de -ese- pirata; nadie confundiria un cosplay de Jack Sparrow con uno de Gangplank, y ojala nadie confunda a Gangplank con \"cualquier pirata\".\n\nY... bien. Hay que avanzar un paso a la vez. :P","replies":[{"poster":"ALEXKOND","date":"2015-07-29T19:03:56.387+0000","up_votes":2,"down_votes":0,"body":"Honestamente no veo el problema con confundir un personaje con lo que representa.\nNo hay forma de saber quien es Gangplank si uno no conoce el juego, de la misma forma que uno no podría identificar quien es Jack Sparrow si nunca vio las películas.\n\nEn todo caso si antes se parecía de alguna forma a Jack Sparrow, ahora se parece aún más a Barbossa.","replies":[]}]}]}]}]},{"poster":"HyenaLoL","date":"2015-07-29T18:28:58.073+0000","up_votes":5,"down_votes":0,"body":"{{champion:19}} expresa su curacion desde lo animal alimentarse para sanarse \ny tanto {{champion:39}} con su estilo joniano de lucha (muy ligado a algo espiritual y profundo), como {{champion:5}} con su estilo de voluntad y disciplina pueden explicar las curaciones por cosas subjetivas\n\n{{champion:114}} es un duelista, duelo es 1v1, no entiendo porque curaria a los demas\n{{champion:12}} no esduelista, es un tank, rugido triunfal se puede caracterizar como algo que aumenta el vigor en combate, algo que motiva y de esa forma alivia a los demas es por eso que explica la curacion","replies":[{"poster":"Neo Gaussrik","date":"2015-07-29T18:56:40.679+0000","up_votes":2,"down_votes":3,"body":"Porque aunque sea duelista, esta participando en un combate de equipo.\n\nEl verla demostrar su habilidad motiva y da animos a los demas, explicando su curacion.","replies":[{"poster":"Yitán","date":"2015-07-30T21:10:53.760+0000","up_votes":1,"down_votes":0,"body":"eso no tiene logica....\nes como decir que la ulti de tristana cura porque sus aliados se ven asombrados por el tremendo disparo que pego...\nen fin, excusas baratas","replies":[]},{"poster":"HyenaLoL","date":"2015-07-29T19:20:15.874+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=ttJmdZEL,comment-id=000d0000,timestamp=2015-07-29T18:56:40.679+0000)\n>\n> Porque aunque sea duelista, esta participando en un combate de equipo.\n> \n> El verla demostrar su habilidad motiva y da animos a los demas, explicando su curacion.\n\ntouche (cosa que recomiendo pidas a brujo que ponga como dialogo de muerte para el rework), lo compro, y me impresiona tu creatividad/ capacidad de responder a todo :P","replies":[{"poster":"JACKY FANBOY","date":"2015-07-30T02:51:47.762+0000","up_votes":1,"down_votes":0,"body":"es increible xD, aunque no tenga sentido la respuesta jasjajsjas","replies":[]}]}]}]},{"poster":"Sir Crucifix ","date":"2015-07-29T17:30:54.850+0000","up_votes":3,"down_votes":0,"body":"Porque un curandero no se autocura ? deberia autocurarse y no depender de acertar una estrellita \n\n{{champion:16}} Que vuelva a curarse , si no esta roto este personaje","replies":[]},{"poster":"Essos","date":"2015-07-29T16:27:50.983+0000","up_votes":3,"down_votes":0,"body":"No entiendo el punto del post pero bueno e.e\n\nTodo cura. Te compras la espada sanguinaria y cualquier AD se cura. Mismo con vamp de hechizo aunque no se note tanto.\n\nComo cualquier juego, debe de ser posible curarse. Y algunos personajes comprenden en su kit, recursos para curarse a si mismo u a otro.","replies":[{"poster":"JACKY FANBOY","date":"2015-07-29T17:09:17.815+0000","up_votes":3,"down_votes":0,"body":"quieren alivianar el error que cometieron con fiora","replies":[]}]},{"poster":"GinTaicho","date":"2015-07-29T16:49:55.942+0000","up_votes":3,"down_votes":0,"body":"Si es de esa forma entonces la curación de la nueva Fiora es por \"ganar el duelo\" y eso contaría cono una mejora moral la cual cura como el grito de Alistar o Xin Zhao, y si el enemigo no muere entonces es como \"rompí todos tus flancos, yo gano el duelo de esgrima!\" y eso es una \"victoria\" para Fiora, o al menos eso entendí y me parece razonable.\n\nPero teno una sola pregunta, ¿por que curar a sus aliados? entiendo que sea una victoria para Fiora, pero no comprendo muy bien en que parte del duelo entran sus compañeros (si, es un juego en equipo pero de ser así los aliados de Fiora también podrían romper los puntos débiles que ella vea)","replies":[{"poster":"Neo Gaussrik","date":"2015-07-29T17:27:01.250+0000","up_votes":3,"down_votes":2,"body":"Porque LoL es un juego de equipo, y cualquier campeon tiene que tener sentido en el contexto de ese enfrentamiento.\n\nPor lo mismo, no pudimos dejar que Ekko en efecto retrocediera el tiempo. Lo que el campeon hace es una cosa, y su representacion en el juego siempre sera imperfecta y limitada.","replies":[{"poster":"GinTaicho","date":"2015-07-29T17:49:56.151+0000","up_votes":1,"down_votes":0,"body":"Eso explica el porque ahora tiene más habilidades de \"duelista de esgrima\" y eso me agrada, siempre me ha gustado cono las habilidades pasivas o definitivas reflejan la temática del campeón hasta donde pueda.\nHablando de eso tengo una pregunta sobre un tema parecido, con el rework de Warwick (no estoy preguntando cuando será) me parece algo confuso cual será la temática que se conservará, ya que el \"cazador\" o \"depredador\" es algo que vemos más con Rengar o Kha´Zix o incluso Nidalee. ¿se le dará otro enfoque al lobo o su temática será pulida y mejorada como ocurrió con Sion?","replies":[{"poster":"Neo Gaussrik","date":"2015-07-29T18:10:39.134+0000","up_votes":4,"down_votes":1,"body":"Estas haciendome preguntas hipoteticas de un rework hipotetico del cual no he escuchado nada. XD\n\nLa respuesta es: no se! :)","replies":[]}]}]},{"poster":"destructor369","date":"2015-07-29T17:29:12.483+0000","up_votes":4,"down_votes":1,"body":"no siempre las peleas entre duelistas eran 1 vs 1 ,algunas veces eran varios duelistas peleando al mismo tiempo, cuando uno ganaba el duelo el autoestima de sus compañeros aumentaba y la de sus enemigos bajaba.\n\nes bastante simple de entender :p","replies":[]}]},{"poster":"Dio","date":"2015-07-29T19:44:24.388+0000","up_votes":1,"down_votes":0,"body":"con todo eso que escribieron ahi me surge la duda, ademas de las barras de vida ahora van a poner barras de stamina, estado psicologico y energia a todos los personajes? si es asi acuerdense de la furia (?)","replies":[{"poster":"Neo Gaussrik","date":"2015-07-29T20:14:02.638+0000","up_votes":2,"down_votes":0,"body":"Nah. :)\n\nO sea, dudo que lo hagamos. El proposito del juego no es representar fidedignamente el mundo de runaterra; su proposito principal sigue siendo el divertir, y las barras de HP funcionan perfectamente bien en ese sentido.","replies":[{"poster":"Dio","date":"2015-07-29T22:07:39.732+0000","up_votes":2,"down_votes":0,"body":"ya me parecia que era muy bueno para volverse algo similar al metal gear solid en ese sentido\n\nPD: ya que estamos, bufeen a soraka","replies":[]}]}]},{"poster":"Pwao","date":"2015-07-29T17:42:51.142+0000","up_votes":2,"down_votes":0,"body":"Yo creo que los rioters están viendo mucho anime. La nueva R de Fiora es como esa técnicas místicas que, bajo ciertas circunstancias, si se cumplen ciertas condiciones, producen un nuevo efecto distinto, como una invocación. Hay varios animes donde una cosa invoca a otra sin mayor relación lógica. Hasta ahora las curaciones en el LOL eran más coherentes (No tiene nada de extraño que cualquier mago pueda sanar, Soraka y Bardo usan sus poderes estelares, Nami es una hidromante, otros usan magia del sonido, del aire, o hasta el poder de las gemas, etc., Fiddle y Swain pueden robarle vida a sus enemigos, esa es su magia. Mundo es un combo entre Hulk y Wolverine, y los científicos locos son capaces de cualquier cosa, Vladimir es como un vampiro y Wawi es como un hombre lobo, criaturas de las que se dice que poseen capacidades curativas excepcionales, los gritos de guerra producen efectos mágicos en los videojuegos desde hace tiempo, como en el Diablo 2 y 3, etc.) La R de Fiora tendría más sentido si sólo curase a ella misma, como la R de Irelia. La pregunta entonces es: ¿Como es que una **luchadora duelista**, una especialista en **combate físico**, puede **curar a sus aliados** de una forma tan potente y extensa? ¿Con el mismo poder con el que funciona el tarot? ¿Les presta a sus aliados sus habilidades de hiper regeneración? ¿Con su voluntad del guerrero, que es tan grande que es capaz de alterar la realidad, romper las barreras del espacio y el tiempo, y trascender hacia el más allá? ¿La respuesta está en tu corazón? Tal vez nunca lo sabremos.","replies":[{"poster":"Neo Gaussrik","date":"2015-07-29T18:11:15.877+0000","up_votes":1,"down_votes":1,"body":"Igual que lo hace Alistar- como exprese en el post original.\n\nPor que tiene mas sentido que solo se cure a si misma?","replies":[{"poster":"Pwao","date":"2015-07-29T19:40:14.659+0000","up_votes":1,"down_votes":0,"body":"El Rugido Triunfal entra en la categoría de los gritos de guerra => Magia, efectos mágicos como auras y buff que se han vuelto una tradición en los video juegos, como expliqué en mi post. Se trata de un tipo de magia especial que pueden usar los guerreros de combate físico. Xin Zhao y Rengar también se curan con gritos de batalla. Otros que usan magia de gritos de guerra son por ejemplo Tryndamere y Sivir. De esta manera compensan su carencia de habilidades mágicas más tradicionales. Fiora también podría usar magia este tipo de magia, pero tendría que ponerse a gritar, lo que no combinaría con su temática. Tal vez podría cantar una canción, pero...\n\nTendría más sentido que Fiora sólo se cure a si misma porque en estos mundos de fantasía, los campeones que son guerreros (Y por lo tanto, que no son soporte ni magos), tienden a tener habilidades curativas, pero sólo para si mismos Ej: Garen, WW, Mundo, Aatrox, Gangplank, Akali, Olaf, Nocturne, Irelia, etc.\n\nSUGERENCIA: Se me acaba de ocurrir. Si le vuelven a poner de nombre a la R de Fiora **\"Vals de las espadas\"** (Ya que tiene que moverse ágil y grácilmente por el campo de batalla), convertirían a Fiora en una **\"Blade Dancer\"**. Como \"Dancer\" se conoce a aquellos personajes de varios videojuegos que usan magia relacionada con el baile. Esta pertenece a un tipo de magia que se relaciona con las habilidades físicas como son por ejemplo: La magia que intensifica las habilidades físicas, como la fuerza y velocidad, el manejo del Aura y del Ki (Que todos poseen), las habilidades sonoras como el canto, los gritos de guerra, etc. Con este cambio yo quedaría conforme. (Podrían hacer algunos cambios visuales para hacer que Fiora parezca más que esté bailando, etc., pero con sólo cambiar el nombre esta habilidad ya tendría mucho más sentido).","replies":[{"poster":"Brownie Nuclear","date":"2015-07-29T20:25:50.429+0000","up_votes":1,"down_votes":0,"body":"Sinceramente, me parece que estas buscando una excusa para que Fiora no cure al resto del equipo.\n\nSegùn vos, los gritos de guerra pueden curar, pero una demostracion exesiva de habilidad no....\n\nUna demostraciòn de habilidad en batalla puede revitalizar las esperanzas y el animo de quienes estàn a su alrededor, de la misma forma que un grito de guerra, y de esto podès buscar informaciòn real a lo largo de la historia real, o podès buscar informacion in-game. Darius en un gran ejemplo de 1 duelista incentivando a las masas a seguir luchando, Aatrox los hace por diversiòn a lo largo de toda su vida.\n\nEspero haberme explicado bien! {{champion:201}}","replies":[{"poster":"Pwao","date":"2015-07-29T21:10:56.833+0000","up_votes":2,"down_votes":0,"body":"El problema es que la nueva R de Fiora carece de respaldo y justificación, incluso dentro de un contexto fantástico. La justificación que algunos quieren darle de que pueda curar una cantidad enorme elevando el ánimo y la esperanza de la gente, etc., me parece muy pobre, si la curación fuese menor y en un área más pequeña, tal vez podría tener algo de sentido, porque Fiora es una espadachina y no una maga espiritual. En un un contexto fantástico más desarrollado, riguroso y complejo, Fiora tendría que ser una especie de mago espiritual de alto nivel para lograr un hechizo con ese efecto, con esa intensidad. Pero últimamente se me han ocurrido tres ideas que podrían justificar este tipo de habilidad, sólo cambiándole el nombre y sin cambiar las mecánicas:\n\n**Vals de las espadas:**\n\na) Fiora es una **\"Blade Dancer\"** (Un tipo de mago/guerrero que usa magia de baile). Si completa su baile (Las condiciones del hechizo), puede invocar una zona curativa.\nb) Fiora invoca un efecto con el que puede drenar la energia vital de un enemigo, y sanar a sus aliados.\nc) (Combinar las anteriores) Fiora comienza el Vals de las espadas. Si Fiora completa su baile, drena la energía vital de su enemigo para sanar a sus aliados. (Etc., etc, o algo por el estilo).\n\nLa pasiva de Fiora se llama \"**Baile** de Duelista\", así que si se explicita más que Fiora es una especie de bailarina de la espada (\"Blade Dancer\"), voilà, tenemos una R justificada apropiadamente. Podrían incluso cambiarle su título de \"The Grand Duelist\" a \"The Blade Dancer\".","replies":[{"poster":"Brownie Nuclear","date":"2015-07-29T23:05:13.870+0000","up_votes":1,"down_votes":0,"body":"Pero te estàs quedando con 1 sola idea, estàs insistiendo e insistiendo en que Fiora tiene que tener alguna clase de poder magico, cuando su curaciòn no es explicada por magia como la de {{champion:16}} , sino que su perseverancia, su busqueda por la perfeccion, y su estilo inigualable son lo que dan animos y realzan la moral de sus compañeros. \nSi tu visiòn es que las curaciònes en LoL vienen de poderes magicos, entonces nunca vas a poder entender la mitad de los campeones, porque la barra de HP (como se intenta explicar en el post) representa mas que solo una cantidad de heridas, representa salud, y la salud es fisica y mental.\n\nEstoy seguro de que desde que esta charla iniciò, minimamente leiste su historia, y por eso entenderàs que no es una bailariana... es una duelista, de una familia de duelistas.\n\nSu devociòn por mejorar como duelista la llevò a la busqueda de la perfección, y después a intentar probarle al mundo que es una duelista digna.\n\nNo te cierres en que tiene que ser un mago para cargarte la barra de HP.\n\n{{champion:201}}","replies":[{"poster":"Pwao","date":"2015-07-30T00:01:13.221+0000","up_votes":1,"down_votes":0,"body":"Mira, esas expresiones alegóricas de la perseverancia, la búsqueda por la perfección, etc., no tienen mayor sentido para mi. Prefiero algo más riguroso, más concreto, como tomar alguna característica y convertirla en algún arte mágico que canalice y manipule esas energías para conseguir algún efecto. Yo sé que hay muchos coinciden conmigo en esto.\n\nEso de que el HP represente la salud física y mental, etc. yo lo considero válido, el HP puede representar muchas cosas. Pero no coincido con que las habilidades especiales también se justifiquen de una forma tan poco rigurosa y desarrollada.\n\n¿Porqué crees que una duelista no puede ser una bailarina también y combinar ambos artes? Tal vez no conoces mucho acerca de las clases \"Dancer\" en los videojuegos. Por lo general hay quienes consiguen efectos mágicos bailando (Buff, De-Buff, etc.), y están quienes combinan el baile con las artes marciales y las armas. ¿Crees que no leí su historia? En la misma página de la actualización de Fiora se menciona: _\"Gran Duelo es una habilidad totalmente distinta y está diseñada para transmitir a los jugadores de Fiora (y a sus contrincantes) esta sensación de estar en un duelo real, en el que Fiora **baila** alrededor del enemigo tratando de destruir sus puntos débiles mientras este intenta impedirlo\"._ Su misma pasiva se llama \"Baile de Duelista\", por lo que yo sospecho que la idea de Riot es que Fiora sea una especie de Bailarina Duelista, pero no lo han explicitado bien http://las.leagueoflegends.com/es/news/champions-skins/champion-update/campeona-actualizada-fiora\n\nSi Riot explicita que Fiora es una especie de Blade Dancer, estoy seguro que su R tendrá más aceptación (Por ejemplo, de aquellos que jugaron Ragnarok, Lineage 2, etc.), la gente le encontrará más sentido. Al menos yo pretendo entenderla así de ahora en adelante. Me declaro conforme, logré descubrir la verdad por mi mismo. Ahora tan sólo falta que rito ilumine al resto de las mentes. Es simple, Fiora drena la energía vital de su enemigo usando magia que combina la esgrima con el baile.","replies":[{"poster":"Brownie Nuclear","date":"2015-07-30T00:25:00.582+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pwao,realm=LAS,application-id=v7qsfXsE,discussion-id=ttJmdZEL,comment-id=0009000000010000000000010000,timestamp=2015-07-30T00:01:13.221+0000)\n>¿Crees que no leí su historia?\n\nLo que dije es que seguramente la leíste.\n\n> [{quoted}](name=Pwao,realm=LAS,application-id=v7qsfXsE,discussion-id=ttJmdZEL,comment-id=0009000000010000000000010000,timestamp=2015-07-30T00:01:13.221+0000)\n> Si Riot explicita que Fiora es una especie de Blade Dancer, estoy seguro que su R tendrá más aceptación.\n\nJugué juegos con \"Blade Dancers\", de la misma forma en la que jugué aventuras de rol en las que aumentar la moral del grupo no requiere de ningùn poder sobrenatural, no me parece necesario llevar al personaje al punto en que sea equivalente a un personaje de otro juego, para conseguir aceptación.\n\nSi te hace feliz creer que es un Blade dancer, te doy la derecha, se feliz, imaginatela azul y con duales si querès. {{champion:201}}","replies":[{"poster":"Pwao","date":"2015-07-30T01:03:57.931+0000","up_votes":1,"down_votes":0,"body":"\"Si te hace feliz creer que es un Blade dancer, te doy la derecha, se feliz, imaginatela azul y con duales si querès.\" ¿Acaso quieres burlarte de mi? Si ya te aburriste y ya no quieres discutir con razones, dejemos el debate hasta aquí. Pero como conclusión te diré que yo considero que LOL carece bastante de esas expresiones alegóricas de aumentos de moral, ánimo, etc. que poseen algunos otros juegos, en cambio los poderes tienden a justificarse como formas más desarrolladas y concretas de arte mágico, es lo que han buscado los desarrolladores del juego, y no porque otros juegos se tomen se tomen esas licencias significa que en el LOL ocurra lo mismo, esa no es la tendencia del LOL. Fiora no tendría por qué ser considerada una importación de otro juego, así como Nami es como una hidromante, Janna es como una aeromante, Brand es como un piromante, Fiora sería como una bailarina de espadas, y es así de simple, ese es su arte, esa es su magia.\n\nPuedes responderme o hacer lo que te dé la gana.","replies":[{"poster":"Brownie Nuclear","date":"2015-07-30T02:28:06.348+0000","up_votes":1,"down_votes":0,"body":"No intento burlarme de nadie. Vos sos quien escribiò \"Al menos yo pretendo entenderla así de ahora en adelante\",decìs que esa querès que sea tu forma de entender y justificar el personaje, perfecto, yo no tengo mas que decir.\n\nAmbos dimos nuestras opiniones sobre si el campeòn esta bien o mal justificado.\n\nPuedo agregar, si, que cuando decis que \"LOL carece bastante de esas expresiones alegóricas de aumentos de moral, ánimo, etc.\" en mi opiniòn te estas equivocando muy fuerte.\n\nHay muchas habilidades de LoL que estan orientadas por ese lado (ya mencionamos por ejemplo Xin Zhao y Alistar)\n\nY hay aùn màs historias de LoL orientadas por ese lado ( ya mencionamos por ejemplo Aatrox y Darius, ambos siendo el guerrero que mediante su habilidad y convicción, lograron que sus tropas superasen el cansancio y la derrota psicológica, y de esta forma guiárlos a la victoria)\n\nDe nuevo, en ningún momento esto es una burla a tus ideas o pensamientos.{{champion:201}}","replies":[{"poster":"Pwao","date":"2015-07-30T03:00:26.175+0000","up_votes":1,"down_votes":0,"body":"Ok:\n\nTengo cosas que repetir (Porque ya las mencioné antes) de los gritos/Rugidos de Xin Zhao, Alistar y Rengar: \n-Yo los considero habilidades mágicas, es un tipo de arte mágica que usan típicamente los guerreros en casi todos los juegos donde hay magia. Y esta también se justifica porque el efecto es principalmente personal. Que por ejemplo un capitán dé un discurso y con eso cure a todo un pelotón se justifica mucho menos a que un individuo dé un grito mágico y se cure a sí mismo o cure un poquito a sus aliados en un área reducida, gastando algo de mana (Que es un recurso mágico) y/o use el poder de su Energía o Ki (Como lo hacen Shen y otros). Así son las habilidades del LOL. Un guerrero puede curar pero mediante alguna habilidad mágica de guerrero (Un grito de guerra, un rugido, etc., se justifican), pero sólo un poco. Las grandes habilidades curativas se restringen a los magos especializados en curación.\n\nNo estoy discutiendo acerca del lore, que Aatrox y Darius suban la moral de los guerreros en el lore no afecta a las mecánicas del juego. Si yo quisiera representar una subida de moral en el juego lo haría como antes lo hacía Gangplank (Raise Morale), o como lo hace Warwick (Hunters Call). Ahí si está bien representado en el juego un efecto que de alguna manera manipula el ánimo, y que es mágico también porque cuesta mana, etc. Esa si es magia de guerreros que está bien representada: Aumento de velocidad, dura poco, área restringida, etc.","replies":[{"poster":"Brownie Nuclear","date":"2015-07-30T03:49:32.601+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pwao,realm=LAS,application-id=v7qsfXsE,discussion-id=ttJmdZEL,comment-id=00090000000100000000000100000000000000000000,timestamp=2015-07-30T03:00:26.175+0000)\n>\n> -Yo los considero habilidades mágicas, es un tipo de arte mágica que usan típicamente los guerreros en casi todos los juegos donde hay magia.\n\nMe estas diciendo que un grito de guerra es algo magico, cuando eso puede variar segùn el personaje. Y aùn siendo un efecto màgico o no, no cambia el hecho de que un duelista puede tenerlo.\n\n> -Que por ejemplo un capitán dé un discurso y con eso cure a todo un pelotón se justifica mucho menos a que un individuo dé un grito mágico y se cure a sí mismo o cure un poquito a sus aliados en un área reducida\n\nClaramente no has jugado aventuras de Rol (el de mesa, con dados).\n\n> -Las grandes habilidades curativas se restringen a los magos especializados en curación.\n\nEn eso coincido totalmente con vos, pero usando \"grandes habilidades\" en sentido de curaciones de gran cantidad de HP, considero que la curación de Fiora esta bien, pero no tiene que ser excesiva en terminos de cantidad de HP (y las cantidades las maneja Riot junto con el balance del personaje, lo cual es otro tema).\n\n> -Si yo quisiera representar una subida de moral en el juego lo haría como antes lo hacía Gangplank (Raise Morale), o como lo hace Warwick (Hunters Call)\n\nVos no los harìas, pero ya existe, como la curaciòn de Alistar.\n\n> -mágico también porque cuesta mana, etc.\n\nNo todo lo que cuesta mana en LoL es mágico.\n\n{{champion:201}}","replies":[]}]}]}]}]}]}]},{"poster":"Ashley Lea Monde","date":"2015-07-29T23:01:58.718+0000","up_votes":1,"down_votes":0,"body":"Ni te gastes en explicarlo, Gaussrik te va a decir que no es así y punto. Yo ya me cansé sinceramente, opino lo mismo que vos.","replies":[]}]}]}]}]}]}]}