{"poster":"Neo Gaussrik","date":"2017-10-03T21:42:02.622+0000","title":"Hablando sobre jugabilidad: 3 de Octubre","subforum":"Jugabilidad, balance y narrativa","up_votes":15,"down_votes":3,"body":"Hola a todos:\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n**Avisos de siempre**\r\n\r\nEstas publicaciones, a menudo, contienen informaci&oacute;n acerca del trabajo a futuro que estamos realizando o planeando hacer y que no garantizamos que saldr&aacute; para el p&uacute;blico. La naturaleza de dicho trabajo puede cambiar o, seg&uacute;n lo que vayamos descubriendo, algunos proyectos mencionados podr&iacute;an retrasarse o incluso cancelarse definitivamente.\r\nSi desean ver un tuit cada vez que subimos una de estas publicaciones, s&iacute;gannos en: https://twitter.com/RiotMeddler\r\n------------------------------------------------------------------------------\r\n\r\n**Pings de la tabla de puntuaciones**\r\n\r\nEn las notas de la versi&oacute;n 7.19 mencionamos que &quot;Ahora pueden establecer pings para todo en la tabla de puntuaciones. Esperamos que les guste&quot;. Sin embargo, como muchas personas notaron, ese no es el caso. Tampoco es lo que hab&iacute;amos planeado originalmente y, con la falta de comunicaci&oacute;n, todo termin&oacute; en unas notas de versi&oacute;n un poco confusas. Lo sentimos. Lo que s&iacute; es verdad y es lo que hab&iacute;amos planeado inicialmente, es que ahora pueden establecer pings para cualquier objeto de la tabla de puntuaciones, sin importar el jugador ni el equipo. Sentimos que era una herramienta bastante &uacute;til, pero, en contraste, establecer pings para el KDA de otro jugador no es nada constructivo.\r\n\r\n------------------------------------------------------------------------------\r\n\r\n**Usos de Toque de la Muerte &Iacute;gnea y runas**\r\n\r\nYa hab&iacute;amos hablado de esto en otras publicaciones, pero como mucha gente pregunta al respecto, pensamos que vale la pena hablar m&aacute;s acerca de nuestra opini&oacute;n. En el nuevo sistema no hay un remplazo directo para Toque de la Muerte &Iacute;gnea y esto puede implicar que ciertos campeones tengan algunas dificultades. Estuvimos considerando varias opciones que llenaran esa necesidad, pero no encontramos nada que fuera &uacute;til al momento de balancear a los campeones y que tuviera un poco de jugabilidad. Como resultado, lo que haremos es observar a los usuarios actuales de Toque de la Muerte &Iacute;gnea y analizar su desempe&ntilde;o una vez que quitemos el viejo sistema. Muchos de ellos ya deben tener buenas opciones en el nuevo sistema; Fase Veloz se nos hace particularmente atractiva. Sin embargo, si algunos campeones no encuentran un buen reemplazo, entonces le echaremos un vistazo a la combinaci&oacute;n de mejoras individuales de campeones (solo un par importante de ellas se ver&aacute;n afectadas), a fin de priorizar una runa clave nueva que cumpla las necesidades pendientes de aquellos campeones o una combinaci&oacute;n de ambas.\r\n\r\n------------------------------------------------------------------------------\r\n\r\n**Janna**\r\n\r\nLos cambios que realizamos a Janna en la versi&oacute;n 7.19 aumentaron bastante su poder y, como resultado, tuvimos que nerfearla dos veces con microversiones. Tambi&eacute;n estamos testeando otros nerfeos en el PBE, pero hay muchas probabilidades de que no los lancemos. Los estamos probando en caso de necesitarlos, pero, al tiempo de escribir esto, no parece que vayan a ser necesarios.\r\n\r\n------------------------------------------------------------------------------\r\n\r\n**Azir, Xin Zhao, Caitlyn**\r\n\r\nRepasando los otros cambios grandes de la versi&oacute;n 7.19:\r\n\r\n* Azir: Se ve bastante fuerte, aunque por primera vez su desempe&ntilde;o no est&aacute; dividido entre jugadores promedio y jugadores muy h&aacute;biles. Esto nos parece una buena se&ntilde;al, ya que sugiere que la maestr&iacute;a en su uso y la maestr&iacute;a jugando contra &eacute;l est&aacute;n progresando juntas de manera adecuada. Hay sospechas de que lo hicimos demasiado fuerte, pero a&uacute;n tenemos que ver si es el caso o no.\r\n\r\n* Caitlyn: Al parecer est&aacute; en un buen lugar en cuanto al poder, pero es muy pronto para decir m&aacute;s.\r\n\r\n* Xin Zhao: Tambi&eacute;n est&aacute; en un buen lugar en cuanto al poder. Al parecer est&aacute; teniendo un buen desempe&ntilde;o para un campe&oacute;n actualizado; normalmente hay un per&iacute;odo de reaprendizaje y no lo estamos viendo en este caso. Eso puede sugerir que es m&aacute;s fuerte, pero tambi&eacute;n puede significar que sigue siendo un campe&oacute;n bastante accesible, como se hab&iacute;a planeado, y que el per&iacute;odo de reaprendizaje no fue tan dif&iacute;cil como en otros campeones.","replies":[{"poster":"ona3","date":"2017-10-03T22:05:55.073+0000","up_votes":3,"down_votes":2,"body":"no me nerfeen a janna :C me llevó a platinoob junto con mi queridisima jinx\nPD: Juro que si nerfeen a janna o jinx publicare las fotos que tengo de los rioters en donde se puede ver claramente que tienen una lengua viperina y escamas debajo de sus barbas\nsalu2","replies":[{"poster":"LGBT Valentina","date":"2017-10-04T00:08:17.300+0000","up_votes":8,"down_votes":0,"body":"Como subir de elo\n\nPick janna, tocar E\n\nizi","replies":[{"poster":"ImNw","date":"2017-10-04T01:56:40.287+0000","up_votes":2,"down_votes":2,"body":"No men, te olvidas de que si te hacen engage tenes que tocar R, eso es vital","replies":[{"poster":"Vampyrnesa","date":"2017-10-04T02:54:32.597+0000","up_votes":1,"down_votes":1,"body":"ahora decilo sin llorar.","replies":[{"poster":"LGBT Valentina","date":"2017-10-04T03:20:47.852+0000","up_votes":1,"down_votes":0,"body":"pa que\n\nno puedo subir mas xd","replies":[{"poster":"ImNw","date":"2017-10-04T04:17:01.000+0000","up_votes":1,"down_votes":0,"body":"Algunos se toman muy a pecho las jodas, aunque Janna era la Soraka de antes, estar en la backlane nomas. Por lo menos por ahora puede hacer mas que tirar escudos y disengage.\ny al que diga que Janna no tenia un kit toxico, mire a la antigua soraka la cambiaron para hacerla mas interactiva, como Janna eventualmente hace poco.","replies":[{"poster":"Not Personal","date":"2017-10-04T19:17:55.462+0000","up_votes":1,"down_votes":0,"body":"Que bello, curaciones, estrellas generales, REGENRACION DE MANA CON LA E SIN COSTO, esos combos ez+raka eran brutales.","replies":[{"poster":"ImNw","date":"2017-10-04T21:02:34.360+0000","up_votes":1,"down_votes":0,"body":"Esas Q de Soraka midlaner AP, te reducia toda la Rm y te reventaba toda la lane y los champs en una area","replies":[]}]}]}]}]}]},{"poster":"Vampyrnesa","date":"2017-10-04T02:54:09.826+0000","up_votes":1,"down_votes":0,"body":"ahora decilo sin llorar.","replies":[]}]}]},{"poster":"vaVav","date":"2017-10-03T21:48:11.104+0000","up_votes":1,"down_votes":5,"body":"No viene al caso, pero; ¿Tienen pensado poder configurar botones para sustituir el scroll?\n\nComo todos, lo utilizaba para el zoom de la cámara, pero se me rompió y no encontré la forma de poder sustituirlo por otras teclas.\n\nNo es de vital importancia, pero se me es incómodo en algunas situaciones.","replies":[{"poster":"Dio","date":"2017-10-03T23:48:50.994+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NovaIncipere,realm=LAS,application-id=xQmJPO8F,discussion-id=03jvxF09,comment-id=0000,timestamp=2017-10-03T21:48:11.104+0000)\n>\n> No viene al caso, pero; ¿Tienen pensado poder configurar botones para sustituir el scroll?\n> \n> Como todos, lo utilizaba para el zoom de la cámara, pero se me rompió y no encontré la forma de poder sustituirlo por otras teclas.\n> \n> No es de vital importancia, pero se me es incómodo en algunas situaciones.\n\nen su dia me habia pasado lo mismo, y con un programa se podia asignar el zoom in/out a dos teclas en el teclado, en mi caso era repag y avpag, era bastante comodo","replies":[{"poster":"vaVav","date":"2017-10-03T23:50:05.394+0000","up_votes":1,"down_votes":0,"body":"Eso de utilizar programas de terceros que afecten a la hora de jugar no me va, muy riesgoso.","replies":[{"poster":"ZeNch","date":"2017-10-04T01:43:15.562+0000","up_votes":2,"down_votes":0,"body":"de hecho no! no es una macro es un remapeo... largo de explicar pero ya se hablo del tema...\nLAS MACROS no son ilegales (en competitivo si) pero muchas veces cuando se dice macro la gente interpreta scripts.\n\nMacro = muchas teclas en sierto orden con sierto delay entre cada una... pero el cursor lo moves vos.\nScript = cerra los ojos y juga\n\nIgual si tenes desconfianza hacelo para una personalizada o aram pone el zoom a tu gusto y desinstala el programa.","replies":[]},{"poster":"Dio","date":"2017-10-05T01:27:47.390+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NovaIncipere,realm=LAS,application-id=xQmJPO8F,discussion-id=03jvxF09,comment-id=000000000000,timestamp=2017-10-03T23:50:05.394+0000)\n>\n> Eso de utilizar programas de terceros que afecten a la hora de jugar no me va, muy riesgoso.\n\nla politica de riot afecta al juego, no a tu computadora xd","replies":[{"poster":"vaVav","date":"2017-10-05T01:30:03.483+0000","up_votes":1,"down_votes":0,"body":"Por eso gente fue sancionada tras utilizar programas de grabación.","replies":[{"poster":"Dio","date":"2017-10-05T01:48:48.663+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NovaIncipere,realm=LAS,application-id=xQmJPO8F,discussion-id=03jvxF09,comment-id=00000000000000010000,timestamp=2017-10-05T01:30:03.483+0000)\n>\n> Por eso gente fue sancionada tras utilizar programas de grabación.\n\nbajo esa logica, estamos hablando al punto que tu computadora le pertenece a riot. No verdad? es algo para que se pueda prescindir del scroll, no estas editando nada del juego","replies":[]}]}]}]}]}]},{"poster":"Liliths","date":"2017-10-03T22:21:17.415+0000","up_votes":3,"down_votes":2,"body":"> Azir: Se ve bastante fuerte, aunque por primera vez su desempeño no está dividido entre jugadores promedio y jugadores muy hábiles. Esto nos parece una buena señal, ya que sugiere que la maestría en su uso y la maestría jugando contra él están progresando juntas de manera adecuada. Hay sospechas de que lo hicimos demasiado fuerte, pero aún tenemos que ver si es el caso o no.\n\nYa quieren matarlo por el amor de dios !?\nDejenlo asi, dentro de 1 mes van a estar con mil lios de balance por las nuevas ~~Runas~~ **_Maestrías._**","replies":[{"poster":"Send Núdes","date":"2017-10-04T01:24:34.197+0000","up_votes":3,"down_votes":1,"body":"no paso 1 parche y ya quieren nerfearlo de nuevo. pobre paloma. el odio que le tienen","replies":[]}]},{"poster":"Send Núdes","date":"2017-10-04T01:24:02.836+0000","up_votes":3,"down_votes":2,"body":"Les dejo una.\nNO TOQUEN MAS A AZIR.\nsi quieren que este realmente fuerte. devuelvanle el rango de la q y el cancelar desplazamientos de la R.\nentonces ahi si va a estar fuerte.\npero por ahora esta balanceado.\n52% de winrate esta bien.","replies":[]},{"poster":"The Steel Shadow","date":"2017-10-04T13:43:41.862+0000","up_votes":1,"down_votes":0,"body":"Janna es la support más jugada baneada y con más win rate de la clase, los pickeados mucho nunca superan el 50% y ella tiene 53 según ustedes y 55 en la página que veo\nSi eso no merece bajarle el ad al escudo como último mecanismo de balancearla, entonces qué?","replies":[]},{"poster":"ImNw","date":"2017-10-04T01:55:50.999+0000","up_votes":1,"down_votes":0,"body":"Ya que hablan de Runas, existe la posibilidad de agregar mas runas, tanto runas Claves,mayores y menores expandiendo mas la diversidad? o solo piensan quedarse con 3 arquetipos de runas para cada rama. Y mi otra pregunta es, por que las runas de precision sobresalen tanto a diferencia del resto de las ramas? por lo que veo lejos las mejores runas las tiene la runa de precision(Soy main ADC y es mi punto de vista), por lo menos no veo que muy pocas runas compiten con las runas de Precision","replies":[{"poster":"Tsume Asterisk","date":"2017-10-04T05:37:08.938+0000","up_votes":1,"down_votes":0,"body":"Es chistoso, porque a mi no me parece que sobresalgan más del resto. Las que me parece que sobresalen son las de Inspiración, normal, pues soy main support. Es algo completamente relativo, le encontrarás mayor atractivo a lo que sabes te va a servir. Personalmente considero que las de Brujería son una completa basura, aunque un main mid podría pensar lo contrario.","replies":[]}]},{"poster":"amummUWU","date":"2017-10-04T07:15:15.324+0000","up_votes":1,"down_votes":1,"body":"Oh janna te extrañaré, me sacaste del estiércol con solo una E{{sticker:zombie-nunu-tears}}","replies":[]}]}