{"poster":"Neo Gaussrik","date":"2015-09-04T16:41:05.947+0000","title":"Colosos! Traigan sus preguntas / comentarios aqui","subforum":"Charlas Generales","embed":{"description":null,"url":"http://i.imgur.com/O3mNIni.jpg","image":"http://imgur.com/O3mNInis.jpg"},"up_votes":6,"down_votes":4,"body":"Veo que hay mucho interes por parte de la comunidad acerca de los Colosos, asi que en lugar de responder a un monton de discusiones separadas, los invito a traer sus preguntas o comentarios aqui. :)\r\n\r\nCosas a considerar!\r\n\r\n* Que es, exactamente, un Coloso? Que lo diferencia de un Tanque?\r\n* Que vulnerabilidad comparten todos los Colosos?\r\n* En que contribuye un Coloso a un equipo que otros roles no?\r\n\r\nSaludos! ^^","replies":[{"poster":"Cervedera","date":"2015-09-04T16:55:31.191+0000","up_votes":1,"down_votes":5,"body":"Acabo de jugar contra un coloso <darius> y la verdad me saco mitad de vda en nivel 6 con solo su ulti, sin previamente tener el efecto de sangrado. Yo era Pantheon :s\n\nEdit: Me olvidé de preguntar algo. ¿Ésto va a tener gran repercución en LCS? Ya que veo que ahora son los más baneados en clasificatorias.","replies":[{"poster":"Neo Gaussrik","date":"2015-09-04T16:59:53.841+0000","up_votes":13,"down_votes":1,"body":"A nivel 6, sin objetos ni runas ni maestrias, Pantheon tiene 923 de vida.\n\nLa definitiva de Darius hace 100 + 75% de su bono de AD.\n\nPara lograr quitarte 450 de vida con su definitiva sin sangrado, tiene que haber tenido aprox 466 de daño de ataque extra para llegar a ese numero.\n\nBuen Darius! Me gustaria ver su build. O quizas estas exagerando. ;)","replies":[{"poster":"Cervedera","date":"2015-09-04T17:03:10.179+0000","up_votes":1,"down_votes":6,"body":"nop no exagero.... me agarro con su e, yo tre flash para escaparme y me fajo con su ulti. pero no ubo un basico de por medio. tambien tengo que decir que yo estaba en la mitad de m vida por eso palmé.","replies":[{"poster":"Neo Gaussrik","date":"2015-09-04T17:08:56.703+0000","up_votes":9,"down_votes":0,"body":"Incluso si solo te quito un cuarto de la vida, estas asumiendo que te hizo 225. Bastante mas lograble; solo 166 de daño de ataque extra.\n\nEs lograble con tan solo dos {{item:3031}} s a nivel 6!\n\n... como decia, me parece que exageras. :p","replies":[]}]},{"poster":"soy arawea","date":"2015-09-05T01:48:24.768+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=cXBBnWtI,comment-id=00000000,timestamp=2015-09-04T16:59:53.841+0000)\n>\n> A nivel 6, sin objetos ni runas ni maestrias, Pantheon tiene 923 de vida.\n> \n> La definitiva de Darius hace 100 + 75% de su bono de AD.\n> \n> Para lograr quitarte 450 de vida con su definitiva sin sangrado, tiene que haber tenido aprox 466 de daño de ataque extra para llegar a ese numero.\n> \n> Buen Darius! Me gustaria ver su build. O quizas estas exagerando. ;)\n\npuede queeste exagerando pero digamos que si ya estaba bastante broken y lo buffean aun mas... algo esta mal ahi...","replies":[]}]}]},{"poster":"Amorth Amantini","date":"2015-09-04T17:46:40.763+0000","up_votes":6,"down_votes":3,"body":"Colosos, sinceramente encuentro que es el peor desbalance dentro del juego hasta el momento, en particular Garen, analicemos a este bicho, un tanque, porque no me vengan con cosas Garen a pesar de ser un \"Coloso\" probablemente sea uno de los 3 personajes mas resistentes dentro del juego lo cual lo hace un campeón difícil de matar, y con true damage, un tanque con daño, un tanque asesino... Fak De Loyick. \n\nContextualicemos a este mutante en una Team Fight, anteriormente leí eso de que a un coloso se le mata replegando y atacándolo ¿cómo logras esto en una Team Fight? Ok, todos matando al asesino tanque, y allí ya esta el error focusear un tanque para que no mate a tu asesino es una TF perdida de inmediato, Como vas a replegarte y atacar a un Garen mientras los asesinos del team del mutante te revientan, y lo mas probable es que ese mutante ni siquiera muera, y todo por replegarse y dejando cc al tanque asesino, ahora hagamos lo mismo en la misma Team Fight pero sin focusear al tanque asesino, quizás mates a muchos de su team, pero tambien ese bicho ya habra matado a tu carry con su R en excesivo estupida, y y este girando como un blei blei (o como se escriba) jodiendo a todo tu team, quizas ahora si muera pero tu carry tambien, y vaya a saber Dios si puede hacerse un penta girando como blei blei, Y ni que fuera tan facil escapar de este tanque porque ademas de ser un tanque asesino, le dan velocidad... Ja, Ja, Ja.... \n\nTanques asesinos y como si eso fuera poco con la velocidad de whiss, un aplauso... Balanceado completamente (aplauso, aplauso, aplauso). \n\nY estan actualmente los personajes que realmente deberian tener daño  cada vez peores, personajes como azir, que si, puede tener un gran daño, pero usa mal una q de reposicionamiento y es golondrina muerta, un personaje como azir que cada vez le bajan el daño más y más, que no resiste nada, y estos \"Colosos mutantes\" que resisten y te hacen mas daño que esos personajes. \n\nDeberían replantearse bien estos \"Colosos\" porque como lo dices en la descripción si suena lindo y todo, pero en práctica dentro del juego, opaca mucho a otros roles.","replies":[{"poster":"Neo Gaussrik","date":"2015-09-04T18:00:41.646+0000","up_votes":7,"down_votes":2,"body":"Una pregunta sincera:\n\nSi te expresaras asi cuando hablas con alguien cara a cara, cual crees que seria su reaccion?","replies":[{"poster":"Amorth Amantini","date":"2015-09-04T18:13:32.840+0000","up_votes":3,"down_votes":2,"body":"No lo sé la verdad, depende de la persona, si es alguien delicado de cutis como al parecer lo eres Tú, creo que como lo estas haciendo ahora mismo, y eso de si te expresaras así ¿a que te refieres? No recuerdo haberte, solo di mi opinión de la forma en que yo veo las cosas, y como lo veo, un Coloso es algo bastante desequilibrado dentro del juego, ergo, estúpido.\n\nOtra pregunta sincera pero esta vez de mi hacia ti:\n\nSinceramente ¿crees que un Tanque debería deletear más rápido que el rol que se especializa en eso?\n\nOtra cosa, no te tomes tan ofensivas mis palabras supongo que las tomaste así, más bien tomadlas con algo de humor, las consecuencias de usar al señor sarcasmo ¿No? De todas formas discúlpame si te ofendí con mis palabras o algo por el estilo, pero en eso consiste el sarcasmo dar una opinión a través de ridiculizar el tema.","replies":[{"poster":"Neo Gaussrik","date":"2015-09-04T18:19:37.510+0000","up_votes":8,"down_votes":1,"body":"En serio no ves nada ofensivo aca?\n\n> Tanques asesinos y como si eso fuera poco con la velocidad de whiss, un aplauso... Balanceado completamente (aplauso, aplauso, aplauso).\n\n> Fak De Loyick.\n\nMi punto es el siguiente: si quieres obtener una respuesta de alguien con quien quieres discutir, entonces evita representar su opinion como algo ridiculo o indefendible.\n\nSi todo lo que quieres es desahogarte de una manera que divierta a otros que comparten tu opinion, esta bien- pero entonces no te esperes una respuesta.","replies":[{"poster":"Amorth Amantini","date":"2015-09-04T18:27:04.732+0000","up_votes":1,"down_votes":4,"body":"Primero: Te diría la definición textual de sarcasmo pero mi diccionario esta muy lejos y abrir una pestaña nueva es mucho tedio, si lo comprendieras no actuarias así.\n\nSegundo: Si veo lo ofensivo pero hacia el concepto del Coloso en ningún momento con la persona a quien va dirigido mi mensaje en este caso Tú.\n\nTercero: Ya entendí que eres sensible y te pedí disculpas, disculpas en serio.","replies":[{"poster":"Neo Gaussrik","date":"2015-09-04T18:33:56.850+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=Apocraphex,realm=LAS,application-id=v7qsfXsE,discussion-id=cXBBnWtI,comment-id=00070000000000000000,timestamp=2015-09-04T18:27:04.732+0000)\n> Primero: Te diría la definición textual de sarcasmo pero mi diccionario esta muy lejos y abrir una pestaña nueva es mucho tedio, si lo comprendieras no actuarias así.\n\nLo estas haciendo de nuevo.\n\nTu aseveracion: \"No entiendes el concepto de sarcasmo\" + \"No reaccionarias asi si lo entendieras\", lo cual es, de nuevo, ofensivo.\n\n> Segundo: Si veo lo ofensivo pero hacia el concepto del Coloso en ningún momento con la persona a quien va dirigido mi mensaje en este caso Tú.\n\nNo te pido que estes de acuerdo con los cambios ni que te gusten, solo estoy tratando de ayudarte a expresarte en una manera que inspires a otras personas a discutir en vez de simplemente ignorarte.\n\n> Tercero: Ya entendí que eres sensible y te pedí disculpas, disculpas en serio.\n\nSe aprecia la intencion, pero incluso en tu disculpa incluyes un comentario de tono inapropiado.\n\nSi se lo que es el sarcasmo, y puedes asumir que soy una persona razonable y emocionalmente balanceada al igual que tu. No estoy enojado ni personalmente ofendido, y todo lo que busco aqui es hacerte notar lo siguiente:\n\nPor el tono en el que te expresas, estas incentivandome a no contestar en vez de discutir tus puntos- varios de los cuales son interesantes y pienso que seria valioso que los discutieramos.\n\nQue te parece si lo intentamos de nuevo?","replies":[{"poster":"Amorth Amantini","date":"2015-09-04T18:43:36.536+0000","up_votes":2,"down_votes":2,"body":"Bueno, comencemos de 0, aunque me resulta curioso, percibes mi tono y de seguro de una forma por la cual te resulte mas ofensivo, quizas si estuviéramos realmente cara a cara mi lenguaje para-verbal te demostraría que no es con intención de ofender, pero ya.\n\n¿Que puntos anteriores descritos por mi son los interesantes para usted?","replies":[{"poster":"Neo Gaussrik","date":"2015-09-04T19:08:24.567+0000","up_votes":6,"down_votes":0,"body":"Voy a dejar una respuesta mas arriba con este contenido, para despejar el aire.","replies":[]}]}]}]}]}]}]}]},{"poster":"ManuJG","date":"2015-09-04T17:34:58.194+0000","up_votes":3,"down_votes":0,"body":"Dejaré esto por aqui...\n\nhttps://www.youtube.com/watch?v=HAG6Wr5cKO8\n\n\n\nMás allá del video y de también ver muchos errores de parte del enemigo para cargarse al Darius, siento que la idea de \"colosos\" está muy desbalanceada de lo que solía ser antes. Antes, un \"Coloso\" era alguien que iba a la front line, aguantaba MUCHÍSIMO y molestaba con su kit de habilidades. El coloso ocupaba su rol: Aguantar y desestabilizar. \n\nAhora creo que estamos ante un nuevo concepto de coloso que realmente no lo comparto: El coloso de hoy en día aguanta y DELETEA. \n\nVeo absurdo que Garen pegue 1500 de daño verdadero y no se lo pueda bajar con nada. Que darius pueda hacer frente a 3 carrys él solo y cargarselos a su hombro. Que Skarner con puramente items de vida te aguante la vida en la frontline y desestabilice a todo el equipo rival con su cc constante. Y de mordekaiser no quiero hablar... conozco muy poco al champ, y por lo que vi (New meta morde + support) no sé si es el camino que a mi me gustaría que tome el juego.\n\nLos colosos estaban \"Bien\" antes, no cuando son ahora una mole a toda maquina que iban a por vos y no te dejan respirar ni por 2 segundos hasta que te das cuenta que te mataron. Tal vez hacia falta algun que otro buffo a alguno u otro, pero veo que esta vez se pasó de más la mano.","replies":[{"poster":"Neo Gaussrik","date":"2015-09-04T17:51:16.386+0000","up_votes":4,"down_votes":0,"body":"Te diria que la parte clave es esa: \"Molestaba\".\n\nAguantar muchisimo y molestar no es la fantasia de poder de nadie. Hay numerosos colosos mas saludables que los cuatro actualizados, y ciertamente nadie los describiria como campeones que \"Molestan\" en peleas de equipo; nadie se rie cuando tiene un Nasus o un Udyr pegandoles.\n\nEl coloso de hoy en dia es un campeon resistente al que no puedes ignorar. Tienes que prestarle atencion y evitar que aplique sus mecanicas; no puedes simplemente ignorar a Garen mientras matas al resto de su equipo y lo dejas para el final.\n\nEstos colosos no estaban \"Bien\" antes; tenian un problema de identidad. Los nuevos colosos son campeones a los cuales nadie va a describir como \"molestos\" por su kit de habilidades. Un campeon con esta descripcion es basicamente un tanque inferior; aguanta, pero no contribuye con control de masas, asi que por que lo elegirias por sobre un tanque de verdad?","replies":[{"poster":"FiletDeMerluza","date":"2015-09-04T18:44:52.258+0000","up_votes":1,"down_votes":0,"body":"> El coloso de hoy en dia es un campeon resistente al que no puedes ignorar. Tienes que prestarle atencion y evitar que aplique sus mecanicas; no puedes simplemente ignorar a Garen mientras matas al resto de su equipo y lo dejas para el final.\n\nLa pregunta es, en q parte eso q nombras es sano? En q otro juego tipo MOBA o MMORPG se vio q un personaje de aguante (tanque) haga un daño tan ridiculo como el de estos campeones? \nPara mi, el mejor ejemplo de tanque sano es Maokai, ESO ES UN TANQUE indiscutible, cumple con su funcion, pero jamas vas a ver a un Maokai haciendo un 1 v 4 o haciendo un Pentakill.\n\nUn Garen girando, rompiendote la armadura a cada golpe (Cuchilla Oscura) un ADC dandote con todo lo q tiene, ignorando tu armadura (al momento, tu armadura es inexistente) hacen q un equipo de 5 desaparezca.\n\nEl problema principal es Garen, ya que su E esta muy mal ejecutada in game. Creo q ahi esta su principal problema, ya que la velocidad q le dieron, puede aplicar full stacks de Cuchilla Oscura en muy poco tiempo, mas un Ultimo Suspiro que tenga algun otro personaje, hace que todos los champs sean squishy.\n\nSkarner es manejable, le he hecho frente con una Evelynn (luego de los hotfixes) en tanto no le hagas frente en los cristales.\n\nDarius se suponia que iba a tener un early favorable para ganar linea para luego decaer en el late. Pero todo su kit esta hecho para escalar increiblemente, mas los items nuevos q escalan excelente, es una maquina de matar q no tiene freno.","replies":[{"poster":"Neo Gaussrik","date":"2015-09-04T19:02:19.644+0000","up_votes":2,"down_votes":0,"body":"Garen no es un tanque por defecto; su kit no sirve para iniciar o para resguardar aliados.\n\nCompararlo con tanques no es particularmente util; obviamente Garen va a pasar mas daño que Maokai. Maokai contribuye a su equipo con excelente iniciacion y reduccion de daño, sin mencionar frecuente y poderoso control de masas.","replies":[{"poster":"judas94","date":"2015-09-04T20:55:04.059+0000","up_votes":3,"down_votes":0,"body":"Maokai es un tanque sano y lo nerfean, tal vez la utilidad de Maokai fuera excesiva, pero a su R le pusieron un 100% mas de cd en el ultimo nivel. \nNo veo sano que un personaje como Garen simplemente venga y apretando un botón te haga 800 de daño verdadero a nivel 9 siendo vos un Kassadin que es el \"villano\" porque se hizo una doble en bot, y ademas de eso, ahora el juego le indica cuando te va a matar con su R, no tiene counterplay, no podes esquivarla y el no la puede fallar. Y ni hablemos si estas jugando top y le haces la primera sangre, mejor rezar para que alguien de tu equipo haga un par de kills antes de nivel 6 porque si no te podes dar por muerto.  No voy a hablar de Skarner porque su ban/win ratio lo dice todo bastante claro y ni siquiera le hicieron un cambio mínimo en el ultimo parche.","replies":[]}]}]}]}]},{"poster":"Matrox OpKarthus","date":"2015-09-07T17:32:04.339+0000","up_votes":3,"down_votes":0,"body":"No es dificil jugarle a un coloso, puedes usar 2 metodos, usar counters o bueno \"saber jugarle\" :v\n\n{{champion:122}} aunque no lo crean es facil jugarle, el fuerte de darius es pelear 1vs1 y mientras mas tiempo mas fuerte se hace, por lo que eso se debe evitar y no creerte un rambo contra el, Debes mantener distancia prudente contra su Q, como tiene canalizacion puedes evitarla mas facil, evita el rango de su E lo mas posible si eres un campeon que no tiene escape, entre sus counters estan: {{champion:266}} {{champion:57}} {{champion:68}} {{champion:150}} \n\n\n{{champion:86}} es mucho mas facil de jugarle, aunque tienes una desventaja si lo matas mucho, volverte villano :v, aun asi cualquier campeon con ralentizacion puede hacerle evitar el forzeo de una pelea de 1vs1, es recomendable congelar linea o que te mantenga pusheado, asi evita que te desgaste, {{champion:48}} r{{champion:13}} {{champion:10}} {{champion:59}} {{champion:122}} \n\n{{champion:82}} la fuerza de mordekaiser es principalmente mele, aunque es dificil desgastarlo pero aun asi no es muy dificil quitearle, la verdad con habilidades a distancia pueden hacerle counter, {{champion:50}} {{champion:86}} {{champion:69}} {{champion:83}} {{champion:99}} {{champion:90}} \n\n{{champion:72}} bueno podria decir que es el mas fuerte hasta el momento de los 4, para ser preciso si no eres un coloso es dificil ganarle, solo procura no pelear dentro de sus zonas de cristales, como counter estan: {{champion:77}} {{champion:254}} {{champion:102}}","replies":[]},{"poster":"Zerocl","date":"2015-09-04T18:01:07.258+0000","up_votes":1,"down_votes":0,"body":"Hola Gaussrik!, antes queria agradecer tu gran participación con la comunidad, ahora entrare al tema de fondo:\n\nHablar de los colosos me parece un tema complejo (Todo esto tratado desde mi punto de vista, ps no soy profesional ni nada), pero segun lo que percibo algunos de ellos traen un gran desbalance al juego. Pero si se analiza mas de fondo, no es culpa de los champions en si, si no de la itemización que se les está haciendo con lo cual quedan broken. Como main mid/adc resulta una experiencia algo frustrante, pues siento que algunos de estos champs no permiten counterplay, pues son muy fuertes ya que resisten mucho y pegan mucho, y creo que debiese tener alguna debilidad que se resalte un poco más.\n\nYendo a un caso mas concreto, considero que Garen está muy fuerte en estos momentos, esto gracias a dos items cores que se le arman, los cuales son {{item:3742}} y {{item:3053}}, El primero de estos le ayuda a suplir su falta de movilidad, pues con 100 cargas y su Q corre muy rapido haciendosele facil llegar hasta el carry rival, con buena teamplay se puede evitar esto, pero en soloQ en particular resulta dificil sacarselo de encima siendo un ADC. Hasta ahora la unica formula que me ha resultado ha sido jugar con Vayne, pues la pasiva de la W y el bait que puedo hacer con la tumble estando invisible con el ulti activado me resulta util para sacarlo de encima, el problema que Vayne en estos momentos está fuerte y muchas veces es baneada. ¿Pero por que está fuerte? ¿Por que aumento su winrate si hace unos meses era bastante bajo si no ha recibido buffs?, esto se debe justamente al meta de tanks. Por ahi leí que Riot Lyte y el equipo de balances de campeones está analizando nerfear a Vayne, pero considero que esto no va en un camino correcto, pues es justamente riot el que pone el meta de tanks y los players juegan champions anti tanks para hacerle frente (ya de forma muy dificil).\n\nVolviendo a lo principal, además del caso de Garen el cual encuentro injusto se le agrega otro coloso mas que segun yo está dando varios problemas, el cual es Skarner. Pero el problema si lo analizamos bien no es Skarner en particular, es la mejora del item de jungla que se le arma, el cual le facilita activar su pasiva y causar un \"perma stun\" a su rival. Nuevamente esto admite poco counterplay, pues tambien recibe una mejora de movespeed resultando dificil sacarselo de encima, con un daño insano (aun asi, el nerfeo ayudo a palear un poco la situación pero aun me sigue pareciendo que está un poco over por sobre el resto de champs). Un saludo!.","replies":[{"poster":"Neo Gaussrik","date":"2015-09-04T18:10:20.100+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Aenima Zerocl,realm=LAS,application-id=v7qsfXsE,discussion-id=cXBBnWtI,comment-id=000d,timestamp=2015-09-04T18:01:07.258+0000)\n> Yendo a un caso mas concreto, considero que Garen está muy fuerte en estos momentos\n\nDe acuerdo, esta fuerte, aunque no al nivel que la comunidad lo acusa de estar.\n\n> pues con 100 cargas y su Q corre muy rapido haciendosele facil llegar hasta el carry rival\n\nDepende del tirador, y depende del equipo.\n\nClaro, antes del cambio, uno dejaba pasar a Garen porque francamente no era una amenaza. Ahora hay que hacer algo al respecto; si nadie le aplica ralentizaciones o inmobilizaciones, obvio que va a llegar.\n\n> pero en soloQ en particular resulta dificil sacarselo de encima siendo un ADC.\n\nNo veo que eso sea inherentemente un problema.\n\nLos tiradores no son duelistas! Con la posible excepcion de Quinn y Vayne, los tiradores dependen de tener un aliado que los proteja para hacer bien su trabajo, y esto es a proposito.\n\n> Volviendo a lo principal, además del caso de Garen el cual encuentro injusto se le agrega otro coloso mas que segun yo está dando varios problemas, el cual es Skarner.\n\nSkarner fue considerablemente mas problematico que Garen. ^^;\n\n> Pero el problema si lo analizamos bien no es Skarner en particular, es la mejora del item de jungla que se le arma, el cual le facilita activar su pasiva y causar un \"perma stun\" a su rival.\n\nYo te diria que el problema fue simplemente que fue lanzado con atributos demasiado altos; demasiado daño, enfriamientos muy cortos, etc. Subestimamos el impacto de sus cristales y como consecuencia tuvimos mas de una semana de uno de los campeones con mejor desempeño historico nunca.\n\n>Un saludo!.\n\nUn saludo para ti tambien. :)","replies":[]}]},{"poster":"Dyaebl","date":"2015-09-05T01:31:20.636+0000","up_votes":1,"down_votes":0,"body":"Un coloso puede hacer mucho daño si no se lo controla, a diferencia de un tanque\n\nEsta bien eso, pero cual es la logica de que un campeon le pegas 1 Q, te cures 15% de la vida perdida, 1 basico+W que te resetea el basico+basico y de la nada ganes 30 de ad a lvl 3, cosa que si se te escapa con flash tenes la E y tu flash? teniendo en cuenta que si el enemigo se arma armadura la pasiva de la E le importa muchisimo\n\n\nBueno, hablemos de mordekaiser es un adc asi que tiene sentido el daño que hace, pero como puede ser que tenga un dragon, es darle 1 torre gratis ademas de que mordekaiser gana mas de 1000 de vida en mid game solamente por tener al dragon vivo, si por lo menos las stats del dragon no te las de completas bueno pero que en mid game tenes +1000 de vida, 1 torre gratis, hacer a morde mas tanque de lo q ya es cual es la logica de esto?\n\nGaren lo necesitaba, le faltaba algo para late\nSkarner esta bastante bien, nadie va a pelear en el medio de la pasiva me imagino\n\n\n\nMe ahorro la opinion del 60% de daño verdadero de vida maxima+daño de asesino+devolucion de cc con rechazo de absolutamente todas las habilidades del juego todo eso en mid game si tenes un par de kills y en late game llendo 0/15 porque estamos hablando de colosos","replies":[{"poster":"Neo Gaussrik","date":"2015-09-07T14:34:48.922+0000","up_votes":2,"down_votes":0,"body":"Basicamente, si puedes evitar que el campeon sea capaz de hacer esto simplemente ralentizando o inmovilizando y replegandote, esta bien que ese campeon sea muy dañino si logra llegar. Es su caso de exito.\n\nCon respecto al dragon de morde... quizas no le dejes tomarlo? La definitiva de Morde no es particularmente brillante y mucho de su poder se va precisamente en tener ese dragon.\n\nTodo lo que necesitas hacer para ganarle a morde es no dejarle pegar la tercera Q. Existen muchas maneras de hacer esto (movilidad, control de masas, tanques), asi que... al igual que cuando te pega una lanza a rango maximo de Nidalee, cuando te llega esa tercera Q de Morde, te va a doler. Es una habilidad dificil de pegar, y como consecuencia es muy efectiva en lo que hace.","replies":[{"poster":"D Godyr Gates","date":"2015-09-07T15:11:36.980+0000","up_votes":1,"down_votes":2,"body":"Osea que si pickean un \"Coloso\" estoy OBLIGADO a focucearlo porque sino clava un Triple a la Backline?\nTe juro que no entiendo como defienden tanto a estos 4 Champs \"Nuevos\".\n\nSumandole que ahora no se que hacen ni Morde ni Darius, y me tengo que fumar sus CD y sus KIT denuevo. Años de aprendizaje de lol al reverendo DOPE.\n\nGaren es infumable viejo. Cualquier campeon melee que le quiera jugar en top generalmente pierde los Trades por esa Q pedorra y el Spin sin sentido. Que onda? Les gusta hacerse los ciegos?\nNo ven cuanta genre troleando MORDE ADC o MORDE SUP hay?\nNerf Vayne? WTF. Desbalancean ustedes mismos y ahora matan al adc mas amado?\n\nC U E K","replies":[{"poster":"Neo Gaussrik","date":"2015-09-07T15:51:28.486+0000","up_votes":2,"down_votes":0,"body":"Si tu estas perdiendo contra ellos, bien. No me generalizes con respecto al estado del juego basado solamente en tu experiencia.\n\n> Cualquier campeon melee que le quiera jugar en top generalmente pierde los Trades por esa Q pedorra y el Spin sin sentido\n\nSi?\n\n{{champion:48}} te esta mirando.\n\nRespeto tu pasion, pero tu tono es molesto.\n\nSi quieres desahogarte en el foro, bien. No volveras a recibir una respuesta de mi.\n\nSi quieres entender las razones por las que hacemos los cambios, entonces frasea tus comentarios como preguntas y con respeto, y entonces podremos tener una discusion.","replies":[]}]},{"poster":"Dyaebl","date":"2015-09-08T22:03:58.258+0000","up_votes":1,"down_votes":0,"body":"La Q de mordekaiser esta bien, si es un adc melee tiene que tener daño hasta por las dudas \nNadie penso en bajarle los stats al fantasma del dragon? xq es practicamente torre gratis en early-mid almenos que el adc o un champ ad de rango valla fedeado\n\n\nSi el que dijo de garen lee esto, nunca en tu vida viste un garen antes? porque siempre hizo lo mismo solamente q ahora le dieron algo mas para compensar el late tan... shaco que tenia(lo uso como el tipico ejemplo, se lo q hace un shaco con un adc en late)\nNormalmente a garen en linea no le ganas almenos que te gankeen mucho y si te gankean tenes q tratar de dejarle la kill al jg porque sino te estas regalando a tener la pasiva de garen y que te deletee\n\n\nYa vi los cambios de darius en el pbe, quedo bien en mi opinion aunque nunca voy a entender los 1k de vida+torre gratis por mucha explicacion que me den","replies":[]}]},{"poster":"Dyaebl","date":"2015-09-05T01:32:01.452+0000","up_votes":2,"down_votes":0,"body":"Mas que coloso seria lo que digeron en la traduccion, mole imparable literalmente imparable","replies":[]}]},{"poster":"Puynsi","date":"2015-09-04T23:28:59.525+0000","up_votes":1,"down_votes":2,"body":"Loco si no saben balancear campeones solo diganlo, nadie los va a odiar.","replies":[{"poster":"Neo Gaussrik","date":"2015-09-07T14:38:21.884+0000","up_votes":2,"down_votes":0,"body":"En serio?\n\nTenemos mas de 120 campeones y la enorme mayoria de ellos estan dentro de 5% de distancia de ganar exactamente la mitad de sus partidas.\n\nCon que estandar nos estas comparando?","replies":[]},{"poster":"TeemoTankeTiamat","date":"2015-09-08T01:19:49.604+0000","up_votes":2,"down_votes":0,"body":"{{champion:38}} es el champ con menos winrate en ranked y solo tiene 43% de posibilidades de ganar, en que momento ves a los campeones desbalanceados?","replies":[]}]},{"poster":"Dildo de Moria","date":"2015-09-04T17:01:52.190+0000","up_votes":1,"down_votes":1,"body":"¿Por que? ¿Por que rompen así a Darius? ¿Porque Garen armándose full vida te baja tanto? ¿Que necesidad había?","replies":[{"poster":"Neo Gaussrik","date":"2015-09-04T17:03:57.301+0000","up_votes":2,"down_votes":0,"body":"Los colosos habian desaparecido del juego simplemente por su falta de utilidad en la fase de peleas de equipo.\n\nLa existencia de mas alternativas estrategicas es buena para el juego.\n\nMas variedad es mejor!","replies":[{"poster":" Quicksand","date":"2015-09-04T17:43:12.727+0000","up_votes":2,"down_votes":0,"body":"Variedad? Veo puros Garen Top :v","replies":[{"poster":"Maty097","date":"2015-09-04T18:32:55.403+0000","up_votes":1,"down_votes":1,"body":"Banealo :)","replies":[{"poster":"Ministevo","date":"2015-09-04T21:59:10.463+0000","up_votes":1,"down_votes":0,"body":"¿Y si juego normal? ¿Qué hago?","replies":[{"poster":"Komui","date":"2015-09-05T00:44:04.195+0000","up_votes":2,"down_votes":0,"body":"quedarte AFK jaja\n{{champion:119}}","replies":[]}]}]}]}]}]},{"poster":"Lucrexio","date":"2015-09-04T18:21:27.768+0000","up_votes":1,"down_votes":0,"body":"Aca tengo un par de preguntas:\n¿Cuál fue el objetivo a cumplir con la salida de estos 4 \"colosos\"? \nMe parece evidente que los 4 colosos están desbalanceando bastante la meta actual, por lo tanto ¿tienen pensado hacer algún cambio en particular con respecto a los otros roles, como son los ADC, luchadores y asesinos?","replies":[{"poster":"Neo Gaussrik","date":"2015-09-04T18:26:10.263+0000","up_votes":2,"down_votes":0,"body":"El objetivo fue re-invigorar a todos esos campeones de rango melee, resistentes, y que buscan matar a sus oponentes en vez de caracterizarse por su control de masas.\n\nSi te parece evidente, podrias indicarme en que te basas para aseverarlo? Los campeones mas elegidos siguen siendo Vayne, Zed, Lee Sin, Yasuo, thresh... El mas popular de los colosos es Garen, en #13, y si bien no te discuto que los colosos estan fuertes, no estan desproporcionadamente fuertes.","replies":[]}]},{"poster":"GinTaicho","date":"2015-09-04T17:03:03.807+0000","up_votes":1,"down_votes":0,"body":"Tengo una pregunta, campeones como Shyvana, Warwick, Trundle, Renekton o Hecarim son considerados colosos?  Hasta donde se un coloso se diferencia de un tanque en que este reparte daño al mismo tiempo que aguanta el del enemigo, mientras que el tanque reparte más CC que daño pero tiene más capacidades defensivas (como el caso de Sion, Jarvan IV, Malphite o Maokai). \nLos campeones que mencione cumplen (a mi parecer) con el estándar de \"coloso\", ¿estoy en lo correcto? y de ser así, ¿que campeones estarían en la mira para próximos cambios?","replies":[{"poster":"Neo Gaussrik","date":"2015-09-04T17:12:00.460+0000","up_votes":2,"down_votes":0,"body":"Coloso es un rol mas que un campeon. Tu puedes jugar a Warwick como tanque, o a Shyvana como asesina.\n\nTodos los campeones que mencionas pueden ser jugados como colosos, si a eso te refieres. :)\n\nEl trabajo de un tanque puede incluir pasar gran daño, pero tambien puede no necesitarlo. Por contraste, un Coloso no puede funcionar como Coloso si es incapaz de matar.\n\n\nCon respecto a tu pregunta: Si hemos hecho revisiones de asesinos, de magos, de tanques, de colosos y de soportes... que rol te parece que deberia seguir?","replies":[]}]},{"poster":"Infernus Nisman","date":"2015-09-04T16:57:20.080+0000","up_votes":2,"down_votes":0,"body":"Garen me saco 1500 de daño verdadero y yo era un {{champion:31}} entonces.. ¿Que vulnerabilidad comparten todos los Colosos?","replies":[]},{"poster":"J7ycjHAfiL","date":"2015-09-04T18:27:07.896+0000","up_votes":2,"down_votes":1,"body":"Tibbers seria uno si le dieran un buff :D {{champion:1}}","replies":[]},{"poster":"soy arawea","date":"2015-09-05T01:49:47.856+0000","up_votes":1,"down_votes":0,"body":"que onda skarner? ahora dominion es en la grieta del invocador? stunt cada 6 segundos? tons of damage para ser un tank? 95% de BAN RATIO, Riot se te fue la mano...","replies":[{"poster":"Neo Gaussrik","date":"2015-09-07T14:28:52.085+0000","up_votes":1,"down_votes":0,"body":"Reconozco que lo lanzamos demasiado fuerte, si.\n\nYa lo hemos nerfeado, y es posible que lo sigamos nerfeando en parches futuros, hasta que vuelva a tener un desempeño razonable.","replies":[{"poster":"Waraldo","date":"2015-09-09T03:41:31.567+0000","up_votes":1,"down_votes":0,"body":"Leí todo y al parecer estas a favor de todos estos cambios, por ende riot LAS lo está. Pero aún así ¿Por qué entonces nerfean a darius mordekaiser skarner y garen continuamente en estos nuevo pbe updates? \nLo digo desde un punto de vista humilde, ya que la mayoría de las veces estoy de acuerdo con tu opinión, esta vez te equivocaste. Están muy fuertes, son imparables. No es lo mismo parar a un nasus que a estos campeones, tienen muchisima armadura base (por eso se la nerfean) y tienen un daño sobrehumano para ser un full tanque, como por ejemplo garen...\n\nUn abrazo","replies":[]},{"poster":"soy arawea","date":"2015-09-07T22:09:51.949+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=cXBBnWtI,comment-id=00250001,timestamp=2015-09-07T14:28:52.085+0000)\n>\n> Reconozco que lo lanzamos demasiado fuerte, si.\n> \n> Ya lo hemos nerfeado, y es posible que lo sigamos nerfeando en parches futuros, hasta que vuelva a tener un desempeño razonable.\n\nTy <3 DEBE MORIR! XD okno solo que no sea permaban xd","replies":[]}]},{"poster":"soy arawea","date":"2015-09-05T01:51:24.293+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ElSploTZBK,realm=LAS,application-id=v7qsfXsE,discussion-id=cXBBnWtI,comment-id=0025,timestamp=2015-09-05T01:49:47.856+0000)\n>\n> que onda skarner? ahora dominion es en la grieta del invocador? stunt cada 6 segundos? tons of damage para ser un tank? 95% de BAN RATIO, Riot se te fue la mano...\n\ny un antiguo mid laner que ahora en late es un tank ad carry, que pega 1,500 con su Q y  es muy bully en linea, ademas de que controla un dragon...","replies":[]}]},{"poster":"Agatha Christie","date":"2015-09-08T20:55:38.895+0000","up_votes":1,"down_votes":0,"body":"A mi lo que más me molesta de los colosos no es que puedan llegar a estar rotos sino que prometieron que en esta temporada iba a haber \"diversidad\" y no lo cumplieron. Actualmente el juego en soloQ se resume: colosos + fiora + gangplank + devorador, los tiradores ya no tienen el impacto que tenían y la botlane es una linea que por mucho que la ganes si luego te cae el mid, top y jg feed del equipo contrario toda tu ventaja la perdés en segundos. Me aburre mucho el meta actual :(","replies":[]},{"poster":"rokushoger","date":"2015-09-08T13:05:42.795+0000","up_votes":1,"down_votes":0,"body":"Tengo una duda con respecto a skarner. Que encantamiento de jungla elegirías tu con él y porque? Veo viable no solo el devorador sino practicamente todos dependiendo de la build, y la verdad me está costando encontrar un camino de items consolidado. \nAsí que las preguntas serían:\nQue se espera de un skarner en la partida actualmente?\nQue tipo de orientación debe llevar (daño, más tanque, supresor, etc)?\nCual sería a tu criterio el encantamiento que cumple más con lo de arriba?\n\nEn cuanto al balance no voy a decir nada, realmente darius y morde no me causan ningún problema, el que si me molesta un poco es garen, porque donde lo mates mucho te voltea la partida solo a fuerza de subir de nivel sin practicamente habilidad. Creo que tal vez los ticks de daño verdadero del giro son demasiados, capaz que aplicando la mitad o algo así, pero en fin, tampoco es para tanto, se le puede pelear.","replies":[{"poster":"Neo Gaussrik","date":"2015-09-08T13:34:09.408+0000","up_votes":1,"down_votes":0,"body":"Encantamiento de jungla? Probablemente Gigante Cenizo, pero yo tengo una tendencia super fuerte a jugar \"estilo soporte\" sin importar el carril...\n\n> Que se espera de un skarner en la partida actualmente?\n\nControl de objetivos, emboscadas, y ser un tanque en el juego tardio.\n\n> Que tipo de orientación debe llevar (daño, más tanque, supresor, etc)?\n\nSiento que mientras mas ventaja llevas en la partida, mas viable es construirlo con daño; a medida que la partida avanza, mas tanque quieres ser.\n\nSi te hace feliz saberlo, probablemente le caigan algunos nerfs a Garen en el siguiente parche...","replies":[]}]}]}