{"poster":"Neo Gaussrik","date":"2017-09-29T19:04:38.931+0000","title":"Hablando sobre jugabilidad: 29 de Septiembre","subforum":"Jugabilidad, balance y narrativa","up_votes":16,"down_votes":1,"body":"&iexcl;Buenos d&iacute;as!\r\n\r\n-------------------------------------------------------------------------------\r\n\r\n**Avisos de siempre**\r\n\r\nEstas publicaciones, a menudo, contienen informaci&oacute;n acerca del trabajo a futuro que estamos realizando o planeando hacer y que no garantizamos que saldr&aacute; para el p&uacute;blico. La naturaleza de dicho trabajo puede cambiar o, seg&uacute;n lo que vayamos descubriendo, algunos proyectos mencionados podr&iacute;an retrasarse o incluso cancelarse definitivamente.\r\nSi desean ver un tuit cada vez que subimos una de estas publicaciones, s&iacute;gannos en: https://twitter.com/RiotMeddler\r\n------------------------------------------------------------------------------\r\n\r\n**Durante un ratito habr&aacute; menos actualizaciones de jugabilidad en los campeones**\r\n\r\nDurante un rato no muy largo (m&aacute;s o menos lo que queda del a&ntilde;o) vamos a dedicarle menos tiempo a las actualizaciones de jugabilidad, como la de Xin Zhao o Azir, y le dedicaremos mucho m&aacute;s tiempo a preparar la pretemporada y balancearla una vez que la lancemos. A comienzos del pr&oacute;ximo a&ntilde;o, y m&aacute;s o menos con esta rapidez, regresaremos a las actualizaciones de jugabilidad, pero esperen ver menos durante un rato. En contraste, las actualizaciones m&aacute;s grandes seguir&aacute;n sucediendo a su velocidad normal, ya que aquellos que se encargan de ellas no est&aacute;n demasiado involucrados con la pretemporada.\r\n\r\n------------------------------------------------------------------------------\r\n\r\n**Comentarios acerca de las runas**\r\n\r\nAhora que todas las runas est&aacute;n en el sitio web y la gente ha jugado bastante con ellas en el PBE, estamos priorizando los cambios con base en sus comentarios. Aparte de sus comentarios en general, ser&iacute;a muy &uacute;til saber su opini&oacute;n acerca de algunos puntos en particular. Esto incluye:\r\n\r\n* Si tienen la sensaci&oacute;n de que campeones espec&iacute;ficos no tienen una opci&oacute;n de &aacute;rbol primario o secundario.\r\n* Runas que siempre quieren escoger o que nunca quieren escoger.\r\n* Runas cuyo funcionamiento no es muy claro a partir de la descripci&oacute;n emergente o bien, runas a las que les falta informaci&oacute;n esencial en las descripciones para tomar una decisi&oacute;n informada antes de que comience la partida.\r\n\r\n------------------------------------------------------------------------------\r\n\r\n**Creaci&oacute;n de un sitio web de runas**\r\n\r\nComo habr&aacute;n notado, el sitio web de las runas no muestra algunos de los cambios recientes a las runas que est&aacute;n en el PBE. Vamos a actualizar el sitio, pero no con tanta frecuencia como los cambios que iremos haciendo al PBE. La pr&oacute;xima semana deber&iacute;an ver una actualizaci&oacute;n, seguida de otras regulares, pero habr&aacute; momentos en los que el sitio web est&eacute; un poco desactualizado, ya que estamos m&aacute;s enfocados en incorporar elementos al juego y probarlos lo antes posible.\r\n\r\n------------------------------------------------------------------------------\r\n\r\n**Balance en las versiones 7.20 y 7.21**\r\n\r\nGracias al nuevo sistema de runas, estaremos balanceando a los campeones y al juego en general con mucha m&aacute;s frecuencia que con el sistema antiguo. Seguiremos resolviendo los problemas m&aacute;s importantes del nuevo sistema, pero nos estamos enfocando en el juego a largo plazo en vez de en las 2 a 4 semanas en las que lancemos los cambios de esas versiones antes de reemplazar el sistema antiguo de runas/maestr&iacute;as y que su balance ya no sea relevante. Evelynn es una de las campeonas que seguramente se ver&aacute; afectada por esto (puede que sea temporalmente m&aacute;s fuerte o m&aacute;s d&eacute;bil de lo que ser&aacute; a largo plazo).\r\n\r\n\r\n\r\nhttp://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png","replies":[{"poster":"Pamd3m0n1um","date":"2017-09-29T19:08:22.428+0000","up_votes":3,"down_votes":0,"body":"Yo quiero que salga para la compra la skin de singed Apicultor xD","replies":[{"poster":"Neo Gaussrik","date":"2017-09-29T19:26:26.970+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Pamd3m0n1um,realm=LAS,application-id=xQmJPO8F,discussion-id=2RLazKBL,comment-id=0000,timestamp=2017-09-29T19:08:22.428+0000)\n>\n> Yo quiero que salga para la compra la skin de singed Apicultor xD\n\nQue bueno que estes entusiasmado, pero eso no es Jugabilidad :D","replies":[{"poster":"Ancient Gromp","date":"2017-09-30T15:07:11.561+0000","up_votes":1,"down_votes":0,"body":"Como que no! Esta científicamente comprobado que el skin da manos! :3\n{{sticker:sg-lulu}}","replies":[]}]},{"poster":"Chinegro Bot","date":"2017-09-30T04:17:04.347+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pamd3m0n1um,realm=LAS,application-id=xQmJPO8F,discussion-id=2RLazKBL,comment-id=0000,timestamp=2017-09-29T19:08:22.428+0000)\n>\n> Yo quiero que salga para la compra la skin de singed Apicultor xD\n\nestamos en la misma","replies":[]}]},{"poster":"Salvor","date":"2017-09-29T19:32:17.151+0000","up_votes":2,"down_votes":0,"body":"##Hola Gauss! \n¿Me podrías ampliar un poco la funcionalidad de estas 3 runas?\n Desde mi punto de vista las veo muy similares a diferencia de otras runas.\nhttps://i.gyazo.com/bcd3c729cfc52cfc1b72f53d03ff9bc5.png\nhttps://i.gyazo.com/d000970e4319034a4b91d9e9e4dcfe40.png\nhttps://i.gyazo.com/783562a0f6e47af4b08d1ec671827ab5.png\nTampoco entiendo porque _acondicionamiento_ tiene alcance de 800.\n____\nPD: Ayer estaba por hacer un post sobre la limpieza de jungla (por la perdida de velocidad de ataque en las nuevas runas)\ny justo salio en el pbe que {{item:1041}} otorga 20% as y {{item:1039}} quema a los monstruos. \n**Bien pensado!**","replies":[{"poster":"Neo Gaussrik","date":"2017-09-29T19:58:54.019+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Salvor Hardin,realm=LAS,application-id=xQmJPO8F,discussion-id=2RLazKBL,comment-id=0002,timestamp=2017-09-29T19:32:17.151+0000)\n>\n> ##Hola Gauss! \n> ¿Me podrías ampliar un poco la funcionalidad de estas 3 runas?\n\nSon para aumentar tu resistencia en la fase de lineas o en el juego medio dependiendo de cual tomas.\n\n>  Desde mi punto de vista las veo muy similares a diferencia de otras runas.\n\nUna es contra daño fisico, otra contra daño magico, y la tercera se activa en el juego medio.\n\n> Tampoco entiendo porque _acondicionamiento_ tiene alcance de 800.\n\nError de traduccion. :p\n\nSaludos!","replies":[]}]},{"poster":"MD Abýssou","date":"2017-09-29T21:10:44.348+0000","up_votes":1,"down_votes":0,"body":"Me imagino que va a ser una pesadilla para el equipo de balance de campeones, buena suerte con eso jajajaja","replies":[{"poster":"Neo Gaussrik","date":"2017-09-29T21:11:07.397+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=cant be slowed,realm=LAS,application-id=xQmJPO8F,discussion-id=2RLazKBL,comment-id=0004,timestamp=2017-09-29T21:10:44.348+0000)\n>\n> Me imagino que va a ser una pesadilla para el equipo de balance de campeones, buena suerte con eso jajajaja\n\nLas primeras semanas van a ser caoticas, si >.>","replies":[]}]},{"poster":"RNGesus","date":"2017-09-29T20:09:20.435+0000","up_votes":1,"down_votes":1,"body":"Dudo que evelynn sea mas fuerte o mas debil, por lo que pude ver en reddit solo se ven quejas y la mayoria se refieren a la politica de balance en torno a los asesinos, y creo que muchos estaran de acuerdo en que agregarle counterplay  a un asesino no es sano para su modo de juego, los soportes son las estrellas de las partidas ultimamente  y esto lo sufren directamente los asesinos, cual es la diferencia entre el CHARM de evelynn que es totalmente cantado, y shaco que puede posicionar una caja que aplica FEAR sin que lo veas? simplemente no se entiende el punto de todo eso, pero bueno por lo demas las runas estan todas perfectas salvo por algunas que literalmente opacan totalmente a las otras en utilidad , pero supongo que eso se ira balanceando en la pre-season.","replies":[{"poster":"Neo Gaussrik","date":"2017-09-29T20:39:02.334+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=JerkØff,realm=LAS,application-id=xQmJPO8F,discussion-id=2RLazKBL,comment-id=0003,timestamp=2017-09-29T20:09:20.435+0000)\n>\n> Dudo que evelynn sea mas fuerte o mas debil, por lo que pude ver en reddit solo se ven quejas\n\nNunca hemos tenido un lanzamiento de nada en que no haya protestas. ;) Es normal!\n\n> y la mayoria se refieren a la politica de balance en torno a los asesinos, y creo que muchos estaran de acuerdo en que agregarle counterplay  a un asesino no es sano para su modo de juego\n\nTodos los campeones debieran tener counterplay, no crees?\n\n> los soportes son las estrellas de las partidas ultimamente  y esto lo sufren directamente los asesinos\n\nEsto no me parece tan claro. Creo que los asesinos sufren mas cuando hay multiples tanques en la partida.\n\n> cual es la diferencia entre el CHARM de evelynn que es totalmente cantado, y shaco que puede posicionar una caja que aplica FEAR sin que lo veas?\n\nLa gracia es que Evelynn puede elegir entre aparecer de la nada e intentar matar sin control de masas, o acceder a un poderoso control de masas pero anunciandole al oponente que ella esta cerca.\n\nSaludos!","replies":[]}]},{"poster":"J7ycjHAfiL","date":"2017-09-30T03:48:53.521+0000","up_votes":1,"down_votes":0,"body":"que hay de annie xd","replies":[{"poster":"Neo Gaussrik","date":"2017-10-02T15:00:34.927+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dasant Ko,realm=LAS,application-id=xQmJPO8F,discussion-id=2RLazKBL,comment-id=0007,timestamp=2017-09-30T03:48:53.521+0000)\n>\n> que hay de annie xd\n\nNo tiene grandes cambios en el futuro cercano!","replies":[{"poster":"J7ycjHAfiL","date":"2017-10-02T23:10:08.656+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=xQmJPO8F,discussion-id=2RLazKBL,comment-id=00070000,timestamp=2017-10-02T15:00:34.927+0000)\n>\n> No tiene grandes cambios en el futuro cercano!\n\n{{item:3070}}\n\nni un buff?","replies":[]}]}]},{"poster":"ChayanneenunaC90","date":"2017-09-30T02:17:41.665+0000","up_votes":1,"down_votes":0,"body":"Gauss, los comentarios sobre las runas los podemos enviar en la página web?","replies":[{"poster":"Neo Gaussrik","date":"2017-10-02T14:59:59.708+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NoxianBlade,realm=LAS,application-id=xQmJPO8F,discussion-id=2RLazKBL,comment-id=0005,timestamp=2017-09-30T02:17:41.665+0000)\n>\n> Gauss, los comentarios sobre las runas los podemos enviar en la página web?\n\nNo entiendo la pregunta. En que pagina web? Como?","replies":[]}]},{"poster":"Lemontastic","date":"2017-10-02T01:29:19.941+0000","up_votes":1,"down_votes":0,"body":"Buenas Gaussrik :) \nEstuve viendo varios vídeos acerca de las nuevas runas, y quería hacer una colaboración dado que están buscando apoyo de la comunidad. Espero poder inspirarlos a ayudarlos a agregar mas runas al juego! Que ya de por si, creo que están haciendo muy buen trabajo; muy maleables  e interesantes las nuevas runas. Suerte para que el nuevo sistema sea variado y satisfactorio! Yo por mi parte voy a disfrutar viendo el progreso de esta pre temporada, desde el diseño y balanceo del juego que me super interesan, hasta los exploits bizarros que se le ocurran a la comunidad ajajaj\n\nBueno, la idea principal que yo tenía para las runas estaba enfocada en intentar ayudarlos a cubrir el nuevo espacio vacío de las runas de inspiración, porque bueno, todavía quedan muchas reglas para romper en lol ajajajaj, y necesitamos esa runa para que el diseño quede simetrico, no? Despues de todo mucho no importa porque seguro vendrán muchas runas más, porque por suerte el sistema que crearon deja espacio para trabajar tranquilamente ajajaj (a mucha diferencia del anterior)\nPero por ahora tiene que quedar bonito!\nDe todas maneras lo que me imagino creo que puede ser reciclado en runas menores, aunque tengo la idea de una runa grande de varias partes relacionadas.\nLa runa básicamente podría llamarse “Materia inestable” / “Unstable matter” o “Ultra-velocidad-inter-planar” / “Planary-over-speed” y trataría de combinar un par de poderes pequeños, intentar dar una sensación de unidad temática entre ellos y al mismo tiempo se da (Justo!) que todos rompen las reglas.\n\nLa primera parte de la runa sería apresurar el tiempo del recall a 5 segundos. Ahí podría estar el símbolo de la runa, con un recall especial. Algo intermitente y violento, y también puede girar muy rápido. Supongo que el principal problema son las animaciones, no se que tan complicado puede ser ese problema, y no plantearía modificarlas todas para una maestría, que horror! Que la animación del recall sea estrepitosa y tire rayos como si realmente este causando una ruptura de planos y tape la animación del campeón al minuto 4 suena una curita adecuada, o sino cambiar las animaciones de recall por otra o quitarla directamente. Seguro esta es la parte mas complicada de la runa y no creo que viva para verlo si es muy complicado, pero hey! Es un super recall! ajajaja\nEl recall mejorado y el teleport podrían mejorar sutilmente, pero realmente no parece necesario ajaja. El tiempo del teleport siempre fue nerfeado y el recall mejorado es demasiado especifico. De todas maneras una reducción proporcional mínima (como 1 segundo, o 0.5) tal ves les parece una porcioncita tolerablemente temática? No se jajaja\n\nY la segunda parte es un efecto post morten. La idea de la runa en si de estar dividida es para dar lugar a un efecto de este estilo; \n\nEstuve viendo Jeremy Gaming Curious (muy interesante <3 ajaja) y cuando mencionó que estaban probando ideas post morten y de los diferentes problemas que generaban y la manera en la que a la gente realmente no le gustan, me inspiró. El decía que iban a testear nuevos métodos de hacer alguna runa así pero que no tuviera, de alguna manera, todo su poder después de la muerte (Parece que, en general, la gente prefiere no morirse ajajaja y a mí me encanta, pero entiendo la frustración de los que juegan kogmag y se olvidan de su pasiva, es mas fácil de notar con karthus xD).\n \nY luego pense (nada que ver xD) que no había ninguna runa relacionada con el recall! Pequeño detallito el “Improved recall” que siempre me pareció interesante (lo usaba de support para ver cuando recaleaba mi duo y hacerlo 1 segundo despues sabiendo que nos ibamos a ir juntos, ajaja, solo un pequeño detalle personal que usaba de reacción, relevante muy pocas veces pero igualmente divertido ajaja). Y entonces, me imagine, que cuanto mas se acelera un recall, aumenta su poder exponencialmente. Si se pudiese recalear instantaneamente en medio de un combo con Riven! Imaginense (?). Pero bueno, recalls demasiado cortos serían muy poderosos para algo pasivo, defensivo y con poca potencialidad, pero quedan bien complementando un efecto post-morten, porque me permite tener una base de poder para dividir entre algo tan poco reditable  (Pero bueno, como dije, tal vez ya tienen algo en mente!). \nY de tanto trabajar con esto se me ocurrió un efecto post morten que amaría ver en el juego, porque personalmente me vuelve a las epocas del revive-tp, de esa jugabilidad tan extraña y que es algo que para mi cierra perfectamente la runa: Cuando el portador muere deja una  “tumba” indestructible en el lugar durante un tiempo relacionado (ZOMBIE WARD?? LEL) con su tiempo muerto en la cual al clickearla puede recalear hacia ella. Me encanta, jajaja.\nY bueno, dado que el efecto es solo un tp gratis, es poco consuelo por morirse, así que un poco de tiempo muerto reducido podría encajar con la  “gotta go fast” fantasia, y 1 segundo de vida después de muerto como “no me importa, yo sigo en esta dimensión”, es un tiempito suficiente para terminar lo que estabas haciendo, pero no para arrepentirse de no haber hecho otra cosa, a mí parecer.\n\nY por ultimo la tercera parte, que no es muy importante, pero es plasticola, es un poco de movement speed fuera de combate. Es para hacer de homeguard y de herramienta de romeo para que la runa tenga un lado agresivo al mismo tiempo, acentuando la debilidad de no ayudar a limpiar o pelear. Aparte es fácil de cambiar los números alrededor para que el recall tenga una cantidad sana de segundos extras que se gane, sin ser demasiado corto.  Y la idea agresiva es que te ayude a wardear la jungla enemiga, y además ganar segundos de ventaja antes de meterte al bush y recalear con el pulso acelerado porque vienen 5 personas a cavarte una tumba. Pero es una parte prescindible, puesto que no quiero ser ni muy complicado ni muy complejo, y ya la cargue casi tanto como a Yasuo (?) ajaja\n \nComo simbolo me imagine un vórtice de rayos, porque se puede poner por sobre el recall y el bufo de movement speed pueden ser rayitos en los pies, pero solo me imagine algo lindo (?) ajajaja.\n[Algo como me lo imagino por Benjamin Zhang <3](https://gyazo.com/ec60f48922996ac13b959b0d85b308c0), pero bueno, no quisiera quitarle su trabajo a los artistas conceptuales que me gustan tanto (?) ajajaja.\n\nLes deseo mucha suerte, y espero que les guste <3 Muchas gracias <3","replies":[]},{"poster":"SkinHead 7w7","date":"2017-09-30T16:26:24.795+0000","up_votes":1,"down_votes":0,"body":"Tengo u a duda sobre jhin la cual en su pasiva dice que si aumenta su velocidad de ataque con fuentes exteriores entonnces la runa tempo letal le da velocidad de ataque o solo ad?","replies":[{"poster":"Ruphian","date":"2017-09-30T21:23:46.617+0000","up_votes":1,"down_votes":0,"body":"le va a dar mas ad","replies":[]}]},{"poster":"Ruphian","date":"2017-09-30T21:21:30.802+0000","up_votes":1,"down_votes":0,"body":"Malzahar, Vladimir, Swain, siento que esos campeones no tienen una runa clave que les quede bien, quizas la de las almas de la rama de destruccion, pero solo leyendo no me cierra.\nLeBlanc, a menos que electrocutar se active con las dos instancias de daño de su e, creo que tampoco le queda ninguna runa clave, la del cometa no me convence, porque cualquier campeon con dashes la esquiva.\nSiento que los colosos estan obligados a llevar asimiento del agonico SIEMPRE, TODOS.","replies":[]},{"poster":"Darwin","date":"2017-09-30T14:57:54.741+0000","up_votes":1,"down_votes":0,"body":"Bueno, Finalmente llego el dia en que la \"Jugabilidad\" entra en \"aguas turbias\" jajaja,,, la Preteomporada. Este año viene as complejo que otros. Estuve armando paginas de runas nuevas, y la verdad me abrume con tanta informacion. No va a ser la primera vez que me pongo a estudiar el juego, pero este tiempo de cambios grandes y complejos me hace preguntar como va a impactar en la delgada linea de jugadores que separan lo que Quieren mejorar y subir con los que les da igual, y que por supuesto, son emparejados juntos.","replies":[]},{"poster":"Annie Botz","date":"2017-09-29T19:30:59.532+0000","up_votes":2,"down_votes":3,"body":"¿Por qué no hablan de los afk que salen en todas las partidas?\nNo me quejaría si fuera ocasional pero es demasiado constante, de 8 partidas 2 fueron remake y en dos tuve un afk después del tiempo para remake...","replies":[{"poster":"Hnk Kenshiro","date":"2017-09-30T03:21:02.950+0000","up_votes":1,"down_votes":0,"body":"Exca ya dijo que 20% de las partidas tienen algún afk o hay reportes, así que lo que estás cerca de la estadística xD","replies":[]}]},{"poster":"The Steel Shadow","date":"2017-09-30T02:44:59.250+0000","up_votes":1,"down_votes":1,"body":"Gracias por el hotfix 2 a Janna, pero un 3ro estaría bien si no logra llegar al 49 % que debería tener por ser tan fácil","replies":[]}]}