{"poster":"Lusted Shadow","date":"2017-01-11T21:50:21.898+0000","title":"[Concepto de Campeon] Kiah - La Segadora de la Oscuridad","subforum":"Creaciones de la comunidad","up_votes":21,"down_votes":3,"body":"Muy buenas invocadores {{item:3681}} \r\n\r\nHe estado mucho tiempo pensando en ideas para algun campeon, comence a escribir un poco sobre sus habilidades... historia... y ahora creo que finalmente intentare probar suerte y publicarlo ^^^\r\n\r\n--------------------------------------------------------------------------------------------------------------------------\r\n\r\n**INFORMACION DEL CAMPEON**\r\n\r\nNombre: Kiah (Nombre Completo: Mei Kiah Ranjing) \r\nApodo: La Segadora de la Oscuridad\r\nRol: Asesino\r\nTipo de campe&oacute;n: Distancia\r\nCalle: Midlane\r\nRecurso: Energia\r\nProcedencia: Jonia\r\n\r\n---------------------------------------------------------------------------------------------------------------------------\r\n\r\n**ESTADISTICAS BASE**\r\n\r\nVida: 580 (+86 por nivel)\r\nDa&ntilde;o de Ataque: 65 (+4,30 por nivel)\r\nVelocidad de Ataque: 0.70 (+2% por nivel)\r\nVelocidad de Movimiento: 390\r\nRegeneraci&oacute;n de Vida: 5.5 (+0,40 por nivel) \r\nArmadura: 25 (+4,1 por nivel)\r\nResistencia M&aacute;gica: 30 (+2,1 por nivel)\r\nRango: 475\r\n\r\n--------------------------------------------------------------------------------------------------------------\r\n\r\n**APARIENCIA**\r\n\r\nKiah es una mujer de estatura media, de piel muy palida, ojos oscuros, pelo corto (Bob) de color blanco. Viste atuendos similares a un &quot;[Goth Ninja](http://31.media.tumblr.com/0b4366154f83d50c052d4eb3f83be43d/tumblr_mv199s0So71qm2nu7o1_1280.jpg)&quot;, utiliza una gabardina femenina negra abierta, un peto de mallas negro, unos pantalones negros ajustados, cadenas como cinturon, mu&ntilde;equeras grises en donde amarra sus cadenas, las cuales utiliza como arma, en su espalda lleva una Katana, en sus piernas lleva Karambits y Kunais. Kiah no utiliza mascara completa, solo cubre su boca. \r\n\r\n------------------------------------------------------------------------------------------------------------------\r\n\r\n**ANIMACIONES**\r\n\r\n_Animacion de auto-ataque_ \r\n\r\n. Kiah lanza una  cadena hacia el enemigo, golpeandolo con la punta, en donde se haya una peque&ntilde;a Karambit.\r\n\r\n_Animacion de muerte_ \r\n\r\n. Kiah cae de espaldas, donde espectros oscuros salen del suelo,  atandola con cadenas, para luego enterrarla entre las sombras.\r\n\r\n_Animacion de Vuelta a Base_ \r\n\r\n. Kiah hace un juego de cadenas, donde de estas emanan sombras que la rodean, creando una cortina de sombras.\r\n\r\n_Animacion de reaparicion_ \r\n\r\n. Kiah rompe la cortina de sombras con sus cadenas, haciendolas girar por un breve momento.\r\n\r\n--------------------------------------------------------------------------------------------------------------------------\r\n\r\n**HABILIDADES**\r\n\r\n**Pasiva**: Cadenas de Odio.\r\n\r\n. _Cadenas de Odio_: Cada tecer salto con Relampago Oscuro, Kiah cargara sus cadenas con energia de las sombras, causando da&ntilde;o magico adicional en el proximo ataque basico si el enemigo esta por debajo del 50% de su vida. (Inflingir Cadenas de Odio resetea las cargas de Relampago Oscuro si se mata al enemigo)\r\n\r\n. _Segadora de las Sombras_: Aumenta el rango de _Una con las Sombras_ cada vez que se utilice para asesinar un campeon (10+ por Asesinato [Max: 3 Distancia Adicional] + 300 s. Enfriamiento por carga)\r\n\r\n**[Q]** Rasgadora de Almas\r\n\r\n. Kiah lanza sus cadenas cargadas con energia oscura frente a ella hacia dos lugares, si asesta a dos enemigos, los relentiza, luego de unos momentos atrae sus cadenas, rasgando a los enemigos y causando 20/30/50/60/100 (+50% AD) de da&ntilde;o fisico. Si asesta a un solo enemigo con una cadena, se puede relanzar _Rasgadora de Almas_ para atrapar con la segunda cadena al enemigo, causando da&ntilde;o adicional (50 + 1% Vida que el falte al objetivo como da&ntilde;o magico)) y atrayendo al enemigo. (Si no se relanza, solo contara el primer da&ntilde;o)\r\n\r\nRango: 650\r\nCoste: 70/65/55/45/40 Energia.\r\nEnfriamiento: 15 Segundos (-2 por nivel de habilidad) \r\n\r\n**[W]** Filo Creciente.\r\n\r\n. Kiah blande las Karambit de sus cadenas y gira golpeando en area infligiendo 50 (En todos los niveles) (+100 AD) de da&ntilde;o fisico si golpea con las cuchillas, el da&ntilde;o se reduce un 50% si impacta con las cadenas. Si se lanza hacia un enemigo lejano, Kiah saltara hacia adelante a una corta distancia. Kiah recupera 30 Energia por cada _campeon enemigo_ golpeado con las cuchillas, si golpea con las cadenas, esta _no recupera_ energia.\r\n\r\nRango: 300\r\nCoste: 80/75/70/50/40 Energia.\r\nEnfriamiento: 20 Segundos (-3 por nivel de habilidad) \r\n\r\n**[E]** Relampago Oscuro\r\n\r\n. Kiah se lanza entre las sombras para alcanzar a un enemigo cercano [5 Max.]. Aplica cargas de _Cadenas de Odio_.\r\n\r\nRango: 475\r\nCoste: 10 Energia (Todos los niveles)\r\nEnfriamiento: 5 segundos si no se selecciona ningun enemigo. 2 segundos si se lanza a un aliado. 1.5 segundos si se selecciona un enemigo.\r\n\r\n**[R]** Una con las Sombras\r\n\r\n.  Kiah se cubre de energia oscura, usando las Karambit de sus cadenas, se avalanza sobre un campeon enemigo, atravezandolo e infligiendo 100/250/350 de da&ntilde;o fisico (+70% AD). Si el objetivo ha sido atraido con _Rasgadora de Almas_, se activa _Sello de las Sombras_. Si el objetivo es asesinado, el enfriamiento de Una con las Sombras se resetea. (Esto sucede solo una vez).\r\n\r\n**Pasiva** Sello de las Sombras: Si el enemigo ha sido atraido con _Rasgadora de Almas_ se le inflige da&ntilde;o fisico adicional (1% AD Bonus) como sangrado por 2 segundos.\r\n\r\nRango: 670 (+30 por cada carga de Segadora de las Sombras)\r\nCoste: Primer lanzamiento: Sin Costo. Segundo Lanzamiento: 50 Energia.\r\nEnfriamiento: 90 segundos (-15 por nivel de habilidad)\r\n\r\n----------------------------------------------------------------------------------------------------------------\r\n\r\n**HISTORIA**\r\n\r\nEl tiempo se detuvo para ella, vio como una traicion destruyo su vida sin piedad, solo le quedaba huir sin mirar atras, ignorando toda consecuencia que esto traeria. \r\n\r\nEn tiempos pasados fue una estudiante excepcional a temprana edad, estaba destinada a ser la mejor ninja, la nueva maestra y protectora de un clan desconocido, ya que fue capaz de sobrepasar todos los limites, superando incluso a sus maestros. Cierto dia, su Padre,  el honorable lider, tuvo que salir de la aldea debido a conflictos con algo llamado &quot;La Orden Kinkou&quot;, pero despues de esto, jamas volvio, ella lo espero dias, semanas... meses, pero nunca se volvio a saber de el.\r\n\r\nAl pasar del tiempo, conocio a Irelia, hija de un famoso espadachin, heredera del estilo Hiten, se la presentaron como su nueva maestra, ya que, debido al potencial que Kiah tenia, debia dominar las diferentes artes, para poder proteger a su clan de una inminente destruccion. Kiah, asumiendo la muerte de su Padre, se dispuso a asesinar sin piedad a quien se haya atrevido a hacerlo. Como era de esperarse, Kiah supero tambien a su nueva maestra, la cual orgullosa de ella, le regalo una extra&ntilde;a arma que ella denomino &quot;Hilos de Luz&quot;, eran unas cadenas blancas, con algo que parecia una cuchilla enganchada en la punta, Kiah las acepto y comenzo a practicar.\r\n\r\nIrelia y Kiah, rompieron el lazo de Maestra/Estudiante, hacia uno mas amistoso, entrenaban juntas, asistian a reuniones entre clanes juntas, tenian una importante relacion. Luego de &quot;La Distincion&quot; Kiah conocio a una Duquesa, llamada Karma, esta le pidio que hiciera una investigacion al clan &quot;Kinkou&quot;, y que si esta daba frutos, su clan seria protegido por ella misma, Irelia se nego completamente, pero Kiah sentia la necesidad de saber que era ese clan, que sucedio con su padre, por lo que acepto a pesar de la advertencia de Irelia.\r\n\r\nAl seguir el mapa que Karma le habia entregado, Kiah logro llegar a un templo, pero este estaba totalmente en la oscuridad, no habia absolutamente nadie en los alrededores, por lo que Kiah dudo en husmear en ruinas desconocidas, su curiosidad era demasiado grande para dejarlo todo en un misterio, por lo que se dispuso a entrar al templo, pero un tenue sonido y una silueta entre las sombras le alerto, era una enorme Shuriken dirijiendose hacia su cuello, la velocidad a la que iba era extremadamente rapida, por lo que utilizo sus cadenas para desviarla, un tenebroso ninja la habia lanzado, estaba en el techo del templo, Kiah se preguntaba como pudo verla entre tanta niebla y oscuridad.\r\n\r\n.- &iquest;Quien eres?, &iquest;Acaso quieres desafiarme?\r\n\r\n.- Si estas aqui, si has llegado aqui, tu unica opcion es unirtenos o morir.\r\n\r\n.- &iquest;Unirme a ti? Jamas traicionaria a mi clan.\r\n\r\n.- Entonces es tu fin.\r\n\r\nLuego de una brutal, larga y dura pelea, el misterioso ninja acabo siendo victorioso, pero no la asesino, solo se acerco a ella, le dijo unas palabras y se desvanecio entre las sombras.\r\n\r\n.- Eres impresionantemente fuerte, no se quien seas, o a que linaje pertenezcas, pero La Orden de las Sombras no te cerrara las puertas.\r\n\r\nMalherida, Kiah intento volver a su aldea, pero la gravedad de sus heridas le impidio continuar, cayendo inconsciente. \r\n\r\nPaso un dia, Kiah desperto debil y sin fuerzas, intento continuar como pudo, pero al llegar, el dolor solo se intensificaria, su aldea, su clan, su templo... todo estaba destruido y calcinado. Kiah, arrastrandose entre los cadaveres de sus maestros, de sus amigos, de sus familiares, libero un grito devastador. Despues de unos momentos de llanto, Irelia aparecio detras de ella, corrio para abrazar a su amiga, pero esta la empujo, salio huyendo, Irelia intento seguirla, le gritaba que Karma le habia tendido una trampa, que todo fue un plan para eliminar a su clan por la union de artes que se hicieron, pero Kiah simplemente no queria detenerse, cada paso que daba la volvia mas debil, cuando sus piernas ya no dieron mas, cayo al piso, incapaz de moverse, Irelia se acerco a ella e intento curar algunas de sus heridas. \r\n\r\nPasaron algunas horas, Karma sospecho que Irelia no obedeceria la orden de asesinar a Kiah, por lo que tomo las riendas del problema por su cuenta, y se dispuso a ir a buscarlas, para eliminarlas a las dos. Cuando Karma llego al lugar, Irelia se levanto y sin dudar ni un solo momento, ataco a Karma con todo su poder, pero esta tenia demasiado poder, Irelia no pudo derrotarla, por lo que intento tomar a Kiah para marcharse, pero Karma no lo permitio, dejandola muy herida, ambas incapacitadas, Karma solo debia terminar con todo, pero no podia hacerlo, estimaba demasiado a Irelia como para matarla por una simple ninja, de repente, en un fragmento de segundo todo el lugar se torno oscuro, Kiah le dijo a Irelia que no se alejara de ella, sabia lo que pasaria. Era el ninja misterioso de antes, Zed, como lo llamo Karma, tuvieron una larga pelea, Karma no podia con la velocidad y el poder que tenia el ninja, por lo que se retiro al verse en peligro.\r\n\r\nZed ofrecio sus ense&ntilde;anzas a Kiah, y esta las acepto, Irelia sorprendida y asustada, le pidio que rechazase la oferta, a lo que Zed la tomo por el cuello, levantandola, no toleraria tal insolencia, pero Kiah le pidio que la dejara ir, que era su amiga, y este accedio. Kiah le pidio a Irelia que no le guarde resentimiento a Karma, ya que lo hizo por el bien de Jonia, Irelia no comprendia, pero no tenia opcion, y prometiendole no hacerlo, se despidieron. Dejando a Irelia sola en el bosque, Zed y su nueva estudiante se desvanecieron entre las sombras. \r\n\r\nKiah desde entonces ha sido miembro de La Orden de las Sombras, siguiendo con el codigo impuesto por su maestro. Hasta ahora, jamas se arrepintio de no haber huido, esto le hizo encontrar un hogar entre la oscuridad, un alivio para su dolor.\r\n\r\n&quot;No permitire que me vuelvan a da&ntilde;ar, mis cadenas envueltas de odio arremeteran contra cualquiera que se interponga en mi camino.&quot; \r\n- Kiah\r\n\r\n---------------------------------------------------------------------------------------------------------------------\r\n\r\n**RELACIONES**\r\n\r\n_Aliados_\r\n\r\n{{champion:238}}  {{champion:39}} \r\n\r\n_Rivales_\r\n\r\n{{champion:84}}  {{champion:43}}  {{champion:98}}  {{champion:85}} \r\n\r\n---------------------------------------------------------------------------------------------------------------------------\r\n\r\n**FRASES**\r\n\r\n_[Voz: Tiene un parecido con la de Akali.]_\r\n\r\n_**Movimiento**_\r\n\r\n. Sus ojos me mostraron un nuevo camino.\r\n. Caminaba por una senda de dolor.\r\n. Mis cadenas estan hambrientas de sangre.\r\n. Ya no hay compasion.\r\n\r\n_**Bromas**_\r\n\r\n. (Kiah gira sus cadenas, las cuales impactan a un pajaro) Ups, no lo vi.\r\n. (Kiah lanza una cadena y esta se corta) Diablos, y no tenia seguro...\r\n\r\n_**Taunts**_\r\n\r\n. (Kiah gira sus cadenas/Las lanza en forma de cono) Sera mejor que cierres los ojos/No querras ver tus organos volando por los aires.\r\n. (Misma animacion) Mis cadenas/No son para nada inofensivas.\r\n\r\n_**Baile**_ \r\n\r\n. Kiah comienza a levitar, sus cadenas y un aura oscura la rodean, girando alrededor de ella.\r\n\r\n_**Risa**_ \r\n\r\n. Kiah gira una cadena rapidamente, y suelta una carcajadas burlesca. \r\n\r\n---------------------------------------------------------------------------------------------------------------------------\r\n\r\n**INTERACCIONES CON CAMPEONES**\r\n\r\n{{champion:238}} \r\n\r\n. Entiendo tu dolor, Zed, lo he sentido... cuando te vi a los ojos.\r\n. No siempre podras ocultarte entre las sombras.\r\n. Te debo mi vida, Maestro, La Orden de las Sombras jamas caera.\r\n\r\n{{champion:39}} \r\n\r\n. Como en los viejos tiempos.\r\n. Jamas olvidare lo que hiciste por mi.\r\n. No dejare que nadie te ponga las manos encima, a pesar del camino que he elegido.\r\n\r\n{{champion:98}} \r\n\r\n. El equilibrio es para los debiles Shen, malgastas tu poder sirviendo a ellos.\r\n. Tu padre fue patetico, sus acciones no son dignas de un verdadero maestro.\r\n\r\n{{champion:43}}  \r\n\r\n. Tu traicion marco mi vida, pero te lo agradezco, gracias a eso que estoy aqui.\r\n\r\n{{champion:85}} \r\n\r\n. Las ratas no pueden ser ninjas.\r\n\r\n{{champion:84}} \r\n\r\n. &iquest;Que se siente saber que moriras sola?\r\n. Quizas antes me superabas, pero ahora... no me llegas ni a los talones.\r\n\r\n{{champion:202}} \r\n\r\n. Adoro tu arte, pero tu vestimenta es ridicula.\r\n. &iquest;Una mascara?, &iquest;Quieres ocultar tu falta de carisma?\r\n. Cinco.\r\n\r\n{{champion:55}} \r\n\r\n. Veo que no eres la unica con un amor secreto.\r\n\r\n{{champion:119}} \r\n\r\n. Eres tan desagradable... disfrutare tanto despellejar ese rostro que tanto amas... \r\n\r\n{{champion:157}} \r\n\r\n. Tantos gritos me marean... &iquest;No puedes luchar sin gritar como idiota?\r\n\r\n{{champion:412}}  \r\n\r\n. Veo que tenemos gustos en comun.\r\n. Las tuyas atrapan, las mias matan.\r\n\r\n---------------------------------------------------------------------------------------------------------------------------\r\n\r\n**INTERACCIONES CON OBJETOS**\r\n\r\n{{item:3031}} \r\n\r\n. Creo que tengo suficiente &quot;Filo&quot;.\r\n\r\n{{item:3071}} \r\n\r\n. Me encanta la oscuridad.\r\n\r\n{{item:3142}} \r\n\r\n. Creo que soy lo suficientemente rapida.\r\n\r\n{{item:3742}} \r\n\r\n. No caere como tu lo hiciste.\r\n\r\n{{item:3046}} \r\n\r\n. Me pregunto si le pertenece a el...\r\n\r\n{{item:3812}} \r\n\r\n. Mi danza favorita.\r\n\r\n---------------------------------------------------------------------------------------------------------------------------\r\n\r\nRespondere a todo tipo de criticas en comentarios siempre y cuando sean escritas de manera objetiva y respetuosa ^^ \r\n\r\nGracias por leer mi concepto de campeon, espero les haya gustado.","replies":[{"poster":"Capitana Beryl","date":"2017-01-11T21:55:47.632+0000","up_votes":6,"down_votes":0,"body":"https://i.gyazo.com/e4a1670542f4b279ed8988fb9d30105d.jpg","replies":[]},{"poster":"AxGod","date":"2017-01-12T13:33:53.998+0000","up_votes":2,"down_votes":0,"body":"No me convence el apodo, al estar en la oscuridad ya estas segado, pero con su apodo estas recontra segado jaja\n{{sticker:zombie-brand-mindblown}} \n\npero la verdad es interesantisimo, lo que me gusta mas es que el maestro es zed{{champion:238}} , estaria bueno que aparezca ahora un aprendiz de shen{{champion:98}}  y pfff quilombo familiar\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Lusted Shadow","date":"2017-01-12T16:35:22.422+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=dieguitoplenzik,realm=LAS,application-id=J0mxKtkB,discussion-id=NJWmx8YL,comment-id=0009,timestamp=2017-01-12T13:33:53.998+0000)\n>\n> No me convence el apodo, al estar en la oscuridad ya estas segado, pero con su apodo estas recontra segado jaja\n> {{sticker:zombie-brand-mindblown}} \n> \n\n\n\"**Segar**, _verbo transitivo_, cortar de un golpe, especialmente lo que está más alto y sobresale.\" \n\nCreo que estas lo confundiendo con \"cegar\" amigo:( {{item:3681}}","replies":[]}]},{"poster":"Flisher","date":"2017-01-12T05:20:05.344+0000","up_votes":2,"down_votes":0,"body":"Es como si {{champion:91}}  y {{champion:238}}  tuvieran una hija entrenada por {{champion:268}}","replies":[]},{"poster":"Eishiro20","date":"2017-01-11T22:22:31.412+0000","up_votes":2,"down_votes":0,"body":"me pareció una idea interesante, me gusto bastante su historia e interacciones con los demás personajes.","replies":[]},{"poster":"Kiah","date":"2017-03-12T23:34:45.834+0000","up_votes":1,"down_votes":0,"body":"vengo algo tarde LÑAKSDÑLKSADÑLSKÑLKAD pero su nombre se parece a uno que conozco xDDD","replies":[]},{"poster":"SV 001","date":"2017-01-17T14:58:53.912+0000","up_votes":1,"down_votes":0,"body":"La historia es aceptable si dejamos de lado el hecho de que ningún campeón (a cierta ecepción de Maestro Yi) acepta estudiantes y los entrena.\n\nLas habilidades tienen sinergia,pero su uso se ve algo similar en cuanto a una interacción de combate como asesino.\n\nLas interacciones con campeones son muy malas (en mi opinión) y no dan mucho a entender respecto a los conocimiento de dicho campeón en lo completo.\n\nTe doy 5/10,si alteraras un poco su historia para no involucrar campeones.\n\n> Tienes talento,lastima que lo desperdicias.","replies":[{"poster":"Lusted Shadow","date":"2017-01-18T02:01:23.391+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bruno Acosta,realm=LAS,application-id=J0mxKtkB,discussion-id=NJWmx8YL,comment-id=000d,timestamp=2017-01-17T14:58:53.912+0000)\n>\n>Ningún campeón (a cierta ecepción de Maestro Yi) acepta estudiantes y los entrena.\n\nSeguramente ni siquiera te has molestado en leer el lore de Zed... \n\n>_\"Zed es el maestro de la Orden, y su mandato es sencillo: perfeccionar la técnica propia y matar a todos los ninjas que se **niegan a abrazar las sombras**\"_\n\nSi no lo entiendes lo explicare: Lo que quiere Zed es reunir ninjas que quieran \"abrazar a las sombras\", en pocas palabras, unirse a la Orden y de lo contrario, asesinarlos. Si no entiendes el conexto de la historia lo explicare tambien: Zed vio un gran potencial en Kiah como Ninja debido a la ardua batalla que le dio (Consideremos que Zed es el \"legendario\" ninja que desbloqueo las antiguas artes prohibidas, y aun asi una simple ninja con cadenas le dio batalla), por lo que le dio la oportunidad de reconsiderar su decision y asi tenerla en su clan.\n\n>\"Su uso se ve algo similar en cuanto a una interacción de combate como asesino\"\n\nExplicate. No entendi nada.\n\n>\"Te doy 5/10, si alteraras un poco su historia para no involucrar campeones\"\n\nNo busco tu aprobacion, si no te agrado mi concepto, pues lastima, agradezco tus opiniones. \n\nLo que busco con esta campeona es darle un aliado a Zed, y que esta tenga firme relacion con el personaje en cuestion, para ello requiero obligatoriamente mantenerme ligado al lore principal de los clanes ninja de Jonia, no me gusta la idea de traer un personaje de la nada y que por cosas de la vida conozca a alguien y sean amiguitos por siempre. \n\nSaludos y gracias por tus comentarios {{item:3681}}","replies":[]}]},{"poster":"XMasterLasheronX","date":"2017-01-14T20:10:52.830+0000","up_votes":1,"down_votes":0,"body":"ME ENTANTOOOOOO!!! Es como si viera un Champion SpotLight en el Foro!!! Yo hice una campeona similar pero ''no hice como tu hiciste'' osea no le puse aliados amigos y las cosas que le pusiste como las interacciones a los objetos al caminar increible \nPodrias ver a mi campeona Alessa la sombra carmesi? :3\nPD:Ojala riot se fije en este champ le veo futuro","replies":[]},{"poster":"La corrupción","date":"2017-01-13T03:45:23.844+0000","up_votes":1,"down_votes":0,"body":">Cinco.\n\nhttps://pbs.twimg.com/media/B5FNNw9CMAADTq6.png","replies":[]},{"poster":"KatVay OmegaChan","date":"2017-01-12T18:14:47.161+0000","up_votes":1,"down_votes":0,"body":"Amo la interacción con Katarina {{champion:55}}","replies":[]},{"poster":"ViCo","date":"2017-01-12T04:46:17.533+0000","up_votes":1,"down_votes":0,"body":"me encanto <3 toda la historia, el trama emana mucho sentimiento, las habilidades muy buenas. En resumen Belleza{{champion:202}}","replies":[]},{"poster":"Insane Sir","date":"2017-01-12T01:29:56.147+0000","up_votes":1,"down_votes":0,"body":"alfin un aliado de zed","replies":[]},{"poster":"Wolcen","date":"2017-01-12T01:15:25.974+0000","up_votes":1,"down_votes":0,"body":"Si pudiera te doy 20 likes maestro, me encanto la idea de la campeona y como va Riot con esto de los campeones me encantaría verlo en la Grieta, suerte.{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"UnWe0nCualquiera","date":"2017-01-11T23:05:27.933+0000","up_votes":1,"down_votes":0,"body":"me encanto simplemente maravilloso me imaginaba hasta la cinemática de la historia y toda la verga :v 10/10 una historia entrañable ni muy larga pero tampoco corta con una perfecta combinación de personajes dentro del propio lore del juego, habilidades balanceadas dentro de lo que cabe en el grupo de asesinos un modelo que me imagine como una combinación de lala (monster musume) y lo característico del atuendo de la orden de las sombras (como la parte de la boca de zed pero un tanto mas delgada por ejemplo) sin mencionar lo mejor de todo:\n {{champion:202}} cinco! :v adsfasfsafaf ojala riot hiciera champs con el estilo que describes \n {{champion:238}} aprueba esto(?","replies":[]}]}