{"poster":"ZephyrSempai","date":"2015-06-21T10:13:42.143+0000","title":"Trasferimento skin","subforum":"Aiuto e supporto","up_votes":1,"down_votes":3,"body":"Salve, ieri stavo vincendo la mia terza ranked di fila, ad un tratto mi chiama la mia ragazza che ha un problema a lavoro dicendomi che ci sta uno che la stava insultando e alla fine minacciandola che l&#039;aspettava fuori, ovviamente penso come tutti ho lasciato lol e sono corso da lei per aiutarla e vedere se ci stava ancora questo ma per fortuna non &egrave; successo niente anche se gli avrei strappato il cuore. \r\n\r\nOggi apro lol e mi hanno dato di nuovo 35 partite di draft e 75 di chat limitata ahahhahha ormai ci sono abituato anche se ho imparato a non flammare pi&ugrave;, ammetto che sono dovuto andare afk e mi dispiace ma non potevo fare altrimenti. \r\n\r\nNon ho voglia di fare le 35 draft normale sinceramente, ho un&#039;account lv 8 volevo sapere se potevo almeno passare alcune skin visto che le ho comprate e ci ho speso soldi cosi da non perdere tutto, i champ non mi interessano ma almeno alcune skin fighe come sona pentakill, trymdarene regni di guerra, ww di fuoco.\r\n\r\nGrazie :)","replies":[{"poster":"Firenheit","date":"2015-06-21T10:27:59.388+0000","up_votes":4,"down_votes":0,"body":"Nope.\nBTW le restrizioni chat/ranked non vendono assegnate per AFK, ma per abuso verbale e affini, quindi non c'entra nulla il fatto che tu abbia lasciato il gioco.","replies":[{"poster":"ZephyrSempai","date":"2015-06-21T10:33:02.922+0000","up_votes":1,"down_votes":1,"body":"Davvero? allora non vedo perchè avermele date se non abuso verbalmente perchè ho capito che facendo ciò si gioca male e si rovina il gameplay di squadra. E poi non vedo perchè avrei dovuto flammare se stavo vincendo le ranked o no? \n\nPosso chiederti una cosa, ma se io non abuso verbalmente nessuno, però metti casi alla fine partita che sono andato afk la gente mi reportano uguale per abuso verbale e comportamento negativo, io per il sistema ho abusato verbalmente e ho avuto un comportamento negativo? Chiedo perchè essendo un sistema automatico allora davvero basta un pò di report a buffo e il sistema ti etichetta, dimmi se mi sbaglio.","replies":[{"poster":"Firenheit","date":"2015-06-21T10:46:53.005+0000","up_votes":2,"down_votes":0,"body":"Controlla tra le mail il log.\nDa quello che sono riuscito a interpretare, no, l'abuso verbale si basa su cosa tu hai scritto in partita. Se sei AFK a maggior ragione è un report inutile XD","replies":[]}]}]},{"poster":"R3lion","date":"2015-06-21T14:08:19.848+0000","up_votes":1,"down_votes":0,"body":"ha ragione fire, in pratica questo sistema automatico quando ricevi un tot di report ( quindi in continuazione ) controlla le tue chat e se trova qualcosa ti banna, come risolvere? basta che nn scrivi mai e stai certo che nn ti succede niente,","replies":[]}]}