{"poster":"Jisatsu90","date":"2015-11-15T11:03:51.879+0000","title":"Free Skins von Riot (Version 2.0)","subforum":"Level Up: Guides & Tipps","up_votes":13,"down_votes":1,"body":"Ich habe letztes Jahr irgendwann einen Channel erstellt, in dem ich auf Free Skins von Riot verweise! Durch den Relaunch des Forums ist der aber wohl nicht mit hier her gewandert. 441 Likes sollten Beweis genug sein, dass das hier kein Scam oder &auml;hnliches ist!\r\nViel Spa&szlig; damit!\r\n\r\nDen Originalpost findet ihr hier: http://forums.euw.leagueoflegends.com/board/showthread.php?t=1640816\r\n\r\n\r\n\r\nEDIT: BITTE DEN KOMPLETTEN STARTPOST LESEN BEVOR IHR EINEN FEHLER MELDET! UNTEN STEHT DIE L&Ouml;SUNG ZU DEM ALISTAR_PROBLEM! SELBIGES GILT F&Uuml;R DAS TRISTANA-PROBLEM! GAREN GEHT WOHL NICHT MEHR ABER KANN &Uuml;BER DEN SUPPORT WOHL NOCH GEORDERT WERDEN!\r\n\r\n Eben ausprobiert und auch die alten Aktionen sind immer noch g&uuml;ltig.\r\n\r\n Die neuste Aktion sollte bekannt sein, trotzdem nenne ich sie nochmal .\r\n\r\n\r\n\r\n\r\nGaren + Schreckensritter Garen Skin - Der Garen Skin soll wohl nicht mehr funktionieren. Laut einem Freund bekommt man ihn durch Anschreiben des Supports aber noch immer!\r\n\r\n&gt;  1. Meldet euch bei Twitter an.\r\n&gt;  2. geht auf diesen Link und folgt Riot &uuml;ber diesen Link bei Twitter: http://woobox.com/y53k9k\r\n&gt;  3. Ihr erhaltet nun einen Code!\r\n&gt;  Den gibt ihr in eurem LoL-Clienten unter Shop/Code einfach ein.\r\n\r\n\r\n\r\n\r\nTristana + Riot Girl Tristana Skin (INFO: &Auml;HNLICH WIE BEI ALISTAR GIBT ES AUCH HIER EINEN BUG! MANCHEN WIRD ANGEZEIGT DIE AKTION W&Auml;RE NICHT VERF&Uuml;GBAR. IN DIESEM FALL AN DEN SUPPORT MELDEN, DIE SCHALTEN EUCH DEN SKIN MANUELL FREI) \r\n\r\n&gt;  1. Meldet euch bei Facebook an\r\n&gt;  2. geht auf den folgenden Link und Liket die Offizielle Seite von League of Legends: https://www.facebook.com/leagueoflegends\r\n&gt;  3. geht dann auf die folgende Seite und Ihr erhaltet einen Code: http://woobox.com/pmrvz4\r\n&gt;  4. Den gebt ihr in Eurem LoL-Clienten unter Shop/Code einfach ein.\r\n\r\n\r\n\r\n\r\nFree Alistar + Entfesselter Alistar Skin (INFO: FALLS DIE FREISCHALTUNG &Uuml;BER DEN LINK NICHT FUNKTIONIERT BITTE MIT DEM RIOT SUPPORT IN VERBINDUNG SETZEN. DIE SCHALTEN IHN EUCH DANN FREI\r\n\r\n&gt;  1. Logt euch auf der offiziellen Seite von League of Legends ein.\r\n&gt;  2. Folgt diesem Link: http://youtube.euw.leagueoflegends.com/de/youtube/\r\n&gt;  3. Meldet euch bei Youtube an. Der Champion + Skin wird nun automatisch freigeschaltet.\r\n\r\n WICHTIG! Das ganze ist kein Fake, Scam oder sonnst so ein M&uuml;ll. Alle drei habe ich eben erst freigeschaltet.\r\n\r\n Hier habe ich nochmal einen Link zu einer Website bei der nochmal alles mit den Verlinkungen steht.\r\n\r\nhttp://www.baertv.de/2014/03/15/anleitung-wie-bekomme-ich-tristana-alistar-und-garen-mit-einem-skin-kostenlos/\r\n\r\n Update: Beim Alistar-Skin scheint bei manchen Beschw&ouml;rern das Problem aufzutauchen dass der Skin nicht freigeschaltet werden kann. In diesem Falle wendet euch bitte an den Support (Oben Rechts &quot;Hilfe und Support&amp;quot. Die werden euch den Champ und den Skin dann manuell freischalten. Bei &auml;hnlichen Problemen sollte es auf die gleiche Weise funktionieren. Bei dem Tristana-Bug gilt das gleiche Vorgehen.\r\n\r\n Wenn ein Link tot ist, sagt mir bitte bescheid damit ich mich darum k&uuml;mmern kann.","replies":[{"poster":"Cubevolume","date":"2016-07-14T09:52:03.200+0000","up_votes":1,"down_votes":0,"body":"Ali funktioniert nicht und der Support bringt mich nicht weiter :(","replies":[]},{"poster":"bonny301","date":"2016-01-05T10:23:32.196+0000","up_votes":1,"down_votes":0,"body":"Ich kann nicht auf die Seite von {{champion:12}}  ,weißer Screen","replies":[]},{"poster":"xTHZx DevilNova","date":"2015-12-03T23:34:40.820+0000","up_votes":1,"down_votes":0,"body":"ich hab immer noch n problem mit {{champion:12}}  :/","replies":[{"poster":"SNKFreak","date":"2015-12-04T03:15:10.452+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NovaFlameBird,realm=EUW,application-id=vatevpvi,discussion-id=Gl0xAfUj,comment-id=0005,timestamp=2015-12-03T23:34:40.820+0000)\n>\n> ich hab immer noch n problem mit {{champion:12}}  :/\n\nSteht doch weiter oben, Support anschreiben, die schalten dir dann den Skin mit Alistar zusammen frei.","replies":[]}]},{"poster":"Adashino","date":"2015-11-23T12:25:24.638+0000","up_votes":1,"down_votes":0,"body":"Bei mir hatte der Tristanecode das letzte Mal nicht funktioniert, hoffe es funktioniert jetzt endlich, danke Dir :3 {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"xTHZx DevilNova","date":"2015-11-18T11:40:32.111+0000","up_votes":1,"down_votes":0,"body":"cool funktioniert wirklich danke dir \n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Ehren Teemo","date":"2015-11-15T13:03:08.873+0000","up_votes":1,"down_votes":0,"body":"Schade das ich schon alle codes genutzt habe :(","replies":[]},{"poster":"Ünterhose","date":"2015-11-19T18:46:03.755+0000","up_votes":1,"down_votes":1,"body":"bei mir tritt ein fehler auf wenn ich alistar bekommen will es steht wie folgt da : \"Es ist ein Fehler beim Hinzufügen des Alistar-Skins zu deinem Konto aufgetreten. Bitte versuche es später nochmal. \" was kann ich machen? danke im voraus ;) {{sticker:zombie-brand-mindblown}} {{champion:12}} ","replies":[]},{"poster":"pppJackDaniels","date":"2015-11-16T13:45:58.964+0000","up_votes":1,"down_votes":1,"body":"Habe leider schon alle, hatte mich auf was neues gefreut - Schade. :/\n\nFür alle die es nicht wussten - HOT!!\n\nLG\nJack Daniels - Whisky {{champion:53}}","replies":[]}]}