{"poster":"SSG Chidori","date":"2017-08-12T14:14:36.231+0000","title":"Mit welchen Supportern kann/soll man im early game roamen, oder sollte man das überhaupt?","subforum":"Champions & Gameplay","embed":{"description":"How does a support carry? How does a Support hit Rank 1 challenger? Check out Olleh's stream! https://www.twitch.tv/olleh https://twitter.com/jjoosung My shit https://twitter.com/DonghuapLol?lang=en","url":"https://www.youtube.com/watch?v=2BxZV6LaArs","image":"https://i.ytimg.com/vi/2BxZV6LaArs/hqdefault.jpg"},"up_votes":1,"down_votes":0,"body":"Hallo Leute, ich bin ein Silber2 Support Main, und habe ein Youtube-Video gesehen in welchem der Spielstil von einem NA-Challenger Supporter vorgestellt wurde. Dieser besteht aus roamen im early game. Ich habe mich gefragt, ob ich dass bei mir umsetzen kann. Ich spiele Leona, Braum und Soraka, kann man mit diesen gut roamen? Ich w&uuml;rde mal denken eher schon, bei soraka k&ouml;nnts schwer werden, aber trotzdem m&ouml;glich. Eine weitere Frage die ich mir stelle ist, wie tiltproof mein adc ist wenn ich mal 2 Minuten weg bin?","replies":[{"poster":"FDG DragonSlayer","date":"2017-08-12T19:55:38.710+0000","up_votes":1,"down_votes":0,"body":"Bitte lerne zuerst wann es sich lohnt zu roamen bevor du es tust :)","replies":[]},{"poster":"mondmann97","date":"2017-08-12T15:20:11.351+0000","up_votes":1,"down_votes":0,"body":"Wie tiltproof dein Adc ist? Ich würde eher gerne wissen wie tiltproof du und dein Team seid wenn der Adc nach 10 Minuten 5Farm und 6Tode hat. \nEs ist ein Unterschied ob man Challenger Adc oder Silber Adc ist. Ich kann mich zB recht gut positionieren, ein 2vs1 kann ich jedoch nicht spielen. Außnahme ist ezreal, der mach aber 0Schaden an Tanks und ist atm. der schlechteste Adc. \n\nZudem müssen deine Roams dann auch von den Mitspielern gewollt und akzepiert sein, wenn dein Jungler nur wenig gankt ist es noch sinnloser. Und wenn deine Roams keine erfoge erzielen ist es verschwendete Zeit.\n\nDu kannst so in Flex mit 4 Premades spielen, in Soloq jedoch niemals. Denn in Silber wird anders als in Challenger gespielt. Es gibt eine andere Meta.\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Allerbester Biss","date":"2017-08-12T14:25:32.132+0000","up_votes":1,"down_votes":0,"body":"IN Silber wirst du zugepflastert werden und gleichzeitig seh ewahrscheinocu das Spiel verlieren weil dein adc dann keinen Plan hat, wie er zu spielen hat.","replies":[]}]}