{"poster":"Alatreon222","date":"2019-11-16T15:16:33.431+0000","title":"Remake funktioniert nicht!","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Hallo,\r\nHeute habe ich das 2. Game innerhalb von ein paar Tagen gehabt, in denen ein Spieler in meinem Ranked Game komplett afk war, sich nicht ein einziges Mal bewegt hat und wir konnten dennoch nicht remaken?!\r\nWie kann es sein, dass solche offensichtlichen Bugs bis heute nicht behoben worden sind?\r\nEs ist einfach zum kotzen, wenn dieser Bug wohlmöglich mir die Möglichkeit genommen hat, diese Season Platin zu erreichen.\r\nUnd fixt zudem bitte noch die 20 anderen Bugs, die das Game beim Connect/Client hat!\r\nDenn wenn die Bugs mir mittlerweile regelmäßig meine Games verlieren, hat das Spiel keinen Sinn, gespielt zu werden....","replies":[{"poster":"Khanysha","date":"2019-11-16T16:14:40.860+0000","up_votes":1,"down_votes":0,"body":"Hatte er einen leaverbuster? Wenn nicht stand er nur afk rum, wenn doch dann solltest du den Bug melden.","replies":[{"poster":"YODλ","date":"2020-02-05T10:14:57.770+0000","up_votes":1,"down_votes":0,"body":"Das kannst du Riot 100 mal melden das interessiert absolut 0.\nhatte gerade ebenfalls ein spiel mit einem afk der sich nicht 1 mal bewegt oder etwas gekauft hat.","replies":[]}]},{"poster":"Yuiwara","date":"2019-11-16T19:43:24.902+0000","up_votes":1,"down_votes":0,"body":"Er muss halt vom system als disconnected registriert sein. hatte auch schon paar spiele von anfang an 4 vs 5, weil remake nicht ging bevor zeit abläuft. muss man halt mit leben.","replies":[{"poster":"Phoenixale","date":"2019-11-20T04:09:03.625+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Yuiwara,realm=EUW,application-id=ImBE6GqA,discussion-id=yHJLJuAp,comment-id=0002,timestamp=2019-11-16T19:43:24.902+0000)\n>\n> Er muss halt vom system als disconnected registriert sein. hatte auch schon paar spiele von anfang an 4 vs 5, weil remake nicht ging bevor zeit abläuft. muss man halt mit leben.\n\nNein muss er nicht. Solange du dich nicht bewegst kann ein Remake eingeleitet werden. Aber wie eigentlich schon fast jeder berichtet, funktioniert dies nicht immer - 50/50 Chance..... Und das nervt!","replies":[]}]},{"poster":"Zavolta","date":"2019-11-16T16:28:50.102+0000","up_votes":1,"down_votes":0,"body":"Hatte der Kerl einen \"Keks\" im Inventar? Hab irgendwo gelesen, sobald jemand diese Rune hat und Kekse bekommt... erkennt das der Leaverbuster nicht als AFK...\n{{sticker:slayer-jinx-unamused}}","replies":[]}]}