{"poster":"CorgiBot","date":"2017-03-13T11:29:51.006+0000","title":"\"Unable to connect to the server. \"","subforum":"[ARCHIVED] Help & Support","up_votes":19,"down_votes":1,"body":"This is a new one(for me that is), I had queued up for a match, gotten through bans and champ select and instead of loading I get a black screen with an eventual prompt box saying: \"Unable to connect to the server. Please check your network connection and attempt to reconnect to your game.\"\r\n\r\nI have \"checked my connection\", fiddled with my firewall, and attempted to run in various compatibility/admin modes and all to no avail. The match is probably over now, which is irritating for a multitude of reasons but the most pressing concern is that the client has not given me any options or reverted to a \"not in game\" state.  Any help would be appreciated .\r\n {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"BandleCityWarden","date":"2017-03-13T11:59:41.803+0000","up_votes":6,"down_votes":0,"body":"Are you kidding me I lost all my LP and getting Leaverbuster because of this, happened to me two games in a row, thought it was a fluke the first game. Also I live in Texas.\n\nEdit: Cannot even connect to the News service anymore.","replies":[{"poster":"Zerne","date":"2017-03-13T12:21:12.205+0000","up_votes":2,"down_votes":0,"body":"legit the EXACT SAME THING HAPPEND TO ME they need to give us the LP back and remove leaver busters","replies":[]}]},{"poster":"Wendell","date":"2017-03-13T11:32:24.038+0000","up_votes":4,"down_votes":0,"body":"And now I'm in low priority queue because of this problem. \n\"You are ineligible to earn loot due to leaving or AFK behaviors.\"","replies":[{"poster":"RhInoserocity","date":"2017-03-13T11:52:17.475+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Grab that Neko,realm=NA,application-id=osqw6G4M,discussion-id=bNum3phF,comment-id=0000,timestamp=2017-03-13T11:32:24.038+0000)\n>\n> And now I&#x27;m in low priority queue because of this problem. \n> &quot;You are ineligible to earn loot due to leaving or AFK behaviors.&quot;\n\nI'm ineligible too. First game in literally months with connection issues and I instantly get low priority queue. Don't try to play more games, it'll just increase the damage and take away your loot for longer. I just wish Rito wouldn't punish us for an unknown period of time when it ain't our faults.","replies":[{"poster":"YouerMomsDreams","date":"2017-03-13T11:56:14.064+0000","up_votes":1,"down_votes":0,"body":"Agreed, I got the same thing after getting a chest the game before this issue started. I want that take off RIOT","replies":[]}]}]},{"poster":"pullforfire","date":"2017-03-13T16:26:11.749+0000","up_votes":2,"down_votes":0,"body":"pretty much the same thing happened to me, i tried to rejoin 2 games and both times half of the players could not join so it was remade obviously. unlike him im b5 0LP however to get a 5 game low priority on your fucking birthday sucks. u need to lift the ban on the players. by the way this is not the first time riot has done this and u guys try to take care of the players as the support team but its a reflection of poor management in the sense that its not followed up with a public apology or return of players status to before the changes. that and get rid of the leave buster. you guys dont take care of the real issue with the players who leave but penalize us for stuff like this and go we dont control that. get ur crap together if ur going to be a billion dollar company, and charge people money.","replies":[]},{"poster":"Moonscry","date":"2017-03-13T16:24:34.857+0000","up_votes":2,"down_votes":0,"body":"Having, \"Game has Crashed. Please try to reconnect to the game.\" ,but having no luck in reconnecting. This is for a normal game (draft mode). I am in Nashville.\n\nUpdate: Got a 20 minute Leaverbuster for 5 games. Would Like this reversed please. \n","replies":[]},{"poster":"DarkSoulRawrz","date":"2017-03-13T15:32:34.446+0000","up_votes":2,"down_votes":0,"body":"Got the same here and I'm highly frustrated, the game had been working for the past...10 games or so and I logged off to do somethings and came back and now it refuses to work. Then after a few relogs and closing out of the game it tells me my pvp.net or whatever thing stopped working and I close and relog and it works again. \n\nAfter a while of trying to reconnect to the game instead of saying something is wrong with my internet connection (which there is nothing wrong with it, specially if it was just working for 10+ games) it tells me the 'game has crashed' and to try and reconnect. Which doesn't work at all.","replies":[]},{"poster":"ultrazander007","date":"2017-03-13T15:29:00.701+0000","up_votes":2,"down_votes":0,"body":"RIOT GIVE US OUR LP BACKKKKKKKKK","replies":[]},{"poster":"New Bragga","date":"2017-03-13T15:28:54.085+0000","up_votes":2,"down_votes":0,"body":"Just to add to the list of states. North Carolina affected too.","replies":[]},{"poster":"afarwayaway","date":"2017-03-13T15:27:28.896+0000","up_votes":2,"down_votes":0,"body":"Samesies. :(","replies":[]},{"poster":"Gingers Are Okay","date":"2017-03-13T12:29:16.068+0000","up_votes":2,"down_votes":0,"body":"Just happened to me while trying to play a norms...\nNot the biggest problem but it's quite annoying when you simply want to play a game ^^\"\nI'm from Canada.\n_Edit : I've also been having issues where my pc is unable to connect to my internet while playing league, causing me to need to restart my pc... It is probably not linked to this issue but it's something to bring up. The issue might not even be caused by the game in the first place. _","replies":[]},{"poster":"The Prisoner","date":"2017-03-13T12:00:18.095+0000","up_votes":2,"down_votes":1,"body":"Just lost 20p in rank ;(\nIt has the same issue even in custom game as I just tired. Black screen + \"unable to connect to server...\".","replies":[]},{"poster":"xxxWildKoalaxxx","date":"2017-11-22T01:54:43.132+0000","up_votes":1,"down_votes":0,"body":"Still a problem in New York, November 21st of 2017. Put in low priority q's for the millionth time. About to give up league for awhile","replies":[]},{"poster":"oOKombatWombatOo","date":"2017-03-15T00:29:48.878+0000","up_votes":1,"down_votes":0,"body":"I am now having this issue. Just to make sure you are aware it is a problem.","replies":[]},{"poster":"SpruceGoosse","date":"2017-03-14T23:04:58.091+0000","up_votes":1,"down_votes":0,"body":"Just happened to me too","replies":[]},{"poster":"Broporo","date":"2017-03-13T22:44:18.283+0000","up_votes":1,"down_votes":0,"body":"Earlier this morning we noticed that a widespread issue was causing players to be disconnected before seeing the loading screen. We've been working on the issue, which should be resolved at this time, but you can keep up to date on the matter by checking the post [**here**](http://boards.na.leagueoflegends.com/en/c/help-support/3Lmbjp8Y-3132017-na-server-issues).\n\nWe're on the job to address this issue as fast as we can!\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Chønklord","date":"2017-03-13T23:08:29.814+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Broporo,realm=NA,application-id=osqw6G4M,discussion-id=bNum3phF,comment-id=0024,timestamp=2017-03-13T22:44:18.283+0000)\n>\n> Earlier this morning we noticed that a widespread issue was causing players to be disconnected before seeing the loading screen. We&#x27;ve been working on the issue, which should be resolved at this time, but you can keep up to date on the matter by checking the post [**here**](http://boards.na.leagueoflegends.com/en/c/help-support/3Lmbjp8Y-3132017-na-server-issues).\n> \n> We&#x27;re on the job to address this issue as fast as we can!\n> {{sticker:slayer-jinx-catface}}\n\nIt's great you are aware of and have mostly fixed the connection issues; but what are you doing about compensating the hundreds or even thousands of players that have lost LP, promos, etc? The problem persisted now for about 12 hours -- the whole day -- and not once was loss prevention enabled. Where is the compensation for those of us who had our time and efforts wasted and lost a lot of ranked game progress due to an error on your end?","replies":[]},{"poster":"Dragonslayer RS","date":"2017-03-13T23:01:19.986+0000","up_votes":1,"down_votes":0,"body":"I have seem problem and reported bug and in this board. But my post was deleted. I was winning 33:10 in my rank game. Suddenly 8 players of us disconnected and failed to connect again. All of us lost LP as leaver. Please help us to regain the LP. Thanks. Gain LP is very hard in low elo as too many trolls and feeders here. Please help us.","replies":[]},{"poster":"SwagDaddyHakan","date":"2017-03-13T22:58:21.600+0000","up_votes":1,"down_votes":0,"body":"I seem to be the only one out of every player i know that is still having this issue, any help?","replies":[]}]},{"poster":"SwagDaddyHakan","date":"2017-03-13T22:56:33.094+0000","up_votes":1,"down_votes":0,"body":"This is still happening to me as of 7PM. Eastern Time {{item:3157}} {{item:3157}} {{item:3157}} {{item:3157}}  cmon riot this is absurd","replies":[]},{"poster":"Fokkusu seishin","date":"2017-03-13T17:21:49.805+0000","up_votes":1,"down_votes":0,"body":"So this has happened to me two games in a row now and I just got the leaverbuster message. Rito Please Fix this and remove my bans{{sticker:zombie-nunu-bummed}}","replies":[]},{"poster":"Dee123k","date":"2017-03-13T17:08:21.632+0000","up_votes":1,"down_votes":0,"body":"Yeah I have been getting the same thing too I got a 10 min leaver buster because I kept having to leave also if you check server status (idk what region your in but I'm in north America) it even says they are investigating the problem","replies":[]},{"poster":"Inasume","date":"2017-03-13T16:00:05.886+0000","up_votes":1,"down_votes":0,"body":"I got the issue too, I know it's not my Internet. Ps. I'm in Georgia.","replies":[]},{"poster":"Grisombre","date":"2017-03-13T15:12:23.360+0000","up_votes":1,"down_votes":0,"body":"I have the same issue at the moment :){{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"IittIe baby","date":"2017-03-13T13:48:20.117+0000","up_votes":1,"down_votes":0,"body":"where Riot at doe, they mia{{item:3649}}","replies":[]},{"poster":"Trahp","date":"2017-03-13T13:42:31.115+0000","up_votes":1,"down_votes":0,"body":"LA CA here, i'm having the exact same issues, every time i try to join in a new game i get black screened & the \"unable to connect to the server\" error window. Lost all my LP & leaverbuster penalties just keep refreshing. This is some high grade bullshit, on top of all the balance issues we're getting unjustly punished for their bugs.","replies":[]},{"poster":"Dweezill","date":"2017-03-13T13:35:47.462+0000","up_votes":1,"down_votes":0,"body":"Its even doing it to custom games this whole thing is bullshit","replies":[]},{"poster":"Dweezill","date":"2017-03-13T13:31:43.773+0000","up_votes":1,"down_votes":0,"body":"Oklahoma here and im getting the same thing and its starting to piss me off","replies":[]},{"poster":"Ssscarline","date":"2017-03-13T13:31:05.096+0000","up_votes":1,"down_votes":0,"body":"Same problem here, and I never have connection issues unless the power is out. Comcast, Georgia. There's a new state for the list.","replies":[]},{"poster":"Shaco Booty Girl","date":"2017-03-13T12:59:13.788+0000","up_votes":1,"down_votes":0,"body":"Same Problem. First game (which of course was the first in promos) I just chalked up to a fluke. Happened again on my second game and now I'm a little pissed off.\n\nLost promos, down 18 lp and may have a penalty for leaving? Not ok.","replies":[]},{"poster":"Ring Ding Jjong","date":"2017-03-13T12:57:40.060+0000","up_votes":1,"down_votes":0,"body":"Arizona here. Was on my other account and tried two different game modes to no avail. I hope this gets fixed soon and everyone has their queue/LP status reverted to normal...","replies":[]},{"poster":"Law of John","date":"2017-03-13T12:56:35.625+0000","up_votes":1,"down_votes":0,"body":"Diddnt they move one of the data centers to Chicago or something?  Those of us in the mid-west are getting hit by snow, so maybe someone slid off the road and hit a telephone poll and knocked out power to the data center or something.\n\nI live in Southwest Michigan, on AT&T.","replies":[]},{"poster":"BandleCityWarden","date":"2017-03-13T12:22:14.995+0000","up_votes":1,"down_votes":0,"body":"They've finally updated the service status with this issue.","replies":[]},{"poster":"Zerne","date":"2017-03-13T12:19:47.885+0000","up_votes":1,"down_votes":0,"body":"what the heck i lost my series because of this me and the brand on my team couldnt connect now i got low priority queue explain how this is fair we all have perfect internet connection and the game thinks we are doing afk behavior when you just don't let us load into the game with perfect internet connection.      http://imgur.com/QT1nRHz                              http://imgur.com/b9tNHND","replies":[]},{"poster":"Ebokian","date":"2017-03-13T12:16:20.317+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MissMosura,realm=NA,application-id=osqw6G4M,discussion-id=bNum3phF,comment-id=,timestamp=2017-03-13T11:29:51.006+0000)\n>\n> This is a new one(for me that is), I had queued up for a match, gotten through bans and champ select and instead of loading I get a black screen with an eventual prompt box saying: &amp;quot;Unable to connect to the server. Please check your network connection and attempt to reconnect to your game.&amp;quot;\n> \n> I have &amp;quot;checked my connection&amp;quot;, fiddled with my firewall, and attempted to run in various compatibility/admin modes and all to no avail. The match is probably over now, which is irritating for a multitude of reasons but the most pressing concern is that the client has not given me any options or reverted to a &amp;quot;not in game&amp;quot; state.  Any help would be appreciated .\n>  {{sticker:slayer-jinx-unamused}}\n\nThis is also new for me. I am having the same issue.  I am in Alabama.","replies":[]},{"poster":"RhInoserocity","date":"2017-03-13T12:02:33.637+0000","up_votes":1,"down_votes":0,"body":"And now I'm not allowed to press play either! GG RITO\n\nhttp://imgur.com/a/725F5","replies":[]},{"poster":"Support Mayne","date":"2017-03-13T11:50:58.699+0000","up_votes":1,"down_votes":0,"body":"Oh my I thought it was just me, it's been happening for the past 3 games And it even kicked me out of one of them, won't let me back it at all.\nI'm from California though ","replies":[{"poster":"RhInoserocity","date":"2017-03-13T11:52:59.056+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shenppuku,realm=NA,application-id=osqw6G4M,discussion-id=bNum3phF,comment-id=0006,timestamp=2017-03-13T11:50:58.699+0000)\n>\n> Oh my I thought it was just me, it&#x27;s been happening for the past 3 games And it even kicked me out of one of them, won&#x27;t let me back it at all.\n> I&#x27;m from California though\n\nStop playing. It'll make the 'unable to receive loot' punishment longer!","replies":[{"poster":"Support Mayne","date":"2017-03-13T11:57:46.637+0000","up_votes":1,"down_votes":0,"body":"Haven't gotten busted surprisingly though. Was getting frustrated so decided to look on the web and found this thread. But yeah apparently it's not just east side","replies":[]}]}]},{"poster":"IcedMan","date":"2017-03-13T11:57:32.493+0000","up_votes":1,"down_votes":0,"body":"it happened to me in the first game i it kept dcin me then it went blank and now unable to connect to server it says with black screen then i played the next game with 4 v 4 on aram then i started another game and was unable to connect from the start so now i have 2 leaves... :(","replies":[]},{"poster":"SwainLaneWinGame","date":"2017-03-13T11:52:32.317+0000","up_votes":1,"down_votes":0,"body":"Also in Florida, but using FIOS. I wonder if it's an East Coast problem?","replies":[{"poster":"CorgiBot","date":"2017-03-13T11:55:11.167+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SwainLaneWinGame,realm=NA,application-id=osqw6G4M,discussion-id=bNum3phF,comment-id=0007,timestamp=2017-03-13T11:52:32.317+0000)\n>\n> Also in Florida, but using FIOS. I wonder if it&#x27;s an East Coast problem?\n\nI'm in Indiana and on Comcast, so iunnu about it being an East Coast problem.","replies":[]}]},{"poster":"Baelfael","date":"2017-03-13T11:55:05.852+0000","up_votes":1,"down_votes":0,"body":"Same problem - in my ARAM game, seven of the ten failed to load in. \n\nhttp://i.imgur.com/NlWBEsO.png\n\nHere's hoping they can remove the Leaver Buster penalties after they sort this. :)","replies":[]},{"poster":"HentaiCandyGirl","date":"2017-03-13T11:36:06.296+0000","up_votes":1,"down_votes":0,"body":"I can't even get in a game as we speak. It's for an aram, and the match before we had 2 people on our team and 1 on enemy team not even show up.","replies":[{"poster":"CorgiBot","date":"2017-03-13T11:40:05.060+0000","up_votes":1,"down_votes":0,"body":"Yeah mine was for Ascension, which was well over 30 minutes ago now.","replies":[{"poster":"HentaiCandyGirl","date":"2017-03-13T11:53:40.290+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MissMosura,realm=NA,application-id=osqw6G4M,discussion-id=bNum3phF,comment-id=00010000,timestamp=2017-03-13T11:40:05.060+0000)\n>\n> Yeah mine was for Ascension, which was well over 30 minutes ago now.\n\nWelp that aram game, turned into a 1v1, and my teammate won xD too bad nothing counted with it cause only 2 players were in game.","replies":[]},{"poster":"Nervonous","date":"2017-03-13T11:52:01.789+0000","up_votes":1,"down_votes":0,"body":"Happening to me as well, and yep is also Ascension. Getting the feeling this is a Rito issue not anything we could have done about it.","replies":[]}]}]},{"poster":"CorgiBot","date":"2017-03-13T11:53:37.024+0000","up_votes":1,"down_votes":0,"body":"http://i.imgur.com/AKFezvz.png\n\nClient finally left the game in progress state. Everyone but two people were dc'd, wonder how many of us got penalized over it.","replies":[]},{"poster":"Starfires","date":"2017-03-13T11:48:04.558+0000","up_votes":1,"down_votes":0,"body":"Happening to me too. If it helps, Comcast, Florida.","replies":[]}]}