{"poster":"Held Achilles","date":"2016-11-11T18:37:04.149+0000","title":"Suche ein Clan / Team bin 30 Jahre alt","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo an alle leser und leserinnen,\r\n\r\nich suche ein Clan / Team f&uuml;r Ranked spiele, wo man spass am spielen hat und neue Freundschaften geschlossen werden. Ich bin ein aufgeschlossener und lustiger mensch. Ich spiele LOL jetzt seit ungef&auml;hr einem Jahr und m&ouml;chte noch vieles dazu lernen und besser werden, den ehrgeiz habe ich bereits. Ich bin in der letzten Season Silber 5 gewesen aber habe es nicht drauf angelegt wie gut ich wirklich bin, da ich kein festes Team hatte um Ranks zu spielen, und alleine ist es langweilig. Meine absolute Main Lane ist BOT ADC, aber k&ouml;nnte im Notfall auch Mid oder Top spielen. Jungle und Support habe ich bereits noch nie ausprobiert. Ich w&uuml;rde mich freuen &uuml;ber euer Interesse und ihr k&ouml;nnt mich ja im Game adden unter dem namen IGN: Held_Achilles\r\n\r\nLiebe Gr&uuml;&szlig;e","replies":[{"poster":"JGN Ayushin","date":"2016-11-11T19:27:47.968+0000","up_votes":2,"down_votes":1,"body":"Vielleicht sind wir dann genau das richtige für dich\nWir sind eine Ü18-Community, die außer Normals auch (Team-)Rankeds spielen.\nDa wir auf den Umgang miteinander achten, sind wir eine sehr harmonische Community,\ndie trotz ihrer Größe einen Zusammenhalt der Community zeigt.\nWir freuen uns auf Besuch und bei Fragen oder Interesse kann man mich gerne adden\nhttps://nerdsgocasual.de/\n\nLiebe Grüße\nDio (JGN Ayushin) (kannst mich gerne auch erstmal im game adden und wir können auch quatschen :) )","replies":[]},{"poster":"fess123","date":"2016-11-12T16:56:11.988+0000","up_votes":1,"down_votes":0,"body":"Hi Held_Achilles,\n\ndu hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]}]}