{"poster":"Ryugi Kazamaru","date":"2015-10-05T03:15:35.073+0000","title":"ANNOUNCEMENT - NEED COMMUNITY FEEDBACK","subforum":"Roleplaying","up_votes":5,"down_votes":3,"body":"So...  I&#039;ve been chatting with a Rioter recently, and they&#039;ve expressed interest in trying to help out our community a little bit.\r\n\r\nBefore I say anything more, I want to make one thing VERY CLEAR.  \r\n\r\n**THERE IS NO GUARANTEE THAT THIS WILL HAPPEN.  IT IS A POSSIBLE IDEA THAT WOULD NEED TO BE CLEARED AND OKAY&#039;D BEFORE IT WENT FORWARD.**\r\n\r\nWhat this Rioter has proposed is a halfway compromise of sorts between us being on the sidebar, and where we are now.  In effect, they&#039;re thinking about asking about making a sticky thread on the &quot;Story and Art&quot; boards that would link to us over here.  That Sticky could have some rules and regulations spelled out too, and give people a general introduction to things before they head over here.\r\n\r\nNow, this Rioter is not someone who works on Boards, but they&#039;re willing to ask them about it, and get a response of some kind.  It would still have to be cleared by the higher-ups. They would also offer/have offered to be a go-between of some kind, and maybe see if they can get some limited moderation capability to help us out with keeping order.  And, this would come with an email of sorts that we&#039;d all have access to to contact them, so not just one person could contact them.\r\n\r\nAgain, these are just concepts and things they&#039;d have to discuss and get approved.  But, if this &quot;Sticky&quot; thread was to get approved, what would you all hope to have in it?  Is this something you&#039;re comfortable doing at all?  Is this a good direction for us to go?  I wanted to make sure you all got to say your bit before anything went forward, because I don&#039;t have the right to make big decisions like that without consulting all of you guys.  This is OUR board, and I want us all to have a say.\r\n\r\nOh, also...\r\n\r\nThis same Rioter has said that, as of the last thing they heard, that the Boards Team people are apparently working on something akin to allowing us to have our own Subboards.  And, by &quot;us&quot; I mean everyone.  I have no further details on that, or even any specifics on their short term plans or direction, or even features that would be presented before that, however, it IS a direction they&#039;re looking at.  So, take that as you will.","replies":[]}