{"poster":"TheAsianOne1","date":"2020-01-18T01:52:13.532+0000","title":"Platzierung und Bugs","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Ich hab echt kein Bock mehr auf dieses spiel\r\n\r\nAlso, ich habe mich vor einer Woche eingerankt (habe 6 out of 10 promo matches gewonnen ) und wurde iron. Es ist so lächerlich. Ich habe nicht mal schlecht gespielt , mein farm score war meistens über 200 (Außer sup verständlich) hatte genügend kills und selten bis schon fast gar nicht gefeded.\r\nSooo nun also in der elo hell. Um meine letzten 4 matches zurück zu holen. Jedes mal ist die Toplane afk gegangen. wie soll man da upranken wenn man solo duo spielt. ich kann nicht mit freunden spielen da sie alle höher eingrankt wurden , obwohl sie weniger promos als ich gewonnen haben!!!! Wie ist dass möglich. mit dem system stimmt doch sowas von was nicht. \r\n\r\n\r\nGeht es euch auch so?","replies":[{"poster":"Aymira","date":"2020-01-18T05:34:12.127+0000","up_votes":2,"down_votes":0,"body":"> Also, ich habe mich vor einer Woche eingerankt (habe 6 out of 10 promo matches gewonnen ) und wurde iron. Es ist so lächerlich. Ich habe nicht mal schlecht gespielt , mein farm score war meistens über 200 (Außer sup verständlich) hatte genügend kills und selten bis schon fast gar nicht\n\nDeine Wertungen, also Tötungen, Unterstützungen, Tode, Vasallenmenge und so weiter sind für das System völlig egal. Du wirst nach gewonnenen Spielen bewertet.\n\n> Sooo nun also in der elo hell. Um meine letzten 4 matches zurück zu holen.\n\nDie \"Elo-Hell\", wie sie genannt wird ist nicht existent. \nAber um den Punkt trotzdem aufzugreifen. Letzte Saison Bronze war also besser als Eisen...? \n\n> obwohl sie weniger promos als ich gewonnen haben!!!!  Wie ist dass möglich. mit dem system stimmt doch sowas von was nicht.\n\nDann waren die Leute wohl in der letzten Saison höher im Rang. ¯\\\\\\_(ツ)_/¯ \n\n> Geht es euch auch so?\n\nNö, völlig normal das man nach einem \"Soft - Reset\", so wie er jede Saison gemacht wird, ein bisschen weiter unten anfängt als man in der Vorherigen aufgehört hat. Spiel einfach weiter, du solltest ne gute Menge Punkte bekommen. Und wenn du es dir verdient hast, dann steigst du auch wieder auf.","replies":[]},{"poster":"Enderized","date":"2020-01-18T08:53:32.566+0000","up_votes":1,"down_votes":0,"body":"Du startest halt 1.5 Divisionen unter dem, welches dein letzer Rang vor Season Beginn war.\nAlso zB. Silver 4 -> Iron 2 und hast glaube ich die Möglichkeit mit 10/0 wieder nach Bronze 3-2 zu kommen","replies":[{"poster":"Cenâreth","date":"2020-01-18T10:58:54.042+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Enderized,realm=EUW,application-id=Wj1wcocU,discussion-id=lPGvfuKw,comment-id=0001,timestamp=2020-01-18T08:53:32.566+0000)\n>\n> Du startest halt 1.5 Divisionen unter dem, welches dein letzer Rang vor Season Beginn war.\n> Also zB. Silver 4 -> Iron 2 und hast glaube ich die Möglichkeit mit 10/0 wieder nach Bronze 3-2 zu kommen\n\nUnd genau da liegt der Fehler vorige Season sind wir noch mit 1 Divisions Unterschied gestartet, diese Season mit 1,5 Divisions Unterschied? Kein Wunder dass LoL den Bach runtergeht und keiner mehr ranken will geschweige denn Interesse dazu hat. Aber anstatt dass Riot games hier nachhaltige Lösungen sucht und vielleicht dass mal mit allen in der Community ausdiskutiert, verschlimmern wir halt lieber dass Ganze noch.\n\nDas was die gemacht haben ist kein Soft Reset sondern ein Hard Reset.","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2020-01-18T11:42:57.230+0000","up_votes":2,"down_votes":1,"body":"ja vorherige season gab es auch die größte Elo Inflation seitdem es ranked gibt. Letztes jahr war ich p1 und wurde mit 5-5 placements p2 eingerankt habe aber 28 lp pro win bekommen. Sowas sollte nicht normal sein. Das war nie so. Ich bin s6 in den placements auch von gold IV auf bronze 2 gedroppt. Das ist ganz normal.\nDie Placements wie sie jetzt sind, sind gut. Placements wie letzte season hätten einfach wieder zu einer noch stärkeren elo inflation gesorgt. Master ist jetzt schon recht wenig wert, wegen letzter season. \n\n> Das was die gemacht haben ist kein Soft Reset sondern ein Hard Reset.\n\nBitte informier dich erstmal was das ist. Ein Hard Reset wird niemals  angewendet. Ein Hard reset setzt alle spieler ,alle, auf die MMR von einem account der grade lvl 30 wurde. Ein Soft Reset, zieht deine Optische Elo ein bisschen runter, gibt dir jedoch hohe LP gains und Deine MMR wird nur leicht verschlechtert. (Soft Reset)\n\nMMR und Elo sind verschiedene Sachen. \n\n\n\n>  und keiner mehr ranken will\n\nalso ich habe letzte season mehr leute mit 1500+ games gesehen als je zuvor.","replies":[{"poster":"Cenâreth","date":"2020-01-20T12:40:02.483+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HSG Rafunzel,realm=EUW,application-id=Wj1wcocU,discussion-id=lPGvfuKw,comment-id=000100000000,timestamp=2020-01-18T11:42:57.230+0000)\n>\n> ja vorherige season gab es auch die größte Elo Inflation seitdem es ranked gibt. Letztes jahr war ich p1 und wurde mit 5-5 placements p2 eingerankt habe aber 28 lp pro win bekommen. Sowas sollte nicht normal sein. Das war nie so. Ich bin s6 in den placements auch von gold IV auf bronze 2 gedroppt. Das ist ganz normal.\n> Die Placements wie sie jetzt sind, sind gut. Placements wie letzte season hätten einfach wieder zu einer noch stärkeren elo inflation gesorgt. Master ist jetzt schon recht wenig wert, wegen letzter season. \n> \n> Bitte informier dich erstmal was das ist. Ein Hard Reset wird niemals  angewendet. Ein Hard reset setzt alle spieler ,alle, auf die MMR von einem account der grade lvl 30 wurde. Ein Soft Reset, zieht deine Optische Elo ein bisschen runter, gibt dir jedoch hohe LP gains und Deine MMR wird nur leicht verschlechtert. (Soft Reset)\n> \n> MMR und Elo sind verschiedene Sachen. \n> \n> also ich habe letzte season mehr leute mit 1500+ games gesehen als je zuvor.\n\nEin Soft Reset würde für mich bedeuten um 0,5 und nicht um 1,5 Elo. Somit ist dass für mich kein Soft Reset, dass hat nichts mit Informieren zu tun, das ist eine reine Definitionsfrage. Und vom Prinzip her sollte man eine hohe LP Gain haben, hat man aber aktuell nicht. Also haben sie in meinen Augen auch keinen Hard Reset gemacht, es wird nur nirgends kommuniziert darin. Also kann man spekulieren, einen MMR Guide von 2015 ist leicht hingestellt zu nehmen wenn dass System in den 5 Jahren mehrmals geändert worden ist. \n\nUnd ja es hat auch einen guten Grund warum viele Leute mehr als 1500+ Games haben, denn offensichtlich stabilisiert sich dass System anhand der Anzahl an Spiele, frag mal jeden einzelnen Streamer, die sagen dir allesamt, weiter ranken auch wenn du 30% Winrate hast. Ergo steigst du nur durch zwei Punkte 1.) wie gut du selbst bist, mechanisch inkl. alle anderem 2.) je mehr Spiele du spamst und spielst. Weil dich dass System dann offensichtlich auch anders einstuft.","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2020-01-21T16:11:04.131+0000","up_votes":1,"down_votes":0,"body":"Nein, die streamer sagen weiterspielen weil du dich dadurch verbesserst ^^. Und vorallem early season viele leute mal durch eine loss streak negative winrate haben.\n\nEin soft reset war noch nie 0.5 ränge. Das wären 2 divisionen (bei deinem mindestrang) dann 10 placements mit insanen gains.\nDa bin ich mit leichtigkeit viel weiter oben als vorher. \n\nDie krassen gains normalisieren sich sobald man auf seine alte elo kommt. Ich bekomme nun nurnoch +20 -15 was immernoch viel ist für dia. Aber in d4 habe ich noch 24-26 bekommen.","replies":[]}]}]},{"poster":"Randori89","date":"2020-01-20T12:31:11.759+0000","up_votes":1,"down_votes":1,"body":"Wo ist dein Problem? Das ist doch völlig normal!\nDavon ganz abgesehen ist es doch ehh egal, die Season ist lang und am ende landet man wieder in der Elo wo man hingehört!","replies":[{"poster":"Cenâreth","date":"2020-01-20T12:44:22.988+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Randori89,realm=EUW,application-id=Wj1wcocU,discussion-id=lPGvfuKw,comment-id=000100000001,timestamp=2020-01-20T12:31:11.759+0000)\n>\n> Wo ist dein Problem? Das ist doch völlig normal!\n> Davon ganz abgesehen ist es doch ehh egal, die Season ist lang und am ende landet man wieder in der Elo wo man hingehört!\n\nWenn dass für dich egal ist, dann bitte verlass dass Forum und League und lass uns mit deinem sinnlosen Geplapper in Ruhe das interessiert keinen!","replies":[{"poster":"Randori89","date":"2020-01-20T14:35:56.760+0000","up_votes":1,"down_votes":0,"body":"Dein gejammer doch auch nicht, du Kleinkind!\n\nWenn dich der Reset nervt, dann spiel kein Ranked!","replies":[]}]}]}]}]},{"poster":"Reaz83","date":"2020-01-18T13:45:57.276+0000","up_votes":1,"down_votes":0,"body":"Geht so war am Ende der Saison g4 und zum Schluss pre Saison war ich P4 (60% winrate)und wurde silber 1 eingestuft \n\nHabe 9 von 10 promos verloren im Moment versuche ich Gold zu kommen ... zweimal Promo verhauen ... alle guten Dinge sind 3","replies":[]},{"poster":"Megamaexx","date":"2020-01-18T10:01:42.299+0000","up_votes":1,"down_votes":0,"body":"> Sooo nun also in der elo hell. \n\nDie Elo hell geht bis Grandmaster. wobei, Challenger kann man auch noch dazu zählen, wenn die das Pech haben, aufgrund von Spielermangel nur nen Dia 1 Typen dabei zu haben. Die Erde ist die Hölle, hier hast du deine Sünden zu begleichen aus längst vergangenen Tagen ;)","replies":[]}]}