{"poster":"Niji","date":"2015-01-21T08:53:13.022+0000","title":"So how much do placements matter anyway?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"My mate said that even if you go 10/10 you still probs won't get placed much higher at all.","replies":[{"poster":"Respect Women","date":"2015-01-21T16:12:48.268+0000","up_votes":1,"down_votes":0,"body":"Your friend is not smart, 2 seasons ago i ended silver 2 and rage quit because oce server is the most awful place on earth\ni came back last season and went 9-1, i hit plat 2, i later climbed to diamond (and then decayed to plat becase i had family matters)\nSo yes, the win loss does matter greatly, overall it just reflects your MMR where you get placed, winning lots = lots of mmr added to your brownie points, low mmr = lower rating.","replies":[{"poster":"KingDinger","date":"2015-01-21T21:52:37.443+0000","up_votes":1,"down_votes":0,"body":"i call bull%%%%.\n\neven fresh account didnt go 10-0 and hit plat. i went 10-0 from bronze 1 season 3, to silver 5 season 2014. and i went 8-2 from a fresh account and got silver 2.\n\nnot to mention this season placements are worth A LOT less than ever before. riot have said it and tons of people have shown it to be true. gold 1-2s going 6-4 and getting silver 1. previous seasons they would still be gold even with 3-7.","replies":[]}]},{"poster":"BarryButcher","date":"2015-01-21T09:34:34.200+0000","up_votes":1,"down_votes":0,"body":"If you go 10-0 you will most definitely get higher than your current rank. Its when you start throwing losses in there that the calculations get fuzzy. Going 9-1 is very different from 10-0 (apparently).\n\nI've heard people going 7-3 and getting in a lower division then they ended last season in. People going 5-5 and getting higher. Theres just a lot of confusion since Riot would rather say Bronze 2 or Silver 3, instead of 1200 elo and 2000 elo etc... actual numbers so people can see the MMR changes.","replies":[]},{"poster":"GoldenTomat0","date":"2015-01-21T09:31:15.046+0000","up_votes":1,"down_votes":0,"body":"somewhat, they affect where you're placed at the start. anyone that deserves to rise will.","replies":[]},{"poster":"Niji","date":"2015-01-21T09:01:04.119+0000","up_votes":1,"down_votes":0,"body":"Well if that's the case I might just not play ranked this season lol.","replies":[]},{"poster":"Ingénue","date":"2015-01-21T08:59:36.574+0000","up_votes":1,"down_votes":0,"body":"That seems to be how it is from all of the 'qq riot your placements are a joke' threads","replies":[]}]}