{"poster":"RockzGhost","date":"2017-06-04T19:37:12.608+0000","title":"Consejos para Thresh pls e items.","subforum":"Guias y consejos","up_votes":1,"down_votes":1,"body":"Me acabo de comprar a {{champion:412}}  me llama la atenci&oacute;n aprender a jugar la linea de sup, pero no tengo mucho conocimiento en los items para esta linea..Alg&uacute;n consejo con thresh sera bien recibido, pero sobre todo ayuda con los items, que me tengo que armar y por que.\r\n\r\nGracias de antemano {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"9081913DEL1","date":"2017-06-04T19:48:24.255+0000","up_votes":1,"down_votes":0,"body":"https://las.op.gg/champion/thresh/statistics/support\n\nConsejos, acerta la q, usa la w, aprovecha la pasiva.\n\nLa q no es tan rapida realmente, pero si la tiras que no sea al voleo, pensa si te pueden seguir. El tema con tresh es que aun si pegas una buena q necesitas de alguien. Atento a eso.\nLa lampara a veces ni la agarran igual es un escudo, usala en cada tradeo, claro salvo que sepas que se tienen que retirar o SI NO SABES DONDE ESTA SU JG. \nLa regla es que la e la uses defensivamente, la e reposiciona (un poco) no pongas a luchadores al lado de tu carry, no alejes al objetivo ni lo acerques al carry, pensa para donde lo queres mover. \nLa r es como la w de veigar, tenes que hacer que la pisen, es mas dificil fuera de la tf.\n\nSi estas defendiendo no uses tu q hasta que te inicien, la mayoria hace al revez, si estas defendiendo es porque no ganas tradeando, necesitas cancelar su inicio para anular su ventaja, si haces vos el inicio gastas vos mas recursos y ellos justamente tienen ventaja.\n\nHacele peel al carry. Tresh puede dominar en linea solo practicamente, dependiendo la ocasion pero si recien comenzas, practicalo contra bots, asi aprendes los cds (que son altos) y como tirar skills, tirar skills entre minions y como sacar a alguien de una mala situacion.\n\nLos items depende de la partida, siempre vas a querer la piedra de wards, siempre vas a querer el escudo de reliquia (podrias usar otra cosa), para mi renta muchisimo la solar aun siendo de rango.\n\nComo todo, practicalo mucho.\nSaludos!","replies":[]}]}