{"poster":"Be Kind Rewind","date":"2015-01-08T20:26:10.596+0000","title":"Riot, you've indirectly SCREWED healing-based champions.","subforum":"Gameplay","up_votes":29,"down_votes":4,"body":"By hitting mana regen (especially mana font) to the point that it wasn't worth buying over an early Morello's rush.\n\n**The new meta that you've formed gives almost all midlaners Grievous Wounds right around the end of the laning phase.**\n\nLet's have a moment for the champions indirectly nerfed hard by this change...\n{{champion:50}}\n{{champion:266}} \n{{champion:106}} \n{{champion:8}}\n{{champion:9}} \n{{champion:16}} \n{{champion:154}} \n{{champion:36}} \n\nhttp://oyster.ignimgs.com/ve3d/images/08/14/81457_Swain.jpg\n\nMaybe one day, you'll get that dragonmaster skin, at least.  Maybe one day.","replies":[{"poster":"coppinslinger","date":"2015-01-08T20:38:14.097+0000","up_votes":16,"down_votes":1,"body":"Yup, morello's passive means it should be a niche buy against healing champs\nOr non-ap champs. I don't like it's reign of terror in the midlane at the moment, the item is comparatively way too strong for cost.\n\nBut that issue is basically a dead horse by now","replies":[{"poster":"Be Kind Rewind","date":"2015-01-08T20:41:28.500+0000","up_votes":25,"down_votes":1,"body":"> [{quoted}](name=coppinslinger,realm=NA,application-id=3ErqAdtq,discussion-id=dTpspgsR,comment-id=0001,timestamp=2015-01-08T20:38:14.097+0000)\n>\n> Yup, morello's passive means it should be a niche buy against healing champs\n> Or non-ap champs. I don't like it's reign of terror in the midlane at the moment, the item is comparatively way too strong for cost.\n> \n> But that issue is basically a dead horse by now\n\nConsecutive nerfs aren't a solution.  The problem is the idea that buying items to solve mana issues is a problem.\n\nIt's not.  That's the whole point of mana.  It inhibits you from spamming early game, makes you play wisely, and forces you to invest thousands of gold before you can cast more freely.\n\nThe nerf was essentially saying, \"paying thousands of gold to be on-par with energy champions felt cheap.  Let's make your mana problems severe all-game while bolstering energy midlaner's reign of terror.\"\nAs if Zed wasn't played enough.\n\nIf they wanted Mana font to be less of an issue, they should have simply nerfed chalice but kept Athene's as strong as S4 Athene's.  Then you don't have your one-stop mana solution as soon as you hit 880 gold, but you still get it taken care of after you dump a few thousand gold into upgrading it fully into Athene's.","replies":[{"poster":"Rew711","date":"2015-01-08T21:50:05.238+0000","up_votes":8,"down_votes":0,"body":"Well, the 2 who were really hurt were {{champion:16}} and {{champion:154}}.\n\nThese two have only 1 way of gaining back the monstrous amount of HP needed for their ability(ies).","replies":[{"poster":"Rock Rockburgh","date":"2015-01-09T01:39:20.275+0000","up_votes":4,"down_votes":1,"body":"I'd say that Soraka wasn't really hurt all that much by the Chalice/Grail changes... I play her fairly often and she heals a *ridiculous* amount just by landing Starcalls. Hitting one champ will heal for ~70 points even at 1/1/0/0 with no AP items up. Once you actually start building AP and putting levels in E, it gets kind of insane.","replies":[]},{"poster":"agbudar","date":"2015-01-09T23:09:01.808+0000","up_votes":2,"down_votes":0,"body":"imagine how this {{champion:82}} poor guy must feel... he told me last night he is ready to retire from being a benchwarmer and just forget about the league","replies":[]}]},{"poster":"SNSD Tiffanyx","date":"2015-01-09T02:07:58.462+0000","up_votes":1,"down_votes":0,"body":"problem is, if thats the case then people may still just get athenes instead of morellos, b/c as long as athenes is a viable item, morello generally wont be used unless u are going up against a heal heavy comp","replies":[{"poster":"Aarekk","date":"2015-01-09T04:01:43.090+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SNSD Tiffanyx,realm=NA,application-id=3ErqAdtq,discussion-id=dTpspgsR,comment-id=000100000001,timestamp=2015-01-09T02:07:58.462+0000)\n>\n> problem is, if thats the case then people may still just get athenes instead of morellos, b/c as long as athenes is a viable item, morello generally wont be used unless u are going up against a heal heavy comp\n\nI think that's their point.  They don't want morello to be picked up no matter what that way heal champs have a chance of doing their thing.  Niche counters shouldn't be so ubiquitous that the thing they counter is almost guaranteed to be countered in any given game.","replies":[{"poster":"SNSD Tiffanyx","date":"2015-01-09T04:33:37.168+0000","up_votes":1,"down_votes":0,"body":"but during season 4 when healing champions like mundo aatrox zac were popular, mid lane mages still prefer athenes over morello just because the amount of mana regen it gives. So people arent picking morello to counter healing pre se, but they are picking it b/c its the next best thing after athenes.\n\nalso, riot hates healing, morello stated a while back that putting healing into league is a big mistake, and if he could, he would take it all out.","replies":[{"poster":"Klatn Yelox","date":"2015-01-09T16:56:57.567+0000","up_votes":1,"down_votes":0,"body":"I dislike Morello's stance on that immensely, but I do understand. However, it adds in depth to the game, because you have to be careful. Against a team full of heavy nukes, healing is ineffective, but against a team full of bruisers and less sudden damage, healing becomes viable. Its allows for a change in the way a team can strategize against the enemy.","replies":[{"poster":"SNSD Tiffanyx","date":"2015-01-09T19:26:52.393+0000","up_votes":1,"down_votes":0,"body":"its the same problem plaguing riot for the past 4 years. they are trying to create diversity, whereas in reality they are just causing shifts in power of champions/items.\n \neverytime riot tries to create diversity, it simply resulted in w/e was nerfed not picked, and w/e wasn't nerfed became the new go to pick.","replies":[]}]}]}]}]},{"poster":"Aarekk","date":"2015-01-09T03:59:21.904+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jangle BoJangles,realm=NA,application-id=3ErqAdtq,discussion-id=dTpspgsR,comment-id=00010000,timestamp=2015-01-08T20:41:28.500+0000)\n>\n> Consecutive nerfs aren't a solution.  The problem is the idea that buying items to solve mana issues is a problem.\n> \n> It's not.  That's the whole point of mana.  It inhibits you from spamming early game, makes you play wisely, and forces you to invest thousands of gold before you can cast more freely.\n> \n> The nerf was essentially saying, \"paying thousands of gold to be on-par with energy champions felt cheap.  Let's make your mana problems severe all-game while bolstering energy midlaner's reign of terror.\"\n> As if Zed wasn't played enough.\n> \n> If they wanted Mana font to be less of an issue, they should have simply nerfed chalice but kept Athene's as strong as S4 Athene's.  Then you don't have your one-stop mana solution as soon as you hit 880 gold, but you still get it taken care of after you dump a few thousand gold into upgrading it fully into Athene's.\n\nI like your solution.  It would also help make Athene's at least a little more of a power spike item.  As things are Athenes mostly feels like it gives you a bit of CDR over chalice.  So does Morello's though and that one's 600 gold cheaper.","replies":[]}]}]},{"poster":"Rinky Dinky","date":"2015-01-08T21:28:50.795+0000","up_votes":7,"down_votes":0,"body":"Honestly, they need to give Chalice its old passive back. The reason, or so I thought, that RIot made it the best mana managment item was because Morello was ment to be a niche pickup against healers. Now its mandatory. This is awful.\n\nI mean, Imagine if Executioners calling gave 80 AD, 20% Crit Chance, and then had the grievous wounds passive. It would be the same problem.","replies":[{"poster":"junglerboy16","date":"2015-01-08T22:33:26.063+0000","up_votes":2,"down_votes":0,"body":"That sounds almost like IE, except that IE is ok because no grievous wounds.","replies":[{"poster":"Rinky Dinky","date":"2015-01-08T23:30:11.406+0000","up_votes":1,"down_votes":0,"body":"Well IE increases Crit damage. Thats why its good.\n\nIt actually has 25%. Getting nerfed tho","replies":[{"poster":"Klatn Yelox","date":"2015-01-09T16:57:55.207+0000","up_votes":1,"down_votes":0,"body":"What? Getting nerfed? NOOOO! Oh well. My AS builds will be more viable then.","replies":[]}]}]}]},{"poster":"TehNACHO","date":"2015-01-08T20:36:48.763+0000","up_votes":7,"down_votes":0,"body":"Ironically, this is part of the reason why the Executioner's Calling was preemptively removed.","replies":[{"poster":"MPendragon","date":"2015-01-08T20:46:36.124+0000","up_votes":1,"down_votes":0,"body":"Yes, but they should bring that back instead of keeping it removed.\n\nThe only counter for BotRK, Ravenous Hydra, and Bloodthirster is skills and finesse (or an ignite, or grievous wounds from Tristana or Miss Fortune) It's pretty unfair that the only item you can counter them is Morello's, which is predominantly only viable on AP champions.\n\nWith that being said, it's very unfair to royally thrash your opponents because you have the ability to sustain health and they don't have a counter for it. (Vladimir / Swain) \n\nIt's like \"Okay, I HAVE to play safe because I can't afford to trade hits with them because they will out-sustain the shit out of me.\"\n\nBut they do need to bring back Executioner's to re-balance it for AD champions.","replies":[{"poster":"Klatn Yelox","date":"2015-01-09T17:03:13.585+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MPendragon,realm=NA,application-id=3ErqAdtq,discussion-id=dTpspgsR,comment-id=00000000,timestamp=2015-01-08T20:46:36.124+0000)\n\n> \n> It's like \"Okay, I HAVE to play safe because I can't afford to trade hits with them because they will out-sustain the shit out of me.\"\nActually, this is healthy. It means champions who sustain CAN sustain, and champions that don't have to find a new way to fight them. Like building higher damage, so it is harder to sustain. Or poking more consistently, rather than all at once. Outsmarting your opponent, rather than out buying them. Which is why Morellonomicon is bullshit.","replies":[]}]}]},{"poster":"Earthlord Jazz","date":"2015-01-08T23:24:36.073+0000","up_votes":4,"down_votes":1,"body":"It just so happens that these champions weren't played that often before the change in the first place. Makes me sad, although I still play Swain and Vlad quite a bit since they're so unique and fun. Actually, quite a bit of these champs are really unique and fun! \n\nRiot please make {{item:3165}} a niche buy! Executioner's Calling was completely niche due to its incredible grevious wounds passive but it's terrible stat spread and gold inefficiency (unless playing against a select few champs). Not saying {{item:3165}} should be nerfed to that status, but at least make other items more appealing.","replies":[]},{"poster":"MarthaJones","date":"2015-01-09T09:53:05.347+0000","up_votes":2,"down_votes":0,"body":"As a swain main, I sort of enjoy when players rush morellos.  Without getting the mr the grail adds they have to play nearly perfect in positioning and because of that it is much easier to play agressively and zone them out of cs.   Swain doesn't really win most lanes because he has sustain against caster match-ups.it normally happens because people take 1 or 2 e+ autos and drop into the 1 shot threshold.  \n\nReally, laning phase got a buff or stayed the same for swain, and the matchups where morellonomicon is the largest threat is in the already unfavorable matchups, such as Lux, Oriana, Karma.    (and he probably shouldn't be picked against these champs anyway).\n\nSo honestly, I'm not even sure i'd call it a nerf to swain. \n\nIt definitely is annoying later in the game, but most people late game would pick one up anyway if facing swain on a caster.  \n\nI can't speak on behalf of the other champs as I really don't know the matchups that well, but I don't think swain should belong on that list.","replies":[]},{"poster":"Aarekk","date":"2015-01-09T04:02:33.112+0000","up_votes":2,"down_votes":0,"body":"Nobody used to get Morello, now people get two.","replies":[]},{"poster":"Sammystorm","date":"2015-01-09T01:24:20.648+0000","up_votes":2,"down_votes":0,"body":"forgot mundo on that list.","replies":[]},{"poster":"Bhudanaboy","date":"2015-01-08T22:16:49.914+0000","up_votes":2,"down_votes":1,"body":"I personally think having to worry about mana is stupid, mana pools should just be like energy pools that take 1 minute to fill or something like that.","replies":[{"poster":"Delioth","date":"2015-01-09T06:56:07.381+0000","up_votes":1,"down_votes":0,"body":"Just because it's a pretty steep difference, it doesn't even take energy pools 1 minute to fill.\nTry something along the lines of 4 seconds from empty.","replies":[]},{"poster":"ArkenStorm","date":"2015-01-09T03:24:39.837+0000","up_votes":1,"down_votes":0,"body":"or energy champs should be mana based O.o\nno bad idea. but yes, i think mana regen should be gained more later levels to keep on par. like a more exponential curve instead of a line.","replies":[]}]},{"poster":"Old Man Teeto","date":"2015-01-09T18:34:30.757+0000","up_votes":1,"down_votes":0,"body":"What are you talking about?\n\nRiot doesn't like sustain unless it's Lifesteal.\n\nThis was 100% intentional.","replies":[]},{"poster":"Ellphi","date":"2015-01-09T17:43:44.965+0000","up_votes":1,"down_votes":0,"body":"Nobody likes Vlad, Swain, or Fid anyway. The rest of the champs on that list already suck, not like Morellos is suddenly taking them off the 'top picks 2015' list.","replies":[]},{"poster":"causeimdabatman","date":"2015-01-09T14:20:06.323+0000","up_votes":1,"down_votes":0,"body":"uh vlads{{champion:8}}  an op sleeper.........","replies":[]},{"poster":"BasicExp","date":"2015-01-09T13:43:48.529+0000","up_votes":1,"down_votes":0,"body":"I expect to see a stat change or a price change on that item in the very near future.\n\nAlso I would hope to see a new or different item option for mana in the mid lane, perhaps a change to Tear would be nice to make it a more viable item. Personally if it was more like Seeker's Armgaurd so building to Archangel's was not so thankless.\n\nRegards,\n\nBasic.","replies":[]},{"poster":"Ale non è male","date":"2015-01-09T10:40:31.655+0000","up_votes":1,"down_votes":0,"body":"i don't see all these problems with morello.\nIf a mage want to go for full burst damage, they just go for the traditional way of DFG-Rabadon-Void Staff-Zhonya-boots. Morello doesn't kick in before the 6th item maybe(and even then, it's likely that at some point a mage should get some kind of Mr resistence through GA or Abyssal)\nIf a mage wants a lot of mana sustain to spam skills, still Athene or Seraph represent the best picks for sustain, then they could also add Morello, but it is still secondary\nThere are the champs that synergize with Rylai/Liandry too, there are the champions that pick RoA for Ap + some form of sustain.\nthere are a lot of other niche picks available as Ap items\n\nI don't see Morello as a must do for all of these AP champs, tbh. Of course, Athene being nerfed put Morello on the spotlight again, and people start to saw that it was a really powerful item. But mid laners have plenty of choices to go that doesn't include Morello in. \nOn a side note, Morello has becomed almost essential for AP based supports, becasue as a jack-of-all item for guys which have a limited amount of item spots available (because of gold item/boots/sightstone taking up 3 spots till very late game) its is really really good, especially looking at that 20% CDR","replies":[]},{"poster":"Blue Moon Wolf","date":"2015-01-09T04:47:23.091+0000","up_votes":1,"down_votes":0,"body":"{{champion:421}} -SCREEEEEECH (I don't see a problem here)","replies":[]},{"poster":"rG Thundrag","date":"2015-01-09T04:19:00.542+0000","up_votes":1,"down_votes":0,"body":"Ironically even though Morde relies on spellvamp and his ult healing(not like he drops to 40% hp anyway), he is actually thriving in this meta since mid laners don't have as much mana as they used too and such get out tempo'd and shield sustained by mordekaiser","replies":[]},{"poster":"Cindikle","date":"2015-01-09T03:29:29.174+0000","up_votes":1,"down_votes":0,"body":"I'd say change Morello's to not have GW\nMake Mana Font not work off total mana.\n\nGive a better source of Grievous Wounds. Something that's not so gimmicky. Something anyone can pick up. That way healing champs can be balanced around the fact it should be something they have to face. \n\nNot sure exactly how they would add this. But think having it fight an item slot doesn't really work. I don't mind Morello's being the best mana regen item and being seen more. I have a problem that it is the only option. And it will honestly only be picked up by a few champions. The rest require Ignite. \n\nYou cannot balance heals on such a niche mechanic.","replies":[]}]}