{"poster":"XOmega WarriorX","date":"2017-11-21T17:40:06.630+0000","title":"rune shen?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"mi e uscito dalle chest del level up,lo ho preso e vorrei sapere quali sono le build per varie situazioni","replies":[{"poster":"Adalkah","date":"2017-11-22T19:45:06.289+0000","up_votes":1,"down_votes":0,"body":"ovviamente ti parlo di un shen tank che può fare anche un danno decente, niente roba strana come as/ap shen o roba del genere anche se poi alla fine lo faccio.\n\nDeterminazione                       \n1-presa dell'immortale             \n2-demolire                                 \n3-preparazione fisica\n4-rivitalizzare\n\nPrecisione\n1-trionfo\n2-leggenda: alacrità\n\nma poi cambio \"preparazione fisica\" con le altre 2 in base a che tipo di danno fa il mio nemico \ne cambio \"leggenda: alacrità\" con \"leggenda:tenacia\" se il nemico hanno tanto cc oppure con \"ultima sfida\" se è un champ che ha un burst iniziale, ma poi non riesce a fare danno sostenuto nel tempo come gran parte degli assassini quindi mi serve per ammazarli prima che loro ammazzino me\n\nrune proprio da evitare\nsovreguarigione\npresenza di spirito \nleggenda: stirpe","replies":[]},{"poster":"HaIIeIujah","date":"2017-11-21T18:52:52.095+0000","up_votes":1,"down_votes":0,"body":"Grasp, Demolish in lane vinte/Unflinching se non puoi splittare, difese come necessario, Overgrowth/Second Wind se è passiva o se vieni pokato troppo.\n\nPrecision secondaria con Legend: Tenacity (O Alacrity se proprio pensi di poter stompare la lane) e Triump/Coup de Grace.","replies":[]},{"poster":"mansitkd","date":"2017-11-21T17:48:10.642+0000","up_votes":1,"down_votes":0,"body":"full tank con grasp o scossa di assestamente.  vale sia per il top che per support","replies":[{"poster":"XOmega WarriorX","date":"2017-11-21T17:55:13.533+0000","up_votes":1,"down_votes":0,"body":"e per il secondario?e aftershock non e piuttosto buono con lui?","replies":[{"poster":"mansitkd","date":"2017-11-21T18:38:22.753+0000","up_votes":1,"down_votes":0,"body":"aftershock è scossa di assestamento in ita. come secondaria da supp ci mettere quelli che ti da 100hp ed i biscotti. top boh prova su probuilds ancora non l ho provato con le nuove rune","replies":[]}]}]}]}