{"poster":"UnicornBaconFat","date":"2015-05-01T01:14:41.698+0000","title":"Luden's","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":1,"body":"Did a search for other threads on here (but I&#039;m sure people are addressing it elsewhere) - let&#039;s talk Luden&#039;s?\n\n**The issue: **\nSo the current *Shiv* damage is 100 + 0.15AP. What I&#039;m finding is that this just creates an unparalleled damage spike compared to any other item, especially considering that the 120AP that the item gives you already equates to having a total of 118 damage, assuming you had no AP to begin with (unlikely). \n\nI suppose my current issue with the item is that it works too well as a first item by itself, and coupled with the MS that it gives, it can polarise a (usually mid) lane advantage tremendously if the losing laner doesn&#039;t have the gold to get one at the same time as their opponent. It is fine late game, but it is a little too overbearing as an early(ish) game one.\n\nDon&#039;t get me wrong, it&#039;s a great item concept. What I particularly like about it is that it shifts a little bit of power away (not much) from dashier/blinkier champs (i.e. LB, Kat, Nid) and towards ones that need to physically walk to chase you - this theoretically helps open the game up a little to more champ choices.\n\n**Possible solution?**\nWhat I propose for it is that it should reward already having AP, much like Deathcap - i.e. cut off a lot of the base damage and up the AP ratio a little. Something like 55 + 0.25AP sounds more reasonable; there&#039;s still a noticeable enough damage spike when getting the item, but its starting point is lower, though will come out to roughly the same come late game.\n\nAssuming no AP to begin with, the bonus damage currently is 118, whilst the number I gave will come out to 85 - a considerable nerf, but still nothing to scoff at. The crossover point occurs at about 460 AP, by which time, any stomp game would be done and would likely to have been a result of other factors, not just this item. This is a significant nerf to Luden&#039;s early game, but I do think it&#039;s warranted.","replies":[{"poster":"Buttsubushi","date":"2015-05-01T06:39:42.341+0000","up_votes":1,"down_votes":0,"body":"I've never played an AP mid and bought Luden's Echo, but that sounds like a good idea. The idea was to have Static Shiv deal 100 magic damage that can crit, and Luden's deal 100 + some AP ratio. You would need 100% with SS and 666AP with Luden's to consistently deal 200 Magic Damage.\n\nSince SS gives 20% crit: average bonus dps = 120\nHere is a table of DPS of SS and Ludens and how much crit and AP to make them equal:","replies":[{"poster":"UnicornBaconFat","date":"2015-05-02T06:29:34.220+0000","up_votes":1,"down_votes":0,"body":"The comparison there is valid but the other main issue is that casters are supposed to be more inherently bursty and are already adequately such. Shiv serves to shore up weaknesses in certain ADCs in terms of a lack of burstiness, whereas Luden's augments what's already there - that's my main gripe","replies":[]}]}]}