{"poster":"Bðbo","date":"2014-06-13T03:59:26.452+0000","title":"New Champion?","subforum":"Champions & Skins","up_votes":4,"down_votes":0,"body":"I've been wondering for a while and I think Riot should create a new jungler. I mean they created Yasuo for top/mid, Vel'Koz for mid, Braum for support, and Jinx for adc. The last official jungler was Zac, and its been nearly a year since he was created. So, I think Riot should create a new champion just for jungling. Especially, when they are going to update Summoner's Rift.","replies":[{"poster":"Thanotos Omega","date":"2014-06-13T05:09:36.342+0000","up_votes":4,"down_votes":0,"body":"I stand by my Idea of a Yordle in a business suit with a chain saw for the new jungler,","replies":[{"poster":"SavageAvery","date":"2014-06-13T19:09:28.426+0000","up_votes":1,"down_votes":0,"body":"YES!","replies":[]},{"poster":"MackleDoge","date":"2014-06-13T05:26:12.705+0000","up_votes":1,"down_votes":0,"body":"I'd buy it.","replies":[{"poster":"CrimsonAegis","date":"2014-06-13T14:45:29.755+0000","up_votes":1,"down_votes":0,"body":"So would I","replies":[]}]},{"poster":"Bðbo","date":"2014-06-13T10:25:01.239+0000","up_votes":1,"down_votes":0,"body":"XD just what we all wanted. Another yordle.","replies":[]}]},{"poster":"Zahza007","date":"2014-06-15T20:41:21.096+0000","up_votes":1,"down_votes":0,"body":"the next champion will prolly be a suport because they have been releasing champs i pairs, i.e {{champion:236}} {{champion:222}} ADC, {{champion:157}} {{champion:161}} , Mids, {{champion:201}}  and who knows the next champ, but i have a strong feeling its going to be a support","replies":[{"poster":"gulgolet2000","date":"2014-06-26T15:23:17.073+0000","up_votes":1,"down_votes":0,"body":"I honestly don't think that it was on purpose. Probably just a coincidence.\nBut it doesn't mean the next champ can't be a support!","replies":[]}]},{"poster":"Gingerpowda","date":"2014-06-20T05:15:59.693+0000","up_votes":1,"down_votes":0,"body":"In my opinion, Yasuo was built strictly for Mid/Top, and Braum as a main support, his jungling is sketchy at best in my opinion. And when Aatrox came out, I remember he was a somewhat popular jungler/top laner. And I also never see a Zac jungle or Zac be played in general. But I do agree, We do need a new \"Jungler\" champion, one that built for jungling, but maybe could be used in other lanes. I really support this idea. :)","replies":[]},{"poster":"Icy Hot Shoto","date":"2014-06-15T04:27:29.265+0000","up_votes":1,"down_votes":0,"body":"Be aware that--\n\nYasuo can; Jungle, top, mid, adc AND support.\n\nBraum can; Top, support and jungle.\n\nVel'koz can; Mid, top, support AND apc.\n\nJinx can; Adc, top and mid.","replies":[{"poster":"MackleDoge","date":"2014-06-15T16:48:19.567+0000","up_votes":1,"down_votes":0,"body":"Yasuo jungle is sup par at best and Braum jungle is dreadfully slow and awful. There isn't any reason to take them over other jungling options. While champions can technically be taken in pretty much any role, that doesn't stop them from being significantly better suited to certain roles or lanes.","replies":[{"poster":"Icy Hot Shoto","date":"2014-06-16T03:49:42.066+0000","up_votes":1,"down_votes":0,"body":"I was just pointing out places champs can go. Never said to pick them for certain lanes over others.","replies":[{"poster":"MackleDoge","date":"2014-06-16T04:03:12.698+0000","up_votes":1,"down_votes":0,"body":"Right, and I'm not saying you are wrong, I'm simply making the clarification that just because something **can** go there, doesn't mean it **should** go there.","replies":[{"poster":"Icy Hot Shoto","date":"2014-06-16T19:06:15.068+0000","up_votes":1,"down_votes":1,"body":"Even if it **shouldn't** go there, doesn't mean you can't **try** it.","replies":[{"poster":"MackleDoge","date":"2014-06-16T19:00:55.042+0000","up_votes":1,"down_votes":0,"body":"It does mean that when it is blatantly sup par, puts your team at a clear disadvantage, and provides no tangible benefit over a champion meant to play that role or lane. **You're** desire to play some off-meta bullshit just because you can isn't more important than the other four people on the **team** getting a quality game like they deserve.\n\nEdit: Also, that's exactly what shouldn't means. You shouldn't eat lead paint, but I guess you could go ahead and try it right? Seriously? If you want to do something ridiculous and clearly against what the champion is designed to do, don't do it at the expense of your team, that isn't fair to them, nor is it fair to the opponent because you are denying them an actual game.","replies":[{"poster":"Icy Hot Shoto","date":"2014-06-17T03:25:57.399+0000","up_votes":1,"down_votes":1,"body":"The sad part is that you've clearly never seen a good Yasuo go jungle. Otherwise you'd know that, as long as they know how to play Yasuo well AND how to jungle, they can pull off a rather amazing Yasuo-jungle.\n\nAlso, you must not live in the states. A year or two ago, we had a major problem with lead paint on toys for toddlers. It was on the news and multiple children got sick from chewing on toys parents deemed safe since you **can not keep a young child from chewing on toys without constant supervision.** And don't say, \"Then that parent is a shit parent.\" because quite a few babies will chew on anything and everything when they're teething, and if you have, say, a 5 year old it can be somewhat difficult to keep a teething baby from getting a hold of toys with lead paint on them. Especially if the 5 year old does it themself.","replies":[{"poster":"MackleDoge","date":"2014-06-17T03:33:56.542+0000","up_votes":1,"down_votes":0,"body":"You must not understand English. Just because someone can do a specific thing well and have success doesn't mean that overall that champion isn't better in a certain role. I'm not arguing that with you, you're wrong, it is really that simple.\n\nAre you dense? You aren't **accidentally** doing Ashe Jungle. Those two things are completely and utterly incomparable. Jesus Christ.","replies":[]}]}]}]}]}]},{"poster":"Khodexus","date":"2014-06-16T01:02:09.171+0000","up_votes":1,"down_votes":0,"body":"I actually prefer Yasuo as adc.  Preferably with a support like Janna or Nami.  I know he is popular mid, but I don't honestly think that's where he shines the best.","replies":[{"poster":"MackleDoge","date":"2014-06-16T02:52:47.277+0000","up_votes":1,"down_votes":0,"body":"He's only viable in the ADC position if you have appropriate ranged poke in the rest of your team composition. It can work, just like double bruiser bot lane can work, but only if the rest of the team composition is shifted to adjust for the weaknesses that it brings. Again, I'm always a proponent of doing things that are off meta and different, but only so long as those things are done responsibly.","replies":[]}]}]}]},{"poster":"gulgolet2000","date":"2014-06-14T17:39:10.719+0000","up_votes":1,"down_votes":0,"body":"The next champion is going to be a male that is supposed to be a jungler and was designed by GypsyLord (the designer of Vi and Jinx, if I recall correctly).\n(I clearly remember he said that but I just can't seem to find a link for it. sorry..)","replies":[{"poster":"MackleDoge","date":"2014-06-14T20:42:57.062+0000","up_votes":1,"down_votes":0,"body":"I remember him tweeting that the new champion was going to be male but he didn't mention anything about the champion being a jungler","replies":[{"poster":"gulgolet2000","date":"2014-06-16T09:55:24.783+0000","up_votes":1,"down_votes":0,"body":"I actually remember that he did! He said something like, \"My next champion is supposed to be a jungler. But who knows? He may end up in other roles..\" (and I remember that part clearly) \"..like Vi was originally a top laner and she ended up being a jungler, and Jinx is played in top lane sometimes.\" or something like that.","replies":[{"poster":"MackleDoge","date":"2014-06-16T15:15:54.231+0000","up_votes":1,"down_votes":0,"body":"Really? I like the sound of that then! Thanks for letting me know that, I appreciate it.","replies":[]}]}]}]},{"poster":"augram510","date":"2014-06-14T01:30:58.943+0000","up_votes":1,"down_votes":0,"body":"{{champion:7}} I'm so in... (And if I was Le Blanc) my real self and my mirror image's self XD","replies":[]},{"poster":"HADØØØØUKEN","date":"2014-06-14T00:35:29.160+0000","up_votes":1,"down_votes":0,"body":"hast recht","replies":[]},{"poster":"MackleDoge","date":"2014-06-13T05:19:42.984+0000","up_votes":1,"down_votes":0,"body":"I'd also like to see a new dedicated jungler, but to be far, I also mainly play jungle. Though I do think it'd be more fair to say Aatrox is more Top/Jungle than specifically Top, not really important though.","replies":[]}]}