{"poster":"RepT1LE","date":"2016-01-07T17:29:43.871+0000","title":"Posibilidad de hablar por microfono en league of legends","subforum":"Creaciones de la comunidad","up_votes":3,"down_votes":11,"body":"Seria buena idea de que a&ntilde;adieran la posibilidad de hablar por microfono en league of legends ya que ayudaria mucho mas a la comunicacion entre los jugadores a la hora de jugar, seria mas entrenido que estar jugando en silencio y nose pss que opinan?","replies":[{"poster":"Merion","date":"2016-01-07T17:32:41.922+0000","up_votes":5,"down_votes":1,"body":"La verdad que no quiero escuchar a un pibe diciendome \"wea fome\" y muchos insultos mas.\nPodes usar Curse Voice, TeamSpeak3, Skype, Raidcall.","replies":[{"poster":"Yrox the Third","date":"2016-01-07T18:08:14.012+0000","up_votes":4,"down_votes":1,"body":"Aunque el famoso \"wea fome\" a muchos le sorprendera, no es un insulto.\n\nSi quieres les enseño un poco de \"cultura chilena\"\n\nEl \"wea\" significa, cosa u objeto, como tambien se puede significar las, partes, intimas de un hombre (las, \"pelotas\").\n\n\"Weon\" o \"Wn\" se puede tomar de muchas maneras, es mas como el \"Ni.gga\" gringo, se puede tomar como \"amigo\", \"compadre\" o \"colega\" o como un insulto, obviamente depende del contexto, esto podria ser como \"estupido\".\n\n\"Fome\" es simplemente, aburrido, nada mas.\n\nEl \"culiao\" o \"ql\" eso si es un insulto.\n\n\nEspero les haya servido :D","replies":[{"poster":"Merion","date":"2016-01-07T18:23:27.045+0000","up_votes":1,"down_votes":0,"body":"Gracias por la aclaracion, y tengo amigos chilenos pero nunca dicen esas palabras cuando juegan conmigo porque saben que no soporto que hablen mal. >.<","replies":[{"poster":"juuby","date":"2016-01-07T18:58:55.179+0000","up_votes":1,"down_votes":0,"body":"y ellos soportan que hables en argentino :o?? che,vos,sos,pelotudo y otras cosas mal :o?\n(al final todos somos iguales)","replies":[{"poster":"Merion","date":"2016-01-07T21:08:42.031+0000","up_votes":1,"down_votes":0,"body":"No les gusta y cuando estoy jugando con ellos les escribo bien (Y","replies":[]}]}]}]}]},{"poster":"Muñón Astral","date":"2016-01-07T18:00:25.329+0000","up_votes":3,"down_votes":0,"body":"no, no quiero... solo se van a escuchar insultos o chilenos  hablando de una forma deforme que no se le entiende (perdón chilenos) pero es la verdad","replies":[{"poster":"Li Grim","date":"2016-01-07T18:37:15.889+0000","up_votes":1,"down_votes":0,"body":"No todos somos así, pero reconozco que me toca más las pelotas un chileno hablador, que un argentino igual de hablador y quejumbroso. \n\nPero cuando hago dúo con un argentino o uruguayo nunca uso modismos, tampoco mi dúo, porque sabemos perfectamente que  el año del ... nos entenderemos una palabra.","replies":[]},{"poster":"juuby","date":"2016-01-07T18:57:26.342+0000","up_votes":1,"down_votes":1,"body":"argentinos y chilenos hablamos mal arg:vos,pelotudo,che,salame,boludo chileno:wn,wea,po,saco wea","replies":[]}]},{"poster":"Khimea","date":"2016-01-07T17:45:09.050+0000","up_votes":2,"down_votes":0,"body":"Como dijo el señor DIESH017, no quiero escuchar a \"un chileno\" hablando en su dialecto o \"un argentino\" puteando y mucho menos a un rata decir \"YIYI WEL PLEY\" \"JEJE REPORT JUNGLA\" y otras boludeces varias.","replies":[]},{"poster":"Li Grim","date":"2016-01-07T17:39:28.560+0000","up_votes":2,"down_votes":1,"body":"Por Aláh no, pasaría lo mismo que en cs 1.6, todos poniendo su \"música\" a alto volumen, voces chillonas, quejas aquí y allá, gritos que te dejan sordo.\n\nY aunque existiera la opción de silenciarlos, significaría que no se aprovecharía el uso del micrófono al máximo.","replies":[]},{"poster":"MrBonk","date":"2016-01-10T17:17:17.889+0000","up_votes":1,"down_votes":0,"body":"Te mala idea loco imagínate todo el spam","replies":[]},{"poster":"RepT1LE","date":"2016-01-08T13:35:33.790+0000","up_votes":1,"down_votes":0,"body":"Porque todos asemejan el microfono a mas peleas entre chilenos y argentinos, por ejemplo en el cs go en los matchmaking juegan chilenos argentinos brazileros juntos  y nunca hay problemas o peleas por el tema del microfono es todo lo contrario la mayoria se llevan bien, nose ustedes pero no hay que pensar por el lado xenofobico.","replies":[]},{"poster":"YLG CALLEJERØS","date":"2016-01-08T04:22:44.286+0000","up_votes":1,"down_votes":0,"body":"Yo creo que el implemento de microfono en league of legends seria otro tema mas de peleas flameos ,etc...\nya que esta la pelea entre argentinos chilenos y otros paises. ya el chat esta por explotar de chilenos y argentinos flameando. me imagino si habria microfono, todos los de la partida flameandose entre si. No creo que sea buena idea implementar microfono.\nSaludos ^^ !","replies":[]},{"poster":"HI IM INFORNUS","date":"2016-01-07T18:04:53.127+0000","up_votes":1,"down_votes":0,"body":"la verdad que estaría bueno pero hay un montón de personas que no pueden aceptar el como hablan los demás \"chilenos, argentinos\" y al que ponga música alto volumen o putee mucho y cosas así la opción de mute y ya","replies":[]},{"poster":"Polska","date":"2016-01-07T20:38:09.965+0000","up_votes":1,"down_votes":1,"body":"La verdad que no, para eso hay programas externos donde hablas con quien vos elegis, imaginate, se volveria como un cs, donde un chabon mientras te pone cumbia en el microfono, el otro te bardea, y el otro se escucha la madre diciendo anda a bañarte y cosas asi, seria horrible.","replies":[]},{"poster":"juuby","date":"2016-01-07T18:56:04.870+0000","up_votes":1,"down_votes":1,"body":"seria mala idea XD los niños de 12 años insultarían sin parar e_e (me paso en dota)","replies":[]},{"poster":"byakon","date":"2016-01-07T18:42:12.333+0000","up_votes":1,"down_votes":1,"body":"Te imaginas lo horrible que seria escuchar a los trolls y a las personas que se enojan ? basta con leer lo que dicen ahora habría que escucharlos? no creo que sea la mejor idea mm tal ves seria una forma de conseguir una mejor comunicación y una mejor experiencia de juego pero también seria algo {{summoner:14}} **desastroso **{{summoner:14}}  o eso es lo que creo yo","replies":[]}]}