{"poster":"Tolkun","date":"2018-03-06T14:27:06.381+0000","title":"Bringt den alten Talon zurück !","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Als Talon-OTP des ehemaligen Talons w&uuml;rde mich mal brennend interessieren was die Allgemeinheit zu dem Rework sagt. F&uuml;r mich ist der Champion komplett gestorben, das Spielgef&uuml;hl ist komplett verloren. Es ist ja nun auch nicht so, dass der Champion auf gro&szlig;e Beliebtheit trifft, in der Kluft sieht man ihn nahezu nie. \r\nDenkt ihr es besteht eine Chance, dass das Talon wieder der alte werden k&ouml;nnte?\r\n\r\nGr&uuml;&szlig;e \r\nTolkun","replies":[{"poster":"Gin","date":"2018-03-06T14:35:14.358+0000","up_votes":1,"down_votes":1,"body":"Als jemand der den alten Talon vielleicht 10-20 mal anprobiert hat, und auf dem neuen um die 80-90k Mastery Points hat, finde ich den neuen um ein vielfaches besser als den alten.\n\nTalon ist meiner Meinung nach der einzige Assassine, vielleicht noch Katarina, gewesen bei dem das Rework 1A gelungen ist.\n\nLeBlanc und Shaco haben meiner Meinung nach deutlich härter gelitten.","replies":[{"poster":"Tolkun","date":"2018-03-06T14:40:04.903+0000","up_votes":2,"down_votes":0,"body":"Also ich habe auf dem alten Talon weit über 500K Punkte und den neuen kann ich einfach nicht Spielen. Er ist träge und schwach, wenn ich alleine über den alten \"E\" nachdenke.. jetzt ist der Champion so einseitig geworden. Also für mich ist der Champion überhaupt nichts und ich muss sagen ich hatte meinen Champion gefunden, egal wie oft ich Ihn gespielt habe ich hatte immer Spaß. Jetzt versuche ich Krampfhaft einen Champion zu finden der mir ansatzweise so viel Spaß macht, jedoch ist das bisher komplett erfolglos..","replies":[]},{"poster":"Veezey","date":"2018-03-06T15:15:43.049+0000","up_votes":1,"down_votes":0,"body":"Also ich mag die neue LB mehr als die alte. Die alte war auch einfach nur Tastenhämmern -> Kill.","replies":[]},{"poster":"Nack321","date":"2018-03-06T14:53:51.650+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gin,realm=EUW,application-id=Wj1wcocU,discussion-id=Il9t62Yu,comment-id=0000,timestamp=2018-03-06T14:35:14.358+0000)\n>\n> Als jemand der den alten Talon vielleicht 10-20 mal anprobiert hat, und auf dem neuen um die 80-90k Mastery Points hat, finde ich den neuen um ein vielfaches besser als den alten.\n> \n> Talon ist meiner Meinung nach der einzige Assassine, vielleicht noch Katarina, gewesen bei dem das Rework 1A gelungen ist.\n> \n> LeBlanc und Shaco haben meiner Meinung nach deutlich härter gelitten.\n\nFast zu gut gelungen die beweglichkeit plus der Schaden ist einfach der schrecken aller low hp Champs","replies":[]}]},{"poster":"A Ryze From Dead","date":"2018-03-06T14:35:59.114+0000","up_votes":2,"down_votes":0,"body":"Ich hab Talon, LeBlanc und Katarina vor dem Rework sehr viel, gerne und gut gespielt und nach dem Rework gar nicht mehr. Sie sind halt nicht mehr einfach straight forward Tastenrollen und das wahrscheinlich beabsichtigt.","replies":[]},{"poster":"Vogeljunges","date":"2018-03-06T15:08:23.651+0000","up_votes":1,"down_votes":0,"body":"Darfs dazu dann noch der Silence auf der \"e\" sein oder wäre es das für Sie? {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Im a Papaya","date":"2018-03-06T14:44:57.179+0000","up_votes":1,"down_votes":0,"body":"Ich find den neuen Talon auch anstrengender zu spielen aber der alte war einfach nur Tastenrollen... Ich bin schlecht in der Mitte und mit Assassinen aber Talon ist auch in Anfängerhänden ziemlich stark gewesen. Die W war einfach viel zu schnell um ausweichen zu können wenn du nicht gerade mit überirdischer Reaktionszeit am Rande standest und die E war ein absoluter Alptraum mit dem Damage Buff, teleport und slow in einem. Es gab zwar Unterschiede zwischen guten und schlechten Talon Spielern aber der Unterschied war eher, das ein guter Talon entkommen konnte nachdem er jemanden gekillt hat während ein schlechter draufgeht wenn er fertig ist... das war nicht sehr befriedigend für jeden der gegen ihn Spielen musste. \nDer neue hat Sustain und ne nette einzigartige Möglichkeit zu entkommen die wirklich nicht schlecht ist und die Passive ist wirklich nicht schwach und bemerkt man wenigstens im Gegensatz zur alten. Ich wäre dagegen das Rework aufzuheben weil Talon wirklich ekelig war und jetzt wenigstens durch nen Dash an dich rankommen muss statt einfach plötzlich hinter dir zu stehen und seine Tasten zu drücken.","replies":[]},{"poster":"SuicidePlank","date":"2018-03-06T14:39:05.488+0000","up_votes":1,"down_votes":0,"body":"Ich fand ihn ganz lustig, der neue ist aber eher das was ich mir unter einem 'Klingenschatten' vorstelle.","replies":[]}]}