{"poster":"Katz McMeaty","date":"2018-03-23T03:08:01.887+0000","title":"Radiant Wukong skin turns white or silverish?","subforum":"Report a Bug","up_votes":1,"down_votes":0,"body":"I haven&#039;t had this happen until today, but in the middle of my games my Radiant Wukong will change from the normal color to a silverish/whitish chroma. Anyone know what causes this? Duskblade maybe?","replies":[{"poster":"Moytramai","date":"2018-03-29T17:40:27.077+0000","up_votes":1,"down_votes":0,"body":"Hello \n\nI am also experiencing this happens literally every game for me and sometimes my premades see it and other times they dont, started last week Wednesday 21st March 2018 when i decided to play with that particular skin in a game.\n\nI find that it happens most times after dying with duskblade, weird thing is that when watching the replay on client it randomly going white and not the same times that it goes white in game.\n\nIMPORTANT:\nAlthough this is definitely a bug that appears to look like wukong full death animation I urge Riot Games not to resolve or fix it because literally its the coolest thing i've seen since playing league :D \n\nI was going to report it when i first saw it but like i said its too damn cool ! also i dont see any advantages of the colour change \n\nSO PLEASE KEEP ULTRA INSTINCT WUKONG","replies":[]},{"poster":"LeeVí","date":"2018-03-24T22:35:06.655+0000","up_votes":1,"down_votes":0,"body":"https://youtu.be/EAflNIomf1g","replies":[]},{"poster":"moonstones","date":"2018-03-23T19:06:39.575+0000","up_votes":1,"down_votes":0,"body":"Hey! \n\nI've seen a few reports of this, trying to track it down now! \n\nI'll look into Duskblade. Would you happen to have a replay/video or would you be able to get me your R3dlogs from that game? \n\n**TL;DR** - A match log is created each time you play a game. It contains vital information about your loading process and will log any errors that occur during the course of the game. These logs are essential for troubleshooting in situations where you have problems in-game.\n\nEach file appears like this: [yyyy-mm-ddT15-40-03] _r3dlog.txt, where yyyy-mm-dd is the date of the match played.\n\n**You can find them here:**\n\nC:\\Riot Games\\League of Legends\\Logs\\GameLogs, under the time and date stamped folder for the game in which you had issues.\n\nAny additional info is appreciated!\n\n**EDIT**: Okay! Figured it out! Looks like it's just when he dies, the gray overlay is reapplying once he's alive again. ","replies":[]},{"poster":"Horus Lupercal","date":"2018-03-23T12:41:36.480+0000","up_votes":1,"down_votes":0,"body":"Yeah, it happened to me several times after last patch (8.6) I play mostly aram, and I've played wukong around 4 times now with the radiant skin, everytime the same thing happened, i asked my teammates and they confirmed it, apparently everyone else can see it, but I still don't know what triggers it","replies":[]}]}