{"poster":"I Play Top Plz","date":"2015-02-02T08:04:23.448+0000","title":"Shaco \"sin late\"","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"¿Es reportable que me molesten/insulten por usar a {{champion:35}} ?\r\nUn {{champion:75}}  de mi equipo se la paso criticando me, diciendo que no tenía late y lo típico que dicen todos :c\r\nAparte de eso, ¿Por qué dicen  tanto que {{champion:35}}  no tiene late?\r\nSiempre que lo uso por lo general consigo muchas kills/assist, me parece bastante bueno, pero parece que a los demás no les agrada mucho..","replies":[{"poster":"Revolución","date":"2015-02-02T08:52:36.824+0000","up_votes":3,"down_votes":0,"body":"En realidad ojo, cualquier champ bien feed y con manos puede servir en late, lo que pasa es que Shaco en una partida donde todos vienen parejos y el nivel es similar decae mucho, su fase fuerte es el early. No es useless, pero aporta menos que otras opciones. Igualmente, nadie dijo en ningún lado que un champ de early sea algo malo...","replies":[]},{"poster":"Vastorn","date":"2015-02-02T08:08:54.165+0000","up_votes":2,"down_votes":0,"body":"Porque por lo general uno se encuentra con Shacos feeders. No es que te crean malo, es que no confían en ti. \n\nYo, por mi parte tengo una anecdota con un amigo; en selección de campeón, alguien dijo \"maineo shaco AP\". 2/17/4. Desde entonces, lo recordamos como \"el legendario Shaco AP\".","replies":[{"poster":"hi im kalash","date":"2015-02-02T09:07:50.351+0000","up_votes":1,"down_votes":0,"body":"jaajjaja me hiciste recuerdo al video de instalock \"AP Shaco pentakill\"","replies":[]}]},{"poster":"Runth","date":"2015-02-02T14:01:09.848+0000","up_votes":1,"down_votes":0,"body":"Es que en realidad shaco decae mucho porque se countea a si mismo, sus efectos activos y su buffos, \n\nLos shacos novatos siempre suelen mancarse pero jungla es bueno, pero demaciado","replies":[{"poster":"I Play Top Plz","date":"2015-02-02T22:43:36.010+0000","up_votes":1,"down_votes":0,"body":"De hecho, muchas veces me toca a ver Lee sin enemigos, siempre les parto el culo :$ (Pero cabe decir que nunca me hacen counter jungla)","replies":[]}]},{"poster":"Ice","date":"2015-02-02T11:18:30.442+0000","up_votes":1,"down_votes":0,"body":"Si tienen actitud negativa con el lenguaje hacia vos en una partida puedes reportarlos tranquilamente, no te olvides de agregar comentarios en el reporte.\n\nBásicamente {{champion:35}} tiene un excelente early game, trata de dejarles las kills a las lanes porque en el late decae mucho, podes dedicarte a hacer split push en late para mantener algo de la ventaja inicial. Pero su aporte en teamfights es menor al de los otros junglas.","replies":[{"poster":"I Play Top Plz","date":"2015-02-02T11:27:04.072+0000","up_votes":1,"down_votes":0,"body":"De hecho en esa partida quede 11-4-2 (Pro ks (?))\nY al final esa persona dijo algo como esto:\n\"No vuelvo a jugar nunca más con un Shaco, necesitan a alguien que los carree o son inútiles\"\nPero tuvo un odio especial :/","replies":[]}]},{"poster":"ProfesorSinged","date":"2015-02-02T15:41:00.736+0000","up_votes":1,"down_votes":1,"body":"No entiendo la razón de la broma de \"Shaco no tiene late\". Hay muchos campeones que también soy de early y no brillan en late (Renekton , Xin Zhao, Urgot, Heimerdinger, Blitzcrank, Kha' Zix, Pantheon, Fiddlesticks, Evelynn, Lee sin, Garen, etc.","replies":[]}]}