{"poster":"Mikali ftw","date":"2016-08-18T12:08:00.470+0000","title":"I challenge you to find me roles to main! :)","subforum":"Gameplay","up_votes":1,"down_votes":1,"body":"Hello everyone!\n\nI am your so called  Jack of All Trades Master of None!\nI really suck at picking 1 role, or even 2, picking a main champion seems impossible!\n\nI will write down what do I like and hopefully you can clear up some things for me :)\n\nI am a teamfighter, I do not enjoy passive lanes, and I am not really great at last hitting because I get too distracted by my bloodlust to kill opponent laner (or to trade and control lane).\nTeamfighting seems like something I am best at. Because of my great knowledge of roles and champions (how much dmg they deal, what is their cooldown on abilities, range, even mana costs, what is their typical rotation and thinking process) you could say I know how to manipulate teamfights.\nThat is why I usually pick champions that have greater impact in teamfights.\nChampions like amumu, sejuani, sona, janna, orianna, lissandra, even ahri cuz of charm and pick potential she has with it, gragas, gnar, kennen, lulu, malphite, morgana, nami, thresh, taric, syndra.\nFirst teamfighting game I&#039;ve played was Guild Wars (1, Prophecies, etc.) and there I&#039;ve learned how to do it, how to focus on targets and manage all the cooldowns and skill effects, it was 8vs8, so this 5vs5 is so much easier for me to handle.\n\nI like CC, cuz it controls what can be done. I am great in skillshots (cuz of years and years practicing aim in all kind of games, counter strike being the main one - from 2003 till today) and I am very confident in hitting and using them.\n\nI like big impact skills, like ultimates from sona, sejuani, amumu, orianna, gnar, kennen which can affect all 5 members of enemy team.\nI like CC skills like Janna&#039;s tornado cuz I am great at peeling, lulu&#039;s w cuz it shutdowns biggest threat target, lissandra&#039;s kit cuz she is CC/outplay/mindplay queen.\n\nI do not enjoy not having CC, like most of the assassins, I am not great at using fast comboes (like riven, lee sin or azir).\n\nI do like dmg, cuz I want that adc or ap carry dead, so just enough of it to get them works for me.\n\nI do like mobility, cuz I am great at seeing opportunites to pick enemy target (one misstep and he will eat my charm, or bind from morgana).\n\nSo guys, what do you think I should main? Atm in ranked it&#039;s 2 roles to choose from, so it&#039;s 2 roles to main, and I don&#039;t mind having 3 champs for each role to main (I don&#039;t need to become OTP).\n\nI do see myself as support, but the biggest problem here is randomness of adc in lane and I don&#039;t have friends to play with and have hard time finding adc that impress me enough for me to invite him for duo.\n\nThanks in advance!\nI hope you see something I don&#039;t, also, this is aimed for Diamond+ elo","replies":[{"poster":"Caítlyn","date":"2016-08-18T12:34:43.042+0000","up_votes":2,"down_votes":0,"body":"I suggest Amumu Zac or Sejuani\n\nAll have long range initiation, multiple CCs, and enough damage to solo carries","replies":[]},{"poster":"Evewynn","date":"2016-08-18T12:55:40.223+0000","up_votes":1,"down_votes":0,"body":"Play Annie. Her q makes it super easy to last hit, she deals crazy damage, and has one of the most impactful ultimates in the game. Plenty of CC and burst, being able to delete out single targets or stun multiple people for crazy initiation. Easy to play, too. If you want to go mid, I'd suggest her.","replies":[]},{"poster":"Spoofghoul","date":"2016-08-18T12:55:16.889+0000","up_votes":1,"down_votes":0,"body":"{{champion:14}}","replies":[]},{"poster":"Erockandroll","date":"2016-08-18T12:52:09.446+0000","up_votes":1,"down_votes":0,"body":"Sounds like you have a lot of supports on that list. This game could always use more support mains. \n\nSona's good, So is Taric.","replies":[]},{"poster":"Ralanr","date":"2016-08-18T12:49:21.409+0000","up_votes":1,"down_votes":0,"body":"Tank junglers seem like a good place for you. Sion, Sejuani, Zac, Amumu, and Maokai are what I'd recommend. \n\nAnd aw Caitlyn said, they can kill ADCs if you play it right. Course they can kill you with enough kiting. So don't expect to always win those fights.","replies":[]}]}