{"poster":"Êneru","date":"2015-08-28T21:36:11.247+0000","title":"Campioni mai visti, cosa hanno che non va?","subforum":"Discussioni generali","up_votes":7,"down_votes":4,"body":"non ho mai visto questi campioni {{champion:266}} {{champion:38}} {{champion:30}} {{champion:133}} {{champion:106}} {{champion:6}} {{champion:29}} {{champion:83}} {{champion:115}} {{champion:26}} \n\nsono cos&igrave; fuori meta? io non li ho mai visti giocare, apparte una volta Quinn che massacr&ograve; completamente tutti carriando e basta\n\n\n------------------\n \ncosa sono tutti questi -1 a caso? una domanda ho fatto... italian community ftw\nnon sanno neanche a che servono..","replies":[{"poster":"SKFF1R SubZero","date":"2015-08-28T23:24:44.677+0000","up_votes":1,"down_votes":1,"body":"{{champion:266}} Con il devourer, è una vera e propria bomba a orologeria: io lo vedo spesso (la mia penultima partita ndr) e anche in TOP non è affatto male.\n\n{{champion:38}} Un tempo era noto come KassaWIN: dopo tutti i nerf che ha subito, ormai è davvero difficile vederlo ma la colpa non è della Riot. \nE' un Champion come {{champion:107}}: è difficile da bilanciare perchè ha un kit fatto apposta per essere mobile quindi, se togli troppo, diventa una merda; se lo buffi un po', diventa Dio. Anche Rengar, assieme a Riven, verrà nerfato molto presto (almeno così si vocifera)\n\n{{champion:30}} Io prevedo un suo nuovo utilizzo ora nella meta dei Juggernaut: i Juggernaut saranno lenti e poco mobili quindi un control mage come lui può fare molto. Defile è un po' una mossa stupida per lui, a meno che tu non muoia in mezzo al team nemico, motivo per cui dovrebbero magari mettergli o una sorta di mezzo stun (così le Q le prendi bene) oppure un altro cc tipo snare (Lux 2.0 insomma)\n\n{{champion:133}} E' un adc atipico perchè è un Bruiser adc: non si sa bene come giocarlo spesso e in teamfight il fatto che si debba buttare in mezzo al team per sfruttare la sua Ultimate è un po' dannoso per un adc tutto ad e niente hp, motivo per cui è poco pickata. Se vuoi un Bruiser adc che faccia quello che fa lei e che sia molto più sicuro hai {{champion:42}} o {{champion:236}} per dire\n\n{{champion:106}} Ci ho appena vinto una partita pre-promo: mettici cinderhulk, titanic hydra, randuin, spirit ed è impossibile da uccidere in teamfight. Facevo danni assurdi tra E+Q+AA+Attiva della Titanic+W e resistevo in 1v4 a fine build e late game (Vayne, Khazix, Azir e Irelia su di me, non Corki per dire). Anche lui sarà protagonista di un'impennata assurda di win secondo me.\n\n{{champion:6}} Urgot ha avuto il suo momento mid grazie a Keane che lo ha praticamente sbattuto in faccia a Bjergsen sto pick: è stato anche buffato (La W che scala a mana massimo) ma non ha mobilità.. Un adc immobile deve poter fare danni abnormi (KogMaw per dire ne fa il doppio nello stesso lasso di tempo)\n\n{{champion:29}} Lo stanno pickando molto in Corea, Cina e Giappone: che sia il preludio ad un suo grande ritorno dopo aver dominato nella S3 o semplice gusto per i ratti non lo so ma l'ho sempre trovato un Champion bello da giocare.\n\n{{champion:83}} Stanno progettando il suo rework perchè è un Champion anti-fun. Se lo hai contro, non puoi counterpickarlo. Non esiste counterplay a Yorick, almeno in 1v1, motivo per cui la Riot lo vuole reworkare: staremo a vedere cosa ne uscirà!\n\n{{champion:115}} Stesso discorso per Karthus: io dico che, assieme a questi due, rivedremo Lux, Orianna e altri control-utility mages in questa meta \"immobile\" dei Juggernaut :)\n\n{{champion:26}} E' un Champion che non piace a nessuno. Ha una passiva che è meh: specie a high elo, non ingaggi l'avversario se ha un livello sopra per la passiva del nonno. Ha uno stun che non è molto affidabile e un altro cc che o è un cc single-target o è un buff sempre single-target. \nHa una Ultimate che ti permette di salvare il culo a chiunque ma c'è un Champion che lo fa meglio, molto meglio (Hey {{champion:117}}), motivo per cui non è un grande pick. \nSpero seriamente che venga buffato: mi è sempre piaciuto Zilean d'altronde :D\n\nE noto che non hai citato {{champion:44}}: le gemme non piacciono alle persone :(","replies":[{"poster":"Êneru","date":"2015-08-29T13:05:58.105+0000","up_votes":1,"down_votes":0,"body":"A differenza di quelli che ho citato, Taric e Urgot li ho visti (anche se molto raramente) giocare, in questo post ho inteso quelli che non ho proprio mai visto apparte 1 volta Quinn","replies":[{"poster":"Frattaglia","date":"2015-08-29T16:30:36.394+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Êneru,realm=EUW,application-id=MJVj50Jw,discussion-id=WctVoOFQ,comment-id=00030000,timestamp=2015-08-29T13:05:58.105+0000)\n>\n> A differenza di quelli che ho citato, Taric e Urgot li ho visti (anche se molto raramente) giocare, in questo post ho inteso quelli che non ho proprio mai visto apparte 1 volta Quinn\n\n{{champion:44}} ci ho appena vinto una ranked {{champion:44}}\n\nComunque un altro dimenticato è {{champion:3}}","replies":[{"poster":"SKFF1R SubZero","date":"2015-08-29T16:41:06.435+0000","up_votes":1,"down_votes":0,"body":"{{champion:78}}  {{item:3070}}","replies":[]}]},{"poster":"SKFF1R SubZero","date":"2015-08-29T16:42:47.897+0000","up_votes":1,"down_votes":0,"body":"Mi sa strano che tu non abbia visto Volibear o Aatrox: i nuovi oggetti (devourer prima e Hydra dopo) hanno buffato indirettamente tutti gli Autoattacker e tutti i Tank che stackano hp :)","replies":[]}]},{"poster":"FuryTheFenix ITA","date":"2015-08-31T11:17:05.745+0000","up_votes":1,"down_votes":0,"body":"Io ho giocato con Taric support(io)e come adc avevo Urgot.\nAbbiamo vinto ! Vs Sivir e Sona.","replies":[{"poster":"SKFF1R SubZero","date":"2015-08-31T11:39:03.266+0000","up_votes":1,"down_votes":0,"body":"Mica ho detto che fanno schifo o che non ci puoi vincere le partite: ho detto che non vengono pickati per certi motivi nella meta attuale!","replies":[]}]}]},{"poster":"Giacux","date":"2015-08-29T08:40:05.899+0000","up_votes":2,"down_votes":0,"body":"Ti sei dimenticato di {{champion:3}}  :(","replies":[{"poster":"Êneru","date":"2015-08-29T13:10:48.869+0000","up_votes":1,"down_votes":0,"body":"L'ho visto un paio di volte giocare, secondo me se la sua passiva scalasse metà per armor e metà per mr sarebbe leggermente meglio, sennò se hanno 0 ap la sua passiva è quasi inutile, o solo utile all'inzio per quel 20 ap in più, tralaltro i suoi costi in mana sono davvero eccessivi, 1 Q e già ti ritrovi a metà mana\n\nDici che la sua passiva lo forza a giocare solo quando hanno molti ap? O sai se verrà buffato/reworkato?","replies":[{"poster":"Giacux","date":"2015-08-29T14:16:56.063+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Êneru,realm=EUW,application-id=MJVj50Jw,discussion-id=WctVoOFQ,comment-id=00070000,timestamp=2015-08-29T13:10:48.869+0000)\n>\n> L'ho visto un paio di volte giocare, secondo me se la sua passiva scalasse metà per armor e metà per mr sarebbe leggermente meglio, sennò se hanno 0 ap la sua passiva è quasi inutile, o solo utile all'inzio per quel 20 ap in più, tralaltro i suoi costi in mana sono davvero eccessivi, 1 Q e già ti ritrovi a metà mana\n> \n> Dici che la sua passiva lo forza a giocare solo quando hanno molti ap? O sai se verrà buffato/reworkato?\n\nSe scalasse per l'armatura sarebbe broken ma perderebbe la sua identità di miglior counter ai danni magici del gioco. \nSi, se non hanno doppio o più AP non giocarlo. \nIn S3 era stato annunciato un rework in cui avrebbero cambiato la passiva dandogli degli scaling sulla resistenza magica. \nS5 e ancora niente, lol","replies":[{"poster":"Êneru","date":"2015-08-29T14:20:08.338+0000","up_votes":1,"down_votes":0,"body":"Bhe potrebbe essere una sorta di Juggernaut AP, un mezzo-counter a chiunque :o","replies":[{"poster":"Frattaglia","date":"2015-08-29T16:32:37.959+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Êneru,realm=EUW,application-id=MJVj50Jw,discussion-id=WctVoOFQ,comment-id=0007000000000000,timestamp=2015-08-29T14:20:08.338+0000)\n>\n> Bhe potrebbe essere una sorta di Juggernaut AP, un mezzo-counter a chiunque :o\n\nAh qualcuno l'ha nominato Galio :D\n\nSecondo me è giusto che resti focussato sull'mr... per lo scaling sull'armor, c'è già {{champion:33}}","replies":[]}]}]}]}]},{"poster":"Lucouss","date":"2015-08-28T21:58:54.115+0000","up_votes":2,"down_votes":0,"body":"Aatrox ha guadagnato molto con il devourer, e ogni tanto me lo trovo in partita.\nKassadin quoto, ha un kit troppo difficile da bilanciare.\nKarthus è carino da giocare, però il suo kit si basa su lanciare queste maledette Q che se le prendi da solo subisci davvero tanti danni, ma la sua E mi sembra alquanto stupida, poiché è un mago. Devi essere un po' bravo con lui, altrimenti in early l'avversario snowballa su di te.\nQuinn non ha un ruolo suo, o almeno io non lo trovo. Adc o Top splitpusher grazie alla sua ultimate? Non so, non mi piace proprio quel campione.\nVolibear invece lo si vede usare, e io stesso l'ho usato in alcune mie partite classificate.\nUrgot non è male in questo meta dei tank, poiché riduce l'armatura. L'unica cosa è che mi sembra abbia poco range con gli attacchi base, e non abbia un posto fisso (Adc? uhm, l'ho visto usare molto anche Mid e Top).\nTwitch sta ricevendo piccoli buff nelle ultime patch, ma non è ancora al livello degli altri adc. Se feedato può fare pentakill grazie alla sua ultimate, con cui riesce a colpire potenzialmente tutti i campioni nemici.\nYorick ha un kit vecchio, e sta per essere reworkato. Serve solo in particolari team comp (vedi agli lcs, ultimate su Cassiopeia).\nZiggs lo si vede, il suo problema però è nel non avere mobility (se non grazie alla W).\nZilean FA SCHIFO! Lo odio! Dopo il rework lo trovo un campione piuttosto inutile, sopratutto in questo meta dei tank. Io ho da un po' di tempo l'idea di giocarlo tank, ma mi fa così schifo che non ci provo neanche. (Tank: Q per stunnare, W non scala, E non scala, R la si usa sull'adc, può riuscire a salvarsi lo stesso anche con 300/500 hp in meno).","replies":[{"poster":"SKFF1R SubZero","date":"2015-08-28T23:29:31.695+0000","up_votes":1,"down_votes":0,"body":"Oh, cavolo, hai già risposto tu al ragazzo dicendo più o meno le stesse cose che ho scritto anche io: scusa, non avevo visto sennò scrivevo qua sotto le aggiunte :(","replies":[{"poster":"Lucouss","date":"2015-08-29T07:42:36.826+0000","up_votes":2,"down_votes":0,"body":"Ahah non importa, sempre meglio una risposta in più che una in meno :)","replies":[]}]},{"poster":"Best Chair Euw","date":"2015-08-29T06:01:00.222+0000","up_votes":1,"down_votes":0,"body":"E la W di ziggs, tra l'altro non è neanche così facile come jump/escape xD.\nConcordo su tutto tranne Quinn ( ma non perché non abbia effettivamente qualche carenza,anzi) , dissento perché la amo. È una brutta malattia ma Quinn è spettacolare <3","replies":[{"poster":"Lucouss","date":"2015-08-29T07:47:04.545+0000","up_votes":1,"down_votes":0,"body":"A me non dispiace giocarlo, però non avere mobility su un campione che non ha neppure uno stun e non riesce a burstare nessuno, è una grande pecca.","replies":[]}]}]},{"poster":"darknessangels93","date":"2015-08-31T11:26:39.285+0000","up_votes":1,"down_votes":0,"body":"{{champion:133}} è un top laner. Non un adc","replies":[]},{"poster":"Samel Seifer","date":"2015-08-29T21:37:44.812+0000","up_votes":1,"down_votes":0,"body":"Posseggo ed utilizzo la metà dei champ che hai citato, quelli che non ho non li disdegno quando sono in rotazione, non mi sembra abbiano nulla di sbagliato, anzi.","replies":[]},{"poster":"Giovarco","date":"2015-08-29T18:15:03.011+0000","up_votes":1,"down_votes":0,"body":"Aatrox: debole in early game e non fa nulla di particolare. Con la build completa è una spina nel sedere, senza contare che ogni teamfight in late game ha sempre la passiva. Non ha un'identità ben solidificata in termini di gameplay.\n\nKassa: dimenticato dopo i tanti nerf, ma è sempre lì a rientrare in meta.\n\nKarthus: In soloQ non lo gioca nessuno. Si vede ogni tanto nello scenario competitivo. Non dico che non sia divertente da giocare (è soggettivo), ma l'unico motivo per giocarlo, almeno per me, è ascoltare il suo fantastico doppiaggio.\n\nQuinn: E' forte, ma ha ancora dei bug antipatici che non sono stati risolti. Inoltre è una sorta di bomba al grappolo che si butta in mezzo agli avversari per esplodere e farsi esplodere. E' una specie di assassina e non ha nulla a che fare con gli ADC che stanno dietro ai tank a fare danno in teamfight.\n\nVolibear: Buon early game, ma facile da kaitare. Perderà molto con i nuovi juggernaut. Tutti hanno preso danni puri o particolari steroidi che Voli non ha.\n\nUrgot: Solo ad una cerchia ristretta piace vedere il lardo fluttuante... Io sono uno di quelli.\n\nTwitch: Debole in early game e ha bisogno di ottimo peeling. Semplicemente nessuno lo gioca, ma in late game può fare 1v5.\n\nYorick: Chi è che non vuole dimenticarlo / non vederlo per il resto della propria vita?\n\nZiggs: Dimenticato, ma è sempre lì a rientrare in meta.\n\nZilean: Al momento è in uno stato in cui, sì, si può giocare, ma non è per nulla divertente da giocare a parer mio perché beccare quelle Q di fila è impossibile contro gente che ha dash. C'è di meglio. Se vuoi salvare i compagni normalmente si prende {{champion:10}} o {{champion:223}} , per dirne due.","replies":[]},{"poster":"A Yordle ln Heat","date":"2015-08-29T16:25:01.215+0000","up_votes":1,"down_votes":0,"body":"Quindi non c'eri nel periodo in cui Urgot veniva spammato e usato da tutti?\nBeato te.","replies":[]},{"poster":"kirchhoff","date":"2015-08-29T16:15:14.032+0000","up_votes":1,"down_votes":0,"body":"{{champion:29}} {{champion:115}} {{champion:38}} hanno avuto i loro momenti di gloria\n{{champion:6}} {{champion:83}} stiamo aspettando che li rifacciano\n{{champion:133}} neanche la riot sa cosa è\ngli altri sono mediocri adesso\n\nil problema sta nell'ecosistema che esiste tra i campioni che hai citato, gli altri campioni, gli oggetti e la \"tradizione\"","replies":[]},{"poster":"Nibbio Bianco","date":"2015-08-29T07:50:57.062+0000","up_votes":1,"down_votes":0,"body":"Urgot viene pickato da maplestreet8 degli L.A. Renegades e da Keane dei Gravity. Il primo lo usa come adc, il secondo in midlane. Il problema è che è molto forte in lane ma allo stesso tempo anche poco mobile, è facile che il jungler avversario ti punisca venendo più volte nella tua lane, ma comunque è uno dei campioni più forti del gioco in 1vs1.","replies":[{"poster":"Êneru","date":"2015-08-29T13:13:22.044+0000","up_votes":1,"down_votes":0,"body":"Se aggiungessero mobilità allo scudo tipo Rumble? Anche se il suo cd non è proprio basso\nOppure una sorta di salto in avanti quando usa la E, cosi può diciamo agganciarlo meglio o lanciarlo in un altra direzione per scappare tipo la E di Caitlyn","replies":[{"poster":"Nibbio Bianco","date":"2015-08-29T15:37:11.095+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Êneru,realm=EUW,application-id=MJVj50Jw,discussion-id=WctVoOFQ,comment-id=00060000,timestamp=2015-08-29T13:13:22.044+0000)\n>\n> Se aggiungessero mobilità allo scudo tipo Rumble? Anche se il suo cd non è proprio basso\n> Oppure una sorta di salto in avanti quando usa la E, cosi può diciamo agganciarlo meglio o lanciarlo in un altra direzione per scappare tipo la E di Caitlyn\n\nGià ora come ora è un campione troppo forte, ha i danni da un adc, ma è contemporaneamente un tank, è un bruiser con range. L'unico suo problema è che per fare i danni che può fare deve beccare con la E il carry, se lo prende è la fine per il carry. Contemporaneamente, comunque, la sua ultimate è una minaccia sia per gli assassini sia per il carry se si dovesse avvicinare troppo, quindi è uno di quei campioni alla Orianna, nei teamfight la sua ultimate ti mette veramente tanta pressione, contro Urgot bisogna stare molto attenti sia a giocarlo sia a giocarci contro, inoltre essendo uno dei campioni che farma meglio e che contemporaneamente è uno dei più forti nella lane è molto difficile farlo uscire indebolito dalla fase di linea. Questi sono i motivi per cui Urgot è il mio campione preferito, ha un sacco di punti deboli, ma i suoi punti forti sono veramente forti... tanto scudo, tanto dps, danni che si avvicinano al true damage...","replies":[]}]}]},{"poster":"Invisible Bonny","date":"2015-08-29T15:14:26.959+0000","up_votes":1,"down_votes":0,"body":"{{champion:106}} tutto tranne che vederlo raramente. è Op e lo usano spesso... anche se mi fa pena","replies":[{"poster":"Êneru","date":"2015-08-29T15:21:25.790+0000","up_votes":1,"down_votes":0,"body":"bho io non l'ho mai visto D: sarò io che sono ancora lowelo skrub","replies":[]}]},{"poster":"SirZeel","date":"2015-08-28T23:27:44.003+0000","up_votes":1,"down_votes":0,"body":"Il problema dei campioni è chi li gioca.","replies":[{"poster":"Êneru","date":"2015-08-29T13:18:15.971+0000","up_votes":1,"down_votes":0,"body":"Il problema è che non li gioca proprio nessuno :|\nDevo ammettere che quando ho visto quella Quinn oneshottare tutti molto velocemente, tralaltro una volta l'ho vista e ha fatto una penta, mi è venuta voglia di comprarla e provarla, non mi sembra neanche tanto brutto da giocare come champ\nche ne pensi?","replies":[]}]},{"poster":"Sorcio84","date":"2015-08-29T12:36:53.309+0000","up_votes":1,"down_votes":0,"body":"{{champion:26}} \npassiva : è passabile in early ma poi poco a poco cade nell'inutilitá\nQ - difficile da poazzare come stun, vai a fortuna\nW - utile al massimo per castare 2 volte la E per fuggire\nE - buona per correre e far correre , raggio troppo piccolo per usarla sui bemici\nR - difficile usarla con tempismo. Spesso la gente evita di morire fuggendo e chi sta tornando in vita viene sacrificato per far fuggire gli altri. se rinasci te vieni abbandonato dal team.\n\n{{champion:44}} \nstanno progettando un suo rework per la prossima preseason, al 100% nuovo. Ovviamente dopo aver sistemato poppy\n\n{{champion:29}} \nchamp da late. Ha bisogno di almeno 1-2 item per iniziare a far danni seri","replies":[]},{"poster":"Lightning ff","date":"2015-08-29T12:16:54.644+0000","up_votes":1,"down_votes":0,"body":"Per atrox non so top ma in giungla anche col devourer non worka molto, sebbene sempre meglio di prima, consiglio vivamente di andare a vedere il video di agualegends di YouTube su atrox col devourer","replies":[]},{"poster":"ScorpionRituals","date":"2015-08-28T22:36:11.027+0000","up_votes":1,"down_votes":0,"body":"Ziggs forever <3","replies":[{"poster":"Êneru","date":"2015-08-28T22:54:19.859+0000","up_votes":1,"down_votes":0,"body":"la Q ha un cd bassissimo, i suoi ap ratios non sono tanto bassi e la sua ulti e abbastanza grossa, quindi contro solo mobility?","replies":[{"poster":"ScorpionRituals","date":"2015-08-29T10:35:27.354+0000","up_votes":1,"down_votes":0,"body":"Diciamo di si, io quando avanzo in lane per paura che venga il jungler nemico a gankare mi conservo la sua carica satchel così torno sotto torre easy","replies":[]}]}]},{"poster":"SideshowEMS","date":"2015-08-28T21:45:10.418+0000","up_votes":1,"down_votes":0,"body":"Ti dico solo che c'è una patch che è stata soprannominata \" The death of Kassadin \", e prima di quella era già stato nerfato 3 o 4 volte.\n\nUrgot e Yorick li reworkano. \n\nKarthus a me piace, ma a nessuno va di prendere la mira per centrale le sue sue Q. Meglio uno che clicchi 2 volte e faccia esplodere qualsiasi cosa.\n\nQuinn spegne le cose. A prescindere in genere. Non so perché non venga usata. Stesso per Twitch. Forse è per i tank ?\n\nVoli e Ziggs li vedo. Voli di più.\n\nAnche Zilean mi piace, e secondo me funziona, ma dopo il rework non è molto amato.\n\nAaratrox boh, l'ho usato 3 volte.","replies":[]},{"poster":"Ste the ripper","date":"2015-08-28T23:34:30.812+0000","up_votes":1,"down_votes":1,"body":"khartus è spammatissimo ad livelli, è molto forte grazie al nuovo rilay, twitch non è malaccio.\nGli altri effettivamente hanno qualcosa meno","replies":[]}]}