{"poster":"Musjunama","date":"2018-09-28T10:51:05.001+0000","title":"Gnip - Der Pingmaster [Championkonzept]","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":3,"body":"Gnip ist ein Champion, bei dem die F&auml;higkeiten auf den Pings seiner Mitspieler basieren. Je nach dem wie viele Verb&uuml;ndete in der Castzeit einen bestimmten Ping t&auml;tigen, wird so demokratisch dar&uuml;ber entschieden welche F&auml;higkeit es sein soll. Sollte keiner der Verb&uuml;ndetetn Pingen oder sollten alle etwas anderes gepingt haben, passiert nichts. Sollte nach 10 Sekunden nur ein Verb&uuml;ndeter gepingt haben, wird die F&auml;higkeit seiner Wahl eingesetzt.\r\n\r\n**Passive:**\r\nGnip kann nicht Q, W und E gleichzeitig aktivieren. Alle 10 Minuten bekommt Gnip 5 Schaden und 5 F&auml;higkeitsst&auml;rke f&uuml;r 10 get&auml;tige Pings des gegnerischen Teams. Gnip kann seine Pings nur in der Reichweite seiner F&auml;higkeiten einsetzen, nicht global.\r\n\r\n**Q: Er&ouml;ffnungs-Ping:**\r\n\r\nAusrufezeichen: Ein Ausrufezeichen f&auml;llt vom Himmel. Dabei verursacht der Punkt die Schadensspitze und der Rest des Zeichens Schaden &uuml;ber Zeit.\r\nFragezeichen: Gnip bekommt einen Schild, abh&auml;nig von seinen AP.\r\nHilfezeichen: Heilt Verb&uuml;ndete in einem nahen Breich von ihm, abh&auml;ngig von seinen AP.\r\nUnterwegszeichen: Laufspeed f&uuml;r Verb&uuml;ndete in einem nahen Bereich von ihm, abh&auml;ngig von seinen AP.\r\n\r\n**W: Buff-Pings:**\r\n\r\nAusrufezeichen: Erh&ouml;ht seine Angriffsgeschwindigkeit kurzzeitig um 10%.\r\nFragezeichen: Negative Massenkontrolleffekte k&ouml;nnen von Verb&uuml;ndeten entfernt werden (2 Minuten Cooldown).\r\nHilfszeichen: L&auml;sst ein Hilfezeichen auf dem Boden erscheinen. Wenn ein Verb&uuml;ndeter es anklickt, wird er zu der Position von Gnip herangezogen und bekommt einen Schild.\r\nUnterwegszeichen: Beschw&ouml;rt ein Unterwegszeichen, was die Gegner in dem Bereich verlangsamt.\r\n\r\n**E: Spam:**\r\n\r\nAusrufezeichen: Nach diesem Ping macht sein n&auml;chster Autoattack magischen Schaden.\r\nFragezeichen: Deckt ein Gebiet in der N&auml;he von Gnip kurzzeitig auf.\r\nHilfezeichen: Erh&ouml;ht die Resistenzen aller Verb&uuml;ndeten und von sich selbst je nach dem wie viele Verb&uuml;ndete in seiner N&auml;he sind\r\nUnterwegszeichen: Ist global. Wenn ein Verb&uuml;ndeter den von Gnip vorgeschlagenen Weg geht, bekommt er auf diesem Laufspeed. Wenn er das Ende des Weges erreicht, bekommt er kurzzeitig Angriffstempo.\r\n\r\n**R-Ultimative: Ende der Geduld:**\r\n\r\nL&auml;sst alle vier Pings aufleuchten. Die n&auml;chste Q, W oder E Taste, die Gnip dr&uuml;ckt, l&ouml;st alle m&ouml;glichen Effekte aus. ( 1 Minute Cooldown)","replies":[{"poster":"RyuPlay","date":"2018-09-30T18:25:06.752+0000","up_votes":1,"down_votes":0,"body":"Ein nettes Konzept, doch das ganze für einen Champion zu benutzen halte ich für nicht Spielerfreundlich da Pingen im Spiel zwar wichtig ist man allerdings nicht die ganze Zeit irgendwo Pings spammen sollte.\nFür einen Spielmodus der \"Ping-Orientiert\" ist oder ein Event bei dem es eine Maschine oder NPC mit solch einer Funktion existiert halte ich da schon für etwas realistischer und teilweise auch leichter umsetzbar, man könnte z.B. aus dem Pingen im Spiel ein Quiz-Eventmodus machen bei dem man Pingen muss um eine Frage zu beantworten und die Spieler mit der richtigen Antwort erhalten einen Buff, Gold oder ein Item :)\n\n**Passive**:\n- Gleichzeitig kann und sollte sowieso kein Champion alle Fähigkeiten aktivieren (meiner Meinung nach)\n- Sowas kann man im Gegnerischen Team leicht kontrollieren indem man nur bedingt Pingt oder einfach den Chat benutzt statt zu Pingen auch wenn es als weniger Effektiv scheint (Zudem könnten Trolle einfach durchgehend Pingen)\n- Sind damit nun die Fähigkeiten gemeint oder die Ausgeführten Pings vom Spieler?\n\n**Q**:\n- Hier wäre die frage ob es eine Castzeit gibt und diese auch Unterbrochen werden kann?\n- Die Größe der Pings würde mich interessieren und ob diese auch Sichtbar sind wenn man nicht einen Ward in der nähe hat bzw. auch in Gebüschen etc. (Etwa wie bei Aurelion Sol)\n- Das Ausrufezeichen, Hilfeping & Unterwegsping hören sich recht legitim an ^^\n- Beim Fragezeichen halte ich es für Sinnvoller dass z.B. die Gegner in einem bestimmten Gebiet gepingt werden (Praktisch für eine kurze Zeit sichtbar :d)\n\n**W**:\n- Ich halte alle effekte ein wenig \"Overpowered\" wenn man bedenkt dass man dies mit der Ult. auslösen kann\n\n**E**:\n- Ich würde beim Ausrufezeichen ein kurzer Schild der einen Gegnerischen Angriff blockiert besser finden :D (Auto-Attack, Spell oder Fähigkeit. Zusätzlich könnten z.B. gecastete Effekte sofort blockiert werden)\n- Habe es ja schon inner Q erwähnt daher evtl. beim Fragezeichen eine kleine Verringerung der Abklingzeit für ein Ward \n- Hilfe & Unterwegs Ping finde ich in Ordnung\n\n**R**:\n- Abklingzeit vielleicht eher 150 - 180 Sekunden, Ansonsten würde ich sagen es Ist okay doch bei der W habe ich ja bereits meine Sicht dazu geäußert :D\n\n\nAn sich halte ich es aber auch für ein kleines Problem wie man die jeweiligen Effekte auslösen soll?\nWie bei Twisted Fate dass man dann eine Auswahlmöglichkeit durch das erneute drücken der Taste hat oder durch das Pingen und jeweils danach evtl. nochmal das Auswählen des Bereiches wo dieser Effekt auftauchen soll? \n\n**Fazit**:\nIch finde man kann aus der Idee an sich aufjedenfall etwas machen, doch für einen Champion halte ich das ganze für nicht geeignet \n{{sticker:vlad-salute}}","replies":[]}]}