{"poster":"Thewoker1","date":"2016-09-15T19:26:56.212+0000","title":"El mejor programa para hacer llamadas para lol (sin lag)","subforum":"Charlas Generales","up_votes":6,"down_votes":2,"body":"El mejor programa para jugar lol en llamadas (sin lag)\nPara todos los que jueguen League of legends con un ordenador clase media baja o baja les presento Razer comms http://www.razerzone.com/comms/thankyou. \nUn programa gratuito con variados idiomas, con una muy baja petici&oacute;n a la pc (Seria que no pide exagerados recursos ni se laguea nunca a menos que tengas un muy....muy mal Internet ).\nUn ejemplo claro de los programas menos conveniente para gamers seria skype que no busca optimizar los juegos pero Razer comms lo que busca es optimizar y ampliar tu capacidad y experiencia de juego con otro producto gratuitos de su misma marca.\nEj: el que yo ocupo Razer Cortex y Razer comms, aviso esto es solo publicidad para este programa tan poco conocido pero mas bueno que cualquier programa de llamadas...ojo para gamers un ejemplo seria Team Spreak un programa decentemente conocido que se relaciona con la creacion de servidores para la mantencion de sus integrantes en la llamada que siempre siempre tendra que tener un lider en la llamada ( administrador ).\nLo que causa que el administrador cargue con la llamada seria si el admin tiene lag tendras lag en tu llamada si al admin decide disolver todo el server te jodes ya no tienes server. y lo que hace Razer comms es que no existen admins ya que razer comms tiene sus propios servers privados y no servers que un admin del grupo sostiene con su internet y recursos de pc. lo que hace mucho mas facil jugar sin lag pero tanbien ya que comparamos con Team Speak lo comparo con Skype. El mismo sistema existe un admin en la llamada que sostiene un server publico, en Skype si alguien del grupo seria ya no solo el admin tiene lag la llamada se lagueara dependiendo de la cantidad de lag que tenga el lagueado.\nY eso es todo espero que si alguien buscaba un buen programa gamer lo en encuentre en este comentario de foro y le sea de ayuda y recordando es solo para hace spam de este increible programa que se merece mas publicidad.\nUn saludo de Thewoker1\ny en Razer comms como: Thewoker\n{{sticker:slayer-jinx-catface}} {{sticker:slayer-jinx-wink}} {{sticker:slayer-jinx-catface}}\n\n\nTambien para los que ya lo estan probando tenemos ya echo un server llamado League of legend (las) Argentina","replies":[{"poster":"Zabivaka","date":"2016-09-15T21:52:15.864+0000","up_votes":8,"down_votes":0,"body":"Aguante skype","replies":[{"poster":"Loli de Grafo","date":"2016-09-16T02:23:11.274+0000","up_votes":1,"down_votes":0,"body":"Va bastante bien. Y eso que juego de un notebook i3.","replies":[]}]},{"poster":"PentakiII","date":"2016-09-16T00:56:59.349+0000","up_votes":2,"down_votes":0,"body":"\"Team spreak\"","replies":[]},{"poster":"Asefito","date":"2016-09-15T19:59:48.081+0000","up_votes":3,"down_votes":1,"body":"Mejor Discord :v","replies":[]},{"poster":"G0RDO OTAKU","date":"2016-09-15T23:40:02.996+0000","up_votes":3,"down_votes":2,"body":"Skype ? Raid call ? curse ? Comms ? que es eso ? aguante ts3 papa !","replies":[]},{"poster":"Conejito Feliz","date":"2016-09-15T21:03:48.167+0000","up_votes":3,"down_votes":2,"body":"Ts3 es el mejor no te consume nada de nada.","replies":[]},{"poster":"Vaendrys","date":"2016-09-15T19:54:00.935+0000","up_votes":3,"down_votes":2,"body":"Yo uso ts3 y no me da nada de lag (?","replies":[]},{"poster":"HornedBull ","date":"2016-09-15T22:40:45.781+0000","up_votes":2,"down_votes":1,"body":"me gusta mas curse voice","replies":[]}]}