{"poster":"FNC Sam","date":"2015-10-26T04:30:30.192+0000","title":"Massiver Spam + drohungen","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":4,"body":"Liebe Community, \nklar gibt es momente in denen man einfach vor Wut platzen k&ouml;nnte, wenn man ne loosing streak hat oder die Promo nicht schafft etc.\nAber ist es den wirklich der ernst einiger Mitspieler/innen hier allen ernstes wegen eines Spiels leuten drohen sie zu t&ouml;ten?\nBin wirklich drauf und dran einfach zu deinstallieren weil so macht das spielen absolut keinen Spa&szlig; mehr.\nDas ist nur ein kleiner ausschnitt aus dem aftergamechat.\ningame wurde perma gepingt und s&auml;mtliche beleidigungen vom stapel gelassen.\n\nSpieler 1: I now is not a life\nSpieler 1: 1/8 KOG\nSpieler 1: TROLLER\n-&gt;Spieler 2: troller i kill you if i  see you&lt;-\nSpieler 2: omg dat troller\nSpieler 2: tryn da you come duo Q\nSpieler 2: let this noob\nSpieler 2: i stop for today\n\nK&ouml;nnte hier zu dem Thema mal ein &quot;Roter&quot; kommen?\nW&auml;re super wenn ich eine R&uuml;ckmeldung bekommen k&ouml;nnte denn wenn sowas keine Soforte Bestrafung verdient dann weis ich auch nicht.\n\nDanke f&uuml;rs lesen \nmfg","replies":[{"poster":"Spicavius","date":"2015-10-26T04:57:42.249+0000","up_votes":4,"down_votes":1,"body":"Reporten und diverse Leute frühzeitig muten.\nWenn er so weiter macht oder bereits öfters so was gebracht hat, dann wird er schon seine Strafe kriegen\n\nAußerdem solltest du versuchen solche Sachen zu ignorieren.\nMan kann so was ignorieren und trotzdem Reporten.\n\nLass dich nicht ärgern ;)","replies":[{"poster":"FNC Sam","date":"2015-10-26T05:27:53.319+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Spicavius,realm=EUW,application-id=KYnfKGf0,discussion-id=ujfPzmW4,comment-id=0001,timestamp=2015-10-26T04:57:42.249+0000)\n>\n> Reporten und diverse Leute frühzeitig muten.\n> Wenn er so weiter macht oder bereits öfters so was gebracht hat, dann wird er schon seine Strafe kriegen\n> \n> Außerdem solltest du versuchen solche Sachen zu ignorieren.\n> Man kann so was ignorieren und trotzdem Reporten.\n> \n> Lass dich nicht ärgern ;)\n\nÄrgern lasse ich mich nie (: die Dinge waren auch nicht an mich gerichtet. Ich finde nur das hier eindeutig über das Ziel hinaus Geschossen wurde und bei Sätzen wie \"If i See you i will kill you\" o.ä. sollte direkt der der Perma erfolgen ohne wenn und aber. Gemutet war er nach der 2. Minute schon nur ging es halt im Aftergame Chat weiter. Ignorieren ist doch in solchen Fällen komplett falsch. Ein noob oder was weis ich für ne Aussage hätte ich glatt überlesen aber \"morddrohungen\" muss sich doch hier niemand geben müssen. Zumal nicht mal klar ist ob und inwiefern das Punishmentsystem greift. Es ist einfach schade zu wissen das solche Leute noch die Chance bekommen in weiteren Games die selben unmöglichen Dinge abziehen und dann erst bestraft werden. Drohungen etc sind für mich jedenfalls eine insta Bestrafung wenn nicht den direkten Bann Wert!\n\nMfg","replies":[]}]},{"poster":"SiskoD","date":"2015-10-26T07:07:42.033+0000","up_votes":2,"down_votes":1,"body":"Bei sowas würde ich Strafanzeige stellen. Bei Todesdrohung ist es berechtigt und dem wird auch nachgegangen","replies":[{"poster":"Spicavius","date":"2015-10-26T08:31:03.813+0000","up_votes":2,"down_votes":3,"body":"Mal ehrlich. Da sitzt ein 14 Jähriger Junge und schreibt. \"I will kill u if i see u\".\nKlar kann man die Eltern zur Rechenschaft ziehen, aber dennoch ist es einfach unverhältnismäßig.\n\nAlso wirklich. Ich kann es einfach nicht ernst nehmen^^. Ich verstehe das Anliegen und die Empörung über so ein Verhalten, aber sowas kann doch nur von einem Kind kommen. (Sry an alle geistig reifen Kids :P)\nIch muss auch leider zu geben, dass ich einen 21 Jährigen kennen, den ich persönlich über Skype über nen Freund kennengelernt habe und der hat mir im Aftergamechat gewünscht, dass ich in der Hölle brenne und verrecke, nachdem ich in einem Teamfight nicht gerettet habe :D.\n\nNaja. Diese Person hatte nicht mal den Charakter mal dazu Stellung zu nehmen, als ich ihn in Skype mal angesprochen habe, was das denn sein sollte.^^ Meinerseits wird er immer aus den Spielen gekickt in die er eingeladen wird. In dem Fall hätte ich sogar richtig gut Geld scheffeln können, wenn ich die Polizei eingeschaltet hätte.\nAber ich wollte einem minderbemittelten Menschen nicht noch mehr Probleme in seinem Leben bereiten.\nDen Report hat er sich trotzdem verdient. (Oh was für ein Wunder er konnte auf einmal 2 Wochen lang nicht spielen :DDD Danke Riot btw :D)\n\nNaja sowas sollte man einfach an sich abprallen lassen ;)","replies":[{"poster":"Rirol","date":"2015-10-26T10:15:36.576+0000","up_votes":3,"down_votes":1,"body":"Gerade bei Jugendlichen wäre es angebracht, das zur Anzeige zu bringen.\nDer sitzt da und rattert seine Beschimpfungen und Drohungen runter, das tut der in den meisten Fällen Monate lang ohne Konsequenzen.\nIst ein ähnliches Problem wie im echten Leben.\nWenn ein Brief bei den Eltern ankommt und die mit dem Sohnemann (unterstelle ich jetzt einfach mal) auf der Wache erscheinen müssen, hat das einen besseren Lerneffekt als wenn nach 2 - 3 Monaten endlich mal ein Bann kommt.\nDas Ignorieren dieser minderbemittelten Kids bestätigt sie doch meist in der Annahme das solches Verhalten \"normal\" ist.\nManchmal wünschte ich mir es wäre noch wie in meiner Kindheit und man könnte dem Bubi einfach eine Watschen und wenn Bubi sich bei Papa beschwert bekommt er noch eine von Papa.\nHeute musste du das aber über dich ergehen lassen...wenn du was machst sitzt du schon halb vor Gericht.\nDurfte ich mal bei einem Arbeitskollegen erleben. Der ist in der Bahn bespuckt worden von zwei Jugendlichen und hat anschließend einen der beiden Festgehalten um ihn der Polizei zu präsentieren.\nDie hat alles aufgenommen und die Anzeige wurde wegen Geringfügigkeit fallen gelassen. \nAber weil der Junge blaue Flecken vom Festhalten hatte, hat mein Kollege eine Strafe wegen Tätlichkeit (glaube so hieß es) gegenüber einem Jugendlichen bekommen.\nKostete ihn 250,- € an die Staatskasse und glaube 100,-€ Schmerzensgeld.\nUnd solche Verhältnisse kommen dank der Ignoranten und grünen Gutmenschen.","replies":[{"poster":"Spicavius","date":"2015-10-26T14:05:58.328+0000","up_votes":1,"down_votes":1,"body":"Eine Sache ist es bespuckt zu werden, denn in dem Fall wurde man phsyisch verletzt und man kann nunmal nichts dagegen machen und muss eben phyisch \"aktiv\" werden oder die Polizei rufen.\n\nIn meinem Beispiel ist es eher meiner Meinung nach was anderes.\nDenn man kann einfach muten/ aus der Gruppe ausschließen und gut ist. Von mir aus sollen diverse Personen mit anderen Gleichgesinnten zocken, solange die mir nicht in die Quere kommen.\n\nWie gesagt das sehe ich anders. Du kannst gerne eine Anzeige bei der Polizei machen um einem Freund eines Freundes eins richtig rein zu würgen. Ich mache das nicht. Da ist es in meinen Augen effektiver jemanden einfach nicht mehr spielen zu lassen.\n\nDenn wie gesagt. Diese Person hat eben nicht den Charakter um eine Stellung zu nehmen und benimmt sich im RL total in Ordnung.\nIm Internet wird er aufgrund der Anonymität zum Deppen. (aber das kennt ja jeder... da erzähle ich ja nichts neues)\n\nDas mit deiner Kollegin finde ich ja mal richtig frech. Das ist einfach nur lächerlich. Vermutlich ist der Richter/die Polizei schon abgestumpft und empfindet solches Verhalten als nicht mehr so schlimm. (Ich bin vermutlich auch schon abgestumpft und ignoriere so etwas..)","replies":[]},{"poster":"FNC Sam","date":"2015-10-26T13:47:16.344+0000","up_votes":1,"down_votes":1,"body":"Vollkommen deiner Meinung! Wenn jeder einfach nur denkt \"ach ist doch nur ein Kind, lass ihn mal machen\" weis der doch später niemals wo seine Grenzen sind. Und nebenbei gesagt ist solch ein Verhalten eine Charaktereigenschaft! Eine ziemlich egoistische, anderen Leuten mit irgendwas zu drohen weil sie ein SPIEL verloren haben. Und die bekommst du mit ner Chatsperre o.ä. auch nicht auf den \"Pfad der Besserung\". Es ging hier wie gesagt nicht um mich, aber fühlte mich dennoch mit angesprochen. Deshalb wollte ich das Thema einfach mal für alle die ähnlich denken in den Raum werfen um vllt etwas Besserung schaffen zu können.","replies":[]}]}]}]},{"poster":"Kaitri","date":"2015-10-26T05:06:44.274+0000","up_votes":3,"down_votes":2,"body":"es tut unglaublich weh wenn ich sowas sehen muss... ich verliere dabei wirklich den glauben an die menschheit... wenn ich \"troller\" sehe :D","replies":[]},{"poster":"Der Großmugister","date":"2015-10-26T07:14:45.278+0000","up_votes":2,"down_votes":1,"body":"So wie ich es verstanden habe, können Flames mit besonderer Härte (wie Todesdrohungen) zum sofortigen Bann führen.\nWeiterhin habe ich das Gefühl, dass das System mittlerweile sehr gründlich geworden ist, solltest du diesen Spieler also reportet haben, wird er höchst wahrscheinlich entweder \"gebessert\" oder entfernt.","replies":[]},{"poster":"Sniff on Pantsu","date":"2015-10-26T04:57:12.372+0000","up_votes":2,"down_votes":1,"body":"Im Internet ist alles möglich, wär aber schön wenn Riot was gegen den Typen machen würde.","replies":[]},{"poster":"Freiherr Alex","date":"2015-10-26T11:07:36.297+0000","up_votes":2,"down_votes":4,"body":"Ohne Witz, Wenn euch sowas so sehr und bis ins Mark erschüttert solltet Ihr am bessten eure PC´s verkaufen und ganz langsam versuchen euch aus eurer Wattewelt zu befreien...\n\nDass da ein Anwalt auch nur nen Finger rühren würde wegen so nem Schmarn ist absolutes dünnes Gelaber von leuten die sich wieder Wichtig tun wollen...\n\nEinfach Reporten sowas, wenn er die Strafe bekommt ist gut und wenn nicht, ist die Chance doch recht Gering noch ein einziges mal auf den zu treffen...","replies":[{"poster":"FNC Sam","date":"2015-10-26T13:58:24.546+0000","up_votes":2,"down_votes":1,"body":"Schon ziemlich kurz gedacht von dir. Es geht hier um Nachhaltigkeit. Und Zweckmäßig soll der Threat IHN und alle anderen Hardcoreflamer davon abhalten weitere Leute zu belästigen bzw. zu bedrohen. Und das hat auch nichts mit Wattewelt o.ä. zu tun, so eine Aktion ist unterste Schublade und hat hier nichts verloren.","replies":[]},{"poster":"Rirol","date":"2015-10-26T12:41:01.069+0000","up_votes":2,"down_votes":1,"body":"Gemäß §241 StGB macht sich strafbar, wer einem Menschen mit der Begehung eines Verbrechens, vorliegend Mord oder Totschlag, oder aber gegen eine ihm nahestehenden Person gerichtetes Verbrechen bedroht. Der Strafrahmen beträgt hierbei Geldstrafe oder aber Freiheitsstrafe bis zu einem Jahr.\n\nUnd jeder Anwalt würde dem nachgehen, wenn der Urheber der Drohung ermittelbar ist.\nDabei geht es nicht um die Empfindlichkeit des Bedrohten.","replies":[]}]},{"poster":"Nephirelle","date":"2015-10-26T07:34:21.770+0000","up_votes":2,"down_votes":2,"body":"\"Troller\" ... Muss definitiv ein Deutscher sein :D\nBei Morddrohungen dürfte eigentlich mit sehr geringer Verzögerung ein Permaban kommen. Ich hoffe, du hast ihn reportet (auch der After-Game-Chat wird überprüft).","replies":[{"poster":"FNC Sam","date":"2015-10-26T13:34:18.011+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Nephirelle,realm=EUW,application-id=KYnfKGf0,discussion-id=ujfPzmW4,comment-id=0005,timestamp=2015-10-26T07:34:21.770+0000)\n>\n> \"Troller\" ... Muss definitiv ein Deutscher sein :D\n> Bei Morddrohungen dürfte eigentlich mit sehr geringer Verzögerung ein Permaban kommen. Ich hoffe, du hast ihn reportet (auch der After-Game-Chat wird überprüft).\n\nNatürlich habe ich das (:","replies":[]}]}]}