{"poster":"No6Claymore  HxH","date":"2019-08-10T17:42:48.204+0000","title":"Miért nem bír a riot egy normális matchmakinget csinálni?","subforum":"Általános beszélgetés","up_votes":4,"down_votes":1,"body":"Hát kivan már a faszom, hogy az enemy mindig plat vagy dia, de minimum az enemy laner az, ha meg mégsem akkor az enemy jg, akinek hála 1v2-zök lanen.\r\nDe mi ez a matchmaking.  Miért nem kapok normális ellenfelet. Nekem az nem win, hogy a csapat megnyeri, én meg nem csináltam semmit, mert olyan szinten szétszednek már lanen, hogy semmit sem fogok érni. És még az enemy rá is húz erre,  platos  gecije játsza a nagymenőt egy unranked ellen. Az ilyeneknek kívánom, hogy ez legyen az utolsó örömük az egész életükbe. De kérdezem, ha én egy bronzos geci szintjén játszok, akkor az enemy miért nem bronzos geci, mint én? Ez annyira vicces, hogy hozzám vágják, hogy szar vagyok, de azt már nem bírják megindokolni, hogy akkor az enemy miért 20 eloval magasabb. És ezeken a gameken szar statokat megyek szóval az mmr-m se lehet túl nagy. Miért nem képes ez a szar játék normal gamen a soloq mmr-t nézni. Miért kell egy teljesen külön mmr normálra. Ez annyira logikátlan. És szarok bele, hogy normal game.  Jogom van fair meccseket játszani, és mikor az enemy 20 eloval nagyobb az nem tartozik oda. Ha én szar vagyok, akkor KÖVETELEM HOGY AZ ENEMY IS LEGYEN UGYANOLYAN SZAR, MINT ÉN. És nem  nem akarok jobb lenni, azt hiába írja bárki is. Én élvezni akarom a gameket. Nem érdekel, ha bronzos vagyok, az se ha ironos én nem azért játszok, hogy fejlődjek, hanem hogy kikapcsolódják.","replies":[{"poster":"kiskeni","date":"2019-08-15T10:12:25.828+0000","up_votes":1,"down_votes":0,"body":"Épp a minap értettem meg, hogy miért szívtam rengeteg meccsen régen a lv30-hoz vezető úton. Hát azért, mert most is szopok ott p3-p4 létemre is kis szinteken, mert baromi unbalanced a normal matchmaking és ez hatványozottan igaz kisebb szinteken. Egyszerűen mióta újra elkezdtem húzni a kis fiókomat, azóta szó szerint negatív winrátát produkáltam, pedig beszereztem rá egy jópofa akalit is, amivel nagyon kevesen tudnak mit kezdeni mikor én játszom.\n\nNem értem miért kell ilyennek lennie amúgy...","replies":[{"poster":"Gresident","date":"2019-08-15T14:34:24.671+0000","up_votes":2,"down_votes":0,"body":"Ezért fos az egész ranked rendszer, és ezzel nem a te tudásod bírálom.","replies":[{"poster":"kiskeni","date":"2019-08-17T11:53:28.341+0000","up_votes":1,"down_votes":0,"body":"A ranked és a normal azért eltér, hisz eleve külön MMR-t használ a két várólista. A normal matchmaking egész egyszerűen azért pontatlan, mert sokan nem veszik komolyan a normal meccseket, de a tudásuk amúgy megvan és jól játszanak. Ezt a formájukat néha elő is veszik, illetve akkor még nem számoltam hozzá az új fiókot kezdőket, akik a fun-ért -vagy mert valamelyik ismerősük újrakezdte- új fiókot kezdenek. Én is pl. azért kezdtem újat, mert egyik ismerősöm elkezdte a játékot és nem akartam így is tovább rondítani a normálok matchmaking-jét a nagy fiókkal.","replies":[{"poster":"Gresident","date":"2019-08-17T18:55:19.445+0000","up_votes":2,"down_votes":0,"body":"Nem tudom hányszor játszottál, Mesteri vagy afeletti játékos ellen, soha semmilyen játékmódban és esetben nem láttam olyat, hogy leszarják a meccset, egyszerűen látszódott a tudásbeli különbség, minden ilyen meccsen, de diában és alatta baromira nem így van.\n\nEz csak egy közhely, hogy nem veszik komolyan, mint pl te is, ha nem vetted volna komolyan fel sem veted.... Hulladék a rendszer (Nincs mérlegelés sem egyén a meccsnél), a leggusztustalanabb dolog, hogy az unranked lv30 nem kap egyből Iron4 rangot, hanem bedobja goldosok közé besorolásra.","replies":[{"poster":"kiskeni","date":"2019-08-17T22:48:19.720+0000","up_votes":1,"down_votes":0,"body":"Hát, nem tudom. Én a main fiókomon (!!!!!) tervezek valamelyik várólistára Iron-ban zárni (nem SoloQ-n természetesen), szóval nem tudom miért hihetetlen, hogy nem veszik komolyan a játékot :D\n\nA normal igazából matchmaking terén olyan, mint a 3v3 map (Twisted Treeline/Kanyargó rengeteg) teljes egészében.  L.E.S.Z.A.R.J.Á.K.  A Ranked a lényeges matchmaking balansz szempontból és sokat is változtattak, de még mindig nem tudtak arra a nyomorult alapszintre eljutni, amin minden játék van, ismétlem MINDEN JÁTÉK, azaz hogy mindenki a ranglista legaljáról indul... Ilyen sületlenségről még nem igazán hallottam, mint ami itt megy a kezdetek óta, hogy az unranked, eddig be nem sorolt játékos silver-esnek számít... Én szerintem meg hadd döntse el a játékos és az idő, hogy milyen rangba való valaki (ott ragad-e legalul, vagy feljebb jut tényleg silver-ig).","replies":[]}]}]}]}]},{"poster":"Martyn19984","date":"2019-08-10T21:46:33.375+0000","up_votes":2,"down_votes":3,"body":"Gold 4-ként drafton és blindon szétalázok bármilyen platost. Ergó jobb vagyok náluk. Csakhogy ez egy \"csapatjáték\"... Rankedet idegileg nem bírom mindig. Egyfolytában 3v5,és lose, de normálon is. A fun pedig az agyhalottaknak a 0/11/2 akit nem érdekel a team és egyfolytában berohangál meghalni, valamint flamel mint állat.","replies":[{"poster":"No6Claymore  HxH","date":"2019-08-13T18:54:32.816+0000","up_votes":2,"down_votes":0,"body":"Flamelni én is szoktam, de inkább az enemyt, mint a csapatomat. Diásként senki ne verje már a nyálát, hogy megver egy unrankedet az otp champjével.  Általában az ilyen lelkiszegények azok, akikkel a papbácsi közelebbi viszonyt ápolt.","replies":[]}]}]}