{"poster":"ShadowKnight1224","date":"2014-09-14T04:59:55.488+0000","title":"[Lissandra][Slight Rework Proposal] New Passive as a Shift Towards Tanky Initiator","subforum":"Gameplay","up_votes":2,"down_votes":2,"body":"Lissandra is quite possibly my favourite champion in the League, but I don't play her too much because she's currently in a bad place. I would only take her toplane, and even then I would be hesitant of my team's ability to win the game. See, the problem with Lissandra is that she's intended to be an initiator utility-mage (this is a good idea), but she hasn't been given the other half of the tools she needs to do her job properly. She has the ability to initiate (her E), and a truckload of utility in her kit, but she doesn't have the ability to survive the act of initiating. Ulting herself is a suboptimal choice when she could be ulting a carry, and she can't rely on items like Zhonya's to be halfway decent at her job.\n\nSo what I suggest is a rework of her passive. With the prevalence of mana regen runes/masteries and the existence of items like Chalice, Tear and Catalyst, mana is not really a concern for Lissandra. She's too short-ranged to be a hyper-spammy mage like Ziggs, since her Q pushes the wave and she soons finds herself overextended very easily.\n\nInstead, I propose to give her a new passive that allows her to survive being in the thick of a teamfight, and pushes her identity towards a tanky mage, rather than a squishy damage-dealer (which, given her AP ratios, is not a terribly viable build for her).\n\n*-*\n\n#New Passive: Will of the Iceborn\n\n*Effect:* When two or more enemy champions are within 1000 units of Lissandra and visible to her, she gains an additional **[4+(Levelx2)]%** of her bonus armour and magic resistance. When four or more champions are within 1000 units of Lissandra and visible to her, she gains a shield that absorbs **[100+(Levelx20)]** points of damage. The shield lasts for as long as four or more champions remain visible to Lissandra and within 1000 units of her, and for 5 seconds afterwards. Once the shield is depleted (due to absorbing maximum amount of damage or because it ran out of time), it goes on a 120/90/60 (at levels 1/7/13) second cooldown.\n\n*This passive allows Lissandra to mitigate a lot of damage, particularly late game, and rewards her for being in the thick of things during teamfights. The first part of the passive also rewards her for building resists, which discourages building pure AP on her and taking advantage of her shield to nuke carries. Ideally, Lissandra will be building a small amount of AP by lategame (around 200 or so) but her resists and HP will be quite high, and she will be able to wade into 5 people and unleash CC without being instantly deleted by the first rotation of cooldowns.*\n\n*-*\n\nSome suggestions for her base stats:\n\n* *HP:* Change from **365 (+84)** to **416 (+88)**.\n* *Attack Damage:* Change from **48 (+2.7)** to **47 (+2.5)**.\n* *Armour:* Change from **14 (+3.7)** to **19 (+3.8)**.\n* *MP5:* Change from **5 (+0.4)** to **7 (+0.55)**.\n\n*This helps shift her more towards the role of tanky initiator and compensates for her loss of mana sustain, but slightly reduces her autoattack damage so that she can't abuse her range and newfound tankiness to win trades or bully melee opponents.*\n\n*-*\n\nComments and criticism welcome!","replies":[{"poster":"Lord Tyrannus","date":"2014-09-15T04:04:11.112+0000","up_votes":2,"down_votes":0,"body":"I agree Lissandra passive right its okay but she lacks defensive capabilities. good job man i am with you 100% of the way.","replies":[{"poster":"ShadowKnight1224","date":"2014-09-15T04:29:01.836+0000","up_votes":1,"down_votes":0,"body":"Thank you! I'm glad you agree! Hopefully if enough people show an agreement, Riot will see that this is the direction Lissandra players want her to go.","replies":[]}]},{"poster":"Kaosune","date":"2014-09-14T21:09:20.040+0000","up_votes":2,"down_votes":0,"body":"support :D","replies":[{"poster":"ShadowKnight1224","date":"2014-09-14T22:30:03.671+0000","up_votes":1,"down_votes":0,"body":"Thank you! :D","replies":[]}]},{"poster":"Adalore","date":"2014-09-14T05:53:46.247+0000","up_votes":2,"down_votes":0,"body":"I would like her to be more brusier weight with initiation, but the thing that kills itemizing that in live is the mana issues she has. She is practically FORCED to build chalice AND another sustain item in my experience of playing her. Maybe you know... buff the mana sustain, and maybe the passive can be more of \"Mana per 5 for Defense stats\" so you can build pure tanky and have mana to abuse your kit in combat.","replies":[{"poster":"ShadowKnight1224","date":"2014-09-14T06:28:10.499+0000","up_votes":1,"down_votes":0,"body":"That's a good point! I actually figured that she doesn't need mana as a part of her kit, so instead I proposed to tweak her current MP5 based on values such as Karma's and Fiddle's.","replies":[]}]},{"poster":"Flying Buntcake","date":"2014-09-14T05:03:21.456+0000","up_votes":2,"down_votes":0,"body":"Anythings that changes her now early game specific passive into something she can use all game is nice","replies":[{"poster":"ShadowKnight1224","date":"2014-09-14T05:14:33.610+0000","up_votes":1,"down_votes":0,"body":"Yeah, her passive feels like Riot wants her to be a hyper-spamming harasser like Ziggs, but she doesn't have the right kit to do so. Her short range and innate wave-pushing makes her vulnerable to overextension and ganks, and her passive rewards a dangerous playstyle that ends up being high-risk/low-reward. Any advantage you gain by shoving your opponent out of lane is negated when the enemy jungler shows up and kills your overextended rear. And her Q isn't even that easy to aim, given the prevalence of today's hypermobile champions with infinite dashes, or long-ranged wave-clearers who don't need to be anywhere near you or their minions in order to harass you and/or farm.\n\nAlso as you point out, it's only relevant early game anyway.","replies":[]}]},{"poster":"PokladnicaZla","date":"2014-09-14T07:41:34.408+0000","up_votes":1,"down_votes":0,"body":"Meddler had an idea for Ice-shield for her new passive .Morello said he had somekind of idea for a new passive ,but didnt state what he had in mind.\n\nNOTE:Pls dont ask me for link,those conversation are over 3-8 months old.Cant belive they still didnt do anything about it.","replies":[{"poster":"ShadowKnight1224","date":"2014-09-14T14:39:02.432+0000","up_votes":1,"down_votes":0,"body":"Yeah, I knew that they were working on her passive, which is why I made this thread. I was hoping we could get a discussion going and try to get a consensus on where we want Lissandra to shift towards.\n\nThanks for the comment, though! Hopefully Liss will be brought back to relevance soon.","replies":[]}]},{"poster":"magikmarvelfan","date":"2014-09-14T13:34:33.742+0000","up_votes":1,"down_votes":0,"body":"i dont see why people say she needs help, she is an mage knowed for her cc and area damage, i dont see anyone play her as a bruiser","replies":[{"poster":"ShadowKnight1224","date":"2014-09-14T14:37:08.861+0000","up_votes":1,"down_votes":0,"body":"Her AP ratios are not on par with other area mages like Orianna, Syndra, Ziggs, Xerath and the like. Her waveclear is pretty decent once you have some AP going, but she does not have the potential to tear into a team the way the others do. She definitely brings strong area CC to the table, but she's not an AoE nuker.\n\nFurthermore, differentiating Lissandra as a tanky AoE CC initiator mage gives her a unique identity. Pushing her towards AoE damage dillutes the identity of both her and other AOE mages.","replies":[]}]}]}