{"poster":"AndriyShevchenko","date":"2015-10-10T07:26:42.733+0000","title":"Platino Me dio un cachetazo.","subforum":"Charlas Generales","up_votes":18,"down_votes":5,"body":"Yo era el tipico que se creia pro en gold, creyendome el dios de todo y que solo no era diamond por los mancos, pero al subir a platino me di cuenta, que son mejores que yo. y si NO SUBO DE LIGA POR QUE MI NIVEL NO ES SUFICIENTE.. LO ADMITOOOO","replies":[{"poster":"Jvkaos","date":"2015-10-10T12:39:41.620+0000","up_votes":12,"down_votes":0,"body":"Realmente son malos en todos las ligas, hay gente mala en bronce como en diamante. Tengo una cuenta platino que gracias a mucha gente quedó en 5 (estando en platino 1 promo a diamante), y cuando digo gracias a gente, me refiero a los que se desconectan porque le diste un hit menos en el leash, porque le pediste que upgradeara el Trinket, o porque necesitas un gank. Mi cuenta principal es Diamante y es la misma porquería, realmente creo que este juego es 97% suerte (de lo que te toque en el equipo) y 3% de habilidad. El que diga lo contrario es un mentiroso o tuvo la suerte para subir sin problemas, porque o te tocan a ti los DC, trolls, Afk, rager, flamers o le tocan a tu equipo, son muy pocas las partidas equilibradas. Sí, es importante mejorar las \"habilidades básicas\" pero llegas a un punto en donde no sirve de nada por la gente que te sale.","replies":[{"poster":"Nira","date":"2015-10-10T16:31:16.612+0000","up_votes":4,"down_votes":0,"body":"En eso te apoyo . En mi opinion personal las rankeds no se ganan por \"habilidad\" , se ganan por quien tiene menos trolls o menos jugadores con baja habilidad . Por ejemplo el mid enemigo mata a nuestro mid 4 veces ,el jungla no lo quiere gankear y el mid enemigo  ayuda a dar kils al resto de lineas . Así es como se pierden las rankes y lo peor es que uno le dice \"Men , juega defensivo y deja de fedear\" y te responden  \"Yo hago lo que quiero , soy gold \" o sea , soy plata 1 y el oro 4  y juega con esa mentalidad ? , no se como llego allí  -.-","replies":[]},{"poster":"LuckySlayer","date":"2015-10-10T22:04:57.152+0000","up_votes":1,"down_votes":0,"body":"No seré mentiroso, pero la suerte es 50-50 si te pones a pensar. Te emparejaron con un afk porque el mmr es el mismo en algún modo; ese afk pudo haber estado en el otro equipo, pero por x motivo lo pusieron en el tuyo, qué sabes si el otro equipo tiene algo raro en él sino hasta que digan \"report x por tóxico/afk/rata\". \nEs suerte tener o no tener? En parte, sí. \nCómo dejar de depender de la suerte? Si ves que hay demasiada desventaja, rendirte te puede salvar algo tu desempeño, porque **el juego evalúa tu desempeño** para establecer tus ligas, y por ende, tus PL ganados y perdidos. Si decides intentar hacer una vuelta de mesa, y te sale mal, tu desempeño cae muchísimo, lo he visto en cuentas de conocidos míos.\nCiertamente hay gente mala, pero a medida que subes de división lo malo va yendo de habilidad a madurez mental. \nUn platino que se vaya afk porque le gankearon y no llegaste a salvarlo, (siempre y cuando no sea eloboosteado), es un jugador decente, bastante conocedor de algo del juego, (aunque no todo por su actitud), pero con poca madurez mental para asumir que no todo se puede siempre.\nA lo que quiero concluir, hay que saber analizar lo que tenemos enfrente, y jugar pensando en nuestro desempeño, tal que luego nos emparejen de mejor modo. Saludos {{champion:412}}","replies":[]}]},{"poster":"Calihea","date":"2015-10-10T08:29:04.026+0000","up_votes":4,"down_votes":0,"body":"Esperá a subir a diamante. \"Yo estoy en la misma división que esta gente? soy pésimo\", lo primero que pensé.","replies":[{"poster":"Jade Fang","date":"2015-10-10T10:44:38.865+0000","up_votes":1,"down_votes":0,"body":"jajajaja y ahora eres?","replies":[{"poster":"Calihea","date":"2015-10-11T15:59:11.197+0000","up_votes":1,"down_votes":0,"body":"Diamante 5, por eso te decía. Es bueno lograr esa mentalidad de \"a ver, en qué fallé?\". GJ BOY.","replies":[]}]}]},{"poster":"Daw","date":"2015-10-10T13:19:29.419+0000","up_votes":3,"down_votes":0,"body":"No quiero ser un maldito, pero de Diamante 1/2 para abajo nadie es bueno.","replies":[{"poster":"Jvkaos","date":"2015-10-10T17:42:06.144+0000","up_votes":3,"down_votes":0,"body":"El otro día me tocó con dos diamantes 2 que eran tan buenos..., uno hacía el golem de top, volvía a base esperaba el tiempo para que salga de nuevo y lo iba a matar, volvía a base,mataba a los golems, iba a la base, mataba a los golems..hasta que nos rompieron el nexo. el otro se desconectó porque smiteó mal y el adc se llevó el sapo. xD pura gente buena.","replies":[]}]},{"poster":"iluvathar","date":"2015-10-10T17:08:25.482+0000","up_votes":4,"down_votes":1,"body":"Yo te doy mi experiencia personal:\nLa season pasada me dejaron en Bronce IV y subi a plata V. Me quede ahi despues de jugar 200 o 300 partidas y sin entender porque no podia salir (Culpando a los afks, trolls, etc)\nEn esta season gane las 10 partidas y me dejaron en Plata V nuevamente. En 6 meses subi a platino V con menos de 300 games.\nUna vez subi a platino me di cuenta de que el problema que tenia cuanto estaba en plata la season pasada era que me creia mejor que el resto y no lo era. La realidad es que si subis, es que sos mejor, y si bajas es que sos peor, pero SOLAMENTE si jugas lo suficiente como para que esto sea asi. \nLa gente que juega 1 ranked cada 10 dias y le toca un troll y dice que no sube por eso, es mentira, no sube porque no juega. \nSi jugas muchas partidas eventualmente te termina tocando con gente que juega como vos o los trolls tocan del otro lado, y en esos casos si tenes la habilidad, subis.\nEl problema esta en que muchos casos la gente se queja de los trolls pero en las partidas que no hay trolls ellos tampoco logran desequilibrar su linea/partida.\nSi logras matar dos veces a tu linea, hacer roaming, sacar una asistencia, sacar dragon y empujar a tu equipo para adelante te aseguro que los trolls y afks en tu equipo se acaban o se reducen a un minimo. A la gente le molesta perder, hace que no esten molestos desde el minuto 1 de partida y vas a ganar la mayoria de las veces. (Dejando de lado los ratas que hay en todos lados unos cuantos, pero estos son inevitables)","replies":[]},{"poster":"StalkerII","date":"2015-10-10T18:40:15.312+0000","up_votes":2,"down_votes":0,"body":"las ranks son una joda, y no hay penalizacion, la gente entra a comer, a cagar, a orinar, a pedar, a irse afk, a trolear, a flamear, disco nunu, malzahar nunu, trolls picks, etc. 0 bans","replies":[]},{"poster":"Nira","date":"2015-10-10T16:28:10.552+0000","up_votes":2,"down_votes":0,"body":"YO PERDI LA PROMO A ORO Y LA VERDAD EN BRONCE 4 ME CREIA EL FAKER :´V   AHORA CUANDO ESTOY LLEGANDO A ORO ME DOY CUENTA QUE ME FALTA NIVEL PARA LLEGAR , APARTE ES MUY POCO EL TIEMPO QUE JUEGO \"CREO\" PARA PODER LLEGAR A CIERTA LIGA , ME FALTA UN POCO MAS DE EXPERIENCIA Y CONOCIMIENTO .\n\nPD: Juego desde el parche de gnar :´v . \n\nPD2: Perdonen las mayus , pero esas palabras salieron del kokoro :´v","replies":[]},{"poster":"Ellora","date":"2015-10-10T14:07:02.473+0000","up_votes":2,"down_votes":0,"body":"Y si, cualquier manco sube de ligas, esa es la deficiencia del sistema. Y ni hablar de los eloboost y los DuoQ que uno carrea al otro","replies":[]},{"poster":"Jade Fang","date":"2015-10-10T10:47:51.960+0000","up_votes":1,"down_votes":0,"body":"Yo... se que mi limite es platino 5. Mas? NO hasta que aprenda a lasthitear excelentemente y me sepa los timers u.u","replies":[{"poster":"21 Gun Salute","date":"2015-10-10T12:32:46.772+0000","up_votes":2,"down_votes":0,"body":"Aprender a last hittear es una de las cosas mas faciles que podes hacer. \n\nPrimero entra a un custom game con algun mago que uses y trata de last hittear sin usar skilles. Cuando llegues a 80 cs a los 10 minutos, ahi pasas a usar habilidades tambien. Cuando llegues a los 92, le pedis a un amigo tuyo que entre en una custom con vos, y practican lasthit y 1v1 al mismo tiempo, jueguen como si hubiese un jungla. \n\nDa paja, pero haciendo esto y gastando 1 o 2 horas podes mejorar tu nivel exponencialmente, y tarda como 2 o 3 partidas de LoL en las podes llegar a perder sin aprender nada.","replies":[{"poster":"Eternal Rain","date":"2015-10-11T19:54:20.119+0000","up_votes":1,"down_votes":1,"body":"no creas, cada vez que juegues en ranked si eres solo lane o adc en el min 30 minimo 200 cs con eso puedes carrear xd no es muy dificil llegar a esos cs :P","replies":[{"poster":"21 Gun Salute","date":"2015-10-11T21:59:59.219+0000","up_votes":1,"down_votes":0,"body":"Claro, pero solamente si sabes farmear, pero si hubieras leido el post sabrias que se quejaba de que no sabia farmear","replies":[]}]}]}]},{"poster":"Aaron","date":"2015-10-11T03:20:28.942+0000","up_votes":2,"down_votes":1,"body":"Los platinos en LAS son los platas en los demás servidores, si no pregúntale a pain gaming XD","replies":[{"poster":"o Trafalgar o","date":"2015-10-11T22:35:53.429+0000","up_votes":1,"down_votes":1,"body":"Los bronces de corea son los diamantes de LAS a.a","replies":[]}]},{"poster":"Moctesuma","date":"2015-10-11T23:11:31.550+0000","up_votes":1,"down_votes":0,"body":"creo que algo raro pasa en mi caso, no puedo salir de bronce porque cuando estoy en promo me toca la peor gente se enojan por boludeces o arman cualquier equipo sin pensar en lo que elije el equipo contrario. otra cosa que me rompe las bolas es que juego ranked para que no pongan la excusa boluda de que es \"un normal\" y por eso juega para la mierda en especial los platinos y de ahi para arriba. creo que en mi caso es  o gano porque en el otro equipo tenes el afk, el toxico, etc. o pierdo porque esta en el mio, hasta ahora no me a tocado una partida en donde ambos equipos sean buenos y la partida se ponga interesante. y no lo digo porque me interese ser platino ni toda la bola sino porque me parece un game entretenido pero a veces no te dan ganas de jugar. y lo mas triste es que las partidas tardan mucho cuando no se quieren rendir porque se enojaron después de dar  asesinatos al equipo enemigo y sabes que vas 30 a 2 y no tiene caso seguir jugando. es mi opinión espero se entienda.","replies":[]},{"poster":"Tyrr Judicator","date":"2015-10-10T22:34:41.658+0000","up_votes":1,"down_votes":0,"body":"a mi la cachetada me la pego Platino 2 desde que subí encuentro cada loco que juega tan bien\nIgualmente eso me gusta porque yo entro a ranked para eso, encontrar gente MEJOR QUE YO y poder jugar, ganar o perder o incluso sufrir pero eso es lo que te hace mejorar como jugador!\nmientras mas difícil mejor ¿no? si la tuviéramos fácil siempre seriamos como un gran pez en un pequeño estanque","replies":[]},{"poster":"FePa","date":"2015-10-10T20:59:50.275+0000","up_votes":1,"down_votes":0,"body":"excepto por diamante 5, diamante 5 es la escoria de lo que sea que se llame, el elohell se hace perfeccion. \"\"diamante 4 > bronce 5 hasta platino 1 > diamante 5\"\"","replies":[]},{"poster":"Sir AZØR","date":"2015-10-10T20:20:09.956+0000","up_votes":1,"down_votes":0,"body":"Yo subí a Platinoob V hace poco y la verdad es que hay gente mala como en todas las ligas pero ya esta, quede en Plata III despues de haber jugado las 10 primeras (Mi objetivo era Oro) y bueno jeje\n\nLa season que viene Diamante <3","replies":[]},{"poster":"Zakor","date":"2015-10-10T19:07:46.066+0000","up_votes":1,"down_votes":0,"body":"Mi problema es que cuando saco 4 o 5 kills me empiezo a confíar y termino cagandola feedeando a todos","replies":[]},{"poster":"Sir Crucifix ","date":"2015-10-10T18:27:57.698+0000","up_votes":1,"down_votes":0,"body":"es un 5 vs 5 no un 1 vs 1 ,por mas challenger que sea el que pelee en linea yo no acepto la derrota","replies":[]},{"poster":"o Trafalgar o","date":"2015-10-10T18:08:20.975+0000","up_votes":1,"down_votes":0,"body":"Te cuento lo que me paso a mi . \nMe dejaron en Plata 3  , subi a Oro en 3 dias. De Oro a Platino 2 abre pasado en 3 semanas maso menos. Pero en Platino 2 donde me encuentro ..... es una jaula , hay tanta cantidad de Elo Boost y eso que es muuuuuuuuuuy dificil jugar, obvio que hay gente con un re nivel  porque te emparejan con Diamantes y Platinos 1 pero es increible. Es mas , para mi tenia mas nivel Platino 5-3 que  Platino 2 a Diamante 5 .\n Y con respecto a tu caso , no importa , lo que hiciste es lo que hay que hacer , llegar a la Liga donde digas : \" este es mi nivel , donde tengo que estar \" y a seguir mejorando ! Y a seguir intentando subir :D GL ! ","replies":[]},{"poster":"josuke","date":"2015-10-11T01:51:25.718+0000","up_votes":1,"down_votes":1,"body":"ahora un bronce te dara un chachetazo, el ego te hace bronce aquellos que juegan para alardear se quedan en bronce sean diamante platino lo que quieras. no seas tarado plz.","replies":[]},{"poster":"SET0  KAIBA","date":"2015-10-10T19:56:04.386+0000","up_votes":1,"down_votes":4,"body":"a quien le interesa xD","replies":[{"poster":"DarkMirakov","date":"2015-10-11T00:18:43.757+0000","up_votes":1,"down_votes":0,"body":"troll","replies":[]}]}]}