{"poster":"Zer0 Blaze","date":"2015-08-01T23:19:02.402+0000","title":"Riven und Diana im Late?","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Fallen Riven und Diana im Lategame ab?","replies":[{"poster":"Gregor Gysi","date":"2015-08-02T00:08:52.197+0000","up_votes":1,"down_votes":0,"body":"http://champion.gg/champion/Diana\nhttp://champion.gg/champion/Riven\nJawohl, beide Champions fallen im Lategame ab.\nBei Riven liegt das primär daran, dass im Late sehr viel aktive gegroupt wird und es ausgesprochen schwer ist picks zu machen. In den Teamfights selbst sind die Tanks mittlerweile auch so tanky, dass sie diese nicht einfach niedermähen kann sondern gnadenlos wegCCt wird, da E+Q sehr kurze, langsame und insgesamt berechenbare Engagetools sind. Ohne Flash kann sie daher quasi gar nicht teamfighten.\nAllgemein sind Champions, die darauf angewiesen sind Squieshys zu erledigen und dabei kein gutes Escapetool mitbringen im Lategame eher schwächer als vorher, da an diesem Punkt Supporter noch deutlich mehr Optionen haben ihren AD zu töten und auch die Carries defensive Items besitzen - einfach rein und alles niedermähen ist nicht mehr.\nDas gilt also sowohl für Riven als auch Diana.","replies":[{"poster":"ErnteSkunkFest","date":"2015-08-02T00:13:05.203+0000","up_votes":1,"down_votes":0,"body":"Naja, eig kann Riven im Late super Splitpushen, Picks sind bei guter Absprache auch möglich und Diana hat überhaupt kein Problem auf einen Adc zu engagen. \nSie fallen etwas ab, fühlen sich aber im L8 auch wohl ^^","replies":[{"poster":"Gregor Gysi","date":"2015-08-02T01:18:30.345+0000","up_votes":1,"down_votes":0,"body":"In der aktuellen Meta ist splitpushen sehr schwach. Jeder hat mittlerweile (schon seit langem) Teleport und Riven kann im Late keinen Tower in Anwesenheit des gegnerischen Toplaners nehmen. In dem Moment in dem ein Teamfight ausbricht jedoch ist Riven klar im Nachteil gegenüber den tank tops.\nWelcher Toplaner fällt denn stärker ab? Darius ist es nicht (schau dir die stats an).","replies":[{"poster":"commander003","date":"2015-08-03T23:22:07.034+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=singurytas,realm=EUW,application-id=vatevpvi,discussion-id=cJYHlI8m,comment-id=000100000000,timestamp=2015-08-02T01:18:30.345+0000)\n>\n> In der aktuellen Meta ist splitpushen sehr schwach. Jeder hat mittlerweile (schon seit langem) Teleport und Riven kann im Late keinen Tower in Anwesenheit des gegnerischen Toplaners nehmen. In dem Moment in dem ein Teamfight ausbricht jedoch ist Riven klar im Nachteil gegenüber den tank tops.\n> Welcher Toplaner fällt denn stärker ab? Darius ist es nicht (schau dir die stats an).\n\nSorry, aber das heißt für mich nur das übliche: Zu viele Leute die Riven nicht spielen können gehen mit ihr im Late (oder allgemein im Teamfight ;))) ) unter.","replies":[{"poster":"Gregor Gysi","date":"2015-08-04T10:07:40.501+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=commander003,realm=EUW,application-id=vatevpvi,discussion-id=cJYHlI8m,comment-id=0001000000000000,timestamp=2015-08-03T23:22:07.034+0000)\n>\n> Sorry, aber das heißt für mich nur das übliche: Zu viele Leute die Riven nicht spielen können gehen mit ihr im Late (oder allgemein im Teamfight ;))) ) unter.\n\nKlingt für mich eher als würden zu viele Leute, die nicht gegen Riven spielen können IMMER gegen sie unter gehen. Derlei Leute haben die Tendenz sich im Forum zu beschweren, da sie eigentlich offensichtliche Schwächen nicht ausnutzen können.\nWenn wir schonmal bei ad hominem sind, nicht wahr? ;)","replies":[]}]}]}]}]},{"poster":"Bluefersan","date":"2015-08-03T23:27:53.446+0000","up_votes":1,"down_votes":0,"body":"also zu riven kann ich nichts sagen bin nicht so gut mit ihm, fragt nicht wieso ich kann azir gut spielen aber bin schlecht wenn ich riven spiele.\naber zu diana, find wenn du sie im higher elo spielen siehst, wo keiner blind reingeht..., sie ist schwach early aber op late habt ihr einen naut ( oder jemand anderen) der die carries festhällt kann sie die hintereinander one shoten.","replies":[]},{"poster":"ÆonFox","date":"2015-08-02T01:44:46.773+0000","up_votes":1,"down_votes":0,"body":"Riven muss ihr strakes Early nutzen und später auf CC achten, Diana wird über die Zeit mit Items stärker hat aber auch mit CC zu kämpfen.","replies":[]},{"poster":"ErnteSkunkFest","date":"2015-08-01T23:41:05.291+0000","up_votes":1,"down_votes":0,"body":"Eigentlich nicht, du musst halt nur in die Backline kommen, im richtigen Moment engagen. \nRiven fühlt sich im Late sogar zieemlich wohl, weil sie ein Riesiges Outplaypotential mitbringt und ihre CC im Late noch stärker wird, da ja das ganze Team extrem viel Schaden drückt --> Alle sind Fullbuild.\nMit den beiden musst du halt im TF die Carrys rauskriegen, ich würde nicht sagen, dass die beiden abfallen.","replies":[{"poster":"ÆonFox","date":"2015-08-02T01:41:44.919+0000","up_votes":1,"down_votes":0,"body":"Beide und Riven stäker als Diana haben im Lategame mit CC zu kämpfen, ein guter Stunn oä und ihre ganze Stärke verpufft und der Tot ist Nahe, eine Riven muss zudem Gefeedet sein sonst fällt der Effeckt noch stärker auf, Diana schafft es meisst, selbst wenn sie nicht Fett ist, einen Gegner mitzunehmen da ihr Engage und Burst noch etwas härter ausfallen. Gegen ein gutes Team sind aber beide schnell Tot wenn der Focus und der CC da ist und das Timing nicht 100% war...","replies":[]}]}]}