{"poster":"Nibbio Bianco","date":"2016-06-01T19:11:29.346+0000","title":"Diciamocelo: questo è l'unico VERO problema della coda dinamica.","subforum":"Discussioni generali","up_votes":18,"down_votes":4,"body":"La possibilit&agrave; di fare gruppo con pi&ugrave; compagni permette anche a chi &egrave; meno abile di salire di grado, togliendo cos&igrave; la competitivit&agrave; che la maggioranza dei giocatori di ranked cercavano: non ha pi&ugrave; senso salire con le proprie abilit&agrave; se tanto poi ti ritrovi cani e porci al tuo stesso livello. L&#039;unica differenza tra ranked e draft pick &egrave; la mancanza di Teemo support e Urgot jungler.","replies":[{"poster":"Ste the ripper","date":"2016-06-01T21:20:34.480+0000","up_votes":6,"down_votes":0,"body":"Secondo me i problemi sono 3:\n1. Quello che dici tu\n2. Come si evince dai grafici pubblicati dalla riot attualmente chi gioca in solo è oggettivamente svantaggiato, la sua winrate è nettamente sotto al 50%\n3. Hai molto meno controllo sulla partita, se in 3 gankano la tua lane prima potevi pensare: Sono coordinati, ora sai che sono premade. Questo è frustrante, è frustrante sia che poi vinci la partita, sia che la perdi, sei in balia degli eventi e li subisci.","replies":[{"poster":"Zedant","date":"2016-06-02T09:53:13.510+0000","up_votes":3,"down_votes":1,"body":"ba io riuscivo a chiamare la gente per fare dei team work spettacolari,poi sono finito argento e qui e pieno di spagnoli e fracesi che non ti cagano :(","replies":[]}]},{"poster":"EmptyHole","date":"2016-06-01T19:44:57.609+0000","up_votes":2,"down_votes":1,"body":"Si sta dicendo questo da cinque mesi","replies":[{"poster":"Nibbio Bianco","date":"2016-06-01T19:50:58.348+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=Timarius,realm=EUW,application-id=MJVj50Jw,discussion-id=PRTAaAjc,comment-id=0002,timestamp=2016-06-01T19:44:57.609+0000)\n>\n> Si sta dicendo questo da cinque mesi\n\nMa 5 mesi fa era ok, perché tanto sarebbe dovuta uscire la solo. Ora non più.","replies":[{"poster":"Yamero Senpai","date":"2016-06-02T13:30:37.826+0000","up_votes":1,"down_votes":0,"body":"metti pure che se te sei un solo player visto che non vuoi giocare con amici/ non ne hai manco uno, non riuscirai mai ad entrare nel \"gruppo\" di quei 3-4 premade, non ti tengono in considerazione, non ti prestano ascolto, il zilean support non ulterà mai te -adc feedato- perché il zed è suo premade e amici>estranei, salvo i casi straordinari come quel nostro team full latinos di ieri, lol\n\nma c'è anche un lato positivo, se individui il premade nemico, campi uno o due di loro e loro influenzeranno i loro amici a surrendare visto che sono 0/10\n","replies":[]},{"poster":"RedmasterITA","date":"2016-06-01T20:30:53.406+0000","up_votes":1,"down_votes":0,"body":"seems legit","replies":[]}]}]},{"poster":"ßad Insidë","date":"2016-06-02T16:11:46.610+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IlRisotto,realm=EUW,application-id=MJVj50Jw,discussion-id=PRTAaAjc,comment-id=,timestamp=2016-06-01T19:11:29.346+0000)\n>\n> La possibilit&amp;agrave; di fare gruppo con pi&amp;ugrave; compagni permette anche a chi &amp;egrave; meno abile di salire di grado, togliendo cos&amp;igrave; la competitivit&amp;agrave; che la maggioranza dei giocatori di ranked cercavano: non ha pi&amp;ugrave; senso salire con le proprie abilit&amp;agrave; se tanto poi ti ritrovi cani e porci al tuo stesso livello. L&amp;#039;unica differenza tra ranked e draft pick &amp;egrave; la mancanza di Teemo support e Urgot jungler.\n\nLa coda dinamica nasce per lo più per i lvl alti (da Diamante in su) dove il tempo di attesa e enorme. Il problema non sono i boostati, perche puoi ritrovarteli nel team o in quello avversario, quanto gli smurf che rompono il cazzo. Prima erano max 2 ora be c'e gente che boosta  in 3 o in 4, diamante e platino in silver, semplicemnte ridicolo; (tipoco riven mid con exsaut e ignite. o lee combo op).  E non venitemi a dire se sei forte sali perche mi sale il crimine....\n\nL'unica miglioria il /remake, finalmente avete capito che se starto con un afk il game e perso e gli lp erano rubati, finalmente grazie riot!\n\n(ho perso 8 game e 3 promozioni solo per afk)","replies":[{"poster":"Ste the ripper","date":"2016-06-02T21:47:48.985+0000","up_votes":2,"down_votes":0,"body":"> La coda dinamica nasce per lo più per i lvl alti (da Diamante in su) dove il tempo di attesa e enorme.\n\nNo, infatti i tempi delle code sono aumentate per chi ha l'mmr alto e no di nuovo perché infatti la riot dalla prossima patch impedirà a chi è sopra il diamante di codare in più di 3.","replies":[]}]},{"poster":"Jack Garrus","date":"2016-06-02T21:24:53.487+0000","up_votes":1,"down_votes":0,"body":"Io amo giocare in solo. Non capisco e non digerisco il fatto che la Riot ha deciso che i solo non vanno più bene. Quale benedetto è il motivo? Bah","replies":[{"poster":"Ste the ripper","date":"2016-06-02T21:45:46.998+0000","up_votes":2,"down_votes":0,"body":"Perché così convinci i tuoi amici a giocare a lol, porti nuovi clienti pur di non restare da solo :)","replies":[{"poster":"Jack Garrus","date":"2016-06-02T22:30:44.201+0000","up_votes":1,"down_votes":0,"body":"ammetto di non averci pensato","replies":[]}]},{"poster":"Nibbio Bianco","date":"2016-06-02T21:36:56.601+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JackGarrusxxx,realm=EUW,application-id=MJVj50Jw,discussion-id=PRTAaAjc,comment-id=000d,timestamp=2016-06-02T21:24:53.487+0000)\n>\n> Io amo giocare in solo. Non capisco e non digerisco il fatto che la Riot ha deciso che i solo non vanno più bene. Quale benedetto è il motivo? Bah\n\nL'hanno fatto per ridurre il flame, o almeno così dice la riot.","replies":[{"poster":"Jack Garrus","date":"2016-06-02T22:30:16.051+0000","up_votes":1,"down_votes":0,"body":"Mh, ma si flamma lo stesso tra compagni. In più capita che, siccome è un amico, quello che sta facendo più schifo o sta flammando non gli si dice nulla, e quindi si perde. Non esiste soluzione al flame","replies":[]}]}]},{"poster":"Onecesco","date":"2016-06-02T11:52:32.170+0000","up_votes":2,"down_votes":0,"body":"Io ho giocato buona parte delle mie ranked da solo e non ho notato tutte queste difficoltà, anzi... Comunque questo è un gioco che ha sempre privilegiato l'aver fortuna sul giocare bene. Quindi è probabile che io sia stato fortunato. Ma anche prima era così. L'anno scorso avere un duo premade in squadra significava perdere il game, perchè per \"bilanciare\" gli veniva opposta una squadra nemica troppo più forte. Quindi su quel versante è meglio ora, a mio avviso. Cani e porci poi li ho sempre trovati in platino anche l'anno scorso. Il vero problema è cha da una qualsiasi divisione 5 non si può scendere, quindi per quanto scarso tu sia resti lì.","replies":[]},{"poster":"Azharidan","date":"2016-06-01T21:36:19.582+0000","up_votes":2,"down_votes":1,"body":"Come se tolto questo, non trovi comunque gente eloboostata .\nIl vero problema è che se prendo un primary role tipo top, e un secondary role support, mi uscirà più spesso support probabilmente .","replies":[{"poster":"Zedant","date":"2016-06-02T09:54:12.346+0000","up_votes":1,"down_votes":0,"body":"Non ci crederai,ma io ho messo supp primario e poi fill secondario(diciamocelo questo e il secondo supp) e sono andato bot :)","replies":[]}]},{"poster":"DuckQuack0","date":"2016-06-01T19:45:56.810+0000","up_votes":2,"down_votes":1,"body":"L'ho sempre detto che il premade in ranked non deve esistere, oltre ad essere stupido permettere di fare gruppo in una modalità dove si dovrebbe salire con le proprie abilità, c'è sempre...  SEMPRE il boostato nel premade, ridico sempre. \n\nPrima o poi la Riot ci penserà, forse non questa season, ma i giocatori si fanno sempre più sentire, i premade che rovinano i game aumentano sempre e cosi via","replies":[{"poster":"Zedant","date":"2016-06-02T09:55:02.286+0000","up_votes":1,"down_votes":0,"body":"Perche?Se tu ti sei fatto un idea sbagliata delle rank rispetto alla riot chi cambia?Riot o te?Riot!","replies":[]}]},{"poster":"Nò Sùèg","date":"2016-06-02T13:57:20.143+0000","up_votes":1,"down_votes":0,"body":"Bhe a dire la verità le ranked sono diventate un inferno.Certo non come prima ma quasi.\nSe giochi da solo e ti capita un gruppo di 3 o 4 premades,difficilmente ti cagano e avendo dei premades in squadra anche gli avversari saranno(quasi sempre) dei premade.Così facendo la partita si riduce ai premades vs premades.Il problema della SoloQ di prima era la tossicità soprattutto nella scelta dei ruoli.Quindi perché non fare una soloq dove puoi scegliere 2 lanes e una queque per i premades? \nChe poi volete sapere il motivo per cui tutti vogliono top,mid e jungle e nessuno vuole support? tutti vorrebbero fare da carry e avere una penta facile.Avete mai visto un support farsi una penta?L'importanza dei support signori(main support non mi uccidete) è stata abbandonata con Yorick.Per questo se scegli come seconda lane il supporto ora ci metti 10 secondi e 90% ti danno support.","replies":[]},{"poster":"PeppKar","date":"2016-06-02T10:56:12.170+0000","up_votes":1,"down_votes":0,"body":"Ecco perché non sto rankando questo mese, é diventato una merda. Credevo migliorassero la situazione ma invece.. Come dissi in un precedente post ormai il gold é un bronzo, ci sono player che non sanno proprio che fare, assurdo xD É un calcio alla mia dignitá di player che segue il Gold da mesi e mesi non riuscire a salirci perché in Silver e Gold é un putiferio , mmr sballati, boostati, poi ci si mette il fattore Unlucky e tanti saluti!","replies":[{"poster":"Yamero Senpai","date":"2016-06-02T13:36:28.113+0000","up_votes":1,"down_votes":0,"body":"il gold è sempre stato il bronzo.\n bronzo 4->bronzo3->bronzo2->bronzo1-> diamante sporco di bronzo-> diamante raffinato\n. bronzo    .....| silver      .....  |gold        .. .......|platino         |.. ........diamante 5-2   . .. .  .......                    ..  | diamante 1 in sù","replies":[]}]},{"poster":"Nackha1","date":"2016-06-02T10:05:22.286+0000","up_votes":1,"down_votes":0,"body":"Ma non potrebbero semplicemente rimettere le vecchie e belle ranked team 5v5 (non solo 3v3) e magari mettere come massimo la trioq?(visto che pare che la riot voglia sempre che giochiamo premade....)","replies":[{"poster":"Nibbio Bianco","date":"2016-06-02T10:29:32.957+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Nackha1,realm=EUW,application-id=MJVj50Jw,discussion-id=PRTAaAjc,comment-id=0008,timestamp=2016-06-02T10:05:22.286+0000)\n>\n> Ma non potrebbero semplicemente rimettere le vecchie e belle ranked team 5v5 (non solo 3v3) e magari mettere come massimo la trioq?(visto che pare che la riot voglia sempre che giochiamo premade....)\n\nDifficilmente torneranno indietro.","replies":[{"poster":"IrrationalNumber","date":"2016-06-02T10:42:58.982+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IlRisotto,realm=EUW,application-id=MJVj50Jw,discussion-id=PRTAaAjc,comment-id=00080001,timestamp=2016-06-02T10:29:32.957+0000)\n>\n> Difficilmente torneranno indietro.\n\nHan proprio detto che non lo faranno. La gente dovrebbe fare come me e smettere di giocare per farglielo capire.","replies":[]}]},{"poster":"Bronze II","date":"2016-06-02T10:26:25.449+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Nackha1,realm=EUW,application-id=MJVj50Jw,discussion-id=PRTAaAjc,comment-id=0008,timestamp=2016-06-02T10:05:22.286+0000)\n>\n> Ma non potrebbero semplicemente rimettere le vecchie e belle ranked team 5v5 (non solo 3v3) e magari mettere come massimo la trioq?(visto che pare che la riot voglia sempre che giochiamo premade....)\n\ntrioq?? Sei serio...non peggioriamo le cose, già la duoq era inaccettabile...Vogliamo soloq pura e team ranked 5vs5","replies":[{"poster":"Nackha1","date":"2016-06-02T10:34:35.158+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kvmist,realm=EUW,application-id=MJVj50Jw,discussion-id=PRTAaAjc,comment-id=00080000,timestamp=2016-06-02T10:26:25.449+0000)\n>\n> trioq?? Sei serio...non peggioriamo le cose, già la duoq era inaccettabile...Vogliamo soloq pura e team ranked 5vs5\n\nAnchio vorrei che ci fosse solo team ranked e soloq, ma visto che la riot non lo farà MAI, magari con una trioq (o anche duo) sarebbero più propensi a tornare indietro....","replies":[]}]}]},{"poster":"RedmasterITA","date":"2016-06-01T19:43:48.365+0000","up_votes":1,"down_votes":0,"body":"Mha , mha ? E' una critica alla riot ?\nSono allibito .","replies":[{"poster":"RealLifeFamilia","date":"2016-06-02T07:49:52.871+0000","up_votes":1,"down_votes":0,"body":"tanto non legge nulla e peggiora tutto ancor di più, cya","replies":[]}]},{"poster":"Darkinknight","date":"2016-06-01T23:49:10.559+0000","up_votes":1,"down_votes":0,"body":"Questa season hanno messo su troppi troppi cambiamenti..sbilanciamenti ovunque,prevedibili alcuni, ma ci sta non è semolice bilanciare tutte queste cose..ma la coda dinamica beh,è demenzialita allo stato puro senza se e senza ma..se uno voleva giocare in team faceva 3 vs 3 o le team ranked..perche diciamolo,giocare contro ma soprattutto con premade non è affatto divertente,oltre che la tua abilita da singolo va un po buttata nel cesso..per chi dice che c'era anche prima chi boostava è vero,ma è diverso trovarsi contro 1 smurf da trovarsene 3/4...oppure trovarsi in squadra 3-4 premade che trollano che non uno singolo...in piu dimezziamo pure l'exp per il 30,cosi non aggraviamo la cosa..quando in realta la soluzione per i player meno bravi/smurf/account da vendere è abbastanza semplice..dare un limite minimo di win in normal per joinare ranked (tipo 400-500),e startare dal b5 nella prima season..da questo punto di vista sembra che nella riot nessuno giochi a lol,per ignorare in questo modo il problema..poi dal punto di vista economico non so nemmeno che ci guadagnino se non il far giocare anche i tuoi amici,ma se i tuoi amici vedono che il gioco è una merda sicuramente non ci spendono..mentre se chi gioca è piu soddisfatto ci spendera qualcosa in piu probabilmente..onestamente se avessi iniziato giocare questa season avrei mollato dopo poco","replies":[]},{"poster":"Eye of Kraken","date":"2016-06-01T20:09:28.395+0000","up_votes":1,"down_votes":0,"body":"Finalmente, Lutero guidaci!","replies":[]}]}