{"poster":"Nibbio Bianco","date":"2015-09-16T12:33:46.951+0000","title":"RIOTJatt Group B predictions","subforum":"Esport","up_votes":2,"down_votes":2,"body":"http://boards.na.leagueoflegends.com/en/c/esports/HYpEPd4A-group-b-preview-and-predictions","replies":[{"poster":"StayM","date":"2015-09-16T13:44:37.425+0000","up_votes":1,"down_votes":0,"body":"Secondo me, ma anche secondo Jatt, questo è uno dei gironi più difficili da classificare.\nIo posso direi FNC> IG >AHQ >C9\nma le prime 3 posizioni sono, ahimè, incredibilmente variabili, penso che sia una questione di testa e secondo me con uno come Yelowstar al quinto mondiale (su cinque mondiali) l'esperienza si farà sentire.","replies":[{"poster":"Nibbio Bianco","date":"2015-09-16T13:52:15.707+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=StayM,realm=EUW,application-id=wqlqxm93,discussion-id=jYXQaNyG,comment-id=0001,timestamp=2015-09-16T13:44:37.425+0000)\n>\n> Secondo me, ma anche secondo Jatt, questo è uno dei gironi più difficili da classificare.\n> Io posso direi FNC> IG >AHQ >C9\n> ma le prime 3 posizioni sono, ahimè, incredibilmente variabili, penso che sia una questione di testa e secondo me con uno come Yelowstar al quinto mondiale (su cinque mondiali) l'esperienza si farà sentire.\n\nè vero, però c'è da dire che gli ahq hanno uno stile di gioco molto differente rispetto alle altre squadre, cercano di gruppare midlaner, jungler e support e di fare towerdives. Il loro midlaner è uno dei migliori fizz in circolazione, e di recente hanno nerfato la versione ad di fizz per migliorare quella AP, per questo motivo ho messo AHQ come secondi, ma se seguiranno questo stile di gioco ai mondiali o gli andrà estremamente bene o estremamente male. Visto che la verità sta nel mezzo, li ho messi secondi.","replies":[{"poster":"StayM","date":"2015-09-16T14:31:22.317+0000","up_votes":1,"down_votes":0,"body":"Io invece preferisco uno stile raccimola e distruggi, un po' alla SKT, basato sul farm.Ovviamente quelle partite che iniziano col first blood dopo 20 minuti le odio anche io.\nQuindi visto che, diciamolo tifo Fnatic, li metto in vetta poi metto gli IG che sono sempre una sicurezza e gli Ahq, come hai ben detto, o vanno estremamente bene o estremamente male. I C9 credo siano inferiori nonoostante stiano crescendo molto.\n In ogni caso vedremo cosa accadrà tra un paio di settimane alea iacta est D:","replies":[]}]}]},{"poster":"Arkanim94","date":"2015-09-16T13:02:18.103+0000","up_votes":1,"down_votes":0,"body":"*cambia la posizione dei C9 dal tabellone scommesse*","replies":[]}]}