{"poster":"Nibbio Bianco","date":"2017-04-20T14:33:25.894+0000","title":"Aatroce o Viktorioso? Warwick che piglia pesci.","subforum":"Discussioni generali","up_votes":9,"down_votes":1,"body":"Ehilà bella gente, questa volta vi parlerò di UltraLion, un main jungler che gioca da un po’ a LoL, ma che pare essere tutto azione e niente teoria… vediamo un po’ i suoi errori più comuni e dove potrebbe migliorare. \n\n**Ah, già, vi ricordo che se voleste partecipare alla prossima analisi, vi basterà scriverlo qua sotto e ci penserò io a contattarvi su come passarmi il replay che dovrà essere della patch corrente! **\n\n.\n\n> **Inizio analisi**\n\n\n\nAl minuto 4:00 Ultra ganka in mid, e la gank va bene, anche se per farlo sprecherà un flash, ma subito dopo non pusha la lane per aiutare fizz a recallare il più presto possibile. è molto importante farlo anche perché così metti in difficoltà il laner avversario che perde più farm.\n\nhttp://i.imgur.com/w8dAC8j.jpg\n\nhttp://i.imgur.com/s7uvPL5.jpg\n\nA questo punto vediamo Ultra dirigersi verso la toplane, dove farà un 1vs2 che per lui andrà molto bene, ma che sarebbe potuto andare molto, molto male… ecco qui due screenshot per spiegare l’accaduto. \n\nhttp://i.imgur.com/Bbe0izL.jpg\n\nhttp://i.imgur.com/qk3NN4F.jpg\n\nA questo punto si nota molto facilmente che, a parte lo sfruttare poco la meccanica della Q di Warwick, Ultra ha delle buone meccaniche generali, fa l’attack move, sa usare il campione, e sta attento a dove deve andare, però… cerca molto, molto la kill e non bada al resto. \n\nUna cosa che, però gli consiglio di migliorare il più presto possibile è quello di capire chi è degno di essere gankato e chi, invece, no. Guardate un po’ qua. \n\nhttp://i.imgur.com/eS0Eum7.jpg\n\nQua Ultra decide di andare verso la toplane ad aiutare vayne, che per altro, da come gioca, si noterà le sue scarsissime abilità. Un jungler deve riuscire a capire dove concentrare i suoi sforzi, a feeddare, quindi, il giocatore che più merita essere feeddato. Un giocatore può anche fare 0/3/0, ma essere un buon giocatore, come può essere un pessimo giocatore. L’abilità del jungler sta anche nel capire chi merita essere feeddato e chi no, focalizzando le proprie energie sui giocatori che in futuro potranno farti vincere la partita. Il fatto che un giocatore stia facendo 5/0/0 non significa che quel giocatore ti farà vincere la partita… potrebbe anche semplicemente aver avuto fortuna. State attenti quando giocate, cercate di capire con chi state giocando e focalizzatevi ad aiutare chi merita. \n\nhttp://i.imgur.com/qJohwac.jpg\n\nQui abbiamo un altro flash sprecato.\n\nhttp://i.imgur.com/IXqCVR6.jpg\n\nQua Lion deciderà di puntare alle kills, piuttosto che farsi la torre. Tra parentesi col suo intervento farà una kill. \n\nhttp://i.imgur.com/kB59e1b.jpg\n\nhttp://i.imgur.com/GfIFVp4.jpg\n\nE qua abbiamo UltraLion che decide di andare in giro nella giungla piuttosto che stare col team. \n\n.\n\n> **Conclusione**\n\nQuindi, da questi screenshot possiamo comprendere subito che, anche se le meccaniche generali le ha, mancano grossi basi teoriche. Andare troppo alle kills, poca farm, pochi obiettivi… Per migliorare UltraLion deve pensare a saper ottimizzare il tempo, che spreca molto spesso cercando di fare azioni inutili… deve pushare, farmare, gankare di continuo, senza andare a fare invade a caso, cercare combattimenti sempre e comunque e sprecando tempo chasando nemici quando non sa cosa c’è dietro. \n\nIl mio consiglio, in questo caso, è quello di guardare come giochi perché solo così potrai renderti conto di cosa avresti dovuto fare, piuttosto che fare dell’altro. \n\nNel complesso, comunque, mi sento di doverti dare il viktorioso, in quanto in questa partita specifica il tuo contributo è stato molto buono, e sono stati i tuoi alleati a fare molti errori che poi ti hanno portato alla sconfitta. Anche giocando in maniera perfetta, non credo che saresti riuscito a vincere questa partita, in quanto sia fizz sia vayne non conoscevano molto bene le basi dei campioni che stavano giocando e si vedeva chiaramente. \n\nhttp://i.imgur.com/6SsqWGU.jpg\n\n**Vi ricordo che per partecipare basterà contattarmi qua sotto e ci penserò io a contattarvi in gioco per avere il vostro replay! Mi raccomando, che sia della patch corrente!**","replies":[{"poster":"A Yordle ln Heat","date":"2017-04-20T15:08:06.981+0000","up_votes":1,"down_votes":0,"body":"Analizza me one day pls.","replies":[{"poster":"Nibbio Bianco","date":"2017-04-20T15:10:40.119+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CommonDotaPlayer,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=0000,timestamp=2017-04-20T15:08:06.981+0000)\n>\n> Analizza me one day pls.\n\nAnche two days.","replies":[{"poster":"A Yordle ln Heat","date":"2017-04-20T15:11:49.569+0000","up_votes":1,"down_votes":1,"body":"E fallo quando gioco Rakan.\nHo preso S alla mia first time con lui. ;)))","replies":[{"poster":"Vileblood Pyke","date":"2017-04-20T15:13:51.346+0000","up_votes":4,"down_votes":0,"body":"Con i campioni nuovi è più facile prendere voti alti.","replies":[{"poster":"A Yordle ln Heat","date":"2017-04-20T15:14:42.779+0000","up_votes":1,"down_votes":0,"body":"Ciò non toglie che sono stato bravo.","replies":[]}]},{"poster":"Nibbio Bianco","date":"2017-04-20T15:51:46.843+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CommonDotaPlayer,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=000000000000,timestamp=2017-04-20T15:11:49.569+0000)\n>\n> E fallo quando gioco Rakan.\n> Ho preso S alla mia first time con lui. ;)))\n\nE passami un replay di Rakan, allora!","replies":[{"poster":"A Yordle ln Heat","date":"2017-04-20T18:28:56.262+0000","up_votes":1,"down_votes":0,"body":"Ce l'ho, ma come si fa a mandare?","replies":[]}]}]}]}]},{"poster":"DarkMagicianIT","date":"2017-04-20T20:02:58.399+0000","up_votes":1,"down_votes":2,"body":"> Al minuto 4:00 Ultra ganka in mid, e la gank va bene, anche se per farlo sprecherà un flash, ma subito dopo non pusha la lane per aiutare fizz a recallare il più presto possibile. è molto importante farlo anche perché così metti in difficoltà il laner avversario che perde più farm.\n\nHa fatto benissimo invece, \"sprecare flash\" .. amico, yasuo scappa in mezzo secondo, invece ww con il suo \"spreco\" ha prima usato il fear, e dopo il suo buff rosso lo ha rallentato e inflitto danni aggiuntivi... , in pratica gli ha assicurato un easy kill. Pushare fino alla torre in quel caso era TOTALMENTE inutile per semplici motivi : 1) La torre nei primi 7 minuti (qui siamo al quarto) subisce danni MOLTO minori , 2) Se tu ultrapushi, già da early game, subisci un freeze da parte dell'avversario (se non è stupido), e fizz in quel caso non può andare in un 1 vs 1 con yasuo, sia perché avrebbe PUSHATO ancora di più la lane (sappiamo come funzionano i minion..) , sia perché ingaggiandolo, si potrebbe essere ritrovato Olaf dietro. \nSe tu valuti un game in base all'elo dei giocatori stai messo male (non mi dire nulla {{champion:266}} ), bisogna fare le scelte giuste, e lui ci ha indovinato di brutto. \n\nP.s Poteva pulire la giungla nemica, olaf è lentuccio in early, ed è anche affamato di mana .. >.>","replies":[{"poster":"Nibbio Bianco","date":"2017-04-21T06:50:19.557+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=DarkMagicianIT,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=0004,timestamp=2017-04-20T20:02:58.399+0000)\n>\n> Ha fatto benissimo invece, &quot;sprecare flash&quot; .. amico, yasuo scappa in mezzo secondo, invece ww con il suo &quot;spreco&quot; ha prima usato il fear, e dopo il suo buff rosso lo ha rallentato e inflitto danni aggiuntivi... , in pratica gli ha assicurato un easy kill. Pushare fino alla torre in quel caso era TOTALMENTE inutile per semplici motivi : 1) La torre nei primi 7 minuti (qui siamo al quarto) subisce danni MOLTO minori , 2) Se tu ultrapushi, già da early game, subisci un freeze da parte dell&#x27;avversario (se non è stupido), e fizz in quel caso non può andare in un 1 vs 1 con yasuo, sia perché avrebbe PUSHATO ancora di più la lane (sappiamo come funzionano i minion..) , sia perché ingaggiandolo, si potrebbe essere ritrovato Olaf dietro. \n> Se tu valuti un game in base all&#x27;elo dei giocatori stai messo male (non mi dire nulla {{champion:266}} ), bisogna fare le scelte giuste, e lui ci ha indovinato di brutto. \n> \n> P.s Poteva pulire la giungla nemica, olaf è lentuccio in early, ed è anche affamato di mana .. &gt;.&gt;\n\nSi, ma fizz è un campione con un grosso clearing wave già di suo, difatti ciò che accadrà in questo caso è che Yasuo avrà il tempo di raggiungerlo in lane e di ucciderlo perché fizz stava ancora farmando tentando di far raggiungere la wave di minion sotto torre. E, comunque, se una persona vuole carryare in basso elo quando passa dalla lane si piglia pane e companatico così da carryarla easy. Si, poteva entrare nella giungla avversaria a rubare  dei campi, però in questo caso non avrebbe trovato nulla, perché olaf aveva già trovato tutto, e si sarebbe dimostrata una perdita di tempo contro un qualcosa che poteva dare un'utilità effettiva. Per quanto riguarda il flash su Yasuo... guardando bene puoi notare che non c'era un singolo minion alleato, quindi Yasuo da quella situazione poteva scappare soltanto attraverso una E per tornare indietro su un nemico che è rivolto verso la sua torre, quindi non si sarebbe potuto salvare in nessuna maniera con un buon posizionamento (e tra l'altro questo Yasuo è di elo basso, non l'avrebbe mai fatto, ma so dettagli questi)","replies":[]},{"poster":"Frattaglia","date":"2017-04-20T20:10:37.300+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DarkMagicianIT,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=0004,timestamp=2017-04-20T20:02:58.399+0000)\n>\n> Ha fatto benissimo invece, &quot;sprecare flash&quot; .. amico, yasuo scappa in mezzo secondo, invece ww con il suo &quot;spreco&quot; ha prima usato il fear, e dopo il suo buff rosso lo ha rallentato e inflitto danni aggiuntivi... , in pratica gli ha assicurato un easy kill. Pushare fino alla torre in quel caso era TOTALMENTE inutile per semplici motivi : 1) La torre nei primi 7 minuti (qui siamo al quarto) subisce danni MOLTO minori , 2) Se tu ultrapushi, già da early game, subisci un freeze da parte dell&#x27;avversario (se non è stupido), e fizz in quel caso non può andare in un 1 vs 1 con yasuo, sia perché avrebbe PUSHATO ancora di più la lane (sappiamo come funzionano i minion..) , sia perché ingaggiandolo, si potrebbe essere ritrovato Olaf dietro. \n> Se tu valuti un game in base all&#x27;elo dei giocatori stai messo male (non mi dire nulla {{champion:266}} ), bisogna fare le scelte giuste, e lui ci ha indovinato di brutto. \n> \n> P.s Poteva pulire la giungla nemica, olaf è lentuccio in early, ed è anche affamato di mana .. &gt;.&gt;\n\nSe pushi la wave fino alla torre, poi viene resettata tornando in mezzo e il nemico perde farm che viene ucciso dalla torre.\nLo scopo di pushare non è necessariamente quello di danneggiare la torre, in questo caso serviva a negare il farm al mid nemico (premetto che non ho visto il video ma questa meccanica ce l'ho abbastanza presente).\n\nTi dirò di più, quando stai per buttare giù una torre nemica, a volte conviene aspettare a dare il colpo finale, per dare il tempo alla torre di uccidere un paio di minion prima di cadere e negarli al laner nemico.","replies":[{"poster":"DarkMagicianIT","date":"2017-04-20T20:19:51.648+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=00040000,timestamp=2017-04-20T20:10:37.300+0000)\n>\n> Se pushi la wave fino alla torre, poi viene resettata tornando in mezzo e il nemico perde farm che viene ucciso dalla torre.\n> Lo scopo di pushare non è necessariamente quello di danneggiare la torre, in questo caso serviva a negare il farm al mid nemico (premetto che non ho visto il video ma questa meccanica ce l&#x27;ho abbastanza presente).\n> \n> Ti dirò di più, quando stai per buttare giù una torre nemica, a volte conviene aspettare a dare il colpo finale, per dare il tempo alla torre di uccidere un paio di minion prima di cadere e negarli al laner nemico.\n\n... Frattaglia, detto da te non me lo sarei mai aspettato.\n\n1) La wave torna in mezzo, verissimo, ma il fizz che giocava NON conosceva le meccaniche di base del suo campione. Facendo come dite voi fornivate a yasuo un pretesto per A: Pushare Fizz, e WW doveva babysittarlo (aspetta, un 1 vs 2 produce da qualche parte un 4 vs 3 ...) oppure B: Freezare e Fizz sarebbe stato doppiamente fregato, perchè non avrebbe potuto farmare, ed inoltre, non poteva nemmeno fare roam perché bot era freezata (si scrive così?  >.> ) , nel caso di ultralion, si, Yasuo avrebbe freezato lo stesso la lane, ma Fizz aveva più minion dalla sua parte, quindi, yasuo avrebbe subito molti danni in più (siamo in early game).\n\nL'aspettare i minion dipende dal campione che giochi:\n\na volte conviene farli uccidere dalla torre se vuoi un reset della lane,\n\na volte conviene invece tenerli in vita, farli pushare, e bloccare la lane avversaria in un punto preciso (esempio, Top, vicino ai Tribush), in modo da tendere agguati ai nemici che si apprestano a farmare.. \n\nDimmi, questo lo sapevi? >.>","replies":[{"poster":"Pellah","date":"2017-04-27T12:23:32.701+0000","up_votes":3,"down_votes":0,"body":"Onestamente io sono d'accordo con Nibbio, in quel momento Fizz doveva pushare con l'aiuto di Warwick.\nAvendo così poca vita Fizz non poteva permettersi di rimanere in lane, guardando le ward si vede che non aveva conoscenza della posizione del jungler nemico, di conseguenza rimanendo a farmare 1) Era a rischio di un gank di Olaf e 2) Yasuo poteva tornare con degli oggetti più potenti e ucciderlo; quindi poteva o recallare e lasciare a Yasuo tutto quel farm extra oppure la scelta migliore, ovvero rimanere in lane pushando col jungler così sarebbe stato safe da un gank, avrebbe pushato i minion sotto la torre nemica e di conseguenza quest'ultima avrebbe ucciso i minion alleati negando così gold ed exp allo yasuo nemico, a questo punto la lane si sarebbe resettata e Fizz avrebbe dovuto recallare sfruttando il momento per 1) Perdere meno farm possibile 2) recuperare vita e 3) spendere i soldi guadagnati con il gank per ottenere un vantaggio in lane.","replies":[]},{"poster":"Frattaglia","date":"2017-04-20T20:28:47.295+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DarkMagicianIT,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=000400000000,timestamp=2017-04-20T20:19:51.648+0000)\n>\n> ... Frattaglia, detto da te non me lo sarei mai aspettato.\n> \n> 1) La wave torna in mezzo, verissimo, ma il fizz che giocava NON conosceva le meccaniche di base del suo campione. Facendo come dite voi fornivate a yasuo un pretesto per A: Pushare Fizz, e WW doveva babysittarlo (aspetta, un 1 vs 2 produce da qualche parte un 4 vs 3 ...) oppure B: Freezare e Fizz sarebbe stato doppiamente fregato, perchè non avrebbe potuto farmare, ed inoltre, non poteva nemmeno fare roam perché bot era freezata (si scrive così?  &gt;.&gt; )\n> \n> L&#x27;aspettare i minion dipende dal campione che giochi:\n> \n> a volte conviene farli uccidere dalla torre se vuoi un reset della lane,\n> \n> a volte conviene invece tenerli in vita, farli pushare, e bloccare la lane avversaria in un punto preciso (esempio, Top, vicino ai Tribush), in modo da tendere agguati ai nemici che si apprestano a farmare.. \n> \n> Dimmi, questo lo sapevi? &gt;.&gt;\n\nMi ero persa il punto in cui diceva che Fizz era più nabbo di Yasuo. In realtà messa in questo modo avrei proprio ignorato la mid a meno che non ci fosse una gank su un piatto d'argento. \nComunque so come si freeza e dove, la domanda però  è: a che elo stiamo giocando? Se giocassimo in platino mi fiderei del giudizio del mio laner e nel caso volesse pushare lo aiuterei altrimenti me ne andrei. In bronzo/silver come questa partita invece è improbabile che il laner nemico sappia freezare, quindi come meccanica base l'avrei pushata per resettarla. Che poi la lane viene resettata in mezzo, non vicino alla torre nemica.","replies":[]}]}]}]},{"poster":"UltraLion","date":"2017-04-22T13:54:58.735+0000","up_votes":1,"down_votes":1,"body":"Continuo ad avere game con dei team di merda e perdere per la squadra, sono imbottigliato fra gente senza mani, questa è l'unica cosa che posso pensare","replies":[{"poster":"Nibbio Bianco","date":"2017-04-22T14:19:23.270+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=UltraLion,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=0006,timestamp=2017-04-22T13:54:58.735+0000)\n>\n> Continuo ad avere game con dei team di merda e perdere per la squadra, sono imbottigliato fra gente senza mani, questa è l&#x27;unica cosa che posso pensare\n\nPensa che \"team di merda\" e \"gente senza mani\" sta anche nel team avversario... se solo riuscissi a capire come muoverti efficacemente ed a utilizzare meglio le tue risorse potresti salire velocemente.","replies":[{"poster":"UltraLion","date":"2017-04-22T14:48:51.534+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nibbio Bianco,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=00060000,timestamp=2017-04-22T14:19:23.270+0000)\n>\n> Pensa che &quot;team di merda&quot; e &quot;gente senza mani&quot; sta anche nel team avversario... se solo riuscissi a capire come muoverti efficacemente ed a utilizzare meglio le tue risorse potresti salire velocemente.\n\nSarà, ma è proprio quello che mi fa incazzare, ci sono dei game che mi sembra di essere contro dei bot, e perdo lo stesso, maestro illuminami la via","replies":[]}]}]},{"poster":"Silstar","date":"2017-04-21T15:10:12.891+0000","up_votes":2,"down_votes":0,"body":"Analizzami, please!","replies":[{"poster":"Nibbio Bianco","date":"2017-04-21T16:05:56.341+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Silstar,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=0005,timestamp=2017-04-21T15:10:12.891+0000)\n>\n> Analizzami, please!\n\nOk, aggiungimi in gioco e ti dirò come passarmi il replay!","replies":[{"poster":"Silstar","date":"2017-04-21T17:57:13.777+0000","up_votes":1,"down_votes":0,"body":"Fatto","replies":[]}]}]},{"poster":"UltraLion","date":"2017-04-20T16:31:30.139+0000","up_votes":2,"down_votes":0,"body":"Warwick piglia pesci :D\nDunque, per seguire meglio i tuoi consigli ho bisogno di rivedere il game, e capire il perchè in alcuni momenti andassi in determinate direzioni, probabilmente sbagliando come dici, ma devo capire cosa avevo per la mente in quel momento.\nPosso azzardare di aver provato a gankare vayne, perchè la bot se la stava cavando con ezreal, detto questo gli errori che ho visto da solo sin da subito sono tutti i vari flash superflui\nmentre invece in top ero sicuro di me ad andare contro 2, forse perchè avevo già qualche kill dalla mia, ma hai ragione fossero stati bravi immagino mi avrebbero aperto, gli obiettivi cerco di tenerli d'occhio ma non riesco a fare in modo di essere sempre al momento giusto dove dovrei.\nDetto questo dirò una cosa che potrebbe suscitare ilarità insulti e calci volanti, ma tu mi vieni a dire che probabilmente non avrei carriato il game anche giocando perfettamente, e io la sensazione di finire in partite così la ho avuto davvero tante tante volte, e mi dico ma wtf?\nE' ovvio che faccio mille errori, li fanno ai livelli alti, figurati io.. però un minimo di esperienza la ho, mi sembra di essere spesso sfigato coi team, la cosa fa un pò cadere le palle, poi vabbe se sei forte sali, ne sono convinto.","replies":[]},{"poster":"SirGGtheWanderer","date":"2017-04-27T22:14:03.955+0000","up_votes":1,"down_votes":0,"body":"Ciao, volevo chiederti se potresti analizzare un game particolare.\nPraticamente la top ha finito malamente perchè era la prima volta che giocava Kled e ha fatto feedare uno shen (tipo 15/0). Nonostante questo però siamo riusciti a vincere. Potresti dare un'occhiata al replay e spiegarmi come abbiamo fatto? Ho una mezza idea, ma preferirei il parere di qualcuno più esperto.","replies":[{"poster":"Nibbio Bianco","date":"2017-04-28T12:55:10.277+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NerusSkyhigh,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=0007,timestamp=2017-04-27T22:14:03.955+0000)\n>\n> Ciao, volevo chiederti se potresti analizzare un game particolare.\n> Praticamente la top ha finito malamente perchè era la prima volta che giocava Kled e ha fatto feedare uno shen (tipo 15/0). Nonostante questo però siamo riusciti a vincere. Potresti dare un&#x27;occhiata al replay e spiegarmi come abbiamo fatto? Ho una mezza idea, ma preferirei il parere di qualcuno più esperto.\n\nè un po' tardi, mi sono già messo ad analizzare!","replies":[{"poster":"SirGGtheWanderer","date":"2017-04-28T18:36:09.048+0000","up_votes":1,"down_votes":0,"body":"Non preoccuparti.\nAspetterò con ansia la tua prossima rubrica","replies":[]}]},{"poster":"Frattaglia","date":"2017-04-28T07:34:33.282+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NerusSkyhigh,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=0007,timestamp=2017-04-27T22:14:03.955+0000)\n>\n> Ciao, volevo chiederti se potresti analizzare un game particolare.\n> Praticamente la top ha finito malamente perchè era la prima volta che giocava Kled e ha fatto feedare uno shen (tipo 15/0). Nonostante questo però siamo riusciti a vincere. Potresti dare un&#x27;occhiata al replay e spiegarmi come abbiamo fatto? Ho una mezza idea, ma preferirei il parere di qualcuno più esperto.\n\nCredo abbia parecchi altri replay da analizzare prima, comunque ti consiglio di aggiungerlo e chiederglielo sul client passandogli il file .rofl.","replies":[]}]},{"poster":"GragasTheCatfish","date":"2017-04-20T18:09:31.422+0000","up_votes":1,"down_votes":0,"body":"domanda, ma ti ha passato il file rofl del replay oppure ha filmato il game in formato webn? perché devo mandare un replay in rofl a una persona ma non so come si fa","replies":[{"poster":"Nibbio Bianco","date":"2017-04-20T18:46:06.123+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GragasTheCatfish,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=0003,timestamp=2017-04-20T18:09:31.422+0000)\n>\n> domanda, ma ti ha passato il file rofl del replay oppure ha filmato il game in formato webn? perché devo mandare un replay in rofl a una persona ma non so come si fa\n\nMi basta il file rofl del replay. Per passarlo aggiungimi su lol, ti dico io come fare.","replies":[]}]},{"poster":"wellyT93","date":"2017-04-20T15:37:28.505+0000","up_votes":1,"down_votes":0,"body":"Da quello che ho capito da questa analisi, ha le meccaniche da Gold alto, ma il decision making da Bronzo, appena sistemerà quello secondo me non avrà alcun problema a salire. \n\nAnalisi molto interessante, tra l'altro ho ritrovato un errore che faccio pure io spesso, usare troppo le summoner, ok che il \"better safe than sorry mate\" per me è legge, però spesso esagero.","replies":[{"poster":"HaIIeIujah","date":"2017-04-20T15:38:17.784+0000","up_votes":1,"down_votes":0,"body":"> , ha le meccaniche da Gold alto, ma il decision making da Bronzo\n\nDescrive sorprendentemente bene Diamond V!","replies":[{"poster":"Nibbio Bianco","date":"2017-04-20T15:52:23.369+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ø Tera Ø,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=00010000,timestamp=2017-04-20T15:38:17.784+0000)\n>\n> Descrive sorprendentemente bene Diamond V!\n\nDiamond inside!","replies":[]}]},{"poster":"Nibbio Bianco","date":"2017-04-20T15:50:54.361+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=wellyT93,realm=EUW,application-id=MJVj50Jw,discussion-id=g6yOhh2m,comment-id=0001,timestamp=2017-04-20T15:37:28.505+0000)\n>\n> Da quello che ho capito da questa analisi, ha le meccaniche da Gold alto, ma il decision making da Bronzo, appena sistemerà quello secondo me non avrà alcun problema a salire. \n> \n> Analisi molto interessante, tra l&#x27;altro ho ritrovato un errore che faccio pure io spesso, usare troppo le summoner, ok che il &quot;better safe than sorry mate&quot; per me è legge, però spesso esagero.\n\nDiciamo che non sbaglia con Warwick... è un buon Warwick main che però non sa veramente cosa fare durante il corso di una partita. Le summoner's spell sono veramente buttate da UltraLion, sopratutto pensando che per come gioca potrebbe facilmente soverchiare i suoi nemici elo bronze/silver, senza dover sprecare le summoner's.","replies":[]}]}]}