{"poster":"Trekhal","date":"2017-09-13T22:18:37.260+0000","title":"REWORK AZIR","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"El rework de azir ya llego y queria saber que piensan los main azir de los cambios al plumifero, esta mas fuerte o mas debil, es mejor o peor?\r\nxD\r\nsalu2","replies":[{"poster":"Drakar35","date":"2017-09-21T12:59:03.443+0000","up_votes":2,"down_votes":0,"body":"Es una basura el rework de Azir, de por si ya estaba en la mierda, a mi me encantaba, cuando llegue a m6 aunque no pegara nada por ser el mago con mas late, con un par de plays podías carrear, era fácil para mi luego de mucho tiempo de practicar, me encantaba a pesar de que no pegaba mucho, que requerías 2 items caros para llegar a pegar decente, pero era un buen champ, un champ que requería mecánicas, cuando llegue a mainearlo, un año después ¿Que pasa? Rework a Azir, me parece una basura los cambios que le hicieron, arruinaron un champ, pero claro, Tryndamere, Yi, El Buff a Fiora en su velocidad de movimiento, eso si que no esta roto, pero Azir, UFFF, que asquito de champ ¿No? No entiendo en que piensa Riot... Azir es genial como esta, apuesto que los main Yasuo se vinieron a quejar y así respondió Riot, que pena, arruinaron a Azir, un champ que a pesar de no tener un daño descomunal, podía carrear, y con sus mecánicas, si las sabias usar eras imparable.","replies":[]},{"poster":"RandomDeus","date":"2017-09-13T23:24:09.296+0000","up_votes":1,"down_votes":0,"body":"Una mierda, le sacaron su rango la r ya no te sigue empujando el escudo de la e dura 1,5 la q tiene menos rango los soldados tambien atacan desde mas cerca...","replies":[{"poster":"FrankRAM","date":"2017-09-14T13:38:34.337+0000","up_votes":1,"down_votes":0,"body":"es un overall nerf para los no mains, un buff para los que lo juegan hace mucho. fijate con DETALLE las cosas.","replies":[{"poster":"Sputnïk","date":"2017-09-30T00:13:06.103+0000","up_votes":1,"down_votes":0,"body":"Soy main azir y si, es un buff en el early, pero todos esos movimientos locos que podia hacer por su rango ahora cuestan un huevo y medio. Prefiero su pobre early 1000 veces mas a que este rango tan corto.","replies":[]}]}]},{"poster":"warriorsg","date":"2017-09-17T02:47:58.505+0000","up_votes":1,"down_votes":0,"body":"Peor, la velocidad de ataque que le dan es ridicula. \nMe costo tanto mainearlo y cuando llego a la m7 sale la noticia del rework... Hasta podria decir que no me hacian falta los ultimos 3 buffs que le dieron, si lo sabes bien usar carreas la partida. Me acuerdo que dijeron que el rework es porque es un campeon muy completo, ahh pero y ekko? ese si es un campeon roto que no cuesta lo mismo aprender a usarlo que usar a azir.\nSolo estoy preocupado, ojala no le hicieran el rework me divierto mucho como es ahora.","replies":[]},{"poster":"SmokeyShauna","date":"2017-09-13T23:20:22.353+0000","up_votes":1,"down_votes":0,"body":"spera k rework?","replies":[]}]}