{"poster":"0kc1n","date":"2016-07-31T15:01:15.895+0000","title":"Mac Client Crashing After Login (6.15)","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I was originally playing League on the Mountain Lion OS X(10.8.5) but I had to update because some other programs were no longer becoming usable. I'm now currently on El Capitan (10.11.6). At first everything was fine, I was even able to play a large number of matches on this OS X. However the following morning I opened the client, logged in, but then suddenly the League client crashes. After a few attempts or re-logging in I sent it into repair. Unfortunately the repair didn't work.\r\nWhen the repairs (and aggressive re-logging) didn't work, I deleted League from my computer to do a clean re-download. After the download taking nearly 8 hours (it took 45 mins when i downloaded the first time ever) I tried logging in one last time. Tired, upset, and slightly salty I was surprised when the client didn't crash once I logged in and actually saw the front page.\r\nThat surprised quickly went to \"I expected as much\" when I closed the client and tried to re-open it to watch the client crash right after login over again.\r\nI'm just confused as to what the problem is. Is it Mac/Apple side with their OS X being buggy? Is it my computer? Is it client side? I sent a support ticket in \r\nI just want to play... ='(","replies":[{"poster":"Weldieran","date":"2016-08-04T20:43:14.345+0000","up_votes":1,"down_votes":0,"body":"Found a temporary hackfix.  Clearly when the game crashes, its during loading of something on the home screen.  Login, authenticate, then disable the ethernet/wifi network connection and it cancels loading of home screen, re-enable the adapter and you are good to go, at least until the next time the home screen tries to load.\n\nno thanks to the terrible riot support - days without any response on a well defined ticket complete with game logs and crash logs.","replies":[]},{"poster":"Weldieran","date":"2016-08-04T18:54:41.757+0000","up_votes":1,"down_votes":0,"body":"I have the same problem.  Came back from a week trip, everything on computer wanted updated.  Did all updates, including latest patch to league - and now it crashes after every login.\n\nBeen days, no response from riot support either.","replies":[]},{"poster":"Targons Blade","date":"2016-07-31T21:56:56.826+0000","up_votes":1,"down_votes":0,"body":"I've seen this issue a few times in the past. Sometimes it can be easily solved by some networking steps, while other times it's caused by an issue that occurs during OS X upgrades. The latter is when you're upgrading OS X and certain system fonts that League relies on becoming corrupt or missing. When this happens, your League client can crash when it tries to access those font files. \n\nSince you've already submitted a ticket, I recommend patiently waiting for a tech specialist to get back to you. They'll be able to dive into some system logs and determine the exact reason why this is happening to you. \n\nLet me know if you have any other questions.","replies":[]},{"poster":"Kürama","date":"2016-07-31T18:08:49.814+0000","up_votes":1,"down_votes":0,"body":"Rid yourself of the pests which harass your gameplay by using the [Bug & Crash Exterminator.](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes) Kha’Zix and Elise won’t know what hit ‘em.\n\nhttp://na.leagueoflegends.com/sites/default/files/styles/scale_xlarge/public/upload/khazix_deathblossom_splash_1920x1080.jpg?itok=re5tY9ln https://static.lolwallpapers.net/2014/12/Death-Blossom-Elise.jpg","replies":[{"poster":"0kc1n","date":"2016-07-31T19:18:48.481+0000","up_votes":1,"down_votes":0,"body":"I just tried each and every troubleshoot they gave and nothing worked =/","replies":[{"poster":"Kürama","date":"2016-07-31T19:25:25.479+0000","up_votes":1,"down_votes":0,"body":"Reply to the ticket, let them know the articles didn't work.","replies":[]}]}]}]}