{"poster":"HuntingCharger","date":"2015-02-17T17:41:30.732+0000","title":"Nach 10 Promogames ungeranked mit 0 Spielen","subforum":"Hilfe & Support","up_votes":2,"down_votes":0,"body":"Ich habe ein Problem der Titel sagt es ziemlich gut. Ich habe vor ca. 2h mein 10. promogame gezockt. Als ich mit meine Freunden gewonnen hatte und ich schon gespannt darauf wartete wo ich geranked werden würde, war ich überrascht zu sehen nicht eingeranked worden zu sein. Ich dachte mir \"hmm kann passieren\". war wohl nen Anzeigebug oder so. Aber als ich nachdem in meinem Profil geguckt hatte stand dort nichts. So als hätte ich kein einziges gespielt. Nun nach 2h gibt es noch keinen Unterschied zu vorher. Zudem hätte ich jetzt reintheoretisch 12 Spiele gespielt haben müssen . Aber Lol schien nur das erste der 3 Spiele am ersten Tag gewertet zu haben komischer weise wurde laut lolking(kann sein das sich einfach nur die irren) das erste spiel gewertet und die anderen beiden nicht. Zu meinem Pech war nur das erste verloren und die anderen beiden nicht. Dadurch falls das auch ein fehler bei lol ist, könnte es sein das ich schlechter geranked hätte werden können.","replies":[{"poster":"Revilous","date":"2015-02-17T19:54:09.593+0000","up_votes":2,"down_votes":0,"body":"Ich sehe auf deinem Profil 6/10 gespielt. Spiel einfach noch 4. Wenn dann in deiner History 4 Rankeds soloq sind aber du nicht eingestuft bist, ist es ein Bug, ansonsten sehe ich in deiner History nur ein Ranked, ein paar Arams und ein paar Koops, sowie ein Normal.\n\nmfG","replies":[]},{"poster":"Zero000","date":"2015-02-17T20:33:38.728+0000","up_votes":1,"down_votes":0,"body":"Diese Saison ist am 21. Januar gestartet.\n> It’s time to slim back down to fighting weight and pull those tryhard pants on, because on January 21 we’re opening up the 2015 ranked season!\n\nhttp://euw.leagueoflegends.com/en/news/game-updates/competitive/get-ready-2015-ranked-season\nLaut deiner Matchhistory hast du seit dem aber nur 9 Ranked Spiele gemacht.\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-history/EUW1/207434643\nAllerdings hattest du kurz vor Ende der Vorsaison einige Ranked Spiele. Könnten das deine verschwundenen Spiele sein?","replies":[{"poster":"HuntingCharger","date":"2015-02-17T20:36:14.398+0000","up_votes":1,"down_votes":0,"body":"Dann war es wohl ein Anzeigebug. Trotzdem lustig das es so aussieht als hätte ich 0 placements gezockt","replies":[]}]}]}