{"poster":"Duane Barker","date":"2019-04-28T04:57:14.540+0000","title":"\"There was a problem joining the queue - please contact riot support\"","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Over the last week around 4 times now I'll join a game, pick a champ, get the loading screen then after a while at the loading screen I'm instantly back to the lobby and it says I was a leaver even though the game never loaded. I've got I think 3 or 4 leaver penalties in the last week because of it.\nIt just happened to me again but now when I try to requeue it says \"There was a problem joining the queue please contact riot support\"\nI've restarted the client, restarted the computer and restarted the router. Still get the same error when I try to queue","replies":[{"poster":"Ninox","date":"2019-04-28T08:28:05.835+0000","up_votes":1,"down_votes":0,"body":"Ultimately if you're on 20 minute timers either this issue has been persistent or you've encountered the system recently for some other reason. The expectation would be that you would seek a solution before now, but either way Riot doesn't remove things like LeaverBusters/LPQs so you'll have to play it out. Regardless of if you left intentionally or not, you are still negatively affecting the 9 other people in each of those games.\n\nAs for the issue itself, it could be connection, PC, or client related and given it's not a common issue it's most likely beyond any solutions you'll find from players on boards. You should do as suggested and send a ticket to support: https://support.riotgames.com/hc/en-us/requests/new","replies":[]},{"poster":"Duane Barker","date":"2019-04-28T05:58:02.988+0000","up_votes":1,"down_votes":0,"body":"oh now I have 20 minute game restrictions because the client crashes? That seems fair....\n\nIs there a way to get that overturned?\n\nfor those of us that aren't young kids with heaps of spare time, trying to fit a game here and there in between work, 20 minute game timers can make the game unplayable","replies":[]}]}