{"poster":"ßΣΠζΣ","date":"2018-08-18T15:39:34.984+0000","title":"Ping","subforum":"Segítség és támogatás","up_votes":2,"down_votes":1,"body":"Sziasztok, csak egy kérdésem lenne!\n\nMost nemr&eacute;g v&aacute;ltottam &aacute;t egy erőssebb Telekomos csomagra (50 Mbps-r&oacute;l 1000 Mbps-ra).\n\nViszont manaps&aacute;g nem tudom mi&eacute;rt,  &uacute;gy t&uuml;nik mintha a Pingem magasabb lenne mint m&aacute;soknak. 44 pingem van, pedig l&aacute;ttam egy j&oacute; p&aacute;r embert aki kb 25 - 20 pingről futtatja itthon, n&eacute;ha rosszabb nettel. Egy p&aacute;r patchel ezelőtt, EUWon siker&uuml;lt a 29 ping ak&aacute;r, ez a r&eacute;gebbi csomagommal volt m&eacute;g. Most kezdtem el EUNE-n j&aacute;tszani, sz&oacute;val erről viszont nincs régebbi adatom.\n\nEz a &quot;magas&quot; ping probl&eacute;ma viszont hatott mind a kettő csomagomra, mielőtt v&aacute;ltottam, m&aacute;r akkor is jelen volt. M&aacute;r &iacute;gy van tal&aacute;n egy &eacute;s f&eacute;l h&oacute;napja. (Ezen a h&eacute;ten v&aacute;ltottam az &uacute;jabb csomagra).\n\nAz utc&aacute;mban optikai k&aacute;bel van, &eacute;s a g&eacute;pem Ethernet k&aacute;belt haszn&aacute;l, nem WiFit. Monoron lakom, hogyha ez sz&aacute;m&iacute;t valamennyit, &eacute;s az EUNE szerverről besz&eacute;lek.\n\nSz&oacute;val r&ouml;viden, norm&aacute;lis hogy ilyen erős nettel csak 44 pingem van, de l&aacute;ttam m&aacute;r egy csom&oacute; itthoni embert futtatni ilyen 25 - 20 pinggel?\n\nBocsi a rossz fogalmaz&aacute;s&eacute;rt, nem az erőss&eacute;gem.\n\nU.I: Hogy ne legyen félreértés: Régebben az EUWos átlag pingem 32 volt kb, de egy pár patch óta felemelkedett 45-re, \nEUNE-n pedig már 44 pinggel kezdtem, ami szerintem magas a netemhez képest.","replies":[{"poster":"derX","date":"2018-08-19T09:36:25.550+0000","up_votes":4,"down_votes":0,"body":"***","replies":[{"poster":"ßΣΠζΣ","date":"2018-08-19T10:51:49.968+0000","up_votes":1,"down_votes":0,"body":"Szia! Tudom, hogy a 44 ms egyáltalán nem magas, de azért mégis csak meglepő, hogy egy pár hónapja, még hoztam a 29 ms-t, EUWon ráadásul.\nPacket loss-t szerencsére még nem tapasztaltam túl sokszor, csak 1-2x. \n\nDigire nem tudok átváltani, hiszen errefelé nem engedték be, de amennyi tapasztalatom van a TV csomagjaikkal, hát, nem volt valami túl meggyőző.\n\nA gépem szerencsére teljesen ki tudja használni a netet, már teszteltem is. (Ryzen 5 1600, 24 giga ram, gtx 1060, 2tb sshd).\n\nMeg fogom próbálni ezt a DNS átállitásos dolgot. \n\nMár pingeltem az EUNE szervert (ha jól tudom, 104.160.142.3 az ip), és már volt akár 22 ms is. Megpróbáltam a tracert-ot, és észrevettem, hogy a 6, 7 hop valamiért azt hozza hogy \"Request timed out.\". Hogy ha kellenek a végeredmények, akkor irj vissza és elküldöm.\n\nAmúgy, olvastam (https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#wq8), hogy meg lehetne próbálni a Port Forwardolást is.\n\nU.I: Az alap Telekomos Sagemcom routert használom, eddig nem volt rá panasz.\n\nOut.","replies":[{"poster":"derX","date":"2018-08-19T13:56:57.389+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"ßΣΠζΣ","date":"2018-08-19T19:47:50.976+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DereX94,realm=EUNE,application-id=YzZuykbk,discussion-id=oZ45A3AV,comment-id=000200000001,timestamp=2018-08-19T13:56:57.389+0000)\n>\n> Egyébként sshd .. :D \n> Nem egy sima ssd-ről beszélünk, pláne nem m.2-es foglalatúról, ami a leggyorsabb. Hogy a géped kitudja-e használni, azt leginkább azzal tudod tesztelni, hogy letöltesz valamit és nézed, hogy 100MB/s körül vagy-e (+/-5)\n> \n> Az sshd jobb, mint egy sima hdd, de nem jobb az ssd-nél. A 24 gb ram milyen jól hangzik, de ajánlom, hogy egy izmosabb játékban nyomd meg az alt-tabot és feladatkezelőbe nézd meg mennyire is használja ki, s rájössz, hogy felesleges volt ennyit belerakni. \n> Az internet kihasználásához elég egy jobb ssd, illetve egy jobb processzor, ha ezek megvannak, akkor rendben vagy.\n\nPont most töltöttem le egy játékot, ahogy elnéztem végigtolta 110 MB/s-el .\n\nAzért 24 giga, hogy birja még egy pár évig, és azért, mert egyszerre több dolgot is csinálok, pl játszok és közben renderelek vagy exportálok egy videót. (Csak az utóbbi meg tud enni akár 8 gigát magától.)\n\nAz SSHD meg csupán azért, mert az egyik ismerősömnek nem kellett, és volt olyan kedves hogy odaadta.\n\nMár amúgy nem nagyon érdekel ez a pinges cucc, beletörődtem hogy ennyi marad, de furcsállom még akkor is, hogy ekkorát ugrott.","replies":[{"poster":"derX","date":"2018-08-20T04:36:15.339+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"ßΣΠζΣ","date":"2018-08-20T10:52:24.153+0000","up_votes":1,"down_votes":0,"body":"Hát a marketing az csak már ilyen :p, az előző gépemben Toshiba HDD volt amúgy, és nem tapasztaltam vele semmi problémát.\n\nMegpróbáltam a Google DNS-sel, lejjebb vitte 2-3 ms-sel, nem sok, de legalább valami.\nAmúgy, kiváncsiság kedvéért felnéztem az Angol fórumra, és felnéztem a Reddites LoL oldalra, egy jó páran ott is panaszkodtak a rosszabb ping miatt, szóval szerintem a Riot felén van a probléma most. Remélem legalább tájékoztatni fognak egy fórum kiirással, vagy valamivel.\n\nA renderelésről beszélve, igen, leginkább proci és ram függő. A processzorom igazából eléggé jó a rendereléshez, hiszen mégis csak 12 szálas. \nMár próbáltam én is a vga rendert, de a minőség rosszabb, ez tény.","replies":[]}]}]}]}]},{"poster":"Nines Hutz","date":"2018-08-19T12:52:41.171+0000","up_votes":1,"down_votes":0,"body":"Szia! nekem nem sikerült a port átírás sem. cmd-ben a 8.8.8.8/8.8.4.4 40ms átlag pinget mér mindig és a speedtest.net is. De játék közben 80 alá sose megy és véletlenszerű időközönként ugrál 250-300 ms között akár 20percen keresztül (és igen, így vagyok kénytelen lejátszani a meccset)\nEz mitől lehet szerinted?","replies":[{"poster":"derX","date":"2018-08-19T13:40:24.670+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Nines Hutz","date":"2018-08-19T15:39:56.377+0000","up_votes":1,"down_votes":0,"body":"Emlékezetből írtam 40-et, de lefuttattam és Minimum 50, Maximum 86, Average 72ms :(\nDe 2-2,5 hónapja játék közben stabil 60 volt sose ingadozott ennyire, borzasztó\nMás szervertől kapom a szolgáltató jelét, mint előtte? Vagy mitől lehetett ekkora változás azóta? Nem értem","replies":[{"poster":"derX","date":"2018-08-19T16:20:27.000+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Nines Hutz","date":"2018-08-19T16:52:14.776+0000","up_votes":1,"down_votes":0,"body":"Telenor wifi-s net. Azt hiszem úgy volt hírdetve, hogy Hypernet vagy Hipernet(?), már megvan több mint egy éve, de nem csinálta régen ezt.\nSpeedtest-et lefuttattam az előbb, Go után fél percig töltött aztán elkezdte 43 ping volt 3Mbps letöltés, de feltöltés alatt hibaüzenetet kaptam:\n\"UPLOAD TEST ERROR\nA socket error occurred during the Upload test. A firewall could be blocking the connection or the server might be having some issues. Please try again later. \n\nAlternatively, check out our free Speedtest for Desktop apps for more reliable testing.\"\n\nA cmd-s ping teszt-et is futtattam kb 10 perce az most olyan volt, hogy min 56, max 560ms average 350 valahogy így, és 25% packet loss.\nDe ez gyakori, sokszor tesztelem.\nWeboldalak kattintás után nagyon sokáig nem reagálnak, csak forog a szürke kör és tölt, aztán vagy kiírja, hogy időtullépés stb. szöveg, vagy végül betölti 5mp után. Vagy hiányosan tölti be, lemarad ez-az, képek pl.\n\nDe mondom régen semmi baja nem volt, szóval nem értem 2 hónapja ilyen rossz. Havi 7000 Ft-os net csomag. Nagyon bosszantó\n\nSzerk.: A weboldalukon ezt írja a csomagra: \"A Hipernet az elérhető legmodernebb technológiákon alapuló, villámgyors mobilinternet.\" \"Próbáljon ki akár több résztvevős, real time játékokat szakadozás és késleltetés nélkül.\"","replies":[]}]}]}]}]}]},{"poster":"JINXJINXJINXJINX","date":"2018-08-18T21:47:20.506+0000","up_votes":1,"down_votes":0,"body":"Ha a google DNS szerverét állítjátok be kiszolgálónak  rooter configba akkor működni fog.\nA browseres localhost rooter panelban csak portot kell nyitni, cmd-böl kell configolni!","replies":[{"poster":"ßΣΠζΣ","date":"2018-08-18T23:12:10.353+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=humusz120,realm=EUNE,application-id=YzZuykbk,discussion-id=oZ45A3AV,comment-id=0001,timestamp=2018-08-18T21:47:20.506+0000)\n>\n> Ha a google DNS szerverét állítjátok be kiszolgálónak  rooter configba akkor működni fog.\n> A browseres localhost rooter panelban csak portot kell nyitni, cmd-böl kell configolni!\n\nSzia! El tudnád mondani pontosabban, lépésről-lépésre, hogy ezt hogy csináljam meg? Bocsi, nem nagyon értek az ilyesmikhez.","replies":[{"poster":"JINXJINXJINXJINX","date":"2018-08-18T23:33:58.703+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=iIWueJI_Nqs\n\nWin10 cmd megnyitás win gomb+ r, beírod hogy cmd és futtatod.\n\nKeress rá a google dnsére.","replies":[]}]}]},{"poster":"Dippin","date":"2018-08-18T20:00:39.375+0000","up_votes":1,"down_votes":0,"body":"Hali ! Én is ugyan ezzel a problémával szenvedek jelenleg . Konstans 50-es ping és olyan mintha 1000 ms lenne abszolút játszhatatlanná vált , folyamatos óriási laggok 200+fps-el. Szintén telekomos net kábeles bár nem túl erős csomag , nálam a probléma kb. egy hónapja kezdődött . Ötletem sincs miért eddig nem volt vele semmi gond . Ha valaki más tudja az okát segítsen mert elég bosszantó egyik napról a másikra ilyen drasztikus változás szemtanúlya lenni.","replies":[]}]}