{"poster":"leo el smurf","date":"2017-08-23T00:52:13.550+0000","title":"consejos para salir de bronce?","subforum":"Guias y consejos","up_votes":4,"down_votes":0,"body":"hola, estoy buscando alguien que me pueda dar consejos para salir de bronce, pero no los tipicos consejos que se les da a un bronce, farmea bien, mira el mapa, no busques la kill, no flamees. esos ya me los se y los aplico en mis partidas, necesito consejos mas avanzados, algo que realmente me ayude a subir de liga y poder comprender mejor el LoL. desde ya muchas gracias amigos {{sticker:slayer-jinx-catface}}","replies":[{"poster":"The Start 1","date":"2017-08-24T08:08:07.623+0000","up_votes":1,"down_votes":0,"body":"Veo que no lo pusieron así que lo voy a poner yo, \"al menos que juegues para mejorar, siempre vas a estar estancado\". Ese es el consejo mas importante y veo que no lo pusieron. Entenderlo no te va a hacer subir de divisiones, aplicarlo si.","replies":[{"poster":"leo el smurf","date":"2017-08-24T22:38:52.465+0000","up_votes":2,"down_votes":0,"body":"ok, gracias por el consejo importante :D","replies":[{"poster":"The Start 1","date":"2017-08-24T23:24:41.674+0000","up_votes":1,"down_votes":0,"body":"De nada, espero que te sirva y puedas aplicarlo bro :3","replies":[]}]}]},{"poster":"Dracotraif","date":"2017-08-23T01:11:38.543+0000","up_votes":2,"down_votes":0,"body":"Si dastu nombre de invocador sería mas facil ayudarte","replies":[{"poster":"leo el smurf","date":"2017-08-23T17:05:34.830+0000","up_votes":1,"down_votes":0,"body":"thegreatleonidas, pase a bronce II","replies":[]}]},{"poster":"Muñekko","date":"2017-08-24T18:50:50.237+0000","up_votes":1,"down_votes":0,"body":"Concentrate en mejorar como jugador, en vez de en subir de liga o division\n\nConcentrate en tus errores, no en los de los demas. (Incluso en las partidas donde vas 10-0 y tu bot lane fedeo a mas no poder, siempre se pueden hacer las cosas mejor, es cuestion de pensar el como y el porque)","replies":[]},{"poster":"Herian","date":"2017-08-23T14:32:44.008+0000","up_votes":1,"down_votes":0,"body":"En Bronce, como ya te dijeron, lo ideal es que juegues campeones faciles y lineas en las que te sientas comodo (lo ideal es que sepas jugar todas las lineas, pero con que sepas jugar bien de Support mas otras 2 que a vos te gusten basta).\n\nTrata de usar campeones que ayuden a tu team (por ejemplo, en el caso de ir jungla, usa a Jax o Udyr ya que contribuyen bastante con sus stuns a la hora de gankear). Tambien, si vas muy bien en una partida, trata de hacer roaming a otras lineas y dejarle las kills a tu team (es mejor tener a 4 campeones fedeados en vez de que solo vos estes fedeado) y ayuda a otras lineas a tirar torres para generar desventaja al otro team. Si vas a gankear o a ayudar a otra linea intenta esperar a que el enemigo este alejado de su torre y que haya usado todas sus habilidades (de ser posible). Como minimo debes hacer que fuerce un flash para generarle una ventaja a equipo (o minimo hacer que vuelva a base y luego aprovechar para tirar su torre). Recuerda que si van muy bien en una partida JAMAS se confien, no traten de hacer jugadas arriesgadas. Traten de terminar la partida lo mas rapido que puedan (no hay nada peor que te den vuelta una partida que estaba ganada).\n\nCon respecto al tema de la fase de lineas intenta pokear con seguridad y hacerlo cada vez que tu oponente haya usado sus habilidades, sin descuidar mucho tu farm y recuerda eliminar a la mayor cantidad de minions posibles antes de hacer un engage. Si juegas contra tu counter intenta jugar lo mas pasivo que puedas y esperar ganks de tu jungla. Recuerda tambien que al ser tu counter puede \"hacer lo que quiera\". Por ejemplo, al tener el control de la linea puede pushearla y luego irse a hacer roaming a otras para generar ventaja. Asi que, si bien no puedes ganarle, al menos trata de tener el control de a donde esta en todo momento (a vos no te gustaria estar farmeando tranquilo en mid contra un Zed y de la nada aparece un Darius para ayudarlo).\n\nCreo que eso seria todo. Si tienes alguna otra duda pregunta.\n\nSuerte.","replies":[]},{"poster":"Pairoh","date":"2017-08-23T04:56:50.755+0000","up_votes":1,"down_votes":0,"body":"Busca que campeones estan fuertes en el meta o que crees que esten fuertes en general (solo carrys son buena opcion) recuerda que es ranked asi que tienes que contar con los baneos counters y las posibles lineas, juegalos y mira cuales te gusta su modo de juego, facilidad, diversion, y hasta por el mismo diseño de personaje Lo importante es que te guste lo que juegas y te diviertas (objetivo de todos los juegos) despues de eso busca algunas guias, practica sus combos, estrategias y counters (todo esto en normal o bots claro) y bueno cuando te sientas comodo con el campeon o al menos creas que tienes un dominio decente solo juega y veras que poco a poco iras ganando más y más partidas. Suerte\n¡Nos vemos en los Campos de la Justicia!","replies":[]},{"poster":"Blue Striker","date":"2017-08-23T04:32:45.868+0000","up_votes":1,"down_votes":0,"body":"Mira, aprovecha que en Bronce los equipos son super descoordinados, es recomendable usar campeones con split push","replies":[]},{"poster":"iEban","date":"2017-08-23T04:15:01.667+0000","up_votes":1,"down_votes":0,"body":"No hay consejos más avanzados. El problema es que generalmente se centran cinco minutos y se desconcentran el resto de la partida. Mirar el mapa no significa mirarlo cada 5 minutos, miralo cada 5 segundos.\nAcostumbrate a jugar pocos campeones, y preferentemente fáciles, si estas en bronce no pretendas que vas a salir jugando Lee Sin, por ejemplo. Pickea algo simple y eficiente, no seas el tipo que juega 50 campeones mal, se el tipo que juega 3 bien.\n\nPara mi no hay consejo más útil que el de agarrar un personaje y jugarlo hasta el cansancio.","replies":[]},{"poster":"Jherico","date":"2017-08-23T01:15:52.737+0000","up_votes":1,"down_votes":0,"body":"lo mismo que el amigo de arriba.","replies":[]}]}