{"poster":"Menor qe 3","date":"2015-07-17T23:22:45.298+0000","title":"Esto en otros server no pasa.","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hace unos momentos entre a la cola de Ranked (estoy jugando en plata, estoy ultimos dias muy bien) {{champion:432}} En la pantalla de carga me doy con que no variaban mis ms. Se quedaron congelados en 57ms y seguia en 49%\r\n{{champion:78}} empece a sospechar... asi que cerre el cliente y volvi a cargar. Llego a 100% ah&iacute; no m&aacute;s. \r\nEntro a la partida y me doy con que en mi team habia solo dos jugadores {{champion:34}} top y {{champion:157}} mid. Y lo primero que leo en el chat &quot;Report los 3 afks de mi team&quot; Si... Ni el jg de mi team, ni el adc {{champion:222}} habian entrado. \r\nLa {{champion:222}} entro como al min. 9 para cuando el adc enemigo ya tenia bastante farm.. aprovecharon su lvl bajo. super bukake etc etc.\r\nNo solo no cargo la partida, el ms promedio dentro del juego era de 300ms, cuando haces minutos en la partida anterior no tenia mas de 80ms.\r\n\r\n\r\nTuve cuenta en LAN y en BR. pero hace un tiempo comence a jugar en LAS porque mis amigo de facultad juegan en este servidor.\r\nLAN tiene mejor ping que las 115ms CONSTANTES. en BR no pasaba los 100ms como en las...PERO ESTOS PROBLEMAS NUNCA SUCEDIAN.\r\n&iquest;Porque no cierran clasificatorias hasta solucionar este lag?\r\nA la noche cuando el server esta descongestionado jugar RANKED es jugar a que no te toquen TROLLS/FLAMERS porque as&iacute; de triste es jugar dde noche, y por la tarde/noche tenes todos estos problemas....{{champion:83}} \r\n\r\n\r\nEn fin... ojala que solucionen esto y nos den alguna satisfacci&oacute;n...\r\n\r\nSaludos desde ARGENTINA a todos los loleros.{{summoner:31}} {{summoner:31}}","replies":[{"poster":"Vaas Estampida","date":"2015-07-18T22:41:06.867+0000","up_votes":1,"down_votes":0,"body":"Despues de las vaciones de invierno empiezo mi curso de Portugues, sinceramente duele dejar la cuenta atras pero es mejor un Server Full que un BETA SERVER. Ademas de la cantidad de problemas que jamas son de rito la poca atencion del staff o la atencion a cosas \"que solo le lleguen a molestar\"","replies":[]},{"poster":"LastHope17","date":"2015-07-18T01:36:37.068+0000","up_votes":1,"down_votes":0,"body":"Otro dia en las","replies":[]},{"poster":"LagunaStein","date":"2015-07-17T23:44:58.396+0000","up_votes":1,"down_votes":0,"body":"tipico de las.","replies":[]}]}