{"poster":"Reia","date":"2017-08-29T15:22:52.240+0000","title":"ARAM Verbesserung","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":1,"body":"Ich finde es w&auml;re eine gute Idee, wenn Riot im Aram f&uuml;r jeden alle Champions frei schalten w&uuml;rde. Da druch w&uuml;rden die Aram Accounts verschwinden und jeder h&auml;tte gleiche Chancen auf gute Champions.","replies":[{"poster":"R3playZ3","date":"2017-09-06T07:44:08.984+0000","up_votes":2,"down_votes":0,"body":"es wird mehr kommen aber riot ist derzeit maßlos überfordert. der client ist so verbuggt, das club leben wird erschwert und jetzt bald sollen schon wieder neue änderungen mit den runen geschehen. riot hat sich hier ziemlich übernommen und kommt einfach nicht mehr klar.\n\naram wird bald erstarkt zurückkehren da bin ich mir sicher, ist halt alles eine frage der zeit. versucht in der zwischenzeit nicht zu sehr andere spielmodi zu spielen weil sonst könnte es passieren das es riot zu den falschen entschlüssen kommen lässt und sie aram dicht machen.","replies":[]},{"poster":"Abasin","date":"2017-08-30T05:25:32.177+0000","up_votes":1,"down_votes":0,"body":"Jein. Wenn ich das Gejammer über ARURF hier im Forum lese, dann weiss ich, dass es keine gute Idee ist. Viele können mit Zufallschampions einfach nichts anfangen und kriegen den Frust. Wählen und Bannen ist einfach zu selbstverständlich geworden um solch einen Bruch der Gewohnheiten auch nur ansatzweise gut zu finden. \nDas Problem ist, dass man in ARAM ganz anders denken muss als in der Kluft. Da kann ein Nasus nicht stundenlang afk seine Stacks farmen, da macht auch ne Janna mal nen Penta. Die Beispiele sind endlos. Aber man kann trotzdem mit genug Grips eine Siegstrategie durchziehen.","replies":[]},{"poster":"Hakkuu","date":"2017-08-29T16:51:57.294+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist, dass Riots Balancing Teams zu 95% für SR zuständig sind. Und das kleine Team, dass die Featured Gamemodes macht, macht auch ARAM - also einen riesen haufen. Aram ist einfach sehr schwer zu balancen, und weil die Playerbase verhältnismäßig klein ist macht Riot da leider sehr wenig.\nFrüher war das Ziel noch, neue Maps / Gamemodes zu implementieren (siehe Dominion, Aram, 3v3 Rework). Heute bringt man nur noch ab und an einen neuen Featured Gamemode raus, um die Leute zufriedenzustellen, die darin den Spaß an einer sehr lockeren Atmosphäre suchen. \nIch find's auch echt blöd, aber Fakt ist: Was nicht Summoners Rift ist, ist von wenig Interesse.","replies":[]},{"poster":"TerrorRaven","date":"2017-08-29T15:28:14.617+0000","up_votes":1,"down_votes":0,"body":"Wäre tatsächlich eine gute Idee. In irgendeinen \"Ask Riot\" wurde meine ich mal angedeutet, dass man ebenfalls darüber nachdenkt. Allerdings wird es für ARAM und GW vorerst keine weiteren Änderungen geben in naher Zukunft.","replies":[]}]}