{"poster":"Numbbb","date":"2016-09-27T15:16:42.877+0000","title":"Was muss ich gegen AD und AP machen???","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey Leute ich habe paar fragen. Was muss ich gegen gegner machen die z.b auf ad spielen ? Welche items muss ich mir kaufen also welche kategorie. \r\nDas selbe auch mit ap. Wenn mein gegner auf ap full auf ap spielt, welche items muss ich kaufen also welche kategorie ?\r\nIch wei&szlig; was die abk&uuml;rzungen bedeuten nur welche items ich kaufen muss, dass wei&szlig; ich nicht.","replies":[{"poster":"Gang Hei","date":"2016-09-27T15:23:43.724+0000","up_votes":2,"down_votes":0,"body":"Magieresistenz hilft gegen magischen Schaden\nRüstung hilft gegen normalen Schaden\n\nWelche Art von Schaden du bei welchen Fähigkeiten erhälst, siehst du im Todesüberblick\n\nPS: Es gibt auch Skills welche magischen Schaden machen aber mit AD skalieren und umgekehrt. Grob kannst du aber darauf gehen, dass wenn ein Gegner AD kauft, du Rüstung kaufen solltest und bei AP, Magieresistenz\n\nGegen AP'ler mit viel CC holst du dir {{item:3102}} \nGegen AP'ler mit viel Poke holst du dir {{item:3065}} \nGegen AD'ler mit viel Krit holst du dir {{item:3143}} \nGegen AD'ler mit Mobility {{item:3742}} ","replies":[{"poster":"Numbbb","date":"2016-09-27T15:26:42.794+0000","up_votes":1,"down_votes":0,"body":"Vielen dank, jetzt habe ich einen Überblick :)","replies":[]}]},{"poster":"Actyc","date":"2016-09-28T11:51:23.952+0000","up_votes":1,"down_votes":0,"body":"Wenn dein Gegner auf AP baut kaufst du Magic Resist/Magieressistenz. Wenn er AD baut baust du Armor/Rüstung. Wenn du z.B. Fizz bist und gegen eine Ahri spielst und diese kills bekommst baust du: {{item:3001}}.","replies":[]},{"poster":"Nycaria","date":"2016-09-27T15:21:16.401+0000","up_votes":1,"down_votes":0,"body":"Gegen AD Gegner bringt dir Rüstung und Leben viel beispielsweise Dead Mans Plate , Randuins Omen oder für die Midlane Zhonyas.\n\nGegen AP Gegner bringt dir Magieresistenz und Leben viel beispielsweise Spirit Visage, Banshees oder für die Midlane Abyssal .\n\nDu kannst im Shop auch einfach alle Armor / MR Items anzeigen lassen :)","replies":[{"poster":"Numbbb","date":"2016-09-27T15:27:15.527+0000","up_votes":1,"down_votes":0,"body":"danke dir :)","replies":[{"poster":"Julian Chopper","date":"2016-09-27T16:11:08.612+0000","up_votes":1,"down_votes":0,"body":"Wenn die Gegner NUR Rüstung haben, dann kauf dir den Dornenpanzer. Wenn du z. B. Support spielst und die Gegner viel AP haben, dann kauf dir IMMER Solari.","replies":[{"poster":"TerrorRaven","date":"2016-09-27T17:46:53.869+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Julian Chopper,realm=EUW,application-id=Wj1wcocU,discussion-id=eor9QcPB,comment-id=000000000000,timestamp=2016-09-27T16:11:08.612+0000)\n>\n> Wenn die Gegner NUR AD haben, dann kauf dir den Dornenpanzer. Wenn du z. B. Support spielst und die Gegner viel AP haben, dann kauf dir IMMER Solari.\n\nFixed","replies":[]}]}]}]}]}