{"poster":"Bloshan","date":"2019-07-24T13:03:48.162+0000","title":"¿Con que necesidad?","subforum":"Charlas Generales","up_votes":7,"down_votes":0,"body":"Estaba jugando una ranked de supp y le estabamos dando una paliza, les dije que terminemos ya (estando en la base enemgia) porque pueden remontar, y la ashe me ponia nooo ajjaja que van a remontar y le dije que perfectamente pueden remontar, total, que estaba el nexo al descubierto voy a pegarle y como era nauti obvio no le pegaba nada entonces llamo a la ashe para que me ayude y que no que no se que, (estaban los 4 en baron y yo en al base enemiga) Habiamos hecho exterminio y todos los enemigos recien reaparecian en 50 seg. Nadie me ayudo, vinieron los enemigos y como ellos dijieron que estaban trolleando porque esta izi muerieron todos, nos tiraron toda la base el nexo y GG. Realmente no entiendo a esta gente con esa mentalidad, estoy en bronce 1 pero no entiendo como la gente no puede entender que mientras mas tardemos mas oro ellos van a ganar. Que necesidad habia de hacer ese baron cuando se podia terminar la partida, o que necesidad de trollear porque estaba izi?. Sinceramente no lo entiendo, y me da rabia porque yo sali re bien pero mi team a lo ultimo empezo a trollear porque estaba izi. Tan izi no estaba porque le hicieron exterminio","replies":[{"poster":"PasoPackXHonores","date":"2019-07-24T19:01:33.556+0000","up_votes":2,"down_votes":0,"body":"Pasa siempre. Los giles que se agrandan para humillar a los que van perdiendo. Ni te das una idea de cuantas partidas perdí por gente como esa.","replies":[]},{"poster":"Te voy a Trolear","date":"2019-07-24T18:26:52.079+0000","up_votes":2,"down_votes":0,"body":"te tocaron silvers comunes, alargan la partida para sentirse algo mejor con mas kills, pero cuando hay que jugar de verdad tienen miedo y te echan la culpa por sus errores :v","replies":[{"poster":"Bloshan","date":"2019-07-24T19:58:51.822+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Te voy a Trolear,realm=LAS,application-id=v7qsfXsE,discussion-id=XXtpGPGL,comment-id=0002,timestamp=2019-07-24T18:26:52.079+0000)\n>\n> te tocaron silvers comunes, alargan la partida para sentirse algo mejor con mas kills, pero cuando hay que jugar de verdad tienen miedo y te echan la culpa por sus errores :v\n\nSi, si xD. Lo peor es que soy bronce 1 y tengo pensamiento mas critico que ellos, osea porque alargar la partida sabiendo que van a hacer efecto snowball, van  a ganar oro, porque en el otro team habia una jinx, no importa que tan mal este de kda la jinx, si la dejas farmear tranquila se hace a todo el equipo. Que asco la gente esta xD","replies":[]}]},{"poster":"Bloshan","date":"2019-07-24T13:04:56.005+0000","up_votes":2,"down_votes":0,"body":"Me explique mal, la base tenia las dos torres y el nexo habia que drribar las dos torres y el nexo en 50 seg. que se podia","replies":[]},{"poster":"SeanFelices","date":"2019-07-24T15:43:35.808+0000","up_votes":1,"down_votes":0,"body":"Más allá de la mala decisión de tu equipo, en consecuencia, vos también tomaste una mala. Si tu equipo no te acompañó, suponiendo que conocés el daño de tu campeón, no deberías haber intentado finalizar. Nose si me explico.\n\nLo bueno es que ese pensamiento tuyo es el que marca pequeñas diferencias que harán que escales de a poco.\n\nSaludos .","replies":[{"poster":"Bloshan","date":"2019-07-24T16:51:49.019+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SeanFelices,realm=LAS,application-id=v7qsfXsE,discussion-id=XXtpGPGL,comment-id=0001,timestamp=2019-07-24T15:43:35.808+0000)\n>\n> Más allá de la mala decisión de tu equipo, en consecuencia, vos también tomaste una mala. Si tu equipo no te acompañó, suponiendo que conocés el daño de tu campeón, no deberías haber intentado finalizar. Nose si me explico.\n> \n> Lo bueno es que ese pensamiento tuyo es el que marca pequeñas diferencias que harán que escales de a poco.\n> \n> Saludos .\n\nClaro , lo que pasaba es que yo sabia que iban a hacer exterminio, entonces por mas del daño del campeon intente hacer algo pero ni pude. Pero el problema es que si mi team no hubiera estado trolleando en la ultima tf hubiramos ganado y terminado, pero bueno xD. Gracias. Lo que me pasa igual con bronce es que no es una liga que me presente dificultad alguna, es mas me parece super facil, hace 1 dia estaba en bronce 4 por posicionamiento (ayer fue el primer dia que juego rankeds luego de 3 años, osea, durante 3 años nunca me llamo atencion las rankeds, recien ahora empeze a jugarlas) y hoy estoy en bronce 1, yo creo que en plata se me va a complicar jaja","replies":[]}]}]}