{"poster":"Hopes Thief","date":"2016-05-30T03:17:33.901+0000","title":"A Full-time troll?","subforum":"Player Behaviour","up_votes":1,"down_votes":1,"body":"I&#039;m not sure if I&#039;m allowed to name and shame but to hell with it I&#039;m sick of finding people in ranked like this so if this gets exposure then its worth it.\n\n So recently I played with a player (THEruuster), now everything was fine, we went into champion select with a bit of healthy banter amongst the team and it was all no stress.\n\nBut, once we got into the game they decided to go to lane and die to the enemy ADC 3 times within the first 5 minutes, when asked to play more defensive they cracked it demanded an apology and said they would throw.\n\nfast track to the end of the game (we tried to keep it going for about 35 minutes but the other team were just to fed as a result of this player)\nand we all report them but after looking at their match history, they have done this in 11 games (could be 12-13 but it looked like they just had bad games for 2 of them) over the past 4 days, how can a player get away with this? no punishments, no mutes, bans, no action from Riot in anyway.\n\nIn the past 4 days alone this player has had a negative impact on 99 other summoners. . . 99 other people have had this highly toxic and abusive player and there has been nothing done about it, how as a player am I supposed to have faith that the company are trying clean up Oce as a sever when there are still players who are getting away with it.\n\nhere is a link to their history...\n\nhttp://oce.op.gg/summoner/userName=theruuster","replies":[{"poster":"Dracuula","date":"2016-05-30T12:07:53.773+0000","up_votes":1,"down_votes":0,"body":"Tbh it makes me sick knowing his Silver 5 and I'm bronze 2 and play alot better than he does. :3","replies":[]},{"poster":"Roguestoney","date":"2016-05-30T11:27:11.440+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hopes  Thief,realm=OCE,application-id=T8eq2lFQ,discussion-id=K7uwJp5J,comment-id=,timestamp=2016-05-30T03:17:33.901+0000)\n>\n> I'm not sure if I'm allowed to name and shame.\n\nNo.","replies":[]}]}