{"poster":"AquariusGine","date":"2018-05-14T11:11:33.921+0000","title":"Change Kindred's name to Lamb","subforum":"Story, Art, & Sound","up_votes":12,"down_votes":7,"body":"Ya&#039;ll know why. {{sticker:slayer-pantheon-popcorn}}\n\nEverything about Kindred revolves around Lamb. Even the ultimate is called Lamb's Respite.\n\nHeck, many people refer to Kindred as ''her''.\n\n# #reworkKindredtoBeMoreThematicallySatisfying","replies":[{"poster":"Star Guardían","date":"2018-05-14T11:18:24.373+0000","up_votes":20,"down_votes":0,"body":"A better alternative would be to rework Kindred so that Wolf and Lamb are equally represented in their kit and visual design. I don't see that happening anytime soon since they are relatively \"new\" and there are other champs who need VGUs more desperately. Maybe something along the lines of Aatrox's gameplay rework with a few model tweaks would be appropriate, but even then, Aatrox is 5 years old and Kindred is only 3 years old.","replies":[{"poster":"QMighty","date":"2018-05-17T15:08:47.072+0000","up_votes":2,"down_votes":0,"body":"holy crap I can't believe Aatrox is 5 years old already.  Now I feel old...","replies":[{"poster":"Star Guardían","date":"2018-05-17T17:59:40.067+0000","up_votes":1,"down_votes":0,"body":"Same here man. I every champ after Elise (which is when I started playing) feels \"new\" to me. For instance, I forget that Azir and Gnar were released before the new Summoner's Rift even though they still feel \"modern\" to me.","replies":[{"poster":"QMighty","date":"2018-05-18T22:59:16.858+0000","up_votes":1,"down_votes":0,"body":"Same for me, except about Quinn.  She was the first new champ I saw.  It's gonna be weird for me when they start price reducing champions that I saw the release of... almost as weird as them getting VGU's!","replies":[]}]}]},{"poster":"Eternal791","date":"2018-05-15T02:16:21.506+0000","up_votes":3,"down_votes":1,"body":"I could see Kindred working as a transformation champ.","replies":[{"poster":"Star Guardían","date":"2018-05-17T18:13:37.942+0000","up_votes":1,"down_votes":0,"body":"Same. In fact, when Kindred was being teased, I was hyped that we'd get another transforming champion since we hadn't had one since Quinn or Jayce (If you don't count Quinn/Valor). All the Kindred teasers were hinting at a duality so I really thought it'd be and R transformation champ like Mid or Jayce. I can understand Riot wanting to try something new and to be fair they did end up successfully creating a new way to express a duality in a champion with Kayn/Rhaast.  However, as it stands, Wolf doesn't have autonomy. He's like a particle effect with a bit of a personality. He's like a fancier version of Lulu's pix or SG Ahri's Kiko. In fact, he's seems like less of an individual character than Tibbers or Willump (Maybe even Skarl) imo.","replies":[]}]}]},{"poster":"FauxSchizzle","date":"2018-05-14T18:32:05.542+0000","up_votes":10,"down_votes":0,"body":"Fun fact, we almost, ALMOST named them \"Kindred, the Lamb and the Wolf\" instead of \"Kindred, the Eternal Hunters\"","replies":[{"poster":"KZ Engel","date":"2018-05-15T21:30:59.167+0000","up_votes":3,"down_votes":0,"body":"that would've been like naming darius \"darius, the angry yelling axe man\"","replies":[{"poster":"FauxSchizzle","date":"2018-05-15T22:22:02.009+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=KZ Engel,realm=NA,application-id=6kFXY1kR,discussion-id=H68LymtE,comment-id=00030001,timestamp=2018-05-15T21:30:59.167+0000)\n>\n> that would&#x27;ve been like naming darius &quot;darius, the angry yelling axe man&quot;\n\nI think it sounded like the title of a fairytale. \n\nI have been known to be wrong.","replies":[{"poster":"KZ Engel","date":"2018-05-15T22:25:14.269+0000","up_votes":6,"down_votes":0,"body":"{{champion:141}} the man and the farm equipment","replies":[]},{"poster":"Star Guardían","date":"2018-05-17T18:01:52.291+0000","up_votes":1,"down_votes":0,"body":"It does sound like a fairytale title which would be good for a short story title, but it doesn't work for a champion title imo. I'm glad you went with the Eternal Hunters.","replies":[]}]},{"poster":"Hexs Fortune","date":"2018-05-16T00:26:28.739+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KZ Engel,realm=NA,application-id=6kFXY1kR,discussion-id=H68LymtE,comment-id=00030001,timestamp=2018-05-15T21:30:59.167+0000)\n>\n> that would&#x27;ve been like naming darius &quot;darius, the angry yelling axe man&quot;\n\nI thought {{champion:14}} was the angry yelling axe guy\n\nCooooooowaaaaaards","replies":[{"poster":"KZ Engel","date":"2018-05-16T00:36:23.232+0000","up_votes":2,"down_votes":0,"body":"https://i.imgur.com/2w63Kwp.png[]","replies":[{"poster":"Hexs Fortune","date":"2018-05-16T00:56:47.060+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=KZ Engel,realm=NA,application-id=6kFXY1kR,discussion-id=H68LymtE,comment-id=0003000100010000,timestamp=2018-05-16T00:36:23.232+0000)\n>\n> https://i.imgur.com/2w63Kwp.png[]\n\n\nhttps://news-a.akamaihd.net/public/images/pages/sio/img/sio-e.png","replies":[{"poster":"Kanzler","date":"2018-05-16T18:15:51.352+0000","up_votes":1,"down_votes":0,"body":"{{champion:142}}","replies":[]},{"poster":"Häxel","date":"2018-05-16T11:30:09.579+0000","up_votes":1,"down_votes":0,"body":"i always saw it like Darius beeing Sions Succesor as a General (fist of noxus) and Draven being Urgots Succesor as an executioner. \n\nWell both Sion and Urgot got reworked and so lorewise Sion got awakend again by Swain, lb and the Red Rose as even if he is a destruction amchine he tended to be loyal to whoever rules Noxus.\nAnd Urgot got banished/betrayed as Swain saw him not to be controlable and dangerous and he also found in Draven an easier to handle executioner but Urgot used this to rise in Zhaun and i think he plans to come back to Noxus to clean things up.","replies":[]}]}]},{"poster":"Star Guardían","date":"2018-05-17T18:14:39.906+0000","up_votes":1,"down_votes":0,"body":"Nah, he goes by Angry Yelling **Dead** Axe Man.","replies":[]}]},{"poster":"QMighty","date":"2018-05-17T15:06:20.580+0000","up_votes":3,"down_votes":0,"body":"Petition to change Darius's title to \"the Angry Yelling Axe Man\"","replies":[{"poster":"Star Guardían","date":"2018-05-17T18:18:47.455+0000","up_votes":2,"down_votes":0,"body":"They should totally do this in like a comic or something where Draven is getting on Darius' nerve whilst on a mission. I can see Draven saying \"Whatever you say, angry yelling axe man.\" as he reluctantly and nonchalantly complies to Darius' directions.\n\n{{sticker:darius-angry}}","replies":[]}]}]},{"poster":"Fasmodey","date":"2018-05-14T18:33:56.958+0000","up_votes":7,"down_votes":1,"body":"Good decision. First one is super bad.","replies":[]},{"poster":"Valor Bot","date":"2018-05-15T21:52:59.787+0000","up_votes":1,"down_votes":0,"body":"Faux! I know this probably isn't your department or area of expertise, but would there be any way you could talk to a Rioter or two about the possibility of renaming \"Quinn\" back to \"Quinn and Valor\" like she was on the PBE during her release? According to Morello, the reason they had to shorten the champion's name originally was due to it being several words in length (source linked below):\n\nhttps://www.reddit.com/r/leagueoflegends/comments/18ys5s/quinn_and_valor_ama/c8jvue5/\n\nHowever, we now have champions in the game with multi-word names, such as Tahm Kench, which means this probably wouldn't be much of an issue anymore. If there's any chance you could look into this on behalf of all Quinn (and Valor) enthusiasts, I'd greatly appreciate it!!","replies":[]}]},{"poster":"GreenLore","date":"2018-05-14T14:06:41.231+0000","up_votes":5,"down_votes":1,"body":"> Even the ultimate is called Lamb's Respite\n\n\nAnd the W is called \"Wolfs frenzy\",while the passive and E use both characters.","replies":[]},{"poster":"sKz Aaron D","date":"2018-05-14T22:25:34.591+0000","up_votes":2,"down_votes":0,"body":"I was talking about this with a couple of friends, we agreed that it felt like 90% of Kindred was Lamb. It's like Wolf is simply W. That's it. It doesn't feel like Wolf is doing anything else.","replies":[]},{"poster":"OurLestrade","date":"2018-05-14T11:20:17.817+0000","up_votes":3,"down_votes":1,"body":"I remember when Quinn was called Quinn & Valor to try and reinforce the whole multi champion thing. One of these days they'll make a multi character champion work.","replies":[{"poster":"Mhihnj","date":"2018-05-14T18:59:53.295+0000","up_votes":3,"down_votes":1,"body":"Kled and skaarl work well  along with kayn and rhaast.","replies":[{"poster":"Spencer","date":"2018-05-14T23:00:33.321+0000","up_votes":1,"down_votes":0,"body":"Kayn and Rhaast is just Kayn A and Kayn B.\n\nKled and Skaarl almost work, but it still mostly just feels like Kled and worse Kled.","replies":[]}]},{"poster":"QMighty","date":"2018-05-17T15:09:07.969+0000","up_votes":1,"down_votes":0,"body":"Fingers crossed for Nunu & Willump","replies":[]}]},{"poster":"Draw Blank","date":"2018-05-16T18:01:53.195+0000","up_votes":1,"down_votes":0,"body":"I agree due to the other examples like Kled and Quinn but Lamb just isn't a good name","replies":[]},{"poster":"Battalion","date":"2018-05-16T14:11:31.528+0000","up_votes":1,"down_votes":0,"body":"I would dislike it if they reworked the champion kit. It's a well done kit, however it's been watered down. I pretty much play nothing but {{champion:203}}  (and Swain, but I suck at him....I envy his coat D: ). If Riot changed up their kit I would be very upset, though I do wish they'd go back to % HP passive.","replies":[]},{"poster":"TheGreatRasputin","date":"2018-05-15T21:29:57.811+0000","up_votes":1,"down_votes":0,"body":"*Y'all.","replies":[]},{"poster":"Toppien","date":"2018-05-14T19:58:34.900+0000","up_votes":1,"down_votes":0,"body":"they should make us swich between lamb and wolf, you get melee skills as wolf and lamb follows you offering light ranged support","replies":[{"poster":"KZ Engel","date":"2018-05-15T21:32:51.360+0000","up_votes":1,"down_votes":2,"body":"we really do already have quite enough melee/ranged stance dancers. it isn't a unique thing anymore\n\n{{champion:60}} {{champion:76}} {{champion:126}}","replies":[]}]},{"poster":"Wínters Dawn","date":"2018-05-16T18:33:50.927+0000","up_votes":1,"down_votes":2,"body":"Believe it or not lore and gameplay dont have to line up 100%  \nKindred main since she, ya she, hit the beta. I refer to kindred as she because in game you do play as lamb. Does it bother me that her lore and gameplay isnt 100% synced. No because why would I? Such a petty ass thing to get worked up over.","replies":[]}]}