{"poster":"Qiqihar Xian","date":"2015-03-19T16:35:46.519+0000","title":"LP Verlieren während ranked sperre","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":2,"body":"Ist der Lp verlust aktiv, so dass Riot mich zwingt diese Spiele in time zu spielen oder nicht?","replies":[{"poster":"Avorox","date":"2015-03-19T16:47:11.707+0000","up_votes":2,"down_votes":0,"body":"Natürlich ist er aktiv. Es ist schließlich eine Strafe, warum solltest du also einen Vorteil dadurch erhalten?","replies":[]},{"poster":"Qiqihar Xian","date":"2015-03-19T16:53:04.680+0000","up_votes":1,"down_votes":2,"body":"Weil Riot mich nicht verhindern lässt LP zu verlieren. Sie zwingen dich also in einem Monat die Zahl X an Spielen zu spielen. Finde das persönlich eher undurchdacht, wenn man Leuten auch noch Druck überguibt die Spiele zu spielen. Das verändert das Verhalten der Spieler nicht langfristig.","replies":[{"poster":"Madchickendinner","date":"2015-03-19T17:18:24.948+0000","up_votes":2,"down_votes":1,"body":"MAn sollte halt vorher drüber nachdenken welche Auswirkung das flamen haben kann.","replies":[{"poster":"Qiqihar Xian","date":"2015-03-19T17:40:00.029+0000","up_votes":2,"down_votes":3,"body":"Darum gehts im overall nicht. Toxic zu sein ist eine Sache, mich hat auch nur interessiert, ob es aktiv ist oder nicht. Finde die rankedsperren an sich sinnlos, die Chatsperren dafür umso mehr. Man sollte Leuten den Chat halt komplett abstellen und diese Funktion auch in das Spiel einstellen lassen.","replies":[{"poster":"eingew","date":"2015-03-19T17:45:51.255+0000","up_votes":1,"down_votes":0,"body":"Wieso sollte man den Leuten den Chat komplett abstellen lassen? Du sollst dich während der Sperre verbessern können. Das geht ohne Nachrichten nunmal nicht.\n\nUnd wieso sind RR schlecht?\n\nUnd wieso solltest du den Chat ganz abstellen können? Es zwingt dich niemand etwas zu schreiben... und wenn dich die Nachrichten stören: Chat kleiner Stellen und aus dem Bild schieben.","replies":[{"poster":"hshtagniemehrcdu","date":"2015-03-19T19:16:32.224+0000","up_votes":2,"down_votes":1,"body":"Was man zb. machen könnte: 10% der CR-Spiele ist der Chat komplett deaktiviert.\nBei 50 Spielen z.b. sind das die ersten 5 Spiele ohne Chat, in welchen der Spieler lernen kann, dass es auch ohne Chatten geht.\nWährend der restlichen 45 Spiele kann er sich immer noch aktiv verbessern.\n\nAlternativ könnte das auch erst bei schlimmen Fällen, wie z.b. 100+ CR eintreten, sodass die Spieler mit geringer, und  vermutlicher einziger CR, nicht betroffen sind.","replies":[{"poster":"Temudschinn","date":"2015-03-20T08:12:09.380+0000","up_votes":1,"down_votes":0,"body":"Und was BRINGT das? Also, ausser nichts? Was für Vorteile hat es, wenn ein CR Spieler erstmal 5 Spiele lang gar keinen Chat hat?","replies":[{"poster":"hshtagniemehrcdu","date":"2015-03-20T10:43:51.392+0000","up_votes":1,"down_votes":0,"body":"Das habe ich im Post oben bereits geschrieben.\nDer Spieler lernt, dass die Nutzung des Chats nicht zwingend notwendig ist.\nAuch mit nur 3 Nachrichten zu Beginn des Spieles kann man immer noch Flamen, immer noch ausfallend werden.\nGerade bei Spielern mit einer sehr hohen Anzahl an CR ist das durchaus wahrscheinlich, denke ich.\nAlleine durch eine CR hören Extremfälle wohl kaum von einem Tag auf den anderen auf, zu Flamen.\nEine Besserung tritt nicht zwangsweise ein, durch komplett Abschaltung des Chats jedoch schon.\nDer Spieler merkt ggf. den Unterschied zwischen Spielen, wo er flamt, und wo er die Schnauze hält.\nDie Möglichkeit, sich aktiv zu verbessern, gibt es danach immer noch.\n\nEs ist eine Verschäräfung d Strafe für Lernresistente, die die Möglichkeit, sich zu bessern, nicht vermindert.","replies":[]}]}]}]}]}]},{"poster":"eingew","date":"2015-03-19T17:26:46.622+0000","up_votes":1,"down_votes":0,"body":"Wieso ist das undurchdacht? Angenommen ich bin Dia 1 brauche ich nur schön fies zu sein, solange ich es nicht übertreibe werde ich nicht mehr absteigen können bis zum Ende des Season.  (Und nicht gebannt werden, man muss eben die Waage halten.","replies":[{"poster":"Qiqihar Xian","date":"2015-03-19T17:38:39.642+0000","up_votes":1,"down_votes":1,"body":"Man bekommt mit der Sperre ja keine Rewards dafür. Ich erkenne dann den Sinn daran nicht.","replies":[{"poster":"eingew","date":"2015-03-19T17:43:21.452+0000","up_votes":1,"down_votes":0,"body":"Das ist nicht ganz richtig. Das wurde letzte Season so durchgeführt, ja, das lag aber daran, dass die Leute ohne Rewards normalerweise vermutlich einen Perma bekommen hätten und da sie, weil das Tribunal down war, dieses mal keinen bekommen konnten wurden die Rewards an sie nicht ausgeteilt.\n\nUnd selbst wenn dem nicht so wäre: Die Rewards wurden nur an die fiesen Leute mit CR nicht verteilt, wer sich also relativ weit unten befand, der hat diese trotzdem erhalten... wenn ich es also schaffe >100 CR zu bleiben, dann würde ich trotzdem meine Rewards bekommen.","replies":[]}]}]}]}]}