{"poster":"WarWork","date":"2018-03-12T03:37:31.136+0000","title":"Hey lore team, A bestiary maybe?","subforum":"Story, Art, & Sound","up_votes":42,"down_votes":0,"body":"Will we ever get a bestiary for the creatures of runeterra? The lore makes a lot of comparisons and mentions of many creatures and would love to know more about them and even have some art to see what they look like.","replies":[{"poster":"Kindlejack","date":"2018-03-12T16:57:11.440+0000","up_votes":36,"down_votes":0,"body":"I can in no way guarantee anything, and I wouldn't want to because it's not my team, but there is a whole range of creatures that have been designed by Foundations for Runeterra's various biomes. I hope some day we get to share all that with you.\n\nThey are very useful when designing things as we can get a real feel for the world around characters and available materials etc. For example Zoe's scarf is knitted from the wool of an Erbok which is kind of like a mountain-goat crossed with a unicorn.","replies":[{"poster":"TwitchInMyPants","date":"2018-03-12T17:07:47.427+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Kindlejack,realm=NA,application-id=6kFXY1kR,discussion-id=wP5vx092,comment-id=0008,timestamp=2018-03-12T16:57:11.440+0000)\n>\n> I can in no way guarantee anything, and I wouldn&#x27;t want to because it&#x27;s not my team, but there is a whole range of creatures that have been designed by Foundations for Runeterra&#x27;s various biomes. I hope some day we get to share all that with you.\n> \n> They are very useful when designing things as we can get a real feel for the world around characters and available materials etc. For example Zoe&#x27;s scarf is knitted from the wool of an Erbok which is kind of like a mountain-goat crossed with a unicorn.\n\nHonestly even if you don't get a full bestiary an article on Runeterran creatures would be interesting\n\nIts easier to get into the lore if there's more to explore than just the champions, the more it feels like an actual world the more engaging it is","replies":[]}]},{"poster":"Whyte Lyon","date":"2018-03-12T03:51:39.043+0000","up_votes":19,"down_votes":0,"body":"Was going to make this into a trivia thread on another day, but might as well share it here and now. The only unfortunate is a lot of these creatures have no detail behind their names, so i either dont know what it exactly is or just assume what i think it might be. It also doesn't help when every other beast is classified as \"tusk\" this or \"razor\" that.\n\nWIP list.\n● **Drakehounds**, are a distant relative of dragons. They're kept by some rich, and perhaps foolish Noxians as pets.\n\n● **Silverwing Raptors**, are griffin-esque creatures native to the rocky crags of northern Demacia. Only a few individuals have been known to befriend and ride these beasts.\n\n● The **Brackern**, a race of enormous, crystal-bodied scorpions, slumbering in the sands beneath a hidden valley in Shurima.\n\n● The **Worax** is a large heard of animal found in Ionia. They are described as goat-like buffelo.\n\n● The **Basilisks** of the Kumungu are sometimes raised from eggs as Noxian war beasts.\n\n● **Drakolops**, immortal and inkillable wind spirits that embody the desolation of the Noxian Plains. \n\n● **Dragons** have various elemental powers, with infernal dragons, mountain dragons, ocean dragons and cloud dragons counting among the various breeds. \n\n● **Crag Beasts** are large boar-like creatures, adorn with tusks and sharp fangs. Their outer shell is protected by a thick layer of rock hard skin which defends them from swords, spares and other weapons.\n\n● **Ursine** are half bear abominations, men twisted into other shapes by their efforts to please Volibear. They&apos;re simple, fierce and quick to anger.\n\n● **Argoth** are not enormous creatures; fighting one alone would be easy enough, but not in large numbers. They are subject to the dominating will of the hive queen, able to move and fight as one vicious unit. \n\n● **Poros (?)** \"Cute fluff balls, with abnormally large tongues, but that's about all we know really.\" \n\n● **Trolls (?)** Extremely tall and bulbous creatures. Not known for any measure of intelligence. \"Not a lot else to go off of sadly, all I can assume is they work and operate like most troll creatures in fiction.\"\n\n● **Minotaurs** (?)\n\n● **Vellox (?)** \"Some type of chimeric animal with dappled golden fur and an eerily human face. It's capable of spiting venom too.\"\n\n● **Grelmorn (?)**\n\n● **Yeti (?)**\n\n● **Drüvask** \"Sejuani's tusked hog.\"\n\n● **Carnotaun (?)**\n\n● **Razorhide (?)**\n\n● **Croxagor (?)** \n\n● **Shadow Bears** \"Honestly I have no context to what makes these bears different from ordinary ones, except that it has the title &quot;shadow&quot; tacked on for no discernable reason and Tibbers is meant to emulate one.\"\n\n● **Vulkodalk** is a terrifying apex predator from the wilds of Ionia. This monster is tall, lizard-like and has a dozen eyes. \n\n● The **Dormun** beasts are enormous creatures that wander the Shurima wastes. So large, some nomad tribes have created entire towns upon their backs.\n\n● **Ralsiji** \"idk what to say they're like what if a Camel had long and skinny legs like a Giraffe.\" \n\n● The **Tuskvore** is a predatory killer from the Demacian hinterlands known for its thick hide, long razorhorns that crown its head and a ferocious temperament.\n\n● When the **Razorfin Rats** of Bilgewater gather in great swarms, they can devour a grown adult in minutes due to their Shark-like maw.","replies":[{"poster":"Tesla Effect","date":"2018-03-12T08:52:22.427+0000","up_votes":2,"down_votes":0,"body":"Love these lists, keep em coming.","replies":[]},{"poster":"Galiö","date":"2018-03-12T13:38:10.898+0000","up_votes":2,"down_votes":1,"body":"Doesn't demacia have wyverns? And people that ride wyverns?","replies":[{"poster":"DarkSoul1994","date":"2018-03-14T03:16:08.756+0000","up_votes":1,"down_votes":2,"body":"No. Demacians are dragonslayers.","replies":[{"poster":"Galiö","date":"2018-03-14T13:46:03.870+0000","up_votes":1,"down_votes":0,"body":"\"When Demacian knights rode to war,” says Lonewingy, “they were protected by the anti-magical properties emitting from the statue.” With this aura in place, few could throw the Knights from their mounts, the legendary ebony wyverns. Thus, the sculptor Durand specifically designed Galio to look like a chimeric combination of knights and wyverns, to signify the unity of Demacian warrior and beast.","replies":[]}]}]},{"poster":"Valor Bot","date":"2018-03-12T21:00:54.473+0000","up_votes":1,"down_votes":0,"body":"I think you might be missing one...\n\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Whyte Lyon","date":"2018-03-12T22:16:45.054+0000","up_votes":1,"down_votes":0,"body":"Considering that the above is just a comment post in someone else's thread, I figured it would be best to keep the list around 20 creatures, as it would be rude to draw too much away from OP's thread. Plus it would make sense to have the full list into it's own thread, so it's intentional that some creatures aren't documented above.","replies":[]}]}]},{"poster":"SamBunzly","date":"2018-03-12T16:36:21.210+0000","up_votes":6,"down_votes":0,"body":"Surprise. Every creature in Runeterra is a Poro in disguise. \n\n~~whoops~~","replies":[{"poster":"CasterGilgamesh","date":"2018-03-12T23:42:57.353+0000","up_votes":1,"down_votes":0,"body":"lol every creature in Runeterra would just be poros in costumes poros would be masters of cosplay ","replies":[]},{"poster":"Mama Soraka","date":"2018-03-12T17:41:51.730+0000","up_votes":1,"down_votes":0,"body":"I think you meant two poros in a trench coat","replies":[]}]},{"poster":"Tesla Effect","date":"2018-03-13T17:11:31.851+0000","up_votes":1,"down_votes":0,"body":"We have  a serious lack of plants and any descriptions of them. I was so stoked when I saw some images of them in the Vastaya story, but thats about it. We just need more of them. Specially some info on the Petricite trees of Demacia, or if Honey Fruit is canon, or that all the Rift fruit are canon and have locations in the world.","replies":[{"poster":"Bioluminescence","date":"2018-03-13T17:46:31.721+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Tesla Effect,realm=NA,application-id=6kFXY1kR,discussion-id=wP5vx092,comment-id=000c,timestamp=2018-03-13T17:11:31.851+0000)\n>\n> We have  a serious lack of plants and any descriptions of them. I was so stoked when I saw some images of them in the Vastaya story, but thats about it. We just need more of them. Specially some info on the Petricite trees of Demacia, or if Honey Fruit is canon, or that all the Rift fruit are canon and have locations in the world.\n\nIt's not much, but may I direct you to the illustrations on the [Medarda Heirloom](https://na.leagueoflegends.com/en/featured/piltover/medarda-heirloom)?  You should be able to find naaps, nirpooti fruits, and how honey fruit is harvested, at the very least.  Also, no illustration, but the name Medicila Elastica also refers to a plant.","replies":[{"poster":"Tesla Effect","date":"2018-03-13T18:17:29.902+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bioluminescence,realm=NA,application-id=6kFXY1kR,discussion-id=wP5vx092,comment-id=000c0000,timestamp=2018-03-13T17:46:31.721+0000)\n>\n> It&#x27;s not much, but may I direct you to the illustrations on the [Medarda Heirloom](https://na.leagueoflegends.com/en/featured/piltover/medarda-heirloom)?  You should be able to find naaps, nirpooti fruits, and how honey fruit is harvested, at the very least.  Also, no illustration, but the name Medicila Elastica also refers to a plant.\n\nMy interpretation of Health Potions is that they are the  juice extracted from Honeyfruits, thats why they can heal you.","replies":[]}]}]},{"poster":"6Sfool","date":"2018-03-12T13:16:59.778+0000","up_votes":4,"down_votes":0,"body":"That's almost a necessity.  Whenever I read the stories and they go on some huge tangent about the flora and fauna I'm just like \"what the fuck are they talking about?\"  It would make so much more sense if I knew that these creatures existed canonically outside of one convoluted paragraph.","replies":[]},{"poster":"Nylisa","date":"2018-03-12T08:45:12.210+0000","up_votes":4,"down_votes":1,"body":"A region like Freljord or Ionia? countless possibilities of strange magical and non-magical creatures!\n\nThis would be an amazing read and it doesn't need to be long. art team is aleady doing a great job showing concepts of different creatures and three maybe four lines explanation about each of them will do! it helps greatly in building the enviroment, along side scenery and culture of each region.","replies":[]},{"poster":"Yara0","date":"2018-03-12T21:20:42.824+0000","up_votes":2,"down_votes":0,"body":"I would go out of my way to buy a physical copy of a bestiary from Leagues universe.","replies":[]},{"poster":"Ifneth","date":"2018-03-12T15:57:12.149+0000","up_votes":2,"down_votes":0,"body":"Yes!  We should have a new Heimerdinger skin, Zoologist Heimerdinger, in whose tone the bestiary is written and which is pictured in many of the photographs in the bestiary.  Petting cute little creatures, running from scary creatures, shown by big creatures to give them some scale...","replies":[]},{"poster":"Jofeyy","date":"2018-03-12T15:47:10.543+0000","up_votes":2,"down_votes":0,"body":"Ohhh I love bestiaries. This would be so good.","replies":[]},{"poster":"Digielf","date":"2018-03-14T11:54:37.100+0000","up_votes":1,"down_votes":0,"body":"And also which ''beast'' races have cross-bred with humans for example {{champion:107}} x{{champion:76}}  or {{champion:17}} x{{champion:55}}","replies":[{"poster":"GreenLore","date":"2018-03-14T14:45:28.589+0000","up_votes":1,"down_votes":0,"body":"Well Nidalee is almost certainly a vastaya shapeshifter,meaning that one of her parents would be a vastaya,while the other one would be human.\n\nAnd considering that she can transform into a cougar,it would actually make sense for one of her parents to be a kiilash,meaning that she'd be half Kiilash anyway.","replies":[{"poster":"Tesla Effect","date":"2018-03-14T14:49:03.031+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GreenLore,realm=EUW,application-id=6kFXY1kR,discussion-id=wP5vx092,comment-id=000d0000,timestamp=2018-03-14T14:45:28.589+0000)\n>\n> Well Nidalee is almost certainly a vastaya shapeshifter,meaning that one of her parents would be a vastaya,while the other one would be human.\n> \n> And considering that she can transform into a cougar,it would actually make sense for one of her parents to be a kiilash,meaning that she&#x27;d be half Kiilash anyway.\n\nAnd if Kumungu is located on the Southern Continent east of Shurima like the Kiilash are, then that could hold true.","replies":[]}]}]},{"poster":"CasterGilgamesh","date":"2018-03-12T23:42:03.976+0000","up_votes":1,"down_votes":0,"body":"sounds like a really cool and maybe fun thing for them to do","replies":[]},{"poster":"Aerial Queen Liz","date":"2018-03-12T16:05:03.133+0000","up_votes":1,"down_votes":0,"body":"That sounds really cool.","replies":[]},{"poster":"Darius Strada","date":"2018-03-12T14:12:52.472+0000","up_votes":1,"down_votes":0,"body":"You mean a Pokedex?","replies":[]},{"poster":"rtbf225618241","date":"2018-03-13T15:31:18.970+0000","up_votes":1,"down_votes":1,"body":"I thought \"Bestiary\" was something sexual lol.","replies":[]}]}