{"poster":"Ruxoma","date":"2018-07-17T16:02:01.681+0000","title":"Los nuevos campeones o reworks de riot.","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Esto va a ser corto, pero &uacute;nicamente vengo a expresar que me cansa que ahora las campeonas femeninas son todas hermosas ebonys con hermosos cuerpos, hermosas caras y movimientos delicados. Que pas&oacute; con Irelia {{champion:39}} ? Le sacaron todo el aspecto de guerrera y el fisico no tan fantasioso, ahora parece una bailarina de Shen Yun.\n\nMe puse a escribir esto por el rework de Akali {{champion:84}} , por que ahora parece una rapera callejera (Ojo no tengo nada en contra de las raperas)toda sensual? Body Shape a lo m&aacute;ximo. Pero solo digo que con los nuevos aspectos de los campeones pierden el sentido de su lore. Los cambios de las habilidades est&aacute;n buenos mayormente, solo discuto por el aspecto. Amaba a la antigua Irelia, era m&aacute;s c&oacute;modo jugar con ella. Yo creo que no soy el &uacute;nico invocador que se siente c&oacute;modo con el aspecto de los campeones, sus habilidades e interacciones. Voto porque hayan mas campeones como illaoi xD\n  {{sticker:sona-playing}} \n\n\nLos invito a darme su opini&oacute;n, tal vez estoy equivocada. Seguro hay alguien que piense distinto. Comenten sin flamear &lt;3\n\nSi esta discusi&oacute;n se pone fuerte yo huyo (? {{summoner:4}} \n\n\n\n                                                                                                                                                     Love you, Ruxoma {{champion:267}}","replies":[{"poster":"Bot Murloc","date":"2018-07-17T16:29:55.145+0000","up_votes":1,"down_votes":0,"body":"El de akali quedó bien, tiene todo el aspecto de un ninja y en el tráiler dice q abandono el kin kou o algo así se escribía, no tiene q parecerse necesariamente a Shen o kennen, lo q muestra ahí es una akali rebelde, o furtiva como decía en el tráiler. Pero el de irelia te doy la razón, no sólo por q odio y odiaba a ese champ, sino por q es bastante exagerado el rasgo q decidieron ponerle","replies":[{"poster":"Ruxoma","date":"2018-07-17T16:32:56.767+0000","up_votes":3,"down_votes":0,"body":"Hmmm, no le había prestado atención gracias. Igual si creo que esta un poquito exagerado, solo un poquito {{sticker:sg-ahri-2}}","replies":[{"poster":"Bot Murloc","date":"2018-07-17T16:35:40.740+0000","up_votes":1,"down_votes":0,"body":"Pero hay algo q me disgusta muchísimo de este rework...\nYo quiero jugar con akali, no con un Naruto con tetas","replies":[{"poster":"20th CenturyBoys","date":"2018-07-17T23:30:01.178+0000","up_votes":1,"down_votes":0,"body":"no se, le nerfearon las tetas en todos los skins","replies":[]}]}]}]},{"poster":"rokushoger","date":"2018-07-17T16:27:02.730+0000","up_votes":2,"down_votes":0,"body":"Coincido que hace falta otro tipo de campeonas. Pero bueno, es cierto que lol está enfocado hacia cierto sector de gente, y ese cierto sector de gente prefiere este tipo de campeonas. Y bueno, Riot no es una beneficencia y si puede ganar más, va a ganar más.","replies":[{"poster":"Ruxoma","date":"2018-07-17T16:30:39.476+0000","up_votes":2,"down_votes":0,"body":"Buen punto {{champion:28}}","replies":[]},{"poster":"20th CenturyBoys","date":"2018-07-17T23:30:31.041+0000","up_votes":1,"down_votes":0,"body":"annie, lulu, zoe, tristana, poppy","replies":[{"poster":"rokushoger","date":"2018-07-19T10:48:06.053+0000","up_votes":1,"down_votes":0,"body":"Me refería a mujeres maduras menos esculturales. Annie y zoe son niñas, y las otras tres son otra raza.","replies":[{"poster":"20th CenturyBoys","date":"2018-07-19T12:19:36.563+0000","up_votes":1,"down_votes":0,"body":"\"(...)es cierto que lol está enfocado hacia cierto sector de gente\" {{item:2050}}","replies":[{"poster":"rokushoger","date":"2018-07-19T13:50:10.180+0000","up_votes":1,"down_votes":0,"body":"Claramente, por eso hacen falta. No lo van a hacer, pero no cambia que hacen falta XD.","replies":[]}]}]}]}]},{"poster":"20th CenturyBoys","date":"2018-07-17T23:28:22.642+0000","up_votes":1,"down_votes":0,"body":"bueno, teniendo en cuenta que es una adolescente o joven adulta japonesa con entrenamiento ninja en su etapa de rebeldia, se puede justificar que tenga tatuajes representativos (que eran bastante comunes en los ninjas y japon en general, y aun lo son dentro de la yakuza)\n\nretomando eso, tiene un cuerpo \"delicado\" porque entrena a diario, y si tuviera el fisico de ilolai no podria moverse a esa velocidad. es como el meme de \"tiene ese cuerpo por genetica\" y en la proxima viñeta salen las bullys comiendo y la bullyneada ejercitandose para conseguir el fisico que le estan criticando","replies":[]},{"poster":"Paradisco","date":"2018-07-17T22:02:20.492+0000","up_votes":1,"down_votes":0,"body":"Si el 90% aproximadamente (asumo, no sé la verdad) de tus jugadores son hombres, vos qué harías?","replies":[{"poster":"Ruxoma","date":"2018-07-17T22:26:47.473+0000","up_votes":1,"down_votes":0,"body":"Bien dicho {{sticker:zombie-brand-clap}}","replies":[]}]},{"poster":"Wuachonazooo","date":"2018-07-17T17:26:00.142+0000","up_votes":1,"down_votes":0,"body":"No creo, según su ofició , procedencia, y tematica que se le quiera dar a un personaje. Es normal que algunas campeonas tengan un buen cuerpo y hermosas caras a otras que presentan todo lo contrario ejemplo: illaoi. Tambien al hacer personajes femeninos lindos o sexys es una forma de lograr la venta de aspectos . La vida es asi , segun que estas asiendo te vas formando ,ejercitando todo tu cuerpo hasta en lo mental ,o sos lindo o sos feo por fuera eso varía en como te sientes o te ven los demas . Segun mi opinión es eso ,no quiere decir que tenga razón , desde ya Saludos.","replies":[]},{"poster":"POETA DEL RAYO","date":"2018-07-17T16:10:18.250+0000","up_votes":1,"down_votes":0,"body":"Que sad , llevo 6 meses jugando akali , como mi segundo main... Sólo juego dos personajes en rankeds así que imagínate... Me encanta su baile y su estética de ninja , ahora veo esta y  parece akali sayimi o como se escriba el skin... Pero se que que es un campeon con mecánicas más complejas que la actual así que veremos... Espero siga fuerte. {{summoner:4}}","replies":[{"poster":"Ruxoma","date":"2018-07-17T16:28:08.071+0000","up_votes":1,"down_votes":0,"body":"Si probablemente ahora este más fuerte que antes con el Rework {{sticker:sg-janna}}","replies":[]}]},{"poster":"0nlyRenektonSolo","date":"2018-07-17T16:12:15.441+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Ruxoma","date":"2018-07-17T16:27:16.891+0000","up_votes":1,"down_votes":0,"body":"Jajaja, probablemente (?","replies":[]}]}]}