{"poster":"MrChickleOwnage","date":"2018-03-12T15:52:45.890+0000","title":"3 Jahre Abstinenz","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Guten tag zusammen. \r\nich w&uuml;rde wieder gerne mit LoL mir etwas die zeit vertreiben. habe vor ca. 3..4. jahren damit aufgeh&ouml;rt und will nun wieder mitmischen \r\nmeine E-Mail adresse ist noch immer Aktiv hab sogar noch alte Emails von Riot im Posteingang.. \r\nMeine Frage ist wie kann ich vorgehen? ist mein Account eventuell sogar gel&ouml;scht worden  weil nach 2016 kamen keine Emails mehr.\r\nW&auml;re toll wenn man mir helfen k&ouml;nnte.  ich weiss auch nicht mehr ob wir damals auf EU west oder East gespielt haben ob es damals schon Unterschiede gab.\r\n Komischerweise konnte ich auch auf die Alte Email adresse einen Neuen ACC erstellen.. \r\n\r\nVielen dank f&uuml;r eure tipps schon mal im vorraus","replies":[{"poster":"Zyzyx","date":"2018-03-12T16:01:49.345+0000","up_votes":2,"down_votes":0,"body":">  ist mein Account eventuell sogar gelöscht worden weil nach 2016 kamen keine Emails mehr.\n\nNein. Riot schickt nur einfach extrem wenig Emails. Es kann allerhöchstens sein, dass jemand deinen Namen geclaimed hat. Aber da du ja scheinbar deinen Namen noch hast, ist das wohl nicht der Flal. \n\nUm deinen Account wiederzufinden, solltest du dich an den Support wenden. Die werden dich dann ein paar Fragen fragen, um zu beweisen, dass es auch wirklich dein Account ist. Wenn das erledigt ist, können sie dir helfen wieder Zugang zu bekommen. \nAls Warnung vorneweg: Du wirst dich an einige Dinge erinnern müssen, denk also gut nach!","replies":[]},{"poster":"Sidia","date":"2018-03-12T18:08:08.377+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nAccounts werden niemals gelöscht, nach langer Zeit werden nur deine Ingame Namen zurückgesetzt und freigegeben. Aber niemals der Name mit dem du dich einloggst.\nDu kannst unter dem Punkt \"Benutzernamen vergessen\" deine Loginnamen auf deine Email anfordern.\n\nSollte dein Account kompromittiert worden sein (heißt die Email geändert) und du erinnerst dich noch an den Login Namen kannst du dich beim Spielersupport melden:\n\nhttps://support.riotgames.com/hc/de\n\nMit freundlichen Grüßen\nSidia","replies":[]}]}