{"poster":"frankoho","date":"2016-05-19T16:45:08.408+0000","title":"Cuenta robada","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"La cuenta de mi sobrinito fue robada.. el tiene 9 a&ntilde;os y  a pesar de todas las advertencias de no pasar nunca su cuenta lo hizo.{{item:3151}} \r\nEl echo es que cuando quise que me manden el mail para restablecer la contrase&ntilde;a nunca me llego nada y mande el mail al soporte explicando todo para poder  recuperar la cuenta (la que tiene rp invertida :v).\r\n&iquest;Hay otra forma de hacer el reclamo ademas de estos dos?, por que el mail al soporte lo mande ayer y no se cuanto va a tardar, mientras el otro pibe se la pasa jugando en la cuenta de mi sobrino rankeando y jodiendo a todos.{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"ratmen3","date":"2016-05-19T16:54:50.371+0000","up_votes":2,"down_votes":0,"body":"Que hace un niño de 9, si 9 años jugando un juego para mayor de 13+ en ves de jugar con sus \"amigos\"? Y ademas si no sos otro ignorante como el sabrás que esto no se soluciona en el foro, si no en el soporte, busca el significado de foro(Internet)","replies":[{"poster":"frankoho","date":"2016-05-19T17:08:39.631+0000","up_votes":1,"down_votes":0,"body":"el nene de 9 años fue plata 4 en la anterior season sin ayuda de nadie... vofi\ny deberias aprender a leer por que dice \" mande el mail al soporte explicando todo para poder recuperar la cuenta\" {{sticker:slayer-jinx-wink}}","replies":[{"poster":"ratmen3","date":"2016-05-19T17:38:39.519+0000","up_votes":1,"down_votes":0,"body":"Y no hace falta ponerlo en el foro, a nosotros no nos importa, yo solo entro para ver que onda.","replies":[{"poster":"frankoho","date":"2016-05-19T17:47:00.255+0000","up_votes":1,"down_votes":0,"body":"te importa tan poco que lo comentas y todo? plis! xD","replies":[{"poster":"ratmen3","date":"2016-05-19T20:00:27.245+0000","up_votes":1,"down_votes":0,"body":"Si, exactamente, ya que estoy aburrido lo hago.","replies":[]}]}]},{"poster":"Kamen Rider Woz","date":"2016-05-19T18:08:03.510+0000","up_votes":1,"down_votes":0,"body":"que tiene que ver que sea plata 4? o fue no se, menuda atención le ponen a los niños de ahora con los juegos","replies":[]}]},{"poster":"Kamen Rider Woz","date":"2016-05-19T17:11:09.277+0000","up_votes":1,"down_votes":0,"body":"totalmente de a cuerdo los menores de edad o mucho mas menores en este caso no deberian estar jugando este tipo de juego porque las interacciones online no esta calificadas por el esrb ademas dice si no me equivoco calificacion TEEN el juego con descripcion de sangre, violencia de fantasia, temas sugerentes leves y el uso de alcohol y cigarro. http://www.esrb.org/ratings/Synopsis.aspx?Certificate=32211&Title=League+of+Legends","replies":[]}]},{"poster":"Conejito Feliz","date":"2016-05-20T12:54:20.682+0000","up_votes":1,"down_votes":0,"body":"Te toca esperar....el rp creo lo pueden retrotraer pero las trolleadas no...\n\nAhora entiendo porque la actitud de algunos cuando juegas y se comunican... Se me hacia que tenian 10 años máximo. Jajaja.  La comunidad de este juego cada día mas joven...","replies":[]},{"poster":"AuroraExecution","date":"2016-05-19T17:02:10.174+0000","up_votes":1,"down_votes":0,"body":"Que empiece a levear una cuenta nueva. \n\nLLi LLi","replies":[]},{"poster":"PentaMatiTurbo","date":"2016-05-19T16:46:50.112+0000","up_votes":1,"down_votes":0,"body":"Quizas el que se la robo ya le cambio el correo, asi que GG {{champion:29}} \n\nSaludos. {{champion:64}}","replies":[]}]}