{"poster":"Tnks 4 Th Mmries","date":"2015-01-28T16:03:01.940+0000","title":"Capitulo 3: Con 1000 mentiras y un buen disfraz.","subforum":"Creaciones de la comunidad","embed":{"description":"Capitulo 2: Dignos Guerreros En Demacia se respiraba la misma tensión que en todas las naciones.","url":"http://boards.las.leagueoflegends.com/es/c/creaciones-de-la-comunidad/QbwPvIc5-capitulo-2-dignos-guerreros-lo-que-el-aburrimiento-hace-p","image":"http://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":2,"down_votes":1,"body":"Capitulo 3: Con 1000 mentiras y un buen disfraz  \nEL viaje continuo por el maltrecho camino de la Gran Barrera, el espía Demaciano iba sentado al lado del Noxiano, los dos tenias en mente muchas coartadas, ya ensayadas y pulidas al máximo.\nPero el momento llego y el que tiro la piedra fue el espía Noxiano.\n-¿De dónde eres?- Pregunto el espía Noxiano\nPor la cabeza de el espía Demaciano surgió la mentira ensayada, “Era un comerciante de Zaun que estaba buscando contratos en el nuevo pueblo de la gran barrera”, pero surgió un problema, un comerciante no mata a 5 soldados con un simple cuchillo de cocina.\n-Soy un soldado Noxiano- Dijo, sabiendo que había jugado muchas cartas en una sola mano –Me enviaron a negociar unos tratados de paz con Alistar-.\n-¿Por eso estabas en el bar con él?- Pregunto el espía Noxiano.\n-Así es, pero y tú, ¿de dónde eres?- Dijo es espía Demaciano, contento de que su coartada improvisada había salido bien.\n-Soy un Guardaespaldas Demaciano- Dijo el espía Noxiano, ya que se vio en el mismo problema que el espía Demaciano ya que ninguna persona sin entrenamiento mata a tantos hombres tan fácil.\nEl silencio se empezó a hacer incomodo, pero a ninguno le importaba de verdad, estaban acostumbrados a estar solos y el silencio más que ser una molestia era un alivio, cuantas menos preguntas mejor.\nPero algo pico dentro del espía Demaciano, algo que siempre quiso decir y nunca se lo pudo permitir ya que sería comprendido como traición.\n-¿Crees que los Demacianos son el lado bueno?- Pregunto con un improvisado tono de timidez\nEl espía Noxiano, sabía que responder, la respuesta era obvia, pero allí en el medio de la nada, sentado en una carreta solo con un soldado, sintió que podía ser un poco sincero.\n-No sé si son el lado bueno, pero por lo menos se que no son el malo. En Noxus tienes que ser fuerte, si no puedes defenderte mueres y eso influye mucho en todos, supongo que los Noxianos son como son porque de niños en lugar de jugar tenían que esconderse robar y matar… O eso me dijeron- Dijo el espía Noxiano recordando tiempos de su niñez y antes de entrar al servicio secreto Noxiano.\n-Los Demacianos, parecen ser los buenos, pero aun así son arrogantes, todos los grandes nombres de Demacia se llaman a sí mismos justos y bondadosos, pero no tiene valor autoproclamarse justo o bondadoso, tengo más que claro que cuando la guerra comenzó, Demacia no intento hacer un tratado, son iguales a los Noxianos, les encanta pelear solo que usan a la “Justicia” como una excusa- Dijo el espía Demaciano.\n-Los niños en Noxus solo sobreviven si son fuertes, sobreviven si tienen suerte o si sus familias pueden darse el lujo de protegerlos, eso está mal, deberían ser felices como en Demacia- Sugirió el espía Noxiano.\n-Mi niñez no fue la mejor-Dijo el espía Demaciano- Pero, en Demacia también hay pobreza y hambre  ¿verdad?-.\n-Supongo que sí, no sé qué pensar, vivir como un esclavo de la guerra o vivir como un esclavo del hambre y la muerte- Dijo el espía Noxiano\n-Sinceramente, creo que los dos bandos están mal, nadie es feliz con una guerra- acoto el espía Demaciano.\n-Tienes toda la razón- Dijo el espía Noxiano vislumbrando el final del camino.\nCuando llegaron al pueblo, ambos bajaron de la carreta y explicaron al posadero lo que había sucedido, le dejaron la carreta y fueron a la calle principal donde el camino se dividía en dos, uno rumbo a Demacia y otro rumbo a Noxus.\nQuedaron frente a frente, y bajo la capa marrón del espía Demaciano asomo una punta de lanza doble, y bajo la capa negra asomo una navaja de muñeca.\nLos dos rieron al unisonó y se dieron la espalda.\n-Que quede entre nosotros la conversación, Senescal de Demacia, o ¿debería decir Viscero?- dijo el espía Noxiano\n-El mismo favor te pido…Sombra de la Navaja y Xin está bien, mi nombre dejo de ser Viscero hace mucho tiempo- Dijo Xin Zhao, senescal de Demacia, y general de confianza del rey, que en otros tiempos había luchado en la Carnaza (Circo de gladiadores Noxiano).\nCada uno siguió su camino, sin mirar atrás y sintiéndose un poco menos seguro de que lo que estaban haciendo era lo correcto.\n\nhttp://boards.las.leagueoflegends.com/es/c/creaciones-de-la-comunidad/gqrPw7nx-capitulo-4-una-sombra-entre-las-sombras-les-agradezco-que-comenten-d","replies":[{"poster":"Keltzar","date":"2015-01-28T22:58:16.255+0000","up_votes":4,"down_votes":0,"body":"Yo también doy mi opinión, yo te voy a acosar en cada post, te voy a aparecer en el baño para decirte lo que pienso(?.\nMe engañaste, yo pensando que solo eran dos espías :v, debería de haber un boton de seguir usuario para que no me pierda tus posts lince, seguí así y muy pronto te va a aparecer un unicornio que te consedera tus deseos","replies":[{"poster":"Tnks 4 Th Mmries","date":"2015-01-29T00:55:47.572+0000","up_votes":2,"down_votes":0,"body":"Si queres podes ver al final de cada post que dejo un link al siguiente capitulo gracias por tu apoyo :D","replies":[]}]},{"poster":"loljungler","date":"2015-01-28T18:29:19.959+0000","up_votes":3,"down_votes":0,"body":"1, por favor sigue fue muy interesante, has echo algo increíble y has utilizado muy bien los datos de la historia del juego, te felicito y gracias por compartir esto que e leido con entusiasmo uno detras de otro. saludos, Loljungler.","replies":[{"poster":"Tnks 4 Th Mmries","date":"2015-01-28T21:40:41.731+0000","up_votes":1,"down_votes":0,"body":"Gracias, ojala la gente diera mas su opinion :D","replies":[]},{"poster":"loljungler","date":"2015-01-28T18:34:45.319+0000","up_votes":1,"down_votes":0,"body":"{{champion:91}} {{champion:5}}","replies":[]}]},{"poster":"loljungler","date":"2015-01-29T00:16:52.472+0000","up_votes":1,"down_votes":0,"body":"tnks 4 th Mmroes acepta la solicitud del lol asi te siguo los post.","replies":[]}]}