{"poster":"Eva Unit Mk 06","date":"2014-10-24T22:54:42.056+0000","title":"\"Attempting to Reconnect\"","subforum":"Gameplay","up_votes":36,"down_votes":0,"body":"Legitimately, this single persistent error is grinding my gears to new levels. I just can't deal with it anymore. Not only have I been disconnected during every single game I've played since the release of the new patch BUT so have my pals.\r\n\r\nEarlier today we ALL disconnected simultaneously even though we were miles apart. We lost in the 2 minutes we were gone even though we were ahead.\r\n\r\nI just got banned because of a persistent issue such as this and there's nothing I can do about since Riot continues to claim that it's an issue on my end when it's not. My internet may be basic as basic can be but I can stream two HD movies at once without noticeable lag AND be on YouTube. Something needs to be done or at least lift my wrongful ban--like that will ever happen.","replies":[{"poster":"S0NA","date":"2014-10-24T23:20:23.115+0000","up_votes":13,"down_votes":0,"body":"This bug is horrendous.\n\nYou NEVER reconnect, no matter how long you wait, but if you exit game and reconnect it does so instantly.\n\nI can also Alt-Tab out and load anything from Twitch to YouTube to any application that used the internet and it connects fine.\n\nIt also reconnects at lightning speed, just like it does when there's NO INTERNET PROBLEMS WHATSOEVER.","replies":[]},{"poster":"Amoralism","date":"2014-10-25T06:47:37.487+0000","up_votes":10,"down_votes":0,"body":"I told riot and they said \"its your fault\"\n\n\nLol guess thousands of people experiencing the same issue at the same time randomly is our fault boys","replies":[]},{"poster":"Aarekk","date":"2014-10-25T10:02:33.825+0000","up_votes":5,"down_votes":0,"body":"Holy crap, other people are having this problem too?  I even submit a support ticket and everything.   They told me to turn off IPv6 and to connect to a public DNS.  I thought it was weird that I had only really started to have the problem recently.  It's nice to know that it's totally on their end.  I just wish they were more transparent about it.","replies":[]},{"poster":"C1vrock","date":"2014-10-25T15:31:45.076+0000","up_votes":4,"down_votes":0,"body":"I am having this issue as well and it is pretty severe. I can close and reconnect and everything is fine for as long as it takes to move out of base. Then everything stops working, skills don't show up, everyone stands in place, and then \"attempting to reconnect\" pops up. This is the only game I get any lag whatsoever in, and I live in Los Angeles.","replies":[]},{"poster":"7ha7guy777","date":"2014-10-25T05:09:29.694+0000","up_votes":4,"down_votes":0,"body":"i've been having this issue unusually often on hexakill and my pings are normal until the reconnect display shows up. it typically starts with an ability not responding followed by nothing except movement responding followed by nothing responding then the \"reconnecting\" display. it's even more annoying because it typically happens 3 or more times per game and each esc to reconnect counts as an individual game leave so the chances of getting banned skyrocket.","replies":[]},{"poster":"Kiroko","date":"2014-10-25T00:54:10.896+0000","up_votes":5,"down_votes":1,"body":"Please this is not my internet as I checked on speedtest and I had a 20ms ping whereas on league it was around 160-200 spiking to 500 and then \"Attempting to Reconnect\". This bug disappeared last week but then the Harrowing Patch made it come back for some reason. Riot Please fix this problem.","replies":[{"poster":"BetterDravenBot","date":"2014-10-25T04:53:20.661+0000","up_votes":2,"down_votes":5,"body":"> Please this is not my internet as I checked on speedtest and I had a 20ms ping whereas on league it was around 160-200 spiking to 500 and then \"Attempting to Reconnect\". This bug disappeared last week but then the Harrowing Patch made it come back for some reason. Riot Please fix this problem.\n\nthats is because on Speedtest,net you are using local host servers when doing the test. and since you said your ping 120+ i can auto guess that you live on the east coast, and the server for league is in california, thats why you have connection issues.","replies":[{"poster":"RasCaelestis","date":"2014-10-25T16:56:21.470+0000","up_votes":3,"down_votes":0,"body":"I also ran a Speedtest, and I made sure to pick a location in California.  Did it about a month ago, so I don't remember the exact numbers but there was a difference of about 40ms between its connection speed and the ping I get in League.  I'm in Ohio and don't expect fantastic speeds, but Riot's servers are absolutely terrible.  \n\nI am also getting the OP's issue of \"Attempting to Reconnect\" every few games.  Happened three times in one game yesterday.","replies":[]},{"poster":"PapaFizz","date":"2014-10-25T18:47:13.749+0000","up_votes":1,"down_votes":0,"body":"> > Please this is not my internet as I checked on speedtest and I had a 20ms ping whereas on league it was around 160-200 spiking to 500 and then \"Attempting to Reconnect\". This bug disappeared last week but then the Harrowing Patch made it come back for some reason. Riot Please fix this problem.\n> \n> thats is because on Speedtest,net you are using local host servers when doing the test. and since you said your ping 120+ i can auto guess that you live on the east coast, and the server for league is in california, thats why you have connection issues.\n\nPing is meaningless when determining connection issues until it gets to 400+. I've recently noticed that with only 99 ping that I get the attempting to reconnect error w/o having internet issues. This bug goes deeper than just forcing us to reload, its probably bugging out the system and determines that were D/C when we are infact still connected. Really odd.","replies":[]}]}]},{"poster":"LegitMatthew","date":"2014-10-26T03:46:34.286+0000","up_votes":3,"down_votes":0,"body":"Is anyone else experiencing a bug as the following?\n\nAt random in game for the last several days or so I will seemingly d/c and get the \"Attempting to Reconnect\". It never reconnects or if it does it would apparently take quite some time to do so (having waited 5+ minutes).\n\nThe problem is that it is not on my end. No one else in my match seems to d/c or at most one other person maybe (not premade). My ping is a stable 80 and doesn't spike and during the incident every time I can alt+tab and do a speed test, freely user the internet, browse the forums to see if there are any issues from others at the time or even talk in the Adobe Air client to friends.\n\nUpon simply quiting the game and then \"Reconnect\" from the Adobe client I can get in freely without any abnormal wait (vs the never actually reconnecting in game issue). The issue may occur multiple times in a game with the exact same results and a quit->Reconnect fixes it instantly until the issue occurs again (sometimes 2-3x in a 30+ minute match). It is never able to reconnect on its own and my internet is always fine despite the connection issue in game nor do I experience any lag in game.\n\nHas anyone else had this issue?","replies":[]},{"poster":"PuissantPike","date":"2014-10-25T16:14:59.063+0000","up_votes":3,"down_votes":0,"body":"I've been having this problem also, I first noticed it around the release of 4.18.  Same thing, my ping in game and my internet connection will be fine, and then all of a sudden the game freezes up and I disconnect.  I get the \"Attempting to Reconnect\" message, but no matter how long I wait it never does.  However, like some here have said, if I manually leave the game and then reconnect it joins up no problem, until 10 minutes later when I disconnect again.  My internet isn't the issue; my Skype call never gets dropped and I can still access webpages online.  For so many people to have the same problem, it's sad that Riot would just dismiss the issue.","replies":[]},{"poster":"P0RN ST4R T4RIC","date":"2014-10-25T15:59:00.104+0000","up_votes":3,"down_votes":0,"body":"yea i have a 7 day ban because of the new update. it stupid. they were updating while i was in a game. it lagged my whole team out and then i couldnt load in soo i missed the whole game and then i got banned. i emailed riot and they wouldnt do anything. they said well we cant lift it or make it shorter","replies":[{"poster":"InfamousZen","date":"2014-10-25T19:14:41.356+0000","up_votes":2,"down_votes":0,"body":"That's Riot for you why would they admit to their mistake and fix anything.","replies":[]}]},{"poster":"team is so SHIET","date":"2014-10-25T15:24:37.503+0000","up_votes":3,"down_votes":0,"body":"They don't even reply to Support Tickets now. Too busy counting money while making the game overall worse.","replies":[]},{"poster":"Fede","date":"2014-10-25T08:43:32.691+0000","up_votes":1,"down_votes":0,"body":"I did experience this for many months, this is not new. Changing your DNS fixes it.","replies":[{"poster":"Jesus is Savior","date":"2014-10-25T12:49:31.681+0000","up_votes":3,"down_votes":0,"body":"Changing it to what? I use open DNS.\n\nAnd this bug has been around for like 5 weeks now. They broke something in 4.17.\n\nIt ***IS*** new.","replies":[{"poster":"Fede","date":"2014-10-26T01:12:31.703+0000","up_votes":1,"down_votes":0,"body":"> Changing it to what? I use open DNS.\n> \n> And this bug has been around for like 5 weeks now. They broke something in 4.17.\n> \n> It ***IS*** new.\n\nHell no, this has been happening to me since 3 months ago, i even uploaded a video.\n\nhttps://www.youtube.com/watch?v=v2kcOLqVoUo","replies":[]}]}]},{"poster":"EMINEMINEMEMINEM","date":"2014-10-25T12:45:13.368+0000","up_votes":3,"down_votes":0,"body":"Same issue on EU-W haven´t had a dc for around 5 days now 3 in one game under 30 minutes\ncant justify playing ranked right now since it has no indication and i dont want to lose games due to their adobe-air client.","replies":[]},{"poster":"SnowSeven","date":"2014-10-25T11:19:06.214+0000","up_votes":3,"down_votes":0,"body":"I am also experiencing this problem. My connection is usually fine, but playing hexakill, I have dropped in every single game with the same reconnecting error even though I can still see everyone else moving around and waiting until I am killed. This is very frustrating.","replies":[]},{"poster":"RattleKnight","date":"2014-10-26T00:05:08.578+0000","up_votes":2,"down_votes":0,"body":"bump. I stopped playing lol about 3 weeks ago since the last patch. I dissconnect every  2 minutes. All I need to do is just leave the game and reconnect and it's back to normal... for another 2 minutes. I reinstalled the game and it didnt help. Riot doesn't give a damn to their customer apparently","replies":[]},{"poster":"Pwnagecoptor","date":"2014-10-25T16:07:08.376+0000","up_votes":2,"down_votes":0,"body":"Fix your damn servers riot! this is super annoying .. makes me wanna resub into wow until new servers come.. i swear that's what they are banking on to fix this god awful prob","replies":[]},{"poster":"Space Zoom Fade","date":"2014-10-25T17:02:29.008+0000","up_votes":3,"down_votes":1,"body":"I also get this issue, though not as much as you guys seem to say it. Recently I got \"Attempting to Reconnect\" yesterday and after 30 seconds I did reconnect.\n\nRiot, this is YOUR PROBLEM. NOT OURS. {{champion:79}} \n\nFix it and stop banning innocent people who just want to play your game and give you money. {{champion:23}}","replies":[]},{"poster":"chriserit","date":"2014-10-26T14:01:01.418+0000","up_votes":1,"down_votes":0,"body":"remove pando media booster since i removed it i got no more this problem","replies":[]},{"poster":"Morgausse","date":"2014-10-26T02:57:50.533+0000","up_votes":1,"down_votes":0,"body":"Trying to get to gold before the season end, i'm losing LP and ranked games because of this bug, >.>","replies":[]},{"poster":"FoxFluid","date":"2014-10-26T00:16:06.918+0000","up_votes":1,"down_votes":0,"body":"The worst part for me is I wanna hit plat before the season ends but I'm getting this bug every other ranked game. I have decided to stop playing ranked until this bug is fixed (for fear of getting a ban for all my \"reconnects\"), which probably means I'm not hitting plat anytime soon","replies":[]},{"poster":"Austin Covello","date":"2014-10-25T21:32:03.045+0000","up_votes":1,"down_votes":0,"body":"I'm having the same problem.","replies":[]},{"poster":"Eva Unit Mk 06","date":"2014-10-25T21:21:24.497+0000","up_votes":1,"down_votes":0,"body":"I'm glad to see other people are suffering from this as well. I spent so long having my leaver level drop from Level Three after struggling with the constant firewall issue that I kept getting from Riot's faulty connect only to have it jump back to Level Three from this ridiculous connection error.\n\nThis is sickening.","replies":[]},{"poster":"ReberuAppu","date":"2014-10-25T21:15:22.808+0000","up_votes":1,"down_votes":0,"body":"I lost a promotion ranked because of this.","replies":[]},{"poster":"InfamousZen","date":"2014-10-25T19:09:05.172+0000","up_votes":1,"down_votes":0,"body":"All day yesterday that's all I got and other teammates. I waited for 5 mins nothing happen I had to quit and reload for it to work and I had to that three times in a row in two games. First game I played and already ping spikes and crazy ass lag, every patch all that happens is you make your game worst, you're the only company that can pull this off which says a lot because you guys don't answer back ever.","replies":[]}]}