{"poster":"G2 Slippi","date":"2019-11-26T06:28:08.634+0000","title":"[TGSG] Was ist gelb und kann schießen?","subforum":"Allgemeiner Chat","up_votes":5,"down_votes":2,"body":"Eine Banone!\n\nGuten Morgen liebe Leute :)\nGestern hatte ich leider keine Zeit um einen TGSG Thread zu erstellen. Aber heute gehts...hoff ich zumindest...\n\nhttps://assets.cdn.moviepilot.de/files/9e2d8a83d1eab113a33e355b04f950999d96cd3a39f562e5f3e7f138476a/limit/1024/2000/299506-5.jpg\n\nIn letzter Zeit habe ich wieder ein paar Animes durchgesuchtet.\n\n_Goblin Slayer_ (Empfehlung von Maddin und Necromant) war überraschend gut und hat mich ab der ersten Folge gefesselt, so dass ich nicht anders konnte und die erste Staffel innerhalb von 3 Arbeitstagen durchzuschauen ^^ Kanns kaum erwarten die nächste Staffel zu sehen :)\n\n_Is This A Zombie?_ kam als nächstes dran. Da ist auch erst eine Staffel auf Netflix. Der Anime hat mich auch sehr gut unterhalten und werde mir auch auf jeden Fall weitere Staffeln gönnen :)\n\nGestern habe ich dann mit _A Chivalry Of A Failed Knight_ begonnen. Die Spannung nach den ersten Folgen ist noch nicht wirklich hoch, da man meistens relativ leicht erahnen kann, was passiert, aber finde die Thematik und die Strory bis jetzt trotzdem ganz gut, dass ich auf jeden Fall weiter schauen werde :)\n_________________________________\n\nMeine Erkältung habe ich soweit ganz gut auskuriert. Taschentücher brauch ich zwar noch, aber Halsschmerzen und Husten sind wenigstens weg :)\n\nGestern haben ich und meine Frau uns wieder mal eine Pizza aus der Pizzeria gegönnt :) \nNur für das heutige Mahl hab ich noch keinen Plan, wobei Pizza gestern auch eine spontane Eingebung war ^^\n\nMotivationslevel für Arbeit ist nicht all zu hoch. Hoffe der Tag geht schnell rum.\nBin gerade am Shyvana lernen und würde da gerne den ganzen Tag zuhause vorm PC sitzen und Shy spammen, aber Chef sagt leider NEIN. Find ich jetzt nicht so prickelnd :(\n\nNaja, wünsche euch einen schönen Tag ;)\n\nEdit: Habs endlich geschafft ein Bild hier im Forum zu posten xDD","replies":[{"poster":"INoKami","date":"2019-11-26T17:09:51.157+0000","up_votes":2,"down_votes":0,"body":"**[Der TGSG-Blog] Geschichten eines Azubis, Tag 253 und 254\n- Doublekill-Edition -**\n\nHui. Ich weiß nicht genau, was los war, aber irgendwas ist gestern passiert und was auch immer es war, es hat mir dezent meinen Account im Forum zerrissen, sodass ich nichts schreiben konnte. Aber zuerst die Volus besucht, dann auf deren Rat den \"richtigen\" Support und es scheint wieder zu gehen. Also dann: zwei Blogs in Folge. Boom!\n\n**(Montag) Tag 253, extra-späte Theater-Sonderausgabe**\n\nWas ein Tag mal wieder. Aber hey, das meiste ist positiv (bis auf den nicht vorhandenen Schwangerschaftstest) und die negativen Sachen stammen mal nicht von der Bahn!\n\nIn diesem Sinne: rechnet morgen mit einer Heulorgie über die Verspätungen.\nIch lerne halt aber auch nicht dazu, oder?\n\nAlso, folgendes: als erstes schneite eine Ankündigung herein: am Mittwoch gibt es wieder einen der berühmt-berüchtigten Vorträge, dieses Mal scheinbar über die UN, keine Ahnung, sind nur Gerüchte, uns wurde von offizieller Seite nicht gesagt. Mann, ich freu mich schon auf anderthalb Stunden Zeitverschwendung, nur um dann für eine halbe Stunde wieder ins Labor zu dürfen, bevor der Tag rum ist und man im Grunde nichts schafft _#_ istallesmiteinberechnet\nEs wurde aber schnell aufregend, denn die heutige Analyse wollte der zuständige Assistent um zehn Uhr messen. Vorbereitungsdauer ist ziemlich genau eine Stunde. Wann bekommen wir die Mitteilung? Um 9.10 Uhr. Gut, die meisten haben schon angefangen, ich auch, aber ja... Kommunikation und Zeitplanung… definitiv die Stärken der Schule. Hab ich auch so noch nie erwähnt.\n\nOk, vielleicht manchmal...\n\nAlso mal kurz den Speedrunner ausgepackt und die Analyse rechtzeitig vorbeigebracht, nebenher noch eine zweite Analyse abgegeben, die auch bearbeitet wurde und wir uns das Prozedere ein Mal anschauen durften (automatisch arbeitende Maschinen... traumhaft!!!), bis es wieder hoch ins Labor ging... und dann einem bewusst wurde, dass man durch ist mit dem Tagesplan und man noch etwa 4 Stunden im Labor absitzen muss. Ich war ja natürlich so ein Fuchs und habe das vorausgesehen und daher noch etwas Protokolle mitgenommen, um Refraktometrie fertig auszuwerten. Hab ich in so weit auch noch geschafft, aber ich muss nachher noch etwa drei Diagramme zeichnen, Vorfreude ist inklusive. Das Auswerten hat aber nicht vier Stunden gedauert, also mussten wir uns anders unterhalten. Irgendwann saßen ich und eine Freundin da und haben einfach Lieder gesungen. Welche? Von jedem Gerne ein bisschen. Cher, The Cranberries, Die Ärzte, SDP... irgendwie war alles vertreten.\nDoch was wäre das Labor ohne Tiefpunkte? Heute gab es genau zwei. Erstens wieder mal die Geräte. Für den Versuch morgen brauchen wir vier 100ml Kolben. Toll, ist ja nicht so, dass jeder nur zwei hat und davon die meisten belegt sind, weil da noch eine Analyse für die Bodenprobe drin ist, die noch gemessen werden muss. Und dass machen die Assistenten nur dann, wenn sie lustig sind und nix zu tun haben. Minuten später kam die leichte Entschärfung: man braucht nur 4 Kolben pro Zweiergruppe.\nHat aber die miserable Situation auch nicht geändert.\nZweitens... wieder mal Ergebnisse einer Klassensprechersitzung. Und so langsam schlägt echt der Wahnsinn durch. Es gab in letzter Zeit häufiger Beschwerden, dass keine Protokolle da sind, weil es nicht angekündigt wird (bzw. nur unzureichend), weil immer andere zu viel mitnehmen für die, die krank sind und sich dann keiner abspricht etc.\nEs musste also eine Lösung her. Tja. Es wird ab sofort eine (noch nicht näher bekannte) 15 Minuten-Pause während den Theorietagen gestrichen (!) und genau in der Zeit können wir uns bei den zuständigen Personen neue Protokolle abholen. Und das nur gegen eine persönliche Unterschrift. Kein Witz.\n\nWas tun wir eigentlich der Schule an, dass wir eine solche Behandlung verdienen?!\n\nTheaterprobe gab es auch noch heute (musste vorverlegt werden), aber wir haben nur unsere selbstgeschriebenen Szenen geübt. Alles schön und gut, wenn nicht wieder mal die Hälfte umgeworfen werden würde... dabei hab ich mir am Wochenende extra Mühe gegeben, als ich unsere Szene auf (digitales) Papier gebracht habe -_-\nAber noch während dem Labor wurde ich mit einem interessanten Vorschlag überrascht: ein Freund von mir hat mich mal rausgezogen und gesagt, dass er geplant hat, heute Abend (also in 10 Minuten xD) mit \"meinem Lieblingsassistenten\" eine Runde LoL spielen zu wollen und er wollte wissen, ob ich dabei bin.\n\nTja, daher gehe ich gleich mit einem Freund und... im Grunde meinem Lehrer in die Kluft und stompe oder werde gestopmt.\n\nIn diesem Sinne: Eine schöne Woche euch!\n\n**\n(Dienstag) Tag 254, katastrophal späte Abendausgabe**\n\nÄhm... wow? Die Bahn war mehr oder minder pünktlich? Und das, obwohl ich heute noch ein Protokoll abgeben musste. Wir können gerne so weiter machen.\nDas Spiel gestern war... INTeressant. Ich, Morgana Supp, werde kurzerhand zum APC umfunktioniert, weil unser ADC die ersten 6 Minuten afk war, aber, weil er anscheinend zu Beginn da war (aber natürlich nichts gemacht hatte) und danach dc´t war, war Early-FF nicht möglich und wir mussten spielen. Sonderbarerweise haben wir aber hart gestopmt. Unser Jungler ist ham gegangen und auch die Toplane (gegen eine Full AP-Nami mit Press the Attack, kein Witz!) hat dezent gecarriet. Und dann zwei 5 Mann-Flashults von mir und das Ding war durch.\n\nZum Arbeitstag heute... joa, bisher eine ziemlich produktive Woche, muss man ja einfach mal so sagen. Ein neuer Versuch hat begonnen, Konduktometrie, also tl;dr wir können damit den Gehalt einer Flüssigkeit über deren Leitfähigkeit bestimmen (wenn wir diese mit einer anderen titrieren). Ist ein Prüfungsversuch und berühmt dafür, (während dem Praktikum) vom Zeitplan her mit einer der stressigsten Versuche des gesamten Phys.-Chem.-Labors zu sein. Tja, und wir fangen an einem Dienstag an. Zerstückelt wie eine Leiche. Und zwei Stunden Besprechung. Aber so weit mussten wir erst mal kommen. Denn zuerst die Geräte abholen... nur hat die dafür zuständige Lehrerin erst noch die reguläre Geräteausgabe gemacht und uns eine Viertelstunde dumm rumstehen lassen. Und dann, wieder oben im Labor, Geräte deponiert... \"Bitte nehmen sie ein leeres Blatt Papier und einen Taschenrechner mit zur Besprechung!\", so der Assistent. Wozu zum F _*_ ck… und spätestens, als wir alle im Raum saßen, dämmerte es uns: Überraschungstest.\n\nIch hab ja so gehört, ich hätte Freitag nachmittags noch nichts zu tun und könne daher locker nochmal eine Nachschulung besuchen...\n\nNach diesem Tiefschlag die Besprechung... tja, und dann steht man im Labor, liest sich noch in die Gebrauchsanweisung ein, checkt das Protokoll und was wir machen müssen... und in 1,5 Stunden ist wieder Mittagspause und wir haben nichts. Weiteres Problem, was nur dezent hinderlich ist: für fünf der sechs Aufgaben brauchen wir eine eingestellte Natronlauge. Dumm nur, dass das auch mal eben 30-45 Minuten dauert (vor allem, weil wir es dieses Mal anders machen müssen als sonst) und der Titer nur für den Tag gültig ist, weil Natronlauge doch recht instabil ist und daher täglich neu bestimmt werden darf. Resultat: wir hätten dann nur 45 Minuten für einen Versuch, der WESENTLICH mehr als 45 Minuten dauert und nach der Mittagspause haben wir auch nur eine Stunde Arbeitszeit und das auch nur, wenn wir freiwillig unsere Pause aufgeben.\n\nHab ich eigentlich schon mal was zur Zeitplanung an dieser Schule gesagt?\n\nAber als Knüller haben wir schon ausgeknobelt, was nächsten Dienstag passiert und... besser wird es nicht. Denn nächsten Dienstag ist der letzte Tag für die Konduktometrie, aber am gleichen Tag müssen wir auch noch Gelfiltration machen. Und für den Versuch wird uns nur ein halber Tag zugestanden. Der reicht zwar, wenn man vernünftig arbeitet, aber an einem Arbeitstag, der weniger Netto-Arbeitszeit hat als ein halber Arbeitstag und wir noch nebenher einen der vom Zeitplan her ekligsten Versuche bearbeiten müssen, rechne ich mir nicht viele Chancen aus.\nUnd wisst ihr, was der Knaller ist? Die Assistentin bei der Einführung so: \"Ich weiß, es kann etwas eng werden, aber ich denke mal, ihr dürftet ja alle bis Montag fertig sein!\"\nÄhm... die ignorieren doch bewusst die Leiden der Schüler, oder? Wie soll man sich sonst so eine Idiotie erklären?!\n\n_\nP.S. Wo finde ich den Studiengang, in dem man lernt, Aphelios zu spielen? Ich meine, sein Kit klingt mega-cool, aber bis man das mal draufhat... da kannste dir echt ´nen Doktortitel einfordern..._","replies":[]},{"poster":"Nanary","date":"2019-11-26T11:56:36.014+0000","up_votes":1,"down_votes":0,"body":"hOi! o/\nLeider kann ich meine Mangas &amp; Animes hier nicht zeigen alles ab 18 und sehr unfreundlich für die meisten.. :/\nmhh, glaube die letzten die ich gesehen habe und persönlich Großartig fand waren Parasyte – Kiseijuu &amp; Made in Abyss\n\nalso ist Goblin Slayer jetzt keine reine Fanservice Serie? dachte das immer da ich das mal super Kurz auf irgendeinen Kanal gesehen habe und die Deutche Synchro mich schon angekotzt hat. ^^'\n\nund ja die erste Staffel von Made in Abyss empfehle Ich auch und ich bin sehr wählerisch was M&amp;A zeug betrifft. :)","replies":[{"poster":"G2 Slippi","date":"2019-11-26T12:25:55.868+0000","up_votes":1,"down_votes":0,"body":"Ab 18 und sehr unfreundlich? Jetzt hast du mich neugierig gemacht ^^","replies":[{"poster":"Xayah Strife","date":"2019-11-26T13:00:34.127+0000","up_votes":1,"down_votes":0,"body":"Es gibt aber verschiedene 18er Ratings:\n\nR - 17+ recommended (violence &amp; profanity)\nR+ - Mild Nudity (may also contain violence &amp; profanity)\nRx - Hentai (extreme sexual content/nudity)\n\nGoblin Slayer ist auch R - und damit ab 18. ^^","replies":[{"poster":"Uranbrennstab","date":"2019-11-26T13:33:08.692+0000","up_votes":1,"down_votes":0,"body":"Rx... Wenns die mit guter Story geben würde...","replies":[{"poster":"Xayah Strife","date":"2019-11-26T16:48:51.640+0000","up_votes":1,"down_votes":0,"body":"Gibt es hab ich sogar vorgestellt...\nAber die unzensierte Version ist noch nicht draußen.\nSoll im Dezember kommen.","replies":[]},{"poster":"G2 Slippi","date":"2019-11-26T14:01:40.706+0000","up_votes":1,"down_votes":0,"body":"Pass auf, plötzlich kommt Maddin und sagt: \"Gibt es doch\" xDD","replies":[{"poster":"Uranbrennstab","date":"2019-11-26T14:29:28.975+0000","up_votes":1,"down_votes":0,"body":"Ich denke Maddin und ich haben einen sehr unterschiedlichen Geschmack was Handlungen angeht.","replies":[]}]},{"poster":"Horseghost","date":"2019-11-26T13:55:51.706+0000","up_votes":1,"down_votes":0,"body":"Ich guck mir das doch nicht wegen der Story an \n\nhttps://media.giphy.com/media/12qMRa6NNmJRp6/giphy.gif","replies":[{"poster":"Uranbrennstab","date":"2019-11-26T14:28:59.811+0000","up_votes":1,"down_votes":0,"body":"Ja, natürlich nicht, gibt ja auch keine gute Story.","replies":[]},{"poster":"Horseghost","date":"2019-11-26T13:56:18.126+0000","up_votes":1,"down_votes":0,"body":"Ups falsches Forum falscher Login {{summoner:6}}","replies":[]}]}]},{"poster":"Nanary","date":"2019-11-26T14:33:20.190+0000","up_votes":1,"down_votes":0,"body":"Ich steh halt auf Mature,Adult,Horror,Psychological, Dark setting zeug halt kp was die teils für Ratings haben steht bei meinen Manga seiten auch nie bei.\n\nDead Tube &amp; Peephole find ich zb sehr nett :)\n\nwer Dark Fantasy und Splatter mag empfehle ich Übel Blatt &amp; Knights.\n \nhttps://myanimelist.net/manga/6916/Knights","replies":[{"poster":"Xayah Strife","date":"2019-11-26T16:42:06.666+0000","up_votes":1,"down_votes":0,"body":"Also alles was ich nicht mag. ^^","replies":[]}]}]}]}]},{"poster":"II3RDB4NG","date":"2019-11-26T13:14:25.023+0000","up_votes":1,"down_votes":0,"body":"Was ist gelb und kann schießen?\nEin Junkie mit Stoff... .","replies":[]},{"poster":"Ráyleigh","date":"2019-11-26T12:17:01.779+0000","up_votes":1,"down_votes":0,"body":"Habt ihr schon Mobile Suit Gundam Iron Blooded Orphans gesehen?","replies":[{"poster":"G2 Slippi","date":"2019-11-26T12:24:24.503+0000","up_votes":1,"down_votes":0,"body":"Nope, kann der was?","replies":[{"poster":"Ráyleigh","date":"2019-11-26T12:30:02.266+0000","up_votes":1,"down_votes":0,"body":"Meiner Meinung nach JAAA.\nEine düstere Atmosphäre, Intrigen und Weltraum Kämpfe {{sticker:sg-jinx}}","replies":[{"poster":"G2 Slippi","date":"2019-11-26T12:32:37.060+0000","up_votes":1,"down_votes":0,"body":"Hmmm, düstere Atmosphäre und Intrigen also... Das ist schon voll mein Ding ^^\nWeltraumkämpfe sind für mich immer so ein heikles Thema, aber mal sehen, vl passt der mir ja mal in den Kram :)","replies":[{"poster":"Ráyleigh","date":"2019-11-26T12:42:48.971+0000","up_votes":1,"down_votes":0,"body":"Ich bin gespannt ^^","replies":[]}]}]}]}]},{"poster":"00 M4ddin 00","date":"2019-11-26T07:54:47.511+0000","up_votes":1,"down_votes":0,"body":"Guten morgen :) \nWie angekündigt hab ich immer noch nicht so viel zeit wie sonst :( \n\nWie gesagt wenn ich mal animes empfehle sind die meisten gabz ok :3 \n\nMade in Abyss hast du schon geschaut oder ? \nWenn nicht unbedingt schauen :0 \n\nWünsch euch einen schönen Dienstag :)","replies":[{"poster":"G2 Slippi","date":"2019-11-26T08:01:12.309+0000","up_votes":1,"down_votes":0,"body":"Nö, Made in Abyss hab ich noch nicht geschaut ^^","replies":[{"poster":"Xayah Strife","date":"2019-11-26T11:25:41.618+0000","up_votes":1,"down_votes":0,"body":"Du hast ziemlich viel noch nicht geschaut.^^\nIch lass dir mal ein Link zu meiner Animeliste da :)\n\nhttps://myanimelist.net/animelist/Xayah_Strife\n\nEs gibt btw ein Anime der ähnlich ist zu \"A Chivalry Of A Failed Knight\"\n\n\"The Asterisk War\" heißt er. Könnte sein das es ihn auch auf Netflix gibt oder Amazon kp...\n\nhttps://cdn.myanimelist.net/images/anime/12/74447l.jpg","replies":[{"poster":"G2 Slippi","date":"2019-11-26T12:30:04.805+0000","up_votes":1,"down_votes":0,"body":"> Du hast ziemlich viel noch nicht geschaut.^^\n\nDas ist richtig ^^\n\nDanke, werd da mal drüber schaun :)","replies":[]},{"poster":"XenesisCH","date":"2019-11-26T12:08:06.054+0000","up_votes":1,"down_votes":0,"body":"Ist von \"The Asterisk War\" eigentlich ein Fortsetzung angekündigt oder bleibt es bei den 24 Episoden?","replies":[{"poster":"Xayah Strife","date":"2019-11-26T12:23:40.128+0000","up_votes":1,"down_votes":0,"body":"Nein es gibt nur 2 Staffel mit je 12 Folgen. \nStaffel 2 kam ja 2016 raus also wird da wahrscheinlich nichts mehr kommen leider.","replies":[]}]}]},{"poster":"00 M4ddin 00","date":"2019-11-26T11:18:10.108+0000","up_votes":1,"down_votes":0,"body":"Anschauen !!!!! :0","replies":[]}]}]},{"poster":"Xayah Strife","date":"2019-11-26T11:22:20.569+0000","up_votes":1,"down_votes":0,"body":"Sorry ich hab heute verschlafen. :(\nVllt kommt ja morgen was von mir. :)","replies":[{"poster":"G2 Slippi","date":"2019-11-26T12:26:16.740+0000","up_votes":1,"down_votes":0,"body":"Dann warte ich morgen auf deinen Post ;)","replies":[]}]},{"poster":"Veezey","date":"2019-11-26T12:10:40.543+0000","up_votes":1,"down_votes":0,"body":"Drifters ist auch ziemlich nice, wenn du nicht gegen Blut hast :D","replies":[{"poster":"G2 Slippi","date":"2019-11-26T12:24:47.721+0000","up_votes":1,"down_votes":0,"body":"Danke für den Tipp :)","replies":[]}]},{"poster":"Uranbrennstab","date":"2019-11-26T08:17:05.765+0000","up_votes":1,"down_votes":0,"body":"Goblin Slayer war recht kurzweilig. Sehr interessant im übrigen, wie die gesamte Serie ohne Namen auskommt, aber eine zweite Staffel würde nicht sehr viel Sinn machen. Man kann eine Geschichte auch mal abgeschlossen lassen, vor allem wenn das Ende stimmig war.","replies":[{"poster":"G2 Slippi","date":"2019-11-26T08:43:16.257+0000","up_votes":1,"down_votes":0,"body":"**ACHTUNG SPOILER**\n\nJa stimmt schon, er meinte ja am Ende, dass er jetzt doch Abenteurer werden möchte und da er als Abenteurer auch andere Monster jagen wird, macht der Name Goblin Slayer nicht mehr wirklich viel Sinn. Jedoch stand am Ende \"Goblin Slayer will return\". Dass dies auf den Film bezogen ist, der bald erscheinen wird ist auch leicht möglich.\nAber ich denke, dass da schon noch eine Fortsetzung kommen wird (Möglicherweise nicht mehr unter dem Namen \"Goblin Slayer\".","replies":[]}]},{"poster":"Hanaguma","date":"2019-11-26T06:36:14.711+0000","up_votes":1,"down_votes":0,"body":"Guten Morgen :D\nDie drei Animes hab ich tatsächlich auch schon einige Mal empfohlen bekommen, besonders Goblin Slayer, aber ich kam noch nicht dazu, mal reinzuschauen >.&lt; \n\nBei uns gabs gestern auch Pizza! Wenn auch nur TK-Pizza, aber Pizza ist Pizza :D Für heute hab ich mir schon Spaghetti mit Tomatensauce überlegt, aber mal schauen\n\nIch schließe mich deiner nicht geraden hohen Motivation mal an ~ Heute bis 17:30 Uhr Uni ._. Aber wir kriegen das schon hin :D","replies":[{"poster":"G2 Slippi","date":"2019-11-26T06:42:09.566+0000","up_votes":1,"down_votes":0,"body":"Hey, schön von dir zu hören :)\n\nJa Goblin Slayer war schon mega :) Kann ich auch auf jeden Fall empfehlen und solltest du echt zeitnah mal reinschauen ;)\n\nRichtig, PIZZAAAAAA ist PIZZAAAAAAAAAA!!!!! :)\nHmm, ich hatte glaub ich letzte Woche 3 mal Pasta. Wird wohl irgendwas mit Fleisch und Gemüse ^^\n\nNatürlich schaffen wir das ;)","replies":[]}]}]}