{"poster":"G2 Slippi","date":"2019-02-12T08:41:55.359+0000","title":"[CLAN] Das gamer.VZ sucht Teamspieler!!!! (plat/dia)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Du m&ouml;chtest nie wieder alleine in die Kluft? Du hast keinen Bock mehr auf toxische und ignorante Teammates? Du bist ein netter und lustiger Zeitgenosse?\r\nDann bist du bei uns genau richtig!\r\n\r\nDenn das gamer.VZ sucht motivierte Mitspieler, die die gleiche Leidenschaft f&uuml;rs Spiel teilen.\r\nWir bieten einen Discordserver, wo man rund um die Uhr Mitspieler f&uuml;r Normals, Arams, Funmodes und Rankeds findet. Es gibt auch Channels f&uuml;r Overwatch und andere Spiele, wie z.B. Apex Legends.\r\nWer einfach nur mal entspannt mit anderen Gleichgesinnten Talken m&ouml;chte, kann dies in einem unserer &bdquo;Aufenthaltsr&auml;ume&ldquo; tun.\r\n\r\nWeiters bieten wir die M&ouml;glichkeit, einem unserer Teams jeglicher Rangstufe beizutreten.\r\nF&uuml;r folgendes Team werden zurzeit motivierte Spieler gesucht:\r\n\r\nPlat/Dia &ndash; Team:\r\n\r\n-\tMidlaner\r\n\r\n\r\nVoraussetzungen:\r\n\r\n-\tkein Flame, kein Tilt, kein Ragequit\r\n-\tKritikf&auml;higkeit\r\n-\tP&uuml;nktlichkeit und Verl&auml;sslichkeit\r\n-\tmind. Platin 4\r\n-\tfunktionierendes Headset oder Mikrofon\r\n\r\nSollte f&uuml;r dich beim Eintritt in die Community kein Platz mehr in diesem Team sein, sei unbesorgt. Wir k&ouml;nnen f&uuml;r dich gerne ein weiteres Team in diesem Elobereich aufbauen.\r\n\r\nAber auch bereits vollst&auml;ndige, bestehende Teams sind bei uns herzlich willkommen. Hierf&uuml;r bieten wir euch einen eigenen Bereich f&uuml;r eure Trainings und Teambesprechungen.\r\n\r\nSollten wir dein Interesse geweckt haben, schaue einfach auf unserem Discordserver vorbei:\r\n\r\nhttps://discord.gg/eTPUXa\r\n\r\nRegeln durchlesen und im Wartezimmer auf einen Admin warten. Der erkl&auml;rt dir dann alles Weitere.\r\nBei Interesse an einem unseren Teams, kannst du dich danach mit mir in Verbindung setzen.\r\n\r\nGreez Slippi","replies":[]}