{"poster":"iFlay","date":"2015-07-25T06:30:22.519+0000","title":"A new Sion and Dr.Mundo Skin","subforum":"Player Creations","up_votes":1,"down_votes":0,"body":"So, my idea is that there is a Dunk master skin for Darius. However like the soccer skins we should have more for basketball. My idea is a Sion and Dr. Mundo basketball skins. For Sion, (Like Darius) his weapon is a basketball hoop that he slams down for Q. For his W, he still has his shield however it is Red and White for Team Noxus. His E he picks a ball up and throws it with power pushing the minion back. Finally for his R, He runs into the team and Dunks when he crashes or it ends. \r\n\r\nFor Dr.Mundo, He is the coach for Team Noxus and instead of throwing a knife for his Q, it is a clipboard for the game positions. His W, is basketballs floating around him and his E, he gets angry and gains a temper kind of thing and gains the extra AD that way. Finally his ult, still Green, but he goes happier and is exciting that Noxus is winning and can run faster and gains health that way.\r\n\r\nThis is just some of my ideas for skins because these champions need to be played more and I think with cool skins like these, it can be achieved.\r\n{{champion:122}} {{champion:36}} {{champion:14}} \r\n\r\n- Tk12","replies":[{"poster":"Talon12","date":"2015-10-08T12:14:33.144+0000","up_votes":1,"down_votes":0,"body":"dunkmaster\n\ndarius top\nj4 mid \ntrist adc\njax supp/jg\nvi jg/supp","replies":[{"poster":"iFlay","date":"2015-10-16T22:20:12.247+0000","up_votes":1,"down_votes":0,"body":"Well, First you have to make a dunk master yi skin. The original dunk master skin.{{champion:11}}","replies":[]}]},{"poster":"JasonWazza","date":"2015-07-25T07:57:06.079+0000","up_votes":1,"down_votes":0,"body":"Generally the skins fit into a team comp, you just gave us 3 top laners.","replies":[{"poster":"iFlay","date":"2015-10-08T10:58:45.700+0000","up_votes":1,"down_votes":0,"body":"Not always, for example the twitch, eve, Trundle and Volibear cops and robber based skins","replies":[{"poster":"JasonWazza","date":"2015-10-08T11:53:29.125+0000","up_votes":1,"down_votes":0,"body":"except they do as they are 2 different sets of skins\n\nTrundle top, Volibear Jungle\nTwitch ADC and Eve Jungle.","replies":[{"poster":"Talon12","date":"2015-10-08T12:15:25.199+0000","up_votes":1,"down_votes":0,"body":"bear can supp","replies":[{"poster":"EzeBlood","date":"2015-10-09T22:40:38.397+0000","up_votes":1,"down_votes":0,"body":"no plz plz no","replies":[]}]}]}]}]},{"poster":"Talon12","date":"2015-10-08T12:09:57.733+0000","up_votes":1,"down_votes":0,"body":"ITSNT THE ADDED 5% HP DAMAGE ONTOP OF THE 100 AD + 0.4 for 1% MISSING HP ON MUNDO E BUFF ENOUGH","replies":[]}]}