{"poster":"Auritre","date":"2015-02-04T20:23:29.211+0000","title":"{Concepto de Campeón] Elja Quer","subforum":"Creaciones de la comunidad","up_votes":1,"down_votes":0,"body":"Buenas, como todos dicen que lo más importante de un equipo es la visión y la comunicación se me ocurrió la siguiente idea...\r\n\r\nPasiva: Cada X segundos Elja Quer acumula una carga de bytes. A medida quye sube de nivel aumenta el rango desde el cual puede acceder los puntos de acceso.\r\n\r\nQ: Transformación. Elja QUer tranforma una ward enemiga en un punto de acceso al sistema de visión negando temporalmente la visión enemiga. La wars sigue dando visión al equipo enemigo pero le permite a Elja utilizar sus demás habilidades.\r\n\r\nW: Nebulosa. Vendría a ser una mezcla de trinket/nocturne ulti negando la visión de un area del mapa por X segundos.\r\n\r\nE: Decoy. Utilizando un punto de acceso una X cantidad de bytes Elja es capaz de crear la imagen del icono de sus aliados pasando por la zona del punto de acceso.  \r\n\r\nR: Intranet. Elja logra revelar todas las wards del equipo enemigo por X segundos sin ser detectado. (Osea, el equipo aliado tiene conocimiento de donde estan las wards enemigas pero el equipo enemigo no lo sospecha).\r\n\r\n\r\nEs un chamo de pura utilidad que trabaja negando la visión del equipo enemigo.\r\nEn Bronce es super inútil porque nadie pone wards, pero en elos más altos puede ser un concepto interesante....\r\n\r\nLa que más me gusta es la E con el Decoy siendo capaz de hacerle creer al equipo enemigo que estas caminando una parte del mapa cuando en realidad estás haciendo un obketivo en otra parte....\r\n\r\n\r\nGracias por tomarse el tiempo de leer.\r\n\r\nPS: La primer idea era algo similar pero con el chat enemigo... leer lo que están escribiendo, insertar lineas de texto, mutear algún player, bla bla bla... pero me parecio que usarlo en contra de la visión era más útil...","replies":[{"poster":"BioTron","date":"2015-02-04T20:46:01.141+0000","up_votes":3,"down_votes":0,"body":"Watch Dogs.\nPor cierto, ese nombre, pls.","replies":[]},{"poster":"GinTaicho","date":"2015-02-04T20:59:29.934+0000","up_votes":2,"down_votes":0,"body":"Entiendo que los wards son importantes, pero todos los campeones del lol tienen una habilidad que haga daño, además ¿en una TF solo podría dar ataques básicos?\nSolo lo imagino corriendo por el mapa alterando wards y planeando emboscadas con la E.\n\nPD: el nombre no es muy cómodo de leer.","replies":[]},{"poster":"Rob Halfords bae","date":"2015-02-04T20:52:33.637+0000","up_votes":2,"down_votes":0,"body":"Pero seria un campeon puramente de ataques basicos? osea sus habilidades no hacen nada mas que joder los wards enemigos","replies":[]},{"poster":"Auritre","date":"2015-02-04T21:30:32.654+0000","up_votes":1,"down_votes":0,"body":"Pensé lo mismo... se le puede agregar daño, los foros son para discutir ideas, digan sus ideas en este estilo de campeón y quizás entre todos armamos un super campeón niega visión...\n\nEl nombre no veo por qué es un problema...","replies":[]}]}