{"poster":"Sandohar","date":"2016-11-28T19:16:43.777+0000","title":"¿A mayor ELO menos...?","subforum":"Charlas Generales","embed":{"description":null,"url":"http://www.latribugamer.es/wp-content/uploads/2014/11/Ligas-LoL.png","image":null},"up_votes":22,"down_votes":0,"body":"&iquest;Como estan invocadores? En el d&iacute;a de hoy vengo a hacer un pedido de su opini&oacute;n y contarles un poquito mi opini&oacute;n acerca de las distintas divisiones (solamente las que yo estuve, no voy a hablar de diamante y de platino solamente lo que pude ver en cuanto a lo que se me emparejo).\n\n\nResulta que hace aproximadamente 1 semana era Oro IV (sin mencionar que esta season la comenc&eacute; en bronce 3) y actualmente acabo de perder la promo para Platino (cabe destacar que me estan emparejando con Platinos IV-II) y en el paso por estas ligas comenc&eacute; a notar algo.\n\n                                                                                            <hr>\n                                                                                            <hr>\n                                                                                       **_BRONCE_**\nPartamos de bronce, bronce son jugadores que quiz&aacute;s quieren subir pero no se dan el tiempo de aprender, y pensar las cosas en fr&iacute;o, es preferible no asumir una culpa y tirar la mierda a otro. \nPero en la base de esta liga, se encuentran jugadores que realmente se divierten jugando, en los momentos que jugu&eacute; en mi &quot;smurf&quot; de bronce V (la dej&eacute; ah&iacute; para ir subiendola tranquilo desde bien abajito, tengo que admitir que es divertido) las personas en este elo no se flamean (bueno si hay flamers pero por dios, no se compara ni por cerca).\nUna vez vamos subiendo por bronce se empieza a ver mejor&iacute;a de nivel, aumento de los cs per min, algunas rotaciones b&aacute;sicas empiezan a dar flote y algunas mec&aacute;nicas, pero tambi&eacute;n la hostilidad.\n<hr>\n<hr>\n                                                                                         **_SILVER_**\nSilver, esta liga esta como mezclada hay gente que promete mucho y gente que promete m&aacute;s de lo que va a hacer, es ah&iacute; donde se notan las personas que van a subir con mayor facilidad y las personas que van a tener que meterle esfuerzo, pila y aprender (yo fu&iacute; del segundo grupo D:).\nDe todas formas al igual que en la secuencia anterior la hostilidad aumenta, y el ego se va apoderando del jugador, vemos una mejora notable en el farm, rotaciones b&aacute;sicas regulares, y algunas mejoras en las mec&aacute;nicas.\n                                                                                                _Silver I_\nAl igual que pas&oacute; con Bronce 1, la gente se motiva por ganar pero no al nivel de Bronce, &iquest;A que voy? las personas que te cruzabas en bronce I realmente quer&iacute;an ganar y no iban a tirar un surrender por nada, en cambio en silver ya empiezan los flameos (y por lo general emparejados con algunos oros, liga cual vamos a ampliar pr&oacute;ximamente) por lo cual el nivel de tilteo o la facilidad para el mismo aumenta notablemente.\n                                                                                                   <hr>\n                                                                                                   <hr>\n                                                                                             **_ORO_**\nYa ganando esas 5 partidas interminables, nos encontramos a los Golds, elo donde ya cada uno tiene por lo general un rol definido y afinidad a ciertos campeones, entienden la base del juego y las rotaciones, &iquest;Que hacer? &iquest;Cuando hacer? &iquest;Por que?, a todo esto se le suma a inferior nivel una falta de lectura del juego y, aumenta como no, el flameo (Esa no se la esperaban) el nivel de insultos en esta liga ya sobre pasa (lo que en otras seasons sol&iacute;a pasar) la xenofobia, insultos directos y por cosas que la verdad no tienen sentido, precoz env&iacute;o del &quot;GG&quot;, y un ego que va en monta&ntilde;a rusa (no de esas que bajan, este solo sube), interesante elo, se empiezan a ver partidas mas movidas pero todav&iacute;a sin la mentalidad (No al 100%) de ganar cuanto antes.\n                                                                                                  _Oro I_\nEmpezamos a ver platinos regularmente, y cada vez son divisiones mas altas de platinos (V-II) algunos ex diamantes; El nivel de juego aumenta MUY notoriamente, las rotaciones se entienden bastante bien, los calls y lectura del juego empiezan a hacerse algo normal, las famosas &quot;predictions&quot; es necesario practicamente para jugar en este ELO ya que si no, te vas a ir quedando atr&aacute;s, aumento del nivel de CS pero no en gran medida, de hecho mucho menos de lo que uno se espera, pero no todo es color de rosas y ac&aacute; va... en este elo el ego ya esta por las nubes, el nivel de flameo que hay es practicamente para entrar a la partida y a la minima cosa que escriben empezar a mutear (cr&eacute;anme lo hago todas las partidas, sobre todo por que soy una persona que se puede exaltar facilmente y no quiero ser flamer, o quiero dejar de serlo totalmente) el &quot;GG&quot; cuando hay muertes en early es algo normal, &iquest;Afk? no me hab&iacute;a cruzado mucho pero en estos 2 d&iacute;as (que jugu&eacute; la promo) durante toda la promo [5 partidas] en 3 partidas tuve 3 personas afk [una por partida]  de todas formas no ven&iacute;a sufriendo eso, y el f&aacute;cil SURRENDER, nunca entend&iacute; si quiera para que existe el surrender de hecho muy poquitas veces puse que si al surrender y es cuando realmente no se puede hacer nada es decir 1 AFK, otra persona que va UNDER pero 0-10, nos tiraron un inhibidor, y nos estan tirando otro, y a todo esto es minuto 12... fuera de eso, soy un partidario del &quot;Never surrender&quot;.\n\n&iquest;Cual es mi conclusi&oacute;n? Que a mayor ELO (notese que nunca hable de diamante estoy hablando Bronce-Platino) la gente tiene menor ganas de ganar, mayor nivel de flameo, tilteo f&aacute;cil, con mas conocimientos pero con un nivel de agresividad impresionante.\nY todo este post lo hice por que, jugadores de Oro, Platino y supongo que diamante, se empiezan a contagiar de esa toxicidad y no perdamos de vista que ya si estas en Oro V estas en el 20% del servidor, actualmente yo soy Oro 1 y estoy en el 5% (CINCO POR CIENTO NO ES NAAAAAAADA).\n&iquest;Es esta la comunidad que queremos gente?.\nHace mucho que no puedo divertirme jugando League of Legends, ya dejo de ser un entretenimiento, por dos razones la primera creo es inevitable, busco mejorar busco aprender de mis errores y jugar a mi m&aacute;ximo nivel, la segunda es TOTALMENTE evitable, toxicidad.\nPara ser sinceros yo deber&iacute;a tener una restricci&oacute;n de chat (reitero, estoy haciendo el triple del mayor esfuerzo mio para dejar de ser una persona toxica, y creanme, sirve, empece a climbear cuando deje de tiltearme por perder, aprend&iacute; que, que yo no me fedee y me stompeen, que yo vaya 2-10 no significa que vamos a perder, significa que quiz&aacute;s mi team me carrea, as&iacute; que busco como aportar al mismo), pero no quita el hecho que deber&iacute;a tener una restricci&oacute;n de chat, una l&aacute;stima que se le de tan poca importancia, sobre todo teniendo en cuenta que 5% (50k personas) son de los mejores que tiene el servidor, Platino, Diamantes.\n\nSi realmente queremos un cambio, no solamente nos quejemos de que no hay un sistema anti flamer, si no, creemos un sistema anti flamer entre los jugadores, intentando calmarnos, calmando a las personas en las partidas y no siendo un t&oacute;xico m&aacute;s.\n\nUn abrazo gente y espero que puedan terminar la pre-season de la mejor forma, un abrazo invocadores.","replies":[{"poster":"LGBT Valentina","date":"2016-11-28T20:55:02.521+0000","up_votes":8,"down_votes":1,"body":"Platino 5 a diamond 3 =\nLa escoria de todos los SV, el 90% de la gente es carried o eloboots que se piensan que son hight elos y justifican sus cagadas con: no me imorta ya llegue a mi liga\nCon lo anterior ya deje en claro, muchos temas generales\n\nEl tema del flameo:\nMientras mas subis de liga, los throws son menores y cada vez, estos tienen mas peso. Se entiende que las % de ganar bajan de forma considerable y hay 2 tipos de throw:\n1: El pelotudo: Ej: Hace face check 2-3-4 veces, al min 30-40 y justificandolo con que hay que poner wards en baron\n2: El unlucky, el tipico de mala suerte o no te la esperas realmente\n\nComo el throw, tiene mayor peso y las % de ganar bajan tanto, es preferible tirar FF ---------> Si y no. Realmente nunca hay que tirar surrender, pero jugar una partida ya tilteado y en la cual el enemigo tiene un clara ventaja y no hace throws, es perder el tiempo y sobre todo no vale la pena","replies":[{"poster":"support girl uwu","date":"2016-11-29T08:07:07.951+0000","up_votes":5,"down_votes":0,"body":"De todos los servers neh, acá en d3 te puede emparejar con challengers o d5's, pero son todos randoms, en BR, NA ,EUW, etc. si llegas a d3 y tenes elo decente te empiezan a tocar gente de teams profesionales y coachs, así que si no jugas bien bajas a d5 y te quedas ahí o hasta bajas más, justamente el problema de este server es que casi no hay gente que juegue para ganar y trate de jugar bien entonces el ''high elo'' se tiene que llenar con lo que haya.","replies":[]}]},{"poster":"MrLuciano","date":"2016-11-29T00:00:21.159+0000","up_votes":4,"down_votes":0,"body":"muy buen post, te felicito, yo empece en bronce 2, jugue 3 rankeds mas y me bajaron a B3 en la season 5, ahora en la 6 llegue a oro tranquilo. yo Nunca flammeo con nadie, no importa si tengo un troll ahi que va 0/40 u otro flammer en el equipo. es totalmente al pedo, si flammeas, tilteas a todo el team\nEjemplo: ya me ha pasado que empiezo una ranked y del otro lado hay 2 trolls que se van a fedear a otras lineas y bueno, va todo bien, tu team va 12/3 y por ahi pum! un error por parte de alguien y se llevan un doble el equipo enemigo y que hacen normalmente? Flammear. Se ponen a insultarse y se comienzan a tiltear, no dejan de ragear y de escribir, por lo que mueren  mas y terminamos perdiendo porque los otros, en vez de aprovechar la situacion, prefieren remarcar los errores de sus aliados en vez de seguir positvos y aprovechar la ventaja.\nyo aparte de nunca flammear, nunca surrendeo. todos tuvimos alguna partida que empezas con tu team 1/10 y se remonta en mid/late game, pero hay que ser optimistas, si sos de los que dicen \"GG\" porque el enemigo tiene 2 kills y en total tu team va 3/2, vas a perder muuuuuuuchas partidas.\ncuando empece a jugar, un tipo de chile me flammeo y trolleo la partida solo porque no queria ir jg y queria ir la linea que yo gane (ganamos) pero le dije \"con esa actitud cuando seamos lv 30 (era el lv 18/20) vas  a terminar bastante mal en rankeds\" a lo que me respondio \"wn malo penca ql vai a qdar en bronse ql\" (si, el rencor que le tengo a ese tipo es extremo, paso 2 años mas o menos y  lo recuerdo exactamente como fue todo, es mas, el fue con jarvan IV) y bueno, hace 1 mes recorde eso y quise ver en que quedo. y ahi anda. Bronce V 0 lp. jajaja\ncomo sea. Muy buen post :3","replies":[{"poster":"ZeroDPS","date":"2016-11-29T20:03:14.482+0000","up_votes":2,"down_votes":0,"body":"fui yo :v","replies":[{"poster":"MrLuciano","date":"2016-12-01T03:19:18.154+0000","up_votes":1,"down_votes":0,"body":"nope, barvosa se llamaba el otro. igual ya dejo de jugar lol por lo que vi","replies":[]}]},{"poster":"Sandohar","date":"2016-11-29T02:15:48.167+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MrLuciano,realm=LAS,application-id=v7qsfXsE,discussion-id=mr5hOP3r,comment-id=0008,timestamp=2016-11-29T00:00:21.159+0000)\n>\n> muy buen post, te felicito, yo empece en bronce 2, jugue 3 rankeds mas y me bajaron a B3 en la season 5, ahora en la 6 llegue a oro tranquilo. yo Nunca flammeo con nadie, no importa si tengo un troll ahi que va 0/40 u otro flammer en el equipo. es totalmente al pedo, si flammeas, tilteas a todo el team\n> Ejemplo: ya me ha pasado que empiezo una ranked y del otro lado hay 2 trolls que se van a fedear a otras lineas y bueno, va todo bien, tu team va 12/3 y por ahi pum! un error por parte de alguien y se llevan un doble el equipo enemigo y que hacen normalmente? Flammear. Se ponen a insultarse y se comienzan a tiltear, no dejan de ragear y de escribir, por lo que mueren  mas y terminamos perdiendo porque los otros, en vez de aprovechar la situacion, prefieren remarcar los errores de sus aliados en vez de seguir positvos y aprovechar la ventaja.\n> yo aparte de nunca flammear, nunca surrendeo. todos tuvimos alguna partida que empezas con tu team 1/10 y se remonta en mid/late game, pero hay que ser optimistas, si sos de los que dicen &quot;GG&quot; porque el enemigo tiene 2 kills y en total tu team va 3/2, vas a perder muuuuuuuchas partidas.\n> cuando empece a jugar, un tipo de chile me flammeo y trolleo la partida solo porque no queria ir jg y queria ir la linea que yo gane (ganamos) pero le dije &quot;con esa actitud cuando seamos lv 30 (era el lv 18/20) vas  a terminar bastante mal en rankeds&quot; a lo que me respondio &quot;wn malo penca ql vai a qdar en bronse ql&quot; (si, el rencor que le tengo a ese tipo es extremo, paso 2 años mas o menos y  lo recuerdo exactamente como fue todo, es mas, el fue con jarvan IV) y bueno, hace 1 mes recorde eso y quise ver en que quedo. y ahi anda. Bronce V 0 lp. jajaja\n> como sea. Muy buen post :3\n\nMe paso algo muy parecido a tu anécdota en una ranked hace muy poquito (Oro 3 o 2 no recuerdo) me toco ADC (Mi rol main) y este individuo quería ir adc, lockea jungla pero se pone a trollear (literal, venía a dar kills) por \"x\" razones yo comienzo a fedearme (decidí no tiltearme y jugar igual la partida con la cabeza en frío) la cosa es que terminamos ganando la partida.\nQue loco que te acuerdes del nick jajaja.\nEn fin, tenes razón en cuanto al snowball de rage, y ojalá podamos disminuir el nivel de hostilidad entre los jugadores para hacer una comunidad y un juego mas ameno.\n\nUn abrazo","replies":[]}]},{"poster":"Maedme","date":"2016-11-28T22:52:21.641+0000","up_votes":5,"down_votes":1,"body":"Es fácil, o competís o te divertís, imposible los 2, si haces un poco de ambos no competis al 100%, para ello tenes que ponerte serio, no digo flamear, pero ¿quien se divierte estando serio?","replies":[]},{"poster":"KatVay OmegaChan","date":"2016-11-28T21:03:09.619+0000","up_votes":5,"down_votes":1,"body":">Nunca entendí si quiera para que existe el surrender de hecho muy poquitas veces puse que si al surrender y es cuando realmente no se puede hacer nada es decir 1 AFK, otra persona que va UNDER pero 0-10, nos tiraron un inhibidor, y nos estan tirando otro, y a todo esto es minuto 12... fuera de eso, soy un partidario del \"Never surrender\".\n\nSi, vos sos de los mios...\nhttp://cdn.memegenerator.es/imagenes/memes/full/1/98/1982012.jpg","replies":[]},{"poster":"Dyslexic Wolf","date":"2016-11-28T21:26:27.268+0000","up_votes":3,"down_votes":0,"body":"Nunca entendí si quiera para que existe el surrender de hecho muy poquitas veces puse que si al surrender y es cuando realmente no se puede hacer nada es decir 1 AFK, otra persona que va UNDER pero 0-10, nos tiraron un inhibidor, y nos estan tirando otro, y a todo esto es minuto 12... fuera de eso, soy un partidario del \"Never surrender\". \n\nEsa es la actitud","replies":[]},{"poster":"NickW","date":"2016-11-28T20:05:11.984+0000","up_votes":3,"down_votes":0,"body":"Si, uno cuando empieza supone que al mejorar la gente va a mejorar su actitud a medida que se escala en el juego (yo al menos lo suponía, por que no se).\nLa verdad es que mientras mas escalas en el juego, más la gente sabe del mismo, más crece el ego y más te agreden por tus errores, por más mínimo que sea.\nEn ligas bajas muchos no reconocen sus errores por no conocerlos, en ligas altas por estar cegados por el ego (no lo digo por experiencia propia, pero tengo conocidos de Maestro para abajo, y confirman que el flameo es cada vez mas asqueroso)\nLo mejor que podes hacer es exactamente eso, mutear si te afecta y dar lo mejor.\nEn mi caso yo recién estoy empezando a jugar como la gente, pero hace un tiempo estaba igual que vos.\nAl final decidí pasar olímpicamente de todos los que insulten (y los he encontrado verdaderamente insufribles a varios), pero entendí que no tiene sentido arriesgar una cuenta a la que le dediqué tanto por un par de personajes a los que con un poco de suerte no me voy a cruzar nunca mas.\nOjala algún día encontremos la forma de terminar con las mil formas de toxicidad que nos cruzamos todos los días y cambiar para crecer como región, pero siempre podemos empezar por ser cada uno mejor día a día.\nSaludos!","replies":[{"poster":"Sandohar","date":"2016-11-29T02:11:02.157+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=NickW,realm=LAS,application-id=v7qsfXsE,discussion-id=mr5hOP3r,comment-id=0001,timestamp=2016-11-28T20:05:11.984+0000)\n>\n> Si, uno cuando empieza supone que al mejorar la gente va a mejorar su actitud a medida que se escala en el juego (yo al menos lo suponía, por que no se).\n> La verdad es que mientras mas escalas en el juego, más la gente sabe del mismo, más crece el ego y más te agreden por tus errores, por más mínimo que sea.\n> En ligas bajas muchos no reconocen sus errores por no conocerlos, en ligas altas por estar cegados por el ego (no lo digo por experiencia propia, pero tengo conocidos de Maestro para abajo, y confirman que el flameo es cada vez mas asqueroso)\n> Lo mejor que podes hacer es exactamente eso, mutear si te afecta y dar lo mejor.\n> En mi caso yo recién estoy empezando a jugar como la gente, pero hace un tiempo estaba igual que vos.\n> Al final decidí pasar olímpicamente de todos los que insulten (y los he encontrado verdaderamente insufribles a varios), pero entendí que no tiene sentido arriesgar una cuenta a la que le dediqué tanto por un par de personajes a los que con un poco de suerte no me voy a cruzar nunca mas.\n> Ojala algún día encontremos la forma de terminar con las mil formas de toxicidad que nos cruzamos todos los días y cambiar para crecer como región, pero siempre podemos empezar por ser cada uno mejor día a día.\n> Saludos!\n\nTal cual no tiene sentido, de todas formas soy una persona bastante temperamental y me termino tilteando, mentiendome en el juego del flameo, una lástima arriesgar mi cuenta y todo el trabajo que estuve haciendo simplemente por unas palabras agresivas que nada van a mejorar, de hecho es como decís con suerte no te vas a volver a cruzar con este, al menos en mucho tiempo; Ojalá pueda calmarme mucho más de acá a un futuro, muchas gracias por compartir tu experiencia.\nUn abrazo","replies":[]}]},{"poster":"Snooow","date":"2016-11-29T04:16:54.452+0000","up_votes":4,"down_votes":1,"body":"A mayor elo, menos vida social :v","replies":[]},{"poster":"Summer Nights","date":"2016-11-29T01:17:50.116+0000","up_votes":2,"down_votes":0,"body":"Menos tiempo de partida","replies":[{"poster":"Sandohar","date":"2016-11-29T02:12:08.821+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mikelicious,realm=LAS,application-id=v7qsfXsE,discussion-id=mr5hOP3r,comment-id=0009,timestamp=2016-11-29T01:17:50.116+0000)\n>\n> Menos tiempo de partida\n\nCuanto más corta la partida, mejor es.\nMenos probabilidades de tirarla y más control de la misma, un abrazo.","replies":[{"poster":"Summer Nights","date":"2016-11-29T04:26:30.299+0000","up_votes":1,"down_votes":3,"body":"So? dije lo contrarío o algo así? Si lo sabre yo que te llevo 2 ligas enteras prácticamente no veo el por qué de la aclaración lol, un abrazo.","replies":[]}]}]},{"poster":"FF 15 Pls","date":"2016-11-30T01:05:20.786+0000","up_votes":1,"down_votes":0,"body":"Esta cuenta la cree hace como 8 meses atrás jugué mis partidas de posicionamiento gane 5/5 y me pusieron en plata 3 luego subí a a oro 2, solo jugaba como 2 a 3 partidas clasificatorias al día, deje de jugar como 6 meses y vuelvo después de mucho tiempo y me dice que por razones de inactividad me bajan de liga me pusieron en bronce 2 yo digo *Que loco bueno a subir a oro otraves* era un iluso que envés de subir baje bronce 4 o 5 :c luego me creo una cuenta smurf juego mis partida de posicionamiento  y gano 9/10 me ponen en oro sigo jugando y llego a platino 3 de donde no puedo salir. Mi cuenta principal(que es esta), esta actualmente en bronce 4 y mi smurf esta en platino 3 osea y mi juego en platino no es que me carren, sino que casi siempre gano mi linea un farmea decente y un kda decente y si pierdo es por las tf por nuestro propios errores sin embargo en bronce gano mi linea  pero mis aliados no (generalmente es asi) un resumen para que yo gane en bronce debo de carrear o que todo el team gane sus lineas(lo cual casi nunca pasa) incluso fui con un amigo que tambien esta en platino y es la misma cosa para ganar carreamos o ganamos linea todos.\nMoraleja: No importa si jugas bien siempre hay algunas personas que la cagan(trolls,afk)\nPreguntas Es dificil salir de bronce\n-SI y no, todo depende de tu jugabilidad y de tus compañeros.\nConsejos: Si quieres salir de bronce o plata debes jugar campeones con la que puedas carrear y hacer un snowball, así que piensas dos veces si quieres salir de esas ligas piqueando temo top con inig o tf adc o piks raros :)","replies":[]},{"poster":"Nibal","date":"2016-11-29T16:19:31.048+0000","up_votes":1,"down_votes":0,"body":"Comparto bastante la opinion con vos, por ahi lo que difiero en algo (no se si lo opinaron) es que la gente se rinde menos en las partidas, por lo menos en mi experiencia. Cuando estaba en bronce y en plata si ibas perdiendo por muchas kills tiraban surrender sin dudar, ya en oro o platino la mayoria de mis partidas las jugue hasta el final, estabamos re mal por ahi pero seguiamos jugando hasta que rompieran nuestro nexo. Asi tambien se dan vuelta mas partidas, sin rendirse","replies":[]},{"poster":"RodriiB","date":"2016-11-29T16:00:32.793+0000","up_votes":1,"down_votes":0,"body":"Buen texto amigo, coincido en todo lo que dices. Con respecto a las ganas de ganar, es increíble como cambia entre divisiones y aun mas entre ligas. Esta season empeze desde bronce 2 y no recuerdo una partida en que haya terminado en surrender, y ahora que estoy en oro 4 (me emparejan con platinos) hay veces que porque tiras una torre o tienen 1 dragón alguien en tu equipo o el rival se queda en base esperando el min 20 para el surrender. La gente es muy poco paciente, y cree que por decir algo de mala manera va a ser que su aliado sea faker por algún momento. \n\nEl cambio debe proponerlo riot, hasta que la gente se de cuenta que realmente está mal lo que hace. En lo personal, trato cada partida de colaborar, y hasta llevarme bien con los rivales, y las pocas veces que se me va la olla como quien dice le doy al /mute all y trato de calmarme y hacer lo mejor que puedo.","replies":[]},{"poster":"Rick Silence","date":"2016-11-29T14:08:13.048+0000","up_votes":1,"down_votes":0,"body":"Y por estas cosas no me dan ganas de empezar a rankear.","replies":[]},{"poster":"WKH4 Sans","date":"2016-11-28T20:25:10.170+0000","up_votes":3,"down_votes":3,"body":"Resumen taringero lvl5:\n\"A cuanto mas elo mas tilteo, mas hostilidad, mas agresión, menos ganas de ganar, mas habilidad\"\n \nOpinion: No es asi, pero como estas en esa liga \"atascado\" siempre es la mierda.","replies":[{"poster":"Sandohar","date":"2016-11-29T02:08:35.908+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WKH4 Sans,realm=LAS,application-id=v7qsfXsE,discussion-id=mr5hOP3r,comment-id=0003,timestamp=2016-11-28T20:25:10.170+0000)\n>\n> Resumen taringero lvl5:\n> &quot;A cuanto mas elo mas tilteo, mas hostilidad, mas agresión, menos ganas de ganar, mas habilidad&quot;\n>  \n> Opinion: No es asi, pero como estas en esa liga &quot;atascado&quot; siempre es la mierda.\n\nNo creo que sea atascado, si tengo que reveer muchas cosas de mi juego pero cuando me propuse salir de oro me llevó de 3 a 4 días subir a Oro 1, es decir hacía una liga por día, y no creo que pase por las ganas de ganar, todos tienen ganas de ganar eso que no te quepa la menor duda si no la actitud de las personas que llevan a...\nY te repito este no es un post de despechado, simplemente es un post de un humilde análisis desde mi punto de vista en cuanto a mi experiencia en las diferentes ligas, ya que siempre hago hincapié en que tengo mucho que mejorar, soy un oro I, no soy un challenger y aunque lo fuese dudo que hiciese todo perfecto, de todas formas gracias por tu opinión.\n\nUn abrazo","replies":[]}]},{"poster":"Tesnologo1","date":"2016-11-28T19:59:10.021+0000","up_votes":1,"down_votes":10,"body":"Mucho texto de golpe, no se entiende nada. Usa párrafos.","replies":[{"poster":"Sandohar","date":"2016-11-29T02:02:55.062+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Tesnologo1,realm=LAS,application-id=v7qsfXsE,discussion-id=mr5hOP3r,comment-id=0000,timestamp=2016-11-28T19:59:10.021+0000)\n>\n> Mucho texto de golpe, no se entiende nada. Usa párrafos.\n\nGracias ahora edito ^^","replies":[]}]},{"poster":"KShyGuy","date":"2016-11-28T20:14:02.659+0000","up_votes":2,"down_votes":7,"body":"Consejo:\n1. Separa cada punto con numeros\n2. O con parrafos de una linea de separacion. Ej:\n\nxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx\n\nxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx\n\nSaludos {{champion:62}}","replies":[]}]}