{"poster":"BerserkingBubu","date":"2015-05-23T12:02:13.108+0000","title":"2 wochen bann","subforum":"Spielerverhalten & Moderation","up_votes":5,"down_votes":9,"body":"hallo erstmal m&ouml;chte ich bitten hier nicht auf die rechtschreibung zu achten und zweitens m&ouml;chte ich klarstellen, dass es hier nicht darum geht das ich zu unrecht gesperrt wurde. also ich habe vor kurzem ca. 10sekunden nach einem spiel eine nachricht bekommen das mein account 2 wochen gesperrt wird und in einer email wurde mir dann der chatlog gezeigt. ich habe mich falsch verhalten und mich wie ein Kleinkind verhalten das gebe ich zu jedoch wage ich zu behaupten das die banns nicht schon bei 2 wochen anfangen wenn es nicht um ein radikales thema geht. ansonsten m&uuml;ssten 3 andere personen in diesem spiel auch gebannt worden sein und genauso wundere ich mich wieso das so schnell ging. es ist ja allgemain bekannt das das system ein bisschen falsch liegen kann was man an experimenten sieht wenn 5 prmades einen reporten f&uuml;r offensive language und der ohne chatlog wirklich gesperrt wird. also ist hier meine frage: wieso war der este bann sofort 2 wochen und wie konnte er so schnell vollzogen werden?","replies":[{"poster":"Humpelstilzche","date":"2015-05-23T14:18:16.028+0000","up_votes":4,"down_votes":0,"body":"Du hast insofern Recht, dass 2-Wochen-Bans tatsächlich nicht der Anfang sind, sondern eine der härtesten Strafen über die das System verfügt. Momentan ist es aber tatsächlich die niedrigste, da das neue System (um keine Fehler zu machen) ausschließlich Extremfälle behandelt.","replies":[{"poster":"Kaitri","date":"2015-05-23T17:47:57.967+0000","up_votes":3,"down_votes":1,"body":"humpel müsstest du nicht den thread löschen? ist ein banned thread ohne chatlog oder seh ich das falsch?\n\nedit: wenn wir schon dabei sind\nzählt das nur für das euw forum? im na forum sehe ich schon (sehr viele) threads die sagen sie wurden zurecht gebannt, da ist kein log dabei und die sind über 24h alt","replies":[{"poster":"Dream Goddess","date":"2015-05-23T17:49:50.965+0000","up_votes":1,"down_votes":0,"body":"Stimme dir zu Kairi. Bitte angekündigtes auch durchziehen Humpel. Der Thread war 6 Studen offen, er hatte genug Zeit seine Logs zu veröffentlichen.","replies":[{"poster":"Rkoturdo Ndo","date":"2015-05-23T18:01:41.457+0000","up_votes":4,"down_votes":0,"body":"Heya\nNaja, er behauptet ja nicht der Bann an sich sie ungerechtfertigt, er will ja nur über das Strafmaß diskutieren... \nich würd ja sagen das ist also in Ordnung.\n\nMfG Rkoturdo","replies":[{"poster":"Humpelstilzche","date":"2015-05-24T09:16:35.458+0000","up_votes":2,"down_votes":0,"body":"This.\n\n> und zweitens möchte ich klarstellen, dass es hier nicht darum geht das ich zu unrecht gesperrt wurde\n\nDieser Satz hat mich dazu bewegt den Thread stehen zu lassen, da es hier keinesfalls um die Rechtmäßigkeit dieses Bans geht, sondern nur um eine Frage zur Funktionsweise des neues Systems. Für die Beantwortung dieser Frage sind die Chatlogs nicht relevant.","replies":[{"poster":"Kaitri","date":"2015-05-25T00:53:19.038+0000","up_votes":1,"down_votes":0,"body":"aber das haben nur wir hier in euw oder? in na habe ich nichts dergleichen gesehen das ein chatlog bei der beschwerde \"der bann sei ungerecht\" dabei sein müssten","replies":[{"poster":"Humpelstilzche","date":"2015-05-25T06:27:40.321+0000","up_votes":2,"down_votes":0,"body":"Nur in Deutschland, genau genommen. \nDas liegt daran, dass in Deutschland die Volunteers deutlich größere Befugnisse haben mitzureden, als das in anderen Regionen üblich ist. Also haben haben wir drüber diskutiert, das ganze noch mit Riots Player Behavior Experten abgesprochen, von der Seite ein okay bekommen und dann diese neue Regel eingeführt. Ganz so neu ist die Regel übrigens nicht, auch Riot Pente, unser ehemaliger Community Coordinator hat nach dieser Regel moderiert. Wir haben die Regel lediglich reaktiviert.","replies":[{"poster":"Kaitri","date":"2015-05-25T12:18:11.588+0000","up_votes":1,"down_votes":0,"body":"das die volunteers hier mehr \"rechte\" haben als in anderen regionen liegt wahrscheinlich daran das in na z.b oft lyte im forum unterwegs ist, wobei man hier ja eher sehr selten einen riotler sieht oder?","replies":[{"poster":"Humpelstilzche","date":"2015-05-25T12:50:15.255+0000","up_votes":2,"down_votes":0,"body":"Es liegt eher an einer Verkettung ungünstiger Umstände die uns dann in eine überraschend positive Lage gebracht haben. Wir haben sozusagen aus der Not eine Tugend gemacht. \nWir haben 3 Besonderheiten:\n1. Wir haben Volunteers (die meisten Länder haben keine)\n2. Wir haben keinen Community-Coordinator\n3. Wir haben eine Riot-Mitarbeitering, die sich sozusagen \"auf uns eingelassen hat\"\n\nDiese drei Umstände haben es ermöglicht, dass wir momentan sehr viele Aufgaben übernehmen die normal entweder ein Rioter oder niemand übernimmt. \n\nAch ja: Punkt 4 ist auch noch wichtig:\n\nWir haben so lange gejammert, bis man uns gehört hat^^","replies":[]},{"poster":"Rkoturdo Ndo","date":"2015-05-25T12:26:10.720+0000","up_votes":1,"down_votes":0,"body":"Heya\nOder weil wir hier Humpel haben, der denen sonst aufs Dach steigt^^\n\nMfG Rkoturdo","replies":[{"poster":"Sirrkas","date":"2015-05-25T13:32:39.843+0000","up_votes":1,"down_votes":0,"body":"Ich glaube Humpel hat im Riothauptquartier ein paar wissenschaftliche Lesungen gehalten und jetzt fressen sie ihm aus der Hand^^","replies":[{"poster":"eingew","date":"2015-05-28T16:55:03.253+0000","up_votes":1,"down_votes":1,"body":"omnomnomnomnom","replies":[]}]}]}]}]}]},{"poster":"drexxsack","date":"2015-05-24T09:24:48.050+0000","up_votes":1,"down_votes":0,"body":"Vor allem, weil es ziemlich komisch wäre, einen Thread zu löschen, in dem gefragt wird, immerhin beschwert man sich oft, dass die Leute sich nicht informieren und auf dieser Basis nur meckern. Es wird zwar im Eingangspost gemeckert, aber das Hauptanliegen sind Informationen.","replies":[]}]},{"poster":"Temudschinn","date":"2015-05-23T18:55:55.874+0000","up_votes":2,"down_votes":0,"body":"Und wie soll man das Strafmass diskutieren wenn man das Vergehen nicht kennt?","replies":[]}]},{"poster":"HyperionCH","date":"2015-05-24T08:30:25.121+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Néko Chan,realm=EUW,application-id=KYnfKGf0,discussion-id=Ksv2tvo1,comment-id=000600000000,timestamp=2015-05-23T17:49:50.965+0000)\n>\n> Stimme dir zu Kairi. Bitte angekündigtes auch durchziehen Humpel. Der Thread war 6 Studen offen, er hatte genug Zeit seine Logs zu veröffentlichen.\n\nWie bereits erwähnt dementiert der TE ja gar nicht, dass er zu Recht bestraft wurde und wir können ihm ja auch glauben, dass er als Strafe einen 2-Wochen-ban bekam (was hier auch die übliche Strafe ist).\n\nDie Frage war nur, warum seine Mates - die angeblich auch toxisch waren - keine solche Strafe bekamen.\n\nHier sehe ich als Begründung:\nDas neue System greift nur bei jenen Spielern, welche bereits sehr toxisch sind und wohl bereits eine CR/RR kriegten. Bei diesen Spielern reagiert das Spiel sofort und es werden (sofern kein False-Report) 2-Wochen-bans ausgesprochen.\nBei Spielern, dessen \"Flame-Ruf\" (ein Wert des System) noch nicht so schlecht ist (z.B. flamet nur gelegentlich und nicht allzu hart) wird wohl vorerst nach dem alten System bestraft (d.h. es dauert etwas länger und die üblichen CR/RR-Strafen). Jedenfalls kann ich mir so etwas nur vorstellen, da in der Vergangenheit Riot nie einen Spieler wegen nur einem reporteten Game gleich einen 2-Wochen-ban ausgeprochen hat.\n\nDies würde somit bedeuten:\nWenn man keine Meldung bekommen hat, dass der reportete Spieler eine Strafe kriegte, heisst dies noch nicht, dass es unbestraft bleibt. Er zählt (noch) nicht zu den schlimmsten Fingern im System und wird allenfalls später eine CR/RR kriegen; ohne Verhaltensbesserung dann einen temporären ban.","replies":[{"poster":"BerserkingBubu","date":"2015-05-24T13:23:11.212+0000","up_votes":1,"down_votes":0,"body":"dankeschön für die Informationen. ja selber schuld würde ich da mal zu mir sagen","replies":[]}]}]}]}]},{"poster":"Groath","date":"2015-05-23T12:25:13.369+0000","up_votes":4,"down_votes":2,"body":"Das neu eingeführte System erlaubt es, Spieler sofort zu bannen. Die Chats werden automatisch bearbeitet, deshalb geht es so schnell. Seit dem neuen System gibt es keine Sperrung ohne Chatlog. Der Chatlog ist darauf getrimmt, Spieler zu bestrafen, die sehr negativ auffallen. Was \"sehr negativ\" ist, wird von der Community festgelegt, nicht von deinen Standards.\n\nDas neue System funktioniert einwandfrei, weil die Community entscheidet, was negativ ist und das System daraus lernt. Wenn das Thema radikal ist, dann wirst du permanent gebannt, nicht **nur** für 2 Wochen. Wenn du findest, dass sich Andere zu unrecht verhalten haben, reportest du sie. Wenn ihr alle zusammen in einem Meer von Beleidigungen untergeht, werdet ihr alle bestraft, so einfach.\n\nWenn du mehr Informationen willst, musst du deinen Chatlog posten.","replies":[{"poster":"Team Carry Me Pl","date":"2015-05-27T10:13:44.318+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"HyperionCH","date":"2015-05-27T11:04:41.021+0000","up_votes":3,"down_votes":0,"body":"Sorry, aber ich kann nur sagen, dass der ban klar berechtigt ist:\n\n- Du beleidigst deine Mates, dass sie schlecht sind (\"noobs\", \"shit teams\", etc.)\n- Du rufst zu Reports auf, was auch verboten ist\n- Mehrere direkte Beleidigungen (\"have you a brain\" etc.)\n- Vulgäre Sprache (\"shut up\" etc.)\n- Diverse Respektlosigkeit (z.B. dass die Mates Kleinkinder sind)\n\nUnd dies alles mehrmals.\nSorry, aber warum glaubst du denn, dass dein Report unberechtigt ist? Deine Toxiniess ist wirklich extrem hoch. Wenn du nicht bestraft wirst, dann würde ich behaupten, dass das System nicht funktioniert. Aber da du einen ban bekommen hast: System funktioniert.","replies":[{"poster":"Joydi2004","date":"2015-05-27T11:29:33.515+0000","up_votes":2,"down_votes":1,"body":"Ich will ja nicht sagen das deine liste falsch wäre aber das ist in fast jeden spiel so. \n\n\nalleine dieser punkt : \"Du rufst zu Reports auf, was auch verboten ist.\" kenne kaum spiele wo nicht der satz fällt.\n\nReport x for y.\n\ntraurig aber wahr.","replies":[{"poster":"HyperionCH","date":"2015-05-27T11:42:33.148+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Joydi2004,realm=EUW,application-id=KYnfKGf0,discussion-id=Ksv2tvo1,comment-id=0003000100000001,timestamp=2015-05-27T11:29:33.515+0000)\n>\n> Ich will ja nicht sagen das deine liste falsch wäre aber das ist in fast jeden spiel so. \n> \n> \n> alleine dieser punkt : \"Du rufst zu Reports auf, was auch verboten ist.\" kenne kaum spiele wo nicht der satz fällt.\n> \n> Report x for y.\n> \n> traurig aber wahr.\n\nPersönlich sehe ich dies eher selten.\nIch glaube, das letzte Mal gegenüber mir war in einem ARAM wegen \"Pentasteal\". Aber der Reporaufrufer (der \"nur\" einen Quadra bekam), sah dann auch ein, dass ich mit Cassio das Gift auch nicht einfach so steuern kann, damit er den Lasthit kriegt (zumal der Kill auch nicht der 5. war, sondern in der Mitte). Er schrieb dann auch, dass man nicht reporten soll (ich habe ihn deswegen auch nicht reportet).\n\nPersönlich reporte ich wegen einmaligen Reportaufforderungen nicht. Ich sehe es da eher so, dass jener Spieler das Reportsystem (leider) nicht gut kennt. In dieser Hinsicht bin ich also eher entgegenkommend (andere reporten immer bei Reportaufrufen).\nWenn aber mehrmals im Game zum Report aufgerufen wird, kriegt er auch von mir einen Report.\n\nEs ändert aber nichts an der Tatsache, dass der ban klar berechtigt ist, da der Spieler wirklich extrem toxisch ist.\nOb andere Spieler auch toxisch sind, ist egal. Es geht nur um diesen Fall.","replies":[]}]},{"poster":"Team Carry Me Pl","date":"2015-05-27T11:22:53.196+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Irrsinn","date":"2015-05-27T11:35:49.472+0000","up_votes":2,"down_votes":1,"body":"1) \"Der Andere war schlimmer\" entschuldigt und rechtfertigt nicht das eigene Verhalten\n2) Noob ist eine Beleidigung egal wie du es drehst. Erst mal steht es für \"Newbie out of Brain\". Selbst wenn man es als Anfänger ließt - jemanden als blutigen Anfänger zu bezeichnen ist nicht abwertend? Drittens ist die Intention klar den Gegner zu beleidigen. Das wurde immer schon bestraft.\n3) Sorry aber wenn du ihn fragst ob er kein Hirn hat ist das keine Beleidigung? Jetzt redest du dir Dinge schön. Bist du vielleicht Grenzdebil? Oder langsam von Verstand? War jetzt natürlich nicht beleidigend.\n4) Weißt du was das meistgenutzte Wort toxischer Spieler ist? \"Report!\" Reportaufrufe zerstören die Stimmung und ziehen das Team runter. Und ja es ist vollkommen egal, dass die bereits am flamen waren.\n Dabei ist es 100% unnötig andere zum Report zu bewegen. Mehrere Reports in einem Spiel haben keinen übermäßig größeren Einfluss als einer. Dein Report reicht vollkommen.","replies":[]},{"poster":"HyperionCH","date":"2015-05-27T11:34:40.056+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Terator,realm=EUW,application-id=KYnfKGf0,discussion-id=Ksv2tvo1,comment-id=0003000100000000,timestamp=2015-05-27T11:22:53.196+0000)\n>\n> Wenn du meinen Text gelesen hättest, wüsstes du was die ungefähr gemacht haben. Wenn ich den Chatlog hätte vom ganzen Spiel dann würde dir der Kiefer runterklappen, wenn man da mal die Gesamtsituation betrachten würde, wäre dieser Bann nicht gerechtfertigt und versetzte dich mal meine Lage.\n\nEs ist auch völlig egal, was die anderen getan haben.\nDu hast geflamed, du wirst bestraft. \"Der andere hat aber angefangen\" war schon zu Kindergartenzeiten kein hilfreiches Argument und in LoL - ab 12 Jahren freigegeben - ist dies erst recht nicht der Fall.\n\nVielleicht haben die anderen auch geflamet. Aber dies rechtfertigt nicht, dass du auch flamest. Du kannst Flamer ignorieren (notfalls mit mute-Funktion) und sie stillschweigend reporten. Dass Flamer bestraft werden, müsstest du spätestens jetzt wissen. Deshalb kannst du sicher sein, dass jenen Spielern auch eine Strafe erwartet, wenn sie ebenfalls oft flamen.\n\n> Noob ist keine Beleidigung, das heißt \"Anfäger\" soweit ich weiß, dass  ict auch noch hamrlos im gegensatz zu dem was ich mir anhören dürfte. \n\nÜbersetzt ist es die Abkürzung für \"Anfänger ohne Gehirn\". Dies ist klar eine Beleidigung. Ob du dies anders siehst, ist völlig egal.\n\n> Seit wann ist aufrufen zu Reports vebroten? Habe ich vl 3 mal gemacht, die dafür alle 5 min. \n\nReportaufrufe führen zu einer schlechten Teamstimmung. Selbst wenn du (neben dir) noch 2 Flamer im Team hast, sind noch zwei normale Spieler im Team, denen ihr die Stimmung und das Game zerstört.\n\n> Und wenn ich Frage ob die ein Gehirn haben, ist das keine Beleidigung! \n\nDoch! Du stellst den Spieler als dumm da. \"Dummkopf!\" (was dein Satz eigentlich aussagt) ist eine klare Beleidigung.\nUnd nein! Deine Frage kann keine sachliche sein!\n\n> Auch wieder ein Punkt warum die Spieler das Reporten/Bestrafen nicht selber entscheiden dürften, jeder versteht unter Beleidigen oder flaming was anderes. Wenn du ein Problem mit \"noob\" hast, warum spielst dann LoL? Das Wort höre ich alle Spiele bis zu 30 mal.\n\nIch lese \"noob\" ingame sehr, sehr, sehr selten. Aber OK, ich flame nicht und fördere somit solch Reaktionen auch nicht.\nFalls es für dich schlechtes Benehmen usus ist, dann ist dies dein Problem. Aber dann musst du akzeptieren, dass dies entsprechen bestraft wird. Wie gesagt ist es völlig egal, ob die anderen auch ein schlechtes Verhalten aufweisen. Du bist nur für dein eigenes Verhalten verantwortlich.","replies":[]},{"poster":"Usâgi","date":"2015-05-27T11:41:46.620+0000","up_votes":1,"down_votes":0,"body":"Wieder das passende Beispiel das eher Leute wie du nicht wissen wie man sich gegenüber \"Mitmenschen\" verhält. Und wie man sieht wissen die meisten eher als du was man als Beleidigung auffassen kann und was nicht. Bye Bye, niemand wird Flamer wie dich vermissen. Du kannst dich in den 14 tagen ja in ein \"Benimmkurs\" eintragen, sonst wird das nicht dein letzter Ban gewesen sein :)","replies":[]}]},{"poster":"Shíny Umbreon","date":"2015-07-25T05:36:02.654+0000","up_votes":1,"down_votes":1,"body":"Das... könnte meinen jetzigen (gestern) 2 Wochen bann evt. erklären. Hätte mir mal jemand sagen können das zum Report aufrufen verboten ist bzw. mehrere reports nicht soviel bringen. Ich warte zwar noch von Rito ab warum ich überhaupt gebannt wurde, da ich noch keine E-mail erhalten habe, aber das mit dem zum Report aufrufen kann es sehr wohl sein :s Ich flame selber nicht wirklich viel und wenn doch dann ist es eher etwas wie \"shut up pls..\" wenn einer meint in 10 sekunden einen ganzen Roman im teamchat schreiben zu müssen, dass man scheiße ist. Aber dennoch, wenn ich, wie es in letzter zeit immer öfter der Fall war, ein Prem8 Duo im team habe, die natürlich meinen sie dürfen flamen weil sie ja quasi \"Mehr\" sind. Weil wenn sie sich auf einen Fokusieren den sie flamen 2v1 sind. Sag ich des öfteren dann im allchat \"Could you report our bot pls, toxic prem8.\" Aber danke für die {{summoner:13}}","replies":[]}]}]},{"poster":"pulledchicken","date":"2015-05-23T12:35:39.950+0000","up_votes":1,"down_votes":0,"body":"ich kann dich leiden :)","replies":[]}]},{"poster":"NinjaWurst3","date":"2015-05-24T12:03:09.199+0000","up_votes":1,"down_votes":13,"body":"Endlich hab ich einen Grund LoL zu deinstallieren :D Das System ist einfach nicht gut genug getestet bzw überdacht :) Ciao Guys...","replies":[{"poster":"HyperionCH","date":"2015-05-24T12:07:43.137+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=NinjaWurst3,realm=EUW,application-id=KYnfKGf0,discussion-id=Ksv2tvo1,comment-id=0008,timestamp=2015-05-24T12:03:09.199+0000)\n>\n> Endlich hab ich einen Grund LoL zu deinstallieren :D Das System ist einfach nicht gut genug getestet bzw überdacht :) Ciao Guys...\n\nHast du einen Beweis, dass dies der Fall ist?\n\nEin paar Reformkarten sind hier bereits zu sehen und bei allen muss ich bis jetzt sagen: alle berechtigt bestraft.\n\nErst wenn du einen Beweis hast, dass das System nicht gut ist (z.B. viele Fehlentscheide), dann können wir darüber diskutieren. ;)","replies":[{"poster":"NinjaWurst3","date":"2015-05-24T12:14:01.624+0000","up_votes":1,"down_votes":7,"body":"Bin mir nicht sicher ob du das alles genau gelesen hast, aber das report Lux und so weiter ist für mich nicht gleich Flame ;) \nDas ist eine Aufforderung an die Mitspieler, einen Spieler, der sich nicht ordentlich Verhält zu bestrafen. \nWarum soll man wegen so etwas gebannt werden? Das ist einfach unlogisch. \nAm besten ist es meiner Meinung nach, ein Tool einzubauen mit dem man den Ingamechat einfach ausschalten kann, denn wie ich das jt verstehe will Riot überhaupt nicht das wir noch ingame kommunizieren. \nIch bin der Meinung eines Kommentars über uns, man sollte Buttons mit GJ, GG oder ähnlichem einbauen. Wäre meiner Meinung nach viel Zeitsparender und Community freundlicher ;) So würde man den Flame komplett verabschieden ;)","replies":[{"poster":"HyperionCH","date":"2015-05-24T12:24:17.078+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=NinjaWurst3,realm=EUW,application-id=KYnfKGf0,discussion-id=Ksv2tvo1,comment-id=000800000000,timestamp=2015-05-24T12:14:01.624+0000)\n>\n> Bin mir nicht sicher ob du das alles genau gelesen hast, aber das report Lux und so weiter ist für mich nicht gleich Flame ;) \n> Das ist eine Aufforderung an die Mitspieler, einen Spieler, der sich nicht ordentlich Verhält zu bestrafen. \n> Warum soll man wegen so etwas gebannt werden? Das ist einfach unlogisch. \n> Am besten ist es meiner Meinung nach, ein Tool einzubauen mit dem man den Ingamechat einfach ausschalten kann, denn wie ich das jt verstehe will Riot überhaupt nicht das wir noch ingame kommunizieren. \n> Ich bin der Meinung eines Kommentars über uns, man sollte Buttons mit GJ, GG oder ähnlichem einbauen. Wäre meiner Meinung nach viel Zeitsparender und Community freundlicher ;) So würde man den Flame komplett verabschieden ;)\n\nSorry, aber wenn es jener Fall ist, den ich vermute, muss ich sagen:\n100%ig gerechtfertigt.\n\nDer Spieler hat 13x (habe nicht nachgezählt, aber ein anderer User und es kommt etwa hin) zum Report aufgerufen bzw. damit gedroht. Dies beeinflusst die Teamstimmung sehr negativ. Hinzu kommt, dass er sehr wohl die Spieler herablassend behandelte (z.B. sie können nur \"noob champs\" spielen und keine mit Skills etc.)\n\nDie Reformkarte zeigte extrem viel Toxiness und wenn du die Reaktionen liest, siehst du auch, dass die Mehrheit der Community dies als toxisch bewertet.\n\nWenn sich ein anderer Spieler nicht korrekt verhält (z.B. selber flamet, absichtlich feedet, etc.), dann reportet man ihn stillschweigend. Es braucht weder Reportdrohungen noch -aufrufe (1 Report in einem Game ist btw. mehr oder weniger gleich viel wert wie 9).\nSo etwas ist aber nie eine Rechtfertigung, selber toxisch zu werden. Wer dies trotzdem tut, wird ebenfalls bestraft.","replies":[{"poster":"NinjaWurst3","date":"2015-05-24T12:29:08.795+0000","up_votes":1,"down_votes":9,"body":"Aber 14 Tage bann für ein Spiel in der er sich über eine Lux aufregt, die gefeeded hat? \nMuss das sein? Ist das nicht ein bisschen zu übertrieben. Wer hatte noch kein Game in dem er sich übelst über einen aufregen musste? Seid doch mal ehrlich Leute!","replies":[{"poster":"HyperionCH","date":"2015-05-24T12:39:40.511+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=NinjaWurst3,realm=EUW,application-id=KYnfKGf0,discussion-id=Ksv2tvo1,comment-id=00080000000000000000,timestamp=2015-05-24T12:29:08.795+0000)\n>\n> Aber 14 Tage bann für ein Spiel in der er sich über eine Lux aufregt, die gefeeded hat? \n> Muss das sein? Ist das nicht ein bisschen zu übertrieben. Wer hatte noch kein Game in dem er sich übelst über einen aufregen musste? Seid doch mal ehrlich Leute!\n\nJa, ich habe auch Games, wo ich mich aufrege (wobei ich mich öfter über meine schlechte Leistung aufrege als über die der anderen).\nAber hier der grosse Unterschied:\n\n- Ich reagiere mich nicht im chat ab!\n\nDen 2-Wochen-ban kriegt man auch nicht einfach so wegen einem Game.\nMan muss bereits mehrmals negativ aufgefallen sein (z.B. auch schon eine CR gekriegt haben), damit man überhaupt in dieses neue \"Schnell-Verfahren\" kommt.","replies":[{"poster":"NinjaWurst3","date":"2015-05-24T12:49:21.428+0000","up_votes":1,"down_votes":7,"body":"Du redest jt von etwas ganz anderem, den wenn du sagst das jemand aufhören soll zu feeden oder du reportest ihn, ist meiner Meinung nach nicht gerade abreagieren :) .. Es ist einfach nur die Wahrheit. \nWie viele alte Leute sagen: \"Früher war alles besser\"\nEine Chatrestriction ist meiner Meinung nach völlig in Ordnung!.. Das ist die perfekte Strafe für einen Flamer. Von mir aus kann diese sich über 2 Monate hin strecken, aber das Spiel komplett zu sperren ist einfach nur sch... \nJa gut .. Man kann sich sowieso nicht gegen die Entwickler währen :) Wir müssen es hinnehmen wie es ist ;) Aber über Spielerverluste braucht sich niemand wundern!","replies":[{"poster":"Irrsinn","date":"2015-05-24T12:54:51.878+0000","up_votes":4,"down_votes":0,"body":"Einfach nur die Wahrheit kann immer noch Flame sein\n\nUnd die Spiele, die durch das System \"verloren gehen\".... sind für die Community kein Verlust.","replies":[{"poster":"NinjaWurst3","date":"2015-05-24T12:59:10.307+0000","up_votes":2,"down_votes":2,"body":"Wie gesagt, die größte Waffe eines Flamers ist sein Chat. Man kann ihn doch einfach eine restriction geben und gut ist. Vl. macht man es auch gleich so, dass er überhaupt nichts mehr schreiben kann für 2 Wochen oder so. \nAber 2 Wochen überhaupt nicht mehr zu spielen finde ich einfach Sinnlos.. Denn wer überlegt sich sein Verhalten schon in diesen zwei Wochen? Meist werden diese Leute nur noch mehr Toxic und machen sich gleich mehrere Accounts um noch mehr Spaß mit der Community zu haben ;)","replies":[{"poster":"HyperionCH","date":"2015-05-24T13:20:18.115+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=NinjaWurst3,realm=EUW,application-id=KYnfKGf0,discussion-id=Ksv2tvo1,comment-id=000800000000000000000000000000000000,timestamp=2015-05-24T12:59:10.307+0000)\n>\n> Wie gesagt, die größte Waffe eines Flamers ist sein Chat. Man kann ihn doch einfach eine restriction geben und gut ist. Vl. macht man es auch gleich so, dass er überhaupt nichts mehr schreiben kann für 2 Wochen oder so. \n> Aber 2 Wochen überhaupt nicht mehr zu spielen finde ich einfach Sinnlos.. Denn wer überlegt sich sein Verhalten schon in diesen zwei Wochen? Meist werden diese Leute nur noch mehr Toxic und machen sich gleich mehrere Accounts um noch mehr Spaß mit der Community zu haben ;)\n\nSo wie ich es verstanden habe, wird es auch immer noch CR/RR geben.\nDer 2-Wochen-ban ist für Wiederholungstäter; also gegen jene Spieler, die sich trotz CR/RR nicht ändern wollen.","replies":[{"poster":"NinjaWurst3","date":"2015-05-24T13:38:19.514+0000","up_votes":1,"down_votes":2,"body":"Ist doch egal? .. Was wichtig ist, es ist einfach viel, viel zu lange.","replies":[{"poster":"HyperionCH","date":"2015-05-24T13:54:44.258+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=NinjaWurst3,realm=EUW,application-id=KYnfKGf0,discussion-id=Ksv2tvo1,comment-id=00080000000000000000000000000000000000000000,timestamp=2015-05-24T13:38:19.514+0000)\n>\n> Ist doch egal? .. Was wichtig ist, es ist einfach viel, viel zu lange.\n\nWas wäre aus deiner Sicht denn angemessen?\nDu hast keinen Gegenvorschlag gemacht.\n\nWie gesagt gibt es - wie ich es verstanden habe - weiterhin CR/RR. Aber für jene Spieler, die sich nicht bessern, wird wohl eine höhere CR/RR-Strafe auch nichts mehr bringen (einige haben weit über 1000 CR und wollen sich nicht bessern). Für diese extrem toxischen Spieler braucht es eine andere Strafe und Riot hat entschieden, dass es 2-Wochen-bans (und nachher perma) sind.\n\nDiese Spieler hatten bereits mehrmals ihre Chancen, sich zu bessern (oder waren wirklich extremst toxisch, wenn sie bereits sofort einen ban kriegen) und haben beim 2-Wochen-ban immer noch eine Chance, sich zu bessern.","replies":[{"poster":"NinjaWurst3","date":"2015-05-24T14:04:59.841+0000","up_votes":1,"down_votes":2,"body":"Man muss ja nicht gleich auf 2 Wochen gehen.. Oder? \nWürde es nicht zuerst mal eine 5 Tages sperre auch tun? Oder 1 Woche von mir aus, aber 2 Wochen ist schon ziemlich hart.","replies":[{"poster":"HyperionCH","date":"2015-05-24T14:33:54.683+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=NinjaWurst3,realm=EUW,application-id=KYnfKGf0,discussion-id=Ksv2tvo1,comment-id=0008000000000000000000000000000000000000000000000000,timestamp=2015-05-24T14:04:59.841+0000)\n>\n> Man muss ja nicht gleich auf 2 Wochen gehen.. Oder? \n> Würde es nicht zuerst mal eine 5 Tages sperre auch tun? Oder 1 Woche von mir aus, aber 2 Wochen ist schon ziemlich hart.\n\nDas Problem wäre dann wohl, dass 5 Tage/1Woche als letzte Warnung vor dem perma dann wieder als gering eingestuft wird. Ich vermute, viele Spieler, die jetzt ihr Verhalten nicht bessern und damit einen perma kriegen, dann der Meinung sind, dass die Stufe zwischen Wochen-ban + perma zu gross ist. Dann müsste man also nochmals einen Schritt dazwischen einführen (z.B. 2 oder 4-Wochen-ban), was aber dann bedeutet: Flamer kriegen eine zusätzliche Chance (bzw. dürfen länger flamen bis zum perma).\n\nWenn ein Spieler bereits eine (oder mehrere) CR kriegte und eine RR wohl auch nicht abschreckte, der ist bereits extrem toxisch.\nAus meiner Sicht muss der letzte Schritt vor dem Perma auch sehr weh tun. Denn das ist die letzte Möglichkeit für den Flamer, sich noch zu bessern.\n\nIch persönlich fand es sogar kritisch beim \"alten\" System, dass zwischen längeren Chatrestrictions/Rankedsperren und perma eigentlich nichts war (oder falls es bereits temporäre ban gab -> dass es nicht kommunziert wurde).\nEs gab Spieler, die haben z.B. 4000 CR zum Abarbeiten. Wenn man \"als letzte Warnung\" eine 5000 Games-CR aussprach, so juckte es dem Flamer nicht wirklich. Warum auch? Er kann sie eh kaum noch abarbeiten. Dass dies vielleicht die letzte CR vor dem perma war (denn perma gab es immer als \"letzte Massnahme), konnte der Spieler nicht erkennen.\nGerade deshalb finde ich als \"allerletzte Warnung\" eine harte Strafe als sinnvoll; nicht um den Flamer hart zu bestrafen, sondern dass er erkennt, dass dies wirklich die letzte Massnahme ist, bevor der Account ganz gesperrt wird.","replies":[]},{"poster":"hshtagniemehrcdu","date":"2015-05-24T14:09:37.144+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=NinjaWurst3,realm=EUW,application-id=KYnfKGf0,discussion-id=Ksv2tvo1,comment-id=0008000000000000000000000000000000000000000000000000,timestamp=2015-05-24T14:04:59.841+0000)\n>\n> Man muss ja nicht gleich auf 2 Wochen gehen.. Oder? \n> Würde es nicht zuerst mal eine 5 Tages sperre auch tun? Oder 1 Woche von mir aus, aber 2 Wochen ist schon ziemlich hart.\n\nWenn es die erste Stufe wäre.. Ja, das wäre hart.\nDas ist aber nicht die erste Stufe.\nVorher erhälst du noch CR/RR, und vor dem erstem Punish sollte auch ein Fenster auftauchen, dass einen darauf hinweist, dass man überdurchschnittlich oft reportet wird.\n\nWer es nach all diesen Warnungen immer noch nicht kapiert, der ist schlichtweg nicht mehr erwünscht.\nAlso ein letzter, offensichtlicher Hinweis, dann eine permanente Sperre.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"CMan","date":"2015-05-23T12:05:41.882+0000","up_votes":3,"down_votes":0,"body":"Du hast doch in der Mail deinen Chatlog bekommen.\n\nPoste den doch mal hier, damit wir einschätzen können was es damit auf sich hat.\n>es ist ja allgemain bekannt das das system ein bisschen falsch liegen kann was man an experimenten sieht wenn 5 prmades einen reporten für offensive language und der ohne chatlog wirklich gesperrt wird.\n\nUnd das ist nicht weiter als ein Mythos.\n\nGenerell versteh ich dich nicht. Du sagst selber, dass dein Verhalten daneben war. Folge: deinen Bann hast du dir redlich verdient.\n\nDu siehst also, dass das System in deinem Fall absolut funktioniert hat. Wie du da auf die Idee kommst, dass man nur wegen \"Premade-Reports\" gesperrt würde, entbehrt jeglicher Logik.\n\nZuletzt noch für dich zur Info:\nhttp://euw.leagueoflegends.com/de/news/game-updates/player-behavior/neues-system-zur-besserung-des-spielerverhaltens","replies":[]},{"poster":"Shauna aka Vayne","date":"2016-06-09T21:16:06.645+0000","up_votes":1,"down_votes":1,"body":"Ja wenn du dich wie ein kind verhaltest bist du es selber schuld =){{sticker:slayer-jinx-catface}}","replies":[{"poster":"eingew","date":"2016-06-10T06:26:40.155+0000","up_votes":2,"down_votes":0,"body":"Der Thread ist ein Jahr alt... und du kommst jetzt und schreibst das? Wozu?","replies":[{"poster":"Sirrkas","date":"2016-06-10T10:15:34.105+0000","up_votes":1,"down_votes":0,"body":"Imaginary Jungle hat den Thread reanimiert.","replies":[{"poster":"eingew","date":"2016-06-10T12:51:23.908+0000","up_votes":1,"down_votes":0,"body":"Ahhh... dann ist es mein Fehler :D","replies":[]}]},{"poster":"Shauna aka Vayne","date":"2016-06-10T10:13:27.427+0000","up_votes":1,"down_votes":0,"body":"Ich habe auf den foren gecklickt und es war oben und dachte es ist 1 tag alt weil ich da nicht dauf geachtet habe =)","replies":[]}]}]},{"poster":"Temudschinn","date":"2015-05-23T12:05:14.425+0000","up_votes":1,"down_votes":0,"body":"Bitte beachte die neuen Forenregeln:\n> Threads in denen über einen bestimmten Ban diskutiert werden soll, müssen den vollständigen und lesbaren Chatlog (screenshot), den der Spieler erhalten hat, enthalten. Sollte dies nicht der Fall sein, wird der Thread kommentarlos geschlossen oder gelöscht. \n\nAnsonsten ist es für uns unmöglich dir zu sagen warum du direkt einen 2 Wochen Ban erhalten hast.","replies":[{"poster":"Irrsinn","date":"2015-05-23T12:43:28.846+0000","up_votes":2,"down_votes":0,"body":"Ich fühl mich wieder 2 Jahre jünger... \n\nNo reformcard no service","replies":[]}]}]}