{"poster":"MrAukerman","date":"2016-09-23T20:23:11.359+0000","title":"PER GLI ARBITRI/RIOTER DI COMPETENZA:  Sospetto account sharing/smurf","subforum":"Torneo Nazionale italiano","up_votes":2,"down_votes":0,"body":"Salve a tutti, sono MrAukerman, capitano del team I Muppets. Domani, Sabato 24 Settembre, dovremmo disputare la semifinale del loser&#039;s bracket contro il &quot;team B.A.R.&quot;. Sospettiamo, tuttavia, che all&#039;interno di questo team ci possa essere un account smurf/sharato. \r\nNon inserisco il nick in quanto non conforme al regolamento, tuttavia abbiamo notato alcune caratteristiche riguardo tale account:\r\nRankato in season 4 come Platino, non ha disputato alcun game in season 5, salvo poi tornare a giocare, con grande &quot;coincidenza&quot; appena due giorni prima del torneo. Le ultime partite risalivano a pi&ugrave; di un anno fa e si sono trattate di una manciata di partite di ranked team.\r\nRune completamente diverse dai ruoli in cui gioca.\r\nSpicca con kda a dir poco mostruose e con ruoli che non giocava prima della sua &quot;pausa&quot;.\r\n\r\nQuesto era il tabellone del torneo al momento della segnalazione.\r\n\r\nhttp://i63.tinypic.com/k1t2lc.jpg\r\n\r\nI BAR risultavano passati di turno contro il Team Bradbury, per cui sarebbero dovuti essere nostri avversari.\r\n\r\nIl giorno dopo, in seguito alla segnalazione, il tabellone &egrave; cambiato in questo modo.\r\n\r\nhttp://i65.tinypic.com/28i7zix.jpg\r\n\r\nTeam bradbury che passa in finale, con tanto di vittoria a &quot;tavolino&quot; (tipica di passaggi dovuti a squalifica del team).\r\n\r\nIl giorno dopo, il tabellone cambia nuovamente, con il Team BAR che accede nuovamente alla semifinale (nonostante la presunta squalifica) e con un &quot;BYE&quot;, quindi un pass, al posto del team Bradbury. Il team Bradbury era stato ripescato nel winner bracket in seguito alla squalifica dei Thunder Turkeys, a detta del loro capitano. \r\n\r\nhttp://i64.tinypic.com/nex1ug.png\r\n\r\nLa cosa ci ha lasciati non poco confusi. Cosa bisogna fare? E&#039; un errore del sito, a questo punto? La squalifica sembrava essere stata assegnata, altrimenti non capisco il motivo del cambiamento al tabellone, come mostrato nella seconda immagine inviata. Chiedo ai Rioters e agli arbitri incaricati di controllare e almeno mettere chiarezza su questo fatto, specie perch&egrave; domani si gioca e se ci fossero errori dubito che ci sarebbe tempo di rimediare. \r\n\r\nScusate il wallpost.","replies":[]}