{"poster":"KingPin17","date":"2017-09-18T08:07:01.767+0000","title":"Azir's new ult","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Hello, I was quite disappointed to see that the new Azir rework takes away a lot of his range on his abilities but one thing that really took me by surprise is that the in the Azir rework The ult is going to be changed to just normal terrain and I just genuinely think this is a bad idea. When I play Azir I see my ult as a tool to save me and a tool to keep enemies locked up in a position but seeing as people will now be able to dash, jump etc. over the Ulti really ruins makes Azir vulnerable to champs such as Akali, Ahri, Yasuo and many more. For example when I do a Shurima Shuffle the enemy into my tower I find it funny as the enemy tries to get back to me because they have no idea how the ult works and watch them bounce back over and over again. And now seeing as this will be removed champions such as Akali can just jump over the wall and kill me fast because that&#039;s just Akali things.. Overall please just keep the ult the same, It makes doing the Shurima Shuffle and blocking off the enemy so much better and if the Rework follows through with this and Azir&#039;s ult does turn to just normal terrain he will be quite vulnerable considering the fact that a lot of Azir&#039;s range is getting Changed/Nerfed which as an Azir main does make me sad.","replies":[{"poster":"Lord Sesshomaru","date":"2017-09-18T10:06:17.871+0000","up_votes":1,"down_votes":0,"body":"#The wall and its problems:\n\nReworking Azir in general is a bad idea.\n\nWhile I abhor myself for even suggesting an argument that could look like I agree with Riot _(I would never agree to an Azir rework, especially when brainless themeless champs with no niche at all like Jax still exist)._\n\nI cannot deny that the wall was cancerous in its own right.\nThe idea of it was sound. A wall that cannot be dashed over. Thats cool, and is a great element of the game!\nBut in reality there were quirks with it that made it hellish for all players _(even Azir)_.\n\nFirstly, as an Azir player you will have seen _(as we all have)_, people flashing over the wall and being knocked back. While as an Azir player I sweep this under the rug in game because it works to my advantage, it is NOT supposed to happen. \nThis costs many players their flash _(and often causes them to either die, or miss out on a kill they would have had otherwise)_. And so is in direct contradiction to Riot's view of clarity. \n\nYou may also have encountered situations where the wall pins someone against terrain and either knocks them back several times as they try to land _(treating its own CC as an enemy dash)_, or just blatantly pins them there for the whole duration. \nAgain this isn't working as intended and is completely unfair to the poor soul being disadvantaged.\n\nThe wall also is very inconsistent, sometimes it knocks champs back a long way, sometimes it doesn't even affect them at all, and sometimes it knocks them up but doesn't change their position.\n\nhttps://vimeo.com/193233753\n\n^ this is the kind of shit I'm talking about. I knocked Yasuo back, and he lands right on my face _(on my side of the wall)._ and this stuff happens A LOT.\n\n\n_______________________\n\n#Easier to sweep your problems under the rug than face them:\n\n\nSo for clarity reasons, I can see Riot's logic for taking this feature out.\n\n**However** they only reason it is a problem in the first place is because of Riot's complete inability to bugfix the wall, _(it's been here doing this and worse, for 3 years and they still haven't figured out how to fix their own code)_.\n\nNot to point fingers, but if the bugfix team had done its job properly at any point in the last 3 years, Azir's ult would probably not be changing now.\n\nSo yes the wall does need to stop this aberrant behaviour, it is unfair to other players as well as Azir. Unfortunately Riot is incapable of fixing it _(or maybe unwilling)_, and so their easiest option to to remove it entirely.\n\nDoes this screw over the Azir players? Yes!\nIs it a slack as fuck option? Yes!\nIs there an alternative? Probably not. _(but they ain't making any money off this so if there is one, they sure aren't gunna bother looking for it anyway! They only just decided to rework Azir a few months ago, so that shows how much time has gone into this rework.)_\n\n_______________________\n\n#Is the emperor overloaded?:\n\nIt also can't be denied that Azir has a heck of a lot in his kit. On release he had:\n\nInstant Zoning.\nA slow.\nAn Aoe knock back.\nTerrain creation.\nAnti-dash knock back.\nA dash.\nA knock up.\nA shield.\nAn entire turret.\nPassive CDR.\nThe ability to use spells to damage towers.\nAND also happened to have hyper carry level damage....\n\nThat a heck of a lot of shit in one champ's kit _(like thats almost verging on Lee Sin level overloaded)_, his only saving grace was that he was near impossible to play well.\nOver time they have whittled away at his kit, removing the knockup, CDR, W tower damage, etc etc. In favour of keeping his damage.\n\nand now we are reaching a point where they have just made him a straight up damage machine and are throwing all of his utility out the window.\nPersonally id have liked to see the opposite, I would have like to see him with less damage but keep his unique utility.\n\n\n________________________\n\n#More Vulnerable?:\n\nObviously this change will inevitably make Azir at least a little more vulnerable, but by how much?\n\nYou make a point about Azir being more vulnerable to champs like Yasuo/Ahri/Akali now. \nIn my opinion, if those champs have even one brain cell between them, Azir is and has always been vulnerable to them, as they all have enough dashes to go right around the wall and still reach him. All they need to do is just not waste them trying to go over the wall.\n\nMost champs are vulnerable to Ahri, nearly all of them are vulnerable to Akali post-6, and Yasuo is always a bitch to fight. So if Azir becomes more vulnerable to them, it's not like he will be alone in the club. And the more people that are vulnerable to those champs, the more likely they are to be nerfed!\n\n\n________________________\n\nTbh I don't even know why Im making this post...\nI don't want to support any form of rework to my baby. But I also think if you're going to oppose the rework, you have to attack the right parts of it, and without doubt removing the anti-dash wall has merits, too many merits to be an effective argumentative point for opposing the rework (in my opinion).\n\nBut don't listen to me aye.. \nI'm just furious that they rework Azir, a champ that few notice, fewer care about, and even fewer actually play, before they rework actual in-every-game cancer like Yasuo or Ahri. as well as before champs like Jax that have literally 0 personality, 0 niche, 0 thematic appeal, and 0 skill in his playstyle.\n\n\n\n#TL;DR:\nLord Sesshy rambling in depression over the loss of much of his favourite champ...\n{{sticker:sg-janna}} {{sticker:sg-janna}} {{sticker:sg-janna}} {{sticker:sg-janna}} {{sticker:sg-janna}} {{sticker:sg-janna}} {{sticker:sg-janna}} {{sticker:sg-janna}}","replies":[{"poster":"KingPin17","date":"2017-09-24T07:37:15.990+0000","up_votes":1,"down_votes":0,"body":"Every part of this response is ever so true...","replies":[]}]}]}