{"poster":"NthSkate55","date":"2016-04-23T19:48:21.004+0000","title":"gg server o gg vtr ?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Tengo vtr (chile) la cosa esque estaba jugando ranked y URF y se me &quot;caia&quot; de la nada el internet siendo falso porque estaba escuchando musica en spotify la cual necesito internet pero en el juego hacia click y no me movia.Incluso estaba en TS con unos compa&ntilde;eros y aun asi no se me &quot;caia&quot; el internet pero del lol si no lo se si es vtr o el server, ganandome asi el ban de leaver buster por 5 partidas.\r\n\r\nAyuda pls","replies":[{"poster":"Eternal Rain","date":"2016-04-23T22:04:27.825+0000","up_votes":1,"down_votes":0,"body":"Yo tuve que aumentar los megas porque me andaban mal los ms, quizás sea eso, aunque cabe recalcar que lo tuyo puede ser mas bien otro problema, por otro lado quizás tengas Wi-fi, al tener eso pierdes algunos paquetes y por eso a veces te sale el reanudando conexión independiente si sigues escuchando musica del spotify ya que este se supone que ya cargo las 5 canciones siguientes al momento en que se te cayo(por darte un ejemplo solo para que te hagas la idea), ahora si es por Wi-fi que pierdes paquetes de datos, debe ser por las paredes de tu casa y para esto no estoy muy seguro pero creo que debes cambiar de lugar tu módem y router o mas bien hacer un cambio de estos.\n\nSaludos.","replies":[{"poster":"NthSkate55","date":"2016-04-23T22:11:57.311+0000","up_votes":1,"down_votes":0,"body":"Pero si hasta ayer a eso de las 19:00 hrs empezo a caer solo en el league.","replies":[{"poster":"Eternal Rain","date":"2016-04-24T03:35:50.239+0000","up_votes":1,"down_votes":0,"body":"independiente de eso, revisa tu ping entonces si pierdes paquetes de datos, a traves del cmd\n\ntecla windows+ r-> cmd-> enter-> ping google.com -t, ahí veras tu ms y cuando te salga tiempo de espera nose cuanto es cuando pierdes paquetes, yo solo dije que puede ser eso si no, pues es el lol","replies":[]}]}]},{"poster":"Condor","date":"2016-04-23T21:19:40.046+0000","up_votes":1,"down_votes":0,"body":"VTR, a mi me anda bien por lo general, pero a veces el servicio anda inestable.","replies":[{"poster":"NthSkate55","date":"2016-04-23T21:26:14.552+0000","up_votes":1,"down_votes":0,"body":"A mi igual pero desde ayer a eso de las 19:00 hrs no puedo ni jugar league.","replies":[]}]},{"poster":"ZetsubouFallen","date":"2016-04-23T20:27:37.753+0000","up_votes":1,"down_votes":0,"body":"VTR, de este lado de la cordillera anda bien.","replies":[{"poster":"NthSkate55","date":"2016-04-23T21:19:53.796+0000","up_votes":1,"down_votes":0,"body":"Quiero que me  den una respuesta porque puedo jugar otros juegos como btf4 guild wars 2 COD y no se me cae y con league si","replies":[]}]},{"poster":"NthSkate55","date":"2016-04-23T21:17:09.959+0000","up_votes":1,"down_votes":0,"body":"entonces que puede ser ya no puedo ni jugar :l","replies":[]},{"poster":"Sonya Kyron","date":"2016-04-23T22:18:44.690+0000","up_votes":1,"down_votes":1,"body":"el server anda joya, pero tene en cuenta que el 95% de los que se quejan de que anda mal el LOL son usuarios de VTR chile.","replies":[]}]}