{"poster":"Borstin","date":"2020-01-04T10:09:11.013+0000","title":"Permaban für 3d Party Programm","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":1,"body":"Mein Account wurde Permanent gebannd, für das benutzten von 3dPartyProgramms! Aber ich benutzte keine bis auf die Blitzapp und diese wird ja von Streamern benutzt, diese werden dafür ja nicht gebannd. Mein Account ist über 10 Jahre alt und es steckt eine Menge Geld in diesem. Nimmt Riot, Bans überhaupt zurück? Ist die Blitzapp illegal ?","replies":[{"poster":"II3RDB4NG","date":"2020-01-04T10:37:47.004+0000","up_votes":4,"down_votes":4,"body":"Ich wollt mir die Seite/App anschauen und bin direkt wieder raus als Ich gesehen habe, das das aus Russland kommt, ohne Sandbox geht Ich da nicht drauf.\nIch würde mir niemals Software heutzutage aus Russland herunterladen.\nGenauso wenig wie aus China.\nIch lad mir nicht mal Mods für Transport Fever sobald Ich da kyrillische Schriftzeichen entdecke.\nAber es soll Leute geben die benutzen auch Programme aus Nordkorea.","replies":[{"poster":"Allerbester Biss","date":"2020-01-04T12:27:46.865+0000","up_votes":2,"down_votes":0,"body":"Tencent kommt nochmal aus welchem Land?","replies":[{"poster":"Eroticat Nimar","date":"2020-01-04T13:15:06.907+0000","up_votes":1,"down_votes":2,"body":"England","replies":[{"poster":"Shiroi Kumą","date":"2020-01-04T13:46:57.080+0000","up_votes":1,"down_votes":0,"body":"Fast, nur etwa auf der anderen Seite der Welt.","replies":[{"poster":"Eroticat Nimar","date":"2020-01-04T14:04:01.009+0000","up_votes":7,"down_votes":1,"body":"Close enough","replies":[]}]}]},{"poster":"II3RDB4NG","date":"2020-01-04T18:17:27.671+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Allerbester Biss,realm=EUW,application-id=KYnfKGf0,discussion-id=R6qTfmpW,comment-id=00010000,timestamp=2020-01-04T12:27:46.865+0000)\n>\n> Tencent kommt nochmal aus welchem Land?\n\nGähn, ist dir die Argumentation nicht selbst zu peinlich....ernsthaft, darauf geh Ich gar nicht erst ein, aber so ist das Internet.","replies":[{"poster":"Allerbester Biss","date":"2020-01-04T18:37:34.724+0000","up_votes":2,"down_votes":0,"body":"Du lädst Dir nichts aus China runter, aber Lol ist natürlich nicht aus China!\n\nhttps://de.m.wikipedia.org/wiki/Tencent","replies":[]}]}]},{"poster":"MeMyselfandBaal","date":"2020-01-04T17:53:10.018+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=II3RDB4NG,realm=EUW,application-id=KYnfKGf0,discussion-id=R6qTfmpW,comment-id=0001,timestamp=2020-01-04T10:37:47.004+0000)\n>\n> Ich wollt mir die Seite/App anschauen und bin direkt wieder raus als Ich gesehen habe, das das aus Russland kommt, ohne Sandbox geht Ich da nicht drauf.\n> Ich würde mir niemals Software heutzutage aus Russland herunterladen.\n> Genauso wenig wie aus China.\n\nDu benutzt also eher WhatsApp als Telegramm... Weil es besser ist, wenn Facebook mitliest? \nOh und gehört LoL nicht Tencent und ist damit eigentlich aus China?","replies":[{"poster":"II3RDB4NG","date":"2020-01-04T18:18:53.996+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=KYnfKGf0,discussion-id=R6qTfmpW,comment-id=00010002,timestamp=2020-01-04T17:53:10.018+0000)\n>\n> Du benutzt also eher WhatsApp als Telegramm... Weil es besser ist, wenn Facebook mitliest? \n> Oh und gehört LoL nicht Tencent und ist damit eigentlich aus China?\n\nIch hab ein Facebookaccount zum trollen und nein Ich benutz diesen ganzen Mist nicht. \nMein Vater hat beim MAD gearbeitet und uns Kinder sehr sehr früh geeicht, Ich weiß wie die Welt läuft seit Ich das erste Mal daheim das telefon benutzt habe und bevor Ich lernte Hallo zu sagen musste ich lernen welche Wörter Ich am Telefon vermeide um nicht gewisse maschinen in Gang zu setzten.\nMei Vadder sagte vor kurzen er findet es richtig geil wie einfach die Menschen ihnen Ihre Arbeit mittlerweile machen, ach und bevor ich es vergesse du bekommst für den lächerlichen Vergleich auch noch die Antwort siehe oben, Gähn, ist dir die Argumentation nicht selbst zu peinlich....ernsthaft, darauf geh Ich gar nicht erst ein, aber so ist das Internet.","replies":[{"poster":"MeMyselfandBaal","date":"2020-01-04T18:26:44.140+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=II3RDB4NG,realm=EUW,application-id=KYnfKGf0,discussion-id=R6qTfmpW,comment-id=000100020000,timestamp=2020-01-04T18:18:53.996+0000)\n>\n> Ich hab ein Facebookaccount zum trollen und nein Ich benutz diesen ganzen Mist nicht. \n> Mein Vater hat beim MAD gearbeitet und uns Kinder sehr sehr früh geeicht, Ich weiß wie die Welt läuft seit Ich das erste Mal daheim das telefon benutzt habe und bevor Ich lernte Hallo zu sagen musste ich lernen welche Wörter Ich am Telefon vermeide um nicht gewisse maschinen in Gang zu setzten.\n> Mei Vadder sagte vor kurzen er findet es richtig geil wie einfach die Menschen ihnen Ihre Arbeit mittlerweile machen, ach und bevor ich es vergesse du bekommst für den lächerlichen Vergleich auch noch die Antwort siehe oben, Gähn, ist dir die Argumentation nicht selbst zu peinlich....ernsthaft, darauf geh Ich gar nicht erst ein, aber so ist das Internet.\n\nDa hat dein Vater dir nicht auch erklärt, dass du nicht überall mit seinem Job hausieren gehen sollst?","replies":[]}]}]},{"poster":"eingew","date":"2020-01-06T16:19:17.817+0000","up_votes":2,"down_votes":0,"body":"China ist der größte Markt der Welt. Die meisten Menschen benutzen Produkte, die von dort kommen. Mit hoher Wahrscheinlichkeit ist dein Post über ein Gerät zustande kommen, welches zumindest teilweise in China hergestellt wurde - und das gilt sowohl für die Hard- als auch die Software.","replies":[]},{"poster":"Alustus","date":"2020-01-04T14:57:16.155+0000","up_votes":2,"down_votes":0,"body":"Ich finde es zwar generell gut wenn man hinterfrägt woher etwas kommt, dennoch finde ich es verwunderlich, wesshalb man ganz Russland/China unter Generalverdacht stellt aber den Rest der Welt vertraut.\n\nUnd wenn du nicht auf deinem Arbeitsrechner Zockst auf dem irgenwelche Firmengeheimnisse etc. gespeichert sind, dann hat sowieso niemand interesse daran dich auszuspionieren.\n\nDer normalo Bürger in Deutschland wird eher von den USA in zusammenarbeit mit Deuschen behörden ausspioniert, als von den bösen Russen/Nordkoreanern/Chinesen.\n\nUnd davon abgesehen ist RIOT schon seit ein paar Jahren im Besitz von Tencent einem Chinesischen Megakonzern welcher auf augenhöhe von Apple, Microsoft, Google operiert.\n\nTencent hat übrigens auch enormen einfluss auf Blizzard/Activision, EPIC Games und viele mehr.","replies":[{"poster":"Darkr3sQ","date":"2020-01-07T16:26:23.050+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alustus,realm=EUW,application-id=KYnfKGf0,discussion-id=R6qTfmpW,comment-id=00010001,timestamp=2020-01-04T14:57:16.155+0000)\n>\n> Ich finde es zwar generell gut wenn man hinterfrägt woher etwas kommt, dennoch finde ich es verwunderlich, wesshalb man ganz Russland/China unter Generalverdacht stellt aber den Rest der Welt vertraut.\n> \n> Und wenn du nicht auf deinem Arbeitsrechner Zockst auf dem irgenwelche Firmengeheimnisse etc. gespeichert sind, dann hat sowieso niemand interesse daran dich auszuspionieren.\n> \n> Der normalo Bürger in Deutschland wird eher von den USA in zusammenarbeit mit Deuschen behörden ausspioniert, als von den bösen Russen/Nordkoreanern/Chinesen.\n> \n> Und davon abgesehen ist RIOT schon seit ein paar Jahren im Besitz von Tencent einem Chinesischen Megakonzern welcher auf augenhöhe von Apple, Microsoft, Google operiert.\n> \n> Tencent hat übrigens auch enormen einfluss auf Blizzard/Activision, EPIC Games und viele mehr.\n\nEin schöner Fehler, den viele Privatanwender machen:\nBei mir sind keine interessante Daten drauf, also nutzt das dem bösen Hacker auch nichts.\nSchon mal was von Botnetzen gehört? Die Rechenleistung des PrivatPCs ist durchaus interessant, und die hat nun einmal jeder Benutzer, der im Internet unterwegs ist.","replies":[]}]}]},{"poster":"Ráyleigh","date":"2020-01-04T10:14:41.298+0000","up_votes":4,"down_votes":0,"body":"Schreib bitte mit dem Support.\n\nDie können dir genau sagen was erlaubt ist und was nicht.\nEin Bann wird eventuell nur wenn ein Fehler vorliegt zurückgenommen.\nAber! Unwissenheit schützt vor Strafe nicht zählt hier wie im echten Leben.\nHast du also wirklich eine App benutzt die nicht zugelassen ist bleibt der Bann bestehen.\nBei der Blitzapp bin ich mir nicht sicher.","replies":[{"poster":"Borstin","date":"2020-01-04T10:16:28.810+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Ráyleigh,realm=EUW,application-id=KYnfKGf0,discussion-id=R6qTfmpW,comment-id=0000,timestamp=2020-01-04T10:14:41.298+0000)\n>\n> Schreib bitte mit dem Support.\n> \n> Die können dir genau sagen was erlaubt ist und was nicht.\n> Ein Bann wird eventuell nur wenn ein Fehler vorliegt zurückgenommen.\n> Aber! Unwissenheit schützt vor Strafe nicht zählt hier wie im echten Leben.\n> Hast du also wirklich eine App benutzt die nicht zugelassen ist bleibt der Bann bestehen.\n> Bei der Blitzapp bin ich mir nicht sicher.\n\nIch weis Strafe ist Strafe.... aber Streamer haben dafür Werbung gemacht also hab ich sie mir runtergeladen, wenn die nicht dafür gebannd werden aber ich, ist das ja mal wieder ein schönes Zeichen von Gerechtigkeit. Ich wüsste auch nicht was die Blitzapp macht was ich nicht selber machen könnte.","replies":[{"poster":"Ráyleigh","date":"2020-01-04T10:21:30.475+0000","up_votes":4,"down_votes":0,"body":"Ich kenne die App leider nicht ^^\nSchreib mit dem Support.\n\nVorher hat es keinen Sinn sich aufzuregen.","replies":[]},{"poster":"HyperionCH","date":"2020-01-06T14:35:41.644+0000","up_votes":3,"down_votes":0,"body":"Ich kenne die App zwar nicht, aber:\n\nNur weil Streamer Werbung dafür machen, heisst dies nicht, dass die App auch legal ist.\n\nSo wie ich es verstanden habe, kriegt man von den Gegnern bereits Angaben in der Champ Select.\nAus meiner Sicht ist dies doch ein Vorteil, den man manuell nicht bekommt (auf op.gg kriegt man diese Angaben erst nach der CS). Gerade gegen OTPs kann man so ihren Main bannen.\n\nIch glaube, es gab auch früher bereits eine App, die zuerst legal war, jedoch dort weitere Funktionen eingefügt wurden, die dann Riot Games nicht mehr als legal sah (da Vorteile für den Spieler).\nEntsprechend sind solche Apps immer sehr heikel und sollte man besser meiden. Denn was heute von Riot Games noch toleriert wird, kann morgen - u.a. wegen neuen Funktionen in der App - bereits ein Bangrund sein.\n\nbtw. hast du vorher einen 2-Wochen-ban gehabt?\nNormalerweise kriegt man deswegen zuerst einen solchen und dann kommt erst der perma.","replies":[{"poster":"Sirrkas","date":"2020-01-06T14:56:17.788+0000","up_votes":3,"down_votes":0,"body":"Bei Betrug sollte es stets direkt zum Permabann kommen. Da wäre eine Vorstrafe eher die Aussnahme.","replies":[{"poster":"HyperionCH","date":"2020-01-06T15:34:30.235+0000","up_votes":1,"down_votes":0,"body":"Soweit ich mich erinnere, war dies bei jenem 3rd Party Program vor einigen Jahren grundsätzlich ein 2-Wochen-ban (sofern man nicht bereits einmal deswegen - bzw. einem anderen 3rd Party Program - einen ban hatte).\n\nDamals war es aber wie gesagt wegen einer neuen Funktion und die Software wurde vorher noch von Riot Games toleriert; wahrscheinlich, weil nicht alle Spieler die Vorteile nutzten (z.B. kein Update machten und die unerlaubte neue Funktion gar nicht nutzten, etc.).\n\nOb Blitzapp wegen neuer Funktionen nun nicht erlaubt ist oder eigentlich bereits immer nicht erlaubt war (da bereits immer Vorteile vorhanden waren), ist mir nicht bekannt.\nDies könnte natürlich dazu führen, dass man sofort einen perma kriegt. \n\nPersönlich finde ich es etwas \"heikel\", wenn eine solche App (so wie es hier klingt) doch eine längere Zeit unbestraft benutzt wurde (obwohl es Vorteile bietet) und dann gleich einen perma gesprochen wird. Nutzer könnten effektiv der Meinung gewesen sein, dass die Software erlaubt gewesen sei.\n\nJedoch bin ich nicht wirklich \"in dieser Szene\" drin.\nAus meiner Sicht sollte das Strafmass abhängig davon sein, wie offensichtlich es ist, dass die Software wegen Vorteilen im Spiel nicht erlaubt ist.\nWenn für den Nutzer glasklar war (sein müsste), dass dies eigentlich nicht erlaubt ist, dann geht ein perma auch völlig OK (Alternativ: rasche Bestrafung mit 2-Wochen-ban; bei weiterer Nutzung nach einer weiteren Woche ein perma).\nSollte dem Nutzer nicht klar gewesen sein, dass es unerlaubt ist, dann eher ein 2-Wochen-ban (wobei natürlich nicht die Aussage der Betroffenen gilt, sondern ob man als \"Normalbürger\" hätte erkennen sollen, dass es nicht erlaubt ist).\n\nIst natürlich weiterhin die Sache von Riot Games, das Strafmass bei solchen Vergehen zu bestimmen.\nMir persönlich ist es wichtiger, dass diese Vorteile nicht mehr genutzt werden dürfen. \nBei einem Game war es doch auffällig, dass die Gegner 2 Champs bannten, die sonst nie gebannt wurden, und dies gerade jeweils die Mains des ADCs und des Midlaners (mir) waren, die auch gerade eine gute winrate hatten.\n(Das Game haben wir dann trotzdem gewonnen^^).","replies":[{"poster":"Sirrkas","date":"2020-01-06T15:59:38.945+0000","up_votes":2,"down_votes":0,"body":">Damals war es aber wie gesagt wegen einer neuen Funktion und die Software wurde vorher noch von Riot Games toleriert; wahrscheinlich, weil nicht alle Spieler die Vorteile nutzten (z.B. kein Update machten und die unerlaubte neue Funktion gar nicht nutzten, etc.).\n\nIch glaube es gab da mal ein Programm, da hat jeder einen Tagesbann oder so erhalten, mit der Nachricht das bestimmte Programm zu entfernen, da es jetzt verboten ist.","replies":[]}]}]}]}]}]},{"poster":"ImBaLanZe","date":"2020-01-04T14:14:05.233+0000","up_votes":3,"down_votes":0,"body":"Du musst, wenn du die Blitz App benutzt hast, es im Client registrieren lassen. Es gibt extra eine Option dafür third Party lisence oder so ähnlich hieß es. Wenn du das nicht gemacht hast, ist es ein Ban da du halt ein Program benutzt hast ohne es registrieren zu lassen. Inwiefern das Riot jetzt nachvollziehen kann, weiß ich nicht schreib einfach ein Ticket! Ich drücke dir die Daumen.\n\nPs.: ich würde aber generell von solchen Programmen einfach die Finger von lassen. Spiel einfach das was du am besten kannst informier dich einwenig über Itembuilds etc und jut is","replies":[]},{"poster":"Zavolta","date":"2020-01-04T12:13:26.280+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Borstin,realm=EUW,application-id=KYnfKGf0,discussion-id=R6qTfmpW,comment-id=,timestamp=2020-01-04T10:09:11.013+0000)\n>\n> Mein Account wurde Permanent gebannd, für das benutzten von 3dPartyProgramms! Aber ich benutzte keine bis auf die Blitzapp und diese wird ja von Streamern benutzt, diese werden dafür ja nicht gebannd. Mein Account ist über 10 Jahre alt und es steckt eine Menge Geld in diesem. Nimmt Riot, Bans überhaupt zurück? Ist die Blitzapp illegal ?\n\nHab grad mal im Netz gelesen, was die App so macht...\n\n... soso, Blitzapp erkennt also automatisch deinen Gegner und zeigt dir,wie du  ihn kontern kannst? Und solches cheaten soll legal sein?","replies":[{"poster":"Megamaexx","date":"2020-01-04T15:00:19.211+0000","up_votes":2,"down_votes":2,"body":"Ist legal, weil Riot dafür extra ne Schnittstelle bereitstellt. Z.B. op.gg zeigt dir auch haufenweise Zeug an, wenn du da deinen Namen eingibst. Mehr macht so eine Overlay-App auch nicht.","replies":[{"poster":"Sirrkas","date":"2020-01-04T20:30:55.390+0000","up_votes":2,"down_votes":0,"body":"Soweit ich mich erinnere, hieß es zu solchen Sachen mal, dass die verboten sind, wenn die das automatisch machen und es ok ist, wenn man manuell nach den Gegnern auf op.gg und Co. sucht.","replies":[{"poster":"Randori89","date":"2020-01-06T14:14:48.613+0000","up_votes":1,"down_votes":0,"body":"Davon mal ganz abgesehen, hilfst es nur bedingt, da man nach den Gegnern erst suchen kann, wenn das Spiel bereits gestartet ist! Vorher spuckt die Riot-API nichts aus! Es macht sogar mehr sinn, nach den eigenen Mates zu suchen, dann kann man evtl. Trolls und Intern aus dem weg gehen!","replies":[]}]}]}]},{"poster":"Shiroi Kumą","date":"2020-01-04T13:45:19.352+0000","up_votes":1,"down_votes":1,"body":"Ayy LMAO diese kommentare sind interesting. \n\nBlitzapp gibts schon ewig und sehr viele nutzen diese ohne gebannt zu werden. Sie gibt dir auch keine Cheats oder scripts etc. Die tut das was jeder andere auch machen kann und zwar die Namen von den gegner nachschauen lmao.\n\nWegen der Blitz app wurdest du zu 100% nichts gebannt. Schreib den support an aber ich denke du hast bestimmt ein anderes Programm benutzt das deinen Bann gerechtfertigt. Ich hab noch nie von jemanden gehört der wegen der Blitz app gebannt wurde und ich kenne viele incl Streamer die diese nutzen.","replies":[]}]}