{"poster":"TF Autophil","date":"2018-05-06T12:19:10.902+0000","title":"[High-Dia Coaching] SoloQ, DuoQ & Teamcoaching","subforum":"Level Up: Guides & Tipps","embed":{"description":"AeQ Autophil / Diamond 2 29LP / 136W 117L Win Ratio 54% / Zac - 60W 31L Win Ratio 66%, Lee Sin - 36W 19L Win Ratio 65%, Sejuani - 11W 11L Win Ratio 50%, Skarner - 11W 11L Win Ratio 50%, Ivern - 7W 11L Win Ratio 39%","url":"http://euw.op.gg/summoner/userName=AeQ%20Autophil","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":1,"down_votes":2,"body":"Sei gegr&uuml;&szlig;t Beschw&ouml;rer,\n\nimmer wieder sehe ich Forenbeitr&auml;ge, die nach Hilfe zur Thematik &quot;Ranked&quot; suchen. Hier m&ouml;chte ich Abhilfe schaffen und diese Hilfe bieten. in den folgenden Zeilen werde ich dir einen kurzen &Uuml;berblick zu meiner Person geben und danach was ich dir biete und auch von dir fordere. \n\n*****\n\n**Zu meiner Person:**\n\n*  Mein Name ist Phil und in der Kluft kennt man mich unter dem Spielernamen **Autophil**. Ich bin Jungle Main seit Season 4 und sehe das Spiel League of Legends nicht als Casual- sondern Competetive-Spiel an. Daher spiele ich zurzeit auch in der 1. Uni Liga unter der Organisation AeQ. Diese Sichtweise auf das Spiel habe ich seit circa einem Jahr, daher sieht meine Elo &uuml;ber die Season wie folgt aus:\n\n *  S3: Silber\n *  S4: Gold\n *  S5: Gold\n *  S6: Diamant\n *  S7: Diamant 3 (Peak)\n *  S8: Z.z. Diamant 2 \n\n**Was ich dir biete:**\n\nIch biete Coaching f&uuml;r jedermann an, hierbei ist es erstmal egal welche Elo du bist. Hierbei ist die die Debatte der Korrelation zwischen der eigenen Elo und der des Lernenden nicht wegzudenken, aber das ist ein anderes Thema! Au&szlig;erdem biete ich dieses Coaching auch f&uuml;r jede Lane an, hierbei w&uuml;rde ich aber die Elo auf h&ouml;chstens D5-D4 setzen um meinen Qualit&auml;tsstandard halten zu k&ouml;nnen. Da ich Student bin und das f&uuml;r mich sehr Zeit intensiv ist, erwarte ich einen entsprechenden Gegenwert. \nHier zu den detaillierteren Aspekten meines Coachings:\n\n* Selbsterstellte PDF Dateien zu verschiedensten Themen in Bezug auf SoloQ; &quot;Wie gehe ich mit Tilt um?&quot;, &quot;Wie erkenne ich meine Erfolge?&quot; etc. \n\n* Live-Coaching oder VOD Review und detaillierte Nachbesprechung dieser Games\n\n* Einen Platz in meiner Freundesliste um direkte Hilfe bei kleinen Probleme zu kriegen\n\n* Die M&ouml;glichkeit von zus&auml;tzlichem OnStream-Coaching auf [Twitch](https://www.twitch.tv/autophii)\n\n* Komprimierte Informationen zu Champ &quot;xy&quot; auf Youtube\n\n* Hilfreiche (Subjektive Meinung) Links und Literatur f&uuml;r Weiterbildung in Bezug auf League of Legends\n\n* [In Arbeit] Zugriff auf [Youtube](https://www.youtube.com/user/TheChaosCaptainLP/featured?view_as=subscriber) Videos von Coaching verschiedenster Elo &amp; Rolle\n\n* [Im Aufbau] Einladung in exklusiven Discord und Netzwerk um in Diskussionen und Fragen hilfreiche Antworten erwarten zu k&ouml;nnen\n\nWas ich besonders gut finde ist, dass keiner auslernt, so nat&uuml;rlich auch ich nicht und wir als Team haben Kontakt zu verschiedensten Coaches. Unter anderem ist auch [Dekarldent](https://www.twitch.tv/dekarldent) dabei. Wer ihn nicht kennt, er war LCS Coach und stieg mit &quot;seinem&quot; Team Copenhagen Wolves auf. Daher erhalte ich stets neuen Input von anderen Coaches und kann diese Informationen nutzen um auch meine Coachings auf eine neue Qualit&auml;t zu heben. Daher bin ich auch immer offen f&uuml;r neues Feedback von dir, wenn du konstruktive Kritik aus&uuml;bst oder andere Verbesserungsvorschl&auml;ge f&uuml;r mich hast.\n\n**Was ich von dir fordere:**\n\nGenerell gehe ich das Coaching eher professionell an, da auch mein Ziel ist, dass du dich verbesserst. Wenn du n&auml;mlich schon mehr Zeit in dieses Spiel investierst sollst du daf&uuml;r auch belohnt werden (mit LP :p). Ich fordere von dir auch nicht viel, sondern nur, dass du die Hilfe die ich dir biete dann auch annimmst. Daher sollst du kritikf&auml;hig sein und somit auch bereit seit um Neues zu lernen. \n\n**Anmerkungen:** \n\nIch arbeite beim Coaching nicht in Stunden, sondern in &quot;Sessions&quot;. Dieses Format habe ich entwickelt um dem Lernenden eine faire Arbeit liefern zu k&ouml;nnen ohne ihn dabei &uuml;bern Tisch zu ziehen. Eine Session dauert so lange, wie der Teilnehmer noch offene Fragen oder Verst&auml;ndnisprobleme hat. Wie  schon in der Schule gibt es Menschen die die Thematik schneller verstehen und andere die daf&uuml;r mehr Zeit ben&ouml;tigen. Sessions wirken diesem Problem entgegen.\n\nAu&szlig;erdem biete ich verschiedene Wege f&uuml;r verschiedene Lerngruppen an. D.h. es gibt Menschen die mit Sinnen unterschiedliche Lernfortschritte aufweisen. Manche Menschen lernen durch visuelle Darstellung besser als durch schriftliche Darstellung. Hierzu werden die Youtube-Videos dienen, die genau diese Problematik auffassen und in Kombination mit den PDF Datein, sollte f&uuml;r jede Lerngruppe das passende Material vorhanden sein.\n\n**Kontakt:**\n\nGenerell bin ich auf den meisten Plattformen vertreten, aber ich bevorzuge es, wenn du mich auf League unter dem Namen &quot;**AeQ Autophil**&quot; addest. Dazu w&auml;re es sinnvoll wenn du dich im n&auml;chsten Zug einmal kurz vorstellst, damit auch ich einen ersten Eindruck erhalte.\nFalls du noch offene Frage hast, kannst du sie gerne hier oder in League stellen.\n\n**_\"questions are the answer\"_** **~ Jim Kwik**\n\nIch freue mich auf die Zusammenarbeit mit dir!\nBeste Gr&uuml;&szlig;e","replies":[{"poster":"xXRAWRXx","date":"2018-05-06T17:19:12.456+0000","up_votes":1,"down_votes":0,"body":"habs nur überflogen und die wichtigen punkte gelesen alsooooo wo ist der preis den ich denke nicht das du das kostelos machst ^^{{champion:7}}","replies":[{"poster":"voidˉ","date":"2018-05-08T12:35:04.419+0000","up_votes":1,"down_votes":0,"body":"> Was ich von dir fordere:\nGenerell gehe ich das Coaching eher professionell an, da auch mein Ziel ist, dass du dich verbesserst. Wenn du nämlich schon mehr Zeit in dieses Spiel investierst sollst du dafür auch belohnt werden (mit LP :p). Ich fordere von dir auch nicht viel, sondern nur, dass du die Hilfe die ich dir biete dann auch annimmst. Daher sollst du kritikfähig sein und somit auch bereit seit um Neues zu lernen.\n\nalso ich verstehe darunter, dass es kostenfrei ist. \n> \"Ich fordere von dir [auch] nicht viel, sondern  **nur**, dass du die Hilfe die ich dir biete dann auch annimmst.\"","replies":[{"poster":"TF Autophil","date":"2018-05-08T17:41:06.435+0000","up_votes":1,"down_votes":1,"body":"https://i.imgur.com/zz4tWmd.png","replies":[]}]},{"poster":"TF Autophil","date":"2018-05-06T20:34:18.213+0000","up_votes":1,"down_votes":0,"body":"Das klären wir dann im Client :p","replies":[]}]}]}