{"poster":"Angelus0x","date":"2016-02-11T09:14:13.373+0000","title":"Retrocedere di divisione o lega","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Mi ricordo nella scorsa stagione che se avevi 0 LP e perdevi una partita se per esempio eri silver 4 venivi retrocesso a silver 5. Ma in questa stagione non succede, come mai?","replies":[{"poster":"Angelus0x","date":"2016-02-11T09:38:49.149+0000","up_votes":1,"down_votes":0,"body":"immagino non c'è modo di sapere che mmr ho per sapere da quale divisione/lega comincio a retrocedere","replies":[{"poster":"Ste the ripper","date":"2016-02-11T14:07:38.774+0000","up_votes":1,"down_votes":0,"body":"No, non c'è modo, l'unica cosa che puoi fare è guardare su lolking gli avversari contro cui hai perso.\nSe tu sei silver 4 e giochi sempre con tutti silver 3/2 allora è probabile tu abbia mmr silver 3/2, se giochi con silver 4/5 è probabile tu abbia mmr da silver 4/5, però non è nulla di ufficiale, inoltre questo \"trucchetto\" al momento è sfasato dalle placement, perché tutti stanno venendo posizionati a caso.\n\nL'altra cosa che puoi fare è vedere quanti lp prendi, se ne prendi più di quanti ne perdi significa che hai un po' di partite prima di scendere se sei a 0lp, se ne perdi più di quanti ne prendi sai che appena arrivi a 0lp rischi.\nPuoi anche usare siti come op.gg ma al momento sono sfasati anche loro e comunque anche quelli non sono ufficiali.\n\nComunque dopo un po' che fai ranked inizi a capire intuitivamente come funziona il sistema, e inizi a capire se stai per essere declassato o meno, certo non capirai mai la partita esatta, ma più o meno ti fai un'idea della tua situazione e di come ti considera il sistema.","replies":[]}]},{"poster":"Firenheit","date":"2016-02-11T13:58:04.629+0000","up_votes":1,"down_votes":0,"body":"Non succedeva così neanche la scorsa Season :)","replies":[]},{"poster":"Khuzare","date":"2016-02-11T09:19:54.126+0000","up_votes":1,"down_votes":2,"body":"teoricamente hai 3 partite di protezione.","replies":[{"poster":"GreenArroww","date":"2016-02-11T12:20:57.370+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jonney Nashor,realm=EUW,application-id=MJVj50Jw,discussion-id=hwPjoAw9,comment-id=0000,timestamp=2016-02-11T09:19:54.126+0000)\n>\n> teoricamente hai 3 partite di protezione.\n\n\nNo, anche io pensavo fosse così in passato ma non lo è, come ha detto il tipo dipende dall'mmr, puoi arrivare anche a 0LP e aver perso 2 volte di fila e alla terza scendere subito o alla 5 non scendere, dipende, ma non è una regola la cosa delle 3 protezioni","replies":[]}]},{"poster":"John Clayton","date":"2016-02-11T12:07:29.588+0000","up_votes":1,"down_votes":0,"body":"dipende dall'mmr se sei basso li allora retrocedi velocemente","replies":[]},{"poster":"Ste the ripper","date":"2016-02-11T09:31:07.257+0000","up_votes":1,"down_votes":0,"body":"Non è mai stato così, dipende dall'mmr, evidentemente quest'anno lo hai più alto.","replies":[{"poster":"Angelus0x","date":"2016-02-11T09:34:04.530+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=MJVj50Jw,discussion-id=hwPjoAw9,comment-id=0002,timestamp=2016-02-11T09:31:07.257+0000)\n>\n> Non è mai stato così, dipende dall'mmr, evidentemente quest'anno lo hai più alto.\n\nNel senso che superato una soglia di mmr non scende di lega o divisione?","replies":[{"poster":"Ste the ripper","date":"2016-02-11T09:37:42.909+0000","up_votes":1,"down_votes":0,"body":"Se hai l'mmr da silver 2 e sei silver 4 0 lp anche se perdi non puoi scendere ( occhio che perdendo scende l'mmr), l'anno scorso probabilmente avevi l'mmr tra il silver4 basso e il silver5 alto, quindi appena perdevi ti retrocedeva","replies":[]}]}]},{"poster":"Angelus0x","date":"2016-02-11T09:30:33.552+0000","up_votes":1,"down_votes":0,"body":"ahhh accidenti allora forse le ho gia usate tutte e tre T.T","replies":[]}]}