{"poster":"Bìnary","date":"2017-10-18T16:53:19.147+0000","title":"Cercasi \"disegnatore\"","subforum":"Creazioni della community","up_votes":3,"down_votes":3,"body":"Salve evocatori!\r\n\r\nIo ed un mio amico, entrambi studenti/programmatori, volevamo sviluppare un giochino free to play a tema LoL per mobile.\r\nCi servirebbe un&#039;anima pia che sappia farci qualche disegno easy su Ps o quel che pi&ugrave; lo garba.\r\n\r\nIl tutto &egrave; inteso come a tempo perso (come tutti i nostri lavori passati), quindi nessun tipo di retribuzione (possiamo garantire qualche {{item:2009}} per i pi&ugrave; golosi) ... ma saremo felici di trovare qualcuno che possa spendere un paio d&#039;ore in cambio della nostra gratitudine :D ed eventuali link/crediti ai suoi lavori.\r\n\r\nSe qualcuno fosse interessato sar&agrave; contattato subitissimo :)\r\n\r\nUps dimenticavo, linko le FAQ ufficiali per garantire la fattibilit&agrave; della cosa: https://www.riotgames.com/legal-jibber-jabber","replies":[{"poster":"Bylloo","date":"2017-10-18T18:27:22.180+0000","up_votes":2,"down_votes":1,"body":"Avete presente mobile legends? per me il risultato sarà più o meno quello","replies":[{"poster":"Bìnary","date":"2017-10-18T20:48:24.649+0000","up_votes":2,"down_votes":1,"body":"Sapendo che la gente parla a caso avevo già linkato questo https://www.riotgames.com/legal-jibber-jabber ma quanta fatica leggere oh.\nIn tutta la mia grazia e pazienza ti copio incollo la parte saliente che riassume il tutto:\n\n\"We’ll start with our golden rule – you can use League of Legends IP as the basis for a fan project that you’re giving away for free or that’s only generating ad revenue (we’ll refer to this type of free fan project as a “Project”), as long as you comply with the guidelines outlined below for using our IP (the “Guidelines”). As a matter of fact, as long as you comply with our Guidelines, we think it’s great if you create awesome, free and original content for League of Legends fans.\"\n\nSe non riesci a capire neanche questo pace e amore :)","replies":[]}]},{"poster":"Náos","date":"2017-10-18T17:19:42.877+0000","up_votes":1,"down_votes":0,"body":"che stile di disegno cercate?","replies":[{"poster":"Bìnary","date":"2017-10-18T20:56:22.606+0000","up_votes":1,"down_votes":1,"body":"In realtà di grafica/temi/colori ne capiamo proprio zero per cui ci sarebbe libertà assoluta sullo stile :) si trovano un paio di game con {{champion:53}} su Android per cui pensavamo di indirizzarci su quello stile un po' \"cartone\" ma in generale ci affidiamo ai gusti di chi disegna che sicuramente ne sa più di noi :)","replies":[{"poster":"Snable Brace","date":"2017-10-24T14:44:00.200+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Bìnary,realm=EUW,application-id=P9Wi6QlB,discussion-id=aMooEPuW,comment-id=00000000,timestamp=2017-10-18T20:56:22.606+0000)\n>\n> ci sarebbe libertà assoluta sullo stile :) \n\n\n\nNon me ne intendo assolutamente, ma se provassi a fare stile Cuphead? Forse è una cavolata quella che dico, ma secondo me sarebbe fighissimo.","replies":[]},{"poster":"Náos","date":"2017-10-19T09:42:32.281+0000","up_votes":1,"down_votes":2,"body":"non capisco perchè vi stiano mettendo il meno 1, comunque se ti va aggiungimi sul client così mi puoi spiegare un pochino meglio :)","replies":[{"poster":"Bìnary","date":"2017-10-19T10:16:51.399+0000","up_votes":1,"down_votes":1,"body":"Penso che la motivazione sia la stessa per cui il simpaticone ha commentato random prima di te, la gente non sa leggere :) quando torno dall'uni ti aggiungo così ti spiego tutto!","replies":[]}]}]}]}]}