{"poster":"U N Owen","date":"2018-02-21T02:46:21.099+0000","title":"El nuevo sistema de sanciones no esta bien.","subforum":"Charlas Generales","up_votes":1,"down_votes":6,"body":"Estoy desilusionado con el nuevo sistema que acaba de implementar Riot para las sanciones de jugadores, ahora pr&aacute;cticamente te banean por cualquier cosa, si chateas mucho te pueden banear, si los chats son muy largos te pueden banear, si dices bla bla bla 3 veces seguida y  muy rapido tambi&eacute;n es motivo de ban, porque todos estos son patrones que segun riot reconoce como que el jugador esta flameando y si, tienen razon, estos patrones son comunes cuando un jugador esta flameando y usando indiscriminadamente el chat, escribiendo r&aacute;pido y reiteradas veces, pero y si estas con amigos?, haciendo duos conversando, porque no todos tienen discord o microfono,  muchos usan el chat para pasar el rato y divertirse.\r\n\r\nY si no estas con amigos y no conoces a nadie como en cualquier ranked el nuevo sistema tampoco dar&aacute; espacio para personas que usan el chat reiteradamente para comunicarse con el team, buscar ideas o jugadas para derrotar al otro equipo, proponer ideas, alentar a tu compa&ntilde;ero que va mal  y quiere irse, si hago esto de escribir reiteradamente en la partida probablemente me vaya baneado, y lo &uacute;nico que busque fue ayudar a mi team para ganar la partida.\r\n\r\nEntonces encuentro que esta medida es demasiado ambigua y no discrimina correctamente si el jugador en verdad usa el chat para flamear o para comunicarse, o simplemente para conversar, han convertido las ranked en un salon de poker donde todos tienen que estar calladitos y con cara de poker face jugando concentrado, enserio cada ves le quitan mas diversion a este juego, en mi opini&oacute;n el nuevo sistema no discrimina a jugadores t&oacute;xicos o flamers, todos podemos ser motivos de ban si usamos mucho el chat.","replies":[{"poster":"Kan3","date":"2018-02-21T02:54:20.840+0000","up_votes":4,"down_votes":1,"body":"- No creo que te den ban por usar el chat hablando de algunta tactica del juego. \n\n- Si queres usar un chat para pasar el rato con amigos anda a facebook y listo.\n\n- Tenes que tener insultos, palabras o frases discriminatorias/insultantes para que te den ban. Algunos hacen insultos como si no pasara nada, pero resulta que uno te clava report por esos comentarios insultantes y ahi te sancionan. Lo cual me parece correcto, deben aprender a hablar con un poco mas de respeto con ciertas palabras...","replies":[{"poster":"U N Owen","date":"2018-02-21T03:01:31.564+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Kan3,realm=LAS,application-id=v7qsfXsE,discussion-id=ZlbthgQ4,comment-id=0000,timestamp=2018-02-21T02:54:20.840+0000)\n>\n> - No creo que te den ban por usar el chat hablando de algunta tactica del juego. \n> \n> - Si queres usar un chat para pasar el rato con amigos anda a facebook y listo.\n> \n> - Tenes que tener insultos, palabras o frases discriminatorias/insultantes para que te den ban. Algunos hacen insultos como si no pasara nada, pero resulta que uno te clava report por esos comentarios insultantes y ahi te sancionan. Lo cual me parece correcto, deben aprender a hablar con un poco mas de respeto con ciertas palabras...\n\nEl chat esta mas sensible ahora, tienes que ser muy efectivo para comunicarte bien con tu team porque si escribes mucho puedes ser baneado, en el grupo de facebook ya se estan viendo casos donde las personas nunca insultaron solo chateban con su team y se le fue bloqueado el chat, casos asi seguiran apareciendo ya que Riot esta siendo mas severo con las sanciones, pero el problema es que no ve caso a caso sino que el sistema toma patrones de un posible jugador \"flamer\" y lo mas chistoso que ese posible se le bloque el chat.","replies":[{"poster":"RNG Jayumin","date":"2018-02-21T03:02:34.186+0000","up_votes":2,"down_votes":1,"body":"Se, es cierto.","replies":[]}]},{"poster":"RNG Jayumin","date":"2018-02-21T02:59:33.010+0000","up_votes":2,"down_votes":4,"body":"No es cierto amigo, a un amigo youtuber mio le permabanearon la cuenta por dar consejos, lo que el dice es cierto, el no usar face, no todos tienen un pc que soporte el lol y el google, tambien hay casos de gente reportada por que si y 0 flameo, un tipo que escribio \"jaja\" y lo banearon, No digo mas.","replies":[]}]},{"poster":"Hnk Kenshiro","date":"2018-02-21T02:59:23.556+0000","up_votes":2,"down_votes":0,"body":"Estas tan equivocado en todo, que me pregunto de donde sacas eso :p","replies":[{"poster":"RNG Jayumin","date":"2018-02-21T03:01:33.104+0000","up_votes":2,"down_votes":3,"body":"De casos reales de  gente que le a pasado, un amigo, irrito a los aliados por dar consejos y que lo siguieran, reportado y permabaneado, osea rlly?","replies":[{"poster":"Hnk Kenshiro","date":"2018-02-21T03:07:09.865+0000","up_votes":2,"down_votes":0,"body":"Pídele los chat log.","replies":[{"poster":"RNG Jayumin","date":"2018-02-21T03:18:04.954+0000","up_votes":1,"down_votes":2,"body":"No puedo, fue hace mucho, lo subio a su instagram hace aprox 1 mes, se creo otra cuenta asi que no lo teng, sorry","replies":[]}]}]}]},{"poster":"XxBebesitohxX","date":"2018-02-21T03:22:37.493+0000","up_votes":1,"down_votes":2,"body":"es falzo a mi me penalizaron por decir que un zed estaba troll y pedi reporte varias veces y por eso me restringen partidas y me quitan el honor por reclamarles a los trolls super malo el sistema","replies":[]}]}