{"poster":"littledragonfire","date":"2016-10-15T21:03:58.231+0000","title":"PBE","subforum":"Client Diskussion","up_votes":1,"down_votes":0,"body":"Ich bin heute auf LoL online gekommen und da stand drauf das ich au&szlig;erw&auml;hlt wurde einer zu sein. Jetzt habe ich alles gedownloaded aber vergessen mich zu registrierenhalt extra f&uuml;r PBE und komme nicht mehr hin. Habe zwar alles gedownloaded und habe nur kein account. Gehe ich auf mich bewerben, steht da ich muss warten bis ich angenommen werde.","replies":[{"poster":"Necolp","date":"2016-10-15T21:11:00.089+0000","up_votes":1,"down_votes":0,"body":"Du hast dich warscheinlich nur beim alpha_client angemeldet.Wäre cool hätte man auch ein pbe acc mitbekommen\n{{summoner:31}}","replies":[{"poster":"littledragonfire","date":"2016-10-15T21:19:38.476+0000","up_votes":1,"down_votes":0,"body":"{{champion:32}} ok. und was ist das genau? oder wann weiß man wann man für pbe akzeptiert wird?","replies":[{"poster":"I am Zynex","date":"2016-10-15T21:30:06.050+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=littledragonfire,realm=EUW,application-id=s8lTaxuH,discussion-id=TEzby0nJ,comment-id=00000000,timestamp=2016-10-15T21:19:38.476+0000)\n>\n> {{champion:32}} ok. und was ist das genau? oder wann weiß man wann man für pbe akzeptiert wird?\n\nDu bekommst eine E-Mail wenn du akzeptiert wurdest.","replies":[{"poster":"Rayphone","date":"2016-10-15T21:43:57.167+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Lachgas7778","date":"2016-10-16T17:12:59.996+0000","up_votes":1,"down_votes":0,"body":"Aber es kann dazu kommen das du reingelegt wirst. (RISKANT)","replies":[]}]}]}]},{"poster":"Lachgas7778","date":"2016-10-16T17:11:45.151+0000","up_votes":1,"down_votes":0,"body":"Leute ihr habt euch für den alpha_client beworben nicht für den PBE_Test_Server.","replies":[]}]},{"poster":"DrCrane74","date":"2016-10-16T04:35:23.628+0000","up_votes":1,"down_votes":0,"body":"Mich ärgert diese Hilflosigkeit von riot. Diese accs sind für echte fans eigentlich wertvoll und werden dort verramscht. Ich wäre dafür, wenn riot a) lvl 30 unranked accs mit x ip für 20 € anbietet und zwar legal, am besten noch 5 € davon spenden und ebenso b) für 10 € einen temporären PBE-Account zur Verfügung stellt, der bei gutem Feedback und fleißigem Testen verlängert wird.","replies":[{"poster":"TerrorRaven","date":"2016-10-16T08:22:08.374+0000","up_votes":1,"down_votes":0,"body":"Naja, eine zweifelhafte Idee.\n\nViele regen sich über die Leute auf, die mit Level 30 sofort mit Ranked anfangen und dabei gewaltig ins Gesicht bekommen. Das Aufleveln hat den Zweck,dass man nach und nach die Spielmechanik kennen lernt.\n\nSpeziell beim PBE gibt es folgendes Problem: Er steht in den USA an der Ostküste, wodurch man hier in Europa einen Ping von 180+ hat, was zu spielen nicht gerade angenehm ist.\nRiot lädt nur speziell Leute ein, wenn die was spezielles testen wollen. Sprich beim kommenden Assassine-Update werden vorzugsweise Leute eingeladen, die viel Assassine spielen. Es hat schon seinen Sinn, dass nicht jeder eine Einladung bekommt.","replies":[]}]}]}