{"poster":"XxX Nomad","date":"2016-01-11T21:48:11.898+0000","title":"Zac glitch","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":9,"body":"Moin zusammen,\r\n\r\nhabe zu sp&auml;t gesehen das der gegnerische Zac den Running glitch benutzt, gibt es noch eine m&ouml;glichkeit das im nachhinein zu melden ?\r\n\r\nMfg","replies":[{"poster":"diarrheasrec","date":"2016-01-11T22:05:27.932+0000","up_votes":4,"down_votes":0,"body":"den benutzt man nicht der passiert einfach..","replies":[{"poster":"XxX Nomad","date":"2016-01-11T23:11:27.642+0000","up_votes":2,"down_votes":1,"body":"wie nun? der gegner ist eigendlich nur damit auf mich zu gekommen, kannst du das genauer erläutern ?","replies":[{"poster":"Alustus","date":"2016-01-11T23:32:34.185+0000","up_votes":5,"down_votes":0,"body":"Das ist sein Sprung welcher nur faksch angezeigt wird.\n\nAlso nur ein visueller bug kein glitch oder ähnliches","replies":[{"poster":"XxX Nomad","date":"2016-01-12T09:24:32.174+0000","up_votes":2,"down_votes":1,"body":"Ah okey danke, dann ist ja gut das ich den Report vergessen habe ^^\n\nWarum bekommt man hier eigentlich down votes für eine ganz normale frage -.-","replies":[{"poster":"Alustus","date":"2016-01-12T09:54:05.488+0000","up_votes":4,"down_votes":1,"body":"Ich denke das ein paar Leute downgevotet haben weil du den Zac schon mehr oder weniger schuldig gesprochen hattest.\n\nwissen tu ich es aber nicht, da ich selber eig. nur bei beleidigungen/spam usw. downvotes gebe und die Downvoter nicht kenne oder ihrer gegdanken lesen kann.","replies":[{"poster":"XxX Nomad","date":"2016-01-12T11:22:48.999+0000","up_votes":1,"down_votes":3,"body":"Natürlich hatte ich den schon schuldig gesprochen ^^\n\nHabe selbst in der selben runde auch zac gehabt und nach 20 min Kopfzerbrechen blieb faktisch halt nix anderes mehr übrig, dann habe ich mir Videos angesehen die den glich auch nur zeigten ohne Erklärung... \n\nDa gab es ohne es besser zu Wissen halt nurnoch eine Möglichkeit \n\nAußerdem muss man dazu sagen das ich ihn ingame fragte wie er das macht weil ich erst dachte es gäbe irgendwas das ich überlesen habe und da kam als Antwort nur \"only i can Run like Ali \"\n\nNun mal die Hände hoch wer da nicht an absichtliches Bug / Glitch using denken würde ^^","replies":[{"poster":"eingew","date":"2016-01-12T11:53:12.175+0000","up_votes":2,"down_votes":1,"body":"Jeder, der es besser weiß.","replies":[{"poster":"XxX Nomad","date":"2016-01-12T12:58:01.016+0000","up_votes":1,"down_votes":2,"body":"Sag ich ja ^^","replies":[{"poster":"FrankerX","date":"2016-01-14T02:21:58.224+0000","up_votes":3,"down_votes":4,"body":"weils euw ist. du darfst im forum für champs nichtmal fragen wie man einen champ am besten spielt den du dir gerade neu zugelegt hast.\nwenn du dann aber sagst \"gut benutz ich halt mobafire\" sind auch wieder alle mad das du nur dem guide folgst und nicht selber nachdenkst.\nund manche sind auch mad wenn du dich über den champ erkundigst bevor du ihn überhaupt spielst. und andere sind mad wenn du den champ spielst ohne dich erkundigt zu haben.\nso oder so kriegst du meist downvotes.","replies":[{"poster":"Zulwar","date":"2016-01-14T06:49:50.664+0000","up_votes":2,"down_votes":0,"body":"Hat der Downvote denn was zu sagen? Ist doch nur eine Zahl, wofür die auch immer steht.","replies":[{"poster":"FrankerX","date":"2016-01-14T08:09:15.631+0000","up_votes":1,"down_votes":1,"body":"ne sagt ja sogesehn nur aus das leute nicht mit dem übereinstimmen was du sagst. oder das sie genervt sind und du dich verpissen und googlen sollst.\nso oder so ist es natürlich egal.\nwenn du jetzt nicht n post mit iwie 50 upvotes hast sagt es nichts aus","replies":[{"poster":"Zulwar","date":"2016-01-14T08:20:30.799+0000","up_votes":3,"down_votes":0,"body":"Was sagt denn ein Post mit 50 Up/downvotes aus?","replies":[{"poster":"FrankerX","date":"2016-01-14T08:32:08.379+0000","up_votes":1,"down_votes":1,"body":"bei 50 upvotes sagt es aus das du wahrscheinlich was recht kluges von dir gegeben hast. bei 50 downvotes (höchstes was ich jemals im euw forum sah war 44) solltest du einen IQ test machen und das ergebnis an deinen arzt weiterleiten und deine eltern verständigen weil du wahrscheinlich unter 70 punkte erzielst.","replies":[{"poster":"FrankerX","date":"2016-01-14T09:34:44.011+0000","up_votes":2,"down_votes":1,"body":"ja nur gehe ich vom euw deutsches forum standard aus. wenn 200 leute deinen beitrag gesehen haben bist schon fame. wenn da noch 50 upvotes zusammenbringst (oder eben 44 downvotes) sagt das schon viel aus. ","replies":[]},{"poster":"Zulwar","date":"2016-01-14T08:43:38.988+0000","up_votes":1,"down_votes":0,"body":"Ok wenn du meinst. Jedoch kann man über die Zahl nichts aussagen, da man nicht weiß wie viele Leute den Beitrag gelesen haben. Wenn ich 50 Up/downvotes habe von 50 Lesern, dann ist das ein klare Statement. Wenn ich aber 50 Up/downvotes habe von 1000000 Lesern, dann sagt das Garnichts aus. Besonders, da man eh nicht weiß, was die Leute mit dem Up/downvote aussagen wollen, wenn der Text keinen klaren Punkt vorgibt.","replies":[]}]}]}]}]},{"poster":"XxX Nomad","date":"2016-01-14T19:14:30.976+0000","up_votes":1,"down_votes":1,"body":"dazu muss man sagen, nach dem ganzen \"bist du doof\" Diskutiere hier kommt einfach einer an und schreibt wie man den Glitch mit voller absicht benutzt und es klappt auch noch, das Feier ich gerade ein wenig xD\n\nDa kann ich den Kelch der unwissenheit direkt mal weiter reichen ^^\n","replies":[]}]}]}]}]}]},{"poster":"Temudschinn","date":"2016-01-12T13:11:44.280+0000","up_votes":3,"down_votes":0,"body":"Vermutlich weil die Wahl des Unterforums etwas fragwürdig ist und v.a. weil du dir nicht die Mühe gemacht hast, dich vor Erstellen des Posts kurz zu informieren. Wenn du nämlich dinge wie \"zac running glitch\" googelst wird schnell klar dass es sich nicht um einen Exploit handelt.","replies":[{"poster":"XxX Nomad","date":"2016-01-12T13:47:20.118+0000","up_votes":2,"down_votes":3,"body":"Habe ich schon aber nix brauchbares gefunden auf die schnelle, ist jetzt auch egal sollte mich eigentlich nicht beschweren.\n\nWenn auf 7 Leuten die einfach nur downvoten 2 kommen die helfen ist der Schnitt immernoch besser als ingame ^^","replies":[]}]},{"poster":"Zulwar","date":"2016-01-12T11:29:19.526+0000","up_votes":1,"down_votes":1,"body":"Es kann auch daran liegen, das du es eigentlich in das falsche unter Forum geschrieben hast, da ein glich/Bug nichts mit Spielerverhalten zu tuen hat und es auch dementsprechend ein Forum für gibt.","replies":[{"poster":"XxX Nomad","date":"2016-01-12T11:35:30.936+0000","up_votes":2,"down_votes":1,"body":"Es ging darum ob man im Nachhinein Reporter kann, also bin ich schon im richtigen, das es um den Glitch geht bzw garkeiner war in dem sinne hat sich ja erst im Laufe des Gesprächs raus gestellt...","replies":[{"poster":"Zulwar","date":"2016-01-12T11:44:44.547+0000","up_votes":1,"down_votes":0,"body":"Das geht nur, wenn du ein Ticket an den Support schreibst, anders nicht. Anders kann man im nachhinein nicht Reporten.","replies":[]}]}]}]}]}]}]},{"poster":"Rainbow Dashie","date":"2016-01-11T23:12:46.443+0000","up_votes":2,"down_votes":0,"body":"visual bug. ist auch bei den Worlds? passiert.","replies":[]},{"poster":"Pumpgun Willy","date":"2016-01-14T12:35:26.350+0000","up_votes":1,"down_votes":0,"body":"ZacGlitch? Wenn ihr während des Sprunges STRG 1-4 drückt passiert dies automatisch, dachte das ist gewollt :D","replies":[]}]}