{"poster":"XxX Nomad","date":"2015-12-31T16:01:14.424+0000","title":"Jungel und Gank problem","subforum":"Level Up: Guides & Tipps","up_votes":2,"down_votes":1,"body":"Moin zusammen,\r\n\r\nich Jungel gerne ab und an mal habe aber in spielen in denen es nicht so l&auml;uft ein problem...\r\n\r\nEntweder alle 3 oder 2 Lanes brauchen andauernd Hilfe und ich hinke daher im Jungel bzw LvL und Gold hinterher da sich dort dennoch keine Kills generieren lassen durch ne gepushte lane oder aber ich zu langsam bin da schlechte Schuhe bzw ich einfach nur den Gank verkacke\r\n\r\nOder...\r\n\r\nEine Lane meint das ich nur einzig und alleine f&uuml;r sie da bin und sofort angesickt ist wenn ich nicht jede sekunde zu stelle bin, beachte ich sie so stark fallen andere, beachte ich sie weniger geht der flame los was das ganze Team demotiviert.\r\n\r\nJemand ne idee wie man sich da verhalten kann?","replies":[{"poster":"Perlendieb","date":"2016-01-04T09:18:27.419+0000","up_votes":2,"down_votes":0,"body":"ich kenne dein problem sehr gut und muss sagen ich habs bisher so gemacht wenn ich meine runde drehe und ich sehe die lane is gepusht dann denk ich netma an nen gank oder bevor ich in den oberen jungle gehe ping ich top/mid und hoffe der spieler merkt das ich ganken komme und lässt reinpushen wenn er das nicht macht dann hatt er halt pech gehabt. so einfach ist das dann geh ich meine runde weiter oder gank die andere lane \nhast ja immer 2 lanes zur auswahl wenn du die crab mitnimmst haste sogar bissl was vom gold sofern sie da ist und vision =) \ndas ist denke die beste möglichkeit wenn sich dann einer aufregt kannste immer noch sagen ich hab gepingt ich komme wenn ihr pusht selbst schuld =)","replies":[]},{"poster":"AyRe CoNteMpT","date":"2015-12-31T19:07:47.562+0000","up_votes":2,"down_votes":0,"body":"als jungler gibts grundsätzlich 3 regelN:\n\n1. zieh den chat ausm bildschirm\n\n2. gank nur lanes die dir gankbar vorkommen \n\n3. ganke nur wenn du es für richtig  hälst","replies":[{"poster":"Nimro","date":"2016-01-04T15:08:56.013+0000","up_votes":1,"down_votes":0,"body":"4. Nur Lanes mit Snowball Potential ganken, außer du bist Carryjungler und nimmst den Kill selbst!\n\n5. Auch gepushte Lanes können gegankt werden, wenn die Gegner low sind (TowerDive, Roam mit anderer Lane, z.B. Mitte)","replies":[]}]},{"poster":"BlueTimba","date":"2018-12-09T10:48:47.239+0000","up_votes":1,"down_votes":0,"body":"hi,\njetzt muss ich auch mal was dazu sagen.\nam schlimmsten find ich die spieler, die gleich am start die lane feeden und dann sagen jgl kein gank. sorry wenn einer nach 3 min schon 2 mal gestorben ist, lass ich mich doch nocht blöd anmachen ich würde als jgl nicht ganken. dazu gibts dann noch die allerbesten die ständig pushen und wollen das man ihnen hilfe, kann mir ein vernümpftiger mensch sagen wie das genau gehen soll??? ich bin ja nicht lebensmüde und gib den gegner durch so eine aktion noch mehr kills die er eh schon leicht ergattern konnte mit so einen super schlauen spieler der immer wieder versucht den gegner zu killen obwohl er keine chance hat, weil er ihm schon 2  oder 4 oder 4 kills gegeben hat. dann muss man sich als jgl blöd anmachen lassen. das lustig ist dann, wenn man als jgl stirbt, klar wenn ein gegner schon 4 kills hat von so einem troll auf der lane ist es einfach jeden zu killen im spiel. die leute verstehen es einfach nicht. klar wenn man erst 10 jahre alte ist ......\n\nwas sagt ihr dazu????","replies":[]},{"poster":"XxX Nomad","date":"2015-12-31T17:03:26.183+0000","up_votes":1,"down_votes":0,"body":"Klar ist es manchmal nicht schlecht sich auf eine Lain zu konzentrieren aber wie man es halt kennt sind es meistens die Lanes die Focus wollen bei denen einfach einer drauf ist der meint er müsste das ganze Spiel alleine Dominieren was ja eh nicht geht ohne Team im Rücken und dann richtig Ego Spielt wenn man seinen wünschen und vorstellungen nicht nach kommt...\n\nMit anderen Worten man kann es drehen und wenden wie man will am ende ist der Jungler der Depp :/","replies":[]},{"poster":"Flumbro","date":"2015-12-31T17:02:10.464+0000","up_votes":1,"down_votes":0,"body":"Der Jungler ist nicht dafür da, um irgendwelche Lanes von Kiddies zu gewinnen. Sollen die selbst safe spielen, dann passiert sowas nicht. Es ist nett, wenn der Jungler kommt, aber es ist keine Pflicht. Ein Jungler sollte vielleicht mal Objectives machen oder für Vision sorgen, aber du bist nicht an ihrem Versagen schuld. /muteall","replies":[]},{"poster":"Im a Papaya","date":"2015-12-31T16:12:37.638+0000","up_votes":1,"down_votes":0,"body":"Einfach muten. Ein Jungler ist kein Haustier. Sich auf eine Lane zu konzentrieren ist aber manchmal nicht schlecht, weil wenn sowas wie ein Yasuo behind wird kann er kaum noch was reißen. Es gibt aber auch Champions die man einfach nicht ganken sollte wie Heimerdinger, Darius, Riven (wenn du nicht gerade die seju Ult triffst) und Trundle. Wenn man gegen einen dieser Champs unbedacht all in geht kann man sogar 2 v 1 verlieren. Ich empfehle Tank Jungler weil sie deinem Team einfach mehr bringen als ein Assassine der einfach die kills nimmt und im late dann einfach nur ein Ziel one shottet und stirbt, Devourer Jungler sind ziemlich stark und Jax kann man mit ein paar dmg und ein paar Tank Items so unsterblich machen wies nur geht deshalb empfehle ich diese eigentlich schon zu spielen.","replies":[]}]}