{"poster":"Palofan","date":"2016-10-31T22:47:19.896+0000","title":"AFKLER IN RANKED","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":21,"body":"bekommt ihr es bei riot mal endlich gebacken afkler zu sperren f&uuml;r ranked 2 afkler in einem ranked game gehabt und die drei leute was spielen verlieren 23 punkte gehts eigenltich noch , wie inkompentent muss man sein, schaltet ranked offline ganz ehrlich wen ihr es nicht hinbekommt sowas armseliges wie riot hab ich selten gesehen !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","replies":[{"poster":"Sirrkas","date":"2016-11-01T00:30:48.369+0000","up_votes":7,"down_votes":0,"body":"Also erst einmal muss jemand afk gehen, ehe er dafür bestraft werden kann. Mit anderen Worten, selbst wenn man AFKler für ein paar Spiele ausschließt, würde sich daran nichts ändern. Die haben ja trotzdem vorher einen DC, ein Spiel verlassen oder waren afk.\n\nDes weiteren bist du gerade nicht in der Position dich über AFKler im Team zu beschweren. Du hast nämlich selbst dein vorletztes Spiel verlassen. ","replies":[]},{"poster":"clair de lune289","date":"2016-11-01T16:48:25.713+0000","up_votes":2,"down_votes":0,"body":"Bei dem Verhalten das du hier im Forum an den Tag legst bist du sehr wahrscheinlich der Grund für diese vielen AFK oder du übertreibst maßlos mit der Häufigkeit. \n\nps: selber leaven und sich über afks beschweren ist schon recht scheinheilig","replies":[]},{"poster":"xXGhost229Xx","date":"2016-11-01T07:35:43.970+0000","up_votes":2,"down_votes":0,"body":"Hauptsache selber leaven... (letztes Spiel)","replies":[]},{"poster":"Palofan","date":"2016-11-01T22:34:50.027+0000","up_votes":1,"down_votes":2,"body":"natürlich hab ich geleavt wieder ein afkler drin warum soll ich mir 20 min antun und dann surrendern kann ich mir sparen hab nicht den ganzen tag zeit wie andere menschen , ich spiele schon sehr lang lol früher gab es dafür strafen wie du kannst dich 48h nicht einloggen in dein acc das sollten sie mal wieder einführen","replies":[{"poster":"Nohgolgh","date":"2016-11-01T23:14:09.330+0000","up_votes":2,"down_votes":0,"body":"http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2912244313/31340039?tab=overview\n\nHier warst nur du AFK und hast vier anderen Leuten das Spiel versaut. \n\nDu kannst außerdem sowieso kein zweites Spiel anfangen, solange das Spiel noch läuft, das du verlassen hast. Warum also nicht das zuende Spielen. Die Chancen sind schlecht, sehr schlecht sogar, dass ihr das gewinnt. Aber das ist immer noch besser, als einen sicheren Verlust von LP hinzunehmen.","replies":[]},{"poster":"Sirrkas","date":"2016-11-01T22:59:25.113+0000","up_votes":2,"down_votes":0,"body":"Es gibt immernoch Strafen fürs Leaven. Wenn du so weiter machst, kriegst du auch bald einige. Da es dir scheinbar weh tut, wenn du \"Zeit verschwendest\" wird dir die Strafe des Leaverbusters nicht gefallen, sobald du sie erhältst.","replies":[]}]},{"poster":"Palofan","date":"2016-11-01T22:37:40.777+0000","up_votes":1,"down_votes":3,"body":"und warum werden dann die leute auch bestraft die spielen wen wir schon dabei sind, spielst 4vs5 oder 3vs 5 verlierst was ja so gut wie sicher ist und verlierst in der rangliste 20 punkte, 5 punkte würden da völlig reichen aber riot weiß ja noch nicht mal was solo anscheinend bedeutet sonst würde man nicht dafür bewertet werden was deine teammates machen","replies":[{"poster":"Sirrkas","date":"2016-11-01T23:01:27.691+0000","up_votes":2,"down_votes":0,"body":"Wenn man 5 LP verlieren würde, sobald man in Unterzahl spielt. Könnte man zum Beispiel einen Freund mitnehmen, der das Spiel verlässt und dir deine LP rettet oder man könnte jemanden so sehr Flamen, dass er das Spiel verlässt. \n\nZudem würde es für dich keinen Unterschied machen, wenn du 5 LP statt 20 verlierst. Da deine MMR nämlich trotzdem fällt, wirst du die 15 Punkte unterschied, über die nächsten Spiele verteilt, abarbeiten müssen. Dann gewinnst du das nächste mal eben nur 15 statt 20 und verlierst die beiden Spiele darauf 25 statt 20.","replies":[]},{"poster":"Nohgolgh","date":"2016-11-01T23:11:06.969+0000","up_votes":1,"down_votes":0,"body":"Nach der Logik dürften dann aber auch die Leute, die gegen ein Team mit AFKler gewonnen haben, keine LP bekommen, da das Match nicht fair war. Aber das würde bedeuten, dass die ihre Zeit unverschuldet verschwendet haben. Darüber hinaus wirst du, sofern du selbst nicht AFK gehst, von AFKlern statistisch gesehen profitieren. Du hast dann nämlich vier potentielle AFkler im eigenen Team und fünf potentielle AFkler im Gegnerteam. Leider hast du das aber nicht kapiert und gehst selbst teilweise AFK. Und jeder kennt es, wenn die Teammates total sucken, aber die meisten merken es nichtmal, wenn sie die schlechteste Performance ihres Teams machen und vom Team total gecarried werden. Außerden wird im langen Lauf dein Team keine Rolle mehr spielen, sofern du dich nicht mit Premades im Ranked anmeldest. Dein Team und dein Gegnerteam werden schließlich aus dem gleichen Spielerpool gezogen und mal wirst du die besseren, mal die schlechteren Kollegen haben. Ich hatte schon Losstreaks von vier oder fünf Spielen, weil mein Team echt nur Mist gemacht hat, wie zum Beispiel in dem Spiel [hier](http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2910469951/224886578?tab=overview). Ich hatte aber auch schon Winstreaks gleicher Länge, weil mein Team mich geacrried hat, wie zum Beispiel in dem Spiel  [hier](http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2912343675/224886578?tab=overview).","replies":[]}]},{"poster":"Ehren Teemo","date":"2016-11-01T16:16:02.324+0000","up_votes":1,"down_votes":1,"body":"https://www.youtube.com/watch?v=To8_s3cGF-8","replies":[]}]}