{"poster":"Herr LP","date":"2016-10-16T16:35:57.544+0000","title":"Reamkes obowhl man gewinnt","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":16,"body":"es steht 4 0 f&uuml;r dein Team und dann kommt Remake null LP danke Riot... ich bin daf&uuml;r das Remakes abegschafft  werden.Oder zumindest man dann trotzdem LP bekommt. gerne Kommentare.{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Nivoras","date":"2016-10-16T21:46:07.713+0000","up_votes":3,"down_votes":0,"body":"Lel nur weil ihr 4/0 steht heißt das nicht das ihr nicht throwen könnt.\nUnd würde es remakes nicht geben hättest du auf lange Sicht mehr verlorene Spiele aufgrund von Afks...","replies":[{"poster":"Uranbrennstab","date":"2016-10-17T08:03:11.032+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Nivenor,realm=EUW,application-id=ip27PlEH,discussion-id=3TgEP9ge,comment-id=0002,timestamp=2016-10-16T21:46:07.713+0000)\n>\n> Lel nur weil ihr 4/0 steht heißt das nicht das ihr nicht throwen könnt.\n> Und würde es remakes nicht geben hättest du auf lange Sicht mehr verlorene Spiele aufgrund von Afks...\n\nIch dachte Afk Spieler helfen dir auf Dauer beim Aufstieg. Weil die Wahrscheinlichkeit eines AFK Spielers im Gegnerteam höher ist.","replies":[{"poster":"MilliDieFrau","date":"2016-10-17T12:35:03.459+0000","up_votes":1,"down_votes":0,"body":"Schon, aber die Spiele, wo bei dir einer im Team von Anfang an AFK ist (oder eben auch im Gegnerteam) werden dann nicht als Niederlage gewertet. So gesehen hat man dann schon weniger Niederlagen durch AFK. \n\nVon der Wahrscheinlichkeit her hat man generell weniger, da ja nur vier aus deinem Team afk gehen können, aber fünf beim Gegner.\n\nIch schätze mal, Nivenor bezieht sich da auf die generelle Anzahl an AFK-Spielen, welche durch die Remake-Funkion verringert werden; da du einen Teil davon eben durch das Remake nicht \"verlierst\", sondern einfach cancelst. \nOhne Remake müsste man die Spiele ja auch komplett spielen (und potentiell auch verlieren).","replies":[{"poster":"Nivoras","date":"2016-10-17T13:22:35.371+0000","up_votes":2,"down_votes":0,"body":"Da hast du natürlich recht, und rein theoretisch betrachtet sehe ich das auch so, auch wenn ich das bei der Antwort nicht unbedingt bedacht habe. \nAllerdings würde ich bei dieser \"Regel\" auch bedenken, dass es rein statistisch ist. Das heißt, je mehr Spiele man absolviert, desto mehr trifft es zu. Als Beispiel könnte man vielleicht einen Würfel nehmen, je öfter man würfelt, desto mehr nähert sich das Verhältnis der verschiedenen Zahlen an, bei wenigen Würfen können da noch große Unterschiede sein, also das man zB viel öfter eine 2 wirft als eine 5, wenn du verstehst was ich meine, das würde sich aber irgendwann Ausgleichen bei mehr würfen.\n\nIch glaube man kann nicht davon ausgehen das die Afks sich freundlicherweise an Regelmäßigkeiten halten und abwechselnd im eigenen und im Gegnerteam sind, deshalb sehe ich diese \"Regel\" nur so meh. Besonders als Gelegenheitsspieler wäre es schon sehr vom Luck abhängig ob man öfter AFKs gegen oder mit sich hat. Ebenso bei Smurfs, nur das da die eigene Chance ja ebenfalls (nachteillig) geringer ist.\n\nUnd selbst wenn meine Meinung dazu Mist ist, es ist doch ein Fakt das sich ein 5vs4 nachteillig auf die Matchqualität auswirkt, und meiner Meinung nach ist es dabei egal wer nur zu viert spielt und welches Team gewinnt. Es wird immer ein bitterer Beigeschmack bleiben, ausser vlt man ist in dem Team das zu viert gewonnen hat, aber das ist, wenn man davon ausgeht das alle Spieler auf einem Niveau spielen, halt ziemlich selten.\n\nSorry für diese Wall of Text, ich wusste nicht wie ich das kürzer fassen soll xD","replies":[{"poster":"Herr LP","date":"2016-10-18T17:39:38.054+0000","up_votes":1,"down_votes":0,"body":"ich verestehe deine text und sage nur eins : WOW {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"Merriz","date":"2016-10-27T15:12:18.441+0000","up_votes":1,"down_votes":0,"body":"imprinzip hast du recht:D außer du gehst afk xD","replies":[]}]}]},{"poster":"Merriz","date":"2016-10-27T15:11:30.757+0000","up_votes":1,"down_votes":0,"body":"du kannst am anfang 15/0 haben, sobald das lategame anfängt habt ihr keine chance 4v5 im team.. natürlich will man dann remaken, lag gestern auch zurück mit 1/6 die gegner waren zu 5 hatten also kein afk, haben trd gewonnen. 4/0 im early hat noch nicht viel zu sagen","replies":[]},{"poster":"byDomey","date":"2016-10-16T18:48:46.677+0000","up_votes":1,"down_votes":0,"body":"Vielleicht hat dein Team die Stats 4/0 auch nur bekommen, weil ihr in Überzahl wart? \n\nIch finde die Funktion klasse, und hat das Spiel im einiges gesünder gemacht!","replies":[{"poster":"Herr LP","date":"2016-10-18T17:40:36.805+0000","up_votes":1,"down_votes":0,"body":"das habe ich gesagt ... ich habe ein game gemacht da waren wir 4 0 duch bot und mid nicht durch afk top","replies":[]}]},{"poster":"Alânte","date":"2016-10-17T21:21:19.835+0000","up_votes":1,"down_votes":0,"body":"Und was ist, wenn du das nächste Mal im Team mit einem AFK bist? Dann freust du dich über das Remakesystem und überdenkst erst einmal deine unreflektierte Aussage.","replies":[]},{"poster":"Ascanur","date":"2016-10-17T18:18:32.213+0000","up_votes":1,"down_votes":0,"body":"Überinflation der Elo wenn du trz. die Punkte bekommst ! \n\nAuch wenn du meistens nur die AFK's im Enemy Team hast und gewinnen würdest, denk daran es gibt Personen, die haben eine AFK in jedem 5 Spiel.","replies":[]},{"poster":"Sakunosuke Oda","date":"2016-10-16T16:48:13.206+0000","up_votes":1,"down_votes":0,"body":"Wenn die es bis zum Late rauszögern? Kannste es dann 4v5 winnenß","replies":[]}]}