{"poster":"Lowerade","date":"2016-05-16T17:15:43.235+0000","title":"attempting to reconnect","subforum":"[ARCHIVED] Help & Support","up_votes":5,"down_votes":1,"body":"Hello I am wondering if anyone else is experiencing that issue in-game , for the last two games I played I couldn't stay in-game without having the ' attempting to reconnect' message popping up and lagging my character back &amp; forth around my lane , freezing &amp; unfreezing constantly but I was able to see the people on the mini map even when my character was lagging for some reason , it has happened to be before on 2-3 occasions, but not two games in a row , I'm pretty sure that it's not my internet provider or my internet connection but an issue with the Riot Servers most likely , could anyone please let me know if it is a general issue that occurred to others as well , thank you ~\nLowerade","replies":[{"poster":"Melinda May","date":"2016-05-16T17:32:05.302+0000","up_votes":2,"down_votes":0,"body":"Yeah it happened to me in my last game, about 1 hour ago. It kept on saying \"attempting to reconnect\" at the end of the game when we had 2 inibs down, and cuz of that we lost. Happened before 2-3 crucial fight, so I thought I was getting ddos, but since it happen to you also, it must be the rito server.\n\nAnd no it wasnt my internet, I alt-tab during the \"attempting to reconnect\" and my internet was perfectly fine and working.","replies":[{"poster":"Jet Juanita","date":"2017-05-02T03:51:10.226+0000","up_votes":1,"down_votes":0,"body":"> it wasnt my internet\n> \n\nIs not.\n\nLike 4 or 5 days ago this issue is happen to me and never happened before, only on this game. My internet is working perfectly with all other things and games.\n\nSo.. ¿?","replies":[]}]},{"poster":"dArtagnan","date":"2016-05-16T21:09:14.370+0000","up_votes":1,"down_votes":0,"body":"This definitely sounds like something we want to get resolved ASAP.  It doesn't look like the issue is on the server-end however.  If the individual game server itself was having issue, then all 10 players in the game would be experiencing the same issue.  Given it sounds like you were uniquely experiencing this issue, the root cause seems to lie somewhere else.  In an effort to eliminate some of the most common root causes, make sure to complete all of the steps in our [Connection Issues Guide](https://support.riotgames.com/hc/en-us/articles/201752664).\n\nLet me know if you are still experiencing these same issues!","replies":[{"poster":"Lowerade","date":"2016-05-17T11:08:47.774+0000","up_votes":2,"down_votes":1,"body":"It doesn't happen anymore , could it be because I'm living in montreal and the servers are located in the eastern US?","replies":[{"poster":"dArtagnan","date":"2016-05-17T22:31:44.106+0000","up_votes":1,"down_votes":0,"body":"The physical location of the servers shouldn't be a root cause to this type of issue.  However, I'm very happy to hear that this doesn't appear to be occurring still!\n\nIf you experience any further issues, don't hesitate to create another thread and let me know!","replies":[]}]}]},{"poster":"iBuild","date":"2016-05-16T19:27:59.485+0000","up_votes":1,"down_votes":0,"body":"^^ Ditto, just started happening today for me.","replies":[{"poster":"iBuild","date":"2016-05-17T22:25:43.674+0000","up_votes":1,"down_votes":0,"body":"Update: :( Still happening unable to connect to server. Ironically this doesn't happen every game but randomly after a few games. >.- Think ill send a support ticket soon.","replies":[]}]},{"poster":"DARK SCARE","date":"2016-05-17T21:20:36.757+0000","up_votes":1,"down_votes":0,"body":"same here also since today morning {{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"The Concept","date":"2016-05-16T23:00:16.220+0000","up_votes":1,"down_votes":0,"body":"This is happening to me as well I have AT&T internet. I thought it was my internet and it doesn't seem to be.","replies":[]}]}