{"poster":"Vincent Kiesé","date":"2016-05-07T09:33:15.113+0000","title":"High Platin Top und Midlaner suchen Bot (AD und Support) & Midlaner für 5-er DynQ","subforum":"Clans & Teams","up_votes":2,"down_votes":2,"body":"Moinsen Freunde,\r\n\r\nim Prinzip steht das wichtigste schon im Titel ;)\r\nBei Interesse bitte ingame unter: Support is SIave (mit i) adden :)\r\n\r\nBis denne :D","replies":[{"poster":"xHidd3n","date":"2016-05-07T15:16:14.652+0000","up_votes":1,"down_votes":0,"body":"[ILG] Infinite League Gaming\nCommunity unendlicher Möglichkeiten\n\n✔ über 60 aktive Mitglieder ♂ und ♀\n✔ Facebook, Twitter, YouTube und Twitch\n✔ interne WhatsApp-Gruppe und einen Klub\n✔ Teamspeak: ts02.server4voice.de:50228\n✔ Homepage: http://infinite-league-gaming.de\n\n✔ Eröffnung von neuen Teams\n✔ interne und externe Events\n✔ Aufstiegsmöglichkeiten\n\nBeschwörer von League of Legends,\n\nInfinite League ist eine junge entschlossene Community mit nunmehr als 60 aktiven Mitgliedern. Gemeinsam bestehen wir Seite an Seite und pflegen seit jeher ein lobenswertes Miteinander. Unser Auftreten ist repräsentativ und steht vor allem für Fairplay und Kampfgeist. Der Weg der Beschwörer erhält in unserer Community die höchste Anerkennung, welchen wir mit großer Disziplin und Leidenschaft verfolgen. Es obliegt unserer Natur, gelassen zu siegen und anständig einer Niederlage entgegenzutreten. Wer dem nicht zustimmen vermag, ist und wird keiner unserer Reihen sein. Jeder verdient es, respektiert zu werden, ihm Hilfe zu leisten und das Gefühl von Wichtigkeit zu vermitteln, doch tut man dies nicht eigennützig, sondern aus purer Überzeugung!\n\nWir sind Infinite League Gaming - eine Community aus Leidenschaft.\n\nDiese Worte genügen Dir nicht? Dann überzeuge Dich selbst auf unserem gut strukturierten Teamspeakserver oder besuche uns auf der Homepage, die mit viel Liebe zum Detail und modernster Softwaresysteme entwickelt worden ist. Auch vorab kannst Du mit uns zusammen Gespräche führen und einige Runden bestreiten. Wir heißen Dich stets Willkommen und freuen uns, Dich kennen lernen zu dürfen.\n\nSelbstverständlich bieten wir auch all denen einen Platz, die sich durch ihr Können auszeichnen, seien es kreative, technische oder unterhaltungsmediale Fähigkeiten. In unserer Community wird jedem die Chance geboten, dem nachzugehen, was er oder sie gut kann, wenn der Wille stark genug ist. Auch über Sponsoring und Partnerschaften kann man mit uns sprechen, wir begegnen jeder Unterstützung mit offenen Armen und bieten gern die unsere im Rahmen unserer Möglichkeiten an.\n\nGemeinsam geht es immer einfacher als allein!\n\nDein oder Ihr Interesse wurde soeben geweckt?\nDu oder Sie wollen mehr über uns erfahren?\nWir freuen uns über jeden Kontakt.\n\n[ILG] Infinite League Gaming\nCommunity unendlicher Möglichkeiten\n\nAdministratoren @Game:\nxHidd3n - André\nSon Xeon - Kevin\n\"Claw or spear, your end's the same.\"","replies":[]},{"poster":"Living Tempest","date":"2016-05-07T10:27:18.236+0000","up_votes":1,"down_votes":0,"body":"Wofür 2 Midlaner?","replies":[]},{"poster":"Vincent Kiesé","date":"2016-05-07T09:53:08.688+0000","up_votes":1,"down_votes":0,"body":"push","replies":[]}]}