{"poster":"Estoy AFK","date":"2018-01-12T15:08:54.823+0000","title":"cual es el sentido que haya skins que no se puedan comprar?","subforum":"Charlas Generales","up_votes":2,"down_votes":11,"body":"eso..","replies":[{"poster":"Excalibeer","date":"2018-01-12T15:36:31.041+0000","up_votes":6,"down_votes":1,"body":"Hay algunos skins conmemorativos de eventos que no se han repetido, así como hay skins solo como recompensa por juego competitivo.  \n\nPero no es algo que Riot quiera explotar mucho, de hecho Riven de Campeonato salió a la venta después de estar restringido, pero se dio un bonus a los que lo tenían de antes para que se mantenga el reconocimiento.  \n\n-Excalibeer","replies":[{"poster":"Estoy AFK","date":"2018-01-12T21:26:37.286+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Riot Excalibeer,realm=LAS,application-id=v7qsfXsE,discussion-id=fsfnPI8c,comment-id=0003,timestamp=2018-01-12T15:36:31.041+0000)\n>\n> Hay algunos skins conmemorativos de eventos que no se han repetido, así como hay skins solo como recompensa por juego competitivo.  \n> \n> Pero no es algo que Riot quiera explotar mucho, de hecho Riven de Campeonato salió a la venta después de estar restringido, pero se dio un bonus a los que lo tenían de antes para que se mantenga el reconocimiento.  \n> \n> -Excalibeer\n\ncuando salio Shen amarillo, por ejemplo? hubo algun evento o algo? ","replies":[]}]},{"poster":"AMD Radeon RDNA","date":"2018-01-12T15:19:32.139+0000","up_votes":3,"down_votes":1,"body":"Es tener exclusividad y \"demostrar\" lo viejo que sos en el juego o lo que con esfuerzo conseguiste. \n\nPor ejemplo, yo vengo de NA y solo alla, podias tener a Alistar Desencadenado y Riot Tristana. Se sentia bien ser de \"los pocos\" que eran de la s1-s2; hasta que Riot, la jodio en grande en LATAM dandoles a todos.","replies":[{"poster":"Hnk Kenshiro","date":"2018-01-12T15:24:27.845+0000","up_votes":6,"down_votes":4,"body":"> Se sentia bien ser de \"los pocos\" que eran de la s1-s2\n\n\n¿Pero que diferencia hay en que otro también tenga la skin?\n\n(No digo que sea malo, solo pienso diferente), ¿No es lo mismo a final de cuentas? ¿No es el mismo modelo y animaciones, así la skin la tenga uno o le tengan mil?","replies":[{"poster":"Defg45333","date":"2018-01-12T18:06:55.772+0000","up_votes":2,"down_votes":0,"body":"En realidad no, si hicieran una skin buenísima con muy buenos efectos, voces y animaciones, y la regalaran al todo el server, no tendría ningún valor en realidad. En cambio si sacan una skin de mierda, que se vea peor que el aspecto base del champ y que no le cambie más nada, pero solo pudiera ganarse en un evento único y nunca más la dejaran disponible, esa vale mucho más.\n\nEjemplo: La skin Tristana Chica Riot, es posiblemente la skin menos valorada del juego. ¿Por qué? Porque es como no tener skin, ya que puedes obtenerla gratis, estoy seguro de que hay skins que visualmente son peores, pero cualquiera vale más que esa.\n\nOtro ejemplo: Riot Kayle, se dió en un evento a casi todos los jugadores, en su momento la skin no valía nada, pero a medida que aparecen jugadores que empezaron después de ese evento, son jugadores que no pueden conseguirla (de momento).\nSuponiendo que el LoL dura muchos años más y no dejan nunca esa skin disponible, se convertirá en una reliquia que representa todo el tiempo que lleva alguien jugando. (Sin necesidad de que le hagan cambios a la skin).","replies":[]},{"poster":"AMD Radeon RDNA","date":"2018-01-12T16:08:53.619+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=v7qsfXsE,discussion-id=fsfnPI8c,comment-id=00020000,timestamp=2018-01-12T15:24:27.845+0000)\n>\n> ¿Pero que diferencia hay en que otro también tenga la skin?\n> \n> (No digo que sea malo, solo pienso diferente), ¿No es lo mismo a final de cuentas? ¿No es el mismo modelo y animaciones, así la skin la tenga uno o le tengan mil?\n\nTe falta ver El Precio de la Historia por History Channel, para entender lo que es algo de coleccion xD!  o de ultima, buscar Twisted Fate Pax para saber el valor que tiene o el valor que tienen esas cuentas con ciertas skins exclusivas. \n\nOBVIAMENTE NO COMPARO semejantes skins con la cagdita del alistar y tristana, pero siendo un contenido free que SOLO lo conseguias estando desde la s1 hasta la migracion a LAS, ya pasaba a ser una coleccion. Lo mismo con algunas skins de los juegos olimpicos que casi nadie las tienen, pero con lo de hextech se fue alv.","replies":[{"poster":"Mithrilium X","date":"2018-01-12T16:12:47.518+0000","up_votes":2,"down_votes":1,"body":"las cuentas no se pueden vender por ende no tienen valor,vender cuentas es prohibido...","replies":[{"poster":"AMD Radeon RDNA","date":"2018-01-12T16:15:15.226+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ItachiEdoT,realm=LAS,application-id=v7qsfXsE,discussion-id=fsfnPI8c,comment-id=0002000000000000,timestamp=2018-01-12T16:12:47.518+0000)\n>\n> las cuentas no se pueden vender por ende no tienen valor,vender cuentas es prohibido...\n\nJuego esto desde la S2 y se lo que estas diciendo. Es recontra sabido, pero no puedes parar al \"mercado negro\". Es una realidad","replies":[{"poster":"Mithrilium X","date":"2018-01-12T16:15:47.539+0000","up_votes":1,"down_votes":1,"body":"...","replies":[]}]}]},{"poster":"Hnk Kenshiro","date":"2018-01-12T16:19:56.234+0000","up_votes":1,"down_votes":0,"body":"Si, aunque para mi Tf pax sigue siendo una skin no tan super genial estéticamente para mi.\n\nPero es solo opinion, como digo.","replies":[]}]},{"poster":"Deigex","date":"2018-01-12T16:56:45.108+0000","up_votes":1,"down_votes":0,"body":"Skins como ryze triunfante perderían su valor si se vendieran, para que jugué tantos torneos y me dedique a mejorar si cualquiera puede tenerlo?","replies":[{"poster":"Hnk Kenshiro","date":"2018-01-12T16:58:19.512+0000","up_votes":1,"down_votes":0,"body":"Si, pensaba más en la de legado.\n\n\nSkins así por merito si entiendo, ademas que esta disponible todo el tiempo (Si nos dan las manos xd)","replies":[]}]},{"poster":"Deigex","date":"2018-01-12T16:57:24.270+0000","up_votes":1,"down_votes":0,"body":"Skins como ryze triunfante perderían su valor si se vendieran, para que jugué tantos torneos y me dedique a mejorar si cualquiera puede tenerlo?","replies":[]}]}]},{"poster":"Urxnium","date":"2018-01-12T16:14:25.023+0000","up_votes":2,"down_votes":0,"body":"Te da el \"reconocimiento\" de ser más veterano en el juego(?, yo tengo a Morgana la Llorona (Cuando inició LAS!).","replies":[]},{"poster":"bombastico","date":"2018-01-12T15:47:21.286+0000","up_votes":2,"down_votes":0,"body":"Es el hecho de que sea un \"coleccionable\" pasa con varias cosas, figuras de colección, estampillas, los tazos, etc.\n Da un incentivo para participar en algún evento en especifico o lograr estar en cierta división y mostrarlo a los demás.","replies":[]},{"poster":"Galiers","date":"2018-01-12T22:17:17.554+0000","up_votes":1,"down_votes":0,"body":"el sentido es que cuando vendas tu cuenta pudes subirle el precio por tener skins exclusivas\n\ncuenta con todas las skins normales -> usd$200 \ncuenta con todas las skins normales + skins exclusivas -> sobre usd$400","replies":[]},{"poster":"Defg45333","date":"2018-01-12T17:44:20.309+0000","up_votes":1,"down_votes":0,"body":"El valor de un objeto muchas veces está determinado por su dificultad para encontrarlo, si sacás una skin de mierda, pero que se gana en un evento único y solo 100 personas la tienen, la skin gana mucho valor, porque casi todos quieren tener lo que no pueden, eso siempre ha sido así, y lo seguirá siendo, se aplica al lol, a todos los demás juegos, y a la vida misma.","replies":[]},{"poster":"Charlôtte","date":"2018-01-12T16:46:42.151+0000","up_votes":1,"down_votes":0,"body":"Amo mi Karma de Campeonato, bueno, Conquistadora. ","replies":[]},{"poster":"Spartann 117","date":"2018-01-12T15:13:35.380+0000","up_votes":1,"down_votes":0,"body":"que desde el momento en que la saquen y la compres no todos la van a tener, es como una coleccionable... yo lo veo asi","replies":[]},{"poster":"Hnk Kenshiro","date":"2018-01-12T15:11:53.137+0000","up_votes":1,"down_votes":0,"body":"Que son \"exclusivas\", y supuestamente es super genial tenerlas.\n\n---\n\nA mi me da igual, me interesa la skin en si, así que si la tengo solo yo o todo el mundo no me hace diferencia :p","replies":[]}]}