{"poster":"TROLLO","date":"2016-01-14T04:25:19.746+0000","title":"Is there a bug in champion selection?","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Hi guys,\nhas anyone experienced that when someone dodged a queue at champion selection for PvP, your LoL client will freeze when you get into another selection? it wont allow you to click anything and type in chat, but you can see whats everyone doing. It happened to me three times already....","replies":[{"poster":"Zaps","date":"2016-01-14T04:29:44.878+0000","up_votes":1,"down_votes":0,"body":"Hi Trollo,\n\nWe've had some reports of an issue with champion select and summoner spells that are impacting some players after the patch - and we're currently trying to find a fix. It'd be great to get some details from you to help fix this for everyone! \n\nWhat is the Operating System that you're currently using when you get the error? (Windows 7/8/10, OSX, etc.)\n\nCan you send in your client logs to ocelivereports@riotgames.com ?  [If you're not sure what logs they are, this link should let you know where to find them!](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq8)","replies":[{"poster":"IodineAwesome","date":"2016-01-14T11:57:58.279+0000","up_votes":1,"down_votes":0,"body":"This has happened to me several times now and it is sooo frustrating!! It doesn't just happen before games for me either it happens after them too. I now have to wait 15 minutes to play another game because I have had to close so many games! The screen just goes blurry and I cant do anything but close league :( This has only just happened after I updated the client this morning. I'm using windows 10 but I have heard others from windows 7 and 8 having the same problem. It doesn't happen every time but I haven't really paid attention to if there is something specific that is making it happen. I've had many people abandoning games recently and its probably for the same reason.","replies":[{"poster":"TROLLO","date":"2016-01-14T12:23:39.989+0000","up_votes":1,"down_votes":0,"body":"This is exactly what happened to me too when I updated the new patch this morning, it still works perfect to me last night before the new patch... hope Riot will fix this soon","replies":[]}]},{"poster":"TROLLO","date":"2016-01-14T04:53:07.310+0000","up_votes":1,"down_votes":0,"body":"HI Riot Zaps,\nI am currently using windows 8, and about the logs, i have found them but there are so many XD\nwhich one are you looking for? \nBTW, I'm not too sure if it is another bug or not, but Tahm Kench can not eat Lee Sin while Lee Sin was in my team the other day and I couldn't save him","replies":[{"poster":"Zaps","date":"2016-01-14T04:56:14.347+0000","up_votes":1,"down_votes":0,"body":"The name of the file should look something like:\n\nLolClient.20160114.144445.log\n\nThe first second is the date, and the second one is based upon the time - you should be able to sort them by their name, and they'll be in time order - there's one file per champion select instance! Or, if you're not sure, send the last few of them through and let us know how many games ago you had the problem","replies":[{"poster":"L3wis992","date":"2016-01-14T08:52:19.333+0000","up_votes":1,"down_votes":0,"body":"Same issue here, Windows 10.\n\nError logs: (1) http://pastebin.com/HCtpCgHM (2) http://pastebin.com/1CZkQzNW  \n\nHad it twice in a row, ranked draft pick. When you attempt to change the summoner spell, the client becomes unresponsive, although you can still see the chat and champs.\n\nIt seems to be a focus issue, the shaded backdrop from the \"summoner spell select\" doesn't disappear after exiting the menu and you cant interact with the client.\n\nThe bug doesnt go away if someone dodges, making it impossible to click any buttons on the home screen.\n\nEDIT: Added second log\nEDIT2: Bug appears to be based around teleport. It only appears to break the game when I select, or change from TP.","replies":[]},{"poster":"TROLLO","date":"2016-01-14T05:57:21.805+0000","up_votes":1,"down_votes":0,"body":"my lolclient file name looks like this...\n2015-04-25T22-57-10_LoLPatcherUx\n2015-04-25T22-57-11_LoLPatcherUx-gpu-process\n2015-04-25T22-57-11_LoLPatcherUx-renderer\n\nand they are all from last year, I look through all my files in the Riot Folder and no files have the similar name to the one you provided as an example. I already got a 10 mins penalty for this issue... :(","replies":[]}]}]}]}]}