{"poster":"LEE SIN OR AFK  ","date":"2019-08-02T15:21:31.792+0000","title":"Trolls en rankeds","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"\n\nhola buenos dias el tema es que en mi ultima ranked me paso lo siguiente, entraron como 3 directamente a trollear y queria saber que puedo hacer ademas de ponerlo en el foro soy nuevo perdon si no era por aca \n\n\n","replies":[{"poster":"Hendrix","date":"2019-08-02T15:27:42.609+0000","up_votes":3,"down_votes":0,"body":"Y si, ranked a dos dias del cierre es como un llamador para toda esta gentuza.\n\nIgual borra la imagen, porque te van a sancionar a vos","replies":[{"poster":"LEE SIN OR AFK  ","date":"2019-08-02T15:31:56.900+0000","up_votes":1,"down_votes":0,"body":"Ahí lo borre, pero mi pregunta es que puedo hacer? Porque quieras o no te da rabia, hay que ser muy bobo para gastar 30 minutos de tu vida entrando a perder a propósito y perder el tiempo en una partida","replies":[{"poster":"Hendrix","date":"2019-08-02T15:45:28.755+0000","up_votes":1,"down_votes":0,"body":"Primero, reportar al final de la partida\nDespues, si tenes imagenes como la que tenias, mandalas via soporte\n\nFunciona bien? Mmmmmm, no del todo, pero es lo unico que hay\n\nCon respecto a tu planteo, miralo asi, es gente con una vida bastante miserable. Considera que su dosis de felicidad diaria consiste en ver como te garcaron una partida. Su tiempo? Y... date una idea de lo que vale...","replies":[{"poster":"LEE SIN OR AFK  ","date":"2019-08-02T16:29:09.010+0000","up_votes":1,"down_votes":0,"body":"Gracias bro!!","replies":[]}]}]}]},{"poster":"Ghoperef","date":"2019-08-02T19:52:35.522+0000","up_votes":1,"down_votes":0,"body":"no puedes hcar ni una wea xd, ayer jugue jg, estompie las 3 lineas y mi team se puso a intear en mid, '' no te lo tomes en serio''\nno fueron a dragones ni a barones ni a nada. Por no cerrar el game se alargo y luego perdimos. Pasalo bien decia el jhin.","replies":[{"poster":"e aa wq","date":"2019-08-02T22:30:34.068+0000","up_votes":1,"down_votes":0,"body":"Si eso fue en ranked, deberia ser reportable la actitud antideportiva del {{champion:202}}.\n\nLas rankeds son para ganar, no para \"pasarla bien\".","replies":[{"poster":"Ghoperef","date":"2019-08-03T01:43:59.511+0000","up_votes":1,"down_votes":0,"body":"pasa que hace un buen tiempo la gente juega a ''pasarla bien'' en rankeds.\n\nY bueno presisamente el atractivo de la ranked es la competitividad, eso las hace divertidas.\n\nNormal= baby futbol\nRanked = futbol","replies":[]}]}]}]}