{"poster":"Jiren Wrath ","date":"2018-12-20T21:41:18.981+0000","title":"Tipps & Tricks","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hallo liebes League of Legends Forum,\r\nw&auml;re einer von euch bitte so nett und k&ouml;nnte mir vielleicht ein paar Tipps &amp; Tricks f&uuml;r den Champ Volibear geben da ich ein One-Trick-Player mit Volibear werden will nat&uuml;rlich k&ouml;nnt ihr mir auch schreiben was ihr davon haltet nur aus das was ich bisher gelernt habe ist Volibear ein sehr guter Champ der auch nicht grade schlecht gestaltet wurde darum bitte ich um eure Hilfe .\r\nUnd findet ihr das ein Champ wie Volibear ein Rework n&ouml;tig hat oder findet ihr diesen so wie er ist ganz ok?\r\nPS:Ich bin kein Anf&auml;nger nur weil ich Level 8 bin au&szlig;erdem finde ich es sinnvoller sich auf nur eine Sache zu konzentrieren anstatt jetzt als Beispiel 20 Champs zu spielen schlie&szlig;lich ist nicht der gef&uuml;rchtet welcher 20 Champs spielen kann sondern nur der welcher einen Champ immer und immer wieder traniert und diesen dann auch sehr gut spielen kann dies ist meine Meinung dazu hoffe ihr k&ouml;nnt mir helfen.\r\nMit freundlichen Gr&uuml;&szlig;en\r\nJiren Wrath","replies":[{"poster":"I am on tiIt","date":"2019-01-11T13:17:05.351+0000","up_votes":1,"down_votes":0,"body":"kuck dir lieber nen vernünftigen stream an der nicht 10mal ne webcam als donation goal hat und bis heute keine besitzt, aber ddas geld einsackt.","replies":[]},{"poster":"Kata Ga Kill","date":"2018-12-31T03:58:25.251+0000","up_votes":1,"down_votes":1,"body":"Ich kann dir schon soviel sagen das Volibär sich grade inmoment in der Entwicklung befindet und in den nächsten wenigen Patches auf die Betas kommen könnte.\nSoweit grob will das Entwicklerteam sein Q beibehalten und seine R umändern weg von verstärktem AA zu eine Art Aura die die Gegner Stunt (ähnlich Kennen Ult)\nEr soll mehr richtung Bruiser getrimmt werden.\n\nZu deiner OTP frage: Macht dir Volibear spaß?\nWenn ja dann spiel den als OTP solange es dir spaß macht, alles andere kommt von allein.\n\nAllerdings ist die sache mit Reworks so ziemlich für viele ein Problem manche hassen es, manche lieben es, manchen ist es egal.\nWies bei dir ausehen wird kann dir niemand sagen, auser genieß die Zeit die dir mit deinen Favoriten bleiben.","replies":[]},{"poster":"Dreadlord Mike","date":"2018-12-21T10:49:14.906+0000","up_votes":1,"down_votes":1,"body":"Ich kenne mich zwar nicht so gut mit Voli aus, hab den nur damals gezockt als ich angefangen habe. Fand ich nachher ehrlich gesagt zu stumpf deswegen hab ich ihn aufgehört zu spielen. \nIch kann dir den Twitch streamer SirBerlinstyle empfehlen. \nIst sozusagen ein Volibear otp auf dia 3 lvl, spielt nur sehr selten andere champs","replies":[{"poster":"OT Riku","date":"2018-12-24T06:55:21.769+0000","up_votes":1,"down_votes":1,"body":"Er war sogar letzte oder vorletzte season Master mit 2 Acc.","replies":[]},{"poster":"Jiren Wrath ","date":"2018-12-21T14:55:49.901+0000","up_votes":1,"down_votes":1,"body":"Vielen Dank für die Hilfe und für den Tipp mit dem Streamer SirBerlinstyle","replies":[]}]},{"poster":"Jiren Wrath ","date":"2018-12-21T09:35:54.682+0000","up_votes":1,"down_votes":1,"body":"Vielen Dank für die Info ich selbst finde das Volibear unter anderem auch ein sehr unterschätzter Champ ist und auch nicht so oft gespielt wird daher empfinde ich eben auch das er gut ist als One-trick-Champ","replies":[]},{"poster":"Amycos Cyrus","date":"2018-12-20T23:42:06.792+0000","up_votes":1,"down_votes":1,"body":"Nur mal so zum Beginn \"OTP von beliebigem Champ ist schon mal eine gute Idee.\"\n\nDa Voli recht gradlinig ist (die Q+E-Combo sollte man können, aber sonst bietet er nicht viel spezielles) geht es bei ihm eher darum, welche Matchups wie zu spielen sind. Und für sowas spiele ich ihn zu selten.\n\nDas mit dem Rework: Ich kann mir schon vorstellen, das Voli zu den Top 10 der nächsten Reworks zählt, da er ein recht gut zu überarbeitendes Konzept verfolgt und aktuell eher zu den unbeliebtesten Champions zählt.","replies":[]}]}