{"poster":"Rock the Climber","date":"2015-12-01T09:43:19.944+0000","title":"Como hacen los daltónicos para jugar con Twisted Fate?","subforum":"Charlas Generales","up_votes":10,"down_votes":2,"body":"Porque el modo daltonico no le cambia el color de las cartas. Se que las cartas tienen un dibujito, pero en medio de una tf es dif&iacute;cil ver o tambi&eacute;n a la hora de tirar ulti con la camara desbloqueada mirando el hud para elegir la carta al gankear. Si hay alguien que sea daltonico y juegue twisted fate que me diga as&iacute; me saco la duda http://m.memegen.com/12nd2f.jpg","replies":[{"poster":"Hnk Kenshiro","date":"2015-12-01T13:24:49.217+0000","up_votes":4,"down_votes":0,"body":"Yo soy algo daltonico, pero entre azul rojo y amarillo hay mucha diferencia de colores, si por ejemplo las cartas fuera amarillas y verdes pues yo no podria, si fueran azul, morado y violeta yo las veria iguales :p Tambien la vida gris de tham, era muy complicada verla en modo normal, ahora juego el modo daltonico, los votos negativos en las rendiciones tambien son dificil de ver, pero es por un poco de comodidad","replies":[{"poster":"Ode to dark","date":"2015-12-01T21:33:32.196+0000","up_votes":1,"down_votes":0,"body":"Wou nunca había conocido a alguien daltónico.\n¿Sufres mucho en el día a día o has sufrida alguna ves o no es para tanto? :p","replies":[{"poster":"Hnk Kenshiro","date":"2015-12-01T22:30:22.384+0000","up_votes":2,"down_votes":0,"body":"Lo unico duro eran las clases de arte, en donde temia pintar el pasto cafe y el cielo morado :c \ncomo dije, no tengo un daltonismo severo, si no que no diferencio ciertos colores, siempre busque tomarlo con humor junto a mis compañeros,","replies":[{"poster":"Fristay4","date":"2015-12-02T06:13:28.840+0000","up_votes":1,"down_votes":0,"body":"Hasta donde tengo entendido los daltonicos no diferencia bien los colores cálidos. Sí los fríos.","replies":[]}]}]}]},{"poster":"Rohaerlynn","date":"2015-12-01T09:57:53.408+0000","up_votes":3,"down_votes":0,"body":"si tiene daltonismo no creo que tenga problema alguno\nahora si tiene monocromatismo eso si seria algo en lo que pensar seriamente.","replies":[]},{"poster":"ZanahoriaAsesina","date":"2015-12-01T13:12:44.440+0000","up_votes":2,"down_votes":0,"body":"En todo caso se guiarían con el modelo de la carta en vez de su color ya que las 3 son distintas: Ojo,espada,cadena creo que son los modelos.\n\nhttps://www.youtube.com/watch?v=hZlV_pYbFF0 \n\nY como dice #Rohaerlynn el problema seria si alguien tuviese monocromatismo.","replies":[]},{"poster":"Malkazsk","date":"2015-12-01T14:23:02.914+0000","up_votes":1,"down_votes":0,"body":"un daltonico solo confunde el rojo y verde y lo ven mas opaco como gris\nla verdad la unica carta que confunde es la roja que se ve como amarilla\n  : D","replies":[{"poster":"Fharzen","date":"2016-01-25T20:07:17.159+0000","up_votes":1,"down_votes":0,"body":"Soy daltonico y te puedo decir que no vemos el rojo como amarillo LOL {{champion:64}}","replies":[]}]},{"poster":"Memianna","date":"2015-12-01T21:25:32.654+0000","up_votes":1,"down_votes":0,"body":"yo no soy daltonico pero uso el modo daltonico para ver la hp amarilla, asi veo donde estoy en una tf mas facil","replies":[{"poster":"Fristay4","date":"2015-12-02T06:17:49.697+0000","up_votes":1,"down_votes":0,"body":"m2.","replies":[]}]},{"poster":"Anniequiladora","date":"2015-12-02T01:26:22.288+0000","up_votes":1,"down_votes":0,"body":"Yo creo que el problema seria cuando este en premade y le diga \"Tira la carta amarilla\" y el no sepa cual es la amarilla , aunque se arreglaría si el daltónico le dice que le diga por los efectos \"Tírale slow\" \"Tírale stun\"","replies":[]},{"poster":"Excorpion","date":"2015-12-02T00:45:24.339+0000","up_votes":1,"down_votes":0,"body":"Primero que nada... un daltónico vee los colores que ve... eso significa que cunado utiliza una carta, por ejemplo la del stun (no se que color es el correspondiente a los daltónicos), el no se confunde, porque ya sabe que carta utilizará. Es decir, suponiendo que el rojo lo ven amarillo... ellos saben que esa carta amarilal para ellos aplica un slow, y que es otra la carta que aplica el stun.","replies":[]},{"poster":"ikhor","date":"2015-12-01T20:54:40.613+0000","up_votes":1,"down_votes":0,"body":"también podrían recordar en vez del color de la carta, su posición.","replies":[]},{"poster":"yOCobain","date":"2015-12-01T14:04:04.522+0000","up_votes":1,"down_votes":0,"body":"El único problema sería en caso de que vea solo en dos colores, onda blanco y negro, eso sería más que preocupante. El daltonismo pasa por otro lado, en lugar de hacer blue haría ... green (? y en lugar de red sacaría Brown {{champion:201}}  oh dios...\n\nEn fin... seguiría viendo tres colores distintos en las cartas de TF, no creo que haya mucho drama.\n\nSaludos!","replies":[]},{"poster":"rokushoger","date":"2015-12-01T11:07:08.065+0000","up_votes":2,"down_votes":3,"body":"No importa, porque un daltónico solo tiene problemas de que cambia los colores. No se exactamente como, pero pongamos el ejemplo de que el rojo lo cambia a violeta, el azul a verde, y el amarillo a naranja, y aún así seguiría sin dramas porque las tres cartas tendrían diferentes colores y por ende seguirían siendo distintas, sería solo cuestión de aprenderse cual es cual. \nAhora si como dijo Rohaerlynn tiene monocromatismo y ve todo del mismo color, eso si le complicaría.","replies":[]}]}