{"poster":"Rock the Climber","date":"2016-04-22T11:54:24.073+0000","title":"2 cosas que mejoraria de la artesanía hextech","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"No voy hablar de las llaves, eso ya esta bien. Lo que vengo hablar es de 2 opciones de la artesan&iacute;a hextech que creo que no se sienten tan bien.\r\n\r\nLo primero es activar. \r\nLa verdad no hay motivos para usar esta opci&oacute;n y los &uacute;nicos que la usan son aquellos que no saben que es lo que hace activar, lo cual hace pensar &quot;para que pusieron esta opci&oacute;n en primer lugar?&quot;(gui&ntilde;o gui&ntilde;o). Si quieres probar un champ es mejor esperar a la free week as&iacute; guardas el bot&iacute;n por si no te gusto el champ. y la skin y ward es mejor mejorar o desencantar. \r\nPara mi una buena idea para que sea &uacute;til esta opci&oacute;n es que un vez que la alquilaste y pasaron los d&iacute;as vuelva a la artesan&iacute;a y quede como los otros objetos del bot&iacute;n, solo que ya no se puede alquilar mas. Entonces sirve para probar, si te gusta te la quedas, y si no la desencantas.\r\n\r\nY el otro problema es transformar (pero solo en la opci&oacute;n de skin). \r\nla verdad no conviene usar nunca esta opci&oacute;n, ya que pierdes mucha esencia naranja y te dan una skin que no puedes elegir si qued&aacute;rtela o desencantarla y encima puede ser de cualquier champ inclusive los que no tenes. y aunque esta se quede guardada en el caso de que no tengas el champ y la puedes desencantar, igual perdes mucha esencia naranja. Esto me ha pasado a mi y la verdad sent&iacute; que perd&iacute; 3 cajas en vano.\r\nPara mi, para mejorar esto es que al transformar solo puedan tocarte skins de champs que ya tenes. Y en el caso que en la transformaci&oacute;n se use por ejemplo 3 skins de 975 que te toque una aleatoria de ese precio.\r\n\r\nBueno eso son las ideas que se ocurren para mejorar esa 2 opciones que la verdad no las siento tan satisfactorias de usar. La artesan&iacute;a hextech me gusto mucho y se que es nueva y por eso no es perfecta. Por eso me tome a molestia de ver si lo que opino lo ven interesante para aplicarlas en un futuro. Adi&oacute;s.\r\nhttps://www.youtube.com/watch?v=uF8fhKw-7mk","replies":[{"poster":"Ryudo Tenjin","date":"2016-04-22T14:08:11.903+0000","up_votes":1,"down_votes":0,"body":"Lo de transformar es cosa de suerte. Yo metí 3 skins de 3 champs que no uso, y me salió la Annie Hextech a la primera. Era la PRIMER transformación que hacía... Rinde.\n\nPero bueno, a veces tocan cosas que no nos sirven tanto, es una lotería.\n\nLo que yo SI haría sería que la esencia azul se pueda cambiar por la roja, y  la roja por azul. No se si al 100% del valor, pero aunque sea a un 50%.\n\nEs decir, tenes 3.000 esencia azul y poder cambiarla por 1.500 de esencia roja. O tenes 3.000 roja y poder cambiarla por 1.500 de la azul.\n\nTengo todos los champs, y cuando me tocan en las cajas champs que ya tengo, la esencia azul me la meto donde no me llega la luz.","replies":[]},{"poster":"rokushoger","date":"2016-04-22T13:24:12.307+0000","up_votes":1,"down_votes":0,"body":"Estoy de acuerdo con la activación, y en desacuerdo con el transformar. El transformar está hecho así para aquellos que ya tienen casi todas las skins de los pj que tienen compradas puedan usar también la opción (porque se precisa un pool mínimo de skins para usarla). Además la aleatoriedad es lo que le da emoción!","replies":[]},{"poster":"iCasteGoDx","date":"2016-04-22T12:08:58.125+0000","up_votes":1,"down_votes":0,"body":"Con respecto a transformar, yo meti a illaoi portadora de vacio, shen luna sangrienta y una de xerath y me toco evelynn tanguera (nunca me gusto ese pj, esa skin es malisma y nisiquiera lo tengo comprado) yo pensando que me tocaria alguna mejor. No me quejo porque fue mi decisión y esta todo al azar pero podrían mejorarlo un poquito","replies":[]}]}