{"poster":"EnLoQueSiDo","date":"2017-04-18T23:23:16.409+0000","title":"Voy a ingresar y me dice que mi cuenta esta suspendida permanentemente","subforum":"Problemas Técnicos","up_votes":1,"down_votes":3,"body":"Bueno como dice el titulo, recientemente estoy por ingresar a mi cuenta para jugar despues de un largo dia de trabajo y me dice que mi cuenta esta suspendida permanentemente no dice el por que? ahora, quiero saber en donde me tengo que dirigir para ver donde el error o que paso por que esto paso de la nada anoche juge tranquilamente y ahora me aparece esto,","replies":[{"poster":"chileannoob","date":"2017-04-18T23:29:53.935+0000","up_votes":1,"down_votes":1,"body":"{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Teemo Stahp Pls","date":"2017-04-18T23:55:52.042+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Yazzy","date":"2017-04-18T23:46:44.540+0000","up_votes":1,"down_votes":0,"body":"Hola, te digo paso a paso cómo enviar un ticket al soporte:\n\n1) Dirigite a https://support.riotgames.com/hc/es-419.\n2) Iniciá sesión con tu cuenta del LoL, clickeando en el botón \"Iniciar Sesión\" que hay en la esquina superior derecha.\n3) Una vez que hayas iniciado sesión, clickeá en \"Envía un Ticket\", es una de las opciones que hay en la barra superior de la página.\n4) En donde dice \"ELIJA UN TIPO DE SOLICITUD A CONTINUACIÓN\", selecciona la opción que dice \"Tengo una pregunta sobre una suspensión o restricción en mi cuenta\".\n5) Te va a aparecer una especie de planilla la cual tenés que rellenar:\n -**TEMA**: Acá tenes que poner que te suspendieron permanentemente y querés saber el por qué.\n -**REGIÓN**: Seleccioná \"Latam - South\" que sería LAS en inglés.\n -**LENGUAJE**: Solo va a aparecer Español, así que seleccionalo.\n -**SABES EL MOTIVO DE LA SUSPENSIÓN O RESTRICCIÓN EN TU CUENTA?**: Acá tenés que poner tu duda. Si no recibiste información en el mail que está asociado a tu cuenta (generalmente explica las razones en ese mail), seleccioná \"No he recibido información pero mi cuenta está suspendida permanentemente y no puedo iniciar sesión\".\n -**HAS COMPARTIDO TU CUENTA CON ALGUIEN MÁS?**: Seleccioná Si o No según corresponda. No mientas, esta información es clave para que determinen si pueden retirarte la suspensión o no.\n -**DESCRIPCIÓN**: Acá escribiles detalles acerca de tu situación, cualquier cosa que quisieras decirles, obviamente con respeto y formalidad.\n6) Dale click a ENVIAR y ya está. Te va a llegar un mail confirmando que tu ticket se envió, y cuando te contesten (tardan 2 días como mucho) te va a llegar otro mail con la respuesta a tu ticket.\n\nSaludos y buena suerte. Cabe recalcar que no suelen retirar suspensiones, pero no perdés nada con intentarlo.","replies":[]},{"poster":"EnLoQueSiDo","date":"2017-04-18T23:33:51.902+0000","up_votes":1,"down_votes":0,"body":"Pero nose donde tengo que mandar ni un ticked nada de eso si me podrias orientar un poco te lo agradeceria","replies":[]}]}