{"poster":"iBloodyMurder","date":"2018-04-12T15:49:09.682+0000","title":"Cali Fps da tre settimane circa.","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Ciao a tutti, non sono solito scrivere nel forum, tuttavia nonostante abbia provato per diverse settimane a risolvere il problema autonomamente mi trovo senza pi&ugrave; idee. \r\nSono solito giocare con fps tra i 130 e i 144 ed ms fissi a 33. Da un mese a questa parte mi &egrave; diventato praticamente impossibile giocare, in game ora parto da 70 fps che scendono verso i 30 minuti fino a 44, il problema &egrave; che non ho pi&ugrave; il controllo del campione, lo vedo teletrasportarsi da una parte all&#039;altra senza camminare. Inizialmente avevo risolto chiudendo manualmente il client in game, gli fps risalivano a 140 e tutto era fluido. Dall&#039;ultima patch tuttavia chiudendo il client mi si sballano gli ms, passando da 700 fino a 2000. Pensando fosse un problema di prestazioni del pc ho provato a giocare da un portatile con prestazioni notevolmente inferiori e difatti gli fps si fermavano a 60 e gli ms a 33, per&ograve; era tutto fluido. Non riesco quindi a comprendere se sia un problema di questo pc o se sia proprio del client. Ho gi&agrave; provato ad utilizzare l&#039;hextech repair tool ma non &egrave; servito, ho disinstallato il gioco e reinstallato, ma ancora nulla. Nel dubbio ho anche disinstallato e riscariscato i driver della scheda video (una radeon) ma anche qui senza ottenere risultati.  \r\nPs: girando sul forum inglese ho visto che diversi player hanno lo stesso problema pur avendo schede video come gtx 1060 o pi&ugrave;\r\nSe qualcuno avesse un&#039;idea di come risolvere mi farebbe un enorme favore. Grazie","replies":[{"poster":"x16y16z16","date":"2018-04-12T15:58:40.106+0000","up_votes":2,"down_votes":0,"body":"allora, io ho avuto il tuo problema alcuneo patch fa.. molti hanno risolto in 2 modi: reinstallare lol o utilizzare lautoriparazione","replies":[{"poster":"iBloodyMurder","date":"2018-04-12T16:00:59.890+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=x16y16z16,realm=EUW,application-id=98NGV4Al,discussion-id=gBp0rhG2,comment-id=0000,timestamp=2018-04-12T15:58:40.106+0000)\n>\n> allora, io ho avuto il tuo problema alcuneo patch fa.. molti hanno risolto in 2 modi: reinstallare lol o utilizzare lautoriparazione\n\nIntendi quella interna al client? Reinstallare ho già provato, ma non ha dato miglioramenti","replies":[{"poster":"xZaga","date":"2018-04-14T14:23:36.919+0000","up_votes":1,"down_votes":0,"body":"stesso problema.... non si e ancora risolto nulla,... come fa ad essere cosi ottimizzato male sto gioco?","replies":[{"poster":"iBloodyMurder","date":"2018-04-17T07:40:33.343+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xZaga,realm=EUW,application-id=98NGV4Al,discussion-id=gBp0rhG2,comment-id=000000000001,timestamp=2018-04-14T14:23:36.919+0000)\n>\n> stesso problema.... non si e ancora risolto nulla,... come fa ad essere cosi ottimizzato male sto gioco?\n\nHo contattato il supporto giocatori e mi hanno fatto installare vari driver e provato alcune impostazioni ma il problema è rimasto, penso sia proprio l'ottimizzazione del client perché l'unico modo per far funzionare il gioco è chiudere questo manualmente. Alla fine mi hanno detto di mandare una segnalazione, vedremo","replies":[]}]},{"poster":"x16y16z16","date":"2018-04-12T21:04:38.183+0000","up_votes":1,"down_votes":0,"body":"si quella... altri metodi nn mi vengono in mente scusa..","replies":[]}]}]}]}