{"poster":"Cabruh","date":"2017-02-12T14:02:43.614+0000","title":"\"It’s possible to earn 4 keys (12 fragments) in a 4 week period\" - Riot","subforum":"Gameplay","up_votes":40,"down_votes":7,"body":"Tell that to the 6 chests sitting in my inventory next to 2 key fragments.\r\n\r\nExactly how many games does Riot expect us to play to get to that level? I already play more than I should.","replies":[{"poster":"420 grams","date":"2017-02-12T15:31:43.198+0000","up_votes":19,"down_votes":2,"body":"I have the opposite problem where I have a bunch of keys but not enough available chests to use them","replies":[{"poster":"Placentas","date":"2017-02-12T18:14:20.719+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=420 grams,realm=NA,application-id=3ErqAdtq,discussion-id=7sQRvrUt,comment-id=0004,timestamp=2017-02-12T15:31:43.198+0000)\n>\n> I have the opposite problem where I have a bunch of keys but not enough available chests to use them\n\n\nDo some premades with buddies and their mains to get the chest from their S grade.","replies":[]},{"poster":"Covert Ops Gnar","date":"2017-02-12T22:17:17.009+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=420 grams,realm=NA,application-id=3ErqAdtq,discussion-id=7sQRvrUt,comment-id=0004,timestamp=2017-02-12T15:31:43.198+0000)\n>\n> I have the opposite problem where I have a bunch of keys but not enough available chests to use them\n\nl2p more champs","replies":[]},{"poster":"Aldapsayar","date":"2017-02-13T02:19:09.389+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=420 grams,realm=NA,application-id=3ErqAdtq,discussion-id=7sQRvrUt,comment-id=0004,timestamp=2017-02-12T15:31:43.198+0000)\n>\n> I have the opposite problem where I have a bunch of keys but not enough available chests to use them\n\naram","replies":[]},{"poster":"yung niga singed","date":"2017-02-13T17:27:36.307+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=420 grams,realm=NA,application-id=3ErqAdtq,discussion-id=7sQRvrUt,comment-id=0004,timestamp=2017-02-12T15:31:43.198+0000)\n>\n> I have the opposite problem where I have a bunch of keys but not enough available chests to use them\n\nThen play more than one champ.","replies":[{"poster":"420 grams","date":"2017-02-13T18:49:29.756+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Azal,realm=NA,application-id=3ErqAdtq,discussion-id=7sQRvrUt,comment-id=00040005,timestamp=2017-02-13T17:27:36.307+0000)\n>\n> Then play more than one champ.\n\nPlaying more champs doesn't give more available boxes. You still only get the four a month.","replies":[]}]},{"poster":"Mig89","date":"2017-02-12T16:25:11.303+0000","up_votes":1,"down_votes":0,"body":"same. Ive got 11 keys right now","replies":[{"poster":"Skorch","date":"2017-02-13T01:06:52.203+0000","up_votes":1,"down_votes":0,"body":"Trade... plz","replies":[]}]},{"poster":"lightdragoon88","date":"2017-02-13T00:31:55.383+0000","up_votes":1,"down_votes":0,"body":"Same...I have like....8 keys fully complete but no chest.","replies":[]}]},{"poster":"DrCyanide","date":"2017-02-12T15:33:16.865+0000","up_votes":10,"down_votes":0,"body":"I've got about 8 full keys in reserve, waiting for chests. Different problems depending on how you play the game.","replies":[{"poster":"doiminat0r3600","date":"2017-02-12T15:57:09.148+0000","up_votes":3,"down_votes":2,"body":"It's solo. You have to be partied up to get chests for allies achievements. Kinda BS if you ask me.","replies":[{"poster":"IcyPepper","date":"2017-02-12T23:15:34.956+0000","up_votes":8,"down_votes":1,"body":"How is that BS...? They're promoting playing with friends.\n\nIt's *free stuff for the thing they get their main source of revenue from.* God forbid there's a few hoops you have to go through to make it *easy.*","replies":[{"poster":"Saewin","date":"2017-02-13T00:34:57.184+0000","up_votes":8,"down_votes":0,"body":"he's just sad because he has no friends. {{champion:32}} feelsbadman.\n{{sticker:zombie-nunu-bummed}}","replies":[]}]},{"poster":"DrCyanide","date":"2017-02-12T16:22:41.321+0000","up_votes":1,"down_votes":0,"body":"<misread, can't find the delete option on mobile>","replies":[]}]},{"poster":"byakugan123","date":"2017-02-12T16:23:44.533+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=DrCyanide,realm=NA,application-id=3ErqAdtq,discussion-id=7sQRvrUt,comment-id=0005,timestamp=2017-02-12T15:33:16.865+0000)\n>\n> I&#x27;ve got about 8 full keys in reserve, waiting for chests. Different problems depending on how you play the game.\n\nYES! I get key frag after key frag, but no chests to open :( a sad life this is","replies":[]}]},{"poster":"SwiftKitten88","date":"2017-02-12T16:31:47.734+0000","up_votes":4,"down_votes":4,"body":"i have 16 COMPLETED keys... and 1 key fragment.... no boxes... REALLY don't think key drop is the issue...","replies":[{"poster":"Cabruh","date":"2017-02-12T18:35:11.938+0000","up_votes":7,"down_votes":0,"body":"Key drop is an issue AS WELL AS box earning.\nPlayers who don't play 10 games a day don't earn enough key frags.\nPlayers who don't play single every champ in the game don't get enough boxes.\n\nIf you earn more boxes, you'll see the first is a much bigger problem since playing that much league is enough to give anyone brain cancer. Most are willing to play a different champ every week to earn a chest.","replies":[{"poster":"Pierce The Veal","date":"2017-02-13T07:46:28.428+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cabruh,realm=NA,application-id=3ErqAdtq,discussion-id=7sQRvrUt,comment-id=000a0000,timestamp=2017-02-12T18:35:11.938+0000)\n>\n> Key drop is an issue AS WELL AS box earning.\n> Players who don&#x27;t play 10 games a day don&#x27;t earn enough key frags.\n> Players who don&#x27;t play single every champ in the game don&#x27;t get enough boxes.\n> \n> If you earn more boxes, you&#x27;ll see the first is a much bigger problem since playing that much league is enough to give anyone brain cancer. Most are willing to play a different champ every week to earn a chest.\n\nIt would be an interesting mechanic to see the game make up for having an imabalanve of the two by replacing the other drop with the missing component. Get an S and there's too many boxes? Get a key instead. Going to get a key fragment and got too many anyways? Replace key drop with a box.","replies":[]}]}]},{"poster":"doiminat0r3600","date":"2017-02-12T15:55:50.479+0000","up_votes":4,"down_votes":1,"body":"I get about 3 keys a month.\nIt rewards good play.\n\nMeanwhile solo players are expected to get an S on every champion in the roster....","replies":[{"poster":"Mysticman89","date":"2017-02-12T16:17:31.720+0000","up_votes":4,"down_votes":0,"body":"A little under half really, which is better but still somewhat daunting towards the end of season.\n\nI generally try to do off-meta or otherwise weird champions for chests early on where possible, with the intent to switch to more meta picks when I'm close to having a second chest available. I've never actually gotten close to having two chests available to earn though, if you spam any champ enough you eventually have stompy games.\n\nI feel like I manage 3 and a bit keys rather than the full 4 though, which makes me slowly fall behind, with me sitting on 5 chests currently and no frags. That I can't even catch up unless I mess up my S chest earning is somewhat frustrating.","replies":[{"poster":"RocketRelm","date":"2017-02-12T17:32:43.983+0000","up_votes":1,"down_votes":0,"body":"You can get chests off alternate game modes. I got mine for kassadin on blood moon (a champion I would NEVER have gotten one on otherwise). Nobody plays him this mode despite being really good (albeit UN intuitive). Last week it was dunking people with flash bear Annie for an S+, and then seeing her win rate on the mode be 47% and being like... It's Annie, how are y'all fcking this up?","replies":[{"poster":"doiminat0r3600","date":"2017-02-13T00:23:59.411+0000","up_votes":1,"down_votes":0,"body":"I got mine for Eve on URF. Was glorious.","replies":[]}]},{"poster":"Spacesuit Spiff","date":"2017-02-12T21:21:50.878+0000","up_votes":1,"down_votes":0,"body":"This. If you game the rules S becomes absurdly easy. And there are a surprising number of champions that just get it really easily. Rammus jungle can almost feed and still get s-","replies":[]},{"poster":"doiminat0r3600","date":"2017-02-12T19:08:57.642+0000","up_votes":1,"down_votes":3,"body":"If you spam any champ enough, you might just get reported enough to get banned though. This happened to support singed a while back and even ADC teemos. You can't do this because it makes people toxic, which according to riot makes you toxic and then you get banned.","replies":[{"poster":"Mysticman89","date":"2017-02-12T20:01:10.584+0000","up_votes":1,"down_votes":0,"body":"As long as you are trying to win, and communicating with your team (and especially in normals), then you won't get in trouble or be banned. Occasionally teammates might get a bit toxic, but if you don't respond in kind (or y'know, at all) then you're fine. \n\nIf things are super janky and not just sorta not ideal but ok I guess, then maybe run it by your team in champ select first. Theres a lot of 'off-meta' or weird picks that are still fine, but they're just not top 5 in the current meta and hence off-meta. For example I've been doing a fair bit of kayle support recently, which is somewhat off-meta, but she is/was a popular support pick once upon a time, she's just somewhat outclassed in the role these days, so most people don't care. If I were to try to do something like master yi support on the other hand, that might not go over so well.","replies":[{"poster":"doiminat0r3600","date":"2017-02-12T20:25:48.860+0000","up_votes":1,"down_votes":0,"body":"I'm not saying to shove champions in a specific role ({{champion:164}} support or {{champion:40}} top/mid).\n\nI'm saying that if you play something like {{champion:60}} support or something that could work in a specific role but doesn't secure a win then you are more likely to get reported when it goes wrong.","replies":[{"poster":"Mysticman89","date":"2017-02-12T21:03:52.999+0000","up_votes":1,"down_votes":0,"body":"Which is fine, since getting reported has almost nothing to do with getting punished. Reports are reviewed (generally by automated stuff first, then by rioters), and if you were doing your best to make it work and communicating properly, then it wouldn't matter if everyone reported you. Reports just flag things for review, and if people got banned for getting reported then there probably wouldn't be very many players left (including rioters who you can be pretty confident are behaving themselves).","replies":[]}]}]}]}]},{"poster":"elon wątroba","date":"2017-02-13T07:42:21.881+0000","up_votes":1,"down_votes":0,"body":"It's not that hard in normals, you can get s with non-meta picks if you know what you are doing.","replies":[{"poster":"doiminat0r3600","date":"2017-02-13T20:48:22.119+0000","up_votes":1,"down_votes":0,"body":"Not saying it's hard. Just saying that if you don't play well, you get flamed by team mates and blamed for the loss. Not something I want to do.","replies":[]}]},{"poster":"TotalJerk","date":"2017-02-13T00:27:03.913+0000","up_votes":1,"down_votes":0,"body":"It's honestly not that hard; just farm a lot and don't die. You don't even have to win. The mistake people make is thinking they have to actually contribute to their team's chances of winning to get an S","replies":[{"poster":"doiminat0r3600","date":"2017-02-13T00:46:02.368+0000","up_votes":1,"down_votes":0,"body":"Well, generally speaking, kills and assists tend to mean a lot in ranking. If you end a game going 0/3/20 with 160 CS, you are less likely to get an S than someone who goes 4/1/17 with 100 CS","replies":[]}]}]},{"poster":"FakeGravity","date":"2017-02-12T18:10:34.442+0000","up_votes":3,"down_votes":0,"body":"basically is a snowball effects where every month you dont get four keys but you get four chests thats one more chest without key that mostlikely wont have a key ever, they point here is that riot never expect you to earn four chests a month every month making it so earning 3 keys will eventually be sufficient","replies":[{"poster":"Placentas","date":"2017-02-12T18:15:43.765+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FakeGravity,realm=NA,application-id=3ErqAdtq,discussion-id=7sQRvrUt,comment-id=000c,timestamp=2017-02-12T18:10:34.442+0000)\n>\n> basically is a snowball effects where every month you dont get four keys but you get four chests thats one more chest without key that mostlikely wont have a key ever, they point here is that riot never expect you to earn four chests a month every month making it so earning 3 keys will eventually be sufficient\n\nThat doesn't really happen (at least for me) until the end of season or I take a long break from league. Easy enough to acquire chests early on in the season.","replies":[]}]},{"poster":"jinxedchef","date":"2017-02-12T15:38:13.476+0000","up_votes":4,"down_votes":1,"body":"The percentage chance to get a key fragment goes down after each one you get, but gets reset each month.  Playing in a premade raises your chances to get a key fragment(I have no idea why they choose to do this).   At the beginning of the reset you have an 80% chance for the first one down to about 7% chance for the 12th one(if you are playing alone).   So playing alone it will take you about **84 WINS** to get 12 key fragments on average.  With a 50% win rate that is 168 games over a month or about 5.6 games a day.   So yeah that is a lot. \n\nIf you played only in 5 man premades you could get that down to an average of 76 wins.","replies":[{"poster":"Cabruh","date":"2017-02-12T18:31:03.500+0000","up_votes":1,"down_votes":0,"body":"Where did you get the percent rates? Just wondering if a Rioter posted it.","replies":[{"poster":"jinxedchef","date":"2017-02-12T20:07:52.228+0000","up_votes":1,"down_votes":0,"body":"It was posted on reddit.  But not by a Rioter, I can't remember how they said they got it.  Plus it was from back in April so honestly they might have changed it some what since then.   The formula was (.8 + 0.02x)/y  where x=number of people you are premade with and y is number key fragments you have gotten since the reset.  So if you are solo, first win has an 80% chance as does the second then it goes down to 40%.","replies":[]}]}]},{"poster":"Lord Galvatron","date":"2017-02-13T03:52:48.198+0000","up_votes":2,"down_votes":0,"body":"Riots technically telling the truth. You can get that many keys in that time period. However, you have to play a TON for that to happen. I had a month where that happened to me.","replies":[]},{"poster":"Sohleks","date":"2017-02-12T22:35:12.425+0000","up_votes":2,"down_votes":0,"body":"Actually I recorded my key drop rates for about 7 months last year when I played.\n\nIt can take anywhere from just 36 **wins** to 58+ to get all 12. I played mostly solo.\n\nIf you play aram more the drop rate can be very very bad after the first 6. The first six fragments are usually gotten by 10-18 wins. One time I went 16 **wins** when I was supposed to get a key drop, without getting one. I was actually expecting the rng failsafe to be more generous. It was only the 9th ish key too.\n\nSo yeah the drop rate is baaaad if you want 3 to 4 boxes a month.\n\nSo you need to play like 3 games a day for 28 days to get four keys assuming 50% winrate.","replies":[]},{"poster":"Raoul","date":"2017-02-12T20:09:55.052+0000","up_votes":2,"down_votes":0,"body":"Well, its also possible to win the lottery 4 times in a row...","replies":[]},{"poster":"Couffe","date":"2017-02-12T17:15:24.506+0000","up_votes":2,"down_votes":0,"body":"7 Chests and one key fragment....","replies":[]},{"poster":"Ultîma","date":"2017-02-12T16:23:23.615+0000","up_votes":2,"down_votes":0,"body":"Jokes on you, whenever I get enough keys to open a chest it only gives me champion shards.\n\nI own every champion.","replies":[{"poster":"Cabruh","date":"2017-02-12T18:36:12.617+0000","up_votes":1,"down_votes":0,"body":"Last time I opened 4 boxes, I got 4 champ shards and a gemstone. Then I unlocked the gemstone and got another champ shard. Feelsbad.","replies":[]}]},{"poster":"Trash MammaI","date":"2017-02-12T14:21:34.696+0000","up_votes":2,"down_votes":0,"body":"It was a month and a half between my most recent key fragment and the one before that and that's with me spamming ranked games the entire time to get gold. \n\nI was playing multiple champs and getting tons of S ranks..still didn't get any till one day the lord and savior urgod got me one","replies":[]},{"poster":"I am Pacman","date":"2017-02-13T01:38:37.216+0000","up_votes":2,"down_votes":1,"body":"Honestly people need to stop bitching about this.  \n\nThere are clearly people on both sides, too many keys or too many chests depending on how you play the game and how often.  They aren't going to increase the drop rate of either because that would be stupid and just increase the problem for the other side. Also Riot is giving people skins for free. Literally for free. I paid zero rp for the boss veigar skin or my mighty jax skin or my astronaut teemo skin. They are not going to increase the rate at which they give away their main source of revenue for free, they are a business not a charity.","replies":[{"poster":"Cabruh","date":"2017-02-13T04:05:12.859+0000","up_votes":1,"down_votes":0,"body":"I am complaining because Riot themselves is telling us we \"should\" be able to unlock all the free content (chests) we get. However, it is obviously not the case.\nThere shouldn't be a gimmick to hextech crafting if they made a post explaining that you can unlock every chest you get for free.","replies":[]}]},{"poster":"aj2493","date":"2017-02-13T15:37:50.303+0000","up_votes":1,"down_votes":0,"body":"i don't have a problem as a support main","replies":[]},{"poster":"SirΤeemο","date":"2017-02-13T08:52:25.333+0000","up_votes":1,"down_votes":0,"body":"i get all the keys within 2-3 days ... i actually think we should be able to get infinite keys... and maybe limited chests","replies":[]},{"poster":"elon wątroba","date":"2017-02-13T07:40:20.492+0000","up_votes":1,"down_votes":0,"body":"I am sitting on 13 chests.","replies":[]},{"poster":"Epicanian","date":"2017-02-13T04:19:02.658+0000","up_votes":1,"down_votes":0,"body":"am i the only one who gets a ton of keys? Last season I once had 9 keys and no chests.\n9 _keys_,  not key fragments. Some people have too many keys, some people have too many chests. It just depends on how much you play and how big your champion pool is.\nHonestly I don't think there's any reason to complain about a system that gives you what normally costs RP for free","replies":[]}]}