{"poster":"Kirschkern","date":"2020-01-24T07:21:27.182+0000","title":"[TGSG] Freudentag die zweite ...","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":0,"body":"... Geliebte F5 Taste die du mir den falschen Reiter aktualisiert hast. Fall bitte einfach tot aus der Tastatur raus -.-\r\n\r\nHabt ihr gestern auch League of Runeterra gestartet? Martin? Nana? Stephan? °^° Ich hab euch gesehen! XD\r\n\r\nIch war actually noch dezent am Arsch vom Mittwochs-ARAM-Abend mit Captain und bin gestern auch erst um kurz vor Mitternacht bei Runeterra raus gekommen >.&lt; ich musste ja alle Einführungen durchspielen und eine Expedition zum Test starten.\r\n\r\nGegen die Ki zu spielen scheint in Ordnung zu sein I guess. Aber gegen den ersten Menschen gestern habe ich dann doch verloren. Irgendwie haben sich seine Karten immer weiter gebufft und wenn ich dachte ich kann da was zerstören wurde entweder meine Karte getötet oder wenigstens wir beide haben die Karte verloren. Nur krieg ich dann meistens noch DMG am Nexus während dem Gegner gar nichts passiert. Versteh ich nicht! Da stand auch nichts a la \"Wenn ich sterbe verursache ich 2 Schaden am Nexus!\" DIE KARTE BESITZE ICH NÄMLICH! HAAAAA!\r\n\r\nMir gefallen halt die Animationen super gut. Zwar kenne ich das Spiel seit Tag X - seit die Welt, also Maxim, es zum aller ersten Mal streamen durfte ... Aber auf dem eigenen Bildschirm ist es dann doch etwas epischer :D\r\n\r\nAuf der anderen Seite ist es auch so ein gefühltes AFK sein Spiel wie TFT °-° Aber auch so Brainlaggy wie Candy Crush und da kann man schon mal viele Stunden verbringen ... hab ich gehört. Da ich manche Sachen einfach noch nicht verstehen will, wird es wohl noch eine Zeit dauern bis LoR und ich warm miteinander werden .-. \r\n\r\nAber jetzt gilt es erst einmal die restlichen fünf Stunden zu überleben. Insofern wäre Ziel #2 das Schläfchen im Zug und #3 Schläfchen Zuhause mit Rockybaby! Danach muss eingekauft werden .-.\r\n\r\nUnd jetzt auf ihr kleinen Vöglein! Wärmt eure Flügelchen auf damit ihr sicher ins Wochenende starten könnte :o \\o/ xD","replies":[{"poster":"INoKami","date":"2020-01-24T16:34:07.411+0000","up_votes":1,"down_votes":0,"body":"**[Der TGSG-Blog] Geschichten eines Azubis, Tag 285, Abendausgabe**\n\nMan stellt sich ja schon auf einiges ein, wenn die S-Bahn schon auf der Hinfahrt Verspätung hat. Deswegen überrascht es mich umso mehr, dass ich pünktlich die U-Bahn erwischt habe und das problemlos! Soll es auch geben...\n\nMatheunterricht war lustig heute, denn erstens hat keiner aufgepasst (welch Überraschung), vor allem, weil der Lehrer meinte, in der hoffentlich letzten Mathestunde meines Lebens nochmal ein komplett neues Thema anfangen zu müssen. Und zweitens, weil im nach gut 70 von 90 Minuten Unterricht aufgefallen ist, dass niemand aufpasst und deswegen einfach vorzeitig selber den Unterricht beendet hat. Wir waren erstaunt, aber ziemlich erfreut.\nUnd dieser Trend sollte sich seltsamerweise durch den Tag fortführen, denn alle Lehrer heute machten zumindest einige Minuten vor regulärem Unterrichtsende schon Schluss, was uns jeweils bisschen mehr Pause einbrachte.\n\nUnd anhand des Fakts, dass der Blog jetzt schon da ist, kann man erahnen, dass die Schlittschuhlaufen-Geschichte nichts geworden ist. Wieder mal vornehmlich zwei Gründe: erstens, weil die Halle, die wir uns ausgesucht hatten, bescheuerte Öffnungszeiten hat (wir hätten im besten Fall eine halbe Stunde Laufzeit gehabt und hätten dann bis 20:00 Uhr warten müssen...) zweitens, weil doch einige Leute mitkommen wollten, mit denen ich mich jetzt nicht unbedingt nicht verstehe, aber bei welchen ich auch nicht so erpicht darauf bin, mit ihnen meine Freizeit verbringen zu wollen.\nAber die Idee ist noch nicht begraben, alleine schon, weil ich mir überlegt habe, mit \"Sie 2\" Schlittschuhlaufen zu gehen. Und dann werden es nur wir beide sein.\n\nIn diesem Sinne: Schönes Wochenende euch!","replies":[]},{"poster":"HeisserKakao66","date":"2020-01-24T09:32:25.682+0000","up_votes":1,"down_votes":0,"body":"Goldpromo gestern in der SoloQ erreicht. Das wird dieses Jahr ja ein richtiger Struggle zu climben ^^\n\nLoR werde ich wohl nie spielen, League und ab und zu AoE 2 DE reicht mir vollkommen auf dem PC :3","replies":[{"poster":"Kirschkern","date":"2020-01-24T10:05:54.735+0000","up_votes":1,"down_votes":0,"body":"Actually dürfte es nur jetzt Climb-Struggles geben. Wenn sich alles erst einmal wahrhaftig in ein bis drei Monaten eingependelt hat, sollte alles wieder fine sein °-°\n\nDu wirst LoR spielen \\o/ Es gibt wirklich hübsche Animationen!","replies":[{"poster":"HeisserKakao66","date":"2020-01-24T12:39:15.691+0000","up_votes":1,"down_votes":0,"body":"> Actually dürfte es nur jetzt Climb-Struggles geben. \n\nIch spiele auch mit einem Premade und der spielt alles andere als konstant. Gestern war er in einem Spiel in so einem Griefing-Mode, dass er jedes mal einfach nur rein ging und gestorben ist^^\n\n\n\n> Du wirst LoR spielen \\o/ Es gibt wirklich hübsche Animationen!\n\nIch will es nicht ausschliessen, aber es ist eher unwahrscheinlich, dass dies passieren wird.","replies":[]},{"poster":"Xayah Strife","date":"2020-01-24T10:12:30.930+0000","up_votes":1,"down_votes":0,"body":"Du kannst auf Poro klicken und das streckt dann seine Zunge raus. ^^","replies":[]}]},{"poster":"Uranbrennstab","date":"2020-01-24T09:35:19.848+0000","up_votes":1,"down_votes":0,"body":"Schön Rangliste kloppen? Spielst zu Zufall, oder hast du ne fav. Civ?","replies":[{"poster":"HeisserKakao66","date":"2020-01-24T09:44:14.538+0000","up_votes":1,"down_votes":0,"body":"Nein Rangliste spiele ich nicht (noch nicht). Ich bin, seit ich es im November gekauft habe, noch daran alle Kampagnen am durchspielen. Wenn dann schaue ich mir auf Youtube Ranglistenspiele von Viper an. Eine Fav Civ habe ich nicht, aber früher  als das Spiel herauskam, waren es einmal die Franken, weil ich die Axtwerfer und die Paladine so mochte :3. Seit ich das Spiel im November gekauft habe, hatte es aber soviele neue Civs, dass ich gar noch nicht alles ausprobieren konnte ^^","replies":[{"poster":"Uranbrennstab","date":"2020-01-24T10:17:41.594+0000","up_votes":1,"down_votes":0,"body":"Franken sind eine super Start Civ. Ritter Spam und mit axwerfer gegen Piken schützen. Sehr solide Taktik","replies":[{"poster":"HeisserKakao66","date":"2020-01-24T12:30:39.892+0000","up_votes":1,"down_votes":0,"body":"Hast du die neuste Version denn auch und spielst du da Ranked?","replies":[]}]}]}]}]},{"poster":"Nanary","date":"2020-01-24T10:21:22.268+0000","up_votes":1,"down_votes":0,"body":"Guten Morgen\n\nzu LoR: ich dachte man soll nicht die möglichkeiten haben sich Karten zu kaufen? kommt bei mir wieder mal so ein leichtes P2W rüber aber gut.\nDie Animationen und Zeichnungen finde ich sehr sehr Schön, Senne zb sieht so hübsch aus ^^\nmehr kann ich nicht zu sagen hab die einführung jetzt Fertig, aber das meiste kenne ich ja schon von anderen Games dieser Art\n\nach die Fiora Karte liest sich Lustig ;)\n\nzu League selbst: will gerne Champs üben funzt aber sehr schwer im Normal kann schon verstehen das die meisten ihre sachen im Rank testen xD","replies":[{"poster":"Kirschkern","date":"2020-01-24T10:39:02.909+0000","up_votes":1,"down_votes":0,"body":"Doch, Karten bzw. Decks können immer erweitert werden.\n\nMan muss auch kein Geld investieren .-. dafür hat man ja diese Fortschritte und damit einhergehenden Belohnungen. Bei der Einführung bekommt man ja auch schon Wild Cards die man dann einlösen kann. Normale, Epic usw. Dadurch bekommt man auch die Märkchendinger für Expeditionen. \n\nIm Prinzip ist es wie in jedem anderen Spiel auch welches die Möglichkeit bietet ohne Echtgeld an irgendwas ran zu kommen: Es dauert einfach nur etwas länger. Dafür finde ich allerdings gibt es tatsächlich eine zwar kleine aber doch hübsche Auswahl an Icons. ich hab sogar gesehen das man Maps ändern kann :o und seinen Begleiter. Gut, dass war klar wegen dem Luna Poro. Aber trotzdem xp Aber das ist kosmetischer Kram und da wäre Echtgeld nur verständlich.\n\nIch kenne nur Hearthstone neben LoR x.x Und da WoW eh eines der hässlichsten Spiele der Menschheit ist, sieht Hearthstone auch entsprechend aus und allein der grafische Unterschied würde mich bei LoR reizen °-° Außerdem nervt es mich das ich derzeit noch nicht alles verstehe und muss daher lernen .-.\n\nUnd ja. Sachen im Ranked testen ist wirklich empfehlenswert. Vorzugswese Flex weil die zwar wertlos aber zumindest halb-seriös ist.\n\nAnsonsten versuch es mit schweren Bots? °-°","replies":[{"poster":"Nanary","date":"2020-01-24T10:55:11.253+0000","up_votes":1,"down_votes":0,"body":"Aye! hab mir auch schon gedacht das ich Flex nutze um mal weg von Nami &amp; Soraka zu kommen xD \n\nNaja ich bin halt nicht der Fan von Karten ig kaufen :/ \nIch verstehe auch was du meinst mit \"man bekommt ja mit der zeit auch Punkte zum Craften oder Karten von Quest's\" aber ich weiß von genug anderen Games das es Leute gibt sie sich jede woche alle ihre Booster mit echtgeld kaufen und so schon recht mehr Karten haben als Ich &amp; oder sehr viel besser/schneller die Meta nachbauen können, was alles im PvP wieder schwerer macht. D:\n\nhab eig gedacht das sie nur Gimmick zeug Verkaufen ._.","replies":[{"poster":"Kirschkern","date":"2020-01-24T11:05:07.024+0000","up_votes":1,"down_votes":0,"body":"Aber Nami und Soraka haben doch zur Zeit eine gute Winrate. Zumindest Nami. Aber Soraka ist eigentlich auch immer eine Option. :D Und wenn du was anderes testen willst dann ab in die Flex-Q! Da spiele ich z.B. eher Zyra und Lux °-° Weil ich beide noch auf Lv 7 bringen muss und für SoloQ mich nicht stark genug auf ihnen fühle. Da hab ich meine Main Picks.\n\nSo den Shop an sich finde ich noch etwas unübersichtlich bzw. alles gewöhnungsbedürftig irgendwie. Oder es lag an dem Fullscreen xp","replies":[{"poster":"Xayah Strife","date":"2020-01-24T12:38:19.180+0000","up_votes":1,"down_votes":0,"body":"Nami und Leona mehr brauchst du nicht. ^^\nVllt noch Brand damit was gutes für Ashe hast.","replies":[]}]}]}]},{"poster":"Xayah Strife","date":"2020-01-24T10:28:41.846+0000","up_votes":1,"down_votes":0,"body":"Wieso?\nOtp Nami ist doch fine. ^^","replies":[{"poster":"Nanary","date":"2020-01-24T10:36:46.021+0000","up_votes":1,"down_votes":0,"body":"aha :)","replies":[{"poster":"Xayah Strife","date":"2020-01-24T11:26:27.704+0000","up_votes":1,"down_votes":0,"body":"Ich finde Nami wirklich gut. ^^","replies":[]}]}]}]},{"poster":"Kirschkern","date":"2020-01-24T10:08:40.014+0000","up_votes":1,"down_votes":0,"body":"Hungeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeerrrrrrrrrrrrrrrr","replies":[{"poster":"Uranbrennstab","date":"2020-01-24T10:16:43.411+0000","up_votes":1,"down_votes":0,"body":"Dann iss doch was!","replies":[{"poster":"Kirschkern","date":"2020-01-24T10:42:26.651+0000","up_votes":1,"down_votes":0,"body":"Nicht witzig!\n\nFreitags gibt es kein Mittagessen! Und Frühstück (zwei Scheiben Toast) sind schon weg. Hatte keine Lust mehr Tomaten zu schneiden ... geschweige den Mozzarella. Mach ich mich Zuhause lieber ein feines Omelette in Ruhe! Ich kann es kaum erwarten >.&lt;\n\nGestern Abend hab ich auch nur noch Tomaten klein geschnitten + Mozzarella = in eine Schüssel geworfen = Backofen 200° für ein paar Minuten. Warmer/ Angeschmolzener Mozzarella einfach nur mit Salz und Zitronenpfeffer ist göttlich °^°","replies":[{"poster":"Uranbrennstab","date":"2020-01-24T10:52:13.486+0000","up_votes":1,"down_votes":0,"body":"Hm... Ja Mozzarella hatte ich auch gestern. Aber über Hähnchenfilet. Das war auch sehr lecker.","replies":[{"poster":"Kirschkern","date":"2020-01-24T11:22:58.869+0000","up_votes":1,"down_votes":0,"body":":o Ohja!\n\nHähnchenfilet + Tomatenscheiben drauf + Mozzarella drauf = überbacken! °-°\n\nP.S\nXD Aber über so ein Omelett geht trotzdem nichts ","replies":[{"poster":"Uranbrennstab","date":"2020-01-24T11:52:13.432+0000","up_votes":1,"down_votes":0,"body":"Leider verträgt die Freundin meines Bruders keine große Mengen AN Eiern... Tja, machste nix","replies":[]}]}]}]}]},{"poster":"Hanaguma","date":"2020-01-24T10:12:32.712+0000","up_votes":1,"down_votes":0,"body":"Müüüüüüüüüüüüdeeeeee","replies":[]}]},{"poster":"Xayah Strife","date":"2020-01-24T08:34:50.503+0000","up_votes":1,"down_votes":0,"body":"Was machen die btw mit Akali?\nDie Änderungen auf dem PBE sehen ziemlich hart aus...","replies":[{"poster":"Kirschkern","date":"2020-01-24T08:53:01.581+0000","up_votes":1,"down_votes":0,"body":"D: Ja das sieht böse aus. Hoffentlich lassen sie ihr wenigstens ihr Movementspeed!","replies":[{"poster":"00 M4ddin 00","date":"2020-01-24T08:55:16.815+0000","up_votes":1,"down_votes":0,"body":"Hoffe so sehr das die in der pro Liga weiter gepickt wird und gut abschneidet damit noch mehr nerfs kommen.\n\nBis sie irgendwann wie beim LB rework zurück rudern und die alte akali wieder da ist :)","replies":[{"poster":"Kirschkern","date":"2020-01-24T09:16:45.025+0000","up_votes":1,"down_votes":0,"body":"Oh man, ja!\n\nIch vermisse die alte Akali auch richtig hart :( Das ist wie mit Irelia ...\n\nRito hat mich mit Akali und Irelia so lange in ARAMs bombardiert bis ich mich erweichen lassen und begonnen habe beide zu spielen. Nur durch ARAMs hab ich beide auf Lv 5 gespielt und hatte sogar richtig Spaß mit ihnen °^° Gab sogar Akali Pentas. Das mag für niemanden etwas besonderes sein D: aber für mich schon! Also Ruhe da!!!!\n\nUnd plötzlich nimmt sie dir weg. Beide. \n\nIch war so traurig das ich die neue Irelia bisher nur vielleicht zweimal gespielt habe und bis dato noch **NIE** die neue Akali (glaube ich xD) v.v pff","replies":[{"poster":"00 M4ddin 00","date":"2020-01-24T09:56:07.589+0000","up_votes":1,"down_votes":0,"body":"Ich weiß was du meinst :( \n\nHab damals akali gemaint und hab mich mit ihr super sicher in jeden Match up gefühlt. \nIch hab sogar gegen zed gespielt und war sicher ich Gewinne das schon :( \n\nUnd dann wird sie mir weg genommen :(","replies":[]}]},{"poster":"CptPICHU","date":"2020-01-24T08:56:51.812+0000","up_votes":1,"down_votes":0,"body":"To be honest, ich mochte die alte Akali.\nVorallem weil die neue hart nervt beim Ganken. :3\n{{sticker:sg-janna}}","replies":[{"poster":"00 M4ddin 00","date":"2020-01-24T09:53:44.868+0000","up_votes":1,"down_votes":0,"body":"Und die alte war flexibler ! \nMitte, top und jungel waren alles kein Problem :/ Und sie hatte mehr Counterplay für die gegner :/ \n\nSie war so toll","replies":[]}]}]},{"poster":"Xayah Strife","date":"2020-01-24T09:09:56.316+0000","up_votes":1,"down_votes":0,"body":"Die Alte wurde reworked weil sie eine Point&amp;Klick Ulti hatte und damit kein richtigen Escape weil das ging nur auf Champions. \nUnd jetzt soll die Ulti wieder ein Spell sein der auf Champions gewirkt wird? \n{{sticker:sg-zephyr}}","replies":[{"poster":"Kirschkern","date":"2020-01-24T09:18:12.197+0000","up_votes":1,"down_votes":0,"body":"Ich dachte du meinst wenigstens das mit der Shroud :o\n\nWenn Akali in der Wolke cc'd wird, bleibt sie solange sichtbar wie der cc dauert .-. rip kleine Maus","replies":[{"poster":"Xayah Strife","date":"2020-01-24T09:26:42.368+0000","up_votes":1,"down_votes":0,"body":"Ach scheiß auf die Wolke.\nDas hat mich eh am meisten aufregt.\nVon all ihren alten Spells behält sie ausgerechnet diese komische Pupswolke. :((\nIch hätte lieber Q und W behalten.","replies":[{"poster":"Kirschkern","date":"2020-01-24T09:33:00.080+0000","up_votes":1,"down_votes":0,"body":"Bis gerade hatte ich sogar vergessen das sie die Wolke schon vorher hatte XD Und was Q und W waren ... ich erinnere mich nicht!\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Xayah Strife","date":"2020-01-24T09:36:17.128+0000","up_votes":1,"down_votes":0,"body":"Q war ein Point&amp;Klick Spell wo sie eine Shuriken auf das Ziel wirft. \nW war eine AOE Meelewirbelwind ähnlich wie bei Zed\nE  war die Wolke die kein Lock hatte wie später auch dazu Dient auf CDs zu warten\nR war ein Point&amp;Klick Dash mit Aufladungen welche nur auf Champions ging wenn ich das richtig im Kopf hatte \n\nEs könnte sein das die Wolke auch W war und E der AOE. \n\nPassive war.\n1. AA macht mehr dmg\n2. Healt ein wenig\ndanach hat das kurz CD","replies":[]}]}]}]}]}]}]},{"poster":"CptPICHU","date":"2020-01-24T08:43:59.790+0000","up_votes":1,"down_votes":0,"body":"Hab LoR einfach noch nicht gespielt. ^^'\n\nDurchschnittliche Schlafdauer diese Woche: 4 Stunden B)","replies":[{"poster":"Kirschkern","date":"2020-01-24T08:52:28.165+0000","up_votes":1,"down_votes":0,"body":":o Ich lag jede Nacht zwischen 04 Stunden und 50 Minuten oder 05 Stunden und 05 Minuten ... Mein Wecker mobbt mich immer mit der genauen Zeitangabe beim Wecker einschalten >.&lt;","replies":[{"poster":"00 M4ddin 00","date":"2020-01-24T08:54:14.027+0000","up_votes":1,"down_votes":0,"body":"Meiner auch :(","replies":[{"poster":"Kirschkern","date":"2020-01-24T08:55:55.507+0000","up_votes":1,"down_votes":0,"body":"Viel zu brutal!\n{{sticker:sg-soraka}}","replies":[{"poster":"00 M4ddin 00","date":"2020-01-24T09:52:43.548+0000","up_votes":1,"down_votes":0,"body":"Jaaaa :( \nIch bin morgens immer traumatisiert davon :/","replies":[]}]}]}]}]},{"poster":"CptPICHU","date":"2020-01-24T07:34:58.267+0000","up_votes":1,"down_votes":0,"body":"_springt und kuschelt die Couch_\n\nDa bin ich auch mal wieder. Geniales Wochenende wünsch ich! &lt;3\n\nDas mit LoR klingt ja cool. Ich sollte mir das echt mal anschauen! ;-;\n\nHat noch jemand das Problem, heute Nacht extrem wenig gepennt zu haben? ._.","replies":[{"poster":"00 M4ddin 00","date":"2020-01-24T08:01:56.859+0000","up_votes":1,"down_votes":0,"body":"Heute Nacht? \n\nDu meinst jede Nacht :D ich pennen immer zu wenig :(","replies":[{"poster":"Kirschkern","date":"2020-01-24T08:04:39.396+0000","up_votes":1,"down_votes":0,"body":"x.x Fallen dir dann auch immer die Augen zu?\n\nIch wollte gerade irgendwas schreiben, da zuckt plötzlich mein Kopf so nach vorne als würde er fallen XD Ich mach die Augen auf und hab erst mal drölf Milliarden H's im Kommentarfeld :(","replies":[{"poster":"00 M4ddin 00","date":"2020-01-24T09:48:44.160+0000","up_votes":1,"down_votes":0,"body":"Leider nicht :/ steh ja die meiste Zeit bzw muss durch die Gegend laufen :/ das Schlaf ich zumindestens nicht ein ^^'","replies":[]}]}]},{"poster":"ITSHII","date":"2020-01-24T09:15:57.647+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CptPICHU,realm=EUW,application-id=YnZkMR0R,discussion-id=FFEmhovl,comment-id=0000,timestamp=2020-01-24T07:34:58.267+0000)\n>\n\n> Hat noch jemand das Problem, heute Nacht extrem wenig gepennt zu haben? ._.\n\nich habe komischer weise voll lang gepennt. ich bin um halb 7 eingepennt und heute morgen um 6 wieder aufgestanden. bin dafür aber mal um 3 aufgewacht und konnte nicht einschlafen weil es viel zu heiß war...\n{{sticker:slayer-jinx-unamused}}","replies":[]}]},{"poster":"G2 Slippi","date":"2020-01-24T09:04:16.922+0000","up_votes":1,"down_votes":0,"body":"Ja nachdem ich wieder nur gegen Nasus und so nen Rotz in League spielen musste, hab ich es dann aufgegeben und hab dann LoR gestartet :)\nZuerst war alles auf Englisch und ich dachte nur: Geil, wie soll ich denn das Spiel lernen wenn ich das Meiste nicht verstehe?\nIch hab dann verzweifelt nach ner Möglichkeit gesucht, das Spiel auf Deutsch umzustellen, hab aber nix gefunden. Also das Tutorial auf Englisch durchgespielt und bin jetzt genau so schlau wie vor dem Tutorial, weil ich einfach nichts verstanden hab.\nDann hab ich versucht 5 mal den Client neu zu starten, damit ich mich eventuell neu einloggen und da die Sprache ändern kann - vergebens...\nIrgendwann hab ich dann den Leagueclient geschlossen und auch den LoR Client und als ich den LoR Client wieder gestartet habe konnte ich mich endlich neu einloggen und die Sprache ändern. Danach hab ich noch drei Runden gegen die KI gespielt und die ersten beiden Spiele einfach komplett auf die Schnauze bekommen. Ich hab die ganze Zeit nur so Noobkarten bekommen und wenn ich eine ausgespielt habe wurde sie im nächsten Zug sofort eliminiert. Ich hab so gut wie nie ordentliche Spielzüge zusammen bekommen, während dessen der Gegner (ja es waren KI's) immer die übelsten Kombos raus gehauen hat, was aber bei den Karten die ich bekommen habe nicht möglich war.\nDas dritte Game habe ich dann ganz knapp mit viel Glück gewonnen.\nKA aber die KI's scheinen schon recht OP zu sein","replies":[{"poster":"Kirschkern","date":"2020-01-24T09:13:24.287+0000","up_votes":1,"down_votes":0,"body":"XD Das hört sich ja abenteuerlich an.\n\nDu solltest alle Einführungen vielleicht nochmal auf deutsch durch spielen. Das sind neun (?) verschiedene Zusammenstellungen und alles wird einem erklärt. Wenn es vorher Sprachprobleme gab, sollte es ja jetzt funktionieren.\n\nAn sich wird auch alles gut erklärt, auch was Kombis usw. angeht. Aber manches verstehe ich einfach nicht XD zum Beispiel Elise ... Sogar wenn die Ki sie spielt scheint sie mega toll zu sein. Dann schaffe ich es sie zu entwickeln aber sie scheint nur halb so stark zu sein :&lt; obwohl meine anderen Spinnchen sie buffen!","replies":[{"poster":"G2 Slippi","date":"2020-01-24T09:23:36.949+0000","up_votes":1,"down_votes":0,"body":"Ja da war die Odyssey von Odysseus ein feuchter Furz gegen dieses Abenteuer xDDDD\n\nWerd ich am Besten wirklich nochmal machen ^^\n\nGenau das Problem hab ich mit Elise auch xD\nWenn die KI Elise spielen bekommen die immer mega Buffs und ich hab 6 Spinnen draußen aber sehe weit und breit keine Buffs xD \nIch hab echt schön langsam das Gefühl, Riot möchte nicht dass ich irgend ein Game von denen zocke ^^ In League kann ich nur ganz wenige Champs spielen, weil die meisten komplett verbugged sind bei mir (Beispiel: Gegnerischer Nasus läuft mit Ult in 5 Leute rein und macht nen Penta; Ich laufe als Nasus mit Ult in zwei Gegner rein und platze innerhalb von einer Sekunde weg; oder wenn ich Kha'Zix spiele bekomme ich NIEMALS den Isolationsschaden, KA warum).\nUnd jetzt habe ich genau das gleiche Problem auch in LoR ^^","replies":[{"poster":"Kirschkern","date":"2020-01-24T09:29:29.225+0000","up_votes":1,"down_votes":0,"body":"> Genau das Problem hab ich mit Elise auch xD\n\n:DDDDDDD HAAAAAA Wenigstens sind wir schon mal zwei mit dem Problem XD\n\nGenau wie diese 1-1 Spinnen ... Wenn ich eine 1-1 Spinne mit 3-4 angreife ... Müsste sie dann nicht das eine Leben verlieren und der Nexus zwei Schaden bekommen? Ich hab das gestern jedes Mal bekommen glaub ich °-° Aber die Ki nie. Dafür habe ich Ekelschlund beschworen \\o/\n\nAlso keine Ahnung warum, aber Elise macht mir bisher am meisten Spaß. Obwohl ich auch unbedingt mehr mit den Poros experimentieren muss XD","replies":[]}]}]}]}]}