{"poster":"Kirschkern","date":"2020-01-29T07:30:01.348+0000","title":"[TGSG] Das erste Mal °-°","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":0,"body":"Was soll ich sagen.\n\nDas alles ist etwas unerwartet passiert, aber insgeheim wusste ich: **EINES TAGES WIRD ES PASSIEREN!\"** Und das ist dann auch. Den Zeitpunkt möchte ich möglichst genau festhalten!\n\n#MITTWOCH, 29. JANUAR 2020 / 06:40 UHR\n\nWie bereits letzte Woche jeden Abend und die bisherigen überlebten Werktage, war ich auch gestern bis ziemlich genau Mitternacht wach. Also hyper spät schlafen. Heute Morgen war es bereits soweit das ich meinen Wecker um 04:50 Uhr nicht gehört habe. Erst um 05:09 Uhr bin ich wach geworden weil Rocky irgendwas neben meinem Kopfkissen veranstaltet hat. Kann sein das er unter die Decke wollte, ich sie aber immer fester um mich gezogen habe und er dann irgendwann angefangen hat zu meckern XD Das ist dann kein winseln oder knurren sondern einfach ein zickiges kurzes brummen. Hach ja &lt;3 diese Maus. Die Katzen lagen auch schon wieder so dicht vor der Türe und haben gewartet das ich fast über sie gestolpert wäre ô.ô Bewegen sich aber dann auch keinen Millimeter.\n\nDer erste Zug hatte nicht mal ganze fünf Minuten Verspätung so das ich am Bahnhof minimal noch etwas Ruhe hatte .-. Alles in einem wurde die erste Fahrt überlebt. Dank der kleinen Verspätung stand mein zweiter Zug am zweiten Bahnhof auch bereits im Gleis so das ich mich direkt auf mein Stammplätzchen setzen und einkuscheln konnte für mindestens 30 Minuten weiteren Schlaf.\n\nIrgendwann wache ich auf und stelle fest das ich, wie immer, vier Haltestellen zu früh wach geworden bin. Also werden die Augen wieder geschlossen. Beim nächsten kurzen wach werden höre ich die Durchsage mit Stopp an meiner Haltestelle und weiß \"Gut, 'ne Minute haste noch\". Mache die Augen zu, mache die Augen auf.\n\n#Okay?! Wo ist meine Haltestelle? °^° \n\nDa hatte ich wohl die Augen etwas länger als eine Minute geschlossen >.&lt; Vorteil: Ich kann mit dem Zug durchfahren zu einem Hauptbahnhof und sitzen bleiben weil der die gleiche Tour zurück fährt. Auf der anderen Seite war es sehr verlockend einfach wieder nach Hause zu fahren -.- Aber der Anstand ... Den Bus zur Arbeit habe ich dann gerade so noch bekommen und so ist es auch bei gewohnten 20 Minuten Verspätung geblieben.\n\nWas lernen wir daraus? \n\nGenau. Nichts. Wer müde ist, ist einfach müde. Sich vornehmen früher schlafen zu gehen funktioniert meistens eh nicht. Und ob ich um Mitternacht oder 21 Uhr im Bett liege. Pustekuchen. Aufstehen am nächsten Morgen ist grundsätzlich eine Qual und macht absolut keinen Unterschied vom Grad der Müdigkeit. Zu viel Schlaf macht es meist noch schlimmer. Also hoffen wir einfach das ich auf der Heimfahrt nicht wieder im Kreis fahre XD Natascha ist nämlich den Rest der Woche nicht da ... \n\nDer Grund für's späte schlafen gehen war übrigens die Netflixserie \"Sabrina\". Nach der Flaute in den ersten beiden Folgen hat es dann doch etwas Spaß gemacht und ich hab einfach immer weiter geguckt.\n\nBei Netflix habe ich derzeit sehr viele Alerts laufen bzgl. der Erinnerung über das Erscheinen neuer Serien/ Filme. Darunter auch \"Ghost Bride\" wenn ich mich richtig an den Titel erinnere. Vielleicht ist noch was dabei was man so der Allgemeinheit mal vorschlagen kann :o\n\nP.S.\nHabt einen schönen Wochenspaltungstag \\o/ und hier. Noch ein süßes GIF.\n\nhttps://media.tenor.com/images/f47e3b7d796852d891e3f06c6c664172/tenor.gif","replies":[{"poster":"GLaDOS 3","date":"2020-01-29T09:15:40.126+0000","up_votes":3,"down_votes":1,"body":"Mein erstes mal war mit 17","replies":[{"poster":"Kirschkern","date":"2020-01-29T09:20:55.206+0000","up_votes":1,"down_votes":0,"body":"Okay?","replies":[{"poster":"GLaDOS 3","date":"2020-01-29T09:30:19.736+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kirschkern,realm=EUW,application-id=YnZkMR0R,discussion-id=uT82TYA7,comment-id=00010000,timestamp=2020-01-29T09:20:55.206+0000)\n>\n> Okay?\n\nJa?","replies":[{"poster":"Kirschkern","date":"2020-01-29T09:36:36.956+0000","up_votes":1,"down_votes":0,"body":"Ich überlege noch wie ich das finden soll","replies":[{"poster":"GLaDOS 3","date":"2020-01-29T09:43:13.134+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kirschkern,realm=EUW,application-id=YnZkMR0R,discussion-id=uT82TYA7,comment-id=0001000000000000,timestamp=2020-01-29T09:36:36.956+0000)\n>\n> Ich überlege noch wie ich das finden soll\n\nAch, du brauchst darüber nicht viel nachdenken.Es gibt ja für alles ein erstes mal. lol","replies":[{"poster":"Kirschkern","date":"2020-01-29T09:47:15.310+0000","up_votes":2,"down_votes":0,"body":"XDDDD Naseweis.\n\nAber hier. Ich teile dafür meine Schogetten mit dir!","replies":[]}]}]}]}]}]},{"poster":"EzreallyTragic","date":"2020-01-30T12:54:30.429+0000","up_votes":1,"down_votes":0,"body":"Call me by your name ist jetzt auf netflix!\n\nUnd ghiblies kommen am samstag, ich spare mir die neue sabrina folge fürs wochenende auf :P","replies":[{"poster":"Kirschkern","date":"2020-01-30T13:18:33.691+0000","up_votes":1,"down_votes":0,"body":"mhm Für 'Call me by your name' habe ich mir auch eine Erinnerung gesetzt :o\n\nJa :D Unter dem Reiter \"Neustes\" sind bei den Filmen gefühlt nur Ghibli Filme °-° Manche habe ich tatsächlich nicht gesehen. Bei so was wünsche ich mir immer Netflix wäre besser organisiert/ aufgeteilt. Vor allem wünsche ich mir das gesehene Sachen einfach verschwinden und in eine Art \"Nochmal ansehen\" Box verschwinden XD Nach einiger Zeit weiß ich einfach nicht mehr was ich schon gesehen habe und was nicht ._. Ich mein .. solche Sachen werden nicht mal aus gegraut D:","replies":[]}]},{"poster":"INoKami","date":"2020-01-29T17:39:38.688+0000","up_votes":1,"down_votes":0,"body":"**[Der TGSG-Blog] Geschichten eines Azubis, Tag 288, katastrophal späte Abendausgabe**\n\nHat schon irgendwie was amüsantes, wenn man seinen sonst eher trägen Partner beim Arbeiten zuschauen darf, während man selber ein paar Bechergläser putzt und sich mit anderen über Konsolen und deren Spiele aus der Kindheit redet. Gut, ganz so einfach war es dann doch nicht, spätestens, als ich meine Glasfiltertiegel reinigen musste (die hab ich sicher irgendwann mal erwähnt) und die sich partout nicht reinigen lassen wollten. Also entweder waren die schon sauber, was ich aber immer noch nicht hinnehmen kann, weil ich mich meine, deutlich daran erinnern zu können, dass ich sie noch putzen musste und es ständig verschoben habe oder aber die Verunreinigungen sitzen bombenfest. Und ich kann wirklich behaupten, alles aufgefahren zu haben, was das Labor an (chemischen) Reinigungsmitteln bereithält: konz. Salzsäure, konz. Ammoniak, gesättigte Ascorbinsäurelsg. und sogar konz. Salpetersäure (die mir ein paar gelbe Flecken auf der Haut beschert hat. Ich sage einfach, es ist ein Produktivitätsnachweis), aber nichts rührte sich. Also gab ich irgendwann auf, reinigte den Rest und gab ab. Natürlich lief das nicht ganz problemlos, denn ich darf noch mein Titrierküken von Fett befreien und das ist echt eine undankbare Aufgabe. Mal schauen, wann ich die mache...\nMein Partner hat zu meiner Überraschung tatsächlich einiges hinbekommen heute, aber natürlich nicht ohne Schnitzer: bei einer Analyse hat er vergessen, die Elektrode mit einzubauen. Heißt, er musste Nachsubstanz holen, heißt eine Note schlechter für diesen speziellen Versuch, an dem ich 150% unbeteiligt war.\n\nAm Nachmittag dann das große Nacharbeiten und auch das verlief zu meinem Erstaunen produktiv ab. Wir haben die restlichen Werte für meinen Partner bekommen und von meinen haben wir auch schon den Großteil. Kann zwar nochmal eng werden, weil einer der Werte auch etwas anstrengend ist, aber ich bin vorsichtig optimistisch...","replies":[]},{"poster":"Kirschkern","date":"2020-01-29T14:42:27.130+0000","up_votes":1,"down_votes":0,"body":"Das Pferd kann mit ein paar wenigen Worten und nur ihrer Stimmfarbe so eine Aggressionswelle in mir auslösen, dass ich am liebsten mindestens zwei meiner vier Ordner gegen ihren Kopf knallen möchte XD \n\nJetzt hab ich auch keinen Bock mehr auf irgendwas :&lt;","replies":[]},{"poster":"Headcoach","date":"2020-01-29T14:24:17.642+0000","up_votes":1,"down_votes":0,"body":"Genug getan für Heute, ab in den Feierabend um 15:30 Uhr.\n\nDer FREITAG ist fast DA. Ich bin soooooooooooooooooooooooooooooooooooooooooooooo happy","replies":[{"poster":"Kirschkern","date":"2020-01-29T14:31:43.446+0000","up_votes":1,"down_votes":0,"body":"Irgendwie bin ich morgen schon bei Freitag :((((","replies":[]}]},{"poster":"00 M4ddin 00","date":"2020-01-29T09:18:45.856+0000","up_votes":1,"down_votes":0,"body":"Guten morgen \n\nSo nach 4 stunden Stand zeit und Reparaturen geht meine Arbeit auch wieder also Sitz ich hier und schreib etwas ^^\n\nIch versuch jeden tag früh ins Bett zu gehen aber es schwankt immer zwischen 0 und 2 Uhr :(\n\nSobald ich im bett liege bin ich nicht mehr müde .... Und dann wird das Handy genommen YT oder Porn geschaut und schon dauerte noch länger bis ich schlafen kann -.- Teufelskreis... müde bin ich also jeden tag ^^ \n\n-------\n\nZu netflix \n\nAlso was ich empfehlen kann schau dir the Irishman an der ist gut :) aber nehm dir zeit für den film ^^\n\nUnd falls er noch da ist Birdman der ist auch richtig gut der film :) \n\nUnd bald kommt die neue Staffel Bojack Horstman ^^ da freu ich mich sehr drauf.\n\nLove,Death &amp; Robots \nIst auch richtig richtig gut das kannst du dir auch anschauen :0 \n\nUnd bald natürlich die ganzen Ghiblih Filme :3 \n\nZu Sabrina \nJa die erste Staffel war cool. Aber leider scheint es in der zweiten Staffel mehr und diesen schmierigen Lappen typen zu gehen und da hab ich mal echt keinen Bock drauf. Schade um die serie ...\n\n---------\n\nGestern ein Flex game gemacht und gewonnen. Bin nur bei 97lp also bald Promo zu Silber 2 ^^ \n\n67%wr nice viel besser als in SoloQ.... \nMal schauen ob ich das halten kann oder ob das Spiel mich wieder bestraft weil ich mich gefreut hab :D \n\nNaja Wünsch euch einen schönen Mittwoch :)","replies":[{"poster":"Xayah Strife","date":"2020-01-29T14:29:04.171+0000","up_votes":1,"down_votes":0,"body":"Warum schaust du eine Mädchenserie?","replies":[]},{"poster":"Kirschkern","date":"2020-01-29T09:45:43.092+0000","up_votes":1,"down_votes":0,"body":"> Love,Death &amp; Robots\n\nHab ich schon mal gelesen. Aber da ist es das gleiche wie mit 'Sexeducation' und dieser Ted Bundy Doku. Ich komm einfach nicht dazu sie anzusehen ... Das Wochenende hat 1,5 Tage und das ist eindeutig zu wenig um es mit Hund, LoL, LoR, BDO, Filme + Serien und schlafen voll zu stopfen.","replies":[{"poster":"G2 Slippi","date":"2020-01-29T10:00:54.649+0000","up_votes":1,"down_votes":0,"body":"DU HAST ESSEN VERGESSEN!!!!","replies":[{"poster":"Kirschkern","date":"2020-01-29T10:04:44.045+0000","up_votes":1,"down_votes":0,"body":"Hm .-. Ich esse immer nebenbei.\n\nSamstags frühstücken zum Beispiel .-. Selten mach ich mir ein Brot und esse des während ich mit Rocky spaziere. Meistens gehen wir spazieren und danach mach ich was fertig um es dann bei einem Stream, Film oder Serie zu gucken.\n\nOder Abendessen :o Gestern. Pizza + Serie gucken. Oder Sachen wie TFT/ LoR spielen xp","replies":[{"poster":"G2 Slippi","date":"2020-01-29T10:16:51.937+0000","up_votes":1,"down_votes":0,"body":"Du hast es trotzdem nicht erwähnt ^^ Essen ist einfach das Wichtigste :3","replies":[{"poster":"Kirschkern","date":"2020-01-29T10:31:46.430+0000","up_votes":1,"down_votes":0,"body":":o Aber auch eine flauschige Kuscheldecke!","replies":[{"poster":"G2 Slippi","date":"2020-01-29T10:33:15.264+0000","up_votes":1,"down_votes":0,"body":"Aber von einer flauschigen Kuscheldecke wird man nicht satt!","replies":[{"poster":"Kirschkern","date":"2020-01-29T10:38:40.959+0000","up_votes":1,"down_votes":0,"body":"Theoretisch schon :D","replies":[{"poster":"G2 Slippi","date":"2020-01-29T10:40:21.583+0000","up_votes":1,"down_votes":0,"body":"Aber du kannst doch nicht dein flauschige Kuscheldecke essen {{sticker:sg-janna}}","replies":[{"poster":"Kirschkern","date":"2020-01-29T11:21:55.701+0000","up_votes":1,"down_votes":0,"body":"°^° Würde ich auch niemals machen! Ich liebe diese Decke!","replies":[]},{"poster":"00 M4ddin 00","date":"2020-01-29T10:45:20.545+0000","up_votes":1,"down_votes":0,"body":"Doch da sind ganz viel krümmel drin :0","replies":[{"poster":"G2 Slippi","date":"2020-01-29T10:46:47.996+0000","up_votes":1,"down_votes":0,"body":"Urgh...die sind ja schon uralt {{sticker:zombie-brand-mindblown}}","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"G2 Slippi","date":"2020-01-29T07:50:35.346+0000","up_votes":1,"down_votes":0,"body":"Gestern war ein guter Tag: Ich habe endlich wieder meine Loosingstreak durchbrochen :) Zuerst habe ich 2 ARURFs gewonnen und danach noch 4/5 Normals :D\n\nIch glaube ich werde mich wieder von der Toplane verabschieden und in den Jungle zurückkehren :) Das liegt mir einfach besser und ich muss mich nicht mit dämlichen Noobmatchups wie Nasus, Trynda, Illaoi, Garen, usw. auf der Lane herumschlagen :) Als Zweitrolle wird wieder Mitte gewählt, da mein geliebter Galio einen Buff bekommt :D\n\nLoR hab ich gestern gar nicht gespielt, aber vl heut wieder.\nAm Montag habe ich mit FF14 begonnen, wo ich die Tage auch mal wieder weiter spielen werde :)\n\nEinen schönen Tag euch allen :3","replies":[{"poster":"Xayah Strife","date":"2020-01-29T14:28:00.674+0000","up_votes":1,"down_votes":0,"body":"Warum spielst du ncuiht WoW??","replies":[]}]},{"poster":"Kirschkern","date":"2020-01-29T12:48:13.676+0000","up_votes":1,"down_votes":0,"body":"Ich weiß noch gar nicht ob ich Schnitzel oder chinesisch/ mongolisch als Geburtstagsessen haben möchte D: [...] Wobei der Mongole auch Schnitzelstreifen mittlerweile in seinen Buffetdingern hat XD","replies":[{"poster":"G2 Slippi","date":"2020-01-29T12:49:42.957+0000","up_votes":1,"down_votes":0,"body":"Nimm mongolitisch ;)","replies":[{"poster":"Kirschkern","date":"2020-01-29T12:55:21.671+0000","up_votes":1,"down_votes":0,"body":"Da fällt mir glatt was besseres ein!\n\nDa, wo ich eigentlich nur Schnitzel esse ... gibt es keinen Camembert mehr als Vorspeise. Und ich weine einfach immer deswegen! **WEIL ICH CAMEMBERT ALS VORSPEISE HABEN WILL!**\n\nWir waren zuletzt am 02.01. bei diesem Mongolen ... Es wird also Schnitzel geben! **ABER** im Konkurrenz Restaurant meines eigentlichen Lieblings Restaurants! Weil die nämlich noch Camembert haben. Und wenn nicht ... geh ich in die Pommesbude und gönn mir Cheeseburger °^°","replies":[{"poster":"Xayah Strife","date":"2020-01-29T14:25:43.845+0000","up_votes":1,"down_votes":0,"body":"Wie wäre es mit Pommes von der Pommesbude?","replies":[]},{"poster":"G2 Slippi","date":"2020-01-29T13:04:23.045+0000","up_votes":1,"down_votes":0,"body":"Wie wärs mit einem Burger mit Schnitzel und Camembert drin?","replies":[]}]}]}]},{"poster":"Xayah Strife","date":"2020-01-29T14:14:23.596+0000","up_votes":1,"down_votes":0,"body":"Ich bin auch mal da.\nTut mir leid aber meine Bahn ins TGSG-Land hatte heute Verspätung. :(","replies":[]},{"poster":"00 M4ddin 00","date":"2020-01-29T12:02:39.968+0000","up_votes":1,"down_votes":0,"body":"T-3 stunden","replies":[{"poster":"Kirschkern","date":"2020-01-29T12:09:27.436+0000","up_votes":1,"down_votes":0,"body":"ENDLICH! Ende in Sicht!\n\nUnd ich hab noch eine Mandarine und eine Banane und ein Mittagessen das vermutlich nicht schmeckt (Kartoffeln + Lauch 6 EL Rama Cremefine und einfach etwas Salz und Knoblauch dran gestreut XD Da fehlt eindeutig das Bratwürstchen)","replies":[{"poster":"00 M4ddin 00","date":"2020-01-29T12:28:15.409+0000","up_votes":1,"down_votes":0,"body":":0 \n\nIch hab garnichts zu essen da :*(","replies":[{"poster":"Kirschkern","date":"2020-01-29T12:42:28.945+0000","up_votes":1,"down_votes":0,"body":"Ich habe gerade den Milka Mix geöffnet und ... es war ein riesen Fehler D: Hab mir zwar nur sechs raus genommen, aber ich will meeeeeeeeeeeeeeeehhhhhhhhhhhhhhhhhhhrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr","replies":[{"poster":"00 M4ddin 00","date":"2020-01-29T14:11:20.040+0000","up_votes":1,"down_votes":0,"body":"Ahhhhh wie gemein :0 \n\nIch geh nach der arbeit ganz viel süßes kaufen nur für mich :P","replies":[]}]}]}]}]},{"poster":"G2 Slippi","date":"2020-01-29T13:49:34.919+0000","up_votes":1,"down_votes":0,"body":"Eine halbe Stunde noch, dann fahr ich noch schnell auf eine Baustelle und dann ist auch schon Feierabend &lt;3","replies":[]},{"poster":"Kirschkern","date":"2020-01-29T13:25:32.106+0000","up_votes":1,"down_votes":0,"body":"#SONNTAG, DIENSTAG, MITTWOCH\n\nTage an denen mein Hauptbahnhof gesperrt wurde wegen dem sogenannten \"Bomben-Idioten\".\n\nXD 13 Uhr kam heute der Anruf ... Bis 17 Uhr ist bestimmt immer noch nicht alles normal ... Also fahre ich zu dem Bahnhof wo ich morgens immer aussteige. Und rechne einfach mal mit einer Stunde Verspätung und einem überfülltem Zug °^°","replies":[]},{"poster":"Metalmonni","date":"2020-01-29T10:05:22.790+0000","up_votes":1,"down_votes":0,"body":"Ich bin auch müde... und krank :(\n\nGebt mir Mitleid!","replies":[{"poster":"00 M4ddin 00","date":"2020-01-29T10:43:22.056+0000","up_votes":1,"down_votes":0,"body":"*öffnet seinen nass feuchten transparenten plastik Bademantel an dem der Schweiß runter läuft* \n\nKomm ich drück dich dann gehst dir besser :D","replies":[{"poster":"Metalmonni","date":"2020-01-29T10:44:38.996+0000","up_votes":1,"down_votes":0,"body":"Bilder in meinem Kopf... igitt xD\n\nIch glaub ich kauf mir die Tage mal Rimworld...","replies":[{"poster":"00 M4ddin 00","date":"2020-01-29T12:01:13.479+0000","up_votes":1,"down_votes":0,"body":"Ja mach das das Spiel ist wirklich gut ! \nMacht super spaß und es ist zu lustig was alles passieren kann :D","replies":[{"poster":"Metalmonni","date":"2020-01-29T12:03:46.476+0000","up_votes":1,"down_votes":0,"body":"Ja, ich höre von allen möglichen Freunden, dass es super gut wäre und auch mega befriedigend... \nAber es ist soooooo hässlich xD.\n\nWie eine ehemalige Schulkollegin von mir.","replies":[{"poster":"00 M4ddin 00","date":"2020-01-29T12:26:20.817+0000","up_votes":1,"down_votes":0,"body":"Wenn alle meine Freunde eine Tusse Befriedigend finden will ich die garnicht mehr sehen ^^ \n\n\nAber ne das Spiel ist nicht hässlich es hat halt einen reduzierten look ^^ \n\nAber das gameplay ist super und wie gesagt es macht Spaß und auch etwas süchtig ^^","replies":[{"poster":"Metalmonni","date":"2020-01-29T12:28:53.122+0000","up_votes":1,"down_votes":0,"body":"Ab übermorgen Urlaub....","replies":[{"poster":"00 M4ddin 00","date":"2020-01-29T12:30:14.678+0000","up_votes":1,"down_votes":0,"body":"Danach wirst du von Rimworld aufgesaugt :D \n\nKannst deine Arbeit schonmal an den Nagel hängen ^^","replies":[]}]}]},{"poster":"Kirschkern","date":"2020-01-29T12:10:15.922+0000","up_votes":1,"down_votes":0,"body":"Bei Scary Movie lernt man doch mit solchen Situationen umzugehen :o\n\nTüte über'n Kopf und fertig!","replies":[{"poster":"Metalmonni","date":"2020-01-29T12:11:08.511+0000","up_votes":1,"down_votes":0,"body":"Klappt aber nicht bei Rimworld :P. Das hat keinen Kopf :D","replies":[]}]}]}]}]}]}]}]}