{"poster":"Kirschkern","date":"2020-01-13T09:12:52.034+0000","title":"[TGSG] °^° Titel-lose Alpträume","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":0,"body":"Jawohl! Diese Nacht habe ich ziemlich kuriosen Kram geträumt. Darunter auch das posten eines Threads zum wiederholten Male ohne Titel :o Also ratet mal was ich hier als erstes gemacht habe? Genau. Eine Mandarine geschält! Und dann den Titel eingetragen. HA! Selbst ausgetrickst :>\r\n\r\nUnd ihr wilden Rankedtiere? Der Großteil von euch hat bereits mit dem Rangliste spielen wieder angefangen oder? Bisher scheint alles ziemlich durchwachsen zu sein und alles was letzte Season falsch gelaufen ist, muss irgendwie wieder gerade gerückt werden. So gerne ich auch mal frühzeitig mit Rankeds anfangen möchte, so abschreckend ist der Seasonstart aber auch. Die letzten Jahre fand ich es am angenehmsten ca. im März anzufangen .-. und dabei wird es wohl auch bleiben. Zumindest definitiv was den Main Account angeht.\r\n\r\n[...] Joa XD Heimprogramm funktioniert wieder und mir sagt keiner Bescheid. Aber der soziale Dienst ruft an und merkt erst einmal an das keine Betreuung beim neuen Bewohner angegeben ist, der nebenbei auch noch nicht im Programm aufgenommen wurde XD Ja toll. Ihr Nasenbären. Dann gibt es da noch die Angehörige der man unbedingt mit einem Heimplatz helfen möchte, es aber dann nicht direkt kann weil das Pferd bei der Anmeldung verpennt hat ihr zu sagen das eine Diagnose vom Neurologen bzgl. der Demenzerkrankung benötigt wird. Toll. Die Frau ist eh schon durch und weiß nicht wo oben oder unten ist und jetzt muss sie noch mit ihrer Mutter schnellstmöglich zu einem Neurologen kommen. Und wenn sie des geschafft hat, ist der Platz vermutlich weg. Weil anderweitig liegt hier niemand im sterben °^° \r\n\r\nUnd der werte Herr K. ist wieder da für eine Wartung der Brandmeldezentrale :D Das ist gut und doof weil gut: ich mag ihn/ schlecht: ich bin nicht alleine °^°  Und ich habe noch nichts gegessen! Das werde ich jetzt wohl auch nicht mehr können XD Naja. Hab insgesamt vier Mandarinen dabei welche dann erst einmal reichen müssen. Brot kann ich später essen oder gar nicht und die selbstgemachte Käse Lauch Suppe ... bis dahin ist er bestimmt wieder weg °^° Hoffentlich.\r\n\r\nBevor mir jetzt noch weitere Thread-Steine in den Weg gelegt werden ... War's das für heute XD","replies":[{"poster":"Veezey","date":"2020-01-13T12:54:11.649+0000","up_votes":1,"down_votes":0,"body":"Fraglich, wann ich mal mit Ranked anfange xD","replies":[{"poster":"Kirschkern","date":"2020-01-13T13:05:05.423+0000","up_votes":1,"down_votes":0,"body":":o Kommt darauf an ob du die Belohnungen haben möchtest.","replies":[{"poster":"Veezey","date":"2020-01-13T13:41:51.810+0000","up_votes":1,"down_votes":0,"body":"Ja eigentlich schon, aber ich hab im Moment nicht so viel Lust auf LoL xD","replies":[{"poster":"Kirschkern","date":"2020-01-13T13:53:49.463+0000","up_votes":1,"down_votes":0,"body":"Lüge! Samstag hattest du Lust es mit mir zu tun :o Aber ich war zu müde und faul und du actually zu betrunken!","replies":[{"poster":"Veezey","date":"2020-01-13T15:19:08.445+0000","up_votes":1,"down_votes":0,"body":"Ich sagte nicht so viel Lust und nicht gar keine :D\nJa diesmal war ich mal wirklich betrunken. Also nicht mal eine Lüge von dir xD","replies":[{"poster":"Kirschkern","date":"2020-01-14T06:25:58.876+0000","up_votes":1,"down_votes":0,"body":"wowowowowowowowowowowowow Vicky!\n\nD: Sag nicht das ich lüge nur weil du mit deinem Alkoholismus nicht offen und ehrlich umgehst =p","replies":[{"poster":"Veezey","date":"2020-01-14T12:59:42.978+0000","up_votes":1,"down_votes":0,"body":"Doc doch. Du behauptest ja immer dass ich voll bin xD","replies":[]}]}]},{"poster":"Metalmonni","date":"2020-01-13T13:55:49.303+0000","up_votes":1,"down_votes":0,"body":"Ahh, ein weiterer Mitspieler, der trunkenes Lol - Spielen schätzt. Ich bin beeindruckt und angetan :)","replies":[{"poster":"Veezey","date":"2020-01-13T15:22:36.848+0000","up_votes":1,"down_votes":0,"body":"Ja ich hab ein ARAM gespielt und stand am Ende 1/15/26 xD","replies":[{"poster":"Metalmonni","date":"2020-01-13T16:51:03.317+0000","up_votes":1,"down_votes":0,"body":"Klingt nach Freitag Abend :P","replies":[{"poster":"Veezey","date":"2020-01-13T17:12:52.822+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-miss-fortune}}","replies":[]}]}]}]}]}]},{"poster":"G2 Slippi","date":"2020-01-13T13:08:06.602+0000","up_votes":1,"down_votes":0,"body":"Mir zum beispiel gehts nicht um die Belohnung, sondern darum, dass ich nicht mehr in Bronze starten möchte ^^ Was dieses Jahr leider nicht erfolgreich war, obwohl ich letzte Season dafür so rein geschwitzt habe, dass ich Gold erreiche xD","replies":[{"poster":"Kirschkern","date":"2020-01-13T13:20:01.360+0000","up_votes":1,"down_votes":0,"body":"°^° Ich will für alles mögliche belohnt werden! Aber ja. Season Anfang spiele ich nur für den Goldstatus damit die Elo \"besser\" ist und die Belohnungen zum Ende der Season gesichert.\n\nTheoretisch wäre es mal an der Zeit mit den Gewohnheiten zu brechen und über das Ziel hinaus zu gehen :o Oder so XD","replies":[{"poster":"G2 Slippi","date":"2020-01-13T13:22:52.003+0000","up_votes":1,"down_votes":0,"body":"Dann mach doch bei der Wette von mir und Monni mit, dann ist der Ansporn größer mal aus dem gewohnten Trott rauszukommen ;)\nDer Gewinner bekommt ein Eis per Post geschickt ;) Wenn wir zu Dritt sind, sogar zwei ^^","replies":[{"poster":"Kirschkern","date":"2020-01-13T13:35:03.779+0000","up_votes":1,"down_votes":0,"body":"Wer also am Ende der Season die höchste Wertung in der Solo/Q hat, ja?\n\n°^° Wie sind die Bedingungen?\n\nICH WILL KEINE DUOS SEHEN\n{{sticker:sg-shisa}}","replies":[{"poster":"G2 Slippi","date":"2020-01-13T13:42:10.246+0000","up_votes":1,"down_votes":0,"body":"Ich hasse es alleine zu spielen, deswegen wird sich das leider nicht einrichten lassen, dass du keine Duos siehst ^^\nJedoch zählt bei mir dann nur die Solo/Duo Wertung, da ich vor habe ein Flex Team aufzustellen und damit im Flex zu climben.","replies":[{"poster":"Metalmonni","date":"2020-01-13T13:43:31.126+0000","up_votes":1,"down_votes":0,"body":"Ich spiele immer Solo in Flex. Mates ziehen mich nur runter.","replies":[{"poster":"Kirschkern","date":"2020-01-13T13:56:44.741+0000","up_votes":1,"down_votes":0,"body":"ISSO!","replies":[{"poster":"G2 Slippi","date":"2020-01-13T14:15:16.071+0000","up_votes":1,"down_votes":0,"body":"Nä mich ziehen höchstens hirnlose Randomaffen runter ^^","replies":[{"poster":"Kirschkern","date":"2020-01-13T14:27:04.473+0000","up_votes":1,"down_votes":0,"body":"Wenn der eine Flex spielt und der andere Duo kann man aber keine Wette machen x.x","replies":[{"poster":"G2 Slippi","date":"2020-01-13T14:30:47.006+0000","up_votes":1,"down_votes":0,"body":"Solange er im Flex maximal Duo spielt geht das sehr wohl :)","replies":[{"poster":"Kirschkern","date":"2020-01-13T14:42:54.084+0000","up_votes":1,"down_votes":0,"body":".-. Eigentlich nicht.\n\nFlex ist way too easy dem Volksmund nach, zumindest aber bedeutungslos af.","replies":[{"poster":"G2 Slippi","date":"2020-01-13T14:48:39.568+0000","up_votes":1,"down_votes":0,"body":"Seis drum, wenn ich in Solo/Duo erst mal höher bin als er in Flex, dann hab ich mir das geschmolzene Eis erst recht verdient ^^\n\nAußerdem gibt es in Flex genauso solche Honks wie in Solo/Duo ^^","replies":[]}]}]}]}]},{"poster":"XenesisCH","date":"2020-01-13T14:23:51.612+0000","up_votes":1,"down_votes":0,"body":"https://giphy.com/gifs/pokemon-wynaut-yNAUxJhj4xgli","replies":[{"poster":"Kirschkern","date":"2020-01-13T14:26:20.414+0000","up_votes":1,"down_votes":0,"body":":D","replies":[]}]}]},{"poster":"G2 Slippi","date":"2020-01-13T13:46:36.275+0000","up_votes":1,"down_votes":0,"body":"Jedem das seine ;)\nIch mag es halt, wenn ich zumindest einen im Team hab, der auf Calls hört ^^","replies":[]}]}]},{"poster":"Metalmonni","date":"2020-01-13T13:36:22.648+0000","up_votes":1,"down_votes":0,"body":"Keine Bedingungen, nur purer Hass. Ich spiele allerdings nur Flex, kommt mir weniger toxisch vor da oO. Die Rankings sind ja gleichwertig","replies":[{"poster":"Kirschkern","date":"2020-01-13T14:00:57.091+0000","up_votes":1,"down_votes":0,"body":"Flex verleitet Menschen zu seltsamen Dingen.\n\n{{sticker:vlad-salute}}","replies":[{"poster":"Metalmonni","date":"2020-01-13T14:03:55.380+0000","up_votes":1,"down_votes":0,"body":"Weiß nicht, da war ich letzte Season einfach erfolgreicher. Vllt nur Zufall.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"INoKami","date":"2020-01-13T16:58:42.752+0000","up_votes":1,"down_votes":0,"body":"**[Der TGSG-Blog] Geschichten eines AZubis, Tag 276, superspäte Abendausgabe\n- Die Welt will mich doch f _*_ cken-Edition -**\n\nIrgendwer auf diesem Planeten will mir anscheinend richtig auf die Nerven gehen. Das ist der Tag in tl;dr.\nDie längere Fassung:\n\nEs beginnt eigentlich noch recht harmlos zu Hause. Ich hab vergessen, mein Handy zu laden und der Akku reicht gerade so für´s nackte Überleben. Also keine Musik heute auf dem Schulweg. Mist. Dann im Bus. Ein Fahrgast \"bittet\" wieder mal die Meute, nach hinten zu gehen. So weit, so Standard. Nur war heute das kleine Detail präsent, dass das gar nicht nötig wäre, da wir alle in den Bus gepasst haben! Nicht gerade schön, aber sachdienlich, von daher sehe ich die Aufforderung mehr als Nörgelei als alles andere. Die Bahn ist wie immer nicht ganz pünktlich, reicht aber irgendwie, um die U-Bahn zu erwischen und pünktlich da zu sein. Und wie immer zu Wochenbeginn werden wir zum Kolloq gebeten. War wieder Mittelmaß, aber müsste reichen. Und ab hier geht der Spaß los.\nEine Vakuumdestillation klingt aufregend und ist es auch, einerseits weil sie spannend ist (und ich mag spannend), zum anderen aber, weil das verdammte Vakuum nicht wollte! Nachdem wir es gerade so auf 240 hPa runterbekommen haben, wollte ich noch ein Thermometer verrücken, um es besser sehen zu können. Und schwupps, weg war das Vakuum! Also alles abbrechen (zum Glück kochte noch nichts), neu fetten und wieder von vorne. Und dann zog sich alles in die Länge, auch wegen diesem verdammten Vakuum. Mal macht es Sprünge auf fast 400 hPa, damit es dann wieder runtergeht... ich hab echt mehrere Herzstillstände bekommen während der Destillation. Dann wieder auf 240 eingependelt, dann wieder ein Sprung auf 380, dann ist es irgendwie bei 180 geblieben für ein paar Minuten, dann wieder hoch gegangen...\nUnd damit man auch die Geschichte versteht: man sollte eigentlich erst bei einem Druck von unter 200 hPa anfangen. Erklärt damit auch unsere Destillationsdauer von 55 Minuten.\nMittagessen war auch lustig, weil ich beim örtlichen Lidl paar Pfandflaschen abgeben wollten, aber ein Automat war voll und der zweite defekt, hat auch nur 5 Minuten gekostet...\nAm Nachmittag kam dann aber der richtige Spaß: Als wir gerade die nächste Apparatur aufbauen, fällt mir eine kleine Wasserpfütze auf. \"Wo kommt die denn her?\", frage ich mich und folge der Pfütze, die sich innerhalb von einem Meter zu einem kleinen See ausbreitet. Immer verwirrter folge ich der Spur aus Wasser, bis diese am Ende des Tisches aufhört. Dann schaue ich Richtung Waschbecken... und die gegenüber haben den Kühlwasserschlauch nicht ordentlich befestigt, sodass sich dieser auf unserem Arbeitsplatz entleerte. Wow. Mein Block war nass, mein Laborjournal hat es erwischt, bei meinem Partner ebenfalls, nur dass es auch noch sein Protokoll traf, meins habe ich zum Glück gesichert gelagert. Kurz anmeckern, kurz lachen, kurz aufwischen, seeehr lange trocknen. Nach diesem Erlebnis endlich unsere Apparatur aufgebaut, hat lange genug gedauert, wurde abgenommen, wir konnten endlich weiter machen. Und dann wurde es... \"kurios\". Folgende Situation: wir sollten ein Gemisch aus Methanol und Wasser destillativ trennen. Wasser siedet bekanntlich bei 100 Grad, Methanol bei etwa 64 Grad, also wird uns Methanol als erstes verdampfen, wenn wir heizen. Und wir heizen wie die Berserker. Wir heizen wie ein gefeedeter Sion, der seine Ult in ARAM anwirft. Nur es tut sich nichts.\nAlso überhaupt nichts. Ein paar kleine Bläschen bilden sich, aber das war´s. Nach einer Viertelstunde permanenter Brand-W auf das Wasserbad ohne Resultat ziehen wir den Assistenten zu Rate. Der merkt auch, dass irgendwas komisch ist. Wir vergewissern uns, dass wir die korrekte Probe genommen haben, die Flasche mit Inhalt ist noch da (wir müssen die Probe auf verschiedenen Wegen destillieren), er nimmt eine Geruchsprobe, Methanol riecht man doch recht gut... aber da war nix. Kein Methanol in der Probe! Wie soll das möglich sein?\nNachdem wir drei gut verwirrt sind, zieht der Assistent sein Wägebuch raus und überprüft, was er uns denn abgewogen hat. Ich hatte die, wenn auch sehr unwahrscheinliche, Theorie, dass wir nur Wasser bekommen hätten... und dann kommt der Knüller: uns wurde nie eine Analyse abgefüllt!\n\nAber woher kommt dann die Probe?\n\nIch erspare euch den Denkweg: die bisher realistischste Theorie ist, dass jemand, bevor die Fläschchen zum Abfüllen eingesammelt wurden, unsers hat mitgehen lassen, bisschen Wasser reingefüllt hat und das wieder zurückgestellt hat. Erhärtet sich dadurch, dass ich ungefähr noch wusste, wie viel \"Probe\" in der Flasche drin war und der Assistent daraufhin meinte, dass er normalerweise die doppelte Menge an Probe ausgibt.\nHalten wir also fest: irgendwer in dieser Schule will Krieg mit mir. Ich erinnere nur an den gestohlenen 1L-Kolben aus dem letzten Semester. Hab ich übrigens immer noch nicht gefunden und mittlerweile aufgegeben.\nSo, jetzt haben wir nur noch einen Arbeitstag, nämlich einen Dienstag (und die Story dazu hab ich jetzt schon häufig genug erzählt), und wir müssen \"nur\" noch 4 Destillationen in 4 Stunden Netto-Arbeitszeit machen. \"Schaffen sie doch locker!\", meinte der Assistent. Den Optimismus hätte ich gerne, denn zwei der vier Destillationen haben alleine schon eine Stunde Destillationsdauer, dann noch Auf-/Abbau und Reinigung miteinberechnet….\nAlso ich hab ja irgendwie damit gerechnet, dass wir nicht ganz fertig werden, aber dass es so scheitert, hab ich auch nicht erwartet.\n\nUnd als wäre das Labor noch nicht Mittelfinger genug, muss mir das örtliche Bauamt auch nochmal quer kommen: der Treppensteig am Bahnhof, der für mich einen wesentlich kürzeren Weg zu den Bussen ist als der \"reguläre\" Weg, ist plötzlich gesperrt, weil die Aufzüge repariert werden. Heute ging es zwar noch gut aus, weil die Bahn halbwegs pünktlich war, aber dieser Umstand bedeutet einen Umweg von einer Minute und wenn wir bedenken, wie pünktlich die Bahnen sind, macht das durchaus einen Unterschied...\n\nIn diesem Sinne: Eine schöne Woche euch!\n(Meine ist jetzt schon für´n  _**_ sch.)","replies":[]},{"poster":"Xayah Strife","date":"2020-01-13T12:12:56.054+0000","up_votes":1,"down_votes":0,"body":"Noch 3 Stunden. :)","replies":[{"poster":"Metalmonni","date":"2020-01-13T12:15:18.702+0000","up_votes":1,"down_votes":0,"body":"BEI DIR VIELLEICHT!!!!\n\n**Gnahahahahahaaaa...!!**\n\n*Wirft sich sein Cape um die Schultern und rennt gegen die geschlossene Tür*","replies":[{"poster":"Kirschkern","date":"2020-01-13T12:19:06.692+0000","up_votes":1,"down_votes":0,"body":"XD lel\n\nJetzt denke ich mir so \"Ja. Heute Abend kannst du bestimmt noch ein wenig spielen. Energie ist noch da.\" Sobald ich aber Zuhause bin, sterbe ich zehn Tode °-° Dabei könnte ich meinen Smurf leveln und mit dem dann schon Rankeds spielen.","replies":[{"poster":"Metalmonni","date":"2020-01-13T12:20:19.169+0000","up_votes":1,"down_votes":0,"body":"Warum nicht auf deinem Main?","replies":[{"poster":"Kirschkern","date":"2020-01-13T12:38:01.991+0000","up_votes":1,"down_votes":0,"body":"Azima hat zu viel Würde um sich direkt am Season Anfang kopflos in Rankeds zu stürzen! Und da sie nur tryharden kennt, möchte sie das alles weitestgehend richtig eingependelt ist bevor sie los legt :o","replies":[{"poster":"Xayah Strife","date":"2020-01-13T14:04:02.157+0000","up_votes":1,"down_votes":0,"body":"Dann spiel doch einfach ein paar Ranks mit Kirschi. ^^","replies":[{"poster":"Kirschkern","date":"2020-01-13T14:38:36.347+0000","up_votes":1,"down_votes":0,"body":"Die braucht zwischendurch nur ein paar aktivierungsspiele °^° Ich will nicht das jemand meine Kirsche stalked und dann Mist über meine Elo redet.","replies":[{"poster":"Xayah Strife","date":"2020-01-13T14:40:09.971+0000","up_votes":1,"down_votes":0,"body":"Meinst du jemand fremdes aus dem Forum würde dich stalken?\nUnd wie wenn du ihn nicht auf deiner Freundesliste hast? o.O\nOP.GG Games aufzeichnen? Meinst du jemand würde sowas tun?","replies":[{"poster":"G2 Slippi","date":"2020-01-13T14:44:27.299+0000","up_votes":1,"down_votes":0,"body":"Naja es ist doch so, dass, wenn du hier im Forum eine Äußerung zu League machst wird sofort dein OP.GG Profil auseinander genommen, und wehe du bist nicht mindestens Grandmaster mit einer 70%igen WR und einer durchschnittlichen KDA von 15/0/5 ^^","replies":[{"poster":"Xayah Strife","date":"2020-01-13T14:58:55.448+0000","up_votes":1,"down_votes":0,"body":"Ja aber die meisten davon sich irrelevante NoNames dessen Meinung man keinen Wert zusprechen sollte.\nMir fällt hier spontan nur eine Person ein wo ich angst hätte sie sich meine Games anschauen würde die auch bekannter ist.","replies":[]}]}]}]}]}]}]},{"poster":"G2 Slippi","date":"2020-01-13T12:26:28.789+0000","up_votes":1,"down_votes":0,"body":"Ich hab dich am Wochenende gefragt, ob wir zusammen leveln, du wolltest ja nicht {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Metalmonni","date":"2020-01-13T12:31:22.156+0000","up_votes":1,"down_votes":0,"body":"Das ist total normal bei ihr, zumindest soweit ich mich erinnere ^^. Ist nicht böse gemeint, ich denke sie hat dich trotzdem lieb :D","replies":[{"poster":"Kirschkern","date":"2020-01-13T12:40:55.645+0000","up_votes":1,"down_votes":0,"body":"EY :o Ich hab sooooooooooooooooo viel mit Slippi und Veeezy vergangenes, also vorletztes, Wochenende gespielt! SOOOOOOOOOOOOOOOOO VIEL!","replies":[{"poster":"Metalmonni","date":"2020-01-13T12:43:40.556+0000","up_votes":1,"down_votes":0,"body":"Klingt gut, vllt erwisch ich euch ja auch mal :D","replies":[{"poster":"Kirschkern","date":"2020-01-13T13:04:27.795+0000","up_votes":1,"down_votes":0,"body":"Dann bete das ich keine Lobby erstelle XD denn meine sind immer geschlossen.\n{{sticker:sg-miss-fortune}}","replies":[{"poster":"Metalmonni","date":"2020-01-13T13:05:43.494+0000","up_votes":1,"down_votes":0,"body":"Wenn ich das sehe kann ich ja immer noch lieb um eine Einladung bitten :)\n\nNormalerweise bin ich eh nicht der Typ, der einfach Lobbys entert.","replies":[{"poster":"Kirschkern","date":"2020-01-13T13:08:11.772+0000","up_votes":1,"down_votes":0,"body":"Ich trau mich das auch nie °^° Außer bei Vicky. Liegt vermutlich daran das er immer betrunken ist XD\n{{sticker:sg-miss-fortune}}","replies":[{"poster":"Metalmonni","date":"2020-01-13T13:09:22.068+0000","up_votes":1,"down_votes":0,"body":"Immer, Immer? oO\n\nIch bin dann nur immer traurig wenn die Angeschriebenen dann immer ohne Antwort einfach ihr Spiel starten :P","replies":[{"poster":"G2 Slippi","date":"2020-01-13T13:12:28.562+0000","up_votes":1,"down_votes":0,"body":"Das kenn ich, da fühle ich mich dann immer wie ein MOF {{sticker:cass-cry}}","replies":[{"poster":"Metalmonni","date":"2020-01-13T13:14:15.407+0000","up_votes":1,"down_votes":0,"body":"Ich wünsche mir dann manchmal, einfach etwas dreister zu sein...","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]}