{"poster":"davichost","date":"2016-07-05T04:49:51.740+0000","title":"carrear siendo support?","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"Que supports recomiendan para subir de liga por lo menos a oro?\nSi, estoy atrapado en plata II  gano/pierdo/gano/pierdo y asi...\nNo soy bueno jugando, uso mucho a {{champion:37}}  y funciona bien, pero siento que hay otros supps que parecen tener un mayor potencial, cuales me recomiendan ustedes?\n\n\nA todo esto y con los cambios que se vienen que supps creen que estaran op?","replies":[{"poster":"TyShaD","date":"2016-07-05T15:03:08.040+0000","up_votes":6,"down_votes":0,"body":"{{champion:53}}  . mucha gente se tiltea/se pone nerviosa cuando tiene un robot !\"·!\"·%·$%&/ enfrente, yo soy uno de los casos :(","replies":[{"poster":"GaboSword","date":"2017-06-10T20:54:57.868+0000","up_votes":1,"down_votes":0,"body":"nah...esos ganchos con buena vision se evitan...y si se hace ap...lo deleteas sin problema.","replies":[]}]},{"poster":"Neo Gaussrik","date":"2016-07-05T14:55:18.371+0000","up_votes":4,"down_votes":0,"body":"Te recomiendo {{champion:143}} , {{champion:40}} , {{champion:16}} , {{champion:37}} y {{champion:161}} . :)","replies":[{"poster":"rokushoger","date":"2016-07-06T12:07:11.364+0000","up_votes":1,"down_votes":0,"body":"Pensar que zyra y vel'koz (y también morgana) empezaron como mid, y ahora son supports hechos y derechos.","replies":[{"poster":"Neo Gaussrik","date":"2016-07-06T15:38:21.978+0000","up_votes":1,"down_votes":0,"body":"A veces los campeones no terminan en las posiciones que teniamos en mente.\n\nRecuerdan a Vi y Leona top? Ahora parece como una idea bizarra. ;)","replies":[{"poster":"rokushoger","date":"2016-07-06T16:19:23.131+0000","up_votes":2,"down_votes":0,"body":"Si es muy cierto! Y gragas también!","replies":[]},{"poster":"GaboSword","date":"2017-06-10T20:56:01.435+0000","up_votes":1,"down_votes":0,"body":"si leona fue pensada para top, por que no se le dan amplitudes para ello?","replies":[]}]}]},{"poster":"zelaya19","date":"2016-07-05T18:49:16.133+0000","up_votes":1,"down_votes":1,"body":"{{champion:432}} {{item:3070}}","replies":[{"poster":"Neo Gaussrik","date":"2016-07-05T18:52:32.022+0000","up_votes":1,"down_votes":0,"body":"Aunque amo a Bardo no lo voy a recomendar a alguien que no lo conoce muy bien ya. :)","replies":[{"poster":"Allis Jazz","date":"2016-07-05T22:52:04.193+0000","up_votes":1,"down_votes":0,"body":"Bardo es tan tan tan divertido de usar que solo gente realmente centrada no se pierde en el juego haciendo estupideses xD. Bardo is love, Bardo is life.","replies":[{"poster":"SenpaiDeathx","date":"2016-07-06T05:37:45.076+0000","up_votes":1,"down_votes":0,"body":"jamas olvidare cuando dijiste \"soy un Dios con bardo... 0/10\" gg xD","replies":[{"poster":"Allis Jazz","date":"2016-07-07T03:38:32.395+0000","up_votes":1,"down_votes":0,"body":"Era necesario ponerme presion para seguir mejorando xD","replies":[{"poster":"SenpaiDeathx","date":"2016-07-07T05:58:05.160+0000","up_votes":1,"down_votes":0,"body":"jajajajaajajaja el ql xD","replies":[]}]}]}]}]}]},{"poster":"Loxu202","date":"2016-07-06T06:02:54.150+0000","up_votes":1,"down_votes":0,"body":"{{champion:25}} {{item:3070}}","replies":[]},{"poster":"Main Sandwichs","date":"2016-07-05T20:52:24.548+0000","up_votes":1,"down_votes":0,"body":"soraka tiene un buen potencial en la linea de bot.... con la mejora del {{item:3301}}  tiene reduccion de enfriamiento, curacion por minion muerto y oro sin tener que matar.... podes curarte mientras farmea tu adc, pockear a full con tu Q que quita poco mana y ensima jode bastante por el rapido uso... y con otro item que te mejora aun mas tu curacion {{item:3504}}","replies":[]}]},{"poster":"Ks Erwyn","date":"2016-07-05T12:26:17.966+0000","up_votes":6,"down_votes":2,"body":"Cuando la utilidad no da resultado , el daño carrea {{champion:161}} , {{champion:99}} ...","replies":[]},{"poster":"rokushoger","date":"2016-07-05T11:19:16.509+0000","up_votes":3,"down_votes":0,"body":"Recomiendo mejorar y entrenar. En mi main estoy en platino jugando solo soportes, y últimamente Taric (post rework) me dio muy buenos resultados. Además juego janna y tahm kench, pero la verdad es que hasta kennen support he jugado (excelentísimos resultados con él por cierto, saqué S incluso en esa partida). \nNo va en que support juegues, sino contra qué lo pickees, que tan inteligente sos, que decisiones tomás, y que tanta habilidad tenés.\nA mi gusto el rol de support no tiene counters tan hard como otros roles de 1vs1 simplemente porque el adc puede llegar a cubrirte en esos casos y viceversa, pero si que importa contra que elegís ciertos campeones.","replies":[]},{"poster":"Caipirinhã","date":"2016-07-05T05:17:02.492+0000","up_votes":3,"down_votes":0,"body":"Tenes que conseguirte un premade que juegue ADC","replies":[]},{"poster":"Axitas Alexis 99","date":"2016-07-05T15:40:07.846+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo que sigas jugando {{champion:37}} si es lo que te gusta, tarde o temprano te daras cuenta de que cometes algunos pequeños errores que te haran salir, o simplemente puedes spamear janna que no tengo idea de porque siempre gano aunque salga 0/9 (las asistencias si importan, pero una janna no puede morir 9 veces je)","replies":[{"poster":"davichost","date":"2016-07-05T21:34:02.712+0000","up_votes":1,"down_votes":0,"body":"Si cometo un monton de errores xD, creo que es por mi estilo de juego tan pasivo, muchas veces tengo el daño para matar al supp o al adc rival y pierdo la oportunidad. La verdad supports agresivos como blitz o leona no me llaman mucho, mas que nada por que en este elo a veces me tiro y no me siguen, creo que usare más los supps de utilidad ahora con el parche que se viene. Mi otra opcion es usar directamente supps magos como zyra o velkoz. Gracias","replies":[{"poster":"g3r0g3r0","date":"2016-07-06T01:07:29.869+0000","up_votes":2,"down_votes":0,"body":"Sona es justamente un supp agresivo.\nSi queres jugar a helear a tu adc te conviene Soraka.\n\nLA gracia de jugar sona es que tenes un pokeo ridiculamente barato en mana, que hace daño a dos personaejs sin tener que apuntar, de hecho podes entrar al rango castearlo y salir antes de que el skill llegue a los adversarios.\nY ni hablar del combo AA Q AA potenciado que actualmente tiene un daño ridiculo.\nEn cambio el heal de Sona es carisimo, si tu adc se deja pokear fuerte estas en problemas graves, sirve mas como un complemento de sustain/escudo en fase de linea, pero idealmente no deberias castearlo demasiado.\n\nSi te gusta una lane mas pasiva siempre podes ir por soraka, qeu pese a que los ultimos cambios hicieron que ahora debas usar la Q apra poder mantenerte ne linea, con la moneda y un par de runas de regeneracion sigue srviendo como ambulancia pasiva qeu se qeuda atras casteando heals como una bestia.","replies":[]}]}]},{"poster":"Tsuyeon","date":"2016-07-05T17:50:55.626+0000","up_votes":2,"down_votes":0,"body":"yo personalmente prefiero usar a lulu... mete caleta al conchetumare y si alguno de tu team no es feeder lo podes hacer una maquina de matar","replies":[{"poster":"efukt","date":"2016-07-05T18:17:32.432+0000","up_votes":1,"down_votes":0,"body":"finito XD","replies":[]}]},{"poster":"That Beautiful","date":"2016-07-05T09:14:36.604+0000","up_votes":2,"down_votes":0,"body":"Claro que puedes! Si juegas con Sona estarás habituado a brindar utilidad preocupándote bastante de tu posicionamiento (con tan poca vida). Por eso, te recomiendo infinitamente a Janna! Su kit es muy completo; otorgas escudos, y daño con él, curación y tanto engage como disengage. También está Nami y quizá Blitz, como mencionan algunos (comparándolos con lo que creo se asocia a tu estilo de juego). Lo esencial es que estés cómodo en el rol y con el champ que selecciones, procura practicar tu juego individual, observar continuamente el mapa (lo que muy poquitos hacen en bronce/plata/oro y de verdad hace ganar partidas) y \"aggg\" muchísimo, muchísimo ánimo y paciencia, tarde o temprano subirás!","replies":[]},{"poster":"SenpaiDeathx","date":"2016-07-05T05:25:41.007+0000","up_votes":3,"down_votes":2,"body":"la vdd no creo que sirva mucho jugar de suport en estas ligas oro/plata/bronce... Y por una sencilla razón, no tienes a nadie bueno para suportear. Despues mas arriba esta lleno de main suport. Pero ahora o buscas un buen team o juega otro rol","replies":[{"poster":"rokushoger","date":"2016-07-05T11:21:12.003+0000","up_votes":4,"down_votes":2,"body":"Si yo subí jugando solo support a platino en mi cuenta main, tanto él como vos pueden hacerlo, no soy ningún genio. Y eso de que no sirve el support estás equivocado, de hecho, es más útil tener un buen soporte que un buen adc, dado que le podes salvar la vida y el tipo puede seguir dañando.","replies":[{"poster":"SenpaiDeathx","date":"2016-07-05T18:50:18.809+0000","up_votes":2,"down_votes":1,"body":"De que te sirve ayudar a un adc malo que no sabe posicionarse y tampoco meterá daño. Nadie dice que no sirve suport, solo que en ligas bajas tiene menos impacto y para lo único que lo usan es wardear.","replies":[]}]},{"poster":"Allis Jazz","date":"2016-07-05T22:45:49.512+0000","up_votes":1,"down_votes":0,"body":"No sigas el comentario de esta criatura, es el peor sup de LAS y hasta él lo sabe xD cuando le toca sup yo simplemente dodgeo la partida xD.","replies":[{"poster":"SenpaiDeathx","date":"2016-07-06T05:28:44.399+0000","up_votes":1,"down_votes":0,"body":"hola mi amors :$ ♥","replies":[]}]}]},{"poster":"BUSCANDO A JORGE","date":"2016-07-05T05:00:35.145+0000","up_votes":2,"down_votes":1,"body":"Blitz, zyra y janna","replies":[]},{"poster":"Darkfoe703","date":"2016-07-05T17:32:37.780+0000","up_votes":1,"down_votes":0,"body":"{{champion:12}}  Un pick seguro, que te permite salir de la fase de líneas fuerte, y aportarle mucho al team en TF, aún si a tu ADC no le fue bien.","replies":[{"poster":"GaboSword","date":"2017-06-10T20:57:26.561+0000","up_votes":1,"down_votes":0,"body":"es muy bueno para remontadas, mientras uno de tu team tenga un fase lineas decente para hacer daño.","replies":[]}]},{"poster":"alop55555","date":"2016-07-05T20:35:07.176+0000","up_votes":1,"down_votes":0,"body":"no recomiendo leona por ningún motivo \ncuando soporteaba con leona iniciaba buenos intercambios y el adc me ignoraba  con lo que terminaba stuneando al adc y saliendo muy dañado o muerto cada vez que intentaba iniciar un intercambio o lo otro que me pasaba es que iniciaba luego el adc me seguia y alargaba el intercambio hasta morir,\nlamentablemente hay adcs que no toman buenas decisiones pero con leona se nota mucho la falta de habilidad del adc \nsoporte no es buena posición para carrear ya que no se aprovecha bien lo que l soporte hace o los errores de los otros soportes","replies":[{"poster":"t1r4 fl3ch4","date":"2016-07-06T01:05:02.126+0000","up_votes":1,"down_votes":0,"body":"La Leona es una soporte muy agresiva si la usas bien\nun buen stun (de los 3 que tiene) al jg enemigo cuando gankea lo puede dejar mal parado y \nel adc escapa sin ningun problema.\nEs un gran focus directo ya que encuentra a uno solo y a la base ya que con todas las habilidades cargadas\nno tiene un escape facil, es muy tanque pero eso si.... no tiene gran \"ayuda\" o \"curación\", por asi decirlo, \nya que si no tiene las habilidades cargadas muy fácilmente puede caer el adc.\nLa Leona va muy bien con adc muy agresivo como Jhin , Kalista ,Vayne ,etc ya que tienen buena movilidad y escape, Leona\npuede iniciar al adc enemigo muy rapido y explotarla en segundo.\nEn poca palabras : Leona viene bien acompañado con un adc AGRESIVO! ojo no digo que un adc pasivo no sirva tambien\npero va mejor con uno muy AGRESIVO!\n{{summoner:11}}","replies":[]}]},{"poster":"Dog Bulling","date":"2016-07-05T17:50:45.552+0000","up_votes":1,"down_votes":0,"body":"Sona va a estar OP dentro de unos dias. Claro, su harass no será como el de antes, pero su utilidad se multiplicará.","replies":[{"poster":"La corrupción","date":"2016-07-05T22:01:52.718+0000","up_votes":1,"down_votes":0,"body":"una pregunta, son muy largos los cambios y nunca los leí, me harías un resumen por favor?\n\nde Sona, está claro, y además de largos fueron confusos lo poco que leí","replies":[{"poster":"Dog Bulling","date":"2016-07-05T22:33:01.663+0000","up_votes":1,"down_votes":0,"body":"En resumen:\n\nSus auras al usar una habilidad cubren un area mayor.\nSu W cura y escuda más.\nSu E da velocidad de movimiento por más tiempo.\nLa pasiva de sona será más fuerte que antes, sobretodo con la W.\nSu R pasivamente otorga CD a tus habilidades básicas (20-40% de CD. Se acumula con tu propio CD). EJ: Si sona a nivel 11 tiene un 35%CD, con la pasiva de su ulti (que da un 30% de cd a nivel 2) las habilidades básicas tienen en realidad un enfriamiento del 54,5%. El máximo posible sería de un 67% una vez lleves su R a su máximo nivel (es decir, a altos niveles la sona que nos enfrentaremos será en realidad la sona de urf, aunque con menos daño).\n\nEso sí, el daño de la Q sube menos al subirse dicha habilidad.\nY las auras duran menos que antes, aparte que dicha duración no aumenta al afectar a campeones.\n\nTodo esto trae como consecuencia que Sona sea más soporte (en el concepto de utilidad) y menos AP carry (En cuanto a daño), aparte de mejorar su desempeño una vez acaba la fase de lineas.","replies":[{"poster":"La corrupción","date":"2016-07-05T22:43:56.640+0000","up_votes":1,"down_votes":0,"body":"te amo <3","replies":[]}]}]}]},{"poster":"Allis Jazz","date":"2016-07-05T22:43:23.300+0000","up_votes":1,"down_votes":0,"body":"Esta es mi opinion sobre 3 sup. Antes que nada hay que destacar que depende de tu estilo de juego, en lo personal evito los sup muy flanes y tiendo mucho a los sup con alta movilidad (pues tiendo a jugar baiteando cuando voy sup), eso es demasiado importante, intenta encontrar un sup que se pueda adaptar a tu estilo de juego.\n\nYo creo que el que mas puede carrear la linea es blitz {{champion:53}} , no requieres que tu adc sea un challenger, pero tiene un problema, si el otro equipo es medianamente bueno te equivaran todos los ganchos y quedara inutilizado. \n\nAhora tengo muy en consideracion al despreciado Zilean {{champion:26}} , me gusta muchisimo su control sobre el enemigo, le maxao la realentizacion (E), saco el item de sup azul y me tankeo, creeme, agarras a alguien con una E, no lo sueltas más hasta que alguien de tu equipo lo mata, puedes preocuparte de suportear al que mejor vaya con tu R asi potencias a los buenos jugadores de tu team. Muy bueno para gankear a mid mientras tu adc farmea.\n\nBardo {{champion:432}}  me encanta como sup, pero creo que solo sirve en 2 casos, 1 tu equipo tiene sincronia con tu estilo de juego o 2 el otro equipo es muy obsecionado con kill y se come facilmente los baiteos.","replies":[]},{"poster":"EdxxEdxx","date":"2016-07-05T18:25:07.654+0000","up_votes":1,"down_votes":0,"body":"mira, te recomiendo algo: anda a la pestaña de campeones, pones \"soporte\" en el filtro, y los miras todos, el que mas te llame la atencion a ese lo probas. si tenes suerte te va a pasar como a mi con {{champion:432}} .\n\nsi buscas carrear partidas siendo support la tenes muy dificil, y te lo digo por experiencia, en elo bajo la gente no tiene nunca en cuenta al support y tampoco aprovecha/sigue sus jugadas (la mayoria de las veces te dejan vendido o te insultar por X cosa), por lo que un support que pueda crear jugadas IMPOSIBLES de NO seguir es lo mejor. \n\nprueba algo que te guste mucho y luego de eso simplemente ponte a practicar a lo infeliz con el campeon 7u7 luego veras la magia salir sola jijiji","replies":[]},{"poster":"ll Leoh ll","date":"2016-07-05T17:24:07.585+0000","up_votes":1,"down_votes":0,"body":"si tienes buena punteria {{champion:412}} {{champion:53}}  en elo bajo se separan mucho y son faciles de saber donde tirar el skill, y asi ya puedes hacer tf con ventaja numerica","replies":[]},{"poster":"Tazztania","date":"2016-07-05T16:53:01.071+0000","up_votes":1,"down_votes":0,"body":"{{champion:89}} te dará la victoria :v","replies":[]},{"poster":"Lemon Roots ","date":"2016-07-05T15:39:59.420+0000","up_votes":1,"down_votes":0,"body":"Yo subi de platino V a Diamante V con puro {{champion:16}}  , {{champion:267}}  y algunas veces {{champion:89}}","replies":[]},{"poster":"The AcromioN","date":"2016-07-05T13:50:57.077+0000","up_votes":1,"down_votes":0,"body":"leona","replies":[]},{"poster":"Lazengan","date":"2016-07-05T05:12:00.083+0000","up_votes":1,"down_votes":0,"body":"{{champion:53}} {{champion:143}}","replies":[]},{"poster":"Cipher","date":"2016-07-05T05:04:57.362+0000","up_votes":1,"down_votes":0,"body":"Pues los mejores para carrear son Blitzcrank, Zyra o Thresh. En cierta medida Alistar también.\n\nAunque para carrear de verdad preferiría ir otra línea o rol.","replies":[]},{"poster":"Natuz Vincere","date":"2016-07-05T05:03:23.905+0000","up_votes":1,"down_votes":0,"body":"Blitzcrank <3\nAlistar\nNami\nJanna","replies":[]},{"poster":"efukt","date":"2016-07-05T18:19:33.501+0000","up_votes":1,"down_votes":1,"body":"{{champion:40}} jannita <3","replies":[]}]}