{"poster":"IIBloodAngelII","date":"2019-01-18T15:14:44.133+0000","title":"Estoy experimentando una especie de bug en el lol","subforum":"Problemas Técnicos","up_votes":5,"down_votes":0,"body":"Hola buenos dìas!\nDesde que salio  el nuevo parche, eh estado experimentando un problema que me toca en todas las partidas, en tal minuto, minuto 12 apròximadamente, el mouse se me descontrola y se me va, y no puedo recuperar el control, eso pasa màs o menos durante un minuto y en ese minuto no puedo hacer nada, quedo vulnerable a que me maten.. Ya eh probado de todo, use otro mouse (no cambio en nada), desinstale todos los puertos usbs de mi pc y los volvi a instalar, (igual sigue pasando), Hice varias actualizaciones a drivers (igual sigue pasando), desinstale el lol y lo volvi a instalar (igual me sigue pasando), y lo curioso es que solo me pasa dentro del lol, en otros juegos y en la pc trabajando normalmente anda todo normal, acique es obvio que es algùn tipo de bug reciente, les pido por favor a los de Riot, que me lo solucionen cuànto antes please, desde ya gracias.","replies":[{"poster":"VampiroMedicado","date":"2019-01-19T00:01:35.672+0000","up_votes":2,"down_votes":0,"body":"Proba lo siguiente anda \"Administrador de Dispositvos\" -> Controlador de Bus Serie Universal (USB) y fijate el que no parezca generico onda \"Intel XXX XX10/ICHX Familiy USB ...\" -> Segundo click y entra a detalles en Propiedad selecciona \"Id de Harware\" y copia el segundo de los 2 o 4 que te aparecen.","replies":[{"poster":"IIBloodAngelII","date":"2019-01-19T01:18:40.545+0000","up_votes":1,"down_votes":0,"body":"Ah pero justo, no me aparece el \"Intel XXX XX10/ICHX Familiy USB ...\" Què hago sino aparece ?\nEntre a Generic USB HUB què es el què màs se le parecia, e hice lo què me dijiste, copie esto USB\\VID_1A40&PID_0101\npara que me sirve?","replies":[{"poster":"VampiroMedicado","date":"2019-01-19T22:16:06.073+0000","up_votes":1,"down_votes":0,"body":"Si tenes ganas pasame una imagen de esa lista, pero segun la ID que me pasaste podes probar con este driver:\n\nhttp://ft p.h p.co m/pub/softp aq/sp79001-7 9500/sp793 50.exe (uni los espacios)\n\nEs de la web OFICIAL de HP, si te da cosa subilo a VirusTotal para ver si tiene virus. Tene en cuenta de tener los drivers que tenias a mano por cualquier cosa PERO no deberia pasar nada (es mas un aviso sobre que hacer inmediatamente).\n\nDe todas maneras si no agregame al LoL, asi hablamos mas rapido y vemos si es problema de los driver.","replies":[{"poster":"IIBloodAngelII","date":"2019-01-20T02:13:55.347+0000","up_votes":1,"down_votes":0,"body":"Trate de mandarte la foto, pero no supe còmo, lo què hice fue entrar a \"controladoras de bus serie universal\" luego elegi el ùltimo de todos \"Generic USB Hub\" le puse en propiedades, detalles, Id de harware y habìa dos:\n\n\nUSB\\VID_1A40&PID_0101&REV_0111\nUSB\\VID_1A40&PID_0101\n\nya instale el driver y sigue igual.\n\n\n\nAh dale con què nombre te encuentro en el lol?","replies":[{"poster":"VampiroMedicado","date":"2019-01-20T14:33:13.740+0000","up_votes":1,"down_votes":0,"body":"Con el que tengo en el foro? Nuestros nombres son los mismos del juego. (VampiroMedicado)\n\nUna consulta, que mouse tenes?","replies":[{"poster":"IIBloodAngelII","date":"2019-01-21T00:53:17.989+0000","up_votes":1,"down_votes":0,"body":"El mouse no tiene nada que ver tengo 3 distintos y con los tres me pasa, y antes nunca me pasaba y en el resto de juegos no me pasa nada, una consulta, el driver què me pasaste còmo se llama? y para què sirve? porque no me andubo.\nYa te envie la solicitud en el lol.","replies":[{"poster":"VampiroMedicado","date":"2019-01-21T14:15:54.929+0000","up_votes":1,"down_votes":0,"body":"El driver en teoria (puede haber pequeñas incompatibildades) es para tu maquina en este caso un controlador USB.\n\nEstaba leyendo que algunos mouse por algun motivo extraño le dan problema al LoL, por eso te pregunto que mouse tenes. Yo tengo un Logitech G Pro y funciona bien, pero por ahi tenes un X y justo cae que es de la misma marca rompieron algo y anda mal con tu marca. (Todo esto suponiendo que sean practicamente el mismo mouse)\n\nEn un foro estaba leyendo (y use) un programa llamado DriverEasy que increiblemente viene sin Malware/Adware (virus o programas basura) y sirve para buscar drivers actualizados sin necesidad de usar el software de otras empresas (que pueden traer programas basura, como un panel de control para X cosa).\n\nVolviendo al problema, es por algo de la sensiblidad de mouse del LoL. Podrias probar en desactivar la aceleracion de mouse en la configuracion de mouse de Windows.","replies":[{"poster":"IIBloodAngelII","date":"2019-01-22T19:06:59.829+0000","up_votes":1,"down_votes":0,"body":"El tema es què es imposible què sea mi mouse, cuàndo eh probado con 3 tipos de mouses diferentes (Noga gamer, LVM 9.14 GAMER, Y uno inalambrico touch normalito) mis mouses siempres aunduvieron bien y con todos pasa.lo què apsa es que no reconoces què es problema del lol , no te digo què no pueda pasar pero no creo què sea mi caso, y màs bien, siempre me andubo bien el lol la primera vez què me pasò esto fue al poco tiempo del ùltimo parche, estaba en LAN jugando con un amigo y de repente hubo un bug què nos saco a todos de la partida y a mi me dio ese problema, esa fue la primera què me pasò y desde entonces pasa. A mi amigo le siguiò pasando tambièn lo de què lo sacaban de la partida y se lo solucionaron.","replies":[{"poster":"VampiroMedicado","date":"2019-02-03T21:15:29.089+0000","up_votes":1,"down_votes":0,"body":"Hacete un post avisando de Avast despues.","replies":[]}]}]}]}]}]}]}]}]}]}