{"poster":"Shadow xP","date":"2017-05-17T14:54:37.935+0000","title":"Extremer Ping","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich habe mir einen neuen PC gekauft. Habe LoL runtergeladen und hatte bis jetzt in jedem Game mindestens einmal extremen High Ping (bis zu 3000) und ansonsten ist der Ping aich ziemlich hoch aber NUR in LoL. Sobald ich raustabbe ist der Ping bei cmd wieder normal. Die letzten 2 Tage war es noch schlimmer sodass ich nicht mal normal spielen konnte ohne rumzulaggen. Habe im Hintergrund nur TeamSpeak offen. Bitte um Hilfe.","replies":[{"poster":"Alexandro1212121","date":"2017-05-17T16:09:13.806+0000","up_votes":1,"down_votes":0,"body":"probier mal diese website aus:\nhttp://www.dnstools.ch/visual-traceroute.html\n\nmit dieser ip:\n104.16.1.92\n\nund guck dann mal wo das langgeht.\n(die ip ist die ip von euw.leagueoflegends.com)","replies":[]},{"poster":"Alexandro1212121","date":"2017-05-17T15:31:29.610+0000","up_votes":1,"down_votes":0,"body":"Versuche einmal, in der Eingabeaufforderung (Bei Windows 10 Rechtsklick aufs Windowszeichen und auf Eingabeaufforderung)\ntracert leagueoflegends.com\neinzugeben. Dies verfolgt zurück, wieviele Zwichenserver dein PC nutzt um an LoL Pakete zu senden.\n(Ausserdem zeigt es dir den Ping zu den einzelnen Servern)\nBei mir war es einmal so, dass mein PC einen riesigen Umweg zum LoL-Server verwendet hat.\n\nFalls bei manchen Servern steht: \"Zeitüberschreitung bei der Anfrage\" (o.ä.) ist das kein Problem.\nDas heißt nur, dass diese keine Pings annehmen.\nDas machen viele Server um eine DDos Attacke zu verhindern.\n\nWenn dein PC mehr als 30 Hops macht, solltest du dir das mal genauer angucken.\n(Nutze dann Google ich habe keine Lust dir die weiteren Schritte zu erklären.)\nEs kann auch sein, dass alle Server ~20 Ping haben, und einer plötzlich 3000.\nDann liegt das an diesem Server.\nFalls alle Server einen guten Ping aufweisen (oder es immer nur ein wenig steigt) und es weniger als 30 Hops sind, liegt es nicht hieran.","replies":[{"poster":"Shadow xP","date":"2017-05-17T15:40:35.700+0000","up_votes":1,"down_votes":0,"body":"Ok also es sind 30 Hops nicht mehr und bei ein paar Servern ist ein ca 150er Ping. Beim Großteil steht Zeitüberschreitung.","replies":[{"poster":"Alexandro1212121","date":"2017-05-17T15:48:54.768+0000","up_votes":1,"down_votes":0,"body":"30 Hops ist das Maximale was der unformatierte tracert cmd anzeigen kann.\nHast also warscheinlich mehr als 30 Hops.\n150er Ping ist noch nicht 3000 ^^, wobei auch das schon ziemlich langsam ist.\n(Es kann immer noch sein, dass der 31ste einen 3000er Ping hat.)\nIch würde sagen,\nmach dir die 5 Minuten Mühe es zu googlen.","replies":[{"poster":"Shadow xP","date":"2017-05-17T15:54:13.203+0000","up_votes":1,"down_votes":0,"body":"Aber trotzdem Danke :D","replies":[]},{"poster":"Shadow xP","date":"2017-05-17T15:53:48.906+0000","up_votes":1,"down_votes":0,"body":"Hab schon gefühlt ganz Google durchsucht nach dem Problem :'D","replies":[]}]}]}]}]}