{"poster":"Grimoire0","date":"2016-05-11T18:29:48.780+0000","title":"Garen can't get hextech chest?","subforum":"Miscellaneous","up_votes":1,"down_votes":3,"body":"To get a hextech chest, you must:\r\nBe playing a level 5 mastery champion in classic,\r\nWin the game with S rank,\r\nNever obtain a hextech chest before using that champion in that season.\r\n\r\nI have already obtain a hextech chest each with my other level 5 mastery champion {{champion:62}} Wukong, {{champion:91}} Talon, {{champion:131}} Diana and {{champion:106}} Volibear. Then I start to think what other champions that I can get S rank with and the thought of {{champion:86}} Garen came up first. Then I play many games to get him to mastery 5. After that, I played even more games using him to get S rank win game but the hextech chest never show up. I have already gotten 8 key fragments in classic game and multiple S rank win game in classic using Garen but no hextech chest show up. According to Riot, the more key fragments you have, the harder it is to get the next one but to me its seems like the chest is way harder to get. I have already starting to give up with this........ FOR HEXTECH CHESTTTTTTTTTTTTTTTTTTTTTTT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!{{champion:86}} {{champion:86}} {{champion:86}}","replies":[{"poster":"Ingénue","date":"2016-05-11T23:59:07.564+0000","up_votes":1,"down_votes":0,"body":"To get a hextech chest you need to:\n\n* Get an S rank with a champion you own\n* Be playing in a premade with someone who gets an S rank while you are playing a champion you own.\n* Have a hextech chest available (can bee seen on your profile, much like first win of the day timer)\n* Be playing a champ that you don't already have the chest for (shown by the little gold boarder in the champions tab of your client).\n\nYou don't need to win the game, you don't need to be level 5. \n\nAlready having the hextech chest for Garen is the most likely answer to this. Check to see if this is the case.\nThe only other thing I can think of is that if you have recently been punished for your behaviour in-game (not saying you have), it [excludes you from being able to earn hex tech rewards for a lil while](http://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/57wOcrmh-if-you-are-ineligible-for-hextech-loot-read-here-for-info-on-becoming-eligible-again?).\n\nIf neither of these things are the case and you are sure you have got an S rank with Garen, come back and comment and i'll see what else I am able to find out ♥","replies":[{"poster":"Grimoire0","date":"2016-05-12T00:18:52.775+0000","up_votes":1,"down_votes":0,"body":"Thank you for your comment. It seems that my problem is that my Garen already receive his chest meanwhile my Diana, Talon and Volibear didn't. But I'm pretty sure I never receive a chest with Garen wtf riot. Thanks anyway. Have a nice day~","replies":[]}]}]}