{"poster":"GigglingAngel","date":"2015-02-04T09:06:52.282+0000","title":"@Riot: Balancing Heimerdinger","subforum":"Gameplay","up_votes":22,"down_votes":16,"body":"As a longtime player and fan of Heimerdinger, I can say right now that the professor has issues in his kit.  The main problems fall within his turrets and his passive.  One's too strong (turrets), and the other is hardly noticeable (passive).  Let's not waste any time, and dive right in on how I think these two can be fixed!\n\n\n***~The Turrets~***\n\nA major complaint I usually hear is how \"brainless\" you can be to play Heimerdinger effectively.  I can partly see as to why that is.  \nHeimer has little control over his turrets, currently.  Very little.  Yet, he has a ton of damage potential by simply laying them out.  What they hit, besides champions, is usually not controlled, at all.  This causes a lot of people to think that Heimerdinger is a mindless champion that requires no effort, *which should be the last thing he is.*\n\nWhat, then, can be done to fix this?  I believe the answer is rather simple:\n**A target/marking system.  Give Heimer complete control over his turrets.  Make them 100% dependent on him (and by extension, the player).**  \n\nWhat this means is that the turrets *won't do anything* unless Heimerdinger directs them to attack a specific target.   In order for him to direct his turrets, he'd \"mark\" a target with an auto attack.  \n*This \"mark\" would appear the moment Heimer begins the animation of an AA at the target (not when it hits, that'd be too long).  It will last for 5 seconds before going away, and it can be refreshed during or after that time.*\n\nOnce the target Heimer wants the turrets to attack is \"marked\", the turrets would attack the marked target when in range until the mark is gone, the target is destroyed, the turret is destroyed, or Heimer puts out another mark.\n\n*What this would cause about:*\n1. If an enemy is within a turret's range but is not marked, the turret will *not* attack it.  This would force Heimer to be active in what he wants done. \n2. Heimer will be forced to get within AA range to mark a target, thus causing him to take meaningful risks.  (He wouldn't be able to stay safely behind his turret pool the whole time.)\n3. This would stop a lot of damage potential for Heimer players who are not active in battles, thus help alleviate unfair situations for the opponent.\n4. This would cause Heimer to be extremely cautious of positioning with both him and his turrets at all times (even more-so than he is now).\n5. When a tower is marked, the turrets will not fire the beam, even at full charge, since it would do nothing. In order for the beams to be fired, Heimer would have to mark an enemy that the beams would normally affect.\n\nIf an enemy champion is in a turret's range but I want the turret to hit a minion, it should hit a minion.  If I want my turrets that I put under towers to hit a tower, I want them to hit that tower.  If I want the turrets to ignore minions and focus entirely on who/what I target, I want them to do just that (Heimy support, for example).\n\nThis is a double-edged sword that I believe would greatly help balance out Heimer.  It's a major nerf in some cases, yet it's a major buff to what should be rewarded to those who know what they are doing.\nPS: For clarity's sake, make the beam range a 2nd line of a different color.   It's currently invisible, and that's sometimes bothersome.  It's also doubly more important when going into this next part.\n\n***~The Passive~***\n\n\nCurrently, Heimerdinger's passive is nothing but a healing aura, one that is hardly noticeable.  In short, it's *really* dumb, and past Riot decisions on champion updates agrees with this (Sona's auras, for example).  It needs to be changed.  It's only relatively useful in early game for healing pokes against his turrets.  It's slightly more useful as a Heimer support, but again, that role is difficult for ADCs without the implementation of my plan on the marking system.\n\nIt's true power, in the past, was that it could heal towers.  With that effect gone, the passive is useless after early game. \nHow can we change his passive to have a similar effect to what it has now, yet have a noticeable impact?  I'll give you a hint: \n*The name of the passive would change from \"Techmaturgical Repair Bots\" to \"Techmaturgical **Shield** Bots\".*\n\nFirst, let's look at the 2nd tier towers in Summoner's Rift.  They now form shields around themselves and allies close to them after being left alone for a while, growing a certain amount over time while close to the tower and deteriorating when out of the towers range.\n\nNow, let's look at Heimer's turrets.  Specifically, let's look at the ones that are apparently not doing anything either because they are not in range of a mark or Heimer has not put out a mark.  Now, instead of looking at these turrets as dead weight, let's look at them as if they are in a \"Defensive Mode\".\n**Their energy pool for the laser beam would still be growing, and once it is full, Heimer's passive will kick in if the laser isn't being fired. That passive is a growing shield, similar to the new 2nd tier tower.**\n\nHeimer's turret could begin growing a shield the moment the laser bar is full (albeit smaller than the one the 2nd tier tower does, by about 1/3), yet isn't being fired.  \nThat turret can share its shield with Heimer (when he's in range of it) and anyone within Heimer's range of the current passive (to a lesser degree). \nThe more turrets that are in this \"Defensive Mode\", the more shield Heimer and his allies will obtain, with 3 full shields being around the same as 2nd tier tower's full shield.  \nHowever, the moment the turrets exit \"Defensive Mode\" to fire their laser or lose their shield from being damaged, the shield around Heimer and his nearby allies rapidly deteriorates by the amount that turret gave, similar to how being too far away from the 2nd tier tower will cause you to start losing the shield, but on a faster scale.\n\n*What this would cause about:*\n1. Heimer would have more options on playing either offensively with his turrets' power or defensively with the turrets' shield.  This especially helps in late game when the turrets are currently one shot in teamfights a lot of the time by still having a use for the team, even though they aren't doing damage.\n2. More strategy would be available to Heimer besides \"let turrets destroy things 'till they die.\"\n3. This would give Heimer some breathing room since he has to \"mark\" an opposing champion before the turrets begin attacking 'em.  By trading some offense, he'd be able to have the effect his passive tries to do now, but better.\n4. This would make support Heimer (which currently *can* be a thing) into a *very viable* thing, with the ability to either give him and his ADC a small shield or an offensive wall that doesn't automatically fight the ADC for CS.\n5. If none of the turrets are in this Defensive Mode, *then Heimer's passive will not do anything.*  This would push players into playing more balanced to make use of the passive.\n6. Just like the 2nd tier tower's shield, it doesn't regenerate immediately after being hit.  It only regenerates when you aren't hit for a while.\n\nFinally, all of this (new turret system and passive) would give Heimer *much needed control* than his current system of \"lay down turrets, and let them do all the killing.\"\n\nLet me know what you think.  Hopefully this can help solve a lot of problems people have with Heimer by reducing his overall damage while giving more options for rewarding good strategy and plays.\n\nEdit: Cleaned it up a bit.","replies":[{"poster":"Riot Sweet","date":"2015-02-04T23:27:59.358+0000","up_votes":14,"down_votes":0,"body":"I'm curious why the downvotes here. Even if the suggestion isn't the best direction I'd love to see people respond with why they disagree instead of writing it off altogether.","replies":[{"poster":"5G8Nri0B54","date":"2015-02-05T00:22:35.049+0000","up_votes":13,"down_votes":1,"body":"You just pinpointed the main issue with downvoting.\n\nYou don't have to even think or explain your disagreement. You don't even need to read. You just press the down-arrow button because you don't like the champion and move along.","replies":[{"poster":"GigglingAngel","date":"2015-02-05T00:45:02.195+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Ginga,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=00040002,timestamp=2015-02-05T00:22:35.049+0000)\n>\n> You just pinpointed the main issue with downvoting.\n> \n> You don't have to even think or explain your disagreement. You don't even need to read. You just press the down-arrow button because you don't like the champion and move along.\n\nMaybe we can make this a challenge and aim for 10 downvotes.  It's obviously not going to get upvotes, so might as well get a high number somehow, and then add the Rioter's comment as an icing of irony.","replies":[{"poster":"5G8Nri0B54","date":"2015-02-05T01:13:39.163+0000","up_votes":1,"down_votes":0,"body":"As you wish my giggling angel!\n\nThat -1 is from me! ","replies":[{"poster":"GigglingAngel","date":"2015-02-05T01:14:17.354+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ginga,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=0004000200000000,timestamp=2015-02-05T01:13:39.163+0000)\n>\n> As you wish my giggling angel!\n> \n> That -1 is from me!\n\nJoy.\nlol","replies":[]}]}]}]},{"poster":"InSingedWeTrust","date":"2015-02-05T02:46:43.678+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Riot Sweet,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=0004,timestamp=2015-02-04T23:27:59.358+0000)\n>\n> I'm curious why the downvotes here. Even if the suggestion isn't the best direction I'd love to see people respond with why they disagree instead of writing it off altogether.\n\nAs a Plat Heimer main (~200 ranked games total to date) I both like and dislike certain aspects of his proposed changes.  \n\nAs Heimer, the proposed targeting system would be nice in a 1v1 situation, but it'd turn into a disaster when a gank happened. What happens when Elise uses her repel? Or someone goes out of vision? Or Heimer's auto animation is too slow to efficiently retarget midfight? It has some redeeming qualities though, especially not having to auto-push a lane for example. It's a double edged sword, but honestly the current Heimer is the same. Also worth noting; one of the appealing qualities to Heimer, as a Heimer main, is the finesse required in order to gank successfully. A lot of people don't realize you can't just run in, guns blazing, and kill Heimer like you can against most other champions. It requires a small bit of planning and coordination with your laner. There are already more avenues than there should be to accomplish this such as the squishy nature of his turrets, or the fact that they can be smited, most notably with the AoE trailblazer smite. I'll touch a bit more on this later.\n\nThe proposed turret change I can say I LOVE, it more solidifies his role as a siege champion and overall makes a lot more sense than the small bit of health regen he supplies his team with. While I've learned to take advantage of the new base health changes (banner + zzrot gives heimer 100 hp/5) and the fact that his passive regen was added into his base, I love this proposed passive a lot more. \n\nMy personal issue with Heimer and something that is shared almost universally by Heimer players is how squishy his turrets are. Most people complain that Heimer can sit back and \"push forever\" and you have to expend generous amounts of mana to even clear his turrets but that is a lie. Heimer's turrets early game are more squishy than minions and can be cleared most times by a single spellcast. Not to mention most champions auto attack ranges are LONGER than the turret basic attack range. This is the main reason Heimer has been forced from mid lane and turned into one of the many \"cancerous\" top lane/mid lane rejects that melee mains hate.  I would love if Heimer's turrets gained a % of his bonus health, MR, and armor. This would open up more build paths rather than the hated \"get ganked, die, but always take someone with me\" playstyle most people see him as. A viable tanky/utility based Heimerdinger alternative would be amazing and synergize a lot more with his kit, IMO. \n\nAnother issue is the near uselessness of his ult into his rockets or grenade. There are very few situations in which you'd ever UPGRADE your W or E over your turrets. The rockets are overall unreliable unless you land the slowest skillshot in the game perfectly in order to stun them. The grenade upgrade, while useful for an AOE CC in a teamfight, doesn't do enough damage for the tradeoff of the damage you'd be missing from not upgrading the turret. A small damage buff, or even letting the CC/damage stack from the bounces would help.","replies":[{"poster":"Riot Sweet","date":"2015-02-05T03:26:01.346+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=FirstTimeSinged,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=00040006,timestamp=2015-02-05T02:46:43.678+0000)\n>\n> As a Plat Heimer main (~200 ranked games total to date) I both like and dislike certain aspects of his proposed changes.  \n> \n> As Heimer, the proposed targeting system would be nice in a 1v1 situation, but it'd turn into a disaster when a gank happened. What happens when Elise uses her repel? Or someone goes out of vision? Or Heimer's auto animation is too slow to efficiently retarget midfight? It has some redeeming qualities though, especially not having to auto-push a lane for example. It's a double edged sword, but honestly the current Heimer is the same. Also worth noting; one of the appealing qualities to Heimer, as a Heimer main, is the finesse required in order to gank successfully. A lot of people don't realize you can't just run in, guns blazing, and kill Heimer like you can against most other champions. It requires a small bit of planning and coordination with your laner. There are already more avenues than there should be to accomplish this such as the squishy nature of his turrets, or the fact that they can be smited, most notably with the AoE trailblazer smite. I'll touch a bit more on this later.\n> \n> The proposed turret change I can say I LOVE, it more solidifies his role as a siege champion and overall makes a lot more sense than the small bit of health regen he supplies his team with. While I've learned to take advantage of the new base health changes (banner + zzrot gives heimer 100 hp/5) and the fact that his passive regen was added into his base, I love this proposed passive a lot more. \n> \n> My personal issue with Heimer and something that is shared almost universally by Heimer players is how squishy his turrets are. Most people complain that Heimer can sit back and \"push forever\" and you have to expend generous amounts of mana to even clear his turrets but that is a lie. Heimer's turrets early game are more squishy than minions and can be cleared most times by a single spellcast. Not to mention most champions auto attack ranges are LONGER than the turret basic attack range. This is the main reason Heimer has been forced from mid lane and turned into one of the many \"cancerous\" top lane/mid lane rejects that melee mains hate.  I would love if Heimer's turrets gained a % of his bonus health, MR, and armor. This would open up more build paths rather than the hated \"get ganked, die, but always take someone with me\" playstyle most people see him as. A viable tanky/utility based Heimerdinger alternative would be amazing and synergize a lot more with his kit, IMO. \n> \n> Another issue is the near uselessness of his ult into his rockets or grenade. There are very few situations in which you'd ever UPGRADE your W or E over your turrets. The rockets are overall unreliable unless you land the slowest skillshot in the game perfectly in order to stun them. The grenade upgrade, while useful for an AOE CC in a teamfight, doesn't do enough damage for the tradeoff of the damage you'd be missing from not upgrading the turret. A small damage buff, or even letting the CC/damage stack from the bounces would help.\n\n+1 here. Cool to hear some constructive thoughts and this is pretty thorough.","replies":[{"poster":"Kowe The Ewok","date":"2015-02-05T04:39:40.589+0000","up_votes":1,"down_votes":1,"body":"I don't think what Heimerdinger needs what the open post suggested. It sounds more like a nerf like an improvement to me.\n\n----------\n\n\n**An improvement I could think about is the following:**\n\nHeimderinger's abilities loose a strength each:\n\n-  Q looses charged laser attacks\n-  W looses 2 rockets\n- E looses its stun\n\n**As a compensation cooldown and mana costs are getting reduced.**\n\n- Upon leveling his ultimate Heimderinger gains an Upgrade stack.\nUpgrade stacks can be used to unlock one of the \"lost\" features.\n- His ultimate always uses the upgraded version\n\n-----------\nThis way Heimderinger has a more balanced earlygame (less stomp or get stomped) and a buffed lategame (which is currently a big issue - especially after the DFG removal which makes E into R+W MUCH weaker than it was).\n\nAs well as adding more depths to his kit.","replies":[]}]},{"poster":"PapaShongo53","date":"2015-02-05T14:47:49.997+0000","up_votes":1,"down_votes":0,"body":"Why do Banner of Command?  I'm pretty sure the aura doesn't work on the turrets anymore.  Doesn't the lack of CDR in your build hurt when you can't keep turrets up?  Also I'm curious on your lack of Flash/Ghost.  I can kind of see why you do it in that flash generally doesn't save you since Heimer is so slow, but it if you land the stun and flash out you can get away, also the flash rockets or flash grenade can pick up kills.\n\nIs your strategy to AFK push top?  The lack of mana regen seems like you wouldn't be able to poke with rockets or fish with grenades.","replies":[{"poster":"InSingedWeTrust","date":"2015-02-05T19:35:41.802+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PapaShongo53,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=000400060001,timestamp=2015-02-05T14:47:49.997+0000)\n>\n> Why do Banner of Command?  I'm pretty sure the aura doesn't work on the turrets anymore.  Doesn't the lack of CDR in your build hurt when you can't keep turrets up?  Also I'm curious on your lack of Flash/Ghost.  I can kind of see why you do it in that flash generally doesn't save you since Heimer is so slow, but it if you land the stun and flash out you can get away, also the flash rockets or flash grenade can pick up kills.\n> \n> Is your strategy to AFK push top?  The lack of mana regen seems like you wouldn't be able to poke with rockets or fish with grenades.\n\nBanner of Command, while the passive dmg buff is no longer there on his turrets, it does a lot more for him. \n1. **A banner promoted siege minion can take down 2-3 towers if left unchecked.**\n2. **The passive MR/regen extends to Heimer's turrets, making them a bit more beefy vs AoE mages.**\n3. **The HP/MR helps Heimer immensely along with the minor CDR, and Heimer scales very nicely with HP regen.  His regen with just banner is around 70 hp/5 lategame making him deceptively tanky throughout the game.**\n\nThe lack of CDR doesn't hurt much in top lane as most top laners can't clear your turrets, and if they can they're most likely AP so banner is there to ensure they have a hard time doing so. Sometimes, if vs a high waveclear team I'll add another CDR item in but I don't find myself doing it very often. I prefer barrier/heal just for baiting purposes. As you said, flash rarely saves Heimer it's really just for re-positioning on a champion like him. While I've encountered a few situations where I could have flash+grenade+rocket combo and picked up a kill, I just find the grenade too unreliable overall. \n\nAnd yeah, the general strategy is just to AFK push top, causing immense map pressure. But if I find my team isn't capitalizing on it, I'll group up quickly and just send a banner siege minion to side lanes while we group mid.  You do have to be a bit more conservative with your mana though, which can be hard if you're not used to playing Heim.","replies":[]}]}]},{"poster":"lDontLiftIcarry","date":"2015-02-05T00:48:21.179+0000","up_votes":2,"down_votes":0,"body":"thats what happens when you give players the ability to downvote without at least clicking on the thread.","replies":[]},{"poster":"Cuix","date":"2015-02-05T00:04:11.492+0000","up_votes":3,"down_votes":1,"body":"The whole premise is flawed. Heimer's turrets are not brainless, and don't lack potential control. They're quite nuanced, and technically automated, but the player has way more agency than is being acknowledged here. So, the whole post is built on a crumbled foundation, and is trying to solve a problem which doesn't exist.","replies":[]},{"poster":"Chromatic Eagle","date":"2015-02-05T00:15:11.873+0000","up_votes":2,"down_votes":1,"body":"Gentlemen, behold! The flaw of internet comment voting!","replies":[]},{"poster":"Kowe The Ewok","date":"2015-02-05T04:37:10.732+0000","up_votes":1,"down_votes":0,"body":"Personally: I love playing Heimerdinger. But I am completely against his change. His Poll options don't offer a proper response, since I am **not** thinking that Heimerdinger is a good state right now but also disagree with his suggested change.\n\nThe turrets automatic attacking is a weakness as much as it is a strength (automatic push = vulnearable to ganks)\n\nI think the current concept is fine.\n----\n\nHOWEVER: \nI do not think that Heimderinger is fine - his turrets die extremely easy. Sometimes with a single ability. \n(Sadly many people tend to ignore his, considering it a \"waste\" to clean them by using an ability... Which is the worst mistake you can make)\nNot only that: But also Trailblazer and double stack smite CRUSH them. Fighting against a semi-smart jungler you're absolutely defenseless.\n\nHis cooldowndowns are off the charts and outdated: 24s / 11s / 18s \nThat's in absolutely in no relation to damage and cost.\n\n-----------------\n\nI don't think what Heimerdinger needs what the open post suggested. It sounds more like a nerf like an improvement to me.\n\n----------\n\n\n**An improvement I could think about is the following:**\n\nHeimderinger's abilities loose a strength each:\n\n-  Q looses charged laser attacks\n-  W looses 2 rockets\n- E looses its stun\n\n**As a compensation cooldown and mana costs are getting reduced.**\n\n- Upon leveling his ultimate Heimderinger gains an Upgrade stack.\nUpgrade stacks can be used to unlock one of the \"lost\" features.\n- His ultimate always uses the upgraded version\n\n-----------\nThis way Heimderinger has a more balanced earlygame (less stomp or get stomped)\nand a buffed lategame (which is currently a big issue - especially after the DFG removal which makes E into R+W MUCH weaker than it was).\n\nAs well as adding more depths to his kit.","replies":[]},{"poster":"Silverthane","date":"2015-02-05T03:50:08.430+0000","up_votes":1,"down_votes":0,"body":"actually a previous rioter was saying that you don't have to comment or explain or even LIKE a thread in order to downvote or upvote. he sad to simply do it which seemed kinda wrong to me. it was in one of the featured threads at the top.","replies":[]},{"poster":"5G8Nri0B54","date":"2015-02-05T01:17:40.638+0000","up_votes":1,"down_votes":0,"body":"Also, there's an issue with Heimer's Passive.\n\n\nYou guys at Riot gripe on and on and on about invisible power and such. Yet how are you okay with Heimerdinger's Passive as it currently is?! It's even worse than Fiora's in terms of interaction or thematic cohesiveness.\n\n\nHow is Heimer's Passive not the epitome of invisible power?","replies":[]},{"poster":"Nucleophilic atk","date":"2015-02-05T00:45:33.140+0000","up_votes":1,"down_votes":5,"body":"Personally, I downvoted because I hate Heimerdinger.","replies":[{"poster":"GigglingAngel","date":"2015-02-05T01:06:35.119+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=SN2 Surpriser,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=00040003,timestamp=2015-02-05T00:45:33.140+0000)\n>\n> Personally, I downvoted because I hate Heimerdinger.\n\nSo you didn't read the post regarding how something could be done to fix his kit?\nSounds legit.","replies":[{"poster":"Nucleophilic atk","date":"2015-02-05T02:43:48.953+0000","up_votes":2,"down_votes":2,"body":":D\n\nI personally don't think there is a huge problem with his kit that needs fixing lol. So, obviously I'm not going to agree with a post about \"fixing\" him lol.","replies":[]}]},{"poster":"Cuix","date":"2015-02-05T00:58:33.505+0000","up_votes":2,"down_votes":1,"body":"At least you're honest.","replies":[{"poster":"Nucleophilic atk","date":"2015-02-05T01:01:35.800+0000","up_votes":2,"down_votes":3,"body":"Always :D","replies":[]}]}]}]},{"poster":"Leti the Yeti","date":"2015-02-04T09:52:28.718+0000","up_votes":9,"down_votes":1,"body":"the risk are way too high for what he gets out of it if you force him to get close\nI can survive or rek donger WITH THE SLIGHTEST BIT OF RANGE\neven Jarvan with hs Q is enough for me to do real well against donger\n\nlets face it, his turret range is lame\nhis AA range is lame\nif he's gonna walk up to me\nhe's going to die, period\nhe will blow up just like sona, while being even less oppressive :l\nshit, that makes him trash tier cuz I wont even have to be in range of his turrets to kill him\nlook at that, free meal walking up to me","replies":[]},{"poster":"5G8Nri0B54","date":"2015-02-05T01:16:09.321+0000","up_votes":3,"down_votes":0,"body":"My only issue with Heimerdinger is just one thing.\n\n\nHe's either complete shit...or you can't push him without serious fire-power. If you have ANY way to take out his turrets either easily or in one-shot, Heimer is useless. However if you can't deal with his turrets (immobile melee without any poke or anything), there's nothing you can do against him.\n\n\nOh and, literally no one will agree his Passive is in anyway thematic, fun, or even interesting. It literally feels like it's there as a place-holder. Is it powerful? Probably. But talk about INVISIBLE POWER!","replies":[{"poster":"Hyrum Graff","date":"2015-02-05T02:43:42.761+0000","up_votes":2,"down_votes":0,"body":"Since Riot moved his passive self-regen into base regen, I love to build Regen/seige heimer.\n\nSomething like this:\n\n{{item:3020}} {{item:3157}} {{item:3089}} {{item:3065}} {{item:3060}} {{item:3512}} \n\nThrow down towers around a portal, seige for days while being way tankier than heimer should be and shrugging off all poke. And they can't even take out the portal with waveclear abilities, because it acts as a structure.\n\nOf course, the counterplay is to clear his turrets with waveclear abilities, if your team has them.","replies":[{"poster":"InSingedWeTrust","date":"2015-02-05T03:04:52.552+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hyrum Graff,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=00080000,timestamp=2015-02-05T02:43:42.761+0000)\n>\n> Since Riot moved his passive self-regen into base regen, I love to build Regen/seige heimer.\n> \n> Something like this:\n> \n> {{item:3020}} {{item:3157}} {{item:3089}} {{item:3065}} {{item:3060}} {{item:3512}} \n> \n> Throw down towers around a portal, seige for days while being way tankier than heimer should be and shrugging off all poke. And they can't even take out the portal with waveclear abilities, because it acts as a structure.\n> \n> Of course, the counterplay is to clear his turrets with waveclear abilities, if your team has them.\n\nI love this build, as it's a small variation of something I use in ranked, but I'd recommend a void staff to take advantage of his high base dmg.","replies":[{"poster":"Hyrum Graff","date":"2015-02-05T03:36:59.325+0000","up_votes":1,"down_votes":0,"body":"I went DC and Zhonya's because his turrets' HP scales with your AP, so I figured I'd make my turrets more durable. Thoughts?","replies":[{"poster":"InSingedWeTrust","date":"2015-02-05T03:44:47.453+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hyrum Graff,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=0008000000000000,timestamp=2015-02-05T03:36:59.325+0000)\n>\n> I went DC and Zhonya's because his turrets' HP scales with your AP, so I figured I'd make my turrets more durable. Thoughts?\n\nI'd remove the visage or the deathcap in place of void staff, in order to take advantage of his high base damages. If your opponents aren't really building magic resist you can do without, though. I've also been experimenting with bootless builds with the new passive movement buff of the raptor cloak/Zz'Rot.","replies":[]}]}]}]},{"poster":"Terff","date":"2015-02-05T03:03:45.757+0000","up_votes":1,"down_votes":0,"body":"nah, you just max rockets then xD","replies":[]}]},{"poster":"GhastlyGhoulMan","date":"2015-02-05T00:45:07.205+0000","up_votes":2,"down_votes":0,"body":"I honestly think this could be a good direction to investigate. Even if it's only a Rioter tweaking with this idea over lunch.","replies":[]},{"poster":"GigglingAngel","date":"2015-02-05T00:31:58.422+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=LeagueSrsBsns,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=0000,timestamp=2015-02-04T09:52:28.718+0000)\n>\n> the risk are way too high for what he gets out of it if you force him to get close\n> I can survive or rek donger WITH THE SLIGHTEST BIT OF RANGE\n\nThat's why I have his passive becoming a useful shield, so that he'd have some breathing room.\nThis would make it so that, just like every other champion, he'd only focus a champion when a good opportunity arose, not just willy-nilly.\nWith that said, since less turrets would be taken account for so this passive would be available, maybe a slight buff to the turret's HP, def, and/or damage could be given to compensate.\nI can't give exact numbers, since I don't have the tool kit to base the information off of.  I'm simply giving ideas.\n\n> [{quoted}](name=Tusutaki,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=0001,timestamp=2015-02-04T10:29:49.311+0000)\n>\n> I would say he's in a fine spot right now but I would like to see this change to be implemented. Im just worried that the risk of putting a mark is too high for the reward as you would have to micro manage your turrets position, range, and your position as well.\n\nYou already have to (on higher elos, at least).  This would just cement the need for great positioning, which Heimer is already known for by those who play him.\n\n> [{quoted}](name=Riot Sweet,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=0004,timestamp=2015-02-04T23:27:59.358+0000)\n>\n> I'm curious why the downvotes here. Even if the suggestion isn't the best direction I'd love to see people respond with why they disagree instead of writing it off altogether.\n\n\"Why take effort in doing so when you can just click once to show your disagreement?  Just because this person put a lot of thought into this idea towards a champion a lot of people have problems with, doesn't mean I need to actually contribute anything meaningful.\"\n\nI imagine that's the basic consensus to those you mention.\n\nHowever, I'd also redirect that your input would be appreciated on what you think of this idea.   What do you think works?  What do you think doesn't work?  What could be improved?  What's a good start?  Stuff like that would help me feel like this thread wasn't a waste of time.\n\n> [{quoted}](name=Cuix,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=00040000,timestamp=2015-02-05T00:04:11.492+0000)\n>\n> The whole premise is flawed. **Heimer's turrets are not brainless, and don't lack potential control.** They're quite nuanced, and technically automated, but the player has way more agency than is being acknowledged here. So, the whole post is built on a crumbled foundation, and is trying to solve a problem which doesn't exist.\n\nYes, they are.  The AI was specifically nerfed to be less intelligent on who is a priority to focus.  The only actual choice you can have when it comes to focusing a target is when you AA a champion.  (A visible mark is already put on them, exactly as I mentioned in my post.)  Other than that, who they attack is not under your control, save for the beams. \n\nIn lane, I'm finding getting CS is very luck-based.  I'm either going to get a lot because the turrets are actively hitting the ones I want to kill, or I'm going to miss a lot because they are focusing targets I don't want focused and leaving killable CS alone.\n\nWhat's more, this still doesn't change the problem that melee champions have when going up against Heimer.  About 8/10 games when I'm top Heimer going up against a melee champ, I have them stuck at their tower missing a ton of CS, because while my turrets are hitting minions, I'm continually poking them with AAs from a safe distance, safely able to ignore a lot of the minions as I harass my lane opponent.  \n\nMore-so, I find that my turrets will protect me from ganks when I'm not paying attention or when I'm not putting down wards, something the gank should be rewarded for by taking advantage of.  Yet, they do not get any benefits from my blunder.  I can literally ignore ganks a lot of the time while I harass the lane opponent and force them to B back.\n\nOf course, I'm being smart about how far I am from my turrets when harassing and making sure they are all in the correct position with full health in case of a gank, but that's still too much payoff for the amount of action being done.\n\nThat *is* mindless play.  ","replies":[]},{"poster":"Nato Boram","date":"2015-02-04T15:37:58.455+0000","up_votes":2,"down_votes":0,"body":"That's a topic with a lot of different votes, hehe.\nFirst of all, having to mark a champion with auto-attacks for turrets to attack is very very risky and just not worth at all. For my part, I suggest that the little turrets have the same [AI as the minions](http://leagueoflegends.wikia.com/wiki/Minion#AI_Behavior) with more refresh times. This way, if an enemy champion attacks an allied champion, the turrets will attack the right target. Additionally, Heimer would have a great use of controlling his turrets with Shift + Click like if they were pets. This way he would have a complete control over his turrets AND they will attack even without orders. The turret's passive could target the closest enemy champion to Heimerdinger in range.","replies":[]},{"poster":"Tusutaki","date":"2015-02-04T10:29:49.311+0000","up_votes":2,"down_votes":1,"body":"I would say he's in a fine spot right now but I would like to see this change to be implemented. Im just worried that the risk of putting a mark is too high for the reward as you would have to micro manage your turrets position, range, and your position as well.","replies":[]},{"poster":"BastionKross","date":"2015-04-06T14:17:12.439+0000","up_votes":1,"down_votes":0,"body":"I voted that he's fine but I don't mean it. There wasn't an option for \"I agree the donger needs work, but I don't like the direction of this suggestion\" so I chose the second best.\n\nThe turret marking mechanic would basically turn Heimer into a discount version of {{champion:268}}. Azir can afford to auto attack constantly in teamfights, doesn't have to worry about his soldier dying, scales with attack speed, and gets a huge bonus to his auto range when he's got a soldier in the area.\nThe donger gets exactly none of that. Any benefits that manual targeting would bring would be overwhelmed by all the painful wrench-throwing Heimer would have to do.\n\nThe turrets should have some better AI, though. There's also still a bug where caster minions, when approaching from a certain angle, can auto the turret without it being able to fight back except for the laser attack. The turrets themselves are very squishy, and you're supposed to be able to compensate for that by being able to replace them quickly, but I find that doesn't happen reliably enough early game. Putting together sufficient CDR items to get turret kits takes time and money.\nI can understand the hesitation to buff him though, he's utterly oppressive during laning to melee champions with little mobility. Then again, just about all ranged champs do that anyway.","replies":[]},{"poster":"Legacian","date":"2015-04-06T12:20:31.255+0000","up_votes":1,"down_votes":0,"body":"Just curious, I've never been able to figure out quite what your decisions were behind this. Why do the lasers from his turrets apply on-hit effects like liandry's? Is it to give him a wider variety of builds and playstyles, or just to allow him to have access to what other mages use?","replies":[]},{"poster":"GigglingAngel","date":"2015-02-09T02:55:28.420+0000","up_votes":1,"down_votes":0,"body":"So the consensus is to keep the turrets the way they are, but to go along with the passive I suggested.\nIt would be awesome to see his passive get changed to this (or something similar).  Very awesome.","replies":[]},{"poster":"PapaShongo53","date":"2015-02-05T14:25:47.928+0000","up_votes":1,"down_votes":0,"body":"I've been playing a lot of Heimer lately and find him extremely fun.\n\nI disagree with the targeting changes, this would make it too difficult to direct turrets while trying to position and use grenades and rockets, especially with spread out turrets, you might have 1 turret in range of the mark with the other 2 sitting around doing nothing.\n\nChanging the passive to some sort of shield instead of health regen I like.  Mainly because, as the plat Heimer main said, the turrets are extremely squishy.  I understand if the enemy uses a spell to clear the turret, he isn't using it on you, but they get killed by incidental AoE all the time.\n\nI'm a plat Shaco main and know when I gank a Heimer if I don't burst him instantly he's getting a double kill.  I'm starting to shift my main to Heimer but am finding that he can really only go top because of the squishy turrets.","replies":[]},{"poster":"holybluman","date":"2015-02-05T07:13:51.614+0000","up_votes":1,"down_votes":0,"body":"Well I like this but  hate it at the same time, remove the Auto aiming all together seem a bad thing to do, but what if there was a  toggle on and off the auto aim and have them attack marked player no matter what when it off or on so support heimers can not kill the creep and attack the marked player with them and turn it on when the player wants it on and there is a marking Mechanic in the game it show up as a nut over the player you just hit with your auto and I think when you have someone mark that you do %+ damage to them with your turrets when auto aim is off, And Yes the Mechanic of healing tower \"MADE\" heimerdinger the champ he was but now it gone the healing is part is left and that is not noticeable impact to the game play sure you get hp back faster but how much? basicly 2hp -> 1 sec early game and late game is 6 hp -> 1 sec Very weak, So to rework his passive will be best, ether to boost the hp reg or just a rework of it.","replies":[]},{"poster":"X Frady","date":"2015-02-05T03:55:12.789+0000","up_votes":1,"down_votes":0,"body":"I love to use Heimerdonger. I think his pathetic current passive is a good trade-off of the huge damage he can deal with his turrets in mid/late game. Also, good aimed rockets completely melt squishy mages and ADCs (I even 1HKO them when upgraded). I believe the bane of Heimer is the gap closers. Champs like Xin, J4 and LB easily bypass the turrets, kill the donger and leave unscathed, and they can also easily dodge the grenade's stun due to their huge mobility. His turrets are not that great early game either. Their range leaves a lot to be desired, even caster minions out-range them, and cannon minions completely destroy them. For me, Heimer is good as he is now, and I don't want to see him nerfed for any stupid reason anytime soon.","replies":[]},{"poster":"Cuix","date":"2015-02-05T00:13:03.494+0000","up_votes":1,"down_votes":0,"body":"His turrets are not a brainless skill. \"Turrets will prioritize Heimerdinger's attack target or enemies attacking Heimerdinger with its basic attack, and nearby enemy champions with its laser beam.\" You already can control where they hit, and even laying them out requires forethought. Hell, choosing to max Q over W requires forethought. You're trying to fix a nonexistent problem.\n\nWorse, forcing him to micro everything AND get into his pitiful auto-attack range is just bonkers. That's a huge amount of risk for no extra benefit. The only arguable gain with these changes is a shield, and even that is added complexity for both player and enemy. The only REAL problem with Heim right now is that he's a focused siege champ when most mages can siege just fine while maintaining other strengths, which is a symptom of overall champ design homogeny. Making him more difficult to use doesn't help that at all.","replies":[{"poster":"GigglingAngel","date":"2015-02-05T00:38:42.543+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cuix,realm=NA,application-id=3ErqAdtq,discussion-id=M7647yY5,comment-id=0005,timestamp=2015-02-05T00:13:03.494+0000)\n>\n> His turrets are not a brainless skill.** \"Turrets will prioritize Heimerdinger's attack target** or enemies attacking Heimerdinger with its basic attack, and nearby enemy champions with its laser beam.\" \n\nThe thing is, the bolded area is not true 100% of the time, at all.  Sometimes they do, and a lot of the time they don't.  It's very random.\nTrust me, I've played him enough to notice a lot of the time ... they will not focus what I'm focusing.  Sometimes they will ... and sometimes (especially in key moments) they won't.","replies":[]}]}]}