{"poster":"DeagMcEagle","date":"2017-02-13T20:06:05.137+0000","title":"Honor System Improvements and Rewards","subforum":"Player Behavior","up_votes":86,"down_votes":4,"body":"Greetings Summoners,\r\n\r\n{{item:3067}} About me as a person, and as a player. Skip down if you don&#039;t care, however, I feel it is a necessary evil. {{item:3067}} \r\n\r\nLike many of you, I have spent many years gaming as a hobby. As a young kid, I was fascinated by any sort of game. From traditional recess hide-and-seek, to mentally stimulating board games like Monopoly or Chess, and to digital games even as simple as Space Pinball and minesweeper on my grandparent&#039;s ancient box computer. That being said, I have never been a competitive person. I prefer to play video games for the enjoyment of it, not necessarily to win every time. I was always the kid that preferred to spend time alone rather than going out to a crazy party or nightly shenanigan-fest through downtown areas. Because of that, I devoted more time to making online friends and escaping from the stresses of reality, namely the stresses of hitting puberty and trying to find your identity and social standing during those tumultuous high school years. As I&#039;ve gotten older, however, I&#039;ve had less and less time to devote to my hobby. College, girls, work, friends, and family tends to suck every last second out of my schedule, so when I do have time to boot up League, I can hardly wait to jump into a game and escape for a while.\r\n\r\nNow, I&#039;m going to start with a short description of what I am not. I am NOT good at League of Legends. I&#039;m a Bronze 1 scrublord, that still has hardly picked a main even with over 1.2k games played, and hoping and working hard to be in at least Gold by the end of S7, we&#039;ll see if that happens or not. Probably not. Secondly, I am NOT the perfect model of what the League community should be. I will preach to my very last breath the concepts that I believe would make the community better, but that does not mean I always adhere to them. I do everything in my power to avoid toxicity, but the simple truth remains that I am as guilty of it as each and every Summoner. I&#039;m here to improve myself, and I hope that you will attempt to grow with me, and offer some input or constructive criticism to my ideas. Lastly, I am NOT here to tell you how to play the game in terms of a playstyle or strategy that I feel is superior to any other. Everyone approaches League in a different way, with a different playstyle, and that is what makes it beautiful.\r\n\r\nWhat I AM here to tell you is that the League community is (in my personal opinion) doomed if something is not done concerning the general outlook and behavior of its players. I have always taken a strong interest in the areas of sociological and psychological study, and believe me when I say that some of the things that I have witnessed being said by one human being to another over in game chat is nothing short of barbaric. These are the sorts of things that would not be taken nearly as well in a real life scenario. Telling someone to kill themselves, or that they have autism, or down syndrome, or insulting other&#039;s intelligence and MEANING it is not okay, yet people will do it without hesitation behind a keyboard. Now, here I will undoubtedly receive the counter argument that reporting a toxic player who says such things is fairly effective in having their account suspended or banned, and I would agree with you. However, as satisfying as it is to log into League and see the pop up saying that someone you reported has been banned, it does very little to address the overall problem.\r\n\r\nWhen I first got into League, I had heard that the community was overall very negative. I expected that I would get the usual, &quot;Wow you&#039;re trash kid, 1v1 me on Rust,&quot; mentality that CoD kids had back in the day. What I was not expecting was a complete strip of even the most basic ethical concepts. Telling someone to kill themselves because they fed lane is normal, and people don&#039;t even take notice of it. Blaming other people for your own blatant mistakes just so you don&#039;t feel the need to improve is legitimately the name of the game. In fact, Riot should change the name to that. From &quot;League of Legends,&quot; to &quot;League of Legend, and Everyone Else Sucks,&quot; seems appropriate to me at this point. New players entering the game, who legitimately are just trying to learn the names of the champions and how to use abilities at that point, are turned off from the game because of toxic players who have no concept of what it means to be a teammate or even just a decent person. From time to time, you will get an uplifting person who inspires you to be a better player or helps you out of a hole, but those people come once in a blue moon. So how do we fix this? Is it even possible to fix? I don&#039;t have the perfect answer, but I have an idea. \r\n\r\n{{item:3113}} Actual stuff starts here. {{item:3113}} \r\n\r\nI believe that the answer to improving the toxic community exists within the game already, however it is flawed. The Honoring system serves as a way to tell a player that you appreciate them in accordance with certain categories, teamwork or friendliness for example. Any time a player is honored, it will be added to the counter on their summoner profile. Then what? Nothing. Any time you visit a Summoner&#039;s profile, how often do you specifically check their honors? Even if you see their honors, do you really even care? And, of course the most important question, **do you consitantly take the time to honor a teammate or opponent at the end of the match?** Chances are the answer is no. I&#039;m guilty of this too from time to time, I&#039;ll admit it. Here&#039;s really what people do in the post-game lobby: Talk themselves up if they win, talk the enemy down if they lose because obviously they are the best and the enemy team was playing broken champs, those scrubs. Or they just report their entire team for feeding, which is a totally bannable offense, right?\r\n\r\nWhat needs to be implemented is a new and improved Honoring system that is completely a part of the game, not just a side activity in the event that you even remember. So what would this look like?\r\n\r\nIt needs define you as a player, much like your MMR. A person with a high Honor rating should be recognized visibly. The same way that your MMR is displayed on the loading screen through your splash border, there should be some sort of banner or feature that distinguishes you as an honorable player. This is a bit of a far shot, and most likely unrealistic, but even having distinguishable qualities on character models would be a great incentive. For example, an honorable Garen player may have a flaming sword, or a golden cape (with no gameplay changes obviously). A more realistic possibility would be an emote to flash, much like LVL 5, 6, and 7 masteries. There could be profile changes that reflect this too, for example, awards and metals that are displayed on their profiles, and also summoner icons based off of Honor rating. At the end of the season, if you are above a certain Honor ranking, much like MMR, you could be awarded skins for certain champions, like &quot;Honorable Poppy&quot; or &quot;Honorable Quinn&quot; etc. This sort of approach would make players much more likely to behave in a way that is honorable, to set them apart from others who are not.\r\n\r\nA player who has a high Honor rating will stand out, and be a role model for other players. However, what defines Honor?\r\n\r\nA player who will display Honor is a player who takes responsibility. They will admit to their mistakes, without blaming others. They will not let a past mistake dictate the rest of the game, and they will try their absolute hardest to win the game and be a useful member of the team. For example, a dishonorable person will begin to make petty excuses as to why he is losing lane, saying that the enemy&#039;s champion is &quot;broken&quot; or &quot;overpowered.&quot; They will make no attempt to adjust their playstyle, still set on the assumption that there is nothing wrong with the way that they are playing, and that any shortcomings is the teams fault, not theirs. We&#039;ve all been 30 mins into a game where the 17/0/0 enemy Darius is 1v5ing and your 0/12/0 Riven one trick Challenger smurf is screaming his head off that his team gave him no ganks, useless team, Darius has no counterplay OMG wtf Rito busted so dumb, etc, but God forbid you try and suggest that maybe he should not have tower dived at LVL 1 with no vision and half health, because then YOU&#039;RE the toxic one, and he&#039;s gonna report you, so watch out. An honorable player will take responsibility for their mistakes, and attempt to adjust their strategy to fit their team&#039;s plan. They will not rage, or complain that a champion is &quot;busted&quot; especially if they are in an unfavorable matchup. Yea, we get it, Darius stomps in low elo. That doesn&#039;t mean he&#039;s broken, it just means you&#039;re bronze. Yea, we get it, walking through a minefield of Teemo mushrooms right out of base is frustrating, but that doesn&#039;t mean Teemo should be removed from the game (even though he is SUPER annoying), it just means you need to get an Oracle Alteration. And yea, we get it, your grandma could play Annie and still get an S+, she&#039;s a braindead champ. Just buy an Abyssal Scepter and Merc Treads and try win the game, damnit. &quot;OMG NO COUNTERPLAY, STUPID CHAMP I&#039;M AFK.&quot; Like seriously? People who do not take personal responsibility for themselves do not deserved an Honor rating, and will be motivated to change their behavior and earn one.\r\n\r\nA player who will display Honor is a player who is graceful in defeat, and humble in victory. We have all experienced the 2/14/5 Yasuo who got trashed in lane and hard carried through the game to victory who goes &quot;ggez&quot; before the Nexus is destroyed. We have all played against the first time Vayne who discovered the magical world of late game Vayne and all the sudden thinks they are the next Faker. &quot;Are you guys gonna FF already?&quot; Like seriously man? An honorable player will do everything in his power to work with his teammates, and if the case is that they carried the game, they will not rub it in. They will feel good about themselves and move on to the next game. They will recognize that they could not have done it without the support of the team. In defeat, the honorable player will not blame his teammates or &quot;broken&quot; champions as stated before. They will recognize that you cannot win every game, and that losing is how you become better. In either a win or a loss, an Honorable player will rejoice in the spirit of competition, praising both teams for their efforts, and expressing their happiness to have been a contender. GG boys, WP to all.\r\n\r\nCharacteristics like these should be rejoiced in players. They should be displayed for all to see. There should be some who stand above the rest as an example of what everyone should strive for. New players should not feel as if they are alone, being constantly brought down for things that they still have yet to learn. If everyone is striving to be an Honorable player, then League of Legends would be a much, much more enjoyable game. It would attract and sustain a larger community. I for one know many people who stopped playing purely for the reason that they could not stand the toxic community. I know many people who are hesitant to even begin playing at all because they are fearful of the toxic community. They SHOULD be able to recognize players who are Honorable, who they can ask for advice and play with without the fear of being judged or made out to be a bad player, when in reality they are just learning. \r\n\r\nHere&#039;s to better times, and here&#039;s to the game we love to hate, League of Legends.\r\n\r\nLet me know what you guys think, shoot my some suggestions, etc. Thanks for reading all the way through if you did.","replies":[{"poster":"Riot Tantram","date":"2017-02-13T21:29:30.612+0000","up_votes":116,"down_votes":4,"body":"> What needs to be implemented is a new and improved Honoring system that is completely a part of the game, not just a side activity in the event that you even remember.\n\n:-)","replies":[{"poster":"elduris","date":"2017-02-13T21:41:41.749+0000","up_votes":44,"down_votes":3,"body":"This post says so little, and yet...so much. Excited to see where this goes in the future!","replies":[{"poster":"Great Muta","date":"2017-02-14T00:41:27.285+0000","up_votes":9,"down_votes":12,"body":"Been waiting a year since the last mention of it. Wouldn't hold your breath at this point.","replies":[{"poster":"KnightsKemplar","date":"2017-02-14T04:14:15.456+0000","up_votes":6,"down_votes":1,"body":"That just means it's right around the corner. TIME TO GET DAT HONOR BROSKI","replies":[{"poster":"Sraeg2013","date":"2017-02-14T16:12:26.291+0000","up_votes":6,"down_votes":0,"body":"Replay system was \"practically done\" when they announced it in like 2011/2012.","replies":[]}]}]},{"poster":"Kelly K","date":"2017-02-15T18:09:55.848+0000","up_votes":1,"down_votes":0,"body":"Are you Jesus?","replies":[]},{"poster":"TeeTohr","date":"2017-02-14T10:14:40.217+0000","up_votes":1,"down_votes":0,"body":"Do you know if Tantram is working on a team related to honor ?","replies":[]}]},{"poster":"DragonManSquid","date":"2017-02-14T00:35:08.873+0000","up_votes":13,"down_votes":0,"body":"the nose gives hope.","replies":[{"poster":"Velzard of Koz","date":"2017-02-14T12:57:54.856+0000","up_votes":1,"down_votes":0,"body":"It's the right kind of nose.\n:^)","replies":[]}]},{"poster":"52B3UJZXZo","date":"2017-02-16T07:06:54.749+0000","up_votes":2,"down_votes":12,"body":"atleast you are putting your effort into something usefulll.....like posting stupid ass emotes .....\nwhat a great employe you are.....","replies":[{"poster":"Riot Tantram","date":"2017-02-16T20:47:42.173+0000","up_votes":14,"down_votes":2,"body":"You'd be surprised how much information is conveyed in that single emote.\n\nThe others get it. Reddit got it.\n\nThanks for being a positive member of the community. Good luck on the Rift!\n\nNow, I'll get back to working on making cool stuff for players, and interacting with them on the forums.","replies":[{"poster":"Korios","date":"2017-02-16T21:15:58.846+0000","up_votes":4,"down_votes":0,"body":"Dammmmm Tantram fighting back with F I R E !","replies":[]},{"poster":"World Ender","date":"2017-02-16T22:38:33.813+0000","up_votes":2,"down_votes":1,"body":"#REKT {{summoner:11}} & {{summoner:14}}","replies":[]}]}]},{"poster":"StoryDuck","date":"2017-02-14T02:06:22.757+0000","up_votes":6,"down_votes":0,"body":"Oh, please let this be a hint of something you guys will implement soon.  I've wanted the honor system to be a meaningful thing for a long time now.","replies":[]},{"poster":"LulzMudkipzz","date":"2017-02-13T21:50:49.365+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Riot Tantram,realm=NA,application-id=ZGEFLEUQ,discussion-id=WwkXAjfx,comment-id=0002,timestamp=2017-02-13T21:29:30.612+0000)\n>\n> :-)\n\nHOLY MACAROLI I AM EXCITED","replies":[]},{"poster":"Kei143","date":"2017-02-14T00:36:44.836+0000","up_votes":5,"down_votes":1,"body":"LET IT OUT!! LET IT OUT!! LET IT OUT!! LET IT OUT!! LET IT OUT!! LET IT OUT!! LET IT OUT!! LET IT OUT!! LET IT OUT!! LET IT OUT!! LET IT OUT!! LET IT OUT!!","replies":[]},{"poster":"h5LYF41Lam","date":"2017-02-13T23:28:35.890+0000","up_votes":3,"down_votes":19,"body":"why are all riot emploees trolling on the boards lately?","replies":[{"poster":"SpecterVonBaren","date":"2017-02-14T16:08:23.363+0000","up_votes":4,"down_votes":0,"body":"Isn't that what all of us do too?","replies":[{"poster":"Hello I am Bird","date":"2017-02-14T19:17:56.704+0000","up_votes":2,"down_votes":0,"body":"######We dont work at Riot tho.","replies":[{"poster":"Fondling Gems","date":"2017-02-15T07:30:08.449+0000","up_votes":1,"down_votes":0,"body":"######Most Rioters do this in their spare time, for many of them this isn't their job, this is them being players and participating on the boards.","replies":[]}]}]}]},{"poster":"Papa Andrei","date":"2017-02-13T22:48:10.860+0000","up_votes":2,"down_votes":0,"body":"I just follow the lore and I am still excited, y u do dis rito.","replies":[]},{"poster":"Shahamut","date":"2017-02-15T21:10:42.050+0000","up_votes":1,"down_votes":0,"body":"I remember they used to have the border flags to show off high honored players, but then it stopped :/\n\nIs there going to be a revamping of this system in the near/not so far future?","replies":[]},{"poster":"WunThousandOurs","date":"2017-02-14T14:03:44.534+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Tantram,realm=NA,application-id=ZGEFLEUQ,discussion-id=WwkXAjfx,comment-id=0002,timestamp=2017-02-13T21:29:30.612+0000)\n>\n> :-)\n\nReport as spam please.","replies":[]}]},{"poster":"Hyrum Graff","date":"2017-02-14T00:31:33.955+0000","up_votes":27,"down_votes":0,"body":"http://gameinformer.com/resized-image.ashx/__size/610x0/__key/CommunityServer-Discussions-Components-Files/258/0246.wall-of-text.png","replies":[{"poster":"DeagMcEagle","date":"2017-02-15T18:28:10.719+0000","up_votes":2,"down_votes":0,"body":"I might have gotten a bit carried away ¯\\_(ツ)_/¯","replies":[]}]},{"poster":"SrbLud","date":"2017-02-13T20:13:21.995+0000","up_votes":8,"down_votes":0,"body":"I could throw my opinion in here and say where I agree and/or disagree,\nbut it would just be pointless as it's all presented objectively ( well most of it ).\n\nHonestly great job in how you presented the case.\nI hope this thread gets the attention it deserves.","replies":[]},{"poster":"RacoonHunter","date":"2017-02-14T08:23:37.213+0000","up_votes":3,"down_votes":0,"body":"Can they first get a system in place that actually punishes people? Or will I have to go through 3-5 games in a row with toxic players before the system even starts to look into player behavior...","replies":[{"poster":"WunThousandOurs","date":"2017-02-14T14:05:33.054+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Sythriel Iolas,realm=NA,application-id=ZGEFLEUQ,discussion-id=WwkXAjfx,comment-id=0010,timestamp=2017-02-14T08:23:37.213+0000)\n>\n> Can they first get a system in place that actually punishes people? Or will I have to go through 3-5 games in a row with toxic players before the system even starts to look into player behavior...\n\nIt's highly unlikely until they have a way to actually gauge a player skill level vs having a bad game.","replies":[]}]},{"poster":"Sorin Alucard","date":"2017-02-14T00:01:59.868+0000","up_votes":1,"down_votes":1,"body":"I think this may be effective on the flip side of having color indicators for summoners to see whose prone to afk, chat bans, int feeding etc, and also to lower queue priority for players who have a trend of being negative rather than bannable.\n\nYou may argue that this will increase the number of in game dodges, but imo, it would encourage players to be positive. If ppl start dodging your account until you have enough matches to lift the negative border, you might be less inclined to flip in game and troll.","replies":[{"poster":"scazzman","date":"2017-02-14T05:32:10.257+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Sorin Alucard,realm=NA,application-id=ZGEFLEUQ,discussion-id=WwkXAjfx,comment-id=0006,timestamp=2017-02-14T00:01:59.868+0000)\n>\n> I think this may be effective on the flip side of having color indicators for summoners to see whose prone to afk, chat bans, int feeding etc, and also to lower queue priority for players who have a trend of being negative rather than bannable.\n> \n> You may argue that this will increase the number of in game dodges, but imo, it would encourage players to be positive. If ppl start dodging your account until you have enough matches to lift the negative border, you might be less inclined to flip in game and troll.\n\nriot will NEVER do this. because that basically paints a target over people's heads saying \"harass me so i get reported\"","replies":[]},{"poster":"NichtHurz","date":"2017-02-14T01:13:17.870+0000","up_votes":1,"down_votes":0,"body":"I think it should be visible to the said player only. Otherwise it would lead to a kind of frustration that might not help them being a better person ingame.\nIf there was something that shows you \"Hey, hold back a lil bit or you might get banned at some point.\". This might make more people realize their mistakes. Maybe it'd be a good idea to have a bit of a delay on this one, so extremely toxic people who destroy games just for the sake of doing so and doing this frequently couldn't abuse it to safe themselves from punishment.\nJust something more than just \"Hey you've been reported quite a lot, be careful.\".","replies":[]}]},{"poster":"Anihaku","date":"2017-02-14T22:30:55.110+0000","up_votes":2,"down_votes":0,"body":"Love the proposed improvements and agree wholeheartedly.........but I honestly don't think this is a major concern for Riot.  Riot is a business and until the toxicity starves them of $$$, I doubt anything will come of it.  In the 2+ years that I have played I have never felt like Riot made this a priority.  It feels like there are far more important items on their list and I just don't see them justifying their time/$$$ to fix the broken honor system yet.  When the game's focus is not about \"money\" maybe there will be some hope.\n\nUntil that day........may the odds ever be in your favor because you will need it!\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"DeagMcEagle","date":"2017-02-15T17:48:07.156+0000","up_votes":1,"down_votes":0,"body":"I can see how this would be true with the majority of companies in the world, especially gaming companies, and I do agree with the concept. However, I personally feel like Riot (based purely off of the things that I have observed in my time playing with updates, patch notes, and content) really does care about the community, and wants to create the best possible experience for the widest possible audience. If you achieve that, the money comes on its own. Maybe it's because I'm an optimist and generally prefer to be blissfully ignorant, but why not right? ¯\\_(ツ)_/¯","replies":[]}]},{"poster":"WunThousandOurs","date":"2017-02-14T14:15:31.453+0000","up_votes":2,"down_votes":4,"body":"I would rather my honorable and skilled play be reward in more LP, even in losses. THAT'S HOW YOU HONOR GREAT PLAY!\n\nIf a player is truly better than his other opponents, going 10/1/10, or 15/3/8, or 22/9/15 give them more LP so they can actually rank up and face better competition and actually IMPROVE. There is no way to accurately gauge skill level (Ranks don't mean much in Solo Play vs Duos). In majority of games, you are basically babysitting, as countless people have mentioned.\n\nHaving a Riot employee comment on this thread just to troll and increase it's popularity is absurd. AWARD GREAT PLAY IN GAMES WITH LP!\n\nIt should be do well and rank. Not do well and hope your team don't throw.","replies":[{"poster":"Champion Skin","date":"2017-02-14T16:56:52.284+0000","up_votes":3,"down_votes":1,"body":"> If a player is truly better than his other opponents, going 10/1/10, or 15/3/8, or 22/9/15 give them more LP\n\nNo they shouldn't get more LP.... they should learn how to use/abuse their lead to close out and win the game... Winning lane doesn't do much good if you can't use that lead to win the game\n\nAnd getting more LP from getting a good score is silly... after all then you should just stand back and snipe kills with long range or global abilties... providing almost nothing to the team but you will probably get a good score and not die much\nOr getting a good score from doing well in lane as an early game champion against a late game champion but not closing out the game meaning that eventually the late game champion will get stronger anyways making the early lead almost pointless\n\nYou can be Soraka and after laning phase just sit in base with CDR items and go like 0/0/20 by just using ult to get assists from all of your allies.... look such good player no deaths and lots of assists right? Better give them some more LP","replies":[{"poster":"SaladSavior215","date":"2017-02-14T20:12:00.709+0000","up_votes":2,"down_votes":0,"body":"*cough* caitlyn *cough*","replies":[]},{"poster":"WunThousandOurs","date":"2017-02-22T10:05:24.572+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Champion Skin,realm=EUW,application-id=ZGEFLEUQ,discussion-id=WwkXAjfx,comment-id=00120000,timestamp=2017-02-14T16:56:52.284+0000)\n>\n> No they shouldn&#x27;t get more LP.... they should learn how to use/abuse their lead to close out and win the game... Winning lane doesn&#x27;t do much good if you can&#x27;t use that lead to win the game\n> \n> And getting more LP from getting a good score is silly... after all then you should just stand back and snipe kills with long range or global abilties... providing almost nothing to the team but you will probably get a good score and not die much\n> Or getting a good score from doing well in lane as an early game champion against a late game champion but not closing out the game meaning that eventually the late game champion will get stronger anyways making the early lead almost pointless\n> \n> You can be Soraka and after laning phase just sit in base with CDR items and go like 0/0/20 by just using ult to get assists from all of your allies.... look such good player no deaths and lots of assists right? Better give them some more LP\n\nI swear this gaming community is full of irrational idiots.  Your lack of experience makes you think you have to be cautious or steal kills from other players to get a good score. You don't. That is the problem with at least 80% of players on this game. You feel like you have to repeatedly fight, even when you look every fight.\n\nFirst of all, if you are just sitting at the base ulting, then you are being toxic and afking in a game. You think your sarcasm is cute and witty, but it's not.","replies":[]}]}]},{"poster":"crippled phantom","date":"2017-02-14T15:50:51.958+0000","up_votes":2,"down_votes":0,"body":"This is very well said and I agree with the idea very much. However, (and yes this is a challenge to you rito) I dont believe it can be done. \n\nI am very active in the post game screen (blocking/reporting/honoring).\n\nThis might be cringe because I'm just talking myself up, but I believe I am the pinnacle of what Riot wants from their players.\n\nI almost never say anything in chat unless it is directly encouraging (not even giving advice, just \"gj\" or \"wp\" or \"ty\" or \"nice play\" etc. I main mid and dont EVER complain about my jungler not ganking, I NEVER expect blue buff to be given to me (i dont even ask, in fact often I'll say \"yours\" when they offer it). I roam. I say mb after most deaths/mistakes (because they WERE my mistake). I even have a few times friended the person flaming me to try to come to common ground with them see how theyre doing etc. I've been playing since season 2 and have never received a punishment from riot other than the dodge warning because my laptop died/internet went out. I love the game, rarely surrender, always say \"dw we scale\" etc. Overall I am very aware that these are real people I'm playing with and I take the game pretty seriously.\n\nThe only thing I would say that I dont do perfectly is that I occasionally say \"bg, report summoner 2 for verbal/afk\" if it was indeed a bad game because of an inting/severely flaming/vastly uncooperative player. Yes I realize this is Reportable, but I still do it. I will not say gg when it was a horrible, one sided game because of a player intentionally ruining it. (I also say bg when the enemy has an afk and my team wins). \n\nAnyways, I don't think the people I play with ever recognize my pure-hearted efforts to make a positive impact on the game. I dont think there exists a possible system that would track that somehow (again Riot, this challenge is for you). It would be amazing to be recognized for legitimate kind-heartedness and humility (these are exemplified in the summoners code)\n\nbut I dont see it happening. People tend to think that losing lane (feeding) is worse than harassing your teammates constantly. They only think of themselves. People spam surrender votes/say \"gg\" in 5 min when its 2-0 in probably half of the games that I play (even some where we are winning). Players, even some of whom are adults, act like children and spam/flame/afk/int (even some of my 20's y/o friends do this and I report them sometimes too). I've seen the face of pure evil (as cringe as it sounds) from this game. Human beings treating each other in a way I couldnt perceive. To be honest, with all of the pings availible, it actually might improve the game to remove the chat function. Rarely do I see it used to better the game.\n\nAnyways (again), people will not honor others as they dont realize what being an honorable (or even half-way decent) person is. Look up the Dunning–Kruger effect, I think you'll read something familiar (not just with skill, but about being decent to others)\n\nThanks for reading if you did,\ncheers","replies":[]},{"poster":"Glu10Sensitivity","date":"2017-02-13T22:51:45.981+0000","up_votes":2,"down_votes":0,"body":"I agree that honor should be something that is constantly added to you if you behave well, however, who has the time to do it if you aren't doing it? I don't expect Riot to program a bot to sift through all of the games and manually review to add honor to people and I don't think chat filters can accurately pick up when people are typing honorably.\n\nAnyone have any suggestions on how to do it?","replies":[]},{"poster":"TheHobbits","date":"2017-02-14T06:38:34.326+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Deag McEagle,realm=NA,application-id=ZGEFLEUQ,discussion-id=WwkXAjfx,comment-id=,timestamp=2017-02-13T20:06:05.137+0000)\n>\n> Greetings Summoners,\n\nWhat the hell is a \"_Summoner_\"?","replies":[{"poster":"DeagMcEagle","date":"2017-02-15T17:43:48.604+0000","up_votes":1,"down_votes":0,"body":"Was trying to get a catchy start by appealing to LoL players but now that you say that it does seem a bit cheesy lol. I'm just a cheesy dude. ¯\\_(ツ)_/¯","replies":[]},{"poster":"Leetri","date":"2017-02-14T11:53:00.934+0000","up_votes":1,"down_votes":0,"body":"Something that Sona talks to, I think.","replies":[{"poster":"5000000000000000","date":"2017-02-14T23:51:25.262+0000","up_votes":1,"down_votes":0,"body":"And Nocturne","replies":[]}]}]},{"poster":"Hayes","date":"2017-02-15T04:45:10.886+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Deag McEagle,realm=NA,application-id=ZGEFLEUQ,discussion-id=WwkXAjfx,comment-id=,timestamp=2017-02-13T20:06:05.137+0000)\n>\n\n> \n> Let me know what you guys think, shoot my some suggestions, etc. Thanks for reading all the way through if you did.\n\nDear Mr McEagle, after my first time getting chat restricted in over 3 years of play, lemme tell you something. Your honor and player behavior reports? Yeah they are F%^King stupid. \n\nI get chat restricted for being toxic, yet people in my game who go 0-8 within the first 15 mins of the game, don't get shit? In ranked? How the holy hell is that acceptable? \n\nYou do that shit, don't play ranked, you screw 4 other people, yet me being mean to them, is somehow WORSE then them being asshats and not having any freaking clue how to play their champ?\n\nI have a saying, \"im not toxic, if you don't feed\" are we going to continue to coddle people? Maybe we should give everyone diamond participation trophies, cause they tried so hard!\n\nIm not perfect, i make mistakes, but i never , ever feed.  Hell ive had 4 people on my team with over 10 deaths by 20 mins, and that is totally fine, but when i get pissed about it, oh noes!! He's being mean! \n\nI hope these people never have to go out and find a real god dam job, cause lemme tell you, nobody out there gives a shit about their feelings, if they can't do the dam work, bye bye. \n\nTLDR: people who have a certain NEGATIVE KDA, should NOT be allowed to play ranked.  Because it screws those of us who actually are trying to get better.","replies":[{"poster":"EyesOfTheFox","date":"2017-02-15T21:59:42.948+0000","up_votes":1,"down_votes":0,"body":"Well first of all, you are in the Bronze landscape. This is by far the hardest landscape to play in. You also play a lot of jungle and support, I won't lie, combined with ADC, those are some of the hardest roles to play. I've been Bronze V with 0 LP twice this season. I even managed to make it to Bronze II then lost 11 games in a row, due to bad luck and some misplays (trying to do too much in those bad luck games). I was even in a game today where I as MF and a Talon player had words with each other, but we both ended up acknowledging that we were the only ones with kill participation not running in all gung-ho. You have to take into consideration also that autofill plays a large role in forcing these Bronze players into roles they are not comfortable with.\n\nI used to think like you and wonder why these seemingly bad players don't go to normals and play, but honestly, I found that normals aren't the same as a ranked game. Regardless of all the fails and defeats, the quality of game (imo) is better in ranked. Everyone has off days. Everyone has ping issues from time to time. Everyone gets countered at some point (curse that first pick on blue side).\n\nAs someone that suffered your fate last season and has vowed to get out of Bronze this season, may I suggest a few things...\n\nPick 1 or 2 champions and stick with them. In your game history I think you use a different champion in nearly every game. I don't even do that, Challenger level players don't even do that. I think if you stick with one or two, and really learn what those champions are capable of, you can focus more on how YOU need to play the game to put your teammates in a better position. I main MF, so people will pick Lucian because websites say he's a strong counter. I learned this the hard way, and after seeing the match up enough times, I now know how to play against it even though he is a supposed counter (it's tough, but I can make it out of the laning phase). If I just tried to play something different I never would have gained that knowledge.\n\nDon't flame your teammates. I can tell by your post that you have anger issues and get frustrated easily. Nothing makes a player play worse than someone telling them how bad they are. I know it's going to sound cliche, but focus on your job on the rift. As a marksman, it's my job to collect as much cs as I can, shoot anything that moves, and stay alive. Often times I have to play to the abilities of the random support player I get matched with. Normally I can tell how I need to lane based on what support the enemy has vs my support, and how hard they will probably push the lane. I know games that I can expect my jungler to have a rough go, or that my top laner may be gank fodder. The more knowledge I have the more educated my choices become and the more help I can be to the team. \n\nIf you get a moment of down time (during a back, or a death) let your team know what you need from them without flaming. \"Hey Thresh could you play ahead of me in the side bush?\" \"You'll be able to land those hooks better if they can't see them coming!\" You can make the enemy support burn through trinkets having to keep those bushes warded, is a plus side to having your support play from the bush just so you know.\n\nPing your shit. If you are low on mana, ping that shit. If your ulti is down, ping that shit. I've saved so many possibly bad encounters because I let my team know how I'm doing through pings. You just hit level 6, your teammate hit level 6, ping that your ult is ready. Ping your summoner spells. Ping your trinket. Ping your activatibles (not a word but it should be).\n\nDon't spam ping the missing icon over the midlaner because he didn't ping missing. You can look at the map and see that for yourself. Rule of thumb, if they aren't on the map, and they aren't dead, they are coming for you (whether they are or not, they are). I tend to push the hell out of my lane because I want their jungler to come at me bro. I know this and I am expecting this, so I have planned for this. That takes pressure off the other lanes (because you can't trust them to be prepared for that, but you can be prepared for that).\n\nI dunno man, if you have a bad attitude, and you flame, and you specifically say \"if you play bad I'm flaming\" then maybe you are the reason you lose those games whether you play bad or not, whether you think so or not.\n\nTLDR: JK Read that shit.","replies":[]},{"poster":"DeagMcEagle","date":"2017-02-15T18:30:53.445+0000","up_votes":1,"down_votes":0,"body":"So I think what you are attempting to say is that players who do not understand how to play the game should not be allowed to play the game to begin with. You presented the argument in an interesting way, I suppose.\n\nI would counter with the argument that players who do not understand how to play the game should be allowed to play the game, in order to improve, and get more enjoyment out of the game itself. \n\nFortunately, we have understanding and honorable players such as yourself that will improve the already inviting and tolerant atmosphere that exists within the community. I thank you for your cooperation my friend. ","replies":[{"poster":"Hayes","date":"2017-02-15T20:49:44.732+0000","up_votes":1,"down_votes":0,"body":"not exactly, I think they have a right to do whatever they want, in Normals or Aram, or vs AI, or Twisted Treeline normals etc....it's when you get into ranked, and are directly affecting other people and their ranking, etc...is where I have the problem.\n\nI had over 300 wins, before I even attempted to get into Ranked, why? Because I knew i was not good enough at different roles, and I wanted to be sure and not be horrible, so I didn't mess over my team mates. \n\nIm all for playing and learning to play the game right, or at least as right as you can, its the people that don't care that just YOLO everything. That upsets me.\n\nAnd I don't think that there is enough \"penalty\" for doing so, while you can't even get mad at them or you are labeled toxic, simply because you actually are trying to rank up.","replies":[]}]}]},{"poster":"EyesOfTheFox","date":"2017-02-15T20:59:38.601+0000","up_votes":1,"down_votes":0,"body":"I agree! There are times when I don't really remember who or why I honored someone, and they'll randomly show up in one of my games because I see the little green tag above their champion picture, then I a sigh of relief comes out and I smile a little, knowing I can relax because that is obviously a person I trusted because they did all the right things (stayed positive/didn't flame/helped the team/made good shot calls), even in a loss.\n\nAs someone who doesn't pass out honors willy-nilly, this would be cool to see ahead of time based on their overall honor. A sort of reassurance before we play that I can trust this person. May even help cut down on champ select/in game/post game flame. Although perhaps not for the players that have no honor to show, they may get flamed worse... but then those flamers won't receive honors so that diminishes their rewards... Deag McEagle (original discussion starter) may be on to something here...\n\nRiot also believes in rehabilitation of players that make poor choices regarding other players and the community. If those players have something to show for actually following the Summoner's Code, then maybe that's enough to help them change.\n\nPerhaps even an in game emote, as a reward for reaching certain levels of Honor, could be given to summoners. Perhaps, to prevent friends from spamming each other, you get more reward points from people that aren't on your friend list and even more from the enemy team (especially ones that aren't on your friend list).\n\nJust some thoughts, but I like where this thread is going~","replies":[]},{"poster":"RamboDash15","date":"2017-02-14T22:20:44.721+0000","up_votes":1,"down_votes":0,"body":"I'd be down for this, as long as it is implemented retroactively. I've held every honour banner at least once [teamwork twice] and I highly doubt people will still honour at the same level that they did back when I first started playing until a few months (years?) after this change is brought in.","replies":[{"poster":"Hayes","date":"2017-02-15T20:52:54.508+0000","up_votes":1,"down_votes":0,"body":"exactly, I have over 400 , teammate etc...yet nothing. There is no real incentive to honor, or do it consistently. Though I try to, except for people who troll or feed.","replies":[]}]}]}