{"poster":"Shiro equals","date":"2016-10-31T13:33:12.796+0000","title":"Biete SoloQ Coaching","subforum":"Clans & Teams","up_votes":2,"down_votes":3,"body":"Guten Tag liebe Community,\r\naus Lust und Laune wollte ich euch ein Coaching von mir f&uuml;r euch anbieten. Bevor jetzt jemand denkt: &quot; Wow super, noch so ein m&ouml;chtegern Pro, der keine Ahnung hat aber auf superclever macht und daf&uuml;r noch Geld verlangt&quot;, ich tue dies rein aus Spa&szlig; und Freude am Spiel (anders gesagt, es ist kostenlos). Ich selbst befinde mich momentan in Platin 2 (letzte Season Gold 1, da decayed durch Inaktivit&auml;t im Ranked), Season 4 Diamant 5 und damals vor langer Zeit noch tiefer.\r\nIch versuche mein Wissen bestm&ouml;glich an euch zu geben, sei es in Form von 1v1, gemeinsames spielen oder Replay-Analysen zu zweit.\r\nIch habe mich schon so gut wie jedem Champ befasst, allerdings kann ich nicht jeden Champ spielen (ich habe z.B. noch nie Ivern gespielt) oder demzufolge coachen (wobei 90% m&ouml;glich sein sollten).\r\nAuch wenn ich diesen Champ nicht perfekt beherrschen sollte, ist dies f&uuml;r mich kein Hindernis mein Bestes dabei zu geben euch zu coachen, es bedeutet nur, dass ich euch nicht alle Kniffe zeigen kann. Ich verspreche keinen sofortigen Elo-Anstieg wie z.B. Silber 3- Gold 5. So etwas braucht Zeit und Geduld, soll hei&szlig;en: Wenn ich ein Spiel von euch analysiert habe, macht ihr diese Fehler nicht automatisch nie wieder sondern m&uuml;sst m&ouml;glicherweise euren Spielstil &auml;ndern bzw. adaptieren und dies geht nicht &uuml;ber Nacht (Ausnahmen best&auml;tigen hierbei die Regel).\r\nDemzufolge wird das Coaching aus mehreren Sitzungen bestehen und geschaut wie sich das Ganze entwickelt und wo noch Probleme herrschen oder neu aufgetreten sind. Meine Bitte an euch, sofern denn Interesse bestehen sollte: Ihr k&ouml;nnt mich gerne Ingame adden, aber ich werde nicht auf euch zukommen! D.h. Ich nehme eure Anfrage an, schreibe vllt. auch ein &quot;Hallo&quot; wenn ihr gerade on sein solltet, der Rest muss allerdings von euch kommen (schlie&szlig;lich wollt Ihr etwas von mir). Zudem w&auml;re ein funktionierendes Headset super, als auch geistige Reife (niemand spielt gerne mit Dauerflamern...).\r\nZudem halte ich mir die Option offen Leute nicht mehr zu coachen (war erst einmal der Fall, hierbei war fehlende Einsicht/Lernbereitschaft der entscheidende Faktor) und erw&auml;hne noch mal, dass ich Leute, die mich einfach nur adden und dann nichts mehr machen bzw. Interesse bekunden und sich 2-3 Wochen nicht mehr melden (ohne 1. Sitzung) von mir wieder gel&ouml;scht werden um anderen Personen Platz zu bieten). Das war jetzt ziemlich viel Text und ich hoffe ich konnte euer Interesse wecken.\r\nWenn nicht, dann bedanke ich mich trotzdem f&uuml;r die Aufmerksamkeit, die Ihr meinem Thema gewidmet habt.\r\nHabt noch einen sch&ouml;nen Tag.\r\n\r\nP.S.: Ich biete kein Teamcoaching an und habe nicht vor mich irgendeinem Clan anzuschlie&szlig;en.\r\nIch spiele kein Dynamic Queue mit euch.\r\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Girl VS Nuubs","date":"2016-11-09T07:12:26.664+0000","up_votes":1,"down_votes":0,"body":"Hey sri melde mich jetzt erst aber ich würde gern ma mit dir sprechen. IGN: MinaMaus","replies":[]},{"poster":"Asteriade","date":"2016-11-01T06:55:50.901+0000","up_votes":1,"down_votes":0,"body":"Die Frage die mich interessiert ist...bietest du nur Lowelocoaching an, oder auch für Dia+ ^^\n\nIch mein, mich interessiert es nicht wenn eine Person \"Lower\" ist, aber mehr Gameknowledge besitzt.\nIch zb. habe mich mit Autopilot + rein mechanisches Spielen auf D5-D3 gespielt, weiss also, dass mein Problem, das Autopilot-Spielen  und vor allem das Macro ist. Dies kann mir auch ein HighPlatin/LowDia Spieler vermitteln welcher darin geschulter ist als ich etc.\n\nInsofern besteht da schon Interesse meinerseits. \n\n\n\n\nOh eine kleine Anmerkung:\nIch wurde bereits von einem Challenger-Spieler gecoached welcher sich auf ein Smurf geloggt hat um besser und intensiver zu coachen, wir haben alle 3 Spiele verloren... nach diesen Sessions hatte ich 1 1/2 Wochen später mein D3 peak erreicht gehabt, es war regelrecht eine Offenbarung.\nDynamicq-Coaching ist durchaus ein gutes und legitimes Mittel zum Coachen. (Als main ADC spielte er Support um mich besser beurteilen zu können)\nAber nur das am Rande. \n\n\nNa ja, tüdelü und viel Glück dir.","replies":[{"poster":"Shiro equals","date":"2016-11-01T13:57:56.165+0000","up_votes":1,"down_votes":1,"body":"Eher LowElo als Dia+, dafür denke ich persönlich bin ich nicht gut genug :D","replies":[]}]},{"poster":"FearTheWalkinCat","date":"2016-10-31T14:55:48.872+0000","up_votes":1,"down_votes":0,"body":"Hy würde das echt gerne mal mitmachen da ich weiß das ich sehr viele Fehler mache besonders was die Map angeht bin ich gelinde gesagt \"Bescheiden\". Also wenn es okay is Add ich dich kann dann hoffentlich was lernen XD.\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"mokkori","date":"2016-10-31T23:02:41.706+0000","up_votes":0,"down_votes":1,"body":"Das Coaching liegt wohl dir sehr gerne am Herzen! sehe diesen Beitrag jetzt zum 4+x glaub ich das erste Beitrag war vor 11+ Tage ö.ö\nSollten eig. mittlerweile viele bei dir gemeldet haben oder nicht? o: \nIst aber \"nicu\" wie du versuchst Leute zu helfen ^-^\n\nPS: Ja ich gurke im Forum weil mir langweilig ist :v\n{{sticker:slayer-pantheon-popcorn}} \nPS2: Beeing with locked cam in Diamond V is somehow weired right? :D\n\nSee ya and Peace out\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Shiro equals","date":"2016-11-01T13:57:25.503+0000","up_votes":1,"down_votes":1,"body":"Es liegt eher daran, wie die Leute damit umgehen, die sich melden.\nCa. 80% der Adds lösche ich nach 2 Wochen wieder, weil sich nie jemand meldet.","replies":[{"poster":"mokkori","date":"2016-11-01T14:06:05.769+0000","up_votes":1,"down_votes":1,"body":"Liegt wohl an dem Namen das die dich adden :o \nAber verständlich, wozu Platz im Freundesliste verschwenden wen die sich nicht melden :v\n\nSee ya and Peace out\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}