{"poster":"Xeport","date":"2017-12-12T04:36:24.222+0000","title":"Un buen campeon para junglear?","subforum":"Guias y consejos","up_votes":5,"down_votes":3,"body":"Busco si me pudieran aconsejar un champ que sea jungler, tanke, pero con un buen da&ntilde;o, en lo posible que sea a distancia y con buen cc para las tf tambien seria bueno que tenga movilidad para el early al gankear, da&ntilde;o en burst y dps sostenido :3{{sticker:katarina-love}} ","replies":[{"poster":"Vi Sexual","date":"2017-12-12T07:37:33.451+0000","up_votes":2,"down_votes":0,"body":"Para serte sincero, estas pidiendo algo medio tonto ( no malinterpretes) Porque pedis conceptos antagonicos en un mismo campeon, es como si te dijera \"quiero un campeon que sea full ap y full ad al mismo tiempo\". DPS y bursteo son tecnicamente lo contrario, mayormente los campeones que tienen gankeos en early muy fuertes, en tf (osea, mid-late) decaen  (a lo Lee sin, pero particularmente yo no te lo recomiendo) y tecnicamente no hay junglasviables en el meta que sean \"a distancia\" a excepcion de Graves (practicamente es melee) Ezreal (que estaba rotito en jg antes de la preseason) y...Teemo? \n\nPara SoloQ mi recomendaciones son:\n\nElise: es un tanto complicado agarrarle la mano pero practicamente carreas si te fedeas, mucho CC y podes chasear victimas.\nJarvan: es mucho mas facil que Elise, buen daño, iniciador.\nKhaZix: el bicho este esta rotito, no te lo recomiendo para ser OTP pa toda la vida, pero si lo aprovechas ahora, subisunas cuantas divisiones sin problema. No tiene CC mas alla de realentizar (la verdad creo que ni eso)\nWarwick: Tiene un hardCC en la ulti, excelente movilidad, y tecnicamente es el jungla mas facil de usar, ademas de que  tiene un sustain bestial\n\nY la obvia, Vi: 2 gap closer, 2 habilidades con CC, facil de usar (podes sacarle mucho jugo, pero basicamente es pegar la Q), se puede usar off tank, y tiene demasiado daño para ser tanky.","replies":[]},{"poster":"Russells Viper","date":"2017-12-12T04:39:15.260+0000","up_votes":2,"down_votes":0,"body":"estas pidiendo el champ perfecto,, pero diria jarvan  o rammus","replies":[]},{"poster":"Lulses","date":"2017-12-12T16:06:57.685+0000","up_votes":1,"down_votes":0,"body":"Bueno, {{champion:19}} tiene daño y mucho aguante; distancia, no mucha, es más a melee, pero su ultimate te permite saltar e inmovilizar a tu rival, además la q se puede considerar un dash si estas detrás de tu rival, y su E es un fear y su W le da buena movilidad para hacer buenos ganks.\nEs bueno, aunque como no soy bueno en la jungla, es más, soy malo, no se me da muy bien, ni ese ni cualquier campeón jungla.\nPero bueno, espero haberte ayudado.","replies":[]},{"poster":"WhiteMax","date":"2017-12-12T15:07:46.463+0000","up_votes":1,"down_votes":0,"body":"{{champion:19}}","replies":[]},{"poster":"AustinAries","date":"2017-12-12T06:40:27.249+0000","up_votes":1,"down_votes":0,"body":"Teemo jg es lo que necesitas.","replies":[]},{"poster":"Braqito","date":"2017-12-12T06:38:29.921+0000","up_votes":1,"down_votes":0,"body":"No entendí lo de distancia. Pero Elise es una bestia. Tiene\nCc\nTanke ya que los iremos de ap son los que llevan vida. Le agregas una apariencia y randuin\nSe cura y eso hace que aguante una banda en la jungla que por cierto la hace fácil \nPodes dibujar y cuando te esta por. Matar la torre pegas salto para arriba y te deja de hacer foco \n\nAl. Principio cuesta pero después vas a ser una máquina.","replies":[{"poster":"Braqito","date":"2017-12-12T06:39:21.290+0000","up_votes":1,"down_votes":0,"body":"Items de ap... El diccionario del cel la caga","replies":[{"poster":"Braqito","date":"2017-12-12T06:40:10.836+0000","up_votes":1,"down_votes":0,"body":"Donde dice dibujar es dibear jsjaja","replies":[]}]}]},{"poster":"YuumiPornstar","date":"2017-12-12T05:02:21.818+0000","up_votes":1,"down_votes":1,"body":"Un buen campeon seria Warwick, buen sustain en la jg, cc con la E/R y buena movilidad gracias a la pasiva de su W, podes armarlo tanque o FULL AD\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"SKT T1 Bank","date":"2017-12-12T10:39:05.294+0000","up_votes":1,"down_votes":2,"body":"Kalista jungla.\n\nYo lo juego, dependes mucho de que entiendas  a kalista obviamente y de que tu equipo se acuerde que esta con una version con esteroides de twich jg.\n\nAdemas tiene la contra de que cuando ulteas la gente suele escapar en vez de reiniciar.\n\nAhora si hacen minimamente eso bien, kalista jg es un carry temendo, termina deleteando a todos antes de morir, limpia bien, gankea bien y tiene kiteo natural.\n\nNo es facil de jugar pero es muy buen jg.","replies":[]}]}