{"poster":"Skaarlet Kled","date":"2018-04-23T08:26:17.029+0000","title":"LoL e Linux","subforum":"Discussioni generali","up_votes":4,"down_votes":1,"body":"Salve ragazzi! \r\n\r\nLeggevo questo post: https://boards.pbe.leagueoflegends.com/en/c/bugs/WwW6FKPR-game-client-security-changes-now-live-on-pbe e mi &egrave; venuta in mente che chi gioca a LoL da Linux (usando quindi software come Wine o Playonlinux) rimarr&agrave; fregato.\r\n\r\nPossibile che la Riot non pensi anche a quella fetta di giocatori?","replies":[{"poster":"Arutosio","date":"2018-10-28T13:31:54.544+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ByS93,realm=EUW,application-id=MJVj50Jw,discussion-id=KXwXjJBc,comment-id=,timestamp=2018-04-23T08:26:17.029+0000)\n>\n> Salve ragazzi! \n> \n> Leggevo questo post: https://boards.pbe.leagueoflegends.com/en/c/bugs/WwW6FKPR-game-client-security-changes-now-live-on-pbe e mi &amp;egrave; venuta in mente che chi gioca a LoL da Linux (usando quindi software come Wine o Playonlinux) rimarr&amp;agrave; fregato.\n> \n> Possibile che la Riot non pensi anche a quella fetta di giocatori?\n\nio sono costretto a usare windows per questa ragione. mi da tanto fastisio","replies":[{"poster":"Skaarlet Kled","date":"2018-10-29T12:01:15.956+0000","up_votes":1,"down_votes":0,"body":"Il post è un pò vecchio ma ti rispondo.\n\nDopo un periodo in cui chi giocava da linux figurava come \"utilizzatore di cheat\" dal sistema, adesso non dovrebbero esserci problemi, nè tecnici, nè in termini di legalità.","replies":[]}]},{"poster":"AthlonX860","date":"2018-04-30T16:39:52.523+0000","up_votes":1,"down_votes":0,"body":"Ho visto adesso il post. Si e no, nel senso che wine svolge il lavoro di interpretare le chiamate delle istruzioni di windows in istruzioni linux (detto molto brutto), quindi non dovrebbero esserci problemi se non i soliti legati alle direttive grafiche e alle varie configurazioni necessarie. E' da molto che desidero una versione Linux di LoL, ma è anche vero che le persone che usano linux sono in numero inferiore rispetto ad utenti mac e windows, anche se non mi è mai piaciuto il fatto che la riot abbia del tutto fatto finta di nulla davanti alle richieste dei pochi.","replies":[{"poster":"Skaarlet Kled","date":"2018-05-08T10:03:45.365+0000","up_votes":1,"down_votes":0,"body":"Capisco che i linux player siano una minoranza e che non vogliano \"perdere tempo\" per ciò, ma sarei stato più che altro indispettito se con tali modifiche alla sicurezza si fossero venuti a creare dei problemi.","replies":[{"poster":"AthlonX860","date":"2018-05-08T18:50:26.490+0000","up_votes":1,"down_votes":0,"body":"Io ho usato tempo fa (parlo di circa un anno fa), LoL su ubuntu 16.04 (perchè su mint nonostante la stessa configurazione non ne volva sapere di partire) con wine in unione a play on linux. ero molto contento, le performance calavano di poco (dovuto all'interpretazione delle istruzioni) e avevo tutto su un sistema che ritengo molto più efficente e personalizzabile di Windows 10. Il brutto arrivava ogni due settimane, ogni patch era un dover risistemare tutto da capo. Purtroppo con le distro linux è così ci si deve arrangiare e i problemi possono arrivare anche senza modifiche essenziali da parte degli sviluppatori","replies":[]}]}]}]}