{"poster":"SephArtz","date":"2017-10-29T04:50:19.722+0000","title":"PC para LoL","subforum":"Guias y consejos","up_votes":6,"down_votes":0,"body":"Hola,\r\nEstuve ahorrando para comprar un pc y jugar a +60 Fps, Tengo un presupuesto de 7000-9000 Pesos argentinos. Cual me recomiendan armar?\r\n\r\nGracias &lt;3","replies":[{"poster":"Mioen","date":"2017-10-29T05:08:29.486+0000","up_votes":2,"down_votes":1,"body":"CPU: G4400 Intel Pentium (Sexta generación) O i3 7100 si te puedes estirar.\n\nMother: H110M-H Gigabyte (Puede ser cualquier otro H110 de otra marca)\n\nRAM: 1 x Kingston 2133 MHz 8GB DDR4 o Crucial 2133 MHz 8GB DDR4.\n\nGPU: RX 550 2GB o GT 10302GB/ GTX 1050 o RX 560 2GB si te puedes estirar.\n\nFuente:EVGA 430W 80 PLUS White/XT \n400XFX 80 Plus Bronce.\n\nHDD:Toshiba 1 TB 7200RPM Sata 3\n\nGabinete: El que querías mientras soporte mientras soporte formato de la mother que elijas(Micro ATX/Mini ITX/ATX)\nSentey G18/A20 son económicos y lindos a la vista.\n\nPD: Las Ram están estúpidamente caras.\n\nPD2: Puedes elegir componentes más económicos, pero con estos puedes jugar.comodamente por un largo rato.\n\nPD3: O puedes ahorrarte comprar una fuente certificada y comprar el gabinete combo del A20 que viene con una fuente de 500w, si mal no me acuerdo. Te ahorrarás unos 500 más o menos.","replies":[{"poster":"Gatito Jugon","date":"2017-10-29T12:48:12.270+0000","up_votes":2,"down_votes":0,"body":"No seas impaciente y espera hasta diciembre/enero, hasta que lleguen los nuevos micros de intel 8va generacion coffe lake, mientras ahorras un poco mas de pesos.\nO tambien tenes amd, la gama ryzen 3 y APU funcionan muy bien","replies":[{"poster":"Mioen","date":"2017-10-29T13:22:05.730+0000","up_votes":1,"down_votes":0,"body":"Primero va a salir la gama alta, además no tiene sentido esperar tanto si solo va a jugar Lol.\n\nAdemás se espera que esta nueva generación va a llegar más cara que la anterior. Sumemos que cuando llega la primera tanda siempre tienen un sobreprecio increíble, así que tendría que esperar unos 2 meses más para que baje a su precio real.\n\nSi está dispuesto esperar hasta febrero o más para que lleguen los nuevos Pentium e I3 también vas a tener que esperar a que lleguen los mother de las series H y B. Por que por un tiempo solo va a estar la serie Z370 y son las más caras\n\nMientras tanto, esta es la opción más económica para jugar.","replies":[]}]}]},{"poster":"1v9","date":"2017-10-29T05:37:21.376+0000","up_votes":2,"down_votes":0,"body":"Con eso te compras una con WinXP y me estoy arriesgando","replies":[{"poster":"Sushi and Beer","date":"2017-10-29T07:10:36.852+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=1v9,realm=LAS,application-id=8sKIclmi,discussion-id=ha3yEWHz,comment-id=0001,timestamp=2017-10-29T05:37:21.376+0000)\n>\n> Con eso te compras una con WinXP y me estoy arriesgando\n\n{{sticker:sg-miss-fortune}}","replies":[]}]},{"poster":"Jherico","date":"2017-10-29T14:20:50.761+0000","up_votes":1,"down_votes":0,"body":"hola bro revisa compragamer, ahi te armas la pc y vas viendo los precios, pero un consejo espera a diciembre y empeza el año que viene\ncon cosas mas nuevas xq en diciembre suelen bajar por las fiestas y reyes, pero esta en vos podes juntar mas plata en estos meses\ny te compras una a 15 mil con buen micro y placa de video gamas medias","replies":[]},{"poster":"Blinding Dart","date":"2017-10-29T13:59:10.391+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=z0u6uj-KHcY","replies":[]}]}