{"poster":"Freakytii","date":"2015-03-23T22:24:07.565+0000","title":"Demoted werden.","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Gibts nen Trick damit man nicht weiter in seiner Liga aufsteigt bzw, dass man nen Lose bekommt ohne jedes mal die Champ Select leaven zu müssen. Denn ich würde gerne in meiner Liga bleiben um weiterhin mit meinen Freunden spielen zu können","replies":[{"poster":"Djerun90","date":"2015-03-24T00:43:55.602+0000","up_votes":6,"down_votes":0,"body":"Moment mal, Leute!\nIhr redet gerade davon, dass ein Spieler seine Ranked Games absichtlich mit einem troll-Build stompen soll, nur damit ER weiterhin mit seinen Kumpels zocken kann?\nDas ist ja mal sowas von unter aller Kanone! Denkt ihr auch mal daran, wie vielen anderen Spielern ihr dadurch die matches versaut und deren Aufstieg verzögert? Das Ligen-System hat schon seinen Sinn, weil es dafür sorgt, dass Spieler mit ungefähr den gleichen Fertigkeiten in ein Match gepackt werden.\n\nWenn DU also um so vieles besser bist als deine Kumpels und an ihnen vorbeiziehst, dann solltest du dich mal fragen, warum das so ist. Du solltest dich eher fragen, wie du IHR Spiel verbessern kannst, damit sie aufsteigen, anstatt dir Gedanken zu machen, wie du UNTEN bleiben kannst. \n\nLeague of Legends macht nur dann Spaß, wenn jeder im Team sein bestes gibt und ernsthaft spielt!\n\nDjerun90","replies":[{"poster":"Bulmas Mum","date":"2015-03-24T10:05:28.299+0000","up_votes":1,"down_votes":3,"body":"Schon mal daran gedacht das der fehler am System selbst liegt?! \nWäre wesentlich effektiver mal das Ranked System als Ganzes zu überdenken - Denn meiner Meinung nach stimmt es hinten und vorne nicht! \nEr könnte sich natürlich wie die Millionen anderer Gamer einfach nen Smurf bauen und neu anfangen - Denn das ist ja genau das was einem das System vorlegt! Das Problem was du oben schilderst existiert bereits zu genüge - und im Game schreiben einen beim einloggen schon leute an...push your account etz.... Egal wie oft man die auch meldet es kommen immer wieder neue! \n\nDie züchten dann die brut an Trolle die du so schön schilderst! \nAber dagegen wird grundsätzlich nichts getan - alles wird stets und ständig nur schön geredet in dem Dekadenten Forum hier!\nWenn man mit guten Argumenten Meckert dauerts auch nicht lange bis ein grüner kommt und seine vorgefertigte Meldung schiebt.","replies":[{"poster":"MeMyselfandBaal","date":"2015-03-24T11:01:28.880+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alpenjodler,realm=EUW,application-id=Wj1wcocU,discussion-id=EG7LEWyG,comment-id=00040000,timestamp=2015-03-24T10:05:28.299+0000)\n>\n> Aber dagegen wird grundsätzlich nichts getan - alles wird stets und ständig nur schön geredet in dem Dekadenten Forum hier!\n> Wenn man mit guten Argumenten Meckert dauerts auch nicht lange bis ein grüner kommt und seine vorgefertigte Meldung schiebt.\n\nJetzt bin ich gespannt: was sind deine guten Argumente? Bis jetzt hast du nämlich nur Probleme genannt und keine Lösungen... und Elo Boosts gibt es in dem Moment, wo du Belohnungen für Ranked Erfolge einführst. Wenn du die abschaffst, wird wahrscheinlich auch das Interesse am Eloboosten zurückgehen.\n Smurfs wird es immer geben... sei es einfach nur, damit man seine schwächeren Rollen unter echten Bedingungen trainieren kann... da gibt es auch nichts dran auszusetzen. Wenn ich wirklich ADC lernen wollen würde, würde ich auch über einen Smurf Account nachdenken, denn ich bin halt \"höchstens\" ein Gold V ADC...\nDa ist es egal, ob das in einem Ligensystem funktioniert, oder so wie vorher nach der eiskalten Elo-Zahl. Wenn du gute Argumente hast (die es bestimmt gibt) und ein Alternativsystem vorschlagen kannst, dann mach das bitte.","replies":[{"poster":"Bulmas Mum","date":"2015-03-24T19:18:43.016+0000","up_votes":2,"down_votes":3,"body":"Das Hauptproblem liegt daran das sich Riot mit ihrem gesamten System nur an den 1% pro Playern orientiert.\nNaja ok ...sagen wir den oberen 10% \n\nDadurch ist das gesamte System eben für alle restlichen 90% an Spielern ungerecht gemacht. \nWenn man sich die Grafiken mal genau ansieht wird man feststellen das die Mehrheit im Bronze + Silber-bereich spielt.\nLeute die im gold + Platin bereich sind stehen schon über der Norm.\n\nSpieler stoßen an ihre Grenzen wodurch sie sich kaum noch bewegen und dadurch meist Smurfen beginnen.\nViele Spieler schaffen bestimmte Hürden und haben angst davor wieder zu fallen - weshalb sie das direkte gamen mit ihrem Main einstellen und nur noch 1 mal im Monat sowas ein Game spielen um nicht mehr zu fallen. \n\nDadurch das sie Smurf Accounts erstellen erschweren sie den unteren ränge Spielern ein direktes weiterkommen.\nEs gibt ja immer diese aberwitzige Rechnung....wenn alle trolle sind und du keiner musst du zwangsweise steigen?!\nStimmt! \nAber die selbe Rechnung gibt es mit Smurfs umgekehrt auch...wenn man selbst kein Smurf ist ist die Chance höher das im Gegnerteam einer ist! \n\n**Lösungen sind schwierig! **\nMein Vorschlag wäre das System von Grund auf zu ändern!\nIch habe auch nicht alle antworten... aber das Forum lässt eine Diskussion von Verbesserungen kaum zu! \nWeil es eben zu viele hier gibt die das System auch wenn es fehlerhaft ist vehement verteidigen wollen! \nUnd Leute mit guten Vorschlägen gleich kaputt macht eher diese überhaupt argumentieren können! \n\n**Ranked: (Smurfs und generelle Probleme)**\nReden wir doch einfach mal darüber......was könnte man verändern um Smurfs entgegenzuwirken?\nIch persönlich denke mal das es einfach Schwachsinn ist das man fallen kann!\nWürde man nur steigen und nicht fallen...so würden manche extrem weit kommen wärend andere eben durch looses langsamer voran kommen würden. Würde auch den Leuten wärend der Saison nichts anzeigen wo sie sich befinden! \nSie müssen nicht wissen was sie sind und wo sie sind! - Das würde motivieren einfach weiterzuspielen mit den mains.\nEgal wo man gerade ist. Weil man dann als Main die Motivation hat am ende der Saison einen bestimmen bereich gemeistert zu haben.\nDadurch würde kaum noch jemand Smurfen. Zudem würden weniger Leute abgewertet bzw Gemoppt werden aufgrund ihrer momentanen Division! \n\nDas einzige Problem an meiner Idee ist.....dann würden Leute die öfter spielen als andere am ende wahrscheinlich positiver da stehen.\nWo könnte man dieses Problem jetzt wiederum lösen? \nWichtig ist auf jedenfall mal das niemand seine elo und division weis! - und auch niemand den anderen durchleuchten kann! \nDie Leute sollen einfach vertrauen und spielen ohne hemmungen zu haben.\nViele sind auch in ihren promos angespannt und spielen dann gleich anders - versauen in ihrer aufregung sich die promos und anderen die games. Merke es selbst das ich in normals wesentlich entspannter spiele und es wesentlich bessere Games dort gibt als in ranked.\nDas liegt daran das niemand weiß wo er ist etz... und es niemand so ernst nimmt! \n\n**Normals:**\nFrüher waren normals lustiger als jetzt - heute dienen Normals größtenteils als Sammelbecken für gesperrte Ranked Accounts!\nDiese Leute wollen um jeden Preis gewinnen und sind meist großkotzig und unverschämt. Möglicherweise verlängern sie ihre Sperre?!\nAber es betrifft mich nicht! - Also warum sollte ich als Normal Gamer der aus Grund von Spass spielen will, jetzt darunter leiden das diese Leute hier jetzt sind und sich wie die Axt im Wald verhalten nur um schnell wieder Ranked spielen zu können und ihren Unmut nun an den ganzen normal Spieler die nun mal nicht so gut sind (sonst würden sie vielleicht ranked spielen?!) auslassen?\n\n**Ban System**\nWie bereits erwähnt sind die Bestrafungen zur zeit eine Bestrafung für andere Spieler! Nicht für die bestraften selbst! Für die sicher auch aber andere müssen darunter leiden! Man kann wegen jeden scheiß reporten oder reported werden. Pick Zilean oder Bard. Wenn du dann noch einen gesperrten hast der e schon angepisst ist weil er normals spielen muss und dann auch noch verliert weil du eben diese champions pickst und ausnahmsweise wirklich kein gutes game hattest (kommt ja mal vor!) wirst du fixx reportet. \nWenn du Gegner voll zerlegst und die angepisst sind weil sie keine chance hatten und wegen dir das game verloren haben- wirst du ebenfalls reportet! \n\n**Forum**\nDas Forum und die grünen sind permanent in einer Abwehrhaltung!\nWeiß  ja nicht woran es liegt?! möglicherweise haben die Leute einfach zuviel geschimpft und es haben sich die Fanboy Community zur pflicht gemacht alles negative sofort im keim zu ersticken und gar nicht mal ansatzweise darüber zu diskutieren was nur förderlich wäre um Verbesserungen zu erzielen die langfristig das Game besser gestallten könnten","replies":[{"poster":"Sirrkas","date":"2015-03-24T19:36:46.152+0000","up_votes":1,"down_votes":0,"body":"Ich würde ja gerne mit dir ausführlich über deine Ideen reden, allerdings bin ich heute schon viel zu lange im Forum unterwegs, deswegen werde ich mich kurz fassen. \n\nReports alleine führen zu keinen Strafen. Nur wer wirklich sehr oft gemeldet wird und zudem negatives Verhalten zeigt, erhält eine CR oder RR. \n\nEine Rangliste bei der jeder nur aufsteigen kann ist keine Rangliste mehr. Alle fühlen sich vielleicht gut, aber wenn jeder der wenigstens 100 Spiele gemacht hat auf Gold ist, ist die Bewertung mit Gold gleichzusetzen mit, er ist Bronze. Er hat einfach nur Rankeds gespielt. Ranglisten machen mehr Sinn, wenn sie zeigen, wie gut man im Verhältnis zu anderen ist.","replies":[{"poster":"Bulmas Mum","date":"2015-03-24T20:02:06.867+0000","up_votes":2,"down_votes":1,"body":"Gibt Zich spiele deren Ranglisten kein Fallen erzeugen und welche doch gut funktionieren! Da einfach am ende die Endzahl gewertet und danach resettet wird. Das diese Rangliste nicht funktioniert beweißt doch der frust der mehrheit die sich im Bronze - Silver bereich befindet! Diese Leute melden sich jedoch kaum zu wort weil sie genau wissen das ihre momentane Division gegen sie verwendet wird um ihre Meinung im keim zu ersticken! \n\nFrag doch mal die Leute außerhalb des Forums  - die sich im Bereich der Mehrheit befindet!\nDu wirst sehen das ich recht habe! \n\nReport strafen - und zwar alle anderen!","replies":[{"poster":"Gorantharon","date":"2015-03-25T11:47:51.412+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alpenjodler,realm=EUW,application-id=Wj1wcocU,discussion-id=EG7LEWyG,comment-id=000400000002000000000000,timestamp=2015-03-24T20:02:06.867+0000)\n>\n> Gibt Zich spiele deren Ranglisten kein Fallen erzeugen und welche doch gut funktionieren! Da einfach am ende die Endzahl gewertet und danach resettet wird. \n\nDas ist aber einfach nur ein Progessionssystem, das nur Vielspielen belohnt und eben keine echte Rangliste.\nAber nenn doch mal ein paar, deren System soviel besser sei.\n\n> Das diese Rangliste nicht funktioniert beweißt doch der frust der mehrheit die sich im Bronze - Silver bereich befindet! \n\nEigentlich ist es ein Beweis, das die Liste ganz gut funktioniert. Silber ist mittlere Spielstärke, da sollten dann auch die meisten sein.\n\nDie Topspieler werden etwas mehr aufgefächert, als die schlechtesten in Bronze V, aber willst Du wirklich eine 200 Spieler Altmetall \"Ihr seid der Müll!\"-Liga?\nNur damit die Zahlen symmetrischer sind?","replies":[{"poster":"Sirrkas","date":"2015-03-25T12:11:45.125+0000","up_votes":1,"down_votes":0,"body":"Naja, die Bronzespieler würden sich wahrscheinlich besser fühlen, wenn es noch eine Holz/Plastik/Buntblech-Liga unter ihnen gäbe. Aber die Leute die da drinnen landen, wären richtig sauer.","replies":[{"poster":"Bulmas Mum","date":"2015-03-25T14:17:23.780+0000","up_votes":1,"down_votes":1,"body":"Ne aber wenn sie nicht wüssten das sie Bronze sind! \nWenn niemand wüsste wo er wäre dann wäre er besser und es würde weniger Penisvergleich flames geben!","replies":[{"poster":"Andrej553","date":"2015-03-25T14:44:41.299+0000","up_votes":3,"down_votes":0,"body":"Was hast du immer mit deinem \"wenn niemand es wüsste...\".\n\nWenn es niemand wüsste wäre es keine Rangliste und damit die Diskussion ob man die Rangliste dazu ändert obsolet. Denn es eigentlich eine Diskussion darüber ob man sie abschafft. Und das kann ich mir bei einem eSport Spiel beim besten Willen nicht vorstellen.\n\nAnstatt eine Lösung zu bringen die keine wirkliche ist, bei der man auch bereits auf den ersten Blick sieht dass es genauso schwere Probleme hat und dazu aufruft diese zu lösen, sollte man sich lieber noch mehr Gedanken über das erste System machen.\n\nSmurfs sind imo kein Problem. Diese Spieler sind sehr schnell dort wo ihr main ist und rennen dann gegen die selbe Mauer. Zig Accounts auf 30 spielen nur um sich kurz geil zu fühlen werden wohl die wenigsten machen.\nEher ein Problem sind die Smurfs die \"nicht selbst\" gespielt werden sondern zum elo boosten verwendet werden. Dies zu beweisen ist aber natürlich sehr schwierig.\n\nNormal-Draft Wwang für ranked flamer, korrigiere mich bitte falls noch andere diese Strafe bekommen, haben doch auch eine Chat restriction oder nicht? (ich spiele fast nur Blind mode, draft dauert einfach zu lange)","replies":[]},{"poster":"Gorantharon","date":"2015-03-26T11:41:41.382+0000","up_votes":1,"down_votes":0,"body":"Gäb's trotzdem.\n\nDann wird halt wegen der Champwahl geflamt, oder man macht sich drüber lustig, wie \"leicht\" der Gegner in der Lane zu besiegen war, oder über die CS, oder man schreibt: \"Man bist Du scheiße. Ich spiel erst seit Gestern und Du sicher schon ewig.\" Blahblahblah.\n\nEs wird immer eine Möglichkeit zum Flamen geben.\n\nEigentlich spricht aus Dir nur der Neid, das Andere besser sind.","replies":[{"poster":"Bulmas Mum","date":"2015-03-28T08:05:01.302+0000","up_votes":1,"down_votes":2,"body":"Es gibt immer Leute die besser sind als man selbst - dann müsste man mit neid durchs leben wandern!  \nAlso ... Nein ....ich bin sicher niemanden neidig der besser ein PC spielen kann als ich! \n\nDa wäre ich eher noch den Nachbarn neidig das er in ner riesen Hütte wohnt die ihm gehört etz...\nAber das sind dann die typischen antworten der Forum Guards.\nImmer schön feste drauf direkt auf den der schreibt und das Thema selbst umgehen! \n\nEigentlich spricht aus dir .... die Argumentation neigt sich dem ende zu!\n\nBtw... in Normal wird weniger geflamed als im Ranked ... dort wird auch weniger frust geschoben als im Ranked! - Würde jetzt gerne mal das oben geschriebene analysieren und mit dem abgleichen.\nDann wäre das was du da oben schreibst auch gleich aus der Luft gegriffen! \nFlamer + Rager machen meist ihren Unmut Luft - und der entsteht nun mal dort wo man weiter möchte und die Zahlen negatives sprechen!","replies":[{"poster":"Gorantharon","date":"2015-03-28T14:46:49.829+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alpenjodler,realm=EUW,application-id=Wj1wcocU,discussion-id=EG7LEWyG,comment-id=00040000000200000000000000010000000000010000,timestamp=2015-03-28T08:05:01.302+0000)\n>\n> Immer schön feste drauf direkt auf den der schreibt und das Thema selbst umgehen! \n> \n> Eigentlich spricht aus dir .... die Argumentation neigt sich dem ende zu!\n> \n\nIch habe direkt auf Deine Wünsche geantwortet. \nDer von Dir gewollte Modus existiert effektiv schon. \n\nAber das hast Du ja lieber ignoriert, als darauf einzugehen.","replies":[]}]}]}]}]}]},{"poster":"Sirrkas","date":"2015-03-24T20:44:03.649+0000","up_votes":1,"down_votes":0,"body":"Und wie genau soll das Reportsystem die ganzen unschuldigen Spieler bestrafen? Wer nichts schlimmes getan hat, muss auch keine Konsequenzen vom System befürchten. Das ist überraschend genau und hat nur sehr wenige false positives.","replies":[{"poster":"Bulmas Mum","date":"2015-03-25T00:08:20.161+0000","up_votes":1,"down_votes":1,"body":"Habe ich doch bereits erwähnt - es werden alle die normal Draft spielen mit den gebannten Leuten bestraft. \nIch hab selbst jetzt mal ne woche kein ranked sondern nur normal draft pick gespielt um mich im Shen zu üben. \nUnd es waren fast jedes game leute mit ban dabei . viele davon im Platin bereich die das ganze game über auf silber elo spieler raufflamen wie schlecht die denn doch sind.\n\nAuf die Frage von mir warum solche leute denn nicht einfach Ranked spielen wenn sie mit den leuten hier nicht zufrieden sind kam stets die antwort: Das sie nur hier sind um ihre strafspiele zu absolvieren um wieder ranked spielen zu können! \n\nDemnach werde ich und andere die so sind wie ich.....vom system bestraft mit ranked gebannten möchtegern pros spielen zu müssen und uns durchgehen demütigen lassen zu müssen von solchen leuten.\nFrüher als es noch das Tribunal gab waren die flames in den Normal games noch annehmbar! \nEs scheint regelrecht ein flame Wettbewerb stattzufinden in den normal drafts unter den Leuten die Ihr Platin logo als indirekten Schwanzvergleich deuten wollen!","replies":[{"poster":"Marksmansitter","date":"2015-03-26T11:17:48.268+0000","up_votes":1,"down_votes":0,"body":"Wenn du den Flame nicht erträgst MUTE sie doch einfach .. ich mache es z.B. in rankeds immer wenn irgendeiner wiederholt negativ wird und dann hast du deine Ruhe .. oder du stellst von Anfang an alle stumm","replies":[]},{"poster":"Sirrkas","date":"2015-03-25T12:09:30.566+0000","up_votes":1,"down_votes":0,"body":"Wenn du von Normaldraft redest, solltest du das auch in deinen Beiträgen deutlich machen. In deinem ersten Beitrag steht nur, dass die Spieler mit RRs in Normals sind. In meinen habe ich aber noch keine solchen Spieler bemerkt, ich spiele aber meistens auch kein Draftpick.","replies":[{"poster":"Bulmas Mum","date":"2015-03-25T12:47:43.374+0000","up_votes":1,"down_votes":0,"body":"Naja ich schon - tut mir leid das ich es falsch geschrieben habe - ich meine normal draft mode. \n\nNormals selbst ist für mich kein taktisches spiel sondern hier pickt jeder was er will und spielt wie er will. \n\nNormal draft pick ist für mich eine art ranked mode der funktioniert hat bevor man alle gebannten nun dort abgeschoben hat. Dort waren die leute vorher wesentlich freundlicher und die games entspannter.\n\nWürde man hier belohnungen bekommen wie im ranked würd ich gar nicht mehr ranked spielen!\nWeil ich mir den wettbewerb sparen kann wo sich alle an die gurgel gehen!","replies":[{"poster":"Sirrkas","date":"2015-03-25T15:40:51.092+0000","up_votes":1,"down_votes":0,"body":"In den News habe ich heute etwas nettes zu den Strafen gefunden: http://euw.leagueoflegends.com/de/news/game-updates/player-behavior/design-leitlinien-zum-spielerverhalten-bestrafung","replies":[]}]}]}]}]}]}]},{"poster":"MeMyselfandBaal","date":"2015-03-24T20:18:57.346+0000","up_votes":2,"down_votes":0,"body":"Zunächst mal: Wenn Leute aus hohen Ligen nur aus Angst vor dem Abstieg auf Smurfs umsteigen, haben sie das System nicht verstanden. Denn in LoL ist es eher einfacher aufzusteigen, als abzusteigen. Allein schon weil du nach der ersten Niederlage bei 0 LP nicht sofort wieder absteigst.\nGerade dass man als Division V Spieler eine extrem schlechte MMR haben muss um in die nächste Liga abzusteigen, ist doch der beste Schutz vor Smurfs, den es geben kann. Ich muss mir als Platin V Spieler gar keine Sorgen machen, dass ich überhaupt absteigen kann, denn bevor es so weit ist, trete ich nur noch gegen Gold III Spieler an... also Gegner, die ich auf jeden Fall schon mal geschlagen habe. Ich hatte letzte Saison in Gold V eine Phase wo ich 2W-18L hatte... und bin trotzdem nicht abgestiegen... aber da fing ich langsam an, mir Sorgen zu machen...\nUnd ja, Riot hat sich bewusst dafür entschieden um den Leuten, die gerade ein für sie neues Niveau erreicht haben, die Angst vor dem Abstieg zu nehmen... Und die \"großen Saisonbelohnungen\" (Rahmen und Skins) zu verspielen, nachdem man sie ein Mal errungen hat, ist extrem schwierig.\nIn Season 3 ging das nebenbei gar nicht... was nur dazu führte, dass man jede Menge \"I dont care I cant get demoted\" Spieler in den Ver Divisionen hatte... und die haben dann einfach mal getrollt... nur um mal vorwegzugreifen, dass die nicht absteigen zu können nicht zwingend was gutes sein muss...\n\nDass man bei einer Rangliste nicht verlieren kann... das Bedeutet: am Ende ist derjenige Challenger, der am meisten spielt, nicht derjenige, der am besten ist. Und selbst der lernresistenteste Anti-Spieler, der partout jede Aufnahme von Wissen verweigert (wie ich selbst das 2 Jahre lang als nur Karma Spieler gemacht habe) wird am Ende noch dafür belohnt, dass er einfach und stur immer dieselben Fehler macht. Da ist mir ein Ranked System, das Fortschritte belohnt, lieber.\n\nDas einzige, was an der Stelle funktionieren könnte: Man kriegt seine Belohnungen nicht mehr nach der aktuellen Liga, sondern nach dem Höchststand, den man in der Saison erreicht hat... Das war nebenbei in Season 2 so. Wenn dein Elo da irgendwann einen gewissen Wert überstiegen hat, bekamst du am Ende entsprechende Belohnung (Den Siegreichen Janna Skin), egal ob deine Elo danach eingebrochen ist. DAS würde einem wirklich die Angst vorm absteigen nehmen. Aber am Ende hätte ich nur ein Gold II Summoner Icon und nicht das Gold III Summoner Icon, dass ich jetzt nicht nutze. Das Problem daran: Es würe Elo-Boosts fördern. Denn wenn du dann ein Mal das Geld ausgegeben hast um auf Diamant zu kommen, behältst du die Belohnung bis du irgendwann Perma-gebannt wirst...\n\nUnd die \"geheime Rangliste\" gibt es quasi schon. Sie nennt sich \"normal Que\"... und auch in der gibt es ein Match Making Rating, aber niemand kriegt raus, wie dein Wert dort genau aussieht. Wer keinen Bock darauf hat, sich in einer öffentlich Rangliste zu messen, kann dies einfach lassen und weiter Normals zocken... Es zwingt einen ja niemand, an dieser Wertung teilzunehmen, es soll Leute geben, die nach 4 Jahren noch unranked sind, weil sie einfach keinen Bock drauf haben...\n Was du im Wesentlich forderst, ist eine Belohnung für viele (Normal) Games auf einem Account. So nach dem Motto: Wenn du im Jahr Zahl X an Spiele gezockt hast, kriegst du nicht den \"Siegreiche-Morgana\" Skin, sondern den \"Suchtender Mundo\" Skin. Und hey, solche Belohnungen, die man aber wirklich nur kriegen kann, wenn man sich auf einen Account konzentriert, könnten durchaus interessant sein.\n\nDass die Ranked Restriction einen Einfluss aufs Normal hat, ist nebenbei einfach nicht nachweisbar. Die These, dass die Normal Draft Que jetzt verseucht ist, habe ich letztens selber aufgestellt, war mit dieser Wahrnehmung hier im Forum aber alleine. Aber die Leute können ihre Ranked Restriction nicht im Normal Blind Pick, sondern nur im Normal Draft Mode, abarbeiten, dementsprechend unwahrscheinlich ist es, dass sich in diesem Modus irgendwas verändert hat.\n\nDas Ban System: Nun ja... mach mal den Test... wieviele Threads wurden in diesem Jahr aufgemacht, weil sich Spieler daran stören, dass für sie die Normal Draft Que zur Prisioners Island verkommen ist? Einen (den habe ich selbst aufgemacht... Nur um an der Stelle mal zu belegen, dass ich durchaus auch Dinge, die Riot tut, kritisch betrachte...). Und wie viele Threads gibt es, in denen sich Leute über ihre Ranked Restriction beschweren und behaupten, dass sie ja nicht Flamen, sondern nur die Wahrheit sagen? Jede Woche mindestens einen... \nNach diesem rein empirischen Test fühlen sich schon diejenigen bestraft, die auch gemeint waren... Die einzigen, die sich regelmäßig über Ranked Restrictions beschweren und die sich auf Die Meinungsfreiheit berufen, sind die notirischen Flamer.","replies":[]}]}]},{"poster":"4 R4nd0m N008","date":"2015-03-24T10:21:13.359+0000","up_votes":1,"down_votes":0,"body":"> Wäre wesentlich effektiver mal das Ranked System als Ganzes zu überdenken - Denn meiner Meinung nach stimmt es hinten und vorne nicht!\n\nWas stimmt denn deiner Meinung nach nicht am System?","replies":[{"poster":"Bulmas Mum","date":"2015-03-25T08:20:39.614+0000","up_votes":1,"down_votes":1,"body":"Oben bereits erwähnt - größter fehler ist das Anzeigen der momentanen Elo! \nWäre besser die Leute erst am ende der Saison zu zeigen wo sie stehen.","replies":[{"poster":"Gorantharon","date":"2015-03-25T11:51:06.653+0000","up_votes":1,"down_votes":0,"body":"Für Dich.\n\nAndere mögen es eher zu sehen, wo sie stehen und wie sie sich verändern und ziehen daraus Spaß und Motivation.","replies":[{"poster":"Bulmas Mum","date":"2015-03-25T13:31:52.017+0000","up_votes":1,"down_votes":3,"body":"Der Spaß ist meist auf kosten der anderen! (Schadenfreude)\nSehe keinen Spass darin wo ich mich gerade befinde - Und finde es auch nicht als Motivation.\nGanz im Gegenteil - es würde mich mehr motivieren immer weiterzuspielen um zu hoffen wo ich am ende stehe.\nZu sehen wo man steht ist immer demotivierend - weil jeder denkt besser zu sein als da wo er ist und jeder immer seinen Leuten schuld daran geben möchte das er zb seine promos nicht gewonnen hat bzw generell in seiner momentanen Elo sitzt.\n\nUnd durch diese Demotivation entsteht Zorn der wiederum zum Trollen anregt oder auch Leuten ihr selbstbewusstsein raubt und sie dadurch noch schlechter macht!","replies":[{"poster":"Gorantharon","date":"2015-03-26T11:30:45.873+0000","up_votes":1,"down_votes":0,"body":"Ok, Kern der Sache ist: Du kommst mit Ranglisten nicht klar.\n\nDas ist kein Problem von Ranglisten, sondern ein persönliches.","replies":[{"poster":"Bulmas Mum","date":"2015-03-26T14:12:04.982+0000","up_votes":1,"down_votes":0,"body":"Hab schon ihn zich ranglisten gespielt lange vor LoL. \nWar damals viel in dota Ranglisten verschiedenster Ligen. \nDort war es jedoch nicht so dermaßen angespannt wie hier. \n\nUnd mir macht der Wettbewerb als solches auch Spass - jedoch nicht wärend den Games selbst!\nUnd dir Rangliste wäre wesentlich interessanter wenn man sie erst am ende einer Etappe (zb ende Jedes Monats) einsehen könnte. Und sich den rest der Zeit einfach dem Spielen widmen könnte ohne dabei (was leider zuviele machen) andere Spieler anhand ihrer Elo durchleuchten und in eine Schublade zu stecken. \n\nZudem ist leider durch die Rangliste alles von dieser abhängig! \nWill man eine gute Gruppe finden muss die Division stimmen! \n\nSprich: Man kommt gar nicht drum herum im Ranked zu spielen und zu glänzen um Anschluss zu finden der zu einem Passt! Was ich sehr schade finde!.....da Man spieler anhand ihrer leistung bewerten sollte und nicht ihrer Ranked solo Game Wertungen (Nicht jeder gute Teamspieler ist auch ein guter Soloque spieler und umgekehrt!)","replies":[{"poster":"Gorantharon","date":"2015-03-26T16:24:01.962+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alpenjodler,realm=EUW,application-id=Wj1wcocU,discussion-id=EG7LEWyG,comment-id=00040000000000000000000000000000,timestamp=2015-03-26T14:12:04.982+0000)\n>\n> Hab schon ihn zich ranglisten gespielt lange vor LoL. \n> War damals viel in dota Ranglisten verschiedenster Ligen. \n> Dort war es jedoch nicht so dermaßen angespannt wie hier. \n> \n\nJA, genau, Dota war nicht so angespannt. Sicher.\nDa hast Du aber Glück gehabt, denn Du warst vermutlich in einer Liga für die man sich amelden musste und die damit aus einer kleinen überschaubaren Gruppe bestand, womit sich alle immer etwas besser benehmen.\nOder meinst Du Dota2? \nDa wird genauso Wertungsflame betrieben.\n\n\n> Und mir macht der Wettbewerb als solches auch Spass - jedoch nicht wärend den Games selbst!\n\nDir machen Ranglisten offensichtlich KEINEN Spaß. Was Dir Spaß macht sind Belohnungen, wenn Du am Ende dann das Ergebnis siehst.\nDer Wettkampf selber scheint Dir aber überhaupt nicht zu gefallen.\n\n\n> Sprich: Man kommt gar nicht drum herum im Ranked zu spielen und zu glänzen um Anschluss zu finden der zu einem Passt!\n\nMit einer Rangliste findest Du doch erst recht schneller Leute nahe Deines Levels, ODER spiel Normal, da gibt's auch MMR, aber eben unsichtbar.\nSomit kannst DU aus den Dir dort zugeteilten Deine Freundesliste bauen.\n\nDas Einzige, was Normal von Deinem gewollten Modus unterscheidet, ist die Belohnung am Ende der Saison.\n","replies":[]}]}]},{"poster":"Gorantharon","date":"2015-03-26T11:37:16.539+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Alpenjodler,realm=EUW,application-id=Wj1wcocU,discussion-id=EG7LEWyG,comment-id=000400000000000000000000,timestamp=2015-03-25T13:31:52.017+0000)\n>\n> Der Spaß ist meist auf kosten der anderen! (Schadenfreude)\n\nODER man weiß einfach gern, wo man in der Relation so steht.\nIch spiele auch GO und mein Rang da hilft mir dabei faire Spiele gegen ähnlich starke Gegner zu spielen und Spiele durch Handicap anzupassen, so dass ich und meine Gegner, egal wer stärker spielt, Spass haben.\n\nWenn Du Dich nur auf die armseligste Betrachtung versteifen willst, dann mach das, aber das ist das was DU denkst und nicht alle.\nDu siehst nur die Schadenfreude und wirst unglücklich, weil DU nicht der Tollste bist und andere besser.\n\nFInde ich im Allgemeinen eine unglaublich erbärmliche Einstellung.","replies":[]}]}]},{"poster":"Veezey","date":"2015-03-25T18:09:57.574+0000","up_votes":1,"down_votes":1,"body":"Wozu dann Ranked spielen? 10 Monate spielen ohne zu wissen wo man steht. Was soll da einen motivieren?","replies":[{"poster":"Bulmas Mum","date":"2015-03-26T14:15:44.869+0000","up_votes":1,"down_votes":3,"body":"Die Tatsache das man es am ende erfährt?! \nDie Tatsache das man sich nicht runtermacht durch loses weil man nie weiß wie gut man zurzeit ist.\n\nDies zeigt sich auch in den Bemühungen der ersten 10 Einstufungsspiele! \nDort spielen alle deutlich besser - alle sind freundlich - alle geben ihr bestes - keiner rage leavt oder geht afk.\n(naja keiner....zumindest 90% der sonst so schnellen demotivierten!)\n\nUnd warum?! Weil jeder möglichst hoch sein  möchte und jeder im dunkeln tappt wo er gerade ist!","replies":[{"poster":"Veezey","date":"2015-03-26T14:36:57.535+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt. Ich will keine 10 Monate spielen müssen um zu erfahren wo ich stehe. Da macht die Rangleiste für mich einfach keinen Sinn mehr. \nIn den 10 Einstufungspielen hab ich wohl andere Erfahrungen gemacht als du. Die Leute sind da angespannter als sonst.\nWarum hast überhaupt so ein Problem, dass man wegen seinem Rang angemacht wird? Man kann die Leute einfach muten.","replies":[]}]}]},{"poster":"Sirrkas","date":"2015-03-25T12:03:56.535+0000","up_votes":1,"down_votes":0,"body":"Das macht überhaupt keinen Sinn. Wenn erst mit Ende der Saison angezeigt wird, dass man gerade Gold I ist und nur noch ein oder zwei Siege für Platin gebräucht hätte, hätte der Spieler das sicher noch versucht, wenn er es vorher gewusst hätte.","replies":[]}]}]},{"poster":"Sirrkas","date":"2015-03-24T10:37:38.629+0000","up_votes":1,"down_votes":0,"body":"Ich habe schon über ein Jahr keine Pushingwerbung mehr gekriegt. Könnte aber auch daran liegen, dass sie das nur bei Spielern unter Gold versuchen.","replies":[{"poster":"Andrej553","date":"2015-03-24T13:15:32.871+0000","up_votes":1,"down_votes":0,"body":"Bin Plat/Dia und bekomme seit Tagen random Anfragen von zig Accounts die mich mit Werbung zuspammen.","replies":[{"poster":"Sirrkas","date":"2015-03-24T18:33:51.402+0000","up_votes":1,"down_votes":0,"body":"Seltsam. Ich frage mich, wie sie ihre Werbeziele auswählen.","replies":[{"poster":"Bulmas Mum","date":"2015-03-25T08:18:59.469+0000","up_votes":1,"down_votes":0,"body":"Gar nicht die schicken Random jeden sowas - wenn du noch keins bekommen hast (glück für dich!) \nSei mal 2 minuten im suche nach Gruppe channel - dann kannst sicher sein das du bombardiert wirst mit Account Push anfragen.\n\nKomischerweise muss man die friendlist invites gar nicht mehr annehmen - hab immer wieder Leute auf Friend die ich niemals bestätigt habe die mir ihre Werbung unter die Nase schieben.","replies":[{"poster":"Andrej553","date":"2015-03-25T10:03:20.132+0000","up_votes":1,"down_votes":1,"body":"Hatte es auch schon dass ein lol Admin Account gehackt wurde und ich davon den Spam bekommen habe. Zu sehen an Lv 69 im Mouseover, 1337 wins und glaube im Profil level 1.","replies":[{"poster":"Sirrkas","date":"2015-03-25T12:06:01.725+0000","up_votes":1,"down_votes":0,"body":"Das war wohl eher kein Adminaccount. Mit den richtigen Befehlen, kann man die Daten, die der Client zeigt manipulieren. Auch Riotler sind nur Stufe 30.","replies":[{"poster":"Andrej553","date":"2015-03-25T13:48:47.489+0000","up_votes":1,"down_votes":0,"body":"Nun, dagegen spricht, dass ich diesen Summoner nie angenommen habe. Das selbe ist einer Freundin vor ein paar Tagen passiert.","replies":[]}]}]},{"poster":"Sirrkas","date":"2015-03-25T12:04:49.795+0000","up_votes":1,"down_votes":0,"body":"Dann liegt es wohl daran, dass ich nicht mehr in solche Channels gehe.","replies":[]}]}]}]}]}]}]},{"poster":"Schmitter","date":"2015-03-23T22:30:45.187+0000","up_votes":4,"down_votes":0,"body":"Wäre reuden wenn nicht","replies":[]},{"poster":"Groath","date":"2015-03-24T16:24:31.550+0000","up_votes":1,"down_votes":0,"body":"Falls du bereits an dem Können deiner Freunde arbeitest, sie dabei unterstützt, besser zu werden und es einfach etwas dauert, kannst du leider nur noch queue dodgen. Dies führt dazu, dass dir eine Niederlage zugeschrieben wird, ohne, dass du das Spiel von 9 weiteren Leuten kaputtmachst. Das kannst du immer dann ein Mal tun, wenn du mit dem Spiel deine Promotions gewinnen würdest. Somit werden die Promotions als verloren gewertet und du bleibst in deiner Liga.\n\nAllerdings ist die bessere Wahl - wie Djerun90 bereits gesagt hat - deinen Freunden dabei zu helfen, besser zu werden. Sie werden sich freuen, dass du ihnen hilfst und ihr werdet rundum mehr Spaß daran haben, zusammen zu spielen. Wenn deren Ziel es gar nicht ist, besser zu werden, sollten sie auch keine Rankeds spielen. Diese sind da, um sich mit anderen zu messen, aus Fehlern zu lernen, zu triumphieren, besser zu werden und aufzusteigen.","replies":[{"poster":"Bulmas Mum","date":"2015-03-25T08:23:09.693+0000","up_votes":1,"down_votes":0,"body":"Das bringt aber nichts! Da dein Hidden MMR gleich bleibt. \nDas würde dann bedeuten das du für den Win wahrscheinlich 3 mal soviele punkte bekommst wie deine Freunde! \nZudem kommt noch das dein Hidden gegner für dich sucht, wodurch deine Freunde dann durch dich gegen zu starke Gegner spielen müssen und automatisch versagen auf deren lanes!","replies":[{"poster":"Groath","date":"2015-03-25T10:01:10.591+0000","up_votes":1,"down_votes":0,"body":"Klar bringt es etwas. Das Einzige, das er will ist, rankeds mit seinen Freunden zu spielen. Und das Einzige, was ihn davon abhält ist seine Liga, nicht seine MMR. Wenn seine Freunde in Bronze sind und er kurz vor Gold steht, kann er seine Promotions dodgen und somit in Silber 1 bleiben, um mit seinen Freunden weiterspielen zu können. \n\nWas du meinst ist wahrscheinlich, dass es ökonomisch einfach wenig Sinn macht, da er bald alle 3 Spiele ein Mal dodgen müsste.","replies":[{"poster":"Sirrkas","date":"2015-03-25T12:02:45.632+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist auch, dass man die Promotion überspringen kann, wenn man deutlich bessere MMR hat als die aktuelle Division. \n\nDas haben sie glaube ich auch gemacht, weil einige Spieler in Bronze geblieben sind, indem sie die Promotions dodgen aber schon längst auf Platin- oder Goldniveau waren.","replies":[{"poster":"Groath","date":"2015-03-25T12:12:32.910+0000","up_votes":1,"down_votes":0,"body":"Hmm, das ist dann natürlich unvorteilhaft. Es bleibt dann tatsächlich nur das Aufsteigfen zusammen mit seinen Freunden.","replies":[{"poster":"Sirrkas","date":"2015-03-25T12:25:09.232+0000","up_votes":1,"down_votes":0,"body":"Rankedteams gingen natürlich auch. Da dürften keine Begrenzungen für die Ligen gelten.\n\nMan muss aber genug Mitspieler haben.","replies":[{"poster":"Bulmas Mum","date":"2015-03-25T13:35:07.717+0000","up_votes":1,"down_votes":1,"body":"Das wäre die beste Möglichkeit! Alles andere wäre nicht wirklich Sinnvoll!","replies":[{"poster":"MeMyselfandBaal","date":"2015-03-25T14:38:44.055+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Alpenjodler,realm=EUW,application-id=Wj1wcocU,discussion-id=EG7LEWyG,comment-id=0008000000000001000000000000,timestamp=2015-03-25T13:35:07.717+0000)\n>\n> Das wäre die beste Möglichkeit! Alles andere wäre nicht wirklich Sinnvoll!\n\nÄhm... für dich vielleicht. Aber du kannst halt so nicht für die Allgemeinheit reden. \n\nAch ja, und die Ranglisten, in denen man nicht absteigen kann... ich kenne 2... Mass Effect 3 und Dragon Age Inquisition. Dort stehen im wesentlich die ganz weit oben, die den Online Teil des Spiels am meisten gespielt haben. Der wesentliche Unterschied: Beide haben keinen combetativen Anspruch. Deswegen ist es auch kein Problem, dass da einfach nur der größte Nerd ganz oben steht...\n\nSobald du aber eSports betreibst (und de facto ist Solo Q Spielen Wettbewerb und damit Breiten-eSport... dass es das mal geben würde...), musst du auch damit leben, dass du immer geranked sein wirst und in deiner Liga auch absteigen kannst. Und wer damit ein Problem hat... soll's lassen, man muss an dem ganzen Spaß ja nicht teilnehmen, wenn es einem zu viel Stress ist, dass man \"absteigen\" könnte...\n\nUnd Riot hat sich halt für das Ligensystem entschieden, weil man in diesem den Fortschritt eines Spielers innerhalb eines Jahres besser nachvollziehen (und sich als Spieler realere Zwischenziele setzen) kann. Das ist sicher nicht die einzige Lösung und vielleicht auch nicht die beste... aber sie ist auf jeden Fall besser, als die Spieler 12 Monate lang im trüben fischen zu lassen...\n\nWillst du dir eigentlich mal vorstellen, wie das Forum an dem Tag, an dem die Ergebnisse bekannt gegeben werden, eskalieren wird... weil die Hälfte der Spieler natürlich davon ausging, dass sie viel besser sind als Bronze und Silber... Gucke einfach mal nach, wie die Tage nach dem Reset waren, als jeder seine Placements gemacht hat... da gab es jeden Tag haufenweise \"OMG, warum habe ich so viele Ligen verloren, ich war doch vorher Gold V\" Threads... Die würden dann alle an einem Tag kommen und zu einem riesigen Shitstorn führen... hey, das ist für mich echt ein Pro Argument, auf diesen Tag würde sich der Zyniker in mir irgendwie freuen...","replies":[]}]}]}]}]},{"poster":"Gorantharon","date":"2015-03-25T11:54:42.233+0000","up_votes":1,"down_votes":0,"body":"Die Wartezeiten für wiederholtes Dodgen werden auch echt lang. \n\nAusserdem ändert Dodgen die MMR nicht, wenn er also weiter aufsteigt, wird er irgendwann schon fast zwangsaufgestiegen.","replies":[]}]}]}]}]}