{"poster":"Reynard the ƒox","date":"2015-05-08T04:27:03.609+0000","title":"TSM getting smashed by SKT T1","subforum":"Esports","up_votes":9,"down_votes":6,"body":"Today is a happy day.","replies":[{"poster":"Lugg","date":"2015-05-08T04:45:06.020+0000","up_votes":3,"down_votes":0,"body":"TSM looked like Bronze noobs today. Probably the worst I have ever seen them over an entire day. Santorim didn't show up at all. \n\nIf TSM wants to actually have a shot at Worlds, they have to completely change their strategy. They can't leave Dyrus on an island up top against great teams. They will abuse it non-stop and snowball to victory every time.","replies":[]},{"poster":"Only Play Darius","date":"2015-05-08T05:02:08.905+0000","up_votes":2,"down_votes":0,"body":"Yea, SKT's games today were brutal. Complete obliteration, no other way to put it.\n\nStill would rather see UOL with their unpredictable and cheesy yet outstanding picks and strategies.","replies":[]},{"poster":"Trídent","date":"2015-05-08T04:59:05.831+0000","up_votes":2,"down_votes":0,"body":"Was hoping SKT would get a pentakill... \nfor a mystery skin ;c","replies":[]},{"poster":"hi hav a gud day","date":"2015-05-08T04:32:56.575+0000","up_votes":3,"down_votes":1,"body":"freesm, bjerg get shit on kid.","replies":[{"poster":"Lugg","date":"2015-05-08T04:42:14.055+0000","up_votes":1,"down_votes":1,"body":"Bjerg actually was winning his lane until his team imploded.","replies":[{"poster":"hi hav a gud day","date":"2015-05-08T04:43:42.641+0000","up_votes":2,"down_votes":0,"body":"its so easy to afk farm as ziggs, that doesnt mean you are winning or contributing anything to your team, get shit on bjerg","replies":[{"poster":"Lugg","date":"2015-05-08T04:57:25.211+0000","up_votes":1,"down_votes":1,"body":"Yeah, let's just ignore the fact that Bjerg out farms 99% of the people he faces regardless of what champion he's on. Why all the hate towards him? Did he steal your girlfriend or what?","replies":[{"poster":"hi hav a gud day","date":"2015-05-08T05:01:08.851+0000","up_votes":2,"down_votes":2,"body":"while bjerg was farming cs faker was farming champions with the rest of his team, which do you think contributes more","replies":[{"poster":"Lugg","date":"2015-05-08T16:54:24.668+0000","up_votes":2,"down_votes":0,"body":"Bjerg is one of the best roamers in the world. It was just a bad game. I would like to see them do a best of five.","replies":[]}]}]}]},{"poster":"64931067_DEL","date":"2015-05-08T05:12:13.305+0000","up_votes":1,"down_votes":0,"body":"Faker wander around the map to help his team while Bjerg try to clear his lane, and give no help at all.\n0 assist as a Ziggs, what a shame...","replies":[{"poster":"Lugg","date":"2015-05-08T16:53:25.661+0000","up_votes":1,"down_votes":0,"body":"Hard to get assists when your team isn't killing anybody.","replies":[]}]}]}]},{"poster":"Aozora","date":"2015-05-08T10:40:25.493+0000","up_votes":1,"down_votes":0,"body":"Today is a happy day for the team representing our region to not preform?","replies":[{"poster":"Reynard the ƒox","date":"2015-05-09T16:10:24.214+0000","up_votes":1,"down_votes":0,"body":"When that team is TSM, it absolutely is.","replies":[]}]},{"poster":"Pucking Purrfect","date":"2015-05-08T05:27:18.724+0000","up_votes":1,"down_votes":3,"body":"Says C9 fanboy.\n\nSKT would do the same thing to your shit tier team so no worries.","replies":[{"poster":"Vixanys","date":"2015-05-08T05:29:01.393+0000","up_votes":3,"down_votes":3,"body":"The salt is real. Someone get this guy a salt shaker so he can clean up after himself.","replies":[{"poster":"LeBlanc Jameś","date":"2015-05-08T19:45:53.487+0000","up_votes":1,"down_votes":0,"body":"Someone get this guy a salt shaker so he can clean up after himself?  What does that even mean?  How does one clean up after himself with a salt shaker?  I am very interested in this concept o.O","replies":[{"poster":"Vixanys","date":"2015-05-08T20:07:46.050+0000","up_votes":1,"down_votes":0,"body":"Salt Shaker to put his salt in? Hence the clean up?","replies":[{"poster":"LeBlanc Jameś","date":"2015-05-08T20:20:38.754+0000","up_votes":1,"down_votes":0,"body":"If I were to spill salt I would not look nor accept a salt shaker to clean it up with.","replies":[{"poster":"Vixanys","date":"2015-05-08T21:01:06.891+0000","up_votes":1,"down_votes":0,"body":"Who said it was spilled?","replies":[]}]}]}]}]}]},{"poster":"GForce9x","date":"2015-05-08T13:58:45.165+0000","up_votes":1,"down_votes":0,"body":"It was rough watching that game.  I pretty much knew that SKT was going to do really well and win.  I just had no idea that TSM would look that awful.  Some of my friends and I made a bet as to how long it would take for Dyrus to give up first blood.  Don't get me wrong - I love TSM, but top lane is usually the area that receives the least amount of attention in their games and unfortunately it makes Dyrus look worse than he really is.  Santorin actually did commit some time to helping out at top, but it seemed like every time he did, bot would get wrecked.  The jungle is where the game started to get out of control.\n\nAnd then on top of that, TSM seemed to start playing the same way that my silver elo friends and I tend to play.  See enemy champ, go after enemy champ, crap their entire team is over there but we had no vision.  TSM was caught either overextending or over committing time and time again and it was just really depressing to watch because the team that played in this game yesterday was definitely not the team I've been accustomed to seeing.\n\nBjerg actually did well in his 1v1 matchup - not just from a farm standpoint but he was winning out in a lot of his trades and almost got a couple of solo kills to no avail.  But as already mentioned, all that will not matter if the rest of the team implodes.\n\nHopefully they will bounce back today.  I honestly don't see anyone besides SKT taking the tournament, but I would like to see them make it to the playoffs and possibly play Fnatic again (although chances are if they do make the playoffs, it will be the 4th seed and they'd get paired with SKT again).","replies":[]},{"poster":"Lord Yunii","date":"2015-05-08T05:59:03.958+0000","up_votes":1,"down_votes":0,"body":"Today my TSM vs SKT wet dream came true.  Today is a happy one, my friend.  Cheers","replies":[]},{"poster":"PoisonedTea","date":"2015-05-08T05:00:19.511+0000","up_votes":1,"down_votes":0,"body":"You acting like noone else got smashed by SKT as well. SKT smashed every team.\nAm I surprised yes but it wasn't out of the realm of possible. Could just mean they are just on top of the first day.","replies":[]},{"poster":"KazaLyn Shao","date":"2015-05-08T04:34:00.332+0000","up_votes":1,"down_votes":0,"body":"By getting you mean got.  TSM didn't have a prayer.  They had no game plan, every gank was countered, Dyrus couldn't figure out how to ward his lane or even play mechanically correct, Wild Turtle and Santorim may as well have not have existed, and mid lane was the only lane that had any real results, but the jungler took care of that.","replies":[]}]}