{"poster":"ICE SpinnAttack","date":"2019-12-04T01:49:56.420+0000","title":"My Permaban","subforum":"Player Behavior","up_votes":3,"down_votes":9,"body":"My account has been permabanned for a while do to the past me being uh how do i put it, toxic. i really do think that second chances should be given after the ban. i was a stupid kid back then. i spent hundreds of dollars on this account and im in SERIOUS trouble rn cause parents found out about that banned account. i really dont want all the effort i put into that account to go to waste. filing tickets has gotten me no good responses. please i need some kind of hope that i can get my account back. i need help please. i need this account back, ive already gotten screamed at and slapped by my friend who bought me some skins on that account.","replies":[{"poster":"MagicFlyingLlama","date":"2019-12-04T02:02:33.478+0000","up_votes":4,"down_votes":0,"body":"You get a second and a third chance _before_ the ban, way too late now.\n\nMaybe this should be a lesson on how there actually are consequences for your actions sooner or later.","replies":[{"poster":"ICE SpinnAttack","date":"2019-12-04T03:00:48.822+0000","up_votes":1,"down_votes":1,"body":"yeah i guess im still the same stupid kid","replies":[]}]},{"poster":"Arammus","date":"2019-12-04T01:58:23.448+0000","up_votes":4,"down_votes":0,"body":"sorry to tell you but a permaban is permanent unless it was given out by mistake.\nalso these are the boards, 99% here are players like you and me, we cant do anything.\n\nwhile im not here to question if your angry parents/friends is you being honest or not, maybe you should talk with your parents and tell your friend that he can fuck off\n\ni have over 40 ps2 games, most of them prob costed me 50-60€. and i never played 35 of them ever again. \nits not a waste of money. i enjoyed them a lot. but technically they are also \"gone\"","replies":[{"poster":"ICE SpinnAttack","date":"2019-12-04T03:00:27.738+0000","up_votes":1,"down_votes":1,"body":"yeah i guess its just upsetting that because of my stupidity and childishness now i dont get to see how far i got with that account, it really sucks haha","replies":[{"poster":"Arammus","date":"2019-12-04T03:20:54.387+0000","up_votes":1,"down_votes":0,"body":"yeah it sucks. i feel your pain i also lost my first acc to being toxic. and i still am from time to time. not enough to get permabanned, usually going from chat restriction to \"being clean\" again but yeah.","replies":[]}]}]},{"poster":"rujitra","date":"2019-12-04T01:58:39.822+0000","up_votes":4,"down_votes":3,"body":"What do you call the chat restrictions and the 14 day ban? How many \"second\" chances do you get?","replies":[{"poster":"ICE SpinnAttack","date":"2019-12-04T02:59:01.056+0000","up_votes":1,"down_votes":1,"body":"yeah i guess ur right lol im pretty dumb","replies":[]}]},{"poster":"SumGuy0009","date":"2019-12-04T02:46:23.664+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ICE SpinnAttack,realm=NA,application-id=ZGEFLEUQ,discussion-id=zjfs0TWJ,comment-id=,timestamp=2019-12-04T01:49:56.420+0000)\n>\n>  ive already gotten screamed at and slapped by my friend who bought me some skins on that account.\n\nAs for your permaban, you definitely got more than a second chance from Riot, usually the game starts you with chat restrictions and then goes to 14 day and then eventually  you get slammed with a permaban, in fact you had 4 chances to reform yourself but you obviously failed.\n\n_**--Edited by Moderation--**_","replies":[{"poster":"ICE SpinnAttack","date":"2019-12-04T02:58:38.117+0000","up_votes":2,"down_votes":1,"body":"its not that i spent their money without consent its just that theyre pissed that the money is gone forever. but i get what you mean... it really is my fault and i shoudlnt have been so childish.","replies":[{"poster":"GatekeeperTDS","date":"2019-12-04T13:01:54.045+0000","up_votes":1,"down_votes":0,"body":"The money was gone forever anyway. You exchanged money for entertainment, same as going to a movie, sports game, or concert.","replies":[]}]},{"poster":"Jikker","date":"2019-12-04T15:16:46.961+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SumGuy0009,realm=NA,application-id=ZGEFLEUQ,discussion-id=zjfs0TWJ,comment-id=0003,timestamp=2019-12-04T02:46:23.664+0000)\n>\n> As for your permaban, you definitely got more than a second chance from Riot, usually the game starts you with chat restrictions and then goes to 14 day and then eventually  you get slammed with a permaban, in fact you had 4 chances to reform yourself but you obviously failed.\n> \n> _**--Edited by Moderation--**_\n\nHey,\n\nWhile you do offer some helpful information here, there were some parts of your comment that were more uncivil and unhelpful which violate the [**Player Behavior Guidelines**](https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/OjEUxbwH-player-behavior-rules-update).  I've gone ahead and edited those parts out.\n\nIf you have questions about this edit, feel free to contact the team via:\n\n* The [**NA Boards Discord**](https://boards.na.leagueoflegends.com/en/c/community-moderation/7rtKBZLi-boards-moderation-discord-verification)\n* The [**Discuss the Boards**](https://boards.na.leagueoflegends.com/en/c/community-moderation) sub-board\n\n{{sticker:poppy-wink}}","replies":[]}]},{"poster":"ICE SpinnAttack","date":"2019-12-04T22:07:50.578+0000","up_votes":1,"down_votes":0,"body":"Welp i guess this thread was pointless, i just was desperate. Sorry for wasting time i just was really hoping that i could get it back.","replies":[{"poster":"Yin Yang Taoist","date":"2019-12-05T04:23:32.684+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ICE SpinnAttack,realm=NA,application-id=ZGEFLEUQ,discussion-id=zjfs0TWJ,comment-id=0005,timestamp=2019-12-04T22:07:50.578+0000)\n>\n> Welp i guess this thread was pointless, i just was desperate. Sorry for wasting time i just was really hoping that i could get it back.\n\nGetting your account back is impossible. If they make an exception for you today, there's going to be 10, 000 guys out there knocking on the boards _tomorrow_. \n\nAlthough I can't help you get back your banned account, I can offer you a possible solution as far as your parents and friends go. If your parents are unhappy about the banned account, do something that'd make them _happy_ or cheer them up. Pick some flowers for your Mom, help Dad out with some car washing. I don't know! Just, do stuff that'd make them smile! I'm sure that they'll forgive you for it. \n\nAs for your friend, tell him that you're sorry and you've learned your lesson. No one comes down knowing everything, we all make mistakes. He may be angry for a while but you just need to make it up to him. \n\nPs : Don't ask for money for your new account anytime soon. Haha! Or that'd get you in trouble again. Good luck OP! I hope that things work out for you.","replies":[]}]},{"poster":"BIítzcrank Bot","date":"2019-12-04T04:55:25.720+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-kiko}} I have some most wonderful news! Skins and champions are all the more easier to obtain, even without the need of RP.\n\nUnfortunately permaban means just that, permanent. The good news is, you've learned your lesson, and will turn over a new leaf and be a positive force on the side of justice! With this new vision of yours, you can help us keep the league community cleaner, and more positive, and as competitive as ever!\n\nIt is unfortunate about the account though. If it makes you feel better, I'm sure more than half the community has lost their first account by now!","replies":[]}]}