{"poster":"FullMetalKen","date":"2015-09-14T05:16:28.376+0000","title":"Neuer Streamer","subforum":"Streams & YouTube","embed":{"description":"Lol Rankeds Barbie + Ken Testing","url":"http://www.twitch.tv/fullmetalken","image":"http://static-cdn.jtvnw.net/jtv_user_pictures/fullmetalken-profile_image-ef08db7a7dfc522a-600x600.jpeg"},"up_votes":1,"down_votes":1,"body":"\nWer bin ich ich bin Pascal 24 Jahre alt und komme aus dem kleinen Ort Saarbrücken\n\nIch habe sehr viel Spaß am Streamen und hoffe darauf das ich reich und berühmt werde (Spaß bei Seite)\nich möchte eine kleine Com aufstellen aus deutschsprachigen Usern die sich an meinem Stream amüsieren\n\nSpeziell  freu ich mich auf deutschsprachige User da mein Englisch nicht wirklich gut ist\n\nSoweit Stream ich täglich fast rund um die Uhr , werde aber noch feste Zeiten einplanen\n\nStreame erst seit einer Woche und bin recht unerfahren aber hoffe auf die Hilfe der zuschauer\n\nmeist nur Duo Q oder Teamrank im 3o3 spiele nebenher auch hots \n\nIch spiele was ich kann sollte es zur meta passen gut ändert sich diese werde ich meinen weg beibehalten\n\nDas dürfen sich meine zuschauer gerne aussuchen sollte sie fragen haben und die fragen häufen sich werde ich auch gerne mal den erklärbär spielen\n\nHalt nur meine eigene Sichtweise ,diese ist zwar nicht perfekt aber wer ist das schon\n\nMusik wechselt sich ab aus allen bereichen etwas auf wunsch auch gerne mal ein gepostetes lied\n\nDa ich den Chat sehr gut sehe werde ich auch mit den zuschauern reden \nMeist handelt es sich um das spiel sollte jedoch themen an den tag kommen die intressant im chat sind werde ich auch versuchen dazu mich zu äußern\n\nich bin kein über pro werde das auch nicht sein ich bin eher die mittelschicht aber bei mir speziell intressiert mich mehr der User \n\nwir sehen uns auf den Richtfeldern","replies":[{"poster":"Firerider","date":"2015-09-14T08:15:09.997+0000","up_votes":1,"down_votes":0,"body":"Schlechte Vorstellung, damit reizt zu niemandem zum zuschauen, 1/10 wouldn't watch\nlg Fire Rider","replies":[]},{"poster":"Patter91","date":"2015-09-14T06:21:02.901+0000","up_votes":1,"down_votes":0,"body":"> Hallo User!\nErst einmal Respekt, dass du dich der schweren Arbeit des Streamens annimmst! Würde nicht jeder schaffen.\nJedoch wird dein Eröffnungspost deinem Stream bestimmt nicht gerecht. Um es grob auszudrücken: das ist lieblos hingerotzte Scheiße.\n>\n> Du solltest dich immer folgende Fragen fragen:\n> * Wer bist du?\n> * Warum möchtest du streamen? Was erhoffst du dir davon?\n> * Was ist deine Zielgruppe?\n> * Wie sind die Streamzeiten? Gibt es überhaupt geregelte Zeiten oder nur dann, wenn du gerade Lust hast?\n> * Wie lange streamst du schon, wie viel Erfahrung hast du?\n> * Welche Modi spielst du? Spielst du auch andere Spiele?\n> * Welche Positionen spielst du? Oder versuchst du gar, das Meta aufzubrechen?\n> * Setzt du mehr auf Erklärungen oder mehr auf Entertainment?\n> * Für den Erklärungsfall: welche Referenzen hast du?\n> * Wird Musik gespielt und wenn, welche?\n> * Wie ist es um die Interaktion mit den Zuschauern beschaffen?\n> * Behandelt dein Stream nur das Spiel oder gehst du auch auf allgemeine Themen ein, wie bspw. Politik?\n> * Was hebt dich von den unzähligen anderen Streams ab?\n\n> All diese Fragen sollten nicht erst auf Nachfrage geklärt werden, in einer guten Vorstellung sind die Antworten bereits enthalten.\n> Ebenso sollte diese Vorstellung auch textlich schön ausgestaltet sein, dies signalisiert echtes Interesse.\n> \n> Anmerkung: textliche Ausgestaltung heißt NICHT, einfach nur stichpunktartig zu arbeiten.","replies":[]},{"poster":"FullMetalKen","date":"2015-09-23T09:38:43.936+0000","up_votes":1,"down_votes":1,"body":"Push","replies":[]}]}