{"poster":"Water","date":"2016-02-05T03:53:14.302+0000","title":"Dc'd in one game constantly.","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Okay, my internet was fine and dandy and it has nothing to do with my internet.\r\nSo I played a previous game as Jhin and everything was fine. \r\nHowever, my next game as Jhin, I was at champion loading screen and Bard wasn&#039;t loading and was having trouble connecting. I was there for about 5-7 minutes so I decided to reset my client. I opened my league champion loading screen and no one else was loading with me so I presumed it was just a game bug. I was then stuck at 92% so I decided to close the game AGAIN. and I reset it and finally went into the game, 11 minutes in. After this, it was around the 23~25 min mark that I ONCE AGAIN DC&#039;D. To quickly check if there was something wrong with my internet, i went on youtube and it loaded a video fast. After this, I tried to reconnect again and I was stuck at 0% this time for the game to direct me to the finished screen and call me a leaver. smh. \r\nWhat is wrong with my client, its being annoying af. I haven&#039;t played league in 3 days and I get this treatment, thanks riot.","replies":[{"poster":"Cherry Waves","date":"2016-02-05T04:36:29.283+0000","up_votes":1,"down_votes":0,"body":"Same. Been having this issue over the past week but random games not all. Now it's happening every game I play at the moment. Ping spikes to 2000. My net is fine too T^T","replies":[{"poster":"Water","date":"2016-02-05T08:05:49.710+0000","up_votes":1,"down_votes":0,"body":"The thing is with mine, my ping was consistently low and at no point had it went to a high ping. Then I dc out of the blue. like wut","replies":[{"poster":"Cherry Waves","date":"2016-02-08T19:15:02.216+0000","up_votes":1,"down_votes":0,"body":"Yeah me too :c. The first time it happened.. the game just froze with no warning at all no \"attemping to reconnect\". But it has been fine the past couple of days. Hope yours is better.","replies":[]}]}]}]}