{"poster":"Due spade","date":"2018-06-15T07:49:00.321+0000","title":"Sapete di quei consigli durante il caricamento della partita...","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Indubbiamente alcuni anche piacevoli da leggere come curiosit&agrave; ma, per bont&agrave; divina mettetene pure uno che spiegate Mordekaiser pu&ograve; prendere l&#039;anima del drago (sisi anche l&#039;elder nono ne nashor ne robo dei 20 minuti), quindi brutti disgraziati se lo chiama ogni qualsiasi volta sia praticamente free, andateci che son spesso (salvo fps che scendono a 5) tf abbastanza facili o una torre praticamente sicura e, nelle pi&ugrave; apocalittiche situazioni un&#039;intera corsia fino all&#039;inibitore col robo dei 20 minuti, grazie.\r\nO in alternativa, brutti fetenti se quel povero disgraziato salvo missclick di ulti, becca l&#039;adc o qualsiasi cosa feedata con la sua R, fatelo secco per prima nei tf, che &egrave; un&#039;ulteriore disgraziato che pu&ograve; aiutare nei tf, grazie. \r\n\r\nEcco magari, dato lo spazio disponibile giusto un pelo pi&ugrave; conciso, ma il succo &egrave; quello. {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Jonathan Shooter","date":"2018-06-15T13:24:28.984+0000","up_votes":1,"down_votes":0,"body":"PAROLE SANTE\nAdori anche tu il vecchio Mord, a quanto vedo...\nCi si becca nella landa, fratello (se ti va, rispondi al mio post)\n{{sticker:vlad-salute}}","replies":[{"poster":"Due spade","date":"2018-06-16T07:17:44.153+0000","up_votes":2,"down_votes":0,"body":"Già sono autolesionista (nel giocarlo con 10-15 fps alla fin dei conti xD ), nel giocare un campione che non ha gap closer, non ha cc, non ha mobilità, non ha possibilità di fuga, ha statistiche base a parte l'ad discretamente orride, ha certi bug irritanti come la R fantasma, il drago scemo, la W a chi la visto, e in generale un campione dimenticato da mamma riot stessa. \\O/","replies":[{"poster":"Jonathan Shooter","date":"2018-06-16T10:24:40.824+0000","up_votes":1,"down_votes":0,"body":"Senza dubbio, però è pur sempre il vecchio Re delle isole ombra... ed è troppo figo per non essere giocato XD","replies":[]}]}]}]}