{"poster":"ChimeCollector69","date":"2016-07-23T19:52:01.480+0000","title":"ChimeCollector69 über: Warum off-Meta besser ist und das \"Nasus-Syndrom\"","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Hallo,\r\n\r\nich bin ein ziemlicher Fan von off-Meta Strategien. Dabei meine ich prim&auml;r Strategien, die von einem normalen Spielverlauf abweichen und nicht sowas wie Orianna ADC oder andere kreative picks.\r\nDann eher ganze Kompositionen.\r\n\r\nIch versuche mal zu erkl&auml;ren, warum ich denke, dass es besser ist.\r\n\r\nZu erst einmal sind die meisten Spieler so sehr an die Meta gew&ouml;hnt, dass sie Schwierigkeiten haben von ihren Gewohnheiten abzuweichen.\r\nSelbst das kaufen von Items, die von ihrem normalen Itembuild abweichen, ist etwas worauf sich einige bereits emotional &uuml;berhaupt nicht einlassen k&ouml;nnen.\r\nDas f&uuml;hrt etwa dazu, dass ein ZZ Rot Portal zu einem ziemlich nervigen Problem werden kann, weil niemand im gegner Team es f&uuml;r n&ouml;tig h&auml;lt ebenfalls eins zu holen.\r\nAber gerade dieses Item, macht off-Meta Strategien in vielen F&auml;llen erst richtig stark.\r\n\r\nEin Meta-Spiel gliedert sich quasi in drei(?) Phasen. Die Laningphase, wo versucht wird zu farmen, die ersten Items zu bekommen und normalerweise einen Turm. \r\nIst dieses Ziel in einer Lane erreicht, wird angefangen in der midlane zu groupen. Zu erst macht das meistens die Botlane. Das w&auml;re dann die zweite Phase, wo es immer wieder zu kleineren Fights kommt. \r\n\r\nUnd irgendwann im sp&auml;teren Spielverlauf l&auml;uft man dann nur noch als Team umher. Meistens ohne wirklichen Sinn und verstand, bis es zu einem Teamfight kommt.\r\n\r\nNun ist es aber so, dass in den meisten F&auml;llen wenn es zu einem Teamfight kommt, einfach irgendjemand gecatched wird, oder overextended.\r\nSowas hat im Grunde nichts mehr mit wirklichen K&ouml;nnen zu tun. Sondern ist Gl&uuml;ck.\r\nUnd dann wundert man sich, warum die Winrate ziemlich genau bei 50% liegt.\r\nDas liegt einfach daran, dass Meta-Spiele Gl&uuml;ckssache sind. Anders ist dies n&auml;mlich nicht wirklich zu erkl&auml;ren.\r\nKlar gibt es gute Spieler. Aber die Spiele in denen ein einzelner Spieler so gefeedet ist, oder so herausragend spielt, dass er alleine carried, sind sehr selten. \r\nUnd selbst gute Spieler, also Leute die wirklich besser sind als ihre Gegner, und fast immer ihre Lane gewinnen, haben am Ende des Tages die selbe winrate wie &quot;schlechtere&quot; Spieler.\r\n\r\nMeine Lieblingsstrategie ist Heimerdinger apc Botlane. Mit einem Support und beide holen Banner of Command und ZZ Rot Portal. \r\nDas ist unglaublich stark und auch erfolgreich. Ich habe mit dieser Strategie eine Winrate von 70% bei 80 Spielen, oder mehr.\r\nSowas l&auml;sst sich sicherlich auch mit anderen Strategien erzielen.\r\n\r\nWarum das effektiv ist, ist relativ leicht zu erkl&auml;ren.\r\nMan spielt ohne wirklichen ADC. Die ganze Strategie ist aufs Midgame fokussiert. Man m&ouml;chte nicht sp&auml;ter als 30 Minuten gewinnen. \r\nEin ADC ist erst richtig stark im Lategame. Allein das gibt einen schon einen Vorteil. Denn wenn ich den gegnerischen ADC nicht spiken lasse, kann ich ihn Kontrollieren.\r\nMan schr&auml;nkt den Spielstil eines Spielers ein.\r\nMit Konstanten pressure auf den Lanes (durch ZZ Rot und Banner) schr&auml;nkt man weitere Spieler ein. Etwa den Toplaner.\r\nGerade wenn die Gegner keinen vern&uuml;nftigen Waveclear haben. Was sehr oft vorkommt.\r\nAu&szlig;erdem kann dies auch ein Counter zu momentan starken Picks sein. \r\nWas m&ouml;chte Leona in der Botlane gegen Heimerdinger tun? Ihn in seinen T&uuml;rmen diven?\r\n\r\nSchon mal dar&uuml;ber nachgedacht nicht eure Gegner counter zu picken, sondern einzelne Champs/Rollen nutzlos zu machen?\r\nWas bringt es mir in der Lane ein vorteilhaftes Matchup zu haben, wenn er dem gegnerischen Team ein besseres Skaling, oder Teamfight liefert.\r\nEs liegt in der Natur des Spiels, dass aufgrund fehlender Kommunikation jeder egoistisch denkt, aber gerade das sollte man ausnutzen.\r\n\r\nDas wichtige ist nur, dass man einen konkreten Plan verfolgt. Etwas, was in normalen Spielen auf beiden Seiten eigentlich nie wirklich der Fall ist.\r\nWie oft denkt ihr w&auml;hrend einem Spiel dar&uuml;ber nach, wie das Spiel nun in den n&auml;chsten 5-10 Minuten aussehen soll?\r\nIn den meisten F&auml;llen d&uuml;mpelt es doch einfach eher vor sich hin. Man ist in dem gewohnten Trott. Erst farmen, dann groupen.\r\nDann kann man einen entscheidenden Teamfight gewinnen und den Nexus zerst&ouml;ren. \r\n\r\nWas ist aber, wenn ich einen sehr konkreten Plan habe? \r\nDann hat man automatisch einen Tempo Vorteil, weil das gegnerische Team diesen Plan nicht kennt, und in manchen F&auml;llen zu sp&auml;t reagiert, weil sie etwa noch Mental darauf eingestellt sind zu farmen. Ich nenne es das Nasus-Syndrom. \r\nMan ist so fixiert seinen eigenen Plan durchzusetzen, oder seinen Gewohnheiten nachzugehen, dass man nicht darauf achtet, was der Gegner tut.\r\n\r\nMit einem konkreten Plan f&auml;llt es auch leichter die st&auml;rken und schw&auml;chen der jeweiligen Teams zu identifizieren.\r\nMeistens geht die Erkenntnis n&auml;mlich nicht &uuml;ber &quot;they are full ad&quot; oder &quot;they have a stronger teamfight&quot; hinaus.\r\n\r\nGerade nun mit den kommenden Ver&auml;nderungen an den T&uuml;rmen (firstblood etc.) k&ouml;nnen derartige off-Meta Strategien richtig stark werden.\r\nDas liegt vor allem daran, da sie das ganze Team snowballen lassen und nicht nur einzelne Spieler.\r\n\r\nUnd solche Strategien lassen sich bereits mit einem Premade durchf&uuml;hren, wenn man das Team etwas aufkl&auml;rt und dar&uuml;ber in Kenntnis setzt, wie der Plan aussieht.\r\nDazu braucht man kein TS und ihr werdet euch wundern, wie oft euer Team kooperiert und sich darauf einl&auml;sst.","replies":[{"poster":"Wylis","date":"2016-07-26T23:22:13.095+0000","up_votes":1,"down_votes":0,"body":"Hey, ich danke dir für deinen Post. Ich sehe das in etwa genauso wie du es geschildert hast. Das in Low-elo keiner einen plan hat ist mir auch schon aufgefallen. Ich habe es vor 3 wochen oder so auch mit heimerdinger-Teemo botlane versucht. Die winrate war dabei äußerst positiv (kann man sich in meinem verlauf ansehen). \nAlso wenn du mal wieder bock hast was außergewöhnliches zu spielen schreibe mich einfach an^^\n\nOh, habe grade gesehn das du genau eine elo über mir bist. Tja vielleicht hast du ja trotzdem bock :)","replies":[{"poster":"ChimeCollector69","date":"2016-07-27T08:22:04.178+0000","up_votes":1,"down_votes":0,"body":"Als kleines Update zu der Strategie, habe ich mich innerhalb von einem Tag von Plat 4 auf Plat 2 gecarriet, weil die Winrate einfach so abstrus ist. \n\nWenn man Premade ist, und im Champselect den Spielern die Strategie erklärt, wird man nicht selten als Troll bezeichnet, oder belächelt, bzw. geflamt.\nWenn man das Spiel dann gewinnt, wollen die auf einmal mit einem in die dynamic queue.\n\nWie man in meiner Matchhistory sehen kann, habe ich von den letzten 20 Spielen 3 verloren und ein remake. \n\nDie Strategie ist broken, wenn man es richtig spielt, was nicht schwer ist. \nIch denke, dass man ZZ Rot bald wieder nerfen wird, oder das Item in irgendeiner Form überarbeitet.\n\nKurze Zeit war es Meta, da hat die Strategie auch nicht mehr so gut funktioniert. Aber weil es jetzt aus der Meta wieder rausgefallen ist, kann man damit leicht Spiele gewinnen.\n\nEin weiterer Aspekt ist auch der Tiltfaktor. Gegen diese Strategie zu spielen, ist antifun.\nMan zermürbt den Gegner einfach.","replies":[{"poster":"Wylis","date":"2016-07-28T00:52:17.315+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ChimeCollector69,realm=EUW,application-id=Wj1wcocU,discussion-id=PjIWYq3j,comment-id=00030000,timestamp=2016-07-27T08:22:04.178+0000)\n>\n> Als kleines Update zu der Strategie, habe ich mich innerhalb von einem Tag von Plat 4 auf Plat 2 gecarriet, weil die Winrate einfach so abstrus ist. \n> \n> Wenn man Premade ist, und im Champselect den Spielern die Strategie erklärt, wird man nicht selten als Troll bezeichnet, oder belächelt, bzw. geflamt.\n> Wenn man das Spiel dann gewinnt, wollen die auf einmal mit einem in die dynamic queue.\n> \n> Wie man in meiner Matchhistory sehen kann, habe ich von den letzten 20 Spielen 3 verloren und ein remake. \n> \n> Die Strategie ist broken, wenn man es richtig spielt, was nicht schwer ist. \n> Ich denke, dass man ZZ Rot bald wieder nerfen wird, oder das Item in irgendeiner Form überarbeitet.\n> \n> Kurze Zeit war es Meta, da hat die Strategie auch nicht mehr so gut funktioniert. Aber weil es jetzt aus der Meta wieder rausgefallen ist, kann man damit leicht Spiele gewinnen.\n> \n> Ein weiterer Aspekt ist auch der Tiltfaktor. Gegen diese Strategie zu spielen, ist antifun.\n> Man zermürbt den Gegner einfach.\n\nJa ich weiß, ich liebe es :D \n\noftmals versteht das eigene team es leider nicht, dann wird es oftmals schwieriger als es eigentlich sollte. Oder das gegnerische Team kauft auch zzrots.\n\nMan sollte es wirklich mit einem Premade machen dann klappt es am besten.","replies":[]}]}]},{"poster":"Call me Br00t","date":"2016-07-24T09:58:09.907+0000","up_votes":1,"down_votes":1,"body":"6 Monate von Gold 2 nach Plat 4 hast es ja richtig weit gebracht mit deiner Taktik und 29% Winrate. Musst ja n richtiger Gott sein xD","replies":[{"poster":"ChimeCollector69","date":"2016-07-24T11:19:46.137+0000","up_votes":1,"down_votes":0,"body":"Ja, weil ich nämlich seit 6 Monaten non-stop immer jemanden habe, der mit mir Heimerdinger Botlane spielt.\nMein früherer Premade hat mit dem Spiel aufgehört und ich spiele selber seid 2 Monaten nur noch sehr unregelmäßig. \nUnd wo soll ich eine 29% Winrate haben?\n\nHinzu kommt, dass mir dieses Spiel kaum noch Spaß macht, wenn es ein Meta spiel ist.","replies":[]}]},{"poster":"ChimeCollector69","date":"2016-07-23T20:28:53.434+0000","up_votes":1,"down_votes":0,"body":"Reicht doch, wenn man damit bis dia 3-4 kommt.\nAb dann werden aber die Teams auch generell besser. Was das Problem im \"low elo\" Bereich ist, ist das jeder sein eigenes Ding durchzieht und generell keine Strategie vorhanden ist. \nHigh Elo Teams verfolgen aber eigentlich immer irgendwelche Strategien, bzw. wissen wie man die Meta Strategie durchzieht.\n\nMit einer off-Meta Strategie im Low-elo kann man eine relativ klare Strategie vermitteln die jedem Teammitglied klar sein sollte.\n\nDer Grund ist weshalb solche Strategien in der LCS oder höheren Elo Bereich nicht funktionieren ist ganz einfach, weil diese Teams (gerade LCS) \"fehlerfrei\" spielen und ohne Probleme staubtrocken das Spiel in die Länge ziehen könnten, da sie immer dafür sorgen, dass genug Waveclear im Team ist, etc. \nUnd dann ist die Meta die Strategie, welche in den meisten Fällen das beste Lategame Skaling bzw. den besten Teamfight liefert, was auf die Dauer Strategien, die auf andere Aspekte des Spiels basieren aushebelt.","replies":[]},{"poster":"Ritos Elo Police","date":"2016-07-23T20:09:50.429+0000","up_votes":1,"down_votes":0,"body":"Solche \"Strategien\" funktionieren ab einer gewissen elo einfach nicht mehr. Leute vergessen oftmals das die Meta quasi das produktivste system ist. natürlich kannst du bis kp sagen wir mal ~dia 3-4 damit durchkommen aber spätestens ab dann siehts schlecht aus, wahrscheinlich schon vorher.","replies":[]}]}