{"poster":"ChimeCollector69","date":"2016-03-15T07:42:56.039+0000","title":"Es fehlt ein Einhorn-Champ","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":4,"body":"Hallo,\r\n\r\nich finde in diesem Spiel fehlt ganz klar ein Champ, welcher das optische Erscheinungsbild eines Einhorns hat. Und bevor ihr es sagt, nein Soraka ist kein Einhorn, sondern ein Mischwesen aus Frau und Ziege, welches aus irgendeinem Grund ein Horn aus der Stirn w&auml;chst...\r\n\r\nZu den &quot;taunts&quot;, der Geschichte, den Basiswerten des Champions oder F&auml;higkeiten, m&ouml;chte ich nichts schreiben, da ich dies in diesen Threads immer v&ouml;llig sinnlos finde. Auch werde ich den F&auml;higkeiten keine Namen geben.\r\nEs geht mir prim&auml;r darum hier die F&auml;higkeiten und ihre Interaktion zu diskutieren und wie ich mir einen solchen Champion grob vorstellen k&ouml;nnte.\r\n\r\nV&ouml;llig klar, soll dies eine Idee f&uuml;r einen squishy-melee-Support-Champion sein, welcher das potential hat effektiv zu roamen.\r\n\r\n_Die Passive stelle ich mir wie folgt vor:_\r\n\r\n&Auml;hnlich wie Victor k&ouml;nnte dieser Champion mit einem Item starten, welches nur er besitzen kann, was einfach eine Beziehung zu seinem Horn darstellt. Dieses Item hat genau wie  {{item:3041}}   ein Stack-System, welches mit Kills und Assists funktioniert. Allerdings finde ich es sinnlos f&uuml;r Kills extra Stacks zu geben. Kills und Assists sollten gleichwertig behandelt werden. Anderes w&uuml;rde dem Support-Spielstil widersprechen.\r\nDieses Item k&ouml;nnte pro Stack dann gewisse Werte geben. AP und HP f&auml;nde ich am sinnvollsten. Wie dies scaliert sollte von der Stufe der Ultimate abh&auml;ngen. Nat&uuml;rlich sollte man am Anfang des Spiels von den Stacks nicht so sehr profitieren wie wenn es weiter fortgeschritten ist.\r\n\r\nWird der Champion get&ouml;tet, so l&auml;sst er dieses Horn &quot;fallen&quot;. Gegnerische Champions k&ouml;nnen dieses nun zerst&ouml;ren, genau wie die Zack-blobs, oder das Schild von Poppy. Wird das Horn von einem gegnerischen Champion auf diese Art zerst&ouml;rt, so gehen alle Stacks verloren.\r\nWird das Horn von einem verb&uuml;ndeten Champion aufgesammelt, bleiben die Stacks erhalten.\r\nStirbt man und schafft es weder ein verb&uuml;ndeter noch gegnerischer Champion das Horn in einem bestimmten Zeitraum einzusammeln/zerst&ouml;ren, gehen einige Stacks verloren.\r\n\r\nWeiterhin sollte das einsammeln dieses Gegenstandes f&uuml;r Verb&uuml;ndete und Gegner zus&auml;tzliche Effekte bringen.\r\nF&uuml;r Gegner etwa zus&auml;tzliches Gold und Verb&uuml;ndete einen kurzen Movespeedbonus (vielleicht kleiner heal). \r\nDamit f&uuml;r Verb&uuml;ndete eine realistische Chance besteht, das Horn erfolgreich einzusammeln, sollte es bei einer T&ouml;tung von dem Gegner wegfallen. \r\nSonst w&auml;re das Horn ja immer direkt zerst&ouml;rt wenn man in Melee-range get&ouml;tet wird.\r\n\r\nDes Weiteren haben alle anderen F&auml;higkeiten des Champs eine gewisse Interaktion mit den Stacks dieses Items. \r\nAb einer gewissen Stack-Anzahl, die jedoch f&uuml;r jede F&auml;higkeit unterschiedlich ist, werden diese verst&auml;rkt.\r\n\r\n\r\n_Zu der Q, W und E-F&auml;higkeit:_\r\n\r\nZu erst m&ouml;chte ich kurz umschreiben, was f&uuml;r F&auml;higkeiten ich von einem solchen Champion erwarte.\r\nEs muss eine M&ouml;glichkeit geben in der Lane zu poken. Dieser poke (Skillshot) ist mit einem slow versehen. (Q-F&auml;higkeit)\r\n\r\nDer Champion sollte eine Form des sustains in die Lane bringen. Also einen point-and-click heal, mit kurzer Reichweite, den man auf Verb&uuml;ndete und sich selbst benutzen kann. (W-F&auml;higkeit)\r\n\r\nDie letzte nicht-ultimative F&auml;higkeit sollte ein tool zum effektiven roamen sein und sich als disengage/engage eignen. (E-F&auml;higkeit)\r\n\r\nIch denke zu der genaueren Art und Weise der vorgestellten Q und W-F&auml;higkeit muss ich nichts n&auml;heres erl&auml;utern. Die sind ja recht Standard und erkl&auml;ren sich selbst. Was hier noch interessiert ist die Interaktion mit der Passiven.\r\nNehmen wir einmal an man kann maximal 20 Stacks mit der passiven sammeln. \r\nDann k&ouml;nnte die Q-F&auml;higkeit etwa bei 5 Stacks, die W-F&auml;higkeit bei 15 Stacks die E-F&auml;higeit bei 10 Stacks und schlussendlich die R-F&auml;higeit bei 20 Stacks einen verst&auml;rkten, oder zus&auml;tzlichen Effekt erhalten.\r\n\r\nBei 5 Stacks erh&auml;lt man auf dem Q zus&auml;tzlichen Damage und der Slow wird verst&auml;rkt.\r\nEs wird aber nicht das Scaling des Spells verbessert, sondern der Basedamage.\r\nDie Verst&auml;rkung des Slows stelle ich mir so vor, dass der Slow auf allen Stufen erstmal gleichstark ist und mit einem h&ouml;heren Level die dauer ansteigt, die der Slow anh&auml;lt. Diese Verlangsamung w&uuml;rde nun verst&auml;rkt, wird aber &uuml;ber Zeit schw&auml;cher, bis zum Basiswert. \r\n\r\nBei 15 Stacks erh&auml;lt der W-Spell die zus&auml;tzliche Eigenschaft einen Verb&uuml;ndeten von CC zu befreien und besseren Heal. \r\nDies hat aber eine eigene Abklingzeit, die nicht verringert werden kann. Etwa 1 Minute.\r\nIst dieser verst&auml;rkte W also noch in der Abklingzeit, so kann man den W zwar ganz normal benutzen, es ist aber nur der Heal ohne zus&auml;tzlichen Effekt. Ist die Abklingzeit der Verst&auml;rkung vor&uuml;ber, so wird der n&auml;chste Heal mit dem zus&auml;tzlichen Effekt ausgestattet.\r\n\r\n\r\n_Zu der E-F&auml;higkeit:_\r\n\r\nDie E-F&auml;higkeit soll wie folgt funktionieren. Aktivierung der E-F&auml;higkeit f&uuml;hrt dazu, dass &uuml;ber eine gewisse Zeit Laufgeschwindigkeit aufgebaut wird. \r\nW&auml;hrend die E-F&auml;higkeit aktiviert ist, kann man sie erneut einsetzen. Dies f&uuml;hrt dazu, dass der Champion ein St&uuml;ck nach vorne springt. \r\nDie weite des Sprungs h&auml;ngt von dem aufgebauten Movespeed ab.\r\nSpringt man so zu gegnerischen Champions, werden diese in einem kleinen Radius geslowt. Die st&auml;rke des Slows sollte immer gleich sein.\r\nWar die E-F&auml;higkeit mindestens 2 Sekunden aktiv, werden die Gegner gestunnt.\r\nMit dieser F&auml;higkeit ist es auch m&ouml;glich &uuml;ber W&auml;nde zu springen.\r\n\r\nNimmt man w&auml;hrend des Einsatz dieser F&auml;higkeit Schaden, so verliert man das zus&auml;tzliche Lauftempo wieder. \r\nBemerke, dass der Stun nicht von dem Lauftempo abh&auml;ngt, sondern nur davon wie lange die F&auml;higkeit aktiv war. Das hei&szlig;t man kann den Stun auch ausl&ouml;sen, wenn man Schaden genommen hat, w&auml;hrend die E-F&auml;higkeit aktiviert war. \r\n\r\nDies ist meiner Meinung nach notwendig, damit man mit dieser F&auml;higkeit sinnvoll engagen kann und es nicht so einfach ist damit zu disengagen.\r\n\r\nBei 10 Stacks k&ouml;nnte man bei Aktivierung der F&auml;higkeit etwa einen Pfad zur&uuml;cklassen, auf dem sich verb&uuml;ndete Champions ebenfalls schneller fortbewegen und hat zus&auml;tzlich eine besondere Interaktion mit der Ulti.\r\n\r\n_Zu der R-F&auml;higkeit:_\r\n\r\nZu erst einmal sollte die Ultimate den Passiven Effekt haben, dass man eine gewisse Basisanzahl an Stacks hat, welche man nicht verlieren kann.\r\nZum Beispiel auf der ersten Stufe 2 Stacks, auf der zweiten Stufe 5 Stacks und auf der dritten Stufe 9 Stacks. Man h&auml;tte also ab Level 16 ein Minimum von 9 Stacks, vorausgesetzt man levelt immer die Ultimate wenn es geht, wovon ich mal ausgehe...\r\n\r\nWas den aktiven Effekt der Ultimate angeht, bin ich mir nicht so sicher. Ich finde es sollte ein Terrain-beeinflussender-Effekt sein, bzw. die F&auml;higkeit Terrain zu erzeugen.\r\n&Uuml;berlegt habe ich mir folgendes:\r\n\r\nAktiviert man die Ultimate, so wird hinter einem f&uuml;r eine gewisse Zeit (vielleicht 5 Sekunden, kann aber auch mit dem Level der Ultimate skalieren) Terrain erzeugt, welches nichts passiert werden kann. Au&szlig;er mit entsprechenden F&auml;higkeiten wie {{summoner:4}} . Au&szlig;erdem f&uuml;hrt die Aktivierung der E-F&auml;higkeit dazu, dass sie f&uuml;r die Dauer der Ultimate anh&auml;lt und der Movespeed nicht abf&auml;llt, wenn man Damage nimmt. Jedoch erreicht der Movespeed zuwachs nicht so schnell sein Optimum.\r\nEntsteht das Terrain w&auml;hrend die E-F&auml;higkeit aktiviert ist (und man hat mindestens 10 Stacks), k&ouml;nnen Verb&uuml;ndete es ohne weiteres passieren.\r\n\r\nAu&szlig;erdem sollte es w&auml;hrend die Ultimate aktiviert ist m&ouml;glich sein sie &quot;an&quot; und &quot;aus&quot; zu schalten, also nicht, dass man dann Terrain in v&ouml;llig sinnlosen stellen erzeugt und total eigenartige Gebilde entstehen, sondern wirklich nur da, wo man es haben m&ouml;chte.\r\nDas erzeugte Terrain ist nicht wirklich &quot;dick&quot;. Das hei&szlig;t um einen Gang, etwa im Jungle, komplett abzusperren, muss dieser auch komplett abgelaufen werden.\r\nDaher muss man diese F&auml;higkeit kontrollieren k&ouml;nnen. Sonst w&uuml;rde man sich ja einfach regelm&auml;&szlig;ig selber einsperren.\r\n\r\nIst das Item voll gestackt, so erh&auml;lt man zus&auml;tlich den passiven Effekt vom {{item:3026}} ebenfalls mit 5 Minuten Abklingzeit.\r\n\r\n\r\nDas w&auml;ren jedenfalls meine Gedanken, die ich zu dem Champ habe. Ich habe sicherlich ein paar Details nicht f&uuml;r jeden Nachvollziehbar umschrieben. Da bitte ich darum einfach nachzufragen. Dies kann ich dann gegebenenfalls doch mit imagin&auml;ren Zahlen (aber nicht Zahlen der Form a+ib xD haha ^^ :-) ) nochmal versuchen zu verdeutlichen.\r\n\r\n\r\n\r\nZu guter letzt m&ouml;chte ich noch kurz sagen was mir pers&ouml;nlich an der Idee missf&auml;llt:\r\n\r\nZu aller erst w&auml;re da das Stacksystem der Passiven. Ich habe ja bewusst erstmal irgendwelche Zahlen genannt, aber ich bin mir nicht sicher, ob es so funktionieren kann. Ein durschnittlicher Support war am Ende des Spiels vielleicht an 50% der Kills beteiligt. Wahrscheinlich etwas mehr. \r\nBei vielleicht 30 Kills w&auml;ren dass dann 15 Stacks. Bedenkt man, dass man die Stacks relativ leicht verlieren kann, ist es relativ schwer diese aufrecht zu erhalten, bleibt aber machbar mit den 9 Stacks Minimum ab Lvl 16.\r\nAllerdings ist diese Passive f&uuml;r einen Supporter aus folgendem Grund eigentlich ziemlich gut. Ich wei&szlig; nicht ob nicht vielleicht sogar op. \r\nMan hat ein Itemslot weniger. Das hat Vorteile sowie Nachteile. \r\nDer offensichtliche Vorteil ist, dass man sehr schnell Fullbuild ist, was man als Supporter in einem Spiel nur sehr schwer wird.\r\nDer klare Nachteil ist aber nat&uuml;rlich, dass man bei der Wahl der Items eingeschr&auml;nkt ist und wenn man seine Stacks verliert im Lategame quasi ein ganzes Items verlieren kann.\r\n\r\nDas n&auml;chste was mir negativ auff&auml;llt ist, dass die zus&auml;tzlichen Effekte, die ich mir gedacht habe wenig innovativ sind.\r\nDa haben wir einmal {{item:2138}} , {{item:3222}}  und {{item:3026}} . Jeder der Effekte existiert also in irgendeiner Form schon im Spiel.\r\nDie Liste l&auml;sst sich ja noch weiter fortf&uuml;hren. Wir haben das spezielle Item, was Mejas &auml;hnelt, wie E-F&auml;higkeit erinnert ein bisschen an Hecarim oder Rammus usw. \r\n\r\nIch finde die Idee an sich nicht schlecht, sonst h&auml;tte ich sie nicht gebracht, aber am Ende des Tages vielleicht wenig innovativ und Verbesserungsw&uuml;rdig. \r\nWenn das mit dem Stack-System nicht funktioniert muss man das aber sowieso alles &uuml;berboard werfen.\r\n\r\nUnd als letztes w&auml;re da die Ultimate. Ich wei&szlig; nicht ob die total broken ist, oder einfach v&ouml;llig troll...\r\nDas was ich mir da ausgedacht habe gef&auml;llt mir eigentlich sehr. Ich stelle mir das sehr lustig vor.\r\n\r\nWas ich allerdings auch finde ist, dass in diesem Vorschlag auch klare Schw&auml;chen drin sind. Man kann also denke ich nicht sagen, dass auf Grund von dem was hier steht der Champion direkt als &quot;op&quot; abgestempelt werden kann.\r\nAchja, und wenn ich dann auch noch eine Idee zum release-skin &auml;u&szlig;ern darf, dann m&uuml;sste das ganz klar ein Regenbogen-Alpaka-Skin sein. *u*\r\n\r\nDann bin ich mal auf eure Meinung gespannt.\r\n\r\nmfg","replies":[{"poster":"p0hil","date":"2016-03-15T07:45:23.437+0000","up_votes":4,"down_votes":2,"body":"Seeehr langer Text.. aber als ich unten gelesen habe 'Regenbogen-Alpaka-Skin' fiel mir nur das hier ein:\n\nhttps://45.media.tumblr.com/b4bbe52bc1d4c872fe285ba949088dd7/tumblr_mwfigavBrD1sh3a5oo1_250.gif","replies":[{"poster":"ChimeCollector69","date":"2016-03-15T09:03:46.550+0000","up_votes":1,"down_votes":2,"body":"Der Text ist eigentlich gar nicht so lang. Den hat man in 3-4 Minuten durchgelesen.\n\nIch meinte aber sowas:\n\nhttp://www.amazon.de/Regenbogen-Rainbow-Alpaca-Amuse-Pl%C3%BCsch/dp/B012FHOUX8","replies":[]}]},{"poster":"Weedly Medic","date":"2016-03-15T18:31:28.684+0000","up_votes":2,"down_votes":1,"body":"Es gibt schon ein Champ mit einem Einhorn Skin : Arcade Hecarim.\nWarum sollte es noch ein Einhorn geben, wenn schon einer genügt.\nDas ist genau so , wenn in der Kluft schon ein Drache ist und trotzdem ein Drachen-Champ gemacht wird\n(Der neue Drache ist Aurelion Sol)","replies":[{"poster":"ChimeCollector69","date":"2016-03-15T19:58:19.477+0000","up_votes":1,"down_votes":0,"body":"Das ist doch Unsinn. Sonst dürfte es ja auch nur einen Champion geben der ein Mensch ist. Davon gibt es aber eine Menge. Und der Vergleich Skin mit Champion ist doch von vornherein hinfällig.\n\nDeshalb gibt es ja auch nur einen Schwarzen Champ, nämlich Lucian. Nicht wahr?","replies":[{"poster":"Freiherr Alex","date":"2016-03-17T11:59:01.578+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ChimeCollector69,realm=EUW,application-id=L7E6lhzo,discussion-id=Hi8QptZ9,comment-id=00040000,timestamp=2016-03-15T19:58:19.477+0000)\n>\n> Das ist doch Unsinn. Sonst dürfte es ja auch nur einen Champion geben der ein Mensch ist. Davon gibt es aber eine Menge. Und der Vergleich Skin mit Champion ist doch von vornherein hinfällig.\n> \n> Deshalb gibt es ja auch nur einen Schwarzen Champ, nämlich Lucian. Nicht wahr?\n\nWenn schon nicht Skin mit Champ dann denk doch nur an Soraka :D Hat Hufe und ein Horn auf dem Kopf...","replies":[{"poster":"ChimeCollector69","date":"2016-03-18T02:19:55.310+0000","up_votes":1,"down_votes":0,"body":"Soraka ist wahrscheinlich ein Satyr und kein Einhorn. Sonst wäre sie ja ein Pferd. Sie ist aber ein Mensch mit  Ziegenbeinen. \nUnd Hecarim ist auch kein Einhorn, sondern ein Zentaurus...\n\nDas ist aber auch alles völlig egal. Es geht mir auch nicht um irgendein äußerliches von irgendeinem Champ sondern um das vorgestellte Championkonzept, was anscheinend niemand von denen die hier gepostet haben durchgelesen hat.","replies":[{"poster":"Weedly Medic","date":"2016-03-18T15:01:28.039+0000","up_votes":1,"down_votes":0,"body":"Ganz ehrlich. Warum sollten sie ein Einhorn machen , wenn sie schon keine Kidis Sachen machen wollen und wenn sie schon gerade am Überlegen sind , ob sie ein Champ machen , der ein Pferd hat? Ein Einhorn ist nur eine Art Fantasie-Pferd.","replies":[{"poster":"ChimeCollector69","date":"2016-03-18T23:56:19.266+0000","up_votes":1,"down_votes":0,"body":"Weil ich Einhörner mag.\nWarum sollten sie denn keins machen? Und wie gesagt, das optische ist mir eigentlich eh total egal, aber irgendwas muss man sich ja darunter vorstellen. Es geht mir immer noch hier um die Fähigkeiten etc. die ich mir natürlich so gedacht habe, dass sie irgendwie zu einem Einhorn passen könnten.","replies":[{"poster":"Weedly Medic","date":"2016-03-19T19:32:51.045+0000","up_votes":1,"down_votes":0,"body":"Die Fähigkeiten sind etwas zu viel. Ehrlich gesagt hat die Ideen schon jemand gehabt (kein Einhorn).Du hast es nur umgeformt und verlängert. Du kannst nur hoffen , dass sie deine Ideen drannehmen (was ziemlich unwahrscheinlich ist , da du deine Ideen erst später vorgestellt hast).","replies":[{"poster":"ChimeCollector69","date":"2016-03-20T01:12:32.223+0000","up_votes":1,"down_votes":0,"body":"Das die Idee schon jemand vor mir hatte, ist mir nicht bekannt, und kann ich mir auch nur schwer vorstellen, dass es sich in weiten Teilen ähnelt. \n\n> Die Fähigkeiten sind etwas zu viel\n\nBis auf die Ultimate finde ich alle Fähigkeiten ziemlich Standard. Ich wüsste nicht was da zu viel sein sollte.\nDas \"Upgrade\" durch die passive kann man noch anpassen, falls man es zu stark findet. \nJedoch wüsste ich nicht, warum das der Fall sein sollte. Vielleicht ist ein Guardian Angel for free zu viel. Da kann ich zustimmen. Die Idee dahinter ist aber natürlich offensichtlich, nämlich das wenn man einmal vollgestackt ist, was schwer genug sein sollte, das auch bleibt.\n\nWie gesagt soll der Champ gerade am Anfang recht squishy sein.\n\nDazu müsste man aber auch erstmal klären wie die Passive genau funktionieren soll.\nAlso wie viele Stacks gibt es insgesamt, wie viele bekommt man pro Kill/Assist und wie viele verliert man in bestimmten Szenarien.\n\nZu der Ultimate, finde ich, dass diese auf keinen Fall zu stark ist. \nDas kann man aber denke ich auch erst beurteilen, wenn man sowas mal im Spiel gesehen hat.\nÄhnlich wie mit der Anivia-Wall, deren korrekte Benutzung ziemlich schwer ist, stelle ich mir das auch mit dieser Ultimate vor und das die Trollgefahr relativ hoch ist.\n\nIch stelle mir das einfach extrem lustig vor. Und das es wert ist, sich darüber mal nähere Gedanken zu machen.","replies":[{"poster":"Weedly Medic","date":"2016-03-20T13:19:26.739+0000","up_votes":1,"down_votes":0,"body":"Das weiß ich ja. Ich meine , dass du nicht so viel Text benutzen sollst. Du könntest das Ganze abkürzen. Das habe ich gemeint mit ,,die Fähigkeiten sind etwas zu viel''. Ansonsten ist das Ganze gut geworden. Ich hab nix mehr zu sagen.","replies":[{"poster":"ChimeCollector69","date":"2016-03-20T13:31:02.297+0000","up_votes":1,"down_votes":0,"body":"Dann hast du dich aber ziemlich missverständlich ausgedrückt.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"PowerSafety","date":"2016-03-15T13:37:22.599+0000","up_votes":2,"down_votes":1,"body":"Arcade Hecarim! :D","replies":[]},{"poster":"Kyphoxia","date":"2016-03-15T19:08:18.838+0000","up_votes":1,"down_votes":0,"body":"Also ich bin dafür, dann bin ich wenigstens nicht das einzige Einhorn hier. {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"StillYasuoMain","date":"2016-03-15T11:04:48.610+0000","up_votes":1,"down_votes":1,"body":"Hatte noch keine Zeit um es durchzulesen, aber zum Allgemeinen: Vergiss Soraka nicht","replies":[{"poster":"p0hil","date":"2016-03-15T11:22:11.039+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ChimeCollector69,realm=EUW,application-id=L7E6lhzo,discussion-id=Hi8QptZ9,comment-id=,timestamp=2016-03-15T07:42:56.039+0000)\n> ich finde in diesem Spiel fehlt ganz klar ein Champ, welcher das optische Erscheinungsbild eines Einhorns hat. Und bevor ihr es sagt, nein Soraka ist kein Einhorn, sondern ein Mischwesen aus Frau und Ziege, welches aus irgendeinem Grund ein Horn aus der Stirn w&auml;chst...","replies":[{"poster":"StillYasuoMain","date":"2016-03-15T12:13:49.761+0000","up_votes":1,"down_votes":1,"body":"Aha klingt logisch","replies":[]}]}]},{"poster":"Countermagik","date":"2016-03-15T11:58:36.081+0000","up_votes":1,"down_votes":1,"body":"{{champion:120}} +{{champion:16}}","replies":[]}]}