{"poster":"ChimeCollector69","date":"2015-05-16T06:48:11.238+0000","title":"Warum is magic pen auf Vel'Koz besser als AP?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hi,\r\n\r\nich spiele Vel&#039;Koz main, aber als Support und frage mich warum magic pen auf ihm besser sein soll als AP?\r\nWann lohnt sich denn magic pen zu bauen? \r\nLohnt es sich auch wenn das gegnerische Team im Grunde kaum magic resistance hat? Oder ist dann AP besser?","replies":[{"poster":"Balmung","date":"2015-05-16T19:36:51.540+0000","up_votes":1,"down_votes":0,"body":"Als Support mit recht guten Basewerten ist es einfach kosteneffizienter früh MPen zu bauen - SorcShoes, Runen + Haunting Guise ergeben   30+8(oder mehr, je nach Runen) MPen, was genügt um im early/midgame die MRes eines Champs ohne defensive Items (fast) völlig auszuhebeln.\nGuise/Shoes + Sightstone kosten zusammen gut 3300 Gold, sind weitaus einfacher zu basteln (kein Item/Upgrade teurer als 800 Gold) als z.B. Zhonyas oder Rabadons und bieten deutlich besser verteilte Stats/Utility.\n\nRein rechnerisch wäre \"pure AP\" sicherlich stärker, da man aber nicht genügend Gold für die \"Large Rod\" Items besitzt und man nicht mal eben 1600 Gold anhäufen kann ohne in der Lane mächtig auf den Sack zu bekommen ist MPen einfach effizienter.","replies":[]},{"poster":"Sirrkas","date":"2015-05-16T06:58:07.007+0000","up_votes":1,"down_votes":0,"body":"Ich habe es selber zwar nie nachgerechnet oder geprüft aber Magicpen soll bei ihm besser sein, weil er nur niedrige AP-Skallierungen auf den Fähigkeiten hat. Dadurch werden zusätzliche AP nur in wenig Schaden umgewandelt, während der hohe Grundschaden der Fähgikeiten (durch das leveln) gut von MPen profitiert.","replies":[{"poster":"OrangeBubble","date":"2015-05-16T11:16:04.745+0000","up_votes":1,"down_votes":0,"body":"Q = 0.6 Ratio\nW = 0.25 + 0.375 Ratio, Total 0.625 Ratio\nE = 0.5 Ratio\nR = 0.6 Ratio\n\nDie Ratio sind ok. nicht besonders hoch, aber auch nicht besonders niedrig.","replies":[{"poster":"Sirrkas","date":"2015-05-16T18:46:04.192+0000","up_votes":1,"down_votes":0,"body":"Jetzt müssten wir nur noch ausrechnen, ob MPen oder mehr AP stärker den Schaden beeinflussen. Vermutlich auch noch unterteilt nach MR des Ziels.","replies":[]}]},{"poster":"Youtube XerusLoL","date":"2015-05-16T07:05:33.780+0000","up_votes":1,"down_votes":0,"body":"So schlecht sind die Skalierungen eigentlich nicht, wenn man bedenkt, dass sie Flächenschaden machen. Gerade mit der Ulti kann man in Teamfights total aufräumen - ich spiel ihn eigentlich auch immer full AP","replies":[{"poster":"Sirrkas","date":"2015-05-16T07:15:50.127+0000","up_votes":1,"down_votes":0,"body":"Das ist nur, was ich darüber gehört habe. Ich habe keine Ahnung ob es auch so stimmt. Wobei MPen auch mti dem Flächenschaden skalliert.","replies":[]}]}]},{"poster":"CabsIog","date":"2015-05-16T16:22:56.941+0000","up_votes":1,"down_votes":0,"body":"Ich Maine vel koz und als Magic pen Kauf ich nur die Stiefel und bisher bin ich damit sehr erfolgreich da halt die passive für genug Schaden bei Tanks sorgt(zumindest wenn man die tatsächlich angreift was nie empfehlenswert ist).","replies":[]},{"poster":"SK Benteke","date":"2015-05-16T07:27:40.756+0000","up_votes":1,"down_votes":0,"body":"1. hoher grundschaden auf seinen fähigkeiten daher ist magie-durchdringung äußerst effizient\n\n2. support velkoz kriegt meistens eher wengier geld, daher ist ein item wie {{item:3151}} extrem gut da es es sich billig zusammenbauen lässt und extrem viel bringt","replies":[{"poster":"Phobos Selini","date":"2015-05-16T11:50:16.257+0000","up_votes":1,"down_votes":0,"body":"Auf Support Vel'Koz kann es sich lohnen auf Sorcerer's Shoes und Haunting Guise zu gehen, da man dann mit wenig Geld an die einzigen verfügbaren Flat Penetration Items kommt und zusammen mit Runen schon gut Schaden austeilen kann. Ein bisschen AP und ein bisschen HP sind auch gerade auf einem Support ganz gute Stats.\n\nAber auf einem Ap Carry Vel'Koz würde ich nicht auf Haunting Guise rushen da sind andere Items wichtiger.\n\nNicht zuletzt ist gerade auf Vel'Koz Penetration auch gar nicht so optimal, da er mit seinem Passiv True Damage macht, für das jegliche Penetration verschwendet ist.","replies":[{"poster":"SK Benteke","date":"2015-05-16T13:47:57.699+0000","up_votes":1,"down_votes":0,"body":"ich dachte wir reden hier nur über support-velkoz...auf midlane velkoz trifft deine beschreibung natürlich 100% zu","replies":[]}]}]},{"poster":"Titanium70","date":"2015-05-16T12:34:06.486+0000","up_votes":1,"down_votes":0,"body":"Nun in der Tat, wirkt M.Pen auf Velkoz zunächst sehr irritierend, da er über gute scalings und true-DMG verfügt. (Wer baut auf Ahri M-Pen..). Dennoch lohnt es sich sehr auf ihm. Zum einen verfügt er über massig CC (dh. er wird Liandrys immer voll nutzen) zum anderen ist sein Grundschaden - gerade auf der Ult - lächerlich hoch, so hoch, dass es einfach sinnvoller ist mittels M.Pen den Schaden zu boosten als durch AP.\n\nAußerdem wird Velkoz häufig als Supp gespielt und da hat hat man eh weder Platz noch Geld für viel AP. ^^","replies":[]},{"poster":"Youtube XerusLoL","date":"2015-05-16T07:01:40.930+0000","up_votes":1,"down_votes":0,"body":"Jeder hat ja einen Magieresistenz-Grundwert, und normalerweise hat man auch noch einiges durch Runen, d.h. es gibt schonmal 20-40 Magieresistenz zu Durchdringen - das macht  man am besten mit fester Magiedurchdringung ({{item:3151}} oder {{item:3001}} ). Wenn die Gegner Magieresistenz stacken, dann brauchst du {{item:3135}}. (Wobei ich den, als main mage, noch nie gebaut habe)","replies":[{"poster":"Schesam","date":"2015-05-16T07:07:56.272+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Held des Jahres,realm=EUW,application-id=Wj1wcocU,discussion-id=JyWuZs3i,comment-id=0001,timestamp=2015-05-16T07:01:40.930+0000)\n>\n> Wenn die Gegner Magieresistenz stacken, dann brauchst du {{item:3135}}. (Wobei ich den, als main mage, noch nie gebaut habe)\n\nDann bist du kein Main-Mage lol. Void-Staff ist das Last Whisper der Mages","replies":[{"poster":"Youtube XerusLoL","date":"2015-05-16T10:13:24.016+0000","up_votes":1,"down_votes":0,"body":"Ich hab aber auch noch nie {{item:3035}}  gebaut XD - wobei ich auch  selten adc spiele","replies":[]},{"poster":"SephirTheDoge","date":"2015-05-16T08:34:38.437+0000","up_votes":1,"down_votes":0,"body":"Ein Void-staff ist nicht immer nötig, da nicht jeder Champ MR pro Level bekommt. Rüstung hingegen bekommt jeder Champion(Außer Thresh) pro Level, weswegen ein Last Whisper immer sinnvoll ist im Late-Game. Es bringt dir nichts einen Void-Staff zu bauen, wenn du vor dir nur 1 Tank hast und der Rest keine MR baut.","replies":[]}]},{"poster":"Phobos Selini","date":"2015-05-16T11:35:00.068+0000","up_votes":1,"down_votes":1,"body":"Wenn Du Void Staff noch nie gebaut hast, dann bist du wirklich ein \"Held\". Void Staff sollte eigentlich bei jedem Mage im Standard Itembuild vorhanden sein.\nSchauen wir uns allein dein letztes Soloranked game mit Vel'koz an. Gegner: \nBlitzcrank: Scaling MR\nXin Zhao: Scaling MR + Hexdrinker\nJayce: GA + Mercury Treads\nMalzahar\nLucian\n\nAuf einem Champ wie Vel'Koz lohnt sich Abyssal nicht, da die Penetration eine Aura mit begrenzter Reichweite ist und Liandrys ist auch nicht auf jedem Champ wirklich gut auf Vel'Koz jedoch geht es.","replies":[]}]},{"poster":"Schesam","date":"2015-05-16T08:42:46.675+0000","up_votes":1,"down_votes":0,"body":"mir gings auch eher darum, das er meinte er baut NIE Void-Staff und wir sind gerade in ner Tank-Meta also joa","replies":[]}]}