{"poster":"Apoloç","date":"2015-03-18T16:53:51.042+0000","title":"Qué está pasando en está temporada","subforum":"Comportamiento del jugador","up_votes":17,"down_votes":1,"body":"Como puede ser que la comunidad cada vez vaya peor, en la temporada pasada jugaba y jugaba mucho y era poco común que aparecieran personas haters o trolls , pero de esa a esta temporada no sé si será por la falta de tribunal ,pero encuentro que cada vez la gente que juega al lol ya sea partida normal o clasificatoria juega enojada es como que en vez de venir a jugar dado que es juego vienen a estresarse e insultar al primer error del equipo,bueno eso no más paz y amor para los que aún nos divertimos jugando(eso sí muteandolos a todos) xD","replies":[{"poster":"Raytharius","date":"2015-03-18T22:49:18.999+0000","up_votes":5,"down_votes":0,"body":"La usuaria Eireen comentó esta discusión con palabras que no faltaban el respeto a alguien. Su comentario fue borrado y su cuenta baneada. ¿A qué se debe este ban?","replies":[{"poster":"Un Alma Más","date":"2015-03-19T02:46:56.298+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Raytharius,realm=LAS,application-id=PJAKt7ph,discussion-id=E1HUIjmp,comment-id=0008,timestamp=2015-03-18T22:49:18.999+0000)\n>\n> La usuaria Eireen comentó esta discusión con palabras que no faltaban el respeto a alguien. Su comentario fue borrado y su cuenta baneada. ¿A qué se debe este ban?\n\nlogica de los usuarios de este foro, no les gusta que comente alguien con uso de la razon y que se opone a ellos, lloran, patalean y denuncian y asi los terminan baneando","replies":[{"poster":"Ing Mecanico","date":"2015-03-19T12:49:49.790+0000","up_votes":2,"down_votes":0,"body":"cierto muy cierto","replies":[]}]},{"poster":"Tatsuya","date":"2015-03-19T01:38:56.550+0000","up_votes":3,"down_votes":1,"body":"no se, a mi me banearon como 5 veces en una semana en el foro, 2 por lenguaje ofensivo (admito que soy medio boca sucia, pero que le vamos a hacer? tengo 23, no me vengan a educar). 3 por poner links bobos como \"metete en esta pagina que absolutamente no tiene nada que ver con scam! **link**\" y me autobanean x poner links mas truchos que los juegos de play 1 que se compraban en puente saveedra.\n\naparentemente no lo maneja nadie el foro, es todo por un bot seguramente\n\n\nEDIT: Todo con el fin de poner un tono de sarcasmo o ironico","replies":[]}]},{"poster":"McKuay","date":"2015-03-18T17:19:58.757+0000","up_votes":4,"down_votes":0,"body":"SERA POR QUE AHORA JUEGAN MAS NIÑOS QUE ANTES? yo vengo de NA desde la season 2{{item:3151}} , pero es realmente insoportable los insultos y la poca paciencia aca en LAS y te hablo ya de 3 temporadas s3, s4 y s5","replies":[{"poster":"Tatsuya","date":"2015-03-18T22:15:03.453+0000","up_votes":2,"down_votes":0,"body":"Yo juego desde la S1, había toxicidad, el tema es que no tanto como lo hay aca... y opino lo mismo, muchos nenes hoy en día juegan este juego. y me impresiona las edades de algunos...\n\nLo mas chico que vi jugar aca, es un pibe de 11 años, que es hermano de un amigo con el que juego hace 4 años, y otro amigo me afirmo que hay pibes desde 8 años...","replies":[{"poster":"AledakGamer","date":"2015-03-19T01:09:42.558+0000","up_votes":1,"down_votes":0,"body":"Yo jugue con uno de 7.","replies":[]}]},{"poster":"tutucamon","date":"2015-03-19T14:04:42.975+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=McKuay,realm=LAS,application-id=PJAKt7ph,discussion-id=E1HUIjmp,comment-id=0000,timestamp=2015-03-18T17:19:58.757+0000)\n>\n> SERA POR QUE AHORA JUEGAN MAS NIÑOS QUE ANTES? yo vengo de NA desde la season 2{{item:3151}} , pero es realmente insoportable los insultos y la poca paciencia aca en LAS y te hablo ya de 3 temporadas s3, s4 y s5\n\nPara mi pasa mas que todo en Low elo (Bronce-Platino); personalmente estoy en D1/Master y no veo mucho rageo (Nunca falta uno, cada tanto).","replies":[]}]},{"poster":"KGrisly","date":"2015-03-19T07:06:03.106+0000","up_votes":3,"down_votes":0,"body":"pasa que en esta temporada  bufean a xin zao porque no esta roto eso es lo que pasa\n\ntodo el mundo es \"pro \" ahora, cometes 1 error o te matan ya sos un pete no sabes jugar, el ADC solo se manda como rambo bajo torre contra 3 lo matan y la culpa la tiene el supp que esta en base y le dijo que se quedara bajo torre\npasa que perdes solo la linea como un boludo y la culpa la tiene el JG\npasa que la culpa siempre la tiene el otro menos vos, te podes morir 20 veces que la culpa es de los demas por no poner wards o lo que sea","replies":[{"poster":"telotubie","date":"2015-03-19T13:12:48.582+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KGrisly,realm=LAS,application-id=PJAKt7ph,discussion-id=E1HUIjmp,comment-id=000e,timestamp=2015-03-19T07:06:03.106+0000)\n>\n> pasa que en esta temporada  bufean a xin zao porque no esta roto eso es lo que pasa\n> \n> todo el mundo es \"pro \" ahora, cometes 1 error o te matan ya sos un pete no sabes jugar, el ADC solo se manda como rambo bajo torre contra 3 lo matan y la culpa la tiene el supp que esta en base y le dijo que se quedara bajo torre\n> pasa que perdes solo la linea como un boludo y la culpa la tiene el JG\n> pasa que la culpa siempre la tiene el otro menos vos, te podes morir 20 veces que la culpa es de los demas por no poner wards o lo que sea\n\ngran comentario","replies":[]}]},{"poster":"Dijeridoo","date":"2015-03-18T22:11:58.563+0000","up_votes":3,"down_votes":0,"body":"Dudo que conozcas el significado tanto de la palabra \"hater\" como la de \"troll\".\nUn hater es alguien que *odia/desprecia* a otra persona o grupo de personas sin razón; Un homófobo es un hater. Alguien que odia a los perros porque de chico lo mordió uno no es un hater.\nUn troll (en terminos de internet) es alguien que busca *molestar/hacer enfadar* a otra persona o grupo de personas. Que alguien juegue mal no lo combierte en un troll, que te toque alguien que no quiere seguir la meta e ir quinn jungla tampoco. Que alguien valla ghost {{summoner:6}}  / Teleport {{summoner:12}}  ESPECIFICAMENTE con la idea de Feedear y/o molestar a alguin si lo combierte en un troll.","replies":[]},{"poster":"blaindenfenyer","date":"2015-03-19T08:03:07.225+0000","up_votes":3,"down_votes":4,"body":"trollea a jugadores troll asi se soluciona todo yo vengo de dejarme matar en una partida porq ya estaba podrido de tanto troll y creeme me relae caleta me reportaron todos pero me importo re poco porq puta q me relaje y aparte era un team de troll asi q daba lo mismo y ver como se pican no tiene precio","replies":[{"poster":"Dinotuerto","date":"2015-03-19T14:51:14.598+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=blaindenfenyer,realm=LAS,application-id=PJAKt7ph,discussion-id=E1HUIjmp,comment-id=000f,timestamp=2015-03-19T08:03:07.225+0000)\n>\n> trollea a jugadores troll asi se soluciona todo yo vengo de dejarme matar en una partida porq ya estaba podrido de tanto troll y creeme me relae caleta me reportaron todos pero me importo re poco porq puta q me relaje y aparte era un team de troll asi q daba lo mismo y ver como se pican no tiene precio\n\nTroleo por que me trolean   el espiritu rata en todo su esplendor","replies":[]},{"poster":"Ing Mecanico","date":"2015-03-19T12:50:54.295+0000","up_votes":2,"down_votes":0,"body":"sapee","replies":[]}]},{"poster":"xRayzencl","date":"2015-03-20T02:35:11.388+0000","up_votes":2,"down_votes":0,"body":"Lo mas gracioso es ver lo malos que son y como reaccionan a fallas de personas que si saben jugar. Estos sujetos suelen a ser sumamente agresivos y odiosos al momento en que vas mal, pero dense cuenta como cambia su actitud cuando los vas carreando y ellos practicamente no mueven 1 dedo...\n\nAhí uno se puede dar cuenta, que solamente son niños. Desean ganar y no aceptar la frustración, como son unos mal criados, no pueden aceptar la derrota y cometen actos de niños...\n\nPor lo mismo, ignorarlos es lo mejor, varias veces he remontado luego de una buena puteada de en su mayoría Argentinos ratas, pero en fin, son mas en cuanto a población, son mas ratas inundando esta comunidad...","replies":[]},{"poster":"Ing Mecanico","date":"2015-03-19T12:48:28.698+0000","up_votes":1,"down_votes":1,"body":"Yo no salgo de silver me toca gente que se va afk o ni siquiera sabe usar a sus campeones.","replies":[{"poster":"Haru Shobi","date":"2015-03-19T19:07:53.706+0000","up_votes":2,"down_votes":0,"body":"capo siempre usan la misma excusa, afk o trolls. si no podes salir de bronce, silver o gold es porque no dan las manos, ni mas ni menos.\nhttp://www.lolskill.net/summoner/LAS/Haru%20Shobi/summary quede en bronce 1 despues de las placement y mira como estoy ahora.\nY me tocaron trolls y afk, pero si te dan las manos podes carrear igual.","replies":[]}]},{"poster":"Dinotuerto","date":"2015-03-19T06:13:57.670+0000","up_votes":2,"down_votes":0,"body":"Es increible como El que seamos una region que no da el.dinero ni tiene la escena competitiva que tienen otras zonas genera tal despreocupacion por la convivencia dentro del servidor . Con reports que no funcionan y niños con el control del juego. no existe la hora para jugar en paz. la frustracion y la perdida del deseo de jugar y mejorar se mueren cada vez mas con el troll, el afk y el tipo que simplemente agrede por agredir","replies":[]},{"poster":"Izhoka","date":"2015-03-18T19:33:15.671+0000","up_votes":1,"down_votes":0,"body":"la falta de tribunal yo creo que es la causa principal por que la season anterior no era tanto ademas que un report valía algo, ahora no vale nada{{summoner:1}}","replies":[{"poster":"Ch4puLin","date":"2015-03-19T03:07:31.029+0000","up_votes":2,"down_votes":0,"body":"Pff poco sentido lo que decís.\nAntes tenías un front end para el tribunal, que no hacía nada. Nunca había posts de gente quejándose por bans, o sea, no baneaba a nadie el tribunal.\nLuego de las primeras oleadas semanales, o los baneos automáticos de chat, siempre había posts del tipo \"me banearon injustamente\" (todos sabemos que lo merecían, pero bueno, el punto es ese, cuando realmente hay bans, el afectado, así sea la peor basura, va a venir a llorar).\nCOn las últimas oleadas de baneos, no veo quejas, así que me estoy inclinando a pensar, que nuevamente no están haciendo nada y mienten con los copy pastes semanales.","replies":[]}]},{"poster":"Skaft","date":"2015-03-18T18:25:35.140+0000","up_votes":2,"down_votes":0,"body":"exacto tal cual como dicen, es insoportable llevo mas de 40 partidas seguidas desde hace ya un tiempo que había dejado de jugar y en el 90% de las partidas hay alguien que le hecha la culpa a otros por sus errores o que no tolera un ks o etc, no sirve de nada ser buena onda, no sirve de nada el chat.\nSoluciones....desactivar el chat del lol por completo hasta que exista un tribunal eficiente... ya a este tiempo me arrepiento de haber gastado dinero en la season 2 y 3 en este juego injugable, donde básicamente tienes que jugarlo mal para entretenerte.","replies":[]},{"poster":"AknoZ","date":"2015-03-19T03:20:28.262+0000","up_votes":3,"down_votes":2,"body":"Amigo mute all :D ese boton lo invento yisus","replies":[]},{"poster":"LagunaStein","date":"2015-03-18T22:01:50.350+0000","up_votes":2,"down_votes":1,"body":"por que el lol es un juego que se puede jugar prácticamente en cualquier pc y por este motivo mas niños , la mayoria son ratas . . .","replies":[]},{"poster":"The Fall of Troy","date":"2015-03-20T02:03:27.445+0000","up_votes":1,"down_votes":0,"body":"hay gente que en una team fight alguien hace una kill y dicen que es ks, alguien hace kill , ks, el hace kill a alguien que estaba practicamente muerto y si le reclaman dice \" pls report (inserte su champ aqui) por rata \"","replies":[]},{"poster":"Kitsune Nog","date":"2015-03-20T01:30:52.433+0000","up_votes":1,"down_votes":0,"body":"Dos palabras: Niños rata.\n\nQueres deshacerte de ellos? llega a diamon/maestro, eso es mucho mas arriba de lo que yo llamo el patio de juegos.\n\nsi queres deshacerte de ellos, tenes que ser mejor que ellos. Asi de simple.","replies":[]},{"poster":"Holgazan","date":"2015-03-19T20:12:43.696+0000","up_votes":1,"down_votes":0,"body":"Ta igual que siempre","replies":[]},{"poster":"trafaIgar Iaw","date":"2015-03-19T15:52:55.952+0000","up_votes":1,"down_votes":0,"body":"posta che\njugue una clasi y bardearon tanto a su jg que se termino yendo afk.. nos pudo haber tocado a nosotros -.-\nal mínimo error ya  estan todos bardeando a lo jevi","replies":[]},{"poster":"Comando Peje","date":"2015-03-19T01:38:54.478+0000","up_votes":1,"down_votes":0,"body":"A mi modo de ver no se han dedicado a mejorar el servidor, es más cada vez es más aburrido jugar, siempre ves los mismos 15 o 20 champs, siempre hay 2 o 3 que se la pasan insultando ya sea de tu equipo o del rival, en fin son varias cosas que molestan y creo que la gente se está dando cuenta de eso, por lo menos la que ya hace un tiempo que están jugando :/","replies":[]},{"poster":"Setekh","date":"2015-03-19T01:06:22.609+0000","up_votes":1,"down_votes":0,"body":"Y están los que se quedan afk porque se mueren dos veces. Simplemente deberían ser menos tolerantes con las conductas indeseadas, sancionando más gravemente. Pasa lo mismo en los tribunales de la vida real. Asesinan a alguien, y al mes después andan en lo mismo.","replies":[]},{"poster":"Jäger","date":"2015-03-18T22:48:05.348+0000","up_votes":1,"down_votes":0,"body":"Temporada de vacaciones... ya terminan por suerte .... Juega y si ves que falmean los puteas y sigues jugando ...","replies":[]},{"poster":"SYNSAJO","date":"2015-03-18T19:47:10.956+0000","up_votes":1,"down_votes":0,"body":"Si una lastima la unica forma de comunicarte con tu equipo es si tenes amigos jugando con vos la partida, desconosidos out","replies":[]}]}