{"poster":"FuocoVaaS","date":"2016-01-24T12:55:06.866+0000","title":"Il bronzo è qualcosa di magico","subforum":"Discussioni generali","up_votes":30,"down_votes":7,"body":"Salve,\nVolevo raccontarvi la mia esperienza da quando sono stato piazzato bronzo 2 \n\nLe ranked in bronzo sono qualcosa di magico al di fuori della realt&agrave;. \n\nINIZIO:\nLa champ select.... i primi 3 ruoli scelti dai primi 3 giocatori sono mid/top/jng  ......\nVengono bannati champ a caso solo perch&eacute; &quot;they are op&quot;.......\n\nLa team composition viene del tutto ignorata , chi prende il champ con pi&ugrave; danno ha ragione {{champion:420}} \n\nLa PARTITA:\nnella chat cominciano offese random.....\nI player si posizionano nelle loro lane e a volte manco aiutano il jungler..... ma vabbe siamo in bronzo...\nPrimo sangue entro il minuto 5....... dal champ con l early pi&ugrave;  forte...... e di conseguenza nella chat leggeremo\n&quot;Jungler u are noob u don&#039;t gank&quot;......\nIl jungler se deve fare il devourer stara afk farm per circa 20 minuti ..... altrimenti fara gank orribili ogni tanto....\nLa bot gioca un ruolo importante nella partita..... li si decide quanto difficile sar&agrave; da carryare la partita......\nLa maggior parte delle volte una delle due bot feedera pesantemente e dar&agrave; un vantaggio enorme all&#039;altra squadra. \n\nLa top &egrave; una lane statica dove il jungler puo cambiare drasticamente la situazione ma nella maggior parte dei casi questo non avviene.....perche nessuno verr&agrave; ad aiutarti.\n\nMid vince chi &egrave; meno scarso o chi si prende meno gank.....non c&#039;&egrave; molto da dire ,al contrario nel game si pu&ograve; assistere a centinia di offese e malattie ancora non diagnosticate.\n\nIL FIGHT:\nI fight sono l&#039;emblema dell ignoranza .\nNon &egrave; presente alcuna strategia o tattica se non quella di premere pulsanti a caso e far pi&ugrave; danni del nemico.\nSembra pi&ugrave; una tipica azione di rugby......\n\nIl baron sono la cosa meno nota ai bronzi ..... sanno che da tanto vantaggio ma non sanno minimamente quando farlo.\n\nQuando il nemico con meno vita della squadra  &egrave; visibile prima di un fight , i player si gettano su di lui.... e danno prova di infinita potenza , cadendo in bait e fight no sense......\n\nAllla fine ci ritroviamo con 1-2 champ ultra feedati\nE vince chi uccide tutto il team e pusha sempre la stessa lane fino al nexus ignorando l esistenza delle altre 2.......\n\n\nUn CONSIGLIO a tutti coloro che sono finiti in bronzo....\n\nLasciate perdere tutte le meccaniche imparate in silver o in gold......\nPrendete champ tipo annie,lux,brand,vayne,yi,malhpite,aatrox...... e gettatevi nella mischia come meglio potete rimarrete sconcertati dal risultato","replies":[{"poster":"Firenheit","date":"2016-01-24T13:04:40.483+0000","up_votes":20,"down_votes":2,"body":"Severo ma giusto. \nLi è come crescere nella strada.","replies":[{"poster":"DragonCutiddazzu","date":"2016-01-24T18:26:29.477+0000","up_votes":5,"down_votes":2,"body":"IDOLO!","replies":[]}]},{"poster":"mansitkd","date":"2016-01-27T16:13:19.063+0000","up_votes":2,"down_votes":0,"body":"tutte queste lamentele sui bronzi lol.io ora sono bronzo 1 , e sono partito in bronzo 3 questa season, ma non è così difficile salire lol. è normale che siano scarsi è l ultima lega di lol","replies":[]},{"poster":"Misaka Mikoto 5","date":"2016-01-25T11:17:54.042+0000","up_votes":1,"down_votes":1,"body":"Adesso mi spavento di fare le ranked.. Sto Comprando solo champ di livello alto perché quelli ignoranti non li voglio usare... \nAnche se ho preso annie solo perché era annie. \n\nMa leggendo queste storie... inizio a pensare che sarà una cosa persa in partenza.........Tutti i mie ideali, Crollati. {{item:3151}}","replies":[{"poster":"Frattaglia","date":"2016-01-25T11:29:54.834+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Gumball Begins,realm=EUW,application-id=MJVj50Jw,discussion-id=KNGri4Vd,comment-id=001c,timestamp=2016-01-25T11:17:54.042+0000)\n>\n> Adesso mi spavento di fare le ranked.. Sto Comprando solo champ di livello alto perché quelli ignoranti non li voglio usare... \n> Anche se ho preso annie solo perché era annie. \n> \n> Ma leggendo queste storie... inizio a pensare che sarà una cosa persa in partenza.........Tutti i mie ideali, Crollati. {{item:3151}}\n\nVuoi un consiglio?\nImpara prima i campioni semplici.\nUna volta che conosci bene le meccaniche di quelli facili ti puoi concentrare a migliorare le meccaniche della lane in cui li giochi; una volta che sai bene giocare una lane puoi passare ai campioni complicati.\n\nConosco diversi bronzi che dicono \"ah io nella lane X prendo solo il campione Y perché è difficile, non voglio imparare quelli semplici\" e poi sono ancora in bronzo perché non hanno modo di imparare la gestione di quella lane dato che devono concentrarsi sul campione difficile.","replies":[{"poster":"Misaka Mikoto 5","date":"2016-01-25T12:26:45.049+0000","up_votes":3,"down_votes":1,"body":"Premetto, Ho giocato metà dei champ Ignoranti, ma piu' o meno quando erano free. \nl'Ignoranza parla da se, E quindi, visto che a me non piace aspettare, ho iniziato a prendere i champion alti che mi facevano trasudare interesse da tutti i pori, So come usarli tutti e questo metodo mi teneva bloccata nel cerca squadre, normal e si e no draft, Così che potessi imparare al meglio le meccaniche di gioco, cose che ormai penso di sapere bene. \n\nPensa, Mainavo Kayle support, cosa che faccio ancora( Anche se la principale è Jinx.), E quei piccoli complimenti sempre ci stavano. \nPerò è davvero difficile visto che hai un casino di cose da fare quando sei Kayle, specialmente support. \n\nAnyway, Jinx a vita. Ho già assimilato la Mid Con xerath, Yasuo, Yorick, opANNIEop. (Ben presto forse Talon o Zed.) \nLa top, Anche ormai è diventata di mio dominio, E la bot lo è stata fin dall'inizio. (?) \n\nPer la giungla, ho provato diversi Jungler, una volta anche Quinn(Gratis/Op)  E poi è arrivato Kindred nel carrello, E sapere quando usare la ulti al momento giusto fa veramente la differenza tra la vita e la morte, e dei piccoli riconoscimenti in cha.\nCon kindred ho assaporato il vero e proprio Try Hard, Se cambiavo di un tocco le rune Succedeva il finimondo e il blu mi mangiava l'anima. Ovviamente ho xin(regalato dalla riot.), Ma xin l'ho trovato troppo potente, Carinamente spammatore di {{item:3124}} Così come alcuni Toplaner. \n\nL'ultimo acquisto è stata Vi, bellissima, Precisa, E se sei con un buon Adc, anche supporto è davvero devastante con un Engage:\nGiungla rimane Strepitosa.  \n\nPenso possa bastare, Ci sono altri Champ rilevanti, ma mi piace averti annoiato con questa storia.\nGrazie sei un buon ascoltatore. Gg wp. \n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Frattaglia","date":"2016-01-25T13:11:25.898+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Gumball Begins,realm=EUW,application-id=MJVj50Jw,discussion-id=KNGri4Vd,comment-id=001c00000000,timestamp=2016-01-25T12:26:45.049+0000)\n>\n> Premetto, Ho giocato metà dei champ Ignoranti, ma piu' o meno quando erano free. \n> l'Ignoranza parla da se, E quindi, visto che a me non piace aspettare, ho iniziato a prendere i champion alti che mi facevano trasudare interesse da tutti i pori, So come usarli tutti e questo metodo mi teneva bloccata nel cerca squadre, normal e si e no draft, Così che potessi imparare al meglio le meccaniche di gioco, cose che ormai penso di sapere bene. \n> \n> Pensa, Mainavo Kayle support, cosa che faccio ancora( Anche se la principale è Jinx.), E quei piccoli complimenti sempre ci stavano. \n> Però è davvero difficile visto che hai un casino di cose da fare quando sei Kayle, specialmente support. \n> \n> Anyway, Jinx a vita. Ho già assimilato la Mid Con xerath, Yasuo, Yorick, opANNIEop. (Ben presto forse Talon o Zed.) \n> La top, Anche ormai è diventata di mio dominio, E la bot lo è stata fin dall'inizio. (?) \n> \n> Per la giungla, ho provato diversi Jungler, una volta anche Quinn(Gratis/Op)  E poi è arrivato Kindred nel carrello, E sapere quando usare la ulti al momento giusto fa veramente la differenza tra la vita e la morte, e dei piccoli riconoscimenti in cha.\n> Con kindred ho assaporato il vero e proprio Try Hard, Se cambiavo di un tocco le rune Succedeva il finimondo e il blu mi mangiava l'anima. Ovviamente ho xin(regalato dalla riot.), Ma xin l'ho trovato troppo potente, Carinamente spammatore di {{item:3124}} Così come alcuni Toplaner. \n> \n> L'ultimo acquisto è stata Vi, bellissima, Precisa, E se sei con un buon Adc, anche supporto è davvero devastante con un Engage:\n> Giungla rimane Strepitosa.  \n> \n> Penso possa bastare, Ci sono altri Champ rilevanti, ma mi piace averti annoiato con questa storia.\n> Grazie sei un buon ascoltatore. Gg wp. \n> {{sticker:slayer-jinx-wink}}\n\nBeh ma a parte Yasuo il resto dei campioni che hai nominato li classificherei come medi o facili :P\nCome difficili classificherei Kalista, Draven, Bard, Zed,...\n\np.s. comunque Kayle come support non mi piace per niente :(","replies":[{"poster":"Misaka Mikoto 5","date":"2016-01-25T13:24:15.384+0000","up_votes":2,"down_votes":1,"body":"Dipende da che tipo di Adc ti trovi, dopotutto. \nMh, Come adc mi piace solo lei, Kalista è piu' tattica, Draven, Non mi salta nemmeno per la testa di prenderlo.\nBard, posso anche lanciarlo sulla luna, Ma trovarne uno davvero bravo support è  un miracolo. (L'ho trovato l'altro giorno, ma rimango sempre sola in lane....) \n\nZed arriverà, Per tanto Kayle, è magnifica supporto, ma d'altronde devi avere una certa affinità con le abilità di kayle(E viceversa.) , insomma le devi conosce se vuoi essere suo adc 3: , Kayle rallenta, Ti velocizza e ti da vita, Hai un support che è difeso dietro i minion e da fastidio all'avversario con la E ed è capace di renderti immortale, Se siete ancora vivi al Sei, Non resta solo che fidarsi di lei. \nA quel punto è solo una questione di strategia, Il che porta dire, \"E' piu' semplice se la bot con kayle è premade.\" Ovvio, le cose sì velocizzano, ma se almeno riescano a capire i ping allora tutto sì capovolge, basta sopravvivere al sei. \n\nAlla fine uso champion che piu' mi attirano l'attenzione, Draven l'ho visto giocare, è troppo potente per i miei gusti, Bard? Troppo lento per i miei gusti. \nPer quanto riguarda gli adc, Esiste solo Jinx, Gli altri non mi hanno mai attirata. \nPer la mid mi piace Xerath, Ma anche zed non vedo l'ora di usarlo. \n\nYasuo è stato davvero facile da imparare la prima partita è andata bene, la seconda piu' che bene e la terza ancor piu' del bene precedente, Ovviamente ogni volta che giocavo ho visto come le persone lo utilizzavano in mid, Io ho soltanto appreso.","replies":[{"poster":"Groox II","date":"2016-01-28T14:53:13.796+0000","up_votes":1,"down_votes":0,"body":"A leggere qui mi torna voglia di usare {{champion:10}}  support xD","replies":[]}]}]}]}]}]},{"poster":"ITA SiberianWolf","date":"2016-01-24T23:26:29.937+0000","up_votes":3,"down_votes":2,"body":"vero sono meglio i silver della season 5 che hanno fatto solo 10 ranked e si sono posizionati silver e non hanno fatto piu ranked per un anno intero.. si si\n\nil bronzo e vero che e una lega con gente scarsa ma me la prenderei per altre cose.","replies":[]},{"poster":"Pls Buff Shen","date":"2016-01-24T15:02:09.834+0000","up_votes":2,"down_votes":2,"body":"io sto amando il bronzo, in due giorni sono salito di duo divisioni e il pick più bello è {{champion:58}}. Appena ho visto il nemico bronzo pickare {{champion:92}}  mi sono detto:\"Come scientificamente provato tutte le riven sono pazze... se ci piazzo un renekton posso carryare\" al minuto 10 ero in godlike 9/1 con triple kill 1 vs 3. :D sarà brutto tornare contro i silver III.","replies":[{"poster":"ITA SiberianWolf","date":"2016-01-24T23:22:20.162+0000","up_votes":3,"down_votes":2,"body":"e perche in season 5 tra bronzo e silver c'era tanta differenza gia gia","replies":[]}]},{"poster":"FuocoVaaS","date":"2016-01-24T16:12:45.961+0000","up_votes":3,"down_votes":3,"body":"L ultima partita mi ha lasciato di stucco.......\nIo lux supp con lucian , contro morgana e jinx.....\nMorgana rage quittata al minuto 5 per colpa mia.... era 0-3......\nPercio abbia distrutto tutta la botlane in poco tempo......\nZed nemico mid prente vantaggio su talon, top tahm nostro perde la lane......\n\nNel mid game \nEravamo tutti piu o meno feedati..... io ero 4-1....\n\nSembrava una partita facilissima.......\n\nMa poi il mio team mi ha sconvolto. .......\nHo chiesto se gruppavamo tutti mid dato che il fight l avremmo vinto noi .... (5vs4)\n\nE sono venuti mid ma nessuno di loro... aveva il coraggio di fightare..... INCREDIBILE\n\n5 vs 4 noi feedati e non volevano fightare........\n\nRisultato \nIo cercavo di pokkare i nemici ,appena il mio team vedeva avanzare gli altri cominciava a scappare , morendoci uno a uno.....\n\nDa una partita praticamente vinta siamo rimasti senza inibitor e con il nexus scoperto .\n\nIo continuo a chiedere il fight ma nessuno mi ascolta e muoio.....\n\nNel frattempo il team decide di fare una TRAP DAL BARON .........\n\nIl team nemico non va dal baron,  sta mid e distrugge il nexus.......\n\nQuesto mi sorprende","replies":[{"poster":"Dantazzo","date":"2016-01-24T21:31:28.161+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=FuocoVaaS,realm=EUW,application-id=MJVj50Jw,discussion-id=KNGri4Vd,comment-id=000a,timestamp=2016-01-24T16:12:45.961+0000)\n>\n> L ultima partita mi ha lasciato di stucco.......\n> Io lux supp con lucian , contro morgana e jinx.....\n> Morgana rage quittata al minuto 5 per colpa mia.... era 0-3......\n> Percio abbia distrutto tutta la botlane in poco tempo......\n> Zed nemico mid prente vantaggio su talon, top tahm nostro perde la lane......\n> \n> Nel mid game \n> Eravamo tutti piu o meno feedati..... io ero 4-1....\n> \n> Sembrava una partita facilissima.......\n> \n> Ma poi il mio team mi ha sconvolto. .......\n> Ho chiesto se gruppavamo tutti mid dato che il fight l avremmo vinto noi .... (5vs4)\n> \n> E sono venuti mid ma nessuno di loro... aveva il coraggio di fightare..... INCREDIBILE\n> \n> 5 vs 4 noi feedati e non volevano fightare........\n> \n> Risultato \n> Io cercavo di pokkare i nemici ,appena il mio team vedeva avanzare gli altri cominciava a scappare , morendoci uno a uno.....\n> \n> Da una partita praticamente vinta siamo rimasti senza inibitor e con il nexus scoperto .\n> \n> Io continuo a chiedere il fight ma nessuno mi ascolta e muoio.....\n> \n> Nel frattempo il team decide di fare una TRAP DAL BARON .........\n> \n> Il team nemico non va dal baron,  sta mid e distrugge il nexus.......\n> \n> Questo mi sorprende\n\nAhahahah \nIl nemico è distratto col nostro Nexus, facciamo il barone","replies":[]},{"poster":"Dr LouD","date":"2016-01-24T16:42:29.901+0000","up_votes":3,"down_votes":2,"body":"Gruppare una lane per fightare è la cosa più sbagliata da fare quando si è 5v4\n\nVai di splitpush ignorante\nSe pushate una sola lane in 5 loro comunque se gruppano riescono a depusharla, ma non possono tenerle sotto controllo tutte","replies":[{"poster":"FuocoVaaS","date":"2016-01-24T17:09:02.330+0000","up_votes":2,"down_votes":2,"body":"Erano tutte pushate bastava non scappare  in 4 vs 5 e tenere la posizione","replies":[]}]},{"poster":"Dreadful Force","date":"2016-01-24T19:41:30.524+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=FuocoVaaS,realm=EUW,application-id=MJVj50Jw,discussion-id=KNGri4Vd,comment-id=000a,timestamp=2016-01-24T16:12:45.961+0000)\n>\n> L ultima partita mi ha lasciato di stucco.......\n> Io lux supp con lucian , contro morgana e jinx.....\n> Morgana rage quittata al minuto 5 per colpa mia.... era 0-3......\n> Percio abbia distrutto tutta la botlane in poco tempo......\n> Zed nemico mid prente vantaggio su talon, top tahm nostro perde la lane......\n> \n> Nel mid game \n> Eravamo tutti piu o meno feedati..... io ero 4-1....\n> \n> Sembrava una partita facilissima.......\n> \n> Ma poi il mio team mi ha sconvolto. .......\n> Ho chiesto se gruppavamo tutti mid dato che il fight l avremmo vinto noi .... (5vs4)\n> \n> E sono venuti mid ma nessuno di loro... aveva il coraggio di fightare..... INCREDIBILE\n> \n> 5 vs 4 noi feedati e non volevano fightare........\n> \n> Risultato \n> Io cercavo di pokkare i nemici ,appena il mio team vedeva avanzare gli altri cominciava a scappare , morendoci uno a uno.....\n> \n> Da una partita praticamente vinta siamo rimasti senza inibitor e con il nexus scoperto .\n> \n> Io continuo a chiedere il fight ma nessuno mi ascolta e muoio.....\n> \n> Nel frattempo il team decide di fare una TRAP DAL BARON .........\n> \n> Il team nemico non va dal baron,  sta mid e distrugge il nexus.......\n> \n> Questo mi sorprende\n\nsi chiama come back, quelli hanno saputo sfruttare le debolezze del tuo team e hanno vinto, si sono meritati la vittoria, poi cosi tanto per dire la lane fase non conta quasi un cazzo, puoi essere in lane 30/0 e in fight puoi non riuscire a muoverti con tutti i cc che ti tirano addosso.\nsono stati mille i game in cui abbiamo vinto in cui partivamo 0/13 nei primi 20 minuti, fai due fight fatti bene, calcolati in cui fermi chi deve essere fermato e ammazzi chi deve essere ammazzato, fai due pushoni e vinci, non credere che a diamond non succeda","replies":[]}]},{"poster":"Subundu","date":"2016-01-24T21:00:23.508+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=FuocoVaaS,realm=EUW,application-id=MJVj50Jw,discussion-id=KNGri4Vd,comment-id=,timestamp=2016-01-24T12:55:06.866+0000)\n\nPenultima ranked che ho fatto con udyr.\n\nEro ovunque, portavo pressione ovunque, al minuto 4 ero 4-0, ovverosia top e mid liberi di farmare e nessuna paura per i gank del jungler avversario (il solito lee sin, tra l'altro). Al minuto 7 ho preso la torre mid praticamente da solo e il primo drago pure. Avevamo un gran bel vantaggio, mi dico \"cazzo finalmente sto carriando come si deve anche in ranked\". Le ultime parole famose...cominciano tutte quelle belle cose che hai elencato tu più ste altre che da un pò vedo in continuazione:\n\n-syndra non roama praticamente mai, overestende di continuo senza mai wardare, viene ripetutamente gankata e feeda akali (e io mi dico \"ma lo sai che c'è quello che ti aspetta, perchè cavolo rifai sempre la stessa cosa?\").\n\n-Finiva un qualsiasi fight (e finchè avevamo vantaggio li vincevamo) e tutti recallavano con le lanes pushate. Io pingavo le torri e venivo ignorato, mi toccava depushare tutte le lanes da solo. Ogni volta che i fight li vincevano gli oppo, chiaramente qualche obiettivo lo prendevano sempre.\n\n-Tutti andavano mid. Magari quelli ci pushavano le altre lanes ma loro stavano mid ad aspettarli. Cosa facevano nel frattempo? chi mi farmava i lupi, chi i wraiths, poi gironzolavano cliccando in cerchio col mouse...\n\n-Quando (per esempio) la torre top stava per cadere ci andavano in 4 e nel frattempo mid e bot erano pushate anch'esse. E così ci facevano girare a vuoto tutto il tempo e accumulavano vantaggio\n\n-Tipico fight: va uno e focussa il primo che vede. Muore. Parte il secondo. Muore. A questo punto si buttano anche gli altri 2. Muoiono. Il tutto condito dai miei ping di stare dietro completamente ignorati.\n\n-Loro fanno il baron. E' troppo tardi per bloccarli, infatti lo finiscono. Vanno comunque in 2 vs 5. Muoiono.\n\n-Fine partita, kalista, nostro adc, 147 cs in 32 min, per dirne una: \"Udyr u suck, really, u did nothing\"\n\nComunque...faccio schifo pure io, quindi ce ne facciamo una ragione e piano piano si risale...e per quelli che erano molto più su del bronzo: avete assolutamente ragione sulla storia del \"se sei forte ecc\", ma a forza di sfottere i nabbi vi eravate dimenticati quanto c'è da mettersi le mani nei capelli per tirarcisi fuori, quindi, almeno per un pò di match, buona caduta di braccia pure a voi :D\n\n{{champion:82}}","replies":[]},{"poster":"XIII Vanitas","date":"2016-01-24T16:18:05.558+0000","up_votes":3,"down_votes":2,"body":"http://i.imgur.com/U7IXbJe.png\n\nIl bronzo è una filosofia di vita.","replies":[]},{"poster":"Best Chair Euw","date":"2016-01-24T13:42:11.889+0000","up_votes":3,"down_votes":2,"body":"Capisco perfettamente. In una partita, io ero il jungler. In un fight abbiamo scambiato 4 per 1 vincendolo, e sono morto io. Potevano finire la partita, l'inib mid era down e il timing di respawn 40 e più secondi...hanno preferito fare il baron per poi farselo rubare e far durare la partita altri 5 minuti. Cose a caso.","replies":[]},{"poster":"DoubleT","date":"2016-01-24T13:29:28.538+0000","up_votes":3,"down_votes":2,"body":"Benvenuto nel magico mondo del bronzo, io coi bronzi ci ho giocato un po', non tante ranked perché preferivo allenarmi, ma mi basta vedere quelli che incontro in normal XD\nAmmetto candidamente di essere scarso, ma davvero a volte incontri della gente che ti mette il dubbio sulle capacità di coordinazione mano-occhio o di ragionamento strategico basilare.\nSono un bronzo, ho chiuso bronzo 3 la s5 e sarò di certo bronzo 5 nella s6 anche se facessi 10W-0L con score pesanti.\n\nPS: ti sei dimanticato che nel magico mondo del bronzo accadono eventi importanti anche dopo il game:\n\n1. In caso di sconfitta si reporta sempre il jungler e/o il support...non importa se loro hanno score positivi ed il tuo è peggio della disfatta di Caporetto. Di fatto è colpa loro se tu hai giocato male e farmato male.\n\n2. In caso di vittoria non si onora chi ti ha carriato, non si onora in generale il team, anzi se la squadra ha vinto è solo per merito tuo! Anche se il tuo score finale è tipo 1/13/5 ed hai perso 2 torri e dovuto aspettare che il resto del team (che intanto si era feeddato) venisse ad aiutarti per evitare che i nemici entrassero in abse! Tu sei stato l'artefice della vittoria, gli altri ti hanno solo rubato le kill.\n\nPPS: Sul punto 2 ho avuto un'esperienza diretta, sono stato reportato dal mio ADC e dal suo amico jungler perché con Lux support, dopo che gli avevo fatto vincere la bot con una tripla-kill e 2 livelli di vantaggio sul carry nemico, sono andato a roammare per aiutare mid e top, cosa che ci ha permesso di vincere le altre 2 lane, tutto questo mentre il suo amico jungler aveva fatto un gank in tutto l'early ed il mid game.","replies":[{"poster":"Frattaglia","date":"2016-01-24T14:39:28.900+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=DoubleT,realm=EUW,application-id=MJVj50Jw,discussion-id=KNGri4Vd,comment-id=0002,timestamp=2016-01-24T13:29:28.538+0000)\n>\n> Benvenuto nel magico mondo del bronzo, io coi bronzi ci ho giocato un po', non tante ranked perché preferivo allenarmi, ma mi basta vedere quelli che incontro in normal XD\n> Ammetto candidamente di essere scarso, ma davvero a volte incontri della gente che ti mette il dubbio sulle capacità di coordinazione mano-occhio o di ragionamento strategico basilare.\n> Sono un bronzo, ho chiuso bronzo 3 la s5 e sarò di certo bronzo 5 nella s6 anche se facessi 10W-0L con score pesanti.\n> \n> PS: ti sei dimanticato che nel magico mondo del bronzo accadono eventi importanti anche dopo il game:\n> \n> 1. In caso di sconfitta si reporta sempre il jungler e/o il support...non importa se loro hanno score positivi ed il tuo è peggio della disfatta di Caporetto. Di fatto è colpa loro se tu hai giocato male e farmato male.\n> \n> 2. In caso di vittoria non si onora chi ti ha carriato, non si onora in generale il team, anzi se la squadra ha vinto è solo per merito tuo! Anche se il tuo score finale è tipo 1/13/5 ed hai perso 2 torri e dovuto aspettare che il resto del team (che intanto si era feeddato) venisse ad aiutarti per evitare che i nemici entrassero in abse! Tu sei stato l'artefice della vittoria, gli altri ti hanno solo rubato le kill.\n> \n> PPS: Sul punto 2 ho avuto un'esperienza diretta, sono stato reportato dal mio ADC e dal suo amico jungler perché con Lux support, dopo che gli avevo fatto vincere la bot con una tripla-kill e 2 livelli di vantaggio sul carry nemico, sono andato a roammare per aiutare mid e top, cosa che ci ha permesso di vincere le altre 2 lane, tutto questo mentre il suo amico jungler aveva fatto un gank in tutto l'early ed il mid game.\n\nAggiungerei due regole:\n- Se un tipo è 20/15 è convinto di avere un buon score.\n- Se il support è da solo in lane e si prende una kill da solo lo devi flammare perché fa ks\n\n:P","replies":[]},{"poster":"Nabbomaster","date":"2016-01-24T13:33:06.239+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=DoubleT,realm=EUW,application-id=MJVj50Jw,discussion-id=KNGri4Vd,comment-id=0002,timestamp=2016-01-24T13:29:28.538+0000)\n>\n> Benvenuto nel magico mondo del bronzo, io coi bronzi ci ho giocato un po', non tante ranked perché preferivo allenarmi, ma mi basta vedere quelli che incontro in normal XD\n> Ammetto candidamente di essere scarso, ma davvero a volte incontri della gente che ti mette il dubbio sulle capacità di coordinazione mano-occhio o di ragionamento strategico basilare.\n> Sono un bronzo, ho chiuso bronzo 3 la s5 e sarò di certo bronzo 5 nella s6 anche se facessi 10W-0L con score pesanti.\n> \n> PS: ti sei dimanticato che nel magico mondo del bronzo accadono eventi importanti anche dopo il game:\n> \n> 1. In caso di sconfitta si reporta sempre il jungler e/o il support...non importa se loro hanno score positivi ed il tuo è peggio della disfatta di Caporetto. Di fatto è colpa loro se tu hai giocato male e farmato male.\n> \n> 2. In caso di vittoria non si onora chi ti ha carriato, non si onora in generale il team, anzi se la squadra ha vinto è solo per merito tuo! Anche se il tuo score finale è tipo 1/13/5 ed hai perso 2 torri e dovuto aspettare che il resto del team (che intanto si era feeddato) venisse ad aiutarti per evitare che i nemici entrassero in abse! Tu sei stato l'artefice della vittoria, gli altri ti hanno solo rubato le kill.\n> \n> PPS: Sul punto 2 ho avuto un'esperienza diretta, sono stato reportato dal mio ADC e dal suo amico jungler perché con Lux support, dopo che gli avevo fatto vincere la bot con una tripla-kill e 2 livelli di vantaggio sul carry nemico, sono andato a roammare per aiutare mid e top, cosa che ci ha permesso di vincere le altre 2 lane, tutto questo mentre il suo amico jungler aveva fatto un gank in tutto l'early ed il mid game.\n\nguarda che il punto 1 e 2 e' cosi pure nelle altre leghe","replies":[{"poster":"DoubleT","date":"2016-01-24T14:05:56.410+0000","up_votes":1,"down_votes":2,"body":"Wow, ma proprio così a senso indiscriminato? XD Cioè anche in gold e platino se uno perde una lane perché è scarso la prima cosa che fa è reportare il resto del team? :D\nCerto sarebbe ingenuo pensare che leghe superiori siano pieni di giocatori così, immagino siano una strettissima minoranza, in bronzo e silver credo che la concentrazione sia più alta.","replies":[{"poster":"Ste the ripper","date":"2016-01-25T18:02:17.978+0000","up_votes":1,"down_votes":1,"body":"No è così ovunque e tutti lo fanno, anche chi non lo ammette","replies":[]}]}]},{"poster":"IwillReportYouXD","date":"2016-01-25T00:44:02.887+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=DoubleT,realm=EUW,application-id=MJVj50Jw,discussion-id=KNGri4Vd,comment-id=0002,timestamp=2016-01-24T13:29:28.538+0000)\n>\n> Benvenuto nel magico mondo del bronzo, io coi bronzi ci ho giocato un po', non tante ranked perché preferivo allenarmi, ma mi basta vedere quelli che incontro in normal XD\n> Ammetto candidamente di essere scarso, ma davvero a volte incontri della gente che ti mette il dubbio sulle capacità di coordinazione mano-occhio o di ragionamento strategico basilare.\n> Sono un bronzo, ho chiuso bronzo 3 la s5 e sarò di certo bronzo 5 nella s6 anche se facessi 10W-0L con score pesanti.\n> \n> PS: ti sei dimanticato che nel magico mondo del bronzo accadono eventi importanti anche dopo il game:\n> \n> 1. In caso di sconfitta si reporta sempre il jungler e/o il support...non importa se loro hanno score positivi ed il tuo è peggio della disfatta di Caporetto. Di fatto è colpa loro se tu hai giocato male e farmato male.\n> \n> 2. In caso di vittoria non si onora chi ti ha carriato, non si onora in generale il team, anzi se la squadra ha vinto è solo per merito tuo! Anche se il tuo score finale è tipo 1/13/5 ed hai perso 2 torri e dovuto aspettare che il resto del team (che intanto si era feeddato) venisse ad aiutarti per evitare che i nemici entrassero in abse! Tu sei stato l'artefice della vittoria, gli altri ti hanno solo rubato le kill.\n> \n\n\nè normale che in caso di sconfitta io reporto tutto il mio team??\ne in caso di vittoria è quasi sempre merito mio, quindi non onoro ne gli avversari ne il mio team","replies":[]}]},{"poster":"Nabbomaster","date":"2016-01-24T13:17:17.640+0000","up_votes":3,"down_votes":2,"body":"ma infatti, mi ricordo di quando ero in bronzo, il bel giorno mi stufai e incomincia a spammare yi ovunque top mid sup jungler adc, tempo 3 giorni ed ero fuori dal bronzo alla faccia del cercare di ragionare o fare gioco di squadra\nyoumuu primo oggetto attivi quella la R la E e vai di ignoranza","replies":[]},{"poster":"One Tax Man","date":"2016-01-25T21:43:31.065+0000","up_votes":2,"down_votes":1,"body":"Premetto che devo ancora finisci ma è sicuro al 100% che ci finisco..\nOra io sono ( anzi ero ) un medio giocatore in silver ,quindi senza mani ( triste ma vero ) , però da quando faccio queste classifiate sono letteralmente senza parole. Si vedono cose al dì là dello scibile umano , nemmeno sotto acidi presi male si immaginano cose del genere.\nNon lo so , mi sembra di giocare 1v9.. Non so se sia una mia impressione , ma non c è follow , non c è ascolto tra i giocatori , al minimo errore vieni focussato da ogni genere di insulto.. sembra un altro gioco.","replies":[{"poster":"Groox II","date":"2016-01-28T14:48:04.765+0000","up_votes":1,"down_votes":0,"body":"Il follow c'è, quando 2 dei tuoi alleati seguono un nemico in giungla nemica (rigorosamente non wardata) e si beccano un'imboscata e ci restano secchi xD","replies":[]}]},{"poster":"Quocka","date":"2016-01-25T19:56:25.230+0000","up_votes":2,"down_votes":1,"body":"Io se stasera va bene esco dal bronzo (ero Gold V nella scorsa season) e ci esco con un po di rimpianto misto a sollievo , io non mi definisco bravo ma giocando è come se avessi fatto un salto nel passato e mi rivedevo in certe cavolate che facevano gli altri e mi dicevo : \"Wow anche io facevo cosi certo che ero un pirla\". Grazie per questo ritorno al passato Riot <3","replies":[]},{"poster":"Il Freddo","date":"2016-01-25T12:12:13.203+0000","up_votes":1,"down_votes":1,"body":"che bello","replies":[]},{"poster":"Demigod Summoner","date":"2016-01-25T08:57:35.185+0000","up_votes":2,"down_votes":2,"body":"Sono le stesse cose che succedono in Silver ed in Gold. Interessante.","replies":[]},{"poster":"xMochromo","date":"2016-01-24T22:23:21.387+0000","up_votes":2,"down_votes":2,"body":"la vita in bronzo è bellissima..e ti parte un segone a 17mani quando riesci a \"carryarti\" da solo con un 100% win rate con leona in 15 partite..posso assicurartelo!","replies":[]},{"poster":"IwillReportYouXD","date":"2016-01-24T17:13:34.243+0000","up_votes":2,"down_votes":2,"body":"Lasciate perdere tutte le meccaniche imparate in silver o in gold......\nPrendete champ tipo annie,lux,brand,vayne,yi,malhpite,aatrox...... e gettatevi nella mischia come meglio potete rimarrete sconcertati dal risultato.\n\nhahah questa frase mi fa troppo ridere, cosa pensi che in diamond usino champ diversi? con quei champ li arrivi benissimo in diamond","replies":[]},{"poster":"StitchedClone","date":"2016-01-24T16:54:32.351+0000","up_votes":3,"down_votes":3,"body":"+1 meritatissimo.\n\nE come dice Starsky QQ:\n2) A Bronzo è la giungla che farma i Bronzi e non il contrario!","replies":[]},{"poster":"Ziovi","date":"2016-01-24T16:37:07.952+0000","up_votes":2,"down_votes":2,"body":"ma, guarda, una volta in normal giocavo con un mio amico scarso (ma scarso scarso, eh) e nella squadra nemica erano tutti bronzo 5. Ma non bronzo 5 qualsiasi, i peggiori bronzo 5 che si possano trovare in giro, credo.\nPer farla breve, giocando con katarina ho finito ad un punteggio tipo 40/0. \nE ci è voluto comunque un po' perché in ogni caso i compagni di squadra non ci pensavano nemmeno lontanamente a fare qualcosa per vincere... andavano a destra e sinistra, a volte concentrati a farmare la propria lane, più spesso ad inseguire un nemico per mezza mappa... dopo un ace in mid con possibilità di prendere 1-2 torri e inibitore recallavano perché magari avevano un pochino di gold dopo il combattimento... alla fine volevano andare a fare il baron quando potevamo semplicemente distruggere il nexus...\nFu molto divertente, ma un pochino imbarazzante.","replies":[{"poster":"ITA SiberianWolf","date":"2016-01-24T23:20:54.036+0000","up_votes":1,"down_votes":2,"body":"tu 40 / 0 PFF io ho fatto 80 / 0","replies":[]}]},{"poster":"ubercodlegend200","date":"2016-01-24T16:18:19.178+0000","up_votes":2,"down_votes":2,"body":"Molti sono abbituati a combattere con strategia e dedizione ma troppi non capiscono che le battaglie in bronzo non si combattono con strategia ma con ignoranza il bronzo è un combattimentro tra rozzi berbari non fighrtti strateghi vince chi esce il ferro più lungo dalle mutande","replies":[]},{"poster":"Im Regen","date":"2016-01-24T16:10:15.193+0000","up_votes":2,"down_votes":2,"body":"hahahhahahahami hai fatto morire con il post XD","replies":[]},{"poster":"xLuckyLu","date":"2016-01-24T15:04:32.832+0000","up_votes":2,"down_votes":2,"body":"Confermo tutto.. a volte in chat o in champion select leggi cose che ti fanno cadere la braccia...","replies":[]},{"poster":"l  Ferox  l","date":"2016-01-24T14:40:02.367+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=FuocoVaaS,realm=EUW,application-id=MJVj50Jw,discussion-id=KNGri4Vd,comment-id=,timestamp=2016-01-24T12:55:06.866+0000)\n\n> Lasciate perdere tutte le meccaniche imparate in silver o in gold......\n> Prendete champ tipo annie,lux,brand,vayne,yi,malhpite,aatrox...... e gettatevi nella mischia come meglio potete rimarrete sconcertati dal risultato\n\nQuotone :)","replies":[]},{"poster":"GreenInch","date":"2016-01-25T06:17:31.097+0000","up_votes":1,"down_votes":2,"body":"Le ult di bard a casaccio che puntualmente salvano mezzo team nemico e poi ci muori male tu!il bard in questione poi flammera tutti...\nOppure i giocatori di master yi che,pur essendo 0/5 e aver fiddato tutti senza nemmeno avere il divoratore completo dopo 50 min di partita,si butta yolo 1 vs 10 e muore male,ti chiedera scusa al tuo ennesimo wtf was that","replies":[]},{"poster":"Lam4","date":"2016-01-25T02:31:52.428+0000","up_votes":1,"down_votes":2,"body":"Caro amico\nNelle mie partite di piazzamento ho avuto un'afk e 2 troll che mi hanno fatto perdere game TOTALMENTE vinti solo perchè sono stupidi\n{{sticker:slayer-jinx-unamused}} \n(Shaco 3/18 AP JUNGLE)\n(Malphite afk al primo minuto)\n(karhus support deficiente)  \ne poi una partita persa che era LOSS PREVENTED e mi ha dato lo stesso la lose\ngg wp rito\n(Ero g4 sono stato messo nel b1 e ci son stato 4 giorni per fare solo da bronzo a silver per gli altri fantastici troll e afk che ho incontrato)","replies":[]},{"poster":"Lucciola","date":"2016-01-25T00:23:49.934+0000","up_votes":1,"down_votes":2,"body":"Guarda leggendo il tuo post ho notato che c'è un enorme somiglianza con tutti i game che ho svolto sino ad ora , sia nei placement che a Gold1 (dove ora sono, vengo da diamante 5). E la cosa mi preoccupa molto, perchè qua la gente fa le stesse identiche cose :D","replies":[]},{"poster":"GreenArroww","date":"2016-01-24T22:16:56.072+0000","up_votes":1,"down_votes":2,"body":"Beh la parte del baron fino al platino è più o meno così, ho perso due partite per una chiamata al baron (una chiamata da uno smurf) non corretta che ha fatto fare ace al nemico facendo prendere anche il baron, fight a caso e chase idem","replies":[]},{"poster":"Squacquerone","date":"2016-01-24T19:46:32.507+0000","up_votes":1,"down_votes":2,"body":"Sono l'unico che ama il bronze perchè esci dalla laning fase con minimo 5 kill? LoL","replies":[]},{"poster":"xXChimera88","date":"2016-01-24T17:48:00.977+0000","up_votes":1,"down_votes":2,"body":"hai scoperto l'acqua calda?{{summoner:13}}","replies":[]},{"poster":"Dr LouD","date":"2016-01-24T16:38:47.457+0000","up_votes":1,"down_votes":2,"body":"DE DRIM","replies":[]},{"poster":"Unlucky Cuchu","date":"2016-01-24T16:13:46.411+0000","up_votes":1,"down_votes":2,"body":"Dai succedono spesso e volentieri anche in Silver queste cose ahah","replies":[]},{"poster":"Re Sombra","date":"2016-01-24T14:31:49.710+0000","up_votes":1,"down_votes":2,"body":"ho jonato un ranked con te, e stata brutta, tu te la sei cavata bn io non saprei cosa dire, non riuscivo a fare nulla forse ho sbagliato pick, diana jng in bronzo non va bene mi sa, bisogna pigliare champ come master o rengar o trynda, e andare di ignoranza pura. Mi spiace di non esserti potuto essere d aiuto,","replies":[]}]}