{"poster":"Krionsilt","date":"2015-10-14T22:52:24.689+0000","title":"Twisted Treeline","subforum":"Discussioni generali","up_votes":1,"down_votes":2,"body":"Scusate nuovamente la lamentela, ma vorrei un consiglio dalla community per capire che sta succedendo.\r\nHo provato a giocare in questa modalit&agrave;, oggi, e mi &egrave; capitato qualcosa che non credo di aver compreso bene. Proprio per questo, ho fatto un paio di partite, per capire se fosse un caso o se ci fosse davvero qualcosa che non andasse... non riesco comunque a capirlo.\r\n\r\nGi&agrave; dalla schermata di selezione personaggio avevo un po&#039; di dubbi. C&#039;erano due giocatori (di cui, scusatemi, ma adesso mi sfugge il nome) che si sono connessi con un certo ritardo (&egrave; apparsa l&#039;icona &quot;!&quot;). Penso che sia la solita connessione schifosa, perci&ograve; non ci penso pi&ugrave; di tanto e provvedo a scegliere il mio personaggio. Lo stesso, a inizio partita prendo la &quot;mia&quot; lane, mentre i due rimangono fermi alla base finch&eacute; non si generano i minion. Non appena questi si avviano verso le lane, finalmente i personaggi si muovono.  La mia fortuna vuole che nella prima partita i miei avversari si dirigano verso bot 3 vs 2 e vengano uccisi -quindi penso &quot;ah, allora saranno dei novellini?&quot;- ma subito dopo i due si fanno uccidere dai minion... la cosa sembra andare avanti ancora per un po&#039;, a differenza che stavolta il nemico decide di farsi ammazzare intenzionalmente dalle torrette, assieme ai miei compagni -che ogni tanto un&#039;uccisione la fanno-, e inizio a domandarmi se si tratta di troll o chiss&agrave; cosa. Finalmente il nemico decide di venire nella mia lane e nel tentativo di farsi eliminare dalla torretta, si imbatte nel mio champion, dandomi cos&igrave; l&#039;opportunit&agrave; di fare uccisioni. A quel punto la cosa diventa ancor pi&ugrave; strana: tutti e 3 i membri del party nemico si infiltrano nella mia lane per farsi ammazzare dalle torrette, senza combattere o colpendo con attacchi/incantesimi base e lo stesso iniziano a fare i due membri del mio party. Con tutte le uccisioni che riesco a fare, riesco finalmente a concludere l&#039;incontro in maniera positiva...\r\n\r\nIncontro successivo: becco nuovamente i due giocatori che facevano parte della mia squadra, precedentemente, nel team avversario e nel mio ce ne sono altri. Cos&igrave;, come prima, decido di prendere la mia postazione e di fare qualcosa... e indovinate un po? Per fortuna un giocatore del party sembrava essere serio, tant&#039;&egrave; che s&#039;&egrave; dato da fare, ma l&#039;altro ha fatto le stesse ed identiche cose dei giocatori di prima. E lo stesso ha fatto il team avversario.\r\n\r\nOra, dopo fine partita avrei voluto fare delle segnalazioni, ma non ero affatto convinta di ci&ograve; che ho visto, quindi volevo capire un po&#039; col vostro aiuto se c&#039;&egrave; da segnalare qualcosa a Riot oppure no. Anche perch&eacute; sinceramente non sapevo come segnalare questi episodi. Non credo che le opzioni disponibili rientrino in questa &quot;categoria&quot;, quindi non avevo proprio idea di come muovermi.\r\nIdee?","replies":[]}