{"poster":"Matryana","date":"2017-03-16T12:41:05.437+0000","title":"Low Priority Queue FAQ Misleading","subforum":"Player Behavior","up_votes":2,"down_votes":3,"body":"Before you start with the snide troll comments, i am not contesting this my placement. I played with a iffy connection and now i deal with repercussions.\r\n\r\nIt&#039;s says if you kept dodging low priorty queue games,it&#039;ll eventually scale to 20 minutes wait, when in reality it starts there.\r\n\r\nQuote from leaverbuster FAQ\r\n\r\n&quot;You will be placed in the low priority queue for 5 games. If you continuously leave, the low priority queue timers increase from 5 minutes per game to 20 minutes per game.&quot;\r\n\r\nSource:  https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ#h2q2","replies":[{"poster":"Riot Tantram","date":"2017-03-16T21:30:16.136+0000","up_votes":6,"down_votes":0,"body":"> It's says if you kept dodging low priorty queue games,it'll eventually scale to 20 minutes wait, when in reality it starts there.\n\nNo, it does not start there.","replies":[{"poster":"Ashen Rider","date":"2017-03-17T00:07:57.340+0000","up_votes":1,"down_votes":1,"body":"Tantram, is there ever going to be a decrease in length for low priority? By that, I mean when you hit a higher tier, such as twenty minutes, if you don't get leaverbuster for quite some time, it decreases to ten minutes.","replies":[{"poster":"Riot Tantram","date":"2017-03-17T17:54:21.877+0000","up_votes":4,"down_votes":0,"body":"That is how the system has always worked.","replies":[{"poster":"Ashen Rider","date":"2017-03-17T19:15:57.237+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Tantram,realm=NA,application-id=ZGEFLEUQ,discussion-id=W07Mxe2E,comment-id=000300000001,timestamp=2017-03-17T17:54:21.877+0000)\n>\n> That is how the system has always worked.\n\nThat's weird, I've never heard of it.","replies":[]}]},{"poster":"Lew","date":"2017-03-17T05:07:41.519+0000","up_votes":1,"down_votes":0,"body":"I'm pretty sure that is how it works already, if someone stop afking after a LPQ and if they get a Leaverbuster again in the future the wait times can go down.","replies":[{"poster":"Mig89","date":"2017-03-17T12:08:07.925+0000","up_votes":2,"down_votes":0,"body":"Can confirm. this account had 20 minute waits at one point and recently i had an emergency come up and had to leave mid game. I didnt get anything other than a warning and i think i quit 5 minutes into the game. I get dodge timers all the time and as far as those goes it seems to reset daily.","replies":[]},{"poster":"Ashen Rider","date":"2017-03-17T05:22:26.504+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lew,realm=NA,application-id=ZGEFLEUQ,discussion-id=W07Mxe2E,comment-id=000300000000,timestamp=2017-03-17T05:07:41.519+0000)\n>\n> I&#x27;m pretty sure that is how it works already, if someone stop afking after a LPQ and if they get a Leaverbuster again in the future the wait times can go down.\n\nIs it really? I've never seen it happen. I used to get Leaverbusters a lot, and then I managed to figure out how to get League to not interfere with the rest of my life, and I stopped getting them. I have gotten multiple messages saying that due to not afking for awhile, my account is now in better standing. However, I got Leaverbuster about a month ago, over a year after I had last gotten one, and it was twenty minutes for each wait.","replies":[{"poster":"Periscope","date":"2017-03-17T05:36:19.361+0000","up_votes":2,"down_votes":0,"body":"I can attest to the system. When I had recently moved, I still had to get my league fix in. Hellish internet be damned! But it got so bad I was busted up to 20 minute queue times. That was, eh about a year ago. A few weeks ago, I had to leave a few URF games here and I think even a ranked game. When I was bumped into low priority, I was on 5 minute low priority. \n\nTLDR: it does reset.","replies":[]}]}]}]}]},{"poster":"duckarp","date":"2017-03-16T13:05:46.136+0000","up_votes":3,"down_votes":0,"body":"No, it doesn't start at 20 minutes.","replies":[{"poster":"Matryana","date":"2017-03-16T13:53:03.681+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=duckarp,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=W07Mxe2E,comment-id=0000,timestamp=2017-03-16T13:05:46.136+0000)\n>\n> No, it doesn&#x27;t start at 20 minutes.\n\nI'm pointing out that discrepancy with game and FAQ\n\nGame starts at 20, but FAQ says starts at 5","replies":[{"poster":"duckarp","date":"2017-03-16T15:33:43.334+0000","up_votes":1,"down_votes":0,"body":"And I'm pointing out your mistake. It actually starts at 5min penalty and gradually grows, as stated in FAQ. If you were recently punished by LB and didn't manage to lower your \"tier\", you would \"start\" again at 20 of course when you leave/dc next time. It doesn't magically reset.","replies":[]}]}]},{"poster":"Kei143","date":"2017-03-16T17:08:17.548+0000","up_votes":4,"down_votes":1,"body":"You are confusing the Leaver buster system with the queue dodge system. They are separate systems, even though the penalties are both called low priority queue, its not the same.\n\nLeaver Buster (for AFKing / Leaving games)'s penalty is 5 mins, 10 mins, 20 mins.\n\nhttps://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ\n\nQueue Dodge penalty starts from 5 minutes first dodge and jumps to 30 mins 2nd dodge.\n\nhttps://support.riotgames.com/hc/en-us/articles/201751844-Queue-Dodging","replies":[]},{"poster":"Magical Player","date":"2017-03-16T20:03:35.334+0000","up_votes":2,"down_votes":0,"body":"LPQ only starts at 20 mins if you've previously been punished with the 5 and 10 min warnings","replies":[]},{"poster":"Soyou19","date":"2017-07-11T18:53:04.846+0000","up_votes":1,"down_votes":0,"body":"I also live in an area that has pretty bad connection, and I officially entered in the 20 min ban when my computer got stuck in the pre-game champ screen. After playing about 20 games straight on vacation, I got a notice after the 20th game that my status for leaving has been lowered. However, when my app crashed multiple times after I got back, leaverbuster sent me right back to 20 minutes!!! Any solutions to this?","replies":[]},{"poster":"the and only ben","date":"2017-03-17T22:27:44.490+0000","up_votes":1,"down_votes":0,"body":"I recently just got a low priority for the server kicking me out before the game started, My team was able to remake but it still hit me with huge punishments. Is there anyway to get something like this removed without having to wait almost 2 hours in un-deserved punishment?","replies":[]}]}