{"poster":"Dankbanana24","date":"2019-08-05T23:25:03.888+0000","title":"Rune pages","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Just wondering if anyone has had an issue lately with their rune pages getting deleted, and then having to do them all again. Twice now it has happened to me in the last week, whenever I close then reopen the client. And I'm a little different to other people in that, I had 17 pages created. I know some people just keep one or two and edit them game by game. Which I guess I'll have to do from now on, or until riot fixes the problem. Because fk making 17 rune pages just for them to be deleted at some point. Really annoying.","replies":[{"poster":"Ninox","date":"2019-08-06T05:44:56.181+0000","up_votes":2,"down_votes":0,"body":"Heyo, there seems to be two versions of this issue, one where the rune page selected resets on game start, and one where the rune pages themselves are reset on login. You obviously appear to be experiencing the latter. Could I trouble you to get some more info to help track this down?\n\n1.  Windows or Mac?\n2. Complete reset or just some pages?\n3. Are your client settings resetting as well?\n2. Just this patch or previously as well?\n3. Have you tried a client repair?","replies":[{"poster":"Dankbanana24","date":"2019-08-06T09:53:18.452+0000","up_votes":1,"down_votes":0,"body":"Hi, and I should also include the fact that when I enter into game lobby it's changed summs back to heal/ghost lol. Not as annoying, but still. \nWindows \nComplete rest, all pages, twice now. \nAs far as I'm aware no. \nJust this patch. I haven't played in a couple months mind you, so I can't speak for the last few patches. Only this one. I did search up this problem, and there's results as far back as 3 months ago. \nHaven't tried that yet. I only played a couple games yesterday then logged off after my runes were deleted again. I'll try tomorrow","replies":[{"poster":"Gehirn","date":"2019-08-08T00:30:57.401+0000","up_votes":1,"down_votes":0,"body":"Hi Dankbanana, thanks for answering these questions, it helps.\nJust to confirm: this is something that happens **every time** you open the client? As in, if you set up and save a page, close the client, then immediately log in again, that page will be gone?","replies":[{"poster":"Dankbanana24","date":"2019-08-31T00:35:13.337+0000","up_votes":1,"down_votes":0,"body":"Still having the same problem despite trying all the possible fixes. Really annoying","replies":[{"poster":"Gehirn","date":"2019-09-03T01:57:02.533+0000","up_votes":2,"down_votes":0,"body":"I've asked around about this issue but have no further info yet. I can't see a support ticket raised by you so I encourage you to [create one](https://support.riotgames.com/hc/en-us/requests/new) as it will allow player support to begin collecting information on this issue.","replies":[{"poster":"Dankbanana24","date":"2019-09-06T07:09:48.632+0000","up_votes":1,"down_votes":0,"body":"Hi again. Have sent through the ticket, with all the logs from the Hextech Heimer repair tool. Hopefully there's something in those which will help. Thanks","replies":[]}]}]},{"poster":"Dankbanana24","date":"2019-08-16T23:20:06.858+0000","up_votes":1,"down_votes":0,"body":"Have tried client repair several times. And as I said, uninstalled then reinstalled. None of this have fixed the issue. \nI also have an NA account I go on sometimes, very rarely. I haven't had the same issue on that account though which makes me think it's just an OCE thing.","replies":[]},{"poster":"Dankbanana24","date":"2019-08-16T23:18:02.320+0000","up_votes":1,"down_votes":0,"body":"Hi sorry I haven't been on here in awhile. Almost every time I log in. Happened again after last patch update too. Sometimes if I restart the client enough times, they'll randomly come back again. As in, all the rune pages I originally created will come back. This also happened after I uninstalled and reinstalled the client. Only for the rune pages to disappear again next time I opened the client. It's really annoying at this point, Because I like for my rune pages to be there rather than have to create them every game. It's not just runes been deleted too, it's also the skins I use been reset to no skin. And also a weird issue with summs switching to Ghost/heal before some games. Which is weird.","replies":[]}]}]}]}]}