{"poster":"Ajnu","date":"2018-01-29T18:03:06.214+0000","title":"Pistas para el caso \"Me bajan los fps\"","subforum":"Problemas Técnicos","up_votes":10,"down_votes":0,"body":"Hola amigos.\n\nComo ya algunos se han dado cuenta, la actualizaci&oacute;n 8.2 les est&aacute; dando problemas a mucha gente con los FPS (incluy&eacute;ndome). De la nada los fps bajan hasta 10-15-20. En mi caso tengo el juego instalado en mi notebook con windows 10 y en mi macbook, y en los dos me ha dado el mismo problema desde la actualizaci&oacute;n. Aclaro que obviamente no es porque el notebook tenga tarjeta de video integrada puesto que me ha andado a 70-100 fps tranquilamente antes de la actualizaci&oacute;n.\n\nBueno, lo que quer&iacute;a aportar, es que abr&iacute; una partida teniendo el administrador de tareas abierto en otra pantalla, para fijarme qu&eacute; estaba ocurriendo en la CPU y en la ram cuando bajaban los FPS. Pens&eacute; que podr&iacute;a ser que el CPU se sobrecargaba demasiado, y que por eso bajaban los FPS. Para mi sorpresa, cada vez que los FPS bajaban a 15, ve&iacute;a el uso de cpu y este aparec&iacute;a en 17% aprox. Cuando el juego me andaba normal a 70 fps, el uso de la cpu se mostraba en 50%. (40% correspondientes al LoL).\nEn mi macbook me resulta m&aacute;s dificil hacer este experimento puesto que no cuento con dos pantallas (tiene otro sistema de conexi&oacute;n), pero me imagino que ocurre exactamente lo mismo (en ese tengo una nvidia 9400).\n\nMe parece que evidentemente es un bug. El LoL no gasta muchos recursos. Y lo que ocurre es como que el pc dejara de mandarle recursos al LoL para que se ejecute bien, y por eso bajan los fps.\nSi alguien conoce alguna soluci&oacute;n para esto, se agradece mucho, puesto que se ha vuelto injugable. Una lata jugar as&iacute;.\n\nSe agradecen los aportes! &lt;3\n\nNota 1: Le sub&iacute; la prioridad a Alta en procesos y no ayud&oacute; en nada.\nNota 2: Mi notebook es un Lenovo intel core i5, con 8 gb de ram.","replies":[{"poster":"ZephG","date":"2018-01-29T18:39:02.710+0000","up_votes":3,"down_votes":0,"body":"A mi me pasa lo mismo, tengo un pc que basta y sobra para el lol, antes de la actualizacion 8.1-8.2 el lol me corria en TF a sus 40-70 fps y en linea a sus 100,despues de la actualización 8.1, en Tf me bajaba a 20 y aveces se me traba la pantalla por 1 Seg cuando tiró o tiran habilidades, aveces por ej en la jungla cuando farmeo me bajan a 20 por 3 segundos y ni idea, hable con el soporte y decián que Riot estaba trabajando para solucionarlo y Bla bla, yo creo que tratarán de arreglarlo en el proximo parche :/, es super molesto que no puedas jugar bien con un pc que antes lo corria tan bien","replies":[{"poster":"Juanusho","date":"2018-02-11T03:50:37.460+0000","up_votes":1,"down_votes":0,"body":"& Se solucionó? porque a mí la verdad que no.. :(","replies":[{"poster":"ZephG","date":"2018-02-20T19:29:31.024+0000","up_votes":1,"down_votes":0,"body":"Noup xd, aun se sigue congelando, por lo menos disminuyo un poco la baja de FPS pero igual de repente se Freezea en TFs","replies":[]}]},{"poster":"Ajnu","date":"2018-01-30T04:45:56.144+0000","up_votes":1,"down_votes":0,"body":"Prueba limitar los fps a 60 o a 30. A mí me ha andado mucho mejor asiii :D","replies":[]},{"poster":"Ajnu","date":"2018-01-29T19:07:48.771+0000","up_votes":1,"down_votes":0,"body":"Sii es una lata. Pero me alegra saber que Riot ya lo sabe. \nEs extraño lo que pasa, es como si el computador dejara de gastar recursos en el juego y por eso bajan los fps. Al menos eso pasa en mi pc.","replies":[]}]},{"poster":"Juanusho","date":"2018-01-30T16:52:20.257+0000","up_votes":2,"down_votes":0,"body":"A mi me pasa lo mismo... pero no se me solucionó limitando fps se termina bajando igual en tf's. QUE MAL!","replies":[{"poster":"Ajnu","date":"2018-01-30T17:31:56.764+0000","up_votes":1,"down_votes":0,"body":"A mí ahora igual se me baja en team fights pero no tanto como antes. Lo que sí en toda la partida me anda mucho más fluido. Lástima que no te funcionara :( a esperar la actualización no más.","replies":[{"poster":"Juanusho","date":"2018-02-11T03:49:10.428+0000","up_votes":1,"down_votes":0,"body":"Se te arreglo con la actualización? porque a mi no..","replies":[{"poster":"Ajnu","date":"2018-02-12T01:25:22.204+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Juanusho,realm=LAS,application-id=X54mVVp0,discussion-id=uyotzkNW,comment-id=000400000000,timestamp=2018-02-11T03:49:10.428+0000)\n>\n> Se te arreglo con la actualización? porque a mi no..\n\nHolaaa. Lo pude arreglar limitando los fps a 60 (si, muy raro). También actualizando los drivers del pc. No se solucionó al 100%, pero ahora me anda el 95% del tiempo bien.","replies":[]}]}]}]},{"poster":"Knife Skull Edgë","date":"2018-01-30T13:54:14.545+0000","up_votes":2,"down_votes":0,"body":"Desde que actualizaron el cliente anda peor el lol :S muchos drops de fps!!","replies":[]},{"poster":"Havvah","date":"2018-01-29T19:29:41.919+0000","up_votes":2,"down_votes":0,"body":"A mi me empezo a pasar lo mismo con este parche, siempre estuve con 150-200 fps y ahora por momentos baja a 35-40.","replies":[{"poster":"Ajnu","date":"2018-01-29T19:37:16.032+0000","up_votes":1,"down_votes":0,"body":"Me alegra saber que no soy el único. Sii a mucha gente le está pasando.\nSolo nos queda armarnos de paciencia para que Riot arregle esto.\n\npd: Leí que a una persona le había servido meterse a la configuración de su tarjeta de video y agregar a League of Legends como juego. Al parecer su computadora estaba ejecutando el juego con los gráficos integrados. Así se solucionó su problema.","replies":[{"poster":"Ajnu","date":"2018-01-30T04:45:10.068+0000","up_votes":1,"down_votes":0,"body":"Havvah! Prueba limitar los fps a 60 o a 30. A mí me ha andado mucho mejor asiii :D","replies":[]}]}]},{"poster":"Ivanqsl","date":"2019-02-03T17:31:25.958+0000","up_votes":1,"down_votes":0,"body":"Me anda pésimo, no tengo mala maquina pero me baja de 90 a 20 fps y no se puede juegar y es siempre en mid game...","replies":[]},{"poster":"IIIIIIIIIIIIIIII","date":"2018-02-01T10:00:22.290+0000","up_votes":1,"down_votes":0,"body":"Tenes ajustado para mejorar el rendimiento de programas, y no servicios en segundo plano?","replies":[]},{"poster":"LanaDelReyVEVO","date":"2018-01-30T19:57:53.824+0000","up_votes":1,"down_votes":0,"body":"Ami me sirvio desactivar todos los sonidos","replies":[]},{"poster":"1471juan","date":"2018-01-29T18:53:18.475+0000","up_votes":1,"down_votes":6,"body":"No sos un detective, el juego esta mal optimizado nada mas.","replies":[]}]}