{"poster":"CastielMid","date":"2016-06-25T09:12:28.444+0000","title":"LFM Top für kommende 5v5 Teamrankedqueue","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo erstmal, ich gebe euch kurz und knackig eine &Uuml;bersicht &uuml;ber Infos, die f&uuml;r euch von belangen sein sollten.\r\n\r\nWas m&ouml;chte ich erreichen ?\r\nIch m&ouml;chte ein Team mit 2 Subs aufstellen um bei dem Neuauferleben der 5 gegen 5 Teamranked Warteschlange direkt voll durchstarten zu k&ouml;nnen und nicht mir dann erst ein Team zu suchen (Ihr solltet der selben Meinung sein). Au&szlig;erdem gibt uns als Team das Ganze noch einmal ein paar Wochen um uns mit Turnieren und Scrims unsere Synergie aufzubauen und nicht als 5 Randoms irgendwann in Platin Teamranked zu verschwinden, sondern direkt nach Diamant durch zu rushen.\r\n\r\nWas biete ich euch ?\r\nIch biete fundiertes Wissen &uuml;ber League of Legends bezogen auf Pick/Bans, Kompositionen und eine detailreiche Analyse nach jedem Spiel. Au&szlig;erdem haben wir die M&ouml;glichkeit uns einen Coach aus der Highelo (aka D2+) zu rate zu ziehen. Dieser wird jedoch nicht immer an unseren Hacken kleben und uns die F&uuml;&szlig;e lecken. Au&szlig;erdem wird jeder Spieler von mir sorgf&auml;ltig ausgesucht und dann zu 3 Tryout eingeladen , sobald das Team aus 5 Mitgliedern besteht. Wenn ich denke , dass jemand gut spielt, aber nicht besser als die Erstbsetzung dann biete ich demjenigen/derjenigen den Subposten an.\r\n\r\nWas erwarte ich von euch ?\r\nIhr m&uuml;sst mindestens Platin 4 sein und &uuml;ber einen Championpool von 4 Champions verf&uuml;gen. Warum 4? Weil man 3 Bans auf eure Champions fokussieren kann und ihr damit raus seid, was eure Powerchamps an geht. Weiterhin sind 3 Trainingstage geplant mit 4 Stunden Spielzeit (+ - 30 Minuten). Hier kommt ein Punkt , bei dem Wahrscheinlich viel sich denken &quot;hm die nehmen mich allein deswegen nicht&quot; und zwar toxicness. Ein bisschen Salz zur Suppe ist immer gut also keine Scheu ;) . Eure Lane solltet ihr wissen wie man eure jeweilige Lane spielt und in der Lage sein die Lane zu gewinnen oder zumindest neutral rauskommen zu spielen, damit wir keinen Nachteil gegen&uuml;ber den Gegner haben.\r\n\r\nWeitere Fragen oder Interesse? Addet mich Ingame unter: NeverShowMercy\r\nUnd zu guter Letzt: Habt keine Angst, meldet euch, wenns nicht klappen sollte dann halt beim n&auml;chsten Team, aber vielleicht seid ihr besser als ihr denkt ;) Auf ein frohes Teemo- und Rivenmain-T&ouml;ten !","replies":[]}