{"poster":"phatchul","date":"2017-05-22T17:56:29.894+0000","title":"New Udyr ?????????? How to play udyr?","subforum":"Gameplay & Strategy","embed":{"description":"Watching Udyr new S7 New Udyr vs Tryndamere top lane S7 - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - ►Help","url":"https://www.youtube.com/watch?v=vffv6GbZAU4","image":"https://i.ytimg.com/vi/vffv6GbZAU4/hqdefault.jpg"},"up_votes":2,"down_votes":0,"body":"&lt;iframe width=&quot;560&quot; height=&quot;315&quot; src=&quot;https://www.youtube.com/embed/vffv6GbZAU4&quot; frameborder=&quot;0&quot; allowfullscreen&gt;&lt;/iframe&gt;\r\n\r\nBefore I get into how to properly split push, I want to lay down one important rule. Split pushing only works if your team can do something with the map pressure you apply. I&#039;ve seen far too many people afk split push without any regard for where the rest of the team is on the map or what objectives are being contested. If you decide to split push, you have to make sure your team is pressuring another objective so you don&#039;t just feed the enemy team kills without any consequence. If they send more than 1 person for you (which they typically will), your team must be at another objective, using the 4v3 to win the fight, otherwise you&#039;ll die for nothing and your team will be very upset. Also keep in mind that not all comps will work for split pushing, if the enemy team has a pick comp, you need to be VERY careful of split pushing since one pull from Blitz or one assassination from Talon will allow the enemy team to win the fight and the objective before you can even get there. Also keep in mind, never split bot with Baron up, and never split top with Dragon up. These objectives are too important and if you&#039;re on the other side of the map, the enemy team will quickly capitalize on your mistake. Now, onto the actual fun part.\r\n\r\n Udyr is one of the games strongest split pushers. His wave clear is unbelievable once you have rageblade, and he can shred towers incredibly fast. On top of that, he has a very good escape with bear/turtle stances and once he has rageblade he can 1v1 pretty much any champion no matter how fed. Later in the game the enemy team has 2 choices when you&#039;re pushing: Either A, send 2 people to come kill you (which even sometimes you can still 1v2), or B, let you take their towers. So they really don&#039;t have much choice in the matter. Typically teams will send 2 people for you which gives your team a free 4v3 in whichever lane they are pushing. Keep in mind if you are split pushing, make sure the rest of your team is pressuring another lane. If they send 2 for you, your team wins the fight or takes their towers. If they send 0-1 for you, you win the fight or take their towers. So either way your team should win.\r\n\r\nWhen you split push, keep wherever you are splitting very well warded, and keep your eyes on the minimap at all times. You need to have knowledge of where every enemy champion is before you start pushing hard. And again, don&#039;t get lost in your own world! Make sure you&#039;re still grouping for objectives and helping defend when you&#039;re needed.","replies":[{"poster":"my family hp","date":"2017-05-22T17:58:21.867+0000","up_votes":2,"down_votes":0,"body":"nice vid","replies":[{"poster":"phatchul","date":"2017-05-22T18:02:16.626+0000","up_votes":1,"down_votes":0,"body":"thanks you so much","replies":[]}]},{"poster":"TheDemonEmperor","date":"2017-05-23T09:21:27.386+0000","up_votes":1,"down_votes":0,"body":"Sorry to say this, but that video just shown how inexprience you are as a player. \n\n1st of all, you dont max Q then build Iceborn gaunlet... Q is AD scaling, could've went the BORTK, deathdance, or triforce.\n2nd of all, going BC vs no true tank is a waste of BC'S effect.\n3rd of all, that video shown nothing of udyr's potential, all i see is lee camping tryn at all your kills. Later you have more items then him, strategy dont even come into play.\n\nSry to be critical, but when i see the wording, \"how to play\" i expect a good leason.","replies":[]},{"poster":"Talon12","date":"2017-05-22T23:28:17.772+0000","up_votes":1,"down_votes":0,"body":"pretty sure pasting html into the boards doesnt work, moreso without a source.","replies":[]}]}