{"poster":"Messor Animarium","date":"2016-07-07T23:12:21.193+0000","title":"¿Actitud Diamante?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Ultimamente en normales en linea me toca jugar contra diamantes. Yo ahora estoy en plata V (si estuve manqueando xD) y cuando juego contra estos invocadores que generalmente me superan en habilidad (sin gank practicamente no les gano) siempre estan diciendo &#039;&#039;Izi top&#039;&#039; o &#039;&#039;Sin jungla no te la bancas&#039;&#039; entre otros. &iquest;Todos los diamantes son asi? &iquest;Se sienten bien por ganarle en linea a alguien de mucha menos habilidad? Realmente no se, supongo que solo queria hacer un descargue","replies":[{"poster":"KarmaUnder","date":"2016-07-07T23:37:08.616+0000","up_votes":1,"down_votes":0,"body":"Eso es en todas las ligas, yo nunca en mi vida hago eso... cuando mucho lo peor que hace es sacar la maestria despues de una jugada","replies":[]},{"poster":"Conejito Feliz","date":"2016-07-07T23:32:54.872+0000","up_votes":1,"down_votes":0,"body":"Cuando juego con alguien con menos habilidad me cago de risa, pero jamas pongo nada en el chat. Cuando estoy en la smurf me tocan contra bronce 1 y paliza con o sin ganó. Si gankean mejor me hago doble. Jamas pongo nada en chat, aunque me este partiendo de la risa.\n\nEsos diamantes son nenes, con actitud de nene. Sólo que con la habilidad de estar en diamante. Podes tener 5 años y justo ser muy bueno en el lol y sos challenger. Después es de tarado fuera del juego pero bue. \n\nMute y problema resuelto. Mejor aprende como te gana la linda y porque te la gana, de esa forma lo podes aplicar después. Jugando con gente de tu habilidad aprendes mas lento.","replies":[]},{"poster":"IIManeoxII","date":"2016-07-07T23:15:31.222+0000","up_votes":1,"down_votes":0,"body":"tenes que reportarlos eso se llama soberbia!","replies":[]},{"poster":"Rolando Magic","date":"2016-07-07T23:14:18.814+0000","up_votes":1,"down_votes":0,"body":"Eso no tiene nada que ver con diamante hay en todas las ligas, son solo gente soberbia que a la minima la boquean por creerse buenos y generalmente no lo son xD","replies":[]}]}