{"poster":"CustomKunibert","date":"2016-06-21T10:54:13.078+0000","title":"Taliyah W+E-Combo","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey Leute,\r\n\r\nich habe mittlerweile bei Videos auf YouTube gesehen, dass man die W von Taliyah auf den Boden setzen kann und die Richtung bestimmen kann - und die E setzen kann, bevor die W ausl&ouml;st.\r\nIch selbst habe das ingame noch nicht zustande gebracht. Gibt es da einen kleinen Trick, den man beachten muss oder muss man nur sehr sehr schnell alles klicken?\r\nVielen Dank f&uuml;r schnelles Feedback!","replies":[{"poster":"qqd","date":"2016-06-21T12:57:13.824+0000","up_votes":1,"down_votes":0,"body":"Du kannst überhaupt gar nicht W dann E machen weil es nicht triggert... E dann mit W in die Eisfläche kicken. \nEbenfalls gute combos womit nicht viele rechnen ist W in eine bestimmt position am besten wo wenig minions stehen dann schnell Q casten evntl noch ein E hinterher. Solltest du E und W schon treffen + ein paar Q schüsse und es Thunderlord triggert haut es schon gut damage so kannst du gut poken {{summoner:4}}","replies":[{"poster":"CustomKunibert","date":"2016-06-21T12:59:49.984+0000","up_votes":1,"down_votes":0,"body":"Achso, es geht gar nicht? Na das wäre dann die Erklärung für faule. Ich werde es trotzdem mal üben, spätestens dabei bekomme ich ja raus, wie es am besten geht. Danke für die Alternativkombi. Die ist auch cool^^","replies":[]}]},{"poster":"ReallyAnfanger","date":"2016-06-21T11:50:06.689+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt ist mega schwer, wenn du ja die W setzt hast du ja paar millisekunde Zeit bevor der 2 schrittanfangt und da musst du deine E schon gelegt haben.","replies":[]},{"poster":"ReallyAnfanger","date":"2016-06-21T11:39:50.015+0000","up_votes":1,"down_votes":0,"body":"Hey,\nW+E, ist sehr schwer zu timen. Ich empfehle dir erstmal E+W zumachen, aber das schnell. Wenn du schon E drückst, musst du ganz schnell W machen.\nIrgendwann bekommst du die W+E Combo hin. Ich bekomm sie zu 60% hin.\nAber üben üben üben.\nIch hoffe ich konnte dir Helfen.","replies":[{"poster":"CustomKunibert","date":"2016-06-21T11:41:37.999+0000","up_votes":1,"down_votes":0,"body":"Ich hab im Video die W zuerst stehen sehen, du meintest aber, ich soll die E zuerst casten - einfach weil es saver ist?\nOkay, ich übe das vielleicht mal im custom ;)\nDanke dir!","replies":[]}]}]}