{"poster":"Presi","date":"2015-07-17T20:10:57.308+0000","title":"[GOLD+] LF Players for team. (Will be online all day)","subforum":"Team Recruitment","up_votes":1,"down_votes":0,"body":"Hi guys, my name is _Andrew (Almighty GimBim)_, and I am currently Gold 4, and I main adc/support as of recently. I am looking for some people to have a couple of ranked team games with per day.\n\n**What will happen:**\n**1.** I will be shot calling, so people don&#039;t argue about what to do. If I screw up then it is on me. (Tell me in the post-talk what you thought)\n**2.** We will use skype, or curse to communicate (not needed, but preferred)\n**3.** We will be doing post-game reviews of our games. What we did well, what we did poorly. (Roughly 10 mins talk)\n**4.** I will be acting as analyst/Coach as well. I will be recording games and looking at them after we finish and speak to the players individually about improving. This is just a test, i'd like to learn more as well!\n\nIf you are interested in improving as a player, and having a team to help and talk to then use this and apply:\n\n**IRL Name: \nSummoner Name: \nRank + LP: \nDo you have/prefer Skype/Curse?: \nMain Role: \nMain 3 Champions: \nWhy do you like playing LoL?: \nWhy do you like playing on a team?: **\n\nI will be online all-day so add me in-game too if you want!\nCya online ladies/fellas!\n\nEDIT:\nTeam Name: Team No Emotion\nTeam Tag: TeamNE","replies":[{"poster":"Laalaa","date":"2015-07-18T09:30:54.109+0000","up_votes":2,"down_votes":0,"body":"IRL Name: Lee\nSummoner Name: Laalaa\nRank + LP: Gold III 30LP\nDo you have/prefer Skype/Curse?: Skype\nMain Role: Adc/Mid\nMain 3 Champions: Caitlyn/Trist/Ahri\nWhy do you like playing LoL?: I like to challenge myself with the competitiveness that league allows me access to with ranked games\nWhy do you like playing on a team?: I want to improve myself and my skills in a team environment as well as developing better communications with team","replies":[]},{"poster":"Dave","date":"2015-07-21T01:52:44.368+0000","up_votes":1,"down_votes":0,"body":"IRL Name: Dave\nSummoner Name: Dave\nRank + LP: Gold 2 50+LP or something.\nDo you have/prefer Skype/Curse?: Prefer teamspeak, but will download/use whatever VOIP the team uses.\nMain Role: Top\nMain 3 Champions: Singed, Cho'Gath. Can learn anyone, really.\nWhy do you like playing LoL?: Requires strategy to win, it's fun.\nWhy do you like playing on a team?: Playing with mates is always better, better communication.","replies":[]},{"poster":"Naranjak","date":"2015-07-19T06:15:32.897+0000","up_votes":1,"down_votes":0,"body":"IRL Name: Ethan\nSummoner Name: Naranjak\nRank + LP: Gold V \nDo you have/prefer Skype/Curse?: Skype\nMain Role: Mid but I also adc\nMain 3 Champions: Zed, Annie, Vayne\nWhy do you like playing LoL?: Because its a fun game and I want to learn how to be the best that I can at it.\nWhy do you like playing on a team?: Because playing with friends is better","replies":[]},{"poster":"XxToadinationxX","date":"2015-07-18T09:29:39.766+0000","up_votes":1,"down_votes":0,"body":"IRL Name: Jaiden\nSummoner Name: Toadination\nRank + LP: Plat 4 0LP\nDo you have/prefer Skype/Curse?: Skype\nMain Role: Top\nMain 3 Champions: {{champion:31}} {{champion:54}} {{champion:98}} \nWhy do you like playing LoL?: Because it's easier than Starcraft and DOTA\nWhy do you like playing on a team?: Better communication","replies":[]},{"poster":"Sokar","date":"2015-07-18T06:44:08.012+0000","up_votes":1,"down_votes":0,"body":"IRL Name: Lyamm (Liam)\nSummoner Name: Yami no Sora\nRank + LP: G3 90~lp (Peaked P2 last season climbing back up)\nDo you have/prefer Skype/Curse?: Idm\nMain Role: Jungle/Adc\nMain 3 Champions: Jungle - J4 Udyr Vi  Wukong, Adc - Vayne,cait sivir trist\nWhy do you like playing LoL?: Its been a default game for awhile first real game ive put effort into just enjoy it all roundget bored of a champ there plenty of others to learn..\nWhy do you like playing on a team?: Better environment, can enjoy the game to it's fullest.","replies":[]},{"poster":"Skketched","date":"2015-07-18T01:11:32.356+0000","up_votes":1,"down_votes":0,"body":"IRL Name: Liam\nSummoner Name: Skketched\nRank + LP: Gold 4 25 LP\nDo you have/prefer Skype/Curse?: Skype\nMain Role: ADC/JUNGLE\nMain 3 Champions: SIVIR, JINX, REKSAI\nWhy do you like playing LoL?: Been playing for years, for fun and to improve\nWhy do you like playing on a team?: Team environments are always more fun and to win as a coherent group is enjoyable","replies":[]}]}