{"poster":"franco23elmaster","date":"2018-05-23T00:54:36.330+0000","title":"EL SISTEMA DE LEAVERBUSTER ME PARECE INJUSTO (leer plox)","subforum":"Charlas Generales","up_votes":1,"down_votes":7,"body":"Me parece que el sistema con el que te dan cola de baja prioridad debe ser mejorado al 100% me parece super injusto que por un fallo de 5 minutos en el que te volviste a reconectar y volves a jugar lo mas normal, cuando termina hasta te dan honor, pero al sistema no le importa parece, tendria que haber algo que de alguna manera vea el comportamiento en partida despues de reconectarse y que haya mas tiempo de consideracion, porque no todo el mundo se puede reconectar en menos de 5 minutos, porque los que les tarde en entrar pase lo que pase siempre les va a dar cola, y es molesto LA MAYOR PARTE DE VECES, estar dejando de jugar con tus amigos o tener que parar de jugar por ya no tener tiempo para estar esperando 20 minutos, me esta pasando siempre ami porque en mi zona aunque muestre que mi internet es bueno no muestra ni se entera de que pueden da&ntilde;ar la red etc etc, de alguna manera, ahora porque mi internet se cayo ya no puedo seguir jugando con mis amigos en flex porque 4 personas no van a estar esperando 20 minutos por cada partida.","replies":[{"poster":"iESQUILAX","date":"2018-05-23T01:03:51.548+0000","up_votes":2,"down_votes":0,"body":"la verdad que perder 5 minutos de empezado el juego cuesta mucho remotar en linea. No creas que es poca caso es perdida de exp,cs lo cual significa posible perdida de torre a minutos bajos de partida en fin.Me parece sin sentido lo que dices osea tu lo tomas a poca cosa, pero lo cierto es que afecta bastante el early game. Y para que hablarte de medio y juego tardío donde las torres y objetivos caen mucho mas rápido","replies":[{"poster":"franco23elmaster","date":"2018-05-23T01:18:57.906+0000","up_votes":2,"down_votes":1,"body":"Mmmmm me hiciste verlo de otra manera. +10 xd","replies":[]}]},{"poster":"xShadow10","date":"2018-05-23T01:06:04.413+0000","up_votes":1,"down_votes":0,"body":"El leaver buster no te va a penalizar ni por una, ni dos y tal vez ni tres veces que hayas tardado mas de cinco minutos en reconectar. Por otro lado\n>que haya mas tiempo de consideracion, porque no todo el mundo se puede reconectar en menos de 5 minutos\n\nAyer justamente perdí una partida ganadísima porque una Ashe se fue (o se le cayó) por 6 minutos. 6 necesarios minutos para que el enemigo nos remonte y nos gane.\n\nLamentablemente, te tendrás que bancar las consecuencias de estar ausente en las partidas.","replies":[]}]}