{"poster":"APRILIAGAMING","date":"2017-11-10T19:23:13.080+0000","title":"Reclutamento Competitivo e Gioco 4 fun (PC)","subforum":"Reclutamento","embed":{"description":"Step up your game with a modern voice & text chat app. Crystal clear voice, multiple server and channel support, mobile apps, and more. Get your free server now!","url":"https://discord.gg/6Nefuh8","image":"https://discordapp.com/assets/ee7c382d9257652a88c8f7b7f22a994d.png"},"up_votes":1,"down_votes":1,"body":"Buona sera  a tutti videogiocatori vorrei condividere con voi un progetto che ha avuto moltissimi cambiamenti nel corso dei mesi , sto parlando della comunity OceanoEnjoy.Dopo svariato tempo siamo scesi ad un compromesso io ed gli altri admin ed abbiamo deciso di rifondare la comunity inserendo solamente giochi competitivi i seguenti giochi ufficiali all interno della comunity sono (Smite,Overwatch,League of Legends)\r\nStiamo a sua volta cercando persone che giocano a questi determinati giochi per creare dei gruppi competitivi in modo tale successivamente da partecipare a tornei e campionati.Inoltre staremo cercando anche dei Moderatori Collaboratori e Coord.Sez (in basso allegher&ograve; il compito di ognuno di questi ruoli).Oceano enjoy non &egrave; soltanto una Comunity a livello competitivo infatti ognuno ha la possibilit&agrave; di far parte di questa famiglia attraverso il nostro canale discord (https://discord.gg/6Nefuh8) qui infatti avrete la possibilit&agrave; di conoscere player nuovi e con esperienza , avrete la possibilit&agrave; di condividere le vostre idee e opinioni non solo nell&#039; ambito videoludico ma anche attraverso la musica , film,serie tv e tecnologia attraverso i canali testuali appositamente creati per soddisfare ogni vostra passione ed hobby.\r\nVI INVITO A TUTTI DI DARCI UN OCCHIATA E VI AUGURO UNA BUONA GIORNATA\r\n\r\n-Gradi Discord\r\nGRADI DISCORD\r\n1 - Amico del Clan: chi &egrave; amico del clan e/o appartiene ad un&#039;altra clan/community\r\n1.1 - Tempo Limitato: utenti in prova, usabile come monito prima del ban definitivo\r\n2 - Membro: membro ufficiale della multigaming OCEANO ENJOY\r\n3 - Collaboratre: aiuta, regola il team di gioco, sposta gli utenti\r\n4 - Moderatore: gode degli stessi poteri del Collaboratore, modera i canali vocali e testuali, kick utenti, si impegna a far rispettare il regolamento\r\n5 - Coordiatore: gode degli stessi poteri del Moderatore, crea inviti, banna utenti, gestisce i canali, modifica il nick degli utenti\r\n6 - Founder: amministratore della multigaming","replies":[{"poster":"Zedant","date":"2017-11-11T14:37:49.497+0000","up_votes":1,"down_votes":0,"body":"miao","replies":[]}]}