{"poster":"zEROHAMMER","date":"2017-01-31T12:42:38.889+0000","title":"Leerensucher Yorick Skin Konzept","subforum":"Skin- & Champion-Konzepte","up_votes":4,"down_votes":0,"body":"Ich bin schon seit l&auml;ngerer Zeit ein Yorick Main und liebe meinen Totengr&auml;ber &uuml;ber alles. Allerdings finde ich seine Skins langsam langweilig. Ich habe alle\n ( Es sind ja nur 2) und habe gehofft das Riot ihm nach dem Rework mal einen neuen gibt, was aber leider nicht der Fall war.\nDeshalb hab ich mir selbst ein paar Gedanken zum Thema gemacht. (vllt fehlen Rito ja blo&szlig; die Ideen)\nDa ich auf Yorick in jedem Game das Zz rot Portal baue empfand ich einen Void Skin als angebracht. \n{{item:3512}}  \n\nCharaktermodell: Er hat einen Tentakelbart im Gesicht und ein lilanen Void Schleier am R&uuml;cken.\nSein Gesicht &auml;hnelt dem Hai aus der Void Fizz Ulti und seine Schaufel w&uuml;rde er durch eine Void Keule austauschen, welche dem Dreizack des Void Fizz &auml;hnelt.\n\nIch hoffe ihr versteht wie ich das meine. \n\nNun kommen wir zu den F&auml;higkeiten.\n\nPassiv: Die Gr&auml;ber werden von kleinen Portalen in die Leere ersetzt. Diese haben &Auml;hnlichkeiten mit der Rek Sai E.\nDIe Voidlinge w&uuml;rde ich wie die Bilgwasser W&ouml;lfe designen. ( Die in dem Gangplank Spilemodus bei seinem Rework)\n\nQ: Einfacher Schlag nur mit kleinen Voidpartiklen und dem dazugeh&ouml;rigen Ger&auml;usch (&auml;hnlich der Velkoz Q)\n\nW: Portal in die Leere bei dem die Mauern die W&auml;nde ersetzen. Die Mauern sehen &auml;hnlich br&uuml;chig aus wie die Tunnel der REK Sai E.\n\nE: Das Auge das Void Fizz bei seiner R wirft nur etwas durchsichtiger.\n\nR: Ein gro&szlig;er schwebender Tentakelhaufen mit vielen rot leuchtenden Augen der schwebt und die Seele des Opfers in die Leere schickt.\n\nBACKPORT: Er &ouml;ffnet ein Portal in die Leere und wird von mehreren Tentakeln hinein gezogen.\n\nIch hoffe das Riot etwas &auml;hnliches releasen wird.\nVelen Dank f&uuml;rs lesen.\n\nREMEMBER YORICK MORI  {{champion:83}} {{item:3070}}","replies":[{"poster":"Oehli1994","date":"2017-08-16T17:07:38.526+0000","up_votes":2,"down_votes":0,"body":"Gärtner Yorick\nStatt Gräber, Pflanzen die zu Sprösslinge werden\nQ - kann weitesgehend erhalten werden\nW - wird ein Kreis aus Ranken\nE - schüppt er dreck/erde/sand\nR - ist n Baum oder ne Größere Pflanze\n\nDrachentrainer Yorick\nStatt Gräber bleibt fleisch da liegen das Kriechdrachen anlockt oder n Drachenei wo n Drache rausschlüpft\nQ - kann weitesgehend erhalten werden\nW - ein feuerkreis\nE - könnt feuer sein von nen Drachen den Yorick statt sein Grab auffe Schulter hat oder Blut dass die Drachen zum Angriff lockt und die gegner durch nasse Kleidung langsamer macht\nR - ein größerer Flugdrache\n\nArcade Yorick / Schlachtboss Yorick\nDa kann man der Fantasie freien lauf lassen.\n\nPorofreund Yorick\nYorick hat n dicken Pelz an und kämpft Seite an Seite mit seinen Porofreunden.. dazu etwas Eis und Schnee in den Animationen und Zack ist n Winterskin entstanden.\n\nMechaniker Yorick\nYorick kämpft zusammen mit Robotern.\n\nDresseur Yorick?\nMit Zirkustieren.. stell ich mir aber schwer umzusetzen vor da die Tiere ja nicht aus dem nichts kommen können.\n\nYorick Mori\nEin Skin der dem alten Yorick gewitmet ist. Da könnten die jetzigen Animationen sogar bestehen bleiben.\n\nBei einem Yorick Skin stellt sich bei mir immer die Frage: Was könnten seine Anhänger sein und wie könnte man sie animieren.. der Rest, wie Yoricks aussehen, ist pure Fantasie des Programmierers.","replies":[]},{"poster":"Kind Prow","date":"2017-08-16T19:37:00.375+0000","up_votes":1,"down_votes":0,"body":"Drachentöter Yorick, oh ja, OH BITTE!","replies":[]},{"poster":"Slaine669","date":"2017-02-22T10:46:07.630+0000","up_votes":1,"down_votes":0,"body":"Hey Yoricks\nja wird Zeit für ne neue Skin. Bin aber mit der Pentakill schon sehr zufrieden. Deine Idde find ich schon sehr cool. Auf gehts Riot","replies":[]},{"poster":"schmatziHD","date":"2017-01-31T17:08:00.734+0000","up_votes":1,"down_votes":0,"body":"wer ist yorick ? :C","replies":[{"poster":"zEROHAMMER","date":"2017-02-02T09:57:56.790+0000","up_votes":1,"down_votes":0,"body":"Ein liebevoller Mann mit Schaufel.\nDas Lied \"the ace of spades\" wurde nur von ihm inspiriert. kappa {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Shakês Beer","date":"2017-02-01T12:56:20.732+0000","up_votes":1,"down_votes":0,"body":"Da will man gerade einen Thread für Legionär Yorick erstellen, sieht aber, dass da wer bessere Arbeit machte. \nIch find deinen Vorschlag ziemlich gut :)","replies":[{"poster":"zEROHAMMER","date":"2017-02-02T09:55:31.366+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank ^^\nAber du kannst deinen Thread ja trotzdem erstellen.\nIch freue mich immer etwas über den unterschätzten Totengräber zu lesen.\nVllt veröffentlicht Riot ja einen Skin für ihn, wenn sie sehen das viele Spieler einen Skin für ihn haben wollen.\n\n#REMEMBER YORICK MORI {{champion:83}} {{item:3070}}","replies":[]}]},{"poster":"Pxl Dude","date":"2017-01-31T14:54:11.431+0000","up_votes":1,"down_votes":0,"body":"schöne Idee, gefällt mir{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"zEROHAMMER","date":"2017-01-31T15:57:29.522+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank ^^","replies":[]}]}]}