{"poster":"TheSystruction","date":"2016-10-03T01:40:14.930+0000","title":"Una pequeña reflexion sobre los Silver, mis experiencias en esa liga, mis impresiones.","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":2,"body":"Bueno, llego la hora de aportar un poco de seriedad a lo que uno postea en el foro realmente. Hoy les hablar&eacute; un poco sobre mi experiencia en esa liga(preseason  6 silver IV-II, muchas rankeds jugadas en diciembre y enero).\r\n\r\nEs complicado hablar de estos temas, lo reconozco, por el hecho de que tienes que etiquetar gente de esas ligas que quiz&aacute;s no sean asi, pero es un poco necesario poner un poco sobre la mesa las experiencias que uno ha vivido.\r\nBien empecemos: \r\nMi experiencia en esas ligas fue bastante mediocre la verdad, ni me agrado ni me disgusto, puesto que Silver II es un elo donde en general toca alg&uacute;n afk o 2 (frecuentemente) haci&eacute;ndote jugar partidas 3vs5 , recondando que antes NO hab&iacute;a remake, era PL perdido.\r\nLas partidas suelen ganarse en late, puesto a la falta de experiencia de la gente de ese elo para presionar carriles luego de obtener ventaja en el juego temprano, las partidas son largas, tediosas, y hasta aburridas en algunos casos, el equipo que meta mas CC en lategame suele ganar las partidas, asi que si quieres subir algo de elo, he aqu&iacute; un consejo: a no ser que vayas minimo de a 3, juega campeones que domines muy bien en general, que sean campeones de teamfight  y con buen control de masas, es tu pase seguro a una victoria en juego tard&iacute;o si no se presentan inconvenientes(puedes stompear tambi&eacute;n tranquilamente pero aseg&uacute;rate de pickear algo que ne late no decaiga demasiado). \r\nEn silver IV estuve muy poco puesto que fue cerca del reboot, donde todo el mundo iba a trolear con cosas como alistar mid o cosas asi &not;&not; . En silver III se puede jugar a gusto partidas, entre en promo vaias veces a S2 y realmente fue una excelente experiencia, te enfrentas a gente que hasta sabe jugar mejor que tu y aprendes con cada partida que pasa. Eso en cuanto a la experiencia de juego pura.\r\n\r\nPasemos al siguente punto: la gente\r\nHay mucha variedad, pero es frecuente en la l&iacute;nea de medio que los midlaners pierdan mas tiempo hablando y spameando maestr&iacute;as que jugando y farmeando, SI , que remedio, gane muchas partidas aprovech&aacute;ndome de eso y farmeando mientras se quedan quietos escribiendo.\r\nEs normal el flameo, aunque no tan intenso como en Bronce, en bronce se van al carajo, es como si su vida fuera el lol, altos gatitos.\r\nEn cuanto a mis amigos que me contagiaron esa fiebre del LOL, y, no quiero hablar mucho de ellos, porque son mis amigos de la vida real, asi que mejor no tocar mucho ese tema, lo &uacute;nico que voy a decir es que cuando vas con gente que REALMENTE sabe jugar algo te das cuenta de que son unos platitas promedio, de hecho, me hac&iacute;an alto bulling cuando no sabia jugar, realmente recib&iacute; el peor de los tratos en el mundo del lol, son la raz&oacute;n de que me tiltee por cualquier boludez, porque la verdad que en vez de tenerme paciencia, me troleaban a 2 manos, me hac&iacute;an ks, y claro, como yo no sabia jugar, o me la bancaba o me reportaban. Llegamos a tener problemas en la vida real con esto, por suerte, se arregla todo al toque xD. No quiero decir que sean mala gente en realidad, solo que en el juego se comportan de una manera que no resulta muy agradable pero bueno, cada quien con lo suyo.\r\nTambi&eacute;n son numerosos los casos en que te investigan con lolnexus y si jugaste horrendo(para ellos, recuerden, score antes que acciones) siendo plata II o I, uff, te reportan por eloboosteado, yo lo hacia ajajjajajjaja y cuando ibas en premade le clavaban 4 reports al chavon por eloboost en una normal ajajjajaja an&eacute;cdotas divertidas. De ah&iacute; nacio mi odio hacia los premades bronce y silver, de ver lo poco que podes hacer cuando te toca una premade en tu team, y sos el random, tenes que pr&aacute;cticamente jugar a utility rogando porque alguno de ellos se fedee, porque sino, tiran surrender, gg, o te reportan por &quot;manco&quot; (claro campeones, claro), y cr&eacute;ame que entiendo ese dolor cabros, no soy un insensible.\r\n\r\nLa pregunta es: volveria a disfrutar de las partidas de esas ligas nuevamente en caso de subir a Silver(que es lo que estoy intentando, hoy empece a rankear despu&eacute;s de varios meses de inactividad) ?\r\n No, es una liga en la que har&iacute;a todo lo que sea necesario para subir LO ANTES posible, no es una experiencia agradable jugar ah&iacute;, no disgusta tanto como bronce pero no alcanza a ser agradable.\r\n\r\nEso fue todo.","replies":[{"poster":"iCasteGoDx","date":"2016-10-03T01:44:03.956+0000","up_votes":3,"down_votes":0,"body":"Espero un resumen taringuero, comentarlo aca: \n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Kanan","date":"2016-10-03T02:11:28.778+0000","up_votes":2,"down_votes":0,"body":"Plata es una asquerosidad basicamente lo que dijo el chabon y si queres subir elo es mejor que uses a tus super mains maestria 7 y que uno de ellos tenga mucho cc que estompees hasta los webos y emmm ah si que sus amigos le hacian bulling cuando el recien empezaba a jugar \ny que no le gustan los premades en bronce/plata porque te reportan por elobost cuando tenes una mala partida \nBasicamente eso","replies":[{"poster":"TheSystruction","date":"2016-10-03T02:51:01.780+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SlimShady01,realm=LAS,application-id=PJAKt7ph,discussion-id=Wzyw61bW,comment-id=00000001,timestamp=2016-10-03T02:11:28.778+0000)\n>\n> Plata es una asquerosidad basicamente lo que dijo el chabon y si queres subir elo es mejor que uses a tus super mains maestria 7 y que uno de ellos tenga mucho cc que estompees hasta los webos y emmm ah si que sus amigos le hacian bulling cuando el recien empezaba a jugar \n> y que no le gustan los premades en bronce/plata porque te reportan por elobost cuando tenes una mala partida \n> Basicamente eso\n\nno, que es preferible antes que estompear asegurarse un pick que tenga buen juego tardio, y mucho CC, porque las partidas suelen extenderse mucho, debido a que mas que a terminar las partidas, tienden a freezar las líneas para farmear , se creen que con 600 de farm uno es proooo ajajaj y asi pierden {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Kanan","date":"2016-10-03T17:14:48.780+0000","up_votes":1,"down_votes":0,"body":":v yo mido mi cosa pro dependiendo de cuantas veces active la pasiva de jinx :v","replies":[{"poster":"TheSystruction","date":"2016-10-03T20:04:41.725+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SlimShady01,realm=LAS,application-id=PJAKt7ph,discussion-id=Wzyw61bW,comment-id=0000000100000001,timestamp=2016-10-03T17:14:48.780+0000)\n>\n> :v yo mido mi cosa pro dependiendo de cuantas veces active la pasiva de jinx :v\n\nbasicamente, masacrando todo lo que se mueva(y lo que no se mueva tambien Kappa )","replies":[]}]},{"poster":"Ahristócrata","date":"2016-10-03T02:52:52.005+0000","up_votes":1,"down_votes":0,"body":"Cómo te pasó con Tristana?","replies":[]}]}]},{"poster":"TheSystruction","date":"2016-10-03T02:10:41.625+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iCasteGodx,realm=LAS,application-id=PJAKt7ph,discussion-id=Wzyw61bW,comment-id=0000,timestamp=2016-10-03T01:44:03.956+0000)\n>\n> Espero un resumen taringuero, comentarlo aca: \n> {{sticker:slayer-pantheon-thumbs}}\n\nresumen: es una liga de mierda , conde la gente se cree pro, altos gatitos{{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Br1bkn","date":"2016-10-05T03:08:46.522+0000","up_votes":1,"down_votes":0,"body":"buen post men","replies":[]},{"poster":"Nata","date":"2016-10-03T03:53:52.061+0000","up_votes":1,"down_votes":0,"body":"A mi me paso algo bastante raro. Esta season es la primero que rankeo (empeze a jugar en septiembre del año pasado). Despues de las 10 partidas quede en bronce 3 y solo jugaba mid. Casi siempre ganaba mi linea o me feedeaba pero siempre me pasaba que mi team no aportaba casi nada. Llegue hasta bajar a bronce 4 y es cuando me di cuenta que algo no estaba funcionando. Me meti en las paginas de estadisticas y me salio que amumu era el que mayor winrate tenia. Lo empeze a jugar y algo cambio por completo. Lo que yo hacia era dejar todas las kills y que ellos se feeden y me carreen porque cuando yo me feedeaba no la ganaba. Lo mas raro que me paso es que todas las que jugue con amumu me tocaron excelentes teams. Compañerismo, positivdad y entendimiento del juego. Subi a plata 5 en una semana literal. Termine con amumu 80% de winrate y me sorprendi por la gente que me encontre. La verdad yo pienso que de bronce se rescata mucha gente que no arruina la comunidad.","replies":[{"poster":"TheSystruction","date":"2016-10-03T12:33:51.155+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Escaualker,realm=LAS,application-id=PJAKt7ph,discussion-id=Wzyw61bW,comment-id=0001,timestamp=2016-10-03T03:53:52.061+0000)\n>\n> A mi me paso algo bastante raro. Esta season es la primero que rankeo (empeze a jugar en septiembre del año pasado). Despues de las 10 partidas quede en bronce 3 y solo jugaba mid. Casi siempre ganaba mi linea o me feedeaba pero siempre me pasaba que mi team no aportaba casi nada. Llegue hasta bajar a bronce 4 y es cuando me di cuenta que algo no estaba funcionando. Me meti en las paginas de estadisticas y me salio que amumu era el que mayor winrate tenia. Lo empeze a jugar y algo cambio por completo. Lo que yo hacia era dejar todas las kills y que ellos se feeden y me carreen porque cuando yo me feedeaba no la ganaba. Lo mas raro que me paso es que todas las que jugue con amumu me tocaron excelentes teams. Compañerismo, positivdad y entendimiento del juego. Subi a plata 5 en una semana literal. Termine con amumu 80% de winrate y me sorprendi por la gente que me encontre. La verdad yo pienso que de bronce se rescata mucha gente que no arruina la comunidad.\n\nel buen soporte jungla papuuuu xD yo juego tristana full utility, en vez de priorizar el daño en juego temprano(error de muchísimos jugadores de bronce y silver con tristana), cosa que no tiene sentido por el pésimo early que tiene, completar ese {{item:3085}} lo antes posible, para eso en el primer back con 1400 o 1450 de oro, se compra ESTO: {{item:1037}}, esto {{item:1042}} o {{item:1051}} , y unas botas si tienes algo mas de oro, sino solo eso , acompañado por supuesto de un {{item:2043}} y solo una{{item:2003}} , para en el segundo back terminarte el fervor y empezar a castigar las estructuras lo antes posible, la de tu línea para ganar algo de oro extra , dragon, para luego empezar a rotar con el {{item:3085}}  terminado.\nPor que no {{item:3031}}  al principio? Porque tristana escala muy bien con AS en el juego temprano y es capaz de resistirlo con AS, potenciar el ataque básico de tristana en juego temprano no tiene mucho sentido, porque no aprovecha la capacidad de daño del filo infinito hasta el minuto 30, es mejor el runnan y las {{item:3006}} primero por dar la mayor cantidad de ataques básicos con la Q, debido a que es mas rentable maxeaese la E en el principio, por lo tanto hasta nivel 12 o 13 no vas a tener todo el AS, es la razón principal por la que renta el runnan, para nivelar ese terreno en juego temprano, una vez tengas {{item:3085}} {{item:3031}} {{item:3006}} {{item:3094}} , plántate si queres contra cualquier adc, lo bursteas en muy pocos segundos. Tener una tristana con 80% de critico antes del minuto 30, duele(si llegas, porque ya con 2 ítems y las botas derribas torretas muy rápido)\nEn resumen:\nPros de esta ruta: \nInvertis muy bien el tiempo de partida en cosas útiles para tu equipo.\nGran asedio a estructuras a niveles bajos, excelente para empujes divididos.\nGran aporte de daño sostenido en Teamfights de juego temprano gracias al Runnan.\nSi no ganas la partida relativamente rápido(lo que en general pasa con tanto asedio), cuanto mas tiempo pase, mejor, porque una tristana fuera de control, es un problema mayúsculo para el equipo enemigo.\nContras:\nAl principio te rentara farmear y congelar la línea, esperando el gank del jungla para intentar iniciar y llevarte asesinatos y asistencias.\nEres un ADC y soporte todo en uno, por lo tanto es fundamental conservar los {{item:3340}} puesto que necesitas comprar Wards bastante seguido, pues para sacarle provecho a esta configuración deberas invertir algo de tiempo denegando experiencia del rival en su jungla, impedir esas \"remontadas\", tener todo el perímetro cubierto es una buena idea, asi evitas las emboscadas por parte del jungla enemigo.{{item:3363}}  no será tan relevante en Tristana como en otros adc, ya que tiene medios de escape suficientes para no morir en situaciones riesgosas.","replies":[]}]},{"poster":"9081913DEL1","date":"2016-10-03T10:35:48.117+0000","up_votes":1,"down_votes":0,"body":"El problema de plata oro y bronce es al individualidad. Siguen pensando que carrear es farmear matar tirar y hacer todo SOLOS.\nCarrear es empujar al Otro a la victoria, por eso los campeones con cc ayudan tanto a ganar.\n\nEs tan facil y claro, es cuestion de parar a pensar 2 segundos y los errores aparecen solos.\n\nEstoy deacuerdo con lo comentado, latinoamerica juega con la mentalidad del supermario. Nos falta cultura e historia en este tipo de juegos de comunidad.\n\nSaludos.","replies":[{"poster":"TheSystruction","date":"2016-10-03T12:07:43.539+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zelos From Jonia,realm=LAS,application-id=PJAKt7ph,discussion-id=Wzyw61bW,comment-id=0003,timestamp=2016-10-03T10:35:48.117+0000)\n>\n> El problema de plata oro y bronce es al individualidad. Siguen pensando que carrear es farmear matar tirar y hacer todo SOLOS.\n> Carrear es empujar al Otro a la victoria, por eso los campeones con cc ayudan tanto a ganar.\n> \n> Es tan facil y claro, es cuestion de parar a pensar 2 segundos y los errores aparecen solos.\n> \n> Estoy deacuerdo con lo comentado, latinoamerica juega con la mentalidad del supermario. Nos falta cultura e historia en este tipo de juegos de comunidad.\n> \n> Saludos.\n\nclaro como el agua campeón, pero la gente no entiende, alto gatitooo xD es básicamente supermario, con que le pises la cabeza al laner enemigo te conformas jajajaaja , lo mas triste es que como main adc, veo gente que me flamea por morir un par de veces o una vez en fase de líneas, es algo normal, llevo tristana, muy buen early no tengo, por suerte, con tristana tengo tanta confianza en mi mismo que una vez que empiece a rotar , inmediatamente es partida perdida para el rival pues rotar con el runan las botas y un espadón ya empieza a castigar demasiado las torretas, tipo minuto 15 o por ahí una rotación a  mid o a heraldo y ya fue, empezas a empujar a tu enemigo hacia su nexo, o, te aprovechas de que rotan todos a una línea a matar a un singed top(clásico :'v) y vos aprovechas y les haces un agujero en bot xD o a level 5 con tu suport se solean el dragon si tenes la visión adelantada fruto de un buen empuje de lineas xD, esas cosas simples son las que mas ganan partidas, de que sirve ir en dynamic de a 4 si van a jugar una carrera a ver quien carrea o hace mas kills xD, asi no van a ganar nunca a menos que los enemigos sean un poco turbinas xD {{sticker:slayer-pantheon-popcorn}}","replies":[]}]},{"poster":"Ellora","date":"2016-10-03T05:03:13.624+0000","up_votes":1,"down_votes":0,"body":"Desde que instalas el juego y entras en LAS sabe que no hay nivel alguno en esta region.\nCuando la gente entienda que no es un simple juego como el mario y tenga ganas de dejar de ser mediocre y progresar, recien ahi cambiara todo","replies":[]}]}