{"poster":"Best Evelynn OCE","date":"2017-11-06T22:40:00.619+0000","title":"So Riot just significantly increased the XP required to get 30 for no reason...","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"I was 10 games away from Level 30. What does Riot do? TRIPLE THE XP I NEED\n\nI could have easily gotten 30 before Zoe was released on the PBE, but for some reason Riot decided to punish newer players, and make League less welcoming for these newer players.\n\nWith uncapped levelling, there *definitely* should be NO REASON WHATSOEVER to randomly increase this XP...\n\nI have to say I am disappointed Riot...\n\n{{sticker:sg-lux-2}}","replies":[{"poster":"Mozzie25","date":"2017-11-06T22:44:17.543+0000","up_votes":1,"down_votes":0,"body":"I could have sworn they said they were making it easier to get to lvl 30. Maybe you’ll get more xp per game?","replies":[{"poster":"Best Evelynn OCE","date":"2017-11-06T22:57:35.775+0000","up_votes":1,"down_votes":0,"body":"No, you don't. And clearly Riot were lying.\n\nYou get 500 XP for the first win of the day, but that's about it...","replies":[{"poster":"Mozzie25","date":"2017-11-06T23:21:56.204+0000","up_votes":2,"down_votes":0,"body":"TBH I don’t see it as a problem but I’ll go do some research and get back to you. More time playing league before people hit ranked is probably a good thing.\n\nEdit: yeah they say in the FAQ they’re shortening the time it takes to get to level 30 and have it grant more blue essence. https://support.riotgames.com/hc/en-us/articles/115012640908\n\nI would assume they might have moved some of the exp required to the later levels which might be why you suddenly need more. ","replies":[]}]}]},{"poster":"Sewer Side","date":"2017-11-06T23:13:25.415+0000","up_votes":1,"down_votes":0,"body":"Judging by the name, you made a new account around Zoe's announcement.\n\nThe fact it's level 26 in a matter of a few days is kinda too easy. ","replies":[{"poster":"Best Evelynn OCE","date":"2017-11-06T23:57:28.832+0000","up_votes":1,"down_votes":0,"body":"I've had this account for a year. I changed the name, though.","replies":[]}]},{"poster":"Broken Scripts","date":"2017-11-06T22:45:39.866+0000","up_votes":1,"down_votes":0,"body":"ok","replies":[]}]}