{"poster":"Mr Hydde","date":"2015-04-01T12:37:09.703+0000","title":"\"Ward won't help us win.\"","subforum":"Tips & Tricks","up_votes":51,"down_votes":6,"body":"Yep this is every player on all my teams. Even if they are 10k gold over full build they refuse to upgrade trinket. Its actually some sort of mental block. I can&#039;t afford it or its not worth it or its not my job. \r\n\r\nI don&#039;t understand. wards make money.  Why is this hard to comprehend?","replies":[{"poster":"junglerboy16","date":"2015-04-01T17:41:10.421+0000","up_votes":17,"down_votes":0,"body":"People always get mad at me for not getting the Sweeper when I jungle (and I jungle a lot) and then I have to explain that it is pointless because A: The enemy team has no wards. Know how I can tell? They have no open slots, no sightstone (except the support) and their trinkets are always off cooldown. B: None of you (my team) are warding, so it is better for me to get a yellow trinket and a pink ward here or there than to waste switching to a sweeper when we need more wards anyway.\n\nIf the enemy team *does* start buying wards, I'll buy a sweeper and a sightstone and be on my way. Until then, either shut up and ward more  or mind your own business and don't question my choice in vision.","replies":[{"poster":"Spacesuit Spiff","date":"2015-04-02T06:28:47.088+0000","up_votes":2,"down_votes":0,"body":"Yeah, the upgraded trinket just gives too much agency to pass up. I wouldn't go for a red unless the rest of my team upgrades their trinks (never happens) or our jungle is full of wards (also never happens).","replies":[]}]},{"poster":"Stars Shaper","date":"2015-04-01T16:08:09.909+0000","up_votes":6,"down_votes":1,"body":"In urf I can place 3 wards with un-upgraded trinket... OP","replies":[{"poster":"JC DarkOmen","date":"2015-04-01T23:00:02.279+0000","up_votes":12,"down_votes":0,"body":"in *normal* i can place 3 wards with upgraded trinket... *actually* OP","replies":[{"poster":"Stars Shaper","date":"2015-04-02T06:29:45.305+0000","up_votes":1,"down_votes":0,"body":"I know :3 I usually forget to upgrade but not because I don't want to spend money on wards (I buy always at least 1 at each recall no matter my role), it's really a matter to get used to it.","replies":[]}]}]},{"poster":"R33LNAUTI","date":"2015-04-02T00:20:34.849+0000","up_votes":11,"down_votes":0,"body":"After the third consecutive 3-4 man ambush on bot lane.....\n\n{{champion:222}} Leo babe, you planning on buying a sightstone anytime soon?\n{{champion:89}} uhhhhh...? I'm buying items to rek the other team with....\n{{champion:222}} /rolls eyes  uh huh.........\n{{champion:89}} has been slain\n{{champion:77}} has been slain\n{{champion:222}} has been slain\n{{champion:222}} how is that working out so far?\n{{champion:24}} jinx stop trying to tell others how to play, if you want vision then buy some wards, you're trinket isn't even upgraded jeez, I'm not spending gold on wards cuz I need items!\n{{champion:24}} has been slain (he's now 0/5/1)\n{{champion:222}} look i'm just sayin 3 mins ago i was 6/1/4 and luc was 0/4/1, now he's 7/4/3 cuz we've been ambushed 3 times in a row because we have no vision (not a nary ward has been given this game save jinx's trinket) and you can't upgrade trinket until lvl 9...........\n{{champion:1}} has been slain\n{{champion:77}} has been slain (Udyr dies at his chickens, Annie was overextended mid)\n{{champion:41}} {{champion:236}} {{champion:25}} {{champion:103}} LOL they have no vision, this is so easy! Their red is up, lets camp bush and wait for Udyr.\n{{champion:77}} has been slain\n{{champion:24}} has been slain (died in river just behind red while pinging for drag on a dark map)\n{{champion:222}} has slain {{champion:103}} \n{{champion:222}} has been slain by {{champion:41}} {{champion:236}} \n{{champion:222}} can we please get some vision on the map now guys?\n{{champion:1}} stfu if you want vision then buy some wards\n{{champion:77}} I'm not wasting my gold on wards\n{{champion:77}} has been slain\n{{champion:24}} me either\n{{champion:24}} has been slain\n{{champion:24}} why are there 4 top?\n{{champion:89}} this jinx....\nYour turret has been destroyed\nYour turret has been destroyed\nYour inhibitor has been destroyed\n{{champion:222}} /facepalm ok well i've tried asking nicely, I'm not leaving the base area until we have some vision\n{{champion:24}} pings    lets push top\n{{champion:1}} ok\n{{champion:1}} has been slain \n{{champion:24}} has been slain\n{{champion:89}} has been slain\nEnemy team triple kill\n{{champion:77}} Wtf jinx come out here and help (pings drag)\n{{champion:77}} has been slain (trying to solo drag on a dark map)\n{{champion:222}} (while gunning down the super minions at base) told you guys we need vision\n{{champion:1}} stop trying to tell everyone how they should play, you can buy wards you know\n{{champion:222}} I've already spent over 500g on wards, I could've had my IE by now but I guess I don't need damage......\n{{champion:222}} (pings two lanes of super minions at base while watching the team run back out to each lane after revive)\n{{champion:1}} we need to push\n{{champion:1}} has been slain\n{{champion:24}} {{champion:89}}  have been slain\n{{champion:77}} has been slain\n{{champion:1}} omfg jinx would you do something!\n{{champion:222}} da fuk?!? (while spamming everything she had on 4 superminions inches from the nexus turrets)","replies":[{"poster":"Only Play Darius","date":"2015-04-02T11:07:45.308+0000","up_votes":2,"down_votes":3,"body":"If 4 people ambushed you, lets be real the turret wouldn't have protected you.\n\nYou were already dead the moment they decided to 4-man ambush, no amount of vision is going to protect you if they can turret dive and get out alive.","replies":[{"poster":"Nucleophilic atk","date":"2015-04-02T11:12:57.120+0000","up_votes":7,"down_votes":0,"body":"\"No amount of vision is going to protect you\"\n\nRight, because if they see 4 people strolling bot lane, they can't run away or have the top tp or have the jungler/mid rotate down to help.\n\nK.","replies":[{"poster":"Only Play Darius","date":"2015-04-02T11:20:49.419+0000","up_votes":1,"down_votes":0,"body":"Where are they going to run away to? 4 people can easily kill an adc and the support under turret even before level 6, happens all the time in LCS.\n\nAlso, top may not always have his teleport up, and the last thing you want to do is have your mid or jg rotate down to help because then you have allowed them to force a fight, and chances are that if they are trying to force a fight, it's because they know something you don't. It's like when the enemy team is doing a jungle invade and they have a {{champion:53}}. Sometimes, it's best to just let them have the damn buff because there's really nothing you can do about it unless you want to give first blood and fall even farther behind.","replies":[{"poster":"Leti the Yeti","date":"2015-04-02T20:16:12.545+0000","up_votes":3,"down_votes":0,"body":"hi there\nheres a visual representation of where you can run away to in the event you see a 4 man ambush coming\n\nhttp://i.imgur.com/BGVhuZ7.jpg?1","replies":[]},{"poster":"Nucleophilic atk","date":"2015-04-02T11:27:03.279+0000","up_votes":1,"down_votes":0,"body":"Orrrr they are bringing 4 people down because they can't team fight, and are hoping to start picking you guys off.\n\nAlso, you you keep saying no where to run cuz turret dive....you leave the damn turret lol.","replies":[]}]}]}]},{"poster":"Cansema","date":"2015-04-03T16:19:10.350+0000","up_votes":1,"down_votes":0,"body":"i love it... ADC always wants the support to ward when warding is everyone's job...\n\nthats why they made a 3 ward cap..\nthats why they made the free trinket...\nand thats why bronze is still bronze for not understanding this issue","replies":[]}]},{"poster":"SmknWdl","date":"2015-04-01T13:44:01.721+0000","up_votes":11,"down_votes":0,"body":"I was adc one game and I literally bought like 10 wards the whole game... guess how many the support bought... none. No sightstone no nothin","replies":[]},{"poster":"Original Quitter","date":"2015-04-01T18:33:50.623+0000","up_votes":8,"down_votes":0,"body":"I think you should get a bonus 50 ip if you place 10 or more wards in a game. The only way to get dumb NA kids to ward is to give them cookies.","replies":[{"poster":"Only Play Darius","date":"2015-04-02T11:12:49.760+0000","up_votes":5,"down_votes":0,"body":"Commence all the tryhards spamming wards in base and having trinket on cooldown when the wards are actually needed.","replies":[]}]},{"poster":"Only Play Darius","date":"2015-04-01T18:44:38.387+0000","up_votes":6,"down_votes":0,"body":"I have been in games where we were getting out rotated repeatedly and falling behind. I told my team, OK guys, let's all upgrade our trinket, grab some pinks, and get some wards placed.\n\nSuddenly it's comeback season.\n\nEveryone should at least upgrade trinket and 1 pink, and if you are an assassin or support and not warding nonstop then you aren't doing your job and any successful plays you make were because of luck, not skill.","replies":[{"poster":"BluePolarizer","date":"2015-04-02T03:19:08.672+0000","up_votes":3,"down_votes":0,"body":"this.\n\nIf you are any sort of assassin, bruiser or support you HAVE to ward unless that ward will prevent you from a major power spike right then and there (you are exactly at the gold for a jungle enchant, Brutalizer, Hydra, Randuins, Triforce or BoRK for instance).","replies":[]}]},{"poster":"FastAsHeck","date":"2015-04-02T12:05:53.410+0000","up_votes":4,"down_votes":0,"body":"just a friendly reminder that {{item:2049}} is cost efficient to an overpowered level. just do the math, it costs 800 gold, 400 of that is the ruby crystal (which is used to determine the value of hp), so the first 400 gold is cost efficient. the other 400 gold is 4 initial wards -> 75*4=300. there, just after buying it the sightstone has a value of 700 gold. and gives up to 300 free gold every time you back. now whats your excuse? go out there and get some light on the map :D","replies":[{"poster":"RamboDash15","date":"2015-04-02T14:55:33.851+0000","up_votes":2,"down_votes":0,"body":"{{item:3361}} is even more broken if you are playing as a carry. It costs 250 gold and gives two wards on a constant basis. It is rare for you to need more than two wards if everyone else is warding, so it is a super powerful item, but no one thinks to upgrade.","replies":[]}]},{"poster":"DeusVult","date":"2015-04-02T00:26:47.767+0000","up_votes":3,"down_votes":0,"body":"I love picking up a trinket at level 9 with my extra gold and it pays itself off within five minutes just from wards, not even from lives saved\n\nyet, at 35 minutes in, I'm still the only one with an upgraded trinket and the only wards on the map are from me and the support\n\nthey all have the trinket, but after 8 minutes, they never even think to use it again","replies":[]},{"poster":"Waffletimewarp","date":"2015-04-01T13:52:53.442+0000","up_votes":4,"down_votes":1,"body":"Yeah, most of my games have me throwing down between 30-50 wards while the rest of my team barely breaks 10.\n\nExcept for games with friends where we get lax due to skype communication.","replies":[{"poster":"PalPlays","date":"2015-04-01T16:14:44.774+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Waffletimewarp,realm=NA,application-id=WEuoGbmp,discussion-id=KyoB9rUI,comment-id=0002,timestamp=2015-04-01T13:52:53.442+0000)\n>\n> Yeah, most of my games have me throwing down between 30-50 wards while the rest of my team barely breaks 10.\n> \n> Except for games with friends where we get lax due to skype communication.\n\nSame here. I main Jungle and the game will see me placing at **least **20 wards (usually more).","replies":[{"poster":"DrinkMoreWhiskey","date":"2015-04-01T20:48:12.721+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=PalPlays,realm=NA,application-id=WEuoGbmp,discussion-id=KyoB9rUI,comment-id=00020000,timestamp=2015-04-01T16:14:44.774+0000)\n>\n>  at least 20 wards.\n\nahhhhhhhhhhh hahahahahahaha","replies":[{"poster":"PalPlays","date":"2015-04-02T21:40:10.697+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Real Kowboy,realm=NA,application-id=WEuoGbmp,discussion-id=KyoB9rUI,comment-id=000200000000,timestamp=2015-04-01T20:48:12.721+0000)\n>\n> ahhhhhhhhhhh hahahahahahaha\n\nWhat was that about?","replies":[]}]}]}]},{"poster":"Blueclaws","date":"2015-04-01T18:03:19.590+0000","up_votes":1,"down_votes":0,"body":"I think that is the general thought process when you are getting rofl-stomped as more vision probably won't help if you can't fight the enemy team anyway. \n\nI would suggest asking people to ward more before the game really gets going. \n\nOh also I once got told by my support to stop buying wards as an adc.","replies":[{"poster":"Partholonian","date":"2015-04-02T11:33:35.055+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BlueclawsRD,realm=NA,application-id=WEuoGbmp,discussion-id=KyoB9rUI,comment-id=0008,timestamp=2015-04-01T18:03:19.590+0000)\n>\n> I think that is the general thought process when you are getting rofl-stomped as more vision probably won't help if you can't fight the enemy team anyway. \n\nWhich is completely crazy, because the only kind of fight you CAN win when you're behind is an uneven fight, which you can only set up if you have vision.\n\nA team that's behind needs vision MORE than a team that's ahead -- a team that's ahead can just go somewhere as 5 and know that they can handle whoever shows up.","replies":[{"poster":"Blueclaws","date":"2015-04-02T17:43:14.293+0000","up_votes":2,"down_votes":0,"body":"Your right, I would agree with that but it's hard when no one wants to do it. I've been in games were people want to complain that vision won't help. lol","replies":[]}]},{"poster":"Only Play Darius","date":"2015-04-02T11:24:59.251+0000","up_votes":2,"down_votes":0,"body":"But vision allows you to make the picks that turn around stomp matches.......","replies":[]}]},{"poster":"Corrupto123","date":"2015-04-02T10:59:23.136+0000","up_votes":2,"down_votes":0,"body":"YOU MEAN THAT THE AMATEUR NOOBS SAY 'BARD WON'T HELP US WIN'?\n\nYEEEEEEEEEEEAH!\n\n(im jk i love bard the one bard which supported me did the bestest please dont down vote)","replies":[]},{"poster":"TheSkimek","date":"2015-04-01T17:26:29.312+0000","up_votes":2,"down_votes":0,"body":"I got one too: \"Who cares about drake\"","replies":[]},{"poster":"Cakethulhu","date":"2015-07-03T13:07:30.285+0000","up_votes":1,"down_votes":0,"body":"I mained support before I played  any other lane, so i'm just going to pretend every random I end up playing along side is just ignorant.  \n\nThis started blaming me for the loss of  the game, even though, I did my job, i'm sorry that when you have an annie support, the mid lane doesnt get a lot of kills, and does get more asssist. whatever.  Not even my point.\n\nI looked up the history of our match, and I was just like. \"You know what? It says that you didnt buy any wards  nor place any . Maye that's why we lost.\" And so he deleted me form his friends list.","replies":[]},{"poster":"Sonasaurous","date":"2015-04-02T15:17:52.554+0000","up_votes":1,"down_votes":0,"body":"As a support, my first back item is always a sightstone (unless I suck and died before I got 800 gold), and after I get the sightstone I switch to a red trinket. I keep that river warded at all times and ping until I piss off my ADC to ward one of the two bushes in lane. Though even if I can see the enemy coming the gank and I'm sending warning pings to the ADC and I start trying to back off so the ADC will get the message, sometimes they just really aren't paying attention, and if they die then they yell at me \"WHY WASN'T THAT WARDED?!\" and I'm just hugging turret like \".-. bro...\" A lot of people just completely lack map awareness and there is nothing I can do about it, even when I am doing my job.\n\nThough my favorite complaint is when its aroud mid game and everyone is grouped mid (except for the top laner, I dunno why they always stay top so long), and the top laner gets ganked and yells at me \"SUPP SUCKS, NO WARDS\", meanwhile I have the area around mid completely warded because that's where the group is pushing and that's where I am. Can't be everywhere at once.","replies":[{"poster":"Shogunai","date":"2015-04-02T17:47:24.856+0000","up_votes":1,"down_votes":0,"body":"Your first sentence makes me happy, especially being a support main myself. Even though it benefits me more when the enemy support doesn't do this, its really annoying to see someone playing support an doesn't buy a sightstone. Even on aggressive AP supports, a sightstone is a core item. Then I realize the population of support mains is very small an a lot of people play support because they either want fast queues in Team Builder or they are forced to play because all the other roles were called. One thing that really makes support enjoying is your role is the play maker, an a lot of your game success is dependent on our play making ability an overall impact on the game during both lane phase and team phase.","replies":[{"poster":"Sonasaurous","date":"2015-04-02T17:54:46.798+0000","up_votes":1,"down_votes":0,"body":"Even with a sightstone, I have no problems with my AP supp build. I figure, in comparison to a mid lane AP support, the AP supp is generally sacrificing maybe {{item:3135}}  to get the sightstone instead.\n\nI actually shake my head when I see mid lane AP supps, most often Annie or Lux, who don't even take a support item and taken Doran's ring into bot lane. Like, they're losing on gold in general, and considering they're clearly going to try to ks the ADC to \"make up for lost farm\", they probably don't have support masteries, so they'll probably fall behind in exp early. I shake my head and punish them early game. Support is a fantastic role that a lot of people simply don't know how to play because all they care about is their score.","replies":[{"poster":"Amanda Please","date":"2015-04-05T21:41:19.665+0000","up_votes":1,"down_votes":1,"body":"The fun part about mage supports is transforming into another big damage dealing monster late game. Taking all the kills botlane isn't something that should be frowned about since ADCs are entitled to all the farm. This whole \"KS\" thing is fucking stupid. Stop thinking about it as Kill steal. All players should be thinking of it as \"That person needs to die. So who gives a shit about who gets it. Its only 15 creep anyway.\" What mage supports need to do is establish dominance in lane early (idealy with a kill) buy mobis and roam mid to gank or deep ward enemy jungle. \n\nIts true that you SHOULD BUY a sight stone and one of the support items but from then on you build heavy ap. \n\nFalling behind in exp early is more often whats going to happen ANYWAY because supports are supposed to roam.  People used to joke about being \"River Patrol\" all the time but in this meta this is ACTUALLY what supports do now. \n\nYes, the people you are talking about are fucking dumb. But the only thing i can give them a slap on the wrist over is not buying a sightstone or support item. Not taking pure support masteries or getting kills botlane isn't something to scold them over.","replies":[{"poster":"Sonasaurous","date":"2015-04-06T01:09:06.558+0000","up_votes":1,"down_votes":0,"body":"^^Mid lane AP support player. (What gives you away is the \"buy modis and roam\", which is predominately a mid lane tactic. A support shouldn't leave the ADC alone 1v2 in lane early game)\n\nIf you take support masteries and your ADC can farm, you should make just about the same amount of gold as them without taking a single kill. (Utility masteriies + supp item = <3) And KS should mean \"kill secured\", in which the support should secure the kill when the ADC can not get it, but a support should not try to take all the early game kills. The ADCs need those early kills more since a lot of them fall off mid game before their late game power spike. Taking those kills early sacrifices the ADCs potential throughout the game, and need not forget it is the Attack Damage Carry who is supposed to carry the game, not the support.\n\nBesides, I have relatively little problems becoming a fed Sona mid game when the team fights start, even when taking support masteries, having 0 cs, and not taking any early kills. (Which then makes the enemy team fear the support, and then they stupidly target me first. Trollololol)","replies":[{"poster":"Amanda Please","date":"2015-04-06T03:22:13.709+0000","up_votes":1,"down_votes":1,"body":"Everything you say is true. Valid points all around. Then again maybe its because i duo que with an adc main who farms really well (So i never have to worry about him ever being behind the enemy botlane as long as nothing crazy happens). Also this means i can leave him for a little every now and then and help other lanes. \n\n \"A support shouldn't leave the ADC alone 1v2 in lane early game)\" \n\nIf you establish early game dominance by getting an early kill or harassing well enough you well get that lull in the botlane which usually means you sit in a bush for about a minute or two zoning the opposition. Which is cool. But that time could be spent better by warding enemy jungle to organize a pick or just strait up heading mid for an easy kill (Blitz, Leona, Annie)\n\nThe LAST thing you want to do is waste time sitting in a bush doing NOTHING. You already established a presence in lane it doesn't matter if they see you or not. OFC this doesnt mean get them low and leave bot never to return again. Thats not how ap support works at all (Or any supports at all).\n\n1. Establish dominance (effective against squishy early game supports like nami, sona.) You rush 2 as fast as possible and commit to an all in.\n2. Get mobis/sightstone\n3. Ward up enemy jungle/Head mid for gank.\n4. Go back bot. \n\nAnnie/nami/lulu/leona/blitz/taric these are supports you should roam with. \n\nRoam does NOT mean leave botlane and dont come back for 5 mins. It means after buying or during the lulls of botlane battle you go mid or fuck with the enemy jungler.\n\nSure you can as a support sit botlane WITH your adc ALL game and ENSURE HE NEVER DIES but like you said adcs are weaker mid game and have the late game powerspike while MID can spike pretty hard mid game. So by having a LITTLE FAITH in your adc and leaving him ALONE for maybe a MINUTE you can also slingshot the Mid into his spike overall making the game MUCH easier to win. Instead of idk...sitting in a bush for half of laning phase praying your mid player can outplay is counter pick.\n\nOr you can set up wards in jungle and organize a pick since ALMOST ALL JUNGLERS IN SOLO Q decide to go Reksai, Jarvan, Vi, who rush Warrior enchantment and are hella easy to kill wit an ap support.\n\n You might even get the ppl who prefer tank jungles. Voli, Naut, Etc. Assuming you have sej banned (which you totally should). Fun fact about Naut, Amumu, (Who are the more popular tank jungles). THEY CANT CLEAR JUNGLE QUICKLY AT ALL. This means you should be deep warding AND coordinating with YOUR jungle to:\n\n1. Set a pick\n2. Counter Jungle\n3. Counter gank\n4. Just harrass him while hes doing his camps.\n      a. This will force some of his team to rotate to him. Freeing up other lanes to gain advantage with creep or towers.\n      b. Slow his jungle gain because of this extra damage hes taking.\n\nIF YOUR JUNGLER COMPLETES HIS JUNGLE ITEM BEFORE THE ENEMY JUNGLE. You SHOULD TRY AND HELP ORGANIZE PICKS ON THE ENEMY JUNGLE. \n\nTwo different play styles of support exist. True. All i really wanted to say was that ap support has been a thing for awhile now and i also shake my head when i see them not buy a sight stone or a support item. What I don't condone though is giving up kills in the heat of battle because I want him or her to get it. When I blow my load as an ap support I do it so my lane as a whole can get an advantage. So I don't have time or the patience to save spells and ensure a certain person gets it. \n\n\nBut then again. What do I know? I main Braum.","replies":[{"poster":"Sonasaurous","date":"2015-04-06T12:20:01.749+0000","up_votes":1,"down_votes":0,"body":"You seem to be dead set on roaming after establishing early lane dominance. Alright. Consider this:\n\nIf you've established early lane dominance (especially if you get the double kill), then you should know that your chances of getting ganked just increased. Chances are, the enemy jungler will try to pay you a visit with their mid laner not too far behind after the ADC and support come back to bot lane, turning the 2v2 into a 2v4. (And with early game respawn times, that could take about a minute, minute and a half or so for them all to get into position if they get on top of it)\n\nNow, especially if the support took the two kills, the ADC will be behind and likely die unless they have an escape or flash up. If the ADC got the two kills, they stand a better chance (assuming they went back to the store already).\n\nOf course, it could be considered to roam immediately after the kill(s) bot lane if the enemy retreats, but also:\n\n1) do you know where the enemy jungler is? If not, wandering through the jungle and leaving the ADC alone to farm probably isn't a great idea because the jungler may take that opportunity to jump on them (and it doesn't matter if you ward, the ADC will still flame you for not being there if they die just because they weren't paying attention. /hubris kills)\n\n2) I find it is more beneficial to roam mid lane with the ADC. 3v1 puts the odds better in your team's favor than 2v1. But then again, it's not worth the trouble of even going mid if the mid laner on your team is winning lane. What would you really be accomplishing if the enemy mid is already hugging turret? \n\n3) what ever happened to the dragon? Do we just ignore its existence now? I'd rather coordinate with the jungler to get the objectives than the kills.\n\n4) speaking of objectives, did you make sure to secure the bot tower before you left to go roam? Yeah, that's kind of important. If not, it's easy to be like \"omg how did that happen\" when you end up losing your tower instead because you were too busy running around trying to kill everything in sight. As the support.\n\nAnd of course, you make a valid point when you say that supports have better things to do than sit in bushes. But it should also be noteworthy that you shouldn't take too much time to go around warding because the longer you are out of lane, the more gold and exp you are missing out on. Yes, warding is important. You should go in, ward, and then get back to lane. But should you be roaming mid? Which then brings us to the top of this response again.\n\nBut then again, what do I know? I only play support, ADC, and mid (not all in one game, mind you).","replies":[{"poster":"Amanda Please","date":"2015-04-06T22:04:56.571+0000","up_votes":1,"down_votes":0,"body":"Basically. To anyone hoping to learn anything from the conversation me and Le KaiKai is having. You can take away this.\n\nYou actually need to do ALL of these things. What makes the difference between good and great supports is judging WHEN to do these things. Once you know how to outmaneuver the enemy team with well timed roaming you can easily climb to plat. \n\nSupports make a HUGE impact in the game. What i don't like to see are support players who throw that away and just sit botlane. You don't support JUST your adc. You support your TEAM.\n\nIm always willing to play with anyone because ive felt ive hit my glass ceiling. My IGN is HeartOfTheCards. Add me/Invite me. And whenever im on i'll probably play a few games with you. At this point im trying to absorb enough info from many different players hoping to breakthrough my ceiling.\n\n> [{quoted}](name=Le Kaikai,realm=NA,application-id=WEuoGbmp,discussion-id=KyoB9rUI,comment-id=0016000000000001000000010000,timestamp=2015-04-06T12:20:01.749+0000)\n> 2) I find it is more beneficial to roam mid lane with the ADC. 3v1 puts the odds better in your team's favor than 2v1. But then again, it's not worth the trouble of even going mid if the mid laner on your team is winning lane. What would you really be accomplishing if the enemy mid is already hugging turret? \n> \n\nIf the enemy mid is forced under tower they would probably be pretty low. And if not...you can ward the enemy jungle to set up a counter gank which could result in a kill for your mid laner. If a kill does happen...if its on the enemy mid then he gets a wave+ ahead. If its the enemy jungle. You can take dragon or get your jungler to counter jungle. \n\nHell you can even tower dive rather easily if the enemy mid is sitting under tower to afraid to move. (Might want to ask the jungler to help with the tower dive tho.)\n\nIf the mid is hugging tower and is low you can even force dragon. Since they would be down one in the dragon dance. ","replies":[]}]}]}]}]},{"poster":"Shogunai","date":"2015-04-02T18:16:17.177+0000","up_votes":1,"down_votes":0,"body":"You got that right, this game is definitely Call of Duty and running around a blind jungle makes it oh so much fun. Supports is something either you love or you play it just because you feel like you have too but you can always tell when your against a support man an when your not, just the way they use champions gives off a different vibe.","replies":[]}]}]}]},{"poster":"Laughing Fish","date":"2015-04-06T12:28:26.635+0000","up_votes":1,"down_votes":0,"body":"Rito just wants you to *think* wards are necessary to win. They are just a waste of money.\nhttp://i.imgur.com/saM5o.gif","replies":[]},{"poster":"Sirsir","date":"2015-04-06T03:31:07.605+0000","up_votes":1,"down_votes":0,"body":"Well some people in this game are kids who don't understand how the game works. \n\nYou (top lane) buy a ward. 75 gold.\n\nYou place it somewhere good. It spots the Udyr scooting up towards you. You fall back, not giving the enemy team a kill. (what, 200 gold?) You just made 125 gold over the enemy team. Times the amount of times the ward spots a ganker.","replies":[]},{"poster":"blkh1","date":"2015-04-06T01:25:27.622+0000","up_votes":1,"down_votes":0,"body":"I am bronze 3.  I have been playing support a lot.  Generally I start with the ward trinket and the item appropriate for my champ.  I wait until I get enough for a sightstone first time back.  At which point I get rid of vision trinket and get sweeping lens because I now have sightstone.  Initially I use the sightstone just to keep myself and my adc safe in bot lane.  But I only get three wards from it anyways.  I don't generally see a lot of other wards out there.  I then start getting \"hey get your wards out\".  I have been more than happy to, in fact all three that I can are on the map already.  I will get vision wards and place them, but you can only have one pink ward out anyways, that's 4 wards.  Not enough, but no one else really uses that trinket they have already even once, no one upgrades them.  Three per champ just in stealth wards is 15, then one each pink, that's 20.  We don't need them all, just a fraction of those would be nice.  Don't rely strictly on supports and junglers.","replies":[{"poster":"Sonasaurous","date":"2015-04-06T01:29:12.187+0000","up_votes":1,"down_votes":0,"body":"I've noticed lately that by mid game, if I started typing in chat \"hey upgrade your trinkets\" and pinging a few times in bushes with a following \"ward\" message, teammates are more likely to buy the upgrade and ward. Communication works! O.o","replies":[]}]},{"poster":"Phrixscreoth","date":"2015-04-02T19:23:12.444+0000","up_votes":1,"down_votes":0,"body":"It's because it is a consumable item that gives no statistical advantage to either yourself or someone else on the team.  For someone focused on \"doing all the damages\", it seems insane that someone would want you to have to keep buying something that doesn't help you deal damage for the WHOLE GAAAAME.  They don't have any concept of the subtle advantages that you can gain in LoL.\n\nBasically, it's the same thing that causes young kids getting into pokemon to always have pokemon with 4 damaging moves.  If it doesn't make the enemy pokemon's health bar go down, why is it good for me?  Even if you could use a move that does zero damage to make the other guy incapable of actually doing anything.","replies":[{"poster":"Sonasaurous","date":"2015-04-02T19:39:33.952+0000","up_votes":1,"down_votes":0,"body":"There's never a good reason not to get the ward trinket. It's free. It doesn't take up an item slot, so non-support champions don't have to sacrifice their damage to ward.\nThen you should always upgrade your trinket for a measly 250 gold. Then you get 1 free ward a minute (so I do believe it would pay for itself after about 3 to 5 minutes).\nWards are a main advantage in League because vision wins games. Vision saves you from getting ganked early. Vision saves you from 4v1 when you decide to split push.","replies":[{"poster":"Phrixscreoth","date":"2015-04-04T03:12:30.369+0000","up_votes":1,"down_votes":0,"body":"Oh, I know, I don't disagree.  I was simply expressing the point of view of why people wouldn't think that getting a ward and warding regularly is a good thing- even if they are wrong.","replies":[]}]}]},{"poster":"Nefarious Yordle","date":"2015-04-02T23:23:56.039+0000","up_votes":1,"down_votes":0,"body":"This is just one of the many cases of rationalizing one's own mistakes. There's plenty of evidence to back up the fact that warding positively impacts your win rate. Usually the rule goes \"if the entire elite of SoloQ and the entire competitive scene do something a certain way, then that way is superior than any of its alternatives unless proven otherwise by those two establishments\". Why is Hecarim so good? Because he has a high win rate in top-tier soloQ and competitive games. Don't go about trying to list cooldowns and stats, as that would lead to a complicated web of statistical comparisons that will become entirely irrelevant at the first-next patch. This is similar to warding. Sure you can say \"it spots enemies and the reward is bigger than its cost\", but how do you know the reward is bigger than its cost? Does it even matter what the reward is? If you can confirm something works well, you should leave it at that and include that in your own games.\n\nSo, next time people tell you to \"ban <insert non-meta champ> because he's really strong\" or \"warding won't help us win this game\" or any other nonsense, just think of this analysis.\n\nOne last thing I would like to share is how I would deal with this. Unless there's a specific reason not to - for instance when someone asking for a ban has already made clear to be a behaviorally disoriented child by screaming mean things in your team's chat - simply ignore it. You can ask people to do something, but you can't teach them to reason properly, or teach them how to play the game. Not much else to do than to sit back and relax.","replies":[]},{"poster":"Maple Crusader","date":"2015-04-02T17:43:56.734+0000","up_votes":1,"down_votes":0,"body":"That's a silly statement. Good luck trying to win if you can't see the enemy team!","replies":[]}]}