{"poster":"4 1","date":"2017-11-17T13:41:04.487+0000","title":"Mein Rahmen ist verschwunden","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo, ich hatte einen Goldrahmen, doch nun ist er verschwunden. Bevor die Season endete wurde ich Plat 5. ich dachte ich w&uuml;rde nun f&uuml;r die neue Season einen Plat rahmen bekommen, doch nun habe ich gar keinen. F&uuml;r ca. 2 tage war ich Plat 5 mit -14 punkten, liegt es vllt daran?, oder kommen die Rahmen und Belohnungen erst am Anfang der neuen Season? \r\nhabs noch nicht ganz verstanden sry leute x)","replies":[{"poster":"4 1","date":"2017-11-17T14:17:13.985+0000","up_votes":1,"down_votes":0,"body":"Alles klar, vielen Dank Leute, leider hatte ich vor einigen Monaten eine Bestrafung. \nDann liegt es wohl daran :/ \nIhr habt mir sehr weiter geholfen danke euch","replies":[{"poster":"Qbert","date":"2017-11-17T14:19:32.062+0000","up_votes":2,"down_votes":0,"body":"Die Frage ist ob Bann oder Chat-Restriction. Wenn es ein Bann nach dem 23.08. war, bist du die Belohnungen los. Wenn es eine CR war, die vor dem 08.11. abgelaufen ist, solltest du noch welche bekommen.","replies":[]}]},{"poster":"Not2nice","date":"2017-11-17T14:11:57.330+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=021,realm=EUW,application-id=7hciEY9w,discussion-id=Lr6E9m0B,comment-id=,timestamp=2017-11-17T13:41:04.487+0000)\n>\n> Hallo, ich hatte einen Goldrahmen, doch nun ist er verschwunden. Bevor die Season endete wurde ich Plat 5. ich dachte ich w&amp;uuml;rde nun f&amp;uuml;r die neue Season einen Plat rahmen bekommen, doch nun habe ich gar keinen. F&amp;uuml;r ca. 2 tage war ich Plat 5 mit -14 punkten, liegt es vllt daran?, oder kommen die Rahmen und Belohnungen erst am Anfang der neuen Season? \n> habs noch nicht ganz verstanden sry leute x)\n\n\nHallo.\nhatte das selbe dass der rahmen von einem spiel aufs anderen weg war, dies ist jedoch bei einigen der Vorgang auf die neue Season.\nDas heißt:\nbislang hast du zwar das neue Profil gehabt, aber mit dem Strich im Profil und den Rahmen von Season 6.\nDann verschwindet dieser Rahmen /Strich ( bei einigen) und es kommt dann dein Reward von Season 7 eingespielt.\nDies dauerte bei mir 24-48h, bei einigen anderen dauerte es länger, ist bei jeden anders.\nJedoch ist der Termin (glaube ich, muss selbst die Infos durchlesen um das genaue Datum zu bekommen) bis Anfang Dezember bei einem Jeden eingespielt.\n\nVoraussetzung natürlich du hast keine Bestrafungen gehabt.\n\nhoffe dies beruhigt dich und hilft dir ein wenig.\n\nLg euer Youngtimer","replies":[]},{"poster":"Lagging4Freedom","date":"2017-11-17T13:44:33.071+0000","up_votes":1,"down_votes":0,"body":"Wurdest du gebannt oder so? Dann bekommt man keinen.","replies":[]},{"poster":"Gin","date":"2017-11-17T13:43:56.808+0000","up_votes":1,"down_votes":0,"body":"Die Belohnungen werden in Wellen und Schrittweise verteilt. Der Vorgang kann teilweise bis zu 2 Wochen dauern, daher würde ich mich einfach gedulden.\n\nWas Plat 5 mit -15 LP betrifft: Das ist egal. Solange du Platin 5 warst, bekommst du deinen Platin 5 Rahmen. (Voraussetzung ist natürlich dass du in der letzten Zeit keine Strafen für Toxicity und co. kassiert hast.)","replies":[]}]}