{"poster":"Gen","date":"2016-02-13T04:42:25.650+0000","title":"Por que desbalancean tanto a un campeon???","subforum":"Charlas Generales","up_votes":3,"down_votes":2,"body":"Xin esta muy des balanceado es casi inmortal yasuo jax por que ??? por que un campeon que puede hacerse solo el baron? por que? si se supone que es un juego en equipo donde queda la dificultad y destreza que uno puede llegar a tener?","replies":[{"poster":"cajaru977","date":"2016-02-14T00:12:21.429+0000","up_votes":2,"down_votes":0,"body":"Habia un video (No recuerdo cual era pero si lo encuentr lo paso) que decia que se desbalanceaba el juego para que constantemente se hagan estrategias y no se haga monotomo\n\n\nYa que si esta perfectamente equilibrado seria aburrido\nEl tipo dio de ejemplo starcraft, que decia que ganaba el que hacia la estrategia mas rapido, cosa que de verdad es monotoma\n\n\n\nBasicamente, es para que el juego este en cosntante cambio y sea siendo entretenido y que no se vuelva monotomo\n\n\n\n\nEl vide se llamaba \"Desbalance perfecto\" Me parece","replies":[]},{"poster":"Kyousuke","date":"2016-02-13T06:13:27.478+0000","up_votes":1,"down_votes":0,"body":"sera por que no saben focusear ni ganarle?\n{{champion:5}}  es simple, no pega = no se cura, no se cura=muere. que no sepan hacerle focus, que no sepan wardear, que no sepan jugar contra un campeón no significa que este roto, su e tiene mucho cd (12 seg) si lo stunean cuando la gasta se queda sin poder acercarse a pegar y no puede curarse, un ignite no se cura mas un {{item:3033}}  le jode la curación, es fácilmente pockeable, es fácilmente matable de burst, no tiene movilidad, es lento y progresa mas en LATE siendo que actualmente se puede stompear el ealry fácilmente \nes mi main y me da bronca ver cada intento de xin sumando victorias solo por que no saben jugarle en contra. \nel meta va cambiando constantemente para cambiar el juego y que no sea siempre lo mismo una y otra vez (se imaginan un meta de tanques eternos con peleas de 10 minutos y duración de partida de 2 horas??)  ya habían puesto un vídeo explicando eso","replies":[{"poster":"Gen","date":"2016-02-13T16:36:43.525+0000","up_votes":1,"down_votes":0,"body":"siempre aparece alguien que dice es facil le tiras un stun y lo matas.! sencillo.! pero en realidad no es asi por que cuando el top ya le dio dos kill o una nomas es imparable al min 20 ya te esta haciendo el baron  y eso no puede ser  esta bien que tenga fuertes puntos pero exageran  lo mismo el yasuo 100% criticos locos con dos items. este señor xin es fuerte en early y es imparable en late asi nomas no defiendan lo indefendible y esto es del ultimo parche. seguro que te da bronca sumar victorias con tu \"main\" ??\nlos Tanques tienen que aguantar mucho NO PEGAR los asesinos tienen que matar de una los tiradores pegar mucho y guardar la distancia los supports ayudar al equipo los luchadores pegar relativamente bien y aguantar un poquito asi nomas es no hay misterio xin te puede ganar solo tooda la partida y el sentido de trabajo en equipo se va al tacho.\nESAS COSAS CREAN UNA EXPERIENCIA DE JUEGO NEGATIVA.\nel meta debe cambiar pero debe cambiar para todos los campeones de la misma clase asi como paso con los adc todos los adc son fuertisimos pero cada uno a su estilo y los he visto graves destrozando Mf rompiendo todo buenos EZreal buenos caits corkis kalistas entre otros, pero Xin? Jax? yasuo? Mundo??? si no ganas con estos campeones es por que no queres.","replies":[{"poster":"Kyousuke","date":"2016-02-13T16:52:34.597+0000","up_votes":1,"down_votes":0,"body":"sumo victorias por que es mi main y lo vengo usando para rankear desde siempre, si queres revisa mi historial de partidas y veras que no solo lo uso ahora sino de antes por eso se sus ventajas y desventajas, el problema no es que \"defiendo lo indefendible\" es que cualquiera CUALQUIERA que diga lo contrario de lo que decís esta mal y no es la primera vez que veo este tipo de post quejándose de champs y cada que alguien decía lo contrario lo contradicen sin fundamentos. \nsi vas a pelearle cuerpo a cuerpo con un adc OBVIAMENTE te va a matar como haría cualquier pj. esto es lo mismo que con darius y como lo contrarrestan. mira la lcs del año pasado que cuando pickeaban a darius la manera de ganarle era evitando que tenga las marcas y para eso lo kiteaban y darius se quedaba atrás recibiendo daño, es un pj mele, su rango de e no es tan alto, son 12 segundos de cd y para bajarlo SI O SI tiene que pegar las Q, se acerca con la e le metes un stun {{champion:44}} {{champion:412}} {{champion:12}}  un slow {{champion:81}} {{item:3025}},{{champion:150}}  {{champion:201}}  y se queda a medio camino sin poder pegar y llorando por no poder escapar mientras le pegan. \n\nyo ya te dije ahí mismo como ganarle y como joderle la vida a un xin, queda TOTALMENTE en vos si queres aprender a enfrentarlo o llorar por que lo buffaron, no es un asesino con mecánicas para escapar o acercarse como {{champion:238}}  o {{champion:91}}  no es un tanque que se cura toda la vida o saca una vida extra como {{champion:36}} {{champion:223}} {{champion:106}} no es un duelista imparable como {{champion:114}} {{champion:48}} {{champion:92}} . \nsiempre fue un buen personaje xin el problema es que ahora que le metieron el buff se ve mas seguido por que se dieron cuenta que esta bien, igualmente no va a durar mucho, cuando empiecen a decir \"pickearon xin voy a elegir algo mejor {{champion:2}} {{champion:106}} {{champion:154}} {{champion:33}} para contrarrestarlo\" es como todos los metas, cuando algo se vuelve popular por un buff lo que es fuerte contra eso se vuelve popular y después empieza a volverse \"fuerte\" eso popular y se olvidan siquiera por que razón lo elegían","replies":[{"poster":"Gen","date":"2016-02-13T19:19:32.342+0000","up_votes":1,"down_votes":0,"body":"popular por un buff lo que es fuerte contra eso se vuelve popular y después empieza a volverse \"fuerte\" eso popular y se olvidan siquiera por que razón lo elegían\n\ntermine de leer tu comentario y pense en no responderte mas vos defendes lo tuyo y yo en lo que pienso, yo juego normalmente de soporte no me enfrento a xin directamente no soy yo el que le hace daño y nunca estoy solo por que normalmente no meto daño. no iba a responderte y me encontre con este video en facebook creo que dice mas que cualquier argumento que pueda expresarte\n\nhttps://www.facebook.com/shares/view?id=785568698214106\n\ndefender lo indefendible\n\n","replies":[{"poster":"Kyousuke","date":"2016-02-13T19:41:20.782+0000","up_votes":1,"down_votes":0,"body":"empecemos por parte \n \n1. nadie tenia stun en el inicio de la pelea\n2. la syndra cuando llega falla el stun con el que lo podian matar \n3. TODOS se le quedan a melee incluso podes ver como syndra se mete a pegarle ataques basicos en lugar de alejarse y usar la Q  y trundle ponerle un pilar en la cara para que syndra lo ataque de lejos\n4. lo de la poppy esa falla la E, no lo ultea, tira mal la w (en lugar de tirársela cuando se acercaba a tirar la E xin la tira cuando quiere correr) \n5. no muestra los items de NADIE el xin tranquilamente puede estar ahí full build y los otros con 3 items nomas o menos \nen el ultimo segundo muestra las builds y los kda, TODOS estaban fedeando y apenas tenían items, pone a un  {{champion:11}}  en la misma situación y hace lo mismo pero mas rápido tiene el {{item:3146}}  que se cura por la cantidad de daño hecho por eso se cura mas de lo normal.\ny siendo vos el supp sos el principal que debe detener a un xin con cc","replies":[{"poster":"Gen","date":"2016-02-13T23:25:17.082+0000","up_votes":1,"down_votes":0,"body":"1. No era el inicio de la pelea\n2.  syndra ultea sobre el xin y le mete todo el combo\n3. La poppy Muere bajo SU TORRE xin la mata y vuelve a tirar torre sin reiniciar el daño de la torre que recordemos hace mas mientras mas estas bajo de ella\n4. soy el supp no voy a encararle 1 vs 1 dificilmente le voy a ganar (\"Dificilmente\") voy a hacer engage o atraerlo molestarlo si ataca a mi   adc lo cubro lo saco de ensima pero eso no es suficiente\n, 1vs 2 dificilmente.\n5.  el chiste de esto es que es un juego en equipo claramente se ve que el xin solo hace todo mata a todos tira la torre solo y se hace el baron solo eso NO ESTA BIEN. donde quedan las estrategias el posicionamiento etc. si quiero pelear mokete mokete juguemos mortal combat esto NO ESTA BIEN.","replies":[{"poster":"Kyousuke","date":"2016-02-14T00:00:26.338+0000","up_votes":1,"down_votes":0,"body":"la syndra ultea pero sin esferas osea daño mínimo, el xin tenia resistencia mágica {{item:3065}} y la syndra no tenia ni item de penetración mágica ni daño por que como dije fíjate el score, todo el team enemigo estaba FATAL no tenían items ni daño, en esa pelea apostaría todo a que la syndra solo tenia {{item:3174}}  y la mitad del rabbadon, \nlo de la torre tenes razon pero si te fijas la curacion era de 200 y la pasiva de xin no te cura tan exagerado a menos que tengas 400/500 de ap cosa que no tenia ese xin por que ni {{item:3124}}  tenia, se notaba que no hacia el efecto y en eso no te voy a negar lo de la curación pero el tema principal es el item {{item:3146}} y lleva la maestría de robo de vida (fíjate que paso de curarse 280 a 120) por eso aguanta tanto, yo lo estoy usando con fuerza de las edades pero no es mala idea lo de aliento agónico. \ny sos el supp por eso vos sos el que tenes que proteger al adc y evitar que un enemigo feed se acerque a destruir a tu team XD véase {{champion:412}} {{champion:201}} {{champion:63}} {{champion:432}} con su cc","replies":[]}]}]}]}]}]}]},{"poster":"Runth","date":"2016-02-13T16:59:34.798+0000","up_votes":1,"down_votes":0,"body":"para ver lo desbalanceado q es este juego","replies":[]},{"poster":"llzZEUSzll","date":"2016-02-13T04:55:33.291+0000","up_votes":1,"down_votes":0,"body":"Eso por parte enoja un poco, porque nos toco un xin zhao (ni siquiera estaba feed) al que le tiramos con todo y aun asi, cuando estaba bajo de vida, PENTAKILL esta muy roto, con mi main gangplank no logro bajarlo, al igual que darius y jax.","replies":[]},{"poster":"Aiden22","date":"2016-02-13T06:53:35.962+0000","up_votes":1,"down_votes":1,"body":"Algunas veces lo hacen op para vender skins del campeon, como cuando cambian el meta, dejan a una tanda de campeones op para que la gente les guste y compren sus skins.","replies":[]}]}