{"poster":"Elrment 1","date":"2014-12-09T23:37:04.532+0000","title":"FPS dropping recently?","subforum":"[ARCHIVED] Miscellaneous","up_votes":22,"down_votes":1,"body":"Has anyone experienced fps dropping no matter what settings you play on?\r\n\r\nI have a decent rig and I can pull 150+ consistently, but recently its been dropping to 90 regardless in any fight. It is very annoying. \r\n\r\nJust wondering if anyone has experienced this problem!","replies":[{"poster":"CaptnJakSparrow","date":"2014-12-10T10:00:02.096+0000","up_votes":4,"down_votes":0,"body":"I went from playing with 30 fps around constant to 2 to 0 fps in anything but a 1v1 lulz.","replies":[]},{"poster":"PenetrationPaul","date":"2014-12-10T05:20:38.503+0000","up_votes":3,"down_votes":0,"body":"Elrment, this is EXACTLY what has happened to me since the 4.20 patch I believe. I could play the new Rift perfectly for a bit, but then something happened and ever since its been exactly as you described. \n\nNormally I get 60fps rock solid at every graphics setting. Now I get around 35-45 and it varies with action on the screen.\nI can change all settings and the 35-45 fps is constant. \nObviously my computer can handle this game very well because it ALREADY HAS, but now its FKED! And its been fked for weeks now.\n\nRunning Lenovo Ultrabook, Windows 8.","replies":[]},{"poster":"Gandalf215","date":"2014-12-10T06:15:34.883+0000","up_votes":1,"down_votes":0,"body":"I've been getting FPS drops as well as micro lags in game. Logging in can be buggy as well along with checking peoples' profiles. It's so unpredictable that I've avoided SR all together. I've been playing ARAM games.","replies":[{"poster":"Hirok0","date":"2014-12-10T07:30:25.329+0000","up_votes":2,"down_votes":0,"body":">It's so unpredictable that I've avoided SR all together. I've been playing ARAM games.\n\nMe as well.\n\nMy isp has been acting up a little recently, (at the same time every night) but I have noticed ping BOOOOOOM (dead) at random times during the day while my net is 100%. Like, I'll play a game or two and then I'll dc 2-3 times one game and then it'll be fine again for half a game before deciding I should play with a 500ping handicap. Of course, its 80% better now that aatrox is not free-champ and causing errors + 1000 ping.\n\nMy FPS is a solid 60 constantly, even if my ping spikes. Its only this game that has had the lag issue described atm. (no lag on webpages/other games during same ping spikes)","replies":[]}]},{"poster":"Milamber69","date":"2014-12-10T07:17:50.434+0000","up_votes":2,"down_votes":0,"body":"I've had the same issue.  My fps drops down to 2-3 and I can't really do much.","replies":[]},{"poster":"Rikari","date":"2014-12-10T02:02:21.566+0000","up_votes":2,"down_votes":0,"body":"i get 30-60 and it drops to 0\nits like the game pauses but it doesn't\nno it doesn't","replies":[]},{"poster":"Gigglebytes","date":"2014-12-10T00:20:54.998+0000","up_votes":2,"down_votes":0,"body":"I thought it was just my toaster. But if other people are having drops like this it might not be.","replies":[]},{"poster":"trexmixG","date":"2014-12-09T23:45:35.538+0000","up_votes":2,"down_votes":0,"body":"ive been having trouble as well.","replies":[]},{"poster":"Rinky Dinky","date":"2014-12-10T20:12:04.966+0000","up_votes":1,"down_votes":0,"body":"Stop running lol recorder until they put out an update. It will cause you to have 1 fps. Literally.","replies":[]},{"poster":"warpenguin555","date":"2014-12-10T16:30:58.992+0000","up_votes":1,"down_votes":0,"body":"its been happening sometimes to me too.","replies":[]},{"poster":"Buffalo of Lies","date":"2014-12-10T16:07:55.597+0000","up_votes":1,"down_votes":0,"body":"I stopped believing that my framerate issues were on my end a LONG time ago.","replies":[]},{"poster":"A Bad Ahri","date":"2014-12-10T15:27:04.818+0000","up_votes":1,"down_votes":0,"body":"I average about 60 fps normally, but it would drop, even in normal lanes, to about 30 fps.  Only every so often, and only in a couple of matches, but yeah it happens.","replies":[]},{"poster":"DasTolten","date":"2014-12-10T10:14:01.067+0000","up_votes":1,"down_votes":0,"body":"same thing happening to me as well","replies":[]},{"poster":"Wugia","date":"2014-12-10T07:48:31.458+0000","up_votes":1,"down_votes":0,"body":"I've been having the same problem and from what I've experienced, Kalista causes my FPS problems.\nWhenever I get in a game without Kalista, my game is fine but as soon as she's in the game and does anything at all my FPS just drops to like 10-12.","replies":[]},{"poster":"Silents429","date":"2014-12-10T05:27:12.070+0000","up_votes":1,"down_votes":0,"body":"Um. Weird. I get 80fps.\n\nAnd I have an intel integrated :P","replies":[]},{"poster":"TrayvonsSkittles","date":"2014-12-10T03:31:08.769+0000","up_votes":1,"down_votes":0,"body":"This has happened a few times to me. I'm the same, generally around 100+fps but I'll get random spikes and go down to 20 or so. Though for me it usually is early game and seems to fix itself late game","replies":[]},{"poster":"Neidox","date":"2014-12-10T03:15:17.592+0000","up_votes":1,"down_votes":0,"body":"Its happened a few games to me. And I'm on a toaster so the effects are worst.","replies":[]},{"poster":"Xtremey","date":"2014-12-10T02:02:59.682+0000","up_votes":1,"down_votes":0,"body":"lol my average fps is like 60 so i dont see a difference","replies":[]},{"poster":"El Captain Teemo","date":"2014-12-10T01:24:49.423+0000","up_votes":1,"down_votes":0,"body":"I am. I usually have constant 115 fps then outta nowhere it drops to 20 fps.","replies":[]}]}