{"poster":"WC9 Umbra","date":"2018-06-18T14:34:09.923+0000","title":"Ungerechtfertigter Foren-Bann","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":7,"body":"Ich habe vor einigen Tagen einen Bann im Forum bekommen f&uuml;r eine Woche.\r\n\r\n&quot;Dein Kommentar verst&ouml;&szlig;t gegen die Regeln. Infolge dessen wurde er aus den Boards entfernt.\r\nGel&ouml;schter Kommentar:\r\n\r\nDas ist so reudig. Wie kann man so tief sinken\r\n\r\nViolation: Destruktives Verhalten gege&uuml;ber anderen&quot;\r\n(ja der Rechtschreibfehler war in der Meldung)\r\n\r\nJemand hat nach einem Yi f&uuml;r die Tarik Combo gesucht.\r\nIch halte nicht viel davon und finde es Unehrenhaft.\r\nEs ist &quot;playing dirty&quot;, erlaubt aber unehrenhaft.\r\n\r\n&quot;Es ist so reudig&quot; ---&gt; ich finde die Strategie Reudig.\r\n&quot;wie kann man so tief sinken?&quot; ---&gt; ich halte ihn f&uuml;r unehrenhaft.\r\n\r\nIch habe keine Beleidigung ausgesprochen.\r\nWarum bekomme ich f&uuml;r sowas 7 Tage?","replies":[{"poster":"Avorox","date":"2018-06-19T14:52:59.602+0000","up_votes":2,"down_votes":1,"body":"Finde ich in dem Fall auch zu heftig, sowas liest man hier und in den englischen Boards täglich und ich hab noch nie gesehen, dass dafür jemand bestraft wurde. Nur weil es jetzt nicht das netteste war find ich es noch nicht banworthy.","replies":[{"poster":"legofreak1","date":"2018-06-19T15:03:22.271+0000","up_votes":5,"down_votes":0,"body":"Den Ban, der übrigens nur 3 Tage und nicht eine Woche lang war wie vom TE behauptet, gab es, weil er schon mehrfach gegen die Forenregeln verstoßen hat. Wäre dies sein allererster Verstoß gewesen, hätte es dafür wahrscheinlich keinen Ban gegeben.","replies":[{"poster":"WC9 Umbra","date":"2018-06-19T15:19:41.568+0000","up_votes":1,"down_votes":3,"body":"Ich habe in der Vergangenheit mehrmals durch solche Nichtigkeiten strafen bekommen. Jetzt hat es mir gereicht","replies":[{"poster":"legofreak1","date":"2018-06-19T15:35:33.909+0000","up_votes":6,"down_votes":0,"body":"Ich zitiere mal deine bisher für negatives Verhalten gelöschten Kommentare.\n\n> you are one overly sensetive (cant say that word here)\n---\n> Das ergibt keinen Sinn. Was willst du damit sagen? Freu dich.\nToll, du bist vtl Dia oder mehr. Aber das heißt noch lange nicht, dass du ein arrogantes Stück Scheiße sein darfst.\n---\n> das ist kein bug, den man melden sollte. Freu dich und halts maul. sonst wirds noch gefixed.\n---\n> Du bist einfach nur dumm wie Brot. Wie kann man nur so zurückgeblieben sein, dass man selbst einen so simplen Vergleich nicht vesteht. NATÜRLICH ist es keine Straftat, aber es wird nicht gut für das Spiel sein.\nJetzt nochmal für ganz einfach erklärt, dass auch Menschen es verstehen, die auf der Geistigen höhe von Bakterien sthehen.\n\n> Jeder kann machen was er will, dass heißt aber noch lange nicht, dass er es machen sollte oder es eine gute Idee ist.\n\nIm Forum machst du regelmäßig Leute runter, beleidigst diese direkt oder indirekt oder versuchst ihnen zu verbieten im Forum zu schreiben. Das sind keine \"Nichtigkeiten\" und im Nachhinein hätte man mMn die Strafe für deinen letzten Regelverstoß auch härter ansetzen können.","replies":[{"poster":"Raystlin82","date":"2018-06-30T11:15:02.377+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=legofreak1,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=0007000000000000,timestamp=2018-06-19T15:35:33.909+0000)\n>\n> Ich zitiere mal deine bisher für negatives Verhalten gelöschten Kommentare.\n\n...\n\n> you are one overly sensetive (cant say that word here)\n> ---\n>Das ergibt keinen Sinn. Was willst du damit sagen? Freu dich.\n>Toll, du bist vtl Dia oder mehr. Aber das heißt noch lange nicht, dass du ein arrogantes Stück Scheiße sein darfst.\n> ---\n>das ist kein bug, den man melden sollte. Freu dich und halts maul. sonst wirds noch gefixed.\n> ---\n>Du bist einfach nur dumm wie Brot. Wie kann man nur so zurückgeblieben sein, dass man selbst einen so simplen Vergleich nicht vesteht. >NATÜRLICH ist es keine Straftat, aber es wird nicht gut für das Spiel sein.\n>Jetzt nochmal für ganz einfach erklärt, dass auch Menschen es verstehen, die auf der Geistigen höhe von Bakterien sthehen.\n\n>Jeder kann machen was er will, dass heißt aber noch lange nicht, dass er es machen sollte oder es eine gute Idee ist.\n\n...\n\n> [{quoted}](name=legofreak1,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=0007000000000000,timestamp=2018-06-19T15:35:33.909+0000)\n>Im Forum machst du regelmäßig Leute runter, beleidigst diese direkt oder indirekt oder versuchst ihnen zu verbieten im Forum zu schreiben. Das sind keine \"Nichtigkeiten\" und im Nachhinein hätte man mMn die Strafe für deinen letzten Regelverstoß auch härter ansetzen können.\n\n\nder einzige informative kommentar im ganzen thread. an sich kann man alle anderen kommentare loeschen, bis auf diesen und den ersten post.\n\nedit: irgendwie hat das automatische zitat nicht funktioniert. ich versuch es mal von hand.","replies":[]}]}]},{"poster":"Avorox","date":"2018-06-19T16:11:42.203+0000","up_votes":3,"down_votes":0,"body":"Ja gut, dann sieht das Ganze natürlich wieder anders aus, mit den Beispielen von unten ist die Strafe ja verständlich.","replies":[]}]}]},{"poster":"Mad Loony","date":"2018-06-18T15:12:59.082+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Insane257,realm=EUW,application-id=KYnfKGf0,discussion-id=NYmXH8LF,comment-id=0002,timestamp=2018-06-02T14:10:01.287+0000)\n>\n> Ich glaube eher du hast einen Perma kassiert und versuchst hier krankhaft doch noch Rückhalt für dein erbärmliches Verhalten zu bekommen.\n\nIch habe den Kommentar gemeldet, ins Discord zitiert und nem Volu persönlich verlinkt. Er ist immer noch da xD \nVielen die länger im Forum aktiv sind fällt es schwer die Mods ernst zu nehmen. Du kannst aber nichts dagegen machen und musst dich mit sowas abfinden.","replies":[{"poster":"Izaya Kumiho","date":"2018-06-18T15:22:59.722+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=0004,timestamp=2018-06-18T15:12:59.082+0000)\n>\n> Ich habe den Kommentar gemeldet, ins Discord zitiert und nem Volu persönlich verlinkt. Er ist immer noch da xD \n> Vielen die länger im Forum aktiv sind fällt es schwer die Mods ernst zu nehmen. Du kannst aber nichts dagegen machen und musst dich mit sowas abfinden.\n\nDir wurde bereits erklärt, warum man sich in der letzten Sekunde gegen den Deletebutton entschieden hatte.","replies":[{"poster":"Mad Loony","date":"2018-06-18T16:15:04.127+0000","up_votes":1,"down_votes":5,"body":"Weil Beleidigungen mir gegenüber in Ordnung sind?\n\nUnter fast jedem Chatlog hier im Forum wird groß und breit erklärt, das Kontext egal ist.\n\nWenn aber ich als krankhaft und erbärmlich Beleidigt werde, dann, ja dann ist der Kontext natürlich das Allerwichtigste. Die Mods gehen einfach davon aus, dass ich alles aus niederen Beweggründen mache. \n\nDas eigentlich traurige ist aber, dass ich wirklich glaube ein Mod selbst hat den Kommentar mit einem Smurf geschrieben.\n\nEigentlich müsste der Kommentar instant ohne wenn und aber gelöscht werden. Er ist destruktiver als die Aussage hier im Thread wofür es einen 7 Tagesbann gab.\n\nDa gibt es genau gar keine Erklärung dafür, der Kommentar gehört weg. Was glaubst du denn wieso ich die Mods nur noch für lächerlich halte?\n\nDas ist professionalisiertes moderieren nach zweierlei Maß.","replies":[{"poster":"Izaya Kumiho","date":"2018-06-18T16:48:38.469+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=000400000000,timestamp=2018-06-18T16:15:04.127+0000)\n>\n> Weil Beleidigungen mir gegenüber in Ordnung sind?\n\n\nNein. Du hast im Discord wieder versucht, auf deine Diskussion aufmerksam zu machen. \nDir wurde mehrfach dieser Grund genannt.\n\n> Unter fast jedem Chatlog hier im Forum wird groß und breit erklärt, das Kontext egal ist.\n\n<_< ich hab den Mod auch drauf angesprochen duh...\n\n> Wenn aber ich als krankhaft und erbärmlich Beleidigt werde, dann, ja dann ist der Kontext natürlich das Allerwichtigste. Die Mods gehen einfach davon aus, dass ich alles aus niederen Beweggründen mache. \n\n\nActually...\nIm **Forum** ist der Kontext wichtig D:\n\nUnd nein, wir gehen nicht grundsätzlich von niederen Bewegungsgründen aus. Wir behandeln möglichst alle Leute gleich, um fair zu bleiben.\n\n\n> Das eigentlich traurige ist aber, dass ich wirklich glaube ein Mod selbst hat den Kommentar mit einem Smurf geschrieben.\n\n**Wir. Haben. Keine. Smurfs.**\n\n\n> Eigentlich müsste der Kommentar instant ohne wenn und aber gelöscht werden. Er ist destruktiver als die Aussage hier im Thread wofür es einen 7 Tagesbann gab.\n\n\nWeil du diesen Kommentar genutzt hast um auf einen Shtpost von dir hinzuweisen. Loony please, hör mich doch mal zu. Wir hatten das Thema bereits. >w<\n \n> Da gibt es genau gar keine Erklärung dafür, der Kommentar gehört weg. Was glaubst du denn wieso ich die Mods nur noch für lächerlich halte?\n\nurgh...\n\n> Das ist professionalisiertes moderieren nach zweierlei Maß.\n\nWhatever. \n\n./sigh\n\nIch habe versucht dir zu helfen, aber scheinbar kann ich dich echt nicht überzeugen.","replies":[{"poster":"Mad Loony","date":"2018-06-18T17:05:31.021+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Izaya Kumiho,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=0004000000000000,timestamp=2018-06-18T16:48:38.469+0000)\n>\n> Nein. Du hast im Discord wieder versucht, auf deine Diskussion aufmerksam zu machen. \n> Dir wurde mehrfach dieser Grund genannt.\n\nHab ich nicht und das meinte ich, als ich sagte ihr geht von iwelchen Beweggründen aus die nicht stimmen. Mir wurde im Forum erklärt, dass der zitierte Kommentar keine Diffamierung/Beleidigung ist. Ich wollte einfach aus zweiter Hand wissen ob ich wirklich so dämlich bin.\n\nIch war echt froh, als die Leute im Discord die Aussage ohne wenn und aber als Beleidigung gesehen haben.\n> \n> Actually...\n> Im **Forum** ist der Kontext wichtig D:\n\nGut zu wissen. Ich finde es halt schade das dieser \"Kontext\" dazu dient unliebsame Forennutzer anders zu behandeln.\n> \n> Und nein, wir gehen nicht grundsätzlich von niederen Bewegungsgründen aus. Wir behandeln möglichst alle Leute gleich, um fair zu bleiben.\n\nWieso nehmt ihr dann an, dass ich im Discord Aufmerksamkeit für meinen Thread wollte. Das stimmt einfach nicht. Ich wollte einfach wissen ob der Kommentar eine Beleidigung ist. Im Nachhinein hätte ich mir das sparen können, aber es ist halt echt anstrengend wenn dir immer mehrere Leute erklären du liegst falsch und natürlich habe ich in Folge an meiner Sichtrweise gezweifelt. Es handelt sich aber um eine Diffamierung und ich lag von Anfang an richtig.\n> \n> **Wir. Haben. Keine. Smurfs.**\n\nDann check mal beide Forennutzer in der Kommentarkette rund um die zitierte Aussage. Wenn beides keine Forensmurfs sind glaub ich dir, sonst aber sicherlich nicht.\n> \n> \n> Weil du diesen Kommentar genutzt hast um auf einen Shtpost von dir hinzuweisen. Loony please, hör mich doch mal zu. Wir hatten das Thema bereits. &gt;w&lt;\n\nDas stimmt einfach nicht und ist eine Unterstellung. Ich habe das vorher und nachher nie gemacht, wieso geht ihr überhaupt davon aus?\n\n> \n> Ich habe versucht dir zu helfen, aber scheinbar kann ich dich echt nicht überzeugen.\n\nDu willst, dass ich das falsche Verhalten der Mods respektiere. Keine Ahnung wie du mir damit hilfst?","replies":[{"poster":"Izaya Kumiho","date":"2018-06-18T17:15:10.642+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=00040000000000000000,timestamp=2018-06-18T17:05:31.021+0000)\n>\n> Du willst, dass ich das falsche Verhalten der Mods respektiere. Keine Ahnung wie du mir damit hilfst?\n\n\n\"Falsches Verhalten\"\n\n... gnrrr. \nLoony, ...es würde dir mehr schaden, wenn der Kommentar weg wäre. Es wurde extra grade nochmal unter den Mods besprochen.\nWenn du es wirklich nicht verstehen möchtest, können wir nichts mehr für dich tun. So hart es auch klingt...","replies":[{"poster":"Mad Loony","date":"2018-06-18T17:33:25.581+0000","up_votes":1,"down_votes":4,"body":"Die Erklärung von Drexxsack ist schon plausibler als das was ich bisher gehört habe. \n\nIn der folgenden Diskussion wurde die Aussage aber eh zitiert, wodurch der Kontext der Diskussion auch durch ein Löschen erhalten bleiben würde.\n\nSo ganz verstehe ich auch nicht wie es mir schadet wenn eine Beleidigung gegen mich gelöscht wird. Andere Beleidigungen auf die geantwortet wird, werden ja auch gelöscht.\n\nAußerdem habe ich geschrieben, dass ich den Kommentar gemeldet habe und die Mods beurteilen lasse. Durch das nicht Löschen gaben die Mods meinen Diskussionspartner recht, was weder mein Vertrauen in die Mods gestärkt noch mir geholfen hat.\n\nIch habe gegenüber den Mods eh schon längst einen Schlussstrich gezogen. Sollen sie mich halt bannen wenn ich wieder einen Blödsinn schreibe. Aber ernst nehmen kann ich sie auch nicht mehr.","replies":[{"poster":"drexxsack","date":"2018-06-18T18:05:29.406+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=0004000000000000000000010000,timestamp=2018-06-18T17:33:25.581+0000)\n> So ganz verstehe ich auch nicht wie es mir schadet wenn eine Beleidigung gegen mich gelöscht wird. Andere Beleidigungen auf die geantwortet wird, werden ja auch gelöscht.\n\nLiegt an dem sehr speziellen Kontext. \nDir ging es um die Diskussionskultur im Forum und die Unsitten, die es deiner Meinung nach in ihr gibt(ob diese jetzt so ist sind, sei mal dahin gestellt), vor allem darum, dass es durchaus genügend Leute gibt, die ad hominem-argumente benutzen(du hast es in dem Thread diffamierung genannt).\nDass dir natürlich jemand antwortet und dabei eben auf Basis der Person und nicht auf Basis der gebrachten Argumente versucht, deine Thesen anzugehen, war ein Glücksgriff und ideal für dich geeignet, um den Haken wieder auf deinen Eingangspost zu schlagen(was du dann ja auch mit etwas Ironie getan hast).\nDa liegt dann auch schon der Grund warum dieser Post nicht gelöscht wurde. In den meisten anderen Fällen sind persönliche Angriffe nur ein Nebenkriegsschauplatz, aber für diesen Thread war es mitten im Kern der Schlacht (zugegeben wäre es wesentlich heftiger gwesen, wäre es dennoch gelöscht worden).\nDie Enscheidung nicht zu löschen wurde getroffen, als du nur deine Antwort geschrieben hattest(in der das Zitat nicht stand). \nSpäter wurde schlicht nicht revidiert, weil ein Zitat doch immer später in der Kommentarkette kommt und die Leute zum nachvollziehen des ganzen hin und her scrollen müssten, um das Zitat zu finden - es ist schöner, wenn man weniger aufwand hat, etwas nachzuvollziehen.\nDa konnte man das ganze in diesem sehr speziellen Kontext(gerade noch so) stehen lassen.","replies":[{"poster":"Mad Loony","date":"2018-06-18T20:35:59.845+0000","up_votes":1,"down_votes":6,"body":"Ich wollte gar nicht mehr darauf eingehen. Aber sowas lächerliches habe ich schon lange nicht mehr gelesen. Deine Erklärung ist natürlich absolut sinnvoll und und auch nachvollziehbar.\n\nZumindest wenn man auf biegen und brechen eine Beleidigung mir gegenüber rechtfertigen will. Mir als betroffenen wäre es lieber der Kommentar würde gelöscht und mir ist der Kontext dieser plumpen Beleidigung egal.\n\nIst aber interessant das die Mods eine schlichte Diffamierung als Bereicherung der Diskussion sehen. Den Kommentar könnt ihr von mir aus auch stehen lassen, wobei das doch gegen euch spricht.\n\n","replies":[{"poster":"Nordwolf87","date":"2018-06-19T06:19:55.125+0000","up_votes":5,"down_votes":0,"body":"Dass dir das ständige diskutieren mit den Volus und Wrenchis hier nicht langsam zu blöd wird, vor allem wo du in 95% (geschätzt kein empirischer wert) der Fälle im Unrecht bist, ist echt bemerkenswert.\n\nWenn hier alle so böse zu dir sind, dich beleidigen, mobben und zensieren, warum schreibst du dann noch dauernd hier? Ich mein hast du leicht zu viel Zeit?","replies":[{"poster":"Izaya Kumiho","date":"2018-06-19T13:33:17.977+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Nordwolf87,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=0004000000000000000000010000000000000000,timestamp=2018-06-19T06:19:55.125+0000)\n>\n> Dass dir das ständige diskutieren mit den Volus und Wrenchis hier nicht langsam zu blöd wird, vor allem wo du in 95% (geschätzt kein empirischer wert) der Fälle im Unrecht bist, ist echt bemerkenswert.\n> \n> Wenn hier alle so böse zu dir sind, dich beleidigen, mobben und zensieren, warum schreibst du dann noch dauernd hier? Ich mein hast du leicht zu viel Zeit?\n\n\n\nWeisst du was die wirkliche Frage sein sollte? Wieso Loony mehrfach bei mir nachfragte, ob er in meiner Gruppe mitspielen könnte. \n\n\n\n(Er spielte auch durchaus 2-3 Games rmit meinen Freunden und mir. Er war komplett ruhig. Kein trolling, kein flaming, kein garnichts. Der war lieb und freundlich... mit sehr vielen DC's und einem Kühlschrank im Hintergrund...relativ guter Spieler actually. I dunno was da los ist...)","replies":[{"poster":"Mad Loony","date":"2018-06-19T14:43:47.064+0000","up_votes":3,"down_votes":1,"body":"Dude, wieso schreibst du so nen Blödsinn hier ins Forum. Wie wir lol gezockt haben geht genau niemanden was an. \n\nHab meine anderen Kommentare gelöscht, weil sowas nicht hier rein gehört.","replies":[{"poster":"Shacoláde","date":"2018-06-19T14:46:17.968+0000","up_votes":5,"down_votes":0,"body":"> Hab meine anderen Kommentare gelöscht, weil sowas nicht hier rein gehört.\n\n{{sticker:sg-miss-fortune}} ","replies":[]}]},{"poster":"Lotuskobra","date":"2018-06-19T14:25:20.481+0000","up_votes":4,"down_votes":1,"body":"Das ist aber schon frech, ich hab nicht aus dem Nähkästchen geplaudert, nachdem ich mit ML ein paar Spaßrunden gespielt hab ;)\n\nScherz beiseite, ich glaube Loony mag es einfach Leute zu kitzeln und ein wenig zu triggern und das klappt gerade hier im Forum scheinbar ziemlich gut.","replies":[]},{"poster":"Mad Loony","date":"2018-06-19T14:08:51.671+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"Izaya Kumiho","date":"2018-06-19T14:11:28.796+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=000400000000000000000001000000000000000000010000,timestamp=2018-06-19T14:08:51.671+0000)\n>\n> Muss das sein -.-\n\n...möchtest du eine ehrliche Antwort drauf haben?\n \n> Ich hab hier ein Image hochzuhalten.\n> {{sticker:sg-ahri-2}}\n\nWas auch immer das bedeuten soll ;P","replies":[{"poster":"Izaya Kumiho","date":"2018-06-19T14:41:23.691+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=00040000000000000000000100000000000000000001000000000002,timestamp=2018-06-19T14:27:39.536+0000)\n>\n> Keine Ahnung was du überhaupt willst. Du hast übrigens mich geadded und gefragt ob ich mit dir spielen will. Ich bin halt ein paar Tage später wieder darauf zurückgekommen.\n\n\nIch habe dich geadded, das ist wahr. \nJedoch kam die Frage für die Runden nicht von meiner Seite, da mein Grund für die F-request sich damals auf dein Verhalten bezogen hatte. Erinnerst du dich? x3\n\n> Finds auch geil, das du mich in League blockierst, obwohl ich gerade dort anscheinend freundlich war.\n\nDu bist nicht auf meiner Blacklist...\n\nEs steht dir frei, mich für Fragen bezüglich des Verhaltens von XY/dir erneut zu adden. Dafür hatte ich dich auch ursprünglich in der FL. \nDas Angebot bleibt weiterhin bestehen, nur hör bitte auf über Greens zu lästern, wenn du scheinbar doch gerne mit uns spielst.\nThats all.","replies":[]},{"poster":"Izaya Kumiho","date":"2018-06-19T14:15:25.864+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=00040000000000000000000100000000000000000001000000000000,timestamp=2018-06-19T14:13:21.540+0000)\n>\n> Sicherlich nicht hier im Forum!\n\nRofl. Alrighty then.","replies":[]}]}]},{"poster":"Nordwolf87","date":"2018-06-20T12:56:36.313+0000","up_votes":1,"down_votes":0,"body":"Interessant. Vl triggert er einfach gern leute hier.","replies":[]}]}]}]}]}]}]},{"poster":"drexxsack","date":"2018-06-18T17:13:54.532+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=00040000000000000000,timestamp=2018-06-18T17:05:31.021+0000)\n>\n> Hab ich nicht und das meinte ich, als ich sagte ihr geht von iwelchen Beweggründen aus die nicht stimmen. Mir wurde im Forum erklärt, dass der zitierte Kommentar keine Diffamierung/Beleidigung ist. Ich wollte einfach aus zweiter Hand wissen ob ich wirklich so dämlich bin.\n\nNochmal ein letztes mal warum der Post nicht gelöscht wurde.\nDu hast ihn als Beispiel benutzt, um einem (durchaus validen) Punkt anzubringen. In der Situation dir dein greifbares Beispiel wegzulöschen und damit zu nehmen, wäre schlicht und ergreifend dumm gewesen.\nDer Post den du meinst ist sogar einer der wenigen, der einen Downvote bekommen hat( ich nutze die Votefunktion so gut wie nie), dennoch ist ein konkretes Beispiel besser als ein Post mit \"gelöscht\", womit es nur beim Downvote blieb und nicht zur Löschung kam.","replies":[]}]}]}]}]},{"poster":"Darkr3sQ","date":"2018-06-19T09:10:44.596+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=0004,timestamp=2018-06-18T15:12:59.082+0000)\n>\n> Ich habe den Kommentar gemeldet, ins Discord zitiert und nem Volu persönlich verlinkt. Er ist immer noch da xD \n> **Vielen die länger im Forum aktiv sind fällt es schwer die Mods ernst zu nehmen**. Du kannst aber nichts dagegen machen und musst dich mit sowas abfinden.\n\nUnd wieder kommst Du mit einer völlig haltlosen Übertreibung. Du wunderst Dich wirklich, warum Du teilweise von Forennutzern so einen Gegenwind erhältst oder angegangen wirst?","replies":[]},{"poster":"eingew","date":"2018-06-19T04:28:54.902+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Mad Loony,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=0004,timestamp=2018-06-18T15:12:59.082+0000)\n>\n> Ich habe den Kommentar gemeldet, ins Discord zitiert und nem Volu persönlich verlinkt. Er ist immer noch da xD \n> Vielen die länger im Forum aktiv sind fällt es schwer die Mods ernst zu nehmen. Du kannst aber nichts dagegen machen und musst dich mit sowas abfinden.\n\nIronischerweise ist es erfahrungsgemäß genau andersherum...","replies":[{"poster":"Mad Loony","date":"2018-06-19T12:25:12.666+0000","up_votes":1,"down_votes":2,"body":"Macht Sinn, dass du als Mod den gegenteiligen Blickwinkel hast.","replies":[{"poster":"eingew","date":"2018-06-19T13:11:53.838+0000","up_votes":1,"down_votes":0,"body":"Inwiefern? Habe ich als Mod eine geringere Fähigkeit, die Einstellung der Forennutzer mir/uns gegenüber festzustellen?","replies":[{"poster":"Mad Loony","date":"2018-06-19T13:22:57.027+0000","up_votes":1,"down_votes":2,"body":"Du musst dich in die Forennutzer hineinversetzen um deren Blickwinkel zu haben. Ein normaler Forennutzer hat seinen Blickwinkel einfach xD\n\nMacht schon einen Unterschied.","replies":[{"poster":"eingew","date":"2018-06-19T15:57:10.994+0000","up_votes":2,"down_votes":0,"body":"Es ist auch noch kein Mod vom Himmel gefallen. Und dein Blickwinkel ist mit ziemlicher Sicherheit nicht der eines \"normalen\" Forennutzers hast du doch genau diesen bereits mehrfach als dir Verfeindet eingestuft.","replies":[]}]}]}]}]}]},{"poster":"Izaya Kumiho","date":"2018-06-18T15:18:22.478+0000","up_votes":2,"down_votes":0,"body":"Kritik ist nur dann gut, wenn du sie richtig ausführst.\nEinfach nur zu sagen:\"wie kann man so tief sinken\" ist eher unfreundlich und zeigt keine ~~Zeichen von~~ ordenliche~~r~~ Kritik.\n(<_< zeigt..zeichen..eh..)\n\nGute Kritik wäre in deinem Fall z.B. sowas hier:\n_\"Diese Strat finde ich persönlich extrem unehrenhaft, da sie besonders dann schwer zu countern ist, wenn man keine Bans zur Hand hat.\"_\n\nBegründe deine Aussagen und bleibe freundlich dabei.","replies":[{"poster":"WC9 Umbra","date":"2018-06-18T16:03:52.411+0000","up_votes":1,"down_votes":5,"body":"Unfreundlich sein ist kein vergehen.\nIch habe ihn nicht beleidigt.","replies":[{"poster":"Izaya Kumiho","date":"2018-06-18T16:09:17.322+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Óne Dunk Man,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=00050000,timestamp=2018-06-18T16:03:52.411+0000)\n>\n> Unfreundlich sein ist kein vergehen.\n> Ich habe ihn nicht beleidigt.\n\nWürdest du dich freuen, wenn jemand zu dir unfreundlich ist? Außerdem ist ein respektvoller Umgang im Forum erwünscht.","replies":[{"poster":"WC9 Umbra","date":"2018-06-18T16:24:27.544+0000","up_votes":1,"down_votes":4,"body":"Nein, das ist aber völlig egal. Ich respektiere, dass mein gegenüber das sagen darf.","replies":[{"poster":"Izaya Kumiho","date":"2018-06-18T16:51:29.449+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Óne Dunk Man,realm=EUW,application-id=KYnfKGf0,discussion-id=44g1AEtR,comment-id=0005000000000000,timestamp=2018-06-18T16:24:27.544+0000)\n>\n> Nein, das ist aber völlig egal. Ich respektiere, dass mein gegenüber das sagen darf.\n\nWieso sollte das egal sein? Nicht jeder respektiert unfreundliches Verhalten. Nur weil du es tust, muss das nicht auch jeder andere User.\n\nIch würde es z.B. überhaupt nicht okay finden, wenn du mir sowas unter einen Thread klatscht.","replies":[{"poster":"WC9 Umbra","date":"2018-06-18T17:23:28.155+0000","up_votes":2,"down_votes":3,"body":"Nur weil Jemand beleidigt ist heißt das nicht, dass es auch eine Strafe geben sollte. Wo wären wir denn dann?","replies":[{"poster":"eingew","date":"2018-06-19T04:27:15.517+0000","up_votes":2,"down_votes":0,"body":"In einem Forum mit Regeln zum Beispiel:\n\n> **Sei kein Idiot**\n> Wir wollen die Community mit dem größten Sportsgeist werden, sowohl im Spiel als auch außerhalb davon. Nur weil ihr anonym seid, gibt euch das keinen Freibrief zu miesen Umgangsformen. Beiträge, die daneben langen, werden gelöscht. Wiederholungstäter können dauerhaft ihren Platz vor der Tür beanspruchen.\n> \n> _Moderatoren werden bei Folgendem einschreiten:_\n> ● Wenn Spieler Inhalte posten, die von anderen als extrem beleidigend wahrgenommen werden können.\n> ● Wenn Spieler ein Individuum oder eine Gruppe auf unangemessene Weise angreifen.\n> ● Wenn Spieler sich besonders unkonstruktiv verhalten oder private Angelegenheiten breittreten, die nichts zur aktuellen Diskussion beitragen.\n\nDer dritte Stichpunkt dürfte dich im Besonderen interessieren.","replies":[]}]}]}]}]}]},{"poster":"Abasin","date":"2018-06-19T05:43:59.067+0000","up_votes":1,"down_votes":0,"body":"Bezogen auf \"wie tief muss man sinken\" sehe ich das auch eher entspannt. Es ist keine wirklich freundliche Art, seine Abneigung gegen gewisse Verhaltensweisen anzuzeigen, aber auch in meinen Augen eher keine Beleidigung im engen Sinne. Es mag unangebracht sein, ja. Aber für sich genommen eigentlich nicht bannwürdig. Leider kenne ich den ganzen Kontext nicht, kann mir aber beim TE schon vorstellen, dass er sehr exzessiv mit Kraftausdrücken um sich wirft, so dass es in der Summe sicher für einen Bann reicht.","replies":[]}]},{"poster":"Hakkuu","date":"2018-06-18T14:51:51.364+0000","up_votes":2,"down_votes":2,"body":"Unpopular opinion:\nWenn es wirklich nur das war, was er zitiert hat, ist der Ban meiner Meinung nach ungerechtfertigt.\nFinde es nicht destruktiv, und auch nicht beleidigend. Natürlich kann man netter sein, aber wenn ich mir anschaue wie Leute die hard-flamen über mehrere Tage hinweg Posts spammen, die alle um ein Vielfaches toxischer sind (auch Leuten im Forum gegenüber), verstehe ich nicht wie die damit widerum durchkommen.","replies":[{"poster":"Noxempire","date":"2018-06-18T14:57:02.259+0000","up_votes":2,"down_votes":0,"body":"Ich denke, es hängt auch mit der Art des Threads zusammen. Unter Clans&Teams andere Leute anzugreifen, ist schon was anderes als wenn jemand in Champions und Gameplay extra einen Thread über die Kombi macht. Es hat ja wirklich nur jemand nen Taric/Yi Spieler gesucht. \n\num die Richtlinien zu zitieren:\n\n>Allgemein gilt, dass sich alle Besucher der Foren/Boards respektvoll gegenüber den anderen Nutzern verhalten sowie eine zivilisierte Diskussionskultur pflegen sollten.\n>","replies":[{"poster":"drexxsack","date":"2018-06-18T15:02:12.492+0000","up_votes":3,"down_votes":0,"body":"Korrekt","replies":[]},{"poster":"WC9 Umbra","date":"2018-06-18T16:05:18.328+0000","up_votes":1,"down_votes":3,"body":"Ich habe doch niemanden angegriffen. Ich war halt etwas unfreundlich, aber das ist noch lange kein vergehen.","replies":[{"poster":"Zyzyx","date":"2018-06-18T16:22:07.972+0000","up_votes":1,"down_votes":0,"body":"> Ich war halt etwas unfreundlich, aber das ist noch lange kein vergehen.\n\nDoch. \n\nDer entsprechende Teil der Forenregeln ist dieser hier:\n\n> **Sei kein Idiot**\nWir wollen die Community mit dem größten Sportsgeist werden, sowohl im Spiel als auch außerhalb davon. Nur weil ihr anonym seid, gibt euch das keinen Freibrief zu miesen Umgangsformen. Beiträge, die daneben langen, werden gelöscht.","replies":[]}]}]}]},{"poster":"Shacoláde","date":"2018-06-18T14:37:33.052+0000","up_votes":4,"down_votes":3,"body":"Support wird sich deinen Thread bald wieder anschauen... hab ihn nämlich gleich nochmal gemeldet.\n\nGruß\nDein {{champion:35}} lade","replies":[{"poster":"WC9 Umbra","date":"2018-06-18T14:38:16.635+0000","up_votes":2,"down_votes":1,"body":"bitte was?","replies":[{"poster":"Shacoláde","date":"2018-06-18T14:39:50.141+0000","up_votes":3,"down_votes":2,"body":"Ach.. wie ist das schön ... <3","replies":[{"poster":"WC9 Umbra","date":"2018-06-18T14:41:01.625+0000","up_votes":2,"down_votes":1,"body":"Also keine erklärung? Du willst das jetzt einfach so hier stehen lassen?","replies":[]}]}]}]}]}