{"poster":"WC9 Umbra","date":"2018-07-07T09:56:50.302+0000","title":"Meine Einschätzung der Elos","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":1,"body":"Bronze: Spielt noch nicht lange, oder es ist ihm egal\r\nSilber: Hat sich ein paar Gedanken &uuml;ber das Spiel gemacht, versteht aber den Gro&szlig;teil nicht.\r\nGold: Im Groben wird das Spiel verstanden, aber man ist noch zu Faul Fehler zu vermeiden (Warding, overextening). Es wird haupts&auml;chlich im Autopilot gespielt.\r\n\r\nPlatin: Spiel wird verstanden, Fehler nehmen ab. Autopilot ist nicht mehr das Ganze spiel Aktiv und es werden einige Fehler selbst bemerkt\r\nDia: Autopilot sollte abgestellt sein.\r\n\r\nDas ist so das, was ich von den verschiedenen Elos erwarten w&uuml;rde.\r\nHabt ihr was hinzuzuf&uuml;gen?","replies":[{"poster":"A Ryze From Dead","date":"2018-07-07T13:48:16.998+0000","up_votes":1,"down_votes":0,"body":"Ich gebe dir im groben Recht, habe aber andere Erfahrungen gemacht und werde die hier mal mitteilen.\n\nIch verstehe aber nicht was bei dir \"Autopilot\" ist und was das mit der Elo zu tun hat und ich betrachte im folgenden nur Spieler die das Spiel ernst nehmen und nicht geistig oder körperlich gehandycapt sind:\n\n>Bronze: Spielt noch nicht lange, oder es ist ihm egal\n\nStimmt nicht, man kann auch einfach nur schlecht sein. Ja, das gibt's wirklich.\nEs fehlt meistens grundlegendes Spielverständnis bei Bronzespielern. Itembuilds, Championfähigkeiten, Matchups, einfache Mapawarness.\n\n>Silber: Hat sich ein paar Gedanken über das Spiel gemacht, versteht aber den Großteil nicht.\n\nIch behaupte Silber Spieler haben weite Teile des Spieles schon verstanden, machen aber zu regelmäßig zu fatale Fehler (microplay, macroplay).\n\n>Gold: Im Groben wird das Spiel verstanden, aber man ist noch zu Faul Fehler zu vermeiden (Warding, overextening). Es wird hauptsächlich im Autopilot gespielt.\n\nStimme ich zu, ich behaupte auch das Goldspieler für gewöhnlich keine potente Spielweise aufzeigen, meist solide aber nie überragend.\n\n>Platin: Spiel wird verstanden, Fehler nehmen ab. Autopilot ist nicht mehr das Ganze spiel Aktiv und es werden einige Fehler selbst bemerkt\n\nDie meisten Spieler geben sich hier schon etwas mehr Mühe. Zum Allgemeinwissen haben Platinspieler meist auch sehr tiefes Spezialwissen zu bestimmten Aspekten im Spiel, mit denen sie Punkten können. Mechanische Fehler sollten sich hier auch lichten, so hörte ich.\n\n>Dia: Autopilot sollte abgestellt sein.\n\nDia V, IV: Platinspieler die es zu etwas gebracht haben.\nm>Dia III: Die Elite von League of Legends. Spieler die zumindest zu einem Zeitpunkt das Spiel und die Meta in ihren Nuancen verstanden haben und sich als mindestens 20% eines Teams behaupten können.\n\n\nIch vertrete auch die Ansicht dass für gewöhnlich zwei Divisionen Unterschied ausreichen damit der eine den anderen mit überlegenen Gameplay alleine stompen kann.","replies":[{"poster":"Awsane","date":"2018-07-08T12:17:04.972+0000","up_votes":2,"down_votes":0,"body":"Ich denke mit Autopilot ist die Fähigkeit gemeint ingame sich selbst und das Spiel aktiv zu reflektieren und darauf Entscheidungen zu treffen.\n\nDazu gehören Dinge wie Items der Gegner checken und dementsprechend zu handeln. Die Fähigkeit nicht im Jetzt zu verharren sondern auch in die Zukunft ingame schauen zu können und zu überlegen \" was wird mein Gegner tun\". Zum Beispiel das wenn man gegen einen Fiddlesticks spielt sich absichtlich von blind spots fernhält bzw sie kennt um nicht in eine Ult von ihm zu laufen bzw sie vllt sogar absichtlich zu baiten etc pp. .\n\nAlso generell nicht mehr überrascht zu werden im allgemeinen. \n\nUnd einen aktiven Plan zu haben, wie man gewinnen will und den dem Spiel auch anpassen zu können wenn nötig und diesen Plan dann auch verfolgen. \n\n\nGanz vereinfacht gesagt aktives nachdenken während des Spiels über alles was nicht auf deinen Bildschirm gerade passiert.","replies":[{"poster":"A Ryze From Dead","date":"2018-07-08T15:04:03.548+0000","up_votes":1,"down_votes":0,"body":">Ich denke mit Autopilot ist die Fähigkeit gemeint ingame sich selbst und das Spiel aktiv zu reflektieren und darauf Entscheidungen zu treffen.\n\nIch dachte es wäre anders herum. Oder ist Autopilot jetzt doch die Fähigkeit?\n\nDas hört sich im Ganzen erstmal ganz plausibel an, aber was du beschrieben hast hat soviele Grade, dass man es kaum für Unterscheidung von Divisionen nehmen kann. Ich meine ein Bronze Spieler reflektiert auch während des Spiels über seine Spielweise. Items der Gegner werden ab Silber auch angefangen gecheckt zu werden. Gegner predicten können Bronze Spieler auch in gewisser Hinsicht.\n\n","replies":[]}]}]},{"poster":"DanionVibit","date":"2018-07-07T10:56:55.414+0000","up_votes":1,"down_votes":3,"body":"Bronze bis Gold ist ein Einheitsbrei ohne viel Unterschied... (Gold wird ja nicht umsonst 'Shine Bronze' genannt) \n\nAb Platin beginnt es dann etwas zu diffundieren... Aber auch noch kein hoher skill vorhanden (Sind dann die Leute die es etwas mehr als nur casual spielen) ... \n\ndas geht dann weiter bis Dia 3 wo die Skilldifferenz zu den anderen elos stark ansteigt.","replies":[{"poster":"A Ryze From Dead","date":"2018-07-07T13:20:52.050+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ÐanionVibit,realm=EUW,application-id=YnZkMR0R,discussion-id=g4QAeYmT,comment-id=0003,timestamp=2018-07-07T10:56:55.414+0000)\n>\n> Bronze bis Gold ist ein Einheitsbrei ohne viel Unterschied... (Gold wird ja nicht umsonst &#x27;Shine Bronze&#x27; genannt) \n> \n> Ab Platin beginnt es dann etwas zu diffundieren... \n\nDas ist etwas was ich von jemanden erwarten würde der gerade so aus Gold raus ist.","replies":[]},{"poster":"Nordwolf87","date":"2018-07-07T11:00:15.268+0000","up_votes":1,"down_votes":0,"body":"Naja ich finde zwischen Silber und Gold ist ein rel. großer Sprung im Microplay und den mechanischen Fähigkeiten.","replies":[]}]},{"poster":"Noxempire","date":"2018-07-07T10:12:44.543+0000","up_votes":1,"down_votes":0,"body":"Abgesehen davon, dass jeder einen eigenen Spielstil hat und man nicht jeden Spieler anhand seiner Elo kategorisieren sollte, gilt diese Theorie natürlich auch nur für die Leute die aktiv Ranked ich spielen :p \n\nBspw. bin ich Gold IV in Flex und Silber 2 in Solo/Duo, hab aber gerade Mal 12 Games (abseits der Promos) gepsielt. Ähnlich war's in den letzten Seasons. Bin irgendwie zu faul, für die ganze climb-Geschichte \n\nWie groß man sich da ein Urteil über mein Spielverständnis erlauben kann ist fraglich ^^ \n\nEbenso ist es mit Leuten wie Maxim. Haben mehr Wissen als die meisten Leute (vermutlich sogar mehr als mancher Challenger), aber einfach nicht die Zeit oder die Mechanics aufzusteigen. \n\nGilt zwar nicht unbedingt für mich, aber ich sollte vielleicht einfach Mal wieder Ranked zocken um es herauszufinden xD","replies":[{"poster":"WC9 Umbra","date":"2018-07-07T10:15:34.529+0000","up_votes":1,"down_votes":0,"body":"Erst ab 100+ SPielen kann man wirklich einen Trend erkennen.\nRanked KANN besser als normals sein. Je nachdem wie deine einstellung ist.","replies":[]}]},{"poster":"Alpacana","date":"2018-07-07T10:01:03.517+0000","up_votes":1,"down_votes":0,"body":"Ich würde sagen bis dia 4 eingeschlossen wird größtenteils mit autopilot gespielt aber ansonsten stimme ich dir größtenteils zu.","replies":[]},{"poster":"Enderized","date":"2018-07-07T10:00:07.981+0000","up_votes":1,"down_votes":0,"body":"Joah Ggf. zu Bronze bis Diamond 2 hinzufügen: \nBlaming anderer Mitspieler und konstantes Flamen ohne Grund um sich blos nicht auf Spiel fokussieren zu müssen.","replies":[]}]}