{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-10-28T23:14:38.120+0000","title":"Rotating game mode queue now live!","subforum":"Announcements","up_votes":4,"down_votes":2,"body":"[ÜRES]","replies":[{"poster":"EatCrayons","date":"2016-10-29T00:19:11.992+0000","up_votes":25,"down_votes":4,"body":"Who wants to join me and sing the doom song, now?","replies":[{"poster":"Fondling Gems","date":"2016-10-29T01:01:26.367+0000","up_votes":17,"down_votes":1,"body":"I'm gunna sing The Doom Song now! \r\nDoom doom doom doom doom, \r\ndoom doom do DOOM, \r\nDOOOM doom do-doom, \r\nDOOM do-doom doom doooom, \r\ndoom doom dooom, do-do-DOOOM! \r\n\r\n(6 months later) \r\n\r\nDoom doom doo doom doom, \r\nDOOMY-DOOMY-DOOM, \r\ndoom do do DOOM, \r\nDo do DOOM, \r\ndoomy-doomy-doomy, \r\nDoom doom doom THE END\r\n\r\nI have an Invader Zim Doom Song blanket.","replies":[]},{"poster":"CloudedLogic","date":"2016-10-29T02:03:21.810+0000","up_votes":7,"down_votes":2,"body":"\"**Any players who leave a game of Doom Bots forfeit their icon.\"\r\n\r\nI'm a little annoyed by this. What counts as leaving a game? Say I have a connection failure, do I lose the option then?","replies":[]}]},{"poster":"Man lvl 2","date":"2016-10-29T00:55:04.505+0000","up_votes":10,"down_votes":29,"body":"Why do we have doom bots AGAIN? where is URF!! This is supposed to be ROTATING game mode not Here play the same crap again mode. Disappointing weekend again.","replies":[{"poster":"Fondling Gems","date":"2016-10-29T01:01:53.945+0000","up_votes":12,"down_votes":2,"body":"All new game modes get 2 weekends in a row.","replies":[{"poster":"APerfidiousDane","date":"2016-10-29T01:03:00.642+0000","up_votes":6,"down_votes":1,"body":"Like Ascension?","replies":[{"poster":"Fondling Gems","date":"2016-10-29T01:09:06.149+0000","up_votes":19,"down_votes":1,"body":"I don't know why we are getting ascension twice. However that has 0 impact on the fact that all new gamemodes get 2 weekends in a row.\r\n\r\nAlso plenty of people enjoy those other gamemodes.  Just because you don't like them as much doesn't mean that they shouldn't get playtime.","replies":[{"poster":"rezzful","date":"2016-10-29T02:44:14.781+0000","up_votes":8,"down_votes":3,"body":"They should get playtime but not any more or less playtime than the fan favorites. One for all is way more popular than any mode besides URF and that has not been played since september. Ascension has been rotated in 3 times before the next one for all and ascension is probably the worst mode besides poro king which also gets more playtime than urf or one for all. ","replies":[]},{"poster":"APerfidiousDane","date":"2016-11-12T08:38:58.043+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fondling Gems,realm=NA,application-id=Ag8jgd8Q,discussion-id=gOuEU5Jx,comment-id=0006000000000000,timestamp=2016-10-29T01:09:06.149+0000)\n>\n> I don&#x27;t know why we are getting ascension twice. However that has 0 impact on the fact that all new gamemodes get 2 weekends in a row.\n> \n> Also plenty of people enjoy those other gamemodes.  Just because you don&#x27;t like them as much doesn&#x27;t mean that they shouldn&#x27;t get playtime.\n\nGametime, sure. Two weekends in a row is kind of lame though.","replies":[]},{"poster":"iTz Mr Cuddlez","date":"2016-11-02T14:24:39.110+0000","up_votes":1,"down_votes":1,"body":"Fondling Gems, the Hiden comment one.. Was Downvoted by MAd Freesm bronze9 fans and by some RIOT games dik suckers. you guys are so DUmb if you let RIOT Games force you to play that r3tarded mediocre Doom bots game.. ","replies":[{"poster":"Fondling Gems","date":"2016-11-02T17:10:40.711+0000","up_votes":1,"down_votes":0,"body":"?  First of all, I am not forced to play it.  All the other basic game modes are always available.  Seconds of all, plenty of us love doombots.  Personally one of my favourite game modes.  Just because you don't feel that way doesn't mean that others don't love it.  Third, It isn't as though we choose which game modes are available.  \n\nLastly, why would you be so insulting to others that you have never met and know nothing about?  To break down your insult:\n\nCalling people Bronze 9 is just silly.  Even if Bronze 9 existed being bad at a game by no means invalidates one's opinion.  A person who was in a theoretical position such as Bronze 9 has just as much of a right to an opinion as anyone else.\n\nCalling people \"dik suckers\" is also a terrible way to insult people.  The basis is that sucking dicks is an inherently bad thing, which simply isn't true.  As such trying to insult people in that way simply shows that you are insensitive to the current social awareness trends that move in defense of GLBT populations, which is what the origin of the insult is directed at.  This only reflects badly on yourself, so what you are actually doing is insulting yourself, rather than others.\n\n--------------------------------------------\n\nIn the future try to take the time to think about the opinions of people on both sides of the argument, don't assume what others think, and think about whether what you are saying is insulting others, or just insulting yourself.\n\nIf you do have to insult others, at least be intelligent about it.  Your words reflect badly on yourself and appear as little more than the writings of an idiot.  No one cares what idiots have to say.  If you want your words to be considered try to be sensible about it.","replies":[]}]}]}]}]},{"poster":"Soireal","date":"2016-10-29T01:49:08.301+0000","up_votes":1,"down_votes":0,"body":"because its the teemoing and its a theme thing plus it would be all random urf most likely ","replies":[{"poster":"Fluxer","date":"2016-10-30T02:35:38.381+0000","up_votes":5,"down_votes":0,"body":"All random surf isn't that bad, keeps people from picking the same super annoying champs every game.","replies":[]}]}]},{"poster":"Cirrusstrafe","date":"2016-10-28T23:59:28.105+0000","up_votes":19,"down_votes":6,"body":"Am I the only one that loves Ascension and wish it were always active?\r\n\r\nAscension is this happy place I can scratch a specific itch in if I want to just knuckle down on some good ol' constant teamfighting but without towerdiving (unlike DND), with dynamic fights and kiting potential (unlike ARAM), without extremely warped gameplay (unlike Siege, Hexakill, OFA/AFO, PORO, URF), where I can pick-ban (unlike ARAM again) from a large viable champ pool (unlike literally every other RGM).  I know gameplay is warped by the ascended, but since the changes to ascended acquisition I almost never see anyone go ascended until late stage momentum triggered from an ace.\r\n\r\nI, for one, welcome our back to back Xerath overlords.","replies":[{"poster":"Starfrost64","date":"2016-11-01T02:01:15.994+0000","up_votes":1,"down_votes":0,"body":"I'm so glad I'm not the only one who loves Ascension! Looking forward to those weekends!","replies":[]}]},{"poster":"Soireal","date":"2016-10-29T01:50:25.695+0000","up_votes":8,"down_votes":1,"body":"people before doombots came back omg wheres doombots we want doombots people after it omg why doombots we dont want doombots ","replies":[]},{"poster":"DiBSKay","date":"2016-10-29T18:33:48.139+0000","up_votes":6,"down_votes":1,"body":"If new game modes get two weekends in a row, why didn't AR URF get two weekends? Bring urf or ar urf back please thank you.","replies":[{"poster":"Catsup Watsup","date":"2016-11-01T03:59:15.068+0000","up_votes":5,"down_votes":0,"body":"AR URF is my fantasy.  I'll just be happy if they keep it in the rotation.  It should be more frequent, though...","replies":[]}]},{"poster":"M00nKryzalid824","date":"2016-10-29T17:37:40.802+0000","up_votes":5,"down_votes":0,"body":"Me: Doombots is up again. Alright more lifesteal Sion with friends.\r\n*Sees Poro King*\r\nALRIGHT!. Time to spam Aurelions Sol. They will fear the god dragon.\r\n*Sees Ascension*\r\nAWESOME! Im ready for the brawler domination.\r\n*Sees Ascension again*\r\n…wut?\r\n\r\nDon’t get me wrong riot. I really love this line-up (Ascension is my favorite gamemode, followed by Poro King). I’m just confused with why Ascension is 2x in a row. Are you guys testing out some new stuff for it or what?\r\n","replies":[]},{"poster":"Omega CLC ","date":"2016-10-29T06:39:43.675+0000","up_votes":5,"down_votes":0,"body":"Do you still get the icon for doing the Teemoing or is it only the gauntlet? Because last week i beat the Teemoing a few times, but every time i tried the gauntlet everyone voted level 100 and we got wrecked.. ","replies":[{"poster":"Catsup Watsup","date":"2016-11-01T03:55:33.580+0000","up_votes":1,"down_votes":0,"body":"I won a Teemoing game but lost on the Gauntlet, and I got an icon","replies":[]},{"poster":"Tori9516","date":"2016-11-01T03:15:33.272+0000","up_votes":1,"down_votes":0,"body":"Hoping someone has an answer to this. Hoping to have earned the icon from winning Teemoing.","replies":[]}]},{"poster":"Qemy","date":"2016-10-30T17:39:54.597+0000","up_votes":7,"down_votes":2,"body":"Plz, replace one of Ascensions with URF, don't give us a reason to riot.","replies":[]},{"poster":"Feàthers Fly","date":"2016-10-29T15:33:40.070+0000","up_votes":7,"down_votes":2,"body":"Riot you should bring out a game mode like \"back to season 2\" Where like alll the reworks and champs and items that were in season 2 are back and theres the old map the old dragon baron etc\r\n","replies":[]},{"poster":"Wert the Wacky","date":"2016-10-28T23:25:51.698+0000","up_votes":4,"down_votes":0,"body":"Lolololololol in before double ascension hate.","replies":[]},{"poster":"III Monkey III","date":"2016-10-30T01:46:45.294+0000","up_votes":5,"down_votes":1,"body":"Why the F! is there 2 ascension mode?!?!?!?!!?!?!?!?!?!","replies":[]},{"poster":"Bot Kappa123","date":"2016-10-29T19:25:51.360+0000","up_votes":5,"down_votes":1,"body":"ascension twice why!!!!!!!","replies":[]},{"poster":"Cosnirak","date":"2016-10-29T08:29:03.978+0000","up_votes":5,"down_votes":1,"body":"I would love to hear some reasoning behind the choice to not change poro king at all and to have two weeks in a row of ascension.","replies":[]},{"poster":"How Do You Meta","date":"2016-10-29T01:55:32.126+0000","up_votes":1,"down_votes":0,"body":"Do we get an icon for beating level 100 on the gauntlet mode?","replies":[{"poster":"Soireal","date":"2016-10-29T06:15:31.553+0000","up_votes":3,"down_votes":0,"body":"not lv 100 specifically but you still get an icon for winning doombots ","replies":[]}]},{"poster":"Soireal","date":"2016-10-29T01:48:13.715+0000","up_votes":3,"down_votes":0,"body":"so just wondering, who has actually won doom bots? i did today.","replies":[{"poster":"How Do You Meta","date":"2016-10-29T02:00:09.913+0000","up_votes":2,"down_votes":1,"body":"I beat level 100 two times.","replies":[]}]},{"poster":"darkdill","date":"2016-10-29T00:07:16.156+0000","up_votes":3,"down_votes":0,"body":"Can we get some info on what hidden stats the Doom Bots get?\r\n\r\nFor instance, you could build 200 MR against a group of magic bots, and they wouldn't need Void Staff to kill you in an instant. That tells me there's hidden shenanigans and that they have hidden MPen.","replies":[]},{"poster":"Im 0n Grindr","date":"2016-11-04T18:00:54.054+0000","up_votes":2,"down_votes":0,"body":"TBH RIOTS SHOULD MAKE 3 WEEKS OF URF!! THAT ALL WE NEED! {{sticker:slayer-jinx-catface}} ","replies":[]},{"poster":"PhallusDiller","date":"2016-11-03T08:00:45.813+0000","up_votes":2,"down_votes":0,"body":"Bring back Black Market Brawlers. ","replies":[]},{"poster":"OHMI Malware","date":"2016-11-01T12:13:16.110+0000","up_votes":2,"down_votes":0,"body":"Been playing all day and I haven't won, I really wanna\r\nBut I'm DOO-OO-OOOOMED\r\n\r\nhon I'm 13 and won 10 teemoings and a lvl 50 gauntlet, what else can I ask for? :3","replies":[]},{"poster":"YeaMarshallSucks","date":"2016-10-31T14:14:07.808+0000","up_votes":2,"down_votes":0,"body":"URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF URF URF URFURF URF URF","replies":[]},{"poster":"ProfessorTactics","date":"2016-10-29T06:12:51.615+0000","up_votes":2,"down_votes":0,"body":"Pls bring back the old ascension it should be a game where u try to seal the ascended","replies":[]},{"poster":"Wandering Katana","date":"2016-10-30T00:46:31.847+0000","up_votes":1,"down_votes":2,"body":"ive won a game of doom bots but  i havent gotten the icon and i played it when it was on last week\r\n","replies":[{"poster":"TheLastShadow45","date":"2016-10-31T20:16:24.490+0000","up_votes":2,"down_votes":0,"body":"You have to wait for the event to end (11/3), but then it can take up too two weeks after to get the icon.","replies":[{"poster":"Lazerel","date":"2016-11-02T06:52:55.304+0000","up_votes":1,"down_votes":0,"body":"Thanks, was wondering that myself after beating the game mode many times with {{champion:25}} ","replies":[]}]}]},{"poster":"TheLastShadow45","date":"2016-10-29T21:19:52.057+0000","up_votes":2,"down_votes":1,"body":"Why Ascension two times in a row? I don't see the point of doing that. Can you replace it with something like AFO or nemesis draft?","replies":[]},{"poster":"SQ Troll","date":"2016-11-19T20:15:47.535+0000","up_votes":1,"down_votes":0,"body":"While I appreciate the effort put in to make these game modes more available, I cant help but feel like certain game modes are being pushed way harder than others. I've played Ascension/Poro King so many times its ridiculous. I don't ONLY want urf, but I would like to play a little more One For All or Urf or Hexakill, but i think hexakill should be on the rift, just my opinion.\r\nTL;DR - Be more fair on the rotations, make an actual schedule, not just throwing the same thing out.\r\nSuggestion- I know Riot won't like this, because the players would, but here goes - Make all of them available under custom matches, you'd be surprised how many trolls left ranked games, and how many others would appreciate having something fun to do.","replies":[]},{"poster":"shattered tv","date":"2016-11-16T14:46:47.243+0000","up_votes":1,"down_votes":0,"body":" Isn't A.R. U.R.F. supposed to be in rotation this weekend? Has Riot ever done a poll of what game modes are preferred? Maybe this would be a good time to start. Personally, game modes such as Poro King, Ascension, and Hexakill aren't very fun, but everyone favors maps differently, so I figured a poll would work well. OR and just here me out on this : A permanent URF mode. ","replies":[]},{"poster":"JOOOHNCEENA","date":"2016-11-11T03:33:40.355+0000","up_votes":1,"down_votes":0,"body":"Can You put out urf again pls","replies":[{"poster":"JOOOHNCEENA","date":"2016-11-11T03:34:01.981+0000","up_votes":1,"down_votes":0,"body":"Or even just make it a permanent gamemode maybe??\r\n","replies":[]}]}]}