{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2015-08-06T19:02:22.268+0000","title":"Pros predict the 2015 NA LCS Summer Split Playoffs","subforum":"Esports","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"coltfan08","date":"2015-08-06T20:31:54.296+0000","up_votes":21,"down_votes":1,"body":"\"Predictions\" - everyone either picked their own team or said that their team had a good chance. Shoulda polled the teams that didn't make playoffs to get real predictions.","replies":[{"poster":"Bloodtotemz","date":"2015-08-07T01:58:36.756+0000","up_votes":4,"down_votes":0,"body":"Dont really know why no one from Cloud 9 was interviewed for this. They are the only team that would be scrimming all of the teams and would have an idea of the actual strength of everyone","replies":[{"poster":"UnknownNelson","date":"2015-08-07T20:54:00.731+0000","up_votes":1,"down_votes":0,"body":"They aren't very good at the moment, and this is just a publicity stunt.  Chill.  It must have been a slow news day.","replies":[]}]}]},{"poster":"2Girls1Trump","date":"2015-08-06T20:46:21.271+0000","up_votes":5,"down_votes":1,"body":"\"Dyrus is the only remaining original member of TSM.\" - Pretty Sure TheRainMan was the original top laner for TSM, not Dyrus.","replies":[{"poster":"Pegboard Nerds","date":"2015-08-06T21:33:06.453+0000","up_votes":3,"down_votes":0,"body":"Saintvicious was the original top laner of TSM I like Dyrus but he doesn't deserve that title","replies":[]},{"poster":"sKz Aaron D","date":"2015-08-07T02:44:06.841+0000","up_votes":2,"down_votes":0,"body":"Though you're right than Dyrus isn't an original member of TSM, they might not be talking about teams from a pre-LCS time. Since a lot of the time they do specifically say 'in the LCS' I'd say that whoever wrote this article only saw the roster changes from then on.","replies":[]}]},{"poster":"TrollFan01","date":"2015-08-06T20:24:01.785+0000","up_votes":6,"down_votes":10,"body":"Dyrus is right. TSM will take 1st place.\r\n\r\nTSM! TSM! TSM!","replies":[{"poster":"Bot Garbage","date":"2015-08-06T22:01:20.493+0000","up_votes":6,"down_votes":5,"body":"Dyrus is talking the whole time the same kind of shit TSM is going to win against all. Let´s take a look back to MSI. ohhhh they really sucked and Dyrus got firstblooded almost every time.\r\n\r\nSeriously i do not want to see TSM win Playoff this time. They do not deserve it. TL/CLG or maybe TIP i do hope one of these Teams are gonna win","replies":[{"poster":"TrollFan01","date":"2015-08-07T00:11:10.089+0000","up_votes":1,"down_votes":1,"body":"Oh MSI was brought up again big surprise! Let's bring up the Spring Split Playoffs where TSM crapped all over everyone and won the title without any trouble. \r\n\r\nPlayoffs is TSM's thing. They excel in Best of 5 series. One off matches mean nothing and every analysis agrees. Best of 5s is where it's at and TSM always do well in those.\r\n\r\nTSM/CLG or TSM/TIP will be the grand finals and TSM will win. ","replies":[{"poster":"Dinermoe","date":"2015-08-07T09:00:05.975+0000","up_votes":1,"down_votes":0,"body":"You know that TSM is \"not good\" with surprise picks and stuff? They face Gravity and TL if things go well. TL is practising for like 3 weeks now only for playoffs and I am sure they have some incredibly new stuff in their pockets, Also Gravity has Keane who is a fckin good Malphite midlaner. He could even win with AP Warwick midlane, you know what I mean? I am not as confident as you are in TSM. Sure they have \"potential\" but even NME had potential of not getting into relegation zone.\r\nI am also not a fan of this MSI shit. TSM looked horrbily weak, thats a fact, but there's no point bringing it up again, so I am with you at this point.\r\nWe reached (finally) a point where neither TSM or C9 are the top favorites in this. TSM finished 5th and C9 got not relegated. This year a new team will lift this trophy.","replies":[{"poster":"Count Buffon","date":"2015-08-07T11:50:46.169+0000","up_votes":3,"down_votes":0,"body":"MSI will stop coming up when TSM stops playing like the team that got stomped at MSI.","replies":[]}]},{"poster":"o BioHaz","date":"2015-08-08T16:35:56.051+0000","up_votes":1,"down_votes":2,"body":"for one they don't excel in best of 5's, woohoo they can wins bo5 in NA, grats ","replies":[{"poster":"TrollFan01","date":"2015-08-08T19:26:30.008+0000","up_votes":1,"down_votes":0,"body":"Yes they do. Just look at their track record. They've won more than lost int hose and most recently they haven't lost one since Worlds last year.\r\n\r\nTSM beat DIG, LMQ, and C9 at NA Regionals last year. They beat WE in a commanding 3-0 at IEM this year. They also 3-1 both TIP and C9 without much effort in the Spring Playoffs. I don't know what you're talking about since TSM really DOES excel in best of 5s.","replies":[]}]}]},{"poster":"NeoDeimos","date":"2015-08-10T22:38:53.153+0000","up_votes":1,"down_votes":0,"body":"If Liquid, CLG, or TIP can't beat TSM in playoffs; then they don't deserve to go to Worlds ahead of TSM.","replies":[]}]},{"poster":"ShadowFiend812","date":"2015-08-07T03:16:52.793+0000","up_votes":2,"down_votes":0,"body":"Gotta believe man fans gotta support there team at all times :D","replies":[{"poster":"TrollFan01","date":"2015-08-07T03:44:18.955+0000","up_votes":1,"down_votes":0,"body":"Glad someone gets it. Thanks.","replies":[{"poster":"Dinermoe","date":"2015-08-07T08:54:18.655+0000","up_votes":1,"down_votes":1,"body":"I really wanted to see a TSM vs TL final...unfortunately TSM will lose in the semis. :(","replies":[{"poster":"NeoDeimos","date":"2015-08-10T22:34:04.110+0000","up_votes":1,"down_votes":0,"body":"Um... what? TSM CAN'T face Liquid in the finals, they're on the same side of the bracket...","replies":[]}]}]}]}]},{"poster":"Vyvox","date":"2015-08-06T23:07:19.291+0000","up_votes":3,"down_votes":0,"body":"In my opinion:\r\nDig and Gravity have nothing left and won't win any series.\r\nTSM has looked weak and is unlikely to improve quickly enough to win the playoffs.\r\nTIP, CLG, and TL are the only teams playing at a quality level, but TIP is crippled without a strong mid laner and is unlikely to defeat clg and team liquid. \r\nCLG is looking fantastic, yet they always seem to choke when it matters... \r\nI believe TL will win the playoffs with CLG 2nd and TIP 3rd","replies":[]},{"poster":"lLerc","date":"2015-08-07T02:29:42.948+0000","up_votes":5,"down_votes":4,"body":"It's funny how when TSM does bad, everyone else comments  about their favorite team being Gravity or Liquid... Smells like a trolley of bandwaggoners. Not saying there's never been genuine fan-bases of other teams, it just seems almost convenient to begin your cheer when things go well, for \"your\" team. Just food for thought, probably going to get flamed, but it's okey, everyone has an opinion. \r\n\r\nOnto Predictions:\r\nTSM\r\nTL\r\nTIP\r\n\"THE TRIPLE T\"\r\n\r\nSide note- Yes I'm choosing TSM because they're my favorite, and to do otherwise would bring shame to what it meeans to be a fan. Win or Lose #BayLyfe4Lyfe\r\n\r\nNight Summoners.","replies":[{"poster":"TrollFan01","date":"2015-08-07T03:47:10.406+0000","up_votes":2,"down_votes":0,"body":"You get it man. Being a fan means staying even during the \"bad times\" so you don't come off like a bang wagon jumper.","replies":[{"poster":"Stupendoes","date":"2015-08-07T05:31:00.623+0000","up_votes":5,"down_votes":2,"body":"C9 World Domination Incoming.","replies":[]},{"poster":"o BioHaz","date":"2015-08-08T16:32:53.348+0000","up_votes":1,"down_votes":0,"body":"LOL, \"bad times\" ","replies":[]}]},{"poster":"SinatraZ","date":"2015-08-07T15:19:39.441+0000","up_votes":2,"down_votes":1,"body":"Well, I never been a fan of TSM even when they did good. You have to stop thinking everyone like TSM lol","replies":[]},{"poster":"NeoDeimos","date":"2015-08-10T22:31:59.098+0000","up_votes":1,"down_votes":0,"body":"If you're ranking teams in terms of \"who will be the best at the end of playoffs\", or \"who will qualify for worlds\", then this could be correct.\r\n\r\nHowever, if this is a ranking of how the teams \"will actually finish in playoffs\", then this is impossible (if TSM finishes first, then Liquid can't be second)","replies":[]},{"poster":"Minrog","date":"2015-08-07T19:50:18.902+0000","up_votes":1,"down_votes":0,"body":"When I vote on who I think is the team most likely to win the split it hasn't got anything to do with who my favorite team is.  I <3 UoL but I can't honestly think they will win out against Fnatic atm, gotta be realistic about a team's chances.\r\n\r\nTSM has played terrible since MSI.  They didn't even make it to best of 5's there.  They created dumb drama with their ADC, ignored the fails of their jungler/mid lane duo, and Reginald jumped in and undercut the existing coach.  How can you ignore these warning signs, even if they make it to Worlds how do they have any hope of beating FNC/EDG/SKT when their team is like this?\r\n\r\nI think Team Liquid and TIP have the best hope for international play, because they can match up better and not get way behind during laning phase.  Dyrus seems to be the only one who is putting up good lane performances anymore.","replies":[]}]},{"poster":"Haveek","date":"2015-08-07T01:40:57.266+0000","up_votes":5,"down_votes":2,"body":"For my prediction i would put Team liquid and Team Impulse at the top 2 seeds.Then for 3rd and 4th i'd say CLG and Gravity. im hoping any of these 4 teams make it to worlds (mainly CLG TL and GV because they will all be newcomers to the world championship scene and have alot more to prove/show which leads me to believe that this worlds would be more enjoyable to watch.) BUT i would love to see the team impulse squad bring their recklessness to the world championship and make things more interesting! We will all soon find out in these crazy playoff games!","replies":[{"poster":"Hyper10sion","date":"2015-08-07T15:37:54.506+0000","up_votes":2,"down_votes":0,"body":"Actually TSM has a strong shot at getting the 2 spot. If they reach 4th or higher, they practically punch their worlds ticket based on points alone.","replies":[{"poster":"Haveek","date":"2015-08-09T03:36:15.480+0000","up_votes":1,"down_votes":0,"body":"if they are to get 4th they would have to face off in the gauntlet so their worlds spot isnt {{champion:86}} eed (heh)","replies":[]}]},{"poster":"Dinermoe","date":"2015-08-07T09:04:06.979+0000","up_votes":2,"down_votes":1,"body":"I dont know why you get downvoted for this but thats not the point...\r\nI am totally wiht you dude, who wants to see every year the same TSM or C9 who rarely advance to the quarters.\r\nTL would be great, Piglet will get off facing off against other Koreans, TIP is TIP and Gravity would be also fun to watch.","replies":[]}]},{"poster":"Crexis","date":"2015-08-06T21:53:27.337+0000","up_votes":4,"down_votes":5,"body":"Come on people C9 is going to take it all.\r\n\r\nOh wait that's right they laid a big fat ugly egg this spilt and won't be in the finals with TSM for the first time in forever. I do however think in a Bo5 that TSM will be able to adapt and take the title. They have struggled lately but that's been in Bo1 matches and... \"any given Sunday\" any team can beat any team but in B05 we shall see.","replies":[{"poster":"GIFT OF LOVE","date":"2015-08-06T22:15:52.108+0000","up_votes":2,"down_votes":3,"body":"Agreed. This is genuinely plausible. Any team can make playoffs. Will TSM win maybe? Will Cloud 9 maybe? Will Team Liquid maybe? CLG maybe? Well What I'm thinking is not gravity or  Dignitas. I think itt's either TSM, Team Liquid, CLG, cloud 9.","replies":[{"poster":"Benjj","date":"2015-08-06T22:46:39.964+0000","up_votes":3,"down_votes":0,"body":"Cloud 9 didn't make playoffs...They have a spot to make a run at the gauntlet guaranteed, but it's impossible for them to win playoffs (seeing as they took 7th in the regular season).","replies":[{"poster":"GIFT OF LOVE","date":"2015-08-07T01:23:34.817+0000","up_votes":2,"down_votes":0,"body":"Yeah that is what I mean. I mean I meant spot for Season 5 worlds. I hope NA is not a disappointment in worlds this year...","replies":[{"poster":"sKz Aaron D","date":"2015-08-07T02:49:30.876+0000","up_votes":2,"down_votes":0,"body":"You say that as if NA was a disappointment at worlds last year. They definitely weren't... Getting knocked out in quarterfinals by the 2 best Korean teams in the tournament when EU and LMS didn't even make it out of groups (go Kabum!) is certainly not disappointing. One of only two teams to take a game from SSW in the entire event is from NA.","replies":[]},{"poster":"Bloodtotemz","date":"2015-08-07T01:57:24.144+0000","up_votes":2,"down_votes":0,"body":"The likelyhood of NA being bad at worlds if VERY high","replies":[]},{"poster":"o BioHaz","date":"2015-08-08T16:34:16.468+0000","up_votes":1,"down_votes":0,"body":"if c9 goes to worlds then yes NA will be a disappointment, TiP/TL/TSM needs to go, only teams worth having at worlds from NA","replies":[]}]}]}]}]},{"poster":"Count Buffon","date":"2015-08-07T11:29:33.762+0000","up_votes":2,"down_votes":0,"body":"Gravity has had a really rough few games, and Bunny looked a bit off.  I don't know what the deal is, and I hesitate to decide whether they'll be contenders or not.  I wouldn't count them out against the current TSM especially.","replies":[{"poster":"Plüme","date":"2015-08-07T15:05:59.065+0000","up_votes":2,"down_votes":0,"body":"yeah i think they can make it into 3rd, hopefully","replies":[{"poster":"Count Buffon","date":"2015-08-07T15:27:23.762+0000","up_votes":2,"down_votes":0,"body":"The only thing I would bet on lately is Dignitas losing.  I keep thinking TSM might get it together, but I wouldn't bet on that either.  For a lack of any clear signs, I have to call Dignitas vs anyone as 30-70 and any other possible playoffs matchup as a 50-50 or maybe 55 for Liquid.  CLG was looking strong too, but they're overdue for a choke and I never try to predict them anymore anyway.","replies":[{"poster":"Lord Yunii","date":"2015-08-09T00:12:25.435+0000","up_votes":1,"down_votes":0,"body":"I completely agree.  I'd love to just throw all my hopes at CLG for the win but I just can't do that anymore.  Hopefully, TL or TIP can stay ahead of TSM and win.  Pretty sick of TSM winning and just sucking hard internationally.","replies":[]}]}]}]},{"poster":"LoL Kj","date":"2015-08-07T03:27:14.971+0000","up_votes":1,"down_votes":0,"body":"I believe TSM will get at least top 3. Not number 1.","replies":[{"poster":"Plüme","date":"2015-08-07T15:04:03.214+0000","up_votes":2,"down_votes":0,"body":"meh, at least your not one of those completely delusional tsm fans that think they're gonna win worlds or some shit","replies":[]}]},{"poster":"Count Buffon","date":"2015-08-07T11:27:00.566+0000","up_votes":2,"down_votes":0,"body":"Hilarious choice of headline image, uguyz.  Would've been fitting going into last split, but this time around it's way too troll.","replies":[]},{"poster":"Red Pearl Strike","date":"2015-08-06T19:48:58.377+0000","up_votes":2,"down_votes":2,"body":"why did XiaoWeiXiao get suspended?","replies":[{"poster":"RavenHusky","date":"2015-08-06T19:53:57.770+0000","up_votes":2,"down_votes":0,"body":"XWX got suspended pending investigation of elo boosting.","replies":[{"poster":"GIFT OF LOVE","date":"2015-08-06T22:21:13.459+0000","up_votes":1,"down_votes":0,"body":"This is exactly why they're not going to worlds. Without Xiaoweixiao I'm confident they're not going to worlds.","replies":[{"poster":"o BioHaz","date":"2015-08-08T16:36:58.854+0000","up_votes":1,"down_votes":0,"body":"GATE in hes games so far has done better xD, and they all speak Korean now, soooo well minus the 1 white dude","replies":[]}]}]}]},{"poster":"NA Danny","date":"2015-08-06T21:33:01.209+0000","up_votes":3,"down_votes":1,"body":"This is CLG's year. I know it. #FaithAge","replies":[{"poster":"GIFT OF LOVE","date":"2015-08-06T22:16:41.485+0000","up_votes":3,"down_votes":1,"body":"Yeah...","replies":[]}]}]}