{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-08-31T18:06:08.158+0000","title":"State of Champion Update","subforum":"Announcements","up_votes":28,"down_votes":5,"body":"[ÜRES]","replies":[{"poster":"Hamßone","date":"2016-08-31T18:39:01.060+0000","up_votes":813,"down_votes":14,"body":"I think it would be cool if {{champion:3}} interacted with towers in some sense. Have him interact with structures, buff/debuff, rebuild, gold from tower kills, control a tower, fly to towers, temporary change to have towers heal allies, or even had an ability where the tower shoots him and empowers the laser eye beams and he has a countdown timer before if hurts him. While a rock champ is not new the main ones tend to have more elemental {{champion:163}} {{champion:54}} interaction with rocks. {{champion:3}} just feels like he should be the one guy that is a guardian and you don't want to meet him on his turf. And from his lore he is made to protect others and hes all sad that he failed so hes got great abilities and wait...does he flap his wings and make you go faster? A stone creature can make a tornado thing?\r\nWhy not try towers. He is artificial life brought to stone. The towers are not so different in the lore are they?\r\n\r\nWell this was fun. Thanks for reading and I look forward to his rework.","replies":[{"poster":"RostislavO","date":"2016-08-31T18:41:19.467+0000","up_votes":109,"down_votes":4,"body":"Up vote this, it sounds really cool. It will definitely give him a unique and defining gameplay like no other champion in league.","replies":[]},{"poster":"LordXemnas23","date":"2016-08-31T19:20:30.804+0000","up_votes":59,"down_votes":8,"body":"  Abilities that interact with towers would be pretty cool.  I would like to see how his abilities would react differently with ally/enemy towers.  Perhaps a three second stare at enemy tower and that tower will fall under his \"spell\" and attack it's own team for five seconds.  I could see that ability working similarly to attacking enemy turrets, turrets will attack minions unless champion attacks enemy champion.  This would make for really cool turret dives early and late game.  \r\n\r\n  A neat passive for him would be gaining buffs while under turrets, destroyed turrets will only give half the buff.  Perhaps ultimate can react with standing turrets by giving them a zhonyas effect and rapid fire projectiles (inhibitor and nexus turrets empowered laser).  Fallen turrets could spawn a ghost turret for ten seconds.  Those are my idea's for Galio, I think a champ whose abilities solely interact with turrets would be great. ","replies":[]},{"poster":"fappinfalcon","date":"2016-09-01T00:05:14.860+0000","up_votes":48,"down_votes":1,"body":"i just read this post and I love it and it sparked and idea.{{champion:3}} is really upset because he failed to protect right? what if his passive had something to do with how many towers your team has lost? it could give buffs or damage or something along those lines.","replies":[]},{"poster":"taskwizard","date":"2016-09-01T00:23:48.334+0000","up_votes":36,"down_votes":3,"body":"His passive update: As a gargoyle, he can slowly climb up walls/towers then glide off of them with a burst of movement speed.  ","replies":[{"poster":"Furnace Of Souls","date":"2016-09-01T12:56:11.911+0000","up_votes":19,"down_votes":0,"body":"thats a good idea...and when he is perched up there he gets a large range of vision and gets a zoomed out screen similar to jhin ult or xer ult or something","replies":[]}]},{"poster":"6Sfool","date":"2016-08-31T19:19:49.795+0000","up_votes":23,"down_votes":5,"body":"I like the idea.  Over the years, champs have been given interactions with everything on the map except towers.  So far, several have interactions with minions/monsters (voli fear, nunu, morde's dragon) and some have been given interactions with terrain (gnar ult, jarvan ult, taliyah's everything).  But only ziggs and trist have any interaction at all with towers, and it is superficial.  I can't think of any champ that needs a new identity more than galio, and making him interact with towers seems like the perfect route.\r\nWhat else do gargoyles do anyway?","replies":[{"poster":"Valor Bot","date":"2016-08-31T22:26:48.490+0000","up_votes":15,"down_votes":0,"body":"Janna can shield towers, so it's not just Ziggs and Trist. But I agree, it would be cool if Galio could interact with them too. Maybe a passive that allows him to perch on towers to empower or shield them for a time?","replies":[]}]}]},{"poster":"Schàdenfreude","date":"2016-08-31T18:16:18.549+0000","up_votes":8,"down_votes":158,"body":"Rofl these guys think they did good with the Ryze rework when they don't realize he's still at 40% winrate or so","replies":[{"poster":"Reav3","date":"2016-08-31T18:38:59.595+0000","up_votes":139,"down_votes":4,"body":"While this is true, his experienced winrate is higher than that and seems to be going up every week. I think Ryze will require people learning how to play with a Ryze on your team which could make his winrate go up overtime. \r\n\r\nWe are waiting for his experienced winrate to stop going up and see where it settles before putting in anymore buffs then the small one we gave him last patch. My point was that we feel we have better levers to balance him in the future if needed.","replies":[{"poster":"hopeful4","date":"2016-08-31T19:08:13.513+0000","up_votes":47,"down_votes":2,"body":"You did good work with Ryze. Give champions unique utility like Ryze ulti if you want them to always have a place in a meta unless they are extremely undertuned compared to S tier champions. \n\n I 100% agree that you went too safe with the Mage update. Ziggs, Brand, Velkoz or Xerath will continue to not have a place in the meta unless they are the best in the class. Their supposed strengths and weaknesses are not tuned nearly as high as they should in order to justify picking them over someone like current Vlad for example.","replies":[{"poster":"DeadUnborn","date":"2016-08-31T21:46:55.135+0000","up_votes":12,"down_votes":0,"body":"As a ziggs and vel coz main I think they are in a fine spot. The problem is they both are extremly meta reliant and the curreent skirmishing meta doesn't favor them a whole lot. They shine on sieges after all","replies":[]}]}]}]},{"poster":"OU Nightshade","date":"2016-08-31T18:41:56.406+0000","up_votes":32,"down_votes":2,"body":"I noticed there's no mention of Urgot anywhere in this list. I recall Urgot being listed as fairly high priority for rework/update quite a few times over the past year or two, and thought I remembered seeing him on the upcoming list not long after Poppy. I'm curious as to what this means for him, and whether he's being pushed back due to other champs being seen as higher priority, if there's difficulty coming up with a new kit and design, or if they've just thrown in the towel and decided to keep him as is.","replies":[{"poster":"A Doll Fitler","date":"2016-08-31T23:44:07.495+0000","up_votes":66,"down_votes":1,"body":"Apparently, they must have F{{champion:6}} about him...","replies":[]},{"poster":"Reav3","date":"2016-08-31T18:45:06.186+0000","up_votes":62,"down_votes":2,"body":"We haven't thrown in the towel! He's still high on our list!","replies":[{"poster":"ThatHaleState","date":"2016-08-31T19:11:34.467+0000","up_votes":13,"down_votes":0,"body":"Theyve also stated previously that some updates will surpass others if they have a higher amount of interest or if they have more clear ideas already for that champion. So possibly the update teams are either very disinterested in working on Urgot, or are having trouble \"remaking\" him with any kind of good changes. They might just not know what to do at the moment. ","replies":[{"poster":"Reav3","date":"2016-08-31T19:29:41.807+0000","up_votes":34,"down_votes":2,"body":"We also didn't want to do 2 back to back Zaun champions(While Urgot is technically Noxian, he has strong ties with Zaun). Also with Yorick just coming out and Warwick up next we didn't want to do another \"dark\" champion.","replies":[{"poster":"Anth895","date":"2016-08-31T19:45:53.047+0000","up_votes":2,"down_votes":1,"body":"I seem to recall Galio's past being pretty dark. Is his lore going to change as well?","replies":[{"poster":"Jeddy017","date":"2016-08-31T22:21:53.689+0000","up_votes":14,"down_votes":0,"body":"I think he was referring to Galio's character rather than his past. A character can have a dark past without being dark themselves.","replies":[]}]},{"poster":"World Ender","date":"2016-08-31T19:54:28.542+0000","up_votes":11,"down_votes":2,"body":"So Warwick is still from Zaun then? Neato.","replies":[]}]}]},{"poster":"Gondall","date":"2016-08-31T19:34:55.804+0000","up_votes":13,"down_votes":0,"body":"Where on the list is {{champion:266}}? Any chance he gets some love sometime soon? He's been in a bad (read: unfun) place for a while now, even though he has really, really cool lore.","replies":[{"poster":"DwarvenGiant","date":"2016-08-31T19:38:55.577+0000","up_votes":10,"down_votes":0,"body":"He's a strong candidate for major gameplay work when they get to the Divers Roster.","replies":[]}]}]}]},{"poster":"cookingmama","date":"2016-08-31T19:00:19.782+0000","up_votes":32,"down_votes":1,"body":"While it's great you're working on champs that need a rework (Yorick), but what about Nunu? I think he's due for a rework considering all of the changes happening. His mechanics is completely outdated and an ult that you could pull off once in a blue moon. ","replies":[{"poster":"HeadHydra","date":"2016-08-31T19:14:39.046+0000","up_votes":45,"down_votes":1,"body":"I may be biased but playing against {{champion:20}} is the most cancerous thing I've ever done.","replies":[{"poster":"Supreme Senpai69","date":"2016-08-31T21:07:57.948+0000","up_votes":15,"down_votes":0,"body":"To be fair that just encourages a rework that much more","replies":[]},{"poster":"Necro Warrior87","date":"2016-08-31T19:49:00.659+0000","up_votes":6,"down_votes":0,"body":"hell even stonewall008 admited hes cancer","replies":[{"poster":"Sahn Uzal","date":"2016-08-31T20:28:23.366+0000","up_votes":6,"down_votes":0,"body":"Hell even Stonewall says hell quite often :^)","replies":[]}]}]},{"poster":"DanCast","date":"2016-08-31T19:39:51.342+0000","up_votes":34,"down_votes":0,"body":"Yes! {{champion:20}} 's thematics also make no sense. He doesn't feel like a \"pair\" or mounted character. He doesn't play like a support, but that's his listed class. How does a Yeti make your blood boil and buff you?\r\n\r\nI think he needs attention more than Galio who has been finding his niche recently. Hope Nunu is soon after.","replies":[{"poster":"Fondling Gems","date":"2016-09-01T00:25:05.446+0000","up_votes":23,"down_votes":0,"body":"Honestly I forget that I am not playing a Yeti named Nunu.  ","replies":[{"poster":"DrCyanide","date":"2016-09-01T15:03:43.119+0000","up_votes":25,"down_votes":0,"body":"Nunu update:\r\n\r\n* Renamed the Yeti to Nunu\r\n* Removed the taking growth from the yeti's back","replies":[]}]}]}]},{"poster":"Mishli","date":"2016-08-31T20:37:06.080+0000","up_votes":5,"down_votes":1,"body":"overall did enjoy the mage update and really looking forward to the potential of the assassin update, couple questions though:\r\n\r\n1. I don't see Ekko or Zed listed anywhere, i know ekko \"still needs tuning\" and heard the both of them were slated for some tweaks during the update. is that no longer a thing? or are they just not listed as they aren't a 'primary' focus for the update?\r\n\r\n2. don't get me wrong, i Yoric's new ultimate is cool, i'm just genuinely surprised. when i heard an update was coming, the only 2 things i expected to stick around was 'he uses ghouls' and his ultimate. I always thought it was interesting and unique, kind of like a reverse morde ult (you ult your adc to get more damage and potentially 'save' them (cough give them a chance for revenge cough)) and am really surprised. what made you get rid of it?\r\n\r\n\r\nalso, just to throw my 2 cents in as a long time ekko player. I would love to see him still stay as an assassin style champ, but i feel the way he currently is almost requires a tank build of some sort (roa/rylais, etc) just to let him survive long enough to do anything, unless you literally have precognition, or can constantly rewind time (i know ekko can, but us mere mortals can't) it's impossible to get off most of his kit without just getting lucky as 9 times out of 10 you can't survive long enough to actually pull off any cool plays.","replies":[{"poster":"Reav3","date":"2016-08-31T20:47:46.101+0000","up_votes":28,"down_votes":1,"body":"We just listed the big 4, not any of the smaller reworks. Zed and Ekko will most likely be getting small updates with the Assassin update. We are currently experimenting with both of them but not sure if the changes will stick. One of the primary goals with Ekko is to make his more of a Assassin/skirmisher and less of a Tank.","replies":[]}]},{"poster":"LuxannaVeritas","date":"2016-08-31T19:23:08.558+0000","up_votes":10,"down_votes":4,"body":"Galio update?\r\n\r\nI-I'm so happy that you're updating one of my favorite mid laners...! Currently, I think that his W is outdated and awkward to use; I'd rather be focused on my damage than my shield when my jungler comes to rank my lane.\r\n\r\nWhile his Q is very slow, I think that the amount of damage it can cause correctly rewards nice predictions of enemy movement. His E also has very nice speed control, and is very versatile. In short, he kind of reminds me of Orianna; in fact currently they're really alike. Galio just seems to be a weaker of her.\r\n\r\nHis ultimate is great for team play, and I find it difficult to use Galio to his potential in normals because people rarely follow up on my CC from my ultimate. Also, Galio is supposed to be a tank, but I find myself usually getting obliterated by Le Blanc or Fizz, even if I build straight magic resist. I hope you can make him more tank AND mage-like, and more fitting in the current state of the game! {{sticker:slayer-jinx-wink}} ","replies":[{"poster":"Veltox","date":"2016-08-31T19:39:30.740+0000","up_votes":29,"down_votes":2,"body":"I'm damn curious how u can get blown up with {{champion:3}} vs {{champion:7}} besides early game.{{sticker:zombie-brand-mindblown}} ","replies":[{"poster":"tjfreckles","date":"2016-08-31T20:23:03.439+0000","up_votes":9,"down_votes":0,"body":"If he's not valuing bulwark, that's not going to help lol.  Bulwark is the only reason other than his ult that galio is a solid champion. I loathe that they said this rework will be one of the biggest.","replies":[]}]}]},{"poster":"HeadHydra","date":"2016-08-31T19:04:23.810+0000","up_votes":16,"down_votes":1,"body":"Where does {{champion:28}}  stand on your rework priority list?","replies":[{"poster":"Needsnaming","date":"2016-08-31T23:00:09.913+0000","up_votes":12,"down_votes":0,"body":"They are redoing the whole stealth system with the assassin rework. That by itself may be all she needs. But we won't know until we know how stealth will be handled in the future. ","replies":[{"poster":"ShadowParker","date":"2016-09-01T02:36:44.036+0000","up_votes":8,"down_votes":0,"body":"Regardless of whether it fixes her. She still needs a new model and lore. I think that in itself is enough for a rework. Not too mention her confused kit.","replies":[]}]}]},{"poster":"Wordofmask","date":"2016-08-31T18:17:13.372+0000","up_votes":7,"down_votes":9,"body":"what about Swain? will he planned for rework next year?","replies":[{"poster":"A Fast Dog","date":"2016-08-31T18:30:12.866+0000","up_votes":9,"down_votes":3,"body":"didn't they kinda rework him? alittle along with  pladamire","replies":[{"poster":"GaleWinUnleashed","date":"2016-08-31T18:45:27.282+0000","up_votes":15,"down_votes":1,"body":"Swain's small update was a hold-over until they can give him a proper rework. He'll probably be done within the next year or two.","replies":[{"poster":"Brutusness","date":"2016-08-31T18:49:09.895+0000","up_votes":4,"down_votes":1,"body":"I would really hope Swain's will be next year. He's go on with no skins for far too long, he'll likely beat Yorick's record by the time he gets an update...","replies":[{"poster":"GaleWinUnleashed","date":"2016-08-31T18:52:39.905+0000","up_votes":13,"down_votes":1,"body":"Still waiting for Dragon Master Swain  =P\n\nOr BruSwain, but copyright probably kills that one.","replies":[]}]}]}]}]},{"poster":"redfeenix","date":"2016-08-31T19:59:25.920+0000","up_votes":18,"down_votes":4,"body":"Great blogpost, thank you. I think as a whole, the entire company would benefit more by releasing more dev blogs from more teams. This is great communication, thanks.\n\nI love that you guys have such detailed plans for the future, and thats awesome.\n\nBut I think you guys need to take a minute and look at your past projects. A lot of them were supbar as you've admitted. When will you take a look at those champions? Karma, Morde, Shen etc.... when will these guys get some proper love? They were honestly better before your team touched them.... and these guys are the reason people are hesitant to trust you with their mains. \n\nI know you guys are booked solid, and thats cool I understand. But you should really find some time to fix the champions you've frankly made worse.... the players deserve updates which improve the game and their favourite champions... and you should honestly feel obligated to fix your mistakes. \n\nI know there are higher priority champions on your list (urgot galio eve etc), but what scares me is that you wont look at champions you've already dealt with for years, even though they \"missed the mark\".  I dont wanna play a half baked Shen or Morde for another 5 years.... I honestly want to play a thematically cohesive and fun champion. Dont you think the players deserve that? Or is that too much to ask for? \n\nAnother thing we discussed earlier was dealing with champions with healthy gameplay kits, but severely outdated graphics/textures (talking MS Paint lvl stuff here). For example Orianna is desperate for a fresh new look. How many more years do you think it will take for these champions to get a makeover? Is she gonna go for another 5 years without any love ? There are other old champions that need to be overhauled visually. You need to find some time for them eh? \n\nFinally, why did you decide to release two easy to play / simple champions back to back? (IE, yorick and ww). I know a lot of people will love these characters, but honestly I've played League so much that simple/ boring / monotonous playstyles dont appeal to me AT ALL. I know many players will love the new Yorick, but frankly he was way too boring for me to play. Now you're saying that the next project (ie warwick) will be similar in difficulty? \n\nNote that so far, in my opinion, you're net improvements are negative. IE, your team has done more harm than good so far. \n\nWhen I started playing League I gravitated towards the simplest champions: Shen, Warwick and GP. In my honest opinion, Shen and GP missed their marks and are not really fun to play anymore for me. I cant even stand to look at Shen (you know my reasons), and I dislike GP's barrel mechanics a lot. Please, please do not fuck up warwick. That would make you personally responsible for wrecking 3 of my favourite champions. \n\nI will hold judgement till I see what you guys do with the assassins, but frankly you need to step yo game up.\n\nCheers, and have a great day! \n\nPS: Some of your projects were really good. Taric, Sion, and Poppy are good examples of successful updates that added to the champion's thematic and strategic niches... These were net positives that didnt take anything AWAY from these champs but instead ADDED VALUE to them. The other ones .... not so much. \n\nDont take this the wrong way, I still eagerly await the next update. (Minus Yorick, he literally put me to sleep when I played him on PBE).\n\n>TLDR: Fix your mistakes before working on new champions. Find time to visually update old champs with healthy gameplay (Cho, Orianna etc)","replies":[{"poster":"ZT Xperimentor","date":"2016-08-31T21:22:50.185+0000","up_votes":7,"down_votes":3,"body":"\"They were honestly better before your team touched them.... and these guys are the reason people are hesitant to trust you with their mains.\"\n\"Note that so far, in my opinion, you're net improvements are negative. IE, your team has done more harm than good so far.\"\n\nI concur; tired of champions being ruined & ditched on purpose repeatedly.","replies":[{"poster":"redfeenix","date":"2016-08-31T21:34:44.797+0000","up_votes":7,"down_votes":0,"body":"Some were good, but some werent. I'm very scared to see how warwick will turn out","replies":[{"poster":"ZT Xperimentor","date":"2016-08-31T21:48:58.410+0000","up_votes":4,"down_votes":1,"body":"Agreed; sion, velkoz, & poppy turned out well; but a dozen others clearly suffered.","replies":[{"poster":"redfeenix","date":"2016-08-31T21:53:00.259+0000","up_votes":4,"down_votes":0,"body":"Can you remind me how they changed velkoz? \n\nI know a lot of people were complaining about him, but I tried him this week since he is f2p.\n\nAll his skills look essentially the same for me (qwer all feel the same). Keep in mind I've played velkoz like 3 times lol =)","replies":[{"poster":"ZT Xperimentor","date":"2016-08-31T21:57:40.927+0000","up_votes":6,"down_votes":0,"body":"He wasn't a major case. His passive originally just did an extra flat chunk of true damage, if he combo-ed his abilities; they lowered the damage on his ultimate, but made it deal true damage if he combo-ed the enemy champion, ontop of the passive bonus. \n\nOne of the few times riot listened & implemented community suggestions, and they went well; which is why I said he was a good rework, even though not much was changed.\n\nNo worries, I've played him plenty, just not recently XD","replies":[]}]}]}]}]}]},{"poster":"ChibiKamisama","date":"2016-08-31T22:32:08.583+0000","up_votes":3,"down_votes":0,"body":"\"Warwick’s kit is kind of boring and outdated. While we don’t want to raise Warwick’s skill floor, we do want to increase his skill ceiling a bit and add more depth to his gameplay.\"\r\n\r\nSo... does this mean that with the new update, {{champion:19}} will have many ways to outplay the enemy and have some other things to do outside of his ultimate/when his ult is on CD?","replies":[]}]}