{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2015-10-06T00:44:30.927+0000","title":"Data and Champion Balance – Part 1","subforum":"Announcements","up_votes":11,"down_votes":21,"body":"[ÜRES]","replies":[{"poster":"Guzik","date":"2015-10-07T20:32:44.073+0000","up_votes":274,"down_votes":31,"body":"If the same six champions are banned every single game i think they are banned for a reason.....{{champion:122}} {{champion:114}} {{champion:86}} {{champion:72}} {{champion:82}} {{champion:41}} ","replies":[{"poster":"RossMellow","date":"2015-10-07T20:36:28.095+0000","up_votes":71,"down_votes":132,"body":"Because they're new, theres a lot of attention directed towards them. People are just banning them because they just don't want to learn to play around or against new. people hate change. (except the ones that benefit us)","replies":[{"poster":"freight train722","date":"2015-10-07T20:52:51.346+0000","up_votes":26,"down_votes":18,"body":"***","replies":[{"poster":"Shroom Junkie","date":"2015-10-07T21:19:42.140+0000","up_votes":40,"down_votes":10,"body":"He was lane dominant and a fighter. He got to deal good consistent damage while still being tanky enough to live through a fight even though melee.\r\n\r\nNow he one-shots people.\r\n\r\nI think the new one is a wee bit unbalanced...","replies":[]},{"poster":"GenghisEmo","date":"2015-10-07T21:55:34.932+0000","up_votes":19,"down_votes":9,"body":"Morde is Broken. Tittering on the edge of OP and useless. Or being able to snowball, or just scale weird. He builds nothing but AP, yet still super tanky and one shots a carry while healing to 75% hp all of a sudden before his rework? That is a bit broken. Now after the changes, he is still weird, but i would not say OP, but it can still be argued he is broken (though, no where near as like he use to be).\r\n\r\nIf anything now, he is still having a bit of an identity crisis, which is not as bad as it use to be. For now, i say he is better than before, even with his pet dragon. BUT, still need to keep an eye on him, seen some very weird plays lately which make me feel he still needs a tiny bit of work when someone gets rewarded for being caught out. That being said, i'd rather see {{champion:67}} get more attention than {{champion:82}} since now Morde seems WAY BETTER.","replies":[]}]}]}]},{"poster":"MasterVidallis","date":"2015-10-07T20:29:56.700+0000","up_votes":128,"down_votes":3,"body":"_This has been pointed out in boards many times, but I'm going to bring it up here and hope to get a dev response because this pisses off a lot of players._\r\n\r\n**If a given item is very strong and you nerf a champion because of their synergy with it and then some time later you proceed to ALSO nerf said item, you need to go back and pay some serious attention to the champions nerfed because of it, and generally revert those champion nerfs.**\r\n\r\nIn my experience most of the time you do this double nerfing you push champions over the edge to where they are not competitive with other top picks in their area. You did this to me twice this season as a jungle main with sejuani who I was playing a lot when you nerfed her because of cinderhulk, which was fine, but then you also nerfed cinderhulk and left her as she was. Then you did it with shyvana and devourer, where again the dmg nerf was fine due to her synergy with it, but then you now also nerfed devourer and now shyv kind of sucks. Stop it.","replies":[{"poster":"OrangePopsicle","date":"2015-10-07T20:56:03.831+0000","up_votes":15,"down_votes":1,"body":"Like how they removed DFG and Syndra mains cried about it because not only has she been nerfed but her stun is buggy as hell even despite the patches to \"fix\" it......    RIP DFG","replies":[{"poster":"Asa Of The Sand","date":"2015-10-08T00:55:16.448+0000","up_votes":6,"down_votes":1,"body":"TYDFG","replies":[]}]},{"poster":"Serevas","date":"2015-10-08T13:51:23.260+0000","up_votes":7,"down_votes":0,"body":"This needs a lot more upvotes, I miss playing Sejuani regularly, now she practically heals enemy champions.","replies":[]},{"poster":"DarkTea","date":"2015-10-08T10:18:28.160+0000","up_votes":5,"down_votes":0,"body":"I used to main Sejuani, and she was first nerfed, than Cynderhulk got nerfed, than Gromp buff got nerfed and Sejuani is now not viable anymore, or at least in my Elo. Please bring her AoE ulti slow back to 90%.","replies":[]}]},{"poster":"RottedApples","date":"2015-10-07T20:54:49.034+0000","up_votes":79,"down_votes":1,"body":"\"Ahri is more appealing than Urgot for most players.\"\r\n\r\n{{item:3070}} {{champion:6}} {{item:3070}} ","replies":[]},{"poster":"Évangélique","date":"2015-10-07T21:18:36.571+0000","up_votes":80,"down_votes":3,"body":"\"We are players too\"\r\nWell looks like there's a Darius main working for Riot. {{champion:35}} ","replies":[]},{"poster":"Shroom Junkie","date":"2015-10-07T21:20:26.425+0000","up_votes":89,"down_votes":12,"body":"{{champion:122}} +90% ban rate even in plat+.\r\n\r\nRiot: \"but that doesn't mean he's not balanced\"\r\n\r\nok","replies":[{"poster":"Aych Pii","date":"2015-10-07T21:51:23.415+0000","up_votes":29,"down_votes":9,"body":"It doesn't mean that. They actually explain it in the article. When a champion is likely to be played anytime it isn't banned, it becomes banworthy almost independent of whether or not it's actually strong. Darius is slightly on the strong side and _intensely_ popular, making him a priority ban.","replies":[{"poster":"Shroom Junkie","date":"2015-10-07T22:02:48.312+0000","up_votes":14,"down_votes":7,"body":"Well, I don't know about you but, I find immense damage combined with a Q that, just for hitting 3 people on the end heals for 1000 health by 3000 max health, is a wee bit on the OP side.\nEspecially considering he only has to build BC to deal that immense damage then can go full tank.","replies":[{"poster":"Aych Pii","date":"2015-10-08T06:40:55.191+0000","up_votes":14,"down_votes":2,"body":"I'm not hear to talk about whether Darius is op or not. My point was that his high banrate does not necessarily mean he's imbalanced. Not every ban is a declaration by the player that \"this champion is super OP and I refuse to play against it\". The best tactical bans are ones aimed at the champions that get played the most, which means flavor of the month, which means Darius. Riot are probably taking their time fine tuning his balance internally so they don't get a huge backlash of \"gg juggernauts useless again\".","replies":[]}]}]},{"poster":"ShatteredSkys","date":"2015-10-08T03:02:32.774+0000","up_votes":8,"down_votes":0,"body":"Release Yasou had the a ridiculous ban rate and at the same time had the lowest winrate in the game.","replies":[]}]},{"poster":"CleanBandito","date":"2015-10-07T20:15:30.592+0000","up_votes":50,"down_votes":15,"body":"Darius sure is blanced","replies":[{"poster":"Cronovey","date":"2015-10-07T21:59:38.182+0000","up_votes":70,"down_votes":4,"body":"Anyone else giggle a little that the guy rocking a FNC logo is crying about Darius who just penta'd his team at worlds to win the game? :3","replies":[{"poster":"Cosmic Binding","date":"2015-10-07T22:53:25.441+0000","up_votes":19,"down_votes":2,"body":"logged in just to upvote this{{summoner:6}} ","replies":[]}]},{"poster":"LordGeovanni","date":"2015-10-07T20:51:46.096+0000","up_votes":19,"down_votes":2,"body":"if you dont have balance then you cant dunk on everything its just that everything else is under powered","replies":[]}]},{"poster":"MrMisMatch","date":"2015-10-07T20:10:53.127+0000","up_votes":56,"down_votes":10,"body":"Please Rito hear us about graves cigar buff!!!","replies":[{"poster":"Grovero","date":"2015-10-07T23:32:01.417+0000","up_votes":15,"down_votes":1,"body":"{{champion:104}}\r\n :D","replies":[]}]},{"poster":"TheLordZnarfquad","date":"2015-10-07T20:51:55.711+0000","up_votes":48,"down_votes":5,"body":"Great! So, when are you deleting Patch 5.16?","replies":[]},{"poster":"Tetris Is Better","date":"2015-10-07T20:36:51.244+0000","up_votes":46,"down_votes":9,"body":"\"we won’t nerf champions just because they’re popular and we won’t buff champions just because they’re unpopular\" -Riot\r\n\r\nOh yeah...","replies":[{"poster":"LordGeovanni","date":"2015-10-07T21:15:23.258+0000","up_votes":11,"down_votes":4,"body":"you know how much patch notes have came out where they put we something like. we havent been seeing 'enter champion name here' played as much as we would like so we gonna give them some love","replies":[{"poster":"Aych Pii","date":"2015-10-07T21:49:17.496+0000","up_votes":26,"down_votes":0,"body":"The keyword is \"just\". Popularity is a consideration, but only when popularity is judged to be a function of balance does it warrant a balance change.","replies":[{"poster":"WarlordTim","date":"2015-10-07T21:55:44.891+0000","up_votes":12,"down_votes":0,"body":"Thank you for being rational here.","replies":[]}]}]}]},{"poster":"Oeuf","date":"2015-10-08T01:48:01.735+0000","up_votes":40,"down_votes":5,"body":"If the same six champions are banned every single game i think they are banned for a reason.....\r\n{{champion:17}} {{champion:83}} {{champion:6}} {{champion:432}} {{champion:78}} {{champion:3}} ","replies":[]},{"poster":"Saint Malice","date":"2015-10-07T23:22:30.427+0000","up_votes":37,"down_votes":6,"body":"{{champion:38}} **Needs to be re-evaluated**. _**45.3% win**_ rate because most people can't get past his INCREDIBLY POOR early game. Your can harass every 9 seconds, or when someone walks to close, or when there have been six abilities used. That's pre-6. Your harass all does about 100 damage (over exaggerating). Not ok. \r\n\r\n_**His popularity is 3.2%**_ overall which you know because you decided to make \"Cosmic Reaver Kassadin.\" (Which looks amazing btw! Just hoping his audio changes and he doesn't talk about silencing people... sore subject.) \r\n\r\nAnd lastly his _**Ban Rate is .1%**_, down from a 100% - 90% ban. (Which {{champion:122}} is at now btw, since your ears are to the ground and figured you all already knew but meh.)\r\n\r\nAs a Kassadin main, I have to ask. Why do other AP assassins do city crushing amounts of damages {{champion:45}} {{champion:7}} {{champion:55}} with very little AP. And their early game isn't bad either. Most of whom have hard cc and mobility {{champion:103}} Cough... So give him his silence back and some damage. I'd love to hear a Riot response or have a conversation about where are you are coming from. Because you left the job with Kassadin 1/2 done and you know it.","replies":[{"poster":"Rysa","date":"2015-10-08T01:38:27.548+0000","up_votes":5,"down_votes":7,"body":"Honestly, I'm fine with how he is right now. He might be super weak right now, but it's better than him being beyond OP. Remember around season 3 and season 4? Yea, he was pretty stupid. Let Riot decide when to change him.","replies":[{"poster":"Saint Malice","date":"2015-10-08T11:34:53.446+0000","up_votes":11,"down_votes":2,"body":"And now {{champion:7}} and {{champion:1}} are broken and banned, if not for the Juggernaut update, they would be banned more progressively than they are currently. Their damage is insane given that they can either root you (that chain is sooooooo long.) or stun you whilst you get a fat bear on your noggin that does more damage than it honestly _needs to._ And {{champion:7}} is just as mobile as kassadin, her's just does damage.\n\nI do remember how over powered Kassadin was, and I agree he needed some love from the nerf iron, to kinda smooth him over. But he got the axe, the shovel, and an early grave. And they just left it at that.","replies":[]}]}]},{"poster":"BOBtimer","date":"2015-10-07T23:08:43.532+0000","up_votes":37,"down_votes":7,"body":"Just an idea, but I would think Riot would listen to the PBE when they tell them something\n\nPBE: oh yeah the new reworked {{champion:122}} {{champion:114}} {{champion:82}} and {{champion:41}} are pretty op\nRiot: *silence*\nPBE: Hello? We said that they weren't balanced.\nRiot: Welcome to patch 5.16, the patch where we introduce juggernauts.\n*all juggernauts proceed to have insane damage and become permabans*\nRiot: Why are all these champs never played? We just reworked them and they're always banned now.\nPBE: Fuck you.","replies":[]},{"poster":"alfavhunter","date":"2015-10-07T22:10:40.435+0000","up_votes":20,"down_votes":1,"body":"{{champion:14}} nerfed because of {{item:3725}} (any version)\r\nThen The item was nerfed\r\n{{champion:14}} needs the shield nerf reverted now please, as tank items in general were also nerfed, resulting in him being even weaker (maybe make the shield damage scale per Sion bonus hp increasing its percentage damage by 1% per 400 bonus hp (.25) so late game it can do well but early it won't be so strong\r\n\r\n{{champion:113}} also had this issue...","replies":[{"poster":"lIIlIIIlIIIlIIl","date":"2015-10-08T18:44:33.273+0000","up_votes":5,"down_votes":0,"body":"Stop copying what you see on reddit.\r\n\r\nSion is perfectly strong right now, and the ''nerf'' of cinderhulk got compensated by higher base HP and the addition of new juggernaut items like Titanic Hydra.\r\n\r\nDon't ask for buffing champs simply cause you suck with them\r\n\r\n\r\nI main Sion since his rework, and he only got buffed since then, unless you played him wrong (maxing E and be a immobile poke toplaner)\r\n\r\nThe way to play Sion is jungle and maxing Q, which only got buffed since his release (due to E being nerfed cause people played him wrong)","replies":[]}]},{"poster":"Fancifulfire","date":"2015-10-07T20:19:45.182+0000","up_votes":11,"down_votes":37,"body":"{{champion:157}} <--- Nerf this shit, double crit chance is op if it doesn't reduce crit dmg. A whole 10% isn't enough. You get IE and your up to 250% crit dmg or so.{{item:3070}} ","replies":[{"poster":"The Taco Kat","date":"2015-10-07T20:30:32.129+0000","up_votes":4,"down_votes":5,"body":"It's actually much lower crit damage if he uses his Q.","replies":[{"poster":"Shia DeBuff","date":"2015-10-07T20:49:43.385+0000","up_votes":16,"down_votes":2,"body":"I've seen Yasuo easily hit 800 dmg on his q just with Yomuu's Ghostblade and an Infinity Edge","replies":[{"poster":"lolkamikazelol","date":"2015-10-08T00:29:02.432+0000","up_votes":21,"down_votes":6,"body":"How to beat Yasuo:\r\n1. CC\r\n2. Gank\r\n3. Focus him\r\n4. DONT get hit by his tornado, or any of the knockups on his team for that matter.","replies":[{"poster":"Crowe Stalker","date":"2015-10-09T03:50:35.617+0000","up_votes":5,"down_votes":0,"body":"'CC him' applies to **LITERALLY EVERY CHAMPION EVER** and Knock-ups are not very easily avoidable all the time. Hell, Diana E and Rammus Q count as knock-ups.","replies":[]}]}]}]}]},{"poster":"OU Nightshade","date":"2015-10-08T12:55:15.127+0000","up_votes":13,"down_votes":0,"body":"Sorry, Riot, but I have an extremely hard time to believe you actually know anything about balance anymore. When a champion has an 80%+ ban rate for four patches in a row, even after \"nerfs\", you're clearly doing something wrong or missing the point. Darius has clearly been beyond overpowered ever since his rework, and yet you seem to pass it off as if there's no problem when everyone from bronze players to pros at worlds knows that he has to be banned just for his raw power. Sorry riot, but I absolutely can't take you seriously here.","replies":[]},{"poster":"Valkoor The Dead","date":"2015-10-07T20:23:19.439+0000","up_votes":19,"down_votes":5,"body":"Honestly, your post will probably get a lot of hate. \"Oh, but this guy is balanced, thanks rito, bluh bluh merph\". I just appreciate the transparency you've provided here though. Yes, some champs are op, some champs are underplayed, and some champions have some balance issues in players' opinions. But thank you for at least showing your insight. A lot of players seem to forget that RIOT employees play as well, many of them probably play more than us. So thank you, RIOT Jules, and everyone else involved in making or supporting this post. It's nice to see some insight into your methods of reworking/buffing/nerfing.","replies":[]},{"poster":"The4gotNdeath","date":"2015-10-08T01:19:41.939+0000","up_votes":12,"down_votes":0,"body":"Hey Riot,\r\n\r\nThis is all interesting and stuff, but how about you guys take a play our of Dota's/Hon's playbook and give us access to champion statistical data (like win/play/ban rates) via the client. Some of us are curious as to what the actual percentages look like in real time, and while your at it can we get numbers sorted by division (bronze stats, plat stats, challenger stats etc.) I know you guys will probably just ignore me but I thought I'd ask anyways since christmas is only a couple months away. Thanks to any Riot member who actually looked at this.\r\n\r\n~Sincerely,\r\nThe4gotNdeath","replies":[]},{"poster":"Deep Terror Nami","date":"2015-10-07T21:05:06.346+0000","up_votes":29,"down_votes":15,"body":"This entire article is common sense. Too bad a huge number of players don't use it and will call Riot liars on every aspect of this...\r\n\r\nLook forward to Part 2.","replies":[]},{"poster":"Rent","date":"2015-10-07T21:31:41.280+0000","up_votes":14,"down_votes":2,"body":"I liked it better when the ban rates weren't so polarized. Honestly how it feels like there are around 25 competitive champions when our champion pool is over 100. The competitive pool seemed more diverse before the juggernaut patch. ","replies":[]},{"poster":"However comma","date":"2015-10-07T20:48:19.539+0000","up_votes":2,"down_votes":1,"body":"There are unbalanced champions, That means they do too much from just pushing a button, why land a skill shot when you could press a button?","replies":[{"poster":"WarlordTim","date":"2015-10-07T22:26:02.644+0000","up_votes":11,"down_votes":0,"body":"Champion difficulty is not indicative of balance.  Those are two completely different concepts.","replies":[]}]},{"poster":"Beertaster","date":"2015-10-07T21:33:53.234+0000","up_votes":11,"down_votes":0,"body":"On the other hand, if a large contingent of the player base is constantly complaining about a champion despite balance, then it means riot had failed to satisfy the customer with that champion. You need to take into account that some play styles are toxic and shouldn't be included despite \"balance\".","replies":[]},{"poster":"Doomwielder743","date":"2015-10-07T20:33:16.554+0000","up_votes":10,"down_votes":3,"body":"the thing is, in terms of balance i think things are fine. for me, my issue is not champ damage on an ability, or certain stats, but rather the reworks over the last 6 months. Honestly, after Sion's rework, I had really high hopes. That rework was great imo, and I hoped to see more like it. But it seems that with the juggernaut/fiora changes, these not only seem too simple, but they're also too bland. As Darius, making me have a heal now doesn't make my gameplay more intuitive. It just gives me an advantage over those who don't have a heal. One cool idea I have for Darius that I think is an example of using a champ's identity in game to make abilities is this: all targets pulled in by Darius e are affected with a debuff for 5 seconds that makes any stacks of Darius passive applied to them deal a SMALL amount of percent hp dmg. The amount of damage would be very small, even at max rank of e, to prevent him from becoming too strong. I feel like this would be a better idea because it works with a big part of Darius' kit, his bleed. The heal on q doesn't really \"fit in\" with anything, and frankly, Darius already could 1v2 the top and jungle, and this just further pushes that. This is just my view on some of the more recent reworks. I will say Garen's idea of a villain with ult is good, and morde with drag is okay (although perhaps decrease the hp on it and give it a timer), so my main issues are with Fiora, Darius, and Skarner. If you have any thoughts, please leave them below.","replies":[]}]}