{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2015-03-09T18:41:04.051+0000","title":"Champion Mastery hits PBE","subforum":"Announcements","up_votes":2,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Excalionar","date":"2015-03-11T20:22:28.180+0000","up_votes":605,"down_votes":82,"body":"I'm only interested in this if it's possible to **demote** from your rank **if you do worse** with the champion. \r\nIf it's just *\"Spam-the-champion-enough-to-get-the-badge\"* then it'll be even more worthless than Zimbabwe currency.\r\n\r\n","replies":[{"poster":"Riot Socrates","date":"2015-03-11T20:56:43.906+0000","up_votes":72,"down_votes":11,"body":"***","replies":[{"poster":"CupcakeTrap","date":"2015-03-11T20:58:40.459+0000","up_votes":115,"down_votes":50,"body":"> [{quoted}](name=Riot Socrates,realm=NA,application-id=Ag8jgd8Q,discussion-id=ffY8IMgK,comment-id=00130002,timestamp=2015-03-11T20:56:43.906+0000)\n>\n> There are no demotions planned currently. This isn't intended to be a ranked system in the same sense as leagues. The grading system does give players an idea of how they are improving with a champion via the per game performance evaluation. Also, performance and winning or losing does dramatically effect gains and losses, so a high performing player will unlock rewards much more quickly.\n\nWouldn't the most \"accurate\" assessment of Champion skill be based on a person's Champion-specific Team Builder MMR, relative to their base MMR? If the concept of Champion expertise is defined principally as how much Champion-specific ability a person has?\n\nI get the idea of wanting to acknowledge and reward investment of time and energy into learning a Champion, but I'm not entirely clear on what Riot's aiming for here. Is the idea to tell the team, \"This person is going to be playing above their usual level this match, because they're on a Champion they're really good at\"? Or just to give people bragging rights about their familiarity with a Champion? Or what?\n\nIf a person has played thousands of games with a really weak Champion, and actually does better with other Champions they're less familiar with, would they be getting this distinction? What if the ratio between their Champ-specific MMR and their general MMR is much better than most others have with that Champion? What if much worse?\n\nIt's just that \"being good at a Champ\" is actually kind of an ambiguous concept. I suppose I'm also a bit irked because there's a lot of shallow analysis that goes on in LoL with regard to, e.g., winrates, and people who just do not understand the matchmaker system.","replies":[{"poster":"Kumamiki","date":"2015-03-11T21:39:14.812+0000","up_votes":173,"down_votes":30,"body":"They're aiming for giving the game more goals, as well as incentives to play for more casual players. You're making this way more complicated than it needs to be.","replies":[{"poster":"CupcakeTrap","date":"2015-03-11T21:47:08.567+0000","up_votes":76,"down_votes":9,"body":"> [{quoted}](name=Kumamiki,realm=NA,application-id=Ag8jgd8Q,discussion-id=ffY8IMgK,comment-id=0013000200000002,timestamp=2015-03-11T21:39:14.812+0000)\n>\n> They're aiming for giving the game more goals, as well as incentives to play for more casual players. You're making this way more complicated than it needs to be.\n\nThat may be true. Maybe the goal is just to give people a sense of accomplishment for time invested in the game. To be honest, I was expecting the system to just be a matter of \"get X-thousand wins, get a badge\" or something like that, focused expressly on number of matches. But it seems they're trying to tie this to \"performance\", and I'm kind of curious about how they're defining that.\n\nSure, it's sort of academic, but if people care about these badges, I don't think it's unreasonable to delve a bit deeper. Is the purpose to provide some kind of guidance or education, by rewarding players for focusing on particular subcomponents of the game? (e.g. rewarding great CS, or keeping deaths low?) That would be an admirable goal. Or perhaps they want to reward people for Champion-specific expertise. For instance, if someone is overall Bronze, but plays Xerath at Gold tier, maybe they want to recognize that accomplishment. Or maybe they want to provide some insulation from abuse for people who play a \"trash Champion\", with the system intervening to say, \"hey, lay off, this person actually is a really good Urgot\".\n\nI think knowing more about how they measure \"performance\" will tell us more about what exactly they're aiming to do with this system. My impression is that it's a little more ambitious than just \"give badges for playing X games with a Champion\".","replies":[]},{"poster":"Riot Socrates","date":"2015-03-12T04:54:08.561+0000","up_votes":21,"down_votes":3,"body":"@derpymike since it won't let me respond in your post for some reason will post here. In order to see your performance grade at the end of a game you have to specifically opt in to it by mousing over your score. The grade will only be available to you personally, so other players can't judge you based on this. Champion level can be viewed by other players but loading screen borders only appear if a player is high enough level for it to be worth bragging about so there won't be any badges of shame.","replies":[{"poster":"Derpy Mike","date":"2015-03-12T05:33:06.249+0000","up_votes":12,"down_votes":3,"body":"> @derpymike since it won't let me respond in your post for some reason will post here.\n\nhuh, weird. Anyway.\n\n>In order to see your performance grade at the end of a game you have to specifically opt in to it by mousing over your score. The grade will only be available to you personally, so other players can't judge you based on this.\n\nOh awesome I'm so glad to hear it!\n\n>there won't be any badges of shame.\n\n.....Unless it's a Riven or Nidalee badge hehehehehe....","replies":[]}]}]},{"poster":"Amoebanator","date":"2015-03-11T21:25:15.418+0000","up_votes":46,"down_votes":6,"body":"so what about the supports? ","replies":[{"poster":"CupcakeTrap","date":"2015-03-11T21:34:59.222+0000","up_votes":14,"down_votes":6,"body":"> [{quoted}](name=Amoebanator,realm=NA,application-id=Ag8jgd8Q,discussion-id=ffY8IMgK,comment-id=0013000200000000,timestamp=2015-03-11T21:25:15.418+0000)\n>\n> so what about the supports?\n\nHow do you mean?\n\nThe main thought that occurs to me with regard to supports in this context would be the choice of metric. League has long been firm about the idea that, at the end of the match, all that matters is whose nexus blows up. For example, winning a game with a 0/9/2 KDA gives the same MMR boost as winning with 9/0/2 KDA. While good KDA might correlate with success, it's not always so, even for non-supports. For example, sometimes when the team is losing, I'll see people avoid risky plays that might at least give them a shot at victory, and instead focus on protecting their KDA. The MMR system is based on wins, not KDA, and I think that's good.\n\nOn the other hand, they might be going for a KDA-based metric here. Maybe that's why they're not putting it on Ranked to start with: they're worried that people will start focusing on KDA instead of nexus explosions, potentially harming their teams in the pursuit of badges. This wouldn't necessarily be a bad move: while there are times when winning the match means hurting your KDA, it may be that people are too quick to assume that their deaths are \"worth\". If so, this might play an educational role, leading people to more wins by using KDA (or, e.g., CS, or wards placed) as feedback. While theoretically the two measurements could diverge, it may be the case that, especially for lower-ranked players, they'll improve more if you tell them to \"just make sure you don't die more than five times\" or \"focus on getting 300 CS, win or lose\".\n\nIf they do use such non-nexus-explosion metrics for this system, and encourage people to focus on other factors (like KDA or CS), that could end up being unfair to supports. Even more so than with other roles, supports are all about empowering their teammates (and debilitating their enemies). Sure, the Assist stat represents some of that, but it doesn't directly account for (e.g.) clever warding, or saving teammates from deaths.\n\nWas that the sort of thing you were referring to?","replies":[]}]}]},{"poster":"Riot Socrates","date":"2015-03-11T23:30:10.445+0000","up_votes":63,"down_votes":16,"body":"Edit from original since I mispoke on gains and losses:\r\n\r\nThere are no demotions planned currently. This isn't intended to be a ranked system in the same sense as leagues. The grading system does give players an idea of how they are improving with a champion via the per game performance evaluation. Also, performance and winning or losing does dramatically affect gains, so a high performing player will unlock rewards much more quickly.","replies":[{"poster":"Excalionar","date":"2015-03-12T00:38:30.268+0000","up_votes":23,"down_votes":5,"body":"I'll reword my last question then as well.\r\n\r\nDo the game losses and poor scores affect the point gains enough to make it so you could never reach S rank if you don't play well enough? Or is it possible to play a champion constantly and eventually make it to S rank despite having very little skill with the champion itself?","replies":[]}]},{"poster":"Jaxgar","date":"2015-03-11T21:22:25.727+0000","up_votes":19,"down_votes":37,"body":"\r\nIf everyone can eventually get every character to the highest rank then whats the point. What does this show other than how long you've been playing a character for. ","replies":[{"poster":"pokemonsta433","date":"2015-03-11T21:25:57.559+0000","up_votes":47,"down_votes":7,"body":"It doesn't. The point is to show that you have enough experience. It either shows that you're good enough to get that high that fast, or that you've played enough games that you should know what you're doing by now. Either way it shows that you're a reliable player and can be trusted","replies":[]},{"poster":"SoryInAdvance","date":"2015-03-11T21:40:19.331+0000","up_votes":42,"down_votes":7,"body":"it basically shows that you are less likely to feed as yasuo if you have max tier.","replies":[]}]},{"poster":"Excalionar","date":"2015-03-11T21:00:40.051+0000","up_votes":19,"down_votes":4,"body":"Just one more question if you don't mind me asking;\r\n\r\nIs it possible to achieve the highest rank **if** I play **enough** games with a champion X, even if my score **every single game** is 3 kills / 10 deaths / 3 assists??","replies":[{"poster":"heyheytaytay","date":"2015-03-11T21:35:26.324+0000","up_votes":22,"down_votes":7,"body":"That's the idea, yeah. This isn't supposed to be a competitive ranking. This is supposed to be \"Hey guys, I  really love this champ, look how often I play them!\" \r\n\r\nIt's similar to Smite's system. Every time you play a god in Smite, you earn some points towards your mastery rank for that god. If you win and do well, you'll get a lot more than if you lose (20+ pts vs 3 pts). As you rank up the mastery you have access to some recolored skins (that are gold and diamond colored), profile icons, and loading banners. \r\n\r\nBut this is simply a reward for playing champions you like, not a \"LOOK HOW MANY CHAMPS I'VE MASTERED!\" If you play a lot of champs, and you play them often, then yeah you'll get a lot of champion mastered icons.\r\n\r\nI'm also pretty sure it's going to take a lot of time to get a Rank 5, even if you get nothing but A's.","replies":[]}]}]},{"poster":"RaiseYourBortles","date":"2015-03-11T20:29:27.823+0000","up_votes":6,"down_votes":6,"body":"That what the grade is for","replies":[{"poster":"Excalionar","date":"2015-03-11T20:34:16.530+0000","up_votes":16,"down_votes":2,"body":"It's possible that isn't the case.\r\nIt says you gain points based on how well you do, it says nothing about the possibility of losing the points.\r\n\r\nThere are 5 grades, and 5 tiers of rewards. Therefore it could be possible that grade actually has nothing to do with how well you do with the champion, just how often you play them. **The only advantage to playing better is you'll earn the points faster.** That's all.","replies":[]}]}]},{"poster":"SmashKingDex","date":"2015-03-11T20:55:18.393+0000","up_votes":117,"down_votes":10,"body":"So this \"grading system\".... what is it grading? A positive KDA, most gold on team, Highest Damage Delt, & if you got a VICTORY screen...\r\nOR \r\nis it actually grading each role on the things you're doing in your actual position?\r\nLike well timed Teleports? Damage Taken(if your a TANK should be HIGH)? CS in the Jungle by 20min? Towers Destroyed? 1st Bloods? Killing Streaks? x2, x3, x4, x5 Kills? Positioning in team fights? Vision --placing &/or clearing? \r\nBecause I have a bad feeling that just like SoloQ Ranked that ONLY CARRIES, Hyper Carries, & Burst Mages will ever have the HIGHEST possible Honors/Rewards for each possible outcome.\r\nSeeings how they are the ones who do end the games with the HIGHEST -- Damage, CS, & Kills...\r\nI play\r\n{{champion:32}} {{champion:201}} {{champion:36}} {{champion:3}} {{champion:86}} {{champion:150}} {{champion:57}} {{champion:20}} {{champion:33}} {{champion:58}} {{champion:68}} {{champion:98}} {{champion:102}} {{champion:27}} {{champion:14}} {{champion:106}} {{champion:154}} \r\nand because I don't \"carry games\"...I don't win in Ranked. \r\n\r\nIs this gonna be an actual system that will let YOU & EVERYONE else know the ACTUAL things they need to be improving on? & rewarding people for playing other roles that don't involve having to ACTUALLY \"carry the game(with a + KDA, most Damage Delt, & Highest CS ... ... ... because @ this moment in League if you don't do those things YOU DONT CLIMB RANKED, & therefore must be TRASH...)\"\r\n\r\nI just want people to know that the Mid Lane Mage, Fighter, or Assassin & the ADC aren't the ONLY champs in the game who are making the WIN happen...\r\n\r\nBecause frankly I have been tying to stick by my favorite role, the TANK, & my 2nd fav roles Supp & Jungle ...\r\n... ... ... ... ... ... ... But the way League is set up it's making me feel as each day passes that just give in... & do what 90% of the rest of the people who climb the ranked ladders do ...\r\nPlay {{champion:84}} {{champion:103}} {{champion:69}} {{champion:119}} {{champion:81}} {{champion:105}} {{champion:114}} {{champion:104}} {{champion:24}} {{champion:222}} {{champion:429}} {{champion:38}} {{champion:55}} {{champion:7}} {{champion:64}} {{champion:127}} {{champion:61}} {{champion:15}} {{champion:92}} {{champion:13}} {{champion:91}} {{champion:29}} {{champion:18}} {{champion:157}} {{champion:101}} \r\n\r\nNot that those champs are bad, because they aren't, but they seem to be the only champs that get any credit for anything or climb the Ranked Q's.\r\n{{summoner:3}} ","replies":[{"poster":"Ðiamant","date":"2015-03-11T21:23:49.068+0000","up_votes":31,"down_votes":1,"body":"Nice post. I feel this is a really important thing to address. Even though I main mid lane I still feel that this is really important and the things you talked about above are basically what keep me from playing tanks top. I played {{champion:54}}  a bit before (and still do from time to time) but when you cant (easily) carry the game on your own it seems like you might as well revert back to mid. All that to say I also hope the icons focus on things besides the kda or we're going to have alot of day one {{champion:55}} \"masters\".","replies":[]}]},{"poster":"draggles in NA","date":"2015-03-11T20:19:22.772+0000","up_votes":104,"down_votes":13,"body":"Best Leona EU coming through","replies":[{"poster":"Commieon","date":"2015-03-11T20:23:42.921+0000","up_votes":18,"down_votes":2,"body":"Oh Snapple Apple","replies":[]},{"poster":"Declined","date":"2015-03-11T20:22:17.707+0000","up_votes":15,"down_votes":2,"body":"Get your butt back in EU and tell the website team to make the announcement.","replies":[]}]},{"poster":"Wasabo","date":"2015-03-11T20:13:35.737+0000","up_votes":87,"down_votes":3,"body":"Neato now I can show people how much I suck at a champion I \"main\" ","replies":[]},{"poster":"COWmanLord","date":"2015-03-11T20:19:17.384+0000","up_votes":43,"down_votes":1,"body":"A new way to gain bragging rights and free stuff for playing our mains? Sounds good to me.\r\n\r\nThe only downside. We probably will now see a new wave of people justifying their skills by saying \"I have a A+ rank on [insert champion] you only have a B rank. Clearly I'm better noob.\"\r\n\r\nBut despite the inevitability of those people showing up. I still think this will be awesome.","replies":[{"poster":"Riot Socrates","date":"2015-03-11T20:25:46.113+0000","up_votes":74,"down_votes":6,"body":"You can only see your own grade so other players won't know if you scored poorly.","replies":[{"poster":"Everyone Muted","date":"2015-03-11T20:40:20.518+0000","up_votes":7,"down_votes":0,"body":"***","replies":[{"poster":"Mirross","date":"2015-03-11T20:56:44.596+0000","up_votes":75,"down_votes":6,"body":"No, this won't be available to third party sites. We want the grades to be feedback for you, not something for others to be able to see.","replies":[{"poster":"Excalionar","date":"2015-03-11T21:18:36.866+0000","up_votes":2,"down_votes":13,"body":"***","replies":[{"poster":"LoZfan03","date":"2015-03-11T21:24:08.608+0000","up_votes":16,"down_votes":1,"body":"that's your rank, not your grade","replies":[]}]},{"poster":"LoZfan03","date":"2015-03-11T21:05:17.866+0000","up_votes":8,"down_votes":1,"body":"I think some people might be conflating the post-game grade with mastery rank.  It makes complete sense for game grade to be personal information, same as lp/ip info.  will players' mastery ranks also be hidden information?  (except of course for the voluntary in-game emote)","replies":[]}]}]}]}]},{"poster":"Ekim96","date":"2015-03-11T20:24:10.628+0000","up_votes":62,"down_votes":1,"body":"This is cool, you should be able to unlock champion Icons in the future{{champion:35}} ","replies":[{"poster":"ZekielYT","date":"2015-03-11T20:49:08.876+0000","up_votes":14,"down_votes":2,"body":"{{champion:222}} ","replies":[]},{"poster":"GaleWinUnleashed","date":"2015-03-11T20:29:43.578+0000","up_votes":13,"down_votes":4,"body":"{{champion:105}}","replies":[]}]},{"poster":"Buttsucci","date":"2015-03-11T20:14:55.525+0000","up_votes":12,"down_votes":3,"body":"This is cool and i like it but will enemy Summoners see oour badge in loading screen, Becuase that would tell them we are good with that Champion and camp our lane or something. reallly cool and i am waiting for this, its cool.","replies":[{"poster":"Riot Mixtli","date":"2015-03-11T20:21:43.591+0000","up_votes":64,"down_votes":3,"body":"Team only. Same rules as Ranked banners on loading screen.","replies":[{"poster":"10Tickler","date":"2015-03-11T20:23:06.297+0000","up_votes":18,"down_votes":2,"body":"'cept for Victorious skins...","replies":[{"poster":"Free Draven","date":"2015-03-11T20:40:50.962+0000","up_votes":7,"down_votes":48,"body":"i mean victorious skins dont show much. My Bronze 5 friend has victorious thresh. #beingonanyrankedteamthatsgold+","replies":[{"poster":"sixheftywomen","date":"2015-03-11T20:48:38.398+0000","up_votes":40,"down_votes":1,"body":"Victorious Thresh??","replies":[]}]}]}]},{"poster":"K 2","date":"2015-03-11T20:24:54.759+0000","up_votes":9,"down_votes":0,"body":"but is it cool? :^)","replies":[]}]},{"poster":"ordrint","date":"2015-03-11T20:21:15.922+0000","up_votes":59,"down_votes":0,"body":"Now i can finally show people how good i am at AD Urgot{{champion:6}} ","replies":[{"poster":"Notorious P1G","date":"2015-03-12T00:03:36.225+0000","up_votes":18,"down_votes":1,"body":"This is why we can't have nice things","replies":[]}]},{"poster":"SaucyOcey","date":"2015-03-11T20:44:17.017+0000","up_votes":45,"down_votes":8,"body":"At max rank you should give the person a cheap skin for that champion...I feel like people would work harder towards it then","replies":[{"poster":"DollyDarling","date":"2015-03-12T00:27:43.208+0000","up_votes":6,"down_votes":30,"body":"Awesome, so I can be rewarded with nothing when I max rank on my favorite champion, because I already own all the skins.","replies":[{"poster":"shadowhunter4444","date":"2015-03-12T04:01:10.137+0000","up_votes":31,"down_votes":5,"body":"Ok, we get it. You have all the skins. You people need to shut up and quit complaining whenever someone suggests a skin reward. I know these people are only posting to brag, and frankly we don't give a ****. We don't care that you spent more money on this game, and Riot does not need to cater to your need for a reward over thousands of people who could feel like they've earned something cool. I'm not saying you don't deserve rewards or that Riot should abandon their most loyal customers - namely you guys. I'm saying that just because you gain nothing from something doesn't mean you need to ruin it for everyone else.\r\n\r\nI'm sorry if I came off rude or brusque, I'm just tired of some people, not meaning to overgeneralize. It's the people like this:\r\n\"Free Healthcare for everybody!\"\r\n\"I already have Healthcare, ergo you shouldn't give us that.\"","replies":[]}]}]},{"poster":"BakugoBestBoy","date":"2015-03-11T20:25:36.701+0000","up_votes":36,"down_votes":2,"body":"Does our entire league history go towards this or do I have to start from scratch with all champs?","replies":[{"poster":"Excalionar","date":"2015-03-11T20:46:36.115+0000","up_votes":10,"down_votes":1,"body":"Based on what they did with team builder it will be completely from scratch.","replies":[]}]},{"poster":"Feyesh","date":"2015-03-11T20:22:50.551+0000","up_votes":28,"down_votes":0,"body":"I can't help but be curious as to how they judge the support role in ranking. It's kind of hard to measure \"successful peels\" or \"used wards\". I suppose the best plan would to just judge assists, and the amount of gold farmed with your item (?)","replies":[{"poster":"Drogeist","date":"2015-03-11T22:38:10.607+0000","up_votes":10,"down_votes":0,"body":"I am also curious about this.  There seem to be many stats that are not currently measured that are critical to playing support well (in addition to other roles).  I have a poll about 3 additional stats that would be useful for many champions/roles here:\n\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/ZWJU6aYo-poll-new-end-game-stats\n\nBasically they are: \n\n1) Damage Shielded (self and/or other)\n2) CC Time Inflicted (hard and/or soft)\n3) Damage to Structures (beyond who gets the \"last hit\" on a tower or inhibitor)\n\nI think they would be relevant for evaluating how well certain champions were being played.  For example, If you're playing Lulu, or Sona, or even Riven and you're not shielding lots of damage you're probably not playing them right!  Obviously if it's a stomp there won't be much damage for you to shield, but you'll probably get even more points for stomping anyways, so it won't matter if you get less for this specific stat.\n\nFeel free to vote if you think these would be neat to see in the end-game stats screen regardless of use in the new champion mastery feature.","replies":[]}]},{"poster":"Zemalek","date":"2015-03-11T20:20:41.234+0000","up_votes":26,"down_votes":0,"body":"I can see it now\r\n\r\nPentakill into a Mastery Emote\r\n\r\nI'm already liking this feature","replies":[]}]}