{"poster":"Endrance","date":"2020-01-29T20:50:59.539+0000","title":"¿ Banean por escribir \"izi, easy, ez, isi, facil, tutorial, etc etc\" ?","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":4,"body":"Pregunta simple:\r\n\r\n¿es baneable el \"fácil, izi, isi, etc etc\" ?\r\n\r\n¿ Puedo recibir un ban así sea de chat por reírme del rival ?\r\n\r\nSegún TODA la comunidad de este servidor NO.\r\n\r\nAsí que si por ahí queda algún Rioter me gustaría saberlo oficialmente.\r\n\r\nGracias.","replies":[{"poster":"Diosmo","date":"2020-01-29T21:01:52.830+0000","up_votes":6,"down_votes":0,"body":"Un Rioter te va a decir que es sancionable pero todos sabemos que jamas van a banear a alguien por eso.","replies":[{"poster":"ZyXEL 001","date":"2020-01-30T01:47:58.956+0000","up_votes":2,"down_votes":0,"body":"Qiyana muestra \"gg ez\" en el vídeo de True Damage, o sea, nunca va a ser sancionable algo de ese estilo \n\n{{sticker:sg-poppy}}","replies":[{"poster":"Diosmo","date":"2020-01-30T14:27:44.599+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZyXEL 001,realm=LAS,application-id=PJAKt7ph,discussion-id=QvROww6q,comment-id=00000000,timestamp=2020-01-30T01:47:58.956+0000)\n>\n> Qiyana muestra \"gg ez\" en el vídeo de True Damage, o sea, nunca va a ser sancionable algo de ese estilo \n> \n> {{sticker:sg-poppy}}\n\n:O Eso me lo perdi","replies":[]}]}]},{"poster":"Defg45333","date":"2020-01-29T21:21:22.522+0000","up_votes":3,"down_votes":0,"body":"Oficialmente es sancionable, pero nunca sancionan por eso.","replies":[]},{"poster":"Frôm the deep","date":"2020-01-30T01:42:20.984+0000","up_votes":2,"down_votes":0,"body":"Banearon al invocador con mayor cantidad de puntos de maestría con singed solo por jugarlo soporte con una estrategia no convencional, lo banearon a pesar de que los mismos rioters crearon un post diciendo que no es reportable ni baneable no seguir el metagame, post donde salia una imagen de una morgana soporte diciendo a sus compañeros de equipo \"Hey, voy a jugar con este campeón de esta manera, mi intención no es molestar, porfavor no me reporten\" (O algo parecido). Esta 100% confirmado que fue baneado por esa exclusiva razón, ya que el era un tipazo, simpático, agradable y con buena comunicación y ademas se comunico con el soporte, quien le escupió en la cara.\n\n¿Te pueden banear por escribir \"izi\"? Sí, te pueden banear por cualquier motivo, solo necesitas tener los reportes.","replies":[{"poster":"BASHERHUNTER","date":"2020-01-30T15:21:17.014+0000","up_votes":2,"down_votes":0,"body":"Que feo caso bro, debo temer por mi Udyr supp?","replies":[{"poster":"Frôm the deep","date":"2020-01-30T20:54:57.589+0000","up_votes":2,"down_votes":0,"body":"Pues, la principal razón de los reportes hacia el jugador que mencione fue que su estrategia se basaba en invadir la jungla a principio de la partida, robar el buff enemigo con smite e ir a gankear a top o mid dependiendo de la situacion, dejando al carry solo en los primeros minutos.\n\nSi quieres saber mas sobre esto te recomiendo este video: https://www.youtube.com/watch?v=h3C4-pnMiGc","replies":[{"poster":"BASHERHUNTER","date":"2020-01-30T23:04:48.624+0000","up_votes":2,"down_votes":0,"body":"Gracias bro por la informacion, en ese caso no deberia temer creo, ya que voy con el adc y el item de supp, comportandome como lo haria cualquier otro supp.\nPero roto por objetivos y en late hago full splitpush.\nVere el video :D","replies":[{"poster":"Frôm the deep","date":"2020-01-31T02:03:22.196+0000","up_votes":2,"down_votes":0,"body":"Al final del día la lección es que el sistema no funciona... Te van a banear independiente de lo que hagas o como lo hagas, si es que tienes los suficientes reportes... En normales no se nota, pero cuando llegas a X liga y te mantienes ahí, siempre te emparejan con los mismos y si uno de ellos anda con su grupito o muchos te agarraron mala sangre sin razón, te van a reportar y te va a llegar el baneo. Puede sonar exagerado y aunque yo no lo he vivido, lo he visto... muchos youtubers de renombre han sufrido X situación con X jugadores (Por ejemplo: NB3 baneo a un tipejo por usar una estrategia no convencional / Manute sufrio de drop hack en diamante creo que era en cierto servidor). Estos youtubers pueden mover sus hilos para hacer el caso publico y recibir apoyo, pero no queda nada para el streamer pequeño ni mucho menos para el jugador que solo lo conocen sus amigos.\n\nMi intención no es desearte mal, que te ganes enemigos, lo que trato de decirte es que JAMAS, pero que **_~~JAMAS~~_** esperes algo de riot games, mucho menos de algún rioter, que son básicamente adornos.","replies":[{"poster":"BASHERHUNTER","date":"2020-02-03T15:40:11.628+0000","up_votes":1,"down_votes":0,"body":"Hola bro, perdoname por contestar tan tarde, surgieron inconvenientes xd\nEso tiene \"sentido\", pues se creera a quien tenga mas apoyo o audiencia.\nSi, son feos casos, pero por desgracia los jugadores de a pie no tenemos miles de seguidores que ayuden a \"probar\" nuestraa declaraciones en esos casos.\nOk bro, muchas gracias por el consejo, entonces lo ideal es ni contestar al toxico porque tal vez el y su gente te agarren cariño.\nPor cierto una pregunta bro, eres main Pyke?","replies":[{"poster":"Frôm the deep","date":"2020-02-10T23:48:48.637+0000","up_votes":1,"down_votes":0,"body":"No te disculpes por responder tarde, así como todos, tienes vida propia (Mi tardía respuesta se debe a lo mismo, he estado muy ocupado trabajando).\n\nSi, si soy main pyke, aunque honestamente no lo he usado mucho últimamente. Mi nickname significa \"Desde lo profundo\", que hace alusión a la muerte y \"resurrección\" del campeón en cuestión, y como se ve, mi icono es pyke luna de sangre. {{sticker:sg-ahri-2}}","replies":[{"poster":"BASHERHUNTER","date":"2020-02-11T03:46:34.100+0000","up_votes":1,"down_votes":0,"body":"{{sticker:poppy-wink}} \nJaja, como yo con Yasuo, debo recuperarme con él xD\nEs original, me gusta :D\nTambien supongo que te gustarala tematica de luna de sangre?\nA mi me encanta, es de mis favoritas junto a proyecto y los portadores.\nLe tengo mucho cariño a mi skin de Yasuo luna de sangre pues fue mi primera skin.","replies":[]}]}]}]}]}]}]}]},{"poster":"TomiBVB09","date":"2020-01-29T21:02:33.723+0000","up_votes":2,"down_votes":0,"body":"puede ser tomado en cuenta para un ban obvio, pero solo por poner eso no","replies":[]},{"poster":"The Inkanus","date":"2020-01-30T01:51:08.985+0000","up_votes":3,"down_votes":2,"body":"https://i.imgur.com/KfGE5DO.png?noresize\n\nhttps://i.imgur.com/xZT6pXj.png?noresize\n\nhttps://i.imgur.com/33X7HIc.png?noresize","replies":[{"poster":"Frôm the deep","date":"2020-01-30T20:48:45.145+0000","up_votes":1,"down_votes":0,"body":"Vaya, que buen aporte. {{sticker:sg-lulu}}","replies":[]}]},{"poster":"N4V1D4D","date":"2020-02-10T01:01:36.879+0000","up_votes":1,"down_votes":0,"body":"vivimos en un mundo sensible los machos los fuertes los aptos,son oprimidos por el gran pensamiento mayoritario de los debiles","replies":[]},{"poster":"Donato Borget","date":"2020-01-31T13:28:39.782+0000","up_votes":1,"down_votes":0,"body":"si es sancionable, y yo siempre reporto a este tipo de personas y me sale casi siempre los cartelitos estos de retroalimentación instantánea.\nLos q dicen que no es porque creen que no sirve reportar y van plagando a toda la comunidad con esas ideas de que reportar por esta razon y tal no tiene efectividad","replies":[]},{"poster":"xaxesis","date":"2020-01-30T05:00:32.460+0000","up_votes":1,"down_votes":1,"body":"yo creo que no debes preocuparte tu haz lo que siempre haces no te va pasar nada nadita jjjjj","replies":[{"poster":"Endrance","date":"2020-01-30T19:42:12.755+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xaxesis,realm=LAS,application-id=PJAKt7ph,discussion-id=QvROww6q,comment-id=0007,timestamp=2020-01-30T05:00:32.460+0000)\n>\n> yo creo que no debes preocuparte tu haz lo que siempre haces no te va pasar nada nadita jjjjj\n\nCreo que entendiste el post al revés.","replies":[{"poster":"xaxesis","date":"2020-01-30T19:50:57.808+0000","up_votes":1,"down_votes":1,"body":"No pasa nada jjjjjjjj","replies":[]}]}]},{"poster":"Kanreiher","date":"2020-01-30T12:04:31.485+0000","up_votes":1,"down_votes":0,"body":"en cada partida que veo que alguien trollea se va afk o cualquier cosa que sea reportable siempre dicen report esto por tal motivo\nestamos en league of legends gente aca los reports se los pasan por el arco del triunfo para no decir otra palabra\n\nsi quieren reportar y ser escuchados en sus reportes con razon muevansen para el dota \nen el lol no escuchan nada los de arriba\ntomenlo de mi que ya reporte asta denuncie a usuarios por hacer cosas que ya eran exageradas \ny te dicen el mismo mensage pero no hacen nada\nejemplo denuncie a xxx jugador por hacer xxx cosa lo reporto, me lo cruzo devuelta en otra partida con la misma actitud\nlo reporto devuelta mando un ticket a riot denuncia de jugador \nluego me volvi a cruzar devuelta con ese jugador\nsi no te quieren escuchar esta bien\npero gente sepan una cosa....{{sticker:sg-lulu}} \n**ACA LOS REPORTS NO VALEN NADA**\nclaro que sancionan a los jugadores pero solo por el chat nada mas","replies":[]},{"poster":"lordeman10","date":"2020-01-30T00:17:23.044+0000","up_votes":1,"down_votes":0,"body":"si lo pones te reportan y si te reportan mucho te banean","replies":[{"poster":"Defg45333","date":"2020-01-30T01:41:59.014+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=lordeman10,realm=LAS,application-id=PJAKt7ph,discussion-id=QvROww6q,comment-id=0004,timestamp=2020-01-30T00:17:23.044+0000)\n>\n> si lo pones te reportan y si te reportan mucho te banean\n\nSi así fuera, ya habrían baneado más de medio server...","replies":[]}]},{"poster":"YatsunumaSLY","date":"2020-01-29T21:37:23.703+0000","up_votes":2,"down_votes":9,"body":"ajajaj, tengo 2 amigos que cuando ganan ponen \"fasil\" y honor 5 los 2 ajajaj, no hacen nada por lo corto del texto, aunque lo reporten el bot no los detecta como banneable jajaja, asi que a beber agua y mejorate bro ajajajaja","replies":[{"poster":"Endrance","date":"2020-01-29T22:08:03.283+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=YatsunumaSLY,realm=LAS,application-id=PJAKt7ph,discussion-id=QvROww6q,comment-id=0003,timestamp=2020-01-29T21:37:23.703+0000)\n>\n> ajajaj, tengo 2 amigos que cuando ganan ponen \"fasil\" y honor 5 los 2 ajajaj, no hacen nada por lo corto del texto, aunque lo reporten el bot no los detecta como banneable jajaja, asi que a beber agua y mejorate bro ajajajaja\n\n¿mejórate? no creo haber escrito algo que diga que estoy mal o algo, pero bue.\n\nIrónicamente es al contrario, miembros de mi equipo se burlaron del rival y yo los reporte.\n\nAun así la idea es ver si aun queda algún Rioter en este foro y de paso saber si es baneable o no de una manera oficial.","replies":[]}]}]}