{"poster":"TinyTigr","date":"2017-06-19T01:07:35.686+0000","title":"SoloDuoQeue WOLLT IHR MICH VERARSCHEN?","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":7,"body":"Ich spiele ziemlich lange und auch gerne Leauge of Legends aber im letzten Game [ SoloQeue ] ist mir der Kragen geplatzt!\r\n\r\nich kriege ca. jedes 2te Spiel leute in mein Team die der Elo in keinster Weise  gerecht werden und sowas von agressiv, nicht kritikf&auml;hig und vorallem rotzen frech sind , sowas hab ich in meiner langen Gamer Laufbahn nicht gehabt und ich bin bestimmt seid 15 Jahren aktiv am spielen ( Konsole, Computer usw. ) \r\n\r\nIn meinem letzten Match hatte ich einen Support der anfangs erstmal seine eigene Lane gefeeded und verloren hat, dann auf meine Lane gekommen ist, nachdem ich ihn weggepinkt habe, wurde ich aufs &uuml;belste beleidigt und er fing an meine lane zu trollen ( feeden, EXP klauen, Body blocken ) und das alles um 2:30 Nachts . \r\nAls ich dann mit ihm diskutiert habe, beleidigt wurde und er sich &uuml;ber mich lustig gemacht hat, haben wir ihn am ende reportet und ICH BEKOMME OHNE SPA&szlig; eine Chatsperre? WAS? ich war mit abstand der beste, hatte guten farm, mein restliches team hat auch gut zusammengespielt und nur weil ich mit jemanden reden wollte der einfach nur geistig minderbemittelt ist, kriege ICH eine Strafe? ich wurde jetzt letztens permanent gebannt aufgrund von SARKASMUS IM CHAT , das muss man sich erstmal auf der Zunge zergehen lassen, weil ich Sarkastisch zu leuten war, die ebenfalls getrollt, reingefeedet und toxic waren , einfach nur Sarkastisch war... \r\nAuf Frage was da so schlimm dran w&auml;re und dass das den Ban in keinsterweise rechtfertigt bekam ich nur eine Roboter-Email die ich jetzt zum x5 Mal bekam.\r\n\r\nES IST EINFACH NURNOCH L&Auml;CHERLICH Riot Tritt dir ins Gesicht , weil du einfach vern&uuml;nftig spielen wolltest, getrollt, beleidigt und erniedrigt wurdest und man sich darauf nur selbst verteidigt.... \r\nAber diese Kinder, Jungendlichen oder eventuell sogar ein paar Erwachsene, die das Game durch ihr abnormal widerliches Verhalten verunstalten, bleiben verschont und machen fr&ouml;hlich weiter....  Ich gehe schon mit einer derartig ekligen, negativen Einstellung in ein Match, weil in 90% der F&auml;llen wieder 1-2 dabei sind, die einen das Game einfach ruinieren wollen, als h&auml;tten sie keinen anderen LEBENSINHALT..... abgesehen davon, dass man auch in seiner Elo stecken bleibt weil es einfach unm&ouml;glich wird sich hochzuspielen , egal wie hart man es versucht...\r\n\r\nBitte &auml;ndert da was Riot und zieht nicht einfach Schimpfw&ouml;rter oder angebliches negatives Verhalten aus einem Kontext herraus ohne jeglichen Hintergrund und stoppt diese wirk&uuml;rliche Strafverteilung, beseitigt bitte den Ausl&ouml;ser, die [ Troller ] nicht die Opfer [ wir normalen Spieler ] die damit einfach nichtmehr umgehen k&ouml;nnen und mit den Nerven am Ende sind.","replies":[{"poster":"Sirrkas","date":"2017-06-19T09:59:12.028+0000","up_votes":5,"down_votes":0,"body":">ich kriege ca. jedes 2te Spiel leute in mein Team die der Elo in keinster Weise gerecht werden\n\nDas Gefühl hat sicher so ziemlich jeder, der auf sein Team angewiesen ist. Meistens stimmt das aber nicht mit der Realität überein. \n\n>Als ich dann mit ihm diskutiert habe, beleidigt wurde und er sich über mich lustig gemacht hat, haben wir ihn am ende reportet und ICH BEKOMME OHNE SPAß eine Chatsperre? WAS? ich war mit abstand der beste, hatte guten farm, mein restliches team hat auch gut zusammengespielt und nur weil ich mit jemanden reden wollte der einfach nur geistig minderbemittelt ist, kriege ICH eine Strafe? \n\nWenn du ihn beleidigt hast, zum Beispiel indem du ihn als geistig minderbemittelt bezeichnet hast, ja, dann kriegst du eine Strafe. Es müssen auch nicht unbedingt Beleidigungen sein. Es reicht schon, wenn du ihn blamst, stichelst und dergleichen. Zudem hat deine spielerische Leistung keinen Einfluss auf die Strafen für deine sozialen Fehltritte. Du könntest der beste Spieler der Welt sein, wenn du ständig toxisch bist, warst du vielleicht der beste im Team, das schützt aber nicht vor dem Permabann. \n\n>ich wurde jetzt letztens permanent gebannt aufgrund von SARKASMUS IM CHAT , das muss man sich erstmal auf der Zunge zergehen lassen, weil ich Sarkastisch zu leuten war, die ebenfalls getrollt, reingefeedet und toxic waren , einfach nur Sarkastisch war...\n\nDu hättest auch einfach ruhig sein können und sie nach dem Spiel melden können. Aber sich über andere lustig machen, wird von den meisten Spielern nicht gerne gesehen. Deswegen gibt es dafür Strafen. \n\n>und man sich darauf nur selbst verteidigt....\n\nSelbstverteidigung beschreibt die Mittel, die nötig sind, um sich selbst vor Schaden zu bewahren. In einer Prügelei könnte man darunter vielleicht noch verstehen, den anderen zu Boden zu bringen und fest zu halten, bis er sich beruhigt. Bewusstlos schlagen, ginge ziemlich sicher zu weit, hängt aber wohl vom Einzelfall ab. \n\nIn LoL hast du aber eine ganz einfache Möglichkeit dich selbst zu verteidigen, du stellst den Spieler stumm. Dann kann er dich nicht mehr Beleidigen. Zurückbeleidigen ist keine Verteidigung, dass ist lediglich ein weiterer Angriff. Es schützt dich nicht vor weiteren verbalen Attacken, im Gegenteil, es wird viel eher weitere anstacheln. Nach dem Spiel kannst du ihn dann melden und du hast alles getan, was nötig ist. Du hast ja jetzt selbst erlebt, dass das Reportsystem funktioniert. \n\n> Ich gehe schon mit einer derartig ekligen, negativen Einstellung in ein Match, weil in 90% der Fällen wieder 1-2 dabei sind, die einen das Game einfach ruinieren wollen, als hätten sie keinen anderen LEBENSINHALT\n\nScheinbar triffst du auf solche Leute oder meinst auf solche zu treffen, eben weil deine Einstellung so negativ ist. Ich verhalte mich in meinen Spielen neutral bis freundlich. In meinen Spielen gibt es dann oft sogar Leute, die sich entschuldigen, wenn sie mal dumm gestorben sind, meistens ist sogar jemand dabei, der die anderen aufmuntern will. Klar, ich habe auch manchmal Flamer, die offensichtlich keinen Plan haben, worüber sie gerade sprechen, die sehe ich aber eher als belustigend an und zudem habe ich die Gewissheit, dass er bestraft wird, wenn ich ihn melde und er solche Sachen öfter macht. \n\nWürde ich dagegen dem Jungler oder ADC schreiben, sie wären Vollidioten, die nicht nach XY gehören, würden die sicher nicht eine Entschuldigung schreiben, sondern eher gegen mich wettern und zurück beschuldigen. Daraus entwickelt sich schnell ein Teufelskreis und schon hat man 2 Flamer und so gut wie immer solche Leute im Spiel, weil man selbst dazu beiträgt, dass die Situation eskaliert. \n\n>abgesehen davon, dass man auch in seiner Elo stecken bleibt weil es einfach unmöglich wird sich hochzuspielen , egal wie hart man es versucht...\n\nDas dagegen liegt daran, dass man nicht gut genug ist, um weiter aufzusteigen. Bei deinen Supportspielen zum Beispiel, könntest du etwas mehr Warden. Deine Gegenstücke sind zwar nicht immer besser als du, wenn du aber ein Spiel mit Sightstone beendest und der Toplaner nur 3 Wards weniger platziert hat, machst du etwas falsch, vor allem, wenn der 5 statt  wie du 1 Kontrollauge verwendet hat. Wenn dein Gegenstück mehr als doppelt so viele Wards platziert hat, wirst du auch nicht gerade geglänzt haben. Also ja, auch du hast Spiele, in denen du offensichtlich nicht in deine Division gehörst. \n\n>Bitte ändert da was Riot und zieht nicht einfach Schimpfwörter oder angebliches negatives Verhalten aus einem Kontext herraus ohne jeglichen Hintergrund und stoppt diese wirkürliche Strafverteilung, beseitigt bitte den Auslöser, die [ Troller ] nicht die Opfer [ wir normalen Spieler ] die damit einfach nichtmehr umgehen können und mit den Nerven am Ende sind.\n\nAuch, wenn du das nicht hören willst. Aber du bist ein Teil des Problems, sonst hättest du keine Strafen erhalten. Ja, Trolle sind nervig, aber die meisten entstehen durch das, was die Flamer schreiben. Auch bei deiner Spielbeschreibung mit dem trollenden Support klingt das so, als wäre er erst zu dem Entschluss gekommen, das Spiel zum trollen zu nutzen, nachdem du ihn dazu provoziert hast. \n\nWenn wir ihn fragen, wird der Spieler sicher sagen, er hat auf der Botlane keine Chance gehabt und als er dir helfen wollte, um noch nützlich zu sein, hast du ihn dauernd angefahren, weshalb er sich dann dazu entschlossen hat, dir das heim zu zahlen. Das wäre sicher nicht die passende Reaktion von ihm gewesen und er hat es dann ebenso verdient bestraft zu werden, allerdings trägst du in so einem Fall eben eine Mitschuld daran, dass es überhaupt einen Troll in deinem Spiel gab.","replies":[{"poster":"Pandeonor","date":"2017-06-19T14:24:57.869+0000","up_votes":5,"down_votes":0,"body":"+1 für den Kommentar\n\n\nUnd zum TE: Ich kenne das auch, auch wenn ich Neuling bin. Ich hätte meiner MF im ranked heute auch einiges an Sarkasmus an den Kopf hauen können wie es dann später die anderen Spieler getan haben. Ich wusste bereits nach rd. 4 Minuten das das Spiel verloren ist - und dabei war MF Silber V während der Gegenüber Bronze V war. Ich habe keinen Buchstaben geschrieben - wozu auch - obwohl meine Aufstiegserie mit diesem Match verloren war. Brav zuende gespielt trotz super Toplaner in absolut aussichtsloser Position. Augen zu und durch. Was hat dann \"play safe\" und \"stay under turret\" anderer genutzt - nur das MF geantwortet hat \"I can stay in base if you want\".  \n\nWer kann schon sagen mit welchem Fuß andere aufgestanden sind. Wohl keiner - und niemand kann das Spielvermögen anderer im eigenen Team ändern.... es sei denn.... so wie hier schon gesagt wurde mit positiver Motivation oder positiv formulierter Kritik  zum positiven oder mit Flamen und Sarkasmus zum negativen.","replies":[{"poster":"TinyTigr","date":"2017-06-19T20:00:49.130+0000","up_votes":1,"down_votes":3,"body":"Komisch ist leider nur, wieso ausgerechnet ich immer mit solchen Leuten geranked werde. \n\nLeider wird man immernoch enttäuscht obwohl man seine Erwartung schon in den Keller geschraubt hat","replies":[]}]},{"poster":"TinyTigr","date":"2017-06-19T19:55:48.016+0000","up_votes":1,"down_votes":2,"body":"Ich habe deinen Text einmal kurz überflogen.\n\n1 - Ich sehe mich keiner Schuld bewusst, ich lasse mir lediglich nicht alles gefallen.\n2 - Der Troll fing schon auf seiner eigenen Lane an, als er anfing zu diskutieren, gefeedet und danach auf meine Lane kam und damit fortzufahren.\n3 - Daraufhin wurde er weggepinkt und ich wurde direkt: Rassistisch beleidigt aufs übelste.\n4 - Chatsperre Aufgrund von einer Diskution im Chat die ich nichteinmal angefangen hatte bzw wo ich sachlich blieb, während er nur am beleidigen war?\n5- Mute Button Hilft leider nicht, wenn dir jemand jede Sekunde des Games, sogar beim Back porten an am Hintern klebt und dich einfach nicht in Ruhe lässt, Farm klaut, töten lässt, body block etc. ) \n6 -Am besten, du merkst es x10 Games hintereinander am eigenen Leib, eventuell hast du dann auch nichtmehr so eine ruhige und Neutrale Sicht auf die Dinge.\n7- Für mich klingst du wie ein typischer Riotmitarbeiter , sorry aber ich teile deine Sicht einfach nicht da sie schlichtweg nicht stimmt. \n8- Wenn andere Trollen ist es nie Eigenschuld, weil jemand der trollt, macht es aus eigenen Willen, egal was oder wie du mit ihm umgehst, besteht kein Grund anfangen alles und jeden nach unten zuziehen, das wirst du im echten Leben eventuell auch bald erfahren.","replies":[{"poster":"Sirrkas","date":"2017-06-19T21:19:38.859+0000","up_votes":4,"down_votes":0,"body":">1 - Ich sehe mich keiner Schuld bewusst, ich lasse mir lediglich nicht alles gefallen.\n\nMusst du auch nicht. Aber aktuell wirkt es nicht so, als wärst du unschuldig gewesen. Wenn du wirklich der Auffassung bist, nichts falsch gemacht zu haben, zeig uns deinen Chatlog, am besten als Screenshots. Findet sich da nichts, was die Strafe rechtfertigt, stehen die Chancen gut, dass man den Support darum bitten kann, die Strafe aufzuheben. Selbst wenn du die Strafe schon abgearbeitet hast, wäre das noch sinnvoll, da sie den Eintrag löschen können.\n\n>2 - Der Troll fing schon auf seiner eigenen Lane an, als er anfing zu diskutieren, gefeedet und danach auf meine Lane kam und damit fortzufahren.\n\nDann ist das blöd für dich gelaufen. \n\n>3 - Daraufhin wurde er weggepinkt und ich wurde direkt: Rassistisch beleidigt aufs übelste.\n\nDann hast du ihn hoffentlich gemeldet. Der kriegt dafür dann auch früher oder später sein Fett weg.\n\n>4 - Chatsperre Aufgrund von einer Diskution im Chat die ich nichteinmal angefangen hatte bzw wo ich sachlich blieb, während er nur am beleidigen war?\n\nAuch wenn du das nicht gerne hörst, das ist aber unglaubwürdig. Es kommen hier ständig Leute her, die sagen, sie hätten nichts falsches gemacht und wurden bestraft. Sei es, dass sie \"nur die Wahrheit\" gesagt haben wollen, \"der andere es verdient hat\" oder sie \"nur zurück beleidigt haben\". \n\nDeswegen glaube ich dir das erst, wenn ich den Chatlog sehe. \n\n>5- Mute Button Hilft leider nicht, wenn dir jemand jede Sekunde des Games, sogar beim Back porten an am Hintern klebt und dich einfach nicht in Ruhe lässt, Farm klaut, töten lässt, body block etc. )\n\nAber es hätte gegen das Geflame geholfen. Und melden kann man jedes Fehlverhalten.\n\n>6 -Am besten, du merkst es x10 Games hintereinander am eigenen Leib, eventuell hast du dann auch nichtmehr so eine ruhige und Neutrale Sicht auf die Dinge.\n\nIch kann dir versichern, dass wird nicht passieren. Richtige Trolle sind eine Rarität, zumindest in meinen Spielen. In den ganzen Seasons, die ich schon Spiele, erinnere ich mich nur an einen, den ich als Troll bezeichnen würde, der in meinem Team war. Und der Spieler ist auch noch zurück gekommen und hat als Köder fungiert, wodurch wir dann doch noch gewonnen haben. \n\n>7- Für mich klingst du wie ein typischer Riotmitarbeiter , sorry aber ich teile deine Sicht einfach nicht da sie schlichtweg nicht stimmt.\n\nOder aber ich bin auch nur ein ganz einfacher Spieler (mit einem schicken bunten Namen im LoL-Forum, weil er im Volunteerprogramm ist) und meine Schilderung entspricht der Wahrheit. Bei ersterem kann ich dir garantieren, dass es so ist. Bei letzterem kann ich dir nur mein Wort geben. Ich kann mich zumindest nicht daran erinnern, dass es eine nennenswerte Anzahl an intentional Feedern und Trollen in meinen Spielen gab, falls da überhaupt welche waren. Klar, ich hatte schon einige, bei denen ich mir dachte, wie man nur so dumm sein kann und alleine in den Gegner Jungle geht, während alle Gegner fehlen und wir keinerlei Sicht auf deren Hälfte der Karte haben und dann stirbt. Das ist aber ein ganzes Stück von int. Feeding und Trolling entfernt. \n\n>8- Wenn andere Trollen ist es nie Eigenschuld, weil jemand der trollt, macht es aus eigenen Willen, egal was oder wie du mit ihm umgehst, besteht kein Grund anfangen alles und jeden nach unten zuziehen, das wirst du im echten Leben eventuell auch bald erfahren.\n\nJa, aber du flamst auch aus eigenem Willen. Zumindest erweckst du den Eindruck, dass du flamst. Du meinst aber, dass du dich keiner Schuld bewusst bist \"sachlich\" diskutiert hättest und die Beleidigungen ertragen hättest. Wenn das wirklich so wäre, wärst du der erste, den ich im Forum antreffe, der bei dem Thema einmal die Wahrheit gesagt hat und seine Strafe nicht verdient hat, da er nie selbst toxisch war. Die Chance besteht, schließlich hatte das Instantfeedbacksystem bei der Einführung eine False-Positive-Rate von 1 zu 6000. Wobei man hier noch erwähnen muss, dass das alle einschließt, die etwas zu hart bestraft wurden und die Spieler deswegen nicht komplett unschuldig waren. \n\nDu kannst mir das gerne mit dem Chatlog beweisen. Bis dahin werde ich aber an meinen Erfahrungswerten festhalten. \n\n> egal was oder wie du mit ihm umgehst, besteht kein Grund anfangen alles und jeden nach unten zuziehen, das wirst du im echten Leben eventuell auch bald erfahren.\n\nIch habe übrigens keine Ahnung, was du mir damit sagen wolltest.","replies":[]}]}]},{"poster":"Ribenji","date":"2017-06-19T02:39:36.690+0000","up_votes":4,"down_votes":0,"body":"Versteh mal den Kontext den du schreibst. Du bestätigst mit deiner Aussage, das der Ban und die Chat sperre gerechtfertigt sind. \nDer Chat ist nicht für 'sarkastische' Kommentare da, zumal beim schriftlichen der Sarkastische Unterton fehlt. ;)\nDer Chat ist auch nicht dazu da stunden lang mit Leuten zu diskutieren, dass die scheiße sind und dich nicht trollen sollen. \nDas worüber du dich aufregst, tust du auch. \nWas machst du denn während du mit dem Typen schreibst? Nichts! Genau, du stehst afk am Tower/In der Base etc.\nWenn du dich einfach auf dein Game konzentrieren würdest & Leute mutest, anstatt stundenlang sinnlos mit denen zu schreiben,\nwürde aus einem Problem auch nicht 2 werden. Mit deinem verhalten führst du nicht zu einer Verbesserung der Community sondern zur Verschlechterung. Du heizt die Leute einfach nur weiter dazu an scheiße zu sein^^","replies":[{"poster":"Schlachtenhorn","date":"2017-06-19T08:42:24.600+0000","up_votes":2,"down_votes":1,"body":"Kurzer Zusatz zu deinen Text:\n\"nachdem ich ihn weggepinkt habe,\"\nIch reporte sowas auch immer je nach Intensität.\n(Kann meines Wissens nach auch ein Grund sein für Chatsperre, jedoch weiß ich das Ehrlich gesagt nicht)\n\nAnsonsten Super Text Rakan","replies":[{"poster":"Ribenji","date":"2017-06-19T09:48:55.429+0000","up_votes":2,"down_votes":0,"body":"Ping spamm ist ein Report Grund und auch der Grund warum Riot den Ping mute eingeführt hat. Führt aber soweit ich weiß, nicht zu Chat sperren.","replies":[]},{"poster":"TinyTigr","date":"2017-06-19T19:46:52.446+0000","up_votes":1,"down_votes":2,"body":"- Ich habe nicht spamm gepinkt sondern lediglich 2-3 mal um im deutlich zumachen, dass er bitte zu seinem Adc gehen soll, da er momentan daunten starke Probleme hat.\n- darauf folgte eine Parade aus Beleidigungen, bitte entschuldigt meine Wortwahl: STFU, L2P , Fucking Noob , Motherfucker´´ wegen einen simplen Ping der vollkommen berechtigt ist und  sogar dafür gedacht ist.\n-Kurzgefasst: ein Spiel was nurnoch Zeitverschwendung war, Laune im Keller, wegen eines simplen Pings der vollkommen in Ordnung ist, da ich keinen Support auf meiner Lane brauch , der in den Tower läuft und sich töten lässt.","replies":[]}]},{"poster":"TinyTigr","date":"2017-06-19T19:41:44.137+0000","up_votes":2,"down_votes":2,"body":"Du hast wohl Schwierigkeiten beim lesen, was ich bei meinem Text teilweise verstehen kann aber dennoch dein Kommentar keinen Sinn wiedergibt.\nIch stand 12/2, am meisten Farm , meister Damage, restliches team bis auf den Troller auch super dabei, geschrieben hab ich nur ,wenn ich tot war oder kurze sätze zwischen drin: Man nennt sowas Multitasking, wenn du für ein paar kleine Wörter afk am Tower stehen musst, hast du mein Beileid. 2tens Sarkasmus steht in keinem Bezug zu den Verhaltensregeln , die du dir wohl auch nicht durchgelesen hast, ich war weder Rassistisch hab ich ihn direkt beleidigt. Einen sogennanten Unterton gibt es beim schreiben nicht, ist ja nicht so als würdest du die Wörter während des schreibens betonen um es jemanden anders zu vermitteln. \n\nKurz gefasst:\n\n- Game lief gut trotz. des Trollers. \n- Die restlichen Spieler waren auch gut dabei und halfen.\n- trotz mehrfacher bitte, das er doch aufhören solle, da wir am gewinnen sind, Keine Reaktion.\n- man wurde beleidigt, er wurde rassistisch, kurz und knapp: Minderer Abschaum der mit leeren Worten umsich wirft..\n\nWollte mit dieser Situation nur einmal verdeutlichen was man mittlerweile in dem Game vorfindet und man einfach nichts dagegen tun kann.\n\nDA BRINGT AUCH KEIN MUTE BUTTON WAS, wenn der Typ dir am Arsch klebt und durch 24/7 Trollt. Spielen ist somit einfach unmöglich.","replies":[]}]},{"poster":"Undy1ng","date":"2017-06-19T08:17:18.183+0000","up_votes":3,"down_votes":0,"body":"Es gab früher eine Zeit da dachte ich ähnlich.  Ich war toxic bis zum geht nicht mehr.  Season 2 hatte ich dann meinen 14 Tage Ban.  Nun ja ab da musste ich umdenken,  und was soll ich sagen seit diesem ban folgte kein weiterer nicht mal ein chatban.... Ich bin ein sehr positiver Mensch geworden,  amüsiere mich wenn leute flamen,   konzentriere mich auf mein spiel,   und bin gut genug um spiele zu gewinnen obwohl ich manchmal solche Leute wie du sie hast im spiel habe.  Reagierst du einfach nicht auf das was sie tun verlieren sie ihre Motivation dir zu schaden und falls doch, dann verliere ich halt\n\n\nSeit 3 Jahren spiele ich jeden Tag paar Games,  aber sobald ich verliere ein spiel ist League für mich vorbei und mir geht's super,  außerdem kann ich nach jeden spiel meine Mates melden,  mit paar Sätzen dazu und in letzter Zeit bekomme ich jeden 2 Tag eine Meldung das ich geholfen habe einen Spieler zu bestrafen \n\n\nProbiere es mal  ;)","replies":[{"poster":"TinyTigr","date":"2017-06-19T20:13:24.506+0000","up_votes":1,"down_votes":2,"body":"Du verstehst die Message hinter meiner Nachricht nicht.\n\nIch war nicht toxic, weder habe ich geflamed , ich habe mich den Regeln entsprechend verhalten sogar nachdem ich schon aufs übelste Beleidigt wurde.\n\nWieso ich danach eine Sperre erhalte, weil ich mit ihm dann diskutiert habe, weil ich noch die leise Hoffnung hatte, dass ich ihn eventuell zum umdenken bewegen konnte, das er einfach aufhört und normal weiter spielt?. \n\nDas schlimme ist ja, dass wir am gewinnen waren trotz seiner Troll Aktionen und er trotzdem nicht aufgehört hat.\nDas zeigt halt ganz kurz und knapp, dass er keinerlei Lebensinhalt hat, wenn er leute Nachts trollt. Dann soll er sich selbst bemittleiden und nicht andere nerven.\n\nIch reporte ständig leute mit einem kleinen Text dazu: wieso, weshalb und ich bekomme sogut wie nie ein Feedback, obwohl die meisten rassistisch und extrem beleidigend war, deshalb ja auch meine Aussage: Ändert bitte was an eurer Strafverteilung.\n\nWo ist denn der Sinn, wenn ich gut spiele, nichts falsches tu und nur versuche den einen klar zumachen, das er es unterlassen soll und dafür bestraft werde am ende ? \n\nIch meine , wenn sich in der öffentlichkeit sich jemand daneben benimmt, handgreiflich wird oder sonst was, gehe ich auch dazwischen , verteidige die betroffene Person und gebe dem Angreifer aufs Maul, was sogar schon passiert ist, danach wurde ich sogar applaudiert wegen meiner zivilcourage, hier bekommst du eine Chatsperre reingedrückt, gleichgesetzt wie ein Tritt ins Gesicht","replies":[{"poster":"Undy1ng","date":"2017-06-20T06:35:30.930+0000","up_votes":1,"down_votes":0,"body":"Oh ich verstehe dich schon, aber du kannst solche Leute nicht zum umdenken bewegen, es bringt nichts.\n\nWürde aber trotzdem gerne sehen was du geshrieben hast. Dude!","replies":[]}]}]},{"poster":"Not2nice","date":"2017-06-19T02:46:13.288+0000","up_votes":3,"down_votes":0,"body":"UUUuuuund wieder einer der denkt dass Skill vor Verhalten kommt.\n\nDu hast eine Chatsperre = dein Verhalten war negativ, irrelevant ob Sarkasmus oder nicht, es wird schon seit Begin gesagt, Leute Muten und selber sein Chat Fenster  in ruhe lassen.\n\n\nDie Comm setzt sich ein um Mute Button um Ping mute Button und ein großer teil nutzt ihn nicht, schade..","replies":[{"poster":"TinyTigr","date":"2017-06-19T20:19:19.339+0000","up_votes":1,"down_votes":2,"body":"Uuuund wieder einer der seine Fähigkeit zu lesen verlernt hat.\n\nIch hab mit ihm sachlich diskutiert, während er mich beleidigt hat und auch rassistisch wurde.\nskill hat mit der Sache überhaupt nichts zutun, ich wollte damit nur anmerken, dass ich nicht schlecht war und mich im Chat trotzdem noch moderat verhalten hatte, obwohl ich einen kompletten Vollidioten vor mir hatte, der mich nur stumpf beleidigen konnte und danach eine Chatsperre kassiert.\n\nMute button bringt dort einfach nichts zum x100 Mal:\n\nWenn dir jemand 24/7 an den Backen klebt, dich trollt, sich töten lässt, farm klaut, was soll da deiner Meinung nach ein Mute-button bringen? bis auf die Tatsache das ich seine Beleidigungen ncihtmehr lesen muss einfach nichts ! \nIch hatte ja noch die leise Hoffnung ihn zum nachdenken anzuregen, eventuell sein kindisches rückständiges Verhalten kurz zu unterdrücken und das Game zuende zuspielen aber falsch gedacht.","replies":[{"poster":"Sirrkas","date":"2017-06-19T21:27:17.936+0000","up_votes":3,"down_votes":0,"body":">Wenn dir jemand 24/7 an den Backen klebt, dich trollt, sich töten lässt, farm klaut, \n\nNach dem was ich aus deiner Matchhistory lese, war das nicht der Fall. Der Rakan, der das sein müsste, hat nur 16 CS. Das ist ziemlich wenig, wenn er dir CS gestohlen hat.","replies":[]}]}]},{"poster":"XenesisCH","date":"2017-06-19T10:03:07.499+0000","up_votes":2,"down_votes":0,"body":"Tja wer sich nicht benimmt im Chat (\"Feuer mit Feuer bekämpft\") wird halt (ebenfalls) bestraft, egal wie gut er Spielt ;-).\n\nDas könnte dir vielleicht helfen, dein zukünftiges Verhalten zu ändern:\nhttp://euw.leagueoflegends.com/de/featured/summoners-code","replies":[{"poster":"TinyTigr","date":"2017-06-19T19:59:08.370+0000","up_votes":1,"down_votes":2,"body":"Das Hat nichts mit Feuer mit Feuer bekämpfen zutun.\n\nEs ist ja nicht so, als hätte ich ihn zurückbeleidigt sondern habe ihn nur drum gebeten aufzuhören bzw habe ihn dann in seine Schranken verwiesen, da der Spieler offenbar keinerlei Erziehung genossen hatte.\nLeider ist so ein Verhalten nur im Internet vorzufinden , da sie im echten Leben meistens diejenigen sind, die nichts zusagen haben.\nWenn ich mich in meinem Umfeld mal so verhalten würde, wie er es getan hat, wäre ich fixer im Krankenhaus wie du schauen kannst.\nRespekt ist leider ein Fremdwort geworden und mit Vernunft kommt man da nicht weiter.","replies":[{"poster":"XenesisCH","date":"2017-06-19T20:11:47.842+0000","up_votes":3,"down_votes":0,"body":"Wenn du ihn \"freundlich\" gebeten hättest aufzuhören ohne ihn \"geistig minderbemittelt\" zu nennen, dann wäre es kein \"Feuer\" gewesen. Wenn du jetzt immer noch behauptest, du hättest keine \"Feuer\" benutzt, dann beweis es in dem du das Chatlog (nur Printscreen zählt) offen legst. Alles andere ist leider unglaubwürdig ;-) (sorry aber es gab hier schon zu viele, welche gesagt haben sie hätten nichts falsches gemacht und ihr Chatlog hat schliesslich das pure Gegenteil gezeigt).","replies":[]}]}]},{"poster":"Martensitic","date":"2017-06-19T08:48:22.272+0000","up_votes":2,"down_votes":0,"body":"Spar uns deine langweilige Tränenstory und poste die Chatlogs.\n\nWenn du das nicht machst, wissen wir alle bescheid: Toxic, und Sperre verdient.","replies":[]},{"poster":"Kiimahrii","date":"2017-06-19T02:39:46.100+0000","up_votes":1,"down_votes":0,"body":"Chill mal ein bisschen. Lies dir deinen eigenen Post durch. Unabhängig davon wie doof die anderen gewesen sind (streite ich ja nicht ab), bist du der Meinung das **dein Verhalten** rechtens ist? Nicht im Sinne von \"du hättest was falsch gemacht\", genau deshalb weise ich dich ja darauf hin dein eigenen Post erneut durch zu lesen.\n\nHier handelt es sich, wie du eben schon beschriebst, um rotz freche, inkompetente (...) Spieler, die X Sache tun. Und das reizt sich offensichtlich sehr. Meine Frage lautet: Warum? Kennst du diese Menschen? Wirst du sie erneut treffen? Haben ihre Handlungen große Auswirkungen auf deinen Leben? Weshalb aufregen?\n\nDein Verhalten bzw viel mehr deine Reaktion auf deren Verhalten vergnüngt diese Menschen nur umso mehr. Das Beste was du machen kannst ist das Ganze abprallen lassen, nach vorn schauen und wissen, was du richtig / falsch gemacht hast um dich zu verbessern. Ansonsten: Das hier ist ein Spiel. Zum spielen da. Nicht zum aufregen!","replies":[{"poster":"TinyTigr","date":"2017-06-19T20:25:47.069+0000","up_votes":1,"down_votes":1,"body":"Danke für dein Kommentar:\n\nIch gebe dir kurz eine Rückmeldung, da ich wohl missverstanden wurde.\n\nWollte nur damit sagen, dass ich gut gespielt habe [ wie die anderen x3 ] alles soweit gut lief und nur einer so dermassen agressiv, ignorant und uneinsichtig ist, dass das Game zu einem einzigen Horror wurde.\n\nKurz dazu was ich gemacht habe:\n\n- habe ihn Weggepinkt:\n- wurde daraufhin beleidigt, bedroht ,rassistisch angemacht usw.\n- ich habe auf einer sachlichen Ebene angesprochen und versucht es zu klären.\n- wurde dann nurnoch mehr getrollt, weil er sich wohl daran erfreut hatte, dass jemand probiert mit ihm normal zu kommunizieren, was er wohl nicht gewohnt ist.\n\nkurz gefasst:\n\nHaben gut gespielt und ich habe probiert die Sache zu klären, wurde daraufhin einfach nur beleidigt, mein Game war ruiniert und ich bekomme eine Chatsperre reingedrückt und wieso?\n\ndas probiere ich ja zuverstehen. Wenn ich mir hier diese unwissenen Kommentare durchlese: Skill for Verhalten, Feuer mit feuer bekämpft könnte ich weinen, da wohl keiner die Situation versteht.\n\nIch habe nicht geflamed, beleidigt etc. nur diskutiert aus gutem Grund, ich werde GETROLLT HALLO? und nach dem vergeblichen Versuch das zuklären bekomme ich eine Chatsperre reingedrückt, WO IST BITTE DER SINN? \n\nIch habe doch nichts falsch gemacht.","replies":[{"poster":"Kiimahrii","date":"2017-06-19T22:00:42.928+0000","up_votes":1,"down_votes":0,"body":"Besonders bei dem Teil, an dem du hier äußerst, man habe dich \"rassistisch angemacht\", fällt das bisschen Glaube, das man dir hier eventuell schenken könnte, weg. Simple Äußerungen wie \"french\" oder \"baguette\" können bereits einen böswilligen Ton haben oder als solches angenommen werden.\n\nAuch wenn deine Mühe die Community in diesen Thread deiner Unschuldigkeit zu überzeugen bemerkenswert hoch sind und tatsächlich der Meinung zu sein scheinst, du habest nichts falsches gemacht, so lasse mich derjenige sein, der dich erneut klar und explizit erklärt: wir wissen alle das du ein paar Töne im Chat gespuckt hast die du nicht hättest spucken dürfen. Egal wie die anderen drauf sind, dein Ban ist mit Sicherheit berechtigt. Und wenn es bloß durch Spam und Pings-Spam, Aussagen wie \"Report X\" im allgemeinen Chat oder eben \"stfu\", irgendetwas wirst du angestellt haben.\n\nVielleicht sollte der Punkt gekommen sein an dem du dich selbst fragst, wie sehr du deine eigenen Gefühlen im Griff hast, wenn du schon in einen Online-Spiel eine Chatsperre erhalten hast. \n\nNicht desto trotz einen schönen Abend","replies":[]}]}]}]}