{"poster":"Beliard","date":"2015-05-31T03:05:15.223+0000","title":"Busco buenos jugadores para formar team /Plata","subforum":"Reclutamiento","up_votes":1,"down_votes":0,"body":"Hola como el titulo lo dice, busco buenos jugadores que quieran formar un team. Con respecto a buenos jugadores no me refiero a que realicen jugadas épicas de diamante o por el estilo, sino que me refiero a jugadores que entiendan el concepto de trabajo en equipo, de wardear (no solo es spp tiene la obligacion de colocar/quitar las visiones enemigas, todos pueden hacerlo), de proteger y ayudar a los mas d&eacute;biles en la partida. busco personas que **NO SEAN:**\n-Toxicas\n-Trolles\n-Ratas y los que suelen creerse rambo\n-Gente xenofoba, sexista, clasista, entre otros.\n-Gente desmotivadora (actitud negativa, baja la moral del equipo).\n-Gente que porque tiene un buen score cree tener la autoridad de flamear al equipo.\n-Gente que no se comunique (avisar ss/mias o prevenir algo).\n\n                            **Ya es molesto soportar la toxididad del team enemigo y mas que tener que aguantar a toxicos en el propio team.**\n\nTampoco me interesan los que no se preocupan de su linea, pero dan hasta la ultima gota de mana en buscar y perseguir esa kill hasta la fuente enemiga (por decir algo).\nBusco compañerismo, gente que tenga por habito estar viendo el mini-mapa cada 10 segundo <por ejemplo>. \nBusco gente que este pendiente de objetivos (torres, push, dragones/baron, campeo, etc...) de ayudar al equipo, que sea capas de entender un buen posicionamiento, armar una buena Team figth, de proteger al que esta \"carreando\".  \nEl duo bot que realmente tenga una buena sinergia, que se comuniquen bien. un buen adc nace cuando tiene un buen spp.\n\nGente que desde el lobby tenga un interes real por dar lo mejor de si, que no porque sea una partida tipo \"normal\" se transformen en el peso muerto del equipo, un buen jugador da lo mejor y aprende de los errores en todas las partidas.\n\nBusco quienes jueguen como equipo, quienes se tomen el juego enserio, quienes sean una influencia positiva para el equipo. Que no sean un valor negativo en contra de la moral del equipo.\n{{summoner:30}} \nuso: Skype, Ts, Raid Call, Dolby.\nSoy Plata\n\nApenas pueda agregare a todos los interesados ;)\n","replies":[{"poster":"Kixur","date":"2015-05-31T03:43:40.472+0000","up_votes":2,"down_votes":0,"body":"Me interesa la propuesta, me manejo bien en la posición de soporte. \nEl tema es que soy Oro V (es lo mismo la verdad, pero como pusiste plata) Si sirve mi id es: Kixur \n(Uso skype o Ts pero no tengo problemas en bajar otros programas)","replies":[{"poster":"Beliard","date":"2015-05-31T04:04:38.532+0000","up_votes":1,"down_votes":0,"body":"Excelente, mira ahora estoy en el trabajo. pero apenas pueda te agrego :)","replies":[]}]},{"poster":"Akaza","date":"2015-05-31T04:02:08.854+0000","up_votes":2,"down_votes":1,"body":"Hola, yo también me postulo soy plata 4.No tengo problema en jugar cualquier rol que me digan y acepto las criticas etc .uso Ts y skype no ahí problema si se necesita otro software :3 .En el game soy: Exes","replies":[{"poster":"Beliard","date":"2015-05-31T04:45:30.824+0000","up_votes":1,"down_votes":0,"body":"Excelente!\napenas pueda te agrego para jugar :D","replies":[]}]},{"poster":"Tadwe","date":"2015-12-12T18:24:45.425+0000","up_votes":1,"down_votes":0,"body":"buenas soy main jg (con kindred, rek´sai ,lee, et) soy plata IV  no falto al respeto tampoco trolleo y wardeo y me gustaría estar en tu equipo","replies":[]},{"poster":"Oldie","date":"2015-06-02T14:17:58.490+0000","up_votes":1,"down_votes":0,"body":"agrega","replies":[]},{"poster":"Benjamu","date":"2015-06-01T23:58:03.612+0000","up_votes":1,"down_votes":0,"body":"Hola,me intereso tu team,soy main mid platino 1,puedo casi todos los dias de 9 a 12 pm (fines de semana toda la noche y dia xD) Agregame :D. Tengo microfono,skype,ts,rc,curse practicamente de todo xD\n","replies":[]},{"poster":"Zed of Shadow","date":"2015-06-01T20:51:52.524+0000","up_votes":1,"down_votes":0,"body":"nick: JSmokeOner solo agregame","replies":[]},{"poster":"Bring me Thanos","date":"2015-06-01T05:43:46.505+0000","up_votes":1,"down_votes":0,"body":"Soy ADC silver 1. Uso raid calle y tengo 23 años :)","replies":[]},{"poster":"Je t Aime","date":"2015-05-31T22:19:45.709+0000","up_votes":1,"down_votes":0,"body":"me uno! add me Je te hais, conversamos y nos coordinamos saludos bro ,suerte {{champion:238}}","replies":[]},{"poster":"Hadil","date":"2015-05-31T20:47:10.299+0000","up_votes":1,"down_votes":0,"body":"Unranked, s4 plata 5...no he rankeado todas las 10 de esta temporada pq me van a dejar en bronce así que tengo que aprender a usar campeones para salir de bronce xD , soy all rounder...aunque mis amigos dicen que doy asco de adc, pero estoy intentando progresar, aun así maineo supp y top...se jugar antimeta y tambien meta...soy chilena por si no importa xD....ya sabes los chilenos \"flameamos\" pero en realidad no es flameo porque lo decimos en buena xD","replies":[]},{"poster":"Shällow","date":"2015-05-31T17:44:40.881+0000","up_votes":1,"down_votes":0,"body":"Hola, soy plata 5, se jugar todas las lineas, jamás flammeo y maineo support. Siempre he pensado que el compañerismo es el que lleva a la victoria, suelo usar soportes con bastante pokeo y engage para ganar linea rápidamente y luego llevar una ventaja de early, maineo en soporte principalmente a Karma y a Nami, si te interesa mi nombre de invocador es \"Kaineo Marma\", sería una buena experiencia entrar a un team que saben lo que hacen, tú de por sí ya veo que sabes jugar :)\nPD: Tengo comprados todos y cada uno de los supports, en serio, todos. He practicado mucho y los sé ocupar decentemente a todos n_n {{champion:43}} {{champion:267}} {{champion:37}} ","replies":[]},{"poster":"DPowa","date":"2015-05-31T17:33:28.933+0000","up_votes":1,"down_votes":0,"body":"agrega bro  TheThunderShock  Platino 3","replies":[]},{"poster":"KzG Arconte","date":"2015-05-31T09:49:02.590+0000","up_votes":1,"down_votes":0,"body":"te dare un pequeño \"formulario sobre mi\"\n\nno se si es una excusa o algo por el estilo, tomalo como quieras :3 \n\nyo juego desde la s1, tenia una cuenta en na llegue a ser diamante 2 hasta la season3, luego de eso me dieron un ban permanente por muchas cosas que sucedieron  luego decidi crearme esta misma y jugar en euwest. ( creo que deje unos 6 meses de jugar asi que fue a mitad del  2013 ) lamentablemente no avance nada por problemas de latencia que tenia, totalmente mios... luego de tantos reclamos por mucho tiempo me solucionaron el problema, incluso estoy 100% seguro de que perdi mi \"talento\" por dejar pasar tanto tiempo... este año. comenze bien, estoy intentando retomando de a poco el subir de liga y progresar.\n\nhace poco acabo de decidir a jugar \"serio\" jugar calmado, ver cada error que cometo, mantener mi posicionamiento, no titubear en las desiciones que tomo dentro del juego  , mantener un farm \"coherente\" sin dejar de lado los objetivos ( creo que es un poco dificil en soloQ en algunas partidas, siempre esta esa gente que le gusta jugar solo y push toda la partida en su linea..) y creo que de una ves ya entendi un poco como hacer para salir de cada liga... o que hacer cuando un jugador del equipo esta feed. \n\ny sobre lo que tu pides, esta todo cubierto :), no flameo ( si con gente que tengo excesiva confianza que saben que estoy bromeando.), wards, auto critica, comprender cuando un compañero de equipo va mal. cuando tengo buen score trato de pedirle a mi equipo la mayor cantidad de teamfigh posibles para ganar rapido. si no se cumple. bueno nada que hacer jeje solo hacer señales de ayuda :) \n\nnombre: X\nedad: 16 años.\nlineas: no dare detalles creo que me he alargado muchisimo con mis comentarios. ( solo dire que siempre trato de ir adc, mid o jungla ) \nuso: ts  y rc. ( skype no utilizo ya que ningún conocido usa eso ) eso si, por alguna razón soy un poco tímido cuando hablo por micro. \nliga: P4 ( y subiendo, como dije ultimamente se me esta haciendo facil ) \n\nte di la mayor información posible solo para que leas :), bueno saludos  y suerte\n\n{{champion:64}}  {{champion:104}}","replies":[]},{"poster":"kaxorrosk8","date":"2015-05-31T06:49:53.544+0000","up_votes":1,"down_votes":0,"body":"hola, me encantaria formar parte de tu equipo, soy plata 3 y voy entre subiendo y bajando de liga, no soy flamer para nada, de echo intento que se calmen las aguas siesqe ocurren hechos asi,o tambien tengo actitud de capitan en las partidas soloQ, tengo disponibilidad 24hrs , y soy super activo, y juego preferencia mid/adc/supp....en la linea que doy mas \"asquito\" es jungla\n\nID = kaxorrosk8(Silver 3)\nuso skype/TS/raidcall","replies":[]},{"poster":"Jeje ese soi io","date":"2015-05-31T06:33:43.016+0000","up_votes":1,"down_votes":0,"body":"Buenas, Me gustaría estar en el Team soy Oro te dejo mi informe.\n\n**Soy Oro III actualmente, Maineo la linea de TOP he estado en team con Diamantes y jugando de top, Juego todos los \"Campeones Al Meta de Top\", He tenido experiencia en Mini Torneos.**\n\n{{champion:68}}","replies":[]},{"poster":"Moondritch","date":"2015-05-31T05:47:34.902+0000","up_votes":1,"down_votes":0,"body":"no se si aun estas buscando jugadores pero si es asi me gustaria participar soy plata 2 maineo suport y como 2 opcion seria jg pero creo que supp es lo que mejor manejo mi id seria:\nbloors.\n eso saludos y que estes bien","replies":[]},{"poster":"NGreppi","date":"2015-05-31T05:38:58.232+0000","up_votes":1,"down_votes":0,"body":"Me gustaria participar, soy plata 4, no \"maineo\" nada pero me va mejor mid, adc y support. Tengo skype y curse pero puedo descargar cualquier programa sin problema.","replies":[]},{"poster":"Saske","date":"2015-05-31T03:46:31.087+0000","up_votes":1,"down_votes":0,"body":"Me interesa Agregame soy plata 5 acabo de subir tengo Skype \nY maineo todas las lineas pero mas ADC Y TOP","replies":[{"poster":"Beliard","date":"2015-05-31T03:58:52.213+0000","up_votes":1,"down_votes":0,"body":"Excelente, mira ahora estoy en el trabajo. pero apenas pueda te agrego :)","replies":[{"poster":"Saske","date":"2015-05-31T04:01:34.844+0000","up_votes":1,"down_votes":0,"body":"Dale ya te agrege en el LOL :D \nesta noche te conectas ?","replies":[{"poster":"Beliard","date":"2015-05-31T04:09:59.650+0000","up_votes":1,"down_votes":0,"body":"Excelente, mira ahora estoy en el trabajo. pero apenaste aviso para jugar !","replies":[]}]}]}]},{"poster":"Tiña","date":"2015-05-31T03:59:58.393+0000","up_votes":1,"down_votes":0,"body":"hola, me encantaría participar pero... soy platino ( y como pusiste plata ) no sé si podría entrar, pero de todas formas dejaré mi nick acá:\n\nTiña (platino IV)\n\nmain mid/adc :D","replies":[{"poster":"Beliard","date":"2015-05-31T04:05:42.443+0000","up_votes":1,"down_votes":0,"body":"no veo el problema a menos que en algun momento intentemos ir como team ranked.\nDe todas formasahora estoy en el trabajo. pero apenas pueda te agrego :)","replies":[]}]},{"poster":"KillerParaVoce","date":"2015-05-31T04:04:11.482+0000","up_votes":1,"down_votes":0,"body":"Yo soy main jungla sobre todo vi y elise que ultimamente me esta gustando mucho retomarla soy plata 5 :D","replies":[]},{"poster":"Dos","date":"2015-05-31T03:46:02.736+0000","up_votes":1,"down_votes":0,"body":"Me interesa tambien ya te agregue ingame, por lo general soy de no rendirme nunca y darlo todo , manejo bien la posicion de adc ,top y mid, HeidoZanzo en skype ,y Sanzo en el juego","replies":[{"poster":"Beliard","date":"2015-05-31T03:59:36.459+0000","up_votes":1,"down_votes":0,"body":"Excelente, mira ahora estoy en el trabajo. pero apenas pueda te agrego :)","replies":[]}]},{"poster":"johnny322","date":"2015-05-31T05:06:51.543+0000","up_votes":0,"down_votes":0,"body":"Hola, me gustaría postularme pero soy Bronce I, me gusta la idea de tener un equipo y crecer junto a ellos :3. Lo que mas juego es el rol de Top, juego lo que esté en el meta, y no tendría problema en practicar algún campeón en especifico. Podría usar cualquier programa, 0 dramas. Saludos\n\nID:johnny322","replies":[]}]}