{"poster":" Bad Moon Rising","date":"2017-02-11T05:12:26.667+0000","title":"Les quiero pedir su ayuda para un pequeño proyecto","subforum":"Creaciones de la comunidad","up_votes":3,"down_votes":0,"body":"Les comento estoy haciendo bocetos y comics de peleas entre campeones, estoy haciendo uno con la tem&aacute;tica Piltover vs Zaun lo que les quiero preguntar si me ayudaria la comunidad a darme ideas y decirme quien ganaria un combate contra x champ y porque actualmente estoy trantando de hacer uno de Warwick vs Jayce quien &iquest;ganaria y porque?","replies":[{"poster":"MCJC23","date":"2017-02-12T04:16:22.493+0000","up_votes":2,"down_votes":0,"body":"Las posibilidades cientos,pero los finales principales son 2(sin contar que aparezca alguien mas,y en un terreno parejo):\n\n1-En un punto de la pelea,{{champion:126}} noquea a {{champion:19}} con su arma,luego mientras esta aturdido,con su martillo,rompe los inyectores,matando así a la bestia química.\n\n2-En un punto de la pelea,{{champion:19}} le da un arañaso a {{champion:126}} que lo hace soltar su arma,segado por el olor de la sangre,acaba con la vida del inventor.\n\nPero,preferiría trabajar con mas información como... ¿como se encontraron los dos?.O mas importante,¿porque luchan Piltover y Zaun?.Si me permiten,daré mi caso hipoteco,\nen el que un suceso \"X\",desata una guerra civil.\n\nTambién diré que campeones creo que lucharían,y contra quien:\n\n{{champion:36}}:Aunque sea un villano,no busca pelea,solo quiere \"ayudar\"(note ce las comillas), por lo cual buscaría enfermos para \"sanarlos\".\n\n{{champion:19}}:Aunque se arme un infierno sobre su cabeza,su objetivo es limpiar Zaun,no le importa mucho Piltover. La única razón por la que subiría,es por no poder resistirse al olor de la sangre recién derramada.\n\n{{champion:61}}:Ella no es ningún soldado,no busca pelea.Se mantendría alejada del conflicto. Pero seguro tratara de ayudar a los desvalidos.\n\n{{champion:53}}:Como su amiga de arriba,se alejaría de tanto caos y ayudaría al mas necesitado.\n\n{{champion:40}}:Lo mismo que los robots,pero con viento y magia.\n\n{{champion:29}}:Dime,para que dejaría su reino por una guerra que ni es suya.\n\n{{champion:74}}:Veo imposible que entre en combate,es científico,es inventor,pero no guerrero.\nA lo mucho haría robots de batalla,cosa que también dudo.\n\n{{champion:27}}:No se involucraría directamente,aprovecharía la batalla para probar sus creaciones,y experimentar con los heridos y muertos.\nAunque los policías de Piltover le darían caza por actos tan horribles.\n\n{{champion:115}}:Esto,en una guerra?.¡Piedad!.\n\n{{champion:164}}:Ella intentaría darle caza a las mayores amenazas y los peces gordos de Zaun.\n\n{{champion:154}}:El ayudaría a la gente desamparada,sin importar su origen.Pero,al ser una guerra habría muchas emociones negativas,siendo que el \"arma secreta\" absorbe emociones,estas lo llevarían a pelear en mas de una ocasión.\n\n{{champion:81}}:No creo que se una a la guerra,pero creo que sus habilidades de explorador podrían ser muy útiles.Buscar artefactos o personas entre escombros, hasta a ayudar a la policía de Piltover con sus investigaciones.\n\n{{champion:126}}:Defendería su ciudad con todas sus fuerzas.\n{{champion:112}}:Usaría sus conocimientos para ayudar a los afectados por la guerra.\nEn caso de encontrarse,pueden pasar dos cosas\n\n1-De nuevo la diferencia de opiniones se ponga sobre la mesa y en piensen a luchar\n\n2-Que {{champion:126}} vea lo que hace su antiguo colega,y entiende que lo había mal interpretado.Por otro lado,{{champion:112}} acepta que tampoco reacciono como era debido.\nTerminando con tratar de arreglar esta locura trabajando juntos,como en antaño.{{item:3070}} \n\n(Aquí se pone interesante)\n\n{{champion:222}}:Si hay una guerra civil,quizás este detrás de todo,siendo que ella odia la Piltover por como ven y tachan a zaun.La verdad,es mas lista de lo que parece,y no me sorprendería que hiciera eso para alzar a Zaun,y ver rogar a los Piltis.{{champion:51}} trataría de poner fin a esta locura,se daría cuenta rápido de que tiene que ver la \"bala perdida\" en todo esto.{{champion:254}} furiosa,le daría caza junto a la sheriff. Abriéndose paso con una fuerza que haría temblar los cimientos de Zaun.Pero habría un problema.{{champion:245}} por mil razones ama Zaun,y por cien mil razones odia Piltover: seguro haría una alianza con la niña loca para que Zaun tenga lo que se merece.Las representantes de la ley tendrían en frente un joven con reflejos inhumanos que se anticipa a sus acciones.","replies":[]},{"poster":"Dyslexic Wolf","date":"2017-02-11T05:30:52.590+0000","up_votes":1,"down_votes":0,"body":"Viktor vs Jayce  = Viktor wins porque intenta hacer el bien para su gente. Además de que esta re duro con su rayo láser","replies":[{"poster":" Bad Moon Rising","date":"2017-02-11T06:08:45.038+0000","up_votes":1,"down_votes":0,"body":"Pensaba que seria mejor un heimer vs viktor porque ambos son cientificos lo puse a jayce contra ww porque jayce se cree como perfecto con su idea de justicia y orden  y ww detesta eso ya que es la bestia de zaun.","replies":[{"poster":"Dyslexic Wolf","date":"2017-02-11T06:30:01.603+0000","up_votes":1,"down_votes":0,"body":"a WW lo veria mas contra SInged (aunque los dos son de Zaun). Igual podrias hacer WW vs Vi y caitlyn. Digo esto porque mientras ellas hacen justicia por medio de la ley WW la hace por fuera (matando a todos los criminales sin darles ni un segundo para ser juzgados por esta: la ley)","replies":[]}]}]}]}