{"poster":"Build the waII","date":"2017-12-10T05:39:00.341+0000","title":"Why is inting and intentionally losing not bannable and only words are.","subforum":"Player Behaviour","up_votes":8,"down_votes":1,"body":"Complete and utter lack of priorities. You can mute someone saying shit but you can&#039;t stop the person running down mid over and over. Guess who can get banned?\r\n\r\nIt&#039;s actually impossible to get banned for inting or intentionally losing. Seen people do it 20 in a row and no problem, but say 1 bad word in 1 game and you can be banned for 2 weeks. \r\n\r\nI mean damn did all the %%%%s at riot get bullied as kids or something.\r\n\r\nNot banned just curious how fucked up in the head you can be for that to be your priority.","replies":[{"poster":"Best Evelynn OCE","date":"2017-12-10T08:18:37.811+0000","up_votes":4,"down_votes":0,"body":"Don't forget that it's only if *you* are the toxic one.\n\nEveryone else who is toxic won't get banned, even if you report them.","replies":[{"poster":"Essembie","date":"2018-01-04T23:56:14.240+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Best Evelynn OCE,realm=OCE,application-id=T8eq2lFQ,discussion-id=AHVFgEfu,comment-id=0000,timestamp=2017-12-10T08:18:37.811+0000)\n>\n> Don&#x27;t forget that it&#x27;s only if *you* are the toxic one.\n> \n> Everyone else who is toxic won&#x27;t get banned, even if you report them.\n\nI heard a quote the other day about workplaces:\n\n\"every work place has 1 or 2 jerks. But if _everyone_ at your work is a jerk, maybe YOU are the jerk.\"","replies":[]}]},{"poster":"Talboturbo","date":"2017-12-10T18:29:36.980+0000","up_votes":1,"down_votes":2,"body":"I don't believe that you can get banned for saying one bad thing in ONLY one game. If that were the case there would be more banned accounts than playing ones.\n\nIn other words, you would have to be insulting others or saying bad things a lot, over many games. Those people running mid (maybe) only did it one game, therefore they don't get punished, or maybe not as severely. \n\nBe the change you want to see. Fight the toxicity, not your team mates. Fight the urge to fight on their playing field. Report them, continue on.  The only people you should be fighting in a League of Legends game, is your enemy. \n\nEventually, with this method, you will have helped to remove many others that do not care for other's experience. Either by ban, or by reform. \n\n\nKeep doing your best, you'll get there.","replies":[{"poster":"Essembie","date":"2017-12-10T22:06:33.625+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Talboturbo,realm=OCE,application-id=T8eq2lFQ,discussion-id=AHVFgEfu,comment-id=0001,timestamp=2017-12-10T18:29:36.980+0000)\n>\n> I don&#x27;t believe that you can get banned for saying one bad thing in ONLY one game. \n\nThen you hold an incorrect belief. I used to think like you until i said \"neck yourself \" and went straight to 14 day suspension with no escalation through tiers.\n\nThe system is broken right now. You only have to look at the boards to know that the system is fucked.","replies":[{"poster":"Talboturbo","date":"2017-12-12T03:10:46.490+0000","up_votes":2,"down_votes":0,"body":"My mistake then. The system can be very janky at times, although if I read some of the other board messages I'd have known by now. \n\nUnfortunate as it is, the chat system seems to be catered to the special snowflakes who get triggered at you breathing. The only thing you can do is avoid the system. \n\nThat's going to be tough for some. I can only say good luck to them. \n\nA helpful quote for some to remember: If you don't have anything good to say, don't say anything at all.","replies":[{"poster":"Essembie","date":"2017-12-12T04:06:49.954+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Talboturbo,realm=OCE,application-id=T8eq2lFQ,discussion-id=AHVFgEfu,comment-id=000100000000,timestamp=2017-12-12T03:10:46.490+0000)\n>\n> My mistake then. The system can be very janky at times, although if I read some of the other board messages I&#x27;d have known by now. \n> \n> Unfortunate as it is, the chat system seems to be catered to the special snowflakes who get triggered at you breathing. The only thing you can do is avoid the system. \n> \n> That&#x27;s going to be tough for some. I can only say good luck to them. \n> \n> A helpful quote for some to remember: If you don&#x27;t have anything good to say, don&#x27;t say anything at all.\n\nI think they are far more reliant on bots these days.","replies":[{"poster":"Talboturbo","date":"2017-12-12T09:47:18.365+0000","up_votes":1,"down_votes":0,"body":"Problem with bots, ia that they need a learning period, in which the first phase of testing is always going to be a nightmare. Observe the YouTube ad-friendly content bot. \n\nBots are the easy way to fix a widespread problem, but if done incorrectly, will cause more problems than solving them by a term I'll call \"blanketing\".  To effectively use bots, they need a small, focussed team helping with the bot to... Teach it what is right and wrong. What to remove and what not to.\n\n  I myself haven't had problems with the system, but if so many people are getting hit by the ban hammer... Well let's just say some of them need it, but a lot of others don't. \n\nWe just need to wait and see how this plays out. That's the only thing we can do at this point. Hide from the automatic system. Hope you don't get covered by the \"blanket\" and Mr Sandman Bot putting your account to \"sleep\".","replies":[]}]}]}]},{"poster":"Niji","date":"2017-12-12T15:26:41.621+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Talboturbo,realm=OCE,application-id=T8eq2lFQ,discussion-id=AHVFgEfu,comment-id=0001,timestamp=2017-12-10T18:29:36.980+0000)\n\n> Be the change you want to see. Fight the toxicity, not your team mates. Fight the urge to fight on their playing field. Report them, continue on.  The only people you should be fighting in a League of Legends game, is your enemy. \n> \n> Eventually, with this method, you will have helped to remove many others that do not care for other&#x27;s experience. Either by ban, or by reform. \n> \n> \n> Keep doing your best, you&#x27;ll get there.\n\nCringe\n\n> [{quoted}](name=JasonWazza,realm=OCE,application-id=T8eq2lFQ,discussion-id=AHVFgEfu,comment-id=00030000,timestamp=2017-12-11T10:30:53.835+0000)\n>\n> Because calling someone a jew is ok, and not offensive at all.\n\nLmao\n\n> [{quoted}](name=Essembie,realm=OCE,application-id=T8eq2lFQ,discussion-id=AHVFgEfu,comment-id=0004000000000000,timestamp=2017-12-12T01:07:38.581+0000)\n>\n> I got done for racist term when clarifying whether opponent mistyped or was being racist (clarification required because I didn&#x27;t want to report for racism if genuine mistake). Riot agreed i wasn&#x27;t being racist but suspension not lifted. Full disclosure i also said neck yourself in that game but when queried the reason given for suspension was racism.\n> \n> They just dont give a fuck right now.\n\nThey ban for racist terms no matter the context, stupid but its how it is\n\n> [{quoted}](name=Seras Dragon,realm=OCE,application-id=T8eq2lFQ,discussion-id=AHVFgEfu,comment-id=000400000001,timestamp=2017-12-12T06:29:20.687+0000)\n>\n> &quot;Poopy pants&quot; and &quot;neck yourself&quot; are pretty much on different ends of the toxic rainbow.\n\nRainbow isn't toxic >:(\n\nAnyways it easy to intentionally feed without actually getting banned. The only way inters can get banned is if they literally buy mobis+5 zeal and run it down mid. Or just keep walking into enemy team and standing still. You can quite easily int without ban so long as you don't admit it. You legit just pick some trash champion, build trash items and then take every fight you can. So long as you actually fight the enemy or take cs/towers Riot won't ban for it because it has to be beyond a shadow of a doubt that its actual inting and not just someone who is bad.\n\nYeah personally I don't care about toxicity, I don't care about what someone says on the interwebs about me cuz if you let that hurt your feefees then you are mentally weak. However neither I, nor anyone else can do jack diddly squat against an inter unless they are stupid enough to make it obvious.","replies":[]}]},{"poster":"QAPLA","date":"2017-12-11T08:53:42.636+0000","up_votes":1,"down_votes":0,"body":"IDK, I had a guy spewing constant \"jew this, %%%%% that\" at me (on my own team), and when I said I'd report him, he laughed \"I've said this shit for years and never been banned\". I reported him but got no feedback.\n\nIn my opinion, negative in-game behaviour is far worse than anything in chat, I just mute the idiots.\nI have clowns that join a game, then as soon as it starts, they say \"I g2g\", run down mid and be first blood, then quit.\nThese people can still play the next day, but someone typing 3 letters (kys) gets a ban.\n\nReality check Rito, YOUR SYSTEM IS WHACK!","replies":[{"poster":"JasonWazza","date":"2017-12-11T10:30:53.835+0000","up_votes":1,"down_votes":0,"body":"Because calling someone a jew is ok, and not offensive at all.","replies":[{"poster":"slvemsterbruske","date":"2017-12-12T01:30:40.935+0000","up_votes":2,"down_votes":0,"body":"That's a lie, the worst insult any man can think of is calling someone a Jew.","replies":[]}]}]},{"poster":"Stacked","date":"2017-12-11T19:32:14.227+0000","up_votes":1,"down_votes":0,"body":"I got a perma for saying the n word in a premade. no chat restrictions, only one previous ban a year ago. I don't int, and this was during ArURF so we were messing around abit, when i made a ticket they told me to /msg my premade. and then i asked them how? they said you cant. Been playing for 3 seasons. keep in mind this was four months ago.","replies":[{"poster":"Essembie","date":"2017-12-11T20:29:56.282+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Stacked,realm=OCE,application-id=T8eq2lFQ,discussion-id=AHVFgEfu,comment-id=0004,timestamp=2017-12-11T19:32:14.227+0000)\n>\n> I got a perma for saying the n word in a premade. no chat restrictions, only one previous ban a year ago. I don't int, and this was during ArURF so we were messing around abit, when i made a ticket they told me to /msg my premade. and then i asked them how? they said you cant. Been playing for 3 seasons. keep in mind this was four months ago.\n\ndoesnt matter. years of positive play and financial support to Riot mean nothing if you call someone on the other team a poo poo head.\n\nFeed and troll? Riot dgaf.\n\nSay \"poopy pants\"? BAAAAAAN","replies":[{"poster":"Stacked","date":"2017-12-12T00:48:56.897+0000","up_votes":2,"down_votes":0,"body":"yeah, its fucked up. i have been playing for 3-4 years, spent like 5k on the game. have a skin for every champion and i say one thing in a premade and get permed","replies":[{"poster":"Essembie","date":"2017-12-12T01:07:38.581+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Stacked,realm=OCE,application-id=T8eq2lFQ,discussion-id=AHVFgEfu,comment-id=000400000000,timestamp=2017-12-12T00:48:56.897+0000)\n>\n> yeah, its fucked up. i have been playing for 3-4 years, spent like 5k on the game. have a skin for every champion and i say one thing in a premade and get permed\n\nI got done for racist term when clarifying whether opponent mistyped or was being racist (clarification required because I didn't want to report for racism if genuine mistake). Riot agreed i wasn't being racist but suspension not lifted. Full disclosure i also said neck yourself in that game but when queried the reason given for suspension was racism.\n\nThey just dont give a fuck right now.","replies":[]}]},{"poster":"Ninox","date":"2017-12-12T06:29:20.687+0000","up_votes":1,"down_votes":0,"body":"\"Poopy pants\" and \"neck yourself\" are pretty much on different ends of the toxic rainbow.","replies":[{"poster":"JasonWazza","date":"2017-12-12T08:03:55.429+0000","up_votes":1,"down_votes":0,"body":"I mean, that may not be an equal equation, but that said, all of it is words on the screen, if it really affects you, then you should turn the chat off more then likely.","replies":[{"poster":"Ninox","date":"2017-12-13T02:13:07.984+0000","up_votes":1,"down_votes":0,"body":"Not really the point. I agree that you shouldn't be on the internet if words are going to cause you to do something drastic, because it isn't by any means a safe space, even when it is regulated in some form. BUT and that's a very big BUT, being relatively anonymous should not give you the right to abuse, degrade or imply that the life of another human is worthless just because you feel like it or because they didn't conform to your views etc etc.","replies":[]}]},{"poster":"Essembie","date":"2017-12-12T06:57:00.630+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Seras Dragon,realm=OCE,application-id=T8eq2lFQ,discussion-id=AHVFgEfu,comment-id=000400000001,timestamp=2017-12-12T06:29:20.687+0000)\n>\n> &quot;Poopy pants&quot; and &quot;neck yourself&quot; are pretty much on different ends of the toxic rainbow.\n\nIt was a non-literal illustration of a point.\n\nPoopy pants.","replies":[]}]}]}]},{"poster":"Essembie","date":"2017-12-30T21:57:25.721+0000","up_votes":1,"down_votes":0,"body":"the focus is on bads words, not game wrecking bots and actual trolls.\n\nunbind enter and mute all. Safest way to play league right now.","replies":[]},{"poster":"Tactictoe","date":"2017-12-30T02:55:34.311+0000","up_votes":1,"down_votes":0,"body":"Because snowflakes","replies":[]},{"poster":" ß  í  o  ç  ","date":"2017-12-19T02:52:38.618+0000","up_votes":1,"down_votes":0,"body":"totallly disagree with u.\n\nthere are different types of players. [you] and [other people].\n\n[you] will get banned if u say ONE sensetive word in ONE game, or int with ONE death.\n\nwhile [other people] keep insulting black people and asians and can feed ur lane opponent up to two thousand times but still no problem. :)\n\nu choose to play riot games, u deal with it.","replies":[]},{"poster":"Cabbages","date":"2017-12-11T02:50:31.938+0000","up_votes":1,"down_votes":0,"body":"Agreed","replies":[]}]}