{"poster":"Haise","date":"2016-08-03T07:50:52.989+0000","title":"GG Server.","subforum":"Charlas Generales","up_votes":13,"down_votes":7,"body":"No suelo hacer este tipo de hilos, pero que basura esto de perder una ranked (en promo encima) por el server que anda menos diez. Es una partida y no es el fin del mundo porque se puede llegar otra vez... pero viejo, &iexcl;cuando hagan las cosas, h&aacute;ganlas bien! Se nota que es un server de tercer mundo.\r\n\r\nBuenas noches. Saludos.","replies":[{"poster":"ThePunkRocker","date":"2016-08-03T07:53:23.203+0000","up_votes":4,"down_votes":2,"body":"eso por meterse a rankear de una sin saber como anda el server desp de una actualizacion xd ajo y agua ameo","replies":[{"poster":"RafaNico","date":"2016-08-03T07:57:46.632+0000","up_votes":3,"down_votes":2,"body":"Te parece ajo y agua? se supone que si estan las rankeds es porque tendria que andaer bien, el server es una cagada","replies":[{"poster":"ThePunkRocker","date":"2016-08-03T08:13:56.545+0000","up_votes":5,"down_votes":2,"body":"si realmente te interesaria subir, siempre que juegues rankeds asi sea desp de un mantenimiento o cuando fuese testearias en una con bots primero... nadie te manda a entrar a ranked desesperado nomas se pone on el server sabiendo q pueden haber estos problemas x el cambio de plataforma","replies":[{"poster":"Haise","date":"2016-08-03T08:18:17.224+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=ThePunkRocker,realm=LAS,application-id=v7qsfXsE,discussion-id=6pTZEU1r,comment-id=000200000000,timestamp=2016-08-03T08:13:56.545+0000)\n>\n> si realmente te interesaria subir, siempre que juegues rankeds asi sea desp de un mantenimiento o cuando fuese testearias en una con bots primero... nadie te manda a entrar a ranked desesperado nomas se pone on el server sabiendo q pueden haber estos problemas x el cambio de plataforma\n\n¿\"Desesperado\"? D:\n\nTermino de estudiar largas horas y se me antoja jugar al LOL. Sé que hay mantenimiento y voy con la idea de que no iba a jugar. Pero, oh.. ¡el estado del server era \"En línea\"! ¿Qué significa eso? Que podía logearme, que podía ponerme en cola de ranked y que incluso podía jugar esa partida con gente afk. Todos estos problemas, ¿son culpa mía? xD\n\nNo jodamos. ¿Hay que estar probando cómo anda el server antes de jugar una ranked? ¡Qué confianza hay que tenerle a LAS eh!","replies":[{"poster":"Conejito Feliz","date":"2016-08-03T14:00:06.564+0000","up_votes":2,"down_votes":0,"body":"Es las, siempre hay drama después del mantenimiento. Sos un desesperado simple. Podías jugar normal si tanto te puede el lol.","replies":[]}]},{"poster":"RafaNico","date":"2016-08-03T08:16:19.962+0000","up_votes":1,"down_votes":4,"body":"Chupasela un rato mas a riot, asi capaz que te dan una cajita","replies":[{"poster":"ThePunkRocker","date":"2016-08-03T08:36:08.554+0000","up_votes":1,"down_votes":0,"body":"jajaja si se dan cuenta lo peor de todo es q los que se quejan y los que se mandaron a ranked sin probar primero el server son todos platitas xd dejense de joder lloran x una partida como si fuera el fin del mundo cuando este bien el server van a poder subir si bajaron y si no pueden subir por algo sera... cya nv :*","replies":[]}]}]}]},{"poster":"Arachnes","date":"2016-08-03T09:15:30.626+0000","up_votes":1,"down_votes":0,"body":"vale, segun tu logica, es culpa nuestra marcar ranks y perder por no saber cuando va a andar bien el server o no?. vale, entonces antes de tomar un vuelo, voy a ver antes si los aviones se caen o no, porque supongo que si se cae el avion cuando nosotros estamos adentros es culpa de nosotros por no revisar antes y no un accidente. asi no funcionan las empresas bro.","replies":[{"poster":"HornedBull ","date":"2016-08-03T15:36:24.224+0000","up_votes":1,"down_votes":0,"body":"exactamente , vos a una empresa para viajar le estas pagando por su servicio c: , el juego es free to play si queres que anden bien los srv pedi que sea pay to play , y es mas ni ahi andaria bien por que en un momento se puede caer pueden tocar algo por intentar mejorarlo y pueden cagar , ya se que les molesta perder una ranked pero es asi el lol y por mas que vengas a llorar o vengan a decir que anda mal no le van a devolver los puntos.","replies":[{"poster":"Arachnes","date":"2016-08-03T23:25:52.258+0000","up_votes":1,"down_votes":0,"body":"free to play dices?? jajaja estos tipos estan ganando mas que si hubiera sido pagado, y eso es una estrategia de empresa. y lo que tu dices esta bien, aunque absolutamente sea de pago se puede caer y funcionar mal y por ende, parar el servicio que nos brinda a nosotros como usuarios, eso pasa en todos lados. que tenemos que hacer nosotros? entrar al foro y notificar que el server no anda bien, no estamos llorando ni pidiendo que nos devuelvan los puntos, es solo eso. pero de ahi que vengan comentarios irrelevantes como el tuyo o el del inicio no aportan nada, pero bueno, gente sobervia que cree que se las sabe todas hay en todas partes XD","replies":[]}]}]},{"poster":"4GClaroARG","date":"2016-08-03T08:11:00.087+0000","up_votes":1,"down_votes":0,"body":"Para algo fue el mantenimiento o no? sino al menos da evitada","replies":[]}]},{"poster":"Ufaaaaaaaaaa","date":"2016-08-03T07:53:10.309+0000","up_votes":2,"down_votes":0,"body":"no se a quien se le ocurre meterse a rankear después de un mantenimiento....te recomiendeo no entrar 2 horas antes de que las cierren por mantenimiento ni 2 horas después que vuelve el server. Quedate por el foro, si nadie hace posts puteando, podés entrar, sino...","replies":[{"poster":"Haise","date":"2016-08-03T07:56:44.445+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ufaaaaaaaaaa,realm=LAS,application-id=v7qsfXsE,discussion-id=6pTZEU1r,comment-id=0001,timestamp=2016-08-03T07:53:10.309+0000)\n>\n> no se a quien se le ocurre meterse a rankear después de un mantenimiento....te recomiendeo no entrar 2 horas antes de que las cierren por mantenimiento ni 2 horas después que vuelve el server. Quedate por el foro, si nadie hace posts puteando, podés entrar, sino...\n\nLo voy a tomar en cuenta. De la experiencia se aprende.\n\nA mí se me ocurrió entrar porque veo que el estado del server es \"En línea\", lo que implica que el servicio debería estar funcionando correctamente. De lo contrario, el mantenimiento debería seguir su rumbo sin permitir a la gente entrar. \n\nSaludos.","replies":[]}]},{"poster":"BiXe","date":"2016-08-03T07:53:07.519+0000","up_votes":2,"down_votes":1,"body":"Somos 2 pusieron cola dinamica, pero no se fijaron si andaba el server\nLAN, BR, NA, etc andan todos ...","replies":[]},{"poster":"IITheKingII","date":"2016-08-03T22:58:05.764+0000","up_votes":1,"down_votes":0,"body":"Que raro ver un post de este tipo despues de mantenimiento :u","replies":[]},{"poster":"KelquethasWoW","date":"2016-08-03T14:41:21.560+0000","up_votes":1,"down_votes":0,"body":"Ademas de todo lo que te dicen papu, estas en un free to play callate y juga antes de que Riot se canse  y pongan que sea un juego de pago.","replies":[]},{"poster":"Verandis","date":"2016-08-03T13:02:56.716+0000","up_votes":1,"down_votes":0,"body":"no le echen la culpa al sv :s yo ando con 50-60 ms siempre y es jugable man, avece cuando mi internet se pone las pilas andoa  45 permanentes, es rarisimo tener lag","replies":[]},{"poster":"Jinn Chi","date":"2016-08-03T09:27:03.442+0000","up_votes":1,"down_votes":0,"body":"Loco, deshabilitan el server por 3 horas por mantenimiento, perfecto. \n\nPero lo reactivan y siguen dandole mantenimiento y nos hacen joder todas las partidas? media pila loco, estamos cansados que el server ande siempre para el orto.","replies":[]},{"poster":"UnGansoVenoso","date":"2016-08-03T08:15:14.547+0000","up_votes":1,"down_votes":0,"body":"entre los team nos pusimos de acuerdo en alargar la partida... efectivamente entremos justo en la derrota evitada... report rito actualizaciones locas","replies":[]},{"poster":"Arachnes","date":"2016-08-03T08:07:24.107+0000","up_votes":1,"down_votes":0,"body":"mis ultimas tres ranked que he marcado las he perdido sin siquiera jugar, gracias a rito. las dos primera fueron bugsplat gracias al buen parche 6.15 y me bajaron de liga, y ahora esto...","replies":[]},{"poster":"Arachnes","date":"2016-08-03T08:01:11.180+0000","up_votes":1,"down_votes":0,"body":"siempre lo mismo, despues de parchear se llena de bug y errores el juego. arreglan 2 cosas y salen 5 errores mas","replies":[]},{"poster":"Luca CaRp14","date":"2016-08-03T07:54:24.526+0000","up_votes":1,"down_votes":0,"body":"Estoy de acuerdo, entre despues de la actualizacion y desde que empezo la partida los 10 estamos con 500 ms minimo, desconexiones, etc... Mucho proyecyo, mucho hextech pero el sv...","replies":[]},{"poster":"Gabe it","date":"2016-08-03T07:53:32.959+0000","up_votes":1,"down_votes":0,"body":"Lo lei tarde, me meti a una ranked con un amigo y no conecta, wp rito, wp.","replies":[]},{"poster":"YeezY One","date":"2016-08-03T07:57:41.988+0000","up_votes":1,"down_votes":2,"body":"yo perdi 2 rankeds por culpa de esto , GG RITO . de hecho me bajaron de división","replies":[]}]}