{"poster":"TheLaw95","date":"2017-01-02T06:37:29.272+0000","title":"Me amenazan 4 premades","subforum":"Comportamiento del jugador","embed":{"description":"http://subefotos.com/ver/?bdc37bd653baf0022b1daa094ef334b7o.png http://thumbs.subefotos.com/bdc37bd653baf0022b1daa094ef334b7o.jpg ...","url":"http://subefotos.com/ver/?bdc37bd653baf0022b1daa094ef334b7o.png","image":null},"up_votes":19,"down_votes":4,"body":"Hola, no se si este es el lugar correcto para el post, o si ayuda y soporte sea el mas indicado, pero la situaci&oacute;n es la siguiente:\r\n\r\nEntr&eacute; a selecci&oacute;n de campeones en una partida normal oculta. Veo el chat, algunos hab&iacute;an elegido linea y not&eacute; que nadie pidi&oacute; jg, por lo cual lo pido yo. Me pongo a elegir con que campe&oacute;n ir, elijo a nidalee, que la compr&eacute; hace poco y la estoy practicando. Para ese entonces todav&iacute;a nadie hab&iacute;a pedido jg mas que yo, por lo cual imagin&eacute; que no hab&iacute;a problema si lockeaba, ya que hab&iacute;a puesto mis runas y maestr&iacute;as. Acto seguido de que lockeo los 4 jugadores restantes comienzan a flamearme, diciendo que ya &quot;alguien ya hab&iacute;a ganado jg&quot; (a pesar que no estaba ni en el chat ni en los campeones que mostraban). Les explique pero no quisieron escucharme y continuaron con el flameo. Note que no hab&iacute;a mid laner, por lo que dije que no hab&iacute;a problema, pod&iacute;a acomodarme e ir mid (es una normal al fin y al cabo). Supuse que tal vez el launcher se hab&iacute;a bugeado y no me aparec&iacute;a todo el chat.\r\n\r\nUna vez cargada la partida me dirijo a mi linea y veo que mis compa&ntilde;eros no salen de base. En el chat uno escribe: &quot;cagaste nida&quot;. Salieron los 4 en fila, y se tiran bajo la torre enemiga en mid, para regalarle kills al mid laner enemigo (todo esto acompa&ntilde;ado de conversaci&oacute;n con el equipo enemigo, cosas como: &quot;Report nida&quot; &quot;Quien quiere cuadra?&quot; etc)\r\n\r\nEn un principio simplemente me lo tom&eacute; como algo gracioso, yo no tenia intenci&oacute;n de trollear o molestar a nadie, as&iacute; que sus reacciones me dieron gracia. Solo me limit&eacute; a explicar en /all chat lo que pasaba, le ped&iacute; al team enemigo que no hicieran caso y no me reportaran, que yo no ven&iacute;a con malas intenciones y hab&iacute;a sido todo un malentendido.\r\n\r\nAun as&iacute; mi equipo parec&iacute;a no estar interesado en otra cosa mas que regalar cuadras constantes. Luego se quedaron en base tirando wards y cosas por el estilo.\r\n\r\nTengo los nombres de cada uno de los jugadores y una captura de pantalla (original y censurada). Por supuesto que no voy a dar los nombres de ninguno, puesto que es contra las reglas. Pero me preocupa ligeramente que los 4 acordaran reportarme y que incluso incitaban a los oponentes a hacer lo mismo. Los report&eacute;, tambi&eacute;n explicando brevemente el motivo. Pero a&uacute;n as&iacute; estoy un poco preocupado.  Deber&iacute;a hacer algo mas? No considero que sea correcto que premades de 4 puedan trollear as&iacute; y poner en riesgo la cuenta de cualquiera que tiene la mala suerte de cruzarse con ellos. As&iacute; como me pas&oacute; a mi podr&iacute;a pasarle a cualquiera. Hay alg&uacute;n admin que pueda aconsejarme?\r\n\r\nGracias por su tiempo gente, les mando un saludo y feliz a&ntilde;o nuevo!","replies":[{"poster":"Sunday Holiday","date":"2017-01-02T14:28:38.497+0000","up_votes":12,"down_votes":0,"body":"Un cuarteto de pendejos o inmaduros ya me paso una ves y ellos piensan que están siendo los reyes del humor. {{champion:29}} {{champion:29}} {{champion:29}} {{champion:29}}","replies":[{"poster":"ßest iNißßa EEUU","date":"2017-01-03T11:31:21.018+0000","up_votes":1,"down_votes":0,"body":"{{champion:17}} {{champion:29}} {{champion:115}} {{champion:150}}","replies":[]}]},{"poster":"rokushoger","date":"2017-01-02T11:24:22.947+0000","up_votes":8,"down_votes":0,"body":"Además de lo que dijo conqueror, si los reportaste in game mejor todavía.\nPor último, si es verdad lo que dices, no te preocupes si te reportan, reports sin fundamento no son tomados en cuenta.","replies":[{"poster":"Padmasana","date":"2017-01-02T17:48:07.971+0000","up_votes":3,"down_votes":5,"body":"***","replies":[{"poster":"rokushoger","date":"2017-01-02T18:26:36.370+0000","up_votes":1,"down_votes":0,"body":"Lo han explicado millones de veces los rioters mismos en el red tracker. Además es una pregunta que hice directamente por el interno que tenemos los voluntarios por si acaso (hace ya un tiempo). El sistema funciona levantando el report y comparando contra lo que tiene seteado como \"tóxico\". Si el reporte coincide entonces lo deja como válido y sino lo descarta.\n\nTambién si el sistema recibe muchos reportes de algo que no tiene como tóxico (y con muchos no me refiero a 4, no me dieron números, pero por lo que entendí, deben ser varios cientos) y encuentra un patrón entre ellos, puede \"aprender\" y agregar ciertos parámetros como tóxicos, pero como verás no es el caso.\n\nSi un premade te reportó y te banearon, es porque necesariamente o bien flameaste, o troleaste, o te fuiste afk. No importa si flameaste porque \"ellos iniciaron y me hicieron la vida imposible\", da igual, si flameaste el report es válido, por eso yo al menos me encargo de insistir a todo el que veo que no entre en el flameo directo o indirecto, simplemente mute y report.\n\nSi no me crees es bien sencillo, posteale tu duda en una respuesta a Riot Excalibeer que seguro te contesta y te aclara el punto.","replies":[{"poster":"Padmasana","date":"2017-01-02T19:21:12.793+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"rokushoger","date":"2017-01-02T20:56:32.225+0000","up_votes":2,"down_votes":0,"body":"> el sistema tiene errores\n\nClaramente, algún error debe tener porque se basa en la programación que le da un humano, que por definición es un ser imperfecto. Y esto en que afecta a lo que te dije?\n\nSiempre tenés la opción de mandar el ticket y que ellos te revisen el caso. Si no te dan bola seguís insistiendo hasta que te la den. No te van a dejar un permaban si no es justo, porque como tu mismo lo estás diciendo se revisa el caso y si es injusto se levanta y ya.\n\n> le hacen creer al enemigo que tú eres el flamer y que tienen que reportarte y por una partida en la que no hablaste una palabra te llevas x9 reports, y no me vengas con que no es así, porque lo es.\n\nNo dije que no era así, dije que esos reportes no cuentan si no hiciste nada. \n\nAhora me hablás de tu caso, pero no tengo forma de comprobar de que lo que dices sea cierto. Por otro lado el usuario tiene como comprobar que lo que digo es cierto (preguntando a excali).","replies":[]}]},{"poster":"ChonGryn","date":"2017-01-02T19:22:15.012+0000","up_votes":1,"down_votes":0,"body":"Tengo una duda, ustedes a que le dicen comportamiento toxico o flamear? Digo, porque me paso el mismo caso del report de 4 premades me dieron una suspensión de 14-15 dias","replies":[{"poster":"rokushoger","date":"2017-01-02T20:51:17.658+0000","up_votes":1,"down_votes":0,"body":"Insultar, hostigar, acosar, tener una actitud despectiva o sobrada, desprestigiar, calumniar y en sí cualquier actitud o acción realizada con el afan de afectar negativamente a otro. Lo dicen los TOS.","replies":[]}]}]}]},{"poster":"ITACH1 UCHIHA","date":"2017-01-02T16:39:35.856+0000","up_votes":2,"down_votes":6,"body":"disculpame, a mi me reportaron de la misma manera y me banearon la cuenta :/  ,, creo que seria mejor que empiecen a hacer algo","replies":[{"poster":"rokushoger","date":"2017-01-02T17:08:15.424+0000","up_votes":5,"down_votes":2,"body":"Y en la partida cuando te insultaron o trolearon o lo que fuera, por casualidad insultaste? aunque sea en retribución a lo que te hicieron pero insultaste, o te quedaste afk, o troleaste? porque si es así, entonces el ban está bien puesto.","replies":[{"poster":"kiuhm","date":"2017-01-02T22:14:19.298+0000","up_votes":1,"down_votes":0,"body":"Vos bien sabes como eran los reportes antes, en donde efectivamente una premade podia banearte por no haber dicho nada con solo reportarte una vez. \nY los rioters decian que eso no se podia hacer y despues reconocieron que se podia y por eso el cambio en el sistema. \nQue tan seguro estas de que no pueda pasar lo mismo pero en menor medida? \nYo creo que cuando uno no esta seguro, que no tiene evidencia de que las cosas funcionen como deberia, es mejor no decir nada. \nNo vale la pena y no tiene sentido.","replies":[{"poster":"rokushoger","date":"2017-01-03T11:28:42.497+0000","up_votes":1,"down_votes":0,"body":"Es bien sencillo, evidencia hay. Entrá al foro todos los días y hacé un recuento de cuantos post de \"me banearon injustamente\" realmente son injustos. Creo que en todo lo que lleva el sistema nuevo solo supe de un caso en el que realmente se habían equivocado, y ni siquiera es que no llevara sanción, es que por algún motivo el sistema en vez de darle de 14 días incorrectamente saltó una etapa dándole perma.\n\nYo transmito lo que yo mismo averigué, y tengo las pruebas en lo que te digo, si tenés pruebas en contra de eso genial! veamosla y tal vez hasta podemos hacer una sugerencia y cambiar para bien de todos lo que está mal.\n\n> Vos bien sabes como eran los reportes antes, en donde efectivamente una premade podia banearte por no haber dicho nada con solo reportarte una vez.\n\nEstás hablando del tribunal no? Si es así tenés razón, pero la diferencia es que antes juzgaban humanos, con las falencias típicas de un humano. Ahora es una máquina donde si no hay un patrón reconocible en tu reporte directamente lo descarta, es una gran diferencia.","replies":[{"poster":"kiuhm","date":"2017-01-03T22:47:10.143+0000","up_votes":1,"down_votes":0,"body":"No, no hablo del tribunal, hubo un sistema automatico que estuvo despues del cierre del tribunal y fue anterior al actual. \nY remarco que aunque haya una falla, los rioters no lo van a decir. \nY es imposible que tengas evidencias porque yo muchas veces se la pedi a excaliber y dijo que no podia mostra numeros porque no se lo permitian.","replies":[{"poster":"rokushoger","date":"2017-01-04T10:45:59.468+0000","up_votes":1,"down_votes":0,"body":"> Y remarco que aunque haya una falla, los rioters no lo van a decir.\n\nPues lo han dicho con el caso que te comenté. Fue un caso que aparte se dió acá mismo y todo, buscalo en el foro si querés.\n\n> Y es imposible que tengas evidencias\n\nLee de nuevo el primer párrafo por favor, acá te lo cito:\n\n> Es bien sencillo, evidencia hay. Entrá al foro todos los días y hacé un recuento de cuantos post de \"me banearon injustamente\" realmente son injustos.","replies":[{"poster":"kiuhm","date":"2017-01-04T11:35:39.886+0000","up_votes":1,"down_votes":0,"body":"> Lee de nuevo el primer párrafo por favor, acá te lo cito:\n\nHaceme un favor chabon, deja de tratar a la gente como si fuera estupida. \n\nEl foro es una cosa, lo que pasa en le juego es otra. Por eso ni lo mencione.","replies":[]}]}]}]}]}]}]}]},{"poster":"Hwaxinghz","date":"2017-01-02T09:30:26.558+0000","up_votes":7,"down_votes":0,"body":"Puedes reportar las premades troll, si el sistema detecta que te trolearon los 4 es InstaBan.\n\nReportalos Vía [Soporte](https://support.riotgames.com/hc/es-419).","replies":[{"poster":"ÇhonGryn","date":"2017-01-05T01:16:30.863+0000","up_votes":1,"down_votes":0,"body":"En que sección del soporte puedo reportar eso? Porque quiero mandar unas capturas de pantalla de un chat y no encuentro la seccion","replies":[]},{"poster":"GDPhyros","date":"2017-01-03T00:48:07.274+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Conqueror Syndra,realm=LAS,application-id=PJAKt7ph,discussion-id=gaZGeEHA,comment-id=0001,timestamp=2017-01-02T09:30:26.558+0000)\n>\n> Puedes reportar las premades troll, si el sistema detecta que te trolearon los 4 es InstaBan.\n> \n> Reportalos Vía [Soporte](https://support.riotgames.com/hc/es-419).\n\nvaya por fin una respuesta real, una pregunta:\n¿esto es 100% efectivo, osea alguien se toma el trabajo de revisar la partida y hacer un maneo a mano?","replies":[]}]},{"poster":"Hendrix","date":"2017-01-02T14:16:17.113+0000","up_votes":3,"down_votes":0,"body":"pasa siempre con los premades, te echan la culpa de todo aunque los estes carreando\n\nEl mejor consejo es: ignoralos y reportalos al final","replies":[]},{"poster":"NickW","date":"2017-01-02T06:58:46.808+0000","up_votes":3,"down_votes":0,"body":"Si no insultaste ni hiciste nada incorrecto no tenes absolutamente nada de que preocuparte.\nEl sistema reconoce los reportes falsos y los descarta (más si provienen de las famosas premades de 4 trolls)\nEs muy triste tener que pasar por esa experiencia, espero que hayas reportado a esos 4 como corresponde de igual forma.\nSaludos.","replies":[]},{"poster":"Hi im Eleven","date":"2017-01-02T15:37:30.978+0000","up_votes":2,"down_votes":6,"body":"Anoche me tocaron 4, que legalmente yo gane top, ya que el que iba a ir top dijo \"gop\", me empezaron a insultar, termine mejor que el supp y el adc de ellos.\nSeguramente me reportaron.","replies":[{"poster":"Sákata Gintoki","date":"2017-01-02T17:01:51.294+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Hi im Eleven,realm=LAS,application-id=PJAKt7ph,discussion-id=gaZGeEHA,comment-id=0006,timestamp=2017-01-02T15:37:30.978+0000)\n>\n> Anoche me tocaron 4, que legalmente yo gane top, ya que el que iba a ir top dijo &quot;gop&quot;, me empezaron a insultar, termine mejor que el supp y el adc de ellos.\n> Seguramente me reportaron.\n\nSe entendía que era ´´Top``,Me a pasado varias veces que por una pequeña letra la escriben mal diciendo ´´mi´´.´´dc´´,etc pero no por que  se equivoco en una letra tu tienes que pensar que por eso ganaste Linea.se entiende Perfectamente cual fue la linea que querían ir.Bueno en todo Caso igual eran ´´Trolls´´ Saludos","replies":[]}]},{"poster":"The Upside Down","date":"2017-01-02T10:52:53.991+0000","up_votes":3,"down_votes":2,"body":"Para mi es un típico caso de nenes de 12 años que no entienden nada. La cola de normal oculta esta llena de nenes pequeños que se la pasan troleando o se enojan si no van la linea que ellos quieren, y si les decis algo te flamean. Es imposible que exista, pero que bueno sería que exista un filtro de edad.","replies":[]},{"poster":"Sirek","date":"2017-01-03T17:57:21.388+0000","up_votes":1,"down_votes":0,"body":"Te culpan de todo si estas con una premade de 4... sobre todo si vas JG xD.","replies":[]},{"poster":"Historía","date":"2017-01-03T15:03:05.222+0000","up_votes":1,"down_votes":0,"body":"Ya me paso una vez y lo unico que hice fue no darles bola y mutearlos. y por los reports no te preocupes, que si no has echo nada malo no te pueden banear o algo","replies":[]},{"poster":"Ajotta","date":"2017-01-03T03:39:28.852+0000","up_votes":1,"down_votes":0,"body":"/mute all y esperar el surrender, mientras jungleas para no morir de aburrimiento","replies":[]},{"poster":"ReichsFuhrer","date":"2017-01-03T00:18:59.123+0000","up_votes":1,"down_votes":0,"body":"Yo con unos amigos hacemos la inversa a lo que te paso a vos, jugamos callados, cagandonos de risa por skype, y cuando identificamos al/los flamer/S de la partida, al final le damos combo de report {{sticker:slayer-pantheon-thumbs}} \nOjo! si piden report del team enemigo no reportamos a menos que efectivamente veamos en los hechos que si es valido.\nEn particular lo recomiendo, te diviertes, practicas jugadas coordinadas y ayudas a la comunidad a dar report a los toxicos, flamers y trolls, lo mejor es ver 2 o 3 carteles algunos dias con el mejor mensaje que te da riot:\n¨gracias a tus reportes y el de tus amigos hemos identificado a un jugador.... y se lo ha sancionado ... ¨  {{sticker:zombie-nunu-hearts}}","replies":[]},{"poster":"Zhaher","date":"2017-01-02T19:21:40.810+0000","up_votes":1,"down_votes":0,"body":"Ami me paso igual 4 premades insultandome y luego al final los 4 en el chat me acusaron de flamer D:","replies":[]},{"poster":"zanidar","date":"2017-01-02T18:22:48.811+0000","up_votes":1,"down_votes":0,"body":"si que hay gente con tiempo para desperdiciar....","replies":[]},{"poster":"Akalimaster","date":"2017-01-02T16:55:32.689+0000","up_votes":1,"down_votes":0,"body":"por eso siempre juego en premade de 5 pero aveces se da el caso de que somos 4 y jugamos igual y nos la pasamos bien sin molestar a nadie {{sticker:slayer-pantheon-rainbows}}","replies":[]}]}