{"poster":"Therimplay","date":"2017-01-18T00:15:46.097+0000","title":"Nuevo campeon que sea trirador pls","subforum":"Charlas Generales","up_votes":1,"down_votes":5,"body":"A los q esten viendo esto pido a riot q el proximo (uno de los proximos) campeones sea tirador si se dan cuenta no hay  muchos tiradores (adc) en el juego si se q no hace mucho hicieron a jhin pero les pido q hagan otro campeon como tirador o adc","replies":[{"poster":"Hwaxinghz","date":"2017-01-18T00:33:20.602+0000","up_votes":2,"down_votes":0,"body":"Hay 15 Asesinos, 38 Luchadores, 30 Magos, 17 Tanques, 21 Tiradores y  13 Soportes. Claramente si sale un nuevo campeón ESTE debería ser Soporte, ya que hay muy pocos campeones que cubren dicho Rol (de manera \"completa\", sin contar los Falsos soportes Annie, Nidalee, Lux y esos).\n\nDe hecho, faltan tantos Soportes que por eso hay otros campeones que han tomado notoriedad en dicho Rol, como Morgana, Leona, Nautilus, que en realidad no fueron pensados para ese Rol pero la gente acostumbra usarlos allí.\n\nNo sería correcto sacar otro campeón que sea tirador, debería ser un Tipo de campeones que esté equilibrado con la cantidad de Soportes, así tener mucha más variedad.","replies":[{"poster":"WhiteMax","date":"2017-01-18T02:05:35.191+0000","up_votes":1,"down_votes":0,"body":"Cuando hay un Campeon que por ejemplo en la descripcion y/o en la Tienda dice Luchador/Tanque, como lo clasificamos? como tanque o luchador?","replies":[{"poster":"Hwaxinghz","date":"2017-01-18T02:46:29.550+0000","up_votes":1,"down_votes":0,"body":"Te metes en la pestaña campeones, en Filtros de Tipo seleccionas el TIPO (vaya la redundancia) y sólo conté los que aparecen allí, no ando \"discriminando\" tan fino según la clase. Los 2 únicos Roles reales que me fijé específicamente en los campeones (Limitándome en los que figuran en el cliente) son TIRADOR y SOPORTE, para hacer la comparación, el resto es indistinto, hay demasiados campeones de las otras clases, y se toman muchos SOPORTES falsos como Soportes reales y se toman muchos Tiradores falsos como Tiradores Reales, sólo ahí me puse fino (en el resto no, LO ACLARO) y expliqué porqué es necesario sí o sí varios soportes nuevos.","replies":[{"poster":"WhiteMax","date":"2017-01-18T09:39:27.067+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"EpicHit","date":"2017-01-18T02:55:02.176+0000","up_votes":1,"down_votes":0,"body":"Hay campeones que funcionan de otros roles y no dicen ahi, un ejemplo es Blitzcrant es Luchador Tanque, pero funciona muy bien de support","replies":[]}]},{"poster":"Setsumi Sakura","date":"2017-01-18T02:33:09.252+0000","up_votes":1,"down_votes":0,"body":"igual me gustaría un nuevo adc, los de ahora son casi todos iguales.","replies":[{"poster":"EpicHit","date":"2017-01-18T02:53:51.831+0000","up_votes":1,"down_votes":0,"body":"{{champion:119}} {{champion:429}} {{champion:22}} {{champion:21}} {{champion:104}} {{champion:42}} {{champion:202}} {{champion:81}} {{champion:222}} {{champion:51}} {{champion:15}} {{champion:29}} {{champion:110}} {{champion:67}}  A mi me parecen muy distintos todos.","replies":[{"poster":"Setsumi Sakura","date":"2017-01-19T00:01:36.780+0000","up_votes":1,"down_votes":0,"body":"Algunos me dan asco y otros para mi son bastante aburridos. unos son torretas y otros son poke. siempre que voy adc voy con varus, me gusta eso de snipear gente.\n\nFuera de eso solo algunos de ellos tienen cosas particulares y que no me den asco.\n\nCreo que es el rol que tiene a la mayoría de campeones que odio, como tiene tantos me gustaría ver nuevos para ver si me llegan a dar asco o no.","replies":[]}]}]},{"poster":"WhiteMax","date":"2017-01-18T00:19:25.654+0000","up_votes":1,"down_votes":0,"body":"Que no haya 50 tiradores no significa que no haya muchos{{sticker:slayer-jinx-unamused}} .\n\nYa llegaran la era de los nuevos tiradores pero por ahora es... \"la temporada de asesinos\" jajaja{{sticker:slayer-jinx-wink}} .","replies":[]},{"poster":"Tutancadead","date":"2017-01-18T00:20:50.056+0000","up_votes":1,"down_votes":2,"body":"No hay muchos. Pero hay como dies tiradores más que support. \n\nHay que desastre de ese cáncer del LoL.\n\nPD: suerte con tu pedido.","replies":[]}]}