{"poster":"Hundis Katze","date":"2019-04-25T07:20:22.440+0000","title":"Euer positivstes Spielerlebnis [Sammelthread]","subforum":"Spielerverhalten & Moderation","up_votes":8,"down_votes":0,"body":"In und über League of Legends wird gern geschimpft. Sei es über die Community, dem raffgieren Riot, den \"voll ungerechten Bann\", den achso bösen Intern und Trollen usw... Allgemein gehört es wohl zur menschlichen Natur sich schlechte Dinge besser zu merken als die positiven Dinge. \nWir können uns Tage, Wochen, Monate, Jahre und Jahrzehnte über den 0/20/1 Jungler aufregen, der durchgehend flamte und nach Minute 15 beschloss sich Tränen zukaufen und als Rache zu inten, vergessen aber den Supporter, der in einen Towerdive von 2vs5 uns beschützte und verhalf einen spektakulären Pentakill zu erzielen, sobald wir auch nur das nächste Spiel starten.... ;)\n\nDas muss nicht sein oder?\n\nIch liebe dieses Spiel und weiß aus Erfahrung wie sehr man sich den Spaß sabotieren kann, wenn man sich nur auf das Schlechte versteift und versuche deshalb auch die schönsten Games mir vor Augen zu führen. Dieses Match gestern, war einer dieser Lichtblicke:\n\nhttps://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/4006527070/2127890108428736?tab=overview\n\nIch spielte Sona eigentlich nur, weil ich den nervigen Autofill in Ranked raushaben wollte, weswegen ich wenig ernst, aber entspannt in das Spiel reinging. Schon sehr früh fiel mir auf, dass unsere Kontrahenten Jhin und Morgana wie zwei betrunkene Affen ihre Fähigkeiten abfeuerten, weswegen es mir nicht schwer fiel zu puschen und poken. Und´der Jungler war keine wirkliche Gefahr, da wir ihr ihn rechtzeitig sachen. Dann passierte es: Innerhalb von gefühlt 5 Minuten stand ich als Supporter mit 4 Kills. Ich rechnete bereits mit dem schlimmsten Flame, aber das Gegenteil passierte. Ashe schwieg und farmte einfach, während Tresh von der Midlane scherzhaft kommentierte \"Sona ADC XD\". Gegen Ende des Spiel gewannen wir die Oberhand, wobei ich und Thresh als Doppelsupports fungierten bis wir das Spiel gewannen. Keine Ahnung wie gut ich tatsächlich war aber es war eine durchgehend positive Stimmung und als Support angenehm nicht ständig der Buhmann zu sein, weswegen die restlichen Spiele trz eines zwischenzeitlichen Loses viel Spaß gemacht haben.\n\n\nSo jetzt seid ihr dran: Was war euer positivstes Spielerlebnis? Erzählt alles in den Kommentaren und tragt dazu bei, dass sich Mentalität wieder ins entspannt positiv und sportliche verschiebt\n {{sticker:sg-ahri-2}}","replies":[{"poster":"Izaya Kumiho","date":"2019-04-25T07:46:32.367+0000","up_votes":5,"down_votes":0,"body":">Euer positivstes Spielerlebnis\n\nAls mir ein Jungler 'nen Bluebuff anbot und gab, obwohl er selber Mana brauchte...in Season 5.\nIch war infight und konnte den Buff eigentlich gar nicht annehmen, lehnte ihn sogar dankend ab. Er bestand aber darauf. Also tankte er den Buff, bis er selber 10 HP hatte und ich vorbei kommen konnte.\n\n\nGentlemen sind rar geworden.\n\nIch weiß nicht mehr, wie ein Bluebuff frisch vom Junglemob schmeckt... aber dieser Move bleibt für immer in meinen Gedanken.\n\n\nhttp://i.imgur.com/fgYuZNB.gif","replies":[]},{"poster":"StardustSorcerer","date":"2019-04-25T23:42:34.474+0000","up_votes":4,"down_votes":0,"body":"In einem Ranked Spiel in Season 7 oder 8 habe ich tank jungle gespielt. Wir haben verloren. Nach dem Spiel war ich jedoch glücklicher als in keinem weiteren Spiel.\n\nIn diesem Spiel hat niemand geflamt, keine passive Aggresivität, keine ungeduldigen Pings. Auch die Gegner waren höflich. Wir haben verloren, weil unsere Teamcomp zu wenig dmg hatte und die Gegner zudem noch richtig gute Spieler waren. Kein Spieler hat schlecht gespielt. Es gab keine ints und keine surrender votes. Es wurden sogar konstruktive combacks als Team versucht. Jedoch wurden wir langsam niedergerungen, wie in einem pro-spiel.\n\nDas ganze fühlte sich gut an, obwohl es auch anstrenged war.","replies":[]},{"poster":"Nordwolf87","date":"2019-04-25T08:33:27.157+0000","up_votes":5,"down_votes":1,"body":"Ich hatte mal ein Game in dem Alles schief lief. Wir waren 11k Gold behind und die Gegner an unserem Nexus dran. Es war schon Late game.\n\nUnd jetzt das Überraschende: keiner ist getiltet. Jeder wollte bis zum Schuss verteidigen. Das Ergebnis: wir haben den Teamfight um den Nexus gewonnen, Baron gerusht und das Spiel am Ende mit 6k Gold Rückstand im Baronpush wenige Minuten nachdem wir den Nexus grade noch retten konnen gewonnen.\n\nWar ein Super Gefühl {{sticker:galio-happy}}","replies":[]},{"poster":"eingew","date":"2019-04-26T06:28:41.309+0000","up_votes":3,"down_votes":0,"body":"Als ich zum allerersten Mal Platin gekommen bin (mittlerweile habe ich diese Prozedur leider schon mehrmals hinter mir, bin seitdem echt nicht besser geworden) hatte ich während der Promo plötzlich Probleme mit dem Rechner. Manchmal spinnt der, das passiert so ein Mal alle 100 Spiele, da lädt der irgendwie ewig den Ladescreen und kommt dabei nicht voran. Nach ein paar Minuten hab ich mir schon gedacht, dass irgendwas nicht stimmt, bin also raus, alle LoL-Prozesse geschlossen das Ding neu gestartet... es lädt wieder ewig... nochmal von vorne... glaube die Prozedur musste ich drei mal oder so machen, bis ich endlich im Spiel war, die zehn-Minuten-Marke war bereits überschritten. Erstmal war ich natürlich total überrascht, dass da überhaupt noch Leute spielen, also lautete meine erste Frage als ich endlich iname war natürlich \"why are you still playing? I thought you'd remake :D\". \nTjoa. Einer von denen hatte sich vorher angesehen mit wem er da zusammenspielt und bemerkt, dass ich in der Promo zu Platin saß. Also hat er wohl unser Team überredet, da zu bleiben, weil ich ja auf jeden Fall wieder kommen würde um nicht die Promo zu verkacken. Und es war bisher sogar ganz gut gelaufen, keiner hatte gefeedet, eine der beiden anderen Lanes ( ich spiele ja Support ) hat meine ich sogar gewonnen gehabt und abgesehen von den Objectives lief es ganz gut für unser Team. \nIch war natürlich begeistert und wir haben das Spiel am Ende auch gewonnen, ohne dass ich besonders viel dafür tun musste (oder auch konnte, ich war ja hoffnungslos unterleveled). Aber ein bisschen CC und so kann man ja immer raushauen. Sowas ist mir sonst noch nie passiert und vermutlich wird es das auch nicht - da muss ja echt viel zusammenkommen. Ich schätze auch mal, dass da Premades bei waren, die lassen sich ja leichter zu solchen Aktionen überreden als normale Spieler.","replies":[]},{"poster":"DieguteDame","date":"2019-04-25T18:23:17.045+0000","up_votes":3,"down_votes":0,"body":"Der Thread ist gerade perfekt, weil ich total getiltet bin. xD\n\nPositives passiert mir tatsächlich recht häufig in LoL, dadurch, dass ich meinen Tilt im Chat meist humorvoll zum Ausdruck bringe und meine Teammates möglichst oft lobe bekomme ich sehr viel positives Feedback. \n\nImmer wieder festzustellen, wie das sachliche Geben von Ratschlägen oder schlichte Positivität letztlich zum Win führen, ist sehr ermutigend und für mich der Beleg, dass man nicht nur durch das Gameplay (was bei mir eher bescheiden ist xD) Einfluss hat, sondern auch durch die Stimmung, die man verbreitet.","replies":[]},{"poster":"Noxempire","date":"2019-04-25T09:18:44.145+0000","up_votes":3,"down_votes":0,"body":"Ironischerweise wars bei mir Clash.\n\nBei uns lief alles komplett glatt, kein Crash nichts. (und ja ich bin mir durchaus der Probleme von anderen Leuten bewusst)\n\nIch und meine 4 Premates haben extrem gut gespielt (für unsere Verhältnisse) und alle Spiele haben sich auf gleicher Augenhöhe angefühlt.  Es war kein Stomp, es war durchgehend spannend und wir hatten die ganze Zeit Angst, dass wir die Games noch thrown können. \nSo einen Nervenkitzel hatte ich noch nie vorher in League ^^\n\nJeder hat sich Pink wards gekauft und zum ersten mal hatte ich das Gefühl ein intensives Visiongame zu spielen x)\nUnd obwohl wir zeitweise weit hinten lagen konnten wir die Spiele noch drehen und haben das Bracket für uns entscheiden können mit 100% Win Rate :D","replies":[{"poster":"Nordwolf87","date":"2019-04-25T10:14:56.786+0000","up_votes":3,"down_votes":0,"body":">und haben das Bracket für uns entscheiden können mit 100% Win Rate :D\n\nAngeber :P","replies":[{"poster":"Noxempire","date":"2019-04-25T12:38:04.706+0000","up_votes":3,"down_votes":0,"body":"https://media.giphy.com/media/aXSLMy6fDsI4E/giphy.gif","replies":[]}]}]},{"poster":"SgtBananenkuchen","date":"2019-04-25T10:38:32.669+0000","up_votes":3,"down_votes":0,"body":"Spontan fällt mir nicht ein einzelnes Spiel ein, aber in letzter Zeit spiele ich sehr gerne Jungle und versuche mein bestes zu geben - habe vorher nie wirklich Jungle gespielt und muss mich halt erst damit zurechtfinden. Aber ich bekomme in fast jedem Spiel unglaubliche Hilfe - die Lanes reagieren super, die Bot-lane muss erst garn icht lange überlegen und angepingt werden, sie kommen sofort, um mir beim Drachen zu helfen; die Lanes kommen mir entgegen, wenn ich im Jungle auf den Gegner treffe und vielleicht nicht mehr selber kämpfen kann.\n\nIm Gegensatz dazu gibt es genug spiele, bei denen ich geflamed werde, aber ich merke in letzter Zeit, wie sehr die Lanes einem durchaus mal helfen. Da gibt es dann so tolle Momente, dass Neeko meine Form annimmt und wir den Gegner so verwirren, dass wir am Ende ein Double rausholen und kaum verletzt raus gehen. \n\nGanz toll sind auch die Spiele, in denen die Gegner schon am Nexus stehen, wir dann ein Ace raus hauen und das ganze Team perefekt zusammenspielt und zusammen die Lane komplett durchpusht, dass wir dann doch noch gewinnen.\n\nEs besteht doch noch Hoffnung :'D","replies":[]},{"poster":"Abasin","date":"2019-04-25T16:20:40.421+0000","up_votes":4,"down_votes":1,"body":"Mein erster Penta mit Ashe in ARAM.\nMein zweiter Penta mit Malphite ebenfalls in ARAM.\n\nBin vor Freude nicht mehr an den Türgriff gekommen. {{sticker:sg-kiko}}","replies":[]},{"poster":"Pandeonor","date":"2019-04-26T12:21:40.497+0000","up_votes":2,"down_votes":0,"body":"Ein ARAM letzte Saison. :)   Wir waren 4 tanks und mich, also Zyra. Die Gegner mit ADC´s und Tanks haben uns aufgerieben, wobei das hin- und herging. Gegen Ende war unser Nexus offen und zwei wollten aufgeben, da wir einfach zu wenig Schaden hätten - ich war gestorben [allerdings, da selten Tod, konnte ich dann Fullbuild ´raus]. Unser Cho hat dann geschrieben man solle auf mich warten und dann als 5-er Gruppe durch. Fullbuild-Zyra mit 4 Bodyguards {{sticker:sg-lux}}. Kriegt man nirgends geboten!","replies":[]},{"poster":"INoKami","date":"2019-04-25T16:00:06.056+0000","up_votes":2,"down_votes":0,"body":"Ist schwer, wenn es sich auf Erlebnisse mit anderen Spielern bezieht, denn die sind verdammt selten. Und es wird nicht besser...\nDa fällt mir der gegnerische Midlaner ein (muss ungefähr Season 5 gewesen sein), der mir ASol noch ein bisschen näher erklärte, nachdem ich ihn mit mittelmäßigem Erfolg in dieser Runde gespielt hatte. Oder der Darius Top, der Verständnis für mich hatte, als mitten im Spiel die Batterie meiner Maus ohne Vorwarnung leer ging und ich nur noch die Laptop-Maus zur Verfügung hatte (und damit zu spielen ist unmöglich), meine Teammates nahmen es auch hin, surrenderten bei Minute 20, ein oder zwei verdiente Reports hab ich mir abgeholt und gut war´s.","replies":[]},{"poster":"IcryWhenIpoop","date":"2019-05-02T21:47:04.772+0000","up_votes":1,"down_votes":0,"body":"Als ich meine ersten Schritte in LoL machte, ich tierisch verkackte, weil ich eigentlich keinen Plan hatte was ich da machte und mir meine Mitspieler (und ich meine auch das Gegnerteam) trotzdem immer FREUNDLICH Ratschläge gab. Ich war damals so schlecht mit Maokai und Pantheon als die zuerst ausprobierten Champions. Aber den Leuten war es egal. Hatten trotzdem Spass. Denn das war es, was zählte.\nHeutzutage eine absolute Rarität leider. Der Hass in der Community hat leider so stark zugenommen, dass die MuteAll-Funktion mein bester Freund wurde.","replies":[]},{"poster":"alucard21383","date":"2019-04-25T23:02:32.319+0000","up_votes":1,"down_votes":3,"body":"***","replies":[{"poster":"Nordwolf87","date":"2019-04-26T04:49:18.095+0000","up_votes":2,"down_votes":0,"body":"Themenverfehlung.\n\nSetzen 6.","replies":[]}]}]}