{"poster":"Hundis Katze","date":"2019-08-03T13:50:07.194+0000","title":"TFT Ranked zu leicht?","subforum":"Teamfight Tactics","up_votes":1,"down_votes":0,"body":"Irgendwie ist TFT Ranked noch derzeit zu leicht. Ich mein, man muss nur unter den Top 4 sein und schon krieg ich LP. Ist nicht wirklich herausfordernd.\r\nAuch ist das TFT System eher mit mehr Glück als Verstand. Ich brauch nur zu anfang die richtigen drei Champs und schon gehts.","replies":[{"poster":"Ser Parmesan","date":"2019-08-04T18:04:32.761+0000","up_votes":1,"down_votes":0,"body":"Ich denke es ist so einfach, weil das Spiel an sich zurzeit extrem einfach ist.\nSolange es eine so klare Meta gibt, gibt es nur wenige mögliche Entscheidungen, die gut sind. \nGanz einfach Archer/Gunslinger spamen mit guardians und man steigt auf, in höheren Lotterierängen spielt das jeder und das Spiel ist dadurch sehr eintönig. Der natürliche Counter wäre natürlich assasinen, aber dank absurd vielen bugs, extrem schlechtem Pathfinding und noch schlechterer AI ist das aber kaum viable.\n\nAlso ja, es ist zu leicht. So wie es einfach ist, einen Lotterieschein auszufüllen. Ist tatsächlich sehr ähnlich.","replies":[]},{"poster":"Í am Udyr","date":"2019-08-03T19:46:34.645+0000","up_votes":1,"down_votes":0,"body":"Hahahahahaha, hat 10 Spiele gemacht auf bronze, keines davon gewonnen und dann so ein Satz xD\n\nKann nur ein Troll sein.","replies":[{"poster":"OT Riku","date":"2019-08-04T05:50:52.067+0000","up_votes":1,"down_votes":0,"body":"Naja platz 4 ist ja quasi schon gewonnen.\n\nWenn du dauerhaft verlierst sprich platz 5 oder schlechter dann machst du was falsch.","replies":[{"poster":"Í am Udyr","date":"2019-08-04T15:47:05.525+0000","up_votes":1,"down_votes":0,"body":"Platz 4 ist kein Win!\nPlatz 4 ist höchstens ein ''okay, nicht verloren.''\nClimben kannst du mit einem Platz 4 höchstens in low elo, danach ist #4 höchstens ein Remake ;D","replies":[]}]}]},{"poster":"Megamaexx","date":"2019-08-03T22:22:42.827+0000","up_votes":1,"down_votes":0,"body":"Wenn du zu den 50% der oberen Spielern gehörst, bekommst du LP, gehörst du zu den unteren 50%, verlierst du LP (Bei gleicher MMR aller Spieler). Bei nem Spiel in der Kluft bekommst du ja auch LP, wenn du durchgecarried wirst.","replies":[]},{"poster":"Vorzüglich","date":"2019-08-03T13:53:09.501+0000","up_votes":1,"down_votes":0,"body":"Ehrlich gesagt könnte sich das Kluft Ranked System viel von TfT abschauen in der Hinsicht.","replies":[{"poster":"Alustus","date":"2019-08-03T14:13:17.532+0000","up_votes":1,"down_votes":0,"body":"eher weniger.\nDa du dort Spieler nicht wirklich bewerten kannst.\nSchlechtere stats heißen nicht zwangsläufig das man schlechter gespielt hat.\n\nIch bin der meinung das in beiden Modis das System jeweils so ziemlich das beste ist was man hinbekommt.\nWobei man es bei TFT noch nicht so genau sagen kann.","replies":[{"poster":"Vorzüglich","date":"2019-08-03T20:50:57.210+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alustus,realm=EUW,application-id=trYhv8pL,discussion-id=kt4wxE2z,comment-id=00000000,timestamp=2019-08-03T14:13:17.532+0000)\n>\n> eher weniger.\n> Da du dort Spieler nicht wirklich bewerten kannst.\n> Schlechtere stats heißen nicht zwangsläufig das man schlechter gespielt hat.\n> \n> Ich bin der meinung das in beiden Modis das System jeweils so ziemlich das beste ist was man hinbekommt.\n> Wobei man es bei TFT noch nicht so genau sagen kann.\n\nIn der Kluft ist es doch vielmehr so das ein Spieler oder noch genauer ein Teamfight den ausgang deiner Bewertung Ranked Points ausmacht.\n\nVerstehst Du, worauf ich hinaus möchte? das Kluft Ranged System ist im grunde darauf aus nicht zu belohnen sondern einer Seite der Spieler den Aufstieg zu verwehren. \n\nBei TFT profitieren mehr, dies ist ein wahrer Fortschritt und nicht zu einfach sondern Spielergerecht, mit der Betonnung auf Gerecht!","replies":[{"poster":"Alustus","date":"2019-08-03T21:21:01.553+0000","up_votes":1,"down_votes":0,"body":"Ich sehe nicht wo das Kluft System Ungrecht sein sollte, davon mal abgesehen hat das was du versuchst anzusprechen nichts mit Fairness zu tun sondern \n\nIn der Kluft geht es nicht darum jemanden den aufstieg zu verwehren, wie kommst du auf diese Idee?\nIn der Kluft steigen sollten statistisch gesehen gleich viele aufsteigen wie in TFT.\n\nIch weiß jetzt nicht wohin sich das ganze bei TFT noch entwickelt, aber wie gesagt können dort auch 6 Spieler verlieren und nur 2 gewinnen.\nEs kann zwar auch sein das 5 gewinnen und nur 3 verlieren.\nAber ich denke dass am ende eher 50% gewinnen/verlieren, sprich genau so wie in der Kluft\n\n\nEs geht wie bei jeder Sportart darum das derjenige der mehr gewinnt aufsteigt.\nUnd derjenige der mehr verliert absteigt, wer unkonstant spielt steigt auf und ab, wie ein JoJo\n\n\n\nDer einzige unterschied ist, dass du bei TFT nur dich und das RNG blamen kannst.\nUnd nicht deine Teammates. (Und komischer weise denken gefühlt 90% der Spieler das die Teammates an ihrer Elo Schlud sind und immer schlechter sind als die im Gegnerteam, nur geht sich das rein rechnerisch nicht aus, können ja höchstens 50%)","replies":[{"poster":"Vorzüglich","date":"2019-08-03T21:52:09.242+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alustus,realm=EUW,application-id=trYhv8pL,discussion-id=kt4wxE2z,comment-id=0000000000010000,timestamp=2019-08-03T21:21:01.553+0000)\n>\n> Ich sehe nicht wo das Kluft System Ungrecht sein sollte, davon mal abgesehen hat das was du versuchst anzusprechen nichts mit Fairness zu tun sondern \n> \n> In der Kluft geht es nicht darum jemanden den aufstieg zu verwehren, wie kommst du auf diese Idee?\n> In der Kluft steigen sollten statistisch gesehen gleich viele aufsteigen wie in TFT.\n> \n> Ich weiß jetzt nicht wohin sich das ganze bei TFT noch entwickelt, aber wie gesagt können dort auch 6 Spieler verlieren und nur 2 gewinnen.\n> Es kann zwar auch sein das 5 gewinnen und nur 3 verlieren.\n> Aber ich denke dass am ende eher 50% gewinnen/verlieren, sprich genau so wie in der Kluft\n> \n> \n> Es geht wie bei jeder Sportart darum das derjenige der mehr gewinnt aufsteigt.\n> Und derjenige der mehr verliert absteigt, wer unkonstant spielt steigt auf und ab, wie ein JoJo\n> \n> \n> \n> Der einzige unterschied ist, dass du bei TFT nur dich und das RNG blamen kannst.\n> Und nicht deine Teammates. (Und komischer weise denken gefühlt 90% der Spieler das die Teammates an ihrer Elo Schlud sind und immer schlechter sind als die im Gegnerteam, nur geht sich das rein rechnerisch nicht aus, können ja höchstens 50%)\n\nErstmal ist nur LCS Sport, die normal Kluft ist eine Clownfiesta. \nDas mussen erstmal festhalten.\n\nDer rest ist für mich wie bereits gesagt mehr Thema, Spieldifferenzierung, RNG ist ein Mittel die spiele unterhaltsam zu halten.\nOhne ist TFT nicht denkbar oder möglich. \n\nHier lässt sich aber übers feinabstimmen streiten ja^^\n\nSchlecht ist das allgmeine Niveau. In der Tat.","replies":[]}]}]},{"poster":"Divin1ty","date":"2019-08-03T14:22:05.785+0000","up_votes":1,"down_votes":0,"body":"Jup.\nVorallem als Toplaner sammelt man schon öfters Tode durch Splitpush, early ganks und cheese.\nSieht auf dem 'Papier' sehr mies aus, aber du ziehst insane viele Ressourcen auf dich und dein Team bekommt im optimal Fall Drakes, Nash, Tower, killt die Gegner in der Unterzahl etc.\n\nWenn man nach Statistiken LP verteilen würde, würde man es einfach fördern das Leute sich nurnoch um KDA kümmern, auch mal mehrere Minuten nur den Jungle farmen um ja nicht zu sterben, oder einfach nur sinnlos Sidelane gehen.","replies":[]}]}]},{"poster":"DrakoDRK","date":"2019-08-03T20:11:52.136+0000","up_votes":1,"down_votes":0,"body":"Ich war iron 2 nach meiner Einstufung. Jetzt bin ich Silber 1 und stehe kurz vor Gold. Es hat in dem Spiel viel mit Nachdenken zu tun, welche Champs welche Bonus die geben und welche Items auf welchen Champs man macht um bis sicher Platz 4 oder 3 zu kommen. Ich bekomme wenn ich auf Platz 3 bin teilweise über 40 LP. Ich habe eine sehr gut MMR in TfT. Glück braucht man auch, aber muss auch seinen Kopf benutzen wenn man weiter kommen will.","replies":[]},{"poster":"Enderized","date":"2019-08-03T14:41:48.897+0000","up_votes":1,"down_votes":0,"body":"Ich habe schon für den 4. Platz 4LP verloren während n Kollege mit dem 5. in der gleichen Runde 7 LP bekommen hat...\n\nDas ist alles MMR abhängig-  und MMR müssen sich einpendeln","replies":[{"poster":"DekoDeko","date":"2019-08-03T14:49:32.531+0000","up_votes":1,"down_votes":0,"body":"Also läuft es darauf hinaus, desto schlechter du deine ersten Spiele abgeschlossen hast, desto leichter steigst du später auf?","replies":[{"poster":"RM Heartmeander","date":"2019-08-03T15:46:33.009+0000","up_votes":1,"down_votes":0,"body":"Nein aber TFT hat keine Divisionsbeschränkung, heisst du kannst als Bronze mit Gold spielen.\nUnd wenn der Goldspieler der einer der höchsten MMR hat 4ter wird, verliert er LP.\nDer Bronze hingegen hat so ne schlechte MMR, dass er als 4ter noch LP bekommt, weil er im Vergleich zum Rest ne viel schlechtere MMR hat und deswegen 4ter Platz gut ist.","replies":[]}]}]},{"poster":"DekoDeko","date":"2019-08-03T14:23:16.840+0000","up_votes":1,"down_votes":0,"body":"Ich spiele öfters mit einem Freund zusammen.\n\nWährend ich auf dem 4. Platz immer ca. 5 LP verliere, bleibt er bei +0 LP für den 5. Platz im selben Spiel.\nAlso kann es nicht an den anderen Spielern liegen.\n\nFür den 4. Platz bekommt er immer LP, währen ich LP verliere und das obwohl er einen höheren Rang hat.\nAlso kann es auch nicht am Rang liegen.\n\nWürde mich echt interessieren warum ich durchgehend weniger LP bekomme.\n\nDie Unterschiede zwischen uns sind bisher:\n-Ich hatte mehr Glück bei den ersten x Spielen während dem Einranken\n-Er hat mehr TfT gespielt als ich bisher\n-Er ist Gold I und ich bin Gold III","replies":[]},{"poster":"EzreallyTragic","date":"2019-08-03T14:16:39.357+0000","up_votes":1,"down_votes":0,"body":"sag das nochmal wenn du challenger bist","replies":[]},{"poster":"Alustus","date":"2019-08-03T14:09:00.518+0000","up_votes":1,"down_votes":0,"body":"> Irgendwie ist TFT Ranked noch derzeit zu leicht. Ich mein, man muss nur unter den Top 4 sein und schon krieg ich LP. Ist nicht wirklich herausfordernd.\n> \n\nHabe als Rang 3 auch schon punkte verloren(kann auch ein bug gewesen sein) und auf Rang 4 ist es keine seltenheit das ich punkte verliere.\nEs kommt auch immer darauf an gegen wen du spielst.\n\nAb einerm gewissen Punkt ist es nicht mehr so einfach unter die besten 4 zu bekommen.\nAuch ist TfT zwar sehr Luck basierend aber es ist ähnlich wie beim Poker, ein Profi wird in Summe viel mehr gewinnen als ein Anfänger.\n\nEin Sologesang wird bspw. in 8-9 von 10 Spielen immer einen besseren Rang haben als ich wenn ich mit/gegen ihn spielen würde.\nWobei wenn alle Spieler ähnlich gut sind der rng Faktor sicher höher ist, da du dort nicht mehr soviel mit Skill ausgleichen kannst.","replies":[]}]}