{"poster":"SirZeel","date":"2015-03-28T12:04:29.935+0000","title":"Comportamento [quasi] negativo","subforum":"Discussioni generali","up_votes":3,"down_votes":2,"body":"Premessa: non sono mai stato bannato, chat ristretto, ranked ristretto e in generale non ho mai ricevuto nessun tipo di penalit&agrave;.\r\nPer chi se lo chiedesse, la premessa non &egrave; atta a lustrarmi il Cassiodoro [grazie Luca Torelli per la forbita metafora], ma &egrave; anzi un motivo di demerito nei miei confronti.\r\n\r\nPremessa #2: il 90% dei match gioco jungler in normal.\r\n\r\nRecentemente mi &egrave; stato fatto notare che sono un giocatore non positivo, e ci&ograve; mi ha fatto non poco girare le pale [grazie Corki per la forbita metafora] visto che, come da premessa, non ho mai fatto niente per meritarmi una punizione. Cos&igrave; ho fatto una serie di partite per dimostrare a me e agli altri che io, in realt&agrave;, sono il giocatore che tutti vorrebbero come alleato e anche come avversario; colui che non ti flamma se sbagli perch&eacute; lui &egrave; il primo a sbagliare; quello che non quitta perch&eacute; ha perso partite anche 5v4 [dove il suo team era in 5]; colui che se non ha tutti e quattro i fiocchi d&#039;onore &egrave; solo perch&eacute; &egrave; troppo modesto per accettarli. Dopo detto tempo, i risultati sono apparsi molto chiari al sottoscritto e, si spera, appariranno chiari anche a voi ora.\r\n\r\n**- Flammo abbestia, ma non abbastanza.\r\n**Che vuol dire? Vuol dire che non insulto, non do del noob a nessuno, non dico di essere meglio degli altri, ma comunque riesco a flammare &quot;pacatamente&quot;, facendo intuire al mio interlocutore che il fine del mio discorso &egrave; che la mia superiorit&agrave; &egrave; evidente rispetto alla pochezza del suo stile di gioco. Ho l&#039;accortezza di non scadere mai nell&#039;insulto.\r\n\r\n**- Quitto i game anche al quarto minuto, ma evito i ban.\r\n**Di perdere le partite non mi interessa minimamente. Sono ben di pi&ugrave; i game persi che quelli vinti, per quanto mi riguarda, quindi la cosa non mi tange, ci sono abituato. Eppure, circa una volta a settimana, capitano situazioni che mi fanno arrivare l&#039;incazzatura da 0 a 100 in tre secondi netti; gente top che ancora non ha imparato a coprire il red mentre il jungler fa il blu [con Shaco jungler avversario, quindi invade 100%, con conseguente morte, perdita del red, blu e tutta la met&agrave; superiore della giungla]; persone che non leggono nemmeno la chat, non rispondono alle domande e non comunicano in generale e che quindi fanno fallire gank che da 2/0 vanno a finire 0/3; eccetera. Piccole cose che mi fanno salire il crimine ad una velocit&agrave; tale che ALT + F4 viene premuto prima ancora che io me ne renda conto. Anche qui, comportamento di merda [mio e loro], ma capitando di rado non &egrave; sufficiente a farmi bannare.\r\n\r\n**- Vado afk, ma risulto attivo.\r\n**Credo fermamente che le minacce siano la cosa pi&ugrave; stupida ed illogica che esista sulla faccia della terra. &quot;Fai X o io faccio Y&quot; non mi motiva per niente a fare X, perch&eacute; tu ancora non stai facendo Y e anche se lo facessi ormai il danno &egrave; fatto e non ho quindi pi&ugrave; motivo di fare X. Di conseguenza mi premuro di non minacciare nessuno di andare afk, ma semplicemente afk-farmo in giungla. Ho fatto perdere partite che di fatto erano vinte, ma ad un certo punto del gioco un team si &egrave; ritrovato 4v5 ed &egrave; stato sconfitto. Il sistema non mi rileva come afk e tante volte nemmeno gli avversari se ne rendono conto.\r\n\r\nDi esempi cos&igrave; ne posso fare ancora a bizzeffe, ma penso che ormai abbiate capito dove voglio andare a parare.\r\nIl punto &egrave; che ho imparato dov&#039;&egrave; il confine che non va superato per non ricevere punizioni, ed entro questi limiti posso fare come mi pare e piace, a discapito di chiunque.\r\n\r\nE questo &egrave; un comportamento di merda.","replies":[{"poster":"A Yordle ln Heat","date":"2015-03-28T12:09:20.508+0000","up_votes":3,"down_votes":0,"body":"Da le guide \"come iniziare a giocare\" e \"come muoversi appena arrivati\" sei passato a quelle \"come fare gli stronzi senza farsi bannare\"? :^)","replies":[{"poster":"SirZeel","date":"2015-03-28T12:15:15.801+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=CommonDotaPlayer,realm=EUW,application-id=MJVj50Jw,discussion-id=e9A3IW7U,comment-id=0000,timestamp=2015-03-28T12:09:20.508+0000)\n>\n> Da le guide \"come iniziare a giocare\" e \"come muoversi appena arrivati\" sei passato a quelle \"come fare gli stronzi senza farsi bannare\"? :^)\n\nÈ esattamente così, ma speravo sortisse l'effetto opposto.\nVisto che non sono capace di dare buon esempio, perlomeno sto cercando di evidenziare i comportamenti negativi da evitare.","replies":[{"poster":"A Yordle ln Heat","date":"2015-03-28T12:21:35.986+0000","up_votes":4,"down_votes":1,"body":"Beh, praticamente hai spiegato come infrangere le regole senza venire puniti.\nSe ora incontro gente tossica in team so a chi dare la colpa :^)","replies":[]}]}]},{"poster":"Frattaglia","date":"2015-03-28T14:36:56.500+0000","up_votes":2,"down_votes":0,"body":"Ad ogni modo, se hai paura di essere invaso, quando ti fai il rosso per prima cosa piazzati una ward nel cespuglio a banana dietro il buff, e poi ti trascini il tuo buff dentro il cespuglio laterale. \nPerlomeno hai visione delle tue spalle e il nemico non ha visione del buff a meno che non sia nel tuo stesso cespuglio.","replies":[]},{"poster":"Frattaglia","date":"2015-03-28T14:01:47.543+0000","up_votes":1,"down_votes":0,"body":"Sempre il solito SirLeez :P\n\n\nAd ogni modo, siccome conosco il tuo elo, è facile che i tuoi alleati siano nabbi e non ti coprano i buff, però se non glielo chiedi o ricordi è anche colpa tua eh.","replies":[{"poster":"SirZeel","date":"2015-03-28T14:03:13.847+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=e9A3IW7U,comment-id=0005,timestamp=2015-03-28T14:01:47.543+0000)\n>\n> Sempre il solito SirLeez :P\n> \n> \n> Ad ogni modo, siccome conosco il tuo elo, è facile che i tuoi alleati siano nabbi e non ti coprano i buff, però se non glielo chiedi o ricordi è anche colpa tua eh.\n\nNo no, io glielo chiedo eh.\nCristo, lo devo chiedere anche a Fox, figurati se non lo chiedo a Monsieur Baguette Le Bronze 4.","replies":[]}]},{"poster":"Nibbio Bianco","date":"2015-03-28T12:23:16.048+0000","up_votes":2,"down_votes":0,"body":"Zeel, pls, io mi fidavo di te, ieri con te ho giocato millemila partita, ed ora te ne esci dicendo che afkarmo in giungla per farmi sentire deplorevole davanti ai deplorevoli ç_ç voglio la mamma.","replies":[{"poster":"SirZeel","date":"2015-03-28T12:26:45.074+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IlRisotto,realm=EUW,application-id=MJVj50Jw,discussion-id=e9A3IW7U,comment-id=0003,timestamp=2015-03-28T12:23:16.048+0000)\n>\n> Zeel, pls, io mi fidavo di te, ieri con te ho giocato millemila partita, ed ora te ne esci dicendo che afkarmo in giungla per farmi sentire deplorevole davanti ai deplorevoli ç_ç voglio la mamma.\n\nTeam Yordle ftw.\n\nW Teemo jungler.\nW Lulu 1v1 Blitzcrank.\nW Easy Peasy Lemon Squeezy ambush victorisy.\n\nPerò ecco, il punto è proprio questo: si può fare una partita cazzona come quella di un team full Yordle insieme ad una squadra di premade, e che si vinca o perda le nostre risate ce le siamo fatte. Nessuno quitterà mai una partita del genere, nessuno afk-farmerà o trollerà in maniera \"civile\".","replies":[{"poster":"Nibbio Bianco","date":"2015-03-28T12:28:39.867+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SirZeel,realm=EUW,application-id=MJVj50Jw,discussion-id=e9A3IW7U,comment-id=00030000,timestamp=2015-03-28T12:26:45.074+0000)\n>\n> Team Yordle ftw.\n> \n> W Teemo jungler.\n> W Lulu 1v1 Blitzcrank.\n> W Easy Peasy Lemon Squeezy ambush victorisy.\n> \n> Però ecco, il punto è proprio questo: si può fare una partita cazzona come quella di un team full Yordle insieme ad una squadra di premade, e che si vinca o perda le nostre risate ce le siamo fatte. Nessuno quitterà mai una partita del genere, nessuno afk-farmerà o trollerà in maniera \"civile\".\n\npls, si chiamano \"trappoloni fabbriconi\", va bene? Ripeti con me Trappolone Fabbricone Trappolone Fabbricone Trappolone Fabbricone https://www.youtube.com/watch?v=HkEjEjGAczw","replies":[]}]}]},{"poster":"lucanomax1994","date":"2015-03-28T12:15:45.220+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"SirZeel","date":"2015-03-28T12:18:01.963+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RK Deathbringer,realm=EUW,application-id=MJVj50Jw,discussion-id=e9A3IW7U,comment-id=0001,timestamp=2015-03-28T12:15:45.220+0000)\n>\n> Il report per negative attitude è vivo e vegeto insieme al verbal abuse...solo gli altri sono inutili. In teoria potresti essere reportato per questo motivo.\n> Dio santissimo, è un gioco, divertiti e non rovinare il gioco agli altri porco zeus!\n\nForse non è chiaro il messaggio che sto cercando di dare.\nIl mio è un topic di avvertimento su comportamenti orribili [ludicamente parlando] che vanno evitati anche [e soprattutto] se non portano al ban.\n\nNon volevo far trasparire \"Rito ahaha io sono pro e inculo le regole come mi aggrada\", volevo anzi mostrare il mio cattivo esempio [che sto cercando di migliorare dacché me ne sono reso conto] per fare in modo che altri se ne rendano conto e migliorino il loro.","replies":[]}]},{"poster":"Jay Kenton","date":"2015-03-28T12:29:54.196+0000","up_votes":1,"down_votes":1,"body":"> Il punto è che ho imparato dov'è il confine che non va superato per non ricevere punizioni, ed entro questi limiti posso fare come mi pare e piace, a discapito di chiunque.\n\nIn verità è il segreto di Pulcinella, penso che da Gold in sopra lo sappiano tutti.\n\nC'è un motivo se in un mio video spiegavo che per flammare di meno di quanto si sia portati naturalmente bisogna essere creativi con le parole.\nEsiste una lista con tutte le parole bannate da LoL, è una lista sempre in aumento. Basta non pronunciare mai quelle parole, per esempio, ed il sistema (che è una macchina, al momento, che si basa su quanto ha imparato dal vecchio Tribunale) difficilmente ti riconoscerà come un giocatore da punire. Il sistema attuale è molto efficiente nel punire i giocatori, ma non i giocatori veramente furbi. Il vecchio Tribunale, per quanto magari lento e farragionoso, perlomeno non discriminava in base alla furbizia.\n\nIn merito all'afk farm non solo non è un comportamento veramente da punire, ma in determinate situazioni è anche la scelta strategica migliore in assoluto. Un campione sottolivellato è inutile, come del resto un top sottolivellato è inutile da gankare, specialmente in SoloQ.\n\nÈ una questione di mindset. Anche io considero i solo laner che spammano il ping \"aiutami\" come degli effemminati, ma oltre a metterli a conoscenza del mio punto di vista non è che loro ci possono fare molto se sono scarsi e smaniano di farlo sapere al resto del team.\nÈ come giocare a carte: ognuno di noi preferirebbe avere un Full in mano ma a volte si racimola qualcosa anche con la coppia di Assi.\n\nSulla copertura dei buff è una responsabilità tua. Hai sempre almeno il tuo personaggio, un 1 trinket, 1 support che siccome è un ovino andrà a piazzarsi nella parte inferiore del river fino al minuto 1:45. Hai già coperto 3 posti chiave che ti dicono quello di cui hai bisogno di sapere...\n\nSull'uscire dai game? Non ce n'è veramente motivo. Se la partita è andata in vacca e non ti interessa vincerla prova a fare giocate divertenti. La perderai lo stesso; almeno ti diverti.","replies":[{"poster":"SirZeel","date":"2015-03-28T12:59:47.794+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jay Kenton,realm=EUW,application-id=MJVj50Jw,discussion-id=e9A3IW7U,comment-id=0004,timestamp=2015-03-28T12:29:54.196+0000)\n>\n> In verità è il segreto di Pulcinella, penso che da Gold in sopra lo sappiano tutti.\n> \n> C'è un motivo se in un mio video spiegavo che per flammare di meno di quanto si sia portati naturalmente bisogna essere creativi con le parole.\n> Esiste una lista con tutte le parole bannate da LoL, è una lista sempre in aumento. Basta non pronunciare mai quelle parole, per esempio, ed il sistema (che è una macchina, al momento, che si basa su quanto ha imparato dal vecchio Tribunale) difficilmente ti riconoscerà come un giocatore da punire. Il sistema attuale è molto efficiente nel punire i giocatori, ma non i giocatori veramente furbi. Il vecchio Tribunale, per quanto magari lento e farragionoso, perlomeno non discriminava in base alla furbizia.\n> \n> In merito all'afk farm non solo non è un comportamento veramente da punire, ma in determinate situazioni è anche la scelta strategica migliore in assoluto. Un campione sottolivellato è inutile, come del resto un top sottolivellato è inutile da gankare, specialmente in SoloQ.\n> \n> È una questione di mindset. Anche io considero i solo laner che spammano il ping \"aiutami\" come degli effemminati, ma oltre a metterli a conoscenza del mio punto di vista non è che loro ci possono fare molto se sono scarsi e smaniano di farlo sapere al resto del team.\n> È come giocare a carte: ognuno di noi preferirebbe avere un Full in mano ma a volte si racimola qualcosa anche con la coppia di Assi.\n> \n> Sulla copertura dei buff è una responsabilità tua. Hai sempre almeno il tuo personaggio, un 1 trinket, 1 support che siccome è un ovino andrà a piazzarsi nella parte inferiore del river fino al minuto 1:45. Hai già coperto 3 posti chiave che ti dicono quello di cui hai bisogno di sapere...\n> \n> Sull'uscire dai game? Non ce n'è veramente motivo. Se la partita è andata in vacca e non ti interessa vincerla prova a fare giocate divertenti. La perderai lo stesso; almeno ti diverti.\n\nAnche questo commento non è molto coerente con lo spirito del topic che, mi pare ci sia bisogno di ricordarlo ancora, era un monito CONTRO i cattivi comportamenti, non a favore.\n\nIntanto, come tu stesso hai sottolineato nel mio quote, ho scritto che ho \"imparato\", non \"scoperto\", questo limite. Limite che come dici tu è ben conosciuto da diverse persone, quindi anche per questo non mi sentivo come se stessi divulgando chissà che nefandezza.\n\nTutte le giustificazioni e/o motivazioni che hai dato tu differiscono per l'intento anche se l'azione rimane la stessa.\nNon faccio \"il furbo\" per migliorare l'assetto della squadra, ma per innervosirla senza ricevere punizioni.\nNon andavo afk-farm per recuperare livelli e gold, andavo afk-farm per far perdere il mio team che, magari, stavo anche carriando.\nPer quanto riguarda la giungla non mi pare il caso di commentare, spero che noterai da solo gli evidenti buchi in quella logica.","replies":[{"poster":"Jay Kenton","date":"2015-03-28T20:04:20.067+0000","up_votes":1,"down_votes":0,"body":"Ma io non voglio seguire lo spirito del topic, erano solo una serie di considerazioni spurie, personalmente sono arrivato ad un punto di arrivare a sospendere il giudizio morale su alcune faccende.\n\nPer esempio, in uno di quei mini-documentari della Riot intervistavano un ex professional flamer, I Will Dominate, che diceva qualcosa tipo: \"La Riot mi ha insegnato che anche quando siamo sul web dobbiamo comportarci con l'educazione che useremmo dal vivo. Nessuno farebbe il maleducato con uno sconosciuto se lo vedesse di presenza, pertanto è giusto comportarsi educatamente anche online\".\n\nOra il punto è che questo non è vero, o perlomeno non sempre.\nQuante volte nel traffico stradale le persone più tranquille si abbandonano a comportamenti aggressivi e nervosi?\nE vogliamo parlare delle scuole superiori, ambiente penso frequentato da buona fetta dei giocatori giovani? Quanti di noi si sono sentiti dire che la loro era \"una classe di scalmanati\" ? E tutti quelli che abitano in una realtà particolare che devono dire?\nCi sono delle realtà in cui, nella vita di tutti i giorni, se non reagisci aggressivamente finirai per subire e basta. Penso che sia l'esatto opposto di quello che dice la Riot, è proprio perché fuori dal gioco se non \"reagisci\" vieni sottomesso che nel gioco si tende a reagire più del dovuto (ed in definitiva ad essere puniti).\n\nQuindi faccio un grosso distinguo tra il flame che nasce dalla frustrazione, che è più giustificabile, ed il vero e proprio \"negative attitude\".\nCi sono persone che entrano in gioco e bestemmiano senza motivo, prima ancora che i minions arrivino in lane. Non ne ho mai capito il motivo ma ho sempre pensato che se trovi il tempo di scrivere una bestemmia per esteso allora del gioco in sé te ne frega poco.","replies":[]}]}]},{"poster":"Elles93","date":"2015-03-28T12:19:37.760+0000","up_votes":1,"down_votes":3,"body":"Sì, è proprio un comportamento di merda, e il fatto che ne vada fiero non è una bella cosa.\nSaresti il tipico bersaglio su cui riverserei i miei report, a patto che tu faccia una delle suddette cose.\nSe invece vuoi addarmi e farmi vedere il meglio di te sarò ben felice di fare qualche draft con te ;)","replies":[{"poster":"SirZeel","date":"2015-03-28T12:21:33.890+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Elles93,realm=EUW,application-id=MJVj50Jw,discussion-id=e9A3IW7U,comment-id=0002,timestamp=2015-03-28T12:19:37.760+0000)\n>\n> Sì, è proprio un comportamento di merda, e il fatto che ne vada fiero non è una bella cosa.\n> Saresti il tipico bersaglio su cui riverserei i miei report, a patto che tu faccia una delle suddette cose.\n> Se invece vuoi addarmi e farmi vedere il meglio di te sarò ben felice di fare qualche draft con te ;)\n\n3/3 would not understand.\nPls rid aghen.","replies":[]}]}]}