{"poster":"HUEHUEHUEHUEHUEH","date":"2019-04-04T19:14:54.581+0000","title":"mi son rotto 2","subforum":"Discussioni generali","up_votes":3,"down_votes":5,"body":"Non mi interessa, mi sento in dovere di dire la mia. Finalmente dopo anni Mordekaiser verrà reworkato per la terza volta, tutto molto carino se non fosse che sono passati ANNI da quando è stato toccato l'ultima volta, sono passate patch su patch e nonostante fosse palese che necessitasse di un minimo buff, nulla non è stato tottato minimamente. Ho dovuto sopportare anni nella speranza che prima o poi venisse bilanciato, sin da quel disgraziato giorno in cui quel genio alla riot ha detto \"e se lo facessimo diventare un ADC???\", da allora ho dovuto sopportare ogni genere di ingiustizia e umiliazione, dai rework  incredibilmente sbilanciati di alcuni campioni ai buff insensati di altri. Porca miseria avete buffato Master Yi, e trasformato Nasus in un mostro inarrestabile, per non citare nemmeno quel cancro ambulante di Yasuo. E non si tratta solo di un problema di bilanciamento di statistiche ed abilità, ma persino di tutti quei fottuti 180+ bug che ha, non ne avete fixato nemmeno mezzo in anni. Non sono un esperto di ingegneria informatica, ma ci scommetto le palle che la maggior parte di quei bug era roba che non ci vorrebbe niente a sistemare, lo avete trascurato per negligenza, perchè non essendo un personaggio popolare non ci guadagnavate con le skin e quindi non valeva la pena spendere risorse per curarsene. E non ci pensate nemmeno a dirmi che non è vero, perchè a ben pensarci un paio di bug li avete risolti, quello che la W diventava invisibile se utilizzata simultaneamente all'abilità della protocintura, e quello di quel fantastico periodo in cui nella patch 8.7 a causa di un errore con le rune Shield Bash e Revitalize otteneva una quantità di guarigione e di scudo doppia rispetto al quantitativo normale. Questi sono bug estremamente gravi che però sono stati risolti immediatamente. Ma invece che mi dite di quello che l'autoattacco immediatamente successivo alla riattivazione della W non infligge danno? Avete una minima idea di quanti minion ho perso per questo bug del cazzo? e vogliamo parlare del fatto che il fantasma del drago è ritardato?  Il fottuto Ritardrago che non colpisce il bersaglio indicato, ne' se si utilizza il comando R ne' se si utilizza alt-click dx, e che talvolta resta immobile senza colpire niente? Ah ma certo era sicuramente più impellente sfornare quella merda di evento di cani vs gatti. Non ha proprio senso continuare a giocare in queste condizioni, sono stato sconfitto ripetutamente nell'ultimo periodo da giocatori che non avevano nemmeno un decimo dell'esperienza che ho io con Mordekaiser, ad esempio contro giocatori che han visto forse due video della nuova kayle, che con 10 misere partite giocate, nonostante perdano in corsia alla fine sono in grado di carryare un intero team. E non mi tirate di nuovo la storia del \"eh ma non è che possiamo buffare campioni a caso solo perchè qualche giocatore ce le chiede eh, è tutta una questione di bilancamento di gioco, non possiamo rischiare di dar vita a campioni troppo forti e sbilanciati\" perchè questa spiegazione mi poteva andar bene dopo un annetto, ma dopo tutto questo tempo non mi sta bene più, non dopo le ultime trovate: Sylas, Irelia, Nasus, sono campioni che possono fare esattamente quello che fa Morde ma 10 volte meglio, e ora avete buffato Mundo, e Garen, ecc ecc, con buff minori certamente (esempio di garen che ora ottiene fino a 50 difese con la seconda passiva) ed io come cazzo ci dovrei vincere contro? Sono forse ritardato io che con CENTINAIA di partite giocate con lo stesso campione perdo contro uno che ne ha giocate 27? Cioè, in corsia se perdo i miei avversari carryano il game perchè hanno pickato campioni OP, se invece per greazia del signore vinco io e li stompo, poi perdo il game perchè non posso carryare. Cazzo gioco a fare, a far ridere i polli \"ahah quello gioca mordekaiser ahah che ridere\" ma andate al diavolo. Bannatemi pure da sto forum, bannatemi perchè sapete che ho ragione da vendere, tanto non mi interessa, razza di truffatori.","replies":[{"poster":"Aurelion Shmoll","date":"2019-04-05T09:31:29.121+0000","up_votes":2,"down_votes":0,"body":"Oppure, come dice il grande saggio \n**Henrik \"Froggen\" Hansen **: Play what's strong and shut the %%%% up.\n\n:\\","replies":[]},{"poster":"MadGiorg","date":"2019-04-04T20:15:48.077+0000","up_votes":2,"down_votes":0,"body":"Dai non fare così... Anche a me piace mordekaiser nonostante lo abbia abbandonato per i motivi che dici tu... Però devi tenere duro! Tra poco sarà reworkato, si tratta di questioni di un mese massimo! Resisti e presto diventerà un campione sbroccato, fidati di me{{sticker:sg-kiko}}","replies":[{"poster":"Khail the Crow","date":"2019-04-05T11:17:37.896+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=MadGiorg,realm=EUW,application-id=MJVj50Jw,discussion-id=d33KkOAi,comment-id=0000,timestamp=2019-04-04T20:15:48.077+0000)\n>\n> Dai non fare così... Anche a me piace mordekaiser nonostante lo abbia abbandonato per i motivi che dici tu... Però devi tenere duro! Tra poco sarà reworkato, si tratta di questioni di un mese massimo! Resisti e presto diventerà un campione sbroccato, fidati di me{{sticker:sg-kiko}}\n\nPerò completamente diverso {{sticker:poppy-wink}}","replies":[{"poster":"LordTokimimo","date":"2019-04-05T22:03:07.401+0000","up_votes":1,"down_votes":0,"body":"Ma completamente diverso cosa.. Lo hanno detto che rimarrà sempre un temuto juggernaut con un qualche probabile sustain che darà scudi extra e recupero vita..., se togliessero tra l'altro tutte le spell da cima a fondo compreso passiva, non si chiamerebbe più il revenant di metallo, lo chiameremo il mega Pippone reworkata male","replies":[{"poster":"Khail the Crow","date":"2019-04-05T22:38:58.378+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=LordTokimimo,realm=EUW,application-id=MJVj50Jw,discussion-id=d33KkOAi,comment-id=000000000000,timestamp=2019-04-05T22:03:07.401+0000)\n>\n> Ma completamente diverso cosa.. Lo hanno detto che rimarrà sempre un temuto juggernaut con un qualche probabile sustain che darà scudi extra e recupero vita..., se togliessero tra l'altro tutte le spell da cima a fondo compreso passiva, non si chiamerebbe più il revenant di metallo, lo chiameremo il mega Pippone reworkata male\n\n---------------------------------------------------> SARCASM\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n--------------------------------------------------> YOUR HEAD","replies":[{"poster":"LordTokimimo","date":"2019-04-06T10:37:09.533+0000","up_votes":1,"down_votes":0,"body":"?","replies":[{"poster":"Khail the Crow","date":"2019-04-06T12:47:58.843+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=LordTokimimo,realm=EUW,application-id=MJVj50Jw,discussion-id=d33KkOAi,comment-id=00000000000000000000,timestamp=2019-04-06T10:37:09.533+0000)\n>\n> ?\n\nEsattamente.","replies":[{"poster":"LordTokimimo","date":"2019-04-06T18:58:51.237+0000","up_votes":1,"down_votes":0,"body":"ma che dici? riesci a parlare la nostra lingua in modo comprensibile?","replies":[{"poster":"Khail the Crow","date":"2019-04-07T09:19:11.073+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=LordTokimimo,realm=EUW,application-id=MJVj50Jw,discussion-id=d33KkOAi,comment-id=0000000000000000000000000000,timestamp=2019-04-06T18:58:51.237+0000)\n>\n> ma che dici? riesci a parlare la nostra lingua in modo comprensibile?\n\nCerto che ci riesco, curiosamente pensi che il problema non sia tuo.\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}]}]}]}]},{"poster":"LordTokimimo","date":"2019-04-05T22:18:43.165+0000","up_votes":1,"down_votes":0,"body":"Ma per favore,  ti lamenti di garen, nasus e mundo? Credo che ci sia qualcosa che non va... Se perdi contro di loro, semplicemente mi sa che devi rivedere un attimo, come funziona mordekaiser, perché le tue lamentele su danni e buff non hanno molto senso, garen per farti danno e tradare l'unico modo che ha e avvicinarsi... E quando lo fa 1 si vede perché carica sempre la q... Siccome poi ha un kit così vasto e differente per gli engage... Lol non capisco, pocchi sempre con la E, quando vedi che ti carica attivi q e W... E la rilasci quando se ne va, non vedo dove sia il problema, stesso vale per nasus mundo, primo item che ti fai a prescindere poi è rylai così impedisci magari ad un mundo di tradarti o a nasus di tradarti e andarsene senza prendere danni, comunque vabbè per il fatto dei bug poi... Ci sono vantaggi e svantaggi... Bug irrisolti che causano problemi e chi non... Mai notato che se fai terza Q e subito chiudi la w si rimuove l'animazione dell'attacco stesso? Quello mi sembra un vantaggio... O semplicemente la terza q che colpisce la gente mentre ti flasha via... Dai e non è neanche così sfigato come danni mordekaiser... Non so di che buff parli, cosa vorresti buffargli, l'unica cosa che bufferei io e la passiva, più durativa nei secondi prima di resetarsi.. Per il resto, ma oramai che serve tra poco  lo reworkano e sarà troppo bello. Non è per flammare o cosa, ma sai com'è sono otp morde... Lo uso praticamente.. Sempre? In ranked? E la mia lane che ci sia counter o op champ me la cavo se sono dove sono ora nello solo queue lo devo a mordekaiser... E al suo bellissimo kit e bug :), consiglio spassionale, se hai difficoltà in lane impara a frezzare le lane e sfruttare un potenziale gank o momento per tradare al meglio, senza subire tanti danni. Con questo o concluso  bro Buona fortuna!! {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"TiSbraco","date":"2019-04-05T16:36:08.477+0000","up_votes":1,"down_votes":0,"body":"E gioca altri champion, io ero main akali prima che venisse reworkata e questa qui \"nuova\" mi fa schifo ma ho iniziato a giocare altri champ","replies":[]},{"poster":"Bertrand Paradox","date":"2019-04-05T16:26:27.532+0000","up_votes":1,"down_votes":0,"body":"Quindi in pratica stai frignando perché non riesci a vincere? Sul serio? \"Gne gne mordekaiser fa schifo gne gne\". Se fa così schifo mi chiedo perché midmorde (youtube) stia portando l'ennesimo account da unranked a diamond. Eppure lui ci vince contro yi, kayle, yasuo.... \n\nUna delle cose positive delle teorie è che basta una singola eccezione e l'intera teoria non ha più validità, questo per dire che non importa se nel mondo ci fosse solo midmorde diamond main mordekaiser, perché significa che è possibile. Stai tranquillo che se inizi a fare l'otp yi non sali lo stesso\n\nPoi riguardo alle scelte della riot ne possiamo parlare in un post dove non ti lamenti di perdere completamente a caso {{sticker:zombie-brand-mindblown}}","replies":[]},{"poster":"Due spade","date":"2019-04-05T08:51:42.564+0000","up_votes":1,"down_votes":0,"body":"Perchè aiutare un campione che non ha gap closer, non ha cc, non ha mobilità, non ha escape (tranne se, vogliamo chiamar tale, quella usando la w contro i minion...). Un campione dove il suo familio è di un coglion assurdo che fa il cavolo che vuole, per non parlare di \"manovralo\".\nDi cosa ti lamenti dei bug poi?Dai come fai per qualche centinaio di volte che premento e rompendo a poco per la pressione la R, non si attiva neanche a pagarla per citarne una sola.\nDavvero, esagerato. °w°","replies":[]},{"poster":"chaoswarrior204","date":"2019-04-05T07:42:03.098+0000","up_votes":1,"down_votes":0,"body":"Io sinceramente ogni volta che trovo un otp mordekaiser (sia in team che contro) gli vedo fare 1 Vs 9 visto che nessuno ha idea di come giocarci contro. \nComunque abbi pazienza, il rework arriverà tra poco. \n\nP.s.: tutti i champion che hai citato sono tutto fuorché BROKEN a parte Kayle che infatti si sta beccando nerf in continuazione","replies":[]},{"poster":"V3LK0ZMAST3R","date":"2019-04-05T06:55:24.756+0000","up_votes":1,"down_votes":0,"body":"Fidati,sui champ \"dimenticati\" dalla community per gli otp é meglio se la riot non ci mette mano, io a distanza di quasi un anno sono ancora qua che bestemmio per il rework di aatrox.\nConcordo che su certi champ problematici un buffino qua e là ci dovrebbe essere, ma morde é sempre stato quel champ che a livello di wr non é mai stato messo così male. Certo magari qualche hp o punto di armor potevano anche provare ad aggiungerli, ma quel champ é problematico nel bilanciamento nel suo insieme. Per i bug invece nulla da dire,se ne sono totalmente fregati e quel drago é ritardato più dei bot.\nPer il carriare invece é una problematica legata all'influenza sempre maggiore del meta, non tanto a morde o quel paio di champ dimenticati dal mondo.\nPoi eh a perdere la lane può capitare a prescindere che tu abbia fatto 100 o 10000 game","replies":[]},{"poster":"Noc11","date":"2019-04-06T10:15:47.654+0000","up_votes":0,"down_votes":0,"body":"Tilterino il ragazzino {{summoner:13}}","replies":[]}]}