{"poster":"BashFancycoot","date":"2016-08-18T20:12:00.338+0000","title":"Änderung der Kritischen Treffer","subforum":"Champions & Gameplay","up_votes":5,"down_votes":2,"body":"Bahnbrechende Idee! RNG des Krits entfernen, aber wie? Ganz einfach:\r\n\r\nKrit Chance entfernen und sie als zus&auml;tzlichen Schaden bei AAs umwandeln. 30% Krit = 30% zus&auml;tzlicher Schaden abh&auml;ngig von der AD des Champions.\r\nNat&uuml;rlich weiterhin dieses Krit Symbol sowie die Einstufung des Krit beibehalten. \r\nWenn man es als on hit Effekt z&auml;hlen l&auml;sst, drehen einige Champions mit Guinsoos noch mehr durch als eh schon.\r\nWeiterhin ein Limit von 100% Behalten damit man es nicht ins endlose stacken kann.\r\nMein Vorschlag daf&uuml;r ist auch relativ Simpel. Ich nehme mal eines der &uuml;blichen Beispiele.\r\nGegner hat 1% Krit in Runen und Kritet im early einmal, nur ein einziges mal und BUMM! Tot, lane meist auch verloren durch RNG.\r\nW&uuml;rde es aber, wie bei meinem Vorschlag, zus&auml;tzlichen Schaden anrichten abh&auml;ngig von der AD, hat der Gegner nur 1% mehr Schaden bei jedem AA anstatt eine 1% Chance auf doppelten Schaden. \r\nDas ganze w&uuml;rde ADCs zu gute kommen da sie sicheren Schaden haben und nicht von Gl&uuml;ck abh&auml;ngig sind.\r\nDas ist etwas sehr st&ouml;rendes an Krit, dieses RNG.\r\nAber auch Champions wie Yasuo w&uuml;rden einen Tick l&auml;nger brauchen um durchzudrehen.\r\n\r\nAb 100% zus&auml;tzlichem Schaden richtet man dann 200% an, was das selbe ist wie mit 100% Krit Chance, nur mit dem Unterschied das es sicher ist und man nicht mehrere Krit Items kaufen muss um sicher Schaden anzurichten.\r\n\r\nNebenbei m&ouml;chte ich noch hinzuf&uuml;gen das das ganze eine Spontane Idee war und ich nicht alles bedacht habe, noch nicht.\r\nAber es w&uuml;rde ADCs definitiv etwas gutes tun da sie sich nicht mehr auf Gl&uuml;ck verlassen m&uuml;ssen oder erst nach dem 3. Item wirklich gut dabei sind.\r\nNach dem 3. Krit Item wohlgemerkt.","replies":[{"poster":"BigSnipe","date":"2016-08-20T22:53:32.461+0000","up_votes":2,"down_votes":1,"body":"Deine \"Idee\" ist bereits ingame...\nDas was du vorschlägst ist Ashes passive. Krit wurde ins Spiel gebracht um dem ADC die Möglichkeit zu geben auch ein wenig mehr spaß zu haben, denn als ADC haust du deinen DMG nur über die AA´s raus. Da das aber extrem langweilig über die zeit wird, wurde der Crit mit RNG hinzugefügt. So hat auch ein ADC seine highlights und momente in denen halt nichts kommt. \n\nEs gibt als ADC nichts besseres als den Gegner mit dem letzten Crit umzuhauen bovor er dich tötet. Da es unberechenbar ist, kann man auch den ein oder anderen Assassinen aus den Socken hauen. \n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"BashFancycoot","date":"2016-09-01T04:04:03.446+0000","up_votes":1,"down_votes":0,"body":"Jaein.\nAshe Passiv gibt ihr noch zusätzlich 10% und ist somit stärker als normal.\n\nDarüber hinaus ist RNG einfach, muss man ja sagen, scheisse.\nNur aus diesem Grund mag ich es nicht ADCs zu spielen die davon abhängig sind.\nMan sieht es ja an den Amor Pen Builds von Lcuian/MF, Krit wird erst später gebaut weil es im early nichts bringt.\nUnd später drehen die damit komplett durch weil ihr Schaden in die höhe schiesst wie eine Rakete ins All.\n\nMit der Änderung von Krit Chance in zusätzlichen Schaden, würde man Krit auch im early nutzbar machen und es ermöglicht einem selbst, \nleider aber auch den Gegnern, einschätzen zu können WIE und vorallem gegen WEN man kämpfen kann oder nicht.\n\nIch sehe bei meinem Vorschlag nur positives, insbesondre weil man damit Yasuo einen und Tryndamere einen Denkzettel verpassen kann.\nKeine Random Krits, kein \"unabsichtliches\" Lane winning und ein gewisses Counterplay.\nIch versteh nicht was ihr alle habt, ich find meine Idee super.","replies":[{"poster":"BigSnipe","date":"2016-09-02T01:15:33.136+0000","up_votes":1,"down_votes":0,"body":"**Ashes** passive ist nicht stärker, da der erste AA auf ein Ziel krittet nur dann wenn es schon eingefroren ist (w/r) sonst kannst du mit derm ersten AA nie kritten. Das ist besonders beim farmen mies.\n\n**RNG** ist ganz und gar nicht scheisse, denn es belebt das Spiel. Die standart Hyper-Carries ohne krit zu spielen wäre extrem langweilig. \n\n_Die Sache ist die:_\nDu magst kein RNG weil du es nicht einschätzen kannst.\nAlle anderen lieben einfach RNG, weil es einfach viele coole, lustige und emotionale Momente mit sich bringen kann. \nWarum denkst du wohl sind Spiele wie Poker, Roulette, Black Jack... so beliebt?\n\n> _Wenn du die Dinge nur aus deinem Standpunkt betrachtest, ist es schwer die Ansicht anderer Leute zu verstehen. _","replies":[{"poster":"BashFancycoot","date":"2016-09-02T05:20:53.823+0000","up_votes":1,"down_votes":0,"body":"Die Dinger sind beliebt wegen der Chance wahnsinnige Summen zu gewinnen und weniger wegen des Nervenkitzels.\nGlücksspiele ruinieren Menschen und RNG ist nichts anderes als ein Glücksspiel. \nSomit haste am Ende ein Spiel im Spiel, klingt doch toll ne?\n\nAber, da du RNG ja so feierst, wieso geben wir nicht allen anderen Champions auch noch eine X% Chance Schaden anzurichten?\nIst doch kein Nervenkitzel vorhanden wenn man durchgehend den selben Schaden macht ohne Chance mehr anzurichten!\nOder gar keinen!\nWir können ja auch beispielsweise Rengar weiterhin mit 20% Krit rumlaufen lassen und ihn 1k Krits an Weichnasen verursachen lassen!\nWeil, wie du so schön erwähnt hast, lieben die Leute ja RNG! \nAber auch nur die, die grad die glücklichen sind und den Positiven Effekt davon abbekommen.\n\nDu hast da ja so ein schönes Zitat eingebracht, darf ichs auch mal nutzen ja?\n\n\"Wenn du die Dinge nur aus deinem Standpunkt betrachtest, ist es schwer die Ansicht anderer Leute zu verstehen.\"\n\nAlso, ich kann mich daran erinnern das es anders ist aber egal.\nWas ich dir damit sagen will ist folgendes: \nDa du für RNG bist, scheinst du wohl die andren nicht zu verstehen die etwas gegen RNG haben.\n\nVersteh doch mal, wie man sich als ADC fühlt, wenn das Krit grad nicht kommt, obwohl man es dringend  braucht.\nOder wenn der Gegner es bekommt obwohl dieser nur 10~20% hat. Das ist einfach nur richtig, richtig mies.\nSie gewinnen, wegen Glück und nicht wegen ihres Könnens. \nUnd ein Spiel das pur PvP ist sollte nicht vom Glück abhängig sein.\n\nWenn es nicht geändert wird, spiel ich weiterhin Kog Maw mit meinem On hit Build. Sicherer, guter Schaden. \nJeder meiner Gegner hat ins Gras gebissen weil sein DMG viel zu spät kam. \nJa ja, die positiven Seiten des RNG... äh, was waren das noch mal für welche?\nAchja, Black Jack und \"Nervenkitzel\".","replies":[{"poster":"BigSnipe","date":"2016-09-03T18:42:03.976+0000","up_votes":1,"down_votes":0,"body":"Bei meinem ersten Post hab ich geschrieben, dass Riot den Krit drin lässt da es sonst langweilig wäre bestimmte ADC´s zu spielen. Das liegt daran das man AA´s nicht dodgen kann und es sonst auch kein Counterplay gibt um diese zu verhindern. Also hilft sich Riot mit Kritchance aus.\n\nRNG hat eine Positive Wirkung auf das Spielgeschehen, zuviel davon ist jedoch schlecht. Für dich ist es zuviel, für andere eben nicht. Hier muss man das akzeptieren was die Mehrheit will. \n\nDa ich main ADC bin, kenne ich das Gefühl von einem Rengare gecombot zu werden, oder ein Duell durch einen Lucky Krit zu verlieren sehr gut. Da ich aber mal auf der einen Seite, mal auf der anderen stehe macht es mir nichts aus.\n\n(ich hab nicht wirklich jemanden Zitiert, daher steht da auch keine Quelle. )","replies":[{"poster":"BashFancycoot","date":"2016-09-05T09:13:13.235+0000","up_votes":1,"down_votes":0,"body":"Was die Mehrheit will, interessiert mich nicht. \nIch hab meine eigenen Ideen und Vorstellungen.\nWenn die anderen darin was gutes sehn, ok, dann sollen sie es tun. \nEs wird immer mindestens einen geben der nicht dieser Meinung ist. \nAuch diese ewigen Beleidigungen nur weil einem der Vorschlag nicht gefällt sind unter aller Sau.\nMan zieht nur die Wut anderer auf sich und steht am Ende wie ein Vollidiot da, zurecht.\n\nArgumentieren, gegen argumentieren, so funktionieren Diskussionen und nicht \n\"ÖI, deine Idee find ick fohl scheissä. Geh ma sterbn ja?\" \nEin übertriebenes Beispiel meinerseits, aber so kommt es meistens rüber.\n\nIch würde nur zu gerne von einem der höheren positionierten im Forum sehen was sie von meinem Vorschlag halten.\nWenn sie dagegen sind, kann ich wohl nichts machen, außer vielleicht Riot direkt zu kontaktieren.\n\nEin einfaches klares Ja, der Vorschlag gefällt mir lässt sich umsetzen, oder das genau gegenteil davon genügt mir.\n\nKommunikation ist nicht so schwer wie man denkt, außer man denkt gar nicht oder zu viel.","replies":[{"poster":"BigSnipe","date":"2016-09-05T18:51:10.926+0000","up_votes":1,"down_votes":0,"body":"Kp warum du jetzt sowas schreibts aber k.\nWenn du etwas im Forum schreibts wirst du Meinung der mehrheit hören.\nIch kann mich nicht dran entsinnen das ich dich beleidigt hab, oder es jmd anderes in diesem Thema getan hat. \nIch hab dir Gründe aufgezählt warum Crit chance gut ist und du gast mir Gründe aufgezählt warum Crit chan´ce schlecht ist. Dann haben wir darüber diskutiert und keiner konnte den anderen überzeugen. \n\nDas ein Riotler antwortet bracht dieses Thema viel mehr upvotes und kommentare. \n\nDu kannst direkte Rückmeldungen an Riot unter dem \"Support\" reiter verfassen.","replies":[]},{"poster":"MisterFirstBlood","date":"2016-09-05T11:41:58.195+0000","up_votes":1,"down_votes":0,"body":"Solange es möglich ist 100% zu erreichen sehe ich da kein problem. du darfst dich halt seitens adc mit 80% crit nicht drauf verlassen das du auch nur 1x in 10 versuchen crittest und musst dich seitens Tank drauf einstellen dass du 5 1% crits hintereinander abbekommst. alles drüber hinaus sind boni.\n\ndu kannst dich als apc wie ahri auch nicht drauf verlassen das sie alle Spells trifft, klar das hat was mit eigenem skill zutun und nicht mit Glück aber du kannst nur mit den faktoren arbeiten die zur Verfügung stehen,  alles drüber hinaus ist umso besser für dich.","replies":[]}]}]}]}]}]}]},{"poster":"SF Pride","date":"2016-08-19T12:30:28.529+0000","up_votes":1,"down_votes":0,"body":"Das ist Mist. Wenn man Crit baut sollte man eben genau das Risiko haben, das du nicht Crittest. Stell dir eine Sivir vor die mit ihrer W an allen Champ sichere Crits verteilt? Wenn das so gerechnet werden würde, würden wir bald alle Champions mit Crit items rumlaufen sehen.","replies":[{"poster":"BashFancycoot","date":"2016-08-19T17:27:08.739+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OrangeBubble,realm=EUW,application-id=Wj1wcocU,discussion-id=fs5hE6sw,comment-id=000000000000,timestamp=2016-08-19T12:47:57.176+0000)\n>\n> Generell würden AD Assassinen in Mode kommen ^_^\n\nTun sie zum einen sowieso, zum anderen werden nur ihre AAs verstärkt und nicht ihre Skills da das kein AD ist was sie bekommen.\n\n> [{quoted}](name=bIoody Encore,realm=EUW,application-id=Wj1wcocU,discussion-id=fs5hE6sw,comment-id=00000000,timestamp=2016-08-18T22:21:05.858+0000)\n>\n> Crit Zed wird wieder in Mode kommen :D\n\nNein. Er muss ja AAs machen und davon meist nur einen in seiner ganzen Combo. \nMit dem jetzigen Krit wäre Zed viel besser da er mehr burst DMG dabei zur verfügung hat. Ganz anders sieht es aus wenn nur X% mehr Schaden bei einem AA macht, abhängig vom Item.\nZugegen, Klinge der Unendlichkeit kann ein Problem werden. \nJedoch lässt sich das leicht ausgleichen indem man den Krit DMG Bosst runtersetzt oder durch etwas anderes ersetzt.\n\n> [{quoted}](name=xD4rkskiill,realm=EUW,application-id=Wj1wcocU,discussion-id=fs5hE6sw,comment-id=0003,timestamp=2016-08-19T12:30:28.529+0000)\n>\n> Das ist Mist. Wenn man Crit baut sollte man eben genau das Risiko haben, das du nicht Crittest. Stell dir eine Sivir vor die mit ihrer W an allen Champ sichere Crits verteilt? Wenn das so gerechnet werden würde, würden wir bald alle Champions mit Crit items rumlaufen sehen.\n\nDu WILLST ein unverlässliches RNG haben? Spielst du überhaupt ADC? Klingt für mich eher dannach als hätten dir ADCs des öfteren die Rübe weggekritet und du dich darüber freust wenn sie es mal nicht getan haben und du gewonnen hast.\n\nNochmal: Es würden NUR AAs verstärkt werden. \nWie du z.B. einen Zed nur mit meiner Version des Krits spielst, \nmöchte ich nur zu gerne einmal sehen. \nDafür müsste man Infinity Edge und Essence Reaver bauen, wobei Essence Reaver nicht für Zed geeignet ist wegen Mana Passiv und Zed hat, wie wir alle wissen, kein Mana. Der Rest wäre Hurrican etc. wodurch man keinerlei AD bekommt.\nEinzig Tryndamere/Master Yi/Yasuo würden von diesen Items wirklich gut profitieren aber, das tun sie vom jetzigen Krit ebenfalls.\nDer Unterschied wäre nur das man im early nicht durch 2 Hits stirbt, sondern erst durch ein paar mehr.\n\nMein Vorschlag ist sogar GEGEN Snowballing und nicht so wie Crounty meinte das es dieses bestärkt.\nAn sich verstärkt man nur die AAs und nicht die Skills die mit AD skalieren wodurch es vielen Charakteren immer noch nicht stehen wird.\nOder Schon mal einen Atkspeed/Krit Zed gesehen? \nAber, dagegen brauch ich nicht mehr Argumentieren, \nDupree0991 hat dir bereits bei jeder Kleinigkeit wiedersprochen.\n\nBevor ich es vergesse: Mir ist doch eine Lösung für die Infinity Edge eingefallen.\nDiese 50% Krit DMG werden einfach nur ein wenig abgeändert und zwar so:\nZusätzlicher Kritischer Schaden wird erhöht, abhängig von dem vorhandenen zusätzlichen Schaden.\nSomit kann man dieses Item nicht alleine bauen und muss weitere dazu bauen um von dem Bonus zu profitieren.\nBei einem Limit von 100% zusätzlichen Schaden bekommt man weitere 50% durch den Effekt obendrauf, was dem jetzigen Krit Itembuild mit 100% Krit und zusätzlichem 50% Krit Schaden vollkommen übereinstimmt.\nIch hätte nicht gedacht das es so Simpel ist.","replies":[{"poster":"SF Pride","date":"2016-08-20T08:53:21.871+0000","up_votes":2,"down_votes":1,"body":"Das ist doch der Grund warum Krit so bleiben soll? high risk high reward. Es gibt btw ziemlich viele Adc's oder andere Champs deren Skills als AA Verstärkung zählen, und somit auch einfach jeden Treffer critten sollen? \nIch habe nichts dagegen das Adcs dadurch vielleicht sicherer sind, aber in jedem anderen Spiel ist Crit stark auf Zufall ausgelegt.","replies":[{"poster":"Bergelmir32","date":"2016-08-20T09:43:16.114+0000","up_votes":1,"down_votes":0,"body":"High risk high reward sollte etwas sein das man aktiv tut, etwas wofür man sich entscheidet und kein Würfel der im Hintergrund rollt und den Unterschied macht ob der Gegner noch weg kommt oder nicht, ob man den Gegner mit dem letzten AA noch tötet bevor er einen selbst töten kann etc.\nWeis auch nicht wo das Proplem sein soll wenn sie öfter kritten, ist ja nicht so als gäbe es irgendwelche Effekte die nur dann auftreten. Also, wo genau soll das Problem liegen wenn statt ab und an für 200% trifft, man immer für weniger Schaden trifft, so das es für alle Seiten verhersehbar ist was passieren wird?\nIst ja auch nicht so als würde Riot \"vielleicht, vielleicht auch nicht\" sonst wo unterstützen, siehe Dodge, Gangplank Ult, Kennen Ult und sicher noch einige andere. Sie haben zum 1. April sogar mal Patchnotes veröffentlicht wo TFs E statt jedem 4. Angriff eine 25% Chance bei jedem Angriff hatte zu triggern, was so ziemlich den momentanen Zustand von 25% Kritchance gleichkommt. btw war TFs W nicht auch mal zufällig und jetzt nicht mehr?","replies":[{"poster":"SF Pride","date":"2016-08-20T10:48:17.931+0000","up_votes":1,"down_votes":0,"body":"Tf's W war nie Zufällig, nur hat man die Reihenfolge der Karten damals nicht gesehen.Jetzt schon.\n\nWarum sollte high risk high reward etwas sein was zu 100% reward gibt und 0% risk? :D Crit soll zufällig bleiben einfach weil das das Prinzip von Crit ist. Crit items sind stärker in kombination mit anderen Crit items. Du kannst dir doch dann einfach 2x Phantomdancer, 1x Infinity Edge, 1x Essenzreaver dann haste doch deine 100% Crit. Was hält dich auf?","replies":[{"poster":"Bergelmir32","date":"2016-08-20T12:00:52.970+0000","up_votes":1,"down_votes":0,"body":"Krit sollte eben nicht high risk high reward sein (inwiefern es das überhaupt ist sei mal dahin gestellt) weil es keine Entscheidung ist die man als Spieler trifft, sondern eben einfach Glück oder Unglück.\n\nKrititems bleiben dann auch stärker in Kombination mit anderen Krititem, so wie jetzt auch.\nIch kann mir jetzt auch deine Ansammlung von Items kaufen und nun? Was willst du damit überhaupt sagen? Mit dieser Itemskombination hat man 0 Unterschied zwischen den beiden Varianten.\nDas das ganze eben kein Mist ist der nicht funktioniert sieht man an Ashe, die das bereits umsetzt.","replies":[{"poster":"Nohgolgh","date":"2016-08-21T00:22:32.666+0000","up_votes":1,"down_votes":0,"body":"Warum sollte Krit nicht high risk-high reward sein?\nEin Kombination aus Krit, Schaden und Angriffstempo liefert bereits ein gutes Scaling ins late. den Schaden konsistenter zu machen, bedeutet, einem adc früher ins late zu helfen. das muss nicht unbedingt sein. Im Wesentlichen wird ein großteil der Konsistenz von Krit erst mit dem zweiten oder dritten Krititem erreicht, was halt dazu führt, dass der adc erst im Late kommt. Die Armorpen-Builds leben davon, dass sie früher skalieren als die Critbuilds, aber halt zum Preis, dass sie am Ende schwächer sind. Kein adc würde mehr die Geistklinge bauen, wenn er die etwa 20% Mehrschaden gegen weiche Ziele auch dadurch konsistent erhielte, dass er mit der Klinge der Unendlichkeit 20% Crit bekommt. Außerdem würde das auch Champions wie Kog'Maw und Vayne extrem schaden, die viel mit on-hit-Effekten arbeiten. Deren Laningphase würde NOCH härter werden. ","replies":[]}]}]}]}]}]}]},{"poster":"haha weed lol xd","date":"2016-08-19T06:28:58.166+0000","up_votes":1,"down_votes":0,"body":"Dann würde jeder ADC dem Krit nicht steht total unterlegen sein / die anderen Items müssten gebufft werden um das zu kompensieren ( Trinity etc, Botrk )","replies":[{"poster":"Bergelmir32","date":"2016-08-19T11:17:34.639+0000","up_votes":2,"down_votes":1,"body":"Müssten sie? Warum genau? An ihrem mittleren Schaden ändert sich rein garnichts. Alles was passieren würde ist das man nicht aufeinmal einen Lucky Crit abbekommt sondern vorhersehbar mehr Schaden mit jedem AA statt zufällig und unvorhersehbar einen fetten Schlag mit irgendeinem AA.\n\nWenn ich 25% Krit hätte und dich in einem von 4 Treffern kritisch treffe mach ich dir 500% meines ADs als Schaden. Wenn jeder Treffer 25% mehr Schaden macht komme ich, oh Wunder, auch auf 500%.\nWo genau wären sie dann so unglaublich unterlegen? Nicht zu vergessen Ashe, die ja bereits genauso funktioniert und zwar grade gut dabei ist aber lange in der Versenkung verschwunden war, nachdem sie mit ihrem Q nicht mehr die Türme wegballern konnte. Warum war sie in all der Zeit nicht unglaublich Dominant, weil sie dieses System ja schon hat und sogar noch 10% extra frei Haus?","replies":[]}]},{"poster":"Zulwar","date":"2016-09-05T13:08:14.680+0000","up_votes":1,"down_votes":0,"body":"Mhm.\nOk, überlegen wir doch mal. Was ist Krit überhaupt?\n\nKrit ist für mich nichts anderes, als das man es geschafft hat, den Gegner an einer Stelle zu treffen, wo er besonders empfindlich ist und so mehr Schaden erleidet.\nWenn also krit ein Verstärkung wäre, würde man immer diese Stelle treffen, was für mich etwas unlogisch ist.\n\nWas sind denn Vorteile von Krit?\n\n1. Viel Schaden\n2. Wenig Geld benötigt\n\nWas sind denn Nachteile von Krit?\n\n1. keine große Kontrolle möglich\n2. Viel Geld benötigt\n\nNun vergleichen wir das ganze mal mit Magischen Schaden, der ja keine Möglichkeit hat zu kritten.\n\nChampions die auf Magischen Schaden setzen, sind sehr Fähigkeiten lastig und das verwenden von Autoattacks ist fast zu vernachlässigen.\n\nNun zurück zu AD-Champions, verwenden hautsächlich Autoattacks, besonders die Schützen, tragen dieses Merkmal, hier gibt es zwar auch Fähigkeiten lastige Champions, dies vernachlässigen wir aber erstmal.\n\nein normaler Autoattack, macht konstanten Schaden, dieser kann auf zwei Arten verbessert werden. Einmal durch die Durchdringung und durch den Krit.\nDie Durchdringung, sorgt dafür, das man konstant besseren Schaden verursacht und der Krit, gibt einem Schadenspritzen, die durch die Chance beeinflusst werden kann.\n\nWenn wir also den Krit nicht zufällig machen würden, würde wir 2x die Durchdingung haben, nur mit zwei Namen halt. Es gäb also keine Wahl mehr.\n\nJa gut die haben Magier auch nicht, denn diese können auch nur die Durchdingung mit ins Boot holen, dabei denke ich, liegt das daran, das der Fokus auf was ganz anderem liegt.\n\nSollte man nun also Krits entfernen?\n\nNein ich denke nicht, denn aktuell, ist der Krit nicht mehr so ganz zufällig. Riot hat hierzu nämlich Änderungen am Code vorgenommen, wodurch Krit weniger zufällig ist. Zum anderen, durch die Erhöhung der Chance, hat man die Möglichkeit, Einfluss auf den Krit zu nehmen.\n\nZum anderen finde ich, dass es nicht wirklich einen Unterschied zwischen Glück und Können gibt. Denn wenn wir kein Glück in diesem Spiel haben wollen, dürften wir es nicht spielen.\n\nDenn wofür brauchst du Glück?\n\n1. Krit\n2. Skillshots\n3. Timing\n\nDa das letzte nicht zu entfernen ist, finde ich ist es ok, wenn man dem Spieler die Wahl lässt ob er mehr \"Zufall\" haben möchte oder nicht.","replies":[{"poster":"BashFancycoot","date":"2016-09-07T02:06:19.049+0000","up_votes":1,"down_votes":0,"body":"Du nennst als Vorteil des Krits das es billig ist, aber gleichzeitig nennst du als Nachteil das es Teuer ist.\nHast wohl Schwierigkeiten dich zu entscheiden, was?\n\nMagische Angriffe können Kriten. Karthus, Ryze aber ein wohl eher passenderes Beispiel ist Corki mit seinen 50/50 AAs.\n\nIch habe nicht einmal, nicht ein einziges mal gesagt das Krit entfernt werden sollen. \nIch habe Lediglich einen Vorschlag ins Forum gestellt bei dem man das Krit anders berechnen/wirken lässt.\n\nFür sowohl Timing als auch Skillshots braucht man kein Glück.\nBeides ist vom Können abhängig. \nDenkst du etwa die in der LCS sind dort weil sie \"Glück\" haben ihre Skillshots zu treffen \noder gerade ein \"glückliches\" Timing erwischt haben um ihre Items zu aktivieren? \nKomm schon, das glaubst du doch wohl selbst nicht.","replies":[{"poster":"Zulwar","date":"2016-09-07T05:17:12.892+0000","up_votes":1,"down_votes":0,"body":"Ja Krit ist Billig, aber auch Teuer zu gleich.\n\nDenn um Kritchance zu bekommen, muss ich grade mal 400 Gold ausgeben um dann 10% Kritchance zu haben. Ich finde, dass das im Vergleich zu Durchdringung Billig ist, denn ich erhalte wenn es kritet den doppelten Schaden. Aber wenn man seine Kritchance verbessern will, muss man immer mehr Geld in die Hand nehmen. Dadurch wird es ziemlich teuer, weil halt sich der Schaden ja immer nur verdoppelt, gibt es keinen großen Vorteil mehr.\n\nOk, war mir nicht bekannt, das Magischer Schaden auch Kritet, weißt du zufällig, was für eine Chance man denn auf dem Krit hat?\n\nNaja, du hast Vorgeschlagen, das Krit nicht zufällig, sondern Konstant den Schaden anheben soll. Durch die konstante Anhebung, wird es dann genauso berechnet wie Durchdringung und ist somit dann nicht mehr existent.\n\nDoch für Skillshots brauch man Glück, denn wenn dein Gegner, den du mit einem Skillshot treffen möchtest, sich in die falsche Richtung bewegt, erwischt du ihn nicht, wodurch du Pech hast. Sicher kann man auch sagen, der Gegner hatte Skill, weshalb du nicht getroffen hast, aber im Prinzip ist das vom Gegner nur eine Entscheidung gewesen, die du nicht berücksichtigt hast.\nSomit hatte er Glück, das du den Skillshot nicht dort hin geschmissen hast, wo er hin ausweichen wollte und du hattest somit dann Pech, das er ausgewichen ist. Also reine Glückssache.\n\nIn einer gewissen weise ja. Denn wenn ich in der Lage bin, meine Trefferchancen zu erhöhen, habe ich somit mehr Glück. Aber die die in der LCS sind, haben noch weitere Faktoren, warum sie da sind. Da ist das treffen von Skillshots eher das geringste Übel.\nDas mit dem Timing ist sicher auch eine Glückssache, die man aber auch beeinflussen kann. Wenn ich natürlich alle Abklingzeiten der Gegner kenne und neben dem Spielen merken kann, kann ich dadurch mein Glück verbessern, das richtige Timing zu erwischen.","replies":[{"poster":"Bergelmir32","date":"2016-09-07T06:08:55.123+0000","up_votes":1,"down_votes":0,"body":">Krit ist für mich nichts anderes, als das man es geschafft hat, den Gegner an einer Stelle zu treffen, wo er besonders empfindlich ist und so mehr Schaden erleidet.\nWenn also krit ein Verstärkung wäre, würde man immer diese Stelle treffen, was für mich etwas unlogisch ist.\n\nIch kann jetzt auch 100% kritchance erreichen und treffe \"diese Stellen\" dann auch immer. Kein Argument.\n\n>Ok, war mir nicht bekannt, das Magischer Schaden auch Kritet, weißt du zufällig, was für eine Chance man denn auf dem Krit hat?\n\nDas dieses Beispiel hier überhaupt aufkommt ist absoluter Blödsinn. Ja sie können kritisch trefffen das hat allerdings 0 mit dem Krit über den wir hier reden zu tun.\nKarthus Q trifft kritisch immer wenn er nur 1 Ziel damit trifft, Ryze wenn er Q auf ein E markiertes Ziel trifft, Anivia E wenn ihr Ziel \"chilled\" ist und Corki wandelt die hälfte seines AA Dmg in mDmg um.\n\n>Doch für Skillshots brauch man Glück, denn wenn dein Gegner, den du mit einem Skillshot treffen möchtest, sich in die falsche Richtung bewegt, erwischt du ihn nicht, wodurch du Pech hast. Sicher kann man auch sagen, der Gegner hatte Skill, weshalb du nicht getroffen hast, aber im Prinzip ist das vom Gegner nur eine Entscheidung gewesen, die du nicht berücksichtigt hast.\nSomit hatte er Glück, das du den Skillshot nicht dort hin geschmissen hast, wo er hin ausweichen wollte und du hattest somit dann Pech, das er ausgewichen ist. Also reine Glückssache.\n\nSkillshots brauchen ein bisschen von beidem, aber bei Krits entscheidet sich eben niemand \"auch genau jetzt krite ich\" bzw. \"genau jetzt werde ich nicht gekritet\".\n\n>Nein ich denke nicht, denn aktuell, ist der Krit nicht mehr so ganz zufällig. Riot hat hierzu nämlich Änderungen am Code vorgenommen, wodurch Krit weniger zufällig ist. Zum anderen, durch die Erhöhung der Chance, hat man die Möglichkeit, Einfluss auf den Krit zu nehmen.\n\nVielleicht solltest du das ein bisschen weniger danach klingen lassen als ob diese \"Ändrung\" nicht bald 6 Jahre alt wird.\n\nEdit:\n>Aber wenn man seine Kritchance verbessern will, muss man immer mehr Geld in die Hand nehmen. Dadurch wird es ziemlich teuer, weil halt sich der Schaden ja immer nur verdoppelt, gibt es keinen großen Vorteil mehr.\n\nSagst du grad wirklich das der \"Vorteil\" den kritchance gibt immer weniger wird je mehr ich davon baue?","replies":[{"poster":"Zulwar","date":"2016-09-07T07:16:22.052+0000","up_votes":1,"down_votes":0,"body":"> Ich kann jetzt auch 100% kritchance erreichen und treffe \"diese Stellen\" dann auch immer. Kein Argument.\n\nDies war auch eher als Einstieg gedacht, als ich mir Gedanke machte, war dies das erste, was ich mich gefragt habe.\n\nOk, also reine Fähigkeiten basierte Krits. Dann lassen wir das mal weg. Aber im allgemeinen Zählt, magischer Schaden kritet nicht.\n\nOk, dann erkläre ich das mal genauer. Ich nehme dazu mein Beispiel wieder mit dem Skillshot und demjenigen, der ausweicht. Wir sind uns beide einig, das man für Skillshots Können und Glück benötigt. Bei Krits, habe ich auf eine etwas andere Art und Weise, aber die selbe Möglichkeit. Sicher kann ich nicht sagen, ich krite jetzt, aber ich kann durch das kaufen von mehr kritchance meine Lage verbessern. \n\nIch glaube, ich erkläre es mal anders. Wann kaufe ich Persönlich kritchance?\nIch kaufe Kritchance, wenn ich meine Fähigkeiten verbessern möchte. Ich spiele halt hauptsächlich Ashe, Cait und MF. Ashe und Cait auf Krit und MF auf Durchdringung.\nWarum?\nAuf Ashe und Cait, da ich durch Krit Ihre Passive verstärken kann. Bei Ashe ist es die Verlangsamung und ich meine auch den Schaden. Bei Cait nur der Schaden.\n\nDas ich damit auch noch Schadensspitzen erreichen kann, wird erst bei >=50% Kritchance erwartet.\n\nIch führe das mal weiter aus. Mein erstes Item z.b. ist in 90% der Fälle auf den beiden {{item:3085}}. Warum? Naja, bei Cait löse ich so nach 2 AA die Passive aus und bei Ashe, kann ich mit aktivieren der Q 5 oder 6 Ziele gleichzeitig Angreifen. Das bringt mir zwar keinen Schaden, dafür aber einen Waveclear des Todes.\n\nWie alt diese Änderung ist weiß ich nicht. Ich meine mindestens 3 Jahre zumindest.\n\n> Sagst du grad wirklich das der \"Vorteil\" den kritchance gibt immer weniger wird je mehr ich davon baue?\n\nRichtig. Denn wenn ich mir für 400g 10% Kritchance kaufe, habe ich statistisch alle 10 AA's 1x doppelten Schaden. Das heißt ich habe mir für 400g meinen Schaden verdoppelt. Es gibt kein anderes Item, das das kann zu dem Preis. Wenn ich nun aber meine Chance erhöhe, gebe ich mehr Geld aus. Bei 2 Items, wären das z.b. 800g aber ich machen trotzdem nur den doppelten Schaden. zwar habe ich rein statistisch nun alle 5 AA's dies, aber der Schaden ist immer noch der Selbe.\nNun nehmen wir Durchdringung. Es gibt leider kein reines Durchdringungsitem, von daher gibt es kein Gold Angabe, aber hier bekomme ich was gewinnbringendes. Wenn ich also ein Item kaufen würde, das mir nur Durchdringung gibt, erhöhe ich so meinen Schaden ein bisschen. Wenn ich nun dasselbe Item nochmal kaufe, mache ich noch mehr Schaden, wodurch es mir auf jeden fall was bringt. Dies ist bei Krit nicht der Fall.","replies":[{"poster":"Bergelmir32","date":"2016-09-08T06:42:15.133+0000","up_votes":1,"down_votes":0,"body":"Es hat schon seine Gründe warum ich geschrieben habe das die Änderung bald 6 Jahre alt wird.\n\nIst schön das du auf Ashe zu sprechen kommst, denn wie du ja eigendlich sicher wissen solltest als jemand der gerne mal Ashe spielt, hat sie bereits das hier vorgeschlagene System mit 2 kleinen Änderungen: das sie nur krited wenn der Gegner von Frost betroffen ist und 10% Schaden extra, frei haus oben drauf bekommt.\nCaitlyns Headshot skaliert übrigends auch linear mit Kritchance, also auch eher wie das hier vorgeschlagene System.\n\n>Richtig. Denn wenn ich mir für 400g 10% Kritchance kaufe, habe ich statistisch alle 10 AA's 1x doppelten Schaden. Das heißt ich habe mir für 400g meinen Schaden verdoppelt.\n\nNein. Einfach nur nein... du hast deinen Schaden damit um 10% erhöht nicht um 100. Wenn ich 10 AA a 100 Schaden mache habe ich 1k Dmg, wenn einer dieser 10 AA kritisch trifft mache er 200 Schaden also habe ich 1,1k Dmg und damit eine Erhöhung um 10%. Wenn ich 5 der 10 AA kritisch treffe habe ich 5 mal 100 + 5 mal 200 = 1500 Schaden gemacht und damit meinen Schaden um 50% erhöht.\n\nGenau da liegt der Punkt warum die hier vorgeschlagene Änderung überhaupt erst eine Möglichkeit ist. Auf lange Sicht gesehen ändert sie krit nicht. Der verursachte Schaden am Ende des Spiels bleibt so ziemlich gleich. Nur das, grade zu beginn des Spiels, nicht einer am Arsch sein kann, weil sein Gegner den Krit früh im Trade hatte und er den, wenn überhaupt, erst spät haben wird bzw bereits tod ist oder sich zurück ziehen muss. Stattdessen würde es übersichtlich und erkenntlich, so wie auf den anderen Lanes auch, so das alle Kontrahenten die Möglichkeit haben zu wissen wann sie einen Kampf eingehen können und wann nicht.\nUm bei dem Beispiel zu bleiben, mache ich dann 10 AA a 110 Schaden und komme ganz genauso auf 1,1k Dmg wie zuvor auch.","replies":[]}]}]}]}]}]},{"poster":"MisterFirstBlood","date":"2016-09-05T11:37:19.652+0000","up_votes":1,"down_votes":0,"body":"1%chance in 1% schaden umzuwandeln wäre broken. \ndann hättest du von nem crit Handschuh für 400g ne damage Erhöhung von 10% auch als melee und jeder bruiser etc würde goldeffiziente crit items wie PD kaufen. \n\nbei crit ist die harmonie mehrerer Items ausschlaggebend wenn du als adc IE, Statics und PD baust bist du bei 80%, \nwenn dir das immernoch zu RNG ist Bau halt noch nen reaver oder nimm crit Runen mit. optional verzichte komplett auf crit builds, dazu ist youmuus da.\n\nwären adcs auch nach einem item stark wären sie vergleichbar mit bruisern, die aber durch Level viel bessere stats kriegen als adcs. damit diese mithalten können kommt man um krit als RNG Faktor nicht drum herum, denn adc scale mit items und andere champs halt eher mit leveln.\nbeim triforce haben sie den crit ja schon rausgenommen weil die bruiser idr nur 1 item mit crit (triforce) gebaut hatten und der RNG Faktor für so einen breiten champ-pool ursprünglich nicht gedacht War","replies":[{"poster":"Bergelmir32","date":"2016-09-07T06:21:11.875+0000","up_votes":1,"down_votes":0,"body":">beim triforce haben sie den crit ja schon rausgenommen weil die bruiser idr nur 1 item mit crit (triforce) gebaut hatten und der RNG Faktor für so einen breiten champ-pool ursprünglich nicht gedacht War\n\nFür mich klingt es in den entsprechenden Patchnotes eher so als ob bei Triforce vorallem die Zauberklinge ausschlaggebend sei und man desshalb die Krit durch mehr CDR und AS ersetzt um eben diesen Fokus auf die Zauberklinge zu verstärken und nicht das Bruiser zu gut mit 20% Krit waren.","replies":[]},{"poster":"BashFancycoot","date":"2016-09-07T02:24:57.538+0000","up_votes":1,"down_votes":0,"body":"Nein, wäre es nicht weil, wie bei dem Beispiel das du gerade genannt hast mit den 400 Gold, kann man auch ein Langschwert kaufen und hat neben erhöhten Schaden bei den AAs auch noch etwas mit dem Skills skalieren können, sofern sie mit Bonus oder Gesamt AD skalieren.\nDamit 10% erhöhter Schaden den gleichen Effekt hat wie ein Landschwert benötigt man 100 AD.\nKosten effizient wäre es für Bruiser etc. keines wegs, außer sie haben einen bereits soliden AD Wert.\nJedoch, müssen sie für ein Krit Item einen Item Platz sozusagen, \"weglegen\". \nDadurch fehlt ihnen meist ein Tank Item oder ein anderes sehr viel nützlicheres Item.\n\nDurch meinen Vorschlag skaliert Krit nach wie vor mit andren Krit Items, es ist sogar zwingend notwendig diese zu holen andernfalls hat man keinerlei Vorteil davon außer diese, nehmen wir mal 30%, von einem Phantom Tänzer.\nZugeben, Phantom Tänzer wäre das wohl einzige Item das wirklich Broken sein kann und man auf Assassins etc bauen könnte.\n30% Mehr Schaden bei einem AA während man ca. 300 AD hat, tut schon weh. Das sind 90 Schaden obendrauf für gerade mal 2500 Gold.\nJedoch hat das eine Kehrseite. \nMan gibt 30% mehr Schaden bei AAs für 50~75 AD oder Tank/Durchdringung Items auf.\nFeste AD Skaliert mit den Skills, Krits tuen das nicht, außer der Champion hat eine eigene Skalierung dafür.\nUnd ich habe bei keinem Assassin eine Krit Skalierung gesehn, du etwa?\n\nMan bekommt mit deinen 3 Items zwar 80% Krit aber bedenke den Nachteil davon.\nKrit ist abhängig von der Gesamt AD des Charakters, \nein Phantom Tänzer und Statikks geben keinerlei AD, nur Krit Chance und Atks sowie spezielle Effekte.\nDarum ist es wichtig bereits AD zu haben bevor man auf Krit geht, deshalb sind diese \"Korean\" Builds so Effektiv.\nFrüh AD, später Krit.\n\nMit meinem Vorschlag lässt man Krit durchgehend effizient sein und nicht nur im Late game oder wenn es mal zufällig kommt.\nBedenke auch, das man für 100% Krit 4 Items benötigt. Dannach bleibt nur noch 1 Platz über für ein freies Item, außer man lässt die Schuhe weg.\nUnd als ADC benötigt man auch noch so etwas wie Lifesteal und Durchdringung, \nin manchen kritischen Situationen sogar ein stark defensives Item wie GA. \nMit der alten Meisterschaft bei der man 15% des Krit Schadens geheilt hat, war Lifesteal zu bauen nicht mehr nötig.\nJetzt wiederum schon. Wenn man aber mehr in Lifesteal etc.  investiert, bleibt für Krit nichts mehr übrig.\n\nHast du das mal bedacht?","replies":[]}]},{"poster":"Headbeatz","date":"2016-08-21T03:41:10.919+0000","up_votes":1,"down_votes":0,"body":"Macht das Nicht das Adc da sein aus ich weis nicht ob du adc oder sonst was spielst aber hast du nicht vergnügen daran wenn du mal der lucky boy bist? Genauso angepisst bist du zwar wenn er dich critet aber davor hat er wieder n gutes gefühl\nLoL ist nicht nur da um zu tryharden sondern auch Spaß zu haben und genau dies 1% crit sache die du des öfters erwähnst ist rein auf mathe bezogen eben nur jeden 100ten hit .. Und du hast es selber geschrieben es würde bei 25% auf das selbe hinauslaufen aber in aus meiner sicht einfach nur langweilig sein ich mein würden wir Adcs noch genau soviel spaß am spielen haben ohne crit =? dazu wenn ich dich richtig verstehe wäre dann PD einfach nur  ein botrk? wenn du nicht auf krit stehst solltest du vll einfach kayle spielen oder so ich meine die passen ca in das thema was du hier ansprichts kein luck sonder konstanten dmg output ohne jeglichen krit ..","replies":[{"poster":"BashFancycoot","date":"2016-09-07T02:27:33.659+0000","up_votes":1,"down_votes":0,"body":"Das kommt drauf an. Nur weil 1% dasteht heißt es nicht gleich das einer von 100 Hits kritisch ist.\nNaja, eigentlich schon, wenn es nicht mit RNG zu tun hat. RNG kann man nicht berechnen weil es RNG ist.\n\nPD wird nie wie Botrk sein, siehe AD das mit Skills skaliert, Lifesteal und einen On Hit Effekt.\n\nKayle spiele ich zwar nicht, dafür Kog Maw und Jhin. Gelegentlich auch Corki und MF, die letzten beiden aber seltener.","replies":[]}]},{"poster":"Crounty","date":"2016-08-18T21:02:39.802+0000","up_votes":1,"down_votes":4,"body":"Das bewirkt Snowball, weil die schwächeren Gegner weniger Chancen haben zu traden, wodurch Spiele einseitiger werden und genau das versucht Riot zu verhindern. RNG ist nun mal ein Risiko Ding, welches viel Erfolg bringen kann, aber auch viel Misserfolg. (Damit will ich sagen, dass das Ausmaß des Erfolgs und Misserfolgs den man durch RNG haben kann ungefähr gleich ist und es somit balanced ist). \n\nWenn man dein Krit System nimmt, wird man irgendwo anders rumgraben müssen und nerfen müssen (z.B base AD von allen Champs, Item gold noch mehr erhöhen und vieles mehr), weil dein Krit System nur Vorteile für den Spieler bringt und keinen einzigen Nachteil. \n\nD.h ein Spieler, der im early Game zufälligerweise einen Vorteil kriegt und er sich somit dein Krit kauft, wird er sehr wahrscheinlich das Spiel gewinnen, weil dieser ganz sicher mehr % an Schaden macht als der Gegner und der mit dem Vorteil jeden stompen wird und genau das versucht Riot zu verhindern (siehe XP changes nach dem Tod, Tower Gold changes, Dragon Rework, Sheen/Lich Bane changes etc.)\n\nDein Vorschlag passt zu Season 1/2, wo der Snowball noch unterstützt wurde, aber jetzt nicht mehr.\n\nFalls ich was falsches gesagt habe, bitte ich euch mich zu korrigieren.\n\nEdit: Außerdem möchte ich hinzufügen, dass diese Änderung die ganze Meta ändern würde, weil manche Champions, die auf Autoattacks basieren noch stärker wären und diese sozusagen die ADCs ersetzen würden, weil ADCs zum Beispiel zu squishy sind und viele andere Champions mit Schilden/Sustain stärker wären (siehe Riven, Master Yi ach du kacke, Nocturne, Xin Zhao, Rengar etc)","replies":[{"poster":"Bergelmir32","date":"2016-08-19T00:31:22.887+0000","up_votes":2,"down_votes":2,"body":">Das bewirkt Snowball, weil die schwächeren Gegner weniger Chancen haben zu traden,\n\nGenauso wie jedes andere Item das ich mir kaufe.\n\n>(Damit will ich sagen, dass das Ausmaß des Erfolgs und Misserfolgs den man durch RNG haben kann ungefähr gleich ist und es somit balanced ist)\n\nRiot hat nach und nach allen RNG aus LoL entfernt, weil Unvorhersehbarkeit und Zufall in Spielen dieser Art nicht gut sind aber an dieser einen Stelle soll es gut und Balanced sein? Wohl kaum.\n\n>Wenn man dein Krit System nimmt, wird man irgendwo anders rumgraben müssen und nerfen müssen (z.B base AD von allen Champs, Item gold noch mehr erhöhen und vieles mehr), weil dein Krit System nur Vorteile für den Spieler bringt und keinen einzigen Nachteil.\n\nWie bei allen anderen Items auch. Kein einziges Item bringt mir in irgendeiner Weise einen dem Item innewohnenden Nachteil. Auch keines der aktuellen Crititems. Der Einzige Unterschied ist das ich statt eines unzuverlässigen starken Vorteils nun einen zuverlässigen weniger starken Vorteil habe ohne den Mittleren Schaden dabei zu senken.\n\n>D.h ein Spieler, der im early Game zufälligerweise einen Vorteil kriegt und er sich somit dein Krit kauft, wird er sehr wahrscheinlich das Spiel gewinnen, weil dieser ganz sicher mehr % an Schaden macht als der Gegner und der mit dem Vorteil jeden stompen wird...\n\nAuch auf die Gefahr hin mich zu wiederholen: Wie bei jedem anderen Dmg Item das ich mir kaufe.\n\n>...und genau das versucht Riot zu verhindern (siehe XP changes nach dem Tod, Tower Gold changes, Dragon Rework, Sheen/Lich Bane changes etc.)\n>\n>Dein Vorschlag passt zu Season 1/2, wo der Snowball noch unterstützt wurde, aber jetzt nicht mehr.\n\nRiot versucht das nicht zu verhindern, sondern in ein gesundes Maß zu bringen. Firststone Gold bei Türmen stärker werdende Minions bei LvL und Towervorteil ... bringen snowball ins Spiel. Krit bringt jetzt schon snowball ins Spiel, so wie es das z.B. AD auch tut, nur unzuverlässiger.\n\nWie so oft unter diesem Vorschlag hab ich kein einziges Haltbares Gegenargument gefunden. Das Einzige und leider auch äußerst starke das ich kenne habe ich in dem identischen Thread den der TE erstellt hat geschrieben welches in etwa auch das ist was du in deinem Edit anreißt.\nAssassinen die wenige AAs machen hätten einen sicheren und ziemlich guten Dmg Boost durch einzelne Krititems im Vergleich zur äußerst unzuverlässigen und damit wenig lohnenden (im Vergleich zu anderen Alternativen) aktuellen Variante. In wie weit sich das auf AA lastige Bruiser auswirkt wäre auch einen genaueren Gedanken Wert.\n\nMögliche Lösungen wären es allen Schützen eine extra Passive wie die von Ashe zu geben oder die Krit-Items mit unterschiedlicher Wirkung für Ranged und Melee Champs, so wie andere Items das auch schon haben, auszustatten.","replies":[{"poster":"Crounty","date":"2016-08-20T13:03:14.577+0000","up_votes":1,"down_votes":0,"body":"Crit braucht man genau wegen der Zufälligkeit und diese wollt ihr entfernen.\n\nEs stimmt, dass Crit unzuverlässig ist und gerade weil es unzuverlässig ist und man das Spiel am besten spielt, indem man safe spielt, heißt es, dass man es am Anfang des Spiels gar nicht offensiv nutzen kann. Wenn du aber zu einem trade oder fight gezwungen wirst, hast du immer noch die Chance da Glück zu haben.\n\nAlso: Während du den Gegner nicht angreifen kannst und mit Sicherheit gewinnen kannst, kann der Gegner dich nicht mit Sicherheit angreifen, ohne den Trade zu verlieren.\n\nUnd das macht Crit mehr oder weniger zu einer defensiven Stat, zwar nicht, dass es dir hilft länger zu überleben, sondern dass es nur eine Bedrohung darstellt, wenn du defensiv spielst. Das heißt, dass Snowball nicht im traditionellen Weg genutzt werden kann.\n\nDieses 1% Runen Ding unterstützt auch diese Aussage, denn wenn Crit wirklich ein guter Stat in wenigen Mengen wäre, dann würden die meisten Spieler mehr als 1% Crit in deren Runen haben. Der Grund warum die Spieler nur 1% Crit haben ist, wenn diese plötzlich schlecht Traden, dass diese dennoch gewinnen können, wenn man Glück hat.\n\nDas sagt uns?\nDie Zufälligkeit von Crit gibt uns eine einzigartige Leistungskurve, die aus 3 Teilen besteht:\n\n1. Die aktuelle Nützlichkeit:\nSie ist linear: D.h bei 100% werden die anderen Leistungskurven den gleichen Punkt treffen.\n\n2. Bedrohung (aus der Sicht des Gegners):\nDie Bedrohung sollte immer aus der sicheren Seite betrachtet werden, d.h der Gegner geht davon aus, dass du mehr Crits treffen wirst, als du es statistisch tun solltest. Da ab einem bestimmten Punkt von 50-70% der Gegner denkt, dass du fast alle treffen wirst, ist die Kurve anfangs steil, wird aber sehr flach, um perfekt in die lineare Leistungskurve zu passen.\n\n3. Vorteil (aus der Sicht des Verbündeten):\nHier muss man auch vorsichtig sein, nur bist du der derjenige, der seine eigene Chance auf einen Tradewin ausrechnet. Im Gegenteil zur Bedrohung, denkst du bei 0-25%, dass du nie critten wirst, sodass die Leistungskurve anfangs flach ist, aber dann steil wird, sobald es zuverlässig wird und es auch perfekt in die 1. Kurve rein passt.\n\nD.h wir haben eine lineare, eine anfangs steile später aber flache kurve, die in die lineare passt und eine anfangs flache, dann steile, die auch in die lineare Kurve passt.\n\nhttp://www.copyshop-tips.de/img_sam/gammakorrektur.gif\n\nSo ungefähr sehen die Kurven aus.\n\nDieser Vorschlag passt in die ersten beiden Kurven, aber nicht in die dritte und wird auch nicht die subjektive Wahrnehmung der Stärke des Gegners und Verbündeten ersetzen.\nIch will nicht sagen, dass es nicht funktionieren wird, aber ich will nur wie vorher indirekt erwähnt sagen, dass diese Änderung einen viel größeren Einfluss in balance haben wird, als du denkst, vor allem wenn es ums Snowballen auf der Bot geht.\n\n> Riot hat nach und nach allen RNG aus LoL entfernt, weil Unvorhersehbarkeit und Zufall in Spielen dieser Art nicht gut sind aber an dieser einen Stelle soll es gut und Balanced sein? Wohl kaum.\n\nUnd dann haben sie vor wenigen Patches noch einen Dragon Patch released, der komplett auf RNG basiert, während unser Crit nur auf PRNG basiert, das auch noch mit der Begründung, dass mehr Decisionmaking im Spiel sein sollte (d.h ist der Dragon gut, kämpfst du um ihn, ist er schlecht, brauchst du ihn nicht) \n\nIch stimme dir zu, dass Zufall keinen zu großen Einfluss im Spiel haben sollte (stell dir vor eine Ultimate die zu 10% alle Spieler tötet), aber dennoch sollte es wie in jedem Spiel beinhaltet werden, da die Spieler sich auch an Glück und Pech anpassen können sollten, was sie auch im Verlaufe des Spiels definiert. Nehmen wir das Beispiel Vision: Du weißt nicht wo die Gegner sind und musst deswegen manchmal raten und somit deine Movements/Positioning anpassen, oder du weißt nicht wie Risikoreich es ist, den Baron/Drake zu machen: Das zählt auch mehr oder weniger zu RNG.\n\nAußerdem hat Riot nach und nach alle RNG aus LoL entfernt, bis es wieder Healthy war, so wie es jetzt gerade ist.\n\n\n> Wie bei allen anderen Items auch. Kein einziges Item bringt mir in irgendeiner Weise einen dem Item innewohnenden Nachteil. Auch keines der aktuellen Crititems. Der Einzige Unterschied ist das ich statt eines unzuverlässigen starken Vorteils nun einen zuverlässigen weniger starken Vorteil habe ohne den Mittleren Schaden dabei zu senken.\n\nIch gebe zu, ich hab da nur Bockmist geschrieben.\n\n> Wie so oft unter diesem Vorschlag hab ich kein einziges Haltbares Gegenargument gefunden. \n\nIch hoffe ich befriedige dich jetzt mit dieser Aussage.\n\n> Riot versucht das nicht zu verhindern, sondern in ein gesundes Maß zu bringen. Firststone Gold bei Türmen stärker werdende Minions bei LvL und Towervorteil ... bringen snowball ins Spiel. Krit bringt jetzt schon snowball ins Spiel, so wie es das z.B. AD auch tut, nur unzuverlässiger.\n\nDa stimme ich dir auch zu. Crit ist zwar unzuverlässig, muss aber nicht schlecht sein, außerdem hilft es auch den Snowball zu dämmen, da ein Team, das behind ist mehr oder weniger in der Lage ist das Snowballende Team zu fighten. Außerdem macht es das Spiel spannender, da von der einen Minute zur anderen plötzlich das andere Team die oberhand gewinnt, obwohl es Anfangs am verlieren war.\n\n> Mögliche Lösungen wären es allen Schützen eine extra Passive wie die von Ashe zu geben oder die Krit-Items mit unterschiedlicher Wirkung für Ranged und Melee Champs, so wie andere Items das auch schon haben, auszustatten.\n\nIch möchte nicht auf mögliche Lösungen/Nerfs etc. eingehen, da dieses Thema für mich zu groß ist um darauf einzugehen. War auch mein Fehler vorher darauf einzugehen.\n\n--------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nNun, RNG Crit ist immer noch da und das aus dem Grund, weil es um das Decisionmaking geht, welches du hast. Du kannst nicht einen fight verlieren und die Schuld auf Crits RNG schieben. Es ist deine Schuld, dass du auf den fight eingegangen bist, vorallem weil bei niedriger Crit Chance, die Chance dass du mehrmals crittest sehr niedrig ist.\n\n\nEin weiteres Beispiel: Nehmen wir an wir haben Cait gegen Ezreal. Cait crittet den Kopfschuss an Ezreal, sodass Ezreal sich dazu entscheidet nicht zu engagen, weil er weiß, dass er ab diesem Punkt verlieren wird. Also sniped er die Caitlyn mit ein paar Q's und geht wieder rein, sodass der fight wieder even ist. Ezreal macht einen auto attack, genau wie Cait, aber nur Ezreal crittet und das sieht Cait. Sie würde einen direkten AA fight verlieren, außer sie hat Glück. Also kann sie entweder entscheiden, abzuhauen, ihn outplayen oder so ausspielen, dass sie hofft sie würde ihn out DPSen.\n\nSpäter crittet Cait ihn und hat nun die überhand.Versucht Ezreal weiter zu fighten? Läuft er weg? Wird Caitlyn ihn chasen, wenn er läuft?\n\nDas ist sehr viel Gameplay.\n\nWenn das jetzt nur mit Crit ohne RNG wäre, würde der fight immer gleich ausgehen, wenn sich die Spieler den Umständen bewusst sind. Deswegen ist Crit da, um solche Stagnation zu verhindern.\n\nDas kann man auch mit Schach vergleichen: Es ist ein schönes balanciertes Spiel, aber es gibt dort kein RNG und dadurch gibt es Strategien die immer besser sind als die anderen. Mit RNG wäre alles wieder durchmischt, sodass die \"Chance\" auf einen Win bei beiden gleich wäre.","replies":[{"poster":"Bergelmir32","date":"2016-08-20T13:39:10.600+0000","up_votes":1,"down_votes":0,"body":"Bitte? Jetzt soll eine 1% Krit Rune defensiv sein weil man vielleicht und möglicherweise den Crit nicht nur gegen einen Minion macht, sondern in einem Trade auf den Gegner? Das ist spätestens dann Blödsinn wenn der Gegner auch 1% Krit hat und in dem Trade auch seinen Krit macht. Auf die Furcht das er seinen Krit macht kommt die Hoffnung das ich auch meinen Krit mache.\n\nIch mag kein Mathe Ass sein aber sollte die aktuelle Nützlichkeit sich nicht auch an den aktuellen Gegebenheiten orientieren und nicht an irgendwann wenn ich 100% habe?\nMeine Chance mit 1% offensiv rein zu gehen, meinen Krit zu machen und zu gewinnen ist genauso groß wie seine Chance mit mit ebenfalls 1%.\n\n> Und dann haben sie vor wenigen Patches noch einen Dragon Patch released, der komplett auf RNG basiert, während unser Crit nur auf PRNG basiert, das auch noch mit der Begründung, dass mehr Decisionmaking im Spiel sein sollte (d.h ist der Dragon gut, kämpfst du um ihn, ist er schlecht, brauchst du ihn nicht) \n\nDesshalb mögen viele diese Änderung auch nicht. Abgesehen davon kommt hier Zufall -> Entscheidung, bei Krit dagegen hat man Entscheidung (rein gehen oder nicht, ich müsste gewinnen wenn ich jetzt rein gehe) -> Zufall (oh verdammt jetzt hat er seinen Lucky Crit gemacht).\n\n> Außerdem willst du mir sagen, dass Riot das Spiel so vorhersehbar machen soll, dass du schon von Anfang an weißt, dass du verlieren/gewinnen wirst? Das würde mir jedenfalls keinen Spaß machen.\n\nWillkommen in jeder anderen Lane und jeder anderen Rolle außer ADC. Willkommen bei jedem anderen Item und jeder anderen Mechanik außer Krit.","replies":[{"poster":"Crounty","date":"2016-08-20T14:26:30.102+0000","up_votes":1,"down_votes":0,"body":"> Bitte? Jetzt soll eine 1% Krit Rune defensiv sein weil man vielleicht und möglicherweise den Crit nicht nur gegen einen Minion macht, sondern in einem Trade auf den Gegner? Das ist spätestens dann Blödsinn wenn der Gegner auch 1% Krit hat und in dem Trade auch seinen Krit macht. Auf die Furcht das er seinen Krit macht kommt die Hoffnung das ich auch meinen Krit mache.\n\nDann gibt es immer noch die Chance, dass er dir einen zweiten Krit gibt und dann schnell disengaged, sodass du den Trade verloren hast. \n\n> \n> Ich mag kein Mathe Ass sein aber sollte die aktuelle Nützlichkeit sich nicht auch an den aktuellen Gegebenheiten orientieren und nicht an irgendwann wenn ich 100% habe?\n> Meine Chance mit 1% offensiv rein zu gehen, meinen Krit zu machen und zu gewinnen ist genauso groß wie seine Chance mit mit ebenfalls 1%.\n\nKlar ist die Kurve nicht ganz Linear, sondern wird an den Umständen angepasst. Z.B ist sie bei ADCs steiler wegen AD, as multipliziert mit crit etc.\n\n> Willkommen in jeder anderen Lane und jeder anderen Rolle außer ADC. Willkommen bei jedem anderen Item und jeder anderen Mechanik außer Krit.\n\nNehmen wir 2 Champions mit der höchsten Winrate, die auch gleich stark sind. Woher willst du vor dem Spiel schon wissen, dass der eine gewinnen wird? Ich meine klar, es gibt picks da kannst du dir denken das Spiel ist gewonnen/verloren das kann man auch nicht verhindern, aber du kannst das noch lange nicht bei jedem einzelnen Matchup machen.\n\nPs: Hab oben meinen Post bearbeitet ohne zu sehen, ob du schon geantwortet hast (hab nicht mit deine Antwort gerechnet), könntest du dir den bitte wieder durchlesen, weil ich nicht weiß, was du gelesen hast und was nicht? Ab da wo die Zitate beginnen.","replies":[{"poster":"Bergelmir32","date":"2016-08-20T16:00:32.254+0000","up_votes":1,"down_votes":0,"body":">Nehmen wir 2 Champions mit der höchsten Winrate, die auch gleich stark sind. Woher willst du vor dem Spiel schon wissen, dass der eine gewinnen wird?\n\nGarnicht, das weis man jetzt nicht und das weis man anders nicht. Aber es geht ja auch garnicht um das gesammte Spiel, sondern um einen Trade einen Fight. Überall sonst kann ich mir anschauen wie viel Schaden ich mache, auf den exakten Wert. Anhand von Items, Typischen Skillungen und schlicht Erfahrung kann ich auch relativ genau sagen wie viel Schaden der Gegner mir macht und weis so das ich den Kampf gewinne oder verliere. Natürlich kommt dann noch das mögliche Verfehlen etwaiger Skillshots aber das liegt in der Hand der Spieler nicht in der eines Würfels.\nDas geht überall auf jeder Lane mit jedem Item außer Krit kommt ins Spiel. Bei höheren Werten wird der Unterschied logischerweise immer geringer aber grade am Anfang bei kleinen Werten kann das alles bedeuten. Einer von beiden hat Glück und macht seinen Krit und der andere Unklück, macht keinen und muss von da an defensiv sehr viel defensiver spielen. Jetzt muss er CS aufgeben, vielleicht sogar XP und das soll weniger Snowball sein sein als jeder weis was passiert (so wie überall sonst auch)?\nÜberall sonst wenn ich meinen Trade verliere habe ich entweder einen Fehler gemacht, misplayed oder wurde outplayed, nur bei Krit kann der Würfel schuld sein.\nDu hast ja auch völlig Recht das die Ashe Variante auch snowballed, so wie jedes Item und jeder Stat den man mehr hat als sein Gegner hat snowballed aber definitiv wäre das nicht mehr als es das jetztige System auch ermöglicht, nur das ich es vorhersagen kann und nicht am Einarmigen Banditen ziehen und hoffen muss.\n\n> Dann gibt es immer noch die Chance, dass er dir einen zweiten Krit gibt und dann schnell disengaged, sodass du den Trade verloren hast. \n\nUnd vielleicht fällt ein riesiger Stiefel vom Himmel und schickt meinen Gegner zurück zum Brunnen. Jetzt kommen wir schon in sehr spekulative Bereiche. Jetzt könnte ich sagen das ich vielleicht grad noch einen AA hinter ihm her schicken kann der dann auch kritisch trifft.\nDas ist wie der Witz mit dem Bootsschein, wo der Prüfer immer größere Stürme hervorzaubert und der Geprüfte immer größere Anker.\n\nWelcher Drache kommt und Krit sind andere Instanzen von Zufall. Man schaue sich Starcraft an. Ich kann Glück haben und den gegnerischen Proxy finden, ich kann Pech haben und sein Opening kontert meines und das Spiel ist in unter 10 Minuten vorbei aber meine Einheiten machen nicht vielleicht und vielleicht auch nicht doppelten Schaden. Wie bereits gesagt der Unterschied zwischen eine Entscheidung auf ein Zufälliges Ereigniss treffen und eine Entscheidung treffen die dann von Zufall zerstört wird.\n\nVision hat nichts mit RNG zu tun. Ich habe keine Vision außer einer der Spieler hat an Stelle XY ein Ward gestellt. Wenn ich Jungler+ weitere Gegner nicht sehe ist das Risiko hoch sehe ich sie weit entfernt ist es das nicht. Stimmt schon, da gibt es gewisse Übereinstimmungen aber bei geringen Kritchancen ist das Risiko eben gering und dann wird man vom Würfel ge... macht der Würfel Liebe mit einem.\n\n>Da stimme ich dir auch zu. Crit ist zwar unzuverlässig, muss aber nicht schlecht sein, außerdem hilft es auch den Snowball zu dämmen, da ein Team, das behind ist mehr oder weniger in der Lage ist das Snowballende Team zu fighten. Außerdem macht es das Spiel spannender, da von der einen Minute zur anderen plötzlich das andere Team die oberhand gewinnt, obwohl es Anfangs am verlieren war.\n\nDas liegt nicht daran das einer im Team einen Krit hat oder nicht. \n\n> Nun, RNG Crit ist immer noch da und das aus dem Grund, weil es um das Decisionmaking geht, welches du hast. Du kannst nicht einen fight verlieren und die Schuld auf Crits RNG schieben. Es ist deine Schuld, dass du auf den fight eingegangen bist, vorallem weil bei niedriger Crit Chance, die Chance dass du mehrmals crittest sehr niedrig ist.\n\nNatürlich kann ich. Wenn ich gewonnen hätte, hätte keiner nen Krit gehabt, jetzt hat aber der Gegner einen gehabt und ich nicht, dann liegt das natürlich am Krit. Die Chance das überhaupt mal einer nen Krit macht sind niedrig bei geringer Critchance, weis ja nicht ob du das mit 1% Krit mal getestet hast, ich hab es.\n2 ADCs begegnen sich beide gleiche Kritchance aber einer hat Pech und stirbt der andere Glück, hatte mehr Krits und lebt. Wenn man dem folgt was du sagst dürften Spieler mit krit sich garnicht mehr angreifen außer sie haben nahe 100% weil sie immer den kürzeren ziehen könnten.\n\nDas Cait Ez Beispiel ist schön und gut aber das es ohne Crit immer gleich ausgeht ist schlicht nicht wahr. Dazu müsste Ez seine Qs immer gleich treffen bzw beide ihre Fähigkeiten immer gleich treffen immer an den selben Stellen traden und Poken, die Minions müssten sich immer gleich verhalten etc etc etc.\nLoL ist kein Schach, beide Seiten gehen mit unterschiedlichen Vorraussetzungen ins Spiel. Wenn einer keine Läufer und stattdessen 4 Türme hätte und der andere keine Türme stattdessen weitere Springer vielleicht aber so ist das kein guter Vergleich.","replies":[{"poster":"Crounty","date":"2016-08-20T16:41:36.722+0000","up_votes":1,"down_votes":0,"body":"> Überall sonst wenn ich meinen Trade verliere habe ich entweder einen Fehler gemacht, misplayed oder wurde outplayed, nur bei Krit kann der Würfel schuld sein.\n\nNiemand zwingt dich zu traden, das ist, was ich die ganze Zeit versuche zu erklären. Zum Decisionmaking gehört nun mal auch sich dazu zu entscheiden zu kämpfen oder nicht zu kämpfen. Wenn du dich dazu entscheidest zu kämpfen und den trade verlierst, kannst du nicht dem Crit die Schuld geben, weil du dich entschieden hast zu kämpfen.\n\n> Einer von beiden hat Glück und macht seinen Krit und der andere Unklück, macht keinen und muss von da an defensiv sehr viel defensiver spielen. Jetzt muss er CS aufgeben, vielleicht sogar XP und das soll weniger Snowball sein sein als jeder weis was passiert (so wie überall sonst auch)?\n\nDann hast du dich dazu entschieden zu traden und hast diesen verloren, im späteren Verlauf, kannst du wieder das Risiko eingehen und den Trade durch crit sogar gewinnen. Aber die Schuld liegt immer noch bei dir, da du dich dazu entschieden hast zu traden, obwohl du gesehen hast, dass der Gegner crit hat\n\n> Wie bereits gesagt der Unterschied zwischen eine Entscheidung auf ein Zufälliges Ereigniss treffen und eine Entscheidung treffen die dann von Zufall zerstört wird.\n\nvom Zufall beeinflusst*\nSkill/Decisionmaking beinhaltet nun mal auch, damit zu rechnen, wie ein Trade mit Crit verläuft\n\n> Das liegt nicht daran das einer im Team einen Krit hat oder nicht.\n\nDurch Crit kann man sowohl gewinnen als auch verlieren.","replies":[{"poster":"Bergelmir32","date":"2016-08-20T17:55:24.417+0000","up_votes":1,"down_votes":0,"body":"Natürlich ist der Krit schuld. Wenn ich ohne eine RNG basierte Mechanik gewinnen würde und das es eine RNG basierte Mechanik ist hast du bereits zugegeben, und mit der RNG basierten Mechanik verliere, dann ist die RNG Mechanik schuld, weil Logik.\n\nWenn ich nen Early game Champ habe und gegen einen Late Game Champ spiele, werde ich natürlich nicht gewzungen den Trade zu suchen, bin aber definitiv dazu angehalten, wieder weil Logik. Dir nach soll ich jetzt aber nichts machen weil der Gegner ja seine Critrune hat. Nochmal, wenn man dem folgt dürfte man Spieler mit crit nie angreifen weil sie vielleicht kritten könnten.\n\nWenn RNG sowas tolles und gutes wäre, das so viele Möglichkeiten für Zurückliegende schaft, so viel Gameplay schaft, so viel decisionmaking schaft, warum gibt es dann keine Fähigkeiten die zufällig x-y Schaden machen (so wie das bei vielen anderen Spielen der Fall ist), warum wurde diese Art von RNG aus Fähigkeiten und Nicht-Krititems entfernt? Dann ist es doch unglaublich unfair allen, wirklich allen anderen Rollen und Klassen (und Ashe) gegenüber ihnen das extra Gameplay, das extra Decisionmaking, die Comeback Möglichkeiten vorzuenthalten.","replies":[{"poster":"Crounty","date":"2016-08-20T19:28:20.382+0000","up_votes":1,"down_votes":0,"body":"> Wenn RNG sowas tolles und gutes wäre, das so viele Möglichkeiten für Zurückliegende schaft, so viel Gameplay schaft, so viel decisionmaking schaft, warum gibt es dann keine Fähigkeiten die zufällig x-y Schaden machen (so wie das bei vielen anderen Spielen der Fall ist), warum wurde diese Art von RNG aus Fähigkeiten und Nicht-Krititems entfernt? Dann ist es doch unglaublich unfair allen, wirklich allen anderen Rollen und Klassen (und Ashe) gegenüber ihnen das extra Gameplay, das extra Decisionmaking, die Comeback Möglichkeiten vorzuenthalten.\n> \n\nWieso wurde Crit RNG nicht entfernt? Weil so viele RNG's entfernt wurden, bis das Spiel healthy war. Ich gebe zu, zu viel RNG ist nicht gut für das Spiel, aber gar kein RNG ist auch nicht gut.\n\nIch würd mal sagen wir lassen es hierbei, ich glaube nicht, dass wir jeweils den anderen überzeugen können, da wir zu sehr an unserer Seite halten, hat echt Spaß gemacht mit dir zu diskutieren hoffe wir können irgend wann mal wieder über etwas diskutieren.","replies":[]}]}]},{"poster":"Crounty","date":"2016-08-20T17:30:29.005+0000","up_votes":1,"down_votes":1,"body":"> Wie bereits gesagt der Unterschied zwischen eine Entscheidung auf ein Zufälliges Ereigniss treffen und eine Entscheidung treffen die dann von Zufall zerstört wird.\n\n*eine Entscheidung treffen, die dann von Zufall beeinflusst wird. \n\n> Natürlich kann ich. Wenn ich gewonnen hätte, hätte keiner nen Krit gehabt, jetzt hat aber der Gegner einen gehabt und ich nicht, dann liegt das natürlich am Krit. Die Chance das überhaupt mal einer nen Krit macht sind niedrig bei geringer Critchance, weis ja nicht ob du das mit 1% Krit mal getestet hast, ich hab es.\n\nDIe Chance steigt mit jedem AA, es ist nicht so random wie alle denken. PRNG 4 lyf\n\n> 2 ADCs begegnen sich beide gleiche Kritchance aber einer hat Pech und stirbt der andere Glück, hatte mehr Krits und lebt. Wenn man dem folgt was du sagst dürften Spieler mit krit sich garnicht mehr angreifen außer sie haben nahe 100% weil sie immer den kürzeren ziehen könnten\n\nNiemand zwingt dich den Gegner bis auf den Tod zu fighten, du kannst ja wie im Beispiel beschrieben kurze Trades machen und dann wieder raus wenn es zu risikoreich ist. Außerdem ist man nicht alleine auf der Lane, man hat auch einen Supporter, der dir die kills zubereitet, sodass Fälle, in denen Crit gewinnt einfach unwahrscheinlich ist, außer man geht all in\n\n> LoL ist kein Schach, beide Seiten gehen mit unterschiedlichen Vorraussetzungen ins Spiel. Wenn einer keine Läufer und stattdessen 4 Türme hätte und der andere keine Türme stattdessen weitere Springer vielleicht aber so ist das kein guter Vergleich.\n\nDu hast da Recht, es ging eher um das Prinzip, dass in Schach bestimmte Strategien die besten sind und genau sowas auch auf LoL zutrifft, wenn Crit entfernt wird, weil man dann einen guten Weg hat um zu gewinnen","replies":[]}]}]},{"poster":"Crounty","date":"2016-08-20T14:19:25.594+0000","up_votes":1,"down_votes":0,"body":"Ach verdammt, hab jetzt meinen Post bearbeitet, ohne zu schauen ob du schon geantwortet hast...","replies":[{"poster":"Bergelmir32","date":"2016-08-20T14:35:19.581+0000","up_votes":1,"down_votes":0,"body":"> Ich stimme dir zu, dass Zufall keinen zu großen Einfluss im Spiel haben sollte (stell dir vor eine Ultimate die zu 10% alle Spieler tötet), aber dennoch sollte es wie in jedem Spiel beinhaltet werden, da die Spieler sich auch an Glück und Pech anpassen können sollten, was sie auch im Verlaufe des Spiels definiert. Nehmen wir das Beispiel Vision: Du weißt nicht wo die Gegner sind und musst deswegen manchmal raten und somit deine Movements/Positioning anpassen, oder du weißt nicht wie Risikoreich es ist, den Baron/Drake zu machen: Das zählt auch mehr oder weniger zu RNG.\n\nwar vorher\n> Außerdem willst du mir sagen, dass Riot das Spiel so vorhersehbar machen soll, dass du schon von Anfang an weißt, dass du verlieren/gewinnen wirst? Das würde mir jedenfalls keinen Spaß machen.\n\nund alles unter\n>Da stimme ich dir auch zu. Crit ist zwar unzuverlässig, muss aber nicht schlecht sein, außerdem hilft es auch den Snowball zu dämmen, da ein Team, das behind ist mehr oder weniger in der Lage ist das Snowballende Team zu fighten. Außerdem macht es das Spiel spannender, da von der einen Minute zur anderen plötzlich das andere Team die oberhand gewinnt, obwohl es Anfangs am verlieren war.\n\nist neu","replies":[{"poster":"Crounty","date":"2016-08-20T14:40:34.633+0000","up_votes":1,"down_votes":0,"body":"Hast du dir auch den unteren Teil mit dem Beispiel durchgelesen also unter dem letzten Zitat? Und ich hab ausversehen einen neuen Post auf deine letzte Antwort gemacht. Omg ich mache alles so kompliziert XD ","replies":[{"poster":"Bergelmir32","date":"2016-08-20T15:06:25.237+0000","up_votes":1,"down_votes":0,"body":"Schon ok, bin grad am schreiben ;)","replies":[]}]}]}]}]}]}]},{"poster":"TerrorRaven","date":"2016-08-18T22:25:05.716+0000","up_votes":1,"down_votes":0,"body":"Auch müsste man Fähigkeiten wie das Shaco Q oder Fiora E, welche als Crit zählen bzw. einen künstlichen Crit erzeugen, überarbeitet werden, genau so wie die Passiven von Tryndamere und Yasuo.","replies":[{"poster":"Bergelmir32","date":"2016-08-18T23:52:22.535+0000","up_votes":1,"down_votes":1,"body":"Müssen sie nicht. Ganz allgemein würden diese Änderungen die Amplitude von Krits auf den Mittelwert stutzen ohne diesen insgesamt zu verändern.\n\nIm Speziellen heißt das bei Yasuo und Tryn das sie nicht irgendwann einen Lucky crit machen und du ab da nur noch unterm Tower hocks, weil ein weiterer lucky crit dich töten könnte, sondern das sie beständig und vorhersehbar eine gewisse Menge Schaden mehr machen.\nAuch für Fälle wie Shaco würde sich rein garnichts ändern. Das sind Angriffe die 100% Critchance haben, womit sie auf 100% extra Schaden kommen würden, was genau dem Schaden jedes normalen Crits aktuell auch entspricht. Zur Berechnung des Modifizieren Schadens muss man bei solchen Fähigkeiten nur die aktuellen Werte nur -1 rechnen und das Ergebniss mit dem Bonusschadens des Krits multiplizieren und man kommt auch denau die selben Werte wie jetzt auch.","replies":[]}]}]},{"poster":"OrangeBubble","date":"2016-08-18T20:56:07.808+0000","up_votes":1,"down_votes":0,"body":"Assassinen OP","replies":[{"poster":"SeaHorseCalamity","date":"2016-08-18T22:21:05.858+0000","up_votes":1,"down_votes":0,"body":"Crit Zed wird wieder in Mode kommen :D","replies":[{"poster":"OrangeBubble","date":"2016-08-19T12:47:57.176+0000","up_votes":1,"down_votes":0,"body":"Generell würden AD Assassinen in Mode kommen ^_^","replies":[]}]}]}]}