{"poster":"Vanellion","date":"2016-09-11T22:14:19.751+0000","title":"Me dijeron que si llegaba a las 1000 vicotrias..","subforum":"Charlas Generales","up_votes":2,"down_votes":7,"body":"Me dijeron que si llegaba a las 1000 vicotrias pod&iacute;a jugar con un Rioter, es cierto? Si es as&iacute;, yo quiero jugar con uno :3 {{sticker:slayer-jinx-wink}} \r\nSaludos!","replies":[{"poster":"SATIV","date":"2016-09-12T03:27:40.442+0000","up_votes":1,"down_votes":0,"body":"La tradicion es que llegando a las 1000 un rioter juega un vs en el buscaminas contra vos.","replies":[]},{"poster":"Cacatwua","date":"2016-09-11T23:33:13.216+0000","up_votes":1,"down_votes":0,"body":"Yo he logrado jugar con un rioter y todavia no he llegado a las 700 victorias xD.","replies":[]},{"poster":"NegroFacha","date":"2016-09-11T22:49:20.176+0000","up_votes":1,"down_votes":0,"body":"fake :P","replies":[]},{"poster":"Condor","date":"2016-09-11T22:37:52.399+0000","up_votes":1,"down_votes":0,"body":"No una regla ni nada por el estilo, es solo una especie de tradición que ha existido desde siempre,solo tienes que encontrar a algún Rioter benevolente que te acepte la invitación :)","replies":[]},{"poster":"Ryûjin Ronin","date":"2016-09-11T22:30:03.652+0000","up_votes":1,"down_votes":0,"body":"Yo llegue a las 2000, puedo jugar con 2 rioter? (?","replies":[]},{"poster":"Jungle Clown","date":"2016-09-11T22:29:45.868+0000","up_votes":1,"down_votes":0,"body":"Yo incluso rankeaba con uno pero no tenia nombrecito rojo todavia, era programador o algo asi, me mostro lo que podia hacer ahora q trabajaba para riot que podia ponerse que era retador (cuando pones el mouse sobre su nombre en la barra de amigos, obvio que si ponias su perfil aparecia su liga correcta) o poner bots apocalipticos en personalizadas y cosas asi","replies":[]},{"poster":"Suní","date":"2016-09-11T22:17:22.845+0000","up_votes":1,"down_votes":0,"body":"Creo que es cierto\n\nPero creo que es cada 1000 victorias lo mas probable es que sea cierto has otro post que se llame Quiero jugar con un rioter y quizas de ahi te agrege algun rioter o algo y juegue contigo","replies":[]}]}