{"poster":"Apachai7w7","date":"2019-02-24T21:48:13.710+0000","title":"Yo soy el tipo de jugar que juega tanques y tira todas las torres y siempre que perdemos en mi culpa","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Yo soy el tipico jugador de campeones como {{champion:14}}  o {{champion:27}}  que su trabajo principal a mi forma de ver es tirar torres. normal mente cuando juego estos campeones saco primera torres pero en lo que saco voy 0-2 , 0-3 , 0-4 en score pero normal mente le saco 50 de farm  de diferencia al top enemigo. normal mente cuando ganamos siempre le dan honores al de mejor score como es normal supongo que pero la mayoría de las partidas soy el segundo con mas oro o el primero dependiendo si verdadera mente alaguen de buen score de mi equipo juega excelente y real mente quisiera saber si en verdad es mi culpa si perdemos ? porque es verdad el su top sale 3-0 o 4-0 de linea pero con mi torre intacta y con menos farm que yo y quisiera saber que tan cierto es que las partidas perdidas jugando de esa forma es mayor mente culpa mia Eso &lt;3 ( Algún consejo &lt;3 ) \r\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"SecretOperator","date":"2019-02-24T22:09:37.522+0000","up_votes":5,"down_votes":0,"body":"Pensaba terminar de leer pero me puso nervioso que separes todas las ptas palabras que terminan en \"mente\"","replies":[]},{"poster":"r1mS","date":"2019-02-24T23:14:00.086+0000","up_votes":2,"down_votes":0,"body":"En mi opinión, hay campeones que se desempeñan mejor que otros para cada tarea. Por ejemplo, si con {{champion:27}} y {{champion:14}}  tiras la primer torre antes de que termine la fase de lineas, lo mejor seria ayudar al resto del equipo, rompiendo mas torres, haciendo dragón, objetivos en general.\nLos mejores campeones para estar casi todo el día en Top, son los duelistas (campeones fuertes en el 1vs1, 1vs2 y si vas muy fuerte hasta un 1vs3), que pushean con facilidad y alguien tiene que venir a pararlos, porque de otro modo, te gana la partida casi solo, ejemplos: {{champion:24}} {{champion:114}} {{champion:83}} {{champion:75}}. Aunque hay muchos factores para pickear estos campeones y solo pushear. Por ejemplo, si tu equipo esta perdiendo en las team fight, lo mejor es ayudarles y pushear todos juntos. Pero cada partida es un mundo.","replies":[]},{"poster":"PICHULOTRON 3000","date":"2019-02-25T02:56:25.162+0000","up_votes":1,"down_votes":0,"body":"Yo creo que si, porque hay algunos jugadores que se vuelven locos haciendo splitpush al nivel de nisiquiera leer los mensajes de compañeros o señales no estan atentos de lo que pasa hasta que la partida dice \"DERROTA\".","replies":[]},{"poster":"Torrez157","date":"2019-02-25T00:25:47.910+0000","up_votes":1,"down_votes":0,"body":"Si y No, splitpushear lo haces cuando tu equipo puede ganar una tf sin tu ayuda o al menos no perder mucho con una tf, lo que vos decis es que splitpusheas casi siempre, pero no siempre es la mejor idea. Por ejemplo, Sion es un campeon que tiene bastante cc y tanquea banda, sos muy importante en una TeamFight y podes matar al enemigo feed con la ayuda de tu team, pero si tu equipo puede ganar la tf sin vos, slpitpushea tranquilo. Por eso tenes que ver cuando splitpushear y cuando no.\n{{sticker:vlad-salute}}","replies":[]},{"poster":"Mascheranox","date":"2019-02-24T23:47:12.745+0000","up_votes":1,"down_votes":0,"body":"a mi me dicen lleva algo tanke para hacer peel\nvoy tanke 0 daño y tocan todos malos","replies":[]},{"poster":"Nahejaz","date":"2019-02-24T22:32:24.896+0000","up_votes":1,"down_votes":0,"body":"Porque las partidas no se ganan solo tirando torres, estar toda la partida en una sidelane pusheando mientras que tu equipo va perdiendo no es rentable y solo estas haciendo mas grande la ventaja que el otro equipo tiene sobre el tuyo. Hay muchos factores a tener en cuenta cuando vas a hacer splitpush y por lo general la mejor opción si no sabes que hacer es juntarte con el equipo y cumplir tu rol como tanque en tfs.\n\nAl final de la partida, su top, que perdió la torre y llevaba menos farm termino impactando mucho más en el resultado final que vos. Ahí esta el problema.","replies":[]},{"poster":"alop55555","date":"2019-02-24T22:17:50.338+0000","up_votes":1,"down_votes":0,"body":"cada personaje tiene velocidad de pusheo  que tienes que considerar \nsi te armas tanque tienes menor velocidad de pusheo que un personaje que se armó daño \npor lo que tu objetivo no debe ser pushear si no que hacer lo posible para que tu personaje pusheador de tu team  pueda pushear tranquilo y feliz\n\npara lograr la felicidad de tu team puedes hacer peel, defender base, forzar a que malgasten flashs y ultis. Pero pushear no debe ser prioridad para un tanque,","replies":[]}]}