{"poster":"Yassyndrom","date":"2018-07-04T20:16:15.012+0000","title":"Make Aatrox great again akfskjashfakjjhk","subforum":"Champions & Gameplay","up_votes":4,"down_votes":1,"body":"Hey,\r\n\r\nIch h&auml;tte da mal eine Diskussionsfrage an die Community und nat&uuml;rlich auch an Riot Games. Es geht um den derzeitigen Aatrox-rework. \r\n\r\nIch pers&ouml;nlich SPIELTE Aatrox damals und hatte nie wirklich gedacht, dass er einen Rework n&ouml;tig hat. \r\nAls Champion, in Verbindung mit seiner Geschichte, war beispielsweise sein Aussehen 10/10 sowie seine Stimme und die dazugeh&ouml;renden &quot;Zitate&quot;.\r\nEr hatte mit seinen Standart-Fl&uuml;geln etwas womit er sich von den anderen Fightern unterscheiden konnte. Klar, Morgana, Kayle usw. haben auch Fl&uuml;gel aber ich gehe gerade nur von den Klassen der Fighter aus. Ich spreche darauf an, weil ich Fl&uuml;gel einfach von der Optik her sehr sch&ouml;n finde, womit meine erste Frage auch w&auml;re:\r\n Denkt ihr wirklich Aatrox hat so einen Rework ben&ouml;tigt, wo seine ganze Geschichte ge&auml;ndert wird sowie sein Aussehen und seine Spr&uuml;che ? Und wenn Ja, was genau findet ihr im Vergleich besser ?- Ich pers&ouml;nlich finde alles am rework IM VERGLEICH schlecht.. wobei an sagen muss dass es ziemlich dope aussieht wenn man die Ult benutzt.. das wars aber auch.\r\n \r\nSein Gameplay ist wieder im Vergleich einfach nur bad.. \r\n1. Sein kit verf&uuml;gt pro Skill 20 sec cooldown als ein Fighter dessen Lifestealrate durch die damalige W weggenommen wurde.. er kann seine Lane nicht halten\r\n2. Seine Q verpflichtet ihn sich st&auml;ndig neu zu positionieren und man k&ouml;nnte sogar sagen er cc`d sich mit seiner Q nur selber.. da er auch nur seine E benutzen kann umsich dabei zu bewegen.- Man muss sagen, dass die Animation der Q schon sehr dope aussieht..\r\n3. Sein Impact in Teamfights ist so gut wie 0. Sobald seine Ult abl&auml;uft hat er nichts im Kit was ihn weder am Leben h&auml;lt noch Disengagen kann- der damalige Aatrox hatte mit seiner Q die Option sowohl zu Dis-als auch zu Engagen. Seine E war genug Poke f&uuml;r die Lane\r\n\r\nIm Gro&szlig;en und Ganzen war der alte Aatrox in meiner Anischt in allen Kategorien besser dazu geh&ouml;ren: \r\n- Aussehen\r\n-Spr&uuml;che\r\n-Kit \r\n\r\nWas meint ihr, ist der alte Aatrox nicht besser gewesen ?","replies":[{"poster":"DepravedLunatic","date":"2018-07-05T05:51:49.416+0000","up_votes":3,"down_votes":1,"body":"Ganz ehrlich, ich verstehe nichtmal mehr die Reworkphilosophie von Riot. Denn in ihrem Wörterbuch ist \"Rework\" wohl ein Synonym zu \"Kompletter Relaunch in dem auf die Champions geschissen wird und eigentlich bleibt nur der Name gleich.\"\n\nGutes Beispiel ist Taric:\nNicht, das es kein gelungenes Rework ist. Aber er war nicht mehr ein Edelsteine-liebendes Alien das gerne in Demacia war. Er war ab dem Rework \"Der Aspekt des Berges Targon!\", aber nicht mehr der Edelsteinritter.\n\nOder Galio:\nVom weisen, zynischen aber bestimmten Wächter zu \"HÖHÖ ICH BIN IMMER IN ALLEM DRIN SCHAUT MICH AN ICH KOMME VON KRYPTON HAHA!\"\nWieder, das Kit ist definitiv nicht schlecht. Aber man musste doch nicht seine Backstory und seinen Charakter neu schreiben.\n\nUnd jetzt Aatrox:\nEin Kriegmacher, der Soldaten dermaßen in Blutrausch versetzt, das sie zwar den Krieg gewinnen, danach aber nicht mehr als ein Schatten ihrer selbst sind.\nJetzt ist er ein russischer Holzfäller der statt ner Axt ein Großschwert benutzt, weil es mehr Swag hat als eine Axt.\nHier jedoch passt das Kit zum NEUEN (!!!) Aatrox. Der alte Aatrox hätte dieses Kit nicht benutzen können. Da hätten bei Riot Alarmglocken schallen müssen alá \"Oh verdammt, vielleicht sollten wir uns dieses Rework nochmal überlegen! Das Kit passt nicht zu dem Champion, den wir da reworken!\"\n\"Ja dann schmeiß die Lore und die Personality übern Haufen!\"\n\"Ist gebongt Chef!\"\nAuch hier, das Kit ist NICHT schlecht. Aber sie hätten genauso gut einen neuen Darkin namens Schlaagmichtotius erschaffen können, der dieses Kit und diese Lore hat und sich mehr Zeit für das Aatrox Rework nehmen können, um ein Kit zu entwickeln, was auch zu Aatrox gepasst hätte.\n\nAber nicht mit der neuen Designpholosophie, in dem ein Rework automatisch ein ReLAUNCH bedeutet.\nEcht schade, das hat mich schon zu Zeiten des Taric Reworks gestört, aber erst bei Galio ist mir die Geduld ausgegangen. \nDas sie auch Aatrox so behandeln, finde ich seinem geistlichen \"Vater\" und seinen Liebhaberm gegenüber mehr als nur unfair.","replies":[{"poster":"Yassyndrom","date":"2018-07-06T13:09:40.701+0000","up_votes":1,"down_votes":0,"body":"+1\n\nJa ich stimme dir zu, dass ist eifnach kompleter bullshit..  Ich meine man muss ja auch die Spieler in LoL unterscheiden\n\nEinerseits gibt es diejenigen die am Wochenende mal mit ihren Freunden zocken und chillen, andererseits gibt es aber auch Leute, die sich mit dem Game auseinandersetzen, sich in Geschichten reinlesen und somit auch Gefallen an einem Champion finden..\n\nAn meinem Namen merkt man vllt, dass ich Yas OTP bin. Warum ? Bei seinem Release habe ich ihn ausgetestet und sein Spielstyle war fun und man konnte mit seinem Kit sehr viele Builds austesten usw. Nachdem einem der Spielstyle eines Champs gefällt und man auch einige Zeit in League investiert, schaut man in die Lore des Champs rein. \nIch persönlich finde das mega unterhaltsam, dass jeder Champ seine eigene Geschichte hat, weil man dadurch auch sein Gefallen an den Champ steigert und ihn noch mehr spielt. Man versteht sein Kit, seine Sprüche einfach alles um den Champion.\n\nSo mein Punkt ist der, ich z.B habe Aatrox nicht wirklich neulich angefangen sondern schon einige mal gespielt und er macht einfach Spaß. Sein Kit war nicht bad, sein Aussehen fand ich sogar bis jetzt noch von allen am besten. Seine Sprüche, Stimme hat einfach alles zur seienr Lore gepasst...\n\nABER HIER IST DER KNACKPUNKT, Riot muss natürlich nachhacken und sagen, hey die pickrate von Aatrox ist ziemlich bad, ich glaube wir sollten ihn reworken damit er 1. wieder Aufmerksamkeit bekommt und 2. wieder gespielt wird\n\n- Was einfach keinen Sinn macht, weil jeder fcking Spieler seine Lieblingsrolle, Lieblingschamp w/e hat. Ich habe z.B noch nie Gragas freiwillig gespielt, aber der berühmte Streamer Panunu feiert ihn und ist auch erfolgreich, ich fidne den Champ einfach ätzend.. \n\nUrgot z.B hat aber NIEMAND gespielt weill er einfach 1. hässlich war 2. useless, und es beschwerten sich auch Leute darüber dass er einfach nur suckt... dann ist ein Rework auch ok\n\nUND JETZT KANNMIR NIEMAND ERZÄHLEN DASS MAN NACH EINEM AATROX REWORJ GEFRAGT HAT. \nWeil, an der Optik kann es nicht liegen, er sieht eifnach krass aus egal ob man Aatrox mag oder nicht.\nUnd kurz bevor man ihn reworkte stieg seine Winrate immens hoch... wo man sich denkt ? dafuq ? was ist der fckign Grund für einen Rework ?\n\nIch finde einfach dass deiser Rework soooooo bad ist, weil es keinen Grund dafür gab.\nDas einzige Argument, das man benutzen KÖNNTE , wäre die niedrige Pickrate von ihm aber like dafuq cmon Riot ? Wie viele Champs habt ihr 300, 500 ? Soll jz jeder eine Pickrate von 734187634871623% haben ?\nEs hatte sich auch niemand über Aatrox beschwert aber never mind. GREAT JOB RIOT","replies":[{"poster":"Roxãs","date":"2018-07-13T10:29:15.887+0000","up_votes":1,"down_votes":0,"body":"> Wie viele Champs habt ihr 300, 500 ?\n\nThe fuck alter, nun übertreibst du.","replies":[]}]}]},{"poster":"Gâlahad","date":"2018-07-06T14:37:45.627+0000","up_votes":1,"down_votes":0,"body":"Um kurz auf deine Eingangsfrage zu Antworten: Ja der alte Aatrox war besser. \nSo wie er aktuell ist wird seine Winrate auch nicht drastisch weiter ansteigen. Da muss wohl noch einiges gepatcht und bearbeitet werden damit er wieder in eine gute Position kommt. Ich bin ehrlich gesagt etwas schockiert über ein so unfertiges Rework. Da ist Riot stolz wie bolle auf sich selbst weil sie sich angeblich noch nie so viel Zeit für ein Rework genommen haben und dann kommt sowas komplett undurchdachtes und unbalanciertes raus.\nIch denke die Kernprobleme wird man auch nicht lösen durch Stats buffen. Sein komplettes Kit dreht sich nur um seinen \"Q\". Der Q ist sein einziger relevanter DMG-Spell und dafür ist er recht schwach geraten.\nPassive: \nIst völlig schwachsinnig das die Passive durch Hits auf Minions verbraucht wird. Man will schlieslich Farmen und sollte die Passive eigentlich für die Kämpfe aufsparen.\nQ:\nDas größte Problem des neuen Kits. Der wichtigste Spell um den sich alles dreht und der einzige Dmg Spell. Man hat lediglich maximal 2 Aufladungen auf dem \"E\" von Aatrox als gapcloser und ist quasi gesnared während man seinen Q einsetzt. Die meisten Champs laufen einem davon während man seinen Q einsetzt. Nachdem der Q genutzt wurde hat man einen recht langen CD für den einzigen Dmg Spell und ist den Gegnern ausgeliefert. Ein weiteres Problem ist das der Q-Spell nur relevanten Schaden macht wenn man mit der Schwertspitze trifft. Das sorgt dafür das man immer eine bestimmte Distanz zum Gegner haben muss. Gerade mid/lategame in Teamfights ist es fast nicht möglich die passende Distanz zu wahren wodurch man enorm wenig Dmg-Output in solchen Teamfights hat.\nW:\nDer W macht zwar wenig Dmg allerdings finde ich die Mechanik recht spannend.\nE:\nDer E ist leider lediglich als Supportspell von Aatrox Q spell zu betrachten... Man darf sich nicht während dem Q bewegen und deshalb gibt es einen E-Spell um sich während dem Q zu repositionieren und einem als \"Belohnung\" einen kleinen Dmg Boost für den nächsten Hit gibt. Zum Escapen ist der Spell leider kaum geeignet und Dmg macht er selber keinen. Zudem ist die Range enorm kurz und nur auf den nutzen im Zusammenhang mit dem Q ausgelegt.\nR:\nBei der Ult ist auch einiges sehr unschön. Die Ult ist darauf ausgelegt in Notsituationen oder entscheidenden fights mehr dmg auszuteilen und einen Revive zu haben. Ein großes Problem ist die Latenz zwischen auslösen und aktivieren der Fähigkeit. Zusätzlich bekommt man nur leben zurück wenn man im kampf tatsächlich stirbt. In der Regel kiten die Leute einen bis die Ulti um ist und töten einen wenn man keinen Revive mehr hat.\n\nIm allgemeinen wollte Riot einen Juggernaut/Diver Champ machen der nicht \"stat-checky\" ist. Letztendlich haben sie davon nichts erreicht. Sondern eher alte Probleme noch verschlimmert. Er erfüllt die Rolle eines Divers gar nicht mehr. Als Juggernaut ist er z.T. durch seine Core Items auch nicht gut geeignet. Zudem ist es \"blöd\" das er nur auf eine Bestimmte Distanz (kürzer als Range/weiter als Melee) relevanten schaden austeilt und das nur mit einem Spell.\nIst auch wieder mal ätzend das VIELE Aatrox Mains Verbesserungstipps und konstruktive Kritik abgegeben haben, aber Riot wie immer überhaupt nicht darauf eingeht. Erst zeigen sie einem nichts vom Rework, wodurch Spieler kein Feedback geben konnten und dann bringen sie ihn vom PBE direkt Live ohne auf Verbesserungsvorschläge einzugehen.\nAuch Reav3 der im Aatrox Main Reddit forum immer aktiv war, hat sich seit dem PBE in keiner Form zum Balancing und dem Kit geäußert und ist auf nichts eingegangen. Daraufhin kam seitens Riot nur eine vertröstung das sie an Aatrox bis auf Stats nichts mehr ändern wollen. Scheint wohl so die Art zu sein Riot, sobald Kritik an Kits/Champs und Balancing laut wird. Sich komplett zurückziehen und nicht drauf eingehen.","replies":[]},{"poster":"Pilze","date":"2018-07-04T20:40:35.520+0000","up_votes":1,"down_votes":0,"body":"Wenn man sich gerade die Liga Picks anschaut und den Erfolg der damit verbunden ist, braucht Aatrox kein Rework.","replies":[{"poster":"Yassyndrom","date":"2018-07-04T20:57:01.405+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]}]}]}