{"poster":"Luz de Angel","date":"2015-11-02T19:58:00.409+0000","title":"Indemnizacion Bono 50% + de Rp","subforum":"Problemas Técnicos","embed":{"description":null,"url":"http://i13b.3djuegos.com/juegos/3472/league_of_legends_clash_of_fates/fotos/maestras/league_of_legends_clash_of_fates-2725501.jpg","image":null},"up_votes":5,"down_votes":6,"body":"Buscamos que la gente apoyen la causa y pidamos minimo una indemnizacion\r\npor nuestras compras de Rp que ya estan pagadas y aun no llegan\r\nUn bono de un 50 % mas de Rp , por los montos que hayamos comprado\r\npor todos los malos ratos que nos estan haciendo pasar\r\npor que ningun administrador da la cara\r\npor seguir mantendiendo este juego con nuestro dinero\r\nAPOYA LA CAUSA{{item:2050}}","replies":[{"poster":"Alxsp","date":"2015-11-02T21:12:51.489+0000","up_votes":4,"down_votes":0,"body":"Solo podrías alegar que te regresen tu dinero, no tienen por que indemnizarte ya que no provocaron ningún prejuicio y solo  ese \"alegar que te regresen tu dinero\" es si sobre pasan los 5 días hábiles que ellos prometen cumplir con el servicio. \nSin otro particular, creo que tu tema es la desesperación de un niño de 10 años que no sabe leer cuando acepta las condiciones de servicio","replies":[{"poster":"Zifferion","date":"2015-11-02T21:19:28.965+0000","up_votes":1,"down_votes":5,"body":"nadie lee los terminos, tu no te viste afectado asi que tu opinion no es de aporte para los afectados que tienen su dinero perdido","replies":[{"poster":"Alxsp","date":"2015-11-02T21:24:14.194+0000","up_votes":4,"down_votes":0,"body":"Sera tan complejo leer y esperar los plazos que la empresa pone para recibir tus rp? \nQue tú no leas los términos es tu problema, pero ahí están y si los aceptas ..... tienes que esperar los plazos y si , yo compre rp pero debo esperar los días hábiles correspondientes a mi compra, posteriormente si no llega pedir que solucionen mi problema con mi numero de compra, antes no . \nOtra respuesta de un niño de 10 años","replies":[{"poster":"Zifferion","date":"2015-11-02T21:52:17.124+0000","up_votes":1,"down_votes":2,"body":"ya señor maduro , usted tiene razón siga asi de exitoso por la vida hasta nunca","replies":[{"poster":"Alxsp","date":"2015-11-02T21:51:29.197+0000","up_votes":1,"down_votes":0,"body":"Esperaba leer algún argumento jo!","replies":[]}]}]},{"poster":"Tecnicomando","date":"2015-11-02T21:53:15.364+0000","up_votes":1,"down_votes":0,"body":"EN mi caso mande tiket a soporte, 24 hrs despúes ya tenia abonado el rp...\n\nSimple.. no?\n\nUse cuenta rut el viernes, y el sábado ya tenia los rp","replies":[]}]}]},{"poster":"TORRESjr","date":"2015-11-02T19:59:58.797+0000","up_votes":1,"down_votes":3,"body":"Seguramente leiste que a las demas personas no le llegaba su RP y vos dijiste uy si, voy a cargar Rp, y no te llego y ahora lloras.","replies":[{"poster":"Luz de Angel","date":"2015-11-02T20:14:20.758+0000","up_votes":1,"down_votes":0,"body":"Fui uno de los primeros en postear, que no llegaban los Rp, desde el jueves tengo 2 cuentas cargadas sin Rp, si te gusta lo que le pasa a lo demas, ojala no digas nada cuando te suceda a ti, si apoyas la causa bien , sino haste a un lado, comentarios como el tuyo no ayudan.\nHay mucha gente , con su dinero en el aire y nadie se digna a dar la cara\nla causa es para todos los que estamos siendo afectados","replies":[{"poster":"TORRESjr","date":"2015-11-03T14:01:45.706+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Luz de Angel,realm=LAS,application-id=X54mVVp0,discussion-id=MZcIxxfn,comment-id=00000000,timestamp=2015-11-02T20:14:20.758+0000)\n>\n> Fui uno de los primeros en postear, que no llegaban los Rp, desde el jueves tengo 2 cuentas cargadas sin Rp, si te gusta lo que le pasa a lo demas, ojala no digas nada cuando te suceda a ti, si apoyas la causa bien , sino haste a un lado, comentarios como el tuyo no ayudan.\n> Hay mucha gente , con su dinero en el aire y nadie se digna a dar la cara\n> la causa es para todos los que estamos siendo afectados\n\nLa verdad que cuando cargo RP siempre los tengo a los minutos, no se de donde sos vos, pero si no es practico no deberias hacerlo.","replies":[]}]}]},{"poster":"KC1K3","date":"2015-11-02T23:49:52.166+0000","up_votes":1,"down_votes":0,"body":"yo mande ticket y me respondieron que tenia que esperar 5 días hábiles, todo esto el jueves... rito pls","replies":[]},{"poster":"Ntsuco","date":"2015-11-02T21:17:42.998+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]},{"poster":"KC1K3","date":"2015-11-02T20:50:44.917+0000","up_votes":1,"down_votes":0,"body":"yo recarge el jueves y nada...","replies":[]},{"poster":"Luz de Angel","date":"2015-11-02T20:22:18.094+0000","up_votes":1,"down_votes":0,"body":"Los rps normalmente llegan entre 3 a 5 miutos, \nAhora cargas y no aparece los rps","replies":[{"poster":"Rebkans","date":"2015-11-02T20:35:25.462+0000","up_votes":1,"down_votes":0,"body":"Todo depende el modo en el que pagues. Legalmente pueden tardar hasta 5 dias habiles, sea cual fuere el medio utilizado","replies":[]}]},{"poster":"Minero","date":"2015-11-02T20:18:51.104+0000","up_votes":1,"down_votes":0,"body":"Cuánto demora en llegar la carga de RP por compra de cuenta rut?, porque he escuchado que llegaba en 5 minutos o máximo 10 minutos.. pero no sé si eso ha cambiado con el tiempo o siempre ha sido lo mismo, gracias","replies":[]},{"poster":"Rebkans","date":"2015-11-02T20:13:18.247+0000","up_votes":1,"down_votes":0,"body":"Los RP's pueden tardar hasta 5 dias habiles. Aparte nadie te obligo a gastar plata en el juego, asi que tampoco vengas con eso","replies":[]},{"poster":"Zifferion","date":"2015-11-02T20:06:06.012+0000","up_votes":1,"down_votes":0,"body":"yo sigo sin respuesta, lo unico que dicen \"dinero mail tiene en sus politicas y contrato hasta 5 dias para entregar el dinero, despues de los 5 dias pueden reclamar\" que estupidez, como nos piden eso siendo que las compras tardan siempre unos segundos solamente, y quieren hacernos esperar 5 dias o mas??  me importa un carajo el contrato, minimo que nos avisen, que alguien de la cara y nos diga algo, son 10mil pesos chilenos los que estoy perdiendo.","replies":[]},{"poster":"Luz de Angel","date":"2015-11-02T21:46:42.628+0000","up_votes":1,"down_votes":1,"body":"Hay gente que le encantan que le metan el dedo, por no decir otra cosa, esa pasividad de esperar, es logico cuando, es algo fortuito, cuando algun admin , dice algo al respecto.\nCuando es generalizado, lo minimo que puede hacer kla gente es reclamar,\nasi sea un niño de 10 años quienes sean los que reclamen\nes un consumidor y como tal merece respeto","replies":[]}]}