{"poster":"lMrReiswaffel","date":"2018-01-12T16:53:25.568+0000","title":"Smite (Zerschmettern) richtig Verwenden","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"--- Beantwortet ---\n\nMoin erstmal,\nIch habe vor mich mal im Jungle zu versuchen aber eine Frage ist da noch.\nWenn ich ein Monster besiege bekomme ich ja gold (und manchmal noch ein Bonus in welcher Art auch immer). Wenn ich ein Monster aber mit Smite wegmache bekomme ich ja teilweise noch ein weiteren Bonus.\nBekomme ich diesen Zusatz Bonus nur wenn ich ihn mit Smite finishe oder ist es egal wann ich den Smite draufhaue Hauptsache ich hab ihn Verwendet?\n\nDanke schonmal im Vorraus.\n\n--- Danke ---","replies":[{"poster":"Enderized","date":"2018-01-12T17:22:04.766+0000","up_votes":3,"down_votes":0,"body":"Da es keine Smite-Buffs mehr gibt, bekommst du für das Smiten an sich keine Bonis, nur den im Tooltip angegebenen Lebenswert zurück.\nD.h: Smite nach möglichkeit erst, wenn du bereits etwas an Leben verloren hast, nicht wenn du mit vollen Leben am Redbuff ankommst ;)","replies":[{"poster":"Oriius","date":"2018-01-12T19:07:50.908+0000","up_votes":3,"down_votes":0,"body":"der einzige der die Frage richtig gelesen hat , upvote","replies":[{"poster":"Enderized","date":"2018-01-12T19:28:14.162+0000","up_votes":1,"down_votes":0,"body":"Haha :'D","replies":[{"poster":"lMrReiswaffel","date":"2018-02-13T10:58:02.516+0000","up_votes":1,"down_votes":0,"body":"ist aber echt so Danke (-hab dat vergessen als ich vor einem Monat hier war ;) ) und freu mich über die Hilfreiche Antw.","replies":[{"poster":"Enderized","date":"2018-02-13T13:35:04.763+0000","up_votes":1,"down_votes":0,"body":"Immer gerne =)","replies":[]}]}]}]}]},{"poster":"SSI CptHaunted","date":"2018-01-12T18:07:44.001+0000","up_votes":1,"down_votes":0,"body":"Smite benutzt du, wenn du HP brauchst. Ich nutze es im Early eigl fast ausschließlich für solo Buffs und den großen Stein. Später heb ichs mir nur noch für Ganks und Drache/Baron auf, weil mans sonst nicht mehr braucht.","replies":[]},{"poster":"Zapzapzarap","date":"2018-01-12T18:06:25.218+0000","up_votes":1,"down_votes":0,"body":"Beim normalen jungeln solltest du es erst verwenden wenn du schon leben verloren hast oder dir einen buff/camp sichern möchtest beim invaden oder invadet werden. Außerdem solltest du es im mid und endgame dazu benutzten Drachen oder Nashor zu finishen falls sich dein team dazu entschieden haben sollte eines der monster anzugreifen","replies":[]},{"poster":"Kawaii Nai","date":"2018-01-12T17:12:29.086+0000","up_votes":1,"down_votes":0,"body":"wenn du smite benutzt wrist du geheilt. das kannst du verwenden wie du willst, du solltest ihn aber nicht wasten. zb mit full life ode wenn der gegner nurnoch 50hp hat^^","replies":[]}]}