{"poster":"Steelflame","date":"2017-09-10T11:56:12.810+0000","title":"Complete Guide to Invasion : Onslaught, to all extents (S+ On all 5 core missions obtained)","subforum":"Gameplay","up_votes":212,"down_votes":10,"body":"I&#039;ve been playing TONS of Onslaught because boy, is it a fun memory of the days of old with massive, major raids on dungeons in MMORPGs.\nAnyway, here is a complete guide to dominate the Invasion.  Not just win, DOMINATE.  Here is my rap sheet from a ton of games playing this carrying noobs though it as the team captain to help them get their full rewards - http://na.op.gg/summoner/userName=Steelflame\nOnce I got the strategy down, I could win almost every game except for a few cases where someone, even one exceptional case where we had a teammate playing the entire game with 2k ping (That Jinx game before the two remakes.  I had 280K damage at the end of it.   It dragged on WAY too long).\n\nThis guide is divided into 4 sections. Champion Builds, Strategy, Notable rounds (And score mechanics), and Side-notes.\n\n\n**Builds**\n\nFirst thing to note.  Invasion is NOT Summoner&#039;s Rift.  Things play differently here, and the optimal build is often radically different from what you might expect if this was normal League gameplay.\n\n_General_ - ADCs frequently will be built on-hit.  You don&#039;t have enough time to build up the Crit power spike, and the nerf to Lifesteal means that it often isn&#039;t worth it compared to on hit healing.  There is one major exception to this rule, MF.  Mages should gear toward instant max pen via Sorcs-Haunting Guise, as there is no MR growth on enemies, they all have 30 MR, other than the boss, which has 75.  With the Wits on your ADCs that drops to 50.  Your 30 pen drops that to 20.  Damn near true damage for the final boss, and true damage for literally anything else just by yourself even as early as the very start.  You don&#039;t even need pen runes, and using AP per level is more optimal.  Supports focus on Ardent Censor.  This item defines the ADC meta, because it&#039;s on hit damage/heal works with Rageblade, and bypasses the lifesteal nerfs in the mode.  ADCs use Frevor, mages DFT, and supports Stoneborn Pact.  There are no alternatives for optimal.  Literally none.  There are some... alternative rules that will pop up based on how you are using the champ (Such as Syndra &quot;tank&quot; using Stoneborn) in the No X challenge missions, but this is due to the constraints of the mission.\n\n_Traps_ - Several items are a trap in this mode.  This is the Void Staff and Last Whisper line.  Void staff sucks because no enemy other than the boss has more than 30 MR, who effectively only has 50 MR.   Last Whisper sucks because literally no enemy in the mission has a single point of bonus armor, only base armor.  Gold gen boosters, masteries or runes are also traps, as you have fixed gold at the end of each round.  If you gain gold-mid round, it is subtracted to the value you get at the end of said round.\n\n_Runes_ - while an optimal rune page is optional, it does help significantly, especially with how your armor and MR take a hit at later points in the mission to the Fading Light debuff.\n\n- AD champions - Scaling AD or Lethality reds, scaling hp and armor yellows (mix), scaling MR blues, scaling AD or Lethality Quints.   Can sub out some scaling MR blues for scaling CDR blues for Poppy, Ezreal, and MF (Same as mage setup for her blues).\n - AP champs - Scaling AP Reds and Quints, scaling HP and Armor seals, scaling MR and CDR blues (scaling CDR blues to 11%, rest MR).\n\n_Champions_\n\n{{champion:103}} - Contrary to how you&#039;d play normally, Ahri is optimally played as an ADC surrogate in this mode.   Start Wits End, work toward Rageblade, and get Bork in time for the final boss.   End build should look like this {{item:3047}} {{item:3124}} {{item:3091}} {{item:3153}} {{item:1042}}.  Make sure you use Fervor as your Keystone, with the arpen mastery, not Mpen.  You&#039;ll actually kill Cho&#039;gaths and Rek&#039;sais sometime this year, and still have great kill times on Kogs and Koz&#039;s.\n\n{{champion:117}} -  Primary build - Standard support (Use Stoneborn Pact).   Bind yourself to your ADC (Jinx, ideally, Ahri secondarily), and sit on their ass.  {{item:3504}} {{item:3107}} {{item:3109}} {{item:3050}}.  Boots are whatever floats your boat.   Sit on ADC, and shield and protect them.  Stoenborn Pact triggers Ardent, and gives more on-hit heal to your ADC.  As Lulu&#039;s ult doesn&#039;t benefit from heal/shield power, the only boost you get from it is your E or Redemption.  Not worth a 8% (Or in Redemption&#039;s case  increase roughly 18%) increase especially compared to how much impact Stoneborn has.\n  -   Secondary build  -  Look at Ahri build.  Literally the exact same.  Use this for cases where you already have an Ardent support and need another Marksman replacement.\n\n{{champion:134}} -  Primary build {{item:3020}} {{item:3151}} {{item:3165}} {{item:3089}} OR {{item:3116}}   -  DFT, Sorcs+Haunting Guise to open.  If you have good AA carries, build Morello as your first major item, otherwise build Liandries.  Get whatever you didn&#039;t get earlier.  Rabadon or Rylias after that.   Never EVER fall for the noob trap of Void staff.  Because no enemies have more than 30 MR other than the boss (who effectively has 50 MR after your wits end carry hits them a few times) you&#039;ll never run into a case where it is actually granting you any actual penetration.  Q&gt;E&gt;W.  1 point in W at start.  Also.  NEVER EVER GRAB THE SHIELD GUYS.  EVER.\n-  Secondary build - Stoneborn Pact, start Rylias {{item:3116}} {{item:3151}} {{item:3001}} {{item:3024}}  .  Build Sorcs-Liandries, then Abyssal Mask.  Grab a a bit of armor after.   This build is far more bulky, and helps for the cases you don&#039;t have other sources of bulk, while still outputting good damage, and granting the stoneborn heal to your carries.  You&#039;ll lose a bit of damage, but can still output fairly decent damage thanks to your decent bases and the roughly 200 AP you should have, and the Abyssal mask amping your damage by 10%.  Q&gt;E&gt;W.   Also.  NEVER EVER GRAB THE SHIELD GUYS.  EVER.\n\n{{champion:78}} -  Stoneborn Pact, {{item:3109}} {{item:3193}} {{item:3083}} {{item:3047}} {{item:3211}} {{item:3067}} - Your build is a bit flexible, but this is fairly standard.   You may drop Knight&#039;s Vow if your support Lulu already has bound the ADC, and there is only one ADC champion, for instance.  You may not finish Warmog, and instead the Spirit Visage, if you have a Soraka, perhaps.  Depends on the situation, and flexibility only helps you.  Max W first, E second.  1 point in ult, and max Q.   Your job is CC, not damage.  Ult CD redux on ranks is only minorly helpful on boss, and comes at the cost of your consistent Q damage.\n\n{{champion:16}}  -  Stoneborn Pact,  {{item:3504}} {{item:3107}} {{item:3083}} {{item:3190}} {{item:3047}} {{item:1029}}.  If you don&#039;t have a few HP per level runes, you may need to replace the cloth with a Ruby, but IIRC you SHOULD have enough HP even without.  W&gt;E&gt;Q.\n\n{{champion:99}}  -  Primary  -  Copy Syndra&#039;s primary build.   Max EQW.  Do this build if you have several supports already, such as during Burning Bright. -  Secondary  -  Support build.  Feel free to copy the Lulu build.  Max W first, then E, then Q. Ult rank when you can, always aim to execute a mob with it to reset the CD by 50%.   Lux is notable because she is the only support-esque champion you can use in the No Utility champion challenge.\n\n{{champion:21}}   -  The wildcard of the ADCs.  Builds radically different due to her unique kit.  -  Fervor, {{item:3153}} {{item:3071}} {{item:3812}} {{item:3009}}.  Reason for build - BC is actually really good in the mode, especially if you have other champions filling the ADC role on the team, just few people can use it optimally.  BorK helps her take down the bulky targets she usually falls flat on, such as Reksai or Cho.  Death&#039;s Dance bypasses the Lifesteal reduction mechanic, and lets her Q heal her for several hundred HP.   Great during the boss fight.  R&gt;Q&gt;W&gt;E.  Ult priority targets in each mission (varies mission to mission), and be a solid general damage dealer.  Later on as other ADCs are reaching full steam, her BC will let her shred the armor of the boss significantly, majorly boosting output during the times you are able to sit on the boss.\n\n{{champion:40}} -  Stoneborn (But Windspeakers does work on her better than other supports, so you can use it if you prefer, but only do so if you only have a single ADC you are focusing on amping to the max) {{item:3504}} {{item:3107}} {{item:3174}}, with high AP after (I think you can squeeze in a Rabadon, but not 100% sure).   Goal is to amp your highest AS carry with your E shield, and turn them into a god.   Ult to get your team out of sticky situations (Such as when you get piled on by Reksais, or to heal your team midway through a Velkoz walk to help your team make the final stretch).\n\n{{champion:81}} -  Frevor, {{item:3025}} {{item:3153}} {{item:3124}}{{item:3158}} .  Lower DPS than the other carries, but more bulky to physical damage, and can help peel.  A good option for no utility runs.  If you have high fervor and rageblade stacks before ult, massively increases damage.  Similar ult cases to MF.\n\n{{champion:222}}   -  Fervor, {{item:3124}} {{item:3153}} {{item:3091}} {{item:3047}} {{item:1028}} /{{item:1036}}.  Highest DPS you can get in the mode by far.  Near mandatory for S+, although you can get it without her if your team is perfectly on point.  A good Jinx is as close to a solo carry as this mode has.\n\n\n\n\n**Team Strategy**\n \n\n_General Team strategy_ \n\n-  Priorities -  You&#039;ll want to ensure you have a hypercarry DPS for just about every mission.  This usually will be a Jinx, but Ahri and Lulu will sometimes fill in for this, such as during the no Marksmen challenge.   Supports protect the carry, mages will burst high priority targets, and tanks will try and soak aggro.  Hey, this sounds almost like how you&#039;d normally play League!\n\n-  Target priorities -  Most of the time, your highest priority targets are Vel Koz &gt; Kog&#039;Maw &gt; Skarner = Kha&#039;Zix &gt; Rek&#039;sai &gt; Cho&#039;gath.  There are some missions where there are exceptions, but its fairly infrequent.  Don&#039;t forget to clear out the mini-voidlings to though, they may die easy, but if you don&#039;t clear em out they can easily sneak in a kill on you, as they actually do fairly decent damage, especially when grouped up on you such as during a few of the missions that spam them at you such as the Kog&#039;maw or Vel&#039;Koz rings.  Make sure you don&#039;t forget em.\n\n_Specific Mission Strategies_\n\n-  Burn Bright -\n\nEasiest of the 5 missions, Burn Bright pretty much tells you &quot;Hey, you need to beat this mission with 5 specific champs, but don&#039;t worry, these guys are near optimal for the gamemode as a teamcomp!&quot;    This mission is the entry way to the Onslaught.     Look to the strategies above for specific champion builds, and just as a refresher, the champ list is {{champion:222}} {{champion:117}} {{champion:78}} {{champion:99}} {{champion:40}}.  Overall, this team is by far the easiest to get your entry way, although it is a bit hard to get an S on this comp mostly due to the lower damage output you have due to having 3 support champions making kill times a bit of a slog, but it is a VERY safe comp.  You should both get your A rank mission, and clear this one fairly easily so long as you are building your team right, and follow the general per-map strategies below.\n\n-  New Horizon -\n\nThis one is a bit harder.   You don&#039;t have the luxury of Poppy tanking for you, and are overly stacked on damage with 4 carry champs and only a single healer in Soraka.   I generally recommend making Syndra go the &quot;Tank&quot; Syndra secondary build from up above here, so that between her and Raka your team has enough bulk to survive.   Team comp to help remind you - {{champion:103}} {{champion:81}} {{champion:134}} {{champion:16}} {{champion:21}}.   Still very winnable, thanks to having a decently rounded teamcomp.\n\n-  No Marksman -\n\nThis mission ties with No utility for the hardest mission, mostly because on this one you don&#039;t have the luxury of using Jinx.  The closest replacement is Ahri, so treat her as your primary carry.   {{champion:103}} {{champion:117}} {{champion:16}} {{champion:78}} {{champion:99}} is about what I&#039;d consider a near optimal comp for it, but you can swap out Lux with Syndra or Lulu with Janna fairly easily.  You can potentially use Lulu as the AD secondary build, but I&#039;d prefer the support build generally.\n\n-  No Mage -  \n\nProbably the easiest of the No X challenges.   {{champion:222}} {{champion:117}} {{champion:78}} {{champion:21}} {{champion:16}}.  You can replace MF with Ez potentially, but I prefer MF.  Same with Lulu for Janna.\n\n-  No Utility -\n\nThis one is the hardest of the 5 challange missions (Although saying that, it is ironically the mission I got my best score of 6.1k with, partially due to what makes it the hardest).   No utility means you don&#039;t have a Poppy to tank, or any of the supports to amp your carries.  You have to use Lux as the closest thing you got to a support.  Team comp is {{champion:222}} {{champion:99}} {{champion:134}} {{champion:21}}, and either {{champion:81}} or {{champion:103}}.  The core thing that makes this mission hard is you have NO room for error.   Your clear times will be very very fast, but its hard to keep people from going down.  If people do go down, you&#039;ll lose rapidly and have to restart.   I recommend the Tank Syndra build from above if you are not 100% confident, although if going for the challenge of getting an S+ on this, damage Syndra is also an option.  This team comp is all about killing everything ASAP, and you&#039;ll kill even Cho&#039;gaths in almost no time.\n\n\n**Score Mechanics and Notable Rounds and how to beat them**\n\n_How your score is decided, and what it takes to score that elusive S+_\n\n- Score is a factor of 2-3 things, depending on the specific round you are playing.\n\n1.  Every death takes 50 points away, up to a cap.   After 4 deaths, you&#039;ll lose out on the maximum number of points you can lose to deaths in a single round, which is 200.  The only exception is follow the circle maps, which have double the penalty and score max loss from deaths, at 100 points lost and 400 total that you can lose.\n2.  Time.  For any mission where you are not on a follow the circle map, you are on a timer.   The longer you take, the more points you lose.   Make sure you kill Skarners and Khas quickly on such maps, because otherwise they will frequently hide in the darkness or run away and burn down your timer, costing you points.  The timer is on a per-mission basis, and you can&#039;t really see it, but the objective popup in the top right tells you what the S timer is and how long you took when you finish a round.  If only it told you how much time was on the clock for that S though... try and keep track is all I can say, and don&#039;t waste any time when you can help it.  You may want to save your burst ults for later stages of a round to help ensure you burn through the final spawn wave in time, but it depends.\n3.  Bonus points.  Some follow the circle maps will produce special bonus points for killing all of the boss monsters along the way.  It isn&#039;t much, but an extra 50 points is an extra 50 points.\n\n_Score requirements for getting an S_\n\nThe minimum score to get an S is 5000 points.   An S+ is 5400 points as far as I know (It may be lower, but I doubt it.  I&#039;ve never seen it below the 5400 cutoff).  Obviously the S+ is only for style points, as it only takes an S to get max mission rewards.\n\nKill things fast, and don&#039;t die.  It&#039;s that simple.  Optimally, if you are perfectly playing through the first 7 rounds before the boss, you should end up with around 4000 points, give or take 100.  Most rounds are worth 600 points (Some can potentially get up to 700+, and others are nearly impossible to kill in the time they say you can kill it, so you&#039;ll only get 400-500).  The boss can reward up to around 2000 points, if you make a very very fast kill with no deaths, but even 1-2 deaths won&#039;t hurt your score that much, and 4 deaths is the max for points lost to deaths (although you&#039;ll struggle to make the kill speed needed to negate that in that case).  The boss is the only place where your score is virtually unlimited for that round, and can make up for a few bad rounds in other places.  So long as you have around 3300 points before the boss fight, you can possibly recover on the boss to still score an S for your total mission score.\n\nOne final important note for score.  Retries do NOT hurt your score, and fully reset your score for that round.  If you see a round absolutely flop for some reason (Velkoz road where you fail to kill everyone at the start for instance, or just a high death Velkoz lazor bridge, or maybe just a round where your team did it stupidly slow when you normally wouldn&#039;t have because of poor team targeting on important targets), you may just want to have everyone suicide and take another try at that round.\n\n\n\n_Notable rounds_\n\nEveryone knows some rounds are far harder than other rounds.  There are a few tips and tricks that can optimize to help make them easier to survive.\n\n1.  Kogmaws from FoW (Round where 4 vels spawn at top left, and the area closes on you).  Simple trick is to kite back to the top-left corner while team focusing one of the chos or Rek&#039;sais, and once the kogs chase you out of the FoW, turn on them and kill them all, then finish the remaining chos or reksais.  Fairly easy round that shows up by round 1-2, but still.\n\n2.  Any variant of the Velkoz death bridge - Watch for the spawn of the first small velkoz.  In about 20 seconds, lazor koz spawns.  Have someone with an instant CC ready to go, such as Soraka&#039;s E silence.  CCing the laser guy just as he uses his laser puts it on cooldown for several seconds, giving you some time to clear other stuff before you cc him again to stop the laser again.\n\n3.   Late game velkoz heavy circle walks - Devote the time to kill the koz&#039;s at the start.   Never let one make it, even if you have to take some of the void damage.  If you have someone like MF, Jinx, or Syndra, this is a good spot to pop ult.    Just never let one of the ones behind you survive or everything gets 3x harder.  If you have a tanky frontline with good MR with several shielding supports (example, you have an Ahri who started Wit&#039;s End or a Poppy with a Negatron cloak with a Janna and Lulu supporting), having them sit in front of the team between them and the shots while the supports chain shields on them can be a viable strat to help prevent the need to dodge.\n\n4.    Vel&#039;koz circle on the really big map - Go either clockwise or counterclockwise as a team, burning through all the koz in order.  Make sure you do it as a team, as you want to go quickly and not get picked off by the Skarners pulling you through several shots.  Later missions will spawn added chogaths, and the latest version of it will spawn a final wave of Khas and cho around the time you should be finishing the last few Koz&#039;s.  If you find they are already spawned before you kill them all, it is implying your kill speed is too low and you screwed up elsewhere earlier on.   On the verison of the map that starts in the top right and spawns the boss chos, leave one guy to clear out the &quot;respawning&quot; koz&#039;s, while the rest of the team kites the boss cho&#039;s back focusing on one at a time to the other side of the map, where there are some more koz&#039;s.  Kill those, and as you do, another cho should spawn.  Continue as prior, kiting to kill.  Never ever let the cho catch the person who is marked to be eaten.  Prioritize killing skarners near the marked targets, as they will happily pull them into a cho for a hard to resist kill.\n\n_**THE BIG BAD**_\n\nThere are several core details to remember when fighting him.\n\nHis spin attack can be dodged in one of 3 ways, and another way can migitate the damage you take if you can&#039;t dodge it.\n\n1.  Just run around him.  If at close range and you react fast, you can lap him and not get hit.\n\n2.  Dodge behind a pillar, obviously.\n\n3.  Flash the sphere line.  Its your flash CD, but that can save you several hundred to thousand damage, especially if you are in a position where the spin attack is otherwise unavoidable.\n\nIf you can&#039;t dodge it, instead run strait through at a diagonal from a distance.   You will still take a hit, but most people can survive one or two hits.  Tanks can even take a few more.\n\n\nSpawning patterns and tips.  The boss doesn&#039;t have any fixed spawning patterns, but will actively spawn people more frequently if taking damage.  If you apply a massive burst of damage, the boss will enter an enraged state and spawn even more rapidly.  Watch the boss for the lines between her and the stuff she spawns.  If you see the line fly off into the distance, check your minimap INSTANTLY.  If its Vel&#039;koz&#039;s that spawned, instantly back off the boss and go kill them.  If its chos and Rek&#039;sais, you can afford to leave them for the next spawn wave.   Once you have a few sets of mobs spawned, regardless of who they are, back off the boss, and clear them out.  Even if they are not a risk to you now, all it takes is a single bad spawn set to spawn with them to throw things completely out of your control and cause you to chain-wipe.\n\n\n**Side notes**\n\nUltimately, what matters most isn&#039;t your team comp or builds even, but how your team acts.  Optimal builds with terrible planning on what you do as a team will get you nowhere.  Voice coms helps, but is NOT required.  I&#039;ve gotten several S+ with no mic in play.  You just need everyone to know what they are expected to do, and to be proactive on the pings to tell people to check the map.  If you ping what you are planning to do, and the team knows to pay attention to those pings, it makes a world of difference.  Try and leave a single person as a designated shotcaller on the team and they be the only one who pings, guiding what you all do (Except for the cases of people pinging velkoz spawn in the boss fight, everyone should do that to ensure it gets noticed ASAP).\n\n\n\n\nFinally, ask for any clarification where needed.  I may have forgotten to list a few of those rounds in the section talking about rounds, if there is any round you can think of you having an issue with ask and I&#039;ll add it.","replies":[{"poster":"Riot Defaultchar","date":"2017-09-10T16:21:11.747+0000","up_votes":52,"down_votes":7,"body":"Really awesome guide, and glad you're enjoying the mode! Definitely agree with you on Jinx's strength, although hopefully the others feel good as well :). Great callout on Last Whisper: I ended up not removing it because of LDR, but might still be too much of a trap item.\n\nJust to clarify a few small things:\nYou're right that it's ~~5000~~ edit: 4950, I can do math <.< (S) + 5400 (S+). Individual Rooms require 550 or 600 for S/ S+ (Boss is worth double, so 1k/ 1200), but that's not super relevant for final score :) More of a guideline.\n\nThe Bonus Points are actually just \"Kill any Boss Mob in the entire zone\": Don't need to kill all of them. Big one I'd call out here is making sure you pick off the Elite Vel'Koz at the end of the hallway: Almost every other situation it's hard not to.","replies":[{"poster":"Blush Gun","date":"2017-09-10T16:39:37.883+0000","up_votes":34,"down_votes":0,"body":"It would be really awesome if you guys added a permanent raid mode!","replies":[]},{"poster":"RageOnNoobs","date":"2017-09-10T20:28:37.458+0000","up_votes":2,"down_votes":23,"body":"Lets be honest here. An average player cant even beat this mode. Ive been playing this and the only time ive beaten this are with plat or higher. (Im plat) how do you expect the majority of your player base to win it.ps im talking about getting an s or higher","replies":[{"poster":"Steelflame","date":"2017-09-10T21:03:09.570+0000","up_votes":13,"down_votes":0,"body":"I've gotten plenty of average (Silver/bronze players) through the mode.  They may need a guide or a little help, but many of them are not as helpless as you would think.","replies":[]},{"poster":"Eddard Sheeran","date":"2017-09-11T01:31:01.066+0000","up_votes":15,"down_votes":1,"body":"relevant username","replies":[]}]},{"poster":"AirKingNeo","date":"2017-09-10T19:42:18.120+0000","up_votes":4,"down_votes":0,"body":"Once Ardent Censer gets nerfed, the mode will probably have to get nerfed, since a lot of it revolves around Ardent Censer.\n\nHopefully re-releases of the gamemode allow you to play any champion (and keep the restriction event based).","replies":[]}]},{"poster":"yoshi2790","date":"2017-09-10T17:12:32.337+0000","up_votes":4,"down_votes":14,"body":"In your awesome guide I think you forgot something: buy {{item:3098}}. the item gives you around 1100 gold in a whole game, so if you substract the item cost it gives you 250 gold for free and the stats. You could always sell it if you have full build.\nThe first rounds aren't so hard so you can afford to sacrifise so stats, once round 3-4 Your gold should be equal and the last rounds you get a bonus.\nThe passive also helps at kiting monster like rek'sai and CHo'Gath","replies":[{"poster":"Steelflame","date":"2017-09-10T17:17:58.086+0000","up_votes":20,"down_votes":0,"body":"No it doesn't.    There is a hidden aspect to the mode where any bonus gold you gain mid-round is subtracted from your final total reward.   If you want fang items, you want it to try and charge up for the MS boost.","replies":[{"poster":"yoshi2790","date":"2017-09-10T17:33:52.373+0000","up_votes":8,"down_votes":0,"body":"oh didn't notice that :/ \nGuess I should stop buying it then.","replies":[]}]}]},{"poster":"La Moustafette","date":"2017-09-10T19:46:42.262+0000","up_votes":2,"down_votes":1,"body":"I dont get it, why AD Ahri ?","replies":[{"poster":"Melledoneus","date":"2017-09-10T19:59:33.194+0000","up_votes":13,"down_votes":0,"body":"AP doesn't have enough consistent damage to clear out most targets. The burst is either extreme overkill or tickling targets.","replies":[]}]},{"poster":"HeresyHorus","date":"2017-09-10T18:31:34.713+0000","up_votes":3,"down_votes":28,"body":"{{item:3124}} ?! ...\n\nNo Mages please.\n\n2 ADCs with {{item:3153}} {{item:3031}} {{item:3087}} {{item:3046}} {{item:3812}} + Armpen items and their personal bitches retinue ( 2 Supports + Tank ) .\n\nGG EZ","replies":[{"poster":"Steelflame","date":"2017-09-10T18:42:59.792+0000","up_votes":21,"down_votes":0,"body":"Yea, No Mages was my first S comp, and I ran it accidentally getting said S.  You can replace one of those supports with a Lux, but it isn't crucial.\n\nI'm also impressed with how you buy 5 full items in a mode where you only get 10700 gold.","replies":[{"poster":"MavenSong","date":"2017-09-10T22:50:06.539+0000","up_votes":7,"down_votes":0,"body":"Actually 6 full items, he also said either of the 2 Ar Pen items just not the icons","replies":[]}]}]},{"poster":"Raxistaicho","date":"2017-09-10T17:26:44.644+0000","up_votes":8,"down_votes":0,"body":"It's hilarious that Ahri's so ill-suited to this mode that you have to build her adc to make her work.","replies":[{"poster":"Steelflame","date":"2017-09-10T17:54:10.667+0000","up_votes":10,"down_votes":0,"body":"I mean, in her case, she rides a razor fine line of balance on SR where she need to keep her damage low enough for an Assassin that she has some counterplay, but strong enough to not lose out.    She has a lot of power tied up in her ult on an AP build, and you just obviously can't use that frequently in this where it would just be flat out better to have more consistent DPS output that doesn't depend on ult.","replies":[{"poster":"Raxistaicho","date":"2017-09-10T18:13:50.580+0000","up_votes":2,"down_votes":11,"body":"Honestly this whole game mode is a blatant case of Riot shoving square pegs into round holes.","replies":[{"poster":"Novanious","date":"2017-09-10T19:21:06.914+0000","up_votes":19,"down_votes":3,"body":"And they did a pretty damn good job of it.","replies":[]}]}]}]},{"poster":"Melledoneus","date":"2017-09-10T19:46:24.634+0000","up_votes":9,"down_votes":4,"body":"See, if they chose Shen instead of f*cking Ahri for this line, we would have two great comps for onslaught.\n\nhttps://i.imgur.com/hSl533W.gif?noredirect","replies":[{"poster":"Steelflame","date":"2017-09-10T19:53:20.058+0000","up_votes":13,"down_votes":2,"body":"Pretty sure just for skin line thematics Leona would be a better fit than Shen.  And Shen wouldn't be too great in the mode, just passable.","replies":[]}]},{"poster":"cocacolalips","date":"2017-09-10T18:08:09.647+0000","up_votes":2,"down_votes":8,"body":"Gotta point out stoneborn pact is a noobtrap on anyone but poppy, the combo ardent censor + windspeaker blessing is a lot stronger than ardent censor + stoneborn pact, for obvious reasons, stoneborn pact is really bad on ranged champions, ardent censor would have to be twice as overpowered as it is now to make up for the fact you aren't taking an useful keystone, and it's not that overpowered.\n\nSource: https://lolalytics.com/star/worldwide/platinum/plus/champion/Soraka/","replies":[{"poster":"Steelflame","date":"2017-09-10T18:44:52.125+0000","up_votes":9,"down_votes":0,"body":"I'd agree on normal SR.  But the important part about Stoneborn is reliable constant proccing of the Ardent across the entire team, and the extra on hit sustain it grants to the carry.\n\nRemember, this mode is not SR, and plays differently on several fundamental levels, especially on things that are optimal for in mode (Great case in point... Ahri is an ADC optimally in this mode.)","replies":[{"poster":"cocacolalips","date":"2017-09-10T19:06:23.315+0000","up_votes":1,"down_votes":6,"body":"the link I shared is from the star guardian map. it's not good on this map either.","replies":[{"poster":"Steelflame","date":"2017-09-10T19:49:58.400+0000","up_votes":5,"down_votes":0,"body":"Actually, I think I can see where the discrepancy from my setup to the \"most win\" setup is.  The site is only tracking wins, not S's.   If all you are trying to do is scrap a win together at any cost, Windspeaker would be faintly stronger, because its better for the cases where someone is reviving from dead.   You shouldn't have a single death on S runs, and gearing for the \"loss\" cases of needing to Revive someone isn't an accurate booster.","replies":[]}]}]},{"poster":"My Waifu Vanilla","date":"2017-09-10T19:12:45.633+0000","up_votes":6,"down_votes":0,"body":"It's the fact  you can apply Ardent on multiple carries through it much easier. Lulu can't get Ardent on more than 1 person ever outside of it (while Q applies it to everyone that auto attacks the target) and Janna/Soraka can't apply it to multiple people outside of their ultimates. Windspeaker's extra healing/shielding is usually irrelevant because you are trying to not take damage in the first place whereas increasing the damage of 1-2 extra people a cast helps speed things up quite a bit.","replies":[{"poster":"cocacolalips","date":"2017-09-10T19:23:54.036+0000","up_votes":1,"down_votes":7,"body":"windspeaker blessing  is both a 10% healing-shield buff and a armor and mr buff, that potentially affect all teammates. that's a lot of extra effective health. stoneborn pact is literally nothing, unless you are melee and stack health. you are effectively comparing 'windspeaker blessing (very strong buff) + ardent censor' vs 'nothing + a slithly stronger ardent censor' and as the data shows it, the latter is simply not as good.\n\nit doesn't help that in the same mastery trees, you are missing on intelligence (5% cdr) and instead getting nothing as well.","replies":[{"poster":"DSpaceman","date":"2017-09-10T23:21:53.823+0000","up_votes":5,"down_votes":0,"body":"The stoneborn pact effect doesnt matter, you dont take it for that, you take it for the fact that it procs censers passive on everyone who hits the target you Q with lulu or janna. With windspeakers you only proc the buff whenever you shield or heal one person at a time or use your janna ultimate (for like 3 or whatever seconds) whereas with stoneborn pact, everytime you Q a mob, whoever is hitting it gets \"lifesteal\" from the censer passive and also a tiny little bit from the actual mastery\n\nedit: plus i just thought of if your ADC get rageblade, at 6 stacks every other attack applies 2 instances of on-hit effects, so it synergizes with that as well. ","replies":[{"poster":"cocacolalips","date":"2017-09-11T00:05:13.603+0000","up_votes":1,"down_votes":9,"body":"you are all missing the point\n\nif keystone A = 1 point and keystyone B = 0 point and ardent censor = 1 point, then you have A + ardent censor = 2 points and B + ardent censor = maybe 1.5 points (1.5 because you apply ardent censor more zzzz), it's literally maths, 2 > 1.5. it doesn't matter what you take it for if it's the inferior combination.\n\nyou can argue all you want, at the end of the day there is only one numerically superior combination and data suggests it's the former.\n\nits exactly the same reason why you buy x or y item or have this rune or that rune, because it's better, and it's the same here.","replies":[{"poster":"YaloMan","date":"2017-09-11T06:51:49.182+0000","up_votes":5,"down_votes":0,"body":"I think your missing a point also, 0 + 1 = 0 not 1.5...... \n\nalso, you are arguing by raw numbers instead of thinking about the fact that procc for stoneborn pact is more beneficial across the entire team in a pve map unlike SR. You are also forgetting that not every champion you use windspeakers instead of stoneborn pact on is giving extra lifesteal to your AD carries, instead of extra healing and shielding per skill used on those champions. Lulu is going to be utilizing the shielding component of that keystone, but will miss out on giving out healing the rest of the team who attacks the debuffed target with stoneborn pact. Janna can utilize both.  All allied champions heal the percentage on your team who attack the target you are attacking as the support. Also, you should consider that life steal is weaker on this map specifically, and extra healing from stoneborn pact provides a different look at it. You should also consider the point of taking stoneborn depending on the composition that you are trying to win the mode in. \n\nObviously, stoneborn pact IS going to be the absolute optimal to be used on Poppy, especially if your buying warmogs + health items, etc. However, there are going to be those team comp cases where you can't take poppy if you want to pass the quest. Better healing overall to your entire team in those instances? or better shielding? Isn't it why they say things are \"situational\" based on scenario? It can also just come down to preference. You prefer the healing rather then the shielding. Your supposed inferior combination shines in a different scenario, rather then your supposed one. \n\nThe question is, is what your going for going to need the healing? Do you prefer to use that keystone over this one? Consider the fact that lifesteal is mitigated on this map, people still prefer to build bork even though it isn't optimal due to lifesteal mitigation the more members fall, doesn't that point alone counteract your point as well? \n\nYou are arguing the fact that in the end, coordination is still key, as well as understanding why each keystone would work given the situation and builds, not that one is better then the other simply by your numbers.","replies":[{"poster":"cocacolalips","date":"2017-09-11T14:04:02.629+0000","up_votes":1,"down_votes":8,"body":"that bronze logic, it's so painful to read, you can say the same kind of fallacy for critical dmg runes or critical chance runes or whatever, it doesn't matter, you don't pick those runes because they are numerically worse even though you think they look appealing, they aren't because numbers. that's why it's called a noobtrap, yes stoneborn pact + ardent censor look appealing, it sounds like a cool interaction on paper, but it's really not, it's bad, you are losing more than you are gaining by picking it over windspeaker blessing.\n\nRiot 100% considered that when they made the stoneborn pact keystone, that's why they nerfed it by half for ranged champion, because they didn't want that interaction to be viable (hello support ashe/mf). If stoneborn pact was better on ranged champions that it currently is, it would probably be a competitive keystone but it's not good enough, and the combination of it with ardent censor is also defacto, not good enough.\n\nnow Im done because I don't see the point of arguing further with bronze players, I hate arguing with bronze players, I provided facts, supported by some reasoning that would explain those facts to hopefully shed some light as to why stoneborn pact wasn't as good as it sounds, you provided nothing but misconceptions and fallacies, you do what you want with that.","replies":[{"poster":"My Waifu Vanilla","date":"2017-09-11T19:45:27.461+0000","up_votes":4,"down_votes":1,"body":"Stoneborn Pact isn't viable on ranged champions because Ranged champion (typically) have god awful base stats to support such a keystone AND don't build enough health to justify it either. The only ranged champion in the game that would even consider taking it is Gnar because he can apply the buff easily (Mallet, Both Qs, and Mega W/R) and actually builds enough health to justify and isn't ALWAYS super squishy (and the 5% health does sort of band-aid the ability to just kill mini-gnar). You don't see Stoneborn Pact on the likes of MF/Ashe (even in support roles) because even IF the heal wasn't halved for Ranged Champions you would STILL get a pitiful amount of health on the heal because neither of those champions would have enough health to warrant it (MF would have a sightstone and a BC and Ashe would literally just have a Sightstone which brings their health totals to 2500 or so at the end of the game since support Ashe/MF are arguably not getting anywhere near level 18 unless it goes to 40+ minutes). That means Ashe would heal someone for a whopping 63 every 2 seconds per auto attack while also providing her absolutely nothing out of her keystone until like 20 minutes since the heal is so negligible before that point (and is arguably STILL negligible at 31 hps).","replies":[{"poster":"Mysticman89","date":"2017-09-11T20:36:12.414+0000","up_votes":4,"down_votes":1,"body":"Ardent/pact ashe support is surprisingly legit (...relatively speaking), and if you're going to play support ashe (which you probably shouldn't), I feel you should opt for pact.\n\nPact could heal 0.1 hp and it'd be worthwhile in the contexts being discussed. It's not about the pact heal itself, so much as the pact heal is a heal/shield for the purposes of triggering ardent. Applying pact to one enemy means you can give the ardent buff to all 4 teammates reliably, where most champs have only single target heals/shields or long cooldowns making that much harder to do.","replies":[]}]}]}]}]},{"poster":"Fairyfleur","date":"2017-09-11T16:36:32.457+0000","up_votes":2,"down_votes":0,"body":"Also wanted to point out that all enemies affected by the slow on Lux's E have the debuff applied to them.","replies":[]}]}]}]},{"poster":"Rebel Phoenix17","date":"2017-09-16T07:18:17.776+0000","up_votes":4,"down_votes":0,"body":"So first of all, as you yourself point out in this thread, there is not enough sample size on the Stoneborn pact to draw conclusions. It could be that it does represent the norm and at the same games played it would still have a relatively higher winrate. Or it could be that the small sample size is only on good players / good rng and factoring in more players would reduce it. We cannot safely extrapolate to compare it to Windspeaker's stats. So the link is irrelevant. All it tells us is that more people go Windspeaker's (which does not indicate it is better) and that those few using it find slightly more success than the masses using Windspeaker's. \n\nWhat we can tell is the actual numbers. None if this keystone A = 1 and B = 0 psuedo-analysis. If we use the items as listed, then the champs stats are as follows:\n\n|Champion-----|HP-----------------|AR---------|MR---------|AP-----------|\n|-\n|Lulu\t        |2344.65\t|241.1\t|68.5\t|85.6\n|Soraka\t        |2997.75  \t|172\t        |98.5\t|85.6\n|Janna\t        |2113.65 \t|93\t        |68.5\t|399.06\n\nFrom there we can she how much HP (more importantly the effective physical and effective magic health) is gained and how much healing is lost for running SBP over WSB.\n\n|Champ-----|HP-------------|Physical HP-----------------|Magic HP-----------------|\n|-\n|Lulu\t|111.65\t|380.83815\t|188.13025\t\n|Soraka\t|142.75\t|388.28\t        |283.35875\t\n|Janna\t|100.65\t|194.2545\t|169.59525\t\n\n|Champ-----|Ardent-|Q-------------|W-----------|E------------------|R--------(Amped Raka Ult)---|\n|-\n|Lulu\t|-2.5\t|0\t        |0\t        |-5.136\t        |0\t      \n|Soraka\t|-2.5\t|-3.424\t|-5.136\t|0\t                |-4.708\t(-4.9434)\n|Janna\t|-2.5\t|0\t        |0\t        |-27.9342\t|-59.859\n\nFrom this we can see that with the exception of Janna E R and Soraka R (since it hits 5 ppl), the healing and shielding lost is actually pretty small. Especially on Lulu, you barely lose anything since only her shield is buffed. Her ult is not.\n\nIt would be rapidly fluctuating but we can assume that Jinx would attack roughly 3x faster than any non ADC in the game with close to or equal to 2.5 attacks per second compared to the ~.75 of champs without attack speed items. The next fastest is Ahri who attacks roughly 2.5x faster than non ADCs.\n\n___________________________________\n{{champion:117}} \nStarting with Lulu, she can only apply Ardent to one champ at a time - her E cooldown is exactly as long as the buff lasts. Theoretically with Stoneborn she can apply it to her whole team.  It would take 12 autos from one champion to match the healing provided by giving a second auto. So unless your Jinx autos 12 times as fast as everyone else on your team, you walk away with more healing. \n\n* Easily get more than enough healing to compensate the 7.5 points of heal/shield lost and the 22 armor.\n\n_______________________________\n{{champion:16}} \nSoraka is a bit trickier. She can naturally apply ardent to 3 people without her ult, and 4 with it. She can technically even apply it to a fourth person, but the first would lose the buff after 0.4 seconds, and you wait 1 second before reapplying. Factoring imperfect timing, 3 is your realistic cap. So you would need to be getting much more out of the Ardent's increased uptime to compensate for the healing lost on her ult. \n\nIf stoneborn allows you to ardent 1 additional non-adc, a single auto from them, plus 2 other champs and 3 from jinx would give a net heal of **180 HP**. Compared to 3 champs with Windspeakers gaining **162.5 HP**. \n\n* gain 17.5 healing every time your Stoneborn buffed ally autos \n* lose 3.4 on Q and 5.1 on W\n\nEven if we assume you were buffing Ahri and Jinx Stoneborn gives 220 and Windspeaker's gives 211.25. Here you only gain 9 healing for each auto, which is much closer to what you lose on Q and W. Add in the fact that you lose healing on your ult and you have a decent argument, but you are capable of having 91 seconds where you gain healing from ardent before losing a maximum of 25 from ulting. Overall the heals gain on ardent is still more effective.\n\nAlso the armor you lose out on giving Jinx is made up for in the nearly 400 effective health you gain against physical damage (and the bonus 280 you gain against magic).\n\n______________________________\n{{champion:40}} \nProbably the only one I agree with you on. Since she doesn't have as much health as the others, or as much in resistances, the 5% health gain is weakest on her. It only gives ~200 effective physical HP and ~170 effective magic. Jinx with a ruby crystal would gain about 450 health against physical damage from Windspeakers armor. So you no longer get a winning trade here.\n\nWithout her ult, Janna can only give ardent to one person, much like Lulu. While she could easily CC 2 or more targets - safely providing Ardent to 2-3 champs with Stoneborn.  If you only consistently have ardent on 2 champs, you would be gaining about 22.5 healing, while you lose 28 health on your shield. So you would need to try to keep ardent on 3 champs to net positive by taking stoneborn.\n\nIt gets worse when you consider a full ult loses about 60 HP per target, and would apply ardent to all allies regardless.\n\n\nTL:DR\nStoneborn is a noob trap on Janna, but is better on Lulu and Raka unless you only have one carry that you want to give armor to and don't give a shit about healing others.","replies":[{"poster":"cocacolalips","date":"2017-09-16T11:57:10.815+0000","up_votes":1,"down_votes":4,"body":"zzz, you are not playing against target dummies, in the perfect scenario, where no one is getting hit, no one is getting ccd, no one is moving, the monsters aren't moving either, everyone is always grouped and always attacking the same target, yes you might be able to get away with stoneborn pact, but who the fck cares, that's so incredibly situational and non realistic, in an actual game, monsters move and fight, people move and fight, people run away, people get ccd, people get hit, people don't always have stuff to attack, sh!t happens, etc.. good luck using stoneborn pact on the boss who is cc immune when he is focusing your adc and you can't heal for crap or protect him.\n\nalso Soraka W heal over time (whenused after Q) refreshes ardent censer and stuff for a total of 11 seconds.\n\nalso winspeaker blessing buff all your healing and shielding spells, including items.","replies":[{"poster":"Rebel Phoenix17","date":"2017-09-16T19:30:34.387+0000","up_votes":3,"down_votes":0,"body":"Glad I can talk to a brick wall here, its good to see you came to a discussion board to fail to discuss. It's very easy to sit there and claim you are the master of all knowledge when you choose to provide no validation. Here let me show you: Stoneborn is better because more allies get ardent procs.\n\nYou're correct I forgot to add a field for Redemption, and in Janna's case Athenes. Redemption will once per round heal allies for 444 HP with Stoneborn, and 481 with Windspeakers. As before, on lulu you can easily make up the difference, on Soraka it is both possible and likely and with Janna it probably won't happen. Considering I've already said Janna's better of with Windspeaker's, doing the math for Athene's is a waste of time.\n\nVery good of you to know that monster's in this mode act, I'm impressed, truly. Except we're theorycrafting here and unless you have one hell of a complex formula for calculating the average DPS as well as peaks and troughs when accounting for time to dodge and invariably being CCed then this whole statement is irrelevant, because regardless of which keystone you take you will have to account for that. \n\nWhat we do know is that \"In an actual game\" Soraka can very easily CC multiple targets that her allies can auto, leaving you with a net heal. Lulu can very easily glitterlance multiple targets, put a shield on Jinx and polymorph whatever big bad she wants. The bottom line is if you are accounting for imperfect play then Stoneborn provides a better safety net by allowing for more applications of your buff to be present from more sources. It's not \"incredibly situational\" it's what happens in this mode. Are you going to tell me no one auto attacks? Because that's a much bigger problem than picking your keystone. If they are autoing and you aren't AFK then you have significantly increased ability to apply Ardent by taking Stoneborn. Windspeaker's only buff's Lulu's E, with Stoneborn Ardent can apply on all 4 of her spells. Soraka can get ardent by rooting with E, or simply by tossing a Q at the cho you're AD is killing while she chooses to use heals on your MF or Lux since they are lower. Janna should go Windspeakers to be safe, but even she - as long as she can manage 2 or more additional Ardent procs - can come out on top by taking Stoneborn.\n\nIt's true you cant CC the boss. It doesn't matter you can still CC all of the big monsters he spawns, unless you plan on only ever hitting the boss, in which case I apologize for you  constant and inevitable loss in this mode. Furthermore, as the numbers show, you lose almost no healing, so unless you think you heal for crap in both cases you've dug yourself a solid hole to sit in.\n\n> also Soraka W heal over time (whenused after Q) refreshes ardent censer and stuff for a total of 11 seconds.\n\nOh man, finally some quantitative evidence to your side of this debate. You're right, as long as Soraka can consistently apply Rejuvenation to her allies she gets more Ardent uptime than I initially stated. So in the perfect scenario you had so much fun \"explaining\" could never happen she will get it on all 4 allies. If that's the case then you are weighing the 8 HP lost to allies against the 142 HP (effective 388 and 283) gained. You could still make an argument for either side here, but it is much more reliable for you to achieve constant 4 Ardent buffs by taking Stoneborn. I wouldn't tell someone they're wrong for taking Windspeakers though. Before considering this I would have told them Stoneborn is better, now I'd consider it a matter of preference. I'd personally rather have a more resilient healer that can consistently top off the whole team.","replies":[{"poster":"cocacolalips","date":"2017-09-16T19:45:26.936+0000","up_votes":1,"down_votes":3,"body":"there is not a lot o discuss, you sure wrote a lot, but all your numbers are based on some ideal case scenario, which doesn't happen in game. \n\nI can make an ideal case scenario to prove you are wrong too, look, you have no one to attack and you are getting sh:t on by 10+ velkoz from across the map, I bet stoneborn pact is really good in that scenario too. not.\n\nat the end of the day, I'm only repeating myself, windspeaker blessing is better and safer in most situations, and there is no reason to take stoneborn pact unless you are playing in a 5 man premade with good players who know what they are doing and you aim for S and make no mistake (thus don't need the extra ehp you get from either keystone)\n\nalso, looking at the stats again, 3% of 600k games = 18K games, which while still low is technically enough of a sample size, stoneborn pact is not as bad I painted it to be in my first post clearly, although it's likely those 3% are from premades like I said, which means the stats are biased.","replies":[{"poster":"Rebel Phoenix17","date":"2017-09-16T20:56:23.182+0000","up_votes":2,"down_votes":0,"body":"At the end of the day you are repeating yourself without ever defending your stance. The \"ideal scenario\" you think I'm describing is honestly \"can your team auto attack?\" Which in this mode is almost universally yes. Even in the velkoz heavy circle walks there are skarners and cho'gaths for you to be attacking. So in most situations no windspeaker is not safer for your team since Stoneboard will across the board get you more healing. \n\nIn Janna's case your single target shield drops in favor of high consistency team heals. For lulu you get the same benefit. On Raka you are putting the onus on your allies to auto, since you lose ~8 raw healing but give everyone the more constant ability to get 30/AA.\n\nThe extra health does matter in an organized S run, since you will still have many scenarios where you utility champs get low, especially soraka since she's expending health to get heals.\n\nAnd sure 18k games is a lot, but its the relative value thats more important. We're still only seeing 3% of players, so we cant be sure of whether its select experts, or highly organized premades as you said.","replies":[]}]}]}]}]},{"poster":"Fishing Boat","date":"2017-09-14T05:30:03.585+0000","up_votes":3,"down_votes":0,"body":"Windspeaker's doesn't give you more damage. The stoneborn combo gives aspeed, onhit AND healing. It's just way better. Stop being stubborn. The job of all of the supports is just to give jinx and mf more damage and onhits and safety.","replies":[{"poster":"cocacolalips","date":"2017-09-14T09:08:05.118+0000","up_votes":1,"down_votes":4,"body":"rofl, you can feed your ass off with your teammates in your games if you want, excuse me while I win all my games.","replies":[{"poster":"earthmeaser","date":"2017-09-14T11:21:52.266+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=cocacolalips,realm=NA,application-id=3ErqAdtq,discussion-id=KFaAxs9y,comment-id=001100020000,timestamp=2017-09-14T09:08:05.118+0000)\n>\n> rofl, you can feed your ass off with your teammates in your games if you want, excuse me while I win all my games.\n\n\nbut i have won all my games since following his soraka n janna build. the lulu im struggling wtih but im also sivler soooo...","replies":[]}]}]}]},{"poster":"atch","date":"2017-09-10T16:11:34.410+0000","up_votes":2,"down_votes":2,"body":"I have to disagree on Lulu and any support in general.  Going Redemption and Ardents is obvious but going Locket into warmogs makes the most sense.  Building around the person who played AD as a team just is optimal and have more health for Revives helps immensely.  Another thing, boots are completely optional in this game mode so I'd rather prioritize more damage of more health.  Other than that I feel this is accurate on other fronts good job.","replies":[{"poster":"My Waifu Vanilla","date":"2017-09-10T19:16:22.404+0000","up_votes":6,"down_votes":0,"body":"More health from revives shouldn't be a factor in the build since using revives almost always jeopardizes you getting an S for the round anyway.","replies":[{"poster":"atch","date":"2017-09-11T18:40:30.511+0000","up_votes":2,"down_votes":1,"body":"Its definitely possible to do it with multiple deaths idk what you are talking about","replies":[{"poster":"Steelflame","date":"2017-09-12T02:05:36.632+0000","up_votes":3,"down_votes":0,"body":"It is, but it puts more pressure on the run.  Every death is 50-100 points lost (unless it results in a retry).  5 deaths is 250-500 points.","replies":[]}]}]}]},{"poster":"Aeszarck","date":"2017-09-10T14:39:28.797+0000","up_votes":4,"down_votes":0,"body":"This is so helpful. Commenting to bookmark this, this is amazing work. Thanks.","replies":[{"poster":"Hello I am Bird","date":"2017-09-10T17:53:24.655+0000","up_votes":1,"down_votes":3,"body":"That isn't how bookmarking works tho.","replies":[{"poster":"Aeszarck","date":"2017-09-10T19:14:48.838+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Hello I am Bird,realm=NA,application-id=3ErqAdtq,discussion-id=KFaAxs9y,comment-id=00030000,timestamp=2017-09-10T17:53:24.655+0000)\n>\n> That isn&#x27;t how bookmarking works tho.\n\nI look through my post history occasionally, so since I've commented on this post I can view it again. If I don't comment on a thread I'll forget about it forever.","replies":[{"poster":"Hello I am Bird","date":"2017-09-11T00:27:28.008+0000","up_votes":3,"down_votes":0,"body":"Fair enough. Sorry if it came across as bitchy.","replies":[{"poster":"Aeszarck","date":"2017-09-11T01:37:04.360+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Hello I am Bird,realm=NA,application-id=3ErqAdtq,discussion-id=KFaAxs9y,comment-id=0003000000010000,timestamp=2017-09-11T00:27:28.008+0000)\n>\n> Fair enough. Sorry if it came across as bitchy.\n\nIt's ok, you're right that it isn't really bookmarking, I just call it that. Maybe I should just say I'm archiving it by putting it in my post history.","replies":[]}]}]}]}]}]}