{"poster":"JohnDoe1337","date":"2019-06-28T03:09:28.915+0000","title":"Ich vermisse meinen ersten Account.","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Spiele das Spiel jetzt schon echt lange und es macht mal mehr mal weniger Spaß aber immer komm ich drauf zurück,\r\nwurde leider wegen meines dummen chatverhaltens gebannt ..permanent ...dachte so etwas geht auch gar nicht.\r\n\r\nTut mir leid \r\nkann man denn da nichts machen ? \r\n{{champion:20}}","replies":[{"poster":"You Got My Name","date":"2019-06-28T06:11:25.110+0000","up_votes":1,"down_votes":0,"body":"Immer auf dieses \"es tut mir so leid\" masche drücken, wenn der schaden schon passiert ist. Du hattest genug chance dich zu bessern als du für mehrere Tage schon gebannt wurdest. Ab da hätte es selber für dich im Hirn click machen müssen. Hat es aber nicht.\n\nDaher zurecht gebannt.","replies":[{"poster":"JohnDoe1337","date":"2019-06-28T13:13:08.332+0000","up_votes":1,"down_votes":0,"body":"Nur leider bringt es nichts jemanden zu bannen wenn er sich das Spiel wieder runterlädt, einen neuen Account erstellt und dann mit einer noch schlechteren Grundeinstellung alles nochmal macht \n\nsollten sich vielleicht mal etwas funktionierendes ausdenken \n{{item:3151}}","replies":[{"poster":"You Got My Name","date":"2019-06-28T13:34:59.101+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JohnDoe1337,realm=EUW,application-id=7hciEY9w,discussion-id=yERIoOxL,comment-id=00020000,timestamp=2019-06-28T13:13:08.332+0000)\n>\n> Nur leider bringt es nichts jemanden zu bannen wenn er sich das Spiel wieder runterlädt, einen neuen Account erstellt und dann mit einer noch schlechteren Grundeinstellung alles nochmal macht \n> \n> sollten sich vielleicht mal etwas funktionierendes ausdenken \n> {{item:3151}}\n\nKeine sorge, Solche Leute ändern sich nicht und haben schnell denn nächsten Acc wieder gebannt :^)\n\nSo wie du da selber bei dir jetzt sagst \"einen neuen Account erstellt und dann mit einer noch schlechteren Grundeinstellung alles nochmal macht\".\nWenn du schon so an die Sache angehst ,gehört der nächste acc von dir auch gebannt.\nOder anders gesagt. Wieso spielst du das game sowieso wenn du so mental instabil/toxic bist ?","replies":[{"poster":"JohnDoe1337","date":"2019-06-28T18:27:03.801+0000","up_votes":1,"down_votes":0,"body":"Ja bezeichne mich halt mental instabil über das Internet....\nDer Account ist jetzt  3 Jahre alt seit ich da gebannt wurde glaubst du ich bin immer noch so toxic ?\nIch finde man wird einfach viel zu schnell reported und auch gebannt wegen misbehaviour was einfach nur Schwachsinnig ist wenn es einen mutebutton gibt. Wenn mich jemand beleidigt dann mute ich und gut ist jeder hat mal ein oder auch mehrere schlechte Spiele.\nEs tut mir nur wegen der schönen Skins die ich damals gekauft hatte weh... {{sticker:sg-lux-2}}","replies":[{"poster":"You Got My Name","date":"2019-06-28T18:50:45.086+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JohnDoe1337,realm=EUW,application-id=7hciEY9w,discussion-id=yERIoOxL,comment-id=0002000000000000,timestamp=2019-06-28T18:27:03.801+0000)\n>\n> Ja bezeichne mich halt mental instabil über das Internet....\n> Der Account ist jetzt  3 Jahre alt seit ich da gebannt wurde glaubst du ich bin immer noch so toxic ?\n> Ich finde man wird einfach viel zu schnell reported und auch gebannt wegen misbehaviour was einfach nur Schwachsinnig ist wenn es einen mutebutton gibt. Wenn mich jemand beleidigt dann mute ich und gut ist jeder hat mal ein oder auch mehrere schlechte Spiele.\n> Es tut mir nur wegen der schönen Skins die ich damals gekauft hatte weh... {{sticker:sg-lux-2}}\n\nAlso damit ich es richtig verstehe.\nMeine Sicht wenn ich deinen post lese: du wurdest aktuell gebannt und es tut dir leid (blabal das üblich )und du möchtest wissen ob man da was machen kann(Natürlich nicht weil perma ban ist perma ban). Du hast zu gegeben das du toxic warst \"wegen meines dummen chatverhaltens gebannt\". \n\nUnd dann kommst du und sagst mir der ban ist 3 Jahre her? wtf\n\n**> \"Der Account ist jetzt 3 Jahre alt seit ich da gebannt wurde\".**\n\nAlso da frag ich mich jetzt. Wieso machst du jetzt noch mal denn post auf?  Dich über einen ban zu beschweren vor über 3 jahren?\nDeine Beschreibung ist einfach nur mega schwammig.{{sticker:sg-ahri-1}} \n\nJunge was ist falsch bei dir? \nKlar tut das weh, ist auch der sinn hinter einer Bestrafung. \nIch spiel schon seid S1 und hatte noch nie einen ban oder einer Warnung, aber wenn meine skins weg wären, wäre ich auch meger ärgerlich, weil ich viel Geld rein gesteckt habe und seltene skins habe.\n\n**Aber genau deswegen passe ich auch auf, wie ich mich ingame verhalten.**\nIch glaub dir das es dir leid tut, aber du hattest genug Warnung durch tage bans etc, weil ein perma ban bekommt man nicht einfach so.\n\nUnd wenn du dann einfach denkst, \"joar mach ich mal so weiter. wegen toxic im chat sein werde ich schon kein ban bekommen!. Jetzt weisst du es.\n\nAber dann mit so einer aussage kommen wie \n\n> \"Nur leider bringt es nichts jemanden zu bannen wenn er sich das Spiel wieder runterlädt, einen neuen Account erstellt und dann mit einer noch schlechteren Grundeinstellung alles nochmal macht\"\n\nfrag ich mich halt, liest du selber was du schreibst?\nWenn ich das so lese, würde ich denken du machst einen neuen acc und machst so weiter wie immer. Kann sein das du es nicht so meinst. Aber so kam es für mich jetzt rüber.\n\nUnd was ist daran schwachsinning jemanden zu report der sich daneben benimmt oder toxic ist? Das report system ist automatisch und checkt was du so von dir gegeben hast.","replies":[]}]}]}]}]},{"poster":"Asulia","date":"2019-06-28T09:35:12.468+0000","up_votes":1,"down_votes":0,"body":"Ich fühle mit dir.\nIch hab allerdings schlicht die Zugangsdaten vergessen.\nAber trotzdem, Ich hätt den gern wieder aber das ist der Weg den wir alle beschreiten.\nEin schleichender Prozess, mit so Kleinigkeiten wie Accountdaten fängt es an und am Ende sitzte auf der Kellertreppe und strickst Panzer.","replies":[]},{"poster":"CptPICHU","date":"2019-06-28T05:17:14.456+0000","up_votes":1,"down_votes":0,"body":"Du musst halt leider verstehen:\nWenn Riot eine ausnahme macht und einen permabann aufhebt, kommen alle anderen\nangekrochen und fühlen sich unfair behandelt, weil sie immernoch gebannt sind.","replies":[]},{"poster":"SAO Heathcliff","date":"2019-06-28T04:56:03.669+0000","up_votes":1,"down_votes":0,"body":"Ich machs kurz, nein leider nicht. Der Account ist weg. Sry","replies":[]}]}