{"poster":"DrCyanide","date":"2016-05-25T02:59:46.095+0000","title":"@Riot, could you stop giving us 3 Air Dragons in a row?","subforum":"Gameplay","up_votes":37,"down_votes":4,"body":"Whenever an Air Dragon spawns, the general mentality seems to be &quot;Gee, that sucks. Hope the enemy team clears it quickly so we can get a useful dragon next.&quot; This mentality seems to be mirrored by the other team, which results in the Dragon sticking around uncontested for a long time (20 minutes in my last game).\r\n\r\nBut you know what makes it worse? When one team finally caves and decides to clear the stupid thing, only to have another Air Dragon set to take its place.\r\n\r\nYou know what makes *that* worse? You guessed it, going through the whole process of waiting, one team giving in and clearing it, and a *third* Air Dragon being set to spawn.\r\n\r\nIt&#039;s at this point that the only dragon that can come next is the Elder Dragon, because everything has taken so long. Guess what? Even teams without a Dragon to their name at this point value the Elder Dragon, not as a denial, *but as something actually decent to spawn in that pit!*\r\n\r\nHad a game where the Jungler was AFK at about the 20 minute mark, but thankfully we didn&#039;t need to care about securing Dragons because they were all Air Dragons. If that&#039;s intentional, then great, but if not, can Air Dragon please be made into something useful?","replies":[{"poster":"Riot Scruffy","date":"2016-05-25T17:16:32.086+0000","up_votes":35,"down_votes":1,"body":"IMO lets just buff air dragon :P\n\nSeriously though, dragon balance is an ongoing process. Expect plenty of changes over time.","replies":[{"poster":"darkdill","date":"2016-05-25T17:31:28.114+0000","up_votes":6,"down_votes":0,"body":"Any thoughts on how to buff Air Dragon? Maybe it could give faster recalls, faster respawns, or something else?","replies":[{"poster":"Riot Scruffy","date":"2016-05-25T17:46:07.471+0000","up_votes":20,"down_votes":1,"body":"Ideally we wouldn't have to add an additional mechanic and we could just amp the effects. \n\nIf we had to add stuff, things that synergized with the ooc movement speed would be the best. River speed, better homeguard etc.","replies":[{"poster":"warpenguin555","date":"2016-05-25T18:03:37.926+0000","up_votes":1,"down_votes":18,"body":"did you guys ever think of adding a super rare dragon and gives a really nice effect (maybe permanent, maybe timed)? IDK i think that a hyper rare drag would be cool XD","replies":[{"poster":"Quepha","date":"2016-05-25T18:11:42.466+0000","up_votes":21,"down_votes":1,"body":"> [{quoted}](name=warpenguin555,realm=NA,application-id=3ErqAdtq,discussion-id=H4UIAdHw,comment-id=000c000000000001,timestamp=2016-05-25T18:03:37.926+0000)\n>\n> did you guys ever think of adding a super rare dragon and gives a really nice effect (maybe permanent, maybe timed)? IDK i think that a hyper rare drag would be cool XD\n\nThe only reason people are willing to put up with the RNG element of dragon spawns is the regularity and how telegraphed it is. A hyper-rare, hyper-powerful dragon spawn would be incredibly swingy and every game it appears in would just come down to who gets the dragon at that moment instead of all the things that are supposed to matter in a game of league.","replies":[{"poster":"Illâoi Evê Siôn","date":"2016-05-25T20:51:58.328+0000","up_votes":2,"down_votes":1,"body":"How about a Gold Dragon who gives everyone on your team 100 Gold :D","replies":[{"poster":"Kürama","date":"2016-05-25T22:04:15.440+0000","up_votes":4,"down_votes":0,"body":"I'd much rather a permanent buff than 100 gold and too much gold granted from a dragon (if the gold given was increased) would probably be problematic as it would give a team that's already ahead a direct and significant increase in power.\n\nIf the team that's behind gets it well good for them, they're back in the game but it's one sided as stated above.","replies":[]}]}]}]},{"poster":"hopeful4","date":"2016-05-25T17:56:35.073+0000","up_votes":8,"down_votes":2,"body":"There are 2 problems with just amping the effect with Air:\n\n - Diminishing returns after you hit the 415 ms cap, which in the current season is hella common and ordinary\n\n- If lets say you want to rotate quickly to a sidelane in order to utilize the effect, nothing will happen if there isnt a minion wave close to the enemy tower\n\nSolutions i would propose:\n\n- Increase the ms cap or lower the overall mobility in the game (changes to items basically)\n\n- Make Air an aura that affects nearby allied minions\n\n- Your ideas about river speed etc are also good\n\n\n Also i personally think that Ocean dragon needs a slight buff (in this case just amping the effect will suffice)","replies":[]},{"poster":"Defended","date":"2016-05-25T18:46:28.812+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=RiotScruffy,realm=NA,application-id=3ErqAdtq,discussion-id=H4UIAdHw,comment-id=000c00000000,timestamp=2016-05-25T17:46:07.471+0000)\n>\n> Ideally we wouldn&#x27;t have to add an additional mechanic and we could just amp the effects. \n> \n> If we had to add stuff, things that synergized with the ooc movement speed would be the best. River speed, better homeguard etc.\n\nJust leave air dragon the way it is... People dont realize how good boots of mobi are","replies":[{"poster":"Doctor Jarvis","date":"2016-05-25T23:29:33.990+0000","up_votes":1,"down_votes":0,"body":"Mobis give 90 MS for just spending 600 gold (I'm assuming Brown Boots are a given). When you fight for Air Drake, the story goes, there's supposed to be combat; the other team is going to try to stop you, or take it themselves. And the Drake itself is probably going to do some pittance of damage. And it detracts from time you could be spending doing something useful. And after all that, if you've put in the time, effort, and risk, you get...NOT EVEN FUCKING CLOSE TO THE AMOUNT FROM MOBIS","replies":[{"poster":"Partholonian","date":"2016-05-26T02:46:14.494+0000","up_votes":2,"down_votes":0,"body":"Mobis also take up your boot slot, preventing you from buying any other kind of boots.  Dragons don't take up inventory slots.\n\nAlso, 600 gold per person is *way* more than old dragon, so I don't see why you'd be surprised that a new dragon is less powerful than that.  3k from a single objective would be nuts; even baron power plays don't always top that and that's including baron itself *plus* collecting standing gold.  3k worth of stats *that don't even take up inventory space* would be beyond nuts.\n\nIn fact, if you consider mobis as the baseline for valuing out of combat movespeed, then one air drake is worth 1/4 of mobis, or 150 gold per person, about as much as the old dragons.\n\nIs a non-Elder dragon even more difficult to take than a tower?  It almost certainly does less damage (although you won't have minions to soak it unless you're Elise or something).  Fighting in the pit doesn't seem to be any harder than fighting under an enemy turret and possibly easier.  And the enemy doesn't automatically have vision as soon as you start your attempt.  A tower, also, is worth way less than upgrading everyone on the team's boots (to any version).","replies":[]}]}]},{"poster":"redfeenix","date":"2016-07-04T03:58:02.140+0000","up_votes":1,"down_votes":0,"body":"Hey scruffy, \n\nHave you considered having 1 of each elemental dragon spawn per game, but in a random order? \n\nWhat are the pros and cons of having 1 of each drake spawning in a random order, vs having any drakes spawn.\n\nI feel like having 3 infernos is really snowbally and isnt fair to late game teams , etc. 3 infernos is such a huge power buff. \n\nHowever, having 1 of each dragon might be more balanced. \n\nThanks for reading","replies":[]},{"poster":"Kaiser Rienhard","date":"2016-05-26T12:30:23.028+0000","up_votes":1,"down_votes":0,"body":"The ooc is garbage, remove the qualifier and it will stop being garbage. There you go","replies":[]}]}]},{"poster":"Quepha","date":"2016-05-25T18:12:34.441+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=RiotScruffy,realm=NA,application-id=3ErqAdtq,discussion-id=H4UIAdHw,comment-id=000c,timestamp=2016-05-25T17:16:32.086+0000)\n>\n> IMO lets just buff air dragon :P\n> \n> Seriously though, dragon balance is an ongoing process. Expect plenty of changes over time.\n\nWhat about just guaranteeing that you don't get the same dragon twice in a row?","replies":[{"poster":"Riot Scruffy","date":"2016-05-25T22:57:19.760+0000","up_votes":5,"down_votes":2,"body":"Getting 2 or 3 of the same dragon has some of the best gains though (from a design perspective). When you are multi stacked with a buff the sharpness in your power is enough that it really starts influencing strategy and decision making. \n\n\"We have 3 water, lets get into a poke war and heal up to full before diving that tower.\"","replies":[{"poster":"Daen","date":"2016-05-26T02:38:14.075+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotScruffy,realm=NA,application-id=3ErqAdtq,discussion-id=H4UIAdHw,comment-id=000c00040000,timestamp=2016-05-25T22:57:19.760+0000)\n>\n> Getting 2 or 3 of the same dragon has some of the best gains though (from a design perspective). When you are multi stacked with a buff the sharpness in your power is enough that it really starts influencing strategy and decision making. \n> \n> &quot;We have 3 water, lets get into a poke war and heal up to full before diving that tower.&quot;\n\nI think the key here is that Cloud Drake is consistently viewed as by far the weakest variant, and almost not even worth taking unless it's completely free.  \n\nIt's very possible this is just a perception problem, but it's hard to pit 15 flat Movement Speed against 4% missing health and mana sustain.  The value for the second is just so much higher when considering the visibility and noticeable impact, Cloud can't even compare.","replies":[{"poster":"Meddler","date":"2016-05-26T03:30:18.855+0000","up_votes":4,"down_votes":1,"body":"We've been looking into the dragon buffs a lot this weak and come to the conclusion that, overall at high skill play, they're very close in power. Statistically each of the four buffs has a period in the game where it's strongest, in terms of influence on your chance to win. Air's power's harder to track, and therefore take deliberate advantage of/play against though, which means it doesn't feel as good as the others tend to. We're going to keep looking at the four buffs, particularly in pro play since we usually see the most organized teams there, to see what opportunities there are to improve each of them. Overall though it doesn't look like it would be appropriate to make air feel better using raw power though.","replies":[{"poster":"Hellioning","date":"2016-05-26T03:35:50.280+0000","up_votes":2,"down_votes":0,"body":"Okay, now how about at medium to low skill play? \n\nI don't want to get into the whole 'which playerset to balance towards?' debate, and I understand that dragons, as a neutral objective that are not necessary to win the game, are generally a coordination thing over anything else, and as such are better appreciated by more coordinated teams, but I get kinda pissy if changes are made for a playerbase that I'm not in, especially massive, gamechanging stuff like dragon changes.","replies":[{"poster":"Meddler","date":"2016-05-26T04:21:10.511+0000","up_votes":3,"down_votes":1,"body":"High skill in this context's actually just the top third of the player base (not top third of ranked, but all games, which equates to somewhere in Silver upwards from memory). You personally are certainly in the group dragons are being balanced for as a result, though yeah, the discussion of who to balance for in general's a pretty complex one. \n\nWe don't have a good read yet on buff performance in what a lot of people define as 'high skill' (pro play or high diamond plus), so it's not yet clear how air performs in those circumstances overall. That's on our list of things to look at, we can't balance solely for that skill level though certainly.","replies":[{"poster":"Hellioning","date":"2016-05-26T04:33:17.238+0000","up_votes":1,"down_votes":0,"body":"...Right. Sorry, I honestly keep forgetting most people are in silver and below.\n\nGenerally, the problem with air is that it is, basically, the one that requires effort. Even if you're a bunch of badly coordinated randoms, you can use fire, water, and earth, because they're just passive boosts. Sure, you might not use them optimally, but anyone can use plus AD/AP.\n\nAir, on the other hand, requires coordination to make useful. Out of combat move speeds only matters for roaming and getting back to lane, and given how often roaming is hard if you can't trust your laners, having a dragon be 'you get back to lane faster' is immensely disappointing.","replies":[{"poster":"Meddler","date":"2016-05-26T05:04:34.363+0000","up_votes":2,"down_votes":1,"body":"Yeah, air does demand more execution to get its benefit. I suspect we might see its effectiveness increase slightly over time as a result as people get more familiar with it.\n\nStatistically Earth and Water also show noticeably increased power with skill level, given the need to poke/delay and focus on objectives respectivelly. Fire's the strongest by a noticeable margin in a context where 'run straight into a full on fight with the enemy' is really common.","replies":[{"poster":"MunchCrunchLunch","date":"2016-05-26T05:29:09.578+0000","up_votes":4,"down_votes":0,"body":"can you make it out of combat with champions instead of completely out of combat. I mean nobody runs around ignoring jungle mobs. in higher elo all I see is if minions are pushed. they clear jungle mobs. for the most part this is for champions that roam. support or assassin . as the jungler is getting scuttles and csing all the time","replies":[]},{"poster":"Sad Tyrant","date":"2016-05-26T05:30:34.675+0000","up_votes":2,"down_votes":0,"body":"couldn't you pull an ocean drag on it?.\nmake the ooc movespeed only affected by champions. damaging a champ/getting damaged by a champ","replies":[]},{"poster":"Hellioning","date":"2016-05-26T05:19:20.809+0000","up_votes":1,"down_votes":0,"body":"You're just not gonna get people to roam better at low MMR by giving them higher move speed. Yes, people will improve at using air dragon at all skill levels, but until and unless splitpushing becomes meta in bronze, you're going to have air be a disappointment.\n\nHell, even if I'm playing a roam heavy, rotation heavy champion, air is a disappointment. Everything's a disappointment next to fire, really.","replies":[]}]}]}]}]},{"poster":"Kobold","date":"2016-05-26T03:47:35.817+0000","up_votes":1,"down_votes":0,"body":"Are you looking at adding Pre game Champ select icons denoting the three Types of dragons that will spawn (not which order just type) to allow teams to have a bit more decision making in champ select so that a team can't get lucky and be a MS/Roam based team and get lucky with a dragon type that is great for them but does next to nothing for the enemy team? (this is a mostly moot point) It would be interesting to see what the addition would change in the professional play level for champion selections based on knowing the dragons that are going to be in the game.","replies":[{"poster":"Shadowatom","date":"2016-05-26T05:12:19.138+0000","up_votes":1,"down_votes":0,"body":"I somewhat agree, and somewhat disagree, because it technically wouldn't have an impact on champion select other than to say what a team could plan for, but if a team can recognize that the enemy team would want to take a dragon that synergizes, then regardless, it would be in the team's best interest to take the dragon whether they can use it or not just to deny it. (That was my disagree).\n\nOn the flip side it could potentially continuously shift through several different groupings of champions (at pro play) in which the teams would be focusing around taking dragons in their comps, and since only 3 can spawn in a game, that leaves 4 combinations, so 4 groups of champions (probably a small batch) with several very strong and/or very consistent champions.\n\nFrom a design perspective though, I don't know if it would work. Most things in the gamespace (in a vacuum) are constant except for the dragons now. The idea in champion select is to build against your opponents and attempt to beat them with bans and picks. Adding the dragons may dilute that by getting teams to instead build around the dragons that will spawn instead of around their opponents/teammates. It also may not be possible (no idea, it depends on how Riot set up the client and PvP.net) to set this up to begin with since the dragons might not have even been selected when champion select comes around. They may be determined right when the match begins.","replies":[]}]},{"poster":"Daen","date":"2016-05-26T04:57:47.030+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=H4UIAdHw,comment-id=000c0004000000050000,timestamp=2016-05-26T03:30:18.855+0000)\n>\n> Overall though it doesn't look like it would be appropriate to make air feel better using raw power though.\n\nAir has a really nice particle effect when it hits maximum stacks; would it be possible for something like this to be present with one and two Cloud Drakes? I feel like the rotation power of Cloud is actually fantastic, but it's so hard to notice in-game that it's never actually a noticeable effect.","replies":[]}]}]},{"poster":"warpenguin555","date":"2016-05-25T23:01:41.715+0000","up_votes":3,"down_votes":1,"body":"yeah because people can actually use a water dragon, unlike cloud which is just bad","replies":[]},{"poster":"Mandang0","date":"2016-05-26T19:20:10.614+0000","up_votes":1,"down_votes":0,"body":"When movement speed has soft caps that are already very easy to run into with just items, this is less true for Air than for all of the other drakes.","replies":[]}]}]},{"poster":"abadhaiku","date":"2016-05-25T17:48:05.777+0000","up_votes":3,"down_votes":1,"body":"Any chance that rift herald could be replaced by two of the dragons? Say something like only fire and air spawn in dragon pit, water and earth spawn in baron pit until 20 minutes.","replies":[{"poster":"Crowe Stalker","date":"2016-05-25T21:04:23.177+0000","up_votes":1,"down_votes":0,"body":"Problem with that is those dragons stop spawning at 20 minutes and you have to either A) change them to spawn at Dragon pit when those 20 minutes are up, or B) force Elder Dragon to spawn at 20 too.\n\nAlso knowing Riot, it would be Air and Earth up top, because they need to make sure Bot has plenty of incentive for camping.","replies":[{"poster":"abadhaiku","date":"2016-05-27T16:43:21.216+0000","up_votes":1,"down_votes":0,"body":"Or they could make the buffs from those two stronger to make up for you only being able to get 1 or 2.","replies":[]}]}]},{"poster":"John 13 34","date":"2016-05-25T20:29:42.936+0000","up_votes":2,"down_votes":1,"body":"Give minions a minor movement speed buff/spawn rate.  And I mean pretty minor as this would otherwise be game-breaking.  Think of it like a mini zz'rot.  That would get it to be a little more valued, especially in defending against split pushing compositions.","replies":[]},{"poster":"Captain Aishi","date":"2016-05-26T15:34:47.362+0000","up_votes":1,"down_votes":0,"body":"has it been suggested yet that two dragons of the same type should not be allowed to spawn in a row?\npretty annoying to play against a team of snowbally assassins who have early game control only for them to get 3 infernal drake spawns in a row so there's no way to ever get back into the game due to that","replies":[]},{"poster":"Mhihnj","date":"2016-05-26T09:19:57.922+0000","up_votes":1,"down_votes":0,"body":"How about extra attack speed?","replies":[]}]},{"poster":"KillerKell","date":"2016-05-25T03:19:59.889+0000","up_votes":6,"down_votes":0,"body":"So... you're telling me the Enemy Team decides to gift wrap you a Free Objective... and your decision is to ignore it?\n\nHow about go get the Uncontested Dragon?\n\nHell, if no one wants it then it should be rather simple to Solo it, right?  Wouldn't even have to miss out on other objectives for it.\n\nThen people wonder why they don't know how to close out games and comebacks happen on them... it's because they never learned to take what is given for free.\n\nAnd if you can't figure out how to make increased move speed out of combat beneficial for you... then that's a you issue.  Your 'teams' seem to be rather ignorant.\n\nIt's free, uncontested, and gives you a Benefit while denying a Benefit to your Enemies.  Take the damn thing and move on.  Then you can take the next damn thing because, viola, your team can Rotate way faster thanks to the MS Boost.  So now you can rotate Mid for that Open Turret, and they can't stop you because they don't move as quickly.\n\nDuh.","replies":[{"poster":"DrCyanide","date":"2016-05-25T03:53:30.880+0000","up_votes":3,"down_votes":0,"body":"> Hell, if no one wants it then it should be rather simple to Solo it, right?\n\n{{champion:101}} {{champion:45}} {{champion:112}} {{champion:115}} No, not really all that easy to solo it.\n\n> How about go get the Uncontested Dragon?\n\nI don't think I've seen a team *completely* ignore the Air Dragons, more that they'll set up wards and go back to their lane, trying to use it to force a team fight. It just feels less valuable than trying to get some damage down on the enemy tower or picking up another jungle camp.\n\nSo no one wants it, and they don't really care too much if the enemy gets it, but if the enemy is trying to get it they want to fight it as a way to get gold/pressure other places... Low elo life.\n\nIt might be worth pointing out that while Sated Devourer was a thing, it was 50/50 (optimistically) on if your Bronze/Silver Jungler knew that killing Dragon would give them 5 stacks. I think that the other dragons have done a better job of drawing Jungler attention, but the Air Dragon just doesn't have the pull to make it worth the Jungler prioritizing it.","replies":[{"poster":"Supreme Senpai69","date":"2016-05-25T22:01:40.342+0000","up_votes":2,"down_votes":0,"body":"I think it's less that \"nobody wants it\" and more nobody wants to risk dying for it","replies":[]}]},{"poster":"Bird GirI","date":"2016-06-20T23:48:02.642+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KillerKell,realm=NA,application-id=3ErqAdtq,discussion-id=H4UIAdHw,comment-id=0001,timestamp=2016-05-25T03:19:59.889+0000)\n>\n> So... you&#x27;re telling me the Enemy Team decides to gift wrap you a Free Objective... and your decision is to ignore it?\n> \n> How about go get the Uncontested Dragon?\n> \n> Hell, if no one wants it then it should be rather simple to Solo it, right?  Wouldn&#x27;t even have to miss out on other objectives for it.\n> \n> Then people wonder why they don&#x27;t know how to close out games and comebacks happen on them... it&#x27;s because they never learned to take what is given for free.\n> \n> And if you can&#x27;t figure out how to make increased move speed out of combat beneficial for you... then that&#x27;s a you issue.  Your &#x27;teams&#x27; seem to be rather ignorant.\n> \n> It&#x27;s free, uncontested, and gives you a Benefit while denying a Benefit to your Enemies.  Take the damn thing and move on.  Then you can take the next damn thing because, viola, your team can Rotate way faster thanks to the MS Boost.  So now you can rotate Mid for that Open Turret, and they can&#x27;t stop you because they don&#x27;t move as quickly.\n> \n> Duh.\n\nI know this is a month old, but you seem to not understand what \"tempo\" means.","replies":[{"poster":"KillerKell","date":"2016-08-04T06:19:30.427+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nuke Overlord,realm=NA,application-id=3ErqAdtq,discussion-id=H4UIAdHw,comment-id=00010002,timestamp=2016-06-20T23:48:02.642+0000)\n>\n> I know this is a month old, but you seem to not understand what &quot;tempo&quot; means.\n\nI get Tempo.  Which is why a lot of Dragons only fall to who ever has Bottom on a Lane Swap, while Rift goes to who ever took Top in a Lane Swap.  It's an easy flow to the Objective without having to commit extra Resources because the Resources were already used to be there for the Turret in the first place.\n\nBut what people are saying is that Cloud Drake is literally ignored... which means it can be Solo Killed by your Jungle.  Because if they send Resources to stop it... then they aren't taking advantage of you being at Dragon, they are instead reacting to your play.  So either they Respond, in which case they lose the advantage  stop you from getting an advantage, or they stay and push while you Solo Cloud Drake.\n\nTake the Objective... for a reaction, and if no reaction occurs take the free gift.\n\nIgnoring the Cloud Drake, if you consider it useless, just means the Enemy Team never has to respond to your threat of taking Cloud Drake... because you never threaten it.   So they get to continue to push what ever advantage they may be looking for instead of having to adjust to your actions.\n\nAlso, ignoring Cloud Drake means you are delaying the time until you see a Drake you might actually consider a priority.\n\nBefore you get to 4th and 5th Dragon, most of the Dragons aren't even really contested anymore at Pro Level Play... because they don't want to run head first into an Engagement that they weren't already in proper position for.  If they are 'Late' they simply concede and move to another objective.","replies":[]}]},{"poster":"Hinagiku33","date":"2016-05-26T04:03:42.524+0000","up_votes":1,"down_votes":0,"body":"The issue is that it is *not* uncontested.\n\nThe very act of taking an objective like dragon carries risk. It's an objective that both teams keep warded (even in my low level, normals games it's *always* warded). If you go for it, you're letting the enemy know that you'll be in a space that's easy for them to surround and force you into a team fight you may not want or be ready for. \n\n**Dragon is a non-essential objective; it has nothing to do with winning the game on its own. Fire dragon and Earth dragon at least help you take objectives that actually matter, fire dragon also helps you win fights, and water dragon kinda sorta helps you siege or heal up after a good fight to keep pushing. Air dragon does nothing to affect structures and literally stops working during the most important phase of the game - actually fighting for towers and inhibitors needed to win. *Air dragon is not worth dying for and risking the enemy snowballing and/or taking towers while you're waiting to respawn.***","replies":[{"poster":"KillerKell","date":"2016-08-04T06:13:36.051+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fiora All Night,realm=NA,application-id=3ErqAdtq,discussion-id=H4UIAdHw,comment-id=00010001,timestamp=2016-05-26T04:03:42.524+0000)\n>\n> The issue is that it is *not* uncontested.\n> \n> The very act of taking an objective like dragon carries risk. It&#x27;s an objective that both teams keep warded (even in my low level, normals games it&#x27;s *always* warded). If you go for it, you&#x27;re letting the enemy know that you&#x27;ll be in a space that&#x27;s easy for them to surround and force you into a team fight you may not want or be ready for. \n> \n> **Dragon is a non-essential objective; it has nothing to do with winning the game on its own. Fire dragon and Earth dragon at least help you take objectives that actually matter, fire dragon also helps you win fights, and water dragon kinda sorta helps you siege or heal up after a good fight to keep pushing. Air dragon does nothing to affect structures and literally stops working during the most important phase of the game - actually fighting for towers and inhibitors needed to win. *Air dragon is not worth dying for and risking the enemy snowballing and/or taking towers while you&#x27;re waiting to respawn.***\n\nUmm... no.  Dragons are NOT always contested.  In fact, most Dragons are not contested in Early Games at the Pro Level.  If a Team isn't in position, they concede the Dragon and ATTEMPT to pressure a different objective.\n\nAlso, you say Fire Dragon and Earth Dragon helps you take Objectives... does Cloud Dragon and the benefit of Non-Combat Move Speed not help you Rotate and Position better, giving you a clear advantage of being first TO these Objectives you value?  Which is the entire idea behind the Cloud Drake.\n\nSo I'd argue that the most important part of the game isn't the actual fight, but the build up and positioning BEFORE the fight.  Executing the proper flank, or having the speed to avoid the dive attempt wasting an Engage attempt by the Enemy.  It's these things, the little things BEFORE combat, that usually decide the fight.","replies":[]}]}]},{"poster":"BluePolarizer","date":"2016-05-25T07:43:20.453+0000","up_votes":4,"down_votes":2,"body":"Cloud is actually extremely strong for my type of playstyle while nerfed Ocean doesn't do much.\n\nI realize that lower elos do not understand many alternative playstyles and think that LCS or solo queue 'carry' is the only way to win.\n\nThat is not the problem of the game.\n\nChess should not be changed to fit the 1200 elo players. It should have rules that make it balanced at the grandmaster level.","replies":[{"poster":"Icestar1186","date":"2016-05-25T17:58:54.212+0000","up_votes":4,"down_votes":0,"body":"Chess hasn't had a rule change in hundreds of years. That's a balanced game right there.","replies":[{"poster":"I am Pacman","date":"2016-05-25T18:15:08.430+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Icestar1186,realm=NA,application-id=3ErqAdtq,discussion-id=H4UIAdHw,comment-id=000a0000,timestamp=2016-05-25T17:58:54.212+0000)\n>\n> Chess hasn&#x27;t had a rule change in hundreds of years. That&#x27;s a balanced game right there.\n\nYeah it is, thats why is so boring to play in almost any level.  Thats because after whatever whites piece moves there is always a best next move for both sides and it now comes down to who can memorize all of the different starts.  \n\nTheir is a thing call \"perfect imbalance\" for gaming. Look it up its pretty cool.","replies":[{"poster":"Icestar1186","date":"2016-05-25T19:35:53.592+0000","up_votes":2,"down_votes":0,"body":"Actually, that's not quite the case. Openings are worth studying, but there are usually multiple openings that work in each situation, and even a basic understanding of opening strategy is enough to get you pretty far.","replies":[]}]}]}]},{"poster":"DREADN0UGHT","date":"2016-05-25T23:07:22.039+0000","up_votes":3,"down_votes":0,"body":"Whenever I see an air drag pop, I usually focus on getting towers or herald instead. Its just so useless... I got a game with 3 cloud drakes at some point. Sure, I move fast out of combat. But I don't feel the tactical advantage really..","replies":[]},{"poster":"Live2LetDie","date":"2016-05-25T03:11:14.109+0000","up_votes":3,"down_votes":0,"body":"You wouldn't be complaining if you were a horse ;)","replies":[]},{"poster":"Lycanoon","date":"2016-05-25T03:27:08.020+0000","up_votes":2,"down_votes":0,"body":"When I have enough Life Steal and decent damage, I will go and take the dragon.  IDGAF what type it is...I, WILL, CLAIM, IT!\nEasy 5 ip to add to the tally.\nTowers swarmed with minions?  Lanes completely flooded with enemy minions?\nEasy CS + Gold...om nom nom.\nGot a JG being mindless of his/her surroundings?...and their HP is low?  Bet ima spank that ass!\nGot some moron on my team tower diving outta rage, and he manages to drain the HP of the enemy....but the enemy is still in eye sight?\nI'm taking that KPA for myself!\n\nGotta be rude, crude, BUT QUIET!...or you get banned, and ruthless in Ranked and PVP.\nDon't give your enemy the chance to stack that dragon buff regardless of which type it is...PERIOD.\nThat buff stacks and could ultimately make it or break it...especially if you're chasing that penta/ace...\nHerpaDerp!\n\n{{sticker:slayer-jinx-unamused}} \nAnd you're ranked?...really?  I'm unranked and I take any and every dragon I can get my hands on!\n{{champion:16}} \"Let me guide you...\"","replies":[]},{"poster":"CerealBoxOfDoom","date":"2016-08-04T06:25:45.691+0000","up_votes":1,"down_votes":1,"body":"because 75 ms out of combat has no possible application????????","replies":[]}]}