{"poster":"Original Veigar","date":"2017-03-25T16:21:58.118+0000","title":"Idee für neuer Teaser, Event bzw. legendary skin für Garen","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":1,"body":"Halllo leute,\r\n\r\nich mag Demacia und Noxus vor allem Garen und Darius. Ich w&uuml;rde gern auf ein Event freuen, wo ein legendary Garen skin released wird. Ein riesen Story Arc wo sich {{champion:86}}  und {{champion:122}} ein Showdown liefern wo halt Garen den k&uuml;rzere zieht etc.  w&uuml;rde bestimmt nice sein. Danach wird er halt in lol f&uuml;r par Tage gesperrt (so wie beim Gangplank halt). Also zusammengefasst sollte der Arc 5 Chapter oder mehr beinhalten (ich wei&szlig; w&uuml;rde f&uuml;r Riot riesen Arbeit erfordern mit dem ganzen partikel kram usw. - wer wei&szlig;) . Mit paar echt geilen teaser videos und vieles mehr. \r\nArc 1 : beinhaltet kleine neue vorgeschichte von Demacia und Noxus wo halt Verb&uuml;ndete von Garen und Darius eine kleine Nebenrolle spielen.\r\nArc 2: Kriegsvorbereitung Darius vs Garen\r\nArc 3: Der Kampf\r\nArc 4: Eine blutige Niederlage wo halt Garen seinen Stolz und den Kampf verliert und flieht. Darius steht als siegreicher Schurke da, wo er halt  \r\n           Garen auslacht. (hier folgt dann Garen&#039;s sperre aus dem Championpool)\r\nArc 5: Eine Reise-&gt; Garen begibt sich auf eine neue Reise auf der Suche nach eine Antwort.\r\nArc 6: Garen findet ein neues Schwert und eine neue R&uuml;stung was ihm st&auml;rke verleiht und den verloren Stolz wiedergibt.\r\nArc 7: Die Entscheidungsschlacht: Garen kehrt zur&uuml;ck und k&auml;mpft wieder gegen Darius und geht siegreich hervor. (und ist dann wieder \r\n          spielbar)\r\n\r\nWas haltet ihr von dieser Idee? Ich sage schon mal im vorraus, dass bisschen trash steht aber dyrum. Es ist ok wenn ihr das komplett bullshitt findet. Naja wie der legend&auml;ry skin hei&szlig;en und wie er aussehen sollte wei&szlig; ich momentan nicht. Schreibt einfach in die Kommentare was ihr davon haltet.\r\n\r\nMfg \r\n\r\ndersteuerberater","replies":[{"poster":"INoKami","date":"2017-03-25T16:33:03.833+0000","up_votes":1,"down_votes":0,"body":"Und wer sich ein bisschen mit der Lore auskennt, weiß, dass ein Krieger aus Demacia NIEMALS flieht.\n\nNur ein höflich gemeinter Hinweis :)\n\nAnsonsten ist die Idee ganz interessant, würde mich aber schon interessieren, wie genau dann der \"neue\" Garen aussehen würde.","replies":[{"poster":"Original Veigar","date":"2017-03-29T14:05:47.914+0000","up_votes":1,"down_votes":0,"body":"vielleicht konnte man das mit dem welaufen umändern :D","replies":[]}]},{"poster":"zLives","date":"2017-03-28T19:49:15.616+0000","up_votes":1,"down_votes":0,"body":"NEIN Danke ._. Ich habe schon Kriegsherr Garen gekauft der relativ neu ist (knapp 2 monate) und er ist toll und wenn dann noch ein Garen Skin kommt der besser ist pls Not und dazu ist auf der PBE schon ein neuer Darius Skin in Arbeit (Dread Nova) was eine coole warhammer 40k Anspielung ist (10 Gemstones)","replies":[]}]}