{"poster":"Lord1289","date":"2014-11-22T18:59:57.737+0000","title":"MI EZ ?","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Most játszottam egy Sion junglet ! Volt velem egy unrankedes Jax support... mondom jó semmit nem zavar hogy unrankedes mert mivan akkor ?\r\nDE ! Játék közben mikor én gankeltem mondjuk midre ő addig szépen elvitte a blue buffomat meg a redemet ! És mikor már másodszorra csinálta kiirtam neki hogy menjen már el onnan mert ő egy büdös support... Ja és persze premadeben volt az adc-vel ! Meccs végén meg kiírják hogy all report Sion for flame...(kalista adc+jax supp irta ki) Na mondom ok nem történt ilyen úgyhogy ha reportolnak ELVILEG nem kapok semmit. Aztán jön a figyelmeztetés hogy reportoltak ezért meg ezért.. mikor elvileg csak egy bizonyos mennyiségű report után kapok figyelmeztetést és nem tudok róla hogy kaptam volna régebben reportot.. Szóval most kaptam 2 reportot és egyből jött a figyelmeztető. Nagyon szuper..","replies":[{"poster":"DarklightX","date":"2014-11-24T19:42:23.633+0000","up_votes":1,"down_votes":0,"body":"Szerintem a legidegesítőbb dolog amikor megölik a jungledban a mobokat xDD Én utálom... Annál csak az  az idegesítőbb amikor a kicsiket ott hagyják xD Olyankor mindig {{item:3070}}ok :(\n\n{{summoner:4}}","replies":[]},{"poster":"TCFactory","date":"2014-11-23T20:04:37.261+0000","up_votes":1,"down_votes":0,"body":"A Jax supportnál kicsit leakadtam, de egyébként szerintem nincs miért aggódnod. Igaz, elvileg egy adott számú report után megy a figyelmeztetés, de gyakorlatban elég összevissza a dolog. Gyakran van, hogy egy report után is megkapod, de mivel automatikus üzenet, ha felülvizsgálják a reportokat, akkor nem fog számítani.\n\nEgyébként vannak ilyen játékosok, nem igazán lehet velük mit csinálni - mond meg neki, hogy menjen a fenébe, csak ne vidd túlzásba (kívánták már nekem, hogy \"dögöljek meg rákban\" mert nem tudtam minden lane-en egyszerre gankelni). Volt már, hogy a topost kellett elhajtanom, mert állandóan a felső dzsungelemet farmolta - én se lopom az ő farmját, lesz szíves elhúzni a belét az enyémtől. Support Fiddle aki konkrétan elvitte a mides elől a kéket és megpróbálta lelopni a Sivirünk elől az ellenség pirosát. \n\nHa nem hagyja abba a dolgot és nagyon felhúz az illető, akkor jöhet a kicsinyes bosszú: következő topos ganknél tiszta véletlenségből eltakarítottam előle a minionokat, kedves Fiddle barátunkat pedig hallgatólagos megegyezéssel hagytuk egy szál egyedül beugrani az ellenséges csapat közepére. \n\nInstant karma, kis rásegítéssel. :)","replies":[]},{"poster":"DarkP4ssenger","date":"2014-11-22T19:18:01.498+0000","up_votes":1,"down_votes":0,"body":"Sajnos vannak ilyen emberek/játékosok, ez ellen sokat nem lehet tenni. Max hogyha valami komolyabbra fordul a dolog , akkor valahogy biztos utána fognak tudni járni ennek.","replies":[{"poster":"Lord1289","date":"2014-11-22T19:28:55.434+0000","up_votes":1,"down_votes":0,"body":"Ok nagyon nem érdekel mert nem lett következménye csak mégis bosszantó hogy régen ilyenek miatt volt chat bannom is ! De most nem kaptam semmit szerencsére.","replies":[]}]}]}