{"poster":"Lord1289","date":"2015-03-17T17:15:37.839+0000","title":"Büntetendő vagy nem ?","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Gondolom a legtöbben tudjátok hogy vannak ilyen skin hack cuccok meg ilyenek aminél letöltöd és berakod a skint és akkor azt csak te látod meg van olyan progi aminél le se kell tölteni külön a skint stb... De ugye vannak ilyen map \"skinek\" és ugye olyat nem tudok megvásárolni rp-ből mert mapra a riot nem csinál kinézeteket. De most akkor az is hacknek számít ha betennék egy ilyen havas pályát ? Mert személy szerint nekem kimondottan tetszik de sajnos nem lehet ilyet venni...","replies":[{"poster":"Shikaichi","date":"2015-03-17T17:30:25.921+0000","up_votes":1,"down_votes":0,"body":"Mivel ez is csak külcsín, mint a skin meg hasonlók, és nem származik belőle előnyöd a játékban, így nem hinném, hogy ez büntetendő lenne.","replies":[{"poster":"Lord1289","date":"2015-03-17T17:42:33.085+0000","up_votes":1,"down_votes":0,"body":"Ez igaz lehet. Akkor berakom és reménykedem hátha nem lesz semmi. Köszönöm a válaszokat","replies":[{"poster":"Looter","date":"2015-03-17T18:48:26.782+0000","up_votes":3,"down_votes":1,"body":"igazából csak hátrányod származhat belőle.\n\n- patchnél kifagyás, bug splat stb.\n- illetve a hősök képességeinek a színeit és kontrasztosságát direkt a zöld alapú pályához állítják, hogy jól láthatóak legyenek.\nA havas pályát azért is vették ki többet közt mert sok hős képesség kevésbbé látszódott rajtuk.","replies":[]}]}]},{"poster":"VampVik","date":"2015-03-17T20:33:05.531+0000","up_votes":1,"down_votes":0,"body":"Hivatalosan minden tilos ami a \"play gomb megnyomása és a játék vége között módosítja a játékélményt\", tehát a map skin is.\nHogy ellenőrzik e? Nem hiszem, de sose lehet tudni.","replies":[{"poster":"Scortch","date":"2015-03-19T07:54:13.893+0000","up_votes":1,"down_votes":0,"body":"Ez hülyeség mert csak egy mod, semmi előnyöd nem lesz tőle","replies":[{"poster":"VampVik","date":"2015-03-20T22:06:06.858+0000","up_votes":1,"down_votes":0,"body":"*\"Ha elfogadják a tervezett új Büntető Törvénykönyv szövegét, a jövőben nem vizsgálnák, jogos volt-e az önvédelem, ha az illetőt éjjel, fegyveresen vagy csoportosan támadják meg, akkor sem, ha az önvédelem során a támadó súlyosan megsérül vagy meghal. Korábban számos esetben a sértettet marasztalták el, mert a bíróság szerint nem volt a támadással arányos a védekezés.\"*\n*Forrás: *http://hvg.hu/itthon/20120209_btk_onvedelem\n\nCsak egy gyors Google keresés eredménye, de ha érdekel a téma biztos találsz majd még jó sok hülyeséget ami logikátlan, de attól még börtönbe kerülhetsz miatta. (*Igen, idő közben elfogadták azt a törvény módosítást.*) Már pedig a jogi nyilatkozatot telepítés valamint minden frissítés után elfogadtad és ez egy olyan szabály ami a Riot meghozott, szóval ha hülyeség, ha nem, attól még bannolhatnak érte.","replies":[]},{"poster":"YiJaegar","date":"2015-03-19T16:20:55.806+0000","up_votes":1,"down_votes":0,"body":"de Lehet előnyöd tőle és hátrányod is. Hátrány falak nem egyeznek például. Előny jobb rálátás bizonyos pontokra.","replies":[]}]}]},{"poster":"Brăd","date":"2015-03-17T17:32:05.935+0000","up_votes":1,"down_votes":0,"body":"Ha a régi Sumonner's Rift-es havas pályára ,gondolsz ,azt nyugodtan beteheted ,de nagyon be fogod ,szopni ,tekintve ,hogy a pálya legtöbb része megvan változtatva azóta ;]","replies":[{"poster":"Lord1289","date":"2015-03-17T17:41:37.798+0000","up_votes":1,"down_votes":0,"body":"De van külön a legfrissebb pályához is kinézet mert azt is frissítik.","replies":[]}]}]}