{"poster":"KHO Haru","date":"2017-11-21T11:34:00.921+0000","title":"Quando esce il nuovo champ","subforum":"Campioni e gameplay","up_votes":2,"down_votes":1,"body":"La domanda &egrave; chiara. Quando esce zoe?\r\nTralasciando la mia curiosit&agrave; avrei una proposta. Ogni volta che deve uscire un nuovo champion tutti sono ovviamente impazienti e non vedono l&#039;ora di averlo. Ma allora perch&eacute; la riot non mette un bel cooldown in alto a sinistra vicino al tasto &quot;gioca&quot; eviterebbe domande come questa che si pongono un po tutti e aumenterebbe anche l&#039;hype come se fosse un vero e proprio evento. Tipo un bel &quot;3h 24min&quot; (esempio) in alto a sinistra in modo che tu sai esattamente quando uscir&agrave; e quando dovrai connetterti per comprarlo e provarlo","replies":[{"poster":"HaIIeIujah","date":"2017-11-21T12:35:10.807+0000","up_votes":2,"down_votes":0,"body":"Uno dei motivi per cui non lo rilasciano con la patch stessa è proprio epr evitare l'uber-ingorgo di giocatori che causerebbe all'uscita.\n\nL'altro è per controllare l'uscita in base ad eventuali problemi che potrebbero causare ritardo, senza dover incorrere nella rabbia della community in caso ci fosse un delay improvviso.\n\nIn entrambi i casi il countdown sarebbe dannoso per questi obiettivi.\n\nCome sempre, esce a breve entro la patch. Se non hanno dato altre specifiche è inutile chiederlo.","replies":[{"poster":"Frattaglia","date":"2017-11-21T13:03:39.015+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=HaIIeIujah,realm=EUW,application-id=cAOZwaUi,discussion-id=xzL7Y0dP,comment-id=0002,timestamp=2017-11-21T12:35:10.807+0000)\n>\n> Uno dei motivi per cui non lo rilasciano con la patch stessa è proprio epr evitare l&#x27;uber-ingorgo di giocatori che causerebbe all&#x27;uscita.\n> \n> L&#x27;altro è per controllare l&#x27;uscita in base ad eventuali problemi che potrebbero causare ritardo, senza dover incorrere nella rabbia della community in caso ci fosse un delay improvviso.\n> \n> In entrambi i casi il countdown sarebbe dannoso per questi obiettivi.\n> \n> Come sempre, esce a breve entro la patch. Se non hanno dato altre specifiche è inutile chiederlo.\n\nEsattamente.\nPiù una cosa è complessa (il gioco e l'infrastruttura di lol) più è facile che possano succedere imprevisti.\n\nComunque probabilmente una sera tra domani e dopodomani, raramente si fanno rilasci il venerdì o nel weekend.","replies":[{"poster":"HaIIeIujah","date":"2017-11-21T13:04:38.676+0000","up_votes":2,"down_votes":0,"body":"Francamente me lo aspetto oggi o domani per liberarlo prima dell'evento dei PROJECT, ma questa è una ma speculazione.","replies":[{"poster":"Frattaglia","date":"2017-11-21T13:09:51.598+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HaIIeIujah,realm=EUW,application-id=cAOZwaUi,discussion-id=xzL7Y0dP,comment-id=000200000000,timestamp=2017-11-21T13:04:38.676+0000)\n>\n> Francamente me lo aspetto oggi o domani per liberarlo prima dell&#x27;evento dei PROJECT, ma questa è una ma speculazione.\n\nAvevo capito che l'evento project fosse oggi.\nAllora no, hai ragione, potrebbe uscire anche stasera se non hanno casini.\n:)","replies":[]}]}]}]},{"poster":"gozzilla46","date":"2017-11-21T14:29:40.751+0000","up_votes":1,"down_votes":0,"body":"Secondo me esce domani. :)","replies":[]},{"poster":"Mercilesss","date":"2017-11-21T12:15:12.570+0000","up_votes":1,"down_votes":0,"body":"Ho letto che potrebbe uscire oggi alle 3 oppure poco dopo.","replies":[]},{"poster":"mangialavandini","date":"2017-11-21T11:37:59.957+0000","up_votes":1,"down_votes":0,"body":"Sarebbe fico ma anche inutile, comunque uscirà tra qualche ora come sempre o magari esce domani, di solito le patch escono il mercoledì","replies":[]}]}