{"poster":"Derfel","date":"2017-03-11T00:05:35.106+0000","title":"Patchly reminder to Meddler that the support role isn't a dumpster for failed mage reworks","subforum":"Gameplay","up_votes":207,"down_votes":20,"body":"Revert the poorly thought out and poorly implemented {{champion:90}}  rework that was completely derailed because David Capurro absolutely refused to admit that his new Malzahar passive was a stupid idea that served no purpose but to make the rework unbalanceable.  You can even keep the mechanic where his E refreshes. \n\nShoutouts to {{champion:63}} and {{champion:143}} who, even though they&#039;re now terrible mid as a direct result of the rework (and subsequent nerfs to force the reworks down the metas throat), at least still retain some of their old identities.","replies":[{"poster":"IxtaliKing","date":"2017-03-11T01:14:06.729+0000","up_votes":60,"down_votes":4,"body":"Victims of the support role: {{champion:63}} {{champion:43}} {{champion:90}} {{champion:143}} \n\nThe MYMU, originally called the \"Immobile Mage\" update (remember that?) , was supposed to address the issue of immobile mages being forced out of mid. That failed. Remember that straw poll that tons of people voted on and the overwhelming majority of people were in favor of balancing Zyra for mid over support? \n\nIt's sad really. It's all well and good some mages {{champion:43}} {{champion:143}}  being able to go bot and do well, but not at the expense of their solo laning.","replies":[{"poster":"Lucifer","date":"2017-03-11T01:40:46.266+0000","up_votes":42,"down_votes":1,"body":"It's also at the expense of some real supports not being able to function well in their role with mage supports being so prominent. Namely Taric, Tahm, Leona, and to an extent, many of the enchanters as well.","replies":[{"poster":"woodvsmurph","date":"2017-03-11T19:23:02.380+0000","up_votes":4,"down_votes":10,"body":"Uh... leona should be the most op tank support right now. Because malz and zyra can't block her engage with their plants/voidlings the way they can to thresh, blitz, naut, etc. She basically ignores that, locks down the support or adc, and let's her adc wreck them. Why? Cuz the support dies in about 4 hits and leona doesn't. Works even better if you can bait zyra into throwing out plants aggressively and then engage to get out of their attack range. You gotta survive level 1 and 2 poke and get shoved in, but then you are basically playing agro at level 3 and the enemy is pushed to your tower - giving you a full lane to run them down and kill. You just need a strong early game aa adc - none of that poke crap where the adc never autos anyone. Cait, jinx, draven, mf, etc.; not varus or jhin or trist preferably.","replies":[{"poster":"Lucifer","date":"2017-03-11T19:33:51.318+0000","up_votes":10,"down_votes":4,"body":"No, she shouldn't. As soon as Leona engages, she gets counter engaged on from either jungle or top lane teleport. It might fly in normal play, but in competitive environments Leona is a pretty terrible pick into Malzahar. Not to mention Leona cant do anything to pop Malzahar's spell shield. I also think a lot of people forget Leona isn't really that tanky at the start of the game, she takes time to build up that bulk. It isn't hard for Zyra or Malzahar to poke her and her adc down before Leona even has the opportunity to engage. When was the last time Leona or Taric were staple picks in competitive?","replies":[{"poster":"Titanium70","date":"2017-03-11T20:02:19.555+0000","up_votes":4,"down_votes":0,"body":"Guess you can thank all of the 'Keep AD-Malzahar' Threads for that. x'D","replies":[]}]}]}]},{"poster":"DunkinNoobs","date":"2017-03-11T04:39:12.985+0000","up_votes":11,"down_votes":17,"body":"> [{quoted}](name=KingKold93,realm=EUW,application-id=3ErqAdtq,discussion-id=2dLmejp4,comment-id=0003,timestamp=2017-03-11T01:14:06.729+0000)\n>\n> Victims of the support role: {{champion:63}} {{champion:43}} {{champion:90}} {{champion:143}} \n\nBrand is fine mind. Karma is fine both mid and top. Malz is fine mid. Only Zyra is relegated to being nothing but a support, and she's been like that for years now.","replies":[{"poster":"Xilixer","date":"2017-03-11T06:01:29.581+0000","up_votes":19,"down_votes":2,"body":"malzahar's mid is trash and boring. only way your going to do decent is if you just spam e and w while playing safe and not engaging. becuase if you engage more than likely you'll die due to lack of damage.","replies":[{"poster":"DunkinNoobs","date":"2017-03-11T06:25:55.356+0000","up_votes":6,"down_votes":7,"body":"As opposed to re-rework Malz which was way different.","replies":[{"poster":"ForeverLaxx","date":"2017-03-11T11:37:59.539+0000","up_votes":16,"down_votes":0,"body":"Considering the reworked Malz's entire power budget was spent on his voidlings, yes it was different. You could actually threaten with Visions + Ult without a voidling around. Now you have to have a voidling or you won't be killing anything with his old standard combo.","replies":[{"poster":"SpecterVonBaren","date":"2017-03-11T13:29:01.398+0000","up_votes":24,"down_votes":0,"body":"It's dumb how I can be in bot lane against a Malz \"support\" and he won't be accomplishing anything because everything he does hits like a wet noodle, but as soon as you try to go in on him or his ADC he presses W and suddenly you're dying in seconds. His power budget is horribly distributed around his kit.","replies":[{"poster":"ZyniX","date":"2017-03-11T17:46:32.778+0000","up_votes":2,"down_votes":1,"body":"It's funny how they asked us Malz mains what we liked about him before they reworked him. Most people couldn't give a crap about his passive. It was useful on occasion to harass your lane opponent if they were stupid but we were all for changing it. Instead they nerfed everything else and made his entire playstyle depend on the voidlings.","replies":[{"poster":"ForeverLaxx","date":"2017-03-11T23:45:05.546+0000","up_votes":8,"down_votes":0,"body":"That's because Riot was already going to make him voidling-centric and they wanted \"player support\" to justify it. They ended up ignoring the majority of the players so they could choose to listen instead to the Jungle Malz players and pretend they really wanted to make sure \"jungle Malz stays a thing.\" That's why his Voidlings have so much innate power.","replies":[]},{"poster":"SpecterVonBaren","date":"2017-03-11T20:07:22.579+0000","up_votes":4,"down_votes":0,"body":"There used to be some real skill to his combo. Stack your passive so your next spell will summon a voidling, tag them with your q and e and get your w under them followed by your ultimate. That was how you got max damage for his all in and the really good Malz players (not me) were able to get his maximum damage from using his whole kit correctly. Now its just too simple to get his full damage.","replies":[]}]}]},{"poster":"Narasimha","date":"2017-03-11T16:51:13.405+0000","up_votes":2,"down_votes":1,"body":"Wait, wasn't that the entire point of the rework though? To make it so that most of his damage wasn't on his undodgeable Space Aids?","replies":[{"poster":"ZyniX","date":"2017-03-11T20:36:21.572+0000","up_votes":4,"down_votes":0,"body":"Most of his damage is now from the voidlings and the refreshable space aids. Before his Q and R did a ton.","replies":[]}]}]},{"poster":"An Undead brat","date":"2017-03-11T09:42:56.814+0000","up_votes":11,"down_votes":0,"body":"You had the Malefic Visions wave-bounce minigame with your opponent, but now it deals so little damage they can just decide not to play it.","replies":[]}]}]},{"poster":"IxtaliKing","date":"2017-03-11T05:36:59.803+0000","up_votes":18,"down_votes":1,"body":"Karma's solo laning is gimped by unnecessary power put into different parts of her kit e.g RQ being her only damage option. She never has optimal use of her full kit, she either builds tank for RW, AP/Mpen for RQ or utility for RE. Not saying she can't mid, I'm just saying there's a reason why she no longer has a mid page on champ.gg.","replies":[{"poster":"Kilanost","date":"2017-03-12T02:03:39.749+0000","up_votes":6,"down_votes":0,"body":"Agreed.  The idea I think was originally that a shield with the rest of her kit would allow for better trading in lane and translate into better utility mid and late game.  Problem is with the first presumption.  No one putting points in shield has enough dps to out trade the enemy laner and no one putting points in the rest of the kit gets enough utility from the shield to make for a favorable trade given her limited damage options.  Additionally having only 1 damage ability than can be used on minions greatly reduces her ability to keep her farm on par with enemies.  \n\nNow if you gave the shield an effect that when cast on allied minions reduced the ability of the enemy laner to farm efficiently, you might have something.  Make her the only champion that can deny farm for example. Imagine being in a lane where every 6 seconds or so your enemy laner could deny you a cs. That would make for a really interesting and unique lane.","replies":[{"poster":"IxtaliKing","date":"2017-03-12T08:46:04.786+0000","up_votes":3,"down_votes":0,"body":"This is it. They changed her from a battlemage who was distinct for the utility she brought from that class, to a standard Enchanter who's claim to fame is an oversized AoE shield. To be fair her changes were made at a time before the subclasses were named, but still, her roots were there and should have been brought back by now.","replies":[]}]}]}]},{"poster":"Thilmer","date":"2017-03-11T11:21:07.668+0000","up_votes":15,"down_votes":0,"body":"> [{quoted}](name=KingKold93,realm=EUW,application-id=3ErqAdtq,discussion-id=2dLmejp4,comment-id=0003,timestamp=2017-03-11T01:14:06.729+0000)\n>\n> Victims of the support role: {{champion:63}} {{champion:43}} {{champion:90}} {{champion:143}} \n> \n> The MYMU, originally called the &quot;Immobile Mage&quot; update (remember that?) , was supposed to address the issue of immobile mages being forced out of mid. That failed. Remember that straw poll that tons of people voted on and the overwhelming majority of people were in favor of balancing Zyra for mid over support? \n> \n> \n\nYeah, I would find the situation ironic... if I weren't incredibly angry about it. The idea around the MYMU was buffing mages because the midlane was dominated by asasins, but somehow they ended up changing Brand and Malhazar so they are better as supports and worse as midlaners. \n\nWhat in the world, Riot?\n\nAnd something similar happened to Annie and Vel'koz, to a lesser extend.","replies":[{"poster":"ForeverLaxx","date":"2017-03-11T11:40:28.208+0000","up_votes":13,"down_votes":0,"body":"I like that both Annie and Vel'koz were only changed because they hadn't been messed with in a long time. Annie was always spoken of as the \"most balanced mage to which all others were compared against\" and then they changed her pointlessly. I still laugh that Vel'koz was changed with the reason of \"to make his playpattern less samey\" and none of the changes did anything to that -- all it did was make his ult utterly useless until they did a half-revert of the change.\n\nChange for the sake of change. Riot's MO for quite a long time now.","replies":[{"poster":"GayFluffyUnicorn","date":"2017-03-11T13:47:35.017+0000","up_votes":8,"down_votes":3,"body":"That was orianna not annie lul.","replies":[]}]}]},{"poster":"Academy Kayn","date":"2017-03-11T02:53:09.999+0000","up_votes":6,"down_votes":21,"body":">  was supposed to address the issue of immobile mages being forced out of mid\n\nNo it wasn't? It was meant to spread out reasons for why to pick a certain mage. Did it fail on that goal? Quite possibly, but it was never to solve the \"Forced out of Mid\", that as explicitly Zyra's problem.","replies":[{"poster":"3TWarrior","date":"2017-03-11T03:29:31.033+0000","up_votes":17,"down_votes":2,"body":"actually, that was one of the original reasons for the mage update:  to address that mages were being forced out of mid in favor of mobile options such as assassins or just mages who no one could approach safely.\n\nit became almost non-productive for many mages to be played when that same mage had no escape mechanisms other than flash or a 1 second stun that would do little to deter an assassin or a jungler","replies":[{"poster":"Kilanost","date":"2017-03-12T02:07:57.430+0000","up_votes":3,"down_votes":0,"body":"If this was the intention, I don't think riot accomplished their goals.","replies":[]}]}]},{"poster":"Xonra","date":"2017-03-12T02:33:46.890+0000","up_votes":3,"down_votes":0,"body":"Or at the expense of those of us who go support because we like supporting, and not just being a secondary mage on the team.","replies":[]}]},{"poster":"Very Hard Engage","date":"2017-03-11T00:33:49.096+0000","up_votes":47,"down_votes":10,"body":"{{champion:81}}  also a failed mid laner. \n\n{{champion:25}}  *cough cough*\n\n{{champion:26}}  **diseased lung noises**","replies":[{"poster":"Nymzo","date":"2017-03-11T00:37:47.068+0000","up_votes":14,"down_votes":10,"body":"He's an adc\n\nYes, she needs a rework\n\nHe was designed as a support but he can also mid.","replies":[{"poster":"abca98","date":"2017-03-11T00:45:21.084+0000","up_votes":25,"down_votes":4,"body":"Why rework Morgana? :/","replies":[{"poster":"Derfel","date":"2017-03-11T00:48:22.197+0000","up_votes":4,"down_votes":32,"body":"She can't compete with all the free shields, %damage reduction, %hp magic damage, infinite mobility creep anymore.","replies":[{"poster":"zaire90","date":"2017-03-11T02:34:00.349+0000","up_votes":37,"down_votes":0,"body":"> [{quoted}](name=Derfel,realm=NA,application-id=3ErqAdtq,discussion-id=2dLmejp4,comment-id=0000000000000000,timestamp=2017-03-11T00:48:22.197+0000)\n>\n> She can&#x27;t compete with all the free shields, %damage reduction, %hp magic damage, infinite mobility creep anymore.\n\nive played her mid plenty of times and she can","replies":[{"poster":"Supreme Senpai69","date":"2017-03-11T08:09:53.101+0000","up_votes":20,"down_votes":0,"body":"You literally plop down a W and watch the entire wave die\nYou're immune to CC\nYour Q hits like a truck and a Q+W chunks for like half HP when you build AP\nIt now applies Grievous Wounds if the PBE change goes through\n\nShe is an excellent mid laner. The best part is by taking her mid your team has two supports so your teamfights are just that much better.","replies":[{"poster":"Paquay","date":"2017-03-11T08:29:59.507+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Revan Senpai,realm=NA,application-id=3ErqAdtq,discussion-id=2dLmejp4,comment-id=000000000000000000000000,timestamp=2017-03-11T08:09:53.101+0000)\n>\n> Your Q hits like a truck and a Q+W chunks for like half HP when you build HP\n\nWait, am I missing something here? Her abilities don't do %ho damage right? Because that's nowhere in her description. \n\n\"Curses an area for 5 seconds. Enemies on the cursed ground are dealtfrom 16/32/48/64/80 (+22% Ability Power) to 24/48/72/96/120 (+33% Ability Power) magic damage every second based on the enemy's missing Health.\"\n\nSo building hp wouldn't do anything for you right? Or am I just dumb and am overlooking something?","replies":[{"poster":"Supreme Senpai69","date":"2017-03-11T08:34:29.805+0000","up_votes":4,"down_votes":2,"body":"Nope. I'm just tired and put HP instead of AP, and you're a dork for not realizing that :p\n\nMy b","replies":[{"poster":"Paquay","date":"2017-03-11T08:40:33.937+0000","up_votes":6,"down_votes":0,"body":"Well, I was gonna go with the description...   But then it's late and my brain isn't working so instead of realize you meant AP it went something like this:\n\nA secret!  A secret! He knows a secret! Wait, we should confirm this secret before taking Morg mid with a sunfire cape, SV, and 3 warmogs. Don't let them see your bronze without verifying the secret.","replies":[]}]}]}]}]}]},{"poster":"Nymzo","date":"2017-03-11T01:33:21.325+0000","up_votes":4,"down_votes":3,"body":"Riot said they will rework her at the same as her sister\n\nDunno why all the downvotes but oh well","replies":[{"poster":"BastionKross","date":"2017-03-11T02:47:37.155+0000","up_votes":24,"down_votes":0,"body":"Her rework is most likely going be more visual than gameplay. Her tent-skirt and outdated rig are just horrible to look at compared to more recent champs, while her gameplay is still quite solid.","replies":[{"poster":"Nymzo","date":"2017-03-11T02:49:41.543+0000","up_votes":13,"down_votes":1,"body":"I'm 99% sure they are going to change her passif, or at least tweak it a little bit.\n\nAnd maybe black shield but it depends on them really.","replies":[{"poster":"Krinu","date":"2017-03-11T04:02:37.455+0000","up_votes":7,"down_votes":1,"body":"I don't think either her or Kayle really need massive mechanical changes. Their kits are old, sure, but they work.\n\nVisuals, on the other hand... I'm pretty sure Morgana has one of the oldest (and ugliest) models in the game. Kayle at least has some decent skins and one visual update in the past, so she doesn't need an update as badly.","replies":[{"poster":"Sugar Momma","date":"2017-03-11T04:32:46.920+0000","up_votes":11,"down_votes":1,"body":"They're giving {{champion:25}}  grievous wounds on her W (at below 35% hp I think?) next patch. I think this would be a nice change; she could use a little bit more utility in her kit. Right now she's just CC + black shield bot, whereas most other supports nowadays (especially mage supports) offer more to their team.","replies":[{"poster":"Krinu","date":"2017-03-11T11:10:44.831+0000","up_votes":5,"down_votes":0,"body":"It really means that she can skip{{item:3165}}, which frees up some alternate build paths that offer more support.","replies":[]}]}]}]}]}]}]},{"poster":"abbbez","date":"2017-03-11T09:56:17.590+0000","up_votes":5,"down_votes":0,"body":"Ezreal was intended to be some kind of burst skill shot mage, But it turned out that he was better with Ad items, just like release Ekko where he was intended to be a ap assassin but building Bruiser/tank on him proved to be a better option.","replies":[]}]},{"poster":"LadyRenly","date":"2017-03-11T00:58:36.927+0000","up_votes":23,"down_votes":6,"body":"> [{quoted}](name=CrestKnight,realm=NA,application-id=3ErqAdtq,discussion-id=2dLmejp4,comment-id=0000,timestamp=2017-03-11T00:33:49.096+0000)\n>\n> {{champion:81}}  also a failed mid laner. \n> \n> {{champion:25}}  *cough cough*\n> \n> {{champion:26}}  **diseased lung noises**\n\nMorgana and Zilean are failed mid laners? What are you smoking?","replies":[{"poster":"Silent Pace","date":"2017-03-11T03:13:29.387+0000","up_votes":3,"down_votes":4,"body":"Morgana's Q can only hit one person and if she misses it practically all her damage is gone. No one's just going to stand in your W.\nI'm still not sure why Zilean has an ability to lower his cooldowns. It always seemed pointless to me and should be changed entirely. It would give him more options and allow him to be more creative. I might even go as far to say his ultimate could use work too.","replies":[{"poster":"bbQsauçe","date":"2017-03-11T04:16:39.717+0000","up_votes":17,"down_votes":2,"body":"***","replies":[{"poster":"RocketRelm","date":"2017-03-11T13:47:24.922+0000","up_votes":6,"down_votes":0,"body":"As a plat 2* mid morg 1 trick, I can confirm that Mid Morgana does obnoxious damage.\n\nYou can legit 100-0 a squishy at lvl 6 with just a frost fang and a dorans if you execute your all-in correctly. I'll need to check if I can still do it with the exhaust nerfs and mastery damage nerfs, but you do a boatload no matter what.\n\nMorgana is a mid game menace because her W **literally** has the damage of two spells. A lvl 9 100 AP Morgana Morgana's W does ~635-640 damage, provided the enemy is at half hp, and usually they're lower so you ramp more. That ult does 440 damage, 590 at lvl 11.\n\nHow much HP does squishies have at lvl 9? 1113? (Jhin) 1090? (Varus)\n\nMore importantly, you utterly blueball any would-be divers until thy build an MR item.   Later on, Morgana falls into a supportive role (which is also fine), but until everyone gets to 2-3 items, Morgana is a freight train of damage.\n*(In season 6, fuck ranked right now, though those buffs may convince me to get back into it once i fix my keyboard)","replies":[{"poster":"cocacolalips","date":"2017-03-12T01:30:54.894+0000","up_votes":1,"down_votes":3,"body":"Rofl, she is not a menace at all, she averages a neutral Kill/Death ratio middle lane in plat+ because she has no legitimate kill pressure against anyone with a brain, and half her kills are probably -Kill Secure- with a random tick of her W. Saying she does dmg is irrelevant when you can't use said dmg to push ppl around or kill them.\n\n\"She is hard to dive\" Oh damn that's useful, I'm glad we are devoting one lane worth of resources to a champion who doesn't die much between level 6 and level 9. Too bad you'll die in every teamfight or every time you cast your R to balance out. Now imagine if we had an actual champion who instead contributed to the game victory, hey, that would be nice.","replies":[{"poster":"RocketRelm","date":"2017-03-12T01:51:55.187+0000","up_votes":5,"down_votes":0,"body":"Yes, she's bad at Last-Hitting champions (which is what K/D without A means), and she has minimal 1v1 kill threat. However, in 2v2s skirmishes or full on team fights (ex: contesting around dragon, roaming bot), these weaknesses all but vanish. She provides immense damage *and* cc, as long as you itemize properly and position properly.\n\nAlso re: \"you'll die every time you cast R or team fight\"… git gud? Like, if this is happening, you're doing something *terribly* wrong with itemization, positioning, or both.","replies":[]}]}]}]}]}]}]},{"poster":"PaffWasTaken","date":"2017-03-11T02:49:58.908+0000","up_votes":30,"down_votes":6,"body":"I just want Riot's reputation to be completely CRUSHED INTO OBLIVION. Why? Because when they'll have Nothing to be proud about, they'll learn to forget their ego and finally REVERT anything that needs it, instead of ignoring whole community because of their ego and finally only reverting poor machine-gun Kog'Maw","replies":[]},{"poster":"Akaviri","date":"2017-03-11T00:55:07.185+0000","up_votes":17,"down_votes":0,"body":"I'm kinda sad Malz got reworked, he was one of the first champs I mained back in s2, now he's become a top support pick somehow.","replies":[]}]}