{"poster":"WaximO","date":"2016-06-17T07:04:25.253+0000","title":"por que me obligan a jugar un rol q no quiero","subforum":"Charlas Generales","up_votes":3,"down_votes":15,"body":"es realmente molesto q me obliguen a jugar un rol q no quiero, me obligan a jugar 2 roles cuando no quiero jugar 2, si quiero ir jungla prefiero esperar 1 hora e ir jungla seguro q pone jungla y sup y casi siempre me tire sup, realmente es molesto por q me hace jugar desanimado, deberian de poner la opcion de escojer una sola linea y uno ve si quiere esperar o no, pero no me vengan a obligar a ir 2 o sencillamente no juegas &gt;:(","replies":[{"poster":"PCtronix","date":"2016-06-17T07:07:23.088+0000","up_votes":1,"down_votes":1,"body":"si eres main jungla  - secundario supp ... puedes poner como rol principal jungla y si tienes el juego e ingles hay una opcion que se llama FILL-RELLENO  .. es como relleno .. te tiran a cualquier linea ... ... pero .. al mismo tiempo piensa que la mayoria de las veces .. el supp tiene que jugar con un ADC siendo premade que es lo mas recomendable ..","replies":[{"poster":"Longshanks","date":"2016-06-17T23:07:41.502+0000","up_votes":1,"down_votes":0,"body":"En español fill tambien esta, no recuerdo como se llama","replies":[{"poster":"PCtronix","date":"2016-06-18T02:39:12.279+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Longshanks,realm=LAS,application-id=v7qsfXsE,discussion-id=XiEAJuJa,comment-id=00000000,timestamp=2016-06-17T23:07:41.502+0000)\n>\n> En español fill tambien esta, no recuerdo como se llama\n\ngracias por recordarme ...  ... puse ese comentario a la rapida ... y puse fill pero se me olvido  poner que era relleno o la ``sobra´´ ...","replies":[]}]}]},{"poster":"sconf","date":"2016-06-17T15:45:59.494+0000","up_votes":1,"down_votes":0,"body":"buena hermano, oye hay un video de riot games del por qué está esta decisión, te dejo el link, puedes ponerle subtitulos en español si quieres!\nhttps://youtu.be/xwPa1SGLGv0?t=1188 , te dejé el tiempo exacto donde hablan de tu tema en particular\nsaludos, que te vaya excelente jugando rankeds!","replies":[]},{"poster":"Diegotg2","date":"2016-06-17T13:11:32.349+0000","up_votes":1,"down_votes":0,"body":"He visto varios post de este estilo y me sorprende lo rapido que la gente se olvido la gran mejora que fue este sistema de picks, con el anterior era mucho mas dificil jugar el rol que querias y incluso practicarlo ademas nunca faltaba el que ponia top o troleo ! , eso ahora ya no se ve, y lo mejor de todo es que con este sistema ya no haces cagar el teclado intentado ser el primero en decir ADC !! xDDDDD","replies":[]},{"poster":"WaximO","date":"2016-06-17T07:09:18.803+0000","up_votes":1,"down_votes":0,"body":"si siempre pongo jungla como principal pero me pasa llamando sup igual, me imagino q hay mas gente q quiere jugar jungla q sup, entonces para llamar mas rapido te llama sup q casi no hay, no se me ocurre q mas.","replies":[{"poster":"Mementø Møri","date":"2016-06-17T12:19:01.601+0000","up_votes":1,"down_votes":0,"body":"Pon jg y mid o top asi no te toca jg ...","replies":[]}]},{"poster":"HyenaLoL","date":"2016-06-17T11:48:25.271+0000","up_votes":1,"down_votes":0,"body":"no pongas supp. Es el rol menos solicitado. Pone mid, y tenes 50-50 de que te toque un rol u otro","replies":[]},{"poster":"rokushoger","date":"2016-06-17T11:06:40.414+0000","up_votes":1,"down_votes":0,"body":"Pone como rol secundario mid, es altamente improbable que te toque mid si el primario es jungla.","replies":[]},{"poster":"WE Cat","date":"2016-06-17T08:21:48.645+0000","up_votes":1,"down_votes":0,"body":"Igual que colocar comodin es como si eligieras el rol de supp.","replies":[]},{"poster":"Kyousuke","date":"2016-06-17T07:14:59.393+0000","up_votes":1,"down_votes":0,"body":"pone jungla y mid que la mayoría de veces te manda jg","replies":[]}]}