{"poster":"HardstyleItaly","date":"2015-02-21T17:01:33.766+0000","title":"Lag, lag su lag","subforum":"Discussioni generali","up_votes":5,"down_votes":1,"body":"Ma che caaaavolo, non si può giocare con questa server lag\r\nFate qualcosa, i champions si muovono a caso o proprio restano bloccati, no rispondono alle skill, etcetc...\r\n\r\nPLEASEEE D:","replies":[{"poster":"Giovarco","date":"2016-02-01T22:04:08.119+0000","up_votes":1,"down_votes":0,"body":"Idem. Stavo giocando una ranked, è stata una situazione alquanto noiosa vedere tutto teletrasportarsi.","replies":[]},{"poster":"DarkCRonix999","date":"2016-02-01T21:57:36.909+0000","up_votes":1,"down_votes":0,"body":"io laggo molto i piu di tutti voi messi assieme avete mai avuto 4738 ms???\nnon e' bello ve lo assicuro\ne vi auguro di non averli mai\n","replies":[]},{"poster":"Jhonny Blaze","date":"2015-03-06T13:32:11.894+0000","up_votes":1,"down_votes":0,"body":"Integrazione:\n\nSiccome continuo ad avere problemi di latency e ho la scritta \"Tentativo di riconnessione\" in loop, ho provato a fare un tutorial, così da non rompere le balle ad altri giocatori e, sorpresa, anche i bot si sono lamentati.\n\nStamattina ho fatto una partita e tutto era ok, quella dopo mi sono beccato un \"disertore\" perché avevo il loop di cui sopra. Almeno qualcuno ha qualche consiglio in merito (anche se sono sicuro che non dipende da me)?\n\nGrazie","replies":[]},{"poster":"Jhonny Blaze","date":"2015-03-05T21:09:55.115+0000","up_votes":1,"down_votes":0,"body":"Io ho fatto tutte le prove che potevo prima di postare sul forum, quindi voglio fare una lista in modo da escludere commenti del tipo \"hai provato questo e quello\"\n\n- Riavvio router;\n- Riavvio pc;\n- Il pc è collegato direttamente al router via cavo;\n- ping ottimali da cmd:\n          a. verso scheda 0ms;\n          b. verso router 5-10ms;\n          c. verso google.it 40-60ms;\n          quindi non è il provider;\n- Il launcher carica bene e si vede tutto, i problemi iniziano quando parte la partita, nella schermata di caricamento. Il ping va da un minimo di 400 a 999 (ma si deve provare altrimenti non puoi vedere come si pinga sul server)*;\n- In partita non ci sono spike di lag, ci sono spike dove si può giocare;\n- Rischio sempre il ban perché è come se andassi afk, con \"tentativo di riconnessione\" in loop. E' anche vero che 2 o 3 volte l'ho mollato lì, ma vedere 'sta scritta durante una partita (per chissà quanto tempo visto che non si può sapere quanto una partita possa durare) e stare a vedere una partita in differita, dove dovrei giocare non è divertente.\n- Ok che è un gioco FTP, ok che può sempre capitare un problema tecnico, ci mancherebbe, però aspettavo ieri la patch, sperando si risolvesse qualcosa ma nulla.\n\n* Piccolo consiglio: perché non mettere nel client un monitor di latency e ping sul server? Così uno sa se entrare in partita o impiegare meglio il suo tempo e quello di altri giocatori.\n\nGrazie dell'attenzione","replies":[]},{"poster":"salimball45","date":"2015-02-23T18:46:59.819+0000","up_votes":1,"down_votes":0,"body":"Strano, perchè a me sti problemi non li ha mai dati, gioco sempre a 65-70 ping e pochissime volte mi sale sui 150+ però si lagga di brutto nel PBE questo si","replies":[]},{"poster":"Pasticcionex","date":"2015-02-22T11:30:33.254+0000","up_votes":1,"down_votes":0,"body":"anche io sto laggando e non poco infatti sto giocando solo su dota2 perché non si può proprio qui su lol 300 ping come se fosse normale e nessuno fa niente ho inviato ticket al supporto ma non pensa serva a qualcosa praticamente non posso giocare.. peccato....sempre il nostro server cmq... non selo caga nessuno boh","replies":[]},{"poster":"cicicicacacaca","date":"2015-02-21T21:25:16.333+0000","up_votes":1,"down_votes":0,"body":"io anche adesso non riesco a entrare in game... non mi da la schermata di caricamento o, se me la da, mi dice che ho problemi con il firewall (disattivato).","replies":[]},{"poster":"Ste the ripper","date":"2015-02-21T17:26:11.164+0000","up_votes":1,"down_votes":0,"body":"anche io laggavo poco fa","replies":[]}]}