{"poster":"fRozen913","date":"2016-03-26T16:34:04.852+0000","title":"Az ilyen embereket kéne törölni a Rankedből.","subforum":"Minden egyéb","up_votes":1,"down_votes":8,"body":"http://i.imgur.com/P5GqwjB.png {{champion:77}}\n\n[Mivel unatkozom, a téma törlése helyett inkább megmutatom, milyen formában lehet az ilyen viselkedéseket itt közzé tenni. A linket lecseréltem! ~Vadhalal]","replies":[{"poster":"M4dr4c","date":"2016-03-26T17:24:41.684+0000","up_votes":3,"down_votes":0,"body":"Naming'n'Shaming TILOS. Töröld a neveket a képről.","replies":[]},{"poster":"Zooty","date":"2016-03-26T23:55:49.687+0000","up_votes":1,"down_votes":0,"body":"Amit M4dr4c mond az valóban így van, még ha nagyon óvodásnak tűnik is. Ez a fórum nem arra van kitalálva hogy megbeszéljük, hogy mely konkrét személyeket gyűlöljünk. Az ilyen emberek büntetésére van egy másik rendszer, felesleges ide külön témát nyitni. A játék végi jelentés elég. Itt amúgy se tudunk mit kezdeni\n\nHa magáról a viselkedésről akartok beszélni, a neveket takarjuk ki, és minden oké! Én most ezt megtettem neked. Még húsvéti tojást is adtam hozzá!:)\n\nAmúgy ilyenkor jobb megoldás ha egyszerűen kilépsz hősválasztóból. MMR-t nem vesztel, 5 perc pihi meg úgy is kell egy ilyen eset után!","replies":[{"poster":"AsD The Dreamer","date":"2016-03-27T06:27:06.990+0000","up_votes":1,"down_votes":0,"body":">húsvéti tojást is adtam hozzá!\n\nMegtaláltam mind a hatot. Mi a jutalmam? :3","replies":[{"poster":"Zooty","date":"2016-03-27T11:25:59.774+0000","up_votes":1,"down_votes":0,"body":"Ha gondolod, meglocsolhatlak..","replies":[{"poster":"AsD The Dreamer","date":"2016-03-27T11:43:45.207+0000","up_votes":2,"down_votes":0,"body":"Boostolj fel LCS-ig. Ennyi munkáért igazán megérdemlem.","replies":[]}]}]}]},{"poster":"devifiu","date":"2016-04-09T11:37:18.180+0000","up_votes":1,"down_votes":0,"body":"Ilyennel én is találkoztam! Kiválaszt egy pozíciót majd kijelenti hogy ő lesz az adc mikor én vagyok, erre mondom \"ok\" akkor én leszek a supp. Erre kijelenti hogy nem nem mert ő a supp. Ezután azt mondja ő topra megy inkább, akkor a topos mondja hogy akkor ő lesz a supp, aztán erre megint kijelenti  hogy nem, mert nem ő lesz a topos hanem a mides. És szándékosan össze zavar mindenkit, mert valaki vicces hangulatában van, emiatt szív mindenki...mert eközben a topos suppot választ, a a dzsungeles is support lesz a mides pedig topos és minden össze van kavarva, mert az idő végéig játszik más türelmével.","replies":[]},{"poster":"panzergodx","date":"2016-03-26T17:59:54.033+0000","up_votes":1,"down_votes":0,"body":"igen igen szedd ki minél előbb nehogy holnap mutogassanak rá a suliba, amúgy is elég szomorú a tinik élete","replies":[{"poster":"fRozen913","date":"2016-03-27T00:15:12.742+0000","up_votes":1,"down_votes":0,"body":"Csak hozzáteszem nem járok suliba. %%%%%%ul nem vagyok tini.... Csak ahogy leírtam valahogy az ilyen problémákat kéne megszüntetni.","replies":[]}]},{"poster":"fRozen913","date":"2016-03-27T00:13:04.768+0000","up_votes":1,"down_votes":0,"body":"Bocsesz hogy nem mostam el a neveket. Nemtudtam. De igen csak azt akartam közölni hogy az ilyeneket valahogy meglehessen szüntetni. És kitudjon kerülni az ember az adott ranked osztályból.","replies":[]}]}