{"poster":"Cenâreth","date":"2018-09-04T12:11:23.769+0000","title":"Kann man aus Silber überhaupt Solo noch rauskommen?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":4,"body":"&Uuml;berall wo man sieht nur toxische Leute, mehr mit sich selbst besch&auml;ftigt als mit dem Game, meine Frage dazu kann man &uuml;berhaupt noch aus Silber solo climben? Wir hatten Duo zu zweit schon ziemliche M&uuml;he &uuml;berhaupt Spiele zu gewinnen und zu carryen, aktuell.\r\n\r\nWas denkt ihr? Viele Highelo Spieler meinen ja, Low Elo Spieler sehen dass etwas anders.","replies":[{"poster":"MeMyselfandBaal","date":"2018-09-04T14:23:48.566+0000","up_votes":8,"down_votes":1,"body":"Also meine Antwort lautet erfahrungsgemäß: Als Midlaner schaffe ich es nicht. Es sei denn, ich picke Ahri, dann könnte ich ne Chance haben. Als Support brauche ich knappe 2 Wochen um von Silber IV bis Gold V zu kommen. Damit müsste ich langsam mal anfangen...\n\nUnd ja, selbst als \"nur High Gold Sup Main\" ist war es für mich in den letzten Jahren kein Problem meinen Smurf am Ende aus Gold rauszuspielen. Da ist es mir dann auch egal, ob der Master Yi sein Smite vergessen hat... oder mein ADC Twitch mit Kometen spielt. \n\nWenn du dann auch noch DuoQue spielst... das sollte es eigentlich einfacher machen. Es sei denn, ihr beide seid einfach nicht besser. Was kein großes Problem ist, aber mit der Erkenntnis muss man sich erst Mal anfreunden, bevor man sein eigenes Spiel verbessern kann.\nIch sag das direkt: Dass du nach 72 Xayah Spielen eine Winrate von 42% mit ihr hast, liegt mit 99%iger Wahrscheinlichkeit daran, dass du auf dem Champion nicht gut genug bist um mit ihr im Ranked zu carrien. \nUnd bevor du dich fragst, was deine Mitspieler alles falsch machen, solltest du dich damit beschäftigen, wie du deine Xayah verbesserst... oder dir nen einfacheren Champion aussuchen...","replies":[{"poster":"Cenâreth","date":"2018-09-06T09:25:45.398+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=0006,timestamp=2018-09-04T14:23:48.566+0000)\n>\n> Also meine Antwort lautet erfahrungsgemäß: Als Midlaner schaffe ich es nicht. Es sei denn, ich picke Ahri, dann könnte ich ne Chance haben. Als Support brauche ich knappe 2 Wochen um von Silber IV bis Gold V zu kommen. Damit müsste ich langsam mal anfangen...\n> \n> Und ja, selbst als &quot;nur High Gold Sup Main&quot; ist war es für mich in den letzten Jahren kein Problem meinen Smurf am Ende aus Gold rauszuspielen. Da ist es mir dann auch egal, ob der Master Yi sein Smite vergessen hat... oder mein ADC Twitch mit Kometen spielt. \n> \n> Wenn du dann auch noch DuoQue spielst... das sollte es eigentlich einfacher machen. Es sei denn, ihr beide seid einfach nicht besser. Was kein großes Problem ist, aber mit der Erkenntnis muss man sich erst Mal anfreunden, bevor man sein eigenes Spiel verbessern kann.\n> Ich sag das direkt: Dass du nach 72 Xayah Spielen eine Winrate von 42% mit ihr hast, liegt mit 99%iger Wahrscheinlichkeit daran, dass du auf dem Champion nicht gut genug bist um mit ihr im Ranked zu carrien. \n> Und bevor du dich fragst, was deine Mitspieler alles falsch machen, solltest du dich damit beschäftigen, wie du deine Xayah verbesserst... oder dir nen einfacheren Champion aussuchen...\n\nDafür sagen mir meine 65 % in Normals allerdings was anderes...","replies":[{"poster":"MeMyselfandBaal","date":"2018-09-06T23:30:29.451+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=00060000,timestamp=2018-09-06T09:25:45.398+0000)\n>\n> Dafür sagen mir meine 65 % in Normals allerdings was anderes...\n\nIch kann Morgana im Normal Draft auch wunderbar spielen. Kein Problem. Trotzdem habe ich im Ranked eine grausame Winrate mit ihr und habe sie deswegen in der Phase, in der ich aufgestiegen bin, erst Mal auf die virtuelle Bank gesetzt... Das hat wirklich geholfen. \n\nUnd dass du mit Xayah gut durch die Lane kommst, ist wunderbar. Aber wenn du deine eigenen Aussagen kritisch betrachten würdest, könnte dir auffallen, dass auch du mit Xayah in Teamfights den Überblick verlieren könntest. Was ja auch logisch ist, eine Xayah in diesen Momenten richtig zu spielen ist schwieriger als eine Miss Fortune richtig zu spielen. \n\nAber das ist ja auch so eine Grundreglen, die ich jedem unter Gold beibringen wollen würde: Spielt einfache Champs. Weil es mit diesen wesentlich einfacher ist in Teamfights den Überblick zu behalten. \n\nWenn du wirklich aus Silber rauskommen willst, spielst du Malzahar, Ahri, Miss Fortune und Jinx in jedem Spiel. Außer du bist Autofill Support, dann nimmst du Soraka. \nDas ist aber halt auch so was, was wenige einsehen wollen. Also dass ihr \"Champion Pool\" einfach keine 77 Champions umfasst, und dass man, wenn man Aufsteigen will, sich wirklich auf die wenigen Champions konzentrieren sollte, die man beherrscht. Und wenn man die Champions, die einem Spaß machen, mit denen man aber nicht so gut ist, ausprobieren will, dann geht man ins Normal Draft...\nIch selber würde zum Beispiel nie auf die Idee kommen im Ranked Thresh zu spielen... obwohl der super viel Spaß macht. Aber ich weiß halt auch, dass ich mit dem in engen Teamfights viel zu oft die falschen Entscheidungen treffe. Also erspare ich das meinem Team und spiele etwas, das einfacher ist.","replies":[{"poster":"Cenâreth","date":"2018-09-07T07:44:45.980+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=000600000001,timestamp=2018-09-06T23:30:29.451+0000)\n>\n> Ich kann Morgana im Normal Draft auch wunderbar spielen. Kein Problem. Trotzdem habe ich im Ranked eine grausame Winrate mit ihr und habe sie deswegen in der Phase, in der ich aufgestiegen bin, erst Mal auf die virtuelle Bank gesetzt... Das hat wirklich geholfen. \n> \n> Und dass du mit Xayah gut durch die Lane kommst, ist wunderbar. Aber wenn du deine eigenen Aussagen kritisch betrachten würdest, könnte dir auffallen, dass auch du mit Xayah in Teamfights den Überblick verlieren könntest. Was ja auch logisch ist, eine Xayah in diesen Momenten richtig zu spielen ist schwieriger als eine Miss Fortune richtig zu spielen. \n> \n> Aber das ist ja auch so eine Grundreglen, die ich jedem unter Gold beibringen wollen würde: Spielt einfache Champs. Weil es mit diesen wesentlich einfacher ist in Teamfights den Überblick zu behalten. \n> \n> Wenn du wirklich aus Silber rauskommen willst, spielst du Malzahar, Ahri, Miss Fortune und Jinx in jedem Spiel. Außer du bist Autofill Support, dann nimmst du Soraka. \n> Das ist aber halt auch so was, was wenige einsehen wollen. Also dass ihr &quot;Champion Pool&quot; einfach keine 77 Champions umfasst, und dass man, wenn man Aufsteigen will, sich wirklich auf die wenigen Champions konzentrieren sollte, die man beherrscht. Und wenn man die Champions, die einem Spaß machen, mit denen man aber nicht so gut ist, ausprobieren will, dann geht man ins Normal Draft...\n> Ich selber würde zum Beispiel nie auf die Idee kommen im Ranked Thresh zu spielen... obwohl der super viel Spaß macht. Aber ich weiß halt auch, dass ich mit dem in engen Teamfights viel zu oft die falschen Entscheidungen treffe. Also erspare ich das meinem Team und spiele etwas, das einfacher ist.\n\nDann müsste man ja nach deiner Aussage mit Ashe als einfachen Champ besseren Überblick über Teamfights haben in der Theorie die Praxis ist dann eben eine ganz andere.","replies":[]}]},{"poster":"Jastol","date":"2018-09-06T09:56:44.512+0000","up_votes":1,"down_votes":0,"body":"Normal und Ranked sind ein gewaltiger Unterschied. Die wenigsten spielen in Normals ihre Mains sondern probieren etwas neues aus. Manchmal sogar ne neue Position. Dazu kommt noch, dass die MMR in Normals eine andere ist als in Ranked.\n\nIch habe auch schon Normal Games mit Soraka Midlane gewonnen. Trotzdem würde ich sie nicht in Ranked als Midlaner spielen.","replies":[{"poster":"Cenâreth","date":"2018-09-06T11:12:46.817+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jastol,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=000600000000,timestamp=2018-09-06T09:56:44.512+0000)\n>\n> Normal und Ranked sind ein gewaltiger Unterschied. Die wenigsten spielen in Normals ihre Mains sondern probieren etwas neues aus. Manchmal sogar ne neue Position. Dazu kommt noch, dass die MMR in Normals eine andere ist als in Ranked.\n> \n> Ich habe auch schon Normal Games mit Soraka Midlane gewonnen. Trotzdem würde ich sie nicht in Ranked als Midlaner spielen.\n\nAlso wenn du mal Silber gespielt hast dann weißt du ja dass die Leute hier teilweise die Champs die sie spielen nicht können oder ebenfalls neues probieren nur ist es eben hier unten mehr ersichtlich als wie in Dia/Plat.","replies":[{"poster":"Angel Ayume","date":"2018-09-06T11:28:02.017+0000","up_votes":1,"down_votes":0,"body":"Es ist dennoch was völlig anderes. \nIch hab sogar nen perfektes Beispiel für dich. \nICH spiele in Silber 2/1. \n\nIch spiele Zoe gerne. Spiele ich sie in Normals, dann rasiere ich -nicht immer- aber meistens gewinne ich meine Lane, und kann sogar das Game für mich entscheiden. \nSpiele ich sie aber im Ranked, dann verkacke ich die Lane nur und verliere auch oft das Game. \n\nUnd nein, das liegt bestimmt nicht daran, dass ich nervös bin und deswegen schlechter spiele. Das ist schon lange nicht mehr so, dass ich im Ranked nervös werde. :D \n\nEs ist einfach nur der Unterschied zwischen Ranked und Normal.","replies":[{"poster":"Cenâreth","date":"2018-09-06T11:47:45.590+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=00060000000000000000,timestamp=2018-09-06T11:28:02.017+0000)\n>\n> Es ist dennoch was völlig anderes. \n> Ich hab sogar nen perfektes Beispiel für dich. \n> ICH spiele in Silber 2/1. \n> \n> Ich spiele Zoe gerne. Spiele ich sie in Normals, dann rasiere ich -nicht immer- aber meistens gewinne ich meine Lane, und kann sogar das Game für mich entscheiden. \n> Spiele ich sie aber im Ranked, dann verkacke ich die Lane nur und verliere auch oft das Game. \n> \n> Und nein, das liegt bestimmt nicht daran, dass ich nervös bin und deswegen schlechter spiele. Das ist schon lange nicht mehr so, dass ich im Ranked nervös werde. :D \n> \n> Es ist einfach nur der Unterschied zwischen Ranked und Normal.\n\nBei mir ist es eigtl. so dass ich ganz selten mal eigenständig ne Lane verliere, meist verliere ich sie nach 10 - 20 Minuten wenn die Bot/Top nicht gewinnen und ich weiß ich habn Counter gegen mich und kann trotzdem gegen den Counter die Lane bis dahin halten. Von Seiten des Jungles kommen dann meist keine Ganks kein oder dass einer der beiden Lanes überhaupt nicht gewillt ist auf die Mitte zu roamen bzw. unterstützen wollen.\n\nIch beklage mich auch nicht über diese Spiele hab mich damit abgefunden, aber ich wollte Wissen. Wie es da anderen Leuten aktuell geht.\nBei den Ranked Spielen mit Xayah hab ich 60 % wo ich meine Lane sogar gewinne und teilweise 6/0 oder 6/1 stehe, dann fehlt die Kommunikation und Körpersprache des ganzen Teams und du stehst plötzlich 6/4.\n\nGerade als ADC kannst du am schnellsten inten, weil dass Zusammenspiel zwischen einer Fizz Mid und Pyke Supp oder Zhix Jungle Ohnehin dann fast nicht mehr counterbar ist. Und dann kommts drauf an bist du der Counterpick oder waren die beiden die Counterpicks.\n\nDeswegen habe ich mich auch von dem ADC dasein in Silver erstmal verabschiedet, sicher bekomme ich die Lane ab und zu mal, aber nicht als Main.","replies":[{"poster":"Angel Ayume","date":"2018-09-06T11:56:06.877+0000","up_votes":1,"down_votes":0,"body":"Es liegt aber auch sehr viel an einem selbst. Du kannst nicht immer alles auf die Mates schieben, wenn du 6/0 aus der Lane gehst und plötzlich 6/4 stehst. Mag sein, dass es nen Teil die schlechte Kommunikation ist oder auch, weil die Mates sich für dumme Plays entscheiden und man versucht zu helfen. Andererseits kannst du dir aber auch an die eigene Nase fassen. Hättest du folgen sollen? War mein Positioning richtig? Wenn du 4x stirbst obwohl du gefeedet bist, biste in den meisten Fällen selbst Schuld. Pass dich einfach an.. \n\nIch musste mich gestern auch der Situation anpassen, obwohl mir das nicht gefallen hat, aber ich hatte keine andere Wahl, sonst hätte ich vermutlich gefeedet und wäre unnütz fürs Team gewesen.","replies":[{"poster":"Cenâreth","date":"2018-09-06T12:39:21.010+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=0006000000000000000000000000,timestamp=2018-09-06T11:56:06.877+0000)\n>\n> Es liegt aber auch sehr viel an einem selbst. Du kannst nicht immer alles auf die Mates schieben, wenn du 6/0 aus der Lane gehst und plötzlich 6/4 stehst. Mag sein, dass es nen Teil die schlechte Kommunikation ist oder auch, weil die Mates sich für dumme Plays entscheiden und man versucht zu helfen. Andererseits kannst du dir aber auch an die eigene Nase fassen. Hättest du folgen sollen? War mein Positioning richtig? Wenn du 4x stirbst obwohl du gefeedet bist, biste in den meisten Fällen selbst Schuld. Pass dich einfach an.. \n> \n> Ich musste mich gestern auch der Situation anpassen, obwohl mir das nicht gefallen hat, aber ich hatte keine andere Wahl, sonst hätte ich vermutlich gefeedet und wäre unnütz fürs Team gewesen.\n\nWäre ich in dem Fall nicht gefolgt, hätte ich halt 1 Death weniger abgegeben dass ist richtig, wäre aber auch egal gewesen beide focusen dich raus und du bist praktisch oneshot. Da nützt dass rausgehen aus fights oder überhaupt nicht reingehen genauso wenig.\n\nIch hab es auch nicht auf die Mates geschoben oder stand hier i-wo meine Mates waren schuld? sinnerfassend Lesen sei gelernt...","replies":[{"poster":"Angel Ayume","date":"2018-09-06T13:11:22.086+0000","up_votes":1,"down_votes":0,"body":"> * wenn die Bot/Top nicht gewinnen und ich weiß ich habn Counter gegen mich und kann trotzdem gegen den Counter die Lane bis dahin halten. Von Seiten des Jungles kommen dann meist keine Ganks kein oder dass einer der beiden Lanes überhaupt nicht gewillt ist auf die Mitte zu roamen bzw. unterstützen wollen.\n\n\n> * Ich beklage mich auch nicht über diese Spiele hab mich damit abgefunden,\n\n\n> * Gerade als ADC kannst du am schnellsten inten, weil dass Zusammenspiel zwischen einer Fizz Mid und Pyke Supp oder Zhix Jungle Ohnehin dann fast nicht mehr counterbar ist.\n\nKlingt für mich doch schon ziemlich nach \"meine Mates machen die Fehler und ich muss drunter leiden\". \n\nJapp. wärste nicht gefolgt, wärste nicht gestorben, was wäre gewesen, wenn du nicht gestorben wärst? \nWas wäre bei den 4x Toden gewesen, wenn du überlebt hättest? Der Gegner hätte keine Kills und somit Gold und beim ersten Mal sogar Shotdown Gold bekommen, sie wären schwächer gewesen, du hättest vllt etwas deffen können oder eine Lane zum Slowpush bringen können. Deine Mates und du selbst hätten das Game für euch entscheiden können, weil die Gegner nicht so stark gewesen wären.","replies":[{"poster":"Cenâreth","date":"2018-09-06T13:15:24.128+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=000600000000000000000000000000000000,timestamp=2018-09-06T13:11:22.086+0000)\n>\n> Klingt für mich doch schon ziemlich nach &quot;meine Mates machen die Fehler und ich muss drunter leiden&quot;. \n> \n\nWeil du es so hineininterpretierst, ich interpretiere es eben anders.\n> [{quoted}](name=Angel Ayume,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=000600000000000000000000000000000000,timestamp=2018-09-06T13:11:22.086+0000)\n>\n> Klingt für mich doch schon ziemlich nach &quot;meine Mates machen die Fehler und ich muss drunter leiden&quot;. \n> \n> Japp. wärste nicht gefolgt, wärste nicht gestorben, was wäre gewesen, wenn du nicht gestorben wärst? \n> Was wäre bei den 4x Toden gewesen, wenn du überlebt hättest? Der Gegner hätte keine Kills und somit Gold und beim ersten Mal sogar Shotdown Gold bekommen, sie wären schwächer gewesen, du hättest vllt etwas deffen können oder eine Lane zum Slowpush bringen können. Deine Mates und du selbst hätten das Game für euch entscheiden können, weil die Gegner nicht so stark gewesen wären.\n\nNichts weil ich es eh nicht überlebt hätte. Und ich escape grundsätzlich nur gibt es eben Assassin/Mage die schneller als ADC sind vom grundmovementspeed. xD","replies":[]},{"poster":"Cenâreth","date":"2018-09-06T13:13:39.940+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=000600000000000000000000000000000000,timestamp=2018-09-06T13:11:22.086+0000)\n>\n> Klingt für mich doch schon ziemlich nach &quot;meine Mates machen die Fehler und ich muss drunter leiden&quot;. \n> \n\nWeil du es so hineininterpretierst, ich interpretiere es eben anders.","replies":[]}]}]}]}]}]},{"poster":"Sirrkas","date":"2018-09-06T11:28:35.015+0000","up_votes":1,"down_votes":0,"body":"Das trifft durchaus zu, das Problem ist aber, wenn du auf deinem aktuellen Main ebenso schlecht bist, wie die anderen, steigst du nicht auf. Vielleicht würde es dir helfen, wenn du dich erst mal damit beschäftigst, warum deine Winrates im Normal und Ranked so weit auseinander liegen. Das kann wie schon angesprochen daran liegen, dass die Leute im Normal nicht ganz so ernst spielen wie im Ranked und du deshalb im Normal einfacher gewinnst.\n\nDenkbar wäre auch, dass du dich im Ranked zu sehr unter Druck setzt und deswegen mehr Fehler machst.\n\nEdit:\nNach deinen knapp 900 Rankeds in einer Season und einer Winrate von 50 % würde ich mal davon ausgehen, dass du dich wohl genau an dem Punkt in der Rangliste befindest, den du dir verdient hast. Wenn du aufsteigen willst, musst du besser werden. Alle Zufallsfaktoren wie etwa andere Mitspieler, haben sich bei so vielen Spielen schon längst herausgemittelt. ","replies":[]}]}]}]}]},{"poster":"Pandeonor","date":"2018-09-06T11:53:37.655+0000","up_votes":2,"down_votes":0,"body":"Man kann. Ich habe das gemacht. Ich sehe aber das Problem, hatte auch gut zu tun insbesondere im Bereich des unteren Silbers. Von Silber 2 bis Gold 5 hatte ich keine nennenswerte Probleme. Das ging fast in einem Rutsch durch. Aaaaber Silber 5 bis Silber 3 war hartes Brot.\n\nWeshalb das so ist oder bei mir so war, das kann ich nur raten. Eventuell sind vermehrt auftretende Placementspieler ein Problem welches die Streuung der Ergebnisse erhöht. Oder/und, das das was man eigentlich_richtig_ macht in dieser Elo nur schwer funktioniert bzw. angepasst werden muss. Speziell bei mir sehe ich ein Problem darin, das es nur mäßig nutzt besser zu sein wenn man das nicht über Pings und Calls vermittelt.\n\n.... was vielleicht mit ein Hauptunterschied von einem zum anderen Spieler sein wird. Ein \"richtiger\" High-Elo carried nicht nur mechanisch sonder weiss ein Spiel über Pings an sich zu reissen bzw. zu dirigieren. Das ist der Unterschied zu einem sagen wir Yi-Hardcarry der mit \"kopf-durch-wand\" Soloplay durchaus Gold landet ohne jegliches Teamplay-Verhalten zu zeigen. Solche treffe ich öfter. Eine Solofigur hat es schwerer, ebenso jemand der zu wenig pingt wie beispielsweise ich. Das Unvermögen auf Pings und Ratschläge zu hören ist leider in allen Elos weit verbreitet. Jeder weiss es besser.","replies":[]},{"poster":"OPChampsSucks","date":"2018-09-04T12:31:26.218+0000","up_votes":1,"down_votes":14,"body":"Kommt ganz darauf an. Meine Erfahrung in Silber ist einfach das es an der Position, an der Meta  und am Glück liegt ob man es schafft oder nicht.\n\nGlück hab ich sowieso keins also hab allein die letzten 2 Tage nur 5 Runden zsm League gespielt weil ich langsam kein Bock mehr auf afk hell hab. Riot fixxt mal diese afks alter ist nicht mehr normal was ich in letzter Zeit wieder reingebrettert kriege. Gerade first daily match schon wieder n afk -.- \n\nMit premade kam ich relativ zügig vorwärts. winrate steigte auf zeitweise 80%  weil wir gut synergiert haben. Hier haben uns sogar die afks /trolls nicht aufgehalten.\n\nMeta ist halt entscheidend welche Position gerade  viel Potenzial hat. Ist deine nicht dabei kannst du nur hoffen\n\nund nach mehrmaligen netten gesprächen von High dia bis Challengerspielern hin waren sich 99% davon einig das man als supporter solo in silber verloren ist. Dann wirst du auch in 5 Jahren nicht rauskommen wenn du kein Glück hast oder Brand etc nicht zufällig extrem broke ist ^^","replies":[{"poster":"Alpacana","date":"2018-09-04T13:29:45.299+0000","up_votes":3,"down_votes":2,"body":"Komisch..letztens erst wieder auf meinem Smurf gespielt (Silber 3, solo wohlbemerkt).\nMeine letzten 20 Spiele:\n19 Wins 1 Loss:\n\n12 Thresh Wins \n1 Lux Win\n1 Zilean Win\n1 Nami Win\n1 Karma Win\n1 Taric Win\n1 Brand Win\n1 Tahm Kench Win\n1 Vel Koz Lose\n\nKannst du mir erklären wie das passieren konnte?","replies":[{"poster":"Nordwolf87","date":"2018-09-04T14:13:54.711+0000","up_votes":2,"down_votes":0,"body":"Glück? :3","replies":[]}]},{"poster":"Dreadlord Mike","date":"2018-09-04T13:11:04.430+0000","up_votes":3,"down_votes":0,"body":"Die high Dia - Challenger spieler will ich sehen die behaupten dass man aus Silber nicht rauskommen kann als Support....\nPlz erzähl nicht immer soviel bullshit davon bekommt man echt Kopfschmerzen.\nAch btw sind das die Dia/challenger spieler die behaupten die gehörst nicht in Silber aber stuckst trotzdem dort?\nSehr zuverlässig diese Leute muss ich schon sagen, genauso zuverlässig und glaubwürdig wie deine tollen \"Erzählungen\"?\n\nPlz spare me the drama","replies":[{"poster":"TGA 10k","date":"2018-09-04T14:41:50.923+0000","up_votes":1,"down_votes":2,"body":"es ist traurigerweise wirklich so das es als supporter solo in silber super schwer ist, weil du darauf hoffen musst das du einen halbwegs kompetenten adc an deine seite bekommst. es bringt nichts wenn du deine tristana im early auf 5/0 feedest und sie dann im teamfight einfach in das ganze gegnerteam rein springt, weil sie sich für einen gott hält. in der mitte, top oder jungle hat man es da deutlich einfacher, weil man vorerst mal nur auf sich selbst angewiesen ist","replies":[{"poster":"Pure Cynicism","date":"2018-09-04T18:31:02.035+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TGA Steel,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=000200000001,timestamp=2018-09-04T14:41:50.923+0000)\n>\n> es ist traurigerweise wirklich so das es als supporter solo in silber super schwer ist, weil du darauf hoffen musst das du einen halbwegs kompetenten adc an deine seite bekommst. es bringt nichts wenn du deine tristana im early auf 5/0 feedest und sie dann im teamfight einfach in das ganze gegnerteam rein springt, weil sie sich für einen gott hält. in der mitte, top oder jungle hat man es da deutlich einfacher, weil man vorerst mal nur auf sich selbst angewiesen ist\n\nIch habe auf meiner Freundesliste drei Main-Supporter. Einer, der sich selbst diese Season von Bronze II nach Gold III gecarried hat, meist als Nami oder Thresh, einer, der kein Ranked spielt aber locker Gold V schaffen könnte, und einer, der unranked ist und immer nur am Heulen ist. Wenn ich mit beiden erstgenannten spiele, gewinnen die mir die Lane automatisch. Ich lasthitte nur noch die Kills. Wenn ich mit letzterem spiele, verliere ich die Lane. \n\nWenn du als Support gut bist, hast du extremen Impact. Außer vielleicht Toplane kannst du überall ganken. Leider spielen die meisten Supporter extrem passiv. Natürlich gewinnen sie so nicht.","replies":[{"poster":"Cenâreth","date":"2018-09-06T11:17:36.731+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Verwaltungsakt,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=0002000000010002,timestamp=2018-09-04T18:31:02.035+0000)\n>\n> Ich habe auf meiner Freundesliste drei Main-Supporter. Einer, der sich selbst diese Season von Bronze II nach Gold III gecarried hat, meist als Nami oder Thresh, einer, der kein Ranked spielt aber locker Gold V schaffen könnte, und einer, der unranked ist und immer nur am Heulen ist. Wenn ich mit beiden erstgenannten spiele, gewinnen die mir die Lane automatisch. Ich lasthitte nur noch die Kills. Wenn ich mit letzterem spiele, verliere ich die Lane. \n> \n> Wenn du als Support gut bist, hast du extremen Impact. Außer vielleicht Toplane kannst du überall ganken. Leider spielen die meisten Supporter extrem passiv. Natürlich gewinnen sie so nicht.\n\nLane gewinnen ist die eine Sache, aber gewinnst du auch dass Game?\n\nIch hatte letzte Season von B3 keine Probleme nach Silver zu climben, aber über S5 ging dann auch nichts mehr.  Diese Season war ich schon paar mal S3 und wollte weiter auf S1, keine Chance, ich spiel grundsätzlich 3 Rollen wobei ich ADC aktuell hier unten eh nicht spielen brauche und Support öfters autofilled werde.","replies":[{"poster":"Pure Cynicism","date":"2018-09-06T17:04:01.044+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=00020000000100020000,timestamp=2018-09-06T11:17:36.731+0000)\n>\n> Lane gewinnen ist die eine Sache, aber gewinnst du auch dass Game?\n> \n> Ich hatte letzte Season von B3 keine Probleme nach Silver zu climben, aber über S5 ging dann auch nichts mehr.  Diese Season war ich schon paar mal S3 und wollte weiter auf S1, keine Chance, ich spiel grundsätzlich 3 Rollen wobei ich ADC aktuell hier unten eh nicht spielen brauche und Support öfters autofilled werde.\n\nNa also, Bronze III war kein Problem für dich. Weil du insgesamt deutlich besser warst. Für andere wiederum ist Silber V kein Problem. Weil sie besser sind. Du musst einfach besser werden.","replies":[]}]}]},{"poster":"MeMyselfandBaal","date":"2018-09-04T16:20:02.648+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TGA Steel,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=000200000001,timestamp=2018-09-04T14:41:50.923+0000)\n>\n> es ist traurigerweise wirklich so das es als supporter solo in silber super schwer ist, weil du darauf hoffen musst das du einen halbwegs kompetenten adc an deine seite bekommst. es bringt nichts wenn du deine tristana im early auf 5/0 feedest und sie dann im teamfight einfach in das ganze gegnerteam rein springt, weil sie sich für einen gott hält. in der mitte, top oder jungle hat man es da deutlich einfacher, weil man vorerst mal nur auf sich selbst angewiesen ist\n\nAlso ich behaupte ja immer, dass es als Support sogar leichter ist irgendwo rauszuclimben... man muss es nur wollen. Warum? Nun ja...\n1.) Du kriegst in 99% der Fälle deine Main Rolle und bist permanent Autofill Protected. Da kommt keine andere Rolle ran. Oh und dein Team liest nie die Nachricht \"Shit, I'm autofilled Support\" und \"Autofill, mid or troll\". \n2.) Wenn du gut bist, feedest du den ADC und den Jungler, der eher auf der Lane vorbeischaut, die ihm mitteilt, dass der Gegner seine Summonerspells los ist.\n3.) Dein Team hat in jedem Spiel die höhere Vision Score. Das mag nicht bewusst helfen, es kann aber Teamfights entscheiden, wenn dein Team Vision auf den Bush hat und der Gegner dich aber nicht sieht... Oh und sobald du in Silber 2 Pink Wards kaufst, ist dein Team auch da besser aufgestellt als der Gegner. Was dir dann extreme Vorteile bei Drachen oder Baron Kämpfen gibt. \n4.) Du beschäftigst regelmäßig bis zu 3 Gegner. Wenn du gut bist, nimmst du den gegnerischen ADC und Support aus dem Spiel... und lässt dann als nächstes den Jungler töten, der versucht die Lane irgendwie zu retten... Selbst wenn die 5-0 Tristana dann im Lategame übermütig wird... ist deren ADC im 4vs5, welches hinterher ausbricht, immernoch weit hinterher. Versuche da mal als Toplaner ranzukommen... da kriegt man 2 Ganks im Spiel und an sonsten hat man nur auf einen einzigen Gegner Einfluss...\n5.) A propos Drachen: Wenn du die Botlane stompst, ist es auch relativ einfach 2 oder 3 davon einzusammeln. Einfach nach den Kills da mal hinpingen und den einsammeln. Oder den Druck, den man danach dann aufbaut, nutzen um die Objekte zu sichern... Auf der Toplane gibt es vielleicht nen Rift Herald, der dir dann einen Turm holt, auf der Botlane gibt es den Wasserdrachen, der ganze Laningphasen entscheiden kann...\n\n\nAber im wesentlichen gilt eine einfache Regel: Man kann am einfachsten Aufsteigen, wenn man die Rolle spielt, die einem am besten liegt. Und ja, Riot hat wirklich viel dafür getan, dass der Support mehr als eine Ward-Schlampe ist, sondern auch wirkliche Itempowerspikes kriegt.","replies":[]},{"poster":"ELOW Cronos","date":"2018-09-04T15:15:52.166+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=TGA Steel,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=000200000001,timestamp=2018-09-04T14:41:50.923+0000)\n>\n>Es bringt nichts wenn du deine tristana im early auf 5/0 feedest und sie dann im teamfight einfach in das ganze gegnerteam rein springt, weil sie sich für einen gott hält. \n\nPassiert, passiert jedoch genau so oft im Gegnerteam. Und wenn du dafür sorgst das dein ADC in JEDEM Game 5:0 steht, wirst du über kurz oder lang climben. Es ist quatsch das es als Supporter schwerer ist, als auf anderen Rollen zu climben. Wenn der ADC halt mal wirklich Ultrakacke ist, supporte einfach die übrigen drei Spieler in deinem Team.\n\nIch selbst habe schon von Bronze bis nach Platin Supportet, ich weiss wovon ich rede.","replies":[]}]},{"poster":"Nordwolf87","date":"2018-09-04T14:21:37.160+0000","up_votes":1,"down_votes":0,"body":"Ich finde ihn unterhaltsam :>","replies":[]}]},{"poster":"Jastol","date":"2018-09-06T10:03:35.170+0000","up_votes":1,"down_votes":0,"body":"Ein guter Support kann sehr schnell in Silber climben. Ich hatte diese Season auch kein Problem mit unter 100 Spielen von Bronze 2 nach Gold 5 zu climben als Mid/Supp.\n\nDes Weiteren ist Meta in Bronze/ Silber ziemlich egal. Da ist es eigentlich am wichtigsten erstmal die Grundsteine des Spiels zu verstehen und eine Hand voll Champions sehr gut zu spielen.","replies":[]}]},{"poster":"Lonser","date":"2018-09-04T13:59:56.323+0000","up_votes":2,"down_votes":0,"body":"Warum möchtest du denn überhaupt Solo(oder zu zweit) aus Silber raus kommen? Schließ dich doch einer netten 4er Gruppe an oder gleich einer Community und spielt euch dann zusammen hoch :) Dein Text liest sich so als wärst du der SoloQ langsam überdrüssig, versuch es doch mal mit Flex :) Ein Team Game ist nicht dafür gemacht es alleine oder nur zu zweit zu spielen :)","replies":[{"poster":"Cenâreth","date":"2018-09-06T08:46:54.038+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lonser,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=0005,timestamp=2018-09-04T13:59:56.323+0000)\n>\n> Warum möchtest du denn überhaupt Solo(oder zu zweit) aus Silber raus kommen? Schließ dich doch einer netten 4er Gruppe an oder gleich einer Community und spielt euch dann zusammen hoch :) Dein Text liest sich so als wärst du der SoloQ langsam überdrüssig, versuch es doch mal mit Flex :) Ein Team Game ist nicht dafür gemacht es alleine oder nur zu zweit zu spielen :)\n\nDass Problem liegt darin dass ich oftmals Teams habe die nicht gewillt sind sich verbessern zu wollen, oder generell kein FlexQ spielen wollen, darum macht FlexQ atm für mich nur bedingt Sinn. Und ein Teil den ich kenne lassen sich ohnehin meist eher boosten.\n\nGrundsätzlich würde ich gerne in SoloQ und FlexQ was weiterbringen.\nUnd wenn sich da was in FlexQ findet bin ich auch nicht abgeneigt.","replies":[]}]},{"poster":"Alustus","date":"2018-09-04T12:17:56.870+0000","up_votes":2,"down_votes":0,"body":"Habe mich seit Season 4 jedes Jahr mit mindestens einem Account aus Silber relativ zügig rausgespielt, obwohl ich nur ein Low Gold niveau Spieler bin.","replies":[{"poster":"Cenâreth","date":"2018-09-11T11:20:26.992+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Alustus,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=0001,timestamp=2018-09-04T12:17:56.870+0000)\n>\n> Habe mich seit Season 4 jedes Jahr mit mindestens einem Account aus Silber relativ zügig rausgespielt, obwohl ich nur ein Low Gold niveau Spieler bin.\n\nDeine Hidden MMR liegt in Gold, weil du ws last Season auch Gold warst. Deswegen ist es für dich auch leichter dich rauszuspielen ist normal, aber wie sieht es aus mit Personen dessen Hidden MMR in Silver 5 liegt und jetzt aktuell Silver 4 ist?","replies":[{"poster":"Alustus","date":"2018-09-11T20:00:10.410+0000","up_votes":1,"down_votes":0,"body":"Ähm nur das am Anfang der Season meine MMR nicht auf Gold ist, wenn ich in Silber Einsteige.\n\nIch bin kein Challanger der mit einer viel zu hohen MMR in Platin starten muss.\nWenn man als Gold Spieler den Resett abbekommt dann ist man mit der MMR ziemlich genau da wo man auch eingestuft wurde.\n\nEs ist jetzt keineswegs so dass ich am Anfang der Season 25+ Punkte bekomme und nur 3 verliere, sondern eine normale MMR wo ich 20 Punkte bekomme und 15-17 verliere.\n\n\nDu kannst dir gerne Gründe wo anders suchen und einreden, am ende musst du an dir arbeiten und die Fehler suchen.\nkleiner Tipp:\nWenn du nur 10 Champions im Ranked spielen würdest anstatt 79 dann würde es wahrscheinlich auch besser mit dem Aufstieg funtkionieren","replies":[]}]}]},{"poster":"mulle87","date":"2018-09-11T06:27:33.892+0000","up_votes":1,"down_votes":0,"body":"Ich habe es geschafft.\n\nMein Tipp:\n\nSehr kleiner champion Pool. Am besten einfache wie garen. Diese mastern. Nicht das machen was dein Team will. Nicht chasen. Split pushen und das wichtigste: viel farmen so gewinnt man auch verloren geglaubte Spiele oder wenn man nen schlechten Start hatte.","replies":[{"poster":"Cenâreth","date":"2018-09-11T11:18:26.228+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=mulle87,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=000a,timestamp=2018-09-11T06:27:33.892+0000)\n>\n> Ich habe es geschafft.\n> \n> Mein Tipp:\n> \n> Sehr kleiner champion Pool. Am besten einfache wie garen. Diese mastern. Nicht das machen was dein Team will. Nicht chasen. Split pushen und das wichtigste: viel farmen so gewinnt man auch verloren geglaubte Spiele oder wenn man nen schlechten Start hatte.\n\nIch spiel grundsätzlich dass was meinem Team bringt ohne auf mein Team zu hören und mit dem ich countern kann, ich hab nur kaum Spiele wo ich Counterpicks setzen kann.","replies":[{"poster":"mulle87","date":"2018-09-11T12:01:36.284+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=000a0000,timestamp=2018-09-11T11:18:26.228+0000)\n>\n> Ich spiel grundsätzlich dass was meinem Team bringt ohne auf mein Team zu hören und mit dem ich countern kann, ich hab nur kaum Spiele wo ich Counterpicks setzen kann.\n\nDu hast in den letzten 20 matches locker 10 versch. Champions gespielt - ich rate zu weniger Champions! \nich persönliche dodge lieber bevor ich eine Position spiele in der ich mich unwohl fühle. lieber 6 lp verlieren statt 20\nzudem bin ich der Meinung, daß man, wenn man seinen Champion beherrscht es nur wenig gibt was einen aus der bahn werfen kann. ja es gibt counterpicks, aber auch die müssen den Champion beherrschen. counterpick zu wählen und den nicht spielen zu können ist sehr oft der fall","replies":[]}]}]},{"poster":"Punki86","date":"2018-09-07T23:23:34.246+0000","up_votes":1,"down_votes":2,"body":"Also ich muss sagen dass es unwahrscheinlich ist. Ich habe momentan jedes Spiel mit.....\n-Trolls\n-1 time\n-Troll picks / ich meine wenigstens Warden als Xin Supporter etc\n-High Ping\nIch weiss ich habe 2 K games und immer noch Silber bin auch nicht der beste aber du musst richtig glück haben um ein NORMALES Team zu haben","replies":[{"poster":"Cenâreth","date":"2018-09-10T08:49:32.461+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Punki86,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=0009,timestamp=2018-09-07T23:23:34.246+0000)\n>\n> Also ich muss sagen dass es unwahrscheinlich ist. Ich habe momentan jedes Spiel mit.....\n> -Trolls\n> -1 time\n> -Troll picks / ich meine wenigstens Warden als Xin Supporter etc\n> -High Ping\n> Ich weiss ich habe 2 K games und immer noch Silber bin auch nicht der beste aber du musst richtig glück haben um ein NORMALES Team zu haben\n\nDen Eindruck hab ich aktuell auch. Es gibt hier kaum noch jemand der halbwegs anständig spielt, entweder gehen sie afk, trollen in jeden Game. Oder sind toxic und surrendern direkt nach 17 Minuten, ich bin einer von wenigen der weder dass eine noch dass andere macht. Aber Solo carryen ist hier aktuell nicht mehr möglich finde ich, außer mit Fizz. Und es kann eben auch nicht sein dass ein einziger Champ nur noch Solo carryen kann. Die ganzen Patches die eingespielt worden sind, sind hauptsächlich Patches Pro Player gewesen.\n\nEs ist auch in Dia/Master an den meisten Pro Spieler nicht spurlos vorbeigegangen, dass sieht man auch wenn man bisschen mal die anderen beobachtet.","replies":[{"poster":"ELOW Cronos","date":"2018-09-11T07:29:01.466+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=00090001,timestamp=2018-09-10T08:49:32.461+0000)\n>\n> Den Eindruck hab ich aktuell auch. Es gibt hier kaum noch jemand der halbwegs anständig spielt, entweder gehen sie afk, trollen in jeden Game. Oder sind toxic und surrendern direkt nach 17 Minuten, ich bin einer von wenigen der weder dass eine noch dass andere macht. \n\nNun selbst wenn das stimmen sollte, dass Leute in deiner Elo trollen/afk gehen/nicht spielen können, passiert das im Gegnerteam genau so oft wie in deinem (Um genau zu sein sogar öfter, wenn du selbst nicht dazugehörst). Ergo liegt es am Ende das Tages wieder an dir, den Unterschied zu machen um zu climben. \n\n> \nAber Solo carryen ist hier aktuell nicht mehr möglich finde ich, außer mit Fizz. Und es kann eben auch nicht sein dass ein einziger Champ nur noch Solo carryen kann. Die ganzen Patches die eingespielt worden sind, sind hauptsächlich Patches Pro Player gewesen.\n> \n\nIn LoL Solo zu carryen ist sehr, sehr schwer. Das Spiel ist ein 5v5 Game und wenn dein komplettes Team einfach garbage ist, ist es sehr schwierig zu carryen, selbst wenn du ordentlich gefeedet sein solltest. Möglich ist es theoretisch trotzdem (zumindest unter Challenger) und nicht nur mit Fizz. Mit Yi, Jax, Fiora, Vayne, Yasuo etc. geht das genau so gut. Ich hab schon Thresh spieler gesehen die basicly 1v9 gespielt haben, wenn ihr ADC es nur hingekriegt hat Rechtsklick zu drücken.\n\n\nWenn ich dir noch einen Tipp geben dürfte wie du vielleicht doch noch Gold schaffst diese Season:\n\nSpam einfach MF. Am besten OTP den Champ. Deine Winrate damit ist auf viele Games sehr gut. Lass deine Finger von Xayah (zumindest in der SoloQ) und spiel Jinx wenn MF gebannt ist. Ach und ein wenig Last Hit Training würde dir gut tun, auch wenns vielleicht langweilig sein mag (einfach jeden Tag 15 min in nem Custom) :)","replies":[{"poster":"Cenâreth","date":"2018-09-11T11:15:03.414+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sergeant Cronos,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=000900010000,timestamp=2018-09-11T07:29:01.466+0000)\n>\n> Nun selbst wenn das stimmen sollte, dass Leute in deiner Elo trollen/afk gehen/nicht spielen können, passiert das im Gegnerteam genau so oft wie in deinem (Um genau zu sein sogar öfter, wenn du selbst nicht dazugehörst). Ergo liegt es am Ende das Tages wieder an dir, den Unterschied zu machen um zu climben. \n> Aber Solo carryen ist hier aktuell nicht mehr möglich finde ich, außer mit Fizz. Und es kann eben auch nicht sein dass ein einziger Champ nur noch Solo carryen kann. Die ganzen Patches die eingespielt worden sind, sind hauptsächlich Patches Pro Player gewesen.\n> \n> In LoL Solo zu carryen ist sehr, sehr schwer. Das Spiel ist ein 5v5 Game und wenn dein komplettes Team einfach garbage ist, ist es sehr schwierig zu carryen, selbst wenn du ordentlich gefeedet sein solltest. Möglich ist es theoretisch trotzdem (zumindest unter Challenger) und nicht nur mit Fizz. Mit Yi, Jax, Fiora, Vayne, Yasuo etc. geht das genau so gut. Ich hab schon Thresh spieler gesehen die basicly 1v9 gespielt haben, wenn ihr ADC es nur hingekriegt hat Rechtsklick zu drücken.\n> \n> \n> Wenn ich dir noch einen Tipp geben dürfte wie du vielleicht doch noch Gold schaffst diese Season:\n> \n> Spam einfach MF. Am besten OTP den Champ. Deine Winrate damit ist auf viele Games sehr gut. Lass deine Finger von Xayah (zumindest in der SoloQ) und spiel Jinx wenn MF gebannt ist. Ach und ein wenig Last Hit Training würde dir gut tun, auch wenns vielleicht langweilig sein mag (einfach jeden Tag 15 min in nem Custom) :)\n\nDas hat mit Last hitten nichts zum tun der Farm fehlt mir nicht im Early sondern im Lategame, weil ich eben SoloQ Ranked Spiele habe wo die meisten meinen sie müssen jetzt Aram machen, wenn du verstehst was ich meine (Fighten im Jungle, verlieren, den fight, gehen in den nächsten Fight rein, wir pingen zwar, dass sie es vergessen sollen und lieber Waveclear, Lanepushing machen, ignorieren sie aber gekonnt da komm ich schwer auf die Lane. Ich bin im Early meist 10 CS behind.\n\nIn den Normals komm ich auch auf meine 300 CS locker. Mir hat auch schon nen Platin Spieler gefragt ob dass mein Smurf Account wäre.\n\nIn der Mitte hat man die Probleme auch mit farmen, haben mir einige Leute bestätigt ordentliches Waveclear bringt z.B bei der Ahri erst richtig ab lvl 9 etwas. Aufgrund des Q Early Nerfs.\n\nAber richtig in der Mid hab ich noch aufholbedarf was CS bringt.","replies":[]}]}]},{"poster":"Pure Cynicism","date":"2018-09-08T16:12:14.927+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Punki86,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=0009,timestamp=2018-09-07T23:23:34.246+0000)\n>\n> Also ich muss sagen dass es unwahrscheinlich ist. Ich habe momentan jedes Spiel mit.....\n> -Trolls\n> -1 time\n> -Troll picks / ich meine wenigstens Warden als Xin Supporter etc\n> -High Ping\n> Ich weiss ich habe 2 K games und immer noch Silber bin auch nicht der beste aber du musst richtig glück haben um ein NORMALES Team zu haben\n\nWer nach fast 2000 Spielen in low Silber immer noch eine negative Winrate hat, sollte gar nicht über Glück oder Pech nachdenken. Aber gut, wenn man halt 111 verschiedene Champs spielt ...","replies":[]}]},{"poster":"CrunchCake97","date":"2018-09-11T08:55:55.655+0000","up_votes":1,"down_votes":0,"body":"also ich als Sup Main habe so meine Probleme, kann sein das ich halt mit Nami ein spiel nicht carrien kann und alles, aber ja wenn der ADC oder der Jungler meint komplett zu inten kann man leider nicht mehr viel machen. Aktuell bin ich Silber 5 und verliere fast jedes Ranked zur Zeit. :c","replies":[]},{"poster":"Qbert","date":"2018-09-11T08:51:46.658+0000","up_votes":1,"down_votes":0,"body":"Ja doch.\nDu musst nur gewissen Basics beherrschen und Anwenden.\n\n- Lasthitten\n- kein zu großes Risiko eingehen\n- spiele für dein Team, nicht dagegen.\n\nAuch musst du dir bewusst sein, dass du nicht immer alles gewinnen kannst ... und du machst viel über die Einstellung.","replies":[]},{"poster":"PeterPepper","date":"2018-09-04T12:32:36.050+0000","up_votes":1,"down_votes":0,"body":"Selbstverständlich kann man das, ich war nach den Einstufungsspielen vor ein paar Monaten Silber 2 und bin nun mittlerweile bei Platin 2 angelangt. Ich spiele auch nie mit einem Premade in der Solo/duoq ;).","replies":[{"poster":"Cenâreth","date":"2018-09-06T11:22:31.052+0000","up_votes":1,"down_votes":0,"body":"Du hast frisch eingeranked hab ich gesehen, Smurf Account? Oder wurde dein Main gebannt? (ich hab erst kürzlichst auch einen getroffen dessen Main gebannt worden ist und der sich aktuell hochspielt.","replies":[{"poster":"PeterPepper","date":"2018-09-07T08:17:45.250+0000","up_votes":1,"down_votes":0,"body":"Mein Zweitaccount, da ich eine andere Lane (ich war Supportmain) spielen wollte und ich keine Lust hatte gleich gegen Platin zu spielen. Um ehrlich zu sein war ich ganz froh, dass ich in Silber anfangen durfte, denn wirklich besser war ich am Anfang überhaupt nicht. Meine Winrate nach den ersten 40-50 Spielen war vielleicht etwa 45 % und vor allem die Laningphase war sehr schwer für mich. Wie hoch mein Skillcap ist kann ich dir allerdings nicht sagen, da ich meistens die Motivation zum Ranked spielen verloren habe sobald ich Platin war. Allerdings habe ich diese Saison viel mehr Ausdauer was das betrifft... vielleicht liegt es auch einfach daran, dass mir Midlane viel mehr Spass macht als Support im Augenblick ^.^","replies":[{"poster":"Cenâreth","date":"2018-09-10T08:51:13.739+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PeterPepper,realm=EUW,application-id=ip27PlEH,discussion-id=L11JANN2,comment-id=000300000000,timestamp=2018-09-07T08:17:45.250+0000)\n>\n> Mein Zweitaccount, da ich eine andere Lane (ich war Supportmain) spielen wollte und ich keine Lust hatte gleich gegen Platin zu spielen. Um ehrlich zu sein war ich ganz froh, dass ich in Silber anfangen durfte, denn wirklich besser war ich am Anfang überhaupt nicht. Meine Winrate nach den ersten 40-50 Spielen war vielleicht etwa 45 % und vor allem die Laningphase war sehr schwer für mich. Wie hoch mein Skillcap ist kann ich dir allerdings nicht sagen, da ich meistens die Motivation zum Ranked spielen verloren habe sobald ich Platin war. Allerdings habe ich diese Saison viel mehr Ausdauer was das betrifft... vielleicht liegt es auch einfach daran, dass mir Midlane viel mehr Spass macht als Support im Augenblick ^.^\n\nIch mach zumindest Miss Pings, was für die Leute aber anscheinend teilweise auch ein Fremdwort ist.\n\nIch setz den ja grundsätzlich 1x und dann eben auch auf meiner Lane oder dort wo ich es grad sehe, aber ws denken die ich wäre toxic oder sowas.","replies":[]}]}]}]},{"poster":"ΔRC RΔFUNZΞL","date":"2018-09-04T15:39:58.108+0000","up_votes":1,"down_votes":0,"body":"wenn mein zed nicht durchgehend gebannt wäre, wäre mein smurf schon in gold gerankt gewesen. Ich denke jedoch trotzdem nicht das es schwer ist da raus zu kommen. (für mich zumindestens)","replies":[]},{"poster":"Necromant","date":"2018-09-04T12:13:17.998+0000","up_votes":1,"down_votes":0,"body":"Ist jetzt schon paar Tage her, wo ich in Silber war, aber ja, man kann da raus kommen: http://euw.op.gg/summoner/userName=necromant\n\nBzw. war ich Anfang dieser Season S1 eingerankt ^^","replies":[{"poster":"Nordwolf87","date":"2018-09-04T14:15:59.510+0000","up_votes":1,"down_votes":0,"body":"Warst du nicht erst kürzlich Plat? :o\n\nOp.gg sagt G1 0LP :O","replies":[{"poster":"Necromant","date":"2018-09-04T14:37:37.456+0000","up_votes":1,"down_votes":0,"body":"Diese Season war ich noch kein Plat. Letzte Season hing ich in P3 rum.","replies":[]}]}]}]}