{"poster":"Blackdeer","date":"2016-03-23T15:02:53.898+0000","title":"[GER] [Plat+] Metamind sucht Toplaner","subforum":"Clans & Teams","up_votes":6,"down_votes":4,"body":"Hallo zusammen,\r\n\r\nTeam Metamind befindet sich zur Zeit auf der Suche nach einem Toplaner.  Unser Team besteht im Moment aus einem 4 Mann starken Mainroster, Substitutes, Organisation und Coach. Das Team ist gleichzeitig in einer mittelgro&szlig;en Community untergebracht. Elotechnisch befinden sich sowohl Mainroster als auch Substitutes zwischen Platin und Diamant. Teilnahme an versch. Turnieren ist geplant.\r\n\r\n\r\nWir setzen dementsprechend eine Mindestelo von mind. Platin in dieser Season voraus. Gleichzeitig verlangen wir einen kooperativen, kritikf&auml;higen, verl&auml;sslichen und reifen Charakter.  Ebenfalls nehmen wir mind. 4 mal in der Woche, inkl. Wochenende deine Zeit in Anspruch, dementsprechend erwarten wir Spieler, die also genug Zeit zur Verf&uuml;gung haben. Ein funktionst&uuml;chtiges Headset und installierter TS3 verstehen sich von selbst. \r\n\r\nDaf&uuml;r bieten wir dir im Gegenzug nicht nur engagierte Teammates, sondern ebenso Organisator, Coach und Analyst. Wir bieten dir die M&ouml;glichkeit dich sowohl Teambuilderisch als auch als Einzelspieler stetig zu verbessern. Ebenso erh&auml;lst du von uns einen vorgefertigten Terminplan incl. Teamtraining und Videoanalyse.  \r\n\r\nAnfragen bitte unter dem Post oder ingame ( Shaun v2 ) mit folgenden Informationen:\r\n\r\n* Alter\r\n* Elo\r\n* Erfahrungen innerhalb eines Teams \r\n* ein wenig &uuml;ber deinen Charakter und deine Person\r\n\r\n\r\nHierbei gilt es zu beachten, das der Charakter jedem anderen Kriterium vorausgeht.\r\n\r\nTermine f&uuml;r Tryouts werden individuell mit jedem pers&ouml;nlich abgesprochen, die Tryoutphase ist f&uuml;r die Zeit zwischen dem 23.03.2016 - 31.03.2016 angesetzt.\r\n\r\nMfG Shaun","replies":[{"poster":"ABCMonster","date":"2016-03-24T22:28:13.153+0000","up_votes":1,"down_votes":0,"body":"20+, plat 2 - letzte season dia 4 (dafür diese season noch kaum ranked gespielt). Seit Season 2 Teamranked aktiv. Season 4&5 diamond in teamranked. Oftmals als Caller fungiert. Bin Fokussiert & Ambitioniert wenn es um gemeinschaftliches Spielen geht. \nHauptaugenmerk liegt auf Turnierteilnahmen.","replies":[]},{"poster":"Just Aufrichtig","date":"2016-03-23T18:37:29.202+0000","up_votes":1,"down_votes":0,"body":"TDC Aufrichtig\nPlat 2 \n17 Jahre Alt\nBereits in mehreren Gold - Platin Teams gespielt\nIch bin eine relativ freundliche Person , jedoch spiele ich sehr ernst und auch ehrgeizig . In Teams erwarte ich eine gewissen grad von Seriosität. Da ich in der HP 2 für mein Abitur gerade bin bringe ich eine gewisse reife mit. Ich würde mich über ein Tryout game freuen :)","replies":[]}]}