{"poster":"Squerty","date":"2015-04-11T23:43:51.087+0000","title":"servidor","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Que nos estafan cn las skins y no arregrlan el maldito server que se vive cayendo cada 2 segundo.simple saludos.","replies":[{"poster":"Deseo","date":"2015-04-12T02:57:07.359+0000","up_votes":1,"down_votes":0,"body":"hay un problema de LAG ahora mismo y no lo han detectado bien.\n\nes fin de semana, quiero jugar, me da lag con cada skill que uso.\n\ntengo otros juegos online, yo queria jugar LOL y no podemos.\n\nporfavor, Riot, revisa bien, lo siento por la gente que va a tener LAG este fin de semana y perdidas de conexion.","replies":[]},{"poster":"SeBauT","date":"2015-04-12T02:16:41.887+0000","up_votes":1,"down_votes":0,"body":"El server nunca se cae... y si lo hace; avisaría constantemente después de eso como ha pasado anteriormente.\nNo entiendo cual es la idea de quejarse del servidor si ustedes quizás tengan los problemas.\nA veces me da unos picos grandes pero es por culpa de mi internet que se cae cada cierto tiempo... (mi router principalmente).","replies":[{"poster":"Maxi Mérida","date":"2015-04-12T02:24:40.213+0000","up_votes":1,"down_votes":0,"body":"Tercer dia seguido, ya vino un tecnico de telecentro a revisar mi router y nada ... GG server.","replies":[]}]},{"poster":"Time Lord","date":"2015-04-12T00:41:40.871+0000","up_votes":1,"down_votes":0,"body":"El servidor no se ha caido :S \nhttp://loldown.com\n Esa pagina da una idea de la latencia y estabilidad de los servidores, quizas haya problemas con algunos ISP pero el servidor en si, no se ha caido u.u","replies":[]},{"poster":"ManuJG","date":"2015-04-12T00:02:17.896+0000","up_votes":1,"down_votes":0,"body":"Problemas en los servers siempre habrá, el tema es que hace riot con las consecuencias de esos problemas, como dar bola y toma algun tipo de compensasion razonable como activar la derrota evitada. Y no creo que exista ninguna \"estafa\" con el tema de las skins, los precios son razonables, siempre hay ofertas y skins nuevas y nadie te obliga a comprarlas.\n\nSalu2","replies":[]}]}