{"poster":"TWGdabeast","date":"2016-02-08T06:33:09.123+0000","title":"Mordekaiser and his Q.","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"So way back when, a harrowing ago, Riot gave us some short stories to bring some life to our undead friends.\r\nI would Like to focus on {{champion:82}} . We get to learn that with nightfall. A lone swing of his mace breaks in a gate to a fortress of a sort.\r\n&quot;Awesome&quot;\r\n\r\nCompared to in game, Morde is like the big bad wolf and needs to get his swinging arm loose with two swings before the big hitter.\r\nLanding his three Q&#039;s is a challenge with a great sense of pay off, but I feel that his Q could be re-perposed to bring more thematic energy into our big Iron Revenant.\r\n\r\n---------(Skip following paragraph, totally fictious and funny thought i had, as if all the Champions go to the same gym)-----------\r\n\r\n-Let&#039;s say Morde hits the gym, and pairs up with Jayce for a few sessions as they both love giant weapons that go bonk.\r\nJayce realizes why Morde cant swing as well with his right arm.  Jayce finds the problem and being the great guy and work out buddy, fixes the %%%%% on morde&#039;s armor. Morde can now hit homeruns with his Q now! Thanks Jayce.\r\n\r\nQ- Morde takes Nightfall and hits a nearby champion away from him, crippling (slow) them for a short duration. (similar to jayce Hammer knockback). If said enemy champion colides with terrain or an ally ( think bard Q), they are stunned from the jarring impact.\r\n\r\nYES, IT IS CC.\r\n\r\nBut!!! It is with purpose. After dealing the blow, morde&#039;s next auto within a very short durration, (Hit em while their down!) does extra dmg.\r\n\r\nGood Morde players will send their enemies into walls top lane, gankers who are in the wrong spot, or supports. \r\n(A bit of love bot lane there) Gives Morde more to do. And as with no escapes, it would be his sole tool to punish a bad gank\r\n(I know he can cast w to speed up to minions behind him but that isn&#039;t fast enough to outrun anyone as he is the apittomy of slow)\r\n\r\nAnother combo would be to knock them into your minions, cast W, and come running at em ( at 2.5mph...) while they are slow.\r\n\r\nSorry it&#039;s so long. Would love to hear  your thoughts.","replies":[{"poster":"Mathullis","date":"2016-02-08T06:55:05.889+0000","up_votes":1,"down_votes":0,"body":"I like the q idea would be nice. givin the fact you are right about him not having a solid get away to. like mord can totally out run {{champion:266}} {{champion:32}} {{champion:36}} etc etc etc. jgs or gankers all happen to have a knock up snare or some type of cc. poor mord tho has a speed up that only makes him run normal speed. to be honest I'm surprised people have not said anything about him. mord is once again going to disappear (until they change him again but then they going to nerf the hell out of him ). so yeah mords role really has to be stable hes not a solid support nor is he at any other lane at that. so till mord get re worked I guess its r.i.p for our favorite heavy metal mad man.","replies":[{"poster":"TWGdabeast","date":"2016-02-08T16:11:53.714+0000","up_votes":1,"down_votes":0,"body":"Back to the limbo waiting room for reworks.\nSome familiar faces are waiting:{{champion:6}}  says hi.\n{{champion:44}}  and {{champion:83}}  are being operated on. \nAnd for the {{champion:69}}  origional players want her to get the hell back in line. {{champion:82}}  has his true friends to keep him company while we wait.","replies":[]}]}]}