{"poster":"Enderized","date":"2017-04-18T22:24:17.211+0000","title":"Patchnotes 7.8 - Zu viele Fehler um sie alle zu Listen","subforum":"Rückmeldungen zur Übersetzung","embed":{"description":"Xayah, die Rebellin, und Rakan, der Publikumsliebling, werden im Laufe von Patch 7.8 erscheinen! Um die Wartezeit zu verkürzen, kannst du hier mehr über die Vastaya-Freiheitskämpfer erfahren: Angriffstempo von „Wild Entschlossen\" erhöht und wird auf Monstern erneuert. Fehlendes Leben von W erhöht.","url":"http://euw.leagueoflegends.com/de/news/game-updates/patch/patchnotizen-78","image":"https://am-a.akamaihd.net/image?f=https://news-a.akamaihd.net/public/images/articles/2017/april/pn78/xayah-rakan-patch-section-banner.jpg?v=1"},"up_votes":2,"down_votes":2,"body":"Huh? Wer ist denn f&uuml;r dieses Elend verantwortlich? :D\nIch hoffe da wird noch dran gearbeitet:\n\n> &gt; Amumu\n> &gt; Passiv nun absoluter Schaden. Die Resistenzen ihres Passivs wurden verringert.\n> &gt; \n> &gt; Die Funktion von Amumus Passiv (absoluter Schaden nach Schw&auml;chung) entspricht nicht ganz unseren Erwartungen (absoluter Schaden), weshalb wir bei den Werten entsprechend Hand anlegen.\n> &gt; Passiv &ndash; Verfluchte Ber&uuml;hrung\n> &gt; ZUS&Auml;TZLICHER ABSOLUTER SCHADEN 15 % verursachter magischer Schaden, berechnet nachdem dieser Schaden durch Magieresistenz verringert wurde &rArr; 10 % verursachter magischer Schaden, berechnet nachdem dieser Schaden durch magische Resistenzen verringert wurde\n> &gt; W &ndash; Verzweiflung\n> &gt; SCHADEN IN H&Ouml;HE EINES PROZENTSATZES DES LEBENS 1/1,5/2/2,5/3 % des maximalen Lebens des Ziels pro Sekunde &rArr; 1/1,25/1,5/1,75/2 % des maximalen Lebens des Ziels pro Sekunde\n\nDie Passiv ist schon seit letztem Patch mit absolutem Schaden ausger&uuml;stet...\nWas f&uuml;r Resistenzen des Passivs? ... Asooo, der Bonus Schaden kommt ~~erst nach~~ jetzt doch **VOR** der Schadensberechnung... dann schreibt es doch bitte so...\nDer &Auml;nderung in absoluten Schaden entspricht nicht... absolutem Schaden? ehm was bitte?\n\n> &gt; Der Ping kann deinen Champion einschr&auml;nken. Mit einem Champion, der geringe Abklingzeiten hat (z. B. Karthus), f&uuml;hlt es sich eher an, als w&uuml;rde das dein Internet anstelle vom gegnerischen Champion sein Ausweichen kontrollieren. Wir versuchen es zu l&ouml;sen, indem wir die Qualit&auml;t der Magie verbessern.\n> &gt; Q &ndash; Verw&uuml;sten\n> &gt; WEGGELEGTES VERW&Uuml;STEN &bdquo;Verw&uuml;sten&ldquo; kann jetzt gleichzeitig aktiviert werden. F&uuml;hrt Eingabe aus, da die Explosion von &bdquo;Verw&uuml;sten&ldquo; jetzt automatisch losgeht, sobald es nach Ablauf der Abklingzeit abgefeuert wird, es sei denn Karthu bricht den Befehl ab.\n> \n\nDer Infosatz ist an sich Kontextbedingt verst&auml;ndlich, jedoch viel zu Umst&auml;ndlich verpackt... Also:\nDein Ping nimmt bei Champions mit F&auml;higkeiten geringer Abklingzeit erheblichen Einfluss auf die Zielfindung und ersetz somit das Ausweichen des Gegners.\nInwiefern wurde die &#039;&#039;Qualit&auml;t&#039;&#039; der Magie verbessert?\nWer ist &#039;&#039;Khartu&#039;&#039;? ._. \n\n\n> Unterstützungen\n> CHAMPION-UNTERSTÜTZUNGEN Mitwirken bei einem Kampf innerhalb von 10 Sekunden ⇒ 20 Sekunden einer Tötung gewährt Gold und Erfahrung.\n> CHAMPION-UNTERSTÜTZUNGEN Mitwirken bei einem Kampf innerhalb von 10 Sekunden ⇒ 30 Sekunden einer Tötung gewährt Gold und Erfahrung\n\nEhm? Welches gilt denn nun?\n\n\nUnd noch diverses andere...\n\nW&uuml;rde sich darum bitte jemand k&uuml;mmern?\n\nGr&uuml;&szlig;e\nEnderised","replies":[{"poster":"Serlaya","date":"2017-04-19T04:35:52.503+0000","up_votes":1,"down_votes":2,"body":"Also. Es steht dort 1. Karthu nicht Khartu. Machs nicht schlimmer als es ist. \nEs ist wirklich ein bisschen unordentlich geschrieben, aber ich denke dass das auch mal passieren kann. Es kann nicht immer alles fehlerfrei laufen und der Patch war an sich riesig. \nIch denke jeder versteht was man damit meint und es sind immerhin nur Patchnotizen^^","replies":[{"poster":"HyperionCH","date":"2017-04-19T08:24:11.402+0000","up_votes":3,"down_votes":0,"body":"Wenn man jedoch zur englischen Seite wechseln muss, um herauszufinden, was gemeint war, kann man sich die Übersetzung auch gleich sparen (z.B. bei der Sache mit den Assists in ARAM).\n\nPatchnotes sind sogar wichtig, da die Seite selbst nicht aktualisiert wird.\n\nDie Übersetzungsqualität lässt grundsätzlich derzeit zu Wünschen übrig.\nBeim letzten Event gab es auch einen schlimmen (Pyjama Party) und obwohl ich den meldete, wurde er nie korrigiert (was ich noch schlimmer finde als der Fehler selbst). Im Gegenteil: bei der darauf folgenden News schrieb man es sogar in allen Sprachen falsch.\n\nEdit: die Sache mit den Assists wurde offensichtlich korrigiert.","replies":[]},{"poster":"Enderized","date":"2017-04-19T07:29:22.747+0000","up_votes":2,"down_votes":1,"body":"''Nur Patchnotizen''\n\nAlso ich würde mir gerne 200% sicher sein, was gepatcht wurde, bevor ich zB wieder ins Ranked einsteige =)","replies":[{"poster":"Megamaexx","date":"2017-04-19T08:17:59.764+0000","up_votes":1,"down_votes":0,"body":"Also dafür würde es reichen, sich die Änderungen der Werte anzuschauen.  \nNur die ARAM-Assist-Zeit sehe ich da wirklich als Problem (auch wenn für ranked uninteressant)","replies":[{"poster":"Enderized","date":"2017-04-19T08:47:04.428+0000","up_votes":1,"down_votes":0,"body":"Eine Änderung der Werte.\nAber was genau hat sich jetzt bei der Amumu Passiv geändert?\nHabe nochmal in den Notes nachgeschaut in den englischen Patchnotes...\n\nAmumu's Wert der passiven wurde ''generft'', dafür wird der Schaden anstatt nach der Verrechnung, VORHER berechnet.\nAlso doch ein Buff. In wie weit ist das Ersichtlich an den dtsch. 7.8er Patchnotes?","replies":[{"poster":"Megamaexx","date":"2017-04-19T10:30:14.199+0000","up_votes":1,"down_votes":0,"body":"Oh, da ist tatsächlich ein sachlicher Fehler drin. Im englischen steht before und after, im Deutschen nachdem und nachdem.\nEs ist hier im Deutschen nicht unverständlich, sondern einfach falsch übersetzt worden.","replies":[{"poster":"Enderized","date":"2017-04-19T10:39:59.489+0000","up_votes":1,"down_votes":0,"body":"> Die Funktion von Amumus Passiv (absoluter Schaden nach Schwächung) entspricht nicht ganz unseren Erwartungen (absoluter Schaden), weshalb wir bei den Werten entsprechend Hand anlegen.\n\nTu mir dann bitte einen Gefallen und gliedere diesen Satz. Vielleicht bin ich persönlich gar nicht in der Lage diesen zu begreifen.","replies":[{"poster":"Megamaexx","date":"2017-04-19T12:22:23.294+0000","up_votes":1,"down_votes":0,"body":"Lass mal den Teil in den Klammern weg. Dann liest man, dass Riot mit der Passiv von Amumu unzufrieden waren. Das war im englischen aber genauso","replies":[{"poster":"Enderized","date":"2017-04-19T13:13:28.866+0000","up_votes":1,"down_votes":0,"body":"Klar.\nAber eigentlich nach dem englischen gehend wollte man uns mitteilen:\n\nDie Funktion von Amumus Passiv (absoluter Schaden nach Resistenzenverrechnung) entspricht nicht ganz unseren Erwartungen (absoluter Schaden // da nicht absolut, wegen Schwächung durch Resistenzen //), weshalb wir bei den Werten entsprechend Hand anlegen.","replies":[]}]}]}]}]}]}]}]},{"poster":"Zanlan","date":"2017-04-19T12:39:25.001+0000","up_votes":1,"down_votes":1,"body":"Sie haben gesagt es wäre True DMG im letzten Patch, es war aber zusätzlicher magischer Schaden.\n\nJetzt ist es True DMG. Riot fand Amumu selbst ohne True DMG sehr stark, also haben sie diesen etwas verringert.","replies":[{"poster":"Enderized","date":"2017-04-19T13:04:05.231+0000","up_votes":1,"down_votes":0,"body":"Nein... Seit dem letzten Patch verursachte die Passive zusätzlichen absoluten Schaden.\n\nJetzt findet die Verrechnung lediglich anders statt als vorher und ist insgesamt ein Buff gegenüber Tanks, ein Nerf gegen zB ADCs\n\n> UPDATEDPassive - Cursed Touch\n> ~~IS THIS LOVE Amumu's basic attacks reduce enemy magic resist by 15/20/25 (at levels 1/7/13) ~~⇒ cause 15% of all magic damage dealt to the target to be dealt again as true damage\n\nhttp://euw.leagueoflegends.com/en/news/game-updates/patch/patch-77-notes","replies":[{"poster":"Zanlan","date":"2017-04-19T13:12:40.504+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Enderised,realm=EUW,application-id=g95XKE3A,discussion-id=hfJrUQEl,comment-id=00020000,timestamp=2017-04-19T13:04:05.231+0000)\n>\n> Nein... Seit dem letzten Patch verursachte die Passive zusätzlichen absoluten Schaden.\n> \n> Jetzt findet die Verrechnung lediglich anders statt als vorher und ist insgesamt ein Buff gegenüber Tanks, ein Nerf gegen zB ADCs\n> \n> http://euw.leagueoflegends.com/en/news/game-updates/patch/patch-77-notes\n\nhttps://www.youtube.com/watch?v=MNwwZwVY-ew","replies":[{"poster":"Enderized","date":"2017-04-19T13:16:18.234+0000","up_votes":1,"down_votes":0,"body":"Was genau willst du mir jetzt mit dem Video mitteilen?\nIm Grunde genommen bestätigst du mich nur. ._.","replies":[{"poster":"Zanlan","date":"2017-04-19T13:22:42.195+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Enderised,realm=EUW,application-id=g95XKE3A,discussion-id=hfJrUQEl,comment-id=0002000000000000,timestamp=2017-04-19T13:16:18.234+0000)\n>\n> Was genau willst du mir jetzt mit dem Video mitteilen?\n> Im Grunde genommen bestätigst du mich nur. ._.\n\n10 Punkte für Griffendor.","replies":[]}]}]}]}]},{"poster":"BMW E39 525d","date":"2017-05-07T20:21:46.304+0000","up_votes":1,"down_votes":0,"body":"Gewissenhaft arbeiten kennt halt keiner mehr.\nIst ja nur ein Free 2 Play Game, da darf der User keine Ansprüche mehr haben, sonst wird er geflamed :^)","replies":[{"poster":"Enderized","date":"2017-05-08T00:20:08.401+0000","up_votes":1,"down_votes":0,"body":":lach:","replies":[]}]},{"poster":"Epic Melons","date":"2017-04-19T05:42:48.037+0000","up_votes":1,"down_votes":2,"body":"Ja danke, werde dir 1 lachende Sonne in dein Heft malen ok.","replies":[]}]}