{"poster":"Sakuritou","date":"2018-10-01T12:17:33.787+0000","title":"Ab wann ist man \"High Elo\"?","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":0,"body":"Einfach eine kleine Umfrage aus Spa&szlig; :3\r\n\r\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Awsane","date":"2018-10-01T12:58:43.864+0000","up_votes":2,"down_votes":0,"body":"Das kommt total drauf an was man denkt wie \"gut\" der high Bereich sein muss\n\nalso ob er noch casual sein darf oder nicht oder wie herausragend die \"high\" Bereich sein muss.\n\nViel interessanter wäre mMn eine Sammlung von Attributen die ein Spieler der im high Bereich haben muss die ihm vom Casual Bereich abgrenzt, weil wie viele Spieler sich in welcher Division befinden ja auch schwankt.\n\nUnd was ich dann noch interessant finde wäre ein queer vergleich zu anderen Sportarten. Und man sich dann da die Verteilung der Spieler ansieht und die Attribute und ob man dass dann da auch so sieht.\n\nIch nehme jetzt mal als Beispiel Fußball, weil es einfach der bekannteste Sport ist, aber jeder andere würde auch gehen.\nWo ist den die allgemeine Definition von \"high\" im Fußball für eine Person und wo in LoL.\n\nIch würde eher zwischen gut, (Gold-low platin) (Schulnote 2)\nsehr gut (platin-low dia) (Schulnote 1)\nüberragend (dia-master) (Schulnote 1+ mit*)\nund\nKoryphäen (Challenger) unterscheiden (außerhalb der Schulnoten, studiert mit 13 oder so :D)\n\nals eine feste Grenze für \"high\" zu setzten","replies":[{"poster":"Ηastur","date":"2018-10-01T13:51:23.918+0000","up_votes":1,"down_votes":0,"body":"Warum nicht Ballett?","replies":[{"poster":"Awsane","date":"2018-10-01T13:52:45.733+0000","up_votes":2,"down_votes":0,"body":"weil ich mich mit Ballett nicht auskomme und ich der Einfachheit halber etwas genommen habe, von dem ich denke dass es die meisten kennen.","replies":[{"poster":"Qbert","date":"2018-10-01T13:58:17.501+0000","up_votes":1,"down_votes":0,"body":"warum nicht Zwergen-Halma?","replies":[{"poster":"Awsane","date":"2018-10-01T14:02:01.228+0000","up_votes":2,"down_votes":0,"body":"ich kenne nur Zwergenhalma","replies":[{"poster":"Qbert","date":"2018-10-01T14:05:13.470+0000","up_votes":2,"down_votes":0,"body":"hab ich doch gesagt ...... \n\nHach ich liebe es, dass dieses Forum keinen \"editiert\"-Stempel vergibt :D :P","replies":[{"poster":"Awsane","date":"2018-10-01T14:19:43.019+0000","up_votes":2,"down_votes":0,"body":"https://imgur.com/a/bcXXW6R","replies":[{"poster":"Qbert","date":"2018-10-01T14:21:23.888+0000","up_votes":2,"down_votes":0,"body":"Das sieht mir aber sehr nach Paint-Skills aus, Herr Awsane! Ich schreie BETRUG!\n\nhttps://pre00.deviantart.net/4cdf/th/pre/i/2016/332/6/e/lol_poro_by_contreras19-d8fb7la.png","replies":[{"poster":"Awsane","date":"2018-10-01T14:24:30.935+0000","up_votes":2,"down_votes":0,"body":"Warum darf das Forum\n\n(und jeder weiß ICH bin das Forum)\n\nden Stempel nicht mit paint vergeben?\n\nIch sehe darin keinen Betrug","replies":[{"poster":"Qbert","date":"2018-10-01T14:26:33.409+0000","up_votes":2,"down_votes":0,"body":"Weil, du nicht das Forum bist. Denn du bist Awsane und nicht Forum ... *ätsch*","replies":[{"poster":"Awsane","date":"2018-10-01T14:28:36.273+0000","up_votes":2,"down_votes":0,"body":"Forum ist dann aber sehr inaktiv\n\nich finde der Namensgeber für diese Institution sollte doch wesentlich mehr mal bitte machen","replies":[{"poster":"Qbert","date":"2018-10-01T14:31:59.991+0000","up_votes":2,"down_votes":0,"body":"{{sticker:sg-lux-2}} \n\nhttp://euw.op.gg/summoner/userName=Forum\n\nForum hat 1.300 Spiele diese Saison ... das empfindest du als \"wenig aktiv\"? \n\nIch unterstütze deine Aussage wenn es um Text-Präsenz im Forum geht, ja.","replies":[{"poster":"Awsane","date":"2018-10-01T14:33:56.125+0000","up_votes":3,"down_votes":0,"body":"was Forum ingame macht ist ja egal\n\nes geht ja um Forums Aktivitäten im Forum\n\nEin Forenskandal von Forum am Forum ist das","replies":[]},{"poster":"Mjölnir Kind","date":"2018-10-01T14:34:24.559+0000","up_votes":2,"down_votes":0,"body":"Damn das Forum ist ja Hardstuck :O xD","replies":[{"poster":"Mjölnir Kind","date":"2018-10-02T06:55:54.007+0000","up_votes":2,"down_votes":0,"body":"{{sticker:katarina-love}}","replies":[]},{"poster":"Sakuritou","date":"2018-10-02T06:52:59.487+0000","up_votes":2,"down_votes":0,"body":"Danke für den Lachflash {{sticker:sg-miss-fortune}}","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"MeMyselfandBaal","date":"2018-10-01T17:32:53.756+0000","up_votes":2,"down_votes":0,"body":"Alles ein Frage der Perspektive... also als ich noch Bronze war, dachte ich \"Gold ist Highelo und Platin ist unerreichbar\"... wie naiv ich doch war. Mittlerweile kann Platin gar keine High Elo mehr sein, schließlich erreicht selbst ein Vollidiot wie ich das...\n\nAber sachlich gesehen würde ich ja folgendes Kriterium ansetzen, weil es der einzig wirklich relevante ist: Ab welcher Elo kannst du dir über eine Profikarriere Gedanken machen? Also wirklich mit dem Competetiven Spielen dein Geld verdienen und nicht nur als \"Entertainer\" via Youtube? Ab wann kannst du wirklich professioneller eSportler werden?\n\nDann ist High Elo wahrscheinlich irgendwo ab Diamond II...","replies":[{"poster":"Awsane","date":"2018-10-01T17:37:14.699+0000","up_votes":2,"down_votes":0,"body":"Also wenn der Spieler auf Chall. Platz 1 wenigen Chancen auf ne Prokariere hat, gibt's keine High Elo. \n\n{{sticker:sg-kiko}} \n\nund diesen Fall haben wir ja sogar Aktuell.\n\nAber selbst wenn man das ernst nimmt, wirklich Chancen hat man nur wenn man dauerhaft Top 10 Chall. ist und gescoutet werden möchte. Und Top 10 (absolut) der Spieler als highelo anzusehen ist schon krass^^ \n","replies":[{"poster":"MeMyselfandBaal","date":"2018-10-01T18:37:33.643+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Awsane,realm=EUW,application-id=ip27PlEH,discussion-id=P2sFzBW2,comment-id=000b0000,timestamp=2018-10-01T17:37:14.699+0000)\n>\n> Also wenn der Spieler auf Chall. Platz 1 wenigen Chancen auf ne Prokariere hat, gibt&#x27;s keine High Elo. \n> \n> {{sticker:sg-kiko}} \n> \n> und diesen Fall haben wir ja sogar Aktuell.\n> \n> Aber selbst wenn man das ernst nimmt, wirklich Chancen hat man nur wenn man dauerhaft Top 10 Chall. ist und gescoutet werden möchte. Und Top 10 (absolut) der Spieler als highelo anzusehen ist schon krass^^\n\nNaja... das wird dann ja nicht an seinen Skills liegen. \nAlso klar, nicht jeder High Elo Spieler wird zwingend Profi. Aber alle Profis sind High Elo Spieler. \nNebenbei hat der Rang 1 Typ ja für RB gespielt. Gemeinsam mit Thal, Mojin und KaSing. Dass er danach nicht in die LCS gekommen ist, während all seine Teammates LCS oder LCK gespielt haben, wird irgendwie an ihm liegen. Also vielleicht hatte er einfach keinen Bock auf den Stress und spielt lieber entspannt in der türkischen Liga (also laut Reddit... damit wäre er nebenbei auch Profi).","replies":[{"poster":"Awsane","date":"2018-10-01T18:49:34.798+0000","up_votes":2,"down_votes":0,"body":"> Also klar, nicht jeder High Elo Spieler wird zwingend Profi. Aber alle Profis sind High Elo Spieler.\n\nAuch das stimmt nicht so 100%\n\nDiamandprox von Gambit Gaming damals (oder Moscow 5)\nist Pro geworden ohne eine dafür Relevante Platzierung in der Ladder zu haben um ein Beispiel zu nennen.\n\nEs gibt 2 Möglichkeiten Pro zu werden grob gesagt, die erste ist Top 10 Challenger zu sein und gescoutet zu werden oder aber durch Vitamin B aufzufallen, indem man z.B. in den EU Masters(oder anderen Turnieren) mit nen Amateurteam spielt und so kontakte nach oben bekommt, weil man da auffällt.\n\nUnd ja der Spieler auf Platz 1 soll a kein guter Teamspieler sein, jedenfalls in der Deutschen Scene wird das gesagt (also er redet nicht viel und spielt sehr auf sich Fokusiert)\nund soll dazu hohes Lampenfieber haben und auf offline Events schlecht performen.\n\nAber ich habe ihn nur als Beispiel genommen weil es kaum neue Spieler in die LCS schaffen. Einfach gut in Solo q zu sein und damit meine ich Master oder Chall. reicht dafür definitv nicht. Dafür hat die LCS gar nicht genug Plätze.\n\nUnd das beißt sich dann mit der Definition von \"high\" = Profispieler.\nWenn man nach dir Dia 2 ist kann man definitiv nicht über eine Profikarriere nachdenken, nichtmal wenn man mid Chall. ist. Um Profi zu werden gehört noch einiges mehr dazu.","replies":[{"poster":"MeMyselfandBaal","date":"2018-10-01T21:33:51.555+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Awsane,realm=EUW,application-id=ip27PlEH,discussion-id=P2sFzBW2,comment-id=000b000000000000,timestamp=2018-10-01T18:49:34.798+0000)\n>\n> Auch das stimmt nicht so 100%\n> \n> Diamandprox von Gambit Gaming damals (oder Moscow 5)\n> ist Pro geworden ohne eine dafür Relevante Platzierung in der Ladder zu haben um ein Beispiel zu nennen.\n> \n> Es gibt 2 Möglichkeiten Pro zu werden grob gesagt, die erste ist Top 10 Challenger zu sein und gescoutet zu werden oder aber durch Vitamin B aufzufallen, indem man z.B. in den EU Masters(oder anderen Turnieren) mit nen Amateurteam spielt und so kontakte nach oben bekommt, weil man da auffällt.\n> \n> Und ja der Spieler auf Platz 1 soll a kein guter Teamspieler sein, jedenfalls in der Deutschen Scene wird das gesagt (also er redet nicht viel und spielt sehr auf sich Fokusiert)\n> und soll dazu hohes Lampenfieber haben und auf offline Events schlecht performen.\n> \n> Aber ich habe ihn nur als Beispiel genommen weil es kaum neue Spieler in die LCS schaffen. Einfach gut in Solo q zu sein und damit meine ich Master oder Chall. reicht dafür definitv nicht. Dafür hat die LCS gar nicht genug Plätze.\n> \n> Und das beißt sich dann mit der Definition von &quot;high&quot; = Profispieler.\n> Wenn man nach dir Dia 2 ist kann man definitiv nicht über eine Profikarriere nachdenken, nichtmal wenn man mid Chall. ist. Um Profi zu werden gehört noch einiges mehr dazu.\n\nNaja... Diamondprox war damals hohes Gold, nur muss man dabei bedenken, dass Hohes Gold damals was anderes war als heute. Und es ist halt auch verdammt lange her. Plus: Als er dann in der LCS gespielt hat, war er auch High Elo.\nIch würde fast behaupten, dass das letzte Mal, als ein Diamond III Spieler in der LCS gespielt hat, war es Reginald, der aus dem Ruhestand kam, weil Bjergsen Visaprobleme hatte...\n\nOh und natürlich Ballz, der damals Probleme hatte aus Diamond V in Korea rauszukommen. Was alle als Problem angesehen haben. Aber von das sind eher die etablierten ausnahmen.\n\nNebenbei drehst du schon wieder meine Logik um. Also um es an einem anderen Beispiel deutlich zu machen: Wenn ich sage \"Alle Deutschen sind Europäer\" ist das ein logisch richtiger Satz. Den kann ich aber nicht in \"Alle Europäer sind Deutsche\" umdrehen, ohne den Inhalt zu verändern.\n\nWenn ich also sage: \"Alle Profis sind High Elo\", bedeutet das auch, dass alle Nicht Profis, die in der SoloQue auf besagte Spieler treffen auch High Elo sind, ohne dass sie dafür Profis sein müssen. Denn es gibt mehr High Elo Spieler als Profis. Und mehr als \"Du bist High Elo, wenn du mit Profis SoloQue, also auf deren Niveau, spielst\", habe ich ja am Ende nie gesagt.","replies":[{"poster":"Awsane","date":"2018-10-01T22:19:40.859+0000","up_votes":2,"down_votes":0,"body":"> Naja... Diamondprox war damals hohes Gold\n\ntatsächlich ist er meines Wissens nach, als er dem Team gejoint ist gar nicht eingerankt gewesen, sondern kannte die Spieler aus normale Games und anderen Zufällen (wobei auch ich hier falsch liegen kann, aber ich glaube das wurde mal in nen Worlds Trailer/doku angesprochen) Er hat erst danach rankeds gespielt.\n\n\nalso ja, das ist alles etwas zugespitzt. Es geht mir eher um die aktuelle Situation. Wer schafft es als Rookie den jetzt noch in die LCS ohne wirklich sehr bedeutend in Solo Q zu sein und damit meine ich eine dauerhafte Platzierung in den Top 10 Chall. oder eben starkes Auffallen auf offline Turnieren. \nMich stört eher die Aussage, dass man sich Gedanken machen kann ob man Competativ spielen kann ab DIa 2 losgeht.\n\nWeil das a zum einen meines Erachtens nicht stimmt. Oder wir verstehen unter Gedanken machen was komplett anderes. Aber wer Dia 2 ist kann sich nicht einfach umsehen und hat dann realistische Chancen genommen zu werden (für ein Professionelles Team). Man kann sich vllt Gedanken machen, dass man die richtigen Grundvoraussetzungen hat und wenn man weiter improvt und Ehrgeiz plus Zeit reinsteckt es vllt unter umständen wenn man Glück hat schafft. Und mehr echt nicht. Ja man trifft ab Dia 2 ein par Pro Player, aber die nehmen SoloQ zum teil nicht so ernst. Die spielen das ja zum testen und oder auch so zum Spass. Die sind da nicht 100% drauf Fokussiert. \nDas ist ja der Vorteil der Teamlosen Spieler, die können sich mehr auf SoloQ konzentrieren und darum sind die besten SoloQ Spieler oft Teamlose Spieler, daher muss man um aufzufallen auch dort sein und nicht in der Masse.\n\nDu hast eben nicht für mich nur \n\n> Und mehr als \"Du bist High Elo, wenn du mit Profis SoloQue, also auf deren Niveau, spielst\", habe ich ja am Ende nie gesagt.\n\ngesagt. Für mich ist das ein doch relevanter Unterschied und darum poche ich hier so darauf. \n\n\nUnd dann mit deiner Grunddefinition\n>  Also wirklich mit dem Competetiven Spielen dein Geld verdienen und nicht nur als \"Entertainer\" via Youtube? \n\nund meiner Annahme dazu (also nur top 10 Chall.) macht das überhaupt keinen Sinn, jedenfalls für mich.","replies":[{"poster":"MeMyselfandBaal","date":"2018-10-01T23:50:55.058+0000","up_votes":2,"down_votes":0,"body":"Meine ursprüngliche Grunddefinition war natürlich nicht ganz eindeutig. Deswegen habe ich sie in meiner ersten Antwort präzisiert. \n\nNebenbei meinen wir ja am Ende dasselbe. Also ich sage ja nicht, dass man den Großteil des Weges zurückgelegt hat, wenn man Diamond II ist und dann easy zum Profi werden kann. Dieses \"Sich Gedanken machen\" ist erst der Anfang, aber es ist dann nicht mehr komplett naiv sich mit der Idee \"Profi werden\" (und dem daraus resultierenden Aufwand) auseinander zusetzen. Aber auch das hätte ich vielleicht deutlicher formulieren müssen.\n\nNun muss ich natürlich zugeben, dass ich keine genaue Ahnung habe, wie gut die ESL und Premier Tour Spieler wirklich sind. Aber zumindest die Euronics Leute, die ich nachvollziehen konnte (Noway4U, Broeki) sind alle Diamond I oder höher. Und verdammt alt...\n\nOh und die Zeiten, wo ein Edward einfach zu seinem Team kommt und sagt \"Probiert mal meinen Kumpel Diamondprox als Jungler aus\", wie es laut leaguepedia der Fall gewesen sein soll, sind halt auch lange vorbei. Man muss sich halt mittlerweile über die kleineren Turniere und Ligen hochspielen. Aber selbst an diese Turniere (Wir reden hier halt nicht vom King of Spandau oder der UEG Liga) wird man als Diamond V Spieler nur ganz schwer rankommen.\nNebenbei ist viel von der Diamondprox Geschichte mittlerweile auch nicht mehr nachvollziehbare Legendenbildung. Ich glaube halt auch nur mich dunkel an eine \"Narrative Wake\" Folge zu erinnern, in der es thematisiert wurde, dass er Gold war, Gold aber in Season 2 noch einen anderen Status hatte...","replies":[{"poster":"Awsane","date":"2018-10-02T00:20:17.370+0000","up_votes":2,"down_votes":0,"body":"> Nun muss ich natürlich zugeben, dass ich keine genaue Ahnung habe, wie gut die ESL und Premier Tour Spieler wirklich sind. Aber zumindest die Euronics Leute, die ich nachvollziehen konnte (Noway4U, Broeki) sind alle Diamond I oder höher. Und verdammt alt...\n\nuff.\nIch weiß nicht genau was du damit sagen willst :D\ni\nAlso zur Leistung, die sind gut, aber auf LCS Level werden die alle nicht mithalten können. Ich weiß, dass einige bei Noway das immer wieder sagen und hätte er sich vor nen paar !!! Jahren anders entschieden wäre es vllt gegangen. Wobei er will ja auch nicht\n(und der Ehrgeiz ist ja ne super wichtige die Sache die man braucht, es ist ja auch im Sport üblich Talenten auch nen Psychologischen Test zu unterziehen der zeigen soll ob das Talent genug Ehrgeiz hat)\n\nAber jetzt wird das nicht mehr gehen. Ein Froggen(wobei ich glaube der spielt gar nicht mehr oder???), ein Febiven, ein Poe ein Jensen etc pp sind doch alle noch den entscheidenden Ticken besser meiner Meinung nach als Noway (die meisten reden ja immer von NA weils da einfacher sein soll und man nicht ganz so krass sein muss). Sprich der Markt für Midlaner wäre gar nicht da. Das sagt er btw auch selber. \n\nIch wäre mit der Altersaussage Vorsichtig. LoL ist noch zu neu als Spiel um das Vernünftig zu beurteilen ab wann das Alter einen beschränkt. Und selbst dann ist 25-30 noch echt kein Alter. In CS GO gibt es doch sogar noch Profis in dem Spektrum und bei Broeki und so reden wir über nen, Semipro oder gemein gesagt Amateurbereich. \n\nZudem bin ich bei LoL sowieso gespannt wie sich das mit neuen Spielern entwickelt, also ob die Spielerbasis fest ist oder ob genug neue Talente von unten doch ne Chance haben (also wie wichtig wird Erfahrung werden) und sich für dieses Spiel entscheiden (gibt ja doch durchaus andere Titel für Ehrgeizige Zocker die im aufstrebenden Alter sind) (LoL ist ja auch nicht mehr so Anfängerfreundlich)\nIch sage damit nicht, dass das Spiel stirbt, das wäre quatsch, aber dennoch beobachte ich interessiert die Entwicklung gerade von Rookies.","replies":[]}]}]}]}]}]}]},{"poster":"Pure Cynicism","date":"2018-10-01T18:38:58.965+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=ip27PlEH,discussion-id=P2sFzBW2,comment-id=000b,timestamp=2018-10-01T17:32:53.756+0000)\n>\n> Alles ein Frage der Perspektive... also als ich noch Bronze war, dachte ich &quot;Gold ist Highelo und Platin ist unerreichbar&quot;... wie naiv ich doch war. Mittlerweile kann Platin gar keine High Elo mehr sein, schließlich erreicht selbst ein Vollidiot wie ich das...\n> \n> Aber sachlich gesehen würde ich ja folgendes Kriterium ansetzen, weil es der einzig wirklich relevante ist: Ab welcher Elo kannst du dir über eine Profikarriere Gedanken machen? Also wirklich mit dem Competetiven Spielen dein Geld verdienen und nicht nur als &quot;Entertainer&quot; via Youtube? Ab wann kannst du wirklich professioneller eSportler werden?\n> \n> Dann ist High Elo wahrscheinlich irgendwo ab Diamond II...\n\nEs gibt ja selbst in Challenger noch genug Spieler, die weder Team noch Youtube-Kanal haben. Nach dieser Definition wäre selbst die nicht High Elo.","replies":[]}]},{"poster":"Ηastur","date":"2018-10-01T12:25:55.862+0000","up_votes":2,"down_votes":0,"body":"D2","replies":[]},{"poster":"Pandeonor","date":"2018-10-01T13:33:30.869+0000","up_votes":1,"down_votes":0,"body":"Für mich in etwa oberste 25%.\n\nDiese Eingrenzung auf einstellige Prozentzahlen sind allenfalls lustig, jedoch objektiv gesehen nicht sinnvoll. Es gibt keine \"Mid-Elo\", woraus folgt, das man entweder zu High oder Low gehört. Jemandem der zu den 20% Besten gehört ist nicht der \"low\" zuzuordnen.\n\nWas andere hier anbringen was Wissen oder Makro angeht ist mehr oder minder irrelevant im Sinne der Fragestellung, da es um die Elo geht. Mit welchen Fähigkeiten man eine Elo erreicht spielt dabei keine Rolle.\n\nMeine Einschränkung auf die obersten 25% beruht daher auch nicht auf solchen Überlegungen sondern darin, das große Schwankungsbreiten herrschen. Ein Platinspieler kann in einem Monat Platin1 sein und dazwischen Platin5 oder Gold1 nur um am Ende der Saison Platin2 zu landen. Um nur die deutlich überdurchschnittlichen zu erhalten setze ich daher die Marke höher.\n\n\nDas ist ansonsten so wie wenn ich in einem Normal mit einem unranked oder Silber-Spieler schreibe \"care top, your enemy is Platin1\" und einer oder mehrere aus dem Team meinen \"does mean nothing; difference is only a positive winrate\".\n\nHatte heute solch ein Spiel. Top Darius war Gold1, Vorsaison Diamond5 und das gegen eine unranked Fiora. Von diesem Match auch die genannte Erwiederung. Das Spiel war recht einseitig. Wir zu fünft gegen einen Darius. Ach so, nein. Das stammte nicht aus dem Match sondern aus dem 3 davor gegen den Platin2 Kennen der unsere Lv28 Riven plattgebügelt hat. Völlig überraschend.\n\nDie _Arroganz_ in \"Low Elo\"(!) hat in manchen Dingen schon beachtlichen Umfang. Nicht das die \"High Elo\" unbesiegbar wäre. Das ist es nicht. Ich hatte heute 2 Mal einen ADC der nicht einmal die Minions angegriffen hat. Einmal hat die gegerische Soraka doch daran erinnert das man als adc lasthitten solle und im zweiten Fall habe ich das selbst übernommen nachdem bereits mein Toplaner geschrieben hatte das er sein Lasthitten doch in einem Custom üben solle. Was folgte war flame. Von Anfängern oder irgendwas um Bronze3-5 Smurf.\n\n\nWas hier also von Diamond1 aufwärts zu lesen ist, klingt für mich reichtlich abgehoben. Da wäre Erdung sinnvoll, sry.","replies":[{"poster":"Qbert","date":"2018-10-01T13:41:16.580+0000","up_votes":1,"down_votes":0,"body":"Also ich verstehe deine Logik nicht, vielleicht kannst du mir da etwas weiterhelfen.\n\nDu sagst, für dich sind die oberen 25% \"High-Elo\", was ja erst mal legitim ist ... Meinung ist Meinung.\nDann erklärst du anhand des Beispiels Platin, dass es dort ja große Fluktuation gibt. Soweit auch richtig, kann man ja gut nachvollziehen.\n\nNun aber zu meinem Verständnisproblem.\nIch persönlich interpretiere den Begriff \"High-Elo\" etwas elitär, als etwas besonderes eben.\nJedoch sind elitäre Kreise eben gerade nicht von hoher Fluktuation betroffen, da ist kein reges \"Kommen und Gehen\" im Gegenteil, man ist mehr oder minder unter sich.\nDas ist also nicht deckungsgleich mit deinem Beispiel. Denn die oberen 25% in der Elo sind (ich schätze nur, bin zu faul zum nachschlagen) alle ab Gold aufwärts. Und es gibt signifikante Unterschiede zwischen einem Challenger und einem Platin-Spieler.\n\nDaher die Bitte, kannst du das noch mal anders ausführen? Vielleicht habe ich dich auch einfach nur falsch verstanden.","replies":[{"poster":"Pandeonor","date":"2018-10-02T08:07:22.929+0000","up_votes":1,"down_votes":0,"body":"Das es Unterschiede zwischen Platin und Challenger gibt ist natürlich richtig. Ist dieser Unterschied größer als der zwischen Bronze und Platin?. \"Über mir\" hat einer geschrieben das Platin für Ihn früher High-Elo war, aber jetzt nicht mehr, da er selbst Platin ist.\n\nEs ist also m.E. eine Frage des (eigenen) Standpunktes.\n\nAb wann ist man \"reich\"? Was Vermögen angeht gehört man in Deutschland zu den top10% wenn man 216000 EUR besitzt. Für eine Bank ist man reich, wenn man von den Zinsen leben könnte. \n\nDie Frage ist, wo man sich selbst befindet bzw. von welchem Standpunkt man es betrachtet. Ich würde es vom Standpunkt des Bronze oder vielleicht Silber-Spielers betrachten. Es macht (um im Bild zu bleiben) weniger Sinn jemanden der reich ist (oder jemand  anderes ihn so bezeichnen würde) zu fragen wen _er_ für reich hält. Man kann bekanntlich immer noch mehr haben - bzw. (hier) noch besser spielen. Also würde ich Spieler der unteren 20% fragen wen sie für \"High-Elo\" halten.\n\n^^ Andererseits betrachten wie bereits gesagt manche Bronze-Spieler Platin-Spieler für ebenbürtig. \n\nAlso alles Ansichtssache.","replies":[{"poster":"Qbert","date":"2018-10-02T08:36:15.169+0000","up_votes":1,"down_votes":0,"body":"Da gebe ich dir uneingeschränkt recht. High-Elo ist natürlich subjektiv.\n\nIch persönlich würde übrigens sagen, dass der Unterschied Bronze -> Plat nicht mal annähernd so groß ist wie Plat -> Challenger ... da liegen meiner Erfahrung nach noch mal Welten.\nWurde schon mal von einem ordentlich verprügelt :|","replies":[{"poster":"Pandeonor","date":"2018-10-02T21:30:29.859+0000","up_votes":1,"down_votes":0,"body":"^^ Das Vergnügen hatte ich noch nicht. Also - vielleicht noch nicht. Ich wurde seitdem ich spiele (also 1,5 Jahre) bislang 2 Mal so richtig rund gemacht. Einmal vor einem halben Jahr von einem (unranked) Yasuo bei dem ich kein Land gesehen habe und vor ein paar Wochen dann von einer Kayle in Twisted Treeline. Nachdem ich _Booster_ in den Allchat geschrieben hatte, hatte sich der Spieler dann entschuldigt. Die ist durch mich durch als ob ich nicht (nie) da gewesen wäre. Den Yasuo damals konnte ich wenigstens noch ein paar Minuten beschäftigen. ^^\n\nMir fehlt also der Vergleich. \n\n^^Aaaaber ich misch die eh´ bald alle auf :-D.","replies":[]}]}]}]}]},{"poster":"Ayysix","date":"2018-10-02T15:01:36.863+0000","up_votes":1,"down_votes":0,"body":"Naja, \n\nnoway4u hat das in seinem Stream mal ganz treffend gesagt.\n\nWenn du nur casual zockst, 1-2 Spiele nach Feierabend, und dich ansonsten nicht allzu sehr mit dem Spiel auseinandersetzt, ist Gold garnicht scheiße. Und für jemanden, der gerne mal mehr zockt, LCS guckt, und eine Rolle maint, ist Platin bestimmt auch irgendwo \"High Elo\". Wenn du aber jeden Tag mehrere Stunden zockst, dir alles auf leagueofgraphs anguckst, Prostreams, Tutorials etc. und du bist NICHT Diamond, dann suckst du. \n\nGanz einfach: Je mehr du in das Spiel steckst, desto mehr sollte dabei rauskommen. Für Challengerspieler, die das Spiel sozusagen \"studieren\", ist bestimmt alles unter Dia 1 Low-Elo.","replies":[]},{"poster":"SHRX DECOY","date":"2018-10-01T19:42:03.080+0000","up_votes":1,"down_votes":0,"body":"wenn dein team dich carrien muss damit du climbst","replies":[]},{"poster":"Korea Mid lIllI","date":"2018-10-01T17:22:24.768+0000","up_votes":1,"down_votes":0,"body":"Richtig High elo find ich ist ab Diamand 1/Master, D5 bis D2 ist das Mittelmaß würde ich sagen :D","replies":[]},{"poster":"Epic Melons","date":"2018-10-01T16:43:17.650+0000","up_votes":1,"down_votes":0,"body":"Ab kommenden Freitag \n\n{{sticker:sg-ahri-2}} {{sticker:sg-jinx}}","replies":[]},{"poster":"ITroll4Fun","date":"2018-10-01T16:27:07.370+0000","up_votes":1,"down_votes":0,"body":"Laut einem Riotsupporter ist Platin ein competitiver Bereich, also Platin dann (KAPPA).","replies":[]},{"poster":"P3ngui","date":"2018-10-01T14:18:03.792+0000","up_votes":1,"down_votes":0,"body":"Ab Dia 1 würde ich sagen. Also alles über Dia 2","replies":[]},{"poster":"Pure Cynicism","date":"2018-10-01T12:32:36.593+0000","up_votes":1,"down_votes":0,"body":"Eine Definition, nach der  1% aller Spieler High Elo wären und alle anderen quasi Trash, macht meines Erachtens wenig Sinn. Die Grenze muss vielmehr da angesetzt werden, wo die Spieler bereits weit überdurchschnittlich gut sind. Das ist bei Platin der Fall, wo sich nur ca. 10% aller Spieler befinden. Andererseits wird auch Gold nur von 25% der Spieler erreicht.\n\nIn Platin III hatten die Games nach meinem Empfinden schon einen deutlich strukturierteren Charakter als zB in Silber. Mir fiel das Climben durch Platin deutlich einfacher als durch Gold. Aber zugegeben: Ich hab auch nur bis zu Platin II - Promo gespielt. Weiter reichen meine Erfahrungen nicht.","replies":[{"poster":"Awsane","date":"2018-10-01T13:51:31.323+0000","up_votes":1,"down_votes":0,"body":"Das eigentlich Hauptproblem ist der Kerngedanke der high Elo an sich.\n\nEs ist einfach Blödsinn versuchen alle Spieler in die Kategorie du bist schlecht du bist gut in einem PvP Game versuchen einzusortieren. Weil wir nicht Wissen oder Kompetenzen abfragen können wie in einem Test, weil der das was ein Spieler leistet immer in Relation zu seinem  Gegner zu sehen ist.\n\nDas 2. Problem ist der soziale Status dahinter. Jeder will zu den angesehenen \"high\" Gruppe gehören. Sprich die meisten werden so argumentieren, dass sie in ihr ist. Weil um nach Dia oder Platin zu kommen nicht so einfach ist.  Zudem wollen die Spieler ganz oben die viel geschaut werden, dass ihr herrausragender Skill geehrt wird auch dementsprechend honoriert wird. Deswegen versuchen die sich auch abzugrenzen. Das führt zu einer Situation in der es sehr viele Unterschiedliche Definitionen gibt weil es einen Interessenkonflikt gibt. Jeder will die bestmögliche Reputation für sich erreichen.","replies":[]}]},{"poster":"roflmao420xDhdLP","date":"2018-10-01T12:46:27.343+0000","up_votes":1,"down_votes":0,"body":"Diamand 1","replies":[{"poster":"Qbert","date":"2018-10-01T12:49:47.118+0000","up_votes":1,"down_votes":0,"body":"also entweder Diamond oder Diamant, da musst du dich schon entscheiden :)","replies":[{"poster":"roflmao420xDhdLP","date":"2018-10-01T12:58:52.345+0000","up_votes":1,"down_votes":1,"body":"nehe, warum den?","replies":[{"poster":"Qbert","date":"2018-10-01T13:11:59.882+0000","up_votes":1,"down_votes":0,"body":"weil nur die o.g. korrekt sind, Englisch oder Deutsch ... aber Denglisch ist doof :o","replies":[]}]}]}]},{"poster":"Mjölnir Kind","date":"2018-10-01T12:19:40.102+0000","up_votes":1,"down_votes":0,"body":"Ab Mitte Dia würd ich behaupten.\n Dia 3 ca.","replies":[{"poster":"Sakuritou","date":"2018-10-01T12:22:48.216+0000","up_votes":1,"down_votes":0,"body":"Ich finde ab Mitte Platin. Diamond ist schon sehr hoch und auch wenn meine Mitspieler in Master Diamond als Low-Elo sehen","replies":[{"poster":"Mjölnir Kind","date":"2018-10-01T12:27:19.942+0000","up_votes":1,"down_votes":1,"body":"Naaaaaaja.. xD\nIn Platin wird Makro Play nicht gerade hoch geschätzt xD\nGenauso wie das DecisionMaking vieler relativ schlecht ist.\nBis D5 kommen doch schon noch einige, ab D5 brauchst du mehr als nur ne gute KDA würd ich sagen :P\n600 Games in Platin lernten mir ja doch einiges xD","replies":[{"poster":"Sakuritou","date":"2018-10-01T12:28:06.942+0000","up_votes":1,"down_votes":0,"body":"Stimmt auch wieder.. Naja war ja lange nichtmehr in Platin. Habe Platin besser im Kopf :o","replies":[{"poster":"Maexle","date":"2018-10-01T12:49:23.128+0000","up_votes":1,"down_votes":0,"body":"Ich habe Platin als ein überhebliches, mechanisch besseres Gold wahrgenommen. Viele Spieler da haben trotzdem nichts im Kopf. \n{{champion:17}}","replies":[{"poster":"Qbert","date":"2018-10-01T12:50:54.594+0000","up_votes":1,"down_votes":0,"body":"^dis\n\nDas geht hoch bis Dia, mMn, sagen wir so ab Dia2/1 sind die Leute nicht mehr SO überheblich","replies":[{"poster":"Maexle","date":"2018-10-01T12:54:27.399+0000","up_votes":1,"down_votes":0,"body":"Überheblich sind sie dann schon noch etwas, aber teilweise zuerecht. Und auch nur so lange, bis sie mal gegen einen Master oder sogar Challenger spielen, der ihnen dann die Grenzen aufzeigt. \n\nDas sind aber auch nur meine Erfahrungen von vor drei Jahren. Jetzt kann ich das nicht wirklich beurteilen.\n{{champion:17}}","replies":[]}]}]}]}]}]}]}]}