{"poster":"Leek","date":"2015-09-24T05:32:54.269+0000","title":"Duda con el MMR O ELO","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Mi duda son las siguiente:\r\n1) si en plena clasificatoria/ranked tiras surrender, &iquest;te baja mas el mmr y te quita mas puntos?\r\n&iquest;modifica en algo tirar surrender o es lo mismo que perder, cuando te tiran el nexo?\r\n\r\n2) &iquest;hay otra manera de mejorar tu mmr, que no sea teniendo mas ganadas que perdidas?\r\n\r\nGracias.\r\nSaludos.","replies":[{"poster":"Lfdu007","date":"2015-09-24T05:58:15.412+0000","up_votes":1,"down_votes":0,"body":"Realmente el MMR no evalua si ganaste o perdiste partidas , si haces duo o si tenes una racha de victoria ... el MMR se calcula con tu desempeño en las partidas , lo conocido como  KDA ... por eso es recomendable que caundo vas a perder una partida o ya este ganada no ponerte a regalar kill  o tratar de hacer 1 vs 5 y esas cosas raras que seguro vas a morir ( aunque este perdida o ganada) ... si esta ganada te recomiendo que trates de mejorar con asist , kills y farm tu mmr , si esta perdida trata de no morir y dar vuelta la partida ... \n\n\neso es lo que tengo entendido y lo que lei en varias pag que calculan tu mmr","replies":[{"poster":"Gordolfo","date":"2015-09-24T12:26:45.130+0000","up_votes":2,"down_votes":0,"body":"El KDA no afecta en nada el mmr o elo.\nEn las paginas calculan tu MMR dependiendo de la gente contra la que te toque jugar y su division, jugaste 20 partidas y en la mayoria jugas contra plata 2, seguramente tengas el mmr de plata 2.","replies":[{"poster":"Lfdu007","date":"2015-09-24T19:59:56.240+0000","up_votes":1,"down_votes":0,"body":"yo solo opinaba lo que sabia ... si te fijas en la pag de op gg , en la parte \"ayuda\" explican como calculan ellos el mmr ... que evaluan tu rendimiento personal en cada partida ... capaz que el sistema interno de riot es de otras manera la verdad no se y creo que nadie sabe exactamente","replies":[]},{"poster":"LaReinaPingüino","date":"2015-09-24T13:19:52.842+0000","up_votes":1,"down_votes":0,"body":"Yo he jugado poco ranked y de las primeras 10 quede en plata 2despues las 2 o 3 siguientes las perdí y al calcular mi mmr en las.gg.op o algo así salía que es posible que suba dos divisiones... y tengo -11 lp? es una broma esa página o que? no entiendo es como ue me está troleando T.T","replies":[{"poster":"Gordolfo","date":"2015-09-24T15:23:37.231+0000","up_votes":1,"down_votes":0,"body":"Mientras mas rankeds juegues mejor calcula tu MMR, tranquilo no te vuelvas loco por el MMR o ELO , ya que solo RIOT sabe la verdad sobre esto y lo que se tiene en cuenta, trata siempre de tener mas victorias que derrotas y asi iras mejorando .","replies":[]}]}]},{"poster":"nifu","date":"2015-09-24T12:50:53.887+0000","up_votes":1,"down_votes":0,"body":"morir 1 ves o morir 500 si vas a perder es lo mismo. son solo numeros, aca la posta se demuestra en la cancha","replies":[]}]},{"poster":"Winry R0ckbell","date":"2016-02-01T13:35:36.922+0000","up_votes":1,"down_votes":0,"body":"Ehhhh.. No! queres aumentar MMR hay que ganar partidas.. como se ganan? terminando cada match con  un KDA mayor al que debería tener tu rango o grado ejemplo \"Silver\" sin importar que escalón estas... porque ganarías por simplemente tener un buen KDA? porque robaras mucho oro del otro team y ellos ninguno de ti! las probabilidades de ganar aumentan exponencial-mente creeme.\nYo Pase por eso... juego de suport tengo winrate en temporada 6.2   70/40 sin hacer premade y solo siendo supp. Para todos los bobos que piensan que los suports no carrean es ahí cuando se ve lo malo que puede ser alguien jugando. mejora tus números solo piensa en eso y subirás sin darte cuenta.\nYo tiraría surrender solamente si es una derrota inminente y tu KDA de la partida es muy bueno, pero no alcanza para carrearlos. \nNo aceptaria nunca un surrender aunque fuera una derrota inevitable si tengo mal KDA del match, pero aun tengo tiempo de mejorarlo aunque sea un poco.. ya que el KDA total importa muchisimo a la hora de cuanto lp  te sacan por partida y cuanto lp ganas.. cuando ganas.\n\nComentarios failed retard detected:\n**_\"Muero 10 veces porque soy el sup que mas puedo hacer\".._**\n termino 0/10/10  eso yo lo llamo pesimo suport. KDA de la partida es 1\n\n**_\"Fijas ADC y no sabes ni farmear como vamos a ganar la linea?\"_** \nque te importa si el adc sabe farmear o no! hace tu juego tu trabajo y no mueras aunque pierdas solo mira tu KDA todo el tiempo.. vos no jugas para que los demas aprendan a jugar.\n\n_**\"Tenes buen KDA por que solo asistis, sos un carreado!\"**_ \nPatetico comentario ellos van de suport y se pasan fedeando hay que saber ser sup, no tienen ni idea de  lo que hablan. Aburrido de carrear como suport estoy! siempre me dan RIVAL HONORABLE y me agregan y no acepto pero no recomiendo hacer premade ninguna si quieres subir rapido.\n\n_**\"Para subir como suport tenes que buscar un ADC bueno y hacer DUO\"..**_\nJamas vi un comentario que me de mas risa que ese jajajajajaja. Ahi es donde uno piensa que el supp no carrea es el comentario mas errado que jamas escuche. Vos sos el supp del team no del ADC. Cuidas tu adc porque hay que saber zonear  hacer peeling engage y disengage, congelar linea etc. pero si no miras el minimapa 6 segundos de cada 10 de la partida no se como ganaras partidas. Mucha suerte gente . :D \nTengo KDA de 5.1 suman kills + asist / muertes y revisen su KDA mucha suerte! {{champion:26}}","replies":[]},{"poster":"Sir Crucifix ","date":"2015-09-24T13:31:44.892+0000","up_votes":1,"down_votes":1,"body":"Debería ser de acuerdo al KDA , porque si todas las partidas terminas 1/9 0/ 12 no debes estar ahí , aunque ganes por carrito","replies":[{"poster":"Winry R0ckbell","date":"2016-02-01T12:27:01.200+0000","up_votes":1,"down_votes":0,"body":"Exactamente amigo, capas alguno sale respondiendo otra cosa a lo que escriba ahora o hasta incluso flameando jaja nunca se sabe que tan noobs puede ser alguien pero dejare mi opinión tal cual me la explico un division platino 1, que si bien no es la gran cosa ami me sirvió mucho y de bronce V a plata 3 en 2 semanas con poco juego.\nDice así: 1) el ELO Hell, no existe. en realidad si tu no eres trol o afk tu team tiene mas chance de ganar en cada partida ya que ellos son 5 que pueden ser trol y ustedes 4 que pueden serlo.\n              2) Dejar de llorar si jugas 30 rankeds y no subis ni bajas estas donde mereces.\n              3) El KDA esta relacionado al MMR si ven mi historial las que perdi sali con buen KDA mayor a 4 a veces. y  solo me sacaba 12 o 14 puntos. En cambio si muero muchisimo y mi KDA de la partida es malo me saca muchos puntos. Cuidando mi KDA en cada partida aumente mi MMR por una simple razon. Es que el KDA esta indirectamente relacionado con el MMR si bien no tiene nada que ver una cosa lleva a la otra... El MMR es verdad son el win rate, pero como tener un winrate bueno jugando mal? Carreado unicamente, pues si puedes aumentar MMR de esa manera con un premade diamante y SI vas a subir elo aunque salgas mal. Pero puedes subir MMR solo sin ser un pro simplemente no muriendo y aumentando el KDA de esa manera indirectamente empezaras a ganarlas casi todas jugando como siempre lo hacías. Tengo KDA de 5 y en cada partida me agrega la gente :D\nQuieres subir elo, subir ligas Elije sup o jungla no mueras jamas y as muchas asistencias y kills.. si es derrota inevitable no mueras ni te tires a salvar gente mal posicionada. llegue al punto de importarme mas mi KDA  que si ganaba o perdia, solo miraba mis puntos, yo no juego para que mi team juege mejor, juego para mejorar yo!  inclusive en promos solo pensaba en mi KDA de ese momento haciendo cuentas constantemente y no me enfadaba por perderlas y sin darme cuenta empece a subir como loco. \nSaludos.\nP.D: Vino el reset, otra ves gane 7 de 10 y me dejo bronce 4 en 4 dias jugando poco porque trabajo y estudio bronce 1 estoy seguro que no tengo techo un platino ADC que juega muy bien me dijo que suporteo mejor que los de su elo :D\nA mi me sirvio mucha suerte y agradezcan que es un buen dia para mi y les doy este secreto XD (NO MUERAN!!!!)","replies":[]}]},{"poster":"Runth","date":"2015-09-24T22:30:36.049+0000","up_votes":1,"down_votes":0,"body":"me gustaria ver a uno con 0 de elo jajaja , q lamentable q lo ocultan, ese sistema es demaciado engañoso,","replies":[]},{"poster":"Don KeKeiras","date":"2015-09-24T06:07:20.306+0000","up_votes":1,"down_votes":0,"body":"1- No, los puntos y mmr que vas a ganar o perder se calcula ni bien sale el match, no importa cuanto dure ni como es que se gane/pierda.\n2- Nope, ganando es la única forma de subir tus puntitos de mmr.","replies":[]}]}