{"poster":"Gintonic2012","date":"2018-05-26T18:38:27.196+0000","title":"★ SEI DABEI!!! - TEAMBINGO für alle - Nutze Die Chance dein Clash-Team zu finden★","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"http://legacy-global.de/hochladen/team-bingo.jpg\r\n\r\nHallo liebe Community,\r\n\r\nDie Organisation Legacy Global eSports w&uuml;rde Euch gerne ihr Konzept zur Teamsuche vorstellen.\r\n\r\nWer ein Team sucht, egal ob f&uuml;r Clash oder Ranked, und dies einfach &uuml;ber das LoL Forum oder &auml;hnliches zu lange dauert oder bisher der Erfolg ausblieb, f&uuml;r den haben wir genau das Richtige!\r\n\r\nAm Sonntag, den 27.05.18 findet unser n&auml;chstes Teambingo statt und Ihr seid herzlich eingeladen daran teilzunehmen.\r\n\r\nWie l&auml;uft das am Sonntag ab?\r\n\r\nTreffpunkt ist Sonntag 20 Uhr auf unseren Teamspeak Server im Channel &bdquo;Wartebereich Team-Bingo&ldquo;. Sobald es losgeht, werdet ihr in die Event-Area gezogen.\r\n\r\nLCG &ndash; Teambingo:\r\n● jeden Sonntag ab 20:00 Uhr findet im Teamspeak in der Event-Area eine Zusammenkunft der Spieler statt, die aktiv ein Team suchen.\r\n\r\n● die Spieler werden dann von den Teambetreuern in verschiedene Channel verteilt die nach Elo, Premades, Wunschmitspielern etc. ausgew&auml;hlt werden.\r\n\r\n● es entstehen also Channel mit jeweils 5 Spielern, die dann die Gelegenheit haben sich zu beschnuppern und 1&ndash;2 Games miteinander zu spielen.\r\n\r\nNach dieser Sortierung und nach den Games folgt ein Feedback an den Teambetreuer, der gerade f&uuml;r euer Team zust&auml;ndig ist.\r\n\r\n● Verlaufen die Games positiv und es kommt ein Team zustande, k&uuml;mmert sich der Teambetreuer um einen Channel und um den jeweiligen Eintrag.\r\n\r\n● Verlaufen die Games nicht so toll, kann reagiert werden in dem ein Spieler getauscht wird oder wenn es andere Gr&uuml;nde gibt die so schnell nicht zu kl&auml;ren sind, ist eine Woche sp&auml;ter ja der n&auml;chste Teambingo-Abend.\r\n\r\nNoch fragen? Dann schau bei uns auf den TS&sup3; vorbei oder stell sie direkt hier!\r\n\r\n★ Dein Legacy Global eSports Team ★\r\n\r\nKontaktdaten:\r\nTeamSpeak IP: ts.legacy-global.de\r\nWebsite: http://legacy-global.de \r\nE-Mail: teambetreuung@legacy-global.de","replies":[]}