{"poster":"muchachoman94","date":"2016-11-16T09:18:07.553+0000","title":"Immer gegen Bots als Anfänger / neuer Account","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":8,"body":"Moin ! Ich schreibe jetzt mal von meinem gebannten Account aus um mal klar zu machen wie schade ich das finde wie sich LOL als Spiel entwickelt bez&uuml;glich der Bans /Smurf Situation.\nKlar wurde ich mit Sicherheit zur Recht verbannt da ich wirklich ein sehr aggressiver Spieler war eine Zeit und danach auch mich nicht ruhig Verhalten habe wenn jemand mich verbal im Spiel angegriffen hat . Im nachhinein ist mir auch bewusst das euer Ban System diese Spieler schon ziemlich gut bestraft und ich einfach h&auml;tte nicht reagieren sollen . Wie dem auch sei dieser Drops ist gelutscht und ich habe mich damit abgefunden . Ich frage mich nur ob das der richtige weg ist ?! Denn leider musste ich feststellen seitdem ich mir einen neuen Account gemacht habe das fast alle Spiele die ich gespielt habe im PVP Modus 5vs5 Aram oder auch ein Normal gegen Farm/Levelbots stattfinden . Oder halt gegen erfahrene Spieler (wie ich ja dann anscheinend auch ) die einfach Anf&auml;ngern den kompletten Spa&szlig; nehmen in dem Sie mit ihrem k&ouml;nnen das komplette Spiel dominieren . Und jetzt nur mal in dem Raum geschmissen als Idee . K&ouml;nnte man nicht diesen Andrang an Smurfs ein bisschen Z&uuml;geln in dem man den Leuten die sich wirklich verbal negativ Verhalten nicht den Account nimmt sondern einfach eine Permanente Chatsperre ? Oder irgendwas in der Richtung (Champions gehen verloren oder oder oder )? Ich wei&szlig; ich hab nicht rum zu heulen und mich nicht dar&uuml;ber zu beschweren (da ich selber so ein Arsc* war) aber ich finde die Bestrafung zwar Effektiv doch etwas &uuml;bertrieben da man auch Teilweise f&uuml;r Textinhalte eine Bestrafung bekommt wo man eine Diskussion gehabt hat ( aber nicht wirklich den anderen Verbal beleidigt hat , einfach weil 3 Premades ein Reporten gilt es dann als ein Fehlverhalten .) die einfach nur dem gegen&uuml;ber nicht gefallen hat. Bsp . : &quot; Ich finde aber nicht das man mit Lulu Ad spielen muss wenn man gerade ein Ranked spielt &quot;\n ( Ja ich bin sehr schlecht in sowas {{sticker:slayer-jinx-wink}} )\nWar nur mal ein kleiner Gedankengang von mir da ich derzeitig viel mit Anf&auml;ngern spiele und diese st&auml;ndigen Levelbot spiele einem ein wenig mehr den Spielspa&szlig; nehmen als jeder Flamer den ich kenne {{summoner:13}} \nUnd was wird gegen diese Levelbots getan? \nW&uuml;rde mich mal Interessieren wie ihr da so seht  :)\nRIP Muchachoman94","replies":[{"poster":"Abasin","date":"2016-11-16T09:49:11.598+0000","up_votes":5,"down_votes":0,"body":"Permanente Chatsperre ist offenbar ein Dauerthema bei permanent Gebannten. Ein Schelm wer Böses dabei denkt. Aber wenn Du Dir die Mühe machst und dieses Forum gründlich durchsuchst, wirst Du schnell eine Menge Diskussionen finden. Unter anderem von einem bereits vor Jahren gescheiterten Versuch, ob langfristige Chatbans etwas bringen. Das Ergebnis kannst Du Dir wohl denken. {{sticker:slayer-jinx-wink}} \n\nJetzt mal zu Deiner Spielsituation und der Levelbotthematik. Durch dieses Tal der Tränen musst Du wohl durch. Die MMR der Bots ist begrenzt. Wenn Du also langfristig eine höhere Winrate hast, dann triffst Du immer seltener auf die Kameraden. \n\nZur Smurfthematik. Erstens bist Du selber einer, weil Dein Main ja gebannt wurde. Aber verrat mir doch mal bitte, an was Du bei einem Spieler erkennen willst, dass er smurft. Auch zu dem Thema Smurfs gibt es hier im Forum jede Menge Threads die sich damit beschäftigen. Noch mehr Lesestoff für Dich.{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Ehren Teemo","date":"2016-11-16T11:16:28.886+0000","up_votes":2,"down_votes":0,"body":"Kann deinen Gedanken gang verstehen \nAber nein einfach nein","replies":[]},{"poster":"Haudruppmoor","date":"2016-11-16T09:54:59.049+0000","up_votes":2,"down_votes":0,"body":"Wollt grad schreiben, da hat mir der [@Abasin](http://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/ElMX0hgd-immer-gegen-bots-als-anfaanger-neuer-account?comment=0000) schon das Wort aus dem Mund genommen ;)  \n\nAber ich hätts jetzt nicht wirklich auf die Reihe gekriegt, weil einmal gehts Dir um Bots, dann um Smurfs aber die Umfrage wegen der Art des Bans ... wtf\n\n1. Bots, wie schon gepostet, wenn Du ein paar Spiele spielst, liegst Du mit Deiner Elo drüber und Du wirst nicht mehr mit denen gematcht\n2. Smurfs, naja, bist strenggenommen selber einer ^^ - auch hier ein paar Spiele und das MMR passt sich an\n3. Chat statt Perma : neeeeee\n\n\n\np.s.:\nBonbons sind net gut für die Zähne, nimm lieber zuckerfreien Kaugummi ;)\n\np.p.s:\nWelcome back !\n\nmfg\nMB\n","replies":[{"poster":"Abasin","date":"2016-11-16T10:56:46.602+0000","up_votes":2,"down_votes":0,"body":"Tut mir echt leid, dass ich Dir zuvorgekommen bin. Nächstes Mal warte ich auf Deinen Beitrag. Versprochen. Ehrlich. {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Haudruppmoor","date":"2016-11-16T14:48:36.034+0000","up_votes":1,"down_votes":0,"body":"xdxd ...\n\njaaa, jenau, inne Zukunft mal mehr Rücksichtnahme uffn alten Sack wie mich ,weil bei mir dauerts halt nen Tacken länger, weil bei mir noch alles mechanisch funktioniert ;) ich glaub ich muß mich ma wieder ölen ...\n\n... verdammt, wo sind meine Tabletten ...\n\nmfg\nMB","replies":[]}]}]}]}