{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2015-08-19T14:57:21.709+0000","title":"2015 World Championship Format","subforum":"Esports","up_votes":2,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Zéñ","date":"2015-08-19T15:28:33.320+0000","up_votes":4,"down_votes":5,"body":"***","replies":[{"poster":"0neSh0tGG","date":"2015-08-19T15:56:01.064+0000","up_votes":27,"down_votes":2,"body":"If you haven't watched any games lately, EDG got stomped by LGD 3:0 and IG 3 1 which put them in 4. place in LPL summer. This means that their chances at worlds went from almost certain to 50/50. They might not even make it to worlds and you are putting them in the finals?","replies":[{"poster":"Crimsonize","date":"2015-08-19T20:17:43.716+0000","up_votes":2,"down_votes":8,"body":"Who said theyre in the finals? They are no where here...","replies":[{"poster":"Fenix9","date":"2015-08-19T20:48:02.510+0000","up_votes":8,"down_votes":0,"body":"he/she replied to a deleted comment about edg","replies":[]}]}]},{"poster":"Nakunbra","date":"2015-08-19T15:42:47.876+0000","up_votes":6,"down_votes":1,"body":"Maybe you forgot that EDG had lost.","replies":[{"poster":"GroovyRoom","date":"2015-08-19T15:51:23.396+0000","up_votes":1,"down_votes":0,"body":"they can still reach world doe","replies":[{"poster":"KalashiChris","date":"2015-08-19T17:12:56.531+0000","up_votes":4,"down_votes":0,"body":"They can, but LPL format is not like lcs/lck. The winner of playoff don't get a seed for world. The first in champ. points get the 1st seed (so LGD), and the 2 other seed are decided with regionals. So EDG Need to be in final of regionals to go to world.","replies":[]}]}]}]},{"poster":"irobarmstrong","date":"2015-08-19T15:32:01.684+0000","up_votes":1,"down_votes":20,"body":"I think they should make the draw live, like they do in other sporting events. Maybe follow the draw with some Casters vs Death bots just to fill the esports void between LCS and Worlds.","replies":[{"poster":"werderman197","date":"2015-08-19T15:52:05.100+0000","up_votes":20,"down_votes":0,"body":"Did you read the article? \r\n> Heading into planning for 2015 Worlds, we’ve made a couple of improvements to the overall structure of the tournament. To promote transparency around how teams are selected into groups, we’ll be hosting a live Group Draw Show.","replies":[]},{"poster":"ImTheProof","date":"2015-08-19T15:51:23.647+0000","up_votes":11,"down_votes":0,"body":"\"To promote transparency around how teams are selected into groups, we’ll be hosting a live Group Draw Show.\"\r\n\r\nread the article brah","replies":[]}]},{"poster":"Sontax","date":"2015-08-19T15:47:04.442+0000","up_votes":4,"down_votes":27,"body":"Pool 1 contains: NA:TSM <333\r\n                               EU:Fnatic\r\n                               CN:Edward Gaming\r\n                               KR:SKT T1\r\nwhat do you think,which team is the best,mine s TSM :)","replies":[{"poster":"Nakunbra","date":"2015-08-19T16:00:03.117+0000","up_votes":2,"down_votes":19,"body":"Well TSM got explosed by FNC at MSI.\r\nMaybe TSM are the worst team there for Worlds... Now is SKT>FNC>LGD(Maybe EDG)>TSM for pool 1...\r\nIf we see further then TSM will not appeared...\r\nIn fact there are so many teams that can beat them : 1st and 2sd from EU, KR, CN. And in fact 2sd from NA...\r\nthe bracket was so explosive in NA, GV lost, TL lost, CLG atomised IMP, the final will be something !!","replies":[{"poster":"CuriousChameleon","date":"2015-08-19T16:24:58.771+0000","up_votes":13,"down_votes":5,"body":"so you really think FNC > #1 team in china? \r\nthats a hilarious thing to assume imo","replies":[{"poster":"Acehaseo","date":"2015-08-19T19:14:13.701+0000","up_votes":15,"down_votes":2,"body":"Not far. LGD, FNC and SKT T1. I think we can put them to same line. FNC played great games against SKT and now they are much improved and have better ADC.","replies":[{"poster":"Landrein","date":"2015-08-26T22:02:47.627+0000","up_votes":4,"down_votes":0,"body":"European servers guys are a little weird guys.  Last year, when the EU teams weren't even able to make it out of group stages, the EU server guys were predicting that all all teams would make it even declared the American teams couldn't beat any of the EU teams.\r\n\r\nNow, they are predicting EU>/=both Korea and China based entirely on the fact that other EU teams couldn't match them.  Strangely, their losses against origin last weekend make me think more highly of fanatic.  At least now they have been tested.\r\n\r\nBecause I'm not quite as biased as others,  I expect that Fanatic will do well. I will be surprised myself if Fanatic doesn't at least make it to the semi finals.  However, there is no reason at all to declare fanatic better than the best Korean and Chinese teams when EU (and NA for that matter)have never been able to contest those regions before.","replies":[]},{"poster":"Blind Minion","date":"2015-08-20T00:30:33.161+0000","up_votes":7,"down_votes":4,"body":"I would be surprised if FNC didn't make top 4, and expect them to make a real run for the cup. I will not be sad, however, if it's FNC and SKT in the finals. No matter the outcome.\r\n\r\nAs a player in NA I just hope we don't lose to the wild cards...","replies":[]},{"poster":"WubbaDubbaLubLub","date":"2015-08-25T17:47:29.162+0000","up_votes":2,"down_votes":0,"body":"#KABUM","replies":[]}]}]}]},{"poster":"0neSh0tGG","date":"2015-08-19T15:58:38.850+0000","up_votes":5,"down_votes":0,"body":"EDG isn't the first seed from LPL, LGD is. SKT,TSM and FNC haven't even won their regions so they might not even be in the first pool too.","replies":[{"poster":"s1mm3rYO","date":"2015-08-19T16:30:22.035+0000","up_votes":1,"down_votes":8,"body":"Fnc is the first seed from Europe they have won the Spring Split against UoL and are in the Finals against Origen who played for the first Split :) ","replies":[{"poster":"Krakdantagol","date":"2015-08-19T16:35:18.270+0000","up_votes":9,"down_votes":0,"body":"They are not ensured to be 1st seed: if they lose the final against Origen, Origen will be 1st seed and Fnatic 2nd seed.","replies":[{"poster":"Krakdantagol","date":"2015-08-19T17:09:27.275+0000","up_votes":4,"down_votes":0,"body":"@Cpt s1mm3rYO: as I said, the 1st seed goes to the summer split winner, so if Origen beats Fnatic in final, Origen is the 1st seed. Most points gives second seed.\r\n\r\nThis is the same for EU LCS, NA LCS and LCK. Only LPL awards the 1st seed to the team with most points (LGD), with 2nd and 3rd being given after a regional qualifier.\r\n\r\nP.S. had to reply to myself as this crap comment software is limited in reply levels :/","replies":[]}]},{"poster":"Nik omek21","date":"2015-08-19T18:12:43.543+0000","up_votes":6,"down_votes":0,"body":"Its really not that hard to use your brains. Summer split winner is 1st seed, most CP points is 2nd seed and 3rd seed goes to the winner of the gauntlet.","replies":[]},{"poster":"FR33D0MVN","date":"2015-08-19T16:58:49.050+0000","up_votes":5,"down_votes":0,"body":"idiot, any team win final will be 1st seed,  CP only matter for the rest.","replies":[]}]}]},{"poster":"CuriousChameleon","date":"2015-08-19T15:52:50.415+0000","up_votes":12,"down_votes":5,"body":"First: None of the pool 1 teams are set yet\r\n\r\nSecond: TSM is not the best\r\nnot even close\r\nnot in any dimension you live in\r\n","replies":[{"poster":"Krakdantagol","date":"2015-08-19T16:37:21.095+0000","up_votes":6,"down_votes":0,"body":"Actually, LPL 1st seed is already known: LGD. LPL 1st seed is the team with the most points, and it will be LGD even if they lose the final. 2nd and 3rd seed come from a regional gauntlet.\r\n\r\nBut indeed, LCK, EU LCS and NA LCS 1st seed are yet to be known as all three of them depend on the results of the playoff finals.","replies":[]},{"poster":"sKz Aaron D","date":"2015-08-20T14:05:52.082+0000","up_votes":4,"down_votes":1,"body":"I don't think it was necessary to point that out. Nobody believes they're the best in the world. Though **historically**, they're one of the most consistent teams in the world and are certainly the best performing team in NA LCS. Also the only team to go to every worlds if I'm not mistaken.\r\n","replies":[{"poster":"DarkKillerRS","date":"2015-08-21T18:48:10.767+0000","up_votes":1,"down_votes":2,"body":"Nope, FNC went on every Worlds as well. Not sure, if there is more that did.","replies":[{"poster":"Amagda","date":"2015-08-22T12:14:48.487+0000","up_votes":4,"down_votes":0,"body":"As a long time Fnatic supporter, i wish i could agree with you.  Fnatic got knocked to 4th at regionals by M5 and CLG EU in season 2, failing to qualify for worlds.  ","replies":[]}]}]},{"poster":"Rimshlivigan","date":"2015-08-19T16:12:44.060+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"seredhras","date":"2015-08-19T16:29:46.302+0000","up_votes":2,"down_votes":0,"body":"Actually only the LPL is running their first seed off of circuit points. The LCK and LCS both award no points to the first place finisher of the Summer Playoffs and instead that team auto-qualifies as the first seed to worlds. Circuit points are adjusted such that each position in summer is the same as the one above in spring (ie. #2 Summer = 90pts = #1 Spring). The team with the most combined circuit points is the second seed and the third seed is the winner of the gauntlet (which is seeded based on total circuit points). LPL runs their gauntlet differently as a double elimination bracket and the top two teams qualify as second and third seed.","replies":[]}]}]},{"poster":"GroovyRoom","date":"2015-08-19T15:50:53.865+0000","up_votes":11,"down_votes":0,"body":"EDG lost to LGD in semifinals. EDG will not be in the 1. pool","replies":[]}]},{"poster":"Chemtrail","date":"2015-08-19T15:18:10.050+0000","up_votes":1,"down_votes":21,"body":"> We also weren’t completely satisfied with the way teams were seeded into the Knockout Stage from the Group Stage, with teams potentially being incentivized to not win a group in order to draw a perceived better matchup in the knockout round. As such, we’ll be introducing randomization elements on which 1st place group finishers face-off against 2nd place group finishers in the Quarterfinals.\r\n\r\nI agree that it was a problem, but this is possibly the worst \"solution\" you can think of. Last year a team gave up 1st place, so as 2nd they can get the team they prefer to play against. This year, BOTH team (1st and 2nd) will lean back, because they'll have a 50% chance anyway to play against one of the teams from the other group. So there's no point wasting energy.\r\n\r\ntl;dr last year a team underperformed because of a tactic, this year EVERY group's 1st and 2nd team will underperform because why waste resources, there's no point in winning the group. This is a terrible idea.","replies":[{"poster":"RoIsux","date":"2015-08-19T15:27:45.594+0000","up_votes":9,"down_votes":0,"body":"What? This is a great solution to it. This teams want to get first in their groups in order to play the teams that placed and are, theoretically, either worse or under performing teams. Their is absolutely no reason to not try to get first place in a group now. Also I have no idea where you got the 50% from or what you're even talking about????","replies":[{"poster":"Chemtrail","date":"2015-08-19T18:39:54.031+0000","up_votes":3,"down_votes":9,"body":"There are 4 teams in one group. Every group's 1st and 2nd place will go to the Knockout stage. Let's stick to Group A's view. Group A's 1st place will play with Group B, C or D's 2nd place and Group A's 2nd place will play with Group B, C or D's 1st place. As a Group A 1st, let's say, you won't know which group your opponent will be from. It pretty much doesn't matter if you finish 1st or 2nd in your group, because 1) you'll get to the Knockout stage anyway, 2) you'll get a randomized opponent. The chance isn't 50%, it's 33%, I went full retard there, sorry. But still, it's totally randomized. There's no need to go with full throttle for the 1st place, because there's no guarantee that being 1st will result in a \"more optimal\" opponent. Also, the first group's teams finishing their matches first will have no idea who's 1st and 2nd in other groups, because there are still game(s) left there. They can't say \"Hey, let's win this group, this way we'll have to play against Group C's 2nd, which is easier.\" No guarantee that they won't get SKT or EDG as opponent.\r\n\r\nMaybe I'm not seeing the point of this system, maybe I'm just unable to describe my problem properly (damn you, language barrier), but I don't think this is a good solution.","replies":[{"poster":"ndfan737","date":"2015-08-19T19:32:24.386+0000","up_votes":9,"down_votes":0,"body":"It's not random who is coming out of the groups. The best teams like SKT are most likely going to win their group, therefore you want to win so you don't have to play them in the first round.","replies":[]},{"poster":"Crimsonize","date":"2015-08-19T20:27:54.164+0000","up_votes":7,"down_votes":0,"body":"No, if you're a team you'd much rather get first in the group because the chances are that you'll play teams such as origen or yoe rather than if you got second you'd have to play SKT in the first round.  If you go for first place, you will probably have a much easier time making it to the semifinals. ","replies":[]}]}]}]},{"poster":"l PRIDE l","date":"2015-08-19T18:34:42.410+0000","up_votes":4,"down_votes":10,"body":"why doesn't final say FNATIC yet?\n(the comments are so jokes rn){{champion:17}} ","replies":[{"poster":"C9 Nepugia","date":"2015-08-19T18:38:44.154+0000","up_votes":2,"down_votes":11,"body":"asian fanboys think skt has a chance xD","replies":[{"poster":"Diode","date":"2015-08-19T18:50:45.275+0000","up_votes":13,"down_votes":2,"body":"5 Koreans > 2 Koreans","replies":[]},{"poster":"Calavera","date":"2015-08-20T01:46:23.019+0000","up_votes":4,"down_votes":4,"body":"eu fanboys think fnatic stands a chance tho that's hilarious.","replies":[{"poster":"Tobbydehuiself ","date":"2015-08-20T10:09:42.873+0000","up_votes":6,"down_votes":3,"body":"at least fnatic is seen as an good team not like any team from NA","replies":[]}]}]}]},{"poster":"ReadyForFreddie","date":"2015-08-19T17:20:21.837+0000","up_votes":6,"down_votes":3,"body":"IMO i think its quite sad to see LMS no1 team not get into pool 1. They have shown more dominance than EU and NA on a few occasions. For this year i believe AHQ deserves a pool 1 slot over NA.\r\n\r\natm my top teams with a chance: SKT1> LGD > KT > EDG> FNC > AHQ \r\n(QG and Koo are way too inconsistent for me to put in this list, and i put in EDG despite their recent downfall, as i would be surprised if they wouldn't resurge with their consistent dominance until put on tilt from LGD)","replies":[{"poster":"Cheryl Cole","date":"2015-08-19T20:52:41.943+0000","up_votes":6,"down_votes":1,"body":"Yeah i was thinking about the same. AHQ is better then any NA team, but with so much worse starting conditions.","replies":[]},{"poster":"C9 Nepugia","date":"2015-08-19T18:41:00.942+0000","up_votes":2,"down_votes":1,"body":"basically tw has placed higher only at msi, i think iem/s4 worlds are the reasons why riot gave nr1 seed to NA, since you can't really judge how strong is a team after one tournament","replies":[{"poster":"Godkoz","date":"2015-08-19T19:06:17.785+0000","up_votes":4,"down_votes":1,"body":"Didn't ahq tie EDG after being put in a group with both them and SSW in S4 worlds? I'd say the reason they didn't make it to the bracket was because of this pool system kinda throwing Taiwan under the bus.","replies":[{"poster":"ReadyForFreddie","date":"2015-08-19T19:23:07.291+0000","up_votes":2,"down_votes":1,"body":"Exactly this ^\r\nHow can they prove themselves as a region when this happens. Getting a tiebreaker with EDG in the SSW EDG group is far more impressive than what EU or NA did in S4 worlds. Tw has placed higher at iem before as well :P\r\nI hope Ahq get put in whichever group the NA no1 seed gets placed in to prove me right. :)","replies":[{"poster":"Lena Slayer","date":"2015-08-19T21:23:35.864+0000","up_votes":5,"down_votes":1,"body":"If pass achievment was use to determine which region get seeded into the pool 1 slot, then imo Taiwan did well enough to reach that spot more so then NA.\r\n\r\nTaiwan did took S2 World by storm on that miracle run.\r\nThey prove their worth in the group of death  in S4 World.\r\nThey rekt EU at IEM 2015\r\nThey seal the final nail on NA coffin at MSI 2015\r\n\r\nim a NA player and love NA but imo, those 4 #1 pool slot should be earned, and not give. \r\nIMO when teh regions participate in international turnament such as IEM and MSI, they should earn World pts toward their region base on what place they place at that turnament. that way come World, the 4 stronger region that lock in teh most point will earned that pool 1 slot and reward with 3 spots for their region at World.\r\n\r\nsince riot dotn want peeps to throw game during group stage, the current method will make it worst, once a team already lock into the knock out stage, since their oppn is random and which side of teh bracket they are on is also random, teams will hold back even more due to the massive unknow factor of the next stage to hid their strategy.\r\n\r\nsince the group stage is broken off like last world as well, using the point system, each team that get the number 1 spot form their group stage should be award with World point for their region toward next years world to determine the number 1 pool and the region that get 3 world spots. Since teh group stage is also like a mini turnament each on a different part of the world, 1st place team should also win reward with price cash, not on par with world but enough like 25K USD for each 1st place team. total cash price for world already 2M USD+ already another 100K to group stage will will drastically motivate each team to take 1st place and make for more competitive play even at group stage.\r\n","replies":[]}]},{"poster":"Ranzbart","date":"2015-08-19T19:21:32.447+0000","up_votes":2,"down_votes":0,"body":"you cant compare S4 EDG with S5 EDG\r\nold samsungs teams were completely imported to china and EDG rose because of these imports.","replies":[]}]}]}]},{"poster":"Twente Wood","date":"2015-08-19T19:59:51.858+0000","up_votes":2,"down_votes":2,"body":"NA expect group stage exit. LOL.","replies":[{"poster":"Cheryl Cole","date":"2015-08-19T20:50:54.904+0000","up_votes":4,"down_votes":0,"body":"Well they can still get group like TSM last year + some bans to make it even easier.","replies":[]}]}]}