{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-08-04T00:45:05.346+0000","title":"Behavior, bugs, and more in Ask Riot","subforum":"Announcements","up_votes":3,"down_votes":1,"body":"[ÜRES]","replies":[{"poster":"Singularitea","date":"2016-08-04T23:50:04.832+0000","up_votes":40,"down_votes":0,"body":"If and when doom bots arrive, can that illaoi bug be a thing?","replies":[{"poster":"Sargonas","date":"2016-08-05T01:50:34.226+0000","up_votes":54,"down_votes":0,"body":"Thanks for the idea.... mwahahahahahahahahah","replies":[{"poster":"TTVBronzeKneecap","date":"2016-08-05T01:57:27.511+0000","up_votes":11,"down_votes":2,"body":"Illaoi bug? Isn't that how she normally is","replies":[]},{"poster":"Lionheart Lulu","date":"2016-08-05T05:14:30.802+0000","up_votes":5,"down_votes":0,"body":"Oh god.\r\n\r\nI can only imagine now.","replies":[]},{"poster":"I Am Luxanna","date":"2016-08-05T20:31:35.765+0000","up_votes":2,"down_votes":0,"body":"Illaoi ult spawns 5 tentacles base +3 per champ ;)","replies":[]}]},{"poster":"jjbinks99","date":"2016-08-06T00:49:25.990+0000","up_votes":3,"down_votes":0,"body":"Speaking of bots, @riot, why are only certain champions available in coop vs AI games, and custom games that you put in AIs, will the list ever get more champions, would we ever get to see a permanent \"hard mode\" for bots to fine tune your skills even more, say they get extra stats so you have to outsmart them instead of go all out and still out play them?","replies":[]}]},{"poster":"Auratic Sky","date":"2016-08-05T03:54:39.550+0000","up_votes":29,"down_votes":0,"body":"Hextech doesn't really reward good behavior in my eyes, though. It rewards S-ranks, that's how you get chests, and you can only get one chest per champ, per season. Encouraging people to try and play many champs, which also means champs they play worse than their mains. I could play Tristana every game, all season and get tons of S-ranks, never once be a good sportsman (I mean not be an asshole either but I could do not one single sportsman like thing, I could be 100% mute every single game), and I'd get one chest for that for one S-rank with Tristana, that's it. I'd never get a single one based on my behavior. S'why the concept of the chests currently confuses me. \r\n\r\nSure, you can get locked OUT of the chests if you get reported enough, but you don't get chests for NOT getting reported, either. You get them based purely on the illusion of skill. Sure, S-ranks require skill, no question but sometimes, the guy who died the most times, at those critical moments, (sacrificed himself for the team at the right moments all game long), and was the friendliest player ever, is the reason we won. Will he get an S-rank for the game? No. Will he get a chest for being an awesome player personality wise? No.\r\n\r\nSo I see that as a problem. I've gotten all the S-ranks I'm likely to get with champs this season, never once did that have anything to do with how I treated others, and I keep looking at that Hextech Annie skin shard and I know that no matter how good a person I try to be while playing, I will -never- get enough chests this season to get that skin without buying chests with RP. \r\n\r\nMy behavior will have nothing to do with it. Just how I feel / view Hextech currently. Entirely my opinion and nothing more.","replies":[{"poster":"Ohmei","date":"2016-08-05T05:57:42.045+0000","up_votes":4,"down_votes":0,"body":"And a very valid opinion it is.","replies":[]},{"poster":"MegaCharizardY72","date":"2016-08-06T12:39:48.366+0000","up_votes":2,"down_votes":0,"body":"Same here. There's no component of sportsmanship involved in getting chests. Meanwhile we're stuck with that number of chests, and can't do anything except a) until next season or b) get really lucky on a random champ and have a troll on the enemy team who feeds(tbh this is how I got most of my chests, luck's run out now). 1 chest per champion a season is simply too little. Maybe take a page out of the level 6 and 7 mastery shard system, where S- gets you one, S gets you a second, and S+ gets you a third on that champion. Would certainly be an improvement from the current system. Oh and this is all opinion btw.  ","replies":[]},{"poster":"Vongola VI","date":"2016-08-08T23:54:04.470+0000","up_votes":1,"down_votes":0,"body":"I agree if anything it promotes selfish players playing only for their \"KDA\" so they can get their chests\r\nalso I have 7 chest no keys send help ;_;","replies":[]},{"poster":"DISCAustinPowers","date":"2016-08-08T15:32:37.678+0000","up_votes":1,"down_votes":0,"body":"Do you really only get one chest per champion a season? I have recieved atleast 4 chests from one champion... super weird. All in all valid point as well as the fact that I purely see the chests as a way to get people to spend more money thinking it would cost less than to just buy a champion(with ip/rp)/skin out right.","replies":[]}]},{"poster":"Blue Moon Wolf","date":"2016-08-04T22:40:41.078+0000","up_votes":3,"down_votes":0,"body":"I know the idea of \"incentive for honoring players\" has been tossed around a bit on the boards (something small like a bonus 10 IP), but at the a lot of people believe that would take away from the point of honoring another player. has honoring incentives been looked at or is it pretty much agreed that doing that would be counterproductive?","replies":[{"poster":"Riot Chastise","date":"2016-08-04T23:40:43.622+0000","up_votes":7,"down_votes":1,"body":"Absolutely! We've been thinking about this a ton. We want to create systems to highlight sportsmanship and reward awesome players, but they need to avoid incentivising things like \"trading honors.\" (I remember trading them when the original system launched, everyone wanted a ribbon!). And I know I'd be spamming honors to all my friends if they got 10 IP every time :-P\r\nAt the same time, we want rewards to be way cooler than 10 IP. We want to strike a balance where getting honored feels really awesome and giving someone an honor is something you'd really only want to give to a player who deserved it (rather than just trading with your friends). Because of this, a revamped system will need a much bigger overhaul than just tweaking honor button options or adjusting the rewards you get - and part of the reason we're not talking specifics yet is because the new client is needed before that overhaul.","replies":[{"poster":"lightdragoon88","date":"2016-08-05T01:28:18.981+0000","up_votes":19,"down_votes":0,"body":"A free refund for honor players without a punish on their record for the year would probably get a lot of people to be more sportsman. ","replies":[{"poster":"StaircaseGone22","date":"2016-08-05T14:45:02.792+0000","up_votes":4,"down_votes":0,"body":"Yes. 3 refunds a lifetime ain't enough","replies":[]}]},{"poster":"Summonerrr 1","date":"2016-08-05T13:54:53.985+0000","up_votes":9,"down_votes":0,"body":"Have you guys thought about doing more to disincentivise unsportsmalike/toxic behavior? The mute function and reform cards/instant feedback is great and all, but bringing out the best in people is only half the fight, you also have to stamp out the worst for the spirit of competition to be truly realized.\r\n\r\nAlso, Tribunal's been down for mainteneance for 3 years and Riot's been disquietingly silent about it for the past two. Comment?","replies":[]},{"poster":"Navarune","date":"2016-08-05T16:16:41.593+0000","up_votes":5,"down_votes":0,"body":"I know there is already a lot of \"currency\" in League, but have you guys considered a type of Honor Coin system where perhaps I give away a token (from my pool) to another player? Then these tokens could be spent on Honor-exclusive items, such as banners or summoner icons. Players could be restricted to giving only so many tokens away per week. The beauty in this is that I am giving something away at a cost to myself, which gives it more meaning.\r\n\r\nI know that there would be a lot of iteration that would have to go into this, but just tossing an idea out there.","replies":[{"poster":"foxysquidy","date":"2016-08-07T11:54:33.368+0000","up_votes":1,"down_votes":0,"body":"I could see people making a bunch of alt accounts and rewarding their mains with the tokens.","replies":[{"poster":"Navarune","date":"2016-08-08T14:25:44.114+0000","up_votes":1,"down_votes":0,"body":"You should/would only be able to give tokens to people you play with.\n\nIn other words, you would only be able to achieve what you're saying if you played at least two accounts at the same time on two separate machines. I'm not saying it can't happen, I'm just saying it would be a massive hassle to pull it off. \n\nI could also see restricting this system to ranked only, so then you eliminate the possibility of any sub-30 accounts abusing it at all.","replies":[]}]}]},{"poster":"Draclen","date":"2016-08-06T13:05:28.058+0000","up_votes":4,"down_votes":0,"body":"Maybe you could in some way tie it into Hextech crafting, like getting an honor gives you 5 or 10 essence.   ","replies":[]},{"poster":"RisenDarkKnight","date":"2016-08-05T05:18:20.076+0000","up_votes":1,"down_votes":0,"body":"What about giving a reward for honoring, but only allowing players to honor 1 person on each team per game (and not their premades).  That way they still have to make a decision about who to honor, and can't just honor everyone, but they are incentivised to participate in the system.","replies":[{"poster":"DuskDaUmbreon","date":"2016-08-06T14:35:11.959+0000","up_votes":3,"down_votes":0,"body":"But there are times that _everyone_ on your team is equally worthy of honors.","replies":[]}]},{"poster":"zergman","date":"2016-08-05T02:19:40.668+0000","up_votes":2,"down_votes":0,"body":"Add 1 additional refund to everyone's account that goes a season without getting any punishment...","replies":[]},{"poster":"Psychopath369","date":"2016-08-05T01:23:26.367+0000","up_votes":2,"down_votes":0,"body":"you could do something like friends can only honor another friend once every week or something along those lines to try to get rid of trading honors","replies":[]},{"poster":"woodvsmurph","date":"2016-08-08T19:32:46.204+0000","up_votes":1,"down_votes":0,"body":"I agree with you. Too many people would just agree to trade honor with someone or even honor a person who threw the game if they were on the other team. I still use the honor system the way I always have -- if there is an opponent or teammate who performed exceptionally well and went above and beyond their 'duty' for their role, I honor them. If there is someone who got focused hard and picked on -- having a bad laning -- but never gave up and comes back to be very helpful to their team, i honor them. I don't tell them I'm doing it because I don't want them to return the favor just because. I do it knowing I'm not going to get it in reply even if I deserve it most because it might make them that much more sportsmanlike in their next match and maybe they pay it forward.","replies":[]}]}]},{"poster":"gaminggary","date":"2016-08-05T16:51:10.423+0000","up_votes":14,"down_votes":0,"body":"Will there wars? In League's lore, the reason the League was created was to make a safe alternative to normal war. However, there have no wars since the Noxian invasion of Ionia. I personally think that, like the new rotating game queue, the different city-states should sometimes battle. Take Noxus and Demacia, as in their lore they are continuously warring... but us summoners have ben left out of it, for some reason. Big disconnect from lore and gameplay there.\r\n\r\nI'm just going to throw some ideas at you guys and see what sticks. I personally think that you should make it that all champions except the champions affiliated with the other faction or champions with tiffs against the faction you're fighting for would be available for you, and vice-versa.\r\n\r\n Example: Demacia v. Noxus. Noxus couldn't pick {{champion:86}}  to fight for them, and Demacia couldn't pick {{champion:55}}  to fight for them, either. However, Noxus couldn't pick {{champion:163}} to fight for them, since she got mad at them for trying to use her as a weapon.\r\n\r\nJust a few ideas, I thought you guys might like them.","replies":[{"poster":"Antwriterkid","date":"2016-08-06T01:27:58.979+0000","up_votes":1,"down_votes":0,"body":"This needs to happen ASAP","replies":[{"poster":"Miniman6565","date":"2016-08-07T01:05:00.542+0000","up_votes":3,"down_votes":0,"body":"Google League Factions and take a look at it.  It's exactly what you're looking for.","replies":[{"poster":"gaminggary","date":"2016-08-08T01:57:51.926+0000","up_votes":2,"down_votes":0,"body":"I never knew this was a thing! But yes, this is exactly what I am thinking of. Not sure if it would be copyright infringement if Rito made wars.{{sticker:zombie-nunu-bummed}}","replies":[]}]}]},{"poster":"dude its dandy","date":"2016-08-05T18:34:59.617+0000","up_votes":2,"down_votes":0,"body":"This is something that I'd love to see happen, purely because of the fact that I am a huge lore junkie. This is a great idea, try to get it more attention!","replies":[]}]},{"poster":"Enlegacy","date":"2016-08-04T21:34:32.148+0000","up_votes":14,"down_votes":0,"body":"Regarding the Illaoi bug.\r\n\r\n(Clears throat)\r\n\r\nHAHAHAHAHAHAHAAAAA!","replies":[]},{"poster":"Civility","date":"2016-08-05T01:48:20.277+0000","up_votes":11,"down_votes":0,"body":"Regarding \"bad sports\" or abusive players: Physical sports have referees that enforce certain conduct, but in LoL, abusive players have nothing to keep them in check.  There is no referee other than a partial language blocker, and bad behavior is encouraged by other players as often as it is rejected.  Furthermore, abusive players rarely go unpunished, and when they are we never know about it directly.  It lends to a great sense of injustice; this, in turn, can frustrate some players to the point that they begin to respond in kind to the abusive ones because they feel like they have no other recourse.  I was enthusiastic about the Tribunal initially and I participated in it, but these days I don't really feel like Riot actually cares about player behavior.  I keep reporting the players who merit it, but I feel like the whole reporting system does almost no good.  Rewarding good behavior is great, but it's not enough if rude people are free to abuse others with impunity.  Reporting also seems particularly useless if the offender happens to be with friends or others who support their abusive behavior instead of reporting it.\r\n\r\nRelated note: I wish the chat window would notify people when they're muted by someone else so that they would get the immediate feedback.  (Or maybe it could notify everyone, with some sort of mechanism to prevent spam, but that would be harder to manage.)\r\n\r\nI know that my own behavior got worse at some point after being so frustrated with abusive players and trolls, and I've had to mentally check myself.  During my worst moments, I realized that Riot wasn't going to punish me, and then I knew how most abusive players must feel.\r\n\r\nI really just want to feel like Riot actually cares about the problem and is doing something about it, but I don't.  Maybe they're more afraid of losing a portion of their player base than insisting on good sportsmanship.","replies":[{"poster":"DeathBurst","date":"2016-08-05T14:07:08.484+0000","up_votes":6,"down_votes":0,"body":"> Reporting also seems particularly useless if the offender happens to be with friends or others who support their abusive behavior instead of reporting it.\n\nNo, no, no! And you spreading this misinformation is part of the problem you complain about, part of this feeling of frustration you mention.\n\nA single report in a game flags the game for review. Enough reports against a player, over the course of multiple games, trigger the actual review process, in which every game with even a single report will be examined.\n\nReports are NOT useless. Do report the unsportsmanlike players, because it really has consequences. I do it, and I regularly receive pop-up saying someone I reported is punished.\n\n> Related note: I wish the chat window would notify people when they're muted by someone else so that they would get the immediate feedback. (Or maybe it could notify everyone, with some sort of mechanism to prevent spam, but that would be harder to manage.)\n\nI like this idea.","replies":[{"poster":"Pyr0mrcow","date":"2016-08-06T02:55:25.598+0000","up_votes":3,"down_votes":0,"body":"I've been playing since S2, and I think I've seen that message twice.\r\nOf course people should do reports anyway, but...there's a reason for the amount of people that see it as being a futile effort.","replies":[]},{"poster":"Civility","date":"2016-08-05T20:45:10.980+0000","up_votes":2,"down_votes":0,"body":"I said reporting *seems* useless.  I do continue to report abusers, but it's so rare that I get any feedback saying that Riot has actually handled a problem.  The first time I got such a message, I liked it, but then it was so rare...in any event, when we see so little of anything being done to correct bad behavior, it's hard to believe that much is being done.","replies":[]}]},{"poster":"AMYS GRAVE","date":"2016-08-05T02:29:05.388+0000","up_votes":2,"down_votes":0,"body":"This ^ ","replies":[]}]},{"poster":"Sckullzz","date":"2016-08-05T04:58:23.961+0000","up_votes":9,"down_votes":0,"body":"Funniest bug I've seen:\r\n\r\nI was Lee Sin, and the enemy Tristana and I were duking it out. We both ulted each other and I went FLYING... All the way from their blue buff, back to MY OWN BLUE BUFF... all 10 players took a 5 minute break just to laugh our asses off and comment about the glory we just witnessed.","replies":[]},{"poster":"StellarInferno","date":"2016-08-04T20:52:32.202+0000","up_votes":7,"down_votes":1,"body":"Swain top is easier to counter when you're playing Soraka. \"No one expects the banana!\"{{champion:16}} ","replies":[{"poster":"Just Bunter","date":"2016-08-06T16:45:35.145+0000","up_votes":2,"down_votes":0,"body":"The unseen banana is the deadliest.{{champion:64}} ","replies":[]}]},{"poster":"Shadow Adanza","date":"2016-08-06T08:31:21.825+0000","up_votes":3,"down_votes":0,"body":"Can there be an option where we can choose to avoid players? I mean, if they're just not fun to play with but you don't want to report them/block them. I feel those methods are a little too extreme for a simple \"I don't like playing with this person, it doesn't create an enjoyable experience for me\" and we should have an 'avoid this player' option that reduces our chances of playing with them severely, but at the same time won't block them or be a report against their account.","replies":[]},{"poster":"Chieften Scar","date":"2016-08-05T08:08:25.898+0000","up_votes":1,"down_votes":1,"body":"I recently realized that there is no assassin support, any thoughts on this?","replies":[{"poster":"JCOmega","date":"2016-08-06T03:18:23.023+0000","up_votes":3,"down_votes":0,"body":"Supports are usually there to keep the adc alive and farming, rather than to get kills on the enemy adc(excluding the mage \"supports\"). Assassins are there to burst down squishy enemies and earn gold","replies":[{"poster":"Chieften Scar","date":"2016-09-01T00:44:18.534+0000","up_votes":1,"down_votes":0,"body":"Ok but check this out, what if it can't make the last hit, but can seriously damage them before a certain amount of health","replies":[]}]}]},{"poster":"black hater","date":"2016-08-04T22:54:21.749+0000","up_votes":3,"down_votes":0,"body":"How often will basic logic take you if you wish to improve. Sometimes you make dumb mistakes trying to be logical, for instance I brought Nasus with exhaust and forgot that killing isn't nearly as important as farming...\r\nAlso, things that have still made sense don't seem to be seeing a a lot of use, like when it's Ryze top, Sejuani Jungle, Lux Mid, Morgana support, I think, \"Hey, Cleanse sounds really good rn,\" but apparently not. I get scolded...","replies":[]},{"poster":"theEnguneer","date":"2016-08-04T21:24:07.243+0000","up_votes":3,"down_votes":0,"body":"Illaoi OP.","replies":[]},{"poster":"superkser1998","date":"2016-08-06T03:29:09.903+0000","up_votes":2,"down_votes":0,"body":"You could add an honor system similar to what happens at the end of every Overwatch game. At the end of the game each player votes for who they think deserves an honor and whoever gets the most votes gets a reward. Premades wouldn't get to vote for each other and players would also have the option not to vote if they didn't feel that anyone deserved it.","replies":[]},{"poster":"WatchDogs Legion","date":"2016-08-05T23:00:52.395+0000","up_votes":2,"down_votes":0,"body":"Its not hard as hell to get good at this game. Its hard as hell to get que with Team mates who know what there doing. Most of my game I do well consistently but I also get bad Team mates constantly. ","replies":[{"poster":"gunslinger20121","date":"2016-08-08T04:27:01.358+0000","up_votes":1,"down_votes":0,"body":"Ok when you are doing well, what are you doing? Are you staying in lane to continue beating up your poor hapeless lane opponent :P or are you roaming and helping other lanes out?","replies":[]}]},{"poster":"Wert the Wacky","date":"2016-08-05T01:31:59.821+0000","up_votes":2,"down_votes":0,"body":"Why no Poro champion?{{summoner:31}} {{summoner:30}} ","replies":[]},{"poster":"DREADN0UGHT","date":"2016-08-05T00:02:10.881+0000","up_votes":2,"down_votes":0,"body":"Dem tentacles doe","replies":[]}]}