{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-05-25T17:57:37.376+0000","title":"Let’s talk Smurfs, Snow, and Bans in Ask Riot","subforum":"Announcements","up_votes":4,"down_votes":9,"body":"[ÜRES]","replies":[{"poster":"Vekkna","date":"2016-05-26T21:15:17.649+0000","up_votes":122,"down_votes":10,"body":"I wonder if they have considered blind bans. Before champ select, everyone locks in their ban at the same time, and all the bans are revealed simultaneously at the end of the phase. \r\n\r\nThat way, everybody gets to ban whatever they dislike the most, regardless of whether bans overlap. You also cut down champ select lobby time by like 2 minutes.","replies":[{"poster":"Kobold","date":"2016-05-26T22:06:27.325+0000","up_votes":21,"down_votes":0,"body":"this is an interesting Idea though the lack of a full set of bans might hurt","replies":[{"poster":"Vekkna","date":"2016-05-26T22:18:11.121+0000","up_votes":39,"down_votes":5,"body":"Well, the idea is that you would nearly always have at least 6 bans. The same champ would have to be banned 5 times or 5 separate champs all banned twice each to get below 6. The probability of that is extremely small.\n\nAnd even with cases like Zed now, you have the rock/paper/scissor game of choosing whether you ensure he's banned or roll the dice on the odds that one of the 9 other players will ban him and not take the same chance.\n\nIf Riot doesn't want the extra time and uncertainty of a 10-champ ban phase, blind bans would slightly increase the number of bans on average while also being several minutes faster. Odds are that one or two champs with very high ban rates would be double-banned, so it should average out somewhere around 8 bans per game.\n\nI think it might also be more climactic to watch in esports where the rock/paper/scissor mindgames would be dialed up to 11 and make for some pretty fun moments before the match even starts.","replies":[{"poster":"Kobold","date":"2016-05-27T00:01:41.771+0000","up_votes":4,"down_votes":4,"body":"What worries me more is this would bring us back to devaluing Spots 3-5 on a team if all are allowed to ban (I thought it was still just the three per team) which is why riot changed the ban system. What ways can we make the system still have value and not a depressing \"Im last pick\" mentality?","replies":[{"poster":"WheresMyDadBtw","date":"2016-05-27T00:27:16.292+0000","up_votes":35,"down_votes":1,"body":"Last pick is almost always better in every way even without getting to ban now that you cant get your role taken. You get to counterpick, choose the best champ for your comp, and get your role no matter what due to it choosing your role now. The first three should honestly get the bans since they are forced to usually blind pick their champions and potentially get countered. The only real upside to first picks is to grab perma-bans if they get through.","replies":[{"poster":"Kobold","date":"2016-05-27T01:29:31.296+0000","up_votes":7,"down_votes":3,"body":"This is very true but Giving the bans to the first three instead of the last 3 would bring back what riot didn't want to happen wherein the last 2 pick players could alt tab for 3 or so minutes and not interact at all.","replies":[]}]},{"poster":"Flying Eggplant","date":"2016-05-27T01:15:06.024+0000","up_votes":13,"down_votes":0,"body":"3-5 were undesirable before because it meant you were unlikely to get the role you wanted. Now that dynamic que lets you lock in the role you want before you enter lobby, 3-5 (even without the bans, which I think was a mistake on riot's part) are incredibly valuable because it gives you a better chance to counter pick your opponent. The difference between having to lock in a top lane first and a top lane last is staggering","replies":[]},{"poster":"Maximum Morde","date":"2016-05-27T00:21:07.098+0000","up_votes":13,"down_votes":0,"body":"You kidding? 3-5 are for counterpicking and not getting counter picked. That is worth a ton. Now that your role is set, first and second pick are pretty damn useless outside of possibly picking cancer.","replies":[]}]}]}]},{"poster":"Cremepie","date":"2016-05-26T22:06:11.747+0000","up_votes":4,"down_votes":2,"body":"SO by this method there could be a total of 10 bans, but in some cases just 5 because the opposite team banned the same 5 champions? Or in a really rare case of trolling 1 ban if all ten players selected the same champion? That would be fine with me. +1","replies":[{"poster":"Somot","date":"2016-05-26T23:10:11.837+0000","up_votes":13,"down_votes":1,"body":"I presume if implemented your teammates bans would be visible prior to locking them in, and you would be prevented from locking a ban that a teammate had locked prior to the reveal. This would prevent double-bans from within the same team at least.","replies":[]}]},{"poster":"LaytonApprentice","date":"2016-05-28T07:08:00.953+0000","up_votes":9,"down_votes":0,"body":"How I would organize a champ select:\r\nPhase 1 Position and Pick Intent (10-20 seconds)\r\n1. Allows players to load in\r\n2. Tells everyone their roles\r\n3. Allows Pick Intent\r\n4. Players can trade pick orders (enemies can't see this)\r\nPhase 2 Banning (~30 seconds)\r\n1. All players each get a ban like in blind pick. Bans for each team are revealed at the end.\r\n2. Still able to change pick intent after you choose a ban\r\n3. Players can still trade pick order\r\nPhase 3 Pick Order (~10s)\r\n1. Players can switch pick orders after seeing the bans\r\n2. Players can still change pick intent\r\nPhase 4 Picking (~10-15s each)\r\n1. Each team takes turns like normal draft when picking their champions. ( T1->T2->T2->T1->T1->T2->T2->T1->T1->T2)\r\n2. Can no longer switch pick ordering.\r\n3. Can switch pick intent until its your turn to pick.\r\nPhase 5 Preparation (~15s)\r\n1. Basically to allow people to finish rune/masteries/summoner selection.\r\n\r\nI would prefer being able to trade pick order over being allowed to trade champions. Not everyone owns the champions they want to trade. I also liked you idea of the blind banning phase since it takes less time and has some interesting stratedgy.","replies":[]}]},{"poster":"Large Minivan","date":"2016-05-26T21:11:11.434+0000","up_votes":36,"down_votes":0,"body":"yessssssssssssssss their thinking about having one ban per person yesssssssssssssssssss","replies":[]},{"poster":"Gegachxis","date":"2016-05-26T21:20:09.374+0000","up_votes":29,"down_votes":3,"body":"My thought on the smurf problem: why not make an option to team with a lower level player that announces itself to your teammates and opponents, like a badge in the loading screen. You can even scale the summoner spells to the lower player to prevent things like the god-scale jungler in a game of level 1 players. Use this like a mentor system. Can this be broken and abused? Sure. But it'll be easier for Riot's algorithms to find those accounts that are just grief-smurfing. This mentor system could also balance the game a bit. If your team has a mentor in it, the matching system could put a mentor on the opposing team.\r\n\r\nAnyone else have two cents to through into this thought?","replies":[{"poster":"ManiacalCoin","date":"2016-05-26T21:25:21.003+0000","up_votes":2,"down_votes":11,"body":"I really love this idea tbh, but have it set so that only people gold 4 and under can \"mentor\"","replies":[{"poster":"N3RAZIM PRA3TOR","date":"2016-05-26T22:29:47.860+0000","up_votes":13,"down_votes":0,"body":"then people above gold 4 are gonna end up smurfing, just saying.","replies":[{"poster":"Silverclaw","date":"2016-05-26T22:50:27.380+0000","up_votes":2,"down_votes":2,"body":"The other way to do this is to let a player queue up as a mentor, and get to spectate the game without a 3-minute timer behind it.","replies":[{"poster":"Myrmaster","date":"2016-05-27T00:48:39.873+0000","up_votes":14,"down_votes":0,"body":"That's not addressing the problem being discussed.\r\nWe're talking about a way to mitigate the huge MMR disparity between two friends who want to play together without one of them being matched against largely superior opponents because of their friend's ranking.\r\nA spectator-based mentor system doesn't let you play with the friend-- only coach from above.\r\n\r\nAdditionally, there are some red flags unfurling for me that need to be controlled.\r\nFirst, you'd better only be able to spectate someone on your friends list.\r\nSecond, you have to only be able to see from the vision of that player's team.\r\nOtherwise, ghosting would ruin the game.\r\nEven so, the extra map awareness you'd gain from having a coach stare at the map for you would not be fair to those without an extra pair of eyes on their end. (Although, you can already do this with someone physically standing behind you. I guess.)","replies":[]}]}]}]}]},{"poster":"bend0n","date":"2016-05-26T23:11:15.520+0000","up_votes":15,"down_votes":0,"body":"honestly, i think that the draft system that riot has in place is outdated and is in need of a rework. i feel like riot should take the SMITE/ DotA style of picks and bans, where the draft follows a series of 2 bans and 2 picks twice, and then a final pick and ban phase.\r\n\r\nwith that kind of system, drafting is more focused on banning out champs/heroes that fit the enemy team comp or counter yours, rather than the current draft system, where its just banning the 6 best champs in the meta.","replies":[{"poster":"bluekn1ght","date":"2016-05-27T04:19:46.205+0000","up_votes":5,"down_votes":0,"body":"I think it would make the pick/ban phase more dynamic and exciting.\r\n\r\nFor example, you could even start with 2 bans from each side, and then interleave 4 bans in the middle, say after each side picks 2 and 4th player.  \r\n\r\nYou could have team comp strategies change on the fly and more flex picks. Or we could just see utility champs - and similar team comps.  :)  \r\n\r\nYou'd probably want to design a system where a player (ie. Faker) has the OPPORTUNITY to pick his best/fav champ, but at some cost of another teammate...   or with a way to somehow value broad champ pools or unique picks.","replies":[]}]},{"poster":"tthrom2017","date":"2016-05-26T21:38:23.928+0000","up_votes":17,"down_votes":2,"body":"Will you Riot folks do the free mystery gift for players who haven't been banned like at the beginning 2015? That was a nice gift.","replies":[]},{"poster":"AMYS GRAVE","date":"2016-05-26T21:46:55.558+0000","up_votes":14,"down_votes":1,"body":"> We don’t think the number of bans needs to scale linearly with the number of champions. If you take that to an absurd conclusion, we might end up with so many bans that champion select gets really bogged down. \r\n\r\ndont let the slippery slope argument stop you from upping the bans to one per person. ","replies":[]},{"poster":"zergman","date":"2016-05-26T22:50:58.546+0000","up_votes":15,"down_votes":2,"body":"I'm personally a fan of using my smurf to learn to roles and champs in a competitive ranked environment without hurting my main account. For example if I'm playing just champs I know really well and playing at my highest level I'm about a gold 3-5 player, but if I'm learning a champ or role my skill level is only about silver 1-3. It's not like I'm not trying on my smurf. I just don't have the same skill. ","replies":[]},{"poster":"freebuck","date":"2016-05-26T21:45:37.403+0000","up_votes":4,"down_votes":1,"body":"If smurfs are discouraged, then why do several pro players have more than one account in challenger? I don't understand what Riot thinks is a good smurf and bad smurf. ","replies":[{"poster":"N3RAZIM PRA3TOR","date":"2016-05-26T22:37:16.035+0000","up_votes":12,"down_votes":0,"body":"good(?) smurf: does it for certain challenges, like leveling to 30 without runes and/or masteries, or to play with a low leveled friend/s until they reach a level where you think they'd be comfortable being matched with the higher skilled players that would come with partying with your main account (i have an account for these purposes, and it's rarely used until i can convince another friend to join).\r\n\r\nbad smurf: one who smurfs for the lulz, doing it so that he can stomp low-leveled players who have much less experience. these players/accounts also (in my experience) tend to be toxic as they either forget about or ignore the learning curve and flame others for doing badly or not taking the optimal course of action, thereby causing irritation to both opponent _and_ ally.","replies":[]}]},{"poster":"Blac Iyc","date":"2016-05-26T21:07:23.128+0000","up_votes":27,"down_votes":13,"body":"player: y no winter map?\r\n\r\nriot: too much work.\r\n{{summoner:32}} ","replies":[{"poster":"Amoebanator","date":"2016-05-26T21:57:02.170+0000","up_votes":19,"down_votes":12,"body":"This is the same player that cries because all skins are not free and they are still stuck in Bronze 5 (clearly Riot's fault).\r\n\r\nMaking a snow skinned map takes almost as much work as making an entirely new map. they would have the data for the map (how everything interacts with the world), but the art and visuals would have to start nearly from scratch to make it a good, fresh winter look. (dead, snowy trees, Christmas trees, snow on ground, frozen rocks, etc). The amount of work you propose purely for vanity's sake for a month's worth of play is absolutely absurd.","replies":[{"poster":"DrCyanide","date":"2016-05-26T23:26:49.154+0000","up_votes":12,"down_votes":1,"body":"Not *entirely* new. The passable/impassable terrain layer would remain the same, as would all of the rocks, and the placement of trees. \r\n\r\nWhat would mostly change is the texture for these things, along with some of the models where it made sense (a tree loosing all of its leaves, for instance). Some particles would also change (ripples from walking in the river would no longer make sense), as would sound effects and ambient music.\r\n","replies":[{"poster":"Myrmaster","date":"2016-05-27T00:51:58.573+0000","up_votes":1,"down_votes":8,"body":"It's 'hand-painted'. There are no mapped textures, and there are no models. It's a painting overlaid onto the collision mapping.","replies":[{"poster":"DrCyanide","date":"2016-05-27T01:07:36.362+0000","up_votes":10,"down_votes":1,"body":"\"no models\" doesn't mesh well with the rotated camera angles they show in the LCS or Instalok videos. Those are 3D models.","replies":[]}]},{"poster":"Icestar1186","date":"2016-05-27T00:11:34.753+0000","up_votes":5,"down_votes":5,"body":"They explained that that's not how it works. The map is not just a bunch of easy-to-edit textures. The whole thing would need to be redone from scratch.","replies":[{"poster":"Sakaru","date":"2016-05-27T15:55:23.864+0000","up_votes":3,"down_votes":0,"body":"They may have explained that's not how it works, but modders who make map skins (for themselves or others) know that it essentially is how it works.\r\n\r\nThey just like making it sound like more work than it is. Don't get me wrong, it 'is' a lot of work, and I don't blame them for not doing it until they're good and ready. It's just not as much as they're saying. But that's the only way they can appease the ignorant masses (Not an insult. I'm part of the ignorant masses when it comes to non-computer things) who don't understand how much work just changing models, etc can be when worried about it not corrupting each patch.","replies":[]}]}]}]}]},{"poster":"NowTHISIsPodrcng","date":"2016-05-27T02:16:54.016+0000","up_votes":9,"down_votes":0,"body":"PLEASE bump up to 10 bans! This has been on me and my buddies minds for a while now, there really is a need for more bans.","replies":[]},{"poster":"haloccarmi","date":"2016-05-26T22:29:37.017+0000","up_votes":6,"down_votes":0,"body":"I only do Solo-Q ranked and am currently in a low rank because I havent played enough this season to rank back up to where I was before. Because of my low rank, I generally face people that I often deem \"easy\" to beat. What are the chances that I could get confused with a smurf and then be punished by facing opponents much harder than I should be facing. Im asking since Ive noticed I generally face people in a few tiers higher than my current tier in my division. Its not a big deal as long as I dont start facing people in way higher divisions if I get confused for a smurf for some reason. I would like to get back to my previous rank and then more without excessive problems being introduced by an odd system. :P Just a thought and question. ","replies":[{"poster":"Myrmaster","date":"2016-05-27T01:04:47.033+0000","up_votes":3,"down_votes":0,"body":"I was wondering if this was happening to me for a while before I finally hit summer and got Gold V again. School was keeping me from playing anywhere near often enough to climb at a reasonable pace.\r\nBut Because MMR (match-made rating) is a hidden stat that is actually used to match you (and not your visible \"League-Division\" rank) the system should have preserved your MMR and that's why there's a disparity between your visible rank and that of your opponents.\r\nMost of the people with the same MMR as you have been able to play enough to climb up in visible ranking to that level. You haven't, but you're still matched with them because the system considers that a 'fair game'. The system is trying to keep you out of games with 9 other people who actually have lower MMR and effectively boosting your team while smurf-stomping the enemy team for no fault of their own. It's supposed to compensate for the fact that you're playing higher-rated games while having a lower visible rank by giving you more LP per win and tanking you fewer LP per loss. The issue is jut getting enough games in to equalize the two.\r\nYour visible rank raises to meet your calculated MMR, and not the other way around. This can often mean that one will trail the other by some degree, especially at the start of a season (or whenever you begin playing in a new season).","replies":[]}]},{"poster":"KAYDEL","date":"2016-05-26T23:30:44.549+0000","up_votes":4,"down_votes":11,"body":"I find it funny that they couldn't stress enough who difficult it was to create a snow-themed map yet there are multiple websites that offer third party, very well made custom maps including a snow-themed one.","replies":[{"poster":"Shyvauni","date":"2016-05-26T23:51:47.025+0000","up_votes":13,"down_votes":3,"body":"Honestly those custom maps are barely passable at best and no just throwing snow on everything is not enough to truly inspire a winter feel. They did state they might do it, it is just liw priority compared to literally everything else and I agree with that. Do i want a winter SR? Definitely however not at the cost of more important issues they are working on","replies":[]}]},{"poster":"quiffsplitter","date":"2016-05-28T02:15:06.463+0000","up_votes":5,"down_votes":0,"body":"_Reading between the lines, there seems to be concern about how many champions LoL can support. There probably is a finite number, but at the rate we release new champions these days, it will be many years before we really have to worry about having too many._\r\n\r\nI hope Rito is taking this observation seriously because, unless I'm misunderstanding how the money side works, this should be the key concern of the league business model. Used to be companies sold you a $50 game and were done, but Rito keeps selling you and selling you the same game. They've been brilliant at packing new saleable shit into this game, but eventually, they'll have sold their fans about all the game they can sell them. I'm suspicious that this will be much, much sooner than this comment suggests, but that might just be my lack of imagination speaking. \r\n\r\nI have no interest in sandbox, but this is why I believe Rito needs sandbox, because that's how LOL was born (right? Warcraft 3 sandbox => DOTA => LOL). If Riot wants to be right there ready to grow and cash in on the NEXT big thing so they can survive the inevitable passing of LOL, what better way to do that than to incubate it right in their own basement?","replies":[]},{"poster":"PbJMpP4xzk","date":"2016-05-26T20:59:55.545+0000","up_votes":5,"down_votes":0,"body":"less and less solo players in the mix.","replies":[]},{"poster":"andriy93","date":"2016-05-28T09:46:36.178+0000","up_votes":4,"down_votes":0,"body":"In the future, would something like a currency exchange or a player bazar of sorts be considered? I don't have the issue, but I know that many veteran players have a large amount of IP they they don't really have any use for. They have all champions, and all the runes they need, or don't need. But there's always skins, summoner icons, ect. to be obtained.","replies":[]},{"poster":"TooDangFabulous","date":"2016-05-27T07:47:46.934+0000","up_votes":4,"down_votes":0,"body":"I remember when I made my second account to play with my friend that just started. I really disliked having to do it, I felt like if I played with him on a level 30 I could ruin the game in more ways for both teams. Like one team could have more higher level or only high level players. I fell making a new account to play with a new player is better then unbalancing the matchmaking system. The real problem is I actually did try once to make an account to see if I could dominate by picking beginner the games I played sometimes had all smurfs I was so mad about it because the players I get after selecting Veteran actually seem to be all new or bots. I literally tell new players not to pick beginner or they will get stomped.","replies":[]},{"poster":"Ýisus","date":"2016-05-27T04:43:25.969+0000","up_votes":5,"down_votes":1,"body":"So regarding Smurfing - Riot seemed to forget the main reason I log into a smurf account - the speed of play.  Lower level play is much much slower and less stressful.  Sometimes it's just nice to get back to slow play.  Regardless of the skill level of the champions - the play is just slower without runes / masteries.  And that is enjoyable and relaxing sometimes.","replies":[]},{"poster":"Schizoid Steve","date":"2016-05-27T02:48:30.290+0000","up_votes":5,"down_votes":1,"body":"Please give {{champion:266}}  some needed attention. #Rework?","replies":[]},{"poster":"LeBr0nze James","date":"2016-05-28T08:21:39.579+0000","up_votes":3,"down_votes":0,"body":"how about making ranked only with mastery level 4+ champs only? that way you know if a player has experience with a champ and won't lock in with a champ they played only a few times before.","replies":[]},{"poster":"Indica x420x","date":"2016-05-27T20:55:36.529+0000","up_votes":3,"down_votes":0,"body":" I just wanted to comment about the smurf account issue. I understand people like to smurf to maybe play with friends or maybe so they don't have to play long matches if they was trying to farm currency / drops. I guess the way to look at it is how fair do you want the competitive side to be. I would think in my opinion smurf accounts should be aloud but not in competitive. If they want to play with friends of a different tier then make it locked to normal and not possible to do comp. I feel this would help balance the ranks in comp ladders. Games are meant to be fun and playing with friends is encouraged. \r\n I feel if this was done then say whatever my comp rank was would be more accurate opposed to the way it is now. People that have smuft accounts should be able to pick which account they want to be there comp account and which they want to be for casuals then it should be locked to that after chosen. I like to consider the new players to the community that are maybe trying the game for the first time or just trying to get into. Competitive should be as fair as possible and I feel this might be a step towards that. \r\n I myself have had my account for awhile but have played on and off here and there over time. What I do see and I feel its due to smurf accounts is a lot of people complaining about how other players don't know what they are doing and complaining in matches about how bad they are. This is Bronze v an entry level into comp the bare minimum. When people do or say things like this to new or newer players it only hurts the community as a whole in the long run. Or maybe even consider in comp modes to get rid of the chat and only make pings on the map instead. Anyway my input on this is yes smurf accounts in comp is not fair and should not be aloud or really its truly not an accurate comp ladder. 5 people in bronze v on the ladder could be the same guy so to speak. Smurf accounts also don't have the need or want to excel as the guy who only has 1 account and is trying to climb the ladder.\r\n Smurf accounts also don't have to worry much if they think people are bad and become vocal about it are most likely not even to finish the match or troll. The small infraction means nothing to the smurfs that just don't care. This leads  to a lot of trolls or afk's cause the novice team isn't playing at a diamond league level. So sure making comp more competitive and accurate would be great for all new and old players. This is just food for thought ad clearly just an opinion. Good luck on the issue.","replies":[]},{"poster":"gibbsies","date":"2016-05-27T04:08:50.904+0000","up_votes":3,"down_votes":0,"body":"I'm afraid the texture excuse for \"Why don’t we get a winter-themed Summoner’s Rift skin for Snowdown anymore?\" is weak sauce. All you need to do is make a Summoner's Rift Winter map that has it's own artwork and painting, and leave the original alone. \r\n\r\nSome might say that this is bad because you'd have to update two maps whenever you fixed a bug in Summoner's Rift's map: but, that should be minimal because you would only use the winter map for a couple of weeks a year, and could manually update it every Christmas.\r\n\r\nIt's not a rendering technology issue if you've got your processes down right, it's just a production issue in this case. \r\n\r\nIf, on the other hand, you don't have a team of two artists to address the making of a copy of summoner's rift with snow, what do the 400 people working on the project do day to day?","replies":[]},{"poster":"Revolvus","date":"2016-05-26T20:57:45.870+0000","up_votes":4,"down_votes":1,"body":"is it just me are there only 2 comments?\r\n","replies":[]},{"poster":"Insidious1","date":"2016-05-27T17:45:23.844+0000","up_votes":1,"down_votes":4,"body":"To limit smurf impact...How about limiting every PC installed to one ranked account. You want to play with your friend to help them get better...no reason it should be ranked. ","replies":[{"poster":"McMasterpiece","date":"2016-05-27T18:20:13.025+0000","up_votes":3,"down_votes":0,"body":"They're not talking about the impacts on ranked gameplay, they're talking about the rampant toxicity pre-30. Where you have people who were banned/are stuck in Bronze/Silver/Gold/Plat/Dia 5/Whatever, and they go on to a pre30 account and potentially ruin the game for those who are just starting to play, or still learning how to play.\r\n\r\nI'm currently smurfing because I want an alt account to climb rank by myself, as I have an account that I mainly play with friends. And I see all these pre-30 accounts flaming and fighting and afking because of not getting the role they want, or because \"IDC, riot banned my main, and they won't do anything to this acc lol hehe\"","replies":[]}]}]}