{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2019-11-06T18:00:03.348+0000","title":"A Thanks to All Twisted Treeline Players","subforum":"Announcements","up_votes":4,"down_votes":24,"body":"[ÜRES]","replies":[{"poster":"xStormaggedonx","date":"2019-11-06T18:04:18.053+0000","up_votes":214,"down_votes":15,"body":"If they payed attention to it, people would have played it...","replies":[{"poster":"Pika Fox","date":"2019-11-06T18:12:04.458+0000","up_votes":26,"down_votes":116,"body":"> [{quoted}](name=xStormaggedonx,realm=NA,application-id=Ag8jgd8Q,discussion-id=QUbbn36A,comment-id=0000,timestamp=2019-11-06T18:04:18.053+0000)\n>\n> If they payed attention to it, people would have played it...\n\nNo one played it when they did.","replies":[{"poster":"Supp me Up","date":"2019-11-06T18:42:44.371+0000","up_votes":74,"down_votes":4,"body":"I started in s3, during my whole time on LoL, i remember one major change to TfT. They used to have TT specific changes in the patches, but they only had that one major overhaul where they added turrets and changed the jungle layout around. That was back in like, season 4 or 5 dude. The \"new\" twisted treeline is older than the \"old\" twisted treeline and they let it rot for years. So please, tell me when did they support it because this is the BEST i can think of regarding support for TT.","replies":[]},{"poster":"Stupie","date":"2019-11-06T18:14:49.816+0000","up_votes":17,"down_votes":2,"body":"i probably  played over 2000 games of the original map before rework back when saintvicious was all the hype","replies":[{"poster":"Pika Fox","date":"2019-11-06T18:19:40.673+0000","up_votes":7,"down_votes":20,"body":"> [{quoted}](name=Stupie,realm=NA,application-id=Ag8jgd8Q,discussion-id=QUbbn36A,comment-id=000000000000,timestamp=2019-11-06T18:14:49.816+0000)\n>\n> i probably  played over 2000 games of the original map before rework back when saintvicious was all the hype\n\nAnd i mained TT back when i first started. All the way up to level 30+. I loved TT, but the reality is still even back then support from the community wasnt there. And we even saw champion specific adjustments for TT; nerfing both mundo and singed.","replies":[{"poster":"Kürama","date":"2019-11-06T19:50:17.327+0000","up_votes":8,"down_votes":6,"body":"Yea cause that's totally enough to make the mdoe enticing. ","replies":[{"poster":"Pika Fox","date":"2019-11-06T20:40:03.690+0000","up_votes":5,"down_votes":20,"body":"> [{quoted}](name=Kürama,realm=NA,application-id=Ag8jgd8Q,discussion-id=QUbbn36A,comment-id=00000000000000000000,timestamp=2019-11-06T19:50:17.327+0000)\n>\n> Yea cause that's totally enough to make the mdoe enticing.\n\nIt got the same treatment SR did at the time.","replies":[{"poster":"Kürama","date":"2019-11-06T22:17:56.986+0000","up_votes":11,"down_votes":2,"body":"[You mean this?](https://boards.na.leagueoflegends.com/en/c/gameplay-balance/vGdZE7Td-compendium-of-map-specific-champion-balance) Cause that was all we got.","replies":[{"poster":"Pika Fox","date":"2019-11-06T22:29:00.827+0000","up_votes":2,"down_votes":16,"body":"> [{quoted}](name=Kürama,realm=NA,application-id=Ag8jgd8Q,discussion-id=QUbbn36A,comment-id=0000000000000000000000000000,timestamp=2019-11-06T22:17:56.986+0000)\n>\n> [You mean this?](https://boards.na.leagueoflegends.com/en/c/gameplay-balance/vGdZE7Td-compendium-of-map-specific-champion-balance) Cause that was all we got.\n\nWe got a lot more than that. While SR was the primary balance factor, anything that was overbearing in TT was adjusted for a long while. Not to mention the jungle was adjusted multiple times outside of the major map rehaul, same as SR being adjusted. Hell, vilemaw wasnt the original boss of the map, Dragon was.","replies":[{"poster":"Kürama","date":"2019-11-06T23:06:56.398+0000","up_votes":11,"down_votes":0,"body":"List these changes. And not the 2012 update that was 7 years ago. Neither the one in 2015. Those were the 2 patches they did for TT in the span of 7 years. ","replies":[]}]}]}]}]}]}]}]}]},{"poster":"iRocky","date":"2019-11-06T18:43:04.618+0000","up_votes":85,"down_votes":5,"body":"No one played it because nothings been changed in years. There's been nothing to entice players to play it. Rewards for ranked season were always lackluster, and balancing was almost nonexistent. When Riot announced the removal of the map they simply ignored the hundreds of comments on their \"Nexus\" post where everyone was saying the same thing, nobody plays it because Riot neglects it. Now Riot is blaming the players for its lack of use when in reality they caused it. The same thing happened with Dominion (Crystal Scar). Hopefully they won't neglect their new projects that are taking dev teams away from League like they did their old League Content. :)","replies":[]},{"poster":"Apples","date":"2019-11-06T18:53:04.141+0000","up_votes":83,"down_votes":5,"body":"**_TWO icons this time??_** Riot has really outdone themselves. When they took Dominion out back and shot it, we only got one icon.","replies":[{"poster":"Forbidden Siren","date":"2019-11-06T22:31:08.135+0000","up_votes":22,"down_votes":1,"body":"I was hoping a chibi Vilemaw ward skin or something but icons? Get out!","replies":[]},{"poster":"Sukishoo","date":"2019-11-06T19:25:44.536+0000","up_votes":18,"down_votes":1,"body":"Don't forget the Emote too! So special /s","replies":[]}]},{"poster":"Scarletmeow","date":"2019-11-06T21:36:49.382+0000","up_votes":73,"down_votes":3,"body":"So, when are you guys gonna stop updating ARAM for a few years, wait for people to stop playing it because bugs and balance is ruined, and then delete it claiming it was too unpopular? First Dominion now this, when you promised TT wouldn't get the same fate. Pretty disappointing Riot, Pretty pretty disappointing.","replies":[]},{"poster":"EvilDJBooty","date":"2019-11-06T19:04:23.056+0000","up_votes":74,"down_votes":7,"body":"Rewarding cosmetics to validate a removal is getting old. \r\n\r\nI enjoyed playing Twisted Treeline and Crystal Scar. But with the lack of interest from Riot themselves, the population decreased. I don't see any effort from Riot into bring the population back. Rotating game modes is being treated the same way. If Riot just allowed newly created modes to rotate every month instead worrying about what isn't fun and engaging, people would keep playing it. \r\n\r\nWhy spend all that time creating map with tons of gameplay interaction, to only trash it after event ends. Star Guardian, Dark Star, Odyssey, and much more. They have so much potential. Each season that passes, Riot becomes less interested in player growth and continue to alienate their own community. With the release of TFT, how long till Riot decides Aram is longer relevant and removes it from live servers to only reward us with cosmetics.\r\n\r\nIt is a real shame the game's future on its 10th year is bounded by cosmetics instead interactive gameplay.","replies":[{"poster":"Uncle Cunk","date":"2019-11-07T04:10:57.246+0000","up_votes":15,"down_votes":2,"body":"I don't log in to upvote and commend many comments.\r\n\r\nThat being said, you get a massive upvote from me. \r\n{{sticker:slayer-pantheon-thumbs}} ","replies":[]}]},{"poster":" Queen Of Yuri","date":"2019-11-06T18:54:36.341+0000","up_votes":56,"down_votes":4,"body":"Claiming that your thankful for the TT players but no major patch and being ignored for years on end :)","replies":[{"poster":"bobyjhon132","date":"2019-11-06T19:52:51.832+0000","up_votes":39,"down_votes":2,"body":"no it's ok riot is a small indie company cut them some slack they can't be expected to have so many maps for their game :)","replies":[]},{"poster":"Kürama","date":"2019-11-06T19:54:18.887+0000","up_votes":9,"down_votes":0,"body":"{{sticker:sg-miss-fortune}}","replies":[]}]},{"poster":"Tentacle Advisor","date":"2019-11-07T05:11:22.470+0000","up_votes":49,"down_votes":1,"body":"\"A Thanks To All Twisted Treeling Players\"\r\n\r\nThanking a community of players for their love of a gamemode, that you plan on removing, solely because YOU chose to not only ignore the gamemode, but also the very community of players you're currently \"thanking\" is a pretty-damn shady move, Riot.\r\n\r\n\"We're sad to see such a longtime game mode leave our official rotation...\"\r\n\r\nExcept...you're really not. And you've proven this by, again, ignoring the community of players who played the mode and refusing to keep up with updates for the map. ESPECIALLY, when it comes to handling the MASSIVE bot issue. This entire \"we had to remove it to give us more time to focus on our other gamemodes\" is nothing but a damn cop out.\r\n","replies":[]},{"poster":"Lylacs","date":"2019-11-07T07:01:03.685+0000","up_votes":44,"down_votes":1,"body":"Riot: *ignores dominion entirely and doesn't even update map*\r\nPlayers: *plays less dominion*\r\nRiot: They don't like the game mode, we should remove it.\r\nPlayers: At least we still have twisted treeline and it's somewhat updated map.\r\nRiot: *continues to ignore tt* \r\nPlayers: *lose interest due to less and less effort being put into gamemode*\r\nRiot: They don't want that either, remove it.\r\nPlayers: *outrage*\r\nRiot: here's an emote, deal with it.","replies":[]},{"poster":"Yøríck","date":"2019-11-06T19:32:58.939+0000","up_votes":38,"down_votes":1,"body":"I’ve played over 250 games of Twisted Treeline with my two friends since starting league. It’s always been the most fun with them in my opinion. Always hoped it would get an update one day. Shame to see it discontinued.","replies":[]},{"poster":"Coins","date":"2019-11-06T19:37:01.737+0000","up_votes":36,"down_votes":1,"body":"Can we get some of the items from TT moved into other game modes? Like Moonflair Spellblade?","replies":[{"poster":"Gerbaire","date":"2019-11-07T01:31:44.209+0000","up_votes":14,"down_votes":1,"body":"Seriously, AP bruiser items plz. It's already in the game ffs.","replies":[]}]},{"poster":"Survivorman101","date":"2019-11-06T20:28:20.127+0000","up_votes":31,"down_votes":0,"body":"I'm really going to miss Twisted Treeline. It was honestly one of my favorite ways of playing the game, and I really wish that Riot had put more effort into developing a player base, as opposed to ignoring it for years. They said that they will now be able to focus more efforts on their larger games modes, but what efforts were being put into TT in the first place?","replies":[]},{"poster":"Murasakı","date":"2019-11-07T06:14:58.759+0000","up_votes":33,"down_votes":2,"body":"You kill off my favorite mode and give me a shit emote in it's place? go fuck yourselves.","replies":[]},{"poster":"dogownerjr","date":"2019-11-07T05:53:29.522+0000","up_votes":31,"down_votes":1,"body":"I honestly liked Twisted Treeline more than summoner's rift. It was my favorite map to try new/reworked champs on too. I felt like Vilemaw was more dynamic and fun to fight than Baron. And the Nexus turret in that map is such a game changer that I wish summoner's rift had it. I'm REALLY gonna miss this map and am really disappointed that this is what Riot believes is the best action to make towards it.","replies":[]},{"poster":"Whitejoke","date":"2019-11-07T00:03:48.916+0000","up_votes":22,"down_votes":0,"body":"Over 5k twisted treeline games played, it started because my old pc back in season 1 could only play TT so it became my go to, and then started that way Inwas thrilled whenever it got revamped and supported for a few months. I have played ranked TT every season and the community was super close. This mode is the only reason I played league and spent 300$ or more on content in the game. And too see it not be supported and now removed will likely cause me to no longer play league of legends. But what's 300$ to a conglomerate like Riot games, Iif the mode was supported with balancing and content update and missions etc I think the mode could thrive. And having surrender vote times lowered to 10 minutes could have given a face paced action packed game mode for more casual players. But instead let's just remove it, and give an emote. ","replies":[]},{"poster":"SyphroJYT","date":"2019-11-07T15:08:53.889+0000","up_votes":19,"down_votes":0,"body":"Pretty sad to see a gamemode get trashed when all it needed was an update. Honestly, they could update TT twice per season and that would be enough to keep it interesting. Yet they somehow have time and the idea pool for the new SR map changes, as well as the new dragon changes, but nothing for TT? So much wasted potential.\r\n\r\nHere's how you fix TT in my opinion:\r\n\r\nShorten death timers: No one wants to die at 20 minutes and wait nearly a minute to be able to play the game again.\r\n\r\nRework altars: Despite having decent buffs, the altars don't really do much. Maybe even, instead of making it a game mode where you kill the Nexus, you could have an altar where each Nexus is now, and make it so the objective is to control all 4 altars to win. At least it would be more unique. Think about it. Even if the enemy team is on your base's altar, someone could sneak around and grab one of the altars in the jungle before they control all 4. I personally think it would be a lot more interesting, but even if they just gave the current 2 different buffs, or even scaling buffs, that would be fine. \r\n\r\nChange jungle/open up map/rework vision (let us upgrade Oracle): essentially there are 15-20 champs that are any good on the map, and about 50 who are almost impossible to win on. Kayn, Rek-sai, and Fid all have an unimaginable advantage over almost all others because they can go over the thick walls that no one else can. I'd say make the walls thinner, or add a path that leads between the middle of the two top lane bushes. You could even add more camps because the camps currently die extremely fast and don't really do anything. Maybe you could take the scrapped SR idea of smiting a specific camp to get a specific buff (smiting wraiths gives you a spirit that wanders your jg and let's you know when someone is in there, something like that). Also, vision is so good awful, it's not even funny. The easiest way to keep it unique and stick to your guns, as you so obviously do, is to let players upgrade the Oracle. It could be in a short path, similar to Ashe E. It could last longer. Anything. Champions like Teemo get full rein of the map because no one can stop his shrooms, especially if there isn't a champ on your team that builds duskblade. Either add more items that can spot traps, give us more ward options, or both.\r\n\r\nPlease, Riot. Even if you don't listen to my ideas specifically, at least try to rework TT. It could make your game so much more interesting and fun, keeping players for longer. \r\n\r\nAlso, real funny how your world's pass doesn't give tokens for playing TT games. It says matchmade games, Riot.","replies":[]},{"poster":"Wraith Drake","date":"2019-11-07T06:19:17.900+0000","up_votes":19,"down_votes":0,"body":"OH WOW RIOT I LOVE IT! is what I would say if I was stupid... Really you go and get rid of dominion. You didnt support this gamemode, left it on the sidelines and then said eh let's get rid of it the league community doesnt care... WE DONT CARE!? THIS IS BS IVE PLAYED THIS GAME FOR 7 YEARS, 7! I WAS THERE WHEN SWORD OF THE DIVINE GOT TAKEN, I WAS THERE WHEN YOU REMOVED REVIVE, I WAS THERE DURING YOUR F-UPS WITH JUGGERNAUTS, BUT THIS! this is a disappointment, this is a sham, and to top it all off your giving the worst thing imaginable to the ppl who wanted something to truly hold onto this map take my account, take my skins, take my rank, I'm done with this bs. Give me a fing skin for this map only unless you f*ckers care so little after all you screwed the dominion players now you're screwing us TT players. Get some new designers or actually pay attention to what's going on either way start coming up with something new to throw at us when you screw us cause this is the last time I'm accepting the bare minimum.","replies":[]},{"poster":"Xenodragon11","date":"2019-11-07T06:57:20.366+0000","up_votes":17,"down_votes":0,"body":"Excuse me?\r\nDid you guys even read the comments the FIRST time you posted this? Riot, you're getting really, really hard to defend. Get the plugs out of your ears when announcing things.","replies":[]},{"poster":"Jennifer17","date":"2019-11-07T03:54:53.986+0000","up_votes":17,"down_votes":1,"body":"fuck you riot. 3 patches in its entire lifetime. \njust fuck you","replies":[]},{"poster":"x Ash Bringer x","date":"2019-11-07T08:11:23.619+0000","up_votes":15,"down_votes":0,"body":"Op-easing the masses , and yet everyone will be eligible for this reward, nothing fancy, no legendary skin, and  nothing worth the time put in. Lazy to fix their own game. Even mocking the player base when they say TFT is the same game when clearly completely different. Been playing since season 1. Now just going to play the game a lot less then I was. Amazing to see their responses.\r\nThough Riot is still better then most of the other companies out there.\r\nStill sad to see a game mode go.\r\nMany other type of games out there do not do this, but Riot has now become one.\r\nCan not wait to see the next round of BANS as well as more things to come.\r\n #LETS START A RIOT :P{{summoner:6}} {{summoner:6}} {{summoner:6}} ","replies":[]},{"poster":"Worst Kench NA","date":"2019-11-07T12:06:13.716+0000","up_votes":13,"down_votes":0,"body":"Your thanks isn't welcome. Please don't act like you cared about the game mode. You didn't. Just give me my icons and get it over with.","replies":[]},{"poster":"Coradelaide","date":"2019-11-07T12:23:18.620+0000","up_votes":12,"down_votes":0,"body":"First crystal scar and now this? Cmon whats the harm in it existing","replies":[]},{"poster":"Thicc Togekiss","date":"2019-11-07T05:50:45.689+0000","up_votes":12,"down_votes":0,"body":"This is truly sad. Many of my fondest memories are from 3s. In 3s there was a real sense of variety, you could play whatever, practice champs, and if it was just you and a friend or two you could have fun without randoms like in 5s. \r\n\r\nThe saddest part is RIOT claiming they \"need time to focus on more popular game modes\" as If they even remembered 3s existed. It still has the old jungle camps! \r\n\r\nto take away something people love is always sad, and honestly, as someone whos found less satisfaction in league the past 2 years, this really shows that you're either in their boat or not. Ill miss the good times. Maybe with all this \"extra time\" they can balance the game ","replies":[]},{"poster":"Danson14","date":"2019-11-06T18:51:58.281+0000","up_votes":12,"down_votes":0,"body":"I wish Riot gave TT more focus. I honestly loved the game mode, and all my friends thought I was crazy. There was something I liked about the king-of-the-hill playstyle with the altars, or how you had to work as a team or else nothing could get done. I understand why the game mode is being removed, but it is a sad farewell nonetheless.","replies":[]},{"poster":"Xenodragon11","date":"2019-11-07T07:00:31.993+0000","up_votes":11,"down_votes":0,"body":"By the way, click on the twisted treeline tag. The TWO (2) announcements including this one just tell you the whole story. And the 2nd one was FIVE YEARS ago (hexakill)","replies":[]},{"poster":"JeSuisLegende","date":"2019-11-06T20:23:32.330+0000","up_votes":12,"down_votes":1,"body":"Does anyone know if bots counts for the emotes and whatnot? Asking for a friend of course, they've played plenty of bots for first win of the day but less than 10 pvp games... {{sticker:sg-lulu}} ","replies":[{"poster":"undrline","date":"2019-11-06T22:28:37.483+0000","up_votes":8,"down_votes":0,"body":"Same question here.  Is full team PvP the only calculation?  What about PvE and custom 1v1 PvP?","replies":[]}]},{"poster":"Death4Peace","date":"2019-11-07T07:51:02.608+0000","up_votes":10,"down_votes":0,"body":"Thanks to you riot for all your hard work with this game mode ever since its release!\r\n\r\n{{sticker:slayer-jinx-unamused}} ","replies":[]},{"poster":"PRARUS","date":"2019-11-07T07:40:57.590+0000","up_votes":10,"down_votes":0,"body":"Damn Im actually going to miss TT. It was always a fun little time if you ever had a party of 3 and wanted to just have fun and mess around, now there's just summoners rift or ARAM, it feels weird that there is such little diversity, and the fact that custom games are near non-existent, feels like youre not using the community's creativity and need for more game modes","replies":[]},{"poster":"ZT Xperimentor","date":"2019-11-07T04:01:24.828+0000","up_votes":10,"down_votes":0,"body":"Celebrating the removal of a significant amount of playable content?\nShamefully spiteful.","replies":[]},{"poster":"Spideraxe","date":"2019-11-06T18:36:55.208+0000","up_votes":17,"down_votes":6,"body":"F to pay respects ","replies":[]},{"poster":"Zotikos","date":"2019-11-07T04:19:30.003+0000","up_votes":9,"down_votes":0,"body":"It's unfortunate that twisted treeline is going away. It's a good game mode to try new champs and builds. Ohh well. I guess they need to find more ways to give you teamfight tactics cosmetics. Riot do not get rid of twisted treeline. And stop giving me teamfight tactics rewards when im not interested in playing that game mode. ","replies":[]},{"poster":"bbygrI","date":"2019-11-06T18:40:51.607+0000","up_votes":9,"down_votes":0,"body":"Nooooooooo😪😭😩","replies":[]},{"poster":"Uncle Gnar","date":"2019-11-07T08:37:18.431+0000","up_votes":10,"down_votes":1,"body":"Getting an icon feels alright but emotes has become a negative for me as I can see riot so proud of the amazing gifts they have given us. My friends and I would have fun in  Treeline and Nexus blitz, now that they are being forgotten for the practically single player TFT and god knows what else, I feel like we are drifting further from league. Sorry but we might be gone soon. I miss ascension. I do have to admit gifts from 10th anniversary were great but a dang icon as a memoir as a favorite for some and long lived game mode just doesnt feel right","replies":[]},{"poster":"Spir1t Boy","date":"2019-11-06T21:28:58.047+0000","up_votes":12,"down_votes":3,"body":"Last time I played qiyana in TT but there was no water elements. WTF.. they never pay attention to this mode","replies":[]},{"poster":"nGio","date":"2019-11-07T05:39:27.916+0000","up_votes":9,"down_votes":1,"body":"\"but doing so will let us keep our focus on our larger game modes\".  How about game modes that should be permanent like URF, ARURF, Blitz, etc? The worst part about TT leaving is that my dream of Hexakill returning one day dies with it. \r\n\r\nSR ranked is stale, and we've been slogging through it for a decade now. Your \"blink and it's over\" damage meta isn't making the game fresh. You should be introducing MORE game modes, and giving them attention. I'm tired of you prodding us into ranked SR, so that we are part of some giant farm system to force feed LCS Simulator down our throats, while anything fun and different gets thrown in a vault because \"new client\", \"unpopular\", \"you say you like it but you really don't\", or whatever other bs reason we're being given at this point.\r\n\r\nYou should be looking to gain a broader spectrum of total players through as many different game modes as possible, and not \"give em this shit, and if they don't like it they can leave\".","replies":[]}]}