{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2015-03-25T00:13:20.948+0000","title":"Power Rankings 3/24/2015","subforum":"Esports","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"philiptheawesom","date":"2015-03-25T00:59:17.170+0000","up_votes":63,"down_votes":12,"body":"Na>Eu ^^ ","replies":[{"poster":"RyujinPower","date":"2015-03-26T12:41:53.158+0000","up_votes":10,"down_votes":26,"body":"I'm not an eu fan boy, but it's hard to see what you are saying when na's team has like 1 american in .... As a team yeah thier good, but doesn't mean your region is better.","replies":[{"poster":"Really Bad Car","date":"2015-03-26T14:49:59.994+0000","up_votes":16,"down_votes":4,"body":"There are only 2 players originally from NA on TSM, but I'd say that Bjergsen is more of an NA player now. He's played on the NA scene for a whole year now, and thus has developed into the style of NA teams and developed his talents on the NA scene. Of course, being from NA, I'm a bit biased, but I always believed that it's not where you're from that matters, but where you've developed and used your talent.","replies":[{"poster":"Trash Client","date":"2015-03-26T20:36:50.865+0000","up_votes":9,"down_votes":1,"body":"I really do like your comment and your perspective of things. What i always thought when people said NA better then EU, or when EU players said we had korean players and EU players was that NA in general is a country where people from all over the world go to try and make a better life. So in general NA imo is just a place and the composition is people from all over the world. But i most definately agree with your comment @Really Bad Car","replies":[]}]},{"poster":"Vixanys","date":"2015-03-27T15:24:52.412+0000","up_votes":4,"down_votes":0,"body":"Fnatic has 2 Koreans on it, but they are considered EU players because they play and develop their skills in the EU region. \n\nSame with H2K and their 1 Korean and 1 NA Coach!\n\nAs someone said below:\n\n> Bjergsen became an NA player the moment he put on a TSM jersey.\n\nTo add to that, he plays NA soloQ. He Represents NA internationally. I believe that NA overall  is better than EU. The reason for this is NA's quick adaptation (as opposed to EU's) of the management and support structure. Coaches, Analysts, etc. I think given time EU will catch up and it should all even out...at least I hope.","replies":[{"poster":"Lajin","date":"2015-03-31T10:46:19.855+0000","up_votes":1,"down_votes":0,"body":"Yeah and i have to say that the best aquistion (spelling?) in EU is actually Prolly as coach to H2K. He has done a really good work and he is way better as a coach than he was as a player. But then we have Fnatic with their 2 koreans which has actually pretty much dominate their lanes according to the rest in EU. I'm more of EU than NA cause i find the matches alot better but that doesn't mean they are better. If you see to all the international competitions after worlds season 3 where fnatic came in 3rd place the NA teams has actually been better except that IEM event where Gambit won","replies":[]}]}]},{"poster":"SoryInAdvance","date":"2015-03-26T01:29:07.586+0000","up_votes":3,"down_votes":1,"body":"true","replies":[]}]},{"poster":"Kurome Noomi","date":"2015-03-25T08:25:09.873+0000","up_votes":13,"down_votes":9,"body":"The EU vs NA is getting ridiculous... Is not like any have officially beaten Korea nor China. We should join forces, like some teams have already.","replies":[{"poster":"Sheimi","date":"2015-03-25T08:59:46.207+0000","up_votes":38,"down_votes":6,"body":"But NA has beaten both Korea and China when TSM beat CJ and WE","replies":[{"poster":"DrJottaW","date":"2015-03-27T12:30:08.650+0000","up_votes":3,"down_votes":6,"body":"The 10th place of China and the 4th of Korea who came to the tournament one day before it started without a coach. Amazing.","replies":[{"poster":"Action Jäckson","date":"2015-03-27T22:24:17.149+0000","up_votes":7,"down_votes":2,"body":"That 10th place China team beat the #1 Korean team.\r\n\r\nIt's tough to argue, C9 and TSM won their respected Intel Master tournaments.  NA also did better in the previous World Tourney.","replies":[]},{"poster":"Tr0llzer","date":"2015-03-29T15:32:39.211+0000","up_votes":1,"down_votes":0,"body":"and the fact that WE has really upped their game in their own LPL. Their roster changes are even maybe going to let them play in the play offs. It wasn't just that they beat a random chinese team, it's an on the rise chinese team who has taken games from OMG and etc.","replies":[]}]},{"poster":"Tarkamacska","date":"2015-03-25T09:20:43.212+0000","up_votes":9,"down_votes":22,"body":"Moscow 5/Gambit has beaten Azubu Frost and Blaze when they was 2 of the strongest Korean teams and no one said Eu>Kr. Come back to the Earth, please.","replies":[{"poster":"Centaur","date":"2015-03-25T11:52:00.813+0000","up_votes":13,"down_votes":4,"body":"But that was a few years ago, we are talking about now. Teams change, the reason NA>EU is because they are doing it now, not 2 years ago. They are simply better right now. ","replies":[]}]}]}]},{"poster":"TrollFan01","date":"2015-03-25T02:39:43.432+0000","up_votes":15,"down_votes":0,"body":"Can't wait to see next week's list after the EU & NA LCS ends.","replies":[]},{"poster":"Ekoth","date":"2015-03-25T01:44:59.789+0000","up_votes":43,"down_votes":59,"body":"As I die hard EU fanboi I'm outraged by these standings! The EU LCS has a 50% win rate, which is higher than Master3 and Najin Fire.  Why are EU teams not higher?  Just because they got trashed at IEM doesn't mean anything!  they clearly are doing very well when playing against each other and I think that SK should be #1 internationally.  Bring on the hate NA, EU fanboi 4 lyfe!!!","replies":[{"poster":"Synyster Hooks","date":"2015-03-25T02:44:17.390+0000","up_votes":3,"down_votes":13,"body":"vvvortic (shifted into an EU-biased view instead of self worth) wannabe.","replies":[{"poster":"Ekoth","date":"2015-03-25T03:10:40.256+0000","up_votes":20,"down_votes":4,"body":"So vvvortic has a monopoly on satire? ","replies":[]}]},{"poster":"Steelballz","date":"2015-03-25T01:51:13.118+0000","up_votes":3,"down_votes":9,"body":"50% win rate against their own people?","replies":[{"poster":"Ekoth","date":"2015-03-25T01:53:58.578+0000","up_votes":13,"down_votes":2,"body":"Just FYI in every closed competition all teams have a 50% win rate because every game that's a loss for one team is a win for another.","replies":[]}]},{"poster":"Pieftw247","date":"2015-03-25T02:21:59.439+0000","up_votes":20,"down_votes":5,"body":"Lol why the downvotes this is satire ","replies":[{"poster":"Ekoth","date":"2015-03-25T02:23:32.737+0000","up_votes":9,"down_votes":7,"body":"Thank you.  Finally someone understands me.","replies":[]}]}]},{"poster":"INF Ezay","date":"2015-03-25T17:59:46.918+0000","up_votes":3,"down_votes":3,"body":"CJ Entus is definitely underrated, they had huge performances and have infinite potential within their roster.\r\nTeam Impulse seems slightly overrated to me. Yes, they won some games, but it wasn't that overwhelming... especially concerning that they are put in front of Fnatic and H2k. Both of which are stronger at the moment.\r\nAdditionally I am missing Cloud9, also known as \"Throw9\" due to their last performances. They actually do very well and I like their picks. They just have to fix some deciding issues. Still I think they deserve a spot in this list.","replies":[{"poster":"Chase The Mace","date":"2015-03-25T23:26:30.832+0000","up_votes":5,"down_votes":0,"body":"TiP is on a 5-win streak beating TSM, C9, LIQUID, CST, WINTERFOX. they all won those games in a great fashion we have seen rush finally become a good aggressive jungler, constantly making good plays, Impact has found his groove and champion pool. XIAOWEIXIAO has been playing some different and very well executed picks like karthus, yasuo. and with that Apollo and Adrian have been picking up their game. The team now has great chemistry and is really something to follow coming into playoffs.","replies":[]}]},{"poster":"Rpikes Ward","date":"2015-03-25T23:26:28.025+0000","up_votes":5,"down_votes":0,"body":"{{champion:432}} {{item:3031}} {{item:3031}} {{item:3031}} {{item:3031}} {{item:3250}} {{item:3087}}  best build","replies":[{"poster":"Takhuan","date":"2015-03-30T03:01:43.369+0000","up_votes":2,"down_votes":0,"body":"You mean{{champion:1}} {{item:3031}} {{item:3031}} {{item:3031}} {{item:3031}} {{item:3085}} {{item:3085}} ","replies":[]}]},{"poster":"Jawnypants","date":"2015-03-25T02:43:44.107+0000","up_votes":6,"down_votes":1,"body":"I was dismayed at OMG's fall at first but I guess it makes sense. They went 2-4 this week, dropping games to rising but mediocre teams. If one chooses to rank Snake ahead of them, they might as well rank IG too, as they were just the first team to 2-0 OMG. And if you rank IG ahead of them, why not Vici (who I believe is stronger than IG) as well? OMG also lost 2-3 to a challenger team, Qiao Gu in the Demacia Cup a few weeks ago.0\r\n\r\nI didn't consider HKE to be a 2nd place team, but the reasoning here is also sound.\r\n\r\nNice list. \r\n\r\nOn a less related note, I'm confused about the combining of the Latin American divisions. For the list it makes sense, (though why not add all twelve teams?) but for the upcoming IWC qualifier for the MSI, Latin America gets only one spot despite having two different leagues. It would make more sense to me to include both champions, since in doing so the IWC tournament would have an even eight teams. This has been on my mind for a while and I felt I had to rant somewhere.\r\n\r\nMaybe I should rant on my blog, which you can check out right [here](http://jawnypants.blogspot.com/)!","replies":[]},{"poster":"Hopping Nut","date":"2015-03-25T15:20:59.131+0000","up_votes":4,"down_votes":0,"body":"LPL 2-6 in this ranking is actually pretty close. I like how WE is ranked at 8 as well since they are rising rapidly. So I would say well done ranking them. even tho OMG ranked as #5 may be a lil underestimated but I am okay with it since I am truly disappointed in them and I am not very confident if they can beat any of the teams in LPL easily now. However, welcome back, the korean hype. Guess these analysts are going to live with it for life. gg ","replies":[]},{"poster":"BluPrince","date":"2015-03-26T08:34:47.869+0000","up_votes":1,"down_votes":0,"body":"It'd be nice to see Oceania mentioned here.","replies":[{"poster":"Troll Pool","date":"2015-03-27T02:14:04.226+0000","up_votes":3,"down_votes":1,"body":"It's honestly a waste of space to mention teams other then from  EU, NA, china, korea and taiwan. Not like any of those other regions will even get out of groups at worlds. They're like a couple seasons behind in terms of their skill level.","replies":[{"poster":"Yandere Carry","date":"2015-03-28T15:44:12.917+0000","up_votes":2,"down_votes":0,"body":"No reason to not include them. If there is a chance, then they should be included.","replies":[]},{"poster":"Vexxed","date":"2015-03-29T17:16:58.844+0000","up_votes":1,"down_votes":0,"body":"If we're talking about waste of space not like the Taiwanese teams have that much more of a chance of beating the other four in any major international competition that isn't done in BO1s than Latin America, CIS, or Japan.","replies":[]}]}]},{"poster":"The Real Sarkhon","date":"2015-03-25T04:23:37.572+0000","up_votes":1,"down_votes":15,"body":"These power rankings make no sense.  Power rankings are based on overall performance weighed against recent results, with a heavier leaning on recent results.  That being said, with how close Cloud 9 and Team 8 are in NA, it makes zero sense why Team 8 isn't ahead of Cloud 9.  Using the logic that put Ohio State in the CFB Playoffs this year, the team in between C9 and T8, Gravity, should be pushed into 4th (Ohio State) and Team 8 (Baylor) should be ahead of Cloud 9 (TCU).  That being said, CLG and Impulse could use a relook to see if Impulse is really in 3rd place as far as current power rankings is concerned, but CLG is a strong team with consistent performance.  \r\n\r\nAll in all, these power rankings again and again prove that E-Sports is miles away in terms of understanding what the heck is going on.  The international power rankings are a joke, and need to be completely re-evaluated post IEM.  I'm not saying TSM number one, but the fact that they won the tournament says more about the rest of the worlds relative strength than TSM's... maybe rethink regional strength a big (I.E., China number 1, Korea number 2, NA number 3, but in terms of how close... China clearly ahead, and then Korea and NA very, very close at this point).","replies":[{"poster":"Tarkamacska","date":"2015-03-25T11:07:53.537+0000","up_votes":3,"down_votes":10,"body":"Even if TSM won IEM it says absolutely but absolutely NOTHING. In 2014 Gambit won IEM and they were the weakest team in EU in the entire year. ","replies":[{"poster":"Ne0Spirit","date":"2015-03-25T16:21:55.235+0000","up_votes":3,"down_votes":2,"body":"1. You can't use \"if\" because it already happened.\r\n2. Gambit didn't win IEM in 2014. They won IEM cologne in 2013 and 2014 to qualify for IEM world.championship 2014 and 2015 respectively. IEM cologne 2013 was after they had gone to worlds and in 2015 they beat dig and clg with a sub in the jungle.\r\n3. KT bullets won IEM 2014 world championship. (That's a Korean team... like the region that won worlds 2013 & 2014)\r\n\r\nNext time fact check before spreading false information","replies":[{"poster":"TeeTime Taxjo","date":"2015-03-26T19:42:03.084+0000","up_votes":2,"down_votes":1,"body":"http://lol.gamepedia.com/Moscow_Five?cookieSetup=true\r\nm5 won the iem at March 10th, 1st place at IEM Season VI - World Championship. Watch it up yourself it was in 2012.","replies":[{"poster":"Poreatix","date":"2015-03-28T00:10:56.251+0000","up_votes":2,"down_votes":0,"body":"If Tarkamacska said in 2012 Gambit won IEM then you can argue that point.  He fortunately didn't.  Also M5 wasn't 100% the same team as Gambit since Gosu Pepper didn't come along for the ride.  Although Edward was clearly the better player so they would have had comparable results.  Plus, who gets hyped from results 3 years ago?","replies":[{"poster":"  iClown","date":"2015-03-29T17:38:31.652+0000","up_votes":1,"down_votes":0,"body":"gosu pepper and edward is the same person","replies":[]}]}]}]}]}]},{"poster":"TXN Miasma","date":"2015-03-26T02:50:08.099+0000","up_votes":2,"down_votes":0,"body":"I feel that HKES should definitely be ranked 13th or 14th. They have really shown up to show out and have put on very strong performances over the season and have shown that they can adapt from patch to patch very quickly. Toyz has really changed as a player since season 2 and he shows that he can really play meta picks better than anyone. In the early weeks of the season, he showed how great his mechanics are when he controlled much of the early season with Azir while still drawing multiple bans each game. Then as the meta shifted, he shifted to Liss and Ahri. Dinter's jungle control is insane when gets his hands on Vi or Rek'Sai. GoDJJ has one of the best Sivir mechanics in the world. They have a strong chance of upsetting Yoe Flash Wolves in the playoffs and could easily beat CLG.","replies":[]},{"poster":"Rpikes Ward","date":"2015-03-25T23:25:52.062+0000","up_votes":2,"down_votes":0,"body":"HOW DO U TIE A LEAGUE GAME. CHINA HAS HACKS.","replies":[{"poster":"randomperson200","date":"2015-03-26T01:02:06.592+0000","up_votes":3,"down_votes":1,"body":"They play 2 games versus the same team and when the series goes 1-1 that's their consideration of a 'tie.'","replies":[{"poster":"Voli the Pooh","date":"2015-03-27T17:46:46.933+0000","up_votes":1,"down_votes":0,"body":"ty for explanation","replies":[]}]}]},{"poster":"progamer1122","date":"2015-03-25T23:23:57.556+0000","up_votes":2,"down_votes":0,"body":"what is CIS cuz it says CIS and idk what that means","replies":[]},{"poster":"Varijake","date":"2015-03-25T22:05:44.093+0000","up_votes":2,"down_votes":0,"body":"C9 </3","replies":[]},{"poster":"garrettdson","date":"2015-03-25T20:32:03.011+0000","up_votes":5,"down_votes":4,"body":"TSM Fnatic and H2K can hold their own vs any team.","replies":[]},{"poster":"poonDemonicEgg","date":"2015-03-26T22:44:27.475+0000","up_votes":2,"down_votes":1,"body":"Why is korea ranked so high after their best team lost to a  bottom of the standings team from china at IEM? Did the guy who wrote this article even watch the games?","replies":[{"poster":"Str8Ace180","date":"2015-03-27T05:51:29.271+0000","up_votes":1,"down_votes":0,"body":"because WE changed their roaster just before IEM and if you look at how they've been doing, then you'd know ","replies":[]}]},{"poster":"Mestune","date":"2015-04-13T12:23:27.518+0000","up_votes":1,"down_votes":0,"body":"I'm always surprised how many more Americans are posting here, look at all the upvotes for anything regarding NA being better as opposed to anyone saying well actually we don't really know. In the end China & Korea are most likely far better.\r\n\r\nThat said, personally I think TSM look pretty good right now. EU don't really have a super dominant team, at least UOL and Fnatic are way more interesting to watch. TSM & C9 literally just take the most standard picks possible. :/ ","replies":[]},{"poster":"ˆayy","date":"2015-03-31T23:50:36.462+0000","up_votes":1,"down_votes":0,"body":"TSM and C9 fans are so boring, they almost always win. On the other hand, CLG fans (me), always end up losing important games. Time to change favourites to Unicorns of Love. Woohooo!","replies":[]}]}