{"poster":"Khan Mandoras","date":"2016-07-25T07:21:29.783+0000","title":"Bannen für Verhalten","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":18,"body":"Hey Leute, \r\n\r\nda ich zum ersten Mal gebannt wollte ich etwas zum Verhalten von Spielern schreiben.\r\n\r\nAls erstes wollte klar stellen, dass ich das durchaus nachvollziehen kann, wenn man wegen Hate gebannt wird.\r\nAber...was ich nicht verstehe ist z.B. wenn man restrikted wird, nur seinen eigenen Chatverlauf lesen kann.\r\nMan wird laufend von anderen Spielern proviziert, dazu muss ich sagen, das ich Bronze bin...Da erwartet man eh nicht sondern viel Teamplay.\r\nUnd nat&uuml;rlich rastet man dann schon mal total aus.\r\n\r\nAu&szlig;erdem finde ich es sehr lustig, wenn andere Leute die selbst haten schreiben, dass man eh nicht aufsteigt, wenn man nur am haten ist.\r\n\r\nMan erwartet auf der Elo sowieso keine Wunder mehr...\r\n\r\nAn Riot: Leute bitte &uuml;berarbeitet das Suchtool f&uuml;r den Rankedpool bitte.\r\n\r\nDas Teamplay auf dem Niveau ist einfach nur schrecklich. Dann gibt es die Leute, die absichtlich feeden sogar in den Placements...Scheinbar f&auml;llt das alles nicht unter &quot;Unsportliches Verhalten&quot;.\r\n\r\nWas mich pers&ouml;nlich am meisten an Rankedgames st&ouml;rt m&ouml;chte ich noch los werden:\r\n\r\n1. Man wird mit Leuten gematchtet, die teilweise wesentlich weniger Rankedgames gespielt haben. (habe &uuml;ber 500 gespielt diese Season)\r\n\r\n2. Man verliert st&auml;ndig wegen anderen Lanes das Spiel. (Frustlevel unglaublich hoch) (Erg&auml;nzung: Ich spiele Main Support. Tank vorzugsweise.)\r\n          -Ehrlich gesagt ist das Frustlevel teilweise so hoch, dass ich selbst anfange zu feeden oder zu trollen.\r\n\r\n3. Selbst wenn man alles versucht und z.b. den ADC auf der Botlane versucht zu besch&uuml;tzen wird man daf&uuml;r hart geblamt.\r\n\r\n4. Smartpings helfen nichts.\r\n\r\n5. Die ganze Gruppe muten hilft ebenfalls nichts.\r\n\r\nWas lernen wir daraus? \r\n\r\nDer Support von Riot ist sehr einseitig. \r\nMir w&auml;ren hilfreiche Tipps lieber, als restrikted oder gebannt zu werden.\r\nWas n&uuml;tzt es mir zu wissen, dass ich zu den 7 oder was wei&szlig; ich wie viel % geh&ouml;re, bei denen das Haten nicht aufh&ouml;rt.\r\n\r\nLieber nicht League of Legends spielen.","replies":[{"poster":"eingew","date":"2016-07-25T08:05:08.503+0000","up_votes":6,"down_votes":0,"body":"> Man erwartet auf der Elo sowieso keine Wunder mehr...\n\nJede Elo ist vom Verhalten her etwa gleich. Es werden überall ähnlich viele Reports gesammelt.\n\n> Das Teamplay auf dem Niveau ist einfach nur schrecklich. Dann gibt es die Leute, die absichtlich feeden sogar in den Placements...Scheinbar fällt das alles nicht unter \"Unsportliches Verhalten\".\n\nEs wird sogar härter bestraft, als dein Flame. Allerdings ist das Tool, welches absichtliches Feeden bestraft noch nicht vollkommen ausgereift und arbeitet noch nicht perfekt.\nWenn dich das Teamplay auf deiner Elo stört, ist das dein Fehler. Deine Mitspieler werden nach deinem Skill gewählt. Willst du also bessere Mitspieler musst du deinen eigenen Skill verbessern.\n\n> Man wird mit Leuten gematchtet, die teilweise wesentlich weniger Rankedgames gespielt haben. (habe über 500 gespielt diese Season)\n\nErfahrung ist absolut keine valide Bewertung von Skill. Man kann weniger als du spielen und besser sein und mehr als du spielen und schlechter sein. Natürlich wirst du mit Leuten gematcht, die mitunter weit weniger oder gar weit mehr Rankeds als du spielen - weil dies kaum einen Einfluss auf deren Skill hat.\n\n> Man verliert ständig wegen anderen Lanes das Spiel. (Frustlevel unglaublich hoch) \n\nDas ist so nicht ganz richtig. Man kann nicht jedes Spiel gewinnen, so viel ist klar, aber wenn du verlierst, dann ist es dein Fehler. Du musst davon ausgehen, dass du dich konstant an die 50%ige Winrate annäherst. Andernfalls wäre dieses Spiel nicht kompetitiv, oder du ein extrem guter Spieler (und wenn dem so wäre, wären schlechte Mitspieler kein Problem für dich). Also was ich sagen will: Wenn du verlierst waren es deine Fehler. Die Fehler der anderen sind irrelevant für deinen Rang o.ä..\n\n> -Ehrlich gesagt ist das Frustlevel teilweise so hoch, dass ich selbst anfange zu feeden oder zu trollen.\n\nWas womöglich einer der Hauptgründe für deine Losses ist: Die Motivation. Dein Rang spiegelt deine Spielweise wieder. Wenn du damit unzufrieden bist, sind es nicht deine Mitspieler, die dich carryn müssen, sondern du, der seine Spielweise anpassen muss.\n\n> Selbst wenn man alles versucht und z.b. den ADC auf der Botlane versucht zu beschützen wird man dafür hart geblamt.\n\nSo wie ich deine von dir beschriebenen Verhaltensweisen als asozial empfinde, so musst auch du damit Leben, dass viele deiner Mitspieler derartiges Verhalten an den Tag legen. Auch ich sehe sowas in meinen Spielen. Dafür gibt es den Mute und den Reportbutton, die, wie du am eigenen Leib erfahren hast, durchaus gute Dienste leisten. Menschen sind undankbar und egoistisch. Das ist nun mal so und daran kannst du vermutlich kaum etwas ändern.\n\n> Lieber nicht League of Legends spielen.\n\nWenn dir dieses Hobby keinen Spaß mehr macht ist das durchaus eine absolut legitime und sinnvolle Reaktion.\n\nAndererseits könnte man auch sagen, dass du dich erst daneben benimmst und dann vor den daraus resultierenden Problemen davon läufst. Geht mir halt grad so durch den Kopf. Ich glaube irgendwie, dass du mehr profitieren würdest, wenn du dich bessern würdest. Wenn du jetzt einfach gehst, dann bleibst du für immer mit einer letztendlich nicht ganz realistischen Sichtweise zu der Situation durchs Leben und hast absolut nichts daraus gelernt.\n\nAndererseits ist weggehen vermutlich angenehmer für dich. Deine Entscheidung.","replies":[{"poster":"Tommahawk1","date":"2016-07-25T17:55:24.623+0000","up_votes":1,"down_votes":1,"body":"Nicht jeder lose ist auch gleich ein Fehler des Einzelnen. Teamplay steht im Vordergrund. Gefeedete lanes sind nicht mehr 1 gegen 1 zu retten und viele haben einfach keinen Sinn für´s Zusammenspiel.Ist eben so. Ein Smurf ist für mich ein Spieler der auf seiner Elo keinen Spass mehr hat.","replies":[{"poster":"eingew","date":"2016-07-25T18:35:59.432+0000","up_votes":2,"down_votes":0,"body":"> Nicht jeder lose ist auch gleich ein Fehler des Einzelnen.\n\nDas ist grob gesagt zwar irgendwo richtig, führt für uns aber gerne zu einer fehlerhaften Bewertung der Situation.\n\nWenn man nämlich mit der Einstellung an die Bewertung eines Spiels geht, dass man es sowieso nicht hätte gewinnen können, dann werden einem die eigenen Fehler schneller egal. Aber die eigenen Fehler dürfen einem nicht egal werden, denn dann unterstützt man sie nur, bessert sich nicht und hindert sich selbst daran, kompetitiven Erfolg zu erlangen.\n\nWenn einem der egal ist, okay, aber dann darf man sich auch nicht davon frusten lassen, dass man halt nicht aufsteigt.\n\n> Teamplay steht im Vordergrund. \n\nNatürlich muss man mit dem Team gewinnen, wichtig dabei ist aber, dass man das nicht allzu streng sieht. Man darf sich unter keinen Umständen auf sein Team verlassen. Denn dann geht man dazu über, dass man gecarryt werden will und das ist eben keine gute Sache, im Gegenteil, das hindert einen am Aufstieg. Natürlich darf man nicht gegen sein Team spielen... aber man muss damit rechnen, dass das Team das mit dem Teamplay vielleicht sogar deutlich anders definiert als man selbst.\n\n> Ein Smurf ist für mich ein Spieler der auf seiner Elo keinen Spass mehr hat.\n\nDann musst du dich daran gewöhnen, dass du viele Missverständnisse aufwirfst, denn in der Allgemeinen Definition ist ein Smurf einfach nur ein zweiter (oder dritter, vierter, usw...) Account.","replies":[]}]},{"poster":"DrCrane74","date":"2016-07-28T14:07:44.043+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=63qEA1ma,comment-id=0003,timestamp=2016-07-25T08:05:08.503+0000)\n Es wird sogar härter bestraft, als dein Flame. Allerdings ist das Tool, welches absichtliches Feeden bestraft noch nicht vollkommen ausgereift und arbeitet noch nicht perfekt.\n\nFinde ich gut, dass Du das so offen einräumst. Das absichtliche, respektive in Kauf genommene Feeding von Bots in ARAM ist aktuell unterträglich. Wäre gut, wenn hier was passiert.\n\nAnsonsten gilt: Never make your team type! :D","replies":[]}]},{"poster":"Thâya","date":"2016-07-25T07:29:05.437+0000","up_votes":6,"down_votes":1,"body":"Hallo :)  Das Du deinen eigenen Chatverlauf nur siehst, hat wohl einfach damit zu tun, das DU alleine für DEIN Verhalten verantwortlich bist.  Und die Mute Funktion hilft sehr wohl, das Spiel bietet einiges an Möglichkeiten ohne Chat mit dem  Team zu komunizieren. Das Problem ist einfach, das viele Spieler enfach neugierig sind und sich somit auf die Provokationen anderer einlassen.\n\nWenn ich merke das mein Team nicht gut drauf ist, dann hilft mir-/ Mute all, ich habe meine Ruhe und haue auch ab und an ein WP raus.  \n\nNicht böse gemeint, aber ich bin froh das die Report Funktion greift ;)","replies":[{"poster":"Khan Mandoras","date":"2016-07-25T07:49:03.092+0000","up_votes":2,"down_votes":5,"body":"Lass mich raten, du spielst sicher in einer höheren Elo ?\nSo einfach ist das nicht...\n\nIch haue auch mal ein WP raus oder gebe den Leuten ein Teamplay am Ende vom Spiel.\nDas passiert leider nur selten...Jetzt frag dich mal warum.","replies":[{"poster":"CYPHΕR","date":"2016-07-25T08:02:09.023+0000","up_votes":2,"down_votes":1,"body":"Es ist schlichtweg egal was die anderen schreiben oder tun. Damit das Verhalten anderer Spieler bestraft werden kann gibt es die Reportfunktion. Wenn du selber aber negativ auffällst (und dabei ist es egal aus welchen Gründen), dann wirst du ebenso dafür bestraft.\n\nDieses Kindergartenspiel mit \"ja aber der hat doch angefangen!!\" das Alle dann immer als Begründung bringen...","replies":[{"poster":"Khan Mandoras","date":"2016-07-25T08:08:10.120+0000","up_votes":2,"down_votes":4,"body":"So so Kindergartenspiel...\n\nWas glaubst du wie oft ich wegen \"no teamplay\" \"flaming\" und \"unnecessary feeding\" reportet habe.\n\nMeinste das war alles grundlos oder wie?","replies":[{"poster":"hshtagniemehrcdu","date":"2016-07-25T08:22:06.920+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Khan Mandoras,realm=EUW,application-id=KYnfKGf0,discussion-id=63qEA1ma,comment-id=0000000000000000,timestamp=2016-07-25T08:08:10.120+0000)\n>\n> So so Kindergartenspiel...\n> \n> Was glaubst du wie oft ich wegen &quot;no teamplay&quot; &quot;flaming&quot; und &quot;unnecessary feeding&quot; reportet habe.\n> \n> Meinste das war alles grundlos oder wie?\n\nIm wesentlichem: Ja.\n\nAbsichtliche Feeder hatte ich während meiner eigenen Zeit in Bronze Silber (ein paar Monate zusammen+-) keine.\nIch schätze du reportest einfach alle die öfters sterben.\nDas Leute unnötige Tode sterben, liegt nunmal daran dass du Bronze bist.\nPassiert im Gegnerteam aber genau so oft....\nÜbrigens: Schau dir doch mal deine Matchhistory an. Wer im Glaushaus sitzt....\n\nNo Teamplay oder \"der macht nicht was ich will\" ist gar nicht mal in den Report-Kategorien aufgeführt.\n\nEinzig und alleine der regelmäßigen \"flamer\" Report könnte wohl etwas bringen...\nUnd daran, dass du viele Flamer hast, zweifele ich nach deinem Post nicht eine Sekunde lang.\nDu wirst verdammt viele Leute anpissen mti deinem Verhalten ingame..","replies":[]},{"poster":"legofreak1","date":"2016-07-25T08:16:58.334+0000","up_votes":4,"down_votes":0,"body":"Deine Mitspieler haben dich ebenfalls nicht ohne Grund gemeldet. Diese haben dich geflamed und provoziert, du hast zurückgeflamed, ihr habt euch alle falsch verhalten und am Ende bekommt ihr alle eine Strafe dafür.\n\nIm momentanen Strafensystem ist übrigens nach der CR nur ein einzelner temporärer Bann über 14 Tage vorgesehen, der nächste Bann wird permanent sein. Sobald dieser Bann also ausgelaufen ist, solltest du dich hart zusammenreißen und dein Verhalten stark bessern, beim nächsten Fehlverhalten kann dein Account wieder gebannt sein, dann aber für immer und RIOT macht dort keine Ausnahme, du bist gewarnt worden und kennst die Konsequenzen.","replies":[]}]}]},{"poster":"Thâya","date":"2016-07-25T08:05:42.331+0000","up_votes":2,"down_votes":0,"body":"Ich bin Bronze 3, also dort wo sich sehr sehr viele Spieler befinden.  Ich habe einfach eine andere Grundeinstellung, zum einen ist und bleibt es ein Spiel, welches ich persönlich spiele um zu entspannen zum anderen juckt es mich kaum bis gar nicht was andere an Beleidigungen raushauen, kurz , es tangiert mich nicht mal peripher ;)   (Reported werden sie trotzdem =)  )\n\nWenn es ist dich so frustriert, könnte es Hilfreich sein mal einen Abstand von LoL zu nehmen, damit meine ich nicht nur den Bann zu nutzen, sondern einfach mal länger nicht zu spielen.  Gibt doch nun Pokemon Go, also raus an die Frische Luft und Pokemons jagen ;D\n\nNun mal im Ernst, du solltest dir vielleicht überlegen ob das reinsteigern in die Provokationen der anderen, wirklich einen Sinn machen, oder aber Du einfach versucht drüber zu stehen und einfach dein Game machst.\n\nIch wünsche Dir viel Erfolg beim reflektieren Deiner Spiele und Gewohnheiten !","replies":[]}]}]},{"poster":"Humpelstilzche","date":"2016-07-25T09:11:44.626+0000","up_votes":4,"down_votes":0,"body":"> Aber...was ich nicht verstehe ist z.B. wenn man restrikted wird, nur seinen eigenen Chatverlauf lesen kann.\n\nWeil es um DEIN Verhalten geht. Es geht weder darum wer angefangen hat, noch wer am schlimmsten war noch darum, warum du geflamet hast. Insbesondere letzteres weißt du vermutlich selbst am besten. Da all diese Dinge irrelant sind (nichts davon ist eine Rechtfertigung!), wird dir das einzige gezeigt was für die Verbesserung deines Verhaltens relevant ist: Dein eigenes Verhalten. \n\n> Und natürlich rastet man dann schon mal total aus.\n\nSo natürlich wie du das hier darstellst, ist das aber nicht. Wäre dem so, wären alle Spieler längst gebannt, was offensichtlich nicht der Fall ist. Ein gewisses Maß an Frustration oder Ärger in LoL ist sicherlich normal, dies an anderen Spielern auszulassen jedoch nicht.","replies":[]},{"poster":"HHaie tabbian","date":"2016-07-25T07:40:07.288+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Khan Mandoras,realm=EUW,application-id=KYnfKGf0,discussion-id=63qEA1ma,comment-id=,timestamp=2016-07-25T07:21:29.783+0000)\n> Und natürlich rastet man dann schon mal total aus.\n\nWieso ist das natürlich? Vielleicht solltest du dich mal in Gelassenheit üben. Das kann ziemlich weiterhelfen.","replies":[{"poster":"Khan Mandoras","date":"2016-07-25T07:46:04.354+0000","up_votes":1,"down_votes":6,"body":"Du willst also sagen, dass dich noch nie niemand so hart provoziert hat das du nicht ausgerastet bist? \n\nAußerdem habe ich es mit Gelassenheit versucht...Das hilft einfach nicht.","replies":[{"poster":"eingew","date":"2016-07-25T17:46:35.913+0000","up_votes":2,"down_votes":0,"body":"Gelassenheit hilft nicht?\n\nWieso hast du dann mit dem austicken einen Ban bekommen?","replies":[]}]}]},{"poster":"Maexle","date":"2016-07-25T07:45:15.136+0000","up_votes":5,"down_votes":1,"body":"Ich finde es lustig und gleichzeitig traurig, dass du flamen und haten als normal bzw. auswegloses Mittel darstellst… Das ist definitiv nicht so. \nNatürlich kann ich es verstehen, dass du frustriert bist, weil du mit deinen über 500 Spielen immernoch Bronze bist. Ich muss dir aber auch sagen, dass es nicht für dich spricht, dass du so viele Spiele gemacht hast und immer noch da rumhängst. Es zeigt eher, dass du genau in diese Elo gehörst. \n{{champion:17}}","replies":[{"poster":"Khan Mandoras","date":"2016-07-25T07:54:07.751+0000","up_votes":2,"down_votes":5,"body":"Das liegt man fehlenden Teamplay in der Liga...\nMan muss immer alles alleine reißen?\nVor allem wenn man Main Support ist?\nDu bringst damit überhaupt keine Argumente ein.","replies":[{"poster":"legofreak1","date":"2016-07-25T08:13:16.926+0000","up_votes":4,"down_votes":0,"body":"Folgendes Gedankenspiel zeigt sehr gut, warum du selber der entscheidende Faktor bist, in welcher Liga du dich befindest. Auf kurze Zeit liegt es an deinem Team und dem der Gegner, manche Spiele *kann* man einfach nicht carrien, auf lange Zeit wird dieses Szenario aber eintreten. Da du 500 Rankedgames bestritten hast und die ganze Zeit in der selben Liga bist, kann man davon ausgehen, dass diese deinem Skilllevel entspricht.\n\n> [{quoted}](name=drexxsack,realm=EUW,application-id=ip27PlEH,discussion-id=GuQHbIsL,comment-id=0000,timestamp=2016-01-02T20:49:54.175+0000)\n>\n> Wir treffen jetzt mal ein paar Annahmen, damit es anschaulicher ist.\n> 1\\. Zwei Teams haben 4 ihrer 5 Slots belegt.\n> 2\\. Es gibt 3 Spielstärken und alle belegen 1/3 der Spielerschaft\n>\n> Stärker als der Schnitt\n>\n> Durchschnitt\n>\n> schlechter als der Schnitt\n>\n> Die Teams sehen folgendermaßen aus:\n> Dein Team\n>\n> 1\\. Guter Spieler\n> 2\\. Schlechte Spieler\n> 3\\. Durchschnitt\n> 4\\. Durchschnitt\n> 5\\. Du\n>\n> Gegnerteam\n> 1\\. Guter Spieler\n> 2\\. Schlechte Spieler\n> 3\\. Durchschnitt\n> 4\\. Durchschnitt\n> 5.\n>\n> Nun sieht es folgendermaßen aus. Spieler 5 wird nun im Schnitt zu je 33% mit einem der Spielertypen belegt. Dein Slot hingegen ist zu 100% fest. Bist du schlechter als der Schnitt, ist dein Team in 66% der Fälle schwächer. Du wirst so also öfter verlieren.\n> Bist du durchschnittlich, sind 33% der Gegner schwächer als ihr, 33% so gut wie ihr und 33% stärker als ihr. Du wirst hier auf etwa 50% Winrate kommen.\n> Bist du hingegen stärker als der Schnitt deiner Liga, wirst du in 66% der Fälle, das stärkere Team haben.\n> Das ganze ist jetzt natürlich ein sehr grobes Modell, allerdings bleibt das Prinzip gleich.\n\nBist du besser als der Durschschnitt, wirst du auf Dauer aufsteigen, bist du schlechter, wirst du auf Dauer absteigen.","replies":[{"poster":"Khan Mandoras","date":"2016-07-25T08:36:49.354+0000","up_votes":2,"down_votes":3,"body":"Ist zumindest interessant zu wissen und was passiert eigentlich wenn man von B5 nach B1 aufsteigt, dann wieder nach B4 absteigt und nach B1 wieder aufsteigt und jetzt wieder auf B3 ist?\n\nIst man dann tatsächlich besser oder schlechter als der Durchschnitt oder doch nur Durchschnitt?\n\nIn der Logik muss irgendwo ein kleiner Fehler sein :D","replies":[{"poster":"Skagerak","date":"2016-07-25T09:01:11.738+0000","up_votes":2,"down_votes":0,"body":"Am aller wichtigsten ist das du endlich einsiehst das du schlecht bist und es nicht an deinen Teammates liegt das du verlierst. Bevor du das nicht einsiehst bringen die ganzen guten Ratschläge die du hier bekommt rein gar nichts. Du hast eben keinen Willen dich zu verbessern dein Team wird es aber auch nicht. Wenn du nach 500 ranked games immer noch in Bronze steckst dann muss dir doch mal auffallen das du irgendwas falsch machst (der Post von Legofreak zeigt das sehr gut und du kannst das drehen wie du willst das stimmt). Ich hab auch einen Kumpel der zockt seid  der Beta also 2 Jahre mehr als ich und zockt an sich schon mehr als ich trotzdem ist er Silber 5 und ich hab schon 2 Accounts auf Diamant. Der einzige Unterschied ist das ich den Willen habe mich zu verbessern und mir keine Ausreden für einen Loss suche. Falls es dir irgendwas bringt ich hab in Bronze 5 angefangen ich weiß also wie hart das is es geht aber.","replies":[{"poster":"Khan Mandoras","date":"2016-07-25T09:21:29.302+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Skagerak,realm=EUW,application-id=KYnfKGf0,discussion-id=63qEA1ma,comment-id=00020000000000000001,timestamp=2016-07-25T09:01:11.738+0000)\n>\n> Am aller wichtigsten ist das du endlich einsiehst das du schlecht bist und es nicht an deinen Teammates liegt das du verlierst. \n\n\nAlso heißt das ich bin automatisch schlecht, wenn ich Bronze bin oder wie ?\nNur weil ich ein paar mehr Games gespietl habe und das meine erste Season ist, in der ich ernsthaft spiele?\n\nSorry, aber wegen Kommentaren wie deinem rege ich mich auf...","replies":[{"poster":"Humpelstilzche","date":"2016-07-25T09:48:49.561+0000","up_votes":5,"down_votes":1,"body":"> Also heißt das ich bin automatisch schlecht, wenn ich Bronze bin oder wie ?\n\nDas hängt von der Definition von \"schlecht\" ab. Es gibt Spieler die sagen, dass alles unter Diamond 1 schlecht ist, weil er dort der Bereich kommt, wo nur Spieler mit Talent (und nicht nur viel Zeit) weiterkommen können. Andere, darunter auch ich, gehen dabei lieber mit Zahlen vor. Wenn du so gut bist wie der Durchschnitt bist du durchschnittlich, wenn du besser bist, bist du überdurchschnittlich, wenn du schlechter bist, bist du unterdurchschnittlich. \n\nDer Durchschnitt in LoL liegt irgendwo bei Silber 4. Alles darunter ist halt unterdurchschnittlich, also auch du. \n\nOb du das jetzt als \"schlecht\" betrachten willst ist im Prinzip deine Sache. Fakt ist dass du unterdurchschnittlich bist....was du mit dieser Info anfängst und wie schlimm du das findest, ist deine Sache. \n\n> Nur weil ich ein paar mehr Games gespietl habe und das meine erste Season ist, in der ich ernsthaft spiele?\nSorry, aber wegen Kommentaren wie deinem rege ich mich auf...\n\nWieso? Warum regst du dich darüber auf? Ist es so tragisch für dich einzugstehen dass du in einem Spiel nicht sonderlich gut bist? Wenn du noch nicht so lange spielst, ist das doch völlig normal. Jeder der ein Newbie ist ist schlecht, da ist nichts verkehrt dran und es bringt auch nichts das zu leugnen. \nIch hab vor kurzem wieder angefangen zu joggen und hab echt so meine Mühe 1km ohne Pause zu laufen. Das liegt daran, dass ich eben erst vor kurzem wieder damit angefangen habe. Aber dieser Grund ändert nichts daran, dass ich momentan echt ein schlechter Läufer bin, im Vergleich zu anderen. Muss ich jetzt darüber ärgern? Hat jemand der sagt dass ich schlechter Läufer bin Unrecht?\n\nGenauso ist das bei dir auch. Du bist ein unterdurschnittlicher Spieler, da gibt es keinen Zweifel dran. Aber wen scherts? Da ist überhaupt nichts verkehrtes dran, das ist weder eine Schande noch irgendwas schlechtes. Die einzige Schande wäre, sich etwas vorzumachen. Ich bin ein schlechter Läufer, du bist ein schlechter Spieler. Wen juckts? Wenn wir wollen dass sich das ändert, müssen wir eben an uns arbeiten, bis wir nicht mehr schlecht sind.","replies":[{"poster":"eingew","date":"2016-07-25T17:50:17.335+0000","up_votes":2,"down_votes":0,"body":"Wenn man es ganz streng statistisch betrachten will, dann kann man sagen, dass die mittleren 50% \"normal\" sind, alles darunter oder darüber ist schon relativ außergewöhnlich. Dementsprechend ist alles zwischen Gold 5 und Bronze 1 \"normal\" und alles darunter eben außergewöhnlich gut oder schlecht.","replies":[]},{"poster":"Zyten","date":"2016-07-25T09:57:59.886+0000","up_votes":1,"down_votes":1,"body":"Du beschreibst es genau richtig. Dem kann man kaum was hinzufügen.\n\nFür mich gibt es gute Spieler frühestens ab Master Tier. Damit ist alles darunter zwar nicht schlecht, aber nicht so gut wie die höhere Elo. Ich selbst sehe mich als schlechten Spieler, da ich jedes Spiel viele Fehler mache. Da ist mir meine Elo egal. Auch wenn ich über dem Durchschnitt von allen Spielern auf EUW bin. Jeder Spieler macht Fehler und jeder Spieler kann besser werden. Man muss nur dementsprechend viel Zeit investieren.","replies":[]}]},{"poster":"Skagerak","date":"2016-07-25T10:02:15.364+0000","up_votes":1,"down_votes":0,"body":"Ich persöhnlich finde das jeder der nicht Dia 1 oder höher ist nicht gut ist. Aber 500 games sind halt echt schon eine große Menge an games. Wenn es für dich ok ist das du in Bronze bist ist das natürlich gut dann musst du dich auch nicht schlecht fühlen. Aber wenn du aufsteigen willst musst du dir eben eingestehen das du nicht gut bist sonst würdest auch keine 500 games Brauchen um aus Bronze rauszukommen. Wenn es deine erste Season ist ist das natürlich ok es gibt kaum welche die in der ersten Season Gold kommen oder höher. Aber wenn du eben aufsteigen willst musst du was dafür tun und dazu zählt eben nicht einfach nur wild drauf los spielen. Du musst nach deinen Fehlern suchen schau dir guides an YTvideos oder Streams und versuch dir davon Sachen zu merken und diese auf dein Gameplay zu übertragen. Das Problem an der Sache ist eher das du deine Fehler wegen deiner Attitude gar nicht erkennst das es laut dir nur an deinem Team liegt du versuchst so also gar nicht aufzusteigen sondern du suchst dir einfach Ausreden das du in Bronze bist. Ich hab das auch gemacht und ich weiß das man eben nicht sehen will das man nicht gut ist sobald ich aber mal meine eigenen Fehler hinterfragt habe und aufgehört habe die Schuld aufs Team zu schieben bin ich extrem schnell aufgestiegen. Der beste Tipp den man dir eben geben kann ist \"Spiel um dich zu verbessern und nicht um zu gewinnen\". \n\nIch will dich mit meinem Post nicht beleidigen du kannst ihn auch einfach ignorieren ich versuche lediglich dir zu helfen aufzusteigen. Natürlich kommt es teilweise hart rüber ist aber leider die Wahrheit.","replies":[]},{"poster":"D4RKEVA","date":"2016-07-25T12:47:30.252+0000","up_votes":1,"down_votes":1,"body":"Yep wenn du bronze bist , bist du schlecht. Das ist keine beleidigung sondern eine Tatsachе.\n\nUnd \"ein paar games\" sind nicht 500\n\nIch war season 3 bronze 4 und war nach 50 games bronze 2) damals hatte ich 0 ahnung vom game.\n\nJetzt brauche ich ca 50 games um von bronze 2 nach gold 3 zu kommen.\n\n\n\nIch hab übrigens in 4 seasons nur 300 rankedgames insgesamt gemacht, nichts im cergleich zu deinen 500 und trotzdem bin ich deutlich höher(wenn du natürlich erst seit z.b. 2 seasons spielst hast du halt weniger gesamt erfahrung","replies":[]}]}]},{"poster":"Maexle","date":"2016-07-25T08:46:17.697+0000","up_votes":2,"down_votes":1,"body":"Naja da du offensichtlich nicht gut genug warst dich in Bronze 1 zu halten oder aufzusteigen, aber immer aus Bronze 4-5 aufsteigst, gehörst du vermutlich Bronze 3 oder vielleicht noch Bronze 2…\nIm Ernst: wenn du wirklich besser bist als Bronze, dann kommst du locker raus. Egal auf welcher Position… \n{{champion:17}}","replies":[]}]}]},{"poster":"Zyten","date":"2016-07-25T08:21:26.112+0000","up_votes":3,"down_votes":0,"body":"Auch als Main Support kann man gut aufsteigen. Das mache ich bereits seit Seasons.\nDu kannst als Support dein Team carrien. Man muss halt nur lernen wie.\nUnd falls du jetzt einbringen willst, dass das in Bronze nicht geht: Ich habe Season 3 in Bronze angefangen und Season 4 in Silber. Jedes Mal habe ich es geschafft eine Liga aufzusteigen. Jetzt bin ich aktuell wieder Platin. Meine Mainrollen sind Support und Mid. Davon bekomme ich meistens Support. Und dennoch bin ich aus der Elo rausgekommen, meistens in unter 200 Games.\n\nSchaue auf deine Fehler. Nimm deine Games auf. Wenn du stirbst, schau warum. Was hättest du anders machen können. Ignoriere die Fehler deiner Teammates. Auch in Master wird ein Teammate facechecken und sterben. Das passiert nun mal. Aber wenn du besser als deine aktuelle MMR spielst, wirst du Games carrien und irgendwann aufsteigen.","replies":[{"poster":"Khan Mandoras","date":"2016-07-25T08:29:20.999+0000","up_votes":2,"down_votes":5,"body":"Wie soll man denn als Support carrien?\n\nEin paar Tipps habe ich ja schon bekommen, wenn der ADC schlecht ist soll man halt Mid helfen. Oder halt komplettes itembuild tauschen, wenn man merkt das es nicht gut läuft.","replies":[{"poster":"Maexle","date":"2016-07-25T08:57:27.817+0000","up_votes":4,"down_votes":1,"body":"Ein erster und entscheidender Schritt wäre auf jeden Fall deine Haltung zu ändern…\n{{champion:17}}","replies":[{"poster":"Khan Mandoras","date":"2016-07-25T09:00:17.777+0000","up_votes":3,"down_votes":0,"body":"Ist ja gut...vielleicht habe ich die falsche Motivation an den Tag gelegt.","replies":[{"poster":"Humpelstilzche","date":"2016-07-25T09:33:04.461+0000","up_votes":3,"down_votes":0,"body":"Na das ist doch schon mal was. Dieser Post den du grade geschrieben hast ist vermutlich der wichtigste von allen Sachen die du hier im Forum geschrieben hast. Warum? Weil er dich von der Mehrheit der Leute abhebt, die hier über ihren Rang jammern. Die meisten die wilde Elo-Hell-Verschwörungstheorien aufstellen und ihr Team dafür blamen dass sie nach 3000 Games immer noch Bronze 4 sind, explodieren förmlich wenn man ihnen nahelegt, dass es möglicherweise an ihnen selbst liegt. \n\nDass du bereit bist einzugstehen, dass du vlt an deiner Einstellung arbeiten musst, unterscheidet dich schonmal von all diesen Leuten, und das ist gut!\n\nEs ist halt einfach ein Fakt dass jeder Spieler mit einer gewissen Menge an Spielen (>100-200) genau da landet, wo er hingehört, unabhängig von der Existenz von Feedern, Flamern, Afklern, Trollen und was in LoL noch so alles existiert....da diese Spieler stets in beiden Teams auftauchen können. Sollte ein einzelner Spieler (zum Beispiel du) tatsächlich besser sein, wird sein Team im Schnitt immer einen Vorteil haben, was dazu führt dass man mehr als 50% der Matches gewinnt und aufsteigt. Steigt man nicht auf, liegt das daran, dass man schlicht und einfach nicht besser ist. \n\nDas einzugstehen ist, je nachdem wie wichtig einem der eigene Skill ist, schwer. Es ist natürlich viel einfacher und befriedigender die Schuld bei den anderen zu suchen. Aber außer dass man damit sein Ego streichelt, bringt das halt nichts. Wer sich auf die Fehler anderer konzentriert bemerkt seine eigenen nicht und kann deswegen nicht (oder nur sehr langsam) besser werden. \n\nFakt ist: Wer besser ist steigt auf, egal in welcher Rolle. Erst gestern war wieder ein Spieler im englischen Forum, der einen Smurf hochgelevelt hat und innerhalb von weniger als 200 Spielen Diamond erreicht hat, trotz der Tatsache dass er sich durch die low-elo-Regionen, wo angeblich kein Teamplay existiert, durchkämpfen musste. Da er tatsächlich besser als diese Spieler, hat er auch diese Spiele gewonnen. \nDieser Typ ist auch kein Einzelfall, ganze Armeen an Streamern, Youtubern und Proplayern haben das schon hunderte Male demonstriert: Wer wirklich besser ist, kann nicht aufgehalten werden und landet am Ende wieder in der Liga, in die er gehört. \n\nWie schafft man das? Das wichtigste ist zu wissen, dass Aufmerksamkeit eine limitierte Ressource ist. Jemand der seine ganze Aufmerksamkeit darauf richtet die Fehler seiner Mitspieler zu analysieren oder ihnen die Schuld zu geben, fokussiert sich nicht auf sich selbst. Letzteres ist aber zwingend notwendig um besser zu werden. Skill in LoL kann als \"Fehler die man nicht macht\" betrachtet werden. In jedem Spiel trifft man tausende oder millionen kleiner Entscheidungen. Manchmal so große Entscheidungen wie \"Mache ich jetzt Dragon oder lieber den Tower?\", meistens kleine Dinge wie die Millesekunde in der man sich entscheidet einen Lasthit anzusetzen. \nHäufig trifft man hierbei falsche Entscheidungen und diese zu erkennen und zu beheben, ist die beste (und im wesentlichen einzige effektive) Methode besser zu werden. Wer all seine Aufmerksamkeit darauf verschwendet darüber nachzudenken warum die Teammates Schuld am ausbleibenden Erfolg sind, kann dies nicht tun. \n\nDaher ist es wichtig sich auf seine eigenen Fehler zu konzentrieren. Klar sind manchmal auch die Teammates Schuld, nicht jedes Spiel ist gewinnbar, egal wie gut man ist, selbst Progamer erreichen auf Smurfs \"nur\" Winratios von 80-95%. Dennoch gibt es immer Sachen, die man selbst hätte besser machen können. Und sich auf diese Dinge zu konzentrieren....das ist, wie man besser wird und wie man auch garantiert aufsteigen wird.","replies":[{"poster":"Khan Mandoras","date":"2016-07-25T09:51:55.972+0000","up_votes":2,"down_votes":2,"body":"Trotzdem ist und bleibt es Teamspiel und es macht mir mehr Spaß zusammen zu gewinnen als ganz alleine. \n\nUnd es gibt trotzdem in 50% der Fälle diese Momente in denen ich denke, du bist wirklich nicht schuld, wenn wir verlieren. Das war auch in WoW-Raids der Fall, wenn man genau weiß ich mache alles richtig, aber mind. einer im Team macht kompletten Unsinn, dann ist der Frust echt ultra hoch. \n\nBeispiel kann ich dafür auch geben: \n\nKlein Khan ist Bot am supporten wir gewinnen unsere Lane, nachdem die andere Botlane wieder da ist kommt der Tp von der Toplane ein gefeedeter Darius...was willste dagegen machen? wenn der Ende Earygame 10 Kills oder mehr geholt hat...\nDann ist das Spiel vorbei.\n\nUnd selbstverständlich bin ich selbstkritsch und schau was ich falsch gemacht haben könnte...vor allem bei den Spielen, die ich verloren habe. Gerade beim Itembuild kann man vllt noch einiges rausholen, aber von der Taktik an sich sage mal zu 80% der Fälle mache ich kaum Fehler. Klar habe ich auch mal einen schlechten Tag, aber das kommt bei jedem vor.\n\nEs kommt auch gerne mal vor das auf der Botlane (wenn ich sie dann mal gewinne) sich 3 -4 Gegner tummeln und im Chat gepingt wird was das Zeug hält, aber mein Team einfach total verplant ist oder zu spät reagiert.","replies":[{"poster":"eingew","date":"2016-07-25T18:24:04.688+0000","up_votes":2,"down_votes":0,"body":"Derjenige, der hier am lautesten gebrüllt hat, dass ihm sein Team nicht gefällt, bist du. Also wie kommst du auf die Idee, damit zu argumentieren, man solle doch in einem Team spielen? Du warst es doch, dem das Vorgehen der Mates so auf den Senkel gegangen ist, dass er tatsächlich eine Strafe bekommen hat. Ich meine, es ist ja nicht so, dass man so eine Strafe einfach so bekommt. Dazu muss man sich schon richtig anstrengen. Dementsprechend warst du es, der sich vehement dagegen gewehrt hat, sich im Team zu benehmen, der stattdessen einen Sport daraus gemacht hat, sich mit dem Team anzulegen.\n\nAlso wer ist hier derjenige, der das Teamspiel nicht als Teamspiel nutzt? Ich sehe absolut nicht den Punkt, an dem du das als valides Argument nutzen kannst. \n\nAls Team muss man eben Kompromisse eingehen. Da musst du, und zwar vor allem du, damit klar kommen, dass du grottige Mitspieler hast und ständig Fehler gemacht werden. Denn wenn du nicht damit klar kommst, dann bist du nicht Teil des Teams und spielst das Teamspiel dementsprechend auch nicht im Team.\n\nDas wichtigste ist dabei vielleicht auch eine bessere Selbstwahrnehmung. \n\nDas wird jetzt hart und du wirst es vielleicht nicht mögen, aber ich sehe es als nötig an, dir jetzt eine Menge Fehler deinerseits aufzuzählen.\n\nDeine Durchschnittliche Killbeteiligung liegt bei 41%. Das ist gerade als Support zu wenig. Du bist einfach zu wenig bei deinem Team und zu oft nur bei deiner Botlane. Wenn du stattdessen die Mid und deinen ADC snowballst, dann ist plötzlich auch der gefeedete Darius nicht mehr schlimm... weil der jetzt von Mid und Bot bedrängt wird. Teamplay! Darf nicht nur 40% der Zeit vorhanden sein. Das ist zu wenig!\n\nDein letztes Build ist ein Trollbuild! Und du redest von Teamplay? Wenn du aufsteigen willst, dann darf ich davon nicht ein einziges Spiel in deiner History finden!\nAuf Braum Dead Mans Plate? Frozen Heart ist die deutlich bessere Alternative. Als Support ist Schaden viel zu nebensächlich, den Schaden, den du mit dem AS Debuff für die Gegner damit verhinderst ist für dich viel wichtiger. Selbes gilt für Leona.\nWenn du den Sightstone nicht mit dem anderen Supportitem verbindest, dann lohnt sich der Ruby Sightstone viel früher... dann hast du auch mehr von der Vision, die du hier auch mehrfach ansprichst.\nWenn du mit Karma mehr als 1k Gold mehr verdienst als dein Itembuild wert ist machst du massiv etwas falsch. Kein Wunder, dass du ständig verlierst, wenn du so eine Attitüde an den Tag legst. Ich habe das Gefühl du willst eher verlieren...\n\nDeine Leona Runen würde ich massiv überarbeiten. Kein AP in die Großen, da kommt 2x Armor und 1x Health Reg rein. In die Marks kommt Armor. In die Seals kommt Health. In die Glyphs kommt nur 5x MR und 4 Mal Mana Reg.\n\nUnd so würde ich all deine Runen überarbeiten. Geh auf ProBuilds.net am besten jede Woche und aktualisiere deine Runen. Das ist das einfachste was du tun kannst um aufzusteigen. Dasselbe gilt für Masteries.\n\nDu stirbst zu oft. Versuch jedes Spiel mindestens 1 Mal seltener zu sterben. Leonas First Blood ist stark. Du solltest das mindestens doppelt so oft bekommen, wie du es jetzt schaffst.\n\nDu machst zu wenige Objectives. Du bist zu selten an Towern und Inhibs beteiligt. Dein Baron ist okay... aber okay reicht eigentlich nicht. Wenn du richtig carryn willst musst du bessere und regelmäßigere Baroncalls machen. Du machst auch deutlich zu wenige Drakes. Der aktuelle Drake-Buff ist so stark und feedet auch noch dein ganzes Team, was den gefeedeten einzelnen Gegner noch weniger gefährlich erscheinen lässt.\n\nDu bekommst zu wenig Gold in deinen Spielen. Da fehlt dir mindestens 1k jedes Spiel. Hol dir mehr davon, mehr Assists, stell dich auch mal ruhig im Late neben deine Mitspieler während sie farmen, farm mit ihnen, du brauchst das Gold genauso wie sie, nur dass du eben weniger auf Lasthits angewiesen bist. Du bist auch immer circa 1 Level zu weit unten, der Farm hilft dir in vielerlei Hinsicht. Kauf dir ruhig als zweites Item Boots, dann bist du viel mobiler.\n\nEin kleines Lob: Deine Vision-aufgabe nimmst du sehr Ernst, was Wards und Pinks angeht hast du gute Stats und auch Wards clearen kannst du gut. \n\nMöglicherweise spielst du zu viele Champions. Versuch mal ein bisschen deine Picks einzuschränken, manchmal ist es besser, sich zu spezialisieren, als alles zu können.","replies":[]},{"poster":"Skagerak","date":"2016-07-25T10:14:41.736+0000","up_votes":1,"down_votes":0,"body":"Naja eine Möglichkeit hättest du eben du kannst einfach 5 Premade spielen wenn du ei paar Leute hast auf die du dich verlassen kannst spiel mit ihnen und du wirst aufsteigen. Wenn du ein Fan von soloq bist bringt dir das nichts. Ich habe es halt durch Duoq geschafft aufzusteigen (mittlerweile spiele ich eigentlich nur solo) ich habe aber silber zum ersten mal durch Duoq erreicht genauso wie gold Platin und Diamant alleine ist es eben einfach schwerer.","replies":[{"poster":"Khan Mandoras","date":"2016-07-25T10:21:50.450+0000","up_votes":1,"down_votes":0,"body":"ich habe eine dynamic preference","replies":[{"poster":"Skagerak","date":"2016-07-25T10:28:27.259+0000","up_votes":1,"down_votes":0,"body":"Es kommt natürlich auch an ob deine Freude sich verbessern wollen. Ich habe auch ein paar Kumpels mit denen ich echt gerne zocke aber nie ins ranked gehen würde weil die nicht gut sind oder ab und zu mal nicht ihr bestes geben. Am besten du suchst dir 1 oder 2 Freunde können auch mehr sein natürlich welche auch tryharden wollen und jedes game ihr bestes geben. Das heißt auch das sie eine Main Rolle haben einen kleinen Championpool und keine Flamer sind oder sonst irgendwie das Spiel negativ beeinflussen. Sei es auch nur wenn Sie im Ts flamen selbst das ist schon ein Grund nicht mit ihnen zu spielen weil Sie dich dadurch auch runterziehen und du dadurch abgelenkt wirst also nicht dein bestes geben kannst.","replies":[{"poster":"Khan Mandoras","date":"2016-07-25T10:42:59.736+0000","up_votes":2,"down_votes":1,"body":"Ich habe einen eigenen Club gegründet und ein versucht ein Ranglistenteam aufzustellen...\nLeider haben davon auch einige nicht so epic gespielt,die habe ich natürlich nicht geflamt.\n\nFinde mal gute Spieler, die so aktiv waren wie ich und zusammen spielen möchten. \nDie meisten haben ja auch Freunde mit denen sie lieber Premade gehen wollen.\n\nAußerdem ist meine Freundesliste schon groß. \nEs war ja auch nicht jedes Spiel total mies.","replies":[{"poster":"Skagerak","date":"2016-07-25T10:55:30.170+0000","up_votes":1,"down_votes":0,"body":"Das schwerste ist eben Leute zu finden die zu einem passen und die gleichen Ziele haben. Ich hab meinen Bruder mit dem ich zusammen zocke deswegen kann ich dir leider nicht sagen wie du so Leute findest. Ich denke aber das man hier im Forum nette Leute findet erstell einfach einen Thread bei Clan und Teams und frag nach Duoa Partnern da melden sich sehr schnell ein paar Leute vl ist da ja jemand dabei mit dem du zocken würdest.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Zyten","date":"2016-07-25T08:59:11.884+0000","up_votes":1,"down_votes":0,"body":"Spiele Supportchampions, die nicht extrem von deinem Team abhängen und alleine carrien können.\nDu solltest also Supports wie Janna und Soraka eher rauslassen, da beide eher Passiv sind und nicht unbedingt Kills vorbereiten können. Zudem muss dein Team wissen, wie man sich damit verhält.\n\nEmpfehlen würde ich an der Stelle Poke und Damagesupports. Beispiele wären hier Karma und Zyra. Karma bietet noch ein wenig CC und kann dem Team mit ner Mantra E immernoch helfen während Zyra einfach einen hohen Damageoutput hat mit dem nicht viele umgehen können. Durch das Mini Rework von Sona ist auch sie recht gut, grade wenn man die Q zuerst maxt. Zwar ist sie nicht mein Spielstil, aber ich sehe zumindest, dass sie Spiele carrien kann.\nDu solltest deinen Fokus aber nicht nur auf die Midlane legen, wenn dein ADC nicht gut spielt. Er muss weiterhin safe auf der Lane bleiben können. Es bringt dir nichts wenn du roamst und dafür dein ADC währenddessen 5x stirbt. Warde also die Umgebung und weise mit Pings drauf hin wo was passiert. \nAllgemein solltest du eine recht gute Map Awareness haben. Dein Team wird nicht oft auf die Minimap schauen. Übernimm also die Rolle für sie und pinge sobald ein Gegner eine Lane verlässt oder auf einer anderen Lane roamt. Als Support kannst du das eher machen, da du dich nicht ums Lasthitten kümmern musst.\n\nAchte darauf wann deine Botlane und die gegnerische Botlane Level 2 erreicht. Wenn ihr schneller seid: Je nach Support engagen oder zonen. Ihr habt einen extremen Vorteil. Als Support kannst du die Lane leicht pushen, damit die Minions schneller sterben und ihr früher das Level-Up bekommt. Die Last-Hits soll dein ADC bekommen, du bereitest du Minions nur vor. Gleiches gilt für Level 6. Wenn du als Support mit deinem ADC einen Power Spike auf Level 6 bekommst (bspw. Ashe als ADC für den Engage oder Leona als Support), dann gilt genau das gleiche wie bei Level 2.\n\nWarde im Voraus wichtige Objectives, die in den nächsten Minuten genommen werden könnten. Wenn du Roamen willst, baue deine Boots schnell aus und roame nicht nur auf der Midlane, sondern mit Mobi-Boots auch auf der Top. Viele erwarten dort keinen Gank und grade mit Supportern wie Karma oder Leona kannst du mit CC schnell einen Kill holen. \n\nDie Supportrolle ist nicht so einfach, wie man sie sich ausmalt. Im Gegensatz zu Season 2 und 3 kommt man ja inzwischen auch dazu Items zu bauen (anders als damals nur mit Healthpotion, Manapotion, Green Ward, Pink Ward, Blue Ward und Cookie zu Beginn des Spiels und maximal Boots im Verlauf des Spiels). Schaue dir VOD's von Spielern aus höherer Elo an, vielleicht auch aus Korea (wobei dort das Spiel sehr anders gespielt wird..). Achte darauf was diese Spieler anders machen und frag dich warum das genau so ist. Häufig gibt es einen Grund warum die Leute genau so handeln.","replies":[{"poster":"Khan Mandoras","date":"2016-07-25T09:13:37.489+0000","up_votes":2,"down_votes":1,"body":"Ich spiel fast nur hard cc mit Leona lvl 7, Braum lvl 5. Sona, lvl 5\nVor allem mit Leona engage ab Stufe 2 direkt...leider sind 90 % der ADc's zu langsam in ihrer Reaktion.\n\nWegen den Wards: ich warde immer...ich schreibe sogar manchmal dem Adc, das er warden soll, wenn es nicht gemacht hat.\nOder \"we need more vision\" so pauschal an alle.\n\nIch finde es auch immer lustig wie die Leute behaupten das Bronze-Spieler alle Noobs sind.\nWenn man mal bedenkt wie viel Smurfs immer dabei sind.\n\nBtw. habe ich viele andere Champs versucht und einige wie z.b. Shen kann ich ganz gut, gerade zum supporten hammer gut wegen der Ult. Zu 50% der Fälle kommt dann im Chat ein \"Tank Support pls\" oder am Ende, wenn es mal schief geht, sowas nettes wie \"We had no support\"\n\nAm Ende bin ich auch nur ein Mensch und man kann nicht jedes Spiel gewinnen, das kapiere ich doch. Aber es wäre cool, wenn es auch meine Mitspieler kapieren würden.","replies":[{"poster":"Zyten","date":"2016-07-25T09:32:17.989+0000","up_votes":1,"down_votes":0,"body":"Der Mastery Level sagt nicht all zu viel aus. Das zeigt nur, dass du ein paar Spiele mit dem Champ gespielt hast. Mit Braum hast du eine 32% Winrate. Das ist aussagekräftiger als die Champion Mastery. Behalte Leona und Sona bei. Beide sind aktuell recht stark.\n\nEs ist ein Fehler mit Level 2 automatisch reinzugehen. Manchmal ist es wesentlich effektiver einfach nur zu zonen. Halte die Gegner von den Minons fern in dem du dich aggressiv hinstellst. Du musst nicht engagen. Allein der Druck dadurch, dass du engagen könntest, reicht manchmal. Pinge auch im Voraus bevor du engagest. Wenn es dein allgemeiner Stil ist, sage es deinem ADC, damit er sich darauf einstellen kann. Manchmal passt der grundlegende Spielstil einfach nicht zusammen. Genau dann sollte man Absprachen treffen.\n\nBei Wards entscheiden auch die Positionen sehr stark. Nur weil du Wards setzt heißt es nicht, dass die immer richtig sitzen. Diese Season sind Wards knapp bemessen und ich weiß wie selten das Team Pinks kauft. Das wird sich nicht ändern. Allerdings heißt es, dass du deine Wards effektiv nutzen musst.\n\nBronze ist nun mal das untere Ende der Ladder. Viele Spieler befinden sich dort, aktuell knapp 30% aller gerankten Spieler. Nicht umsonst wird gesagt, dass Bronze-Spieler im Vergleich schlechter sind als die anderen Elo's. Im Endeffekt ist es auch die Wahrheit. Es ist aber dennoch für jeden Spieler möglich sich zu verbessern und einige Spieler haben nicht genügend Spiele gespielt um an ihrer richtigen Position anzukommen.\n\nIgnoriere die Kommentare deines Teams. Wenn es hilft, mute sie am Anfang des Spiels. Bis High Plat / Diamond muss die Teamcomp nicht zwangsweise das Spiel von der Champ Select heraus entscheiden. Klar, mit einer guten Teamcomp ist das Game einfacher. Allerdings müssen sich die Teammates dazu auch absprechen. Ansonsten geht das Game auch in die Hose.","replies":[]}]}]},{"poster":"MeMyselfandBaal","date":"2016-07-25T09:12:26.044+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Khan Mandoras,realm=EUW,application-id=KYnfKGf0,discussion-id=63qEA1ma,comment-id=0002000000010000,timestamp=2016-07-25T08:29:20.999+0000)\n>\n> Wie soll man denn als Support carrien?\n> \n> Ein paar Tipps habe ich ja schon bekommen, wenn der ADC schlecht ist soll man halt Mid helfen. Oder halt komplettes itembuild tauschen, wenn man merkt das es nicht gut läuft.\n\nSona spielen, die ist gerade Free Elo... Mit Mikaels, einem Defensiven Item und Ardent Censer... Schade natürlich, dass du erst nach den Nerfs dazu kommen wirst...\n\nAber das aller wichtigste: Du musst dich von der Bedeutung des einen Spieles lösen. Wenn du als Support besser spielst als der gegnerische Support, wird dein ADC verdammt oft die Lane gewinnen. Denn das macht ein guter Support.\nUnd ja, ab und zu wirst du einen ADC haben, den du einfach nicht zum Sieg tragen kannst... aber... das ist halt auch vollkommen egal. Du musst ja keine 75% deiner Spiele gewinnen um aus Bronze zu kommen, sondern nur 51%. Und wenn du in 75% deiner Spiele einfach nur besser bist als der gegnerische Support, wirst du dein Team weit genug nach vorne bringen (durch Kills auf der Botlane... durch Drachen, die du auf Grund des Drucks sichern kannst...)\nUnd wenn dein ADC scheiße ist... nun ja... lasse den genau eben nicht alleine. Der braucht dann halt deine Hilfe. Und du musst dafür sorgen, dass der wenigstens halbwegs durchkommt... Wenn mein ADC Grütze ist (oder der gegnerische Support besser ist als ich)... spiele ich wesentlich passiver und beschütze den so gut es geht. Und dann konzentriere ich mich darauf, dass ich in den wichtigen Teamfights meine Ultimate treffe. \n\nWas du auf gar keinen Fall machen solltest... ist dein Itembuild komplett tauschen. Wie du es in deinem letzten Leona Spiel 3 mal gemacht hast. Du hast eh schon weniger Geld als der gegnerische Support. Und Items verkaufen ist das ineffizienteste, was du machen kannst. Und du musst dich halt darum kümmern, dass du dein Gold effektiv nutzt.","replies":[]}]}]}]}]},{"poster":"Namlesshero","date":"2016-07-25T13:03:38.724+0000","up_votes":1,"down_votes":0,"body":"https://de.wikipedia.org/wiki/Dunning-Kruger-Effekt\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Illion","date":"2016-07-25T17:36:43.607+0000","up_votes":1,"down_votes":0,"body":"Etwas gefällt mir nicht an diesem Dunning-Kruger-Effekt. \nWenn ich jetzt der Meinung bin etwas wirklich toll gemacht zu haben was andere niemals so hinbekommen hätten. \nWoher weiß ich denn ob es es wirklich toll gemacht habe oder ob ich einfach zu inkompetent bin um meine Inkomptenz zu erkennen und somit an Selbstüberschätzung leide?","replies":[{"poster":"eingew","date":"2016-07-25T18:26:10.775+0000","up_votes":2,"down_votes":0,"body":"Wichtig ist daher immer auch die Einschätzung deiner Mitmenschen oder eines adäquaten Bewertungssystems wie zum Beispiel der Elo-Zahl.","replies":[]},{"poster":"Namlesshero","date":"2016-07-26T10:55:09.680+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Illion,realm=EUW,application-id=KYnfKGf0,discussion-id=63qEA1ma,comment-id=00080000,timestamp=2016-07-25T17:36:43.607+0000)\n>\n> Etwas gefällt mir nicht an diesem Dunning-Kruger-Effekt. \n> Wenn ich jetzt der Meinung bin etwas wirklich toll gemacht zu haben was andere niemals so hinbekommen hätten. \n> Woher weiß ich denn ob es es wirklich toll gemacht habe oder ob ich einfach zu inkompetent bin um meine Inkomptenz zu erkennen und somit an Selbstüberschätzung leide?\n\nEin unüberwindbares Paradoxum aus einem immer Tiefer reichende Spirale {{summoner:14}}","replies":[]}]}]},{"poster":"Waldschrat86","date":"2016-07-25T17:44:24.306+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Khan Mandoras,realm=EUW,application-id=KYnfKGf0,discussion-id=63qEA1ma,comment-id=,timestamp=2016-07-25T07:21:29.783+0000)\n>\n> Hey Leute, \n> \n> da ich zum ersten Mal gebannt wollte ich etwas zum Verhalten von Spielern schreiben.\n\nBin gespannt.\n\n> \n> Als erstes wollte klar stellen, dass ich das durchaus nachvollziehen kann, wenn man wegen Hate gebannt wird.\n\nJut.\n\n> Aber...was ich nicht verstehe ist z.B. wenn man restrikted wird, nur seinen eigenen Chatverlauf lesen kann.\n\nNaja du warst ja dabei, wenn du dich nicht erinnerst, kann's so wichtig ja nicht gewesen sein. Außerdem wirst du wegen deinem Verhalten bestraft, nicht wegen dem der anderen.\n\n> Man wird laufend von anderen Spielern proviziert, dazu muss ich sagen, das ich Bronze bin...Da erwartet man eh nicht sondern viel Teamplay.\n\nGeht deinen Mates nicht anders.\n\n> Und nat&amp;uuml;rlich rastet man dann schon mal total aus.\n\nNö, total tatsächlich noch nie, ein bisschen ab und an. Zumindest hat meine Art des Ausrastens noch zu keiner Strafe geführt und ich verhalt mich seit Saeson2 eigentlich gleich.\n\n> \n> Au&amp;szlig;erdem finde ich es sehr lustig, wenn andere Leute die selbst haten schreiben, dass man eh nicht aufsteigt, wenn man nur am haten ist.\n\nJop\n\n> \n> Man erwartet auf der Elo sowieso keine Wunder mehr...\n\nWenn man aufsteigen will muss man auch Wunder bewirken und nicht von anderen erwarten.\n\n> \n> An Riot: Leute bitte &amp;uuml;berarbeitet das Suchtool f&amp;uuml;r den Rankedpool bitte.\n> \n> Das Teamplay auf dem Niveau ist einfach nur schrecklich. Dann gibt es die Leute, die absichtlich feeden sogar in den Placements...Scheinbar f&amp;auml;llt das alles nicht unter &amp;quot;Unsportliches Verhalten&amp;quot;.\n\nZu viel Minority Report gesehen? Hast du Tools, um in die Zukunft zu blicken?\n\n> \n> Was mich pers&amp;ouml;nlich am meisten an Rankedgames st&amp;ouml;rt m&amp;ouml;chte ich noch los werden:\n> \n> 1. Man wird mit Leuten gematchtet, die teilweise wesentlich weniger Rankedgames gespielt haben. (habe &amp;uuml;ber 500 gespielt diese Season)\n\nHm ich war nach 150 oder so wieder Gold. Letzte Saeson war ich nach 70 fast Platin. Es gibt so viele Spieler mit über TausendRankeds, die trotzdem in Bronze hängen.\n> \n> 2. Man verliert st&amp;auml;ndig wegen anderen Lanes das Spiel. (Frustlevel unglaublich hoch) (Erg&amp;auml;nzung: Ich spiele Main Support. Tank vorzugsweise.)\n>           -Ehrlich gesagt ist das Frustlevel teilweise so hoch, dass ich selbst anfange zu feeden oder zu trollen.\n\nGenau du verlierst das dann wegen den anderen, nicht weil du aufgibst, wenn es noch gar nicht durch ist, dann noch trollst und feedest und auch noch die letzten Siegchancen wegwirft. Ganz klar dann liegt die Schuld bei den Anderen und nicht bei dir, dann noch auf der Position, die normalerweise Auren, Buffs durch Aktive und Sicht schafft/cleart. Ganz ehrlich das ist das letzte und auch in Bronze bemerkt man, wenn einer auf einmal absichtlich für den Gegner spielt. Gibt nichts frustrierendes als ein hartes Spiel dann deswegen zu verlieren.\n\n> \n> 3. Selbst wenn man alles versucht und z.b. den ADC auf der Botlane versucht zu besch&amp;uuml;tzen wird man daf&amp;uuml;r hart geblamt.\n\nWenn du alles versuchen würdest, würdest du nichtmal ansatzweise auf den Gedanken kommen den Mist da abzuziehen. Ignorier es oder mute halt, wie du schon sagtest man braucht da keine Wunder erwarten.\n\n> \n> 4. Smartpings helfen nichts.\n\nMeine Pings helfen in ca. 80% der Fälle, in 10% hätte es sie gar nicht gebraucht und beim Rest wird ignoriert bzw. nicht verstanden. Kann ich mit leben. Das hat auch nichts mit der Elo zu tun. Ich erleb so oft in Gold Pingspams, wo ich mir denke, was will der jetzt sagen? Ist da n ward, ist da n Gegner, soll das ne Aufforderung sein dahin zu gehen oder die Stelle meiden? Ich benutz die verschiedenen Pings, die Verwirrungspings kommen eigentlich immer nur von Leuten, die halt nur den Achtungsping kennen. Das andere, was mir ab und an passiert und damals in Bronze oft passiert ist. Man sieht einen Gegner in einen Busch laufen, in dem schon einer hockt. Jetzt lauf ich drauf zu weil ich weiß, da sind max. 2 weil 2sichtbar und der letzte Gegner tot ist. Also lauf ich in den Busch, auf den wild Achtung gepingt wird, weil der Pingmeister und noch ein Mate auch gerade da sind, 3vs2 Situation, da ich checke, bin ich im Fokus, die 2 Mates latschen weg, ich sterb weil das 3vs2 zum 1vs2 geworden und darf mir dann noch anhören, warum ich nicht auf Pings höre...\n\n> \n> 5. Die ganze Gruppe muten hilft ebenfalls nichts.\n\nKlar du bzw. deine Einstellung ist ja das Problem, die Gruppe wechselt ja immer.\n\n> \n> Was lernen wir daraus? \n\nDu bist einer der echten Bronzespieler, der meint viel höher zugehören, was aber nicht stimmt, sonst wärst du da nach so vielen Spielen nicht mehr.\nDann gehörst du wohl noch zu der Sorte der \"u dont deserve2win-Trolle\".\nUnd natürlich sind an allem immer andere schuld...\n\n> \n> Der Support von Riot ist sehr einseitig. \n> Mir w&amp;auml;ren hilfreiche Tipps lieber, als restrikted oder gebannt zu werden.\n> Was n&amp;uuml;tzt es mir zu wissen, dass ich zu den 7 oder was wei&amp;szlig; ich wie viel % geh&amp;ouml;re, bei denen das Haten nicht aufh&amp;ouml;rt.\n\nRiot und auch der Support sind halt nicht deine Mami oder Therapeut, wenn du das nicht hinbekommst (die Tipps findest du hier im Thread/Forenbereich) dann heißt es für dich tatsächlich:\n> \n> Lieber nicht League of Legends spielen.\n\nDenn das ist in etwa die Message eines Permabanns.\nEs sei denn du hast Spaß daran gebannte Bronze und Ulvl-30-Accs. zu sammeln.\n\nAlso gute Besserung oder good Bye, liegt ganz bei dir und nicht an den Anderen.","replies":[]},{"poster":"leonthefirefly","date":"2016-07-25T10:11:21.435+0000","up_votes":2,"down_votes":0,"body":"Tipps:\n1.Don't play Braum... nicht weil der champ schlecht ist sondern weil du mit ihm nicht klar kommst du hast gerade mal ne winrate von 32% auf 25 Games dh. du warst da wirklich eher handicap als nützlich. \n2. Deine beteiligung an Kills ist zu niedrig (40%) als supp geht da schon etwas mehr.\n3. mute leute die flamen\n4. hör auf anderen die schuld zu geben","replies":[]},{"poster":"Homunculi","date":"2016-07-25T08:41:14.725+0000","up_votes":2,"down_votes":0,"body":"Die eigene Motivation ist in diesem Spiel sehr wichtig, wenn man schon von vornherein sagt, das hier ist Bronze, das kann nichts werden tut man sich selbst und den Teamkameraden keinen Gefallen. Ich selbst bin Bronze und kann deine Einwände nicht 100% nachvollziehen, aber auch nicht gänzlich dementieren.\nJa es ist Bronze und hier ist keiner der nächste Faker/Huni/wiesenichalleheissen, obwohl sich viele dafür halten.\n\nNutze den Ban um kurz Abstand zu gewinnen, spiel etwas anderes oder mach was gänzlich anderes, wenn du wieder Lust auf LoL bekommst, komm wieder. Vllt. hast du dann deine Einstellung geändert oder siehst es etwas anders.\n\nWas für Tipps hättest du denn gerne? Tilte nicht, beleidige deine Mitspieler nicht, versaue anderen mit negativen Kommentaren nicht die Laune oder Motivation, lass das Salz zuhause? \n\nNicht jeder ADC hat eine kurze Lunte, viele meiner ADCs waren froh das ich gestorben bin und nicht sie. Wenn die Situation nicht anders hätte laufen können. Natürlich gibt es auch Beispiele für die andere Partei, aber die gibt es überall.\n\nWas die Provokation angeht, ja auch ich bin provoziert worden, sehr stark sogar, aber man sollte auf soetwas nicht eingehen, es schadet nur einem selbst, dem Team und somit auch die Chance auf einen Sieg. \nVor kurzem erst ein Spiel gehabt in dem sich zwei aus dem Team volle Lotte in die Haare bekommen haben, weswegen natürlich das Spiel verloren wurde, weil der eine mit dem anderen nicht mehr zusammen arbeiten wollte und jeder der beiden versucht hat sein eigenes Ding zu machen. \n\n\nZur verlorenen Lane, wegen einer Lane ist (aus meiner Sicht) nicht das ganze Spiel verloren. Derjenige hat evtl. einfach Probleme mit dem Gegner/Champ gegen den er spielt, was aber nicht heissen muss das er im Teamfight nicht nützlich ist oder vom Gegner massiv unterschätzt wird. Wenn der arme Kerl, der ja eh schon ein schlechtes Gewissen hat und evtl. Angst davor das wegen ihm das Spiel verloren wird, mit den Nerven am Ende ist und dann noch von seinen eigenen Teamkameraden zur Sau gemacht wird, ist es klar das die Motivation und der Siegeswille im Keller sind.\n\nMehr fällt mir im Augenblick nicht ein^^.","replies":[]}]}