{"poster":"deller0815","date":"2017-08-02T22:29:29.118+0000","title":"Matchmaking","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Kann mir mal jeder erkl&auml;ren wieso ich mit meinem Freund gegen ein 5er premate Team spielen muss? dieses Matchmaking macht mich fertig :o\r\nBin ich der einzige der das ofter durchleben muss oder gibt es hier mehr leute die das kennen?","replies":[{"poster":"Awsane","date":"2017-08-03T01:18:25.526+0000","up_votes":1,"down_votes":0,"body":"Also ich habe in normals die Erfahrung gemacht je kürzer die q-zeit umso fairer die Teams, wenn ich länger als 3:45 min warte bis zum 1. q Pop sind die Spiele selten wirklich balanced.\n\nAber man kann ja selber die q dann neu starten.  Gegen die standart casual 5er Team spiele ich auch solo durchaus gerne, die sind als Gegner meistens ganz witzig oder/und herrausfordernd. ALs unfair habe ich diese Konstellation bisher selten empfunden (ok ich habe einmal spät nachts gegen Drunk LCS smurfsim 5er Premade (die haben gestreamt nebenbei und ich hatte den nebenbei auf) gespielt. Das war schon eher hart, das Erlebnis.\n\nAber für die gibt es auch kein Perfekten Gegner zu der Zeit, genau so oft habe ich es andersherum, dass ich by far die höchste elo im Team habe.\n\nIch glaube man darf nicht erwarten gleichwertige Gegner im normal zu bekommen, gerade zur nicht prime time, weil der sinn dieser q liegt darin schnell spiele zu finden, dass das matchmaking dann nicht perfekt sein kann, ist glaube ich jeden bewusst.","replies":[{"poster":"Allerbester Biss","date":"2017-08-03T07:18:26.760+0000","up_votes":1,"down_votes":0,"body":"Doch das Matchmaking ist perfekt!\nAlle 10 Spielr haben genau die gleiche Normal MMR wie du!","replies":[]}]},{"poster":"RM Heartmeander","date":"2017-08-02T22:44:40.028+0000","up_votes":1,"down_votes":0,"body":"Das Matchmaking in Normals versucht halt eine Balance zwischen Fairness (Normal MMR und Premadegrössen) und Schnelligkeit zu finden.\nDa ich oft als 5er Premade spiele fällt es ab und zu auf dass die Gegner keine 5er Premade sind.\nZumindest ist das die Beobachtung wenn die Gegner sich dann untereinander im Allchat flamen da gehe ich davon aus dass diese keine Premades sind.\n\nMeistens haben die Spieler die einzeln sind also 4+1 oder 2+3 oder 2+2+1 eine grössere MMR als das Team um es halt auszugleichen.","replies":[]}]}