{"poster":"Acidalia","date":"2016-08-10T22:29:40.770+0000","title":"I DIDNT MEAN IT","subforum":"Player Behavior","up_votes":7,"down_votes":11,"body":"ok so i was recently a dick in a ranked game and got placed in low priority queue for 5 games and i know i have anger issues sometimes so i served my time and when it came to the last game i decided to go back into ranked, i was so optimistic about this game and i even got mid and got to play my fav champ and i was AMPED for this game but also about three days ago i got gastroenteritis and ive been getting really bad cramps and other digestive system issues so right before the game got into the loading screen my stomach entered world war 3 and i had to blast off to the toilet and when i got back the game had already loaded but my team remaked the game and i got another 5 games in low priority queue and i didnt mean to afk so is there anyway this ban can be lifted/excused this time. rito i beg plz. i didnt mean it","replies":[{"poster":"WookieeCookie","date":"2016-08-11T00:22:55.876+0000","up_votes":19,"down_votes":0,"body":"Hey Acidalia,\n\nI can understand that you didn't intend to leave the game.  \n\nSometimes when you gotta go, you gotta go.  And when you're in danger of spewing molten chocolate lava all over your chair I don't think anyone here at Riot would choose otherwise.\n\nHowever with that said we've purposely designed the Leaverbuster system to not take intent into account.  This is because leaving, regardless of the reason still has a negative impact on all other players in the game.\n\nOne thing to keep in mind however, is that it won't take action on your account until repeated leaves have been recorded.  This is because sometimes life happens and we all need to leave unexpectedly.  You mentioned you had left  games prior so this is likely why the system was quick to take action on you for this one leave.\n\nAlso if you continue to leave games Leaverbuster will leave longer and longer punishments on you account. The GOOD news though is that your standing with Leaverbuster is not permanent.  It will improve as you play matches without leaving and eventually return you to neutral status.  This means that in the rare circumstance that \"life calls\" you'll likely be able to leave without facing a severe penalty quickly.","replies":[{"poster":"Tyrone Lannister","date":"2016-08-11T00:26:09.771+0000","up_votes":6,"down_votes":0,"body":"\"Molten chocolate lava\"..... Omfg i cant unsee that","replies":[{"poster":"DREADN0UGHT","date":"2016-08-11T00:37:32.717+0000","up_votes":1,"down_votes":0,"body":"saym i cri","replies":[{"poster":"Itankyou","date":"2016-08-11T02:44:43.175+0000","up_votes":1,"down_votes":0,"body":"Some Quality shit posting that's for sure.","replies":[]}]}]},{"poster":"B Monkee","date":"2016-08-11T15:12:18.963+0000","up_votes":1,"down_votes":2,"body":"Hey WookieCookie, can you look into my case for being pema banned? I talked all about it here.\n\nhttp://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/4MUHopMr-please-read-if-you-care-enough?comment=00040000000000000000","replies":[]}]},{"poster":"Epitome of Noob","date":"2016-08-11T00:18:28.109+0000","up_votes":1,"down_votes":3,"body":"Sorry but DCs are VERY IMPORTANT in Bronze ranked queue. I mean, it's not like 99% of bronze players are crap.","replies":[{"poster":"Glowdust","date":"2016-08-11T03:21:16.364+0000","up_votes":3,"down_votes":0,"body":"an unnecessary comment and a toxic one to boot. forgot you started out in challenger ranking didnt you?","replies":[{"poster":"Sylas Dr3gb0urn3","date":"2016-08-16T22:40:52.744+0000","up_votes":1,"down_votes":1,"body":"{{sticker:zombie-brand-facepalm}}","replies":[]}]}]},{"poster":"Wonderlands","date":"2016-08-10T22:40:35.054+0000","up_votes":2,"down_votes":0,"body":"its just 5 games...","replies":[{"poster":"Acidalia","date":"2016-08-10T22:43:09.784+0000","up_votes":1,"down_votes":1,"body":"but im innocent","replies":[{"poster":"MagicFlyingLlama","date":"2016-08-10T22:49:22.682+0000","up_votes":1,"down_votes":1,"body":"Reason does not matter - you DCed.\n\nDont play league at times when you cant assure your presence.","replies":[{"poster":"2019 Offended","date":"2016-08-16T22:33:51.383+0000","up_votes":2,"down_votes":0,"body":"you're really gonna blame the dude for something that he cant really control","replies":[{"poster":"Prandine","date":"2016-08-16T22:48:35.655+0000","up_votes":0,"down_votes":0,"body":"> [{quoted}](name=Garbage Talon,realm=NA,application-id=ZGEFLEUQ,discussion-id=8kbLZTA7,comment-id=0001000000000000,timestamp=2016-08-16T22:33:51.383+0000)\n>\n> you&#x27;re really gonna blame the dude for something that he cant really control\n\nUnexpected things do happen from time to time, we get that. However, the OP did mention that they had prior leaves before, hence why LB busted them this time around.","replies":[]}]}]}]}]},{"poster":"Xidphel","date":"2016-08-10T22:39:55.450+0000","up_votes":1,"down_votes":0,"body":"Tough.","replies":[]}]}