{"poster":"Kuma16","date":"2016-03-14T23:58:40.704+0000","title":"Vel'Koz E vs Yasuo Windwall","subforum":"Melde einen Bug","up_votes":2,"down_votes":1,"body":"Die Yasuo Windwall soll ja nur Projektile Blocken, jedoch &quot;Blockt&quot; sie auch Vel&#039;koz E-F&auml;higkeit.\r\nWenn Yasuo seine Windwall aktiviert und diese sich zwischen Yasuo und Vel&#039;koz befindet und Vel&#039;koz seine E-F&auml;higkeit hinter die Wall Platziert wird der Kreis der F&auml;higkeit auch an der Richtigen stelle angezeigt. Nach der kurzen Verz&ouml;gerung wird der Schaden und das Hochwerfen auch ausgel&ouml;st, jedoch vor der Windwall, auf einer Linie zwischen der geplanten stelle und Vel&#039;koz damaliger Position. \r\n\r\nVel&#039;koz E ist kein Skillshot!\r\n{{sticker:zombie-brand-facepalm}} \r\nBitte Beheben.","replies":[{"poster":"roseBRA","date":"2016-03-18T21:46:25.023+0000","up_votes":1,"down_votes":0,"body":"Wie Spicy schon sagt ist der E eine Zone im Projektil.\nProjektile an sich werden zwar von der Wall gegessen, da dieses aber eine Zone mit sich bringt, liegt die Zone vor der Wall.\nSonst wäre, wie Spicy auch schon sagt, der Ball von Ori weg und sie müsste 6x Träne bauen.","replies":[]},{"poster":"BìgM","date":"2016-03-15T07:30:10.198+0000","up_votes":1,"down_votes":0,"body":"> Vel'koz E ist kein Skillshot!\n\nWas soll die Fähigkeit denn sonst bitte sein?","replies":[{"poster":"HHaie tabbian","date":"2016-03-15T07:37:05.526+0000","up_votes":1,"down_votes":1,"body":"Ich glaub, was er meinte, war Projektil.","replies":[{"poster":"Protective Puppy","date":"2016-03-15T08:36:11.490+0000","up_votes":1,"down_votes":1,"body":"Es ist aber auch ein Projektil. Man sieht es bei dem Battlecast-Skin besser.","replies":[{"poster":"HHaie tabbian","date":"2016-03-15T09:40:15.096+0000","up_votes":1,"down_votes":1,"body":"Nur die Frage ist doch die: Wenn es als Projektil gewertet wird, dann müsste die Windwall von Yasuo doch den Skill komplett blocken und nicht nur verschieben, oder?","replies":[]},{"poster":"Tentacle Smurf","date":"2016-03-15T09:37:24.837+0000","up_votes":1,"down_votes":1,"body":"man sieht ein projektil von vel koz weg fliegen zu seinem ziel","replies":[]}]}]}]},{"poster":"HoloHoroHolo","date":"2016-03-15T11:49:58.924+0000","up_votes":1,"down_votes":1,"body":"Projektiele bleiben and der Windwall hängen/werden geblockt und werden nicht absorbiert.\n\nDas heißt: Fähigkeiten die ein Projektiel sind aber als \"Fläche\" oder \"Zone\" gelten bleiben einfach dort liegen. Dies betrifft zum Beispiel Orianna Q, Vel'God E, Lux E und vermutlich einige weitere.\n\nFähigkeiten die natürlich nur \"geradlinig\" gehen und nur einen Punkt anfokusieren (Cait ult, Cait Q etc.) hören einfah da auf, weil sie nicht bleiben \"können\" bzw. es nicht vorgesehen ist.\n\nSpicy","replies":[]}]}