{"poster":"Kythéra","date":"2015-08-20T17:31:17.710+0000","title":"Syndra oder Talon??","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo liebe lol community,\r\n\r\nich hoffe ihr habt zeit und lust diesen beitrag zu lesen ( wenn nicht dann h&ouml;rt auf zu lesen und geht auf YouTube .\r\n\r\nAlso ich kann mich zurzeit nicht zwischen folgenden champs entscheiden: Syndra und Talon.\r\ndie midlane ist meine mainlane und ich m&ouml;chte nicht von euch h&ouml;ren &quot;Talon is geil nehm ihn&quot; oder &quot;Syndra OPer als Talon&quot; wetten ein paar schreiben genau das xD, egal ich w&uuml;rde gerne Pros und Kontras h&ouml;ren ( mit pros ist nich Profis gemeint nur damit nicht einer damit kommt! ) w&uuml;rde mich &uuml;ber hilfe freuen.\r\n\r\nZu mir : \r\n\r\n- Farme gerne und viel\r\n- M&ouml;chte m&ouml;glichst viele kills\r\n- mag Team und solo fights","replies":[{"poster":"Hamrio","date":"2015-08-20T17:34:36.491+0000","up_votes":1,"down_votes":0,"body":"pros syndra:\n guten burst. \netwas schwieriger zu ganken durch  ihren E (cap closer könen abgebrochen werden)\nwenig cooldown\n5 man stun der nicht einfach zu dodgen kann\nhat eine gute range\ncons:\n mana lastig \nwenig mobilität\n(taloin wird folgen bin ingame xD)","replies":[{"poster":"Sophie973","date":"2015-08-22T00:09:26.769+0000","up_votes":1,"down_votes":0,"body":"Na wo bleibt denn Talon? :P","replies":[]}]},{"poster":"WhereThExileGoes","date":"2015-08-20T23:31:54.300+0000","up_votes":1,"down_votes":0,"body":"Syndra ist meine Meinung nach die bessere Wahl, weil du recht dominant auf der Lane bist und sehr guten Poke und CC mitbringst. nebenbei hast du ab LvL 6 einen sehr guten Burst. Auf LvL 9 hat sie nochmal nen besseren Poke weil ihre Q dann 15% mehr Schaden verursacht (sofern du Q maximierst). Außerdem kann es  passieren, wenn du ahead kommst deinen gegner sobald er auf die lane kommt sofort wieder in die Base beförderst weil du mit einem Lead sehr stark Snowballst.\n\nTalon kann zwar auch sehr gut Snowballen aber in Teamfights springst du rein und stirbst aufgrund von mangelnden escapes.","replies":[]},{"poster":"Sophie973","date":"2015-08-20T21:45:44.787+0000","up_votes":1,"down_votes":0,"body":"Syndra defenitiv, einfach weil sie die ballz hat.\n\n\n\nOkay jetzt wirklich:\n\nSyndra ist einfach zu lernen, hat einen Guten stun und kann trotzdem sehr safe farmen / poken /Töten auch wenn sie weit behind ist. Außerdem ist sie ein Ultra guter Heimerdinger counter, Ahri counter, Yasou counter. Und die sind sehr oft auf der mid lane zu sehen.\n\n\n\nEdit: \n\n-farmen wie gesagt sehr einfach\n-Du kriegst auf jeden fall genug kills, :D\n-Solofights solltest du gewinnen, außer natürlich es ist eine 20/1 Jinx\n- Teamfights musst du hinten stehen, kannst eventuell alle Stunnen und schönen starken flächen damage machen mit deiner Q und W und mit deiner Ulti Finishen","replies":[]}]}