{"poster":"Incredibile13","date":"2017-06-12T12:47:01.676+0000","title":"Lentezza assurda nel caricare","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Ciao a tutti, vorrei chiedere la vostra opinione per un problema che da un po&#039; mi infastidisce....\r\nOvvero ci si trova a giocare con persone che hanno dei pc assolutamente non adatti al gaming e che quindi in fase di caricamento iniziale ci mettono da 3 ai 10 minuti, mentre le altre 8-9 persone sono gi&agrave; al 100% di caricamento in meno di un minuto.....\r\nDal momento che il problema principale &egrave; l&#039;hard disk dei computer portatili e che con 50&euro; si compra un buon SSD io vi chiedo:\r\nnon dovrebbe esser obbligatorio possedere un SSD per giocare?\r\nIntendo: da un paio di settimane gioco sempre i ARAM, dove se la partita &egrave; veloce dura 8-10 minuti, &egrave; possibile che in 8 persone dobbiamo aspettare 5-10 minuti di caricamento per giocare un partita da 8-10 minuti?\r\nVoi cosa ne pensate?\r\n(Parlo di hard disk perch&eacute; un po&#039; me ne intendo di pc e anche per ch&eacute; avevo un amico con un portatile con un buon processore ma ci metteva sempre sui 5-10 minuti a caricare...... Una volta che gli ho installato un ssd &egrave; sempre tra i primi a caricare.... e visto che le specifiche minime di LOL richiedono un processore pressoch&eacute; decente l&#039;unica pecca &egrave; sempre l&#039;hard disk da 5400rpm....)","replies":[{"poster":"Floppyz","date":"2017-06-12T14:54:03.482+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Incredibile13,realm=EUW,application-id=MJVj50Jw,discussion-id=sFjENXlO,comment-id=,timestamp=2017-06-12T12:47:01.676+0000)\n>\n\n> non dovrebbe esser obbligatorio possedere un SSD per giocare?\n\nNo. Non è prettamente necessario.\n\n> [{quoted}](name=KUROKAMI00,realm=EUW,application-id=MJVj50Jw,discussion-id=sFjENXlO,comment-id=0001,timestamp=2017-06-12T13:39:50.028+0000)\n>\n> Per esperienza personale ti posso dire che non c&#x27;entra niente che tipo di pc hanno i tuoi alleati o nemici. Sei lvl 18, prima del lvl 25/30 è normale che la fase di caricamento duri tanto. Non so il motivo, ma è così. Ho 2 smurf su EUW e 1 su EUNE, sugli smurf ci mette sempre tanto a caricare, su questo profilo ci mette pochissimo. Quando salirai a lvl 30, dopo un po&#x27; di partite to accorgerai che il tempo di caricamento sarà molto di meno.\n\nIl caricamento della partita dipende principalmente dalla velocità di lettura dell'hard disk (e in misura praticamente ininfluente dalle caratteristiche della RAM), questo perché l'operazione principale è per l'appunto caricare dall'hard disk alla RAM tutti gli asset che serviranno durante la partita.\n\nIl livello dell'account è assolutamente ininfluente in quest'operazione puramente tecnica e locale.","replies":[{"poster":"RGM Player","date":"2017-06-12T17:13:49.399+0000","up_votes":2,"down_votes":0,"body":"È un po' off topic, ma non potete mettere una feature che manda una notifica quando si viene citati in un  commento?  Tipo il tuo commento l'ho visto per caso, se non ci avessi cliccato di nuovo si questo thread, non avrei mai visto il tuo commento. \n\nComunque io sugli smurf noto che ci mette molto di più a caricare rispetto a questo account. A me carica normale, ma gli altri sono lenti a caricare.","replies":[{"poster":"Floppyz","date":"2017-06-12T17:28:57.506+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KUROKAMI00,realm=EUW,application-id=MJVj50Jw,discussion-id=sFjENXlO,comment-id=00020001,timestamp=2017-06-12T17:13:49.399+0000)\n>\n> È un po&#x27; off topic, ma non potete mettere una feature che manda una notifica quando si viene citati in un  commento?  Tipo il tuo commento l&#x27;ho visto per caso, se non ci avessi cliccato di nuovo si questo thread, non avrei mai visto il tuo commento. \n\nEh, siamo in due. Avrei una lista di feature che mi piacerebbe vedere sul forum che è più lunga dell'elenco telefonico di Pechino, ma al momento credo che il relativo team di Riot sia impegnato col nuovo client; vedremo poi cosa s'inventeranno.\n\n> Comunque io sugli smurf noto che ci mette molto di più a caricare rispetto a questo account. A me carica normale, ma gli altri sono lenti a caricare.\n\nMagari esiste un qualche tipo di legame riguardo al caricamento degli altri (dovuto alle persone che becchi con lo smurf), ma come dicevo, il tuo caricamento non dipende dagli altri, anche se devi aspettarli per poter giocare.","replies":[]}]}]},{"poster":"BeardSergio","date":"2017-06-12T13:08:36.684+0000","up_votes":2,"down_votes":0,"body":"Mi sembra una richiesta un po' assurda. Stessi parlando di lcs o tornei ad alto livello potrei darti anche ragione ma se il mio pc mi permette di giocare decentemente, anche se con tempi di caricamento lunghi, non vedo perchè debba essere un problema.\n\nInoltre c'è un tempo massimo dopo il quale entri in partita per forza quindi direi che, a meno che tu non voglia pagare ssd a tutti, possiamo anche considerarla una bella, ma assurda, richiesta","replies":[{"poster":"Incredibile13","date":"2017-06-12T13:22:46.886+0000","up_votes":1,"down_votes":0,"body":"Certo che però per 10 minuti di ARAM aspettare 10 minuti di caricamento innervosirebbe tutti.....\nIn ogni caso non ho parlato di un pc da gaming (1500€), bensì di un aggiornamento della componentistica, come quando si cambia la RAM....\nSe te hai il pc che ti permette di giocare decentemente vai a farti le normal o le ranked che durano 45 minuti, non le ARAM.....\nE poi non parlo dei fissi, che avendo i dischi da 3,5 anche se a 5400 rpm riescono a mantenere delle prestazioni accettabili, ma dei portatili, che si trovano dischi da 2,5\" a 5400rpm e a \"basso consumo\", che leggono e scrivono a 10-25MB/s, ovvero peggio di una chiavetta USB...\nE ti assicuro che di portatili del genere ce ne sono un sacco in giro.....\nProva a misurare il tempo di caricamento di una partita tuo e dimmi quanto ci metti","replies":[{"poster":"BeardSergio","date":"2017-06-12T14:00:04.487+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Incredibile13,realm=EUW,application-id=MJVj50Jw,discussion-id=sFjENXlO,comment-id=00000000,timestamp=2017-06-12T13:22:46.886+0000)\n>\n> Certo che però per 10 minuti di ARAM aspettare 10 minuti di caricamento innervosirebbe tutti.....\n> In ogni caso non ho parlato di un pc da gaming (1500€), bensì di un aggiornamento della componentistica, come quando si cambia la RAM....\n> Se te hai il pc che ti permette di giocare decentemente vai a farti le normal o le ranked che durano 45 minuti, non le ARAM.....\n> E poi non parlo dei fissi, che avendo i dischi da 3,5 anche se a 5400 rpm riescono a mantenere delle prestazioni accettabili, ma dei portatili, che si trovano dischi da 2,5&quot; a 5400rpm e a &quot;basso consumo&quot;, che leggono e scrivono a 10-25MB/s, ovvero peggio di una chiavetta USB...\n> E ti assicuro che di portatili del genere ce ne sono un sacco in giro.....\n> Prova a misurare il tempo di caricamento di una partita tuo e dimmi quanto ci metti\n\nLa media dei giocatori di lol chiede se un portatile da 250€ regge il gioco. \nQuesto ti fa già pensare che la maggior parte delle persone non intende spendere per hw upgrade. Se a questo aggiungiamo le connessioni, spesso pessime, possiamo tranquillamente dire che è normale avere un'attesa media di 5 minuti.\nParlando di tempi di attesa veri possiamo anche dire che un'aram non dura 10 minuti e che 10 minuti di attesa raramente si raggiungono in fase di caricamento.","replies":[{"poster":"Incredibile13","date":"2017-06-21T13:18:09.080+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BeardSergio,realm=EUW,application-id=MJVj50Jw,discussion-id=sFjENXlO,comment-id=000000000001,timestamp=2017-06-12T14:00:04.487+0000)\n>\n> La media dei giocatori di lol chiede se un portatile da 250€ regge il gioco. \n> Questo ti fa già pensare che la maggior parte delle persone non intende spendere per hw upgrade. Se a questo aggiungiamo le connessioni, spesso pessime, possiamo tranquillamente dire che è normale avere un&#x27;attesa media di 5 minuti.\n> Parlando di tempi di attesa veri possiamo anche dire che un&#x27;aram non dura 10 minuti e che 10 minuti di attesa raramente si raggiungono in fase di caricamento.\n\nCertamente, ma visto che una giornata mi è capitato 4 volte di seguito di aspettare sopra i 10 minuti sono sclerato male e ho aperto questo thread \nAltrimenti neanche scrivevo....\nNon sempre gioco le normal perché son lunghe e non sempre ho tutto quel tempo da dedicare a lol.....\nInoltre posso garantire a Ciack che tutto dipende dal pc e dai pc degli altri....  e l'ho confermato cambiando l'HD tremendo che aveva il mio amico sul MacBook Pro 13\".... Un 5400rpm della mutua... Una volta inserito un ssd in 15 secondi lui carica sempre..... La velocità di caricamento non è eccessivamente influito dalla qualità della linea, a meno che non ci siano interruzioni.....\nComunque effettivamente devo concordare con te BeardSergio, se questo è quello che l'utente medio chiede siamo ben distanti dall'appassionato....","replies":[]}]},{"poster":"Dr LouD","date":"2017-06-12T13:30:24.733+0000","up_votes":2,"down_votes":1,"body":"> Se te hai il pc che ti permette di giocare decentemente vai a farti le normal o le ranked che durano 45 minuti, non le ARAM\n\nLEGIT","replies":[]}]}]},{"poster":"RGM Player","date":"2017-06-12T13:39:50.028+0000","up_votes":1,"down_votes":0,"body":"Per esperienza personale ti posso dire che non c'entra niente che tipo di pc hanno i tuoi alleati o nemici. Sei lvl 18, prima del lvl 25/30 è normale che la fase di caricamento duri tanto. Non so il motivo, ma è così. Ho 2 smurf su EUW e 1 su EUNE, sugli smurf ci mette sempre tanto a caricare, su questo profilo ci mette pochissimo. Quando salirai a lvl 30, dopo un po' di partite to accorgerai che il tempo di caricamento sarà molto di meno.","replies":[]}]}