{"poster":"Kiean515","date":"2015-03-01T03:49:28.099+0000","title":"New Option For Custom Game","subforum":"Player Creations","up_votes":2,"down_votes":1,"body":"So im just lvl 20 and I didn't get to play the URF mode ( Ultra Rapid Fire ) in LoL, my friend has, and I heard it was pretty cool, so I thought Riot should put an option in custom games that lets you play like in URF mode, but better, 100% cooldown reduction, no mana cost, infinite gold, lvl 18 at start, and all champs are playable, I've seen many posts like this, I just wanna tell Riot that this would be a really great idea for not only beginners, but also           for pros who just wanna have some fun. Share your thoughts below. :)","replies":[{"poster":"Kiean515","date":"2015-03-08T05:33:11.221+0000","up_votes":2,"down_votes":0,"body":"I didn't think that anyone would reply to this coz it just popped in my head, but yeah 100% cdr is horrible, just thought it wud be hella fun since your up against bots, but the effect when u play normals after playing that mode is really bad as u said, being dat ur lvl 30, we're 10 lvls apart, I wont argue, I've only played for like 6 months so yea","replies":[]},{"poster":"Lonely Flame","date":"2015-03-02T07:15:25.353+0000","up_votes":2,"down_votes":0,"body":"You're relatively new so I'm just going to explain a couple of things. It's hard to convey tone over text, but I'm not trying to insult you or yell. It's just the only way to really explain it.\n\n100% cooldown is terrible...Once someone like Karth hits 6 they would literally just stay at base and spam ult. Or Vek'Koz infinitely spamming his ult in front of him and dealing stupid amounts of true damage.\n\nURF and other event run for a limited time because drop off after the first few days is massive. URF was good because it particularly stood out, but the issue was that a) it messed with you for normal games because you go so used to being able to spam everything pointlessly (I can even begin to tell you the amount of people who were spamming flash as soon as it was up thinking it had a 60 sec cooldown).\n\nChances are URF or something similar will return for April Fools. Riot are particularly good about that kinda stuff, and given the response they will most likely do it again.","replies":[{"poster":"Crusader charlie","date":"2015-03-02T23:07:22.116+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lonely Flame,realm=OCE,application-id=hIjvqaz6,discussion-id=bEZj2VoO,comment-id=0000,timestamp=2015-03-02T07:15:25.353+0000)\n>\n> You're relatively new so I'm just going to explain a couple of things. It's hard to convey tone over text, but I'm not trying to insult you or yell. It's just the only way to really explain it.\n> \n> 100% cooldown is terrible...Once someone like Karth hits 6 they would literally just stay at base and spam ult. Or Vek'Koz infinitely spamming his ult in front of him and dealing stupid amounts of true damage.\n> \n> URF and other event run for a limited time because drop off after the first few days is massive. URF was good because it particularly stood out, but the issue was that a) it messed with you for normal games because you go so used to being able to spam everything pointlessly (I can even begin to tell you the amount of people who were spamming flash as soon as it was up thinking it had a 60 sec cooldown).\n> \n> Chances are URF or something similar will return for April Fools. Riot are particularly good about that kinda stuff, and given the response they will most likely do it again.\n\ngangplank ult spam though.","replies":[]}]}]}