{"poster":"AronCartman","date":"2019-02-18T22:50:25.270+0000","title":"Permanently Banned For Minor Flaming (Riot would rather I soft int)","subforum":"Player Behavior","up_votes":2,"down_votes":22,"body":"I got permanently banned for typing, i feel so bad i caused others the pain of reading my grammatical errors. Thank you Riot Full Fucking R%%%%% video games. I will make a new account, smurf and soft int, because running it down is a minor offence while typing is in your system  is the worst thing a player can do\r\n\r\nGame 1\r\nPre-Game\r\nAronCartman: hail of blades\r\nAronCartman: or conuqerer\r\nIn-Game\r\nAronCartman: pls\r\nAronCartman: stop playing adc\r\nAronCartman: just stick to midlane\r\nAronCartman: when we duo no\r\nAronCartman: but wwithout me\r\nAronCartman: dont\r\nAronCartman: ward the red\r\nAronCartman: and go\r\nAronCartman: midlane no sums\r\nAronCartman: free kill\r\nAronCartman: jugnle afk\r\nAronCartman: the jungle difference\r\nAronCartman: is so much fun\r\nAronCartman: stop pushing waves\r\nAronCartman: your useless\r\nAronCartman: 10 minutes\r\nAronCartman: 0 kill participation\r\nAronCartman: dude\r\nAronCartman: jhins poppingoff\r\nAronCartman: lol 0 kill aprticicaption\r\nAronCartman: thats right\r\nAronCartman: better quit\r\nAronCartman: n00b\r\nAronCartman: lol for a mid ahri into a lane bully amtchup\r\nAronCartman: your cs is terrible\r\nAronCartman: jhin\r\nAronCartman: me and you carry\r\nAronCartman: go top\r\nAronCartman: and push there wave\r\nAronCartman: then go bot\r\nAronCartman: your so bad\r\nAronCartman: so i would be talking\r\nAronCartman: lol he was afk\r\nAronCartman: for a good chunk of time\r\nAronCartman: jungle difference\r\nAronCartman: LOL\r\nAronCartman: im winning my lane\r\nAronCartman: your just trash\r\nAronCartman: buddy\r\nAronCartman: your first kill was 15 minutes in\r\nAronCartman: you watched poor garen int his lane\r\nAronCartman: i lost it from your afk\r\nAronCartman: n00b\r\nAronCartman: buddy your 3 levels down on jax\r\nAronCartman: we know\r\nAronCartman: homeless shelter wifi\r\nAronCartman: aint that good\r\nAronCartman: garen\r\nAronCartman: your 0/6\r\nAronCartman: just ff\r\nAronCartman: lost game\r\nAronCartman: ye you costed us the game\r\nAronCartman: tell you what\r\nAronCartman: since im nice\r\nAronCartman: i wil only report for afk\r\nAronCartman: open gg\r\nAronCartman: lol\r\nAronCartman: buddy\r\nAronCartman: you need some serious coaching\r\nAronCartman: intro level bots jugnle better\r\nAronCartman: lol ahri i dont think your old enough to play a T rated game\r\nAronCartman: if your mommy found out you will go to bed at 7 instead of 8\r\nAronCartman: lol that  made me laugh so hard\r\nAronCartman: almost spilt my water\r\nGame 2\r\nIn-Game\r\nAronCartman: gg\r\nAronCartman: ff 15\r\nAronCartman: just ff 15\r\nAronCartman: your so bad\r\nAronCartman: you should uninstall\r\nAronCartman: dinana\r\nAronCartman: its 15 minutes\r\nAronCartman: and ou have no kill aprticipation\r\nAronCartman: lol your actually one of the worst junglers\r\nAronCartman: in quite a long time\r\nAronCartman: no farm\r\nAronCartman: no kill participation\r\nAronCartman: and allows the newly buffed yorick to scale\r\nAronCartman: bruh\r\nAronCartman: youricks alane bully\r\nAronCartman: and i am\r\nAronCartman: i have 3 kills\r\nAronCartman: and beat him early\r\nAronCartman: great\r\nAronCartman: now im stuck\r\nAronCartman: for another 5 minutes\r\nAronCartman: nah buddy\r\nAronCartman: i was palying ine\r\nAronCartman: till jax ganked me\r\nAronCartman: burned my flash\r\nAronCartman: then after that ytorick froze my wave\r\nAronCartman: and free farmed\r\nAronCartman: whast teh point\r\nAronCartman: my jungles mute and deaf\r\nAronCartman: my lanes lost\r\nAronCartman: yorick 1v9\r\nAronCartman: im not flaming\r\nAronCartman: i am giving tips to jungle to improve\r\nAronCartman: likke uninstalling\r\nAronCartman: that will make her 10x better\r\nAronCartman: lol are you 12\r\nAronCartman: your actualy not old enough to play a t rated game\r\nPost-Game\r\nAronCartman: diana\r\nAronCartman: no kill participation 15 minutes into the game\r\nAronCartman: thats what i call\r\nAronCartman: afk farming\r\nAronCartman: diana\r\nAronCartman: jsut uninstall\r\nAronCartman: it would mkae leauge better\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPeace out and hope I get magically reformed on my next 10 accounts. :)","replies":[{"poster":"rujitra","date":"2019-02-18T22:52:26.181+0000","up_votes":14,"down_votes":1,"body":"Jeez, you flamed people the entire game. You’re surprised about this punishment?","replies":[{"poster":"AronCartman","date":"2019-02-18T23:13:36.600+0000","up_votes":1,"down_votes":8,"body":"No the entire game, wish Riot had the technology to copy and pasta time stamps and the teams KDR or there chat logs to see what people have to go through in the depths of MMR hell.","replies":[{"poster":"rujitra","date":"2019-02-18T23:28:21.092+0000","up_votes":4,"down_votes":1,"body":"They can, you can submit a support ticket and I believe it gives you the logs with time stamps. Even if it isn’t every minute, your entire log is flaming.\n\nPeople doing bad, and you losing a game, does not give you the right to flame others.","replies":[{"poster":"AronCartman","date":"2019-02-18T23:31:45.523+0000","up_votes":1,"down_votes":3,"body":"People apparently have the right to que up for games in a ranked environment and proceed to play like a level 5 would when they started. I do not believe level 90s play there main champions with the wrong runes, items, playstyle on purpose.","replies":[{"poster":"rujitra","date":"2019-02-18T23:41:56.582+0000","up_votes":4,"down_votes":1,"body":"Looking at your match history, there are games you've done just as bad as these people you complain about.","replies":[{"poster":"AronCartman","date":"2019-02-18T23:49:54.333+0000","up_votes":1,"down_votes":4,"body":"When your team turbo ints the 40/5 zed literally one shots you under 3 turrets of protection no matter how well I play, considering he is plat and was a diamond I dont see why my iron teammates may ellicit some tilt...","replies":[{"poster":"rujitra","date":"2019-02-18T23:54:22.260+0000","up_votes":4,"down_votes":1,"body":"“Turbo ints”... no. They fed, sure. But “int” is specifically if they are **intentionally** dying to them to give kills. If they’re trying to play the game and they just die a lot, it’s no different from when you played [yasuo and died a lot](https://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2980852443/247822420?tab=overview) or when you played [jax and died a lot](https://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2979246031/247822420?tab=overview).... and that’s just within the past couple of days.\n\nIf you want to be ranked better and be placed with better teammates, work on your own damn skill instead of trying to blame everyone else.","replies":[{"poster":"AronCartman","date":"2019-02-19T00:00:13.099+0000","up_votes":1,"down_votes":4,"body":"I feel confident in my skills, but no level 80 player dies in lane every minute and continues trying to fight someone with a 1500~ gold lead. Its not about the rank, its about the matchmaking, see my enemies are not bronze like me but they were placed here and have to climb out, but my teammates are 4 season hardstuck bronzie trash and are meant to never leave the depths of bronze. Where as my opponents might jhave a bronze rank but are gold last season and plat andw ere placed in my division. Also a few where inting, when the FFs failed they stopped playing and rank it down mid. Thanks for linking the mach histories so that people can see the KDRs of what I have to go through.","replies":[{"poster":"rujitra","date":"2019-02-19T00:06:30.344+0000","up_votes":4,"down_votes":1,"body":"Your level means nothing. Your level is indicative of how long you’ve been playing League - not your skill level.\n\nYour **rank** and **MMR** are indicative of your skill. It is fully possible for someone playing casually to play thousands of games while not getting better at the micro play that increases skill. It’s also possible that someone can reach level 30 and be very good at the game already because they study and play to learn micro play.\n\nYour current rank is your current skill. Past rank means nothing. You are the problem with your matches. If you don’t want to be matched with other “bad” players, stop being a bad player yourself. Period.","replies":[{"poster":"AronCartman","date":"2019-02-19T00:11:24.852+0000","up_votes":1,"down_votes":6,"body":"Lol thats the most helpful shit I have seen thrown at me. But I guess it comes from forum warriors who dont actually play Riot Full Fucking R%%%%%s video game, if I didn`t have add and could live through DOTAs turn rate I wouldnt be playing this garbage ass game...","replies":[{"poster":"rujitra","date":"2019-02-19T00:12:39.936+0000","up_votes":3,"down_votes":0,"body":"You realize that many players have multiple accounts?\n\nI logged into the boards with the account I was on at the time a couple years ago to post a reply to something... and i’ve Just been using this one here since. I’m too lazy to play on this account though as my main ranked account has more skins.","replies":[{"poster":"AronCartman","date":"2019-02-19T00:19:00.011+0000","up_votes":1,"down_votes":6,"body":"IGN? i wanna see what kind of teammates you get, the joy to see your getting actual human beings on your team.","replies":[{"poster":"rujitra","date":"2019-02-19T00:19:56.360+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=AronCartman,realm=NA,application-id=ZGEFLEUQ,discussion-id=T19o70uW,comment-id=000000000000000000000000000000000000000000000001,timestamp=2019-02-19T00:19:00.011+0000)\n>\n> IGN? i wanna see what kind of teammates you get, the joy to see your getting actual human beings on your team.\n\nYou’ve already tried multiple times to flame other players on this thread.\n\nThis thread is about your punishment. Not other players. And not flaming them. That sort of behavior of trying to flame others is what got you banned. Period.","replies":[]}]}]}]}]}]},{"poster":"mavrycks","date":"2019-02-22T03:06:02.701+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"rujitra","date":"2019-02-22T03:40:46.957+0000","up_votes":1,"down_votes":0,"body":"Oh yes you can. Let's say you consistently and without fail play two ranks above your current rank. Thus, you should climb. Let's also say that the chance any player in your current rank is a troll, afks, feeds their lane, whatever is 10% or 0.1.\n\nIt follows that the chance you have one of these players on your team is the following:\n\n>0.1*0.1*0.1*0.1 + 0.1*0.1*0.1*0.9 + 0.1*0.1*0.9*0.9 + 0.1*0.9*0.9*0.9 OVER 0.9*0.9*0.9*0.9\n\nOr about 12.498%. This is because if you play consistently, then there is no chance you are a troll, thus we only have to consider your four teammates. We add up all possible outcomes (the chance 4 teammates are trolls, the chance 3 are, etc.) And divide by the chance that *none* is a troll to get the ratio of games you will have at least one troll in.\n\nNow, let's consider the chance those players are on the enemy team:\n\n>0.1*0.1*0.1*0.1*0.1 + 0.9*0.1*0.1*0.1*0.1 + 0.9*0.9*0.1*0.1*0.1 + 0.9*0.9*0.9*0.1*0.1 + 0.9*0.9*0.9*0.9*0.1 OVER 0.9*0.9*0.9*0.9*0.9\n\nThis amounts to 12.499%. **This statistical fact holds true no matter what the proportion of trolls is in your rank.** The likelihood of a troll on the enemy team will **always** be higher than on your team, which means over hundreds of games, you **will** climb.\n\nBut we started off assuming that you *weren't* climbing - we assumed that you play above your rank and the only reason you aren't climbing is because of these trolls. We have proven that trolls have no factor on your rank, and that in fact you will win 0.001% more of your games **simply because the enemy has a troll** than you lost because you have a troll.\n\nAs such, there is a contradiction - we've proven that trolls actually make you win more games than they make you lose, which makes you climb, yet we assumed that you were not at your deserved rank and not climbing *because* of trolls. This cannot be the case, and thus one of two things must be true:\n\n* You are not *not* at your deserved rank, thus you *are* at your deserved rank.\n\nOr\n\n* You are not climbing for some reason other than trolls (or afks whatever). Well the only thing other than your teammates that affects your climb is you...  thus we must assume you are not climbing because of you...\n\nQuod Erat Demonstratum. Trolls are not a factor in your rank.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"PH45","date":"2019-02-19T07:14:03.350+0000","up_votes":3,"down_votes":0,"body":"You were warned with your 14-day ban that the next offence would result in a permaban, and you chose to ignore that warning. I love these posts when people thing they've been done wrong against, when in reality they are the wrong-doers. \n\n> Peace out and hope I get magically reformed on my next 10 accounts. :)\n\nPermaban wasn't meant to reform you, it was meant to encourage you to stop playing this game. The lesser punishments (chat restriction, 14-day ban) were meant to reform you.\n\n>  I will make a new account, smurf and soft int, because running it down is a minor offence while typing is in your system is the worst thing a player can do\n\nHave fun wasting your time.","replies":[{"poster":"TonyWolf77","date":"2019-02-19T13:15:55.921+0000","up_votes":2,"down_votes":0,"body":"Oh well. I suppose there are those that are simply irredeemable.","replies":[]}]},{"poster":"Reksee","date":"2019-02-18T23:31:50.774+0000","up_votes":3,"down_votes":1,"body":"Also why is almost every comment not by OP downvoted by one person?","replies":[{"poster":"Boltonator","date":"2019-02-18T23:45:35.368+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Reksee,realm=NA,application-id=ZGEFLEUQ,discussion-id=T19o70uW,comment-id=0009,timestamp=2019-02-18T23:31:50.774+0000)\n>\n> Also why is almost every comment not by OP downvoted by one person?\n\nI have a feeling I know who it is, and it isn’t the Op. I refuse to name-shame here though.","replies":[{"poster":"Galaxyburstz","date":"2019-02-19T00:22:34.843+0000","up_votes":1,"down_votes":1,"body":"Its me : )","replies":[{"poster":"Voldymort","date":"2019-02-19T06:34:59.341+0000","up_votes":1,"down_votes":0,"body":"...Mario?","replies":[]},{"poster":"Boltonator","date":"2019-02-19T00:32:26.117+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Galaxyburstz,realm=NA,application-id=ZGEFLEUQ,discussion-id=T19o70uW,comment-id=000900010000,timestamp=2019-02-19T00:22:34.843+0000)\n>\n> Its me : )\n\nNice to meet you {{champion:117}}","replies":[]}]}]}]},{"poster":"Boltonator","date":"2019-02-18T23:00:12.333+0000","up_votes":3,"down_votes":1,"body":"Yes you deserved it.\n\nYou deserved it so much I actually voted on your poll.\n\nThis is as cut-and-dry as toxic cases get, especially considering your prior history.","replies":[{"poster":"AronCartman","date":"2019-02-18T23:05:06.553+0000","up_votes":2,"down_votes":6,"body":"Wish you could see the time stamps, where I did not type for 20 minutes but only let my teammates know of there performance isues when i tabbed in to see there 2/13/4 and building the wrong items. I guess I deserve a ban... Im so sad I lost my account, time to climb up to gold then int my way down to iron 4, hope I see you along the way. :)","replies":[{"poster":"rujitra","date":"2019-02-18T23:11:10.759+0000","up_votes":2,"down_votes":1,"body":"That doesn’t help.......... you refused to communicate for 20 minutes then the times you *did* communicate you flamed them because you disagreed with them?","replies":[{"poster":"AronCartman","date":"2019-02-18T23:14:33.310+0000","up_votes":1,"down_votes":4,"body":"Game was lost in champ select, but I didn't say anything until 20 minutes in since it was clear I was hostage...","replies":[{"poster":"rujitra","date":"2019-02-18T23:27:35.111+0000","up_votes":2,"down_votes":1,"body":"Last I checked there was no nexus present in champion select, and the only way the game is lost is by having the enemy destroying your champion select. I haven’t played since yesterday, though, so there could’ve been an update.\n\nYou’re more than welcome to have the **opinion** that your team is at a **disadvantage** from your team composition versus the enemy’s. That doesn’t mean the game is “lost”. And it doesn’t mean you’re held “hostage”. If you cannot agree to play a game and try to win until it ends no matter if you’re doing good or bad, don’t play a game.","replies":[{"poster":"AronCartman","date":"2019-02-18T23:38:06.826+0000","up_votes":1,"down_votes":2,"body":"I will say it again, in the snowball meta that is S9 you cannot win a 3v5. If my midlaners pick is banned by my support and they start flaming, both troll pick and lock in troll runes and sums. I cannot really win those types of games, however hard I tried, getting 2 1k shutdowns still didnt help with a missing inhib 15 minutes into the game. However it did not \"define as a loss\" it very well was. Rip Promos...","replies":[{"poster":"rujitra","date":"2019-02-18T23:43:56.779+0000","up_votes":2,"down_votes":1,"body":"You can say it as much as you want but runes and summoners do not lose a game. Period.","replies":[{"poster":"AronCartman","date":"2019-02-18T23:55:24.922+0000","up_votes":1,"down_votes":1,"body":"Its not the summoners its the players... But when I have a trolling midlaner and support who are fighting it doesnt matter what they do, its effectivly a 3v5. and if you played this game, you know im hostage in champ slect as dodging costs a promo game...","replies":[{"poster":"rujitra","date":"2019-02-18T23:56:56.340+0000","up_votes":2,"down_votes":1,"body":"Dude. You claim somoene’s “picking troll” and “trolling with runes and sums”. That’s not your decision.\n\nSomething being *off meta* does ***NOT*** make it trolling. Period. Just because it’s not what you consider meta does not mean you get the right to dictate what they play. You are not the team captain. You are not a League Expert. Period.\n\nAnd no, you don’t get held “hostage” by other players. You agreed to queue up for a game. You **agreed** to it. If you don’t agree to that, then **don’t queue up for a game**.","replies":[{"poster":"AronCartman","date":"2019-02-19T00:02:23.062+0000","up_votes":1,"down_votes":1,"body":"Difference between off meta and an exclusive mana build path into a champion who does not use mana.. I know the diference between off meta and building tears on zac...","replies":[{"poster":"rujitra","date":"2019-02-19T00:05:01.748+0000","up_votes":2,"down_votes":1,"body":"I’ve looked through your history and I cannot find the game you’re referencing where there was a Zac building tears. The beauty of match history is that it is public.","replies":[{"poster":"AronCartman","date":"2019-02-19T00:12:35.921+0000","up_votes":1,"down_votes":1,"body":"Keep scrolling, it was in november last season. I remember getting slapped with a 2 week ban for calling him stupid \"feeder\". The F word ritos wet dream.","replies":[{"poster":"rujitra","date":"2019-02-19T00:13:43.397+0000","up_votes":2,"down_votes":1,"body":"So.. one instance of someone trolling you in 4 months makes it okay to be an asshole to people playing off meta?\n\nThat makes your ban more than accurate. You don’t get to flame people now just because you’re unhappy about one troll 4 months ago. And that’s assuming this person actually exists (I’m not going to look through your history to confirm, but given your posts here I doubt it).","replies":[{"poster":"AronCartman","date":"2019-02-19T00:16:58.158+0000","up_votes":1,"down_votes":1,"body":"Keep looking I hope you can link it for the world to see, it was one instance I could remember, as it was the most blatant, again proof that this guy was not punished, but I was..","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Boltonator","date":"2019-02-18T23:09:50.437+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=AronCartman,realm=NA,application-id=ZGEFLEUQ,discussion-id=T19o70uW,comment-id=00040000,timestamp=2019-02-18T23:05:06.553+0000)\n>\n> Wish you could see the time stamps, where I did not type for 20 minutes but only let my teammates know of there performance isues when i tabbed in to see there 2/13/4 and building the wrong items. I guess I deserve a ban... Im so sad I lost my account, time to climb up to gold then int my way down to iron 4, hope I see you along the way. :)\n\nThe fact you didn’t try to communicate with your team is not a good start to your defense case. This is a team game, everyone needs to work together in a manner that doesn’t breed conflict. You failed horribly in that regard. If you wanted your team to do better earlier you should have spoken up at the first sign of potential trouble.\n\n“Why are you not building through your roles’ specific item path?” Would have been a much more effective method of questioning their build choice, instead you chose “Uninstall” as your advice to your jungler. That is not helpful, it most certainly breeds conflict.","replies":[{"poster":"Gutz500PS4","date":"2019-02-18T23:40:15.663+0000","up_votes":2,"down_votes":1,"body":"> The fact you didn’t try to communicate with your team is not a good start to your defense case. This is a team game, everyone needs to work together in a manner that doesn’t breed conflict. You failed horribly in that regard. If you wanted your team to do better earlier you should have spoken up at the first sign of potential trouble.\n> \n> “Why are you not building through your roles’ specific item path?” Would have been a much more effective method of questioning their build choice, instead you chose “Uninstall” as your advice to your jungler. That is not helpful, it most certainly breeds conflict.\n\nSo people that are genuinely just toxic should mute all correct? But if they mute all then they can't see chat and speak to their team... This contradicts a lot of peoples argument so please explain what you mean by that.\n\nWhen somebody is angry at another their judgment on what is going on is diminished and therefore more likely to say something they regret. League tends to make people increasingly angry especially if already in a bad mood.","replies":[]}]}]}]},{"poster":"Reksee","date":"2019-02-18T23:18:14.448+0000","up_votes":4,"down_votes":2,"body":"\"your useless\"\n \"thats right\"\n \"better quit\n \"n00b\"\n \"your so bad\"\n \"your just trash\"\n \"just ff\"\n \"lost game\"\n  \"ye you costed us the game\"\n\n\n1.Yeah, you deserved it, and that's only the first game. Because what I've listed above is more than \"minor flaming\".\n\n2. You could not use the words your or you're correctly if your life depended on it.","replies":[{"poster":"Reksee","date":"2019-02-18T23:18:49.168+0000","up_votes":3,"down_votes":2,"body":"Also I could not list things correctly if MY life depended on it.","replies":[{"poster":"AronCartman","date":"2019-02-18T23:22:08.163+0000","up_votes":2,"down_votes":1,"body":"I passed English classes even though it was my 3rd language.. but I don`t see the need to put in any effort. He rage quit after hearing me tell him the truth and just kept DCing and RCing on purpose to spam us and avoid a leaver. Also that is pretty minor, considering he told me he wants to touch my little sister....","replies":[{"poster":"Reksee","date":"2019-02-18T23:24:30.729+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=AronCartman,realm=NA,application-id=ZGEFLEUQ,discussion-id=T19o70uW,comment-id=000700000000,timestamp=2019-02-18T23:22:08.163+0000)\n>\n> I passed English classes even though it was my 3rd language.. but I don`t see the need to put in any effort. He rage quit after hearing me tell him the truth and just kept DCing and RCing on purpose to spam us and avoid a leaver. Also that is pretty minor, considering he told me he wants to touch my little sister....\n\nJust because it's mild in comparison does not mean it is mild. You still deserved the punishment, although it is not okay for the other person to be saying that so I hope you reported them.","replies":[{"poster":"AronCartman","date":"2019-02-18T23:27:59.309+0000","up_votes":1,"down_votes":4,"body":"I did and he got slapped with Riot video games worst punishment, 25 chat restricted games, so yeah SEXUAL HARASSMENT is appropriate but mild flame is not. God I love N.A Society...","replies":[{"poster":"Reksee","date":"2019-02-18T23:30:56.899+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=AronCartman,realm=NA,application-id=ZGEFLEUQ,discussion-id=T19o70uW,comment-id=00070000000000000000,timestamp=2019-02-18T23:27:59.309+0000)\n>\n> I did and he got slapped with Riot video games worst punishment, 25 chat restricted games, so yeah SEXUAL HARASSMENT is appropriate but mild flame is not. God I love N.A Society...\n\nIf you got perma banned you did something prior to this that elicited punishment. The other person likely did not and it is likely their first punishment.","replies":[{"poster":"mavrycks","date":"2019-02-22T03:16:30.754+0000","up_votes":1,"down_votes":0,"body":"u think riot is a good company lmao, they will ban u for saying shut now","replies":[]},{"poster":"AronCartman","date":"2019-02-18T23:35:12.504+0000","up_votes":1,"down_votes":1,"body":"Again I will rephrase my statement, actual chat deserving a harsher punishment does not receive it, but mild chat that 11 year old type at each other (i was acting like one) receives a PERM ban. But saying sexually inappropriate material does not, HISTORY OR NOT I don`t find that very fair...","replies":[]}]}]}]}]}]}]}]}