{"poster":"JAGMAG","date":"2015-12-29T20:26:52.055+0000","title":"PSA: Playing Drunk or High Does not make you better","subforum":"Player Behavior","up_votes":18,"down_votes":9,"body":"despite what you may believe it does not make you better unless somehow playing slower with delayed reactions and less stable emotions makes you better. \r\ngo watch a reply of your games when you are under the influence wile you are sober if you think you play better :P\r\nand hey if you just like to get blasted and play at least keep it out of ranked","replies":[{"poster":"Maximum Morde","date":"2015-12-29T20:30:21.286+0000","up_votes":10,"down_votes":1,"body":"No but it makes me feel better about feeding.","replies":[{"poster":"KnightOfEloHell","date":"2015-12-30T01:08:53.646+0000","up_votes":3,"down_votes":1,"body":"Mordekaiser es numero uno\n\nYo estoy Trollkiaser\n\nFeed early\nCarry game\n\nWhile stoned \n\n\nGet Quadrakill\n\nGG\n\nHuehuehue","replies":[]}]},{"poster":"Meanie40","date":"2015-12-29T21:37:04.887+0000","up_votes":5,"down_votes":3,"body":"PSA: The drunk or high person doesn't care.","replies":[{"poster":"IcyPepper","date":"2015-12-29T22:27:16.321+0000","up_votes":4,"down_votes":2,"body":"When they're drunk or high, obviously.\n\nI think this PSA is intended for them... while they're sober. So they can choose to *stay* sober if they want to play the game.\n\nPlus this PSA is tackling a common misconception, so the value of it isn't wasted if people take the time to read it especially as the young ones approach drinking/smoking age with that misconception in mind. You'd be surprised by the number of people who actually think that getting drunk/high to play LoL is a good idea.","replies":[{"poster":"Leadpaintchips","date":"2015-12-30T00:40:08.383+0000","up_votes":2,"down_votes":2,"body":"People think getting drunk and/or high improves your reflexes? {{sticker:zombie-brand-facepalm}} Are they willfully stupid?\n\nHave they SEEN someone under the influence try to dance?  It's funny as shit, but not really dancing.  Now apply that to LoL.","replies":[{"poster":"IcyPepper","date":"2015-12-30T01:01:45.542+0000","up_votes":4,"down_votes":1,"body":"Yes, people are really that stupid.\n\n:/","replies":[]}]},{"poster":"JAGMAG","date":"2015-12-29T23:17:12.955+0000","up_votes":3,"down_votes":2,"body":"someone understands :D","replies":[]}]},{"poster":"Lucent Rengar","date":"2015-12-30T12:14:29.300+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Meanie40,realm=NA,application-id=ZGEFLEUQ,discussion-id=HoNhNB80,comment-id=0006,timestamp=2015-12-29T21:37:04.887+0000)\n>\n> PSA: The drunk or high person doesn't care.\n\nlol this guy.  he has a point :P","replies":[]}]},{"poster":"Omniphonic","date":"2015-12-29T21:58:12.995+0000","up_votes":2,"down_votes":2,"body":"stop hating me because i'm smarter than you.  lol i had something else to say entirely.\n\nah yes, it is that it was my personal belief that the problem with most people is they don't smoke enough marijuana.","replies":[{"poster":"JAGMAG","date":"2015-12-29T23:21:13.925+0000","up_votes":1,"down_votes":1,"body":"do some research long term weed use has been proven to lower your IQ by quite a bit it sounds like you've been going at it steady for a long long time by this point","replies":[{"poster":"Omniphonic","date":"2015-12-30T07:59:59.813+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Shonjl","date":"2015-12-30T08:29:58.629+0000","up_votes":3,"down_votes":0,"body":"I am sorry but this made me laugh. Its one thing to leave and let live, another to call out facts.\n\nIf you want to get high thats on you. But calling out facts just because you are included in them are laughable.\n\nAny drug, no matter what it is, medical, caffine, nicotine, weed, coke, whatever else will make the human body worse one way or another. The human body has with data and facts been proven to actually do worse when any type of drug is added to it. And yes even medical drugs are bad, read about them and you will see that while they provide some positive, they can also cause some big negatives. So how can you say that drugs that actually have minor or no positive benefits are good?\n\nSo yes, do what you please since its your own body, but don't act like its harmless. Its your problem what you do but you are only fooling yourself if you truly believe that, weed is messing you up. Also that last part is even more lol worthy. Can't make an arguement so you use the 12 year old and a racist comment. Talk about another worthless waste of space on the boards lol.","replies":[]},{"poster":"EvilDustMan","date":"2015-12-30T09:22:32.669+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Omniphonic,realm=NA,application-id=ZGEFLEUQ,discussion-id=HoNhNB80,comment-id=000700000000,timestamp=2015-12-30T07:59:59.813+0000)\n>\n> only if you get your 'research data' from government and corporate sponsored 'science articles'.  **you're a tool, and you're probably about 12, and half black**.  good luck with those things.\n\nWh-what? \n\nWow, way to be racist, holy crap. So much for marijuana making you an easy going person.","replies":[]}]},{"poster":"BigfootGreyGhost","date":"2016-01-04T22:38:53.361+0000","up_votes":1,"down_votes":0,"body":"Please link this hilariously fabricated study...please?","replies":[]}]}]},{"poster":"EvilDustMan","date":"2015-12-30T02:48:44.590+0000","up_votes":2,"down_votes":1,"body":"I'm not saying marijuana is bad either. I think it's something we need to relax on and start more medicinal and recreational use. But it DOES make it easier for you to not care about something going wrong. \n\nThe problem, I think, lies at what point we can hold each other responsible for not playing at our fullest. League is a game. We keep the toxic behavior out to keep it a relatively, yes I'm going to use this phrase, 'Safe space'. But if someone drunks or smokes to relax while playing the game, at what point are they infringing on us because they are dragging us down by playing worse. Can we fault them for doing whatever they do to relax? But it still infringes on us. It's a bit of a grey area.","replies":[{"poster":"JAGMAG","date":"2015-12-30T03:09:54.088+0000","up_votes":2,"down_votes":1,"body":"well its selfish if your drug or alcohol use effects others, and also doing something that you know will make you play worse is sorta trolling and being a dick. besides that most people will swear upon their mothers grave it actually makes them a better player. also like i said keep it to normals losing a game versus losing lp because someone was high as fuck feels very different one can even be funny the other is never funny.","replies":[{"poster":"BigfootGreyGhost","date":"2016-01-04T22:45:42.250+0000","up_votes":1,"down_votes":0,"body":"Its even more selfish to try to proclaim that this is \"your\" expierience, in a game you are 1 out of 10 people, just like booze pills and weed \"help\" people relax so do videogames. League of Legends isn't your job nor do you get paid for it, so be like the drunk stoner and chiiiiiiiiiiiiiiiiiiiiiiiiilllllllllllllllllllllllllllllll man. This is a game. Treat it as such.","replies":[{"poster":"JAGMAG","date":"2016-01-04T23:20:26.291+0000","up_votes":2,"down_votes":0,"body":"literally you can just reverse your argument on yourself your just 1 of 10 people dont be a dick to the other 9 by using drugs and then ruining their ranked games","replies":[]}]}]}]},{"poster":"Lucent Rengar","date":"2015-12-30T12:13:31.855+0000","up_votes":1,"down_votes":0,"body":"> and hey if you just like to get blasted and play at least keep it out of ranked\n\nfuck that shit.  if you like to suck keep it out of rank.  some people play better drunk and high on a 8th ball of coke than some people do on their sober state.","replies":[{"poster":"JAGMAG","date":"2015-12-31T17:26:26.355+0000","up_votes":2,"down_votes":0,"body":"true but it makes you worse and anyone in your elo will play worse then someone in your elo if they are on drugs.","replies":[]}]},{"poster":"Dooby Doob","date":"2015-12-29T22:40:54.872+0000","up_votes":2,"down_votes":1,"body":"As said drunk or high person gives 0 shits, people like to wind down with a beer or 3 after work/college/whatever and play video games.  I've played drunk a few times I@m worse than usual but it's easier to have fun.","replies":[{"poster":"JAGMAG","date":"2015-12-29T23:15:34.894+0000","up_votes":1,"down_votes":1,"body":"ive done it before but i do not do it in ranked and i do not go on and on about how drunk i am","replies":[{"poster":"Lucent Rengar","date":"2015-12-30T12:39:50.599+0000","up_votes":2,"down_votes":0,"body":"well then you aint drunk enough.","replies":[]},{"poster":"Dooby Doob","date":"2015-12-30T00:01:33.580+0000","up_votes":1,"down_votes":0,"body":"Me either, it's just asking for people to start whining telling them you have had a drink.","replies":[{"poster":"JAGMAG","date":"2015-12-30T03:11:37.656+0000","up_votes":1,"down_votes":0,"body":"well there's also a difference between i had a drink and i had a glass of liquor XD im not saying guys who have a couple beers im talking about the legit drunks and pot heads who have been blazing for like an hour","replies":[]}]}]}]},{"poster":"shyv","date":"2015-12-29T21:19:34.212+0000","up_votes":2,"down_votes":0,"body":"honestly though, my duo played while high the entire time we played ranked together. made him less bitchy and he performed pretty much the same. i would rather him have slower mechanics than go on tilt and fuck up my promos and stuff, u know?","replies":[{"poster":"JAGMAG","date":"2015-12-29T23:25:45.322+0000","up_votes":1,"down_votes":0,"body":"i sorta understand that when im drunk im allot easier to get along with and i dont flame at all, but i play significantly worse and stop caring at all about the game and just want it to end so i can drink more XD so i limit my drunk time to normals and arams","replies":[{"poster":"shyv","date":"2015-12-30T02:22:28.715+0000","up_votes":1,"down_votes":0,"body":"well i think it's probably different, when you're drunk you act like a tool but he just smokes so he's just.. chill and less bitchy","replies":[]}]}]},{"poster":"Kinjishi","date":"2015-12-30T09:58:06.602+0000","up_votes":3,"down_votes":1,"body":"\"and hey if you just like to get blasted and play at least keep it out of ranked\"\nKeep it out of league completely.","replies":[]},{"poster":"Samus72","date":"2015-12-29T22:35:03.356+0000","up_votes":3,"down_votes":1,"body":"It is a deception.  There is no actual improvement with drugs and alcohol.  The mind is unable to compensate for the foreign chemical it's being subjected to and develops false responses as a result.  The \"euphoria\" that is felt is one of the ease on the symptoms of withdrawal.  \n\nIt most cases, the alcohol or drug acts as a placebo does.  People believe they are better when on the substance.  But again, that's the deception working.  But that's the trap.  Once the effect of the substance wears off, you want more of it.  That's when the addiction and damage begins.  You build up a tolerance and require greater amounts at greater intervals.  \n\nBut it makes no difference to me.  I've seen plenty of team games, not just in League, ruined by the mistakes of players who then claim that they are drunk or high as some sort of justification for their failure.  Across the board, I don't like playing with people who are inebriated nor do I care to listen to their excuses that they have willingly imbued a substance that will ultimately make them less effective then they might have been otherwise.","replies":[{"poster":"JAGMAG","date":"2015-12-29T23:16:30.363+0000","up_votes":2,"down_votes":1,"body":"this ^","replies":[]}]},{"poster":"Samus72","date":"2015-12-29T22:04:10.076+0000","up_votes":3,"down_votes":1,"body":"This reminds me of a study I read about a while back.  A group of people were asked to drive a minor obstacle course while sober.  Later, those in charge threw a party and allowed all the participates to drink as much alcohol as much as they wanted.  Then they allowed the group to drive the obstacle course again.  The group was then asked which of the two courses they felt they did their best at.  Almost 95% of the group said they did the second test better.  Of course, both sessions had been filmed.  When the group sobered up, they were shown the video of both runs.  Admittedly, the group, while drunk, failed the course across the board.  But the perception was that they did better while under the effects of alcohol.  \n\nNo doubt those that play League drunk or high have the same misconceptions.  No, it doesn't make you any better.  But it's a sure sign for me, personally, I shouldn't be playing with you.","replies":[{"poster":"BigfootGreyGhost","date":"2016-01-04T22:48:20.043+0000","up_votes":1,"down_votes":0,"body":"too bad for you every single game ranked bots or norms will have one two or six of these people glhf","replies":[]}]},{"poster":"S0ur Deezel","date":"2015-12-29T22:03:59.217+0000","up_votes":3,"down_votes":1,"body":"People play this sober?","replies":[{"poster":"Lucent Rengar","date":"2015-12-30T12:38:49.386+0000","up_votes":1,"down_votes":0,"body":"trolls/feeders/afkers turn me to alcoholic.  thanks riot.  thats the reason i don't play sober anymore.","replies":[]}]},{"poster":"VictoryDance96","date":"2015-12-29T20:27:58.107+0000","up_votes":1,"down_votes":1,"body":"\"Play sober,\nor GET R E K T!!!\"","replies":[{"poster":"JAGMAG","date":"2015-12-29T20:39:27.093+0000","up_votes":3,"down_votes":1,"body":"this needs to be an ad campaign zoom in on a dead champ saying his last message read lol im so drunk right now","replies":[]}]},{"poster":"elon wątroba","date":"2015-12-30T11:36:01.580+0000","up_votes":1,"down_votes":0,"body":"I disagree, my best ashe game  was under heavy influence of vodka. It was the only time when i actually  could snipe someone from entire map :D","replies":[{"poster":"Varilight","date":"2016-01-05T19:53:37.860+0000","up_votes":2,"down_votes":1,"body":"This, my friend, is what most people refer to as luck and coincidence.\n\nNice try though.","replies":[]}]},{"poster":"Omniphonic","date":"2015-12-29T21:59:47.748+0000","up_votes":2,"down_votes":1,"body":"especially among people who believe themselves mistakenly to be intelligent, the problem with most people is they do not smoke enough marijuana.  heads up.","replies":[]},{"poster":"TheCoochieMaster","date":"2018-07-14T20:22:10.431+0000","up_votes":1,"down_votes":0,"body":"One time I was playing duo ranked with a friend while I was really really drunk. So much so that I afk'ed for about 6 minutes to go throw up, immediately came back underleveled and joined a teamfight where I got my first pentakill of the season as twitch and we won the game. checking the after game stats, I still got the most damage in the game despite having 1/4 the cs of everyone else XD. That's the only time this has even remotely worked out well with the exception being singed (statistically, I play a better singed while under the influence).","replies":[{"poster":"Warlord Rhinark","date":"2018-07-14T20:37:29.324+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheCoochieMaster,realm=NA,application-id=ZGEFLEUQ,discussion-id=HoNhNB80,comment-id=0017,timestamp=2018-07-14T20:22:10.431+0000)\n>\n> One time I was playing duo ranked with a friend while I was really really drunk. So much so that I afk&#x27;ed for about 6 minutes to go throw up, immediately came back underleveled and joined a teamfight where I got my first pentakill of the season as twitch and we won the game. checking the after game stats, I still got the most damage in the game despite having 1/4 the cs of everyone else XD. That&#x27;s the only time this has even remotely worked out well with the exception being singed (statistically, I play a better singed while under the influence).\n\nOi mate.\n\nDon't necro 3 year old threads.\n\nThat's against the (Updated) Boards Universal Rules under \"Spamming & Trolling\".","replies":[]}]},{"poster":"WildRancor","date":"2016-11-16T10:56:43.506+0000","up_votes":1,"down_votes":0,"body":"I actually play ok when drunk. Shit im drunk right now and just went 7/3/4 on udyr jungle.","replies":[]},{"poster":"Victor Mercer","date":"2016-01-01T01:53:52.575+0000","up_votes":1,"down_votes":0,"body":"Sorry to burst your bubble but I do play better after drinking and no I will not keep it out of ranked.","replies":[{"poster":"Varilight","date":"2016-01-05T19:52:09.283+0000","up_votes":1,"down_votes":0,"body":"I spy a troll.... {{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"JAGMAG","date":"2016-01-01T16:38:12.829+0000","up_votes":1,"down_votes":0,"body":"sorry to burst your bubble but yo do not actually play better you just think you do go watch some replays of when you are drunk af and you will see your play much worse. you might feel like you are doing well in that 30 min buzz but after that shit wears off you are going to be playing sluggish af","replies":[]}]},{"poster":"MagicDragon300","date":"2016-01-04T23:25:57.817+0000","up_votes":1,"down_votes":0,"body":"Unless you're Yasuo. Then your three consistencies in life are honor, death, and hangovers.","replies":[]},{"poster":"higura","date":"2015-12-30T14:35:10.462+0000","up_votes":1,"down_votes":0,"body":"not all true as weed is a trap in that regard.\n\nyou see for someone who have been smoking for a long time can weed actually improve your performance for the short time it`s in effect, this is why many of them belive that they get better when they smoke.\n\nthis is partly true, because you could get alot better performance wise if you just stopped smoking for a month and it would increase even further after that (you will never reach the point you had befor you began smoking though).\n\np.s. sorry for any spelling mistakes, i have tried to correct as many as i could.   \n\nregards \n\nhigura","replies":[]},{"poster":"Omniphonic","date":"2015-12-29T21:00:25.013+0000","up_votes":0,"down_votes":2,"body":"i was, uh, just happening to be thinking about this very topic this morning.  so i was well prepared for this very thread lol.\n\n  i know for a fact i'm better when i'm stoned and drunk, my precognition engine fires at full bore.  i do stuff that blows my own mind, that i'd never be able to execute nearly as smoothly stone sober.  not only that, but i get 75% less trolls when i'm playing f'ked up.  i know that's statistically impossible, there's no way my sobriety could have bearing on the temperament of the players i'm matched with, but i swear it's still totally true.","replies":[{"poster":"magic pole","date":"2015-12-29T22:45:43.892+0000","up_votes":1,"down_votes":0,"body":"maybe you don't care about them trolling or sucking and don't even notice it. so instead of mentally bitching and focusing on that, you gloss over it and keep doing you\n\n:3\n\nand i would guess that it's not the sobriety affecting your match ups, but the state of mind your non-sobriety leaves you in could quite possibly leave you matched with \"better (less trolly)' players. Or that you can overcompensate for their deficiencies given your altered mind and possibly attribute the lack of trolls to your unusual 'overperforamcne' ","replies":[]}]}]}