{"poster":"MinioNinja","date":"2018-11-02T18:18:15.408+0000","title":"Se me congela la pantalla del juego","subforum":"Problemas Técnicos","up_votes":7,"down_votes":1,"body":"Hace tiempo me esta pasando algo muy molesto y me gustar&iacute;a saber si  hay soluci&oacute;n o si a alguien le paso, es que cada ves que estoy en el juego me pasa que se me congela la pantalla de golpe y no puedo hacer nada y no importa que reinicie la computadora para no se terminar la partida si pierdo o si gano siempre termino en Leavelbuster pero no es mi culpa y no se como solucionarlo (por cierto no tengo lag ni fallos en los fps as&iacute;  que hay no viene el problema)","replies":[{"poster":"DRamirez96","date":"2018-11-05T05:10:10.698+0000","up_votes":1,"down_votes":0,"body":"Tengo el mismo problema, ya reinstale el LOL y aún así sigue pasando","replies":[]},{"poster":"Eleftheria ","date":"2018-11-02T23:43:46.108+0000","up_votes":1,"down_votes":0,"body":"El congelamiento en la pantalla es bastante común y la verdad da muchos problemas a la hora de jugar, pero no te alarmes todo tiene solución en esta vida!\n{{sticker:slayer-pantheon-thumbs}} \nPor la descripción que das lo mas posible es que el error sea el de \"System Error\" \nAcá te comparto todos los métodos posibles para que puedas solucionarlo, si después de probar estas soluciones no funciona ninguna puedes agregarme para que te ayude más a fondo.\n\n**Primera solución **\n_Si es un error con la compatibilidad (Que es lo más probable) esta sera tu posible solución_\nDa click derecho sobre el acceso directo de LoL\nDa click en propiedades\nDa click en la pestaña de modo de compatibilidad\nDesactiva la casilla de \"Ejecutar en modo de compatibilidad\"\nAplica los cambios y da click en aceptar.\nEjecuta tu cliente como administrador.\n\n**Segunda solución**\nDesactivar el protocolo IPv6\nEn el menú de sistema (esquina inferior derecha de la pantalla), haz clic derecho en tu icono de conexión a Internet y selecciona Abrir centro de redes y recursos compartidos\nHaz clic en el tipo de conexión debajo de Conexiones (normalmente Conexión de área local) en la parte derecha de la ventana\nHaz clic en Propiedades en la siguiente ventana\nDesactiva el Protocolo de Internet versión 6 (TCP/IPv6)\nLuego da click en aceptar y cerrar\n\n**Tercera solución**\nCambiar a un DNS publico \n_Si tienes un DNS en especifico para tu Internet este podría traerte mala conexión :( Si no es así continua :D_\nPresiona la tecla de Windows\nEscribe ''Panel de Control''\nSelecciona ''Redes e Internet''\nSelecciona ''Centro de redes y recursos compartidos''\nSelecciona ''Cambiar configuración del adaptador'' en la barra de navegación de la izquierda\nHaz clic derecho en tu adaptador de red y selecciona ''Propiedades''\nSelecciona ''Protocolo de Internet versión 4 (TCP/IPv4)'' y haz clic en ''Propiedades''\nVe a la parte inferior del menú y cambia ''Obtener dirección de servidor DNS automáticamente,'' a ''Usar las siguientes direcciones de servidor DNS:''\nAhora deberás cambiarlo por los siguientes valores\nParte superior  8.8.8.8 \nParte inferior    8.8.4.4\nLuego da click en aceptar y cerrar\n\n**Cuarta solución**\n_Si ninguna de las anteriores funciono es posible que el cortafuegos de tu computadora este interfiriendo con el juego_\nHaz clic en Inicio\nHaz clic en Panel de control\nHaz clic en Sistema y seguridad\nHaz clic en Firewall de Windows\nHaz clic en Activar o desactivar Firewall de Windows \nDebajo de cada ubicación de red, selecciona la opción Desactivar Firewall de Windows\n(Si esto te trae problemas puedes volver a activarlo de todas formas)\n\n_**Recuerda reiniciar tu computadora para que los cambios tengan efecto!**_\n\nEspero que esto pueda solucionar tu problema, si no es así puedes escribirme para que pueda verlo a fondo \nQue tengas un buen día :D\n{{sticker:sg-ahri-2}}","replies":[{"poster":"MinioNinja","date":"2018-11-03T19:18:10.569+0000","up_votes":1,"down_votes":0,"body":"Gracias por tus posibles soluciones las voy a probar","replies":[]}]},{"poster":"fabybobeda","date":"2018-11-02T23:19:43.947+0000","up_votes":1,"down_votes":0,"body":"alguno encontro la solucion estaria bueno! a mi me paso en varias partidas me viene pasando de hace un tiempito un mes y me pasa en algunas partidas no en todas pero en re molesto porque al jugar una solo duo empieza el juego y se me traba y tengo que reiniciar o cerrar sesion y apenas vuelvo a entrar tengo mucha diferencia de farm.","replies":[{"poster":"Eleftheria ","date":"2018-11-02T23:47:17.914+0000","up_votes":1,"down_votes":0,"body":"Acabo de dejar unas posibles soluciones arriba\nEspero te sirvan :D","replies":[]}]},{"poster":"streL","date":"2018-11-02T20:17:38.961+0000","up_votes":1,"down_votes":0,"body":"Me pasa lo mismo, recien en una partida me ocurrio 2 veces... he perdido varias tf por ese problemita {{champion:32}}","replies":[{"poster":"Vino y Falopa","date":"2018-11-02T21:45:50.256+0000","up_votes":1,"down_votes":0,"body":"Reinstalaste lol vos? Se arreglara o sera al pedo?","replies":[{"poster":"streL","date":"2018-11-02T21:56:32.084+0000","up_votes":1,"down_votes":0,"body":"No aun no reinstalo pero le puse reparar y sigue igual {{summoner:31}}","replies":[]}]}]},{"poster":"Vino y Falopa","date":"2018-11-02T19:58:17.010+0000","up_votes":1,"down_votes":0,"body":"Me anda pasando lo mismo me hace un ruido tipo \"turu\" y se me queda congelado nunca en estos años me paso y hace 1 semana empezo.. Estoy por reinstalar pero veo que no es algo mio sino del juego.. Si alguien sabe que pasa podria dar una solucion porfa..","replies":[]}]}