{"poster":"Ardens33","date":"2017-05-14T10:03:29.825+0000","title":"silver alto come bronzo?","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"salve, apro questo thread per sapere cosa ne pensate: salendo di 2/3 divisioni ho notato che ci siano sempre 1 / 2 player per team che sembrano boostati proprio. per esempio adc che non kitano quando in silver 5 c&#039;erano delle vayne ch elo facevano (decentemente) qui proprio stanno impalati.\r\n\r\nho notato che in generale un sacco di gente non rispetta la pressure che hanno i nemici, gente che rientra in un fight perso, gente che si fa grabbare mentre killa il Giorgio ecc..\r\n\r\nnon che io sia forte eh, ma noto sempre pi&ugrave; di quei player che si nota che giochino come se avessero cliccato ranked invece che normal. \r\nmi spiego, non si tratta di perdere la lane o essere behind, perch&eacute; uno anche se perde la lane sa come rendersi utile al team, roammare, dare kill ai compagni, splitpushare, non morire se non strettamente necessario (es sacrificarsi per uno shutdown) eccetera, invece questi player di cui parlo sembrano proprio su un altro pianeta, non sanno come farsi carryare, non so se mi spiego. &egrave; una mia impressione o capita anche a voi?","replies":[{"poster":"Šlim Shady","date":"2017-05-14T10:21:50.808+0000","up_votes":2,"down_votes":0,"body":"tranquillo che questo tipo di player si trovano da tutti le parti fino al platino penso...\ni fattori posso variare,\npotrebbe essere outfill oppure passare un bad day, se però riesci a dare il meglio di te in ogni game e imparare qualcosa da quelli che perdi vedi che sali anche avendo questo tipo di persone in team :)","replies":[{"poster":"Darkinknight","date":"2017-05-14T13:00:44.445+0000","up_votes":1,"down_votes":0,"body":"Tranquillo che in platino non cambia","replies":[]}]},{"poster":"Nice Doggo","date":"2017-05-15T09:23:25.509+0000","up_votes":1,"down_votes":0,"body":"A me stanno capitando partite davvero troppo sbilanciate.. silver alto gold basso.. c' è chi a 20 minuti ha 200 minion (wtf) e chi ne ha tipo 60, ci sta il bad game a tutti.... però noto chi ha proprio la MEDIA","replies":[]},{"poster":"LightIsMyPath","date":"2017-05-14T23:23:59.420+0000","up_votes":1,"down_votes":0,"body":"Sono i nuovi giocatori piazzati in silver alto probabilmente.. Si vede quando proprio non hanno idea di quello che stanno facendo..","replies":[]},{"poster":"superkey97","date":"2017-05-14T20:52:51.694+0000","up_votes":1,"down_votes":0,"body":"Eh si, io dico sempre: \"non giudicare il libro dalla copertina\" e nel caso di LoL è incredibilmente vero. Non fraintendere, credo che da una ranked B5 ad una S3/S2/S1 che dir si voglia, la differenza c'è e si vede, dico solo che magari, c'è sempre il ragazzo che sta avendo un brutto game o semplicemente non è nella lega giusta","replies":[]},{"poster":"B3L14R","date":"2017-05-14T17:22:39.778+0000","up_votes":1,"down_votes":0,"body":"Purtroppo l'elo è sporco, ovunque, è pieno di boostati come detto da te, ma anche di un'altra brutta categoria: gli smurf. La sola cosa che puoi constatare è che mediamente da bronzo a silver il livello si alzi, ma se ti concentri sui singoli, non ne esci.\nL'altro giorno in ranked un gp contro teemo, al 12° minuto, era 0/4 ed aveva perso persino la torre dell'inhibitor. Ovviamente abbiamo perso la partita... Sai che elo era il ragazzo?p3. Non puoi farci nulla purtroppo, la sola soluzione è salire di elo, non risolverai del tutto il problema, ma almeno, di casi umani, ne incontrerai di meno.","replies":[]},{"poster":"Kim114","date":"2017-05-14T14:07:55.335+0000","up_votes":1,"down_votes":0,"body":"anche io sono scarso, e  posso capire quelle persone, ma almeno se sono bad e sò che se {{champion:58}} mi guarda male MUOIO non lo fighto, non sono come i bronzi orgogliosi tipo {{champion:92}} 0/7 main che và a provare a traddare...","replies":[{"poster":"ZZALA","date":"2017-05-14T14:18:50.928+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kim114,realm=EUW,application-id=MJVj50Jw,discussion-id=R5QTA50f,comment-id=0002,timestamp=2017-05-14T14:07:55.335+0000)\n>\n> anche io sono scarso, e  posso capire quelle persone, ma almeno se sono bad e sò che se {{champion:58}} mi guarda male MUOIO non lo fighto, non sono come i bronzi orgogliosi tipo {{champion:92}} 0/7 main che và a provare a traddare...\n\nSe sei main con Riven vinci qualsiasi matchup e partita .","replies":[{"poster":"Kim114","date":"2017-05-14T15:12:11.966+0000","up_votes":1,"down_votes":0,"body":"fammi cambiare champ di esempio\n\n> tipo  0/7 main{{champion:12}} ap che và a provare a traddare...","replies":[]}]}]},{"poster":"Mix lyc4n ","date":"2017-05-14T14:12:36.119+0000","up_votes":1,"down_votes":0,"body":"Troverai queste persone fino al diamond, quindi divertiti finché puoi .\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Dantazzo","date":"2017-05-14T10:31:56.787+0000","up_votes":1,"down_votes":0,"body":"Ormai pure il gold è come il bronzo XD","replies":[]}]}