{"poster":"Ardens33","date":"2016-01-10T02:25:36.318+0000","title":"Retrocedere di division","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"salve, sono appena stato promosso in b3 e, al solito ne ho perse 3 di fila. nella prima un afk una persa normalmente la terza per colpa del team (seriamente ero 19 / 10 con una quadra e full build al 30esime e lo score totale era tipo 30/40.   )\r\nvolevo sapere se ne perdo una retrocedo in b 4? (quarta persa di fila )\r\nps. non rompete solo perch&eacute; son bronzo e se sei forte sali quindi  se non sali sei scarso. ^^","replies":[{"poster":"Frattaglia","date":"2016-01-10T11:39:37.593+0000","up_votes":4,"down_votes":0,"body":"Potrebbe essere, si.\n\np.s. cerca di morire di meno, perché 10 morti sono troppe ^^","replies":[]},{"poster":"Ryuk1980","date":"2016-01-10T09:14:41.493+0000","up_votes":2,"down_votes":2,"body":"Non possiamo sapere se scendi perdendone un'altra e se ti rileggi per 100 volte le prime 3 righe, capirai perchè non riesci a uscire dal bronzo.","replies":[{"poster":"NIGERUNDAYO JoJo","date":"2016-01-10T11:08:48.683+0000","up_votes":3,"down_votes":0,"body":"Il tizio non ha chiesto come uscire dal bronzo^^\nEvitiamo commenti inutili che fan nascere solo astio","replies":[]}]},{"poster":"ForFockSake","date":"2016-01-10T22:51:40.902+0000","up_votes":2,"down_votes":0,"body":"Se già con tre partite perse non sei sceso vuol dire che il tuo mmr é ancora da b3, cmq con la 4 sicuro al 97% scendi, cmq che ti frega, giocala, poi ci ritorni tranquillo in b3\n\nTi parlo per esperienza personale, quando salgo poi scendo per poi risalire , non mi é ancora successo di salire e rimanerci, ci devo salire un paio di volte ","replies":[{"poster":"Whommy","date":"2016-01-11T12:27:14.536+0000","up_votes":1,"down_votes":0,"body":"l'mmr non corrisponde al rank\n\nnon sta scendendo per il semplice motivo che le 3 sconfitte anche a 0LP non hanno inciso ancora sul suo MMR, successivamente alla terza sconfitta si va in losestreak e si rischia di essere retrocessi.","replies":[]}]},{"poster":"Foschìa","date":"2016-01-11T15:13:10.721+0000","up_votes":1,"down_votes":0,"body":"Molto probabilmente rischi, ma se ne hai già perse 3 vuol dire che hai un mmr altino per il b4 per cui giocala tranquillo\n\nP.S. Ricorda: se sei forte sali :)","replies":[]},{"poster":"TheMasterOrso","date":"2016-01-10T12:28:59.433+0000","up_votes":1,"down_votes":0,"body":"Da quello che ne so, dovresti retrocedere, io credevo che dopo 3 partite perse di seguito proprio quando raggiungi il B3 e non ne hai vinto neanche 1, dovresti essere retrocesso a B4 ma dovrebbe darti 1 vittoria \"Gratuita\" quando rivai al Promo per B3.","replies":[]},{"poster":"NIGERUNDAYO JoJo","date":"2016-01-10T11:09:36.218+0000","up_votes":1,"down_votes":0,"body":"Solitamente se ti trovi in una strike lose e stai con pochi pl potresti retrocedere","replies":[]},{"poster":"Keshiu","date":"2016-01-10T10:11:57.609+0000","up_votes":1,"down_votes":1,"body":"leftala così lo scopri","replies":[]}]}