{"poster":"FreeDodgeJustAsk","date":"2019-12-13T11:20:18.423+0000","title":"Kann Riot endlich was gegen die Bots machen?","subforum":"Champions & Gameplay","up_votes":5,"down_votes":3,"body":"Seit fast einem Monat sind die Koop-Games mit Bots verseucht.\r\nIch habe nicht die Zeit normals zu suchten, bis ich mal gewinne und Koop-Games waren bisher immer eine entspannte Methode um einen schnellen täglichen Sieg zu bekommen (und nebenbei Troll-Builds wie full AD-Nunu auszuprobieren, die in normalen Games niemals klappen würden).\r\n\r\nIch habe absolut keine Lust jeden Tag eine halbe Stunde meines Lebens zu versuchen, 1 vs 5 zu pushen und einen hard-carry zu picken.\r\n\r\n\r\nUnd wehe einer kommt jetzt mit sowas wie \"Ist doch eh voll easy gegen Bots zu kämpfen\", \"Koop-Games spielt doch eh keiner\"\r\n\r\n1. Nur weil ihr etwas nicht spielt. heißt es nicht, dass niemand es spielt. Es gibt auch andere Menschen auf der Welt.\r\n\r\n2. Denkt daran, es gibt auch neue Spieler für die Koop-Games ein Einstieg in League sein sollte.\r\n\r\n3. Ich wie gesagt keine Lust mich in Koop-Games anzustrengen. Wenn ich tryharden will, gehe ich ins Ranked.","replies":[{"poster":"NeeNeeNEEKO","date":"2019-12-13T15:49:05.752+0000","up_votes":2,"down_votes":1,"body":"Egal was ich spiele... ich spiele immer mit Bots... nur leider sind die Bots in Neekos Team :c\n\n*Sad Neeko Noises*","replies":[]},{"poster":"Angel Ayume","date":"2019-12-13T11:37:55.809+0000","up_votes":2,"down_votes":2,"body":"https://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/jIefAiR1-levelbots-flut-in-bot-games\n\nSchau doch mal hier. Das Thema gab es vor ein paar Tagen schonmal. \nLies dich da einfach durch, lösche deinen Thread. Kannste deine Meinung in dem bereits vorhandenen Thread abgeben. :)","replies":[{"poster":"Feelthesunsglory","date":"2019-12-16T06:27:43.656+0000","up_votes":1,"down_votes":0,"body":"Bloß nicht :D Umso mehr Aufmerksamkeit umso schneller ist Rito zum handeln gezwungen. Im Monat 30 Skins zu releasen rechnet sich halt mehr als ein Programm zu schreiben das Bots erkennt.","replies":[{"poster":"HyperionCH","date":"2019-12-16T08:51:24.708+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Feelthesunsglory,realm=EUW,application-id=Wj1wcocU,discussion-id=unRgT0je,comment-id=00000000,timestamp=2019-12-16T06:27:43.656+0000)\n>\n> Bloß nicht :D Umso mehr Aufmerksamkeit umso schneller ist Rito zum handeln gezwungen. Im Monat 30 Skins zu releasen rechnet sich halt mehr als ein Programm zu schreiben das Bots erkennt.\n\nPssst...\nIch bin mir nicht sicher, ob Riot Games Sarkasmus versteht. :D\n\nAbgesehen davon ist es langfristig rentabler, wenn die Coop-Games nicht über längere Zeit mit doch sehr vielen Farmbots überflutet werden.\nDenn 30 neue Skins sind nicht so rentabel, wenn Anfänger wegen Farmbots LoL wieder deinstallieren. Schliesslich sind die Anfänger von heute die RP-Käufer von morgen.","replies":[]}]}]},{"poster":"RitosMoriarty","date":"2019-12-13T14:30:11.411+0000","up_votes":2,"down_votes":6,"body":"Welche Bots? Du verwechselt wohl Spieler, die einen schlechte Tag haben oder Neuling sind. In dem Koopmode  gibts es Bots, aber nur auf der Gegnerseite.","replies":[]}]}