{"poster":"GrenadesAndHamm","date":"2017-09-27T18:49:09.883+0000","title":"After problems instituting the patch, I made a game and can't connect - help! :)","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"I had a topic up where I wasn't able to institute the patch.  When I opened the game, it told me it was trying to restore the game to an old version.  Each time I opened the game (many times), it gave me this message and wouldn't let me access any part of the game.  I closed the game, and opened using administrator privileges, and it opened normally.  I don't know why that would make a difference. \n\nI made a custom game.  As soon as the game started, it disconnected.  \n\nNow, every time I sign in, it says \"reconnect.\"  When I press the reconnect button, it does nothing but show me the button again.  I can see that my status says \"In Game.\"  \n\nI had an separate issue where I needed to restore my computer to a couple days ago.  That may have affected it, but no idea how to fix it. \n\nAlso, when the login screen come up after starting the game, the red message that says your name and password isn't correct flashes quickly and returns to normal.  This is before I even have a chance to enter anything.  I don't know if that makes a difference at all.\n\nNew info: I saw I was out of game (possibly because my character in the previous game didn't move and the game quit???) and tried to make another with the same result.\n\nIdeas? \n\nThanks for any help.\n\nUpdate:  Reinstalled game and it worked. I'll leave this up in case someone has a fix for others.  ","replies":[{"poster":"Broporo","date":"2017-09-28T22:07:32.167+0000","up_votes":1,"down_votes":0,"body":"You mentioned that reopening the client as admin was able to fix that issue in the past, so it sounds like the pc restore you did earlier this week might have affected your permission settings. Check out this [**permissions**](https://support.riotgames.com/hc/en-us/articles/204134104-Setting-up-your-Permissions) guide for how you can set those back up, but if that doesn't stop this problem feel free to reach back out to me!","replies":[]},{"poster":"MilizBeaz","date":"2017-09-28T18:23:38.402+0000","up_votes":1,"down_votes":0,"body":"Same here too. After Champion Select (in every Gamemode)  I get the message \"Unable to connect to Server\" I googeld it and tried to fix it by myself. But useless. I checked Firewall, AntiVir, Graphic Drivers, Net Framework, i deinstalled and installed the Game twice. Nothing worked. Now im very sad :/ and dont know what to try else. Some of my friends can still Play. So this is not a Problem that matters to all.\nAh and by the way im EU West. I will try NA mybe this helps. BUT PLS RIOT FIX YOUR SERVER/CLIENT PROBS!","replies":[]},{"poster":"sanshaoye","date":"2017-09-27T20:50:38.346+0000","up_votes":1,"down_votes":0,"body":"exactly same here","replies":[]}]}