{"poster":"xPhaiN","date":"2015-04-18T09:31:52.918+0000","title":"EP Boosts (+ Abstimmung)","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":2,"body":"Hallo zusammen,\r\n\r\nich habe eine Frage an die, die diesen Thread lesen. Und zwar w&auml;rt ihr daf&uuml;r weiterhin nach diesem EP-Wochenende weiterhin Boosts zu kriegen. Ich spreche nicht von den gleichen wie an diesem Wochenende, sondern ein bisschen weniger.\r\nHier eine kleine Vorschau:\r\n\r\n1 Spieler: Kein Boost\r\n2 Spieler: EP x 0,5 oder +25-50 EP\r\n3 Spieler: EP x 1 oder +50-75 EP\r\n4 Spieler: EP x 1,5 oder +75-100 EP\r\n5 Spieler: EP x 2 oder +100-150 EP\r\n\r\nEs k&ouml;nnte ja auch gehen, wenn dieser nicht permanent, sondern zum Beispiel nur am Wochenende (Freitag-Sonntag) verf&uuml;gbar ist.\r\nWas meint ihr dazu? Bitte stimmt bei der Umfrage ab, um ein Ergebnis zu erreichen.\r\n(Mir ist bewusst, dass EP-Boosts (die k&auml;uflichen, dann noch st&auml;rker werden))!\r\n\r\nMfG GermanButini","replies":[{"poster":"Phynóbe","date":"2015-04-18T12:32:10.835+0000","up_votes":2,"down_votes":0,"body":"Bin auch dafür, dass es nur als Event sein sollte.\nWieso sind die Leute eigentlich immer so undankbar?","replies":[]},{"poster":"Megnok","date":"2015-04-21T18:58:42.580+0000","up_votes":1,"down_votes":0,"body":"Solange man mit dem EP nichts machen kann brauch ich auch keinen Boost dafür o.O sitze seit jahren auf 50k +","replies":[]},{"poster":"YouStoleMyName","date":"2015-04-18T12:22:55.362+0000","up_votes":1,"down_votes":0,"body":"Denkt eig auch mal jemand an die Spieler, die IP on Mass haben und keine Ahnung haben, was Sie damit noch machen sollen ?","replies":[]},{"poster":"GxT Focus me pls","date":"2015-04-18T12:20:29.695+0000","up_votes":1,"down_votes":0,"body":"Also: \"2 Spieler: EP x 0,5\" ist ja eigentlich total unsinning :D Wer will denn nur den halben Teil von seinen normalen EP's bekommen? :D Aber ich verstehe was du meinst, auch wenn es falsch ist ^^\nWäre schön, wenn es nur ein Event bleiben würde, denn jeden Tag, bzw jedes Wochenende wäre einfach zu übertrieben, da kannst du jedem gleich unendlich IP geben :)\nMir fehlt die Funktion: \"Weiterhin als Event\" :)","replies":[]},{"poster":"Black Mage","date":"2015-04-18T10:16:10.162+0000","up_votes":1,"down_votes":0,"body":"also: ein normal game, mit 2 weiteren mates, würde dir eigentlich würde dir reichen um \"halb\" soviel zu spielen um die selbe anzahl an IP zu bekommen, hell, wenn die flat rate kommen sollte würde dies sich nochmals verringern....\n\nmit dem model kannst du die IP auch verschenken, würde riot zwar etwas mehr schaden, aber auch nicht sonderlich viel mehr...\n\nklares nein, da sonst riot pleite gehen wird","replies":[]}]}