{"poster":"Dr PwN","date":"2016-04-12T15:37:16.659+0000","title":"Fastweb - Utenti fibra con ping alto di sera","subforum":"Aiuto e supporto","up_votes":5,"down_votes":3,"body":"Ciao,\r\n\r\nvorrei segnalare un thread a tutti quei players che hanno problemi di ping nella fascia oraria 20:00-00:00 e che sono clienti fibra Fastweb. Il thread di cui parlo &egrave; stato aperto da un tecnico Fastweb sul forum ufficiale del provider in modo da raccogliere quante pi&ugrave; segnalazioni &egrave; possibile di giocatori che hanno problemi verso il server EUW di LoL (ed eventualmente verso altre destinazioni, giochi online popolari ecc).\r\n\r\n&Egrave; chiaro ormai da un po&#039; di tempo che Fastweb ha problemi di routing verso server localizzati in Germania-Olanda che portano ad un aumento massiccio del ping in quella fascia oraria, arrivando anche a 150-200.\r\n\r\nPerdete 10 minuti del vostro tempo e lasciate qui una segnalazione, magari si riesce a risolvere questo noioso problema che va avanti da mesi:  [FASTWEB PROBLEMI DI LATENZA](https://fastweb.it/forum/servizi-rete-fissa-tematiche-tecniche/problemi-di-lentezza-e-latenza-su-alcuni-server-su-ftth-t10679.html)","replies":[{"poster":"Floppyz","date":"2016-04-12T17:28:15.229+0000","up_votes":2,"down_votes":0,"body":"Premesso che a me funziona bene, ma siam sicuri che quello (che chiede certi dati) sia un omino di Fastweb, autorizzato a fare 'sta roba? :P","replies":[{"poster":"Dr PwN","date":"2016-04-12T17:35:55.661+0000","up_votes":1,"down_votes":0,"body":"Capisco la tua perplessità e avevo anche io lo stesso dubbio.\nPoi guardando nello storico dei suoi messaggi mi sono reso conto che è effettivamente un loro tecnico.","replies":[{"poster":"Kopoo","date":"2016-04-12T18:05:01.853+0000","up_votes":1,"down_votes":0,"body":"Non ho la possibilità di accedere ai suoi messaggi, ma sinceramente sembra abbastanza strano che un tecnico fastweb non abbia nessuna targhetta, abbia solo 60 messaggi e si sia iscritto solo una decina di giorni fa. Non per fare il paranoico, ma fossi in te farei attenzione.","replies":[{"poster":"Floppyz","date":"2016-04-12T18:45:43.629+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kopoo,realm=EUW,application-id=98NGV4Al,discussion-id=ag4kyYZE,comment-id=000100000000,timestamp=2016-04-12T18:05:01.853+0000)\n>\n> Non ho la possibilità di accedere ai suoi messaggi, ma sinceramente sembra abbastanza strano che un tecnico fastweb non abbia nessuna targhetta, abbia solo 60 messaggi e si sia iscritto solo una decina di giorni fa. Non per fare il paranoico, ma fossi in te farei attenzione.\n\nSono gli stessi dubbi che ho anche io. Inoltre è strano che Fastweb non abbia ufficializzato la cosa in alcun modo.\n\nIntendiamoci, poi magari è un bravo cristo in buona fede, ma non lo sappiamo con certezza.","replies":[{"poster":"Dr PwN","date":"2016-04-12T19:52:18.248+0000","up_votes":1,"down_votes":0,"body":"Sono 2 mesi che parlo con l'assistenza tecnica riguardo questo problema e non vedendo risultati forse sono stato troppo frettoloso nel comunicare qualche dato di troppo a questa persona.\nPotrei aver commesso un'imprudenza, ma indipendentemente dai dati sensibili è possibile comunque postare i propri valori di tracert/ping in totale anonimato se si desidera contribuire alla risoluzione di questo problema.","replies":[{"poster":"Dr PwN","date":"2016-04-13T14:54:23.615+0000","up_votes":1,"down_votes":0,"body":"Spinto dai vostri dubbi ho chiesto all'assistenza Fastweb tramite la loro pagina Twitter di confermarmi che quell'utente è effettivamente un tecnico.\nMi hanno risposto di si, è uno di loro. Purtroppo lì la moderazione non è esattamente molto attiva.\nMagari non ve ne importa nulla ma volevo rassicurare chiunque si fosse posto la stessa domanda.","replies":[]}]}]}]}]}]},{"poster":"Wolfrighten","date":"2016-04-13T10:51:17.382+0000","up_votes":1,"down_votes":0,"body":"Premetto che non sono ancora un utente \"fibra\", ma ho anche io lo stesso identico problema con Fastweb.\nDalle 21:00 esatte il ping mi aumenta di 100 ms (quindi da 70/75 > 170 ms).\nMenomale che il mio contratto scade a Giugno.\nAnche se con le adsl come le assicurazioni auto...quando uno lascia la strada vecchia per la nuova sa quello che perde ma non so quello che trova.","replies":[]},{"poster":"AcQuAmAn1","date":"2016-04-13T10:50:21.972+0000","up_votes":1,"down_votes":0,"body":"a me funziona bene","replies":[]},{"poster":"iKharon","date":"2016-04-12T18:54:44.419+0000","up_votes":1,"down_votes":0,"body":"Qualcuno ha mai provato a chiamare il servizio clienti e sentire cosa dicono?","replies":[{"poster":"Dr PwN","date":"2016-04-12T19:49:56.099+0000","up_votes":1,"down_votes":0,"body":"Io molte volte. Purtroppo l'assistenza tende a far riferimento solo al loro speedtest sulla MyFastPage, che basandosi su un server praticamente sotto casa del cliente non ha alcun valore tecnico.","replies":[{"poster":"Floppyz","date":"2016-04-12T19:54:26.891+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dr PwN,realm=EUW,application-id=98NGV4Al,discussion-id=ag4kyYZE,comment-id=00030000,timestamp=2016-04-12T19:49:56.099+0000)\n>\n> Io molte volte. Purtroppo l&#x27;assistenza tende a far riferimento solo al loro speedtest sulla MyFastPage, che basandosi su un server praticamente sotto casa del cliente non ha alcun valore tecnico.\n\nVeramente lo speed test è piuttosto affidabile, e non sta sotto casa :P","replies":[{"poster":"Dr PwN","date":"2016-04-12T19:58:57.282+0000","up_votes":1,"down_votes":0,"body":"Con il loro speedtest ho un ping inferiore a 2, download a 100 mega circa e upload intorno ai 40.\nNon posso dire che avvenga lo stesso verso server localizzati in Olanda o in Germania (sempre nella fascia oraria in cui il ping aumenta a dismisura, altrimenti normalmente si).\n\nUn ping di quel genere posso averlo solo in Italia e neanche troppo lontano dalla mia regione, quindi non ha grande valore per problemi di routing.","replies":[{"poster":"Floppyz","date":"2016-04-12T20:36:00.438+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dr PwN,realm=EUW,application-id=98NGV4Al,discussion-id=ag4kyYZE,comment-id=0003000000000000,timestamp=2016-04-12T19:58:57.282+0000)\n>\n> Con il loro speedtest ho un ping inferiore a 2, download a 100 mega circa e upload intorno ai 40.\n> Non posso dire che avvenga lo stesso verso server localizzati in Olanda o in Germania (sempre nella fascia oraria in cui il ping aumenta a dismisura, altrimenti normalmente si).\n> \n> Un ping di quel genere posso averlo solo in Italia e neanche troppo lontano dalla mia regione, quindi non ha grande valore per problemi di routing.\n\nBeh no, ovviamente se stai analizzando dei problemi di routing, dei tempi di risposta non te ne fai niente, così come della banda disponibile. Ma di per se, lo speed test è affidabile.\n\nIl casino è che i problemi di routing sono una cosa ostica da diagnosticare e sistemare, soprattutto quando si parla di reti grandi, figurati quindi se parliamo di Internet, dove ci sono in gioco sessioni di routing fra diversi AS appartenenti a carrier diversi, che dovrebbero quindi impiegare ingenti risorse per problemi tutto sommato di poco impatto, se confrontati alla mole di traffico che gestiscono (che poi in pratica è il motivo per cui se tu chiami il tuo ISP da casa tua e gli parli di problemi di routing in pratica ti ridono in faccia, come quando vai dalle forze dell'ordine a denunciare il furto di un cellulare a opera di ignoti).\n\nCredo sia anche per questo che Riot ha investito specificatamente sotto questo aspetto, collaborando strettamente con non-so-quali/quanti carrier.","replies":[]}]}]}]}]},{"poster":"MonkeyCarriesU","date":"2016-04-12T20:01:27.339+0000","up_votes":1,"down_votes":0,"body":"Pure da me stesso problema, 50-60 ms durante il pomeriggio, torno dagli allenamenti 170-200 ms.","replies":[]},{"poster":"iKharon","date":"2016-04-12T17:04:28.706+0000","up_votes":1,"down_votes":0,"body":"Stesso problema da più di un mese ormai. Come un orologio svizzero il ping su League dalle 21:00 fino le 23:30 circa passa da 35 ms a 150 se non di più e rimane tale per almeno un paio d'ore. Grazie per la dritta comunque! In un certo senso è gratificante non sentirsi l'unico ad avere questo tipo di problema. Domani sera farò i test necessari e vediamo cosa dicono sul forum di Fastweb.","replies":[]}]}