{"poster":"SkylerNorth","date":"2016-12-22T22:44:26.745+0000","title":"Please Help Me.","subforum":"Player Behavior","up_votes":1,"down_votes":2,"body":"So, last night I was being unsportsmanlike. Well actually, more than unsportsmanlike, worse. I am deeply sorry for what Ive done and from the information Ive found you cannot appeal for behavioral / toxic punishments. I just wanted to apologize for disturbing the peace in the community.  Ive been playing league since about 2013 or 2014 and I&#039;m gonna miss playing. I&#039;m not gonna bring up how much money Ive spent on the game because there really isn&#039;t any point. I just wanted to apologize for what Ive done and apologize for being so immature. I do not think I&#039;m different from anyone else asking for an unban but please give me one more chance. I don&#039;t want to go through getting up to level 30 again and I really worked hard on getting that level. I&#039;ve won 7 of my placement matches and I had 3 more games until I found out what rank I got. I was doing great and I don&#039;t know why I had such a disturbing break down. I would have submitted a ticket but I couldn&#039;t find a specific reason on why to submit the ticket. So I&#039;m just gonna put it here under &quot;Player behavior &amp; moderation.&quot; I want some opinions from the community. I know that I&#039;ve gotten many chat suspensions and one account suspension in the past but I regret getting those and I deeply regret disturbing this community&#039;s peace, so I am hesitant of posting this and I expect rude/truthful replies like &quot;If you were given this many warnings, you wouldn&#039;t have done this, do not waste time in writing paragraphs and apologies.&quot; and &quot;You deserve this if you&#039;ve been punished so many times.&quot; I know, and I realized that I did wrong, and I am deeply sorry for what I did.\r\n\r\nThanks for reading.","replies":[{"poster":"Deep Terror Nami","date":"2016-12-22T22:47:43.684+0000","up_votes":3,"down_votes":0,"body":"It's not that you *can't* appeal a ban for toxic behavior, it's just that it's very unlikely Riot will consider it. Once in a blue moon someone that got banned for severe behavior might get their punishment reduced if they don't have a history of negative behavior and they appear to be sincere in not doing it again. You can submit a [Support Ticket](https://support.riotgames.com/hc/en-us/requests/new) if you want to try.","replies":[{"poster":"SkylerNorth","date":"2016-12-22T22:55:26.379+0000","up_votes":1,"down_votes":0,"body":"I want to submit a support ticket, its just I don't know what subject to submit the ticket into.","replies":[{"poster":"Deep Terror Nami","date":"2016-12-22T23:18:06.636+0000","up_votes":1,"down_votes":0,"body":"I use **I have a question > Game & Features > General Questions** for anything that doesn't seem to have a more appropriate category.","replies":[{"poster":"SkylerNorth","date":"2016-12-22T23:56:52.580+0000","up_votes":1,"down_votes":0,"body":"Alright, Ill try that soon. Thank you for the help.","replies":[]}]}]}]},{"poster":"Iron Eric","date":"2016-12-22T22:45:53.291+0000","up_votes":2,"down_votes":0,"body":"If you get unbanned why shouldn't I be?","replies":[]},{"poster":"Alaric The Sic","date":"2016-12-22T23:07:32.619+0000","up_votes":1,"down_votes":0,"body":"You are the reason people don't enjoy playing this game. The more people like you that get perma banned. The better.","replies":[{"poster":"SkylerNorth","date":"2016-12-22T23:12:31.408+0000","up_votes":1,"down_votes":1,"body":"I said I'm sorry, and if players see someone being toxic or un-enjoyable* they can mute the player.","replies":[{"poster":"Deep Terror Nami","date":"2016-12-22T23:19:16.635+0000","up_votes":1,"down_votes":0,"body":"> if players see someone being toxic or un-enjoyable* they can mute the player\n\nThat isn't an excuse to be toxic. It's up to you to control your behavior, not make everyone else do it for you. If a player is forced to mute someone then they've already become a problem.","replies":[{"poster":"SkylerNorth","date":"2016-12-22T23:25:17.809+0000","up_votes":1,"down_votes":0,"body":"I understand that, I wasn't willing to try to disable chat because I was confident, then I realized when I got perm banned I cannot control my actions and I realized that I need to disable chat. By disable chat I mean for myself only. I can see my teammates messages so if they are calling out something important I can see it. I can use pings instead of chat to hold me back from typing in something offensive. I understand what you are saying and I completely agree with it. But I feel like I can control myself now that I know that this is actually a  permanent ban. Not threats.","replies":[]}]}]}]},{"poster":"MagicFlyingLlama","date":"2016-12-22T22:49:49.739+0000","up_votes":1,"down_votes":0,"body":"You clearly did quite a lot to escalate all the way to a permban.\n\nInstead of being sorry, you should have considered not doing it. If you are unable to control yourself, you will just do it again anyway.","replies":[{"poster":"SkylerNorth","date":"2016-12-22T22:52:20.286+0000","up_votes":1,"down_votes":1,"body":"You're right, but if I change the chat key to something I won't know, then that will hold me back. I'm willing to do anything to get unbanned.","replies":[]}]}]}