{"poster":"DonFrontman","date":"2017-01-23T20:32:17.230+0000","title":"La gente... è strana","subforum":"Discussioni generali","up_votes":6,"down_votes":2,"body":"**Premetto che non sto dicendo che ho carriato io, ma che tutta la squadra ha giocato bene.**\r\nInizio la ricerca di una partita.\r\nTrova la partita, mi da la mid lane.\r\nIl jungler mi chiede di fare scambio, io accetto. Quindi lui prende Kayle e io Maokai.\r\nEarly game continuo a fare gank in mid (a sua richiesta) e lascio anche quasi tutte le kill a lui. (su 7 ne prendo una).\r\nFinisce la partita.\r\nVinciamo.\r\nk/d/a mio: 11/5/21\r\nk/d/a Kayle: 14/5/8\r\nIo: &quot;GG WP team&quot;\r\nKayle: &quot;Shut the f..k up you noob. you are just lucky because i carried you, otherwise you would have lost. it&#039;s only &quot;gg wp kayle&quot; not &quot;gg wp team&quot;. you all bad motherf...s.\r\nSpiegatemi voi perch&egrave; io non capisco e non so cosa dire, se adesso la gente ti insulta anche per un &quot;gg wp&quot;... io boh.\r\n{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Dr LouD","date":"2017-01-23T20:56:44.799+0000","up_votes":10,"down_votes":1,"body":"Si chiama ciclo mestruale","replies":[{"poster":"Sorcio84","date":"2017-01-24T10:40:29.491+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=q1pxqEzk,comment-id=0001,timestamp=2017-01-23T20:56:44.799+0000)\n>\n> Si chiama ciclo mestruale\n\nil nuovo warwick approva questo commento e si prepara all'inseguimento\n\n(battuta pessima ma volevo farla comunque alla prima occasione)","replies":[]},{"poster":"vondarck","date":"2017-01-24T12:38:01.788+0000","up_votes":1,"down_votes":0,"body":"{{champion:8}} trigged","replies":[]},{"poster":"Virtus87","date":"2017-01-23T23:36:25.666+0000","up_votes":1,"down_votes":0,"body":"LOL xD{{sticker:zombie-brand-mindblown}}","replies":[]}]},{"poster":"WhiteToArcher","date":"2017-01-23T20:48:14.980+0000","up_votes":3,"down_votes":0,"body":"Spero tu lo abbia reportato senza esitazione per comportamento negativo, linguaggio offensivo, e ci aggiungere anche incitazione all'odio.\nSebbene è strano da dire, è normale che ci si siano persone con queste attitudini (trovare queste persone è normale, ma questo non significa che esse stesse siano normali).\n\nLa cosa migliore che mi auspico è il problema in questione sia stato prodotto da un adolescente, nella speranza che quando cresca metta un pò di sale in zucca e mostri cenni di maturità.\n\nLo so che stiamo parlando di un gioco, ma sappiate che inconsciamente il nostro carattere e le nostre emozioni possono essere percepite sia per quello che scriviamo, sia per il modo in cui indirettamente ci si comporta (se io sono arrabbiato perchè support mi frega tutte le kill e non mi lascia farmare come si deve, ed io decido di trollare, questo oltre ad essere reportabile è anche frutto del mio carattere).\n\nSebbene su LoL sembra ci sia molta gente dalla leggendaria educazione (non nel senso di educazione eccezionale, ma di educazione che è quasi leggenda), c'è anche gente rispettosa, ed è su questa che ti consiglio di concentrarti.\nA prescindere dall'esito della partita è molto più bello perdere con una persona estremamente e sinceramente amichevole, piuttosto che vincere con una persona la cui maturità è solo eventualmente frutto di un dato anagrafico.","replies":[{"poster":"DonFrontman","date":"2017-01-23T21:05:52.872+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WhiteToArcher,realm=EUW,application-id=MJVj50Jw,discussion-id=q1pxqEzk,comment-id=0000,timestamp=2017-01-23T20:48:14.980+0000)\n>\n> Spero tu lo abbia reportato senza esitazione per comportamento negativo, linguaggio offensivo, e ci aggiungere anche incitazione all&#x27;odio.\n> Sebbene è strano da dire, è normale che ci si siano persone con queste attitudini (trovare queste persone è normale, ma questo non significa che esse stesse siano normali).\n> \n> La cosa migliore che mi auspico è il problema in questione sia stato prodotto da un adolescente, nella speranza che quando cresca metta un pò di sale in zucca e mostri cenni di maturità.\n> \n> Lo so che stiamo parlando di un gioco, ma sappiate che inconsciamente il nostro carattere e le nostre emozioni possono essere percepite sia per quello che scriviamo, sia per il modo in cui indirettamente ci si comporta (se io sono arrabbiato perchè support mi frega tutte le kill e non mi lascia farmare come si deve, ed io decido di trollare, questo oltre ad essere reportabile è anche frutto del mio carattere).\n> \n> Sebbene su LoL sembra ci sia molta gente dalla leggendaria educazione (non nel senso di educazione eccezionale, ma di educazione che è quasi leggenda), c&#x27;è anche gente rispettosa, ed è su questa che ti consiglio di concentrarti.\n> A prescindere dall&#x27;esito della partita è molto più bello perdere con una persona estremamente e sinceramente amichevole, piuttosto che vincere con una persona la cui maturità è solo eventualmente frutto di un dato anagrafico.\n\nBeh si l'ho riportato. Anche se non so che peso abbia, visto che gli insulti gli ha riportati nella chat di fine partita.\nSono ancora adolescente, anche se per pochi mesi lo sono ancora, quindi potrei offendermi.\nNo apparte gli scherzi, spero vivamente che la gente cosa diminuisca fino a sparire.","replies":[{"poster":"ImSmurfnHolyPogz","date":"2017-01-23T21:15:05.841+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=RHradu,realm=EUW,application-id=MJVj50Jw,discussion-id=q1pxqEzk,comment-id=00000000,timestamp=2017-01-23T21:05:52.872+0000)\n>\n> Beh si l&#x27;ho riportato. Anche se non so che peso abbia, visto che gli insulti gli ha riportati nella chat di fine partita.\n> Sono ancora adolescente, anche se per pochi mesi lo sono ancora, quindi potrei offendermi.\n> No apparte gli scherzi, spero vivamente che la gente cosa diminuisca fino a sparire.\n\nfinché questo gioco rimarrà free to play ci saranno sempre adolescenti rincoglioniti. Non avere la barriera del prezzo di entrata ha sempre avuto questo difetto in ogni game abbia mai giocato","replies":[{"poster":"FunghettoVlad","date":"2017-01-23T21:49:21.312+0000","up_votes":5,"down_votes":0,"body":"Beh, pensa se fosse a pagamento. Pagheresti 5,6,7 euro al mese per poter trovare comunque il 12enne che ti fiamma per tutta la partita. Oltre il danno, la beffa.","replies":[{"poster":"ImSmurfnHolyPogz","date":"2017-01-24T13:03:06.750+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FunghettoVlad,realm=EUW,application-id=MJVj50Jw,discussion-id=q1pxqEzk,comment-id=0000000000000000,timestamp=2017-01-23T21:49:21.312+0000)\n>\n> Beh, pensa se fosse a pagamento. Pagheresti 5,6,7 euro al mese per poter trovare comunque il 12enne che ti fiamma per tutta la partita. Oltre il danno, la beffa.\n\nBeh, comincia a fare pagare 30 euro per creare un account\n\n- diminuirebbero gli \"smurf\", quindi i server sarebbero meno carichi e più stabili\n- la gente ci penserebbe 2 volte prima di rischiare un ban trollando intenzionalmente il proprio team\n- l'età media si innalzerebbe automaticamente, molti adolescenti ora preferiscono i f2p da smartphone","replies":[]}]},{"poster":"Ringiel","date":"2017-01-24T00:47:53.346+0000","up_votes":1,"down_votes":0,"body":">finché questo gioco rimarrà free to play ci saranno sempre adolescenti rincoglioniti\n\nsi,perchè su wow non esistono dodicenni o gente che flamma?","replies":[]}]},{"poster":"WhiteToArcher","date":"2017-01-24T10:42:25.402+0000","up_votes":1,"down_votes":0,"body":"Ahahah ma non c'è nulla di direttamente offensivo nei confronti degli adolescenti. Il termine adolescente da me utilizzato non si riferisce all'età anagrafica (che essendo dato di fatto non è opinabile), ma al modo di pensare ed agire come un ragazzo/a che non ha acquisito ancora molta maturità.\n\n> La cosa migliore che mi auspico è il problema in questione sia stato prodotto da un adolescente, nella speranza che quando cresca metta un pò di sale in zucca e mostri cenni di maturità.\n\nQuesta frase si riferisce al fatto che se l'atto commesso da colui di cui ti lamenti è commesso da un adolescente, allora ciò è quantomeno giustificabile in ragione della sua tenera età e del suo stato oggettivo.\nCosa grave se invece fosse stato compiuto da un soggetto che di maturità ne dovrebbe avere da vendere, in quanto la giustificazione verrebbe meno.\nNulla di offensivo contro di te. Nulla di offensivo per quanto mi riguarda neanche contro gli adolescenti, almeno in generale.\nBuona giornata ^^","replies":[{"poster":"DonFrontman","date":"2017-01-24T17:36:42.021+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WhiteToArcher,realm=EUW,application-id=MJVj50Jw,discussion-id=q1pxqEzk,comment-id=000000000001,timestamp=2017-01-24T10:42:25.402+0000)\n>\n> Ahahah ma non c&#x27;è nulla di direttamente offensivo nei confronti degli adolescenti. Il termine adolescente da me utilizzato non si riferisce all&#x27;età anagrafica (che essendo dato di fatto non è opinabile), ma al modo di pensare ed agire come un ragazzo/a che non ha acquisito ancora molta maturità.\n> \n> Questa frase si riferisce al fatto che se l&#x27;atto commesso da colui di cui ti lamenti è commesso da un adolescente, allora ciò è quantomeno giustificabile in ragione della sua tenera età e del suo stato oggettivo.\n> Cosa grave se invece fosse stato compiuto da un soggetto che di maturità ne dovrebbe avere da vendere, in quanto la giustificazione verrebbe meno.\n> Nulla di offensivo contro di te. Nulla di offensivo per quanto mi riguarda neanche contro gli adolescenti, almeno in generale.\n> Buona giornata ^^\n\nSi lo avevo capito :). Stavo solo scherzando io.","replies":[]}]}]},{"poster":"Virtus87","date":"2017-01-23T23:37:33.602+0000","up_votes":1,"down_votes":0,"body":"D'accordissimo su tutto con te! Qualcuno sarebbe da prendere a testate....Cit. {{champion:12}}","replies":[]}]},{"poster":"Virtus87","date":"2017-01-23T22:22:33.773+0000","up_votes":1,"down_votes":5,"body":"***","replies":[{"poster":"NicogenFTW","date":"2017-01-24T09:51:13.874+0000","up_votes":1,"down_votes":1,"body":"lol\n\nnext level propaganda proprio.\n\nSai che si chiama spam e potrebbe essere reportabile sulla board ? :C","replies":[{"poster":"Virtus87","date":"2017-01-25T05:54:55.322+0000","up_votes":1,"down_votes":0,"body":"Ho risposto solo ad un commento dicendogli la mia, scrivendo normalmente...e mettendo un link in descrizione del canale che ho...non mi sembra di aver fatto niente di male. Cmq se ho dato noia a qualcuno chiedo scusa! Non era mia intenzione :) {{sticker:slayer-jinx-wink}}","replies":[]}]}]},{"poster":"Sorcio84","date":"2017-01-24T10:54:08.773+0000","up_votes":1,"down_votes":0,"body":"In lane, abilità personale\nin roaming, abilità personale, più teamwork\nDa soli non si vince. Io stesso ero con kda spettacolari e perdevo, poi ho capito alcune cose, e ho vinto indipendentemente dal kda, riuscendo a ribaltare alcuni game e prendere obiettivi al momento giusto.\nQuello che manca spesso e volentieri, è il rispetto verso gli altri giocatori.\nEcco la mentalità di certa gente :\n\n*comportamento antisportivo*\n- Io ho vinto, voi avete perso, chi ha perso è una merda\n- Io ho perso, gli avversari sono dei bastardi\n\n*manie di grandezza*\n- Abbiamo vinto e ho un kda fantastico, i miei alleati sono nabbi carriati\n- Abbiamo vinto, e ho un kda orrendo, ho carriato io con l'azione giusta al momento giusto, il resto del team non conta\n\n*vittimismo*\n- perchè devo avere sempre alleati idioti e perdere ?\n- Perchè devo avere sempre alleati idioti e mi tocca carriare 1v16 ?\n___\nranked in bronzelife, perdo quasi sempre quando c'è vayne in uno dei due team. Un alleato vuole pickarla, gli chiedo se è sicuro di essere god vayne, non risponde per 15 secondi di fila, banno vayne all'ultimo per sscelta strategica, tilta e va disco nunu feedando e beccandosi tutto il flame del team mentre io, kindred jng, stavo 3/2. Persa.\n\nUltima ranked fatta, volevo andare yi jng, ma uno non vuole e me lo banna, tranquillo, picko shyvana. non abbiamo adc e soffriamo un casino.\nLategame riusciamo a vincere un teamfight e chiudere il game. Vinto.\n\nLa differenza è che a tizio hanno bannato il champ ed è schizzato fuori dal sistema solare, io invece me ne sono fregato e ho cambiato pick e ho giocato e basta, e il risultato si è visto.\n\nIn una ranked sempre oggi hanno bannato blitz a uno, e gli ho detto, picka thresh sei sempre la coi grab, e niente tilt.\n___ \nQuindi quando trovi sti rage kid o gente antisportiva, o che ti fa perdere di proposito per dispetto, fai finta di niente, gioca , e a fine game reportala.\nSono gia a quota 2 persone sanzionate questo mese :D\n\nps: avevo voglia di scrivere un pò","replies":[{"poster":"Dissociated","date":"2017-01-24T15:28:44.174+0000","up_votes":1,"down_votes":0,"body":"Le storie mi sono piaciute:D","replies":[]}]},{"poster":"AnDGames","date":"2017-01-24T12:24:52.776+0000","up_votes":1,"down_votes":0,"body":"probabilmente si stava fappando di fronte a cotante kills","replies":[]},{"poster":"Piombo Savage","date":"2017-01-24T09:14:28.078+0000","up_votes":1,"down_votes":0,"body":"Benvenuto nella landa degli evocatori!","replies":[]},{"poster":"Kim114","date":"2017-01-23T21:27:00.005+0000","up_votes":1,"down_votes":0,"body":"Io trovo gente che scrive sempre ez, e capisco, sfotti\nMa non sopporto gente che dice HI NOOBS WE WON BECAUSE WE ARE PRO AND YOUR TEAM non dico lamparola","replies":[]}]}