{"poster":"Sylias Ravenmore","date":"2019-08-01T22:55:17.812+0000","title":"As a player with Autism, I'd LOVE to have one F-ing day where I wasn't called a R%%%%%.","subforum":"Player Behavior","up_votes":18,"down_votes":17,"body":"First off... I'm going to throw riot logic back at them and say this:\r\n\r\nA mute/filter feature isn't a justifiable reason to let players use this language.\r\n\r\n\r\nI'm so sick of being called a r%%%%% every other game. \r\n\r\nIt really isn't that hard to program your chat feature to completely filter that word out.\r\n\r\nIn pseudocode \"IF String = \"R%%%%%\" then ****\"\r\n\r\n\r\nI shouldn't have to mute someone over being called a r%%%%% because they shouldn't be able to use the fucking word in the first place.\r\n\r\n\r\n\r\nYou people that use r%%%%% as an insult are fucking animals. People with my conditions and similar hurt themselves and or kill themselves over being called that. For people like me... the insults can stick with us for days and weeks.\r\n\r\n\r\nYour not funny, your not cool. Your a fucking asshole.\r\n\r\n\r\nThere is no legitimate FUCKING reason for someone to use the word R%%%%% in league.\r\n\r\n\r\nYes I know there is a medical use of that word... but the people going around using it aren't using it for medical reasons now are they?\r\n\r\n\r\nI don't mean to go on a tirade... but after being called a r%%%%% all day.. and getting called one in the last match... then saying.. hey thats not cool. I'm autistic that's highly offensive... then being called a R%%%%% 8 more times... yeah I'm pretty pissed right now.. and yeah I did some things I regretted. \r\n\r\n\r\n\r\nI need to be able to see chat to know whats going with the team. If I use the mute feature.. I'm already losing 50% of my total communication with the team. 100% if they start being an asshole and pinging me for no reason. If I don't mute chat and pings.. I have to sit there and be harassed and insulted.","replies":[{"poster":"insomniacjezz","date":"2019-08-01T23:40:46.425+0000","up_votes":9,"down_votes":1,"body":"I’m pretty sure that 99% of the people who call you that have absolutely no idea that you have autism.","replies":[{"poster":"Febos","date":"2019-08-01T23:44:35.342+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=insomniacjezz,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=0009,timestamp=2019-08-01T23:40:46.425+0000)\n>\n> I’m pretty sure that 99% of the people who call you that have absolutely no idea that you have autism.\n\nSure, but that's not the point. You shouldn't insult anyone regardless of their condition, or lack thereof.","replies":[{"poster":"Mayobe","date":"2019-08-02T00:23:45.336+0000","up_votes":1,"down_votes":2,"body":"Your mother is an ostrich and you smell of elderberries.","replies":[{"poster":"Febos","date":"2019-08-02T00:27:21.869+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mayobe,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=000900000000,timestamp=2019-08-02T00:23:45.336+0000)\n>\n> Your mother is an ostrich and you smell of elderberries.\n\nHow dare you?! I'll let you know I'm half-lizard, half-human and half-lion. My mother is a lizard, not an ostrich!","replies":[{"poster":"Childofdragons","date":"2019-08-04T07:28:50.173+0000","up_votes":2,"down_votes":1,"body":"I FART IN YOUR GENERAL DIRECTION","replies":[]}]}]}]},{"poster":"Sylias Ravenmore","date":"2019-08-01T23:45:29.300+0000","up_votes":3,"down_votes":3,"body":"That is true. However, for one.. it shouldn't be acceptable to say in League. It has no place.\n\nTwo: Generally when someone says it, I say \"hey, I have autism, that word is really offensive\"\n\nWhich is what just happened in my last match, and that player decided to further relentlessly harass me afterwards with polite phrases like \"GJ r%%%%%\" and \"oh is the little r tard mad\"","replies":[{"poster":"PlsTouchMeGently","date":"2019-08-02T06:03:22.183+0000","up_votes":4,"down_votes":0,"body":"I mean . . . yes? Why respond with that? Why not just mute? Do you really think the average imbecile you encounter in this game gives a flying f***? No, they don’t, and if you tell them it highly offends you most of them are just going to do it more. So just mute and report at the end of the game.","replies":[]}]}]},{"poster":"Get Ogre Here","date":"2019-08-01T23:05:47.274+0000","up_votes":7,"down_votes":0,"body":"The only R word I like is Rigatoni \n\n{{sticker:sg-poppy}}","replies":[{"poster":"Zardo","date":"2019-08-01T23:43:05.681+0000","up_votes":5,"down_votes":0,"body":"Really reasonable revelation.","replies":[]}]},{"poster":"Sylias Ravenmore","date":"2019-08-01T23:14:38.693+0000","up_votes":4,"down_votes":5,"body":"Someone needs moderator privs revoked.\n\nAsshole.\n\nhttps://oi1339.photobucket.com/albums/o713/mnewton1989/bs_zpsgniy6i6r.jpg","replies":[{"poster":"The Djinn","date":"2019-08-02T00:06:46.561+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Sylias Ravenmore,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=0007,timestamp=2019-08-01T23:14:38.693+0000)\n>\n> Someone needs moderator privs revoked.\n> \n> Asshole.\n\nThat's not a moderator change -- when the forum censor (which *does* censor that word automatically) kicks in, it can sometimes bug out the \"edit\" view by moving the censored characters to another part of the post. If I go to do a moderator edit on your post now, for example, I see that same thing -- even though it doesn't show in your post currently.\n\nIt's a frustrating and obnoxious bug, but I can't give you an ETA on getting it fixed at this point in time because I'm not frankly sure what *causes* it.","replies":[{"poster":"Sylias Ravenmore","date":"2019-08-02T00:13:52.406+0000","up_votes":1,"down_votes":6,"body":"I sent a ticket into support either way. I'm sure they can determine if it was a bug or if the post was tampered with, as I'm quite sure it is the first time this has ever happened on a post I've made with this word..and about this very subject.","replies":[{"poster":"The Djinn","date":"2019-08-02T00:16:25.776+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Sylias Ravenmore,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=000700010000,timestamp=2019-08-02T00:13:52.406+0000)\n>\n> I sent a ticket into support either way. I'm sure they can determine if it was a bug or if the post was tampered with, as I'm quite sure it is the first time this has ever happened on a post I've made with this word..and about this very subject.\n\nI'm 100% positive the post was not tampered with, as this is a board bug I'm well aware of and have personally documented numerous times in the past.","replies":[]}]}]},{"poster":"Telephone Booth","date":"2019-08-01T23:42:39.591+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Sylias Ravenmore,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=0007,timestamp=2019-08-01T23:14:38.693+0000)\n>\n> Someone needs moderator privs revoked.\n> \n> Asshole.\n> \n> https://oi1339.photobucket.com/albums/o713/mnewton1989/bs_zpsgniy6i6r.jpg\n\nOh shit. Someones definitely gettin fired. Wow. (I guess its not really \"fired\" but you know what i mean) thats fucked up.","replies":[]}]},{"poster":"report adc feed","date":"2019-08-02T10:19:29.776+0000","up_votes":4,"down_votes":0,"body":"I am also a player with autism, and also female -  I've definitely had my fair share of hate speech in my time playing this game.  But in my opinion - you don' need to have autism or some other kind of mental handicap to feel offended or hurt by the word. Personally I don't get mad when someone calls me it - I'm used to it - but I can definitely understand why people do. It's an awful word, even when not directed towards you (that was a ret**ded play, etc) \n\nMaybe if this hurts you so much you should stop playing league, or at least mute all every game. There's a new feature for that. If you're sensitive towards words then League really isn't the best game.","replies":[]},{"poster":"Arcade Lulu","date":"2019-08-01T23:05:52.128+0000","up_votes":5,"down_votes":1,"body":"I don't really understand why people are allowed to even use 0 tolerance words\nWhy not just block them from chat completely?","replies":[{"poster":"ﬂoo","date":"2019-08-02T10:39:39.032+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Arcade Lulu,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=0002,timestamp=2019-08-01T23:05:52.128+0000)\n>\n> I don't really understand why people are allowed to even use 0 tolerance words\n> Why not just block them from chat completely?\n\nIf you force people to use other ways to spell it out, like the n-word with pinging e+r it makes it harder to find them and punish accordingly.","replies":[]}]},{"poster":"Hailey Hayato","date":"2019-08-02T18:42:12.575+0000","up_votes":3,"down_votes":0,"body":"I understand what you are saying. understand this well. \nYou need thicker skin. And I speak from experience. I've personally played so many matches in so many different games and I've been called every single word in the book. Some of the more harsher and flat out derogatory terms actually apply to me. Yet I don't take offence cause quite frankly. \n\nIt's just a word first and foremost. Second of all, why should YOU care about what some random no-life stranger has to say about you?\nYou are your own person, and by letting them get to you. You directly let them dictate who you are. Which, needless to say. You shouldn't.\n\nNow then: should they call you the \"R\" word? Preferably not. But it's just a word no less and only have as much power as you are giving it. It's only as powerful as YOU let it be. Which means the source of it's strength is you. Should they call you R-word? Preferably not. Should you be giving it this power/Strength? Totally not.","replies":[]},{"poster":"Knihovak","date":"2019-08-01T23:05:00.466+0000","up_votes":3,"down_votes":0,"body":"Hang in there.","replies":[]},{"poster":"GodlyBane","date":"2019-08-02T03:49:18.761+0000","up_votes":4,"down_votes":1,"body":"You shouldnt take it differently just because you have autism. I get called r%%%%%ed, you get called r%%%%%ed, some guy named snowyfeather04 gets called r%%%%%ed. Dont take it so personally. You getting offended just because you have a condition that nobody knows about is, well, r%%%%%ed. Just shrug it off. So what some person on the internet called you something. They dont, and never will know you in real life. I know what im saying may sound harsh but its just the truth. I will say it again. I get called r%%%%%ed, you get called r%%%%%ed, some guy named Jayceg0d2019 gets called r%%%%%ed. If you let people get to you that easily, then what are you going to do when someone IRL actually says that to you, fully aware of your condition? Sorry again for sounding harsh, but just accept the fact the word r%%%%%ed doesnt even have much meaning or ground behind it. Its just a phrase.","replies":[]},{"poster":"Pxerkza","date":"2019-08-01T23:12:00.319+0000","up_votes":5,"down_votes":10,"body":"***","replies":[{"poster":"Sylias Ravenmore","date":"2019-08-01T23:31:05.084+0000","up_votes":3,"down_votes":0,"body":"I'm autistic. I'm not r%%%%%ed. However, people like to call me a r%%%%% and treat me differently because they don't understand who I am and my condition.\n\nI'm capable of more than most people give me credit for.","replies":[{"poster":"Pxerkza","date":"2019-08-02T00:01:48.373+0000","up_votes":5,"down_votes":2,"body":"so how do they figure out you are autistic?\ndo you just randomly state it at the beginning of the game?\n\nif someone calls you a r%%%%% and you didn't in any way mention you were autistic then it's a groundless insult that bears no weight\nSO why are you taking offense of something that isn't true?","replies":[{"poster":"Sylias Ravenmore","date":"2019-08-02T00:14:46.508+0000","up_votes":2,"down_votes":3,"body":"Generally when they start using that word, whether directed at me or another player.. I politely say \"Hey man, I'm autistic, I find that word offensive.\"","replies":[{"poster":"Wimbledofy","date":"2019-08-02T01:11:12.149+0000","up_votes":4,"down_votes":1,"body":"Why is it necessary for you to do that? I'm christian, but whenever someone curses I don't say  \"Hey I'm christian, i find those words offensive.\" I just let it go because I know I'm not going to change what they say.","replies":[{"poster":"The23rdGamer","date":"2019-08-02T08:09:20.656+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wimbledofy,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=00060000000000000001,timestamp=2019-08-02T01:11:12.149+0000)\n>\n> Why is it necessary for you to do that? I'm christian, but whenever someone curses I don't say  \"Hey I'm christian, i find those words offensive.\" I just let it go because I know I'm not going to change what they say.\n\nPretty much this tbh.","replies":[]}]},{"poster":"Pxerkza","date":"2019-08-02T00:19:03.468+0000","up_votes":7,"down_votes":4,"body":"Why? You aren't r%%%%%ed so why do you find it offensive?\n\nI don't find racial slurs offensive for instance unless they are directed towards my race.\n\nOffense is only taken.\nWhy do you take offense of something that isn't true for you?","replies":[{"poster":"NelsieLisnen","date":"2019-08-02T12:33:03.414+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Pxerkza,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=00060000000000000000,timestamp=2019-08-02T00:19:03.468+0000)\n>\n> Why? You aren't r%%%%%ed so why do you find it offensive?\n> \n> I don't find racial slurs offensive for instance unless they are directed towards my race.\n> \n> Offense is only taken.\n> Why do you take offense of something that isn't true for you?\n\n\"I don't find things that are hurtful to others bad unless they are directed towards me and my specific condition\". Hmm, maybe we are dealing with a case of pathological lack of empathy","replies":[{"poster":"Pxerkza","date":"2019-08-02T12:50:03.810+0000","up_votes":2,"down_votes":2,"body":"unless it's for someone i care about i don't care \n\nthere are far too many terrible things going on in the world for me to care what words some asshole decides to use towards someone else\n\nyes children die in africa every single day from starvation but im not going to restourants at the end of the day and shitting on them for throwing away food\n\nchoose your fights better","replies":[{"poster":"Jhins Girlfriend","date":"2019-08-02T17:43:08.621+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pxerkza,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=0006000000000000000000000000,timestamp=2019-08-02T12:50:03.810+0000)\n>\n> unless it's for someone i care about i don't care \n> \n> there are far too many terrible things going on in the world for me to care what words some asshole decides to use towards someone else\n> \n> yes children die in africa every single day from starvation but im not going to restourants at the end of the day and shitting on them for throwing away food\n> \n> choose your fights better\n\nBelieve it or not, it is possible to care about more than one thing at once.","replies":[{"poster":"Pxerkza","date":"2019-08-02T19:30:24.815+0000","up_votes":2,"down_votes":0,"body":"yes there are plenty of things i care about\nthe things i don't care about are the things i have no direct control over\n\nthere are better things to spend my time and effort on","replies":[]}]},{"poster":"NelsieLisnen","date":"2019-08-02T13:08:06.352+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Pxerkza,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=0006000000000000000000000000,timestamp=2019-08-02T12:50:03.810+0000)\n>\n> unless it's for someone i care about i don't care \n> \n> there are far too many terrible things going on in the world for me to care what words some asshole decides to use towards someone else\n> \n> yes children die in africa every single day from starvation but im not going to restourants at the end of the day and shitting on them for throwing away food\n> \n> choose your fights better\n\nSo what fight do you fight? Because from what you write one would assume that your fight is \"I don't care about stuff that happens to others\". Ending world hunger or imperialist wars would require decades of planning and coordination on many levels of social participation on the part of the people, ending with the overthrowing of oppressive governments. On the other hand, being respectful and shutting down discrimination can begin with an act as simple as saying \"Yeah, that's wrong, I support your right to mutual respect\" or \"hey, what you are doing is wrong, stop it and get educated while you're at it\", instead of \"oh deal with it you crybaby\" You are telling me that you can't bother doing that? Alright then.","replies":[{"poster":"Pxerkza","date":"2019-08-02T13:21:44.865+0000","up_votes":2,"down_votes":2,"body":"there are better things to do than protecting the fragile feelings of someone i don't care about\n\nyou are preeching for abolishing free speech btw\n\nlearn to disagree with people without enforcing your subjective morals onto them","replies":[{"poster":"NelsieLisnen","date":"2019-08-02T14:09:56.466+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Pxerkza,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=000600000000000000000000000000000000,timestamp=2019-08-02T13:21:44.865+0000)\n>\n> there are better things to do than protecting the fragile feelings of someone i don't care about\n> \n> you are preeching for abolishing free speech btw\n> \n> learn to disagree with people without enforcing your subjective morals onto them\n\nOk so you don't feel like bothering with respecting others. Clear on that. Also free speech is not a high ideal on its own. There are other rights that take precedence over free speech such as the right to physical and mental well being and yes, when the social representation of a group of people is being distorted and used as a means of discrimination, them suffering as a result, with varying detrimental consequences then your right to say whatever you want counts as secondary and I will call anyone out on that. Also you can't **DIS**-agree with others without challenging their moral and political standing. I would go as far as to say that since you side with disrespect, ridicule and misanthropy then you should be subjected to social restrictions that deprive you of the rights you place higher than those considered primary but excluded from the latter as well, since you are knowingly soliciting the circumvention of said rights, thus being a danger to the well being of society as a whole.\n\nBye","replies":[{"poster":"Pxerkza","date":"2019-08-02T15:00:31.414+0000","up_votes":1,"down_votes":1,"body":"you can disagree with them but you shouldn't force your morals onto them\n\ntell them they are assholes\ntell them that those words hurt your feelings\nbut telling them that they can't use their language because it hurts your feelings is not OK\n\nnobody deserves respect that isn't earned\nthis doesn't mean that you should disrespect them\nsomething called middle ground\n\n the right to physical and mental well being\nvs\nthe right of free speech\n\nwhich do you prefer \nbeing all nice and cozy with your mouth and arms glued together so you can't express yourself\nor\nthe right to not have your feelings hurt or punched for being an asshole?","replies":[{"poster":"NelsieLisnen","date":"2019-08-02T17:12:38.818+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Pxerkza,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=00060000000000000000000000000000000000000000,timestamp=2019-08-02T15:00:31.414+0000)\n>\n> you can disagree with them but you shouldn't force your morals onto them\n> \n> tell them they are assholes\n> tell them that those words hurt your feelings\n> but telling them that they can't use their language because it hurts your feelings is not OK\n> \n> nobody deserves respect that isn't earned\n> this doesn't mean that you should disrespect them\n> something called middle ground\n> \n>  the right to physical and mental well being\n> vs\n> the right of free speech\n> \n> which do you prefer \n> being all nice and cozy with your mouth and arms glued together so you can't express yourself\n> or\n> the right to not have your feelings hurt or punched for being an asshole?\n\nIf insulting the existence of other people is the quintessential form of expression to you, then I can only feel sorry for you. Maybe you can't experience actual happiness without hurting others, but there are forms of expression that don't violate humanitarian values, just so you know. Holding yourself back from being misanthropic and hurtful isn't tantamount to being tied and muzzled, unless you are that much of a horrible human being that you need to spread hate every time you exhale, at which point, you wouldn't deserve to be held up to the standards of human rights.\n\nHere's a more accurate version of the twisted dilemma you concocted:\n\nActing reserved when you want to direct your anger at other people and not insulting them with slurs that misportray entire groups\n                                 \nvs\n\nDoing the opposite, making them feel horrible to boost your ego.\n\nThat's it","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Myrmiron","date":"2019-08-02T07:58:34.260+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Sylias Ravenmore,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=00060000,timestamp=2019-08-01T23:31:05.084+0000)\n>\n> I'm autistic. I'm not r%%%%%ed. However, people like to call me a r%%%%% and treat me differently because they don't understand who I am and my condition.\n> \n> I'm capable of more than most people give me credit for.\n\nLiterally no one online knows who you are, r%%%%% is just against everyone regardless of their condition.\nYou get treated like everyone else online which really is the beauty of online, everyone is equal.","replies":[]},{"poster":"SeductiveCelery","date":"2019-08-02T21:30:59.404+0000","up_votes":1,"down_votes":0,"body":">is iron 1 after 300 games\n>\"I'm capable of more than most people give me credit for\"\n\nomegalul\n\nIn all seriousness just mute them, you won't gain anything into biting the toxic people.","replies":[]}]},{"poster":"cars3n","date":"2019-08-02T02:21:13.418+0000","up_votes":2,"down_votes":0,"body":"Hello? That’s like getting mad at an African American for getting called the n word.","replies":[{"poster":"Pxerkza","date":"2019-08-02T07:57:41.031+0000","up_votes":2,"down_votes":0,"body":"so what do you call the black people living in asia and europe?\nafrican europeans? african asian?\n\nthose people are black people or americans not AfRicAN AmERIcaN","replies":[]}]}]},{"poster":"Hammermancer","date":"2019-08-01T23:11:16.061+0000","up_votes":5,"down_votes":3,"body":"> [{quoted}](name=Sylias Ravenmore,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=,timestamp=2019-08-01T22:55:17.812+0000)\n>\n> First off... I'm going to throw riot logic back at them and say this:\n> \n> A mute/filter feature isn't a justifiable reason to let players use this language.\n> \n> \n> I'm so sick of being called a r%%%%% every other game. \n> \n> It really isn't that hard to program your chat feature to completely filter that word out.\n> \n> In pseudocode \"IF String = \"R%%%%%\" then ****\"\n> \n> \n> I shouldn't have to mute someone over being called a r%%%%% because they shouldn't be able to use the fucking word in the first place.\n> \n> \n> \n> You people that use r%%%%% as an insult are fucking animals. People with my conditions and similar hurt themselves and or kill themselves over being called that. For people like me... the insults can stick with us for days and weeks.\n> \n> \n> Your not funny, your not cool. Your a fucking asshole.\n> \n> \n> There is no legitimate FUCKING reason for someone to use the word R%%%%% in league.\n> \n> \n> Yes I know there is a medical use of that word... but the people going around using it aren't using it for medical reasons now are they?\n> \n> \n> I don't mean to go on a tirade... but after being called a r%%%%% all day.. and getting called one in the last match... then saying.. hey thats not cool. I'm autistic that's highly offensive... then being called a R%%%%% 8 more times... yeah I'm pretty pissed right now.. and yeah I did some things I regretted. \n> \n> \n> \n> I need to be able to see chat to know whats going with the team. If I use the mute feature.. I'm already losing 50% of my total communication with the team. 100% if they start being an asshole and pinging me for no reason. If I don't mute chat and pings.. I have to sit there and be harassed and insulted.\n\nThe word is simply a measurement of intellect, it's effectively claiming you have an IQ below 80, it's not like idiot is any better","replies":[{"poster":"kurthl33t","date":"2019-08-02T00:56:13.388+0000","up_votes":3,"down_votes":6,"body":"***","replies":[{"poster":"Hammermancer","date":"2019-08-02T03:17:58.961+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=kurthl33t,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=00040002,timestamp=2019-08-02T00:56:13.388+0000)\n>\n> Congratulations, you have just proven that you are not informed enough on the subject to have a relevant opinion.  You are excused.  I assume you can see yourself out?\n\n\"you disagree with me ergo you are the villain and uninformed\"","replies":[{"poster":"kurthl33t","date":"2019-08-02T14:11:28.452+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Hammermancer,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=000400020000,timestamp=2019-08-02T03:17:58.961+0000)\n>\n> \"you disagree with me ergo you are the villain and uninformed\"\n\nYou literally don't know the proper terminology and what it means.  When you do, you may come back and join the discussion.  Until then, we bid you adieu.","replies":[{"poster":"Hammermancer","date":"2019-08-02T15:28:51.937+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=kurthl33t,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=0004000200000000,timestamp=2019-08-02T14:11:28.452+0000)\n>\n> You literally don't know the proper terminology and what it means.  When you do, you may come back and join the discussion.  Until then, we bid you adieu.\n\nOh and one more thing\n\n\n[From Merriam webster](https://www.merriam-webster.com/dictionary/mental%20r%%%%%ation)\n> \nmental r%%%%%ation noun\nDefinition of mental r%%%%%ation\n: subaverage intellectual ability equivalent to or less than an IQ of 70 that is accompanied by significant deficits in abilities (as in communication or self-care) necessary for independent daily functioning, is usually present from birth or infancy, and is manifested especially by delayed or abnormal development, by learning difficulties, and by problems in social adjustment :\n\n\nThis fully aligns what I said\n\n\nalso on that page:\n> \n>  INTELLECTUAL DISABILITY\n> NOTE: The term intellectual disability is now preferred over mental r%%%%%ation especially in medical, educational, and regulatory contexts. Mental r%%%%%ation is still widely used in speech and writing, though it may sometimes be considered offensive.\n> \n\nIt seems 'Developmentally delayed\" and \"Mentally handicapped\" have both been replaced within the last decade because of the same recurring incident of the word not being the issue but rather the human beings valuing intelligence above virtually all else in factors of the value of an individual and the contributions they could likely make","replies":[]},{"poster":"Hammermancer","date":"2019-08-02T15:15:42.349+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=kurthl33t,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=0004000200000000,timestamp=2019-08-02T14:11:28.452+0000)\n>\n> You literally don't know the proper terminology and what it means.  When you do, you may come back and join the discussion.  Until then, we bid you adieu.\n(\nDo you want me to go into specific conditions that lead to mental r%%%%%ation?\n\nmental r%%%%%ation is literally nonvenomous with \"Slow cognitive function\" which means \"You're dumb\", Intelligence is measured by rapidity of problem solving and separated into sub categories such as emotional and mechanical.\n\nI'm an aspie, I've looked into this shit a lot farther than your average joe because it helped me to comprehend various elements about the language on my condition and way with which to cope.\n\nYou haven't even corrected me you just told me I don't know, and pretend you k now something that you refuse to explain, which I would assume must be locked away in a APA book or else you'd win immediately by copy pasting a link off the internet, because as you explained, my terminology is 'wrong'\n\nThe truth is, this term is still valid and used both colloquially and professionally.  In law i t refers to someone under an IQ of 80. The term has morphed over time into synonyms which have also just morphed into the same insult because just as calling someone a weakling is an eternal instinct since strength is often an important basic element of human physiology, intellect is also, and additionally intellect is tied to potential capacity and threat level just as strength is, which means you're claiming people are effectively inferior to you when you say this. The insult is a challenge of dominance and flailing around about it will usually result in your social credibility lost, at which point you will in effect fulfill the insult as you have been dropped lower on the social hierarchy.\n\n\nBecause I'm so bad at social interaction I  had to learn psych principals in order to basic function in society and I have to often consciously appeal to instinct trends in order to get anything done because I talk funny, have issues looking people in the eyes, and really suck at comprehending other perspectives on the fly, I am effectively r%%%%%ed in Emotional intelligence and am fairly above average  in mechanical and mathematical intelligence.  Note i'm not claiming to be a genius in any way nor am I huffing my own farts, I'm telling you that a basic survival skill of aspies is effectively to understand dominance posturing in order to avoid being mocked out of work places.\n\nBut just because I'm a  perpetual black sheep does not mean I have any right of comeuppance or field leveling. Just as people aren't entitled to me spending my time helping them fix their computers and cars, I'm not entitled to their social grace. It's an innate skill, I suck at it, I don't deserve to command how others utilize it.\n\n Actually the way I've bought the least hostility and most respect in my life was to A.) Stand my ground on my principals not on nitpicking and B.) Accept criticism even if delivered poorly. Outright disrespect however I don't tolerate but I cut that cord easily enough by not raging, and depending on the situation either using calm and friendly response or assertive dismissal, that being said I'm not so petty as to say \"You're not allowed to state your subjective opinion on my shortcomings when they affect your life because I'm bad at something\".\n\nFrankly you get more respect from being calm and collected  (Even when i'm heated) then you do from getting all triggered and crying over the choice of words a bully uses to try to antagonize you, in effect proving their point (As I said the insult is effectively calling you a lesser) because you're reacting in exactly the way they want you to. You're talking to a man who has earned the respect of people who tried to rob him at knife point not because he's a badass but because he stood his ground on the points that mattered and didn't bend (Such as \"Go fuck yourself you don't have the balls or incentive to kill me\" to four bluds who had me put against a wall with the edge of a knife against my neck). I didn't lose my shit, I didn't flail and cry, I thought about my situation and handled it... they didn't get my money.\n\nDo you think you can be emotionally stable with a thin skin as a black sheep? Do you think you earn any respect by proclaiming your weaknesses as some sort of a defense? It's like a guy with glasses talking shit and then going \"YoUcAnTpUnChMeIhAvEgLaSsEs\" to a bunch of hell's angels who don't give a shit about that.\n\n\nso go ahead with your upper middle class 'civility' I'm just gonna live in the real world where I know i don't have any right or power to control how people express themselves in an argument against me I only have power over my own actions, my response, and an awareness of the situation. You can either submit to the insult by freaking out over the word people use and prove that you're losing that confrontation, or you can stand proudly and let it glance off you and not let them win the interaction. \n\n\n\nSo please tell me I'm wrong some more without providing any evidence, or perspective, or insight. Ignorance isn't a powerful insult it's a condition anyways, if I'm wrong I'm wrong and there's no sin in that, but there is a sin to condemn ignorance while refusing to share your insight on the ignorance, there's a major sin in that being hypocricy. You deem what I'm  espousing condemnable without telling me why, this  means you have effectively proclaimed that you have an interest in stopping what you perceive to be my heretical and immoral perspective but will do no more then mock me for it instead of providing insight to maybe teach me how I'm wrong.\n\nI'd love that clarification honestly. Well I'll only be responding to you further if you come back intelligently with an intent to inform me and others of the incorrect nature of my beliefs and instead of coming back with intent to posture yourself as my moral superior","replies":[]}]}]}]},{"poster":"Pandemic Punch","date":"2019-08-02T13:02:17.541+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Hammermancer,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=0004,timestamp=2019-08-01T23:11:16.061+0000)\n>\n> The word is simply a measurement of intellect, it's effectively claiming you have an IQ below 80, it's not like idiot is any better\n\nYep. It is all about the intent of words. Words themselves dont mean anything without the intent. People who are offended by it will find something else to be offended by because people will just use a new word with the same intent.","replies":[{"poster":"Hammermancer","date":"2019-08-02T15:21:14.282+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Pandemic Punch,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=00040003,timestamp=2019-08-02T13:02:17.541+0000)\n>\n> Yep. It is all about the intent of words. Words themselves dont mean anything without the intent. People who are offended by it will find something else to be offended by because people will just use a new word with the same intent.\n\nI mean if intellect is highly valued in society, and these terms refer to low intellect, then usage of these terms will always be applied as insulting after only a few years or so and then they get pulled down and replaced. Simpleton, Moron, Fool, idiot, r%%%%%, etc... they all refer to the same general concept.\n\nno amount of word banning short of prewritten messages in a drop down menu will prevent the usage of that concept as an insult. This is why i preach resilience instead of sensitivity.","replies":[]}]},{"poster":"Sylias Ravenmore","date":"2019-08-01T23:39:25.950+0000","up_votes":2,"down_votes":0,"body":"Not when it's used to alienate and attack someone with certain conditions..\n\n\nI wanted to play league today and relax. Escape from my condition.\n\n\nI feel so heavy and empty after that last match and the way I was treated..\n\n\nI honestly want to just sit on the couch and stare at the wall until I die because of how shitty it's making me feel.\n\nI've lost all desire to do much of any thing else today.\n\n\nI'm starting to remember why I quit playing video games.","replies":[{"poster":"Febos","date":"2019-08-01T23:46:50.511+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sylias Ravenmore,realm=NA,application-id=ZGEFLEUQ,discussion-id=efkXE3vi,comment-id=00040001,timestamp=2019-08-01T23:39:25.950+0000)\n>\n> I'm starting to remember why I quit playing video games.\n\n[Hollow Knight](https://www.youtube.com/watch?v=UAO2urG23S4) is pretty fun. I've been playing it the whole week.\nYou don't need to play Multiplayer Games. I can have plenty of fun playing by myself in Single Player.","replies":[]}]}]}]}