{"poster":"Riot Axes","date":"2018-04-30T17:59:05.245+0000","title":"Marksman changes coming to PBE in the next couple days","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Hi folks,\r\n\r\nWe&rsquo;re going to be putting a bunch of marksman stat and item changes on the PBE over the next couple days - wanted to set initial context and talk goals first. (Important note: the changes are not shipping with 8.10 - we&rsquo;re giving them a longer soak time on PBE than usual.)\r\n\r\nMarksmen as a class have been too strong for a while, and express that strength in ways that produce only a few game states. Early setbacks in lane don&#039;t put hyperscaling carries behind enough to really matter, so most lane bully marksmen have vanished or moved to other positions. The bullies who remain tend to be champions who can also be late game carries if they win lane, namely crit-scaling bullies like Caitlyn and Rageblade champions like Varus.\r\n\r\n(As an aside, we&#039;ve heard questions about the level of influence supports have on the game. The marksman issues outlined above need to be addressed regardless of the state of supports, though.)\r\n\r\nThe changes coming to the PBE are meant to ensure that when crit carries fail in lane, it really matters, while also setting other playstyles up to carry better off the back of a good lane. This breaks down into a few themes.\r\n\r\n**CRIT-CARRY &#039;TURN-ON&#039; TIME &amp; RELIABILITY**\r\nGetting to two items (Infinity Edge + Zeal upgrade) usually makes a crit-carry marksman the most valuable champion for their team, regardless of how ahead or behind they are. Two items isn&#039;t a very high threshold for that level of impact: in all but the most lopsided games, both marksmen hit their 2-item scaling spike. \r\n\r\nWe want to push back that moment of &#039;turning on&#039; so early failure is appropriately punished and going even in lane doesn&#039;t guarantee dominance in mid-game. This gives other classes and positions more influence in matches where neither marksmen became obscenely fed in lane, moving us away from a bot-centric &#039;coin flip&#039; meta.\r\n\r\nThe primary changes here:\r\n\r\n* Reworking **Infinity Edge** to be less impactful early on, with passives that make it less powerful against early game targets and more dependent on scaling through the game as a standalone item, but still extremely powerful later on.\r\n* Simple efficiency nerfs to the **Zeal** items.\r\n\r\nAnother thing to mention is bot lane sustain has crept back up again. As usual, this means less action in lane, which puts higher priority on scaling champions. So, we also have some nerfs to marksman lane sustain:\r\n\r\n* Base health regen nerfs\r\n* **Fleet Footwork** nerf\r\n\r\n**HOMOGENOUS PLAYSTYLES** \r\nNot every marksman wants to play the crit-carry hyperscaling game, but crit builds are too smooth and too synergistic, while other builds haven&rsquo;t been supported well enough. We&#039;re planning on better enabling other playstyles - the spellslinging of a Lucian, the raw AD snowball of a Draven - by improving access to the types of effects those builds need to succeed while making crit builds less perfect: \r\n\r\n* Reworking **Essence Reaver** to function as a standalone item. It&#039;ll still reward combat patterns that combine auto attacks and spellcasts, but without a dependency on crit.\r\n* A new B.F. upgrade, **Stormrazor**, that makes your first attacks in combat more impactful.\r\n* Changing **Last Whisper** and its upgrades back to total armor penetration. This makes it a better scalar for AD and flat armor penetration builds, since it provides better value against non-armor-stacking champs. \r\n* With the switch back to total penetration, **Lord Dominik&#039;s Regards** no longer needs the extra boost against tanks the Giant Slayer passive used to offer, so we&#039;re removing the effect (and Giant Slayer).\r\n* A Domination keystone, **Hail of Blades**, with similar goals as Stormrazor\r\n* Simple efficiency buffs to **Blade of the Ruined King** and **The Bloodthirster**\r\n\r\nAnother change on this front is that marksmen are trading 4 base attack damage for a bit more AD scaling (breaking even late in lane phase or a bit thereafter). Since these are flat changes across the class, the difference in base AD between one marksman and the next will be more significant in early lane.\r\n\r\nWe&#039;re well aware of how important base AD is to effective last-hitting in lane, so this stat change will be accompanied by a &#039;training wheels&#039; last hitting assist, with the intent to remove it over the following few patches.\r\n\r\nLooking past marksmen for a moment, Stormrazor, Essence Reaver, Hail of Blades, and Last Whisper&#039;s return to total armor penetration are powerful options for AD fighters and assassins, too. We view them as positive additions for those classes in the long run, but will be watching short-term balance carefully.\r\n\r\n**OTHER OPPORTUNISTIC WORK** \r\nWe&rsquo;re taking this opportunity to address a few additional pain points, some for Marksman players, some for others:\r\n\r\n* We&#039;re reducing the late-game burst that crit marksmen deal to squishy targets via the **Infinity Edge** update, which will rework the +50% crit damage passive to one that converts a portion of crit damage to true damage. This focuses crit build effectiveness more squarely on tanky targets&mdash;a few crits on a low-defense target will still be highly impactful, but it&rsquo;s less likely they&#039;ll get two- or three-shotted.\r\n* You&#039;ll see fewer critical strike chance items early, meaning the impact of crit in lane is lower and lucky rolls won&#039;t determine the outcome of trades as often\r\n* The AD stat changes make marksmen less oppressive to lane against. Melee champs know this frustration, but in testing, mages have benefitted significantly as well.\r\n* Small changes to a number of non-crit items available to marksmen and light fighters, likely including Maw of Malmortius buffs and a Guardian Angel tweak.\r\n* Changes to **Executioner&rsquo;s Calling** and **Mortal Reminder** aimed at preserving their place as niche purchases in the game. These haven&#039;t been locked down yet, and you may see a few versions while the marksman changes are on PBE.\r\n\r\n**FEEDBACK, PLEASE**\r\nAs mentioned earlier, we&#039;ll have two patch cycles to address your feedback before shipping these changes. Once the changes hit PBE, we&#039;d appreciate feedback on the following areas:\r\n\r\n* Are you finding good use cases for each new or reworked item?\r\n* Are these item designs exciting?\r\n* As a solo laner, is interacting with Marksmen understandable?\r\n\r\nThanks everyone,\r\n\r\nRiot Axes","replies":[{"poster":"sleeping slaves","date":"2018-04-30T18:11:23.540+0000","up_votes":121,"down_votes":9,"body":"Oh my goodness what am I witnessing. The Last Whisper revert is the biggest orgasm I've had in a long time","replies":[{"poster":"Jeiku","date":"2018-04-30T21:34:19.150+0000","up_votes":26,"down_votes":1,"body":"Season 4 has returned","replies":[]},{"poster":"Last Whisper","date":"2018-04-30T20:13:54.465+0000","up_votes":23,"down_votes":2,"body":"How do you think I feel","replies":[]},{"poster":"dkznikolaj","date":"2018-04-30T20:48:57.152+0000","up_votes":15,"down_votes":2,"body":"I got a call from a war veteran that the Last Whisper revert made his arm grow back.","replies":[]}]},{"poster":"warpenguin555","date":"2018-04-30T18:13:10.416+0000","up_votes":9,"down_votes":0,"body":"What changes at are being made to zeal item efficiency? Stat nerfs, price increases, or both?","replies":[{"poster":"Riot Axes","date":"2018-04-30T18:19:21.888+0000","up_votes":59,"down_votes":1,"body":"Price increases","replies":[{"poster":"warpenguin555","date":"2018-04-30T18:37:16.486+0000","up_votes":22,"down_votes":2,"body":"Exactly what we were asking for! Thanks!","replies":[]},{"poster":"Telosen","date":"2018-04-30T19:46:06.551+0000","up_votes":17,"down_votes":7,"body":"Thank Lord Hashinshin. It didn't make much sense that ADCs had cheaper items than bruisers mages and tanks.","replies":[]}]}]},{"poster":"LechintanTudor","date":"2018-04-30T18:39:52.714+0000","up_votes":11,"down_votes":3,"body":"I'm concerned about Stormrazor allowing ADCs to burst squishy targets. I thinks the empowered attacks should come after a delay, not right off the bat, something like \"1.5 seconds after damaging a champion, your next 2 attacks deal extra damage\".","replies":[{"poster":"Riot Axes","date":"2018-04-30T18:45:08.397+0000","up_votes":45,"down_votes":4,"body":"The item that's in testing today (THINGS MAY STILL CHANGE):\n\nStormrazor\nB.F. Sword + Pickaxe + Dagger + 925 gold (3400 total)\n+65 Attack Damage\n+25% Attack Speed\nUNIQUE Passive: If you haven't attacked in the last 2.5 seconds, your next basic attack will critically strike.\nUNIQUE Passive: When you critically strike, gain 25% attack speed and 8% movement speed for 1.5 seconds.\n\nThis shouldn't be able to generate higher burst than ADCs are already capable of - it just takes the RNG out of it. (Did I burst or not?) \n\nThat rule is pretty impactful and, as I noted earlier, I have some reservations about Duskblade + Stormrazor purchases, but for max ADC burst, it isn't an increase.","replies":[{"poster":"Galiö","date":"2018-04-30T18:47:22.104+0000","up_votes":34,"down_votes":0,"body":"I can imagine top quinn with duskblade, this item and electrocute... man would that hurt.","replies":[{"poster":"Valor Bot","date":"2018-04-30T18:52:38.256+0000","up_votes":51,"down_votes":0,"body":"Shhh....","replies":[{"poster":"Galiö","date":"2018-04-30T18:57:56.797+0000","up_votes":22,"down_votes":0,"body":"Ohhh rigghhttt I mean good direction ;)","replies":[]}]}]},{"poster":"Pokemonred200","date":"2018-04-30T18:56:39.734+0000","up_votes":12,"down_votes":0,"body":"_Hello Sword of the Divine_\n\nIDK why but it reminds me of Sword of the Divine.","replies":[]}]}]},{"poster":"Infernape","date":"2018-04-30T18:03:36.139+0000","up_votes":43,"down_votes":0,"body":"Oh thank sweet merciful Jesus.","replies":[]},{"poster":"Zenthon Prime","date":"2018-04-30T18:37:12.309+0000","up_votes":36,"down_votes":0,"body":"Most of these changes seem pretty reasonable.  The one I'm easily most concerned about is the introduction of Stormrazer + Hail of Blades.\n\nI'm gonna be blunt.  The \"first auto hits really hard\" play pattern has been _insanely_ toxic in the past, pretty much without exception.  I was hoping Duskblade would eventually be removed from the game for this reason, but I understand its place as a necessary evil to delay assassin burst until they have an item.  I'm particularly worried about champs that can stack these with Lethality (obviously Duskblade, as you mentioned, but even Ghostblade would work).  I'm thinking Draven and Jhin, primarily.  Jhin normally has to wait until 3 or 4 items before he's nuking people with random one-off autos, and Draven.....well, he already does this from an early point, but I don't exactly view him as a pinnacle of League's game design.","replies":[]},{"poster":"SonicÐeHedgedawg","date":"2018-04-30T18:43:22.781+0000","up_votes":32,"down_votes":1,"body":"@Riot Axes\nHow will Randuin's interact with the new IE?  It seems counterintuitive that the premier anti-crit item would do NOTHING to counteract the premier crit item, But given how true damage works, it seems like that would be the case, so does it apply its crit damage reduction BEFORE the true damage conversion or AFTER?  Because it feels like it should be the former.","replies":[{"poster":"Riot Axes","date":"2018-04-30T18:47:08.384+0000","up_votes":42,"down_votes":5,"body":"You make a good point for sure. We're still discussing - I'm leaning towards Tabi and Randuin's applying before Infinity Edge.","replies":[{"poster":"GiantNooblord","date":"2018-05-01T01:17:16.266+0000","up_votes":32,"down_votes":1,"body":"Why not use \"ignores % armor\" like Gangplank's barrel do?\n\nIt accomplishes nearly the exact same thing as true damage without being graphic clutter (let's us appreciate other sources of true damage without it muddling everything).\n\nI think \"ignores a % of the target armor\" offers many advantages over \"true damage that can be mitigated\".\n1. Clarity: we can see the damage each individual crit does rather than it being split in several tiny numbers and muddling it with other sources of damage.\n2. It accomplishes the exact same thing as true damage in most scenarios besides extreme armor stacking.\n3. It allows % damage reduction champions still feel good.\n4. It's much more intuitive ignoring armor than true damage that can be reduced. True damage being able to be mitigated weakens it's core identity and clarity.","replies":[]},{"poster":"Skias","date":"2018-04-30T20:12:36.207+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Riot Axes,realm=NA,application-id=A7LBtoKc,discussion-id=2ykqAkNa,comment-id=002c0000,timestamp=2018-04-30T18:47:08.384+0000)\n>\n> You make a good point for sure. We&#x27;re still discussing - I&#x27;m leaning towards Tabi and Randuin&#x27;s applying before Infinity Edge.\n\nYeah, this was my big concern as a Taric player. With Targon's being nerfed into un-usability, These stats will turn on just as I'm getting tanky and true damage/total armor pen will crap on me anyways. I really miss shield battery and targon's giving gold.","replies":[{"poster":"My Waifu Vanilla","date":"2018-04-30T23:05:43.389+0000","up_votes":7,"down_votes":1,"body":"Unusability? Sure about that one? Getting almost 100g every wave after like 10 minutes is pretty good compared to the competition.","replies":[]}]}]}]},{"poster":"EgocentricDragon","date":"2018-04-30T18:06:17.128+0000","up_votes":18,"down_votes":0,"body":"Do you have any plans for how this will affect non-standard crit users like ashe and jhin?","replies":[{"poster":"Riot Axes","date":"2018-04-30T18:10:15.286+0000","up_votes":19,"down_votes":2,"body":"Stormrazor has been excellent on Jhin in testing. I'm less sure exactly what's going to happen with Ashe. I do assume significant follow-up will be necessary, and Ashe/Gangplank/Jhin/Tryndamere are all champions we'll need to keep an eye on.","replies":[{"poster":"DrLuau","date":"2018-04-30T18:13:00.106+0000","up_votes":33,"down_votes":2,"body":"> [{quoted}](name=Riot Axes,realm=NA,application-id=A7LBtoKc,discussion-id=2ykqAkNa,comment-id=00030000,timestamp=2018-04-30T18:10:15.286+0000)\n>\n> Stormrazor has been excellent on Jhin in testing. I&#x27;m less sure exactly what&#x27;s going to happen with Ashe. I do assume significant follow-up will be necessary, and Ashe/Gangplank/Jhin/Tryndamere are all champions we&#x27;ll need to keep an eye on.\n\nAdding items and masteries that front-load damage seems awful like reintroducing the Duskblade play pattern for assassins. Are you intending to keep an eye on assassin throughput with these items?","replies":[{"poster":"Riot Axes","date":"2018-04-30T18:16:54.580+0000","up_votes":24,"down_votes":2,"body":"We have been, yes.\n\nThe nuclear option will be locking out Duskblade and Stormrazor from being used together. I would strongly prefer to avoid that situation if possible, but testing has been inconclusive and its a real risk.\n\nLast Whisper is also significant here, though in that case it'll be about tuning either the lethality items' stats or the champions around a world where those builds scale better across game time.","replies":[{"poster":"ProfDrDeath","date":"2018-04-30T20:06:50.973+0000","up_votes":17,"down_votes":3,"body":"Why not have Duskblade and Stormrazor share a named passive?","replies":[{"poster":"Averia","date":"2018-04-30T21:39:05.066+0000","up_votes":12,"down_votes":2,"body":"I assume that's exactly what he meant when he said \"the nuclear option is make them unusable together\". No assassin will want stormrazor by itself over another item in terms of stat value, except maybe in very few abuse cases (rengar possibly? With the 1 shot I.e.? But really even then duskblade should be better for his use scenario).","replies":[]}]}]}]}]}]},{"poster":"usul1202","date":"2018-04-30T18:04:20.658+0000","up_votes":13,"down_votes":3,"body":"Thank you for the comment about nerfing lane sustain. I've been worried about the status of my poke make supports ever since the announced removal of mana from spellthiefs. This makes me feel much more comfortable that I wont be nerfed out of lane.","replies":[{"poster":"Riot Axes","date":"2018-04-30T18:11:33.908+0000","up_votes":35,"down_votes":4,"body":"In case you missed it, we reverted the Spellthief's change based on feedback.","replies":[]}]},{"poster":"Skynix","date":"2018-04-30T18:34:15.842+0000","up_votes":2,"down_votes":0,"body":"What about Yasuo? Will he be nerf because of this?","replies":[{"poster":"Riot Axes","date":"2018-04-30T19:00:05.650+0000","up_votes":29,"down_votes":1,"body":"I've been asked both if he'll be nerfed and if he'll be buffed D:\n\n{{sticker:sg-janna}} \n\n\n...real answer, champions that work differently with critical strike (Yasuo, Tryndamere, Gangplank, Ashe, Jhin, even stuff like Corki) will need to be watched but it's not at all clear which of them are nerfed and buffed yet, so follow-up is more likely than pre-release changes, unless there's a design quality issue to be handled.","replies":[]}]},{"poster":"Tensaii Sakuragi","date":"2018-04-30T18:51:43.534+0000","up_votes":20,"down_votes":0,"body":"yo what about {{champion:104}} and {{champion:203}} kind of marksmen from the jungle are they included into your calculations ??","replies":[]},{"poster":"SoundChaosDebug","date":"2018-04-30T18:37:10.374+0000","up_votes":20,"down_votes":1,"body":"What is the deal with true damage being everywhere? It's gonna be like the old armor penetration meta","replies":[]},{"poster":"Leonerdo","date":"2018-04-30T18:48:09.990+0000","up_votes":20,"down_votes":2,"body":"Aren't ya'll worried that the Last Whisper revert to % Total ArPen will cause the same problems as it did before the rework? Namely, it could end up as a generic, staple, guaranteed 3rd/4th-item multiplier on any AD-centric champion. And in terms of reducing ADC threat to other squishies, won't it cancel out any gains you get from the IE changes? And doesn't that leave Marksmen without a definitive anti-tank purchase (and therefore less build diversity)?\n\nBecause of those concerns, y'all are going to have to work a little harder to sell me on the Last Whisper revert. What exact is your strategy for dealing with those issues? What follow-up tuning are you prepared for? Is there a reason you believe those problems won't manifest significantly? If the problems are unavoidable, what makes the changes worth it anyways? Aren't there are other/better ways to buff non-crit, scaling builds?\n\nClearly I think the change is question(mark)able, but I'm willing to give it a chance. I just don't understand it at the moment.","replies":[{"poster":"Tafne","date":"2018-04-30T20:08:23.474+0000","up_votes":11,"down_votes":1,"body":"IE is the new tank buster, since it makes crits part true damage. LW revert is gonna become problematic like it was before for sure. Welcome back AD assassins, the removal of one stale build path into another stale buildpath. \n{{sticker:zombie-brand-clap}}","replies":[]}]},{"poster":"FirewaterDM","date":"2018-04-30T18:34:19.205+0000","up_votes":19,"down_votes":3,"body":"Quick question, why buff Maw? It seems that in its current state it already sufficiently undermines AP champs' ability to fight AD champs in the mid or top lane significantly in its current form (especially since hexdrinker already undermines plenty of AP champs after buying it/it always means the AD champ wins the trade/all in barring misplays.) I guess outside of that, I feel these changes aren't going to impact ADC's too often but drive out AP champs from mid and top lane since the shifts seem to strengthen bruisers and AD assassins more.","replies":[{"poster":"D E Merry","date":"2018-04-30T21:00:10.453+0000","up_votes":9,"down_votes":1,"body":"First I think there's a few things to actually consider before complaining about a Maw buff\n\n(1) Arguably the real oppressive item is Hexdrinker, not Maw of Malmortius. Hexdrinker is cheap, stat efficient, and provides a barrier that's really annoying to play against too early on. If anything, I'd increase the price of Hexdrinker because the price point is too similar to a Seeker's Armguard but provides a shield on top of the stats. It shuts down enemy mages too early before the AD can realistically finish Maw, much unlike an enemy mage making a play before Banshees is finished. There should be more of a time to be able to punish before Maw is ready, and a 1300 gold investment isn't that big. \n\n(2) Maw of Malmortius (given the buffs to Steraks) isn't really as oppressive as you say, because if I'm investing 3k gold into Maw, I'm putting myself completely vulnerable to any kind of gank from an AD jungler or a lane swap until at least my second item, of which on most AD mids is going to have to be a lethality item, Trinity Force, or some Tiamat upgrade to have damage. Other than the 10% cooldown reduction, it provides absolutely nothing defensively against an enemy AD: no health, no mana, no movement speed, nothing. Given players have to choose not to buy Steraks (which blocks both magic and physical) on top of it, I think it's a fair trade.\n\n(3) Since Maw costs 3k gold, it really means that the enemy is trading the costs of most of a trinity force, or an entire lethality item, just to not die, and I think that's decently healthy similar to how mid lane mages were all rushing Abyssal Mask. The problem is a lot of champions who actually DO buy hexdrinker aren't gated by mana, and the ones that do use mana (i.e. Corki) always want a mana item, so they never actually full rush Hexdrinker--> Maw.  Do keep in mind as well once you manage to get a burst combo that can deal 80% of the enemy's health (it's easier to do it against a Maw mid laner than a Abyssal Mask mid laner) you just need to be able to pull it once, and then you have 90s to make a play, kind of like how a lot of ADs have to play around a Zhonyas.","replies":[]}]},{"poster":"Sheehan","date":"2018-04-30T18:21:00.302+0000","up_votes":5,"down_votes":2,"body":"Anything for Kalista? {{champion:429}}","replies":[{"poster":"Furor Nexis","date":"2018-04-30T18:25:06.869+0000","up_votes":12,"down_votes":0,"body":"> [{quoted}](name=PhoenixOfMercy,realm=NA,application-id=A7LBtoKc,discussion-id=2ykqAkNa,comment-id=0010,timestamp=2018-04-30T18:21:00.302+0000)\n>\n> Anything for Kalista? {{champion:429}}\n\nKalista is a tricky source of balance for Riot considering she has everything a marksman needs, much to the extent that she's almost the perfect carry. To even buff her a little would see her return as the dominant ADC in both pro and ranked scenes.","replies":[]}]},{"poster":"Wild Geese","date":"2018-04-30T18:42:26.527+0000","up_votes":9,"down_votes":2,"body":"As an ADC player I really like what I'm hearing. Yes the class is strong but the \"two crit items\" is extremely boring and your scaling can feel very bad on some adc compared to others; who lacked options. A few questions!!:\n\n1. Stormrazor sounds good on Draven especially, maybe Miss Fortune and Quinn. Is it aimed specifically at these early scaling ADCs to maintain their power?\n2. Speaking of Quinn, is there plans to get Quinn and Corki back into the botlane (and maybe, crossing fingers; a Graves rework/partial revert??)\n3. I hope these goals of like, making \"winning the lane\" more important don't buff Caitlyn indirectly yet more. I'm pretty sick of her dominance. I hope that champion is getting some work because she lacks weaknesses and is strong late while being the ultimate lane bully adc.\n4. Is a large cost reduction of BOTRK in the cards? because it would be a good rush on several characters, if it wasn't for the cost...","replies":[{"poster":"Riot Axes","date":"2018-04-30T18:53:42.098+0000","up_votes":12,"down_votes":1,"body":"> [{quoted}](name=Wild Geese,realm=NA,application-id=A7LBtoKc,discussion-id=2ykqAkNa,comment-id=002a,timestamp=2018-04-30T18:42:26.527+0000)\n>\n> As an ADC player I really like what I&#x27;m hearing. Yes the class is strong but the &quot;two crit items&quot; is extremely boring and your scaling can feel very bad carries compared to others; who lacked options. A few questions!!:\n> \n> 1. Stormrazor sounds good on Draven especially, maybe Miss Fortune and Quinn. Is it aimed specifically at these early scaling ADCs to maintain their power?\n\nI expect it to help these sorts of champions, though I'm doubtful of it on MF. Stormrazor is intended to fit into a variety of builds as an early purchase, though the meaning of the item changes (crit-heavy builds use it for MS + a steroid; Lethality or raw AD builds use it to frontload damage).\n\n> 2. Speaking of Quinn, is there plans to get Quinn and Corki back into the botlane (and maybe, crossing fingers; a Graves rework/partial revert??)\n\nBot lane Quinn's indirectly buffed because she's not getting the base stats treatment of the rest of the class. Corki is more of an edge case, presently he does have the base stat changes applied but I'm not committed to that. \n\n> 3. I hope these goals of like, making &quot;winning the lane&quot; more important don&#x27;t buff Caitlyn indirectly yet more. I&#x27;m pretty sick of her dominance. I hope that champion is getting some work because she lacks weaknesses and is strong late while being the ultimate lane bully adc.\n\nIf Caitlyn's OP, Caitlyn gets nerfs. That said, champions like Caitlyn and Tristana express a more clear weakness with these changes - it takes longer for champions who express mid-late game power through crit strike autoattacks to turn on, which means that they're more exploitable in the mid-game than before. Whether that's enough remains to be seen.\n\n> 4. Is a large cost reduction of BOTRK in the cards? because it would be a good rush on several characters, if it wasn&#x27;t for the cost...\n\nBoRK is 200 cheaper on the build today (3200 total). That is of course subject to change between now and 8.11.","replies":[]}]},{"poster":"Mastęr Yi","date":"2018-04-30T18:26:39.776+0000","up_votes":9,"down_votes":0,"body":"So will Last Whisper be a must buy 3rd item again like before?","replies":[]},{"poster":"Solari Fortune","date":"2018-04-30T18:15:05.543+0000","up_votes":8,"down_votes":0,"body":"Which Marksmen are you thinking will be hit hardest by all these changes?\n\nWill we still get 50% crit chance with an IE Zeal Item?\n\nWill Shiv and RFC synergy be looked at?\n\nWhat would the new ER effect look like since it will want to reward casters?","replies":[{"poster":"Kazekiba","date":"2018-04-30T18:23:23.265+0000","up_votes":3,"down_votes":9,"body":"Vayne and Twitch are going to wet their pants in excitement from the IE change and maybe Stormrazer if it's good. \n\nI dont know why they returned Shiv + RFC Synergy when it was problematic in the first place when RFC first came out, and Riot had to remove it.","replies":[{"poster":"Twitch 1 Trick","date":"2018-04-30T18:33:23.944+0000","up_votes":9,"down_votes":1,"body":"As a twitch player to another twitch player, I'm wondering why you're jumping the gun on the changes being positive for him and/or vayne.\nI assume that we both know how bad either of their early-games are already, and these changes are just opening up harsher stomps in my opinion. They also mentioned they are looking to take power AWAY from the two item power spike which twitch openly relies on. These changes make me fear for the changes honestly.\n\nCould I have you elaborate on your thoughts as to why they would \"wet their pants in excitement\"?","replies":[]}]}]},{"poster":"Notorious Lamar","date":"2018-04-30T20:10:50.322+0000","up_votes":7,"down_votes":0,"body":"I don't really want to imagine Stormrazor and {{champion:11}} .","replies":[]},{"poster":"OOQQ","date":"2018-04-30T20:00:42.294+0000","up_votes":7,"down_votes":0,"body":"is sword of the occult coming back anytime soon?","replies":[]},{"poster":"Monkeytender","date":"2018-04-30T18:12:43.031+0000","up_votes":4,"down_votes":0,"body":"In regards to nerfing lane sustain, are you worried this will make taking a Nami or Soraka to lane too much of a requirement as opposed to a tankier support, or do you consider this a win in regards to making the kind of support you bring to lane matter more and have the contributions between the warden and enchanter classes less homogeneous in lane phase?","replies":[{"poster":"Riot Axes","date":"2018-04-30T18:18:14.166+0000","up_votes":9,"down_votes":2,"body":"It's a meaningful buff to both mage and enchanter supports in lane, as compared to tanks. It hasn't made them a requirement in our tests, but if it does we have plenty of tuning levers available.","replies":[]}]},{"poster":"SonicÐeHedgedawg","date":"2018-04-30T19:08:25.556+0000","up_votes":2,"down_votes":0,"body":"@Riot Axes\nI'm aware that they have different applications and triggers and different ways to counterplay, but they BOTH give conditional attack speed, so what is being done to prevent Hail Of Blades from stepping on lethal tempo's toes?  Or does it work more like Jayce's ability that gives you Max attack speed for 3 attacks and it's intended to be a stand-alone attack speed steroid as opposed to scaling with other AS items?  If that's the case, is the buff short enough to be counterplayed with CC?","replies":[]}]}