{"poster":"Riot Axes","date":"2016-04-20T02:42:07.453+0000","title":"Guinsoo's Rageblade, Devourer, and Bloodrazor","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Hi folks,\n\nAs part of the Midseason patch, we&rsquo;re doing some work on a couple of items that have been problematic through the first half of the season: Guinsoo&rsquo;s Rageblade and Enchantment: Devourer.\n\n\n**Enchantment: Devourer**\nAs of the 6.9 patch, Devourer is being removed from the game. In order to provide support to attack speed-oriented junglers, we&rsquo;re replacing it with a new item:\n\n**Enchantment: Bloodrazor**\n\n* Recipe:  Jungle Item + Recurve Bow + 625 gold (2625 total gold)\n* +40% Attack Speed\n* UNIQUE Passive: Basic attacks deal 3% of the target&rsquo;s maximum Health in bonus physical damage (max 75 vs. monsters and minions) on hit.\n\nAttack speed junglers break down into two different audiences, and this item is supposed to serve both. Tanky on-hit junglers like Shyvana and Warwick who want one or two non-scaling offensive items appreciate the % maximum health damage on Bloodrazor. Meanwhile, on-hit scaling offense champions like Master Yi and Kindred should be able to pair it with other attack speed items like Blade of the Ruined King plus physical damage modifiers like Youmuu&rsquo;s Ghostblade or Lord Dominik&rsquo;s Regards for scaling builds.\n\nWe needed to make this change because, frankly, farm jungle items weren&rsquo;t having good effects on the game. Devourer and Sated Devourer both represent incremental improvements in game health over previous farm jungle items &ndash; Devourer removed the sustain and warding that allowed a farm jungler guaranteed &lsquo;do not disturb&rsquo; farming, while Sated Devourer kicks farm junglers out of the jungle with a clear call to action. This wasn&rsquo;t enough, however. The biggest problem farm jungle items create for the game is the initial 10-15 minutes, not their effects on the mid-game.\n\nThere will still be junglers who prioritize farming more than others, there will still be junglers who you rarely see ganking your lane, and there will still be junglers who defer power to later in the game, but that will be left to the kits now &ndash; the systems won&rsquo;t be forcing it.\n\n\n**Guinsoo&rsquo;s Rageblade**\nGuinsoo&rsquo;s Rageblade has a few problems on Live. We&rsquo;re pretty confident that it&rsquo;s not actually overpowered &ndash; it&rsquo;s sufficiently situational, providing the kind of power that a certain set of champions needs without heavily bleeding over onto other champions. When it does see play on other champions (looking at you, Tristana), it&rsquo;s picked for specific reasons to fill a niche, not because it is generically powerful.\n\nThat said, the item is balanced around a couple of different elements that can feel very bad &ndash; both to play as and play against. It has one of the worst build paths in the game, creating a low point in champion power immediately before you finish. This is counterbalanced by a very high power spike immediately after &ndash; it provides more power than an item usually gives for 2800 gold because it needs to offset that artificial weakness.\n\nThere are a couple other, smaller issues &ndash; because it causes an AOE on hit, it has an inappropriate interaction with Runaan&rsquo;s Hurricane, hard-binding ranged Rageblade users to that item. Additionally, melee users simply don&rsquo;t need to double stack on hit. Hitting 8 stacks is prohibitively too difficult for a champion like Jax to rely on, but that doesn&rsquo;t mean 4 stacks is the right number.\n\nWe&rsquo;re looking to smooth the item out with both a better build path and with a more appropriate gold cost for the power it gives. Without further ado:\n\n**Guinsoo&rsquo;s Rageblade**\n\n* Recipe: Blasting Wand + Recurve Bow + Pickaxe + 875 gold (3600 total gold)\n* +35 Attack Damage\n* +50 Ability Power\n* Passive: Basic attacks deal an additional 15 magic damage on hit.\n* UNIQUE Passive: Basic attacks grant +8% Attack Speed, +3 Attack Damage, and +4 Ability Power for 5 seconds (stacks up to 6 times). While you have 6 stacks, gain Guinsoo&rsquo;s Rage.\n* Guinsoo&rsquo;s Rage: Every other basic attack will trigger on hit effects an additional time.\n\nA quick note on the Phantom Hit passive: we&rsquo;re trying that passive here because it fits the item well and is very cool - it drives different styles of builds while presenting a cool visual and a cool fantasy. We&rsquo;re comfortable putting it here because the additional gating of needing to stack Rageblade removes a lot of the problematic use cases Phantom Hit caused on Devourer. For example, where Devourer makes Xin Zhao&rsquo;s knockup a 2-hit combo for the rest of the game, this Rageblade makes it a 2-hit combo only if Xin has been able to basic attack for a while.","replies":[{"poster":"Mimy","date":"2016-04-20T02:48:11.614+0000","up_votes":8,"down_votes":57,"body":">+35 Attack Damage\n+50 Ability Power\nPassive: Basic attacks deal an additional 15 magic damage on hit.\nUNIQUE Passive: Basic attacks grant +8% Attack Speed, +3 Attack Damage, and +4 Ability Power for 5 seconds (stacks up to 6 times). While you have 6 stacks, gain Guinsoo’s Rage.\n#Guinsoo’s Rage: Every other basic attack will trigger on hit effects an additional time.\n\nTHIS DOESN'T CHANGE ANYTHING! OMG YOU JUST PUT RAGEBLADE AND SATED TOGETEHR!","replies":[{"poster":"KorZod","date":"2016-04-20T02:56:24.008+0000","up_votes":49,"down_votes":2,"body":"except the price is up 1000 or so, the original AOE from guinsoos is gone, and whereas the old guinsoos rage effect gave you 64% attack speed, 24 AD, 32 AP, and the on hit did 20 + 15% bonus ad & 7.5%AP in a little AOE, the new one gives you only 48% attack speed, 18 AD, 24 AP, and a weak 15 magic damage with no AOE. Additionally, melees need 6 hits to get it to full instead of 4. The biggest abusers, arguably Kog and Yi, are going to be way weaker with these changes. Kog won't get the Runaans + Guinsoos AOE slaughter he wants, and Yi needs 2 more autos to get less damage anyway. I think it's fair that the new Bloodrazor + guinsoos will be significantly weaker than sated guinsoos.\n\ndo a little research before all caps raging","replies":[{"poster":"dEAdbUs","date":"2016-04-20T09:52:40.245+0000","up_votes":6,"down_votes":3,"body":"On 6 stacks 15 magic damage becomes 30. All champions that have on-hit effects will be strong with this. I see already Yi on top and unstoppable Irelias.","replies":[{"poster":"Xyltin","date":"2016-04-20T12:02:19.370+0000","up_votes":11,"down_votes":0,"body":"15 becomes 22.5, you get the double effect every second attack so it is overall just 50% more dmg from on hit effects.","replies":[{"poster":"dEAdbUs","date":"2016-04-20T14:03:25.501+0000","up_votes":5,"down_votes":0,"body":"\"Every other attack\" means \"every second attack\"? Ok my bad then!","replies":[]}]}]}]},{"poster":"Virgin Ray","date":"2016-04-20T02:50:26.289+0000","up_votes":42,"down_votes":1,"body":"{{item:3124}} {{item:1403}} \"**FUUUUSSSIIOOON HAAAAAAAAAAAAAAAAAAAAAA**\"","replies":[{"poster":"gingerkid427","date":"2016-04-20T06:10:15.054+0000","up_votes":5,"down_votes":0,"body":"{{item:3124}} {{item:3930}} \nFTFY :P","replies":[]}]}]},{"poster":"B0OM","date":"2016-04-20T04:17:34.363+0000","up_votes":17,"down_votes":0,"body":"Spending 875 gold to sacrifice the 25% flat attack speed from Recurve doesn't feel that great. Granted the potential attack speed with full stacks is higher, along with gaining the other increased stats and the passives, but it still doesn't seem that satisfying to give up flat stats for potential stats. I'm assuming this functionality is intended to help gate the item?","replies":[{"poster":"Riot Axes","date":"2016-04-20T05:03:47.322+0000","up_votes":24,"down_votes":2,"body":"Intended, yes. Negotiable, though. If the item is seriously underperforming on release, we'd consider adding attack speed as a way to buff it.","replies":[{"poster":"B0OM","date":"2016-04-20T05:37:07.633+0000","up_votes":21,"down_votes":0,"body":"Awesome. If ends up underperforming, a potential solution could be giving Guinsoo's the flat 25% attack speed of Recurve, with each stack granting 4% attack speed instead of 8%. That would bring it to 49% at max stacks, basically identical to the proposed 48%.","replies":[{"poster":"IreliaCarrlesU","date":"2016-04-20T18:27:01.252+0000","up_votes":4,"down_votes":0,"body":"irelia no care\n\n\nirelia goes where she pleases","replies":[]}]},{"poster":"Dêcoy","date":"2016-04-20T07:12:34.494+0000","up_votes":1,"down_votes":0,"body":"Just to make it clear - Guinsoo will also proc stuff like Life Steal twice on each hit? If so, if Guinsoo user builds a Vampiric Scepter for 900gold, he basically gains BT passive. And once he get to BT - he gets 40% life steal from one item. If you put it together with something else (Death's Dance wouldn't be a bad idea, since BT will give you enough LS to cover that bleed effect) you will have 40% LS + 15% of all physical damage as a heal. If you decide to go BT + Mercurial, that's 60% LS on hit, 140AD and if someone CC you, you can break free and keep chasing them. That sounds a bit...scary.","replies":[{"poster":"aperson1","date":"2016-04-20T07:44:31.501+0000","up_votes":3,"down_votes":0,"body":"Phantom Hit technically procs lifesteal, but since the attack itself does no damage you are lifestealing nothing.\n\nI think on-hit physical damage (e.g. BotRK passive, new madreds bloodrazor) specifically will proc lifesteal, but it's fairly rare and not often in a quantity that matters much.","replies":[{"poster":"Dêcoy","date":"2016-04-20T10:28:12.047+0000","up_votes":1,"down_votes":0,"body":"Isn't it like, you deal (example) 100dmg from your autoattack and apply twice on-hit effects with it? Or is 100dmg + on hit effect and then on-hit effect on their own? o:","replies":[{"poster":"Twin TaiIs","date":"2016-04-20T11:48:06.347+0000","up_votes":3,"down_votes":0,"body":"The on hit from phantom hit counts as a separate on hit from what i recall. Its like AAing and doing no damage.","replies":[{"poster":"Battlecast Sona","date":"2016-04-21T01:42:43.160+0000","up_votes":3,"down_votes":0,"body":"it functions exactly like phantom hit on live - on-hit effects are applied an additional time every second attack, but not the normal attack damage. So effects like BotRK (which specifically lifesteals off of its own proc) will get additional healing from it, but someone with a BT (lifestealing off of the actual damage from your AA) will not get additional healing from it. I think the only way it counts as a traditional \"attack\" is for stacking guinsoo's, which of course would be irrelevant with this change.","replies":[]}]}]}]},{"poster":"SammyTehJammy","date":"2016-04-20T12:36:25.181+0000","up_votes":1,"down_votes":0,"body":"Phantom his is on hit damage only.\n\nWits end, bork passive, bloodrazor, ekko W passive, teemo toxic shot (i believe) etc.\n\nSo this is only really extra damage. What will be interesting is Hextech Gunblade{{item:3146}} with its omnivamp passive. I dont get why more hybris champs don't buy this as the vamp on damage dealt is amazing.","replies":[{"poster":"Dêcoy","date":"2016-04-20T14:08:33.382+0000","up_votes":2,"down_votes":1,"body":"I love that item on Varus, especially if you get Guinsoo (current one) and Hurrican. You deal tons of damage (HI PHREAK! NOTICE ME SENPAI!!) and heal for just insaaaaaaaaaane amount, since your W puts magic damage on your AAs, your Q and E procs % max HP dmg based on stacks, which with hurricane you put on 3 people at once. Both Gunblade and Guinsoo gives you AD that boosts both parts of your W as well. Its so awesome.","replies":[{"poster":"Rebel Phoenix17","date":"2016-04-21T02:27:11.930+0000","up_votes":2,"down_votes":0,"body":"I assume you meant gunblade and guinsoo give ap, cuz his W doesn't have an AD ratio =(\nI should try that build though, it sounds fun, but would sacrifice some of his insane poke as opposed to building massive AD items.","replies":[]}]}]}]}]}]},{"poster":"3TWarrior","date":"2016-04-20T04:31:18.767+0000","up_votes":3,"down_votes":1,"body":"I have a concern about the wording of the item.  It states \"basic attacks grant\" the stacks.  it does not say that there is a numeric counter (6 times) or \"basic attacks against opposing champions grant\"\n\nthis means that using Runaan's hurricane, a ranged champ theoretically only needs 2 auto attacks to gain the doubling effects\n\nchampions such as kayle, kindred, teemo and kogmaw can all easily abuse this with the inherent effects in their kits and their reliance on attack speed and/or on-hit effects\n\nwill you look into this so there is not a repeat of the kog maw buff/nerf cycle and instakiller kindred?(although odd because she represents death...something else to look into with the censorship thing but I suppose that would have to be answered by a representative from the nations involved)","replies":[{"poster":"B0OM","date":"2016-04-20T04:45:59.261+0000","up_votes":13,"down_votes":0,"body":"The game treats basic attacks and on-hit effects separately. Runaan's bolts apply on-hit effects but are not coded as basic attacks. It will still take six basic attacks to generate enough stacks to activate Guinsoo's Rage, regardless of if the champion has Runaan's or not.","replies":[{"poster":"Riot Axes","date":"2016-04-20T05:09:00.202+0000","up_votes":18,"down_votes":0,"body":"> [{quoted}](name=647BOOM,realm=NA,application-id=A7LBtoKc,discussion-id=ZgBgc5BA,comment-id=00120000,timestamp=2016-04-20T04:45:59.261+0000)\n>\n> The game treats basic attacks and on-hit effects separately. Runaan&#x27;s bolts apply on-hit effects but are not coded as basic attacks. It will still take six basic attacks to generate enough stacks to activate Guinsoo&#x27;s Rage, regardless of if the champion has Runaan&#x27;s or not.\n\nConfirming this ^","replies":[]}]}]},{"poster":"Linna Excel","date":"2016-04-20T05:20:17.696+0000","up_votes":9,"down_votes":0,"body":"No more wolf buddy though...","replies":[]},{"poster":"Carnicore","date":"2016-04-20T05:38:01.499+0000","up_votes":10,"down_votes":1,"body":"Since Shyvana and Master Yi were nerfed multiple times to compensate for their synergy with Sated Devourer, where do they stand now? Are they going to be okay with this Bloodrazor item instead? Or will they need direct buffs?","replies":[{"poster":"Zyvux","date":"2016-04-20T18:00:20.500+0000","up_votes":5,"down_votes":0,"body":"Yi probably not so much as rageblade was already part of his core build so he will get the phantom hit anyways, shyvana on the other hand would probably need a buff after this since she loses the phantom hit, which was a large part of her damage.","replies":[]}]},{"poster":"Dessem","date":"2016-04-20T08:53:52.681+0000","up_votes":7,"down_votes":0,"body":"So completing Guinsoo's Rageblade makes you lose attack speed until you build stacks to get it back? That looks counter-intuitive to lose some stats on completing the item.","replies":[{"poster":"DeathTheHorseman","date":"2016-04-21T11:15:31.999+0000","up_votes":7,"down_votes":0,"body":"^What he said.\n\nGuinsoo is going to be 3600 gold and will give 35 AD and 50 AP?\n\nDuels last less than 6AAs unless between tanks. You get to AA even less if you are melee in a team fight.\n\nThe AAs to stack it will take bloody long unless you have an AS steroid or another AS item.\n\nMeaning that the item will be 100% useless unless you have it stacked before you fight. Furthermore useless unless you have good AP ratio in your kit.\n\nSpeaking in gold efficiency: \n\n35 AD = 1225 GOLD\n50 AP = 1087 GOLD\n15 On hit damage = 375 GOLD\n\nTotal for the item: 2687 GOLD  and it costs 3600 GOLD => 74.6% gold efficient. \nOn champions with no good AP ratios it's even less efficient. (Think ~50%tish)\n \n1 stack gives:\n8 %AS = 200 GOLD\n3 AD = 105 GOLD\n4 AP = 87 GOLD\n\n1 stack in total gives: 392 GOLD of stats.\n\nx6 = 2352 GOLD\n\nFull stacked item gold in stats is:  5039 GOLD or 139.9% GOLD efficient.\n\nWithout the phantom hit passive. (which can only be calculated by halving the gold efficiency of any On Hit effects you have)\n\nOn hit passive of guinso is 375 gold so by stacking it you increase the value with 50% (187 GOLD)\n\n * On hit passive of [BOTRK ](http://leagueoflegends.wikia.com/wiki/Blade_of_the_Ruined_King)is 250GOLD (minimum 10 on hit damage) increased with 150 Gold per 100 Current HP of target above 166HP. \n * On hit passive of [Nashor ](http://leagueoflegends.wikia.com/wiki/Nashor's_Tooth)tooth is 675 GOLD  (+375 per 100AP from other items so roughly 900 if you have the two => 450 gold extra stats)\n * On hit passive of [Wits end](http://leagueoflegends.wikia.com/wiki/Wit's_End) is 1000 GOLD => so + 500Gold stats with Guinso stacked.\n * On hit passive of [Muramana ](http://leagueoflegends.wikia.com/wiki/Muramana) (Stacked and activated. YES activating SHOCK gives you a passive that procs ON HIT or from single target spells)\n 6% of Current mana into damage. (1000 current mana gives 60 Physical on hit damage =>1500 gold in stats so 750 increase with a stacked guinsoo)\n\nSo 2 attacks with Shock activated and Guinso stacked drain 9% Current mana and do 18% Current mana damage. (Imagine that on Kog maw, Twitch or Ezreal)\nThat being said you will run out of mana very quickly.\n\nBut the truly broken on hit passives are in champion kits.\n\n\n\nYes the item is extremely powerful if stacked on a hybrid or anyone with on hit effects but costs far too much and gives far too little without stacks.\n\n##**Basically you either go in a fight after stacking it somewhere and 2-4 hit KO people or you go inside the fight without a chance to stack it and die before doing 6 AAs.**\n\nI don't believe this is healthy for an item:\n\n * If you have it in lane and stack it on the minions before meeting the enemy champ he literally cannot touch you or he dies. He either has to get backup quickly or  leave the lane. You can just face roll his towers and kill him if he tries to defend.\n\n * If you have the item and need to join a fight without stacks you are literally useless if they focus and burst you before doing 6AAs.\n\nIt will favor only ranged champs in team fights and sieges as no melee champion will get to stack it without being poked/focused and outright killed for miss positioning.\n\n\n##Item should be:\n\n35AD 50AP 26% AS\n15 on hit passive => 2687 + 650 = 3337 GOLD  => 92.6% Gold Efficient (no stacks)\n\n1stack gives: 4%AS 3AD 4AP => 292 GOLD \n\n6 stacks  item= 50% AS 53AD 74AP => 1752 GOLD\n\nStacked is = 5089 Gold of stats. 141.3% Gold efficient (max stacks) \n\nWILL STACK ONLY ON CHAMPION HITS!\n\nPhantom hit at 6 stacks. \n\n\n**This is still extremely strong in duels but is not useless in team fights.**\n\n**There will be no scenario where the enemy has to just leave the lane since you got there before him and stacked your item.**","replies":[]}]},{"poster":"Gigablitz","date":"2016-04-20T04:35:58.736+0000","up_votes":2,"down_votes":0,"body":"I love the new rageblade, and the fix to devourer.\n\nHowever, I have one question that I sincerely hope to have addressed - what's keeping you from using zeal in a recipe to enable crit junglers (Yi, Trynd, Perhaps other melees + ADC's)?","replies":[{"poster":"Riot Axes","date":"2016-04-20T05:16:06.112+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=Gigablitz,realm=EUW,application-id=A7LBtoKc,discussion-id=ZgBgc5BA,comment-id=0013,timestamp=2016-04-20T04:35:58.736+0000)\n>\n> I love the new rageblade, and the fix to devourer.\n> \n> However, I have one question that I sincerely hope to have addressed - what&#x27;s keeping you from using zeal in a recipe to enable crit junglers (Yi, Trynd, Perhaps other melees + ADC&#x27;s)?\n\nNothing, actually. It was under serious consideration for this item.\n\nThe reason we went with this item instead is because there are actually two quite distinct groups of attack speed junglers that need to be covered - the more offense-oriented champions like Yi/Tryndamere/Kindred and the tankier champions like Shyvana/Warwick/Udyr (some builds). Offense champions can buy it with armor pen and attack damage, while tankier champions can use it as their only (or one of two) offense item with a bunch of tank items.","replies":[{"poster":"Jesus is Savior","date":"2016-04-20T05:49:45.132+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Riot Axes,realm=NA,application-id=A7LBtoKc,discussion-id=ZgBgc5BA,comment-id=00130000,timestamp=2016-04-20T05:16:06.112+0000)\n>\n> Nothing, actually. It was under serious consideration for this item.\n> \n> The reason we went with this item instead is because there are actually two quite distinct groups of attack speed junglers that need to be covered - the more offense-oriented champions like Yi/Tryndamere/Kindred and the tankier champions like Shyvana/Warwick/Udyr (some builds). Offense champions can buy it with armor pen and attack damage, while tankier champions can use it as their only (or one of two) offense item with a bunch of tank items.\n\nCan you make 2 versions with 2 damage types? (One magic enchant and one physical enchant?)\n\nSome champions do mostly magic damage (Phoenix Udyr, Warwick) and some do mostly physical damage. The magic damage tanky champions are kind of going to be gimped by this item, since it won't scale with magic pen masteries, magic pen boots, or wit's end.","replies":[]},{"poster":"Fear No Biatch","date":"2016-04-20T16:47:40.597+0000","up_votes":3,"down_votes":0,"body":"Seriously this item are too weak for the cost of it. The difference between this item and botrk is only 800 gold. With 800 more gold, I can buy {{item:3153}} which give you 25 more ad, 10% more lifesteal, 3% more bonus damage base on health, and the active of bork. This item is not cost efficiently. Riot just make this item a smaller version of {{item:3153}} like {{item:1414}}  is smaller version of {{item:3285}}  and {{item:1413}} smaller version of{{item:3068}} . Give this item 10% more lifesteak and maybe 2 more % bonus damage base on health.","replies":[{"poster":"Lulzor5","date":"2016-04-20T17:09:44.261+0000","up_votes":4,"down_votes":0,"body":"The thing to remember here is that {{item:3153}} deals % current hp that becomes near worthless when they are near death where bloodrazor deals consistent %hp damage on every auto. the two items can also be bought side by side as options to shred tanks as an as jg champion. guinsoos also scales super strong with both of these options {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]},{"poster":"xxxDogmanxxx","date":"2016-04-22T02:27:39.960+0000","up_votes":6,"down_votes":0,"body":"So... Riot: Nerfs Xin Zhao, Jax, and Yi because of Devourer-Rageblade synergy. Replaces Devourer with inferior, more expensive item. Nerfs Rageblade very heavily cost-wise, and stat-wise. Doesn't buff any of those champions to compensate. Hmm...\n\nMore on the Guinsoo's Rageblade: You say it currently has a horrible build path, so you fix it... by giving it an even WORSE build path? It now builds out of an attack speed item, but you LOSE the attack speed from that component when you complete the item, and overall LOSE EVEN MORE attack speed from the original item?! What. The. Fuck.","replies":[]},{"poster":"Häxel","date":"2016-04-20T17:58:14.138+0000","up_votes":7,"down_votes":1,"body":"So the Devourerwolf gets removed cause you cant stack devourer more? But he looked so nice and cute :( MAybe you could place the wolf on rageblade and he follows you everytime you have less than 6 stacks and disappear if you have the 6 stacks for guinos rage, that would be nice :D","replies":[{"poster":"Gyuutarou","date":"2016-04-20T21:09:02.757+0000","up_votes":4,"down_votes":0,"body":"Maybe they will move that particle to the wolf smite bonus, imagine a cute little spirit wolf running around and showing you your enemies.","replies":[]}]},{"poster":"MunchCrunchLunch","date":"2016-04-20T02:51:13.077+0000","up_votes":7,"down_votes":6,"body":"{{item:3124}} {{item:3124}} {{item:3124}} {{champion:67}} {{item:3124}} {{item:3124}} {{item:3124}} \n{{item:3124}} {{item:3124}} {{item:3124}} {{champion:96}} {{item:3124}} {{item:3124}} {{item:3124}} \n\nNO SERIOUSLY\n\nSILVERBOLTS EVERY 2 HITS.\n\n\nalso devourer is barebones now. I'd rather go almost anything on any champion that used to build devourer","replies":[{"poster":"Elewd","date":"2016-04-20T02:53:54.938+0000","up_votes":7,"down_votes":1,"body":"it won't be optimal for vayne, even with the double proc you would probably get something else since PD - Statik/RFC - IE is just all around better at the moment.","replies":[]},{"poster":"Keevalroy","date":"2016-04-20T03:46:08.391+0000","up_votes":1,"down_votes":0,"body":"You're giving up a lot for that though...that just looks cringe when I imagine it on Vayne.","replies":[{"poster":"MunchCrunchLunch","date":"2016-04-20T03:57:08.384+0000","up_votes":4,"down_votes":2,"body":"1 item for 33% more silver bolts. \n\nhere is a vayne build.\n\n{{item:3031}} {{item:3124}} {{item:3046}} {{item:3139}} {{item:3006}} {{item:3094}} \n\nidk if you need armor pen when you have that much true damage. you will do more true damage vs tanks anyway.\n\nbut i guess if u need armor pen swap out the last crit item for a last whisper . anway. on vayne. i'd take the rageblade.\n\nthink of it as. botrk. a lot of people build botrk on vayne. because of the dueling power. vayne doesnt really build on hit and she doesnt build runnans to make a great use of it. swap the dueling botrk for rageblade as a starting item. success.\n\n\nvayne doesnt need the botrk tank shredding passive because of her silverbolts. its damage is minimal to how much her w does\n\n70% crit is what most adcs build nowdays anyway. at max stacks you have.\n\n65 ad from merc (after nerf). 53 ad from fully stacked rageblade. 65 ad from ie. all adds up to a total of  267 AD. i'd if am sacrificing much of anything. maybe a tiny bit of lifesteal. but with the merc nerf i might go bloodthirster and skip it.\n\n\njust throw the botrk away and add rageblade. since the only adc that builds crit and goes botrk is vayne. and its not very great on her anymore honestly. she isnt kog maw or kalista with runnans\n\nand idk rageblade will make vayne less shitty of a champion in the laning phase. well actually maybe not really due to the build path but hey after its done its better than an old 1 item vayne. botrk isn't the greatest first item.","replies":[{"poster":"Keevalroy","date":"2016-04-20T04:14:02.511+0000","up_votes":4,"down_votes":0,"body":"It almost looks like a raw damage build that I like going, but that Rageblade is so...odd.\n\n{{item:3072}} {{item:3046}} {{item:3006}} {{item:3031}} {{item:3139}} {{item:3087}}  / {{item:3036}} \n\nYou're giving up more survivability and upfront damage for inefficient stats. I want to 3 shot the other carry and mid laner lategame if they want to fight, and I'd be losing the raw power. It's too expensive for what you're getting out of it, but if you really wanted to use it, you're better off putting it in a build that looks kinda like this since the extra AS from BotRK will help proc the passive faster.\n\n{{item:3153}} {{item:3087}} {{item:3006}} {{item:3139}} {{item:3124}} {{item:3046}} \n\nI'd still take IE over Rageblade if I want more damage though.","replies":[{"poster":"DeathBurst","date":"2016-04-20T16:00:25.079+0000","up_votes":5,"down_votes":0,"body":"Disclaimer: I don't really play ADC, but I like theorycrafting.\n\n* If you want to make a Guinsoo build on Vayne, it's because of Silver Bolts, so I'm not sure you want Crit, but you still wants lots of AS, and the two are often tied together. But certainly IE is the first item to remove from the standard build.\n* If you go for Guinsoo, it's obvious you should use BotRK too, not replace BotRK with Guinsoo, because the two items synergize well. Agree with you on that.\n* You need to ramp-up, so you need to withstand the initial burst. For that I think Bloodthirster would be cool, especially since BotRK passive is applied two times by Phantom Hit and this passive also applies Lifesteal. But instead of what item? I'd say Statik, the proc is good for burst, but that's not the goal of this build anyway. You are giving up a lot of AS, though, so do you still have enough after that? Not sure...","replies":[]}]}]}]}]},{"poster":"duck stuff","date":"2016-04-20T05:08:52.481+0000","up_votes":4,"down_votes":2,"body":"Remember sated {{champion:67}} ? How about sated {{champion:67}} , but without smite? Want that?\n\nNo? \n\nWHAT'S WRONG WITH YOU?","replies":[{"poster":"MrBoxy","date":"2016-04-20T06:32:04.720+0000","up_votes":5,"down_votes":0,"body":"Yes, because spending 3600G on an item with a stat that she can't use, to then have to stack it 6 times before being able to actually make any meaningful use of it is a great idea /s","replies":[]}]},{"poster":"TheLastBaron88","date":"2016-04-20T03:57:27.224+0000","up_votes":6,"down_votes":1,"body":"So the big question this raises for me, having been around for a few seasons, is.... Why are we bringing back Bloodrazor, of all things? I thought that item was removed in Season 3 because the only balanced state for an on-hit percent max hp attack speed item was for it to be a total noobtrap? Worse, it deals physical damage instead of magic damage now, which means it is subpar for dealing with the current tank meta because of the ease with which they stack both health and armor in the same build (which I discussed at length in a post in the Gameplay forum). It seems to me that at the very least, magic damage would be more effective for the intended purpose of such an item.\n\nIs there any way that we could get Xypherous or Statikk to weigh in on this decision? Why the seeming change of heart? Or is it just a weak cop-out, a stand in to allow attack speed junglers to have SOMETHING while a better something is worked out for the future?","replies":[{"poster":"Nightshade X13","date":"2016-04-20T05:02:48.748+0000","up_votes":2,"down_votes":1,"body":"Actually, a large part I recall them mentioning specifically about why they removed Madred's Bloodrazor was BECAUSE it was magic damage beforehand.\n\nMost champions that grabbed Madred's Bloodrazor were AD-AS carries, and they didn't have magic pen because they weren't primarily dealing magic damage. This kinda made the original item useless on all but a few outliers that may build magic pen on an AS build, like WW for example, or Kog'Maw, who could shred MR enough to make it useful. They removed it for Blade of the Ruined King (which when released was actually a %max health shred physical damage item), but upon seeing how effective the item was (because you could lifesteal for half the %health damage dealt, it gave roughly 5% on-hit, and it also had about 15% lifesteal) it became nerfed into the ground and then steadily raised to its current point by reversing some of the changes made to it (such as reverting it to allow lifesteal for half the %health damage, which was one of the first things to be removed).\n\nGranted, this doesn't make it any better in the current \"stack armor and health\" tank meta, but with it being changed to physical damage again it now can scale with the primary damage most champions that will claim it would need. Kinda goes back to having the champions taking it having the right kind of penetration: the original reason it was removed. Armor penetration is also a little easier to snag, and there are quite a few synergy items for it, such as Cleaver, Ghostblade, and Dominik's, as mentioned.","replies":[{"poster":"TheLastBaron88","date":"2016-04-20T08:42:03.011+0000","up_votes":2,"down_votes":0,"body":"I think you might be right about that, it does sound like a familiar bullet point. Of course, the main reason I feel like these items fail to deliver on their tank shredding fantasy right now, as detailed in my other post, is that Last Whisper no longer penetrates total armor, and only penetrates a portion of bonus armor. I think tanks are going to continue being the dominant force in the game right now until that changes. I guess it just bugs me that they are releasing an item that seems like it should be better against tanks, but most likely isn't. It kinda gives me the impression that I will end up selling it for something else in the late game, and that feels kinda bad on any jungle item that doesn't give you a big early spike in damage.\n\nAnd you know, it's not like I even dislike tanks being strong through the mid to early-late game, it's just that when everyone has completely finished their builds, and there's nothing left to buy, I feel like the guy who put all of his gold into the most expensive build in the game and sacrificed any notion of defensive stats to do so, should be able to finally melt them away and close out the game.","replies":[{"poster":"Atanchan","date":"2016-04-20T17:20:22.222+0000","up_votes":2,"down_votes":0,"body":"I think they've said before that \"seems like it should be better against tanks\" is really % max health in a nutshell. Why, yes, make it true damage and you'll definitely kill tanks in a certain amount of attacks, but you'll kill squishies just as fast - actually, faster, because there's the factor of the non-on-hit damage. Non-true damage makes this even more the case - despite what you might think, this type of damage really is far better the less amount of health the target has, because it still has the same effect of killing them in a certain amount of hits but they're far more affected by the rest of the damage coming their way.","replies":[{"poster":"TheLastBaron88","date":"2016-04-20T17:57:18.949+0000","up_votes":1,"down_votes":0,"body":"Absolutely. So the question I still have is, why did they pull a 180 on this item, since those are both valid reasons for it to have been removed in the first place? Is it different because being a jungle item provides it a reason to be purchased that isn't the mistaken intent of \"because I wanna kill tanks?\" Is it Riot throwing their hands up in the air over attack speed junglers, or is there another reason they chose to bring back this specific item?","replies":[{"poster":"Atanchan","date":"2016-04-21T08:17:28.365+0000","up_votes":2,"down_votes":0,"body":"Keep in mind, both Riot and League are very different entities from way back then. It's an entirely different environment for the item, really - and you don't have to look any further than the statline to see this.\n\nThe new version has 40% attack speed on it. Well, that makes perfect since for an on-hit item. The old Madred's ... gave the same amount of attack speed, but also armor and attack damage. It gave these stats because those were the stats on the item it built out of, which was literally a less bloody version of it. It had those stats because it was a jungle item.\n\nRather, it was THE jungle item, and it made sense since if your kit didn't allow you to jungle naturally, then the only thing that would really help would be having high attack speed - which this item amplified, because the AD and proc damage themselves were amplified by the attack speed, and the armor allowed you to get more attacks of with that attack speed.\n\nBut the thing is, adding more AD and AS to the item isn't really a way to upgrade it in a way the appeals to those types of champions - specifically, the ones with high attack speed that went into the jungle - not if the item already has armor. Why? Well, to make the item have worthwhile stats for the cost, that means _three_ stats had to be worthwhile ... which meant high cost for those three stats. And the armor and AD weren't even that good for the cost, but they couldn't be made higher without making it even more expensive. Plus, it has an on-hit effect, so it would be kind of dumb to not include the attack speed, but the attack speed is _so damn expensive_.\n\nAnd let's remember, the jungle was absolutely shit for gold back then.\n\nSo you have this 3800 cost item that only naturally builds out of the jungle item. That's an inherently dumb statement for back then. However, it also has a very strange spread of stats, and the ADCs back then wouldn't want to have to sacrifice their crit nor items with actually meaningful amounts of AD for the passive, especially not at that cost since they could get either something with massive AD or something with slightly less AD but also super crits for the same, if not less, gold! And it doesn't even have a useful build path for them. So you have a late game item for a place with basically no gold income that's extremely inefficient.\n\nThe item was basically only for junglers that could farm stupidly well, wanted armor, wanted attack speed, and wanted damage on their autoattacks.\n\nSo it was literally Warwick's item. No one else's.\n\nOf course, it could be reworked. But it was still **Madred's** Blood**razor**, and Madred's Razor was still in the game. Not to mention, it was already associated pretty firmly with the name, and it was likely that Riot at the time wasn't really sure if they wanted to keep it anyway. So it went to the scrap bin.\n\n... Amusingly enough, though? Madred's Razor on the same patch was turned into a pure armor item with the same jungling capabilities, and later on, even the armor was replaced with attack speed. I would imagine another reason they scrapped it is because they weren't certain if they wanted a strong item that was just for junglers - but of course, nowadays, they're quite happy to have that.","replies":[]},{"poster":"Battlecast Sona","date":"2016-04-21T02:00:13.651+0000","up_votes":2,"down_votes":0,"body":"I think the logic is that these ASPD junglers need an item that will both A) feed into their need for ASPD and B) not force them to either farm for the rest of the game or make Warrior, a singularly unimpressive enchant on a lot of junglers who would rather have Devo/Bloodrazor. I think this is intended as a stopgap, and I won't be surprised if by the time 3-4 patches go by the item is significantly different than it is now. I for one think it's a step in the correct direction, because there are certain junglers that I think Devo was a bit of a trap on, and I definitely think it felt really bad to commit to devo and then have 2-3 ganks fail in another lane or what have you. While it may not seem to directly, it affects the ability of a game to snowball because there's no longer this \"oh no, Yi got a first blood double kill and got devo 5 minutes early, ggggggg\" or \"I bought my devo and then each lane died and the enemy started invading my jungle regularly, ggggggggg\"","replies":[]}]}]}]}]}]}]}