{"poster":"Riot Lutzburg","date":"2015-06-23T05:37:21.264+0000","title":"Melicent, Conduit of the Swarm","subforum":"Concepts & Creations","up_votes":15,"down_votes":12,"body":"**Role**: AP Tank, AP Fighter, Jungler\n\n**Inspiration**: I wanted to create a Champion from a non-carry role (either a Support or Tank) and give them an Ultimate ability that allowed them to transform into a carry for a brief period of time.\n\n**General Design Philosophy**: Melicent is a frontline tank with a good mix of engagement, damage over time and innate tankiness.  Her core play pattern involves slowing enemies from range, speeding herself up to close the gap, then snaring them while emitting passive AoE damage and waiting for her allies to catch up to her.  This relatively simple kit is offset by a massively game-changing Ultimate that requires the use of a unique resource system, preparation, foresight and an understanding of the mechanical skill needed to perform in a melee carry role.\n\nOnce Melicent has generated enough of her unique resource, she can opt to transform into an AP melee carry, which requires a short channel time.  In this new form, she sheds her tankiness and team-wide disruption and instead opts for a suite of personal gap closers, AoE magic damage and a heavy dose of disruptive chaos.  This juxtaposition between both physical forms and game roles creates a massive shift in gameplay for Melicent players.  Most predominantly, it allows adept tank players to put their backpacks on and carry the team in short bursts, rather than relegating themselves to soaking damage and being the first one to die in team fights.\n\n**Risk Analysis**: Very High.  Melicent is a complex Champion who uses an all-new resource system.  Her base kit is mostly intuitive and both easy to learn and execute on (a la Nautilus), but knowing when to transform and the associated game knowledge required to excel in two roles will undoubtedly be daunting to new players.  Overall this kit will either live or die by its Ultimate, which is always a risky, albeit exciting proposition.\n\n**Appearance**:\n\n_While the image below doesn't reflect much about Melicent's actual appearance, I wanted to highlight the \"open air\" cockpit of Melicent being strapped to her Mechapede, and her ability to control its front arms._\n\n http://i1298.photobucket.com/albums/ag47/Lutzburg/muppet_man_02_zpsk6eglefj.jpg\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/027090854A9030F5F9E5357A4522CFAA857BFB51E20001B247pimgpsh_fullsize_distr_zpselbwb1xe.jpg\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/tAG_98052_zpsmv1isxqr.jpg\n\n\n**Lore**: \n\n>  _Since she was a child, Melicent has always been fascinated by insects.  She didn’t quite care about them, so much as she desired to unlock their microscopic secrets in order to obtain a higher plane of personal power and enlightenment.  They were simply the means to an end; an end she never could have imagined as a child.  Melicent grew up in a backwater village of Zuan, picking the wings off of dragonflies just to learn how they managed to fly.  This obsessive fascination quickly began to invade her every pore and sculpt the young girl into something ...odd.  She was ruthless, but driven.  Her passion for research was boundless and she stopped at nothing to discover the answers she sought, regardless of the moral ambiguities her studies sometimes carried._\n> \n> _ It wasn’t long before Melicent was preparing to graduate from a leading Piltover institution with degrees in both biomechanics and entomology; the study of insects.  As part of her final thesis, she constructed a massive machination she called the Mechapede.  She announced that she would use her creation to explore the most dangerous environments in Runeterra, discovering insects, collecting samples and ultimately learning whatever hidden secrets they could offer her._\n> \n>http://i1298.photobucket.com/albums/ag47/Lutzburg/tumblr_ng9o1lWOUk1remlbjo1_1280_zps29yyxsq5.png\n>\n> _Several years into her travels and studies, Melicent was struggling to make any meaningful breakthroughs.  She knew the insects had secrets, but she found their silence maddening.  It was then that she met [Dahlia](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/usBlkFIf-dahlia-the-withering-maiden), a brilliant but somewhat naive botanist from Noxus.  Dahlia hypothesized that Melicent could advance her studies through the use of a pollen-based attractant that Dahlia had been perfecting.  She invited Melicent to her lab to show off her various spore and pollen samples, and it didn’t take long for the young entomologist to realize the kinds of revolutionary advances she could make with Dahlia’s help._\n> \n> _However, Mellicent soon betrayed her own desires by revealing to Dahlia that she intended to use her plants to intoxicate and ultimately perform horrific experiments on the insects she captured as a result.  When the brilliant botanist refused to help Melicent with her dubious research, desperation struck and Melicent took drastic action.  Without warning, she lunged at Dahlia, smashing her against a small table as diagrams and charts flew about the room._\n> \n>  _Despite her best efforts, Dahlia was ultimately overpowered and sent flying into one of her experimental workstations.  The corrosive and acidic toxins stored within the surrounding beakers doused the young botanist’s body, causing her to scream in terrible pain.  Melicent grimaced in disdain over her actions, but her guilt was quickly overcome by an immense drive  to begin her research.  Melicent silently gathered up Dahlia’s work and left the lab, having no interest in watching the girl begin to mutate and wither away._\n> \n> _Within a few short days, Melicent’s prized Mechapede had received numerous upgrades, including a massive grenade launcher which she outfitted with a modified version of Dahlia’s pollen compound.  With a grizzled brow of determination about her face, Melicent climbed aboard her Mechapede.  It let out a piercing, mechanical shriek before beginning to slither and scuttle its way out of Piltover and into the dense, unknown jungles of the Howling Marsh.  It was there, Melicent thought, where she would finally discover the secrets she was so desperate to find..._\n\n**Trivia**: Melicent’s name is Greek for “honey bee.”  The root of her name, “Mel”,  is an alliteration with her mechapede, and “ent” is a reference to her occupation as an ‘entomologist’.\n\n**Strengths**: AoE slow, consistent damage threat, self-heal, innately tanky, ability to transform into a hyper carry briefly\n\n**Weaknesses**: Unreliable initiations, use of Ultimate requires interactivity and set-up time, limited crowd control, ability to disrupt enemy team is largely tied to Ultimate\n\n**Plays Most Like...**: {{champion:150}} {{champion:111}} {{champion:102}} {{champion:6}} \n\n**Resource**: None, in the case of her basic abilities.  However, Melicent uses a secondary resource called “Swarm” which occupies her resource bar and is required to activate her Ultimate.\n\n**Auto Attack**: Melicent's mechapede slashes in melee range with its scythe-like arm\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_6551_btn_zps5hhr9ojg.jpg\n**Passive- Prized Specimens**: Melicent's mechapede carries a canister on its back, which contains a swarm of killer insects. Melicent gains stacks of a buff called “Swarm” passively over time at a rate of 1 stack every 4 seconds.  At 100 stacks, Melicent can cast her Ultimate ability.  After casting her Ultimate or upon respawning, Millicent’s stacks are reset to 0. \n\nInsects will occasionally fly around Summoner's Rift at a slow pace in patrolled fashions (similar to the Scuttle Crab), which Melicent can pick up to gain 5 stacks of Swarm. Casting Pollen Grenade on an insect draws it to Melicent automatically. Collecting insects also generates a flat amount of healing for Melicent over a period of 2 seconds, which scales with her level.  Insects are more commonly found in the jungle; especially in the river.\n**Design Philosophy**: Melicent’s core inspiration and reason for existence revolves around her Ultimate, which I wanted to depend on active and interactive gameplay for Melicent, her team and her opponents.  The minor healing component for collecting insects helps Melicent players sustain in the jungle when traveling between camps.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_10563_pas_zps54scmb36.jpg\n**Q- Pollen Grenade (9 sec)**: Melicent fires a concussive grenade from her mechapede at a target location up to 1,200 units away with an impact diameter of 350 units, slowing affected enemies by 30/34/38/42/46% for 3 seconds and dealing minor magic damage to them over the duration.  Affected enemies also receive a debuff called ‘Pollinated’, which lasts for 6 seconds.\nRank-ups increase damage, slow value and lower cooldown.\nDesign Philosophy: This ability functions similarly to Urgot’s Corrosive Charge but provides a slightly larger cast radius.  This ability acts as a long range form of soft initiation and is moderately reliable in nature, assuming Melicent players can land their skillshots.  Much like how Urgot players fish for their combo by initiating with Corrosive Charge, this ability is essential for enabling the rest of Melicent’s kit.  Its cooldown is moderately long to provide windows of opportunity for the enemy team to react once they know Melicent has whiffed her only source of engagement.\n\n**W- Travel Mode/Battle Mode (5 sec)**: This is a toggleable ability with a short cooldown between each of the two toggle modes.  In addition to their passive effects, each ability also features a secondary effect upon initial activation:\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_11564_pas_zpsnghdxbdp.jpg\n**Travel Mode**- Melicent's mechapede hunches over, placing more of its legs on the ground and gaining 24/28/32/36/40% bonus movement speed for 2 seconds.  Following this, Melicent enjoys a flat 10/20/30/40/50 bonus movement speed while in Travel Mode.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_7788_pas_zpsqmtpeo6m.jpg\n**Battle Mode**- Melicent’s Mechapede stands mostly upright, gaining a damage-absorbing shield that scales with max health and a conversion of her current Swarm stacks (Swarm Stacks x.5/1/1.5/2/2.5).  The shield lasts for 2.5 seconds.  Simultaneously, the mechapede’s canister opens its vents, releasing a swarm of insects around Melicent at a diameter of 300 units.  This deals minor AoE magic damage while Battle Mode is active, but causes her to lose one stack of Swarm every second.  The AoE effect is disabled if/when Melicent runs out of Swarm stacks.\nRank-ups increase bonus movement speed, damage dealt and shield value.\n**Design Philosophy**: Travel Mode’s active component is designed to allow her to catch up to enemies who she has managed to slow from range with her Pollen Grenade.  The passive component simply allows her to stick to targets or move more quickly between jungle camps.\n\nBattle Mode’s active component helps soften the retaliatory blows Melicent will surely suffer once  she decides to set up shop and begin whittling down her prey, while simultaneously cementing her role as a frontline tank.  The shield only lasts a moment to limit its power during extended fights or kiting scenarios, while the Swarm scaling gives Melicent players a reason to hold onto their stacks instead of blindly activating their Ultimate as soon as it’s available to cast.\n\nAs a Champion without mana costs, shutting down Melicent’s Swarm generation was vital in preventing players from keeping Battle Mode active indefinitely.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_14315_pas_zpsjfreqxx2.jpg\n**E- Infestation (7 sec)**: Melicent releases a cone-shaped funnel of insects from her mechapede with a maximum range of 450, dealing magic damage to all targets in its path.  Targets affected by Pollinate suffer 20% bonus damage and are snared in a web-like secretion for 1.25/1.5/1.75/2/2.25 seconds.  In addition, Melicent receives a stack of Swarm for each pollinated target struck (tripled against enemy Champions).  Rank-ups increase damage done and snare duration.\n**Design Philosophy**: This is the final note in Melicent’s intuitive Q/W/E combo (similar to Nautilus’ play patterns), and is designed to lock down fleeing enemies so that Melicent’s team can catch up and capitalize on her initiation.  I intentionally chose a Snare effect to allow captured opponents the opportunity to retaliate against Melicent as she patiently waits for her team to follow up.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_11727_atc_zpscbjme0xl.jpg\n**R- Release the Swarm (No cooldown, requires 100 stacks of Swarm)**: Melicent's mechapede becomes immobile and begins to channel.  Over the next 2 seconds, Melicent remorselessly vents a mutagen into the canister of insects strapped to her mechapede's back, causing the insects to mutate into a brutish insectoid.  The canister doors then open, freeing the creature.  This channel cannot be interrupted, but Melicent takes full damage during her transition.  As the creature emerges, Melicent slyly utters, “Release The Swarm!”\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/Brute_comcept_zps0wkcasny.jpg\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/norrislin_alien_final_copy_copy_by_funkydomo-d71esuj_zps7fekcxfa.jpg\n\nFor the next 20/25/30 seconds, Melicent gains direct control of the creature.  The player in turn gains access to a new set of abilities and statistics, which act independently of any items Melicent possesses.  These statistics scale with Ultimate rank. Practically speaking, this effect transforms Melicent into a completely different Champion.\n\n> Health: 1100/1500/1900\n> Health Regeneration: 0/0/0\n> Armor: 50/75/100\n> Magic Resistance: 40/70/100\n> Attack Damage: 100/125/150\n> Attack Speed: 1/1.25/1.5\n> Ability Power: 200/400/600\n> Movement Speed: 380/415/450\n> Cooldown Reduction: 0%\n\nThe mechapede remains at the location where Release the Swarm was activated, and retains Melicent's current health, armor and magic resistance.  If the mechapede is destroyed while Release the Swarm is active, Melicent's connection to the creature becomes severed and it dies instantly.\n\nRank-ups increase base stats, base ability damage and duration of the Ultimate.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_1642_btn_zpsslugidqf.jpg\n**RP- Mutagenic Claws**: The creature's auto attacks deal 25/50/75 bonus magic damage and place a stacking debuff on its target, which increases the bonus damage dealt from subsequent auto attacks by 25%.  This debuff lasts 3 seconds, stacks up to four times and refreshes its duration with each auto attack.\n**Design Philosophy**: Without the need for Swarm stacks, Melicent is now free to deal consistent magic damage to any target she can close the gap against, making her a legitimate and consistent damage threat while in her insectoid form.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_11410_pas_zps1wwjcl9r.jpg\n**RQ- Insidious Rush (8 sec)**: The creature charges forward up to 650 units away, knocking aside enemy units in its path and creating a 70% AoE slow effect at the end of its travel path, which lasts for 2 seconds. Enemies knocked aside suffer minor magic damage while enemies affected by the slowing component suffer considerably more.\n**Design Philosophy**: This ability is specifically designed to closely mirror both the mechanics and the input of Melicent’s baseline Q ability.  While the range is shortened, the speed and width of the skillshot are increased to provide more consistent engagement; with or without Melicent’s teammates.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_14794_pas_zpsqqh6evh3.jpg\n**RW- Conduit of the Swarm (Passive, always active)**: The Swarm constantly swirls around the creature at 300 range, dealing magic damage over time to all enemies in range.\n**Design Philosophy**: Again, this ability was designed to mirror and merely enhance Melicent’s baseline ability.  The damage this ability deals is roughly 50% more than its counterpart, Battle Mode.  It also helps solidify Melicent’s new role as a volatile, albeit short-lived damage threat.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_17769_pas_zpsub9rc20b.jpg\n**RE- Corrosive Screech (5 sec)**: The creature utters a terrible screech, spewing a corrosive acid in a cone up to 500 units away. This deals heavy magic damage and lowers the magic resistance of affected targets by 10/20/30% for 2.5 seconds.\n**Design Philosophy**: As Melicent’s Ultimate trades her innate tankiness and crowd control for increased speed and individual gap-closing prowess, she no longer needs to snare enemies in the hopes that her team can follow up with her; she’s strong enough to take care of things herself.  This ability is similar to Cho’Gath’s Feral Scream and acts as Melicent’s primary AP nuke while in her Swarm form.  The baked in MR shred helps compensate for her inability to use items like Void Staff while in this form.\n\nhttp://i1298.photobucket.com/albums/ag47/Lutzburg/icons_11279_btn_zps2wzkvtmz.jpg\n**RR- Volatile Experiment (no cooldown, can only be used once)**: The creature violently self destructs, causing a shockwave of insects and corrosive acid to disperse around it in a 500 range radius.  This deals magic damage based on the missing health percentage of affected enemies.  This ability can only be used once and is unavailable for the first 4 seconds after activating the Release the Swarm.  Volatile Experiment triggers automatically after 20/25/30 seconds but will not trigger if the creature is killed prematurely by enemies.\n\nOnce the creature perishes, Melicent resumes piloting her mechapede after a short \"revive\" animation, during which she is still vulnerable to attack.\n\n**Design Philosophy**: As its name implies, this is a volatile and chaotic ability that rewards Melicent players for embracing their newfound carry potential and truly diving the backlines to destroy a priority target.  While in this form, Melicent is incredibly susceptible to crowd control, but even in a worst-case scenario, her initial volley of damage combined with the execute nature of her Ultimate should allow her to take at least one victim with her.  This ability is unusable for the first few seconds after activation to prevent players from immediately executing their opponent at opportune times (See Quinn Ultimate, Sion Shield, Zyra Passive).  A “self destruct” button also allows Melicent to return to her mechapede prematurely, should the need to tank stuff arise sooner than expected.  Furthermore it allows her to move her primary form away from enemies who may be attempting to focus fire it down before her insect form can cause too much chaos.\n\nSpecial thanks to EntropicScholar for the great suggestion to tweak Melicent's Ultimate!\n\nIf you liked this Champion, you can find over 70 more of my original concepts [HERE!](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/uuQxluoH-lutzburgs-champion-concepts-mega-thread?show=flat)","replies":[{"poster":"j3staG","date":"2015-06-23T06:04:31.622+0000","up_votes":4,"down_votes":0,"body":"\"parasite\" and \"bed bug\" will be the alternate released skins. you heard it here first","replies":[]},{"poster":"30562438_DEL","date":"2015-06-23T07:13:23.553+0000","up_votes":3,"down_votes":0,"body":"I like this champion, but I have a few serious concerns.\n**1. She seems a bit thematically confused.** I can get the \"mech fighter\" part, and the \"insect lord\" part, and I love the detail you put into the lore tying it all together, it just seems that she would be more likely to be permanently mutated, or become a crazed Poison-Ivy type, rather than using a mech.\n\n**2. collecting bugs:** why does she collect bugs, AND passively generate them, AND get extras by using her abilities? it just seems like too much. I'd either get rid of the passive generation, or both of the other two.\nIf you really want the bug-collector idea to stick, I'd drop the per-second generation of bugs.\n\n**3. Battle Mode.** wouldn't it make more sense for battle mode to passively drain stacks of her Prized Specimens?\n\n**4. IF...** If you did go with the 'crazed Poison-Ivy' variant, couldn't the ult just be her channeling, while all the bugs coalesce at a target point, creating a monster that behaves as you describe?\nHaving her transition from a human scientist / mech pilot, to a horrifying mutant, then explodes and re-forms as a normal human again? in her mech? Now that just doesn't make sense.\n\n\n\notherwise, I think it's really good. You spent a lot of effort here, and the last time I invested so much into a design, it didn't turn out nearly as well as this.","replies":[]},{"poster":"Found4u","date":"2015-07-14T05:03:38.196+0000","up_votes":2,"down_votes":0,"body":"Another home run :D","replies":[{"poster":"Riot Lutzburg","date":"2015-07-14T05:53:51.136+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bouncingbannanab,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=001d,timestamp=2015-07-14T05:03:38.196+0000)\n>\n> Another home run :D\n\nIf Melicent was a home run, she wouldn't be sitting at -1 upvotes.  D:\n\nThen again, she did get sandbagged by one guy with at least five downvotes, so I guess I can't be too miserable.","replies":[{"poster":"Found4u","date":"2015-07-14T16:16:26.578+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=001d0000,timestamp=2015-07-14T05:53:51.136+0000)\n>\n> If Melicent was a home run, she wouldn't be sitting at -1 upvotes.  D:\n> \n> Then again, she did get sandbagged by one guy with at least five downvotes, so I guess I can't be too miserable.\n\nYeah, I think its an interesting concept. Somepeople dont have the sameout look though. :/","replies":[{"poster":"Riot Lutzburg","date":"2015-07-14T17:30:11.809+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bouncingbannanab,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=001d00000000,timestamp=2015-07-14T16:16:26.578+0000)\n>\n> Yeah, I think its an interesting concept. Somepeople dont have the sameout look though. :/\n\nThen those people need to be dealt with!  *breathes intensely*","replies":[{"poster":"Found4u","date":"2015-07-16T22:30:04.331+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=001d000000000000,timestamp=2015-07-14T17:30:11.809+0000)\n>\n> Then those people need to be dealt with!  *breathes intensely*\n\nSo you could say they need to be terminated","replies":[{"poster":"Riot Lutzburg","date":"2015-07-17T17:34:56.712+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bouncingbannanab,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=001d0000000000000000,timestamp=2015-07-16T22:30:04.331+0000)\n>\n> So you could say they need to be terminated\n\nPrecisely.\n\n***puts on sunglasses***","replies":[{"poster":"Found4u","date":"2015-07-18T02:49:10.261+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=001d00000000000000000000,timestamp=2015-07-17T17:34:56.712+0000)\n>\n> Precisely.\n> \n> ***puts on sunglasses***\n\n***Grabs shotgun***","replies":[]}]}]}]}]}]}]},{"poster":"FlameHalbrdOkido","date":"2015-07-11T21:30:02.377+0000","up_votes":2,"down_votes":0,"body":"But wait... There's more!\nQuestion for the AoE effect of Attack Mode: so the only way to deactivate it, is if she runs out of passive stacks right, or if she is in Travel mode? I legit found it quite funny that you stated if/when she runs out of stacks. Is there a way to stop players from running this ability for 100+ seconds? I know that most players would want the ult, but this is still a possibility some peeps may just do the long lasting AoE. Especially since her resource would be always be adding to what Attack mode subtracts: her passive adds 25+ more seconds of damage past when the 100 swarm would run out. And you didn't make a mention of if the Swarm has a cap, did you? So this could end up being an extremely long lasting AoE. (I know most players would not have attack mode on all the time, believe me, I'm not trying to bs you, this is just a balance thing in my mind) How minor is the AoE, since she losses 1 Swarm/ sec while using it, wouldn't I follow that the DoT would be 1 dps? My solution to the problem that I perceive (no matter how much damage you wanna put in the ability) is that for every 4 sec that Attack mode is toggled on, the amount of swarm that is used up per sec should be increased by X%. I think that this will create a bigger reason for players to not leave Attack mode on for extended periods of time: it uses more, the more it's on. Plus it's thematically designed too: at first only a few bugs will trickle out of the vents, but as time passes, more and more will fly to freedom in droves.\n\nFinally could you pls explain how the conversion of current Swarm stacks works, I don't think I understood it completely.","replies":[{"poster":"Riot Lutzburg","date":"2015-07-13T18:14:17.681+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlameHalbrdOkido,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=0018,timestamp=2015-07-11T21:30:02.377+0000)\n>\n> But wait... There's more!\n> Question for the AoE effect of Attack Mode: so the only way to deactivate it, is if she runs out of passive stacks right, or if she is in Travel mode? I legit found it quite funny that you stated if/when she runs out of stacks. Is there a way to stop players from running this ability for 100+ seconds? I know that most players would want the ult, but this is still a possibility some peeps may just do the long lasting AoE. Especially since her resource would be always be adding to what Attack mode subtracts: her passive adds 25+ more seconds of damage past when the 100 swarm would run out. And you didn't make a mention of if the Swarm has a cap, did you? So this could end up being an extremely long lasting AoE. (I know most players would not have attack mode on all the time, believe me, I'm not trying to bs you, this is just a balance thing in my mind) How minor is the AoE, since she losses 1 Swarm/ sec while using it, wouldn't I follow that the DoT would be 1 dps? My solution to the problem that I perceive (no matter how much damage you wanna put in the ability) is that for every 4 sec that Attack mode is toggled on, the amount of swarm that is used up per sec should be increased by X%. I think that this will create a bigger reason for players to not leave Attack mode on for extended periods of time: it uses more, the more it's on. Plus it's thematically designed too: at first only a few bugs will trickle out of the vents, but as time passes, more and more will fly to freedom in droves.\n> \n> Finally could you pls explain how the conversion of current Swarm stacks works, I don't think I understood it completely.\n\nHer Swarm resource is capped at 100, which is definitely something I should have mentioned and failed to.  Because of that, there really isn't a way for her to keep her swarm active indefinitely.  That said, the decision point I really want players to make is how LONG they want to delay their Ultimate in exchange for disruptive AoE damage up front.  If she's only skirmishing one or two enemies, she might only activate Battle Mode for the shield, then disable it as soon as possible.  Since W's cooldown is so low, the player will always be able to preserve their Swarm stacks if that's what they want to do.\n\nFor the shield scaling, I imagine it's something like:\n\n40/70/100/130/160 (+15% bonus health) (+.5/1/1.5/2/2.5 x current Swarm stacks)\n\nThe last part basically means that whatever Melicent's resource is (0-100) gets multiplied by those values, which scale based on rank.  So for rank 3 of her shield, it would be:\n\n100 (+15% bonus health) (+1.5 x current Swarm stacks).  Let's assume she has 70 stacks when she activates her shield.  That value would then be 70 x 1.5, or 105.\n\nThis has a very conscious and desired side effect of granting her decreasingly strong shields during extended engages, since she is designed to initiate strongly and then let her team follow up.  I didn't want her to have Sion or Nautilus-level shielding so consistently.","replies":[]}]},{"poster":"FlameHalbrdOkido","date":"2015-07-11T14:49:35.791+0000","up_votes":2,"down_votes":0,"body":"I haven't been on the boards in the longest time. I'm glad I came back and would appreciate any updates on cool concepts that I missed. While I'm always happy to see a concept by Lutzburg, I'm glad that I haven't missed too much. This is your first 1 in a while right? If so I'm very glad that you are still doing it, your concept are never lacking in originality, dedication or awesomeness. \nThat being said I was dismayed when I saw the champion's title XD. I too am working on a swarm champion with a unique resource(2yrs in progress) Even our ults share similarities. Now I gotta wait a bit so your concept doesn't steal the wind out of my sail :) all gud fun tho, I only say that cuz your stuffs so gud.\n\nOn to the champ. 1st we are gonna ignore the fact that some people have said its complicated; because it's not, it makes use of a lot of effects, but it's not complicated. I prefer the term intricate.\n\nI like the basis of this champion, she can achieve a complete change in roles. Tanky fighter to a hyper carry: that's hella cool. Other champions can change what they do, kind of thier roles, but the problem before Gnar was that they would likely just sit in the form they liked best. In addition the form or role change was not as drastic as this is, it's like a complete 180 role change. I like that.\n\nSo question on the ult: you changed it so that she pours mutagen in the tank of bugs on her mechs back, and releases the resultant bug monster on her enemies right? So now she controls the monster like a pet instead of being the monster it's self? Does she have like a set of controls in her mech that allows her to control the monster. This could explain why she and the mech must be still in one location, and is unable to do anything for her self: it's because she is intent on seeing what her experiment can do. She just ignores everything else, pulls out her monster remote control pad, and focuses on giving it commands: she and the mech become immobile and unable to take action and vision is transferred to the bug. What's the roam range on this thing? Does this seem like something she'd do? Forgo her own protection to see how far she can push her experiment?\n\nI really like how her Resource generation works, it's very fitting for her and Thematic. Was her purpose to join the League so she could study the bugs the survive in the volatile, arcane, harsh, and violent conditions that make up Summoner Rift? Because I sure would be interested in any bug that can survive a game with Singed or Twitch in it.\n\nQ and E are great and make a lot of sense. At first I questioned the need for snare if E was used on a target with Pollen on the, wasn't the damage increase enough? But I guess you should get some kind of reward for using the abilities in the right order.\n\nW's travel mode would be great for getting around the JG. Question for Travel mode: Does she still have access to her other abilities while in travel mode? Or can she only use her other abilities while in Attack mode? She'd have to switch to attack?","replies":[{"poster":"Riot Lutzburg","date":"2015-07-13T17:56:23.525+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlameHalbrdOkido,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=0017,timestamp=2015-07-11T14:49:35.791+0000)\n>\n> I haven't been on the boards in the longest time. I'm glad I came back and would appreciate any updates on cool concepts that I missed. While I'm always happy to see a concept by Lutzburg, I'm glad that I haven't missed too much. This is your first 1 in a while right? If so I'm very glad that you are still doing it, your concept are never lacking in originality, dedication or awesomeness. \n> That being said I was dismayed when I saw the champion's title XD. I too am working on a swarm champion with a unique resource(2yrs in progress) Even our ults share similarities. Now I gotta wait a bit so your concept doesn't steal the wind out of my sail :) all gud fun tho, I only say that cuz your stuffs so gud.\n> \n> On to the champ. 1st we are gonna ignore the fact that some people have said its complicated; because it's not, it makes use of a lot of effects, but it's not complicated. I prefer the term intricate.\n> \n> I like the basis of this champion, she can achieve a complete change in roles. Tanky fighter to a hyper carry: that's hella cool. Other champions can change what they do, kind of thier roles, but the problem before Gnar was that they would likely just sit in the form they liked best. In addition the form or role change was not as drastic as this is, it's like a complete 180 role change. I like that.\n> \n> So question on the ult: you changed it so that she pours mutagen in the tank of bugs on her mechs back, and releases the resultant bug monster on her enemies right? So now she controls the monster like a pet instead of being the monster it's self? Does she have like a set of controls in her mech that allows her to control the monster. This could explain why she and the mech must be still in one location, and is unable to do anything for her self: it's because she is intent on seeing what her experiment can do. She just ignores everything else, pulls out her monster remote control pad, and focuses on giving it commands: she and the mech become immobile and unable to take action and vision is transferred to the bug. What's the roam range on this thing? Does this seem like something she'd do? Forgo her own protection to see how far she can push her experiment?\n> \n> I really like how her Resource generation works, it's very fitting for her and Thematic. Was her purpose to join the League so she could study the bugs the survive in the volatile, arcane, harsh, and violent conditions that make up Summoner Rift? Because I sure would be interested in any bug that can survive a game with Singed or Twitch in it.\n> \n> Q and E are great and make a lot of sense. At first I questioned the need for snare if E was used on a target with Pollen on the, wasn't the damage increase enough? But I guess you should get some kind of reward for using the abilities in the right order.\n> \n> W's travel mode would be great for getting around the JG. Question for Travel mode: Does she still have access to her other abilities while in travel mode? Or can she only use her other abilities while in Attack mode? She'd have to switch to attack?\n\nHey Okido!  It's really nice to hear from you after so long.  I, too, haven't been on the boards much.  The generally negative reception Melicent got also didn't do much to inspire me to stay active.  She's my most recent since Rabadon, which surprisingly got way more positive attention.  It's totally okay that you're working on a \"swarm\" concept, too.  Insects and swarm/infestations are a pretty common trope; it's all about how you choose to utilize it!  As for your specific feedback...\n\nFor her ult, yes I imagine she controls them via some sort of control scheme (whether it's telepathy, neurological inhibitors, whatever the case may be).  I had considered putting a leash range on the monster form, but I felt like there were enough constraints in place already.  I absolutely think that, thematically, she would be so interested in watching her experiment unfold that she wouldn't pay much attention to what was going on around her.\n\nI haven't considered a reason for her joining the League, since Riot has stated that they're working on a lore ret-con that no longer includes \"reasons\" or motivations for these characters to join the roster.  Which is lame in my opinion.\n\nThe reason her E snares is because Melicent is designed to reach her opponent first.  She needs time for her allies to catch up and capitalize, so if she didn't have the snare (or some secondary form of AoE slow), her opponents would just kite her allies.\n\nMelicent has access to all her other abilities regardless of which mode she's in.  She simply loses the bonus movement speed or the AoE damage when in the opposite form.","replies":[]}]},{"poster":"ZT Xperimentor","date":"2015-07-02T18:36:00.178+0000","up_votes":2,"down_votes":1,"body":"Still more thought out than azir XD\nJokes aside, cool idea; definitely an upvote.","replies":[{"poster":"Riot Lutzburg","date":"2015-07-02T18:44:11.865+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZT Xperimentor,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=0014,timestamp=2015-07-02T18:36:00.178+0000)\n>\n> Still more thought out than azir XD\n> Jokes aside, cool idea; definitely an upvote.\n\nThank you very much.  And yes, Azir is... interesting.  >_>","replies":[{"poster":"ZT Xperimentor","date":"2015-07-02T18:56:04.164+0000","up_votes":1,"down_votes":0,"body":"Yeah . . . I just find 'forgotten ancient powers' a boring theme, which is why I don't care about gnar or azir.\nI find nocturne & zac much more interesting, in terms of lore anyway (shrug). Kench the bayou catfish seems to be a significant improvement in storytelling in comparison to their more recent attempts. But I also enjoy stories of Sherlock and lovecraft; so take it with salt XD","replies":[{"poster":"Rito Jericho","date":"2015-07-02T19:02:34.821+0000","up_votes":1,"down_votes":0,"body":"For some reason, I'm pretty glad that it doesn't seem like I'm the only one who likes looking at champions' lore.  If I remember correctly, one person sort of tried to bash on my champion concept, Xeno, because he said that Riot doesn't really use lore anymore so my lore was pointless.  Or something like that.","replies":[{"poster":"ZT Xperimentor","date":"2015-07-02T19:45:10.432+0000","up_votes":1,"down_votes":0,"body":"I used to read a lot of the lore, but when they started rewriting a bunch of champions just to add in azir; I lost interest because it made them less unique. I like intertwined story-lines, but changing pre-established universe context is almost always a terrible idea.","replies":[{"poster":"Riot Lutzburg","date":"2015-07-02T19:58:08.465+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZT Xperimentor,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=00140000000000000000,timestamp=2015-07-02T19:45:10.432+0000)\n>\n> I used to read a lot of the lore, but when they started rewriting a bunch of champions just to add in azir; I lost interest because it made them less unique. I like intertwined story-lines, but changing pre-established universe context is almost always a terrible idea.\n\nCompletely agreed.  Trundle and Skarner are two of my favorite champions (largely for their original lore) and they were used as rectonned pawns to advance a completely different storyline.  Really awful.","replies":[{"poster":"ZT Xperimentor","date":"2015-07-02T21:14:24.442+0000","up_votes":1,"down_votes":0,"body":"I don't recall skarner's original lore in great detail, but yeah I'm getting tired of their blatant disregard by redoing things that were completely fine to begin with.","replies":[{"poster":"Riot Lutzburg","date":"2015-07-02T21:28:24.150+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ZT Xperimentor,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=0014000000000000000000000000,timestamp=2015-07-02T21:14:24.442+0000)\n>\n> I don't recall skarner's original lore in great detail, but yeah I'm getting tired of their blatant disregard by redoing things that were completely fine to begin with.\n\nSkarner is part of a race of crystal elementals who grew sick and started dying out as a direct result of the misuse of magic in Runeterra during the old wars.  Their only chance for survival was to bury themselves under the Crystal Scar (AKA the Dominion map) until the wars were over.  When people began teraforming the Crystal Scar to transform it into Dominion, Skarner was unearthed and eventually joins the League.  He is the only one of his kind no longer hibernating and it's up to him to decide when the world is safe enough to wake them all up again.  This comes through in his dialogue in-game, as he frequently references the fact that he \"misses his kind\" and how lonely he is, as well as how strange the current world of Runeterra has become during his hibernation.\n\nAnd now?  He's a scary scorpion monster guarding the Shurima temple housing Xerath.  OooOooh!  A monster!  How the mighty have fallen.","replies":[]}]}]}]}]}]}]}]},{"poster":"Riot Lutzburg","date":"2015-06-23T21:40:27.957+0000","up_votes":1,"down_votes":0,"body":"I'll agree that there is a lot of reading involved here, and the kit requires some deep explanation in some parts, but the practical use and play pattern of Melicent's kit isn't complicated at all.  Her base kit is about as simple as Nautilus' or Urgot's, with a simple resource system that doesn't need to be managed (like Shyvana's).\n\nLots of champions have secondary forms that require entirely new sets of kits (Jayce, Elise, Gnar, even Sion to some extent) but I put a great deal of effort into mirroring the usability and input mechanics of her abilities across both forms.","replies":[{"poster":"Rockman","date":"2015-06-23T22:28:43.768+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=0004,timestamp=2015-06-23T21:40:27.957+0000)\n>\n> I'll agree that there is a lot of reading involved here, and the kit requires some deep explanation in some parts, but the practical use and play pattern of Melicent's kit isn't complicated at all.  Her base kit is about as simple as Nautilus' or Urgot's, with a simple resource system that doesn't need to be managed (like Shyvana's).\n> \n> Lots of champions have secondary forms that require entirely new sets of kits (Jayce, Elise, Gnar, even Sion to some extent) but I put a great deal of effort into mirroring the usability and input mechanics of her abilities across both forms.\n\nThe time it would take to explain this champion is 10x what it would take to explain any of those guys.\n\nThe passive alone is confusing as hell, forget the ult.","replies":[{"poster":"Riot Lutzburg","date":"2015-06-24T01:16:36.606+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ostarion,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=00040000,timestamp=2015-06-23T22:28:43.768+0000)\n>\n> The time it would take to explain this champion is 10x what it would take to explain any of those guys.\n> \n> The passive alone is confusing as hell, forget the ult.\n\nPassive- generates a resource over time which powers her ult.  Collect bugs around the map to gain bonus resources (similar to Bard).\n\nQ- Fire a long range grenade that damages, marks and slows targets struck.\n\nW- A toggle ability with two forms; one gives her bonus movement speed and the other grants her a shield while dealing AoE magic damage.  Her passive is disabled while in this form.\n\nE- Fires a short ranged cone attack that deals magic damage.  Deals bonus magic damage and snares marked enemies.  Marked targets also generate bonus resources.\n\nR- Requires full resource bar to cast.  After a short channel, transforms into an insect with a new set of skills.  Leaves her other form in place, which is vulnerable to attack.\n\nRP- Deals stacking bonus magic damage with each auto attack.\n\nRQ- A mid-range charge attack that deals magic damage and creates an AoE slow on impact.\n\nRW- Passively deals AoE magic damage.\n\nRE- Deals magic damage in a cone while reducing magic resistance.\n\nRR- Self destructs, dealing magic damage based on enemies' missing health, before returning to her other form.\n\n------\n\nIf you cut away all the design philosophies, values and minor details that were added for thoroughness, the kit can be easily explained and interpreted.","replies":[{"poster":"Rockman","date":"2015-06-24T15:59:00.523+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=000400000000,timestamp=2015-06-24T01:16:36.606+0000)\n>\n> Passive- generates a resource over time which powers her ult.  Collect bugs around the map to gain bonus resources (similar to Bard).\n> \n> Q- Fire a long range grenade that damages, marks and slows targets struck.\n> \n> W- A toggle ability with two forms; one gives her bonus movement speed and the other grants her a shield while dealing AoE magic damage.  Her passive is disabled while in this form.\n> \n> E- Fires a short ranged cone attack that deals magic damage.  Deals bonus magic damage and snares marked enemies.  Marked targets also generate bonus resources.\n> \n> R- Requires full resource bar to cast.  After a short channel, transforms into an insect with a new set of skills.  Leaves her other form in place, which is vulnerable to attack.\n> \n> RP- Deals stacking bonus magic damage with each auto attack.\n> \n> RQ- A mid-range charge attack that deals magic damage and creates an AoE slow on impact.\n> \n> RW- Passively deals AoE magic damage.\n> \n> RE- Deals magic damage in a cone while reducing magic resistance.\n> \n> RR- Self destructs, dealing magic damage based on enemies' missing health, before returning to her other form.\n> \n> ------\n> \n> If you cut away all the design philosophies, values and minor details that were added for thoroughness, the kit can be easily explained and interpreted.\n\nThis is the definition of overloaded.\n\nNot even Brewmaster has this much shit","replies":[{"poster":"Riot Lutzburg","date":"2015-06-24T17:48:27.890+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ostarion,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=0004000000000000,timestamp=2015-06-24T15:59:00.523+0000)\n>\n> This is the definition of overloaded.\n> \n> Not even Brewmaster has this much shit\n\nI feel like you're just trolling at this point.  All characters with dual forms are this \"overloaded.\"  Look at Jayce, Gnar, Nidalee... Hell even Heimer, Karma, etc.  Champs who have adaptive and dynamic spell casts.  All of that needs to be written down and explained somewhere.","replies":[{"poster":"Rockman","date":"2015-06-24T18:49:28.409+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=00040000000000000000,timestamp=2015-06-24T17:48:27.890+0000)\n>\n> I feel like you're just trolling at this point.  All characters with dual forms are this \"overloaded.\"  Look at Jayce, Gnar, Nidalee... Hell even Heimer, Karma, etc.  Champs who have adaptive and dynamic spell casts.  All of that needs to be written down and explained somewhere.\n\nThen lets look at Jayce\n\nPassive: Movespeed and ignores unit collision\n\nH Q : Gapcloser, aoe slow, damage.\nG Q: Damage\n\nH W: Mana restore, self centered aoe damage\nG W: Max attack speed with varying damage\n\nH E: Knockback, % HP damage.\nG E: Speed up, increases Q damage and speed.\n\nH R: Damage and defense\nG R: Shred\n\nNow lets count the number of effects.\n\nHe has 11 different effects. 17 if you count his damage.\n\nYours has...\n\n13 effects. 21 if I count all the damage she has.\n\n\nThough, and lets be honest, I'd say the fact she has two health bars is the worst part of this entire kit.","replies":[{"poster":"Riot Lutzburg","date":"2015-06-25T18:00:55.641+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ostarion,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=000400000000000000000001,timestamp=2015-06-24T18:49:28.409+0000)\n>\n> Then lets look at Jayce\n> \n> Passive: Movespeed and ignores unit collision\n> \n> H Q : Gapcloser, aoe slow, damage.\n> G Q: Damage\n> \n> H W: Mana restore, self centered aoe damage\n> G W: Max attack speed with varying damage\n> \n> H E: Knockback, % HP damage.\n> G E: Speed up, increases Q damage and speed.\n> \n> H R: Damage and defense\n> G R: Shred\n> \n> Now lets count the number of effects.\n> \n> He has 11 different effects. 17 if you count his damage.\n> \n> Yours has...\n> \n> 13 effects. 21 if I count all the damage she has.\n> \n> \n> Though, and lets be honest, I'd say the fact she has two health bars is the worst part of this entire kit.\n\nSo a difference of 2-4 total effects on a kit is not enough grounds to pronounce that one is fine and the other is overloaded.  I think it's much more nuanced than that and if anything I think this hurts your argument.\n\nThe two health bars is core to Melicent's kit and I put great care into reserving enough overall power in her concept specifically for it.  You also have to keep in mind the practicality (or lack of practicality) in this Ultimate.  It includes a charge time, leaves her actual \"self\" completely vulnerable and immobile, and her baseline stats in her other form aren't that great.","replies":[{"poster":"Rockman","date":"2015-06-25T18:03:23.451+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=0004000000000000000000010000,timestamp=2015-06-25T18:00:55.641+0000)\n>\n> So a difference of 2-4 total effects on a kit is not enough grounds to pronounce that one is fine and the other is overloaded.  I think it's much more nuanced than that and if anything I think this hurts your argument.\n> \n> The two health bars is core to Melicent's kit and I put great care into reserving enough overall power in her concept specifically for it.  You also have to keep in mind the practicality (or lack of practicality) in this Ultimate.  It includes a charge time, leaves her actual \"self\" completely vulnerable and immobile, and her baseline stats in her other form aren't that great.\n\nYou're missing the point.\n\nDoes she actually take any lasting damage if you hurt her in the alternate form? Because it seems like if I want to actually kill her I HAVE to attack the chassis.","replies":[{"poster":"Riot Lutzburg","date":"2015-06-25T18:11:31.084+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Ostarion,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=00040000000000000000000100000000,timestamp=2015-06-25T18:03:23.451+0000)\n>\n> You're missing the point.\n> \n> Does she actually take any lasting damage if you hurt her in the alternate form? Because it seems like if I want to actually kill her I HAVE to attack the chassis.\n\nNo, she doesn't take lasting damage.  It works similarly to Sion in his passive form.  I toyed with the idea of the insect form taking true damage instead, but I thought that would be too harsh of a penalty.","replies":[{"poster":"Rockman","date":"2015-06-25T18:34:35.241+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=000400000000000000000001000000000000,timestamp=2015-06-25T18:11:31.084+0000)\n>\n> No, she doesn't take lasting damage.  It works similarly to Sion in his passive form.  I toyed with the idea of the insect form taking true damage instead, but I thought that would be too harsh of a penalty.\n\nSo basically you've made a form that nobody has a reason to hit.\n\nCongrats.","replies":[{"poster":"Riot Lutzburg","date":"2015-06-25T18:40:17.092+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ostarion,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=0004000000000000000000010000000000000000,timestamp=2015-06-25T18:34:35.241+0000)\n>\n> So basically you've made a form that nobody has a reason to hit.\n> \n> Congrats.\n\nUh, it's actually quite the opposite.  The whole point is that the enemy team wants to zerg the insect form down before it can cause too much havoc.  The form is fragile but has gap closers and no need to escape after dishing out damage, thus making the clear counterplay choice to kite, lock down or otherwise insta-burst it down.  This then gives the enemy team a 3+ minute window to retaliate.","replies":[{"poster":"Rockman","date":"2015-06-25T18:42:38.480+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=00040000000000000000000100000000000000000000,timestamp=2015-06-25T18:40:17.092+0000)\n>\n> Uh, it's actually quite the opposite.  The whole point is that the enemy team wants to zerg the insect form down before it can cause too much havoc.  The form is fragile but has gap closers and no need to escape after dishing out damage, thus making the clear counterplay choice to kite, lock down or otherwise insta-burst it down.  This then gives the enemy team a 3+ minute window to retaliate.\n\n**Health: 1200/1700/2200**\n**Armor: 60/90/120**\n**Magic Resistance: 40/70/100**\n\nhttp://cdn.meme.am/instances2/500x/451299.jpg","replies":[{"poster":"Riot Lutzburg","date":"2015-06-25T19:32:40.900+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Ostarion,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=000400000000000000000001000000000000000000000000,timestamp=2015-06-25T18:42:38.480+0000)\n>\n> **Health: 1200/1700/2200**\n> **Armor: 60/90/120**\n> **Magic Resistance: 40/70/100**\n> \n> http://cdn.meme.am/instances2/500x/451299.jpg\n\nYour descent into increasingly nonconstructive feedback has been entertaining to watch, at the very least.  Every point you attempt to make is drenched in cynicism and sarcasm, and it's not appreciated.  You have some valid concerns and productive points to make, but your approach to making them leaves a bad taste in my mouth.","replies":[{"poster":"Rockman","date":"2015-06-25T19:36:58.350+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=0004000000000000000000010000000000000000000000000000,timestamp=2015-06-25T19:32:40.900+0000)\n>\n> **Your descent into increasingly nonconstructive feedback has been entertaining to watch, at the very least**.  \n\nSo this is the high point?\n\n> [{quoted}](name=Ostarion,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=0003,timestamp=2015-06-23T18:11:11.546+0000)\n>\n> Way too over complicated.\n\nWow. Just wow.\n\n> Every point you attempt to make is drenched in cynicism and sarcasm, and it's not appreciated.  You have some valid concerns and productive points to make, but your approach to making them leaves a bad taste in my mouth.\n\nI ain't your personal trainer. Get over it.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Rito Jericho","date":"2015-07-02T18:33:00.086+0000","up_votes":2,"down_votes":1,"body":"I don't see why Melicent was down-voted so much.  I still think she's an interesting champion idea.  Naturally I like MY concepts better, but who honestly WOULDN'T be biased in favor of their own work?","replies":[{"poster":"Riot Lutzburg","date":"2015-07-02T18:43:44.451+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=animeboy2428,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=0013,timestamp=2015-07-02T18:33:00.086+0000)\n>\n> I don't see why Melicent was down-voted so much.  I still think she's an interesting champion idea.  Naturally I like MY concepts better, but who honestly WOULDN'T be biased in favor of their own work?\n\nI'm almost positive that Melicent was mass-downvoted by a single person.  She was sitting between 5-6 upvotes for two days straight, and then within a single hour she hit -2, and hasn't been able to recover since.  The same person presumably also mass-downvoted my Mega Thread.","replies":[{"poster":"Rito Jericho","date":"2015-07-02T18:59:17.164+0000","up_votes":1,"down_votes":0,"body":"Ouch.  Well, I wish I could up-vote Melicent to help her out, but I kinda can't.  I already up-voted her around when you first asked me to check her out. lol","replies":[]}]}]},{"poster":"Pointy Rock","date":"2015-06-24T03:18:53.547+0000","up_votes":2,"down_votes":1,"body":"A champion that can tank a ton of damage, or delete people quickly when they desire. Sounds very fair and balanced there, fox news.","replies":[]},{"poster":"Rockman","date":"2015-06-23T18:11:11.546+0000","up_votes":2,"down_votes":1,"body":"Way too over complicated.","replies":[]},{"poster":"j3staG","date":"2019-02-28T19:00:31.435+0000","up_votes":1,"down_votes":0,"body":"how did this pan out?","replies":[]},{"poster":"FlameHalbrdOkido","date":"2015-07-14T08:37:42.636+0000","up_votes":1,"down_votes":0,"body":"Ok I'll wait to post them on the boards then. If you never check out anyone else on the list, I strong urge that you review some of The Neverworld's and FlintFall's stuff, it's really great. I'm pretty sure that FlintFall especially, includes everything possible for a champion concept, all the way down to exact numbers for skill shot missile width and speed","replies":[{"poster":"Riot Lutzburg","date":"2015-07-14T17:30:52.006+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlameHalbrdOkido,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=001e,timestamp=2015-07-14T08:37:42.636+0000)\n>\n> Ok I'll wait to post them on the boards then. If you never check out anyone else on the list, I strong urge that you review some of The Neverworld's and FlintFall's stuff, it's really great. I'm pretty sure that FlintFall especially, includes everything possible for a champion concept, all the way down to exact numbers for skill shot missile width and speed\n\nThere's definitely something respectable about people who go into that much detail and thoroughness for their concepts... I'll keep an eye out for them!","replies":[]}]},{"poster":"FlameHalbrdOkido","date":"2015-07-13T19:30:57.742+0000","up_votes":1,"down_votes":0,"body":"Ok thanks it makes sense now thanks for explaining and answering my questions. I totally get how the shield works now. I hope that you can move past this champion concept and make more some time. Maybe try to make a \"simpler\" concept. I meant that as I know this one is not really complicated, but you know. Still whether it's \"complicated\" or \"simple\" (both are _really_ subjective) I know that if you make it it will be of quality and that's really all that matters.\n\nSigh I wonder how all the other people I used to watch on the boards are doing, I wonder if they are still making concepts. We used to look at some of the same peeps, so I was gonna ask you if you'd seen anything cool that I could go an support. But I definitely don't spend the kind of time I used to on the boards, so if you have any suggestions I'm up for it.","replies":[{"poster":"Riot Lutzburg","date":"2015-07-13T20:30:39.881+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlameHalbrdOkido,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=001a,timestamp=2015-07-13T19:30:57.742+0000)\n>\n> Ok thanks it makes sense now thanks for explaining and answering my questions. I totally get how the shield works now. I hope that you can move past this champion concept and make more some time. Maybe try to make a \"simpler\" concept. I meant that as I know this one is not really complicated, but you know. Still whether it's \"complicated\" or \"simple\" (both are _really_ subjective) I know that if you make it it will be of quality and that's really all that matters.\n> \n> Sigh I wonder how all the other people I used to watch on the boards are doing, I wonder if they are still making concepts. We used to look at some of the same peeps, so I was gonna ask you if you'd seen anything cool that I could go an support. But I definitely don't spend the kind of time I used to on the boards, so if you have any suggestions I'm up for it.\n\nTruthfully I haven't seen almost anything of real interest lately... certainly nothing that warrants a detailed review or insightful discussion.  It's a real shame.  The only champion kits that are getting upvotes these days are incredibly generic and simple ones, that are really more about the theme/trope than the kit or mechanics.  \"Here's my dinosaur in armor champ!\" (gets 20+ upvotes overnight).\n\nI completely agree with you that simpler and easier to digest concepts would do better on these forums.  People don't like to read, even on a place that is designed for people to read.  It's kind of crazy.  That said, Rabadon was far more complicated than Melicent and it did very well.  Same with many of my other \"multiple form\" champions.  Still, I guess it couldn't hurt to get back to basics for a while.","replies":[{"poster":"FlameHalbrdOkido","date":"2015-07-14T02:24:22.624+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lutzburg,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=001a0000,timestamp=2015-07-13T20:30:39.881+0000)\n>\n> Truthfully I haven't seen almost anything of real interest lately... certainly nothing that warrants a detailed review or insightful discussion.  It's a real shame.  The only champion kits that are getting upvotes these days are incredibly generic and simple ones, that are really more about the theme/trope than the kit or mechanics.  \"Here's my dinosaur in armor champ!\" (gets 20+ upvotes overnight).\n> \n> I completely agree with you that simpler and easier to digest concepts would do better on these forums.  People don't like to read, even on a place that is designed for people to read.  It's kind of crazy.  That said, Rabadon was far more complicated than Melicent and it did very well.  Same with many of my other \"multiple form\" champions.  Still, I guess it couldn't hurt to get back to basics for a while.\n\nAgreed, some people are simple, we also have to think about their ages too though, not all of them have developed all their reasoning skills or patients for that matter! And your right it would appear that people are drawn more to a familiar or strong theme of a champ rather than the actual kit. (Gud art helps too :/, which works for me, but I know that you don't draw ur own stuff). But you're one of the most dedicated guys that I've seen, your time will come again I know. And don't worry about this general trend of mediocre concepts. I've been seriously working on 10 concepts right now. I'm in the process of finalizing them, before I send them to friends for feedback, before the boards. I could add you to the email list if you want, or you could just wait till their on the boards.\n\nSome of them will take a while cause I have to wait for inspiration to strike on the splash art, but they will come.\n\nBut really I wonder what happened to all the great concept creators: Embertime, Overclockwise, Jungleboy16, soulchaos, DiamondMatthew, MarthaJones, FloraFauna, SilverIceFaerie, Teneroth, DMC75001, Nationeon, Keagn,  JellyJackJack22, KUNSTFEHLA, and so many more. Where did they go!","replies":[{"poster":"Riot Lutzburg","date":"2015-07-14T05:55:15.691+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FlameHalbrdOkido,realm=NA,application-id=A8FQeEA8,discussion-id=oZ0j37UL,comment-id=001a00000000,timestamp=2015-07-14T02:24:22.624+0000)\n>\n> Agreed, some people are simple, we also have to think about their ages too though, not all of them have developed all their reasoning skills or patients for that matter! And your right it would appear that people are drawn more to a familiar or strong theme of a champ rather than the actual kit. (Gud art helps too :/, which works for me, but I know that you don't draw ur own stuff). But you're one of the most dedicated guys that I've seen, your time will come again I know. And don't worry about this general trend of mediocre concepts. I've been seriously working on 10 concepts right now. I'm in the process of finalizing them, before I send them to friends for feedback, before the boards. I could add you to the email list if you want, or you could just wait till their on the boards.\n> \n> Some of them will take a while cause I have to wait for inspiration to strike on the splash art, but they will come.\n> \n> But really I wonder what happened to all the great concept creators: Embertime, Overclockwise, Jungleboy16, soulchaos, DiamondMatthew, MarthaJones, FloraFauna, SilverIceFaerie, Teneroth, DMC75001, Nationeon, Keagn,  JellyJackJack22, KUNSTFEHLA, and so many more. Where did they go!\n\nI'd love to get a sneak peak, but at the same time I also want to be unbiased when I review the final product when you think it's ready.\n\nI love Embertime, Keagn and JellyJack's stuff!  I don't remember those other names very well, though.","replies":[]}]}]}]},{"poster":"FlameHalbrdOkido","date":"2015-07-14T02:32:02.719+0000","up_votes":1,"down_votes":0,"body":"Oh and FlintFall, and TheNeverworld, those guys were like 2nd and 3rd to you for me.","replies":[]},{"poster":"Riot Lutzburg","date":"2015-07-14T00:58:45.378+0000","up_votes":1,"down_votes":0,"body":"I'm starting to think I should have waited for that concept art...","replies":[]},{"poster":"Riot Lutzburg","date":"2015-07-13T18:18:00.801+0000","up_votes":1,"down_votes":0,"body":"Finally, I switched out Melicent's thumbnail image for the second time, in the hopes that it draws more people in.","replies":[]}]}