{"poster":"ElJineteFantasma","date":"2018-08-19T13:18:25.241+0000","title":"Idea para una partida en la que se va 1 afk luego de min 15","subforum":"Jugabilidad, balance y narrativa","up_votes":8,"down_votes":1,"body":"Es muy tedioso estar jugando una partida (mas si es ranked) y que un miembro del equipo se vaya afk ya sea por problemas de conexi&oacute;n o porque simplemente lo hizo intencional,Mi idea es de si un miembro se va afk y permanece por mas de 1 minuto darles un bonus de da&ntilde;o y armadura a los 4 restantes , no muy grande pero lo suficiente como para ser mayores en 1 vs 1 y tener mas chance de ganar la partida, es solo una idea no se si les parezca buena o mala pero queria compartirla.","replies":[{"poster":"Tur1nTur4mb4r ","date":"2018-08-19T15:15:03.589+0000","up_votes":3,"down_votes":0,"body":"Yo implementaría un \"banco de suplentes\". Crear una cola de suplentes donde te puedas unir y te emparejen a una ranked donde haya uno o más afk. Obviamente a cubrir el carril que haya quedado libre con el mismo champ previamente indicado al interesado.  O inclusive una lista de las partidas que necesitan un suplente con los datos del afk ( oro, maestrías, objetos, tiempo en partida, campeones, etc) y a asi uno puede elegir si unirse o no. Puede tocarte alguien mejor puede tocarte alguien peor. Si en 5' no aparece un suplente se da por perdida la partida pero no se te quitan puntos","replies":[]},{"poster":"Crinose","date":"2018-08-19T14:54:40.390+0000","up_votes":2,"down_votes":0,"body":"si fuera asi, si 4 usuarios se van afk (me ha pasado) el unico que queda seria un baron nashor que mata todo lo que hay en su camino xD.\npero eres el unico que ha propuesto algo, buena idea.\n{{sticker:sg-miss-fortune}}","replies":[{"poster":"ElJineteFantasma","date":"2018-08-19T15:08:40.420+0000","up_votes":1,"down_votes":0,"body":"De echo deberia funcionar solo con 1 afk , si no se haria muy facil y no darles un bonus absurdamente exagerado , algo con lo que sea suficiente un 2 vs 1","replies":[]}]},{"poster":"Lunari Red Mask","date":"2018-08-19T19:52:03.989+0000","up_votes":1,"down_votes":0,"body":"Quisiera dar un dato real en este post. Se trata del oro y la experiencia. Bien utilizado el mapa, te da más oro y experiencia sí son menos que el rival. Dado que queda un espacio libre. Me explico, sí un support o un adc esta solo en una linea, gana más experiencia y oro (siempre que sepa farmear). Es indiscutible que 5>4. Sin embargo hay formas de ganar. Una linea que tenga ventaja sobre otra a pesar de ser menos jugadores, hace que sí le sacas provecho puedas feedearte y carrear desde ahí. Eso sí, normalmente debes ganar en early y evitar tfs de 5vs4. \nUn saludo y mejor suerte en tus partidas.","replies":[{"poster":"Main Cocina S3","date":"2018-08-19T23:08:29.383+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lunari Red Mask,realm=LAS,application-id=xQmJPO8F,discussion-id=O0BPMQKG,comment-id=0003,timestamp=2018-08-19T19:52:03.989+0000)\n>\n> Quisiera dar un dato real en este post. Se trata del oro y la experiencia. Bien utilizado el mapa, te da más oro y experiencia sí son menos que el rival. Dado que queda un espacio libre. Me explico, sí un support o un adc esta solo en una linea, gana más experiencia y oro (siempre que sepa farmear). Es indiscutible que 5&gt;4. Sin embargo hay formas de ganar. Una linea que tenga ventaja sobre otra a pesar de ser menos jugadores, hace que sí le sacas provecho puedas feedearte y carrear desde ahí. Eso sí, normalmente debes ganar en early y evitar tfs de 5vs4. \n> Un saludo y mejor suerte en tus partidas.\n\nes cierto esto, si se me va el adc afk farmeo todos los cs y empiezo a stackear daño y si los otros 3 no caen en una guerra de flameos y se dedican a hacer lo que tienen que hacer se puede ganar","replies":[]}]},{"poster":"Jaime Lannisterr","date":"2018-08-19T17:45:23.792+0000","up_votes":1,"down_votes":0,"body":"Yo diría que se reparta el oro que ganó a todo el equipo restante, pero aumentando el tiempo que debe pasar, y que haya un mínimo que deba repartirse por ese uno menos.","replies":[]}]}