{"poster":"roseBRA","date":"2015-12-03T16:16:55.527+0000","title":"Beschreibung des Blind Picks","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":7,"body":"Wenn ich auf Blind Pick gehe, wird in dem Tooltip darunter erw&auml;hnt, dass man mit seinem Team versucht den gegnerischen Nexus zu zerst&ouml;ren und so eine Runde ca. 40 Minuten dauern k&ouml;nnte.\r\n\r\nEs wird nirgendwo erw&auml;hnt, was mit Blind Pick eigentlich gemeint ist.\r\nRein von dem Namen und dem Zustand in der Champion Selection her, w&uuml;rde ich sagen dass der Blind Pick der Modus ist, in dem jeder zu jeder Zeit einfach einen Champion ausw&auml;hlen kann und dabei nicht sehen kann was der Gegner ausw&auml;hlt: Blind eben.\r\n\r\n_Nirgendwo wird auch mit nur einem Wort erw&auml;hnt dass es sich hier bei um die Champion Discussion handeln soll._\r\nIch komme in die Selection und w&auml;hle einen Champion aus der meiner Meinung nach eine recht eindeutige Rolle haben sollte.\r\nZum Beispiel Kindred mit Smite. Wird wohl Jungle werden.\r\n\r\nDann werde ich beleidigt und sogar reported daf&uuml;r, dass ich das tue.\r\nSoll ich etwa im Chat dar&uuml;ber diskutieren was und wo ich spielen wollen w&uuml;rde?\r\nStatt MID zu spamen, kann ich doch MID picken. Es ist doch Champion **Selection**... Ich selecte doch etwas.. wozu also der Hass?","replies":[{"poster":"Nephirelle","date":"2015-12-03T16:23:44.485+0000","up_votes":3,"down_votes":0,"body":"Du kannst natürlich picken was du willst und jegliche Kommunikation mit dem Team verweigern. Ob du mit deiner sozialen Einstellung aber unbedingt auf einen Sieg zusteuerst, dürfte angesichts der Tatsache, dass LoL ein TEAMSPIEL ist, stark zu bezweifeln sein.","replies":[{"poster":"roseBRA","date":"2015-12-03T16:27:21.934+0000","up_votes":2,"down_votes":2,"body":"Was ist deiner Meinung nach denn meine soziale Einstellung?\nEs wird in den ersten 3 Sekunden sämtliche Rollen gespamt und wenn man einfach schweigend einen Champion anwählt, ist man gleich ein \"retard, kid\".","replies":[{"poster":"Nephirelle","date":"2015-12-03T16:37:49.553+0000","up_votes":2,"down_votes":0,"body":"Und was genau hält dich davon ab, einfach Teambuilder zu spielen? Der löst dein Problem auf ganz profane Art und Weise.\nIn meinen Augen willst du dich einfach nur plump aufregen.","replies":[{"poster":"roseBRA","date":"2015-12-03T16:41:14.731+0000","up_votes":1,"down_votes":1,"body":"Nein möchte ich nicht.. es ist doch gar nicht böse gemeint.. oO\nIch meine das ernst weil es mich einfach wundert dass man dafür beleidigt wird.\nEs heißt BLIND PICK. Ich PICKE. Ich bin der böse.\nDie anderen sind im BLIND PICK. Sie SPAMMEN DEN CHAT. Sie sind die guten.\n\nIch will nur wissen weshalb das so ist.\n\nWenn ich Teambuilder nutze kann ich als Nicht-Support pro Woche 1 Spiel joinen bei dem ich 20 mal zugucken darf wie der Support abspringt weil auf der Jungle Position ein Teemo sitzt.","replies":[]}]}]}]},{"poster":"Ender Chest","date":"2015-12-04T12:46:43.487+0000","up_votes":2,"down_votes":0,"body":"Na klar; beim Fussball gehst du auch einfach irgendwohin, weil du das Spiel wahrscheinlich eh nicht checkst. Ist auch bei LoL so. Wenn du gewinnen willst kommuniziere.","replies":[]},{"poster":"AyRe CoNteMpT","date":"2015-12-03T16:19:49.707+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"roseBRA","date":"2015-12-03T16:31:01.982+0000","up_votes":2,"down_votes":1,"body":"Deswegen zitiere ich ja den Tooltip des Blind Picks: Welches System denn?\nWoher soll ich wissen wonach sich das richtet!? Das einzige was ich darauf ziehen kann ist: Alle Spammen durcheinander sämtliche Positionen und es wird immer mind. einer beleidigt oder es wird gespamt: ME FIRST.","replies":[{"poster":"AyRe CoNteMpT","date":"2015-12-03T16:55:45.683+0000","up_votes":1,"down_votes":0,"body":"ja, es is ein sehr dummes system und im grunde ist blind pick auch nicht dafür da, nach der meta zu spielen und jede rolle aufzuteilen. man sollte einfach picken worauf man bock hat und gehen wohin man will und wenn dann 5 mid sind is auch okay.\n\nleider sind all die noobs die regelmäßig normals spielen voll drauf versessen einer meta zu folgen die sie nicht mal verstehen geschweige denn die auf ihrem skill level irgend eine auswirkung hat. \n\njeder anfänger muss eben darunter leiden. meine kleinen brüder haben auch vor ner weile mit league angefangen und  leveln grade ihre accounts und die haben auch kein plan was was is. die werden auch immer geflamed und reportet ;D\n\nRICHTIG GEILE AKTION RITO!\n\naber man kann eben nix machen. trotzdem ja, du hast recht, es is ein dummes system und du trägst keine schuld daran dass deine mitspieler geistig benachteiligt sind.","replies":[{"poster":"eingew","date":"2015-12-04T09:25:16.299+0000","up_votes":1,"down_votes":0,"body":"Riot ist Schuld, dass sich die Community eigene Systeme schafft?","replies":[{"poster":"AyRe CoNteMpT","date":"2015-12-04T09:43:31.994+0000","up_votes":1,"down_votes":1,"body":"das is so eine geil ignorante, vermutlich rhetorische frage~~\n\n\"die community\" hat in einem anfängermodus sehr anfängerunfreundliche \"regeln\" aufgestellt die regelmäßig zu reports und strafen führen und den spielspaß für anfänger deutlich mindern, wie zum beispiel dieser thread hier zeigt.\n\nrito hat es versäumt dem entgegenzuwirken und ein anfängerfreundlicheres system zu schaffen.\n\nteambuilder zb umgeht diesen ganzen stress, zwingt den spielern aber wiederum eine art \"meta\" auf. ich habe nie verstanden warum rito sich so auf diese fünf verschiedenen rollen versteift anstatt dem game einfach die chance zu geben, sich zu entwickeln. aber das nur so nebenbei.\n\nein normalgame erklärt einem nirgendwo, dass man sich an die meta zu halten hat und eine der fünf meta rollen spielen muss. \n\nman hätte den modus zb in \"freies spiel\" umbenennen können und darunter schreiben \"In diesem modus kann jeder spielen wie er möchte. für metaorientierte teams wähle den teambuilder modus\" oder ähnliches.\n\nalso benutz ruhig weiter das wort \"schuld\", is ein super konzept und sollte in diesem game viel öfter anwendung finden. ich bezeichne es eher als eine art verantwortungslosigkeit.","replies":[{"poster":"eingew","date":"2015-12-04T10:30:34.574+0000","up_votes":2,"down_votes":0,"body":"> RICHTIG GEILE AKTION RITO!\n\nDas hier war also keine Schuldzuweisung? Ich zumindest habe das als eine eindeutige Suche nach einem Verantwortlichen empfunden, der in diesem Falle leider nahezu nichts mit dem von dir bemängelten System zu tun hat.\n\nInwiefern zwingt der TB eigentlich eine Meta auf? Okay, vielleicht fehlt eine spezifischere Rolle, wie zum Beispiel ein roamender Support oder ein Jungler, der aber eigentlich nur gankt. Aber das alles sind Dinge, die man locker in 2 Sätzen in den Chat kopiert. Ich verstehe deinen Punkt da nicht ganz.\n\nAußerdem verstehe ich nicht, wieso du in einem Absatz schreibst, Blind Pick ist anfängerunfreundlich (grob umrissen, das ist die aktuelle Situation und bei diesem Satz stimme ich dir völlig zu), aber Riot hätte es versäumt dem entgegenzuwirken... und dann ist der nächste Satz, dass der TB den ganzen Müll einfach umgeht. Das heißt doch eigentlich, dass Riot eine ideale Lösung gefunden hat, weil der TB das Problem völlig aus der Welt schafft, oder nicht?\n\n> ein normalgame erklärt einem nirgendwo, dass man sich an die meta zu halten hat und eine der fünf meta rollen spielen muss.\n\nWarum auch? Die \"Meta\" ist nur eine abstrakte Taktik, die im aktuellen System am besten von allen bekannten Taktiken funktioniert. Warum sollte der Erfinder des Schachs sich um verschiedene Taktiken darum kümmern? Der findet die vielleicht interessant und redet auch darüber... aber er schreibt sie nicht zwingend in eine Bedienungsanleitung und legt sie damit quasi als Regeln fest.\nRiot ist die Meta völlig egal. Die scheren sich nicht darum. Das einzige was die tun, ist die Champions und Items zu balancen. Wie man das als Spieler am effektivsten einsetzt und sich selbst zum Sieg spielt ist dem Entwickler egal. Die Meta ist keine Regel, sondern nur ein weiteres System, was die Community geschaffen hat. Riot ist für ein möglichst nicht metagebundenes Spiel. Und deshalb werden die sich hüten, jemals etwas darüber in die Wartschlange zu schreiben oder gar einen Modus zu veröffentlichen, wo man an die Meta gebunden wird.\n\n> also benutz ruhig weiter das wort \"schuld\", is ein super konzept und sollte in diesem game viel öfter anwendung finden. ich bezeichne es eher als eine art verantwortungslosigkeit.\n\nGenau so habe ich dich auch verstanden. Riot ist in deinen Augen \"verantwortungslos\", also Schuld, dass etwas falsch läuft. In gewisser Weise hast du damit auch Recht. Aber eben nicht nur, wie ich bereits erläutert habe, weil du durch einige Irrtümer zu diesem Schluss kommst.","replies":[{"poster":"AyRe CoNteMpT","date":"2015-12-04T11:06:32.670+0000","up_votes":1,"down_votes":1,"body":"1. schuld =/= verantwortung. ganz wichtig.\n\n2. TB zwingt die meta der fünf rollen auf. es gibt einen support, einen marksman, einen jungler, einen \"midlaner\" und einen \"toplaner\". das ist eine gewisse art von meta-rollenverteilung die sich durch gewisse gamedesignfaktoren herauskristallisiert hat und die dann von rito untermauert wurden. ich habe nie verstanden wieso sie unbedingt diese rollen so klar definieren wollen, aber seis drum. das ist aber keine beschwerde an den TB, dieser ist völlig in ordnung. das ist eben ein ganz klar definierter modus in dem ein team nach diesen kriterien erstellt wird und alles cool!\n\n3. das problem an blind pick ist, dass die community durch die fehlende definition des modus erwartet, alles laufe genauso ab wie im teambuilder. ich hab zuerst mid gesagt und das gibt mir ein anrecht diese lane für mich zu beanspruchen und wenn mein kleiner bruder im game is der keine ahnung hat was \"mid\" alles impliziert pickt er leblanc und geht mid und wird beleidigt und reportet.\nblind pick sollte ganz klar als \"spielregel\" definiert haben, dass es keine vorgeschriebenen rollen gibt sondern jeder einfach spielt was und wie er will. \"freies spiel\" eben. hier hätte rito schon vor jahren was ändern sollen/müssen/können/wär geil gewesen. wenn leute einen meta-simulator suchen, können sie teambuilder oder draftpick spielen, blindpick ist der absolute noob-modus und muss klarer als solcher definiert werden.\n\n4. du scheinst nicht verstanden zu haben dass die existenz von \"support\" und \"midlaner\" bereits ein metasystem ist. es muss nicht ahri mid sein damit es \"meta\" ist. allein die tatsache, dass riot ihre champions nicht mehr nur in \"magier\", \"kämpfer\", \"assassine\" usw einteilt sondern auch in \"support\" und \"jungle\" zeigt ganz klar, dass sie hinter diesem metakonstrukt stehen und das auch ganz klar mit ihren gamedesignentscheidungen unterstützen.\n\nein magier ist ein typ champion der, wie der name schon sagt, magie benutzt. ein kämpfer ist einer der im nahkampf viel einstecken und austeilen kann. ein \"jungler\" ist keine beschreibung des championtyps sondern der championrolle. in den anfangstagen von league of legends war das anders. da gab es zwar ein relativ klares konzept, den jungle stärker in das spiel einzubinden als in anderen mobas, allerdings gab es da weder \"adc\" und \"support\", noch klare rollenverteilungen für die unterschiedlichen lanes. GRUNDSÄTZLICH ist es okay, dass rito diese meta unterstützt. es ist NUR nicht okay, dass es einen modus gibt in dem diese meta weder unterstützt noch aufgehoben wird, so dass anfänger die keinen plan haben einfach spielen wollen aber dafür reportet werden. \n\n5. hier einfach nochmal der klarheit wegen. schuld und verantwortung sind nicht identisch miteinander und wer seiner verantwortung nicht nachkommt, ist nicht unbedingt ein schuldiger.\nich werfe rito vor, dass der blindpick modus anfängerunfreundlich ist und ganz dringend umbenannt und mit entsprechender beschreibung versehen werden sollte. \nverantwortung ist ein konstruktives konzept, schuld ein völlig sinnfreies. \nnur falls es dich wirklich interessiert:\nhttps://de.wikipedia.org/wiki/Schuld_(Ethik)\nhttps://de.wikipedia.org/wiki/Verantwortung","replies":[{"poster":"eingew","date":"2015-12-04T12:20:42.720+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AyRe CoNteMpT,realm=EUW,application-id=KYnfKGf0,discussion-id=u60Jlb9V,comment-id=0000000000000000000000000000,timestamp=2015-12-04T11:06:32.670+0000)\n>\n> 1. schuld =/= verantwortung. ganz wichtig.\n\nDie Definition von Schuld ist, dass jemand für etwas negatives **verantwortlich** ist. Ja, es gibt einen Unterschied zwischen Schuld und Verantwortung. In dem hier geschilderten Problem sind sie aber eindeutig äquivalent.\n\n> 2. TB zwingt die meta der fünf rollen auf. es gibt einen support, einen marksman, einen jungler, einen \"midlaner\" und einen \"toplaner\". \n\nNein. Im Teambuilder gibt es 6 Wählbare Rollen: Assassin, Fighter, Mage, Marksman, Support und Tank. Diese kann man auf 4 beliebigen Positionen spielen: Top Lane, Middle Lane, Bottom Lane und Jungle. Keine dieser Rollen muss zwingend auf einer bestimmten Position gespielt werden, und keine Position muss zwingend im Spiel vorhanden sein. Oder gar nur einmal vorkommen. Der Teambuilder gibt absolut nichts vor, außer den von den Entwicklern erdachten Rollen, die die Champions erfüllen sollen. Die Positionen auf der Map ergeben sich logisch anhand des Farms, den sie bieten. Wie du das alles aufteilst ist dein Problem, nicht Riots.\n\n> das ist eine gewisse art von meta-rollenverteilung die sich durch gewisse gamedesignfaktoren herauskristallisiert hat und die dann von rito untermauert wurden. ich habe nie verstanden wieso sie unbedingt diese rollen so klar definieren wollen, aber seis drum. das ist aber keine beschwerde an den TB, dieser ist völlig in ordnung. das ist eben ein ganz klar definierter modus in dem ein team nach diesen kriterien erstellt wird und alles cool!\n\nUnd inwiefern verhindert der Teambuilder jetzt, wenn ich Alistar als AD Assassine auf der Midlane spiele? Oder Eve als Roaming Support, der letztendlich überall auf der Map ist? Oder Kata hybrid Jungle? doublemid? 3 auf der Bot? Doubletop? Was am System des Teambuilders verhindert diese Aufstellungen? 0.o\n\nUnd wenn du keine Rollen magst... wie willst du verhindern eine Rolle einzunehmen? Egal welchen Build du wählst, auf welcher Position du spielst und welchen Champ du pickst, irgendeine Rolle wirst du immer damit einnehmen.\n\n> 3. das problem an blind pick ist, dass die community durch die fehlende definition des modus erwartet, alles laufe genauso ab wie im teambuilder. \n\nDie Theorie halte ich für absolut unsinnig. Der TB wurde als letzter Modus eingeführt und man schaltet ihn erst mit einem gewissen Level frei. Andersrum finde ich es ja durchaus möglich, ich kann verstehen, wenn ein Huhn denkt, es sei ein Ei, weil es in seiner Entwicklung stehen geblieben ist, aber ein Ei das denkt es sei ein Huhn, ohne zu wissen, was das ist? Das ist irrational.\nAußerdem wüsste ich nicht, was der Blind Pick groß braucht, außer einer offeneren Mentalität. Man hat genug Zeit, um sich mit dem Team abzusprechen, auf welcher Position man spielen möchte und welchen Champion man dazu wählt. Klar kann man das sabotieren. Kann man aber immer und in jeder Queue.\n\n> ich hab zuerst mid gesagt und das gibt mir ein anrecht diese lane für mich zu beanspruchen und wenn mein kleiner bruder im game is der keine ahnung hat was \"mid\" alles impliziert pickt er leblanc und geht mid und wird beleidigt und reportet.\n\nWas wie bereits erklärt absolut nichts mit Blind Pick, sondern mit der Mentalität der Leute zu tun hat. Abgesehen davon fehlt hier nur eine dicke Haut. Deinem Bruder können die Beleidigungen egal sein, er mutet die Leute und reported sie am Ende, denn deren Reports haben absolut keine Wirkung, zumal dein Bruder mit dem von dir beschriebenen Verhalten keinerlei Regeln verletzt hat.\n\n> blind pick sollte ganz klar als \"spielregel\" definiert haben, dass es keine vorgeschriebenen rollen gibt sondern jeder einfach spielt was und wie er will. \n\nGenau das wird durch eine nicht vorhandene Definition impliziert.\n\n> 4. du scheinst nicht verstanden zu haben dass die existenz von \"support\" und \"midlaner\" bereits ein metasystem ist. \n\nNein, das ist nicht richtig. Ein Support macht keine Meta aus. Janna ist als Support designed, sie soll andere Champions unterstützen. Wie sie das tut, *das* ist die Meta. Ob man sie überhaupt Support spielt, oder sie doch auf einer anderen Position effektiver findet, wie es beispielsweise mit Lulu auf der Mid und der Top passiert ist, *das* ist die Meta. Die Bezeichnung \"Support\" ist nur eine Rolle. Die Meta ist das Gesamtkonstrukt.\n\n> es muss nicht ahri mid sein damit es \"meta\" ist. allein die tatsache, dass riot ihre champions nicht mehr nur in \"magier\", \"kämpfer\", \"assassine\" usw einteilt sondern auch in \"support\" und \"jungle\" zeigt ganz klar, dass sie hinter diesem metakonstrukt stehen und das auch ganz klar mit ihren gamedesignentscheidungen unterstützen.\n\nNein. Riot steht hinter einem Metakonstrukt, ja, aber nicht hinter *dem* Metakonstrukt, was es angesichts der ständigen Änderungen sowieso nicht gibt. Die Meta wandelt sich ständig. Nach jedem Patch verändert sich dieses Konstrukt, mal mehr, mal weniger. Riot gibt in keiner Weise vor, dass ich meine Janna als Support spiele. Riot sagt nur, dass das die Rolle ist, für die Janna designed ist. Wo und wen ich mit Janna Supporte ist Riot egal. Ob ich sie überhaupt als Support Spiele ist Riot egal. Riot legt keine Meta fest. Die Community/die Proplayer machen das.\n\n> ein magier ist ein typ champion der, wie der name schon sagt, magie benutzt. ein kämpfer ist einer der im nahkampf viel einstecken und austeilen kann. ein \"jungler\" ist keine beschreibung des championtyps sondern der championrolle. in den anfangstagen von league of legends war das anders. da gab es zwar ein relativ klares konzept, den jungle stärker in das spiel einzubinden als in anderen mobas, allerdings gab es da weder \"adc\" und \"support\", noch klare rollenverteilungen für die unterschiedlichen lanes. \n\nGenau wie heute. Ja, man hat früher Ashe mid gespielt. Da war sie eben am effektivsten. Jetzt spielt man sie bot, weil sie da am effektivsten ist. Riot hat das nur sehr sehr indirekt durch ihre Balancingchanges bewirkt, ich bezweifle aber sehr stark, dass sie Ashe dabei absichtlich auf die Botlane gelotst haben.\n\n> GRUNDSÄTZLICH ist es okay, dass rito diese meta unterstützt. es ist NUR nicht okay, dass es einen modus gibt in dem diese meta weder unterstützt noch aufgehoben wird, so dass anfänger die keinen plan haben einfach spielen wollen aber dafür reportet werden. \n\nDiese Reports bewirken nichts. Wenn ein Spieler das Reportsystem missbraucht ist das nicht Riots Fehler.\n\n> 5. hier einfach nochmal der klarheit wegen. schuld und verantwortung sind nicht identisch miteinander und wer seiner verantwortung nicht nachkommt, ist nicht unbedingt ein schuldiger.\n\nAber sicher ist er das. Wenn ich Lehrer wäre, dann wäre ich für die Kinder, die ich unterrichte, verantwortlich. Deren Eltern haben ihre Kinder in meine Obhut gegeben. Wenn den Kindern etwas zustößt bin ich daran Schuld, weil es in meiner Verantwortung lag genau das zu verhindern. Ich bin meinem Job nicht nachgekommen.\n\n> ich werfe rito vor, dass der blindpick modus anfängerunfreundlich ist und ganz dringend umbenannt und mit entsprechender beschreibung versehen werden sollte. \n\nWieso? Du hast doch selbst gesagt, dass der Blind Pick dem Namen nach ein Modus ist, bei dem man einfach pickt, nicht sieht, was die Gegner picken und jeder spielt wie er will (als Team, also nach Möglichkeit mit Absprache). Genau das ist Riots Definition. Ich verstehe nicht, an welcher Stelle diese Firma deiner Annahme widerspricht.\n\n> verantwortung ist ein konstruktives konzept, schuld ein völlig sinnfreies. \n\nNein, Schuld ist nicht sinnfrei. Sie ist Gefühlsorientiert und absolut notwendig für einen empathischen und sozial aktiven Menschen. Schuld gehört zu den notwendigen Gefühlen um uns Menschen menschlich zu machen und keine Soziopathen oder einfach funktionierende Maschinen zu sein.\n\n> nur falls es dich wirklich interessiert:\n> https://de.wikipedia.org/wiki/Schuld_(Ethik)\n\nErste Überschrift: Schuld als Verantwortlichkeit. Wenn ich verantwortlich für eine ethische, sittliche, moralische oder sonstige Verletzung bin, bin ich Schuld.","replies":[]}]}]}]}]}]}]}]},{"poster":"Epic Melons","date":"2015-12-04T02:38:10.594+0000","up_votes":2,"down_votes":0,"body":"Mache ich genau wie der OP. Ich picke was ich spielen will und locke dann. \n\nDeswegen ist es ja Blindpick. Wer eine bestimmte Position möchte soll draft oder Teambuilder spielen.{{champion:18}}","replies":[]},{"poster":"Call me Br00t","date":"2015-12-03T16:20:29.721+0000","up_votes":2,"down_votes":2,"body":"Es sollte allgemein bekannt sein, das man im Blind Pick zuerst seine Position nennt und dann einloggt.","replies":[{"poster":"roseBRA","date":"2015-12-03T16:30:00.383+0000","up_votes":1,"down_votes":2,"body":"Dazu hätte ich eben die Quelle weshalb das allen allgemein bekannt sein soll, nur mir nicht!?\nIch spiele erst seit 2 Tagen Blind Pick. Habe sonst nur Draft und Rankeds gespielt.\n\nDa dort aber der Champ oft gebannt wird, den ich spielen möchte, habe ich es mit Blind Pick versucht.\nIch möchte ja nur Yasuo spielen, damit mich Yasuos nicht mehr so leicht killen können weil ich immer überfordert war und nicht einschätzen konnte was die mit mir anstellen.","replies":[{"poster":"Call me Br00t","date":"2015-12-03T16:39:26.380+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=roseBRA,realm=EUW,application-id=KYnfKGf0,discussion-id=u60Jlb9V,comment-id=00010000,timestamp=2015-12-03T16:30:00.383+0000)\n>\n> Dazu hätte ich eben die Quelle weshalb das allen allgemein bekannt sein soll, nur mir nicht!?\n> Ich spiele erst seit 2 Tagen Blind Pick. Habe sonst nur Draft und Rankeds gespielt.\n> \n> Da dort aber der Champ oft gebannt wird, den ich spielen möchte, habe ich es mit Blind Pick versucht.\n> Ich möchte ja nur Yasuo spielen, damit mich Yasuos nicht mehr so leicht killen können weil ich immer überfordert war und nicht einschätzen konnte was die mit mir anstellen.\n\nIrgendwo wurde mal von Riot Leuten oder von der Mehrheit der Spieler gesagt Blind --> Callorder > Pickorder & im ranked anders rum","replies":[{"poster":"roseBRA","date":"2015-12-03T16:42:01.113+0000","up_votes":2,"down_votes":1,"body":"Weshalb sagt einem das keiner anstatt mich einfach nur stumpf retard und kiddo zu nennen..?","replies":[{"poster":"Call me Br00t","date":"2015-12-03T16:48:25.420+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=roseBRA,realm=EUW,application-id=KYnfKGf0,discussion-id=u60Jlb9V,comment-id=0001000000000000,timestamp=2015-12-03T16:42:01.113+0000)\n>\n> Weshalb sagt einem das keiner anstatt mich einfach nur stumpf retard und kiddo zu nennen..?\n\nWeil die community toxic as hell ist ...","replies":[{"poster":"roseBRA","date":"2015-12-03T16:55:53.930+0000","up_votes":1,"down_votes":0,"body":"nagut.\n\nalso absofort MID->Yasuo anwählen->ME FIRST->Einlocken? :>","replies":[{"poster":"The Green Goo","date":"2015-12-03T17:14:38.952+0000","up_votes":2,"down_votes":0,"body":"Wieso spielst du nicht einfach Team Builder?","replies":[{"poster":"roseBRA","date":"2015-12-03T17:18:58.550+0000","up_votes":1,"down_votes":2,"body":"Weil ich Yasuo nicht als Support spielen möchte.","replies":[{"poster":"Tungsteel","date":"2015-12-04T09:34:00.873+0000","up_votes":2,"down_votes":0,"body":"Such dir einen Premade und mach gemeinsam mit dem eine Gruppe auf. Klar wirst du dann auf den Support eventuell warten können, aber du bekommst die Rolle, die du magst, und den Champion, den du magst. Das ist schon ein Vorteil. \n\nWenn du als Premade einen Supporter oder einen Jungler hast, wirst du sogar nur relativ kurz warten müssen, weil man ADC und Top (und mid, aber das wäre dann deine Rolle) meistens sehr schnell findet.","replies":[]},{"poster":"Waldschrat86","date":"2015-12-03T18:08:08.662+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=roseBRA,realm=EUW,application-id=KYnfKGf0,discussion-id=u60Jlb9V,comment-id=00010000000000000000000000000000,timestamp=2015-12-03T17:18:58.550+0000)\n>\n> Weil ich Yasuo nicht als Support spielen möchte.\n\n? Ich find sogar mit Teemo Top immer recht schnell Spiele, sogar Mitte ist mittlerweile recht schnell. Du sagst selber, du hast vorher nur Draft gespielt, Pick und Bannphase dauern da in der Regel 5-6 Min. plus die Zeit zum Suche 0-3Min. Bei TB wart ich insgesamt, solange es nicht mitten in der Nacht ist 8 Min. und selbst da gehts meistens schneller, in Stoßzeiten sowieso, im Schnitt komm ich auf 4-6 Min. und die hab ich bei Draft auch, wenn nicht mehr. Die Helden, die bis 1s vor Spielbeginn mit dem Dodge warten kennt wohl jeder...","replies":[{"poster":"roseBRA","date":"2015-12-03T18:21:23.157+0000","up_votes":1,"down_votes":0,"body":"Wirklich? oO\nIch warte meist so 10-15min und teilweise breche ich nach 20 ab.\n\nBei Draft bin ich aus irgendwelchen Gründen meist derjenige der Banned. Und ich banne immer 3 aus einem Pool von 6 die ich mir aktuell merke. Da mus sich nicht lange bannen.\nZack Brand. Zack Graves. Zack Jax. zB. Das geht eigentlich fix :o Die Gegner hauen dann die Garen, Gankplank und Fiora Bans raus und schon wird gepickt.","replies":[{"poster":"Waldschrat86","date":"2015-12-03T19:23:49.201+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=roseBRA,realm=EUW,application-id=KYnfKGf0,discussion-id=u60Jlb9V,comment-id=0001000000000000000000000000000000000000,timestamp=2015-12-03T18:21:23.157+0000)\n>\n> Wirklich? oO\n> Ich warte meist so 10-15min und teilweise breche ich nach 20 ab.\n> \n> Bei Draft bin ich aus irgendwelchen Gründen meist derjenige der Banned. Und ich banne immer 3 aus einem Pool von 6 die ich mir aktuell merke. Da mus sich nicht lange bannen.\n> Zack Brand. Zack Graves. Zack Jax. zB. Das geht eigentlich fix :o Die Gegner hauen dann die Garen, Gankplank und Fiora Bans raus und schon wird gepickt.\n\nJo und die Picks sind dann gleichzeitig? :)\n\nMach mal n Stoppuhrtest. ;)\n\nSchade, dass die Wartezeiten bei dir so sind, ich muss da wohl bei den \"Problemrollen\" in ner recht vorteilhaften Elo sein :P.\n\nBei 10+ brech ich auch meist ab und geh in Draft, zumal ich Mirrormatchups so gar nicht mag und die gibt es ja leider auch im TB :(.","replies":[]}]}]}]}]},{"poster":"Call me Br00t","date":"2015-12-03T18:08:48.122+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=roseBRA,realm=EUW,application-id=KYnfKGf0,discussion-id=u60Jlb9V,comment-id=000100000000000000000000,timestamp=2015-12-03T16:55:53.930+0000)\n>\n> nagut.\n> \n> also absofort MID->Yasuo anwählen->ME FIRST->Einlocken? :>\n\njoa solange du erster bist :D\n\noder spiel halt mit 4 anderen oder teambuilder und wähl yasuo mid aus ^^","replies":[{"poster":"0815xand0r","date":"2015-12-03T19:24:05.865+0000","up_votes":2,"down_votes":0,"body":"Zur Not kann er auch behaupten erster gewesen zu sein, der Chat ist ja noch immer nicht synchronisiert ^^","replies":[]}]}]}]}]},{"poster":"Shiggyvara","date":"2015-12-04T07:12:06.056+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Project Br00t,realm=EUW,application-id=KYnfKGf0,discussion-id=u60Jlb9V,comment-id=000100000000,timestamp=2015-12-03T16:39:26.380+0000)\n>\n> Irgendwo wurde mal von Riot Leuten oder von der Mehrheit der Spieler gesagt Blind --> Callorder > Pickorder & im ranked anders rum\n\nBlödsinn...Callorder wurde so nie gesagt. \nDas Einzige was mal geschrieben wurde war Kommunikation (Und damit ist nicht gemeint:\"Ich hab am schnellsten \"Mid\" in den Chat gespammt) sollte vor Pickorder gehen.","replies":[{"poster":"Call me Br00t","date":"2015-12-04T13:17:02.549+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=FTHGN,realm=EUW,application-id=KYnfKGf0,discussion-id=u60Jlb9V,comment-id=0001000000000001,timestamp=2015-12-04T07:12:06.056+0000)\n>\n> Blödsinn...Callorder wurde so nie gesagt. \n> Das Einzige was mal geschrieben wurde war Kommunikation (Und damit ist nicht gemeint:\"Ich hab am schnellsten \"Mid\" in den Chat gespammt) sollte vor Pickorder gehen.\n\nSchnuggi genau das ist Callorder ... Wenn man keine Ahnung von dem Thema hat lieber mal Mund zu, danke!","replies":[{"poster":"eingew","date":"2015-12-04T13:34:27.542+0000","up_votes":3,"down_votes":1,"body":"Nein. Callorder ist keine gute Kommunikation, Callorder ist Instalocken in grün.","replies":[{"poster":"Call me Br00t","date":"2015-12-04T14:05:16.865+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=u60Jlb9V,comment-id=000100000000000100000000,timestamp=2015-12-04T13:34:27.542+0000)\n>\n> Nein. Callorder ist keine gute Kommunikation, Callorder ist Instalocken in grün.\n\nWas gute Kommunikation ? :D\n\nIch Call (nenne) meine Position wie jeder andere und der erste nimmt sie oder ist halt nett und gibt dem anderen die Position","replies":[{"poster":"eingew","date":"2015-12-04T14:08:12.025+0000","up_votes":1,"down_votes":0,"body":"\"Ist halt nett\" ist die Art von Kommunikation, die FTHGN meinte. Das ist gute und sinnvolle Kommunikation. Alles andere ist... sagen wir mäßig.","replies":[]}]}]}]}]}]}]}]},{"poster":"0815xand0r","date":"2015-12-03T16:48:28.051+0000","up_votes":2,"down_votes":0,"body":"Also es gibt die ungeschriebene Regel, dass man erstmal ansagt, auf welcher Position man spielen möchte, um zu vermeiden, dass man am Ende mit drei Junglern und zwei Supportern ins Spiel geht. Aber das ist keine echte Regel in dem Sinne, dass es vorgeschrieben wäre. Vor allem wenn du nicht einloggst, sondern den Champ nur auswählst, ist das kein Thema, danach kann man ja noch immer schauen, ob man eine Positionsverteilung findet, die alle zufrieden stellt.\n\nInsgesamt ist es aber so, dass du in JEDEM Spiel (egal welcher Pick-Modus, ob Normal oder Ranked, etc) jeden Champion auf jeder Position spielen kannst und darfst und es im Prinzip völlig egal ist, ob vorher jemand schreibt, dass er gern auf dieser Position oder mit diesem Champion spielen will. Es ist zwar nicht höflich und kann schon in der Champion-Select dazu führen, dass das Team sich nicht mag, aber erlaubt ist es.","replies":[]},{"poster":"Sihari","date":"2015-12-03T16:22:50.862+0000","up_votes":2,"down_votes":0,"body":"Naja, der Chat ist dazu da, dass man sich während der Pick-Phase mit seinen Mates abstimmen kann. Wenn jemand einfach einen Champion pickt, obwohl ein anderer vielleicht gerade im Chat meinte, dass er diese Rolle egrn übernehmen würde, dann ist es unhöflich ohne etwas zu sagen einfach so einzuloggen.\nTrotzdem ist flame auch in dieser Situation absolut unnötig.\nAm sichersten ist es einfach gleich zum Anfang in den Chat zu posten, welche Rolle man bevorzugt und dann kann man einen entsprechenden Champ auch anwählen OHNE ihn final einzuloggen um evt noch einmal Rücksprache mit dem Team halten zu können.\nSo kann man einem flame zum größten Teil aus dem Weg gehen.","replies":[{"poster":"roseBRA","date":"2015-12-03T16:28:42.488+0000","up_votes":3,"down_votes":2,"body":"Ich meine ja Select. Nicht Lock.\n\nIch klicke Yasuo an und werde dann schon beleidigt dafür, weil jemand zuvor 20 mal MID gespamt hat.\nDann wird sogar der Chat komplett markiert, kopiert und erneut gepostet als Beweis dass ich gerade die \"Regeln\" verletze? Aber deswegen meine ich ja: Weshalb sollte das so laufen?\n\nEs ist Blind PICK. Ich PICKE etwas.. und bin dann der fiese?","replies":[{"poster":"eingew","date":"2015-12-04T09:23:56.873+0000","up_votes":1,"down_votes":0,"body":"Du hast völlig recht. Die Community hat sich ein eigenes System zum ungeschriebenen Gesetz gemacht. Kein sinnvolles System und genauso unhöflich wie ein Instalock, aber ich glaube nicht, dass es möglich ist, dieses System loszuwerden.\nIch würde dir wirklich den TB empfehlen, die Wartezeit lohnt sich.","replies":[]}]}]}]}