{"poster":"Xuven","date":"2016-02-03T11:02:48.854+0000","title":"Warwick Gank Fix - Make him viable!","subforum":"Player Creations","up_votes":1,"down_votes":0,"body":"Hello, I have a small suggestion to allow Warwick to be played in competitive games, allow for fun plays and also create viability in the jungle by adding the possibility of early game ganks.\r\n\r\nI have read that a Warwick rework is in production, adding a lot of cool skills, my favorite being the boomerang ability, however with both Taric and Yorick currently lined up, I fear my favorite pick is going to be phased out before his rework!\r\n\r\nAnyway, my suggestion is a small change to his Hungering Strikes (Q) ability;\r\n\r\nRather than being a point and click, I believe this should be changed to a small-mid range skill shot ability, in addition to adding a small slow or short root, this will allow Warwick to gank early and also not change his jungle clear or late game power, and if anything allows the player to make mistakes - as well as having good play potential!\r\n\r\nI don&#039;t believe the damage of the ability needs a change given that this would be a skill shot ability, though that is entirely up to Riot to decide.\r\n\r\nI hope you all like my suggestion, and if not can tell me what would be a better improvement! I would like to see Warwick become a more viable jungler in competitive play and not be so shunned by the Ranked community.\r\n\r\n{{champion:19}}","replies":[{"poster":"SaltyGrandpaNuts","date":"2016-02-07T02:27:30.275+0000","up_votes":1,"down_votes":0,"body":"i like an idea for a new e or w maybe that for ww next 2 basic attacks he gains increased damage and attack speed but dont apply on hit effects, then instead of a third attack ww has the ability to jump a short distance to the target, the jump ability would stay there for say 10-15 seconds to make it a good engage for a gank.","replies":[]},{"poster":"GigaPube","date":"2016-02-03T21:52:09.989+0000","up_votes":1,"down_votes":0,"body":"give warwick more CC than his ult? some people just wanna watch the world burn","replies":[]},{"poster":"JasonWazza","date":"2016-02-03T17:24:04.936+0000","up_votes":1,"down_votes":0,"body":"Honestly having any sort of CC on Warwicks Q without a full rework is just not going to work, because Warwick only works right now because he has very little in terms of abilitys that actually do things (because his ult is very powerful, and his W can be extremely OP.)","replies":[{"poster":"Xuven","date":"2016-02-03T17:37:15.217+0000","up_votes":1,"down_votes":0,"body":"Given that it's not a point and click that does % of maximum health, would that not reduce how powerful he is?","replies":[{"poster":"JasonWazza","date":"2016-02-03T17:41:21.816+0000","up_votes":1,"down_votes":0,"body":"Your giving Warwick more CC.\n\nThat will be on a short cooldown.\n\nIt needs to be a rework.","replies":[]}]}]},{"poster":"Xuven","date":"2016-02-03T16:43:59.230+0000","up_votes":1,"down_votes":0,"body":"Would removing his Q being a point and click not fix how boring he is, and also make one of his abilities able to miss? \n\nAlso, how would AP Warwick be broken, can you please elaborate? I'm not suggesting any increase in damage, reduction in cooldown or anything of the sort! Just to change his ability into a skill shot that allows for early game ganks! \n\nI would love to hear both of your criticism elaborated! :)","replies":[]},{"poster":"Banta Claus","date":"2016-02-03T12:29:40.638+0000","up_votes":1,"down_votes":0,"body":"warwick is boring and broken, he should not be strong or even viable until he's fixed, I hear your point about wanting to play him more because he's your favourite, I respect that, he was once also my favourite, but please understand that absolutely no-one wants to play against him.","replies":[]},{"poster":"Manyula","date":"2016-02-03T11:56:02.374+0000","up_votes":1,"down_votes":0,"body":"ap warwick would be broken","replies":[]}]}