{"poster":"ArchangeliLuzifa","date":"2018-02-23T10:44:30.461+0000","title":"silber sub sucht adc für duoq","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Die &Uuml;berschrift erw&auml;hnt ja schon das wichtigste^^\r\n\r\nZu mir:\r\nbin 26, spiele seit keine Ahnung wann, hab aber bisher noch nie wirklich versucht nennenswert besser zu werden. Das Wollte ich nu &auml;ndern und als erste h&auml;tte ich gerne nen langfristen ADC, der bereit ist mit mir gemeinsam besser zu werden. Gegebw&ouml;rtig bin in s2 eingestufft und hab an einer Tour kein Gl&uuml;ck mit den Teams, die waren zwar net immer schuld aber iwer muss ja der S&uuml;ndenbock sein :P Aktiv spiele ich jetzt seit 4 Wochen wieder nach einer halbj&auml;rlichen Pause. \r\nMein liebing als sub ist {{champion:117}} , ansonten spiel ich vorzugsweise tanksups, ab und an auch gerne mal nen rakan wenn sich eine Xaya dazu findet :)\r\nIch flamer nicht und kann flamer auch net leiden. Das macht das Problem nur schlimmer als eh scho.....\r\nIch Unterhalte mich zwar gerne ab und an mal aber geh&ouml;re im eher der stilleren Sorte Mensch an.\r\n\r\nWer noch Fragen hat kann mich jeder Zeit adden {{sticker:sg-soraka}}","replies":[{"poster":"TheAdd0n","date":"2018-02-24T00:21:52.101+0000","up_votes":1,"down_votes":0,"body":"Hey ☺ \nIch spiele seit Season 2 lol und habe jede lane schon mal ne Season gespielt :)\n\nHab nen 3/4 Jahr aus persönlichen Gründen pausiert und habe nun wieder als adc angefangen. \nMeine Champions sind Vayne, Kalista, Jhin, Tristana und Xayah :)\n\nWenn du möchtest können wir mal gerne zusammen zocken 😊 \nBin morgen so ab 17 Uhr online \nUnter TheAdd0n kannst du mich adden \nLG","replies":[]},{"poster":"ATH Phoenix","date":"2018-02-23T14:42:31.421+0000","up_votes":1,"down_votes":0,"body":"Hallo\nDu suchst zwar nach einem Duo- Adc, vielleicht kann ich dich trotzdem für unser Team begeistern.\nAlles was wir brauchen, ist ein Support Main. Ich selbst bin Jungle Main und bin Silber. Unser Team besteht aus Silber-Gold. Dein Adc wäre übrigens Xayah Main und beherrscht alle momentanen Ad Carries.\nWir sind leider alle noch nicht in deiner Altersklasse, jedoch in unserer Ausbildung und reifer als manch anderer. Falls ich dein Interesse erweckt habe kannst du mich gerne Adden\n\nFg Lizard","replies":[]},{"poster":"Archer Shirou","date":"2018-02-23T14:38:42.663+0000","up_votes":1,"down_votes":0,"body":"Hi :))\nBin 27 adc main und auch eher ein ruhigerer mensch. Xayah spiel ich auch gern :D\nHab dir mal ne fa gesendet falls du es heute abend mal probiern willst ^^ bin immer bis max 1 uhr da :) der acc hier war last season s1 und main gold5\nich versuch immer ruhig zu bleiben und surrendere nie, ich würde mich aber gern verbessern und da wäre es doch passend mit einem Support ^^\nich würde mich freun :)\n","replies":[]},{"poster":"ArchangeliLuzifa","date":"2018-02-23T10:45:18.284+0000","up_votes":1,"down_votes":0,"body":"sollte vllt noch dazu sagen das meine Hauptsächlichen aktivitätszeite Normalerweise ab 21 Uhr bis 24 oder 1 Uhr sind :)","replies":[]}]}