{"poster":"VFL H0bb1t","date":"2016-05-17T08:57:06.432+0000","title":"G4/G3 Main ADC sucht Supp","subforum":"Clans & Teams","up_votes":0,"down_votes":0,"body":"Moin Leute, \r\n\r\nMein Name ist Leon bin 16 Jahre alt und bin Main Adc im mittleren Gold Bereich. Suche einen Support mit einem gro&szlig;en Championpool, der guten Humor hat und Bock auf Ranked hat :D \r\nW&uuml;rde mich auf eine R&uuml;ckmeldung freuen.\r\n\r\nMFG Leon","replies":[{"poster":"ΞΩωΩΞ","date":"2016-05-17T13:53:32.497+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nich bin Findus und Supp Main und suche auch nach einen Duoq Partner. Bin zuzeit G4, war vor einigen Tagen noch G1, nachdem ich bemerkte das es schlecht ist soloQ supp zu sein. ^^ Wäre mir eine freude mit dir zu spielen, leider habe ich keine hohe anzahl an ADC champs, aber alle Supporter.\nIch würde auch gerne sehr ernst spielen, um nur hochzuranken. ^^ invite me wenn du mal ernst spielen willst.","replies":[]},{"poster":"unlucky Ieo","date":"2016-05-17T12:08:49.140+0000","up_votes":1,"down_votes":0,"body":"Bin Supp main Gold 4 kannst mich adden wenn du willst","replies":[]},{"poster":"Zhunamih","date":"2016-05-17T11:16:16.308+0000","up_votes":1,"down_votes":0,"body":"Hey kannst mich ja mal adden, bin momentan S3 letzte Season S1 als main supp. Spiele momentan selber viel adc da die meistenn rnd supp`s nichts taugen und als soloqer mit adc mehr erfolg hatte :D","replies":[]},{"poster":"KAPPOBY","date":"2016-05-17T09:31:49.103+0000","up_votes":1,"down_votes":0,"body":"Du hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst.\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Hearthstone, etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/tAy6UKsy-aequilibritas-esports-sucht-mitglieder-community-und-esports-lol-csgo-hearthstone-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]},{"poster":"Kawaaaaaiii","date":"2016-05-17T09:11:22.310+0000","up_votes":1,"down_votes":0,"body":"Huhu bib Silv 5 wenn du Lust hast kannst du dich melden Main supp :D Ehemalig s3 :D","replies":[]}]}