{"poster":"LBmyBB","date":"2016-09-05T16:31:06.466+0000","title":"Does riot give warnings?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I have put a lot of stuff asking about if custom skins is legal, but if I were to use it and it had some kind of stuff that I was unaware it had that riot does not like, will they send me a warning telling me to remove it?  If so, will they do it via email or when you log on?","replies":[{"poster":"Porocles","date":"2016-09-06T21:48:51.912+0000","up_votes":1,"down_votes":0,"body":"League isn't really a venue to experiment, so any competitive advantage over another player would not really be lenient.  We don't support any third party programs or modifications either, so using a skin mod would be at your own risk.  We couldn't provide any technical support or be aware of any bad content hidden within it.  More information our stance can be found through our [guide ](https://support.riotgames.com/hc/en-us/articles/225266848)here.  Be wary and careful!","replies":[{"poster":"LBmyBB","date":"2016-09-06T22:59:24.638+0000","up_votes":1,"down_votes":0,"body":"Ok thanks.  I will just wait until the next lb skin.  but please don't make it victorious cuz i cant get gold in time.","replies":[]}]},{"poster":"hyperion3182","date":"2016-09-06T18:44:30.375+0000","up_votes":1,"down_votes":0,"body":"Hello, this is the official stance at the moment\nhttps://support.riotgames.com/hc/en-us/articles/225266848-Third-Party-Applications\n\n\"We reserve the right to take action against applications that allow the use of our assets for free (often referred to as skin hacks).\"\n\n\"Suspensions for the use of third-party applications can vary in length depending on the severity of the offense, up to a permanent suspension for consistent, blatant use.\"\n\nAlso, you can't be \"unaware\", if you respect the usual security measures, you'll be fine: never ever share the account. be super careful if you share your computer with a relative, be super careful at internet cafes.","replies":[]}]}