{"poster":"SWΣ Paldius","date":"2018-09-24T19:30:09.091+0000","title":"Neue Community und neues Team gesucht","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Moin,\r\nich suche ein Team im High Silber bis High Gold Bereich. Ich habe schon gewisse Erfahrungen in Sachen Community und Teamorganisation etc. War 6 Monate in einer Community bin aber ausgestiegen, da diese nur noch just for fun spielten. Ich war der Teamcapit&auml;n unseres 2. Teams und war dort Main Supporter. Bin zurzeit Silber 1 fast Gold 5. Suche eine aktive Community und ein aktives Team f&uuml;r Tuniere Scrims, m&ouml;chte an der Sinn League auch teilnehmen, feste Trainingszeiten usw.\r\nAu&szlig;erdem bin ich:\r\n- zuverl&auml;ssig\r\n- teamf&auml;hig\r\n- gewisse Erfahrungen\r\n- kann Calls machen\r\n- motiviert\r\n- engagiert\r\n- Viel Zeit\r\n- Sehr gro&szlig;er Championpool\r\n- Anpassung an die Meta\r\n- LCS\r\n- Besitze Ts, Discord\r\n\r\nAddet mich Ingame PaldiusHD.","replies":[{"poster":"Sampl3x","date":"2018-09-25T09:12:32.806+0000","up_votes":1,"down_votes":1,"body":"Hallo, ich Dennis bin 20 Jahre alt und bin wie beschrieben auf der Suche nach einem aktiven 5er flex. Team, dass auch Ziele in der flex q erreichen möchte. \n\nSchon oft hab ich so einen Thread geschrieben leider erfolglos..ich habe keine Lust auf so ein lari fari Team das 1x im Monat spielt oder so. Sondern auf ein aktives Team das auch das ein oder andere Ziel hat in der flex Q! \nIch würde meinen Namen auch sofort ändern wenn es das Team fordert ohne zu zögern! \n\nWichtig ist mir das man spiele analysiert und Kritik ausübt! Das alles aber nach dem Spiel das keiner getiltet ist! Noch dazu bin ich jemand der nie aufgibt sondern für mich ist das Spiel erst verloren wenn der Nexus gefallen ist! \n\nMeine Main Rolle ist ADC könnte aber auch auf die Mitte ausweichen wenn es besser Passen würde. \nAllerdings spiele ich adc am besten und würde schon von vielen so bestätogt. Was die Mitte angeht müsste ich halt ein bischen üben, denke aber das ich das hinbekomme, da ich höher Mitte gespielt habe! \n\nIch habe ein aktives und funktionierendes Headset und könnte über Discord / teamspeak kommunizieren. \n\nZu euch, ihr solltet mind Gold elo sein oder höher. Noch dazu aktiv spielen und Ziele in der flex Q vor Augen haben. \n\nWürde mich freuen wenn es passen würde!","replies":[]}]}