{"poster":"Nightsky Pirate","date":"2019-12-14T10:56:04.889+0000","title":"Riot's Behavior toward Players","subforum":"Player Behavior","up_votes":4,"down_votes":11,"body":"Riot has been increasingly sensitive. They've been trying to eliminate negativity, but have gone at it half-heartedly. Folks in chat are often reluctant to say anything in fear of the verbal ban-bot's vacuity (how dare you flame the NPCs). There is no punishment for intentionally feeding once every few games that you lose. So what's the latest in what might affect Riot's behavior?\n\nHow about paying $10,000,000 to female employees for \"not being included in the bro community,\" eh?\n\n“This settlement is an important step forward and demonstrates our commitment to living up to our values and to making Riot an inclusive environment for the industry’s best talent,” Hixson stated. “As we said back in August when we announced the settlement, we're honoring our commitment to finding the best and most expeditious way for all Rioters, and Riot, to move forward and heal. Over the past year, we've made substantial progress toward evolving our culture and will continue this work as we strive to be the most inclusive company in gaming. Our transformation over the 15 months has been massive and we're just getting started.”\n\nThere's nothing wrong with the women winning this settlement, or that Riot is moving in this direction. The point is that this is likely to make Riot more sensitive in general. This side effect can impact players- namely those who are under the hammer's shadow. Imagine that you're playing any sport and the referee just had his work friend fired because of a similar situation, or was reprimanded for being part of said 'bro culture'. \n\nIf you have any sense, you'd be on your best behavior while being watched by that referee for a while. Since the current, first line referee is a program watching *all your games* with said people behind it... you better act like it. Or, you know, preemptive mute-all.","replies":[{"poster":"Kei143","date":"2019-12-14T13:36:48.140+0000","up_votes":7,"down_votes":0,"body":"The only people that are afraid to use chat are the ones that don't understand the rules. \n\nIf you don't harass and insult others, you can use chat without problems.\n\nAlso, anecdotally speaking,  the people accusing of others for intentional feeding typically have a wrong set of lens put on. As in they falsely accuse others of inting and instead, harass others for it.","replies":[]},{"poster":"DuskDaUmbreon","date":"2019-12-14T12:20:15.226+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Nightsky Pirate,realm=NA,application-id=ZGEFLEUQ,discussion-id=4UZ6OVG6,comment-id=,timestamp=2019-12-14T10:56:04.889+0000)\n>\n> Riot has been increasingly sensitive. \n\n\"Sensitive\" and \"getting rid of people who are jackasses to others\" are not the same thing. And, as far as I'm aware, nothing's changed in the last 4 years.\n\n>They've been trying to eliminate negativity, but have gone at it half-heartedly.\n\nIdk, based on what you say in the rest of the post you seem to say otherwise\n\n>Folks in chat are often reluctant to say anything in fear of the verbal ban-bot's vacuity (how dare you flame the NPCs).\n\nHi. I easily talk the most in every game I'm in. I even flame people now and then, although I generally keep that fairly rare. Not banned, not even a single chat restrict. The only reason you have to be remotely afraid of talking is if you're actually toxic or you're grossly misinformed.\n\n>There is no punishment for intentionally feeding once every few games that you lose.\n\n[X] to doubt. Slow to punish=!Does not punish. Most, if not all, cases of inting require manual review. Given the number of people reported daily for inting because of trivial shit, this takes a long time.\n\n>So what's the latest in what might affect Riot's behavior?\n> \n> How about paying $10,000,000 to female employees for \"not being included in the bro community,\" eh?\n\nI can't actually think of a single thing that's changed since I've started. Certainly nothing in the last few weeks.\n\n> “This settlement is an important step forward and demonstrates our commitment to living up to our values and to making Riot an inclusive environment for the industry’s best talent,” Hixson stated. “As we said back in August when we announced the settlement, we're honoring our commitment to finding the best and most expeditious way for all Rioters, and Riot, to move forward and heal. Over the past year, we've made substantial progress toward evolving our culture and will continue this work as we strive to be the most inclusive company in gaming. Our transformation over the 15 months has been massive and we're just getting started.”\n> \n> There's nothing wrong with the women winning this settlement, or that Riot is moving in this direction. The point is that this is likely to make Riot more sensitive in general. This side effect can impact players- namely those who are under the hammer's shadow. Imagine that you're playing any sport and the referee just had his work friend fired because of a similar situation, or was reprimanded for being part of said 'bro culture'. \n\nI...fail to see the actual correlation. Your argument would maybe make more sense if another friend got fired for not doing his job properly, but, like...It's honestly a shit analogy. And if you're not toxic in the first place, it doesn't matter.","replies":[{"poster":"Nightsky Pirate","date":"2019-12-14T13:02:55.119+0000","up_votes":1,"down_votes":9,"body":"> [{quoted}](name=DuskDaUmbreon,realm=NA,application-id=ZGEFLEUQ,discussion-id=4UZ6OVG6,comment-id=0000,timestamp=2019-12-14T12:20:15.226+0000)\n>\n> \"Sensitive\" and \"getting rid of people who are jackasses to others\" are not the same thing. \n\nDamn straight they're not the same thing. I said nothing about *who* they ban (with the exception of poor Mr. Flamed Dragon), but now that you mention it, yes, they do have bad bans. They're not banning the right people. Not as in the people banned are wrongfully banned, but the REAL jackasses are still playing, some because they know a bot is ultimately in charge of their punishment and most players can avoid punishment by simply not using chat. \n\nInstead, they're backing up the system (as explained later) almost blindly. Not responding to criticism, pretending what they're doing is great. They are behaving as though easily offended, but by their own rules do not show it. This is being sensitive.\n\n> And, as far as I'm aware, nothing's changed in the last 4 years.\n\nYeah, basically, nothing has changed. I hope most wouldn't assert that the punishment system is working as well as what is needed for League. Toxic behavior is abound.\n \n> Hi. I easily talk the most in every game I'm in...\n\nHow many times do you get total silence from other players? 30 seconds to walk back to lane, and rarely does it get used to communicate- and often, when it is, it's got a toxic tint to it. I too talk in most of my games and haven't been chat restricted, but many players maintain silence. It's especially hard to maintain positivity when *nobody responds at all*. Sure, nobody is required to chat...\n \n> [X] to doubt. Slow to punish=!Does not punish. Most, if not all, cases of inting require manual review. Given the number of people reported daily for inting because of trivial shit, this takes a long time.\n\nDoubt accepted. Riot's mechanic takes into consideration the last 20 games played, and if a significant number (5? Possibly different for different types of reports) don't have the same kind of report, the older reports amount to nothing. So if you don't int when you win, and int at least less than half the time you lose, you will probably be under the radar. Not going to test that, but that's my understanding of the prime fundamental mechanic of the punishment bot's metrics.\n\nThe bot also evaluates inting. Did you know the League-hired guys with PhDs who were collaborating about player behavior back in the days of the Tribunal created a program... “It turns out that if you use the dictionaries, you can predict if a player will show bad behavior with up to 80 percent accuracy from just one game’s chat log,” Someone pushed the bot too far.\n\nManual reviews are a thing of the past, only ticketed items get a human to even consider looking at them. Even then, a cut-and-paste response is par- basically, the par answer is \"The bot was not wrong.\" I haven't seen a case that didn't involve extreme situations such as hacking in which the bot was overturned.\n\n> I...fail to see the actual correlation. Your argument would maybe make more sense if another friend got fired for not doing his job properly, but, like...It's honestly a shit analogy. And if you're not toxic in the first place, it doesn't matter.\n\nFirst, the quote was to show I'm not performing smoke and mirrors. Second, is to demonstrate how exactly this event would cause increased strain- and sensitivity- among the workers at Riot. **It openly states that the old culture within Riot is being dismantled and replaced.**","replies":[{"poster":"Imperial Pandaa","date":"2019-12-14T14:48:55.863+0000","up_votes":6,"down_votes":0,"body":"The guy who posted that they were punished for flaming dragon has admitted it was a fake post/punishment for laughs.","replies":[{"poster":"Nightsky Pirate","date":"2019-12-14T17:01:15.485+0000","up_votes":1,"down_votes":2,"body":"Good to know, thanks.","replies":[]}]}]}]},{"poster":"rastarogue","date":"2019-12-14T15:31:59.287+0000","up_votes":3,"down_votes":0,"body":"You're argument seems to be \" riot is becoming less of an asshole to women, so they'll be more agressive in punishing people\", which is not directly correlated or supported and it seems like you would rather they stay jerks to women so that people can be jerks in chat?\n\nIt's not very clear what you are trying to say","replies":[{"poster":"Nightsky Pirate","date":"2019-12-14T17:00:30.014+0000","up_votes":1,"down_votes":2,"body":"Whoa, no. I figured saying \"nothing wrong with women winning the settlement or Riot moving in direction\" would clear that up. Shifts in culture will inevitably result in some pains, regardless of how good or necessary it is.\n\nMy thought is that this shift in culture will contribute toward harsher, more strict adherence to the already inflexible rules. There is some grace in the fact that most cases do not punish for single games.","replies":[{"poster":"rastarogue","date":"2019-12-14T17:40:22.878+0000","up_votes":2,"down_votes":0,"body":"I guess I don't see what the problem is with making people follow the rules.\n\nI also don't get the connection between the settlement and greater enforcement of the rules, like that seems like a huge leap to me. If be happy to see it happen, but I don't think it will.","replies":[]}]}]}]}