{"poster":"Avalon Bright","date":"2014-12-09T21:49:52.391+0000","title":"Riot, as an Ahri main, I beg you... PLEASE... please rethink this new skin's design.","subforum":"[ARCHIVED] General Discussion","up_votes":31,"down_votes":77,"body":"I never though I'd have to say this about an Ahri skin, but the instant I saw the model I literally recoiled from the monitor a few instants. I have said time, and time, and TIME AGAIN to please, PLEASE stop with the stupid headgear on female Champions. Ever since the Syndra/Diana/Nami/Elise era every female champ you've put out has been stuck into some silly helmet, except Jinx. At best we've had forced helmets like Quinn and Kalista, at WORST we've got idiotic blinding gear like Justicar and Atlantean Syndra *both*, everything on Lissandra, the list goes on, and on, *and on*. For literal years now I've been begging you to *cut.* It. Out.*\n\nBut now Ahri. I came home from the store to see a friend saying \"Hey there's a new Ahri skin!\" and has someone who has mained her, without fail, through every nerf since her release, I actually squealed. I rushed to S@20. And I was crushed. Okay, the suit in general... Meh. It's a little Crimson Elite-y and she looks like she's wearing freaking WoW shoulder armor, but I can work with it for Ahri. But what on *earth* did you slap onto her face?!\n\nPlease, Riot, as an Ahri main I beg you. Take off the dumb headgear. She looks cute with the ponytail, and that's *enough*. What is your art team's obsession with stupid looking helmets?! Especially on champions that have no reason to even have them slapped on!? \n\nYou removed Dark Valkyrie Diana's helmet for worse reasons than this. Now do it for Ahri too. Please. I will pay Legendary skin prices for this skin if you just remove the headgear. That's all it takes. Besides, I've already been pleading for Heartbreaker Ahri to come out on Valentine's Day and yet the perfect champ in your entire roster for a Valentine's skin continues to get ignored. :\\","replies":[]}