{"poster":"Jocrem","date":"2019-05-30T19:56:56.281+0000","title":"Campeones para carrear o ser OTP en Solo Q JG","subforum":"Guias y consejos","up_votes":4,"down_votes":1,"body":"hola espero que me ayuden y me digan porque de cada campion Gracias Compañeros","replies":[{"poster":"Im done","date":"2019-05-31T02:37:32.101+0000","up_votes":1,"down_votes":0,"body":"Mira, es muy complicado el tema del OTP, te lo digo como OTP que soy. \nHay días en los que te sale todo absolutamente bien,  y otros en los que te queres matar y sentis que te falta piiiiiiila para aprender de tu campeón. Días en los que todo te male sal. El punto es que te guste, que sientas que es el champ que está hecho para vos, o que se aproxime lo mayor posible a ello, al punto de que solo quieras spammearlo, aprender tanto como te sea posible e ir subiendo en el trayecto.\n\nA mi en lo personal me fascina Kayn como personaje y a la hora de jugarlo. Más en particular Rhaast por su lore, y como es como personaje en todos los aspectos (personalidad, diseño, jugabilidad, etc). \n\nSi tuviera que recomendarte champs, te recomendaría los siguientes: {{champion:141}} {{champion:59}} {{champion:28}} {{champion:120}} {{champion:254}} \n\nSon versátiles, tenes buen control de objetivos, un early medianamente bueno con cualquiera de ellos (Kayn y Eve son un poco más débiles en early), buenos gap closers y efectos de control. Por ende ganks rápidos, y si los ejecutas bien desde el principio, casi siempre eficientes. \n\nEn fin, espero que tengas mucha suerte eligiendo a tu campeón y que aprendas y subas rápido.\nAunque ciertamente estoy convencido de que el campeón lo elige a uno, y no al revés.","replies":[]},{"poster":"POETA DEL RAYO","date":"2019-05-30T23:13:32.473+0000","up_votes":1,"down_votes":0,"body":"Conozco un champ que se adapta a cualquier team y composición, te aseguro que es muy divertido de jugar y además esta rotisimo, te garantizo que vas a empezar a ganar partidas como si fuera contra bots principiantes, por supuesto es el legendario {{champion:17}}\n\n\nVos entras a jugar ranked, muteas y es gg \n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Im done","date":"2019-05-31T00:15:30.432+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=POETA DEL RAYO,realm=LAS,application-id=8sKIclmi,discussion-id=gnRGpx68,comment-id=0004,timestamp=2019-05-30T23:13:32.473+0000)\n>\n> Conozco un champ que se adapta a cualquier team y composición, te aseguro que es muy divertido de jugar y además esta rotisimo, te garantizo que vas a empezar a ganar partidas como si fuera contra bots principiantes, por supuesto es el legendario {{champion:17}}\n> \n> \n> Vos entras a jugar ranked, muteas y es gg \n> \n> {{sticker:slayer-pantheon-popcorn}}\n\nJajajaja, estallé con este comentario. Estúpido y sensual Teemo {{champion:17}}","replies":[]}]},{"poster":"Doctor Rata","date":"2019-05-30T22:26:59.675+0000","up_votes":1,"down_votes":0,"body":"{{champion:141}} si aprendes a usarlo bien, podes hacer la jungla sin ayuda y robar un buffo enemigo en el trayecto, ademas de que podes cambiar tu roll en el equipo como asesino, tank y off tank.\nTambién podes usarlo mid y top si no te toca jg, es de los campeones de los mas escurridizos en cualquiera de las 2 transformaciones.","replies":[]},{"poster":"Torrez157","date":"2019-05-30T21:01:21.409+0000","up_votes":1,"down_votes":0,"body":"Nidalee, Elise","replies":[{"poster":"Saditst","date":"2019-05-30T21:48:22.682+0000","up_votes":1,"down_votes":0,"body":"esos dos están muy bien con el bufo al item de jg y le sumaria reksai, lee sin, rengar y k6 ,no se como este karthus después del nerf ni gragas después del buff pero habría q ver. Kayn tambien puede ser.","replies":[{"poster":"Doctor Rata","date":"2019-05-30T22:22:54.013+0000","up_votes":1,"down_votes":0,"body":"Sigue bastante fuerte Karthus, le bajaron el daño de la ulti pero sigue siendo un buen pick.","replies":[]}]}]},{"poster":"Thotiana","date":"2019-05-30T20:01:40.318+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Jocrem","date":"2019-05-30T20:19:56.270+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=DenialofDeath,realm=LAS,application-id=8sKIclmi,discussion-id=gnRGpx68,comment-id=0000,timestamp=2019-05-30T20:01:40.318+0000)\n>\n> uno que no te canses de usar, que sea divertido para vos. no hay una lista objetiva, depende de vos y de nadie mas. vos solo vas a tener que encontrar tu OTP\n\nPero necesito una idea","replies":[{"poster":"Danimilz","date":"2019-05-30T21:34:53.937+0000","up_votes":1,"down_votes":0,"body":"Adhiero lo que dijo el invocador, tenés que buscar el champ que se adapte a tu estilo de juego y te guste usarlo.\n\nOTP hay de todos los champ.\nPreguntate que estilo/rol te gusta jugar? En la jungla tenés asesinos, tanque, etc, AP/AD vas probando distintos hasta encontrar tu favorito y que se adapte a lo que buscas","replies":[]}]}]},{"poster":"IanCapo","date":"2019-05-30T20:54:38.069+0000","up_votes":1,"down_votes":0,"body":"A mi me gusta mucho graves con cosecha oscura.","replies":[]}]}