{"poster":"ShindaAkuma","date":"2015-07-11T10:30:25.236+0000","title":"Suche Leute für ein Ranked Team :) (Silber->Gold->Platin)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo, ich suche Leute f&uuml;r ein 5vs5 Ranked Team und w&uuml;rde mich freuen wenn sich ein paar leute melden.\r\nDas Team kann aus Silber-&gt;Platin bestehen ich sch&auml;tze das sollte so okay sein und es sollte Teamspeak vorhanden sein.\r\nBei interesse schreibt einfach eine kleine Bewerbung hier drunter und am ende werde ich mir ein paar leute aussuchen die wir an einem Tag testen.\r\nIn der Bewerbung solltet ihr euch einigerma&szlig;en vorstellen d.h. Elo, Alter, Geschlecht, Lane und co umso ausf&uuml;hrlicher umso sch&ouml;ner ich denke aber ihr wisst schon wie das gehen sollte ^^&quot; also dann wie gesagt ich w&uuml;rde mich sehr freuen wenn sich ein paar melden. :)","replies":[{"poster":"Sennin Hagomoro","date":"2015-07-16T18:47:12.273+0000","up_votes":1,"down_votes":0,"body":"Hey\nIch heiße Manuel und bin 18 Jahre alt. Ich bin main jungle und zurzeit Gold V. Ich würde gerne bei deinem Ranked Team mitmachen, wenn Ihr noch einen Jungler sucht. Bei Interesse einfach IG adden.\nMFG Manuel aka DonBendra","replies":[]},{"poster":"Let me sleeeeeep","date":"2015-07-16T15:04:38.516+0000","up_votes":1,"down_votes":0,"body":"Mein Name ist Marvin bin 14 Jahre alter bin zurzeit Gold V meine mains sind Top und Jungle adde MarvinXDXD ^^","replies":[]},{"poster":"Alcazahr","date":"2015-07-12T10:17:22.586+0000","up_votes":1,"down_votes":0,"body":"Hey :) \n\nMein Name ist Nico, bin 16Jahre alt bin Platin V bin main Mid lane (cassiopeia xerath varus) bin aber eigentlich ein Allrounder^^\nTS und Skype ist vorhanden.\nLG Niggo :DD","replies":[]},{"poster":"xThanatorx","date":"2015-07-12T09:50:56.449+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\neventuell hast du Interesse an unserer Community die sich im Aufbau befindet.\nSchau einfach mal hier [> VoW < ](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/HvZUE6yz-vikings-of-war-zocker-aus-leidenschaft)vorbei!","replies":[]},{"poster":"MrHunter98","date":"2015-07-11T20:02:31.568+0000","up_votes":1,"down_votes":0,"body":"Heyyy\nIch heiße lukas und bin in silver 1.\nIch maine mid( yasuo, zed, cassio, azir).\nSpiele aber auch gerne adc(twitch).\nKann aber eigendlich jede rolle\n\nTeamspeak müsste ich noch runterladen.\n\nFreueich auf Rückmeldung","replies":[]},{"poster":"int is improve","date":"2015-07-11T16:41:11.958+0000","up_votes":1,"down_votes":0,"body":"Moin,\nhab mir den Text durchgelesen und hat meine Interesse geweckt ^^\nErstmal was zu mir: Heiße Marc, bin 16 Jahre alt und maine ADC derzeit gold 5.\nTeamranked hab ich immer nur reingeschnuppert weil entweder niemand von meinen Freunden wirklich lange Lust hat auf LoL oder die Teams nach dem ersten loose auseinander Gebrochen sind, deswegen suche ich immer weiter nach einem Team. :D\n\n1. Meine Mains sind: {{champion:429}} {{champion:22}} {{champion:104}} {{champion:222}} {{champion:15}} {{champion:236}} \nAnordnung spielt keine Rolle ;D\nMein Spielstil ist mega Safe aber manchmal zu Safe, bin sehr Selbstkritisch und achte eigentlich mehr auf mich als auf alles andere.\n\nHeadset + TS3 vorhanden und mein Headset kann man sich geben. \nAnsonsten joar würde ich mich Freuen über ne gute Rückmeldung ;)\n\nluckYYz","replies":[{"poster":"ShindaAkuma","date":"2015-07-11T16:46:31.974+0000","up_votes":1,"down_votes":0,"body":"Jo ich hab dich mal geaddet und dann klären wir das da weiter und testen mal deine sehr passive Spielart und gucken ob wir gut kooperieren","replies":[]}]},{"poster":"WhereDidYourHpGo","date":"2015-07-11T15:56:06.136+0000","up_votes":1,"down_votes":0,"body":"Hey ,\nich interessiere mich ebenfalls für das Team.\nZu mir : Ich heiße Luke (geschlecht sollte klar sein) bin 19 Jahre und maine Top/Mid  spiele derzeit in Platin 2.\nIch habe schon einige Erfahrungen sammeln können und beherrsche auch die meisten TeamRanked Taktiken (Laneswap...).\nFreue mich auf eine Rückmeldung :)","replies":[]},{"poster":"Dru8urz","date":"2015-07-11T12:53:20.094+0000","up_votes":1,"down_votes":0,"body":"Hallöchen,\nich heisse jules und bin silber 3,\nmeine Mainrollen sind jungle und support, zur not noch adc.\nAls supp kann ich janna, morgana, blitz, leona, braum und ich versuche mich gerade an tresh.\nIm Jungle spiele ich am liebsten Lee, ich kann aber auch udyr, vi, kayle, nida, eve, shen... ( und noch ein paar)\nMein spielstil ist ein bisschen greedy, objectivefokussiert und agressiv.\nMein headset is müll(man versteht mich aber).\nWürde mich über eine antwort freuen :-D","replies":[]},{"poster":"Taki","date":"2015-07-11T10:52:21.766+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nMein Name ist Florian, ich bin 17 Jahre alt und aktuell Gold 4.\nIch bin in der Lage alle Positionen zu spielen, jedoch würde ich mich freuen, den Jungle oder die Mitte spielen zu dürfen.\nIch hoffe auf eine Antwort von dir und noch einen schönen Tag.\n\nmfg Flo","replies":[{"poster":"ShindaAkuma","date":"2015-07-11T11:12:09.982+0000","up_votes":1,"down_votes":0,"body":"Joa wie gesagt adde mich einfach so wie die anderen und dann können wir einen Termin ausmachen bzw du sagst wann du Zeit hast","replies":[]}]},{"poster":"Adrían","date":"2015-07-11T11:03:15.091+0000","up_votes":1,"down_votes":0,"body":"Hi,\n\nIch heiße Adrian, bin 15 Jahre alt, adc main und Platin 5. Ich würde gerne mal ein Probegame mitmachen^^ und ja hau rein :D\n\nmfg Adrian","replies":[{"poster":"ShindaAkuma","date":"2015-07-11T11:09:55.959+0000","up_votes":1,"down_votes":0,"body":"Joa wann hättest du denn Zeit für ein Probegame? Kannst mich ja einfach in LoL adden","replies":[]}]},{"poster":"TDA Infamous","date":"2015-07-11T10:58:10.527+0000","up_votes":1,"down_votes":0,"body":"Moin, ich in Silas (16 Jahre) bin main lane Jungle{{summoner:11}} {{champion:79}} {{champion:64}}  spiele aber auch top {{summoner:12}} {{champion:57}} {{champion:120}} .\nTs³ ist vorhanden habe zur Zet ein recht kaputtes/empfindliches Headset werde aber bald ein neues kaufen.\nBin Gold 5 und war letzte Season ebenfalls Gold.\nAllerdings würde ich am liebsten mit l am Arrow zusammen spielen, da es immer schön ist jemanden im Team zuhaben den man persönlich kennt :D.","replies":[{"poster":"ShindaAkuma","date":"2015-07-11T11:09:13.193+0000","up_votes":1,"down_votes":0,"body":"Ich werde meine entscheidung noch nicht sooo früh fallen aber ich schätze mal es sieht ganz gut aus :) wann hättet ihr denn Zeit für ein Probespiel?","replies":[]}]},{"poster":"KFD Exiled Light","date":"2015-07-11T10:58:48.919+0000","up_votes":1,"down_votes":0,"body":"Hi Ich bin Arrow aka Kevin/Kev ich bin 16 Jahre jung und spiele seit 2,5 Jahren Adc. Meine Main Champions auf dieser Postion sind {{champion:67}} {{champion:429}} {{champion:15}} {{champion:29}} Ich befinde mich zurzeit in Platin 5 und habe die letzte Season mit Gold keine Ahnung was abgeschlossen. Sollte es mit der Adc Rolle nichts werde kann ich immer noch Mid Lane spielen welche ich auch 1 ganzes Jahr gemaint habe. dort sind meine Mains {{champion:103}} {{champion:131}} {{champion:127}} {{champion:157}} {{champion:69}} {{champion:30}} . Ich würde bei Aufnahme in das Teams darum bitten TDA Infamous mit rein zunehmen da ich diesen seit dem ich LoL spiele kenne und mit ihm schon Zahlreiche Erfolge einfahren. Ts3 ist natürlich vorhanden hätte sogar einen eigenen Server.","replies":[]},{"poster":"ManuGPPLP","date":"2015-07-11T10:37:27.240+0000","up_votes":1,"down_votes":0,"body":"Ich bin Manu/Manuel bin 12 Jahre alt und würde gerne mit machen meine beste Rolle ist Support \"{{champion:412}} \"aber ich würde gerne ADC \"{{champion:67}} \" oder Jungle \"{{champion:64}} \" spielen.Ich bin aber nicht so unbedingt ein \"kiddy\" wie es jeder nennt.Jeder war ja mal klein und mir ist es recht egal wie mich die Leute nennen.Auf jeden fall ich habe auch nicht das beste Headset aber ich meine man kann mich verstehen.Ich bin männlich wie es man auch im Namen sieht.Und ich bin Silber 1 aber ich will nicht mehr als Gold immer werden wegen den Skins usw.","replies":[]}]}