{"poster":"GL ToxicUnicorn","date":"2017-09-28T19:57:08.620+0000","title":"GIGANTIC League e-Sports sucht nette Mädchen und Jungs, Frauen und Männer, halt Clanmitglieder!","subforum":"Clans & Teams","embed":{"description":"Our clan website at Clansweb, the new home for clans, guilds and gamers.","url":"http://gigantic-league.de","image":"http://uassets.clans-cdn.de/clans/2014782/logo_1500310301_s.png"},"up_votes":38,"down_votes":9,"body":"_**Hey Hey League Freunde und Fanatiker,**_\r\n\r\nWir von dem Clan GIGANTIC League e-Sports sind auf der suche nach gleichgesinnten.\r\n\r\nErstmal was zu uns:\r\nGIGANTIC League ist ein Clan wo du auf verschiedene Spieler triffst, bei uns ist es egal welche Elo du hast, ob du nun Bronze oder Challenger bist es sind bei uns alles Menschen.\r\nWir achten nicht auf deine Elo, dein LVL oder sonstiges, wir sind offen gegen&uuml;ber jedem LoL Spieler, da bei uns auf dem Teamspeak und in den Spielen ausschlie&szlig;lich Deutsch gesprochen wird suchen wir nat&uuml;rlich auch Deutschsprachige Spieler.\r\nBei uns kannst du also auch schon mit LVL 1 eintreten und mit uns spielen, wir helfen wo wir k&ouml;nnen auch ein wenig mit, die Spielerfahrung musst du aber dennoch selbst sammeln.\r\nWir legen generell ganz viel Wert auf Spieler die nicht hart flamen, hei&szlig;t wenn jemand nicht so gut ist wie du oder auch umgekehrt wird nicht geflamt, sondern trotzdem harmonisch mit einander umgegangen, mit harmonischem Umgang meine ich nicht das wir nicht lachen oder auch Sp&auml;&szlig;e machen.\r\n\r\nWir legen sehr viel Wert auf Spa&szlig; :)\r\n\r\n_**ACHTUNG: WIR BIETEN EUCH NUN EINEN GASTBEREICH, DER VON EUCH KOSTENLOS GENUTZT WERDEN KANN UM LEAGUE ZU SPIELEN OHNE IN DER COMMUNITY ZU SEIN!**_\r\n\r\n_**Vorraussetzungen:**_\r\n\r\nFreundlich\r\nSpa&szlig;suchend\r\nKein absichtliches Feeding\r\nElo - Egal\r\nLVL - Egal\r\nTeamspeak 3 Nutzer\r\n\r\n_**Was bieten wir dir:**_\r\n\r\nEine ordentlich laufende Community \r\nDie Chance neue Leute kennenzulernen die LoL und andere Spiele spielen\r\nTeamcoachings (Freiwillg)\r\nClansitzungen jeden Monat zur Kommunikation f&uuml;r alle LoL Spieler (Damit die Stimmung gut bleibt und ihr euch auch mal Luft verschaffen k&ouml;nnt)\r\nRanked Teams aber auch Teams die nur zum Spa&szlig; spielen\r\nWir haben nun einen Teamkoordinator und werden auch an Turnieren teilnehmen wollen mit unseren Teams das hei&szlig;t ihr werdet bei der Teamsuche nicht im Stich gelassen. Ebenfalls bieten wir wenn gen&uuml;gend Teams vorhanden sind eine eigene Interne Liga an.\r\nEinen Namen der in der Community immer weiter w&auml;chst.\r\nZielstrebigkeit\r\nMusik f&uuml;r Langeweile und gute Laune\r\n\r\nWenn du jetzt Interesse hast schreibst du mir entweder hier im Forum, oder kommst auf unser TS.\r\nFalls du auf unser TS kommen solltest dann bitte mit einen LoL|Dein Nickname damit wir dich zuordnen k&ouml;nnen.\r\n\r\n_**Unsere TS IP: 178.32.119.139**_\r\n\r\n\r\nDu kannst uns am besten im Teamspeak erreichen, schau doch einfach mal zwischendurch rein ob Scouts oder Mods da sind wenn ja, wirst du nat&uuml;rlich so schnell wie M&ouml;glich aufgenommen.\r\nVon 14 - 00 Uhr ist eigentlich fast immer jemand da um euch aufzunehmen, solltest du keinen Antreffen kannst du auf unserer Website http://gigantic-league.de das Aufnahmeformular ausf&uuml;llen, wir setzen uns dann mit dir in Verbindung :)\r\n\r\nLiebe Gr&uuml;&szlig;e","replies":[{"poster":"GL Droppii","date":"2017-10-03T18:44:31.592+0000","up_votes":1,"down_votes":0,"body":"Push wir nehmen euch gerne bei uns auf ;-)","replies":[]},{"poster":"Shinichi Kúdó","date":"2017-09-29T15:29:23.975+0000","up_votes":1,"down_votes":0,"body":"Ich würde gern zu eurem Team dazu gehören bin in LOL zu erreichen unten dem IGN: SKT T1 Raquan","replies":[]}]}