{"poster":"Kalkiru","date":"2014-11-21T23:56:53.441+0000","title":"Cheers for the new jungle riot.","subforum":"Miscellaneous","up_votes":5,"down_votes":2,"body":"So, I was sceptical when I saw the changes you guys were going to implement and truth be told I haven't tested them too extensively just yet, but by changing the jungles combat values and giving rewards/incentives and late game power to jungle items you have inadvertently made one of my favourite champions strong in the jungle again. That champion is {{champion:131}} , originally diana always had decent sustain due to having an offensive ability with a defensive aspect to it (pale cascade). However, sustain in the old jungle meant little and despite her passive, diana 's early duelling was nothing compared to lee sin and others. Add to this that her ganks were a  little lack luster until she hit six and there was little reason to pick her.\r\n\r\nFast-forward to now and all that changes, di's clear was always good, AoE helps in jungle a lot and now due to the stronger camps, her ability to use pale cascade to sustain is much more valuable, she may not have the best sustain in the world and she still takes damage, but add in the new jung items and she can cope pretty well. \r\n\r\nYou get the {{item:3713}}  and you can farm pretty well, almost too well. Get the {{item:3715}}  and you have a way to stand toe to toe with someone trying to invade your shit (that 20% damage reduction, seriously). If you happen be daring you can buy the {{item:3706}}  and get off some sick ganks, past six these can be pretty lethal. Then there's the magus enchantment, 20% CDR and 80AP?, riotpls.\r\n\r\nObviously, it is still early days and much of the jungle will be figured out within the coming weeks and there will likely be changes, but as far as I can see, one of my fave picks is now just as viable as anyone else and there is real decision making to be had in both jungle routes/paths and in the jungle items you intend to build, and even these can change on a game to game basis. So cheers riot, this is quite possibly going to be my favourite season out of all of them.","replies":[{"poster":"Nature","date":"2014-11-22T05:27:21.013+0000","up_votes":2,"down_votes":0,"body":"tldr {{champion:6}}  to be kidding me","replies":[]},{"poster":"P1 GTR","date":"2014-11-22T05:18:21.073+0000","up_votes":1,"down_votes":1,"body":"Now some Junglers can 1v1 red buff without any leash :D\nhowever I had my first game jungling and thought I needed a leash but bot and mid didn't help until half way which was when I realized I didn't need a leash, however annie came and did 1 aa on the red buff and took it :p, ever since then I didn't talk in chat, got d/c'd half way falling even more behind than the enemy Lee Sin and ended up carrying the game with an Underdog Lee Sin Quadra Kill :D","replies":[{"poster":"Silver5aruman","date":"2014-11-22T06:13:11.802+0000","up_votes":1,"down_votes":0,"body":"Now some junglers can 1v1 red without a leash? What? The jungle is way tougher now.","replies":[{"poster":"KingDinger","date":"2014-11-22T08:02:38.681+0000","up_votes":1,"down_votes":0,"body":"> Now some junglers can 1v1 red without a leash? What? The jungle is way tougher now.\n\nmost get a leash on the krugs or gromp. the buffs themselves arent much harder to beat. and anything could 1 vs 1 red and blue last season....so being able to 1 vs 1 the buff with the lower HP and the heal based off max HP with smite...kind of sounds right.","replies":[{"poster":"rly","date":"2014-11-22T10:19:10.268+0000","up_votes":1,"down_votes":0,"body":"Yeah this is right... if you save smite till red is low (under 390 HP @ level 1 smite) you get a fair bit of health back (heal % based on your % missing I believe), same goes with blue and mana. \n\nAlso - if you're giving blue or red to your mid/adc and you smite it early for them, you still get the health/mana boost ^_^","replies":[{"poster":"KingDinger","date":"2014-11-23T07:02:14.500+0000","up_votes":1,"down_votes":0,"body":"> Yeah this is right... if you save smite till red is low (under 390 HP @ level 1 smite) you get a fair bit of health back (heal % based on your % missing I believe), same goes with blue and mana. \n> \n> Also - if you're giving blue or red to your mid/adc and you smite it early for them, you still get the health/mana boost ^_^\n\nthe red health from smite is flat % of max health, so smite it any time for same health back. BUT it is smarter to smite to kill because you wont TAKE more damage.\nsame for blue with mana return.\nits the rangers smite that gives % missing, so smiting to finish is the best option there, as its when you are at your lowest. smite red with rangers at 10% HP remaining can bring you up to near 50%...lel","replies":[{"poster":"VerlorenLore","date":"2014-11-25T06:58:46.237+0000","up_votes":1,"down_votes":0,"body":"But Isn't killing Blue with a smite for the mana return kind of irrelevant? I mean if you do kill it you're gonna regen the mana back up anyway.","replies":[{"poster":"KingDinger","date":"2014-11-30T04:06:42.333+0000","up_votes":1,"down_votes":0,"body":"did i say you should do it with the blue? nope...\n\ni said for red, for best health sustain.\n\nsmite blue when donating for mana sustain tho, hell good on junglers who dont necessarily need blue, but still use mana a lot. like kha.\n\nin order of usefulness overall for the buffs from smiting, wraiths #1 by a long long long shot. golems and krug equal value when jungling, minor value when pushing, useless teamfighting. red, great for sustain. wolves and blue basically useless. wolves ONLY while in enemy jungle. or if constantly invaded. but still useless.","replies":[]}]}]}]}]}]}]},{"poster":"KingDinger","date":"2014-11-23T07:03:14.311+0000","up_votes":1,"down_votes":0,"body":"oh and never waste smite on a buff you are donating. unless you need the health or mana. save smite for wraiths, if wraiths arent up or you are going to base, THEN smite something else.","replies":[]}]}