{"poster":"Rìsotto Nero","date":"2017-01-13T02:22:55.598+0000","title":"Mi Hermano Menor  Flameo a Barbakahn y fue banneado por sus seguidores ( Justo y Injuto )","subforum":"Off-topic y temas personales","up_votes":4,"down_votes":15,"body":"Mi hermano Fue banneado junto a 1 persona mas por acciones de barbakanh, Resulta que barba estaba jugando como 800 a 1000 ms, y se reconectaba y conectaba cada rato, mi hermanito dice que el Top enemigo al estar solo tiro las 2 torres ya al minuto 11, y el jungla de mi hermano Mas el intenso ambiente de caos, malas actitudes y insultos hacia barba, perdieron al minuto 18, mi hermano dijo que el barba nunca flameo, osea conosco como es la actitud buena (No insulta en el chat sino hablando para nosotros) en sus video pero nose si fuera de youtube es lo mismo.\r\n\r\n Mi hermanito caso contrario, el tontito de mi hermano flameo a mas no poder a barbakanh por lo que pasaba, encima por el /ALL, osea que como 8 jugadores reportaron a mi hermanito, ya venia antes flameando en otras partidas, asi que creo que su ban es justo y eso que le dije pero el no me hace caso y le dije que se jodiera, nose si el barba lo reporto o no pero creo por ser barbakanh los enemigo del bando contrario reporto a mi hermanito.\r\n\r\npara que quede en claro ejemplo si se mareraron les tiro este ejemplo: Vegeta777 tiene lag en minecraft, y una persona lo insulta porque no ayuda en el equipo por ausente por /ALL, y los seguidores de vegeta777,(_Los twitch_) saltan a defenderlo por ser vegeta777 original no fake ... \r\n\r\nla cosa es que esta bien banneado el tontito de mi hermano pero, tambien por ser Barbakahn los seguidores lo defienden como diciendo... No te metas con el o alta envidia le tenes por eso lo insultas. si no me creen esta bien, estan en su derechos, bueno bye","replies":[{"poster":"Forero","date":"2017-01-13T02:26:48.516+0000","up_votes":9,"down_votes":0,"body":"Si insultas a quien sea hay riesgo de ban, es indiferente a quien. \n\n-_-\n\n_**Hao si bu ru lai huo zhe**_","replies":[{"poster":"Rìsotto Nero","date":"2017-01-13T02:34:00.994+0000","up_votes":1,"down_votes":1,"body":"> _ya venia antes flameando en otras partidas, asi que creo que su ban es justo y eso que le dije pero el no me hace caso y le dije que se jodiera_\n\nsi ya sabia que venia ya reportado antes, lo mejor es que ahora como no tiene cuenta y se fue enojado, la compu puede ser solo mia B)","replies":[]}]},{"poster":"Pollos Hnos","date":"2017-01-13T03:13:44.164+0000","up_votes":3,"down_votes":0,"body":"Tu hermano flameo intensamente y lo peor es que expusiste que con anterioridad ha flameado con intensidad, considerando el grado de flameo que tuvo en su última partida, llegó a la conclusión de que es un tóxico increible, merecido ban, que la partida que lo hayan baneado sea justo con barbakhan es una casualidad. A llorar al campito salu6","replies":[]},{"poster":"Tamer 01","date":"2017-01-13T02:25:54.909+0000","up_votes":3,"down_votes":0,"body":"si pero tambien es culpa de barba se manda a jugar a 700 y 1000 ms","replies":[{"poster":"Chisolin","date":"2017-01-13T02:29:51.470+0000","up_votes":1,"down_votes":0,"body":"Y así hay muchísima gente, de vez en cuando me cruzo alguno que nisiquiera terminaron de aparecer los campeones en la fuente y ya estan pingeando que tienen 200ms+\nNunca voy a entender porque juegan asi, es como si dijeran \"oh tengo lag, vamos a jugar al LoL asi le rompo las bolas a otras personas\"","replies":[{"poster":"PurpleHaze13","date":"2017-01-13T02:45:41.747+0000","up_votes":1,"down_votes":0,"body":"El lag en algunos casos es totalmente aleatorio. yo no juego hace bastante por problemas de lag que nunca tuve en mi vida. Siempre jugue con 35ms y de golpe desde Diciembre ando con mas de 500 de lag en todas las partidas y una random que tengo los 35ms de siempre..\n\n Por eso decidi dejar de jugar, ademas entre fibertel y los servers de riot se estan echando la culpa asique decidi no jugar","replies":[]}]}]},{"poster":"Warwiick","date":"2017-10-01T22:13:18.419+0000","up_votes":2,"down_votes":0,"body":"tu hermano era infiltrado de shiot :v","replies":[]},{"poster":"Rìsotto Nero","date":"2017-01-13T02:30:17.251+0000","up_votes":1,"down_votes":1,"body":"Nose porque mi post tiene dislikes jaja, si yo no hice nada, solo les estoy contando, seran los seguidores de barba ahora me atacan ami :P","replies":[{"poster":"Mugman Rojo","date":"2017-01-13T02:33:39.323+0000","up_votes":2,"down_votes":0,"body":"\"dislikes\" ulala señor frances.","replies":[{"poster":"Rìsotto Nero","date":"2017-01-13T02:35:36.480+0000","up_votes":2,"down_votes":0,"body":"entonses como se dice? :P","replies":[{"poster":"Mugman Rojo","date":"2017-01-13T03:42:52.432+0000","up_votes":2,"down_votes":1,"body":"menos uan :v","replies":[{"poster":"UlisesFaster","date":"2017-09-18T02:15:33.916+0000","up_votes":2,"down_votes":0,"body":"u la la señor mejimono","replies":[]}]}]}]},{"poster":"Chisolin","date":"2017-01-13T02:34:21.333+0000","up_votes":1,"down_votes":0,"body":"Por que sigue siendo un crypost gracias a lo de \"lo banearon por sus seguidores\"","replies":[{"poster":"Forero","date":"2017-01-13T02:37:42.508+0000","up_votes":1,"down_votes":0,"body":"Quizás a algunos por el _**Justo y Injuto**_.","replies":[]}]},{"poster":"Forero","date":"2017-01-13T02:34:23.989+0000","up_votes":1,"down_votes":0,"body":"Porque nada tiene que ver X personas o sus seguidores.","replies":[]}]},{"poster":"Rekno","date":"2017-01-13T02:33:41.443+0000","up_votes":2,"down_votes":0,"body":"El ban es acumulativo, no es de una partida a otra. Debe ser muy flammer y haber acumulado muchos reportes.\n\n{{champion:238}}","replies":[]},{"poster":"Chisolin","date":"2017-01-13T02:26:19.579+0000","up_votes":2,"down_votes":0,"body":"Ban merecido y punto, nadie lo obligo a flammear, no flammeaba y nadie lo reportaba...\nAdemas, como ya te dirá algún voluntario/rioter, ningun ban es por 1 partida, si te banean es por venir acumulando reportes, por lo que tu hermano debe ser así de flammer siempre","replies":[]},{"poster":"The Inkanus","date":"2017-01-13T11:55:56.387+0000","up_votes":3,"down_votes":1,"body":"Te das cuenta de que si existiera la posibilidad de que la gente se organizara por X razón con la intención de banear a un jugador en particular esto sería un desastre donde nadie podría sentirse seguro?\n\nQue insultes a Barbakahn, o a Fulanito Gimenez, o a Achungo va a tener la misma relevancia para el sistema si te reportan.\n\nSaludos y a disfrutar de esa compu! je je je","replies":[]},{"poster":"El Grando Smokio","date":"2017-01-13T04:34:47.230+0000","up_votes":2,"down_votes":1,"body":"nada que ver que sea el barba o no tu hermanito es flammer y punto se merece el ban nada que alegar","replies":[]},{"poster":"Score","date":"2017-01-13T03:54:02.079+0000","up_votes":2,"down_votes":1,"body":"y que tiene que sea barbakhan/ faker o yo..\n\nsi alguien me flamea por chat lo reporto y punto y si el resto nota que se paso de la raya tambien le llega report.\n\nGente que se dedique a tirar mierda por el chat no merece jugar. Por mi que le baneen la ip/mac/maquina, etc y no pueda jugar mas.\n\nInsultar a alguien por un teclado es una marico#### , haber si tu hermanito tiene los cojones de insultar a alguien face to face.","replies":[]},{"poster":"Setsumi Sakura","date":"2017-01-13T02:47:38.249+0000","up_votes":1,"down_votes":1,"body":"Son fans, si el contenido que sube es un contenido inmaduro o la mayoría de fans son inmaduros van a defenderlo como a un dios. y aunque su contenido sea mas maduro, va a recibir insultos igual, pero por una cantidad menor de gente.\n\nNadie puede controlar eso, el único que puede es el autor, pero solo va a disminuir ese comportamiento, nunca va a poder borrarlo.\n\neso :s","replies":[{"poster":"Rìsotto Nero","date":"2017-01-13T03:39:23.952+0000","up_votes":1,"down_votes":1,"body":"esa es la causa de los negativos que tiene mi post cuando el problema no es conmigo sino de mi hermano? son sus seguidores?","replies":[{"poster":"Setsumi Sakura","date":"2017-01-14T23:15:00.740+0000","up_votes":1,"down_votes":0,"body":"Fuera de ser fans o no, es un post bastante malo, o va medianamente casi a off-topic.","replies":[]}]}]},{"poster":"Insane Sir","date":"2017-01-13T06:14:14.651+0000","up_votes":1,"down_votes":0,"body":"mira dam sin pila, si tu \"hermano\" flameo se merecia el ban y listo","replies":[]},{"poster":"OrangeBox","date":"2017-01-13T02:54:58.464+0000","up_votes":1,"down_votes":0,"body":"ah mira vos","replies":[]},{"poster":"PurpleHaze13","date":"2017-01-13T02:46:58.072+0000","up_votes":1,"down_votes":0,"body":"Los bans se acumulan, capaz la flameada al barba fue la gota que derramo el vaso","replies":[]},{"poster":"Josu","date":"2017-01-13T02:28:30.515+0000","up_votes":1,"down_votes":0,"body":"si fue baneado es porque ha flameado o hecho otras cosas reiteradamente que merezcan ban, lamento decirlo pero no importa si 1 o 9 personas lo reportan (funciona por partida no por jugador)","replies":[]},{"poster":"Caicai Vilu","date":"2017-01-13T02:48:02.314+0000","up_votes":1,"down_votes":3,"body":"No creo que haya sido únicamente por eso el que lo hayan baneado. Pero se metió con la persona equivocada, se podría decir que Barbakan, o como diablos se escriba, es un ser protegido para Riot LA. Riot tiene un doble discurso, siempre habla de evitar la toxicidad y del buen comportamiento, pero cuando hacen un evento oficial ¿a quién invitan? pues a Barbakan. No sera toxico directamente dentro del juego, como para reportarlo, pero como figura publica ¡uff!","replies":[]}]}