{"poster":"Dmndro","date":"2016-06-27T09:58:35.537+0000","title":"Varus","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":4,"body":"Hey ich wollte euch einen rat geben baut Varus immer erst auf attack Speed dann auf ap und ad, denn wenn ich full build habe bekomme ich ein attack Speed von 2.58. 1.Dorans Ring 2.Nashor`s Zahn 3.Wirbelsturm 4.Attack Speed Boots 5.Rageblade 6Dorans Ring verkaufen 7.Ende der Weisheit. So baue ich immer hoffe es wird euch weiter helfen ;-)\n\nUnd glaubt mir AD und AP ist nicht so wichtig bei Varus trotzdem braucht man es aber kauft euch dieses build und ihr greift so schnell an.","replies":[{"poster":"Ravenvader","date":"2016-06-27T15:29:54.517+0000","up_votes":2,"down_votes":0,"body":"Sorry dir das jetzt so hart zu sagen aber: Das funktioniert nicht.\n\nDu bist Lv 20 und vermutlich hattest du gerade ein Erfolgserlebnis. Das ist schön für dich, aber das liegt halt nunmal daran, dass deine Gegner halt auch nicht so gut sind. Der Build hat vermutlich schon in allem über Bronze 5 Probleme sobald du Rangliste spielst. Hier kommen die Gründe, weshalb:\n\n1. Varus ist auf sogenannten \"poke\" ausgelegt, d.h. sicher hohen Schaden verursachen aus großer Reichweite und so langsam die Gegner zermürben. Leider skaliert Varus größtenteils mit AD (also seine Skills bzw. Stärken werden mit Angriffsschaden verbessert bzw. hervorgehoben).\n2. Nur Attackspeed kaufen ist nichtmal effektiv mit Charakteren, die durch ihre Skills gut damit synergieren (Vayne W, KogMaw W etc.). Um dein Gold am effektivsten zu verwenden solltest du auch in Angriffsschaden, Rüstungsdurchdringung und Kritische Trefferchance investieren. Angriffstempo ist natürlich auch gut, aber im Übermaß und ohne die entsprechenden anderen Stats bedeutet das einfach nur weniger Schaden am Gegner.\n3. Varus mit AP (Nashors Zahn) ist ein lustiger Build, der aber nicht unbedingt so gut ist. Wenn du gut spielen kannst und Spaß haben willst kannst du das gerne mal ausprobieren (also Nashor ->Magiedurchdringungsschuhe-> Rabbadons -> Void Staff -> LichBane etc., W Maxen und immer versuchen 3 W-Stacks auf den Gegner zu bekommen dann einen Skill treffen), aber es ist halt nicht wirklich effektiv. Der Schaden ist nicht \"reliable\" (verlässlich), er braucht zu lange um den Schaden zu verursachen und kann den Q nicht sinnvoll einsetzen.\n4. Dein Build wird von jedem beliebigen halbwegs mit Rüstung ausgestattetem Tank/Bruiser absolut ignoriert, da dir der Schaden fehlt um ihnen auch nur irgendwie gefährlich zu werden.","replies":[]},{"poster":"AI RealSuperSand","date":"2016-06-27T13:00:23.214+0000","up_votes":1,"down_votes":0,"body":"aha. und was hast du mit diesem build erreicht? mal abgesehen vom spott deiner mitspieler.","replies":[{"poster":"Dmndro","date":"2016-06-27T13:22:41.675+0000","up_votes":1,"down_votes":1,"body":"Eine 12 Killstreak im normal.","replies":[{"poster":"AI RealSuperSand","date":"2016-06-27T13:25:21.824+0000","up_votes":2,"down_votes":0,"body":"und das ist alles?","replies":[]}]}]},{"poster":"Uranbrennstab","date":"2016-06-27T10:17:38.718+0000","up_votes":2,"down_votes":0,"body":"1. Ist attackspeed bei 2,5 hardcaped. \n2. ADC ohne armor Pen?  Gegen wen genau funktioniert sowas? \n3. Kein krit? \n4. Kein Lifesteal. \n\nAlso Kauf ich mir einen Dornenpanzer und das wars dann.","replies":[{"poster":"Megamaexx","date":"2016-06-27T10:24:14.407+0000","up_votes":1,"down_votes":0,"body":"So ein Varus macht dann eher magischen Schaden, da er auf das W aufbaut. Dornenpanzer ist also nicht die beste Idee. Schleier der Todesfee sollte aber sehr gut geeignet sein.","replies":[{"poster":"Uranbrennstab","date":"2016-06-27T13:11:38.150+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=vatevpvi,discussion-id=FIzUJR2T,comment-id=00010000,timestamp=2016-06-27T10:24:14.407+0000)\n>\n> So ein Varus macht dann eher magischen Schaden, da er auf das W aufbaut. Dornenpanzer ist also nicht die beste Idee. Schleier der Todesfee sollte aber sehr gut geeignet sein.\n\nDie Frage ist halt, ab wann macht er viel magischen Schaden? Und ob er sich nicht vorher selbst tötet.","replies":[{"poster":"Megamaexx","date":"2016-06-27T14:36:54.654+0000","up_votes":1,"down_votes":0,"body":"Bevor man das abwartet, kann man auch einfach auf ihn zulaufen xD","replies":[]}]}]},{"poster":"Schlampe des ADC","date":"2016-06-27T11:55:48.024+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Uranbrennstab,realm=EUW,application-id=vatevpvi,discussion-id=FIzUJR2T,comment-id=0001,timestamp=2016-06-27T10:17:38.718+0000)\n>\n> 1. Ist attackspeed bei 2,5 hardcaped. \n> 2. ADC ohne armor Pen?  Gegen wen genau funktioniert sowas? \n> 3. Kein krit? \n> 4. Kein Lifesteal. \n> \n> Also Kauf ich mir einen Dornenpanzer und das wars dann.\n\nund spirit visage :D (joke)","replies":[]}]},{"poster":"TerrorRaven","date":"2016-06-27T10:13:36.864+0000","up_votes":3,"down_votes":1,"body":"2.58 Attackspeed sind nicht möglich, da das Cap bei 2.50 liegt (wird denke ich ein Tipp-Fehler sein).\nIch halte Varus auf AP für Zweifelhaft. Dazu sind die AP-Skalierungen zu schlecht und die AD-Skalierungen zu gut.\nSeine größte Stärke ist, dass Varus mit seinem Q den Gegner aus extrem großer Distanz nach und nach runter poken kann. Teilweise kannst du mit einem Q fast eine ganze Vasallenwelle auslöschen.\nDein Build ist zu Autoattack-lastig. Seine Autoattack-Range (575) liegt zwar leicht über den Durchschnitt (550), allerdings begibt man sich dadurch zu schnell in Gefahr. Und sobald mal ein Gegner an dir dran ist, bist du so gut wie tot.","replies":[{"poster":"Dmndro","date":"2016-06-27T11:24:06.183+0000","up_votes":0,"down_votes":2,"body":"Doch dank rageblade. Ne ich meinte dank Mastery und Runen\n","replies":[{"poster":"TerrorRaven","date":"2016-06-27T13:42:01.439+0000","up_votes":2,"down_votes":0,"body":"Nein, geht nicht. Angriffsgeschwinduigkeit ist bei 2.5 begrenzt. Der Einzige, der über diese Grenze auf 5.0 kommen kann ist Kog'Maw, wenn er sein W aktiviert.","replies":[]},{"poster":"Schlampe des ADC","date":"2016-06-27T11:56:38.607+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Dmndro,realm=EUW,application-id=vatevpvi,discussion-id=FIzUJR2T,comment-id=00000000,timestamp=2016-06-27T11:24:06.183+0000)\n>\n> Doch dank rageblade\n\nDu machst zwar non stop AS dmg... aber dein dmg mit varus wird dann zu gering sein um einen gegner ansatzweise um zunieten :x","replies":[{"poster":"Dmndro","date":"2016-06-27T12:11:54.053+0000","up_votes":1,"down_votes":1,"body":"Natürlich muss du dir noch ein Item kaufen was dir AD gibt aber sonst ist das Build richtig gut.","replies":[]}]},{"poster":"ClAO KAKAO","date":"2016-06-27T11:51:00.185+0000","up_votes":2,"down_votes":0,"body":"Wahnsinn, wusste garnicht das Rageblade das ATK Speed Cap auflöst","replies":[]}]}]},{"poster":"Megamaexx","date":"2016-06-27T10:28:46.914+0000","up_votes":1,"down_votes":0,"body":"Vor allem im early braucht Varus eher AD als Attackspeed, da er mit der Q auf hoher Reichweite Schaden macht. Seine Autoattacks an sich tun gar nicht so sehr weh. Man muss die W dann ja noch mit einer anderen Fähigkeit auslösen und um damit mehr Schaden als ein AD Varus zu machen, muss man schon brutal viel AP haben.","replies":[{"poster":"Lagbeard","date":"2016-06-27T14:40:43.085+0000","up_votes":1,"down_votes":0,"body":"Ist vom Gegner abhängig. Ein Full AP Varus kommt auf Pre-Mitigation Damage von 45 Prozent. Wenn er damit einen Tank angreift kann er dem auch durch seine MR schon ordentlich Schaden machen, allerdings gibt es beim AP-Varus ein Problem mit Squishies: Da dein Hauptschaden Prozentual ist brauchst du für einen Gegner, den eine Jinx mit 2 Schüssen kaputt hat ziemlich lange. Und dein Skaling ist sehr langsam. Also wirklich, wirklich seeeeeeehr langsam.","replies":[{"poster":"Megamaexx","date":"2016-06-27T14:51:34.205+0000","up_votes":1,"down_votes":0,"body":"Hab ihn selbst schon auf AP gespielt, hab ich demnächst nicht noch mal vor. Eben weil ich weiß, dass es dauert","replies":[]}]}]}]}