{"poster":"Windswëpt","date":"2018-04-27T22:09:45.344+0000","title":"Discriminación contra las mujeres en los videojuegos (Serio)","subforum":"Charlas Generales","up_votes":9,"down_votes":26,"body":"Hola invocadores, hace un tiempo (para la universidad) hice un ensayo sobre la _**discriminaci&oacute;n a las mujeres en los videojuegos**_, especialmente en LOL. La cosa es que me fue demasiado bien y ahora con mi polola queremos hacer un paper sobre el tema y publicarlo, y adem&aacute;s, pensamos presentar el tema en las Jornadas de Ling&uuml;&iacute;stica y Literatura de nuestra universidad.\r\n\r\nPara lograrlo necesitamos un corpus ( cualquier tipo de datos, screenshots, experiencias, etc) bastante grande. Por lo tanto, agradecer&iacute;a mucho que si les ha pasado cualquier cosa en el lol (incluso en alg&uacute;n otro juego) o en algun grupo de facebook, relacionado a esto, en el que se hayan sentido agredidas -o hayan visto agresi&oacute;n hacia alguna mujer- me lo cuenten en los comentarios  o pongan un screenshot,  cualquier experiencia que tengan con respecto al tema nos ayudar&iacute;a much&iacute;simo a llevar esto adelante, cualquier informaci&oacute;n que recaudemos cuidara su privacidad y anonimidad, no utilizaremos nombres, ni nicks, ni nada que pueda involucrarles de alguna manera.\r\n\r\nCualquier aporte que hagan lo agradecemos infinitamente. Esto es algo que **nos incumbe a todos** y para nosotros esto significa la oportunidad de mostrar este problema en el mundo acad&eacute;mico para intentar cambiar esta realidad. Gracias de antemano :)","replies":[{"poster":"yavannat","date":"2018-04-27T22:39:27.397+0000","up_votes":6,"down_votes":1,"body":"Yo si he sido victima de discriminación hacia la mujer no solo en este juego\nAunque también es cierto que algunas mujeres se victimizan sin tener pruebas siquiera, tipo feminazi\nEn fin.. me han mandado a la cocina y me han dicho que solo por ser mujer no puedo jugar top o Jg.\nUna vez también me toco un tipo re molesto, que me flameo toda la partida diciendo cosas como \"las mujeres no deberían jugar\", \"me molesta jugar con mujeres\", etc\nEn otros juegos (solía jugar mucho rpg) suelen tratar a la mujer como trofeos. \nYo creo que es un tema que con el tiempo irá perdiendo su peso, ya que en cierto punto en la industria de los videojuegos nunca hubieron muchas mujeres.. y aunque en los últimos años ha incrementado la comunidad femenina es bien probable que como en otros ámbitos de la vida diaria estas formen parte importante de la misma industria gamer {{champion:103}}","replies":[]},{"poster":"21 Fiora","date":"2018-04-27T22:14:18.652+0000","up_votes":3,"down_votes":10,"body":"Entiende, si te molesta que te discriminen por ser mina entonces no te pongas un nombre de mina. No es necesario en el LoL ponerte tu nombre.","replies":[{"poster":"Danshid","date":"2018-04-27T22:27:05.132+0000","up_votes":3,"down_votes":2,"body":"osea que si me quiero poner luisitagamer me van a discriminar, pero si me pongo juangamer, no van a decir nada?\n\nYo creo que el problema ahi no es el nombre...","replies":[{"poster":"21 Fiora","date":"2018-04-27T22:31:18.246+0000","up_votes":2,"down_votes":6,"body":"Dije SI TE MOLESTA que te discriminen una solución es cambiarte el nombre, no puedes llegar y decir \"ay la comunidad me discrimina por ser mina\" y creer que todo va a cambiar. No tapemos el sol con un dedo por favor.","replies":[{"poster":"Windswëpt","date":"2018-04-27T22:35:37.163+0000","up_votes":6,"down_votes":4,"body":"Eso no es una solución amigx, es evadir el problema.","replies":[{"poster":"21 Fiora","date":"2018-04-27T22:43:46.282+0000","up_votes":4,"down_votes":4,"body":"Entonces si tanto te molesta evadelo no te calientes la cabeza en un juego online que de mucho no te va a servir.","replies":[{"poster":"Windswëpt","date":"2018-04-27T22:48:26.335+0000","up_votes":2,"down_votes":2,"body":"Mi objetivo no es evadir el tema, lo que quiero es hacer algo al respecto, ya que dentro del mundo académico no hay mucha información con respecto a este tema. Eso significa que hacer este tipo de investigaciones puede ayudar a solucionarlo. (OJO SOLUCIONARLO, NO EVADIRLO)","replies":[{"poster":"21 Fiora","date":"2018-04-27T22:49:48.043+0000","up_votes":2,"down_votes":3,"body":"Explicame como lo solucionarias y de que mierda te serviria.","replies":[{"poster":"Cabez0n","date":"2018-04-27T22:52:31.887+0000","up_votes":4,"down_votes":0,"body":"Si afirmas vehementemente que la investigación que se propone no tiene pies ni cabeza y que no funcionaría de ninguna manera, o que es estéril ¿Con que sentido perdes tiempo comentando el tema?","replies":[{"poster":"21 Fiora","date":"2018-04-27T22:53:16.097+0000","up_votes":1,"down_votes":3,"body":"Para mi los debates no son una perdida de tiempo","replies":[{"poster":"Cabez0n","date":"2018-04-27T22:59:13.042+0000","up_votes":5,"down_votes":0,"body":"Lo que estas haciendo no es un debate, es compartir doxa, opinión, o por lo menos tus comentarios recientes tienen dicha forma. Para debatir debes informarte y fundamentar con el saber, otra cosa es que estés en la temática por interés y preguntando para adquirir conocimientos sobre gente que si estudio y profundizó el tema. Distinta es una típica lucha por la razón entre sandeces de pocos fundamentos y criticas vulnerables que se suelen hacer en una juntada informal mientras se toma un café.","replies":[{"poster":"21 Fiora","date":"2018-04-27T23:03:05.688+0000","up_votes":1,"down_votes":4,"body":"Tómalo como se te plazca, pero no creo que el post de este loco pueda solucionar este \"problema\". Ni haciendo 100 post vas a lograr que pare la esto, como ya dije, no tapes el sol con un dedo. Saludos.","replies":[{"poster":"Windswëpt","date":"2018-04-27T23:06:23.499+0000","up_votes":4,"down_votes":0,"body":"Viejo, estoy publicando acá para recolectar información. Por si no te quedó claro voy a presentar el tema en las Jornadas de Lingüística y Literatura de mi Universidad, frente a academicos (no jugadores casuales de lol) que obviamente pueden hacer más que tu y que yo.","replies":[{"poster":"Mazoku","date":"2018-04-27T23:08:35.100+0000","up_votes":2,"down_votes":1,"body":"> que obviamente pueden hacer más que tu y que yo.\n\nAlguna evidencia de esto o solo hablas por hablar como en el otro intercambio que tuvimos?","replies":[{"poster":"Windswëpt","date":"2018-04-27T23:12:29.459+0000","up_votes":4,"down_votes":0,"body":"Oh god why","replies":[]}]},{"poster":"21 Fiora","date":"2018-04-27T23:08:06.357+0000","up_votes":2,"down_votes":1,"body":"Okay, me queda claro. Buen dia.","replies":[]}]},{"poster":"Cabez0n","date":"2018-04-27T23:24:59.449+0000","up_votes":4,"down_votes":0,"body":"\"Pero no creo que el post [...]\" ¿Te das cuenta que no salís del creer? Que tu inconsciente mismo entiende que tus conocimientos son carentes como para afirmar de manera segura tu planteamiento, ya que sabe que si cualquiera te replanteara la cuestión o repreguntara, no sabrías responder a la misma. Es decir, tu única convicción al respecto existe en tu creencia y no en algún saber propio.\nUn caso ejemplar de la lingüística: si alguien te pregunta si un pato es un pato, no decís \"Creo que es un pato\" bajo ninguna circunstancia, simplemente respondes \"Sí, es un pato\", ahora si de repente te detienen en un terreno el cual desconoces, la misma lingüística revela tu inseguridad ante un tema desconocido. Un consejo, intenta tener dignidad y retirarte callado si es que lo único que buscabas era ser el poseedor de la verdad, cosa que nadie lo es y demostrarte superior al resto, o si es que te interesa el tema, quédate a analizar y dar una mano.","replies":[]}]}]},{"poster":"Windswëpt","date":"2018-04-27T23:00:51.923+0000","up_votes":2,"down_votes":0,"body":"Un primer paso es ayudar a que se reconozca/dar a conocer el tema. Eso es lo que pretendo al investigar esto. Esto lo hago porque hay mucha gente que no tiene ni idea del tema. Eso es solo un paso, luego de que se reconozca el tema habrá que tomar otras medidas al respecto.","replies":[{"poster":"Windswëpt","date":"2018-04-27T23:02:07.751+0000","up_votes":2,"down_votes":0,"body":"Y me sirve porque NO puede ser posible que alguien que ama jugar tenga que dejarlo por un montón de imbécilxs la insultan solo por el hecho de ser mujer. Me sirve porque me reconforta saber que aunque sea un poco estoy ayudando a erradicar esto.","replies":[]}]}]}]},{"poster":"bombastico","date":"2018-04-27T23:05:07.832+0000","up_votes":4,"down_votes":0,"body":"Niño, según ella es para un estudio universitario. Antes de plantear cualquier solución primero debe hacerse un \"marco teorico\" y eso es lo que ella pide, reunir información, en este caso de primera fuente.","replies":[{"poster":"21 Fiora","date":"2018-04-27T23:06:56.218+0000","up_votes":1,"down_votes":4,"body":"Es un foro de LoL que estas pidiendo, ¿Que te lo hagan?","replies":[{"poster":"bombastico","date":"2018-04-27T23:13:37.611+0000","up_votes":2,"down_votes":0,"body":"No, no estoy pidiendo ningún foro de lol xD (Las \"comas\"). \nFue una respuesta a tu \"explicame como lo solucionarias....\" ella no está buscando la solución a nada. (Es un foro y nada dice que no puedo meterme en discusiones ajenas :P )","replies":[]},{"poster":"Windswëpt","date":"2018-04-27T23:09:44.943+0000","up_votes":2,"down_votes":0,"body":"Soy hombre por si acaso, y NOOOOO no estoy pidiendo en ningún caso que me hagan la investigación, solo pido sus experiencias al respecto para usarlas dentro de mi trabajo, nada más. Creo que deberías considerar mejorar tu compresión lectora (sin mencionar otras cosas).","replies":[]}]}]}]}]}]}]}]}]},{"poster":"bombastico","date":"2018-04-27T23:03:35.237+0000","up_votes":4,"down_votes":0,"body":"Si tu comentario es un reflejo de como piensas, debes vivir ocultado muchas cosas por miedo al que dirán ¿cierto?.","replies":[{"poster":"21 Fiora","date":"2018-04-27T23:04:58.272+0000","up_votes":2,"down_votes":0,"body":"En parte.","replies":[]}]}]},{"poster":"CSGO PLAYER","date":"2018-04-27T22:19:23.115+0000","up_votes":5,"down_votes":1,"body":"Yo creo que mas que un tema de discriminación a la **mujer** es un tema general, discriminación en los juegos y en lol específicamente es pan de cada día tanto para hombre y mujeres (en mi parecer mas para hombre). Ademas esta el tema de que en los juegos tu nombre te identifica, no tu sexo, no aparece \"CSGO PLAYER (MUJER)\" o viceversa. \n\nPero es un tópico interesante y ojala te vaya bien en tu proyecto. Mi opinión es que podrías hacer el tema mas general que específicamente a la mujer amigo. \n\nSaludos ! \n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Windswëpt","date":"2018-04-27T22:37:43.893+0000","up_votes":4,"down_votes":2,"body":"Estoy de acuerdo contigo en que hay discriminación para ambos lados. Pero lo que tenía en mente al hacer todo esto es la causa de las discriminaciones. A las mujeres las discriminan por el hecho de ser mujeres, en cambio a nosotros no. Se que hay discriminación hacia nosotros los hombres pero no siguen el mismo criterio. A eso voy, Saludos.","replies":[{"poster":"Musidora Klemm","date":"2018-04-27T23:18:32.004+0000","up_votes":2,"down_votes":0,"body":"La discriminación existe desde el momento en que se se usa el término gamer girl/chica gamer para las mujeres y gamer a secas para el hombre, se usa una distinción de género para un concepto que no la tiene.\nHay una falsa creencia que el hombre consume únicamente videojuegos. De ahí que siempre la piba se fume el acoso por estar \"en un ámbito de chicos\"","replies":[]}]}]},{"poster":"RSSPLOTER","date":"2018-04-27T23:57:59.456+0000","up_votes":4,"down_votes":1,"body":"Pollerudo.","replies":[]},{"poster":"Mazoku","date":"2018-04-27T22:23:02.517+0000","up_votes":4,"down_votes":2,"body":"Mas facil conseguir informacion de discriminacion contra los hombres en los videojuegos.\n\nVas a encontrar montañas mas de evidencia.","replies":[{"poster":"Windswëpt","date":"2018-04-27T22:34:00.580+0000","up_votes":5,"down_votes":4,"body":"Mi objetivo no es discutir pero no es lo mismo. De ninguna manera. A nosotros los hombres nos discriminan por jugar mal mas que nada pero nunca por el hecho de ser hombres. Ese es el problema (y la diferencia)","replies":[{"poster":"Mazoku","date":"2018-04-27T22:36:55.018+0000","up_votes":3,"down_votes":2,"body":"> Mi objetivo no es discutir pero no es lo mismo. De ninguna manera. A nosotros los hombres nos discriminan por jugar mal mas que nada pero nunca por el hecho de ser hombres. Ese es el problema (y la diferencia)\n\nSi tuviera 1 centavo por cada vez que me dijeron \"gordO virgO\" (clasico estereotipo de hombre fracasado producto del feminismo en las sociedades que vivimos) y me restaran 100 dolares por cada vez que vi a un usuario ser discriminada por ser mujer podria comprar riot games.\n\nAhora si le sumamos las demas fraces discriminatorias clasicas del feminismo y no le restamos nada podria comprar el planeta entero.","replies":[{"poster":"bombastico","date":"2018-04-27T23:09:16.176+0000","up_votes":4,"down_votes":1,"body":"No no, el \"gord0 virg0\" no es un estereotipo del feminismo, es algo netamente machista, es la imagen que se quiere proyectar del hombre musculoso, exitoso y rodeado de mujeres (cualquier publicidad de perfumes xd).\nNo estoy a favor del feminazismo de tercera ola, pero hay que argumentar bien y no confundir las cosas.","replies":[{"poster":"Mazoku","date":"2018-04-27T23:11:30.255+0000","up_votes":2,"down_votes":5,"body":"> No no, el \"gord0 virg0\" no es un estereotipo del feminismo, es algo netamente machista, es la imagen que se quiere proyectar del hombre musculoso, exitoso y rodeado de mujeres (cualquier publicidad de perfumes xd).\nNo estoy a favor del feminazismo de tercera ola, pero hay que argumentar bien y no confundir las cosas.\n\nJAJAJAJAJA\n\nInsultar al hombre por ser hombre = machismo\nInsultar a la mujer por ser mujer = machismo\n\nTodo es machismo. JAJAJAJA\n\n\nDouble standards ftw.","replies":[{"poster":"bombastico","date":"2018-04-27T23:18:38.632+0000","up_votes":5,"down_votes":1,"body":"No no, mira:\nInsultar al hombre por salirse del estereotipo de hombre = machismo\nInsultar a la mujer por salirse del estereotipo de mujer =machismo\nFavorecer a la mujer solo por el hecho de ser mujer = discriminación positiva = feminazismo\nQue el hombre no pueda reclamar nada por su \"posición privilegiada\" = Feminazismo\nIgualar las oportunidades para hombre y mujeres = feminismo\n\nPor ejemplo, el que la mujer tenga por ley privilegio sobre el hombre en cuando a paternidad es machismo. (Esa ley en chile se creo en el contexto de cuando la mujer se quedaba en casa cuidando a los hijos)","replies":[{"poster":"Mazoku","date":"2018-04-27T23:54:56.979+0000","up_votes":2,"down_votes":2,"body":"> Insultar al hombre por salirse del estereotipo de hombre = machismo\n> Insultar a la mujer por salirse del estereotipo de mujer =machismo\n\nNo sabes lo que significan los \"double standards\" no?","replies":[{"poster":"bombastico","date":"2018-04-28T00:01:05.232+0000","up_votes":3,"down_votes":1,"body":"Si, es el termino gringo de \"doble moral\" lo contrario a la imparcialidad :3","replies":[{"poster":"Mazoku","date":"2018-04-28T00:02:10.059+0000","up_votes":1,"down_votes":3,"body":"Exacto, ahora relee tu comentario y fijate como se aplica a lo que decis.","replies":[{"poster":"bombastico","date":"2018-04-28T00:06:04.659+0000","up_votes":4,"down_votes":1,"body":"Lo volví a leer y veo el tremendo \"Combo breaker\" que te apliqué xD\n\nSi el estereotipo de hombre es el de un \"he-man\" rodeado de mujeres, el decirte gord0 virg0 como \"insulto\" es machista. Lo mismo que decir \"no llores que eres hombrecito\"\n\nSi la mujer se le estereotipa como sumisa, excelente ama de casa y como insulto le dices \"jajaja manca, anda a la cocina\" sigue siendo algo machista.\n\nAdemás no vale solamente citar las 2 primeras lineas de lo que dije, a eso se le dice \"sacar de contexto\"","replies":[{"poster":"Mazoku","date":"2018-04-28T00:23:10.313+0000","up_votes":1,"down_votes":2,"body":"> Si el estereotipo de hombre es el de un \"he-man\" rodeado de mujeres, el decirte gord0 virg0 como \"insulto\" es machista. Lo mismo que decir \"no llores que eres hombrecito\"\n\nSi el estereotipo de hombre es el de un \"he-man\" rodeado de mujeres, el decirte gord0 virg0 como \"insulto\" es feminista. Lo mismo que decir \"no llores que eres hombrecito\"\n\n> Si la mujer se le estereotipa como sumisa, excelente ama de casa y como insulto le dices \"jajaja manca, anda a la cocina\" sigue siendo algo machista.\n\nSi la mujer se le estereotipa como sumisa, excelente ama de casa y como insulto le dices \"jajaja manca, anda a la cocina\" sigue siendo algo feminista.\n\n> Además no vale solamente citar las 2 primeras lineas de lo que dije, a eso se le dice \"sacar de contexto\"\n\nAhi te cite todo.\n\nEntendes los estandares dobles ahi o necesitas un dibujito?\n\nEs logica proposicional basica esto eh.\n\n>  \"Combo breaker\" que te apliqué xD\n\nMas bien fue un self ownage xD\n\nhttps://thumbs.gfycat.com/LimitedNauticalAfghanhound-max-1mb.gif","replies":[{"poster":"bombastico","date":"2018-04-28T00:36:03.143+0000","up_votes":3,"down_votes":0,"body":"Aaaaah, ahora entiendo, estas confundiendo los conceptos, mira feminista es el \"Principio de igualdad de derechos de la mujer y el hombre\" cosa que de ninguna manera aplica a los ejemplos que me citaste.\n\nPor otra parte el Machismo es la \"Actitud de prepotencia de los varones respecto de las mujeres\" Recuerda que el termino fue acuñado en el contexto donde se veia a la mujer debil,  al hombre fuerte y salirte de esos parametros te convertía en \"marica, virgo, etc\" y a la mujer en \"marimacha\" (Al contexto actual es que no juegue videojuegos).\n\nAmbos términos sacados directamente de la RAE.\nLa doble moral se aplica a las feminazis, de lo que ya di ejemplo arriba.\n\nTenga un buen día.","replies":[{"poster":"Mazoku","date":"2018-04-28T01:08:23.465+0000","up_votes":1,"down_votes":2,"body":"> Aaaaah, ahora entiendo, estas confundiendo los conceptos, mira feminista es el \"Principio de igualdad de derechos de la mujer y el hombre\" cosa que de ninguna manera aplica a los ejemplos que me citaste.\n\nNono, vos te estas confundiendo de concepto. Las feministas luchan por la supremacia femenina. Al menos aca en Argentina desde donde te estoy escribiendo.\n\nDejando eso de lado, te deseo un buen dia y que seas capas de organizar tus definiciones antes de debatir. La RAE no es parametro de nada para cualquier persona con dos dedos de frente.\n\nSaludos.","replies":[{"poster":"bombastico","date":"2018-04-28T01:11:12.001+0000","up_votes":2,"down_votes":1,"body":"muahahahaha perdiste una discusión de internet xD\nEsas que dices tu son feminazis de la tercera ola, muy populares en la red, no les hagas mucho caso, no lograran nada.","replies":[]}]}]}]}]}]}]}]},{"poster":"Windswëpt","date":"2018-04-27T23:22:28.420+0000","up_votes":3,"down_votes":2,"body":"Exacto","replies":[]}]}]}]},{"poster":"Windswëpt","date":"2018-04-27T22:42:37.461+0000","up_votes":3,"down_votes":4,"body":"Bueno, si crees eso está bien, no vengo a discutir ni nada, solo vengo a recolectar información. Saludos","replies":[{"poster":"Mazoku","date":"2018-04-27T22:43:38.190+0000","up_votes":3,"down_votes":4,"body":"> Bueno, si crees eso está bien, no vengo a discutir ni nada, solo vengo a recolectar información. Saludos\n\nSi, creo en el mundo real y no en las fantasias.\n\nSuerte recolectando informacion sobre un grupo privilegiado comparativamente.\n\nSaludos.","replies":[{"poster":"EverDreams","date":"2018-04-27T23:15:43.621+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=Mazoku,realm=LAS,application-id=v7qsfXsE,discussion-id=V16oTq00,comment-id=00040000000000000000,timestamp=2018-04-27T22:43:38.190+0000)\n>\n> Si, creo en el mundo real y no en las fantasias.\n> \n> Suerte recolectando informacion sobre un grupo privilegiado comparativamente.\n> \n> Saludos.\n\nEntonces salí al mundo real y vas a ver que sucede lo mismo. Saludos","replies":[]}]}]}]}]}]},{"poster":"AxElL93","date":"2018-04-27T22:21:09.498+0000","up_votes":2,"down_votes":4,"body":"***","replies":[{"poster":"CSGO PLAYER","date":"2018-04-27T22:23:34.814+0000","up_votes":3,"down_votes":0,"body":"{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Zerø Cool","date":"2018-04-27T22:27:23.380+0000","up_votes":3,"down_votes":0,"body":"[](http://[img]https://i.imgur.com/EsA0iFg.jpg[/img])\nhttps://i.imgur.com/EsA0iFg.jpg[/img]","replies":[]}]}]}