{"poster":"GigaWarrior","date":"2018-02-08T18:40:18.173+0000","title":"Miért mindig csak RP? Miért nem IP? Ja most már BE?","subforum":"Általános beszélgetés","up_votes":1,"down_votes":12,"body":"Sziasztok!\r\n\r\nGregori tett egy bejegyz&eacute;st Kulcsok/L&aacute;d&aacute;k c&iacute;msz&oacute;val. &Iacute;rtam egy hozz&aacute;sz&oacute;l&aacute;st, amit &uacute;gy gondoltam itt a főfalon (ha ez a neve) eln&eacute;z&eacute;st a vezetőktől, ha nem &iacute;gy h&iacute;vj&aacute;k!\r\nGregori rem&eacute;lem nem haragszol, hogy megeml&iacute;tettelek itt, mint neked is &iacute;rtam a hozz&aacute;sz&oacute;l&aacute;somban, &uacute;j vagyok itt a f&oacute;rumon, k&eacute;sőbb vettem\r\n&eacute;szre, hogyan lehet t&eacute;m&aacute;t l&eacute;trehozni.\r\nEgyet&eacute;rtek Gregori-val! Szerintem is kellene egy &uacute;j&iacute;t&aacute;s vagy v&aacute;ltoztat&aacute;s, arr&oacute;l nem besz&eacute;lve, hogy a kezdetektől fogva a LOL-ban mindig csak az j&aacute;r j&oacute;l, akinek van egy rakat RP-je. Tudom, hogy ma m&aacute;r minden a p&eacute;nzről sz&oacute;l, de mi&eacute;rt kell egy j&aacute;t&eacute;kban ellehetetlen&iacute;teni a j&aacute;t&eacute;kosokat &eacute;s h&aacute;tt&eacute;rbe szor&iacute;tani &uacute;gy, hogy nem kapnak semmit (semmit!!!!) RP n&eacute;lk&uuml;l (ami basszus!!!! p&eacute;nzbe ker&uuml;l!!!). &Eacute;n n&eacute;gy &eacute;ve j&aacute;tszom k&ouml;r&uuml;lbel&uuml;l, van 35-40 (nem tudom pontosan) hős&ouml;m. Sok&aacute;ig-nagyon sok&aacute;ig kitart&oacute;an gyűjt&ouml;ttem az IP-t annyira, hogy 15 hőst vettem meg egyszerre!!!! Szerintem el&eacute;g j&oacute; statisztik&aacute;im is voltak adc, tank, support szinten (jinx level 6 S+, nami level 6 S+) &eacute;s kaptam a Riot-t&oacute;l egy marha nagy aj&aacute;nd&eacute;kot: semmmit!!!!!!!!!! Egy skin t&ouml;red&eacute;k, vagy l&aacute;da, ja!!!! l&aacute;da!!! Na igen!! H&aacute;nyszor voltam S ak&aacute;rmilyen &eacute;s mindig csak kulcsot adott! (ok!!! adott! ezt nem vitatom!!) (de rendesek!!!)\r\n&Eacute;rtem &eacute;n - vegyek RP-t &eacute;s kussoljak!!! De nem&aacute;r!!!\r\nAnnyit j&aacute;tszik az ember, mert valjuk be &eacute;lvezz&uuml;k a j&aacute;t&eacute;kot, mindig a győzelmet hajtjuk. &Eacute;n p&eacute;ld&aacute;ul olyan szem&eacute;lyis&eacute;g vagyok, hogy ak&aacute;rkivel is j&aacute;tszom, ha valamilyen absz&uacute;rd csapatmunka (de &ouml;sszej&ouml;n &eacute;s a v&eacute;g&eacute;n m&eacute;g is j&oacute;l s&uuml;l el) szar, akkor sem any&aacute;zom, sőt gratul&aacute;lok, &iacute;rom, hogy gj, nice (&aacute;ltal&aacute;ban, j&oacute; nem! mindig aramozni szoktam &eacute;s &aacute;ltal&aacute;ban tankot vagy mage-t kapok) &eacute;s megpr&oacute;b&aacute;lom ir&aacute;ny&iacute;tani a csapatot. N&eacute;ha balfaszul siker&uuml;l egy-k&eacute;t akci&oacute;m &eacute;s &iacute;r&oacute;m, hogy sorry, de &iacute;rj&aacute;k, hogy nem baj. (Biztos sokan j&aacute;tszanak m&eacute;g hozz&aacute;m hasonl&oacute;an)\r\nSz&oacute;val j&oacute;&oacute;&oacute; j&aacute;tszani!!!\r\nMindj&aacute;rt befejezem!\r\nNe haragudjatok, ha nem a t&eacute;m&aacute;ba v&aacute;g minden amiről besz&eacute;ltem, de &uacute;j vagyok itt &eacute;s ez a t&eacute;ma (probl&eacute;ma) tetszett.\r\nNa m&eacute;g egy utols&oacute; ilyesmi.\r\nMost is van ez a hold- marhas&aacute;g (Lunar Revel Event)\r\nMi az amit elősz&ouml;r l&aacute;t mindenki egy-k&eacute;t kattint&aacute;s ut&aacute;n??? Na???\r\n575, 485, 675, RP RP RP RP\r\nMindenhol minden kibaszott (bocs&aacute;nat) RP-be ker&uuml;l!!! Mi ez m&aacute;r???\r\nNe csak az kapjon ilyeneket akinek p&eacute;nze van b....a meg!!! (bocs&aacute;nat)\r\n&Eacute;n, mi is szeretn&eacute;nk ilyen karakterekkel skinekkel j&aacute;tszani!!\r\nJ&oacute; l&aacute;tom, hogy vannak szerezhető aj&aacute;nd&eacute;kok, meg k&ouml;vek, meg babzs&aacute;kok, meg zsetonok!!!\r\nAmikkel egy&eacute;bk&eacute;nt kit&ouml;r&ouml;lhetj&uuml;k a s.....&uuml;nket!!!!! Mert mire abb&oacute;l &ouml;sszej&ouml;n valami, addigra r&eacute;g el is felejti a sok gazdag j&aacute;t&eacute;kos!!\r\n(l&aacute;sd a project skinek!!! es&eacute;lyem sem volt megszerezni egyiket sem RP n&eacute;lk&uuml;l, pedig ashe-vel im&aacute;dok menni &eacute;s &eacute;n is v&aacute;gytam r&aacute;!!!)\r\nNa de h&aacute;t ez a RIOT!!\r\n\r\nKicsit elragattattam magam! Bocs&aacute;nat mindekitől.","replies":[{"poster":"Centúlió","date":"2018-02-08T21:30:00.606+0000","up_votes":4,"down_votes":0,"body":"https://www.youtube.com/watch?v=J2Bx19qJ_Vs&feature=youtu.be&t=54s","replies":[]},{"poster":"Rantnad","date":"2018-02-08T18:53:40.091+0000","up_votes":2,"down_votes":0,"body":"Nem egészen értem a problémát (bár ezt már előttem nagyon sokan leírták); adott egy teljesen ingyenesen játszható játék, és itt most a teljesen ingyenes alatt azt értem, hogy nem lehet pénzért előnyt venni (mint általában a netes játékokban). Egyedül azért kell fizetned, hogyha valamilyen extra dolgot szeretnél (mint a skinek, emote-ok, stb.), illetve ha előbb akarsz megvenni egy hőst ahelyett, hogy kifarmolnád az árát (ami szintén ingyenes, csak az idődből megy).\n\nMár ne is haragudj, de ez a hozzáállás kb. óvódás korban volt egyáltalán elfogadható (hisztizel, mert nem kapsz meg valamit ingyen). Annak kellene örülni, hogy lehet ládákat szerezni INGYEN, amikből skineket megy egyéb extra dolgokat lehet szerezni INGYEN, esetleg akkor jobban örülsz, ha olyan esik, amit tényleg meg is akartál szerezni. Emellett vannak ezek az eventek néha-néha, amikből szintén INGYEN lehet jó cuccokat szerezni (értelemszerűen mindent nem).","replies":[{"poster":"GigaWarrior","date":"2018-02-08T19:06:08.047+0000","up_votes":1,"down_votes":1,"body":"Értem amit mondasz!\n\nIgen!! Ingyen játszható ez igaz, de nem értek veled egyet!\n\nSemmi óvoda nincs benne, leírtam a saját példámat, nem gondolom, hogy ez óvoda.\nNem a plusz előnyök megszerzéséről beszéltem, csak azt mondtam, hogy aki nem rendelkezik RP-vel nem jut semmihez.\nPersze így van kitalálva és mint minden máshol, itt is fizetni kell a jó cuccokért. Ez rendben van.\nDe a normál játékosoknak nagyon nehéz azt a kis (riot bónuszokat) összegyűjteni.\n\nKöszönöm a hozzászólást!","replies":[]}]},{"poster":"cigiszünet2p","date":"2018-02-08T19:06:34.220+0000","up_votes":2,"down_votes":1,"body":"Mi vagy te valami kisiskolás hogy rinyálsz mert nem kaphatsz meg mindent ingyen?","replies":[{"poster":"GigaWarrior","date":"2018-02-08T19:08:43.521+0000","up_votes":1,"down_votes":3,"body":"Nem, nem vagyok kisiskolás!\n\nKöszönöm a hozzászólást!","replies":[{"poster":"M4dr4c","date":"2018-02-08T19:48:54.435+0000","up_votes":1,"down_votes":0,"body":"Teljes mértékben úgy viselkedsz. Mit kaptál a Riottól? Egy ingyenes játékot, amiben minden elérhetsz pénz nélkül, ami kell a teljes értékű játékhoz.","replies":[]}]}]},{"poster":"Jack Eron","date":"2018-02-10T17:33:52.239+0000","up_votes":1,"down_votes":0,"body":"Őszintén nem értem mi a probléma. A játék ingyenesen játszható. Nem létezik benne olyan előny, amit pénzen meg tudnál venni. Egy-két régebbi különleges skin kivételével bármelyiket kinyithatod ládából! Meghatározott számú ládát szerezhetsz az Ses statokkal, de könyörgöm, a champ skinektől a ward skinekig mindent megszerezhetsz némi szerencsével, és egy centet sem kell érte fizetned! Minden alkalommal amikor ládát nyitsz, lehetőséged van rá, hogy van benne egy király skin. Ha időbe telik kifarmolni hozzá az esszenciát, akkor is csak az idődbe fog kerülni, másba nem... \n\nAz eventek, ahogyan a mostani is, lehetőséget adnak játék közben megszerezni tokeneket, amelyekből gömböt vehetsz, ami már GARANTÁLTAN ad neked egy skint (persze nem feltétlen azt, amire számítottál). De te itt mindenhez hozzájuthatsz. Ingyen is, pénzért is. Az egyik út rögösebb és hosszabb. Az már csak személyes ráadás, hogy engem az ilyesmi nem érdekel, eszembe sem jutna reklamálni érte. Örülök, hogy ha kapok egy menő skint, de amúgy a fenébe is, senkit sem fog érdekelni meccs közben! Ha tudok játszani, nem számít van -e skinem, ha nem tudok, hát akkor meg végképp...","replies":[]},{"poster":"Gregori","date":"2018-02-09T10:04:24.241+0000","up_votes":1,"down_votes":0,"body":"Nem baj, hogy megemlítettél, viszont én is csak a többiek álláspontját tudom osztani... :/ A témámban már válaszoltam neked, de átírom inkább ide.\n- - -\nFigyelj, ez sajnos így működik. Náluk sem fán terem a pénz, és nem is kis cégről beszélünk, így nem meglepő, hogy szükségük van a bevételre.\n\nMásfelől meg nézd azt, hogy az egész játék ingyenes. Elhiszem, hogy tetszik pár kinézet, és nagyon fáj is rá a fogad, de az idő nem áll meg, én is visszamenőleg bemákoltam már pár olyan kinézetet a ládákból/rerollból, amit nagyon szerettem volna. Képzelheted, mennyire örültem! :D Szóval ne add fel, játssz, és idővel megérik a munkád gyümölcse. :D\n\nHa nem bírsz várni, akkor nyúlhatsz a pénztárcádhoz is ugyebár, én amikor ezt teszem, akkor igyekszem a lehető legtöbbet kihozni a pénzemből. Szóval elsősorban eventek idején veszek olyan ládát/kapszulát amit nagyon megéri. Így gyűlnek szépen a töredékek, és csak idő kérdése, hogy mikor kapok olyat, amit már kinéztem magamnak.\n\nAz eventeken meg pár dolgot azok is kényelmesen megtudnak szerezni, akik nem költenek rá semmit, csak kifarmolják az összes küldetést. Szóval én viszonylag korrektnek tarom a rendszert.","replies":[]},{"poster":"SquatEye","date":"2018-02-08T22:15:46.534+0000","up_votes":1,"down_votes":0,"body":"\"Csak azt mondtam, hogy aki nem rendelkezik RP-vel nem jut semmihez.\"\n\nMert akinek pénze nincs, annak kenyérre sem futja. A világ a pénz feltalálása óta kb. nem igazságos ebből a szempontból.\n\nMondok egy másik megközelítést: a \"semmi\" jelen esetben egy ingyenes játékélményt takar, amibe állításod szerint több évet beletettél már. A skinek régen is RPért voltak, azelőtt még Hextech rendszer sem volt, tehát a dolog csakis pozitív irányba változott. Azok a skinek nem a semmiből születnek, azokban munka van. A te munkádért is jár a fizetség... Így amit mondasz, azt telhetetlenségnek hívjuk, kár szépíteni.","replies":[]},{"poster":"Colonel Fluff","date":"2018-02-08T20:52:02.201+0000","up_votes":1,"down_votes":0,"body":"Körülbelül 25000 Ft értékben szereztem kozmetikai tartalmakat az elmúlt 3 évben (kinézetek, chromák, őrszem kinézetek, hangulatjelek, jelenleg 1000 narancssárga esszenciám van). Ikonokból 89-et szereztem, ami 250 RP-vel számolva körülbelül 33000 Ft-nak felelhet meg.\n\nSzerintem a Riot sok dolgot ad ingyen.","replies":[]},{"poster":"cigiszünet2p","date":"2018-02-08T19:55:05.816+0000","up_votes":1,"down_votes":0,"body":"Menj be bármilyen boltba és kezdj el rinyálni hogy de neked nincs pénzed adják oda neked ingyen az adott dolgot. Mit hiszel milyen világban élsz? Menj dolgozni tölts magadnak rp-t és lesz project ashe-d. Máshol sem adnak ingyen semmit, örülj hogy játszatsz ingyen.","replies":[]},{"poster":"Gresident","date":"2018-02-08T19:48:18.222+0000","up_votes":1,"down_votes":0,"body":"Szerintem pont eleget ad a riot, annyi, hogy kicsit jobban figyelembe vehetné a rendszer, hogy milyen hőseid vannak, és milyen hősökkel játszol.\nÍgy pl a sűrűn játszott karakterekre  nagyobb eséllyel adna skint. **Szerintem ezek az események is jók, lehetne több belőle.**\nA skineken kívül szinte minden ingyenes, igaz néha van + RP-ért plusz küldetés, de gyakorlatilag ebben ez ki is merül.\n\nPárját ritkítja, ahol valós pénzért játékbéli előnyre, nem tehetsz szert a többiekkel szemben. Illetve egyedül időt nyerhetsz....","replies":[]},{"poster":"Vasipari Béla","date":"2018-02-08T19:05:57.181+0000","up_votes":1,"down_votes":0,"body":"Ha a Riot nem csinál elég hasznot a LoLból, akkor jön Tencent bácsi, átveszi a kötvetlen irányítást és akkor jönnek majd még csak a mikrotranzakciók meg a paytowin!\n\nA mostani monetizáció még egész fair, mert főleg a kozmeikumok fájnak valós pénzbe -bár a hősök kékesszencia ára szerintem is kicsit magas. Valahol pénzt kell csinálnia a játéknak, gondolom ez nyilvánvaló.","replies":[{"poster":"GigaWarrior","date":"2018-02-08T19:12:54.238+0000","up_votes":1,"down_votes":0,"body":"Szia!\n\nHát igen, teljesen jó dolgokat mondasz!\n\nKöszönöm a hozzászólást!","replies":[]}]},{"poster":"The One ESCANOR","date":"2018-02-08T19:06:41.822+0000","up_votes":1,"down_votes":0,"body":"OP.GG szerint ez a 3. szezonod szóval közöd sincs a 4 évhez de oké...szerinted BL-ért kellene adni a skineket. Ezzel csak egy a baj, ez nem az a játék. CS:GO-ban sem kapsz ingyen egy Dragon Lore AWP skint, itt miért kellene ? Hextech barkácsolásból ha nem is minden 3. de 4-5. skin shardot ki tudod váltani az még így is 4-5. hetente új skin. De mivel szinte 2 havonta vannak event küldetések ahol mindig kitudsz szedni egy free skin shardot vagy többet.","replies":[{"poster":"GigaWarrior","date":"2018-02-08T19:10:28.935+0000","up_votes":1,"down_votes":0,"body":"Kémeid rosszúl jelentettek, mert lehet, hogy most 3. szezont látsz, de volt régebben is accountom, de mindegy.....\n\nÉrtem amit mondasz, teljesen jó gondolatok és köszönöm!","replies":[{"poster":"AsD The Dreamer","date":"2018-02-08T19:14:35.699+0000","up_votes":1,"down_votes":2,"body":"> Kémeid\n\n > OP.GG\n\nLmao nagyon paranoiás vagy öreg.","replies":[]}]}]}]}