{"poster":"U TRASH HAHAHA","date":"2016-10-13T12:42:04.000+0000","title":"Ist ARURF besser als URF?","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":0,"body":"Ist ARURF besser als URF oder sind sie beide gleich gut? Schauen wir mal die Fakten an. Die masse wollte mehr URF haben obwohl es nur zwei mal ihm Jahr kommen sollte, was es bereits kam. Jedoch hat Riot sich etwas ausgedacht um ihre zwei mal grenze zu umgehen, so durch bekamen wir ARURF. Die masse beschwerte sich oft dar&uuml;ber wie OP manche Champions in URF waren und diese wurden dauernd gespielt, dieses Problem wurde in ARURF versucht zu beheben, indem die Champions zuf&auml;llig ausgew&auml;hlt wurden und keiner die zu starken dauerhaft spielen kann.  Jedoch habe ich selbst erlebt, dass es fast immer die selben Champions waren die man erhalten hat und wen auch nur einer einen der OP Champions erhalten hat war das spiel schon entschieden. Es funktioniert nicht so ganz mit der ausgeglichenen Team st&auml;rke jedoch gab es diese in URF etwas indem alle die OP Champion gew&auml;hlt haben, was das spiel zu einem Schlachtfest gemacht hat und den Grund warum viele URF so lieben (mich eingeschlossen). Ich hoffe nur das ARURF nicht URF ersetzt sonder beide ihren eigenen platz im spiel haben, dass URF 2 man im Jahr kommt (oder &ouml;fter ich h&auml;tte nichts dagegen) und ARURF als Mitglied der Wochenendrotation z&auml;hlt. Zur&uuml;ck zur gro&szlig;en Frage ist ARURF besser als URF? Naja, dass m&uuml;sst ihr f&uuml;r euch Selbst entscheiden.                                   (meine Meinung ist nein. hust hust). Ich bin gespannt auf eure Meinung und die Begr&uuml;ndungen.","replies":[{"poster":"Noctibert","date":"2016-10-14T12:28:07.591+0000","up_votes":4,"down_votes":0,"body":"Ich fand ARURF besser, auch wenn ich vom Randomfaktor nicht viel gemerkt habe, da man sehr oft die gleichen Champs gesehen hat.\nWenn ARURF noch die Änderung hätte, dass dort wirklich all Random ist (also das man wirklich jeden Champ bekommen kann, unabhängig ob man ihn besitzt bzw er in der free Rota ist, oder nicht) dann wäre ich komplett zufrieden, so wären auch die ganzen \"ARAM Accs\" nutzlos.","replies":[]},{"poster":"Sirrkas","date":"2016-10-13T12:54:21.291+0000","up_votes":3,"down_votes":0,"body":"Von mir aus kann URF einmal im Jahr kommen. Der Modus ist aber für mich langweilig, wenn man mich durch die beliebten OP-Picks eben dazu zwingt selbst etwas wie Galio zu wählen, dass in dem Modus ein 1vs3 gewinnen kann. Es war durchaus mal lustig, mit Bard ein paar Runden zu spielen, aber nur dann eine Chance zu haben, wenn beide Seiten die stärksten Champions gebannt haben oder zufällig beide Seiten sich dazu entschlossen haben, nicht ganz zu starke Cahmpions zu wählen, ist dann doch eher ein Grund dafür das nicht zu spielen.","replies":[]},{"poster":"AmazingJX","date":"2016-10-20T19:43:58.294+0000","up_votes":2,"down_votes":1,"body":"Arurf ist der größte mist ist will rasieren und spaß haben mit dem Champion den ich spielen will und nicht den ich vorgeschrieben bekomme...","replies":[]},{"poster":"Maíko","date":"2016-10-13T13:19:32.206+0000","up_votes":1,"down_votes":1,"body":"> jedoch hat Riot sich etwas ausgedacht um ihre zwei mal grenze zu umgehen\n\nSie sagten sie werden es MINDESTENS 2 mal freischalten...somit gab es keine Grenze die sie umgehen müssten.\n\n>und wen auch nur einer einen der OP Champions erhalten hat war das spiel schon entschieden.\n\n{{champion:103}} {{champion:84}} {{champion:12}} {{champion:32}} {{champion:34}} {{champion:22}} {{champion:53}} {{champion:63}} {{champion:31}} {{champion:42}} {{champion:131}} {{champion:36}} {{champion:245}} {{champion:60}} {{champion:28}} {{champion:81}} {{champion:9}} {{champion:114}} {{champion:105}} {{champion:3}} {{champion:41}} {{champion:86}} {{champion:79}} {{champion:104}} {{champion:120}} {{champion:74}} {{champion:39}} {{champion:24}} {{champion:126}} {{champion:202}} {{champion:43}} {{champion:30}} {{champion:38}} {{champion:55}} {{champion:10}} {{champion:85}} {{champion:121}} {{champion:7}} {{champion:64}} {{champion:89}} {{champion:127}} {{champion:236}} {{champion:117}} {{champion:99}} {{champion:54}} {{champion:90}} {{champion:57}} {{champion:25}} {{champion:267}} {{champion:75}} {{champion:111}} {{champion:76}} {{champion:20}} {{champion:61}} {{champion:80}} {{champion:78}} {{champion:421}} {{champion:58}} {{champion:13}} {{champion:35}} {{champion:102}} {{champion:27}} {{champion:15}} {{champion:37}} {{champion:16}} {{champion:50}} {{champion:134}} {{champion:17}} {{champion:18}}{{champion:48}}  {{champion:23}} {{champion:4}} {{champion:29}} {{champion:110}} {{champion:67}} {{champion:45}} {{champion:161}} {{champion:112}} {{champion:62}} {{champion:101}} {{champion:5}} {{champion:83}} {{champion:238}} {{champion:115}} {{champion:26}} {{champion:143}} \n\nDas waren die Champions, wo ich mir dachte das sie extrem stark sind und mit denen man das Spiel carrien konnte...\nKeiner davon ist OP\n\n>indem alle die OP Champion gewählt haben\n\nDas Problem ist, dass die Leute nur gesehen haben \"Der Champion schlägt sich gut...der ist OP und den Pick ich jetzt immer\" und somit keine neuen Picks ausprobiert haben und der Modus somit eintönig geworden ist.\n\n\nIch finde ARURF bei weitem besser. Einfach aus dem Grund, weil ich in URF auch immer nur {{champion:28}} {{champion:236}} {{champion:103}} {{champion:105}} {{champion:3}} gepickt habe, weil ich dachte sie wären OP.\n\nUnd durch ARURF habe erst erkannt, dass eine Sivir jederzeit einen Fizz platt machen kann, dass ein Jhin easy alleine gegen einen Ziggs und einen Fiddlesticks lanen kann etc....\nIch bin ein großer Freund von Abwechslung und das gilt sowohl für die Champions die ich selber spiele, als auch für die Champions gegen die ich spiele.\nURF hat mir genau ein Wochenende lang Spaß gemacht...als es das zweite mal freigeschaltet wurde habe ich kein einziges mal mehr gespielt.\nMit den Random picks hat es mir endlich wieder Spaß gemacht und es wird wohl auch das einzige URF sein das ich in Zukunft spielen werde.","replies":[]}]}