{"poster":"maxlmantis","date":"2015-08-26T16:43:45.791+0000","title":"Acount entsperren bitte! Unban account pls!","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":13,"body":"~~Ich wurde f&uuml;r 14 Tage gebannt wegen nichts.\nIch habe weder etwas schlimmes gesagt, noch jemanden beleidigt oder irgendetwas getan das das Spielgeschehen behindert.\nRIOT muss ernsthaft &uuml;ber sein automatisches Bannsystem nachdenken.\nDas Tribunal bzw. Reportsystem ist pures Gift f&uuml;r jeden Spieler da es dazu verleitet jemanden wegen einem etwaigen \"Vergehen\" anzuschw&auml;rzen.\n\nIch spiele seit 2 Jahren League of Legends und mir ist von Anfang an aufgefallen wie massiv sich die Leute beleidigen, hassen und anschw&auml;rzen sich gegenseitig zu reporten.\nMehr als in jedem anderen Spiel.\n\nIch werde mich trotzdem nicht wie ein stumpfer, hirntoter Roboter verhalten, nicht nur \"gg\", \"wp\" schreiben, weil ich Angst habe aufgrund freier Meinungs&auml;u&szlig;erung \"angezeigt\" zu werden und mich auch weiterhin einem falschen System nicht beugen.\n\nEs ist mir völlig bewusst, dass besonders kommunikative Menschen wie ich, die mit dem Sprachtalent eines Winston Churchills gesegnet sind, eher selten sind und ich schaffe es natürlich sehr zu polarisieren.\n\nAllein schon diese primitive Attit&uuml;de: \"Oh, ich werde ihn zuerst reporten damit er mich nicht zuerst reported!\"\nAngst, Angst, Angst haben die Leute, nichts weiter. Angst ist unser gr&ouml;&szlig;ter Motivator.\nUnd diese Angst wird von dem System erzeugt.\n\nEs ist in meinen Augen eine typische LoL-\"Krankheit\" und die absolut &uuml;belste Community von allen Onlinespielen die ich je gespielt habe.\nEin gemeinschaftliches Miteinander kann in diesem Spiel kaum vorgefunden werden und sogar beste Freunde fangen an sich gegenseitig für ihre Fehler anzugiften.\n\nIch sage dann zwar immer: \"Relaxt doch mal alle!\" Aber das wollen Menschen die durch das Tribunal in diese niederträchtigen Verhaltensweisen gezwungen werden dann auch nicht mehr realisieren. Ich finde es schade, dass es in LoL so schlimm mit den Leuten ist. Wirklich schade!\n\nDas Tribunal fordert geradezu dazu auf jemanden wegen einem etwaigen \"Vergehen\" anzuzeigen. Ich bezeichne das oft wie ein System in einer Nazi-Diktatur wo man versucht Leute aufgrund ihrer Meinung und Ansichten zu denunzieren.\nIch finde es &uuml;bel und falsch die Spieler in eine Richtung zu dr&auml;ngen in der sie sich hassen und versuchen Fehler an den anderen zu finden, Gr&uuml;nde zu finden jemanden zu reporten.\n\nDas ist einfach nur kaputt und hat rein gar nichts mit einer \"Competition\" zu tun.\nEs entsteht nichts ausser Feindlichkeit durch das Tribunalsystem und dass so und so viele Spieler ihr Verhalten ge&auml;ndert haben ist eine gro&szlig;z&uuml;gig ausgelegte Fehldarstellung, denn die gebannten Spieler erstellen sich einfach einen neuen Account.\n\nIch habe mir dann auch einen neuen Account gemacht, da ich mir nicht meinen Spielspa&szlig; durch das Tribunal und Hater verderben lasse. Beim Spielen mit anderen Spielern kommunizierte ich mit ihnen und habe sie gefragt ob sie auch schon einmal gebannt wurden, dann kam oft ein: \"I was banned because i raged about trolls\" von den Leuten zur&uuml;ck.\nEs geht also nicht nur mir so.\n\nBeim Neuanfang mit meinem Zweitaccount ist mir gleich im ersten Spiel folgendes aufgefallen:\nEin Spieler beschwerte sich über einen \"ks\", dieser Spieler war offensichtlich neu und hat noch nicht verstanden, dass es einen \"ks\" in Lol in diesem Sinne nicht gibt, außer man wäre ein Supporter der intensiv versucht Gegner vor den eigenen Teammates zu \"töten\".\nDieser Spieler sagte dann noch \"Easy! :D\" und hat sich offensichtlich über seinen Erfolg gefreut, was aber laut den Bestimmungen dieses entsetzlichen Tribunals ein Regelverstoß wäre und \"reportbar\".\nIch denke, jedem Leser sollte spätestens jetzt auffallen, dass das Tribunal selbst den Spielern schadet und nicht die Spieler sich gegenseitig.\n\nIch muss auch kein Politiker, Jurist, Psychologe oder Spieledesigner sein um jedem Betrachter nachvollziehbar zu vermitteln, dass das LoL-Tribunal selbst der Schwachpunkt ist, und nicht der Spieler.\n\nMan wird gebannt wenn man den Spielern sagt, dass sie sich NICHT hassen sollen, dass sie NICHT trollen sollen, NICHT das Spielgeschehen durch ihr Fehlverhalten zerst&ouml;ren sollen. Und dafür wird man auch noch gedisst.\n\nDie Spieler wissen aber oft gar nicht in was f&uuml;r einer Denkspirale sie sich da eigentlich befinden, in welch unterschwelliges Energieniveau sie durch dieses menschenunw&uuml;rdige Bansystem gedr&auml;ngt werden, sie reporten sich und hassen sich ohne genau zu wissen was sie da eigentlich tun. Fast schon NWO-Like.\n\nWir k&ouml;nnten in einer Welt ohne Mord leben, aber Polizei, Staat und Gerichtsbarkeit brauchen schlie&szlig;lich auch etwas zu tun, ausserdem kann man Sicherheitsysteme, Waffen und Milit&auml;r verkaufen wenn sich Leute gegenseitig aufgrund ihrer Kultur oder Ethnizit&auml;t hassen und umbringen.\nDas System ern&auml;hrt sich von Subkulturen, Rassismus, Terrorismus, Hass und Gewalt.\n\nUnd genauso funktioniert das LoL-Reportsystem, es ist nur darauf ausgelegt, dass Spieler sich anfeinden und nicht zur Verbesserung des Spiels geeignet.\n\nAllein die gro&szlig;e Anzahl der m&ouml;glichen Reportgr&uuml;nde zeigt doch schon das hier ein gravierender Fehler vorliegt.\nDie Liste ist viel zu lang und f&uuml;r einen Report sehr einladend.\nNehmen wir zur Vereinfachung nur vier von x Beispielen die es erm&ouml;glichen einen Spieler \"anzuzeigen\":\n1. Jemand ist ein schlechter Spieler, was nichts bedeutet, da man auch mal schlecht drauf sein kann.\n2. Jemand sagt mal eine Beleidigung, was in einem Onlinespiel kein Verbrechen ist.\n3. Jemand ist unkommunikativ, was nichts &uuml;ber einen Spieler aussagt und nur eine Momentaufnahme sein kann.\n4. Brennt dann auch noch der Topf auf dem Herd und man ist AFK und dann wird eine x-beliebige Person f&uuml;r 14 Tage gebannt, ohne jegliche Vorwarnung?\n\nAchtung: Diese Person kann jede Person sein.\n\nEs ist aber nicht abgrundtief schlecht jemanden einen \"Noob\" oder \"mad\" zu nennen, das ist auch nicht b&ouml;se und hundsmiserabel gemein...\nEs ist einfach nur ein Onlinegame in dem jeder Spa&szlig; haben m&ouml;chte und so ein \"Noobcalling\" kann auch mal aus purem Jux entstehen.\nSowas ist in einem Onlinespiel absolut &uuml;blich und in keinster Weise \"bannw&uuml;rdig\".\n\nEin automatisches Bannsystem anhand eines vorgefertigten Chatfilters ist falsch, dem Spieler / Konsumenten unw&uuml;rdig, traurig, zutiefst besch&auml;mend und der beste Beweis daf&uuml;r, dass wir Menschen uns niemals von Maschinen abh&auml;ngig machen sollten. Kurzer Verweis -> Matrix Trilogie.^^\n\nWer w&auml;ren wir denn wenn wir uns von Maschinen abh&auml;ngig machen? Dann k&ouml;nnten wir uns gleich alle eine automatische Selbstschussanlage installieren die Menschen anhand eines \"Filters\" erschiesst.\n\nSorry, f&uuml;r den Sarkasmus aber ich versuche diesem traurigen, menschengemachten Fehler namens \"Tribunal\" doch noch etwas positives abzugewinnen!\n\nEs w&auml;re einfach sch&ouml;n im Spiel zu erleben wie sich Menschen konstruktiv beteiligen und sich nicht gegenseitig mies machen. Denn ich bin ein Mensch der sein Team mitziehen kann aber selbst dabei muss man Angst haben wenn man jemanden pushen will kann man die Dinge auch mal so ausdr&uuml;cken, dass sie etwas harsch klingen was aber auch in keinster Weise einen Bann rechtfertigt.\n\nIn keinem anderen Onlinespiel gibt es diese gro&szlig;e H&auml;ufigkeit von niederschwelligem Geflame und Gehasse.\n\nIn manchen Spielen sind 64 Leute gleichzeitig auf einem Server und KEINER sagt ein dummes Wort, vielleicht mal \"stfu\" oder \"fu\".\nAber das war`s dann auch schon und keiner regt sich gro&szlig;artig dar&uuml;ber auf.\nNur in LoL herrscht diese &uuml;bertriebene unterschwellige Hasserei und das ist toxisch f&uuml;r den Spieler und das Spiel.\n\nMeine Meinung ist, dass Riot unbedingt etwas tun muss + diese protesthafte AFK-Geherei von Menschen mit geringer Frustrationstoleranz vermeiden indem man Bots f&uuml;r AFK einsetzt oder eben ein Voting gestartet wird wo das andere Team einen Spieler abgeben muss, so dass wieder Teamgleichheit besteht.\n\nEs ist ein Schaden an den Spielern und wenn man sich beschwert wird einem gesagt, dass man zwar Geld zahlt sich aber nur eine \"Lizenz\" ausleiht...\n\nEs ist grotesk und verwerflich die Spieler absichtlich in ein gegenseitiges Hassen, Anfeinden und Denunzieren zu dr&auml;ngen.\n\nDas Problem liegt somit an Riots System, wenn man Riot um eine Stellungnahme bittet bekommt man nur eine stupide zusammenhangslose Mail, dass ja alles in der FAQ beantwortet w&auml;re. Dem ist aber nicht so!\n\nM&ouml;glichkeiten ein positives Spielerlebnis zu gestalten gibt es genug und ich sehe es nicht ein ein Knecht von Riots System zu sein.\nErbarmungsw&uuml;rdige Sklaven des Reportsystems w&uuml;rden sicher weiter versuchen an allem M&ouml;glichen einen Grund finden jemanden zu reporten.\nGenau da liegt ja auch der springende Punkt.\n\nIhr wollt ein Chatlog haben? Es ist mir einfach nur peinlich, aber ok:\n\n\"yi its so bad to see u dead all the time, u make your team lose, its toxic for LoL community what u with your trolling STOP IT\"\n\nHier ist der Link zu dem Chatlog:\nhttp://link.email.riotgames.com/YesConnect/HtmlMessagePreview?a=kiCT_etp7RqO3NWtqm0ZV_WT&msgVersion=web\n\nErst sagt Master Yi, dass ich im Real Life sterben soll und meine ganze Familie an Krebs verrecken, und dass er es wirklich ernst meint und einen Fick darauf gibt. Das waren die Worte des Pre-Chats, ok. Ich habe dann Yi gemuted und ihm das mitgeteilt, damit er mich nicht weiter stalkt.\n(Yi hat mich mit Freundschaftsanfragen und Listenanfragen zugebombt, bel&auml;stigt und beleidigt.)\nDann war ich in der Mitte, und Yi hat einfach neben mir gestanden als ich ihn bat zu \"ganken\", dann hat er sich zur&uuml;ckgeportet, und st&auml;ndig dummes Zeug geschrieben.\nAuch ein weiterer Fehler des Reportsystems, dass gar nichts von ihm dabei steht sondern nur das von mir kopiert ist, was eine einseitige und aus dem Zusammenhang gegriffene Sichtweise erzeugt.\nDann wird von meiner Seite weder beleidigt noch dazu aufgefordert irgendetwas falsches zu tun und das Spiel weiter zu behindern, sondern ich schreibe einfach nur im beobachtenden Stil wie ich Yi`s Verhalten empfinde.\nIch fordere also Master Yi dazu auf sein Verhalten zu unterlassen, ohne ihn dabei zu beleidigen.\nUnser Team wurde von Master Yi st&auml;ndig nur getrollt.\nUnd andere Teammitglieder haben auch einen Frust deswegen bekommen.\nIch \"drohe\" nicht mit Bann, Yi hat mich massiv beleidigt was laut dem derzeitigen Reportsystem einen Bann wert ist und das bringe ich zum Ausdruck.\nIch sage sogar noch zu Anfang, dass ich ihn mute um etwaigen weiterem Streit aus dem Weg zu gehen.\nMan muss da auch nicht mit nem Rotstift dran gehen. Das w&auml;re einfach nur kleinlich und l&auml;cherlich. Aber genau macht das Tribunal mit uns Spielern. Es macht uns zu kleingeistigen, erbarmungsw&uuml;rdigen Sklaven. Und ich sehe es nicht ein mich dem zu beugen und mich in dem Recht einer freien Meinungs&auml;u&szlig;erung beschneiden zu lassen.\n\nSo, und wo ist da jetzt eine Begr&uuml;ndung mich f&uuml;r 14 Tage zu bannen?\nEs ist einfach unglaublich das ihr wirklich wegen sowas bannt. Es ist unfassbar!\nDann m&uuml;sst ihr in 80% der Spiele bannen da in jedem Spiel solche und schlimmeren Vorf&auml;lle zustande kommen k&ouml;nnen.\nJeder Mensch auf dieser Erde ist in der Lage w&uuml;tend zu werden wenn man so extrem getrollt wird.\n\nUnd wisst ihr was? Ich bin ein total relaxter Mensch aber das kann ich anscheinend kaum von meinen Gegen&uuml;bern erwarten.\nDas liegt dann wieder an deren Erziehung und es gibt Menschen die kaum interpretieren k&ouml;nnen was man ihnen sagt da sie unter Bedeutungsverschiebung und Kritikunf&auml;higkeit leiden aber das geht schon in Richtung Pers&ouml;nlichkeitsst&ouml;rung und w&uuml;rde jetzt zu weit f&uuml;r einen ordin&auml;ren Forumthread gehen. :)\n\nUnd ich bin ein extrem guter Spieler, zwinge Gegner oft genug zur Aufgabe und gewinne 4v5`s.\nWenn ich meinen Blitzcrank, Warwick, Sion oder Lee Sin auspacke ist alles vorbei und 7 x Insec mit Lee Sin in einem Spiel gehen dann schon mal klar.\nEin blinder M&ouml;nch, ja, aber kein blinder Spieler!\nAls Jungler z.B. ganke ich permanent, mit Warwick auch vor Level 6, ohne darauf zu achten ob ich jetzt geflamed werde, da ich genau wei&szlig;, dass jemand auch mal einen schlechten Tag haben kann.\nDinge wie \"i will not gank your lane\" sind einfach nur kindisch und spielbehindernd und werden von mir nie zu h&ouml;ren sein.\nIch bin in der Lage ein Team in dem mindestens 3 solcher Trolls zugegen sind mitzuziehen, aber in diesem Fall hatte ich einfach keine Lust.\nEs ist auch nicht meine Aufgabe st&auml;ndig f&uuml;r andere mitzudenken.\n\nIch glaube, dass das ganze Tribunalsystem grundsätzlich die mentalen Kräfte der meisten Spieler völlig überfordert und Spieler die ihr Team pushen und hiflreich sind werden genauso gebannt wie welche die neu in dem Spiel sind und vor lauter\n\nIch bin mir sogar sicher, dass im deutschsprachigen Raum mehr gebannt wird als im englischen da die Spieler aus Unverst&auml;ndnis Dinge die gesagt werden bem&auml;ngeln da auf englisch (einer Fremdsprache f&uuml;r die meisten) geschrieben wird und ob das jetzt Sarkasmus, englischer schwarzer Humor ist oder nicht kann der gew&ouml;hnliche, ungebildete Spieler oft nicht so genau sagen und kaum richtig bewerten.\n\nUnd dass ich das alles hier noch erkl&auml;ren muss, ist m&uuml;hselig und zeigt wie schlecht dieses Reportsystem ist und wie kaputt es das Spielerleben wirklich macht.\nSoviel Zeit muss ich dazu verschwenden das alles hier aufzudr&ouml;seln und darzustellen wie vor einem Gericht weil Riot nicht in der Lage ist seinen Spielern ein positives Spielerlebnis anzubieten bzw. einen Ansprechpartner f&uuml;r solche Probleme zu stellen um unn&ouml;tige Diskussionen mit \"Mods\" zu vermeiden, welche den vorherigen Thread gel&ouml;scht haben, da ich nicht binnen eines halben Tages einen Chatlog hinzugef&uuml;gt habe (was in der Onlinewelt bei einer Zeitverschiebung von ca. 1-2 Sekunden nach Erstellen des Threads wohl wirklich nicht gegen die Forenregeln ist, man k&ouml;nnte mich ja dazu auffordern aber nein, gleich l&ouml;schen) und die damit verbundene Diskussion ist leider verloren gegangen und dem Willen des Systems, eine wirklich hintergr&uuml;ndige Diskussion in der Gesellschaft zu vermeiden, wurde entsprochen.\n\nDas finde ich pers&ouml;nlich sehr schade, da einige Leute soviel gehasst haben, dass es einfach interessant gewesen w&auml;re, all diese ganzen hasserf&uuml;llten, zusammenhangslosen Beitr&auml;ge im Kontext zu meinem Schriftst&uuml;ck zu lesen um noch besser zu verdeutlichen wie schlecht dieses Reportsystem wirklich ist und was es genau mit den Menschen anrichtet.\n\nIch w&uuml;rde dem derzeit g&uuml;ltigen Reportsystem sogar eine Beschneidung der Redefreiheit vorwerfen.\nAber so ist das nunmal. Uns wird nur vorgegaukelt, dass wir in einer \"Demokratie\" leben.\n\nIch w&uuml;nsche mir auch, dass das Ganze objektiv betrachtet wird und nicht mit infantilem Geg&auml;ngel sondern nur mit konstruktiver Kritik kommentiert wird\n\n\"to be edited...\"~~","replies":[{"poster":"drexxsack","date":"2015-08-26T16:53:08.794+0000","up_votes":2,"down_votes":0,"body":"du hast bereits ein Thema damit offen, deine Fragen wurden dort bereits beantwortet. Möchtest du deine Diskussion fortsetzen, tue das bitte dort.\n\nhttp://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/rvAAAKdi-lols-kaputtes-automatisches-bannsystem-hat-meinen-account-gesperrt-bitte-account-entsperren","replies":[]},{"poster":"Phobos Selini","date":"2015-08-26T16:51:41.355+0000","up_votes":2,"down_votes":0,"body":"lol, jetzt hat er seine Wall of Text einfach nochmal kopiert?","replies":[]},{"poster":"HansMowlWurf","date":"2015-08-26T16:50:48.792+0000","up_votes":3,"down_votes":1,"body":"Dein ban ist gerechtfertigt und wird nicht aufgehoben, raff das doch endlich.","replies":[]},{"poster":"Der Großmugister","date":"2015-08-26T16:48:53.743+0000","up_votes":3,"down_votes":1,"body":"Kannst du mal bitte aufhören immer wieder diese Posts zu verfassen?!\nzugegeben, ich hab Diesen jetzt nicht gelsen, aber es ist ja auch schließlich schon dein Dritter in unter 24h!!!\nDer Bann wird dadurch nicht unverdienter und du auch leider nicht einsichtiger, geschweige denn, ein besserer Mensch/Spieler.","replies":[]}]}