{"poster":"MatjesVIP","date":"2018-01-17T21:38:25.457+0000","title":"7/3 Placements und trotzdem Bronze 5!","subforum":"Client Diskussion","up_votes":1,"down_votes":1,"body":"Hallo liebe Community, \r\nIch m&ouml;chte mich wie wahrscheinlich sehr viele andere Spieler &uuml;ber das Ranked System beschweren und es in frage Stellen! \r\nKurz zu uns wir haben letztes Season Hardstuck in Bronze 3 und 2 gespielt und hatten aber eine silber bis Gold MMR, gingen mit gro&szlig;er Motivation und Hoffnung in die neue Season und Platzierungsspiele! \r\nMein premate und ich haben von 10 spielen 7  erfolgreich abgeschlossen und das nicht nur etwa so, sondern das ganze Team an die Siege gef&uuml;hrt! Ich Habe meine spiele alle mit shyvana und mein Kumpel und Ahri gespielt! \r\nWir haben die spiele mit einer verdammt guten Spielbeteiligung gewonnen! (durchschn. 10/3/7)\r\nUnd dennoch kommen wir vergleichbar mit anderen Bronze 4 Spieler die nur 2 oder 3 gewonnen und sonst nur feeden oder Trollen in die selbe Elo? \r\nDa frage ich mich ehrlich wo der Sinn in der ganzen Sache ist? \r\nErwartet haben wir Bronze 2 oder 1 aber dennoch so schlecht und unter unserer Spielweise platziert zu werden wirft viele Fragen auf! \r\nIch bin der festen &Uuml;berzeugung das man da gr&uuml;ndlich man etwas &uuml;berlegen sollte und das ganze System mal gewaltig &uuml;berarbeiten sollte, denn so macht das ganze n&auml;mlich keinen Sinn und nimmt s&auml;mtlichen Spielern, den es genauso geht, den Spa&szlig; und die Motivation!\r\nSomit geht meine Frage raus an die Community ob da wirklich was ge&auml;ndert werden sollte, denn jeder wei&szlig; das man aus Bronze nicht mehr so leicht raus kommt, egal wie man spielt ! \r\nIch bitte euch einfach das ganze mal zu &uuml;berdenken Riot!\r\n\r\n\r\nVerfasst von OrgienOlaf\r\n\r\nMfg MatjesVIP","replies":[{"poster":"G2 Jev","date":"2018-01-18T10:41:22.046+0000","up_votes":2,"down_votes":0,"body":"Du warst vor dem Reset Bronze 5. Wunder dich bitte nicht das du jetzt wieder Bronze 5 bist.","replies":[]},{"poster":"HenteiNudeI","date":"2018-03-26T04:54:05.913+0000","up_votes":1,"down_votes":0,"body":"du kommst aus bronze richtig einfach raus XD\nSieh einfach mal ein dass du fehler machst(sonst wärst du challenger)und arbeite an dir und deinem Spielstil\nguck dir videos an die dir splitpushen, traden etc erklären und denk nicht dass du alles kannst und verstehst \nNur wenn du selbst kritisch auf deine aktionen im spiel guckst wirst du besser.","replies":[]},{"poster":"Veezey","date":"2018-01-18T19:03:56.168+0000","up_votes":1,"down_votes":0,"body":"Ich hab auf meinem SMurf 2 von 10 Games gewonnen und bin von B1 auf B2 gedroppt. höhö","replies":[]},{"poster":"Megamaexx","date":"2018-01-18T07:34:28.923+0000","up_votes":1,"down_votes":0,"body":"> Ich Habe meine spiele alle mit shyvana und mein Kumpel und Ahri gespielt!\n\nAccount-Sharing betrieben? Denn dein Account hat Ahri-Spiele und der deines Mates hat Shyvana-Spiele.\nÜbrigens, wenn du letzte Season hardstuck Bronze 2/3 warst, war das wohl deine wahre Liga. Damit du diese Season wieder aufsteigen kannst, wirst du niedriger eingestuft. Da man auch mit einer Winrate von 49% tendenziell aufsteigt, bewirkt dieser Reset eben keine Inflation der Elo.","replies":[]},{"poster":"Kumbais Princess","date":"2018-01-18T07:09:48.539+0000","up_votes":1,"down_votes":0,"body":"Hi\nhttp://euw.op.gg/summoner/userName=MatjesVIP\n\nGold MMR?\nAuf op.gg steht du hättest eine Bronze 4 MMR.\nDas Ranked-System ist gut so wie es ist!\nIch verstehe nicht warum du grundlos rumheulst -.-\n\nWie selbst Faker sagte wenn du climben willst, spiel besser!\nBye","replies":[]},{"poster":"Oriius","date":"2018-01-18T04:45:36.593+0000","up_votes":1,"down_votes":0,"body":"die Placements finde ich ehrlich gesagt gar nicht sooooooo schlimm.  die Rangverteilung war bisher bei mir immer sehr fair. B5 halte ich sogar für verständlich wenn  du vorher hardstuck in B3/2 warst.  wenn du aber wirklich eine Gold-MMR haben solltest wirst du wesentlich mehr lp gewinnen als verlieren also sollte es auch nicht schwer sein raus zu kommen. ich persönlich kann zwar verstehen das es schwierig sein kann da ich das selber kenne wenn leute instant afk gehen usw aber dafür gewinn ich auch nahezu jedes Game wo ein 5v5 herrscht. (zum glück sonst wäre meine winrate vermutlich bei ~20%??) wenn du Gold MMR besitzt und hardstuck bronze bist solltest du vielleicht mehr Spiele verlieren damit die Gegner leichter werden denn wenn du eine dementsprechende MMR hast bekommst du auch dementsprechend Goldgegner , sollte es also nicht möglich sein dann aus Bronze zu kommen dürften die Gegner zu schwer für dich sein oder du hast unlucky Mates.","replies":[]},{"poster":"Amycos Cyrus","date":"2018-01-18T00:06:44.062+0000","up_votes":1,"down_votes":0,"body":"Englische Erklärung, mit genaueren Werten\nhttps://boards.euw.leagueoflegends.com/en/c/champions-gameplay-en/ONXtEyFR-estimated-mmr-values-of-each-and-every-division-placements-explained\n\nDeutsche Erklärung mit etwas seltsamen Abweichungen\nhttps://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/IqBzFyO9-der-informationsthread-aber-ligen-mmr-und-hidden-elo\n\nIm Grunde genommen ist es nicht einmal unmöglich mit 10 Siegen B5 zu werden, wenn man zum Season-Ende B5 war","replies":[]},{"poster":"Rudeltreiber","date":"2018-01-17T23:29:34.363+0000","up_votes":1,"down_votes":0,"body":"Im Endeffekt wird die MMR nicht zurückgesetzt zu Beginn der Season. Du steigst immer schlechter ein, als in der letzten Season standest. Im BESTEN Fall wärst du direkt in deiner alten Elo gelandet, bekommst jetzt, durch gute Placements (7-3), direkt gute Punkte für Siege und verlierst weniger bei Niederlagen.\n\nIst also ganz normal, du kommst da im Endeffekt nur raus, indem du dich rausspielst.","replies":[]},{"poster":"MeMyselfandBaal","date":"2018-01-17T23:21:51.059+0000","up_votes":1,"down_votes":0,"body":"Du hattest eine Gold MMR? Ich frage das mal direkt: In welcher Que?\n\nAber ja, es wird so gut wie jeder nach den Placements Ligen verlieren. Damit muss man sich abfinden. Dafür gibt es danach dann mehr LP pro Sieg als man bei einer Niederlage verliert. \nDeswegen sagen deine Placements auch absolut nichts über deinen relevanten Rang aus. Mach erst Mal 100 Ranked Games und gucke dann, ob du dich im Vergleich zur Vorsaison verbessert oder verschlechtert hast. Dann wird das Ranking langsam aktuell...","replies":[]},{"poster":"Guacamoley","date":"2018-01-17T22:48:35.224+0000","up_votes":1,"down_votes":1,"body":"Ja da musst aber eins bedenken. Alle werden abgestuft. Es mag zwar sein das du im vgl zum 0815 Bronze gut bist aber von Gold Spielern trdm kassierst. Allein wenn ich deine Builds ansehe wirken diese sehr merkwürdig. Und du wirst generell nicht in einer höheren Liga eingestuft, als du zuvor warst. Du warst hardstuck Bronze sagst du, dann hast du aber keine Gold MMR. Ja, es ist doof das du jz B5 eingestuft wirst bei 7 Eins aber es kommt immer auf deinen Rang in S7 Preseason und Promovierte an. Wenn du nur gegen Bronze/silber gewinnst kannst du nicht erwarten in eine hohe Elo eingestuft zu werden. B5 ist dennoch ziemlich hart.","replies":[]}]}