{"poster":"WolfPower112","date":"2016-09-20T07:55:52.108+0000","title":"Keyboard issues","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hi guys I wonder if you have the same problem, so here it is baiscly.\r\n\r\nI enter a game, everything works fine, but from time to time my Y button stops working (tabbing sometimes fixes this for a couple of minutes) from time to time randomly also sometimes none of my keys work except for enter and my clicks spawn pings.\r\n\r\nThis bug is very annoying and I*m positive is not my keyboard.\r\n\r\nThanks in advance@{{summoner:31}}","replies":[{"poster":"Porocles","date":"2016-09-20T16:46:11.798+0000","up_votes":1,"down_votes":0,"body":"It sounds strange that some of your bindings stop functioning, and it could be happening for a few reasons.  As a first step, your best bet would be to swap your keyboard to rule out if that's actually the issue or not.  This can also happen if you made any modifications to the game or have a corrupt config file.  Try resetting the config folder to default per our [keyboard and mouse ](https://support.riotgames.com/hc/en-us/articles/201761934-Mouse-and-Keyboard-Issues)guide:\n\n **Log into the game** then hop into **a custom game**. *Alt+Tab* out of the match, then navigate to your League installation folder, which should be in C:\\Riot Games\\League of Legends\n\nDelete the folder named **Config**\nt\nOnce you've deleted the folder, leave the custom match. You'll then want to hop into another custom match to confirm the changes were saved.\n\nHopefully that helps, but let me know!","replies":[{"poster":"WolfPower112","date":"2016-09-21T13:13:07.294+0000","up_votes":1,"down_votes":0,"body":"I allready tried that. Unistalling the game does not solve the problem. The keyboard is no the issue.\nIt is weird because it seems to get worse when the pc is overheating, and my keys work perfectly in an other game\n\nI really hope I can solve this{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Porocles","date":"2016-09-21T17:54:36.426+0000","up_votes":1,"down_votes":0,"body":"We'd like to look further into this.  Reach out to us in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) so we can see what's going on!  You can also download the [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) to acquire a set of logs for context. We will respond to the ticket as soon as we can!","replies":[]}]}]}]}