{"poster":"insonniaIT","date":"2015-09-24T15:51:05.784+0000","title":"MALUS 5 PARTITE DA 20 MINUTI","subforum":"Discussioni generali","up_votes":1,"down_votes":6,"body":"Sinceramente mi sembra una punizione un po troppo severa fare 5 partite con un malus da 20 minuti, per una partita che sei stato afk, magari neanche volontariamente, credo che sarebbe di migliore aiuto mettere magari 3 malus da 5 minuti visto che, se metti 20 minuti di malus il 30% delle persone lascia il game mentre i restanti nell&#039;attesa fanno altro, quindi direi di accorciare i tempi giusto come punizione minima visto che mi sembra troppo aspettare un ora e quaranta minuti per riprendere a giocare normalmente.\r\nditemi cosa ne pensata..\r\nUn malus da 20 minuti per 5 partite sinceramente &egrave; troppo","replies":[{"poster":"Ringiel","date":"2015-09-24T15:57:16.086+0000","up_votes":4,"down_votes":0,"body":"non ti viene dato solo per una partita,probabilmente non era la prima volta che andavi afk.","replies":[]},{"poster":"Sìrjohn","date":"2015-09-24T16:23:00.347+0000","up_votes":3,"down_votes":0,"body":">  quindi direi di accorciare i tempi giusto come punizione minima visto che mi sembra troppo aspettare un ora e quaranta minuti per riprendere a giocare normalmente.\n\nMa si io direi pure di far uscire subito di galera Olindo e Rosa, Pacciani e Totò Rina, perché mi sembrano troppi 30 anni di carcere  per tornare in libertà.\n\nSei un afk recidivo amico, ai 20 minuti ci si arriva dopo parecchie leave........ no bugie pls.\n\nUn saluto","replies":[]},{"poster":"Nabbomaster","date":"2015-09-24T16:56:47.754+0000","up_votes":2,"down_votes":1,"body":"20 minuti di ban per 5 partite per essere andato solo una volta afk?\nahahahah\ncerto e io sono il papa\nquindi pentiti peccatore","replies":[]},{"poster":"BrattishSolid6","date":"2015-09-25T19:01:54.255+0000","up_votes":1,"down_votes":0,"body":"La prima punizione che danno è una coda a bassa priorità da 10 minuti, e la prendi dopo almeno 4/5 volte che vai afk in tempi brevi. Io stesso mi sono beccato una coda del genere perché in due giorni mi era crashata la connessione 4/5 volte. Ebbene, punizione più che giusta. Non importa più di tanto il volontario/involontario. O meglio, il fatto che sia involontaria non toglie il fatto che sia un fattore negativo per i tuoi compagni di squadra.\nIn ogni caso, per 20 minuti di coda non è la prima volta che vai afk. E non è la prima volta che prendi una punizione per afk. \n\nConsiglio spassionato: inizia la coda e mettiti una sveglia. Davvero, è l'unico modo. Oppure prenditi una giornata e fai coop, in 10/15 minuti le partite effettive le finisci","replies":[]}]}