{"poster":"Frànklin","date":"2014-12-28T05:02:46.448+0000","title":"Support Tickets","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"So, for christmas, I got a gift card for $50, and for the first time I would be using it to purchase RP. As anybody would, I got extremely excited to buy all the poppy and urgot skins out there (Just kidding). Anyways, I tried to purchase $35 of RP, but didn't get it and also got charged. I made a support ticket and was redirected to the \"Billing Support Team\", and it's already been a week. Does it usually take this long and is there another way to contact riot?\r\n\r\nThanks, and happy holidays!","replies":[{"poster":"Hollymonster","date":"2014-12-28T17:27:05.329+0000","up_votes":3,"down_votes":0,"body":"I know that it can feel like a long time when you're waiting for something you should have gotten, but your ticket was submitted less than 3 days ago (~60 hours.)\n\nWe are still catching up with the RP card redemption issues that happened Christmas day, but your ticket is in our queue and we're working to get everyones issues solved as soon as possible.  If you miss any sales or anything because of these issues you can always let us know in the ticket and we can help you out.\n\nResolution time is actually slower for you because you didn't include all of your account information when you submitted your ticket.  When writing into support for any company, you should always provide as much detail as possible to expedite your request.","replies":[]},{"poster":"TheYordleParade","date":"2015-04-11T01:44:42.217+0000","up_votes":1,"down_votes":0,"body":"I've been having trouble with my ticket as well, a few days now since it was transferred over to Billing/Support Team, I've given them all the information they asked for, even did some proactive tasks as well as checking daily if it is and ongoing issue. It just seems to be a void where tickets go to die. Because before hand I was getting a reply at least daily, but now... Yeah.\n\nI'm just looking to redeem a pre-paid card, that's all.\n\nEdit: I heard back, four days later, only to ask for some more info. Okay, but not handy. We'll see what happens.","replies":[]}]}