{"poster":"Arthurio","date":"2015-02-04T03:51:41.640+0000","title":"Estan baneando sin razon? o ya no dan razones visibles para los usuarios?","subforum":"Problemas Técnicos","up_votes":8,"down_votes":4,"body":"lo que me interesa saber es la verdadera razón de por que banearon esta cuenta..solo llega un correo que violaron los términos de servicio. pero cuales? TODOS? podrían ser mas específicos. yo apelo por la cuenta de un amigo \"eLxchemiii\" que es un buen jugador. y solo juega con amigos(yo soy unos de ellos) y nunca a sido un jugador violento como otras a los cuales si deberían banear. ademas que le dan un ban indefinido \"hasta el Sun Feb 22 22:22:22 PST 2201.\" que fecha es esa O.O. aparte en el correo dice \"Si tienes alguna pregunta, no dudes en ponerte en contacto con nosotros en support@riotgames.com.\" pero solo te dan las gracias y que tarde o temprano un  ejecutivo le respondera el mensaje... y a esperar a que pase algo. pero no pasa nada. quiero claridad y la quiero pronto. ya no solo hay que soportar los insultos de gente inconciente si no que tambien hay que ver y aguantar como banean a la gente incorrecta : ).adjunto el correo del ban.\r\n\r\nUn saludo desde los campos de justicia.\r\n\r\n\" Ciertas acciones realizadas con tu cuenta violan los Términos de Servicio de League of Legends. Puedes ver dichos términos en http://lan.leagueoflegends.com/es/legal/termsofuse\r\n\r\nDebido a la gravedad de la violación, tu cuenta de League of Legends ha sido bloqueada hasta el Sun Feb 22 22:22:22 PST 2201.\r\n\r\nSi tienes alguna pregunta, no dudes en ponerte en contacto con nosotros en support@riotgames.com.\r\n\r\nUn cordial saludo,\r\nServicio de Soporte al Jugador de Riot Games\"","replies":[{"poster":"Junaeb","date":"2015-02-04T05:49:01.543+0000","up_votes":1,"down_votes":5,"body":"Querido Riot, Mejor preocúpate de banear a gente que trolea en las rankeds, a los niños ratas entre otros, no hacen nada al respecto, y que pasa con la gente que eloboostea?, nada ps solo le CAGAN las ranked a los demás, respecto a este tema yo creo que debieran dar mas respuestas ya que no esta claro porque fue baneada, y bueno si fue baneada por x razón lo entenderemos Gracias.","replies":[{"poster":"LordHarek","date":"2015-02-04T13:03:16.792+0000","up_votes":2,"down_votes":0,"body":"Se estan baneando a los trolls, elobooster, etc. aca te dejo un thread.\n\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/AomIpONY-oleada-semanal-de-suspensiones-2-de-febrero\n\nAhi mismo veras como se quejan de que fueron baneados y también como les cierran la boca.\n\nSaludos.","replies":[{"poster":"Riot Cacharpas","date":"2015-02-04T23:25:35.947+0000","up_votes":5,"down_votes":0,"body":"Gracias por incluir este enlace en la discusión. Para dejarlo absolutamente claro, el mal comportamiento en cualquier modo será sancionado,  hasta con suspensión permanente. Tratamos de reformar jugadores y darles tiempo para reflexionar con suspensiones temporales, pero cuando nos indican que no tienen intenciones de mejorar, se hace necesario aplicar sanciones permanentes. Estamos de acuerdo de que ese tipo de comportamiento  es inaceptable,  y estamos dedicados a combatirlo y crear la mejor experiencia posible para todos.\n\nEsas suspensiones generalmente se tratan de abuso verbal o jugadores que se regalan al equipo enemigo - el creador de este hilo recibió una suspensión permanente por otra razón.   \teLxChemii (la cuenta suspendida/ otra cuenta de Arthurio) fue suspendida porque  usó explotaciones (hacks) que le dieron una ventaja competitiva sobre los demás jugadores. Programas como ese arruinan partidas, permite que jugadores reciban recompensas que no merecen, y arruina el balance de equipos.  No lo vamos a permitir y la primera instancia de uso de estos programas resulta en una suspensión permanente. Además, si mandan peticiones a Soporte, por favor den les un poco de tiempo para responder. Siempre tratamos de responder lo más pronto posible, pero a veces hay una gran cantidad de preguntas y puede demorar más de lo que quisiéramos. Espero que no les disuade de mandar reportes para denunciar explotadores, boosters, y estafadores. Para reportarlos por favor mandanos un mensaje a https://support.riotgames.com/hc/es-419/requests/new  . Gracias y suerte en la Grieta","replies":[{"poster":"caballero arthas","date":"2015-02-06T00:49:27.872+0000","up_votes":1,"down_votes":1,"body":"Yo siempre juego con el y nunca en la vida vi que usara hacks de ningun tipo y me gustaria saber que tipo de hack uso, o sea es lo minimo que merece el si le banean la cuenta donde puso dinero y esfuerzo y que con falsas acusaciones se la baneen yo creo que deberian darle esos detalles sobre el hack usado.","replies":[{"poster":"Mistery Box","date":"2015-02-07T18:40:46.444+0000","up_votes":1,"down_votes":1,"body":"lo mismo digo deberían darle visión  de que supuesto hack ocupo porque tiene razón quien debería ser tan estúpido para ocupar hack en primer lugar y mas aun hack en su cuenta principal donde invirtió dinero y tiempo???","replies":[]}]},{"poster":"Arthurio","date":"2015-02-05T02:15:21.192+0000","up_votes":1,"down_votes":1,"body":"no es mi otra cuenta. es la cuenta de un amigo. revisen IP y veran","replies":[{"poster":"Mistery Box","date":"2015-02-05T03:44:36.281+0000","up_votes":1,"down_votes":2,"body":"Señor riot una queja aquí es que el amigo eLxChemii  no uso hacks de ningún tipo 1 por algo simple es su cuenta principal 2 gasto dinero en esa cuenta y nadie seria tan estúpido para rebajarse a usar hacks en su cuenta principal menos alguien que yo eh visto que no ocupa aparte juega con puros amigos me incluyo yo eh jugado con el y les puedo asegurar que no ah jugado con ningún tipo de hack exijo algo simple que vean sus partidas bien y que expliquen que \"hack\" ocupo incluso puedo afirmar que se pudieron haber equivocado con el nombre pero este tipo es mas sano que el agua...","replies":[]}]}]}]}]},{"poster":"artistafracasado","date":"2015-02-04T06:30:02.244+0000","up_votes":3,"down_votes":0,"body":"Nunca banean permanentemente sin razón vieja, eso no es joda. Otra cosa es que no te digan, que tampoco tienen por qué en todo caso. \n\nA soporte.","replies":[]},{"poster":"eLxChemii","date":"2015-02-05T19:54:31.734+0000","up_votes":1,"down_votes":2,"body":"VIEJO por que hay gente que es tan penca en el sentido cuando ellos les pasa algo están peor que uno ellos alegan sin fundamentos ni pruebas . pero gente una vez por toda siempre lo dije NUNCA OCUPE ALGUNA DE ESAS explotaciones o HACK como lo llaman juego siempre sano aparte GASTE DINERO y TIEMPO es mi única cuenta ... Dos Dedos de frente para pensar antes de comentar Nicagando lo aria solo quiero saber que esto es uno de esos bug (error) del servidor y nunca de vi estar baneado .! \n\nPD:Si alguna otra persona escribe otra mierda en este comentario amigo piénselo lo único que esta consiguiendo demostrando su insuficiencia mental ","replies":[{"poster":"lordeman10","date":"2015-02-05T20:39:41.940+0000","up_votes":3,"down_votes":0,"body":"Pasa que el foro no es lugar para discutirlo, todos odiamos a la gente que arruina el juego y estamos acostumbrados a ver gente que se expresa mal y critica a riot por hacer bien su trabajo y si hay muchos boluditos que ponen plata y dsp van y usan el hack de moda solo por que creen que no tendrá importancia o por que todos lo usan.. no digo que sea tu caso yo no los conozco y no voy a meterme en el bardo pero pagar no prueba nada tampoco\n\npero el que viene acá se expone a ser abucheado no es algo personal contra vos, lo mejor es que uses el soporte y tengas paciencia, entiendo lo duro que pueda ser y espero que sea un simple bug tambien suerte, evita seguir esta discución que no te servirá para nada","replies":[]}]},{"poster":"CapitanVertigo","date":"2015-02-04T23:54:23.229+0000","up_votes":3,"down_votes":1,"body":"mirá vos, hack! \nme gustaría ver que dice  el creador del post al respecto porque supuestamente no había hecho nada malo!!\n  Creo q debe ser el post nro.: 10000k que veo que ante una queja de ban injusto le cierran la boca épicamente.","replies":[{"poster":"Mistery Box","date":"2015-02-05T03:40:25.611+0000","up_votes":2,"down_votes":2,"body":"Amigo enserio me carga tu comentario 1 porque nadie te conoce 2 no sabes que paso y 3 siempre comentan argentinos con xenofobia amigo aprende a comentar con razón un gusto haberle \"cerrado la boca épicamente ;) \"","replies":[{"poster":"El Impostor","date":"2015-02-05T13:57:15.875+0000","up_votes":3,"down_votes":0,"body":"se ven muy alterados contestando a todos, como si intentaran cubrir a su amigo.\nIgual mucho no podemos ver, ya que los historiales solo guardan las 10 partidas mas recientes.","replies":[{"poster":"Mistery Box","date":"2015-02-05T18:54:57.190+0000","up_votes":1,"down_votes":2,"body":"yo solo defiendo a mi amigo porque 1 el no usa hack 2 no seria tan estúpido para hacer y 3 donde el explica que porque usaría hack en su cuenta principal? y mas si el ocupara hack no estaría alegando aquí ahora piense :){{summoner:13}}","replies":[{"poster":"El Impostor","date":"2015-02-05T23:23:30.005+0000","up_votes":2,"down_votes":0,"body":"1 y 2 son tu opinión, no la verdad, por más que sea tu amigo, puede mentir.\ny el 3 es un argumento inútil, ya que todos los que vienen a llorar al foro por su ban dicen ser santas palomas hasta que riot les dice que pasa.","replies":[{"poster":"eLxChemii","date":"2015-02-05T23:45:45.674+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Diegostein,realm=LAS,application-id=X54mVVp0,discussion-id=7KM7Uyxv,comment-id=000b0000000000000000,timestamp=2015-02-05T23:23:30.005+0000)\n>\n> 1 y 2 son tu opinión, no la verdad, por más que sea tu amigo, puede mentir.\n> y el 3 es un argumento inútil, ya que todos los que vienen a llorar al foro por su ban dicen ser santas palomas hasta que riot les dice que pasa.\n\nviejo no pienso discutir contigo realmente no voy a reclamar sin tener razón ....!\n\n1-Si a ti te banean sin tener una culpa amigo como estarías ?\n2-Si viene gente a poner tonteras TU que arias ?\n3- Amigo de todas maneras te lo DIRE NO OCUPO NADA DE EXPLOTACIÓN.! \n\nGracias","replies":[{"poster":"El Impostor","date":"2015-02-06T00:17:31.995+0000","up_votes":2,"down_votes":0,"body":"1- Daría mis quejas y apelaciones en privado, no tengo porque hacerme el angelito en el foro.\n2- por el punto 1, nada, porque nadie estaría al tanto.\n3- Bueno, el ban lo tienes por algo","replies":[{"poster":"eLxChemii","date":"2015-02-06T02:30:31.251+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Diegostein,realm=LAS,application-id=X54mVVp0,discussion-id=7KM7Uyxv,comment-id=000b000000000000000000000000,timestamp=2015-02-06T00:17:31.995+0000)\n>\n> 1- Daría mis quejas y apelaciones en privado, no tengo porque hacerme el angelito en el foro.\n> 2- por el punto 1, nada, porque nadie estaría al tanto.\n> 3- Bueno, el ban lo tienes por algo\n\nse nota lo rata amigo :D no se si te diste cuenta pero no se puede hacer  privado  y si dime porque no lo se ..!","replies":[{"poster":"El Impostor","date":"2015-02-06T13:59:18.470+0000","up_votes":2,"down_votes":0,"body":"privado: https://support.riotgames.com/hc/es-419/requests/new\ncon que cara dices rata, si tuviste que hacer que tus amigos vinieran a hablar por ti en primer lugar, ahora, acepta tu castigo.{{summoner:11}} ","replies":[{"poster":"Mistery Box","date":"2015-02-07T18:42:52.158+0000","up_votes":1,"down_votes":2,"body":"típico niñito que viene a comentar algo que no le incumbe simple que pasaría si a ti te banean la cuenta por usar hack sin que lo hubieras usado? donde quedas? quedaras como mentiroso como quedo nuestro amigo? gente estúpida y mediocre :)","replies":[{"poster":"El Impostor","date":"2015-02-07T19:41:19.638+0000","up_votes":2,"down_votes":0,"body":"Te tengo una pequeña noticia: Esto es un foro, aquí si publicas algo es para que quien quiera opinar lo haga.\nAdemás insisto, que estén todos tan alterados con el asunto da para pensar que en verdad hizo algo su amigo e intentan cubrirlo como sea.","replies":[{"poster":"Mistery Box","date":"2015-02-12T01:01:23.225+0000","up_votes":1,"down_votes":1,"body":"Ya pero sabes que estas mal en algo si nuestro amigo hubiera ocupado algún hack o algo pro el estilo yo no estaría aquí alegando y ayudándolo porque ami tampoco me gusta la gente que es eloobosteada ocupa hacks y todo eso tu crees que estaría aquí perdiendo MI TIEMPO en algo que tu aseguras es falso? yo se que mi amigo nunca ah ocupado hacks por algo vine a perder mi tiempo aquí ayudándolo :) {{summoner:21}}","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Lxtx","date":"2015-02-07T19:01:32.998+0000","up_votes":2,"down_votes":0,"body":"Seguró usó MK Jogo como casi todos los baneados, ese programa no está permitido.","replies":[]},{"poster":"CapitanVertigo","date":"2015-02-07T17:29:21.630+0000","up_votes":2,"down_votes":0,"body":"Como ya te dijeron lo mejor es por ticket a soporte. Si no te diste cuenta hay de estos post cada 2x3 con los resultados que ya te comenté más arriba y sinceramente no apareció ningún rata por acá, no veo comentarios fuera de lugar, ni tóxicos, ni ofensivos ni xenofóbicos. Vos lo haces público y nosotros de damos nuestra opinión, podemos equivocarnos pero nadie te insulta.","replies":[{"poster":"El Impostor","date":"2015-02-07T19:46:12.847+0000","up_votes":1,"down_votes":0,"body":"yo los veo cada vez ser mas agresivos (el baneado y sus amigos) para contestar a los comentarios, como si no hubiera derecho a hablar en un foro público.","replies":[]}]},{"poster":"CapitanVertigo","date":"2015-02-05T17:12:11.048+0000","up_votes":2,"down_votes":0,"body":"No es que quiera bardear, pero en el 99% de los post como este el creador del post se está haciendo holímpicamente el b... Te pido disculpas si no es tu caso, y ojala que  puedan solucionarlo, debe ser horrible un día querer jugar con tus amigos y ver q te han baneado injustamente.","replies":[]},{"poster":"eLxChemii","date":"2015-02-05T02:26:13.841+0000","up_votes":2,"down_votes":3,"body":"Estimados ....!\nBuenas noches lo primero que tengo que decir que NO OCUPO ni un tipo de Explotación (Hack)\nEs mi Única cuenta y no creo ser ..................... Para ocupar cosas con mi única cuenta en la cual e gastado dinero y tiempo\n**Sr.Cacharpas ** póngase en mi lugar usted cree que voy hacer eso en mi única cuenta ? \naparte si \"hubiese\" hecho eso no seria tan care raja para estar mandando mensajes ni correos para que solucionen mi problema...!\n\nPor favor Sigo diciendo QUE NO E COMETIDO NADA MALO ...! \nAun pienso que es error y se solucionara ..!\n\nEspero nueva respuesta..! \n\nMuchas Gracias","replies":[{"poster":"Saint Araneae","date":"2015-02-05T05:25:37.625+0000","up_votes":2,"down_votes":0,"body":"programas ajenos que interfieran de alguna manera en el juego,stats,timers,skins o cualquier otra cosa también se consideran hack :)","replies":[]},{"poster":"Arthurio","date":"2015-02-05T03:11:00.284+0000","up_votes":1,"down_votes":0,"body":"seria bueno saber CUANDO fue el uso de la explotacion.. por que la ultima partida que jugo fue un custom entre amigos. y las otras partidas comunmente juego con el.. y me daria cuenta que el uso hack.","replies":[]}]},{"poster":"BioTron","date":"2015-02-04T04:40:31.063+0000","up_votes":3,"down_votes":1,"body":"*ademas que le dan un ban indefinido \"hasta el Sun Feb 22 22:22:22 PST 2201.\" que fecha es esa O.O.*\n\nSunday February 22 22:22:22\n\nHasta el 22 de febrero a las 22:22:22.\n\nDe todas formas, me banearon una cuenta en el foro por decirle a alguien que defendía a los españoles: \"Si vas allá, lo primero que vas a escuchar es sudaca, además, robaron toda las riquezas de nuestro continente y vinieron a matar a los habitantes y a su cultura... ¿y vos los defendés? que falta de cultura\"","replies":[{"poster":"eLxChemii","date":"2015-02-04T04:54:53.912+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=BioTron,realm=LAS,application-id=X54mVVp0,discussion-id=7KM7Uyxv,comment-id=0002,timestamp=2015-02-04T04:40:31.063+0000)\n>\n> *ademas que le dan un ban indefinido \"hasta el Sun Feb 22 22:22:22 PST 2201.\" que fecha es esa O.O.*\n> \n> Sunday February 22 22:22:22\n> \n> Hasta el 22 de febrero a las 22:22:22.\n> \n> De todas formas, me banearon una cuenta en el foro por decirle a alguien que defendía a los españoles: \"Si vas allá, lo primero que vas a escuchar es sudaca, además, robaron toda las riquezas de nuestro continente y vinieron a matar a los habitantes y a su cultura... ¿y vos los defendés? que falta de cultura\"\n\npero al entrar a mi cuenta me sale que mi cuenta esta suspendida permanentemente ,compruebe la dirección de correo electronico :$","replies":[]}]},{"poster":"El Impostor","date":"2015-02-07T21:19:32.586+0000","up_votes":1,"down_votes":0,"body":"Un detalle: http://www.reddit.com/r/leagueoflegends/comments/2u6bht/scripters_get_rekt/\nAl parecer, algunos baneados no son necesariamente por hackear en corto plazo, algunos quizás lo hicieron hace mucho y esta semana les llegó su día.","replies":[]},{"poster":"LastManStandîng","date":"2015-02-04T21:44:18.056+0000","up_votes":1,"down_votes":0,"body":"a mi me banearon por 3 días, creo que si me fui de mambo en algunas partidas lo admito, no se si fue para tanto, quizás un chat ban era mas apropiado, pero no me llego ningún email confirmando dicho ban o dando mas información sobre el mismo como supuestamente te dice en el mensaje cuando tratas de logear.\n\nOsea que si te banean y por ahi no logeas por algunos días, ni te enteras que te banearon... acá hay un problema algo grave creo.","replies":[]},{"poster":"Korp Tyrion","date":"2015-02-04T18:17:34.273+0000","up_votes":1,"down_votes":0,"body":"El motivo de su permaban tiene 3 opciones\n\n1. Alguna estafa con los RP.\n2. Ocuparon algún programa o bug para tener ventaja en el juego.\n3. Son realmente tóxicos.\n\nNo se si hay otra razón para el permaban pero esas son las 3 mas conocidas","replies":[]},{"poster":"Patosko","date":"2015-02-04T04:01:53.499+0000","up_votes":1,"down_votes":0,"body":"Es muy raro, en el mail debería ir el motivo explicito del Ban, más si este es indefinido.\nQue triste que se demoren tanto en solucionar algo tan fácil, si es un ban tiene que haber un buen motivo!! Explíquenle algo al joven{{item:3070}} !!","replies":[]},{"poster":"Eskipi","date":"2015-02-04T16:28:04.960+0000","up_votes":1,"down_votes":3,"body":"saben por que a riot le importa una mierda lo escriben en estos temas?... Por que siguen jugando como verdaderos exclavos comiendose todas las rabietas durante meses o años y comprando rp por cada skin y personaje que sacan, son la verguenza de las comunidades online, no les recomiendo quejarse para nada por que seguiran jugando normalmente, no tiene ningun sentido lo unico que tienen que hacer es seguir jugando total HACEN como si fuera el juego perfecto o sea que no se despegan... no se dan cuenta lo sometidos que estan, les hacen un mal horrible a los juegos, no puede ser que por gente como ustedes esto sea lo mas jugado!","replies":[]},{"poster":"Charmless Man","date":"2015-02-04T05:30:32.730+0000","up_votes":1,"down_votes":3,"body":"Go riot! Estan desepcionando a sus usuarios!","replies":[]},{"poster":"Mistery Box","date":"2015-02-04T04:54:20.511+0000","up_votes":1,"down_votes":5,"body":"Dejenme decirles riot que igual esta mal ahora empiezan a dar baneos cuando eso tuvieron que haberlo hecho hace mucho tiempo por gente que trollea en ranked o se va afk y hace perder puntos como loco pero ese no  es el tema si no que porque banearon a mi amigo si el no a hecho nada malo por lo que yo eh visto ningun mal comportamiento de parte de el hay gente que si merece un perma ban como los trolls o afks pero a alguien que no ah hecho nada??? esta mal riot aparte sin ninguna explicacion y la fecha hasta el Sun Feb 22 22:22:22 PST 2201???? cual fecha es esa {{summoner:3}} {{item:3151}}","replies":[{"poster":"LordHarek","date":"2015-02-04T13:06:19.317+0000","up_votes":1,"down_votes":2,"body":"No es del todo permanente.\n\nEl ban se lo sacan un **Domingo** **22** de **Febrero** a las **22** horas, **22** minutos, **22** segundos del año **2201**. (?)\n\nHablando enserio Riot, fijense los thread de oleadas semanales. No dan nombres pero si varios motivos de la mayoria que fueron baneado.\n\nSaludos.","replies":[]}]},{"poster":"eLxChemii","date":"2015-02-04T04:15:56.980+0000","up_votes":1,"down_votes":5,"body":"Necesito saber el motivo de mi ban  :( \naparte no creo ser tan ...... para hacer algo indebido con mi propia cuenta \nya que mi acusación es por hacer algo malo ...!  \n\n**\nPor favor ayúdenme..!  **","replies":[]}]}