{"poster":"Sana is my Bias","date":"2017-09-09T17:56:45.466+0000","title":"Organización Mediocre de  BFCK GAMING","subforum":"Torneos y Eventos de la Comunidad","embed":{"description":"Este es un Torneo de League of Legends organizado por BFCK GAMING. Con el objetivo de promover la competitividad...","url":"https://battlefy.com/bfck-gaming/bfck-torneo-en-l%C3%ADnea-%E2%80%93-5v5-sin-restricci%C3%B3n-de-liga-%E2%80%93-28-%E2%80%93-las/599b7444d5230a032ed338fd/info?infoTab=details","image":"https://s3.amazonaws.com/battlefy-user-generated-assets-with-permissions%2Ftwitter%7C3155933934/1503942286316.TORNEOS-5V5-BATTLEFY.png"},"up_votes":32,"down_votes":4,"body":"Buenas, pido la atenci&oacute;n de alg&uacute;n Rioter ya que por lo que ten&iacute;a entendido la mala organizaci&oacute;n de los torneos de igual manera es penalizada, hoy con mi equipo (y otros equipos tambi&eacute;n) tuvimos el inconveniente de que la organizaci&oacute;n pas&oacute; a teams que ni siquiera se presentaron en la sala a la hora indicada y siguiendo las reglas que ellos mismos establecieron, nos tratamos de comunicar con los organizadores por Discord y estuvimos esperando 25 minutos para que apareciera un Admin que cabe destacar nunca apareci&oacute;.\n\nSe supone que los premios los auspicia Riot Games, por lo mismo quer&iacute;a pedirles que vieran el caso con esta organizaci&oacute;n de torneos y su falta de profesionalidad para llevarlos a cabo de manera correcta, ya que no hay Admins que ayuden en los inconvenientes, o que quiz&aacute; pasen a sus amigos y conocidos en rondas para ganar los premios auspiciados por Riot, pido una investigaci&oacute;n sobre el tema y tratar de no auspiciar estos torneos que no llegan a nada por la mala organizaci&oacute;n por parte de BFCK, 0 &eacute;tica y profesionalismo, 0 personal para ayudar a la gente en sus respectivos brackets, les pido que vean si es conveniente auspiciar a estas organizaciones que no son capaces de responder en torneos peque&ntilde;os.\n\nLink de Discord con hora local, tener en cuenta que torneo empezaba a las 14:00 Horas y a&uacute;n nadie soluciona el problema...\n[http://prntscr.com/gj4a7l]\n\nMuchas gracias y espero una respuesta.","replies":[{"poster":"Raziel Ashura","date":"2017-09-09T18:13:58.111+0000","up_votes":12,"down_votes":4,"body":"Hola estimados, nosotros como team WeD~ también participamos de este torneo. Nuestros contrincantes no se presentaron, ya ha pasado más de una hora de que la partida debió comenzar y no hay caso con que el bracket se mueva. Hay equipos que siguen jugando libremente las siguientes faces de la llave, equipos que se les asignó derrota habiéndose presentado y sus rivales no, etc. Más de una hora esperando a un administrador y nada.\n\nMe parece impresentable que una organización así tenga la libertad de organizar torneos y hacernos perder a todos el tiempo de esta manera, una verdadera vergüenza.","replies":[{"poster":"Leks","date":"2017-09-09T19:26:55.674+0000","up_votes":2,"down_votes":0,"body":"Se ha solucionado gracias","replies":[]}]},{"poster":"Delightful Agony","date":"2017-09-09T18:47:56.787+0000","up_votes":4,"down_votes":1,"body":"Genial! Más de 100 personas en el torneo, 29 equipos y la mayoría con problemas. Entrar a su Facebook y ver que organizaron una juntada, triste. Si van a tener 2 eventos en un dia, minímo dejen gente capacitada para atender cualquier duda o problema que pueda surgir. En este caso parece que todos los moderadores/administradores se tomaron el dia libre para ir a la juntada y se olvidaron del torneo online. No es la primera vez que veo problemas en esta organización y espero que Riot haga algo al respecto. Me parece una falta de respeto no solo para la gente que se anoto sino que para la propia companía de RiotGames, representandolos tan mal.","replies":[]},{"poster":"Mukanshin akuma","date":"2017-09-09T18:12:27.499+0000","up_votes":8,"down_votes":5,"body":"Si, yo soy de one trick ponny y llevo mas de 1 hora esperando, en el primer torneo que jugue de esta misma organizacion paso lo mismo, dijeron que era con 64 equipos maximo y al final solo dejaron entrar a 8 y dejaron a todos los demas fuera","replies":[{"poster":"Leks","date":"2017-09-10T23:23:07.074+0000","up_votes":1,"down_votes":0,"body":"https://cdn.discordapp.com/attachments/353228422882787338/356578735287304212/unknown.png\n\nEn cual de estos torneos hay menos de 8 equipos?, estas seguro que hablas de nuestros torneos??, creo que te equivocas.","replies":[]}]},{"poster":"alfalfax","date":"2017-09-09T18:25:04.927+0000","up_votes":6,"down_votes":4,"body":"Parece bastante gracioso que precisamente los teams que estan reprochando al torneo son los equipos que cuando pierden flamean al equipo contrario como paso con Team WeD, sin ir mas lejos que estos mismos equipos cuando ven un bracket que no les favorece no se  terminan presentando.\n\n\"Se respetuoso y puntual para poder exigir despues un trato igualitario\".","replies":[]},{"poster":"FedecarboneroUY","date":"2017-09-09T18:13:39.402+0000","up_votes":6,"down_votes":5,"body":"Siempre son un desastre esos torneos y siempre estan todos arreglados, desde que entré en el foro veo esta clase de posts","replies":[]},{"poster":"Ory","date":"2017-09-09T18:24:42.449+0000","up_votes":4,"down_votes":3,"body":"Pa fuera nomas","replies":[]},{"poster":"lordeman10","date":"2017-09-10T01:28:11.311+0000","up_votes":3,"down_votes":2,"body":"estás muy confundido, riot no auspicia estos torneos y hace mucho incapié en que no lo hace, las comunidades hacen los torneos y riot los apoya con premios, estás exigiendo profesionalismo y calidad en algo hecho a pulmon, no te juzgo porque pensas que es una empresa dedicada a eso pero para nada, son solo gente con animos de ayudar a la comunidad, hacen lo mejor que pueden con lo que tienen","replies":[]},{"poster":"SAD Katarina","date":"2017-09-09T18:23:03.494+0000","up_votes":3,"down_votes":2,"body":"Yo me anoté con dos personas en un 3 v 3 y resulta que esas dos personas estaban anotadas en \"free agent\" y mi equipo... ¿Cual fue la solución de los organizadores? Dejarme 1v3.","replies":[]},{"poster":"Hnk Kenshiro","date":"2017-09-10T00:57:06.199+0000","up_votes":1,"down_votes":0,"body":"https://boards.las.leagueoflegends.com/es/c/torneos-y-eventos-de-la-comunidad/7nfgrixv-denuncia-fraudes-irregularidades-o-problemas-graves\n\nNo tengo mucho tiempo. Tienes una duda con el correo me dices.","replies":[]},{"poster":"Rayito","date":"2017-09-09T18:48:10.825+0000","up_votes":1,"down_votes":7,"body":"No se cual es la novedad, siempre pasa lo mismo en estos torneos pedorros, la culpa es suya por confiar en estos chantas y anotarse.","replies":[]},{"poster":"aka supermean","date":"2017-09-09T18:31:28.366+0000","up_votes":3,"down_votes":22,"body":"La verdad con el grupo de amigos que jugamos jamás hemos tenido problemas como los que se están dando hoy en el torneo, quizás hubo problemas de fuerza mayor o yo que sé, pero no hay por que entrar a descalificar y decir organización mediocre y todo el tema... si por algo tienen el auspicio de Riot jaja acá ninguno de ustedes tiene el derecho de hablar así de ellos... y sin mucho más, concéntrense en mejorar su juego en vez de tratar de conseguir victorias y putear a los demás equipos cuando pierden xd saludos","replies":[{"poster":"SkinHead 7w7","date":"2017-09-09T20:56:46.599+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=C9 Snëaky,realm=LAS,application-id=QXeEMrF7,discussion-id=bBb9lB1G,comment-id=000a,timestamp=2017-09-09T18:31:28.366+0000)\n>\n> La verdad con el grupo de amigos que jugamos jamás hemos tenido problemas como los que se están dando hoy en el torneo, quizás hubo problemas de fuerza mayor o yo que sé, pero no hay por que entrar a descalificar y decir organización mediocre y todo el tema... si por algo tienen el auspicio de Riot jaja acá ninguno de ustedes tiene el derecho de hablar así de ellos... y sin mucho más, concéntrense en mejorar su juego en vez de tratar de conseguir victorias y putear a los demás equipos cuando pierden xd saludos\n\nCALLESE!!!! Hombre horrible","replies":[]},{"poster":"lordeman10","date":"2017-09-10T01:31:56.319+0000","up_votes":1,"down_votes":0,"body":"Riot no es auspiciante! riot apoya cualquier torneo de comunidad, el que sea, la unica condición es que jueguen 8 equipos. Ellos hacen mucho incapié en que no auspician, simplemente ofrecen **apoyo con premios**","replies":[]}]},{"poster":"Tÿan ","date":"2017-09-09T18:31:13.764+0000","up_votes":5,"down_votes":19,"body":"Si no pasas de primera ronda, tu opinión no cuenta! {{sticker:slayer-jinx-catface}}","replies":[]}]}