{"poster":"zoroyashie","date":"2015-11-04T18:52:34.788+0000","title":"Welche Champions sind extrem stark wenn man diese meistert?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Es gibt viele Champs bei dem das Potenzial extrem gut ist.\r\nIch weiss ein Vladimir main ist &uuml;bertrieben genauso wie Ryze.\r\nIch weiss nicht ob ihr wisst was ich meine aber ein main ryze oder vlad ist extrem stark und sorgt immer wieder f&uuml;r gute verwirrung bei den Gegners was es den dmg angeht.\r\nKennt ihr irgendwelche champs die momentan nicht im rampenlicht stehen die aber trotzdem sehr sehr stark sind.","replies":[{"poster":"Im a Papaya","date":"2015-11-04T19:01:30.301+0000","up_votes":3,"down_votes":1,"body":"Kha zix macht extremen Schaden und ich sehe ihn eher selten. Er ist ne ziemliche Glaskanone und man muss lernen mit ihm umzugehen aber ich hab schon öfter mit gefühlten 100 Hp in nen Busch gewartet wenn ich verfolgt wurde und mit einer Kombo den Adc gekillt. Wer Kha zix spielen kann, kann gut carryn aber er ist echt nicht leicht und wegen seiner Passiven Q musst du auf den passenden Moment warten können.","replies":[]},{"poster":"SleepingPizza","date":"2015-11-06T09:32:20.234+0000","up_votes":1,"down_votes":0,"body":"Kindred xP","replies":[]},{"poster":"Tomate Level 35","date":"2015-11-05T18:22:04.259+0000","up_votes":1,"down_votes":0,"body":"Besonders Champions wie Taric, Urgot, Yorick und Galio sind auf jeden Fall gute Champs zum meistern.\nDamit kann man gut 1v5 penta machen","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-11-04T19:00:57.304+0000","up_votes":1,"down_votes":1,"body":"Alle.\n\nSo einfach ist das.\n\nBeweis: Ryze hat derzeit die schwächste Winrate aller Champions (und hing schon auf 4.18 bei 44% rum) und Faker hat damit trotzdem das WM Finale dominiert.\n\nWenn du deinen Champion beherrscht, ist er verdammt stark. Und seinen Champion zu meistern ist immer die Grundlage des (Ranked)-Spiels....","replies":[{"poster":"Samuraisub","date":"2015-11-04T21:38:01.060+0000","up_votes":1,"down_votes":0,"body":"Sag da Fiora, Elise oder Rumble *-*\nDie haben genauso hohe Winrate wie ein Ryze und sind in gewisser Maßen schlimmer","replies":[]},{"poster":"Black Mage","date":"2015-11-04T19:13:47.235+0000","up_votes":1,"down_votes":0,"body":"unsinn...\n\nje nach Queue, kann das stark variieren...\n\nSoloQueue = Champs die wenig bis garkein teamwork erfordern > Champs die viel teamwork für ähnliche/bessere resultate erfordern...\nAußerdem: Champs die erst im late dominieren sind meistens schwächer, weil ein spiel bis dahin schon längst entschieden ist.\n\nFull Premade = Champs die im team Synergien haben (lulu+yasuo+shyv, oder andere kombinationen, am besten welche die aktueller sind :p) > champs die wenig für das team bringen\nEinfach weil man ansonsten überrannt wird von einem koordinierten Gegner.\n\n\n\n","replies":[{"poster":"MeMyselfandBaal","date":"2015-11-04T19:36:54.031+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Black Mage,realm=EUW,application-id=7hciEY9w,discussion-id=5fAKsdWT,comment-id=00000000,timestamp=2015-11-04T19:13:47.235+0000)\n>\n> unsinn...\n\nDann ähm.... triff mal in der SoloQ auf meine Karma. Oder auf meine Janna. Dass sind die Champions, mit denen ich richtig krasse Plays abziehen kann (leider die einzigen...). Warum? Weil ich die Champions so weit gemeistert habe, dass ich den für eine halbe Sekunde am falschen Platz stehenden ADC mit einem Flash Monsun in mein Team puste...\nUnd ja, ich habe mit genau dem Move in einem verdammt engen Spiel mein letztes Spiel als Gold I Spieler gewonnen (beim gegnerischen Bluebuff... wir machen danach Baron und finishen). Ich muss halt nicht mehr darüber nachdenken, ob ich jetzt mit dem Flash-Monsun den Teamfight eröffnen kann oder nicht (was ja nun wirklich kein Standart Move auf Janna ist). Ich mache es einfach, wenn sich die Möglichkeit ergibt. Weil ich den Champion gemeistert habe.\n\nUnd ja, wenn man Janna gemeistert hat (diesen rein defensiven Support also auch offensiv einsetzen kann), ist es ein extrem starker Champ.\n\nNehmen wir ein anderes Beispiel: Azir. Wenn du wirklich verstanden hast, wie dieser Champion funktioniert (wie man die Soldaten also auf Max Range verwendet), ist der absurd gut... es braucht halt nur endlos viele Spiele um auf dieses Niveau zu kommen.\n\nOder halt... meine Lieblings-Karma. Du glaubst gar nicht, wie viele Champions einen Kill abgeben, anstatt mich zu töten, weil ich es mit dem Champ schaffe instinktiv die richtigen Knöpfe zu drücken, um den Towerdive zu überleben und den Genger in Towerrange für 2 Sekunden zu snaren...\n\nSolange man nicht Diamond ist, kann man mit jedem Champ, den man gemeistert hat, die Spiele entscheiden. Das meistern wird halt nur immer schwerer.","replies":[{"poster":"Black Mage","date":"2015-11-04T20:54:43.421+0000","up_votes":1,"down_votes":0,"body":"ich sage nicht das X champion schlecht ist, ich sage das man mit champion A bessere ergebnisse bringen wird als mit champion B, weil das halt die natur der soloQ ist, die beiden genannten beispiele von dir, sind beide SoloQ tauglich, weiß nicht was du hast?\n\ndu nimmst beispiele, die alle SoloQ tauglich sind, was keiner meiner aussage widerspricht...\n\nNimm z.B. Amumu, er ist ein guter champ, leidet aber daran, das er nur einen einzigen harten CC hat, seinen Q, die Ultimate lässt gegner weiter spells casten.\n\nwenn man solo spielt, dann ist man als amumu recht stark aufgeschmissen, da er ein team braucht, welches seine engages nutzen kann und auch zu schätzen wissen, denn es gibt oft genug situationen, wo solche champs wertlos werden, genau in dem moment, wo es entscheidend wird.\n\ndas selbe mit aatrox, er kann ohne ein team, welches für ihn peelt, ggf welches seine stärken nicht einmal kennt, NIE sicher sein, das der spieler richtig spielen kann, da wenn er reingeht (als bruiser) alles schief laufen kann und auch oft tut, andere folgen oftmals nicht/spät, fokusen die falschen und dann, während er sich wiederbelebt (falls es dazu kommen sollte) wird nicht unterstützt/der gegner gezoned...\n\nes gibt klar favoriten und klar verlierer in solchen angelegenheiten. Sicher kann \"skill mit champ x\" den unterschied ausgleichen, aber andere spieler brauchen weniger \"skill\" oder kenntnisse um besser/gleichgute resultate zu erzielen","replies":[]}]}]}]},{"poster":"Samuraisub","date":"2015-11-04T21:36:07.457+0000","up_votes":1,"down_votes":0,"body":"{{champion:157}} {{champion:68}} {{champion:238}} {{champion:64}}","replies":[]}]}