{"poster":"Wastted","date":"2019-01-12T08:08:43.995+0000","title":"No entiendo nada ya!","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Yo juego desde principios de la S6, y en las rankeds tenias que jugar las 10 primeras y te posiciona en una liga y bla bla... Ahora en esta Season no entiendo nada! jugue una partida de FLEX y la gan&eacute; y segun &#039;&#039;Op.gg&#039;&#039; acabe en Hierro 4. \r\nAhora estaba jugando Solo/Duo y voy ganando 8 y perdiendo 1 y en &#039;&#039;op.gg&#039;&#039; aparece que soy bronce 3 !!! NO ENTIENDO PORQUE DICE QUE ESTOY EN ESAS LIGAS SIN JUGAR LAS 10 PRIMERAS RANKEDS! Alguien que me explique porfavor!! \r\n\r\n{{sticker:sg-janna}} {{sticker:sg-shisa}}","replies":[{"poster":"CamaleonaBugeada","date":"2019-01-12T11:29:34.391+0000","up_votes":1,"down_votes":0,"body":"Normal que no entiendas, si no lees los post que hace Riot, que para algo los sacan, desde setiembre (creo que antes incluso) que se viene diciendo como será el nuevo sistema de Rankeds, es como con las notas del parche, nadie las lee y después se quejan en ranked de que \"Ese item de donde salió\", \"Desde cuando pega tanto ese poder de m***\", etc...\n\nLa cosa es así, vos vas jugando, luego de jugar la primera, te muestran el rango MÍNIMO en el que vas a quedar, es decir, que si te dice que sos \"plata 4\", significa que ya es imposible caer en bronce o menos en las placements, aunque pierdas las otras 9, además, durante este período, no hay promociones, supongamos que estás en bronce 2 con 80 puntos, ganás una, subís directamente a bronce 1 (o incluso plata 4 si vas muy bien, que por cierto, ya no existen las ligas 5)\n\nPD: Tu \"Pre-rango\" solo lo podés ver vos, cuando termines las 10, ahí si ya se hará público para que los demás sepan en que liga quedaste.\n\nHay que leer gente, no cuesta tanto.\n{{sticker:sg-ahri-1}} ","replies":[{"poster":"Wastted","date":"2019-01-13T01:53:36.293+0000","up_votes":1,"down_votes":0,"body":"Y donde puedo leer esos post? \nGracias xd\n","replies":[{"poster":"CamaleonaBugeada","date":"2019-01-13T09:20:55.409+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BladeCarp,realm=LAS,application-id=X54mVVp0,discussion-id=skm86vHW,comment-id=00010000,timestamp=2019-01-13T01:53:36.293+0000)\n>\n> Y donde puedo leer esos post? \n> Gracias xd\n\nAcá, además en la página principal y en el propio launcher también te avisa siempre que ponen algo...\nhttps://nexus.leagueoflegends.com/es-ar/","replies":[]}]}]},{"poster":"Drockmax","date":"2019-01-12T08:20:24.496+0000","up_votes":1,"down_votes":0,"body":"Esto se explico hace un tiempo desde ahora podras ver el progreso en cada partida, es decir que es momentaneo solo al terminar las partidas de posicionamiento tendras una liga fija, el porque de las ligas depende de tu desempeño, ojo aun estamos en pre-season el 23 de enero comienzan rankeds oficiales de s9","replies":[{"poster":"Wastted","date":"2019-01-12T08:50:13.016+0000","up_votes":1,"down_votes":0,"body":"Vale, muchas gracias. Pero me estas diciendo que las rankeds que jugue y gane fueron al pedo? xd","replies":[]}]}]}