{"poster":"Athyna","date":"2017-01-16T05:58:39.220+0000","title":"Ideas para los main adc esta season","subforum":"Charlas Generales","up_votes":2,"down_votes":9,"body":"Hola, soy main ADC y se me ocurrieron un par de ideas ahora que la cosa esta violenta contra los ADC&#039;s y es que los supports deber&iacute;an estar pegados al lado nuestro 100% del tiempo para darnos peel y cuidarnos y no dejarnos morir por eso sugiero estas cosas:  que si se van a ayudar al mid o al jungla y dejan al adc solo en la linea que se generen enfriamientos menores y un buffo de velocidad de movimiento automaticamente para el adc asi se puede escapar si lo matan los otros dos de la linea, que cada 3 segundos se iluminen los bushs de las zonas del rio para preveer gankeos fatales si el support se fue a roamear por mid o esta comprando, que cada vez que el support se aleja del adc gane menos oro asi lo obliga a volver al lado del adc para ganar mas oro, y por ultimo que la torre del adc que no tiene support pegue un 40% mas y con una velocidad mucho mayor para protegerlo de diveos.\r\nOjala tengan en cuenta estas mejoras, se que todos los adc&#039;s me van a dar la derecha ;)","replies":[{"poster":"Nitrobacter","date":"2017-01-16T06:08:52.611+0000","up_votes":6,"down_votes":0,"body":"mmmmmmmmmmmmm......nop.","replies":[{"poster":"saikou29","date":"2017-01-16T06:12:08.209+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Soy Rikizimo,realm=LAS,application-id=v7qsfXsE,discussion-id=EGz1Xcmz,comment-id=0000,timestamp=2017-01-16T06:08:52.611+0000)\n>\n> mmmmmmmmmmmmm......nop.\n\nX2","replies":[{"poster":"Josu","date":"2017-01-16T06:42:07.187+0000","up_votes":1,"down_votes":0,"body":"x3","replies":[{"poster":"Mistreabus","date":"2017-01-16T07:37:47.679+0000","up_votes":1,"down_votes":0,"body":"x4","replies":[{"poster":"WhiteMax","date":"2017-01-16T10:29:43.566+0000","up_votes":1,"down_votes":0,"body":"x6 (No dire ese numero {{sticker:slayer-jinx-wink}} ).","replies":[]}]}]}]},{"poster":"PATH Kamui","date":"2017-01-16T14:09:52.633+0000","up_votes":1,"down_votes":0,"body":"x5","replies":[]}]},{"poster":"iMonsterQ8","date":"2017-01-16T07:21:55.445+0000","up_votes":3,"down_votes":0,"body":"El día de los inocentes ya pasó.","replies":[]},{"poster":"Rebkans","date":"2017-01-16T13:55:35.516+0000","up_votes":2,"down_votes":0,"body":"> dejan al adc solo en la linea que se generen enfriamientos menores y un buffo de velocidad de movimiento automaticamente para el adc asi se puede escapar si lo matan los otros dos de la linea\n\nMejor aun, si el support se va de la linea para ayudar a otro, el adc deberia quedarse bajo torre y no pushear\n\n> que cada 3 segundos se iluminen los bushs de las zonas del rio para preveer gankeos fatales\n\nMejor aun, que el adc compre wards o que por lo menos use la baratija...\n\n\n> que cada vez que el support se aleja del adc gane menos oro asi lo obliga a volver al lado del adc para ganar mas oro,\n\nEsta es la peor idea.\n\n> torre del adc que no tiene support pegue un 40% mas y con una velocidad mucho mayor para protegerlo de diveos.\n\nDios mio, que manera de inventar boludeces.\n\nYo fui main adc en las S5 y S6 y me parecen muy malas ideas. Si no sabes sobrevivir como adc en todas las circunstancias, entonces no sos main adc.","replies":[]},{"poster":"Maycoltf2","date":"2017-01-16T11:41:38.695+0000","up_votes":2,"down_votes":0,"body":"Menos oro para el soporte? , espero que este post sea de broma :/.","replies":[]},{"poster":"Athyna","date":"2017-01-24T14:41:41.741+0000","up_votes":1,"down_votes":0,"body":"Me encanta que todos se escandalicen y nadie pueda darse cuenta de que, en realidad, soy main support y escribí absolutamente TODO de lo que se quejan los adc's petes que me tocan supportear.","replies":[]},{"poster":"Tutancadead","date":"2017-01-16T11:49:04.863+0000","up_votes":1,"down_votes":0,"body":"Agarren ballanse y llevenae a sus tiradores. \nDejen de obligar al tema a hacerles peel. No siempre queremos hacerles peel y mucha veces no pegan nada así que por que hacerles peel?","replies":[]},{"poster":"9081913DEL1","date":"2017-01-16T10:33:15.878+0000","up_votes":1,"down_votes":0,"body":"Actualmente lo que se esta viendo es que el adc vaya top. Para no perder todo lo que aporta un tirador propiamente dicho. (Ventajas desventajas obvias de esto).\n\nLa solucion a los cambios del meta son siempre basados en la creatividad de los jugadores. Si riot hiciera cada cambio que queremos a nuestro antojo el juego seria cualquier cosa menos algo tactico.\n\nSaludos.","replies":[]},{"poster":"EpicHit","date":"2017-01-16T08:04:35.683+0000","up_votes":1,"down_votes":0,"body":"Y de paso que ganen 250 AD bonus extra","replies":[]},{"poster":"Mosh","date":"2017-01-16T07:29:00.505+0000","up_votes":1,"down_votes":0,"body":"¿Estas loco?","replies":[]}]}