{"poster":"Kiridas","date":"2015-09-09T10:18:14.951+0000","title":"cinematic","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"Signori della Riot dopo l&#039;ultimo video creato (Project), sono sempre pi&ugrave; convinto che dobbiate darvi anche ai film non solo al game. Fareste morire hollywood d&#039;invidia per quel che mi riguarda. Preferisco guardarmi 2 minuti di cinematic riot che un captain america o godzilla ecc ecc..","replies":[{"poster":"Il Freddo","date":"2015-09-09T10:44:37.711+0000","up_votes":2,"down_votes":5,"body":"è ufficialmente la cosa più stupida che abbia mai letto su questo forum, complimenti hai vinto il primo premio","replies":[{"poster":"Kiridas","date":"2015-09-09T12:10:29.129+0000","up_votes":1,"down_votes":1,"body":"allora mi spiace tizio ma non sai cosa vuol dire girare un video fantastico come quelli della riot e non le cagate di film che stanno uscendo","replies":[{"poster":"Otivnaig","date":"2015-09-09T13:10:13.407+0000","up_votes":3,"down_votes":1,"body":"Devo dedurre che guardi pochi film? O che hai 90 anni e ti lamenti dei tuoi tempi? XD\nBasta saper cercare, i film buoni escono.","replies":[]},{"poster":"Il Freddo","date":"2015-09-09T17:29:31.325+0000","up_votes":1,"down_votes":2,"body":"no ti sbagli sono cose che ho studiato per anni. Sei te che non sai nemmeno cosa stai dicendo, il video della riot non è stato girato ma è stato prodotto completamente al computer, sono due cose diverse e mi spiace per te ma non è possibile comparare un film recitato da attori veri ad un film di animazione, poi il soggetto del discorso non è nemmeno un film ma è una semplice clip.\nNon devi dedurre niente, Holmes, non mi lamento dei miei tempi e i film buoni so dove cercarli, anche se probabilmente abbiamo due concezioni diverse del \"film buono\".","replies":[]}]}]},{"poster":"Dr LouD","date":"2015-09-09T10:44:33.807+0000","up_votes":3,"down_votes":1,"body":"\"Eh ma usate i nostri soldi solo per fare altre skin e basta gne gne gne\"\n\n-cit giocatore di lol (frustrato) random","replies":[]}]}