{"poster":"101100111000","date":"2015-06-12T13:09:42.892+0000","title":"Kennen's Electrical Surge v. Twisted Fate's Stacked Deck","subforum":"Gameplay","up_votes":15,"down_votes":2,"body":"Specifically, the passive portion of Kennen&#039;s W, Electrical Surge, and Twisted Fate&#039;s E, Stacked Deck.\r\n\r\nBoth passive states that after X auto-attacks, the next auto will deal bonus magic damage. Simple, and because they&#039;re both considered on-hit effects, they should work the same way, right?\r\n\r\nWrong. The differences are so obvious it hurts.\r\n\r\nWe&#039;ll start with their interactions with Dodge, Block, Parry, and Blind.\r\n\r\nTwisted Fate - Bonus damage can be Dodged.\r\nDodging and Blind will not consume the stack.\r\nBlock will not prevent the bonus damage, and consumes the stack.\r\nParry will not prevent the bonus damage, and consumes the stack.\r\n\r\nKennen - Bonus damage CANNOT be Dodged.\r\nDodging and Blind WILL consume the stack.\r\nBlock will not mitigate bonus damage, and consumes the stack. \r\nParry negates bonus damage, but still consumes the stack and his passive mark is placed.\r\n\r\nLike, really? The only consistency between the two is their interaction with Block. Exactly why do they interact so differently? Oh but it couldn&#039;t be THIS b-\r\n\r\nTwisted Fate - If the target for his empowered AA is killed before hitting, the stack is not consumed.\r\nTwisted Fate can stack against towers, but the empowered AA is not consumed when attacking towers.\r\nSpell Shields will block ALL damage.\r\n\r\nKennen - If the target for his empowered AA is killed before hitting, the stack IS consumed.\r\nKennen cannot stack against towers.\r\nSpell Shields will NOT interact with Kennen&#039;s empowered AA, therefore NOT mitigating any damage.\r\n\r\n...what? Now Twisted Fate&#039;s Stacked Deck is functionally better than Kennen&#039;s Electrical Surge. Great.\r\n\r\nWhy do they even function differently? Is there some really, really, really, REALLY vague reason for this?\r\n\r\nOr nah?\r\n\r\nAnd don&#039;t even get me started on Leona&#039;s Q stunning through blind.","replies":[{"poster":"Frostbiter","date":"2015-06-12T19:17:39.943+0000","up_votes":6,"down_votes":0,"body":"Tl;dr Riot has a lot of \"on-hit effect\" abilities that are inconsistent, despite the use of the same wording. Whether this is intentional or not we won't know.\n\nTF can also kill a minion with an auto and not use up a proc if the base AA damage would kill the minion without the extra damage.\n\nThe main issue is that Riot is very inconsistent with these types of abilities, while yes the characters are different they still use similar mechanics and these mechanics should be the same across the board especially when the wording is identical. You also have Shen's Ki Strike, same wording difference mechanics, it can't be blocked by spell shield and isn't applied or used up if the auto attack is blocked or avoided in some way. Ziggs passive is also not blocked by spell shields yet Kha'zix's passive is blocked by spell shield. Sona's Passive messes everything up too, as the bonus damage goes through dodged and parried but can be missed, blocked and spell shielded. Maybe because they are the champions' passive and therefore are different from other spells and that is why they have different interactions but having the exact same wording for any ability that does bonus damage on hit can make it confusing for people when first leaning the game as they are mechanically different.\n\nI think the problem comes from that fact that some of these abilities are spells and not just on-hit effects, the spell portion bypass anything that would stop an auto attack from landing because the auto attack is basically replacing the point and click action of using a single target spell. I think that some of these abilities they are classified as spells because of the fact that they apply additional effects to the target when used such as Leona's stun. Why Kennen's W doesn't get blocked by spell shield is a mystery to me though. Although Sona's passive does not apply a spell effect, according to lolwiki, yet is blocked by spell shield and the bonus damage goes through dodge and parry. Another inconsistency is Udyr's tiger stance DoT application, it will be applied if the target dodges, blocks, or parries the basic attack, however, if Udyr is blinded, the DoT will not be applied AND the spell is used up.","replies":[{"poster":"YOU BEEN WARNED","date":"2015-06-13T02:50:30.119+0000","up_votes":3,"down_votes":0,"body":"Two words: Spaghetti Code.","replies":[]},{"poster":"101100111000","date":"2015-06-12T19:27:49.616+0000","up_votes":1,"down_votes":0,"body":"I'm primarily using Kennen and Twisted Fate to get at this larger conundrum that you're pointing out. I just figured it would be easier to start off with a smaller post detailing the differences between two abilities rather than going through an extensive list.","replies":[]}]},{"poster":"ElJanitorFrank","date":"2015-06-12T23:33:24.279+0000","up_votes":1,"down_votes":1,"body":"Kennen's electrical surge applies as she fires the missile from her.\n\nTwisted Fate's stacked deck applies when the missile hits the target.","replies":[{"poster":"101100111000","date":"2015-06-13T09:53:10.055+0000","up_votes":1,"down_votes":0,"body":"Congratulations, Kennen's Electrical Surge passive is an on-hit effect and should be applied when it hits the target just like Twisted Fate's. As of right now, If both Kennen and Twisted Fate were at full stacks and auto-attacked a minion, but the minion died before their projectile hit them, Kennen would lose his passive stacks but not Twisted Fate.","replies":[{"poster":"FooDang","date":"2015-06-13T15:05:47.536+0000","up_votes":1,"down_votes":0,"body":"What he's saying is Kennens electrcal surge is applied to the projectile when it leaves kennen. If it misses its wasted. Theres a visual confirming this. TF passive applies when TF successfully hits a target. TF has the buff not the projectile. Theres a visual confirming this.","replies":[{"poster":"101100111000","date":"2015-06-13T16:04:44.152+0000","up_votes":1,"down_votes":0,"body":"If you actually looked, you'd see that not only is Kennen's shuriken charged when he has his stacks, but his hand is as well.\n\nKennen's W passive an on-hit effect, not an on-attack modifier. It should not magically be consumed if his target dies before his basic attack reaches his target.","replies":[{"poster":"FooDang","date":"2015-06-13T16:10:45.156+0000","up_votes":1,"down_votes":0,"body":"This isnt DnD breh...each champ has its own phb...","replies":[{"poster":"101100111000","date":"2015-06-13T16:17:56.200+0000","up_votes":1,"down_votes":0,"body":"Oh right, you're the guy that thinks Pantheon mains should memorize the hundreds of different ways his passive may or may not get fucked up horribly.","replies":[{"poster":"FooDang","date":"2015-06-13T17:53:05.787+0000","up_votes":1,"down_votes":0,"body":"From the wiki:\nAegis Protection does not consistently negate on-hit effects that would be applied with the blocked attack.\nOn-hit crowd control effects are never blocked.\n\nAt least you know crowd control effects are not blocked ie Leona Q or Ren W.","replies":[{"poster":"101100111000","date":"2015-06-13T20:09:40.420+0000","up_votes":2,"down_votes":0,"body":"\"Aegis Protection does not consistently negate on-hit effects that would be applied with the blocked attack.\"\n\n\"Aegis Protection does not consistently negate on-hit effects\"\n\nLOL, NOT ONLY DOES IT HAVE DIFFERENT INTERACTIONS WITH DIFFERENT ON-HITS, IT'S NOT EVEN CONSISTENT.","replies":[{"poster":"FooDang","date":"2015-06-13T21:35:04.528+0000","up_votes":1,"down_votes":0,"body":"At least it consistantly does what it's supposed to do. Block a basic attack or turret shot.","replies":[{"poster":"101100111000","date":"2015-06-13T22:08:08.731+0000","up_votes":2,"down_votes":0,"body":"Uh, on-hit effects should not apply if the basic attack does not hit. That's kind of the point of being an ON-HIT effect.","replies":[{"poster":"FooDang","date":"2015-06-13T23:25:49.685+0000","up_votes":1,"down_votes":0,"body":"Well...I'd argue it does hit. It hits aegis protection consuming the auto attack damage then the on-hit effect applies to Pantheon.","replies":[{"poster":"101100111000","date":"2015-06-14T00:18:07.407+0000","up_votes":1,"down_votes":0,"body":"If you're arguing it does hit, then tell that to Ezreal's Mystic Shot. It's on-hit portion will be mitigated by Block.\n\nOr Nidalee's take-down. It's on-hit portion will also be mitigated by Block.\n\nOr Orianna's Clock-work Wind-Up. Her passive on-hit won't apply if Blocked.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"ElJanitorFrank","date":"2015-06-14T01:11:08.315+0000","up_votes":1,"down_votes":0,"body":"I don't understand the point in your reply.  I'm simply telling you WHY the certain interactions happen.","replies":[{"poster":"101100111000","date":"2015-06-14T08:03:29.034+0000","up_votes":1,"down_votes":0,"body":"\"Kennen's Electrical Surge applies as he fires a missile\"\n\nThat's implying it's an on-attack modifier, which it isn't. Twisted Fate's Pick A Card is an on-attack modifier, but his Stacked Deck is an on-hit effect. Kennen's passive Electrical Surge is also an on-hit effect. Saying that visuals are the reason for this (which by the way is false, Kennen's hand is also visually charged when at full stacks) is not a good justification for something that is stated to be an on-hit effect to not work like an on-hit effect.","replies":[{"poster":"ElJanitorFrank","date":"2015-06-14T22:34:25.987+0000","up_votes":1,"down_votes":0,"body":"\"Kennen's hand is also visually charged when at full stacks\"\n\nTwisted Fate's isn't.\n\nThat is why they are different.\n\nHow can you not understand?","replies":[{"poster":"101100111000","date":"2015-06-14T22:38:45.595+0000","up_votes":1,"down_votes":0,"body":"Are you trying to troll, or are you genuinely confused? Because visuals are not the determining factor as to why on-hit effects are inconsistent.\n\nThey're both on-hit effects. They shouldn't be different just because \"the particles are on Kennen's projectile and hand and not on Twisted Fate's\". At that point, they should completely re-define every single on-hit ability by \"what it looks like\" and not by how it's written out to occur.","replies":[{"poster":"ElJanitorFrank","date":"2015-06-14T23:40:37.798+0000","up_votes":1,"down_votes":0,"body":"You aren't getting it.  It isn't 'because they look different'.  Them looking different is because of the way they work, which I've been trying to explain to  you but you don't want to understand.\n\nWhen Kennen gets his stacks, his next auto attack will be charged, no matter what.\n\nBut _because Twisted Fate's empowered auto attack ONLY hits certain targets_ , it checks it AFTER it has hit the target.\n\nThat way it doesn't lose it's proc when it hits a tower.\n\nAnd the visuals tell a lot more than you'd think they would.","replies":[{"poster":"101100111000","date":"2015-06-15T00:45:55.331+0000","up_votes":1,"down_votes":0,"body":"They ARE on-hit effects. They are the supposed to be the SAME mechanically because they are under the same mechanical classification. The fact that they don't is the issue at hand, and it isn't just Kennen and Twisted Fate. This includes champions like Jax and Nidalee that suffer from the same random ass inconsistencies to Pantheon, Fiora, Jax, and Teemo/Quinn.\n\nIf they're not both on-hit effects, then they shouldn't look like this:\n\nKennen - Electrical Surge\nPassive: Every 5 attacks, Kennen deals bonus magic damage equal to 40/50/60/70/80% of his attack damage and adds a Mark of the Storm to his target.\n\nTwisted Fate\nPassive: Every 4 attacks, Twisted Fate deals an additional 55/80/105/130/155 (+50% Ability Power) Magic Damage.\n\nI mean, really? Those are both on-hit effects, written to the same function, and they barely even resemble each other functionally.\n\nAll the visuals tell me is two abilities that are written down to do the same thing don't even come close to doing the same thing.","replies":[{"poster":"ElJanitorFrank","date":"2015-06-15T00:50:50.825+0000","up_votes":1,"down_votes":0,"body":"But it's simple why they don't, they are coded differently.  I understand what you're trying to say, that they SHOULD be the same, but I don't think it matters.\n\nThe interactions with other champions seldom happens, you aren't usually going to be using your on-hit affects and be under the influence of a blind at the same time.","replies":[{"poster":"101100111000","date":"2015-06-15T01:03:09.388+0000","up_votes":1,"down_votes":0,"body":"This does matter for the sake of consistency. There are a variety of champions that a lone Pantheon could run into, and at this point, he has to memorize an enormous list of different on-hit effects and whether they go through his Block or not.\n\nKennen and Twisted Fate's on-hits? They go through Block.\n\nNidale and Ori's on-hits? Nah, they don't get to.\n\nLeona and MF? They get their on-hit bonus damage AND apply their debuffs despite Block because they give sweet f.a. about Pantheon having a passive.\n\nAnd with regards to Kennen and Twisted Fate, it matters A LOT. Their gameplay rides a lot on their burst patterns, and Kennen especially cares because his stun is heavily tied into just W alone. The fact that a minion dying before my projectiles hits means I suddenly just drop my stun threat and lose significant lane pressure, but Twisted Fate doesn't because he keeps his stack, means a lot to consistent gameplay.\n\nAnd even if the specific interactions with Jax, Fiora, Quinn, Pantheon, Sivir, Nocturne, Teemo, and Banshee's Veil will rarely happen, they WILL happen, and when they do, gameplay outcome can drastically be affected because some on-hit will still apply, while others won't, and extra points of damage like that can shift entire laning phases and teamfights if utilized well.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"MidEvilKnight3k","date":"2015-06-13T03:59:11.120+0000","up_votes":2,"down_votes":0,"body":"Kennen is male","replies":[]}]},{"poster":"Jungle Lux God","date":"2015-06-12T17:06:58.693+0000","up_votes":2,"down_votes":0,"body":"There are a lot of other differences to keep in mind between the two abilities, such as:\n\n-Different attack ranges. Kennen has 50 more range on his auto attack than Twisted Fate, and can therefore proc the effect easier\n-Different proc timers. Kennen needs 5 auto attacks to proc, TF only needs 4\n-Different scalings. Kennen's scales with AD, TF's scales with AP\n-Other effects on the abilities are different. Kennen's W also has an active portion that deals damage to targets in his ult and that have a mark from his passive, TF's only gives some extra attack speed\n-Kennen's passive proc also has the benefit of adding a stack of Mark of the Storm to his target, a benefit that TF doesn't really compare with except for his Pick a Card's effects.\n\nYou can compare two abilties that are similar, but both need to be compared in the broader context of the champion.","replies":[{"poster":"101100111000","date":"2015-06-12T18:49:47.090+0000","up_votes":1,"down_votes":1,"body":"Kennen actually only has a 25 range advantage, since TF has a 525 range, but auto range should NOT determine the functionality of his empowered autos.\n\nDifferent stack requirements should not change the functionality of the ability, especially when their concept is the same. If Kennen needed 4 and Twisted Fate needed 5, they should still work the same.\n\nScalings are irrelevant, they both apply as bonus magic damage on-hit.\n\nKennen's W has an active portion that deals damage to anyone that has a stack of his passive, not just his ult. \n\nAnd the ability to stun via your passive because of an empowered auto should not determine the functionality of an ability so much that they only do two things the same: deal bonus damage on-hit and go through Block.\n\nWhen looking at the functionality of these two abilities, they are presented as being the same concept, with only one requiring an extra stack to apply. The function of two abilities (that at their core are the same) should not be changed simply to balance a champion. The champion should be balanced around the way the ability is MEANT to work. And any distinctions or differences between any abilities such as the two exemplified here should be explicitly stated and have a strong justification, because this drastically affects the gameplay of two abilities that are conceptually meant to be the same.\n\nThe concept? \"After X basic attacks, the next auto-attack will apply Y bonus damage on-hit.\" The way this ability works should not change between champions.","replies":[{"poster":"Kazaashi","date":"2015-06-12T19:45:50.594+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AtrocityEyes,realm=NA,application-id=3ErqAdtq,discussion-id=4xvGMn2t,comment-id=00010000,timestamp=2015-06-12T18:49:47.090+0000)\n>\n>When looking at the functionality of these two abilities, they are presented as being the same concept, with only one requiring an extra stack to apply. The function of two abilities (that at their core are the same) should not be changed simply to balance a champion. The champion should be balanced around the way the ability is MEANT to work. And any distinctions or differences between any abilities such as the two exemplified here should be explicitly stated and have a strong justification, because this drastically affects the gameplay of two abilities that are conceptually meant to be the same.\n\nThe fucntion of the two abilities are fundamentally different.\n\nTF's only applies extra dmg on the 4th auto attack.\n\nKennan's applies extra magic dmg on the 5th auto attack ***and*** applies a Mark of the Storm.  It is this second part that makes the abilities very different.  \n\nYou have to think of Kennan's passive ability on his W as \"a spell that is activated by hitting someone with the empowered auto attack.\"  Contrasted by TF's passive on his W as \"extra magic dmg added to the On-Hit of the auto attack.","replies":[{"poster":"101100111000","date":"2015-06-12T19:59:03.092+0000","up_votes":1,"down_votes":1,"body":"No, the function is the same. What they APPLY is MILDLY different.\n\nThey both require X stacks to do Y damage. Kennen just happens to tag an extra Z thing at the end of that. That doesn't just automatically change the fundamental principle of the on-hit effect. That just means something else happens when Kennen does it. \n\nYour logic is still flawed even if you were somehow magically right. If Kennen's empowered attack was a \"spell activated by hitting someone\", then him BYPASSING SPELL SHIELDS is the dumbest thing that could possibly happen, whereas Twisted Fate's E actually gets BLOCKED by Spell Shields.","replies":[{"poster":"Kazaashi","date":"2015-06-12T20:07:26.492+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=AtrocityEyes,realm=NA,application-id=3ErqAdtq,discussion-id=4xvGMn2t,comment-id=0001000000000000,timestamp=2015-06-12T19:59:03.092+0000)\n>\n> No, the function is the same. What they APPLY is MILDLY different.\n> \n> They both require X stacks to do Y damage. Kennen just happens to tag an extra Z thing at the end of that. That doesn't just automatically change the fundamental principle of the on-hit effect. That just means something else happens when Kennen does it. \n> \n> Your logic is still flawed even if you were somehow magically right. If Kennen's empowered attack was a \"spell activated by hitting someone\", then him BYPASSING SPELL SHIELDS is the dumbest thing that could possibly happen, whereas Twisted Fate's E actually gets BLOCKED by Spell Shields.\n\nWhen dealing with computer code, the application of a script makes all the difference.\n\nFrom the LoL wiki:\n\nThe passive applies spell effects as a ***single target ability.***\nSpell vamp is fully applied.\nRylai's Crystal Scepter will apply a 35% slow\n\nKennan's W's passive applies spell effects and TF's doesn't, that pretty much makes it a spell.  That is why I said to think of it as \"a spell that is activated by hitting someone with the empowered auto attack.\"\n\nI also thought the Spell shields thing is odd. They should totally block it.","replies":[{"poster":"101100111000","date":"2015-06-12T20:26:24.329+0000","up_votes":1,"down_votes":0,"body":"When I check the wikia's on-hit effect page and look at the list of champions that apply spell effects with on-hit abilities, Twisted Fate is listed next to Kennen, along with a few other champions, like Jax and Udyr.\n\nIt's also a handy list if you want to confuse yourself with terms like \"Special Magic Damage\" and \"Non-Physical Damage\", although they're quickly defined. It's just funny seeing all the different categories of on-hit effects, and to think there are STILL exceptions.","replies":[{"poster":"Kazaashi","date":"2015-06-12T21:05:38.966+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=AtrocityEyes,realm=NA,application-id=3ErqAdtq,discussion-id=4xvGMn2t,comment-id=000100000000000000000000,timestamp=2015-06-12T20:26:24.329+0000)\n>\n> When I check the wikia's on-hit effect page and look at the list of champions that apply spell effects with on-hit abilities, Twisted Fate is listed next to Kennen, along with a few other champions, like Jax and Udyr.\n> \n> It's also a handy list if you want to confuse yourself with terms like \"Special Magic Damage\" and \"Non-Physical Damage\", although they're quickly defined. It's just funny seeing all the different categories of on-hit effects, and to think there are STILL exceptions.\n\nThe reason TF is on that list is because of Pick a Card, not Stacked deck.\n\nFrom LoL wiki:\n\nPick a Card is an autoattack modifier.\nThe triggering attack will still apply on-hit effects. However, as the attack deals no physical damage, it will not benefit from life steal.\n\nBlue Card and Gold Card apply spell effects as a single target ability.\nHextech Revolver item Spell vamp is fully applied.\nRylai's Crystal Scepter will apply a 35% slow\n\nRed Card applies spell effects as an area of effect ability.\nHextech Revolver item Spell vamp is reduced to one-third effectiveness.\nRylai's Crystal Scepter will apply a 15% slow.\n\nI am not debating that an AA applies On-Hit affects.  Does it help to think of the W passive proc as a Spell that is applied by the On-Hit effect of an AA?\n\nIn fact, Fizz is the only champion that applies Spell Effects and On-Hit effects with an ability and ***it is explicitly stated in the ability***.\n\nUrchin Strike:\n\nACTIVE: Fizz dashes a fixed distance in the direction of the target enemy unit, dealing 100% AD physical damage plus bonus magic damage. The physical damage applies on-hit effects and the magic damage applies spell effects.","replies":[{"poster":"101100111000","date":"2015-06-12T22:07:23.657+0000","up_votes":1,"down_votes":0,"body":"Twisted Fate's Pick A Card is not an on-hit effect, it's an on-attack modifier.\n\nIf you look underneath the \"Exceptions\" section that is right above Misnomers, you will see Twisted Fate's Stacked Deck (E) listed as an on-hit effect that applies spell damage.\n\nAnd telling me to think of Kennen's passive W as an on-hit with a spell doesn't make this any more clear because of the spell shield interactions I pointed out earlier.","replies":[{"poster":"Kazaashi","date":"2015-06-12T22:33:53.076+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AtrocityEyes,realm=NA,application-id=3ErqAdtq,discussion-id=4xvGMn2t,comment-id=00010000000000000000000000000000,timestamp=2015-06-12T22:07:23.657+0000)\n>\n> Twisted Fate's Pick A Card is not an on-hit effect, it's an on-attack modifier.\n> \n> If you look underneath the \"Exceptions\" section that is right above Misnomers, you will see Twisted Fate's Stacked Deck (E) listed as an on-hit effect that applies spell damage.\n> \n> And telling me to think of Kennen's passive W as an on-hit with a spell doesn't make this any more clear because of the spell shield interactions I pointed out earlier.\n\nI see what you are saying, and I think that \"On-Hit Effect\" page is slightly out of date and not 100% accurate anymore.\n\nWhen you activate Pick a Card, you are empowering your next auto attack to activate one of 3 different spells On-Hit.  Now that I think about it, Kennan's W is pretty much the same as Pick a Card, in that, every 5th AA is empowered to activate the W passive spell on attack. For some reason though, it isn't blocked by spell shields.","replies":[{"poster":"101100111000","date":"2015-06-12T22:47:50.022+0000","up_votes":1,"down_votes":0,"body":"No matter how much you say it, Pick A Card is an on-attack modifier, not an on-hit effect. It changes his next attack to deal magic damage only along with another effect as per Twisted Fate's design, therefore not benefiting from life steal.\n\nKennen's passive W deals bonus magic damage on-hit every 5th auto attack. It still deals physical damage from his basic attack.\n\nTwisted Fate's Stacked Deck deals bonus magic damage on-hit every 4th auto-attack. it still deals physical damage from his basic attack.\n\nThe point of this thread was to note the blatant inconsistencies and contradiction in Twisted Fate's E and Kennen's Passive W. How you're trying to draw any parallel from Pick A Card is beyond me.","replies":[]}]}]}]}]}]}]}]},{"poster":"Jungle Lux God","date":"2015-06-12T19:45:56.090+0000","up_votes":1,"down_votes":0,"body":"> Kennen's W has an active portion that deals damage to anyone that has a stack of his passive, not just his ult. \n\nMy bad on this one. I meant to say in his ult or has a stack with his passive, not and.\n\n> And the ability to stun via your passive because of an empowered auto should not determine the functionality of an ability so much that they only do two things the same: deal bonus damage on-hit and go through Block.\n> \n> When looking at the functionality of these two abilities, they are presented as being the same concept, with only one requiring an extra stack to apply. The function of two abilities (that at their core are the same) should not be changed simply to balance a champion. The champion should be balanced around the way the ability is MEANT to work. And any distinctions or differences between any abilities such as the two exemplified here should be explicitly stated and have a strong justification, because this drastically affects the gameplay of two abilities that are conceptually meant to be the same.\n> \n> The concept? \"After X basic attacks, the next auto-attack will apply Y bonus damage on-hit.\" The way this ability works should not change between champions.\n\nSometimes, the way it works should change between champions in order to keep the champion balanced.\n\nLike Talon's Q and Rengar's Q. \"On your next basic attack, deal bonus physical damage\". Talon's procs on towers, Rengar's doesn't. Of course, we could make Rengar proc his Q on towers, but the last time he could do it he killed towers way too fast.\n\nOf course, some stuff could definitely be standardized among similar abilities, but not every situation calls for it.","replies":[{"poster":"101100111000","date":"2015-06-12T19:53:58.233+0000","up_votes":1,"down_votes":0,"body":"Then if there is a good justification for certain similar abilities not working the same way, it should be apparent. I certainly didn't enjoy figuring out that Rengar's Q did not work on towers, and it certainly didn't help that nothing indicated otherwise before I failed. A simple \"this does not work on turrets\" of some sort would've been just fine.\n\nPart of my problem with all of these inconsistencies is that they're hard to figure out without browsing the wikia and studying for hours on end. Of course certain exceptions can be made if truly called for, but if there is an exception, write it out, make it obvious. Don't just let players walk into this false sense that all empowered auto-attacks work on turrets because they've been playing Nasus and Talon, but not Rengar.","replies":[]}]}]}]},{"poster":"Kazaashi","date":"2015-06-12T17:24:22.659+0000","up_votes":1,"down_votes":0,"body":"I think the difference in functionality ariese from the fact that Kennan can Proc Spell effects and applies a debuff from his W passive, but TF only deals extra damage.\n\nMaybe Stacked deck is counted as an AA empowerment and Kennan's is a spell.","replies":[{"poster":"masterdragon481","date":"2015-06-12T17:50:29.520+0000","up_votes":1,"down_votes":0,"body":"No, they are viewed as the same, at least according to the wiki site.","replies":[{"poster":"Kazaashi","date":"2015-06-12T18:09:39.781+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=masterdragon481,realm=NA,application-id=3ErqAdtq,discussion-id=4xvGMn2t,comment-id=00020001,timestamp=2015-06-12T17:50:29.520+0000)\n>\n> No, they are viewed as the same, at least according to the wiki site.\n\nNo they aren't.  If you look at the LoL wiki site, Kennan's also applies spell effects.  \n\nThis leads me to the conclusion that the difference between them is that Kennan's passive applies a debuff to the opponent, making the passive function like a spell that is activated by hitting someone with the empowered auto attack.","replies":[{"poster":"masterdragon481","date":"2015-06-12T18:17:52.184+0000","up_votes":1,"down_votes":0,"body":"For Kennen: \"Electrical Surge's passive is an on-hit effect.\"\n\nFor Twisted Fate: \"Stacked Deck is an on-hit effect that triggers on every fourth attack.\"\n\nAll I did was open up the details on each champion ability, W and E, respectively. \n\nKennen's W applies spell effects with the active, not the passive, perhaps that is what caught you.  \n\nYour logic for kennen's passive applying a debuff and thus counting as a spell would make sense, if it didn't specifically state it was an on hit effect.  If its an on hit effect, it should follow the same rules as Twisted Fate's.","replies":[{"poster":"Kazaashi","date":"2015-06-12T18:21:52.255+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=masterdragon481,realm=NA,application-id=3ErqAdtq,discussion-id=4xvGMn2t,comment-id=0002000100000000,timestamp=2015-06-12T18:17:52.184+0000)\n>\n> For Kennen: \"Electrical Surge's passive is an on-hit effect.\"\n> \n> For Twisted Fate: \"Stacked Deck is an on-hit effect that triggers on every fourth attack.\"\n> \n\nAs did I, but I also read them thoroughly and thought about how they are applied in game.  You have to read past that line.\n\n> Kennen's W applies spell effects with the active, not the passive, perhaps that is what caught you.  \n> \n\nFrom LoL wiki:\n\nElectrical Surge's passive is an on-hit effect.\n\nElectrical Surge's active is a auto-targeted point blank area of effect.\nThe active applies spell effects as an area of effect ability.\n\nSpell vamp is reduced to one-third effectiveness.\nRylai's Crystal Scepter will apply a 15% slow.\n\n***The passive applies spell effects as a single target ability.\n Spell vamp is fully applied.\nRylai's Crystal Scepter will apply a 35% slow.***\n\nIt in-fact explicitly states that it applies spell effect.","replies":[{"poster":"masterdragon481","date":"2015-06-12T18:37:47.337+0000","up_votes":1,"down_votes":0,"body":"Fair enough, I was in a rush and assumed that all of the passive information would be in one part before information on the active began.  Clearly this was an error on my part.  \n\nThis would explain the differences between the abilities. but again, it would be nice if things like this were more clear for players; it shouldn't have to be such an in depth analysis to figure things like this out. But now I suppose I am just rambling.","replies":[]}]}]}]}]}]},{"poster":"FooDang","date":"2015-06-12T17:58:09.052+0000","up_votes":1,"down_votes":3,"body":"2 different champs...2 different kits...they are balanced differently...","replies":[{"poster":"masterdragon481","date":"2015-06-12T18:08:00.940+0000","up_votes":3,"down_votes":1,"body":"uh.........if both abilities are listed as on hit effects, they should behave the same way.  \n\nMorgana Q and Lux Q are both skill shot snares.  They are on different kits and different champions but have the same interactions with spell shields, blocks, stuns, untargetability, etc.  \n\nWhat you have said is not a reason for the abilities to behave differently on the whole.","replies":[{"poster":"FooDang","date":"2015-06-12T18:54:17.456+0000","up_votes":1,"down_votes":4,"body":"From the wiki:\n_On-hit effects are effects that trigger on a champion's autoattacks and a select few abilities._\n\nIt's an effect that triggers on an auto attack or ability. That's it. It pretty much defines itself. How that effect interacts with other things in this game is kit dependant...**Kit Dependant** ...","replies":[{"poster":"101100111000","date":"2015-06-12T19:38:42.851+0000","up_votes":3,"down_votes":0,"body":"Except on-hit effects across the board are not consistent in what they do, so you have to perform this literal micro-micro-mini-management games at champ select and throughout the game, especially when these circumstances arise. You have to sit here and go \"Okay, so Leona's Q can go through blind, but TF can't, but Kennen's will still get consumer by the stack, and...\"\n\nLike, really? Do I have to memorize how each individual on-hit ability works against specific things, when they can just be standardized across the board? After standardizing, exceptions should be explicit and easy to find, not this test to figure out how well you memorized Dodge's interaction with 16 different on-hit effects.","replies":[{"poster":"FooDang","date":"2015-06-12T19:59:30.403+0000","up_votes":1,"down_votes":4,"body":"How that effect interacts with dodge depends on the champion...these interactions are custom tailored to each individual champion to balance thier kit...so yes, you do need to memorize what you can and can't dodge...","replies":[{"poster":"101100111000","date":"2015-06-12T20:04:38.876+0000","up_votes":3,"down_votes":0,"body":"I bet they're just handily custom-tailored to spell shields, parry, block, and blind too, right?\n\nI also bet every high elo player probably just has this entire list of what on-hit effect can and cannot bypass just handily memorized, along with on-hit interactions with spell shields, parry, block, and blind. They probably also know exactly why all of these interactions make any sense because every single one is logical by virtue of balance in some way.\n\nOh but wait, you're probably gonna tell me memorizing over hundreds of individual on-hit effect interactions is a RIDICULOUS thing to expect ANY player to memorize. Why the hell should a Jax or Pantheon have to memorize so many ridiculous interactions for something that should be fundamentally simple and straight-forward? Because everything's \"custom-tailored\"? Really?","replies":[]},{"poster":"WarlockLaw","date":"2015-06-14T00:32:41.134+0000","up_votes":1,"down_votes":0,"body":"No block should interact with every on hit effect equally and not be based on champions as that brings up inconsistencies that are not good for a balanced gand especially so when the game doesn't explain the interactions. \n\nEssentially block should block no on hits, block all on hits, block on physical on hits, block on hit damage but not cc, block ability to apply stacks ecetera equally. Same should hold true for parry and blind, but they do not need the same interactions. I highly doubt that this is intentional design but instead is oversight in design due to these champs coming out at different times","replies":[{"poster":"101100111000","date":"2015-06-14T00:53:18.509+0000","up_votes":1,"down_votes":0,"body":"As I noted before, the iterations of both Stacked Deck and the passive Electrical Surge as we know them were released within a month of each other in 2010 (Twisted Fate in March and Kennen in April). This isn't just an oversight due to spread release dates, but rather inconsistencies in coding all together.","replies":[]}]}]}]}]}]}]}]}