{"poster":"Mattious booster","date":"2015-06-08T16:35:54.549+0000","title":"Ranglistenteam sucht Main Jungler mit Ausdauer","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Das Team BalancedRekruitment sucht einen Main Jungler mit Langzeitperspektive im Silber bis niedriegen Gold Bereich.\r\n\r\nWas wir erwarten:\r\n\r\n- Wissen &uuml;ber die Rolle\r\n- Mindestalter von 16\r\n- Teamspeak 3 und ein funktionierendes Headset\r\n- Kritik aushalten k&ouml;nnen\r\n- Spielerfahrung und Ausdauer\r\n\r\nWas wir dir bieten:\r\n\r\n- Nette Community\r\n- Teamspeak 3\r\n- Aktivit&auml;t und Ausdauer\r\n- Spielerfahrung\r\n- Spa&szlig;\r\n\r\nFalls du interessiert bist adde mich einfach Ingame : MySupportSux\r\n\r\nSehe euch auf der Kluft  {{summoner:31}}","replies":[{"poster":"Lanvira","date":"2015-06-08T17:19:48.686+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nIch zeige ebenfalls Interesse, da ich zurzeit wieder öfters LoL am Spielen bin und ein aktives Team suche.\nZurzeit bin ich in Gold 1, war letzte Season Platin. In den Sommerferien versuche ich mindestens Platin 2-3 zu kommen.\nIch bin 18 Jahre alt, besitze Teamspeak 3, Skype, Headset+Mikrofon.\nIch teste als Jungler immer neue Champions aus (erfolgreiches Spiel mit Mundo Jungle), aber hab auch meine Mains wie {{champion:120}} {{champion:421}}  oder {{champion:79}} . Ich kann Kritik vertragen, teile aber auch welche aus. Das heißt, wenn mir etwas nicht passt, versuche ich einer Person diese Fehler vorzuführen und wie man dies ändern könnte. Die meisten meiner Kollegen würden mir die Führungsrolle zuschreiben, da ich mit 3-4 Jahren recht viel Spielerfahrung besitze und weiß, wann man welches Objective an sich nehmen kann. Ich besitze aber auch Probleme wie andere Menschen^^ Wenn ihr Interesse zeigt könnt ihr mir unter diesen Kommentar Bescheid geben.\nMvg Lanvira","replies":[]},{"poster":"Känguru Chronik","date":"2015-06-08T17:01:34.938+0000","up_votes":1,"down_votes":0,"body":"Hey also ich bin interessiert an einem Ranked team ,habe oft Zeit und in der Solo Q bin ich aktuell gold 5 ,spiele aber nicht oft ranked sonst wäre ich höher. (habe nur placements gespielt ,Season 4 :Gold 2)\n\ningame Name Känguru Chronik","replies":[]}]}