{"poster":"4avataris","date":"2019-02-11T04:25:47.227+0000","title":"\"Trynda no ayuda en TF\"","subforum":"Charlas Generales","up_votes":2,"down_votes":3,"body":"Una gran duda:\nUn Trynda que **en 35 minutos no logra entrar a base enemiga** (a&uacute;n pusheando solo, TODO el juego), y que **sin lograr avanzar** (o solo feedeando por andar solo) se niega a ayudar en TF rotundamente (solo &quot;estuvo&quot; 2 veces, entrando al final solo al ks), repitiendo que es &quot;platino&quot; ....es un buen Trynda? \n\nPorque culp&oacute; y flameo mucho, sin provocaci&oacute;n, pero fue **el que m&aacute;s feedeo** y, finalmente, **REGAL&Oacute; la partida**.\nClaro, dec&iacute;a &quot;miren mi farm y mis kills&quot;, &quot;los Trynda no sirven en TF&quot;, &quot;yo carreo solo&quot; ...pero a&uacute;n as&iacute; **ni logr&oacute; pushear ni defendi&oacute;**.\n----\nPor si ves esto, &quot;platino&quot; carreado: &iquest;Un Supp 4/4/15, el que menos feedeo y con 2 honores, es un &quot;in&uacute;til&quot; (y otras palabras m&aacute;s fuertes)??","replies":[{"poster":"Shíru","date":"2019-02-11T04:47:40.437+0000","up_votes":2,"down_votes":0,"body":"Realmente con un trynda es fácil hacer sinergia. Tu team mete presión por medio de push, unos pocos hacen objetivos mientras que 2 o hasta 3 líneas están presionadas. Al final ganan sin tener que matar mucho","replies":[{"poster":"4avataris","date":"2019-02-11T12:26:06.911+0000","up_votes":2,"down_votes":0,"body":"Pues matamos mucho (habíamos dando vuelta una partida en que nos duplicaban las kills), él mismo Trynda se lleno de kills ....pero para objetivos, Baron/dragones, o lo que fuera, el \"tenía que estar solo\", desperdiciando toda la ventaja obtenida.\n\nSi es simple: De que sirve el push si al final no logró tirar hasta la base enemiga? **No hizo nada, ni atacar ni defender, solo creerse y feedear, regalando la partida**.","replies":[]}]},{"poster":"Bluethoo","date":"2019-02-11T05:28:40.740+0000","up_votes":2,"down_votes":2,"body":"era malo, probablemente era un smurfeado por eso el platino, esas estrategias solo se hacen de hierro a plata, es ilogico seguir tratando de hacer un pusheo hard cuando te estan entrando en toda la base, hay que tener cerebro","replies":[{"poster":"4avataris","date":"2019-02-11T12:22:56.663+0000","up_votes":2,"down_votes":0,"body":"Cierto? Te creo un backdoor, pero si \"pusheas\" sin lograr tirar y te están arrazando la base ...y repetidamente te piden ayuda por que el equipo enemigo inicia e inicia sin parar, es como lógico que algo estas haciendo mal (y flamear no lo va a cambiar), no?","replies":[{"poster":"Bluethoo","date":"2019-02-13T02:12:32.331+0000","up_votes":1,"down_votes":0,"body":"obvio, no justifica su liga","replies":[]}]}]},{"poster":"llsShadowsll","date":"2019-02-11T04:44:49.933+0000","up_votes":2,"down_votes":1,"body":"{{item:3070}} {{item:3070}} {{item:3070}}","replies":[]},{"poster":"BenBaxter","date":"2019-02-18T04:29:06.310+0000","up_votes":1,"down_votes":0,"body":"eso me recuerda a :  \"lucian no puede hacer trade a tanques\" {{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Este No Es Zelos","date":"2019-02-11T12:30:21.099+0000","up_votes":1,"down_votes":0,"body":"Eso \"de soy smurf carreo\" es una mentira, mira a veces juego normales en la main y eh salido 0-6-3 contra oros, osea no porque seas smurf controlas el juego y menos en lol. \n\nA ver si subis de liga hasta d5 lo que significa es que en teoría dominas a tu campeón. (En  teoría, pero también que te falta todo el otro abismo que es el control del macro).\n\nSi alguien dice soy smurf, en realidad solo esta siendo bocon, no importa la liga, durante la partida te pueden anular. Yo jugué trynda, y a veces ganaba a mis propios counters y otras perdia contra campeones a los que supuestamente debería ganarles. Mi liga no tiene nada que ver con lo que pase en si, solo indica cuantos factores tengo en cuenta. \n\nTres puntos en cuanto a trynda:\n- Si es un campeón splitpusher de solitario que se juega a dos para uno.\n- Trynda tiene poca utilidad en tf, pero la tiene, de hecho su w tiene dos tipos de uso, y para el que no lo sabe aun si no me puedo acercar, si dos adc estan tradeandose y yo tiro mi w de frente va a ganar el mio. Además en tf se usa como asesino o como distracción dependiendo de la composición con la gran ventaja de que su inmortalidad (mejor que la de kayle para eso) peromite tankear un minimo de tiempo para hacer una iniciación si no la hay.\n- Todo campeón debe jugarse de la forma mas lógica, si no puedo tirar mi torre debo rotar, participar, wardear, denegar jungla, pasar el revelador, algo debo hacer. No por tener vayne debo dar 3 básicos todo el tiempo, o por usar lee tirar la insect si o si. Uno debe pensar y ser creativo. Asi como en los tiempos muertos de oleadas tratas de rotar o trackear al jg, en el juego en si debes analizar que es lo que te conviene hacer.\n\nPara mi mucho no sabia jugar, aunque fuer amain trynda con 400 millones de puntos lo micro es algo básico, por mas mecanico que seas sigue siendo SOLO LA BASE.\n\nComo consejo, yo trataría de llevar la tf hasta el. Cuando uno juega a lo \"autista\" (sin ofender) hay que forzar incluirlo. de otra forma estamos 4 vs 5.\n\nSaludos!","replies":[{"poster":"4avataris","date":"2019-02-11T17:49:38.283+0000","up_votes":1,"down_votes":0,"body":"De hecho, intente suportearlo y meterlo en una TF, pero solo se fue diciendo \"déjenme solo\".\n...tampoco ayudo cuando era la oportunidad del Baron (siendo nuestro único tanke, u off-tank), por lo que no pudimos hacerlo.\n\nSi solo quería ÉL ganar solo ...pero no lograba tirar! XS","replies":[]}]}]}