{"poster":"Winters Ballad","date":"2017-04-09T04:14:03.292+0000","title":"[Experiencia] De Bronce a Oro en un mes y medio + Humildes Consejos","subforum":"Guias y consejos","up_votes":14,"down_votes":0,"body":"**Intro\n**\n\nHola gente, me presento, soy un jugador de 19 a&ntilde;os, maineo jungla y soporte y como indica el titulo, en esta season consegui llegar desde Bronce 1 a Oro 5 en poco m&aacute;s de un mes. Juego desde finales de la temporada 5 y jugu&eacute; algunas rankeds en la season 6 con resultados cuanto menos regulares. Mi segunda bajada a Plata 5 me tilte&oacute; tanto que decid&iacute; dejarlas.\n\nA finales de Febrero quize volver a intentar rankear, asi que jugue las placements, terminado 6W-4L. Me pusieron en bronce 1, aunque me lo esperaba, en mi mente dije &quot;&iquest;Asi que bronce Rito? Vamos a ver si de verdad soy bronce...&quot; xD\n\nMe lo tom&eacute; con seriedad y aunque no salte&eacute; ninguna divisi&oacute;n, tengo al momento de escribir este post 82W-56L, lo que me da un 59% de winrate. Asi que voy dar unas humildes recomendaciones que al menos a mi me ayudaron a subir.\n\nPor si tienen curiosidad mi pool-champ core es el siguiente:\n\nJungla:  {{champion:60}}    {{champion:254}}   {{champion:113}} \n\nSoporte: {{champion:267}}    {{champion:117}} \n\n\n\n**Consejos**\n\n1. **Si de verdad quieres subir... &iexcl;Interiorizate en el juego!:** Una de las cosas que creo que fue fundamental para lograr subir asi fue aprenderme el 95% de las habilidades de todos los campeones del juego, asi como la informacion de la mayor&iacute;a de los objetos (sus estadisticas y sus pasivas). Una aplicaci&oacute;n que us&eacute; mucho fu&eacute; LoLSummoner, ahi pod&iacute;a leer esto siempre que quiciera. Ver guias, videos y streams ayuda mucho tambi&eacute;n.\n\n1. **Un buen Pool-Champ es la clave:** como les explique antes, mi posici&oacute;n principal es la jungla y como podr&aacute;n ver, en mi Pool-Champ tengo un campe&oacute;n de da&ntilde;o m&aacute;gico, un campe&oacute;n de da&ntilde;o f&iacute;sico y un campe&oacute;n tanque. Al mismo tiempo tengo uno con excelente early game, otro con un mid game que revienta y uno que con un ulti puede definir esas no muy tranquilas team fight de late game. Un pool-champ versatil es muy importante al cometerse tantos errores de composicion de equipo basicos en este ELO (vease el tipico equipo full ad con tres asesinos y sin tanques). &iexcl;Pero ojo! al mismo tiempo un buen pool-champ requiere tener un maximo de 5 campeones por posici&oacute;n, una persona normal no puede dominar tantos campeones a su maximo nivel.\n\n1. **No juegues un campeon por jugar**: un poco de la mano con el consejo anterior... No juegues champs solo porque lo viste en ese video de los picks m&aacute;s fuertes del parche, y tampoco sigas demasiado la corriente de pensamiento de &quot;Nuevo Champ = Esta OP&quot; y entres a jugarlo con 2 partidas normales a tus espaldas. Yo tengo una opinion un poco controversial, que es que no entres a jugar  en ranked con campeones con los que no tengas al menos maestria 6, al menos a mi me sirvio eso. Algunos dir&aacute;n: &quot;yo entro a jugar rankeds con mi Jhin maestria 3 y gano muchisimo&quot;. Y es que si, no dudo que sea verdad, pero por mi humilde experiencia los jugadores con maestria 6 o 7 siempre juegan un poco mejor ya que tienen al menos la idea b&aacute;sica de las capacidades del campeon siempre.\n\n1. **La toma de decisiones en este ELO es malisima:** &iquest;Nada nuevo por aqui cierto? Un error que siempre ocurre al menos una vez en las partidas es el &quot;Over-extend&quot; la tipica situacion en la que un grupo de jugadores consiguen sacar una ventaja (ya sea de kills o de objetivos) y se quedan debilitados en la zona vaya a saber uno porque (el greed probablemente). Es entonces cuando llegan rivales y aqui con suerte pierdes la misma ventaja que sacaste, pero lo m&aacute;s probable es que termines perdiendo mas de lo que habias sacado. &iexcl;Felicidades!: acabas de tirar la ventaja de 700 de oro que habias ganado y el equipo enemigo de paso te tiro una torre aprovechando la desventaja numerica. Otra muy comun es el chasear a un enemigo cuando tienes posibilidad de sacar baron, o torres. O los innumerables throw que ocurren partida tras partida. Si me pidieran resumir esto en una oraci&oacute;n para dar un consejo seria: &quot;Busca transformar ese hambre de kills que todos tenemos en hambre de torres (y objetivos en general) y notaras una buena diferencia.&quot;\n\n1. **Usa paginas web para conocer a tus aliados y rivales mientras carga la partida**: OP.GG y LoLSkill se transformaron en p&aacute;ginas frecuentes para mi, si nunca utilizaste est&aacute;s p&aacute;ginas o eres reacio a hacerlo, te invito a que lo hagas. Es increible en mi opini&oacute;n saber que jugador va a salir mal y quien vaya a ser probablemente el carry de mi team antes de que empiece la partida. Obviamente hay excepciones y desempe&ntilde;os inesperados en las partidas. Pero en mi opinion es lo suficientemente fidenigno como para que valga la pena mirarlo en ese tiempo muerto.\n\n1. **Aprende a reconocer al carry y no tengas miedo de subirte al carro**: fundamental jugando como soporte, me ha pasado m&aacute;s de una vez que me toco un aliado que se fedeo increiblemente en linea pero consigues darte cuenta de que solo tubo un match-up favorable, o que consiguio snow-bollear por una early kill. Lo malo de estas situaciones es que a al tipo de los jugadores en los que quiero hacer incapie se les sube el ego a la cabeza y piensan que pueden hacer cualquier idiotez porque estan fed. Se me viene a la cabeza un ekko 6/0 que quizo que hagamos baron en el minuto 20, en el que terminamos muriendo evidentemente. Como nos salio mal su call para colmo nos insulto porque claro... el era que iba 6/1 y por lo tanto era el bueno, nosotros lo hicimos perder. Los buenos carrys no siempre stompean la linea, sino que con su trabajo de hormiga consiguen diferencias peque&ntilde;as y hacen buena toma de decisiones. Adem&aacute;s me he dado cuenta de que suelen jugar callados y sus pocas intervenciones son constructivas. Juntate con estos jugadores e intenta subirte al carro asistiendolos en lo que puedas.\n\n1. **Los champions de early son un arma de doble filo, especialmente en plata baja**: en plata baja y bronce alto las partidas suelen estirarse mucho mas de lo que deberian y la probablemente la ventaja que hayas conseguido con ellos halla sido tirada por tu equipo. Tube bastantes partidas con elise en la que habia ayudado a tirar torres y llevaba scores buenisimos pero mis equipos no pudieron no throwear el lead. Ademas es complicadisimo carrear con elise en late, sino vean sus winrates en partidas de +30 min. En esos momentos sabia que si hubiera elegido otro champ mis kills de early hubieran sido mucho m&aacute;s significativas, incluso habiendo sido menos. Sin embargo, he escuchado a gente de high ELO decir lo contrario sobre champs de early en este ELO. Asi que recalco, este es la humilde opinion de un nuevo goldie basada en su experiencia.\n\n1. **Consigue un buen Duo**: Ventaja importantisima, eliminas la posibilidad de que al menos uno de los jugadores de tu equipo sea uno de esos jugadores que no queremos de nuestro lado, le sumas comunicación efectiva además de la costumbre de jugar juntos y entenderse... negocio redondo. Con mi duo no tengo las estadisticas precisas pero creo que aproximadamente jugamos 52 partidas y ganamos 35.\nCreo que eso seria todo, quizas edite algunos consejos m&aacute;s que me halla olvidado m&aacute;s adelante. Saludos :D {{sticker:slayer-pantheon-thumbs}} {{summoner:12}}","replies":[{"poster":"Ellora","date":"2017-04-09T14:47:44.449+0000","up_votes":6,"down_votes":0,"body":"Esta bien, pero te falto decir que jugaste en premade. Subir solo sin ayuda de nadie, ese es el verdadero desafio.\nBueno por lo menos ya tenes la skin","replies":[{"poster":"Winters Ballad","date":"2017-04-09T15:45:40.929+0000","up_votes":1,"down_votes":0,"body":"En el momento de decidir hacer este post estaba en mi lista de cosas por poner como consejo. Pero ayer cuando lo estaba haciendo me apuraron para rankear (presisamente la persona con la que hago duoQ) y rusheé el final del post y se me olvidó DERP. Ahora veo si puedo editar algo.","replies":[]}]},{"poster":"JayInc","date":"2017-04-10T23:42:00.772+0000","up_votes":2,"down_votes":0,"body":"Tienes muy buen historial. Te felicito por jugar Elise tan bien. Si sigues con esos stats puedes llegar a Platino fácil, asi que ojalá que sigas mejorando! Gracias por el aporte también, concuerdo con tus consejos.","replies":[]},{"poster":"Hi im Eleven","date":"2017-04-09T20:30:52.230+0000","up_votes":2,"down_votes":0,"body":"k bas a cer oro bos hahahhaah, kuando yeges a oro abisame k t ago un uno bersus uno","replies":[]},{"poster":"Mioen","date":"2017-04-09T14:07:58.568+0000","up_votes":2,"down_votes":0,"body":"Bien hecho.\n\nTambién llegue a oro está season.\nhttps://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcQepfnOvJ7apNqX3IRIkuRfXB15YdlnW0SkFvTkebJ4PuuOqNINlQ\n\nSolo que yo tarde 3 season T.T, pero puedo mantener mí Winrate de 60%. Lo malo es que baje mucho mí KDA. cuando empecé a subir.\nNo es que muera mucho, solo que los rivales suelen jugar de manera más segura y eso no beneficia mí marcador. T.T\n\nFelicidades por llegar a oro.","replies":[]},{"poster":"Raúl","date":"2017-04-09T09:39:04.650+0000","up_votes":2,"down_votes":0,"body":"Me pasó casi lo mismo, entre febrero y marzo pasé de B4 a O1... y comenzó la uni, nos vimos platino :')","replies":[]},{"poster":"FurchiDC","date":"2017-04-09T06:54:47.797+0000","up_votes":2,"down_votes":0,"body":"Buenísimos consejos, gracias por compartirlos.\n\n[](http://.)\n[](http://.)\n_________________________________\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[]},{"poster":"Ulphurus","date":"2017-04-09T04:59:05.227+0000","up_votes":2,"down_votes":0,"body":"Se agradece ver este tipo de post +1 !","replies":[]},{"poster":"Yunox","date":"2017-04-09T17:08:08.426+0000","up_votes":1,"down_votes":0,"body":"Tener un buen pool champ o elegir pocos campeones y saber dominarlos.\n\nSi buscas solo subir en el juego, te recomiendo jugar unos pocos campeones *PERO SABER USARLOS A PROFUNDIDAD* y si buscas subir por lugar en el juego competitivo, adaptarte al meta y aprender que hace cada campeón es fundamental.","replies":[]},{"poster":"9081913DEL1","date":"2017-04-09T10:29:28.079+0000","up_votes":1,"down_votes":0,"body":"Buen aporte. \n\nEn lo personal, quitaria el punto 5, y del 6, lo de \"especial en soporte\"- si no es tu carry game, dejate carrear, tal cual, pero esto es en cualquier posicion, si eres adc y te tienes que comprar 2 items de vida para poder participar de las tfs, pues te los compras.\n\n\nSaludos!","replies":[{"poster":"Winters Ballad","date":"2017-04-09T15:42:38.675+0000","up_votes":1,"down_votes":0,"body":"SI exacto, en cualquier posicion debes hacerlo. Pero a lo que iba es que como de soporte tienes menos herramientas para carrear deberías hacerlo siempre.","replies":[]}]},{"poster":"Estoy AFK","date":"2017-04-09T15:26:09.767+0000","up_votes":1,"down_votes":0,"body":"Cabeza de fierro, no ser feeder, manejar bien 2 o 3 campeones y saber ser support. No extender peleas y saber que objetivo priorizar, no regalarse por el dragon de viento o de los oceanos al minuto 25 y tener un buen duo (aunque no siempre puedas jugar con el duo) y la suerte de ganar partidas 4v5 o ir perdiendo y que a los otros se les vaya el carry, que no se te corte la luz, etc. De bronce a oro en un mes en esta season :)","replies":[]}]}