{"poster":"olimit95","date":"2016-02-27T21:01:14.823+0000","title":"Unnötige Bans","subforum":"Hilfe & Support","up_votes":0,"down_votes":3,"body":"Bei mir ist es letzents passiert dass ich ein Matchmaking Spiel mit Lags hatte wo ich geleavt bin um zu gucken was los ist. Dann wurde mit angezeigt dass sich Riot f&uuml;r die Probleme entschuldigte. Nach dem Spiel bekamm ich ein niedrige Pririot&auml;t bei den Matchmaking Spielen wobei es eig. nicht mein Fehler war. WHY?{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Alustus","date":"2016-02-28T00:38:49.230+0000","up_votes":3,"down_votes":1,"body":"> Bei mir ist es letzents passiert dass ich ein Matchmaking Spiel mit Lags hatte wo ich geleavt bin um zu gucken was los ist.\n\nWann ist letztens ?\nGestern oder vor einem Monat?\n\nSoweit ich weiß gab es die letzten 2 Wochen nur gestern ein Problem.\nUnd für die Strafe muss man wie gesagt öfters AFK gegangen  sein als 1 mal, das hat eben genau diesen Grund damit man nicht bei einmaligen technischen Problemen sei es der Server oder bei sich zuhause eine Strafe bekommt.\n\nSprich da mir die letzten Tage bis auf gestern nichts aufgefallen ist dürftest du eigentlich keine Strafe haben, außer du hast mit deinem PC probleme oder gehst desöfteren Afk.\n\nAlso sehe ich hier keinen unnötigen Bann, denn in beiden Fällen liegt die Verantwortng bei dir.","replies":[]},{"poster":"Spicavius","date":"2016-02-27T21:16:55.703+0000","up_votes":2,"down_votes":1,"body":"Du hast wohl schon öfters mal ein Spiel verlassen oder warst Afk oder dced.\n\nDer Fehler von Riot hat das Fass schon zum überlaufen gebracht. Die Toleranz ist eigentlich genau für solche Ausfälle von Riot oder deinem Stromanibieter oder sonstige Notfälle gedacht.\nDie Toleranz hast du schon bereits durch eigenes Verschulden ausgeschöpft und jetzt musst du eben damit Leben, dass du keine Toleranz mehr übrig hast für etwaige Ausfälle von Riot.","replies":[]},{"poster":"Julian Chopper","date":"2016-02-27T21:12:36.669+0000","up_votes":2,"down_votes":1,"body":"Du bekommst nicht nach einem Spiel eine Strafe.","replies":[]}]}