{"poster":"Riot Scruffy","date":"2020-01-24T17:49:27.277+0000","title":"Quick Gameplay Thought: January 24","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Hey everyone. Riot Scruffy here, and I’m taking over for the Quick Gameplay Thoughts dev blog every other week. As Lead Gameplay Designer I manage the design teams that work on Champions, Game Balance, Items, the SR Map, Runes, Matchmaking, and Ranked. I plan to bring you all some updates and previews of upcoming work and go deeper into our reasoning and goals with the work that we do. Everything we add, change, and remove from LoL is done for a reason and we hope that our work makes the game better every patch. \n\n**Balance Strategy Refresh**\nThis won’t be news to many of you, but I thought it would be good to do a quick refresh of our balance strategy. The reality of League of Legends is that the game played at different levels of skill is like an entirely different game in terms of which champions and strategies are strong or weak. With this in mind, it’s impossible to have all 148 champions balanced at every level of play. \n\nOur approach is to slice the game into 4 different skill segments where we think balance is meaningfully different:\n\n* Normal (Iron - Gold)\n* Skilled (Plat - Master)\n* Elite (Grandmaster-Challenger)\n* Professional \n\nAnd then ensure that every champ is:\n\n* Viable in at least one segment\n* Overpowered in no skill segments\n\nThe core reasoning behind this is that we think that an overpowered champion can suppress the viability and richness of the entire game meta, so we want to protect players of all skill levels from this unbalanced game state. \n\n**Jungle Followup**\nWith enough time to see the results on the preseason jungle changes, we’re seeing some goals were achieved and some not. \n\n* Small nerfs - the jungle XP and gold are nerfed, but it’s looking like it’s a bit too hard in particular on farming and later game junglers.\n* Pathing is more balanced - this goal was definitely achieved, not all paths are perfectly balanced with each other but we’re much closer here than we were in season 9\n* Less early ganks more farm - this goal was not achieved, we’re seeing roughly the same amount of early ganking as season 9\n\nThe plan - we’re looking to buff up jungle XP slightly and skew towards incentives to farm over gank\n\n* Buffing jungle XP per min for minutes 4-18 and spreading it across the less targeted camps that are often skipped by gank heavy junglers\n* Pushing back the minion farm penalty removal to further nerf funnel strategies (which are rare but extremely strong)\n\n**Sett Release Retro**\nNow that Sett has been out for two weeks, I wanted to share some thoughts on how we think his gameplay turned out. Some of the long term effects of hit kit can’t really be known for sure at this point, but I still wanted to share my early thoughts.\n\n* Low complexity - Sett is a wonderful demonstration of how even in 2020, simple designs can be both satisfying and skillful. We want to do much more of this in the future where we focus on “quality over quantity” in our champ kits. \n* Unique but not game changing - Sett brings a few pretty exciting new ideas to the table like damage reflect and turning the enemy tank into a nuke. He isn’t redefining what a champion in LoL can be, but for his goals as an accessible top lane juggernaut, I think he’s on target. \n* Balance - Sett’s winrate has climbed over his first two weeks of play and he’s appearing to be a be viable as a top and jungle currently. It’s possible that he may need some slight nerfs in the future, but he doesn’t seem to be significantly OP today. \n* Clear weaknesses - Another success worth calling out is that Sett is powerful, but he provides enemies a clear opportunity for counterplay. \n\n**Upcoming balance changes for 10.3:**\n**Akali** - Many of you already saw the Akali changes on PBE. Akali is dominating both pro and elite level play, but she’s not nearly as OP for skilled and normal. With that in mind we’re trying to reduce the amount of control she has over choosing when to fight, which is a core reason why she is such a strong pick at the top tier of play. The upside here is that if these mechanics changes make her a more counterable champion at the top levels of play, we can give her some more conventional buffs to allow her to be viable in regular play. After testing the initial changes, we’re making a few changes:\nMoving away from “CC reveals her during W stealth” as it was making the experience unreliable in a confusing way and adding inconsistency to our stealth rules\nCutting R2 speed decrease - this wasn’t getting us a lot of movement for how bad it felt\nKeeping R1 as targeted as it’s effectively lowering both her escape tools and her super long range pick potential \nExploring a few other alternatives like early ranks of Q energy cost being higher to reduce her lane trade and push power\n\n**Yuumi buffs** - The Yuumi changes in patch 9.24 have left her with significant new weaknesses that allow us to give her a decent buff. The tactic we’re exploring right now is to buff Q rankups so that Q max is a viable build (letting her have an active playstyle instead of only E max build) \n\n**Aphelios** - We’re adding a max range on caibrum marks. We intend to keep it as a very long range poke effect, but bring it in line with other similar mechanics like Caitlyn or Xerath. Frankly, cross map sniping is not interactive or interesting gameplay, so we’re removing it. \n\n**Senna** - we want to shift a bit of power out of Markswoman position Senna to Support Senna. This probably means we’ll be tuning soul drops for when you get the minion kill vs when your ally does. \n\nThese are just a few of the changes in for 10.3 - expect more info next week about the full patch. \n\nThanks again everyone for playing. I’m excited to be making more posts like this about our design process and thinking. Feel free to drop questions or future topic requests in the comments.\n\nScruffy\nhttps://twitter.com/MarkYetter\nhttps://ddragon.leagueoflegends.com/cdn/9.24.2/img/champion/Sion.png","replies":[{"poster":"Zoli Ben","date":"2020-01-24T17:53:46.132+0000","up_votes":26,"down_votes":8,"body":"Can {{champion:6}}   get some compensete buffs for Conqueror ranged champion nerf? Today I got beat by a Nasus who simply outhealed himself no matter how much life steal and amplifier I had, I was even fed mostly but the fact he outheals me so much is just too bad IMO.  {{item:3075}} was useless there.\n\nhttps://boards.na.leagueoflegends.com/en/c/developer-corner/2wjE4Iqs-quick-gameplay-thoughts-september-22\n\nThis was promised over 2 years ago and it was not implamented still.\n\nFor {{champion:10}} Conqueror stacks thrice on passive since passive is a spell (2) and an auto(1). Can it get fixed for Urgot? He gains only two stacks instead of supposed 3 on intended shotgun autoattack.","replies":[{"poster":"Urgasm","date":"2020-01-24T23:10:29.898+0000","up_votes":1,"down_votes":0,"body":"Rushing grievous wounds isnt bad versus nasus.  \n\nAs an urgot main, all I want is;\n\n A mana cost revert on q or mana refund on kil so that you're not forced to take corrupting potion while also forgoing being able to poke or cs at range while keeping enough mana for a trade or duel.  Almost every other champion top can take dorans shield or sword and still spam their abilities without problem.  \n\nAlso for e to able to cross terrain, almost every other dash in the game can cross terrain.  The main issue with e is if you stand too close to a wall or dead turret or yorick ring you wont move at all and wont grab even if they're more or less standing on top of you.  You essentially stun yourself with a shield.","replies":[{"poster":"FafliX","date":"2020-01-25T14:42:56.657+0000","up_votes":3,"down_votes":0,"body":"I don't feel like the Q mana is a problem.\nI simply don't use it to poke anymore.\nI even max it last (what does maxing it even offer now?).\n\nAnd since W and E cost very little mana, I don't need corrupting either.\n\nI agree he feels weak, but Q mana would just promote his old \"I don't interact with my lane and just spam Q\" playstyle.\n\nImo just give him some damage on his W, maybe some MS on his W.\nIt actually makes me pretty sad that Aphelios got Urgot W in better, because instead of slowing him it actually makes him faster.\nI know that would be op on Urgot (it is on Aphelios lol), but at least reducing the self slow would be cool, so people don't just walk away from you every time. You should be rewarded for hitting an E imo.","replies":[]}]},{"poster":"Palaven","date":"2020-01-24T19:48:33.656+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Zoli Ben,realm=EUNE,application-id=A7LBtoKc,discussion-id=Ex34iIQE,comment-id=0002,timestamp=2020-01-24T17:53:46.132+0000)\n>\n> Can {{champion:6}}   get some compensete buffs for Conqueror ranged champion nerf? Today I got beat by a Nasus who simply outhealed himself no matter how much life steal and amplifier I had, I was even fed mostly but the fact he outheals me so much is just too bad IMO.  {{item:3075}} was useless there.\n> \n> https://boards.na.leagueoflegends.com/en/c/developer-corner/2wjE4Iqs-quick-gameplay-thoughts-september-22\n> \n> This was promised over 2 years ago and it was not implamented still.\n> \n> For {{champion:10}} Conqueror stacks thrice on passive since passive is a spell (2) and an auto(1). Can it get fixed for Urgot? He gains only two stacks instead of supposed 3 on intended shotgun autoattack.\n\nAlthough Conqueror is far more popular on Urgot, Press the Attack has had a higher winrate on Patches 9.23-10.1.  I think Urgot could use buffs anyhow though.  His mana costs just make him feel like a worse Mordekaiser.","replies":[{"poster":"DiscworldDeath","date":"2020-01-24T20:14:49.316+0000","up_votes":1,"down_votes":0,"body":"Yup, people ping me when I take PtA, but it's just better :-/","replies":[{"poster":"Crede777","date":"2020-01-28T17:57:37.307+0000","up_votes":2,"down_votes":0,"body":"Depends on who you are against.  Against squishy champions and ones that rush a lot of armor, PtA is best.  Against bruisers who build HP over armor, Conqueror is still best.\n\nMore reliable lifesteal for Urgot would be good though in that it would open up his build options.  Right now he has to rush Black Cleaver and Death's Dance.  I would rather have options for my second buy such as Righteous Glory or Frozen Mallet.\n\nOne potential change would be to lower the on-hit effect penalty on his W\n\nAlso, never go Doran's shield on him.  He receives less healing from its passive due to his status as a ranged champion.  Corrupting Pots and Doran's Blade are always better choices.","replies":[]}]}]}]},{"poster":"SilverSquid","date":"2020-01-24T18:26:33.931+0000","up_votes":14,"down_votes":1,"body":"Meddler recently mentioned you think {{champion:43}} building AP is problematic,\nbut didn't quite explain why. Nobody on the karmamains really understood that. Could you elaborate?\n\nBecause to me her Tank playstyle seems more problematic (to play against!), \nbut her heal is still untouched and all recent buffs benefit Tank Karma...\n\nWhat are your thoughts?","replies":[]},{"poster":"MayDuke","date":"2020-01-24T17:52:40.209+0000","up_votes":5,"down_votes":2,"body":"Hi Scruffy! Looking forward to the gameplay thoughts/discussions for the coming year! :)\n\nWhat are your thoughts on Orianna at this point in time and her place in the overall game?","replies":[{"poster":"Riot Scruffy","date":"2020-01-24T17:54:26.516+0000","up_votes":15,"down_votes":3,"body":"Ori seems to be in a pretty good spot overall - balanced, fun and unique kit, fairly clear counterplay. Not planning anything big for her right now.","replies":[{"poster":"Süjo","date":"2020-01-24T20:43:47.498+0000","up_votes":1,"down_votes":5,"body":"So where's the murderous Diana? You promised that it would continue to be viable as an assassin AP but completely nerfed the scaling for a tremendously weak end with the exception of a few situations where somehow you can get in the middle of the 5 opposing players and that they are very close to each other. and you don't die and neither do they escape in the process.\n\nDiana currently starts with 3 damage skills that do not fit because they took the CC, you go in the face he walks back and you do nothing else, your damage is low and no CC ... It was bad to do the scuttle crab, the last one that takes too much to reload, the old way you always had the potential to do something, so now it's completely broken, or you will never do anything or go lucky of the opposing team falter and group, so you will give it a ridiculous solo combo wombo. Where is the assassin diana who has been told several times that they would keep? and now you're not without damage or to kill a support if it is away from the team, or flash or anything else it can do for 1s to get out of the way or stop you ...\n\nZac was a very strong champion before the remake, and even after the remake, a mere .25s of his E warning time increased and he became the champion least see myself in the game, when I was actively playing, I still found a single one Zac every 3 months, with a mere .25s lead to counterplay, now make a meaningless change to the diana and give 1s lead to counterplay ... with basically the same kit, just shifted numbers out of the others skill and put in the E (now R), and made the champion go without damage and without CC ... The old way you always had potential for damage, and always had a CC, now has neither 1 nor the other. I have mentioned over and over the only change that would make sense in the day was to switch the AS passive from the old E to the passive, and the mana passive to the E so that you get more mana the more units you get with And because this old mana passive, most players didn't even know it existed. In addition, the old-fashioned champion was already in need of a reduction in her CC's CD because it was too high, now it's getting worse all the time.\n\nIronically in the case of zac they did the remake of the remake and did not return the numbers the way it used to be, the champion got the ultimate weaker / less useful, and the other numbers continued completely nerfed ...","replies":[{"poster":"Mafros","date":"2020-01-25T06:29:37.629+0000","up_votes":7,"down_votes":0,"body":"Wtf are you talking about, Diana is busted right now. The only way she can lack damage is if you play with your feet instead of your hands, and even then she might get some kills.","replies":[]},{"poster":"ProphetOfDraven","date":"2020-01-26T07:14:56.332+0000","up_votes":3,"down_votes":0,"body":"Pro tip, Right click on your opponents, auto attacks do significant damage!","replies":[]}]}]}]},{"poster":"Deathfall","date":"2020-01-24T18:20:26.322+0000","up_votes":13,"down_votes":2,"body":"What is the reasoning behind buffing Karma's base stats instead of her scaling? You've tried this nearly 7+ times and you always nerf Karma right after. Meddler made a ridiculous statement that building AP on Karma is a major issue, but wouldn't you say the fact that she has no gameplay direction/identity, she has three gameplay identities and doesn't excel at any of them, all of her damage is funneled into a basic ability and Mantra ability, and the fact that she is extremely bland and lackluster is a bigger issue than building AP on her? The following stuff I listed are things long time Karma mains have been telling Meddler, Reav3s, Ricklessabandon, NeuroCat, and you for almost 7 years now. It doesn't seem like a single person in this company is wanting to rectify mistakes that they made on a art, gameplay identity and kit level, but lets work on 5+ new champions within 6 months and focus all efforts on the same champions like Aatrox, Akali, Ryze and new ones every single patch cycle.\n\nYou completely ruined Karma and did even more injustice by removing things that made her interesting and fun to play. You didn't improve the champion because your failure to address her long standing issues divided the community and created another gameplay identity that has no business being on Karma.  Step it up. You've literally ignored Karma for 7 years and players are tired of playing against a overly numbers buffed champion with hardly any counterplay and the players playing as Karma are tired of playing a champion that is boring and doesn't excel at anything but being a Shield Bot late game. Karma's Mantra E literally exists on two item actives and can be replicated using both of the item actives.\n\nFix Karma's:\n\n- Failure and confusing identity crisis.\n- Give her a gameplay direction.\n- Address and remove Karma tank/top lane from the game.\n- Give her more unique things with her Mantra and not something that exists on other champion kits and item actives.\n- Give her more damage on something else and remove damage from Mantra Q. It shouldn't be one shotting players.\n- Force Karma to build AP to do more damage and build shield enhancing items to have stronger shields/heals/utility.\n- Fix her rushed and terrible art assets that is a poor reflection of YOUR abilities.\n\nWhere is the work? You've had 7 years to do something but you all prefer to continue to ignore the mains and the pleas for work to be done, but you sit here and talk about new champions, Ryze and other things all the time. What are you doing about the problems with other champions that you clearly either don't care about or you just don't value anymore? It's really ridiculous at this point.","replies":[]},{"poster":"Valor Bot","date":"2020-01-24T18:06:38.194+0000","up_votes":3,"down_votes":1,"body":"Hi Scruffy, was wondering if you could take a moment to give your thoughts on Quinn. She feels pretty unsatisfying to many at the moment, both thematically and gameplay wise. I also recently made a thread on Reddit that got a fairly positive response, maybe you could take a look? It’s in regards to her scrapped rework from a few years back that served as a sort of mix between her pre-rework and post-rework versions: \n\nhttps://www.reddit.com/r/leagueoflegends/comments/ecpbq0/a_quinn_rework_was_accidentally_shipped_to_the/","replies":[{"poster":"Riot Scruffy","date":"2020-01-24T18:11:59.931+0000","up_votes":10,"down_votes":0,"body":"Sure, considering that Quinn is actually quire strong right now (balance wise), and that she's still unsatisfying (as you say) we would need to look into mechanics or kit improvements rather than buffs/nerfs. \n\nQuinn historically (and still true today) has a small but dedicated player base. Somewhat few players play her but Quinn mains play far more games on her than other champion mains do. So we do want to be respectful of that community if we do changes in the future.","replies":[{"poster":"Valor Bot","date":"2020-01-24T18:23:50.204+0000","up_votes":5,"down_votes":0,"body":"Thanks for your reply. I agree respecting what players love about the champion is important.  That said, many of Quinn’s current players who remain dedicated to the champion to this day (like me) continue to play her in part because she’s still the closest version of the champion they fell in love with all those years back—I don’t think it’s 100% a case of “Quinn players only love her current iteration.”\n\nWhen the team decides to go back and take another look at Quinn, do you reckon it would be possible to appease both parties? Quinn players who picked up the champion after the rework love the roaming aspect of the champion, while older ones sorely miss the melee assassin playstyle as Valor. Those two identities aren’t necessarily mutually exclusive, and it doesn’t seem to be a case of incompatible audiences if both can work simultaneously.","replies":[]}]}]},{"poster":"IxtaliKing","date":"2020-01-24T18:03:03.884+0000","up_votes":18,"down_votes":7,"body":"Thoughts on Karma? \n\nSince her mini-rework was shelved there's been a great deal of number shifts that have left Karma mains confused and dejected - particularly those of us who play Mid.","replies":[{"poster":"Spice and Wolf","date":"2020-01-24T19:01:29.602+0000","up_votes":11,"down_votes":26,"body":"Karma crybabies as first comment again. XD","replies":[{"poster":"SilverSquid","date":"2020-01-24T19:08:19.625+0000","up_votes":13,"down_votes":5,"body":"_\"Oh no look at the people who actually want answers for why Riot seems to constantly and cluelessly buff &amp; nerf their champion for multiple seasons. Let me show my superiority to them by calling them names XD.\"_\n\nHonestly, contribute to the discussion or go play some ARURF, we don't need this here.","replies":[{"poster":"Spice and Wolf","date":"2020-01-24T19:22:35.820+0000","up_votes":6,"down_votes":16,"body":"***","replies":[{"poster":"IxtaliKing","date":"2020-01-24T19:32:41.944+0000","up_votes":16,"down_votes":2,"body":"Please.\n\nThere are enough people to care about ALL aspects of this game. We can all focus on what we're most interested in at any given moment. Relax.","replies":[]}]}]},{"poster":"evilsforreals","date":"2020-01-24T19:26:42.108+0000","up_votes":11,"down_votes":1,"body":"Says the one making threads crying about Karma players. Big brain plays right there hunny\n\n{{sticker:zombie-brand-mindblown}}","replies":[]}]},{"poster":"Riot Scruffy","date":"2020-01-24T18:17:45.291+0000","up_votes":16,"down_votes":37,"body":"We need to see how 10.2 changes land for her, hard to say yet. Generally we think that the players that love karma and the ones we put the most effort to help are support karma players. It can be tricky because she tends to show up in very high ELO as a solo laner. \n\nOver time we will probably continue to focus power into her as a support and possibly look for small improvements to her skills where we can.","replies":[{"poster":"Rakshasa Ranja","date":"2020-01-24T19:23:22.850+0000","up_votes":18,"down_votes":18,"body":"What a joke.\n\nSo you're telling me solo lane karma can just die in flames because \"most play her support\"? Yeah, thanks. How about you finally man up and take responsibility for the mess you (as Riot) created instead of cluelessly buffing and nerfing her over and over again praying one of the buffs stick to the wall?\n\nYou know why most played support almost exclusively? Because that's the last role she's relevant in.\n\nTop (tank) was always a meme pick that people used to cheese.\nMid is gone cause of 5.10 and then the latest AP ratio nerf on Q.\nSupport is in flames cause she's good only when she's overbuffed and beyond garbage when she's not.\n\n**You removed her from other lanes and now use this as an excuse to simply ignore her solo lane. **\n\nAt this point, nobody really cares about your excuses anymore. We all saw the backlash when NC posted her changes that \"put the most effort to help support karma\". These changes (ignoring ally W) would at least address the biggest offenders in her kit creating a path that could be followed. What you're doing since forever is just adding +10 / -10 to values or +10% / -10% to scalings and did it EVER work out for you? She's literally buffed and nerfed back to back in a loop since her \"mini rework\" in 2015.\n\nIf your own pride as a game developer prevents you from listening to the very people who play the champion for hours on end and know it best, why even bother touching her? Is it just there to create illusion of \"we're listening to you\"?\n\nPlease, **I beg you** - either do something to fix her or just let her rot and never touch her again.\n\nFrom a very passionate (almost 2kk points spread throughout accounts) **SUPPORT KARMA PLAYER THAT WOULD LOVE TO PLAY HER SOLO LANE AS WELL**.\n\nPS: Wherever NC is now please bring her back, give her enough resources and let her fix this champion - **she was the one because she was passionate about Karma.**","replies":[{"poster":"Low Iron Player","date":"2020-01-24T20:22:41.339+0000","up_votes":11,"down_votes":9,"body":"So you're telling me Jungle Kassadin can just die in flames because \"most play him midlane\"? Yeah, thanks. How about you finally man up and take responsibility for the mess you (as Riot) created instead of cluelessly buffing and nerfing him over and over again praying one of the buffs stick to the wall?","replies":[{"poster":"evilsforreals","date":"2020-01-24T20:32:58.987+0000","up_votes":13,"down_votes":4,"body":"When was jungle Kassadin a thing? \n\nKarma has been a solo laner for years, it's only recently that Riot has been implementing nerfs that hurt her mid lane (while weirdly buffing her top lane)","replies":[]}]}]},{"poster":"SilverSquid","date":"2020-01-24T18:33:09.617+0000","up_votes":20,"down_votes":6,"body":"Wait, so you say people in high elos actually _want_ to play her in sololanes,\nand you wanna kill that playstyle? Why?\n\nDo you wanna completely abandon her as a mage?\nBecause both the recent changes and your comments make it seem like it.\n\n...\n\nKarma won't be a good, balanced or fulfilling support as long as she only has one true enchanter spell (E) and is forced to mostly only mantra it. It feels like you should rethink your approach to her; either rework her kit to be a fulfilling enchanter or actually embrace her enchanter (hybrid battlemage) playstlye you claimed and wanter her to have. Otherwise the \"choice\" mantra would uniquely offer to her kit feels absolutely wasted.\n\nWith all due respect, but you guys seem to have no vision for her.","replies":[{"poster":"Jahsuo Onfroy","date":"2020-01-25T05:26:10.823+0000","up_votes":1,"down_votes":5,"body":"They've literally hard buffed solo lane Karma this patch though. Buffing her Q base ups wave clear and poke, and the W buff adds to Tank top builds as well. As a hybrid mage/utility mid she's still quite solid as well. Itemization has favored her greatly over the years and now have very solid build paths to choose from into any comp and with any comp.","replies":[{"poster":"SilverSquid","date":"2020-01-25T12:16:15.000+0000","up_votes":7,"down_votes":0,"body":"Q is still **worse** than before 9.19 if you have 50+AP\nSo a typical AP build suffers most from it. \nEven with the better W, she used to deal more damage with her combo at 150+AP. \nBut since she more often just Q poked than all-in, even that sounds better than it is.\n\nAll of this is probably the reason, why her playrate has sunk so low [she doesn't even appear](https://u.gg/lol/tier-list/?role=middle) as a mid/toplaner on many sites at all.\n\nAlso:\n\n> very solid build paths to choose from into any comp and with any comp.\n\nSure, she is flexible, but it's currently because she doesn't scale well with anything. Maybe CDR. She has no \"solid\" buildpath in that regard, even after years of playing her, there is still no fixed buildpath for her, especially mid/top. \n\nAgain, you can sell this as a strenght, because she is flexible, but it's also a weakness, since she just doesn't scale well with any items. That's because her mantras for example scale with different and sometimes exclusionary stats (AP&amp;mpen, restistances&amp;hp, shield&amp;heal respectively).\n\n> Itemization has favored her greatly over the years\n\nActually, since she can abuse the Ardent passive so well, she had to be nerfed in many regards to make up for the power she has WITH the item. Which pushed her into this awkward spot of having to build it as a support and having all her power in RE-ing her whole team, but having little to do else (since the reast of her kit doesn't do well with it).\n\nItemization pulls her into at a least 3 different directions, which is really hard on her already bland identity.","replies":[]}]}]}]}]},{"poster":"Łukαsz","date":"2020-01-24T17:53:52.450+0000","up_votes":4,"down_votes":2,"body":"Any toughts on Sylas? Was the mini rework successful in your opinion?","replies":[{"poster":"Riot Scruffy","date":"2020-01-24T17:58:16.005+0000","up_votes":13,"down_votes":3,"body":"Sure - so far the 10.1 changes seem fairly successful. He's 49% winrate across all elos and a low priority pick in pro. Playrate is up by 300% since the changes, so we hope that means that people are still enjoying his play style. \n\nWe haven't seen enough data to be sure that he's actually in the right balance state yet though, may need some slight buffs, maybe not.","replies":[]}]},{"poster":"Predatorator","date":"2020-01-24T17:56:53.136+0000","up_votes":10,"down_votes":4,"body":"What do you think of Skarner finding success toplane?","replies":[{"poster":"Riot Scruffy","date":"2020-01-24T18:05:03.512+0000","up_votes":10,"down_votes":1,"body":"I don't see a big problem with it right now, it's cool when players discover new strategies for champs like this. Like anything else - if it becomes too dominant of a pick or strategy (OP) we will nerf it.","replies":[]}]},{"poster":"Valentin888","date":"2020-01-24T17:53:28.758+0000","up_votes":11,"down_votes":22,"body":"Are there any irelia buffs or changes planned for future since she is sitting on a 46-47% winrate at all ranks and is barely touched in pro play. What are your plans for this champion ?","replies":[{"poster":"Riot Scruffy","date":"2020-01-24T18:02:07.172+0000","up_votes":16,"down_votes":1,"body":"Not currently planning any Irelia changes, she's a very high skill ceiling champ but seems close to balance right now. Her average winrate looks lower than some others, but that's mostly coming from her learning curve and skill ceiling. With enough games on her, we think you can succeed at any elo. Her engagement and stickiness have been steady for months, so that's also something we consider - are players enjoying and sticking with the champion over time.","replies":[{"poster":"Sharpest glasses","date":"2020-01-24T18:22:00.180+0000","up_votes":6,"down_votes":0,"body":"What do you think of Aatrox in this regard in Solo Q ?","replies":[{"poster":"Riot Scruffy","date":"2020-01-24T18:36:20.898+0000","up_votes":9,"down_votes":3,"body":"He's very similar - high skill cap but seems quite good when played by a main.","replies":[{"poster":"Süjo","date":"2020-01-24T20:44:45.779+0000","up_votes":1,"down_votes":5,"body":"So where's the assassin AP Diana? You promised that it would continue to be viable as an assassin AP but completely nerfed the scaling for a tremendously weak end with the exception of a few situations where somehow you can get in the middle of the 5 opposing players and that they are very close to each other. and you don't die and neither do they escape in the process.\n\nDiana currently starts with 3 damage skills that do not fit because they took the CC, you go in the face he walks back and you do nothing else, your damage is low and no CC ... It was bad to do the scuttle crab, the last one that takes too much to reload, the old way you always had the potential to do something, so now it's completely broken, or you will never do anything or go lucky of the opposing team falter and group, so you will give it a ridiculous solo combo wombo. Where is the assassin diana who has been told several times that they would keep? and now you're not without damage or to kill a support if it is away from the team, or flash or anything else it can do for 1s to get out of the way or stop you ...\n\nZac was a very strong champion before the remake, and even after the remake, a mere .25s of his E warning time increased and he became the champion least see myself in the game, when I was actively playing, I still found a single one Zac every 3 months, with a mere .25s lead to counterplay, now make a meaningless change to the diana and give 1s lead to counterplay ... with basically the same kit, just shifted numbers out of the others skill and put in the E (now R), and made the champion go without damage and without CC ... The old way you always had potential for damage, and always had a CC, now has neither 1 nor the other. I have mentioned over and over the only change that would make sense in the day was to switch the AS passive from the old E to the passive, and the mana passive to the E so that you get more mana the more units you get with And because this old mana passive, most players didn't even know it existed. In addition, the old-fashioned champion was already in need of a reduction in her CC's CD because it was too high, now it's getting worse all the time.\n\nIronically in the case of zac they did the remake of the remake and did not return the numbers the way it used to be, the champion got the ultimate weaker / less useful, and the other numbers continued completely nerfed ...","replies":[{"poster":"Urgasm","date":"2020-01-24T23:12:23.354+0000","up_votes":1,"down_votes":0,"body":"diana seems the most balanced shes ever been right now","replies":[{"poster":"Süjo","date":"2020-01-25T05:06:32.532+0000","up_votes":1,"down_votes":2,"body":"No she don't do damage to kill a suport, even 4 lvl above, and 5 ap item x 2 support itens, i has near 600 games with DIana last season, she is unbalanced now. If you make a unbeliveble play you will make a insta pentakill, but if you don't do it, you don't have any damage, even to kill a supporte, because all damage is on ult with 3 or more oponents","replies":[{"poster":"Urgasm","date":"2020-01-26T06:58:58.583+0000","up_votes":2,"down_votes":0,"body":"Straight up just oneshotting people isn't balance, dueling people is","replies":[]}]}]}]}]}]}]}]},{"poster":"Doctor Simba","date":"2020-01-24T18:08:02.132+0000","up_votes":6,"down_votes":1,"body":"Looks like there's a typo in the post, says you're limiting the range of Apehlios's Crescendum marks when Calibrum is the one that has marks.","replies":[{"poster":"Riot Scruffy","date":"2020-01-24T18:09:04.448+0000","up_votes":6,"down_votes":0,"body":"ty fixed","replies":[]}]},{"poster":"Sharpest glasses","date":"2020-01-24T18:16:19.538+0000","up_votes":5,"down_votes":0,"body":"Any update about the Wukong rework ? Is making him viable as  bruiser still  a thing ?","replies":[{"poster":"Riot Scruffy","date":"2020-01-24T20:18:23.150+0000","up_votes":3,"down_votes":0,"body":"We're still working on it. Don't want to promise any particular patch because we want to make sure it's done right.","replies":[]}]},{"poster":"MasterOfMetaI","date":"2020-01-24T18:13:30.245+0000","up_votes":5,"down_votes":0,"body":"HI Scruffy, could we get anything for Aatrox. Right now as he is there feels like you have no reason to pick him over any other toplaner. You can land all your sweetspots and your passive and barely trade better than the enemy toplaner, while also having poor regen in lane. While I understand you nerfed his regen because of his passive, this was before the nerf to reduce the healing he recieved from minions. Maybe you could look into giving him back some of that regen or passive healing on minions?","replies":[]},{"poster":"PowerOfDrainAge","date":"2020-01-24T18:20:25.726+0000","up_votes":6,"down_votes":1,"body":"Any thoughts on my boy Galio?","replies":[]},{"poster":"Daddy Ants","date":"2020-01-24T19:02:07.396+0000","up_votes":4,"down_votes":0,"body":"> Yuumi buffs - The Yuumi changes in patch 9.24 have left her with significant new weaknesses that allow us to give her a decent buff. The tactic we’re exploring right now is to buff Q rankups so that Q max is a viable build (letting her have an active playstyle instead of only E max build)\n\n\nMore like\n\nShe has a skin coming and we need to boost sales.","replies":[]},{"poster":"HappyâCarlaTails","date":"2020-01-26T11:15:06.165+0000","up_votes":3,"down_votes":0,"body":"Wish it will be same as it was in Season 5(But without 9000 ap and armor  only...Lesss damage - so good, without any oneshots in early, most of picks was there, melee can farm vs range champs), cause seems that more 25 champs are overbroken now, better in all - high-stats, playmake, oneshot everything, U have balanced Op champs 4 Op champions :/ Ur winrate champ analitics is bad, how u can think that this champ is balanseed, It is Team Play game - here more than 9 more players, Team wins, but it has more 2-3 op champs, which can carry even if pick Master Yi on Top, no one will not pick normal champs on top, it always op vs op, op vs op can be 50% winrate, u should see more local match up wins, if Darius has over 110 win match-ups on Top - it's not alright, Make bots play 1x1 in dedicated mode and fastest, may they check all variaty of match-ups, look at PVP statistics - pay attentions on champs which one have 5 more kills at 7 minute, what match-ups they have? You have now good team roll(but not unranked - they makes all bad) soo see on what champs players have skill-level boost, pay a lot of attention to this champs...Make ur own scream-Team in different skill level, play with them few matches on random to roll their skill-level into the teams, play with them every champion> which u want to balance, boost champs and 10 or more matches, in other time - try to play unusal match-ups with them..","replies":[{"poster":"HappyâCarlaTails","date":"2020-01-26T11:57:41.895+0000","up_votes":3,"down_votes":0,"body":"And it will not be like - Lets nerf all playmake champs..oh Nidalee and Azir yea - lets nerf them 1000 times))) Hmm, maybe it should be good, if they will have more weak and super risky in early game, but with their playmake they can reverse it in early, so and late game they will be monsters, as they does.....Get out all their base damage skill level ups, and get it into more high scale(it will make them high risky in early game, and if they will not make playmoves and overplay oponents, they will fall and couldnt win this line, however their have good chance with their skillset in teamfights and if they make shoutdowns in early or help of jungler, they will become strong and may be super strong in mid game, Yes, it will scare all newbie players and shine pro, but no sorrow - this champs are 4 them, maybe it hard champs with 3 more skill cloud, if u have not it, sorry, try and try better this hard champ) All skill level ups will have +some usefull stats, as slow, cdr and another...Next one to make lower all mana costs/ec, cause this champs super need to make a lot of combos in one move....And make some main \"skill\" 4 them, as u have done in Assasins rework, make this main skill otheer-extra scale by champ level per game, so they will be useful in all time of game and will not fall to much.........Except Irelia, cause all of her mechanics, like her art - u have done 4 Trinity Force, so no matter what nerfs, she have get Trinity and it makes her over op, so maybe stop nerf her with so stupid things like she can dont get minions with her Q, which everyone dont like it, it no make her weaker - it's makes fails in special lucky moments....But nerf Trinity and other champs get bad item, better get her damage limit of one hit effects per champ level(so in late, she will be same), like u have done in Urgoth W....And Stop cut unique mechanics of champs like Irelia's disarm, Akali micro-stan..few more and All champs will have only 3 damage skills and R that hit single target","replies":[]}]}]}