{"poster":"Robo23","date":"2015-10-02T09:24:10.260+0000","title":"Nerfs","subforum":"Miscellaneous","up_votes":1,"down_votes":4,"body":"Ok so it seems every so often that a champ seems so hopelessly op that they need to be nerfed. So i put a list on with all the champs it think need to be nerfed. Please feel free to say any champs u think will help. BTW they probably wont get nerfed\n-- Darius {{champion:122}} , needed to start somewhere. His heal is op and early game he is awesome\n-- Riven {{champion:92}} , Really quite powerful, i think shes already getting nerfed\n-- Teemo {{champion:17}}, He is  getting annoying\n-- Listen (Sorry Lee sin), {{champion:64}}  I like him and all but he seems kinda annoying\n-- Garen {{champion:86}} , He&#039;s really awesome, except when u are the villain its kinda hard to win\n-- Mastery (Master Yi, all these jokes have been told already), {{champion:11}} , annoying when he starts to get fed. Which is often\n-- Fiora, {{champion:114}} ultra powerful\n-- Swain ({{champion:50}}, one of the best tacticians if played right\n-- Irelia {{champion:39}} Awesomely powerful\n-- Heimerdinger {{champion:74}} Heard it gets easier to beat at higher lvls but still seems op\n-- Yasuo {{champion:157}} So fast and the flow meter is really hard to beat\n-- Katarina {{champion:55}} For almost same reasons as yas, also almost flash\n-- Mordekaiser {{champion:82}}  Powerful\n-- Talon {{champion:91}} Ok so hes not too good but can still be op\n\nThere are too many champs that need buffs so i wont say them. Anyway comment and GLHF on summoners rift","replies":[{"poster":"mosse is ali","date":"2015-10-05T06:35:31.842+0000","up_votes":1,"down_votes":0,"body":"if the riven changes go through people who actually AA between spells got a massive buff. Unluggy UCE","replies":[]},{"poster":"Jink","date":"2015-10-03T19:09:37.901+0000","up_votes":1,"down_votes":0,"body":"The game is balanced though because they can be on either team though which I came to realize.\n\nI've legit lost games to just a Janna alone - her ulti resets put us back every single fight and there was nothing we could do about it, she completely shut down our entire engage system and we lost to their follow up poke and engage afterwards - it happened repeatedly.\n\nThere are a lot of Snowball Champions that are frustrating but Riot can't do anything about them because after all the game is unbalanced by default so they try to keep some form of balance but also the Chaos of the League often leaves different Champions shining at different times and little things they add or change can have a huge ripple effect in the norm of the league and cause all kinds of odd power surges and weaknesses to arise - keeping it fresh and interesting.","replies":[]},{"poster":"Zorphiax","date":"2015-10-03T16:10:09.827+0000","up_votes":1,"down_votes":0,"body":"Okay so I'm gonna go trough most of the \"needed nerfed champions\" you pronounced:\n\n1. {{champion:122}}, Darius can be quite over powered with his ult and his life steal from his q but {{champion:122}} can be beaten if you play against him right.\n2. {{champion:92}}, Riven is a powerful champion with her shield knock up and stun but after she does her stun and 3 q combo she can't do anything for a while.\n3. {{champion:17}}, HAHAHA, Teemo you little devil, always planting mushrooms and everyone walks on them destroys your beautiful farm. Why don't they just buy Vision wards or upgrade a trinket lens.\n4. {{champion:64}}/{{champion:50}} , Well I can't say much about Lee Sin and Swain because he is... well really balanced maybe a few stat changes but nothing big. (because nothing is wrong with him.)\n5. {{champion:86}}, Okay so all of the champions on your list apart from like 3 are unbalanced. Garen is one of the most. Garen when fully built as a Tank can have:\n- 5.5K hp (200+ hp regen/sec after 5 seconds of no combat)\n- 300+ of both armor types (85%ish)\n- 2.5 sec silence (relativity low CD)\n- the villain effect (I swear this was for a story line that's finished now)\nthat's enough of why I think Garen is op there are other things but I will leave them for another time.\n6. {{champion:55}}/{{champion:11}}, gonna combine these 2 together because it's stupid how many times it is said that to beat Yi/Kat just stun/silence/root/knock up/bind/stare etc. and you win if you react fast enough.\n7. {{champion:39}}, Irelia is quite strong but is not over powered unless fed. just keep her under control and try not to feed her and she should be fine.\n8. {{champion:74}}, Heimerdinger is only strong if you let him build his turrets up and you let him poke you, to beat champs like Heimerdinger just make minions take the blast then go all in and take his towers out without getting stunned.\n9. {{champion:157}}, poke him with 1 spell or AA so his shield is gone then push lane try not to get knocked up and you should prevail in that lane.","replies":[]},{"poster":"noogai","date":"2015-10-02T11:41:55.087+0000","up_votes":1,"down_votes":0,"body":"Garen is fine. Maybe tune his damage a little, he can build nothing but cleaver and still womp you for some hefty damage without villain or ult.\n\nRiven changes look interesting. Sorting the wheat from the chaff when it comes to skill-based plays, i like it.\n\nTeemo is annoying but easily dealt with.\n\nLee Sin just has a highly overloaded kit that is hard to deal with. Understanding how to dodge skillshots will help against him, he may need some changes but as somebody who both plays with and against him, i don't see a real need for them.\n\nDarius needs a bit of a hike in mana cost for his abilities. His damage/healing/tankiness is perfectly tuned.\n\nMaster Yi is perfectly fine. He is the embodiment of a \"don't feed me\" champ. Feed an ADC, what happens? They start to steamroll your team. Simple solution, don't feed Master Yi.\n\nFiora is strong, yes, but she has major weaknesses. She relies on breaking vitals. CC her and it all goes to shit, position right and she can't do much.\n\nSwain is just silly. Just don't let him get kills in lane, outfarm him which is really easy as he's AP champ, and outscale him with Yasuo/Talon/Zed/any AP champ that can burst.\n\nIrelia doesn't need a nerf. Meme so supreme i just gotta scream.\n\nDonger dies really easily. Just make sure you poke him away from his turrets so you avoid turret damage.\n\nYasuo is perfectly fine. He has a huge list of hard counters (talon, swain, zed, syndra, annie, morgana and lissandra to name a few), so he doesn't really need a nerf as almost half the champ stable is good against him in lane.\n\nKatarina is easy to deal with. Her damage before level 6 is pathetic, anybody that can beat yasuo in lane can beat kat.\n\nMorde is only strong if he gets his 3 Q's in now. Play a kity champion like yasuo or ahri.\n\nTalon doesn't need any nerfs. He's a strong counter pick, but gets countered by ranged champions very easily.","replies":[]},{"poster":"Robo23","date":"2015-10-02T11:28:50.888+0000","up_votes":1,"down_votes":0,"body":"Thanks for the reply guys and yes i read the comments. Im only lvl 25 so i dont play much except blind pick so this is from my point of view. Anyway i understand what you are saying and it seems that there are clear counters. Anyway I just put these up since they are the main ones being commentd on. So thx","replies":[]},{"poster":"DragonOfTheVoid","date":"2015-10-02T10:43:12.829+0000","up_votes":1,"down_votes":0,"body":"{{champion:86}} is ok atm yes if your the villain you will get fucked up by him but that's what he is sapost to do \n{{champion:92}} I don't think its a nerf or a buff it will just make her go from burst to damage over time and separate the good players from the great players \n{{champion:122}} I don't think its his heal that makes him powerful its his low mana cost \n{{champion:157}} his passive needs to be nerfed from times 2 to times 1.5 or something maybe a full rework on his passive \n{{champion:55}} unless you have a bad player mid that wont feed her she is super week\n{{champion:74}} is kind of stupid a rework is in order its just his q that makes him bs but a full rework is in order \n{{champion:91}} is the same as kat if you feed him he will 1 hit your adc mid any one with less hp then 2k \n{{champion:82}} is just bs his rework is stupid that 3erd q doing 2k damage with just 300 ad or 200 ap \n{{champion:11}} same as kat and talon let him get ahead and he will be op \n{{champion:114}} same as kat talon and yi let her get ahead and she will be op \n{{champion:17}} rework needed and not just on his ult that makes his srooms bounce cos we all use that \nthe rest are not that powerful \n{{champion:64}}  if you let him snowball the game its gg wards fix him \n{{champion:50}} he takes a littlie to get started a few ganks from the jg and he wont do shit late game \n{{champion:39}} play passive until you can 1v1 her and she is fine to shut down\n90% of the time you just need to know how to face the champ and your fine","replies":[]},{"poster":"Tele","date":"2015-10-02T10:26:14.774+0000","up_votes":1,"down_votes":0,"body":"I can agree with Darius, Fiora, Irelia and Mordekaiser. The rest have very clear counters or have no real counters but are balanced for other reasons. \n\n1. Teemo is extremely quishy, and is usually countered by just building tank, and not being baited. He also has a terrible winrate honestly, 48.3%\n2. Lee Sin is quite strong and arguably OP at higher levels of play. But unless you're playing in Diamond or higher he's quite balanced. He falls off late game quite hard. Terrible winrate as well, 47.8%\n3. Garen is just extremely prone to being kited. He is slightly on the strong side though, for how easy he is to play. This is partly shown in his winrate 53.4%\n4. Master Yi is shut down so hard by hard CC. It's not even funny how useless he becomes with a couple of Morgana Q's. His winrate is also on the low side, 48.7\n5. Swain, has plenty of counter-play. He's immobile, no real burst and his only CC is the easiest ability to dodge in the game. He is on the high side of winrates though, 52%\n6. Heimerdinger is so strong in lower levels because no one respects his potential. Similar to Teemo don't fall for the bait. His winrate is so high though because no one respects ahaha, 52.9%\n7. Katarina is the same as Yi.\n8. Talon is a powerful counter-pick, he's not that strong overall though.\n\nTL;DR\nMost of the champions you mentioned are only strong in blind pick situations or against lower elo players.","replies":[]}]}