{"poster":"Swag sama","date":"2015-08-10T03:13:28.028+0000","title":"\"Campeones completos\"","subforum":"Charlas Generales","up_votes":4,"down_votes":4,"body":"Saludos invocadores! hoy vengo a hablarles sobre un tema y ver sus opiniones, en este caso el tema de hoy son los llamados \"Campeones completos\".\r\n\r\n Antes que nada, recuerden ser positivos, y no ser ni t&oacute;xicos ni flamers a la hora de criticar a los dem&aacute;s o dar sus propias opiniones, y respeten a los dem&aacute;s, seguimos!\r\n\r\n &iquest;De que se trata? dir&aacute;n ustedes, bueno los campeones completos se los llaman a aquellos campeones los cuales por su kit de habilidades y estar en buenas manos los hacen campeones que tienen cualidades que los ayudan a soportar casi cualquier enfrentamiento que se les venga delante de ellos, como el sustain, su movilidad, su early/mid/late game, su da&ntilde;o, ETC.\r\n Lo que quiero no es solo ver las opiniones de las dem&aacute;s, si no dar a conocer algunos de estos campeones que tal vez se ven poco ya sea por su baja popularidad y si \"complicado\" modo de juego, una vez aclarado esto voy a decir los que para mi SON (no digo que sean los &uacute;nicos ni los mejores Campeones del juego, hay muchas otras opciones) los mas completos para cada carril, comenzamos!:\r\n\r\n Top lane: {{champion:126}} , &iquest;por que Jayce? dir&aacute;n, pues por su kit de habilidades que lo convierten en un fuerte campe&oacute;n melee y un fuerte campe&oacute;n ranger gracias a su definitiva, el campe&oacute;n de por si tiene un buen da&ntilde;o que va creciendo mientras se alarga la partida, este campe&oacute;n tiene una gran movilidad y escape gracias a su empuj&oacute;n de su forma melee y su aumento de velocidad en su forma de ranger, el personaje brinda una buena Team Fight a la hora de lanzarse a muerte a los ADC o los APC, tambi&eacute;n por su forma de juego compartiendo el modo de ranger y el melee  siendo un campe&oacute;n que puede equilibrar el da&ntilde;o con el aguante lo que lo convierte en un campe&oacute;n muy dif&iacute;cil con el cual lidiar.\r\n\r\n La Jungla: {{champion:60}} La raz&oacute;n por la cual eleg&iacute; a Elise es por que es un campe&oacute;n con un da&ntilde;o muy elevado, un gran sustain en la jungla gracias a sus ara&ntilde;as las cuales pueden tankearse los mounstruos de la jungla y que le brindan ademas una recuperaci&oacute;n de vida bastante aceptable, este campe&oacute;n al momento de gankear no se queda corta, ya que su E que en los &uacute;ltimos parches fue bufeada dando un stun de gran durabilidad a inicios, su  gran da&ntilde;o y su movilidad a la hora de gankear, limpiar la jungla y escapar, es un campe&oacute;n muy completo en la jungla que lo tiene casi todo: Movilidad para muchas cosas como el escape, gankeos, etc, su gran da&ntilde;o, su sustain, sus mec&aacute;nicas que son divertidas (aun que esto ultimo no afecte el juego, es importante que un campe&oacute;n sea divertido de jugar, despu&eacute;s de todo es un juego para divertirse no para sentirse mejor que los dem&aacute;s) y tiene una build equilibrada entre el da&ntilde;o y el aguante que lo hace uno de los mejores junglas en el juego (si me lo preguntan a mi, el mejor jungla).\r\n\r\n Mid lane: {{champion:112}} (Se que esta opini&oacute;n va a traer controversia por que seguro muchos se esperaban a {{champion:84}} en el mid lane, pero que creen, este post es mio y no se tomen esto tan enserio por favor) Aqu&iacute; esta, mi campe&oacute;n favorito de todo el juego, Viktor, bien &iquest;por que esta aqu&iacute;? se preguntaran, pues por que Viktor es un campe&oacute;n que aun que lo crean o no, lo tiene casi todo, un gran da&ntilde;o excesivo gracias a su E Rayo de la muerte, la cual ayuda a pokear y debilitar mucho a tu oponente, y tambi&eacute;n si tiras bien esta habilidad, entre el early y mid game puedes farmearte la mitad de una oleada de una habilidad, su Q la cual le brinda un escudo potente seguido de un ataque b&aacute;sico que junto con un {{item:3100}} es una habilidad que rompe a muchos campeones, su W la cual es un stun en &aacute;rea la cual si se tira bien, puede dar la vuelta a una TF por completo, y su ulti la cual si bien ya no silencia como la anterior, puede ayudarte a cortar canalizaciones como la R de {{champion:161}} {{champion:90}} o {{champion:55}}, y eso no es todo, el plato fuerte de este campe&oacute;n es una cualidad que solo Viktor posee, sus evoluciones: {{item:3200}} {{item:3196}} {{item:3197}} {{item:3198}} Las cuales le dan a Viktor un personaje al cual puedes personalizar a tu gusto para cualquier enfrentamiento:\r\n\r\n La mejora de su Q le da un bono de velocidad y la cual puede ayudarte a escapar de enfrentamientos contra campeones melee como lo son Akali, Diana, Maokai, etc y ademas puede ayudarte a casar a enemigos que intentan escapar, ya que el bono dura tan poco como lo dura el Cold Down de esta habilidad, lo cual te ayuda a que casi nadie se te escape\r\n\r\n La mejora de su W hace un efecto definitiva de Orianna, osea que cuando uno o mas enemigos se queden aturdidos, estos se ver&aacute;n atra&iacute;dos a su centro, lo cual facilita el que atines el Rayo de la muerte o que tus compa&ntilde;eros apliquen sus habilidades en &aacute;rea para afectar a todos los enemigos\r\n\r\n Y el plato fuerte, la mejora de su e la cual a&ntilde;ade un da&ntilde;o excesivo la cual le sigue una explosi&oacute;n la cual inflige un porcentaje de da&ntilde;o menos, esta habilidad es perfecta para debilitar y farmearte una oleada entera en segundos\r\n  \r\n Una vez obtenidas todas las mejoras, su definitiva tormenta del caos aumentara de velocidad, si combinas las tres mejoras tendr&aacute;s una Team Fight asegurada casi siempre.\r\n Cada mejora no solo mejora las habilidades, si no que da unas bonificasiones que suben de mejora en mejora como mas AP por nivel, mas mana, ETC.\r\n Viktor un campeon personalizable para cualquier enfrentamiento, un gran da&ntilde;o, un gran Late game, y divertido\r\n\r\n Support: {{champion:117}} Mi soporte AP favorito, Lulu, ella esta aqu&iacute; ya que tiene un kit de habilidades que lo hacen un Soporte completo, un ataque b&aacute;sico que dispara multiples ataques los cuales te ayudan a que ganes oro f&aacute;cil con el item {{item:3303}} en un instante, una Q de gran Slow para tus enemigos, una W que no solo brinda mucha movilidad, si no tambi&eacute;n un silencio duradero el cual es mejorado cuando maxeas esta habilidad, su E la cual da un gran escudo y inflije mucho da&ntilde;o a los enemigos, perfecta para pokear, y una definitiva que te sirve si tienes un compa&ntilde;ero el cual se lanza a los enemigos como {{champion:102}} {{champion:59}} {{champion:79}}, etc y que le brinda tambi&eacute;n gran vida para la TF, un campe&oacute;n con un gran kit completo, y mi Soporte de AP favorito.\r\n\r\n ADC: {{champion:18}}  La linea que mas me desagrada, aun que no por eso quiera decir que no debe ser mencionada, Tristana es un campe&oacute;n que tiene un gran da&ntilde;o en late, una Q que le permite limpiar r&aacute;pido junto a su E, la cual puede ser pokeada al rival para desgastarlo y incluso tirarla a la torreta enemiga para destruirla por completo, y una W la cual le brinda un gran escape, no solo por su rango de salto, si no por que cuando recibes una asistencia o un asesinato su Cold Down se resetea y puedes lanzara de nuevo, y tambi&eacute;n su definitiva la cual puede salvarte de muchas situaciones como por ejemplo un gankeo rival, un AD Carri muy bueno, con buena TF, buen da&ntilde;o, limpia las oleadas r&aacute;pido, tiene gran movilidad y escape, y es divertida.\r\n\r\n MUY BIEN, con todo este pedazo de texto doy por terminada esta charla!, recuerden no ser t&oacute;xicos ni flamers al momento de criticar opiniones o dar las suyas, tratar con respeto a los dem&aacute;s y ser positivos siempre, GRACIAS COMUNIDAD!","replies":[{"poster":"juuby","date":"2015-08-10T03:37:01.722+0000","up_votes":4,"down_votes":0,"body":"para mi es twitch por que:\n-se encontro un cubito en maincrah\n-con su amigo roberto","replies":[]},{"poster":"Leks","date":"2015-08-12T17:32:19.393+0000","up_votes":2,"down_votes":0,"body":"A mi parecer, por daño  y sustain me quedo con estos\n{{champion:13}} {{champion:48}}\n\n{{champion:23}}","replies":[{"poster":"Swag sama","date":"2015-08-15T00:20:30.721+0000","up_votes":2,"down_votes":0,"body":"Tus elecciones son muy buenas!","replies":[]}]},{"poster":"Ks Erwyn","date":"2015-08-10T15:18:13.833+0000","up_votes":2,"down_votes":0,"body":"A uno le hace counter una puerta, otra tira 2 habilidades y se queda sin mana y pierde la linea o muere su ADC, completos..............................................no usaria ese termino.","replies":[{"poster":"Swag sama","date":"2015-08-11T01:03:35.104+0000","up_votes":1,"down_votes":0,"body":"Primero gracias por comentar, segundo un campeón no es %100 un personaje perfecto y creo haberlo resaltado y tercero, un campeón tiene buen potencial con buenas manos, que no sepas usarlo bien es otra cosa.","replies":[{"poster":"Ks Erwyn","date":"2015-08-12T17:08:33.400+0000","up_votes":1,"down_votes":0,"body":"Meh, resaltas cosas que ya se....................","replies":[{"poster":"Swag sama","date":"2015-08-15T00:19:21.837+0000","up_votes":1,"down_votes":0,"body":"Lo siento, no se leer mentes así que no se que sabes y que no.","replies":[]}]}]}]},{"poster":"Kyousuke","date":"2015-08-10T04:08:47.703+0000","up_votes":2,"down_votes":1,"body":"top (aunque odie admitirlo por que lo detesto ) {{champion:150}} alto pockeo buen iniciador, lenteo, stun, movilidad y daño respetable, cuando salio ya se hablo de un champ completo por que tiene todo lo que tiene que tener un top\n{{champion:98}}  con los ultimos buffeos que le metieron ahora se esta volviendo a jugar mucho y es un pick bastante seguro y muy bueno \n{{champion:68}}  pockeo infernal, gran iniciación, ligera movilidad\ny aunque sea vea poco y no lo parezca {{champion:48}}  es un gran champ para el top, gran sustain daño altisimo para ser tanque y movilidad , ademas de que puede iniciar bastante bien y joder mucho al team rival \njungla hay muchos ya que varia dependiendo del meta y de lo que se busque para el team \n{{champion:60}}  esta op este parche y los próximos XD con los buffs que tuvo quedo muy fuerte y mas con los cambios a los items de ap\n{{champion:113}}  la diosa del meta de tanques \n{{champion:254}}  la reina del devorador, dirán pero vi es a daño y no a velocidad, puede ser pero no se puede negar su potencial con el devorador cargado, cada 2 golpes te quita un 16% creo de la vida MÁXIMA sin contar que te aumenta la velocidad de ataque extra y el buen inicio que puede ofrecer ademas de tener la q para escapar. \n{{champion:245}}  a mi gusto gran jungler, puede gankear bien, limpia rápido y pega mucho ademas de que tiene una gran movilidad y es de mis favoritos \n{{champion:5}}  el champ con el que mas me gusta ir a la jungla <3 (mal pensados XD ) con el devorador puede destruir lo que sea y sin el también, le falta movilidad pero es un gran personaje, y de ap son risas a mas no poder xD nunca olvidare mi penta con xin ap XD \nmid:\n{{champion:103}}  pick seguro, daño, cc, movilidad y daño verdadero. es uno de los mas elegidos en la lcs\n{{champion:101}}  pockeo a distancia, inicia con el ulti para desgastar y que empiecen mal la pelea , rango alto, lenteo y stun y buena reg de mana con la pasiva, le falta movilidad pero es un personaje de lujo.\n{{champion:112}}  pick muy bueno por su daño y su cc pero sin movilidad\n{{champion:245}}  no podía faltar <3 ahora con los cambios que le hicieron el snowball que mete si gana 2 kills es brutal. \n{{champion:238}}  no hay nada que decir XD todos lo saben \nsupport \n{{champion:412}}  gran cc, cubre bien y puede iniciar como terminar pelea \n{{champion:40}}  cc, una ulti para iniciar (flash + ulti atrás del enemigo)  y para terminar una pelea o simplemente sanar al team después de una pelea que salio mal o para ir a hacer baron \n{{champion:117}}  kit completisimo  y buen pockeo\n{{champion:98}} esta de moda XD \n{{champion:25}}  rota XD\nadc lo tipico XD\n{{champion:42}}   {{champion:236}}  {{champion:81}}  {{champion:222}}  {{champion:429}}  y obviamente {{champion:17}}\n\nfalta {{champion:14}}  {{champion:57}}  {{champion:120}}  {{champion:105}}  {{champion:8}}  pero no voy a escribir mas XD ","replies":[{"poster":"Swag sama","date":"2015-08-11T01:05:58.672+0000","up_votes":1,"down_votes":0,"body":"Buen comentario gracias por su aporte!","replies":[]}]},{"poster":"kique1","date":"2015-08-10T03:35:13.086+0000","up_votes":1,"down_votes":1,"body":"Para mí un campeón completo es uno que:\n\n- Tenga mucho daño.\n- Tenga sustain.\n- Movilidad.\n- Aguante.\n- Algún tipo de cc.\n\nY creo q Viktor no entraría dentro de esa categoría.\n\nDe todas formas pienso que todos los campeones son completos desde la perspectiva de que la mayoría funciona bien con su kit de habilidades, el cual debes saber usarlo sabiamente, y estando consciente de los pros y los contras que tenga.","replies":[{"poster":"Swag sama","date":"2015-08-11T01:05:32.852+0000","up_votes":1,"down_votes":0,"body":"Viktor tiene:\n-Daño\n-Movilidad (lo creas o no gracias a su mejora de la Q que ya la explique)\n-Aguanta fuertemente en su linea gracias a su escudo y su rapido farmeo que lo ayuda a que el enemigo a defender su torre si o si\n- CC gracias a su W y al nuevo Cetro de Crystal si recuerdo bien su nombre.\n\nGracias por comentar!","replies":[]},{"poster":"Revolución","date":"2015-08-10T03:42:02.632+0000","up_votes":1,"down_votes":0,"body":"{{champion:38}} solía ser el más completo","replies":[]}]},{"poster":"Swag sama","date":"2015-08-10T03:13:43.511+0000","up_votes":1,"down_votes":1,"body":"Hola :V","replies":[]}]}