{"poster":"DevilKiss90","date":"2015-10-27T22:06:23.458+0000","title":"Parere Jayce","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Ho da poco comprato Jayce a 6300ip, giocato 4 o 5 volte in top e mi sembra un gran bel campione, nonostante non abbia una ulti mi piace il fatto che sia un tiratore e un melee, la R da una bella passiva, la Q+E che fa un sacco di danno in modalit&agrave; cannone e la E in modalit&agrave; martello che disingaggia e stunna bloccando ulti quali la R di kata. \r\n\r\nTutto questo solo per chiedere come mai non venga mai giocato, si vede veramente poco in partita. Magari qualche consiglio per migliorarmi da chi lo usa.","replies":[{"poster":"Lord Valotz","date":"2015-10-28T15:41:44.917+0000","up_votes":1,"down_votes":0,"body":"È  forte in una teamcomp da poke, discreto in lane grazie al cambio melee ranged. Con alcune composizioni è un buon pick, anche se non è immediato da comprendere/utilizzare. Punta sull'ad/mana/armor penetration nella build, anche il cdr non è  male.","replies":[]},{"poster":"Subundu","date":"2015-10-28T11:30:03.042+0000","up_votes":1,"down_votes":0,"body":"L'ho aperto anch'io un post su jayce qualche giorno fa, per chiedere...non mi ha cagato praticamente nessuno :\\\n\nE' più importante attaccarsi sulle meccaniche dei bronzi e sui saliscendi...\n\nComunque, da quel pochissimo che so io, ti posso dire questo: in lane devi pokare a pressione di aa cannone, poi appena l'oppo si sbilancia switchi in martello e q-w-aa potenziato-e per non dargli counterplay. In questo modo dovresti riuscire a negare il farm.\n\nL'ho usato poco e non conosco tutti i matchup, ma l'impressione generale è che fino al primo recall puoi tranquillamente bullare la lane. Al primo recall tu compri la {{item:3070}}  (e al max {{item:1001}} , è difficile durare fino a poter prendere anche {{item:1037}} ), ma la maggior parte degli oppo un item offensivo, quindi lui ti farà più danno e tu gliene farai proporzionalmente di meno. Occhio, lì, cerca di non farti prendere fuori posizione che ti squagliano.\n\nSe non sei in svantaggio e contro un counter (che ancora devo capire bene chi siano), dopo {{item:3004}}  e {{item:3158}} puoi cominciare a pushare sul serio, sempre stando attenti e wardati, claro.\n\nIn tutto ciò, ogni volta che sei safe, cerca di farmare di martello, che recuperi mana.\n\nIn teamfight devo ancora capire il suo ruolo, per il momento mi sembra un tipo da skirmishes, ma boh...","replies":[]}]}