{"poster":"AirKingNeo","date":"2018-03-12T23:42:05.496+0000","title":"Why does one item get damage, tankiness, and healing debuffs?","subforum":"Gameplay","up_votes":2,"down_votes":8,"body":"Bramble Vest is still the most overloaded item right now and it completely negates multiple champions from being viable. Even being ahead half an item (where your&#039;s is complete), Bramble Vest still wins.\r\n\r\nThen you have Thornmail which makes tanks able to 1v1 bruisers and skirmishers. Imagine if an item gave adcs ~2000 gold of stats in 1000 gold and let them 1v1 mages and bruisers. This boards would be screaming about it.","replies":[{"poster":"Votable Jester","date":"2018-03-13T03:19:18.115+0000","up_votes":1,"down_votes":2,"body":"Bramble vest (combined with ninja tabi) is basically what they're relying on right now to keep Fiora from auto-winning top against tanks.","replies":[{"poster":"AirKingNeo","date":"2018-03-13T03:36:36.533+0000","up_votes":1,"down_votes":1,"body":"nerf fiora then. Why does everyone have to suck in every matchup because fiora?","replies":[{"poster":"Votable Jester","date":"2018-03-13T03:45:32.959+0000","up_votes":2,"down_votes":0,"body":"Well bramble vest isn't great against everyone.  It's pretty much useless against AP top laners, and a fair few tanks are pretty much unimpeded by it anyways.\n\nIn general I think grevious wounds should just be removed from the game though and heals should be balanced around their actual values.","replies":[]}]}]},{"poster":"ZephyrDrake","date":"2018-03-12T23:51:01.447+0000","up_votes":2,"down_votes":2,"body":"I mean {{item:3025}} gives damage, tankyness and utility and is much more useful than thornmail and bramble vest ever will be in it's life. {{item:3068}} this also gives you even more reliable form of damage and tankyness... yet you don't hear anyone complaining about both of them so... yeah thornmail and bramble vest are fine","replies":[{"poster":"AirKingNeo","date":"2018-03-13T00:29:21.436+0000","up_votes":3,"down_votes":1,"body":"those are full cost items and don't give a heal debuff.","replies":[]}]},{"poster":"YokoNomi","date":"2018-03-12T23:52:10.681+0000","up_votes":2,"down_votes":1,"body":"But it doesn't.","replies":[]},{"poster":"VICKLIUS","date":"2018-03-13T00:42:00.557+0000","up_votes":1,"down_votes":1,"body":"I agree, a defensive tank item should not give hp regen debuff like a offensive type item. because you should not be counter by other tank just cause you are hp tank an they went thornmail.\n\nhere is my fix to bramble vest and thornmail\n\nUnique – Thorns: Upon being hit by a basic attack, reflects 25 (+ 10% bonus armor X Number of other armor items built) magic damage, while also reducing lifesteal and other heal from dmg effects by 50% for 1 sec.\n\n(would also like see change randuins coldsteel so could get both items)","replies":[{"poster":"AirKingNeo","date":"2018-03-13T00:44:53.756+0000","up_votes":1,"down_votes":1,"body":"> Unique – Thorns: Upon being hit by a basic attack, reflects 25 (+ 10% bonus armor X Number of other armor items built) magic damage, while also reducing lifesteal and other heal from dmg effects by 50% for 1 sec.\n\nThat's a buff.","replies":[{"poster":"VICKLIUS","date":"2018-03-13T00:58:58.093+0000","up_votes":1,"down_votes":1,"body":"And nerf, look, I fixed the problem for hp tanks vs other tanks and accomplished what riot originally set out to do vs adcs building excessive lifesteal. \n\nIt real weak right now, why shouldn't it deal more if have  more armor items, because you vs all ad team, right now if you were to get another armor item it only does 6 more dmg, where as this change would change it from 6 too 20.","replies":[]}]}]}]}