{"poster":"EngañaPichanga","date":"2017-02-26T19:13:43.632+0000","title":"Sistema de reportes en el foro","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":10,"body":"Hola gente, ¿Cómo están?\r\nEs mi primer post, y como ven en el título, y en otros posts más antiguos, mi idea o deseo es poder establecer en los foros de League of Legends Latinoamérica Sur una sección donde se puedan realizar reportes hacia un invocador por medio de fotos o videos, ya que diariamente, o, mejor dicho, en cada partida, te encontrás con alguien que dificulta la jugabilidad por medio de acciones que molestan, o hasta cierto punto, y como decimos en mi país, hartan, cansan e irritan, ya sea un troll, afk o flamer.\r\nYa vemos y tenemos por sabido que muchos reportes que se hacen en el cliente no sirven, y da la casualidad de que partidas más adelante, te volves a encontrar con esa persona, vuelve a hacer lo mismo, y sin embargo, te lo seguis encontrando.\r\nSeguro que muchos de nosotros, que jugamos Clasificatorias, ponemos mucho en juego, y estas partidas importantes te encontras con gente que no te deja avanzar de liga por estas acciones, y no justifica el jugar bien.\r\nSe que no es fácil establecer esto, pero al puntapié inicial lo tendríamos que dar nosotros, los que nos aguantamos para no flamear a alguien que no cumple con las reglas del invocador.\r\nDesde ya gracias por su atención. Rodri5510 {{champion:24}}","replies":[{"poster":"Mioen","date":"2017-02-26T19:39:36.856+0000","up_votes":4,"down_votes":0,"body":"Se fomentaria el acoso a otros invocadores y se crearian cientos de reportes falsos.\n\nComo daño se perderia el enfoque del foro, que es debatir ideas, compartir opiniones, comunicar informacion del juego o mostrar creaciones de la comunidad.","replies":[{"poster":"WilfreCheesemice","date":"2017-02-26T20:13:54.184+0000","up_votes":1,"down_votes":0,"body":"Ah, pero, una de esas cosas se hacen? los debates sí, pero a riot no le importa nada. estoy seguro que ni leen los debates y/o ideas para campeones, cosas que muchos son muy buenos y de lo único que se preocupan es que el \"foro no este spameado\", los trolls y todo eso no los banean. salu3","replies":[{"poster":"Mioen","date":"2017-02-26T20:47:35.971+0000","up_votes":1,"down_votes":0,"body":"Como respondio Americans. El foro es para usuarios, no para los rioters.\n\nSe crean dibujos, videos, se comparten ideas de campeon. Todos son igual de valiosas para la comunidad y aunque nunca se tomen por parte de un directivo, el afecto que hay que tener para dedicarle tiempo es muy valioso.\n\nTambien se le responde las preguntas a los nuevos jugadores.\nNada de eso debe ser menospreciado.\n\nAhora el spam, rompe con las reglas de muchos foros, (Entre parentisis)la comunidad de este foro es bastante amigable.\nEn otros la gente es mas amarga, y el minimo indicio de spam ya te estan banneando permanentemente.\n\nAdemas el spam es horrible, por mas que sea por una buena causa.\nTener un tablon lleno de el mismo anuncio, evita que otros puedan ser escuchados, con sus dudas o que la comunidad no pueda ver sus creaciones.\n\nImaginate que creas algo con mucho cariño, queres que la gente lo vea por que le dedicaste mucho tiempo y donde los vas a publicar solo esta el mismo anuncio opacandote.\n\n------\n**La causa del Spam pierde valor, y aquella persona que queria mostrar algo no pudo.**","replies":[{"poster":"WilfreCheesemice","date":"2017-02-26T22:15:14.950+0000","up_votes":1,"down_votes":0,"body":"Bueno, entonces debería existir algo para hacer quejas, un foro aparte para quejarse de cosas no? Digo, no soy un genio pero supongo que serviría.","replies":[{"poster":"Mioen","date":"2017-02-26T22:47:14.257+0000","up_votes":1,"down_votes":0,"body":"No. no funcionaria.\n\nUn usuario por mas que quiera aportar para sancionar un jugador no puede. Tus pruebas o lo que muestres no es oficial, no posees los datos de cada partida ni los chats. Usar como prueba el chat de una partida no valida nada y usar el historia del jugador tampoco.\n\nNo se puede.\n\nEs como hacer justicia a mano propia, no esta permitido. No tienes los recursos, tampoco los conocimiento para juzgar a alguien.\n\nNada mas que comentar.","replies":[]}]}]},{"poster":"Americans","date":"2017-02-26T20:20:54.322+0000","up_votes":1,"down_votes":0,"body":"El foro no esta hecho para que ellos los lean, esta para que entre nosotros discutamos. Y las \"Ideas\" para campeones siempre estan horriblemente mal hechas, ademas que intentar hacer de balancer team y le inventan stats que no tienen sentido.","replies":[{"poster":"WilfreCheesemice","date":"2017-02-26T22:13:25.699+0000","up_votes":1,"down_votes":0,"body":"No todos están mal hechos.","replies":[]}]},{"poster":"Yrox the Third","date":"2017-02-26T20:46:25.020+0000","up_votes":1,"down_votes":0,"body":"De hecho, muchas veces se leen las ideas cuando son buenas, es tan asi que MUCHAS cosas que estan en el juego fueron hechas en parte por la comunidad o totalmente por la comunidad.","replies":[]}]}]},{"poster":"9081913DEL1","date":"2017-02-26T20:37:59.762+0000","up_votes":2,"down_votes":0,"body":"Dame una buena razon para hacer eso.\n\nContras: \n- Condensacion de posts.\n- Muchisimos mas agentes necesarios para atender la tarea.\n- Miles de repost del mismo usuario y distintos usarios sobre el mismo evento.\n- Spam.\n- Saturacion de trabajo.\n- Falta de fehaciencia. Como probas eso.\n- Poco practico.\n- Lento.\n- Se fomenta el hostigamiento.\n\nPros: \n- Te descargas despues de una mala partida.\n-Ningun otro ya que igual no sabrias si el usuario fue o no sancionado.\n\nSaludos.","replies":[]},{"poster":"BlaÐy","date":"2017-02-26T19:36:15.557+0000","up_votes":2,"down_votes":0,"body":"Los usuarios y moderadores del foro quieren que sea totalmente ajeno a los reportes y viene alguien con un post como este.","replies":[]},{"poster":"DarksWaves","date":"2017-02-26T19:21:44.038+0000","up_votes":2,"down_votes":0,"body":"Es ridiculo, que va a ser mas efectivo que un sistema automatico. Son miles de aprtidas diarias, habria que revisar a mano cada partida y habria miles de reportes falsos. Estaria mas atacascado que los archivos del sistema penal.\n\nPensar no cuesta nada.","replies":[]},{"poster":"Lucksor","date":"2020-02-03T21:43:30.455+0000","up_votes":1,"down_votes":0,"body":"Hola quiero dejar un reporte a un invocador se llama DNGTucuRivas es de las, me reporta ami por xenofobo porqe yo habia dicho qe es mujer y nada mas, solo dije qe es mujer, el caso es qe la tipa me flameaba a cada rato en la partida yo fui soporte con chogath y ella con jinx yo en ningun momento le segui el juego de flamearla, yo segui mi juego tranquilamente ademas que estabamos jugando clasificatorias solo duo. yo jugue muy tranquilo mi juego y ella la empezaron a matar y me reclamo ami qe yo tuve la culpa de sus muertes yo quede como chogath como soporte 13/4/7 y ella quedo 7/12/13 y despues de eso el yasuo que fue top me flameo toda la partida junto con jinx y la tipa pierde linea y se va mid a robar farm del mid mientras ella no volvio mas a bot y me dejo solo farmeando tengo fotos y evidencias bueno ella misma la saco yo solamente dije esto ESTA TIPA DEBE DE SER MUJER XD eso dije nada mas no insulte no dije nada homofobico o xenofobo solo dije esa frase podria decir qe este tipo debe ser hombre no veo ningun insulto vivo mi juego tranquilo pero porfavor me gustaria que la reportaran o minimo qe la dejen en cola de una hora o que el banen la cuenta en ningun momento me dejo en paz podria haberla muteado en el caso qe no hice y fue mi error pero bueno no se si alguien podra leer esto y ayudarme bueno eso muhcas gracias por leerlo completo","replies":[]},{"poster":"MadaraX20MT","date":"2019-07-31T04:42:20.547+0000","up_votes":1,"down_votes":0,"body":"Hola , quiero comentar un jugador de mierda que esta cagando la comunidad , no puede tener un lenguaje apropiado la gran puta de Elganso0123 no me deja de joder en cada partida y si no haces algo ctmr me emperro y voy a riot a romperte el orto ctmr , se mamaron con la de panteon por cierto saludos we xdddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddddd, me gusta fiorela &lt;3","replies":[]},{"poster":"chinokiller12","date":"2019-07-15T04:42:59.531+0000","up_votes":1,"down_votes":0,"body":"1.Quiero reportar la conducta sancionable del jugador \"MAIN YASUO\" el cual admitió en varias ocasiones ser troll y decir que yo y mi dúo merecíamos perder por haber ganado línea. Con esto queda claro que no merece seguir jugando este video juego ya que arruina la experiencia de juego de todos los que nos lo podemos topar en una soloq en LAS","replies":[]},{"poster":"BenjamixGP","date":"2019-01-03T18:30:23.084+0000","up_votes":1,"down_votes":0,"body":"* La verdad estaba jugando tranquilo normal games y derrepente un teemi empezó a trollear brutalmente haciendonos perder.. la verdad el teemo termino trolleando 2/24/3 asegurando la partida, y no fue una mala partida el dijo \"esta linea me encanta, se llama troll\" siendo oro me emparejaron con este troll hierro 3 y lo peor que era un niño por que ni escribir sabia y se quejaba de mi pais Chile sin ningun motivo al final se terminó haciéndose el afk después de arruinar la partida de todo mi team favoreciendo la victoria del otro equipo nick de el troll: El Fortiinero, de mi parte creo que deberian darle un duro castigo por las personas que aguantamos su inmadurez e insultos, gracias por su atención","replies":[]},{"poster":"vo2ttas","date":"2018-09-24T00:24:38.523+0000","up_votes":1,"down_votes":0,"body":"es como lo q sucede con . los soportes improvisados. Si bien existen champ para ese rol van cualquier cosa \nHoy me ha tocado 4 veces uno de eso (teemo, brand, talon), es desesperante ..........\nexiste la posibilidad q riot bloquee la seleccion de soportes a los q si cumplen ese rol?????","replies":[]},{"poster":"ICARUS23","date":"2018-07-27T15:45:30.055+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rodri5510,realm=LAS,application-id=PJAKt7ph,discussion-id=Ah5OgQ0l,comment-id=,timestamp=2017-02-26T19:13:43.632+0000)\n>\n> Hola gente, &amp;iquest;C&amp;oacute;mo est&amp;aacute;n?\n> Es mi primer post, y como ven en el t&amp;iacute;tulo, y en otros posts m&amp;aacute;s antiguos, mi idea o deseo es poder establecer en los foros de League of Legends Latinoam&amp;eacute;rica Sur una secci&amp;oacute;n donde se puedan realizar reportes hacia un invocador por medio de fotos o videos, ya que diariamente, o, mejor dicho, en cada partida, te encontr&amp;aacute;s con alguien que dificulta la jugabilidad por medio de acciones que molestan, o hasta cierto punto, y como decimos en mi pa&amp;iacute;s, hartan, cansan e irritan, ya sea un troll, afk o flamer.\n> Ya vemos y tenemos por sabido que muchos reportes que se hacen en el cliente no sirven, y da la casualidad de que partidas m&amp;aacute;s adelante, te volves a encontrar con esa persona, vuelve a hacer lo mismo, y sin embargo, te lo seguis encontrando.\n> Seguro que muchos de nosotros, que jugamos Clasificatorias, ponemos mucho en juego, y estas partidas importantes te encontras con gente que no te deja avanzar de liga por estas acciones, y no justifica el jugar bien.\n> Se que no es f&amp;aacute;cil establecer esto, pero al puntapi&amp;eacute; inicial lo tendr&amp;iacute;amos que dar nosotros, los que nos aguantamos para no flamear a alguien que no cumple con las reglas del invocador.\n> Desde ya gracias por su atenci&amp;oacute;n. Rodri5510 {{champion:24}}","replies":[]},{"poster":"JosepSmuf","date":"2018-07-22T22:55:05.229+0000","up_votes":1,"down_votes":0,"body":"amigos necesito ayuda estaba en ranked y un tipo le pedí dejarme top pero este se negó luego de esto jugo con nasus top y comenzó en early a tirarse contra una camille murió todo el tiempo sin sentido solo avanzaba, no farmeaba {{champion:75}}  el nombre del jugador es khleint ademas de esto nose le daba igual ser enviado al foro y demas. decia que no habia motivo para reportarlo y termino su partida 1/11/1 con 79 de farm. este es mi primer post espero me ayuden","replies":[]},{"poster":"sexlolmen","date":"2018-07-10T02:50:23.649+0000","up_votes":1,"down_votes":0,"body":"https://cdn.discordapp.com/attachments/460298686165942282/466072521892954153/unknown.png \npor favor en la partida flameo y después desea la muerte por favor mirar el comentarios","replies":[]},{"poster":"DunkMasterDarius","date":"2018-05-23T04:31:28.085+0000","up_votes":1,"down_votes":0,"body":"hola como se reporta a un jugador super toxico con todos ?","replies":[]},{"poster":"Zinc","date":"2017-02-26T22:19:17.202+0000","up_votes":1,"down_votes":0,"body":"Estaria bueno, pero no para que se haga en el foro, si no por privado, como cuando mandas un ticket a soporte.","replies":[]},{"poster":"xXYESUSXx","date":"2019-07-29T00:41:49.116+0000","up_votes":0,"down_votes":1,"body":"vengo a reportar jugadores de los que primera vez vi en mi vida tampoco nadie me molesto tanto asi en años   pero dos personas   pero ya no hay caso de aguantar     quisiera que banen a  esas personas  que insultan  esto ya me tiene cansado riot agan algo porfavor","replies":[]}]}