{"poster":"Yuumi is a Dog","date":"2018-09-22T13:23:39.056+0000","title":"Mein Post über einen troll spieler wurde von Riot gelöscht","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":9,"body":"Da sieht man dass Riot keinen Pieps auf uns gibt, und all die Reporte die eingehen werden wie Bewerbungen bei Grossfirmen 50/50 angenommen/weggeschmissen.\r\n\r\nSmall Indie Company btw","replies":[{"poster":"Meme General","date":"2018-09-22T13:40:26.328+0000","up_votes":5,"down_votes":0,"body":"-hält sich nicht an die Regeln\n\n-heult rum, dass sein Post gelösch wurde\n\nOMEGALUL","replies":[]},{"poster":"Fermi Paradox","date":"2018-09-22T13:38:58.543+0000","up_votes":4,"down_votes":0,"body":"Ich wiederhole mich gern noch einmal:\n\n\"Naming and Shaming\" ist im Forum nicht erlaubt.\n\nWer gegen die Regeln verstößt, muss damit rechnen, dass der Post gelöscht wird.\n\nAußerdem war das Game gerade mal 10 Minuten her, als du den Post verfasst hast. So schnell kann nicht mal das beste System reagieren, außer wenn in jedem Spiel ein Rioter dabei sitzt und live zuschaut. Meinst du ernsthaft, dass Riot so etwas leisten kann? Sei bitte realistisch.\n\nDer Spieler hat seitdem kein neues Game gemacht, außerdem wird einem nicht immer direkt eine Benachrichtigung geschickt, wenn jemand gebannt wurde. Es kann also theoretisch sein, dass er jetzt bereits bestraft wurde.\n\n\nMal ganz davon abgesehen, dass deine Beiträge vollkommen überspitzt und unsachlich sind und keine seriöse Firma so etwas ernst nimmt. Tut mir leid, aber du solltest wirklich nochmal an deinem Auftreten arbeiten.","replies":[{"poster":"Yuumi is a Dog","date":"2018-09-22T13:41:32.292+0000","up_votes":1,"down_votes":7,"body":"da mag einer Trollspieler hmmm{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Sirrkas","date":"2018-09-22T13:43:09.884+0000","up_votes":5,"down_votes":0,"body":"Wenn du wie ein Forentroll wirken willst, du bist gerade auf dem besten Weg dahin. Aory hat ziemlich gut erklärt, wie es mit dem System abläuft, auch wenn das System durchaus in wenigen Minuten bestrafen kann. Da dann Aory einfach vorwerfen, dass diese Person Trolle mag, wirkt bestenfalls . . . trollig.","replies":[]}]}]},{"poster":"Wernicke","date":"2018-09-22T13:43:50.523+0000","up_votes":2,"down_votes":1,"body":"Nun, zu erst: Nenn mir eine Spieleschmiede die sich für deutsche Foren interessiert?\nWas ich damit sagen möchte, ist, dass Riot hier gar nix löscht, sondern die dafür verantwortlichen mods. Da würde ich jetzt mal behaupten das es da auch einen Grund gab.\nWeiterhin bringt ein post über einen troll Spieler nix (übrigens war name calling der Grund?), denn das effektivste Mittel  um Spieler zu melden ist die reportfunktion nach dem Spiel, deswegen hat Riot uns dieses auch an die Hand gegeben. Verrückt oder?\nTut mir Leid, aber einen thread wie diesen, der komplett Inhaltslos ist und selbst durch einen Einzeiler zeigt das du dich 0 mit dem Spiel und dem System auseinander gesetzt hast, kann man nicht wirklich ernst nehmen.\nWas erhoffst du dir also von diesem thread?","replies":[]}]}