{"poster":"Bunny Akura","date":"2016-06-22T19:52:23.690+0000","title":"Suche Spieler für Normals, eventuell auch rankeds","subforum":"Clans & Teams","up_votes":2,"down_votes":1,"body":"Wie oben schon genannt, suche ich Spieler f&uuml;r Normals oder auch rankeds. Ich bin silber 4, leider gedropt.\r\nIch spiele vorzugsweise midlane oder support, lerne aber auch adc.\r\nBin 18 Jahre alt, Ende der Woche werde ich 19. W&uuml;rde mich freuen, wenn jemand Interesse hat, gerne in Silber/Gold. Alter vorzugsweise ab 16 - 25.\r\nGerne auch mit ts oder skype, da ich leider keinen eigenen Server habe, bitte ich um die Daten oder halt Skype. :)\r\nWenn du Interesse hast, adde mich einfach: Bunny Akura","replies":[{"poster":"Raunchý","date":"2016-06-23T09:13:46.212+0000","up_votes":1,"down_votes":0,"body":"Heyho,\n\nNach einem knappen halben Jahr Pause hab ich wieder angefangen mit LoL.\nBin so wie du, auch noch auf der Suche nach Leuten mit denen man mal zusammen zocken kann. Gerne auch rankeds.\nWar letzte Season Gold 3-4. Wohl aber eher mit etwas mehr Glück als Verstand :D\nDiese Season bin ich mal noch unranked. \nTs und Skype vorhanden. Ich selber bin 23, Spiele außer ADC eigentlich alles, vorrangig aber Top,mid oder supp.\n\nWenn du mal Lust hast ne Runde zu daddeln, add mich einfach mal ingame.\n\nGrüße,\nRaunchý","replies":[]},{"poster":"TeS Taled","date":"2016-06-22T20:47:49.462+0000","up_votes":1,"down_votes":0,"body":"Schönen guten Abend Bunny Akura,\nmit Nerds Go Casual bist Du nie wieder allein ! \nEgal ob spaßige Normalgames oder tryhard Rankeds, solang Du Spaß am Spiel und den nötigen Ehrgeiz mitbringst bist Du bei uns herzlich Willkommen.\nWir möchten eine Community sein die für jeden Spieler einen Platz hat, hierbei ist es irrelevant ob Casual Gamer oder Ranked Pro, ob Unranked oder Challenger, bei uns ist jeder gern gesehen.\nWir sind alle 18+ und würden uns freuen wenn du dich bewerben würdest.\n\nHier geht es zu unserem Vorstellungspost: http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/JZ4eTbKq-a-nerds-go-casual-a18-multigaming-community-laadt-zum-zocken-ein-a\n\nLiebe Grüße,\nNGC Taled","replies":[]},{"poster":"KAPPOBY","date":"2016-06-22T20:08:18.908+0000","up_votes":1,"down_votes":0,"body":"Du hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/EXwQuqpZ-aequilibritas-esports-community-esports-league-of-legends-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]},{"poster":"Killerkante","date":"2016-06-22T23:49:49.190+0000","up_votes":1,"down_votes":1,"body":"Für normals gern dabei, spiele vorzugsweise zwischen 21:00 - 3:00 Uhr, auch mal früher, jenachdem wieviel ich zur Zeit zu tun habe.\n\nZu mir:\nAuf dem Account hier bin ich derzeit Plat V, von der MMR her Plat III - II, meiste Seasons allerdings mit Dia beendet, mal SoloQ mal 3v3, aber hauptsächlich im 3v3.\nNormal game MMR ist breitfächig von Silber - Plat, da ich hauptsächlich mit Freunden spiele die niedriger sind als ich.\nIch flame nicht noch werde ich unfreundlich, wenn's mir persönlich zuviel wird mute ich und das war's auch schon.\nRollen passe ich komplett an, jenachdem worauf ich eben Lust habe.\nBin 24 Jahre, sofern das überhaupt wichtig sein sollte ... das geistige Alter stimmt ja meistens doch nicht überein :D\n\nTS/Skype vorzugsweise eher nicht, zwar möglich aber höre lediglich lieber Musik.\n\nWenn's sein muss kann ich auch auf smurf Accounts wechseln bei denen ich geringer eingestuft bin.\n\nFalls interessiert kannst mich gern adden, falls nicht lass es bleiben.\n\n\nglhf","replies":[]}]}