{"poster":"iTaLenTZ","date":"2015-10-14T15:35:44.787+0000","title":"Kindred has been out for a couple of hours","subforum":"Gameplay","up_votes":193,"down_votes":16,"body":"And 20% of the community claims to be a Kindred main. This is why you disable new champs in ranked for the first 2 weeks.","replies":[{"poster":"Blue Kaozi","date":"2015-10-14T15:47:58.079+0000","up_votes":55,"down_votes":0,"body":"I dont feel like sitting through 12+ dodges. I think im going to stick to teambuilder or draft pick for awhile","replies":[{"poster":"BigSkinny805","date":"2015-10-14T16:17:14.294+0000","up_votes":5,"down_votes":3,"body":"> [{quoted}](name=Blue Kaozi,realm=NA,application-id=3ErqAdtq,discussion-id=VKiHcnaK,comment-id=0002,timestamp=2015-10-14T15:47:58.079+0000)\n>\n> I dont feel like sitting through 12+ dodges. I think im going to stick to teambuilder or draft pick for awhile\n\nUpvoted.","replies":[{"poster":"Ignis0","date":"2015-10-14T16:49:18.896+0000","up_votes":7,"down_votes":4,"body":"Got 9 dodges in a norm queue this morning when I was trying to play kindred. Still managed to call kindred jg.","replies":[{"poster":"kaltenashes","date":"2015-10-14T19:07:09.866+0000","up_votes":2,"down_votes":1,"body":"i have to create game (me vs bots) to learn a bit of kindred...got ban (5/15 min) 3 times while trying to play her in co-op vs ai, because there's always another kindred there","replies":[{"poster":"Saphixia","date":"2015-10-15T23:24:50.212+0000","up_votes":1,"down_votes":0,"body":"same here, i ended up playing her in a custim game me againts 1 bot","replies":[]}]}]}]},{"poster":"Celeste Benal","date":"2015-10-15T14:39:55.099+0000","up_votes":2,"down_votes":0,"body":"QFT. Had to do a bunch of solo customs with 9 bots to even get a game to try them out.","replies":[]},{"poster":"Enchanté","date":"2015-10-15T12:10:25.185+0000","up_votes":1,"down_votes":0,"body":"this is exactly why I'm scared of new champions instead of getting exited over it...","replies":[]},{"poster":"TheGrandAlliance","date":"2015-10-15T06:41:59.502+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Blue Kaozi,realm=NA,application-id=3ErqAdtq,discussion-id=VKiHcnaK,comment-id=0002,timestamp=2015-10-14T15:47:58.079+0000)\n>\n> I dont feel like sitting through 12+ dodges. I think im going to stick to teambuilder or draft pick for awhile\n\nHey I would sit though 12+dodges.  By the time you get a team you probably have one super awesome team as all of the trolls have been \"weeded out\".","replies":[]}]},{"poster":"Trebbi","date":"2015-10-14T19:18:23.261+0000","up_votes":27,"down_votes":3,"body":"Its been said forever, but riot should implement a period where said champion cant be played in ranked, but cant be banned in norms so people can try her out, but not ruin anyones rankings by playing something for the first time.","replies":[{"poster":"cheezeoflegends","date":"2015-10-14T19:40:26.301+0000","up_votes":9,"down_votes":0,"body":"Don't suggest this on the reddit, you'll get downvoted to hell by people that think that bug and balance feedback magically isn't valid when it's from normals because the players there aren't playing for arbitrary points that have no mechanical effect on the game.","replies":[{"poster":"Trebbi","date":"2015-10-14T19:58:06.018+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=cheezeoflegends,realm=NA,application-id=3ErqAdtq,discussion-id=VKiHcnaK,comment-id=00080000,timestamp=2015-10-14T19:40:26.301+0000)\n>\n> Don't suggest this on the reddit, you'll get downvoted to hell by people that think that bug and balance feedback magically isn't valid when it's from normals because the players there aren't playing for arbitrary points that have no mechanical effect on the game.\n\nProbably, but I think its the only logical thing to do because I feel that blind and team builder should not be the only place to play new champs, because you loose the proper counter pick opportunity, but a new champion day 1 in ranked is bad regardless of how much game knowledge you have, because I have seen alot of diamond/challenger people struggle alot with new champs on the PBE.\n\nRemember how everyone tried to build damage on sion for instance`? That could have been fixed disabling him from ranked and make him unbannable in normals so the collective learning curve would hit the ranked stage at a later stage so he would atleast be somewhat tanky.","replies":[{"poster":"cheezeoflegends","date":"2015-10-14T21:35:26.327+0000","up_votes":2,"down_votes":0,"body":"I play a bit of ranked. Just started playing it this season after a long time of never taking the plunge due to rumors of low rank horror.\n\nI agree completely with you actually. Smite has an incredibly strict rule on new champs as often you can't play them in ranked for around 2 weeks. It works fine and everyone that plays that game seriously agrees that's how it should be.\n\nJust a week long period would be plenty IMO. Even if balance wasn't perfected the surprise bugs and surprise op builds would be found. Plus everyone would have plenty of practice in an environment with no lasting drawbacks for others.\n\nI suggested as much on the reddit and plebs kept acting like normals couldn't provide any feedback or practice at all and they should be allowed to learn champs in ranked where there's penalties because according to them people don't play to win unless they play for arbitrary points.","replies":[{"poster":"Trebbi","date":"2015-10-14T23:19:23.795+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=cheezeoflegends,realm=NA,application-id=3ErqAdtq,discussion-id=VKiHcnaK,comment-id=0008000000000000,timestamp=2015-10-14T21:35:26.327+0000)\n>\n> I play a bit of ranked. Just started playing it this season after a long time of never taking the plunge due to rumors of low rank horror.\n> \n> I agree completely with you actually. Smite has an incredibly strict rule on new champs as often you can't play them in ranked for around 2 weeks. It works fine and everyone that plays that game seriously agrees that's how it should be.\n> \n> Just a week long period would be plenty IMO. Even if balance wasn't perfected the surprise bugs and surprise op builds would be found. Plus everyone would have plenty of practice in an environment with no lasting drawbacks for others.\n> \n> I suggested as much on the reddit and plebs kept acting like normals couldn't provide any feedback or practice at all and they should be allowed to learn champs in ranked where there's penalties because according to them people don't play to win unless they play for arbitrary points.\n\nI agree with your sentiments and I am saddened by the reactions you have faced. :(\n\nPeople who says normals aren't good for practice probably never practice last hitting or jungle clears in custom games either. \n\nUnless your really high ELO in ranked and have shit normal MMR, yes it might be easier because of game sense, but your still trying and figuring out a new champ. Its just common sense to atleast get a understanding and feel out a champion before playing them in a \"serious setting\".\n\nBut people reap what they sow and sadly reap their allies elo aswell.","replies":[]}]}]},{"poster":"JAGMAG","date":"2015-10-14T20:06:55.370+0000","up_votes":1,"down_votes":1,"body":"well lets be honest idk if you play both ranked and normals but the quailty of normals games is sooooooooooooo much lower then a ranked game you could find bugs in normals but balance would be hard as hell if we went by normlas for balance then teemo yi and katirian are beyond hopelessly broken and just need to be deleted.","replies":[{"poster":"Gorgannan","date":"2015-10-14T20:55:55.960+0000","up_votes":1,"down_votes":0,"body":"You're thinking soloq, not normals vs. ranked. No one is magically better at dealing with those guys in ranked.","replies":[{"poster":"JAGMAG","date":"2015-10-14T21:09:32.736+0000","up_votes":2,"down_votes":3,"body":"im saying normlas are not a good source for balance because people dont tryhard normal i play freaking attack speed shen jungle or adc thresh in normlas and crush with it dosent work so well in ranked","replies":[{"poster":"Gorgannan","date":"2015-10-14T21:40:41.379+0000","up_votes":1,"down_votes":0,"body":"But statistically, that would even out. What makes Katarina tryhard in normals?","replies":[{"poster":"JAGMAG","date":"2015-10-15T02:09:06.527+0000","up_votes":1,"down_votes":0,"body":"it wouldn't even out and katriania is considered a pub stomper but not op in ranked mode so theres a good example","replies":[{"poster":"Gorgannan","date":"2015-10-15T04:36:15.899+0000","up_votes":1,"down_votes":0,"body":"Pubstomper means good against baddies, not good in normals. Being in ranked wouldn't make a difference unless only Katarina tries in normals while no one else does. Since that's OBVIOUSLY not the case, it would even out.","replies":[{"poster":"JAGMAG","date":"2015-10-15T22:12:52.562+0000","up_votes":1,"down_votes":0,"body":"it would make the difference the problem with normals is its blind full pick vs ranked is draft mode katarinia and yi stomp when no one picks counters but if you pick even basic counters you can shut them down hard but you almost never see that happen in normals so the numbers would be very skewed from the two","replies":[]}]}]}]}]}]}]}]},{"poster":"Only Aatrox","date":"2015-10-15T12:17:35.061+0000","up_votes":1,"down_votes":0,"body":"People played Ekko in ranked the day he came out because he was incredibly strong.","replies":[{"poster":"Trebbi","date":"2015-10-15T12:23:13.956+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Only Aatrox,realm=EUW,application-id=3ErqAdtq,discussion-id=VKiHcnaK,comment-id=00080003,timestamp=2015-10-15T12:17:35.061+0000)\n>\n> People played Ekko in ranked the day he came out because he was incredibly strong.\n\nWhat your saying just supports my argument.","replies":[]}]}]},{"poster":"TotalJerk","date":"2015-10-14T18:15:36.866+0000","up_votes":12,"down_votes":0,"body":"When I play team builder during a champion release I just spam counters to that champion for like 2 weeks.","replies":[{"poster":"Un7ucky","date":"2015-10-14T21:04:50.802+0000","up_votes":1,"down_votes":0,"body":"hey man i was about to jump into ranked, but i am not sure what to expect. good counters are early game pressure or tanky? i hear this new one is a duelist","replies":[{"poster":"Raiku Kawisa","date":"2015-10-15T03:38:35.172+0000","up_votes":1,"down_votes":0,"body":"She has a stacking passive that adds Current%HP Physical Dmg on hit per stack. Tanks are not the way to go. Crushing her into a paste before she gets stacks is what counters her (I believe)","replies":[{"poster":"Rendarkan","date":"2015-10-15T12:57:06.753+0000","up_votes":2,"down_votes":0,"body":"Actually denying her marks is the way to go. force her to come into your jungle and murk her, and even if the jungler is not near a scuttle bug make an effot to go and nab it. We did that to an enemy Kindred and we kept her at two stacks the whole game. Also make sure that when you are the one she marks try to bait her into a solo fight and have the whole team gank her for a quick kill or drag her into your jungle and get the jungler to help kill her. And lastly... wards save lives.","replies":[{"poster":"Raiku Kawisa","date":"2015-10-15T17:05:38.729+0000","up_votes":1,"down_votes":0,"body":"XD Thats what I said, Deny those stacks and she doesn't get her damage.","replies":[]}]}]}]},{"poster":"Paarthurnax","date":"2015-10-14T20:45:43.661+0000","up_votes":2,"down_votes":0,"body":"Logged in just for the upvote","replies":[]}]},{"poster":"BigSkinny805","date":"2015-10-14T15:45:06.147+0000","up_votes":12,"down_votes":0,"body":"I'm curious in how all these people are getting to play Kindred.... I refuse to play a new champ outside of team builder( because practice makes perfect and thats what team builder was DESIGNED for *cough*) So people must be on the auto lock schedule right now which is sad and selfish. I stay away from normal and ranked for a good couple weeks because of new champs clogging the scene and ruining it for the rest of the ranked/normal team who just wanted to play.","replies":[{"poster":"The Quinndred","date":"2015-10-14T19:38:52.838+0000","up_votes":1,"down_votes":0,"body":"Me personally, I played them a bit on PBE and love their kit and theme. I WANT to be a Kindred main, but I also want to have some more experience before taking her into ranked.","replies":[{"poster":"Meeks011","date":"2015-10-14T19:42:38.349+0000","up_votes":3,"down_votes":1,"body":"Same. I'll suck massive ass, but I love her theme. Whenever I hear \"_Never one_... **without the other**\" I get chills.","replies":[{"poster":"The Quinndred","date":"2015-10-14T20:29:08.757+0000","up_votes":2,"down_votes":0,"body":"Their*. Sorry, I'm a massive stickler for that kind of horse-shit for some reason. But yeah, the two main reasons I love Kindred:\n     1. The theme for the champion is so cool. Death done got tired of its shit and decided \"You know what world? Fuck this, I'm going become two now, just gimme that axe.\"\n     2. The champion is an ADC, my favorite role, that I can play in the jungle and has enough self-peel and sustain that i don't have to worry about having to rely on someone on a completely different page than I am.","replies":[{"poster":"JohnJonesy","date":"2015-10-14T21:41:52.239+0000","up_votes":5,"down_votes":2,"body":"*Its\n\nSorry, I had to.\n\nAlthough \"'s\" is possessive in most circumstances, \"it's\" is merely a contraction of \"it is\" or \"it has.\" \n\n\"Its,\" however, is possessive, not \"it's.\"\n\nGood day, friendly fellow.","replies":[]},{"poster":"Meeks011","date":"2015-10-15T18:23:06.975+0000","up_votes":2,"down_votes":0,"body":"Fuck, did I really say that? FUCK! I keep correcting other people then making the same dumbass mistake.","replies":[{"poster":"The Quinndred","date":"2015-10-16T00:18:25.277+0000","up_votes":1,"down_votes":0,"body":"Haha, same. It's like, whenever I'm in a conversation with a friend about them, and they start calling them \"her\", I just start calling them \"her\" as well.","replies":[]}]}]}]}]}]},{"poster":"Sageace","date":"2015-10-14T17:34:19.754+0000","up_votes":9,"down_votes":13,"body":"Some people have played Kindred on the PBE. Just saying.","replies":[{"poster":"Horrow","date":"2015-10-14T18:57:07.277+0000","up_votes":12,"down_votes":1,"body":"> [{quoted}](name=Sageace,realm=NA,application-id=3ErqAdtq,discussion-id=VKiHcnaK,comment-id=0004,timestamp=2015-10-14T17:34:19.754+0000)\n>\n> Some people have played Kindred on the PBE. Just saying.\n\nAnd most people haven't. Just saying.","replies":[]},{"poster":"Simplicate","date":"2015-10-14T18:27:47.681+0000","up_votes":4,"down_votes":0,"body":"True but I doubt half the scrubs auto-locking her like their life depended on it have a PBE account.","replies":[]}]},{"poster":"3tyson","date":"2015-10-14T21:09:48.585+0000","up_votes":5,"down_votes":1,"body":"im deff a kindred main\ni played them since release","replies":[]},{"poster":"Malix Farwin","date":"2015-10-14T19:31:01.316+0000","up_votes":5,"down_votes":2,"body":"I am a kindred main and i havent even played her yet :)","replies":[]},{"poster":"LeeDark","date":"2015-10-15T03:31:31.425+0000","up_votes":2,"down_votes":0,"body":"L2PBE.","replies":[]},{"poster":"kneel on Ice","date":"2015-10-14T21:36:51.718+0000","up_votes":1,"down_votes":0,"body":"played 3 rankeds today , 2 of them kindred was picked , the other 1 she was banned","replies":[{"poster":"GayFluffyUnicorn","date":"2015-10-15T01:28:35.487+0000","up_votes":2,"down_votes":0,"body":"Only played a single game today.\nSoloQ ranked.\nFirstpick instalocks kindred without saying anything.\nWent 2/10 (2 kills only by very unnecessary KS)\nGame was lost, got demoted again. Had fun, see league at the new season i guess,tired of this bullcrap. \nWatched his match history and he played kindred 3 times. 2 times he lost hard and one time like 30/something/something (only normal). \nI would totally support a ranked ban for one or two weeks for the new champs","replies":[]}]},{"poster":"Hoodwink","date":"2015-10-14T17:57:36.634+0000","up_votes":2,"down_votes":0,"body":"If you go on Team Builder and look for a jungler, Kindred instantly shows up.","replies":[]},{"poster":"O Fallen Scholar","date":"2015-10-15T12:13:27.622+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=iTaLenTZ,realm=EUW,application-id=3ErqAdtq,discussion-id=VKiHcnaK,comment-id=,timestamp=2015-10-14T15:35:44.787+0000)\n>\n> And 20% of the community claims to be a Kindred main. This is why you disable new champs in ranked for the first 2 weeks.\n\nI disagree. This is how people learn how to play against Kindred in general. It has good sides. If people weren't claiming to be Kindred players or \"mains\" then how can other people even know what Kindred does? Or learn their strengths?\nIt's a part of learning that new champion.","replies":[{"poster":"56552559_DEL","date":"2015-10-15T13:59:03.719+0000","up_votes":1,"down_votes":2,"body":"Its called playing against bots. There is a reason why we have Co-op vs AI matches. That is what I use when trying out new champs. Mainly because im not a dick screwing over my team by picking a champ i have no idea how to play and then completely bombing on it and giving the team a loss that could have been avoided in PVP.\n\nI had this yesterday when playing with a random. He instalocked it and then stayed in the the jg the whole time without ganking any lane. He claimed at the beginning he practiced with it but during the match said he was getting outplayed by the Kha'Zix on the other team. I said, \"no you just suck\" because he obviously wasnt a good jg and coupling that with the new champ made him even worse.\n\nThis is why people should be forced to play a certain amount of bot games before taking the champ into pvp.","replies":[{"poster":"mikemcparty","date":"2015-10-15T15:21:50.783+0000","up_votes":2,"down_votes":1,"body":"Except you are playing against bots, which have no complex movements and don't leave lane for the first 20 minutes. The only way you can truly get good with a champ, outside of csing, is by playing real games. You should not be having this hard of time grasping that. \n\nYour example is even worse, because the jg in bot matches is completely unguarded and open for anything. There is no counterjungling and no rush to gank lanes because the bots are braindead.","replies":[{"poster":"56552559_DEL","date":"2015-10-15T15:44:23.299+0000","up_votes":1,"down_votes":1,"body":"Incorrect. The bots may not have dynamic and complex movements or anything like that, but it is the best way to understand new champs since you have no idea what the abilities will do and when the will do it.\n\nBy removing the human player aspect out of the opponent, you are free to understand the abilities and combos of your champ without worrying about if an enemy jg is going to gank you or if the opposing lane player is going to pull of a spell rotation that only a human player would do.\n\nIt gives you the freedom to practice with the champ to the point of familiarity and to where you feel comfortable enough to take it to PVP if you wish. That is what i do and i am very successful with it.\n\nWhat you are suggesting is worse because then that makes it to where the champ constantly gets banned out or people in TB get overlooked due to the new champ and by that point, they get even LESS practice since no one wants them on their team. And that puts them even FURTHER back on practicing and getting used to the champ whereas if they were to go to bots, you wouldnt have that problem. The bots is mostly used for learning the champs abilities and spell combos to be comfortable enough to use them in PVP. I know there is no human aspect of actual PVP play, but that is not why you use bots. You use it for the reason i stated and that is to learn the champs abilities and combos.","replies":[{"poster":"mikemcparty","date":"2015-10-15T17:22:39.920+0000","up_votes":1,"down_votes":1,"body":"You basically said that to get good with a champ, you need to play bots. I said that bots are good for learning to cs correctly and for understanding abilities, but that is it. In terms of jungling, the only time you will get legitimate experience is in actual games. Laning is SLIGHTLY different story, but in bot games, there is no rush to gank and no pressure in your own jungle. \n\nRegardless, if you play 100 games against bots with a champion, that does not mean anything when you translate that to an actual game against actual players.","replies":[{"poster":"56552559_DEL","date":"2015-10-16T15:37:01.459+0000","up_votes":1,"down_votes":0,"body":"Please show me where i said you have to play bots in order to get good at champs. I never said that nor did i ever imply that.\n\nThe point i was making was that people need to play bots to LEARN the champs to get comfortable enough to take it into PVP is they want to. No one in PVP wants to play with someone that is completely new to a champ nor do they want to play with someone who buys a new release champ and wants to try it out in ranked or regular PVP.\n\nWhat you said was that the only way to get good at a champ outside of csing is by playing real games. Not to mention that you NEVER said ANYTHING about learning abilities. IM the one who said learning abilities. Im not in disagreement with playing real games to get good at a champ. But what i AM in disagreement with is the fact that people should automatically go into real games with first time champs that they have NO IDEA how to play them. That is why i said you need to play in bots for the first few games with a new champ just to get used to the abilities and THEN go into PVP.","replies":[]}]}]}]}]}]}]}