{"poster":"BobTheBaddie","date":"2017-03-14T18:42:20.878+0000","title":"Disconnected during ARAM game. Stuck at \"Authenticating\" when trying to log back in and re-connect.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I was playing an ARAM game when \"attempting to reconnect\" came on my screen, I could still watch everyone play in real time but not move myself. I decided to close the game and re-connect. I'm now stuck at \"Authenticating\" when logging in. Sometimes I get an error saying to contact support.  I tried restarting my PC, still happens. NA.","replies":[{"poster":"Porocles","date":"2017-03-14T19:01:12.448+0000","up_votes":1,"down_votes":0,"body":"It sounds like your network is having a connection problem, so it lost communications with the game server.  When you login to the client, your connection needs to reach our authentication server in order to get back in.  If this is still happening, go through our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to troubleshoot.  Unless your ISP is having an issue, there could be a more local issue that's causing this block.  Let me know if it helps!","replies":[{"poster":"BobTheBaddie","date":"2017-03-14T19:37:04.647+0000","up_votes":1,"down_votes":0,"body":"Thanks for the reply. \nHowever it's happened again, I can connect to EVERYTHING while this is happening but not LOL. After about 5-10 minutes, I can connect to LOL again and finish the game. \n\nCould it be a routing issue with my ISP? (cox).","replies":[{"poster":"Porocles","date":"2017-03-14T20:04:40.595+0000","up_votes":1,"down_votes":0,"body":"If your internet is fine elsewhere, then it may be a more local issue and not your ISP.  It's really important to go through each step of that connection guide to make sure everything is in order.","replies":[{"poster":"BobTheBaddie","date":"2017-03-14T21:50:09.234+0000","up_votes":1,"down_votes":0,"body":"I ran through all the steps including the public DNS, completely disabled my firewall, and forwarded all ports on my PCs IP. Still stuck at \"Authenticating\".  When logging in, the client makes a UI \"toast\" sound, but still says \"Authenticating\". It then gives me an error saying to check my internet and contact support after a minute or two.\n\nUninstalled and re-installed the game. Same thing. \n\nRan the repair, same thing.\n\nUsed the Hextech Repair Tool, same thing (but have logs if needed).\n\n**Edit: ** http://boards.na.leagueoflegends.com/en/c/help-support/Gyk0I8Ng-phoenix-arizona-servers-all-down-for-cox-communications-customers\n\nThat is why :( Thanks anyway, I'll just wait it out.","replies":[]}]}]}]},{"poster":"BobTheBaddie","date":"2017-03-14T18:55:09.751+0000","up_votes":1,"down_votes":0,"body":"Apprears to have fixed itself. Made it into the game with a few minutes left, came back and won :D","replies":[]}]}