{"poster":"Makattack","date":"2017-01-19T16:23:25.797+0000","title":"¿Dónde está el criterio?","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":2,"body":"Hace poco, por cosas del destino, con mi premade me tocaron 3 premades, los cuales dos de ellos jugaban p&eacute;simo, p&eacute;simo, adem&aacute;s de no ayudar en la partida, generar molestias dentro de la misma y obviamente culpar al jungla de no realizar ganks cuando nunca se le dio ayuda al mismo.\r\nClaramente despu&eacute;s de la partida mi premade y yo reportamos la actitud mala onda de los muchachos que fedearon y molestaron, pero entre ellos, seleccionando claramente su cantidad num&eacute;rica como opci&oacute;n de ataque, me reportaron y as&iacute;, me jodieron con 9 partidas con mensajes restringidos pero a ellos nada les ha pasado, ya  que la cantidad num&eacute;rica de quien reporta, importa al parecer m&aacute;s que lo fidedigno de la realidad.\r\nLo dejo en su criterio, alguien que quiera aportar con una realidad similar?","replies":[{"poster":"Akusai","date":"2017-01-19T16:38:05.008+0000","up_votes":1,"down_votes":0,"body":"si tenes el chat restringido es porque flameaste y te reportaron ademas tendrias que saber ya que los reportes injustificados se descartan por lo tanto si te reportan 9 veces sin fundamento no te va a pasar nada","replies":[{"poster":"Makattack","date":"2017-01-19T16:39:56.806+0000","up_votes":1,"down_votes":0,"body":"Me enoje en un punto y claro, dije algo como \"Puta que son malos\" o \"Deja de joder\", etc ...","replies":[{"poster":"Akusai","date":"2017-01-19T16:44:13.372+0000","up_votes":1,"down_votes":0,"body":"tomalo como una oportunidad para aprender a controlar tu enojo y no cometer el mismo error la siguiente vez. Te lo digo yo que flameaba como no te das una idea y un dia me llegaron los carteles de que me podian suspender la cuenta asi que simplemente entendi que la gente no va a jugar mejor porque le diga tal o cual asi de simple y me concentre en mi juego desde entonces creo que mejore bastante.","replies":[{"poster":"Makattack","date":"2017-01-19T16:46:36.988+0000","up_votes":1,"down_votes":0,"body":"Creo que el punto de flammear es una cosa y otro distinto es utilizar para expresar, ellos me flammearon atacándome directamente pero a ellos no les paso nada.","replies":[{"poster":"Akusai","date":"2017-01-19T17:02:25.151+0000","up_votes":1,"down_votes":0,"body":"bueno asi como te paso a vos les va a pasar a ellos si los reportaste correctamente. Por otro lado tene en mente que despues del ban de chat vienen los baneos por dias asi que te recomiendo que uses sabiamente el chat despues de que temine tu sansion.","replies":[]}]}]}]}]},{"poster":"Acid Lysergic ","date":"2017-01-19T16:27:27.145+0000","up_votes":1,"down_votes":0,"body":"Mirá, es normal, pero vos no diste ningún nombre ni nada parecido para que los trabajadores se contacten. Igual si es una cagada que te pase así ...","replies":[{"poster":"Makattack","date":"2017-01-19T16:38:47.833+0000","up_votes":1,"down_votes":0,"body":"Da igual, ya fue y es la situación, lo que pongo en discusión en la mesa es el hecho de que no existe un criterio real al parecer, solo un criterio basado en la cantidad.","replies":[]}]}]}