{"poster":"Dalahsurfal","date":"2019-12-19T18:40:47.207+0000","title":"Porque me eliminaron este comentario o.O?","subforum":"Charlas Generales","up_votes":24,"down_votes":7,"body":"Hola!\r\n\r\nMiren http://prntscr.com/qd7f9d por decirle a alguien como se escribe correctamente una palabra, no adecuado?provocar disputas?donde? \r\nOjo, no estoy siendo sarcástica ni nada, en serio, quiero saber porque yo no le veo nada ofensivo y agradecería que me lo aclaren porque he visto comentarios y posts realmente ofensivos y que no han sido eliminados :/, de paso pregunto, como se modera este foro? un bot o personas reales? verifican los reportes de que sean ofensivos o solo basta con que reporten un comentario?\r\n\r\nSi alguien me sabe responder lo agradeceria mucho ^^\r\n\r\nGracias por su tiempo, que tengan una linda tarde.\r\n{{sticker:sg-ahri-2}}","replies":[{"poster":"YellowMark","date":"2019-12-19T19:19:50.131+0000","up_votes":12,"down_votes":0,"body":"Aqui en ves de dedicarse a reportar los 50 millones de bugs a la central, se dedican a hacer esas clases de estupideces, aunque creo que llegue a ver casos peores aca\n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"ˆLuluˆ","date":"2019-12-19T23:06:55.317+0000","up_votes":7,"down_votes":0,"body":"Hagamos la prueba reporten este comentario, no tiene nada ofensivo pero si le dan muchos reportes y lo borran es por que es un Bot el que borra los comentarios.\n\n{{sticker:sg-lulu}}","replies":[{"poster":"PancitoConKripi","date":"2019-12-21T23:58:59.473+0000","up_votes":1,"down_votes":0,"body":"When pides que te reporten el comentario, pero te banean la cuenta para siempre, F","replies":[{"poster":"ˆLuluˆ","date":"2019-12-22T00:39:41.674+0000","up_votes":1,"down_votes":0,"body":"Nunca me han baneado desde el 2017 xD{{sticker:slayer-jinx-catface}} \nmira esto que turbio\nEs una cassiopeia\nhttps://fotos.subefotos.com/f9212868ad807c107ddc241fb094361co.jpg","replies":[]}]},{"poster":"Lolaleo743","date":"2019-12-21T15:39:14.318+0000","up_votes":1,"down_votes":0,"body":"ahi va &lt;3","replies":[]}]},{"poster":"R 3 N Z Ø R E K","date":"2019-12-19T18:54:40.491+0000","up_votes":6,"down_votes":0,"body":"Supongo que es un bot, aparte creo que estos sujetos ven ofensivo LAS LETRAS EN MAYUSCULAS JAJA{{champion:35}} {{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Aegis","date":"2019-12-21T13:51:22.070+0000","up_votes":2,"down_votes":0,"body":"Es que con las mayúsculas gritas y eso aterra u.u . Fuera de broma, tengo entendido que en verdad se usan para expresar que uno está gritando, así que súmale a eso gente sensible y ya tienes el reporte justificado xD.","replies":[]}]},{"poster":"Diosmo","date":"2019-12-19T22:59:22.530+0000","up_votes":5,"down_votes":0,"body":"\"Manten al pueblo 1gn0r4nt3\"...","replies":[]},{"poster":"PancitoConKripi","date":"2019-12-19T21:23:25.523+0000","up_votes":5,"down_votes":0,"body":"Te lo borraron porque al moderador cree que corregir una palabra crea una disputa, así como se dedican a revisar todos estos \"problemas\", deberían dedicarse a dar una explicación de qué por qué el juego ahora anda peor...\nHay más de 15 moderadores, pero ninguno es capaz de dar una respuesta, total el sueldo les llega si o si a fin de mes.\nSaludos!\n\n(Me vale hectáreas si un \"moderador\" borra este comentario, porque puede generar una gran disputa en nuestra armoniosa y equilibrada comunidad)","replies":[{"poster":"Aegis","date":"2019-12-21T13:53:20.687+0000","up_votes":1,"down_votes":0,"body":"De verdad? O sea que ahora ni siquiera podés impartir conocimiento que la gente se pelea xD?","replies":[]}]},{"poster":"lJakseriousl","date":"2019-12-20T04:29:08.468+0000","up_votes":4,"down_votes":0,"body":"En ocasiones recalcar faltas de ortografia se puede considerar como un comportamiento toxico y/o no adecuado para una conversacion. En gringolandia a las personas que se dedican a recalcar estas faltas de ortografia se les llama Grammar Naz*s. Probablemente por esto te borraron el comentario.","replies":[{"poster":"Nikoratzu","date":"2019-12-21T02:26:51.157+0000","up_votes":2,"down_votes":0,"body":"Descuida no estas en Alemania, puedes decir Nazi sin problemas.","replies":[]},{"poster":"Dalahsurfal","date":"2019-12-20T10:25:30.101+0000","up_votes":1,"down_votes":0,"body":"Oh no sabia eso :( gracias por la info ^^","replies":[]}]},{"poster":"Pollo al Ornno","date":"2019-12-20T04:09:03.485+0000","up_votes":4,"down_votes":0,"body":"Logicamente porque mencionaste la palabra \"Ojos\" organo el cual no todos los seres humanos tienen, haciendo una clara referencia a su discapacidad burlandote de su condicion de vida. \n\nBien borrado, sin dudarlo. Muy bien moderadores del foro, los felicito por mantener el foro limpio de prejuicios a la gente ciega, es mas, voy a cargar 25 dolares en RP como recompensa!\n\n~~dijo nunca nadie~~","replies":[{"poster":"Dalahsurfal","date":"2019-12-20T10:26:12.079+0000","up_votes":3,"down_votes":0,"body":"Se tenia que decir y se dijo (? XD","replies":[]}]},{"poster":"Mascheranox","date":"2019-12-19T21:16:01.260+0000","up_votes":4,"down_votes":0,"body":"Al bot no le gusto tu comentario y te baneo","replies":[]},{"poster":"lordeman10","date":"2019-12-20T04:08:20.338+0000","up_votes":3,"down_votes":0,"body":"se corrige en privado y se felicita en público, entiendo que el foro no tenga MPs pero al menos tratá de no hacer tan prominente la corrección (usar menos mayúsculas, sin exaclamaciones) si querés que nadie se sienta ofendido, por último es solo una corrección a mi me parece muy acertado de parte del moderador agradezcamos que cuidan así el ambiente y lo digo después de haber vuelto de una sanción de una semana, cuesta reconocer los errores pero si sirven para aprender ganamos todos","replies":[{"poster":"Dalahsurfal","date":"2019-12-20T10:33:38.638+0000","up_votes":2,"down_votes":0,"body":"Lo tendré en cuenta para la próxima, igualmente he visto comentarios que si comparas el mio con esos el mio no es nada ofensivo y que a pesar de reportarlos siguen sin ser eliminados, eso era lo que queria saber más que otra cosa, como funciona la moderación de este foro.\n\nA mi me parece \"acertado\" entre comillas porque si no eliminan los que son directamente burlas e insultos son discreción alguna entonces tan \"acertado\" no es.\n\nEn este mismo post hay comentarios más ofensivos que el mio y todavía no se los han borrado a pesar que los reporte. \n\nReconozco que no todos tienen el sentido de humor que tengo yo y se pueden ofender. Igualmente reconozco mi error aunque sigo curiosa respecto a como moderan. \n{{sticker:sg-ahri-2}}","replies":[]}]},{"poster":"YasuOwO","date":"2019-12-19T22:50:21.242+0000","up_votes":1,"down_votes":0,"body":"Ph´nglui mglw´nafh Cthulhu R´lyeh wgah´nagl fhtagn","replies":[{"poster":"ˆLuluˆ","date":"2019-12-19T22:56:39.464+0000","up_votes":3,"down_votes":0,"body":"{{champion:150}}","replies":[{"poster":"YasuOwO","date":"2019-12-21T13:17:09.404+0000","up_votes":1,"down_votes":0,"body":"Aklos","replies":[]}]}]},{"poster":" Acantha","date":"2019-12-19T21:48:32.115+0000","up_votes":3,"down_votes":0,"body":"Tienen gente en práctica aquí en los foros, por eso banean cualquier cosa.","replies":[]},{"poster":"Hnk Kenshiro","date":"2019-12-19T20:05:12.625+0000","up_votes":3,"down_votes":0,"body":"Son personas, creo que unos 6 por lo general, ven los comentarios en con que se topen al forear y ademas tienen una ventanita donde llegan todos los comentarios reportados para verles directamente.\n\nAunque ya no hablan en el foro sobre su moderacion, lo unico seria ver quien aplico el borrado y hablarlo en soporte si quieres quitarte las malas ganas","replies":[]},{"poster":"r K","date":"2019-12-19T21:22:02.699+0000","up_votes":4,"down_votes":1,"body":"Por increíble que parezca, hay gente que se ofende cuando les corrigen sus faltas ortográficas, lo mas seguro es que te hayas llevaod un par de reports y el sistema te borro el comentario automáticamente. Es una lástima ya que la gente en vez de tomarlo como una corrección, lo toman como una ofensa. {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Dalahsurfal","date":"2019-12-19T21:48:13.815+0000","up_votes":3,"down_votes":5,"body":"Lo peor es que en las partidas los que van mal también se ofenden así cuando les das consejos de build y demás(por mas que sea con buenas intenciones y de forma amigable), admito que mi comentario en cierta forma si no se tiene humor puede ser considerado una leve burla pero no da para tanto encima con los comentarios xenofobos que se hacen a veces y no se borran.","replies":[{"poster":"r K","date":"2019-12-19T22:27:29.031+0000","up_votes":3,"down_votes":0,"body":"En general la gente se molesta cuando les recomiendan algo porque sienten que los criticas, en el juego es difícil la verdad, casi hay que adularlos para que no te trolleen o se vayan afk. Es bastante difícil la verdad, independiente que lo hagas con buenas intenciones :/ me ha pasado varias veces.","replies":[]},{"poster":"Karazi","date":"2019-12-19T21:59:05.883+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Dalahsurfal,realm=LAS,application-id=v7qsfXsE,discussion-id=T2TgYJE1,comment-id=00080000,timestamp=2019-12-19T21:48:13.815+0000)\n>\n> Lo peor es que en las partidas los que van mal también se ofenden así cuando les das consejos de build y demás(por mas que sea con buenas intenciones y de forma amigable), admito que mi comentario en cierta forma si no se tiene humor puede ser considerado una leve burla pero no da para tanto encima con los comentarios xenofobos que se hacen a veces y no se borran.\n\nMIS OJOS muggle sangre sucia se escribe basta, pero recuerda te lo digo de manera amable","replies":[]}]}]},{"poster":"Del0reaN","date":"2019-12-20T00:25:33.912+0000","up_votes":2,"down_votes":0,"body":"Te voy a explicar brevemente por qué te borraron tu mensaje: porque mensajes como [este](https://boards.las.leagueoflegends.com/es/c/charlas-generales/umXYxhcf-argentinos-aofertan-de-rp-para-el-daua-de-hoy?comment=0002) y [este](https://boards.las.leagueoflegends.com/es/c/charlas-generales/h5e7Msuo-me-echaron-del-juego-literalmente?comment=0011), aunque sean más ofensivos que el tuyo, siguen existiendo aunque me haya cansado de denunciarlos por semanas.\n\nEso sí, si sos apenas irónico, te comés un ban de 1 día en el foro. Esa es la lógica de Riot. Tienen escasa y casi nula coherencia. No saben ni siquiera lo que deben o no deben sancionar / borrar.","replies":[]},{"poster":"ToxicRunner","date":"2019-12-19T18:51:26.904+0000","up_votes":2,"down_votes":0,"body":"xD","replies":[]},{"poster":"Karazi","date":"2019-12-19T19:22:45.194+0000","up_votes":5,"down_votes":4,"body":"AISH MIS OJOS es basta, aprende a escribir aish me vomito todita","replies":[{"poster":"Dalahsurfal","date":"2019-12-19T20:13:10.086+0000","up_votes":2,"down_votes":7,"body":"***","replies":[{"poster":"HitmannKiller","date":"2019-12-19T20:29:44.181+0000","up_votes":5,"down_votes":1,"body":"Digamos q si tenes que corregir a todo el foro no te da el tiempo, depende como lo mires puede ser ofensivo o no, y tampoco ninguna tiene gracia, de mi punto de vista parece mas una burla.  Pero bueno mas depende de un moderador si no le gusta tu comentario puede borrarlo, por que puede y listo xD. yo discuti una vez por que opine diferente y me borro los comentarios por no estar de acuerdo, no contenian nada ofencivo solo una opinion diferente.","replies":[{"poster":"Dalahsurfal","date":"2019-12-19T20:54:43.441+0000","up_votes":2,"down_votes":3,"body":"Tenes razón, estuve pensando y leyendo de nuevo luego de haberme molestado por lo sucedido y si,en cierta forma puede ser considerado ofensivo :( mala mía,de a ratos olvido que el humor es subjetivo t.t\nAunque lo que quería saber o sea lo que me importaba mas era obtener respuestas a lo que pregunte mas al final y también destacar que a mi me eliminaron un comentario así y algunos que son xenofobicos etc no les borran.","replies":[]}]}]},{"poster":"EŁYonkiDelPueblo","date":"2019-12-19T20:27:03.867+0000","up_votes":3,"down_votes":3,"body":"yo diria que mejor te metas en tu vida tanto te burlas pero seguro has tenido errores estupidos tambien","replies":[{"poster":"Karazi","date":"2019-12-19T21:36:30.910+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=EŁYonkiDelPueblo,realm=LAS,application-id=v7qsfXsE,discussion-id=T2TgYJE1,comment-id=00040001,timestamp=2019-12-19T20:27:03.867+0000)\n>\n> yo diria que mejor te metas en tu vida tanto te burlas pero seguro has tenido errores estupidos tambien\n\nBuen nombre","replies":[]}]}]},{"poster":"Avarøsan","date":"2019-12-20T03:29:18.468+0000","up_votes":2,"down_votes":1,"body":"eso es esu na falta d respeto bo, como bas a correjir a algien aci, no saes malo","replies":[{"poster":"Nikoratzu","date":"2019-12-21T02:21:13.014+0000","up_votes":1,"down_votes":0,"body":"UwU","replies":[]}]},{"poster":"WhiteMax","date":"2019-12-20T02:03:47.752+0000","up_votes":2,"down_votes":1,"body":"Generacion Cristal.","replies":[]},{"poster":"Nikoratzu","date":"2019-12-20T02:32:31.393+0000","up_votes":1,"down_votes":0,"body":"A los moderadores no les agradan los grammar nazi","replies":[{"poster":"Dalahsurfal","date":"2019-12-20T10:36:40.814+0000","up_votes":1,"down_votes":0,"body":"Y que hay con los comentarios xenofobos y machistas que he reportado varias veces con más de una cuenta y siguen sin ser eliminados.\nReconozco mi error pero si me borran el comentario por algo que en cierto punto de vista se puede considerar una burla entonces también borren los otros no?\nYa aclare mis dudas respecto al motivo por el que me eliminaron el comentario y también asumo mi error pero sigo esperando que respondan respecto a como se modera este foro. \n{{sticker:sg-ahri-2}}","replies":[{"poster":"Nikoratzu","date":"2019-12-21T02:07:05.832+0000","up_votes":1,"down_votes":0,"body":"La xenofobia y el machismo son cosas muy subjetivas, depende en que tan sensible sea el que lo lee y en el contexto en que se dice. En tu caso no es ofensivo corregir a alguien , pero si en el proceso lo haces ver como una basura analfabeta si es desagradable, puede que no fuese tu intención pero esa es la impresión que da, quizás si no usabas mayúsculas o si agregabas un \"xD\" o algo parecido se vería mas como una broma. No es lo que dices sino como lo dices.","replies":[]}]}]},{"poster":"Jade Fang","date":"2019-12-20T21:37:09.340+0000","up_votes":1,"down_votes":0,"body":"Mandale tickecito :v jajaja. Na enserio... o sea... si es \"agresivo\" pero no para borrarlo... yo igual por las dudas siempre uso el sarcasmo.","replies":[]},{"poster":"Mazoku","date":"2019-12-19T20:12:11.047+0000","up_votes":2,"down_votes":4,"body":"Probablemente porque afecto los ojos del moderador que tuvo que leer tan mala sintaxis en un comentario.","replies":[{"poster":"EŁYonkiDelPueblo","date":"2019-12-19T20:29:43.224+0000","up_votes":4,"down_votes":4,"body":"***","replies":[{"poster":"Mazoku","date":"2019-12-19T21:03:08.886+0000","up_votes":2,"down_votes":2,"body":"Bienvenido al foro!","replies":[]}]}]}]}