{"poster":"kaytecane","date":"2015-01-29T21:00:21.251+0000","title":"Support Rune Page","subforum":"Tips & Tricks","up_votes":2,"down_votes":0,"body":"I am level 23 and making a support rune page, any tips on what I should get?","replies":[{"poster":"Sukishoo","date":"2015-01-29T21:30:47.542+0000","up_votes":1,"down_votes":0,"body":"Depends on the type of support really\n\nfor disruptive damaging supports like Annie, Lulu, Karma, ect. I tend to use\nMarks: Magic Penetration\nSeals: Flat Health\nGlyphs: Flat Ability Power or Scaling Magic Resist\nQuints: Flat Ability Power\n\nTanky supports like Thresh, Leona, Braum, ect. I use\nMarks: Flat Attack Damage\nSeals: Flat Health\nGlyphs: Scaling Magic Resist\nQuints: Armor\n\nI have used other set ups as well, such as \nGold per second Quints and Seals\nScaling AP or Movement Speed Quints\n\nThere's really just a lot a viable options, it all just depends on what you think you'll need and how it fits your playstyle. Either early game (like Flat AD, AP, Armor, MR, ect) or late game (scaling AD, AP, Armor, MR, ect)","replies":[{"poster":"évy","date":"2015-01-29T21:57:10.030+0000","up_votes":1,"down_votes":1,"body":"never use scaling runes botlane... it isnt efficient as they gain  levels slower..... especially support","replies":[{"poster":"Sukishoo","date":"2015-01-29T21:59:18.664+0000","up_votes":1,"down_votes":0,"body":"They gain levels slowly yes, but they are very efficient by level 6 as they out scale flat runes.  I use scaling armor for ADCs as well and it works so much better then flat armor.","replies":[{"poster":"évy","date":"2015-01-30T17:21:48.504+0000","up_votes":1,"down_votes":1,"body":"look at even the riot employee\nnothing is wrong with using scaling\nbut it isnt effective botlane because of the shared (reduced) income of expecience which means you take longer to hit the breakpoint.\nmost high elo players use flat instead of scaling because the early game is so important in a bot lane matchup, and add that to the reduced xp makes flat a tad bit stronger than scaling","replies":[{"poster":"Sukishoo","date":"2015-01-30T21:44:34.943+0000","up_votes":1,"down_votes":0,"body":"Different people find different things useful. It's been very effective for me, hence why I got Gold last season :) So it's very good in any lane.","replies":[]}]}]}]}]},{"poster":"Riot 10YearSanta","date":"2015-01-30T02:57:11.335+0000","up_votes":1,"down_votes":0,"body":"I use flat armor seals, flat ap or hybrid pen marks/quints, and glyphs are either flat ap or flat mr","replies":[]},{"poster":"tseihei","date":"2015-01-29T22:27:34.517+0000","up_votes":1,"down_votes":0,"body":"defensive runes on support are very versatile, and can be used on pretty much all of them.\nif you have the ip, get hybrid pen reds, otherwise you have the option of just taking armor reds\nif you have lots of ip you can go health yellows, otherwise just go armor yellows\nsome supports may gain from having 3 flat mana regen glyphs, if so get those and then the rest will be mr scaling for defence, flat armor, or sometimes ap.\nquints, i prefer 2 hp and one armor. but sometimes I can plull off something like mana regen quints.","replies":[]},{"poster":"AMYS GRAVE","date":"2015-01-29T21:22:10.409+0000","up_votes":1,"down_votes":0,"body":"in order of my preferences, \n\nMarks - Hybrid Pen, AD, MP\nSeals - Armor\nGlyphs - Magic Reist\nQuints - Gp10, Armor, AP, Health\n\nare all good choices. \n\nMarks: Hybrid pen are quite good for many situations and are quite versitile, MP are good for your AP supports, and i mention the AD for doing damage to turrets, a few supports have AD scaling but that's about it. the AD is a bit more of a niche pick for me. \n\nQuints: i like to run Gp10 on many supports for a steady gold income and to get that sightstone sooner than the enemy. AP-MP is one that i'll use on supports and mages in any position, Armor is good for AD heavy team comps or if they are running an AD kill lane bot, Health is good vs. an AP kill support like annie and health is good for every champion in every role and is imo the most versatile rune in the game.","replies":[]},{"poster":"GummyBearWookiee","date":"2015-01-29T21:08:38.437+0000","up_votes":1,"down_votes":0,"body":"well....the easiest set up in my opinion would be \n\nHybrid pen reds.\nArmor Yellows.\nMR Blues\nAnd movement speed quints.\n\nYou can vary it quite a bit...but generally the armor and MR are fairly standard.  Depending on what supports you like to play...you can vary it with straight magic pen reds and some AP quints as well.","replies":[]}]}