{"poster":"Blutwors","date":"2017-05-15T09:18:19.053+0000","title":"PC freeze während / nach dem game","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich habe folgendes Problem:\r\nSobald ich ein Spiel gewonnen oder verloren habe und dann auf dem Button klicke um wieder auf dem Desktop zu kommen, h&auml;ngt sich alles auf (au&szlig;er Mausbewegungen und das sprechen im Ts)\r\nIch kann nicht mal mehr den taskmanager aufrufen. Es hilft nur ein Neustart.\r\nDas ist nicht bei jedem Game so, aber Statistik etwa bei jedem 2.\r\n\r\nIch habe 3 Bildschirme, deshalb kann ich sehen was au&szlig;erhalb von LOL vor sich geht.\r\nTs friert ein, die taskleiste auch, und youtube quittiert meist schon vorher seinen Dienst. \r\nAlles andere aus zu lassen, hilft auch nicht.\r\n\r\nHat jemand eine Idee ?\r\n\r\nGru&szlig; \r\n\r\nBlut","replies":[{"poster":"ItzExplizit","date":"2018-07-15T17:26:11.000+0000","up_votes":1,"down_votes":0,"body":"Hat irgendetwas geholfen, hab nämlich genau dasselbe problem! :/","replies":[]},{"poster":"Blutwors","date":"2017-06-05T23:50:04.774+0000","up_votes":1,"down_votes":0,"body":"Hallo zusammen. Also ich habe jetzt festgestellt, dass das Problem scheinbar nicht an LOL hängt, sondern eher im allgemeinen am Rechner, denn er hängt sich auch einfach so auf.\n\nHat jemand noch eine Lösung? Oder eine Idee ?\n\nAnsonsten mache ich später mal windows neu. \n\nDie Reparatur vom LOL Client habe ich mal laufen lassen, hilft aber natürlich nix, wenns ein allgemeines Problem ist. \n\nWenn sich der pc aufhängt und ich ihm mit der reset Taste neu starte, kommt folgender Fehler inklusive bluescreen \n\nDatei:\\WINDOWS\\system32\\winload.exe\n0xc000000e","replies":[]},{"poster":"Blutwors","date":"2017-05-15T11:46:43.504+0000","up_votes":1,"down_votes":0,"body":"Das werde ich mal testen , Danke \n\nSonst noch jemand eine Idee ?","replies":[]},{"poster":"Homunculi","date":"2017-05-15T09:29:38.985+0000","up_votes":1,"down_votes":0,"body":"klingt nach einem übleren Problem o_O.\n\nMal alle Treiber aktualisieren, auch Chipsatz und BIOS Update, dafür mal am besten nach dem Mainboard suchen und auf der Herstellerseite nachsehen was so alles neues gibt. Evtl. gibts auch einen Autoupdater vom Hersteller.\n\nEine Windowsreparatur könnte auch helfen. Auch eine Festplattendiagnose wäre angebracht.","replies":[]}]}