{"poster":"MoneyMash","date":"2017-11-07T04:45:06.732+0000","title":"14 Day ban","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hello riot. I am a very competitive player and sometimes i can get \"overheated\". Most of the time im really positive to my team. I am always looking to help a fellow summoner. This one game when I was playing Nasus, I had a troll on my team. I got really upset becasue I was in a promo game. I started to get mad but I know the best thing I could do was not be toxic. I had a troll player on my team and i was very calm. They were inting and thats what really makes me mad that I got a 14-day ban. I got really mad and i couldn't hold my anger in. Riot please understand that I am trying to get reformed. I love league of legends and I've spend lots of money on it. I'd hate to see my account get perma-banned after this. Please take consideration to appeal my 14 day ban. I I was trying to keep my team positive like saying stuff like \"we can do it\" \"dont be toxic\" \"we have a chance\". I know I said a few foul words but please take this in to consideration. If my ban gets overturnedm I am looking to have a fun, positive, and enjoyful, time on the rift. I will try to be a positive as possible. I will turn off \"all chat\", just so I wont get tempted. Thanks for all the great content you have provided. I am a true fan. Here is my chat log.\r\n\r\nGame 1\r\nMoneyMash: kayle stay until its at 200\r\nMoneyMash: im not going to smite\r\nMoneyMash: xD\r\nMoneyMash: got his flash\r\nMoneyMash: oh rite\r\nMoneyMash: yessir\r\nMoneyMash: damn\r\nMoneyMash: malph\r\nMoneyMash: lol\r\nMoneyMash: lol\r\nMoneyMash: haha\r\nMoneyMash: malph please tank for xayah\r\nMoneyMash: LOL\r\nMoneyMash: I FLASHED\r\nMoneyMash: xd\r\nMoneyMash: im special \r\nMoneyMash: i flashed for u jhin\r\nMoneyMash: bcuz u matter\r\nMoneyMash: MALIHPITE WHY DONT U HAVE RELIC SHIELD\r\nMoneyMash: OMG\r\nMoneyMash: malph get relic\r\nMoneyMash: report malph\r\nMoneyMash: please\r\nMoneyMash: malph stop trollihng\r\nMoneyMash: u let me die\r\nMoneyMash: malph what were u doing\r\nMoneyMash: like wtf\r\nMoneyMash: jhin can u report this maliphite\r\nMoneyMash: he is trolling\r\nMoneyMash: fenks\r\nMoneyMash: MALPH STOP\r\nMoneyMash: PLEASE\r\nMoneyMash: ENJOY THE PERMA Xd\r\nMoneyMash: how\r\nMoneyMash: u r inting\r\nMoneyMash: feeding\r\nMoneyMash: malph just atleasdt try\r\nMoneyMash: its people like malph that have no life\r\nMoneyMash: you fuck up other peoples games so u feel good about ur self\r\nMoneyMash: vel we can carry\r\nMoneyMash: dont let this noob malph tilt us\r\nMoneyMash: worth\r\nMoneyMash: :D\r\nMoneyMash: xd\r\nMoneyMash: we can win\r\nMoneyMash: if malph wants to get a perma let him have it\r\nMoneyMash: yep\r\nMoneyMash: 4v5\r\nMoneyMash: :(\r\nMoneyMash: this is why i hate bronze\r\nMoneyMash: lol\r\nMoneyMash: ehh\r\nMoneyMash: ^\r\nMoneyMash: please\r\nMoneyMash: malph is inting\r\nMoneyMash: ;=\r\nMoneyMash: aww\r\nMoneyMash: no wayu\r\nMoneyMash: LOL\r\nMoneyMash: LOL\r\nMoneyMash: awww\r\nMoneyMash: damn\r\nMoneyMash: lololol\r\nMoneyMash: u killed the talon xd\r\nMoneyMash: everyone push mid\r\nMoneyMash: we have a chance\r\nMoneyMash: please\r\nMoneyMash: holy shit\r\nMoneyMash: garen dmg\r\nMoneyMash: yep\r\nMoneyMash: its so unfortunate\r\nMoneyMash: noob garen\r\nMoneyMash: jk\r\nMoneyMash: ly &lt;3\r\nMoneyMash: malph\r\nMoneyMash: pls dont\r\nMoneyMash: riperoonis\r\nMoneyMash: i realize that\r\nMoneyMash: gg :(\r\nMoneyMash: report malph\r\nMoneyMash: so gay gren\r\nMoneyMash: oof\r\nMoneyMash: garen is so balanced xd\r\nMoneyMash: alright\r\nMoneyMash: yep :(\r\nMoneyMash: lol\r\nMoneyMash: xayah farm\r\nMoneyMash: [;s\r\nMoneyMash: pls\r\nMoneyMash: yep\r\nMoneyMash: gg\r\nMoneyMash: velkoz we should just try to defend in base\r\nMoneyMash: vel just play safe\r\nMoneyMash: im going to pick off annie\r\nMoneyMash: he doesnt\r\nMoneyMash: he has like a 9kda\r\nMoneyMash: not this game\r\nMoneyMash: but he is good\r\nMoneyMash: nah\r\nMoneyMash: welp\r\nMoneyMash: defend\r\nMoneyMash: ggwo\r\nMoneyMash: ggwp\r\nMoneyMash: report malph for inting and negative attitude\r\nMoneyMash: LOL\r\nMoneyMash: NO WAY\r\nMoneyMash: NICE\r\nMoneyMash: PUSH\r\nMoneyMash: ^\r\nMoneyMash: its garen LOL\r\nMoneyMash: hes a janitor\r\nMoneyMash: cleans up\r\nMoneyMash: FK OFF\r\nMoneyMash: NED\r\nMoneyMash: NED\r\nMoneyMash: END\r\nMoneyMash: WAT \r\nMoneyMash: WA YT\r\nMoneyMash: WAT\r\nMoneyMash: T\r\nMoneyMash: AWTWAT\r\nMoneyMash: TW\r\nMoneyMash: ATW\r\nMoneyMash: LOLO\r\nMoneyMash: OLOL\r\nMoneyMash: gj team\r\nMoneyMash: get him\r\nMoneyMash: GET HIS COOLASS\r\nMoneyMash: GROUP\r\nMoneyMash: MID\r\nMoneyMash: GROUP\r\nMoneyMash: malph\r\nMoneyMash: mid please\r\nMoneyMash: get 3 inhib\r\nMoneyMash: ill push bot\r\nMoneyMash: RIP\r\nMoneyMash: get baron\r\nMoneyMash: guys we can still win\r\nMoneyMash: dont give up\r\nMoneyMash: NICE\r\nMoneyMash: NICE\r\nMoneyMash: YEWSS\r\nMoneyMash: NICE\r\nMoneyMash: PUSH\r\nMoneyMash: BITCH\r\nMoneyMash: COME\r\nMoneyMash: welp\r\nMoneyMash: ?\r\nMoneyMash: for what\r\nMoneyMash: lol\r\nMoneyMash: xayah u can do it!\r\nMoneyMash: welp\r\nMoneyMash: GG\r\nMoneyMash: OOF\r\nMoneyMash: TALON SO CLOSE :(\r\nMoneyMash: oof\r\nMoneyMash: gg\r\nMoneyMash: crap\r\nMoneyMash: defend guys\r\nMoneyMash: defend\r\nMoneyMash: xayah\r\nMoneyMash: base\r\nMoneyMash: NOOO\r\nMoneyMash: 14/14/11\r\nMoneyMash: not inting\r\nMoneyMash: im keeping my team alive lol\r\nMoneyMash: kalye pls carry us\r\nMoneyMash: rip\r\nMoneyMash: rip\r\nMoneyMash: end\r\nMoneyMash: PLS END\r\nMoneyMash: 70 seconds lol\r\nMoneyMash: that might be gg\r\nMoneyMash: ok\r\nMoneyMash: not wuf\r\nMoneyMash: crap\r\nMoneyMash: no one be toxic pls\r\nMoneyMash: we can win\r\nMoneyMash: we actually cant tilt each other\r\nMoneyMash: push\r\nMoneyMash: guys\r\nMoneyMash: damn\r\nMoneyMash: ive never seen a skarner that does that much damage xd\r\nMoneyMash: WHAT\r\nMoneyMash: PLS\r\nMoneyMash: OMFG\r\nMoneyMash: GAREN\r\nMoneyMash: LOL\r\nMoneyMash: baron\r\nMoneyMash: welp\r\nMoneyMash: everyone in base\r\nMoneyMash: vel we need u\r\nMoneyMash: pls\r\nMoneyMash: pls\r\nMoneyMash: VEL PLS\r\nMoneyMash: U CARRY US\r\nMoneyMash: PLS\r\nMoneyMash: WHAAAA\r\nMoneyMash: WHYY\r\nMoneyMash: pls\r\nMoneyMash: cmon dood\r\nMoneyMash: gg\r\nMoneyMash: BIGGEST WASTE OF TIME\r\nMoneyMash: REOPORT MALPH","replies":[{"poster":"Dark Morgana","date":"2017-11-07T23:40:14.798+0000","up_votes":2,"down_votes":0,"body":"I don't feel like going over this in public is the right choice here! If you want to talk about your suspension in one on one situation then[ submit a ticket](https://support.riotgames.com/hc/en-us/requests/new) over to our player behavior team for further details.","replies":[]},{"poster":"c7MlbWqg5k","date":"2017-11-07T11:00:29.964+0000","up_votes":2,"down_votes":0,"body":"what i can see in this chat log, u may have called garen gay? homophobic slander like that deserves punishment, also telling others to report a player isnt very good of you, they can see the same things u can in game, u mentioned ur bronze? no offense to any bronze players but the players at that skill level may not be the best and make mistakes builds, pathing, shotcalling, etc, u cant expect a perfect game at that level. i think punishment in that scenario is just, yes you were frustrated, yes you handled it poorly, and yes you are in control of how you feel about a player in game, you have the ability to get upset over it or let it go and make enjoyable memories with ur fellow summoners on the rift. by no means is that the end of the road for you, but also a 14 day ban is issued after chat restrictions etc, so it escalated to that punishment, riot is generally forgiving in their punishment system and wants you to reform, they dont want players leaving their game, but they also cant have players slandering and abusing others, for a long time the league community had a bad rep for being toxic and they have done great things to push the community in the right direction, i think personally that u have the ability to reform, everyone does, you can do it friend, dont be discouraged or upset at riot, but look at the situation on a greater scale.","replies":[]},{"poster":"Kokua","date":"2017-11-07T05:06:48.709+0000","up_votes":1,"down_votes":0,"body":"It looks like you instantly got mad at Malphite for not building the item that you'd expect him to build, and likely as a result, caused him to be upset at you from that point on, at least based on your responses directed at him. The fact is, not everyone will build or play the same as you expect them to based on personal opinion or common practice, and you shouldn't instantly get upset with someone simply because they aren't building the item you expected them to. It looks like you put the blame on him for things not turning out the way you expected from an early point and throughout the game, which I can imagine also being frustrating to them. Some people are able to take harsh criticism and work well under pressure, but others will crack under the same pressure and lead to worse results. I personally find it funny that most of the chat logs people post usually have them repeatedly telling other people to report another individual. I personally believe that to be a negative action in its own way, as you then start to divide the team rather than trying to work together through your differences. If you feel like someone should be reported for their actions, wait till the end of the game, and write out why you believe them guilty of what you're reporting them for. Saying that you're going to report someone early on in a match will likely create distance and disruptive behavior between you and the person you're angry with. Waiting till the end allows you to make a better judgement of whether or not you think their behavior throughout the game deserves to be reported or not. For all you know, he could have just made a single minor mistake when you got mad at him, or you might not have noticed something that he was trying to avoid, and you let your anger in the moment take control.","replies":[{"poster":"c7MlbWqg5k","date":"2017-11-07T11:03:22.131+0000","up_votes":1,"down_votes":0,"body":"thats a pretty good way of looking at it ive had games where i didnt say anything in chat and had a team member asking our teammates and other team to report me for inting or something when i made a bad judgement call a couple of times, it happens, i was still trying to win the game but having someone putting u on the spot for misplay etc and ridiculing u in chat def makes things worse.","replies":[]}]}]}