{"poster":"MeatballDwarf","date":"2016-11-09T19:45:27.368+0000","title":"Warum ich finde dass die neuen ultimate... super... hyper... mega... Skins den alten überlegen sind","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":1,"body":"Dies ist nur eine pers&ouml;nliche Meinung meiner Seits, jeder hat da seine anderen Vorstellungen aber... Ich konnte das nicht einfach auf mir sitzen lassen. \n\n_**Warum die neuen ultimate... super... hyper... mega... Skins den alten überlegen sind:**_\n\nJedes Jahr nehmen sich eine Hand voll Riot-Mitarbeiter Zeit um einen super aufwendigen Skin anzufertigen. Da spricht an sich nichts dagegen, nur was sie da letztens fabrizierten lie&szlig; mich ein wenig sprachlos. Aber schauen wir uns die Skins doch mal an. Beginnen w&uuml;rde ich hier mit Spirit Guard {{champion:77}} . Dieser Skin gef&auml;llt mir wirklich sehr. Ich seh ihn gelegentlich mal in einem meiner Spiele und freue mich jedes mal wenn ich ihn sehe... Oder schaudere... wenn er einen Feed abbekommen hat. Klassisch bei dieser &quot;Art&quot; von Skins ist, dass der Look des champs KOMPLETT &uuml;ber den Haufen geworfen wird (Oder teilweise, aber dann sind es doch sehr gro&szlig;e &Auml;nderungen) und sich nochmal him gesetzt wird und der Champ ganz neu aufgelegt wird. Udyr sieht aus wie ein richtig schlimmer Finger, den man lieber nicht in Frelljord beim cold-Joga st&ouml;ren will. Genau wer der Look, wird auch alles andere &uuml;berarbeitet. Neue emotes, neuer dance, neue Sterbeanimationen und neu modellierte Particles, Bei ihm sogar neue Angriffsanimationen. Ob einem das 20&euro; Wert ist muss jeder f&uuml;r sich entscheiden, aber so an sich ist das ein toller Skin.\n\nMachen wir gleich mal weiter mit Pulsfire{{champion:81}}. Um das ganze zu verknappen geh ich darauf nicht explizit sein. Es sei gesagt: Alles ist neu und strahlt in Chrom. Ist er denn die 20&euro; Wert?\n\nNun kommen wir zu einer anderen Kandidatin, denn bei ihr wird es schon etwas... &quot;spannender&quot;, DJ {{champion:37}}. ich werde nicht nochmal alles runter leiern sondern komme direkt zum Punkt. Bei Dj Sona hat man alles neu gemacht... Und das ganze 3 mal! Ja genau. Drei verschiedene Sona- versionen. Drei neue Animationen und Particles, dance und emotes sind zwar die selben aber auch ihre F&auml;higkeiten sehen bei jeder Version anders aus. Zus&auml;tzlich dazu gibts noch Radio Sona. Jet Set Radio der Kluft, oder eher Zweiter Weltkriegsfunk, denn so wie sie dir ihre F&auml;higkeiten um die Ohren donnert k&ouml;nnte man auch _&quot;Wir stehen unter schwerem Beschuss!&quot;_ in Dauerschleife abspielen. Auch hier ist wieder die Frage: 20&euro; f&uuml;r digitales Decor? Ich pers&ouml;nlich bin hier aber der Meinung: Bei 3 verschiedenen Skins w&uuml;rde ich mir dass doch &uuml;berlegen. \n\nUnd nun... zum echten Grund warum ich diesen Artikel in&#039;s Leben rief... Elementalist {{champion:99}}, Welcome to the bright side of life, am I right? Allerdings, denn f&uuml;r 20&euro; bekommt man hier nicht 1, nicht 2, auch nicht 3 sondern 10! verschiedene Lux versionen! 10! 10!!! Was soll denn das? Ach ja, alles neu wie bei allen anderen, aber WAS SOLL DENN DAS?! Setzen wir diesen Skin mal mit den anderen in Vergleich.\n\n Udyr                                    \nAlle partice sind anders\nAussehen ge&auml;ndert\nNeue Animationen \n\nEzreal                                  \nAlle partice sind anders\nAussehen ge&auml;ndert \nNeue Animationen\n\nSona                                          \nAlle partice sind anders (*3)\nAussehen ge&auml;ndert (*1,5)\nNeue Animationen\n\nLux\nAlle partice sind anders (*10!)\nAussehen ge&auml;ndert (*10)\nNeue Animationen  (*10)\n\nAlleine das sollte schon reichen um zu erkennen dass Riot beim balencing irgendwas falsch gemacht hat. Im vergleich zu den ersten beiden Skins sind gerade die letzten beiden vollgestopft bis oben hin! Bevor hier jemand dass Gef&uuml;hl hat er m&uuml;sste ein bisschen &quot;hate&quot; ablassen, Ich besitze keine dieser Skins und habe versucht alles essayistisch zu halten, da geh&ouml;rt die eigene Meinung einfach dazu. Aber was haltet ihr denn davon? Was denkt ihr dar&uuml;ber? Ich w&uuml;rde gerne ein paar Meinungen sammeln. \n\nMfG\n\nDer, der eine Wette um seinen Beschw&ouml;rernamen verlor.","replies":[{"poster":"TerrorRaven","date":"2016-11-09T19:59:12.478+0000","up_votes":2,"down_votes":0,"body":"Du lässt was wichtiges aus und zwar den technischen Fortschritt: Damals, als PF Ezreal raus kam, war es Non Plus Ultra. Heute wirkt er im Vergleich zu den anderen Skins veraltet, da die Technik weiter Fortgeschritten ist und weiterentwickelt wurde. Sowas wie Elementar Lux wäre 2012 sicher nicht möglich gewesen. Was damals noch ein Legendärer Skin war (nehmen wir als Beispiel Annie in Wunderland) würde nach heutigen Maßstäben als 950er Skin durchgehen. Einfach weil die Technik und der Anspruch weiter gestiegen ist.\n\nNun könnte man natürlich nach einem visuellen Update schreien. Das würde allerdings viel Zeit und Ressourcen in Anspruch nehmen, weswegen sowas nur noch bei VGUs gemacht wird.","replies":[]},{"poster":"BigSnipe","date":"2016-11-09T20:07:47.374+0000","up_votes":1,"down_votes":0,"body":"Es sind Skins, über die Jahre hat Riot mehr Möglichkeiten güte Skins zü machen, denn sie haben mehr Zeit ünd Geld. \nKeiner müss sie sich kaüfen ünd alle haben Besonderheiten die kein anderer hat. Es sind nünmal Ültimate Skins, daher gibt es keine Regeln. \n\nWie dü schon sagst, bekommen die neüeren Skins mehr, aber wo ist das Problem?, es ist doch schön wenn man mehr fürs gleiche Geld bekommt....\nJa die letzten beiden haben mehr bekommen, die ersten beiden waren aber bei **release im sale**(50%).\n\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Nycaria","date":"2016-11-09T19:53:14.176+0000","up_votes":1,"down_votes":0,"body":"Der Lux Skin ist einfach nur awesome *-* {{sticker:zombie-nunu-hearts}}","replies":[]},{"poster":"Sihari","date":"2016-11-09T19:50:57.434+0000","up_votes":1,"down_votes":0,"body":"Es steht glaube ich außer Frage, bei welchem Skin man am meisten für sein Geld bekommt xD\nBei dem, was ich mit dem neuen Lux-Skin geboten bekomme würd ich sogar noch mehr bezahlen, denn eigentlich ist er wirklich viel mehr wert als die anderen Skins. ^-^","replies":[]}]}