{"poster":"IuzbeIito","date":"2015-03-25T18:32:50.197+0000","title":"Curse Voice esta permitido?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Quisiera saber si el programa Curse Voice esta permitido para usarlo durante el juego, me han dicho varios que se consideraba sancionable su utilizacion","replies":[{"poster":"Futanari","date":"2015-03-25T18:42:06.299+0000","up_votes":2,"down_votes":0,"body":"> ¡Hola a todos!\n> \n> Creo que es muy importante aclarar el tema y colocarlo en \"importantes\"\n> \n> Les repetiré lo que hemos dicho con Candanga:\n> Curse voice no es una aplicación de Riot si no algo creado por una compañía tercera y no aprobado por nosotros. \n> \n> No deben usarla en Lan o Las, ya que desde el punto de vista de nuestro equipo ventajas competitivas con otras aplicaciones es algo que no deberíamos permitir, y si sabemos que alguien la utiliza, existirán sanciones para ellos.\n\nSir Dal - 2014.","replies":[{"poster":"Caraxes","date":"2015-03-25T20:41:48.152+0000","up_votes":3,"down_votes":0,"body":"Eso era cuando tenia funcionalidades ingame, hoy por hoy es solamente una alternativa a programas similares como skype.\n\nY ya dijieron que despues de esas modificaciones, esta permitido","replies":[]}]},{"poster":"MilosKaos","date":"2015-03-25T18:44:18.171+0000","up_votes":2,"down_votes":0,"body":"Aunque en un primer momento estuvo prohibido porque violaba las políticas de programas de terceros de Riot ahora se lo puede usar, al menos este fue el ultimo comunicado que leí al respeto sobre esto.\n\nhttp://forums.las.leagueoflegends.com/board/showthread.php?p=1085426#post1085426\n\nAsí que si, lo puedes usar tranquilamente.","replies":[{"poster":"IuzbeIito","date":"2015-03-26T16:58:01.038+0000","up_votes":1,"down_votes":0,"body":"esto fue al final del 2014 pero fue despues de lo que puso sir dal? que cito Hola Soy Nueva?","replies":[]}]},{"poster":"Deczorito","date":"2015-03-26T05:20:10.508+0000","up_votes":1,"down_votes":0,"body":"que es curse voice?","replies":[{"poster":"IuzbeIito","date":"2015-03-26T16:54:57.159+0000","up_votes":1,"down_votes":0,"body":"es un programa parecido a skype que tenia sus adaptaciones al juego y consume mucho menos que skype(no bajan tanto los fps)","replies":[]}]}]}