{"poster":"Roxy der Panda","date":"2015-02-22T11:28:07.964+0000","title":"Heldrin    //   Der Seelenfänger","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":1,"body":"Heldrin (Der Seelenfänger)\nStats: Lvl.1\nLeben: 410 (+70 Pro Level)\nHP Regen: 7.45 (0,65 Pro Level)\nMacht: 60\nLauftempo: 330\nAngriffsschaden: 47 (3.375 Pro Level)\nAngriffsgeschwindigkeit: 0.70 ( 5% Pro Level)\nReichweite: 115\nRüstung: 15 ( +1 Pro Level)\nMagieres: 25 (+0,82)\n--------------------------------------------------------------------------------------\nFähigkeiten:\n(Passive): Seelen Klinge\nHeldrin bekommt pro Getötetes Monster, Vassal oder Champion 0.25 Angriffsschaden dauerhaft dazu.\n[Das würde bedeuten das 100 Vassalen ihm 25 Angriffskraft geben.] \nZusätzich bekommt er 5 Macht wenn er einem Gegner Schaden zufügt, diese bleiben bis das \"Ansturm\" oder \"Ungezügelte Macht\" eingesetzt wird oder bis Heldrin stirbt.\n\n\n(Spell) Q :   Seelen brecher //  Abklingzeit:  8 Sek\nPassive: Pro 20 gestapelter Macht, verursachen die Normalen Angriffe 1% der Fähigkeitsstärke als zusätzlichen magischen Schaden.\nAktivieren: Heldrins nächster normale Angriff verursacht zusätzlich, 30/35/40/45/50% seiner Fähigkeitsstärke als NORMALEN Schaden. Zusätzlich 50/60/80/90/100 Absoluten Schaden.\n\n\n(Spell) W :     Ansturm  //  Abklingzeit: 3 Sek // Kosten 30 Macht\nAktivieren: Heldrin stürm in Richtung des Mauszeigers (Reichweite 410). [Bewegt sich dadurch, durch Einheiten aber nicht durch Wände.].\nEr verlangsamt  jeden Gegner auf seinen Weg für 1/1.5/2/2.5/3 Sek um 50%.\n\n(Spell) E :       Macht Barriere  // Abklingzeit: 12 Sek \nAktivieren: Verleiht Heldrin ein Schild, welches Ihn schützt.\n(die Schildstärke beträgt 40/45/50/55/60% der eigenen Angriffskraft und 20% der Fähigkeitsstärke). \n[Dauer 3 Sekunden]\n\n(Spell) R :       Ungezügete Macht  // Abklingzeit: 200 Sek\nPassive: Heldrins Macht erhöht sich auf 80/100/120.\nAktivieren: Heldrins entfesselt die volle Macht des Seelenbrechers, wodurch der passive Bonus von \"Seelen brechen\" unabhängig von der derzeitigen Macht sich auf das Maximum erhöht. [Das wären 8% / 10% / 12%].        Zu dem hat \"Ansturm\" eine Reichweite von 550 und kostet keine Macht mehr.\n20% des absorbierten Schaden von \"Macht Barriere\" wird zurückgeworfen.\nDie Abklingzeit von \"Seelen brechen\" wird zurück gesetzt.\n[Dauer 10 Sekunden]\n-----------------------------------------------------------------------------------------\nThema: \nIch wollte damit einen Champion erschaffen der AP und AD in sich vereint.\nDurch seine sehr Item lastige Spiel-Mechanik ist dieser Champ erst im Lategame eine wahre bedrohung.\nDoch dann ist er ein geführchteter Gegner mit hoher Mobilität.    \n                                                            \nEr hat deutliche Stärken und deutliche Schwächen was ihn zu einem recht schwierigen Champion aber zu gleich zu einem sehr Starken Champion machen kann.\nBesondere Schwächen sind da sein Leben, Rüstung und Magie-resi die im vergleich zu anderen ziemlich schwach sind. Im Earlygame, wird er nicht viel Schaden machen können, da sein Grundschaden bis auf den Absoluten Schaden minimal ist und zudem er nur einen Spell hat der Schaden verursacht.\nStark ist er jedoch mit gewissen Items, wie Nashorszahn, Lichtbringer, Gunblade usw. \ndiese lassen seinen Schaden in die Höhe schießen! \nStark ist auch das er auf AP gebaut werden kann und dennoch einen beachtlichen AD Schaden raushauen kann, was es schwer macht sich gegen ihn zu schützen.\n-------------------------------------------------------------------------------------------------------\nWitz:  Keine Sorge, ich breche keine Herzen... ich will nur deine Seele.\nTaunt: Sie nur wie sie Fallen! Und du kannst rein garnichts tun...\nSpezial: (Thresh getötet) So... viel.. Macht!\nSpezial: (Lucian getötet)  Der Tot ist nicht das Ende...\nSpezial: (Kalista getötet)  Auf ewig gebunden.\n\n\n\nWas sagt ihr? Hat Heldrin eine Chance verdient? :)","replies":[]}