{"poster":"Bran","date":"2017-09-22T09:57:48.989+0000","title":"Frankkaster amenaza de muerte en directo y nadie hace nada 👍","subforum":"Comportamiento del jugador","embed":{"description":null,"url":"https://video.twimg.com/ext_tw_video/911164911073550338/pu/vid/1280x720/tMDkSmoPdEobc_RJ.mp4","image":null},"up_votes":78,"down_votes":21,"body":"Bueno envié reporte a twitch con el link directo del clip pero mágicamente el creador del clip lo borró, yo antes de que lo borraran lo descargué para que hayan pruebas de que el tipo hace lo que quiere.\nSegún las normas de twitch:\n_Acoso Selectivo, Amenazas y Violencia contra los demás_\n_Se prohíben estrictamente el hostigamiento, la difamación, la_ _intimidación, el raideo con malas intenciones o el acoso hacia otras personas o_ _usuarios, incluidos el personal, los administradores y los moderadores globales de Twitch._\n\n_Las siguientes infracciones por acoso pertenecen a una política de tolerancia cero y_ _todas las cuentas asociadas a dicha actividad recibirán una suspensión por_ _tiempo indefinido inmediata:_\n_Intentar o amenazar con dañar o matar a otra persona_\n\nEste canal debería haber sido cerrado indefinidamente pero como todos sabemos en todos lados hay gente que aunque uno reporte y demás nadie le dirá nada, no hago esto para armar un foro bardo, lo hago para que sepan la clase de gente que es y que nadie le da una lección.\nEDITADO:\nAcá está todo lo que pasa: https://youtu.be/Mo0m9MxiTBo No creo que haya nada que explicar.\nDeben leer el chat desde el inicio del juego hasta que termina.","replies":[{"poster":"Jeez","date":"2017-09-22T11:40:01.404+0000","up_votes":24,"down_votes":4,"body":"Cuando vean el reporte, se llevará su correspondida sanción, aunque no es raro ver a ese tipo de gente haciéndose el payaso, no va a pasar desapercibido.\n\nBien por ser atento y guardar el clip.","replies":[]},{"poster":"bihkv","date":"2017-09-22T14:15:25.753+0000","up_votes":23,"down_votes":6,"body":"Se deberian banear a este tipo, como creador de contenidos tenes una responsabilidad cuando hablas, xenofobia e insulta a los otros players, pero bueno, mientras tengan a sus \"armys\" nada se puede hacer contra estos tipos","replies":[{"poster":"Facundo1299","date":"2017-09-22T16:56:16.335+0000","up_votes":4,"down_votes":2,"body":"Estoy de acuerdo con vos, véase el caso de Pew Dew Pie que por decir una sola palabra ofensiva ya se gano una portada en las paginas de noticias como xenofobia; pero mientras tanto estas personas flamean a diestra y siniestra y nadie porque sabe que vana a \"apelar y se van a comportar mejor\".\n\nSaludos\n{{champion:90}}","replies":[{"poster":"FedecarboneroUY","date":"2017-09-22T18:06:25.321+0000","up_votes":2,"down_votes":10,"body":"La cuestión es distinta, Pew Dew Pie hizo comentarios sobre algo que no se puede tocar, que son los judíos, te va a sonar a conspiración y espero yo algún día tener el tiempo posible para intentar informar a la gente sobre ese tema por más que haya mucha mente cerrada por ahí suelta, pero no podes comparar ambas situaciones porque son muy distintas.\n\n_\"“Para saber quien gobierna sobre ti, simplemente encuentra a quien no estas autorizado a criticar” — François Marie Arouet, más conocido como Voltaire\"_","replies":[{"poster":"bertox","date":"2017-09-22T19:50:23.748+0000","up_votes":5,"down_votes":0,"body":"***","replies":[{"poster":"FedecarboneroUY","date":"2017-09-22T20:12:32.196+0000","up_votes":4,"down_votes":0,"body":"https://k30.kn3.net/taringa/8/5/C/4/E/C/vagonettas/B0B.gif.cover?","replies":[]}]},{"poster":"Hnk Kenshiro","date":"2017-09-22T20:24:21.232+0000","up_votes":3,"down_votes":0,"body":"Espera, estas diciendo que los judíos tienen el poder?","replies":[]}]}]}]},{"poster":"Rebkans","date":"2017-09-22T13:27:44.866+0000","up_votes":19,"down_votes":5,"body":"Casi todo el video se la pasó diciendo \"eztoi enogado\", sumado a todo su circo de insultos, amenazas y golpecitos a la silla.\n\nTremendo payaso ridiculo y todo por un jueguito.\n","replies":[]},{"poster":"Fadamir","date":"2017-09-22T15:23:07.715+0000","up_votes":4,"down_votes":19,"body":"A mi me suspendieron la cuenta por publicar a un jugador que con comentarios antisemitas. Y me borraron el post enseguida..... esto lleva aca horas... que onda? \nHasta los moderadores en LAS son impresentables?","replies":[{"poster":"Oniroz","date":"2017-09-22T18:08:55.000+0000","up_votes":19,"down_votes":0,"body":"Hola. En caso de figuras públicas como streamers, youtubers, jugadores profesionales, etc. se permite usar nombres.","replies":[]},{"poster":"Mazer Rakham","date":"2017-09-22T15:37:51.245+0000","up_votes":7,"down_votes":2,"body":"Al ser streamer es un personaje público, así que no es lo mismo. El mismo pibe se pone en evidencia al subir los Videos. No es una persona cualquiera que juega una partida que solo presencia  él y el resto de jugadores de la partida, es una persona que comparte en directo sus partidas con muchas otras. Debería comportarse adecuadamente y dar el ejemplo.","replies":[{"poster":"Fadamir","date":"2017-09-22T15:42:25.096+0000","up_votes":6,"down_votes":12,"body":"Segun las reglas que me pasaron en el aviso de porque  la sansion... entraria este post tambien.  \nPero que esperar... si la proliferacion de ratas en el juego se debe a flata accion de los que moderan, controlan y/o sancionan.","replies":[{"poster":"Mazer Rakham","date":"2017-09-22T15:47:47.626+0000","up_votes":7,"down_votes":1,"body":"No, no es lo mismo. Una cosa es que, por ejemplo, yo suba capturas de pantalla, historial de partidas o videos de una partida privada con alguien tratando de lograr un castigo para esa persona. Otra cosa TOTALMENTE DIFERENTE, es que una persona que es \"medianamente conocida\" la cual se considera \"creadora de contenidos\" transmita EN DIRECTO su propio mal comportamiento. Te repito: un personaje público debe ser el ejemplo, no romper las reglas porque se le canta.","replies":[{"poster":"Fadamir","date":"2017-09-22T16:55:50.937+0000","up_votes":3,"down_votes":11,"body":"No lo creo asi, repito, segun el aviso que es este.\n\n_**\"Te recordamos que no puedes utilizar los nombres de otros jugadores con la intención de denunciar, reportar, acusarlos\" **_\nEsta parte ya la cumple, por loque dice NO se permite denuncias por foto, punto.\n\n_**\" o sin su permiso\" **_\nEl tema del permiso del jugador es de usar su nombre tiene  un \"o\"...  separa claramente lo que es denuncias y reportes, con hacer publico nombre de jugar sin consentimiento. Esto es lo que vos mecionas de que el es publico por hacer stream.\n\n_**\"Esto incluye colocar sus nombres en capturas de pantalla, textos, imágenes, videos o audios\"**_\nAca indica que no se puede subir contenido de ningun tipo sin el consentimiento, algo que concuerda con lo que decis ya que es streamer, pero dejo claramente especificado en las primeras lineas que las denuncias de ningun tipo se pueden hacer con nombre y apellido.\n\n_** \"Las denuncias no se permiten aquí porque generan discusiones y un mal ambiente en la comunidad. Si quieres exponer un caso en particular, puedes contactarte con soporte en el siguiente enlace: https://support.riotgames.com/hc/es-419 ¡Saludos!\"**_\nNuevamente aclara, LAS DENUNCIAS NO SE PERMITEN AQUI... \n\nEstamos de acuerdo? Una cosa es publicar contenido de una persona que ya se hace publica ella misma, y otra cosa son las denuncias con nombre y apellido, aun  utilizando el material que la persona denunciada hace publico. ESTO DICE CLARAMENTE QUE NO ESTA PERMITIDO...","replies":[{"poster":"Mazer Rakham","date":"2017-09-22T17:14:05.908+0000","up_votes":5,"down_votes":2,"body":"Deja, no voy a discutir con una pared. Se nota que no entendes la diferencia entre persona pública y normal.","replies":[{"poster":"akAiXx","date":"2017-09-22T17:24:30.633+0000","up_votes":5,"down_votes":2,"body":"es lo mejor man, no te calientes con alguien que apenas tiene 10 positivos totales, se nota que recién llego al foro y no conoce nada de los reglamentos.","replies":[{"poster":"Fadamir","date":"2017-09-22T17:31:41.716+0000","up_votes":5,"down_votes":13,"body":"Un simio entenderia la parte que dice que _**\"NO se permiten denuncias por este medio**__**\"**_.\nPero reitero... LAS\n\nY luego sale el otro que juzga por positivos de foro.. bieeeeen!!\nGracias a dios uso el foro para cosas puntuales, hay vida afuera man...","replies":[{"poster":"akAiXx","date":"2017-09-22T17:38:46.805+0000","up_votes":7,"down_votes":2,"body":"no estuviste para el caso de \"es dificil ser coscu\" que lo banearon por toxiquear y ser una persona publica, lo denunciaron y se aplico el reglamento.\n\nTanto orgullo tienes para no darle la razon a alguien hablando desde la ignorancia?","replies":[{"poster":"Fadamir","date":"2017-09-22T17:46:54.579+0000","up_votes":3,"down_votes":9,"body":"Ajam... que mas?","replies":[{"poster":"akAiXx","date":"2017-09-22T18:03:21.957+0000","up_votes":10,"down_votes":1,"body":"te quedaste sin argumentos ? lo imagine.\nsaludos!\n{{champion:121}}","replies":[]}]}]}]}]},{"poster":"MasterRightClick","date":"2017-09-22T19:57:07.401+0000","up_votes":2,"down_votes":2,"body":"No puedo creer que te hayas tomado el tiempo de responderle a este pibe. Y lo peor, sigue sin entender. Hay gente que cuando no le da, no le da. Ya fue","replies":[{"poster":"Fadamir","date":"2017-09-22T20:14:10.097+0000","up_votes":3,"down_votes":3,"body":"OH NAO!!\n\nEdit: Me ecanta ver como se dan esos puntitos con las flechitas,.. se ve que es imporante para ustedes jajaja","replies":[{"poster":"Fetgod","date":"2017-09-23T00:51:13.787+0000","up_votes":1,"down_votes":3,"body":"Tanto se van a quejar por que el tipo mantenga su opinion?","replies":[{"poster":"Fadamir","date":"2017-09-25T12:51:57.475+0000","up_votes":2,"down_votes":0,"body":"Yo estoy super entretenido, dejalos un ratito mas...\nEsto es como estar en pleno  partida con ratas llorando.\nY reitero, me meo de la risa con la obsesión con el sistema de puntuacion ese de flechitas...","replies":[{"poster":"Fetgod","date":"2017-09-26T02:45:57.081+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Fadamir,realm=LAS,application-id=PJAKt7ph,discussion-id=pNEuH0am,comment-id=000c000000000000000000000001000000000000,timestamp=2017-09-25T12:51:57.475+0000)\n>\n> Yo estoy super entretenido, dejalos un ratito mas...\n> Esto es como estar en pleno  partida con ratas llorando.\n> Y reitero, me meo de la risa con la obsesión con el sistema de puntuacion ese de flechitas...\n\nSi,la verdad no sirve de mucho y ahora veo que mi comentario corto se gano 2 negativos y nisiquiera se por que :v\nno es ofensivo ni nada,solo dije que esta bien que mantengas tu opinion firme.","replies":[]}]}]}]}]}]},{"poster":"Nuke","date":"2017-09-23T03:51:48.441+0000","up_votes":2,"down_votes":0,"body":"Vengo a decirte algo.\nTenés razón en todo lo que decís, pero las reglas \"Cambian segun la persona\". Si, una tontería. En fin, no hagas caso a nadie, es muy cierto que este post no debería poderse publicar. \nAsi son las \"reglas\" acá. Nadie las cumple, y no las aceptan aun cuando están textualmente escritas. Ni los moders las respetan.\n\n¡Saludos!","replies":[{"poster":"Fadamir","date":"2017-09-25T12:35:01.917+0000","up_votes":2,"down_votes":0,"body":"Despues de la segunda o tercer respuesta ya me los tome para la joda, porque veo que esto es mismo como el juego.\nSe lleno de ratas uno tras otro sin leer o entender,  la parte clarita que dice \"aqui no se permiten denuncias porque generan mal ambiente en la comunidad\".\nY es super gracioso como los vuelve locos el sistema ese de las puntuaciones con las flechitas.\n\nEs LAS.. ya me quedo claro, lo que encuentro en el juego es lo que voy a encontrar en todos lados, incluyendo MODs...","replies":[{"poster":"KroxuxZ","date":"2017-09-26T23:42:54.469+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Fadamir","date":"2017-09-27T17:36:07.313+0000","up_votes":1,"down_votes":0,"body":"Soy de \"los otros\"?? White Walker?? (GOT).\n\nAnda, lee las normas del foro... y por favor indicame donde dice eso.\nCreo que dice clarito que no se permiten denuncias en el foro, se ve que no leo la parte donde agrega la excepcion...** ahhh no, no esta esa parte**.\n\nPero si lo dice un MODD!!! que fue a la universidad de MODS y tiene su PHD en MOD, ya menz! palabra santa, no importa que no se base en las reglas que detalla la SECCION REGLAS DEL FORO.\n\nEn fin... el toxico soy yo OKEI MENZ!","replies":[{"poster":"KroxuxZ","date":"2017-09-28T01:20:34.233+0000","up_votes":0,"down_votes":2,"body":"***","replies":[{"poster":"Fadamir","date":"2017-10-02T11:52:40.886+0000","up_votes":2,"down_votes":0,"body":"Bla bla bla bla.. sarta de pelotudeces. \n\n**Denuncias / Reportes\nPara Riot las Denuncias/Reportes de jugadores son muy importantes, queremos brindarte la mejor experiencia en el juego y en los foros, por lo que pedimos tu ayuda enviándonos tu Denuncia / Reporte a través del equipo de soporte con el fin de poder darle un seguimiento adecuado al mismo.\n\nCualquier publicación de este tipo en los Foros será borrada.**\n\nSeguro no salis de tu casa, por eso tenes esos pensamientos, que el mundo funciona con reglas escritas en las nubes. \n\nBesito","replies":[]}]}]}]}]},{"poster":"KroxuxZ","date":"2017-09-23T04:00:52.857+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"Fetgod","date":"2017-09-26T21:54:42.337+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lady Honoka,realm=LAS,application-id=PJAKt7ph,discussion-id=pNEuH0am,comment-id=000c000000000000000000010000,timestamp=2017-09-23T04:00:52.857+0000)\n>\n> Cuando es una figura publica tiene que abstenerse de las consecuencias porque en si esta dando una mala imagen del juego y esta promoviendo una actitud sumamente toxica  y xenofobica ya sea para las reglas de plataforma Twitch youtube asociados a Riot Games que por cierto riot administra su marca y licencia digital a las plataformas dede videos y stream como las redes sociales a si bien este usuario esta usando la marca y licencia de riot en este caso League of Legends como parte de su contenido promoviendo Actitudes negativas y demasiadas racistas a traves del Mismo League of Legends (In Game ) y externamente en transmision en vivo y directo por lo cual tanto Twitch y Riot games le han sancionado ya que es una figura publica que representa a la comunidad de Lol y a la ves tiene muchas influencias de Masas como lo son Las Armys sus seguidores y gente de otras plataformas.\n\nSi y como dijo arriba genera mal ambiente en la comunidad,ademas tarde o temprano se dara cuenta Riot games y si no.se puede reportarlo mediante el soporte no?\nEs gracioso que al final el tipo se queje del otro cuando mostro las reglas textualmente.\nSeguramente los que le dieron negativos a Fadamir ni leyeron 2 parrafos de lo que escribio","replies":[{"poster":"KroxuxZ","date":"2017-09-26T22:04:17.008+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"Fetgod","date":"2017-09-26T22:53:11.620+0000","up_votes":2,"down_votes":0,"body":"Con todo esta discusion noto que el sistema de flechas no sirve de mucho\nosea cual es su funcion?","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"l Viper l","date":"2017-09-22T15:41:22.280+0000","up_votes":16,"down_votes":4,"body":"Supongo que RIot LAS hará lo mismo que hacen con los stremers así en estados unidos no ?\n\nSupongo que le daran ban a sus cuentas como a Tyler1 !!!\n\nDALEEEE RIOT LAS DALE LO QUE MERECE, pasan su juego para que estos hagan dinero insultado xD {{summoner:7}}","replies":[{"poster":"Mazer Rakham","date":"2017-09-22T15:52:36.440+0000","up_votes":9,"down_votes":2,"body":"No me sorprendería que lo banearan. De hecho, ya pasó con Coscu, que se creó otras cuentas, hizo videos pidiendo disculpas y volvía a hacer lo mismo... Y lo volvían a banear... Y volvía a hacer el  circo de disculpas... Y lo volvía a hacer... Y nuevamente lo banearon... Y así...","replies":[]},{"poster":"Morrígan","date":"2017-09-22T22:22:47.486+0000","up_votes":1,"down_votes":4,"body":"La situación es diferente. A RIOT no le importa lo que vos hagas en Twitch, a RIOT le importa lo que vos hagas en el game. El chabon, más allá de 1 o 2 palabras de insultos que fueron mutuos, no lo amenazó por el chat del LoL. El chabon lo amenazó por Twitch, a RIOT le chupa un huevo Twitch. Tyler1 era extremadamente tóxico EN game. Sin mencionar que hacía amenazas en game, feedea a propósito EN GAME. Y a Tyler1 le bannearon 24 cuentas antes de decirle que si lo detectan lo van a bannear automáticamente. RIOT solo se hace responsable de lo que pase en su game, no en las plataformas que lo streamean. Así que no, el loco no se lo merece. Se merece un ban en Twitch en todo caso.","replies":[{"poster":"KroxuxZ","date":"2017-09-22T22:54:20.198+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"Morrígan","date":"2017-09-22T23:24:09.573+0000","up_votes":1,"down_votes":2,"body":"Error de nuevo, mostrame un ejemplo claro y conciso en el que se haya sancionado a un jugador de LoL ÚNICAMENTE por ser tóxico en Twitch. Todos los jugadores que vos mencionas fueron tóxicos EN GAME. Coscu por ejemplo. Y como ya dije NI HABLAR DE TYLER1. Y los últimos bans de Tyler1, que se lo baneo aunque no estuviera insultando en game, fue porque RIOT banneo a Tyler1 no a sus acc. Tyler1 fue tan tóxico que determinaron que si lo vuelven a ver en el game y detectan que es él, lo van a bannear. No tiene nada que ver con su comportamiento en Twitch. Las sanciones que se han generado a jugadores de la LCS por actitudes antideportivas fuera del game, fue precisamente porque son jugadores de la LCS. Pero no tiene nada que ver con su stream. A un jugador de C9 lo multaron por hacer fuck you a otro jugador en una entrevista en vivo mientras C9 se preparaba para jugar. Pero eso es una transmisión en vivo de RIOT oficial. Es su canal. Los jugadores profesionales todo el tiempo putean en stream e insultan y jamás se los aplicó ninguna sanción por ello. Desde Imaqtpie (ex jugador profesional y el streamer de LoL más visto después de Faker) que no pasa un game sin decir \"OMG, what a f***king monkey.\" hasta Sneaky que en todos los games dice \"Holy sh*t, that guy gave me cancer. Kill yourself, duuuuude. Legit aids\", y eso que no mencionamos a Huni que cada vez que alguien de SKT stremea parece que están torturando a alguien de los gritos e insultos que pega. Y ni hablar cuando es Huni el que hace el stream. Hay incluso un meme referido que hay un calabozo de tortura en la gaming house de SKT y estamos hablando del Top Laner del equipo de LoL más famoso del mundo, no de un streamer X de LAS. \n\nRIOT no bannea ni implica sanciones, ni debería, por conductas que no se produzcan en el game. Cada streamer tiene su propia personalidad creada por el game y tiene su propio temperamento. No te agrada? Tenés la opción de no verlo, vos no tenés la opción de no jugar con alguien flammer, si te toca, te toca y punto. Promueve la toxicidad? Probablemente, como también los shooters promueven la violencia. Pero no vas a prohibir todos los shooters por el simple hecho de que habrá 1000 o 1300 personas influenciables. Osea, es su problema por ser influenciables. Si alguien se vuelve tóxico por ver un stream de este chabon, le cabrá la sanción que corresponde pero sigue sin ser culpa del chabon. No tenés ni RIOT puede pretender que seas un modelo a seguir desde el momento en el que prendés una cámara para jugar un videojuego. No sos propiedad de RIOT, Twitch no es propiedad de RIOT por más que colaboren y lo que hagas en Twitch no tiene por qué y de hecho no le interesa a RIOT. Punto final. Los streamers son únicamente personas a las que les gusta jugar el juego y tienen o una personalidad que entretiene o simplemente son muy buenos jugando. No le deben nada a RIOT que no le debas vos. Tienen que cumplir las mismas reglas que tenés que cumplir vos, ni más, ni menos. Punto. Y las reglas de RIOT aplican en el game de RIOT. Termina la partida, salis de la pantalla del final y listo, a RIOT no le importa lo que hagas. Es como que te bannearan porque puteaste a un chabon que tenías agregado como amigo. Y no en game, fuera de game. No tiene sentido, no quiere que lo putees, que te elimine. Pero no podes reportar eso, y tampoco podés reportar la actitud de un streamer en Twitch.","replies":[{"poster":"ZeNch","date":"2017-09-23T00:44:46.693+0000","up_votes":2,"down_votes":1,"body":"Riot como empresa puede quitarle el derecho de difusion del juego a cualquier jugador que comparta sus gameplays (hablados o no) sean show o no ya que contienen cosas que entran en los derechos de autor, pero como esto lleva tramites y tiempo, es mas facil banearle cada cuenta. El juego es gratis, su difusion esta permitida para streamers, pero sigue teniendo derechos de autor y los mismos pueden hacerse respetar **discriminatoriamente** con denuncias.","replies":[{"poster":"Morrígan","date":"2017-09-23T01:10:39.508+0000","up_votes":1,"down_votes":1,"body":"Poder, puede. Nadie discute que puede. Si vamos al caso, puede bannearnos a cualquiera de nosotros aunque directamente no nos hayan reportado ni hayamos tenido conductas contra las reglas. Son los dueños del juego, pueden hacer lo que quieran. Pueden decidir que a partir de mañana va a ser un juego pago y que si no lo pagamos nos eliminan la cuenta. Es su juego. Una cosa es que puedan. Otra cosa es que sea justo y otra cosa es que lo vayan a hacer. RIOT no lo hace. Y probablemente, nunca lo haga. Y este streamer, no va a ser la excepción.","replies":[{"poster":"ZeNch","date":"2017-09-25T00:39:13.706+0000","up_votes":3,"down_votes":0,"body":"-Riot no es solo dueño del juego si no de nuestras cuentas, cierto\n-Riot puede hacer lo que quiera, cierto\n-Riot puede hacerlo por medio legal ,me refiero a denuncia con derechos de autor, cierto (y su denuncia es valida). (Para mas info ver informacion de DMCA). Y no, no informacion de Demacia... DMCA.\n-A su vez puede pedir que se bloquee el contenido del autor (Referente al juego) directamente a las plataformas como Youtube/Twitch donde no se habre juicio alguno y por evitar problemas legales se sansiona automaticamente, rapidamente.\n-Riot hizo la denuncia a Twitch y recibio una penalizacion (creo que de 2 dias)... esta vez, no suelen dar muchas oportunidades, ejemplo: Youtube da 3 oportunidades si no goodbye.\n\nIgualmente yo siendo Riot mandaria a revisar el chat de sus ultimas 20 partidas (chat escrito) y a la minima ya banearlo... no permanente si no solo para que su cuenta este mas \"comprometida\" y a ver si se le refrescan las ideas.","replies":[]}]}]}]},{"poster":"l Viper l","date":"2017-09-22T23:13:11.405+0000","up_votes":3,"down_votes":1,"body":"Mejor explicado no puede estar, está muy clara la falta que hace, Riot \"presta\" su juego para contenido responsable, este usuario sólo hace mal uso con su juego, demostrando un comportamiento demasiado agresivo... Se sañta todas las reglas, sólo presenta una mala imagen para el juego y la comunidad. \n> [{quoted}](name=Lady Honoka,realm=LAS,application-id=PJAKt7ph,discussion-id=pNEuH0am,comment-id=000e00010000,timestamp=2017-09-22T22:54:20.198+0000)\n>\n> Aqui algo tienes mal ... claramente Riot pasa derechos de uso a las plataformas de streams para que estos generadores de contenido usen el juego pero aqui hay dos terminos de uso el de twitch y el de riot  por lo cual muchos se estan infringiendo \n> \n> 1- Por que este jugador esta usando vocabulario demasiado xenofobico y toxico por lo cual esta rompiendo   las reglas de Twitch y Riot Games ya que este ente es el prestador de su licencia a la compañia de twitch \n> 2- Al darle mala imagen al juego corrompe todo tipo de comunidad del Juego y da mala cara de manera general y externa del juego\n> 3- Se promociona el Flameo y toxicidad usando el contenido de Riot Games \n> 4- Riot Games esta en su derecho de  quitar sus licencias a cualquier empresa por mal uso de la marca o licencia digital\n> 5- Riot Games  tanto como Twitch puerde intervenir y sancionar al usuario   ya que explicitamente esta promoviendo mal uso del contenido y la vez promocionando una conducta  que rompe toda regla de la comunidad de convivencias tanto para comunidad de Twitch y Riot games en general\n> 6- Este jugador no es un santo tambien tienes partidas explicitas mostrando esta conductas  y las evidencias estan mas que claras si ves todo su canal y contenido expresando en el juego y en directo conductas demasiadas ofensivas para dejarlo pasar.\n> 7- Al ser un personaje publico que mueve las masas y a las famosas &quot;Army &quot;  debe abstenerse a las consecuencias de sus actos.\n> \n>  \n> Hay muchos casos de personajes publicos que son sancionados : Como coscu  ,Tyler1 \n> -Jugadores profesionales de la LCS Y CLS  por xenofobia y toxicidad en transmisiones en vivo  agravada con Multas en dinero hasta sanciones que pueden sacarte del competitivo por bastante tiempo\n> \n> {{sticker:poppy-wink}}\n\nMejor explicado no puede estar, está muy clara la falta que hace, Riot \"presta\" su juego para contenido responsable, este usuario sólo hace mal uso con su juego, demostrando un comportamiento demasiado agresivo... Se sañta todas las reglas, sólo presenta una mala imagen para el juego y la comunidad. {{champion:86}}","replies":[]}]}]}]},{"poster":"JuanchiR0j0","date":"2017-09-22T14:35:30.424+0000","up_votes":7,"down_votes":60,"body":"Vivi y deja vivir hermano, que carajo te molesta a vos que fran diga eso, como se nota la envidia eh,,","replies":[{"poster":"Vaendrys","date":"2017-09-22T14:56:36.950+0000","up_votes":28,"down_votes":1,"body":"Que argumento más mediocre.","replies":[{"poster":"Hyper Francis","date":"2017-09-22T17:02:21.626+0000","up_votes":4,"down_votes":1,"body":"x2","replies":[]}]}]},{"poster":"KroxuxZ","date":"2017-09-22T22:43:41.317+0000","up_votes":9,"down_votes":0,"body":"***","replies":[{"poster":"Detect Weakness","date":"2017-09-23T03:09:10.137+0000","up_votes":4,"down_votes":0,"body":"Recuerdo el caso de GrossGore, fué baneado de twitch simplemente por hacer comentarios \"fuera de lugar\"  de gente relacionada al lol en su stream. No es necesario escribirlo en el chat del juego para que riot tome cartas en el asunto, si ellos consideran que \"daña\" la imagen del juego, simplemente actuarán","replies":[]}]},{"poster":"SCG Earthcrusher","date":"2017-09-22T22:35:56.643+0000","up_votes":9,"down_votes":0,"body":"Que asco de tipo, deci que no sigo gente asi. Es re sensible el tipo y re inestable, como a la gente le puede gustar y reirse con este sujeto? \n mira como golpeaba la silla haciéndose el malo, pero que te pensas que sos? fracasado, venis a amenazar y a decir que \"hay me tilteo, estoy tilteado\" por favor. Si te tomaras las cosas con mas chiste y no seas tan enfermiso con otra gente sacando el ego que tenes mas views en tu stream capaz y solo capaz mas gente te miraría y te tendrían en mas consideración, pero por mi parte seguís siendo un fracasado dentro y fuera del lol.","replies":[]}]}