{"poster":"RAT IN GAME UwU ","date":"2015-10-11T18:37:00.836+0000","title":"Can new players not have silver mmr upon hitting 30","subforum":"Gameplay","up_votes":89,"down_votes":17,"body":"It takes as little as a few weeks for an eager new player with money to purchase exp boosts and hit level 30. The climb to level 30 is NOT practice for ranked, 16 champions are NOT enough to join ranked by any stretch of the imagination, having the minimum so that if everything you have is banned and picked you&#039;re left with at least one champion to choose is absolutely ridiculous. \r\n\r\nWhat this system says is, players who actually deserve bronze rank have to first get put into silver and then lose a minimum of 15-20 games IF THEY PLACED into SILVER V, add about 7-9 games per tier for every extra division they got placed into incorrectly. \r\n\r\nthis is anywhere from 180-300 players including all 9 other people in your game either losing LP or gaining it off of your lack of skill and completely improper placement, which in turn ensures that the ladder will never even be close to balanced. Silver/bronze are already bad enough as it is having almost the ENTIRE player base in it, can you PLEASE do something to balance how this system works so that it&#039;s  not a complete toss up and essentially luck based process unless you&#039;re smurfing.","replies":[{"poster":"Calliou","date":"2015-10-11T19:33:03.270+0000","up_votes":5,"down_votes":7,"body":"The problem with this is smurfs will have to waste a lot more time getting into their desired elo. Riot should just use other factors in provisionals besides win/loss to determine your rank.","replies":[{"poster":"PIMPSMOOTH","date":"2015-10-12T00:52:10.117+0000","up_votes":22,"down_votes":0,"body":"> [{quoted}](name=Calliou,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=0000,timestamp=2015-10-11T19:33:03.270+0000)\n>\n> The problem with this is smurfs will have to waste a lot more time getting into their desired elo.\n\nThat's not a problem, that's fantastic.","replies":[]},{"poster":"RAT IN GAME UwU ","date":"2015-10-11T22:30:36.873+0000","up_votes":15,"down_votes":0,"body":"> [{quoted}](name=Calliou,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=0000,timestamp=2015-10-11T19:33:03.270+0000)\n>\n> The problem with this is smurfs will have to waste a lot more time getting into their desired elo. Riot should just use other factors in provisionals besides win/loss to determine your rank.\n\nI'm sorry but are you under the impression that smurfs matter to riot? and lets say everyone started bronze, which isn't what i'm suggesting at all, i'm talking about people with normal to poor winrates, while leveling, even if they were put there, they'd be out of it incredibly fast, they'd skip divisions like crazy and be in gold/plat in 2 days of full time playing","replies":[]},{"poster":"Rikari","date":"2015-10-12T22:01:30.514+0000","up_votes":2,"down_votes":0,"body":"Last time i checked,smurfs start from bronze 5","replies":[]},{"poster":"Count Zubat","date":"2015-10-12T20:14:33.908+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Calliou,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=0000,timestamp=2015-10-11T19:33:03.270+0000)\n>\n> The problem with this is smurfs will have to waste a lot more time getting into their desired elo. Riot should just use other factors in provisionals besides win/loss to determine your rank.\n\nIf smurf is good enough, he will get to gold after placement matches,, I don't think it would be a problem. Also, you can always play some normal matches before placement ones while smurfing to increase your MMR.","replies":[{"poster":"Meanie40","date":"2015-10-12T20:54:55.132+0000","up_votes":1,"down_votes":0,"body":"Ranked MMR and Normals MMR are completely separate.","replies":[]}]},{"poster":"Salidfingers","date":"2015-10-11T19:53:41.788+0000","up_votes":2,"down_votes":4,"body":"I surfed bronze before, I got a triple being tower dived and it was from sunfire cape that got me the tags. I don't think it will be a issue.\n\nOh! I lived.","replies":[{"poster":"I urgot about it","date":"2015-10-13T02:10:11.778+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Salidfingers,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=00000000,timestamp=2015-10-11T19:53:41.788+0000)\n>\n> I surfed bronze before, I got a triple being tower dived and it was from sunfire cape that got me the tags. I don't think it will be a issue.\n> \n> Oh! I lived.\n\nThat isnt the point of this post","replies":[{"poster":"Salidfingers","date":"2015-10-14T00:50:25.576+0000","up_votes":1,"down_votes":0,"body":"What you mean it isn't the point. \n\nSmurfs wasting time when it will be vary easy to climb out. Dont know about you, but it shouldn't be an issue for smurf to climb out of bronze and waste much time. ","replies":[]}]}]}]},{"poster":"Stillname","date":"2015-10-12T02:56:03.321+0000","up_votes":4,"down_votes":0,"body":"The system uses some sort of hidden MMR behind the scenes and you HAVE to start in the \"middle\" of an MMR system because it is all relative to other players playing the game.\n\nIf you lower the starting point then over time that becomes the new middle.","replies":[{"poster":"RAT IN GAME UwU ","date":"2015-10-12T03:22:33.515+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Stillname,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=0008,timestamp=2015-10-12T02:56:03.321+0000)\n>\n> The system uses some sort of hidden MMR behind the scenes and you HAVE to start in the \"middle\" of an MMR system because it is all relative to other players playing the game.\n> \n> If you lower the starting point then over time that becomes the new middle.\n\nhave you ever gotten out of highschool and started as an area manager at a company? \n\nno.\n\nthe median being mailroom, or associate, or sales person is the norm, starting at the actual bottom here would make sense, otherwise you have to consider silver 3-4 the bottom and anything below considered being negative in the same way challenger is above the scope of the top, bronze would be the opposite of challenger except you can't fall out of it.","replies":[{"poster":"Stillname","date":"2015-10-12T04:10:25.256+0000","up_votes":9,"down_votes":0,"body":"If you created a completely new behind the scenes system you could make players start at the bottom. But with this one you cannot.\n\nI will try to explain this as best I can. If you start an average player at the bottom of an existing MMR ladder they will win games until they are up to the old average (silver 4ish) lowering the MMR of every player on the enemy team they face along the way.\n\nThe more average players that enter the system. The more you decrease the MMR of everyone they pass. It is even worse for players going higher.\n\nOnce you start lowering the MMR of players near the bottom people above them start to fall as well because the players that they are \"better than\" have a lower MMR. Slowly (and I meany very slowly due to the number of players already in the system) the average MMR becomes S 5 then B1 and so on until it is B5 or wherever you started your players and there becomes a pit of people below them in \"B5\" but with much lower MMR to the point where they have to win 30 or more games in a row to get out.\n\nI am sorry if I am not explaining this well enough but in order to go to a system where a player starts at the bottom you have to rebuild the whole system and start everyone over from scratch at B5 which would be chaos for the first month or more till things got more sorted out.","replies":[{"poster":"okino","date":"2015-10-12T16:24:52.325+0000","up_votes":1,"down_votes":0,"body":"That sounds like hell   щ(ಥДಥщ)","replies":[]}]}]}]},{"poster":"Uiraya","date":"2015-10-12T00:55:01.703+0000","up_votes":5,"down_votes":2,"body":"I'm not sure that starting everybody EVERYBODY at Bronze V 0 LP would be the worst thing ever.\n\n I know I'd wait six weeks for all the diamond mains to be gone and then enjoy the journey :D \n\n If your argument involves smurfs, kindly go fuck your smurf and go fuck yourself. Smurfing is something Riot needs to address and you're an asshole for doing it. You (yes, you) are the source of most of the toxicity in this game. If you \"just want to play\" there are many other modes for you that don't involve artificially inflating/suppressing other players. You're a shitbird when you're on my team and you're a shitbird when you're on the enemy team. Stop it.","replies":[{"poster":"JustJayson","date":"2015-10-12T01:27:14.355+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Uiraya,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=0005,timestamp=2015-10-12T00:55:01.703+0000)\n>\n> I'm not sure that starting everybody EVERYBODY at Bronze V 0 LP would be the worst thing ever.\n> \n>  I know I'd wait six weeks for all the diamond mains to be gone and then enjoy the journey :D \n> \n>  If your argument involves smurfs, kindly go fuck your smurf and go fuck yourself. Smurfing is something Riot needs to address and you're an asshole for doing it. You (yes, you) are the source of most of the toxicity in this game. If you \"just want to play\" there are many other modes for you that don't involve artificially inflating/suppressing other players. You're a shitbird when you're on my team and you're a shitbird when you're on the enemy team. Stop it.\n\nI have 2 smurf accounts. Originaly I put in the work so I could play with friends who were new to the game as I couldn't play games with them because of tier difference. Honestly tho your smurf catches up to your main in no time in ranking. Even several pros have multiple accounts in challenger. I don't see the issue with that, the journey of climbing the tiers again  is a bit fun until you land where you were meant to be.","replies":[{"poster":"Uiraya","date":"2015-10-12T03:28:50.830+0000","up_votes":4,"down_votes":0,"body":"And you fuck up everyone else's game on the way.\n\n Smurf all you like in normals.","replies":[{"poster":"Daen","date":"2015-10-12T22:43:55.763+0000","up_votes":1,"down_votes":0,"body":"If we're actually connecting this to the OP, OP's suggestion would make this *worse* than it currently is.  If pro smurfs started at Bronze V instead of the current mid-silver-ish rating, they'd be running through an extra 5+ Divisions ruining those games as well.","replies":[]}]},{"poster":"3tyson","date":"2015-10-12T14:44:50.386+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cocolow,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=00050000,timestamp=2015-10-12T01:27:14.355+0000)\n>\n> I have 2 smurf accounts. Originaly I put in the work so I could play with friends who were new to the game as I couldn't play games with them because of tier difference. Honestly tho your smurf catches up to your main in no time in ranking. Even several pros have multiple accounts in challenger. I don't see the issue with that, the journey of climbing the tiers again  is a bit fun until you land where you were meant to be.\n\ni never really belived this shit\n\nim silver 4 right now i think ive had silver 3 playing ranked quited because tilted with afks/trolls and bad team mates ( not a pro myself but its frustrating when your team clearly esily got a game and they trow by acing and backing not getting single objectives ) \n\n\ni have around 740 wins and i do bad i do good w/e felt like i was a really bad player a bit sometimes until a friend i played with when i started this game with 60 or so wins invited me\nand i got to play against people his level \n\nminion argo does not exist what so ever in his game and i could carry him ezz \nwhere if i played normal games alone i stil not so good","replies":[]}]},{"poster":"KaisadiIIa","date":"2015-10-12T18:35:18.943+0000","up_votes":2,"down_votes":0,"body":"DISCLAIMER: Random rant abour smurfs.\n\nEverybody has to do whatever \"pros\" do and so everybody has now a smurf. Most of my friendlist are Silvers and most of them have, at least, one smurf. WHY THE HELL DO YOU HAVE A SMURF FROM SILVER? WHAT IS IT EVEN FOR? I mean I'm Gold (nothing special but :/ ) and I've never needed nor wanted a smurf. Why would I play on a smurf? To earn IP that I could've earned in my main account? As with everything, most people probably have a smurf just because other people has it.\n\n/end of the rant.","replies":[]},{"poster":"KingWanahakalugi","date":"2015-10-12T16:41:56.242+0000","up_votes":1,"down_votes":0,"body":"Some smurfs are toxic, yes. You might even say most smurfs are toxic. However, I don't see an issue with players having smurfs to play with their low level friends. Especially if they remain positive or don't speak at all. I've seen people play with smurfs that are constantly talking to players on both teams giving them pointers for the early levels. Teaching them how to build, fight, and what objectives are the most important to take. In fact, I believe a supportive smurf is the best way to develop a low level jungler because the jungle role and the jungle itself are two of the most complex areas of the game, and having a player with the experience to describe the position is the best way for a player to learn.\n\nTL;DR Positive, helpful smurfs are a great addition to the game. Toxic smurfs are the only issue IMO.","replies":[]}]},{"poster":"Wallaroo0226","date":"2015-10-12T03:23:45.647+0000","up_votes":3,"down_votes":0,"body":"I agree with the OP.  This is a huge problem.  I went on a losing streak not too long ago because of AFK's, followed by the worst ADC I have ever played with.  They had no ranked history last season, 50 cs 30 minutes in, and a win rate of 25%.  Said ADC was Silver 5...","replies":[]},{"poster":"JustJayson","date":"2015-10-12T01:22:08.354+0000","up_votes":2,"down_votes":0,"body":"The chances of getting an actual new player on your team is slim. From last season to this one they tweaked it also I believe because tons of people were gold5 with silver4 mmr because you can't actually drop tiers. My smurf landed in silver 3 about a month back. Not a big deal. I've seen several people spam tf, Lucian or ryze and get to platinum in 40 games or less using a  single champ and no runes. If there is a new or weak player on your team in silver and bronze it's easy to carry them if your skill is better than your opponent.","replies":[{"poster":"RAT IN GAME UwU ","date":"2015-10-12T01:56:02.364+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Cocolow,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=0006,timestamp=2015-10-12T01:22:08.354+0000)\n>\n> The chances of getting an actual new player on your team is slim. From last season to this one they tweaked it also I believe because tons of people were gold5 with silver4 mmr because you can't actually drop tiers. My smurf landed in silver 3 about a month back. Not a big deal. I've seen several people spam tf, Lucian or ryze and get to platinum in 40 games or less using a  single champ and no runes. If there is a new or weak player on your team in silver and bronze it's easy to carry them if your skill is better than your opponent.\n\nI guess there's not really a difference between a new player and someone who sucks and is unranked then, because i'm constantly on my silver accounts getting unranked players first timing a champ in ranked and have never even played 10 games, it's not rare at all for me. every new account I level up ends up around 1200-1300 mmr with an average 6/4 w/l in provisionals and I always get high silver or low gold and then make my way up to high gold to low plat. now imagine i went 3/7 this puts me at silver 4-5 if i just spammed yi leveling up or chogath or other easy to win champs, but then you get into ranked and you have people that've been playing for years against you in high silver to low gold, because let's be honest almost no one ever leaves those ranks without taking the game seriously.","replies":[]}]},{"poster":"SlashStriker","date":"2015-10-11T21:57:24.139+0000","up_votes":2,"down_votes":4,"body":"if you win 9 out of 10 games you can hit platinum\nits all based on your own performance in placement matches\n\nwhat you guys suggest is put diamond players among bronze players\nyou think thats fair?","replies":[{"poster":"RAT IN GAME UwU ","date":"2015-10-11T22:28:29.501+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=SlashStriker,realm=EUW,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=0002,timestamp=2015-10-11T21:57:24.139+0000)\n>\n> if you win 9 out of 10 games you can hit platinum\n> its all based on your own performance in placement matches\n> \n> what you guys suggest is put diamond players among bronze players\n> you think thats fair?\n\nthere's more to it than that you only get p5 if you win almost every single game while leveling and then get 9-10/10 \n\nI want people who spammed one champion the whole way up with crap winrates to start in bronze, not people who are clearly on smurfs. Call me crazy but I think in 2015 we should be able to look at data and react appropriately.","replies":[]}]},{"poster":"Adrian Umbra","date":"2015-10-12T14:54:07.321+0000","up_votes":2,"down_votes":0,"body":"And for players who are above average and those who play a bunch of normals once they reach 30 without touching ranked?  Why should they have to climb through Bronze when they're already playing at a Silver or Gold level?  Sure, this system would sort players who belong in Bronze more quickly, but it would also screw over anyone who's better than that.\n\nBesides, see Stillname's thorough explanation as to why this is a bad idea.  You make new players start in B5, B5 will become your new average.  And nobody wants that, simply for organizational reasons.","replies":[]},{"poster":"Ternt","date":"2015-10-12T13:36:30.556+0000","up_votes":2,"down_votes":0,"body":"I think it needs to change as well, mainly because towards the end of the season it makes it much much harder to get into Gold. I started in Bronze 3 this season, and as my first season I understood why I placed where I did, so I worked my way out into Silver. As I started working my way through Silver throughout the season, I hit Silver 1 over a month ago. As soon as I hit Silver 1, I continually got fresh 30's who only had 10~20 games played. I distinctly remember one game where I had a Tristana versus an enemy Vayne and managed to get 35 CS in 20 minutes and was 0/9 before our tier 1 fell. I'm not saying I would win every game otherwise, but realistically, it screws over people who have worked all season to get into Gold because these people just do not understand the game fully yet. I did a lot of reading, asked a lot of questions and watched a lot of video to move from Bronze into Silver during the course of this season. I do not feel that people should be handed what I had to learn and earn, because it makes all the effort feel like it was in vain. Why did I work harder to get better and understand importance of small things like warding or CSing properly to move up when I am still getting people who should be in Bronze? I'm not the greatest, nor am I perfect at warding, CSing, etc, but I know more than somebody who just hit level 30. Since this was my first season playing the game, I can remember exactly what level of knowledge about the game I had when I hit 30 as well. \n\nI placed into Silver 2 last December before the reset happened, and bouncing between Silver 3 and Silver 2 now, I know that I am lightyears better at the game now and can sustain my rank opposed to a year ago. It's unfair to put us in the same division because the level of knowledge is not the same. People do have raw talent in this game, as I felt I did fairly well at this game when I first started playing it. But the drawback to raw talent is that it does not get you very far in a game like League. There's so many contributing factors that go into consistent play. For one, at a fresh level 30, I assume that you still have not seen what every champion does or can do. You don't know all the skills the champions have, or exactly how they even work. I know that at a year of playing, I STILL don't know every champions kit perfectly. I find myself getting killed by an off meta pick because I do not see them every other game or haven't played them myself. Without spending real money, there is truly no way for you to obtain more than 25 champions before hitting level 30 (depending on the price), and that is without buying runes. Most meta champions are fairly expensive still (4800-6300), which means that if you want to also buy runes, you are gimping yourself with the champion pool you can play or own at level 30. Any fresh level 30 should be automatically placed into a Bronze division so the smurfs can burn through Bronze but the new players will have to learn to get out.","replies":[{"poster":"Kitten of Evil","date":"2015-10-13T16:33:25.915+0000","up_votes":1,"down_votes":0,"body":"Silver 1 is hell. I can vouch for this. I've had worse and more toxic players in Silver 1 than I did the entire time climbing from Silver 5 to Silver 1 (which was a total breeze).","replies":[]}]},{"poster":"Social Justice 1","date":"2015-10-11T20:10:30.370+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DW iRek,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=,timestamp=2015-10-11T18:37:00.836+0000)\n>\n> What this system says is, players who actually deserve bronze rank have to first get put into silver and then lose a minimum of 15-20 games IF THEY PLACED into SILVER V, add about 7-9 games per tier for every extra division they got placed into incorrectly. \n\n\nWhats wrong with that","replies":[{"poster":"RAT IN GAME UwU ","date":"2015-10-11T22:29:18.748+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Social Justice 1,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=0001,timestamp=2015-10-11T20:10:30.370+0000)\n>\n> Whats wrong with that\n\nwhy not just place players correctly? why make others have to carry them or lose games with them before they personally get placed where they belong?","replies":[{"poster":"Hellioning","date":"2015-10-12T04:04:49.989+0000","up_votes":3,"down_votes":1,"body":"That's what placements are for, though? Placing people correctly.","replies":[{"poster":"Cynika","date":"2015-10-12T10:00:05.418+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Hellioning,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=000100000000,timestamp=2015-10-12T04:04:49.989+0000)\n>\n> That's what placements are for, though? Placing people correctly.\n\nThe problem is they screw up other people's games until they get \"placed correctly\"","replies":[{"poster":"Hellioning","date":"2015-10-12T17:42:04.398+0000","up_votes":1,"down_votes":0,"body":"But if they, for example, get placed in bronze V and have to work their way up, they would also ruin those bronze V games, by completely stomping if they belong in anything higher then Bronze V.","replies":[{"poster":"Cynika","date":"2015-10-12T20:49:37.189+0000","up_votes":1,"down_votes":0,"body":"I'm not saying everyone should be put into bronze V directly. But if they were, people in bronze V in general are having a rough time understanding the game to begin with. The occasional stomp there isn't too out of the blue for them. It's just my opinion, but I think it's more fair having a skilled player start low than an unskilled person starting higher.","replies":[{"poster":"Hellioning","date":"2015-10-12T21:10:51.134+0000","up_votes":1,"down_votes":0,"body":"Or, in other words, 'I don't care about the lowbies, just don't have them in MY games.'\n\nIf someone is smurfing, the last thing we want to do is put them in a rank where they are guaranteed a bunch of wins. That'd just encourage it.","replies":[{"poster":"Cynika","date":"2015-10-12T21:25:53.229+0000","up_votes":1,"down_votes":0,"body":"But a fresh 30 in general is a lowbie, why should they start off higher and just lose a lot until they are where they are supposed to be? Also isn't it incredibly disheartening losing game after game after game since placements start you too high as a base? A lot of my friends hate ranked because of that.\n\nAnd smurfs are always going to be a toxic hard to balance thing. Until riot actually decides to address it I don't see how any system can or should be balanced around it, imo","replies":[{"poster":"Hellioning","date":"2015-10-12T22:15:42.438+0000","up_votes":1,"down_votes":0,"body":"Maybe they're not a fresh 30, though. Maybe they're a person who didn't want to get into ranked for whatever reason until now, but they've spent the last year or so playing normals. Is it really fair to put him in Bronze V?\n\nIt's INCREDIBLY disheartening to lose game after game. But if said aforementioned experienced player started at Bronze V, the people who would be disheartened would be the people playing against them.","replies":[{"poster":"RAT IN GAME UwU ","date":"2015-10-13T22:10:25.531+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hellioning,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=000100000000000100000000000000000000,timestamp=2015-10-12T22:15:42.438+0000)\n>\n> Maybe they're not a fresh 30, though. Maybe they're a person who didn't want to get into ranked for whatever reason until now, but they've spent the last year or so playing normals. Is it really fair to put him in Bronze V?\n> \n> It's INCREDIBLY disheartening to lose game after game. But if said aforementioned experienced player started at Bronze V, the people who would be disheartened would be the people playing against them.\n\nnone of what you're saying has anything to do with what i'm saying, if they've built up mmr and practiced in normals they can be placed where they belong, i'm talking about people who've played for less than a month hitting 30 and going straight to mid silver where certain people end up being for years.","replies":[{"poster":"Hellioning","date":"2015-10-13T22:45:56.405+0000","up_votes":1,"down_votes":0,"body":"How do you tell the difference, though? Just by games played?","replies":[]}]},{"poster":"Cynika","date":"2015-10-12T22:24:42.803+0000","up_votes":1,"down_votes":0,"body":"Again I'm not the person who said bronze 5. I just don't think they should start mid silver.","replies":[{"poster":"Hellioning","date":"2015-10-12T22:27:12.549+0000","up_votes":1,"down_votes":0,"body":"Why not? Mid Silver is where the majority of players are at. Moving from mid silver, in either direction, is making the system less accurate.","replies":[{"poster":"Cynika","date":"2015-10-12T22:53:13.094+0000","up_votes":1,"down_votes":0,"body":"I disagree, but that's why opinions are opinions. I doubt riot will do anything about it anyway.","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"SaltyToplaneGoat","date":"2015-10-11T23:33:54.265+0000","up_votes":3,"down_votes":1,"body":"If you start ranked you starts at the very bottom and then you work your way up. That's how it's supposed to be. New players should be put in bronze unless they have a truly spectacular number of normal gamesplayed  and an amazing MMR.","replies":[]},{"poster":"Slamurai Jack","date":"2015-10-13T12:36:39.104+0000","up_votes":1,"down_votes":0,"body":"I think starting fresh lvl 30's in low silver is pretty reasonable because that's around the skill level most fresh lvl 30's are at. I got placed in Silver 4 when I first hit lvl 30 and never went any lower than that; you need to have not learned much to play at a bronze level after the hundreds of games it takes to get lvl 30. There's a reason that the largest tier by far is silver.","replies":[{"poster":"RAT IN GAME UwU ","date":"2015-10-13T20:08:04.171+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Slamurai Jack,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=0015,timestamp=2015-10-13T12:36:39.104+0000)\n>\n> I think starting fresh lvl 30's in low silver is pretty reasonable because that's around the skill level most fresh lvl 30's are at. I got placed in Silver 4 when I first hit lvl 30 and never went any lower than that; you need to have not learned much to play at a bronze level after the hundreds of games it takes to get lvl 30. There's a reason that the largest tier by far is silver.\n\nthat is SO untrue, any brand new actual 30 plays at the skill level of bronze 5 with no questions asked. trust me on this.","replies":[{"poster":"Slamurai Jack","date":"2015-10-13T20:18:20.015+0000","up_votes":1,"down_votes":0,"body":"Have you ever actually seen a legit Bronze 5 player? They legitimately have no idea what they're doing at any stage of the game. Their game knowledge is terrible and their mechanics are also terrible; having 30 CS at 10 minutes on a solo lane is rather common at that level.","replies":[{"poster":"RAT IN GAME UwU ","date":"2015-10-13T22:07:18.361+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Slamurai Jack,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=001500000000,timestamp=2015-10-13T20:18:20.015+0000)\n>\n> Have you ever actually seen a legit Bronze 5 player? They legitimately have no idea what they're doing at any stage of the game. Their game knowledge is terrible and their mechanics are also terrible; having 30 CS at 10 minutes on a solo lane is rather common at that level.\n\nyes, and this is what players who just hit 30 play like when they've never played a moba before","replies":[{"poster":"Mathbalnase","date":"2015-10-13T22:19:33.394+0000","up_votes":1,"down_votes":0,"body":"Not all players who just hit 30 have never played a moba before...","replies":[{"poster":"RAT IN GAME UwU ","date":"2015-10-13T22:49:09.995+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mathbalnase,realm=NA,application-id=3ErqAdtq,discussion-id=78fMwpOf,comment-id=00150000000000000001,timestamp=2015-10-13T22:19:33.394+0000)\n>\n> Not all players who just hit 30 have never played a moba before...\n\nI agree dot dot dot","replies":[]}]},{"poster":"Slamurai Jack","date":"2015-10-13T22:16:15.889+0000","up_votes":1,"down_votes":0,"body":"That's not how I played when I first hit 30, and I had never played a Moba before. I actually climbed to silver 2 within a week of starting ranked, and while that's definitely better than average, it's still not that abnormal. You don't have to be good to be silver, you just need to not be terrible. Hell, 24% of ranked players are Gold and only 22% are Bronze; you have to be pretty damn bad to be in Bronze for any extended period of time.","replies":[]}]}]}]}]}]}