{"poster":"PorcuDeMacchia","date":"2018-02-09T01:09:39.276+0000","title":"Mettere in rotazione le Dominion","subforum":"Discussioni generali","up_votes":9,"down_votes":1,"body":"Sono circa 2 anni che la dominion non esiste pi&ugrave; e come giocatore sto sinceramente provando noia e sconforto dal poter giocare solamente 5v5 o le solite ARAM dove si passa pi&ugrave; tempo a cercare una partita a causa dei leavers per non parlare dei pick che tutto sembrano tranne che random. Nelle rotation le uniche divertenti sono state le doombots e l&#039;overcharge le altre fanno acqua da tutte le parti. La domanda &egrave;, perch&egrave; non portare le dominion almeno in rotation? in questo modo &egrave; possibile eliminare il problema dei bots per leveling ( e da giocatore con circa 2000 game in dominion non ne ho mai incontrati) e portare una ventata di aria fresca per chi non ha avuto modo di provarla e per noi che gi&agrave; la conoscevamo, poter passare 20 minuti di puro divertimento e TF con emozionanti rimonte 0-1 punti {{sticker:sg-zephyr}}.","replies":[{"poster":"Orgazmico","date":"2018-02-09T15:26:42.478+0000","up_votes":2,"down_votes":0,"body":"giusto l'altro ieri ho visto il video promo per il rilascio della dominion!nostalgia!","replies":[{"poster":"PorcuDeMacchia","date":"2018-02-10T00:47:46.762+0000","up_votes":1,"down_votes":0,"body":"Ma quanto era bello iniziare 4 top 1 bot e dopo 3 minuti finiva a rissa XD","replies":[{"poster":"Orgazmico","date":"2018-02-10T15:58:08.088+0000","up_votes":1,"down_votes":0,"body":"era pura ignoranza quella modalità, avevo più partite li che in normal forse! peccato davvero!","replies":[]}]}]},{"poster":"wattbatt","date":"2018-02-09T10:09:31.690+0000","up_votes":2,"down_votes":2,"body":"Domanda stupida; perché invece ci sono dei periodi senza modalità speciali? Non potrebbero semplicemente fare un calendario fisso che sanno tutti delle modalità e che continua a ripetersi senza pause?","replies":[{"poster":"PorcuDeMacchia","date":"2018-02-10T00:46:14.342+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=wattbatt,realm=EUW,application-id=MJVj50Jw,discussion-id=Jk6Xxf4y,comment-id=0000,timestamp=2018-02-09T10:09:31.690+0000)\n>\n> Domanda stupida; perché invece ci sono dei periodi senza modalità speciali? Non potrebbero semplicemente fare un calendario fisso che sanno tutti delle modalità e che continua a ripetersi senza pause?\n\nPer dire che la domanda fosse stupida o meno, almeno hai mai giocato Dominion? La risposta da te data non risponde nemmeno al quesito da me posto, comunque chi giocava questa mod ci passava diverse ore, non stressanti, e quindi tra la community vecchia e quella nuova non ci sarebbe nemmeno il problema della queue.","replies":[{"poster":"wattbatt","date":"2018-02-11T12:37:28.876+0000","up_votes":1,"down_votes":0,"body":"ammetto che la domanda va ot ma è legale farlo eh non è che sono obbligato a scrivere sotto un post esclusivamente per rispondere al post","replies":[]}]},{"poster":"IlMarro","date":"2018-02-09T10:42:53.933+0000","up_votes":1,"down_votes":0,"body":"Perché di solito organizzano anche missioni speciali per il determinato evento. Per il resto aiuterebbe sicuramente a staccare dal solito clima tossico delle 5vs5 classiche.","replies":[{"poster":"PorcuDeMacchia","date":"2018-02-10T00:51:44.220+0000","up_votes":1,"down_votes":0,"body":"Nel periodo dell'evento è normale che mettano la mod ad esso collegata ma nella rotation mensile, spendendo il minimo delle risorse, potrebbero farla tornare come anche la vecchia 3v3 molto migliore e competitive della nuova ;)","replies":[]}]},{"poster":"Jaaaames","date":"2018-02-09T14:11:31.779+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=wattbatt,realm=EUW,application-id=MJVj50Jw,discussion-id=Jk6Xxf4y,comment-id=0000,timestamp=2018-02-09T10:09:31.690+0000)\n>\n> Domanda stupida; perché invece ci sono dei periodi senza modalità speciali? Non potrebbero semplicemente fare un calendario fisso che sanno tutti delle modalità e che continua a ripetersi senza pause?\n\nQueue time","replies":[]}]}]}