{"poster":"Warlord Rhinark","date":"2018-06-24T18:57:58.105+0000","title":"Boards Terminology?","subforum":"General Discussion","up_votes":5,"down_votes":0,"body":"Greetings fellow Internet surfers.\n\nI&#039;m planning on introducing my friends to the League of Legends boards, so I thought I&#039;d gather together a comprehensive list of acronyms, phrases and sentences that they&#039;ll most likely stumble upon.\n\nSo far, I have this:\n\n#Acronyms:\n\n\"AFAIK\" = As Far As I Know.\n\n&quot;Ftfy&quot; = Fixed That For You.\n\n&quot;IIRC&quot; = If I Recall Correctly.\n\n&quot;OP&quot; = Original Poster/Overpowered\n\n\"UP\" = Underpowered.\n\n&quot;OTP&quot; = One Trick Pony/One True Pair.\n\nM1/2/3/4/5/6/7 = Mastery levels.\n\nB/S/G/P/D1/2/3/4/5 = Divisions.\n\n#Excuses:\n\n&quot;You&#039;re bronze&quot; =  Situational definition. Has two definitions depending on the argument:\n\nA. You came up with a really valid argument, but I still want to disagree with you so I&#039;ll use your rank as some form of argument against you.\n\nB. You clearly have a lack of game knowledge and your rank shows it.\n\nFrom my experience, the former occurs much more frequently than the latter.\n\n&quot;I was joking&quot; = I completely meant what I said but I won&#039;t take responsibility for having said something stupid and you&#039;re dumb for not knowing.\n\n\"But he started it first!\" = I was just as big of a problem as he was, but he did his thing chronologically before I did my thing and that justifies my actions.\n\nHowever, I&#039;m pretty sure that there are more that I&#039;ve just never stumbled upon.\n\nSo I&#039;d like to ask you guys what I can add to my list.\n\nCredit will be given, so long as it doesn't count as Naming & Shaming for... Whatever reason.\n\nThanks in advance.\n\nCredit to Król Wilk Sam for suggesting \"Overpowered\" and \"Underpowered\".\n\nCredit to ZiLess for suggesting \"But he started it!\" and for suggesting \"You're Bronze\" is situational.\n\nEdit: Stumbled upon a new one myself, \"AFAIK\".","replies":[]}