{"poster":"Harvest","date":"2015-09-01T09:56:37.186+0000","title":"lolPLAYER - Terenas, video tributo per valorizzare anche i nostri Streamer Italiani!","subforum":"Creazioni della community","embed":{"description":"Questo Video NON è monetizzato- Questo è il primo video della serie lolPLAYER, che si baserà su montaggi riguardo gli Streamer/Youtuber Italiani di League of Legends più conosciuti, per valorizzarli. Il primo è Terenas che ci ha regalato e continua a farlo, momenti divertenti.","url":"https://www.youtube.com/watch?v=z-JSt_aVtDQ","image":"https://i.ytimg.com/vi/z-JSt_aVtDQ/hqdefault.jpg"},"up_votes":5,"down_votes":6,"body":"Ciao a tutti!\n\nEcco a voi un piccolo video su Terenas, un noto Streamer/Youtuber di League of Legends.\n\nQuesta serie &egrave; incentrata su i nostri connazionali che creano contenuti riguardanti League of Legends, il primo per ovvie ragioni &egrave; stato Terenas!\n\nSpero che questo video possa piacervi, come al solito vi invito ad Iscrivervi al Canale e lasciare un Mi Piace.","replies":[{"poster":"MasterKeaton98","date":"2015-09-01T10:36:37.556+0000","up_votes":2,"down_votes":1,"body":"Sinceramente non capisco perchè certa gente lo odi.\n\nA me sta simpatico, e si vede che quello che fà lo fà con passione.\n\nA me piace molto.","replies":[{"poster":"Mar15ste","date":"2015-09-01T11:07:28.247+0000","up_votes":5,"down_votes":0,"body":"Non \"odio\" Terenas tuttavia non lo apprezzo, principalmente perché finge troppo e finge male, inoltre alle volte con i suoi toni di voce sballatissimi (passa da suoni altissimi a gravi nella stessa frase) arriva ad essere anche fastidioso, non nego che qualche volta sa essere simpatico ma comunque non abbastanza da poter compensare quelle volte in cui risulta più irritante che altro, infine la maggior parte della sua fan base è molto infantile... ma di questo lui non ne ha colpa.","replies":[{"poster":"SKFF1R SubZero","date":"2015-09-01T12:25:54.056+0000","up_votes":1,"down_votes":0,"body":"Ci aggiungo solo una cosa: quei continui mezzi punti interrogativi alla fine del 70% delle frasi sono irritanti, specie se uniti agli sbalzi di voce di cui si parla sopra :)","replies":[]}]}]},{"poster":"Giorgio di villa","date":"2015-09-01T10:07:07.340+0000","up_votes":1,"down_votes":0,"body":"A \"la mia umile magione\" sono caduto a terra dal ridere \nGG WP\nÈ stato proprio grazie a terenas se ora so usare Jax decentemente peccato che ora Jax non possa più stare in questa lega di tanto che fa schifo","replies":[]},{"poster":"A Yordle ln Heat","date":"2015-09-01T10:34:14.080+0000","up_votes":1,"down_votes":1,"body":"Quindi era Teneras quello che gridava \"CHECOSSSAAAA\".\nBuono a sapersi.","replies":[]}]}