{"poster":"Spectοr","date":"2017-01-21T22:17:22.957+0000","title":"Urgot Verbesserungsvorschlag","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Da ich Urgot gerne spiele, er aber ziemlich problematisch ist, habe ich mir ein paar Verbesserungen &uuml;berlegt.\r\n\r\nMan k&ouml;nnte seine Passive F&auml;higkeit durch einen Treffereffekt (wie z.B. Braums Passive) ersetzen, welche den Effekt der E, also der Noxianischen &Auml;tzladung hat. Also nach 3-4 Treffern mit Angriffen erh&ouml;ht sich die Reichweite der Q, also dem S&auml;urej&auml;ger, wie bei einem Treffer mit der E. Somit k&ouml;nnte man die E durch etwas ersetzen was besser zu Urgots R, also dem Hyperkinetischen Positionsumkehrer passt, vielleicht so etwas wie einen Stun oder ein Festhalten des Feindes. \r\nUrgots R sollte auch ein paar wenige Einheiten mehr Reichweiten bekommen und er sollte f&auml;hig sein mit einem Teampartner den Platz zu wechseln. Au&szlig;erdem w&auml;re es gut wenn die R nicht abgebrochen werden kann, durch einen Stun oder ein Verstummen auf Urgot. Es w&auml;re auch n&uuml;tzlich wenn Urgot w&auml;rend der Ausf&uuml;hrung unsterblich wird. \r\nDie W, also der Terrorkondensator, ist noch in Ordnung aber sie braucht zuviel Mana bis der Schild n&uuml;tzlich ist. Au&szlig;erdem passt die Verlangsamung nicht zum Schild, weil man seine eigene und einzige sch&uuml;tzende F&auml;higkeit offensiv nutzen muss, falls man einen Feind verfolgt.","replies":[{"poster":"xinf3ct3d","date":"2017-01-22T14:10:09.970+0000","up_votes":2,"down_votes":0,"body":"Du verstehst was nicht. Urgot ist einfach ein Ezreal mit weniger Range und mehr Tankyness. Urgots Kit ist 100% Balanced aber es passt halt nirgends rein auch mit irgendwelchen änderungen. Bei Urgot wäre wenn dan ein Rework besser. An dem Kit das Urgot hat kann man nicht viel ändern. Außerdem ist Urgot mit Exhaust komplett OP","replies":[]},{"poster":"xXSchätzchenXx","date":"2017-01-24T03:56:20.397+0000","up_votes":1,"down_votes":0,"body":"+50 Einheiten Reichweite würde ihm wirklich helfen. Das Problem mit Urgot ist aber in 90% der Fälle ein ganz anderes. Er ist einfach in der Lane kein Burs champ, sondern ein champ der nur eins kann, und das ist Farmen und den gegner nerven. Sein killpotential ist sehr gering. Dafür ist er aber sehr gut darin den Gegner low zu halten. Die wirkliche Kunst ist es sich mit dem Junger abzustimmen, vor allem sobald er lvl 6 erreicht hat, sind so kills garantiert. Allerdings sollte man ihn nicht versuchen ihn wie einen adc zu spielen, sondern viel mehr als einen off-support interpretieren. \n\nDa ist aber auch sein größtes Problem, vor allem in flexi sind die team sehr gemischt, und dieses doch taktisch sehr anspruchsvolle spielgeschehen ist selten. Zumal seine mainlane noch top ist. Eine Lane die leider von gut 60% der Jungler ignoriert wird.","replies":[]},{"poster":"Rioyter","date":"2017-01-22T20:46:02.407+0000","up_votes":1,"down_votes":0,"body":"mein problem ist: die pasive passt so 0,0000000000000 zu kit","replies":[]},{"poster":"TerrorRaven","date":"2017-01-21T22:32:31.459+0000","up_votes":1,"down_votes":0,"body":"Änderung der Passive finde ich nicht in Ordnung, da seine Autoattack-Range zu niedrig ist. Außerdem ist er eher ein Caster, der nur zur Überbrückung der Abklingzeit oder gegen Gebäude Autoattacks benutzt.\nCC-Immunität oder gar Unsterblichkeit während der Kanalisierung wäre zu übertrieben, wenn man bedenkt, was er durch die bewirkt (AOE-Fear, Schadensreduzierung, Unterdrückung mit anschließender Verlangsamung des Gegners). Eine Erhöhung der Reiweite auf den ersten Stufen wäre aber wirklich nicht schlecht.\nAuf der anderen Seite kannst du die Verlangsamung besonders defensiv gut nutzen, wenn du verfolgt wirst.","replies":[]}]}