{"poster":"Shiroi Kitsune","date":"2015-03-01T23:02:25.659+0000","title":"What does Rengar want to be doing early game? (pre-6)","subforum":"Tips & Tricks","up_votes":1,"down_votes":0,"body":"I've been playing some Rengar recently, and I can't quite seem to figure out whether he is someone who looks to gank early, or quickly farm to 6 for his ult.  Would just like to hear from someone with a bit of experience in this area.","replies":[{"poster":"FedAsFuk","date":"2015-03-02T00:40:36.297+0000","up_votes":1,"down_votes":0,"body":"One thing to keep in mind as pre6 Rengar, you are a far better counter ganker than a straight gank champion. A great thing to do when going to counter gank is to have 4 ferocity to do the perma slow/snare of Bola-Bola(snare)-Bola\n\nAs a counter gank champion you need to have good vision of the enemy JG (scuttle as well as wards at enemy camps) to help you be in the right place at the right time. Other than that I dislike Rengar straight up ganks unless the enemy is overextended, allowing you to use you snare and slow from bola strike to really punish the enemy.","replies":[]},{"poster":"Rengar Downey Jr","date":"2015-03-01T23:39:22.965+0000","up_votes":1,"down_votes":0,"body":"Farm till 6 or attempt to gank lanes that can be ganked, we dont try force a gank. Also if you do gank, try to gank with 3 or 4 stacks of furocity so you can get some damage down and then snare (Use Q E to get to 5 stacks then E again to snare) also lane ganking is very effective for him since he can jump out of bushes (but of course this is for side lanes)","replies":[]},{"poster":"Veraska","date":"2015-03-01T23:21:03.545+0000","up_votes":1,"down_votes":0,"body":"for me i literally just farm, you can try to lane gank or counter gank, but i ussually just power farm to 6 then back to get some dmg and try to make an impact with my 1st ult","replies":[]},{"poster":"BakedLotion","date":"2015-03-01T23:17:00.016+0000","up_votes":1,"down_votes":0,"body":"Get 5 ferocity and gank. Now that theres chilling smite, and you have a snare its quite easy to gank pre-6","replies":[]},{"poster":"Phife","date":"2015-03-01T23:07:49.800+0000","up_votes":1,"down_votes":0,"body":"what does any champion do early game?\n\n\n\nfarm?","replies":[{"poster":"Shiroi Kitsune","date":"2015-03-01T23:15:39.565+0000","up_votes":1,"down_votes":0,"body":"Not every champ is solely oriented towards farming though.  Some champions such as Shaco and Lee Sin need to create early action in order to really be used at a high level.  I'm just wondering whether Rengar is the kind of person who should power-farm his way to 6 before he starts looking to gank.","replies":[]}]}]}