{"poster":"H2K GJROX","date":"2015-10-10T06:16:56.819+0000","title":"Rengar o Jinx ¿Cual me Compro? y ¿Quien Ganaria en una Batalla 1vs1?","subforum":"Charlas Generales","up_votes":1,"down_votes":2,"body":"Quiziera saber cual de estos dos campeones comprarme.. lo que pasa es que aun no me decido JAJA, Jinx la se usar bastante... y rengar vi muchisimos tutoriales de como usarlo.. asique se la mayoria de los combos y los items que debo comprar.. asique diganme cual me comviene comprar... :D","replies":[{"poster":"kique1","date":"2015-10-10T15:08:56.907+0000","up_votes":1,"down_votes":0,"body":"Rengar tiene toda la ventaja 1vs1, pero es relativo, depende cómo vaya cada uno, de cómo el team le haga peel al adc, de cómo Rengar use la ulti o si sabe tirar bien el combo... si por ejemplo Jinx tiene la build completa y se compra un randuin como item defensivo tiene altas probabilidades de ganarle a rengar.","replies":[]},{"poster":"Daw","date":"2015-10-10T13:59:01.877+0000","up_votes":1,"down_votes":0,"body":"Rengar le gana en cualquier momento del juego a Jinx 1 vs 1, es más que obvio según yo.\n\na veces voy rengar ADC incluso, lel","replies":[]},{"poster":"Rehrs","date":"2015-10-10T11:54:17.629+0000","up_votes":1,"down_votes":0,"body":"claramente gana rengar, es su función matar carrys con su ulti","replies":[]},{"poster":"Galuca","date":"2015-10-10T06:18:06.131+0000","up_votes":1,"down_votes":2,"body":"1 a 1 es muy factible que jinx .-. es adc","replies":[{"poster":"H2K GJROX","date":"2015-10-10T06:22:36.640+0000","up_votes":1,"down_votes":0,"body":"Okey... quizas me compre a jinx jajaja, lo que pasa es que me encanta rengar, de ultima pido reembolso XD\nGracias por contestar :D","replies":[{"poster":"Revolución","date":"2015-10-10T09:47:07.610+0000","up_votes":1,"down_votes":0,"body":"no reembolses, dejate a Jinx que es genial y de última andá ahorrando para Rengar después.","replies":[]},{"poster":"Galuca","date":"2015-10-10T06:25:07.578+0000","up_votes":1,"down_votes":0,"body":"por nada :3 , igual solo una opinion , los campeones solo rendirian mas en 5 v 5","replies":[]}]}]},{"poster":"Revolución","date":"2015-10-10T09:45:18.636+0000","up_votes":1,"down_votes":0,"body":"tu pregunta no tiene sentido jaja\n\nComprate al que te guste o te divierta más la idea de jugar, pero en 1vs1 solamente te voy a decir una cosa. Ya me ha pasado muchas veces de ir Jinx y te puedo asegurar que la peor pesadilla de ella como de cualquier adc es tener un Rengar enfrente. Podés tirar pinks, estar alerta, tener cuidado, muchas cosas, pero creo que en un duelo 1vs1 con todo disponible y misma habilidad es imposible que Jinx le gane.","replies":[]},{"poster":"Briell","date":"2015-10-10T07:44:47.591+0000","up_votes":1,"down_votes":0,"body":"Con rengar es muy divertido hacer 1 shot xD\n\nhttps://www.youtube.com/watch?v=Ttye-uJAaV0","replies":[]},{"poster":"ALEXKOND","date":"2015-10-10T07:23:48.125+0000","up_votes":1,"down_votes":0,"body":"Los dos cumplen roles muy distintos, es comparar manzanas con naranjas. \nEn cuanto a quien ganaría, si Rengar entra con su R y puede tomar por sorpresa a Jinx, muy probablemente la mate.\nEn cambio si hay distancia y esta visible, Jinx tiene herramientas para hacerle la vida imposible.","replies":[]},{"poster":"Rangiku","date":"2015-10-10T06:44:17.287+0000","up_votes":1,"down_votes":0,"body":"Lo mas provable q en early gane jinx, en late rengar","replies":[]}]}