{"poster":"OC Zooi","date":"2014-07-13T14:34:16.684+0000","title":"Ranglistás egyéni vagy duo meccsek","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Sziasztok Idézők és Fejlesztők!\n\nMa már sajnos eljutottam arra a pontra, hogy valami elképesztően kikakadtam egy solo ranked meccs után. Tudom, hogy sokan bolygatják ezt a témát, de szerintem már épp itt lenne az ideje a sok fejlesztés mellett (amik mellesleg igen ígéretesnek tűnnek) lassan célba venni a ranglistás játékokat is. Tudom, hogy ezeken alakítani nehéz, de szerintem nem állapot az, hogy az ember rendre trollokall játszik és rengeteg afk-sal. Azt nem is várom el, hogy ezzel legyen valami, mivel szinte lehetetlen ezzel bármit is csinálni. Viszont legalább az lp vesztést lehetne átalakítani valamilyen formában, mivel így szinte lehetetlen kijutni egy-egy divizióból. Sok játékos szenved emiatt, mivel látom olyan meccseken amik nagy ritkán vannak, ahol mindenki játszik rendesen, hogy sok olyan van aki nem éppen Silverbe való, de nem tud feljutni a trolloktól. Ez nem jó senkinek sem. Aki már rég jobban játszik mint ahol van az elveheti a kedvét olyannak a normálisan játszana, de nem tud azoktól akik lent ragadtak, mivel ők jobbak jóval. Viszont ugye hetekbe vagy hónapokba telhet kijönni, mivel nagyon sok a troll, így ők lent rangadnak gyengébb játékosokkal akik lehet bőven fejlődnének még, de nem tudnak, mert a lent ragadtak sajnos jobbak mint ők. Szerintem mindenki egyetért velem, hogy a trollok igencsak sok élvezetet vesznek el a játékunkból a rankglistás meccsek folyamán. És nem is az zavarja a játékosokat legfőképp, hogy velük \"kell\" játszanunk, hanem az, hogy ők ezért vesztenek pontokat és nem jutnak feljebb vagy akár viszább esnek. A pontrendszer valamilyen átalakítása segíthetne ezen szerintem, hogy megkíméljük azokat akik építeni akarják a tudásukat és fejlődni, játszani és feljebb és feljebb jutni. Valamint hozzátenni valamit a játékhoz. Én elhiszem, hogy nem egyszerű ez a feladat, de épp itt az ideje, hogy lehetőségeinkhez mérten tegyünk valamit mostmár.\n\nSzerintem a Fejlesztők és a Játékosok együtt biztosan kitalálnának valamit, hogy ne szenvedjen veszteséget az aki szeretne normálisan játszani viszont másoktól nem tud.\n\nKöszönöm a figyelmet és üdvözlök mindenkit: ZW","replies":[{"poster":"Marcixd11","date":"2014-07-14T18:33:20.779+0000","up_votes":2,"down_votes":0,"body":"Erre még egy másik fórumon láttam egy megoldást hogy ha van 1 afk valamelyik csapatban akkor kevesebb lp-t veszítsen a csapat. Erre jött az ellenérv hogy akkor mindenki azt csinálná hogy ha vesztésre állnak gyorsan valaki afk és akkor nincs annyi lp vesztés. Ezt szerintem lehetne ellensúlyozni azzal, hogy mondjuk a csapat vesztene 20 lp-t ha van egy afk akkor a csapat csak mondjuk 15-öt vesztene az afk viszont 30-at így nem menne minden meccsben afk-ba valaki mert akkor már nem érné meg nekik.","replies":[{"poster":"xXCsacsisXx","date":"2014-07-16T12:27:18.578+0000","up_votes":2,"down_votes":0,"body":"Ez nagyon jó ötlet lenne, mert ezek miatt a marhaságok (AFK, hozzám képest űber gyenge csapattársak) miatt hónapok óta bronze5 és bronz3 között mozgok. Egyszerűen képtelenség úgy feljutni, hogy 1 győzelem után 3-4- afk vagy trollkodásos kör jön. Eléggé belefáradtam, már az uninstallon is gondolkozom, pedig már kapott tőlem a RIOT pár kemmény magyar forintot RP-ért...","replies":[]}]},{"poster":"LacaHUN","date":"2014-07-13T18:45:14.426+0000","up_votes":2,"down_votes":0,"body":"Anno NA fórumon tárgyaltunk róla sokat,hogy megoldás talán az lenne ha: \n-egyrészt a ranked meccseken csak az vehetne részt aki az elmúlt mondjuk 1 hónapban nem volt büntetve a tribunal által.\nA riot elég sokat tesz azért,hogy a LoL ne csak játék,hanem sport is legyen és bizony a többi sportágban elég gyakori,hogy ha valaki sokat szabálytalankodik akkor simán eltiltják a versenyeken való részvételtől akár évekre,így sokan reaálisnak látják,hogy ha nem is évekre,de legalább pár hétre a rankedtől is el kéne tiltani azt,aki nem képes sportszerűen vislekedni.\n-Másrészt (lehetőleg az előzővel kombináltan) sokan látjuk jó ötletnek,hogy alapvető hasznossági mutatókat vizsgálva (amelyek jól mutatják mind a carry,mind a support,de akár egy proxy singed részvételét is) legyen különbség a vesztett/nyert LP-ben a személyes teljesítmény függvényében is.Persze nem arról van szó,hogy ha lényegesen jobb vagy a csapat többi tagjánál,akkor 0LP-t buksz egy vesztett meccsnél,hanem arról,hogy mondjuk 20 helyett csak 17-et.Nyert meccsnél pedig 20 helyett 23-at jó teljesítményért,illetve 17-et kapsz ha gyengébb voltál.Ezek nem nagy különbségek,de annak,aki tartósan képes láthatóan jobban teljesíteni mint a csapattársai,azok könnyebben jutnának előre.","replies":[]},{"poster":"M4dr4c","date":"2014-07-13T14:57:47.013+0000","up_votes":2,"down_votes":0,"body":"Erről nem olyan régen volt több topik is, ahol kb letisztáztuk, hogy nem sokat lehet tenni ellene, hogy korrekt legyen mindkét féllel és még visszaélésekre se adjon lehetőséget. Biztos vagyok benne, hogy a Riot dolgozik valami megoldáson, de én elképzelni se tudom mi lehet az, ami beválhatna. Addig is marad a report a trollokra és a remény, hogy a köv meccsben nem lesz...","replies":[]}]}