{"poster":"AfroBonsai","date":"2017-05-24T02:51:15.693+0000","title":"COOP games are filled with bot accounts","subforum":"Player Behavior","up_votes":8,"down_votes":0,"body":"I just lost 2 coop games in a row against intermediate bots because my team was filled both times ENTIRELY with bot accounts farming for IP and exp. This should not be allowed, this is not what coop is for. There should be a system that can detect these accounts and ban them for life or at least put enemy bots on standby just as an afk teammate would.\r\n\r\nThese bots are well bellow beginner bots, the only thing they do is push mid and suicide under enemy tower and when the enemy team is fed there is nothing to do against a 1v5 even if they are intermediate bots.\r\n\r\nI mostly encounter these accounts on late nights (between 2 and 8 am on the EUW server) but I'm guessing that's because at that late hours not many people play and it's easier to find these bot accounts.\r\n\r\nLately I encounter at least 1 bot account on every coop game I've played and I've been reporting them for cheating every time, but RIOT doesn't seem to care because the people who play coop don't spend money on skins yet, so why bother right?\r\n\r\nThis is a plague, there are countless accounts out there controlled by bots, and something must be done.\r\n\r\n\r\nIf RIOT reads this, please, PLEASE develop a system to detect and ban these accounts for life.\r\n\r\nIf a coder reads this, please at least make the bots smarter so they can at least do something useful for a change and it doesn't ruin the experience for the rest of us.","replies":[{"poster":"KORGtuners","date":"2017-05-24T03:42:49.304+0000","up_votes":2,"down_votes":2,"body":"> If RIOT reads this, please, PLEASE develop a system to detect and ban these accounts for life.\n\nIt is because of account bans that these bots even exist.\n\n> If a coder reads this, please at least make the bots smarter so they can at least do something useful for a change and it doesn't ruin the experience for the rest of us.\n\nThey aren't made for your entertainment. They are made to make money selling accounts.","replies":[{"poster":"AfroBonsai","date":"2017-05-24T04:11:39.361+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=KORGtuners,realm=NA,application-id=ZGEFLEUQ,discussion-id=5uoEu0fy,comment-id=0000,timestamp=2017-05-24T03:42:49.304+0000)\n>\n> It is because of account bans that these bots even exist.\n\nWhat brilliant logic are you following? Riot ban accounts so people need a leveled up account faster to get right back in the game?\n\nIt still doesn't make it right, it also doesn't mean that they can't find a way to identify these bots as they do with afks (leave one enemy bot standing in base for every afk in your team).\n\nAnd i'm not saying I want to be entertained by them, but I'm guessing these bots were coded in an afternoon, might as well take another afternoon and make a better version that actually do something useful.\n\nAlso I am not saying I want to play with bots, I would prefer them to be banned altogether, but since RIOT doesn't do anything maybe a kindhearted coder can do it, maybe even sell it for a profit: Farming bots 2.0.","replies":[{"poster":"KORGtuners","date":"2017-05-24T04:41:23.982+0000","up_votes":1,"down_votes":0,"body":"> It still doesn't make it right\n\nI'm not saying it is right or wrong. Simply why they exist. They would most likely still exist if Riot no longer banned. They would be far less profitable though. Perhaps, a no ban policy would bring about a curious coder that has passion for the code, instead of passion for making money.","replies":[]}]}]},{"poster":"reaperteaser","date":"2017-05-25T05:44:22.291+0000","up_votes":1,"down_votes":0,"body":"every game of blind pick twisted treeline has one, unless you get a 3 man vs another 3 man group, there will be a bot\n\nits always one of the free rotation champs, they have odd keystones/summoners and dont leave fountain til minions spawn\n\ntelltale signs of a bot","replies":[{"poster":"Dolyna","date":"2017-05-26T12:46:35.118+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=reaperteaser,realm=NA,application-id=ZGEFLEUQ,discussion-id=5uoEu0fy,comment-id=0002,timestamp=2017-05-25T05:44:22.291+0000)\n>\n> its always one of the free rotation champs, they have odd keystones/summoners and dont leave fountain til minions spawn\n\nThe ones I've had lately will go up the middle lane and stop just behind the second turret. Then they'll follow the first wave of minions as they pass.","replies":[]}]},{"poster":"feed rage blame","date":"2017-05-26T11:28:33.322+0000","up_votes":1,"down_votes":0,"body":"I just went in a bot game... 4 bots... just run it down mid and die... I can't believe this is still possible...","replies":[{"poster":"PandaPenyihir","date":"2017-05-26T17:26:48.618+0000","up_votes":1,"down_votes":1,"body":"well riot doesn't really care about this much as you can tell.","replies":[]}]},{"poster":"Gone Turbo","date":"2017-05-24T03:58:33.962+0000","up_votes":1,"down_votes":0,"body":"This is the thing I've been dealing with the most. They feed like crazy, they tilt everyone, and they destroy the experience of playing with human teammates. I want to play AGAINST bots, not WITH 'em. \n\nI really do hope Riot does something about this. It really sucks to be prepared for an easy relaxing game, or even a genuine practice match, and have to shuffle everyone around because some bot decides it wants to serve the enemy team breakfast, lunch, and dinner.","replies":[]}]}