{"poster":"KorSett","date":"2016-08-04T01:31:54.080+0000","title":"Möchte Team aufbauen","subforum":"Clans & Teams","embed":{"description":"Hallo, mein Name ist Robin. Ich bin 22 Jahre jung, leidenschaftlicher Jungler und suche Gleichgesinnte. Ich habe seit einiger Zeit keine Rangliste mehr gespielt, da mir seit der \"dynamischen Warteschlange\" einfach die Kommunikation und Motivation anderer Spieler missfällt. Aus diesem Grund möchte ich hier ein Team aufbauen, \"das ein Team aufbauen möchte\"!","url":"https://gamurs.com/teams/119107","image":"https://images.gamurs.com/team/avatar/f6d223bb-5f28-4e87-bc1b-e1384fe888af.png"},"up_votes":1,"down_votes":0,"body":"Komplette Beschreibung steht auf der Website im Link. Einfach reinschauen und bewerben, stehe auch zu Feedback offen!\nVielen Dank, Robin","replies":[{"poster":"RankaxLee","date":"2016-08-04T14:52:01.547+0000","up_votes":1,"down_votes":0,"body":"Bin Jungle/ADC im Platinbereich und 25 Jahre alt. Habe ziemlich gutes Spielverständnis und spiele seit Season 1.","replies":[]},{"poster":"Nánashi","date":"2016-08-04T10:45:48.650+0000","up_votes":1,"down_votes":0,"body":"Hallo ich hätte interesse da ich genau so ein team schon länger suche:) mein name ist marcel bin 20 und spiel auch erst wieder 2-3 wochen nach über 1 jahr pause daddel grad in silber 5 aber grad promo zu silber 4 rum mein inagme name ist Beggyas und hätte interesse als ad carry oder mid laner ins team zu gehen bevorzugt aber als adc xD zu mir an sich bin eine sehr offene person die viel humor mitbringt aber durchaus auch ernst an dinge ran geht wenn es verlangt wird.\nich würde mcih freuen mal persönlich miteinander reden zu könne und um zu schauen ob ich ins team passe und kommen kann :) \n\nmfg Beggyas","replies":[]},{"poster":"BeyJim","date":"2016-08-04T09:17:28.979+0000","up_votes":1,"down_votes":0,"body":"hört sich gut an ich will mal schauen obs was wird in der Vergangenheit hatte ich schon Teams wo das nur ne lockere Idee war welche dann dazu führte das nie ein spiel zusammen kam naja da war der Captain auch erst 15 :/","replies":[]},{"poster":"KKKKlaus","date":"2016-08-04T07:34:57.325+0000","up_votes":1,"down_votes":0,"body":"Hey,\nhab dich Ingame geadded!","replies":[]}]}