{"poster":"remakoro","date":"2018-05-31T17:42:16.861+0000","title":"So we just gonna take those 4 starting AD from every marksman....","subforum":"Gameplay","up_votes":14,"down_votes":10,"body":"And give every single one of them 0.7 AD per level... Which is actually 12 AD...\nWhat? For some of them it means doubling their AD per level and for some getting more base AD is bigger buff than for the others? Ah who cares. Stop speaking nonsense. Its 0.7 AD.\nSurely Its gonna impact every ADC in the same way, right?\nRIGHT?\n\nThats laziest fucking change from riot so far. \n\n{{sticker:slayer-jinx-unamused}} \n\nIm actually amazed. You have to be very special to think of doing it this way.\n\n\nEDIT I didnt expect that so many people would miss what im trying to say completely. Here is a hint. ADC have different starting AD and different AD growth stat... And there is a reason for that most likely. But they getting absolutely same treatment. -4 early AD +0.7 AD per lvl. No matter if its kaisa that previously had AD growth of 1! or draven that now has 4+\n\n","replies":[{"poster":"Anu3isII","date":"2018-05-31T19:32:11.152+0000","up_votes":9,"down_votes":2,"body":"The overall change looks like a switch between the old Flat bonus runes and Scaling Bonus runes. The Scaling runes generally catched Flat runes at level 6-7 and outscaled them afterwards.\n\nRiot just wants to make Marksman have weaker Early Game and better Late Game.","replies":[{"poster":"GigglesO","date":"2018-06-01T00:04:05.040+0000","up_votes":1,"down_votes":0,"body":"Can I get that with morde? I'd much rather have some extra at level 7 not like I can do anything level 1 anyways.","replies":[{"poster":"flibitydoo","date":"2018-06-01T06:52:07.689+0000","up_votes":1,"down_votes":0,"body":"dawg morde gains like 5 AD per level\n\nhe actually has the highest AD growth in the game.","replies":[]}]},{"poster":"wildfox99","date":"2018-05-31T20:19:56.626+0000","up_votes":1,"down_votes":1,"body":"both ADC will have a bad early  so it doesn't make any difference (bad early vs bad early is like stong early vs strong early),but when they start to interact with other lanes they will have more AD (yea,the difference isn't that big but considering they were already oppressive mid/lategame it's not good)\n\nin any case i don't think this 4 AD will make the difference,ADC needed a nerf not a power shift (or at least a shifting their power while nerfing it a bit)","replies":[]}]},{"poster":"Mokuto Bunshi","date":"2018-05-31T21:29:42.279+0000","up_votes":6,"down_votes":0,"body":"it means they get 4.2 AD by level 6; I wonder if stalling their scaling till 6 was riots goal?","replies":[{"poster":"BestPudgeNA","date":"2018-06-01T00:45:55.226+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Mokuto Bunshi,realm=NA,application-id=3ErqAdtq,discussion-id=6pPmJHF7,comment-id=0004,timestamp=2018-05-31T21:29:42.279+0000)\n>\n> it means they get 4.2 AD by level 6; I wonder if stalling their scaling till 6 was riots goal?\n\nNo, they said it was supposed to break even at level 9. But they can't even do 3rd grade level math.","replies":[{"poster":"Mokuto Bunshi","date":"2018-06-01T21:57:23.365+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BestPudgeNA,realm=NA,application-id=3ErqAdtq,discussion-id=6pPmJHF7,comment-id=00040000,timestamp=2018-06-01T00:45:55.226+0000)\n>\n> No, they said it was supposed to break even at level 9. But they can&#x27;t even do 3rd grade level math.\n\nReally? I don't know where they said it does anyone have link?","replies":[{"poster":"BestPudgeNA","date":"2018-06-01T23:02:12.815+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mokuto Bunshi,realm=NA,application-id=3ErqAdtq,discussion-id=6pPmJHF7,comment-id=000400000000,timestamp=2018-06-01T21:57:23.365+0000)\n>\n> Really? I don&#x27;t know where they said it does anyone have link?\n\nIn the patch 8.11 notes.\n\n\"Finally, we're nerfing marksman base attack damage by 4 and pushing that damage into their growth stat, with the breakeven point around level 9. \"\n\nReality is it breaks even at 6.","replies":[{"poster":"Mokuto Bunshi","date":"2018-06-03T23:10:19.541+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BestPudgeNA,realm=NA,application-id=3ErqAdtq,discussion-id=6pPmJHF7,comment-id=0004000000000000,timestamp=2018-06-01T23:02:12.815+0000)\n>\n> In the patch 8.11 notes.\n> \n> &quot;Finally, we&#x27;re nerfing marksman base attack damage by 4 and pushing that damage into their growth stat, with the breakeven point around level 9. &quot;\n> \n> Reality is it breaks even at 6.\n\nThat's odd, maybe they mean overall strength because they are also counting the health they no longer have??","replies":[{"poster":"BestPudgeNA","date":"2018-06-03T23:28:33.192+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mokuto Bunshi,realm=NA,application-id=3ErqAdtq,discussion-id=6pPmJHF7,comment-id=00040000000000000000,timestamp=2018-06-03T23:10:19.541+0000)\n>\n> That&#x27;s odd, maybe they mean overall strength because they are also counting the health they no longer have??\n\nThey upped ADC hp though ...","replies":[{"poster":"Mokuto Bunshi","date":"2018-06-04T02:31:50.415+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BestPudgeNA,realm=NA,application-id=3ErqAdtq,discussion-id=6pPmJHF7,comment-id=000400000000000000000000,timestamp=2018-06-03T23:28:33.192+0000)\n>\n> They upped ADC hp though ...\n\n...just wow.","replies":[]}]}]}]}]}]}]},{"poster":"AirKingNeo","date":"2018-05-31T20:41:19.377+0000","up_votes":6,"down_votes":3,"body":"Losing base damage for early levels is fucking huge, do not kid yourself.\n\nThis is how they want to allow melees and even mages bot lane, so here you go.","replies":[{"poster":"remakoro","date":"2018-05-31T20:45:57.270+0000","up_votes":3,"down_votes":8,"body":"http://memes.ucoz.com/_nw/32/10201233.png","replies":[]}]},{"poster":"HalcyonDweller","date":"2018-05-31T23:42:12.132+0000","up_votes":4,"down_votes":2,"body":"_Wow, really persuasive how you keep insulting people in the comments for disagreeing with you._\n\n{{sticker:slayer-jinx-unamused}} \n\nMaybe the point didn't go over their heads. Maybe they just disagree.","replies":[{"poster":"remakoro","date":"2018-06-01T10:24:53.352+0000","up_votes":1,"down_votes":0,"body":"Yea. When people talking about something i didnt even plan to discuss and ignore 80% of words in original post... Yea thats totally seem like they didnt miss my point.\nAlso - telling someone that he missed the point isnt \"insulting\". ","replies":[{"poster":"HalcyonDweller","date":"2018-06-01T15:52:13.386+0000","up_votes":1,"down_votes":0,"body":"If people don't understand your point then maybe you should try to explain it again. At least that's what I hear rational people do.","replies":[]}]}]},{"poster":"D357R0Y3R","date":"2018-05-31T21:32:02.906+0000","up_votes":6,"down_votes":4,"body":"read the patch it's pretty much well explained\nthey're shifting power from early to late game\nand -4 ad at lvl 1 is a stronger nerf than +8 ad at lvl 18","replies":[{"poster":"remakoro","date":"2018-05-31T23:36:39.907+0000","up_votes":3,"down_votes":5,"body":"> [{quoted}](name=remakoro,realm=EUNE,application-id=3ErqAdtq,discussion-id=6pPmJHF7,comment-id=00030000,timestamp=2018-05-31T20:45:57.270+0000)\n>\n> http://memes.ucoz.com/_nw/32/10201233.png","replies":[]}]},{"poster":"Pika Fox","date":"2018-05-31T19:39:06.906+0000","up_votes":7,"down_votes":5,"body":"For a role dedicated to minion farming, 4 ad early is a really big nerf.","replies":[{"poster":"BestPudgeNA","date":"2018-06-01T00:44:13.698+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Pika Fox,realm=NA,application-id=3ErqAdtq,discussion-id=6pPmJHF7,comment-id=0001,timestamp=2018-05-31T19:39:06.906+0000)\n>\n> For a role dedicated to minion farming, 4 ad early is a really big nerf.\n\nYou know there are mages that have 25 less AD and slow attack speed that use autos to CS for like the first 8mins of the game right. #ADCTrainingWheels\n\nIt's also a buff.","replies":[{"poster":"Pika Fox","date":"2018-06-01T02:35:28.632+0000","up_votes":1,"down_votes":2,"body":"The only ADC in the top 5 is graves (counting ties for positions), who functions differently from other ADCs, everyone else is melee. All the mages in the bottom 5 are either supports (janna), have auto enhancing abilities (ori passive, sona passive), or farm using other abilities (karthus q)\n\nShit, 2 ADCs are in the top 5 lowest base AD at 18 base, kaisa and MF (3 if you wanna count kayle as the hybrid weird carry thing she likes to be sometimes)\n\nThe first true ADC is at 62 AD starting, kalista, where as theres only a 10 or so AD gap between her and the bottom rung of mages youd expect to auto (who, again, have other methods of waveclear at their disposal).","replies":[{"poster":"BestPudgeNA","date":"2018-06-01T03:42:01.618+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pika Fox,realm=NA,application-id=3ErqAdtq,discussion-id=6pPmJHF7,comment-id=000100020000,timestamp=2018-06-01T02:35:28.632+0000)\n>\n> The only ADC in the top 5 is graves (counting ties for positions), who functions differently from other ADCs, everyone else is melee. All the mages in the bottom 5 are either supports (janna), have auto enhancing abilities (ori passive, sona passive), or farm using other abilities (karthus q)\n\nI realize Marksman don't have the highest best AD i the game, it would be retarded if they did because they have ranged. I was comparing them to other ranged champs for example mages\n{{champion:101}} 54.7 \n{{champion:119}} 60\n{{champion:99}} 53.5\n{{champion:222}} 57\n\nADs also have the option of starting Dblade 3 extra damage to minions vs D Ring or Long sword 10 AD vs 0 from Dark Seal.\nADs also have the stat bonus for trees at level one which is and extra 6 or more AD. \n\nPoint is most mages at some point have to auto down creeps early on and most of them have 10-25 less damage after the \"nerf\"\nIt's not hard and it funny that some ADCs think it is. \n\n#ADCTrainingwheels LMFAO what a babied class.","replies":[{"poster":"Pika Fox","date":"2018-06-01T04:55:27.494+0000","up_votes":2,"down_votes":1,"body":"Because {{champion:101}} doesnt have a mana battery passive and Q for farming and {{champion:99}} doesnt have an auto enhancing passive on spell damage or anything for easier last hits...\n\nAlso the biggest discrepency you posted was 6.5 AD between lux and draven. Still a far cry from that 25.","replies":[{"poster":"BestPudgeNA","date":"2018-06-01T05:18:03.752+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pika Fox,realm=NA,application-id=3ErqAdtq,discussion-id=6pPmJHF7,comment-id=00010002000000000000,timestamp=2018-06-01T04:55:27.494+0000)\n>\n> Also the biggest discrepency you posted was 6.5 AD between lux and draven. Still a far cry from that 25.\n\nDraven longsword start vs mage with dark seal start then it.s 16.5 then you add it another 6 for Tree bonus that's 22.5 at level one. But ADs need help CSing. fucking what a joke of class. \n\nAlso stop acting like ADCs don't have help CSing with abilities, like hello Draven Rank 1 Q gives plus 35base and % bonus AD. Like literally first wave CS draven is attack for over 100 while lux is hitting for less then 60. It's comical that ADCs need training wheels. Like actually your class is just a literally laughing stock at this point.","replies":[{"poster":"Pika Fox","date":"2018-06-01T13:38:42.760+0000","up_votes":1,"down_votes":1,"body":"Yes, because longsword start is used oh so often. And very few ADs have the ability to spam their mana on waves, as it will shove the wave leaving you in an unfavorable position (mid is roam heavy, bot usually isnt early without kills) and lack of mana (mages opt into mana early)","replies":[]}]}]}]}]}]},{"poster":"GigglesO","date":"2018-06-01T00:04:31.886+0000","up_votes":1,"down_votes":0,"body":"So mid top and jungle aren't minion farming?","replies":[{"poster":"Pika Fox","date":"2018-06-01T00:19:51.145+0000","up_votes":1,"down_votes":2,"body":"Not nearly to the extent that the ADC is. AD is much more gold reliant than top or mid, and given the extra protection, youre a lot more focused on being able to last hit and wave control. Plus, other roles generally have better abilities to help farm, especially mid.","replies":[{"poster":"GigglesO","date":"2018-06-01T00:35:22.954+0000","up_votes":1,"down_votes":0,"body":"Just because they have better slot efficiency and better items at the cost of being more expensive doesn’t mean they are any less or more farm reliant.","replies":[{"poster":"Pika Fox","date":"2018-06-01T02:43:19.354+0000","up_votes":1,"down_votes":2,"body":"They really are. ADCs are the thing you stack all your damage on as its the most efficient, as damage stats really suck in teamfights (0 damage if dead). Given you cant end the game without killing towers and inhibs, and death timers are relatively short, your damage person really needs said items to be able to end the game.\n\nAlso, most other champions have better utility, which requires 0 gold to make useful. The guy who only brings damage and damage multiplier abilities needs said damage to back everything up. The guys who have CC and other displacements just need to press buttons to function (and abilities tend to have fairly high base damage)","replies":[{"poster":"PrinceOfStorms","date":"2018-06-01T06:37:08.686+0000","up_votes":1,"down_votes":0,"body":"> The guy who only brings damage and damage multiplier abilities needs said damage to back everything up\n\nExcept a lot of ADs bring things besides damage. Jhin has a root and a crippling slow on his R. Kai'sa is Kai'sa. Varus has a root. Sivir has a team movement steroid. Xayah, Caitlyn, and Jinx have roots. Vayne has a stun. Kalista has a slow and a knockup. Ashe has a slow and a (potentially) global stun.\n\nIn particular Sivir, Ashe, and Kalista have really important team synergy.\n\nNow if we removed all utility from ADCs maybe I'd agree with you, but what you just said is demonstrably false.","replies":[{"poster":"Pika Fox","date":"2018-06-01T13:35:11.547+0000","up_votes":1,"down_votes":2,"body":"Very few ADCs bring team utility, and they usually do at the cost of mobility and/or damage, so they already paid the cost for their utility.","replies":[]}]}]}]}]}]},{"poster":"remakoro","date":"2018-05-31T20:45:28.328+0000","up_votes":3,"down_votes":8,"body":"http://memes.ucoz.com/_nw/32/10201233.png","replies":[]}]},{"poster":"Giga Baboon","date":"2018-05-31T20:28:06.075+0000","up_votes":2,"down_votes":3,"body":"Across the board \"class\" changes are a riot staple and it's the biggest sign of raw laziness and apathy.\n\n","replies":[]}]}