{"poster":"ZlKingKong","date":"2018-08-10T11:22:45.825+0000","title":"Magier als ADC","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":6,"body":"Hallo Leute\n\nIch frag mich ob man Magier als ADC Spielen darf. Eben in Rangliste war einer der Ryze als Adc Spielte. Da ich Supporter spiele und immer mit einen Schütze zusammen spielte war mir das mit ein Magier ganz Komisch.\n\n\n","replies":[{"poster":"Nordwolf87","date":"2018-08-10T12:06:54.926+0000","up_votes":4,"down_votes":1,"body":"Es gibt keine Rolle mit Namen ADC. Die Rolle heißt Botlane und ist eine Lane genauso wie Top und Mid. Bisher war es am effizientesten dort Schütze+Supporter zu spielen\n\nRiot wollte diese Eintönigkeit aufbrechen und jetzt wohnen auch fighter und mages auf der Botlane. Als Supporter musst du dich bissl anpassen :)","replies":[{"poster":"ZlKingKong","date":"2018-08-10T12:15:54.629+0000","up_votes":1,"down_votes":1,"body":"ja anpassen leicht gesagt. wie soll man ein Magier mit Support helfen.","replies":[{"poster":"Veezey","date":"2018-08-10T12:27:12.910+0000","up_votes":3,"down_votes":0,"body":"Genauso wie einem ADC wtf","replies":[{"poster":"ZlKingKong","date":"2018-08-10T12:32:03.517+0000","up_votes":1,"down_votes":3,"body":"eben nicht. Support ist da um Schütze zu helfen. Die Fertigkeiten eines Support wurde so gemacht das es für Schütze sind","replies":[{"poster":"OT Riku","date":"2018-08-10T12:45:07.474+0000","up_votes":4,"down_votes":0,"body":"Nenn mir eine Fähigkeit die wirklich nur schützen passt. Oo\n\nAußerdem ist ein Support nicht da um den Schützen zu supported sondern das Team.","replies":[{"poster":"Uranbrennstab","date":"2018-08-10T14:10:50.217+0000","up_votes":2,"down_votes":0,"body":"Janna E","replies":[{"poster":"Altais Draconis","date":"2018-08-10T15:10:37.476+0000","up_votes":1,"down_votes":0,"body":"Passt perfekt zu Yi, Irelia, JAx, Tryndamere und allen anderen Attackspeedlastigen Bruisern oder Champs die auf AD Skalieren.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T15:13:40.114+0000","up_votes":1,"down_votes":1,"body":"Alles passt zu Schütze. Aber nicht alles  passt für Support\nz.b kannst kein Tanker heilen 6000 LP hat oder Schild geben  weil das nicht bringt .\nSupporter aber auch nachteile Sorkaka pro Heilung 10% LP  Nami hat mana usw.","replies":[{"poster":"Altais Draconis","date":"2018-08-10T15:26:32.164+0000","up_votes":4,"down_votes":0,"body":"Eh, doch kann ich. Mit Soraka heil ich des öfteren mal einen Maokei mit 4000 HP ... warum auch nicht? Der Typ bekommt den meisten schaden, und wenn meine anderen Carries gerade keinen Schaden erleiden, werd ich da bestimmt nicht rumstehen und nix tun. \n\nDu siehst das game viel zu einseitig.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T15:42:36.489+0000","up_votes":1,"down_votes":1,"body":"Warmogs Rüstung  denke nicht das 4000 HP öfteren heilst ohne das . aber es gebt eine nach teil für die Rütung musst 3k LP haben das ist wiederum nicht gut. ","replies":[{"poster":"OT Riku","date":"2018-08-10T15:55:12.822+0000","up_votes":2,"down_votes":0,"body":"Nicht jeder Tank baut warmogs.\n\nUnd selbst heals und Schilde sind auf tanks ziemlich stark bekomm mal nen tank mit 4k leben und 2000k shield down bedenke das Schilde auch von deinen Resistenzen profitieren. \n\nJeder support kann einen Magier unterstützen auch wenn er nicht perfekt passt. \nMages haben meist ein ziemlich gutes all in, wenn du da ne kombo draufhaust und nichts mehr hast und du jetzt zurück getraded wirst. Bringt dir ein Janna ULT, SCHILD, SLOW, knockup garnichts haste ja recht.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T15:57:03.782+0000","up_votes":1,"down_votes":1,"body":"wenn du als Support  auf  Ap gehst bist du leichtes ziel\n","replies":[{"poster":"OT Riku","date":"2018-08-10T16:04:19.063+0000","up_votes":2,"down_votes":0,"body":"Hab ich was von AP auf supports geschrieben.","replies":[{"poster":"OT Riku","date":"2018-08-10T17:21:01.906+0000","up_votes":1,"down_votes":0,"body":"Ich hab wie du argumentiert.","replies":[]},{"poster":"Jura500","date":"2018-08-10T16:08:42.318+0000","up_votes":1,"down_votes":0,"body":"Muss er etwa darauf eingehen was du schreibst? Soweit kommt es noch!\nLass ihn gefälligst einfach irgendwelche Dinge schreiben, die ihm dabei helfen bei seiner Meinung zu bleiben!!!!","replies":[]}]}]}]}]}]}]},{"poster":"Uranbrennstab","date":"2018-08-10T15:15:21.348+0000","up_votes":1,"down_votes":0,"body":"Klar, wenn dir Effizienz und application egal sind.","replies":[{"poster":"Altais Draconis","date":"2018-08-10T15:25:18.360+0000","up_votes":1,"down_votes":0,"body":"What? Ich hab Janna zu S7 und 8 gemained und min. 600 games auf ihr und wenn man einen Yi, der nicht gerade behind ist, einen Ardent Censer E gibt, macht er damit schnell mal einen Penta. \nJax und Tryndamere eskalieren mit Janna E ebenfalls... keine Ahnung was du die ganze Zeit spielst, aber solange ein Champion A-spd und AD verwendet, ist janna E IMMER usefull.","replies":[{"poster":"Uranbrennstab","date":"2018-08-10T15:49:53.320+0000","up_votes":1,"down_votes":0,"body":"Ja sicher, ein ADC, am besten mit Runnas macht aber deutlich mehr daraus als ein Melee. Und Tryndamare in Teamfights lul.","replies":[{"poster":"eingew","date":"2018-08-11T08:50:09.491+0000","up_votes":1,"down_votes":0,"body":"Naja, auf denen macht es schon noch Sinn. Auf einem AP-Champ dürfte der AD-Bonus aber ziemlich nutzlos sein.","replies":[]}]}]}]}]}]},{"poster":"ZlKingKong","date":"2018-08-10T14:08:35.449+0000","up_votes":1,"down_votes":1,"body":"Alles passt zu schützen .Die frage ist was passt nicht zu schütze","replies":[{"poster":"Altais Draconis","date":"2018-08-10T15:28:19.777+0000","up_votes":1,"down_votes":0,"body":"Rakan ist der PERFEKTE support für einen Yasuo, Shield, Attack speed (bei athenas), knoch up für seine Ulti, heal, der synergiert sogar besser als der ein oder andere Schütze, haben Schützen jetzt die legitimation verloren, von Rakan supportet zu werden, weil Rakan besser auf Yasuo passt? Hm.\nDu hast eine komische Logik.","replies":[]}]}]},{"poster":"Veezey","date":"2018-08-10T12:57:20.966+0000","up_votes":1,"down_votes":0,"body":"Achso. Also wirken Schilde, Heilungen, Lauf und Angriffstempo Buffs etc nur auf Marksman? Mein Fehler.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T13:18:40.830+0000","up_votes":1,"down_votes":3,"body":"Kla könnte ich dir sagen warum :D will ich aber nicht ^^\n\nda stellt  man die frage was ist überhaupt ein Schütze :D und was ist  der unterschied zwischen anderen Klassen.\nwas für vorteile und nach teile , dann kommst du vll drauf :D\nwarum Support für schütze sind. ","replies":[{"poster":"OT Riku","date":"2018-08-10T13:42:03.156+0000","up_votes":1,"down_votes":0,"body":"Also hast du kein plan was Supports für skills besitzen alles klar.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T13:59:20.370+0000","up_votes":1,"down_votes":1,"body":"du stellst dir das zu einfach vor.","replies":[{"poster":"colonel cranc","date":"2018-08-10T14:10:09.774+0000","up_votes":1,"down_votes":0,"body":"nein, bitte, elaboriere.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T14:44:06.451+0000","up_votes":1,"down_votes":1,"body":"schütze machen am meisten schaden haben aber wenig LP und \nVerteidigung. Was mach Support für adc ? genau sein schwäche und seine stärken  verbessern.\ngebt viel mehr was man noch achten  muss  Lauftempo usw . \n","replies":[{"poster":"colonel cranc","date":"2018-08-10T14:50:07.346+0000","up_votes":1,"down_votes":0,"body":"stimmt soweit auch, aber auch Mages haben wenig leben und sind recht squishy. \nund je nachdem welcher mage macht der auch deutlich mehr schaden als der adc. \n\nausserdem ist der support nicht die Bitsch vom Adc.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T14:57:57.389+0000","up_votes":1,"down_votes":1,"body":"kein macht mehr schaden als ein schütze \n\nwas verstehst du unter schaden ?\n\nEs gebt verschieden schaden art ","replies":[{"poster":"Altais Draconis","date":"2018-08-10T15:15:41.352+0000","up_votes":3,"down_votes":0,"body":"Eh. Du stellst Hypothesen auf und erklärst die nicht eindeutig. Wenn man das Hinterfrägt dann kommst du ganz arrogant mit \" ich könnte es dir ja verraten, mach ich aber nicht\" und \"was für vorteile und nach teile , dann kommst du vll drauf :D\" \n\nsorry, aber da hört bei mir schon die Lust auf, die Diskussion weiter zu verfolgen. Entweder du formulierst deine Annahmen aus und gehst auf kritische Gegenantwort ein oder du lässt es.\n\nFakt ist: Ein Support kann alle lanes supporten und ist nicht an seinen ADC gebunden, somit kannst du problemlos auch einen Ryze APC auf der Botlane supporten. \nNach 2 Jahren main Support kann ich das bestätigen.","replies":[]}]}]}]}]}]}]},{"poster":"Waldschrat86","date":"2018-08-10T13:45:32.027+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZlKingKong,realm=EUW,application-id=KYnfKGf0,discussion-id=Mpx7AJoj,comment-id=000300000000000000010000,timestamp=2018-08-10T13:18:40.830+0000)\n>\n> Kla könnte ich dir sagen warum :D will ich aber nicht ^^\n> \n> da stellt  man die frage was ist überhaupt ein Schütze :D und was ist  der unterschied zwischen anderen Klassen.\n> was für vorteile und nach teile , dann kommst du vll drauf :D\n> warum Support für schütze sind.\n\nAlso bei mir steht, wenn ich die Rolle, die normalerweise Schützen bekleiden wähle \"Unten\" und nicht Schütze.\n\nUnd wenn Supports nur für Schützen sein sollten, was machst du, wenn du einen auf der Lane hast, Quinn Mitte, Twitch Jungle und Graves Top? Verwirrt im Kreis rennen?","replies":[{"poster":"clair de lune289","date":"2018-08-10T23:30:15.823+0000","up_votes":2,"down_votes":0,"body":"ist doch ganz klar wie in der Mathematik\n\nSchütze (Top/Mid/Jungel) + Schütze (Top/Mid/Jungel) heben sich gegenseitig auf quasi wie \n- mal - , + ergibt.\nsollte dann allerdings 1 oder 3 zusätzliche Schützen im Spiel sein, ist das ganz klar ein Trollversuch und man sollte dieses Spiel unbedingt dodgen.\n\naus diesem Beispiel ist auch ganz klar ersichtlich das Skill definitiv multiplikative ist!{{sticker:sg-ahri-2}}","replies":[]}]}]}]}]}]},{"poster":"Awsane","date":"2018-08-10T12:34:18.604+0000","up_votes":4,"down_votes":1,"body":"also vorab, ich finde es gut, dass man nun auch anderes auf bot neben adcs spielen kann,\nIch habe sowieso nie eingesehen warum der adc die einzige Rolle im Spiel ist, die keinen 2. Archetypen spielen können muss, auf jeder anderen Lane muss man ja auch mehrere Sachen spielen können (top, Tanks, fighter, battlemages; mid, assasins, Control mages, fighter; etc pp)\n\nund es ist recht einfach einen Mage zu supporten. Doppelmage botlanes funktionieren relativ gut {{champion:63}} {{champion:161}} {{champion:143}}  als support zusammen mit nen {{champion:74}} {{champion:115}} {{champion:101}} {{champion:134}} {{champion:90}} erzeugen richtig viel Druck über Poke und Reichweite. Wenn einem das gar nicht zusagt kann man auch {{champion:16}} {{champion:117}} {{champion:25}} damit spielen. \n\nAlternativ kann man auch Supporter die roamen spielen. Der Mage kommt bis auf die sehr frühe Phase(bis er {{item:3802}} meistens hat) im Spiel durch den Waveclear auch gut allein zurecht. Daher kann man {{champion:432}} {{champion:555}}  ({{champion:53}} {{champion:12}} ) auch spielen und versuchen den Jgl zu invaden mit dem eigenen Jungler oder mid/top ganken.\n\nEinzig Supporter die gut mit Basic Attacks harmonieren wie {{champion:40}} {{champion:201}} oder {{champion:267}} sollte man mit nen Mage nicht spielen, da man hier es deutlich schwieriger hat das volle potential zu entfachen.\n\nEs ändert sich nen bisschen wie man spielt, man spielt nicht mehr auf 100% beschützen des Adc sondern spielt aggressiver über zonecontrol und Druck übers Pushen, man spielt also eher wie 2 carries das ganze, aber gehen tut das immer noch sehr gut.","replies":[{"poster":"Megamaexx","date":"2018-08-11T08:33:10.832+0000","up_votes":2,"down_votes":0,"body":"Nami funktioniert sehr gut mit einem Mage. Wenn du dabei auf ihre E hinaus willst, die wird ineffizienter, wenn der gebuffte zu viel Attack Speed hat, da dann der Slow nicht voll ausgeschöpft wird.\nLulu ist allerdings mit einem autoattack basierenden Champion stärker, da Pix dadurch seine volle Macht entfalten kann.","replies":[]}]},{"poster":"Nordwolf87","date":"2018-08-10T12:36:06.944+0000","up_votes":2,"down_votes":0,"body":"Der Magier macht eig das gleiche wie ein ADC. Etwas umstellen muss man sich wenn man mit/gegen einen Yasuo o.ä. spielt (kann ich auch nicht so gut).\n\nAber beim Mage gilt das gleiche wie beim ADC: Zonen, Poken, Heilen/Shielden und versuchen bei den All-Ins den CC richtig zu setzen.\n\nDer Vorteil (finde ich) ist bei mages sogar, dass sie gszl Sololaner sind und Fähigkeiten haben auf sich aufzupassen, sodass man als Supporter offensivere Champs wie {{champion:26}}, {{champion:555}} , {{champion:43}} oder {{champion:9}} spielen kann und die gegnerische Lane zu tode poken kann.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T12:51:18.297+0000","up_votes":1,"down_votes":3,"body":"Der Magier macht nicht das gleiche wie ein Schütze. Magier haben  viel mehr LP als ein Schütze da bring Heilung weniger. Schild werden immer mit Bewegung oder AD + gegeben. Was will ein Magier mir AD ? .","replies":[{"poster":"Jura500","date":"2018-08-10T14:17:40.990+0000","up_votes":1,"down_votes":0,"body":"> Magier haben viel mehr LP als ein Schütze da bring Heilung weniger. \n\nDas stimmt einfach mal nicht.\n[Hier](http://leagueoflegends.wikia.com/wiki/List_of_champions/Health) findest du eine Liste mit den HP von allen Champions.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T14:37:48.577+0000","up_votes":1,"down_votes":1,"body":"ist das dein ernst  will ich sehen wenn du Darius spielt mit 2 k hahah","replies":[{"poster":"Jura500","date":"2018-08-10T15:53:02.529+0000","up_votes":2,"down_votes":0,"body":"Base HP?! auf darius stackt man auch hp. Auf ADCs und mages eher nicht so.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T15:55:09.804+0000","up_votes":1,"down_votes":1,"body":"hast du doch dein Antwort ^^","replies":[{"poster":"Jura500","date":"2018-08-10T16:01:56.948+0000","up_votes":2,"down_votes":0,"body":"Ehhm was? Dein Argument war, dass Mages viel mehr HP haben als Schützen. Ich zeige dir, dass es nicht so ist und du kommst mit darius? Du bist also scheinbar nicht an einer Diskussion interessiert.\nAlso bist du entweder ein relativ unkreativer Troll oder du bist nicht in der Lage Argumente zu verstehen beziehungsweise selber zu argumentieren.\nIch hoffe einfach mal für dich, dass du ein Troll bist.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Megamaexx","date":"2018-08-10T11:40:28.818+0000","up_votes":2,"down_votes":0,"body":"Magier als ADC ist ineffizient. Einem Ryze bringt AD einfach nix.\nIch habe aber mal nachgeschaut und der Ryze hat auf AP gespielt, also alles in Ordnung.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T11:42:02.383+0000","up_votes":1,"down_votes":1,"body":"Also so lange der kein ad Benutzt ist alles gut ?\nSupporter Haben Fertigkeiten und  Gegenstände für Schützen.\nBewegung- angriff Speed usw.","replies":[{"poster":"Megamaexx","date":"2018-08-10T11:54:05.951+0000","up_votes":4,"down_votes":0,"body":"Was nix daran ändert, dass er ganz normal gespielt hat. Jeder Spieler sollte eben sein Itembuild entsprechend der Champions anpassen.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T12:09:50.328+0000","up_votes":1,"down_votes":1,"body":"hab ich gesagt das der nicht normal gespielt hat ?\naber halt sinnlos für Support","replies":[{"poster":"Amycos Cyrus","date":"2018-08-10T12:18:19.345+0000","up_votes":3,"down_votes":0,"body":"Was meinst du mit nicht normal?\n\nUnd das einzige Item das aktiv Stats vergibt ist Ardents. Das baut man halt als Support nicht, wenn man keinen Carry unterstützt, der die Stats braucht. (hat man früher ja auch nicht mit Champions wie Jhin als Carry gemacht.)","replies":[{"poster":"ZlKingKong","date":"2018-08-10T12:24:35.471+0000","up_votes":1,"down_votes":1,"body":"Megamaexx  hat geschrieben ,dass  er ganz normal gespielt hat. Aber hab doch nicht geschrieben  das er nicht normal gespielt hat.","replies":[{"poster":"OT Riku","date":"2018-08-10T15:23:06.003+0000","up_votes":1,"down_votes":0,"body":"Naja du meintest der Ryze hätte als Adc sprich für uns als  Schütze sprich mit Ad items gespielt.\nDies hat er nicht also ist doch alles gut gelaufen.","replies":[{"poster":"ZlKingKong","date":"2018-08-10T15:26:54.973+0000","up_votes":1,"down_votes":1,"body":"ich meine das ein Magier und Support nicht passen\ndabei kommt noch 2 AP","replies":[{"poster":"OT Riku","date":"2018-08-10T15:57:49.372+0000","up_votes":1,"down_votes":0,"body":"Und wieso sollte es nicht passen???\nDann spielt hat der Midlaner  eine Ad Champ oder der top und jgler wasn das Problem. \nUnd wenn halt der konstante Schaden fehlt den Ryze Übrigens hat. \nDann nimmt man halt cassio die hat auch konstanten Schaden.","replies":[]}]}]}]}]}]}]}]}]}]}