{"poster":"Artiko","date":"2017-02-09T12:27:55.601+0000","title":"Proposta PL ranked","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"Non so se la sezione &egrave; giusta ma onestamente non essendo un frequentatore di questo forum e non vedendo nelle categorie un posto dove proporre idee, chiedo qui alla Riot se fosse possibile inserire un &quot;premio/risarcimento&quot; di 1 PL ogni volta che una partita viene annullata, 1 PL non &egrave; niente d&#039;importante ma il nostro tempo a volte si e perdere 20 minuti ogni volta con 4-5 partite annullate di fila &egrave; pesante.\r\nSo che chi lascia la partita perde punti, per&ograve; questo non &egrave; di aiuto a chi invece poverino gli tocca subire il torto, come unica &quot;condizione&quot; metterei che i punti PL non vengono assegnati ai giocatori &quot;premade&quot;, per evitare scalate strane tramite abbandono delle partite a vantaggio dei compagni. Idea semplice e carina a mio parere.","replies":[{"poster":"Jeanne dˆArc","date":"2017-02-09T13:06:37.031+0000","up_votes":2,"down_votes":0,"body":"Contrario. La partita viene considerata \"non disputata\" e nessuno perde/vince nulla, ad eccezione dell'afk. Prima se avevi l'afk in team dal primo minuto, andavi verso una sconfitta certa, con la conseguente perdita di LP. Ora ti viene data la possibilità di ricominciare la partita, direi che questo basta e avanza come premio di consolazione. Che poi detto tra noi, io tutti questi remake di fila non me li sono mai beccati.","replies":[]},{"poster":"Yoriyoshi","date":"2017-02-09T15:56:02.392+0000","up_votes":1,"down_votes":0,"body":"Chiedi anche se ti danno un bonus al terzo quit, magari 3+2. {{item:3070}}","replies":[]},{"poster":"Dissociated","date":"2017-02-09T14:28:22.019+0000","up_votes":1,"down_votes":1,"body":"La tua proposta non mi convince, però potrebbero rispedire i 9 giocatori nella stessa lobbi, con champ lockati e tutto già fatto, e viene invitato il decimo giocatore che ha 1 minuto per prendere un champ e parte la partita.","replies":[{"poster":"IHateTheSmurfing","date":"2017-02-09T14:30:56.086+0000","up_votes":1,"down_votes":0,"body":"Non ha senso\n1)ciò comporta che io devo aspettare altri 5 min\n2)Se le persone dopo 3 min di game, vedono che non possono vincere quel matchup, posso poi decidere di uscire dalla chanp select e perdere solo 3 p.\n3)La persona sarà obbligata a giocare un game senza aver dato voce in capitolo ,per quanto riguarda i ban ,lane da giocare (per possibili scambi per autofill) e team comp.","replies":[]}]},{"poster":"Asvalon","date":"2017-02-09T13:07:50.954+0000","up_votes":1,"down_votes":0,"body":"Certo, così ogni circa 20 remake è come se avessi avuto una partita vinta a gratis... no grazie xD","replies":[{"poster":"FuryTheFenix ITA","date":"2017-02-09T13:57:22.198+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Asvalon,realm=EUW,application-id=MJVj50Jw,discussion-id=6QL1WsU5,comment-id=0002,timestamp=2017-02-09T13:07:50.954+0000)\n>\n> Certo, così ogni circa 20 remake è come se avessi avuto una partita vinta a gratis... no grazie xD\n\nMai fatti 20 remake da quando l'hanno introdotto, anche se sono d'accordo con te.","replies":[]}]},{"poster":"markmask","date":"2017-02-09T13:01:05.066+0000","up_votes":1,"down_votes":0,"body":"Molto bella come idea. Il problema è... come azzo la facciamo leggere alla Riot?","replies":[]}]}