{"poster":"Ryukito","date":"2016-02-10T19:27:46.870+0000","title":"Bug maestrie in dynamicQ","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Non so quale &egrave; il posto giusto e a chi far notare un bug che si riscontra durante il pick in dynamicQ, riguardo la selezione delle maestrie.\r\nSpiego passo dopo passo ci&ograve; che ho fatto:\r\n1 - Ho modificato una pagina di maestrie (prendiamo come esempio la pag. n. 1)\r\n2 - Ho modificato un&#039;altra pagina di maestrie (prendiamo come esempio la pag. n. 2)\r\n3 - Sono tornato nella Home del client di Lol lasciando selezionata la pag. n. 2\r\n4 - Sono entrato in coda classificata\r\n\r\nAl momento del pick avevo settato come default la pag. n. 1, che avevo intenzione di usare. Ho lasciato tutto com&#039;era senza toccare niente. Ho pickato e confermato.\r\nNella schermata caricamento pre-partita mi sono accorto che la pagina selezionata non era la n. 1 ma la n. 2. Ho pensato di aver confuso nella modifica delle maestrie, ma era tutto ok. Controllo e ricontrollo pi&ugrave; volte la selezione delle rune e delle maestrie prima di entrare in game, perci&ograve; un errore di svista non &egrave; stato e se non c&#039;&egrave; bisogno entro in partita senza toccare niente.\r\nHo fatto un altro game e ho notato che, aprendo il tooltip delle maestrie, la pagina n. 1 e la pagina n. 2 sembravano non aggiornate, come se non avessi apportato nessuna modifica. In questa partita per&ograve; ho usato tutt&#039;altre maestrie (andandole a selezionare manualmente) e non so cosa sarebbe successo in game. Probabilmente basta un riavvio del client. Ma la cosa non &egrave; chiara.","replies":[{"poster":"Groox II","date":"2016-02-10T19:55:49.319+0000","up_votes":2,"down_votes":0,"body":">3 - Sono tornato nella Home del client di Lol lasciando selezionata la pag. n. 2\n\nSicuro di non aver usato quella pagina di maestrie?\nPerché se nel client metti su una pagina, quando sei in selezione campioni, di default ti rimane quella.\n\nP.S. Esiste la sezione \"aiuto e supporto\" per segnalazioni simili.","replies":[{"poster":"Ryukito","date":"2016-02-10T20:16:12.912+0000","up_votes":1,"down_votes":0,"body":"Il fatto della selezione nel client e di default nel pick la so, per questo controllo e ricontrollo prima di entrare in game. I miei nomi rune-maestrie combaciano sempre, quindi è anche facile ad occhio capire il set da utlizzare. Andando a guardare le statistiche avevo rune giuste e maestrie sbagliate (quindi rune-maestrie con nome differente).\nOk prossima volta scrivo in \"aiuto e supporto\" grazie.","replies":[{"poster":"Groox II","date":"2016-02-10T23:40:48.856+0000","up_votes":2,"down_votes":0,"body":"Ah, forse ho capito. Per caso avevi guardato dal client le maestrie di un altro evocatore?\nPerché sì, è buggato. Se guardi le maestrie (forse anche rune, non ricordo) di qualcuno e poi entri in selezione campione ti segna i nomi delle rune di quello.","replies":[]}]}]}]}