{"poster":"Geis Lieh","date":"2016-07-10T12:24:59.601+0000","title":"[Champion Idee] Vanarion - der heilige Krieger","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":0,"body":"* Geschichte:\n\n&gt; In Demacia gibt es einen Orden der sich &auml;hnlich verh&auml;lt wie eine Art Kirche. Sie beten das Licht an und bieten auch an der Akademie f&uuml;r Magie Lichtmagie f&uuml;r Auserw&auml;hlte an. So auch Lux. Jedoch gibt es auch f&uuml;r jene, die nicht so begabt sind wie Lux den Pfad des Lichtes. Nur dieser Pfad ist ein Weg, der viele Gefahren birgt und nicht alle diesen Pfad &uuml;berleben. Es gilt sich der Erleuchtung hin zu geben und nur ein kleiner Fehltritt kann zur Verbannung des Ordens dienen. Viele Pr&uuml;fungen sind k&ouml;rperlich Anstrengend und andere Geistig Anstrengend um einen Krieger des Lichtes zu erschaffen. Doch selbst die die diese Pfade gemeistert haben, m&uuml;ssen einsehen, dass sie nur am Anfang des Lichtes stehen. Eines Tages jedoch hatte es ein 14 j&auml;hriger Junge geschafft das Aufnahmeritual des Lichtes zu bestehen. Vanarion, der kleine Junge, schaffte es in der h&auml;lfte der Zeit als die anderen Pr&uuml;flinge. Normaler Weise w&uuml;rde der Pfad des Lichtes um einen Paladin oder Kleriker zu werden mehr als 10 Jahre dauern, wobei das schon als talentiert gilt. Vanarion hingegen schaffte es mit 18 den Pfad gesegnet und gereinigt zu verlassen und mehr noch seine sonstigen braunen Augen hatten nun das Strahlen des Lichtes in ihm. Man gab ihn den Titel des Paladins und einige Jahre sp&auml;ter schaffte er es sogar seine Meister zu &uuml;bertreffen. Die &Auml;ltesten Paladine und Kleriker entschieden, das er der Jenige sein muss, der die Welt vom Schatten befreien wird. Als Paladin wurde man in jedem Land eingesetzt um das Licht zu verbreiten und Ketzer auszumerzen. Zudem musste ein Paladin sich selbst weihen und immer dann Bu&szlig;e tun wenn er etwas falsches tat. Vanarion war der erste Paladin der nie einen Menschen, einen Tier oder sogar einem Wesen aus der Leere ohne ein Gebet zu richten. \n\n* Aussehen:\n\n&gt; * Vanarion besitzt braunes Haar. Er verzieht nie die Mine und hat gelbleuchtende Augen. Seine R&uuml;stung ist eine Paladinsr&uuml;stung mit einem gro&szlig;en Brustpanzer und goldenen Gravierungen. Seine Arme und Beine jedoch sind nur mit d&uuml;nner Panzerung versehen. Zudem Besitzt er ein Schild, welches ein normales 3 Ecken Schild ist mit den Logo des Lichtes. Seine Waffe ist eine Pike, die eine Goldene Klinge hat. Jedes mal, wenn er einen Gegner richtet (t&ouml;tet), wird er kurz die Augen schlie&szlig;en und den Kopf neigen, was symbolisierend daf&uuml;r steht, das er dem Toten trotz seiner Fehler verzeiht.\n\n* F&auml;higkeiten:\n\n* &gt; Segnung des Lichtes/ Strafe des Lichtes:\n\n&gt; Jedes Mal wenn Vanarion einen Verb&uuml;ndeten heilt oder sch&uuml;tzt, wird dieser vom Licht gesegnet. Dies erh&ouml;ht die R&uuml;stung und Magieresistenz des Verb&uuml;ndeten um einen Wert, der 20% der R&uuml;stung und Magieresistenz von Vanarion entspricht die Segnung h&auml;lt 3 Sekunden an.\nJedes Mal wenn Vanarions F&auml;higkeiten Gegner Schaden zuf&uuml;gen, verringert sich deren R&uuml;stung und Magieresistenz um 20% f&uuml;r 3 Sekunden.\n\n* Q: Strahlender Schild (Abklingzeit 10 Sekunden) (Kostet 60 Mana)\n\n&gt; Vanarion l&auml;sst sein Schild Strahlen f&uuml;r 3 Sekunden. Die Strahlen fallen in gerader Richtung auf die Maximale Reichweite hin zu. Gegner die in diesen Strahlen rein Laufen oder schon in den Strahlen stehen f&uuml;r 1,5 Sekunden geblendet. Die ganze Zeit &uuml;ber erleiden Gegner alle 0,5 Sekunden magischen Schaden. Vanarion kann sich w&auml;hrend dessen bewegen, jedoch verliert er 30% Lauftempo, jedoch geht die F&auml;higkeit mit ihm.\n(Magischer Schaden pro 0,5 Seknunden 20/25/30/35/40 + 20% F&auml;higkeitsst&auml;rke)\n\n* W: Heilige Worte (Abklingzeit 12 Sekunden) (Kostet 70 Mana)\n\n&gt; Passive: Vanarion erh&auml;lt durch jeden get&ouml;teten Gegner, der von ihm gerichtet wurde 10 Leben und 5 Mana zur&uuml;ck. Wenn ein Verb&uuml;ndeter einen Gegner richtet, erh&auml;lt er hingegen nur 5 Leben und kein Mana.\nAktive: Vanarion spricht ein Gebet dabei heilt er Nahe Verb&uuml;ndeten und gibt ihnen f&uuml;r 2 Sekunden 5/10/15/20/25 Angriffschaden (+2 je 300 Leben von Vanarion)\n(Heilung: 50/60/70/80/90 + 2% maximalen Lebens von Vanarion / wenn Verb&uuml;ndeter weniger als 40% Leben hat wird er stattdesesn um 50% mehr geheilt)\n\n* E: Reflektierender Schild (Abklingzeit 18 Sekunden) (Kostet 100 Mana)\n\n&gt; Vanarion macht sich bereit f&uuml;r 5 Sekundenmit seinen Schild um den n&auml;chsten Skillshot oder Automatischen Fernangriff (selbst wenn das eigentliche Ziel hinter Vanarion steht) zu blocken. Dabei erhöht sich sein Lauftempo um 20% für diese 5 Sekunden oder bis eine Fähigkeit oder Angriff geblockt wurde. Nach 1 Sekunde entfesselt er diesen Skillshot in die Richtung aus der er kam, jedoch mit anderen Schaden und ohne Bonuseffekt von dem Champion. ( d.h. bsp: Kennen wirft den Schuriken, dieser wird geblockt und nach 1 Sekunde fliegt der den gleichen Einfallswinkel wieder zur&uuml;ck, jedoch ohne die Passive von Kennen oder Gegenst&auml;nde von Kennen einzusetzten) Zudem werden Gegner für 1 Sekunde betäubt und für 2 weiter Sekunden um 25% verlangsamt. Wenn es ein Automatischer Angriff war, der geblockt wurde, verringert sich die Abklingzeit von Reflektierender Schild um 6 Sekunden, jedoch fliegt der Schuss nicht zur&uuml;ck. Wenn er keinen Skillshot ofer Automatischen Fernangriff geblockt hat tut er Bu&szlig;e, was seine F&auml;higkeitsabklingzeit von allen F&auml;higkieten um 1 Sekunde erh&ouml;ht.(Skillshots wie die Salve von Ashe und Co Kg werden ebenfalls reflektiert.)\n(Magischer Schaden des reflektierten Skillshots: 60/80/100/120/140 + 50% F&auml;higkeitsst&auml;rke)\n\nR: Strahlende Pike (Abklingzeit 30 Sekunden) (Kostet 60 Mana)\n\n&gt; Passive: Vanarions Pike beginnt zu strahlen. Wenn er nun einen automatischen Angriff ausf&uuml;hrt, verursacht er an dem gegner sowie an nahen Gegner 20/30/40 magischen Schaden(+1,5 % maximalen Leben von Vanarion) extra zu.\nAktive: Vanarion wirf die Pike in ein Zielgebiet. Wenn diese landet, werden alle Gegner durch das heftige Strahlen Orientierungslos und fliehen 1 Sekunde von der Mitte der Pike nach außen. Dabei bleibt diese in der Mitte des Gebietes Stecken und strahlt heftiger. Dabei verursacht das strahlen an allen Gegner 40/60/80 (+4 % maximalen Leben von Vanarion) magischen Schaden pro Sekunde zu. Die Pike strahlt 5 Sekunden lang danach klingt das strahlen ab. Zudem kann Vanarion die Pike w&auml;hrend sie str&auml;hlt aufheben und wandert mit dem Wirkungsbereich mit. W&auml;hrend die Pike heftiger strahlt, verliert er die passive der Pike.\n\n\n* Schlusswort:\n\n&gt; Vanarion soll als einen Heilenden Support gespielt werden, der auch tanky werden sollte. Durch seinen Reflektierenden Schild bringt er zudem eine neue Mechanik mit sich. \n\n&gt; Ich hoffe ihr schaut auch meine anderen Champion Ideen an:\n1. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/MxZTbAwl-champion-idee-glacignis-die-eisflamme\n2. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/fpI6VUhz-champion-vorschlag-chuhuang-schasse-des-osten\n3. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/17N7Bn2c-gloriose-champion-idee-marko-das-spielzeugchaos\n4. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/b5ElAbuG-champion-idee-tenebris-fluch-der-finsternis\n5. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/cIYgqjPi-champion-konzeption-luissa-die-runenseherin\n6. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/p9RPHfIs-champion-idee-sedrik-geist-der-todeskaalte\n7. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/ukQLuyGf-champion-idee-krent-the-curse-of-the-hydra-der-fluch-der-hydra\n8. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/0h0AEHH8-champion-vorschlag-nieves-die-schneewaterin\n9. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/1P3mJBPK-champion-vorschlag-varkom-verderber-der-masken\n10. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/8WRIrmfN-champion-idee-rakos-der-druide-der-natur\n11. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/Zh6QElVy-champion-idee-seth-gestalt-des-chaos\n12. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/66ZePfad-champion-vorschlag-tiron-der-belagerungsmeister\n13. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/vWbti1b4-champion-idee-vincent-der-gequaalte-maler\n14. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/qPI1PBbI-champion-vorschlag-markalon-der-mantikor\n15. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/jtY7848X-champion-konzept-suru-herr-der-schreckenselefanten\n16. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/rskJnIPj-champion-vorschlag-greck-der-golembeschwarer\n17. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/rskJnIPj-champion-vorschlag-greck-der-golembeschwarer\n18. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/EL8qG6No-champion-vorschlag-lanrod-der-gewaltige\n19. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/NGnVMco8-championvorschlag-panschu-der-vergessene-eremit\n20. http://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/RzyLA6ef-champion-vorschlag-aello-die-hoffnung-der-harpyien\n21. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/jRVkwPzi-champion-vorschlag-moriun-der-sklaventreiber-aus-der-leere\n22. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/4MRFToTw-champion-konzept-doran-der-wunderschmied\n23. http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/TWnTRE95-championvorschlag-banto-der-ewige-fels\n\nSo ich hoffe euch gef&auml;llt Vanarion, falls ihr Kritik anbringen wollt tut dies in den Kommentaren. Danke f&uuml;r eure Zeit des Lesens.\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"ShadowKiddy","date":"2016-07-11T16:44:44.582+0000","up_votes":1,"down_votes":0,"body":"Zu dem Champion ich denke er sollte sich mit der W auch selber heilen können, und 10 leben und 5 mana auf der passiven der W klingen extrem useless :/\nStory ist richtig schön *-* Dann könnte ich ihn mir als Toplaner wie Shen,Kayle oder so vorstellen ;)","replies":[{"poster":"Geis Lieh","date":"2016-07-11T18:21:04.820+0000","up_votes":1,"down_votes":0,"body":"die W kann auch ihn heilen :) jedoch ist die Passive pro Gegner egal welcher Gegner zu verstehen und aus dem Grund wollte ich den spontan heal nicht zu hoch setzten. Ja um ehrlich zu sein wollte ich einen botlane Champ erschaffen aber ich glaube es ist etwas anderes.\nDanke aber für den Kommentar","replies":[]}]},{"poster":"KingDanius","date":"2016-07-10T22:04:03.606+0000","up_votes":1,"down_votes":0,"body":"Alsoooo.\nZuerst mal, ist die Idee nicht schlecht.\nJedoch hat der Champion keine feste Rolle. Als suppotzer besitzt er lediglich einen heal. Passive sowie W passiv hören sich seeeehr schwach an. (lieber 20% und dafür kürzer.)\nUnd mir ist nicht so ganz klar, ob mit der W passiven Nur Champions, oder alle Gegner gemeint sind. Das eine wäre lmega schwach, das andere wiederum sehr stark.\n\nQ, E sowie R bringen dir als Support rein gar nichts. Für mich würde der Champion deutlich besser in die toplane passen, wobei er dort auch nicht ganz hinpasst.\nKeine Gapclosrt, kein CC = nutzlos.\n\nAusserdem ist die Rechtschreibung oftmals..sagen wir mal nicht perfekt :D.\n\nBitte nicht böse nehmen, aber wenn er als Support designed wurde, so sollte er für seine Rolle deutlich mehr utility mitbringen.\n\nDu kannst dir ja mal meinen Champion Vorschlag ansehen und mir deine Meinung dazu sagen ^^ (sogar mit Champion Modell\n\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/sMsBwX9L-champion-vorschlag-uon-der-gefangene-des-berges","replies":[{"poster":"Geis Lieh","date":"2016-07-11T14:53:40.368+0000","up_votes":1,"down_votes":0,"body":"mhh joa das mit der Rechtschreibung ist mir eh Latte:) ehm ich hab den etwas überarbeitet und deinen Vorschlag von 20% mit reingenommen da ich merkte, das 5% recht wenig sind. Ich habe zudem mal einen Slow mit eingepackt beim reflektieren und einen Stun. Zudem einen kurzen Tempo boost. Da ich nicht wollte das dieser Champion wie viele andere Supporter zu einer anderen Position ziehen kann. \nDanke für das Feedback und ich guck mir grade deinen Champion an","replies":[{"poster":"KingDanius","date":"2016-07-11T15:14:10.113+0000","up_votes":1,"down_votes":0,"body":"Und die Ulti solltest du auch noch mal ein wenig überdenken.\n\nDenn eine Supporter Ulti, welche NUR Schaden, passiv sowie aktiv, macht, kann von so ziemlich jedem ignoriert werden.\nDer Bereich des Wurfgebietes sollte auf jeden Fall gefährlicher für die Gegner sein. \nEntweder stiehlt die Ulti Leben und verteilt es an alle nahen Verbündeten (ähnlich wie Sion's alte Ulti) oder sie hat mehr CC/utiliy.\n\n(Sogar BLITZ' Ulti hat nen kleinen Silence.. ^^)","replies":[{"poster":"Geis Lieh","date":"2016-07-11T16:14:03.988+0000","up_votes":1,"down_votes":0,"body":"Hab ein kleinen Buff hinzugefügt/ CC","replies":[]}]},{"poster":"KingDanius","date":"2016-07-11T15:05:49.126+0000","up_votes":1,"down_votes":0,"body":"Kein Problem und Danke auch ^^","replies":[]}]}]},{"poster":"ShadowKiddy","date":"2016-07-10T20:33:42.695+0000","up_votes":1,"down_votes":0,"body":"Hast einen 2 mal verlinkt xD","replies":[]}]}