{"poster":"Geis Lieh","date":"2017-03-06T17:59:49.036+0000","title":"[Championvorschlag] > Marax, die Lebende Hölle<","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":0,"body":"* Geschichte:\n\n&gt; Fern ab von der Welt Valorans, gibt es einen Ort, der von den Forschern Runeteras erfasst wurde und als &bdquo;H&ouml;llenplanet&ldquo; bekannt wurde. Dieser Planet besteht zu 80% Aus Vulkanw&uuml;sten. Der Rest des Planeten, ist mit fl&uuml;ssigen Magma umgeben. Zudem war das Magnetfeld des Planeten gest&ouml;rt, sodass viele Felsen, Berge und Vulkane ohne Kontakt zum Festen Kontinent oder der Magma schwebten. Dieser Planet faszinierte die Forscher, sie wollten sogar sehns&uuml;chtigst dorthin gelangen. Um Proben zu sammeln. So gingen sie zur Liga um von denen Hilfe zu erlangen. Doch ohne dass sie es wussten, lebte auf diesem Planeten etwas. Ein Volk, welches sich von Lava ern&auml;hrt. Die D&auml;rinome. Sie waren Barbarische Gestalten, die sich mittels Magie und brutalster Kraft Gegenseitig bek&auml;mpften. Sie besa&szlig;en auch einen guten Verstand und passten sich an ihre Feinde an, um m&ouml;glichst h&auml;ufig den Feind zu t&ouml;ten. So geschah es wie der Zufall es so wollte, dass die Kreatur Marax von den Beschw&ouml;rern der Liga auf Valorans Erden gerufen wurde. Dieser verwirrt, wutentbrannt und hasserf&uuml;llt wie er war, wollte er gleich alles um ihn herum vernichten. Doch einer der Beschw&ouml;rer war schneller. Jedoch Marax zur&uuml;ck zu schicken brandmarkte er Marax, sodass dieser den Ort, auf den er Beschworen wurde nicht verlassen vermochte. Jahre vergingen bis andere Beschw&ouml;rer aus langeweile Marax f&uuml;r die Liga beschw&ouml;ren wollten.\n\n\n* F&auml;higkeiten:\n\n* Passive: &bdquo;H&ouml;llenflammen&ldquo;\n\n&gt; Nach der Aktivierung einer F&auml;higkeit beginnt Marax Flammende Hitze auszustrahlen f&uuml;r 5 Sekunden. Nahe Gegner erleiden dabei Magischen Schaden. Wenn er w&auml;hrend der Aktivierung von &bdquo;H&ouml;llenflammen&ldquo; nochmals eine F&auml;higkeit einsetzt, frischt er die Laufzeit von &bdquo;H&ouml;llenflammen&ldquo; wieder auf.(Magischer Schaden pro Sekunde: 6 + 3/pro Lvl + 1,5% Marax maximalen Lebens)\n\n&gt; Rescourcenpassive: Marax benutzt die Recource &bdquo;Rage&ldquo;. Maximal hat er 5 &bdquo;Ragepunkte&ldquo;. Marax erh&auml;lt durch manche F&auml;hgikeiten Rage oder durch jeden 7ten Automatischen Angriff. Wenn er 5 Ragepunkte erreicht hat, erh&ouml;ht sich sein Angriffsschaden um 15% und sein Angriffstempo um 40%. Zudem regeneriert Marax während dieser Zeit Leben in Höhe von 3% seines Maximalen Lebens)f&uuml;r die n&auml;chsten 7 Sekunden.  \nWenn Marax 20 Sekunden lang nicht mehr Infight ist verliert er sämtliche Ragepunkte.\n(Das mit der 7 Ist bewusst genommen, da es ja angeblich 7 S&uuml;nden des Menschen gibt dachte ich die Zahl w&auml;re geil)\n\n* Q: &bdquo;Teufelszunge&ldquo;\n(Erzeugt 1 Ragepunkt)(Abklingzeit: 9 Sekunden)\n\n&gt; Marax l&auml;sst seine Waffe gl&uuml;hen. Beim n&auml;chsten normalen Angriff, wird die Erde beginnend mit dem Ziel erzittern, was Gegner hinter dem Ziel sowie das Ziel normalen Schaden zuf&uuml;gen l&auml;sst. Zudem entsteht eine Narbe in der Landschaft, die Gegner um 40% verlangsamt. Diese Narbe bleibt 5 Sekunden bestehen. (Normaler Schaden: 40/55/70/85/100 am Ziel + 25% der Gesamt Ad und der Gegner der via den Autohit getroffen wurde erhält Schaden in Höhe von 4% des Maximalen Lebens Marax und löst bei diesem Ziel Treffereffekte aus)\n\n* W:  &bdquo;Grimmige Erscheinung&ldquo;\n(Erzeugt 1 Ragepunkt)(Abklingzeit: 19 Sekunden)(2ter Sprung nach bis zu 4 Sekunden benutzbar)\n\n&gt; Marax verschwindet von seiner Position und taucht am Zielpunkt auf.  Gegner die bei diesem Zielpunkt stehen, erleiden normalen Schaden. Falls Marax einen Champion trifft, kann er diese F&auml;higkeit nochmals nutzen, jedoch halbiert sich der Schaden und es wird kein 2ten Ragepunkt erzeugt .\n(Normalen Schaden: 60/90/110/130/150 + 40% Angriffsschaden) Range: 600\n(2ter Sprung: 30/45/55/65/75 +20%Angriffsschaden) Range: 400\n\n* E:  &bdquo;Sengende Hitze(Passive)/ D&auml;monisches Inferno (Aktive)&ldquo;\n(Abklingzeit: 12 Sekunden) \n\n&gt; Passive: Gegner, die von H&ouml;llenflamme oder von D&auml;monisches Inferno getroffen werden, verlieren 2,5 R&uuml;stung/Magieresisstenz. Jeder Tick von H&ouml;llenflamme stackt diesen Effekt bis zu 5 mal.\n&gt; Aktive: Der angeklickte Gegner wird mit &bdquo;D&auml;monisches Inferno&ldquo; belegt. Dieser wird das Epizentrum von &auml;hnlichen Flammenwellen, wie H&ouml;llenflamme, die jedoch nur ihn und seinen Verb&uuml;ndeten 3 Sekunden lang jede Sekunde Schaden zu f&uuml;gen.\n(Schaden am Epizentrum: 2% / 4% / 6% / 8% / 10% des maximalen Lebens  als Magischen gesamt Schaden + je 1% pro 60 F&auml;higkeitsst&auml;rke + 1 % pro 70 Zus&auml;tzlicher Angriffsschaden)\n(Schaden an umliegende Gegner: 30% des Wertes vom Epizentrum jedoch gleiche AD und AP Skalierung)\n(Sollte der Gegner der als Epizentrum makiert ist sterben, gewinnt Marax ein Ragepunkt und die Abklingzeit geht um 40% runter)\n\n* R: &bdquo;Teufelsgrimm&ldquo;\n(Erzeugt sofort 2 Ragepunkte) (Abklingzeit: 70 Sekunden)\n\n&gt; Passive: Wenn Marax 5 Ragepunkte hat ist der Radius von H&ouml;llenflammen um 50% erh&ouml;ht.\n\n&gt; Aktive: Marax feart Nahe Gegner sofort f&uuml;r 1,5 Sekunden. Zudem erleiden erleiden Gegner vor ihm in einem F&auml;cherradius Schaden. Zudem erhalten Gegner die vom Schaden der Ultimate getroffen wurden \"Quälgeist\", welcher für 10 Sekunden bestehen bleibt.\n\"Quälgeist\": Erhöht Schaden von Höllenflamme und Dämonisches Inferno um 50% an den Markierten Zielen.\n(Sofortiger Schaden: 120/150/180 magischer Schaden + 37% Gesamt Angriffsschaden/30% Gesamt F&auml;higkeitsst&auml;rke)\nFächerrange: 400\n\n* Aussehen:\n\n&gt; Mhh ja wie soll den Wohl ein D&auml;mon aussehen. Nat&uuml;rlich D&auml;monenhaft^^ Da ich nicht gut zeichnen kann, aber eine Idee, wie er K&ouml;rperlich aussehen k&ouml;nnte habe, zeige ich euch ein Bild, welches ihr unter diesem Link finden werdet:\nhttp://www.maps4heroes.com/heroes5/pictures/inferno/HOMM5_Inferno_Horned_overse.jpg \n\n&gt; Seine Waffe soll ein Zepter sein, welches Mit Blut und Rost nur so verschmiert ist. Dieses Zepter schwingt er wie eine art Axt.\n\n\n\n\n* Schlusswort\n\nIch bedanke mich erstmal an diejenigen, die sich Zeit nehmen mein Konzept durch lesen zu wollen. Falls ihr Verbesserungen habt oder ihr den Champion doof findet, k&ouml;nnt ihr gerne unter diesen Text kommentieren, bis euch nichts mehr einf&auml;llt. {{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"INoKami","date":"2017-03-07T17:14:53.462+0000","up_votes":2,"down_votes":0,"body":"Nette Idee, hier mal ein bisschen meine Gedanken zu deinem Vorschlag:\n\nPassive: Hört sich auf den ersten Blick wie die ehemalige Alistar-Passive an, aber passt soweit. Vielleicht etwas mehr Schaden, weil auf Lvl. 18 macht die 60 Schaden/Tick -> 180 Dmg gesamt...\n\nRessource: Klingt gut, auch wenn ich den Bonus als etwas zu gering sehe, als dass er hilfreich wäre. Also auch hier etwas hochschrauben.\n\nQ: Bis auf wieder mal etwas mehr Schaden gefällt die mir.\n\nW: Passt auch soweit (nur ein ganz kleinen Ticken Schaden mehr xD ), allerdings fehlt mir hier die wichtigste Angabe: Die Reichweite. Die entscheidet, ob diese Fähigkeit nutzlos (-> Knockback der Graves-Ult) oder abartig OP (-> Frühere Kassadin-Ult) sein wird.\n\nE: Die Passive ist nutzlos. Im Lategame sind 7,5 Rüstung/Magieresistenz gar nichts. Außer auf dem ADC vielleicht, aber wenn er 5 Stacks davon angesammelt hat dürfte er eh schon so gut wie tot sein. Entweder hochschrauben oder komplett rauswerfen.\nDie Aktive: Passt. Sogar von den Zahlen her ;)\n\nR: Auch hier hängt vieles von der Reichweite ab. Hier sehe ich eher das Problem, dass der Fear zu groß sein wird. 2,5 Sekunden AoE-Fear? Gibt Gründe, warum man selbst auf Single-Target-Fears (z.B Fiddle) solche Zahlen nicht mehr sieht. Leona-Ult geht ja auch nur 1 Sekunde. Ich stelle mir bei sowas gerne vor, dass man den Champion mit z.B. Nunu in ein Team wirft und beide mal ulten lässt. Bei gutem Timing hat man also nur eine halbe Sekunde, um da rauszukommen. Und die durchschnittliche menschliche Reaktionszeit beträgt ca. 1 Sekunde. Du verstehst, worauf ich hinaus will?\n\nGeschichte: Maße ich mir nicht an, zu bewerten. Meine sind meistens auch nicht besser^^\n\nDas wär´s so im Groben. Mach dir keinen Kopf um die Zahlen, auch wenn ich wie ein Specht drauf rumgehackt habe, hier geht es ums grobe Konzept. Und das finde ich nett, bis auf eine Sache: Mir fehlt ein bisschen Einzigartigkeit. Ein Grund, warum ich jetzt gerade diesen Champ hier den anderen 130 vorziehen sollte. Die Fähigkeiten passen zwar zum Konzept, aber ich hoffe du verstehst, was ich sagen möchte.\n\nAber sonst mag ich die Idee als Ganzes. Ernsthaft.\nSchönen Tag noch!\n\nIncaedeus\n\n_Na, das ist ja mal ´ne Verabschiedung. Welcher Lappen würde denn sowas schreiben? ...Oh, warte... f*ck...\nMir fiel halt sonst nichts mehr ein xDDD     Sry dafür!_","replies":[{"poster":"Geis Lieh","date":"2017-03-07T17:28:43.498+0000","up_votes":1,"down_votes":0,"body":"Da hat sich ja jemand Zeit genommen:) Danke erstmal^^\nJa das mit der Skalierung wird ja eh von rito verändert egal welcher Fähigkeit oder Passiven entsprechend^^ \nÜberarbeiten müsste ich hingegen die W, hatte vergessen Reichweite einzubauen^^\nDer Schaden der Passive Höllenflamme wollte ich anfangs mit Lebenskalierung machen vielleicht tue ich das auch^^\nJa die Recourcen Passive tu ich mich bisschen schwer mit ich will des nicht zu Stark machen, vielleicht baue ich da True dmg noch ein mal sehen:) \n\nSomit wieder an den Überarbeitungstisch^^","replies":[{"poster":"Geis Lieh","date":"2017-03-07T17:35:41.301+0000","up_votes":1,"down_votes":0,"body":"Habs mal nochmals überarbeitet danke für die Hinweise:) \nHoffe Rito wird nicht viel dran Rumschrauben","replies":[{"poster":"INoKami","date":"2017-03-07T21:08:22.034+0000","up_votes":1,"down_votes":0,"body":"Klingt schon viel besser!\n\nEine Frage noch: Bei der Ultimate steht, dass der Gegner den Effekt \"Quälgeist\" bekommt. Allerdings kann ich nirgendwo eine Beschreibung davon finden! Hast du vergessen, die zu erwähnen oder bin ich wieder zu blöd zum Lesen? (Tendenz liegt auf Möglichkeit 2, also wie immer -_-)\n\nUnd damit Rito daran rumschrauben kann, müssen sie erst mal unsere Konzepte lesen und sie dann so gut finden, dass sie sie ins Game einbauen wollen. Ist meines Wissens nach so gut wie nie passiert. Aber wir träumen doch alle davon, oder? :)","replies":[{"poster":"Geis Lieh","date":"2017-03-08T06:01:47.554+0000","up_votes":1,"down_votes":0,"body":"Ehm wollte diesen Effekt den ich vorher beschrieben habe, dass Höllenflamme an den Gegnern mehr Schaden macht Quälgeist nennen. Aber danke änder ich mal das man es versteht^^","replies":[]}]}]}]}]},{"poster":"NineNuts","date":"2017-03-07T07:35:21.693+0000","up_votes":1,"down_votes":0,"body":"Cool, aber: Ich  glaub er wär zu schwach mit den Zahlen, ausserdem  ist Rage hier schwer aufzufüllen  und bringt für den Aufwand fast nichts","replies":[{"poster":"Geis Lieh","date":"2017-03-07T14:29:08.466+0000","up_votes":1,"down_votes":0,"body":"Mhhh Das mit dem Dmg war so gewollt, wenn du den Dmg von der Passiven meinst.\nDas mit der Rage kann man ja abändern. \nWollte halt einen Champion der eher auf Offtank gebaut werden würde, als dass er Leute massakriert.","replies":[{"poster":"Pxl Dude","date":"2017-03-07T15:21:05.377+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Geis Lieh,realm=EUW,application-id=L7E6lhzo,discussion-id=PNtcyE7M,comment-id=00000000,timestamp=2017-03-07T14:29:08.466+0000)\n>\n> Mhhh Das mit dem Dmg war so gewollt, wenn du den Dmg von der Passiven meinst.\n> Das mit der Rage kann man ja abändern. \n> Wollte halt einen Champion der eher auf Offtank gebaut werden würde, als dass er Leute massakriert.\n\nAlso wenn der die Leute nicht massakriert bin ich mit meinem Latein am Ende xD\nfangen wir mal mit der Q an: ist das Scaling mit Schaden bewusst weggelassen? und im Late-Game mit einem Autohit der 100 Schaden + z.B. Sheen alle 4,95 Sekunden (bei 45% Cdr) hat man da schonmal nen happigen Batzen Schaden.\nDie W: Auch hier ist der Schaden wieder etwas über die Stränge geschlagen, alle 10,45 Sekunden (wieder 45% Cdr) 150 + 60% der AD ist etwas stark. Hierbei fehlen noch die 10% extra AD, auch bei der Q ist dieser Prozentsatz noch nicht dabei. \nZur E: Passive funktioniert wie Kayle Passive, ist vollkommen in Ordnung. Die E (Aktive) ist auch überladen. 10% der max. HP alle 6,6 Sekunden (mal wieder 45% Cdr) ist einfach nur krass und da sind die extra Prozente von der AD und AP nichtmal dabei.\nBei der Ultimate gilt das Scalingproblem genauso wie bei der E.\n\nMit einem Build wie: {{item:3071}} <{{item:3146}} <{{item:3072}} <{{item:3006}}  <{{item:3812}} <{{item:3078}}  bist du tot bevor du überhaupt einen Spell rauskriegst. So an sich ein gutes Konzept nur die Schadenswerte hättest du überdenken können, aber auf sowas achtet man eher weniger ;D\nHoffe ich konnte dir damit ein paar Anregungen geben!","replies":[{"poster":"Geis Lieh","date":"2017-03-07T17:03:29.780+0000","up_votes":1,"down_votes":0,"body":"Mhh man kann da hier und da noch etwas ändern^^ mal sehen ich hol mal Werkszeugskoffer ;)","replies":[{"poster":"Geis Lieh","date":"2017-03-07T17:13:50.782+0000","up_votes":1,"down_votes":0,"body":"Habs mal eben überarbeitet, sogar die Recourcen Passive etwas verbessert, das Q etwas genervt und verändert das W etwas genervt. \nDas mit der E könnte man wie Kayles Passive sehen, jedoch verringert soweit ich noch weiß, Kayles Passive Prozentual die Resistenzen je Autohit oder Fähigkeit. Bei Marax soll es aber so sein, dass er je Höllenflammenwelle, die der Gegner auch durch Entfernung zu Marax aushebeln kann, der Gegner Stacks erhält.","replies":[]}]}]}]}]}]}