{"poster":"Buttercup","date":"2016-07-05T08:21:19.346+0000","title":"A Clockwork Heart","subforum":"FanFiction","up_votes":2,"down_votes":1,"body":"A Clockwork Heart\r\n\r\n\tOrianna&#039;s head turned as she felt the morning sun warm the crevices of her cold, steel, fingertips. She stood up after another long night of sitting quietly, whilst everyone else had been sleeping. Orianna could never sleep, and she would&#039;ve liked to use the time to work on her latest invention, but she&#039;d bothered the neighbours on one too many occasions with the sound of steel, rust and spinning cogs. Instead, she sat in her room every night with The Ball at her side, thinking about how to push her latest invention further, and how it would help the citizens of Piltover understand who she was.\r\n\r\n\tThe Ball followed her closely as she stood up and moved into the kitchen. The smell of eggs and bacon soon filled the house, and her father, Corin Reveck made his way downstairs. \r\n\r\n&quot;Morning Ori,&quot; he said, &quot;How was your night?&quot;\r\n&quot;The same as most nights,&quot; Orianna replied sourly, &quot;I sat quietly, wishing we lived somewhere where I could be working.&quot;\r\n&quot;Ori, you know we can&#039;t afford a new place,&quot; Corin winced. &quot;I already owe Viktor over fifty-thousand gold, I don&#039;t need you pestering me as well.&quot;\r\n&quot;Your argument is flawed, Father,&quot; Orianna pointed out, &quot;If I could work on new projects by night, we could be 68% more productive, and therefore-&quot;\r\n&quot;You don&#039;t understand, Ori,&quot; sighed Corin, cutting Orianna off, &quot;I don&#039;t want to have this discussion right now, thank you for breakfast, it&#039;s lovely.&quot;\r\n\r\nOrianna stood quietly, her eyes locked on her father as he ignored her and finished off his omelet. She collected his plate and cleaned up the kitchen, in silence. When she was done, she headed to the Workshop.\r\n________________________________________________________________________________________________________________\r\n\r\n\t\tOnce in the Workshop, Orianna removed her project from the small box on the desk. It was a visor of sorts, intended to fit over her head and her eyes. Protruding from the back was a long cord that would be able to slide down her back and connect to a port in the Infinity Gear that her father had created for her. The idea behind it was that it would read Orianna&#039;s emotions and the visor would change shape to portray them. She&#039;d managed to get the visor to display a wide array of emotions; happiness, anger, even confusion, but hadn&#039;t been able to find a way for the visor to read her heart the way she had wanted it to; the technology was beyond her expertise. She tinkered with the programming, trying to find a way to distinguish between different emotions, based on pulse, muscle movement, and processing speed. It seemed that there was no solution; emotions were too complex to define.\r\n\r\n\tShe thought about calling Ezreal, to once again request an expedition into the ruins where Azir had risen from. She was certain that there would be old artifacts buried beneath the rubble that could be used in her other inventions, if not the visor. He refused to take her down because she was a mechanical being, and that she wasn&#039;t worth his time. She desperately wanted to prove that she was an autonomous being with feelings and emotions, not just a robot that belonged in a museum. Her pondering was interrupted by a loud hiss from outside, followed by a familiar scream. Orianna followed the commotion, with The Ball in tow.\r\n______________________________________________________________________________________________________________\r\n\r\n\tWhen she arrived at the scene, Orianna immediately noticed Annie with her teddy bear, Tibbers, standing over a kneeling Lulu. She ran to help Lulu up, but was surprised to see that Lulu was unscathed by Annie&#039;s pyromania, but it was instead Pix who&#039;d born the brunt of the assault.\r\n\r\n&quot;What?&quot; jeered Annie, &quot;I thought you said you wanted to play. Don&#039;t be boring!&quot;\r\n&quot;Not like this, Annie!&quot; Lulu shot back, &quot;You could have hurt us!&quot;\r\nAnnie poked her tongue out and blew a raspberry, &quot;It&#039;s just a little hot, don&#039;t be boring!&quot;\r\n&quot;Annie, please cease this display of bullying,&quot; said Orianna firmly. &quot;Lulu, is Pix alright?&quot;\r\n&quot;Yea... thanks Ori,&quot; Lulu said gratefully, &quot;What&#039;s your problem Annie??&quot;\r\n&quot;He&#039;s fine! I didn&#039;t even hurt him!&quot;\r\n&quot;Annie, you should not play with such dangerous magic.&quot; suggested Orianna, &quot;Imagine if Tibbers were the one being hurt. I know I would not like somebody harming The Ball.&quot;\r\n&quot;Tibbers is different!&quot; screamed Annie, &quot;He&#039;s not a robot, like you or your stupid ball! You can&#039;t replace Tibbers!&quot;\r\n\r\nOrianna was taken aback. She knew Annie had a penchant for being rude, but she hadn&#039;t expected this sort of outburst from a child.\r\n\r\n&quot;Annie, I understand that you-&quot;\r\n&quot;Shut up, metal face!&quot; Annie sneered, as a glowing sphere formed around her, &quot;This will teach you two a lesson!&quot;\r\n\r\nAnnie launched a fireball at Lulu, which Pix managed to hold off with his shield. Annie followed up by unleashing a fan of flames towards them. Like clockwork, Orianna issued the command to attack, placing The Ball between them and Annie.\r\n\r\n&quot;Throw.&quot;\r\n\r\nThe shockwave twisted the air above it, pulling Annie&#039;s flames towards The Ball as they dissipated into nothingness. The force of the pull caught Annie as she lost her balance, and tumbled to the ground. \r\n\r\n&quot;Annie, are you okay?&quot; asked Orianna, recalling The Ball to her. It was scorched in some areas, but would easily be repaired.\r\n&quot;Hmph,&quot; Annie muttered, &quot;I&#039;m fine. Stupid robot, I hope you rust!&quot;\r\n\r\nOrianna watched as Annie stood up and ran away. There was no need to get the sheriff involved, Annie was just a child after all.\r\n_________________________________________________________________________________________________________\r\n\r\n\t\tOrianna helped Lulu up, and scanned her for injuries. There were none, but Lulu was clearly in distress. Pix whispered something incomprehensible to Orianna, and Lulu stopped crying. She stood up, and took a deep breath.\r\n\r\n&quot;Lulu, are you okay?&quot; asked Orianna, &quot;Annie is gone now, do you remember what happened?&quot;\r\n&quot;Yeah...&quot; sniffed Lulu, trying not to cry, &quot;I&#039;d just arrived in town and Annie asked if I wanted to play. I thought she was being friendly but...&quot;\r\n\r\nHer voice trailed off. Annie&#039;s temper was uncontrollable at times, but her parents should have been raising her better.\r\n\r\n&quot;It is okay now, Lulu. I would recommend avoiding Annie from now on. You are welcome to come inside my house if you need a moment to rest.&quot;\r\n&quot;Thanks, Orianna, are you okay?&quot;\r\n&quot;My mana supplies are slightly depleted, but I will be okay. The Ball, however, may need some repairs. Come inside, and I shall take a look.&quot;\r\n\r\n\tLulu helped carry The Ball to the workshop, and they placed it on the bench. It was scorched in some areas, but it would be easy to repair.\r\n\r\n&quot;I can&#039;t believe how mean Annie is...&quot; said Lulu to Pix. &quot;She said some horrible things to Orianna.&quot;\r\n&quot;I am used to it by now, Lulu.&quot; Orianna replied solemnly, &quot;Some people do not see me as... human.&quot;\r\n&quot;How often do people... make that clear?&quot;\r\n&quot;Everyday, with increased frequency as of late.&quot;\r\n&quot;That&#039;s so mean, is it just Annie?&quot;\r\n&quot;It is Annie. It is Ezreal. It is even my father. They treat me like I cannot think like them. They believe I do not &#039;get it&#039;. They believe I do not &#039;fit in&#039;.&quot;\r\n&quot;I know what that feels like,&quot; sighed Lulu, remembering being an outsider in a Bandle City that had moved on from her time. &quot;I don&#039;t think it&#039;s healthy to get used to it though, I used to cry all the time.&quot;\r\nPix nodded in agreement. Orianna looked at her and said &quot;I am unable to express my sadness. I am unable to cry.&quot;\r\nLulu&#039;s eyes welled up, &quot;Then... I&#039;ll cry for you.&quot;\r\n______________________________________________________________________________\r\n\r\n\tAfter Lulu left the house for the Inn she was staying at, Orianna walked back to the kitchen to prepare dinner. On the way, she saw her father on his telephone, visibly stressed. He didn&#039;t notice her walk past, so Orianna listened in onto his half of the conversation;\r\n\r\n&quot;I&#039;ll get the money to you soon, Viktor, you know I will.&quot;\r\n&quot;...&quot;\r\n&quot;No, I mean it, we&#039;re almost done with the commision for Anivia&#039;s clockwork armour, we-&quot;\r\n&quot;...&quot;\r\n&quot;Orianna&#039;s working on something else, she says she&#039;s making progress, she can-&quot;\r\n&quot;...&quot;\r\n&quot;I&#039;ve told you before Viktor, she&#039;s my daughter, not an invention! She&#039;s mechanical sure but, I mean, you of all people should- Oh no, I didn&#039;t mean it like that Viktor, I only-&quot;\r\n&quot;..................................&quot;\r\n&quot;What glorious evolution? What are you talking about?&quot;\r\n&quot;...&quot;\r\n&quot;Understood, I&#039;ll send you the gold as soon as Anivia&#039;s-&quot;\r\n&quot;...&quot;\r\n&quot;I&#039;ll send you what I have tomorrow morning.&quot;\r\n&quot;...&quot;\r\n\r\n\tOrianna prepared dinner, without any fuss, and Corin entered the kitchen shortly after it was ready.\r\n\r\n&quot;Evening Ori,&quot; he said cheerfully, &quot;How was your day?&quot;\r\n&quot;Average.&quot; replied Orianna.\r\n\r\nAfter dinner, Orianna went to her room, followed by The Ball. She sat down on the bed, eyes wide open, and waited for morning to arrive.","replies":[{"poster":"hðnkƒørÇªmíllè","date":"2016-07-05T15:35:25.874+0000","up_votes":1,"down_votes":0,"body":"nice","replies":[]}]}