{"poster":"melior sum","date":"2018-10-03T16:57:16.986+0000","title":"The Ahri nerfs don’t make any sense for what you want to do to her","subforum":"Gameplay","up_votes":3,"down_votes":3,"body":"Reducing her ultimate CD doesn&rsquo;t do anything. Unpopular opinion but Ahri is in a fine spot, and even if she is a little bit over the edge, increasing her ultimate CD does not stop her from snowballing.\n\nIf you wanted to hit that, take 5% off the increased damage she gets from her charm. Or something marginal like that.\n\nThese useless ultimate CD changes do nothing unless it&rsquo;s a global CD like TF or Shen.","replies":[{"poster":"Alzon","date":"2018-10-03T18:01:24.213+0000","up_votes":1,"down_votes":0,"body":"It gives her lane opponent essentially one extra wave to capitalize on her ult being on cooldown.  I think that’s pretty big.  However, this hits standard Ahri a bit harder than the Glacial Ahri build that is inflating her winrate so much.  I think Riot should couple this nerf with a gold cost increase to GLP and possibly Twin Shadows.","replies":[]},{"poster":"Jinzo Torrance","date":"2018-10-03T17:50:09.271+0000","up_votes":1,"down_votes":0,"body":"Yeah, hope they do nothing so she gets another one","replies":[]},{"poster":"LeftyRaydy","date":"2018-10-03T17:19:45.443+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Not Grouping,realm=NA,application-id=3ErqAdtq,discussion-id=EE24UkbE,comment-id=,timestamp=2018-10-03T16:57:16.986+0000)\n>\n> Reducing her ultimate CD doesn&amp;rsquo;t do anything. Unpopular opinion but Ahri is in a fine spot, and even if she is a little bit over the edge, increasing her ultimate CD does not stop her from snowballing.\n> \n> If you wanted to hit that, take 5% off the increased damage she gets from her charm. Or something marginal like that.\n> \n> These useless ultimate CD changes do nothing unless it&amp;rsquo;s a global CD like TF or Shen.\n\nTo say that these changes do not make sense baffles me. Her Early game got a huge buff (pre-6) with her charm. now by the time you hit 6 you should have at least 10% CD. So now 117 CD for her ultimate compared to 99 second CD. I think this is actually a good nerf its not too hard and If I were an Ahri main I would be happy that they just increased the CD of her ultimate and did not touch her damage in general.","replies":[]},{"poster":"Rock MD","date":"2018-10-03T17:05:26.389+0000","up_votes":1,"down_votes":0,"body":"It's 20 more seconds she's not safe in lane\n\n20 more seconds she can't roam and make picks\n\n20 more seconds she can't all in.\n\nDoesn't mean much for experienced players but for everyone below diamond it should be fairly significant.","replies":[]}]}