{"poster":"Xsoulripper","date":"2018-08-22T17:42:09.168+0000","title":"Mein Main Account wurde absichtlich von einem Freund  gebannt.","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":8,"body":"Hallo Liebe Lol Community,\n\nIch habe eine Frage, ich habe einem Freund von mir die Account Daten vor langer Zeit mal gegeben damit er darauf spielen kann, mittlerweile sind wir nicht mehr befreundet (sind im Streit auseinander gegangen). Aus &quot;Rache&quot; hat er absichtlich auf meinem ehemaligen Account geflamt und gefeedet als ich im Urlaub war (Zusatzinfo, mein Account hatte schon mal einen 7 und 30 Tage Bann wegen flaming). Jetzt wurde ich perma gebannt. Ich wei&szlig;, dass ich selber Schuld bin, da Accountsharing nicht geduldet wird, das ist mir vollkommen klar. Ich habe halt leider echt viel Zeit und Geld in den Account gesteckt. Meine Frage ist jetzt, kann man da irgendwas machen? Ich schlimmsten Fall auch gerichtlich haha. Bin mir halt nicht sicher und w&uuml;rde gerne eure Meinung h&ouml;ren. Bitte sachlich bleiben, ich wei&szlig;, dass Accountsharing automatisch zum Bann f&uuml;hrt, aber absichtliches flamen? Wenn jemand Erfahung mit dem Thema hat, w&auml;re ich zutiefst erfreut, wenn derjenige mir diese mitteilen k&ouml;nnte. \n\n(Ps. Bitte keine Kommentare wie selbst Schuld, das ist mir mittlerweile klar.)\nDanke schon mal im Voraus. \nLG\nXsoulripper","replies":[{"poster":"Pilze","date":"2018-08-22T20:04:45.228+0000","up_votes":2,"down_votes":0,"body":"Sag mal bin ich der einzige bei dem es gerade klingelt das er Acc Sharing betrieben hat und nun mit dem besagtem Acc gebannt wurde?","replies":[{"poster":"Angel Ayume","date":"2018-08-22T20:13:07.981+0000","up_votes":5,"down_votes":0,"body":"Er hat es doch zugegeben, dass er das gemacht hat. O.o Wieso sollte es dann nur bei dir \"klingeln\"? \nEr hat sogar gesagt, dass er weiß, dass es nicht richtig ist. \n\nDa der Account aber für Flaming gebannt wurde und nicht für das Acc Sharing, hat eben niemand was dazu geschrieben. Was auch nicht nötig war, da er ja bereits weiß, dass das verboten ist.","replies":[{"poster":"Pilze","date":"2018-08-22T20:33:29.483+0000","up_votes":3,"down_votes":0,"body":"Warum schreibt man dann noch überhaupt was rein? Der Acc wäre so oder so weg gewesen? Du mühe würde ich mir nicht mal machen!","replies":[{"poster":"Angel Ayume","date":"2018-08-22T20:38:03.530+0000","up_votes":2,"down_votes":0,"body":"Weil er drum gebeten hat und nachgefragt hat? \nWenn man sich nicht sicher ist, dann fragt man nach und wenn man keine Antwort erhält, wird man auch nicht schlauer und ist sich immer noch nicht sicher. \n\nEr hatte halt Hoffnung, vllt auch Verzweiflung? Als ob du die nie was in deinem Leben erhofft hättest obwohl du weißt, dass es eig nicht möglich ist. Und bitte sag nicht nein, das kauf ich dir nicht ab.","replies":[{"poster":"Abasin","date":"2018-08-23T05:51:14.550+0000","up_votes":1,"down_votes":0,"body":"Bei so einem eindeutigen Fall noch nachfragen ist aus meiner Sicht einfach nur überflüssig.","replies":[{"poster":"Xsoulripper","date":"2018-08-23T07:50:38.340+0000","up_votes":1,"down_votes":2,"body":"Danke Angel Ayume :D\n\n@Abasin, wie unten schon geschrieben wollte ich nur sicher sein, dass ich sonst nichts mehr machen kann. Der Account wird nie wieder entbannt, dass ist mir zu 100% klar, auch dass ich selbst dran Schuld bin. \nIch wollte nur nachfragen, ob man da gesetzlich bzw irgendwas anderes machen kann. \nDanke trotzdem für deine Antwort.","replies":[]}]}]}]}]}]},{"poster":"Angel Ayume","date":"2018-08-22T18:01:47.404+0000","up_votes":6,"down_votes":1,"body":"Du hast leider keine Chance mehr, deinen Account wieder zubekommen. \nEs wurde schließlich nur der Account gebannt und nicht der Spieler. Auf dem Account wurde sich schlecht benommen, also wird er aus dem Verkehr gezogen, was natürlich trotzdem eine Lehre für den Spieler sein soll. ^^ \n\nGerichtlich kannst du auch nichts machen, da der Account nie in deinem Eigentum war. Du hast ihn dir quasi nur von Riot ausgeliehen. \n\nAber du kannst daraus lernen. ^^ A: Flaming führt zu Strafen und das zurecht (auch wenn du das mit den anderen Banns bereits gelernt haben solltest) und B: teile niemals deine Accountdaten jemanden mit. Egal ob Freund oder Familie.","replies":[{"poster":"Xsoulripper","date":"2018-08-22T18:04:48.114+0000","up_votes":1,"down_votes":0,"body":"Danke für deine ausführliche Antwort!!!!\n\nSchade, dass man da gerichtlich nichts machen kann. Naja ich hab daraus gerlernt und das war ganz alleine mein Fehler....","replies":[{"poster":"LegendaryXenon","date":"2018-08-22T18:47:16.568+0000","up_votes":1,"down_votes":2,"body":"Man trifft sich immer zwei Mal.\n\nVielleicht hat er ne Schwester, Freundin, hübsche Mutter...","replies":[{"poster":"Xsoulripper","date":"2018-08-22T18:48:43.919+0000","up_votes":1,"down_votes":1,"body":"Haha gute Antwort :D\n\nAlles Gut, ich hab nicht vor mich irgendwie zu Rächen, bin ja selbst Schuld. Wollte nur sichergehen, dass man vom Gesetz her auch nichts machen kann. Die Antwort habe ich jetzt.","replies":[{"poster":"LegendaryXenon","date":"2018-08-22T20:31:07.794+0000","up_votes":1,"down_votes":0,"body":"Ne tatsächlich ist Deine Geschichte aus jeder Perspektive durch. Entweder du fängst neu an, oder Du suchst Dir etwas anderes und gönnst Dir eine Pause.","replies":[]}]}]}]}]},{"poster":"Abasin","date":"2018-08-23T05:50:17.384+0000","up_votes":2,"down_votes":0,"body":"> Bitte sachlich bleiben, ich weiß, dass Accountsharing automatisch zum Bann führt, aber absichtliches flamen?\n\nDa grundsätzlich ja schon zwei Banngründe erfüllt sind, erübrigt sich Deine Anfrage. Ausserdem, wie naiv ist denn die Vorstellung dass man für ein nachgewiesenes Vergehen eine Strafe kassiert und aus sehr egoistischen Gründen diese wieder weghaben will? {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Xsoulripper","date":"2018-08-23T07:48:01.544+0000","up_votes":1,"down_votes":2,"body":"Falsch, es geht mir nicht darum den Account zu entbannen, ich habe mir lediglich die Frage gestellt ob man da sonst irgendwas machen kann um ihn zu bestrafen. Dass der Acc zu 100% weg ist und nie wieder entbannt wird ist mir klar - ist ja auch meine Schuld.\n","replies":[{"poster":"Abasin","date":"2018-08-23T08:15:14.501+0000","up_votes":1,"down_votes":0,"body":"> Ich habe halt leider echt viel Zeit und Geld in den Account gesteckt. Meine Frage ist jetzt, kann man da irgendwas machen? Ich schlimmsten Fall auch gerichtlich haha.\n\nIst leider sehr missverständlich und kann sich sehr wohl auf einen Versuch beziehen, den Acc mit gerichtlichen Mitteln entbannen zu wollen. Konkreter hättest Du fragen sollen, ob eine Anzeige gegen Deinen Ex-Freund Aussicht auf Erfolg hätte.","replies":[{"poster":"Xsoulripper","date":"2018-08-23T09:01:01.355+0000","up_votes":1,"down_votes":2,"body":"Genau diese Frage interessiert mich.... \nIch werde mich heute mal durch die Nutzungsbedigungen etc. von Riot durchlesen, mal schauen was da raus kommt.","replies":[{"poster":"Abasin","date":"2018-08-23T09:57:46.369+0000","up_votes":2,"down_votes":0,"body":"In der Hinsicht ist RIOT abgesichert, sonst wären sie schon seit Jahren in Klagewellen erstickt. Da Du per AGB verpflichtet bist, den Account und den Zugang dazu pfleglich zu behandeln, ist alles was passiert ist Dein Fehler. Ich denke dass auch ein deutsches Gericht Dir die Klage abweist wegen Verletzung der Sorgfaltspflicht und Nichteinhaltung der Selbstverpflichtungen, die Du durch Kenntnisnahme der AGBs (plus Zustimmung zu selbigen) eingegangen bist.","replies":[{"poster":"Xsoulripper","date":"2018-08-23T14:44:34.695+0000","up_votes":1,"down_votes":0,"body":"Okay danke","replies":[]}]}]}]}]}]},{"poster":"Izaya Kumiho","date":"2018-08-22T18:18:53.659+0000","up_votes":2,"down_votes":0,"body":">ich habe einem Freund von mir die Account Daten vor langer Zeit mal gegeben damit er darauf spielen kann\n>Ich weiß, dass ich selber Schuld bin, da Accountsharing nicht geduldet wird, das ist mir vollkommen klar.\n> Ich habe halt leider echt viel Zeit und Geld in den Account gesteckt.\n> Meine Frage ist jetzt, kann man da irgendwas machen? Ich schlimmsten Fall auch gerichtlich haha.\n\n\nGeld spielt keine Rolle für die Strafe.\n(Wäre auch ziemlich unfair, wenn jeder Geld für League ausgeben müsste, nur um dann nicht so hart bestraft zu werden...)\n\n\nAußerdem ist der Account nicht deiner, sondern nur das geliehene Eigentum von Riot Games. Sprich: Selbst wenn du eine Anzeige gegen deinen ex-Freund stellst, wird diese abgelehnt werden, da die Anzeige wenn schon von Riot getätigt werden müsste, aber Riot keinen Schaden wegen der Tat von deinem EX nimmt und dementsprechend nichts tun wird.\nBzw. dein Account ist alleine für das Accountsharing auf der Permabanliste (wie du auch bereits selber erkannt hast), also macht es keinen Sinn, deinen partner in crime vor das Gericht zu schleifen.\n\nWas soll das Gericht denn da auch sagen?\nEs gibt auch keine Beweise, dass das wirklich nicht du gewesen sein kannst, der neben dem Freund am selben Anschluss gespielt hat. \n\nUnd wie bereits die anderen User dir geschrieben haben, hast du die Verantwortung zu tragen für alles, was mit deinem Account passiert.","replies":[{"poster":"Xsoulripper","date":"2018-08-22T18:46:46.033+0000","up_votes":1,"down_votes":1,"body":"Danke Izaya Kumiho für deine sehr sehr ausführliche Antwort,\n\nIch bin ganz ehrlich, ich bin wütend auf mich selbst. Ich hätte ihm einfach NIE die Daten geben sollen. \nIst ganz alleine meine Schuld. Najo kann man nix machen. \n\nWünsche dir noch einen schönen Abend und nochmals danke für die Antwort, wollte im Endefekt nur sicher gehen ob ich nicht doch irgendwas gegen ihn machen kann.","replies":[{"poster":"hshtagniemehrcdu","date":"2018-08-22T19:23:30.771+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Xsoulripper,realm=EUW,application-id=KYnfKGf0,discussion-id=qVZVUPJN,comment-id=00020000,timestamp=2018-08-22T18:46:46.033+0000)\n>\n> Danke Izaya Kumiho für deine sehr sehr ausführliche Antwort,\n> \n> Ich bin ganz ehrlich, ich bin wütend auf mich selbst. Ich hätte ihm einfach NIE die Daten geben sollen. \n\n..und das Passwort ändern; dauert nicht lange, und sollte man in solchen Fällen immer machen.","replies":[{"poster":"Xsoulripper","date":"2018-08-23T07:48:50.981+0000","up_votes":1,"down_votes":0,"body":"Hast recht, habe nur überhaupt nicht dran gedacht da ich dachte, dass er es nicht mehr gespeichert hatte","replies":[]}]},{"poster":"Marksmansitter","date":"2018-08-23T03:03:05.440+0000","up_votes":1,"down_votes":0,"body":"Falls du nen neuen account machst und jemanden zum leveln brauchst kannst du \"Mr pringeis\" adden, das ist mein smurf :)","replies":[]}]}]},{"poster":"Shooter90","date":"2018-08-22T18:02:34.569+0000","up_votes":2,"down_votes":1,"body":"Du bist für die Handlungen auf deinem Acc verantwortlich. Mal abgesehen davon, dass schon das Sharen an sich lt. Riot nicht in Ordnung ist. Und was willst du rechtlich machen? Rein rechtlich \"gehörte\" der Acc eh nie dir, sondern immer Riot. Und die behalten sich eben vor bei Verstößen gegen die Nutzungsbedingungen (bei dir ja anscheinend mehrfach der Fall) diesen Acc zu sperren. Also: beim nächsten Account vielleicht mal weniger Flamen und den Login nicht weitergeben.\n\nTLDR: Account ist weg.\n\nKorrigiert mich wenn das nicht so ist.","replies":[{"poster":"Xsoulripper","date":"2018-08-22T18:06:34.665+0000","up_votes":1,"down_votes":0,"body":"Danke für die Antwort Shooter90!\n\nOkay, zumindest habe ich etwas für die Zukunft gelernt...\n\nLG","replies":[]}]},{"poster":"manial fly","date":"2018-08-22T21:30:01.559+0000","up_votes":1,"down_votes":0,"body":"Account sharing hin oder her, du hättest zumindest deine Zugangsdaten ändern sollen nachdem du dich mit deinem Freund verkracht hast.","replies":[{"poster":"Xsoulripper","date":"2018-08-23T07:52:58.862+0000","up_votes":1,"down_votes":0,"body":"True :/","replies":[]}]}]}