{"poster":"CapitanVanCh0ta","date":"2018-08-25T01:30:25.137+0000","title":"[Concepto de Tematica] Tematica gubernamental y sus respectivos cargos.","subforum":"Creaciones de la comunidad","up_votes":8,"down_votes":0,"body":"Todas las skins giran alrededor de Xin Zhao agente secreto. \nEjemplos de la tematica:\n\n1. Jhin Presidente, mas que nada por la forma de caminar, que le da un aire de confianza. Tambien porque que me recuerda al Presidente de Monstruos Vs Aliens. Talvez el backeo pueda ser una referencia a lo que hace el Presidente luego de tocar el teclado (osea, subir al helicoptero pero sin antes vaciar su cargador) ~~Aparte de que seria el Presidente, osea, es el centro de atencion~~.\n\n2. Aurelion Sol Presidente, como reemplazo al Jhin. Se veria bien a Aurelion con un traje negro, y no quedaria tan mal que las estrellas sean como peque&ntilde;os helicopteros, como si lo estuviesen cuidando todo el rato. ~~necesitamos skins de Aurelion Rito porfa~~\n\n3. Soraka Ministra de Salud. La R en vez de hacer la tipica pose cuando esta canalizando, que haga como una se&ntilde;al con una radio. Puras ideas.\n\n4. Pyke Ministro de Comercio Exterior. No quedaria tan mal por como funciona la R, que cuando asesine a alguien diga algo similar a &quot;un trato finalizado&quot; o &quot;gracias por hacer negocios conmigo&quot;.\n\n5. Kled Ministro de Seguridad. Esta loco, ya saben como va el tema...\n\n6. Nidalee Secretaria. Nunca esta de mas si le ponen un traje. **NUNCA**\n\n7. Talvez lo profundice con otros campeones, vere si se me ocurre algo con el tiempo.\n\n\nNo se, me parece una buena tematica, una que nadie se la espera. Aunque sean ideas vagas, puede ser un buen comienzo. Es como que le da un aire diferente al LoL, porque sale de lo tipico sobre skins magicas (guardian estelar, heroes inmortales, hextech, luna de sangre.) o surrealistas (estrella oscura, arco de luz, arcadia, cosmico, ejecutores, mecha, etc.) y lo acerca un poco a lo que vemos dia a dia (?).\n\n\n\nPrimer post, no bullying :)","replies":[{"poster":"Paradisco","date":"2018-08-25T12:26:47.463+0000","up_votes":4,"down_votes":0,"body":"Swainestor Kirchner","replies":[{"poster":"Main Cocina S3","date":"2018-08-25T17:10:10.769+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Paradisco,realm=LAS,application-id=J0mxKtkB,discussion-id=Ks5LJEUl,comment-id=0003,timestamp=2018-08-25T12:26:47.463+0000)\n>\n> Swainestor Kirchner\n\nLulu Da Silva","replies":[]}]},{"poster":"BeveBVXD","date":"2018-08-25T02:46:49.579+0000","up_votes":2,"down_votes":0,"body":"Mientras esté {{champion:16}}  la idea me parece buena xd","replies":[]},{"poster":"Defg45333","date":"2018-08-25T01:40:10.119+0000","up_votes":2,"down_votes":0,"body":"LOL Me encantó la idea de Aurelion xD\nO sea me gustaron todas, pero la de Aurelion está OP\nRito queremos otra skin :v","replies":[]},{"poster":"SKT Espert","date":"2018-08-25T22:59:28.480+0000","up_votes":1,"down_votes":0,"body":"Yo quiero skins de trabajos reales (MecaniKatarina con llaves inglesas en vez de dagas, Jayce Conserje con una escoba por martillo). Aun asi me gustaron tus ideas :D","replies":[]},{"poster":"TipicoPlataIV","date":"2018-08-25T16:39:56.319+0000","up_votes":1,"down_votes":0,"body":":) me gusta... Excitante","replies":[]},{"poster":"FallenDemonX","date":"2018-08-25T04:52:25.842+0000","up_votes":1,"down_votes":0,"body":"La verdad es que es una tematica muy divertida, como con las skins de oficina o las debonaire. Me recuerda a esto: https://www.youtube.com/watch?v=3fYUwuPPpFo\n\nMe encanta A Sol con los helicoteros.\n\n\n\n\n- Camille Primera Dama. Como con Jhin, tiene esa forma de caminar con aire de poder (Y la temática le queda bien)\n\n-  Ryze o Tahm Kench ministro de transporte. Por las ultis.","replies":[]}]}