{"poster":"daniel24816","date":"2018-01-15T21:26:30.419+0000","title":"getting honor back","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"um i got banned a couple months ago towards the end of october for 2 weeks and after getting unbanned and up until now (middle of january) i have not gotten my honor back, im still dishonorable at level 0 and before getting banned i was already at level 5 honor. so i kinda want my honor back bc its been 3 months and i havent been as toxic and dont flame people too often anymore","replies":[{"poster":"Broporo","date":"2018-01-16T01:10:22.187+0000","up_votes":1,"down_votes":0,"body":"The main reason your honor hasn't been climbing yet is that there's still some pretty toxic behavior going on in chat. I've noticed a few logs that didn't actually punish your account for toxicity, but they are holding back your honor progress slightly for using homophobic language. I won't be posting any of this here, but you're still welcome to reach out in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new) for those logs if you don't remember.","replies":[]},{"poster":"The Great Mishka","date":"2018-01-16T00:30:19.369+0000","up_votes":1,"down_votes":0,"body":"You can send a ticket to Riot Support. I did that less than a month ago, around Christmas. The person that responded to me told me I was 'progressing at a normal rate', I could even screenshot the email if you'd like, but it's too much work in a single reply. Overall, they don't do anything about it. You have to earn it back on your own by getting honored over a LONG, LONG period of time (unspecified by the Riot employee). Also, getting reported prolongs that period. Finally, if you are to stop playing on your account your honor will not restore itself after some period of time, it will stay where you left it at.\n\nSide info: I was banned in mid-July for 2 weeks due to flaming and hate speech, haven't shown reportable behavior since then even once, but my honor still hasn't been restored.","replies":[]}]}