{"poster":"CommanderPirates","date":"2015-02-01T21:17:40.422+0000","title":"So Riven is not getting a nerf because?","subforum":"Gameplay","up_votes":5,"down_votes":8,"body":"I cant use words to describe how much I hate playing against her, or on her on enemy team.  She is no where near healthy, she is broken as hell.  She makes this game NOT FUN, I cant survive 2 sec in team fights cause she mobo as hell with lowest cool downs not to mention over 9000 damage one combo","replies":[{"poster":"Killer X 12","date":"2015-02-01T22:19:27.142+0000","up_votes":2,"down_votes":1,"body":"Riven requires a snowball. Without it she is trash. Also, please do not complain about RIven when there are those of us who had to play against her when she was actually good.","replies":[]},{"poster":"Raja Chachki","date":"2015-02-01T21:24:00.607+0000","up_votes":2,"down_votes":1,"body":"Ok, I like you, used to get completely fucked by Riven. Things to do, TRY to pick Darius(strong early/good poke), or someone like Irelia(safe with stun, lategame SUPER tank). Also, the absolute best way to kill Riven is, camp her, and camp her hard. If she dies 2-3 times within the first 15 min of the game(of course without her TPing and getting kills) she won't come back. She needs to snowball, and is a master of feast or famine. Let me put it this way, smart people build tank when behind, and Riven's abilities are some of the hardest AD scaling abilities in the game. So if you put her behind, she will be building tanky(if not then you smash her like a fly) and her abilities won't scale(her shield will be absolutely meaningless).","replies":[]},{"poster":"InsaneSamurai","date":"2015-02-01T21:19:29.576+0000","up_votes":2,"down_votes":1,"body":"Riot seems to think champions that are mostly counterable in champ select are ok to take over games, because they don't do it in the LCS.  \n\nWe sorta matter, just not ultimately.  They don't care about blind pick at all, and in draft someone like Riven(when not directly counterable) probably just makes an LCS team laneswap, where 5 randoms would never do that for each other.","replies":[]},{"poster":"Gromble","date":"2015-02-01T21:27:38.772+0000","up_votes":2,"down_votes":2,"body":"she really needs her dashing ability cut in half. its so friggin ridiculous.","replies":[]},{"poster":"Subject 5","date":"2015-02-01T21:21:36.173+0000","up_votes":1,"down_votes":1,"body":". . . Nerf Sona? It is most likely because Sona or Lulu are assisting her somehow, i'll report this to Riot.\n\nAnyways, i was ganking her lane with nautilus at level 3 and she halfed my hp through my shield, and this is my rune page http://puu.sh/flgRB/ffa093ff22.jpg, statistically i had 18 armor including my full defensive mastery page, she used her q without auto attacking and her stun.\n\nI actually made a post of this recently, though i made it specifically towards mobility creep and i think that is a major problem in all honesty, check it out. http://boards.na.leagueoflegends.com/en/c/gameplay-balance/BzTXnONj-the-mobility-fact","replies":[]},{"poster":"CharQueen","date":"2015-02-01T21:18:35.059+0000","up_votes":1,"down_votes":2,"body":"How to play Riven: \nMASH THE KEYBOARD\n\nHer shield is useless and she pure mobile damage.","replies":[]}]}