{"poster":"Ariana Grande","date":"2015-09-24T20:08:04.829+0000","title":"Tutorial - Voz del anunciador BarbaKahn - BarbaLoL 2.1","subforum":"Charlas Generales","embed":{"description":"Por fin hijos de odin, aqui esta el tutorial y recomiendo que siempre lean la descripcion que la voy a ir actualizando.","url":"https://www.youtube.com/watch?v=JauXaK3_v5I","image":"https://i.ytimg.com/vi/JauXaK3_v5I/hqdefault.jpg"},"up_votes":6,"down_votes":5,"body":"Hola!\nHago este post especialmente dirigidos a los hijos de Odin (o sea a los fans del Barba), para jugar al LoL escuchando su voz en el anunciador.\nSe utiliza un programa para cambiar automáticamente sin romperte la cabeza los archivos del anunciador del LoL adjuntados en el post. Yo lo probé, a mí me gustó (de hecho actualmente lo estoy usando); y funciona perfectamente. Dejo el tutorial a continuación.\n\n**Aclaro que es totalmente LEGAL, Riot Games no baneará sus cuentas ni tomará acciones por usar este anunciador.**\n\n* **Primero:** Van a descargarse la utilidad llamada Wooxy (link: http://www.mediafire.com/download/l03uxabcuo6ltfd/WooxySetup_1_1_0_0.rar )\n* **Segundo:** Lo abren al ejecutable dentro del .rar, y lo instalan con las opciones que vienen por defecto (sin tocar nada)\n* **Tercero:** Lo abren, y van a la parte que dice \"Skin\".\n* **Cuarto:** Ponen \"Import Skin\" (está en naranja con un signo + abajo a la derecha), luego \"Add\" (abajo a la izquierda en el dibujo de la nota), y seleccionan los archivos descargados de este link: http://www.mediafire.com/download/801ou172mdp8qwp/Barbalol+v2.1.rar (hay que seleccionar los 3 archivos)\n* **Quinto:** Una vez reemplazado todo, van a \"Save Skin\" (abajo a la derecha en verde), y le ponen el nombre que ustedes quieran (yo le puse BarbaLoL)\n* **Sexto:** Les va a salir en pantalla el skin que acaban de crear, le hacen click y ponen \"Install\" (abajo casi al centro en violeta)\n\nY listo! Ya pueden disfrutar de su Dios nórdico en la grieta hijos de Odin!\n\n_(Si en algún momento quieren dejar de utilizarlo, o sea volver al anunciador normal, sólo repiten el sexto paso poniendo \"Uninstall\", que es el mismo botón de \"Install\" pero que cumple la función inversa)\n_\n\nBueno hasta acá el tutorial, si tienen alguna duda o pregunta sobre esto, pueden preguntarme que respondo todo el tiempo. Igualmente dejo el video adjuntado original de BarbaKahn.\n\nSaludos! ARI ♥","replies":[{"poster":"gambito700","date":"2015-09-24T20:16:45.345+0000","up_votes":1,"down_votes":0,"body":"Alguien ya lo posteo y me re-jodieron a negativos\n\n> III. LIMITACIONES ADICIONALES DE LA LICENCIA\n> La licencia limitada que se concede al Usuario en la cláusula I está sujeta a las limitaciones adicionales que se exponen a continuación. Cualquier uso del Software que viole las limitaciones de la licencia es un uso no autorizado del mismo y por lo tanto, no cubierto por la licencia concedida al Usuario en la cláusula I, por lo que será considerado como una violación de los derechos de autor que tiene Riot Games y  sobre el Software y el Juego. El Usuario accede a no realizar, bajo ninguna circunstancia, las siguientes acciones:\n> \n> A. Vender, alquilar, prestar o transferir el Software u otorgar un interés en garantía o transferir reproducciones del Software o del Juego a terceros;\n> \n> B. Copiar, fotocopiar, reproducir, traducir, aplicar ingeniería inversa, descompilar, extraer código fuente o desensamblar en todo en parte el Software o el Juego, así como crear obras derivadas basadas en el Juego, a excepción de aquellas para las que el Usuario tenga autorización, a saber: (i) realizar una (1) copia del Software y de la Documentación para fines de archivo personal; y (ii) utilizar software de captura de vídeo e imágenes de terceros para capturar el Software en forma de audio, vídeo y/o archivos de imágenes únicamente para un uso personal, no lucrativo, de conformidad con los Términos de uso (http://las.leagueoflegends.com/es/legal/termsofuse) y demás políticas de Riot Games aplicables a la creación de audio y vídeo;\n> \n> C. Modificar o causar la modificación de archivos que formen parte del Software aplicando métodos no autorizados expresamente por Riot Games;\n> \n> D. Utilizar o causar que otra persona o entidad utilice el Software o el Juego para propósitos comerciales, incluidos, entre otros, los siguientes: (i) participar en el Juego a cambio de abonar un importe (por ejemplo, servicios de “subida de nivel”); o (ii) vender objetos del Juego fuera de éste, así como vender cuentas del Juego, siempre que se trate de transacciones que no estén autorizadas por Riot Games o se sustancien a través de servicios que no preste Riot Games;\n> \n> E. Utilizar programas de terceros no autorizados que interactúen con el Software de cualquier modo, incluidos, entre otros, “mods”, “hacks”, “cheats”, “scripts”, “bots”, “trainers” o programas de automatización, o cualesquiera programas de terceros que intercepten, emulen o redirijan cualquier comunicación entre el Software y Riot Games, así como recabar información sobre el Juego leyendo áreas de memoria utilizadas por el Software para almacenar información sobre el Juego.","replies":[{"poster":"Ariana Grande","date":"2015-09-24T20:21:17.643+0000","up_votes":2,"down_votes":1,"body":"Las reglas de Riot Games establecen que es ilegal utilizar un programa o una modificación que altere tu experiencia jugando, como por ejemplo los timers de la jungla para saber cuando salen el blue / red enemigo, o el dragón / baron (antes de que se ponga la cuenta regresiva aún sin visión como cambiaron en un parche anterior), o algún tipo de script para que puedas ver el mapa sin niebla, o ver el enfriamiento de las habilidades y hechizos de los enemigos, etcétera.\n\nModificar el anunciador no te da ningún tipo de ventaja sobre el juego, ni cambia tu jugabilidad ni experiencia, es algo cosmético al igual que un skin (de hecho es un skin pero del anunciador en lugar de que sea de un campeón).\n\nAsi que no te preocupes y usalo, yo actualmente lo estoy usando y me encanta jajaja (solo si sos fan del Barba).\n\nSaludos! ARI ♥","replies":[{"poster":"gambito700","date":"2015-09-24T21:47:32.746+0000","up_votes":1,"down_votes":0,"body":"> E. Utilizar programas de terceros no autorizados que interactúen con el Software de cualquier modo, incluidos, entre otros, “mods”, “hacks”, “cheats”, “scripts”, “bots”, “trainers” o programas de automatización, o cualesquiera programas de terceros que intercepten, emulen o redirijan cualquier comunicación entre el Software y Riot Games, así como recabar información sobre el Juego leyendo áreas de memoria utilizadas por el Software para almacenar información sobre el Juego.\n\nno dice nada sobre \"modificar la experiencia de juego\"\n\nigual no pasa nada si lo instalas, seguro nunca se enteraran ni te banearan. asi que piola\n\nigual ese barbas es un YT que personalmente no me gusta. su intento de ser chistoso es sobreProducido Tanto grito y groseria sin sentido. forzando el chiste y sobre explotando los chistes que si funcionaron. \n\nÑE","replies":[]}]}]},{"poster":"Geo Kün","date":"2019-08-10T21:11:59.390+0000","up_votes":1,"down_votes":0,"body":"alguien tiene el barbalol y decirme como poder instalarlo ahora?","replies":[]},{"poster":"Star Neeko","date":"2018-02-16T20:30:14.305+0000","up_votes":1,"down_votes":0,"body":"Hola alguien que tenga el barbalol 2.1 podria subirlo a mega o mefiafire porque los links esos ya no funcionan {{sticker:sg-janna}}","replies":[]},{"poster":"feed no jutsu","date":"2015-09-25T05:18:44.176+0000","up_votes":1,"down_votes":0,"body":"Yo uso el anunciador de Barba, pienso que pudo haber usando frases mejores, como cuando vas en racha de matar a 3 sin morir y cuando te matan barba dice \"Te han pillado\" hubiera estado mejor umm \"Te violaron\" o algo parecido, dijo que iba a sacar actualizaciones del anunciador xD veremos que hace.","replies":[]},{"poster":"TØMEX","date":"2015-09-24T20:33:01.844+0000","up_votes":1,"down_votes":0,"body":"Hola, muchas gracias ariana me sirvió de mucho.Muy bueno.","replies":[]},{"poster":"Snooow","date":"2015-09-24T20:23:40.170+0000","up_votes":1,"down_votes":0,"body":"y que diferencia tiene el 2.0 del 2.1?","replies":[{"poster":"Ariana Grande","date":"2015-09-24T20:25:32.031+0000","up_votes":1,"down_votes":0,"body":"Ni idea, yo instalé el 2.1 y es el que se está usando por así decirlo.","replies":[]}]}]}