{"poster":"Hand am 4rsch","date":"2019-11-22T21:44:45.705+0000","title":"Ehrungen","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":4,"body":"Guten Abend verehrte Community,\r\n\r\nseit längerer Zeit verfolgt mich der Gedanke \"Warum kann man seinen Gegner melden, aber nicht ehren?\". Nun ja, ich weis, dass man vor nicht allzu langer Zeit genau dies konnte, aber ich verstehe nicht ganz warum das entfernt wurde? Welchen Grund hat das entfernen von Ehrungen für einen Gegner? Niemand kennt seine Gegner und es ist ja nicht so als würde man jeden Gegner ehren wollen, aber ich für mein empfinden habe in lezter Vergangenheit ein paar mal das Bedürfnis gehabt, einen meiner Gegner für sein nettes/sportliches Verhalten zu Belohnen, aber, naja...\r\nIch würde gerne wissen, ob einer weis, warum das ehren für Gegner entfernt wurde oder eine Vermutung hat und ob es in (naher) Zukunft wieder eingeführt wird? :)\r\n\r\nVielen Dank schonmal vorab.\r\n\r\nBis dann auf dem Schlachtfeld! :D","replies":[{"poster":"Amycos Cyrus","date":"2019-11-22T22:25:08.473+0000","up_votes":2,"down_votes":1,"body":"> Welchen Grund hat das entfernen von Ehrungen für einen Gegner?\n\nDie Ehrung an Gegner wurde entfernt, weil dem gegnerischen Team zu wenig Informationen für diese Handlung vorliegen. Sie können nur Inhalte des All-Chats sehen und wissen somit gar nicht, wie er im Chat wirklich agiert und auch über sein Verhalten auf der Karte kann man nur etwas im Bereich der eigenen Vision sagen.\nAus diesem Grund wurde das \"Ehrenwerter Gegner\" entfernt. Vermutlich gab es zu oft die Konfrontation, dass ein Spieler vom Gegner geehrt und vom eigenen Team reportet wurde.","replies":[{"poster":"You Got My Name","date":"2019-11-23T17:24:04.637+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Amycos Cyrus,realm=EUW,application-id=KYnfKGf0,discussion-id=HwVQfwBE,comment-id=0001,timestamp=2019-11-22T22:25:08.473+0000)\n>\n> Die Ehrung an Gegner wurde entfernt, weil dem gegnerischen Team zu wenig Informationen für diese Handlung vorliegen. Sie können nur Inhalte des All-Chats sehen und wissen somit gar nicht, wie er im Chat wirklich agiert und auch über sein Verhalten auf der Karte kann man nur etwas im Bereich der eigenen Vision sagen.\n> Aus diesem Grund wurde das \"Ehrenwerter Gegner\" entfernt. Vermutlich gab es zu oft die Konfrontation, dass ein Spieler vom Gegner geehrt und vom eigenen Team reportet wurde.\n\nEs wurde entfernt, weil das niemand genutzt hat, wie gesagt.","replies":[{"poster":"Amycos Cyrus","date":"2019-11-23T22:56:33.203+0000","up_votes":1,"down_votes":0,"body":"Nein. Es wurde durchaus recht oft genutzt. Das alte Honor-System hat auch deutlich mehr Ehrungen hervorgebracht, weil man (wie aktuell noch bei den Reports) bis zu 3 Spieler ehren konnte.","replies":[{"poster":"MeMyselfandBaal","date":"2019-11-25T03:55:48.852+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Amycos Cyrus,realm=EUW,application-id=KYnfKGf0,discussion-id=HwVQfwBE,comment-id=000100000000,timestamp=2019-11-23T22:56:33.203+0000)\n>\n> Nein. Es wurde durchaus recht oft genutzt. Das alte Honor-System hat auch deutlich mehr Ehrungen hervorgebracht, weil man (wie aktuell noch bei den Reports) bis zu 3 Spieler ehren konnte.\n\nTrotzdem war es irgendwann quasi unmöglich mit der \"Ehrungen-Schleife\" rumzurennen. Vertrau mir da, ich hatte die ein halbes Jahr lang. Dann ist das mit den Ehrungen mehr und mehr eingeschlafen und irgendwann hat man diese Schleifen gar nicht mehr gesehen. Deswegen hat Riot das neue System eingeführt.","replies":[{"poster":"Amycos Cyrus","date":"2019-11-25T08:44:00.277+0000","up_votes":1,"down_votes":0,"body":"Dafür hätte man kein neues System benötigt, sondern hätte es (wie jetzt) den Spielern etwas besser präsentieren müssen.\nWär die Ehrungsvergabe immer noch wie die Reportvergabe (als Icon, das erst erscheint, wenn man über dieses hovert) und nicht so dominant präsentiert wie jetzt, dann würde auch das jetzige System keiner nutzen. (Sofern es tatsächlich etwas damit zutun hatte.)\n\nZusätzlich ist das kein Grund dafür die Ehrung für den Gegner zu streichen.","replies":[]}]},{"poster":"You Got My Name","date":"2019-11-24T10:35:56.313+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Amycos Cyrus,realm=EUW,application-id=KYnfKGf0,discussion-id=HwVQfwBE,comment-id=000100000000,timestamp=2019-11-23T22:56:33.203+0000)\n>\n> Nein. Es wurde durchaus recht oft genutzt. Das alte Honor-System hat auch deutlich mehr Ehrungen hervorgebracht, weil man (wie aktuell noch bei den Reports) bis zu 3 Spieler ehren konnte.\n\nEben nicht. Das Alte system wurde so gut wie gar nicht mehr genutzt, weil viele nach ende es games lieber ins nächste game gegangen sind als noch jemand zu honorn. Deswegen wurde es ja überarbeitet.","replies":[]}]}]}]},{"poster":"You Got My Name","date":"2019-11-22T22:17:34.042+0000","up_votes":2,"down_votes":2,"body":"Niemand hat es wirklich genutzt. Würde auch in dann momentan Interface nicht rein passen.","replies":[{"poster":"need elo police","date":"2019-11-22T22:24:14.638+0000","up_votes":2,"down_votes":1,"body":"Was nicht passt, wird passend gemacht. Ich glaube kaum, dass das ein Problem ist. Wenn es selten genutzt wird, dann ist dies eher ein Grund.","replies":[]}]},{"poster":"Lunnaris01","date":"2019-11-24T18:16:37.914+0000","up_votes":1,"down_votes":0,"body":"Fände es eigentlich gut, ich honor immer gerne, aber manchmal hat man so teams, in denen es echt keiner verdient hat (alle beleidigen sich gegenseitig und gehen dann afk z.B.). Eine andere sache sind z.B. 5er premade teams, da honor verteilen an premades (vor allem vermehrtes) sowieso keinen oder nur einen minimalen einfluss hat.\nOb das dann selten genutzt wird ist ja eigentlich egal, schließlich gibt es ja keinen negativen Effekt dadurch. Man könnte im Honor screen einen kleinen Button einbauen, sodass man dann zum Gegnerteam wechselt und dort jemanden honorn kann. Ist ja nicht so, als würde dadurch irgendwie zusaätzliche Serverlast oder sonstwas entstehen.. Die implementation wäre sicher auch eine Sache von wenigen Minuten, im Prinzip ist ja schon alles da, man muss es nur fürs gegnerteam anwenden und statt der 3 Honors wieder ein 'honorable opponent' machen.","replies":[]}]}