{"poster":"Rosv Stuff","date":"2017-01-09T09:28:43.494+0000","title":"Que hago contra una camille?","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"Cual es el sentido del pj? No hay forma de entender que hacer con eso, siempre uno se olvida de permabanear el pj y si lo pickean de jg o de top ya hace bosta todo. Puede parecer un crypost, pero no podes flashear en la r, y en la tf te empiezan a pegar los 5. Como un campeon del dota donde si o si tenes que morir.","replies":[{"poster":"Nyán","date":"2017-01-09T10:20:12.109+0000","up_votes":1,"down_votes":2,"body":"Camille es muy fuerte en early (1-4), si pickeas un tanque o otro luchador y juegas pasivo temprano y no le dejas matarte, le ganas. Es relativamente squishy, así que en teamfights la explotan si trabajas con tu team.\n\nEn resumen, como contra todos los campeones, no le pelees cuando tenga ventaja. Si ella se tira con su E, le tiras un cc y corres xD\n\nSolo recuerda que le gana a literalmente todos en early si no la caga cósmicamente. Tal vez sea el primer campeón con un early tan fuerte.","replies":[{"poster":"CoronavirusC0V","date":"2017-01-09T10:31:07.897+0000","up_votes":3,"down_votes":0,"body":"no es solo fuerte en early, es fuerte en todas las fases, en late en especial","replies":[]},{"poster":"Alexander    ˆ ","date":"2017-01-09T10:28:37.345+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nyán,realm=LAS,application-id=v7qsfXsE,discussion-id=VbFceqxR,comment-id=0004,timestamp=2017-01-09T10:20:12.109+0000)\n>\n> Camille es muy fuerte en early (1-4), si pickeas un tanque o otro luchador y juegas pasivo temprano y no le dejas matarte, le ganas. Es relativamente squishy, así que en teamfights la explotan si trabajas con tu team.\n> \n> En resumen, como contra todos los campeones, no le pelees cuando tenga ventaja. Si ella se tira con su E, le tiras un cc y corres xD\n> \n> Solo recuerda que le gana a literalmente todos en early si no la caga cósmicamente. Tal vez sea el primer campeón con un early tan fuerte.\n\nParece darius con la pasiva de base esa cosa","replies":[{"poster":"Hayato","date":"2017-01-09T16:19:23.369+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alexx05,realm=LAS,application-id=v7qsfXsE,discussion-id=VbFceqxR,comment-id=00040000,timestamp=2017-01-09T10:28:37.345+0000)\n>\n> Parece darius con la pasiva de base esa cosa\n\nSi te quejas de darius que hasta una soraka le hace counter... ya veo porque opinas que camille esta rota. Los counters de camille son Fizz, Lux, Gnar, Mundo, riven. \n\nChamps con aguante o con mucha movildiad  o CC.","replies":[]}]}]},{"poster":"kiuhm","date":"2017-01-09T09:57:07.078+0000","up_votes":2,"down_votes":0,"body":"https://patitasdechancho.files.wordpress.com/2013/08/533987_120530618143338_1485397013_n1.jpg","replies":[]},{"poster":"HopelessRomantic","date":"2019-07-10T19:40:51.771+0000","up_votes":1,"down_votes":0,"body":"{{champion:114}} {{champion:24}} {{champion:223}}  le deberían ganar en cualquier fase del juego si se los juega bien(Tahm Kench siendo una posible excepción).\nCon {{champion:58}} podés apostar a stompear a Camille en early game, acumulando ventaja tal que es imposible que Camille vuelva a tener relevancia alguna durante la partida entera. Late game 3-4 items y paridad de experiencia, Camille le debería ganar, por bastante.\nOtros picks como {{champion:78}} {{champion:106}}{{champion:80}}{{champion:122}}  le ganan en early, pero en late game, no tienen chance de ganarle 1 vs 1.\n\n*Si tenés mucho drama con la R de Camille, sacando a Camille del área de su R, cancela inmediatamente el terreno creado por su R.","replies":[]},{"poster":"JD20Smurf","date":"2017-01-09T14:50:30.577+0000","up_votes":1,"down_votes":0,"body":"Pickear Illaoi y ya le ganaste.","replies":[]},{"poster":"zed de sange","date":"2017-01-09T14:26:00.263+0000","up_votes":1,"down_votes":0,"body":"sacas un singed y le haces proxy y te evitas pelear\neso o fedeas como un campeon :vvv","replies":[]},{"poster":"Charlôtte","date":"2017-01-09T13:50:15.754+0000","up_votes":1,"down_votes":0,"body":"_No edito el post anterior porque voy a tardar en escribir este y no quiero que contesten mientras añado esto._\n\nVi tu historial\nhttp://image.prntscr.com/image/463d7805890048eaa478446c4a1604a4.png \nEzreal, Kata y vos (lee) Tienen la habilidad de moverse de un lado a otro en un parpadeo. \nDurante su ulti:\nEzreal salta a las espaldas de Camille y realiza el combo. \nKata lanza una daga a sus espaldas, pega el salto atrás de ella en un segundo. \nCon lee, hacé el wardjump. \nTODO DENTRO DE LA ULTI DE CAMILLE, en cuanto te quiera dar cuenta ya se acabó el efecto y CORREEE\nAhora, para sacarla del campo Lee tiene su ulti y Poppy puede dale con la E, y Nauti con la Q lanzandole el ancla. \nCuando Camille lanza su E (el gancho) poppy tira W y el gancho se corta si hace a tiempo. \nNauti escapa de del gancho en un segundo porque básicamente tienen la misma habilidad. \nEzreal y Kata saltan a un lado o directamente frente a ella para terminar a sus espaldas. \nNo le tengas miedo a la W de Camille, es un decorado. \n\nEs complicado coordinar todo en el momento, pero es un ejemplo de lo que cada personaje puede hacer. Y hay más, mucho más. \n\nHem... qué mas... \nBueno, en las Teamfights puras, esas donde se dan con todo los 5 contra los 5 sí, ahí estás en el horno pa, pero es la gracia que tiene Camille, que te hagan desaparecer en un parpadeo. \nEliminandole los ataques básicos van a poder. Como Lulu haciendola ardilla, Teemo cegando, panteon y warwick esquivando... y no sé qué más.","replies":[]},{"poster":"Charlôtte","date":"2017-01-09T13:26:34.870+0000","up_votes":1,"down_votes":0,"body":"Yo puedo tirar flash en la R, el campo es lo suficientemente grande como para tirar flash :B \nDe la ulti de amumu no veo a nadie quejandose xd ahí quedás a merced hasta del soporte y ni hablar del daño mágico en late. \nLo que tenés que hacer es dejar de correr al borde, lo único que hacé es suicidarte. Corré por el campo y hacé que pierda tiempo mientras la atacás. \nHasta con Taliyah le pude ganar xd le lanzás la W y la hacés saltar hacia afuera del rango. \nUna vez que gaste su E te podés lanzar. Cuanto tire su W (el cono que la cura) acercate bien bien a ella y retrocedé apenas termine de hacer el ataque. \nDale masa nomás, no hay que ser cagon por un campo.","replies":[]},{"poster":"Vássilito","date":"2017-01-09T12:45:08.859+0000","up_votes":1,"down_votes":0,"body":"Quedarte afk.\n\nOkno xd No c bro, es un champ muy pesado","replies":[]},{"poster":"Kyousuke","date":"2017-01-09T12:23:39.287+0000","up_votes":1,"down_votes":0,"body":"pedir que tu soporte pickee blitz, pickear algo con cc para cuando te tire ulti, ver por donde se tira con la e (es bastante lenta) , alejarte o stunearla cuando carga su segunda Q para que no te de el true damage, gankearla cuando gaste su E o guardar un cc para que no se mueva de la pared, jugarle con cabeza es la mejor manera de ganarle, ademas en tf lo único que tenes que hacer es explotarla apenas se tire ya que normalmente se hará daño al inicio y después se tanqueara un poco. mientras mas juegues contra ella mas fácil se te hace ganarle. en el prox parche le cae un nerf a su vida por nivel y a la duración del escudo","replies":[]},{"poster":"iNGENiO","date":"2017-01-09T12:04:25.011+0000","up_votes":1,"down_votes":0,"body":"Lo mejor que podes hacer es banearla, cuando arranca la partida.\n\nPasa algo parecido como con yasuo, es un campeón que lo que tiene roto es el kit de habilidades.\n\nNo el daño o sus estadisticas.\n\nEl problema es el kit que tiene que es muy fuerte. \n\nEl gancho a las paredes principalmente es el problema que tiene. Es MUY largo. Recorre mucha distancia.","replies":[]},{"poster":"Tamer 01","date":"2017-01-09T11:19:59.235+0000","up_votes":1,"down_votes":0,"body":"puedes counterearla con vayne saliendo fuera del rango de la e sacándola para afuera de su r y dejar que cargue la q y dejarla que no la tenga \nusar un tank como kled es muy buena idea\ngaren igual\nvayne\netc","replies":[]},{"poster":"AC Wolf","date":"2017-01-09T09:53:17.303+0000","up_votes":1,"down_votes":0,"body":"Eso mismo me pregunto... Hoy justamente fui contra una maestria 7 ajajaja se me tiraba bajo torre asi que la de ir defensivo no me fue bn, ademas su nerfeo es solo 2 puntos de daño de ataque asi que tendremos que rezar para parches futuros","replies":[{"poster":"Rosv Stuff","date":"2017-01-09T10:33:14.266+0000","up_votes":1,"down_votes":0,"body":"Ami me toco un tipo que no tenia maestria, en flex, y la jugó 3 veces ya. Kda negativo y las 3derrotas, la usó jungla y empezó perdiendo y de la nada era ir tirar y apretar cualquier tecla y ya.","replies":[]}]},{"poster":"CoronavirusC0V","date":"2017-01-09T10:32:23.779+0000","up_votes":1,"down_votes":0,"body":"ponele al coco op en la cara y no hara nada{{champion:58}}","replies":[]},{"poster":"Flánn","date":"2017-01-09T10:08:57.459+0000","up_votes":1,"down_votes":0,"body":"Irte afk y llorar en un rincon\n\nLa verdad es que esta tan rota que no tiene counters lo unico que te queda por hacer es jugar algun tanque como Poppy o Nautilus para que no te divee cada vez que llegues a linea","replies":[]},{"poster":"Alexander    ˆ ","date":"2017-01-09T09:40:20.503+0000","up_votes":1,"down_votes":0,"body":"/ff","replies":[]},{"poster":"SnowHorse","date":"2017-01-09T10:42:41.291+0000","up_votes":1,"down_votes":1,"body":"{{champion:86}}\n\nyo estuve bastante tiempo sin jugar, me parece un poco roto eso del true damage + tanta movilidad en un campeón que si bien no es tank tampoco es blandito dependiendo como lo buildees","replies":[]}]}