{"poster":"Rosv Stuff","date":"2017-05-28T00:53:49.740+0000","title":"¿Porque me tiltea tanto jugar adc?","subforum":"Comportamiento del jugador","up_votes":7,"down_votes":1,"body":"Hola, m&aacute;s que nada vengo a hacer un descargo.\n\nPrimero que nada quiero aclarar que maineo jungla y soporte, dejando por &uacute;ltimo top y mid, y como la peor linea adc. \nPero siempre uno intenta aprender, con jugar adc en una normal no pasa nada. \n\nYo siempre que juego y cometo errores jugando de jungla o de soporte los admito , en la mayoria de los casos, exceptuando muy pocas veces cuando sali&oacute; mal un gank en alg&uacute;n lugar por X motivo.\nEl caso es que decidi jugar estas dos lineas, principalmente porque jugando jungla puedo salir de la mayorias de las ligas y se puede ser el unico jugador de la partida en el que podes subir la moral del equipo (O en otro caso comerte 4 reports gg jungla etc).\nY  soporte cuando toca un adc tolerable y que al perder la linea no se tiltea y puede llegar a remontar o capas que no, pero intent&oacute; jugar su partida.\nMi caso es este, me tilteo muy facil jugando adc, es como volver a bronce o plata 5, sin animos de ofender a ninguno.\nLas cosas que yo hago jugando como soporte, mi soporte en esta partida(Yo jugando de adc), simplemete no las hace, o no compra piedra y el jungla se la vive en bot.\nEl otro tema sumando que el soporte no sabe jugar muy bien soporte, es que no puedo afrontar un trade con nadie en 2 v 2 , necesito ser nestor kirchner para con un ojo mirar como me tradean y con el otro ojo mirar el mapa porque no hay un ward,(Estamos hablando de levels bajos , nivel 4 o 5, para ahorrarme los comentarios de &quot; compra un ward vos &quot;).\nIntent&eacute; jugar con caitlyn, lucian etc y me va mal (Si se&ntilde;ores con el adc m&aacute;s facil del juego lucian me va mal). Ezreal tengo un winrate en ranked de 4/1 pero siento que es un adc que no tiene da&ntilde;o.\n\nAl empezar mal como adc es la cl&aacute;sica empezar a que te toxiqueen como (Inserte voz de persona con retraso madurativo)\n-Pasame el nombre del que te bosteo.\n-Si as&iacute; juegan los diamante 4 mejor me quedo en mi liga\n-Argentino y bosteado , que m&aacute;s podes pedir en este servidor.\n\nNo podes probar una linea porque te toxiquean de 8 lados, no de 4 , de 8 lados porque del otro lado tambi&eacute;n se te rien.\nEl &uacute;ltimo baneo que tuve fue porque me toco adc autofill, termin&eacute; 0-9-1 con caitlyn.\n\nY nada, ese es el descargo o crypost del d&iacute;a de hoy. Perd&iacute; todas mis ganas de jugar adc nom&aacute;s, no puedo aprender a kitear como adc, a posicionarme a nada. Tuve la intenci&oacute;n de jugar adc por &uacute;ltima vez ya que ayer entre a clasificatoria con un premade y ninguno de los 5 sab&iacute;a jugar adc. Por ende uno era main garen y nada, ya saben el resto de la historia del buen garen adc...\n\nMe fui un poco por las ramas, pero quer&iacute;a saber si alguno m&aacute;s le pasa lo mismo, se tiltea muy rapido jugando la linea que m&aacute;s odia.","replies":[{"poster":"Rohaerlyn","date":"2017-05-28T01:34:18.125+0000","up_votes":4,"down_votes":1,"body":"Te tiltea porque el rol de adc es discutiblemente el mas dificil de jugar en microjuego, el rol de adc no perdona los errores,\nSi farmeas mal, el adc enemigo va a ser mas util que vos, si te paras mal te vas a morir, si sobreextendes te vas a morir, si no sabes manejar bien las mecanicas tanto complejas como genericas que comparten todos los tiradores (kiting, control de waves, carrear al ''me toco supp comodin asi que voy a jugar zed support'' etc) esto provoca que los adc sean mucho mas propensos a ser la causa de derrotas, pero a la vez, esa culpa es tambien en muchas ocasiones del soporte, porque la utilidad que aportan los soportes no tiene que escalar, esta ahi y ya, en cambio si el soporte regala kills no sabe defender la posicion etc, el adc no va a poder escalar, y al minuto 20 cuando el adc enemigo tenga +60 cs arriba y vayase a saber cuantas kills a su favor, la gran mayoria de los jugadores tiende a inclinarse a pensar algo como ''que adc asco que nos tocó'' siendo que el soporte es influyente en la bot lane por el solo hecho de ser una linea 2v2, yo no tendria ningun dilema en jugar una linea 1v1 contra un adc en solo, pero 1v2, ya es otra cosa, eso de ''el supp siempre carrea al adc'' es una excusa que usan los main soporte para inflarse el ego, de cada 10 partidas que juego, con suerte en una o dos a lo mucho el soporte es una fuerza influyente en la partida, en el resto de los casos casi siempre tiende a ser algo como ''bueno, yo tiro mi ganchito burbuja etc y que el adc haga todo el resto del trabajo'' (esto es lo mas literal que se puede describir, diamante 5 y me toca gente que con 3 asesinos en frente pickea brand o maokai support)\nhay algunos que si provocan jugadas muy fuertes, en su mayoria siempre resultan ser {{champion:432}} , algunas veces {{champion:412}} , pero en su mayoria los soportes que me tocan en clasificatorias son del tipo estrellita de arena\npara reducir esto al minimo opté por jugar de {{champion:498}}  porque esta tan rota que es practicamente auto suficiente.\nSuerte.","replies":[{"poster":"Rosv Stuff","date":"2017-05-28T01:48:55.476+0000","up_votes":2,"down_votes":0,"body":"\" diamante 5 y me toca gente que con 3 asesinos en frente pickea brand o maokai support \"\n\nMe habrá tocado más de uno de estos, que encima le preguntas. Disculpa, queres ir mi linea y yo voy soporte ? Y te dicen no deja, voy fiddlestick soporte rinde , o maokai full ap soporte. Lvl 18 rengar y zed del otro lado tu adc desaparece. \n\nUltimamente me vienen tocando buenos adcs, exceptuando el garen adc que tuve la ultima ranked. Pero me vienen tocando muchos adcs y me considero bueno con thresh, soy muy agresivo y a la vez suelo ser un only peel, el tema es que cuando juego adc no me tocan nunca esos soportes que te wardean y se hacen mikael para vos.","replies":[{"poster":"THaseoT","date":"2017-05-28T09:45:17.678+0000","up_votes":1,"down_votes":0,"body":"JAJAJAJAAJA \"exceptuando al garen adc que tuve la ultima ranked\" OMG {{champion:86}} {{item:3031}}","replies":[]}]},{"poster":"Maii Supp UwU","date":"2017-05-28T04:04:14.863+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rohaerlyn,realm=LAS,application-id=PJAKt7ph,discussion-id=LF379K6H,comment-id=0000,timestamp=2017-05-28T01:34:18.125+0000)\n>\n> Te tiltea porque el rol de adc es discutiblemente el mas dificil de jugar en microjuego, el rol de adc no perdona los errores,\n> Si farmeas mal, el adc enemigo va a ser mas util que vos, si te paras mal te vas a morir, si sobreextendes te vas a morir, si no sabes manejar bien las mecanicas tanto complejas como genericas que comparten todos los tiradores (kiting, control de waves, carrear al &#x27;&#x27;me toco supp comodin asi que voy a jugar zed support&#x27;&#x27; etc) esto provoca que los adc sean mucho mas propensos a ser la causa de derrotas, pero a la vez, esa culpa es tambien en muchas ocasiones del soporte, porque la utilidad que aportan los soportes no tiene que escalar, esta ahi y ya, en cambio si el soporte regala kills no sabe defender la posicion etc, el adc no va a poder escalar, y al minuto 20 cuando el adc enemigo tenga +60 cs arriba y vayase a saber cuantas kills a su favor, la gran mayoria de los jugadores tiende a inclinarse a pensar algo como &#x27;&#x27;que adc asco que nos tocó&#x27;&#x27; siendo que el soporte es influyente en la bot lane por el solo hecho de ser una linea 2v2, yo no tendria ningun dilema en jugar una linea 1v1 contra un adc en solo, pero 1v2, ya es otra cosa, eso de &#x27;&#x27;el supp siempre carrea al adc&#x27;&#x27; es una excusa que usan los main soporte para inflarse el ego, de cada 10 partidas que juego, con suerte en una o dos a lo mucho el soporte es una fuerza influyente en la partida, en el resto de los casos casi siempre tiende a ser algo como &#x27;&#x27;bueno, yo tiro mi ganchito burbuja etc y que el adc haga todo el resto del trabajo&#x27;&#x27; (esto es lo mas literal que se puede describir, diamante 5 y me toca gente que con 3 asesinos en frente pickea brand o maokai support)\n> hay algunos que si provocan jugadas muy fuertes, en su mayoria siempre resultan ser {{champion:432}} , algunas veces {{champion:412}} , pero en su mayoria los soportes que me tocan en clasificatorias son del tipo estrellita de arena\n> para reducir esto al minimo opté por jugar de {{champion:498}}  porque esta tan rota que es practicamente auto suficiente.\n> Suerte.\n\noye tranquilo viejo {{champion:432}}","replies":[]}]},{"poster":"MrDec","date":"2017-05-28T07:11:36.698+0000","up_votes":2,"down_votes":0,"body":"Creo que también ayuda poco que todo el mundo quiera matar al adc, me la juego que si pones los 5 champs uno al lado del otro y le das a alguien al oportunidad de matar 1 de seguro es el adc. Es un embole cuando te hacen carpita en bot.\n\nY el tema de los supp que no sacan siquiera wards la verdad no lo entiendo, la gente no se da cuenta que sin visión no se puede ganar. (Da mas bronca todavía cuando uno juega supp y hace todo \"bien\", después cambias de línea y te toca un supp que dios mio...) \n\nIgual mejor ni hablo porque creo que habré jugado que... 5 games de adc? los perdí todos.","replies":[{"poster":"Rosv Stuff","date":"2017-05-28T11:23:26.276+0000","up_votes":1,"down_votes":0,"body":"Idem, se sacan redención primer item. Y ni hablar de los soportes ap...","replies":[]}]},{"poster":"DJ ALEXXX","date":"2017-05-29T15:14:53.983+0000","up_votes":1,"down_votes":0,"body":"Me siento en algunas cosas identificado con vos y mas en eso de jugar mal caitlyn,no se porque no se me da y todos siempre dicen que es el adc mas facil y es con el que peor me va y con otros adc mas dificil me va bien no entiendo nada ya,bueno y lo peor de todo de jugar el rol de adc es que siempre te hacen el focus y te quieren dejar por detrás,por eso respeto a los main adc viviendo esto cada día y no frustrarse o tiltearse","replies":[]},{"poster":"TSW Rorschach","date":"2017-05-28T06:54:39.396+0000","up_votes":1,"down_votes":0,"body":"A mi me pasa eso, pero con jg. Veo que mi team va mal o se comen la misma de siempre (el Lee aparece en el minimapa por el rio por el ward del cangrejo, pero de todas formas voy a seguir pusheando mientras dejo bajo torre al mid enemigo para que me enganchen y luego echarle la culpa al jg porque no me gankeó antes...) y me tilteo, jugando pésimo, gankeando sin lograr nada, no puedo robar ni un buffo, me hacen counterjg entre 3, el jg enemigo me pasa por encima, tardo una eternidad en limpiar campamentos hasta con los mejores champs para eso... por lo que es un rol que me resulta imposible de todos lados, por más que trate de practicarlo ya derechamente lo odio.\n\n Lo he intentado un montón de veces con los personajes más fáciles (ww nuevo 2/12; Yi 3/9), o con casi todos los otros jgs, dentro y fuera del meta (si muchachos, también Sejuani 3/10). Veo todos los días a Nighblue3 que me encanta, pero es un rol con el que simple y llanamente,** no puedo**. Me frustra muchísimo a menos que TODOS en mi team vayan perfecto stompeando y el jg enemigo esté afk. Lo curioso es que no estoy jodiendo, la partida que gané de jg fue por eso...","replies":[{"poster":"Rosv Stuff","date":"2017-05-28T11:26:27.908+0000","up_votes":1,"down_votes":0,"body":"Enrealidad, como me aclararse , ww no es un personaje fácil, yi tampoco, con yi empezas mal o empezas bien, si empezaste mal anda a farmear nomas y nos vemos a lvl 17. El nuevo sejuani es una porqueria, tenes que pegar como 3 o 4 habilidades y tambien nos vemos en late.\n\nYo empezé jungleando con elise, es el único campeon que puede llegar a nivelar ganks con el farm(Si es que recien empezas como jungla), podes gankear divear etc... La gente deja de usarlo porque al gankear con elise erra el cucun y se va de linea cuando lo que tenes que seguir haciendo es pegandole.","replies":[{"poster":"TSW Rorschach","date":"2017-05-29T00:41:43.519+0000","up_votes":1,"down_votes":0,"body":"Es que al menos de los videos que veo, recomendaban Yi o ww para empezar ya que entre uno que tiene un daño insano con sus ítems y buena limpieza ~~aunque no sé si soy yo pero me tardo una eternidad jungleando...~~ y otro que tiene un gran aguante y gran robo de vida dije \"Hey, se ven fáciles y por lo que veo son bastante efectivos a su manera, quizá pueda practicarlos para mejorar en el rol :D\"\nNeh, me rendí a las 5-7 derrotas después de que los mains jg me pasaran como trapo de piso. Es como esos casos en los que dices \"Diablos, no parece difícil y he seguido casi al pie de la letra 200 videos de junglas, por qué parezco troll entonces?\"\nDe Sejuani la he visto stompear tanto que no entendía qué hacía mal para feedear así xd pero bueno, quizá me equivoque.\n\nElise creo que fue la única que me gustó por los ganks que puede hacer, pero entre que nunca llego a los 6300 y que cada vez que voy jungla la paso fatal bueno, no es mucha motivación xD","replies":[]}]}]},{"poster":"LaggerGT","date":"2017-05-28T22:32:17.065+0000","up_votes":1,"down_votes":0,"body":"Tenes que enfocarte en el rol que tenes en la partida.\n\nComo supp la tenes clara, wards, peel, trade. Genial!\nComo jg tambie, ganks, objetivos, contrajg, contra gank etc. Tu sabras (no juego jg xD)\n\nComo adc tu rol es simple, farmear y hacer daño, si bien el supp que te toque puede ser un inutil como dices entonces juga como si el supp no estuviese en la linea, juga atras y wardea vos (nivel 9 comprate el ward azul, obligatorio)\nPor ultimo aprovecha las pequeñas oportunidades para hacer daño, ejemplo:\n- Si el supp enemigo gasto su stun y no acerto\n- Si le estan pegando a tu supp (aunq sea un inutil lo podes usar como una distraccion)\n- Si cometen jugadas que consideres dudosas (x ejemplo que la caitlyn tire mal la red y quede expuesta, o una voltereta de vayne mal ejecutada)\n\nPara mi el adc es oportunista, y siempre te van a hacer focus asi que hace de cuenta que estas solo en la partida y tenes que esquivar todos los skillhots, saltos de zac y hongos de teemo que puedas.\nSi en algun momento milagroso un aliado comienza a hacerte peel, esa es tu oportunidad para contraatacar. Si no hay peel entonces el kiteo es tu mejor opcion.\n\nComo digo aprovecha las oportunidades tanto en linea como en el resto de la partida y compra wards.\n\nCreo que se me fue la mano con este testamento pero bueno jaja.\n{{sticker:zombie-brand-clap}} \n\nSlaudos, gracias por leer","replies":[]},{"poster":"Sorakarrying you","date":"2017-05-28T01:37:02.950+0000","up_votes":1,"down_votes":0,"body":"Si tienes supports malos como dices, aprende a congelar linea y mantenla cerca de torre, asi no tendras problemas con el engage de los enemigos o con el jungla y fin del asunto\nQuizas no es problema de tus supports, sino tuyo que no te sabes coordinar con ellos al momento de tradear, quizas vives pusheando y no miras si tu support tiene wards disponibles etc etc etc\nPor ultimo consigue un buen duo support, practica adc en normales y una vez lo domines empieza a jugar con supports randoms","replies":[{"poster":"Diosmo","date":"2017-05-28T22:10:30.725+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sorakarrying you,realm=LAS,application-id=PJAKt7ph,discussion-id=LF379K6H,comment-id=0001,timestamp=2017-05-28T01:37:02.950+0000)\n>\n> Si tienes supports malos como dices, aprende a congelar linea y mantenla cerca de torre, asi no tendras problemas con el engage de los enemigos o con el jungla y fin del asunto\n> Quizas no es problema de tus supports, sino tuyo que no te sabes coordinar con ellos al momento de tradear, quizas vives pusheando y no miras si tu support tiene wards disponibles etc etc etc\n> Por ultimo consigue un buen duo support, practica adc en normales y una vez lo domines empieza a jugar con supports randoms\n\nTenes razon en lo de congelar la linea. Pero que pasa cuando tenes un \"support\" con actitud de Rambo que se tira para adelante, sea tank, mago o random sup como Zed? Despues empiezan adc c*gón, seguime, etc. Y cuando menos te das cuenta le dio 3 kills al adc rival cuando uno intenta farmear.\nEn Bronce-Plata hay mil temas, wards olvidate que compren el item (salvo que sea sup real), ves que el sup enemigo se mete en el bush y se tira y el tuyo no wardea para tener vision y poder farmear, etc. \nY uso las baratijas y siempre tengo pinks a mano.","replies":[]},{"poster":"Maii Supp UwU","date":"2017-05-28T04:10:10.815+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sorakarrying you,realm=LAS,application-id=PJAKt7ph,discussion-id=LF379K6H,comment-id=0001,timestamp=2017-05-28T01:37:02.950+0000)\n>\n> Si tienes supports malos como dices, aprende a congelar linea y mantenla cerca de torre, asi no tendras problemas con el engage de los enemigos o con el jungla y fin del asunto\n> Quizas no es problema de tus supports, sino tuyo que no te sabes coordinar con ellos al momento de tradear, quizas vives pusheando y no miras si tu support tiene wards disponibles etc etc etc\n> Por ultimo consigue un buen duo support, practica adc en normales y una vez lo domines empieza a jugar con supports  \n\n exactamente, mi amigo main adc me ayudo mucho en mis primeros pasos como main support luego de 3 meses empece a jugar solo y tratar de saber jugar con adcs randoms según si eran inexpertos o ya tenían la facilidad de comunicarse con el supp mediante jugadas","replies":[]},{"poster":"Rosv Stuff","date":"2017-05-28T01:52:42.227+0000","up_votes":1,"down_votes":0,"body":"Soporte malos no tengo, son personas que no saben jugar soporte asi como yo tampoco se jugar adc, combinados en bot somos nada, y siempre es el tóxico el otro, (adc malo etc etc)\nPara que te des una idea, la ultima de adc que perdí , perdi contra un xerath apc y un maokai soporte, pero eran 4 premades me caian en bot todo el tiempo y nada. Esa si fue una buena tilteada,\n\nYa de por si no quiero tocar mas adc, me quedo con mis lineas nomás. Tuve la intención de aprender pero se me hace imposible, prefiero no aprender antes que perder 20 o 30 minutos con 4 personas que te flamean y no te ayudan en linea.","replies":[]}]},{"poster":"WhiteMax","date":"2017-05-28T13:05:53.770+0000","up_votes":1,"down_votes":1,"body":"Hoy en dia ya nadie culpa al sup por perder linea y si lo hacen es por el tema de que si hizo full ap o literalmente le quita el farm aproposito.\n\nA mi me tiltea que cuando juego Adc y mi Sup quiera decidir como jugar, tipo si yo quiero jugar pasivo porque en agresivo nos va a gankear un {{champion:64}}, y a el le da igual, y si muere me reclama por ello.","replies":[]}]}