{"poster":"ÐankGamer420","date":"2017-02-07T19:54:37.547+0000","title":"Nicht mehr in der Promo","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich war gerade mit einem Freund in der Warteschlange um ein Ranked zu zocken. Ich war dann in der Champion select und mir wurde dann ein Fehler angezeigt. LolClient.exe reagiert nicht. Ich habe dann 5x auf: Auf Antwort des Programms warten. Mein Lol hat sich dann automatisch geschlossen und ich habe -3 LP bekommen. Meine Promo wurde auch aufgel&ouml;st. \r\nKann man mir einen Freewin, +3Lp oder mich wieder in die Promo setzen mit 1 Loos von 3 Spielen? \r\n\r\nOder kann mir jemand einfach eine Antwort geben. Ich m&ouml;chte noch auf Gold kommen und wenn sowas passiert dann geht meine Laune runter. \r\n\r\nBitte helft mir da weiter. \r\n\r\nMFG. NoobGamer4990","replies":[{"poster":"Master Mírror","date":"2017-02-08T10:27:47.554+0000","up_votes":1,"down_votes":0,"body":"1 Leave aus dem Champselect zählt wie ein Lose, egal ob du daran schuld bist oder nicht, hast du 3 verloren von 5 oder 2 von 3 ist die Promo vorbei und du musst die wiederholen, jedoch wird dir beim 2ten Einstieg in die selbe Promo ein Freewin gegeben. Vorrausgesetzt du warst schonmal in der Promo, 1 Punkt davor ändert nichts.","replies":[{"poster":"ÐankGamer420","date":"2017-02-08T11:15:05.389+0000","up_votes":1,"down_votes":0,"body":"Ich habe kein Freewin bekommen. Habe dann noch eins gemacht und bekam nicht mal ein Freewin...","replies":[{"poster":"Master Mírror","date":"2017-02-08T11:17:12.367+0000","up_votes":1,"down_votes":0,"body":"Naja eigentlich ist es unwahrscheinlich in einer Promo zu sein und nach 1nem Win rauszufliegen, du musst mindestens 2 mal verlieren dazu.","replies":[{"poster":"ÐankGamer420","date":"2017-02-11T23:43:14.207+0000","up_votes":1,"down_votes":0,"body":"Ich hatte aber 1 loos und wurde gekickt. Habe kein Free win bekommen und bin aus der Promo geflogen. Habe es aber jetzt trotzdem zu S4 geschaft","replies":[]}]},{"poster":"Master Mírror","date":"2017-02-08T11:19:13.481+0000","up_votes":1,"down_votes":0,"body":"Und wenn du in der Promo sagen wir zu Gold bist , und 1 mal verloren hast wegen nem Leave und weiter machst , bleibt der Lose der wird sich nicht ändern, den Free win bekommst du nur wenn du schoneinmal in der Promo warst und dann die Promo wiederholst weil du nochmal da rein kamst","replies":[]}]}]},{"poster":"Axcite","date":"2017-02-07T20:12:59.052+0000","up_votes":1,"down_votes":0,"body":"Nein","replies":[]}]}