{"poster":"KataIsMyBae","date":"2017-05-30T11:33:40.610+0000","title":"login geht nicht","subforum":"Client Diskussion","up_votes":3,"down_votes":0,"body":"Wenn ich versuche mich einzuloggen stimmen alle Daten aber er kommt nicht in Lol rein(also meinen acc) sondern er versucht eine Minute mich einzuloggen aber nach kurzer zeit steht &uuml;ber meinem user Name dann : unable to connect to your Login Queue, hab die Server schon gecheckt, sind alle online","replies":[{"poster":"webuniii","date":"2017-06-03T17:07:12.645+0000","up_votes":1,"down_votes":0,"body":"Sicherheitszertifikate deaktivieren\nGelegentlich erhältst du eine Fehlermeldung darüber, dass es ein Problem mit dem Sicherheitszertifikat einer Website gibt. Das Zertifikat einer Seite erlaubt dem Internet Explorer, eine sichere Verbindung mit der Seite aufzubauen. Weil du dich mit einem sicheren League of Legends-Client verbindest, benötigst du keine zusätzliche Verifikation. Da der Internet Explorer Seiten blockt, von denen er keine Zertifikate erhält, musst du vielleicht vorübergehend Zertifikate deaktivieren, um dich bei League of Legends einzuloggen. Das kannst du wie folgt tun (neueste Version des Internet Explorers):\nÖffne den Internet Explorer und klicke auf das Zahnrad in der oberen rechten Ecke des Browsers.\nKlicke auf Internetoptionen im Drop-Down-Menü.\nGehe zum Reiter Erweitert.\nEntferne das Häkchen bei Auf gesperrte Serverzertifikate überprüfen.\nEntferne das Häkchen bei Auf gesperrte Zertifikate von Herausgebern überprüfen.\nEntferne das Häkchen bei Warnung anzeigen, wenn die Zertifikatadresse nicht übereinstimmt.\n\nProbiere das mal zu erledigen hatte auch das Problem und dieser Punkt hatte mir dabei geholfen.\nFalls dies nicht der Fall ist arbeite alle Punkte ab wie sie hier beschrieben sind : https://support.riotgames.com/hc/de/articles/201761944","replies":[]},{"poster":"Lord Hargen","date":"2017-05-30T17:39:29.927+0000","up_votes":1,"down_votes":0,"body":"Hatte gerade das gleiche Problem, HExtech-Tool laufen gelassen und ging wieder.","replies":[]},{"poster":"Sponki69","date":"2017-05-30T13:13:38.939+0000","up_votes":1,"down_votes":0,"body":"Habe auch das Problem,\nhabe schon das HExtech-Tool laufen lassen. \nNeu instaliiert, nochmals gepached.\n\nKomme einfach nicht rein.\n\nGibts schon Lösungen?\n\nEdit:\nHabe nochmals gepatched, jetzt geht es","replies":[]},{"poster":"Lars Hítten","date":"2017-05-30T13:09:23.481+0000","up_votes":1,"down_votes":0,"body":"Habe es gestern und Heute auch. Gestern half es sich vom 2. Pc anzumelden. danach ging es auch auf dem 1. Heute geht gar nichts","replies":[]},{"poster":"Inventive","date":"2017-05-30T13:02:14.897+0000","up_votes":1,"down_votes":0,"body":"Habe seit 3 Tagen das selbe Problem.","replies":[]}]}