{"poster":"ı Sona ı","date":"2019-01-10T21:21:32.235+0000","title":"Griefing is the Powder Keg Exploding, but Flaming is the Spark that ignites it.","subforum":"Player Behavior","up_votes":23,"down_votes":13,"body":"How many times have you seen one player flame another and then they afk or start griefing?\r\n\r\nHow many times have you been the player who flamed someone else for an unfortunate gank or they got caught out, and then they afked or started running it down lane?\r\n\r\nHow many times were you the one who got flamed and so you started griefing or afking?\r\n\r\nWe can&#039;t control others but we can control ourselves. If you want less griefers and trolls then stop setting them off. I know that isn&#039;t fair to you and you shouldn&#039;t have to put more effort into being mature than them, but you have no real other option.\r\n\r\nYou win by adjusting your strategy to win.\r\n\r\n\r\n{{sticker:sona-playing}}","replies":[{"poster":"R107 Games","date":"2019-01-10T21:34:49.874+0000","up_votes":10,"down_votes":16,"body":"> [{quoted}](name=ı Sona ı,realm=NA,application-id=ZGEFLEUQ,discussion-id=APcXLmjW,comment-id=,timestamp=2019-01-10T21:21:32.235+0000)\n>\n> How many times have you seen one player flame another and then they afk or start griefing?\n\nLike 5% of the time?\n\n> How many times have you been the player who flamed someone else for an unfortunate gank or they got caught out, and then they afked or started running it down lane?\n\nLike 2% of the time?\n\n> How many times were you the one who got flamed and so you started griefing or afking?\n\n0% of the time lmao.\n\n> We can&amp;#039;t control others but we can control ourselves. If you want less griefers and trolls then stop setting them off. \n\nTheir mentality is what \"sets them off\". And that is their problem.\n\n> I know that isn&amp;#039;t fair to you and you shouldn&amp;#039;t have to put more effort into being mature than them, but you have no real other option.\n\nBeing more mature than them is not going to do anything. If they want to troll or grief, they will do it.\n\n> You win by adjusting your strategy to win.\n\nWhy is that relevant to your argument?","replies":[{"poster":"Jojobees","date":"2019-01-10T22:31:04.550+0000","up_votes":7,"down_votes":6,"body":"You're pretty active in the player behavior forum, but this is the first comment you've posted that I actually agree with. @OP Trolls/afks are usually the target of toxicity, not the other way around. Also, can we get a 1 year ban on OP for openly admitting to griefing?","replies":[{"poster":"SyraKen","date":"2019-01-10T22:48:15.870+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Jojobees,realm=NA,application-id=ZGEFLEUQ,discussion-id=APcXLmjW,comment-id=00000001,timestamp=2019-01-10T22:31:04.550+0000)\n>\n> You&#x27;re pretty active in the player behavior forum, but this is the first comment you&#x27;ve posted that I actually agree with. @OP Trolls/afks are usually the target of toxicity, not the other way around. Also, can we get a 1 year ban on OP for openly admitting to griefing?\n\n? Not sure what you're saying to OP, they said that players who troll/afk are the ones getting flamed/being toxic'd at... \n\nAlso here does OP say they have griefed? Are you thread trolling?","replies":[{"poster":"Jojobees","date":"2019-01-10T23:02:41.433+0000","up_votes":5,"down_votes":0,"body":"OP is saying that players who troll/afk are doing so because they were getting flamed. I am saying that they are getting flamed because they are trolling/afking.\n\n> How many times were you the one who got flamed and so you started griefing or afking?\n\nOP is implying that it is common practice and acceptable to grief or afk when you are the target of toxicity. When you grief/afk you're effecting 9 other players. This is not ok, whether or not you were being flamed.","replies":[{"poster":"Kei143","date":"2019-01-11T01:40:33.860+0000","up_votes":4,"down_votes":0,"body":"The cycle of troll and flame continues. We will do something against toxicity, and they would get punished. \n\n{{champion:75}}\n\n.\n.\n.\n.\n\nWait, that didn't come out right. \n\nOh well.\n\n{{sticker:sg-lulu}} ","replies":[]},{"poster":"Larriet","date":"2019-01-11T00:32:39.065+0000","up_votes":1,"down_votes":0,"body":">OP is implying that it is … acceptable to grief or afk when you are the target of toxicity. \n\n\"I know that isn't fair to you and you shouldn't have to put more effort into being mature than them...\"\n\nWe all agree that to grief or afk is unacceptable.  Flaming is also unacceptable, but this isn't meant to be an indictment of flamers; the main point is that people with bad attitudes put others in a bad mood, so it's in your best interest not to flame.  In other words, people who instigate are more likely to come across bad behavior.  I agree flaming is not the cause of such behavior, but it can be a catalyst.  This is more advice about how to get less griefing, not meant to blame the victim, so to speak.\n\nPlease report people who grief/afk after getting flamed.  They are not excused just because someone else \"started it\".","replies":[]}]}]},{"poster":"ı Sona ı","date":"2019-01-10T22:49:26.135+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Jojobees,realm=NA,application-id=ZGEFLEUQ,discussion-id=APcXLmjW,comment-id=00000001,timestamp=2019-01-10T22:31:04.550+0000)\n>\n>  @OP Trolls/afks are usually the target of toxicity, not the other way around. Also, can we get a 1 year ban on OP for openly admitting to griefing?\n\n{{sticker:sg-lux-2}} \n\nDid you even read?","replies":[{"poster":"Jojobees","date":"2019-01-10T23:01:01.545+0000","up_votes":3,"down_votes":1,"body":"> How many times were you the one who got flamed and so you started griefing or afking?\n\nOP is implying that it's common practice and acceptable to grief or afk when you are the target of toxicity.\n\nI'm stating that typically, when someone is afking/griefing it's not the effect of toxicity, but rather either the cause. Though in some cases both players go into the match with the intent of causing harm.","replies":[{"poster":"ı Sona ı","date":"2019-01-11T06:22:52.549+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Jojobees,realm=NA,application-id=ZGEFLEUQ,discussion-id=APcXLmjW,comment-id=0000000100010000,timestamp=2019-01-10T23:01:01.545+0000)\n>\n> OP is implying that it&#x27;s common practice and acceptable to grief or afk when you are the target of toxicity.\n> \n> I&#x27;m stating that typically, when someone is afking/griefing it&#x27;s not the effect of toxicity, but rather either the cause. Though in some cases both players go into the match with the intent of causing harm.\n\nNo one here not a troll has said griefing is acceptable, just that it is common enough following the chain of events laid out.","replies":[]}]}]},{"poster":"HeyyItsAcarrot","date":"2019-01-11T02:19:11.011+0000","up_votes":1,"down_votes":0,"body":"i agree","replies":[]}]},{"poster":"ı Sona ı","date":"2019-01-10T21:35:39.398+0000","up_votes":9,"down_votes":3,"body":"> [{quoted}](name=R107 Games,realm=NA,application-id=ZGEFLEUQ,discussion-id=APcXLmjW,comment-id=0000,timestamp=2019-01-10T21:34:49.874+0000)\n>\n> Like 5% of the time?\n> \n> Like 2% of the time?\n> \n> 0% of the time lmao.\n> \n> Their mentality is what &quot;sets them off&quot;. And that is their problem.\n> \n> Being more mature than them is not going to do anything. If they want to troll or grief, they will do it.\n> \n> Why is that relevant to your argument?\n\nBecause the average player in an average game flames someone for something. Even a Yikes can be enough. If they adjust their winning strategy from flaming to not flaming, that'll make all the change.","replies":[{"poster":"R107 Games","date":"2019-01-10T21:39:57.808+0000","up_votes":5,"down_votes":9,"body":"> [{quoted}](name=ı Sona ı,realm=NA,application-id=ZGEFLEUQ,discussion-id=APcXLmjW,comment-id=00000000,timestamp=2019-01-10T21:35:39.398+0000)\n>\n> Because the average player in an average game flames someone for something.\n\nHow do you know that?\n\n> Even a Yikes can be enough. If they adjust their winning strategy from flaming to not flaming, that&#x27;ll make all the change.\n\nIt won't do anything 99% of the time. A true troll will grief whenever they feel like it, or when their team's gameplay is setting them off.","replies":[]}]},{"poster":"Kei143","date":"2019-01-11T02:11:24.697+0000","up_votes":1,"down_votes":1,"body":"Wouldn't that mean that you've personally dropped your winrate by 2%? \n\nI mean, if you cared about winning so much, wouldn't it be part of the META (Most Effective Tactic Available) to not flame and not tilt your teammate?","replies":[{"poster":"Aladoron","date":"2019-01-11T12:25:56.675+0000","up_votes":1,"down_votes":0,"body":"> Wouldn't that mean that you've personally dropped your winrate by 2%? \n\nWhat are you talkin' about? Where did he say this? O.o","replies":[]},{"poster":"R107 Games","date":"2019-01-11T02:30:01.094+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Kei143,realm=NA,application-id=ZGEFLEUQ,discussion-id=APcXLmjW,comment-id=00000002,timestamp=2019-01-11T02:11:24.697+0000)\n>\n> Wouldn&#x27;t that mean that you&#x27;ve personally dropped your winrate by 2%? \n\n> I mean, if you cared about winning so much, wouldn&#x27;t it be part of the META (Most Effective Tactic Available) to not flame and not tilt your teammate?\n\nIt's a rare occurrence that my flame causes someone to troll. I think last time it happened was a year ago.\n\nI'm not even sure if i calculated the \"2%\" right. Basically the amount of games I've flamed (500), and it caused someone to troll in about 5 of them(this is just an example i have no fucking idea how many games I've flamed).\n\nFlame has helped me win games and discourage players from trolling, so the gains outweigh the losses by a large margin.","replies":[]}]}]},{"poster":"ØrnnToGetTrolleÐ","date":"2019-01-11T04:51:00.525+0000","up_votes":6,"down_votes":2,"body":"Griefers do what they want, because it is allowed. It has nothing to with my behavior. If they wanna do it, they will.\n\nI should be allowed to call them out on their shit, but I'm not. Because apparently some random text is far more punishable than a person who actually wants to ruin games. Mute button does not stop people from running it down/soft inting.\n\nStop trolling the boards. It's getting disgusting.","replies":[]},{"poster":"Aladoron","date":"2019-01-11T09:48:40.460+0000","up_votes":3,"down_votes":0,"body":"TBH I see it differently.\n\nI almost never see a player who wants to win a game flamed.  So in my experience it's the other way around, trolls/inters set off the flamers (mostly).","replies":[{"poster":"Illuminatra","date":"2019-01-12T03:37:40.151+0000","up_votes":2,"down_votes":1,"body":"thankfully only u have a brain ni this entire thread.\n\npeople actually think no one queues up to int/troll .\n\nthey actually think everyone of the intentional feeders you see punished are just victims who were told mean words.\n\nfucking pathetic how sensitive this generation is.\n\nqueue up for ur promos and get someone who picks ap ashe mid with mobi boots rush but godforbid you make a thread about it and they say you're flaming him which is why he did what he did.\n\nso fucking sad.","replies":[{"poster":"Midg3t","date":"2019-01-12T22:46:36.908+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Illuminatra,realm=NA,application-id=ZGEFLEUQ,discussion-id=APcXLmjW,comment-id=000b0000,timestamp=2019-01-12T03:37:40.151+0000)\n>\n> thankfully only u have a brain ni this entire thread.\n> \n> people actually think no one queues up to int/troll .\n> \n> they actually think everyone of the intentional feeders you see punished are just victims who were told mean words.\n> \n> fucking pathetic how sensitive this generation is.\n> \n> queue up for ur promos and get someone who picks ap ashe mid with mobi boots rush but godforbid you make a thread about it and they say you&#x27;re flaming him which is why he did what he did.\n> \n> so fucking sad.\n\nYea this generation is, kindly said, messed up. \nBut the worst thing is that they still think people are trolling JUST to get a reaction, when this is not true at all.\nTrolls main goal is to lose the game, most of the time. Getting a reaction is just a bonus. So those 'just mute them' advice is useless. Cuz trolls ALWAYS get what they want.\n\nAnd until Riot starts to focus on gameplay toxicity, verbal toxicity will continue to grow. Think of it as a Hydra. You can cut off one gead, but 2 new ones will grow back. That's how verbal toxicity works.","replies":[]}]}]},{"poster":"scazzman","date":"2019-01-13T01:54:44.140+0000","up_votes":2,"down_votes":0,"body":"in my experience it tends to be the opposite case, a player will troll or int, and then get flamed, not the other way around","replies":[]},{"poster":"DoktorKaiser","date":"2019-01-12T22:52:31.566+0000","up_votes":2,"down_votes":0,"body":"Inting causes toxicity way more than toxicity causes inting  from my experience the first one is 90% of the cases , second one only 10%.","replies":[]},{"poster":"Sleeperbat","date":"2019-01-11T17:31:49.356+0000","up_votes":2,"down_votes":0,"body":"Some people spark their own fuse and blow everything up.","replies":[]},{"poster":"Sorin Alucard","date":"2019-01-10T23:03:30.120+0000","up_votes":4,"down_votes":3,"body":"This is only true because we have a petty community with no sportsmanship values, or at the very least, a passion to win.\n\nWe use to, and no the chat wasn't cleaner. It was as open as a youtube comment section. However, if you got over your feelings and used your mute you could usually at least count on teammates to still want to win. Most of the fights were over role selections and picks, because we couldn't lock anything in. People would fight over it, but we wanted to win.\n\nNow I'm not saying  that cleaning up chat was bad, but in hindsight I wish IFS never happened. I'd rather have overly passionate flamers I can mute, than petty  passive aggressive assholes, silent trolls, and a clusterfuck of people who don't want to put energy into a win if it isn't handed to them. The decreasing playerbase shows the passion is leaving it, and its our community thats driving it out.\n\nIt drags away from all the other critiques I'd rather be at the front of discussion, like matchmaking, updating MMR systems, or addressing power creep.\n\nBut Even if this game becomes mechanically better, that won't stop us from being matched with people that you'd \"better not set off, cuz they are powderkegs\"\n\nno offense to OP trying to keep up this super positive vibe-- I just think we need to re-evaluate what we expect the players to mitigate about multiplayer friction and what we really need companies to intervene for. I don't think what people say to you is one of them. just imo","replies":[]},{"poster":"Midg3t","date":"2019-01-11T12:26:55.891+0000","up_votes":2,"down_votes":1,"body":"Gj on blaming the victim of trolling. 'If you want less trolls stop setting them off' Yea sure its others fault people are trolling... just stfu and stop spewing out bs","replies":[]},{"poster":"Votable Jester","date":"2019-01-11T01:09:09.109+0000","up_votes":2,"down_votes":1,"body":"I generally don't flame and have not once received punishment, but don't minimize how shitty it is for someone to grief and afk.  Unless your team (not just one person) is literally just an awful, abusive bastard, there's not much excuse for ruining the game.\n\nSo yeah don't flame people and such, but it's still at least 95% the griefer/afker's fault.","replies":[]},{"poster":"Butterwood","date":"2019-01-11T17:32:18.382+0000","up_votes":1,"down_votes":0,"body":"{{champion:41}} sees what you did there","replies":[]},{"poster":"Shmeeve","date":"2019-01-10T22:57:23.310+0000","up_votes":1,"down_votes":0,"body":"I was one of those people who did an unsuccessful gank, just a second after that, I see my whole team spamming at me in chat... oof.\nThe last two games of league I played Idk what was wrong with my internet, and forced me to reconnect... twice... and my team flamed me for that... I have some rotten luck with people :I","replies":[]},{"poster":"Draught of Souls","date":"2019-01-15T09:25:13.207+0000","up_votes":1,"down_votes":1,"body":"I would say the only reason i ever int is because some fuckface decides to ban my champ ON MY OWN TEAM in champ select. so then i will most definitely be running it down mid if he doesn't have some god tier reason for banning my Vayne (aka my last match i played)","replies":[{"poster":"ı Sona ı","date":"2019-01-15T17:51:11.426+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Draught of Souls,realm=NA,application-id=ZGEFLEUQ,discussion-id=APcXLmjW,comment-id=0012,timestamp=2019-01-15T09:25:13.207+0000)\n>\n> I would say the only reason i ever int is because some fuckface decides to ban my champ ON MY OWN TEAM in champ select. so then i will most definitely be running it down mid if he doesn&#x27;t have some god tier reason for banning my Vayne (aka my last match i played)\n\nAn absolutely terrible reason to troll and I hope you get punished soon.\n\n{{sticker:sona-playing}}","replies":[]}]},{"poster":"nelogis","date":"2019-01-11T10:25:22.871+0000","up_votes":1,"down_votes":1,"body":"> Griefing is the Powder Keg Exploding\n\nWhen you manage to tilt 3 other teammates with 1 comment\n\n{{champion:41}} COMBO!","replies":[]},{"poster":"Dewott610","date":"2019-01-11T04:50:16.264+0000","up_votes":1,"down_votes":1,"body":"while that is true, there's still the 1% that do it for fun or the 5% who basically say \"Give me mid or I troll\" before anyone says anything","replies":[]},{"poster":"AJStarhiker","date":"2019-01-11T03:37:06.015+0000","up_votes":2,"down_votes":2,"body":"I think powder keg is the *perception* of trolling.  When somone enters a game expecting to find trolling, they are going to see it, regardless of whether it's actually happening. They are going to react badly to mistakes, low skill, or unexpected and off-meta play. They call it out, the \"offending\" player thinks they are being attacked for no reason and some retaliate, setting off a flame war that only serves to reinforce the idea of toxicity in LoL.","replies":[]},{"poster":"Arctic Dragon","date":"2019-01-11T02:21:40.209+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ı Sona ı,realm=NA,application-id=ZGEFLEUQ,discussion-id=APcXLmjW,comment-id=,timestamp=2019-01-10T21:21:32.235+0000)\n>\n> How many times have you seen one player flame another and then they afk or start griefing?\n> \n> How many times have you been the player who flamed someone else for an unfortunate gank or they got caught out, and then they afked or started running it down lane?\n> \n> How many times were you the one who got flamed and so you started griefing or afking?\n> \n> We can&amp;#039;t control others but we can control ourselves. If you want less griefers and trolls then stop setting them off. I know that isn&amp;#039;t fair to you and you shouldn&amp;#039;t have to put more effort into being mature than them, but you have no real other option.\n> \n> You win by adjusting your strategy to win.\n> \n> \n> {{sticker:sona-playing}}\n\nI never use chat anymore, I communicate via pings, never had a issue yet.\n\nI /mute all before the game begins.","replies":[]},{"poster":"Jojobees","date":"2019-01-11T02:00:55.716+0000","up_votes":1,"down_votes":1,"body":"https://www.youtube.com/watch?v=cz7TWpRXyRY","replies":[]},{"poster":"SHIN0BU","date":"2019-01-11T01:12:33.007+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ı Sona ı,realm=NA,application-id=ZGEFLEUQ,discussion-id=APcXLmjW,comment-id=,timestamp=2019-01-10T21:21:32.235+0000)\n>\n>\n> \n> \n> \n> How many times were you the one who got flamed and so you started griefing or afking?\n>\n\n Sorry what? No excuses for feeding. if you flame, you get chat restrictions and then bans. if you intentionally throw, (griefing, intentionally feeding, trolling) you get banned. Do NOT think you can excuse ANY poor behavior if it’s not allowed in lol. Do you see how many people get chat restrictions or bans for behavior stemming from fights? People just need to learn how to not feed trolls. Too much report baiting nowadays that people  never wise up to.","replies":[]},{"poster":"Dr Dog","date":"2019-01-10T21:48:10.467+0000","up_votes":2,"down_votes":2,"body":"i read this wrong at first and thought it was the other way around and i was about to say uhhhh no? lol","replies":[]}]}