{"poster":"AvidadivA","date":"2015-05-21T17:29:00.668+0000","title":"[FanFiction Vladimir - Sona] \"La Via dell'Altro\" - pt. 3","subforum":"Creazioni della community","up_votes":4,"down_votes":1,"body":"[Parte 2 ->] (http://boards.euw.leagueoflegends.com/it/c/creazioni-della-community-it/oHEGmpEZ-fanfiction-vladimir-sona-la-via-dellaltro-pt-2)\n\n**La Via dell&#039;Altro - pt. 3**\n\n\n &laquo;Spero mi abbiate perdonato se posso essere stato inopportuno con la mia presenza. Ero caduto vittima dell&rsquo;incanto delle vostre note...&raquo; riprese Vladimir, perfettamente consapevole di stare ad adularla, e dallo sguardo di lei pot&eacute; notare come, ancora una volta, il suo fascino e la sua eleganza non fossero indifferenti ad una donna. Se Elise lo avesse saputo, non gliel&rsquo;avrebbe fatta passare liscia, sarebbe stata spietata con lei e sadicamente vendicativa con lui... ma Elise, ora, era lontana. E Vladimir, che di certo non aveva dimenticato il sottile gioco della seduzione, iniziava a divertirsi. Tuttavia la musicista non sembrava sapere indulgere in quella sorta di danza, come se non ne conoscesse i passi: gli sorrise, indic&ograve; un tronco accanto al quale era accovacciata, e lo guard&ograve; in attesa di replica. Lo stava invitando ad ascoltarla. Nonostante le cose non stessero andando come aveva immaginato, l&rsquo;emomante accett&ograve; di buon grado e la giovane torn&ograve; a dar voce alle proprie note. \nIl sole continuava la sua corsa in cielo accorciando le ombre sotto di loro, ed era ormai quasi a picco quando l&rsquo;abile esecutrice fece di nuovo tacere il suo strumento. Spesso guardava Vladimir durante la sua esecuzione, altre volte sollevava lo sguardo azzurro verso le nubi o nella vegetazione, gli accordi erano la sua poesia, le note erano le sue parole, e parl&ograve; a lungo a quello sconosciuto: fu lui, stavolta, a stare in totale silenzio. \nAl termine di quella melodia si sorpresero entrambi di quanto tempo fosse trascorso. Per il mago fu come riemergere da una lunga, piacevole meditazione. Batt&eacute; le mani, lentamente, ma con enfasi: \n&laquo;Meravigliosa&raquo;  comment&ograve; con un trasporto sincero quanto il suo disappunto che segu&igrave; a breve, quando torn&ograve; in lui la consapevolezza di dover tornare in viaggio. Inspir&ograve; a fondo e torn&ograve; a parlarle: \n&laquo;Starei ad ascoltarvi per ore, mia Signora, ma Noxus &egrave; ancora lontana e devo riprendere il mio cammino, anche per cercare una locanda lungo la strada. Spero di ascoltare di nuovo la vostra musica, magari in un grande teatro, sono certo che diverrete presto una celebrit&agrave;, quando vi sar&agrave; data la fama che meritate.&raquo; \nLo sguardo della ragazza, incupitosi alle prime parole di lui, rest&ograve; rammaricato nonostante quell&rsquo;apprezzamento, ma si illumin&ograve; un attimo dopo: alzando una mano gli chiese di nuovo di aspettare,  dopodich&eacute; si indic&ograve; e inizi&ograve; a camminare, con lo strumento che levitava davanti a lei, superando Vladimir di qualche passo per voltarsi di nuovo verso di lui e ancora indicare se stessa... l&rsquo;uomo comprese che avrebbe avuto una guida e, annuendo con un sorriso, accett&ograve; quel silenzioso invito.\n\nLa ragazza lo condusse tra i boschi, per sentieri che sembrava conoscere bene; durante il tragitto, sfiorava le corde dello strumento che continuava a fluttuare di fronte a lei, accompagnando cos&igrave; con le sue note i due viandanti. A Vladimir fu difficile quantificare la strada che fece e il tempo che impieg&ograve; a percorrerla, non conosceva quell&rsquo;area, aveva anche la sottile impressione che un tale accompagnamento musicale rendesse pi&ugrave; rapida la loro andatura, che forse andava a prendere inconsapevolmente il tempo di quelle melodie... ma quasi di punto in bianco, allo svoltare di una curva la cui visuale era coperta da vegetazione pi&ugrave; fitta, vide in lontananza una villa isolata e sontuosa. La giovane la indic&ograve;, voltandosi verso di lui e sorridendogli. \n&laquo;La nostra meta, presumo...&raquo; mormor&ograve; il mago &laquo;ma non ha affatto l&rsquo;aria di essere una taverna.&raquo; \nLa  musicista scosse il capo con aria divertita, indicandosi, per poi riprendere il cammino senza dargli altre spiegazioni. A Vladimir non rest&ograve; che seguirla, di certo una sosta in un luogo cos&igrave; elegante era assai pi&ugrave; allettante di un pasto e un pernotto nella prima taverna che avrebbe incontrato.\nQuando giunsero al cospetto dell&rsquo;abitazione, la giovane buss&ograve; alla porta con grande familiarit&agrave;, chiedendo nuovamente con un gesto a Vladimir di attenderla; pochi istanti dopo, venne ad aprire l&rsquo;uscio un maggiordomo in livrea che la accolse con un inchino. \n&laquo;Mademoiselle  Buvelle, ben tornata.&raquo; scocc&ograve; poi un&rsquo;occhiata sorpresa in direzione di quel pallido, elegante gentiluomo dai lunghi capelli argentati e dallo strano sguardo dai riflessi di rubino &laquo;E avete portato un ospite, vedo...&raquo; il tono del pur impeccabile servitore tradiva un certo stupore, ma Vladimir non attese che cadesse tra loro il peso di un silenzio ben diverso da quello che finora lo aveva accompagnato, cos&igrave; lo anticip&ograve; presentandosi: \n&laquo;Il mio nome &egrave; Vladimir, messere. Sono in viaggio verso Noxus, la signorina mi ha gentilmente offerto ospitalit&agrave;. &raquo; E finalmente sapeva qualcosa in pi&ugrave; di lei, aveva gi&agrave; sentito quel cognome, e, se ben ricordava, apparteneva ad una facoltosa famiglia. La villa che li accolse and&ograve; a confermare la sua tesi... La fanciulla gli indic&ograve; di accomodarsi in uno sfarzoso salotto,  Vladimir prese posto su un comodo divano di broccato mentre la giovane andava a riporre il suo strumento in una preziosa custodia di legno intarsiato... intanto, l&rsquo;emomante assaporava quel meritato riposo: non avrebbe minimamente sperato di indulgere in simili agi, dopo l&rsquo;ultima notte trascorsa tra sangue e inseguimenti...\n\n[Fine Parte 3]\n[<PARTE 4>](http://boards.euw.leagueoflegends.com/it/c/creazioni-della-community-it/E6swWjqc-fanfiction-vladimir-sona-la-via-dellaltro-pt-4)","replies":[{"poster":"Bagheera02","date":"2015-05-22T06:39:43.604+0000","up_votes":2,"down_votes":0,"body":"Inutile dire che mi piace tantissimo!!! Cioé lo dico ogni volta D: chissá che succede?!?! D:","replies":[]},{"poster":"Sexy Sona","date":"2015-05-21T19:28:32.359+0000","up_votes":2,"down_votes":0,"body":"Bellissimo, ogni capitolo mi lascia senza fiato.\nCome se stessi leggendo un libro con la frettolosa voglia di girare pagina, attendo la prossima parte con pacata ma vogliosa gioia-\n{{champion:37}}","replies":[]},{"poster":"AvidadivA","date":"2015-05-23T16:04:30.367+0000","up_votes":1,"down_votes":0,"body":"Grazieeeee :3\n\nLa storia prosegue, ecco il quarto capitolo! -->  (http://boards.euw.leagueoflegends.com/it/c/creazioni-della-community-it/E6swWjqc-fanfiction-vladimir-sona-la-via-dellaltro-pt-4)","replies":[]}]}