{"poster":"Tychusfindlay919","date":"2016-09-21T02:07:13.130+0000","title":"Ivern can give nearby teammates a free dash","subforum":"Gameplay","up_votes":35,"down_votes":0,"body":"{{champion:122}} {{champion:86}} {{champion:420}} {{champion:75}} {{champion:82}} {{champion:48}} {{champion:106}} {{champion:83}} \n\n{{sticker:slayer-pantheon-rainbows}} {{sticker:zombie-brand-clap}} \n\nWhat a day to be alive, to know that there&#039;s someone who can give juggernauts raging woodies when it comes to circumventing kiting.\n\n{{champion:122}} \"They will regret opposing me (and the tree)\" {{champion:122}} ","replies":[{"poster":"L Rayquaza","date":"2016-09-21T02:10:01.191+0000","up_votes":29,"down_votes":0,"body":"{{champion:107}}  DEPLOY THE BUSHES","replies":[{"poster":"PhDs Nuts","date":"2016-09-21T02:26:50.766+0000","up_votes":10,"down_votes":0,"body":"> [{quoted}](name=L Rayquaza,realm=NA,application-id=3ErqAdtq,discussion-id=wzEQGUBH,comment-id=0000,timestamp=2016-09-21T02:10:01.191+0000)\n>\n> {{champion:107}}  DEPLOY THE BUSHES\n\nOh god, that is terrifying.","replies":[{"poster":"L Rayquaza","date":"2016-09-21T02:39:35.363+0000","up_votes":1,"down_votes":0,"body":"I played him on the PBE and we had a Rengar top, it was beautiful","replies":[{"poster":"Erockandroll","date":"2016-09-21T02:58:24.943+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=L Rayquaza,realm=NA,application-id=3ErqAdtq,discussion-id=wzEQGUBH,comment-id=000000000000,timestamp=2016-09-21T02:39:35.363+0000)\n>\n> I played him on the PBE and we had a Rengar top, it was beautiful\n\nYou played him on the PBE?\n\nHere's my burning question. How (if at all) does his passive \"getting gold, and xp, by sacrificing HP and mana without an actual fight\" synergize with jungle itemization? \n\nCause from How I see it, he would have a very non standard itemization path.","replies":[{"poster":"L Rayquaza","date":"2016-09-21T03:10:14.712+0000","up_votes":7,"down_votes":0,"body":"Don't start machete, start talisman and refillable pot, get hunters potion to help with a little more sustain, I went with the ward upgrade with Cinderhulk, rushed a Rod, then finished jungle item, then went full tank\n\n\nOh, and yes you get the bonus gold and experience, and here are the runes and masteries http://i.imgur.com/eEtyWdo.jpg","replies":[{"poster":"Critmaster Garen","date":"2016-09-21T10:42:18.902+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=L Rayquaza,realm=NA,application-id=3ErqAdtq,discussion-id=wzEQGUBH,comment-id=00000000000000000000,timestamp=2016-09-21T03:10:14.712+0000)\n>\n> Don&#x27;t start machete, start talisman and refillable pot, get hunters potion to help with a little more sustain, I went with the ward upgrade with Cinderhulk, rushed a Rod, then finished jungle item, then went full tank\n> \n> \n> Oh, and yes you get the bonus gold and experience, and here are the runes and masteries http://i.imgur.com/eEtyWdo.jpg\n\nthe windup time on the passive scales kindof shitty though. his early clears are almost comically fast due to smite basically instantly taking an entire camp after the initial animation.\n\nlvl 1 is pretty much just right clicking blue buff and then smiting the entire camp in a matter of 2 seconds.\n\nbut midgame it still takes more than 20 seconds to clear a camp, when conventional junglers would take it in less than 10 seconds by that point.","replies":[{"poster":"L Rayquaza","date":"2016-09-21T11:34:50.992+0000","up_votes":2,"down_votes":0,"body":"A nice early game start is set up a Grove on blue, maybe gromp as well, go to the enemy red, do the smite on that one, then go back to your jungle","replies":[{"poster":"Critmaster Garen","date":"2016-09-21T12:14:14.044+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=L Rayquaza,realm=NA,application-id=3ErqAdtq,discussion-id=wzEQGUBH,comment-id=0000000000000000000000010000,timestamp=2016-09-21T11:34:50.992+0000)\n>\n> A nice early game start is set up a Grove on blue, maybe gromp as well, go to the enemy red, do the smite on that one, then go back to your jungle\n\nyea, i actually thought of that aswell. should be a really easy invade.","replies":[{"poster":"LankPants","date":"2016-09-21T13:49:57.684+0000","up_votes":2,"down_votes":1,"body":"I think this seems better on paper than it is in practice. \n\nThe HP costs in the early game are absurd and he has little to no duelling power especially considering you're still actually level one when you do this. If any jungler were to start at Krugs and catch you they'd be able to kill you in the invade using their level two and counter your jungle destroying your marks. You'd then be stuck at level one and pain and suffering ensue because you're so terrible at securing camps and dueling.\n\nI think almost any junger could pull this off too, even traditionally weak early junglers like Sejuani and Amumu could probably kill him for invading.","replies":[{"poster":"kile147","date":"2016-09-21T16:09:07.406+0000","up_votes":2,"down_votes":0,"body":"So basically you can invade with him, but you need to be 100% sure they're on the other side of the map when you do it.","replies":[]},{"poster":"Critmaster Garen","date":"2016-09-21T18:58:26.617+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LankPants,realm=OCE,application-id=3ErqAdtq,discussion-id=wzEQGUBH,comment-id=000000000000000000000001000000000000,timestamp=2016-09-21T13:49:57.684+0000)\n>\n> I think this seems better on paper than it is in practice. \n> \n> The HP costs in the early game are absurd and he has little to no duelling power especially considering you&#x27;re still actually level one when you do this. If any jungler were to start at Krugs and catch you they&#x27;d be able to kill you in the invade using their level two and counter your jungle destroying your marks. You&#x27;d then be stuck at level one and pain and suffering ensue because you&#x27;re so terrible at securing camps and dueling.\n> \n> I think almost any junger could pull this off too, even traditionally weak early junglers like Sejuani and Amumu could probably kill him for invading.\n\nthe discussion was mainly about marking your own blue buff, and immediately going to the enemy red and mark + smite that camp. it takes literally 2 seconds to steal it once youre there.\n\nhis passive has a very short channel in which time he marks a camp. then it takes about 40 seconds early game for the mark to finish charging. but smite can circumvent that time entirely. he can mark the enemy red, smite the entire camp and get out. walk back to his blue, and pick the buff up.\n\nhe might even have time to mark gromp first, so he can pick that back up on his way aswell.\n\ntrust me, youre probably in and out before the enemy jungler arrives at his red.\n\nive seen how his counterjungling works. and whenever smite is up, he can easily pick up an enemy camp.","replies":[]}]}]}]}]},{"poster":"Sir Fuzzi","date":"2016-09-21T07:00:04.073+0000","up_votes":1,"down_votes":0,"body":"So are the groves easy to handle? They look like they'd be very easy to counter-jungle, a dead giveaway of where and what you're jungling if they cared to look.","replies":[{"poster":"Raoul","date":"2016-09-21T10:18:51.802+0000","up_votes":1,"down_votes":0,"body":"Yes, he is very weak to counterjungeling. Without a team to back you up, you will be 100% useless. After all, you are a SUPPORT in the jungle, every jungler can 1v1 you without breaking into sweat, and you have to leave the camps. \n\nSry, but against any enemy team with a brain, this guy will be useless unless RIOT reduces the time it takes his passive to free a camp or gives him some way of fighting back.","replies":[{"poster":"crippler38","date":"2016-09-21T23:10:43.694+0000","up_votes":1,"down_votes":0,"body":"well as long as they don't accidentally hit a jungle camp, if they do that they instantly get jungle camp aggro since to ivern jungle camps are allied like minions.","replies":[]}]},{"poster":"L Rayquaza","date":"2016-09-21T11:36:07.803+0000","up_votes":1,"down_votes":0,"body":"No, i hate them, they take too much health at lower levels and too long to set up after the initial cast, 40 seconds with 2 seconds removed every level, and just cause you have a Grove there doesn't mean the camp is protected, hell no, that is more reason for the enemy jungle to kill it","replies":[]},{"poster":"yay nibbers","date":"2016-09-21T10:28:35.208+0000","up_votes":1,"down_votes":0,"body":"There is that but you can actually smite the camp while the grove is charging to clear it instantly, so you can at least get important camps virtually risk free and actually faster than anyone else in the game.","replies":[]}]}]}]},{"poster":"kile147","date":"2016-09-21T16:10:51.055+0000","up_votes":1,"down_votes":0,"body":"How does he interact with epic monsters? Anything special or just normal fight mechanics?","replies":[{"poster":"L Rayquaza","date":"2016-09-21T16:16:47.013+0000","up_votes":1,"down_votes":0,"body":"epic monsters are the only ones he can't be friends with, however with Daisy's help she can tank dragons decently while you sit in a bush to use the ranged autos","replies":[]}]}]}]}]},{"poster":"TheSequelsRBad","date":"2016-09-21T02:29:37.519+0000","up_votes":10,"down_votes":0,"body":"As a juggernaut main, I am quite content right now.\n\n{{champion:420}} \"Try to kite me, will you?\"","replies":[{"poster":"Only Play Darius","date":"2016-09-21T10:37:21.737+0000","up_votes":1,"down_votes":0,"body":"Amen. Dashing out of bushes in the middle of lanes is going to be the shit","replies":[]}]},{"poster":"Evewynn","date":"2016-09-21T10:04:37.712+0000","up_votes":5,"down_votes":0,"body":"All hail Galio, our new gargoyle overlord.","replies":[{"poster":"Veltox","date":"2016-09-21T18:00:51.161+0000","up_votes":4,"down_votes":0,"body":"http://ci.memecdn.com/408/9045408.jpg","replies":[]}]},{"poster":"Only Play Darius","date":"2016-09-21T10:36:39.461+0000","up_votes":1,"down_votes":1,"body":"Juggernauts finally get something good for once since their poorly-executed class update","replies":[{"poster":"Tychusfindlay919","date":"2016-09-21T21:01:59.536+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Jelly Mac,realm=NA,application-id=3ErqAdtq,discussion-id=wzEQGUBH,comment-id=0008,timestamp=2016-09-21T10:36:39.461+0000)\n>\n> Juggernauts finally get something good for once since their poorly-executed class update\n\nDepends on the juggy at hand.\n\nDarius rework was one of the best reworks out there. Didn't change the feel of his kit too drastically but it turned him into something other than the early game cancer of top lane that fell off like a brick come late game.","replies":[{"poster":"Only Play Darius","date":"2016-09-21T21:20:35.950+0000","up_votes":2,"down_votes":0,"body":"Darius rework was great, and to a lesser extent Garen. Mord and Skarner were abject failures, most of the new items ended up getting abused by other classes and nerfed, and unlike the Mage or ADC updates, there were zero changes to any juggernauts outside of the big four. It was the first class update though.","replies":[]}]}]},{"poster":"Milodic Mellodi","date":"2016-09-21T04:07:44.138+0000","up_votes":2,"down_votes":0,"body":"Imagine him in URF. Roots every few seconds, to which your ever-spinning Garen or ever-dunking Darius can dash to...makes bushes in a flash so Rengar can keep hopping around like a bunny anywhere he wants...","replies":[{"poster":"crippler38","date":"2016-09-21T23:12:51.045+0000","up_votes":2,"down_votes":0,"body":"you'd bush an entire lane","replies":[{"poster":"Milodic Mellodi","date":"2016-09-22T01:59:01.169+0000","up_votes":2,"down_votes":0,"body":"You can only make 3 bushes at a time, unfortunately. Though you can spawn bushes in barely any time so I'd say you could just spawn bushes in front as you walk.","replies":[{"poster":"Milodic Mellodi","date":"2016-09-24T08:38:32.986+0000","up_votes":1,"down_votes":0,"body":"But now with Randomized URF...*****sigh...*****","replies":[]}]}]}]},{"poster":"Noblewind","date":"2016-09-21T20:09:58.703+0000","up_votes":2,"down_votes":0,"body":"Well lots of people are oversimplifying the situation in that he actually needs to land the skill on the back line and it's not hard to dodge. Also if your Frontline is the only one close enough to use it during the duration, I can see it being an ability that's frequently harmful to allies too. \n\nAlso why do I need juggernauts when I got my grill Daisy???","replies":[]},{"poster":"Nyanza","date":"2016-09-21T17:35:17.355+0000","up_votes":2,"down_votes":0,"body":"{{champion:3}}  is always forgotten","replies":[]},{"poster":"ADepressedLeona","date":"2016-09-22T07:40:14.514+0000","up_votes":1,"down_votes":0,"body":"{{champion:89}} Also enjoys this, very much :p","replies":[]},{"poster":"The DrBonjigollo","date":"2016-09-21T23:09:21.978+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tychusfindlay919,realm=NA,application-id=3ErqAdtq,discussion-id=wzEQGUBH,comment-id=,timestamp=2016-09-21T02:07:13.130+0000)\n>\n\n> What a day to be alive, to know that there's someone who can give juggernauts raging woodies when it comes to circumventing kiting.\n> \n> [{quoted}](name=Tychusfindlay919,realm=NA,application-id=3ErqAdtq,discussion-id=wzEQGUBH,comment-id=,timestamp=2016-09-21T02:07:13.130+0000)\n>\nto know that there's someone who can give juggernauts raging woodies.\n> \n can give juggernauts raging woodies.\n> \n raging woodies.\n\nI see what you did there.","replies":[{"poster":"Vraestin","date":"2016-09-22T07:37:11.167+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The DrBonjigollo,realm=NA,application-id=3ErqAdtq,discussion-id=wzEQGUBH,comment-id=000e,timestamp=2016-09-21T23:09:21.978+0000)\n>\n> to know that there&#x27;s someone who can give juggernauts raging woodies.\n>  can give juggernauts raging woodies.\n>  raging woodies.\n> \n> I see what you did there.\n\nYou dont know enough Mordekaiser for saying that the rework failed. The rework, even with nerfs, changed Morde gameplay drastically and he's now a fairly better champ that can still do nice outplays and destroy the enemy team out by himself. If played correctly and with a bit of luck, of course. \n\nhttps://www.youtube.com/watch?v=w3tTkQagOg0","replies":[]}]},{"poster":"Spoofghoul","date":"2016-09-21T18:42:28.894+0000","up_votes":1,"down_votes":0,"body":"well juggernauts is one thing just imagine how easy it becomes for assassins to circumvent the frontline like this\n\nall you do is root their tank assassin free dash to tank then still got entire kit available to to jump and blow up a squishy doesnt even need to use any of his own mobility to get past the frontline nor any need to flank\n\nand lets not forget the Sion W they get to carry into the backline aswell \n\n{{sticker:zombie-brand-mindblown}} \n\nbrilliant rito brilliant","replies":[]},{"poster":"Mr Fidori","date":"2016-09-21T16:31:50.806+0000","up_votes":1,"down_votes":0,"body":"{{champion:3}}","replies":[]},{"poster":"Critmaster Garen","date":"2016-09-21T10:37:34.228+0000","up_votes":1,"down_votes":0,"body":"ive seen a morde utilitze the dash. it was pretty awesome.","replies":[]},{"poster":"Raoul","date":"2016-09-21T10:15:31.953+0000","up_votes":1,"down_votes":0,"body":"Well, he should do, after all, you are literally sacrificing a possible potent jungler for another Support, on top of that a support with no damage and barely tanky. \nHe has to give your team some imense power to justify taking him, since Supports in this game are more often that not just worth half a champion.\n\nWe dont have any strong support items, all we have is kinda gimmiky, give you a speed boost, slow you, a little shield... where are the items that dont give much in terms of stats but give you the ability to take out an enemy for some time? Not in this game. Supports, especialy true supports, are weak in LoL, what do you think why alot of people prefere to play tanks or mages as support instead?","replies":[]},{"poster":"Darth Valer","date":"2016-09-21T09:12:47.771+0000","up_votes":1,"down_votes":0,"body":"LUL \nHis Q seems hard to hit and can be bodyblocked. So yeah, if you can pick off an isolated carry a Juggernaut can reach him super-fast and kill him (and that's not always the case since they are still kiteable as fuck), but in that case it's the carry's fault. In a normal team situation that would be much harder.","replies":[]},{"poster":"Gamer Girl Paige","date":"2016-09-21T02:29:24.608+0000","up_votes":1,"down_votes":0,"body":"Raging woodies. 1000000 upvotes","replies":[]},{"poster":"Riven Main","date":"2016-09-21T02:13:06.859+0000","up_votes":1,"down_votes":0,"body":"Garen's in every bush xD","replies":[]}]}