{"poster":"SheTwistedMyFate","date":"2016-05-15T16:14:20.516+0000","title":"Este Server Vale KK","subforum":"Charlas Generales","up_votes":3,"down_votes":11,"body":"Entras a una partida con 200 ms y apenas puedes jugar porque todo el team se cae, luego ni puedes sacar S porque como te ausentaste no se te premiara... Hasta gasto mi plata en los Rp, al igual que muchos, y en lo unico que trabajan es hacer solo skin para seguir con su lucro, 0 preocupacion por el estado del tostador de LAS, tengo un internet de 10 megas y vivo solo, asi que no le veo excusa para andar con ese ping tan horrible ..l.,","replies":[{"poster":"MorochoCandente","date":"2016-05-15T16:32:06.019+0000","up_votes":5,"down_votes":0,"body":"Lo de siempre, si el problema fuera EL SERVER, TODOS, absolutamente TODOS los invocadores tendrian problemas al jugar, y eso no pasa.\n\nEl problema pasa por otro lado, pero gastarse en explicarlo es al pedo cuando la respuesta que te dan es \"pero pongo un video en youtube y carga bien\"\n\nSi queres saber por que hay problemas a veces, leete los posts que hacen los rioters explicando.","replies":[]},{"poster":"I Jeronimo I","date":"2016-05-15T16:24:45.508+0000","up_votes":3,"down_votes":1,"body":"A mi me andan perfecto los MS, debe ser tu mal internet.","replies":[]},{"poster":"Bot Oro","date":"2016-05-15T16:18:07.525+0000","up_votes":2,"down_votes":1,"body":"KK :s pudo ser algo mejor como este server vale mierda o este server vale popo","replies":[]},{"poster":"IITheKingII","date":"2016-05-15T19:35:40.877+0000","up_votes":1,"down_votes":1,"body":"lo unico malo aqui es tu internet","replies":[]},{"poster":"Sir Crucifix ","date":"2016-05-15T17:36:48.645+0000","up_votes":1,"down_votes":1,"body":"Es que en vez de invertir en el server invierten en los bolsillos, mientras este online el server , ellos seguirán robando","replies":[]},{"poster":"NachTderBlooD","date":"2016-05-15T16:28:56.922+0000","up_votes":1,"down_votes":1,"body":"10 mb/s divididlo por 8 y te dará una velocidad en Mb/s la cual es la verdadera velocidad (1.25 Mb/s, lo cual es muy poco para jugar), sin mencionar tu velocidad de subida (seurmente en Kb/s). A eso debes sumarle la distancia que hay entre tu y el servidor de lol (y el de tu compañía), que si no es Chile tus ms obviamente serán altos, aunque 200 es absurdo.\n\nSi eres de Argentina ya es cuento repetido, su infraestructura de internet al parecer no es compatible con el servidor porque genera tráficos extras e innecesarios quien sabe a donde. \n\nEn resumen: el server no es KK.  \n\n\n\n{{summoner:31}}","replies":[]}]}