{"poster":"TetsuTeito","date":"2016-09-26T03:50:58.034+0000","title":"Visual Error when taking turrets","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I've noticed that when I take turrets sometimes, it doesn't say that I helped take them at all. For example Tristana (Me) and a Taliyah were pushing a mid lane tower. Minions last hit it, and as the visual it shows minions took the tower and Taliyah assisted. No Tristana assist even though she dealt the most damage to the turret. Later Tristana took a top tower with minions, but since they last hit it, it only showed minions destroyed it, even though Tristana practically did all the damage. Anyone else seeing this?\r\nThankfully I think it's only visual as I checked the graph and I think it said I destroyed the same amount of towers as I should have.","replies":[{"poster":"Targons Blade","date":"2016-09-26T18:08:08.709+0000","up_votes":1,"down_votes":0,"body":"Weird! I've never heard of this before. Does this happen consistently in every match or only every once in a while? I recommend [running a repair of your game files](https://support.riotgames.com/hc/en-us/articles/201752684-Low-Frame-Rate-FPS-Troubleshooting#wq5) whenever you have some downtime. This may be caused by corrupt files, so I think that repair may help.\n\nLet me know if this persists.","replies":[{"poster":"TetsuTeito","date":"2016-09-26T22:08:40.341+0000","up_votes":1,"down_votes":0,"body":"It's done it in a couple other games I think. Not sure if it's just with Tristana or other champs as I haven't been paying attention to it that much. Just happened to catch it in a game or 2 as her since I was shredding turrets and not visibly taking credit for it. I have recently repaired my files to try to fix a different issue, but I noticed the turrets thing after I repaired.","replies":[{"poster":"Targons Blade","date":"2016-09-27T15:36:13.062+0000","up_votes":1,"down_votes":0,"body":"If you notice this happens again specifically on Tristana, I'd recommend creating a detailed post about it on our [Bug Report Boards.](http://boards.na.leagueoflegends.com/en/c/bug-report) \n\nLet me know if you have any questions.","replies":[]}]}]}]}