{"poster":"stoffwechsel","date":"2015-02-08T19:48:26.084+0000","title":"ADC für Solo-/Duo-Q ( Quinn, Lucian, Graves oder Kalista )","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Ich suche einen ADC um möglichst schnell aus der ELO-Hell rauszukommen. Ich überlege mir ob ich mir Quinn, Lucian, Kalista oder Graves kaufen soll.\r\nVorerst möchte ich anmerken dass ich Erfahrungen mit Lucian jab und ich ihn schon relativ gut spielen kann (hatte ihn schonmal aber zurückgegeben aus Dummheit XD). Mir ist klar dass jetzt gleich Graves gehypet wird aber ich weiss nicht ob ich ihn mir holen werde da er sehr sehr bald im Angebot sein wird ( es gibt eine Reihenfolge welche Champs wann im Angebot sind) und da ich noch 439 Rp übeig hab werd ich ihn mir höchstwahrscheinlich kaufen ( den einen Rp bekomme ich sicher vom Support geschenkt ;) ) und ausserdem denke ich er wird sehr bald generft weil ihn momentan JEDER spielt ( schreibts drunter ob ihr das auch denkt). \r\nAlso der Champ der oben genannten der am stärksten Snowballt, den meisten Damage drückt, am meisten Spaß macht, die beste Support Synergie hat und mit denen das carrien in Bronze einfach am besten geht.\r\nFreue mich auf eure Antworten:)\r\nLG Maxi","replies":[{"poster":"HyperionCH","date":"2015-02-09T14:59:31.071+0000","up_votes":3,"down_votes":0,"body":"Um aus Bronze rauszukommen gilt die Grundregel:\n\nSkill > Champselect\n\nAnders gesagt: Es ist nicht wichtig, welcher Champ grundsätzlich geeignet ist, um aus Bronze rauszukommen, sondern welchen Champ du am besten spielen kannst. Krass gesagt: wenn du mit AD-Urgot am besten + auf Silber-Niveau spielst, solltest du ihn nehmen.\n\nHinzu kommt die Verbesserung der eigenen Spielweise.\nDenn es bringt nichts, einen guten Champ zu spielen (bzw. den besten, den man kann), wenn man falsche Entscheidungen trifft.\n\nWas mir an den Stats des TE aufgefallen ist:\n\n- Er stirbt zu oft. (falsche Entscheidungen? Zu greedy?)\n- Er wardet kaum, kauft keine Pinkwards (was wohl die Deaths erklärt)\n- Item-Builds sind oft sehr verbesserungsfähig.\n- Sehr schlechter Farm (OK, wenn man oft stirbt...)\n\nAlle diese Punkte haben nichts mit der Wahl der Champs zu tun, sind aber die Punkte zum Verbessern, damit man aus Bronze rauskommt.\nOder anders gesagt: wenn man hier nicht besser wird, nützt es auch nichts, wenn man einen anderen ADC pickt, von dem man sich mehr verspricht. ;)","replies":[]},{"poster":"One Step Down","date":"2015-02-09T09:50:46.232+0000","up_votes":2,"down_votes":0,"body":"Quinn ist ein Duellant alias. Vayne, kein Adc kann Sie im 1v1 besiegen (jetzt einfach mal angenommen, beide sind gleichstark, gleiches gold etc . etc.), jedoch ist ihre Ult im TF einfach nicht zu gebrauchen, im Vergleich zu anderen Adc's.\n\nKalista ist extremst stark, jedoch Supportabhängig ... \n\nAchja, gute Gegenargumente hast du ja schon!","replies":[{"poster":"Candy Cane Ivern","date":"2015-02-09T14:39:04.244+0000","up_votes":1,"down_votes":2,"body":"70 Ad Steroid und stealth \n> Ult im TF einfach nicht zu gebrauchen\n\nk","replies":[{"poster":"eingew","date":"2015-02-09T14:57:08.152+0000","up_votes":1,"down_votes":0,"body":"Quinns Ult gibt ihr kein Stealth 0.o\n\nUnd wieso ist es für einen ADC super mitten zwischen die Gegner zu müssen, weil man plötzlich Nahkampf ist? Ein wenig mehr Ausführungen währen wohl schon sinnvoll...","replies":[{"poster":"Candy Cane Ivern","date":"2015-02-09T15:41:07.235+0000","up_votes":1,"down_votes":0,"body":"Hmm, sorry hab das alias  weggelesen und dachte er redet über Vayne.","replies":[]}]}]}]},{"poster":"One Step Down","date":"2015-02-09T09:26:27.821+0000","up_votes":2,"down_votes":0,"body":"Kalista ist zu Supportabhängig, Quinn nicht so stark in TF's (normalerweise) wie andere Adc's\n\nbleibt Lucian und Graves ... würde dir zu Graves raten, da dieser einfach 'saver' ist,\n\n* hat ne angenehme Lanephase\n* extremes Mid-Game, da Q-Ult- Burst\n* sein Late-Game Dmg ist extremst, vor allem durch sein E\n\nLucian ist einfach nicht so konstant gut, wie es Graves ist (vom spielerischen Gefühl her)\n\nLucian hat nen guten Burst, gute Mobility, jedoch ist er nicht \"tanky\" genug, um effektiv reinzugehen, wie es Graves kann.\nDas macht Graves immo einfach zum Stärkeren Adc ...","replies":[]},{"poster":"Candy Cane Ivern","date":"2015-02-08T23:22:54.749+0000","up_votes":2,"down_votes":1,"body":"Ich sehe Draven auf dieser Abstimmung nicht....","replies":[{"poster":"stoffwechsel","date":"2015-02-09T08:45:00.749+0000","up_votes":1,"down_votes":0,"body":"Ich hab draven schon und geh krass ab mit ihm aber ich hab nich immer lust auf den gleichen adc","replies":[]}]},{"poster":"iJUKEuQQ","date":"2015-02-09T03:33:29.959+0000","up_votes":1,"down_votes":0,"body":"vayne","replies":[]},{"poster":"One Step Down","date":"2015-02-09T14:44:24.917+0000","up_votes":1,"down_votes":2,"body":"man kann sich auch blöd stellen -.-\n\nman merke, das die rede von Quinn war, und Vayne ein beispiel als Duellant unter den Adc's ist ...\n\nGOTT community, macht es noch schwerer für mich, freundlich zu bleiben ....","replies":[]},{"poster":"Ragequit Account","date":"2015-02-09T09:37:05.217+0000","up_votes":2,"down_votes":4,"body":"Bist du ein Troll oder einfach nur megaschlecht?\n\nQuinn und Kalista würden dich überfordern. Mit Graves kommst du vielleicht gerade noch so klar.","replies":[]}]}