{"poster":"Kakkaripuli","date":"2017-07-25T11:17:00.825+0000","title":"Permabanned account and im sorry","subforum":"Player Behavior","up_votes":1,"down_votes":4,"body":"So hi im pretty old league of legends player i&#039;ve spent to this game more than 300&euro; and got permabanned for being toxic, i know i did wrong and i can guarantee i regret it, im no longer toxic on anygame because thats just not a good thing to do if you have good behavior the whole game is more fun\r\ni would like to play this game again on my account that got banned i agree if its not possible but im asking for a favor, can i get a second chance?\r\ni promise i will not be toxic anymore i&#039;ve learned it from hard way now.\r\n\r\n- Kakkaripuli","replies":[{"poster":"The Djinn","date":"2017-07-25T11:49:07.048+0000","up_votes":3,"down_votes":1,"body":"I'm glad that you realize that your behavior was harmful both to the other players you were matched with and to your own in-game experience. That is a step in the right direction for your future League experience, if you choose to make a new account.\n\nUnfortunately, your old account is pretty much lost. Riot only unbans accounts if the ban was applied in error, which does not seem like it is the case here.","replies":[{"poster":"Kakkaripuli","date":"2017-07-25T12:23:30.651+0000","up_votes":1,"down_votes":1,"body":"so i cant anyhow get my account back...","replies":[{"poster":"Timethief49","date":"2017-07-25T12:33:50.844+0000","up_votes":3,"down_votes":0,"body":"no you cant","replies":[]}]},{"poster":"Kakkaripuli","date":"2017-07-25T12:53:14.644+0000","up_votes":1,"down_votes":1,"body":"i cant anyhow get unbanned?","replies":[{"poster":"The Djinn","date":"2017-07-25T14:44:48.205+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kakkaripuli,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=3GWfZdhH,comment-id=00010001,timestamp=2017-07-25T12:53:14.644+0000)\n>\n> i cant anyhow get unbanned?\n\nUnfortunately, this is correct. Since the ban was not in error, Riot will not remove it. The last chance is at the 14-day ban stage, not after a permanent ban.","replies":[]}]}]},{"poster":"Raoul","date":"2017-07-25T12:26:07.247+0000","up_votes":3,"down_votes":0,"body":"You are not sorry that you were toxic, you are sorry that you got punished for it... big difference","replies":[]},{"poster":"Leylania","date":"2017-07-25T11:21:50.496+0000","up_votes":4,"down_votes":1,"body":"You already got your second chance after you had your 2 week ban. Your account is gone forever, Riot does not unban people who were banned for being toxic. And don't act like you are sorry, the only reason why you show \"regret\" is because you know that you fucked up and lost your money and all the skins and champs.","replies":[{"poster":"SEKAI","date":"2017-07-25T12:29:10.752+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Leylania,realm=EUW,application-id=ZGEFLEUQ,discussion-id=3GWfZdhH,comment-id=0000,timestamp=2017-07-25T11:21:50.496+0000)\n>\n> You already got your second chance after you had your 2 week ban. Your account is gone forever, Riot does not unban people who were banned for being toxic. And don&#x27;t act like you are sorry, the only reason why you show &quot;regret&quot; is because you know that you fucked up and lost your money and all the skins and champs.\n\nThough, they might be actually sorry. I wouldn't say jumping straight into this kinda mindset and response is the correct way of responding apologies and reforming behaviours. I don't think it's healthy to assume every apology is made with intent of earning sympathy rather than an expression of \"yeah I really fked up\". But anyways, it's just me.\n\nWhatever the case, what is true is that rightfully banned accounts will never be unbanned, unfortunately.","replies":[{"poster":"RallerenP","date":"2017-07-25T14:54:09.163+0000","up_votes":1,"down_votes":0,"body":"If they were actually sorry, they would have stopped after the first punishment. Anymore and they show that they didn't care untill it severely affected them, which is why he got banned.","replies":[]}]},{"poster":"Geauxx","date":"2017-07-25T11:24:35.270+0000","up_votes":1,"down_votes":0,"body":"That's how it goes.","replies":[]}]},{"poster":"0O0O0O0O00O0O0OO","date":"2017-07-25T12:31:59.252+0000","up_votes":1,"down_votes":3,"body":"Don't be sorry, it's not your fault the game is an SJW hugbox. Go play a better game instead of wasting your time","replies":[{"poster":"SEKAI","date":"2017-07-25T12:41:37.246+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=0O0O0O0O00O0O0OO,realm=NA,application-id=ZGEFLEUQ,discussion-id=3GWfZdhH,comment-id=0003,timestamp=2017-07-25T12:31:59.252+0000)\n>\n> Don&#x27;t be sorry, it&#x27;s not your fault the game is an SJW hugbox. Go play a better game instead of wasting your time\n\n\"SJW\" is like the new \"gay\".","replies":[{"poster":"0O0O0O0O00O0O0OO","date":"2017-07-25T12:49:26.920+0000","up_votes":1,"down_votes":0,"body":"Gay is used as an insult in a negative manner, SJW's advocate for a safe space and against bad words that could hurt somebodies feelings, which is why it's equatable. Try using a little critical thinking, bud.","replies":[{"poster":"SEKAI","date":"2017-07-25T13:04:09.929+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=0O0O0O0O00O0O0OO,realm=NA,application-id=ZGEFLEUQ,discussion-id=3GWfZdhH,comment-id=000300000000,timestamp=2017-07-25T12:49:26.920+0000)\n>\n> Gay is used as an insult in a negative manner, SJW&#x27;s advocate for a safe space and against bad words that could hurt somebodies feelings, which is why it&#x27;s equatable. Try using a little critical thinking, bud.\n\nNo, I meant that the terms are just being throwing around and tagging onto everything a person merely doesn't like for whatever reason thesedays. This is precisely what you're doing with \"SJW\" like how people used to do with \"gay\".\n\nThey are now both meaningless labels that roughly translate to \"I don't like it so I label it this\".\n\nWhy do I say so? Well, you can read up the evolution of the term \"SJW\".","replies":[{"poster":"0O0O0O0O00O0O0OO","date":"2017-07-25T19:42:29.798+0000","up_votes":1,"down_votes":0,"body":"There is no documented analysis of the etymology of SJW. You compare me showing how this game is equatable to SJW's, to calling something you dislike gay.\n\nDo you not understand the difference? The word gay is used to describe things negative that have no connotations with homosexuality, or used to call someone or something an insult that has no connotations with homosexuality.\n\nIn MY example, I showed how the game has elements that align with the values of an SJW. Just because it's a popular word, doesn't mean its not usable. Maybe you are not a native english speaker, because this is pretty easy to understand.","replies":[{"poster":"SEKAI","date":"2017-07-25T19:47:26.430+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=0O0O0O0O00O0O0OO,realm=NA,application-id=ZGEFLEUQ,discussion-id=3GWfZdhH,comment-id=00030000000000000000,timestamp=2017-07-25T19:42:29.798+0000)\n>\n> There is no documented analysis of the etymology of SJW. You compare me showing how this game is equatable to SJW&#x27;s, to calling something you dislike gay.\n> \n> Do you not understand the difference? The word gay is used to describe things negative that have no connotations with homosexuality, or used to call someone or something an insult that has no connotations with homosexuality.\n> \n> In MY example, I showed how the game has elements that align with the values of an SJW. Just because it&#x27;s a popular word, doesn&#x27;t mean its not usable. Maybe you are not a native english speaker, because this is pretty easy to understand.\n\nBoth \"SJW\" and \"gay\" started as positive terms to mean something and over time ended up as negative terms and now meaning something (almost) completely unrelated to its original use.\n\n\"\"SJW\" is like the new \"gay\".\" is a correct sentence.\n\nAnd because they practically have no meaning at this stage, they are mere tags similar to bogeyman now, slapped onto anything they don't like. Today \"SJW\" means A, tomorrow it will mean B, just like the term \"gay\". That's what I'm getting at.","replies":[]}]}]}]}]}]},{"poster":"Bettnachleger","date":"2017-07-25T13:37:42.757+0000","up_votes":1,"down_votes":0,"body":"You don't regret anything except that you lost your account. \nI mean, you had more than one chance to change your behaviour, but only after you lost your account, you start to regretting anything?","replies":[]},{"poster":"Timethief49","date":"2017-07-25T12:34:50.336+0000","up_votes":1,"down_votes":0,"body":"Its funny how people always say they wont EVER be toxic again AFTER they get the permaban. Not after the chat restrictions, not after the 14 day ban, always when they realize that their toy is gone.","replies":[]}]}