{"poster":"italian mad","date":"2015-02-08T20:09:07.878+0000","title":"Cosa fare?","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Ero 4 giorni fa silver 1 60 lp. Ora silver 3 50 lp. Ho perso una fila di partite infinite. Mi sono fatto un esame di coscienze e ho guardato tutte le partite per capire cosa stia succedendo. Io entro in ranked e perdo punto. Ma ho notato che nel 70& dei casi non è colpa mia. Pick, score cs e decisioni, ho fatto autocritica e ho visto che gioco male alcune volte ma il 60% delle volte perdo per colpa Solo degli altri. Cosa posso fare? Ne perdo 5 ne vinco 1. Prendo 25 lp a win e ne perdo 15. Qualche consiglio?","replies":[{"poster":"LittleLenny","date":"2015-02-08T20:15:26.279+0000","up_votes":1,"down_votes":3,"body":"Sei in un periodo nero, capita a tutti.\n\nTendi troppo a giocare come jungler e support. Sono i 2 ruoli meno coinvolti nel contribuire alla vittoria.\nUn buon top può vincere anche senza il jungler.\nUn buon jungler non necessariamente può far vincere la lane al top.\nE' ovvio che poi affidi la sorte della partita al mid, top, adc di turno.\n\nSe vuoi carriare o ti senti capace di farti, vai in prima linea.","replies":[{"poster":"Ucr0niA","date":"2015-02-08T22:13:44.768+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=LittleLenny,realm=EUW,application-id=MJVj50Jw,discussion-id=ub2KHbEN,comment-id=0000,timestamp=2015-02-08T20:15:26.279+0000)\n>\n> giocare come jungler e support. Sono i 2 ruoli meno coinvolti nel contribuire alla vittoria.\n\n\nDirei che ho sentito abbastanza per stasera.","replies":[{"poster":"PePPeiLMaS","date":"2015-02-09T00:16:48.211+0000","up_votes":1,"down_votes":0,"body":"Direi che è proprio il contrario. Stacca un po' dalla soloq, fai qualche draft ed allenati un po'. Svagati, rilassati e, quando ti sentirai di nuovo pronto e sicuro, torna a fare ranked.","replies":[]}]}]},{"poster":"Over Kairo","date":"2015-02-10T14:15:14.992+0000","up_votes":1,"down_votes":0,"body":"> jungler e support. Sono i 2 ruoli meno coinvolti nel contribuire alla vittoria.\n\nSe vuoi rimanere bronzo tutta la vita ascolta questo tipo qui","replies":[]},{"poster":"Ryuk1980","date":"2015-02-10T08:28:21.744+0000","up_votes":1,"down_votes":0,"body":"Purtroppo i periodi neri capitano a tutti. Quando capita a me, come adesso, stacco con le ranked e mi alleno in normal. Cerco di capire cosa sbaglio e quali champ devo mainare questa season. Una volta che riesco a fare la differenza con questi champ e una volta che mi sento sicuro di giocarmela con tutti in lane, allora torno in ranked.","replies":[]},{"poster":"Firenheit","date":"2015-02-08T20:16:02.281+0000","up_votes":1,"down_votes":1,"body":"Vuoi la mia opinione? Smetti con il SoloQ e ti cerchi un team","replies":[{"poster":"italian mad","date":"2015-02-09T01:44:59.361+0000","up_votes":1,"down_votes":1,"body":"E come lo trovo? e soprattutto cosa cambia?\n\nQualcuno mi spiega come mai mi mettono in team ritardati, contro peggio e i miei ritardati mi fanno perdere (guardare mio game con lee sin 18/8 mi pare la fiora... ma per favore)","replies":[{"poster":"Firenheit","date":"2015-02-09T11:43:06.552+0000","up_votes":1,"down_votes":0,"body":"Ti attacchi come faccio io purtroppo. Il solo Q non significa niente per definizione. Non puoi essere valutato se per farlo bisogna prendere in considerazione solo vittoria/sconfitta ed altri 4 giocatori totalmente casuali, dal troppo bravo che ti fa vincere al troppo scarso che ti fa perdere.","replies":[]}]}]},{"poster":"Lord Valotz","date":"2015-02-09T10:18:30.371+0000","up_votes":1,"down_votes":0,"body":"Non ascoltare la cosa giochi troppo jungler... un buon jungler le fa vincere le partite se ha un minimo di collaborazione dalle varie lane, sarà solo un periodo sfortunato.","replies":[]},{"poster":"Frattaglia","date":"2015-02-09T06:32:13.154+0000","up_votes":1,"down_votes":0,"body":"Sto periodo capitano cose assurde anche a me, dall'adc che crasha durante un trade e mi fa perdere la lane alla partita in cui siamo 14/0 e uno va afk mentre i miei non vogliono più giocare.\nSarà il periodo, quello che ti posso dire è sicuramente di continuare a cercare i tuoi errori, e non rimetterti in coda subito dopo aver perso una ranked ma aspetta almeno 5 minuti!","replies":[]},{"poster":"twitchtv Vodky","date":"2015-02-08T20:39:39.688+0000","up_votes":1,"down_votes":0,"body":"stessa situazione. perse 3 promo per gold V e da li il declino. non dico di essere granche ma il team se ne strafrega della lane, delle torri o altro. ora mi sono messo a fare solo normal e liberarmi dallo stress delle ranked ^^.","replies":[]}]}