{"poster":"CalaBro","date":"2015-06-05T13:33:43.664+0000","title":"CRASH PARTITA RANKED ORA","subforum":"Aiuto e supporto","up_votes":2,"down_votes":2,"body":"Ciao a tutti mentre stavo giocando la mia prima partita di promo per s3 (la mia fortuna &egrave; cieca gi&agrave;) prima &egrave; comparsa la scritta di riconnessione poi &egrave; crashato tutto facendomi comparire un avviso che forse si tratta del firewall del pc... soluzioni?\r\n\r\nps. il firewall non centra nulla non posso pi&ugrave; riconnettermi...","replies":[{"poster":"CalaBro","date":"2015-06-05T13:39:34.340+0000","up_votes":1,"down_votes":1,"body":"bella merda...","replies":[{"poster":"UnknownEV","date":"2015-06-05T13:43:16.019+0000","up_votes":1,"down_votes":1,"body":"Paghi per giocare? hm non credo proprio. Quindi evita di lamentarti.","replies":[{"poster":"CalaBro","date":"2015-06-05T13:45:52.071+0000","up_votes":2,"down_votes":1,"body":"Infatti il servizio fa schifo - non mi sto lamentando sto esprimendo il mio LIBERO parere ;)","replies":[{"poster":"Whommy","date":"2015-06-05T13:47:47.344+0000","up_votes":2,"down_votes":0,"body":"il \"servizio\" non c'entra nulla e sono 2 settimane che tartassate con crash, partite scomparse, drophack, ecc...\n\nleggi sul forum prima di postare","replies":[{"poster":"CalaBro","date":"2015-06-05T13:50:07.126+0000","up_votes":1,"down_votes":1,"body":"Sul forum non c'è nessuna soluzione relativa al problema.","replies":[{"poster":"Whommy","date":"2015-06-05T13:57:54.645+0000","up_votes":1,"down_votes":0,"body":"Perchè non c'è soluzione, non sono problemi ai server, non è colpa della riot.\n\nBuona parte sono problemi di un provider di linea in Olanda che ha avuto un grosso guasto in un nodo importante di connessione, ancora non è risolto al 100%.\n\nSecondo, il drophack è eseguito da TERZI, è un tipo di attacco informatico imprevedibile e difficile da fermare.\n\nTerzo abiti in ITALIA dove la linea internet fa schifo (per capirci in Romania in campagna aperta hanno l'adsl meglio della tua in città)\n\nLa maggior parte delle volte che da \"errore firewall\" è perchè non riavviate il client e spammate su riconetti dopo un crash di linea.\n\nQuando il problema è riot, prima disabilitano le ranked se peggiora mettono offline i server.\n\nL'hanno fatto?\nNo\nAllora non è un problema loro e non sono neanche tenuti a dirtelo.","replies":[{"poster":"CalaBro","date":"2015-06-05T14:06:01.579+0000","up_votes":1,"down_votes":0,"body":"Beh con la fibra ottica dubito sia un mio problema - comunque attenderò.","replies":[{"poster":"Whommy","date":"2015-06-05T14:15:13.836+0000","up_votes":1,"down_votes":0,"body":"Se hai fastweb con l'ip statico può essere un tuo problema","replies":[]}]}]},{"poster":"UnknownEV","date":"2015-06-05T13:55:18.891+0000","up_votes":1,"down_votes":0,"body":"Ma continuare a spammare \"aiuto crash aiuto aiuto\" non farà arrivare prima una risposta o soluzione.","replies":[]}]}]}]}]}]},{"poster":"Oltrend","date":"2015-06-05T13:38:54.106+0000","up_votes":1,"down_votes":0,"body":"è colpa del server... ha dato problemi anche a me qualche minuto fa.... nella mia partita crashavano tutti","replies":[]},{"poster":"UnknownEV","date":"2015-06-05T13:35:24.126+0000","up_votes":1,"down_votes":0,"body":"Non ti ridaranno i punti... sai(?)","replies":[]}]}