{"poster":"haha weed lol xd","date":"2015-07-20T08:07:53.391+0000","title":"Die Sache mit dem Counterplay.","subforum":"Champions & Gameplay","up_votes":1,"down_votes":4,"body":"Kassadins Silence wurde entfernt. Talon Silence wurde entfernt. Veigar Stun braucht nun seine Zeit. LB Silence wurde entfernt. Lee Sin verkr&uuml;ppelt nur noch Lauftempo. Viele Champions wurden w&auml;hrend den Patches geolafed ( au&szlig;er Lee der bleibt immer da ). Einer der Gr&uuml;nde war das nicht vorhandene Counterplay, das Riot nicht mag. \n\nAber wieso darf mich Annie mit einem AP Gegenstand totbursten. Wieso darf eine Nidalee mich aus sicherer Entfernung traden w&auml;hrend sie durch ihren Heal und Escape sicher auf der Lane ist. Wieso darf mich Tham essen, w&auml;hrend Kalista ihn ultet und er sich in seinen Tower schie&szlig;t und ich sterbe. Wo darf ich counterplayen ? Wieso darf mich Ryze dauerfest halten oder mich f&uuml;r kurze Zeit in Fluchtzustand versetzten w&auml;hrend ich bete nicht gesnared zu werden. Wie soll man traden. Das sind doch offensichtliche Defizite, die man doch auf Anhieb erkennen kann. \n\nJetzt kann man ja kommen und sagen \" aber Moment mal, kauf dir doch einfach Banshees gegen Annie \". Das stimmt, nur das ist wieder so eine Sache. \nEin ADC der sich als 2 oder sogar 3 Item ( schuhe nicht mit einberechnet ) ein Banshees kaufen muss ist **immer** behind. \n\n\"Aber du kannst die Nidalee Speere doch einfach dodgen \". Stimmt auch wieder. Aber kannst du 100 % der Nidaspeere ausweichen ? W&auml;re ja auch nicht so schlimm wenn der Speer und der darauffolgende Schaden nicht extrem hoch w&auml;re squishy ( und manchen Bruisern ) w&auml;re. Nat&uuml;rlich ist Nidalee ein Assassine. Aber ein Support, Poke, Try and Error- Assassine ? Sie hat halt das Glück einen Speer versuchen zu treffen und falls er nicht trifft dann versucht sie es gleich nochmal. Nehmen wir mal Zed, Kata, Akali oder Talon. Wenn diese Assasinen engagen/roamen und sie es verhauen, dann ist eben Sense. SIe haben gefailt und dafür wurden sie bestraft. High Risk - High Reward. Nidalee hat viele Versuche bis sie einen Speer trifft. Bei ihr trifft eher Not so high, better say pretty low Risk - High Reward. Was man dazu noch sagen kann ist, dass sie in Teamfights recht schwer an ihre Ziele mit dem Speer kommt durch die Frontlane. \nAber sie kann immer noch poken. \nAber ich schweife vom Thema ab, der Thread soll nicht von Nidalee stammen. \n\nVersteht mich nicht falsch, ich hab nichts gegen oben genannte Champions und ich gewinne auch oft gegen diese ( Diana ftw hue ) aber viele Spieler meiner Skillklasse verzweifeln an diese, was indirekt auch mein Spiel beeinflusst. Riot sollte N&auml;gel mit K&ouml;pfen machen und nicht ein Hand voll Champions nerfen, w&auml;hrend &auml;hnliche Champions gebufft bzw g&auml;nzlich in Ruhe gelassen werden. \nIch verstehe ja auch, dass Annie von ihrem Stun abh&auml;ngig ist. Und Nidalee von ihrem Speer. Aber da wird sich doch sicher ne L&ouml;sung finden k&ouml;nnen. \n\n**Zur Erinnerung !!! Ich habe nichts gegen Annie oder Nidalee sie dienen nur als Beispiel **\n~~dass man das auch noch im Forum schreiben muss, ist erschreckend~~ {{champion:36}}\nFirendly Reminder: Diese Champions sind auf keinen Fall OP oder ähnliches. Der einzige Champ der OP ist, ist Lissandra weil sie den Gegner auf der Lane zu Tode langweilt. ","replies":[{"poster":"OrangeBubble","date":"2015-07-20T09:03:41.620+0000","up_votes":3,"down_votes":0,"body":"Ich geb dir bei Annie/teilweise Ryze Recht. Sie hat mit Q und Tibbers direkte Stuns, die 1.75 halten und der Dauersnare von Ryze ist auch nicht wirklich toll..\n\nAber bei den anderen hast du counterplay. Bei Nidalee einfach mal hard engagen, statt sich zu Tode poken zu lassen. Dann siehst du, wie toll sie doch ist. \nBei Tham einfach mal nicht 3 Autoattacks fressen, dann kann er dich nicht fressen... Wobei ich nicht glaube, dass Tham Fressen + KhalisterUlt so gut zusammen arbeiten sollten.. \n\nMit Counterplay meint man lediglich, dass man eine Möglichkeit hat, zu reagieren und nicht, dass man eine Fähigkeit komplett negieren kann. \nNidalee wirft ein Q und trifft nicht -> du kannst jetzt engagen.\nTham kommt auf dich zu gerannt -> renn einfach weg.\nJanna wirft ihr Q, du kannst dodgen -> Möglichkeit zum Engage\nJayce trifft seine Poke-Kombo nicht -> du kannst jetzt Engagen\nLissandra Q kannst du dogden, ihre Ult mit Cleanse , Qss und Mika auflösen -> du kannst was gegen sie tun.\n\nDas ist Counterplay, dass man Möglichkeiten hat. Was kann man gegen Silence tun? Nichts. Du kannst ggf. weg rennen, aber sonst kannst du nichts dagegen tun. Auf einen Champ wie Soraka ist das ja noch ok, weil sie dich sicherlich nicht in unter 0.5 Sek burstet, aber auf LB war es abartig. Sie silence dich und dann? Warst du zu 100% Tod. Genauso bei Kassadin. Du hattest da im Prinzip gar keine Möglichkeit.","replies":[{"poster":"haha weed lol xd","date":"2015-07-20T09:49:46.397+0000","up_votes":1,"down_votes":1,"body":"> Aber bei den anderen hast du counterplay. Bei Nidalee einfach mal hard engagen, statt sich zu Tode poken zu lassen. Dann siehst du, wie toll sie doch ist. \n\nWenn ich nach jedem Speer als sagen wir zb Ahri oder Orianna Hard-Engage wird sich Nida und auch der gegneriche Jungler aber freuen. \n\n\n\n> Tham kommt auf dich zu gerannt -> renn einfach weg.\n\n\" einfach \" lol. Es spielen noch viele andere Dinge eine wichtige Rolle, wobei Thamm auch noch eine Slow hat und andere Champions ( zb der Jungler ) auch noch ein großer Faktor dabei ist. \n\n> Janna wirft ihr Q, du kannst dodgen -> Möglichkeit zum Engage\n\nJanna ist wirklich kein Champion, den ich bei so einer Aufzählung nennen würde. \n\n\n> Jayce trifft seine Poke-Kombo nicht -> du kannst jetzt Engagen\n\nOk. Ich verstehe aber nicht was du damit sagen willst. Jax misst seinen Stun -> du kannst jetzt engagen. \nIrelias W ist auf CD -> du kannst jetzt engagen. \nDas hat doch wenig mit dem zu tun was ich oben zu Thema gebracht habe. \n\n> Das ist Counterplay, dass man Möglichkeiten hat. Was kann man gegen Silence tun? Nichts. Du kannst ggf. weg rennen, aber sonst kannst du nichts dagegen tun. Auf einen Champ wie Soraka ist das ja noch ok, weil sie dich sicherlich nicht in unter 0.5 Sek burstet, aber auf LB war es abartig. Sie silence dich und dann? Warst du zu 100% Tod. Genauso bei Kassadin. Du hattest da im Prinzip gar keine Möglichkeit.\n\n{{champion:31}}","replies":[{"poster":"OrangeBubble","date":"2015-07-20T10:22:03.429+0000","up_votes":3,"down_votes":0,"body":"Also erstmal hast du auch einen Jungler. Daher kann man genauso sagen, wenn die Nida den Speer misst, dann kann dein Jungler sich freuen, da er jetzt ganken kann und JA, man kann eine Nidalee ganken. Die ist nicht 100% Save auf der Lane. \n\nDer springende Punkt ist, du hast MÖGLICHKEITEN zu reagieren. Das ist Counterplay, MÖGLICHKEITEN zu haben.\nDu hast die Möglichkeit Nidalee Speere zu dodgen und daraus einen Vorteil zu ziehen.\nDu hast die Möglichkeit Jayce Kombo zu dodgen und daraus einen Vorteil zu ziehen. \nDu hast die Möglichkeit vor Tahm weg zu rennen/flashen/dashen/disengagen mit Spells und sein Q zu dodgen, damit er seine Passive nicht auf dich bekommt. \nDu hast die Möglichkeit als Team zu entscheiden, dass ihr besser Hard Engage, anstatt zu versuchen 1000 Nidalee Speere auszuweichen und unter dem Tower zu hocken. Du hast Möglichkeiten. \n\nUnd warum sollte ich Janna nicht aufzählen? Sie hat einen Skill, den man ausweichen kann und für Champs wie Leona kann es wichtig sein, dass Janna gerade ihren Q verschwendet hat, wärend sie ihren E noch hat. Nur weil Janna dir nicht auf die Nerven geht, wie z.B. Nidalee? \n\nBei Silence war dies NICHT der Fall. Du kriegst den Silence von Kassadin ab und du warst tot. Du konntest NICHTS machen. Das ist bei Nidalee, Tahm, Jayce, Lissandra usw. NICHT der Fall. Du kannst was machen, daher finde ich die Kritik von dir bei diesen Champs nicht angebracht. \n\nIch glaub nicht, dass ich Cho mit Soraka gleichsetzen würde, aber nunja, wenn du aus diesen Absatz interpretierst, dass ich Cho'Gath total balanced finde, dann muss ich dich enttäuschend. Ich fand den AoE Silence von Cho noch nie wirklich balanced.","replies":[]},{"poster":"Schlossknacker","date":"2015-07-21T10:22:00.444+0000","up_votes":1,"down_votes":0,"body":"BETTER REMOVE CHOGATH SILENCE!\nLass es uns durch einen 10% Slow ersetzen!","replies":[]},{"poster":"hshtagniemehrcdu","date":"2015-07-20T18:46:08.376+0000","up_votes":1,"down_votes":0,"body":"Gegen Jayce kannst du einen Tank aka Naut an die Front stellen, der mit seinem Schild alles blockt.\nDu kannst Braum hinstellen, sein Schild hat geringeren CD als das Beschleunigungstor.\nSchilde durch Blutdürster, Janna, LuLu.\nDie ganzen Dash/jump fertigkeiten der Champions.\n\nZu Tham... Ashe hat einen Slow, kommt weg.\nVayne, E und Q.\nEzreal, Jump.\nJinx, ihre Fallen.\nCait,Netz.\netc etc.\n\nCho Silence.. Er muss dafür sehr nah an dich dran, AA-Range der meisten ADC's ist höher.\nAuch hat er Null mobilitäät, wodurch er es Schwer hat, an dich ranzukommen.\n\nUnd bei Annie..\nIch schätze, da kommt ein Rework, Riot ist ja aktuell dabei, all solche Sachen aus dem Game zu entfernen.\n\n\nUnd ansonsten.\n> Mit Counterplay meint man lediglich, dass man eine Möglichkeit hat, zu reagieren und nicht, dass man eine Fähigkeit komplett negieren kann.\n\nTrifft es perfekt","replies":[]},{"poster":"CCG Juuzou","date":"2015-07-20T17:23:15.895+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=StrohhutLarry,realm=EUW,application-id=Wj1wcocU,discussion-id=JbWVT72l,comment-id=00000000,timestamp=2015-07-20T09:49:46.397+0000)\n>\n> Wenn ich nach jedem Speer als sagen wir zb Ahri oder Orianna Hard-Engage wird sich Nida und auch der gegneriche Jungler aber freuen. \n> \n> \" einfach \" lol. Es spielen noch viele andere Dinge eine wichtige Rolle, wobei Thamm auch noch eine Slow hat und andere Champions ( zb der Jungler ) auch noch ein großer Faktor dabei ist. \n> \n> Janna ist wirklich kein Champion, den ich bei so einer Aufzählung nennen würde. \n> \n> Ok. Ich verstehe aber nicht was du damit sagen willst. Jax misst seinen Stun -> du kannst jetzt engagen. \n> Irelias W ist auf CD -> du kannst jetzt engagen. \n> Das hat doch wenig mit dem zu tun was ich oben zu Thema gebracht habe. \n> \n> {{champion:31}}\n\nCho hat einen der schwersten Skillshots der League und wäre ohne silence mehr oder weniger sinnlos","replies":[]}]},{"poster":"Caligo","date":"2015-07-20T12:09:22.350+0000","up_votes":1,"down_votes":0,"body":"und was sagst du zu garen? keine Chance wenn der seinen q trifft :p\n\nne spass. guter post und erklärung","replies":[{"poster":"OrangeBubble","date":"2015-07-20T18:04:26.079+0000","up_votes":1,"down_votes":0,"body":"Dann lass nicht zu, dass er dich einholt :P Musst nur schneller laufen, als ein Garen :'D \n\nDanke dir ^.^","replies":[{"poster":"Caligo","date":"2015-07-20T20:22:14.890+0000","up_votes":1,"down_votes":0,"body":"counterplay: ghost","replies":[]}]}]}]},{"poster":"Nuix","date":"2015-07-21T20:45:31.665+0000","up_votes":1,"down_votes":0,"body":"Ist Diana nicht dieser Champ der solange Q spammt bis er trifft und dann all in geht?^^","replies":[]},{"poster":"R1pp3rZ","date":"2015-07-21T09:20:51.713+0000","up_votes":1,"down_votes":0,"body":"Finde ich auch so Assasine brauchen einen buff viel zu viel counterplay. Vorallem die Zed ult gearde. Boah ist das %%%%%% ... Ich war früher main zed und jetzt spiele ich ihn kaum noch weil du engaged und direkt cc'd wirst... Ausserdem dein lategame mit Zed nicht so stark da die enmies eh zhon und qss builden und wie willste die denn bitte aa wenn du cc'd bist holy crap better buff irelia ! xDD","replies":[]},{"poster":"Iron IV dude","date":"2015-07-20T11:50:45.492+0000","up_votes":1,"down_votes":0,"body":"Wobei der perma Snare von Ryze echt schon eine Designkatastrophe ist, dass das immer noch möglich ist *Kopfkratz*.\nAuch Annies stun ist verdammt sick, da der halt sofort wirkt. Keine Animation, keine castingzeit, keine Chance noch zu flashen, dashen oder sonst wie auszuweichen.  (Gleiche auch für Chogaths silence)\nAber das gleiche trifft auch auf die Ults von Malz und WW zu, nur das die halt nicht AOE sind, aber mindestens genauso nervtötend. Aber dort gehört es halt auch zum Kit, ohne wären die.. sagen wir untauglich.\n\nNidalee hatte ich auch mal ein Problem mit,hat aber dank der Tankmeta einiges an schrecken verloren. (Wenn da z.B. n Nautilus anner Front steht, der lacht sich kaputt über den piekser vom Speer).\n\nAber das sind nunmal typische Pokechampions, Zigga, Xerath, Lux, Nida, Jayce, in gewisser Weise auch Janna. \nIst bei \"belagerungen\" unglaublich ätzend, aber in der Regel genügt ein Hardengage und die Sache ist gegessen.\n\nDa finde ich die richtig harten Splitpusher, wie Tryndamere, Master Yi, Shaco, viel übler.\nKaum läst man die n Moment aus den Augen, wieder n Tower down. Das macht den Drake teils nicht mehr worth, imho.\n\nAber gut, worauf ich hinauswill, jeder hat so seine Champions, bei denen sich die Nackenhaare aufstellen sobald man die im Gegnerischem Team sieht, aber bis auf wirklich wenige Ausnahmen (Annie, Ryze) sind die Champions relativ ausgeglichen.\n\nHätte auch ehrlich gedacht der neue Devourer würde in einer Katastrophe enden, konnte das jedoch noch nicht so feststellen.","replies":[{"poster":"Leeerzeichen","date":"2015-07-20T14:57:36.904+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wynillo,realm=EUW,application-id=Wj1wcocU,discussion-id=JbWVT72l,comment-id=0001,timestamp=2015-07-20T11:50:45.492+0000)\n>\n> Wobei der perma Snare von Ryze echt schon eine Designkatastrophe ist, dass das immer noch möglich ist *Kopfkratz*.\n> Auch Annies stun ist verdammt sick, da der halt sofort wirkt. Keine Animation, keine castingzeit, keine Chance noch zu flashen, dashen oder sonst wie auszuweichen.  (Gleiche auch für Chogaths silence)\n> Aber das gleiche trifft auch auf die Ults von Malz und WW zu, nur das die halt nicht AOE sind, aber mindestens genauso nervtötend. Aber dort gehört es halt auch zum Kit, ohne wären die.. sagen wir untauglich.\n> \n> Nidalee hatte ich auch mal ein Problem mit,hat aber dank der Tankmeta einiges an schrecken verloren. (Wenn da z.B. n Nautilus anner Front steht, der lacht sich kaputt über den piekser vom Speer).\n> \n> Aber das sind nunmal typische Pokechampions, Zigga, Xerath, Lux, Nida, Jayce, in gewisser Weise auch Janna. \n> Ist bei \"belagerungen\" unglaublich ätzend, aber in der Regel genügt ein Hardengage und die Sache ist gegessen.\n> \n> Da finde ich die richtig harten Splitpusher, wie Tryndamere, Master Yi, Shaco, viel übler.\n> Kaum läst man die n Moment aus den Augen, wieder n Tower down. Das macht den Drake teils nicht mehr worth, imho.\n> \n> Aber gut, worauf ich hinauswill, jeder hat so seine Champions, bei denen sich die Nackenhaare aufstellen sobald man die im Gegnerischem Team sieht, aber bis auf wirklich wenige Ausnahmen (Annie, Ryze) sind die Champions relativ ausgeglichen.\n> \n> Hätte auch ehrlich gedacht der neue Devourer würde in einer Katastrophe enden, konnte das jedoch noch nicht so feststellen.\n\nIch denke es ist der Sinn von den CC Unterdrückung, dass er wenig-kein Counterplay hat. Alle Champs die ihn besitzen casten ihn Instant, Tenecity reduziert ihn nicht und er kann auch nur mit qss entfernt werden.","replies":[{"poster":"Leeerzeichen","date":"2015-07-20T14:58:24.806+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Leeerzeichen,realm=EUW,application-id=Wj1wcocU,discussion-id=JbWVT72l,comment-id=00010000,timestamp=2015-07-20T14:57:36.904+0000)\n>\n> Ich denke es ist der Sinn von den CC Unterdrückung, dass er wenig-kein Counterplay hat. Alle Champs die ihn besitzen casten ihn Instant, Tenecity reduziert ihn nicht und er kann auch nur mit qss entfernt werden.\n\nOb das gut ist, ist eine andere Frage.","replies":[]}]}]}]}