{"poster":"haha weed lol xd","date":"2015-09-08T13:11:44.000+0000","title":"Probleme mit Mordekaiser ?","subforum":"Champions & Gameplay","up_votes":4,"down_votes":1,"body":"Wer Probleme als ADC gegen Mordekaiser hat darf ich einen starken Pick vorschlagen. \n\nQuinn ! \n\nQuinn bringt nicht nur einen Slow, Knockback und Escape mit. Sie ist auch ein hervorragender Lanebully ( vor allem gegen Meless ) und dank ihres Blinds kann Mordekaiser seine Q nicht treffen. Der Schaden verpufft n&auml;mlich, da er als normaler Autoattack gewertet wird, der durch die Q einfach nur geboostet wird. Auch wenn sie von ihm gecatch werden sollte, ist sie immer noch selbst&auml;ndig genug zu escapen oder sogar gegen ihn zu k&auml;mpfen. \n\nAlso wenn euch mal wieder ein Mordekaiser nerven will, pickt Quinn und ihr habt eine sch&ouml;ne Lane :) {{champion:133}}","replies":[{"poster":"SoloQisMentlBoom","date":"2015-09-08T17:07:33.311+0000","up_votes":1,"down_votes":0,"body":"Was ich von der Supporterseite addieren kann, ist ein Lanebully auch in dieser Rolle.\n\nDen meisten Erfolg gegen Mordekaiser Adc hatte ich mit Morgana und Annie. Man kann ihn immer schön harassen, vor allem mit Annie.","replies":[]},{"poster":"OT Riku","date":"2015-09-08T15:23:48.669+0000","up_votes":1,"down_votes":0,"body":"Also ich würde wenn ich nen Morde Match up bekomme nen champ mit DaSh nehmen und noch nen stun evtl Slow \nAlso quinn und vanye finde ixh generell ziemlich gut gegen ihn \n\nLG Riku","replies":[]},{"poster":"Sirrkas","date":"2015-09-08T13:49:52.774+0000","up_votes":1,"down_votes":0,"body":"Wusste gar nicht, dass der Blind auch den Q-Schaden negieren kann.","replies":[{"poster":"Prodigy Rumiho","date":"2015-09-08T14:23:03.484+0000","up_votes":1,"down_votes":0,"body":"Ist nen Autohit-Amplifier wie Nasus Q.","replies":[]}]},{"poster":"SecretLine","date":"2015-09-08T13:36:24.876+0000","up_votes":1,"down_votes":0,"body":"Naja man muss eigentlich Morderkaiser nur kiten und sein dritten q Stack verhindern da kann ich zb Vayne empfehlen da Sie sich unsichtbar machen kann von dem 3 dritten Stack und Sie kann mit der e Morde auf Range halten.","replies":[]},{"poster":"ClAO KAKAO","date":"2015-09-08T13:34:31.592+0000","up_votes":1,"down_votes":1,"body":"Joa theoretisch gesehen natürlich nicht schlecht aber in der Praxis ist das wieder ganz anders. Du gehst von nem straighten 1v1 aus und bei morde is oft immer heavy cc dabei und somit schlecht für quinn.. ihre ult ist im direkten 1v1 auch useless weil du ihn ( außer du bist gefeedet ) nicht bursten kannst weil jeder morde trinity und steraks + rylais und dein 1,5 sek blind bringt da selbst richtig getimed auch nichts","replies":[{"poster":"haha weed lol xd","date":"2015-09-08T13:55:49.884+0000","up_votes":1,"down_votes":1,"body":">Du gehst von nem straighten 1v1 aus und bei morde is oft immer heavy cc dabei und somit schlecht für quinn \n\nSomit schlecht für jeden ADC. Und von allen ADC hat Quinn meiner Meinung nach die beste Fluchtchancen. \n\n>ihre ult ist im direkten 1v1 auch useless weil du ihn ( außer du bist gefeedet ) nicht bursten kannst weil jeder morde trinity und steraks + rylais und dein 1,5 sek blind bringt da selbst richtig getimed auch nichts \n\nMuss man ja nicht benutzen wenn er full Life ist. Bzw man muss sie überhaupt nicht benutzen. ","replies":[]}]}]}