{"poster":"haha weed lol xd","date":"2015-11-11T17:34:53.538+0000","title":"Tham Kench's Grundschaden sollte etwas heruntergeschraubt werden.","subforum":"Champions & Gameplay","up_votes":5,"down_votes":3,"body":"Hi. \r\n\r\nFinde ~32% Max-Life auf 10s CD auf seiner W gepaart mit seinem Durchhalteverm&ouml;gen und der Passiven machen es fast unm&ouml;glich mit ihm zu traden oder brawlen.\r\nKlar, man ist nicht gezwungen dazu. Aber ein ( als Supporter gedachter ) Champion bei dem das fast einzige Counterplay weglaufen ist passt das Thema &quot; Balancing &quot; nicht so ganz in seine Schiene. \r\nKlar er ist nicht OP, ist lahm, und Kite-anf&auml;llig. Aber als Toplaner oder Jungler kann ich f&uuml;r gew&ouml;hnlich nicht Kiten. Und falls ich doch in eine brenzlige Situation komme kann er relativ  gefahrlos an mir h&auml;ngen bleiben. \r\n\r\nEr kann ein kompletter Fulltank sein und immer noch den meisten Schaden raus hauen, da er die Gegner einfach permanent am cheesen ist. \r\nGenerell ist nichts ein zu wenden gegen ihn, bis auf seine Grundwerte der F&auml;higkeiten. \r\n\r\nProzentualschaden der W runter auf 25% auf Stufe 5   ( 12 / 16 / 19 / 22 / 25 ), weil der Wert einfach absurd hoch ist. \r\nLebensregeneration der E runter auf 35 %.  ( 20 / 24 / 28 / 32 / 35 ), damit er nicht mehr so ein sicheres Traden mit sich bringt.  \r\nThams Passive auf der Ultimate runter auf 6 % ( 2 / 4 / 6 ). \r\n\r\nViel Spa&szlig; beim Downvoten. Hoffe auf konstruktive Kritik und passende Erl&auml;uterungen, rum ihr denkt, dass Tham super balanced ist und nicht angefasst werden sollte.","replies":[{"poster":"Crounty","date":"2015-11-11T18:18:53.675+0000","up_votes":1,"down_votes":0,"body":"Er ist nicht als Support gedacht. Die haben den so entwickelt, dass man den auf jeder Lane spielen kann. Riot hat auch nie gesagt dass der ein Support werden soll.","replies":[{"poster":"haha weed lol xd","date":"2015-11-11T18:20:22.899+0000","up_votes":2,"down_votes":0,"body":"cool. \nIm Endeffekt ändert das nichts an meinem Hauptthema.","replies":[]}]},{"poster":"Scrotum 420","date":"2015-11-12T09:35:09.271+0000","up_votes":1,"down_votes":0,"body":"Das war vor dem Patch. Mittlerweile wird auch der gute Tham weggeburstet, kein Grund ihn zu nerfen.","replies":[]},{"poster":"Ritual92","date":"2015-11-12T09:21:54.767+0000","up_votes":1,"down_votes":0,"body":"Momentan ist der gute ziemlich broken. Du gehst auf full health tank und durch ult haust du trotzdem massiv schaden raus. Wenn du Ihn dann auf 10% geburstet hast schmeißt er seinen Schild an.","replies":[]},{"poster":"Noxempire","date":"2015-11-11T18:14:52.853+0000","up_votes":1,"down_votes":0,"body":"Allein das er die Schwäche jedes Hyper Carries umgeht finde ich krass, wozu dann noch so viel Schaden?","replies":[]},{"poster":"Believing","date":"2015-11-11T18:05:03.188+0000","up_votes":1,"down_votes":0,"body":"Ich finde den Nerf eig auch gerechtfertig, in 3v3 High Elo war das so: entweder du bannst ihn oder du pickst ihn. Und wenn du mit ihm das Ranked verlierst hast du aufjedenfall was falsch gemacht weil er einfach broken ist und immer n free win ist :D","replies":[]},{"poster":"Im a Papaya","date":"2015-11-11T17:46:04.034+0000","up_votes":1,"down_votes":0,"body":"Ich habe Tahm gemaint und stimme dir in den meisten Dingen zu, aber die Heilung ist meiner Meinung nach das was Tahm mindestens braucht um irgendwas zu überstehen. Ein genereller Nerf wäre halt übertrieben.","replies":[]}]}