{"poster":"haha weed lol xd","date":"2015-05-21T09:34:12.258+0000","title":"Kayle \"Schläferchampion\" ?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hallo Beschw&ouml;rer. \r\n\r\nIch m&ouml;chte heute meine Gedanken zu Kayle mitteilen. Ich finde sie ist ein sogenannter Schl&auml;ferchampion. Ihre Pickrate liegt bei etwas &uuml;ber 2% aber eigentlich passt ihr Kit doch wunderbar in das Meta. Allem voran ist ihre Passive kombiniert mit einem {{item:3085}}.\r\nUnd zwar ist sie mit ihrer Passive in der Lage 3 % der R&uuml;stung und Magieresistenz zu entfernen. Das ist 5 mal stackend ( = 15 % ). \r\nIhr E ( Gerechter Zorn ) unterst&uuml;tzt sie dabei. Dieser Skill bewirkt n&auml;mlich, dass ihre Autoattacks AoE magischen Schaden ( wie ein Tiamat ) macht. \r\nSprich Kayle ist in der Lage die R&uuml;stung jedes Gegner zu reduzieren. Das passt hervorragend in das Tankmeta. \r\n\r\nIhre Q und W hilft hervorragend beim Kiten oder Catchen. Sie kann mit Lichbane und Ludens hervorragend poken und ihre Skalierung ist auch nicht schlecht ( Q skaliert 100 % ad, 60 % Ap ). \r\nSie ist in jeder Phase des Spiel stark, sustaint auf der Lane und ihr Waveclear ist auch nicht von schlechten Eltern. \r\nTrotzdem sieht man sie relativ selten obwohl sie sehr wenig Counterplay hat. Sie hingegen countert sehr viele Champion ( vor allem die gef&uuml;rchteten Assasinen ). \r\n\r\nEine schlau gesetzte Ulti kann Teamfights komplett umkremplen und Hard-Engages komplett denien. \r\nJedoch schw&auml;chelt sie Early durch etwas mauen Schaden ( der dennoch ok ist man bricht sich daran kein Bein ) und anfangs geringen Manapool. \r\n\r\nH&auml;tte gerne eine Meinung von euch wie ihr zu Kayle steht. Hab mit ihr jetzt relativ einfach 3 Divisions &uuml;berflogen, da kam mir die Frage auf warum sie denn keiner spielt. \r\n\r\nmfg. Larry {{champion:10}}","replies":[{"poster":"Schesam","date":"2015-05-21T14:48:44.767+0000","up_votes":6,"down_votes":0,"body":">Ich finde Kayle eigentlich nicht schlecht nur ist es wie bei jedem anderen der nicht gespielt. Es gibt bessere Alternativen\n\nOhne Witz, bei sowas krieg ich immer das kotzen. Champs werden nur nicht gespielt weil sie kein Pro spielt. Bestes Beispiel ist Urgot. Keiner hat ihn je gespielt, alle sagten nur der is scheiße und bla alle anderen ADC sind besser. So, jetz hat ihn ein Pro in der Mitte gespielt und nun spielt ihn plötzlich in jedem 2. Game einer und alle meinen nur OP pls Nerf dis shit. Was hat er dabei für Veränderungen erlebt? Genau, ne Mana-Skalierung auf seinem Schild. Das wars soweit. Und so ist es mit verdammt vielen Champs so. \nOder mit Evelynn. ICh sehe sie inzwischen auch in 3 von 4 Games, bei denen ich zugucke (Die ganzen High-Elo-Rankeds die man im Client auswählen kann). Dabei aht sie keinen wirklichen buff bekommen, zwar nen kleinen aber trz. Davor meinte auch nur jeder, sie ist zwar wegen der Unsichtbarkeit nervig, aber keine Bedrohung, klar. Und jetz ist sie zur Bedrohung schlechthin geworden? Is klar.\nDann noch Vlad. Keinen wirklichen Buff bekommen, trz sieht man ihn jetz in jedem 4. bis 5. Game.\n\nDer Großteil macht einfach alles nach was die Pros machen und denken gar nicht darüber nach, warum sie das tun.  Sie denken einfach, was die Pros machen wird schon stimmen und is halt so. Mag zwar sein, das die Pros wissen was sie tun, das heißt aber nicht, das alles was sie nicht spielen, gleich unnütz und total UP wäre. Sie spielen vorallem in Rankeds und der LCS halt die Champ, die sie am besten können bzw. am besten in ihre Team-Comp reinpasst. Was ja auch richtig ist, schließlich gehts um Geld.\n\nVorallem an die Maxim-Gucker: Er beurteilt Champs fast immer total parteiisch. Wenn ein Champ fast nie zu sehen ist, zählt er hauptsächlich die negativen Punkte auf und legt dann daran fest, warum diese Champs scheiße sind. Die Vorteile legt er dabei meist in den Hintergrund zurück und beachtet die gar nicht, auch wenn er paar davon aufzählt. Dann wenn ein Champ häufig gepickt wird, zählt er großteils die Vorteile davon auf und wie man in wo am besten spielt und auf die Nachteile, die teilweise sogar überwiegen, geht er nie besonders groß drauf ein, die Pros spielen den ja schließlich, daher können die Nachteile nciht so schwerwiegend sein. Aber selbst Pros irren sich manchmal lol","replies":[{"poster":"Kiun","date":"2015-05-22T07:21:41.693+0000","up_votes":2,"down_votes":3,"body":"Urgot wurde jeden Patch immer Stück für Stück gebufft, bis er spielbar wurde...","replies":[{"poster":"Schesam","date":"2015-05-22T08:57:12.365+0000","up_votes":4,"down_votes":0,"body":"> V5.5:\nTerror Capacitor\nShield decreased to 60 / 100 / 140 / 180 / 220 from 80 / 130 / 180 / 230 / 280.\nNow scales with 8% of urgot maximum mana.\nHyper-Kinetic Position Reverser\nCooldown reduced to 120 / 100 / 80 from 120 / 110 / 100.\n\n>V4.16:\n\n>General\nNew basic attack animation.\n\n>V4.15:\n\n>General\nBasic attack missile speed increased to 1600 from 1300.\nRecommended items have been updated.\nAcid Hunter\nNow with extra spinning and a trail.\nNow refunds half mana cost if Acid Hunter kills an enemy.\nFixed a bug where  Acid Hunter would fail to home if it was fired too quickly after Noxian Corrosive Charge was applied.\n\n>Hyper-Kinetic Position Reverser\nCooldown reduced to 120 / 110 / 100 seconds from 120 at all rank.\nMana cost reduced to 100 from 120.\nNow grants bonus armor and magic resistance immediately, changed from after a 0.25 second delay.\nUrgot now ignores unit collision for 1 second after successfully using  Hyper-Kinetic Position Reverser.\nThe in-game camera no longer shifts for Urgot when he completes his Hyper-Kinetic Position Reverser, so Urgot can follow-up with appropriate skillshots without having to re-orient his camera.\n\n>V4.11:\n\n>General\nNew Classic splash art.\n\n>V4.5:\n\n>Stats\nBase armor increased to 19 from 15.\n\nWow, such buffs every patches","replies":[{"poster":"Kiun","date":"2015-05-26T08:45:54.105+0000","up_votes":2,"down_votes":2,"body":"Sind das für dich keine Buffs?","replies":[]}]},{"poster":"NECKBREAKERNIKO","date":"2015-05-26T11:58:21.255+0000","up_votes":1,"down_votes":0,"body":"Außerdem passt er einfach besser in die meta ;) \nEr hat viel dps und er hat nicht mehr mit seinem counter, burst, zu kämpfen.","replies":[]}]},{"poster":"haha weed lol xd","date":"2015-05-21T15:20:14.468+0000","up_votes":1,"down_votes":7,"body":"Kenne ich :D \n\nHab mal in einem Gespräch unter Kollegen ( war Midseason 4 ) gemeint, dass Sejuani bald back kommen wird. Und sie meinten so \" neeee Lee Sin, Kha Zix zerstören die einfach \" \nUnd jetzt ist sie einer der meistgepickten Jungler überhaupt :D\n\nNaja der neue Jungle hat da auch einiges dazu beigetragen ( und Cinderhulk **op hust** ) ","replies":[{"poster":"Black Mage","date":"2015-05-21T17:44:43.631+0000","up_votes":5,"down_votes":2,"body":"der unterschied ist der: neues jungle item = OP, das wusste man midseason 4 nicht und hätte es auch nicht erwartet...\n\nDas ist auch der grund wieso im moment tank meta so stark ist, weil ein item dir einen abnormalen finanziellen vorteil verschaft, das eine ganze season dran verrekt (top lane kann/konnte dies auch problemlos bauen, gott sei dank ist ein nerf gekommen)","replies":[{"poster":"haha weed lol xd","date":"2015-05-22T06:18:07.253+0000","up_votes":1,"down_votes":5,"body":"Hab ich das nicht geschrieben ? \n\nAber Seju kam auch vor Cinderhulk in die Meta","replies":[]}]}]},{"poster":"NECKBREAKERNIKO","date":"2015-05-26T11:55:52.056+0000","up_votes":1,"down_votes":0,"body":"Endlich mal einer der das auch denkt :D gute Antwort \nNur in einer Sache stimmt ich dir nicht zu, und zwar der Aussage  mit maxim. Er kennt sich wirklich gut aus und er sagt ja nicht \"der Champion ist schlecht\", er versucht nur eine Erklärung dafür zu finden, dass der champ nicht gespielt wird. Bei elise zum Beispiel hat er gesagt, dass sie eigentlich stark ist :D","replies":[]}]},{"poster":"Black Mage","date":"2015-05-21T10:40:24.699+0000","up_votes":5,"down_votes":2,"body":"Wieso Kayle im Moment so \"schlecht\" ist:\n- Passive bringt zwar was, aber auch wiederum nichts, weil du das ersteinmal stacken musst + die meisten werden ehh mehr HP als armor/magic res gehen + die kombination mit anderen %armor/magic pen effekten ist geringer als man denkt... so ist 15% passive + 25% (darius E z.B.) NICHT 40%, sondern \"nur\" 36.25%, und es wird schlechter je mehr man an %pen hat... Sicherlich toll und so, aber man muss die passive ersteinmal stacken...\n\n-Q Skaliert nicht sonderlich stark, tut zwar weh dank hohem grundschaden und super fürs chasen, aber bei der CD nicht das was man sich als APC sich wünschen würde + die reichweite ist recht niedrig, zusammen mit ihrem E (wobei der recht angenehm ist, aber halt nicht sonderlich \"op\" oder sicher), ist sie nichts anderes als ein ranged adc und somit easy food für jeden der sie bekommt (egal ob tank, burst, assassin, adc, etc)\n\n-W Mittelmäßiger heal, gutes chase tool, kann retten, aber nicht sonderlich nennenswert als heal, eher als utility tool + macht keinen schaden/man wird nicht tanky/stat boost, etc...\n\n-E AA machen splash dmg, haben höhere range und extra magic dmg, nichts besonderes, viele haben den range auch von anfang an...\n\n-R Leider geil, einer der schönsten skills, aber nutzlos wenn man CC'ed oder zu schnell gebursted wird, verhindert außerdem keinen CC...\n\n> Trotzdem sieht man sie relativ selten obwohl sie sehr wenig Counterplay hat.\n\nUntrue, die meisten Assassins werden mit Kayle locker fertig, da fällt mir LB, Kata, Talon, und noch ein paar andere ein, auch Champs die poken können (xerath, ziggs) und champs die dotten können (swain, malz, etc), sind in der lage sie zu besiegen.\n\n\nAber das ist alles nur für \"high elo\", kannst eigentlich alles spielen, was du möchtest.\n\nEdit: nachtrag wieso sie nicht in der LCS gesehen wird: das spiel ist dort viel schneller, etc und da kann man sich kayle nicht leisten, wenn sie ersteinmal unsicher und dann noch erst im lategame wertvoll für das team wird + jungler zerstören kayle, egal ob early, mid oder endgame","replies":[{"poster":"haha weed lol xd","date":"2015-05-21T15:08:24.610+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Black Mage,realm=EUW,application-id=Wj1wcocU,discussion-id=md7wLplm,comment-id=0003,timestamp=2015-05-21T10:40:24.699+0000)\n>\n> Wieso Kayle im Moment so \"schlecht\" ist:\n> - Passive bringt zwar was, aber auch wiederum nichts, weil du das ersteinmal stacken musst + die meisten werden ehh mehr HP als armor/magic res gehen + die kombination mit anderen %armor/magic pen effekten ist geringer als man denkt... so ist 15% passive + 25% (darius E z.B.) NICHT 40%, sondern \"nur\" 36.25%, und es wird schlechter je mehr man an %pen hat... Sicherlich toll und so, aber man muss die passive ersteinmal stacken...\n> \n\nNaja, 5 AA zu machen ist bei Ranuun + Nashors Thooth relativ schnell gemacht ( ~ 1-3 Sekunden ) \n\n> -Q Skaliert nicht sonderlich stark, tut zwar weh dank hohem grundschaden und super fürs chasen, aber bei der CD nicht das was man sich als APC sich wünschen würde + die reichweite ist recht niedrig, zusammen mit ihrem E (wobei der recht angenehm ist, aber halt nicht sonderlich \"op\" oder sicher), ist sie nichts anderes als ein ranged adc und somit easy food für jeden der sie bekommt (egal ob tank, burst, assassin, adc, etc)\n> \n\nFür einen Point 2 Click Skill mit guter Reichweite ( 650 ist recht hoch ) und saftigen Grundschaden ist ne 0.6 Skalierung schon ok. \n\n> -W Mittelmäßiger heal, gutes chase tool, kann retten, aber nicht sonderlich nennenswert als heal, eher als utility tool + macht keinen schaden/man wird nicht tanky/stat boost, etc...\n> \n\nWir wollen die Lanesustain dadurch mal nicht vernachlässigen :) \n\n> -E AA machen splash dmg, haben höhere range und extra magic dmg, nichts besonderes, viele haben den range auch von anfang an...\n> \n\nRange ja, aber sie kann stärker damit traden ( kein Cooldown während der E ), Splashdamage in Teamfights absolut gefährlich. ( #FioraUlt )\n\n> Untrue, die meisten Assassins werden mit Kayle locker fertig, da fällt mir LB, Kata, Talon, und noch ein paar andere ein, auch Champs die poken können (xerath, ziggs) und champs die dotten können (swain, malz, etc), sind in der lage sie zu besiegen.\n\nFinde ich nicht. Schlau gespielt kann man meisten Burst vorhersehen. Natürlich werden könnige Spieler eine Kayle Ult erwarten und darum ihre Kombo nicht raushauen sondern erst 3 sek. warten. \nKayle kann das aber auch, ist ein bisschen Pokern dann ^^ \n\n","replies":[{"poster":"Black Mage","date":"2015-05-21T17:42:03.823+0000","up_votes":5,"down_votes":2,"body":"> Wir wollen die Lanesustain dadurch mal nicht vernachlässigen :)\n\nZu hohe Kosten im vergleich zum effekt, das kann man nicht mit Q spammen, das bereut man nach wenigen momenten meist...\n\n> Naja, 5 AA zu machen ist bei Ranuun + Nashors Thooth relativ schnell gemacht ( ~ 1-3 Sekunden )\n\nRunaans {{item:3085}}  ist imo kostenineffizient, ist ein item slot für atk speed, einem \"medium\" passiven wenn man E aktiviert hat...\nWie sieht bei dir ein Endgame build denn aus? Ich finde das du dir diesen Slot oft nicht leisten kannst (weil andere items mehr bringen) und falls runaans doch in dein inventar fällt, dann bist du um einiges anfälliger für Focus...\n\n> Für einen Point 2 Click Skill mit guter Reichweite ( 650 ist recht hoch ) und saftigen Grundschaden ist ne 0.6 Skalierung schon ok.\n\nNur weil ein skill \"on click\" ist, mit einer \"mittleren\" reichweite (mittlere, weil die AA geringer ausfallen, nähmlich nur auf 525! mit dem E und nur ein Q für einen teamfight bringt NICHTS, verglichen mit tonnenweisen anderen champs), heißt es nicht das es ein \"guter\" skill ist.\nDamit kann man im early poke, im endgame wird man die komplette reichweite kaum nutzen können, dank den AA...\n\n> Range ja, aber sie kann stärker damit traden ( kein Cooldown während der E ), Splashdamage in Teamfights absolut gefährlich. ( #FioraUlt )\"\n\nwas heißt \"kein cooldown während der E\"? man kann mit max cdr beinah perma die E anhaben, aber das ist irgendwie funny, weil andere champs a) mehr range ohne eine aktive haben, b) einen spell haben der mehr schaden machen wird, als der E in seiner wirkdauer (man muss abnormal viele AA machen damit sich ein level up von E, anstelle eines Q's, auszahlt... das ist kein verhältnis für einen der schaden machen möchte...)\nAußerdm ist der splash gering, sehr gering... das wurde zwar bebuffed, aber immernoch nicht nennenswert außerhalb der laningphase + das alle gegner auf einander gestapelt rumstehen, sieht man nur in low elo games... sicherlich geil fürs lanen (kein aggro wenn man den minion daneben angreift), aber sonst, mehh...\n\n> Finde ich nicht. Schlau gespielt kann man meisten Burst vorhersehen.\n\ngratz das du den vorhersehen kannst, aber LB and friends haben den burst jede 10 sekunden up (LB, akali, etc), manchmal auch länger (zed, etc). Und was ist daran pokern, wenn der gegner einfach disengagen muss/kann, wenn du deine ulti zündest, auch kann man einfach das target switchen, dich dennoch stunnen, und dots wirst du dennoch zu spüren bekommen NACH der ulti..., W hat relativ hohe CD, hohe mana kosten und somit auch nicht wirklich super gegen assassinen, welche einfach kurz danach nochmal ankommen können","replies":[]}]},{"poster":"Alustus","date":"2015-05-21T10:56:52.309+0000","up_votes":1,"down_votes":0,"body":"Was man vlllt noch anmerken sollte Kayle ist nicht sehr weit weck von der  Meta (mMn).\nEin paar nerfs oder/und ein paar Item änderungen und sie könnte wieder auftauchen.\nAber momentan gbt es einfach stärkere alternativen","replies":[]}]},{"poster":"Titanium70","date":"2015-05-22T01:52:26.545+0000","up_votes":2,"down_votes":0,"body":"Nun Kayles \"Problem\" ist ihre Rolle - sie ist Top-Jgl-Mid-ADC-Supp spielbar - sie ist stark mit AD, AS, AP, Utility. \nDas bedeutet aber auch das Kayle in keiner Rolle wirklich glänzen kann. Und wenn sie es mal tut, dann nicht für lange, Kayle Nerfs soweit das Auge reicht... \n\nWas Kayle fehlt ist eine Identität jenseits ihrer Ult - EIGENTLICH wäre sie ein perfekter Kandidat für einen Hybrid Champ - doch Hybrid Builds sind schlichtweg nicht viable. q.q","replies":[]},{"poster":"Nephirelle","date":"2015-05-21T10:38:38.540+0000","up_votes":2,"down_votes":0,"body":"Japp, hab' auch Kayle für mich entdeckt, weil viele Tanks mit ihr gnadenlos überfordert sind (allerdings muss das eigene Team auch noch gut mitspielen).\nIhr Early ist nicht auf Kills ausgelegt (eher stirbt man selbst ein, zweimal) und ihr Roaming ist mäh. Ich spiele sie daher grundsätzlich \"hardpushing\", d.h. höchste Prio ist es, Minions mit E gegen den Turm zu schaufeln und den Gegner am Farmen zu hindern. Das ziehe ich auch so lange durch, bis der Turm fällt.\n\nGrößtes Problem mit ihr: Du findest im Teambuilder nur sehr schwer Teams, weil alle sie für einen Support halten und sofort aus dem Team kicken, wenn sie auf Top oder Mitte (meine bevorzugte Position) auftaucht. Daher packe ich sie auch nur aus, wenn ich die Zeit für die Teamsuche aufbringen kann und will.","replies":[]},{"poster":"RPM Mint","date":"2015-05-21T09:48:16.288+0000","up_votes":2,"down_votes":0,"body":"Spielt keiner weil die LCS die Meta bestimmt. In meinen  Augen sind genau die Non Meta Champions die, die glänzen und stark sind.\nKeiner weiss in niedrigeren Elos wie man gegen solche Champions spielen muss, für mich Kayle, Gangplank, Swain und Poppy :){{summoner:32}}","replies":[{"poster":"haha weed lol xd","date":"2015-05-21T09:49:56.939+0000","up_votes":1,"down_votes":3,"body":"Ich liebe Gankplank, war mein erster Champion den ich je gekauft hab und ARRRRRR er macht einfach so viel Spaß :D","replies":[]}]},{"poster":"Kurisu 1v9","date":"2015-05-22T06:46:33.821+0000","up_votes":1,"down_votes":0,"body":"> Ohne Witz, bei sowas krieg ich immer das kotzen. Champs werden nur nicht gespielt weil sie kein Pro spielt. Bestes Beispiel ist Urgot. Keiner hat ihn je gespielt, alle sagten nur der is scheiße und bla alle anderen ADC sind besser. So, jetz hat ihn ein Pro in der Mitte gespielt und nun spielt ihn plötzlich in jedem 2. Game einer und alle meinen nur OP pls Nerf dis shit. Was hat er dabei für Veränderungen erlebt? Genau, ne Mana-Skalierung auf seinem Schild. Das wars soweit. Und so ist es mit verdammt vielen Champs so.\n> Oder mit Evelynn. ICh sehe sie inzwischen auch in 3 von 4 Games, bei denen ich zugucke (Die ganzen High-Elo-Rankeds die man im Client auswählen kann). Dabei aht sie keinen wirklichen buff bekommen, zwar nen kleinen aber trz. Davor meinte auch nur jeder, sie ist zwar wegen der Unsichtbarkeit nervig, aber keine Bedrohung, klar. Und jetz ist sie zur Bedrohung schlechthin geworden? Is klar.\n> Dann noch Vlad. Keinen wirklichen Buff bekommen, trz sieht man ihn jetz in jedem 4. bis 5. Game.\n> \n> Der Großteil macht einfach alles nach was die Pros machen und denken gar nicht darüber nach, warum sie das tun. Sie denken einfach, was die Pros machen wird schon stimmen und is halt so. Mag zwar sein, das die Pros wissen was sie tun, das heißt aber nicht, das alles was sie nicht spielen, gleich unnütz und total UP wäre. Sie spielen vorallem in Rankeds und der LCS halt die Champ, die sie am besten können bzw. am besten in ihre Team-Comp reinpasst. Was ja auch richtig ist, schließlich gehts um Geld.\n\nUnd wo ist jetzt das Problem das Champs nicht gespielt werden, weil sie kein Pro spielt?","replies":[{"poster":"haha weed lol xd","date":"2015-05-22T07:17:05.523+0000","up_votes":1,"down_votes":3,"body":"Denke mal es nervt ihn, das nur noch das gespielt wird was Pros zur zeit spielen ( was Ansichtsasche ist mMn ).","replies":[{"poster":"Schesam","date":"2015-05-22T08:46:43.502+0000","up_votes":2,"down_votes":0,"body":"Nö, eher das jeder sagt das was die Pros nich spielen scheiße es und es bessere Alternativen, was oft nich wahr is","replies":[{"poster":"I love you Malon","date":"2015-05-24T19:23:38.913+0000","up_votes":1,"down_votes":0,"body":"Gleiches mit Corki >.<\nCorki wurde fast nie geepickt...\nLCS BAMM CORKI PICK\n\nJedem Match hat man ein Corki gesehen O.o","replies":[]}]}]}]},{"poster":"Caligo","date":"2015-05-22T06:03:51.836+0000","up_votes":1,"down_votes":0,"body":"Habe letzten ein lustiges \"shreder\" build ausprobiert. \ncore:{{item:3165}} {{item:3115}} {{item:3001}} {{item:3091}} {{item:3267}} \n\nkommt drauf an:\n{{item:3157}} -> haben sie ap und du wirst oft gecatcht\n{{item:3089}} -> du willst mehr dmg\n{{item:3285}}  -> wegen dem mvmnt Speed nice fürs kiten, schaden auch nicht ausser acht zu lassen\n{{item:3085}} mehr aoe\n\nVorteile: sehr kostengünstig, schredderd magis resis, viel aa dmg, 40%creduction\nNachteile: nicht viel ap, zb für heal, keinen burst, min 5 aa um passive von kayle und wits end rauf zu kriegen\n\nich ahbs nicht mit ludens ausprobiert, stell ich mit aber auch stark vor. ich habe zhonias genommen, da die Gegner eigentlich immmer ad haben","replies":[{"poster":"haha weed lol xd","date":"2015-05-22T06:13:24.251+0000","up_votes":1,"down_votes":4,"body":"Mein Standard Build ist in den meisten Spielen: \n\nCore : {{item:3085}} {{item:3285}} {{item:3115}} {{item:3257}} \n\nDanach kommt drauf an,  man kann viel experimentieren. \n\n{{item:3089}} Powerspike auf jeden Ap-Champion :D \n{{item:3146}}  Ganz lustiges Item, unterstreicht ihre Hybrid Note. \n{{item:3100}}  OP Poke und Nuke-Potential. \n{{item:3001}} Ganz nett gegen Heave AP, Assasin etc\n{{item:3116}} Sustain und Kitemittel\n{{item:3124}} Gibts das noch auf der Rift ? Stell ich mir eigentlich ganz gut vor \n{{item:3172}} Viable \n{{item:3041}} HueHUe\n{{item:3157}} Gegen heave ad\n{{item:3091}} Passt sehr gut zu ihrer Passiven stats sind auch ganz nett. Wird generell zu selten gekauft. ( warwick op ) \n{{item:3165}} CDR nice Stats auch sehr Goldeffizient. Trotzdem spiele ich Kayle eher auf Autoattacks da passt Morellos ( in meine Spielart ) nicht \n","replies":[{"poster":"Caligo","date":"2015-05-22T13:09:20.148+0000","up_votes":1,"down_votes":0,"body":"ich habe kayle 2-3 mal gespielt, aber du ahst auch schöne varianten ;D","replies":[]},{"poster":"Sirrkas","date":"2015-05-22T12:19:51.316+0000","up_votes":1,"down_votes":0,"body":"Im Gewundenen Wald bevorzuge ich auf ihr:\n\n{{item:3153}}  {{item:3022}}  {{item:3146}} als Core.\nDer Rest ist meist Situationsbedingt, wenn das Spiel nicht schon zu Ende ist.","replies":[]}]}]},{"poster":"Kurisu 1v9","date":"2015-05-21T14:28:37.505+0000","up_votes":1,"down_votes":0,"body":"> Naja Kayle hat den Vorteil, gegnerischen Burst komplett zu negieren und nur per Autoattacks hohe Schadensspitzen zu erreichen. \n> Dadurch ist sie nicht sehr auf AA angewiesen. \n\nDas muss du mir aber nochmal erklären. Sie erreicht nur per Autoattacks hohe Schadensspitzen und ist deswegen nicht auf Autoattacks angewiesen?\n\nIch finde Kayle eigentlich nicht schlecht nur ist es wie bei jedem anderen der nicht gespielt. Es gibt bessere Alternativen. Ich finde einen Azir/eine Cassipeia um einiges stärker auf der Midlane. Bei dem ganzen CC der zur Zeit in der Kluft unterwegs wäre Kayle auf der Toplane wahrscheinlich ein Free-Kill.","replies":[{"poster":"haha weed lol xd","date":"2015-05-21T14:36:25.505+0000","up_votes":1,"down_votes":2,"body":"Ah sry ich meinte nicht auf Cooldowns angewiesen ^^","replies":[]}]},{"poster":"PraetorAmalthus","date":"2015-05-21T11:47:09.742+0000","up_votes":1,"down_votes":0,"body":"Spiel sie mit nem Olaf premade. Das ist der Godmode! XD Kein CC kein dmg ( für Olaf) nur gemetzel, für 3 Sekunden (was bei Olaf oft genug ist)","replies":[{"poster":"BM Vilich","date":"2015-05-21T12:57:55.242+0000","up_votes":1,"down_votes":1,"body":"Gratuliere, du hast gerade herausgefunden wie man Challenger 3v3 wird.","replies":[]}]},{"poster":"haha weed lol xd","date":"2015-05-21T09:42:54.880+0000","up_votes":1,"down_votes":4,"body":"PS: Ihre Winrate liegt bei 48 % ! \nDa ist böses im Busch ! {{champion:86}}","replies":[]}]}