{"poster":"GandalfferWeiße","date":"2015-10-13T18:40:36.470+0000","title":"yasuo witere tipps","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"kann mir vielleicht noch jemand ein paar kleine kniffe f&uuml;r yasuo geben.\r\nich bin yasuo main und suche nur noch zus&auml;tzliche Details\r\ndanke schonmal im vorraus","replies":[{"poster":"DieSackniere","date":"2015-10-14T10:13:25.692+0000","up_votes":1,"down_votes":0,"body":"Du kannst die Q-Animation verdecken/canceln indem du mit der Windwall arbeitest. W + 3tes Q. Um einen sicheren knock up zu landen E auf den Gegner und danach sofort Q damit du dich halt drehst und ihn somit 100%-ig knock upst. \n\nUm in der Laning Phase zu traden bzw. all-in zu gehen solltest du zuerst die Minions nutzen um an ihn ran zu kommen auch wenn du schon in E-Range wärst solltest du dir die E für den dritten Q aufheben damit du diesen sicher landest.\n\nTraden kannst du sehr leicht indem du auf ein Minion slidest (E) und dann instant die Q drückst um diesen Dreheffekt zu erzeugen. Falls der Gegner Melee ist hat er keine Chance zurückzutraden da du einfach mithilfe deiner Melee-Minions zurücksliden kannst bzw. outtradest du fast jeden Melee Champ auf Level 2 & 3. Im Falle eines Range Gegners nutzt du einfach deine Windwall (W) um deren Autoattacks & Spells zu blocken. Dann einfach um die Windwall herumspielen um die Trades für dich zu entscheiden.\n\nDie meisten maxen E um mehr survivability und mobility zu besitzen kommt aber auf's Match-Up und deine Spielweise ab. Ich maxe meistens Q.\nMein Build-Vorschlag:\nMagieresistenz oder Rüstungsschuhe, Stattiks, BOTRK, Last Whisper, Trinity, IE\nHatte mit diesem Build in Diamond 5 ganz guten Erfolg und kann ihn nur weiterempfehlen.\n\nAuf lvl 2-5 kannst auf agressiv spielen du wirst gegen fast jeden die Trades gewinnen (merkst du dann selber gegen wen das geht etc. kommt mit der Erfahrung)\nDein Schaden fällt dann leicht ab und du solltest warten bist du Stattiks hast da die Items die du für Stattiks brauchst dir keinen großen Damage boost geben und du somit schwächer als der gegner sein wirst der vll mehr ap/ad/leben hat durch seine items (phage etc.)\nWenn du Stattiks hast (First Item) kannst du auf jeden Fall All-in gehen da du ein 1v1 aufjedenfall gewinnen wirst.\n\nIm Late game, wenn deine Q einen wirklichen SEHR geringen CD hat gibts nen kleinen Trick mit der Ulti. Wenn du R drückst kannst du während du mit dem Gegener in der Luft bist noch während du wieder am Boden bist Q drücken. So kannst du schneller mehr DMG dealen, hast deine Q früher und deine 3 Stacks auch wieder schneller.\n\nIst vielleicht ein bissichen unübersichtlich, hoffe ich konnte dir trotzdem bisschen weiterhelfen.\n\nLG und viel Spaß mit {{champion:157}}","replies":[]},{"poster":"GandalfferWeiße","date":"2015-10-14T06:11:22.454+0000","up_votes":1,"down_votes":0,"body":"hey danke euch beiden ich werde mir mal die Videos reinziehen","replies":[]},{"poster":"Suseri","date":"2015-10-14T00:37:40.073+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nwenn du uns nicht mitteilst oder mitteilen kannst, was du schon alles kannst oder wissen willst, koennen wir hier nicht viel sinnvolles zusammenbekommen :). \nVersuche einfach dich im Netz zu informieren, guck dir die Item Wege der Pro Spieler an oder auch ihr gameplay oder lies dir einmal ganz genau alle deine Faehigkeiten durch.\n\n~LG","replies":[]},{"poster":"Xenity","date":"2015-10-13T18:42:51.993+0000","up_votes":1,"down_votes":0,"body":"Geh auf YouTube und schau nach \"Yasuo High Elo Montage\" oder nach \"Yasuo Montage\". Wirst dort bestimmt noch einiges an Moves und Mechanics abkupfern können.","replies":[]}]}