{"poster":"Adam2g","date":"2016-12-31T17:02:03.397+0000","title":"Report","up_votes":2,"down_votes":2,"body":"Elgondolkodtam azon hogy minek reportolni b&aacute;rkit, mert most minek. Lehet az&eacute;rt l&eacute;pett ki mert meghalt a macsk&aacute;ja vagy vlami nagyon fontos dolga akadt vagy csak egy farok. De a legt&ouml;bb embert az zavarja ilyenkor hogy kil&eacute;p valaki, mert k&uuml;ldi bannt azt hello. De att&oacute;l m&eacute;g az lose lesz &eacute;s ez itt a gond. Hogy vesztek az&eacute;rt mert kil&eacute;pett valaki. Most reportolok az nekem mivel lesz jobb? Az MMr em rosszabb lesz miatta plusz lp is vesztek. S&ouml;t a besorol&oacute;kn&aacute;l egy&aacute;ltal&aacute;n nem mind1 hogy valami lose vagy win.\r\nBehozhatn&aacute;nak valami rendszert erre, mert ha flame miatt reportolnak valakit ott is megszokt&aacute;k n&eacute;zni hogy meg&eacute;rdemelte a bannt vagy nem.","replies":[{"poster":"Mind The Gap","date":"2016-12-31T20:38:35.255+0000","title":null,"up_votes":2,"down_votes":0,"body":"Ha reportolod ezzel segítesz, hogy lássák, hogy a gyerek megint kilépett-e, mint az előző 5 meccsén például. Ez nem kiszúrás a másikkal szemben, mert az ő dolga az, hogy biztosítsa magának a megfelelő környezetet a játékhoz, nem pedig a Rioté vagy a csapaté. De reportolod vagy sem, ott a LeaverBuster, ígyis-úgyis elkapják a játékost. Egy csapatjátékban ő a kilépésével nagyban befolyásolja a csapat játékbeli kimenetelét. Ha még nyer is a csapat, akkor is megnehezíti valamilyen szinten a játékukat. Az, hogy meghal a macskája vagy valakije és egyszeri alkalommal lép ki, vagy nem sűrűn, akkor minden jó. Ha meg minden héten legyilkolnak valaki körülötte, hát az pech. Gondolni kell a többi emberre is. Ha tudod, hogy nincs garantált 1 órád a meccshez, akkor inkább ne is kezdj bele, mert aztán jönnek a reklamálások.\n\nNe feledd, hogy mit fogadtál el a regisztráláskor:\n\n>[_**5.1. Trollkodhatok, sértegethetek, provokálhatok, fenyegethetek, zaklathatok másokat a Riot Szolgáltatások használata során?**_](http://eune.leagueoflegends.com/hu/legal/termsofuse#section5)\n[...]\n>xii. Éles játékmenet során kijelentkezik vagy kilép a Játékból. A Riot Games automata Leaverbuster® rendszere folyamatosan nyomon követi ezeket az adatokat, és ideiglenesen kitiltja azt a felhasználót, akinek az esetében úgy ítéli meg, hogy az illető túl sokszor lépett ki játék közben. Ha az adott fiók később továbbra is rendszeresen kilép az éles játékból, az ideiglenes kitiltás időtartama is hosszabb lesz; vagy\n[...]\n\nAmúgy sem lehet kinyomozni, hogy rage quitel-e valaki vagy dolga akadt, és ha nem kapna az illető semmilyen esetben sem büntetést, akkor kihasználnák ezt a Riot által adott lehetőséget. És ugye tudjuk, hogy mi megy ebben a mai becsületes világban.","replies":[]},{"poster":"Max Stirner","date":"2016-12-31T22:05:23.549+0000","title":null,"up_votes":2,"down_votes":1,"body":"A játékosokban -és a feederekben is- felvetődött már az  kérdés: \"Kiket kellene vajon reportolni?\"\nA válasz erre az, hogy mindenkit! Miért? Mindenért! Nem véletlenül létezik -és terjed Bronz V-ben- az a kifejezés, hogy \"REPORT ALL IDIOT TEAM!!4!!4\"\nA csapatot minden körülmény közt reportolni kell! Egyszer majd egy külön fórumtémát fogok annak szentelni, hogy elmagyarázzam egy LoLos meccs szakaszait.\nNa, de addig is REPORT ALL!!!! Előre feederek!!! Bronz V-ért!!!","replies":[{"poster":"Mind The Gap","date":"2016-12-31T22:13:29.016+0000","title":null,"up_votes":2,"down_votes":1,"body":"Más ok nélküli jelentése azt eredményezi, hogy kaphatsz érte büntetést és a jelentéseid egyre kevesebbet fognak érni fyi.","replies":[{"poster":"DS Arawyn","date":"2016-12-31T22:37:11.246+0000","title":null,"up_votes":1,"down_votes":0,"body":"Sőt az ok nélküli jelentés miatt is kaphat az illető büntetést mert bajba akarja keverni a csapattársát. Az már más téma ha úgy feedel szándékosan hogy közben nem sért meg semmi szabályt, hanem csak eljátssza a tudatlan hülyét :D","replies":[{"poster":"Mind The Gap","date":"2016-12-31T23:17:29.967+0000","title":null,"up_votes":1,"down_votes":0,"body":">Sőt az ok nélküli jelentés miatt is kaphat az illető büntetést mert bajba akarja keverni a csapattársát. \n\nIgen, így értettem. Elég kétértelműen fogalmaztam. :)","replies":[]}]}]}]},{"poster":"kalamona90","date":"2016-12-31T17:20:21.340+0000","title":null,"up_votes":2,"down_votes":1,"body":"Én használom a reportott rendszeresen. Abban egyet értek hogy attól hogy ezt még megteszed nem fog változni semmi. nincs semmiféle kárpótlás vagy ilyesmi a  rendszerben. \nAkkor szoktam csak reportólni kilépés után ha látom hogy szánt szándékkal lépet ki. Pl volt egy meccsem amikor kiszedték a normal drafott kb az első ranked meccsem. Szépen össze áll a csapat minden frankó a dzsungeles meg a adc magyarul beszélget írásban. Az utolsó választást várjuk az ellenféltől ami egy Teemo ADC lett. A kedves adc-énk beírja hogy úristen ez Cunterem és attól fogva nem láttuk.  A meccset megnyertük a support Luxunk 1v2 ben szétszedte bot-ot. De a report járt a mi adc-nk nek. \nFlame-ért viszont minden alkalommal reportolok. Ált mutolok mindenkit de ha nem akkor a legkisebb flame után is jár a report nálam. Sose írok be hogy report meg ilyesmi tökmindegy hogy ellenem vagy más ellen megy. Ha az ellenfél írja a közösbe akkor azt is reportolom. Sőőőőt őt különösen ha közösben flamelsz az már azért nálam extra mínusz.\n\nAmi gond szerintem hogy az emberek nem érzik hogy súlya van a reportnak. Valahogy kicsit erősíteni kéne a büntiket. ","replies":[{"poster":"DS Arawyn","date":"2016-12-31T20:28:12.816+0000","title":null,"up_votes":1,"down_votes":0,"body":"Közel 150 ezer FT van a LoL-ban, S4 közepe óta játszok és azóta 2 permabant kaptam flame miatt szóval egyáltalán ne dumálj arról hogy nincs hatása a reportnak :) Ez a hatása hogy 120 ezer forint minuszban vagyok mert hülye voltam. Ha meglenne az első accountom most ott tartanék hogy közel 150+ skinem lenne kb  :)","replies":[]}]},{"poster":"Pyki","date":"2017-01-01T14:12:11.822+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én csak az anyázókat szoktam állandóan reportolni,kilépőket nem mindig,a feedereket meg akkor amikor azt látom hogy be megy az ellenség bázisára direkt meghalni.Akinek nem megy,vagy béna,de a drága csapat társak miatt szenved,pl rá száltak azt felesleges jelentgetni.","replies":[]},{"poster":"Gamma Ray","date":"2016-12-31T22:53:01.360+0000","title":null,"up_votes":1,"down_votes":4,"body":"***","replies":[{"poster":"R3wan","date":"2017-01-01T11:10:33.823+0000","title":null,"up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gamma Ray,realm=EUNE,application-id=VFnq5EbB,discussion-id=FEt4I07u,comment-id=0005,timestamp=2016-12-31T22:53:01.360+0000)\n>\n> Még mielőtt éjfélt üt az óra, boldog új évet!\n> \n> Pár kérdés kompetens emberekhez. Nagyon sokszor előfordul, hogy champ selectnél utolsó 10 másodperc visszaszámlálásánál lépek a fenébe. Még várok hátha javul a helyzet... Főbb okai kettősponty. Gangplank adc, kettő darab adc, egymást rongyosra szidva kelletlenül bejön mellém egy adc akit bűn lesz supportolni. Supportnak jelentkezem, kérdezem hol az adc és Tóni beírja menjek adc-nek úgy, hogy nincs support a csapatbani. Rendszeresen kapom érte a negyed órákat. Felháborodás nélkül kérdezem, miért vagyok köteles egy eleve &quot;trágyának&quot; ígérkező valamiben részt venni? Nem logikus, ha valamit úgy ítél meg bárki, hogy az &quot;gané&quot; akkor nem kezd bele? Ergo engem büntet a rendszer hasamra csapok 10/1 vagy 10/2 meccsenként negyed órával emiatt. Csináltam, supportoltam én Tónit, de valami bűn szar fél órának néztem elébe okulva belőle nem vállalom be még egyszer. Az egyéni teljesítményt meg hajamra kenhetem. Azért építeni egy AP Lulut vagy Namit, hogy majd lehozom botlane-t meg pentázok, hogy is ne esélytelen. :) Nem lehet ezt kikerülni, muszáj szenvedni fél órát vagy várnom negyed órát? Azon csodálkozom még a rendszeres champ select elhagyások miatt még nem lettem tiltva x időre annyi negyed órát kaptam már. Valahogy ez a Leaverbuster nem teljesen jó. De, ha valaki tud erre megoldást és supportolt bot-on egy ismeretlent egy tökre értelmetlen champion-al akivel nem is tudott skype használatával kommunikálni azt is meghallgatom.\n\nNem nagyon van mit tenni. A Draft egy tökéletes megoldás volt erre normálon. Azt meg ugye kivették, mondván legyen rövidebb a várakozási idő. Pedig akkor már inkább a vak módot kellett volna és nem lenne ez, amit leírsz. Fene tudja, mit szívnak odafent. \nA kilépésért meg büntetés jár idővel. Ha direkt csinálod, megérdemled. Ha nem direkt van, mondjuk összeomlik a kliens, elmegy a net, meg hasonlók, azzal neked személyesen kell kezdeni valamit, ha nem akarsz további büntetéseket miatta.","replies":[]},{"poster":"Max Stirner","date":"2017-01-01T14:04:51.922+0000","title":null,"up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Gamma Ray,realm=EUNE,application-id=VFnq5EbB,discussion-id=FEt4I07u,comment-id=0005,timestamp=2016-12-31T22:53:01.360+0000)\n>\n> Még mielőtt éjfélt üt az óra, boldog új évet!\n> \n> Pár kérdés kompetens emberekhez. Nagyon sokszor előfordul, hogy champ selectnél utolsó 10 másodperc visszaszámlálásánál lépek a fenébe. Még várok hátha javul a helyzet... Főbb okai kettősponty. Gangplank adc, kettő darab adc, egymást rongyosra szidva kelletlenül bejön mellém egy adc akit bűn lesz supportolni. Supportnak jelentkezem, kérdezem hol az adc és Tóni beírja menjek adc-nek úgy, hogy nincs support a csapatbani. Rendszeresen kapom érte a negyed órákat. Felháborodás nélkül kérdezem, miért vagyok köteles egy eleve &quot;trágyának&quot; ígérkező valamiben részt venni? Nem logikus, ha valamit úgy ítél meg bárki, hogy az &quot;gané&quot; akkor nem kezd bele? Ergo engem büntet a rendszer hasamra csapok 10/1 vagy 10/2 meccsenként negyed órával emiatt. Csináltam, supportoltam én Tónit, de valami bűn szar fél órának néztem elébe okulva belőle nem vállalom be még egyszer. Az egyéni teljesítményt meg hajamra kenhetem. Azért építeni egy AP Lulut vagy Namit, hogy majd lehozom botlane-t meg pentázok, hogy is ne esélytelen. :) Nem lehet ezt kikerülni, muszáj szenvedni fél órát vagy várnom negyed órát? Azon csodálkozom még a rendszeres champ select elhagyások miatt még nem lettem tiltva x időre annyi negyed órát kaptam már. Valahogy ez a Leaverbuster nem teljesen jó. De, ha valaki tud erre megoldást és supportolt bot-on egy ismeretlent egy tökre értelmetlen champion-al akivel nem is tudott skype használatával kommunikálni azt is meghallgatom.\n\nAkkor hozzám nem? Miért kivételezel velem?","replies":[]}]},{"poster":"Adam2g","date":"2016-12-31T18:00:07.859+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem a büntetést kéne növelni, mert nekem is van olyan hogy egyszerüen ki kell lépnem mert nagyon fontos az ügy és kapok azért 1 hét bannt azért az nem lenne jo. Inkább akkor valami kárpotlást a több csapattársnak. Kevesebb Lp von le tölük vagy valami.","replies":[{"poster":"Nemin","date":"2016-12-31T19:30:03.095+0000","title":null,"up_votes":1,"down_votes":0,"body":"Elmondom ez miért nem jó:\n\nFelgroupoltok öten és mentek egy játékot. Nagyon ramatyul álltok és már biztos hogy vesztés lesz. Megbeszélitek, hogy például Sanyi kilép, így a többiek jóval kisebb büntetést kapnak. Legközelebb majd Jani lép ki, aztán így tovább. Így öt játék után 25 teljes büntetés helyett összesen 5 lesz.\n\n\n---\n\"Nem in, hanem out\"\n[[GYIK és Szabályzat]](http://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/0krXUB6R-a-farumok-szabaalyzata-aos-gyik) [[Fórumos Addonok]](http://boards.eune.leagueoflegends.com/hu/c/minden-egyeb/AehaAUjI-nemin-addonjainak-listaaja) [[Fórumos Discord Szerver]](https://discord.gg/M28bRuX)","replies":[{"poster":"Adam2g","date":"2016-12-31T20:11:03.727+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem, mert lehet pl olyat csinálni hogy 5ös groupnál hiába lép ki bárki akkor maxos a veszteség.\nEz az egész csak rioton mulna, ha egy kicsit jobban átgondolnák a rendszert megoldható lenne. Plusz aki kilép az  a teljes lp veszteséget kapná meg.","replies":[]}]},{"poster":"kalamona90","date":"2016-12-31T18:35:38.238+0000","title":null,"up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Adam2g,realm=EUNE,application-id=VFnq5EbB,discussion-id=FEt4I07u,comment-id=0001,timestamp=2016-12-31T18:00:07.859+0000)\n>\n> Nem a büntetést kéne növelni, mert nekem is van olyan hogy egyszerüen ki kell lépnem mert nagyon fontos az ügy és kapok azért 1 hét bannt azért az nem lenne jo. Inkább akkor valami kárpotlást a több csapattársnak. Kevesebb Lp von le tölük vagy valami.\n\nNem tudom nekem még sose kellet kilépnem. Mindig megválasztom az időpontot hogy mikor játszok. És szerintem jogos is az a büntid abszolút megérdemled, ha fontos volt az a  dolog ha nem. Bocs hogy ezt mondom de én így érzem.  Meg nem is igazán a büntetésnek kell nagyobbnak lennie. hanem én úgy gondolom hogy hamarabb jöjjön de többször. pl: Ha jelenleg valaki sokat flamel már jó pár ember játékát tönkretette mire kap valami szóbani ejnye bejnyét. Én előbb hoznám el a figyelmeztetést Hamarabb kapna esetleges meccs eltiltást. Vagy összerakni hasonló büntetésben lévő játékosokkal. És többször kapna esetlegesen cset tiltást is. Teljes tiltást viszont sokkal később kapna az illető. Így a nevelési időt nyújtanám de erősíteném.","replies":[]}]},{"poster":"DS Arawyn","date":"2016-12-31T20:40:17.029+0000","title":null,"up_votes":1,"down_votes":1,"body":"Én azon gondolkodom el hogy miért kapok olyan játékosokat akiknek annyi eszük sincs hogy legalább azt a 2 oldal rúnatáblát kirakják tier 3 rúnákkal....NEM inkább telerakják tier 2 szarokkal de bűn rosszul és ezek miatt vesztek meccset. Persze az enemyben szinte minden játékosnak 5-6 fullos rúnaoldala van. \n\nSzerinted meglehet azt oldani hogy a játék közepén valaki rage quit-et kap aztán kilép....mit vársz már nem azért??? Hogy majd ilyenkor automatikusan véget ér a játék és ti nem veszítetek LP-t de az enemy meg megkapja rendesen.  Ez kb kivitelezhetetlen....ilyen rendszert de még hasonlót sem láttam egyik játékban sem. Botokkal nem lehet megoldani mert nem. Ha meg valaki kilép akkor azt ellenőrizni kell hogy miért is tette. Ha direkt tette akkor meg kell nézni hogy premadebe volt-e és közös megbeszélés alapján lépett-e ki. Túl sok lenne a kiskapu. \n\nMár a mostani 3.-dik perces remake paranccsal is túl sok gond van. Valamelyik nap láttam egy magyar streamen ( FamasforDemacia streamjében ) hogy egyszerűen nem működött a remake parancs pedig aki kiafkolt az a játék elejétől volt afk és nem játék alatt afkolt ki.  Ezt is alig tudják megoldani nem hogy még egy bonyolultabb rendszert hozzanak be.","replies":[]}]}