{"poster":"l  Ferox  l","date":"2015-08-23T21:28:21.019+0000","title":"Diana Jungle","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Consigli su build per la jungla ? E&#039; un buon pick oppure rende molto di pi&ugrave; mid ?","replies":[{"poster":"Kaledras","date":"2015-08-23T21:47:36.826+0000","up_votes":2,"down_votes":1,"body":"Più forte mid in questo momento , ma cmq viabile in jungla tranquillamente , anzi con il devourer risulta parecchio forte . Cmq per la jungla potresti optare per : devourer, lichbane, nashor tooth , rabadon, zhonya, ,sorcerer.","replies":[{"poster":"SickAnto","date":"2015-08-23T21:54:16.605+0000","up_votes":2,"down_votes":0,"body":"Il devourer è solo just for fun, è meglio il runeglaive.","replies":[{"poster":"Heavenly Yasha","date":"2015-08-24T07:58:28.919+0000","up_votes":1,"down_votes":0,"body":"Decisamente. Vi prego, se la giocate in ranked non fate il devourer su di lei.","replies":[]}]}]},{"poster":"Sir Bourne","date":"2015-08-24T01:51:28.504+0000","up_votes":1,"down_votes":0,"body":"Mi reputo un mezzo main Diana ahahah per cui ti posso dire alcune cose:\n1- Diana è forte sia mid che jungler e dal mio punto di vista rende allo stesso modo in entrambi i ruoli;\n2- Ha una pulizia della giungla velocissima grazie alla W e alla passiva degli attacchi base e per questo ti sconsiglio di gankare prima del 6 (anche se potresti iniziare a farlo dal 4 sbloccando la E) perché le gank dal livello 6 sono praticamente inaggirabili e per questo ti converrebbe sbrigarti a raggiungere il 6: quando Diana ganka il flash avversario è sicuro, e se l'avversario non flasha è kill.\n3- Ho provato il Devourer insieme al Lich Bane e al Nashor Thoot e non worka, Diana non è Master Yi: Diana va buildata con il Runeglaive e secondo item io buildo il Luden's anche se molti preferiscono il Nashor.. Dipende da come sta andando il game, ma comunque questi 2 item sono fondamentali, l'ordine è una tua scelta. Una volta completati questi primi 4 (le scarpe penetrazione magica le do per scontate) buildi la Zhonya e l'Abyssal che rendono Diana praticamente immortale dando alla W un enorme aggiunta di difese.. \n\nQualunque consiglio non esitare a chiedere :)\n\nEdit: non avevo considerato il Void e il Rabadon.. \nOvviamente le build variano a seconda dei punti di vista dei players e per questo ti dico che tra i due buildo a Diana solo il Void Staff al posto del Nashor e il Rabadon non lo calcolo nemmeno perché a mio parere costa troppo per un jungler e in early non è utile (non da passive che servono a Diana) mentre in late come ultimo o penultimo item è difficile da completare..","replies":[{"poster":"SickAnto","date":"2015-08-24T09:52:02.079+0000","up_votes":1,"down_votes":0,"body":"Costerà anche troppo ma è sempre meglio del Luden che l'hanno nerfato e del Nashor che a Diana sinceramente non gli serve visto che ha un buono speed attack e non può stare li a tirare schiaffi alla gente, io lo builderei il Nashor solo quando devo buildarmi tank nei casi d'emergenza.","replies":[{"poster":"Sir Bourne","date":"2015-08-25T13:31:45.174+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SickAnto,realm=EUW,application-id=cAOZwaUi,discussion-id=E6YWH5Np,comment-id=00030001,timestamp=2015-08-24T09:52:02.079+0000)\n>\n> Costerà anche troppo ma è sempre meglio del Luden che l'hanno nerfato e del Nashor che a Diana sinceramente non gli serve visto che ha un buono speed attack e non può stare li a tirare schiaffi alla gente, io lo builderei il Nashor solo quando devo buildarmi tank nei casi d'emergenza.\n\nA parte che non so cosa intendi per Nashor parlando di \"tank\" ahahahah comunque per il resto credo tu abbia ragione, il fatto è che io il Luden's lo buildo a chiunque, è un oggetto che a me piace parecchio e sinceramente non è nemmeno male il movement speed per Diana in giungla anche se comunque forse hai ragione sul fatto che il Rabadon attualmente sarebbe un'opzione migliore","replies":[{"poster":"SickAnto","date":"2015-08-25T18:09:24.679+0000","up_votes":1,"down_votes":0,"body":"Con Diana puoi buildarti tank ma è una build solo nei casi d'emergenza in cui il tuo team non ne ha, e il nashor in quel caso ha senso buildarlo, parlando del Luden, sì anche a me piace è un item divertente per la sua passiva, ma è più (dopo il nerf) per i champ da poke e in jungla mica devi pokkare, mentre il Rabadon è un item qausi obbligatorio per i champ AP (paragonalo all'IE dei adc) ti da un burst AP molto meglio degli altri due item sopra elencati.","replies":[]}]}]},{"poster":"l  Ferox  l","date":"2015-08-24T09:06:39.155+0000","up_votes":1,"down_votes":0,"body":"Grazie per le info, farmo questi 1100 pi che mi mancano e la sblocco :)","replies":[]}]},{"poster":"SickAnto","date":"2015-08-24T10:11:43.415+0000","up_votes":1,"down_votes":0,"body":"E' molto forte sia mid che jungle, la build standard in jungle è simile a quella della mid solo che hai l'item jungle al posto dell'anello, quindi :{{item:3708}} {{item:3157}} {{item:3089}} {{item:3001}} {{item:3135}} {{item:3020}} .\nOvviamente la build può cambiare in base alla team comp avversaria e alleata.\nStarti di W dal gromp, poi la Q e al tre scegli se maxare prima la W o la Q, al 4 ovviamente sblocchi la E, cerca di comperare anche ward per evitare che il jungler nemico ti invadi, sei una facile kill prima del sei.\nA proposito di team comp se in mid o top hai uno Yasuo, cerca di regolarti con la sua ulti con la tua E, è una wombo-combo bella pericolosa , se uno dei due è feeddato potete farvi normalmente un 2vs5.","replies":[]},{"poster":"Distergist","date":"2015-08-23T22:42:52.354+0000","up_votes":1,"down_votes":0,"body":"se la vuoi giocare giugla full ap, lo smite quello che ti dà ap che non ricordo il nome poi la zonia, il rabadon,void staff,le scarpe penetrazione magica. Starti di w,q,e maxi la w poi l q ed infine la e. Gankare perima del 6 è dura disolito ganko al 3 e poi dopo il 6","replies":[{"poster":"SickAnto","date":"2015-08-23T22:46:42.432+0000","up_votes":1,"down_votes":0,"body":"> lo smite quello che ti dà ap che non ricordo il nome\n\nRuneglaive/Gemma Runica","replies":[]}]},{"poster":"TheSuppository","date":"2015-08-23T21:53:34.722+0000","up_votes":1,"down_votes":0,"body":"Io l'ho provata qualche volta in giungla ... non male. L'unica cosa è che va fatta full ap... ;)","replies":[]}]}