{"poster":"l  Ferox  l","date":"2017-01-30T18:39:59.672+0000","title":"Zyra mid può funzionare ?","subforum":"Campioni e gameplay","up_votes":2,"down_votes":1,"body":"Come da titolo, pu&ograve; funzionare stile mage ?","replies":[{"poster":"DoubleT","date":"2017-01-30T19:06:15.647+0000","up_votes":4,"down_votes":0,"body":"Zyra è nata come midlaner, il suo kit  è cambiato ma non di molto, io la gioco molto come support perché oltre ai danni riesco anche a difendere le torri grazie alle piantine che metto di passiva e W.\nIn linea teorica potrebbe essere buona come mid, ma richiede un senso della posizione estremamente curato ed attento, soprattutto se vuoi che le piantine spuntino dove vuoi. Però in linea generale, quando cominci a farti il giardino di boccioli, anche solo un ingaggio fatto male da parte degli avversari e ti porti a casa la kill (anche se ci muori).","replies":[{"poster":"l  Ferox  l","date":"2017-01-31T09:37:36.392+0000","up_votes":1,"down_votes":0,"body":"Tnx per le info ... prima o poi la proverò mid in normal per vedere cosa viene fuori :)","replies":[]},{"poster":"Kim114","date":"2017-01-30T20:10:46.664+0000","up_votes":1,"down_votes":2,"body":"{{champion:143}} ha ancora la passiva che quando muore lancia un pungiglione? l ho vista morire tante volte eppure mai mi faceva danno","replies":[{"poster":"DoubleT","date":"2017-01-30T20:44:42.189+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kim114,realm=EUW,application-id=cAOZwaUi,discussion-id=EpO4jAGy,comment-id=00000000,timestamp=2017-01-30T20:10:46.664+0000)\n>\n> {{champion:143}} ha ancora la passiva che quando muore lancia un pungiglione? l ho vista morire tante volte eppure mai mi faceva danno\n\nNo ora la sua passiva fa spawnare un bocciolo ogni 20 secondi. Come per i boccioli che metti con la W questi si attivano quando casti sopra di loro (anche ad una certa distanza) la Q o la E. Con la Q spawnano i fiori che lanciano i dardi e con la E i fiori che attaccano melee.","replies":[]}]}]},{"poster":"Elperonaranja","date":"2017-01-31T13:10:25.124+0000","up_votes":2,"down_votes":0,"body":"Si, funziona , io la gioco in ranked.\nHa problemi solo contro gli Assassin. E countera magnificamente yasuo. Provare per credere :D","replies":[]},{"poster":"Apokàlypsis","date":"2017-01-31T10:56:16.438+0000","up_votes":1,"down_votes":0,"body":"L'ho incontrata mid qualche giorno fa e non è male. Molto fastidiosa soprattutto se sai piazzare bene le tue piantine (le aveva posizionate pure nei cespugli laterali per salvarsi dalle gank). Dato che non riusciva a fare kill è poi scesa in bot a farsi una bella doppia e poi non l'ho più vista in mid dato che andava in giro a uccidere e a farsi i fatti suoi. \nIn linea di massima è buona ma evitala contro champion tipo Orianna, Aurelion o Syndra che possono tranquillamente distruggerti le piante o lanciartele addosso senza prendere danni.","replies":[]}]}