{"poster":"Devourer","date":"2016-03-26T02:29:11.797+0000","title":"Silent Night Sona and the Kog Maw variant of the skin don't sing anymore","subforum":"Report a Bug","up_votes":2,"down_votes":0,"body":"I was just in a game with both skins, we tried to dance so that we would sing together and there was nothing but silence. I only got the kog skin so they could sing together and it appears neither of them work right now.","replies":[{"poster":"moonstones","date":"2016-03-28T18:14:22.369+0000","up_votes":6,"down_votes":0,"body":"Oh no, this is awful. D: Luckily, we're off season, but we'll see what we can do to get this resolved ASAP! Thanks for the report! ^-^","replies":[]},{"poster":"Riot LoveStrut","date":"2016-04-04T20:53:29.216+0000","up_votes":3,"down_votes":0,"body":"Thanks for checking that, A Cloud! :D No problem, occasionally these kinds of occurrences can just happen during random games too. I appreciate you checking this out and updating this thread! Let me know if you run into anymore problems, and I can look into it. :]","replies":[]},{"poster":"Riot LoveStrut","date":"2016-03-29T01:51:44.586+0000","up_votes":1,"down_votes":0,"body":"Hi there, A Cloud!\n\nJust to be sure, are you using your dance emote or your **joke emote** to trigger this? You should be able to get the holiday duo to perform together if you use their jokes.","replies":[{"poster":"Devourer","date":"2016-03-31T02:48:49.440+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot LoveStrut,realm=NA,application-id=LqLKtMpN,discussion-id=JaiTguRe,comment-id=0001,timestamp=2016-03-29T01:51:44.586+0000)\n>\n> Hi there, A Cloud!\n> \n> Just to be sure, are you using your dance emote or your **joke emote** to trigger this? You should be able to get the holiday duo to perform together if you use their jokes.\n\nI tried all of the emotes to no avail, may have just been that 1 game though. I haven't tried since to be completely honest.\nEdit: After trying again it seems to work, may have just been a bug or something on my end, sorry for the false report.","replies":[]}]},{"poster":"Tanadon","date":"2016-04-04T21:05:01.885+0000","up_votes":1,"down_votes":0,"body":"Sometimes when I spam my joke or laugh, nothing happens, but I think (and I may be completely wrong) that it's just too many inputs at once.","replies":[]}]}