{"poster":"Galaxyburstz","date":"2019-01-27T22:45:45.290+0000","title":"Asyou, the Forgotten","subforum":"Concepts & Creations","up_votes":1,"down_votes":0,"body":"I am wondering  if you think my Champion is designed poorly or well , below is his kit descriptions: \r\n\r\nPassive:  The Way of the Follower \r\nGain 10% Magic Penetration at level 1, increasing by 10% every 3 levels to a maximum of 50% MPen at Upon reaching Level 15\r\nImmediately after casting 6 abilities gain a shield that blocks some damage, the shields HP scales with Level and is triggered by being inflicted with damage from a champion or monster.\r\n\r\nQ Ability: Vine of the Ancients \r\nThrusts forward, damaging all enemies in a line.\r\n\r\nOn hit, grants a stack of Thunderstorm for a few seconds. At 2 stacks, Thunderstorm fires a vine that roots all enemies upon impact.\r\n\r\nThunderstorm is treated as a basic attack and scales with all the same things.\r\nThrusts forward, dealing 20/45/70/95/120 (+100% Ability Power) magic damage. On hit, grants a stack of Thunderstorm for 6 seconds. At 2 stacks, Thunderstorm fires a vine that roots all impacted enemies.\r\nThunderstorm is treated as a basic attack: It can critically strike, applies on-hit effects, is interruptible by crowd control and its cooldown and cast time are reduced by Attack Speed. If cast while dashing, Thunderstorm will strike as a circle.\r\n\r\n\r\nW Ability:  Tree of Protection \r\nAsyou summons a tree that blocks all enemy projectiles for 4 seconds. The size or width of the tree scales with level.\r\n\r\nE Ability: Slick Branch\r\nDashes through target enemy, dealing physical damage. Each cast increases your next dash&#039;s base ability damage, up to a max amount.\r\n\r\nCannot be re-cast on the same enemy for a few seconds.\r\n\r\nIf Vine of the Ancients is cast while dashing, it will strike as a circle.\r\nDashes through target enemy, dealing 60/70/80/90/100 (+60% Attack Damage) (+20% bonus Magic Damage) magic damage. Each cast increases your next dash&#039;s base Damage by 25%, up to +50%.Cannot be re-cast on the same enemy for 10/9/8/7/6 seconds.If SThunderstorm is cast while dashing, it will strike as a circle.\r\n\r\nR Ability: First Cough\r\nBlinks to a rooted enemy champion, dealing magical damage and holding all rooted enemies in the area in the to the ground. Grants a free passive shield  but resets all stacks of Thunderstorm\r\n\r\nFor a moderate time afterwards, Asyou&#039;s basic auto attacks gain a significant Bonus of Magic Penetration.\r\nBlinks to an Rooted enemy champion, dealing magical damage and holding all rooted enemies in the area in the to the ground for an additional few seconds. Grants maximum a free passive shield but resets all stacks of Thunderstorm.For second(s), Asyou&#039;s basic attacks gain % Bonus Magic Penetration - this affects Armor from items, buffs, and runes.\r\n\r\n\r\nJust want to know your thoughts on whether this champion is balanced or not and if you were Riot would you allow him into the game?","replies":[{"poster":"Febos","date":"2019-01-27T22:59:34.538+0000","up_votes":3,"down_votes":0,"body":"Me: \\* reads \"Asyou\" \\*\nAlso me: \\* reads abilities description \\*\n\nhttps://i.imgur.com/aqwtI.png[]","replies":[{"poster":"Galaxyburstz","date":"2019-01-27T23:37:47.263+0000","up_votes":1,"down_votes":0,"body":"lol","replies":[]}]},{"poster":"Gilgayu","date":"2019-01-30T01:58:20.809+0000","up_votes":1,"down_votes":0,"body":"I seriously hope you don't take this the wrong way.\n____________\nHis w and e are basically yasuo's. Even the interaction of his e with q is the same thing. The fact that he gains a different \"q\" every two cast is also the same thing as yasuo. His ult is pratically the same thing, as it can only be used on targets hit by a certain cc.\n\nAs concept creators, I would argue there is nothing more important than originality. Although there has never been a precedent of fan-made champion in the actual game, it doesn't mean it can't happen. Riot wouldn't want the same champion that goes by a different name.\n\nYou can god-mode your champion (as ChaosReyn, a fellow concept creator, puts it). You can create a champion that's the most boring character in the world. The most important thing is orginality.\n\nIf your numbers are wrong, Mr. Voidling is always there to help (an truly amazing concept creator). If your concept doesn't really make sense (say you have all the damage but no cc or mobility), ChaosReyn and Nasu010 are there to help you paint the character you have in mind.\n__________________\nThrough your recent posts, I can tell that you aren't the person most interested in Concept Creation, but that doesn't stop you from becoming one.\n\ntbh, this is the least toxic part of boards, and it contains concepts that can be compared to and surpass those in-game.","replies":[]},{"poster":"Mr Voidling","date":"2019-01-28T00:29:33.391+0000","up_votes":1,"down_votes":0,"body":"Hmm... No 2 item power spike, idk about this one. Maybe with void staff and morello.","replies":[]}]}