{"poster":"ReLotar","date":"2019-12-21T14:22:26.567+0000","title":"L'ultimate di Cho'Gath necessita di un'occhiata","subforum":"Campioni e gameplay","up_votes":2,"down_votes":0,"body":"Messaggio per lo staff Riot.\nUltimamente sto giocando solo Cho'Gath e trovo frustrante l'utilizzo della sua ultimate. Parlo della sua reazione, ok che c'è un lieve ritardo nel cast, ma c'è il fatto che mi è capitato TROPPO spesso che questa dia priorità ai minion anzichè i champ. Mi è capitato 3-4 volte in due giorni.\n\nChiedo che dia priorità al champ come bersaglio e una reazione più precisa almeno.\n\nSpero altri Cho'Gath main abbiano notato la stessa cosa e si uniscano alla discussione.","replies":[{"poster":"javateciava","date":"2019-12-27T20:06:34.493+0000","up_votes":1,"down_votes":0,"body":"Ciao, @relotar gioco anche io chogat in elo alto, e devo ammettere che è successo pure a me più di una volta, effettivamente con il pulsante \"solo campioni\" si risolve quel problemino delle priorità, e sì, la canalizzazione dell'animazione della R è decisamente molto lenta e probabilmente andrebbe rivista..  Tornando al cast c'è anche da dire che devi avere anche un hardware che te lo permetta.. personalmente passando da un 10 ad un 60 euro di tastiera (e lo stesso per il mouse) è cambiato anche parecchio il livello.. da molto questo gioco è un pay2win. Personalmente ti sconsiglio di giocare. Fai solo normal, ti diverti di più e avrai a che fare con molti meno casi umani","replies":[{"poster":"Luckynanix","date":"2019-12-27T20:14:30.729+0000","up_votes":1,"down_votes":2,"body":"P2W? Ma sei serio? Inoltre anche io gioco C'ho (non spesso ma abbastanza) e no.n ha nessunissimo problema con la ulti...","replies":[{"poster":"javateciava","date":"2019-12-28T13:34:03.658+0000","up_votes":1,"down_votes":1,"body":"Sì, certo che sono serio. Prova a giocare con un computer da 100€ e poi con uno da 600€ e poi con uno da 2400€ .. vedrai ^__^   Stesso discorso per la connessione. \nNessun problema con l'ulti? Prova a rincorrere una vayne in ulti che ogni volta che casti la tua ulti su di lei scompare invisibile e ti si cancella il comando perchè è troppo lenta l'animazione .. ovviamente devi giocare contro qualcuno che ha una buona conoscenza del campione .. provare per credere","replies":[{"poster":"Luckynanix","date":"2019-12-29T08:37:20.946+0000","up_votes":2,"down_votes":2,"body":"Te stai fuori... L'unica cosa che cambia è la qualità e fidati ho giocato fino a poco fa con un PC di 10 anni fa e non c'è differenza se non appunto nella qualità, negli fps. Che poi P2W vuol dire che per vincere devi SHOPPARE NEL GIOCO, cosa assolutamente sbagliata e lontanissima da LoL... Prima di usare certi termini pensa al.loro VERO significato, non a quello che gli attribuiscono tu...\nTu hai descritto un caso in cui l'interazione è pensata così, perché una spell a target non può colpire qualcosa che non vede, ergo è giusto così. Inoltre è chiaro che la spell.ha un cast time, più lungo del normale AA, esattamente come molte altre ultimate, ad esempio quella di pyke che  viene usata fondamentalmente per lo stesso motivo, ovvero executeare un champ, con la differenza che una è punta e clicca e fa danni puri fissi mentre l'altra è uno skillshot ad area che fa da execute. Perché esiste questo cast time? Per dare all:avversario un minimo di counterplay, s noti tutte le ulti con execute/danni puri danno modo all'avversario di fare qualcosa per difendersi altrimenti non sarebbe divertente giocarci contro diventerebbe un \"sono sceso sotto un tot di vita quindi ho perso\", sarebbe come giocare con un 400/500 hp in meno (facendo una media al volo tra i danni delle varie ulti execute).","replies":[{"poster":"javateciava","date":"2019-12-29T17:28:15.587+0000","up_votes":2,"down_votes":0,"body":"Guarda garen :)\nGuarda il drago elementale :)\nGuarda il tuo italiano :)","replies":[{"poster":"Luckynanix","date":"2019-12-30T09:56:19.196+0000","up_votes":1,"down_votes":2,"body":"Garen ha un cast time. Il drago è un cambiamento nuovo e comunque vedi il buff e sai quando ti può executeare. Belle %%%%%%%%% torna a trollare qualcun'altro","replies":[{"poster":"javateciava","date":"2020-01-04T22:43:18.146+0000","up_votes":2,"down_votes":0,"body":"Temo che il Trundle sia tu :) btw sei OT come al solito, ti rispondo solo per cortesia con uno spoiler: garen ha un cast time ma anche la sua ulti non può più essere evitata ;) leggi le note che è meglio. \nChe il drago sia nuovo cosa cambia? Che tu veda la soglia cosa cambia? Anche guardando gli hp di chogat e il suo ap ti puoi fare tranquillamente 2 conti :)\nRe dei troll, torna nella tua caverna","replies":[{"poster":"Luckynanix","date":"2020-01-05T07:55:17.887+0000","up_votes":1,"down_votes":2,"body":"Esci dalla visione e la ulti di garen si annulla, zhonya e ti salvi, scudi, cure ne esistono di modi per annullare l'effetto. \nIl fatto che sia nuovo vuol dire che deve ancora essere bilanciato e sistemato, dopotutto siamo in preseason (spoiler il primo ad andare OT sei stato tu dicendo che lol è P2W cercando di farlo sembrare sensato...","replies":[]}]}]}]}]}]}]},{"poster":"Dantazzo","date":"2019-12-29T08:43:08.864+0000","up_votes":1,"down_votes":3,"body":"\"Gioco ad elo alto\" (Plat 4 non è Elo alto) e \"manco un punta e clicca\" non possono stare nella stessa frase","replies":[{"poster":"javateciava","date":"2019-12-29T17:26:37.919+0000","up_votes":2,"down_votes":0,"body":"tipico commento da S5... ah giusto ora si chiama B1 ;)","replies":[{"poster":"Dantazzo","date":"2019-12-30T08:58:08.851+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=javateciava,realm=EUW,application-id=cAOZwaUi,discussion-id=amAmmp72,comment-id=000300010000,timestamp=2019-12-29T17:26:37.919+0000)\n>\n> tipico commento da S5... ah giusto ora si chiama B1 ;)\n\nForse ti conviene controllare 😀","replies":[{"poster":"javateciava","date":"2020-01-04T22:45:45.136+0000","up_votes":2,"down_votes":0,"body":"forse ti conviene capire che anche gli dei sbagliano. Guarda gli SKT :) guarda I G2 :) guarda i FNC :) guarda Dopa :) guarda chi vuoi, tutti sbagliano ma se non te ne sei ancora accorto forse non sono io quello che deve controllare :)\nTurndle avvisato mezzo salvato","replies":[{"poster":"Dantazzo","date":"2020-01-05T09:02:54.698+0000","up_votes":1,"down_votes":1,"body":"Forse sei tu che non arrivi al fatto che stai proponendo di facilitare un champ che è già a prova di mentecatto, non esiste al mondo di facilitare una skill che è punta e clicca.","replies":[]}]}]}]}]}]},{"poster":"XPY99","date":"2019-12-21T18:50:56.609+0000","up_votes":2,"down_votes":0,"body":"Mi sa che sei tu che devi migliorare la mira, tutte le abilità punta e clicca non danno priorità a nulla se non a cosa clicchi tu\n\nDetto questo nel client c'è l'opzione per impostare un tasto che se tenuto premuto durante il lancio di un abilità quella la puoi usare solo sui campioni nemici","replies":[]},{"poster":"beppedessi","date":"2020-01-05T13:25:12.921+0000","up_votes":2,"down_votes":1,"body":"Ricordo a tutti che il post originario era riguardante la ultimate di Cho'Gath. Andare OT può essere naturale a volte, come è successo il questo caso. Semplicemente cerchiamo di non calcare troppo la mano e di mantenere un atteggiamento rispettoso verso gli altri utenti. Se voleste ancora discutere su \"LoL è un gioco P2W?\" vi invito ad aprire un nuovo post.","replies":[]},{"poster":"Spawner1","date":"2020-01-10T15:48:19.536+0000","up_votes":1,"down_votes":0,"body":"Essendo un punta e clicca ogni tanto ci possono essere problemi se ci sono altre unità nelle vicinanze...capita anche a me ogni tanto con questo tipo di abilità","replies":[]},{"poster":"Dantazzo","date":"2019-12-29T08:44:32.524+0000","up_votes":1,"down_votes":1,"body":"È un punta e clicca, non dà priorità a nulla, semplicemente la esegue su ciò che clicchi.","replies":[]},{"poster":"SickAnto","date":"2019-12-21T18:15:02.364+0000","up_votes":2,"down_votes":2,"body":"Io gioco spesso Cho, non ho mai avuto questi tipi di problemi onestamente.","replies":[]},{"poster":"C0RTES","date":"2019-12-22T13:52:40.677+0000","up_votes":1,"down_votes":2,"body":"È un’abilità punta e clicca, non dà preferenze di bersagli. Se clicchi sul bersaglio sbagliato ovvio che mangi quello","replies":[]}]}