{"poster":"Rovonero","date":"2016-12-08T22:35:09.653+0000","title":"Ma sono una truffa le partite di piazzamento","subforum":"Discussioni generali","up_votes":2,"down_votes":4,"body":"adesso posso capire il discorso che i livelli alti si abbassano e quindi entriamo in una posizione piu bassa.. per&ograve; vincere 7 partite, perderne 3 e da gold  finire a bronzo 3?  alla faccia del finire in leghe un &quot;pochino piu basse&quot; a sto punto mettetemi subito in bronzo 5 senza spaccarmi i maroni con 10 partite che non servono ad una mazza","replies":[{"poster":"CrashDownThai","date":"2016-12-09T00:39:14.060+0000","up_votes":3,"down_votes":0,"body":"io ne ho vinte 9 su 10 e sono finito in bronzo V. OK che ero argento però va fan culo le ho vinte tutte almeno fatemi partire da argento V. E già il terzo anno che salgo da bronzo a argento  e ogni cazzo di volta arrivate voi con i vostri piazzamenti del cazzo e mi fatte ripartire da capo. MInchia ne ho vinte 9 su 10 cazzo volete ancora? ve ne devo vincere 20/10 magari. Non è che sono un pro però come cazzo si può migliorare qua in bronzo che ogni cazzo di partita o c'è chi feeda o c'è un afk. Fate passare la voglia di giocare... ma fattemi il piacere va, andate a spazzare le strade piuttosto che rompere il cazzo a noi con i vostri piazzamenti del cazzo. \nE prima di pensare magari di bannarmi o che cazzo volete fare fatte perche mi avete fatto passare la voglia di giocare in questo gioco.Andate a vedere la storia del mio acount che non ha mai rotto il cazzo a nessuno.\nRidicoli","replies":[{"poster":"Rovonero","date":"2016-12-09T02:09:14.054+0000","up_votes":2,"down_votes":1,"body":"guarda sinceramente il fatto che mi mettono in brozo non è un problema.. però se mi fai scalare il brozo giocando partite contro persone che si sono piazzate dal silver 3 al al gold 4 mi viene automatico chiedere perchè  cazzo mi metti in bronzo se poi devo giocare contro gente che si è piazzata di 2 leghe piu in alto e non gente che si è piazzata come me?","replies":[]}]},{"poster":"Sorcio84","date":"2016-12-09T12:43:01.534+0000","up_votes":2,"down_votes":0,"body":"io da B3 con 6W 4L sono stato messo B5 e ora ho il 66% di win rate. Mi sto impegnado e sono sicuro che almeno a B2 ci arrivo easy.\nForza e coraggio, ammettere di essere scarsi e di dover sempre migliorare, e si sale di elo easy.\n\nPiù sei forte, meno fatica farai a salire, a parte se trovi sempre gente uber scarsa come me quella volta che sono sceso B3 50 LP a B5 0LP , ma può succedere una lose streak per depressione, poi ci si riprende.\n\n{{champion:26}} *Non si può cadere dal pavimento, ci si può solo rialzare*","replies":[{"poster":"Ardens33","date":"2016-12-09T17:57:00.881+0000","up_votes":2,"down_votes":0,"body":"Mi strappi sempre un sorriso","replies":[{"poster":"Sorcio84","date":"2016-12-09T22:42:58.734+0000","up_votes":1,"down_votes":0,"body":"domani te lo riporto, promesso.\n( ' 3 ')","replies":[]}]},{"poster":"Salvatore Brizzi","date":"2016-12-09T14:12:25.519+0000","up_votes":1,"down_votes":1,"body":"sfaccimm ommemmerd ke caz va dicenn mannagg tutt cos! Si bronz prokodyo","replies":[]}]},{"poster":"Bastonliegi","date":"2016-12-09T12:59:19.471+0000","up_votes":2,"down_votes":0,"body":"Gli ex-Challenger si possono classificare massimo Platino 1 e non si lamentano, non capisco perché  ci dobbiamo lamentare noi \"low elo\"...\n(Fatevi il conto di quanto più  in basso vengono messi in confronto alla loro posizione in Season scorsa! È ovvio che di conseguenza anche tutti quelli di Elo più basso vengano messi ALMENO 5 Divisioni più in basso)","replies":[{"poster":"Rovonero","date":"2016-12-09T16:13:07.234+0000","up_votes":2,"down_votes":0,"body":"non è il fatto di perdere posizioni... il fatto è che devo giocare in lega bronzo contro individui che si sono classificati silver-gold... se mi devi fare giocare contro silver e gold mettimi in silver o gold se mi metti in bronzo mi fai giocare con gente che si è classificata in bronzo.","replies":[]},{"poster":"Don Draven","date":"2016-12-10T14:45:13.199+0000","up_votes":1,"down_votes":0,"body":"Apparte che loro non ne hanno motivo,sanno di ritornare alle posizioni perchè sono molto più forti del grosso di lol,in più chiaramente è raro trovare i bambini che devono trollare o gli irresponsabili che vanno afk e fidati che sicuramente è così perchè chi arriva a certi livelli ci va motivato a migliorare e non a trollare.","replies":[]}]},{"poster":"Akregor","date":"2016-12-09T18:01:08.702+0000","up_votes":1,"down_votes":0,"body":"Conta anche come giochi... Non solo quanto vinci :P certo che se fai 8 partite prendendo S e due prendendo A avrei probabilmente una posizione migliore che vincerne 10 prendendo C o B","replies":[{"poster":"Floppyz","date":"2016-12-10T20:30:01.596+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Akregor,realm=EUW,application-id=MJVj50Jw,discussion-id=ZuRJoYTT,comment-id=0008,timestamp=2016-12-09T18:01:08.702+0000)\n>\n> Conta anche come giochi... Non solo quanto vinci :P certo che se fai 8 partite prendendo S e due prendendo A avrei probabilmente una posizione migliore che vincerne 10 prendendo C o B\n\nNon mi risulta.\n\n\n\nP.S.\n\nÈ interessante vedere la somiglianza fra certi commenti di chi stava sopra il bronze e di chi stava in bronze... Solo, che se non ricordo male, ai secondi gli si rispondeva _sei dove meriti_. Senza polemica eh, è solo un'osservazione.","replies":[]}]},{"poster":"Nice Doggo","date":"2016-12-09T13:02:30.249+0000","up_votes":1,"down_votes":0,"body":"Io da s3 piazzato b5.. però continuo a giocare contro i silver boh","replies":[]},{"poster":"oroora6","date":"2016-12-08T23:04:59.251+0000","up_votes":1,"down_votes":0,"body":"non sono le vittorie a decidere la tua posizione, comunque dopo non ci sono più partite di piazzamento","replies":[]},{"poster":"TerrorVodka","date":"2016-12-08T23:01:00.706+0000","up_votes":1,"down_votes":0,"body":"la soloq non è buggata tranquillo","replies":[]},{"poster":"Rovonero","date":"2016-12-08T23:36:29.971+0000","up_votes":1,"down_votes":1,"body":"ok ma ho appena finito la prima partita da bronzo 3... e l'elo dei miei compagni e della squadra avversaria è di individui che si sono piazzati dal silver 3 al gold 5... cioè io devo riscalare dal bronzo 3 giocando contro gente che si è piazzata dal silver al gold ( ovvero elo plat)? fatemi gli auguri...","replies":[]},{"poster":"TerrorVodka","date":"2016-12-08T22:42:21.131+0000","up_votes":1,"down_votes":1,"body":"io ero plat  4, mi danno  silver 2 e volevo  mi mettessero bronzo 5\nnon si può avere tutto","replies":[{"poster":"Rovonero","date":"2016-12-08T22:49:44.918+0000","up_votes":1,"down_votes":1,"body":"ma la mia vera paura è che adesso gioco, risalgo di elo, e poi mettono ancora la singola partita di piazzamento buggata come hanno fatto con le flex in pre-season e me la prendo ancora in c.... ( scusa il francesismo)","replies":[]}]}]}