{"poster":"Legend Bard","date":"2016-12-10T12:31:17.550+0000","title":"Karma tank, dmg top","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Es ist ja wohl selbstverst&auml;ndlich das nicht jedes champion ein anderes champion countert. Doch Tanky Karma top lane kann man halt nicht countern, man &uuml;berlebt ja nicht einmal. Ich meine, ich habe mehrere Spiele von dia und platin Spielern angeschaut, die sogar mit vorteil nicht geschaft haben Karma 1 vs 1  zu t&ouml;ten{{champion:43}}","replies":[{"poster":"Nycaria","date":"2016-12-10T15:57:01.533+0000","up_votes":2,"down_votes":0,"body":"Karma heilt sich halt durch ihre Mantra-W extrem. Ich würde prinzipiell versuchen sie nicht zu töten, sondern einfach zu überleben und zu farmen.","replies":[]},{"poster":"OT Riku","date":"2016-12-10T12:50:16.571+0000","up_votes":1,"down_votes":0,"body":"Fiora könnte es gut mit ihr aufnehmen.\nZumindest denkt das ein S2 Spieler, kann aber auch anders laufen.","replies":[{"poster":"Maíko","date":"2016-12-12T08:57:29.109+0000","up_votes":1,"down_votes":0,"body":"Fiora hat den Vorteil, dass sie Karmas Heal bestrafen kann.\n\nSobald Karma versucht den W zu benutzen kann Fiora diesen kontern und sehr leicht ihren Burst-Schaden anbringen, während Karma gestunned ist und sich nicht Schilden kann.\n\nAuch macht Fiora sehr viel True-Dmg, was die Tankstats von Karma ziemlich unwirksam machen.","replies":[{"poster":"OT Riku","date":"2016-12-12T10:24:23.515+0000","up_votes":1,"down_votes":0,"body":"Guck mal bin ich doch nicht so schlecht.\nOkay ich bin auch der Meinung das ich ein gutes theoretisches Wissen habe.\nAber kann es halt nicht anwenden.","replies":[]}]}]},{"poster":"StillYasuoMain","date":"2016-12-11T01:37:03.005+0000","up_votes":1,"down_votes":0,"body":"Hab noch nie gegen sie gespielt aber als Yasuo würde ich mir {{item:3033}} rushen.","replies":[]},{"poster":"TIOlOlOlOIT","date":"2016-12-10T21:35:14.284+0000","up_votes":1,"down_votes":0,"body":"Gegen Tanks zu traden, insbesondere wenn sie sich auch noch heilen und schilden können, sollte man halt möglichst vermeiden. Eine persönliche Empfehlung gegen derartige Picks sind Maokai, Nautilus oder Galio mit Kommandobanner und Zz'Rot als first items. Sind sind sehr gut in der Lage Karmas Schaden zu kompensieren und haben auch noch dazu einen guten Waveclear.","replies":[]},{"poster":"Staatsanwalt","date":"2016-12-10T12:57:17.747+0000","up_votes":1,"down_votes":0,"body":"Ich hab das schon vor wochen gesagt. Aber da wurde ich nur ausgebuht. Bis sie mal selber gegen Tank Karma ran müssen :D","replies":[]}]}