{"poster":"Dodge12Valve","date":"2018-07-03T03:11:02.020+0000","title":"What can you consider toxic?","subforum":"Player Behavior","up_votes":1,"down_votes":0,"body":"Hello there fellow champions. Recently I&#039;ve had troubles keeping my mouth shut in game with dealing with you know you&#039;re typical bad day of deranking. So I did push my limit and i got a 14 day ban. So since then I&#039;ve been tilt proof and have not called anyone names or called them trash but something is bothering me. for the past couple games I&#039;ve been vocal about how were playing and ill say something like Khazix!!! check baron then he disagrees then i say you have ult come on dude! End of the game Report me im toxic? Should i be worried of an unfair perm ban against my account? I have not once called anyone a name or called them trash but it always seems to think im toxic for simply voicing my opinion in a civilized matter without just calling them some sort of derogatory term and calling them trash.","replies":[{"poster":"HavokDash","date":"2018-07-03T05:02:09.841+0000","up_votes":2,"down_votes":1,"body":"at this point words like \"Toxic\" \"Troll\" and \"Inting\" have been watered down so much that I realy dont know or care anymore. \nApparently to these children, if you tell them \"Hey, dont dive in 1v4\"...you are being toxic. \nIf you get CC'ed to a standstill, throw everything (even the brand new marble kitchen sink, what a waste), and STILL are unable to ecape a 4v1 (and lets face it, your teammate will just stand there staring at you waiting for cleanup). You are instantly labeled as \"Report X for Inting\"\n\nAnd If you even THINK of...well...lets face it, THINKING FOR YOURSELF (This includes having your own strategy, playstyle, build, or any individual thought that isnt pre-approved by the PRO, LCS Gods) is now considered \"Reported for trolling\" \nI am really getting sick of these egotistical little toddlers who weild the already broken report system like a weapon, threatening teammates with reports, calling for reports on teammates left right and center, and using it as a bludgeon to get everyone else to think like them. \n\nI really dont think it matters if you voice a disagreement. You are allowed to have your own opinions. You cannot be punished for simply being a shot-caller. But the mental age of the player base has been in a constant nosedive to the point where all thats left are egotistical toddlers convinced of thier own superiority, looking to label ANYTHING that isnt blatenly kissing their ass as toxic. (aka \"I think I am OP!, The best on the team!, a challenger smurf carrying a trash team. You think otherwise? OMG Ur being toxic, Reported, enjoy ur permaban\") <------I hate this egotistical narcissism that League has gotten drunk on. Confidence is fine, but this makes me want to punch the person in the teeth to knock them off that high horse they rode in on!","replies":[{"poster":"Dodge12Valve","date":"2018-07-03T22:44:35.516+0000","up_votes":2,"down_votes":0,"body":"I agree with you 100% I feel the word toxic has shifted to if you don't agree with someone right away you get reported. I admit i used to be actually toxic which is why i find when i talk in a civilized matter they still report me for toxicity. I don't know i just find it very frustrating when you are trying hard to be a non toxic player.","replies":[{"poster":"HavokDash","date":"2018-07-04T01:53:40.690+0000","up_votes":1,"down_votes":0,"body":"I mean Yes there are people who are BLATANTLY toxic and hateful, But people are so eager to \"Report\" so they can say \"enjoy ur ban\" that they will report anyone for the SLIGHTEST disagreement. ONE player wants to invade, but you dont want to? you think its risky?. That player will Now report you for TROLLING, and if you dare say \"Dont invade, its not worth it\" you get \"Muted and reported for toxic\"\n\nI was in a recent match and they said they were reporting me for \"No communication\" because I had opted to mute the team so I could focus on my own game, and on top  of that they threatened to report me for \"Not leashing\" which ISNT EVEN A REPORTABLE OFFENCE. \nLeashing at the start is a COURTESY, something you do out of respect for your team. \nI have lost all respect for my teammates due to this childish, tantrum-throwing behavior. So i dont leash. \nI have lost all respect for my teams in ranked, just as I have lost all respect for ranked itself. \nLeashing is a courtesy, NOT AN OBLIGATION. \nThey only seem to want to throw tantrums because the team wont coddle them and jump at thier every command.","replies":[]}]},{"poster":"SkullDuggery1919","date":"2018-07-04T01:27:01.301+0000","up_votes":1,"down_votes":0,"body":"This is the truth.  They have also given a few of these ultra-sensitive toddlers board moderation.  So anyone that complains on the boards, which is one of the purposes of the boards, instantly gets shot down by a very minute portion of the LoL community.  They have their head shoved so far up their asses that they've gotten used to the smell of shit.  \n\nDraconian language policies don't work.  Has the game gotten less toxic since they implemented any of their ridiculous policies?  No.  All you have now is people making a bunch of new accounts because they get banned for saying anything negative at all.  Maybe that's the real purpose of the policy, inflating numbers.","replies":[{"poster":"HavokDash","date":"2018-07-04T01:58:16.233+0000","up_votes":1,"down_votes":0,"body":"and Yet these same people are also quite prone to dismissing anyone who disrupts thier echo chamber. If you disrupt the group-think, they will scour your entire history (which is why I dont Play league on this account) and find ONE BAD GAME. \nThat ONE game where it was a 3v5 with an afk and an inter and you ended up going 0/8. They will use THAT game and basically say \"You went negative this game so you dont get to talk because \"mad cuz bad\". Ur just mad that u sukk at the game\" Or some preschool bullshit comeback like that. (oh so edgy, look at me shiver)\n\nSo they use one game to try and completely dismiss your point and invalidate anything you have to say, rather than actually coming back at you with something worth discussing. \"You had a bad game, so you dont get to speak\" \nthats their whole attack.","replies":[]}]}]},{"poster":"Phieldworker","date":"2018-07-03T03:50:00.536+0000","up_votes":2,"down_votes":0,"body":"I’m no too 100% sure but if it’s helps I give the best suggestions I can in games and never question people’s plays. JUst either suggestions like your baron one or “let’s focus so and so and we will be good” or an item suggestion like “we need griveuous wounds” and have not gotten a single warning if someone reports me. I think as long as you are adding input to lift up teammates or direct the team in Thebes best way possible you are good. I’ve been playing since 2014 and haven’t received a single report.","replies":[]},{"poster":"Sky Cardis","date":"2018-07-09T04:29:09.697+0000","up_votes":1,"down_votes":0,"body":"Toxic to me:\nHaving a one sided beat down (10-30), team is losing, its 20 mins in and most of your turrets are gone...they got the dragon and rift...and the team refuses to surrender turning a 20 minute beat down to a near 50+ min slog because the enemy team is so fed and want the S they won't finish the match thus you are being held hostage in the game...\nSince you will be banned if you leave the game OR reported for feeding...you are forced to deal with it...oh and IF its a 4 man team and you...very high chance they will mass report you anyway saying you were feeding/being toxic because you wanted the end the game early.\nNo one should be forced to going through a slog fest because you think you \"can turn this match around\".\n{{sticker:slayer-jinx-unamused}} \n\n\nTL;DR: Matches that got snowballed early and are forced into long match because surrender never goes through.","replies":[]},{"poster":"CharDeeMcDenniz","date":"2018-07-03T11:22:26.739+0000","up_votes":1,"down_votes":0,"body":"False reports will not count against you","replies":[]},{"poster":"Limmie","date":"2018-07-03T06:18:34.148+0000","up_votes":1,"down_votes":0,"body":"Just /mute all at the start of every game like I do. Anything you need to communicate can be done with pings.","replies":[{"poster":"HavokDash","date":"2018-07-03T07:15:33.844+0000","up_votes":1,"down_votes":0,"body":"I actually just got out of a game where I did that...and one of the players on my team said \"I am reporting you, for No communication (I pinged), No leash (Mid and supp were there, Leash is a courtesy..NOT AN OBLIGATION)\" \nRiot needs to get off thier ass in informing thier egotistical community that you cant report someone for not Jumping at your commands. \"You didnt do exactly as I say, when I say it, so I am reporting you! Hurrr\"","replies":[]}]}]}