{"poster":"DannyT","date":"2015-03-09T15:30:03.798+0000","title":"Rajzverseny – Indul a szavazás!","subforum":"Rajongói alkotások","up_votes":8,"down_votes":4,"body":"http://i.imgur.com/zV0BSsb.png\n\n##**Üdvözlet, Idézők!**\n\nTöbb mint egy hónap után eljött a nagy pillanat a magyar League of Legends rajzverseny történetében: a zsűri által gondosan kiválasztott legjobb tíz alkotást szavazásra bocsájtjuk. Ez azt jelenti, hogy sorsuk mostantól a ti kezetekben van.\n**Innentől a játékosok szavazatai döntik el, hogy melyik öt legjobb alkotás válik halhatatlanná**, azaz kerül fel a League of Legends hivatalos weboldalára a ***Közösség*** menüponton belül, a ***Rajongói alkotások***hoz, és ezek alkotói további nyereményekben részesülnek.\n**Mától egy hétig, azaz március 16-án éjfélig szavazhattok kedvenceitekre.**\nHa esetleg a rajzod nem jutott be a legjobb tíz közé, ne csüggedj! A verseny végén további szép rajzokat is közzéteszünk a fórumon.\n\nEgyelőre azonban jó nézelõdést és szavazást mindenkinek, és sok szerencsét kívánunk a résztvevőknek! :)\n\n**Felhívjuk a figyelmeteket, hogy NEM a zsűri pontozása alapján raktuk sorrendbe az alkotásokat!**\n\n##**A 10 LEGJOBB PÁLYAMŰ:**\n\n\n##**Hadúr** (EUNE) alkotása\n\nhttp://imgur.com/htE72f6.jpg\n\n##**goldmalboro** (EUNE) alkotása\n\nhttp://imgur.com/IYz5o4T.jpg\n\n##**Abinar** (EUNE) alkotása\n\nhttp://imgur.com/IJjBVi1.jpg\n\n##**vasajto** (EUNE) alkotása\n\nhttp://imgur.com/NPwzp1B.jpg\nhttp://imgur.com/i9CSPpr.jpg\nhttp://imgur.com/JqJxwet.jpg\n\n##**Erinell** (EUW) alkotása\n\nhttp://imgur.com/ViKfMO1.jpg\n\n##**solyom28** (EUNE) alkotása\n\nhttp://imgur.com/LMffW0d.jpg\n\n##**Csiperke** (EUNE) alkotása\n\nhttp://imgur.com/6S0dlVi.jpg\n\n##**Djarumviki** (EUNE) alkotása\n\nhttp://imgur.com/FPey8Tn.png\n\n##**Geony** (EUNE) alkotása\n\nhttp://imgur.com/HQFyDRe.jpg\n\n##**Jill Valentine** (EUNE) alkotása\n\nhttp://imgur.com/dFYRC5x.png\n\n\n**Ne feledjétek, hogy szavazatotokat miután leadtátok, visszavonni már nem lehet és egy játékfiókról csak egyszer, egy alkotásra lehet szavazni!**\n\nKérjük, vegyétek figyelembe, hogy a zsűri nem csak a kivitelezést vette figyelembe egy-egy alkotás értékelésénél. Sok más szempont alapján (pl.: maga a kép által keltett érzések, az ötletesség, stb.) is vizsgálta az alkotásokat!\n\nKöszönjük a beküldött rengeteg gyönyörű alkotást minden művésznek, a véleményeket pedig várjuk a kommentek között!","replies":[{"poster":"Dædalus","date":"2015-03-16T23:04:58.356+0000","up_votes":2,"down_votes":1,"body":"A szavazást ezennel lezárom, köszönjük mindenkinek a voksokat! A mostantól beérkező szavazatok nem érvényesek, a végeredményt pedig a hozzászóláshoz csatolva látjátok. A napokban érkezik a hivatalos hír, addig is gratulálunk a győzteseknek és köszönjük mindenkinek a részvételt!","replies":[]},{"poster":"PiciFree","date":"2015-03-10T06:59:55.074+0000","up_votes":3,"down_votes":0,"body":"Mindegyik nagyon szép, csak hiányzik belőle egy kis kreativitás. Szerintem Jill Valentine rajza a legötletesebb és kidolgozottabb, jóval eltér a többitől.","replies":[{"poster":"KakaStyle","date":"2015-03-10T15:47:46.670+0000","up_votes":2,"down_votes":1,"body":"Igen, tényleg ötletes és nagyon szép, de szerintem Csiperke (EUNE) alkotása a legötletesebb és a leg jobb is egyben. Abban kicsit több fantáziát látok én személy szerint. \n{{champion:254}}","replies":[{"poster":"Csiperke","date":"2015-03-10T22:22:03.289+0000","up_votes":1,"down_votes":1,"body":"Oh köszönöm :)","replies":[{"poster":"Gabor3","date":"2017-04-19T22:40:48.105+0000","up_votes":1,"down_votes":0,"body":"Szia Csiperke! Tudnál dobni nekem egy email címet? Szeretnék kérdezni valamit tőled. :)","replies":[]},{"poster":"sarkady00","date":"2015-03-11T07:44:00.229+0000","up_votes":1,"down_votes":0,"body":"mivel készítetted? hihetetlenül jó lett,  a többi se kutya de szerintem a tiéd a legjobb","replies":[{"poster":"Csiperke","date":"2015-03-13T19:35:21.303+0000","up_votes":1,"down_votes":0,"body":"Ps cs3. rajzpad.\nköszönöm :)","replies":[]}]}]},{"poster":"Ayame90","date":"2015-03-12T20:43:32.257+0000","up_votes":1,"down_votes":0,"body":"Hmm érdekes látásmód, nem nagyon értem(mivel két külön téma a kettő xd), de a te véleményed.","replies":[]}]}]},{"poster":"Wanda7","date":"2015-03-09T16:37:27.156+0000","up_votes":4,"down_votes":1,"body":"Szerintem Geony alkotása rendkívül ötletes és szép, én rá szavaztam, de nehéz döntés volt. \n {{champion:267}} {{champion:63}} {{champion:54}} {{champion:157}}","replies":[{"poster":"Geony","date":"2015-03-09T16:43:03.211+0000","up_votes":1,"down_votes":0,"body":"Köszönöm szépen! :)","replies":[{"poster":"Thadreas","date":"2015-03-09T16:49:33.992+0000","up_votes":1,"down_votes":0,"body":"BÁr a víz miért zöld? Annak nem a kék a színe?","replies":[{"poster":"Geony","date":"2015-03-09T17:17:34.991+0000","up_votes":2,"down_votes":0,"body":"Sokat változtatgattam rajta, de végül így volt a legmegfelelőbb a színeloszlás miatt. Meg nem egy helyen láttam már zöldesen árnyalni a vizet. :)","replies":[{"poster":"Thadreas","date":"2015-03-09T17:36:52.428+0000","up_votes":3,"down_votes":0,"body":"Dunában ?  :D\n\nKÖzépre mehetett volna egy mf mint az ötödik elem.  Ebből pedig megszülethetett volna a szurdok kapitánya aki..khm...taric. De szigorúan az ötödkori. :D \n\nEjj kihagyott ziccer :)","replies":[]}]}]}]},{"poster":"Thadreas","date":"2015-03-09T16:39:54.921+0000","up_votes":2,"down_votes":0,"body":"Almost captain planet?","replies":[]}]},{"poster":"Gergely757","date":"2015-03-13T18:52:24.245+0000","up_votes":2,"down_votes":1,"body":"Csiperke (EUNE)-re szavaztam. Szerintem övé a legötletesebb és még szép is!!","replies":[{"poster":"Csiperke","date":"2015-03-13T19:43:50.374+0000","up_votes":2,"down_votes":0,"body":"köszi a szavazatot :)","replies":[]}]},{"poster":"AproJoci","date":"2015-03-09T17:42:29.879+0000","up_votes":1,"down_votes":0,"body":"Mindenkinek gratulálok, minden rajzban van valami ami miatt megérdemli h nyerjen..Nehéz döntés.. Én Erinell és Csiperke között gondolkodtam.. nagyon tetszik rengar, szép részletes rajz.. lehet apróságnak tűnik de nekem hiányoznak a kezéről/kezéből a kések..\nMindkettő nagyon szép és sok munka lehetett bennük.. de Vi-t választom.. az a baba nagyon megfogott a lámpán..","replies":[{"poster":"Csiperke","date":"2015-03-10T22:48:46.103+0000","up_votes":2,"down_votes":0,"body":"Örülök hogy tetszik :)...utolsó pillanatban jött a baba és azért nem tudtam még finomítani amin még szándékoztam, de mondtam magamban, hogy ennek a deszka {{champion:222}} nek benne kell lennie :)","replies":[]},{"poster":"Thadreas","date":"2015-03-09T17:50:08.066+0000","up_votes":1,"down_votes":0,"body":"Érdekes , hogy Jinxet senki nem rajzolta le. PEdig abban van potenciál :D MInd komoly mind poén kategóriában.","replies":[{"poster":"NalamiHUN","date":"2015-03-09T18:35:30.231+0000","up_votes":1,"down_votes":0,"body":"Ott van Csiperke rajzában, nem látod azt az akasztott babát? XD","replies":[{"poster":"Thadreas","date":"2015-03-09T18:47:56.609+0000","up_votes":2,"down_votes":0,"body":"Ahha szóval Vi csak térkitöltőnek van a valódi hősnő Jinx. Best mű :)","replies":[]}]}]}]},{"poster":"SavageOmega","date":"2015-03-10T17:10:13.503+0000","up_votes":3,"down_votes":1,"body":"Az én kézzel rajzolt, színes ceruzás Braumnak öltözött Syndrám sajnos nem került be, pedig úgy gondoltam a farsangi \"X beöltözik Y-nak\" az jó ötlet (EUW-s nick alatt neveztem). xD Valahol biztos a megvalósítás nem stimmelt.\n\nNekem a legjobban Geony alkotása tetszett mert egyedi, részletes és nagyon kreatív. A négy elem megragadása jó alapötlet és a kivitelezés is szépre sikerült. Na meg Nami + Malphite örök kedvencek. :D \n\nGondolkoztam még Abinar alkotásán is, ami ugyanúgy szép részletes és színes ceruzával lett megalkotva. Nagy piros pont a befagyott Teemora, kár hogy nem oszthat az ember kétfelé szavazatot...","replies":[{"poster":"Geony","date":"2015-03-10T17:13:37.157+0000","up_votes":1,"down_votes":0,"body":"Köszönöm! :)","replies":[{"poster":"SavageOmega","date":"2015-03-10T17:25:01.639+0000","up_votes":2,"down_votes":0,"body":"Igazán nincs mit, sok sikert! :)","replies":[]}]}]},{"poster":"NorbertoHun55","date":"2015-03-10T15:31:22.874+0000","up_votes":2,"down_votes":0,"body":"Nagyon ügyesek vagytok!! De nem sértésképpen de valahogy nekem az Erinelé jobban tetszik!!\n{{champion:107}}  nagyon hasonlit az eredetire is! :D Hajrá győzzön a jobbik!{{summoner:14}}","replies":[{"poster":"Ayame90","date":"2015-03-12T20:45:10.735+0000","up_votes":1,"down_votes":0,"body":"Ha nem lennék versenyző, rá szavaztam volna, nagyon szépen kidolgozta!","replies":[]}]},{"poster":"Stark HUN","date":"2015-03-09T16:50:16.105+0000","up_votes":3,"down_votes":2,"body":"az a zyra eléggé travinak néz ki az arca alapján. :d","replies":[{"poster":"EgcElison","date":"2015-03-10T13:16:11.402+0000","up_votes":2,"down_votes":0,"body":"Nem bántás vagy ilyesmi de én azt hittem hogy az egy \"genderbend\" Zyra :D Egyébként jók lettek az alkotások, mao világítós festék megoldása ötletes, a szavazat pedig ment a hatodikra \"VI\". tetszik azáletképbe helyezett vasököl ;)","replies":[]}]},{"poster":"xiyoo26","date":"2015-03-10T11:32:52.374+0000","up_votes":3,"down_votes":1,"body":"Geony és vasajto-é  a két legjobb alkotás. Főleg a Maokai világító részei nagyon ötletesek. Remélem a kettőjük közül fog kikerülni a nyertes.^^{{summoner:30}}","replies":[{"poster":"SLAWTER","date":"2015-03-10T11:47:49.846+0000","up_votes":2,"down_votes":0,"body":"Az első 5 fog nyerni, szóval akár mindkét kedvenced érhet el helyezést :).","replies":[]}]},{"poster":"Violet Rose Moon","date":"2015-03-09T17:10:24.438+0000","up_votes":3,"down_votes":2,"body":"Hm... voltak nehéz percek, de végül Csiperke mellett döntöttem. Hogy miért? Mert együtt volt az ötletesség és és a szép kivitelezés. Illetve tudom, hogy nem létező személyek a LOL hősei, de én tényleg el tudom képzelni Vi-t, mintha ez az ő átlagos napja lenne.","replies":[{"poster":"Tuvesz","date":"2015-03-09T18:17:45.921+0000","up_votes":1,"down_votes":1,"body":"Szerintem is+Vi favorit champ és valahogy énis így képzelem el mindennapjait{{champion:254}}","replies":[{"poster":"lucky hunter2014","date":"2015-03-10T05:48:18.289+0000","up_votes":2,"down_votes":0,"body":"Én nekem is :D{{champion:254}} {{champion:254}} {{champion:254}} {{summoner:31}}","replies":[]}]}]},{"poster":"esfsy","date":"2015-03-09T19:30:53.440+0000","up_votes":2,"down_votes":0,"body":"Jill Valentine képe lett szerintem a leghangulatosabb, nagyon jól megfogja a steampunk érzést ;)","replies":[]},{"poster":"Kevin19970223","date":"2015-03-09T17:17:43.684+0000","up_votes":3,"down_votes":1,"body":"Egyedül Geony aki nagyon jol megoldotta.Gratulàlok! A többi is jò de azok nem fogtak meg annyira. Én is tudok rajzolni.. most màr bànom hogy nem küldtem be.. :S:D na majd feldobok ide egy képet ;)","replies":[{"poster":"Geony","date":"2015-03-09T17:24:57.348+0000","up_votes":1,"down_votes":0,"body":"Hát...nekem a többieké is tetszik, de köszönöm! :)","replies":[{"poster":"Thadreas","date":"2015-03-09T18:31:48.669+0000","up_votes":2,"down_votes":0,"body":"Tetszene ha malphite így nézne ki ingame.","replies":[]}]}]},{"poster":"New Dawn","date":"2015-03-09T16:07:17.493+0000","up_votes":2,"down_votes":0,"body":"Az osszes kép nagyon jó lett, de sajna nem szavazhattam az osszesre. :( Én Jill Valentine rajzára szavaztam azért, mert szeretem a Badass csajokat :D","replies":[]},{"poster":"frenkyzHU","date":"2015-03-09T16:47:47.693+0000","up_votes":3,"down_votes":1,"body":"Geony-ra szavaztam.Alias Vitya a suliból!:)))","replies":[]},{"poster":"ChaoSka","date":"2015-03-09T16:47:35.709+0000","up_votes":3,"down_votes":1,"body":"Genny rajza egyszerre gyengéd egyszerű de mégis nagyon szép gratulálok neki egyértelmű volt h öt választom első ránézésre megtetszett... Főleg h a kedvenc karim is benne van (malphite) gratulálok a többieknek is!!!! :-)","replies":[]},{"poster":"Shikaichi","date":"2015-03-09T16:08:36.263+0000","up_votes":3,"down_votes":1,"body":"Nehéz volt a döntés, mert őszintét megmondva képtelenség dönteni, mind szép és megérdemelné a szavazatot. Viszont muszáj volt csak egyet választani, így a választottam az ötletessége, részletessége és a kivitelezés miatt kapta a szavazatot. Tőlem Abinar kapott egy voksot. :)","replies":[]},{"poster":"Th3NoName","date":"2015-03-09T17:27:01.607+0000","up_votes":4,"down_votes":2,"body":"Ha már az én Zedes rajzom nem került be, akkor vasajto Maokai-ja nyerjen. Nagyon ötletes, hogy a sötétben is világít a szája! :)\nNagyon jó munka lett, gratulálok!{{champion:57}} \nRemélem nyersz!","replies":[]},{"poster":"Kelori","date":"2015-03-09T16:18:49.926+0000","up_votes":4,"down_votes":2,"body":"Solyom28 és Geony alkotása között nem tudok dönteni :D Nagyon szépek.","replies":[]},{"poster":"Larixx","date":"2015-03-10T08:19:18.197+0000","up_votes":3,"down_votes":2,"body":"Szerintem Geony volt a legötletesebb,és nála legalább látni,hogy rajz! Nem valami képszerkesztő...Igazi tehetség :)","replies":[{"poster":"Pacsirta HU","date":"2015-03-10T09:13:16.737+0000","up_votes":3,"down_votes":2,"body":"Ha a hülyeség fájna... Ugye tudod, hogy  a számítógép nem rajzol helyetted? Nincs gomb a rajzprogramban, ami a firkálmányból kész rajzot csinál, a művésznek kell megrajzolnia mindent, ugyanúgy, mintha ceruzával vagy festékkel dolgozna.","replies":[]}]},{"poster":"ZuNGi       HUN","date":"2015-03-09T18:07:51.832+0000","up_votes":3,"down_votes":2,"body":"******Szerintem vasajtó {{champion:57}}   nagyon brutálett és a világító festék nagyon ütős !!!! :D","replies":[]},{"poster":"samibali","date":"2015-03-11T10:10:58.837+0000","up_votes":2,"down_votes":1,"body":"én azért szavaztam  Geony (EUNE) alkotására mert fantáziát látok értékelem a nehézségeit a rajzokban a kék helyett zöld abban lehet kcisit tévedett de ezen kívül szerintem nagyon ötletes és jó rajz lett szerintem nagyon kreatív. nehéz döntés volt ezt tenni mert mindegyik rajznak megvan a saját mondani valója és fantáziája.","replies":[]},{"poster":"Galvin Flintmage","date":"2015-03-10T20:24:00.761+0000","up_votes":2,"down_votes":1,"body":"Nekem Jeony {{champion:267}} {{champion:63}} {{champion:157}} {{champion:54}}  , solyom28 {{champion:80}}  , és vasajto {{champion:57}} alkotása tetszett legjobban, de ettől függetlenül mindegyik nagyon jó. \nJeony: Tetszett, hogy a négy elem mellett mintha 4 hangulat is megjelent volna (düh, nyugalom stb.)\nSolyom28: Nagyon tetszik a háttérkép, mintha egy régi lapon lévő kép lenne. Az arca mintha egy picit elcsúszott volna, bár az én alkotásaimhoz képest az is tökéletes (én alkotásom 1-10-es skálán körülbelül -1)\nVasajto: Nem tudom mi tetszik benne, csak szimplán tetszik. (erre is szavaztam)\n\nKülön tetszik mindhárom képnél, hogy nem photoshoppal készült. Ahogy nézem a szavazatokat, ez a három kép bent is marad az első 5 között.","replies":[]},{"poster":"hercegb612","date":"2015-03-09T22:24:23.337+0000","up_votes":2,"down_votes":3,"body":"Szomorú, hogy ezek a legjobbak. Jöhet, a 'Terajzoljjobbat' beszólás. De mégis!  Hol az arcok borzalmasak, hol az arányok csúsznak el, hol tökéletes a technika, de a téma unalom.\n\n\nJézus, 1. Hadúr (EUNE) alkotása : itt hogy néz ki a hősnőnk feje.{{champion:89}} \n2. goldmalboro (EUNE) alkotása : Az a fej egy túlmaszkolt travi feje.{{champion:143}} \n3. Abinar (EUNE) alkotása: kezdetnek jó!{{champion:127}} \n4. vasajto (EUNE) alkotása: ez aranyos.{{champion:57}} \n5. Erinell (EUW) alkotása: szerintem itt a ráfordított idő = a többire fordítottal összesen. Kidolgozott, részletgazdag. De nagyon unalmas a kép. Az alkotó ügyes, a legügyesebb mind közül, de jobb téma választás kellene, dinamika bármi. AMitől megmarad a kép.{{champion:107}} \n6. solyom28 (EUNE) alkotása: Szép munka. Erre is szavaztam volna, Rézkarc, ezt csak később vettem észre, erre kellett volna.  Egyszerű és tökéletes.{{champion:80}} \n7. Csiperke (EUNE) alkotása: Szegény Vi arca. Ha nem megy az arc, ne rajzoljatok. A téma jó, az arc miatt viszont nem jött be. De ha az jó lett volna...{{champion:254}} \n8.Djarumviki (EUNE) alkotása: Nincs vele gond, de nem ad semmit. Kidolgozott, szép kép, de semmi extra.{{champion:55}} \n9. Geony (EUNE) alkotása: Az arányok néhol elcsúsznak. A szín és a karakter választása tökéletes. Egész jó.{{champion:157}} \n10. Jill Valentine (EUNE) alkotása: Ez a kép jó lenne, nagyon is. Komolyan kitakarom itt is az arcot, és kedvenc lesz... ARC. Félek így.{{champion:51}}","replies":[{"poster":"Thadreas","date":"2015-03-09T22:50:15.542+0000","up_votes":2,"down_votes":1,"body":"> Jöhet, a 'Terajzoljjobbat' beszólás\n\nSzerintem ez így rendben van. Aki elküldi a rajzait számítson rá, hogy kritikát fog kapni. \nÉs amíg az ember megindokolja mi nem tetszik neki , min kéne változtatni szerinte ( kulturált formában), az már egy egész hasznos építő jellegű kritika miből lehet tanulni.\n\nSajnos nem szeretjük ha valakinek nem tetszik amit csinálunk, de ha mindig csak dicséretet kapunk akkor nem fog semmi ösztönözni a fejlődésre.\nTény, hogy a kritikáktól függetlenül minden műnek őrölünk akár bekerült a top 10-be akár nem, és köszönjük a ráfordított erőt/ időt hiszen lényegébe nekünk csináltátok.( Na jó biztos valaki csak a skinért)\n\n\nGondoltam ezt igy hirtelen megosztom mielőtt tényleg jönnének a 'Terajzoljjobbat' beszólások.","replies":[]}]}]}