{"poster":"ToxicTeemoPolice","date":"2017-03-09T18:12:05.744+0000","title":"Bitte Erklärung warum ich kein S bekommen habe.","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":10,"body":"http://prntscr.com/ehyb96","replies":[{"poster":"kuchenbro","date":"2017-03-09T18:32:11.919+0000","up_votes":4,"down_votes":0,"body":"Durch die 7 Tode hat es sich wieder zu einer 3.57 KDA ausgeglichen, was nicht wirklich besonders ist und deswegen reicht es nicht fürs S^^","replies":[]},{"poster":"Skenziih","date":"2017-03-09T18:59:13.497+0000","up_votes":1,"down_votes":0,"body":"Viel wichtiger finde ich diesen überragenden Zilean \"Support\" Build","replies":[{"poster":"BigSnipe","date":"2017-03-13T03:14:18.719+0000","up_votes":1,"down_votes":0,"body":"Nirgendwo steht gerschrieben, dass der Support für wards zuständig ist!","replies":[{"poster":"CYPHΕR","date":"2017-03-13T12:09:27.007+0000","up_votes":1,"down_votes":0,"body":"Natürlich, aber den TE interessiert eine gute Bewertung im Bewertungssystem. Dieses Bewertungssystem richtet sich nunmal ganz grob gesagt danach, wie sehr du deinen Teil zum Sieg beigetragen hast. Da der Support nunmal als Rolle am besten dafür geeignet ist Vision aufzubauen wird er auch daran bemessen.","replies":[]}]},{"poster":"OT Riku","date":"2017-03-10T10:29:29.571+0000","up_votes":1,"down_votes":0,"body":"Es ist doch überall bekannt das Wards keinen schaden machen und deshalb nutzlos sind \n{{champion:17}}","replies":[]}]},{"poster":"CYPHΕR","date":"2017-03-10T08:30:36.496+0000","up_votes":1,"down_votes":0,"body":"Wenn du schon einen Screenshot machst, dann schau bitte auch, dass alle Relevanten Infos darin vorkommen.\n\nZum Bild selber:\n7 Tode sind mind. 2 zu viel.\n\nErgänzend zum Bild:\n6.6 CS/Min -> mit diesen CS bekommst du selbst bei der Besten KDA kein S\n\nDas sind zuminest zwei kritische Faktoren die man alleine an den Postgamestats ablesen kann die fast schon garantieren, dass man kein S bekommen kann. Wie es mit Roamingverhalten etc aussieht kann ich so jetzt nicht analysieren.","replies":[]},{"poster":"Angel Ayume","date":"2017-03-09T20:24:38.187+0000","up_votes":1,"down_votes":0,"body":"Also ich bin Ahri Main, und du musst schon mehr machen als diese Stats um ein glattes S zu bekommen. Diese KDA reicht bei weitem nicht aus. Sorry :/ \nMeine Stats sind teilweise besser und ich bekomme kein S. Allerdings habe ich auch schon sehr häufig ein S bekommen um es beurteilen zu können. \n\nDu darfst aber nicht vergessen, dass nicht nur die KDA und der Farm in die Wertung mit einbezogen werden. Auch der Dmg, das Gold pro Minute, die Beteiligung an Objectives zum Beispiel spielen alle eine Rolle bei der Bewertung.","replies":[]},{"poster":"Timethief49","date":"2017-03-09T19:07:16.985+0000","up_votes":1,"down_votes":0,"body":"nur ne gedanke hab keine ahnung ob des was ändert, aber vielleicht weils ein loss war","replies":[]},{"poster":"Shakês Beer","date":"2017-03-09T18:13:29.756+0000","up_votes":1,"down_votes":1,"body":"7 Tode. \nAuch wenn ich das etwas sehr krass finde...","replies":[]}]}