{"poster":"Sneakster13","date":"2017-11-25T01:44:27.373+0000","title":"Pretty low FPS recently on good PC? Anyone else have this? Pls help ):","subforum":"[ARCHIVED] Help & Support","up_votes":4,"down_votes":0,"body":"Hi people, so I've noticed recently that my FPS throughout the game is a LOT lower than it was 2 months ago. I'm not sure why. Would it be because of the season 8 update? I wouldn't think so as in the most recent patch in the \"bug fixes\" section they claimed to have fixed it. I would be greatful for any tips, and please don't give me the same old recycled methods as I've tried pretty much all of them. \r\nMy FPS before: \r\n\r\n\r\nBeginning in shop : 350 fps\r\nIn lane: 140-200\r\nlate game teamfights : 95 - 140\r\n\r\n\r\nMy FPS now:\r\nBeginning in shop: 200 fps\r\nIn lane: 90 - 130\r\nlate game teamfights : 50 - 90\r\n\r\nSpecs:\r\nIntel core i5 6500 @ 3.20\r\nGeforce GTX 1060 3gb \r\n8gb RAM\r\n\r\nStuff I have tried:\r\nResetting all overclocks, and overclocking CPU and GPU.\r\nTurning down settings. (barely does anything)\r\nDowngrading and upgrading graphics drivers (Back then sometimes when I downgraded my graphics driver my fps would be higher)\r\nLow resolution map skin\r\nTweaking windows 10 options (eg. high power, advanced system settings, unparking cores)\r\nclosing background programs\r\npls save me\r\n\r\nthanks and byeeeeee.","replies":[{"poster":"Porocles","date":"2017-11-25T17:17:16.775+0000","up_votes":1,"down_votes":0,"body":"Heya, try capping your framerate via in-game video options.  This could fix things up as well as the other steps in our [high spec PC guide](https://support.riotgames.com/hc/en-us/articles/209010626-Frame-Skipping-on-High-End-PCs).  Let me know if that helps, and we can go from there.","replies":[{"poster":"Sneakster13","date":"2017-11-25T18:15:20.957+0000","up_votes":1,"down_votes":0,"body":"Hi, thanks for your reply, although I have tried this. While it does seem to stay at 60, it seems more choppy than if i didn't cap it. \n\nbtw my fps is not that high so it drops under 60 at times","replies":[{"poster":"Porocles","date":"2017-11-25T18:54:47.357+0000","up_votes":1,"down_votes":0,"body":"Heya, no worries, I created a ticket for you so our tech team can take a closer look with you.  Your ticket number is 32758364!\n\nWhen you get a chance, attach some logs via [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) to give our team some more context.  We'll get back to you as soon as we can!","replies":[{"poster":"Sneakster13","date":"2017-11-25T22:06:50.664+0000","up_votes":1,"down_votes":0,"body":"Hey, thanks for your speedy reply. I have gotten the logs and I was wondering where I should attach them as I am not able to here. Thanks.","replies":[{"poster":"Porocles","date":"2017-11-25T22:24:12.655+0000","up_votes":1,"down_votes":0,"body":"Heya, you should be able to login to the ticket center -[My Tickets at the top](https://support.riotgames.com/hc/en-us/requests/new))-, select your ticket, and attach the files there!","replies":[{"poster":"Sneakster13","date":"2017-11-26T13:34:45.374+0000","up_votes":1,"down_votes":0,"body":"Hey sorry, I hate being a huge burden but every time I click on the ticket you opened for me it simply goes blank with nothing there. :/\n\nI see it: https://gyazo.com/eece44e8bd70595d85a399621ae25488\n\nWhen I click it: https://gyazo.com/b5b53df0072b5f62b4ea2675d9aa90fc\n\nI tried all my different browsers, and all my other old tickets seem to open.","replies":[{"poster":"Porocles","date":"2017-11-29T16:16:38.846+0000","up_votes":1,"down_votes":0,"body":"Hey there, it looks like a tech specialist was able to reach out to you.  Is everything okay now?","replies":[]}]}]}]}]}]}]},{"poster":"VaJhina","date":"2017-11-25T06:39:20.273+0000","up_votes":3,"down_votes":0,"body":"Same here, I literally reinstalled Windows two different times to make sure it wasn't on my end. But it's been driving me insane and (no offence) but I'm sort of glad others are having a problem because it's restoring faith for me. I use to run 400+ FPS (not that I need it, I cap at 60) on my GTX 970 and i7 4790k with 16g Ram, but now I am chopping randomly and in teamfights I may as well not even play because it goes down to 20's FPS. I also notice as the game goes LONGER, the more problems I have. ","replies":[{"poster":"Sneakster13","date":"2017-11-25T16:37:10.901+0000","up_votes":1,"down_votes":0,"body":"yeah same. The longer the game the more lag I end up getting. I'm also honestly glad that others are also having the problem.\n\nHopefully they fix this...","replies":[]}]},{"poster":"Rouge Pwmamon","date":"2017-11-25T03:37:09.194+0000","up_votes":2,"down_votes":0,"body":"Same i run it on max settings 300+ frames but mid game It justed droped to 5 locked at 5 i lowed it to minimum and also did a full repair and also i reinstalled it Plz riot if you are reading this plz fix","replies":[]},{"poster":"Trèvor","date":"2017-11-25T05:45:55.790+0000","up_votes":1,"down_votes":0,"body":"Did all of you ever get a windows update before this started happening?","replies":[{"poster":"Sneakster13","date":"2017-11-26T13:30:16.967+0000","up_votes":1,"down_votes":0,"body":"Yes possibly, I upgraded to the creators update. I tried to go back down, but I cant. I even got windows ISO's for earlier  versions for windows 10 and windows 7 but they wont work. I'm stuck here","replies":[]}]},{"poster":"swishy","date":"2017-11-25T05:43:45.159+0000","up_votes":1,"down_votes":0,"body":"I have the exact same issue. 150-250 FPS first 5-10 minutes and I am lucky to have above 60 in team fights past 30 minutes. Playing on lowest settings on a 1050 Ti.","replies":[]},{"poster":"Trèvor","date":"2017-11-25T02:13:25.560+0000","up_votes":1,"down_votes":0,"body":"Yes many people are having this problem and riot won't tell us anything lol.","replies":[]}]}