{"poster":"You Tried","date":"2016-04-04T11:05:19.188+0000","title":"How do i earn key fragments?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"_Earn keys as rewards for winning any matchmade games or by purchasing them at the store for 125 RP. Keys unlock chests through Hextech Crafting_. I have won tons of matchmade games and haven&#039;t gotten a key :(","replies":[{"poster":"HeXaHoLiC007","date":"2016-04-04T12:47:18.138+0000","up_votes":1,"down_votes":1,"body":"Hextech is a scam from Riot, they want you to spend money/RP on Keys. Riot are worse than Blizzard when it comes to trying to nickle and dime you at every corner. Even skins are a utter rip off, 10-25$ for a skin IS TOO DAMN MUCH. I could afford them but i don't feel like they are worth that much. Also champs cost way too much IP / RP, this game is set up to try and empty peoples pockets.\n\nWhat is so different with Hextech than say going to a casino ? It's basically the same thing since you're taking a gamble on the unknown. Might have to report this since Hextech is a form of gambling if you buy keys / chests from the store.","replies":[{"poster":"warzolo99","date":"2016-04-04T16:51:25.120+0000","up_votes":2,"down_votes":1,"body":"ok first of all you can buy multiple skins for even $5... soooooo...... yeah..\nsecond of all if they are worse than blizz then why is there game still technically free to play? its up to the player if they want to have extra aesthetics added to their gaming experience. if you have problems saving ip for a champ then i dont think you play the game enough to talk this much shit about it.","replies":[{"poster":"tajbb","date":"2016-06-25T23:37:58.383+0000","up_votes":1,"down_votes":0,"body":"same here. BUT it is kind o harad to get keys....\n I play like say from 11 am - 3am and I don't get keys a lot rarely actually ( its summer )","replies":[{"poster":"Oppsyourdead","date":"2016-07-08T16:21:57.860+0000","up_votes":1,"down_votes":0,"body":"You can get key frags from playing different champions that u haven't played lately I think.","replies":[]}]}]},{"poster":"DarthMeliodas","date":"2017-11-23T07:01:51.407+0000","up_votes":1,"down_votes":0,"body":"It really isn't a scam... the game is free to play but for those of us who are looking for more options and maybe even doing a little gambling it is amazing !... I personally love the excitement from getting a gemstone to drop or getting a 1820 rp skin to drop without paying nearly as much which happens a lot for me :D all in all I love it!{{champion:122}}","replies":[]},{"poster":"Oppsyourdead","date":"2016-07-08T16:21:16.493+0000","up_votes":1,"down_votes":0,"body":"Hextech is a scam from riot? It really isn't If you are gaining key fragments and chests. Riot is trying to give back to the community with free chests and key frags. They only buy it if they want to, not because riot Is a huge dick and making people buy them. Blizzard involves MMO RPG games dude, those are for expantions for some games as Diablo, Hearthstone, StarCraft, ETC. The only thing they made is chests for Overwatch. LoL champions are the perfect price because you earned the IP to get the champ and looking forward to getting something in return of playing. \"This game is set up to try and empty peoples pockets\". Its a free game man, like I said earlier, u choose to buy RP. You don't have 2 at all. Hextech Is pretty much the point of re-rolling.","replies":[]}]},{"poster":"warzolo99","date":"2016-04-04T16:54:23.401+0000","up_votes":1,"down_votes":0,"body":"you can get a key from any summoners rift queue as long as it is not a custom game. from my knowledge and experiences nothing drops them more often even getting S+ (i got like 4 S+ in a row and got no key fragments but i got 3 C's in a row and got 3 key fragments...)\nkinda annoying but they just come with lots of playing i guess.\nmight also be a limit on how many you can get a week but riot hasn't shown it.","replies":[]}]}