{"poster":"rainy day v2","date":"2019-07-19T16:04:54.481+0000","title":"Aatrox ! A .. What?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Halloo,\r\nauf dem neuen Patch hab ich bisher noch keinen Aatrox als pick oder ban gesehen (außer einen der geinted hat), was ich ziemlich schade finde, weil ich ihn vorher selber gerne gespielt hab. Zugegeben, er hat sich vorher in vielen Szenarios zu stark angefühlt und das vom early bis zum late game, also er ist eig nie wirklich schwach gewesen, aber jetzt fühlt er sich deutlich schlechter an.\r\nNun hätte ich eine Idee wo diese neue Schildbrechermechanik raus kam, dass auch eher so etwas bekommen könnte.\r\n\r\nUnd zwar gibt es da ja mehrere Möglichkeiten wo man diese drauftun könnte:\r\n1. Während R (1.1) auf der Passiven\r\n(1.2) auf den Q-Edges\r\n2. Ohne R auf der Passiven (evtl dann Schildbrechend, aber kein DMG)\r\n3. Während R mehr Schaden an Schilden\r\n\r\nMir persönlich würde 1.2 am Besten gefallen, weil bei 1.1 und 2 ist es einfach zu Random und eig hat man darauf kein Counterplay und 3 .. könnte zu stark sein, kommt dann auf die Zahlen an.\r\nWie fändet ihr so eine Änderung?\r\n\r\nLG","replies":[{"poster":"SuicidePlank","date":"2019-07-19T16:12:19.398+0000","up_votes":2,"down_votes":0,"body":"Nein, er ist komplett fine und sollte nicht weiter gebufft werden.","replies":[]},{"poster":"Electrobert","date":"2019-07-21T06:05:22.848+0000","up_votes":1,"down_votes":0,"body":"Du musst bedenken, dass Aatroxs revive nur in in seinem kit geblieben ist, damit der champ nicht seine \"Identität durch das Rework verliert\" und Fans nicht steil gehen.\n\nSpieltechnisch hatte der revive da nie etwas zu suchen und war viel zu mächtig, sodass einmal in Fahrt gekommen Aatrox buchstäblich unstoppable gewesen ist und for free diven konnte.\n\nWieder mehr power im Rahmen einer Shieldbreakermechanic in sein Kit zu bringen macht keinen Sinn und müsste nerfs in seinem bisherigen kit mit sich bringen.\n\nZur Zeit \"inten\" vermutlich einige Aatroxspieler, weil sie sich noch an den fehlenden revive gewöhnt haben.\n\nSo wie er jetzt in 9.14 ist, ist er immer noch super stark und mehr als nur spielbar.","replies":[]}]}