{"poster":"GitGudOrDie","date":"2017-11-13T12:15:35.516+0000","title":"IDEE zur Verbesserung des Lvling Systems und Belohnungen","subforum":"Client Diskussion","up_votes":1,"down_votes":0,"body":"Zu den Worlds gab es ja Missionen die fand ich Pers&ouml;nlich richtig gut ;)\r\n\r\n\r\nMeine Idee ist es:\r\n\r\nJeden Tag bekommt man 1 Mission(zus&auml;tzlich zum Win of the Day) (max. 3 Missionen Sammelbar) man kann dabei w&auml;hlen ob man eine Kurze Mission will (gut f&uuml;r leute die nicht viel Spielen bzw. nicht k&ouml;nnen) Mittel (1~ Woche) (Diese erfordern mehr Spielzeit und sind f&uuml;r wenig spieler machbar aber evtl. nur ganz knapp) und Lange (Diese Dauern 1 Monat bis sie ablaufen erfordern sehr viel spielzeit aber geben auch sehr gute belohnungen... \r\n\r\nbzw kann man es auch so machen das jeder immer eine lange, mittlere und kurze laufen hat\r\n\r\nKurz: Gewinne 5 Runden in einem Matchmade game (auch Bot Games) (Belohnung: 1 Basic Champions Capsule)\r\nSpiele 3 Runden mit mindestens einem Premade Partner (auch Bot Games)\r\nPlatziere 10 Wards in einer Runde\r\nNutze 10 Ultimates\r\nErreiche 10Kills/Assists\r\nDu oder dein Team m&uuml;ssen 3 Drachen erledigen\r\n\r\nMittel: Gewinne 15 PvP Matchmade Games (Belohnung : 2 Basic Champion Capsules)\r\nPlatziere 50 Wards\r\nSpiele 9 Runden mit min. 1 Premade Partner(nur PvP)\r\nNutze 50 Ultimates\r\nErreiche 70Kills/Assists\r\nDu oder dein Team m&uuml;ssen 9 Drachen erledigen\r\nDu oder dein Team m&uuml;ssen 3 Baron Nashor erledigen\r\n\r\nLang: Gewinne 50 PvP Matchmade games (Belohnung: 4 Basic Champions Capules)\r\nPlatziere 200 Wards\r\nSpiele 30 Runden mit min. 1 Premade\r\nNutze 250 Ultimates\r\nErreiche 300Kills/Assists\r\nDu oder dein Team m&uuml;ssen 50 Drachen erledigen\r\nDu oder dein Team m&uuml;ssen 15 Barons Nashor erledigen\r\nDu oder dein Team m&uuml;ssen 20 Rift Heralds erledigen\r\n\r\n\r\nUnd an Samstagen gibt es eine Besondere Daylie  wo man 1 Basic champion capsule bekommt aber auch 1 hextech chest so das auch leute die nicht S erreichen aber ehrenhaft sind dennoch die keys nutzen k&ouml;nnen ;) bzw eine hextech chest^^^die misson k&ouml;nnte auch extra zu den 3 laufen^^ und nur f&uuml;r leute die eben Honor 3 oder 4 sind","replies":[{"poster":"Megamaexx","date":"2017-11-13T14:51:06.638+0000","up_votes":1,"down_votes":0,"body":"Da wird Riot nicht mitmachen. Momentan ist es so ausgelegt, dass man 1 level up für eine capsule benötigt. Bekommt man jeden Tag eine, wäre das etwas inflationär.\nWenn du jetzt damit kommst, dass man damals mehr IP als BE erhalten hat (von 1-30), dann kommt als Gegenargument, dass das nicht stimmt und man sogar mehr erhält. Das wurde nämlich bereits ausgerechnet.\nMit dem nächsten Patch soll auch zu dem daily win ein paar BE dazukommen.\n\nÜbrigens würde ich als Spieler, der nicht viel Zeit hat, nie die 5 Siege Mission nehmen, da das einfach viel zu lange dauert. 10 Wards bekomme ich recht schnell in einem Spiel zusammen, 10 Ultis ist bei vielen Champions auch kein Problem. 10 Kills/Assists sollte auch in einem Spiel erledigt sein.","replies":[{"poster":"GitGudOrDie","date":"2017-11-14T05:42:47.151+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=s8lTaxuH,discussion-id=5XEvtwXi,comment-id=0001,timestamp=2017-11-13T14:51:06.638+0000)\n>\n> Da wird Riot nicht mitmachen. Momentan ist es so ausgelegt, dass man 1 level up für eine capsule benötigt. Bekommt man jeden Tag eine, wäre das etwas inflationär.\n> Wenn du jetzt damit kommst, dass man damals mehr IP als BE erhalten hat (von 1-30), dann kommt als Gegenargument, dass das nicht stimmt und man sogar mehr erhält. Das wurde nämlich bereits ausgerechnet.\n> Mit dem nächsten Patch soll auch zu dem daily win ein paar BE dazukommen.\n> \n> Übrigens würde ich als Spieler, der nicht viel Zeit hat, nie die 5 Siege Mission nehmen, da das einfach viel zu lange dauert. 10 Wards bekomme ich recht schnell in einem Spiel zusammen, 10 Ultis ist bei vielen Champions auch kein Problem. 10 Kills/Assists sollte auch in einem Spiel erledigt sein.\n\njoa man könnte auch exp geben bzw^^ und 3 missionen am tag also 1500XP am tag möglich^^ manche sind einfach und brauchen nur eine runde andere etwas schwerer und benötigen eventuell etwas mehr^^ und riot könnte zb. reroll tokens machen für die missionen für jede gemachte mission bekommt man 1 und man kann insgesamt 3 zusammen sparen die missionen halten so lange bis sie gemacht sind und neue kommen immer alle 24 h dazu und es laden insgesamt 9 missionen auf also wenn man 3 tage nicht spielt dann hat man 9 missionen auf lager jedoch sind immer nur 3 gleichzeitig aktiv also kommen diese dann nacheinander rein bis man eben alle 9 gemacht hat dann muss man 24h warten wenn man 9 voll hat muss man alle 9 gemacht haben das es erneut missionen gibt^^\n\ndas sollte dann casuals sowohl als auch langzeit spieler ein besseres loot gefühl verschaffen^^\n\neine möglichkeit wäre auch noch das man BE wetten könnte^^ zb man ist in einer runde jeder kann zu beginn 100 BE wetten (nur matchmade games) also jedes team maximal 500 vom gewinner team bekommt jeder dann 100BE ^^ wenn aber zb nur 2 im blauen und 1 im roten team wetten so zahlt jeder vom blauen 50 der vom roten 100 gewinnt blau bekommt jeder der wettenden 50BE bei rot bekommt dieser eine 100 BE (maximal kann man 1000BE am tag so gewinnen)","replies":[]}]},{"poster":"Allerbester Biss","date":"2017-11-13T13:38:00.122+0000","up_votes":1,"down_votes":0,"body":"Find ich nicht gut!\nIch mach 30 „kurze“ Missionen und bekomme mehr als für eine Lange?\nWo ist der Sinn?","replies":[{"poster":"GitGudOrDie","date":"2017-11-13T14:21:02.437+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Allerbester Boss,realm=EUW,application-id=s8lTaxuH,discussion-id=5XEvtwXi,comment-id=0000,timestamp=2017-11-13T13:38:00.122+0000)\n>\n> Find ich nicht gut!\n> Ich mach 30 „kurze“ Missionen und bekomme mehr als für eine Lange?\n> Wo ist der Sinn?\n\nwie gesagt es könnte auch so sein das man immer eine lange eine mittlere und eine kurze hat wer alle macht bekommt somit am meisten aber einer mit wenig zeit steht auch nicht leer da^^ sprich man bekommt 30 durch die kurzen im monat 6 durch die mittleren und 4 durch die langen bzw könnte man neue capseln machen die speziell hohe tiers belohnen ^^ bzw könnte man auch EXP geben ... und es muss ja nicht so sein das man wenn man das monatlich macht extrem viel bekommt.... denn das würde dann so viel werden das es zu krass wäre oder es würde so sein das die kurzen dann kaum was bringen^^ aber lieber so als wie nur fwotd und dann normale exp","replies":[]}]}]}