{"poster":"Just1Time3","date":"2015-05-09T15:38:49.405+0000","title":"Suche Erklärung","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":3,"body":"Hey Leute, \r\nHab in letzter Zeit echt wieder Lust auf LoL bekommen deswegen hab ich mir nen Kollegen zum quatschen geschnappt  und einfach einige Normals gemacht. Allerdings verflog die Lust echt schnell und zwar wegen dem Matchmaking. Ich war vor meiner LoL pause in der Gold 1 Promo und hatte ne recht normale mmr, aber jetzt hab ich nur noch gestompe was ziemlich langweilig und frustrierend sein kann. Und ja ich wei&szlig;, dass es einen Unterschied zwischen Ranked und Normal Matchmaking gibt, aber so was wie Unranked gegen 3 Diamond ist finde ich ein bisschen zu viel. Hat irgendwer eine Ahnung warum das so ist oder wie ich mein Problem l&ouml;sen kann?\r\nSchon mal Danke an alle die Antworten :D","replies":[{"poster":"Taloz","date":"2015-05-09T15:50:32.185+0000","up_votes":4,"down_votes":1,"body":"Ja, setz dich mit dem Thema Matchmaking und MMR auseinander.","replies":[]},{"poster":"Danny89","date":"2015-05-09T16:52:53.992+0000","up_votes":2,"down_votes":0,"body":"Normal MMR und Ranked MMR sind völlig voneinander getrennt.\n\nDie Berechnung folgt von daher unabhängig.\n\nWie die Berechnug aussieht, findest du im Detail hier: http://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/IqBzFyO9-der-informationsthread-aber-ligen-mmr-und-hidden-elo","replies":[{"poster":"Just1Time3","date":"2015-05-09T17:26:09.996+0000","up_votes":2,"down_votes":3,"body":"Aber Diamond gegen Unranked??? Wieso wird man nicht einfach mit Leuten mit ungefähr der eigenen Elo gematcht.....","replies":[{"poster":"HyperionCH","date":"2015-05-09T17:51:56.208+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Just1Time3,realm=EUW,application-id=ip27PlEH,discussion-id=UdOqRE1U,comment-id=00010000,timestamp=2015-05-09T17:26:09.996+0000)\n>\n> Aber Diamond gegen Unranked??? Wieso wird man nicht einfach mit Leuten mit ungefähr der eigenen Elo gematcht.....\n\nAber was sagt dies denn aus?\nIch war lange unranked und habe Ende letzter Season die 10 Einstufungsspiele gemacht. Nach einem 8:2 wurde ich Gold 4.\nNach nur 10 Rankeds bin ich jetzt nicht von \"Wood 6\" (\"unranked\") plötzlich stärker geworden. Ich werde wohl bereits vorher zumindest im mittleren bis höheren Silber-Bereich gewesen sein.\n\nbtw. bin ich jetzt wieder unranked, weil ich die 10 Einstufungs-Rankeds für diese Season noch nicht gespielt habe. Dass heisst jetzt nicht, dass ich nun schlecht geworden bin.\n\nEs sagt also rein gar nichts aus, wenn jemand unranked ist. Im Extremfall kann solch ein Spieler sogar Master-Skills haben, hat aber entweder noch nie Ranked gespielt oder die 10 Einstufungsgames für diese Season noch nicht.\n\nMan hat immer eine Elo, auch als unranked. Und die Elo kann wirklich auf Dia-Höhe sein.","replies":[]},{"poster":"GummibaumXYZ","date":"2015-05-09T17:31:13.555+0000","up_votes":2,"down_votes":1,"body":"Weil die Elo im Ranked völlig getrennt von der im Normal ist!\nDu wirst mit Leuten, die eine ähnliche NORMAL Elo wie du haben, gematcht.\nHast du vor deiner Pause als du Gold 2 warst überhaupt noch Normals gespielt, oder immer nur Ranked. Wie häufig hat dein Freund mit dem du zusammenspielst Normals gespielt, nachdem er mit dem Ranking gestartet hat?\n\nDu musst einfach mehr normale Spiele spielen, dann wird deine Normal Elo deinem wahren Skill immer näher kommen und das Matchmaking ausgeglichener.\n\nViele Grüße","replies":[{"poster":"Just1Time3","date":"2015-05-09T18:04:53.661+0000","up_votes":1,"down_votes":0,"body":"ok Danke, aber 1. war ich alleine (manchmal quatsche ich einfach so mit Freunden einfach um zu reden ohne gleich mit ihnen zu spielen) und 2. war meine Normal: Ranked verhalten so bei 3:1 . Aber anscheinend muss ich einfach mehr zocken...","replies":[]}]}]}]}]}