{"poster":"His mum","date":"2015-04-30T01:35:26.093+0000","title":"ARAM Changes","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":2,"body":"It would be interesting to know what member of the Riot Games development staff thought that the summoner spell &quot;Mark&quot; would be a good addition to ARAM?\r\nIntroduction of a special event gap closer to a main game format is quite possibly the stupidest decision that Riot has made. What moron thought it would be good to do that?","replies":[{"poster":"Rav","date":"2015-04-30T05:07:27.574+0000","up_votes":3,"down_votes":1,"body":"It's a good change, the best change they could have done.\n\nA team full of melee whoever has a very hard time winning against 2 tanks and 3 ranged AP and AD carries with tons of poke. \n\ninb4 some bronzelord says \"just go in and stop getting poked hurr!!!\"","replies":[]},{"poster":"sparklefart","date":"2015-04-30T04:30:15.747+0000","up_votes":3,"down_votes":1,"body":"Gives melee a chance to get into the fight without losing all their health from poke beforehand","replies":[]},{"poster":"DiamondAries","date":"2015-04-30T05:16:55.165+0000","up_votes":3,"down_votes":2,"body":"I reckon you are 100% wrong on that call. I believe that in a game mode where consistency gets thrown out the window at champ select, people should have very few consistent things. Before, being stuck with a couple melee bruisers with no engage tool was pretty much GG. However, this new summoner spell offers a consistent engage and encourages the only good thing about ARAM; team fights.\n\nWho's up for a game of ARAM ball? {{summoner:31}}","replies":[]},{"poster":"Project Xayah","date":"2015-04-30T02:06:32.171+0000","up_votes":2,"down_votes":1,"body":"You seem like you're just butthurt. I love the new \"Mark\" summoner spell. It adds more variety to the mode.","replies":[]},{"poster":"FrozenFlame","date":"2015-05-01T03:08:10.694+0000","up_votes":2,"down_votes":2,"body":"I absolutely agree with you -- I don't know what they were thinking. Make it a separate game mode and see how it goes? That's one thing, but adding it into ARAM... it's just one big snow ball fight now.","replies":[]}]}