{"poster":"thelost1","date":"2019-11-27T07:10:55.329+0000","title":"Old name","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"How do I get my old name back It used to be one name now I got to log in under a different name after riot forced me to name change my account, so my IGN is different from my account name. When I tried to use my original account name that ive had since beta it claims its allready in use. Seriously riot are you trying to piss the community off??????","replies":[{"poster":"Ninox","date":"2019-11-28T02:37:56.854+0000","up_votes":1,"down_votes":0,"body":"Riot accounts are global where LoL accounts are regional. If you have another LoL account on another region with the same UN, it will conflict. If you want to keep your original UN for OCE, you have to use the update link to login to those other regions (this includes PBE) and update those UNs to something else first.\n\nDepending on how common your UN is, there will naturally still be some conflicts, but for the most part, people are seeing this message (at least of the ones posting about it) because they have accounts on other regions that share a UN.","replies":[{"poster":"thelost1","date":"2019-11-28T05:03:14.111+0000","up_votes":1,"down_votes":0,"body":"So because other people make accounts with the name I have in a different region, after I made mine, then I should be punished and have the name I have chosen taken away from me?  Why should I be forced to name change when Ive had it for nearly tens years now. Why shouldn't the person who just made there account be forced to use a different name or better yet don't have \"riot accounts and regional accounts\" that shit is just down right fucken stupid. Ive had an account with riot for nearly 10 years and now they decided they want to make shit more complicated for absolutely no reason. Seriously I think riot are trying to kill the LoL off, first the stupid launcher that doesn't keep my login name, the I am forced to change, there absolute horrid matchmaking system witch puts jungle into support role while the support main is forced to jungle cause fucks know how that work. Once upon a time riot gave people xp and ip boosts when it done goofed now they double down and flip the bird at there customers. Honestly Im about done with riot as a company as far as Im concerned they are about 1 decision away from being blizzard which I refuse to buying anything from.","replies":[]}]}]}