{"poster":"Kinderschreck","date":"2019-07-26T19:01:44.934+0000","title":"Balancing Vorschläge","subforum":"Teamfight Tactics","up_votes":2,"down_votes":3,"body":"Grüßt euch!\n\nBin ein großer Fan vom TFT Mode und spiele egtl. nur ihn und das seit der Veröffentlichung.\nMan merkt das dran gearbeitet wird und das gefällt mir schon mal, dafür ein Lob, aber... Wo Licht ist, ist auch Schatten! ;)\nDaher hier einige meiner Vorschläge was man vlt. verbessern könnte:\n\n_Rageblade:_\nIch bin dafür das es hier einen max. Stack geben muss! Momentan ist es einfach das stärkste Item im Spiel mit großem Abstand! Jeder Charakter kann damit was anfangen, selbst die Caster weil sie damit schneller Mana regenerieren.\n\n_Yordle Trait:_\nFür mich einfach absoluter RNG!\nDer Yordle Trait ist wirklich mega ätzend, vor allem weil mit Lulu und Gnar zwei dabei sind, die gut heilen/tanken, sowie mit Kennen und Veigar zwei der stärksten blauen Champions!\nNichts ist frustrierender als zu zuschauen wie die eigenen Attacken alle ins Leere laufen und man von einem deutlich schwächeren Team auseinander genommen wird, einfach weil alles geheilt/abgewehrt wird.\nFinde 15% für 3 und dann 40% für 6 wäre angemessener als wie es jetzt ist.\n\n_Glacial Trait:_\nAuch einer dieser RNG Traits, wobei noch okay, wenn er denn funktioniert und nicht gerade buggt.\nHabe schon mehrfach gehabt das Champions nach dem Treffer aufgetaut sind, aber noch als gestunt galten.\nKann also nicht zu 100% sagen ob der Trait zu stark ist oder hier einfach ein Bug ihn nervig macht.\nSollten aber die Devs bitte im Auge behalten. ;)\n\n_Kennen:_\nIch bin ein absoluter HASSER von diesem Champion! Sorry, aber seine Ultimate is eine der besten im Spiel! Die Reichweite ist zu groß und der Stun zu lange, gepaart mit dem Schaden. Dazu kommt der Yordle Trait, Elementalist sowie Ninja und man hat einen Champion der nur von wirklich guten Fernkämpfern ausgeschaltet werden kann oder Kayle, aber die ist nen Gold Champion daher... Nicht zu berücksichtigen finde ich. ;)\nFür mich der einzige Champion der wirklich nen Nerf benötigt!\n\n_Mehr Aufklärung was ist egtl. Spellpower?!_\nHabe dazu vieles gehört/gelesen und es ist alles wie ein Gerücht... Erhöht es den Fähigkeiten Schaden? Alle Fähigkeiten? Nur einige? Ist es Prozentual oder doch um die genannte Punktzahl?\n\n_Champion Rotation:_\nIch weiss das Champions die keine Person spielt, erhöht erscheinen, aber momentan wirkt es manchmal nicht so.\nSo hatte ich 2 Champions im Team die keine andere Person nutzte oder auf der Bank hatte, aber diese kamen selbst bei 3~4x refresh pro Runde einfach nicht, das ging über 4 Runden lang (zwischen 12~16 Refreshes).\n\n_Mehr low Class Champions (weiße Champions):_\nDies schliesst an das obrige Problem an.\nWeil Champions die jeder nutzt seltener sind, kommt es oft zu Frust, aber leider gibt es zu Anfang einfach nur einen minimalen Pool zur Auswahl und der wird nicht wirklich größer und die meisten \"weißen\" Champions sind leider notwenig um früh Traits zu aktivieren oder gar maximale Traits zu erreichen.\nWürde es nun aber hiervon 2-3 mehr geben, gäbe es mehr Auswahl, mehr Möglichkeiten und die Spieler würden vlt. sich nicht so oft gegenseitig auf die Füße treten.\n\nKleinere Beschreibungsfixes, wie z.B. die Stun Dauer von Fiora sowie die Heilung bei Warwick. ;)\n\nWas sind eure Wünsche für Verbesserungen? Stimmt ihr zu? Gerne auch Kritik (sachlich und objektiv)! ;)\n\nEs grüßt euch freundlich\nKinderschreck","replies":[{"poster":"KerzenChime","date":"2019-07-26T20:05:01.082+0000","up_votes":1,"down_votes":0,"body":"Rageblade ist nichtmal ansatzweise das stärkste item wtf xd\n\nDie stärksten items sind :   dragons tooth , cursed blade , rapid fire cannon und ionic spark.\nDiese items sind overtuned und op aber nicht rageblade.","replies":[{"poster":"Kinderschreck","date":"2019-07-26T20:45:11.491+0000","up_votes":1,"down_votes":0,"body":"Okay, Cursed Blade seh ich ein, aber finde den Rest fair.\nDragons Claw lässt sich mit normalen Angriffen leicht umgehen, Rapid Fire Cannon ist halt der Yordle Counter und ein muss im Spiel dabei ist sie aber fair, Ionic Spark ist gut aber auch hier ist der Schaden zwar early Game hoch im Late meist bei einem guten Team egal.\n\n\nRageblade ist aber halt sehr stark mit Champions wie z.B. Elise auf Gold, wenn sie ihren Lifesteal eh hat oder Champions die eh schon eine höhere Mana Regeneration haben (Sorcerer/Elementalist) sowie durch Traits Attack Speed erhalten (Wild/Ranger).\nDa kann es schnell aus der Kontrolle geraten.\n\nIch teste den neuen Patch noch weiter aus, aber bisher finde ich das Rageblade weiterhin noch zu stark ist.","replies":[]},{"poster":"Enderized","date":"2019-07-26T20:21:38.683+0000","up_votes":1,"down_votes":0,"body":"War das Drachen Item nicht eine Claw? ._.\n\nAußerdem fehlt Shojins in deiner Auflistung D:","replies":[{"poster":"KerzenChime","date":"2019-07-26T20:23:22.978+0000","up_votes":1,"down_votes":0,"body":"Ja right , dragons tooth ist deus ex oops .\n\nShojin ist auch nur bedingt op , shojin ist S tier , die anderen items sind godtier , da sie zum einen overtuned sind und zum anderen auf allen komps und champs einsetzbar sind.","replies":[]}]}]},{"poster":"Enderized","date":"2019-07-26T20:15:03.015+0000","up_votes":1,"down_votes":0,"body":"Spellpower erhöht die Effekte der Fähigkeiten um 1% pro Spellpower.\nDazu zählen Damagetraits, Heilungen und die Menge, die Lulu R zusätzlich gibt.\n\nEffekte die von Attackdamage Skalieren oder Truedamage beinhalten... weiß ich nicht 100%ig, ob diese erhöhlt werden, würde davon ausgehen eher nicht, weil es kein Sinn macht... Dazu würden dann zählen zB Graves, Vayne, Rengar, Draven.\n\n---\n\nGlacial ist in der Tat nervig- entweder gibt man dem Trait einen internen Cooldown oder sollte den Effekt komplett abändern...\nAnnähernd jeder Glacial Char hat nen CC.\nAshe, Lissandra, Sejuani haben einen direkten Stun...\nAnivia slowed Attackspeed...\nVolibear procct den Glacial Stun AoE\n\ndas kommt mit bis zu 60% oder was das war Stunrate doch recht viel pro god damned Autoattack\n\nJA GEGE-  \n\n---\n\nYordle ist ein Counter zu Assassin, Ranger, Gunslinger und Blademaster.\n\nWird von jeglicher Form von Spelldamage hart gecounter (ebenfalls vgl. Guardian/Noble) und RFC ist ebenfalls eine Option.\n\n---\n\nRageblade ist mit aller liebe nicht das stärkste Item mehr seit den Attackspeedskalierungsänderungen von 9.14 in der Champions mit geringerem Attackspeed weniger gut von Attackspeed profitieren.","replies":[{"poster":"Kinderschreck","date":"2019-07-26T20:39:52.481+0000","up_votes":1,"down_votes":0,"body":"Ich hatte ein Sorcerer team und musste gegen Yordle einpacken, die haben mich von 60+ auf 0 geboxt, er war auf nur noch 20+. ;)\n\nAssassin z.B. ist gar nicht mehr so stark seit dem letzten Patch, habe es mit Void zusammen versucht, aber bin gegen fast jeden anderen Trait abgeschmiert. :/\n\nGunslinger ist nicht wirklich \"counterwürdig\", da der Trait okay ist aber die meisten Gunslinger bis auf Tristana und Lucian nur so lala (MF rechne ich nicht, da sie nicht jedes Game \"spawnt\").\nUnd der maximale Team Boni nicht erstrebenswert.\n\nBlademaster ist auch so nen Trait, der selten zusammen kommt, da sind die Leute sich gegenseitig am auspicken, da viele gerne Draven, Yasou oder Fiora haben wollen im Team.\nDie meisten sind halt bis auf Draven solide Champions aber keiner dabei wo man wirklich sagt, dass er zu stark sei.\n\n\nKlar helfen also Teams die mit ihren Skills Schaden machen, aber Yordle hat einfach sauviel CC (bis auf Veigar und Tristana jeder Yordle), einiges an AOE Schaden, einen der besten Tanks des Spiels (Gnar), den einzigen wahren Supporter (Lulu) und die vlt. zwei stärksten Mages (Kennen/Veigar).\n\nIch denke auch der Yordle Trait wäre fair, wenn halt nicht die Komponenten alle einzeln schon gut wären und in der Kombination einfach nur schwer was entgegen zusetzen.\nNur solange die Champs wie sie momentan sind, vor allem seh ich hier Kennen als das Problem, ist 60% Evasion einfach zu viel und macht den Kampf zu einer ekligen RNG Angelegenheit.","replies":[]}]},{"poster":"Ký Luc","date":"2019-07-26T19:24:25.141+0000","up_votes":1,"down_votes":0,"body":"Ich wäre für Cooldown auf alle Ultimates. Durch diese ganzen Mana Items starten viel zu starke Champs viel zu oft Ultis und perm stunnen das ganze Team. Auch eine Abklingzeit von 1-2 Sek für Betäubung würde gut tun... so kann ein Champion nicht permanent aus dem Spiel genommen werden. 3-5 Sekunden CC find ich auch viel zu lange. Das ist vorallem bei Glacial viel zu broken.\nZu Glacial: Macht die Betäubung raus und einen AA slow rein... dann wird durch das Anngrifen eine Chance gegeben, die AA geschwindigkeit um 25 bzw 40% zu senken... Stun gibt es VIEL zu viele in diesem Modus!","replies":[{"poster":"Kinderschreck","date":"2019-07-26T20:00:02.849+0000","up_votes":1,"down_votes":0,"body":"Das wäre eine gar nicht mal zu schlechte Idee!\nIch habe selbst mal ne Rapidfire Ahri gebastelt und die war einfach unaufhaltsam... Dank Wildbuff und Archangel sowie Spear geht das ganz gut.\n\nDas mit dem Glacial ist eine nette Idee, denn sowas gibt es bisher nicht.\nNur da Angriff = Mana wäre es vlt. etwas ZU gut, wobei Demon ja das Mana direkt burnt.\nWäre aber ein guter Ansatz.\n\nIch bin wieder von nem Kennen ausseinander genommen worden.\n4 Champions auf einen Schlag gekillt... Da er sich ja jetzt auch bewegt während seiner Ultimate was er und Shen beide vorher nicht getan haben.","replies":[]}]}]}