{"poster":"Trunkzz","date":"2018-06-03T14:54:09.140+0000","title":"Neue ADC Items","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Ich pers&ouml;nlich finde, dass die neuen ADC-Items eindeutig zu schwach/teuer sind und der Powerspike so sp&auml;t kommt,dass das Spiel wahrscheinlich schon vorbei ist. Mir ist klar, dass Riot will, dass die ADC so fr&uuml;h keinen so starken impact haben sollen, aber dass man jetzt manche ADC&#039;s so aus dem Spiel nimmt finde ich schade. Meine Meinung ist, dass die On-Hit ADC&#039;s wie Varus und KogMaw viele Vorteile gegen&uuml;ber den ADC&#039;s haben die Stormrazer kaufen m&uuml;ssen. Infinity Edge wei&szlig; ich nicht ... Man braucht den True-Damage nicht auf jedem ADC aber den doppelten Critical Strike-Chance ... Essence-Reaver kann von manchen Fighter gekauft werden und die zerreisen dann auch alles. Ist alles nat&uuml;rlich nur meine Meinung. Finde einfach im Endeffekt ADC&#039;s wie {{champion:67}} , {{champion:51}} , {{champion:202}} nicht mehr so stark wie fr&uuml;her daf&uuml;r aber {{champion:110}}  und {{champion:96}}  in meinen Augen echt stark. Klar soll das so sein, dass der Damage und Impact nicht so hoch sein soll aber dann kann man die ADC&#039;s gleich ganz aus dem Spiel lassen ... ALLES NUR MEINE MEINUNG! K&ouml;nnt ja mal schreiben wie ihr das findet :)","replies":[{"poster":"Amycos Cyrus","date":"2018-06-03T16:37:31.731+0000","up_votes":2,"down_votes":0,"body":"Ich finde, dass Riot schon recht gut agiert hat. Wobei es natürlich auch dafür ein paar Ausnahmen gibt.\nIn erster Linie stören mich jedoch nur 2 Sachen:\n\n1. Fehlende Goldeffizienz zum Erhalt von 100% Crit-Chance:\nMan hat ja nicht nur 1% Crit-Chance um 20 Gold teurer gemacht, sondern man muss nun auch noch auf 120% Crit kaufen. Wobei die grauenhafte Effizienz des IE sämtliche Vorteile der Werthalbierung schluckt. (Mit IE kostet 1% Crit ja nur noch 30 statt 60 Gold)\n2. Der Essence Reaver ist für seine Kosten zu stark. Wenn man es mal mit dem Trinity vergleicht, ist der erzielbare Powerspike des Essence Reaver sogar auf vielen Champions größer, als der des Trinity. (Jeweils auf Champions, bei denen das jeweilige Item auch Sinn macht)\n\nDas Crit generell teurer geworden ist und das ADCs, die dahingehend keine Alternative aufweisen (Was nicht sonderlich viele sind) dadurch erst später ins Spiel kommen finde ich jedoch in Ordnung, da Crit ein Stat ist, der das Late-Game dominieren sollte, jedoch häufig zu für gespiked hat. Der True-DMG des IE ist meiner Meinung nach sogar für viele ADCs ein Buff, da sie durch diesen ihrer Aufgabe schneller nachkommen können. (Klassiker: Immer das angreifen, was vor der Nase steht.) ADCs sollen Tanks countern und nicht Mages oder andere ADCs.\n\nUnd als Letztes. Wie schon gesagt finde ich ist fast jeder ADC in der Lage auch im Early/Midgame bereits gut ins Spiel zu starten, wobei \"fast\" Champions wie Caitlyn meint. XD\n\nJhin spiked unglaublich gut Mit dem Stormrazor und dann Lethality und Crit. (Wie man ihn doch schon länger baut.)","replies":[{"poster":"Trunkzz","date":"2018-06-03T17:48:12.283+0000","up_votes":1,"down_votes":0,"body":"Hast schon recht. Stimmt auch man muss sich auch wieder an alles gewöhnen. Das einzige Problem ist, wie du gesagt hast, die Goldeffizenz und die 120% Crit. Wie schon geschrieben sollte man die Items einfach auf 25% Crit reduzieren und die Kosten etwas runter das man auch nicht drüber stackt. Aber du hast schon Recht ... Muss man sich mal wieder umgewöhnen ","replies":[{"poster":"Amycos Cyrus","date":"2018-06-03T19:42:42.742+0000","up_votes":2,"down_votes":0,"body":"Habe eben eine sehr interessanten Post gesehen, der Jhins recht interessante Interaction mit Stormrazer darstellt.\nMan sollte Jhin echt schon etwas beherrschen, um mit Stormrazer first gut zu sein.\n\nHier der [Post](https://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/tUTE6Rcx-stormrazor-schwaacht-jhin)","replies":[]}]}]},{"poster":"Evenrider","date":"2018-06-03T17:04:17.293+0000","up_votes":1,"down_votes":0,"body":":( Crit-Garen ist weg.\nSein E kann Critten, allerdings braucht man dafür Crit-Chance, aber wer kauft denn bitte AS-Items auf Garen. Und jetzt gibt Infinity Edge oder Essence Reaver kein Crit mehr.\nWas kauft man denn jetzt als Crit-Garen?","replies":[{"poster":"Cenâreth","date":"2018-06-04T12:39:53.762+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Evenrider,realm=EUW,application-id=Wj1wcocU,discussion-id=EjlJo4Vi,comment-id=0002,timestamp=2018-06-03T17:04:17.293+0000)\n>\n> :( Crit-Garen ist weg.\n> Sein E kann Critten, allerdings braucht man dafür Crit-Chance, aber wer kauft denn bitte AS-Items auf Garen. Und jetzt gibt Infinity Edge oder Essence Reaver kein Crit mehr.\n> Was kauft man denn jetzt als Crit-Garen?\n\nNimm doch RFC und IE reicht vollkommen aus, trinity hinterher und dann entweder BC oder Lethality Mäßig 60 % Crit mehr brauchste nicht.","replies":[]},{"poster":"Amycos Cyrus","date":"2018-06-03T17:06:39.540+0000","up_votes":1,"down_votes":0,"body":"Der Phantomdance ist in meinen Augen nicht schlecht auf Garen.","replies":[]}]},{"poster":"WC9 Umbra","date":"2018-06-03T15:05:11.427+0000","up_votes":1,"down_votes":0,"body":"Der Powerspike soll ja so spät sein.\nAllerdings sind nicht die Kosten das problem. Die Items passen nicht mehr zueinander. Alles fühlt sich seltsam an.","replies":[{"poster":"Trunkzz","date":"2018-06-03T15:55:07.933+0000","up_votes":1,"down_votes":0,"body":"Vorallem finde ich das alles mathematisch vollkommen dumm. 120% Crit-Chance? Warum macht man die Crit-Chance nicht einfach auf 25% runter und die Goldkosten vielleicht auch verringern um 200 Gold? Dann macht es wenigstens mathematisch noch Sinn ... Aber du hast schon recht. Es fühlt sich schon alles komisch an -.-","replies":[{"poster":"WC9 Umbra","date":"2018-06-03T16:21:49.819+0000","up_votes":1,"down_votes":0,"body":"Also der nerf war schon gerechtfertigt. Aber man hätte es besser lösen sollen.","replies":[]}]}]}]}