{"poster":"Never1tricksmbdy","date":"2019-06-17T01:36:04.787+0000","title":"Wie findet ihr Skins wie Battle-Boss Yasuo?","subforum":"Skin- & Champion-Konzepte","embed":{"description":"This is a teaser spotlight of Battle Boss Yasuo with ingame gameplay! Purchase RP here and help support this channel via the amazon affiliate program (NA): https://amzn.to/2qZ3Bmv Price: 1350RP Skin name is CONFIRMED as Battle Boss Yasuo, particles & SFX may not be final. Check out the other skins in this cycle.","url":"https://www.youtube.com/watch?v=wDaYOrF4EGE","image":"https://i.ytimg.com/vi/wDaYOrF4EGE/hqdefault.jpg"},"up_votes":1,"down_votes":2,"body":"Hi Leute,\r\nwie mir hier im Forum auffällt, gibt es ein bisschen Gegenwind zu Riots neuem Skinkonzept für Yasuo (Battle-Boss Yasuo). Argumente wären hier : 1.Yasuo hat wirklich genug Skins 2.Yasuo passt nicht wirklich zum Thema (Arcade, Battle-Boss). Ich persönlich stimme den Argumenten hier vollkommen zu. Natürlich will Riot Profit aus ihren Skins machen, aber ich finde wenn man Champions Skins aufzwingt die nicht zu ihnen passen, nur um mehr Profit zu machen, sollte dort eine klare Grenze entstehen. Ich glaube sogar Yasuo-Mains wären froh, wenn mal andere Skins auf den Markt kommen. Ich habe sowas schonmal auf meinem 1. Account geschrieben, und seitdem merke ich schon einen kleinen Wandel bei Riot. Champs wie Kled, Ivern und Shaco haben endlich gute Skins gekriegt. Aber warum da aufhören?? Ich fände es gut wenn Riot einen guten Mix hinkriegen würde. Also vielleicht 1 Champion der eher vernachlässigt wurde mit Skins, und 2 Champions die öfters bis oft Skins bekommen. So könnte man doch beide Seiten zufrieden stellen... Und wenn wir mal ehrlich sind, Battle-Boss Aurelion Sol, -Malphite, -Galio oder -Illaoi hätten doch mehr gepasst und sich in dem Bereich noch viel besser angeboten. Aber was sagt ihr, findet ihr es gut das Riot Champions wie Yasuo, Lux oder Ahri auch nach 5+ Skins, immernoch weiter beliefert, oder würdet ihr euch mehr Skins für eher unbeliebtere Champions wünschen? Und findet ihr, passt Yasuo in das Battle-Boss Theme rein ?","replies":[{"poster":"Amycos Cyrus","date":"2019-06-17T13:11:17.547+0000","up_votes":1,"down_votes":0,"body":"Klassischer Disclaimer: Dies ist das falsche Forum.\n\n> Champs wie Kled, Ivern und Shaco haben endlich gute Skins gekriegt.\n\nDas ist halt sehr subjektiv. Manchen gefallen die Skins machen nicht. Vor allem bei Ivern, der ja aktuell nur über 2 Skins verfügt finde ich ist keiner der beiden Skins gut. Aber wie schon gesagt Skins sind reine Ästhetik und deren Wahrnehmung ist sehr eigen für jede Person.\n\n> Battle-Boss Aurelion Sol, -Malphite, -Galio oder -Illaoi hätten doch mehr gepasst und sich in dem Bereich noch viel besser angeboten.\n\nSo viele Spieler wie sich gegen Yasuo schwer tun. Da gibt es eigentlich keinen Zweifel, dass Yasuo auch ohne den Skin für einige Spieler ein Battleboss war. Da fehlen noch ein paar Skins zum Beispiel Zed oder auch Zoe. XD\nWeiterhin ist es auch so, dass die Frage, was zu wem passt kein Aspekt ist, der darüber entscheidet, wer einen Skin bekommt. Sieht man beispielsweise recht gut an den Blutmond Skins, die durch ihren Spielmodus auf Attentäter beschränkt sein müssten. Was also suchen Champions wie Jhin oder Zilean in dieser Skinreihe.\nÄhnliches auch mit den PROJEKT-Skins. Sie sind auf die Schützen ausgelegt worden (ebenfalls dank des OVERDRIVE). Warum also sind dort so wenige Schützen vertreten und so viele Champions, die es nicht sind?\nWeil die Skinreihen eben nicht einer bestimmten Linie folgt. Alles Champions können in jedem Universum auftauchen. Dark Star Ivern ist genauso möglich wie Starguardian Aatrox. Wenn es eine Idee zur Umsetzung gibt, dann wird die auch umgesetzt und geprüft.\n\nHierzu hat sich Riot auch schon geäußert: https://nexus.leagueoflegends.com/de-de/2018/06/ask-riot-skins-and-champions/\n\n> Und findet ihr, passt Yasuo in das Battle-Boss Theme rein ?\n\nDefinitiv. Ich habe mich eher gefragt, warum es so lange gedauert hat, wobei sich eine Begründung im Folgenden auftut.\n\n> Aber was sagt ihr, findet ihr es gut das Riot Champions wie Yasuo, Lux oder Ahri auch nach 5+ Skins, immernoch weiter beliefert, oder würdet ihr euch mehr Skins für eher unbeliebtere Champions wünschen?\n\nDa kann man doch mal einfach deine Beispielliste durchgehen:\n\n - {{champion:157}} (6 Skins in 7 Jahren) 2013 2014 2016 2017 2018 \"2019\"\n - {{champion:103}} (9 Skins in 9 Jahren) 2011 2011 2012 2013 2015 2015 2016 2017 2018 \n - {{champion:81}} (13 Skins in 10 Jahren) 2010 2010 2010 2010 2012 2013 2014 2015 2016 2017 2018 2018 2019 \n - {{champion:99}} (10 Skins in 10 Jahren) 2010 2010 2011 2011 2013 2015 2016 2018 2018 2019 (2019)\n - {{champion:240}} (2 Skins in 4 Jahren) 2016 2018\n - {{champion:136}} (2 Skins in 4 Jahren) 2016 2018\n - {{champion:432}} (3 Skins in 5 Jahren) 2015 2015 2016 \n - {{champion:203}} (2 Skins in 5 Jahren) 2015 2016\n - {{champion:427}} (2 Skins in 4 Jahren) 2016 2019\n - {{champion:35}} (8 Skins in 11 Jahren) 2010 2010 2010 2011 2011 2013 2015 2019\n - {{champion:54}} (8 Skins in 11 Jahren) 2010 2010 2011 2011 2012 2014 2015 2018\n - {{champion:3}} (6 Skins in 10 Jahren) 2010 2010 2011 2012 2015 2018\n - {{champion:420}} (2 Skins in 5 Jahren) 2015 2018\n\nNun daraus bemerkt man folgendes:\n\n1. Abseits von Ezreal (der übrigens die Meisten Skins im Spiel besitzt) hat kein genannter Champion mehr als einen Skin pro Jahr bekommen bzw. Für jedes Jahr mit mehr als einem Skin gab es auch mindestens eines ohne einen Skin-Release für ihn. (Lux würde mit dem Prestige-Skin diese Schwelle auch übertreten)\n2. Es gibt keinen Champion, der seltener als alle 2 Jahre (im Durchschnitt) einen Skin bekommen hat.\n3. Von allen genannten Champions haben nur Kindred und Bard keinen Skin im Jahr 2018/19 bekommen.\n\n___\n\nIch für meinen Teil würde nur für Kindred und Bard hoffen, dass ein Skin kommt, ansonsten ist bei keinem der genannten ein SKin notwendig. (Wobei ich sowohl bei Kindred als auch bei Bard mit den aktuellen SKins mehr als zufrieden bin.)","replies":[]}]}