{"poster":"Agray18","date":"2016-09-14T05:03:33.428+0000","title":"Syndra Soporte ¿El nuevo meta?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Bueno como saben la semana pasada estaba Syndra {{champion:134}}   en la rotaci&oacute;n y como me gusta el campe&oacute;n decid&iacute; probarlo y me quedo support y dije... Syndra tiene de rol secundario apoyo &iquest;&iexcl;porque no!? y bueno la partida no fue mal. Pero Syndra es buena soporte, a ver Tiene el stun pero necesitas buena skillshot (ni tanta xd) tiene un slow, porque nadie la usa de support es muy buena salvo por el burst que mas de 1 vez te puedes llevar 1 kill pero me he hecho plays, no la veo mal de support xD (aunque hay que admitir que en mid revienta)","replies":[{"poster":"Little T","date":"2016-09-14T05:09:41.927+0000","up_votes":3,"down_votes":0,"body":"si!!!! es verdad, yi también serviría de adc, tiene velocidad de ataque y puede deletear campeones, me abriste los ojos","replies":[{"poster":"Ðeceiver","date":"2016-09-14T11:08:30.414+0000","up_votes":1,"down_votes":0,"body":"Cuando empecé a jugar LoL usaba yi adc xD","replies":[]},{"poster":"XsR reddaS","date":"2016-09-14T05:21:36.129+0000","up_votes":1,"down_votes":0,"body":"mi detector de sarcasmo exploto! :v tu nivel es mas de 9000!!","replies":[]}]},{"poster":"Maedme","date":"2016-09-14T07:01:56.652+0000","up_votes":1,"down_votes":4,"body":"{{champion:122}} {{champion:36}} {{champion:81}} {{champion:9}} {{champion:41}} {{champion:86}} {{champion:420}} {{champion:59}} {{champion:10}} {{champion:7}} {{champion:64}} {{champion:54}} {{champion:57}} {{champion:82}} {{champion:76}} {{champion:20}} {{champion:61}} {{champion:80}} {{champion:78}} {{champion:68}} {{champion:13}} {{champion:35}} {{champion:98}} {{champion:14}} {{champion:17}} {{champion:48}} {{champion:161}} {{champion:8}} {{champion:5}} {{champion:115}} \nTambien sirven de sup y nadie los usa :v","replies":[{"poster":"Nerwal","date":"2016-09-14T08:40:55.679+0000","up_votes":2,"down_votes":1,"body":"Denunciado papu, sion es usado actualmente de supp, shen es un buen supp encima puede defender a su adc de los auto ataques con su W, velkoz es buen supp y todavia usado, trundle es uno de los mejores supp que pusiste, poppy fue usado de supp mucho tiempo y rendia bien. Quisiste hacerte el gracioso y quedaste como noob...","replies":[{"poster":"Maedme","date":"2016-09-15T00:07:25.392+0000","up_votes":1,"down_votes":0,"body":"RARA vez se usan, RARA vez.... o acaso los ves de sup con la misma frecuencia que una riven o darius en top? o un zed en mid? \nBajo a tu nivel de pensamiento para contestarte :V \"quisiste quedar como un pro y quedaste como un pelotudo\" :D","replies":[{"poster":"Nerwal","date":"2016-09-15T01:05:21.761+0000","up_votes":1,"down_votes":0,"body":"Por algo te dan negativos, pasa que sos bronce y no los ves por eso, ahi es only blitz, morgana, sona y soraka. Gracias saludos, buenas noches.","replies":[{"poster":"Maedme","date":"2016-09-15T02:37:32.051+0000","up_votes":1,"down_votes":0,"body":"Me dan negativos porque dije que nadie los usa haciendo referencia a que prácticamente nunca se ven en normales y segun los \"negativos\" si se usan.\nPor si sos especial te explico, dije algo como me dan negativos es porque no les parece que sea como yo digo, aunque asi sea.\nQue tanto decis \"noob y bronce\" acaso tenes miedo de ser ambos? uno proyecta sus miedos :D serán estos los tuyos? :3","replies":[]}]}]}]},{"poster":"Shion Archimago","date":"2016-09-14T21:14:06.806+0000","up_votes":1,"down_votes":2,"body":"{{champion:157}} tambien nadie toma en cuentala w  q es el escudo q se peude usar a cada rato y ademas tiene cc con la q y ademas con poco items ya pega durisimo","replies":[{"poster":"Maedme","date":"2016-09-15T00:08:51.900+0000","up_votes":1,"down_votes":0,"body":"El tema es que tiene bastante CD el muro, y para usar el CC de la Q tenes que desgastar a los minions que contribuis a pushear la linea cosa que no es favorable y menos si vas anti meta","replies":[]}]},{"poster":"wattefak","date":"2016-09-14T11:48:46.317+0000","up_votes":1,"down_votes":0,"body":"Vlad/lb:Supp =! Apc\nGp antes del rework\nMorde funciona como adc (no tiene como entrar de supp al adc)","replies":[]},{"poster":"Help Support","date":"2016-09-14T07:34:14.632+0000","up_votes":1,"down_votes":0,"body":"Perdón pero shen trundle poppy Sión Oriana y fiddes fueron usados o son usados de sup en diversas ligas y season. Actualmente shen poppy trundle se ven más de sup que en top. Por lo menos yo los uso de sup. Y a los demás también.","replies":[{"poster":"OkashiCS","date":"2016-09-14T08:42:20.527+0000","up_votes":1,"down_votes":0,"body":"he visto incluso garen sup,  tambien kayle, velkoz, malp  nunu e incluso teemo ( yo los use  mucho la  season pasada)","replies":[]}]}]},{"poster":"Shion Archimago","date":"2016-09-14T21:12:43.838+0000","up_votes":1,"down_votes":0,"body":"ni q fuera tan dificil o novedoso{{summoner:3}} {{item:3092}}  y listo en pocas palabras cualquier mago puede ser sirvienta","replies":[]},{"poster":"rokushoger","date":"2016-09-14T17:26:11.327+0000","up_votes":1,"down_votes":0,"body":"No es mala, de hecho se jugó bastante hace un tiempo.\nLas grandes contras que tiene jugandola de support son estas:\n\n1- Tiene un consumo demasiado alto de mana, por lo que en early, antes de conseguir regen de mana, lo vas a sentir feo a menos que uses runas de mana regen, y en ese caso perdes status de defensa.\n\n2- Para que syndra mantenga un daño decente tenés que comprar unos cuantos items, y eso conlleva o bien que tengas que robar un poco de farm, o bien hacer roam (lo cual es un riesgo como está el meta actual en cuanto a torretas), o bien que te quedes atrás en daño potenciando cdr para stunear, y si es así tenés otros campeones magos de support que hacen lo mismo pero mucho mejor y más fácilmente (además que su ulti queda medio inútil).\n\n3- Su daño en área hace que sin quererlo, tratando de pokear al rival, te puedas robar farm al adc, o bien (lo que es peor) dañarle un minion pusheando innecesariamente la linea y haciendo que se pierdan el oro tanto tu como tu adc, lo cual no es tan determinante teniendo cuidado, pero es un bonus que te hace no elegirla como soporte.\n\nEn resumen, es viable, pero tiene serias contras que hace que quede por debajo de la media frente a otros support magos como vel koz, annie, lux, etc. \n\nTodo esto claro es pensando en que vas a jugarla support en serio, si solo la llevas bot porque no te queda otra y vas a ser un mago más, entonces no te va a preocupar robar farm, ni va a ser un problema armarte, etc.","replies":[]},{"poster":"9081913DEL1","date":"2016-09-14T11:39:16.301+0000","up_votes":1,"down_votes":0,"body":"Pues no la usaria de support porque no le otorgo nada al adc, ya que incluso su stunt debes acertarlo, que por mas bueno que sea sabemos que se puede evitar.\nYa lo dices tu pillando una kill, justamente lo que hara joder mas al adc que beneficiarlo.\n\nSaludos.","replies":[]},{"poster":"erwinchelo","date":"2016-09-14T08:01:14.272+0000","up_votes":1,"down_votes":0,"body":"tiras un combo lvl 3 y te quedas sin mana, como le haces peel luego al adc?...sip, no es mal supp, pero no es brillante ni de las mejores, su carencia de movilidad, la dependencia de 2 habilidades(o 3) para 1 stun, sus costes sus cd, con un kit así elijo una Lux, que ofrece lo mismo pero lo hace mejor....","replies":[]},{"poster":"alop55555","date":"2016-09-14T07:29:13.874+0000","up_votes":1,"down_votes":0,"body":"un soporte necesita moverse rápido por el mapa para wardear y apoyar syndra no tiene una velocidad de movimiento que permita eso de forma fácil.","replies":[]},{"poster":"FurchiDC","date":"2016-09-14T05:07:54.732+0000","up_votes":1,"down_votes":4,"body":"Yo la jugué mucho tiempo de soporte, es muy buena, pero está mejor en mid. Cuando se puso de moda jugar Leona, dejó de ser divertido llevarla de soporte.\nAunque tengo que admitir que muchas veces dejaba medio atrás a mi adc, por eso también dejé de jugarla de soporte.\n\nhttps://www.youtube.com/watch?v=5hoy8-5YCyU\n\n\n\n--\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[]}]}