{"poster":"Lord Sesshomaru","date":"2015-08-31T23:01:31.934+0000","title":"This is how I see it.","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"In my opinion this is how the factors of AD/AP Tankiness and Hard CC should be decided in champ select.\n\nFirst up is to sort out the AD/AP ratio of the team, this is what i think the order is:\n(morde isn&#039;t included in this, he is still an anomaly in the game atm)\n\nADC gets first pick because they can only go ranged AD DPS champs, so they get first pick by default.\nTop gets second pick, they can choose either AD or AP.\nJungle gets 3rd pick they can make a judgement on what best suits the team.\nMid gets 4th pick, they look at the AD/AP of the team and make a judgement as to which will balance the scales and choose that.\nSupport gets 5th and last pick because there are no AD supports \n\nNext us is tankiness this is the order to decide who goes tanky or not,\n\nADC is first pick because there are no ADC tanks\nMid gets next pick, because they have the choice to prioritise damage.\nSupport gets 3rd pick, they can choose either a healer/cc or tank because its up to them to best select champs to benefit their ADC\nJungle gets 4th pick, they look at the team again and decide what best suits.\nTop gets 5th and last pick, if no one else picks tank they have to pick it. \n\nNext is hard CC this order decides who has CC or not\n\nSupport is first, they make the best judgement as to if they want to roll CC\nADC is next, there isn&#039;t much choice for CC in ADC so they are high priority in the pick list by default.\nTop is next, they get do decide to have hard CC or not\nJungle is next if no-one else has hard CC its their job to pick a champ with some.\nMid is last, if no one else has hard CC or only 1 person has it, they are basically obliged to take some.\n\nexceptions to this are structuring a team around Yas, or wanting to do a Malph/Ori engage etc","replies":[{"poster":"DragonOfTheVoid","date":"2015-09-01T17:59:26.025+0000","up_votes":1,"down_votes":0,"body":"f you your trying to take away the fun in a game I just had a game with a {{champion:114}} me top {{champion:58}} as jg {{champion:157}} as mid {{champion:67}} as adc {{champion:267}} as sup the enemy was {{champion:62}} as top {{champion:59}} as jg {{champion:90}} as mid {{champion:82}} as adc {{champion:111}} as sup\n there {{champion:62}} {{champion:82}} {{champion:111}} {{champion:59}} all went a little ad then full tank we won this game went for 40 min all of us except ow sup had full build they have a tone of cc we have next to none they have a tone of ad and ap we only have ad we won as we all got a {{item:3035}} and {{item:3153}} with just these 2 items there armor went from this {{item:3075}} {{item:3075}} {{item:3075}} {{item:3075}} {{item:3075}} {{item:3075}} to this {{item:3075}} {{item:3075}} and with this {{item:3153}}  there hp went from this {{item:3083}} {{item:3083}} {{item:3083}} {{item:3083}} {{item:3083}} {{item:3083}} to this {{item:3083}} {{item:3083}} so getting a team with 2 ad 2 ap and a tank don't mene shit as we were all ad and still won at 40 min with ad tanks","replies":[]}]}