{"poster":"Lord Sesshomaru","date":"2015-07-11T05:53:17.037+0000","title":"Is Tahm Kench's W supposed to do over 2000 dmg to super minions?","subforum":"Miscellaneous","up_votes":2,"down_votes":0,"body":"It does and it says so in the popup numbers, but i dont know where its coming from, i don&#039;t have enough AP for that and theres no way 30% ish of a 3500 something minions hp is 2000+ just wondering if this is a special condition thats hidden (like lucians ult does 300% damage or something to minions, but that is clearly stated) or is it a bug?\r\n\r\nalso sometimes when you swallow a minion and spit it out too quickly it just appears in front of you with no damage taken.","replies":[{"poster":"JasonWazza","date":"2015-07-11T06:44:29.733+0000","up_votes":2,"down_votes":0,"body":"You get something like a 25% damage buff against Super minions due to their Negative MR, meaning 30% turns into 37.5%","replies":[]},{"poster":"X Black Flight X","date":"2015-11-11T14:30:21.688+0000","up_votes":1,"down_votes":0,"body":"I've noticed this also, his w ability say's that it has a damage cap of 600 vs neutral monster, but you do 2/3 of a super minions heath with a single w. That's around 2k!! the skill say's it does 1/3 so were is the extra damage coming from?","replies":[]},{"poster":"Jink","date":"2015-07-11T13:38:26.015+0000","up_votes":1,"down_votes":0,"body":"If someone had abyssal it would be around 50% damage amplification (-30 MR super minions + 20 reduc) so with 100 AP near an abyssal you would do 34% x 1.5 = 51% of their HP and you'd do basically the same with no AP.\n\nIf you had like 300 AP you'd do 36% x .25 = 44.5% of their HP if no one had abyssal and like 54% if some1 did.\n\nSo either some1 had abyssal, you had 300~ ap or its a bug.","replies":[{"poster":"Project Xayah","date":"2015-07-11T13:40:40.530+0000","up_votes":1,"down_votes":0,"body":"Actually, that doesn't happen. Since they have a base MR that is below 0 you can't reduce it.","replies":[{"poster":"Jink","date":"2015-07-11T15:50:48.073+0000","up_votes":1,"down_votes":0,"body":"If you have 30 MR and get auto'd by a level 13+ amumu you are reduced to 5 MR and if there is a fiddle nearby you will be reduced to -5MR and if someone has an abyssal nearby you will be furtherly reduced to -25.\n\nThe exact maths for the bonus damage of MR below 0 is 2-(100/[100-MR]) which replaces the calculations of what would be damage reduction from your MR so you are punished for being in the negatives. You actually take bonus damage rather than just the full damage of abilities and the further you sink into the negatives the greater the damage amplification.\n\n-20 MR is roughly 15% bonus damage taken and -50 MR is roughly 35% bonus damage taken although it's pretty rare.\n\nNormal ranged and melee minions sit at 0 MR so you can reduce them to -20 with abyssal or with the according -reductions- and for minions with -MR (super minions sit at -30) you can furtherly reduce it with the according reductions (Amumu auto's, fiddle aura, abyssal etc).\n\nPenetrations don't reduce below 0, they are applied as -MR not exceeding 0 and reducs are considered as -MR and can apply beyond 0 but are applied before penetrations.\n\nso if you have 30 pen and 20 reduc, their mr is reduced by 20 then the pen applied and the pen cant reduce them below 0 so you need to be facing a lot of reducs to really be reduced below 0 MR.\n\nI'll use an example though - \nYou're a 30 MR Sona, Kat has abyssal, which reduces you to 10MR and she has +30 magic pen from haunting guise and spell pen boots but penetrations can't reduce you below 0 so you will be reduced to 0 MR from her so take full damage from her abilities however other Champions will treat you as having 10 MR so their damage calculations of applying magic damage will vary depending on their pen.\nanother example - you're a 30 MR Sona and a level 13+ Amumu auto's you - you are now at 5 MR. (everyone will treat you as having 5MR) a Katarina with +30 pen will ignore that last 5 MR and deal full damage with her abilities however if she has an abyssal and you have been auto'd by Amumu down to 5 MR you will be reduced to -15 MR by the abyssal and rather than just take the full listed damage of her abilities will actually take bonus damage from her abilitites so a 300 damage Shunpo will deal even more relevant to the damage formula listed above but it works out at about 15% bonus for -20MR and 35% bonus for -50 MR and you really don't need to worry about more reduction than that in basically any game ever.","replies":[]},{"poster":"JasonWazza","date":"2015-07-11T15:47:14.770+0000","up_votes":1,"down_votes":0,"body":"Reduction can, Penetration can't.","replies":[]},{"poster":"Talon12","date":"2015-07-11T14:29:18.521+0000","up_votes":1,"down_votes":0,"body":"actually the abyssal will reduce it to -50%, giving 35% damage increase","replies":[]}]}]},{"poster":"Project Xayah","date":"2015-07-11T06:33:13.960+0000","up_votes":1,"down_votes":0,"body":"Well, looking at the wiki it seems possible. It depends on how much AP you had and how much health the minion had. Considering that Super Minions have negative magic resistance magic damage is amplified. In a long enough game, with enough AP, 2000 damage against super minions is easy.","replies":[]}]}