{"poster":"Lord Sesshomaru","date":"2016-01-12T01:41:01.246+0000","title":"What is the reason?","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"Forgive me but I&#039;m just going to get straight to the point in this thread. Please understand :)\n\nthere are 128 champions in the game, all of them except 5 have at least 1 skin that change the particles on their abilities.\nthe 5 in question are:\nEvelynn\nKarthus\nSion\nTwitch\nYorick\n\nAll of the champs have been out for 7 years, Except Yorick who has been out for 5 years.\n\nSome champs like brand have been out for only 5 years and have 3 skins that change the particles.\n\nExcuse 1:\nSome champions don&#039;t lend themselves as well as others to particle changes.\nFor example WW is a perfect example of a champion that doesnt really have any abilities that lend themselves to new particles because all his abilities are buffs or just melee strikes, where as someone like Karthus who&#039;s abilities are 100% magic swirling everywhere lend themselves wonderfully to particles changes. \n\nRebuttal:\nYet WW does have particles changes and Karthus doesn&#039;t, so that excuse isn&#039;t really valid.\n\nExcuse 2:\nThose are really old campions, and when skins were made for them back in the day they weren&#039;t up to the modern standard.\n\nRebuttal:\nKarthus, Sion, and Twitch, all received massive visual overhauls recently (which included a change in ALL of heir particles) and all 3 champions have at least 1 skin priced at the 975 mark (which is the price that allows for particle changes) which means it would have been easy (and the price of skins wouldn&#039;t even need to be changed) so that isn&#039;t much of an excuse either.\n\nExcuse 3:\n&quot;These things take time, and its in our long term goal to have all champions up to a modern standard&quot;\n\nRebuttal:\nBS! Karthus has been waiting for 7 years for a particle change (it only needs to be just changing the colour) meanwhile Zac who is a relatively recent champ, has not only 2 skins that completely change his particles, but also a chroma pack that gives him 3 new colours as well, Karthus has a croma pack (and its on his 975 skin as well) and he has no particle changes. So if it was in your long term plan you missed several opportunities that were screaming so loud it would have actually taken effort to ignore. Plus it shows that your long tern plan is very inefficient.\n\nExcuse 4:\nWe are holding off any skins and changes to Yorick and Evelynn until they receive their champion updates.\n\nRebuttal:\nFair enough, theres no point making a new skin only to re-haul it a few months later, however the same were true of Sion and Poppy, Sion had no particle variation in his skins after his update and still hasn&#039;t received any skins since, And Poppy&#039;s new skins only have very very minor variation in particle effects as well, and the main change in them is the shape of her passive. (and I&#039;m not going to say that poppy hasn&#039;t received a new skin because thats unfair, she only just came out a few weeks ago)\n\nExcuse 5:\nWhen its their turn for a new skin maybe they&#039;ll get one.\n\nRebuttal:\nThere are no &#039;turns&#039; for getting skins, since i started playing (which was during season 2, when Nami came out.) Swain has not received a single skin, and Varus has had 4 skins (3 of which changed his particle effects). I have carefully studies the patterns of skin releases and i am no closer to finding the system used to select which champion gets a skin. From what i can tell its just a random lottery. Some champs wait forever for a skin after they come out, where as Ekko gets one a few weeks later. So there are no &#039;turns&#039; there is no guarantee that any of those champs will get a skin in the near future, if swain is anything to go by it could be as much as 4 years. Also Karthus just got a Fnatic skin, which was the perfect opportunity to make his particles orange, and you cant say &quot;it was a 750 skin and anyway those team skins don&#039;t get particle changes&quot;, because Talon&#039;s SSW skin had particle changes, and it was a team and 750 skin.\n\n\nNow that i have discussed these possible replies, i have saved us the time of a pointless to-and-fro discussion, i have 5 simple questions:\n\nWhy do these champs not have particle effect skins despite easy opportunities to give them to them?\nWhy do the same champs (already with good skins) keep getting new skins, when these champs are in greater need? \nIs it known to Riot that these are the only champs that lack skins with particle effects?\nDoes this come into consideration when new skins are being created?\nAre there any plans (even if nothing has been put into motion yet) to give these champions some new particle effects?\n\nsorry for being so blunt and forward :S but i hope it meant we can get straight to the point and get some things cleared up :)","replies":[{"poster":"CHEESYLEEKS","date":"2016-01-12T03:19:41.222+0000","up_votes":2,"down_votes":1,"body":"> BS! Karthus has been waiting for 7 years for a particle change\n\nold karthus - https://i.ytimg.com/vi/4dypBvHB3DM/maxresdefault.jpg http://vignette4.wikia.nocookie.net/leagueoflegends/images/f/f3/Karthus_OriginalSkin_old.jpg/revision/latest?cb=20140529202145\n\nnew karthus - http://riot-web-static.s3.amazonaws.com/images/news/June_2014/KVU/kr-ss.png\n\nwhat are you on about","replies":[{"poster":"Lord Sesshomaru","date":"2016-01-12T05:32:12.280+0000","up_votes":1,"down_votes":0,"body":"really....\n\nNone of karthus' skins, new or old has changed his particles effects from that of the classic skin, in 7 years he has yet to have a skin with a particle change. That's what I'm on about.","replies":[]}]},{"poster":"Roguestoney","date":"2016-01-12T03:56:18.582+0000","up_votes":1,"down_votes":0,"body":"Holy crap man...","replies":[]}]}