{"poster":"Lord Sesshomaru","date":"2016-07-28T02:51:56.939+0000","title":"How to get Victorious skin through Ranked Teams?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Im not going to shroud my desires in lies to make them more appealing and less like cheating...\r\n\r\nI want the Victorious skin! Azir is one of the biggest candidates for it this year, and i couldn&#039;t stand never being able to own one of his coolest skins.\r\n\r\nBut I&#039;m Silver 5, the same as i was at the end of last year (its taken me all year so far just to drag myself out of hell... AGAIN!) and my chances of climbing another whole tier (this one with actual players in it) by the end of the year, is slim at best. \r\n\r\nSo! Providing I can find a nice player who has a ranked team in Gold that I can beg (and probably bribe with skins) to let me join, how many games will i have play with that team in order to be eligible for the Victorious skin?\r\n\r\n\r\n_PS. Im not saying I will do this, at this stage it is purely theoretical, and if i even consider it i will feel guilty and horrible as fuck, and it will probably even put myself off league most of next year! But If Riot wants to make limited skins for people&#039;s favourite champs, then they&#039;ll have to accept that some players will want them. _","replies":[{"poster":"Roguestoney","date":"2016-07-28T03:15:41.473+0000","up_votes":1,"down_votes":0,"body":"From memory you had to play i think 10 games to be considered an active member to get the rewards. \n\nThis is just what i seem to remember. It may or may not be correct.\n\nI just got myself back into Gold yesterday in solo queue was quite pleased with myself. Probs get to gold 3 or so before i get bored this season.","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-28T03:19:27.780+0000","up_votes":1,"down_votes":0,"body":"Ok thanks, ill have to find out if that is the correct number or not.\n\nCongrats man! :)","replies":[{"poster":"Roguestoney","date":"2016-07-28T03:21:19.152+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=Ntey9fRZ,discussion-id=A2EkNHWo,comment-id=00000000,timestamp=2016-07-28T03:19:27.780+0000)\n>\n> Ok thanks, ill have to find out if that is the correct number or not.\n> \n> Congrats man! :)\n\nCheers.\n\nYeah there was a riot post in the news section last season but I'm at work on my mobile and cbf looking for it XD.","replies":[{"poster":"Lord Sesshomaru","date":"2016-07-28T04:50:05.223+0000","up_votes":1,"down_votes":0,"body":"Ahh ok hahaha xD fair enough","replies":[{"poster":"Varson","date":"2016-07-28T07:06:25.393+0000","up_votes":1,"down_votes":0,"body":"Want a duo buddy? I'm planning on trying for gold this season. I play in the arvo's mostly.","replies":[]}]}]}]}]}]}