{"poster":"Lord Sesshomaru","date":"2015-03-13T02:42:47.615+0000","title":"Bard's ult and team channeled abilities,","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Blue team Karthus uses his ultimate, during the channel/cast time, blue team bard, uses his ultimate on blue team Karthus, does Karthus's ult:\r\n\r\nA. stop casting, and mana/cd is refunded \r\n\r\nB. stop casting, and mana/cd is NOT refunded \r\n\r\nC. continues casting even while in stasis\r\n\r\nD. pause while in stasis and continue casting after stasis has ended\r\n\r\nCan i have someone who knows the correct answer please say, (Preferebly someone with credibility like RIOT)","replies":[{"poster":"WhisperPan","date":"2015-03-13T06:03:15.326+0000","up_votes":1,"down_votes":0,"body":"It's C) the ult keeps on going. Karthus' ultimate doesn't work on a \"if there's available champions then you can use the ultimate\" like Morgana's ultimate does. Technically you aren't targeting anyone directly. And for that reason, it wouldn't cancel the cast/channel. \n\nThink of bards ult like a AoE Zhonya's. Everyone hit by Bards Ultimate becomes untargetable, and all incoming damage is negated regardless of whether or not it was a skill shot, AA, DoT, AoE or auto-target ability. How would Karthus' Ultimate usually work on someone who Zhonya'd? ","replies":[{"poster":"Project Xayah","date":"2015-03-13T06:50:37.902+0000","up_votes":1,"down_votes":0,"body":"You seem to have misunderstood. Karthus is the one being targeted by Bard's ultimate in this scenario.","replies":[{"poster":"WhisperPan","date":"2015-03-19T04:07:59.131+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HeartVine,realm=OCE,application-id=Ntey9fRZ,discussion-id=fN22E9JA,comment-id=00050000,timestamp=2015-03-13T06:50:37.902+0000)\n>\n> You seem to have misunderstood. Karthus is the one being targeted by Bard's ultimate in this scenario.\n\nAhah damn. I've gotta read things better. B seems most viable then.","replies":[]}]}]},{"poster":"KingDinger","date":"2015-03-13T04:49:27.531+0000","up_votes":1,"down_votes":1,"body":"from the responses it looks like bard is just the ultimate troll champ....lead team into death trap with a shitty placed tunnel, freeze team mates to cancel their channels, bait into poor positioning for heal token, leave ADC solo bot lane almost all lane phase so they get pummeled...\n\ndid rito really just make the ultimate troll champ? but wont allow blitz to hook allies... pfft.\neven kalista wasnt as trolly as people hoped.","replies":[{"poster":"Matutinus","date":"2015-03-13T04:55:24.822+0000","up_votes":1,"down_votes":0,"body":"To be fair you can see where the tunnel goes so if you follow it to a bad position its entirely your fault. Same deal with poorly placed heal packs. If you see your support is Bard then pick an adc that can solo lanes/farm safely like a {{champion:51}}  or {{champion:81}} . Yes his ult is extremely trolly if used incorrectly, which is the only part of him that i really don't like, but it's unlikely you'll find one trolling like that except for  \"fun\" normal games or really low ranked.","replies":[{"poster":"KingDinger","date":"2015-03-13T05:47:46.078+0000","up_votes":1,"down_votes":0,"body":"trolls happen at any rank....\n\nthe tunnel doesnt show the other side....same with if you just dont have wards over somewhere. accidently walk through into 5 people....hardly bards fault, but he still put the tunnel down. same with tunneling INTO someone low on your team, letting an enemy follow.","replies":[]}]}]},{"poster":"GoldenTomat0","date":"2015-03-13T04:22:51.348+0000","up_votes":1,"down_votes":0,"body":"it won't refund it. but the question is does it affect him whilst his passive is active?","replies":[]},{"poster":"Project Xayah","date":"2015-03-13T04:13:36.356+0000","up_votes":1,"down_votes":0,"body":"I'd say it's most likely to cancel and not refund (A), that's what usually happens with similar types of CC (pretty sure it's basically the interaction as between Zhonya's and Karthus' ult). The obvious exception, if Karthus is in passive form it wouldn't affect him.","replies":[]},{"poster":"Big Daddy Tori","date":"2015-03-13T03:51:41.956+0000","up_votes":1,"down_votes":1,"body":"I'm 99% sure it'll just cancel his ult w/o refunding mana.","replies":[]},{"poster":"BarryButcher","date":"2015-03-13T03:30:43.283+0000","up_votes":1,"down_votes":1,"body":"either A or B from what I've read.","replies":[]}]}