{"poster":"Boosted On Bush","date":"2017-03-11T17:13:13.191+0000","title":"FPS Drop And Slow Loading?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"After the season 7 update i have been the last to load up and after i leave fountain i lose around 40-50 fps. Before laning phase i get 60-70+ then the minions come in andd it drops to a constant 20-25. i recall and try to lower my settings to the minimum and it sticks to that frame rate. I'm not too big in computer specs but all i know is that this laptop was made in 2016 and has 4GB of ram with a decent graphics card. during the pre-season i could run the game on max settings with a constant 35-40 fps all game even during team fights. I have factory reset my laptop because i thought that i mightve had too much stuff on it so i now only have league installed. i went into a bot game earlier and the same thing happens. if anyone can help or knows a solution please let me know ASAP im tired of being the last to load in and missing abilities because of this problem. thank you in advance.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Porocles","date":"2017-03-11T17:38:07.899+0000","up_votes":1,"down_votes":0,"body":"Depending on your pc, you might not be meeting the [recommended specs](https://support.riotgames.com/hc/en-us/articles/201752654-Minimum-and-Recommended-System-Requirements) for League.  You might also just have some outdated drivers, especially if you reformatted your rig.  Go through our [FPS issues](https://support.riotgames.com/hc/en-us/articles/201752684-Low-Frame-Rate-FPS-Troubleshooting) guide to help tune things up, which includes making sure your drivers are up to date!  Hopefully it will help, but test it in a custom game to be sure!","replies":[{"poster":"Boosted On Bush","date":"2017-03-11T19:10:23.085+0000","up_votes":1,"down_votes":0,"body":"Hello, thank you for the quick reply. I have just finished installing the required software and updating my drivers the the latest firmware however the problem still resides. i read over the spec requirements and im clocked at 1.8 GHz i see that it is recommended that i have 3GHz. I'm not sure if i can overclock without damgaing my pc as I've never done it before.","replies":[]}]}]}