{"poster":"MadVlad","date":"2019-10-21T01:05:04.850+0000","title":"SKYSHOCK RETURNS!","subforum":"Charlas Generales","up_votes":5,"down_votes":7,"body":"Ya es hora de que vuelva Skyshock para que nos represente, desde que se fue nuestra región a ido en picado a tal punto de estar abandonado nuestro server(LAS).","replies":[{"poster":"Mazoku","date":"2019-10-21T01:07:43.862+0000","up_votes":4,"down_votes":1,"body":"> Ya es hora de que vuelva Skyshock para que nos represente, desde que se fue nuestra región a ido en picado al tal punto de estar abandonado nuestro server(LAS).\n\nhttp://pm1.narvii.com/6986/09e3d5ca480525c3eb2ad8b47a3b3a6c75b19af4r1-720-519v2_uhq.jpg","replies":[{"poster":"MadVlad","date":"2019-10-22T01:24:33.122+0000","up_votes":1,"down_votes":2,"body":"Que siga Las como esta entonces bien representada cuando hagan un evento para LATAM que se lo den a un europeo(Manute) deja que te sigan robando en tu cara.\n\n{{sticker:vlad-salute}}","replies":[{"poster":"Mazoku","date":"2019-10-22T01:27:43.515+0000","up_votes":1,"down_votes":0,"body":"> Que siga Las como esta entonces bien representada cuando hagan un evento para LATAM que se lo den a un europeo(Manute) deja que te sigan robando en tu cara.\n\nRobando que?\n\nYo no miro a los que alegas te representan a vos.","replies":[{"poster":"MadVlad","date":"2019-10-22T01:31:58.694+0000","up_votes":1,"down_votes":1,"body":"Que no mires no quita que no te represente, estas en un server de Latinoamerica y por ello representas a LAS y LAN quieras o no jajajaj si permites que venga un europeo a que goce los beneficios que te da riot ser representante de una region entonces no hay problema.","replies":[{"poster":"Mazoku","date":"2019-10-22T01:42:59.967+0000","up_votes":1,"down_votes":0,"body":"> Que no mires no quita que no te represente, estas en un server de Latinoamerica y por ello representas a LAS y LAN quieras o no jajajaj \n\nY que si te digo que ahorita mismo estoy en europa y no en america.\n\nMe representan los europeos? Y si me vuelvo en 15 dias me van a representar los de sudamerica? Y si me vuelvo a ir cambia denuevo?\n\nTu posicion no tiene sentido alguno. El lugar de residencia no tiene nada que ver.\n\n>  si permites que venga un europeo a que goce los beneficios que te da riot ser representante de una region entonces no hay problema.\n\nPrefiero tener buenos representantes que malos representantes que gozan del beneficio de haber nacido en cierto lugar.","replies":[{"poster":"MadVlad","date":"2019-10-22T01:54:28.397+0000","up_votes":1,"down_votes":1,"body":"No hablo de viajes de q si hoy estas en europa y al dia siguiente estas en america y segun el suelo q estes te represente.\n\nLas cosas comos son si hacen eventos para Latinos nos tiene q representar latinos asi como hacen un evento para europa crees q pensarian en algun latino? \n\nChico el dia q aprendas a defender lo que es tuyo la region crecera si deseas q en tu region te represente otro pues nada suerte en tu vida bro. Prefiero mil veces creer en la gente de mi region por muy malo q sea a que me represente una persona que ni siquiera sabe de nuestra historia y que sea una makina. No creo q en mi region haya gente mala.","replies":[{"poster":"Mazoku","date":"2019-10-22T02:00:19.922+0000","up_votes":1,"down_votes":0,"body":"> Las cosas comos son si hacen eventos para Latinos nos tiene q representar latinos asi como hacen un evento para europa crees q pensarian en algun latino?\n\nA mi me da igual porque no soy nacionalista extremo. No creo que el pais en el cual nacio una persona lo defina.\n\nDicho esto yo hablo con personas, no con paises.\n\n> Chico el dia q aprendas a defender lo que es tuyo la region crecera si deseas q en tu region te represente otro pues nada suerte en tu vida bro. \n\nNo me interesa \"la region\". Para mi el juego es uno solo, League of Legends. Las fronteras poco me importan.\n\n>  Prefiero mil veces creer en la gente de mi region por muy malo q sea a que me represente una persona que ni siquiera sabe de nuestra historia y que sea una makina. No creo q en mi region haya gente mala.\n\nEso pensas vos, no todos piensan igual.\n\nEse tipo que mencionas al inicio capas te representaba a vos, pero no hables por jugadores como yo a los cuales les interesa el merito por sobre la posicion.","replies":[{"poster":"MadVlad","date":"2019-10-22T02:09:17.552+0000","up_votes":1,"down_votes":1,"body":"Se que no todos piensan como yo yo soy muy nacionalista y amo mucho a mi pais y valla dond valla represento o intento representar bien a latinoamerica pero nunca intento ridiculizar las opiniones de los demas. \n\nCreo q con mi comen de arriba acabo de dejar claro q ninguna persona ajena a latinoamerica me representa por ello no hay quizaces que valgan.\n\nSaludos bro.","replies":[{"poster":"Mazoku","date":"2019-10-22T02:14:40.917+0000","up_votes":1,"down_votes":0,"body":"Saludos.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Lerde FTW","date":"2019-10-21T01:35:54.034+0000","up_votes":2,"down_votes":1,"body":"Whuut, Skyshock nunca represento a LAS","replies":[{"poster":"MadVlad","date":"2019-10-22T01:22:52.039+0000","up_votes":2,"down_votes":2,"body":"Por un momento pense que representaba a euw. {{item:3374}}","replies":[{"poster":"Lerde FTW","date":"2019-10-22T21:32:32.362+0000","up_votes":1,"down_votes":0,"body":"Dat, igual no estaría entendiendo tu \"reclamo\"\n\n> Ya es hora de que vuelva Skyshock para que nos represente, desde que se fue nuestra región a ido en picado a tal punto de estar abandonado nuestro server(LAS).\n\nEl tiempo que Sky fue empleado por Riot se encargaba de castear en LAN y de los eventos internacionales, de poner la voz para la presentación de los champs. \n\nVos en serio pensas que el tipo tenía alguna incidencia en cómo trata Riot a las personas del server? Y que desde que se le terminó el contrato dejaron de prestarle atención a LAS? Sólo y exclusivamente por Skyshock?","replies":[{"poster":"MadVlad","date":"2019-10-23T01:40:00.007+0000","up_votes":1,"down_votes":1,"body":"Si claro se perfectamente que casteaba Lan pero Lan tambien representa a Latinoamerica o estoy equivocado?\nHan pasado mas de 5 años y crees q el lol no ah crecido? con las ayudas q da riot a youtubers de europa crees q no lo harían con nosotros? obvio que si pero no hay nadie que alce la voz por nosotros crees q skyshock no podria representarnos? por dios bro hay que abrir los ojos.\n\nEl ultimo evento de Riot LATAM sabes a quien pusieron para q nos represente? a MANUTE un europeo por dios, crees que riot en sus eventos para europa piensa en un latino? bueno creo q no hace falta decir nada.\n\nPor ello mi post.","replies":[{"poster":"Lerde FTW","date":"2019-10-23T04:57:47.102+0000","up_votes":1,"down_votes":0,"body":"> Han pasado más de 5 años y crees q el lol no ah crecido?\n\nSi que creció, se le dio mucha más visibilidad, llegó a transmitirse la final de worlds por tv, hay segmentos de programas que le dan el lugar a los eSports. Si para vos eso no es crecimiento\n\n>con las ayudas q da riot a youtubers de europa crees q no lo harían con nosotros?\n\nSon dos realidades totalmente distintas, estamos muy lejos de lo que es NA, EU y Riot al final del día sigue siendo una empresa, es obvio que va priorizar y dar notoriedad a lo que le beneficie\n\n>obvio que si pero no hay nadie que alce la voz por nosotros crees q skyshock no podria representarnos? por dios bro hay que abrir los ojos.\n\nVos estas diciendo que Sky levante la voz por toda LATAM? Sigue sin ser claro lo que tomas por \"representar\"\n\n> El último evento de Riot LATAM sabes a quien pusieron para q nos represente? a MANUTE un europeo por dios, crees que riot en sus eventos para europa piensa en un latino? bueno creo q no hace falta decir nada.\n\nQue evento? Lo mismo de arriba no entiendo y no explicas que es representar","replies":[{"poster":"MadVlad","date":"2019-10-23T19:11:52.861+0000","up_votes":1,"down_votes":1,"body":"Loco si respondes por partes obvio que no vas a entender el comen. \nClaro q el lol ah crecido pero como bien pones priorizan NA EUW KOREA y esas regiones antes que LAS o LAN hasta ahi de acuerdo.\nBro quiero entender que tienes cerebro sin faltar el respeto esta claro.\nCuando quieren escoger a un Presidente en tu pais es para q represente a tu pais verdad? aplicalo lo mismo en el lol y para tu region.\nEspero que lo hayas entendido con este ejemplo.\ncon sky tendriamos muchisima mas voz ante el mundo tendriamos mucho mas apoyo por mejorar nuestro server. \nCreo q te perdiste muchos eventos o no estas muy enterado de la comunidad de league of legends. \nHicieron un evento para Latinoamerica era el evento LATAM y en vez de que pongan a un representante latino pusieron a Manute un español digo yo si haces un evento para LATAM minimo lo que quiere la gente es q nos represente ante el mundo un latino no un europeo que no tiene ni puta idea de nuestra cultura, no crees?","replies":[{"poster":"Lerde FTW","date":"2019-10-23T20:12:58.543+0000","up_votes":1,"down_votes":0,"body":"> Creo q te perdiste muchos eventos o no estas muy enterado de la comunidad de league of legends.\nHicieron un evento para Latinoamerica era el evento LATAM y en vez de que pongan a un representante latino pusieron a Manute un español digo yo si haces un evento para LATAM minimo lo que quiere la gente es q nos represente ante el mundo un latino no un europeo que no tiene ni puta idea de nuestra cultura, no crees?\n\nEventos de la comunidad medianamente los sigo por las recompensas, ahora con los eventos presenciales fuera de las finales no los sigo, y ese evento LATAM la verdad no me suena, y con lo que busque dentro del foro no encontre nada pero bue.\n\nhttps://ibb.co/tptC2Wc\n\nPor las dudas le pregunté jaja","replies":[]}]}]}]}]}]}]}]}