{"poster":"Yomii","date":"2015-04-25T10:06:11.986+0000","title":"Gente troll","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":0,"body":"**_Bueno en primero lugar hola a todos creo esta discusion con fin de saber que piensan los adm. espero que lo vean de la gente que piensa que es un simple juego y eso les da derecho a trollear o porque son solo simples normales les da derecho a entrar y hacer perder el tiempo a los demas y ultimamente me esta pasando demaciado esto y ya cansa queria saber si muchos tienen este problema y que piensan al respecto porque la verdad esta bien es normal pero eso no significa que no sean importantes porque si por ser normal trolleas entonces eso te da derecho a trollear en todas partes o porque sea normal tenes derecho de hacer que muchos pierdan su tiempo ?? para algo el juego tiene personalizadas y contra bots para que entres ahi te diviertas como te cante la gana sin hacer que nadie pierda su tiempo o pierda partidas por que se te dio el capricho de fastidiar a los demas bueno pues era solo eso espero que lo lean y piensen en eso porque ya sinceramente es molesto y no hay nadie que haga nada para cambiarlo. \r\nGracias, adios._**","replies":[{"poster":"lupo","date":"2015-04-25T23:11:29.511+0000","up_votes":2,"down_votes":0,"body":"Este juego, y en general todo en lo que consumes en la vida, busca ganar dinero. Por tanto banear gente no es rentable para la empresa, ya que puede ser gente muy rata, pero que se gasta 50k al mes en el LOL por lo cual  es mas apreciado que un player que tiene una buena conducta pero que no gasta dinero. \nUn buen ejemplo es el actual sistema, donde si te vas afk o te reportan por troll, te aparece un mensaje, y te dan el super castigo de ponerte en colas que demoran mas, lo cual en principio poco y nada le importa a un niño rata, si no le importa perder una partida y 20 minutos o más troleando, crees que le va a afectar esperar un poco mas para jugar?.\nLos administradores te dan placebos, te dicen que hacen mejoras para evitar esto, que están \"analizando\", pero dime cuanto tiempo ha pasado desde que bajaron el sistema de tribunal?\nLa verdad es simple, no les importa que league of legends sea conocido mundialmente como el juego que mas troll tienen en el mundo. Les interesa saber que son el juego mas jugado, porque significa $$$$. A ellos no les importa calidad, les importa cantidad.","replies":[{"poster":"Neltharium","date":"2015-04-29T02:10:02.800+0000","up_votes":1,"down_votes":0,"body":"si pero no se puede permitir estos troll tengo amigos q estan dejando de jugar por los trolls si dejamos q le pase esto al lol con el tiempo los niños ratas lo consumiran y saldra otro juego q ya lo opacara lo mismo PASO CON EL WOW antes puros niños jugaban AHORA JUGAR WOW DA PLACER NO HAY MUCHA GENTE NI NIÑITOS DE MIERDA Q TROLLEAN Q BRONCA Q ME DA ESTE JUEGO UNO QUIERE MEJORAR EN RANKEDS PERO IMPOSIBLE CON TROLLS ASI","replies":[]}]}]}