{"poster":"4 Ever TaIone","date":"2018-10-03T08:43:09.391+0000","title":"Weshalb entbannt Riot toxische Spieler?","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":2,"body":"In der Vegangenheit war es Riots Prinzip, gebannte Accounts gebannt zu lassen, da die Spieler, die davon betroffen waren, sich nachweislich nicht verbesserten. Neulich habe ich nun folgendes gelesen: https://www.reddit.com/r/leagueoflegends/comments/9356yc/why_are_people_in_na_having_their_permabanned/\r\nhttps://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/4AE9RKcR-riot-unbanning-permabanned-accounts","replies":[{"poster":"Noxempire","date":"2018-10-03T09:11:11.163+0000","up_votes":4,"down_votes":0,"body":"Wenn man sich schon die Mühe macht sowas zu Posten dann bitte auch die Kommentare unter dem Reddit Thread lesen. \n\nHier die Antwort von Riot Wookie \n\n>TL;DR: We're running an experiment to see if people can grow and change for the better. We're excited to see how this could affect all players, but because of the high risk that comes with this kind of exercise we're only doing it on NA players right now. No players should be getting their hopes up very high that we will allow permabanned players to return to the game and continue their old ways. Players who receive any sort of penalty after returning will be re-banned permanently. At this point, we're not sure that letting players return to the game after a permaban is the best course of action and may decide to keep our current stance on permabanned accounts; but we're very eager to see what kind of results might come up.\n>\nEdit: 3:22 PM PST: Got word that the original post I replied to was deleted because of the duplicate topic. Gonna repost my full message here for you all!\n>\nI want to keep this pretty brief and to the point because this is an experiment that I'm spending a lot of my resources on currently. Our goal of this experiment is to test assumptions we've made about perma-banned players and their ability to adjust behaviors in the game. We're working with players who are coming to us in good faith to change and stay out of trouble. Unfortunately we don't have a lot of systems in place to run this experiment so a lot of the work is manual on our part (and mainly me).\n>\nThe biggest issue being; tracking players who are returning to the game and ensuring they stay out of trouble; players who acted in bad faith to participate in this experiment or who fail and fall to their old ways are quickly re-banned with no opportunity to return.\n>\nThe NA region is able to execute this currently because we have the staff and resources necessary to operate this experiment. In additional we can leverage the expertise of our central PB teams and Player Support teams here on the Los Angeles campus when needed to make sure that the experiment is in line with our long term goals here at Riot.\n>\nI can understand how this may feel bad for other regions but I would like to lay out the following context as to why we're comfortable with this path for now:\n>\nAllowing permabanned players to return to the game is NOT something we're committed to as a company at this time. There are a large number of risks and factors that we want to take into account before we do this. We're running this small scale on NA with the opportunity to end it at any point if we feel it's compromising the quality of our game and community.\nThe risk of allowing permabanned players back to the game is so high because it can disrupt our community and create negative experiences for other players. Because of this one of the core pillars of this experiment is that players who fail to change (or who had no intention of changing at all) will be re-banned very quickly and remain banned forever. This extra care is very resource intensive until we decide whether this is a worthwhile process to continue and possibly create some tools to streamline the process.\nAs we continue this experiment we're very aware that it might show us that permabanned players will need to remain removed from the game for the health of our community. Keeping it limited to a community of players that I am very familiar with makes it easier for us to audit and \"shut it down\" if necessary and return to our original policy of not allowing permabanned players to return to the game at all. Where as in other regions the culture of their communities can be different and while some norms are similar to that of NA, others are not. And that's without even getting into the language differences that can prove troublesome for auditing behavior. If we find that this experiment is successful we can better share it with our offices all over the world and give them the opportunity to adapt it to their players' needs if they find it useful. Likewise, if we find that the experiment was ultimately not successful we'll be able to better share our results and findings with other regions that highlight the trouble and difficulties we had with the experiment and why we won't be continuing it.\nHopefully this helps share clarify some of our thoughts and goals for this experiment with you all. If I could leave one parting thought with you guys it would be that: this is NOT a change of our policy currently; but an experiment to evaluate the advantages and disadvantages of evolving our PB guidelines. We are not under any obligation to lift a permanent suspension(and there are still a great many permabans we are not lifting, and will never lift under ANY circumstance). Also we will only be doing so under the strict guidelines of our experiment so that we can properly track the impact on our overall community and hold participants responsible for any actions they do upon returning to the game.\n>","replies":[]},{"poster":"Cryptixz","date":"2018-10-03T11:35:48.185+0000","up_votes":1,"down_votes":3,"body":"Ich finde das ist ein relativ solider schritt. Das ist ja so ähnlich wie eine \"Rehabilitation\", ich hoffe das dies auch den Weg zu uns nach EU irgendwann findet. Ich habe einen Account auf dem ich Perm gebannt wurde vor fast 3 Jahren und ich würde diese Chance auch gerne bekommen um mich zu beweisen. Mal schauen was daraus wird.\n\nfinde den Schritt aber sehr interessant.","replies":[{"poster":"Darkr3sQ","date":"2018-10-03T12:05:37.112+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Cryptixz,realm=EUW,application-id=KYnfKGf0,discussion-id=RRbMAHko,comment-id=0003,timestamp=2018-10-03T11:35:48.185+0000)\n>\n> Ich finde das ist ein relativ solider schritt. Das ist ja so ähnlich wie eine &quot;Rehabilitation&quot;, ich hoffe das dies auch den Weg zu uns nach EU irgendwann findet. Ich habe einen Account auf dem ich Perm gebannt wurde vor fast 3 Jahren und ich würde diese Chance auch gerne bekommen um mich zu beweisen. Mal schauen was daraus wird.\n> \n> finde den Schritt aber sehr interessant.\n\nDas hängt davon ab, wie dieses Experiment nun weiter verläuft.","replies":[]}]},{"poster":"Humpelstilzche","date":"2018-10-03T09:13:30.928+0000","up_votes":4,"down_votes":1,"body":"Wie in den Threads die du verlinkt hast teilweise schon erklärt ist, handelt es sich um ein Experiment, dessen ersten Phase bereits beendet ist (d.h. momentan wird niemand entbannt). Ziel des Ganzen ist, herauszufinden welche Spieler unter welchen Umständen sich auch noch nach einem Perma wieder bessern können. Das Experiment wird ausschließlich in NA durchgeführt. \nRiot hat ein ähnliches Experiment schon mal in der Vergangenheit durchgeführt, wo raus kam dass sich die überwältigende Mehrheit der permagebannten Spieler nicht bessern kann. Allerdings wurde das Experiment damals unter anderen Bedingungen durchgeführt, weshalb es sinnvoll ist, es zu wiederholen. \n\nDas Prinzip \"Perma ist perma\" ist also im wesentlichen nach wie vor das selbe. Es wurden lediglich ein paar Ausnahmen zu wissenschaftlichen Zwecken gemacht. Diese Accounts stehen allerdings unter permanenter Kontrolle, die sind also nicht einfach so entbannt.","replies":[{"poster":"OT Riku","date":"2018-10-03T09:22:10.879+0000","up_votes":1,"down_votes":0,"body":"Wird bei den jedes Spiel automatisch gefiltert?\nBzw überprüft.","replies":[{"poster":"7deadLeeSlnz","date":"2018-10-03T10:39:42.240+0000","up_votes":2,"down_votes":0,"body":"Das ist ja das Gute an diesem Experiment. Das Verhalten wird ****manuell überprüft****.","replies":[{"poster":"OT Riku","date":"2018-10-03T10:52:42.456+0000","up_votes":1,"down_votes":0,"body":"Ja aber es wird erst bei report manuell geprüft oder ohne report.","replies":[{"poster":"7deadLeeSlnz","date":"2018-10-03T11:18:01.888+0000","up_votes":2,"down_votes":1,"body":"Denke eher ohne report. Der eine Rioter redet davon, dass extrem viele Ressourcen für dieses Experiment aufgebracht werden müssen.","replies":[{"poster":"OT Riku","date":"2018-10-03T12:11:18.588+0000","up_votes":2,"down_votes":0,"body":"Das ist gut.\nWo kein Kläger, da kein Richter. \nIch fände das auch sehr beschämend für Riot wenn nicht.","replies":[]}]}]}]}]}]},{"poster":"Loki die Birne","date":"2018-10-07T21:34:48.431+0000","up_votes":1,"down_votes":1,"body":"Ich meine Riot seine banns sind nicht immer gerechtfertigt\n\neiner meiner Accounts wurde 2 Tage gebannt, weil eine Transaktion schief gegangen obwohl ich dafür nichts konnte 😑😑\n\n\nHonor lvl 0 +\n\nwenn ich noch irgen ein Mist baue \nPerma bann😂😂\n\nAuf Facebook oder in Clans gibt es genügend Beispiele","replies":[{"poster":"Darkr3sQ","date":"2018-10-08T03:57:08.130+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Loki die Birne,realm=EUW,application-id=KYnfKGf0,discussion-id=RRbMAHko,comment-id=0004,timestamp=2018-10-07T21:34:48.431+0000)\n>\n> Ich meine Riot seine banns sind nicht immer gerechtfertigt\n> \n> einer meiner Accounts wurde 2 Tage gebannt, weil eine Transaktion schief gegangen obwohl ich dafür nichts konnte 😑😑\n> \n> \n> Honor lvl 0 +\n> \n> wenn ich noch irgen ein Mist baue \n> Perma bann😂😂\n> \n> Auf Facebook oder in Clans gibt es genügend Beispiele\n\nWenn eine Transaktion nicht hinhaut, kann RIOT aber ebenfalls nichts dafür. Sie haben Dir aber die RP gutgeschrieben, und keine Gegenleistung dafür erhalten. Dass dann der Account erst einmal gesperrt wird, ist da nicht ungewöhnlich.\nMit der Ehrungsstufe hat Sirrkas bereits etwas dazu geschrieben.","replies":[]},{"poster":"Sirrkas","date":"2018-10-07T23:12:28.086+0000","up_votes":1,"down_votes":0,"body":"Ich bin mir sehr sicher, dass dein Ehrungslevel nicht darunter leidet, wenn es Zahlungsschwierigkeiten gab. Falls das bei dir so war, melde dich mal beim Support, vielleicht gab es da einen Bug.","replies":[]}]},{"poster":"67105 TOXIC","date":"2018-10-03T09:23:23.868+0000","up_votes":1,"down_votes":6,"body":"***","replies":[{"poster":"Darkr3sQ","date":"2018-10-03T09:55:03.964+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=67105 TOXIC,realm=EUW,application-id=KYnfKGf0,discussion-id=RRbMAHko,comment-id=0002,timestamp=2018-10-03T09:23:23.868+0000)\n>\n> Geil wo kann ich mich da bewerben?\n\nBist Du auf NA, und welchen Teil von \"dessen ersten Phase bereits beendet ist\" hast Du nicht verstanden?","replies":[{"poster":"need elo police","date":"2018-10-03T10:41:02.622+0000","up_votes":1,"down_votes":0,"body":"Er will doch nur trollen. Reporte ihn und gut ist.","replies":[]}]}]}]}