{"poster":"Rayito","date":"2016-01-13T19:20:20.530+0000","title":"¿Que les parece las nuevas habilidades de shen?","subforum":"Charlas Generales","embed":{"description":"Passive: Ki Barrier After casting an ability, Shen gains a temporary shield. The shield has a relatively long cooldown which is significantly reduced if one of his abilities affects an allied or enemy champion. Q: Twilight Assault Shen calls his spirit blade, empowering his next three basic attacks to deal damage based on a portion of his target's max health.","url":"https://m.youtube.com/watch?v=qHcdf2FZ4pg","image":"https://i.ytimg.com/vi/qHcdf2FZ4pg/hqdefault.jpg"},"up_votes":5,"down_votes":3,"body":"Creo que se ve bien anuqu&eacute; esa espada ah&iacute; en el medio es flashera xD","replies":[{"poster":"LGBT Valentina","date":"2016-01-13T21:14:27.089+0000","up_votes":3,"down_votes":0,"body":"depende de los escalados de las habilidades\nel kit en si, es bastante fuerte, no me sorprende de las infinitas quejas que va a traer este nuevo shen por la W","replies":[]},{"poster":"DestroyAgC","date":"2016-01-13T20:17:37.445+0000","up_votes":1,"down_votes":2,"body":"un canbio , que no tenia que ser hay campeones que necesitan un reword como {{champion:44}} , {{champion:83}}  bueno riot se esta dejando muy de lado a esos","replies":[{"poster":"Ks Erwyn","date":"2016-01-13T20:27:13.155+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Adandestroller,realm=LAS,application-id=v7qsfXsE,discussion-id=lOIUXAAQ,comment-id=0006,timestamp=2016-01-13T20:17:37.445+0000)\n>\n> un canbio , que no tenia que ser hay campeones que necesitan un reword como {{champion:44}} , {{champion:83}}  bueno riot se esta dejando muy de lado a esos\n\nEs distinto, sobre shen, kassa, heimer, mF y al igual que poppy, ya tenian una base solida sobre la cual trabajar, en cambio con Yorick taric, WW y como paso con el mismo Sion, necesitan cambios mucho mas drásticos y totales que llevan mucho mas tiempo de idealizar y plasmar","replies":[]}]},{"poster":" Acantha","date":"2016-01-13T19:56:29.575+0000","up_votes":3,"down_votes":0,"body":"Ya era hora que empiezan a fijarse en campeones antiguos y abandonados.\nSe acerca tu turno {{champion:33}} y {{champion:19}} (ojala) XD","replies":[]},{"poster":"Adrien Agreste","date":"2016-01-13T19:47:22.434+0000","up_votes":2,"down_votes":0,"body":"me parece genial, ami parecer en top va a seguir ! (al menos yo intentare seguir usandolo) y mucha gente ya lo quiere mandar a supp directamente q obviamente no esta mal pero yo creo q en top tiene mucho mas utilidad con respecto a su R","replies":[{"poster":"Ks Erwyn","date":"2016-01-13T19:54:56.388+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=riyao,realm=LAS,application-id=v7qsfXsE,discussion-id=lOIUXAAQ,comment-id=0004,timestamp=2016-01-13T19:47:22.434+0000)\n>\n> me parece genial, ami parecer en top va a seguir ! (al menos yo intentare seguir usandolo) y mucha gente ya lo quiere mandar a supp directamente q obviamente no esta mal pero yo creo q en top tiene mucho mas utilidad con respecto a su R\n\nDe top con Aliento Agonico sera una bestia.....de jg tendrá mejor limpieza a costa de algo de perdida de sustain y de supp ahora ademas de su Taunt, tendra un cegar en area con su W (mecánicamente su W funciona igual a un cegar) y ademas un posible slow con su Q, ROTO ROTO ROTO................","replies":[]},{"poster":"Rakiltx","date":"2016-01-13T19:55:26.087+0000","up_votes":2,"down_votes":0,"body":"creo q funcionara mejor de supp x su w\nsi vas a top no podras usar la w porque necesita un aliado cerca para activarlo\nSaludos {{champion:55}}","replies":[{"poster":"Adrien Agreste","date":"2016-01-17T02:19:42.147+0000","up_votes":1,"down_votes":0,"body":"creo q top sirve mas que supp , ahora tiene mas daño  para ir top , y con respecto a su W solo bloquea 2 basicos dura muy poco y su enfriamiento es muy alto como para hacerlo util.  saludos","replies":[]}]},{"poster":"DestroyAgC","date":"2016-01-13T20:24:49.806+0000","up_votes":1,"down_votes":0,"body":"yo lo uso mucho de sup por la cantidad de ayuda que da a face de linea claro que en top esta re bien cuando hay que usar la util a una linea pero creo que la r sigue igual lo cuanl podes seguir siendo , un salvador de la grieta","replies":[]}]},{"poster":"JuanGuz","date":"2016-01-13T19:45:32.714+0000","up_votes":2,"down_votes":0,"body":"En el tema de Visual me gusta al igual que sus skins, pero no puedo opinar de sus nuevo kit de habilidades... tendré que jugarlo y sacar mis propias conclusiones.","replies":[]},{"poster":"Ks Erwyn","date":"2016-01-13T19:38:08.611+0000","up_votes":2,"down_votes":0,"body":"La pasiva en late esta rota rota que te cag**, lastima perderá sus sustain, pero esta en gran medida compensada con daño y vaya daño, habrá que ver sus escalados.Si lo único q no me convence es la espada voladora allí, molestando la claridad de juego.................","replies":[{"poster":"Rayito","date":"2016-01-13T19:46:53.797+0000","up_votes":1,"down_votes":0,"body":"Yo lo vi raro que pongan eso ahí la verdad y hubiera quedado mejor clavada en el piso y mas oscura, pero bueno se ve bien eso es lo que importa.","replies":[]}]},{"poster":"WesterKest","date":"2016-01-13T19:31:10.862+0000","up_votes":2,"down_votes":0,"body":"Que bueno que no saquen la E ni la R. La verdad no entendí las habilidades pero puede estar bueno {{champion:98}}","replies":[{"poster":"DestroyAgC","date":"2016-01-13T20:25:56.669+0000","up_votes":1,"down_votes":0,"body":"si que bueno","replies":[]}]},{"poster":"ZUBZERO","date":"2016-02-08T10:00:27.761+0000","up_votes":1,"down_votes":0,"body":"Una cagada grandicima, amaba a mi shen tanque y sus habilidades y enfriamiento todo era perfectamente calculable.. ahora depende de su espada y su pasiva dura menos osea atacas o mueres o te quitas xq no aguantas nada era mi unico champ de victoria segura en top.. y su Q ya no te regenera para poder hacer el dragon tu solo mientras el team entretiene al contrario.. gracias a ustds ando peor que Poppy, en busqueda de mi nuevo main","replies":[]},{"poster":"Yakuza Kiryu","date":"2016-01-14T03:26:59.615+0000","up_votes":1,"down_votes":0,"body":"la pasiva la tengo que entender","replies":[]},{"poster":"bzheks","date":"2016-01-14T02:16:41.429+0000","up_votes":1,"down_votes":0,"body":"aunque cueste entenderse, sinceramente veo este cambio de habilidades en shen favorable para la jg (el tema del escudo en area para ignorar daño, su nueva Q y su vieja E)","replies":[]},{"poster":"Elyasviel","date":"2016-01-14T01:09:20.574+0000","up_votes":1,"down_votes":0,"body":"Seh, me gusta y todo pero la espada ahi.. xD","replies":[]},{"poster":"PCtronix","date":"2016-01-13T22:30:50.183+0000","up_votes":1,"down_votes":0,"body":"Luego de un tiempo no faltara la persona que diga ... ``devuelvan a shen lo que era, shen ya no esta OP, era main shen y lo mataron ...´´   me gustaria probarlo ya que se ven interesantes los poderes","replies":[]},{"poster":"LEPscad ","date":"2016-01-13T21:52:55.033+0000","up_votes":1,"down_votes":0,"body":"Todo bien hasta que me doy cuenta que en top tiene 1 habilidad menos...","replies":[]},{"poster":"Ruphian","date":"2016-01-13T21:19:32.833+0000","up_votes":1,"down_votes":0,"body":"La cagada es q como supp, sacaron la curacion de la q.","replies":[]},{"poster":"Lysaru","date":"2016-01-13T20:59:47.302+0000","up_votes":1,"down_votes":0,"body":"Les falto poner un cartelito de neon que diga \"Lleven a sheen support\"","replies":[]},{"poster":"Zota","date":"2016-01-13T19:29:09.089+0000","up_votes":1,"down_votes":0,"body":"no entendi la pasiva, q y w xd","replies":[{"poster":"Sir Lister","date":"2016-01-13T20:25:44.960+0000","up_votes":1,"down_votes":0,"body":"Pasiva: cada vez que usa una habilidad gana un escudo. si la habilidad interactua con un aliado o enemigo, el enfriamiento de la pasiva se reduce.\n\nQ. llama la espada para usarla para pegar 3 hits que hacen daño % vida máxima. si al llamarla atraviesa algún campeón enemigo, hace mas daño , si el enemigo huye de shen se ve ralentizado.\n\nW. Al activarla alrededor de la espada se forma un area de evasion de ataques basicos por algunos segundos... siempre y cuando haya un aliado dentro, sino hay un aliado entonces la habilidad espara para activarse hasta que un aliado entre en dicha area.","replies":[]}]},{"poster":"Sir Lister","date":"2016-01-13T20:20:46.204+0000","up_votes":1,"down_votes":0,"body":"Adios Shen Jungla.","replies":[]},{"poster":"Gheno","date":"2016-01-13T22:33:11.165+0000","up_votes":1,"down_votes":1,"body":"como cagaron a mi shen estaba tan bien asi como estaba :C","replies":[]}]}