{"poster":"Banelord","date":"2015-04-20T17:56:01.138+0000","title":"PayPal","subforum":"Hilfe & Support","embed":{"description":"PayPal PayPal ist eine Bezahloption, die unseren Benutzern ermöglicht, Riot Points durch Online-Geldtransfer zu erwerben. Dein PayPal-Konto muss mit einem Bankkonto, einer Kreditkarte oder einem Girokonto verknüpft werden. Mit einem PayPal-Konto kannst du unkompliziert Käufe tätigen, ohne jedes Mal deine Kreditkartendaten einzugeben. Weitere Informationen über PayPal findest du hier.","url":"https://support.riotgames.com/hc/de/articles/201753084-PayPal","image":"http://p2.zdassets.com/hc/settings_assets/43400/200033224/LBZf3GrqUxXhkYXWcHzxHA-logo.png"},"up_votes":3,"down_votes":1,"body":"Hallo Beschw&ouml;rer,\r\n\r\nhabt Ihr das Problem, da&szlig; Ihr eine Kreditkarte hinzuf&uuml;gen m&uuml;&szlig;t, \r\nobwohl eurer PayPal-Konto bereits verifiziert worden ist und Ihr bereits eure Kontonummer hinterlegt habt?\r\n\r\nDann Hilft euch vielleicht folgender Tip weiter:\r\nIhr m&uuml;&szlig;t zun&auml;chst gen&uuml;gend Geld auf euer PayPal-Konto &uuml;berweisen, damit Ihr die Zahlung erfolgreich abschlie&szlig;en k&ouml;nnt.\r\nSofern sich gen&uuml;gend Geld auf eurem PayPal-Konto befindet, wird auch die Meldung mit der \"Kreditkarte hinzuf&uuml;gen\" verschwinden.\r\n\r\nSofern das Problem bestehen bleibt, erstellt bitte ein Ticket und wir werden euch Helfen! :-)\r\n\r\nViele Gr&uuml;&szlig;e","replies":[{"poster":"recon","date":"2015-05-10T21:45:15.288+0000","up_votes":1,"down_votes":0,"body":"Man kann bei PayPal auch mittlerweile mit GiroPay einzahlen und spart sich damit die langen Wartezeiten von Überweisungen.\nZwar ist dies mit einer Einzahlung von mindestens 50€ verbunden, aber man kann den Restbetrag nach dem Einkaufen von Riot Points ja direkt wieder auf sein Konto auszahlen lassen (dauert 1-3 Tage).","replies":[]},{"poster":"GummibaumXYZ","date":"2015-04-20T19:28:50.998+0000","up_votes":1,"down_votes":0,"body":"Muss man in diesem Fall nur einmal genügend Geld auf das PayPal-Konto überweisen, um damit zahlen zu können, oder muss man vor jeder weiteren Zahlung Geld auf das PayPal-Konto überweisen? Das macht die Zahlung mit PayPal dann nämlich relativ sinnlos, da es viel zu lange braucht bis die Überweisung bei PayPal ankommt.\n\nLG Gummibaum","replies":[{"poster":"C Elektra M12","date":"2015-06-30T15:39:46.635+0000","up_votes":1,"down_votes":0,"body":"ganz ehrlich: Als PayPal-mitarbeiter und als LoL-Zocker kann ich dir sagen: PayPal funktioniert wunderbar auch ohne Guthaben, sofern man ein zwei Regeln einhält:\n- Das ALastschriftverfahren muss klappen, wenn du also zu oft eRückalstschriften hast, sagt das Sicherheitssystem irgendwann, dass das Ausfallrisiko für Zahlungen bei dir zu hoch ist und du deswegen nicht mehr ohen Guthaben zahlen darfst. beim LAstschriftverfahren geht PayPal nämlich für dich in Vorkasse, bevor es das Geld von deiner Bank bekommt:\n- Wenn du einen ganz frischen Account hast, muss die erste Zahlung aus dem guthaben erfolgen und sollte niht für digitale Güter sein. Es muss nämlich zuerst dein Kaufverhalten und deine Zahlungsmentalität festgestellt werden. Klappt die erste Zahlung schon nciht, hast du was falsch gemacht.\n- Einfach einen neuen Account aufmachen bringt im Übrigen gar nichts, da zwischen jedem Account hinsichtlich Namen, Zahlungsquelle, IP-Adresse, Datum der Erstellung usw Querverweise gemacht werden: Ist ein Konto negativ belastet, weren die anderen Konten auch nicht mehr reibungslos funktionieren.\n- Prepaid-kreditkarten funktionieren für maximal drei Buchungen!!!\n- Die banküberweisung zu PayPal dauert im Schnitt 2 Werktage, wenn du alles richtig machst (ABsenderbank, Name korrekt, Verwendugnszweck), wenn es davon abweicht, ahst du was falsch gemacht.\n\nSolltest du zu einem dieser Puntke Fragen haben oder den Sceiß glauben ,was irgendwelche Kunden ins Itnernet schrieben, die das System nur einseitig kennengelernt haben und nun motzen, dann ruf lieber den Support von PayPal an oder schrieb mri ne PN...\n\n(Werd meinem Chef mal vorschlagen, mich hier als Mod einzusetzen und dafür nen Extragehalt zu kriegen) ;D\n\nmeckert also nicht, dass PayPal nicht funktioniert - das System funktioniert. Wenn es nicht klappt mit der Zahlung aht das wohl durchaus nen Grund. Imemrhin geht es um Geld und Sicherheitskriterien, die bei jeder Zahlung geprüft werden.\nSeid lieber zufrieden, dass es solche Instrumente überhaupt gibt udn wir nciht alle immer Überweisungen machen müssen.","replies":[{"poster":"PuNcH 1T","date":"2015-08-04T20:49:09.678+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=C Elektra M12,realm=EUW,application-id=7hciEY9w,discussion-id=JTg6ofez,comment-id=00000001,timestamp=2015-06-30T15:39:46.635+0000)\n>\n> ganz ehrlich: Als PayPal-mitarbeiter und als LoL-Zocker kann ich dir sagen: PayPal funktioniert wunderbar auch ohne Guthaben, sofern man ein zwei Regeln einhält:\n> - Das ALastschriftverfahren muss klappen, wenn du also zu oft eRückalstschriften hast, sagt das Sicherheitssystem irgendwann, dass das Ausfallrisiko für Zahlungen bei dir zu hoch ist und du deswegen nicht mehr ohen Guthaben zahlen darfst. beim LAstschriftverfahren geht PayPal nämlich für dich in Vorkasse, bevor es das Geld von deiner Bank bekommt:\n\nWird das auch irgendwann wieder entfernt? Da es bei mir jetzt der Fall ist, und ich nicht wirklich Lust habe jedes mal 3 Tage vorher Geld aufzuladen um dann vielleicht mal irgendwas kaufen zu wollen weil ich gerade in der Stimmung bin.\n\nWürde mich über Reply freuen\n\nPunchi","replies":[{"poster":"legofreak1","date":"2015-08-09T11:08:39.293+0000","up_votes":1,"down_votes":0,"body":"Schreib am besten den Support von PayPal deswegen an, ich bezweifle, dass er hier öfter reinschaut.","replies":[]}]}]},{"poster":"Banelord","date":"2015-04-21T10:42:13.500+0000","up_votes":1,"down_votes":0,"body":"Hallo Gummibaum,\n\nich befürchte leider ja. Es muß immer genügend Geld vorhanden sein.","replies":[]}]},{"poster":"Schnalzer","date":"2015-08-01T14:28:45.751+0000","up_votes":1,"down_votes":0,"body":"Normalerweise bucht doch PayPal per Lastschrift bei mir ab...\nSeit heute will der die Kreditkarte, das ist totaler Mist.","replies":[]},{"poster":"C Elektra M12","date":"2015-06-30T15:46:14.945+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Banelord,realm=EUW,application-id=7hciEY9w,discussion-id=JTg6ofez,comment-id=,timestamp=2015-04-20T17:56:01.138+0000)\n>\n> Hallo Beschw&ouml;rer,\n> \n> habt Ihr das Problem, da&szlig; Ihr eine Kreditkarte hinzuf&uuml;gen m&uuml;&szlig;t, \n> obwohl eurer PayPal-Konto bereits verifiziert worden ist und Ihr bereits eure Kontonummer hinterlegt habt?\n> \n> Dann Hilft euch vielleicht folgender Tip weiter:\n> Ihr m&uuml;&szlig;t zun&auml;chst gen&uuml;gend Geld auf euer PayPal-Konto &uuml;berweisen, damit Ihr die Zahlung erfolgreich abschlie&szlig;en k&ouml;nnt.\n> Sofern sich gen&uuml;gend Geld auf eurem PayPal-Konto befindet, wird auch die Meldung mit der \"Kreditkarte hinzuf&uuml;gen\" verschwinden.\n> \n> Sofern das Problem bestehen bleibt, erstellt bitte ein Ticket und wir werden euch Helfen! :-)\n> \n> Viele Gr&uuml;&szlig;e\n\n\n\nGenausogut kann man den Kundenservie von PayPal anrufen (ist in Deutschland kostenfrei) und eine Freischaltung für das Lastschriftverfahrne verlangen. Das klappt derzeit bei 55% aller Anfragen hervorragend. Eine Kreditkarte oder Guthaben ist nun nicht immer ein Muss.\nAls Supportmitarbeiter von PayPal stehe ich solchen Anfrage ntäglich gegenüber :)","replies":[]},{"poster":"PENTA Beyond","date":"2015-04-29T15:36:50.686+0000","up_votes":1,"down_votes":0,"body":"ich wurde heute perma gebannt da ich meine karte sperren musste durch verlust hab aber schon eine neue und wollte das geld nachzahlen nun bin ich gebannt was kann ich tun das er wieder entbannt wird und ich euch das geld geben kann?","replies":[{"poster":"C Elektra M12","date":"2015-06-30T15:44:05.932+0000","up_votes":1,"down_votes":0,"body":"Deine Kreditkarte wurde gesperrt und die letzte Buchung ging ins Leere. Das heißt aber nicht, dass dein Account gesperrt wurde. \nDu musst einfach in der Usermaske des PP-Accounts deinen Identitätsnachweis bringen und eine Email an kundenbetreuung@paypal.com schreiben.\nIdentitätsnachweis: klicke im eingeloggtem Zustand auf das Zahnradsymbol (mein Profil), jklicke dann enben deinem Namen auf \"bearbeiten\", wähl namensänderung wegen Hochzeit oder Scheidung aus\"...  dort ist dann die Uplaod-Maske für Dokumente hitnerlget (bisschen umständlich, aber dort isses), Da lädst du dann Vorderseite und Rückseite deines Personalausweises hoch. 48 Stunden später isses bearbeitet und du kannst wieder über dein PP-Konto verfügen\n\nSolltest duFragen ahben , ruf den PP-Support an oder schrieb mir ne PN...","replies":[]},{"poster":"Rkoturdo Ndo","date":"2015-04-29T18:23:31.879+0000","up_votes":1,"down_votes":0,"body":"Heya\nSchreib den [Support](https://support.riotgames.com/hc/de/requests/new) an. Diese werden dir dann die nötigen Instruktionen geben.\n\nMfG Rkoturdo","replies":[]}]}]}