{"poster":"Cosmochris","date":"2017-09-19T09:55:31.461+0000","title":"Getting leaver buster punished from dcing and playing the game?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I play league on a macbook (grandma bought it for school) so it can have shitty moments sometimes. For example, my last game I had the game crashed out of nowhere so I had to restart my computer and get back on the game. I eventually played it out and didn't do so bad, but I got punished and now have lower priority que (i have to wait 20 minutes in que to play games) even though I had no power over the situation. This is the 2nd time in a row this happened, and it looks like riot has zero tolerance on my dcing ever again so I was wondering what I should do.","replies":[{"poster":"Porocles","date":"2017-09-19T16:21:11.227+0000","up_votes":1,"down_votes":0,"body":"It sounds like you might have been gone long enough to get marked as a leaver.  The [leaverbuster](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ) system won't penalize you for one game, but a history leaves.  I know the situation was out of your power, but leaving still causes others a negative experience.  You'll have to play through the required lower priority queue games, but but sure to do it when you know you won't run into anymore issues.","replies":[{"poster":"Cosmochris","date":"2017-09-20T02:52:13.558+0000","up_votes":1,"down_votes":0,"body":"Yeah because I got low priority que punished twice in a row for dcing twice in a row. And like I said, I play on a macbook laptop so I am going to come across a lot of issues with my game crashing, even in the future. And in response to your comment about causing others a negative experience, in most if not all cases, its not like I afk, I do come back everytime and I eventually catch up everytime and manage to win most if not all of the games. The last game I mentioned, I managed to do pretty well but we lost not because I was dc'ed, but because of miscommunication and such (Team was winning even when I was dc'ed and still was when I caught up, but lost team fights).","replies":[]},{"poster":"Trundamere","date":"2017-09-19T21:10:11.047+0000","up_votes":1,"down_votes":0,"body":"\"gone long enough to get marked as a leaver.\"\n\nHow long is this? Would like to know the amount of time one haves to try to fix the problem before being punished anyways even after fixing the problem.","replies":[]}]}]}