{"poster":"Zedant","date":"2016-07-05T16:14:14.942+0000","title":"Surr di mer a?","subforum":"Discussioni generali","up_votes":3,"down_votes":21,"body":"Non capisco il senso del surr.\r\nNon vuoi giocare?,prima cosa non giochi,seconda cosa esiste l afk.\r\nDevi andare via?vai afk tanto niente ban per una o 2 volte.\r\n&#039;&#039;sprecare(certo specare)&#039;&#039; tempo in game persi?1.il nexus e esploso?se e no allora si sta in game.Se e si non puoi surrendare mio piccolo essere.\r\nAfk in team?giochi e basta,se vinci vinci se perdi perdi.Un coccetto cosi facile e dificile da capire.\r\nAltri motivi per qui dovrebbe esserci questa opzione inutile?io non ne trovo dite voi.","replies":[{"poster":"Frattaglia","date":"2016-07-05T16:19:18.191+0000","up_votes":11,"down_votes":3,"body":"Non perdere 40 minuti per una normal che sai già al minuto 20 come andrà.","replies":[{"poster":"Zedant","date":"2016-07-05T16:21:21.525+0000","up_votes":5,"down_votes":2,"body":"Arrivando a 40 min vuol dire che non era persa\nPoi diciamocelo giocare questa e un altra cosa cambia?","replies":[{"poster":"Dr LouD","date":"2016-07-05T16:28:14.454+0000","up_votes":6,"down_votes":2,"body":"Quello è un problema di basso elo\n\nQuando si arriva a livelli decenti questo problema non si pone nemmeno più, perchè se un team stompa, finisce anche prima dei 20 minuti","replies":[]},{"poster":"wellyT93","date":"2016-07-06T00:08:46.737+0000","up_votes":3,"down_votes":0,"body":"> Arrivando a 40 min vuol dire che non era persa\n\nSi, come no, infatti siamo tutti Challenger che al min 20 se hai un vantaggio netto è finito il game, assolutamente non esiste il fatto che ad elo bassi le persone non sappiano chiudere i game quando possono, tirandoli avanti fino all'esasperazione, anche vincendo ogni cazzo di fight, riescono, non si sa come, a non prendere obbiettivi. \n\n> Poi diciamocelo giocare questa e un altra cosa cambia?\n\nCambia, un game perso dove la gente trolla e flamma non ti può offrire più nulla, quei 20 minuti risparmiati in quel game tossico ed inutile li recuperi in un'altro game.","replies":[]},{"poster":"Frattaglia","date":"2016-07-05T16:25:27.410+0000","up_votes":5,"down_votes":3,"body":"> [{quoted}](name=Zedant,realm=EUW,application-id=MJVj50Jw,discussion-id=a3L6z9ep,comment-id=00000000,timestamp=2016-07-05T16:21:21.525+0000)\n>\n> Arrivando a 40 min vuol dire che non era persa\n> Poi diciamocelo giocare questa e un altra cosa cambia?\n\nCambia.\nSe a te non va di surrendare puoi sempre votare di no senza venire qui a insultare gli altri.","replies":[]}]},{"poster":"O V T R Λ G E","date":"2016-07-05T22:14:03.719+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=a3L6z9ep,comment-id=0000,timestamp=2016-07-05T16:19:18.191+0000)\n>\n> Non perdere 40 minuti per una normal che sai già al minuto 20 come andrà.\n\nNon esistono partite finite prima della caduta del nexus metti che uno nel team si incazza e vuole trollare uno va fk perchè gli salya la connessione o che ne so la vostra comp può vincere i team fight o semplicemente loro throwano si fanno stealare un baron BASTAA NOIN ESISTONO PARTITE PERSE PRIMA DELLA DISTRUZIONE DEL NEXUS IO SONO CON L'AUTORE DEL POST!\noltre tutto il surrend è un comanda fin troppo abusato quindi io sono per la rimozione o il posticipo di questo o quanto meno per l' aumento dell' intervallo tra un voto e un altro c'è gente che sa solo spammare il surrend e una volta che vede questo non accettato o va afk o si mette a trollare \nE POI TU PARLI DI NORMAL! LE NORMAL SONO FATTE PER DIVERTIRSI ORAMAI MANCO UN CHAMP PUOI IMPARARE IN NORMAL LO DEVI PRENDERE E BUTTARE IN RANKED  **PURTROPPO** è COSì\nMA SOPRATTUTTO A LOL NON SI GIOCA PER VINCERE COME TUTTI I GIOCHI SI GIOCA (ma va) PER DIIVERTIRSI NON PER VINCERE SPECIE IN QUESTE CAZZO DI NORMAL","replies":[{"poster":"DuckQuack0","date":"2016-07-05T23:03:23.721+0000","up_votes":3,"down_votes":2,"body":"Queste persone che tryhardano pesantemente in normal sono il cancro di LoL, come se potessero fare le stesse cose anche in ranked... Io giocando molto spesso le normal a detta degli altri \"troll\" solo perché non utilizzo il champ in meta con la build coreana, ne incontro a migliaia, ma non capiscono che se giocassi seriamente come in ranked non li farei manco farmare.... Che poi pensano di migliorare nelle normale dove dei silver vanno contro platini..\nPoi pensano che la Riot mi banni ahahah, per fortuna ci sono ancora quelli come me che amano divertirsi almeno nelle normal\n\n\n*poi è estate, i bambini non vanno a scuola*","replies":[{"poster":"RedmasterITA","date":"2016-07-06T18:11:22.610+0000","up_votes":2,"down_votes":0,"body":"Se non tryhardare in normal per imparare un campione , dove esattamente potresti farlo ?\nDIrettamente in ranked ?","replies":[{"poster":"DuckQuack0","date":"2016-07-06T21:28:48.497+0000","up_votes":1,"down_votes":2,"body":"Si? Non sono fatte per migliorare le ranked? Appena livello 30 ho subito iniziato le ranked, e i campioni li uso anche per la prima volta in ranked, ed infatti sono arrivato da bronzo 3 a plat 4... E se non avessi perso una marea di tempo nello studio a causa degli esami, a quest' ora sarei Diamond! Quell che non capite è che le normal non hanno benché minimo bilanciamento, trovi silver contro platini, gold contro bronzi... E cosa vorresti migliorare li? Per non parlare del premade che prova a tryhardare.. Nelle normal è tutto più facile, ed è per questo che molti restano in silver a vita. Poi ti pare che anche se volessi migliorare con un campione mi metterei a giocare con i silver e bronzi? Se giocassi seriamente non li farei manco farmare, e non miglioro un bel niente, e neanche mi diverto detto molto sinceramente","replies":[{"poster":"RedmasterITA","date":"2016-07-07T05:06:00.167+0000","up_votes":1,"down_votes":1,"body":"Sbruffone ^-^","replies":[]}]}]}]},{"poster":"Frattaglia","date":"2016-07-05T23:03:08.414+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=HolyPony Andreas,realm=EUW,application-id=MJVj50Jw,discussion-id=a3L6z9ep,comment-id=00000001,timestamp=2016-07-05T22:14:03.719+0000)\n>\n> Non esistono partite finite prima della caduta del nexus metti che uno nel team si incazza e vuole trollare uno va fk perchè gli salya la connessione o che ne so la vostra comp può vincere i team fight o semplicemente loro throwano si fanno stealare un baron BASTAA NOIN ESISTONO PARTITE PERSE PRIMA DELLA DISTRUZIONE DEL NEXUS IO SONO CON L&#x27;AUTORE DEL POST!\n> oltre tutto il surrend è un comanda fin troppo abusato quindi io sono per la rimozione o il posticipo di questo o quanto meno per l&#x27; aumento dell&#x27; intervallo tra un voto e un altro c&#x27;è gente che sa solo spammare il surrend e una volta che vede questo non accettato o va afk o si mette a trollare \n> E POI TU PARLI DI NORMAL! LE NORMAL SONO FATTE PER DIVERTIRSI ORAMAI MANCO UN CHAMP PUOI IMPARARE IN NORMAL LO DEVI PRENDERE E BUTTARE IN RANKED  **PURTROPPO** è COSì\n> MA SOPRATTUTTO A LOL NON SI GIOCA PER VINCERE COME TUTTI I GIOCHI SI GIOCA (ma va) PER DIIVERTIRSI NON PER VINCERE SPECIE IN QUESTE CAZZO DI NORMAL\n\nE se io non mi diverto ad aspettare i nemici che mi ballano davanti al nexus invece di tirarmelo giù permetti che posso iniziare un'altra partita?\nLo so che nelle partite non si può mai dire, ma siccome sto parlando di partite normali e siccome gioco a un livello in cui la gente fa un po' meno errori è anche più difficile recuperare le partite.\nOppure se come al solito gioco con il mio amico che manda la botlane nemica 17/0* sinceramente non ha neanche senso tryhardare, specie se non è una ranked.\n\n*successo ieri","replies":[{"poster":"Dr LouD","date":"2016-07-06T09:31:57.289+0000","up_votes":3,"down_votes":1,"body":"Dillo che ti manca il toplaner main challenjour che ti carria 8-)","replies":[{"poster":"Frattaglia","date":"2016-07-06T10:31:59.461+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=a3L6z9ep,comment-id=0000000100000002,timestamp=2016-07-06T09:31:57.289+0000)\n>\n> Dillo che ti manca il toplaner main challenjour che ti carria 8-)\n\nEh, non mi carri più come una volta! ;P","replies":[]}]},{"poster":"O V T R Λ G E","date":"2016-07-06T08:49:27.902+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=a3L6z9ep,comment-id=000000010000,timestamp=2016-07-05T23:03:08.414+0000)\n>\n> E se io non mi diverto ad aspettare i nemici che mi ballano davanti al nexus invece di tirarmelo giù permetti che posso iniziare un&#x27;altra partita?\n> Lo so che nelle partite non si può mai dire, ma siccome sto parlando di partite normali e siccome gioco a un livello in cui la gente fa un po&#x27; meno errori è anche più difficile recuperare le partite.\n> Oppure se come al solito gioco con il mio amico che manda la botlane nemica 17/0* sinceramente non ha neanche senso tryhardare, specie se non è una ranked.\n> \n> *successo ieri\n\ne come mai i tupoi compagni di squadra non hanno surrendato se la situazione è così tanto ridicola?\n perchè è una baggianata","replies":[{"poster":"Frattaglia","date":"2016-07-06T09:13:07.932+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=HolyPony Andreas,realm=EUW,application-id=MJVj50Jw,discussion-id=a3L6z9ep,comment-id=0000000100000000,timestamp=2016-07-06T08:49:27.902+0000)\n>\n> e come mai i tupoi compagni di squadra non hanno surrendato se la situazione è così tanto ridicola?\n>  perchè è una baggianata\n\nOvviamente non era con questo account.\nMa secondo l'utente che ha creato il topic io non avrei dovuto surrendare, quindi è inutile che te la prendi con me dato che noi volevamo surrendare.","replies":[{"poster":"O V T R Λ G E","date":"2016-07-06T09:17:50.786+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=a3L6z9ep,comment-id=00000001000000000000,timestamp=2016-07-06T09:13:07.932+0000)\n>\n> Ovviamente non era con questo account.\n> Ma secondo l&#x27;utente che ha creato il topic io non avrei dovuto surrendare, quindi è inutile che te la prendi con me dato che noi volevamo surrendare.\n\nio me la piglio con chiunque è a favore di questa baggianata e approvo completamente la necessità di 4 voti positivi su 5 per il surrend,\n non hai idea di quante partita avrei perso per il surrend. Ieri in particolare  stavamo perdendo di netto una partita proposta di voto per il surrend (per altro gìa spammata altre 2 volte prima) 3 voti a favore 1 contro (il mio ) abbiamo fightato vinto il fight l' ultimo ha votato no siamo andati al baroin l'abbiamo rushato e gli avversari hanno surrendato regalandoci una win che sicuro non avremmo meritato","replies":[]}]}]}]}]}]},{"poster":"RedmasterITA","date":"2016-07-05T17:14:27.550+0000","up_votes":4,"down_votes":1,"body":"Puoi vincere 4 vs 5 , con un troll , con un team fight al minuto 50 , puoi sempre vincere finche il nexus non è esploso .\nLa vera domanda è ne vale la pena ?","replies":[{"poster":"Zedant","date":"2016-07-05T19:35:10.420+0000","up_votes":2,"down_votes":2,"body":"La vera domanda e ne e valsa la pena di giocare  a lol?","replies":[{"poster":"RedmasterITA","date":"2016-07-05T20:02:54.272+0000","up_votes":6,"down_votes":1,"body":"Quand'è che vale la pena giocare ?\nQuando ti diverti .\nSe non ti stai divertendo ,per un qualsiasi motivo , ecco che ti viene offerta la possibilità di terminare la partite .\nSe invece di provare piacere l'unica cosa che senti è rabbia frustrazione e stress (coff* perchè cerchi di carriare un team che non solo non ti ascolta ma crede di essere dio in terra facendo le giocate piu' da bronzo V coff*) , io credo che per la mia salute fisica e mentale sia meglio abbandonare la partita e cercare di giocarne un' altra piu' \"sana\".","replies":[]}]},{"poster":"Dainsleif09","date":"2016-07-05T19:40:05.347+0000","up_votes":2,"down_votes":1,"body":"finché c'è uno spaccone flammerino nel team nemico ne vale sempre la pena :3","replies":[{"poster":"RedmasterITA","date":"2016-07-05T20:03:23.079+0000","up_votes":4,"down_votes":0,"body":"Se pensi che ne vale la pena libero di non arrenderti xD\nNon la pensiamo tutti allo stesso modo :D.","replies":[{"poster":"Dainsleif09","date":"2016-07-06T08:29:58.465+0000","up_votes":1,"down_votes":0,"body":"indubbiamente","replies":[]}]}]}]},{"poster":"Darkinknight","date":"2016-07-05T17:11:11.181+0000","up_votes":6,"down_votes":1,"body":"Non è bello perdere 40 minuti a caso..quando poi il team avversario in nettissimo vantaggio invece di chiudere il game trolla per 15 minuti buoni","replies":[{"poster":"Sorcio84","date":"2016-07-05T18:29:04.082+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Hellknight1994,realm=EUW,application-id=MJVj50Jw,discussion-id=a3L6z9ep,comment-id=0003,timestamp=2016-07-05T17:11:11.181+0000)\n>\n> Non è bello perdere 40 minuti a caso..quando poi il team avversario in nettissimo vantaggio invece di chiudere il game trolla per 15 minuti buoni\n\n+1\n+1\n+€€€","replies":[{"poster":"Darkinknight","date":"2016-07-05T20:11:54.125+0000","up_votes":2,"down_votes":1,"body":"I +1 li ho visti..ma i € non li trovo 😂","replies":[]}]},{"poster":"Zedant","date":"2016-07-05T19:34:38.618+0000","up_votes":2,"down_votes":2,"body":"Poi vinci","replies":[{"poster":"Darkinknight","date":"2016-07-05T20:09:05.086+0000","up_votes":2,"down_votes":1,"body":"Se sei 4 - 15 puoi ancora vincere..se sei 5 -30 al 20 o vanno afk loro minimo in 2 o è persa..ed è stupido stare li altri 20 minuti con la gente che flamma a manetta e trolla,si surrenda e se ne starta un'altra in tranquillita..non vedo cosa ci sia di difficile da comprendere","replies":[]}]}]},{"poster":"l  Ferox  l","date":"2016-07-06T07:44:21.603+0000","up_votes":3,"down_votes":0,"body":"Guardando il tuo storico partite ho capito il tuo astio verso il Surrend ........\n\n\n/ff tutta la vita.","replies":[]},{"poster":"Killer SurpRyze","date":"2016-07-06T07:50:29.608+0000","up_votes":3,"down_votes":1,"body":"Eppure hai votato surrend sul libro di grammatica, così come ha fatto l'auto-correttore del forum con te.\nNormalmente si gioca per divertirsi: se la partita diventa un noioso assedio unilaterale, il divertimento sparisce. Mai capito i \"never surrend\" in normal o nelle modalità del fine settimana.","replies":[{"poster":"Zedant","date":"2016-07-06T09:20:51.179+0000","up_votes":2,"down_votes":3,"body":"se non ti diverti non giochi e basta,surrendare e brutto perche porta un bruttissimo umore,specialmente alle persone ch enon vogliono e si trovano costretti a giocare premade con un amico che non surrenda a caso per non dover fin ire ogni game al minuto 20.","replies":[{"poster":"Frattaglia","date":"2016-07-06T10:29:34.904+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Zedant,realm=EUW,application-id=MJVj50Jw,discussion-id=a3L6z9ep,comment-id=000a0000,timestamp=2016-07-06T09:20:51.179+0000)\n>\n> se non ti diverti non giochi e basta,surrendare e brutto perche porta un bruttissimo umore,specialmente alle persone ch enon vogliono e si trovano costretti a giocare premade con un amico che non surrenda a caso per non dover fin ire ogni game al minuto 20.\n\nA TE porta un bruttissimo umore. A me il brutto umore lo portano le partite che capisco benissimo non essere vincibili ma che tu vorresti farmi continuare a giocare. \nNon dare per scontato che quello che vale per te valga anche per gli altri, proprio per quello c'è una votazione che richiede una grossa maggioranza.","replies":[{"poster":"Zedant","date":"2016-07-06T14:25:20.567+0000","up_votes":2,"down_votes":2,"body":"Non dare per scontato che quello che vale per te valga anche per gli altri, proprio per quello c'è una votazione che richiede una grossa maggioranza.","replies":[{"poster":"Frattaglia","date":"2016-07-06T15:28:22.675+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Zedant,realm=EUW,application-id=MJVj50Jw,discussion-id=a3L6z9ep,comment-id=000a000000000000,timestamp=2016-07-06T14:25:20.567+0000)\n>\n> Non dare per scontato che quello che vale per te valga anche per gli altri, proprio per quello c&#x27;è una votazione che richiede una grossa maggioranza.\n\nGuarda che sei tu che insulti chi vuole la possibilità di finire prima alcune partite, non io che insulto chi costringe gli altri a continuare partite che non vogliono continuare.\n\nCito testualmente:\n**Surr di mer a?**\n\nAltri motivi per qui dovrebbe esserci questa **opzione inutile**? io non ne trovo dite voi.\n\n\nSe vuoi continuare a giocare basta che voti no al surrender, senza venire qui a lamentarti con questi toni. Te li ho sottolineati in grassetto, così magari te ne accorgi.","replies":[{"poster":"Zedant","date":"2016-07-07T07:54:02.263+0000","up_votes":2,"down_votes":2,"body":"Surr di mer a''Punto interrogativo''\nIl post era tutto una domanda sul senso del esistenza di questo commando che vieni abusato costantemente","replies":[]}]}]}]}]}]},{"poster":"HaIIeIujah","date":"2016-07-05T16:48:58.667+0000","up_votes":4,"down_votes":1,"body":"Ovviamente a non perdere tempo in game unidirezionali.\nSe il team nemico è avanti di 12k Gold a 20 minuti e siete tutti ad un elo in cui sapete almeno giocare, la partita è persa senza appello. Probabilmente puoi stallare e rendergli il gioco difficile, ma perderei comunque a 40 minuti. Idem se c'è un afk nel tuo team.\nPiuttosto che sprecare 20 minuti, puoi iniziarne un' altra in cui hai la possibilità di vincere. Nel complesso ti permette di giocare piu' partite.","replies":[{"poster":"Zedant","date":"2016-07-05T19:36:31.696+0000","up_votes":2,"down_votes":3,"body":"No e brutto,perche se tu pensi di aver perso hai veramente perso.","replies":[{"poster":"HaIIeIujah","date":"2016-07-06T01:19:32.092+0000","up_votes":2,"down_votes":0,"body":"Ad un livello decente di abilità puoi prevedere la sconfitta dalla gold lead. Se poi in bronze/Silver/gold è una throwfest è un altro paio di maniche, ma lascia il surrender dove serve. Questn on è un anime.","replies":[]}]}]},{"poster":"Player A","date":"2016-07-06T08:53:30.282+0000","up_votes":2,"down_votes":0,"body":"Se ti diverti giochi, ma se pensi di non divertirti più surrendi, mi pare che questo sia un concetto ancora più semplice, però la cosa che non capisco sono i due surr al min 3, come si fa a surrendare al minuto 3??????","replies":[{"poster":"Killer SurpRyze","date":"2016-07-06T08:57:04.093+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SeraphemL,realm=EUW,application-id=MJVj50Jw,discussion-id=a3L6z9ep,comment-id=000b,timestamp=2016-07-06T08:53:30.282+0000)\n>\n> Se ti diverti giochi, ma se pensi di non divertirti più surrendi, mi pare che questo sia un concetto ancora più semplice, però la cosa che non capisco sono i due surr al min 3, come si fa a surrendare al minuto 3??????\n\nremake","replies":[]},{"poster":"Zedant","date":"2016-07-06T09:18:22.673+0000","up_votes":1,"down_votes":3,"body":"Se non ti diverti giochi finendo velocemente oppure andando afk,pero rompere alle altre persone non mi sembra sia buono","replies":[{"poster":"Player A","date":"2016-07-06T09:51:57.053+0000","up_votes":1,"down_votes":1,"body":"infatti con queste persone puoi tranquillamente silence e poi lo reporti, nell'ultimo mese ho ricevuto 7-9 messaggi di ringraziamento dalla riot per le restrizioni, continua così e la riot ti ringrazierà. (Non ci guadagno nulla se non un banner che ogni tanto scambio per \"sei stato disconnesso\" ma non è male vedere che i propri bann non siano così inutili).","replies":[]}]}]},{"poster":"wellyT93","date":"2016-07-06T00:13:42.614+0000","up_votes":1,"down_votes":0,"body":"Tu dici di rimuovere il surrender, ed io dico che se non esistesse la dynamicQ proporrei di abbassare i voti necessari per surrendare a 3/5 invece che 4/5. \nPunti di vista.","replies":[{"poster":"Zedant","date":"2016-07-06T09:22:00.247+0000","up_votes":2,"down_votes":1,"body":"uguale,perche tanto...","replies":[]}]},{"poster":"iDelta","date":"2016-07-05T18:23:13.199+0000","up_votes":2,"down_votes":1,"body":"Avere tutti i nemici sotto il nexus alleato quando non hai distrutto nemmeno una torre, non ti sembra il caso di surrendare?","replies":[{"poster":"Zedant","date":"2016-07-05T19:35:38.633+0000","up_votes":2,"down_votes":2,"body":"Diciamo di no!\nLasciare che finiscano e veramente malvaggio,rischi il ban.","replies":[]}]},{"poster":"I Homura I","date":"2016-07-05T17:01:32.008+0000","up_votes":2,"down_votes":1,"body":"I più belli sono i surrender in aram. E surrendano davvero.","replies":[]},{"poster":"Player A","date":"2016-07-06T09:44:19.053+0000","up_votes":1,"down_votes":2,"body":"in poche parole, in situazioni tipo, la tua squadra è formata da 5 aatrox contro 5 dannatissimi teemo, surrendi se vedi che non hai nemmeno un inibitore o tantissimi gold al min 40 ma anche prima. Perché aatrox è useless e un fungo ti schiatta tutta la colonia di campioni.","replies":[{"poster":"Darkinknight","date":"2016-07-06T10:09:19.225+0000","up_votes":1,"down_votes":0,"body":"{{item:3139}} +{{item:2043}} {{item:3364}}  e i teemo possono solo piangere contro aatrox che lo smaciulla in 3aa","replies":[{"poster":"Player A","date":"2016-07-06T10:23:58.023+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Hellknight1994,realm=EUW,application-id=MJVj50Jw,discussion-id=a3L6z9ep,comment-id=000c0000,timestamp=2016-07-06T10:09:19.225+0000)\n>\n> {{item:3139}} +{{item:2043}} {{item:3364}}  e i teemo possono solo piangere contro aatrox che lo smaciulla in 3aa\n\nteemo ti kita non puoi inseguirlo, e poi torna per farti danno magico con la q, non puoi né inseguirlo né perdere tempo a distruggere i funghi e poi figuarati se il team si prende tutta quella roba. Aatrox ora come ora è il peggior champ mi sa, in early midgame va bene ma in late serve a poco.","replies":[{"poster":"Darkinknight","date":"2016-07-06T20:28:51.005+0000","up_votes":1,"down_votes":0,"body":"Io ce l'ho come 2 main,teemo è uno dei matchup piu facili che trovo (dopo il 6)..non devi mica inseguirlo,ha la q..gli balzi addosso knock up,ulti,il 3 aa gia stakkato per il danno x2 ed è esploso..nel late {{item:3139}}  solo perche il blind puo risultate rognoso,in piu ti aumenta la ms..fa fatica vs teemo solo pre 6,da li in poi è strada spianata..aatrox ha talmente tanta as che gli bastano 2 secondi per distruggerti tutti i funghi in zona, e cosi tanto sustain che il kite di teemo manco lo sfiora,{{item:3364}}  serve solo per vedere se vosa c'è nascosto in una zona dove non sei stato..personalmente manco lo faccio dato che dopo la prima kill teemo me lo trovo praticamente sempre morto","replies":[]}]}]}]}]}