{"poster":"xKakashi","date":"2017-01-11T02:18:31.445+0000","title":"PBE Account disabled !?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I saw the warwick update on live , and when i want to log in on pbe account to test him , booom , PBE account currently disabled !\r\nWhat is happening !? I have this account since 2 years","replies":[{"poster":"Targons Blade","date":"2017-01-11T03:21:06.711+0000","up_votes":3,"down_votes":0,"body":"Is this a really old PBE account (2013 era) or a newer PBE account? Older PBE accounts were disabled when we moved over to the new system. I can look into this if you can provide the Summoner Name of your PBE account.","replies":[{"poster":"Crett","date":"2017-01-11T12:43:16.241+0000","up_votes":1,"down_votes":0,"body":"This also happened to me; I'm pretty sure my account isn't from 2013, and the PBE status says \"Get to testing!\" but it's disabled\nMy PBE username is the same.\nDid my account just get cycled out? I was confused because of the PBE signup status not telling me what's going on","replies":[{"poster":"Targons Blade","date":"2017-01-11T23:13:39.223+0000","up_votes":2,"down_votes":0,"body":"I took a look at your PBE account in our system and it seems we'll need you to reach out in a [**support ticket**](https://support.riotgames.com/hc/en-us/requests/new) in order to sort your issues out. One of our specialists will reach back out to you as soon as possible.\n\nLet me know if you have any questions.","replies":[{"poster":"Monkey D Luffy","date":"2017-02-03T13:48:42.752+0000","up_votes":1,"down_votes":0,"body":"Hi, I understand this is super late but please help me out as my PBE account is saying it's disabled too! It's after 2013, It just says to contact Riot support but I can't log on with it, it just says those details aren't found :( The username is **[REDACTED]**.","replies":[]},{"poster":"Crett","date":"2017-01-12T05:25:50.330+0000","up_votes":1,"down_votes":0,"body":"Would I put that under technical issues or account recovery?\nEDIT: Ah, just occurred to me that it should probably not be in account recovery, but I already submitted the ticket lmao","replies":[]}]}]},{"poster":"DontDeserve","date":"2017-01-25T00:39:39.633+0000","up_votes":1,"down_votes":0,"body":"This also happen to me, the account is new. It is about 2 month.","replies":[{"poster":"Banerokid","date":"2017-02-05T03:28:32.480+0000","up_votes":1,"down_votes":0,"body":"The same thing happened to me after the change. I had the account in early season 6, and i thought it was just a mistake, soon to be fixed. If you could fix this i would be very appreciative.","replies":[]}]}]},{"poster":"Fatboi555","date":"2017-10-14T01:42:53.931+0000","up_votes":1,"down_votes":0,"body":"Please help my acct isn't really old but I would appreciate if someone could fix this problem please and thank you!\nMy account username is epicair21","replies":[]},{"poster":"SEIFANDO almas","date":"2017-10-10T22:22:09.294+0000","up_votes":1,"down_votes":0,"body":"My account is telling This account is currently disabled please contact our support to recover the account           how to resolve if you do not log in","replies":[]},{"poster":"thekiller56","date":"2017-09-27T09:18:01.572+0000","up_votes":1,"down_votes":0,"body":"Same thing here, just wanted to log in today and it told me that its disabled","replies":[]},{"poster":"the malte1","date":"2017-09-10T15:37:59.663+0000","up_votes":1,"down_votes":0,"body":"ït also happened to me and i dont believe it is that old.username is bass2play and summoner name is ALG SPECTROWATCH pls fix it.","replies":[]},{"poster":"1NicoNicoNii1","date":"2017-09-03T11:32:59.002+0000","up_votes":1,"down_votes":0,"body":"My PBE Account is also disabled, i had it after 2013 and my username is ZWzzuperZ, help would be appreciated","replies":[]},{"poster":"A Flying Toaster","date":"2017-08-19T16:01:49.065+0000","up_votes":1,"down_votes":0,"body":"help my acc is from 2017 or 2016 and it says its disabled and i cant login to pbe page (pbe boards)","replies":[]},{"poster":"ß e e r","date":"2017-08-19T04:10:49.412+0000","up_votes":1,"down_votes":0,"body":"Help! It says my pbe account is currently disabled? What does that mean?? My ign is K I N J A Z for pbe. I was on a few weeks ago but not its disabled.{{champion:122}}","replies":[]},{"poster":"XayahCanFly","date":"2017-08-11T15:25:49.226+0000","up_votes":1,"down_votes":0,"body":"Same for me my acc got disabled and i have it from like 2 months or something my ign is Dutzanu Power can somebody help me?\n{{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"urmomspus","date":"2017-08-09T01:31:46.600+0000","up_votes":1,"down_votes":0,"body":"Same thing here went on to go play URF and it said my account was disabled. I would like some help if there is, Thank You.","replies":[]},{"poster":"Soddyz","date":"2017-08-02T04:50:23.337+0000","up_votes":1,"down_votes":0,"body":"same with me.. not sure when the account was created tho :/ same name as this acc","replies":[]},{"poster":"rainbow dashes 1","date":"2017-03-02T14:19:25.841+0000","up_votes":1,"down_votes":0,"body":"It happened to me too can you also help me?","replies":[]},{"poster":"sun18","date":"2017-10-19T14:20:17.038+0000","up_votes":0,"down_votes":1,"body":"my account got disabled too，I did nothing to my pbe account, just didn't log in to that account for 5 days. my summoners name is Emilia is my waifu, can u fix this?","replies":[]}]}