{"poster":"HiKewne","date":"2015-11-03T15:36:58.437+0000","title":"Cambios a los \"bloqueos\"","subforum":"Charlas Generales","up_votes":7,"down_votes":1,"body":"Scarizard has noted that Dodge (Jax Counterstrike), Block (Pantheon Aegis of Zeonia), and Blind (Teemo Blinding Dart) will &quot;interact different lwtih many of the games&#039; on-hit and spell-attacks in 5.22 and on.\nEXAMPLES: Pantheon&#039;s shield will stop effects attached to auto attack that is blocked, Pantheon shield will block a stack of TK passive (source) , Jax E can block auto attack based CC like Udyr Bear or Leona Q,  Nasus Q blocked by Blinds/Jax E/Pantheon Shield (source) , etc\n\nScarizard ha hecho una nota que Esquivar (El contra ataque de jax), Bloquear (El Aegis de Zeonia de Panth), y el Cegar (El dardo cergador de Teemo) van a &quot;interactuar diferente con varios de los efectos de golpe y habilidades en ataques&quot; en la versi&oacute;n 5.22 y siguientes.\nEJEMPLO: El escudo de Pantheon va a detener efectos adicionados a un autoataque que es bloqueado, el escudo de Pantheon va a bloquear un stack de la pasiva de Tahm Kench, la E de Jax puede bloquear CC basados en el autoataque como el oso de Udyr o la Q de Leona, la Q de nasus bloqueada por los los efectos de Cegar/la E de Jax/El escudo de Pantheon, etc.\n\nY bueno, nada, eso. Lo sorprendente es que les haya tomado 6 temporadas en hacer esos cambios {{champion:131}}","replies":[{"poster":"Ascalius","date":"2015-11-03T22:12:45.323+0000","up_votes":1,"down_votes":0,"body":"justo lo que le faltaba a jax para aguantar el early a {{champion:58}} {{champion:86}}","replies":[]},{"poster":"Sir Axolotl","date":"2015-11-03T16:13:49.037+0000","up_votes":1,"down_votes":0,"body":"Es verdad tardaron bastante tiempo en hacer estos cambios.","replies":[]},{"poster":"ZanahoriaAsesina","date":"2015-11-03T16:10:08.410+0000","up_votes":1,"down_votes":0,"body":"Iba a hacer una broma sobre openenglish pero me di cuenta que estaba bien traducido (?\n\nGracias por la info +","replies":[]},{"poster":"Malkazsk","date":"2015-11-03T21:49:46.282+0000","up_votes":1,"down_votes":1,"body":"ohhh por fin :O counter nasus late captain teemo on duty","replies":[]}]}