{"poster":"BigPatata00","date":"2016-01-21T22:52:45.715+0000","title":"Il ragionamento della Riot","subforum":"Discussioni generali","up_votes":2,"down_votes":4,"body":"Ci stavo pensando da un po, e vedendo le molte lamentele sull&#039;hard reset penso che non sia in bug:\nLa Riot ha da poco aggiunto il sistema della vittoria nelle qualificazioni, se non avesse fatto un hard reset tutte le persone che hanno guadagnato mmr durante la preseason e leghe grazie alla vittoria automatica sarebbero salite tutte in gold, e mi sembra di capire che a fine season c&#039;erano quasi piu gold che bronzi per la vittoria automatica nella promo.\nQuindi il ragionamento &egrave;: Benissimo, vuoi avere le promotion pi&ugrave; facili? Ok , per&oacute; ti mettiamo molto piu in basso.\nSecondo me &egrave; anche giusto, perch&egrave; con la vittoria in promo automatica fino al gold 1 e tro fine season molta piu gente sarebbe salita in gold e praticamente un gold 3 della season 6 varrebbe come un silver 4 della 5 (giusto per dire), sovrappopolando il gold e il platino, con il diamond che non varrebbe piu cos&igrave; tanto.\nVoi che ne pensate ? (No flame, se vi fa schifo non scrivetelo con toni pesanti)\nEdit: mi sono dimenticato di mettere nel sondaggio anche : È buggato, magari poi si aggiusta.","replies":[{"poster":"Suff3r1ng","date":"2016-01-23T09:48:18.357+0000","up_votes":1,"down_votes":0,"body":"Ora che sto smaltendo l'incazzatura (6v4p uno dei miei risultati migliori nelle stagioni) sono arrivato alla conclusione che è stata la cosa migliore, dopo la pre-season tanti e dico TANTI giocatori hanno aumentato il loro rank grazie a molti fattori, io sono il primo.\n\nQuesta è la season in cui veramente chi merita di salire potrà arrivare in alto. però dall'altro canto deve esserci Riot che banna chi deve bannare senza tanti scrupoli. Parlo di giocatori che hanno un frequente tasso akf in game e troll le cose molto fastidiose penso per tutti.","replies":[]},{"poster":"kernel panic","date":"2016-01-23T08:50:42.766+0000","up_votes":1,"down_votes":0,"body":"La domanda è: se tutti i platino stanno finendo gold e silver e i gold silver e bronze, i bronze dove sono finiti?","replies":[{"poster":"Suff3r1ng","date":"2016-01-23T09:39:06.286+0000","up_votes":1,"down_votes":0,"body":"Riot è conosciuta per il commercio di schiavi ;) gli schiavi erano tutti bronzi!","replies":[]}]},{"poster":"ELANGRY442","date":"2016-01-22T06:24:29.638+0000","up_votes":1,"down_votes":0,"body":"Puó essere piú che giusto ma se uno ne vince 10 e ne perde 0,li dovete farlo salire di rank mi dispiace ma ributtarlo a silver V non va mica bene.","replies":[{"poster":"GreenInch","date":"2016-01-22T08:12:59.471+0000","up_votes":1,"down_votes":0,"body":"Magari c'è gente che in questo 10w 0L si è fatto carriare pesantemente..boh non so se viene valutata questa opzione.\nFatto sta che ho visto gente che giocava peggio di un bot e che comunque l ha vinto il game","replies":[{"poster":"Whommy","date":"2016-01-22T11:14:06.418+0000","up_votes":1,"down_votes":0,"body":"No puoi fare 20/0 o 0/20 conta solo vittoria e sconfitta, guadagni uguale.\n\nIl fatto, come dicevo già ieri, è che in questo momento le code sono piene di ex bronzi e neo lv30.\nDi conseguenza se vinci guadagni pochissimo, se perdi cali a picco.","replies":[{"poster":"ELANGRY442","date":"2016-01-23T06:25:13.401+0000","up_votes":1,"down_votes":0,"body":"io da bravo giocatore di lol,lv 30 da 2 mesi,me ne sto qui ad aspettare che tutti si facciano le ranked per poi farmi quelle 10 partite dove ci sarà gente che feeda,che insulta e pur vincendone 3 saró silver cosa che non mi so spiegare:cioé i miei amici vanno a bronzo(giocano da 1/2 anni) io che gioco da 6 mesi vado una rank piú alta ;)","replies":[]}]}]}]}]}