{"poster":"Max The Wolf","date":"2018-06-30T07:42:50.927+0000","title":"LA GENTE QUE SE CREE MUY BUENA Y EL TIPO DE EQUIPO QUE TE TOCA","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":13,"body":"la gente que se cree muy buena como si fueran challengers me enferma la verdad entiendo que se puedan agrandar solo por hacerse una buena play y eso pero que lo hagan cuando ellos no hacen nada eso... eso ya es pasarse de bueno a creido CREIDO la gente asi no me gusta siempre son muy agrandados y la gente con la que me toca me enferma bastante porque cuando voy de ADC siempre siempre me tocan &quot;supp&quot; meta mejor dicho MID pero porfavor porque no pueden ser como se trato el juego para eso estan las reglas y ninguno las sigue y aun asi siguen conservando su cuenta que bonito... la verdad esta comunida se caera siempre y todo porque? porque riot los deja hacer lo que quieran LO QUE QUIERAN no se puede jugar tranquilo una por esa gente que encima nisiquiera te ayuda nisiquiera te protege cuando estan en TF pero bueno riot los deja hacer los que quieran por eso digo que tambien RIOT porfvor PORFAVOR fijate mas en los report que en cualquier otra cosa porfavor solo te pido que los veas porque la gente asi sete ira del juego por eso un amigo mio se fue de este juego por la gente como esta que te insulta, que te arruina la partida y que nisiquiera juega solo se deja matar y se van de la partida porfavor solo te pido que te fijes mas en los reportes porfavor eso solo te pido","replies":[{"poster":"Max The Wolf","date":"2018-06-30T07:44:26.153+0000","up_votes":1,"down_votes":1,"body":"no me importa loque digan solo pido que lo lean que lo piensen y digan bien las palabras tambien se que tiene faltas de hortografia pero solo les pido que lo entiendan","replies":[{"poster":"Perturbado2","date":"2018-06-30T10:08:41.201+0000","up_votes":2,"down_votes":0,"body":"No entendi a Qué te referis cuando decir sup meta mejor dicho MID pero porfavor porque no pueden ser como se trato el juego para eso estan las reglas y ninguno las sigue y aun asi siguen conservando su cuenta que bonito...  \nque reglas? A mi parecer vos consideras sup sólo a los healers. El roll de soporte cambio mucho ya no es una obligación para ganar llevar un healer y hypercarry. Otra cosa que  hacen muchos adcs es que creen  que el soporte sólo debe estar con el y protegerlo, lo bueno de este parche es que eso ya no importa, ahora llendo de sup cuando el adc es malo  renta abandonarlo  y ayudar más a las otras líneas.\nOtra cosa, si jugas de adcs tradicionales, juga campeones con movilidad y que sean autosuficientes, así no te preocuparas por que el soporte se vaya o no te proteja.","replies":[]}]},{"poster":"Akeiji","date":"2018-06-30T20:51:43.441+0000","up_votes":1,"down_votes":0,"body":"pues si, ojala se vayan del juego, pero en lugar de des-instalar, vienen al foro y hacen un Crypost.","replies":[]},{"poster":"llsShadowsll","date":"2018-06-30T08:25:35.923+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-lux-2}}","replies":[]}]}