{"poster":"oneshot Vasco","date":"2018-08-08T07:20:45.902+0000","title":"Hilfe für Midlaneimpact","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hey Leute,\r\n\r\nist jemand von euch high diamond und k&ouml;nnte mir ein paar ratschl&auml;ge bez&uuml;glich carrien auf der Mitte geben? Ich habe jetzt seidem ich nach Platin gedropt bin 5 Dia promos gespielt, die letzten 3 habe ich 2-3 verloren. Ich wei&szlig; nicht so richtig wieso ich festh&auml;nge. Ich versuche lanepressure aufzubauen f&uuml;r meinen Jungler, unterst&uuml;tze ihn sofort bei Gegnerkontakt, versuche selber nicht zu sterben. Ich roame viel (Taliyah,TF) und bin objectiv orientiert. Klar hab ich mal n schlechtes Spiel, was ich dann auch verdient verliere, daf&uuml;r gewinne ich aber die Spiele in denen ich gut spiele nicht zwingend :/ Ich wei&szlig;, dass wenn ich gut genug w&auml;re, ich aufsteigen w&uuml;rde (sieht man ja an smurfs), aber ich bin mir nicht im klaren was ich anders machen muss. Die Lane stompen w&auml;re ein anfang, aber ist nicht immer leicht da ich kein assassin spieler bin. Oft sind die anderen lanes bereits verloren bevor die laningphase &uuml;berhaupt endet.\r\n\r\nW&uuml;rde mich freuen &uuml;ber etwaige Ratschl&auml;ge!","replies":[{"poster":"rigged Coinflip","date":"2018-10-05T00:20:07.352+0000","up_votes":1,"down_votes":0,"body":"In Plat/ low Dia kannst du in den meisten fällen games einfach durch gute Calls gewinnen. Wenn du weißt dass man objective xy free bekommen kann, pingen/ im Chat schreiben. Wenn du weißt was eure Win Condition dieses game ist/ wann ihr wo stehen solltet/ jemanden der schlechtes Positioning hat zurückpingst kannst du viele games allein dadurch gewinnen. Calls gewinnen mir (ich bin in plat) extrem viele games","replies":[]},{"poster":"League Of Dota 2","date":"2018-08-08T11:13:00.301+0000","up_votes":1,"down_votes":0,"body":"Wer besser dann gewinnst du auch was\n\nBE HAPPY! xD","replies":[{"poster":"oneshot Vasco","date":"2018-08-08T11:20:56.532+0000","up_votes":1,"down_votes":0,"body":">  Ich weiß, dass wenn ich gut genug wäre, ich aufsteigen würde \n\nJa sagte ich ja bereits :)\naber vielleicht wolltest du auch primitiv fragen \"Wer besser (vallah)?\", die antwort meinerseits wäre daraufhin wohl: ich. :^)","replies":[]}]},{"poster":"Ma1days","date":"2018-08-08T10:39:28.129+0000","up_votes":1,"down_votes":0,"body":"bin zwar aktuell nur gold 2 aber ich hatte das gleiche problem ich war früher schon öfters gold 2 und bin rein vom gefühl besser geworden\ntrotzdem bin ich vor wenigen wochen nicht aus gold 5 raus gekommen und durch tilt war ich sogar kurz vor dem absteigen \ndann hab ich meine lane und championpool geändert und damit auch meinen spielstile (von mid oder adc hypercarrys zu elise) und ich bin mit mehr spas an die rankeds gegangen und jetzt bin ich nach 2 oder 3 wochen kurz davor gold 1 zu kommen\n\nmeine tipps also:\n1. mach dir keinen druck\n2. hab spas\n3. veränder vielleicht deinen championpool mit champs die dir spas machen oder vielleicht besser in die meta passen","replies":[{"poster":"oneshot Vasco","date":"2018-08-08T10:44:37.767+0000","up_votes":1,"down_votes":0,"body":"also ich habe keinen druck und hab eigentlich auch echt spaß, solange ich selber gut performe :D die 3 promos hintereinander waren nur etwas frustrierend. mit den champs bin ich auch schon am überlegen! bloß die sache ist in fast dia dass ich da schon meine mains spielen muss. einfach champs auf die ich lust habe wird nicht sauber funktionieren da man sich zu sehr auf das microgameplay konzentrieren muss. ich bleibe bei meinen high WR champs und schaffe es jetzt vielleicht bei der nächsten promo :D\n\ndanke dir für deine antwort!","replies":[]}]}]}