{"poster":"Im a Black Ninja","date":"2019-07-20T22:10:54.782+0000","title":"Wieso ist es so ?","subforum":"Spielerverhalten & Moderation","up_votes":5,"down_votes":9,"body":"Hallo,\r\n\r\nkann es einfach nicht verstehen. Ich gebe wirklich mein bestes, wenn einer mal oder zwei feeden gar kein problem versuche denen zu helfen, weil ich feede auch mal. Gerade eben hatte ich einen vorfall. Bin in der Mitte spiele seriös, kommt mein Jungler (Twitch dieser Bastard) Early Game bin Lvl 4 riesen Großer Wave vor mir, steht der neber mir und wartet. Er stealt alle Exp und darraufhin smitet er auch noch den Canon. Dafür habe ich wirklich keine Nerven. Wieso soll ich das Spiel weiterspielen und gas geben  ?? Soll er wirklich gewinnen ? Hat er es wirklich verdient ? Da verliere ich lieber ganz ehrlich ! Wieso tuht Riot nix dagegen ? Wieso tuht Riot nicht diese ganzen zurückgebliebene menschen in einem Topf werfen so dass sie immer gegeneinander spielen und die Leute die das spiel ernst nehmen immer zusammen spielen ! Für was hat man ein Honor Level was bringt es mir wenn ich Lvl 4 bin  und immer noch mit solche Leute zusammen spielen muss ? Ist es in allen Ligen so hat das spiel kein Niveau ?","replies":[{"poster":"Angel Ayume","date":"2019-07-20T22:33:35.298+0000","up_votes":5,"down_votes":4,"body":"Ich verstehe, dass dich das aufregt und das auch zurecht. Ich als Midlaner würde da auch bis zum Mond tilten. Aber ich würde deswegen niemals afk gehen oder für eine Niederlage spielen. \n\nWarum auch? Ich will mir doch nicht mein eigenes Spiel kaputt machen, wegen einem Spieler, den ich nie wieder sehen werde. Außerdem würde ich damit ja auch meine anderen Teammates bestrafen, die absolut nichts für das miese Verhalten vom Twitch können. \nVersuche dich mal in die Lage der Botlane zu versetzen, wenn da der Midlaner afk geht, vllt trollt und nur noch kacke spielt, damit ein Spieler das Game verliert. Wie würdest du dich als völlig Unbeteiligter da fühlen? Fändest du das fair?","replies":[{"poster":"Bananenschnder","date":"2019-07-20T22:44:46.789+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=0003,timestamp=2019-07-20T22:33:35.298+0000)\n>\n> Ich verstehe, dass dich das aufregt und das auch zurecht. Ich als Midlaner würde da auch bis zum Mond tilten. Aber ich würde deswegen niemals afk gehen oder für eine Niederlage spielen. \n> \n> Warum auch? Ich will mir doch nicht mein eigenes Spiel kaputt machen, wegen einem Spieler, den ich nie wieder sehen werde. Außerdem würde ich damit ja auch meine anderen Teammates bestrafen, die absolut nichts für das miese Verhalten vom Twitch können. \n> Versuche dich mal in die Lage der Botlane zu versetzen, wenn da der Midlaner afk geht, vllt trollt und nur noch kacke spielt, damit ein Spieler das Game verliert. Wie würdest du dich als völlig Unbeteiligter da fühlen? Fändest du das fair?\n\nWenn ein Spieler entscheidet, zu griefen, dann ist das Spiel eh schon gelaufen. Da wäre es mir auch als botlaner völlig egal. Dann geh ich auch afk und reporte halt den jungler.\n\nIch möchte gerne das Spiel spielen, aber das ist mir nicht möglich, wenn ein anderer Spieler alles daran setzt , dass ich eben ncht das Spiel spielen kann.","replies":[{"poster":"Angel Ayume","date":"2019-07-20T23:32:50.749+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Bananenschnder,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=00030001,timestamp=2019-07-20T22:44:46.789+0000)\n>\n> Wenn ein Spieler entscheidet, zu griefen, dann ist das Spiel eh schon gelaufen. Da wäre es mir auch als botlaner völlig egal. Dann geh ich auch afk und reporte halt den jungler.\n\nDu fängst also an das Spiel absichtlich scheiße zu spielen, nur weil er dir einmal auf den Schlips getreten ist? Klar, das Verhalten vom Twitch war sicher nicht gut, aber deines wäre kein Stück besser, wenn du dich genau so verhältst. Wenn du da eine Strafe verlangst, kannste dich gleich mit bestrafen lassen. \n\n> \n> Ich möchte gerne das Spiel spielen, aber das ist mir nicht möglich, wenn ein anderer Spieler alles daran setzt , dass ich eben ncht das Spiel spielen kann.\n\nDu kannst das Spiel spielen. Musst dich halt nicht komplett triggern lassen und darauf reagieren, wie nen trotziges kleines Kind. \nEine erwachsene Reaktion wäre ihn machen zu lassen und dennoch das beste aus dem Spiel zu machen. Eventuell kann man auch noch höflich versuchen ihm ins Gewissen zu reden. ^^","replies":[{"poster":"Bananenschnder","date":"2019-07-21T06:52:37.804+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=000300010000,timestamp=2019-07-20T23:32:50.749+0000)\n>\n> Du fängst also an das Spiel absichtlich scheiße zu spielen, nur weil er dir einmal auf den Schlips getreten ist? Klar, das Verhalten vom Twitch war sicher nicht gut, aber deines wäre kein Stück besser, wenn du dich genau so verhältst. Wenn du da eine Strafe verlangst, kannste dich gleich mit bestrafen lassen. \n\nEr ist mir in dem Szenario nicht \"auf den Schlips getreten\", sondern hat aktiv meine lane geintet. Das Szenario ist vom Goldwert so oder noch größer, als wäre der Jungler einfach meine Lane runtergerannt.\nWenn jemand meine lane intfeedet - und damit meine ich nicht, dass er einen Gank verkackt, sondern aktiv runter läuft, obwohl er sich völlig bewusst ist, dass er gerade meine Lane intet, dann ist es mir auch einfach nicht mehr möglich, das Spiel zu spielen. Ich sehe es nicht ein, weiter zu spielen, wenn ein anderes Teammitglied absichtlich verhindern will, dass ich das Spiel spielen kann.\n\nEine Ausnahme ist es vielleicht dann, wenn der Spieler wirklich neu ist und ihm nicht bewusst ist, was er tut. Aber wer mindestens Silber+ ist, hat bei so einem Play keine Ausrede. Der trollt/grieft hier einfach mit Absicht.\n\n> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=000300010000,timestamp=2019-07-20T23:32:50.749+0000)\n>\n> Du kannst das Spiel spielen. \n\nWenn jemand einfach runter läuft, damit mich behind setzt und das Spiel sowieso 4v5 ist, weil einer trollt, dann kann ich nicht mehr das Spiel spielen.","replies":[{"poster":"Angel Ayume","date":"2019-07-21T09:10:08.156+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Bananenschnder,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=0003000100000000,timestamp=2019-07-21T06:52:37.804+0000)\n>\n> Er ist mir in dem Szenario nicht \"auf den Schlips getreten\", sondern hat aktiv meine lane geintet. Das Szenario ist vom Goldwert so oder noch größer, als wäre der Jungler einfach meine Lane runtergerannt.\n> Wenn jemand meine lane intfeedet - und damit meine ich nicht, dass er einen Gank verkackt, sondern aktiv runter läuft, obwohl er sich völlig bewusst ist, dass er gerade meine Lane intet, dann ist es mir auch einfach nicht mehr möglich, das Spiel zu spielen. Ich sehe es nicht ein, weiter zu spielen, wenn ein anderes Teammitglied absichtlich verhindern will, dass ich das Spiel spielen kann.\n\nWenn man nach dem Twitch geht, dann hat er nicht geintfeedet. Er hat \"nur\" Exp geleached und das Cannon weggenommen. Das passiert bei nem normalen Gank auch so oft.\n\nWie gesagt, sicher kein gutes Verhalten und für den Midlaner auch keine gute Ausgangssituation aber es ist was völlig anderes als dem Gegner nen Kill oder mehrere zu schenken.\n\nUnd wie gesagt, du bist dann kein Stück besser als der, der damit angefangen hat. \n\nUnd wenn es nur bei dem Expleach und dem Cannonsteal geblieben ist, dann kann man das Spiel immer noch ordentlich spielen. \nOder hörst du auch auf zu spielen oder trollst rein oder kA, wenn der Gegner einen Vorteil hat? ;) \n\n> \n> Eine Ausnahme ist es vielleicht dann, wenn der Spieler wirklich neu ist und ihm nicht bewusst ist, was er tut. Aber wer mindestens Silber+ ist, hat bei so einem Play keine Ausrede. Der trollt/grieft hier einfach mit Absicht.\n\nDie Einstiegselo war immer bei Silber. Weiß nicht, ob das jetzt mit der neuen Elo immer noch so ist, aber wenn ja, kann er dennoch ein Anfänger sein. \n\nNichtsdestotrotz gibt es dir kein Recht genau so zu handeln, nur weil das ein anderer macht. \n\n> \n> Wenn jemand einfach runter läuft, damit mich behind setzt und das Spiel sowieso 4v5 ist, weil einer trollt, dann kann ich nicht mehr das Spiel spielen.\n\nEs gibt dir kein Recht dich ebenfalls daneben zu benehmen, nur weil das ein anderer macht. Unrecht und Unrecht ergibt nun mal kein Recht. \n\nUnd nochmal, wenn es bei einem einzigen Mal bleibt ist das Spiel immer noch genauso möglich zu spielen wie vorher auch. \nOb er jetzt Minions genommen hat oder dem Gegner einen Kill geschenkt hätte. In jedem Fall kannst du das Game normal weiterspielen. \nDas der gegnerische Midlaner mal ahead ist, ist ja nun nicht selten. ^^","replies":[{"poster":"Bananenschnder","date":"2019-07-21T16:04:46.016+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=00030001000000000000,timestamp=2019-07-21T09:10:08.156+0000)\n>\n> Er hat \"nur\" Exp geleached und das Cannon weggenommen. Das passiert bei nem normalen Gank auch so oft.\n\nÄhm... nein?\nBei nem normalen Gank wird minimal XP geleechet und dazu, dass der jungler ausversehen CS nimmt, kommt es überhaupt nur dann, wenn der Gank erfolgreich war oder der jungler dem laner helfen muss, einen reset zu kriegen. Aber auch dann ist es allgemein als \"oh fck sry\" play zu werten, wenn der jungler tatsächlich die last hits kriegt beim pushen.\n\nDabei kriegt er aber auch nie ne gestackte Wave an Xp und dass er die cannon smitet, passiert schon mal gar nicht bzw. ist das dann halt wirklich troll.\n\n> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=00030001000000000000,timestamp=2019-07-21T09:10:08.156+0000)\n>\n> Wie gesagt, sicher kein gutes Verhalten und für den Midlaner auch keine gute Ausgangssituation aber es ist was völlig anderes als dem Gegner nen Kill oder mehrere zu schenken.\n\nJa es ist etwas anderes. Tatsächlich ist es sogar noch schlimmer.\nEin level gibt dir, je nach champion, so circa 500-600 Gold an base stats; der zusätzliche Damage vom zusätzlichen Skillpunkt nicht mit eingerechnet. Dazu wurden nochmal circa 100 Gold an Minions geklaut. Also effektiv, gemessen an Gold und der daraus resultierenden *gefühlten* Stärke im matchup, hat der jungler in dieser Situation seinen Laner zweimal getötet.\n\nNoch schlimmer ist, dass der Level 6 powerspike beim Gegner plötzlich deutlich schneller kommt und auch item powerspikes beschleunigt sind. Außerdem wurde dem Gegner noch dazu ein slowpush geschenkt, was alle Probleme noch wesentlich verschlimmert und womöglich das matchup komplett verliert (mir fällt hier gerade auf, dass ich die ganze Zeit dachte, es ginge um Toplane, wo der Einfluss auf das wave management deutlich größer ist als Mid).\n\n\n> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=00030001000000000000,timestamp=2019-07-21T09:10:08.156+0000)\n>\n> Und wenn es nur bei dem Expleach und dem Cannonsteal geblieben ist, dann kann man das Spiel immer noch ordentlich spielen. \n> Oder hörst du auch auf zu spielen oder trollst rein oder kA, wenn der Gegner einen Vorteil hat? ;) \n\nNaja der hier vergebene Vorteil an den Gegner ist halt massiv, wie oben vorgerechnet.\n\nAber ich gebe zu, mein ursprünglicher Post ist definitiv übertrieben. Wenn es bei einem solchen Vorfall bleibt, würde ich wahrscheinlich noch nicht afk gehen. Nur wenn er konsequent so Sachen abzieht.\nIrgendwie bin ich mental immer davon ausgegangen, dass er dann auch so weiter macht. Aber wenn er das nur einmal macht, um mir mal nen Mittelfinger ins Gesicht zu hauen, danach aber normal weiterspielt, würde ich wohl damit leben.","replies":[{"poster":"Angel Ayume","date":"2019-07-21T18:21:37.139+0000","up_votes":2,"down_votes":0,"body":"Mag sein, dass der Vorteil für den Gegner enorm ist und das dieser auch durch pure Absicht entstanden ist, aber es gibt genug Situationen in denen der Gegner viele Vorteile bekommen hat. Entweder durch nen Gank bei dem du stirbst oder weil der Gegner roamed und sich dort seine Kills holt. \n\nIch hatte schon Games wo ich plötzlich einer 6/0 LeBlanc gegenüber stand. Sie hat zwar dadurch Farm gemisst war goldtechnisch aber immer noch weit ahead.  Da gehst du doch auch nicht einfach afk, nur weil der Gegner sehr stark ist O.o \nDer einzige Unterschied ist nur, dass das eine durch Absicht entstanden ist und das andere nicht.\n\nIch gebe aber zu, dass es schwer ist ein Game zu gewinnen, wenn ein Teammitglied dauerhaft absichtlich schlecht spielt. \nDu verbesserst die Situation aber nicht und machst es nur noch schlimmer, wenn du dann auch noch afk gehst... :/ \nIch kann den Grund verstehen, richtig bleibt es dennoch nicht.\n\nAch und was das Cannonminion klauen angeht, ich hab genug Jungler gehabt die einfach über die Lane gelaufen sind und den Cannon gesmitet haben xD Das kommt in lowerer Elo tatsächlich öfter vor. Und auch ne Minute lang im Busch stehrn und auf eine gute Engagemöglichkeit zu hoffen hatte ich bereits öfter. \nAlso ist nicht so, das solche Situationen gar nicht entstehen würden wenn es nicht Absicht ist. \nWer aber gut spielt und nicht bis zum Mond tiltet und dann dementsprechend spielt, kann solche Nachteile wieder rausholen.","replies":[{"poster":"Alpacana","date":"2019-07-21T22:29:34.180+0000","up_votes":1,"down_votes":0,"body":"Wenn ich einen Jungler habe, der keinen Full-Tank spielt bin ich sogar sehr froh wenn er sich meine Lane-XP + Minion/Cannon nimmt.\nDurch die XP-Nerfs im Jungle vor einiger Zeit haben es Jungler ziemlich schwer im Level mitzuhalten und gerade dazu ist Jungle wohl die Rolle, die ziemlich viel Druck auf viele Lanes ausüben kann. Wenn mein Jungler also fed ist bringt es für mich nur Vorteile. \n\nWenn ich selber Jungle spiele pushe ich nachdem ich bei einem Gank den Gegner getötet habe auch die Lane rein, unabhängig davon ob ich Farm bekomme oder nicht. Wenn da eine Lee Sin E mal 6 Minions nimmt dann ist das eben so. Der Lee kann damit verdammt viel anfangen (vor allem aber mit der XP).\n\nKlar, provokativ den Cannon vor der Nase wegsmiten ist jetzt nicht ganz so cool aber wenn es sein muss um die Wave in den Tower zu bekommen ist das das Beste was dir als Laner passieren kann.\n\nWirkliche Full-Tank-Jungler würde ich davon mehr oder weniger ausnehmen. Die brauchen sowieso nicht so viel Gold (die XP aber natürlich trotzdem). Da können die (**wichtig: wenn möglich**) das Gold auch dem Laner überlassen.\n\nIm Endeffekt kommt es ja nur darauf an, dass man das Spiel gewinnt. Da ist es für das Team um einiges besser wenn der Hypercarry Twitch im Jungle früh seine Items bekommt und jedes Gold mitnimmt was er bekommen kann als irgendein Toplaner der im besten Fall damit eine Lane gewinnt. Der Toplaner verliert dadurch ja nichts. Er bekommt nur  ̶n̶̶i̶̶c̶̶h̶̶t̶̶s̶  wenig. Der gegnerische Toplaner dagegen verliert eine oder merere Waves durch den Reset/Tod. Im Endeffekt gehst du als Toplaner also immer noch mit einem Vorteil aus dem Gank, selbst wenn es nur ein paar XP + Assist sind.","replies":[{"poster":"Angel Ayume","date":"2019-07-22T00:06:04.442+0000","up_votes":1,"down_votes":0,"body":"Naja du darfst nicht vergessen, dass du als Midlaner auch ein Carry bist. Ist sicher nicht gut, wenn du als Carry behind fällst weil der Jungler sich deine Exp nimmt und ggnfalls das Minion. \n\nIch bin zwar der Meinung, dass man sich aus so einem Nachteil auch wieder rauskämpfen kann, aber es macht es dir ja nicht einfacher zu carrien. Und wenn der Jungler seinem Carry bewusst Stuff wegnimmt, ist das nicht wirklich von Vorteil, selbst wenn er selbst auch ein Carry ist. \n\nWenn es einfach ums pushen geht, ist es was anderes aber ohne Grund das Cannon zu smiten einfach weil es grad passt macht man nicht.\nMan nimmt dem Jungler ja auch nicht den großen Wolf oder Vogel weg, nur weil es grad passt.","replies":[{"poster":"Alpacana","date":"2019-07-22T10:06:32.620+0000","up_votes":1,"down_votes":0,"body":"> Ist sicher nicht gut, wenn du als Carry behind fällst weil der Jungler sich deine Exp nimmt und ggnfalls das Minion.\n\nStimmt natürlich, aber wie gesagt. Genau genommen fällst du ja nichtmal behind. Dadurch, dass die Wave resetted wirst bekommst du als Midlaner immernoch XP (wenn auch keine Last-Hits), der Gegner verliert aber komplett XP + Last-Hits. Du gehst also immernoch mit einem Vorteil raus. Behind fällst du also keineswegs. Du kommst nur nicht so weit ahead wie du es könntest wenn du es schaffst die Wave ohne die Hilfe des Junglers in den Tower zu bekommen.\n\n> Man nimmt dem Jungler ja auch nicht den großen Wolf oder Vogel weg, nur weil es grad passt.\n\nDoch das sollte man schon tbh. Wenn ich das Pathing meines Junglers erkennen kann und dieser z.B. sowieso nur um Toplane herum spielt (ich gehe gerade davon aus man ist Blueside), dann kann ich schon permanent die Raptoren meines Junglers nehmen. Ist Free Gold/XP was sonst auf der Strecke bleibt.\nSollte man halt nur nicht machen wenn der Jungler vorhat diese in der nächsten Zeit zu clearen.\nWobei es dann auch wieder hart auf den Jungler ankommt. Hast du einen Farm-Jungler (Yi/Karthus etc.) wird er höchstwahrscheinlich den kompletten Jungle so oft wie möglich clearen wollen. In dem Fall würde ich wohl keine Raptoren nehmen.\nSpielt der Jungler aber etwas wie Lee/Nidalee und sitted eine bestimmte Lane (sagen wir jetzt einfach mal Botlane, da es XP-technisch für den Jungler am meisten Sinn machen würde) dann kann ich durchaus permanent als Midlaner die Wölfe nehmen. Genauso kann man als Toplaner auch den Gromp mitnehmen.","replies":[{"poster":"Angel Ayume","date":"2019-07-22T10:31:56.831+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alpacana,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=0003000100000000000000000000000000000000,timestamp=2019-07-22T10:06:32.620+0000)\n>\n> Stimmt natürlich, aber wie gesagt. Genau genommen fällst du ja nichtmal behind. Dadurch, dass die Wave resetted wirst bekommst du als Midlaner immernoch XP (wenn auch keine Last-Hits), der Gegner verliert aber komplett XP + Last-Hits. Du gehst also immernoch mit einem Vorteil raus. Behind fällst du also keineswegs. Du kommst nur nicht so weit ahead wie du es könntest wenn du es schaffst die Wave ohne die Hilfe des Junglers in den Tower zu bekommen.\n\nNicht, wenn der Enemy Midlaner auch auf der Lane ist, der bekommt dann nämlich die volle Exp, muss sie nicht teilen und gegebenfalls auch alle Lasthits. Das funktioniert halt nur, wenn der Gegner nicht auf der Lane ist. Und ich meinte natürlich, wenn der Gegner da ist. Wenn er weg ist, ist es was anderes. \n\n> \n> Doch das sollte man schon tbh. Wenn ich das Pathing meines Junglers erkennen kann und dieser z.B. sowieso nur um Toplane herum spielt (ich gehe gerade davon aus man ist Blueside), dann kann ich schon permanent die Raptoren meines Junglers nehmen. Ist Free Gold/XP was sonst auf der Strecke bleibt.\n> Sollte man halt nur nicht machen wenn der Jungler vorhat diese in der nächsten Zeit zu clearen.\n> Wobei es dann auch wieder hart auf den Jungler ankommt. Hast du einen Farm-Jungler (Yi/Karthus etc.) wird er höchstwahrscheinlich den kompletten Jungle so oft wie möglich clearen wollen. In dem Fall würde ich wohl keine Raptoren nehmen.\n> Spielt der Jungler aber etwas wie Lee/Nidalee und sitted eine bestimmte Lane (sagen wir jetzt einfach mal Botlane, da es XP-technisch für den Jungler am meisten Sinn machen würde) dann kann ich durchaus permanent als Midlaner die Wölfe nehmen. Genauso kann man als Toplaner auch den Gromp mitnehmen.\n\n Ich rede nicht davon, dass du das ganze Camp nimmst, weil der Jungler sowieso nicht da ist und wahrsch. in nächster Zeit auch nicht clearen wird, sondern wenn er grade das Camp selbst macht. Da gehst du auch nicht hin und nimmst ihm währenddessen das Camp weg, nur weil es grad passt. ^^","replies":[{"poster":"Alpacana","date":"2019-07-22T10:40:46.679+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=00030001000000000000000000000000000000000000,timestamp=2019-07-22T10:31:56.831+0000)\n>\n> Nicht, wenn der Enemy Midlaner auch auf der Lane ist, der bekommt dann nämlich die volle Exp, muss sie nicht teilen und gegebenfalls auch alle Lasthits. Das funktioniert halt nur, wenn der Gegner nicht auf der Lane ist. Und ich meinte natürlich, wenn der Gegner da ist. Wenn er weg ist, ist es was anderes. \n\nGut, ich hab mich ausschließlich auf einen erfolgreichen Gank bezogen wo der gegnerische Laner stirbt. Andernfalls gäbe es ja auch keinen Grund die Lane resetten zu wollen (außer dein Laner möchte Base).\n> \n>  Ich rede nicht davon, dass du das ganze Camp nimmst, weil der Jungler sowieso nicht da ist und wahrsch. in nächster Zeit auch nicht clearen wird, sondern wenn er grade das Camp selbst macht. Da gehst du auch nicht hin und nimmst ihm währenddessen das Camp weg, nur weil es grad passt. ^^\n\nNein dann natürlich nicht^^ Das würde mMn schon an Trolling grenzen^^","replies":[{"poster":"Angel Ayume","date":"2019-07-22T12:20:31.268+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alpacana,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=000300010000000000000000000000000000000000000000,timestamp=2019-07-22T10:40:46.679+0000)\n>\n> Gut, ich hab mich ausschließlich auf einen erfolgreichen Gank bezogen wo der gegnerische Laner stirbt. Andernfalls gäbe es ja auch keinen Grund die Lane resetten zu wollen (außer dein Laner möchte Base).\n> \n\nBei einem Gank beschwert sich denke ich niemand, wenn der Jungler hilft die Lane zu pushen und da nen paar Minions nimmt. ^^ \nViele erwarten das ja sogar um eben schneller Base gehen zu können. \n\n> Nein dann natürlich nicht^^ Das würde mMn schon an Trolling grenzen^^\n\nEben und so ähnlich war es ja in dem Szenario vom TE. Twitch steht unsichtbar auf der Lane, leeched die Exp und smited dann wenns passt den Canon weg.","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"611FVNKBlv","date":"2019-07-20T22:47:43.770+0000","up_votes":1,"down_votes":1,"body":"> wegen einem Spieler, den ich nie wieder sehen werde\n\nin meinem fall hab ich die dann so 10x in reihe im team oder teilweise auch noch 1-2 tage später bis das dann ma langsam aufhört ^^\n\nund dann soll man noch bock auf SoloQ haben? Vor allem weil diese Spieler keinerlei Strafe erhalten? \n\nund ne ist zwar nicht fair gegenüber den anderen mates allerdings sehe ich ebenfalls keinen Grund ein game weiterzuspielen das zu 99% verloren ist. damals war das alles n bisschen anders heutzutage würde ich afk in dieser situation vorziehen da league sowieso schon unbalanced af ist erst recht diese season und dann mit 4v5 weitermachen? Dafür ist mir die Zeit zu schade ^^ ","replies":[{"poster":"Angel Ayume","date":"2019-07-20T23:36:39.381+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=611FVNKBlv,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=00030002,timestamp=2019-07-20T22:47:43.770+0000)\n>\n> in meinem fall hab ich die dann so 10x in reihe im team oder teilweise auch noch 1-2 tage später bis das dann ma langsam aufhört ^^\n\nEinfach nicht sofort wieder in die Queue gehen und 1 oder 2 Min warten, dann bekommt man die sicher nicht mehr ins Game. \nkA was du für ne Elo bist, aber in low Elo ist die Wahrscheinlichkeit nahezu bei 0, dass du denselben Spieler 10x mit ins Team bekommst. \n\n> \n> und dann soll man noch bock auf SoloQ haben? Vor allem weil diese Spieler keinerlei Strafe erhalten? \n\nDann spiel es halt nicht, wenn du dich von Nichtigkeiten so hart triggern lässt. ^^ \nBei dem Verhalten von Twitch würde ich mich zwar auch sehr ärgern, aber das wäre maximal für ein Game. ^^ \n\nWie gesagt, wegen einem Schwachmaten lass ich mir nicht das Spiel kaputt machen. \n\n> \n> und ne ist zwar nicht fair gegenüber den anderen mates allerdings sehe ich ebenfalls keinen Grund ein game weiterzuspielen das zu 99% verloren ist. damals war das alles n bisschen anders heutzutage würde ich afk in dieser situation vorziehen da league sowieso schon unbalanced af ist erst recht diese season und dann mit 4v5 weitermachen? Dafür ist mir die Zeit zu schade ^^\n\nJa dann gehört du genau so bestraft wie der Twitch. Beides ist absolut nicht in Ordnung. Einfach aufgeben, nur weil da einer sich falsch verhält geht halt gar nicht. \n\nAußerdem wissen wir doch nicht, ob der Twitch durchgehend so gespielt hat. Der TE hat nur von der einen Situation gesprochen. Deswegen kann direkt afk gehen oder gar anfangen selbst zu trollen wäre absolut kindisch.","replies":[]}]},{"poster":"Im a Black Ninja","date":"2019-07-20T22:40:29.920+0000","up_votes":1,"down_votes":0,"body":"Nein natürlich nicht. Mein Verhalten war auch nicht gut. Ich konnte trotzdem versuchen das Spiel weiter zu spielen. In dem Moment fühlte ich mich hart verarscht. 1 min davor hatte er Probleme mit Enemy Jungler ich bin sofort hin gegangen bin rein geflasht stun ignite bin leider gestorben aber er nicht er hatte sogar ein Kill und darrauf hin macht er sowas.","replies":[{"poster":"Angel Ayume","date":"2019-07-20T23:38:48.785+0000","up_votes":2,"down_votes":1,"body":"Ja mit irgendwas hast du den Twitch wahrsch. getriggert. Weiß Gott womit. \nEinfach drüber hinweg sehen. \nZwar ärgerlich aber was solls? \nDann ist dieses Game vllt halt verloren, dafür gewinnste dann das Nächste. ^^ \n\nEinfach nicht triggern lassen von trotzigen Kindern :)","replies":[]}]}]},{"poster":"Izaya Kumiho","date":"2019-07-20T22:43:10.516+0000","up_votes":5,"down_votes":4,"body":">Hat er es wirklich verdient ? \n\nHast du das Recht über sowas eine Entscheidung zu treffen?\nDa sind noch 3 andere Spieler von deiner Seite und 5 von den Gegnern, die davon betroffen sein würden.\n\n> Wieso tuht Riot nix dagegen ? \n\nSie tun etwas dagegen, wenn du dieses Verhalten nach dem Game meldest. \nDas würde unter \"Inting\" fallen.\n\n\n>Wieso tuht Riot nicht diese ganzen zurückgebliebene menschen in einem Topf werfen [...]\n\n...\nBevor du die Leute als \"zurückgeblieben\" bezeichnest, solltest du dir Gedanken über die Art und Weise machen, wie du mit den Leuten umgehst. \n⁽ᵁᶰᵈ ᵈᵉᶦᶰᵉ ᵀᵉˣᵗᵉ ᵃᵘᶠ ᶠᵉʰᶫᵉʳ üᵇᵉʳᵖʳüᶠᵉᶰ⋅ ᴰᵃˢ ᶦˢᵗ ᶦᵐᵐᵉʳ ʷᶦᶜʰᵗᶦᵍ﹗⁾\n\n\n>Wieso tuht Riot nicht diese ganzen zurückgebliebene menschen in einem Topf werfen so dass sie immer gegeneinander spielen und die Leute die das spiel ernst nehmen immer zusammen spielen !\n\n**A:** Weil man nicht wissen kann, ob diese Leute einen schlechten Tag haben und sonst dieses Fehlverhalten nicht erneut an den Tag bringen würden. (Das rechtfertigt natürlich nicht den Schaden.)\n\n**B:** Weil unsportliches Verhalten nicht gewünscht ist. Nach einem Tempbann sind die meisten Leute in der Lage, ihr Verhalten zu bessern. Eine eigene Queue für \"solche\" Spieler würde keine wirkliche Strafe sein für die, die das Spiel nur zerstören möchten.\n\n>Ist es in allen Ligen so hat das spiel kein Niveau ?\n\nIn Master-Challenger blacklisten sich angeblich einige Leute. \nIch denke, toxisches Verhalten gibt es überall. Das bezieht sich auch nicht nur auf die Elo, sondern auch andere Games.\n\n\n>Für was hat man ein Honor Level was bringt es mir wenn ich Lvl 4 bin und immer noch mit solche Leute zusammen spielen muss ?\n\nDas HL ist für dich selber gedacht. Du bekommst extra Loot und Belohnungen, wenn du immer lieb und ehrenhaft gewesen bist. \nLeute, die ihr HL wegen einer Strafe am Ende der Season gesenkt bekommen haben, würden z.B. sehr wahrscheinlich keine Chance auf die Belohnungen für ihre Elo erhalten.\n \nAllgemein bekommen Spieler mit HL unter Level 2 kein Hextech-Loot. \nDarunter fallen auch Kisten, die du z.B. durch Champions erspielen kannst.","replies":[{"poster":"Im a Black Ninja","date":"2019-07-20T23:02:47.615+0000","up_votes":1,"down_votes":0,"body":"Man ich will einfach das das Spiel ernst genommen wird von jedem einzelnen ich investiere dafür meine Zeit meine wertvolle Zeit ihr auch für was für Spaß für Herausforderungen Wenn es Riot  nach 8Saisons nicht schafft Trolls ( Teemo Jungle) (Janna top) ausm ranked zu filtern  dann sollen sie das Spiel nicht mehr zu Verfügung stellen! Oder wollen sie unsere Zeit klauen indem wir verlieren und mehrere Runden spielen ","replies":[{"poster":"Izaya Kumiho","date":"2019-07-20T23:42:03.358+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Next Onee,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=00040000,timestamp=2019-07-20T23:02:47.615+0000)\n>\n> Man ich will einfach das das Spiel ernst genommen wird von jedem einzelnen \n\nEs ist aber \"nur\" ein Spiel. Und Leute, die absichtlich dir das Spiel versauen, werden doch auch mit einem Bann bestraft. Wo genau ist dein Problem?\n\n>ich investiere dafür meine Zeit meine wertvolle Zeit ihr auch für was für Spaß für Herausforderungen Wenn es Riot  nach 8Saisons nicht schafft Trolls ( Teemo Jungle) (Janna top) ausm ranked zu filtern  dann sollen sie das Spiel nicht mehr zu Verfügung stellen! Oder wollen sie unsere Zeit klauen indem wir verlieren und mehrere Runden spielen\n\njeder sollte spielen dürfen, was er möchte (solange es nicht verlangt, dass alle anderen spieler sich dem playstyle anpassen müssen).\nDu kannst nicht einfach leuten \"verbieten\" teemo jngl zu spielen, nur weil du teemo vielleicht hasst.\n\nDu musst das Spiel nicht spielen, du musst auch nicht ranked spielen. Du bist der Solo/Duo-Queue nicht verpflichtet und kannst auch Flex mit 5 Freunden spielen.\n\nStellst du dich jedoch bewusst in die Sonne für Stunden, solltest du dich über Sonnenbrände nicht wundern.\n\n\nWie kam es überhaupt zu der Reaktion von Twitch? Habe ich den Part überlesen?","replies":[{"poster":"Angel Ayume","date":"2019-07-21T00:13:53.603+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Next Onee,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=00030000,timestamp=2019-07-20T22:40:29.920+0000)\n>\n> 1 min davor hatte er Probleme mit Enemy Jungler ich bin sofort hin gegangen bin rein geflasht stun ignite bin leider gestorben aber er nicht er hatte sogar ein Kill und darrauf hin macht er sowas.\n\nHat er in einem Post erwähnt.","replies":[{"poster":"Izaya Kumiho","date":"2019-07-21T00:14:39.964+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=0004000000000000,timestamp=2019-07-21T00:13:53.603+0000)\n>\n> Hat er in einem Post erwähnt.\n\nund ich fragte mich noch, ob ich diese stelle überlesen hätte. ;P","replies":[{"poster":"Angel Ayume","date":"2019-07-21T00:15:55.566+0000","up_votes":2,"down_votes":2,"body":"Deswegen hab ich dir die Stelle gezeigt. :)","replies":[{"poster":"Izaya Kumiho","date":"2019-07-21T00:17:23.088+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=V2UZrVul,comment-id=000400000000000000000000,timestamp=2019-07-21T00:15:55.566+0000)\n>\n> Deswegen hab ich dir die Stelle gezeigt. :)\n\n...ach. danke.","replies":[]}]}]}]}]},{"poster":"Angel Ayume","date":"2019-07-20T23:44:40.414+0000","up_votes":2,"down_votes":1,"body":"Picks wie Teemo Jungle oder Janna Toplane fallen eben nicht unter Trollen. Riot möchte niemanden vorschreiben, auf welcher Lane sie welche Champions spielen dürfen. \nSonst hätte es ja nie sowas wie Taliyah Jungle oder Aatrox/Irelia Midlane gegeben, oder die Bruiser Botlane Meta. \n\nSowas ist eben kein trollen, solange sie für den Sieg spielen. ^^ \n\nWenn du mit solchen Picks nicht klar kommst musst du entweder dodgen oder die spielst kein Ranked. \nDavon ab gibt es diese Picks ja auch nun nicht ständig","replies":[{"poster":"00 M4ddin 00","date":"2019-07-22T05:58:51.096+0000","up_votes":1,"down_votes":1,"body":"Ausser wenn Riot es doch tut und Spieler bannt die was anderes spielen als normal ^^'","replies":[{"poster":"Angel Ayume","date":"2019-07-22T07:44:08.139+0000","up_votes":1,"down_votes":0,"body":"Wenn du den Teemo Support in der Mitte meinst, dann hatte es andere Gründe. Den Pick ansich hat nicht zu einer Strafe geführt.","replies":[{"poster":"00 M4ddin 00","date":"2019-07-22T11:04:04.431+0000","up_votes":1,"down_votes":0,"body":"Oder den singed sup damals :) \n\nWeil wenn Riot sag sie bannen weil der nicht mit dem Team vorher geredet hat. \n\nDann müsse sehr sehr sehr viele Spieler in meinen games gebannt werden ^^ die machen nur shit ohne es ab zu sprechen ;)","replies":[]}]}]}]},{"poster":"00 M4ddin 00","date":"2019-07-22T05:56:37.844+0000","up_votes":1,"down_votes":0,"body":"Pöse Riot ZWINGT dich einfach das Spiel zu spielen und du kannst rein garnichts dagegen tun :0","replies":[]}]}]},{"poster":"Revilous","date":"2019-07-20T22:27:27.768+0000","up_votes":2,"down_votes":2,"body":"Kann ich vollkommen nachvollziehen. Wurde mal toplane gegankt von meinem Jungler aber konnte nicht followen weil ich gestunnt wurde von Ryze und er mit Phaserush weggerannt ist. Daraufhin flamt mich mein Jungler weil ich nicht gefollowed bin, nimmt die ganze Wave und rennt wiederholt in den gegnerischen Turm und geht dann afk. Riot kann aber meistens nicht erkennen ob ein Spieler wirklich trollt und intet oder nur ein schlechtes Spiel hat. Siehst ja oft genug \"zu unrecht gebannt\" - threads hier im Forum. Meine Idee wäre ja mehr mit dem Honor System zu arbeiten, damit es sich wirklich visuell auszahlt, ein positiver Spieler zu sein der nie reportet wird, weil bisher sind die Belohnungen echt erbärmlich. Ich habe mittlerweile 25 Keys oder so weil ich ein onetrick bin.","replies":[{"poster":"Im a Black Ninja","date":"2019-07-20T22:44:36.885+0000","up_votes":2,"down_votes":0,"body":"Solche gibt es auch","replies":[{"poster":"Revilous","date":"2019-07-21T15:10:31.164+0000","up_votes":1,"down_votes":0,"body":"Ah und gerade wieder, mein ADC stirbt, flamt seinen Support, geht afk, kommt wieder und stirbt 11 mal obwohl wir 4v5 am gewinnen waren. Danach nicht mehr. Und davor waren wir im lategame am gewinnen aber der adc hat meiner evelynn den red buff weggenommen woraufhin die all ihre Items verkauft, 2 mal in die Gegner läuft, afk geht und nicht wieder kommt. Ich verstehe bloß nicht, wieso das nie im Gegnerteam passiert?!?","replies":[]}]}]},{"poster":"AramStufe Rot","date":"2019-07-20T22:30:45.604+0000","up_votes":1,"down_votes":0,"body":"halt dir immer vor augen das online spiele voller idioten sind","replies":[{"poster":"Im a Black Ninja","date":"2019-07-20T22:43:54.519+0000","up_votes":1,"down_votes":0,"body":"Yes","replies":[]}]},{"poster":"Bananenschnder","date":"2019-07-20T22:28:55.547+0000","up_votes":1,"down_votes":4,"body":"Ich würde in der Situation wahrscheinlich afk gehen.\n\n\n\nAber das hilft auf Dauer natürlich nicht, weil man selbst dann ja dafür bestraft wird. Das ist so ne Situation, bei der eben wirklich Menschen über Szenarien drüber schauen müssten, um dann den Jungler zu bestrafen und nicht die Person, die afk geht, weil sie gegrieft wird.","replies":[{"poster":"Im a Black Ninja","date":"2019-07-20T22:42:31.284+0000","up_votes":1,"down_votes":0,"body":"Dannach war ich auch Afk bringt aber nix es löst nicht das Problem","replies":[]},{"poster":"SeaHorseCalamity","date":"2019-07-21T10:21:51.493+0000","up_votes":2,"down_votes":0,"body":"> Aber das hilft auf Dauer natürlich nicht, weil man selbst dann ja dafür bestraft wird. \n\nRichtig\n\n> Das ist so ne Situation, bei der eben wirklich Menschen über Szenarien drüber schauen müssten, um dann den Jungler zu bestrafen und nicht die Person, die afk geht, weil sie gegrieft wird.\n\nKeine Sorge, wenn da ein Rito Mitarbeiter drüber schauen würde, würde der AFK-Spieler ebenfalls bestraft, so wie der Typ, der \"nur\" ein bisschen Exp leeched und ein Minion smited.\n\nAfk-gehen ist wesentlich schlimmer, als ein wenig griefen. Der Twitch kann 1. Mit extra Exp/Gold was anfangen (er ist schließlich ein Lategame-Carry) und so zum Sieg beitragen, auch wenn es nicht die feine Art ist und 2. zerstört er damit nicht das ganze Spiel. \nWenn einer AFK geht ist das Game allerdings (fast) immer gelaufen, das hilft keinem, nicht mal dir selbst. Twitch war hier egoistisch, was man ihm auch vorwerfen kann. Aber wenn man afk geht, kann man halt nichtmal die Ego-Schiene als Ausrede verwenden.","replies":[]}]},{"poster":"kys rito ret4rds","date":"2019-07-24T07:18:27.487+0000","up_votes":1,"down_votes":1,"body":"https://www.quitlol.com","replies":[]}]}