{"poster":"Lagbeard","date":"2016-03-25T18:14:23.603+0000","title":"Mikaels Schmelztiegel","subforum":"Champions & Gameplay","up_votes":7,"down_votes":0,"body":"Hallo Mitbeschw&ouml;rer, \nIch habe mir mel ein Paar Gedanken zu Mikaels Schmelztiegel gemacht. Vorweg: Ich wei&szlig; dass es die Aktive ist, die den Gegensand so stark macht. Allerdings bin ich mit den Stats des Items irgendwie unzufrieden. 40 MR sind Okay, allerdings bekommt man als Supporter recht gut an MR. Den Sinn der 20% Manaregeneration verstehe ich nicht ganz, da es sehr wenig ist und man als Supporter ebenfalls gute Alternativen zum Manahaushalt hat. Aber am seltsamsten finde ich seine Passive - Manaquelle. Auf Athenes Gral ist diese Passive unglaublich gut, gerade in Belagerungssituationen. Allerdings haben Supporter, die viel Mana Verbrauchen, &uuml;ber andere Items schon genug Manaregeneration, die eher Tanky Supporter Kommen ebenfalls gut an feste Manaerh&ouml;hung. \n\nKurz: Ich hatte bisher nie Manaprobleme auf einem Support, f&uuml;r die ich prozentuale Regeneration Gebraucht h&auml;tte. Viele Items f&uuml;r AP-Lastige Supporter besitzen Manaregeneration, die zusammengenommen einen Wert ergibt, mit dem man durchaus gut klarkommt. Die Manaquelle brauche ich de Facto gar nicht. \n\nIch habe nichts gegen die Stats vom Schmelztiegel an sich, f&uuml;r sich genommen sind sie alle (bis auf diese 20% Regeneration) gut. Aber die Zusammenstellung irritert mich stark. Tanky Supporter k&ouml;nnen mit den Stats wenig anfangen, und selbst bei den AP Supportern f&auml;llt mir eigentlich nur Janna ein, zu der diese Stats passen w&uuml;rden. Und auch mit ihr ben&ouml;tigt man nicht eine so hohe Manaregeneration. \n\nVersteht mich nicht falsch, ich will keine besseren Stats auf Mikaels. Nur andere. Welche, die in ein Konzept passen. Im Moment habe ich das Gef&uuml;hl, die H&auml;lfte des Items umsonst zu bezahlen. \nM&ouml;glihckeiten w&auml;ren als defensive etwa Leben draufzugeben. oder zur MR noch R&uuml;stung. Als offensive w&auml;ren etwas AP oder vielleicht sogar 20% CDR m&ouml;glich. Diese Stats m&uuml;ssen nicht hoch sein, mir ist klar, dass es zusammen mit seiner Aktiven schnell zu stark w&uuml;rde. \n\nIm Moment hat er von allem etwas, aber nichts richtig, au&szlig;er Manaregeneration. Und davon zu viel. \n\nAlso w&auml;re mein Wunsch eine &Uuml;berarbeitung dieses Items. Gebt den Stats eine Richtung, und &auml;ndert die Passive. \n\nWas ist eure Meinung? Ich bin echt gespannt, es kann durchaus sein, dass ich etwas &uuml;bersehen habe. \n\nBis dahin, liebe Gr&uuml;&szlig;e, \n\nAeolas","replies":[{"poster":"Evenrider","date":"2016-03-26T12:22:46.022+0000","up_votes":1,"down_votes":0,"body":"Dass Mikaels 100% Mana Reg als Stat gibt, sollte normal sein.\nDenn man kann es schließlich auch vor Ardent Censer oder dem Golditem-Upgrade bauen und dann kann man diese Mana-Reg auch gut gebrauchen.\nDass man mit allen Items zu viel Mana-Reg hat ist dann nunmal so. Mir würde es auch nicht gefallen, wenn Riot dies ändert, indem sie irgendwo die Manaregen entfernt, sonst bin ich schließlich verpflichtet ein anderes Item eher zu bauen.\n\nÜber CDR und MR kann man eigentlich nicht klagen. MR ist nahezu immer hilfreich gegen APler/Supports. Ja selbst gegen Leona. Und bei CDR ist nunmal das gleiche wie bei Mana Reg. Wenn man es bei ein paar Items entfernen würde, würde dies die Flexibilität beim Itembau gefährden, da man als Support meist recht hohe Cooldowns hat und CDR sehr wichtig ist.\n\nDas Item ist schon sehr alt und früher war es nunmal so, dass die Passiven übernommen werden oder in Stats umgewandelt werden, wenn man das Item ausbaut. Die Mana Font Passive braucht man als Support allerdings wirklich nicht.\n\nAn sich ist das Item so in Ordnung. Nur die Mana-Font Passive ist eben nicht mehr vornöten, denn so stark kann man kaum spammen um gegen die Manaregen von Golditem, Mikaels,... anzukommen.\nWenn Mikaels diese Passive verliert wäre es kein Verlust, allerdings sollte sich der Buildpath ändern, da die Items, die aus Charlice gebaut werden, eben auf dieser Passive aufbauen. Und dann wäre da die Frage, was man da macht.\nNoch ein Forbidden Idol? Ginge, wäre aber recht komisch, da es dann aus 2 Forbidden Idols gebaut werden würde und dies wiederum die Mana-Reg Stats auf 120% steigert.\nEinen Fiendish Codex? ein Aether Wisp? Dann hätte man den Buildpath vom Ardent Censer oder vom Morellonomicon, auch nicht so toll.\nWeitere Defensive Stats wie Kindlegem, Giants Belt, Chain West, Negatron Mantle,..., fände ich auch nicht so gut, da es dadurch Tank Champs zu gut stehen würde.\n\nVielleicht noch aus einer Tear. aber dann hätte man wieder Mana...\n\nAuf die Schnelle fällt mir nichts gutes ein um Charlice zu ersetzen.","replies":[{"poster":"Lagbeard","date":"2016-03-26T12:36:52.038+0000","up_votes":1,"down_votes":0,"body":"QSS :D\n\nNein, Spaß. Eventuell könnte man {{item:3024}} +{{item:3114}} Benutzten, um ein Item mit der Mikaels Aktiven, 25 Armor, 25 MR, 10%CDR und 100% Manareg zu bauen. Goldvaluetechnisch wäre das zwar Effizienter (Je nach dem wie man die Passive vom Kelch bewertet), aber die Kosten könnten ja angepasst werden.","replies":[{"poster":"Evenrider","date":"2016-03-27T10:51:13.599+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Aeolas Dustchild,realm=EUW,application-id=Wj1wcocU,discussion-id=OsZGzcpw,comment-id=00010000,timestamp=2016-03-26T12:36:52.038+0000)\n>\n> QSS :D\n> \n> Nein, Spaß. Eventuell könnte man {{item:3024}} +{{item:3114}} Benutzten, um ein Item mit der Mikaels Aktiven, 25 Armor, 25 MR, 10%CDR und 100% Manareg zu bauen. Goldvaluetechnisch wäre das zwar Effizienter (Je nach dem wie man die Passive vom Kelch bewertet), aber die Kosten könnten ja angepasst werden.\n\nDie MR stammen aber auch vom Charlice und würden mit der Passive verschwinden. Weiterhin wäre man bei 20% CDR, wenn man Glacial Shroud und Forbidden Idol kombiniert. und die 250 Mana vom Glacial Shroud dürfen auch nicht wegfallen.","replies":[]}]}]},{"poster":"Yamatox3","date":"2016-03-25T20:49:01.046+0000","up_votes":1,"down_votes":0,"body":"Hallo lieber Beschwörer,\nich, als Support main kann dir auch sagen, dass man auf tank Supports Mikaels nicht wirklich baut, vielleicht bei Thresh. Auf Sona finde ich das Item wiederum ganz gut, da sie sehr viel Mana braucht für ihre Spells und auf anderen Poke/AP Supports finde ich das Item sehr gut, vorallem die Aktive wirkt sehr oft wahre Wunder. Ob man das Item verändern soll, wie du sagtest mit der Rüstung oder vielleicht sogar CDR, wobei ich 20% schon bisschen zu stark fände, müsste man drüber nachdenken. Das Item an sich ist sehr gut, darum würde ich vorschlagen, dass man für tanky Supports ein neues Item herstellt, dass genau die gleiche Aktive hat, aber nur halt der Itemweg und das Item tanky sind. \n\nMfG Yamato {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Lagbeard","date":"2016-03-26T11:11:39.281+0000","up_votes":1,"down_votes":0,"body":"Ich persönliche Spiele Sona gerne mit {{item:3092}} , {{item:3504}} , {{item:3050}}  Ich hatte bisher nie Manaprobleme. Thresh ist ein Sonderfall, da er mit beinahe allem irgendwie skaliert, aber auch er hat mit einem {{item:3110}} seine Manaprobleme ganz gut im Griff.","replies":[{"poster":"D4RKEVA","date":"2016-03-27T00:27:16.741+0000","up_votes":1,"down_votes":0,"body":"Bei thresh geht es eher um die akive\n\nDeswegen kauft man das item auch -> hard cc/debuffs\n\nWenn du nen adc mit 70+% as hast kein zekes und kein ardent wenn du mikaels brauchst","replies":[{"poster":"Lagbeard","date":"2016-03-27T08:25:11.520+0000","up_votes":1,"down_votes":0,"body":"Natürlich geht es um die Aktive. Das habe ich von Anfang an klargestellt. Ich weiß, wie stark sie ist, aber das rechtfertigt nicht, das man eine Passive mitbezahlt, die kein Support braucht :D Das ist mein Kritikpunkt.","replies":[]}]}]},{"poster":"Awsane","date":"2016-03-25T21:42:58.205+0000","up_votes":1,"down_votes":0,"body":"ich fände es nicht gut, wenn man tank supportern ein item mit dem aktiven Effekt geben würde\ndas item ist ja für eine ganz kleine gruppe an supportern gebaut (die Riege janna lulu nami soraka)\nwenn man nun tanks dieses als gutes item von den stats her geben würde, würde man damit diese Support champs deutlich buffen, weil sie auf einmal neben den all in auch eine ziemlich gute beschützende Funktion besitzen würden, was außer bei Braum nicht so gedacht ist (man kann ja auch nicht soraka oder janna als all in champ spielen)\n\nund die stats sind so meh gerade weil das item so powerful von der activen ist, \ngleiches gilt für den wardstone und die goldincome items, die sind auch alle wenn man sie lategame technisch betrachtet nicht so geil aber die active macht hier den unterschied\nsupporter sollen ja der champ sein mit den schlechtesten Duell stats im Team, dafür bringen sie ganz andere Fähigkeiten mit\n(ihr müsst das mal so sehen wollt ihr im lategame  z.b. wenn es bessere Support items gäbe eine janna, die richtig tanky wird, ich glaube eher nicht, genauso wenig will ich im lategame einen full tank alistar haben, der dazu noch seinen carry neben seinen cc Fähigkeiten mit zig activen unterstützen kann)\n\nLG Awsane","replies":[{"poster":"Lagbeard","date":"2016-03-26T11:08:09.856+0000","up_votes":1,"down_votes":0,"body":"Ich habe ja auch keine Besseren Stats gefordert, sondern passendere. Ich will kein Ultra-Tankitem daraus machen, aber es würde mich freuen, wenn man es in eine bestimmte Richtung schiebt. Entweder Tanky oder AP, nicht diese seltsame Sammlung an Stats, die zu keinem Champ komplett passt. Und selbst, wenn man die Stats lässt, dann würde ich gerne eine andere Passive darauf haben. Oder man verbessert die Stats und entfernt die Passive komplett.\n\nDas Item ist Uralt, und wurde für Manalastige Supporter designed (Damals war Manahaushalt echt noch problematisch :D). Aber mit der Regenerationsmastery, Münze/Dolch und Rauchbrenner hat man heutzutage meist seine Manaprobleme gelöst. Ich selbst spiele Nami nicht, aber weder auf Soraka, noch auf Sona, Lulu oder Janna habe ich großartige Manaprobleme. Wobei ich mit Lulu und Janna ohnehin festes Mana favorisiere.","replies":[]}]},{"poster":"Shaneira","date":"2016-03-26T10:17:04.094+0000","up_votes":1,"down_votes":0,"body":"Naja. Wenn man das Item wegen der Aktiven baut, baut man es auch auf Tank Supports.","replies":[]}]}]}