{"poster":"Lagbeard","date":"2016-11-15T14:28:37.397+0000","title":"Das wie hab ich verstanden - aber warum eigentlich?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Moin, ich suche im Moment jamanden, der mir die Hintergruende des Rankedsystems erklaert. Wie Placements, MMR, Rang und Lp funktionieren habe ich im groben, aber warum wurde das System in Rang und MMR aufgeteilt?\r\n\r\nIch spiele seit season 4, season ,5 war meine erste rankedseason. Verzeiht mir also, wenn mir das alte elosystem weitgehend unbekannt ist. Meine frage ist einfach warum nicht der rang als mmr genutzt wird und man immer so gut ist, wie man angezeigt wird. \r\n\r\nDrauf kam ich, als ich darueber nachdachte, das der rang am anfang der season herabgesetzt wird, die mmr jedoch nicht. Wenn also ein solider goldspieler mit einer 50% winratio in gold 3 nach silber kommt, und weiterhin gegen ebendiese gegner spielt, gegen die er eine 50% winrate hatte, wie koennte er aufsteigen? Steigt er nich sogar ab, da seine mmr hoeher ist als sein rang, obwohl seine spielleistung immer noch die selbe ist? \r\n\r\n\r\nEntschuldigt die formalen fehler, mein tablet weigert sich zu scrollen und ich kann gerade nichts korrigieren.\r\n\r\nLg, lagbeard","replies":[{"poster":"Megamaexx","date":"2016-11-15T17:00:22.497+0000","up_votes":2,"down_votes":0,"body":"Hi Lagbeard^^\nDer Sinn hinter den Ligen ist meines Wissens reine Visualisierung. Ein sichtbares Ziel wird eben gern angesteuert, während man eine Zahl eher in den Hintergrund rücken lässt.\nEs ist eben ein komplett anderes Gefühl, ob du jetzt Gold 3 mit 100 LP oder Platz 1.017.157 bist. Wer achtet schon darauf, ob er jetzt Platz 1.017.157 oder 1.017.158 ist? Viel mehr achtet man darauf, ob man nun Gold 3 oder Gold 2 wäre. Kleine Zahlen haben eben Relevanz, während Millionengrößen einfach verschwimmen, umso weiter man sich von seinem Aussichtspunkt entfernt.\nAußerdem hat man etwas, um das man kämpfen kann. Man muss ja schließlich 3 (oder 5) Promogames absolvieren, um in höhere Ligen zu kommen. Wenn man jetzt mal eben 1.000 Plätze nach oben klettert, fällt das einfach nicht auf. Deine Promo merkst du dir aber garantiert eher.\n\nIch hoffe, das ist so einigermaßen verständlich =)","replies":[]},{"poster":"Lagbeard","date":"2016-11-15T22:01:22.169+0000","up_votes":1,"down_votes":0,"body":"Okay, dass mit der Visualisierung versteh ich. Aber warum die Hidden MMR? Warum werden nicht die LP als Rating genutzt? Das war die eigentliche Frage :D","replies":[]},{"poster":"Eibert Rümmel","date":"2016-11-15T17:34:27.870+0000","up_votes":1,"down_votes":0,"body":"Ich hab noch das alte Elo System noch miterlebt. Schön daran war, dass man seine MMR kannte. Man hatte eben eine Zahl. In meinem Fall (Schätzwerte) stieg meine Elo von 1000 auf 1400. Auf Dauer sieht man seinen Fortschritt schon, Erfolgserlebnisse hat man aber keine. Ich war Anfang der Season Silber und am Ende der Season ebenfalls. Nach einem erfolgreichen Ranked Tag hat man sich gesagt: \"Na gut, hab ich halt 50 Punkte mehr\". Heute klingt das eher so: \"Boah geil, Promo geschafft!\"\nMan hat durch die neue Visualisierung Erfolgserlebnisse geschaffen für Spieler, die nicht durch die Ranglisten fliegen. \n\nZu deiner Frage: Ein Spieler mit Gold MMR und einer silber Liga bekommt bei einem Sieg ca +25 Punkte und bei einer Niederlage -15. So passt sich die Visualisuerung langfristig immer an die MMR an.","replies":[]},{"poster":"Toxical","date":"2016-11-15T16:56:37.018+0000","up_votes":1,"down_votes":0,"body":"Da gibt es exht gute videos bei youtube zu. Entwedee du guckst erstmal selbst oder ich poste nachher nen link posten\n\nUnd jetzt ist nachher (gelobt sei die PorzellanSchüssel unter mir):\n\n[Erklär Video](https://youtu.be/2LyUeaWLxec)","replies":[]},{"poster":"Babe Itz So Big","date":"2016-11-15T14:45:49.670+0000","up_votes":1,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/sEgQXLrK-erklaarung-des-flex-queue-fix-mit-beispiel","replies":[{"poster":"Megamaexx","date":"2016-11-15T16:53:10.014+0000","up_votes":1,"down_votes":0,"body":"Das beantwortet seine Frage nicht wirklich^^","replies":[]}]}]}