{"poster":"LaPapaQueSuda","date":"2018-01-14T05:54:59.895+0000","title":"Por que tan mal mmr?","subforum":"Charlas Generales","embed":{"description":"LaPotatoe / Silver 2 19LP / 113W 109L Win Ratio 51% / Akali - 45W 53L Win Ratio 46%, Zac - 18W 16L Win Ratio 53%, Blitzcrank - 20W 10L Win Ratio 67%, Ekko - 10W 19L Win Ratio 34%, Kha'Zix - 12W 9L Win Ratio 57%","url":"http://las.op.gg/summoner/userName=LaPotatoe","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":2,"down_votes":2,"body":"Quisiera saber por que tengo tan mal mmr teniendo en cuenta la racha de victorias que llevo, ademas de que por lo general pierda o gane personalmente termino bien. Llevo una racha de victorias de 8, hace un rato gane mi promo a plata 2, ganando todas, salvo la primera, se supone que al tener tan buena racha podria saltar divisiones, ademas de que cuando gane la primer en plata 2 apenas me dio 19pl, y si pierdo lo mas seguro es que me saquen la misma cantidad, ya que anteriormente tambien me paso, me gustaria que un rioter me respondiera y me explicara si es algo que no entiendo, por que realmente no tiene sentido, saludos.\r\n\r\nMi pperfil en op gg:\r\n\r\nhttp://las.op.gg/summoner/userName=LaPotatoe","replies":[{"poster":"Pabloo26","date":"2018-01-14T08:16:44.425+0000","up_votes":1,"down_votes":1,"body":"La respuesta es simple, no tenes buen mmr por que en la temporada anterior no tenias buen win rate con otro campeon que no sea blitz, osea tenias en el piso tu mmr y ahora tenes buena racha, el gran problema que tenes es que estas haciendo duo con un bronce 3 y te toca jugar contra gente plata  5 -4 el mmr de los dos juntos es de plata 5-4 mas o menos por lo que el sistema los pone contra esos, y probable que tu duo si gane mas lp que vos, intenta jugar solo y te va a tocar con gente de plata 2/1 y vas a ganar 20+ de lp","replies":[{"poster":"LaPapaQueSuda","date":"2018-01-17T02:07:54.717+0000","up_votes":1,"down_votes":0,"body":"Puede ser, pero de todas formas habre jugado 5 6 partidas con el, por que no podia salir de bronce 4 y gracias a mi al menos salio a bronce 3 jajaja pero bueno, en esta season si merezco llegar a mas llegare","replies":[]}]},{"poster":"Zafphlyn","date":"2018-01-14T23:26:46.274+0000","up_votes":1,"down_votes":0,"body":"Pues tienes un mmr de casi 2 divisiones por encima de tu liga, eso es bueno.","replies":[]},{"poster":"ZanahoriaAsesina","date":"2018-01-14T06:49:05.226+0000","up_votes":1,"down_votes":0,"body":"¿Haces duo con alguien? Igual, según la página, tu mmr es bastante normal.","replies":[]},{"poster":"Panacea","date":"2018-01-14T06:08:42.969+0000","up_votes":1,"down_votes":0,"body":"La mayoria de tus champs en S7 tienen menos de 50% de w/r que esperas? xd","replies":[{"poster":"LaPapaQueSuda","date":"2018-01-14T06:10:35.232+0000","up_votes":1,"down_votes":0,"body":"Hace al menos 20 partidas estoy jugando only kayn maokai amumu y una con zoe, mira eso, los otros champs son con los que rankeaa hace al menos 3 meses","replies":[{"poster":"LaPapaQueSuda","date":"2018-01-14T06:11:37.407+0000","up_votes":1,"down_votes":0,"body":"Por ejemplo, con ekko y k6 no rankeo desde inicio de la s7","replies":[]}]}]}]}