{"poster":"LaPapaQueSuda","date":"2018-11-11T23:04:34.355+0000","title":"Me acaban de sancionar el chat y retirar el honor debido al report de toxicos","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":2,"body":"En una partida de recien un equipo de toxicos se decidio por reportarme, cuando en ningun momento insulte a alguien, em acusaron de troll y toxico cuando no decia nada mas que animar al equipo a ganar, y por eso me sancionan el chat y me retiran el honor a un dia de terminar la season, que es esto? que es este sistema? me tengo que fumar a los toxicos y trolls todas mis partidas para que un dia antes de que termine la season y por unos boluditos me tenga que prohibir de recibir las recompensas que bien merecidas tengo? Es cualquier cosa el sistema, que tiene que ver el honor con recompensas de rankeo? Que tiene que ver si re compiste el c*lo para llegar a la division que llegaste por las recompensas con si en alguna partida te cansaste de que te flameen o que te trolleen dijiste algo y ese que te flameo o trolleo te reporta y te comes la sancion vos? Son cualquier cosa organizando esto, es totalmente injusto","replies":[{"poster":"Rebkans","date":"2018-11-11T23:09:42.831+0000","up_votes":4,"down_votes":0,"body":"Publicá los chats que te enviaron como evidencia y veremos que tan bueno sos \"animando\" al equipo...\nDesde ya te digo, que para que te restrinjan el chat, te tienen que reportar de manera justificada...\n\n> por unos **boluditos** me tenga que prohibir de recibir las recompensas\n\nQue agradable sujeto.","replies":[]},{"poster":"Muy homosensual","date":"2018-11-11T23:08:26.032+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=LaPotatoe,realm=LAS,application-id=PJAKt7ph,discussion-id=mKpucqGQ,comment-id=,timestamp=2018-11-11T23:04:34.355+0000)\n>\n> si en alguna partida te cansaste de que te flameen o que te trolleen dijiste algo\n\nO sea que si hubo flameo... baia baia dijo tristana","replies":[{"poster":"LaPapaQueSuda","date":"2018-11-11T23:14:45.770+0000","up_votes":1,"down_votes":0,"body":"No lo dije por mi, anoche un chabon le deseaba la muerte a mi vieja y yo no le dije nada, lo reporte y ni pestañeo de que lo hayan sancionado","replies":[]}]},{"poster":"martincarp","date":"2018-11-11T23:20:58.133+0000","up_votes":2,"down_votes":0,"body":"Siendo sinceros, en el 99.9% de los casos el responsable de la sanción es uno mismo, no los de alrededor.... serán factores a tener en cuenta, si, pero la responsabilidad de comportarte de manera deportiva y correcta, es 100% tuya.\n\nLo que te recomiendo es que evalúes las situaciones a las que te expusiste en estos últimos días, te pongas en la situación del compañero de equipo que no estaba involucrado en los intercambios verbales del chat, y te des cuenta de qué tienes para mejorar, porque al fin y al cabo nosotros como personas y jugadores solo podemos ser responsables de lo que uno mismo dice y hace, lo de alrededor puede influir, pero la palabra final, la decisión final de si apretar enter o tomar un vaso de agua y seguir jugando, la tiene uno mismo.\n\nY si de verdad te parece injusta la sanción, siempre puedes abrir un ticket a soporte y sacarte la duda, pero debes ser consciente de que las chances de que te quiten la sanción y te devuelvan el honor son mínimas, casi tan mínimas como el resto en el primer porcentaje que usé en esta respuesta.","replies":[]},{"poster":"POETA DEL TRUENO","date":"2018-11-12T18:18:43.514+0000","up_votes":1,"down_votes":0,"body":"Jaja, viste cuando te haces el poderoso detrás de tu pantalla y flameas a los demás etc etc...\n\nBueno pasa eso... \n\nY tenes suerte que no te comiste 15 Días jaja\n\nTe recomiendo nunca le contestes a un tóxico, instamutea y reporta al d final.","replies":[]},{"poster":"Paradisco","date":"2018-11-12T02:39:01.622+0000","up_votes":1,"down_votes":0,"body":"A ver hijo mostra el chat","replies":[]},{"poster":"500w Padoru","date":"2018-11-12T01:12:50.436+0000","up_votes":1,"down_votes":0,"body":"Si te cagaron baneando no es por ese solo game flaco, venis flameando hace varios y juntaste una cantidad considerable de reports como para que el sistema considere justo castigarte.","replies":[]},{"poster":"Rømagnoli","date":"2018-11-11T23:17:22.353+0000","up_votes":1,"down_votes":0,"body":"\" em acusaron de troll y toxico cuando no decia nada mas que animar al equipo a ganar\"\n\nClaro que siii campeon! {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"ESkD Musantro","date":"2018-11-11T23:15:04.655+0000","up_votes":1,"down_votes":0,"body":"Tengo entendido que no solo por una partida te sancionan el chat,quizas venias acumulando reports,me paso lo mismo,me quede sin recompensas (Hace un mes tratando de subir el honor).\nAnimo,no todo esta perdido :D","replies":[]},{"poster":"McLennon","date":"2018-11-11T23:15:02.541+0000","up_votes":1,"down_votes":0,"body":"Que picarda que se te suelte la cadena terminando la temporada\n{{sticker:zombie-brand-facepalm}} ","replies":[]}]}