{"poster":"XxZedGodxX","date":"2017-08-17T10:52:13.726+0000","title":"Reporten","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":16,"body":"ist es m&ouml;glich das reporten mehr ernst genommen wird? es ist einfach l&auml;cherlich wenn man gerade mit ranked anf&auml;ngt und es nicht schafft sich innerhalb von 4 Monaten aus Bronze rauszuk&auml;mpfen weil das ganze team aus 12 j&auml;hrigen flamern trollern und afks besteht","replies":[{"poster":"Freiherr Alex","date":"2017-08-17T13:09:49.781+0000","up_votes":6,"down_votes":0,"body":"Also um das zu verstehen...\nDu Spielst Ranked mit einer einzigen Runenseite (AD)\nKennst dich mit den Masteries sicher auch nicht aus, sonst hättest du Syndra mit Thunderlord gespielt. Womöglich 4 Masteryseiten die noch nie geändert wurden.\nSpielst in Normals ne anscheinend recht Brauchbare Akali und Talon. Dann gehst du ins Ranked und Spielst z.B. (um dabei zu bleiben) Syndra die du die letzten 3 Wochen nicht ein mal gespielt hast. Stehst selber oft genug 1/5 - 2/5 - 2/8 usw da (um nur die Rankeds zu nehmen in denen du selbst nur 3 von 12 mal Positiv standest und die restlichen 9 nicht grade wenig Negativ)\n\nUnd dann Fragst du dich was Falsch läuft?\n\nKurze Antwort:\nDu hast einfach keinen hauch von Selbstreflexion. Solange du die Schuld für deine schlechten Spiele bei anderen suchst, wirst du in LoL nichts Erreichen. Ganz egal ob du ein Gutes oder Schlechtes Team hast...denn die Schwachstelle bist offensichtlich du selbst.","replies":[]},{"poster":"Megamaexx","date":"2017-08-17T11:02:36.377+0000","up_votes":5,"down_votes":0,"body":"Wenn das Ganze Team aus Flamern, Trollen und AFKs besteht, solltest du aufhören zu flamen, trollen oder AFK zu gehen. (Psst, wenn dein ganzes Team aus den genannten besteht, musst du auch einer von denen sein, weil du zum Team gehörst)","replies":[{"poster":"Fresh Dumbeldore","date":"2017-08-17T12:25:51.337+0000","up_votes":2,"down_votes":0,"body":"#10/10 xD\n\nDas gibt eins Upvote","replies":[]}]},{"poster":"i3IackCat","date":"2017-08-17T10:56:30.449+0000","up_votes":3,"down_votes":0,"body":">es ist einfach lächerlich wenn man gerade mit ranked anfängt und es nicht schafft sich innerhalb von 4 Monaten aus Bronze rauszukämpfen **weil man nicht gut genug ist und dann auch noch über meine Wahrnehmung**, das ganze team aus 12 jährigen flamern trollern und afks besteht\n\nFTFY","replies":[{"poster":"XxZedGodxX","date":"2017-08-17T10:58:35.754+0000","up_votes":1,"down_votes":6,"body":"was willst du machen wenn man seine lane carryt aber die bot 0 15 und 1 11 steht","replies":[{"poster":"Sirrkas","date":"2017-08-17T11:18:16.201+0000","up_votes":5,"down_votes":0,"body":"Da gibt es vieles. Ich würde bei deiner Itemwahl anfangen. Keine 2 Zhonyas bauen, sich mal Schuhe leisten, nicht immer Heal + Flash nehmen, das Trinket ausgiebiger nutzen, nicht Inf Edge rushen. Das sind alles Sachen, die es dir leichter machen können, zu gewinnen.","replies":[]},{"poster":"CYPHΕR","date":"2017-08-17T11:02:03.774+0000","up_votes":3,"down_votes":0,"body":"Nicht nur die Lane, sondern auch das Game carrien?\n\nWarum steht dein Lanegegner denn nicht 0/15?","replies":[]},{"poster":"Night Lead","date":"2017-08-17T12:22:03.742+0000","up_votes":1,"down_votes":0,"body":"Geh am besten mal in ein custom game und üb das Farmen, denn Farm=gold=items=dmg=gegner töten=objectivs sichern= sieg\n\nund schau dir wie viele schon gesagt haben Guides an von besseren Spieler  und ganz besonders was sie für welche items in welcher situation wählen.\n\nEs gibt einen weiteren Punkt der Spiele gewinnt und das sind Wards. \n\nDu bist main Mid/jungle auf diesen Rollen kann man einfacher Spiele carryn als auf anderen, besonders als Jungler.\n\nWas auchnoch von vorteil ist wenn du es beherrschst ist Jungletracking, dh wo ist der Gegnerjungler.","replies":[]},{"poster":"i3IackCat","date":"2017-08-17T14:25:51.839+0000","up_votes":1,"down_votes":0,"body":"Weiß nicht. Wie wäre es mit 97% Winrate in 30 Master Yi games zu haben?","replies":[]}]}]},{"poster":"Allerbester Biss","date":"2017-08-17T11:09:03.037+0000","up_votes":3,"down_votes":0,"body":"Und wieso komme ich locker aus Bronze raus mit den selben Team Mates und du nicht?\n\nVielleicht weil du einfach nicht gut genug bist?\nGuck mal auf deine Fehler","replies":[{"poster":"Fresh Dumbeldore","date":"2017-08-17T12:38:36.918+0000","up_votes":3,"down_votes":0,"body":"Ich wurde anfangs dieser Saison Bronze IV platziert und bin mit 104 (ekl. Promos) Games auf Silber II aufgestiegen und ich würde etwa gefühlsmässig sagen, dass ich in etwa 5-10 Games davon AFK oder Trolle _ im eigenen Team _  hatte. \n\n5-10 Games also. \n\n69w / 45l\n\nNehmen wir mal 8 Games.\n\n6 davon waren lost\n\nD.h. in 39 (45-6) Games habe ich zur Niederlage beigetragen.\n\n39/45 ~ 87%\n\nIch habe in 87% meiner Niederlagen dazu beigetragen.\n\nUnd ich würde sagen, dass es bei dir +/-  10% gleich ist.\n\nAber noch eine simple Frage, die ich jedem stelle, der einen \"Ich werde vom Team zurückgehalten, ich wäre eigentlich mindestens Platin wenn nicht höher\"-Post verfasst, aber ich habe bisher noch nie eine sinnvolle Antwort bekommen, meistens überhaupt keine.\n\n**Wieso schaffen es dann, andere aufzusteigen?**","replies":[]}]},{"poster":"Alustus","date":"2017-08-17T11:43:41.874+0000","up_votes":2,"down_votes":0,"body":"Reports haben sehr wohl eine wirkung, gibt genug Spieler die sich über bans beschweren.\n\n\nIch sehe auf den ersten Blick ein paar Fehler die du machst welche es in Silber  nicht mehr gibt oder nur sehr selten.\nAuch sollte dir bewusst sein das die gegner genau soviele Trolle/afk7Flamer im Team haben wie du, wenn du selber zu keiner dieser kategorien gehörst sogar mehr.\n\nZu den Punkten die mir sofort auffallen:\nItembuilds sind sagen wir bescheiden.\nFarm immer unter 5cs die minute manchmal oftmals sogar unter 4.\nSummoners sind immer heal und flash was oftmals nicht gut ist.\n\n> was willst du machen wenn man seine lane carryt aber die bot 0 15 und 1 11 steht\n\nMal davon abgesehen das du die lane sehr oft verlierst und deine botlane oftmals nicht so negativ steht hier ein paar dinge die du machen könntest:\n\nGanken um sie zurück ins spiel zu bekommen\nObjektives oder gegnerische Jungle camps\n\n\n\nAuch hat die Spielzeit nicht zwangsläufig etwas mit der plazierung im Rank zu tun.\nGibt genug Spieler die schon seit 3 Jahre in Bronze sind","replies":[]},{"poster":"Urogi","date":"2017-08-17T14:53:35.520+0000","up_votes":1,"down_votes":0,"body":"Ich bin als Supp Bronze 2 eingestuft worden und hatte dann nach 20 Games ne Winrate von 33%. Danach hab ich angefangen Galio und Shen Toplane mit Tp zu spielen um mehr impact zu bekommen. War innerhalb von 10 spielen aus Bronze raus, trotz trollern und afklern.\n\nInformier dich mal über Itembuilds, Summoners Spells und Farmen. Mute deine Teammates, setz wards und pushe. mit pushen gewinnt man in bronze jedes spiel.\n\nEdit: Such dir nen Champion aus, der dir gefällt und Spaß macht, such nach passenden Itembuilds(evtl gegen ap und ad, tank, matchsups) und spiel nur noch den. Damit kann man am besten climben.","replies":[{"poster":"Night Lead","date":"2017-08-17T15:16:44.246+0000","up_votes":1,"down_votes":0,"body":"Ich hab es als Support aus bronze raus geschafft, war bis auf die promo recht easy","replies":[{"poster":"Urogi","date":"2017-08-17T16:24:03.837+0000","up_votes":1,"down_votes":0,"body":"Vielleicht hab ich nicht die richtigen Supps gespielt, oder du bist einfach besser. Die Toplane lag mir in Bronze mehr. da konnte ich als Tank snowballen und war untötbar.","replies":[]}]}]},{"poster":"Nordwolf87","date":"2017-08-17T12:10:18.866+0000","up_votes":1,"down_votes":0,"body":"Es sind nicht immer die anderen schuld.\n\nMan macht selbst täglich 100e fehler.\n\nZB: Deine CS p. Min sind tw sehr niedrig und deine item builds sind besonders auf akali - sagen wir - kreativ (2x zhonyas oder 2x zauberhut, manchmal mischt du Angriffskraft und fähigkeitsstärke, manchmal nicht), heal + flash in jedem game wurde schon angesprochen.\n\nIch gebe dir den tipp dir ein paar guides von deinen favorisierten champs auf mobafire bzgl. Items, summoners und so durchzulesen. Zu akali gibts da zb einen von einem \"master\".\n\nIch habe mir gestern kassadin gekauft (ich liebe den kerl jetzt schon) aber bevor ich auch nur angefangen habe normals (!) zu spielen habe ich mir 2 guides durchgelesen was der so braucht.\n\nPS: ist nicht bös gemeint aber wenn dein op.gg profil stimmt bist du b5 mit 0 LP, da ist \"raus aus bronze\" sprich nach Silber bisschen hochgegriffen oder?","replies":[]},{"poster":"Vogeljunges","date":"2017-08-17T11:25:23.469+0000","up_votes":1,"down_votes":0,"body":"Ich hab ja schon viel gesehen, aber noch nie ein Double Zhonyas {{sticker:slayer-pantheon-thumbs}}\n\nEdit: \"...gerade mir Ranked anfängt..\" - du hast doch schon über 200 Spiele gemacht diese Saison...","replies":[]},{"poster":"Fresh Dumbeldore","date":"2017-08-17T12:23:41.837+0000","up_votes":2,"down_votes":2,"body":"Vielleicht kommst du nicht aus Bronze raus weil du Bronze bist.\n\nNein Nein, das kann gar nicht sein, das würde sogar Sinn machen oO\n\n{{sticker:zombie-brand-facepalm}}","replies":[]}]}