{"poster":"Flash in The Box","date":"2016-01-15T11:18:28.997+0000","title":"Avrei bisogno di contattare direttamente qualcuno dello staff...","subforum":"Aiuto e supporto","up_votes":1,"down_votes":4,"body":"Nell&#039;ultima partita classificata, mi &egrave; capitato in squadra un giocatore pi&ugrave; molesto del solito il quale, per via della mia brutta prestazione in partita, mi stava accusando di trollare. Ho risposto che le cattive partite possono capitare a tutti, ma ha ovviamente continuato il flame in chat. Fin qui tutto normale (purtroppo): finito la partita, mi sono limitato a fare un report. Appena ne inizio un&#039;altra capita di nuovo lui in squadra e, nella selezione dei campioni, ha iniziato ad insultarmi (anche dicendo cose false sulla partita precedente: per esempio non ero il jungler come lui poi sosteneva). Per questo suo comportamento tutti in squadra volevano trollare e attribuivano anche a me la colpa; morale: ho tolto la partita prima che iniziasse. Anche se segnalo puntualmente comportamenti molesti, stavolta vorrei davvero essere sicuro che si applichi qualche sanzione (restrizione chat): posso contattare direttamente qualcuno dello staff Riot?","replies":[{"poster":"Frattaglia","date":"2016-01-15T13:29:44.970+0000","up_votes":2,"down_votes":0,"body":"Puoi inviare un ticket al supporto, il link è in alto.\nComunque penso che ti risponderanno in modo cortese ma non prenderanno provvedimenti (per questo caso).","replies":[]},{"poster":"Flash in The Box","date":"2016-01-15T12:12:46.426+0000","up_votes":1,"down_votes":0,"body":"Grazie delle risposte.\n\nIl punto è che non ho modo di segnalare il comportamento nella lobby della partita successiva... La cosa mi rode","replies":[]},{"poster":"Firenheit","date":"2016-01-15T12:05:35.290+0000","up_votes":1,"down_votes":0,"body":"Al massimo puoi inviare un ticket oltre al supporto :)","replies":[]},{"poster":"TheMasterOrso","date":"2016-01-15T11:32:34.328+0000","up_votes":1,"down_votes":0,"body":"è difficile contattare direttamente uno staff della Riot, hanno inventato a posta il \"report\" di fine partita che **dovrebbe** evitare e/o ridurre queste situazioni.\nDato come ho letto, hai già reportato questa persona, non credo che puoi fare di più per ora.\nMi dispiace che trovi persone così ma ti capiterà ancora qualche partita con gente come questa e te dovrai sopportarli ed evitare di creare un conflitto.","replies":[]},{"poster":"Whommy","date":"2016-01-15T11:29:14.798+0000","up_votes":1,"down_votes":0,"body":"No, te muta e reporta, se è un flamer verrà punito non ti preoccupare.\n\nLa notifica di \"avvenuta punizione\" ti arriva solo quando il tuo report è stato la goccia che ha fatto traboccare il vaso.","replies":[]}]}