{"poster":"Pansh","date":"2015-08-07T06:06:50.568+0000","title":"trolls diciendo \"vengo a practicar por que no hay modo sandbox\"","subforum":"Charlas Generales","up_votes":9,"down_votes":1,"body":"a que se debe esto llevo 3 partidas seguidas perdidas en ranked porque salen trolls diciendo exactamente lo mismo, algun rioter o usuario que se de la molestia de responder porfavor","replies":[{"poster":"Ufaaaaaaaaaa","date":"2015-08-07T06:16:39.414+0000","up_votes":2,"down_votes":13,"body":"porque Riot dijo que no va a poner un modo sandbox. Así que la gente va a los PVP a hacer lo que haría en un modo sandbox (si lo hubiera).\nNo están trolleando, están practicando. Trollear es otra cosa.","replies":[{"poster":"Rayxah","date":"2015-08-07T06:46:08.327+0000","up_votes":10,"down_votes":1,"body":"En una ranked...","replies":[{"poster":"Pansh","date":"2015-08-07T06:51:50.955+0000","up_votes":6,"down_votes":1,"body":"eso mismo probar no es trollear, pero probar en ranked ...","replies":[]},{"poster":"Ufaaaaaaaaaa","date":"2015-08-07T06:53:14.860+0000","up_votes":2,"down_votes":13,"body":"> [{quoted}](name=Kroryto,realm=LAS,application-id=v7qsfXsE,discussion-id=kQUJLVzh,comment-id=00000000,timestamp=2015-08-07T06:46:08.327+0000)\n>\n> En una ranked...\n\nes lo mismo, Riot no tiene objeción al respecto.","replies":[{"poster":"gtmasterNOD","date":"2015-08-07T18:01:11.814+0000","up_votes":2,"down_votes":0,"body":"Exacto total es mejor que te busques un team y juegues de esa manera tienes mas posibilidades de ganar xD","replies":[]}]}]},{"poster":"Hiopz","date":"2015-08-07T21:30:01.373+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Ufaaaaaaaaaa","date":"2015-08-07T21:42:54.872+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Hiopz,realm=LAS,application-id=v7qsfXsE,discussion-id=kQUJLVzh,comment-id=00000001,timestamp=2015-08-07T21:30:01.373+0000)\n>\n> Es trolleo pendejo, de seguro al defenderlos eres uno de ellos.\n\nno es trollear, es hacer algo en el ambito donde Riot permite que se haga. Acá en LAS especialmente se tiende a llamar \"trolls\" y \"AFK\" a gente que no es ni una ni otra. De hecho, si te dirigís a la gente en una partida, como te dirigís hacia mi, sos un jugador toxico, y seguramente creas que no lo sos.\nEn lo que respecta a \"defender\", no, no los defiendo, sinceramente me parecen idiotas, pero una cosa no quita la otra. Hay gente que sube su cuenta a nivel 30 jugando con bots y se mete a rankear, y no son trolls ni nada (por mas que terminen 0/40/0), son simplemente gente que usa los ambitos que Riot le da para hacer lo que quiere hacer. \nTrollear es molestar deliberadamente. Estar AFK es deliberadamante y malintencionadamente alejarse del teclado mientras estás conectado en una partida (acá de les llama AFKs a los DCs, por ejemplo).\nMeterse en una partida a probar cosas es algo que riot SI permite, aunque sea una ranked (después será problema del que se mete a hacerlo y como afectará a su ranking). Como afecta a las otras 9 personas en la partida es un tema entre esos 9 y Riot, a quien al parecer no le molesta que esto suceda.","replies":[{"poster":"Hiopz","date":"2015-08-07T21:47:28.002+0000","up_votes":1,"down_votes":1,"body":"Pero igual es molestar, imagínate estar en una ranked y que venga un tipo de estos y te diga: Perdón, estoy probando y ves que el tipo lo hace mal intencionadamente, que haces? Te quedas callado y perdiendo? A estos hay que pararlos.","replies":[{"poster":"Ufaaaaaaaaaa","date":"2015-08-07T22:04:52.943+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hiopz,realm=LAS,application-id=v7qsfXsE,discussion-id=kQUJLVzh,comment-id=0000000100000000,timestamp=2015-08-07T21:47:28.002+0000)\n>\n> Pero igual es molestar, imagínate estar en una ranked y que venga un tipo de estos y te diga: Perdón, estoy probando y ves que el tipo lo hace mal intencionadamente, que haces? Te quedas callado y perdiendo? A estos hay que pararlos.\n\nDe nuevo, tecnicamente no es molestar.\nPor ponerte un ejemplo: a mi me molesta estar una partida y que un tipo me haga 20 pings seguidos hasta que el sistema se lo bloquea. Me rompe los timpanos y me infla los huevos. ¿lo puedo reportar?, no, porque está usando la heramienta que lo proporciona el juego, y que automaticamente es bloqueada cuando riot lo considera \"suficiente\" (por mas que el tipo en el fondo sepa que me está inflando los huevos, es parte de lo que el sistema le permite).\nEn el caso de las practicas, Riot considera que el ambito para practicar son las partidas. Las partidas pueden ser contra bots, pvp normales o pvp ranked, cada una con su distinto grado de dificultad y seriedad.\nEl hecho de que lo \"ideal\" y \"respetuoso\" sea empezar practicando con bots y luego en normales, para una vez masterizado usarlo en ranked, no quiere decir que sea \"obligatorio\". Esa es la palabra de Riot, no mia.\nPor ponerte un ejemplo rapido: ponele que la semana que viene yo me quiero poner a practicar SOLO COUNTERPICKS, jugar solo con el counter del oponente de mi linea. ¿adonde voy a practicar? en Ranked, porque no tengo otro lugar donde hacerlo. Y si, me pueden poner un Darius enfrente y le voy a pickear Teemo (a quien, por mas increible y gracioso que te parezca, no se usar), porque no tengo un ambito donde practicarlo.\nSi estuvieran las normal draft, lo haría ahí. Pero eso no quiere decir que si estuvieran, estaría prohibido hacer lo mismo en ranked ya que, como dije antes, Riot así lo dispone.","replies":[{"poster":"GámerS","date":"2015-08-08T11:44:26.994+0000","up_votes":1,"down_votes":0,"body":"El tema mas que nada y refiriendote al punto del post, que creo que por eso el lo hizo , estan hablando de que en 3 partidas le salieron usuarios haciendo referente a que \"vengo a practicar por que no hay modo sandbox\", una cosa es tener una practica muy simple y rankear y otra cosa es largarte en una ranked con una actitud imponente de que por que no ponen el modo sandbox vos vas a practicar ahi, una cosa es que no este prohibido y otra cosa es arruinarle la experiencia de juego a 4 personas, mas que no son riot games y por lo tanto no tendrian que pasar estas actitudes de desquite, hay que aprender a diferenciar la logica de las cosas fuera de foco.","replies":[]},{"poster":"BioTron","date":"2015-08-08T06:14:16.684+0000","up_votes":1,"down_votes":0,"body":"Básicamente, relajate y disfruta como explotan los vacios legales.","replies":[]}]}]}]}]}]},{"poster":"6Pack","date":"2015-08-07T11:05:51.358+0000","up_votes":3,"down_votes":0,"body":"haha es como una protesta contra riot xD","replies":[]},{"poster":"Aluneth","date":"2015-08-07T06:41:06.290+0000","up_votes":1,"down_votes":0,"body":"Riot escucha nuestras plegarias {{item:3151}}\n\nEso de no querer por de modo sandbox es una pelo... Si quiero probar un combo con flash ¿que hago?\n\nPD: lástima que te hayan trolleado por esto","replies":[{"poster":"Main Lee Cýrus","date":"2015-08-07T21:34:44.789+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Eisheth,realm=LAS,application-id=v7qsfXsE,discussion-id=kQUJLVzh,comment-id=0001,timestamp=2015-08-07T06:41:06.290+0000)\n>\n> Riot escucha nuestras plegarias {{item:3151}}\n> \n> Eso de no querer por de modo sandbox es una pelo... Si quiero probar un combo con flash ¿que hago?\n> \n> PD: lástima que te hayan trolleado por esto\n\nDebes hacer una partida personalizada tu solo contra un bot y probar la veces q quieras tu WOMBO FLASH COMBO SSJ2","replies":[{"poster":"Aluneth","date":"2015-08-07T22:12:25.098+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Corvo53,realm=LAS,application-id=v7qsfXsE,discussion-id=kQUJLVzh,comment-id=00010001,timestamp=2015-08-07T21:34:44.789+0000)\n>\n> Debes hacer una partida personalizada tu solo contra un bot y probar la veces q quieras tu WOMBO FLASH COMBO SSJ2\n\nPero el {{summoner:4}} tiene 5 min cd, si lo tengo que practicar 10 veces.. ¿50 min? si pusieran sandbox podria ponerle 0 de cd","replies":[{"poster":"Main Lee Cýrus","date":"2015-08-08T03:13:01.081+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Eisheth,realm=LAS,application-id=v7qsfXsE,discussion-id=kQUJLVzh,comment-id=000100010000,timestamp=2015-08-07T22:12:25.098+0000)\n>\n> Pero el {{summoner:4}} tiene 5 min cd, si lo tengo que practicar 10 veces.. ¿50 min? si pusieran sandbox podria ponerle 0 de cd\n\nY bueno si fuera un juego sandbox perdería la esencia del league of legends para probar siempre contra bots o personalizada los juegos tienen un rol y no podes cambiarlo, sinceramente seria una catastrofe y habria 10 millones de jugadores en partidas solos probando tirar flash y haciendo sus combos q el modo URF perderia su fama","replies":[]}]}]},{"poster":"Pansh","date":"2015-08-07T06:53:45.587+0000","up_votes":1,"down_votes":0,"body":"ty por la respuesta, acabo de ver el post \"riot pls\" y creo que fue un cagazo gigantesco el que escribió ese post","replies":[]}]},{"poster":"RNGesus","date":"2015-08-08T01:25:45.284+0000","up_votes":1,"down_votes":0,"body":"jajajajajaja , tendriamos que hacer todos eso , \"huelga\" hasta que pongan sandbox , si quieren que practiquemos jugando pues asi sera.","replies":[]},{"poster":"Yrox the Third","date":"2015-08-07T18:41:54.089+0000","up_votes":1,"down_votes":0,"body":"Es en si protesta a Riot para que se den cuenta de la estupides que hicieron.\n\nNo te preocupes que segun Riot \"La unica forma de aprender a jugar es jugando partidas completas de League of Legends :D\"","replies":[]},{"poster":"por el Ñackson","date":"2015-08-07T15:08:44.462+0000","up_votes":1,"down_votes":0,"body":"pues, a veces no queda otra que probar en ranked, ya que ahi estás con gente de tu nivel y sabes si las cosas realmente funcionan.\nno estoy de acuerdo, pero no tenemos herramientas =(","replies":[{"poster":"Postre Helado","date":"2015-08-07T18:32:11.334+0000","up_votes":1,"down_votes":0,"body":"No queda otra? Las normales son exactamente para eso. {{summoner:3}}","replies":[]},{"poster":"xHolsa","date":"2015-08-07T15:40:48.405+0000","up_votes":1,"down_votes":1,"body":"Y en modo sandbox si estás  con gente de tu nivel¿\nQuieres decir que estás al nivel de bots o inferior¿","replies":[]}]},{"poster":"Lynx Ratarrell77","date":"2015-08-07T15:26:43.275+0000","up_votes":1,"down_votes":0,"body":"lei sobre el post de riot ., alguien me puede explicar que significa sandbox ??? , es como un modo de juego donde puedes tener el flash con 100 % de enfriamiento algo asi ?? , es como modo practica ?","replies":[{"poster":"o Trafalgar o","date":"2015-08-07T16:27:02.334+0000","up_votes":1,"down_votes":0,"body":"Se supone que es un modo de practica donde podes hacer lo que sea , como tener el flash sin cool down y esas cosas. Es un modo de juego para practicar nada mas  por eso \"vengo a practicar por que no hay modo sandbox\".","replies":[]}]},{"poster":"Hexplosivo","date":"2015-08-07T15:09:43.866+0000","up_votes":1,"down_votes":0,"body":"Jajajaja no sé si reportarlos o no, pero si lo haces, solamente hay que poner \"modo sandbox\" en el comentario.","replies":[]}]}