{"poster":"ALEXKOND","date":"2018-02-01T21:53:25.553+0000","title":"[PBE] Actualización del 01/02","subforum":"Charlas Generales","up_votes":18,"down_votes":1,"body":"https://cdn.pbrd.co/images/H6D8c1N.jpg\n\n¡Saludos LoLer@s! El servidor de pruebas se actualiza el día de hoy ¿Lo vemos?\n\n#Otras Yerbas\n>{{champion:107}} **Cambios a Rengar revertidos hasta el 8.4:**\n\n>**Rito jinxylord** [comenta](https://boards.pbe.leagueoflegends.com/en/c/client-new-features-feedback/BrApFwN5-rengar-changes-feedback-thread?comment=00b2):\n\n>Un poco de contexto para la semana que viene, sin cambios el día de hoy.\n\n>Acaba de suceder el cierre del 8.3, por lo que vamos a continuar cambiando sobre Rengar de forma interna, pero no verán los resultados de ninguno de esos cambios hasta la próxima semana cuando el 8.4 salga en el PBE. El objetivo sigue siendo el 8.4.\n\n>En general, con los cambios actuales en su Q y R sentimos que estamos muy cerca a un Rengar que nos gustaría llevarles con algunas pocas cosas notables sobre las que seguimos trabajando:\n----Q - Obtención de Ferocidad y triple Q (Necesito ver si una triple Q esta bien, y si no lo esta, como limitarla. También necesito hacer la decisión final sobre de que forma la Q otorga y consume ferocidad)\n---- Ajustes de balance (él sigue necesitando una buena cantidad de ellos)\n---- Ajustes de sensaciones y correcciones de errores (parece que siguen habiendo muchas pequeñas ganancias para hacer que se sienta mejor/fluido/más divertido, por favor sigan dando feedback)\n---- Rengar AP - como fue mencionado en el tema original, un objetivo secundario de la actualización era validar construcciones poco comunes para el personaje. Mientras seguimos creyendo que Rengar Crítico y Rengar Tanque pueden ser mantenidos, estamos preocupados que mejorar a Rango AP de forma significativa puede ser peligroso. Al final del día, su daño permanece muy similar al de Rango Letalidad (saltar sobre alguien y explotarlo), pero, cuando es efectivo, Rengar AP lo hace más rápido y con menos contrajuego.\n\n>Para interés de una completa transparencia, es altamente probable que la próxima versión de Rengar que vean removerá muchas de las mejores que intenté para que Rengar AP sea más viable. Dicho esto, LO QUE NO voy a hacer es hacer que Rengar AP sea peor que su versión en vivo de forma deliberada. En general, un número de cambios que tenemos planeados ayudarán a Rengar AP incluso sin ganancias explicitas en sus radios de PH (como la nueva sinergia entre su Q y Liche).\n\n>Gracias por todo su apoyo, sigan enviando feedback, estamos en la recta final y todavía se pueden hacer muchas cosas para lograr al mejor Rengar posible.\n\n___\n\n**Balance:** Recuerden, estos cambios son tentativos y pueden o no llegar al resto de los servidores\n>**Campeones:**\n\n>{{champion:11}} **Maestro Yi:**\n[Recuerden que el campeón presenta cambios previos.](https://boards.las.leagueoflegends.com/es/c/charlas-generales/AYIbGvh9-pbe-actualizacian-del-3001)\n\n>**[Estilo Wuju](https://4.bp.blogspot.com/--gNMhCB_Pb8/WnOe0y2wv1I/AAAAAAAA4P4/Zxeqz-ejuOQCW7QFCL8vUaQ1sV13me0uACLcBGAs/s1600/yie.jpg) (E):**\n* Bonificación de Daño de Ataque de su activa reducida a 35% de 40%\n * *(Su valor en vivo es de 25%)*\n\n>{{champion:107}} **Rengar:**\n\n>* Campeón revertido a su funcionalidad y valores en vivo.\n * *(Recuerden que los cambios a Rengar están planeados para el 8.4, no el 8.3)*\n\n>___\n\n>**Runas Reforjadas:**\n\n>{{item:3637}} **[Libro de Hechizos Abierto:](https://3.bp.blogspot.com/-_syXIOLctDE/WnOe0wGTdwI/AAAAAAAA4P8/Vd72O8ekYjw1NFUouLJRohEQcgSHGY5rACEwYBhgL/s1600/spellbook.jpg)**\n* Reducción de Enfriamientos de Hechizos de Invocador incrementada a 15% de 10%\n * *(Su valor en vivo es de 25%)*\n\n\n___\n\nPágina(s) consultada(s) en la creación de este tema:\nS@20: [www.surrenderat20.net](http://www.surrenderat20.net)\nSkinSpotlights: [www.youtube.com/channel/UC0NwzCHb8Fg89eTB5eYX17Q](https://www.youtube.com/channel/UC0NwzCHb8Fg89eTB5eYX17Q)\nPBE of Legends: [www.facebook.com/PBEofLegends](https://www.facebook.com/PBEofLegends/)\n\nhttp://i.imgur.com/XgSKsiK.gif","replies":[{"poster":"LL Jhin","date":"2018-02-01T22:27:31.059+0000","up_votes":2,"down_votes":1,"body":"Que parche más pobre, apenas hay cambios, la mayoría fueron revertidos","replies":[{"poster":"ALEXKOND","date":"2018-02-01T22:41:46.260+0000","up_votes":4,"down_votes":0,"body":"No es raro cuando se encuentra tan próximo al cierre del ciclo.","replies":[{"poster":"LL Jhin","date":"2018-02-02T00:36:53.772+0000","up_votes":1,"down_votes":0,"body":"Me refiero a todos los días, siempre hubo apenas cambios, durante todo este ciclo y los importantes que habian los pasaron para el próximo. Éste parche no trae ningún cambio significativo","replies":[{"poster":"ALEXKOND","date":"2018-02-02T00:57:06.908+0000","up_votes":2,"down_votes":0,"body":"Recordá que este año están probando un acercamiento distinto a los parches. Los número par (8.2, 8.4, 8,6, etc) son parches \"grandes\" con mucho contenido, mientras que los impares (por ejemplo, el 8.3) son más pequeños y más enfocados a balance inmediato (si un campeón esta muy fuerte/débil, etc).\n\nPuede que vuelvan a su cadencia anterior (todos los parches con más o menos el mismo contenido), pero de momento los parches van así.","replies":[{"poster":"Katastrofica","date":"2018-02-02T01:45:20.128+0000","up_votes":1,"down_votes":0,"body":"Buen dato, no lo sabía la verdad, ahora estoy emocionado para ver que pasa en el 8.4 >.<\n\nCuando actualizan el PBE? después de que salga la versión a live?","replies":[{"poster":"ALEXKOND","date":"2018-02-02T02:38:45.909+0000","up_votes":1,"down_votes":0,"body":"Asumiendo los tiempos promedios el Martes/Miércoles de la semana que viene arranca el 8.4 en el PBE.","replies":[]}]},{"poster":"LL Jhin","date":"2018-02-02T01:38:38.530+0000","up_votes":1,"down_votes":0,"body":"Si, lo sé. Pero más que pequeño, para hacer un parche así mejor hagan uno grande cada 1 mes y listo jaja","replies":[]}]}]}]}]},{"poster":"Runth","date":"2018-02-01T23:18:19.122+0000","up_votes":1,"down_votes":0,"body":"15% mmmmm\n\n:okay:","replies":[]},{"poster":"Sir Crucifix ll","date":"2018-02-01T22:34:36.375+0000","up_votes":1,"down_votes":0,"body":"Riot jinxlord \n\nIiiiiiiiiiiiiiiiiiiiiiiii","replies":[]},{"poster":"Nuke","date":"2018-02-02T18:26:40.157+0000","up_votes":1,"down_votes":1,"body":"> Campeón revertido a su funcionalidad y valores en vivo.\n(Recuerden que los cambios a Rengar están planeados para el 8.4, no el 8.3)\n\n\n¿Entonces esto es solo temporal? ¿O permanente? ...","replies":[]}]}