{"poster":"ALEXKOND","date":"2017-07-28T21:57:18.444+0000","title":"[PBE] Actualización del 28/07","subforum":"Charlas Generales","up_votes":24,"down_votes":1,"body":"https://cdn.pbrd.co/images/GD5jVxH.jpg\n\n¡Saludos LoLer@s! El servidor de pruebas se actualiza el día de hoy ¿Lo vemos?\n\n**Nuevos Aspectos**\n>{{champion:120}} **Hecarim Lancero Cero:**\n\n>El arte de este aspecto exclusivo de la Artesanía Hextech es revelado el día de hoy:\n\n>https://3.bp.blogspot.com/-VzFGMvfYkyk/WXt_0BKaaLI/AAAAAAAAqWM/b4V8EwrsnF4u9pwEuboDULsqp3PmIaBywCLcBGAs/s1600/2e1d5d8926d4f927.jpg\n| [Pantalla de Carga](https://4.bp.blogspot.com/-knl-rEcXqug/WXuHYnldK3I/AAAAAAAAqWw/oLXUD3m1ecYgaH7VV-8RNp6zrBJtMssnQCLcBGAs/s1600/27f75a0f71e75db7.png) |\n\n>___\n\n>{{champion:10}} **Kayle Pentakill:**\n\n>Se incluyeron los efectos sonoros que hasta ahora faltaban para este aspecto:\n\n>**Vídeo Efectos Sonoros de Kayle Pentakill:**\nhttps://youtu.be/-B9vFRvyftc\n\n>___\n\n>{{champion:63}} **Brand Subjefe:**\n\n>Su habilidad definitiva a hora posee un contador:\n\n>http://imgur.com/Ocfnagq\n\n___\n\n**Nuevos Iconos de Invocador**\n>Siete nuevos Iconos de Invocador, cada uno representando a un miembro de Pentakill y uno al segundo disco de la banda, llegan el día de hoy:\n\n>**Pentakill II**\nhttp://imgur.com/YwH9L0H\n\n>**Karthus | Kayle | Mordekaiser**\nhttp://imgur.com/9bYy7Yq  http://imgur.com/nXf0GQM http://imgur.com/4AWt4Cq\n\n>**Olaf | Sona | Yorick**\nhttp://imgur.com/N1k1Tgi http://imgur.com/1uhMzL9 http://imgur.com/F8kWoc7\n\n>Adicionalmente, el antiguo Icono de Invocador de Arcadia recibió algunos retoques, principalmente removiendo el marco negro a su alrededor:\n\n>http://imgur.com/gaKKv0U\n| [Icono Previo](http://imgur.com/OmQBhRe) |\n\n___\n\n{{item:3632}} **Notas Rápidas de Jugabilidad: 28 de Julio**\n\n>**Meddler** [comenta](https://boards.na.leagueoflegends.com/en/c/developer-corner/BL0TEAYE-quick-gameplay-thoughts-july-28):\n\n>\"Buenos días a todos,\n\n>Aclaraciones Usuales\n\n>Estos temas generalmente contienen charlas sobre trabajo futuro que estamos haciendo, o planeamos hacerlo, y que no esta garantizado de que llegue o, dependiendo de lo que descubramos, proyectos mencionados puede que sean retrasados o incluso parados por completo.\n\n>Si quieres ver un Tweet cuando un tema nuevo de estos aparece:\nhttps://twitter.com/RiotMeddler\n\n>**Seguimientos al 7.15**\n* Nasus - Parece razonable hasta ahora. Él es temible a veces, pero los colosos deberían tener momentos temibles cuando están a rango melé de ti.\n* Urgot - También parece estar bien, al menos inicialmente. Urgot Jungla tiene bastantes problemas, pero eso lo esperabamos, Urgot en carril solitario se desempeña bastante bien.\n* Shyvana - Potencialmente muy fuerte, aunque no hay planes inmediatos aún, todavía seguimos viendo.\n* Cho - Las reducciones lo golpearon de forma significativa, puede o puede que no sigua estando fuera de lugar en la jungla sin embargo. Es bueno ver a Cho como un campeón más funcional (ha pasado un tiempo), aunque sospecho que tendremos que hacer algo más de trabajo sobre él pronto o moderadamente pronto.\n\n>**Cho y Placa de Piedra**\n\n>Hablando de Cho, pienso que sería bueno hablar de él un poco y Placa de Piedra. Estamos muy al tanto que hay algunas fuertes opiniones sobre Cho y Placa de Piedra allí afuera y es un tema con un rango de opiniones también de forma interna. Hablamos mucho sobre esta interacción particular antes de lanzar Placa de Piedra.\n\n>Devorar es realmente un hechizo de alto daño verdadero, capaz de llegar alrededor de 1000 de daño en el juego tardío con una construcción de tanque, con Placa de Piedra empujando eso algunos cientos más asumiendo un número normal de acumulaciones de Devorar. Eso es más daño verdadero de lo que normalmente nos gustaría ver de un campeón en una sola habilidad. Sin embargo, Cho tiene algunas debilidades pronunciadas, en particular sus largos tiempos de lanzamiento, falta de movilidad y confiabilidad limitada. Entre eso y la necesidad de construir Placa de Piedra, estar alrededor de 3 o más campeones enemigos y colocarse en rango de Devorar, concluímos que era apropiado permitir que exista la interacción de Cho/Placa de Piedra. Hasta ahora, ese sigue siendo nuestro pensamiento actual también.\n\n>Habiendo dicho eso, estoy de acuerdo por completo que definitivamente se puede sentir mal en el otro extremo a veces, y Placa de Piedra sigue en nuestra lista de vigilancia aún. La habilidad de usar combinaciones fuertes con ella, permiten usos bastante interesantes y la hacen llamativa en un rango de circunstancias diferentes. Hasta ahora eso parece apropiado, es posible que hagamos algunos cambios a Placa de Piedra y/o otras cosas si el poder de estas, especialmente relativo a su contrajuego, se sale de lugar, sea Placa de Piedra + Cho, Placa de Pierda + Relicario o algo distinto de nuevo. La confiabilidad incrementada que Cho recibe de la ralentizaciónde su E también es notoria, y es posible que mientras esto estaba bien con una Q no muy confiable, el acceso incrementado a su objetivo que él tiene ahora pruebe ser muy dominante a largo plazo.\n\n>**Correciones Rápidas (Hotfixes)**\n\n>Disculpen la repetición de esto, la última vez que viene de mi, lo juro. Quería cubrir una última vez que nuestro acercamiento a las correcciones rápidas a cambiado de alguna forma. Hemos hecho algo de trabajo técnico lo que significa que estas correcciones son notablemente más seguras de hacer. Esto significa que las vamos a hacer un poco más, en particular aputnando a cosas con las que estamos confiados que tienen un efecto negativo en el juego que previamente hubiesemos tenido que esperar hasta el próximo parche para cambiar.\n\n>Es probable que la frecuencia de estas correcciones rápidas sea mayor alrededor de parches grandes, como el 7.15 o pre temporada, ambos debiado a que hay más cosas que potencialmente necesitan corrección y porque en general esos son momentos donde tenemos menos tiempo para pruebas de jugabilidad sobre cualquier cambio realizado.\n\n>**Censurando Nombres de Maestrías/Páginas de Runas**\n\n>Para cualquiera que se haya perdido la mención de ayer, la reciente censura de nombres de páginas no esta trabajando como se supone. Debería volver a su funcionalidad previa pronto.\n\n>**Cambios al Carril Central en el 7.16**\n\n>Tenemos varios cambios apuntados a reducir campeones que se desempeñan fuerte en el carril central actualmente. No apuntamos algo muy grande en un campeón individual, más bien bajar el nivel de los que se desempeñan más alto un poco en general. Algunos de esos cambios ya están en el PBE, deberían esperar algunos más, o ajustes a los existentes, en los próximos días (por ejemplo, reducciones a Syndra cambiando la reducción a un radio en vez de una reducción al daño base.)\"\n\n___\n\n**Balance:** Recuerden, estos cambios son tentativos y pueden o no llegar al resto de los servidores\n>**Campeones:**\n\n>{{champion:51}} **Caitlyn:**\n\n>**[Trampa para Yordles](https://4.bp.blogspot.com/-7g3LnwG4XWs/WXuOFMOu7nI/AAAAAAAAqXQ/fA34BbU0qGUi6XUc3NXdTBW127ZQIm7iQCLcBGAs/s1600/caite.png) (W):**\n* Duración de la inmovilización de las trampas reducida a 0.9/1.05/1.2/1.35/1.5 segundos de 2 en todos sus niveles.\n\n>{{champion:69}} **Cassiopeia:**\n\n>**[Colmillos Gemelos](https://4.bp.blogspot.com/-6S-nYB84vos/WXuNXnXlHBI/AAAAAAAAqXI/y0-jemJzucgXFaHeaQQKg1ZgnlHvFCtuACLcBGAs/s1600/casse.png) (E):**\n* Costo de maná incrementado a 50/60/70/80/90 de 40/50/60/70/80.\n\n>{{champion:60}} **Elise:**\nNota: Este cambio ya fue introducido en el parche 7.15 de los servidores en vivo.\n* Daño de Ataque base reducido a 47 de 50.54.\n\n>{{champion:105}} **Fizz:**\n\n>**Golpe Travierizo (Q):**\n* Enfriamiento revertido a 8/7.5/7/6.5/6 segundos de 8/7.25/6.5/5.75/5.\n\n>**[Juguetón/Bromista](https://3.bp.blogspot.com/-r0wCQ2-TDnY/WXuPWwlt1EI/AAAAAAAAqXY/igHfcBMLzaUi-5u6Vqr1n92nhy9cKslLACLcBGAs/s1600/fizze.png) (E):**\n* Enfriamiento reducido a 16/14.5/13/11.5/10 segundos de 18/16/14/12/10.\n\n>{{champion:3}} **Galio:**\n\n>**[Entrada Heroica](https://1.bp.blogspot.com/-gXCvKeJ0jfQ/WXuPafDojsI/AAAAAAAAqXc/W6TsV8RXb5sp3Myzc_2N1sR3td7o4T6qQCLcBGAs/s1600/galior.png) (R):**\n* Enfriamiento incrementado a 180/150/120 segundos de 160/140/120.\n* Reducción de daños del aliado seleccionado reducida a 20% en todos sus niveles de 20/30/40%\n\n>{{champion:7}} **LeBlanc:**\n\n>**[Orbe Destructivo](https://3.bp.blogspot.com/-XCPZEMhKh0k/WXuPz6eyy2I/AAAAAAAAqXg/bs8QP5OS5sAkihXOnzouBtHkdcDGJDDWwCLcBGAs/s1600/lebq.png) (Q):**\n* Daño contra súbditos reducido a 50% de 60%\n*(Su valor en vivo es de 80%)*\n\n>{{champion:57}} **Maokai:**\n\n>**[Aplastamiento Espinoso](https://4.bp.blogspot.com/-0SRwjzjBIPI/WXuQJOAMCrI/AAAAAAAAqXk/OkhVxQkWN58sSF9SdJmVTomCaGsqFxJhACLcBGAs/s1600/maokaiq.png) (Q):**\n* Daño reducido a  70/110/150/190/230 de 70/115/160/205/250.\n\n>{{champion:61}} **Orianna:**\n\n>**[Orden: Atacar](https://3.bp.blogspot.com/-PGxQN4E1tk8/WXuQsVuju6I/AAAAAAAAqXo/eT1zGdeqNrw6WBdkFm9BCwNM27UjcsV8gCLcBGAs/s1600/oriq.png) (Q):**\n* Reducción de daño cuando la bola atraviesa un objetivo revertida a 10% de 15%\n\n>**[Orden: Disonancia](https://4.bp.blogspot.com/-2ZDk4YsV3Zw/WXuQsQKp8PI/AAAAAAAAqXs/-mhH1n9GxF4l8Bx9glyf0ozbk4P4rzYMgCLcBGAs/s1600/oriw.png) (W):**\n* Daño reducido a 50/95/140/185/230 de 70/115/160/205/250.\n\n>{{champion:134}} **Syndra:**\n\n>**[Poder Desatado](https://2.bp.blogspot.com/-jG9CbvRoo1I/WXuRXSM1AAI/AAAAAAAAqX0/9GIDiM8LSLIyfRqyHFARJD3z24i9ovsfwCLcBGAs/s1600/syndrar.png) (R):**\n* Radio de Poder de Habilidad por esfera reducido a 17% de 20%\n* Radio de Poder de Habilidad del daño total reducido a 51% de 60%\n* Daño mágico por esfera revertido a 90/135/180 de 90/130/170\n* Daño mínimo revertido a 270/405/540 de 270/390/510.\n\n>{{champion:163}} **Taliyah:**\n\n>**[Descarga Pétrea](https://2.bp.blogspot.com/-Ox0J3IyHMTs/WXuSgZ8Zy2I/AAAAAAAAqYA/DEgy01A6cx877XRypK5zMxPyTs_R5xAhgCLcBGAs/s1600/taliyahq.png) (Q):**\n* Costo de maná incrementado a 60/70/80/90/100 de 50/60/70/80/90.\n*(Su valor en vivo es de 50/55/60//65/70)*\n\n\n___\n\nPágina(s) consultada(s) en la creación de este tema:\nS@20: [www.surrenderat20.net](http://www.surrenderat20.net)\n\nhttp://i.imgur.com/XgSKsiK.gif","replies":[{"poster":"Mugman Rojo","date":"2017-07-28T22:00:43.493+0000","up_votes":14,"down_votes":0,"body":"http://940ee6dce6677fa01d25-0f55c9129972ac85d6b1f4e703468e6b.r99.cf2.rackcdn.com/products/pictures/130705.jpg","replies":[]},{"poster":"Rgnrok","date":"2017-07-28T22:18:15.687+0000","up_votes":14,"down_votes":2,"body":"el de taliyah fue tan inecesario\nya de por si en early tiras 2 Q y te quedas sin mana\ncaitlyn la quieren dejar en el tacho de los olvidados","replies":[{"poster":"subcontrol","date":"2017-07-28T22:32:51.992+0000","up_votes":6,"down_votes":0,"body":"no me parese mal cambio ,quisas cuando esta maxeada le trampa deberia seguir siendo 2 segundos, pero que a lvl 1 ( de la habilidad) tenga dos segundos de cc es mucho, es muy frustrante en linea\nque tenga que elegir maxearla para lograr eso me parece un buen balance","replies":[{"poster":"wolfdota","date":"2017-07-29T10:04:15.275+0000","up_votes":1,"down_votes":0,"body":"cuando este maxeada bien, y lux con su stun de 2 seg desde llvl 1 mas el rango de stun","replies":[{"poster":"subcontrol","date":"2017-07-30T16:27:47.780+0000","up_votes":2,"down_votes":0,"body":"pero esa q es mas lenta que la ulty de mao ( bueno no tanto) el problema de cait es que te coloca 5 trampas que si pisas una te deja clabado al piso 2 segundos, es una locura.\nla otra obsion seria darle menos trampas pero entonses perderia capasidad de asedio que es en lo que destaca cait no es un mal nerf . es para darle mas contrajuego en erli , pero si al, maxear la habilidad ( en mi opinion ) deberia seguir siendo dos segundos","replies":[]}]},{"poster":"Dog Bulling","date":"2017-07-28T23:05:30.218+0000","up_votes":2,"down_votes":1,"body":"Aún así, como que pudieron haber hecho eso antes del nerf a la velocidad de ataque que la bajó bastante, de un 53% a un 48% en un solo parche, aunque siga usandose bastante (popularidad no es igual a efectividad, y Lee Sin es prueba de ello).","replies":[{"poster":"subcontrol","date":"2017-07-29T06:29:30.870+0000","up_votes":1,"down_votes":0,"body":"si pero por lo general los campeones mas populares suelen tener bajones de winrate ya que muchos la usan sin explotarla al maximo . igual si lo de la velosidad de ataque fue pasarse mucho pero eso no quita lo frustrante de las trampas que a lvl 3 se construlle una fortaleza la hdp. \nigual a riot ralmente le chupa un huevo lo que ellos quieren es que se juegue bariedad de cahmps y cait lleva demasiado arriba en popularidad y winrate fijate sino el nerf a shaco a graves los nerf a sindra basicamente si algo se juega mucho y es efectibo por mucho tiempo lo nerfean","replies":[]}]}]},{"poster":"La corrupción","date":"2017-07-29T03:53:20.627+0000","up_votes":1,"down_votes":0,"body":"taliyah es de los que menos maná gastan en early en el server en vivo...\n\npero también en el nerf se están pasando\n\ny cait está op","replies":[{"poster":"subcontrol","date":"2017-07-30T16:30:12.920+0000","up_votes":1,"down_votes":0,"body":"lo de taliya es simmple esta muy fuerte en competitivo y por eso es el nerf aunque sea injusto . te lo dise un ex main ryze quien lo veia con 43 % de win rate y lo seguian nerfeando {{sticker:zombie-nunu-tears}}","replies":[{"poster":"La corrupción","date":"2017-07-30T20:31:37.864+0000","up_votes":1,"down_votes":0,"body":"la diferencia entre taliyah y ryze es que taliyah si está fuerte en todos lados con usarla medianamente bien :P Ryze cada rework que le hacen lo deja más como campeón para profesionales.","replies":[{"poster":"subcontrol","date":"2017-07-31T01:47:18.908+0000","up_votes":1,"down_votes":0,"body":"yo solo espero que con su proximo reworck ( hay muchos rumores de ello y algunos rioters practicamente lo an confirmado) lo degen mas jugable en soloduo. el problema de rize ,creo yo, es que lo piensan como un mago dps cuando deberia ser un luchador ap . algo asi como la version magica de olaf por lo menos asi lo senti siempre yo asta su ultimo reworck . y ya ni hablar de su ulty que no le pega en nada al champ \npero bueno ya se vera","replies":[{"poster":"La corrupción","date":"2017-07-31T04:01:57.759+0000","up_votes":1,"down_votes":0,"body":"era muy bueno antes... se curaba, tenía corto rango, tenía escudos, velocidad de movimiento, pegaba y se podía armar tanque. ahora es un pusher que te baja de un combo y en linea molesta sin exponerse usando tus minions, y un creador de jugadas de mid game, nada que ver con el antiguo...","replies":[{"poster":"subcontrol","date":"2017-07-31T17:09:41.476+0000","up_votes":1,"down_votes":0,"body":"te voy a agregar en el lol me caiste bien","replies":[]}]}]}]}]}]}]},{"poster":"Kyousuke","date":"2017-07-28T22:04:16.232+0000","up_votes":8,"down_votes":0,"body":"> Duración de la inmovilización de las trampas reducida a 0.9/1.05/1.2/1.35/1.5 segundos de 2 en todos sus niveles.\n\n\nPOR FIN TE AVIVASTE RITO!!! era lo único que había que tocarle a cait XD se viene el buen parche preparando las cosas para el mundial, osea NERF PARA TODOS\nhttp://pm1.narvii.com/6238/f18c385fe6a70fc4c092060daf70b963372dbcbf_hq.jpg","replies":[]},{"poster":"FCabx","date":"2017-07-31T04:21:23.762+0000","up_votes":1,"down_votes":0,"body":"Siempre se olvidan de aatrox :(","replies":[]},{"poster":"Gonk","date":"2017-07-29T20:05:34.800+0000","up_votes":1,"down_votes":0,"body":"Por que ese nerf a mi LB {{champion:7}}. Riot DIMEEEEEE","replies":[]},{"poster":"ClumsyMage","date":"2017-07-29T19:44:09.249+0000","up_votes":1,"down_votes":0,"body":"Rito nerfeando a todos los midlaners del meta, supongo que es una medida para que se vea mas variedad en el mundial, definitivamente quieren que se jueguen asesinos","replies":[]},{"poster":"bihkv","date":"2017-07-29T17:03:11.502+0000","up_votes":1,"down_votes":0,"body":"En serio nerfear a Caitlyn otra vez? al menos si le nerfean el cc de la w que devuelvan el attack speed viejo","replies":[]},{"poster":"Lady Sin","date":"2017-07-29T16:22:00.357+0000","up_votes":1,"down_votes":0,"body":"Menos cd en la e para fizz, why riot why {{champion:32}}","replies":[]},{"poster":"Runth","date":"2017-07-29T00:51:37.368+0000","up_votes":1,"down_votes":0,"body":"{{champion:51}} {{item:3073}} \n\n{{champion:222}}  HAAA JAAA","replies":[]},{"poster":"Emissang","date":"2017-07-29T00:39:01.606+0000","up_votes":1,"down_votes":0,"body":"Dejen de nerfearle cosas a Caitlyn que no solucionan nada vieja, el problema de caitlyn radica en la presión de linea que tiene con su rango insano, y lo único que vi en todos los parches fue nerfeos a su velocidad de ataque en late...? ahora a su W? no cambia nada al champ. Va a haber gente que se va a seguir quejando del champ por lo molesta que es un fase de linea, porque ese es su problema.","replies":[{"poster":"Emissang","date":"2017-07-29T00:41:18.341+0000","up_votes":1,"down_votes":0,"body":"Si no quieren verla en \"competitivo\" nerfeenle el rango, que gane rango cuando mejora su ulti a nivel 6. Después veo como buffean a {{champion:84}} TODOS LOS PARCHES por el simple capricho de que la quieren ver en el juego competitivo","replies":[]}]},{"poster":"The Fall of Troy","date":"2017-07-28T22:49:52.140+0000","up_votes":1,"down_votes":0,"body":"pero mira como esta ese icono de kayle papa.....","replies":[]},{"poster":"Ks Erwyn","date":"2017-07-28T23:03:51.850+0000","up_votes":2,"down_votes":5,"body":"Definitivamente RITO no quiere ver en los mundiales ni a {{champion:51}}  ni a {{champion:3}}...","replies":[]},{"poster":"J7ycjHAfiL","date":"2017-07-29T01:54:05.640+0000","up_votes":1,"down_votes":5,"body":"Rip mids molestos {{champion:1}}","replies":[]},{"poster":"Sir Crucifix ll","date":"2017-07-28T22:12:13.677+0000","up_votes":2,"down_votes":22,"body":"buff fiora","replies":[{"poster":"Dog Bulling","date":"2017-07-28T23:08:14.514+0000","up_votes":1,"down_votes":0,"body":"Se lo dieron en otra parte del ciclo del PBE, porque en efecto se pasaron con el nerf. Dado que no han cambiado nada es muy posible que salga con aquel buff (actualmente la francesa obtiene 15-30% de MS al golpear un punto debil, y en el PBE sería de 15-45%). Eso sí, no adquirirá MS solo por estar cerca de alguien marcado por su R.","replies":[]}]}]}