{"poster":"ALEXKOND","date":"2018-10-02T20:36:59.018+0000","title":"[PBE] Actualización del 02/10","subforum":"Charlas Generales","up_votes":16,"down_votes":1,"body":"https://cdn.pbrd.co/images/HGDx0YD.jpg\n\n¡Saludos LoLeros! El servidor de pruebas se actualiza el día de hoy ¿Lo vemos?\n\n#{{champion:81}} Actualización de Campeón: Ezreal, el Explorador Pródigo\n>Se incluyeron sus frases de Selección y Bloqueo.\n\n>**Selección:**\n*[\"¡Misión aceptada! Espera, ¿A donde vamos?\"](https://soundcloud.com/surrat20/ezreal-choose-vo-1)*\n\n>**Bloqueo:**\n*[\"¡Hey, tu te lo pierdes! Pero... Lo entiendo.\"](https://soundcloud.com/surrat20/ezreal-ban-vo-1)*\n\n___\n\n#Nuevos Cromas y Aspecto de Centinelas\n>La gente de Skins Spotlight subió los vídeos de los nuevos cromas de Amumu Infernal y del Aspecto de Centinelas Dragón Entrenado.\n\n>{{champion:32}} **Amumu Infernal:**\nhttps://youtu.be/auapanoeeuw\n\n>{{item:2056}} **Centinela Dragón Entrenado:**\nhttps://youtu.be/B5Ss0VzZ3Vk\n\n>Adicionalmente, se incluyeron las imágenes para la tienda del conjunto de cromas de Tristana Entrenadora de Dragones:\n\n>https://imgur.com/DXBebpr\n| [Rubí](https://4.bp.blogspot.com/-ym8kpOhzLiM/W60xdZPCTDI/AAAAAAABIMI/8Jw2zPUPYVwk1L8KNd53FMHeImVapLg_wCLcBGAs/s1600/18018.png) | [Esmeralda](https://4.bp.blogspot.com/-pJDHGDxBX3E/W60xdakc_yI/AAAAAAABIMM/SuZIXtpp2zgIRirWSasVoKp0qmHrw8NegCLcBGAs/s1600/18019.png) | [Zafiro](https://1.bp.blogspot.com/-5iQaigZrUFQ/W60xd6XsBvI/AAAAAAABIMQ/LumqwroHnz0NaYA_MlrD4CXqY7CoWeKIwCLcBGAs/s1600/18020.png) | [Arco Iris](https://4.bp.blogspot.com/-wLjqAWGG_1U/W60xeE4DggI/AAAAAAABIMU/ZHSrvTWdU6sI9jw0WTqQpDfgO4dlj1ATgCLcBGAs/s1600/18021.png) | [Obsidiana](https://3.bp.blogspot.com/-bORL2Fydn2M/W60xeAnZqeI/AAAAAAABIMY/jdXULWrhjxk6t1CRwHWI5TvUQpUMGpsSwCLcBGAs/s1600/18022.png) | [Cuarzo Rosa](https://1.bp.blogspot.com/-iOC2txmGa4o/W60xeNdahaI/AAAAAAABIMc/5kjT7OzzakAbdh0lnquso-CC8yXGvE5XgCLcBGAs/s1600/18023.png) |\n\n___\n\n#Temas de Contexto\n>{{item:3637}} **Reducciones a Cosecha Oscura:**\n\n>**Riot Maple Nectar** [twitteó](https://twitter.com/RiotMapleNectar/status/1045800562493579264):\n\n>Sorpresa. Adelanto que vamos a reducir Cosecha Oscura en el 8.20 (de momento solo quitaremos 20 de daño base), pero estamos viendo de hacer un pase bastante fuerte al diseño de esa runa en los próximos parches (puede que quede para pretemporada).\n\n>{{champion:114}}{{champion:133}} **Nuevas animaciones de movimiento para Fiora y Quinn:**\n\n>**Rornation** mostró nuevas animaciones de movimiento para ambas campeonas que llegarán pronto a los servidores en vivo (no necesariamente en el 8.20).\n\n>[[1]](https://twitter.com/RoryAlderton/status/1045771850507116545) Jugadores de League, especialmente de Quinn. Realicé una actualización a como corre Quinn. Aligeré su cuerpo un poco y alteré su agarre a la ballesta para que tenga un poco de cambio de pose al atacar. ¡Háganme saber que piensan!\n\n>https://twitter.com/i/status/1045771850507116545\n\n>[[2]](https://twitter.com/RoryAlderton/status/1047207650146963456) Muchas gracias a todos aquellos que dieron sus opiniones sobre el movimiento de Quinn la semana pasada. Sugerencias sobre las cuales actuar - 1. Reducir su rebote en 20%. - 2 Inclinar un poco más hacia adelante. - 3 reducir un poquito la altura a la que llegan las rodillas. Me encantaría escuchar sus opiniones sobre Fiora más adelante.\n\n>[[3]](https://twitter.com/RoryAlderton/status/1047222007115304960) Aquí hay una animación de correr actualizada de Fiora. Traté de hacer que sus pies sean más ligeros. Su pose esta más arriba para dar a la animación un mejor sentido del personaje y mejorar su trato de 'gran duelista'. ¡Háganme saber que piensan!\n\n>https://twitter.com/i/status/1047222007115304960\n\n___\n\n**Balance:** Recuerden, estos cambios son tentativos y pueden o no llegar al resto de los servidores\n>**Campeones:**\n\n>{{champion:103}} **Ahri:**\n\n>**[Impulso Espiritual (R):](https://2.bp.blogspot.com/-qX1bbd_HqCs/W7PRwYiGWdI/AAAAAAABIQA/J10PQ1EmLBYtzg7tHERsJd2wbE1neUeiQCLcBGAs/s1600/ahrir.jpg)**\n* Enfriamiento incrementado a 130/105/80 segundos de 110/95/80\n\n>{{champion:267}} **Nami:**\n\n>**[Flujo y Reflujo (W):](https://4.bp.blogspot.com/-mVM518kUhpo/W7PSXLa1pfI/AAAAAAABIQM/B8CHA5ZOmYE9tHlhxRXq_icW6NEtx0rxACLcBGAs/s1600/namiw.jpg)**\n* Curación reducida a 60/85/110/135/160 de 65/95/125/155/185\n\n>{{champion:14}} **Sion:**\n* Regeneración de Vida base reducida a 1.5 de 1.8\n\n>___\n\n>**Runas Reforjadas:**\n\n>{{item:3637}} **[Cosecha Oscura (Dominación):](https://3.bp.blogspot.com/-DnOp-OVFJxE/W7PROnfDPOI/AAAAAAABIP0/M-YozSZd4U83Rno-3txZ7Rk-XprBDtylQCLcBGAs/s1600/darkharvest.jpg)**\n* Daño adicional reducido a [20 a 60] de [40 a 80]\n\n>___\n\n>**Correcciones Rápidas (Hotfix):**\n\n>Nota: Estos cambios ya son efectivos en los servidores en vivo.\n\n>{{champion:114}} **Fiora:**\n\n>**Baile de la Duelista (P):**\n* Curación al detonar Puntos Vitales incrementada a [40 a 115] de [35 a 110]\n * *(La descripción de la habilidad será actualizada en el parche siguiente)*\n\n\n___\n\nPágina(s) consultada(s) en la creación de este tema:\nS@20: [www.surrenderat20.net](http://www.surrenderat20.net)\nSkinSpotlights: [www.youtube.com/channel/UC0NwzCHb8Fg89eTB5eYX17Q](https://www.youtube.com/channel/UC0NwzCHb8Fg89eTB5eYX17Q)\nPBE of Legends: [www.facebook.com/PBEofLegends](https://www.facebook.com/PBEofLegends)\n\nhttp://i.imgur.com/XgSKsiK.gif","replies":[{"poster":"RNGesus","date":"2018-10-02T22:59:44.714+0000","up_votes":8,"down_votes":0,"body":"DIOS LA DE FIORA ES HORRRRRRRRRRRRRRRRRRRRRRRRRIIIIIIIIIIIIIBLEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE","replies":[{"poster":"Dog Bulling","date":"2018-10-03T15:12:36.534+0000","up_votes":1,"down_votes":0,"body":"Bueno, el menor balanceo de la espada y la postura más rígida brazos es algo que esta bien planteado. Estoy seguro que en la esgrima es importante mantener la posición de la espada al moverse. Y ese tema con el cual acompañaron esta muestra es bonito y muy coherente con lo que nos muestran (Aunque en primer lugar no es de lol, sino de Steven Universe, seguramente involucrando a Perla. Que recuerde ella es la experta en esgrima).\n\nPero por el amor a Aurelion, ese movimiento de piernas no es para nada natural. Vale que esa sea su pose al mantenerse parada, pero los correr con pasos cortos sin mover las rodillas no le quedan para nada bien, o al menos como pusieron esos pasos cortos.\n\nPD: Al menos modificaron el andar e hicieron que esa fuese su pose al caminar. Menos mal.\n\nhttps://twitter.com/RoryAlderton/status/1047424231657500672","replies":[]},{"poster":"lllHeisenberglll","date":"2018-10-02T23:05:00.333+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Protocinturonga,realm=LAS,application-id=v7qsfXsE,discussion-id=8Isht7Ew,comment-id=0007,timestamp=2018-10-02T22:59:44.714+0000)\n>\n> DIOS LA DE FIORA ES HORRRRRRRRRRRRRRRRRRRRRRRRRIIIIIIIIIIIIIBLEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE\n\njajajaja mira que yo siempre apoyó lo nuevo usualmente. Pero esta es la excepcion me gusta mucho mas la vieja","replies":[]}]},{"poster":"Nuke","date":"2018-10-03T00:51:34.919+0000","up_votes":5,"down_votes":0,"body":"> Curación al detonar Puntos Vitales incrementada a [40 a 115] de [35 a 110]\n\nCrucifix ahora mismo:\n\nhttps://i.gyazo.com/f64b044ab78b3f605b42b4f53a447446.gif","replies":[]},{"poster":"Dog Bulling","date":"2018-10-03T14:54:49.204+0000","up_votes":4,"down_votes":0,"body":"FINALMENTE, DESPUES DE UN AÑO, nerfean a Nami. \n\nhttps://youtu.be/P3ALwKeSEYs\n\nEsa tipa ha estado rondando el 53% de winrate desde que salió Aery en la pretemporada, y fijense que me agrada usarla, pero eso no me hace negar que cura demasiado con su W (Una buena nami de hecho puede curar 2 veces con dicha habilidad, cada 6 segundos). \n\nEs que aparte de curar mucho, hostiga sin tener que tirar skillshots, tiene 2 knock ups (uno de ellos en enorme area y el otro de muy larga duración), otorga velocidad de movimiento, potencia básicos, puede poner escudos, hace que un aliado ralentize con sus golpes y es relativamente facil de usar; solo le falta tener más aguante y sería el soporte perfecto. Pero bueno, más vale tarde que nunca.","replies":[{"poster":"NecroFoe","date":"2018-10-03T19:07:40.166+0000","up_votes":1,"down_votes":0,"body":"Es la verdad, y después de fase de líneas el maná ya casi no es problema, el aplicar aery con la E (y posiblemente pebetero) es una de las cosas que más las impulso este año, juntando también los nerfs a los escudos y a otros campeones de su estilo en bot. La sigo amando igual.","replies":[{"poster":"Dog Bulling","date":"2018-10-04T00:53:54.271+0000","up_votes":2,"down_votes":0,"body":"Si aplica Aery en un aliado pone un escudo. Al poner un escudo activa el pebetero en dicho aliado. Es decir que la E también otorga Aery, y lo mismo pasa con las auras de Sona (Te recuerdo que la muda alcanzó 57% de winrate en pretemporada)\n\nNo obstante si es solo su pasiva que otorga MS no pasa lo mismo. Quiza lo hicieron así con las pasivas que otorgan  velocidad de movimiento, para erradicar esa interacción tan abusiva que habría tenido {{champion:40}} . Considerando el estado tan abusivo de Nami, incluso si es un error debería mantenerse así.","replies":[{"poster":"NecroFoe","date":"2018-10-08T05:29:32.483+0000","up_votes":1,"down_votes":0,"body":"Imaginate activar pebetero con el buff de MS de la R xDD","replies":[]}]}]}]},{"poster":"Ahristócrata","date":"2018-10-02T22:22:21.658+0000","up_votes":3,"down_votes":2,"body":"130 segundos...\n\nhttps://cs6.pikabu.ru/post_img/2015/05/28/10/1432833096_1149804263.gif","replies":[{"poster":"Salvor","date":"2018-10-02T23:01:50.816+0000","up_votes":4,"down_votes":0,"body":"52,67% de Winrate siendo 1era en Playrate.\nYo preferiria que directamente le saquen el ultimo buff de la E que fue super innesesario.","replies":[{"poster":"Ahristócrata","date":"2018-10-02T23:21:50.846+0000","up_votes":2,"down_votes":1,"body":"El buff de la E fue supernecesario porque tiene unos escalados mediocres yendo al late game y la ayuda a cumplir su rol de asesina en dicha instancia(a esa altura a los tanques no les hace nada). Y en caso de que se lo retiraran necesita compensar daño en otras partes de su kit (se lo damos a la R y W que son aim?  Se lo damos a la Q y se convierte en la que mejor limpia del juego?).\n\nLo que realmente le vino bien a Ahri esta temporada no es el buff a la E(sí que la ayuda, claro), son las nuevas runas que la benefician por todos lados.\n\nNi el equilibrador que yo recuerde tiene ese cd y tiene una utilidad bestial.","replies":[{"poster":"Salvor","date":"2018-10-03T00:48:44.003+0000","up_votes":2,"down_votes":0,"body":"Otra que pensaban hacer era aumentar el daño de las demas habilidades al objetivo que le metas el charm.\n\nDiscrepo en lo de los tanques, el daño verdadero en la Q en early se siente muy fuerte, y justamente el meta es de early.\n\nNo se soy jugador de Ahri, no puedo discutir si el buff de la E fue el correcto o si el nerf de la R tambien.\nPero que el Nerf era nesesario lo era.\nEstare atento mañana a lo que dices los muchos (son muchos) main Ahri en NA.","replies":[{"poster":"Baiken","date":"2018-10-03T01:55:05.329+0000","up_votes":1,"down_votes":0,"body":"recibió mucho castigo por su supervivencia en línea, por lo que tuvieron que buffearla un poquitin, pero siento que esos 20 seg de cd aumentados en los niveles 6 y 11, se notarán mucho.","replies":[{"poster":"ImNw","date":"2018-10-03T03:42:10.943+0000","up_votes":4,"down_votes":0,"body":"Siempre pienso que Ahri es un champ muy safe una vez que llega a 6, lo hicieron con varios champs este tipo de nerf, y no lo veo mal, x q sino es una verga que seas jg y no puedas gankear una Ahri que a los 2 min ya tiene ulti para volver a escapar.","replies":[]}]},{"poster":"Nabuze","date":"2018-10-03T01:09:39.056+0000","up_votes":2,"down_votes":0,"body":"Ahri no sé si estará rota pero que está fuerte en este momento está fuerte.","replies":[]},{"poster":"Jeremías 17 5","date":"2018-10-03T17:23:22.544+0000","up_votes":1,"down_votes":0,"body":"El buff de la E (que no es un buff es devolverle algo que no se le tendría que haber quitado nunca pero lamentablemente cuando se lo sacaron Ahri era Pick o Ban) era necesario porque perdía mucho potencial en late, era casi inútil comparada a otros asesinos AP/Magos De Burst. \n\nSu ultimate la hace difícil de matar, fácil de conseguir kills, esquivar Skillshot, etc y el nerf a su CD es necesario. Su W es tan inútil como comprarle Mana a Garen. Mi idea seria hacer la W un Skill Shot, parecido a la W del Rework de Ezreal, que amplifique el Daño siguiente, entonces al agregar otro skillshot a Ahri pasa a ser mas Skilled y que no te pueda burstear cualquier tonto apretando 2 botones (E+Q) y a su R sacarle un Salto, que solo tenga 2 saltos me parece suficiente para el objetivo que tendría que tener Ahri dentro del juego. Mantener la Q igual, capaz con un poco menos de rango o un mejor hitbox, y la E quitarle la amplificación, pero que si te pega la E después de la W su charm dure el máximo y sin la W que dure un mínimo.","replies":[]}]}]}]},{"poster":"ALEXKOND","date":"2018-10-02T22:55:33.560+0000","up_votes":1,"down_votes":0,"body":"Tanto que me hablabas de Ahri ayer por Discord {{summoner:31}}","replies":[]}]},{"poster":"Nabuze","date":"2018-10-02T22:32:01.786+0000","up_votes":2,"down_votes":0,"body":"la de quinn se ve mas fluida pero la de fiora pareciera que quedo muy rigida, le faltan mas retoques verdad?","replies":[{"poster":"ALEXKOND","date":"2018-10-02T22:51:32.348+0000","up_votes":1,"down_votes":0,"body":"Al leer la descripción de los vídeos se puede notar que esta juntando tanto feedback como sea posible, por lo que es seguro afirmar que habrán más versiones (al menos para Fiora).","replies":[{"poster":"Achungo","date":"2018-10-03T06:45:51.720+0000","up_votes":2,"down_votes":0,"body":"¡A mi me gusta mucho más de la nueva animación de Fiora! Creo que encaja mucho mejor en su temática. La que no me gusta es la de Quinn XD","replies":[]}]}]},{"poster":"Runth","date":"2018-10-02T23:13:47.207+0000","up_votes":3,"down_votes":1,"body":"nami tuvo su racha triunfal que llego su declive, recuerden que esta equilibrada asi q bajar el 5% de la curacion es el limite, con eso seguro jamas la tocaran\n\ncomo main de ella ese nerf no me afectara en nada, porque la juego de manera segura con items fuertes de ella","replies":[{"poster":"Salvor","date":"2018-10-03T00:40:23.038+0000","up_votes":1,"down_votes":1,"body":"Aplausos!","replies":[]}]},{"poster":"Jack310","date":"2018-10-02T21:14:07.631+0000","up_votes":4,"down_votes":2,"body":"veo mal o riot por fin le metio un nerf a  {{champion:267}}   bueno ya era hora la juego y se lo buena que es en su rol","replies":[]},{"poster":"Salvor","date":"2018-10-02T20:56:09.517+0000","up_votes":4,"down_votes":6,"body":"Vengo pidiendo el Nerf a {{champion:267}} hace muchos parches, siempre esta en los primeros puestos de Winrate y es de los support mas jugados.\n\n#WP RIOT.","replies":[{"poster":"RNGesus","date":"2018-10-02T23:00:36.849+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Salvor,realm=LAS,application-id=v7qsfXsE,discussion-id=8Isht7Ew,comment-id=0000,timestamp=2018-10-02T20:56:09.517+0000)\n>\n> Vengo pidiendo el Nerf a {{champion:267}} hace muchos parches, siempre esta en los primeros puestos de Winrate y es de los support mas jugados.\n> \n> #WP RIOT.\n\nLo de nami ya venia tocando , y lo de ahri igual.","replies":[]}]},{"poster":"Only Clässic VG","date":"2018-10-03T15:21:55.601+0000","up_votes":1,"down_votes":0,"body":"Falta el Nerf a Darius... no era que lo bufearban solo para el Worlds?? ah no... dejemoslo así y mientras mas Nerf a Garen","replies":[]},{"poster":"Ode to dark","date":"2018-10-03T11:50:27.318+0000","up_votes":1,"down_votes":0,"body":"Nerfearon todas las runas de la rama antes, era demasiado obvio que iban a nerfear la cosecha oscura xD","replies":[]},{"poster":"Puynsi","date":"2018-10-02T21:04:14.939+0000","up_votes":1,"down_votes":0,"body":"Ahora la feedora va a estar mas imparable que antes","replies":[]},{"poster":"Sir Crucifix ","date":"2018-10-02T21:48:15.244+0000","up_votes":1,"down_votes":1,"body":"si yo les dije que necesitaban cambiar a fiora , desde la caminata hasta algunos toques de pasivas","replies":[]}]}