{"poster":"ALEXKOND","date":"2017-09-20T19:54:30.196+0000","title":"[PBE] (Mini) Actualización del 20/09","subforum":"Charlas Generales","up_votes":18,"down_votes":1,"body":"https://cdn.pbrd.co/images/GLhPD7t.jpg\n\n¡Saludos LoLeros! El servidor de pruebas recibe una pequeña actualización el día de hoy ¿Lo vemos?\n\n**Nuevos Aspectos**\n>{{champion:114}}  **Fiora Espada Creciente**\n\n>Se incluyó la pantalla de carga de este aspecto:\n\n>https://1.bp.blogspot.com/-v9RbiLsQMlY/WcK32xjEVlI/AAAAAAAAvCg/jdY-i7XlrRMfeaHiKFXBnFNO_qPlLVYiwCLcBGAs/s1600/a78950b5a57b8afa.png\n\n___\n\n**Otras Yerbas**\n>{{item:3637}} **El Rincón de las Runas: Ese acerca de la Interfaz del Usuario**\n\n>**Riot Sparkle** [comenta:](https://boards.na.leagueoflegends.com/en/c/developer-corner/UNXgE14h-runes-corner-the-one-about-the-ui)\n\n>¡Hola! Soy Riot Sparkle, Diseñador de Experiencia sobre las Runas ¡Y bienvenidos de nuevo a otro Rincón de las Runas!\n\n>Vamos a mezclar un poco el día de hoy. En vez de hablar sobre una runa en particular, vamos a hablar sobre la Interfaz del Usuario que acompaña a las runas.\n\n>**ACLARACIÓN DE TRABAJO EN DESARROLLO:** Las runas (y su Interfaz) están en desarrollo activo. Esto significa que los nombres, números, iconos, reglas del juego o básicamente todo lo que ven puede cambiar antes de su lanzamiento. Por supuesto, si hay algo que te gusta en particular, asegúrate de mencionarlo.\n\n>Entonces, muchos de ustes han estado preguntando ¿Como voy a tener un seguimiento de todas mis runas nuevas mientras estoy en partida?\n\n>https://i.imgur.com/g6TrIMm.png\n*Una dramática representación mia, haciendo malabares con todas las runas nuevas*\n\n>Seguro, solo hay 6 nuevas runas en tu página, pero todas ellas son más complejas que un simple +1.0 de Armadura. Si ni siquiera tienes idea de que llevaste en tu página de “LUX JUNGLA ES LA MEJOR LUX” ¿Como se supone que juzgues que tan bien funcionaron para ti?\n\n>Por eso, sin más preámbulo, vamos a responder esa pregunta con la introducción de lo que algunos de ustedes jugadores con vista de águila ya han visto - el panel de runas en partida.\n\n>https://i.imgur.com/HfiGEQA.png\n*No, el botón no será una lágrima para el lanzamiento. Eso es trabajo en desarrollo.*\n\n>El panel de las runas es una nueva parte del HUD de Interfaz del Usuario que puedes usar para recordar que runas has llevado en tu partida y seguir su desempeño con ellas. Comparte el espacio con el panel de estadísticas avanzadas, pero aquellos usuarios que saben pueden usar el ya existente atajo “C” para ver ambos paneles a la vez si así lo desean.\n\n>https://i.imgur.com/95adnQO.png\n*Toda la información a la vez*\n\n>El panel es pequeño, por lo que tenemos un límite bastante estricto de cuanto texto puede haber ahí por runa. Elegimos solo mostrar una estadística por runa en el panel, pero reconocemos que algunas runas tienen más de una estadística que es importante (por ejemplo: Perxie afecta escudos Y daño).\n\n>https://i.imgur.com/TOyStzz.png\n*Estadísticas e información adicionales sobre la runa Cometa Arcando de Hechicería. Hice trampa en esta captura para el ejemplo por lo que puedes notar algunas cosas raras ;)*\n\n>Es por eso que puedes pasar por encima de las runas en el panel para acceder más información para ayudarte a evaluar algo como Cometa Arcano (previamente conocido como Meteoro) y su desempeño. Puedes ver arriba que “290” es de hecho el daño realizado a campeones con esta runa, pero también puedes ver otra información que sea relevante para cambiar/mejorar tus selecciones para la próxima vez o tu desempeño en el momento con una runa particular.\n\n>Este aspecto de evaluación personal es importante para el concepto que internamente llamados “el bucle de retroalimentación” en las runas. Básicamente,  esto se ajuste al siguiente valor: *los jugadores deberían tener suficiente información para aprender sobre runas y decidir si quieren cambiar runas o tácticas para la próxima vez.*\n\n>El panel del juego es un lugar donde mostrar este tipo de información pero el otro lugar natural epara este tipo de auto evaluación es la pantalla de final de partida. Ahora, alerta de spoiler, estamos trabajando en una pantalla de final de partida para runas para que no este solamente en el panel de runas en partida. *Actualemnte es probable que no tengamos las estadísticas de final de partida para el lanzamiento del PBE, pero deberían llegar un poco después.*\n\n>Sin embargo, puedo compartir una imágen de como algo *se verá*, una vez que hayamos realizado todo el trabajo.\n\n>https://i.imgur.com/jqB9r4p.png\n*Esto es un bosquejo, por lo que todos los nombres, números e iconos son totalmente falsos aquí*\n\n>Si bien este diseño solo muestra una estadística por runa, al igual que el panel en partida, esperamos eventualmente mostrar múltiples estadísticas por runa de la misma forma en la que el panel de runas lo hace (de ahí la pequeña flecha de expansión en la imágen de arriba).\n\n>Eso es todo por ahora. Esperamos que esto les de una mejor imágen de como podrán seguir sus runas y decidir que funciona y que no. Esto es solo una muestra de la Interfaz de Usuario que sea relevante para este bucle de retroalimentación, pero definitivamente hay más para ver ¡Los veo en los comentarios!\n\n>Puedes ver otros Rincones de Runas previos aquí:\nEl Rincón de las Runas: [Vistazo al Contenido en Desarrollo de Runas](https://boards.las.leagueoflegends.com/es/c/charlas-generales/mHrnFeUX-pbe-actualizacian-del-0607)\nEl Rincón de las Runas: [Un Vistazo al Meteoro](https://boards.las.leagueoflegends.com/es/c/charlas-generales/cddqt2Jv-el-rincan-de-las-runas-un-vistazo-al-meteoro)\nEl Rincón de las Runas: [Adelanto de Cacería de la Luna de Sangre](https://boards.las.leagueoflegends.com/es/c/charlas-generales/fTrw06uo-el-rincon-de-las-runas-caceria-de-la-luna-de-sangre)\nEl Rincón de las Runas: [Gran Vistazo a las Runas de Dominación](https://boards.las.leagueoflegends.com/es/c/charlas-generales/4v79ofb0-el-rincan-de-las-runas-dominacian)\nEl Rincón de las Runas: [Mandato del Señor de la Tormenta y Arrebato del Lanzador de Hechizos](https://boards.las.leagueoflegends.com/es/c/charlas-generales/sH7JN3r1-el-rincan-de-las-runas-mandato-del-seaor-de-la-tormenta-y-arrebato-del-lanzador-de-hechizos)\nEl Rincón de las Runas: [Alma del Guardián](https://boards.las.leagueoflegends.com/es/c/charlas-generales/X3EXEKii-el-rincon-de-las-runas-alma-del-guardian)\nEl Rincón de las Runas: [Invocador Especialista y Rayo Helado Hextech](https://boards.las.leagueoflegends.com/es/c/charlas-generales/VzjNl9qv-el-rincan-de-las-runas-invocador-especialista-y-rayo-helado-hextech)\nEl Rincón de las Runas: [Runas para el juego tardío](https://boards.las.leagueoflegends.com/es/c/jugabilidad-balance-y-narrativa/VPEolJ77-el-rincan-de-las-runas-runas-de-juego-tardauo)\nEl Rincón de las Runas: [Más Runas de Precisión](https://boards.las.leagueoflegends.com/es/c/jugabilidad-balance-y-narrativa/LqrcJ8b5-el-rincon-de-las-runas-mas-runas-de-precision)\nEl Rincón de las Runas: [Acerca del Valor](https://boards.las.leagueoflegends.com/es/c/jugabilidad-balance-y-narrativa/Io505JIs-el-rincan-de-las-runas-acerca-del-valor) \"\n\n>___\n\n>{{item:3632}} **Notas Rápidas de Jugabilidad: 20 de Septiembre**\n\n>**Meddler** [comenta](https://boards.na.leagueoflegends.com/en/c/developer-corner/vNFRvIEM-quick-gameplay-thoughts-september-20)\n\n>\"Hola amigos,\n\n>**Aclaraciones Usuales**\n\n>Estos temas generalmente contienen charlas sobre trabajo futuro que estamos haciendo, o planeamos hacerlo, y que no esta garantizado de que llegue o, dependiendo de lo que descubramos, proyectos mencionados puede que sean retrasados o incluso parados por completo.\n\n>Si quieres ver un Tweet cuando un tema nuevo de estos aparece:\nhttps://twitter.com/RiotMeddler\n\n>**No vamos a hacer objetos iniciales en pre-temporada**\n\n>Previamente mencionamos que ibamos a dar un vistazo a objetos iniciales (cambios y nuevos) durante la pre-temporada. Luego de algo de investigación en distintas opciones, decidimos que no vamos a hacer esto, sino poner más tiempo en las runas, cambios de estadísticas base y otros cambios sistemáticos. Los objetos iniciales siguen siendo un buen espacio para trabajar luego, con cosas como un objeto para magos de carril inferior como una alternativa a los tiradores siendo particularmente prometedor. Como resultado, vamos a darle otro vistazo el año que viene.\n\n>**Ezreal Jungla**\n\n>Vi algunas preguntas sobre nuestra opinión sobre Ez apareciendo en juegos como jungla. De momento parece realmente genial para nosotros es la versión corta. Esta bueno ver un campeón recibiendo juego de una forma distinta. Todavía es temprano, pero el contrajuego parece bien, la falta de este es lo que nos llevó a reducir/cambiar campeones fuera de ciertas posiciones en el pasado (por ejemplo, Malzahar en el carril inferior o Janna en el central). Si llegase a mostrarse demasiado fuerte vamos a atenuarlo, pero no quisiera limitar esto si podemos evitarlo. Si Ez termina como un campeón solo de jungla, vamos a querer hacer algunos cambios para permitirle ir a los carriles de nuevo sin sacarlo de la junga en lo posible. Es una situación similar a Ziggs siendo tanto carrilero inferior como central.\n\n>**Balance de Ornn**\n\n>Orrn ha estado por un tiempo y ha recibido algunas mejoras luego de su semana de lanzamiento. Todavía vemos que mucha gente tiene problemas con él, aunque al mismo tiempo mucho del juego de Ornn sigue viniendo de gente en sus primeros juegos con él. No lo vamos a seguir mejorando en el 7.19 al menos, queremos evitar potenciarlo demasiado y creemos que sigue habiendo una curva de aprendizaje. Planeamos revisarlo en cada uno de los parches siguientes, ver como le va y ver si deberíamos darle un poco de poder o no.\n\n>**Vesta Espinosa**\n\n>Estamos probando algunos cambios para Vesta Espinosa de momento, con dos direcciones posibles. El problema principal es que Vesta Espinosa es muy poderosa para su costo como un objeto general, en vez de una compra específica de nicho. Estamos considerando tanto incrementar su costo significativamente (alrededor de 300 de oro) con ligeros incrementos de estadísticas, reduciendo tanto su eficiencia de oro como retrasando su impacto en carril. O reducir sus estadísticas un poco y subir su costo ligeramente, reduciendo su eficiencia de oro pero dejándolo más accesible en carril como un contra objeto si se desea (en vez de que sea por defecto). Al momento de escribir esto, una de las dos versiones debería estar en el PBE, es posible que probemos la otra a la brevedad, aunque puede que vuelva a la primera dependiendo de como salen las cosas.\"\n\n>http://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png\n\n\n___\n\nPágina(s) consultada(s) en la creación de este tema:\nS@20: [www.surrenderat20.net](http://www.surrenderat20.net)\nhttp://i.imgur.com/XgSKsiK.gif","replies":[{"poster":"Roseo Shooto","date":"2017-09-20T19:58:31.385+0000","up_votes":7,"down_votes":1,"body":"¡Pero que maravilla la Irelia!\n\n{{sticker:sg-jinx}}","replies":[{"poster":"ALEXKOND","date":"2017-09-20T20:01:13.539+0000","up_votes":6,"down_votes":0,"body":"Era Fiora, mala mia {{summoner:31}}","replies":[{"poster":"Hendrix","date":"2017-09-20T23:47:53.983+0000","up_votes":3,"down_votes":0,"body":"La verdad, si no fuera por el arma, yo firmaria que es irelia...","replies":[]}]}]},{"poster":"vaz2001","date":"2017-09-20T19:57:19.715+0000","up_votes":1,"down_votes":0,"body":"¿La skin de no era de Fiora? xD","replies":[{"poster":"ALEXKOND","date":"2017-09-20T19:58:23.353+0000","up_votes":4,"down_votes":0,"body":"Venía pensando justamente en no confundirlas y termine haciendo exactamente eso {{summoner:31}}\nCorregido ¡Gracias por notarlo!","replies":[{"poster":"vaz2001","date":"2017-09-20T20:00:36.175+0000","up_votes":3,"down_votes":0,"body":"Jaja, gracias a ti por subir las actualizaciones del PBE al foro ^^\nPd: https://i.imgur.com/g6TrIMm.png esta imagen es genial!","replies":[]},{"poster":"Hnk Kenshiro","date":"2017-09-20T20:02:40.039+0000","up_votes":1,"down_votes":0,"body":"Si nadie avisaba yo ya pensaba en que también había skin para irelia, xD","replies":[]}]}]},{"poster":"NSaibot","date":"2017-09-20T19:58:19.146+0000","up_votes":1,"down_votes":0,"body":"Quiero pensar que lo de Irelia es un chiste interno xD","replies":[{"poster":"ALEXKOND","date":"2017-09-20T20:01:39.112+0000","up_votes":2,"down_votes":0,"body":"Mala mía, ese aspecto grita Irelia por todas partes para mi y hoy la termine de confundir.","replies":[]}]},{"poster":"masterdragon02","date":"2017-09-21T13:59:30.914+0000","up_votes":1,"down_votes":0,"body":"que buenas skin salieron en este parch de pbe\n{{sticker:sg-lux}}","replies":[]},{"poster":"Sonatic","date":"2017-09-21T05:22:29.788+0000","up_votes":1,"down_votes":0,"body":"Me he estado dando cuenta que con cada aspecto que sale las ilustraciones cada vez menos bonitas, menos calidad, menos todo.\nAntes entre una y otra había semejanza, ya que era el mismo campeón solo con ropa distinta... Al menos eso siento :(","replies":[]},{"poster":"Nísta","date":"2017-09-21T00:30:05.700+0000","up_votes":1,"down_votes":0,"body":"Parece que no va a haber chromas para Fiora :'v","replies":[]}]}