{"poster":"ALEXKOND","date":"2018-06-01T20:55:07.881+0000","title":"[PBE] Actualización del 01/06","subforum":"Charlas Generales","up_votes":13,"down_votes":0,"body":"https://cdn.pbrd.co/images/HnZCeHJ.jpg\n\n¡Saludos LoLeros! El servidor de pruebas se actualiza el día de hoy ¿Lo vemos?\n\n#Nueva Pantalla de Ingreso\n>{{item:3637}} **Campeonato Colegial 2018**\n\n>https://2.bp.blogspot.com/-W5kENREMrWg/WxGuZErZKzI/AAAAAAABA2I/NKH1J9nUQp8RQVM8VInGmSLzU_-7jISUgCLcBGAs/s1600/cd033517d601e0b0.jpg\n\n>**Pantalla de Ingreso: Campeonato Colegial**\nhttps://youtu.be/JOla29YKiKE\n| [Solo Música](https://soundcloud.com/surrat20/college-champ-2018-login-theme) |\n\n___\n\n#Iconos de Invocador\n>Tres Iconos de Invocador de equipos competitivos fueron incluidos:\n\n>https://imgur.com/2RrWmKx\n\n>También se ajusto ligeramente el icono de TSM:\nhttps://2.bp.blogspot.com/-feZdTlzQJ7I/WxGsR_nMy4I/AAAAAAABA10/MgZiswqHzWgJ7FSf4NYzLLRPwTPcd0EBACLcBGAs/s1600/3271.jpg\n| [Previo](https://4.bp.blogspot.com/-f3rtTTAFxSU/WxGsTlmUmiI/AAAAAAABA14/UpcJvUhr4WgMiyiZaJVhmV0xnDGuyaUcACLcBGAs/s1600/3271.jpg) |\n\n___\n\n#Nuevos Gestos\n>Nuevos Gestos incluidos el día de hoy, [pueden leer el contexto de los cambios a los Gestos en este enlace](https://boards.las.leagueoflegends.com/es/c/charlas-generales/5xJKUX5J-pbe-actualizacian-del-3005).\n\n>https://imgur.com/N5m6j3q\n| [Okay](https://3.bp.blogspot.com/-tgcfFTOwlV8/WxGrCx_GmtI/AAAAAAABA1Q/CMFQdvzCOtkLhT56z7ZT1JQ_lOPRlSWTQCLcBGAs/s1600/7a102c939fd239aa.png) | [¡Ay!](https://3.bp.blogspot.com/-_zTdf2l2u5g/WxGrC42qt0I/AAAAAAABA1I/5K6cAGn4lpA0BJqG1_NZug0GZlGsIe1agCLcBGAs/s1600/98d4a8cfb788e47d.png) | [¡Vamos equipo!](https://3.bp.blogspot.com/-lCB2932jZso/WxGrCyYq5mI/AAAAAAABA1M/y0Htfvze7NMLjStgERvew_XTUwlBhZ5VQCLcBGAs/s1600/202ad5fd28117765.png)\n\n___\n\n#Mapas\n>{{item:3400}} **El Puente del Carnicero:**\n\n>La gente de Skin Spotlights subió un vídeo mostrando las interacciones (en inglés) de ambos vendedores del mapa:\nhttps://youtu.be/-U8M5thayos\n\n___\n\n#Nuevos Cromas\n>{{champion:64}} **Lee Sin Media Punta:**\n\n>La gente de Skin Sportlights subió un vídeo comparando las distintas coloraciones:\nhttps://youtu.be/omrqldWsKiI\n\n___\n\n#Temas de Contexto\n>{{item:3637}} **Notas Rápidas de Jugabilidad: Primero de Junio**\n\n>**Meddler** [comenta](https://boards.na.leagueoflegends.com/en/c/developer-corner/U7Wmwcoo-quick-gameplay-thoughts-june-1):\n\n>Hola amigos,\n\n>**Avisos de siempre**\n\n>Estas publicaciones a menudo contienen información acerca del trabajo a futuro que estamos realizando o planeando hacer y que no garantizamos que saldrá para el público. La naturaleza de dicho trabajo puede cambiar o, según lo que vayamos descubriendo, algunos proyectos mencionados podrían retrasarse o incluso cancelarse definitivamente. Si deseas ver un tuit cada vez que subimos una de estas publicaciones, sigue a Riot Meddler en: https://twitter.com/RiotMeddler\n\n>**Opinión breve sobre el 8.11**\n\n>Al momento de escribir, el parche 8.11 esta siendo aplicado por lo que aún no podemos ver bien como es que es recibido. Habrán ideas sobre esto en breve. Durante los primeros días, vamos a ver en particular a campeones y objetos que estén tan fuera de lugar (sea fuerte o débil) que necesitemos priorizar cambios sobre ellos para el 8.12 o, potencialmente, hacer un microparche antes de esto.\n\n>**Canalización de Oro/EXP**\n\n>Recientemente hubo un incremento de la canalización de oro/EXP, tanto su uso en el juego como discusiones alrededor. Opiniones debajo. Es algo en progreso lo cual estamos vigilando, por lo que estas son ideas iniciales, no una fuerte declaración de nuestra posición.\n\n>Para cualquiera no familiarizados con la canalización, se refiere a cuando intentas dar a un campeón mucha más EXP/oro de lo que normalmente podrían conseguir por lo que están realmente muy por delante del resto. Ahora mismo, esto usualmente involucra un campeón quedándose con la mayoría de los súbditos/monstruos de dos posiciones con selecciones como Taric/Yi en el Carril Central/Jungla, o Karthus/Nunu también en el Carril Central/Jungla. También lo hemos visto recientemente en el pasado con casos como Kayle/Yi en el Carril Superior/Junla.\nEs una estrategia poco común de ver en la Grieta, lo cual, todo lo demás siendo igual, creemos que es algo bastante interesante. Nos gustaría apoyar diferentes estilos de juego más de lo que lo hemos hecho en el pasado.\n\n>Habiendo dicho esto, aún no esta claro si hay suficiente contrajuego o no para esto. No veo gente usarlo o jugar en contra de forma óptima aún (dado que demanda una adaptación). También no estamos seguros de que tan efectiva es como estrategia. Parece ser una de las mejores formas de jugar como un duo de smurfs, por lo que no esta claro que tan bien se desempeñará una vez que sea mejor conocida contra jugadores igualmente habilidosos.\n\n>Ciertamente vemos algo de frustración de los jugadores con esto. Necesitamos determinar si solo vemos un dolor temporal alrededor del estado de cambio de meta como algo nuevo pero saludable, una estrategia de moda que se desvanecerá por si misma o una estrategia que a largo plazo llevará a juegos menos divertidos y profundos.\n\n>La canalización de recursos también crea riesgos a los estados de partida donde uno o más jugadores sacrifican mucho de su agencia y diversión para que alguien más sea fuerte. Algo de esto puede estar bien, aunque es posible que esto cruce la raya (personalmente aún no estoy seguro). Si comienza a ser la forma principal de jugar, comparada a una opción de nicho, eso sería bastante preocupante (El Bosque Retorcido sufre bastante en este sentido).\n\n>**Bola de Nieve en el Juego Temprano**\n\n>Como fue mencionado previamente, vamos a dar un vistazo a la bola de nieve en el juego temprano en el futuro cercano. Hemos visto estadísticas de porcentajes de bola de nueve temprana incrementando gradualmente durante el último par de meses. Tenemos un número de ideas sobre que puede contribuir a ese incremento, por lo que vamos a validar cosas como:\n\n>* ¿Los cambios de jugabilidad como los de recompensas, cangrejo, maná de magos, vida de Valor contribuyeron significativamente? No vimos incrementos similares a la bola de nieve en los datos del año pasado y 2017 también tuvo cambios de jugabilidad significativos.\n* ¿Son los cambios en comportamiento los que contribuyen? Cosas como un incremento en actitudes de ‘open mid’ si contribuirían en las mediciones de estadísticas de bola de nieve.\n* ¿Hay otros factores que pasamos por alto? Cosas como errores en los datos (poco probable, pero quiero seguir mirando), cambios de emparejamiento, etc, también podrían ser realmente relevantes.\n\n>Del lado de cambios de jugabilidad como los de arriba que pudieron haber contribuido, también fueron el objetivo de otras cosas que también creemos son importantes, como el potencial de acarrear por cuenta propia, ampliar composiciones de equipo, reducir la pasividad temprana en el carril, etc. Si vemos de reducir la bola de nueve desde una perspectiva de jugabilidad, vamos a apuntar nuestros enfoques a no entrar en conflicto con otros objetivos como resultado. Cosas como reducir la bola de nieve de equipo más que la bola de nieve en solitario, potencialmente reducir el costo de una muerte temprana, cambiar la durabilidad de torretas según el tiempo de partida (¿Sigue teniendo sentido que obtengan resistencias gradualmente comparado a empezar más resistentes?), etc.\n\n>http://ddragon.leagueoflegends.com/cdn/6.24.1/img/champion/Ziggs.png\n\n>___\n\n>{{item:3637}} **Cambios a Lanza de Shojin:**\n\n>**Lowbo** [twitteó](https://twitter.com/itslowbo/status/1002664540717264897):\n\n>Si, pensamos que sin el límite, el objeto o esta balanceado para la mayoría y demasiado fuerte para Jhin/Rengar, etc, o esta balanceado para esos campeones y débil para el resto. El límite nos permite asegurarnos que el objeto sea poderoso en una amplia variedad de campeones.\n\n>___\n\n>{{champion:157}}{{champion:163}} **Más correcciones rápidas (hotfix) en camino:**\n\n>**Riot Scruffy** twitteó:\n\n>Micro parche para más tarde \n\n>Mejoras - Yasuo, Pyke (ya esta en vivo), Taliyah\n\n>Reducciones - Ezreal, Kai'Sa, Estandarte de Mando\n\n>Los detalles deberían ser agregados a las notas del parche.\n\n___\n\n**Balance:** Recuerden, estos cambios son tentativos y pueden o no llegar al resto de los servidores\n>**Campeones:**\n\n>{{champion:516}} **Ornn:**\n[Recuerden que el campeón presenta cambios previos](https://boards.las.leagueoflegends.com/es/c/charlas-generales/uO6ndFdd-pbe-actualizacian-del-3105)\n\n>* Regeneración de Vida base revertida a 1.8 de 2\n* Regeneración de Vida por nivel revertida a 0.16 de 0.20\n\n>___\n\n>**Correcciones Rápidas (hotfix):**\nEstos cambios ya están presentes en los servidores en vivo.\n\n>{{champion:555}} **Pyke:**\n* Daño de Ataque base incrementado a 62 de 60\n* Regeneración de Vida base incrementada a 1.4 de 1\n* Armadura base incrementada a 45 de 42\n* Maná base incrementado a 415 de 380\n\n>{{champion:157}} **Yasuo:**\n* Daño de Ataque base incrementado a 63 de 60\n\n>**Tempestad de Acero (Q):**\n* Daño de Golpe Crítico incrementado a 180% de 150%\n * (Nota: Su descripción no reflejará este cambio hasta el parche 8.12)\n* Corregida la interacción de Probabilidad de Ataques Críticos entre Guante de Pelea y Filo del Infinito\n\n>{{champion:145}} **Kai'sa:**\n\n>**[Segunda Piel (P):](https://3.bp.blogspot.com/-hVOpj-iOPeA/WxG4hMLTJuI/AAAAAAABA3M/2wvormo8egEnEd8RM5QfhT4h7PlHZwNvQCLcBGAs/s1600/kaisapassive.jpg)**\n* Daño adicional de ataques cargados con Plasma reducido a [4 a 10 en los niveles 1 a 16] de [7 a 12 en los niveles 1 a 16]\n* Daño adicional de acumulaciones de Plasma reducido a [1 a 5 en los niveles 1 a 17] de [1 a 9 en los niveles 1 a 17]\n* Radio de Poder de Habilidad de Plasma reducido a [0.10/0.125/0.150/0.175/0.20 para 1/2/3/4/5 acumulaciones] de [0.20/0.25/0.30/0.35/0.40 para 1/2/3/4/5 acumulaciones]\n\n>**[Buscadora del Vacío (W):](https://4.bp.blogspot.com/-YL61WgOyWr8/WxG1EbluKPI/AAAAAAABA3A/wmhdElyWFpo3kk5-KxZltRnBMXKZ_KTeQCLcBGAs/s1600/kaisaw.jpg)**\n* Radio de Poder de Habilidad incrementado a 60% de 45%\n\n>{{champion:81}} **Ezreal:**\n* Daño de Ataque por nivel reducido a 2.5 de 3.11\n\n>**Fuerza de Hechizo Creciente (P):**\n* Velocidad de Ataque por acumulación reducida a 10% en todos sus niveles de 10/12/14%\n\n>{{champion:163}} **Taliyah:**\n* Daño de Ataque base incrementado a 58 de 56\n\n>**Descarga Pétrea (Q):**\n* Daño de rocas subsecuentes contra campeones incrementado a 60% de 40%\n\n>**Tierra Desatada (E):**\n* Daño por salto incrementado a 50/60/70/80/90 (+30% PH) de 35/45/55/65/75 (+20% PH)\n\n>{{item:3060}} **Estandarte de Mando:**\n* Reducción de daño de campeones de súbditos potenciados reducida a 40% de 70%\n * (Nota: Su descripción no reflejará este cambio hasta el parche 8.12)\n\n>___\n\n>**Objetos:**\n{{item:3637}} **[Juicio de Atma:](https://2.bp.blogspot.com/-E22VSysdWpA/WxG0Q9NmF0I/AAAAAAABA2w/F3Em2ZCGkaoIOsiyRTqZyuBITCk3-aswQCLcBGAs/s1600/aat.jpg)**\nRecuerden que se trata de un nuevo objeto.\n\n>* Icono actualizado:\nhttps://2.bp.blogspot.com/-rnhue9dUrYM/WxGwxRIyiJI/AAAAAAABA2c/phEANgh7ZuIdsHQHbsXBgUw1H15A34pbACLcBGAs/s1600/3005_atmas_impaler.png\n\n>{{item:3637}} **[Lanza de Shojin:](https://4.bp.blogspot.com/-wWL89KT1fjY/WxG0Q-E_GbI/AAAAAAABA20/X2jpOpYReYkt1lLsBnF1xyj0XtADvkyKwCLcBGAs/s1600/hereme.jpg)**\nRecuerden que se trata de un nuevo objeto.\n\n>* Su descripción ahora indica:\n\"Pasiva Única: Reduce el daño de ataques y habilidades de campeones en 20 más 10% del Daño de Ataque adicional (máximo de 60).\"\n * *(Ahora se menciona el máximo posible)*\n* Icono actualizado:\nhttps://4.bp.blogspot.com/-qGLLk9Cycw8/WxGwxe30_7I/AAAAAAABA2g/a-HcSVjzrXwUprgcMCohL5WAyx9gvTV-gCLcBGAs/s1600/3161_gugnir.png\n\n\n___\n\nPágina(s) consultada(s) en la creación de este tema:\nS@20: [www.surrenderat20.net](http://www.surrenderat20.net)\nSkinSpotlights: [www.youtube.com/channel/UC0NwzCHb8Fg89eTB5eYX17Q](https://www.youtube.com/channel/UC0NwzCHb8Fg89eTB5eYX17Q)\nPBE of Legends: [www.facebook.com/PBEofLegends](https://www.facebook.com/PBEofLegends)\n\nhttp://i.imgur.com/XgSKsiK.gif","replies":[{"poster":"Šeiya","date":"2018-06-02T00:17:16.504+0000","up_votes":4,"down_votes":0,"body":"> Mejoras - Yasuo, Pyke (ya esta en vivo), Taliyah\n\nNiceeeee, ambos campeones quedaron fatal en mi opinión (mains taliyah, los respeto por jugar un champ con mecánicas, les deseo el mejor de los buffs).","replies":[{"poster":"Salvor","date":"2018-06-02T00:32:06.040+0000","up_votes":1,"down_votes":1,"body":"> **Meddler (NA) - **\n> Yasuo ha recibido un golpe sólido por los cambios en el ítem y, a diferencia de otros, no tiene builds alternativas a las que debería estar migrando. Los objetivos probables son la penalizacion de critico de su Q (hasta -10%, como sus AAs) y AD base hasta un par de puntos.","replies":[{"poster":"RazorToddy","date":"2018-06-02T00:43:24.812+0000","up_votes":1,"down_votes":0,"body":"¿Ya le metieron Hotfix a Yasuo o está en preparación?","replies":[{"poster":"Salvor","date":"2018-06-02T00:49:47.389+0000","up_votes":1,"down_votes":1,"body":"Preparación creo.","replies":[{"poster":"skysoul fenrir","date":"2018-06-03T16:49:07.964+0000","up_votes":1,"down_votes":0,"body":"vos no te das cuenta, pero hay un nerf indirecto a gragas ahí","replies":[]}]}]},{"poster":"Šeiya","date":"2018-06-02T00:44:30.416+0000","up_votes":1,"down_votes":1,"body":"AD base y 15% más daño en la Q una vez que se tiene el 100%, no está mal. Igual no sé hasta que punto sigue siendo viable buildearse filo. \n\nHay items que te dan el mismo AD, solo que en vez de critico te dan robo de vida u otras pasivas muy buenas y son bastante mas baratos, también está la build de {{item:3046}} {{item:3078}} {{item:3072}} {{item:3053}}  que hasta el nerf de la interacción Trinity - Sterakk del parche que viene sigue siendo bastante buena.","replies":[]}]}]},{"poster":"Salvor","date":"2018-06-01T21:21:05.712+0000","up_votes":4,"down_votes":0,"body":"https://3.bp.blogspot.com/-tgcfFTOwlV8/WxGrCx_GmtI/AAAAAAABA1Q/CMFQdvzCOtkLhT56z7ZT1JQ_lOPRlSWTQCLcBGAs/s1600/7a102c939fd239aa.png","replies":[{"poster":"ALEXKOND","date":"2018-06-01T21:28:28.873+0000","up_votes":2,"down_votes":0,"body":"https://3.bp.blogspot.com/-_zTdf2l2u5g/WxGrC42qt0I/AAAAAAABA1I/5K6cAGn4lpA0BJqG1_NZug0GZlGsIe1agCLcBGAs/s1600/98d4a8cfb788e47d.png","replies":[{"poster":"Fighting Gold","date":"2018-06-02T00:32:22.554+0000","up_votes":3,"down_votes":0,"body":"Cuando tu adc se tira 1 vs 5","replies":[{"poster":"ALEXKOND","date":"2018-06-02T06:46:20.019+0000","up_votes":2,"down_votes":0,"body":"Cuando estas en promo y sale Teemo adc {{summoner:31}}","replies":[]},{"poster":"Salvor","date":"2018-06-02T00:52:55.645+0000","up_votes":1,"down_votes":1,"body":"O cuando vas a wardear un arbusto y el rengar enemigo esta feed xD","replies":[]}]},{"poster":"Mioen","date":"2018-06-02T13:50:44.182+0000","up_votes":1,"down_votes":0,"body":"https://media.lolusercontent.com/api/embedly/1/image/resize?url=https%3A%2F%2F3.bp.blogspot.com%2F-_zTdf2l2u5g%2FWxGrC42qt0I%2FAAAAAAABA1I%2F5K6cAGn4lpA0BJqG1_NZug0GZlGsIe1agCLcBGAs%2Fs1600%2F98d4a8cfb788e47d.png&key=a45e967db0914c7fb472fd4381e6c85b&width=150\n\nYo sin money y sale un emote que me representa en un 90% de la partida.(En especial cuando juego con Salvor XD.)","replies":[]}]}]},{"poster":"Excorpion","date":"2018-06-01T21:18:33.607+0000","up_votes":1,"down_votes":1,"body":"Que demencia... hasta yo pienso que pike tiene mucho daño a lvl1 y ahora se lo suben.","replies":[{"poster":"Puynsi","date":"2018-06-02T00:51:34.226+0000","up_votes":1,"down_votes":0,"body":"Riot esta cometiendo el mismo error que cometieron con la vieja eve, no mucha gente la jugaba a menos que fueran los mains y estaba dentro de todo aguantable y luego riot le metio buffs y quedo rotisima, llevandola a la interminable cadena de nerfs/buffs hasta el eventual rework.","replies":[]},{"poster":"TerrSinManos","date":"2018-06-01T22:57:48.173+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Excorpion,realm=LAS,application-id=v7qsfXsE,discussion-id=E9u3yMAb,comment-id=0001,timestamp=2018-06-01T21:18:33.607+0000)\n>\n> Que demencia... hasta yo pienso que pike tiene mucho daño a lvl1 y ahora se lo suben.\n\nMe parece que Pike depende un poco (mucho) de sacar ventaja al principio y entrar en snowball, y por eso los cambios. De cualquier manera, no he jugado lo suficiente contra él como para afirmarlo con seguridad.","replies":[{"poster":"Excorpion","date":"2018-06-01T23:52:48.253+0000","up_votes":1,"down_votes":2,"body":"Pero cuando se aprende a jugarlo, el snowball se hace solo la verdad... \nIncluso perdiendo hace poco en una partida, me pude mandar una triple, cuadra no oficial, estando casi solo.","replies":[]}]}]},{"poster":"LeGrandDuelıste","date":"2018-06-01T22:45:46.784+0000","up_votes":1,"down_votes":0,"body":"Ohhhhhhhhh Alexxx, queremos otra play tuya para festejar EL gesto que voy a comprar sólo en tu honor.\n\n[](https://www.youtube.com/watch?v=gh0OGVBwjZo)\nhttps://www.youtube.com/watch?v=gh0OGVBwjZo\n\n{{sticker:sona-playing}}","replies":[{"poster":"ALEXKOND","date":"2018-06-01T23:16:34.735+0000","up_votes":1,"down_votes":0,"body":"Ya que no es un clip de Fiora, ya tampoco voy a dejar un clip de Sona. Aunque en su lugar dejo al gran bigote:\n\nhttps://youtu.be/fWaoUdFdzWk\n\n{{sticker:fiora-cool}}","replies":[{"poster":"LeGrandDuelıste","date":"2018-06-01T23:35:07.448+0000","up_votes":1,"down_votes":0,"body":"Aaaaaaaaaaaaaaaaaaaaa mirá lo que juega ese Braum por Dios","replies":[]}]}]},{"poster":"vaVav","date":"2018-06-01T21:02:44.783+0000","up_votes":1,"down_votes":1,"body":"https://www.youtube.com/watch?v=-U8M5thayos\n\n¡Para agregar!","replies":[{"poster":"ALEXKOND","date":"2018-06-01T21:08:48.307+0000","up_votes":1,"down_votes":0,"body":"Creo que lo comentaste al mismo tiempo en que lo editaba en el post {{summoner:31}}","replies":[{"poster":"vaVav","date":"2018-06-01T21:23:06.607+0000","up_votes":1,"down_votes":1,"body":"Deja de quitarme mérito, todos sabemos que lo editaste por mi comentario.","replies":[{"poster":"ALEXKOND","date":"2018-06-01T21:29:15.589+0000","up_votes":1,"down_votes":0,"body":"Ahhh ok, lo que sea que lo haga feliz buen hombre.","replies":[]}]}]}]},{"poster":"Sir Crucifix ","date":"2018-06-01T22:17:54.267+0000","up_votes":1,"down_votes":1,"body":"Esa sona esta constipada","replies":[]}]}