{"poster":"ALEXKOND","date":"2017-08-30T02:39:15.446+0000","title":"[PBE] Actualización del 29/08","subforum":"Charlas Generales","up_votes":15,"down_votes":0,"body":"https://cdn.pbrd.co/images/GHZ83G1.jpg\n\n¡Saludos LoLer@s! El servidor de pruebas se actualiza la noche de hoy ¿Lo vemos?\n\n{{item:3632}} **Modo Competitivo basado en Equipos: Choque**\n>Se incluyeron nuevos archivos sobre un misterioso modo de juego titulado Choque. De momento solo son algunos archivos visuales y no hay forma de visualizar o jugar este modo aún:\n\n>http://imgur.com/4arMbq9\n\n>#[Álbum con muchas más imágenes disponible en este enlace](http://imgur.com/a/NgBSa)\n\n>**Riot Draggles** [comenta](https://boards.pbe.leagueoflegends.com/en/c/general-pbe-feedback/ELwjNdvb-team-based-competitive-mode-vietnam-playtest-soon):\n\n>\"Hola a todos, \n\n>Pueden que noten algunos archivos visuales flotando por el PBE (marcos, iconos, algunos elementos de Interfaz del Usuario).\n\n>Estarán en el PBE pronto para una futura prueba de característica en Vietnam, para el nuevo modo competitivo basado en equipo ¡Todo lo que vean será trabajo en progreso y sujeto a cambio! No tenemos nada que compartir en este frente aún fuera del servidor de VN, pero definitivamente les haremos saber que esta sucediendo cuando nos acerquemos más al lanzamiento global.\"\n\n___\n\n**Nuevos Iconos de Invocador**\n>Un gran total de 56 nuevos Iconos de Invocador llegan al servidor de pruebas el día de hoy. Uno representa la Copa del Invocador y el resto son para distintos equipos competitivos de LoL.\n\n>http://imgur.com/tS8lGNz\n\n>http://imgur.com/O5YFO2w\n\n___\n\n**Mapas**\n>{{item:3632}} **La Grieta del Invocador**\n\n>Se incluyeron estandartes conmemorativos del Mundial 2017 los cuales podrán verse en las transmisiones de las partidas:\n\n>https://2.bp.blogspot.com/-NREtRgmZ08Q/WaX1UcwSV5I/AAAAAAAAtEU/ahThWE9EBHcFEeWC5Uof4csWjl723yLfwCLcBGAs/s1600/Sru_Es_Banners_Worlds2017.png\n\n___\n\n**Otras Yerbas**\n>{{item:3632}} **Hablando sobre jugabilidad: 29 de Agosto**\n\n>**Riot Gaussrik** [comparte](https://boards.las.leagueoflegends.com/es/c/jugabilidad-balance-y-narrativa/fyhwx8xv-hablando-sobre-jugabilidad-29-de-agosto) - [Tema original de Meddler](https://boards.na.leagueoflegends.com/en/c/developer-corner/bkfE5v4E-quick-gameplay-thoughts-august-29):\n\n>¡Buenos días!\n> \n> **Avisos de siempre**\n> \n> Estas publicaciones a menudo contienen información acerca del trabajo a futuro que estamos realizando o planeando hacer y que no garantizamos que saldrá para el público. La naturaleza de dicho trabajo puede cambiar o, según lo que vayamos descubriendo, algunos proyectos mencionados podrían retrasarse o incluso cancelarse definitivamente.\nSi desean ver un tuit cada vez que subimos una de estas publicaciones, sígannos en: https://twitter.com/RiotMeddler\n> \n> **Runas clave del camino Inspiración**\n> \n>Supongo que la mayoría de ustedes ya las vio, pero para todos aquellos que no, esta semana publicamos algunos detalles sobre un par de runas clave más inusuales del nuevo sistema de runas. Lo mencionamos de nuevo ya que aún estamos pensando en la tercera runa clave de este árbol (Inspiración) y agradecemos cualquier idea que puedan tener.\n> \n> https://boards.las.leagueoflegends.com/es/c/charlas-generales/VzjNl9qv-el-rincon-de-las-runas-invocador-especialista-y-rayo-helado-hextech\n> \n> Características de Inspiración:\n> \n> * Daño no directo o tipo tanque\n> * Permite infringir un poco las reglas, más que otros árboles\n> * Puede incluir efectos de beso/maldición\n> * Tiende a ofrecer más adaptabilidad que poder bruto\n> \n> Características de las runas clave:\n> \n> * Son las runas más poderosas\n* Son importantes en cuanto a táctica: tendrán impacto en cómo juegas momento a momento y se pueden optimizar más que otras runas. Recibes recompensas por seguir pensando en ellas durante un rato después de la selección de campeones. En contraste, algunas otras runas son más una opción de optimización en la selección de campeones, no tienes que pensar mucho en ellas una vez que inicia la partida.\n* De alguna forma pueden modificar el estilo de juego de un campeón; sin embargo, no deberían dictarlo.\n* Deberían aplicarse a un mínimo número moderado de campeones (que no se convierta en un nicho) y, al mismo tiempo, no deben ser extremadamente atractivas para todos.\n* Solo obtienes una, así que tienen un alto costo de oportunidad. Esto significa que pueden tener cosas que influyan fuertemente en el juego, como poder intercambiar hechizos de invocador, porque estás dejando de lado bastante poder por ellas. Sin embargo, el precio para poder pasar rápido de Extenuación/Ignición al poder tardío de Destello/TP al ceder el equivalente de Fervor o Decreto es bastante grande en combate.\n> \n> \n> **Ornn**\n> \n> Nota: Esto lo estoy escribiendo el viernes en la mañana, así que para cuando subamos esta publicación es posible que algo del contenido ya no esté actualizado, sobre todo en los cambios rápidos que haremos de ahorita hasta entonces.\n> \n> Actualmente Ornn está sufriendo bastante y estamos viendo las circunstancias en las que tiene un buen desempeño y dónde no. Al mismo tiempo esperamos que tenga una curva significativa de aprendizaje y queremos intentar evitar mejorarlo demasiado al inicio si eso puede llegar a causarnos problemas más adelante (como mejoramos a Ivern, por ejemplo, quien también tenía una curva de aprendizaje bastante grande). También sospechamos que el desempeño del equipo de Ornn se está reduciendo un poco por aquellas personas que apresuran el uso de los objetos mejorados que él facilita en las circunstancias equivocadas (p. ej., usar Trifuerza cuando no es la opción correcta para tu campeón o apresurar demasiado la Máscara Abisal). Al mismo tiempo, Ornn también tiene estadísticas básicas más bajas de lo normal, así que es posible que queramos mejorarlas un poco en algún momento, ya sea en las correcciones rápidas o en una versión regular.\n> \n> \n> **Más limpieza al modo espectador**\n> \n> Ahora que los cambios a varios indicadores de equipos llevan un rato en el modo espectador, muy pronto vamos a darle otra vuelta de limpieza. Ahí el objetivo será facilitar lo más posible el acceso a la información, sobre todo en peleas en equipo complicadas en donde se vuelve difícil seguir la información. Casi seguro nuestros siguientes objetivos serán esconder pequeñas cantidades de oro de los espectadores (p. ej., el +1 o el +3 de Carterista no comunica nada importante) y esconder textos críticos del espectador (nadie necesita ver hechizos que infligen daño crítico a súbditos por pequeñas cantidades de daño mágico, por ejemplo).\n> \n> Agradecemos otras sugerencias en este ámbito. Hace ya un rato preguntamos acerca de esto y obtuvimos varias sugerencias bastante buenas que acabaron en la versión 7.16. Esta vez esperamos encontrar otras cosas, ya sea que se muestren en modo espectador y que no necesiten estar o que no se muestren y que sean suficientemente valiosas para agregarlas y justificar el cambio.\n\n>___\n\n>Nota: El tema original de Meddler tiene un texto adicional sobre Ornn que de momento no se encuentra presente en el tema compartido por **Riot Gaussrik**.\n\n>\"Actualización de Martes por la mañana: Voy a agregar un poco más aquí, en vez de solo editar el tema original para intentar mantener las cosas un poco más simples para las otras regiones traduciendo esto. Al final concluimos que Ornn estaba muy débil el Viernes pasado y le dimos un rango de mejoras de estadísticas base y enfriamiento de su definitiva. Él se desempeña mejor, aunque aún parece que sigue en el lado débil. El siguiente paso será ver su pasiva, en particular, formas en las que engaña a al menos algunas personas en pobres decisiones de objetos.\nDeberían ver algunos cambios en el PBE pronto que buscan cambiar eso (los objetos mejorados no están disponibles hasta que Ornn llega a cierto nivel como punto de partida). Luego vamos a evaluar como va su desempeño durante la semana, ver si necesitamos hacer otros cambios en el próximo parche o antes.\"\n\n___\n\n**Balance:** Recuerden, estos cambios son tentativos y pueden o no llegar al resto de los servidores\n>**Campeones:**\n\n>{{champion:69}} **Cassiopeia:**\n\n>**[Colmillos Gemelos](https://2.bp.blogspot.com/-D84qhIpcoMo/WaX6wudzxQI/AAAAAAAAtEo/V_D_CJVbhggpl_KvuxRBdduHEoZigM7mwCLcBGAs/s1600/casse.jpg) (E):**\n* Daño mágico adicional reducido a 10/30/50/70/90 de 15/40/65/90/115.\n* Radio de Poder de Habilidad incrementado a 50% de 40%\n\n>**Asyrite** [comentó](https://www.reddit.com/r/leagueoflegends/comments/6wm40h/828_pbe_update/dmaj7pt/):\n\"Actualmente estamos jugando con cambios al daño base y radio de poder de habilidad para darle un juego temprano más débil, pero un juego tardío comparable/más fuerte.\"\n\n>{{champion:516}} **Ornn:**\n\n>**[Forja Viviente](https://4.bp.blogspot.com/-RjkgtxmlYh8/WaX6w1h1dgI/AAAAAAAAtEw/D4ac3W4Mch0Ld50NpM6s6fF21I8vmm2xQCEwYBhgL/s1600/ornn.jpg) (P):**\n* Los objetos mejorados ahora solo están disponibles a partir de que Ornn llegue al nivel 13.\n\n>{{champion:497}} **Rakan:**\n\n>**[Celeridad](https://3.bp.blogspot.com/-Tekz_s0QT6g/WaX6xNbaxCI/AAAAAAAAtE0/ee2WzldXQJ0bk2FXKPFQFDot0d-A6cyEQCEwYBhgL/s1600/rakanr.jpg) (R):**\n* Enfriamiento reducido a 120/100/80 segundos de 120/110/100.\n* Radio de colisión reducido a 150 unidades de 200.\n\n>___\n\n>**Objetos:**\n\n>{{item:3109}} **[Promesa del Caballero:](https://3.bp.blogspot.com/-OPZaEMhDlVM/WaX6wh9jKdI/AAAAAAAAtEk/PaTqQQZ5XMQsGLJj1tOmnRRoD75fA5kewCEwYBhgL/s1600/knightsvow.jpg)**\n* Pasiva Única - Curación cambiada a [30 por cada 250 de daño que tu Compañero realiza] de [12% del daño que tu Compañero realiza]\n\n>{{item:3383}} **[Tiara de los Solari de Hierro](https://2.bp.blogspot.com/-UckDNrP3aG4/WaX6wtj81qI/AAAAAAAAtEs/XZx_HP_WAQErwYhJTAKdMAuNW7M5g6O6ACEwYBhgL/s1600/circlet.jpg) (Objeto de Ornn):**\n* Activa Única - Absorción de daño del escudo reducida a [35 (+22 por nivel)] de [38 (+22 por nivel)]\n* La reducción de la tasa del Escudo si un objetivo ya fue afectado por otro Relicario de los Solari de Hierro en los últimos 5 segundos ahora es de 0% en vez de 50%\n*(Nota: Previamente, el escudo era reducido a 50% si había sido afectado en los últimos 8 segundos)*\n\n>{{item:3637}} **[Nuevo] Paradoja de Zhonya (Objeto de Ornn):**\n* Costo: 3900 de Oro (2900 de Oro por el objeto base + 1000 de Oro por la mejora)\n* Estadísticas adicionales:\n * +30 Poder de Habilidad (100 Poder de Habilidad total)\n * +15 Armadura (60 Armadura total)\n\n>https://4.bp.blogspot.com/-7DMnTLJcGYo/WaX6xmRkF0I/AAAAAAAAtE4/BeCHTZZVX9IJnbtD3IequSM5ov0mv-IoQCEwYBhgL/s1600/zhonyas.jpg\n\n___\n\n\nPágina(s) consultada(s) en la creación de este tema:\nS@20: [www.surrenderat20.net](http://www.surrenderat20.net)\nhttp://i.imgur.com/XgSKsiK.gif","replies":[{"poster":"El Impostor","date":"2017-08-30T02:49:23.937+0000","up_votes":5,"down_votes":1,"body":"Buffs a Rakan?\n\nhttps://www.youtube.com/watch?v=fvtQYsckLxk","replies":[{"poster":"Mugman Rojo","date":"2017-08-30T03:02:28.903+0000","up_votes":3,"down_votes":1,"body":"me encanta","replies":[]},{"poster":"Selah","date":"2017-08-31T19:03:38.984+0000","up_votes":1,"down_votes":0,"body":"Es un ajuste a la R, tiene menos cd pero debe acercarse mas para activar el charm.","replies":[]}]},{"poster":"spitfire1945","date":"2017-08-30T12:23:19.707+0000","up_votes":1,"down_votes":0,"body":"Mirando las imágenes y la grilla del misterioso modo de juego, me parece que se trata de la apuesta que podemos hacer los invocadores acerca de como va a ir desarrollándose el mundial, fijate que las imagenes concuerdan con las categorías que nos ponían cuando acertábamos o dependiendo de los puntos acumulados (lóbrego, rocoso,etc). Lo veo como que están haciendo una herramienta in game y no por la pagina. Está genial","replies":[{"poster":"ALEXKOND","date":"2017-08-30T16:16:01.429+0000","up_votes":1,"down_votes":0,"body":"Interesante, creo que estas en lo cierto ahora que lo mencionas. Aunque me intriga la parte de \"por equipos\", eso si seria algo nuevo (asumiendo que no se refiera a equipos competitivos).","replies":[{"poster":"spitfire1945","date":"2017-08-30T17:19:40.959+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ALEXKOND,realm=LAS,application-id=v7qsfXsE,discussion-id=ex0EPcOE,comment-id=00070000,timestamp=2017-08-30T16:16:01.429+0000)\n>\n> Interesante, creo que estas en lo cierto ahora que lo mencionas. Aunque me intriga la parte de &quot;por equipos&quot;, eso si seria algo nuevo (asumiendo que no se refiera a equipos competitivos).\n\nSÍ, también me deja un poco de duda las imágenes de las distintas ligas de elo de invocador (de bronce para arriba), quizás ponen un torneito o algo así extra por los puntos.\n Primero había pensado que era un modo de juego tipo torneo donde se mezclaban todos los elos, pero me convenció mas la teoría del prode x el mundial.","replies":[{"poster":"ALEXKOND","date":"2017-08-30T18:06:18.915+0000","up_votes":2,"down_votes":0,"body":"Si sabes inglés, este post de reddit te puede aclarar todas las dudas:\nhttps://www.reddit.com/r/leagueoflegends/comments/6wz1ia/clash_on_pbe/\n\nProbablemente lo coloque traducido en el siguiente post del PBE que salga.","replies":[{"poster":"spitfire1945","date":"2017-08-30T18:24:19.609+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ALEXKOND,realm=LAS,application-id=v7qsfXsE,discussion-id=ex0EPcOE,comment-id=0007000000000000,timestamp=2017-08-30T18:06:18.915+0000)\n>\n> Si sabes inglés, este post de reddit te puede aclarar todas las dudas:\n> https://www.reddit.com/r/leagueoflegends/comments/6wz1ia/clash_on_pbe/\n> \n> Probablemente lo coloque traducido en el siguiente post del PBE que salga.\n\nGracias alex! \n\nhttp://i.imgur.com/Z9kcfgI.png%5B/img%5D?noredirect","replies":[]}]}]}]}]},{"poster":"LemønPykë","date":"2017-08-30T03:11:30.204+0000","up_votes":1,"down_votes":1,"body":"2 modos de juego en 2 parches? ya oyes lo loco que suena eso? xD","replies":[{"poster":"ALEXKOND","date":"2017-08-30T03:19:44.775+0000","up_votes":3,"down_votes":1,"body":"Es todo especulación mía de momento ya que no hay información, pero pareciera ser algo distinto a un simple modo de juego.","replies":[]}]},{"poster":"Excorpion","date":"2017-08-30T02:45:27.603+0000","up_votes":4,"down_votes":7,"body":"Como romper el solari aún más... XD\nCuano sacarán Eco de Boluden, con plus que las salpicaduras reboten una vez más ???","replies":[{"poster":"ECO DE BO LUDEN","date":"2017-08-30T13:30:17.461+0000","up_votes":3,"down_votes":0,"body":"El aumento va hacer caer un diluvio XD","replies":[{"poster":"Excorpion","date":"2017-08-30T14:19:01.824+0000","up_votes":1,"down_votes":0,"body":"Jajajajaj no pensé que había alguien con ese nick xDDD","replies":[]}]},{"poster":"Yitán","date":"2017-08-30T14:28:18.459+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Excorpion,realm=LAS,application-id=v7qsfXsE,discussion-id=ex0EPcOE,comment-id=0000,timestamp=2017-08-30T02:45:27.603+0000)\n>\n> Como romper el solari aún más... XD\n> Cuano sacarán Eco de Boluden, con plus que las salpicaduras reboten una vez más ???\n\npero si tuvo buff y nerf","replies":[{"poster":"Excorpion","date":"2017-08-30T17:58:55.159+0000","up_votes":1,"down_votes":0,"body":"Sigue estando op, como siempre... Es como un thresh nunca falla","replies":[]}]}]},{"poster":"erwinchelo","date":"2017-08-30T10:07:40.129+0000","up_votes":1,"down_votes":0,"body":"me explican lo del {{item:3383}} ?","replies":[{"poster":"Hnk Kenshiro","date":"2017-08-30T14:30:29.389+0000","up_votes":1,"down_votes":0,"body":"~~Si ahora tiras 2 solaris juntos, ambos tienen el 100% de poder.~~\n\n~~Actualmente si tiras el 2º se reduce a la mitad el escudo.~~\n\n-_-\n\nEra al revés, ahora el 2º solari no aplica escudo, en ingles se entiende mejor :p","replies":[{"poster":"Ks Erwyn","date":"2017-08-30T17:54:26.705+0000","up_votes":1,"down_votes":0,"body":"terrible nerf entonces, no recordaba lo de tener 2 solaris por eso me confundió...","replies":[]}]}]},{"poster":"SenpaiDeathx","date":"2017-08-30T15:13:43.970+0000","up_votes":1,"down_votes":0,"body":"sabes con que parche se jugara el mundial?","replies":[{"poster":"ALEXKOND","date":"2017-08-30T16:13:29.718+0000","up_votes":1,"down_votes":0,"body":"7.18","replies":[]}]},{"poster":"Jieuno","date":"2017-08-30T05:39:33.463+0000","up_votes":1,"down_votes":0,"body":"rito trolleando a isurus con su icono que no saldrá :c","replies":[]},{"poster":"Challenger15","date":"2017-08-30T03:03:40.281+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"ALEXKOND","date":"2017-08-30T03:08:20.217+0000","up_votes":1,"down_votes":0,"body":"Imagino que te referís a este tema:\nhttps://boards.las.leagueoflegends.com/es/c/charlas-generales/agb9ZEQA-pbe-actualizacian-del-0808\n\nPodes consultar todos los post del PBE en este enlace:\nhttps://boards.las.leagueoflegends.com/es/player/las/ALEXKOND?content_type=discussion","replies":[]}]}]}