{"poster":"ignacionalon","date":"2015-04-07T04:34:39.453+0000","title":"main adc busco supp para duo","subforum":"Reclutamiento","up_votes":1,"down_votes":0,"body":"Hola mi nombre es ignacio soy bronce 2 (por culpa de los toxicos que trolean) tengo 14 a&ntilde;os soy de chile,\r\n\r\ndesde que era nivel 20 me e planteado en cual debe ser mi main y finalmente me e decidido por adc,aun no domino muchos campeones adc pero poco a poco e mejorado con ellos\r\n\r\nEl personaje que mejor suelo jugar es jinx,y actualmente estoy practicando con vayne y graves\r\n\r\nESTILO DE JUEGO:\r\nsoy muy agresivo en linea me encanta siempre ser el dominador de ella (siempre tirandome con cabesa) a la ves de ser agresivo tambien es importante tener un buen farmeo,al minuto 10 llevo 40-70 minions,uno de mis puntos debiles es mi posicionamiento en mid lane game,eso lo tengo que mejorar\r\n\r\nREQUISITOS:\r\nsi estas interesado en ser mi duo debes De\r\n-tener dosponibilidad diaria de 6-9pm (hora chilena,argentina,uruguaya)\r\n-no ser toxico,todos cometemos errores y hemos fedeado alguna ves\r\n-ser agresivo en early (opcional)\r\n-tener +11 a&ntilde;os\r\n\r\neso es todo espero que alguien se interese en aser duo conmigo :)","replies":[{"poster":"Revolución","date":"2015-04-07T12:39:29.720+0000","up_votes":1,"down_votes":0,"body":"Primero: No te avergüences de tu liga, no jugás hace tanto y eso de ser bronce 2 por los tóxicos que trollean es la peor mentira del mundo, lo primero que tenés que hacer para salir de bronce es asumir que estás ahí por algo y que vas a salir cuando mejores.\n\nDecir \"soy main adc\" por usar 3 picks es un poco como que te falta mucha cancha en el rol, ¿realmente sabés bien qué hacen todos los adc y los soportes y los tiempos de enfriamiento de sus habilidades? tu promedio de farm con Jinx en las 4 rankeds que la usaste es inferior a 190 y tu KDA tiene un promedio de 8 muertes, o te está faltando posicionamiento o lo de jugar tan agresivo como pusiste te está pasando factura. De hecho, vos mismo pusiste \"también es importante tener un buen farmeo, al minuto 10 llevo 40-70 minions\", eso no es buen farmeo, de hecho 70 sería recién aceptable, si llegaste al minuto 10 con menos de 50 es directamente espantoso.\n\nMi consejo viendo tus estadísticas es que no rankees por el momento, te falta muchísima práctica, ni siquiera llevas 300 victorias en normales. No digo que seas malo, todavía te falta un golpe de horno para poder jugar bien, quizás estés encaminado pero así como estás jugando hasta incluso me parece generoso que estés en bronce 2.\n\nSaludos y espero que entiendas el mensaje que va con la mejor onda!","replies":[{"poster":"ignacionalon","date":"2015-04-07T18:15:22.824+0000","up_votes":1,"down_votes":0,"body":"muchas gracias por tu comentario,como dije mi punto debil es el mal posicionamiento,nunca hay wards en el mapa,busco un support para mejorae junto a el y tienes razon 40 minions al minuto 10 es espantoso,y lo de jugar agresivo creo que tambien pasa factura,por eso me e propuesto a mejorar cada dia,yo cuando juego normales nadien elije supp siempre asen duo top,o sale el tipico toxico que dice troleo\n\ncomo dije anteriormente el posicionamiento es mi punto mas flojo,y la mayor parte de ello es porque no hay ningun ward en el mapa,lo se debo de ser mas precavido y usar el trinket azul\n\nLa razon por la cual quiero un supp duo es para mejorar\n\nVoy a mejorar todo lo que dijiste en tu comentario,saludos :)","replies":[{"poster":"Revolución","date":"2015-04-07T22:25:20.917+0000","up_votes":1,"down_votes":0,"body":"de nada, el primer paso hacia mejorar es aceptar la crítica constructivamente y trabajar en ello! \n\nEs práctica lo del posicionamiento, es algo que incluso los pros por ahí erran, lo que te recomiendo es practicar kiteo que es fundamental (ejercicio de moverte mientras recarga tu básico, sería básico, atrás, básico, atrás y así. Las botas con encantamiento Furia favorecen mucho el ejercicio y practicarlo con Kalista es lo mejor para aprender por su pasiva). Siempre se recomienda mirar con mucha atención estar fuera de los rangos de los rivales y pegarle al que tengas en tu rango, NO buscar focusear al adc enemigo, por ejemplo. El adc lo que debe hacer es aportar daño y es muy flan, el equipo contrario te va a querer focusear, entonces tu deber es estar fuera de peligro aportando la mayor cantidad de daño posible, el adc es daño constante por lo que es ideal para romper líneas frontales enemigas, así que si alguien te dice \"estás focuseando al tanque\" no es error, de hecho es acierto porque si no lo rompe el adc no lo rompe nadie.","replies":[]}]}]}]}