{"poster":"elgorigeller","date":"2017-03-10T15:19:01.324+0000","title":"aatrox 34% jg y 38% de winrate top","subforum":"Charlas Generales","embed":{"description":"League of Legends Statistics including Win Rate, Ban Rate, Play Rate, Kills, Deaths by Champions and the roles they play.","url":"https://champion.gg/statistics/#?sortBy=title&order=ascend&roleSort=Top","image":null},"up_votes":1,"down_votes":3,"body":"Aatrox en &eacute;ste parche es tanto el peor jungler como el peor top del juego, con un winrate tan bajo que se podr&iacute;a considerar directamente como un trollpick hasta siendo usado en sus roles principales.\r\nNo s&eacute; cu&aacute;nto era el winrate del parche anterior, pero no creo que haya sido tan bajo como el que tiene ahora.\r\n\r\n&iquest;Esto se supon&iacute;a que era un buff?","replies":[{"poster":"Kyousuke","date":"2017-03-10T15:22:23.450+0000","up_votes":3,"down_votes":0,"body":"va a haber un hotfix con buffos para aatrox en nada, meddler ya dijo que su desempeño es malo y van a corregirlo\n\nhttp://boards.na.leagueoflegends.com/en/c/developer-corner/Qa21ePAW-quick-gameplay-thoughts-march-9\n\n> Aatrox looks like he's almost certainly too weak by a noticeable margin. We're looking at possible buffs, with a decent chance we hotfix at least some of them out. We would expect Aatrox to struggle somewhat as players adapt to new builds, the changed passive etc, it looks like his kit's just too weak as well though. Le Blanc, Varus and MF may also have been hit too hard, so we're both looking at where they've landed to understand it better and considering what we'd do if that were true (want to answer questions like impact on Support MF versus ADC MF, how much LB's performance is affected by some players not yet changing skill rank up orders etc).","replies":[{"poster":"elgorigeller","date":"2017-03-10T17:04:48.091+0000","up_votes":1,"down_votes":0,"body":"Gracias por la data!","replies":[]}]},{"poster":"SenpaiDeathx","date":"2017-03-10T15:30:43.833+0000","up_votes":1,"down_votes":0,"body":"recien esta el parche.... hay que acostumbrarse porque como lei a un rioter hace poco, el nuevo atrox se deberia jugar como un coloso, con items defensivos y de vida, y ya no como un campeon full ad. Pero toma tiempo que los jugadores se acostumbren a un rework","replies":[{"poster":"Salvor","date":"2017-03-10T15:52:45.950+0000","up_votes":1,"down_votes":0,"body":"Para mi el problema del nuevo aatrox esta en \"como buildeas a un tanque con atack speed\" No hay items para este caso.","replies":[{"poster":"Fenrito","date":"2017-03-10T16:02:02.719+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Salvor Hardin,realm=LAS,application-id=v7qsfXsE,discussion-id=hjpE5mGR,comment-id=00020000,timestamp=2017-03-10T15:52:45.950+0000)\n>\n> Para mi el problema del nuevo aatrox esta en &quot;como buildeas a un tanque con atack speed&quot; No hay items para este caso.\n\nNo tanque sino coloso osea offtanks o bruiser. Los campeones cuando se los cambia o son nuevos casi nunca salen con buen winrate de entrada. Kled y camille salieron con bajo winrate y ahora están en el meta","replies":[{"poster":"Skjaldmo","date":"2017-03-10T17:17:36.629+0000","up_votes":1,"down_votes":0,"body":"Camille salio rota y  con win rate superior al 50% llegando al 56% que bajo despues de los nerfs","replies":[]}]}]}]},{"poster":"Mobius One","date":"2017-03-10T15:49:34.240+0000","up_votes":1,"down_votes":0,"body":"estaba mejor cuando lo dejaban super op y luego lo nerfeaban, qué pasó rito? perdiste tu toque","replies":[]}]}