{"poster":"Yozora","date":"2015-06-17T23:35:15.313+0000","title":"No se unan a la chusma (insultar NUNCA les ayudará).","subforum":"Nuevos jugadores","up_votes":3,"down_votes":0,"body":"Saludos a todos!! Antes que nada, quisiera enviarles saludos a todos aquellos que hayan jugado con un tipo con nickname de chica japonesa xD (yo) y que me hayan ayudado a ser un mejor gamer :D.\r\nEn fin, empezar&eacute;: comenc&eacute; a jugar al LoL hace casi nueve meses m&aacute;s o menos, he ganado, he perdido, me he rendido, en s&iacute;ntesis, lo que todos alguna vez hicimos. Honestamente disfruto mucho de este juego, al que llegu&eacute; de casualidad y por curiosidad, y encuentro en &eacute;l muchas cosas que me alegran el d&iacute;a a d&iacute;a, como el cooperar mutuamente en una gran victoria o soportando una derrota digna. Soy lo que muchos de ustedes llamar&iacute;an un noob, ya que aveces cometo errores est&uacute;pidos y hago que mi equipo pierda, y no conozco gran parte del vocabulario lolero, aunque soy lv 16.\r\nPero no es eso de lo que quiero hablar.\r\nQuiero (si tengo suerte y no me censuran) decir lo que pienso del defecto m&aacute;s grande que tienen muchos jugadores. Insultar gratuitamente.\r\nS&eacute; que &eacute;ste es un juego muy competitivo y todo eso, pero la pura verdad es que en ocasiones me dan ganas de matar (de verdad xD) a los t&iacute;picos teammates que lo &uacute;nico que hacen es echarte en cara cuando te mueres, cuando te atrapan, cuando su support se equivoca, qu&eacute; te compras, qu&eacute; campe&oacute;n usas y lo que me parece m&aacute;s pat&eacute;tico: meterse con temas con los que no hay que meterse (a mi entender).\r\nPor ejemplo: ``te voy a matar neg...... tarad....&acute;&acute; , &acute;&acute;no sabes jugar sos un p.....&acute;&acute;, ``and&aacute; noob de m.....&acute;&acute;, dej&aacute; de manquear hij......&acute;&acute;, en fin, creo que los puntos hablan por s&iacute; solos. \r\nLamentablemente para muchos, LoL es un juego de cooperaci&oacute;n, si bien depende en gran medida de lo que cada uno haga individualmente. Por eso creo que vale la pena cooperar si uno de los nuestros pide ayuda, si le queda poca vida, si necesita un support, si no puede pasar, si tiene lag (importante, internet no es perfecto)  y algo que tambi&eacute;n ayuda mucho (realmente), incentivar el compa&ntilde;erismo, aunque en el 99,9 % de las partidas no conozcamos a quienes juegan con nosotros.\r\n``Suerte a todos&acute;&acute; ``Vamos a ganar, chicos&acute;&acute; ``Tranquilo, ya te ayudo&acute;&acute; ``No hay problema, te cubro un toque&acute;&acute; ``Gracias por la ayuda&acute;&acute; ``Comprate este item, te va a ser m&aacute;s &uacute;til&acute;&acute; ``Lindo skin&acute;&acute;. &Eacute;stas son cosas que he puesto en el chat durante las partidas, y no miento al decir que me ha ido mucho mejor cuando un equipo, ya sea ignorante, novato, intermedio, profesional, o dios xD se respeta, ayuda. y coopera. De lo contrario, prueben con poner juntos a 5 engre&iacute;dos (creo que se les dice flammers) que se creen los mejores y que juegan a cada uno lo que quieren y comparen su desempe&ntilde;o con un team que sea todo lo contrario. Yo lo he hecho, y el resultado fu&eacute; l&oacute;gico.\r\nArt&iacute;culo aparte ser&aacute; lo que cada invocador tenga en su cabeza, su noci&oacute;n de respeto, etc. Eso ya no depende de los tontos idealistas como yo que creen que pueden cambiar al mundo (o a LoL, en este caso). Solamente quiero dejar plasmado en alg&uacute;n lado lo que pienso de la mayor&iacute;a de las relaciones online en este tan hermoso (y dif&iacute;cil) juego. Si no, no har&iacute;a falta que lo posteara. Seguramnente ya hubo much&iacute;simos posts con el mismo tema que el m&iacute;o, pero la democracia nunca est&aacute; de m&aacute;s, creo.\r\nComenten lo que piensan, todas las opiniones ser&aacute;n o&iacute;das con gusto (y las leer&eacute; a todas :D), siempre que vayan con respeto (o al menos sin insultos, que es de lo que estoy hablando). Muchas gracias a quien sea que haya le&iacute;do este post, y al que lo comente le regalo RP (perd&oacute;n, no llego a tanto xD).\r\nNos vemos en los ...... en los...... ehhmmmm...... los....... ah, s&iacute;! Campos de la justicia!! (que no siempre tienen algo de cosas justas, creo que es una iron&iacute;a jajajaja).","replies":[{"poster":"Yozora","date":"2015-06-30T17:42:56.386+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias por los comentarios! La verdad es que creí que nadie leería mi post, así que me puse contento. nacho123456igna si sabes como agregarme te lo re agradecería :D o yo a ti. Y si, hay muchas cosas que no sé, pero confío en que podré mejorar. rokushoger lo que me dijiste me dejo pensando y estoy cayendo en la cuenta de que..... tienes razón!!! tirarse a ayudar siempre no es una buena opción y no me había dado cuenta hasta ahora :C gracias por en consejo.\nPor cierto, qué me conviene más para top: {{champion:59}}  o {{champion:157}} si saben porfa xD","replies":[]},{"poster":"Neoburstx","date":"2015-06-18T17:25:24.859+0000","up_votes":1,"down_votes":0,"body":"yo disfruto mas una partida en la que hay buena onda en el equipo, aun si la perdemos. No me gusta cuando el team se pone triste por que ahi se empiezan a cometer errores :v {{champion:432}}","replies":[{"poster":"rokushoger","date":"2015-06-20T19:54:27.222+0000","up_votes":1,"down_votes":0,"body":"Recién me pasó esto exactamente. Jugué 2 aram, uno un team super tóxico pero ganamos, y sentí que no me divertí para nada, y otro que eran re buena onda pero la perdimos, y la verdad me re divertí.","replies":[]}]},{"poster":"rokushoger","date":"2015-06-20T19:53:13.164+0000","up_votes":1,"down_votes":0,"body":"Lo de ayudar si tiene lag... digo todos tenemos acceso gratuito a programas de testeo de ping, incluso hay uno específico para lol, por lo que no hay excusa de que al entrar gastar 3 minutos en tirar un chequeo y si tenés lag no jugar, no te arruinas una partida ni se la arruinas a 4 personas más. Entrar a jugar con lag hoy día (hablo de ping elevados constantes, digo todos podemos sufrir un bajon momentaneo o justo el server te tira o algo así y de eso no hay quien se salve) es tan egoísta como trolear o quedarse afk.\n\nTambién el tema de ir a ayudar a la línea que le va mal es complicado, porque tal vez tu piensas que es una buena idea, pero probablemente vas a caer contra un champ que esta feed y que tiene altas chances de matarte, y además le dejas la linea libre a tu contrincante para farmear, o incluso te puede seguir y terminar en un 2 a 0 a favor del contrario. Hay veces que culpan a los jungla de no gankear, pero no siempre ayudar al que va mal es la mejor estrategia, capaz conviene snowbolear al que va bien para compensar luego en las teamfights, y acelerar que le tiren la torre al que va mal para que se una a los gankeos, generando oro diferencial me explico? Es complicado, pero con experiencia te vas a dar cuenta que no siempre estás ayudando al ayudar a otro.\n\nFuera de eso mejor que actitud positiva a mi me funciona no hablar (solo para timear ult, o para algo estratégico del momento), porque las veces que he querido calmar ánimos o comentar otras cosas, o incluso dar un consejo (en una bien claro, no diciendo \"che noob de mi... como te vas a comprar x en vez de y) me ha salido contraproducente. \nY lo mejor en el momento en que alguien molesta es directamente mutear y seguir jugando, sin contestar.","replies":[]},{"poster":"PiPiNo","date":"2015-06-18T19:21:01.645+0000","up_votes":1,"down_votes":0,"body":"queres que te ayude a jugar? te puedo hacer perfeccionar tus tecnicas!ya que como sos lvl 16 hay muuuchas cosas que todavia no sabes","replies":[]},{"poster":"Flarranagaa","date":"2015-06-18T18:08:40.167+0000","up_votes":1,"down_votes":0,"body":"¡Me gustó el post! Todos debemos estar por una comunidad sin gente tóxica, donde se le de importancia a la cooperación y la buena onda. Todos sabemos que Rito trabaja todos los días para mejor la experiencia de juego.","replies":[]}]}