{"poster":"LoLDaschoDE","date":"2019-06-09T07:58:18.754+0000","title":"Retro-Spielmodus ?","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":2,"body":"Hallo, ich habe mir einen Spielmodus namens Retro (ich bin nicht so kreativ) ausgedacht und wollte euch fragen was ihr von dem Modus haltet.\r\nNähmlich habe ich es mir so überlegt das man alle Items und Champions der 1sten Season spielen/kaufen kann. Es ist natürlich auch schwer zu sagen welchen Patch man von der 1 Season nimmt (am besten einen wo jeder Champion ungefähr gleich stark ist). \r\n\r\nJungle: Der Jungle ist eines der Sachen wo über die Jahre die meisten Änderungen Vorgenommen wurden. (von den Positionen)\r\n             Trotzdem würde ich den Jungle 1 zu 1 übernehmen.\r\n\r\nGrafik: Es sollte bei den Grafiken dennoch bei den neueren bleiben. Außer man macht es wie z.B. bei der Winter-Map wo man in den Einstellungen die Map\r\n            umstellen kann, jedoch ist es schwer das mit den Champion und Monstern zu machen.\r\n\r\nGrund: Der Grund warum ich überhaupt dies überhaupt Vorschlage ist das die neueren Spieler (wie ich) vieleicht sich auch man Interessieren würden wie \r\n             sich manche Champions früher angefühlt haben oder welche Item Builds damals Meta waren.\r\n\r\n\r\nIch hoffe euch gefällt die Idee und wenn nicht schreibt bitte Verbesserungs- oder auch Umsetzungsvorschläge in die Kommentare.\r\n\r\nWünsche euch Noch einen schönen Tag\r\n\r\nLoLDaschoDE","replies":[{"poster":"flinxxx","date":"2019-06-09T11:26:15.559+0000","up_votes":3,"down_votes":0,"body":"Auf eine ähnliche Frage gab es in der Vergangenheit mal eine Antwort von Riot - sinngemäss: aus technischer Sicht nicht machbar. \n\nSchätzungsweise sind die Brüche in der Weiterentwicklung der gesamten Api und Schnittstellen so gross, dass keine Abwärtskompatbilität (will heissen, die alten Sourcen sind weder lauf- noch compilile-fähig) mehr vorhanden ist und der Aufwand, Teile des alten Systems neu wieder zu entwickeln - keiner vertreten kann...","replies":[]},{"poster":"Izaya Kumiho","date":"2019-06-09T08:05:13.615+0000","up_votes":2,"down_votes":0,"body":">Grafik: Es sollte bei den Grafiken dennoch bei den neueren bleiben. Außer man macht es wie z.B. bei der Winter-Map wo man in den Einstellungen die Map\numstellen kann, jedoch ist es schwer das mit den Champion und Monstern zu machen.\n\nAber das Potato-feeling fehlt ohne die Ecken und Kanten !\n\nhttps://i.kym-cdn.com/photos/images/original/001/276/508/e20.jpg","replies":[]}]}