{"poster":"LKMT00","date":"2019-06-30T10:54:08.488+0000","title":"Quiero un champ para mainear /rol jg/quien me recomiendas y porque?","subforum":"Guias y consejos","up_votes":2,"down_votes":1,"body":"Soy un jugador de la s3 no eh jugado mucho el juego a comparación de otros pero e tenidos a algunos champs que e maineado como ekko ,el monito,el oso ,zac,shen y trynda .\r\nBueno quiero subir mi cuenta chica de division ,es unraked asi que me puedo permitir aprender un champ nuevo .\r\nLa cuestión es que no se que champ puede estar divertido jugar y que sea util para carriar partida .\r\nSi pueden  sugerir un champ del rol jg pls..se lo agradecería.","replies":[{"poster":"PalomasDOOM","date":"2019-06-30T13:15:04.429+0000","up_votes":1,"down_votes":0,"body":"{{champion:60}} {{champion:28}} {{champion:24}} {{champion:59}} {{champion:120}} {{champion:56}} {{champion:80}} {{champion:23}}","replies":[{"poster":"LKMT00","date":"2019-06-30T16:08:18.033+0000","up_votes":2,"down_votes":0,"body":"Almenos eres uno de los poco que que me entendió la pregunta porque todos me decian los champs que ya había maineado voy a ver si maineo eve","replies":[]}]},{"poster":"NøPuedenCønmigø","date":"2019-07-02T18:08:15.693+0000","up_votes":1,"down_votes":0,"body":"?????","replies":[]},{"poster":"Omega Darkon","date":"2019-06-30T12:06:28.779+0000","up_votes":1,"down_votes":0,"body":"Antes que nada te quería decir que no importa que tipo de cuenta tengas (sin clasificar, plata, oro, retador) siempre podes aprender a usar un campeón jugando contra bots, normales y en la herramienta de practica.\nAhora, yo te diría que uses a Tryndamere, ya que lo usaste con anterioridad creo que es una buena elección (Igual los otros que dijiste están buenos también). De los que no te recomiendo son a Volibear (el oso) y a Shen, el primero porque le van a hacer un rework, y el segundo porque creo que es el mas difícil de todos los que dijiste.","replies":[{"poster":"Omega Darkon","date":"2019-06-30T12:08:52.074+0000","up_votes":1,"down_votes":0,"body":"Eso si, si queres subir de vedad, solo tenes que usar 1 y ser el mejor con ese campeón. Si usas muchos, lo único que vas a lograr va a ser perder tiempo y hacer mucho mas lento el proceso de subir de ELO.","replies":[{"poster":"LKMT00","date":"2019-06-30T16:18:06.876+0000","up_votes":1,"down_votes":0,"body":"Bueno desde 2 temporada que juego asi sin rol fijo ni champ main solo jugaba con cualquier cosas y subi probando champs en ranked pero igual se que hay que tener un champ main porque vas a estar acostumbrado a él y podes ganar mas facil .","replies":[{"poster":"Omega Darkon","date":"2019-07-02T02:04:49.464+0000","up_votes":1,"down_votes":0,"body":"Ademas de que es un poco troll ir a clasificar con un campeón que no sabes usar.","replies":[]}]}]}]},{"poster":"vivakayn","date":"2019-06-30T14:22:34.966+0000","up_votes":1,"down_votes":0,"body":"mi nick lo dice todo owo","replies":[{"poster":"xCrossout","date":"2019-07-01T06:47:32.523+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=vivakayn,realm=LAS,application-id=8sKIclmi,discussion-id=yq9PQZz5,comment-id=0004,timestamp=2019-06-30T14:22:34.966+0000)\n>\n> mi nick lo dice todo owo\n\nViva Kayn!\n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"LKMT00","date":"2019-06-30T16:14:38.049+0000","up_votes":1,"down_votes":0,"body":"Nose es un nombre que hubiera puesto otro aun que no pense mucho ya que no pensaba que ocuparia tanto la cuenta","replies":[]}]},{"poster":"Alba Meira","date":"2019-07-01T00:38:49.798+0000","up_votes":1,"down_votes":0,"body":"Kayn {{champion:141}} , si te moves bien, rápido y sin perder tiempo ganas el juego en 20 min 25 maximo","replies":[]},{"poster":"FullRams","date":"2019-06-30T11:57:49.972+0000","up_votes":1,"down_votes":0,"body":"> champs que e maineado como ,el monito,el oso ,zac,shen y trynda \n\nTodos esos estan bien.","replies":[{"poster":"Rusheri","date":"2019-06-30T12:38:09.871+0000","up_votes":1,"down_votes":0,"body":"Solo voli esta bien de esos.","replies":[{"poster":"FullRams","date":"2019-06-30T12:46:20.362+0000","up_votes":1,"down_votes":0,"body":"Por que lo decis?\n\nYo use una vez a shen y una vez a voli, con voli senti toda la partida que me faltaba aguante y daño, y ninguno de los dos stats compensaba lo que me faltaba del otro tampoco. \n\nCon shen gane tranquilamente.\n\n(Me falta mejorar con ambos, pero voli tiene limitantes muy grandes, recibe mucho daño se tiene que acercar corriendo, su flash tarda lo mismo en recargarse que el de los demas no podes sorprender y de daño se queda corto porque incluso con la r se te escapan y te inician despues)","replies":[{"poster":"Rusheri","date":"2019-06-30T13:21:10.979+0000","up_votes":1,"down_votes":0,"body":"Primero, que hayas jugado una partida no te da el conocimiento para decidir si un campeon esta bien o no en X linea-\nSegundo, shen jg? No va a subir nada con ese pick.","replies":[{"poster":"FullRams","date":"2019-06-30T13:33:11.158+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rusheri,realm=LAS,application-id=8sKIclmi,discussion-id=yq9PQZz5,comment-id=0000000000000000,timestamp=2019-06-30T13:21:10.979+0000)\n>\n> Primero, que hayas jugado una partida no te da el conocimiento para decidir si un campeon esta bien o no en X linea-\n> Segundo, shen jg? No va a subir nada con ese pick.\n\nClaro, pero por que dices que el oso esta bien? en que te basas?\n\nNo discuto que sea asi, claro que sabes ams que yo tienes mas experiencia, pido que me expliques el por que seria como dices nomas.","replies":[{"poster":"Rusheri","date":"2019-06-30T16:03:55.383+0000","up_votes":1,"down_votes":0,"body":"Me baso en su winrate y pickrate. Si un campeon tiene mas de 51% winrate y una base de 1% winrate es considerado un pick fuerte, cuanto mas sobrepase esos numeros un campeon ya es fuerte.\nPuede pasar que por ejemplo, trynda en jg, tiene 55%winrate pero tiene 0,4% o menos de pickrate, por lo que no esta fuerte. Lo que pasa es que solo lo usan los otp y por eso su elevado winrate.\nVoli tiene 1,8% pickrate y 51,7% winrate. No esta bien, esta bastante bien.","replies":[{"poster":"FullRams","date":"2019-06-30T16:16:31.274+0000","up_votes":1,"down_votes":0,"body":"Ah, pero osea, no usas al campeon?\n\nYo tambien miro paginas, pero asi datos al aire no me dicen nada, si no hay un sustento de por que algo esta fuerte como que no tiene sentido.\n\nPense que como tenes mas experiencia me podias explicar cual seria la ventaja que tiene.","replies":[{"poster":"Rusheri","date":"2019-06-30T16:36:37.287+0000","up_votes":1,"down_votes":0,"body":"Estas literalmente a menos de 3 clicks para ver mi op.gg en esta cuenta que es smurf e incluso tengo varios games en ranked.\nY no, no tengo que jugarlo para saber si esta roto o no. Para algo estan los numeros y estadisticas de paginas como op,gg, champion.gg, porofessor.gg y leagueofgraphs.\nY no son datos al aire, el problema es que no los analizas.","replies":[{"poster":"FullRams","date":"2019-06-30T16:46:37.185+0000","up_votes":1,"down_votes":0,"body":"Buenas, no te alteres, no es mi intencion molestarte, pero ya que me das un consejo estaria bueno que me explicaras el por que. \nDe nuevo no discuto que me digas que es buen o mal campeon tal o cual, pero si no me explicas porque no tiene sentido.\nOsea, si porque una pagina lo dice, voy a una partida llevo tu voly y salgo 0-25 que paso? paso que no se entiende por que es buen campeon. De hecho, como dices te busque desde la primera respuesta. En tus ultimas partidas no has usado volibear jungla, lo has usado top, y aun asi hay una buena y una mala segun kda y farm.\n\nEs medio ambiguo que me digas usa esto y no lo hagas tu.","replies":[{"poster":"Rusheri","date":"2019-06-30T17:15:34.659+0000","up_votes":1,"down_votes":0,"body":"No me molestas, solo te estoy explicando. \nSeguis sin entender, que vos no sepas usarlo y te vaya mal en un game no quiere decir que el campeon sea malo.\nNo se como explicartelo ya, pero voy a hacer un intento.\nSi una pagina analiza TODAS las partidas de determinado elo, y saca los numeros de que volibear gana mas partidas de las que pierde, significa que el campeon esta bien.\nAhora, respecto a lo ultimo, no no es ambiguo que yo diga que X campeon es fuerte y no lo use.\nEl campeon puede ser fuerte y no gustarme, o tengo qeu jugar campeones solo porque estan fuertes?\nJajja tenes una forma de pensar bastante interesante y rara","replies":[{"poster":"FullRams","date":"2019-06-30T17:26:43.042+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Rusheri,realm=LAS,application-id=8sKIclmi,discussion-id=yq9PQZz5,comment-id=0000000000000000000000000000000000000000,timestamp=2019-06-30T17:15:34.659+0000)\n>\n> No me molestas, solo te estoy explicando. \n> Seguis sin entender, que vos no sepas usarlo y te vaya mal en un game no quiere decir que el campeon sea malo.\n> No se como explicartelo ya, pero voy a hacer un intento.\n> Si una pagina analiza TODAS las partidas de determinado elo, y saca los numeros de que volibear gana mas partidas de las que pierde, significa que el campeon esta bien.\n> Ahora, respecto a lo ultimo, no no es ambiguo que yo diga que X campeon es fuerte y no lo use.\n> El campeon puede ser fuerte y no gustarme, o tengo qeu jugar campeones solo porque estan fuertes?\n> Jajja tenes una forma de pensar bastante interesante y rara\n\nLo que pienso amigo, es que no me estas leyendo. Literalmente te estoy preguntando por que es fuerte. Me decis porque lo dice una pagina.\n\nEs como que te diga es mejor usar etanol que nafta, y vos me digas porque y yo te responda porque lo dice la etiqueta...... El concepto es lo que hace a algo util o inutil. Claramente no voy a usarlo bien si no se que es lo que lo hace fuerte.","replies":[{"poster":"Rusheri","date":"2019-06-30T17:35:02.354+0000","up_votes":1,"down_votes":0,"body":"No es muy dificil, tenes que ver el kit de habilidades....\nEs un tank con un daño decente y buena capacidad de pick up, tambien tiene buen cc.\nTan difcil es? Es solo leer un poco y tener un analisis propio","replies":[]}]}]}]}]}]}]}]}]},{"poster":"LKMT00","date":"2019-06-30T16:13:09.586+0000","up_votes":1,"down_votes":0,"body":"Es que shen con su kit y una buena build corre solo la verdad las veces que eh jugado con el siempre gano soy m6 con el y tengo muy pocos puntos de maestria con el pa ser m6 y voli antes maineba voli pero s7 por ahi y voli pega mucho te buildeas tank con gloria oh algo y puede rendir ,con conquistador igual le da mucho aguantes en las tf y lo malo es que su movilidad es bastante mala ya que es solo correr mas rapido  le tiran un stun y mueres vendido","replies":[]}]}]}]},{"poster":"Rusheri","date":"2019-06-30T12:39:06.167+0000","up_votes":1,"down_votes":0,"body":"Usa eve cuando tu team no tenga ap. Voli cuando no tengan tank o iniciacion y despues comprate xin zhao. Practicalos mucho en normal, draft y flex y cuando sepas usarlos bien andate a rankear.","replies":[{"poster":"LKMT00","date":"2019-06-30T16:19:24.611+0000","up_votes":1,"down_votes":0,"body":"Eve no la eh probado se mas o menos sus mecanicas y su habilidades asi que voy a ver si me gusta","replies":[]}]},{"poster":"El Don Teemo","date":"2019-06-30T16:07:40.176+0000","up_votes":1,"down_votes":0,"body":"Mirá las partidas de tarzaned. Si no aprendes a jugar jg y entender el juego con ese flaco, no juegues jg jaj","replies":[]}]}