{"poster":"Boomer24","date":"2017-01-14T10:51:12.693+0000","title":"FIGYELEM!!!!! eune csapatot keresek hogy kijussak BRONZbol !!!!!!!","up_votes":1,"down_votes":2,"body":"egy kicsit magamr&oacute;l: Zsoltinak h&iacute;vnak &eacute;s nagyon r&eacute;g&oacute;ta szeretn&eacute;k kijutni bronz 5 bol  de magamban nemmegy mert a csapatt&aacute;rsaimmal sosem tudok norm&aacute;lisan egy&uuml;tműk&ouml;dni mert nem is k&ouml;vetnek vagy csak hallgatnak r&aacute;m ugyhogy aki ugyanebben a cipőben j&aacute;r mint &eacute;n az nyugottan vagyen fel bar&aacute;tnak &eacute;s &iacute;rjon r&aacute;m:Boomer24   \r\n:) a main lanem az a top,mid mind a kettőn j&oacute;l elvagyok de a tobbit nagyon nemszeretem de ha kell elmegyek adcnek ha nagyon musz&aacute;ly de a t&ouml;bbi hely szabad:) \r\nfelt&eacute;telek \r\n-legyen skype vagy ts\r\n-legy&aacute;l j&oacute;fej ne flamelj \r\n-tudj jatszani \r\nennyi csak ennyi!!!\r\nde az a fontos hogy &iacute;rj r&aacute;m szinte mindig fent vagyok ugyhogy nyugottan jeloljetek be &eacute;s &iacute;rjatok \r\nkosziiii  :)","replies":[{"poster":"AsD The Dreamer","date":"2017-01-15T07:50:13.257+0000","title":null,"up_votes":1,"down_votes":0,"body":"Fanatasztikus megszerkesztettség és helyesírás.\n\n>tudj játszani\n\nEzek szerint te se tudsz, ha a csapatod a hibás.","replies":[]},{"poster":"Storiaron","date":"2017-01-14T20:25:17.721+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem mintha közöm lenne a témához, vagy sokkal följebb lennék, de gondoltam segíts magadon és Isten is megsegít... \nSzóval röviden group up nem egyenlő a győzelemmel. Nem tudom mi történt és hogyan, milyen volt a szitu amiben nem álltatok össze, de annyi %%%%%%ált szaladgál odakint, hogy gondoltam én elmondom neked, te elmondod 5 embernek és ők is és ők is és egyszer csak lesz egy nem agyhalott community.\nAz, hogy mind az öten felmentek midre nem mindig jelent instant győzelmet(értsd.:majdnem mindig nem)néha igenis le és fel kell menni, hogy megvédj egy turretet, és igen néha fogni kell a szerencsétlen supportot és kísérni kell a baronhoz/dragonhoz, esetleg mélyebbre is, hogy legyen visionötök a térképen.\nA kulcs, hogy mindig nézz körül és ha valakitek elindult minionhullámokat takarítani, akkor várjátok meg a harcal és ne kezdjetek bele tök random.\n\nSzóval csak azért írtam ezt le, mert csak az elmúlt héten 3 meccset vesztettem, hogy vagy mindenki szart magasról arról, hogy pusholnak mindenhol és maradtak egy kupacban, vagy ahogy valaki elindult kifele a többiek harcot kezdtek. \nErgo plspls community improve","replies":[]},{"poster":"Nemin","date":"2017-01-14T10:59:26.473+0000","title":null,"up_votes":1,"down_votes":0,"body":">a csapattársaimmal sosem tudok normálisan együtműködni mert nem is követnek vagy csak hallgatnak rám\n\nTalán itt a hiba, miért kéne a csapatnak rád hallgatnia? Nem vagy a vezetőjük. Próbálj meg esetleg másokra hallgatni és meglásd ők is fognak rád.\n\n\n---\n\"A szakmám?\" \"Most hogy belegondolok, igazából mindig is Ezermester akartam lenni.\" \"Igen, Ezermester.\"\n\nLinkek amik segíthetnek eligazodni:\n[[GYIK és Szabályzat]](http://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/0krXUB6R-a-farumok-szabaalyzata-aos-gyik) [[Technikai segítség]](https://support.riotgames.com/hc/hu) [[Fórumos Addonok]](http://boards.eune.leagueoflegends.com/hu/c/minden-egyeb/AehaAUjI-nemin-addonjainak-listaaja) [[Fórumos Discord Szerver]](https://discord.gg/M28bRuX)","replies":[{"poster":"Boomer24","date":"2017-01-14T11:05:05.986+0000","title":null,"up_votes":1,"down_votes":0,"body":"Jójó de én arrol beszélek hogy pl: ne menjenek egyedül hanem menjünk csapatban vagy amikor ez ellenségből meghalt a jg és mellette még 2 ember tőlünk meg senki akkor menjünk el baronozni vagy  hozzunk el turetet\n és ne olyan parancsokra gondolj mint a katonaságnál hanem mindig szépen megkérem őket \nde amugy lehet hogy igazad van :)","replies":[]}]}]}