{"poster":"Hikarikage","date":"2015-05-22T11:46:22.305+0000","title":"PvP.net constant DC's Still Happening 22/05/2015 9:40","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"In a Q and also just while in the client even if i&#039;ve only just logged it in i&#039;m getting constant Disconnect and reconnect from PvP.net.\r\nThis has been happening since the Patch before the last recent one and not only to me. I asked in a few games and other have had the same issue.\r\n\r\nThis is the message I get while in Ranked Champ Select:\r\n\r\nYou have disconnected from PVP.Net. Attempting to restore your game upon reconnect...\r\nReconnected to PVP.Net.\r\nYou have disconnected from PVP.Net. Attempting to restore your game upon reconnect...\r\nReconnected to PVP.Net.\r\n\r\nAlso I cannot see any bans or picks while it&#039;s DC&#039;d. If it was just the chat i&#039;d be OK but not being able to pick / ban is not good.\r\n\r\nAnd just now my client has reached \"The battle is about to begin\" and has frozen in this state for the last 2 mins.\r\n\r\nI have tried the repair tool, I have also re-installed the game from scratch and had the small patch for today added on as well. The Problem is still there.","replies":[{"poster":"Hikarikage","date":"2015-05-22T12:41:04.338+0000","up_votes":1,"down_votes":0,"body":"I quit LoL then re-started it to get into that game, the game had started without me and i was 5 mins late getting into it.\n\nBut we ended up winning and as usual there were no issues during the game.\n\nAfter the game tho as soon as i left the stats screen the PvP.net DCs happened again and again.\n\nLogging off for now cause I can't Q for ranked without being able to talk to my teammates or if i have to re-start the game every time just to play.","replies":[{"poster":"HORSE OF FORCE","date":"2015-05-23T03:03:35.068+0000","up_votes":1,"down_votes":0,"body":"I suggest you only try custom games until you get this fixed. You don't want to trigger Leaverbuster.\n\nWho's your ISP?\n\nTake a look over [this page](https://support.riotgames.com/hc/en-us/articles/201752664) and try out everything it suggest. Mainly, I think using another DNS might do it for you. If you need any help with it, just ask.\n\nBest of luck.","replies":[]}]}]}