{"poster":"xDJonyxD","date":"2016-01-21T00:59:44.958+0000","title":"Passionierter S4 Silver Spieler sucht Coach für Verbesserung auf verschiedenen Lanes!","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":1,"body":"Wie der Titel schon sagt:\r\n\r\nIch hasse es meine Lanes hin und wieder zu verlieren wenn ich es doch h&auml;tte verhindern k&ouml;nnte!\r\nIch w&uuml;rde gerne besser werden um mein Team auch unterst&uuml;tzen zu k&ouml;nnen.\r\n\r\nIch habe keine Main Lane, spiele aber sehr oft im Jungle und neuerdings eher Top als Mid oder Bot!\r\n\r\nWenn jemand die Zeit und Langeweile aufbringen k&ouml;nnte, w&auml;re ich sehr dankbar ^-^\r\n\r\nFreundliche Gr&uuml;&szlig;e,{{champion:31}}","replies":[{"poster":"hey iam E D E N","date":"2016-01-21T01:12:57.203+0000","up_votes":2,"down_votes":0,"body":"Würde alleine schon mal damit anfangen mir eine Lane auszusuchen und nicht querbeet zu spielen. Mit der neuen q ja auch super machbar und man ist nicht mehr der genatzte wenn plötzlich ne pre mate bot lane daherkommt oder der angebliche challanger smurf und einem die Posi wegschnappt.\n\nDann Safe Champions picken wie z.b. im \"unteren\" Bereich sowas wie Cait als ADC. \n\nFarmen, Farmen, Farmen\n\nFighten nur entweder mit Jungler Hilfe oder du das matchup soweit kannst das du das einschätzen kannst was passieren wird.\n\nBeobachte deinen Gegner während du farmst macht er ständig einen Fehler? Minnion Aggro ziehen? VIel zu aggro auf der lane? Benutzt er einen wichtigen Spell dauernd zum farmen? Kannst du auf deinen Jungler zählen? Was macht der Gegner jungler? \n\nAchte auf deine CDs wenn du Probleme mit dem Matchup hast mache nicht die gleicehn Fehler wie dein Gegner, nutze z.B. nicht das Cait E um DMG zu machen wenn du auf der Lane struggelst. Das Ding was mir oft auf gefallen ist in \"unteren\" Bereichen: Deine Gegner legen ihren Fokus auf Poke und killen statt zu farmen. Verusch dich nicht drauf einzulassen und verusche mehr Creeps zu bekommen. Verusche mit einigen Champions nach dem Clearen der wave mal ein Jungle Camp zu nehmen (falls der jungler das nicht will nimm immer nur die kleinen wraith oder so) \n\nZu dem ganzen: GEH EINFACH BACK wenn du low bist und du nicht baiten kannst oder genau weiß was du tust. Ja du verlierst eine wave aber unter deinem Turret zu sterben dem Gegner das Kill Gold zu geben, 2-3 waves zu verlieren vllt sogar deinen Turret oder andere Objectives im schlimmsten Fall ist dein Gegner noch FUll HP und ganked die Bot Lane und holt da nochn Double Kill.....weil du dachtest du braucht die 5 Creeps noch.... oft nicht worth :)","replies":[{"poster":"xDJonyxD","date":"2016-01-21T02:08:30.144+0000","up_votes":1,"down_votes":1,"body":"> Würde alleine schon mal damit anfangen mir eine Lane auszusuchen und nicht querbeet zu spielen. Mit der neuen q ja auch super machbar und man ist nicht mehr der genatzte wenn plötzlich ne pre mate bot lane daherkommt oder der angebliche challanger smurf und einem die Posi wegschnappt.\n\nHab ich ja: Top oder Jungle :)\n\n\n> Farmen, Farmen, Farmen\n\nWeiß ich und mach ich :)\n\n> Beobachte deinen Gegner während du farmst macht er ständig einen Fehler? Minnion Aggro ziehen? VIel zu aggro auf der lane? Benutzt er einen wichtigen Spell dauernd zum farmen? Kannst du auf deinen Jungler zählen? Was macht der Gegner jungler?\n\n\nDa fängt es an. Ich warde halt und kaufe ständig Pinks aber entweder der Pink wird gecleart oder der Ward läuft kurz vor nem Gank aus während ich nachwarden will, tot. :D Danke für den Tipp ich werde drauf achten!\n\nDer Rest ist ziemlich hilfreich. Ich werde es versuchen umzusetzen und in Normals trainieren. Danke dir für deine Hilfe und sorry für den Aufwand :D","replies":[]}]}]}