{"poster":"LW UltraInstinkt","date":"2017-01-11T00:45:02.722+0000","title":"Suche duo partner am besten jg /sup","subforum":"Clans & Teams","up_votes":1,"down_votes":11,"body":"ich suche ein duo Partner um gold zu kommen war lezte season  silver 2 auf ein andere acc aber habe gg diesen hier getauscht weil der mehr skins hatte egal  ts muss vorhanden sein !! \r\n\r\n\r\ndas sind meine statts bis heute gewesen!!    http://euw.op.gg/summoner/userName=DiviniiE","replies":[{"poster":"Leylania","date":"2017-01-11T01:40:56.786+0000","up_votes":5,"down_votes":0,"body":"Schon interessant, dass du nur auf Lucian in den guten Spielen Flash auf die andere Taste gelegt hast, riecht nach Boosting. Und außerdem ist \"Account tauschen\" ebenfalls verboten und wird mit Perma bestraft. Tschüssi {{sticker:slayer-jinx-wink}}","replies":[{"poster":"LW UltraInstinkt","date":"2017-01-11T12:00:23.215+0000","up_votes":1,"down_votes":3,"body":"ich habe mir das angewöhnt deswegen ist das bosstin ?? wenn du genau hinsiewht sieht du das ich tp und flash immer selbe seite habe auf jeden champ und wenn ich hiel habe ändere ich tp und setz da flash ein und auf die andere taste  nehme ich hiel aber ok xDDD","replies":[{"poster":"Jastol","date":"2017-01-12T07:35:50.182+0000","up_votes":1,"down_votes":0,"body":"Ein Kumpel von mir macht das auch so ähnlich. Der Spielt Top und Jungle mit Flash auf unterschiedlichen Tasten.\n\nDas mit dem Account Sharing (Ja, Tauschen ist Sharen) ist aber wirklich ein Problem und wenn du Pech hast ist dein Account bald weg vor allem nachdem du es auch noch öffentlich zugegeben hast.","replies":[]}]}]},{"poster":"svenjy","date":"2017-01-11T01:19:19.153+0000","up_votes":4,"down_votes":0,"body":"du lässt dich bosten,  na lustig xd","replies":[{"poster":"LW UltraInstinkt","date":"2017-01-11T12:01:03.528+0000","up_votes":1,"down_votes":3,"body":"bossten ? nur weil man gute spiele hat lass man sich bossten was seit ihr für welche xD also hattest du nie gute spiele wie es ausieht xD","replies":[{"poster":"svenjy","date":"2017-01-11T12:46:01.618+0000","up_votes":1,"down_votes":0,"body":"informier dich erst, bevor du mich hier als schlechten spieler betitelst","replies":[{"poster":"LW UltraInstinkt","date":"2017-01-11T13:58:13.145+0000","up_votes":1,"down_votes":3,"body":"und du genau das selbe informiert dich lieber bevor du mich als bossted bezeichnest hatte guten runde das wars","replies":[]}]}]}]},{"poster":"Demonpirate","date":"2017-01-11T01:08:18.379+0000","up_votes":4,"down_votes":0,"body":"Ticket ist raus für accountsharing bye","replies":[{"poster":"LW UltraInstinkt","date":"2017-01-11T12:01:24.145+0000","up_votes":1,"down_votes":4,"body":"war mit meine bro also mach ruhing ist selbe ip","replies":[{"poster":"Jastol","date":"2017-01-12T07:47:36.543+0000","up_votes":2,"down_votes":0,"body":"Accountsharing ist Accountsharing egal mit wem und selbst wenn du deinen Account von Jesus Christ hättest wäre es Accountsharing.\n\nDie IP hat damit absolut nichts zu tun. Es kann ein Indiz sein aber kein Ausreichender Beweis, sonst könnten ja auch keine Gäste in deinem LAN zocken. Das Sharing wird eher an deinem digitalen \"Fingerabdruck\" nachgewiesen. Jeder Spieler handelt nach bestimmten Algorithmen wie er sich bewegt und seine Tasten benutzt, wo er hinläuft, wie er pingt... das alles zusammen kann dank BigDate einen Einmaligen Abdruck erzeugen der nur auf dich zutrifft. Um so länger du zockst um so genauer wird er. Wenn Ihr jetzt Accounts unter Lvl 30 getauscht habt ist es daher eher unwahrscheinlich, dass man den Tausch bemerkt, da der Fingerabdruck noch zu wenig Daten hat und zu inkonsistent ist. Wenn Ihr aber bereits eine Season hinter euch habt sollten ohne Probleme genug Daten vorhanden sein. Das man sich im laufe der Zeit verbessert oder mal ein schlechtes Spiel hat sind darin auch berücksichtigt.\n\nEin kleines Beispiel, welches schon beweiskräftiger ist als die Summoners. Ich laufe als Mid Laner immer direkt auf die Bot Seite meiner Lane wenn ein Spiel beginnt und versuche meine Erste Ward möglichst weit in den Gegnerischen Jungle zu bringen. Würde ich das jetzt auf einmal nicht mehr regelmäßig machen sondern z.Bsp. direkt auf die Lane laufen hätte man hier ebenfalls ein Indiz dafür, dass Ich nicht selbst spiele. Dank Big Date gibt es dazu noch tausende andere Indizien und wenn mehr als eine Zahl X von deinem digitalen Fingerabdruck abweichen spielt mit hoher Wahrscheinlichkeit ein anderer.","replies":[{"poster":"Shiggyvara","date":"2017-01-12T08:28:53.829+0000","up_votes":1,"down_votes":1,"body":"Du und Dämon solltet die AGBs nochmal lesen.\nAccountsharing ist erlaubt solange beide minderjährig sind, da die Accounts beide den Eltern zugerechnet werden, die ihre Kinder darauf spielen lassen dürfen.","replies":[{"poster":"Jastol","date":"2017-01-12T11:37:13.829+0000","up_votes":1,"down_votes":0,"body":"Er hat nirgendwo geschrieben, dass er und sein Bruder Minderjährig sind oder das die Accounts Ihren Eltern gehören. Aber du hast recht, an diese Ausnahme habe Ich nicht gedacht, wenn das natürlich Zutrifft hat er nichts zu befürchten, bez. kann einen Möglichen Bann anfechten. \n\nWo steht das in den AGB? In dem mmn relevanten Abschnitt 1.4 der AGB steht nichts von Eltern und Ich konnte jetzt auch beim Überfliegen des Rests nichts dazu finden. Kann es sein das der Abschnitt rausgeflogen ist?\n\nMit der IP hat es trotzdem nichts zu tun.","replies":[{"poster":"Shiggyvara","date":"2017-01-14T22:25:30.243+0000","up_votes":1,"down_votes":0,"body":"Mein Fehler ja in den neuen AGB ist der Passus so nicht mehr zu finden.\n\nDen Abschnitt 3b in der alten Form meinte ich:\n\nAGB III b\nMit dem Abschluss dieser Vereinbarung und der Erstellung eines Kontos sichern Sie zu, dass Sie an Ihrem Wohnsitz volljährig und voll geschäftsfähig sind. Sie stimmen zu, sich an diese Vereinbarung zu halten und übernehmen die alleinige Verantwortung für Minderjährige, denen Sie die Nutzung Ihres Kontos als Elternteil oder Sorgeberechtigter ermöglichen.\n\nAbgesehen davon ist von der Formulierung her anzunehmen, dass er minderjährig ist.(selbe IP und teilen mit Bruder = vermutlich ein Haushalt = vermutlich minderjährig)","replies":[{"poster":"Jastol","date":"2017-01-16T07:18:15.993+0000","up_votes":1,"down_votes":0,"body":"Sprich es ist zum aktuellen Stand nicht erlaubt.\n\nAlso wäre das teilen mit dem Bruder momentan nicht erlaubt.","replies":[{"poster":"Shiggyvara","date":"2017-01-16T10:43:17.681+0000","up_votes":1,"down_votes":0,"body":"Jain, wenn der Vertrag jetz zustande kommt hast du Recht, wenn er zum Zeitpunkt der alten AGB geschlossen wurde nicht notwendigerweise.\n\nDa die AGB sich deutlich zu Ungunsten des Kunden geändert hat (keine Übertragung mehr an Kinder in dem Fall) und auch sonst im Wortlaut deutlich anders formuliert wurde könnte es sein, dass das einfache \"ich stimme den AGB zu\"-Fenster anklicken nicht mehr ausreicht, um als Akzeptanz der neuen AGB angesehen zu werden.\n\nSiehe: https://www.surfer-haben-rechte.de/content/onlinespiele-aenderungen-der-agb-und-vertragsinhalte\n\n>Allerdings schiebt der BGH derartigen Zustimmungsfiktionen dann einen Riegel vor, wenn sich das Vertragsgefüge zu >Lasten des einen Vertragspartners erheblich verschiebt. „Für solche weitreichenden, die Grundlagen der rechtlichen >Beziehungen der Parteien betreffenden Änderungen ist ein ….. Änderungsvertrag notwendig “, das heißt ein neuer >Vertrag.\n\nDas Entscheidung war gegen Ubisoft, nur damit jetzt niemand kommt, dass so große Firmen, wie Riot viel zu gute AGB-Anwälte hätten, um solche Fehler nicht zu machen.","replies":[{"poster":"Jastol","date":"2017-01-16T11:24:50.970+0000","up_votes":1,"down_votes":0,"body":"Ah, sehr interessant. Danke :)","replies":[]}]}]}]}]}]}]},{"poster":"Demonpirate","date":"2017-01-11T22:47:10.602+0000","up_votes":1,"down_votes":1,"body":"ja du bist weg in 2 wochen ungefähr selbst das ist nicht erlaubt also hf","replies":[]}]}]}]}