{"poster":"AkumaChan","date":"2017-11-23T17:51:58.259+0000","title":"Leaver Buster","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Allora, poco fa stavo facendo una partita classificata solo/duo, la prima delle 3 per essere promosso in argento 2.\r\nDopo 4 minuti in partita il gioco mi si chiuse con il messaggio del bugsplut, e fin l&agrave; pazienza, appena rientrato il ping si &egrave; fissato a 300 ms anche se ho la fibra e il computer collegato con il cavo ethernet al modem(con internet che andava benissimo).\r\nOltre al fatto che il gioco era diventato ingiocabile per il lag fisso, il gioco ogni tipo 5 minuti mi si chiudeva sempre con il messaggio di bugsplut.\r\nAd un certo punto dopo l&#039;ennesimo bugsplut, non riuscivo pi&ugrave; ad aprire lol, mi compariva la scritta iniziale e caricava all&#039;infinito, impedendomi di fare qualsiasi cosa, n&egrave; di chiudere la finestra n&egrave; di aprirne un&#039;altra.\r\nA quel punto ho dovuto riavviare il pc, appena rientrato su lol ovviamente avevo perso la partita e mi &egrave; comparso il messaggio del Leaver Buster che mi metteva per 5 partite nella coda a bassa priorit&agrave;, un anno fa avevo problemi di connessione e quindi ero finito tante volte nella coda a bassa priorit&agrave;, e ora ho 20 minuti da aspettare prima di ogni partita.\r\nPer&ograve; erano 3 mesi che non abbandonavo un partita e sinceramente trovo sinceramente che dopo  tutto questo tempo per una volta ricevere una punizione, oltre al fatto che tutto questo problema deriva dalla riot e i suoi server. \r\nCome anche la Riot pu&ograve; vedere era in un periodo di vittorie allucinante, passando da bronzo 2 ai prmo per argento 2 in pochi giorni, e ora questo Leaver Buster mi rallenter&agrave; un casino, soprattutto, ora che siamo a fine stagione e puntavo a gold.\r\nDitemi se c&#039;&egrave; una possibilt&agrave; di rimediare a questo. Scusate per la grammatica ma st&ograve; scrivendo velocemente.\r\nGrazie mille.","replies":[{"poster":"Orniflex","date":"2017-11-25T08:21:12.086+0000","up_votes":1,"down_votes":0,"body":"1 - la stagione è finita. \n2 - la coda da 20 min te la da se abbandoni spesso. Inutile che provi a rifilarci la storiella \"Io non abbandono mai\"\n3 - il problema deriva dalla tua macchina. Una cattiva esecuzione dl processo.\n4 - se il problema persiste contatta il supporto per consigli tecnici e info a riguardo.\n\nE gia il servizio di supporto e gratuito e nessuno mai ringrazia la riot per questo!\n\nPS: la coda la togli in un pomeriggio.","replies":[]},{"poster":"Due spade","date":"2017-11-24T12:25:18.901+0000","up_votes":1,"down_votes":0,"body":"La stagione è finita da tipo 2 settimane ma okay. xD\nA me e ad un mio amico è successo di sto random bug del cavolo, o quello che ti tiene in cerca partita mentre dovresti bannare, o ancora quell'altro che ti dice una finestra popup che ce stato un errore nel controllo afk mentre stai bannando {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"mansitkd","date":"2017-11-23T23:11:40.128+0000","up_votes":1,"down_votes":0,"body":"il problema persiste fai ripara, comunque fin quando non ti esce la scritta sei stato premiato per il tuo periodo di non infrangimento regole o una cosa del genere devi stare sempre attento. poi 5 partite con 20minuti di attesa non son tante, fai conto che siamo in preseason la stagione è finita a gennario ricomincia la nuova","replies":[]},{"poster":"Koria","date":"2017-11-23T18:01:54.876+0000","up_votes":1,"down_votes":0,"body":"Hai discord aperto ?","replies":[{"poster":"Koria","date":"2017-11-23T18:38:43.513+0000","up_votes":1,"down_votes":0,"body":"Se si ti consiglio di disattivare l'overlay di discord.\nSe non usi discord ti consiglio di chiudere i programmi oppure fare il ripara file.","replies":[{"poster":"AkumaChan","date":"2017-11-23T19:25:36.764+0000","up_votes":1,"down_votes":0,"body":"Ah grazie proverò","replies":[]}]}]},{"poster":"Εvelynn","date":"2017-11-23T18:23:56.843+0000","up_votes":1,"down_votes":0,"body":"È successo pure a me con curse una cosa simile, a volte sono altri programmi aperti che nonnpermettono di giocare.","replies":[]}]}