{"poster":"liQs PaleFire","date":"2015-02-09T19:18:43.071+0000","title":"Coach wird gesucht","subforum":"Clans & Teams","up_votes":2,"down_votes":2,"body":"Hi,\r\nMein Team und ich suchen einen Coach, der uns dabei Hilft unsere Ziele zu erreichen.\r\nDiese wären, dass wir gemeinsam als Team es schaffen in den hohen Diabreich vorzudringen \r\nund natürlich auch die erfolgreiche Teilnahme an Cups wie z.B. Tryforecup, oder in der ESL gut abzuschneiden.\r\n\r\nÜber uns:\r\nZu uns kann man sagen, dass wir schon fast ein Jahr zusammen spielen und uns alle untereinander durchweg gut verstehen. Während den Games  herrscht zum Teil jedoch ein etwas rauerer Umgangston, vor allem wenn es nicht so gut läuft, jedoch wird nie Jemand persönlich angegriffen, sowie auch niemand alleine für den Lose eines Games verantwortlich gemacht wird, sondern wir versuchen herauszufinden, wo die Fehler/Probleme lagen. Das fällt aber oft schwer, da man keinen objektiven Blick auf das Game hat. Wir spielen seit Beginn unseres Teams in dem Clan Liquid Souls, was jedoch auf unsrer Zusammenarbeit keinerlei Einfluss haben muss, wenn du es nicht möchtest, wenn du willst kannst du dich aber natürlich auch gerne mit den anderen, zum Großteil sehr freundlichen Membern unterhalten und evtl. neue Kontakte knüpfen.\r\n\r\nUnser derzeitiges Roster:\r\nTop: liQs Clockwork           S4 Plat3  S5 Plat3\r\nJungle: liQs summ9r           S4 Dia 5  S5 Dia5\r\nMid: liQs DaShorti             S4 Dia 2  S5 Dia4\r\nAdc: liQs Impact                S4 Dia 5  S5  Dia5 \r\nSupp: liQs Palefire             S4 Plat5   S5 Plat 2\r\n\r\nWas wir uns von dir erhoffen:\r\n  Wir wünschen uns natürlich eine gute und erfolgreiche Zusammenarbeit. Diese hängt natürlich von        \r\n  ein paar Kriterien ab. Diese wären, dass du ungefähr dann zeit hast, wenn wir spielen. Unsere           \r\nTrainigs sind meistens so zwischen 17 und 22 Uhr, Sonntags versuchen wir, wenn jeder Zeit hat an  Tournaments teilzunehmen und anschließend noch ein paar Teamrankeds zu spielen. Es sollte gegeben sein, dass du schon viel Spielerfahrung und/oder auf einem hohen Skilllevel bist.                 \r\nWir setzten natürlich nicht voraus, dass du irgendwelche Referenzen hast, was natürlich aber auch nicht schadet.\r\n\r\nAllgemeines:\r\nWir haben es geschafft in Season 4 auf den letzten Drücker Dia zu erreichen, uns ist jedoch aufgefallen, dass wir im Moment auf der Stelle treten und das ist auch einer der Hauptgründe, warum wir nun einen Coach suchen. Wir haben die Möglichkeit die Games zu streamen und aufzunehmen.\r\n\r\nAlles Weitere können wir dann auf dem Ts klären, eben wenn Sachen noch unklar sind, oder du uns kennenlernen möchtest.\r\nWenn dir dieser Post gefallen hat und du Interesse hättest uns kennenzulernen add mich einfach ingame „liQs PaleFire“\r\n\r\nMfG mein Team und ich.","replies":[{"poster":"PcF Briedog","date":"2015-02-09T20:46:14.333+0000","up_votes":2,"down_votes":0,"body":"PUSH","replies":[]},{"poster":"BRG Shorti","date":"2015-02-09T19:21:35.252+0000","up_votes":2,"down_votes":0,"body":"#push","replies":[]}]}