{"poster":"A Yordle ln Heat","date":"2015-04-24T14:46:33.098+0000","title":"Why So Serious? - Le Cronache di uno Shaco con rune Tank AP.","subforum":"Campioni e gameplay","up_votes":2,"down_votes":1,"body":"http://oi61.tinypic.com/2vkxb1w.jpg\r\n\r\nEra una serata tranquilla, quando mi arrivano i messaggi di Frattaglia sul client.\r\nLei, Qweertas e SirZeel mi invitano a giocare. Ovvio. Classico. Tipico. Chi non lo vorrebbe?\r\n*Io sono un giocatore che tutti vorrebbero avere in team; uno che non flamma mai, uno che non fa mai errori, uno che non spreca il flash e che di certo non sbaglia mai Rune, Maestrie o si dimentica di comprare gli item iniziali. Uno che non trolla, non flamma e che come jungler lascia sempre il blu all&#039;APC e il rosso all&#039;ADC di turno.*\r\n\r\nSiamo gasati.\r\nSiamo pronti.\r\nIl TS &egrave; acceso.\r\nVai. VAI. VAAAAAAAAAAAAI! ALL&#039;ATTACC-merda ho sbagliato le rune. E le maestrie. E non ho preso l&#039;ignite. Praticamente sto andando Tank AP.\r\n\r\nhttp://i60.tinypic.com/15nk1nn.gif\r\n\r\nVa bene. Va tutto bene.\r\nPosso andare full AP in modo trollereccio, tanto mi carryano.\r\n\r\nSirZeel prende Katarina. &Egrave; la fine.\r\n&quot;Ragazzi, vado full AP&quot;\r\n&quot;Ti veniamo a cercare a casa.&quot; - replicano loro.\r\nOk, ok, allora via di build normale.\r\n\r\nE da l&igrave; in poi &egrave; stata un&#039;escalation di successi: il farm in giungla era facilitato dall&#039;AP extra ai piccoli Jack, i gank non risentivano troppo dell&#039;eccessiva armor e mr al posto del danno (e dell&#039;ignite), e il clone, malgrado non sia riuscito a usarlo come kamikaze per portarmi a casa una easy-kill, ha saputo fare il suo sporco lavoro.\r\nIn conclusione, consiglio di provare Shaco con rune Tank AP?\r\nNo. No.\r\nAssolutamente no.\r\nPer l&#039;amor del vostro MMR non giocate Shaco Tank AP, non fate i NightBlue della situazione e mangiate tutte le vostre verdure.\r\nPeace Out.","replies":[{"poster":"Frattaglia","date":"2015-04-24T15:32:41.460+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=CommonDotaPlayer,realm=EUW,application-id=cAOZwaUi,discussion-id=Flb4gMJ0,comment-id=,timestamp=2015-04-24T14:46:33.098+0000)\n>\n> Per l&#039;amor del vostro MMR non giocate Shaco.\n\nFixed.\n\nMi sa che non hai mai giocato con il mio ragazzo che usa Shaco, ogni volta che lo prende si sente sul ts un coro di \"Nooooooo\"","replies":[{"poster":"Ste the ripper","date":"2015-04-24T16:26:43.382+0000","up_votes":3,"down_votes":0,"body":"Su qualunque ts quando uno prende shaco parte il coro di \"noooooooo\"\n\nquando qualche mio amico prende shaco io per ripicca instalocko bard, tanto per perderla almeno trollo anche io","replies":[]}]},{"poster":"Nibbio Bianco","date":"2015-04-24T19:08:44.992+0000","up_votes":2,"down_votes":0,"body":"169/179, pls.","replies":[]},{"poster":"Otivnaig","date":"2015-04-25T09:02:46.200+0000","up_votes":1,"down_votes":0,"body":"Un amico mio, col team giusto, sa tirare fuori uno shaco full ap che shotta un carry di E. E l'ha provato con risultati decenti anche tank ap. Ma vabbè sto quà usa solo shaco tutto il giorno XD\nTipo shaclone","replies":[]}]}