{"poster":"Liquid Dario","date":"2016-04-14T22:09:00.679+0000","title":"@RIOT Rhojin A response to something (quoted) you said in forum would appreciate a reply back.","subforum":"Player Behavior","up_votes":14,"down_votes":33,"body":"Okay @Riot Rhojin I just wanted to replay to something you said and see if you would reply back with a response because well its been about 4 years I would say I have posted on this forum about these things and not one Rioter has dared to mount a response to me. Since you seem all about the community and everyone sings their praises about you I figured your about as good of a shot as I have to ever actually get an official answer from a Riot member. \r\n\r\nNote that I am in no way trying to ACTUALLY be rude here tho I may come off as such due to my passion about what I am going to comment on.\r\nAnyways here is your quote and I will apply my response to what I wanted you to comment on. Note that the response will prolly be long. \r\n\r\n__________________________________________________________________________________________________________\r\nRhojin (NA)  - 2 days ago 1 of 2 Rioter Comments\r\nYou were punished for your consistent verbal abuse and harassment against other players in your game, not because you were only defending yourself. You tend to rage at players who are playing poorly, demand reports against them and telling them to refund skins and champions if they did not perform to your expectations. This was abuse carried across the three chatlogs that were supplied to you when your suspension was issued. Before the permanent suspension hit your account, you went through multiple chat restrictions and a two week suspension for the same behavior. The punishment on your account is more than justified.\r\n\r\nIn regards to your self defense claim, you can still be punished for firing back at another players. When it comes to your suspension it only matters what you do, not what others do. While you may feel that you are in the right defending yourself or others, two wrongs never make a right. If you run into players displaying negative or toxic behavior in game you can mute them and report them at the end of the game. The moment you fire back with your own negative behavior you warrant any reports made against you and justify any disciplinary actions take against your account.\r\n__________________________________________________________________________________________________________\r\n\r\n&quot;When it comes to your suspension it only matters what you do, not what others do. &quot;\r\n\r\n@Rhojin - And that there sir is exactly what is wrong with your system. You allow the antagonizer the dignity of annoying your players and then punish the players being annoyed instead of the instigators of said act. Again and I will say this till this game shuts down or becomes trash ( doing a great job on both fronts there riot HAHA ) In no other game / anything / real life situation etc, is it that the person who defends himself is the one punished. Meanwhile, the person who caused the issue, crime / altercation / verbal attack etc, gets away with what he did and is let off scott free and given a handshake from said authority Riot games / Police / Judge / etc.\r\n\r\nYou have the worst possible system in place, and what you stated there just proved in and of itself how absolutely ridiculous you and other rioters sound when trying to defend the system.\r\n\r\nDoes it ban actual toxicity ? Yes 100% it does. Does it stop actual toxicity ? 0% no chance in hell. Why ? simple, because the ones doing the antagonizing are allowed to do it in 100&#039;s of games before MAYBE finally being punished. Meanwhile, the player being antagonized gets much harsher punishment almost instantly. Especially when said antagonizer is in a group or party that has multipule people to infract you with to defend their &quot;buddy&quot; guess we should call it the &quot;TOXIC BUDDY SYSTEM&quot; and you can only give a single report .... who&#039;s side you going to take Riot ? I know the answer seems hard so I will answer for you the toxic buddies will be the ones taken seriously.\r\n\r\nHonestly you know what the absolute best thing ever would be for a RIOTER to finally understand how horrible this system is ?\r\n\r\nImagine if you will in this fake scenario, a Rioter was at a convention doing his thing when suddenly some guy who hates Riot for being banned starts flaming this Rioter. So the Rioter talks back and try&#039;s to defuse the situation. But then said person engages in a physical altercation, and punched said Rioter in the face so the Rioter defends himself and swings back trying to protect himself from harm. Now the Police are called and they hear both sides of the story and the Rioter is arrested and sent to jail. Because &quot;When it comes to your Arrest it only matters what you do, not what others do. &quot;\r\n\r\nNow I think I have made my point extremely clear. Riot your system is flawed would you dare to come in here and argue this point with me ? I would love to hear it. I know how much you guys love to ignore me because its pretty hard to argue a point this specific that makes 100% sense compared to the non sensical crap you spew on a daily basis.\r\n\r\n@Rhojin Please feel free to come argue this point with me. don&#039;t worry, I&#039;m not a bad dude. I am just very passionate about your system. I want only for that system to be improved so that all players can feel comfortable playing under &quot;RIOTS LAW&quot;","replies":[{"poster":"Rhojin","date":"2016-04-18T04:06:59.030+0000","up_votes":19,"down_votes":0,"body":"Okay lets do this, sorry for posting so late today has been sort of a mess. \n\nEveryone is held accountable for their own actions in game, no matter if they are the one who started the display of negative behavior or the players who respond to the actions with their own negative actions. Neither side gets away with their negative behavior, and both can see punishments issued to their account, if we never punished anyone for antagonizing others in games and being flat out dicks, my job would be a lot easier. But the truth of the matter is nobody gets away scott free, if they are reported by others and they are indeed being negative in games they will see some sort of  punishment issued to their account. Now you may not see what was done to another player's account it may appear they may be still playing games but that could mean that they are currently serving chat restrictions instead of a suspension. With that said, when these punishments are issued they are accompanied by chat logs of multiple games where negative behavior was displayed in games it wasn't just for one game where someone felt they were in the right firing back. \n\nMultiple reports from a premade do not instantly result in a ban or anything happening to your account, the only time disciplinary actions are taken is when the reports are valid. Even if you ran into a negative player being defended by their friends, as long as you do not fire back at them and simply report them at the end of the game, nothing will happen to your account. While some players feel they are in the right responding to negative behavior with even more negative behavior, the fact of the matter is that this only creates an even more negative experience for all those involved. \n\nI don't see this the scenario with two people duking it out in a fight that started with someone punching someone else working, as there is no violence or any physical altercations taking place. Not to mention rules and laws in the real world are set and enforced differently that the rules and regulations of a video game. These in game situations are more of a shouting match in the middle of an establishment where all parties involved are asked to leave and not come back until they cool off. \n\nJust as a last point, in the four years that I have been working behavior cases I have seen multiple claims of \"They started it\" or \"I was defending myself\" come in through tickets. The vast majority of the time, the player writing in was the aggressor in the game and they were not suspended for defending themselves but for initially going after others in their games for whatever reason.","replies":[{"poster":"SCSU Genius","date":"2016-04-18T05:08:27.118+0000","up_votes":3,"down_votes":0,"body":"Most polite and clearheaded {{summoner:11}} ever.","replies":[]},{"poster":"Liquid Dario","date":"2016-04-18T07:23:52.638+0000","up_votes":2,"down_votes":7,"body":"> [{quoted}](name=Rhojin,realm=NA,application-id=ZGEFLEUQ,discussion-id=2iWp7veu,comment-id=000d,timestamp=2016-04-18T04:06:59.030+0000)\n>\n> Okay lets do this, sorry for posting so late today has been sort of a mess. \n> \n> Everyone is held accountable for their own actions in game, no matter if they are the one who started the display of negative behavior or the players who respond to the actions with their own negative actions. Neither side gets away with their negative behavior, and both can see punishments issued to their account, if we never punished anyone for antagonizing others in games and being flat out dicks, my job would be a lot easier. But the truth of the matter is nobody gets away scott free, if they are reported by others and they are indeed being negative in games they will see some sort of  punishment issued to their account. Now you may not see what was done to another player&#x27;s account it may appear they may be still playing games but that could mean that they are currently serving chat restrictions instead of a suspension. With that said, when these punishments are issued they are accompanied by chat logs of multiple games where negative behavior was displayed in games it wasn&#x27;t just for one game where someone felt they were in the right firing back. \n> \n> Multiple reports from a premade do not instantly result in a ban or anything happening to your account, the only time disciplinary actions are taken is when the reports are valid. Even if you ran into a negative player being defended by their friends, as long as you do not fire back at them and simply report them at the end of the game, nothing will happen to your account. While some players feel they are in the right responding to negative behavior with even more negative behavior, the fact of the matter is that this only creates an even more negative experience for all those involved. \n> \n> I don&#x27;t see this the scenario with two people duking it out in a fight that started with someone punching someone else working, as there is no violence or any physical altercations taking place. Not to mention rules and laws in the real world are set and enforced differently that the rules and regulations of a video game. These in game situations are more of a shouting match in the middle of an establishment where all parties involved are asked to leave and not come back until they cool off. \n> \n> Just as a last point, in the four years that I have been working behavior cases I have seen multiple claims of &quot;They started it&quot; or &quot;I was defending myself&quot; come in through tickets. The vast majority of the time, the player writing in was the aggressor in the game and they were not suspended for defending themselves but for initially going after others in their games for whatever reason.\n\nWell I am glad you finally posted it only took me 5 years to receive one single post from a red ... and you made a lot more sense than most. But I will say this if the player defending themself eats a ban ... the offender should eat a ban at the same time. Not a chat restriction. That is just my personal opinion though. Him causing the issue to happen should be even worse than the defender defending himself. Because he was the direct cause of the situation in the first place. \n\nBut I understand your guy's logic now but am also going to say that you will NEVER rid us of toxicity using that method you are stating above. I guess this game is destined to be the way it is until it dies. Still, thank you for the response Rhojin I guess I will just stick to playing the game very little. As since I've stopped giving a damn about where I place or how a game goes anymore. I have not eaten a single chat restriction or ban. If that's what your trying to accomplish then you have done your job. I have played 1% of the amount I have played the last 3 + seasons. I guess that's just going to be how it will stay until you guys change your stance on toxicity. \n\nHave a good day or night Rhojin.","replies":[{"poster":"o Maui o","date":"2016-04-18T14:01:23.006+0000","up_votes":3,"down_votes":0,"body":"I think that part of the disconnect is that you are still focused behavior in an individual game, while the system is designed to focus on a player's overall behavior over the course of many games. The system finds players who are consistently toxic, who consistently instigate or escalate situations.","replies":[]},{"poster":"Scream Engineer","date":"2016-04-18T08:50:33.572+0000","up_votes":2,"down_votes":0,"body":"I'm not sure you are looking at what Rhojin said the right way. So I'll give you an example.\n\nLet's say a mana hungry jungler needs blue buff to take camps and gank efficiently, and at the same time the mid laner is also very mana hungry. The jungler might take the Blue Buff and to continue his ganking and farming without having to back (and that seems perfectly fine right?). However, the mid laner sees this as instigation when the jg keeps taking blue without thinking of how the mid laner may need it despite pings and chat. The mid laner starts feeding kills and flaming  \"b/c of the jungler's actions\" (in his eyes). The game is ultimately lost b/c the mid laner is feeding kills when the team was ahead. \n\nWhich should get punished? The mid or the jungle? \n\nRhojin would say (feel free to correct me Rhojin) the mid due to the actions they made when they felt antagonized. \n\nI hope this helped, and feel free to reply. I'd love to talk about it.\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"2ManyJons","date":"2016-04-18T09:38:48.389+0000","up_votes":2,"down_votes":1,"body":"I agree. In said situation the mid should have communicated with the jungler and they should have been on the same page. But reverse the situation.\n\nSo mid is denied blue for the jungler and decides she wants to get back at him. So every time she calls for a gank and he shows up they both go to engage, she flashes back and lets him try to finish the gank alone causing him to die. Jungle asks \"That was dumb, why did you do that?\". Mid doesn't reply. Eventually he stops coming and she starts to ping for assistance. He says \"No, you're trolling and are trying to set me up\". Then his ally laners start getting mad because they're losing mid towers. They start pinging mid. Team goes \"Why you no gank?\". Jungle replies \"I cannot risk dying, all she's doing is trolling and trying to feed.\". Now ally team is mad at both of them. Team says \"We're gonna report you two if you don't start playing right\". Jungler says destressed \"just report her, she's trolling\". \n\nMid reports him. Riot sees this.\n\nMid: Can I have blue, I need.\nJungle: Sorry I need it :P\nJungle: That was dumb, why did you do that\nJungle: No, your trolling and trying to set me up\nJungle: I cannot risk dying, all she's doing is trolling and trying to feed\nJungle: just report her, she's trolling.\n\nTrolling the current system isn't hard as long as you don't say anything. And I don't think it's fair that riot can cherry pick things people say to give restrictions and then use the excuse of \"well, the instigator didn't say anything negative. Their kda was 0-40-2 with 6 tears of the goddess as their build. But they could have just been having a bad game.\"","replies":[{"poster":"Cosnirak","date":"2016-04-18T10:32:38.366+0000","up_votes":1,"down_votes":0,"body":"In your example of the jungler never says that last line they will 100% not get punished for doing what you mentioned. Don't feed the trolls, don't ask for reports. Just carry on your marry way and report the bad people.\n\nAlso, Riot's systems are not so easily fooled, especially if the players involved do what they should. Riot's not likely to punish that mid for doing that in just one game, but make a habit of it and they will absolutely get punished. I've reported people who said nothing against the rules in chat and been notified that they were punished. The system works far better than most players think it does.","replies":[{"poster":"2ManyJons","date":"2016-04-18T10:54:37.397+0000","up_votes":1,"down_votes":0,"body":"But in that instant, under all the stress of that lost ranked game being pinned on you, can you say you wouldn't say that last line as a plea to your team mates no to report you and to acknowledge whats actually happening?\n\nI don't think riot is honestly that easy to fool either. I'm sure the real trolls get punished too, it just seems like the system easily sways to the retaliator much faster and in more cases than the offender.","replies":[{"poster":"Cosnirak","date":"2016-04-18T11:28:04.988+0000","up_votes":1,"down_votes":0,"body":">But in that instant, under all the stress of that lost ranked game being pinned on you, can you say you wouldn't say that last line as a plea to your team mates no to report you and to acknowledge whats actually happening?\n\nYes! Without a doubt. Can and _have_ numerous times. It's _really_ easy. If somehow necessary, I just remember that my report is all that's needed and any extra do absolutely nothing.\n\n>it just seems like the system easily sways to the retaliator much faster and in more cases than the offender.\n\nThat's because people come on the forums and complain about it as if it works that way. But it doesn't. Most of the complaints are from people who were total asshats who said lots of awful stuff that most people would never say, even if they were _really_ angry over a game where they got trolled hard and asked for reports and everything. There are tons of beautiful smites by Rhojin and Tantrum and Lyte and probably more that perfectly showcase this again and again.\n\nDid this myth originate from some old system that was in place previously? I have no idea. Does it come from other games that operated this way? Maybe. Is it just somehow the natural assumption? Doubtful but possible.\n\nRiot really needs to do PSAs about this, because man this is one giant and persistent as hell myth.","replies":[{"poster":"2ManyJons","date":"2016-04-19T07:53:21.082+0000","up_votes":1,"down_votes":1,"body":"Your faith in riot's system is blinding.\n\nDoes it not seem odd to you that all the overlord's \"smites\" are for people through chatlogs? Have you ever seen Lyte, Rhojin, or Tantrum \"smite\" someone with evidence they were trolling rather than just slinging chat logs at them? I wonder how the justice system in this game would work sometimes if the chat system was removed. How would \"smites\" be delt to people then?","replies":[{"poster":"SmokedAlmonds","date":"2016-04-19T10:58:31.224+0000","up_votes":2,"down_votes":0,"body":"Most of the chat cases we see are from people contesting their punishments. Trolling is a very deliberate thing. They know what they are doing in almost all cases. But yes, I have seen smites for trolling.\n\n> [{quoted}](name=WookieeCookie,realm=NA,application-id=ZGEFLEUQ,discussion-id=1cvmXAWA,comment-id=000b,timestamp=2015-11-17T23:15:08.506+0000)\n>\n> To the contrary, we still review a number of cases on a daily basis for acts of trolling.  This is especially important because our current toxic chat and intentional feeding detection systems are only as smart as the current live data we have shared with them.   By reviewing new cases for behaviors that we&#x27;re not currently tracking we can feed this data back to the PB Development team who can add it to our current detection methods.  A cycle that we expect to go on forever as new trolling behaviors are created and adopted by toxic players.\n> \n> Your current case wasn&#x27;t found by our PB detection systems but it was hand reviewed by someone in Player Support.  The account was locked because the degree of your behavior and the frequency it was occurring was creating a terrible experience for other players.  Because these bans are 100% reviewed manually, a reform card is not sent. You&#x27;re free to contact Player Support for more details.\n> \n> In your case, you are correct when you said you didn&#x27;t chat, but your in game behavior was often much worse then a few toxic words.  This wasn&#x27;t behavior in one or two games, but a traceable pattern that goes back a few months.  Intentionally feeding, blowing summoner spells at random times, buying multiple boots, multiple tears, teleporting into base and running back and forth and of course, the non-stop pinging that you would do to your team mates.  In fact, when you get really upset it looks like you just decide to ping all the time stopping only for the forced cooldown period and then starting back up again.  Even when asked to stop you continue to do it for no real tactical reason.  Perhaps to force an early surrender so you can get to the next game since you know that pings are not currently mutable?\n> \n> Regardless that behavior isn&#x27;t acceptable and intentionally trolling games and ruining them for others can and will result in your account being locked.","replies":[{"poster":"2ManyJons","date":"2016-04-20T06:20:06.551+0000","up_votes":1,"down_votes":0,"body":"In that case, he did call out his builds and what not. I'll admit that. But the whole \"smite\" in this one seemed to be centered around pings (which all but the basic one) shows up in the chatlogs.","replies":[]}]},{"poster":"Cosnirak","date":"2016-04-19T10:51:36.848+0000","up_votes":2,"down_votes":0,"body":"The problem with that is two fold. First, the ways they detect non chat offenses are intentionally kept somewhat secret in order to help prevent people from gaming the system. A lot of people _think_ they know how it works but are generally wrong. And second, those people rarely come here trying to get their account unbanned. They trolled/griefed/whatevered and they know it and they have no delusion that they can convince others they don't deserve the ban.\n\nDespite all that, I have in fact seen some smites dealt to people who did non chat things, but they are rare. Additionally, I've reported people for non chat offenses and then gotten the notification that they were punished.\n\nThis isn't some blinding faith in Riot, this is me seeing the proof.","replies":[{"poster":"2ManyJons","date":"2016-04-20T06:17:24.433+0000","up_votes":1,"down_votes":0,"body":"I have been in and out of these boards for 2 years and all I've ever seen is (presents chat logs) \"gg Lyte smite\"\n\nI would just love to have proof that riot has a way to deal with the trolls in my game that don't speak, cause at current I just don't feel like it's worth reporting them. I also communicate less in games with trolls because I'm afraid something I say will be misconstrued and used against me in the trolls report.","replies":[{"poster":"Cosnirak","date":"2016-04-20T07:01:36.301+0000","up_votes":1,"down_votes":0,"body":"Reporting is so easy that it's hard for it to not be worth while. If you dig through all the threads on this board with Riot posts you'll find some examples. I know they're not that common, but they are there. Don't let anecdotal evidence fool you.","replies":[]}]}]}]}]}]}]},{"poster":"Scream Engineer","date":"2016-04-18T09:58:03.001+0000","up_votes":1,"down_votes":0,"body":"Honestly I don't know how the system works nor do I work at RIOT. But from what I've gathered (general assumptions based on reading several Rioter posts about the matter) they have access to more information than just chat logs, item builds, and KDA when deciding if the reported is worth restricting.","replies":[]}]}]},{"poster":"Kei143","date":"2016-04-18T11:46:18.920+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Legendary Uchiha,realm=NA,application-id=ZGEFLEUQ,discussion-id=2iWp7veu,comment-id=000d0001,timestamp=2016-04-18T07:23:52.638+0000)\n>\n> But I will say this if the player defending themself eats a ban ... the offender should eat a ban at the same time. Not a chat restriction. That is just my personal opinion though. Him causing the issue to happen should be even worse than the defender defending himself. Because he was the direct cause of the situation in the first place. \n\nSo lets take Rhojin's example of people screaming at each other in an establishment. \n\n> [{quoted}](name=Rhojin,realm=NA,application-id=ZGEFLEUQ,discussion-id=2iWp7veu,comment-id=000d,timestamp=2016-04-18T04:06:59.030+0000)\n>\n>These in game situations are more of a shouting match in the middle of an establishment where all parties involved are asked to leave and not come back until they cool off. \n\nNow lets expand this situation a bit more. Person A is well known in that establishment cos constantly causing a ruckus. The establishment now bans him from the entering the building for 1 year. If A returns after 1 year and continues doing so, he'll be permanently out of that establishment. \n\nWhile B's is at first offense and he will be able to return after hes cooled off. \n\nRepeat offenders do get a harsher punishment.","replies":[]}]}]},{"poster":"Deep Terror Nami","date":"2016-04-14T22:43:23.371+0000","up_votes":17,"down_votes":3,"body":"There is no excuse for being toxic. You can try to justify it all day, but in the end responding to toxicity with the same thing only makes you both toxic and makes the situation worse.\n\nConcerning your claims about premades ganging up on you, the system calculates premade reports the same as one. It's simply not possible for them to abuse it by being in a group. Either their reports are valid or they aren't, and if they are making false reports they'll lose weight in their future ones.","replies":[{"poster":"Liquid Dario","date":"2016-04-14T22:52:03.605+0000","up_votes":3,"down_votes":11,"body":"> [{quoted}](name=Deep Terror Nami,realm=NA,application-id=ZGEFLEUQ,discussion-id=2iWp7veu,comment-id=0003,timestamp=2016-04-14T22:43:23.371+0000)\n>\n> There is no excuse for being toxic. You can try to justify it all day, but in the end responding to toxicity with the same thing only makes you both toxic and makes the situation worse.\n> \n> Concerning your claims about premades ganging up on you, the system calculates premade reports the same as one. It&#x27;s simply not possible for them to abuse it by being in a group. Either their reports are valid or they aren&#x27;t, and if they are making false reports they&#x27;ll lose weight in their future ones.\n\nOn point 1 you are correct but the correct response would be \"When it comes to your suspension it takes both players involved into account and punishes both accordingly \" instead its \"When it comes to your suspension it only matters what you do, not what others do. \"\nThat itself is a toxic, incorrect way of dealing with said situation that only breeds more toxicity.\n\nOn point 2 I have personally seen it happen. Regardless of what you \"feel\" happens or what RIOT lies to you about ... it does happen just not everyone wants to jump on the forum to speak about it. Also, I don't believe they really care if they lose \"Weight\" of their reports in the future. Hell a friend just got his own friend perma banned for a false report on his friends account while they were in a premade group together. The report was a fake joke but what was outlined as the reasons for said report was legit and he ended up perma banned for it.  \nThat alone proves that troll reporting can actually function as a real punishment for players. \n\nRegardless of what you think or what Riot tells you it definitely exists and definitely happens.  Why do you think we do not have any metrics or stats from their systems and they removed the tribunal ?? they do not want you to know whats actually happening... they just make up numbers for the sake of looking good for their investors.","replies":[{"poster":"Deep Terror Nami","date":"2016-04-14T23:01:37.763+0000","up_votes":10,"down_votes":1,"body":"You're only making it worse when responding. If you aren't going to make an attempt to de-escalate the issue instead of exacerbate it, mute, report, and move on. The other person will be judged for their actions alone, as you are yours. \"Well he started it!\" is a child's excuse; please refrain from using it.\n\n> a friend just got his own friend perma banned for a false report on his friends account while they were in a premade group together. The report was a fake joke but what was outlined as the reasons for said report was legit\n\nOk? The report was legitimate, so the punishment was as well. If it only took his friend's one report to trigger his ban, then he was going to get banned anyway, whether from another player's report flagging the match, or due to his behavior in the next game or so. His friend reporting as a joke didn't change anything. Just because it's a troll doing the report doesn't make the report invalid or the punishment unwarranted.\n\nIf you spent half as much effort trying to reform and improve yourself as you do denying that your behavior is not welcome, you'd be a positive player in the community.","replies":[{"poster":"Liquid Dario","date":"2016-04-15T00:10:56.479+0000","up_votes":2,"down_votes":8,"body":"> [{quoted}](name=Deep Terror Nami,realm=NA,application-id=ZGEFLEUQ,discussion-id=2iWp7veu,comment-id=000300000000,timestamp=2016-04-14T23:01:37.763+0000)\n>\n> You&#x27;re only making it worse when responding. If you aren&#x27;t going to make an attempt to de-escalate the issue instead of exacerbate it, mute, report, and move on. The other person will be judged for their actions alone, as you are yours. &quot;Well he started it!&quot; is a child&#x27;s excuse; please refrain from using it.\n> \n> Ok? The report was legitimate, so the punishment was as well. If it only took his friend&#x27;s one report to trigger his ban, then he was going to get banned anyway, whether from another player&#x27;s report flagging the match, or due to his behavior in the next game or so. His friend reporting as a joke didn&#x27;t change anything. Just because it&#x27;s a troll doing the report doesn&#x27;t make the report invalid or the punishment unwarranted.\n> \n> If you spent half as much effort trying to reform and improve yourself as you do denying that your behavior is not welcome, you&#x27;d be a positive player in the community.\n\nDude I'm not even reported I'm complaining as someone who isn't even in the system I get keys and boxes etc. Your thinking is off your thinking im a reported player complaining about the system. I am a NON REPORTED player and STILL complaining that they system is whack I know I guess its rare around here. You are all so quick to come to Riots aid in its time of need like the little sheeple you have been trained by Riot to be.\n\nI am a positive player this is coming from a positive players perspective. Your sitting here defending Riots decisions on the fact of  im complaining because I am being the target when I'm simply stating the obvious and I don't have any issue with reports directly to my account.\n\nAgain if you do not see how wrong the system is by what I stated in the first post I put up then clearly you cannot grasp the situation. \n\nIf you were at a convention with a Rioter and you decided to yell at him because you were upset that you were banned and then he tried to talk you down from it. Then instead of listening to said Rioter you punched him in the face causing assault. And he swung back to protect himself in self defense. At that point the Police would be called obviously there was an assult.. But were going by riots rules here and so \n \"When it comes to your suspension it only matters what you do, not what others do. \" so it now becomes \"When it comes to your arrest it only matters what you do, not what others do. \" And since the Rioter swung in self decent he is sent to jail and the person who started the offense \"AKA THE TROLL\" gets a hand shake from the police thanking him for how the situation was resolved \"AKA the card you get when you report someone and they are punished\".\n\nHow does that in any sense make actual sense to you ? because that is how riot operates. Would you feel good if that occurred to you irl ? Like I do not know how to put that comment in a simplified sense so that you can understand it. I guess I will try by saying \n\"Riot punishes the defender instead of the instagator.\" Thats the issue. If you said well \"punish both of them then\" well that is an acceptable outcome I mean its better than only you the defender getting his account stripped or banned isnt it ? at least the instagator gets his too instead of walking away with his account laughing at what he did only to go do it again.\n\nI simply cannot make the situation any simpler than that for you to understand.","replies":[{"poster":"Zerfallen","date":"2016-04-15T00:24:37.775+0000","up_votes":8,"down_votes":1,"body":"A better example would be:\n\nChild A: You're a doodoo head!\nChild B: Nuh uh! You're a doodoo head.\n\nChild A and B continue on fighting until one of the children goes and tells the guardian (parent/teacher perhaps).\n\nWhen the guardian arrives and sees the fight, they don't reprimand only Child A, Child B likewise receives a punishment.\n\nEven though Child B was \"defending\" himself by saying, \"B-but Child A started it!\", he was still breaking the rules.\n\nThe fact of the matter is that you can't go around breaking the rules just because someone else did it first.","replies":[]}]},{"poster":"Zerfallen","date":"2016-04-14T23:03:51.655+0000","up_votes":2,"down_votes":0,"body":"{{champion:267}}  wash it away!","replies":[{"poster":"Liquid Dario","date":"2016-04-15T00:11:52.837+0000","up_votes":1,"down_votes":8,"body":"> [{quoted}](name=Zerfallen,realm=NA,application-id=ZGEFLEUQ,discussion-id=2iWp7veu,comment-id=0003000000000000,timestamp=2016-04-14T23:03:51.655+0000)\n>\n> {{champion:267}}  wash it away!\n\nGTAB ignored.","replies":[{"poster":"Zerfallen","date":"2016-04-15T00:25:38.841+0000","up_votes":3,"down_votes":0,"body":"What does that even mean?","replies":[{"poster":"MeilinII","date":"2016-04-15T01:14:41.576+0000","up_votes":4,"down_votes":1,"body":"It means he'd rather not admit that he's talking out the wrong hole.","replies":[]}]}]}]},{"poster":"2ManyJons","date":"2016-04-17T22:18:31.490+0000","up_votes":1,"down_votes":3,"body":"Oh look, one of those blue SJW peeps.\n\nSo in terms of this system, I wanna preface by saying I've never been punished for anything ever. But seeing the way riot responds to giving punishments I've often wondered about how it only matters what you say and not what you do.\n\nSo riot can sit back and say that no matter what I DO in game, say I just feed for days or spend all my time farming the jungle and never come out to gank or even spend half the game dancing at Dragon pit. As long as I don't say a single word, build my items along a semi-normal path and manage to get atleast one kill and about 60 farm, Riot will never say I did anything wrong, I was just having a bad game.\n\nBut on the contrast. The people that ask me in chat not to live in the jungle, or to stop dancing at dragon or to quit feeding are around 95% more likely to receive punishment than I am, even though I'm the one actually doing something wrong. \n\nNow I know, I know, the blue justice code calls for the person to fought back to be punished because fighting back is is the biggest source of toxic behavior in this game, but how does this system improve in a way to address the actions as fast as they address the words? \n\nWe all know ranked is a very stressful game mode. If you don't have a good rank then you're worthless to the league community. So when you go and try to get this rank, people who go in for the sole purpose of costing you a game can really get under your skin. Where is the line of how much you should take from the pattern of someone ruins your game, you report, you que back up and get the same troll in your next string of games before you stop playing ranked?\n\nI guess what I'm asking is what does the system do to punish the silent perpetrators in the same speed and severity it does for the vocal victims?","replies":[{"poster":"Deep Terror Nami","date":"2016-04-17T23:03:12.901+0000","up_votes":4,"down_votes":1,"body":"Way to lose all possible credibility in the first sentence.","replies":[]},{"poster":"SmokedAlmonds","date":"2016-04-17T22:27:59.183+0000","up_votes":1,"down_votes":0,"body":"This is completely wrong. In the case of retaliation, no one is saying w/e thing the instigator did was ok. They are talking specifically about someone's response to the situation. Someone intentionally feeding, trolling, dancing in the dragon pit, or w/e are all unacceptable. What people are saying is that raging at them is also unacceptable. It has no meaningful chance of improving the situation and is almost guaranteed to escalate it.\n\nIt isn't that instigating is acceptable and retaliation is not, both are unacceptable. The problem is, the instigators are more calculated in what they do. While the system is pretty good at finding and punishing toxicity, it isn't all encompassing. The guy trying to stay under the radar has a significantly higher chance of actually staying under the radar than someone who is exploding with emotion. It is also important to remember that those who are retaliating are also feeding the instigators. Raging at them is just tossing them a little treat for their efforts. If no fish ever bit, fishermen would stop lining the coast.","replies":[{"poster":"2ManyJons","date":"2016-04-18T01:49:17.948+0000","up_votes":1,"down_votes":0,"body":"You cannot expect people to absorb all the aggression from the same person trolling your games over and over again and not get flustered about it. The saddest part is that it doesn't take majorly aggressive or rude things to get punished. Just asking to stop dancing at dragon or I need you to gank my lane can be blown out of proportion to the level of a threat in riot's eyes.\n\nI just don't feel as though it's a fair system.","replies":[{"poster":"SmokedAlmonds","date":"2016-04-18T03:08:17.004+0000","up_votes":1,"down_votes":0,"body":"I can and I do expect that. Especially since doing anything has almost no chance of improving the situation and is almost guaranteed to make it worse. If the only thing you did was ask them to stop dancing at dragon or to gank then there is no chance you get punished for that. That is just some fantasy you have.\n\nWhat isn't fair is that the other people in the game are forced to deal with the instigator and now also the retaliator.","replies":[{"poster":"2ManyJons","date":"2016-04-18T09:16:19.449+0000","up_votes":1,"down_votes":0,"body":"Actually, you can be punished for telling someone to stop trolling or stop feeding because it you are implying that they ARE trolling or feeding and that's an insult if you're just having a bad game. \n\nWhat about in situations where the other four people on the team are suffering and start to retaliate, who's suffering from their retaliation? The other team? No, they're enjoying their ticket to a free win due to the troll. At that point, the system punishes people for making the troll (the person who set out to ruin people's games) feel bad. The troll shouldn't get protect from bad feels when they are the source of the bad feels.","replies":[{"poster":"SmokedAlmonds","date":"2016-04-18T13:50:29.524+0000","up_votes":1,"down_votes":0,"body":"That is an exaggeration, but in any case the words \"stop feeding\" or \"stop trolling\" are useless at best and realistically are inflammatory. If someone is trolling or intentional feeding telling them to stop is completely useless. The guy running your game on purpose isn't doing it because some random guy never told him to stop. Making you mad is what he wants so getting mad at him is just feeding him. If they aren't doing it intentionally aka they are just losing or making different decisions than they would have than it is just completely an insult. Saying stop feeding is like telling someone to stop bleeding. If they aren't intentionally feeding then they don't want to be dying, telling them to stop implies that it is something they are doing on purpose which is just not the case. \"Stop feeding\" does nothing to help them accomplish that, if they could have stopped they would have. The 0/5 guy know hes doing poorly.\n\nPunishments aren't just about retribution. The system is judging your propensity for negative behavior. Even in a game with no victim to care about it is still a demonstration that they can and will be toxic. Getting punished is a result of that pushing you over the threshold. Even in the cases of actual trolls, it is still just an accusation. Also keep in mind that you are a user, not an administrator. It is not your place to dole out justice as you see fit. Realistically though, most of what I see get called trolling is people playing poorly and disagreement over what is best. I also don't buy that the enemy team is perfectly fine with it. They probably aren't going to be upset since they know it is just balancing out for the times they are on the other side, but I don't think for one second that is a game the average player wants when they queue up.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"AraMoOse","date":"2016-04-14T22:27:21.387+0000","up_votes":12,"down_votes":2,"body":"I heard if you twist a piece of that tin foil into an antenna, you can catch the Mexican wrestling channels.","replies":[{"poster":"Liquid Dario","date":"2016-04-14T22:36:54.117+0000","up_votes":4,"down_votes":10,"body":"> [{quoted}](name=AraMoOse,realm=NA,application-id=ZGEFLEUQ,discussion-id=2iWp7veu,comment-id=0001,timestamp=2016-04-14T22:27:21.387+0000)\n>\n> I heard if you twist a piece of that tin foil into an antenna, you can catch the Mexican wrestling channels.\n\nIf you dont have something productive to add to the conversation then go take your trolling elsewhere. You will quickly activate my ignore idiocy switch and you will promptly be ignored. Enjoy your day.","replies":[{"poster":"AraMoOse","date":"2016-04-14T22:38:47.767+0000","up_votes":11,"down_votes":1,"body":"> [{quoted}](name=Legendary Uchiha,realm=NA,application-id=ZGEFLEUQ,discussion-id=2iWp7veu,comment-id=00010000,timestamp=2016-04-14T22:36:54.117+0000)\n>\n> If you dont have something productive to add to the conversation then go take your trolling elsewhere. You will quickly activate my ignore idiocy switch and you will promptly be ignored. Enjoy your day.\n\nI did add something productive to your conversation. \"your conspiracy theory makes about as much sense as you would expect\".","replies":[{"poster":"Liquid Dario","date":"2016-04-14T22:40:13.250+0000","up_votes":2,"down_votes":9,"body":"> [{quoted}](name=AraMoOse,realm=NA,application-id=ZGEFLEUQ,discussion-id=2iWp7veu,comment-id=000100000000,timestamp=2016-04-14T22:38:47.767+0000)\n>\n> I did add something productive to your conversation. &quot;your conspiracy theory makes about as much sense as you would expect&quot;.\n\nIf you believe it to be a conspiracy theory then why comment ? What I said makes 100% sense explain how it does not ? then you can retort with your conspiracy theory.","replies":[{"poster":"MeilinII","date":"2016-04-14T23:10:33.932+0000","up_votes":10,"down_votes":0,"body":"Actually your posts make about as much sense as Trumps wall. I.E. None at all.\n{{sticker:slayer-jinx-unamused}}","replies":[]}]}]}]}]},{"poster":"EndGamer11","date":"2016-04-15T03:24:00.269+0000","up_votes":9,"down_votes":0,"body":"The difference between League's verbal altercations and a real life fight is that the mute button effectively acts as an instant barrier between the both of you. If Player1 starts flinging poo, Player2 can summon his magical barrier and be protected. However, if he starts flinging poo back, he has lowered himself to the level of Player1 and can now be punished, especially since they are right in front of a giant sign that says \"No poo flinging allowed\" (the TOS). As such, there is no excuse for partaking in flaming.","replies":[{"poster":"Liquid Dario","date":"2016-04-15T04:47:32.998+0000","up_votes":1,"down_votes":7,"body":"> [{quoted}](name=EndGamer11,realm=NA,application-id=ZGEFLEUQ,discussion-id=2iWp7veu,comment-id=0004,timestamp=2016-04-15T03:24:00.269+0000)\n>\n> The difference between League&#x27;s verbal altercations and a real life fight is that the mute button effectively acts as an instant barrier between the both of you. If Player1 starts flinging poo, Player2 can summon his magical barrier and be protected. However, if he starts flinging poo back, he has lowered himself to the level of Player1 and can now be punished, especially since they are right in front of a giant sign that says &quot;No poo flinging allowed&quot; (the TOS). As such, there is no excuse for partaking in flaming.\n\nBut at the same time you report player 1 for flinging poo and nothing happens to him for doing so which frustrates the players using the magical barrier. Because if player 2 decides not to use the barrier and flings poo back he is instantly banned while player one who started flinging the poo in the first place walks away scott free with a nice thank you for flinging poo at player 2 card sent to him ingame about 5 mins after the report. and thats why the poo flinging system doesnt work.","replies":[{"poster":"dapositiveviking","date":"2016-04-15T16:39:44.604+0000","up_votes":6,"down_votes":0,"body":"how do you know nothing happens. how. do. you. know.","replies":[{"poster":"Liquid Dario","date":"2016-04-15T17:37:11.042+0000","up_votes":2,"down_votes":6,"body":"> [{quoted}](name=dapositiveviking,realm=NA,application-id=ZGEFLEUQ,discussion-id=2iWp7veu,comment-id=000400000000,timestamp=2016-04-15T16:39:44.604+0000)\n>\n> how do you know nothing happens. how. do. you. know.\n\nEasily, if a player is punished by the system with any type of ban you receive a message stating said player was punished. For simple chat restriction or ranked restriction you will not receive the message. That is how you know the player was not punished.","replies":[{"poster":"dapositiveviking","date":"2016-04-15T22:15:47.922+0000","up_votes":2,"down_votes":1,"body":"actually, i totally forgot about that change, since for the longest time it only tells you if you're game/report was the final straw. sorry to ask so aggressively!","replies":[{"poster":"Wulf Helhammer","date":"2016-04-17T11:53:21.725+0000","up_votes":5,"down_votes":0,"body":"No, that's still how it works. We don't know what the punishment the player received is, just that they got one, and it only does that if your report was the final one","replies":[]}]}]}]}]}]},{"poster":"Wulf Helhammer","date":"2016-04-14T22:39:11.331+0000","up_votes":9,"down_votes":0,"body":"Seriously, you know absolutely nothing of how the system works.","replies":[]},{"poster":"Rhojin","date":"2016-04-17T12:13:49.451+0000","up_votes":6,"down_votes":0,"body":"Man sorry for not seeing this earlier. I will try to post some sort of response in here regarding your questions sometime before the end of Sunday. Right now's its 5am and I'm questioning why I am still even awake.","replies":[{"poster":"CrisisEchoes","date":"2016-04-17T12:36:28.261+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Rhojin,realm=NA,application-id=ZGEFLEUQ,discussion-id=2iWp7veu,comment-id=0005,timestamp=2016-04-17T12:13:49.451+0000)\n>\n> Man sorry for not seeing this earlier. I will try to post some sort of response in here regarding your questions sometime before the end of Sunday. Right now&#x27;s its 5am and I&#x27;m questioning why I am still even awake.\n\nI really wish someone would discuss with me the reason that the system gives permabanned people no way to get back their account after a long grace period. I made a thread with a substantial positive view, in pb&m where people are quite fast to downvote 90% of permabanned threads.  Heres the thread if youre interested in it, id appreciate the time/input.\nhttp://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/9zwZGfta-permabanned-almost-a-year-ago","replies":[{"poster":"Nik Nikerson","date":"2016-04-17T13:38:36.488+0000","up_votes":8,"down_votes":1,"body":"Because then it wouldn't be a permanent ban.","replies":[{"poster":"macromite","date":"2016-04-17T15:26:47.508+0000","up_votes":2,"down_votes":0,"body":"accurate.","replies":[]}]},{"poster":"EndlessSorcerer","date":"2016-04-17T15:36:35.386+0000","up_votes":2,"down_votes":0,"body":"They tried that before actually as an experiment.\n\nThey basically required the players reach level 20 or 30 (I forget which) on a new account without getting banned again or displaying massive amounts of toxic behaviour.\n\nIt had a very high failure rate and encouraging toxic players to make new accounts (wrecking the game for many new players) was not a good idea.\n\nA perma-ban is the final consequence for a long line of toxic behaviour and their way of saying that they don't want to in their community.  You can always make a new account which will either be banned (if they didn't learn their lesson) or go without issue (if they have stopped being toxic).","replies":[]}]}]}]}