{"poster":"Fan de ZZK","date":"2017-10-15T15:45:42.356+0000","title":"ayuda a shotcaller","subforum":"Guias y consejos","up_votes":7,"down_votes":0,"body":"hola, tengo una pregunta, alguien sabe si hay games completos de teams(no importa si en ingles o espa&ntilde;ol)a microfono abierto de shotcallers, porque en mi team soy el caller y quiero aprender a tomar buenas deciciones para marcar objetivos, cuando avanzar cuando retroceder, considero que lo hago aceptable, acierto muchisimo cuando propongo que hagamos algo, pero quiero mejorar.\r\nSi hay algun team bueno que me invite a espectear sus games tambien lo agradeceria\r\n\r\nsi esta no es la categoria del post diganme","replies":[{"poster":"SenpaiDeathx","date":"2017-10-16T14:28:38.088+0000","up_votes":1,"down_votes":0,"body":"mmmmmm la verdad no se si estaran completos, pero creo que en el canal de youtube de riota latinoamerica hay partes de las partidas competitivas a microfono abierto, pero solo partes, no completas","replies":[{"poster":"Fan de ZZK","date":"2017-10-16T16:01:52.453+0000","up_votes":1,"down_votes":0,"body":"sisi, por eso eso son solo 2minutos, yo quiero games completos","replies":[{"poster":"SenpaiDeathx","date":"2017-10-16T16:05:48.941+0000","up_votes":1,"down_votes":0,"body":"la verdad lo dudo, son cosas privadas de cada team yo creo, pero no se si alguna vez jugaste Ro?? es lo mismo que dirigir una woe o una hunting de algún mvp, quizas como referencia podrian servirte algunas de ellas, si al final es tema es liderazgo y objetivos.","replies":[]}]}]},{"poster":"Jigøku","date":"2017-10-15T15:56:06.747+0000","up_votes":1,"down_votes":1,"body":"Podrías ponerlo en \"Off-topic y temas personales\"","replies":[{"poster":"Fan de ZZK","date":"2017-10-15T15:58:36.285+0000","up_votes":1,"down_votes":0,"body":"dale gracias","replies":[]}]},{"poster":"SKT T1 Bank","date":"2017-10-15T15:56:11.795+0000","up_votes":1,"down_votes":3,"body":"El capitan suele ser cualquiera que lleve ventaja en soloq, o que este marcando diferencia en minicombates.\n\n<creo que en soloq mucha aplicacion no tiene, se va dando dentro de la partida. \nLe voy a preguntar a un amigo que jugo en equipos y era coach dps te digo bien, pero fijo que ser shotcaller es medio al pp en soloq.","replies":[{"poster":"Fan de ZZK","date":"2017-10-15T15:57:50.007+0000","up_votes":1,"down_votes":0,"body":"dale amigo gracias, no es para soloQ es para mi team","replies":[]}]}]}