{"poster":"Coinflîp Support","date":"2019-06-12T10:39:23.595+0000","title":"Silber 1 Mitte Spieler sucht Dou Partner (Jungler)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo, lieber Suchender, vorweg möchte ich eine Sache bewusst ansprechen. Ich bin auf der Suche nach einem Spieler der sich über einen längeren Zeitraum gemeinsam verbessern möchte. Ich bin fest der Überzeugung, dass jeder nach Diamant kommen will, es auch kann, aber wir müssen auf unsere eigenen Fehler achten und dazu in der Lage sein nach Spielen Fehler anzusprechen. Du und ich sind gerade in Silber oder in Gold, das liegt nicht an unseren Team sondern daran, dass wir Fehler machen und diese können wir gemeinsam aufdecken. Nach einer Woche des testens, habe ich mich nun für die Mitte als Main Rolle entschieden und meine Ausweichenden Rollen werden Top, Jungle und Support sein. \r\n\r\nErwartungen an dich:\r\n\r\n1. Du bist Main Jungle \r\n2. Du bist über 18 Jahre alt \r\n3. Du versuchst täglich mindestens drei Ranglisten Spiele zu machen \r\n4. Dir ist bewusst man kann nicht jedes Spiel beeinflussen, aber unserem Team die Schuld zu geben lässt uns nicht besser werden \r\n5. Du bist Kritikfähig und kannst ebenfalls Sachliche und angebrachte Kritik geben\r\n6. Du Flamst nicht, weder mich, noch dein Team und auch nicht die Gegner\r\n\r\nNun zu meiner Person, ich bin über 20 Jahre alt, bin Mitte, Supporter und Jungler, wobei ich sagen muss das ich gerade lieber in der Mitte unterwegs bin. Auf mich treffen ebenfalls alle Punkte zu außer natürlich den ersten. \r\n\r\nZu meinen Champions gehören in der Mitte {{champion:45}} {{champion:90}} {{champion:31}} {{champion:127}} {{champion:134}} {{champion:103}} und zukunftsorientiert noch {{champion:8}}/{{champion:105}}  dazu. Meine Mains werde aber die ersten drei genannten Champions bleiben.\r\n\r\n_**Meine (unsere Ziele):** _\r\n\r\n**1. Gold---> Platin --> Diamant\r\n2. Zusammen eine Einheit werden\r\n3. Langfristig besser werden**\r\n\r\nBei Interesse kann man mir gerne eine Freundschaftsanfrage an **AeQ Blackout** schicken.","replies":[]}