{"poster":"Jordernor","date":"2015-02-06T10:57:00.485+0000","title":"Aggiungere un'icona per Ignite","subforum":"Campioni e gameplay","up_votes":70,"down_votes":10,"body":"Mi capita spesso di dover controllare i danni di **Ignite **{{summoner:14}} e non aver voglia di calcolarli, e devo sempre andare sull'icona e leggere il valore, un po' scomodo se si è nel mezzo di uno scontro, quindi pensavo...perchè non aggiungere un'icona con per **Smite **{{summoner:11}} ? \nNon so se sono l'unico ad avere questo \"problema\" ma sarebbe molto comodo!\n\nEDIT: Non sono sicuro che il nome giusto sia icona, ma mi sembrava evocativo di quel cosino che sta sopra le barre di vita e mana...","replies":[{"poster":"Phºenix","date":"2015-02-07T12:45:25.308+0000","up_votes":3,"down_votes":0,"body":"Personalmente metterei il valore del danno proprio sull'icona dell'ignite già presente (così come avveniva con lo smite un mesetto fa, prima che potesse accumulare cariche).\n\nNon servirebbe un'ulteriore icona e si avrebbe immediatamente sott'occhio il valore che serve conoscere.","replies":[]},{"poster":"Firenheit","date":"2015-02-06T11:10:42.288+0000","up_votes":2,"down_votes":0,"body":"Prima di aggiungere un secondo stack allo smite apparive il valore dei danni sull'icona ed era una cosa UTILISSIMA; ora l'han tolto di nuovo invece e controllare \"nell'icona\" è una cosa molto lenta e pericolosa in un'azione rischiosa...","replies":[{"poster":"Alendir","date":"2015-02-06T11:14:34.591+0000","up_votes":1,"down_votes":0,"body":"C'è ancora è stato solo spostato.","replies":[{"poster":"Firenheit","date":"2015-02-06T11:21:53.849+0000","up_votes":1,"down_votes":0,"body":"omg Dove?","replies":[{"poster":"Swashbuckler","date":"2015-02-06T11:34:24.895+0000","up_votes":1,"down_votes":0,"body":"lo hanno messo sopra la barra delle abilità, si vede solo quando stai combattendo contro i mob della giungla","replies":[{"poster":"Firenheit","date":"2015-02-06T11:43:57.815+0000","up_votes":3,"down_votes":0,"body":"Vedi che brutto essere dei cretini? \n{{summoner:2}}","replies":[]}]}]}]}]},{"poster":"Frattaglia","date":"2015-02-06T11:25:07.977+0000","up_votes":3,"down_votes":0,"body":"Ah, pensavo parlassi del calcolo danni del death recap (che è ancora buggato a morte, ieri mi ha detto che mi ero uccisa da sola!)","replies":[]},{"poster":"CloverKey","date":"2015-02-06T14:00:03.932+0000","up_votes":2,"down_votes":0,"body":"È un'ottima idea effettivamente, anche se comunque considera che per smite lo hanno fatto più che altro per i mob della jungla.","replies":[]},{"poster":"Alendir","date":"2015-02-06T11:00:00.946+0000","up_votes":1,"down_votes":0,"body":"Non sarebbe affatto male!","replies":[{"poster":"kortik425","date":"2015-02-07T21:14:15.478+0000","up_votes":1,"down_votes":1,"body":"per quanto comoda possa essere questa modifica(e visto il mio livello di niubbezza a me farebbe molto comodo) mi piace pensare che l' ignite come è adesso incentivi l'abilità del giocatore di calcolare  i danni in momenti concitati/ critici.... una via di mezzo penso sia di mettere/togliere la possibilità di avere questa cosa nelle normal e lasciarlo com'è adesso nelle ranked  {{champion:32}}","replies":[{"poster":"Trollo96","date":"2015-02-08T13:19:59.823+0000","up_votes":2,"down_votes":1,"body":"Aspetta non confondiamo la difficoltà del gioco, che per essere superata richiede abilità da parte del giocatore, con un'interfaccia scomoda e vari altri errori/trascuratezze che in ogni gioco sono presenti in quantità più o meno influenti sul gameplay. Quello che voglio dire in breve è che secondo il tuo ragionamento allora non dovrebbero essere mostrati neanche i cooldown delle skill, così da \"premiare\" i giocatori più \"bravi\" che sanno impararseli a memoria. Quello non è il tipo di difficoltà che si basa sull'abilità del giocatore, è semplicemente un ostacolo fastidioso e inutile. Allo stesso modo mostrare i danni dell'ignite renderebbe più fluida l'azione di utilizzarlo con meno margine di errore e a quel punto l'errore effettivo proverrebbe solo dal giocatore e non sarebbe attribuibile al gioco o alla sua interfaccia. Di fatto un'interfaccia totalmente esaustiva rende l'abilità del giocatore l'unico elemento determinante in uno scontro.\n(scusate per il post lungo, spero di essere stato abbastanza chiaro ^^)","replies":[]}]}]},{"poster":"TheDanik","date":"2017-12-01T06:50:37.137+0000","up_votes":1,"down_votes":0,"body":"Hai straragione","replies":[]},{"poster":"Bhokengaard","date":"2015-09-16T07:58:10.294+0000","up_votes":1,"down_votes":0,"body":"Intendi una barra??","replies":[]},{"poster":"Hródrsvitnir","date":"2015-06-25T06:48:45.306+0000","up_votes":1,"down_votes":0,"body":"L'idea è molto carina e la cosa sarebbe davvero utile.\n\nTi consiglio di aprire lo stesso 3D sul forum NA, li vieni preso molto più in considerazione e penso che questa sia davvero un ottima idea per tutti.","replies":[]},{"poster":"IlTarsan","date":"2015-06-25T01:19:38.586+0000","up_votes":1,"down_votes":0,"body":"anche su tutte le summoner spell tipo per la guarigione i numerini\nsei un genio!!!!!!!!!!!!!!!!!","replies":[]},{"poster":"ShowterX","date":"2015-03-02T16:57:16.456+0000","up_votes":1,"down_votes":0,"body":"io sinceramente quando sto in 1 vs 1  in early non mi metto a fare il calcolo di quanta vita ha e quanta ne toglie lo smite, quando vedo che il mio avversario mi sta per killare glielo lancio e lo killo perchè tanto lo lascio a poca vita e muore sicuro...poi in late ha un buon damage perciò è facile rendersi conto di quanto ne toglie anche se, sinceramente, in late non lo uso spesso dato che non c'è nemmeno il tempo...","replies":[]},{"poster":"Trollo96","date":"2015-02-07T13:10:21.943+0000","up_votes":1,"down_votes":0,"body":"se non proprio l'icona sopra la barra della vita quantomeno il numeretto sulla spell secondo me andrebbe messo, ottimizzerebbe molto l'utilizzo dell'ignite e ridurrebbe quei frustranti casi dove lo si usa convinti di fare quei 30 danni in più... e il nemico se ne va beffardo con i suoi 20hp","replies":[]},{"poster":"ForFockSake","date":"2015-02-06T14:56:20.755+0000","up_votes":1,"down_votes":0,"body":"Appoggio! anche io mi ero posto il problema!","replies":[]},{"poster":"BioS iP","date":"2015-02-06T14:33:20.222+0000","up_votes":1,"down_votes":0,"body":"La considero un'idea veramente ottima, principalmente perché gioco principalmente jungler, support e top, per cui mi capita raramente di avere l'ignite come spell!\n\nDello smite avevo imparato quanto toglieva dall'1 al 6 e poi dal 12 al 18, non riesco a fare lo stesso con l'ignite :D\nL'icona sopra è molto più rapida e comoda che dover passare il mouse sull'icona per vedere i danni dopo il level-up! (specialmente se ti trovi in una fight concitata!)","replies":[]}]}