{"poster":"Hot Cousin","date":"2016-01-31T11:41:03.829+0000","title":"I'm finding it harder and harder to stay interested in League in 6.2","subforum":"Gameplay","up_votes":657,"down_votes":79,"body":"Why?\n\nPersonally I think the pre-patch and this season is a disaster.  I&#039;m going to use dot points to try to make this concise and easy to follow.\n\n* Towers.  Ohhhhhh boy, towers.  Not one person, not a single person, in real life or on these boards or even on a stream, never have I ever seen anyone say &#039;yo these towers are too strong, let&#039;s nerf&#039; or think it would be a good idea/good for the game.  I get that you wanted to make games shorter, but this wasn&#039;t the way to do it.\n\n* You made a conscious decision to make games shorter buuuuuut where are the adjustments to late-game champs?  Irelia, Ryze, Nasus, Cass - you&#039;ve made absolutely no adjustments to these or any other champs that rely on farming all game to hit max power.  All you&#039;ve done is reduced tower strength and increased death timers which screams of laziness.\n\nSide note: Ryze and Cass have still seen play in Korea for various reasons, but the risk is huge when taking these champs (less so with Ryze) but they are played **_in spite of_** the game changes, not because of them.\n\n* Increased death timers has only lead to more risk-averse, punishing gameplay and moronic win conditions.  Korea has been the most prominent in this area, but solo queue is equally as frustrating.  It&#039;s always been the case that getting caught late game probably leads to a loss, but that has shifted about 10-15 minutes and it just means that people, especially pros, play way, way safer in the &#039;late game&#039;.  It also unequally and unnecessarily places a lot more importance on what happens in the first 5-10 minutes of the game.\n\n* Despite all of this, these changes have failed, for the most part, to _significantly_ reduce game length.  All they&#039;ve done is made the game more punishing, frustrating, and worse to watch, especially Korean pro League.   A lot of the games (and series) have been incredibly boring and it's a real shame.  I have gone from watching LCK at every single opportunity last year to having it on in the background this year and not bothering most of the time.  The hyper risk-averse gameplay combined with &#039;oops fight one time we lose&#039; is utterly mind-numbing and BORING.\n\n* The turret trades at the start of every pro game are a joke.  Yes I'm aware this occurred before this season, but it wasn't ALL the time like it is now.\n\n* You do a massive overhaul of ADC items but the big winners have been bruisers.\n\n* You think that CDR is more important for AD champs than AP champs and leave 40% CDR totally unattainable without buying an item that is terrible on most champs (grail).\n\n* There are so many unhealthy and toxic champs in the game right now, and with only 6 bans, I struggle to find playing against or _with them_ any fun.\n\n* The current state of Fiora, Tahm Kench, GP, Graves, Kalista is an embarrassment to the game and to your balancing team.\n\n* You introduce new mastery Keystones that break the damage output of previously balanced champs like Swain and Karthus, but instead of nerfing their damage output you nerf their utility - **_what?_**\n\n* You then nerf the Keystones but LEAVE THE PREVIOUSLY NERFED CHAMPS IN THEIR NERFED STATE instead of compensating them.  This is the very definition of being &#039;Sejuani&#039;d&#039; and you should be fu#$ing ashamed of this because it shows your favouritism towards keeping certain champs in/out of the meta.\n\n* The Riot post that admitted to keeping Sejuani &#039;Sejuani&#039;d&#039; **proves** your favouritism and destroyed a lot of people&#039;s confidence in your supposed impartial desire to have every champ be a viable pick.  This is utterly disgraceful, imo.\n\n* Still 3 bans for each team despite the champ pool growing exponentially since we went from 2 to 3 bans (and even _that_ was long overdue).  This is **_REALLY_** overdue.\n\n* The new player experience is still atrocious.\n\n* The removal of mana pots and in turn, taking something interactive and making it passive (increased passive mana regen) has removed an interesting piece of decision-making from the game, particularly in the laning phase.  I HATE this change.\n\n* The Juggernaut update did nothing but make those champs less fun to play against than before.  Darius is more binary than ever and Garen&#039;s whole &#039;Villain&#039; deal is just an uninteresting and non-interactive flat damage buff.  Kindred has this down pat - making a choice for who to potentially increase your power from is a far, far better way to achieve the same result.  Playing Kindred feels way more rewarding because of this one aspect alone.\n\n* Your champion reworks in general are... special.  Very, very special (and not in a good way).  Some of them work, most of them ratchet that power creep dial up to 11.\n\n* Games feel less carryable than ever before.  Comebacks feel less possible than ever before.\n\n* Warding changes but no 7th ward-only item slot for pinks.\n\n* Illaoi is a hot mess of a champion and you&#039;ve made no attempt to make her any better.\n\n* Thunderlord's, especially on assassins.\n\n* Keystones in general.\n\n* It&#039;s not just me, a lot of people I know are having a lot less fun with the game than they did last year.  The broken champs, the punishing gameplay, the over-emphasis on early game decisions (and mistakes), the state of AP CDR itemisation, the turret nerfs, the incredibly lazy &#039;whatever it takes to make it happen&#039; adjustments to reduce game time without consideration for the game as a whole, the boring pro games (especially in Korea - RIP) the list just goes on and on and increasingly I&#039;m finding other things to do with my time because logging in and playing in this state of the game is just not enjoyable anymore, and worse still, nothing looks like it&#039;s going to change anytime soon.\n\nEDIT:  Wowowowow 463 upvotes, 401 comments and 10.3k views?? HOLY BALLS.  I never thought so many people would agree with what I had to say (or at least some or most of it), but having said that I'm also **not** surprised given the state of the game right now.  I've probably now read every single update to the thread and overwhelmingly people are supportive of the points raised.\n\nHere's the thing:  I didn't write this post to get a red response like a lot of people might think.  I did it purely to vent and raise issues with the game that are bothering the f@#$ out of me and to give **feedback**.  That is, after all, what this board is about, is it not?  Riot won't respond to this thread because of the tone of my post, I know that, but that's probably not important.  It would be nice if they acknowledged some of the points raised, but the unfortunate truth is that they probably won't.  What _is_ important is that they see the thread and take it on board.  463 upvotes??  That is insane for what is essentially a state-of-the-game thread.  Surely it just can't be ignored...","replies":[{"poster":"shark music","date":"2016-01-31T12:31:59.672+0000","up_votes":144,"down_votes":8,"body":"I agree so much with all of OP's complaints about the recent \"games should be shorter\" theory. The worst part is that it all feels like Riot's neurotic omg-is-she-prettier-than-me response to Heroes of the Storm. Not only have all the changes made the game less fun, it's just been embarrassing to watch.\n\nThe weaker towers are a terrible idea. All you're doing is punishing people who are trying to learn the game and need tower support. And people who are trying to expand their champion pool. Why/how on Earth would anyone look at League, and then make changes that make the game _worse_ for new players?\n\nThis is weird for me. I'm typically a big fan of Riot's changes, whether they're tiny or sweeping. This move to cut down game length has just been awful, though. I wish they'd roll it back and pick a new branch of the League tech tree to spend their resources developing.","replies":[{"poster":"Revlak Javik","date":"2016-01-31T17:36:23.290+0000","up_votes":25,"down_votes":1,"body":"Agreed. Even HotS buffed their towers after people said they were garbage (ammo system is still there, but at least Murky won't dive and melee the entire minion wave before getting out with half health).\n\nI stopped playing League because it just feels like a more \"pretentious\" version of HotS. Games are made to be as short as possible by making snowball borderline broken, it punishes you when you do well (bounty system), and there's not even alternating maps/objectives. I returned and loved the Tank Meta when Cinderhulk came out, because it felt different. It was the game I had known and loved for so long, but then it faded quickly, first by item nerfs, and then by dumpstering the convicted. In Heroes, at least, balance prevents bad people who synergize with good talents from getting nerfed.\n\nCan't wait for masteries and runes to be replaced with talents, though. (/s)","replies":[]},{"poster":"Sluiceway","date":"2016-01-31T15:20:51.297+0000","up_votes":16,"down_votes":1,"body":"It seems to me this trend started before Heroes of the Storm was even fully fleshed out, though it seems likely that Riot's reaction to Hots has exacerbated this. I find there is a similar case to be made for Dota 2's impact on Riot. \n\nOn the one hand, Hots has 10 different battlegrounds, which equates to 10 different game modes, something Riot tries to match with their rotation of featured game modes, yet they don't commit to this by supporting the permanent alternate game modes they currently have beyond token mentions in the patch notes once in a while. Hots also has short fights centered around who can chain cc and burst the enemy team down faster, and shorter games in general (although Blizzard claims to have taken steps to reduce snowballing, with longer death timers and lower scaling at early levels, but I don't see a significant difference). Yet, even before Hots, Riot has been making moves such as nerfing then reworking Soraka away from a kit that thrived in extending team fights to a burst heal oriented mage that can be fairly easily picked off with % missing health damage (or be the first in a Darius dunktrain, and now she is getting nerfed again http://boards.na.leagueoflegends.com/en/c/gameplay-balance/l0A1He0N-current-pbe-soraka-nerfs). We have also seen a general neglect, as Hot Cousin observes, of champs like Nasus who depend on long games to scale. \n\nOn the other hand, Dota 2 is a deeper and more complex (with longer game times), thus more difficult to learn and master, game, which is something Riot  also seems to be attempting to imitate with the marksman reworks and itemization changes that have lead to their increasing viability in multiple roles. There is also their Mordekaiser experiment that I view in similar terms of an attempt to increase the variability of bot lane duos away from marksman/support (something I am in favor of, by the way, coming from a support POV). And, of course, we will have to see how this continues to develop as the immobile mage rework/itemization changes are revealed. Nevertheless, the problem I see with this is that they are essentially attempting to pull LoL in two conflicting directions: Hots' simplified, short, brawling-focused battles across numerous game modes, and Dota 2's complex, long, strategic battles developed and balanced exclusively for a single game mode/map (and I am aware custom game modes exist, but as they are user created and balanced, they don't have a place in this discussion, which is concerned with official development and release).\n\nYet the one thing they don't take a cue from Hots/Dota 2 regarding is treating all players equally regardless of gameplay preference. What I mean is that Hots allows for champion mastery in ranked, unranked, and vs ai games, yet League has yet to enable mastery in anything beyond PvP SR. Likewise, Dota 2 allows for random cosmetic item drops (their version of skins) in ranked, unranked, and vs ai games, yet, as LoL's champion mastery is currently exclusive to PvP SR, the soon to be released Hextech crafting is denied to everyone but an arbitrarily (in that Riot has devoted its time almost exclusively to that one game mode and basically neglected the others, though that does not mean we have to do the same) selected group of players.","replies":[]}]},{"poster":"Lord OwlBear","date":"2016-01-31T11:49:58.841+0000","up_votes":96,"down_votes":6,"body":"OP you just laid the smackdown....... I applaud you sir. Well stated.","replies":[{"poster":"Hot Cousin","date":"2016-01-31T11:54:07.797+0000","up_votes":34,"down_votes":5,"body":"Thank you.","replies":[]}]},{"poster":"Retillin","date":"2016-01-31T14:05:43.801+0000","up_votes":75,"down_votes":3,"body":"Pro games. \nIt's not just LCK. Both LCS regions and the LPL are boring. The main reason? Just about everything Riot has done to speed the game up (increased death timers, minion pushing, tower changes, ect.) has had the effect of staling the game. Increased death timers mean pros take less risky chances. Towers are just free gold, so we see team just trade towers and call it good. \nIt's very unhealthy for the game. Makes viewing the games bad...","replies":[{"poster":"rescued","date":"2016-01-31T16:58:52.659+0000","up_votes":25,"down_votes":0,"body":"Yup...\nI watched the LCS all the time last year, but this year the matches are so boring to watch.","replies":[]}]},{"poster":"Cowgirl Ed","date":"2016-01-31T12:23:06.962+0000","up_votes":61,"down_votes":6,"body":"Most of the points are good points, but the biggest offender I think is the amount of cancer champs and all the \"reworks\" in the last times that failed. For one good rework, three fail","replies":[{"poster":"Vistha Kai","date":"2016-01-31T12:27:32.053+0000","up_votes":39,"down_votes":17,"body":"http://st.elohell.net/public/chill/8916c8a7b33e8a3f8e6d76f5e9d7cfa3.jpg","replies":[{"poster":"Sevixys","date":"2016-01-31T14:32:29.062+0000","up_votes":63,"down_votes":1,"body":"Ap yi was utterly broken and it should never be a thing.","replies":[{"poster":"Vistha Kai","date":"2016-01-31T15:23:30.122+0000","up_votes":20,"down_votes":2,"body":"But muh 3 pentas in one match in a row!","replies":[]}]},{"poster":"FrankerX","date":"2016-01-31T13:38:51.195+0000","up_votes":7,"down_votes":23,"body":"this is just stupid.\nlets think about it... champs that have no real magic attack who were stronger with ap than ad...\nyi\nrengar\ntryn.\n\nALL THOSE 3 USE A KNIFE/SWORD AND WERE STRONGER WITH AP BECAUSE OF ONE SKILL!!! WHO THE FUCK BALANCES THIS SHIT!?\nwho gives fighters ap scalling on a skill. with cooldowns and stuff so that it is stronger than the ad ratio...\n\nremember when alex ich played ap yi in the lcs? (for 1 time only) fnc vayne bought a guardian angel AS FIRST ITEM!!!","replies":[{"poster":"Vistha Kai","date":"2016-01-31T13:47:40.496+0000","up_votes":17,"down_votes":1,"body":"Wrong, Yi had two abilities that benefited from Ability Power.","replies":[{"poster":"FrankerX","date":"2016-01-31T13:53:21.326+0000","up_votes":2,"down_votes":13,"body":"yea but his w didnt do dmg. it didnt kill anyone.","replies":[{"poster":"Vistha Kai","date":"2016-01-31T14:00:37.218+0000","up_votes":26,"down_votes":1,"body":"No, it didn't kill anyone... but it healed him for 2 thousand HP per second.\n\nPS. Healing was exactly all there was to AP Trynda.","replies":[{"poster":"FrankerX","date":"2016-01-31T14:03:44.271+0000","up_votes":3,"down_votes":10,"body":"tryns e scalled with ap. which did dmg.\n\nif only his q heal would have scalled with ap noone would have played him with ap because you dont do dmg.","replies":[{"poster":"Vistha Kai","date":"2016-01-31T14:12:30.057+0000","up_votes":10,"down_votes":0,"body":"His E still scales and always scaled with AP, but people stopped playing him AP because the heal was nerfed.","replies":[]}]}]}]}]}]}]},{"poster":"A Miss Fortune","date":"2016-01-31T14:49:59.585+0000","up_votes":34,"down_votes":2,"body":"The whole point of reworking most of the champions Riot has reworked was to fix a broken champion. In the end they just break them even more.","replies":[]},{"poster":"Hot Cousin","date":"2016-01-31T12:24:35.265+0000","up_votes":16,"down_votes":0,"body":"> [{quoted}](name=Kiss Kiss Kiss,realm=EUW,application-id=3ErqAdtq,discussion-id=nxEcenLh,comment-id=0003,timestamp=2016-01-31T12:23:06.962+0000)\n>\n> Most of the points are good points, but the biggest offender I think is the amount of cancer champs and all the \"reworks\" in the last times that failed. For one good rework, three fail\n\nI tend to agree, though what feels like the death of an interesting pro Korean scene is also up there for me, personally.\n\nAnd I have a special kind of hatred for the removal of blue pots.","replies":[]}]},{"poster":"Sire Hippington","date":"2016-01-31T17:35:19.197+0000","up_votes":41,"down_votes":2,"body":"Agree with every point, though i would like to add some points:\n\n - The rather high increase in gold from CS early on makes CS leads more snowbally\n - While shutdowngold overall is higher, the global distribution makes it way harder to come back in lane, and the 'assist-spreas', which made targets that had alot assists more valuable, have been removed, so unless you opponents only have solo-kills, the total shutdown gold is lower than befor\n - Turret gold has been increased, so takeing early turrets snowballs more\n - Overall damage, especially burst, has been favoured by masteries, items and neutral buffs -> more snowbally as mistakes more likely lead to death rather than retreat.\n - Riftherald offers even more resources to take for a team with an early lead\n - Darkness is upon us! Warding is now jungle+supp only, as laners can't keep even a single ward up constantly till 18, and if your jungler neither gets trackers nor sightstone, say goodby to your vision. \n - The low vision leads to passive and stall gameplay, as any active action without vision is just to risky, which can easily observed in proplay.\n - Running around in darkness always leads to harder snowballing.\n - The overall increased costs of end-tier items, mostly with above 1k combine costs, makes it really hard to atain coregear when behind and leds to a hard power discrepancy between a fed and a behind champ.\n - The high cost of Rabadons really hurts mages that rely more on ap-scaleings. Most mages that are/were effective had very pen focused builts due to high base-mediocre scaleings. Aditionally, nearly every ap-mid in competetive rushes abysal or roa, or both, as those two have been buffed while all other ap-items have been nerfed.\n -  many great items have been removed/reworked, and their nich is now empty....\n - ...which forces many champs into crit builts while they had valid options to opt out of RNG befor - hello built-deversity!\n - The LW changes remove it as the save midgame powerspike that was important for adc to have some impact when behind, while totally invalidateing any armor items later on(with mastery you get over 50% pen!), still rendering tanks rather usless once 5+items are reached(though people don't notice that, as you rarly get so much items unless insanely fed these days)\n - The crit itemisation gives ADC all the tools they need to snowball an advantage really hard\n - Mercurial is just stupidly strong right now. Such a massive active should come at more costs.\n - Tenacity is a joke right now, as a result hard cc has become more powerfull","replies":[{"poster":"ZT Xperimentor","date":"2016-01-31T18:17:20.906+0000","up_votes":10,"down_votes":0,"body":"Pretty much spot on\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Synx7","date":"2016-01-31T13:30:59.026+0000","up_votes":40,"down_votes":4,"body":"Ikr. I'm considering going to HoTs despite im used to playing LoL\nthis game went down to shit and im tired of their champ favoritism\nhello {{champion:64}}","replies":[{"poster":"YossarianSensei","date":"2016-01-31T15:35:08.677+0000","up_votes":28,"down_votes":5,"body":"HoTS is way more infuriating than LoL can ever hope to be\n\nI'm not sure if they allow 'premade solo queue' in HoTS anymore but my buddies and I easily cheesed to high Masters just running the same OP heroes over and over because Blizzard doesn't even understand their own game's meta and refuse to communicate with the playerbase.","replies":[{"poster":"Synx7","date":"2016-01-31T15:39:01.041+0000","up_votes":13,"down_votes":4,"body":"> [{quoted}](name=YossarianSensei,realm=NA,application-id=3ErqAdtq,discussion-id=nxEcenLh,comment-id=00090000,timestamp=2016-01-31T15:35:08.677+0000)\n>\n> HoTS is way more infuriating than LoL can ever hope to be\n> \n> I'm not sure if they allow 'premade solo queue' in HoTS anymore but my buddies and I easily cheesed to high Masters just running the same OP heroes over and over because Blizzard doesn't even understand their own game's meta and refuse to communicate with the playerbase.\n\nRiot communicate with the playerbase and nothing happens. In HoTs the only op champ is Zeratul or Nova. \nHere u play as well the same champs over and over. Graves. TOP /JUNGLE/ADC . Why play anything else when this piece of shit wrecks everything?","replies":[{"poster":"YossarianSensei","date":"2016-01-31T15:52:00.211+0000","up_votes":11,"down_votes":1,"body":"> [{quoted}](name=Synx7,realm=EUNE,application-id=3ErqAdtq,discussion-id=nxEcenLh,comment-id=000900000000,timestamp=2016-01-31T15:39:01.041+0000)\n>\n> Riot communicate with the playerbase and nothing happens. In HoTs the only op champ is Zeratul or Nova. \n> Here u play as well the same champs over and over. Graves. TOP /JUNGLE/ADC . Why play anything else when this piece of shit wrecks everything?\n\nThere's no 'OP' champ in HoTS, everything is team comp. Zeratul alone is pretty good but he's not overpowered without Abathur.\n\nSame thing is true for LoL, except there's a much larger champion pool to build a team out of. \n\nAlso in LoL when something's OP it's only mildly OP, it's not like HoTS where Illidan+Abathur dominated high level play for months at ~ 70%+ winrate","replies":[{"poster":"Roseluck","date":"2016-01-31T16:58:31.062+0000","up_votes":5,"down_votes":0,"body":"One of my gripes with HotS was how they dealt with the Lost Vikings. I used to main them back when they were proper broken, at 70% winrate, but they nerfed them the wrong way, flat out removing some of their skills and making the champion so binary and boring to play that it's an embarassment\nThe problem to me is in general, I find the champion design to be unhealthy for most heroes there. Interesting yes, but not so much fun.","replies":[{"poster":"YossarianSensei","date":"2016-01-31T17:33:11.029+0000","up_votes":17,"down_votes":0,"body":"IMO a lot of the hero designs in HoTS are fun so long as you play the game Casually.\n\nHoTS is 100% more fun than LoL as a casual MOBA IMO, but as soon as you start taking it the tiny bit seriously it becomes a crapshoot.","replies":[]}]}]}]}]}]},{"poster":"PapaGreg21","date":"2016-01-31T16:48:48.724+0000","up_votes":34,"down_votes":0,"body":"A lot of valid points here unfortunately. Late game champs are basically shelved in this meta because nobody is hitting full builds. I remember the cinderhulk meta where outside of 2 or 3 outlier strong champs almost everything was greatly balanced and the game felt so fair and rewarding.","replies":[]},{"poster":"Radioactive Man","date":"2016-01-31T14:52:42.915+0000","up_votes":34,"down_votes":0,"body":"Season 6 feels more and more like bullshit every day. Yes the other seasons have had their moments but I can't think of a single one where my first though in a game for the day is how much I hate every change they made this time around.","replies":[]},{"poster":"Uiraya","date":"2016-01-31T18:54:10.471+0000","up_votes":33,"down_votes":0,"body":"The best part about shorter games is that Riot already has TWO ENTIRE MODES dedicated to shorter games that they IGNORE. Why fuck with Rift this much?","replies":[]},{"poster":"FuntaC","date":"2016-01-31T17:45:14.122+0000","up_votes":37,"down_votes":3,"body":"It is often spoken in business that smarter people have less common sense. it is a fact that many of the pinnings of game mechanics are built upon common sense factors. This idiom versus fact becomes a paradox.\n\nA rioter stated in January that recent changes have questioned some long held anchors of LoL game design. I am assuming that the current devs are very smart, since the common sense factors were being questioned. This is the root of all the problems you listed.\n\nWe can talk about turret diving as a prime example. The reason stronger turrets make for a better game is that the risk:reward ratio is more reasonable. It is a common sense factor. The enjoyment of watching a turret dive is knowing that there is a high risk. Now, we have no risk turret dives, and the result is boring. The thrill of turrets was nothing more than the tradeoff of damage given versus damage assuredly taken. That is the player and viewer perception that incites emotion. That effect is also common sense.\n\nSo, we have devs that are too smart, so the product becomes more stupid. Interesting twist right? The only solution is to hire devs that understand this balance, and that have the power to enforce it.","replies":[]},{"poster":"BALDG1VEN BOOMER","date":"2016-01-31T16:09:15.132+0000","up_votes":28,"down_votes":1,"body":"Did you see the C9 vs TSM game yesterday, it was just a base race for the inhib and first blood was at 20 mins into the game...","replies":[]},{"poster":"LaughingStapler","date":"2016-01-31T12:46:24.827+0000","up_votes":25,"down_votes":1,"body":"I'm most mad about what they did to my AP Kog. He used to be a great but slow-scaling poke mid-laner and they just randomly butchered his poke to force him into some on-hit monstrosity. Sorry Riot, I like poking and aiming stuff instead of just spamming autos like a coked out Kalista. They took a champion with many cool playstyles and builds then reduced all that to one true path. \n\nBesides the stylistic differences, he just isn't good mid anymore because he still scales slowly but lacks the hypercarry potential from before. To maximize damage output, you really need to get close and that means almost instant death without a perfect team comp. Before the rework, he was always useful mid because at least he could poke and show some lane presence. Good luck trying to use your W on a Zed, Talon or even normal mids like Orianna and Viktor. [This ](http://boards.na.leagueoflegends.com/en/c/gameplay-balance/RcMpy4qi-why-kog-mid-isnt-a-thing-anymore)explains a lot of what I mean.","replies":[]},{"poster":"FrankerX","date":"2016-01-31T12:02:43.840+0000","up_votes":26,"down_votes":3,"body":"i hope someone from riot will answer to this thread. a statement. especially on the champ thing. wasnt it like every 5th new champ, 1 champ does down in ip cost???\n\nsadly this is true. i dont like these threads because mostly they are shit but this one is true TRUE AND TRUE.\ni barely played in 6.1 and when 6.2 hit us i tried an aram and the cam was all fucked up and i stopped playing again.\nits just... i think i played 4 games this season so far.\n\nthat is sad. because its just boring. even aram isnt fun anymore","replies":[{"poster":"Synx7","date":"2016-01-31T14:28:22.472+0000","up_votes":22,"down_votes":2,"body":"> [{quoted}](name=Brâ1ncânc3r,realm=EUW,application-id=3ErqAdtq,discussion-id=nxEcenLh,comment-id=0001,timestamp=2016-01-31T12:02:43.840+0000)\n>\n> i hope someone from riot will answer to this thread. a statement. especially on the champ thing. wasnt it like every 5th new champ, 1 champ does down in ip cost???\n> \n> sadly this is true. i dont like these threads because mostly they are shit but this one is true TRUE AND TRUE.\n> i barely played in 6.1 and when 6.2 hit us i tried an aram and the cam was all fucked up and i stopped playing again.\n> its just... i think i played 4 games this season so far.\n> \n> that is sad. because its just boring. even aram isnt fun anymore\n\n\nThe sad part is that they wont even bother lookin at this. And they wont do anything anyway.\n\" They are always right\". Fuck their champion favoritism.\nhttps://www.youtube.com/watch?v=SlDqcjEjm6I\nLook at this. I start to believe that by day that riot doesnt even deserve this huge player base ( hope soon to diminish) , and they're the most incompetent gaming company across the globe","replies":[{"poster":"Hot Cousin","date":"2016-01-31T15:52:56.542+0000","up_votes":20,"down_votes":1,"body":"> [{quoted}](name=Synx7,realm=EUNE,application-id=3ErqAdtq,discussion-id=nxEcenLh,comment-id=00010000,timestamp=2016-01-31T14:28:22.472+0000)\n>\n> The sad part is that they wont even bother lookin at this. And they wont do anything anyway.\n> \" They are always right\". Fuck their champion favoritism.\n> https://www.youtube.com/watch?v=SlDqcjEjm6I\n> Look at this. I start to believe that by day that riot doesnt even deserve this huge player base ( hope soon to diminish) , and they're the most incompetent gaming company across the globe\n\n\nDear God","replies":[]},{"poster":"FrankerX","date":"2016-01-31T14:40:39.318+0000","up_votes":5,"down_votes":2,"body":"i mean balancing is hard lets be real.\nwith over 120 champs making every one balanced is just not possible.\nbut yea rito really fucked things up with season 6. really bad!\n\nas it is right now... riot shouldnt make patch 6.3 they should do 7.1","replies":[{"poster":"Radioactive Man","date":"2016-01-31T14:54:46.459+0000","up_votes":16,"down_votes":0,"body":"> [{quoted}](name=Brâ1ncânc3r,realm=EUW,application-id=3ErqAdtq,discussion-id=nxEcenLh,comment-id=000100000000,timestamp=2016-01-31T14:40:39.318+0000)\n>\n> i mean balancing is hard lets be real.\n> with over 120 champs making every one balanced is just not possible.\n> but yea rito really fucked things up with season 6. really bad!\n> \n> as it is right now... riot shouldnt make patch 6.3 they should do 7.1\n\nBalance is one thing, actively buffing a champ that is already toxic as hell in the current meta is another.","replies":[]}]},{"poster":"The Ginger Ninga","date":"2016-01-31T17:34:57.430+0000","up_votes":7,"down_votes":0,"body":"Buffing Xin isn't favoritism, it's just making sure even new people get to know the fear of release Xin levels of power. \n\n/s","replies":[]}]}]},{"poster":"Saianna","date":"2016-01-31T12:57:33.303+0000","up_votes":23,"down_votes":4,"body":"Everyone rememebrs Sejuani nerfs, they even call champions \"sejuani'ed\"\n\nBut the real victim of Riots dumbfuck decisions is Warwick. He lost by far more of power than Seji. \nHe's still viable, but the fun part... Gone.","replies":[{"poster":"LankPants","date":"2016-01-31T14:59:21.757+0000","up_votes":19,"down_votes":0,"body":">But the real victim of Riots dumbfuck decisions is Warwick. He lost by far more of power than Seji.\n\nThe difference between these at least IMO was the reasoning and long term planning.\n\nIn WW's case Riot did have a reasonable reason. He did lack counterplay and really gameplay of any kind. You may not agree with the reason but it actually exists. In Sej's case the reason was more or less \"we like her less than other junglers\".\n\nIn terms of long term planning Riot was at least planning a WW rework at one point. No idea if they still are though. I'm yet to see anything that suggests Riot actually has any plans regarding Sej.","replies":[]}]},{"poster":"Lugg","date":"2016-01-31T17:58:28.710+0000","up_votes":18,"down_votes":0,"body":"Great post. I agree with you on pretty much everything. Towers are incredibly weak, any champ can take them down now. They need to either do more damage or be harder to kill. Late game champs are pretty much a non factor now. \n\nThe game is awful now due to the fact that you can play a perfect game up to the 30 minute mark, and then lose the game on just one mistake. I have seen games where the one team is up 10 kills, has an inhib down, and in complete control of the map. Then they lose one teamfight and the other team has time to take the Nexus since the towers are so weak and the death timers so long. \n\nI really agree that their are WAY too many toxic champs now. If a champs kit is naturally toxic, they should honestly be put slightly on the UP side versus the OP side. The balancing team really does need to be fired and replaced with people who have at least some common sense. \n\nMore bans are definitely needed. The new season works perfectly into this. 10 bans for a match only shuts out about 8% of the champs in the game.","replies":[]},{"poster":"dEAdbUs","date":"2016-01-31T16:01:08.905+0000","up_votes":18,"down_votes":0,"body":"I have to agree with every point. You just clearly explained what I was thinking about since previous season. Special... reworks with doubtfully fun kits, badly designed last champions (now I can't just sit and get some fun from game, I need to work hard to be able to play my champion, it feels like I'm fighting with my own champion not with enemy), etc. \n\nTo be honest I stopped to play in this preseason and still have no wish to keep playing, because game is becoming too hardcore. It's becoming like StarCraft or something, where you need to control over 9000 things same time, but here you else need lightspeed reaction.","replies":[]},{"poster":"Rain NT","date":"2016-01-31T12:58:38.808+0000","up_votes":19,"down_votes":1,"body":"The mana pots man... it feels bad man","replies":[]},{"poster":"Earl Eulrich","date":"2016-01-31T12:34:25.590+0000","up_votes":20,"down_votes":2,"body":"- itemization also adds a lot to the snowballing, as hitting core-gear now takes longer than before and there are no alternatives like getting an early last whisper if you fall behind anymore (mostly the reason most korean teams try to avoid fighting till their carry has at least 2-3items completd, so there is still a chance for a comeback if you lose a fight)\n\n- vision is entirly balanced around the jungler playing wardbot - making the game unplayable in soloq if you don´t jungle yourself most of the times. And even if jungle and supports ward properly vision is still insanly snowbally, as the winning team can easily clear out pink and bluewards while protecting their own. Again, this leads to very passive gameplay once you fall behind, because you can just stare into the darkness and hope the monster that is somewhere in there screws up.\n\n- rapidfire canon is just silly....marksmen are balanced around their respective ranges and this item just invalidates all that balancing - a 3item vayne can q-rf-crit you from 1000range for 700+dmg, outranging and outdmging any skillshot reliant poke in the game. And she´s not even the worst offender.","replies":[{"poster":"Hot Cousin","date":"2016-01-31T12:53:48.103+0000","up_votes":4,"down_votes":1,"body":"One of my good friends went from maining jungle to absolutely despising it after the ward changes.  Now he mains support ;)","replies":[{"poster":"invisiblecat1","date":"2016-01-31T16:51:17.618+0000","up_votes":8,"down_votes":0,"body":"I hate the ward changes so much, I wish the warding trinket wasn't the only way to ward without spending so much gold","replies":[]}]}]},{"poster":"Niaphim","date":"2016-01-31T15:50:25.434+0000","up_votes":18,"down_votes":1,"body":"Because of these changes both EU and NA LCS are more boring and even frustrating to watch. Increasing the cost of mistakes has led to the exact opposite effect - pros tend to stall games, then someone inevitably makes something wrong and everything collapses in a matter of minutes.\n\nPersonally after I've completed placements I can't find motivation to play anymore, I feel like every game is going to be a clown fiesta. So I ended up blowing dust from my hundreds of indie games on Steam which I got on sales and finally getting into it.","replies":[]},{"poster":"jQuery","date":"2016-02-01T21:08:14.556+0000","up_votes":14,"down_votes":0,"body":"I don't feel like I have played much league as most people here, but i feel the same. \n\nIn the 2 and a half years I have played it, the biggest pause i had from league was in preseason, 2 whole weeks. \n\nI just... I dont know, I am just loosing interest. \nMy wife too, she started playing less and less since the bilgewater event, whenever I asked her why she playing less, she would just say \"I don't know... \". She does not care much for patches and usually plays ARAM. And i think to much changes just made her feel estranged to the game she knew.\n\nI feel the same way now, so many changes so fast, I feel like the game is running away from me; \n\n * I don't have a main role anymore. \n * I don't have main champions anymore. \n * I did more unlearning of league last year then learning.\n * It starts to feel like work sometimes.\n\nIt is like I am loosing a race against Riot Games and I never even wanted to race them.\n\nAnd at this point I feel like they are gonna stay blind until they drown this game or until we do something as drastic as a boycott. These posts never helped us even more it feels like they keep doing things out of spite and it makes me sad.","replies":[]},{"poster":"Gardevoir Pony","date":"2016-01-31T15:50:22.941+0000","up_votes":16,"down_votes":2,"body":"I agree completely with the OP. This is not the League I used to enjoy, I used to love League and picking up a mage like {{champion:16}} and {{champion:26}} when they could BOTH work as Solo laners. Both were much much better before Riot DESTROYED them and now Soraka is getting MORE nerfs because she was played ONCE in the LCS instead of the usual boring mix of Thresh/Alister/Morgana. I am TIRED of seeing the same champs like {{champion:117}} in the LCS. The bitch was supposed to be a support and now she's doing better then Soraka EVER did in solo lanes and somehow she's NOT getting a rework. \n\nThe favouritism from Riot is annoying and completely unfair to AP mains like myself who prefer skill over spammy assassins and bruisers.","replies":[]}]}