{"poster":"LevvyLeviticus","date":"2016-09-11T05:17:23.592+0000","title":"Yasuo or Zed?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Should I get\r\nA. Yasuo\r\nB. Zed\r\n\r\nYasuo: Pros &amp; Cons.\r\n\r\nPros:\r\nYasuo is very, VERY broken\r\nHe doesn&#039;t use a resource (Rage, Fury, mana, focus, etc*)\r\nHis e has a 0.1 second cooldown\r\nHis q sends out a tornado that knocks you up in the air\r\nHe gets 2x the crit chance\r\nUlt destroys everything\r\nDespite having a full difficulty bar, has a very low skill cap\r\n\r\nCons:\r\nYasuo will likely be nerfed soon\r\n\r\n\r\nZed: Pros &amp; Cons\r\n\r\nPros:\r\nA... bit broken, but not insanely.\r\nPassive deals extra magic damage to people under 50% health\r\nW creates a mimicking shadow that he can teleport to\r\nUltimate destroys enemies\r\nPretty easy to play\r\n\r\nCons:\r\nZed cannot spam his abilities, as he has Focus.\r\n\r\nPlease reply, as I want one of these two and don&#039;t know which one to get\r\n\r\nIf you don&#039;t think i should get any of these and instead get another Champion i will look into it\r\n\r\nThanks.","replies":[{"poster":"Lord Sesshomaru","date":"2016-09-11T05:54:50.130+0000","up_votes":2,"down_votes":1,"body":"Please, just please don't get either.\n\nBuy a real champ, there is already a Yasuo in every game, and NO ONE needs any more of them around.","replies":[{"poster":"LevvyLeviticus","date":"2016-09-11T06:17:53.155+0000","up_votes":1,"down_votes":0,"body":"Nah, I'll get Zed, since Championship Zed is around the corner and he counters Yas-u-CANCER.","replies":[{"poster":"Lord Sesshomaru","date":"2016-09-11T06:21:17.102+0000","up_votes":2,"down_votes":0,"body":"Chemotherapy does kill cancer its true, but much of the time it causes more harm than good.\n\nSo think about that. \n\nmaybe get a real champion like Aurelion Sol or Anivia.","replies":[{"poster":"Sloth Almighty","date":"2016-09-11T07:30:08.078+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=FjGAIbRv,discussion-id=uhflKGzn,comment-id=000200000000,timestamp=2016-09-11T06:21:17.102+0000)\n>\n> Chemotherapy does kill cancer its true, but much of the time it causes more harm than good.\n> \n> So think about that. \n\nThis analogy was enjoyed","replies":[{"poster":"Lord Sesshomaru","date":"2016-09-11T08:07:10.196+0000","up_votes":1,"down_votes":0,"body":"im glad haha xD","replies":[]}]}]}]}]},{"poster":"Łæoña","date":"2016-09-11T05:36:29.869+0000","up_votes":1,"down_votes":1,"body":"Yasuo is a easy champ to play but a little difficult to master the combo, zed is similar but easily to get a good grasp his combo. If you want a slightly challenging champ then go for Yas{{champion:157}}","replies":[{"poster":"LevvyLeviticus","date":"2016-09-11T05:38:08.169+0000","up_votes":1,"down_votes":0,"body":"Much appreciated, I'm getting some rp in an hour or so.","replies":[{"poster":"Łæoña","date":"2016-09-11T06:46:21.524+0000","up_votes":1,"down_votes":0,"body":"RP? its worth buying champs with IP and save the RP for the sweet skins to brag about ","replies":[{"poster":"LevvyLeviticus","date":"2016-09-11T07:10:02.897+0000","up_votes":1,"down_votes":0,"body":"k, BUT IT'S HARD GETTING IP WHEN EVERY GAME YOU LOSE CAUSE THERE'S ANOTHER FRICKEN YASUO","replies":[{"poster":"Łæoña","date":"2016-09-11T07:15:25.671+0000","up_votes":1,"down_votes":0,"body":"The highest I saved up is 13.9K IP which I used to change my name, and good thing is Yasuo is likely gonna get a nerf if his win rate is really high up there.","replies":[{"poster":"Erøse","date":"2016-09-11T10:08:23.914+0000","up_votes":1,"down_votes":0,"body":"Lol what? Zed is harder than yasuo lmao.","replies":[{"poster":"Łæoña","date":"2016-09-11T10:31:20.645+0000","up_votes":1,"down_votes":0,"body":"no no no. you mis-read it. I didn't say zed has a harder skill floor I said zed is similar; easy to play where his combo and skills is easy to grasp onto, there is nothing difficult for any players to learn to play him","replies":[{"poster":"Erøse","date":"2016-09-13T06:36:55.887+0000","up_votes":1,"down_votes":0,"body":"Zed is nowhere easy to play. You actually need skills to play zed lol","replies":[{"poster":"Łæoña","date":"2016-09-13T10:36:05.223+0000","up_votes":1,"down_votes":0,"body":"I played zed once and I almost instantly got a hang of his skills and his combos, he's not hard just requires a somewhat amount of knowledge and you'll be able to make plays. Not sure how you found difficult to master.","replies":[{"poster":"Erøse","date":"2016-09-14T03:21:43.460+0000","up_votes":1,"down_votes":0,"body":"Im pretty sure you guys have not played Zed against high elo players.","replies":[{"poster":"Łæoña","date":"2016-09-14T05:06:14.836+0000","up_votes":1,"down_votes":0,"body":"Don't know why you're bringing in elo as I was talking about skill floor. Besides Im getting real tired of this","replies":[{"poster":"Erøse","date":"2016-09-16T10:11:17.863+0000","up_votes":1,"down_votes":0,"body":"Because low elo = don't know how to play against a Zed therefore giving the impression of Zed being an easy champion. In high elo, people actually know how to counter him and render him useless.","replies":[{"poster":"Łæoña","date":"2016-09-16T10:40:54.695+0000","up_votes":1,"down_votes":0,"body":"OH MY GODD. \n\nIm gonna shut this down.\n\nFirst of all Im talking about the skill floor of zed, never did I talked about countering him in what elo.\n\nYour able to grab an easy grib on his combo like I did and I aint even in high elo.\n\nAnd Zed is popular so people should know how his abilities if not then they are just plain idiots unless they are new given the circumstances.\n\nConsidering your in Silver, the grip on his combo is still easy but using it smartly to either sneak away or get a kill smoothly like how you seen in the LCS, they use their abilities in a way to execute their combo smoothly.\n\nIf u find playing zed difficult then you must be a slow learner, or just not have enough time to invest into zed.\n\nAnd before I close, you said \"you actually need skills to play zed\" I have to admit that your correct but it doesn't take you 25 or 30 games to learn how to use his abilities, it takes more skills to execute his combo smoothly without making a mistake out of panic.\n\nIt comes down to zed being easy to HAVE A GOOD IDEA OF HIS ABILITIES BUT REQUIRE A BIT MORE SKILL TO EXECUTE HIS ABILITIES PROPERLY.","replies":[]}]}]}]}]},{"poster":"Lord Sesshomaru","date":"2016-09-13T06:42:42.409+0000","up_votes":1,"down_votes":0,"body":"You press R, Put your cursor on the enemy, press all the other buttons, auto once, press R.\n\nYep... cant think how that could possibly be easy.","replies":[{"poster":"Łæoña","date":"2016-09-13T10:41:23.621+0000","up_votes":1,"down_votes":0,"body":"Best mastery is thunderlords as everyone should know. I sometimes go by the combo of W+E+Q and if nesscerily to finish off with ult. By the time I W,E,Q ; my  proceed thunderlords. combos I've seen are either WEQR or RWEQW.\nHis Q is a skill shot ability. I'm pretty sure everyone you've played champs with skill shot abilities.","replies":[]}]}]},{"poster":"Łæoña","date":"2016-09-11T10:33:55.077+0000","up_votes":1,"down_votes":0,"body":"I'm kinda saying the opposite of what you said.","replies":[]}]}]}]}]}]}]}]},{"poster":"Arkangyle","date":"2016-09-12T02:22:54.366+0000","up_votes":1,"down_votes":0,"body":"If your biggest issue is coming up against Yas every game, try playing a champ that counters him.\n\nIdeal candidates include Fizz, Azir and Malzahar.","replies":[{"poster":"LevvyLeviticus","date":"2016-09-12T22:07:57.225+0000","up_votes":1,"down_votes":0,"body":"What Lord said, Azir doesn't really counter him, as Zed does, as Yasuo can only block one of his abilities atm\n\n\n\n\n\n\nRITO PLZ DONT REWORK ZED IN THE ASSASIN REWORK","replies":[]},{"poster":"Lord Sesshomaru","date":"2016-09-12T02:31:21.143+0000","up_votes":1,"down_votes":0,"body":"Not Azir, Yasuo as enough mobility to keep out of the soldier zones with ease.\n\nAzir's wall is the only thing thats useful against Yasuo, and even then, Yasuo's Q/R goes over it no problem.\n\nPlus Azir is in one of the weakest places he has ever been atm, and Yasuo is in one of the strongest.","replies":[]}]},{"poster":"Erøse","date":"2016-09-11T10:10:36.918+0000","up_votes":1,"down_votes":0,"body":"Buy Zed, honestly Zed is so much more fun to learn and the outplay potential on that guy is stupid. Literally yasuo gets so boring because late game you come back you are just overpowered asf while Zed actually requires skills. It's not as easy to play Zed in high elos because you get punished if you misposistion your shadow or engage on a dumb fight with your ult.","replies":[]},{"poster":"Lord Kylar Alice","date":"2016-09-11T06:42:56.033+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LevvyLeviticus,realm=OCE,application-id=FjGAIbRv,discussion-id=uhflKGzn,comment-id=,timestamp=2016-09-11T05:17:23.592+0000)\n>\n> Yasuo: Pros &amp;amp; Cons.\n> Pros:\n> Despite having a full difficulty bar, has a very low skill cap\n\nExtremely high skill cap, moderate skill floor.","replies":[{"poster":"LevvyLeviticus","date":"2016-09-11T07:10:45.595+0000","up_votes":1,"down_votes":0,"body":"Shut up, he doesn't. You're just a butthurt Yasuo main","replies":[]}]},{"poster":"CHEESYLEEKS","date":"2016-09-11T05:44:33.562+0000","up_votes":1,"down_votes":0,"body":"Its like asking \"should i get cancer or ebola\"","replies":[{"poster":"LevvyLeviticus","date":"2016-09-11T05:50:40.586+0000","up_votes":1,"down_votes":0,"body":"No, Katarina is cancer, and Yasuo is ebola.\n\n\n\n\nGet it right lmao","replies":[{"poster":"Lord Sesshomaru","date":"2016-09-11T05:59:14.022+0000","up_votes":1,"down_votes":0,"body":"No theres many strains of cancer, Katarina is like lung cancer or something. Yasuo is like a brain tumour.","replies":[{"poster":"Łæoña","date":"2016-09-11T06:47:45.198+0000","up_votes":1,"down_votes":0,"body":"Have you seen swain? He's really stupid but very little played. Once you play against a swain whose fed then you will know what I mean","replies":[{"poster":"Lord Sesshomaru","date":"2016-09-11T06:56:37.109+0000","up_votes":1,"down_votes":0,"body":"Yea swain is a bitch, but at least swain cant chase you down from halfway down the lane.\n\nJust play Aurelion Sol into Yasuo, then you'll know the meaning of cancer.","replies":[]}]}]}]}]}]}