{"poster":"LevvyLeviticus","date":"2016-05-04T22:25:37.066+0000","title":"I Just Find It Very Annoying...","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Well, I try really hard, but for some reason, I always end  up at like 9 deaths and 2 kills. I feel like i feed everyone and i suck at laning, mid-game, and late game, and i cannot make my own builds. I feel like I&#039;m not very good at the game, &amp; I&#039;m not really meeting the requirements for a good lvl 12 player. Seriously, the only characters i can play are support, and i&#039;m not even that good at that. I look on YT and I can&#039;t find anything. please, can anybody help?{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Ingénue","date":"2016-05-05T00:51:48.626+0000","up_votes":1,"down_votes":0,"body":"Try not to get too caught up in it tbh. Back when I was new to the game, I played beginner AI till level 20 because I was feeding in intermediate and too scared for PVP. \n\nThe hardest thing is playing PVP and being surrounded by toxins. It seems that in pre-30 games, you will only encounter a truly new player 1 in every 15-20 games. Everyone else will be a smurf (and they are pretty toxic, expecting everyone else to be smurfing and going crazy with the insults if you aren't doing too well). \n\nLike anything, you need to make your environment conducive to learning. Appeal over on the team recruitment board for some friends to play with you and give you tips. Its more fun and less toxic to play with friends, you also get things like extra IP, mastery points and increased chances of hex tech stuff.\n\nNext I would suggest learning some of the more easy champions (Lee sin is pretty difficult if you are new to the game and not many people have seen kayle so don't know how to play with her well). Try things like Annie and Poppy. Once you learn more about the game and feel more confident in having an even score, that is when you should start trying more difficult champions. \n\nYour CS is pretty average, but you are a new player so it is understandable. My CS was way worse at your level. I would suggest jumping into a couple of custom games and [practicing this skill](http://imgur.com/orWUCKH). The more you practice and get into good habits now, the easier it will be when you hit level 30. \n\nThere are also a bunch of other skills that will really help you in short term and the long term, most can be learned through[ this short video series. ](https://www.youtube.com/watch?v=3CV7yxgP4Kc&list=PLRILbAMFFjpzWPRqNWK8rolmvDddd-1lk)\n\nIf you have any further questions, don't be afraid to ask. \n\nGood luck, have fun ♥\n\nNote for the future: do not jump straight into ranked.","replies":[{"poster":"LevvyLeviticus","date":"2016-05-05T05:59:45.753+0000","up_votes":1,"down_votes":0,"body":"Thanks, this'll really help me! (Also, I know not to jump into ranked straight into ranked, my friend learned that the hard way.)","replies":[]}]},{"poster":"The Spawn Man","date":"2016-05-04T22:46:45.360+0000","up_votes":1,"down_votes":0,"body":"It is good that you have embraced your flaws. It is the first step to becoming better.\n\nIf I hadn't answered like 500 of these types of threads already, I'd post advice. However, I have, so what I'd suggest is to go through the 'Gameplay and Strategy' section of these boards - there will be many threads just like yours where people have posted advice. I'd recommend going there as a start.\n\nI'll give 3 very quick tips. 1) Pick a champ you enjoy mechanically and in a role you enjoy. 2) Learn how to CS and control a lane. 3) Make good decisions. Watch better players and how they work the same champ and the decisions they make.","replies":[]}]}