{"poster":"Malygos","date":"2016-04-13T01:11:54.568+0000","title":"A brief explanation as to why Renekton is the most progressive champion in League of Legends.","subforum":"GD","up_votes":2,"down_votes":3,"body":"Hello friends and forumgoers, lately I have been thinking on the sad state of the world and it&#039;s left me feeling rather sad and depressed (if you&#039;d like to support me and help me through this you can do so here: https://www.patreon.com/Kromka?ty=h ) \n\nToday I thought it would be good to highlight the more positive aspects of the world. \n\nFirst of all, I know you&#039;re thinking &quot;But Maly, how could a **CIS GENDERED MALE** be progressive?&quot; so I&#039;ll tackle this first. Though Renekton likely identifies as male, he does wear a skirt. I believe this may be the point of contention between Nasus and Renekton&#039;s brotherly drama... could it be that perhaps Renekton is gay? Or... maybe... he (sorry, xe) could be trans! Nasus belongs to the puptriarchy; the societal system which oppresses all animals who do not identify as dogs (and even dogkin do not compare to natural born dogs, it&#039;s disgusting!)\n\nAt such an exciting prospect I took to Google Images to see if I could uncover more about this deep and meaningful character. It came to me, as no surprise to find there are a large number of pictures which show Renekton in xyr feminine dream! I knew it! There are more people who must have seen xyr hinting, perhaps xyr murderous rage comes from the deep seated oppression of trans individuals spawned by the Patriarchy.\n\nThough xe is a carnivore (not fetish shaming) I can see xe at least upholds morals in xyr stance. &quot;Light meat, dark meat, it&#039;s all the same&quot; xe says. It&#039;s exciting, I always believed murder of another living soul for consumption to be evil! However, Renekton has shown me it&#039;s possible to do so with a moral standing. Personally, I&#039;ll be trying cis white hetero male with my next bowl of scrambled tofu! Ha ha, I wonder how xe prepares it ^_^\n\nFinally, I&#039;d like to mention how xe breaks gender norms. Xe is employed as a butcher at a restaurant called The Sands (I did a quick google search, it looks fancy http://lesands.com.au/ ), butchery is a male-dominated space and seeing a dedicated crocodilekin work xyr way to the top of this industry is incredible!\n\nSo three claps for Renekton and one clap for Riot Games (sorry, you lost the other two due to the significant intrusion of patriarchal norms spread throughout your game and company).","replies":[]}