{"poster":"4fy9bEOt7y","date":"2016-04-26T07:50:21.103+0000","title":"I hate to say it, but Tyler1 is actually correct.","subforum":"Miscellaneous","up_votes":3,"down_votes":1,"body":"In a few months all lane swill be filled with tanks and the game will become stale because of Sunfire Cape, Spirit Visage and Iceborn Gauntlet. The fact that tank Fizz will out damage an almost full-build ADC or APC with those three items is ridiculous and nonsensical.\r\n\r\nWhy play a squishy champion such as Ashe or Xerath when you can play a champion like Volibear, who does the same, if not more damage, than a full-build ADC, while having over three thousand more health.\r\n\r\nHonestly, in 65% of my games have at least two people building those three items and doing almost double the damage that I, or my ADC, have done. How is that considered balance or fun? The reason I enjoyed URF so much was because none of those items were viable and there was variation in the champions and builds.\r\n\r\nNow that I&#039;m back to other game-modes, I can see just how unfun and infuriating versing that combination is. I may as well start taking those three items on everyone, grab a Warmogs and maybe a Thornmail and then whatever else I could use, not that it matters because I&#039;ll already being doing more damage than the enemy team, and win the game.\r\n\r\nSoon, everyone will just buy those three items and that&#039;s it.\r\nPeople have been complaining about these items for months! Nothing was ever done.","replies":[{"poster":"GigaPube","date":"2016-04-27T03:10:47.429+0000","up_votes":2,"down_votes":0,"body":"totes legit complaint brah, especially the part about mentioning a draven one-trick complaining about a harder-to-kill fizz and doesnt blame the lack of wards or his feeding teammates or the fact that its a solo laner versus a potentially early-to-mid game adc\n\neven more legit about comparing whats strongest in the highest level of play (definitely not any level of oce ranked, let alone low level solo queue, let alone yet again, ranked at all) to your own singular gameplay, which is most like 1 or more of the conditions i just mentioned. LET ALONE, comparing urf to regular gameplay, TOTES LEGIT M8\n\nthis is ritos game, they do what they want, and you play THEIR game, the way THEY make it and change it. if you think you can play tank fizz in the bot lane, and succeed, against an ashe, a lucian, against any ADC, as the way you put it, then you go right ahead, see where it gets you. if you get to challenger playing just that, congrats on getting korean silver, now go to any other region at all, and try to achieve the same thing, with the same conditions, see where it gets you, and please, come back here and prove me wrong. i would love to see that, that would be a great larf, hilarious m8, it means ill learn something. it means any OCE chump truly can define the strongest that is worthy of being meta, any OCE chump can make a complaint on the boards and prove everyone wrong about their whiney complaints that would normally get scoffed at. good luck on your quest","replies":[]},{"poster":"JasonWazza","date":"2016-04-26T08:37:56.466+0000","up_votes":2,"down_votes":1,"body":"Spirit Visage, and Iceborn are probably in the right spot where they are.\n\nThe major problem is the Undying Grasp keystone, and Sunfire cape, that combination on anyone who can have any sort of stickiness (which is why people use the iceborn) makes it relentless, as your always dealing damage and always healing back with Grasp.\n\nWhat needs to be done is a slight tone down on Sunfire, and a proper nerf on Undying Grasp.\n\nThat said Rito don't care, so prepare for another tank meta.","replies":[]},{"poster":"Little Wolff","date":"2016-04-28T04:48:54.821+0000","up_votes":1,"down_votes":0,"body":"To say that are doing the same amount of damage is incorrect. The problem is that you play full tank so unless you have a lot pen on adc or apc about 30-50% of your damage is blocked. And you are actually doing far more damage then them but that have 3 times more health. You will fight one and get them to 1 quarter health fairly easy and die but you did twice much damage as them. It really relies on team play you need a tank to peel for you and you will put damage all them. It is made to be a team game if they have 5 tanks and your team has three as long your tank do a good job at peeling and keeping them off of you. You will win the team fight 9time out of 10 . So no your full adc on less they having amazing kiting will not be able to 1v1 a high base damage tank bit will out damage in a team scenerio.","replies":[]},{"poster":"Main Line","date":"2016-04-26T13:06:36.945+0000","up_votes":1,"down_votes":0,"body":"Get ready for the 6.9 permaban of Zed, creating the new tank meta, and where Kog'Maw is nerfed in 6.10 just to solidify this state.","replies":[]},{"poster":"Requiemsfire","date":"2016-04-26T09:56:20.367+0000","up_votes":1,"down_votes":0,"body":"The issue isn't tanks like Volibear, Garen or Mundo,\n\nThe issue is that other champions are able to abuse the same items and be able to maintain moderate amounts of damage packed with utility, while being tankier than most such as Ekko, Fizz, Akali etc. Sure, they might not be able to outsustain a proper tank, but they deal enough damage with their combo, are tanky enough, to kill any squishy. Being tankier covers their primary weakness, which is CC and allows you to survive a lot of burst. While you probably won't get a triple kill or penta, you're still able to dive the enemy team, kill a squishy and escape with a good portion of your HP intact.","replies":[]},{"poster":"Tomo7182","date":"2016-04-26T09:43:06.417+0000","up_votes":1,"down_votes":0,"body":"Sunfire was good before they buffed its damage to minions and monsters (by 50%?) but they really need to change it back cuz right now every one is a singed with the aoe from sunfire.\n\nLike really isnt a gangplank buying sunfire cape and full tank while dealing the most damage in the game a sign that those items are broken (tank gp is legit cancer)","replies":[]}]}