{"poster":"THEPENGUINO","date":"2016-12-25T11:06:04.281+0000","title":"Will this run league well?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Hi,\r\n\r\nI was just wondering if this would run league well because my current laptop has broken.\r\n\r\nAcer Aspire E5-523G-90QW 15.6&quot; Notebook\r\n\r\nThanks","replies":[{"poster":"Fitzky","date":"2016-12-26T00:41:07.371+0000","up_votes":1,"down_votes":0,"body":"Probably not the best, but should run pretty smoothly on medium - low settings","replies":[]},{"poster":"BarryButcher","date":"2016-12-25T22:25:42.450+0000","up_votes":1,"down_votes":0,"body":"of course it will.\n\nYou might not get the best looking game with only 2gb graphics card, but you it should run most things no problem.","replies":[]},{"poster":"Talon12","date":"2016-12-25T13:58:18.318+0000","up_votes":1,"down_votes":0,"body":"http://boards.oce.leagueoflegends.com/en/c/help-support-oce/c16aMd8o-will-this-run-league?show=new\n\ndo we need 2?\n\nHelps if you have the machine, even if you don't you can compare the machine's specs against minimum and recommended \nhttp://www.systemrequirementslab.com/cyri/requirements/league-of-legends/10933\n\nI'll give you minimum anyway you needs look for recommended yourself though\n\n\nVIDEO CARD:\n> Minimum: DirectX 9.0 capable video card support Shader 2.0\n\nCPU SPEED:\n>Minimum: 2 GHz processor\n\nRAM:\n>Minimum: 1 GB RAM (Windows Vista and 7 users will want 2 GB of RAM or more)\n\nOS:\n>Minimum: Windows XP SP2, Windows Vista SP1, or Windows 7\n\nFREE DISK SPACE:\n>Minimum: 8 GB (After installing)","replies":[]},{"poster":"Nightjar","date":"2016-12-25T13:17:56.787+0000","up_votes":1,"down_votes":0,"body":"define what you mean by well? If you're in silver or below you can get away with basically any laptop or desktop with at least 1ghz cpu and 2gb of ram and a ping under 300. \n\nIf you're trying to go above that, you'll need more. But I think that laptop should be able to handle it with it's specs, at least on decent settings up until around platinum so long as you don't have too much background software running. That computer looks pretty new so I think your network card should also be sufficient to give you low enough ping.","replies":[]},{"poster":"Saiqa","date":"2016-12-25T12:47:46.032+0000","up_votes":1,"down_votes":0,"body":"I would assume so since I use a VERY similar laptop. I also think this is a better model performance wise.","replies":[]}]}