{"poster":"Foosteaksong","date":"2015-07-23T20:56:52.077+0000","title":"THE HOOD","subforum":"Champions & Gameplay","up_votes":1,"down_votes":5,"body":"Hallo zusammen,\r\n\r\nIch habe noch nie meine Meinung in solch einen Forum zum Ausdruck gebracht, geschweige denn mich aktiv an irgendwelchen Beitr&auml;gen beteiligt, aber ich muss dies einfach loswerden, ich finde dieses neue Interface einfach nur Furchtbar, es nimmt mir mein Spielerlebnis in jeglicher Hinsicht, viele sagen man gew&ouml;hnt sich daran, aber nach einigen Runden LoL merke ich das es sich einfach nicht bessert und ich bin nicht der Typ der sich direkt Quer stellt zu neuen Ideen etc ich muss zugeben ich war etwas skeptisch wo die Aktualisierung der Map anstand, nun ist es Ok und auch ein St&uuml;ck weit Fortschritt, aber dieses neue Interface nimmt ein kleines St&uuml;ck davon was LoL einmal ausgemacht hat, ich pers&ouml;nlich komm einfach nicht klar damit, und ich hoffe das wir wenigstens die Entscheidung selbst treffen k&ouml;nnen, welches Interface wir benutzen k&ouml;nnen.\r\n\r\nBest Regards\r\nFoosteaksong","replies":[{"poster":"68 73 77 65","date":"2015-07-23T21:00:44.609+0000","up_votes":1,"down_votes":0,"body":"Wird nicht kommen.\nAls die neue Map kam, hat wieder direkt jeder rumgeheult, wie hässlich das ja ist und was ist heute? Man guckt sich die alte Map an und denk sich, wie hässlich das doch ist. Lass dem HUD Zeit, dann gewöhnst du dich dran und hast auch keine Probleme mehr mit dem HUD.\nDas Einzige was mich persönlich stört, dass das Fenster, wo die Stats stehen einfach 0 dazu passt.","replies":[{"poster":"Foosteaksong","date":"2015-07-23T21:20:15.599+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Awesome Tür,realm=EUW,application-id=Wj1wcocU,discussion-id=1b8giHGQ,comment-id=0000,timestamp=2015-07-23T21:00:44.609+0000)\n>\n> Wird nicht kommen.\n> Als die neue Map kam, hat wieder direkt jeder rumgeheult, wie hässlich das ja ist und was ist heute? Man guckt sich die alte Map an und denk sich, wie hässlich das doch ist. Lass dem HUD Zeit, dann gewöhnst du dich dran und hast auch keine Probleme mehr mit dem HUD.\n> Das Einzige was mich persönlich stört, dass das Fenster, wo die Stats stehen einfach 0 dazu passt.\n\nDie Map und das Interface sind 2paar verschiedene Schuhe, es passt einfach nicht! NEVER CHANGE A RUNNING SYSTEM!","replies":[{"poster":"Dymania","date":"2015-07-23T22:00:55.355+0000","up_votes":6,"down_votes":0,"body":"> NEVER CHANGE A RUNNING SYSTEM!\n\nWir würden heute noch mit Steinen aufeinander einschlagen.","replies":[{"poster":"Zero000","date":"2015-07-23T22:06:02.301+0000","up_votes":5,"down_votes":0,"body":"Keine Sorge, das wird auch heute noch oft genug gemacht.","replies":[]}]},{"poster":"Bergelmir32","date":"2015-07-24T11:19:59.791+0000","up_votes":1,"down_votes":0,"body":"Die Alte Map hat doch auch noch funktioniert, warum soll dieses \"Argument\" also beim Hud gelten aber nicht bei der Map?\n\n\"THE HOOD\" Bitte, bitte sag mir das war beabsichtigt und du meintest nicht HUD!","replies":[]},{"poster":"68 73 77 65","date":"2015-07-24T08:56:52.435+0000","up_votes":1,"down_votes":0,"body":"Der alte S4 Jungle hat auch geklappt, sie haben ihn verändert & am Anfang hat wieder jeder rumgenörgelt.. der neue ist super, außer vielleicht Runeglaive für Champs wie Fiddle.","replies":[]}]}]},{"poster":"Abasin","date":"2015-07-24T11:10:46.819+0000","up_votes":1,"down_votes":0,"body":"Du hättest es bei \"noch nie\" belassen sollen. :)","replies":[]},{"poster":"xXNobodiXx","date":"2015-07-25T06:36:17.864+0000","up_votes":1,"down_votes":1,"body":"Was ich schwach fnde ist das sie noch nich6t auf der höhe der zeit sind. bei vielen MMOs ist es schon seit jahreb üblich das man sein hud selber einrichten kann wo welches fenster ist das würde ich mier wünschen.\nauch das sie dei  tasten für ping und all chat weggelassen haben stört mich und macht das spiel anfänger unfreundlicher","replies":[]}]}