{"poster":"maldito3000","date":"2017-12-12T16:40:28.014+0000","title":"Suspendido por \"MMR Boosting\"","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":3,"body":"Saludos soporte de LOL y lectores, quer&iacute;a poner una queja ante ustedes ya que el d&iacute;a jueves 7 del presente mes me llego un correo dici&eacute;ndome que me suspender&iacute;an la cuenta hasta el 21 de diciembre, ademas de perder todas mis recompensas obtenidas por llegar a oro, por el SUPUESTO echo de que yo entregue mi cuenta a otro jugador para que me subiera hasta la divisi&oacute;n de oro.\r\n Ahora debo mencionar mis argumentos para debatir su castigo. Primero que nada ustedes han revisado mi cuenta para llegar a esa conclusi&oacute;n, pero al parecer en ning&uacute;n momento tomaron en cuenta que hasta hace unas semanas yo hab&iacute;a estado en plata 1, y por una mala racha baje hasta plata 3, luego por una serie de trabajos en mi universidad no pude jugar constantemente LOL y me mantuve en esa divisi&oacute;n, pero llegando el final de temporada retome el jugar ranked y gracias a mi esfuerzo pude subir satisfactoriamente a oro 5, llegando a esa divisi&oacute;n decid&iacute; dejar las ranked ya que tem&iacute;a perder y bajar nuevamente, pero lamentablemente todo el esfuerzo realizado fue en vano debido al castigo que me han dado actualmente.\r\nQuiz&aacute;s tengan sus motivos para dudar, por el echo de que estuve jugando en casa mi primo y puede que hayan encontrado distintas direcciones de IP de computadores, pero si se fijan realmente la direcci&oacute;n esta muy cerca de mi casa, a solo unas cuadras.\r\n La idea de mi queja es que por favor reconsideren y analicen bien mi castigo, porque de verdad me costo bastante conseguirlo y no puede ser que me est&eacute;n castigando por algo que yo no he echo.","replies":[{"poster":"Curtedz","date":"2017-12-12T16:56:42.952+0000","up_votes":2,"down_votes":1,"body":"Creo que la progresion es muy sospechosa de tu cuenta y por eso te banearon. Dejo imagen de como se ve tu progresión de juego:\nhttps://imgur.com/a/JxQ1J\n\nSi deseas apelar sobre tu baneo, debes ir al siguiente LINK:\nhttps://support.riotgames.com/\n\n{{sticker:sg-ahri-2}}","replies":[{"poster":"Katastrofica","date":"2017-12-12T17:07:00.010+0000","up_votes":1,"down_votes":0,"body":"De que pagina sacas El Progreso? Tengo un amigo que (legítimamente) salió de bronce a platino en una season, me gustaría ver cómo progreso, solo por curiosidad (ya que solía bajar así como subía ligas)","replies":[{"poster":"Curtedz","date":"2017-12-12T19:15:43.166+0000","up_votes":2,"down_votes":0,"body":"Es la pagina que todos conocen desde hace años:\nhttp://www.lolking.net/\n\n{{sticker:sg-ahri-2}}","replies":[]},{"poster":"DoveSsy","date":"2017-12-13T20:48:46.789+0000","up_votes":1,"down_votes":0,"body":"de porsi la progresion es sopechosa y ademas como bien dices  bajaste a plata 3 y misteriosamente el poco esfuerzo que tenias que hacer de plata 1 a oro 5, lo hayas echo en las ultimas semanas de plata 3 a oro 5 es raro.","replies":[]}]},{"poster":"Hïtler","date":"2017-12-12T18:38:07.453+0000","up_votes":1,"down_votes":0,"body":"No seas vigilante, decí de dónde sacamos esas pendientes :,,v","replies":[]},{"poster":"Oblivion awaits","date":"2017-12-12T17:46:45.414+0000","up_votes":1,"down_votes":0,"body":"¿En qué pagina puedo ver mi progreso también?","replies":[]}]}]}