{"poster":"Sebliminal","date":"2016-07-28T14:40:30.017+0000","title":"Can someone please help me!!!!!!","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Since yesterday every time I connect to league after 5 min or so of doing anything I get an error message saying it cant connect tom maestro. Can someone please help. I've tried reinstalling twice ,unpinned it from task bar and used the repair tool and it doesn't work","replies":[{"poster":"Porocles","date":"2016-07-28T15:20:58.409+0000","up_votes":1,"down_votes":0,"body":"This issue can be caused by an issue with your network losing connection to our servers.  It's important that we get this resolved so you don't lose connection to chat or champion select.  I recommend going over the instructions in our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to help get this fixed up.  Let me know if you have any issues afterwards!","replies":[{"poster":"Sebliminal","date":"2016-07-28T16:34:17.903+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Porocles,realm=NA,application-id=osqw6G4M,discussion-id=5vFEG4I4,comment-id=0000,timestamp=2016-07-28T15:20:58.409+0000)\n>\n> This issue can be caused by an issue with your network losing connection to our servers.  It&#x27;s important that we get this resolved so you don&#x27;t lose connection to chat or champion select.  I recommend going over the instructions in our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to help get this fixed up.  Let me know if you have any issues afterwards!\n\nI'm still having the issue and I tried pretty much every single way to fix it offered","replies":[{"poster":"Porocles","date":"2016-07-28T16:40:46.280+0000","up_votes":1,"down_votes":0,"body":"Thanks for all the troubleshooting so far!  We'd like to assist with your specific issue further, if you'd like to[ submit a ticket](https://support.riotgames.com/hc/en-us/requests/new).  Download our [Hextech Repair Tool ](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs)to automatically gather a set of logs and attach it to your ticket.  Our tech team will respond as soon as possible and find some options for you.  Thanks for your patience!","replies":[]}]}]}]}