{"poster":"grimsom","date":"2016-05-29T01:13:51.538+0000","title":"Simple propuesta para promover la ruptura del Meta Game","subforum":"Charlas Generales","up_votes":1,"down_votes":3,"body":"Hola, tengo una peque&ntilde;a idea para convertir al LoL en un juego mucho mas variado y divertido. \r\nYo me aburri de este juego hace mas de 2 a&ntilde;os por la monoton&iacute;a que tenia siempre y me fui a jugar al DOTA2 un tiempo. Ahora hice un par de partidas en la cuenta de un amigo y sigue igual. Me encantar&iacute;a poder jugar aca. El DOTA nunca me convenci&oacute; jeje. \r\nLo que propongo es algo muy simple pero que le dar&iacute;a una diversidad much&iacute;simo mayor. \r\n\r\nSolo seria otro tipo de partidas, que en si ser&iacute;an pr&aacute;cticamente iguales a las normales, solo que habria un cambio en la gente que se mete. Estarian formadas por gente que quiere probar cosas nuevas, b&aacute;sicamente romper el meta game sin molestar a nadie. \r\n\r\nSimplemente seria hacer otra cola diferente a las partidas normales, solo con 6 cambios muy chiquitos. \r\n1- El nombre: Podria ser &quot;Libre&quot; o algo por el estilo. \r\n2- La descripci&oacute;n: Que se de a entender que estas partidas son para usar y armar el campe&oacute;n donde y como a uno se le antoje.\r\n3- La cantidad de IP: Como uno no sabe si va a funcionar o no la build, podrian dar una cantidad mayor de IP al perdedor. \r\n4- Los items recomendados: Bueno, aqui lo que se quiere es diversificar, por lo que no deber&iacute;a haber ning&uacute;n item recomendado. En esta pagina podria haber una cuadr&iacute;cula con los tipos de items (salud, armadura, da&ntilde;o, etc) que se puedan seleccionar y luego un boton que diga siguiente. Seria un filtro rapido que pase hacia la 2&deg; pesta&ntilde;a con ese/esos filtros ya puestos. \r\n5- &quot;Freeze time&quot; : Al empezar la partida podrian haber 5-20s congelados.  Donde nadie se pueda mover ni atacar (y que los m&iacute;nions y mounstros salgan 5-20s mas tarde) . Para dar mas tiempo para elegir y comprar el item deseado. \r\n6- Tiempo de selecci&oacute;n de campe&oacute;n: Deber&iacute;a ser m&aacute;s largo cosa que entre todos se pueda organizar mejor esa nueva estrategia. \r\n\r\nEso es todo, es algo muy simple pero que haria que el LoL sea un juego much&iacute;simo mas divertido y variado. \r\nEspero que les guste la idea, y bueno se aceptan sugerencias y cr&iacute;ticas. Voten jaja\r\n\r\nPD: Se que es posible en partidas personalizadas pero esto seria para animar a la gente a hacerlo y que reaparezcan campeones &quot;muertos&quot;. \r\n\r\nPD2: Para los que se preocupen por que se aumente el tiempo en las colas, piensen en lo que les molesta que alguien se ponga a armar cualquier cosa rara que no funciona, o que valla a jungla alguien con un campe&oacute;n que &quot;no se deba&quot;. Al final todos ganan...","replies":[{"poster":"waffen SS","date":"2016-05-29T02:37:53.882+0000","up_votes":1,"down_votes":0,"body":"Volve al dota","replies":[]},{"poster":"LeonxLoL","date":"2016-05-29T02:33:58.742+0000","up_votes":1,"down_votes":0,"body":"No le veo el sentido, para eso están las normales, juga con amigos o intenta convencer a tu team para que confíen en vos, no hay que tenerle miedo a los flamers y trolls que te amenazan por probar una build, mutealos o ignoralos para después reportarlos, solo intenta no jugar una {{champion:16}}  jg full tanque xD","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-05-29T01:34:50.028+0000","up_votes":1,"down_votes":0,"body":"¿Sabes que no esta permitido entrar en la cuenta de otros?","replies":[]},{"poster":"ParedSinRevoque","date":"2016-05-29T01:21:10.370+0000","up_votes":1,"down_votes":0,"body":"Para eso estan las normales, la gente se lo toma con mas calma y rompen el meta tranquilamente me ha pasado mucho de ver ese tipo de cosas y la verdad nadie decia nada ya que era una normal. Aunque no esta mal tu idea, cuantas ma variedad mejor.\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Revivax","date":"2016-05-29T01:20:35.337+0000","up_votes":1,"down_votes":0,"body":"¿Porque no lo rompes en la cola normal?","replies":[]},{"poster":"tGi","date":"2016-05-29T01:19:30.394+0000","up_votes":1,"down_votes":0,"body":"Sinceramente me parece muy mala idea, si vos haces eso con el simple hecho de que de mas PI, las partidas normales se irían para ahí.\nUna cosa muy simple de una normal, vos te podes armar como quieras el campeón que elijas.\nSobre el tiempo congelado, cuando entras a la partida tenes 15 segundos que no podes salir de base, y los creeps salen al 1:30, si no tenes 1:30 para elegir el primer buy (1 solo objeto y pociones) estas jodido.","replies":[]}]}