{"poster":"KyleCanteloupe","date":"2016-05-05T07:13:14.796+0000","title":"SERIOUS ISSUES!","subforum":"[ARCHIVED] Help & Support","embed":{"description":"Captured with Lightshot","url":"http://prntscr.com/b0gjn6","image":"http://i.imgur.com/o8syJIq.png"},"up_votes":3,"down_votes":0,"body":"I have been CONSTANTLY disonnected since the latest update. I have great internet (175MPS) and I have played league for 2 years with virtually no lag problems. Since the latest update, my game will disconnect in EVERY single mode. This resulted in a 30 min queue time because I was choosing a ban for a ranked game.... Please Riot understand that I have lost my Honor Ribbon for this.... So please try to have some sympathy for us long time players who are getting absolutely screwed by this latest update :( this is the first time i've really had issues like this :(((((({{item:3073}}","replies":[{"poster":"wchurt21","date":"2016-05-05T09:02:38.408+0000","up_votes":2,"down_votes":0,"body":"I also have lost my honor ribbon due to this. I'll be in picks and bans when all of a sudden client will freeze. So, of course, I ctrl-alt delete and try to re-enter the game. My friends are in Curse telling me they're still in que except when I log back in I've no option to re-connect to the lobby. Instead, I get an error message saying \"You group has been disbanded. An Error has occurred.\" The most ridiculous part about it is, even though there's been an error on the server side, directly after I receive a notice saying I have a 5/10/30/etc que ban. I've posted once or twice about the issue yet I've gotten no response. These glitchy problems have only been happening ever since the new client came out. Before that, never any problems.","replies":[]},{"poster":"dArtagnan","date":"2016-05-05T21:00:07.595+0000","up_votes":1,"down_votes":0,"body":"I'm very sorry to hear about the recent disconnects in the client :(  Before jumping in to what we can do about it, I do want to quickly say that disconnecting out of champion select will not cause honor ribbons to disappear or be removed.  Ribbons decay over time as the system looks at how many games played vs how many times you have been honored.  Because of this, it seems completely unrelated.\n\nTo dig a little further into the disconnections, I haven't seen any widespread reports in North America regarding increased disconnects in the client.  I am not ruling out the problem being on our end, but there are a lot of other common root causes to this issue.  To hopefully resolve this completely, make sure to complete all of the steps in our [Connection Issues Article](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#wq3).  There are a ton of steps there, but they are the most likely to get this issue resolved.\n\nIf you are still having issues despite of these steps, then make sure to [submit a ticket](https://support.riotgames.com/hc/en-us/requests/new)!  One of our Tech guru's can work with you one-on-one to get this fixed.  If you do, provide the following info as well:\n\n1) [Network Analysis](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq1)\n\n2) [Network Information Log](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq4)\n\n3) [Process List](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq3)","replies":[]},{"poster":"Leonz","date":"2016-05-05T20:03:28.074+0000","up_votes":1,"down_votes":0,"body":"Same issues man its gotta be Rito =( 30 min penalty and LP taken and i never even got to champ select","replies":[]},{"poster":"13 Til Infinity","date":"2016-05-05T08:38:48.406+0000","up_votes":1,"down_votes":0,"body":"You aren't alone with this issue. The bans are unfair. Why isn't their safeguards in system to detect disconnects from server issues. These should be in place, especially after patches.","replies":[]},{"poster":"Harrowing Gale","date":"2016-05-05T07:22:07.299+0000","up_votes":1,"down_votes":0,"body":"My last game my teammate disconnected and reconnected 3 times during the game. All during teamfights.","replies":[]}]}