{"poster":"hahahahahaha ok","date":"2017-02-12T08:48:52.626+0000","title":"Does this flex game look balanced to you?","subforum":"Gameplay","embed":{"description":"The easy way to save screenshots, GIFs, and websites. Make everyone happy by sharing smarter, faster, and with your point crystal clear.","url":"https://gyazo.com/7a5190115b7b7a16d915c25e62e61677","image":"https://i.gyazo.com/thumb/1200/_cc8d8a58a25b2df98d6c4c42dd3fd26c-png.jpg"},"up_votes":2,"down_votes":3,"body":"answer the poll, social thought experiment","replies":[{"poster":"RQ Amiable","date":"2017-02-12T09:40:28.325+0000","up_votes":1,"down_votes":1,"body":"i mean your team won so why you complainin'?{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Arcane Azmadi","date":"2017-02-12T11:12:13.534+0000","up_votes":1,"down_votes":0,"body":"My friend was like that when he still played ranked. At the end of a game he'd complain about how utterly moronic some of the players had been and I'd say \"Oh, so you lost?\" and he'd say \"No\". And I'm like \"...so what's the problem...?\"","replies":[{"poster":"WittIe Guppy","date":"2017-02-12T14:03:46.570+0000","up_votes":1,"down_votes":0,"body":"the problem is that you won by sheer luck and not skill. I'm in silver and I love playing customs against my platinum and diamond ranked friends and occasionally i do beat them simply because they made a mistake or two. you can't write off the absurdness of this matchmaking by making the dumbass, go to argument that they won. Seriously that mentality comes from the same stupid people who say,\"oh smoking hasn't hurt my body yet so i'll just keep smoking a pack a day\" \n\nthe whole point of the ranking system is to put you against people at the same skill level or slightly lower or slightly higher. not a fucking master tier against a gold, or plats against silvers. this shit defeats the whole purpose of a ranked system in the first place and makes it so your rank is more so determined by blind luck","replies":[{"poster":"RQ Amiable","date":"2017-02-12T18:22:21.012+0000","up_votes":1,"down_votes":0,"body":"i mean to be honest, if this was flex, ( which we dont know ), then... :|","replies":[{"poster":"hahahahahaha ok","date":"2017-02-13T01:33:15.890+0000","up_votes":1,"down_votes":0,"body":"it says it in the title if you can read :)","replies":[]}]},{"poster":"RQ Amiable","date":"2017-02-12T18:24:27.456+0000","up_votes":1,"down_votes":0,"body":"just looked it up. it was flex 5v5s its not like it was solo que","replies":[]}]}]}]},{"poster":"SNSD Sunnny","date":"2017-02-12T22:04:14.720+0000","up_votes":1,"down_votes":0,"body":"I get those kinds of games literally every game","replies":[]}]}