{"poster":"AIexis Texas","date":"2016-04-14T11:23:12.078+0000","title":"Azir vs Lissandra","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Who do you guys think is the stronger mid laner? please help {{champion:268}} vs {{champion:127}}","replies":[{"poster":"pur3 gh0st99","date":"2016-04-14T11:31:40.565+0000","up_votes":1,"down_votes":0,"body":"whoever plays better. a good azir would know how to q and w at the right place and when to e but a good lizandra would precast her q to re q out of his ult.","replies":[{"poster":"AIexis Texas","date":"2016-04-14T12:18:28.628+0000","up_votes":1,"down_votes":0,"body":"who you think would be the better champion casue im getting 1 of them","replies":[{"poster":"Electricshard","date":"2016-04-15T10:04:09.320+0000","up_votes":1,"down_votes":0,"body":"Azir \n\nHe is one of the strongest and most scary champs when mastered.","replies":[]}]}]},{"poster":"Knuuckles","date":"2016-04-14T15:36:21.743+0000","up_votes":1,"down_votes":0,"body":"Azir is a much harder carry but provides little crowd control and has a generous skill threshold, lissandra is fairly easy to play and quite a safe pick in lower elos","replies":[]},{"poster":"PROJECT Cosco","date":"2016-04-14T14:04:50.947+0000","up_votes":1,"down_votes":0,"body":"My opinions are:\n\n{{champion:127}} \n* a huge amount of cc which allows her to chase or escape \n* her w helps her already strong kiting potential, making it easy even for ppl that can't kite reliably\n* her e is great for mobility, mind games and damage\n* her passive is a great help\nher ult damages, heals (self-cast), slows and what not. great for last minute saves and/or peeling and cc-ing the entire enemy team, when grouped\n**PLAY HER IF:**\n* You don't mind planning and poking for a bit of time early game. She lacks the dmg early game to jump on opponents\n* You can rely on your teammates/Your team comp can benefit of someone that can engage and cc\n* You are good at warding. Despite her e (on long cooldown), Liss is quite squishy at the start and needs a few core items before she can deal with ganks and multiple opponents at the same time.\n\n{{champion:268}} \n* great burst damage and attack speed which allow for interesting itemization\n* a versatile set of combo with different effects\n* if placed at the right time, his turrets can grant you kills (and if not placed well, often grants you gold)\n* once mastered, and practiced with positioning, he's a beast\n* His ult can have devastating changes on a team fight.\n**PLAY HIM IF:**\n* You don't mind spending some (lots of ) time practicing\n* You can manage attacks and movement (an immobile azir is not a happy azir)\n* Your team can use some heavy AP busting.\n\nPersonally, my playstyle aligns better with {{champion:127}}  and I find her useful in a range of positions, able to come back from a bad start or still being significant for her team regardless of performance. Once strong, she remains strong and her tankiness is a nice +. She is indubitably better in lanes that don't risk ganks and when you have a choice to start playing her passively (top lane). Otherwise, her early low damage but high utility make her a decent support. In mid lane, she exposes her weaknesses quite a lot (less good vs ganks and vs long-distance mages).\nOn the other hand, {{champion:268}} has great zoning potential but is somewhat more squishy. His abilities and damage make him way better than Liss on mid lane and once mastered, he can do quite a bunch of cool tricks that can puzzle even good opponents. \n\nTL;DR: Different playstyles, {{champion:268}} better for mid overall. {{champion:127}} still great but exposes her natural weaknesses on a lane where ganks are more prevalent and poking is against other ranged champs.","replies":[]},{"poster":"Légs","date":"2016-04-14T12:18:41.633+0000","up_votes":1,"down_votes":0,"body":"I have never played this matchup but I would assume Azir would zone Lissandra out.","replies":[{"poster":"Légs","date":"2016-04-14T12:31:52.080+0000","up_votes":1,"down_votes":0,"body":"It appears that I have misunderstood.\n\nI personally prefer Lissandra because of her crowd control and lockdown potential. Azir appears to deal alot more burst damage though if your into blowing people up instead, but he does have a high skill cap.","replies":[{"poster":"AIexis Texas","date":"2016-04-14T12:42:25.921+0000","up_votes":1,"down_votes":0,"body":"thank you that helped me a lot deciding which one i like more <3","replies":[{"poster":"AIexis Texas","date":"2016-04-14T12:43:00.479+0000","up_votes":1,"down_votes":0,"body":"and does lissandra require a lot of skill?","replies":[{"poster":"Légs","date":"2016-04-14T13:22:23.844+0000","up_votes":1,"down_votes":0,"body":"Not really, her mechanics and laning are pretty straight foward however it should be noted that she is a short ranged mage so you have to be mindful of your positioning.\n\nalso her e can be used for mindgames\n\nEDIT: I forgot to mention Lissandra is pretty awesome at kiting.","replies":[]}]}]},{"poster":"AIexis Texas","date":"2016-04-14T12:41:38.536+0000","up_votes":1,"down_votes":0,"body":"thank you that helps me a lot deciding who is the better champ","replies":[]}]}]}]}