{"poster":"Flánn","date":"2017-01-07T07:21:29.294+0000","title":"Alguien toma en serio a las ranked flex?","subforum":"Charlas Generales","embed":{"description":null,"url":"https://pbs.twimg.com/media/C1h-C9NWEAAXwnd.jpg:large","image":null},"up_votes":4,"down_votes":0,"body":"Solo pregunto por curiosidad","replies":[{"poster":"Insane Sir","date":"2017-01-07T07:45:34.988+0000","up_votes":2,"down_votes":9,"body":"yo no me la tomo enserio e igual estoy en oro 4 ajajaj","replies":[{"poster":"Flánn","date":"2017-01-07T07:48:57.552+0000","up_votes":11,"down_votes":1,"body":"Mira mama un intento de Sonya Kyron","replies":[]}]},{"poster":"Cyclosarin","date":"2017-01-07T10:56:33.978+0000","up_votes":5,"down_votes":0,"body":"No, definitivamente me parecen una idiotez, sólo jugue las placements, quedé en Oro y listo. Sólo por el premio, no pienso volver a tocar ese modo. Espero que la quieten y vuelvan con reclutamiento normal.\n\nSaludos!","replies":[]},{"poster":"RKZ","date":"2017-01-07T11:22:55.340+0000","up_votes":4,"down_votes":0,"body":"Es muy malo todo lo que tenga que ver con esa cola, el emparejamiento, la gente, todo, no parecen partidas, parecen zombies en frente de una pc jaja.","replies":[{"poster":"Flánn","date":"2017-01-07T12:17:56.917+0000","up_votes":2,"down_votes":1,"body":"Bueno supongo que las ranked flex seran un triste consuelo a mi amado reclutamiento normal gracias por tu respuesta","replies":[]}]},{"poster":"Runth","date":"2017-01-07T07:24:29.609+0000","up_votes":4,"down_votes":0,"body":"Welcome to en LAS Server, te comes la primera sangre y todos comen insultos","replies":[]},{"poster":"Thails SirYordle","date":"2017-01-07T18:30:45.716+0000","up_votes":2,"down_votes":0,"body":"Yo creo que ambas colas, solo/duo y flex hay que tomarlas con importancia, hay gente que le gusta rankear con 2 amigos o más y porque tendrian que perder una flex por alguien random que entro y se la toma como una normal?","replies":[]},{"poster":"kioShiMa","date":"2017-01-07T12:13:46.968+0000","up_votes":2,"down_votes":0,"body":"Es gracioso porque todas las criticas que dijeron en los comentarios para las flex son para el juego, no se dan cuenta que una cola no cambia nada, el juego es igual en todas las colas.","replies":[{"poster":"Flánn","date":"2017-01-07T12:29:59.925+0000","up_votes":1,"down_votes":0,"body":"Es mas gracioso aun que estes diciendo que reclutamiento normal es exactamente igual que blind pick","replies":[{"poster":"kioShiMa","date":"2017-01-07T14:18:38.371+0000","up_votes":2,"down_votes":1,"body":"un par de bans no cambia a la comunidad amigo, tenes flamers trolls afks etc en reclutamiento normal como en blind pick(yo desde que empese a jugar juego reclutamiento normal,no soy uno de esos que simpre jugaron blind pick y la defienden a muerte)","replies":[{"poster":"Flánn","date":"2017-01-08T04:01:52.246+0000","up_votes":1,"down_votes":0,"body":"No cambia a la comunidad pero si cambia la experiencia de juego","replies":[]}]}]}]},{"poster":"Hwaxinghz","date":"2017-01-07T14:15:38.052+0000","up_votes":3,"down_votes":1,"body":"Hoy en día jugar rankeds de cualquier tipo es SUERTE. Si te salen 20 partidas seguidas con equipos que no sean tóxicos, que no se rindan, No digo que no fedeén PERO que entiendan que si van MAL tienen que jugar pasivos, ser amigables con los aliados y demás, ESO es por SUERTE.\n\nEL pan de cada día en las rankeds (sobre todo en las flex), si mueres una vez ya resucitarán a tu tátara Abuela perdida de la cantidad de puteadas que te dicen los mismos aliados, haciendo que los Mutees o te desconcentras.\n\nSimplemente lo que te recomiendo es armarte de paciencia y jugar, porque está feo el \"clima\" en las rankeds. Sos first blood ya cagaste (Nadie te ayudará en el resto de la partida), te tiran la primera torre y \"OPEN MID\", te roban un dragón \"GG no sirve el jungla\" y lo putean como si hubieran robado un banco. Y un largo ETC.\n\n¿Quieres mejorar tu juego? Lamentablemente en esta temporada 2017 NO HAY FORMA de mejorar el juego individual porque, al quitar la cola Reclutamiento Normal, TODOS LOS JUGADORES que la jugaban (y realmente eran muchos) van a trolear, jugar sin ganas, perder el tiempo, rendirse y transmitir TOXICIDAD en las Rankeds (\"Flexibles\" y SoloQ por igual, no les importa nada) a modo de protesta.\n\nSi hubiera hecho stream de todas mis rankeds este año, hubieran visto realmente la cantidad extrema de toxicidad que hay, encima se hacen las víctimas y luego vienen a quejarse \"me banearon injustamente\" y demás.","replies":[{"poster":"Flánn","date":"2017-01-08T04:06:32.599+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=ZMrnn1kxW-A","replies":[]}]},{"poster":"LGBT Valentina","date":"2017-01-07T17:21:54.155+0000","up_votes":2,"down_votes":1,"body":"Los premades+3 unicamente \nDps los solo y duo, nop. Son para joder xd","replies":[]},{"poster":"Zinc","date":"2017-01-08T06:40:04.578+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EL parkito,realm=LAS,application-id=v7qsfXsE,discussion-id=nXeFLsAG,comment-id=,timestamp=2017-01-07T07:21:29.294+0000)\n>\n> Solo pregunto por curiosidad\n\nTodos los del equipo contrario jajaajajjaja","replies":[]},{"poster":"Orion Xe Aquarii","date":"2017-01-07T18:03:35.928+0000","up_votes":1,"down_votes":0,"body":"Personalmente, Prefiero y me tomo muchisimo mas en serio la FlexQ que la Solo/Duo, La razon es por que encuentro personas con mas nivel que yo, lo cual me motiva mucho mas y por encima, no tengo el ELO Tan destruído como en SoloQ","replies":[]},{"poster":"Uli con azúcar","date":"2017-01-07T07:52:11.713+0000","up_votes":1,"down_votes":0,"body":"Yo jugué como 20 y en todas me trollearon jaja. Bajé como 3 devisiones seguidas creo. \nPuedo decir esto ya que en soloq no me pasa e.e","replies":[{"poster":"QuatiLover","date":"2017-01-07T16:30:59.396+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Uliiss,realm=LAS,application-id=v7qsfXsE,discussion-id=nXeFLsAG,comment-id=0003,timestamp=2017-01-07T07:52:11.713+0000)\n>\n> Yo jugué como 20 y en todas me trollearon jaja. Bajé como 3 devisiones seguidas creo. \n> Puedo decir esto ya que en soloq no me pasa e.e\n\nque suerte tenes, ami en flex equipos decentes y en soloq no saben que los golpeo xD","replies":[{"poster":"LGBT Valentina","date":"2017-01-07T17:30:41.851+0000","up_votes":1,"down_votes":0,"body":"Amen sea tu comentario\nQue dios y jebus, te escuchen por que me pasa la misma mierda xd","replies":[]}]}]},{"poster":"RaResz","date":"2017-01-07T14:51:51.548+0000","up_votes":1,"down_votes":0,"body":"Yo obvio que si.\nAl final de la temporada van a dar una recompensa extra si alcanzaste Oro en las dos colas.\n\nDesde ya que no las jugué más. Solo las primeras 10 y listo.\nHay que centrarse en las SoloQ.","replies":[]},{"poster":"cojien dote","date":"2017-01-07T14:43:20.423+0000","up_votes":1,"down_votes":0,"body":"Juegue una partida que una kata murió 2 veces en mid por una akaly, dijo \"fue\" y se \"fue\" afk.","replies":[]},{"poster":"Lacra Maxima","date":"2017-01-07T13:52:08.646+0000","up_votes":1,"down_votes":0,"body":"son de niña","replies":[]},{"poster":"Sir Crucifix ","date":"2017-01-07T07:40:33.693+0000","up_votes":1,"down_votes":5,"body":"hay  gente que se toma en serio las rankeds ? .. una pregunta mejor ya que te tocan 4 randoms y a rezar a los dioses que sean buenos","replies":[{"poster":"RKZ","date":"2017-01-07T11:23:24.565+0000","up_votes":1,"down_votes":0,"body":"Y entre solo q y flex, siempre va a ser mas serio solo q.","replies":[]}]}]}