{"poster":"Flánn","date":"2017-02-12T16:54:12.107+0000","title":"Hola soy una persona sin creatividad asi que dale un nombre a este pobre infeliz","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"No le consulte a nadie un nombre cuando cree mi cuenta y &quot;Elparkito&quot; fue el resultado\r\nla idea original fue poner &quot;elpakito&quot; haciendo referencia al paco peeeeeeeeeeero por escribir rapido salio esta basura de nick\r\nasi que estoy pensando en juntar PI para cambiarme el nombre \r\n\r\nPD:Si es algo ofensivo no se tomara en cuenta pero si es algo como &quot;VI sexual&quot; con gusto lo pondre en mi lista\r\ny en esta lista estan:Zyra&acute;s vs Sion&acute;s\r\ny solo ese nada mas xD (y eso que me lo llevo pensando todo el dia :C)\r\npor si nadie entendio el nombre es una referencia a &quot;Plants vs zombies&quot;","replies":[{"poster":"xXTheSlayerXx","date":"2017-02-12T21:57:30.974+0000","up_votes":2,"down_votes":0,"body":"Kog Chow (mezcla de dog chow y kog mow","replies":[{"poster":"Raamt","date":"2017-02-12T22:17:49.581+0000","up_votes":2,"down_votes":1,"body":"malisimo","replies":[{"poster":"xXTheSlayerXx","date":"2017-02-13T01:05:57.419+0000","up_votes":3,"down_votes":0,"body":"https://fthmb.tqn.com/43hpN6s3_pspYHubqjVkKWhE_lw=/768x0/filters:no_upscale()/about/haters-56a6a44c5f9b58b7d0e41acd.jpg","replies":[]}]}]},{"poster":"Tré Cool","date":"2017-02-12T19:25:56.600+0000","up_votes":3,"down_votes":0,"body":"Lee Sin Vi Sion, Mirtha Leblanc...","replies":[]},{"poster":"PaquiaRiat","date":"2017-02-12T17:07:11.221+0000","up_votes":1,"down_votes":0,"body":"Janna Morgana, Lux iernaga, No Leona :v, Namikusei, Shen long, Zac ate el Shaco, no se me ocurre nada mas :v","replies":[{"poster":"Zhaher","date":"2017-02-12T17:43:20.633+0000","up_votes":3,"down_votes":0,"body":"Roba2","replies":[]}]},{"poster":"zelaya19","date":"2017-02-12T23:12:37.237+0000","up_votes":2,"down_votes":0,"body":"i Zac Newton\n\nMoized (moises)\n\nJax Nicholson","replies":[]},{"poster":"ReyTimati","date":"2017-02-12T20:06:11.247+0000","up_votes":2,"down_votes":0,"body":"Algunos nombres sacado de la demonología\n\nBAEL\nEn mitología, Bael es el primer rey del infierno.\n\nAgares en demonología es un gran duque del infierno que comanda treinta y una legiones de demonios. Perteneciente a la orden de las Virtudes, puede hacer que los fugitivos regresen, causar terremotos y enseñar lenguas, encontrando placer en dar a conocer expresiones inmorales. Es descrito como un hombre viejo que monta a un cocodrilo y en su puño lleva un halcón.\n\nVassago es, en demonología, una de las entidades que se invocan en rituales de alta magia, generalmente para descubrir los secretos de las mujeres.\nSu identidad es dual, y algunas autoridades lo describen como un ángel caído que se especializa en revelar el futuro y en encontrar cosas perdidas.\n\nGAMYGYN\n En demonología, Samigina o Gamigin es un gran Marqués de la primera orden del infierno. Aparece en la forma de un pequeño caballo o asno y luego en forma humana cuando se lo ordena quien lo invoca. Habla con voz ronca. Gobierna sobre 30 legiones infernales. Enseña todas las ciencias liberales y da cuenta de las almas que murieron en pecado.\n\n MARBAS\nMarbas es, según la demonología, un demonio presidente que aparece como un majestuoso león y con forma humana en presencia de quienes lo invocan.\nDe acuerdo a la descripción de Ars Goetia, Marbas imparte habilidades mecánicas, responde con verdad preguntas secretas, causa y cura enfermedades, y puede transformar a los hombres en varias formas.\n\nVALFOR\nValefor es un demonio que en la demonología, según el Ars Goetia, es descrito como un Duque del Infierno.\n\nSYTRY\nEn demonología, Sitri es un Gran Príncipe del Infierno y reina sobre sesenta legiones de demonios. Causa que los hombres amen a las mujeres y viceversa, y hace que ellos se muestren desnudos si se desea. También revela secretos de las mujeres, burlándose de ellas.\nEs representado con la cara de un leopardo y las alas de un grifo, pero bajo petición del mago se transforma en un hombre muy apuesto.\n\nBELETH\nBeleth es un demonio, rey del Orden de los Poderes, cabalga un caballo pálido, cuyos relinchos suenan como trompetas. \n\nELIGOR\nEligos (también llamado Abigor o Eligor), en demonología, es un gran duque del infierno, que comanda sesenta legiones de demonios. Descubre lo oculto y conoce el futuro, sabe de guerras y de soldados.\n\nANDROMALIUS\n\nAndromalius en demonología es un gran conde del infierno que tiene treinta y seis legiones de demonios a su servicio.Puede devolver tanto al ladrón como los bienes robados, castiga a los ladrones y otras personas malvadas y descubre tesoros ocultos.","replies":[]},{"poster":"Mazer Rakham","date":"2017-02-12T17:17:23.045+0000","up_votes":3,"down_votes":1,"body":"Pobre infeliz!!!\n\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Flánn","date":"2017-02-12T17:23:15.967+0000","up_votes":1,"down_votes":0,"body":"WOOOOW PERO QUE BUENA IDEA NO ES COMO SI YA EXISTIESE ESE NICK :0","replies":[{"poster":"Mazer Rakham","date":"2017-02-12T17:57:49.414+0000","up_votes":1,"down_votes":0,"body":"jajaja realmente soy muy malo con los nombres xD\ngeneralmente es un personaje que me gusta y un numero","replies":[]}]}]},{"poster":"Un Sin Corazón","date":"2017-02-12T18:19:09.090+0000","up_votes":1,"down_votes":0,"body":"Vi sexual ya esta ocupado ese volumendo ya hizo un post parecido.","replies":[{"poster":"Flánn","date":"2017-02-13T09:03:40.858+0000","up_votes":1,"down_votes":0,"body":"Ya lo se te creias que pondria un ejemplo que se me hubiece ocurrido a mi? xD","replies":[]}]},{"poster":"Fetgod","date":"2017-02-12T22:00:51.142+0000","up_votes":1,"down_votes":0,"body":"Bob Marley","replies":[]},{"poster":"YütaKulia","date":"2017-02-12T20:23:53.647+0000","up_votes":1,"down_votes":0,"body":"Teemonio666 :v","replies":[]},{"poster":"WhiteMax","date":"2017-02-12T17:16:24.787+0000","up_votes":2,"down_votes":2,"body":"Olaf ke Ashe.","replies":[{"poster":"Diosa Rhuri","date":"2017-02-12T19:00:07.380+0000","up_votes":1,"down_votes":5,"body":"Olaf Kled Ashe, ya, reportenme {{champion:55}}","replies":[]}]}]}