{"poster":"xSIL3NT HUNT3R x","date":"2018-03-09T18:31:35.973+0000","title":"Warum bekomme ich kein S","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":0,"body":"Hallo support und alle andern user ich f&uuml;hle mich verarscht\r\n\r\n30/5/9 249 farm  ein A xayah\r\n11/0/1  100 farm ein a - xayah \r\n11/1/15 123 farm  ein a- jhin \r\n12/1/6 113 farm ein b-  jhin wtf \r\n15/1/10 154 farm xayah ein b+\r\n Und noch tausende weitere vorf&auml;lle wie diesen mit diversen champs beispiel: zoe katarina talon jhin xayah  jinx \r\nBitte &auml;ndert etwas an diesem system","replies":[{"poster":"El Pingu","date":"2018-03-09T18:47:09.145+0000","up_votes":4,"down_votes":1,"body":"Das kann dir wohl niemand erklären, aber es wird wohl einen Sinn haben.\n\nIch hatte letztens ein s mit Mundo bekommen 8/6/6 und das Spiel verloren.\nAnfangs kam mir das auch komisch vor.\n\nNachdem ich mir das genauer angesehen habe, habe ich gemerkt, das ich fast 5 Mal soviel Tower DMG wie der 2t beste und mehr Minions als jeder andere hatte.\nAuch bei der Sichtwertung war ich weit vorne. (Von beiden Teams betrachtet)\n\n\nDas Spiel geht nicht nur auf deine Stats ein, sondern scheint dein Spiel genau zu analysieren. Und da scheints dir irgendwo zu mangeln","replies":[{"poster":"Arsael","date":"2018-03-09T20:07:25.922+0000","up_votes":1,"down_votes":0,"body":"Nice^^ ich habe gemerkt dass die control wards deine Sichtwertung enorm pushen, \nsowie deine cc Wertung auch eine erhebliche Rolle spielt.","replies":[]}]},{"poster":"Amycos Cyrus","date":"2018-03-09T21:37:51.295+0000","up_votes":1,"down_votes":0,"body":"Also als erstes zu deinem Zusatz (Xayah Game mit dem Amumu S-) Der Amumu war Jungle, ist kein ADC, sondern Tank und erfüllt somit ganz andere Bedingungen bzw. an seine Wertung werden andere Bedingungen gestellt, jedoch kann man ihn recht gut nutzen, um darzustellen, was das Problem ist.)\n\nDie Bewertung beruht auf dem Durchschnitt aller Spieler auf der selben Lane mit dem selben Champion im selben Zeitraum (~ 2 Wochen)\n\nWir rechnen mal etwas XD : (Die einzelne Zeile ist immer der Amumu)\n___\n\n- KDA: (Additiv: 3K - 2D + A; Multiplikativ: (K + A) / D )\n - 30/5/9 => Additiv: 89 Multiplikativ: 7,8\n - 11/0/1 => Additiv: 34 Multiplikativ: X (Perfekt)\n - 11/1/15 => Additiv: 46 Multiplikativ: 26\n - 12/1/6 => Additiv: 40 Multiplikativ: 18\n - 15/1/10 => Additiv: 53 Multiplikativ: 25\n - 12/1/4 => Additiv: 38 Multiplikativ: 16\n\n - 6/3/8 => Additiv: 20 Multiplikativ: 4,67\n\nAlles recht gut. Spricht noch nichts gegen ein S (Amumu ist hier sogar der schlechteste, jedoch sind die Anforderungen für Tanks häufig geringer.)\n___\n\n- CS/Min:\n - 249 in 45:17 => 5,5\n - 100 in 20:22 => 4,9\n - 097 in 23:32 => 4,1\n - 113 in 36:09 => 3,1\n - 154 in 35:00 => 4,4\n - 129 in 27:19 => 5,7\n\n - 188 in 27:19 => 6,9\n\nAlles recht schlecht vor allem das Jhin (b-) Game sticht hervor. (Amumu hat hier mit weitem Abstand das Beste und liegt mit 6,9 trotzdem noch unter der Linie von 7, die man sich schon setzen sollte. (Für ADC und Mid ist übrigens eine 10 bis 11 möglich))\n\n___\n\nWeiterhin muss man noch die Sichtwertung betrachten.\n\n\n- VS/Min\n - 37 => ~0,82\n - 7 => ~0,34\n - 5 => ~0,21\n - 15 => ~0,41\n - 8 => ~0,22\n - 11 => ~0,4\n\n - 27 => ~0,99\n\nAuch hier ist alles recht schlecht. Amumu erreicht fast 1, was man schon als Mindestwert betrachten sollte. (4 ist durchaus für Amumu als Jungler möglich. 2 für dich als ADC)\n\n___\n\nAlso alles in allem. War alleine von den Basiswerten schon kein S dabei. Wenn man jetzt noch rauskriegen könnte, wie der jeweilige Wert für Xayah und Jhin im expliziten auszusehen hat, könnte man auch sagen, wie viel dir wirklich gefehlt hat. (Wie schon gesagt, es orientiert sich an gleichen Champions auf gleicher Lane und nicht am allgemeinen Schnitt)","replies":[]},{"poster":"9638156","date":"2018-03-09T21:21:56.420+0000","up_votes":1,"down_votes":0,"body":"Ich kann auch 100 cs in 50 minuten haben. Schreib Zeiten dazu bitte...","replies":[]},{"poster":"Arsael","date":"2018-03-09T20:01:13.013+0000","up_votes":1,"down_votes":0,"body":"Es zählt halt einfach alles... wirklich alles...\nMit Xayah finde ich´s auch echt heavy, aber es kommt halt auf die Messlatte an.. \nund gerade bei einem Spiel wie League sollte Sie auch nicht zu niedrig liegen!! \nEs gibt einfach echt krasse Spieler, die unglaublich viel trainieren und bei denen es auf so gut wie jeden Mausklick ankommt, und wahrscheinlich ernten die auch nicht nur S+\n{{sticker:poppy-wink}} \n\nHast du nur als ADC Probleme mit dem S oder allgemein?\nIch spiel echt nicht super aber mit allen anderen Rollen finde ich es deutlich leichter mal ein S oder S+ zu bekommen!\nAber ich glaube halt dass die Anforderungen an einen ADC einfach sehr hoch sind.\n\nGutes gelingen und einfach versuchen besser zu werden^^\nMfG A","replies":[]},{"poster":"xSIL3NT HUNT3R x","date":"2018-03-09T19:56:33.194+0000","up_votes":1,"down_votes":0,"body":"Und wieder ein 12/1/4 129 farm  b+ \nAmmumu 6/3/8 188 farm s-  \n\nPs danke für die antworten","replies":[]},{"poster":"PTP Polaris","date":"2018-03-09T19:40:51.090+0000","up_votes":1,"down_votes":0,"body":"Hey xSIL3NT HUNT3R x,\nIn den Spielen hattest du vielleicht gute Stats, jedoch ist dein Farm für die Zeit sehr miserabel, deshalb hattest du bei dem Jhin game auch ein B-\nMfG Xecrone","replies":[]},{"poster":"Herr Hübsch","date":"2018-03-09T19:37:08.668+0000","up_votes":1,"down_votes":0,"body":"wards, farm, dmg to objctives, dmg allgemein, heilung, binds/cs and more, gold, used amount of gold <- Das da","replies":[]}]}