{"poster":"Keisan","date":"2017-01-19T00:55:37.304+0000","title":"Player Reformation Program","subforum":"Player Behaviour","up_votes":2,"down_votes":3,"body":"Hello,\r\n\r\nThis is a program aimed at proving a player has reformed and through this program, the player may gain access to their previously banned account.\r\n\r\nStep 1 of the program:\r\nThe player will have their account ban reduced from permanently to a few months, whether that be 3 or 6 is up to Riot.\r\n\r\nStep 2:\r\nThe player will enter a 1 year probation period. Meaning, that if the player breaks the Summoners Code by any means, ALL future accounts will be suspended.\r\n\r\nStep 3:\r\nIf the player passes the suspension period, he/she can have their account back without being continuously monitored and have the threat of losing all their accounts.\r\n\r\n\r\n*PPDDR: Protect, Punish, Denunciate, Deter, Rehabilitate.\r\nRiot Games Current PPDDR Satisfaction:\r\nBanning players protect &#039;good&#039; players from the &#039;bad&#039;. It does punish the bad players. It does denunciate the actions. However, whether or not it deters the action is up to their statistics. The flaw I see is that banning a player and never allowing them to regain their account doesn&#039;t allow that player to rehabilitate, which is the final rule of a perfect punishment.\r\n\r\nFurthermore, the main issue is that If someone EG. Tyler1, gets permabanned, he just starts a new account and continues the behavior and act like the newest account is his only account and he can act as though he&#039;s never been banned. This system will prevent that, because if Tyler1 takes the reformation program and fails he will never be able to open League of Legends again. However, if he passes the program, he went 12 months without being toxic and may continue to not be toxic past the probation period.\r\n\r\nHopefully, this program gets implemented and we can start seeing some reformed players back on the Rift.\r\n\r\nComment your thoughts.\r\n\r\nThank You.","replies":[{"poster":"Roguestoney","date":"2017-01-19T01:37:50.693+0000","up_votes":2,"down_votes":0,"body":"\"The flaw I see is that banning a player and never allowing them to regain their account doesn't allow that player to rehabilitate, which is the final rule of a perfect punishment.\"\n\nMore often than not players recieve minor bans before a perminate ban. That would be their chance to reform.\n\nThis may be an idea for those whos bans are escalated straight to perminate; but not those who have gone through every level of punishment / warning. \n\nIMO","replies":[{"poster":"Skins Project","date":"2017-01-19T01:51:01.826+0000","up_votes":1,"down_votes":0,"body":"?\nYes and no\nWhat I got from the OP's thread is this is what occurs INSTEAD of a perm ban. IE \nif you've already gotten to that level then this situation occurs.","replies":[{"poster":"Project Xayah","date":"2017-01-19T01:58:09.310+0000","up_votes":2,"down_votes":1,"body":"If you break the rules often and consistently enough to receive a perma-ban, you've already shown you're not going to reform. That's not going to change just because there's an extra tier of punishments before the perma-ban kicks in. It's also not going to change the fact that these players will come onto the boards to b!tch that they've been banned and \"had no chance to reform\" despite going through the standard tiers of punishment.\n\nBasically, this just means it takes longer for the toxic players of the community to actually see any \"significant\" punishment.","replies":[{"poster":"Skins Project","date":"2017-01-19T08:19:10.388+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HeartVine,realm=OCE,application-id=T8eq2lFQ,discussion-id=lWQBHmt8,comment-id=000000010000,timestamp=2017-01-19T01:58:09.310+0000)\n>\n> If you break the rules often and consistently enough to receive a perma-ban, you&#x27;ve already shown you&#x27;re not going to reform. That&#x27;s not going to change just because there&#x27;s an extra tier of punishments before the perma-ban kicks in. It&#x27;s also not going to change the fact that these players will come onto the boards to b!tch that they&#x27;ve been banned and &quot;had no chance to reform&quot; despite going through the standard tiers of punishment.\n> \n> Basically, this just means it takes longer for the toxic players of the community to actually see any &quot;significant&quot; punishment.\n\nHmm I suppose.\nIdk","replies":[]}]}]},{"poster":"CHEESYLEEKS","date":"2017-01-19T01:45:10.399+0000","up_votes":1,"down_votes":0,"body":"a chat restriction and a two week ban should give people the hint, but....... for some it doesn't","replies":[]}]}]}