{"poster":"TuPapiSempaii","date":"2017-03-01T22:50:49.147+0000","title":"Ayudenme, urgentemente, ban permanente sin ningun motivo (error de riot? se confundieron de usuario)","subforum":"Problemas Técnicos","up_votes":3,"down_votes":1,"body":"hoy intente entrar  ami cuenta y me dice que fue suspendida permanentemente pero nunca hice nada quiero una explicacion por favor estoy seguro se confundieorn de usuario nunca trollee ni nada por el estilo, ademas no lo pueden hacer permanentemente ya que yo inverti mi dinero en este juego\r\nDENME UNA EXPLICACION POR FAVOR","replies":[{"poster":"Escrache","date":"2017-03-01T22:58:25.301+0000","up_votes":1,"down_votes":0,"body":"Revisa tu mail, cuando te banean te envian un informe..\n\nPD: Haber invertido dinero en el juego, no te salva de un ban permanente.. las sanciones aplican para todos por igual.","replies":[{"poster":"TuPapiSempaii","date":"2017-03-01T23:08:45.708+0000","up_votes":1,"down_votes":0,"body":"eso es lo que me extraña y me lleva a creer que ay un error por no ay ningun mail","replies":[{"poster":"The Inkanus","date":"2017-03-01T23:30:27.438+0000","up_votes":1,"down_votes":0,"body":"La cuenta siempre fue tuya? Nunca la compartiste?\nNunca instalaste algún programa que hacía algo relacionado con el LoL?\nHas cargado RP con tarjeta de crédito?\n\nEscribiste a soporte?, es la vía más sencilla de obtener respuestas oficiales, aquí los usuarios solo podemos especular.\n\nSuerte.","replies":[{"poster":"TuPapiSempaii","date":"2017-03-01T23:34:14.279+0000","up_votes":1,"down_votes":0,"body":"siempre fue mia nunca la comparti y si cargue rp con tarjeta de credito","replies":[{"poster":"TuPapiSempaii","date":"2017-03-01T23:35:15.145+0000","up_votes":1,"down_votes":0,"body":"y tambien ya le escribi al soporte pero estoy deseperado por una respuesta por eso tambien lo pregunto aca","replies":[{"poster":"The Inkanus","date":"2017-03-02T00:09:17.696+0000","up_votes":1,"down_votes":0,"body":"Entonces queda esperar respuesta de ellos, porque suena a que habrá sido por utilizar algún software externo, soporte te va a decir bien el motivo.\n\nSuerte.","replies":[{"poster":"TuPapiSempaii","date":"2017-03-02T01:31:08.916+0000","up_votes":1,"down_votes":0,"body":"pero nunca use programas de segunda por que conocía las consecuencias","replies":[]}]}]},{"poster":"Americans","date":"2017-03-01T23:35:32.418+0000","up_votes":1,"down_votes":0,"body":"se efectuo el pago? te banean permanente cuando hay rp no pago.","replies":[]}]}]},{"poster":"Escrache","date":"2017-03-01T23:12:33.046+0000","up_votes":1,"down_votes":0,"body":"Envia 1 ticket a soporte para hacer la consulta.. es mas rapido que esperar respuesta en el foro.\nRevisa a que mail tenes asociada la cuenta, mucha gente pone un mail random por que no le dan importancia..","replies":[]}]}]},{"poster":"holaperrin","date":"2017-03-01T23:25:12.438+0000","up_votes":1,"down_votes":0,"body":"Muy pocas veces hay bans permanentes erroneos, seguro que nunca has tenido un ban de chat o un ban por 1 semana?","replies":[{"poster":"TuPapiSempaii","date":"2017-03-01T23:28:19.550+0000","up_votes":1,"down_votes":0,"body":"segurisimo nunca eh tenido ningun problema, lo que me extraña es que lo agan sin aviso alguno","replies":[{"poster":"Mazer Rakham","date":"2017-03-02T01:29:57.652+0000","up_votes":1,"down_votes":0,"body":"Prestaste la cuenta? Eso es motivo de ban sin aviso previo","replies":[]}]},{"poster":"TuPapiSempaii","date":"2017-03-01T23:27:43.507+0000","up_votes":1,"down_votes":0,"body":"segurisimo nunca eh tenido ningun problema","replies":[{"poster":"holaperrin","date":"2017-03-01T23:30:32.454+0000","up_votes":1,"down_votes":0,"body":"Y no te dice nada el ban? revisa tu mail...","replies":[]}]}]},{"poster":"LolFriends","date":"2017-03-01T22:52:26.235+0000","up_votes":1,"down_votes":0,"body":"Es imposible que lo hayan hecho sin motivo ...","replies":[{"poster":"TuPapiSempaii","date":"2017-03-01T22:56:56.852+0000","up_votes":1,"down_votes":0,"body":"Pero no tienen motivo nunca hice nada","replies":[{"poster":"Americans","date":"2017-03-01T22:59:30.692+0000","up_votes":1,"down_votes":0,"body":"la mayoria de los crimenes los cometen gente que nunca hizo nada.","replies":[{"poster":"TuPapiSempaii","date":"2017-03-01T23:05:42.835+0000","up_votes":1,"down_votes":0,"body":"osea como?","replies":[{"poster":"Americans","date":"2017-03-01T23:35:06.384+0000","up_votes":1,"down_votes":0,"body":"La idea esta en que la mayoria miente sobre que \"No hizo nada\" cuando bien sabe porque lo castigaron. De todas formas lo mas probable, por lo que pusiste arriba, es por el pago de rp con tarjeta de credito. Cuando no pagan te desactivan la cuenta permanentemente hasta que se efectue el pago.\n\nSi de verdad nunca hiciste nada malo, la razon del ban es esa.","replies":[{"poster":"TuPapiSempaii","date":"2017-03-02T00:50:23.027+0000","up_votes":1,"down_votes":0,"body":"los pagos siempre fueron efectuados","replies":[]}]}]}]}]},{"poster":"Annie Botz","date":"2017-03-01T23:03:48.088+0000","up_votes":1,"down_votes":0,"body":"No es imposible, en los términos de uso dice que te pueden banear \n\nCito:\n\"E. Suspensión/Cancelación.\n(1) Por parte de Riot Games. HASTA DONDE LO PERMITA LA LEY APLICABLE, RIOT GAMES SE RESERVA EL DERECHO A SUSPENDER, CANCELAR, MODIFICAR O ELIMINAR SU CUENTA EN CUALQUIER MOMENTO Y POR CUALQUIER RAZÓN, O SIN QUE MEDIE MOTIVO ALGUNO; ENTREGÁNDOTE AVISO PREVIO O SIN ÉL; Y SIN RESPONSABILIDAD ALGUNA PARA RIOT GAMES . Además, Riot Games podrá dejar de ofrecer el Juego y/o la asistencia al mismo en cualquier momento\"\n\nIgual debería mandar un ticket para más detalles, es algo muy raro que pase un baneo sin sanciones previas y sin motivos.","replies":[{"poster":"TuPapiSempaii","date":"2017-03-01T23:07:01.763+0000","up_votes":1,"down_votes":0,"body":"Pero eso no seria totalmente injusto que te baneen por diversion? sin motivo alguno?\nen otras palabras se quedaron con mi dinero para despues banearme sin ningun motivo? eso no seria estafa?","replies":[{"poster":"Annie Botz","date":"2017-03-01T23:12:00.329+0000","up_votes":1,"down_votes":0,"body":"Tú aceptas los términos y es tu decisión poner dinero, como te digo es algo muy muy raro que pase (pero según los términos puede pasar), manda un ticket al soporte, la otra vez hubo un fallo y el sistema baneó gente por un error, pudo volver a pasar...\n\nYo no soy quién para decirte que pasó en tu cuenta solo era aclarar que puede suceder.","replies":[{"poster":"TuPapiSempaii","date":"2017-03-01T23:21:01.744+0000","up_votes":1,"down_votes":0,"body":"este comentario me da esperanzas de que sea un simple error x cierto fue lo primero que hice le mande un emal","replies":[]}]}]}]}]},{"poster":"LichaLopez9","date":"2017-03-01T23:14:00.051+0000","up_votes":1,"down_votes":0,"body":"Envia un ticket a soporte, te contestan en menos de 42 hs. Segun lo que se cada cuenta le pertenece a Riot, lo que hace la empresa es prestartela simplemente, por eso tienen el poder de cancelartela sin ningun motivo, aunque nunca hagan eso.","replies":[]},{"poster":"Lautinvocador","date":"2017-03-01T22:55:49.406+0000","up_votes":1,"down_votes":0,"body":"Soy premade y les puedo confirmar todo, No trolea nunca, siempre jugamos de a 5 asi que NO troleamos. Nunca recibio un Baneo por 1 dia o algo asi, Ni siquiera tuvo avisos de reportes o avisos de algo en especifico. No sabemos que hacer, y queremos rankear :/","replies":[]}]}