{"poster":"Thats My Brand","date":"2013-09-23T15:41:58.962+0000","title":"Abandoned Items - Analysis and Discussion","subforum":"[ARCHIVED] Miscellaneous","up_votes":6,"down_votes":1,"body":"Some items just seem to be forgotten. **@Xypherous - Could we get an answer to which of those items are you satisfied with and which ones could see some changes going into season 4?** There is a difference between situatinal items that are rarely used but fullfill their role (such as Wit's End) and lackluster items that are inherently broken. This thread is dedicated to discussing problems with underused items and finding a possible solution.\n\nLet us start general discussion, then, regarding why certain items are underused and, if it's possible and needed, if there is some way to fix them. Of course I've included my own drafts for us to start with. Since putting those together would exceed the character limit, I've put all my analysis in replies.\n\nItems we discuss here (all around 1% pick rate with some serious build issues) are:\n\nSupport items - **Banner of Command, Shard of True Ice, Mana Manipulator and Eleisa's Miracle**\n\nAD items - **Executioner's Calling, Atma's Impaler, Runaan's Hurricane, Guinsoo's Rageblade **\n\nOther utility items - **Ohmwrecker, Zeke's Herald, Will of the Ancients**","replies":[{"poster":"Thats My Brand","date":"2013-09-23T15:49:12.713+0000","up_votes":3,"down_votes":0,"body":"**AD items**\n\nAttack Damage-oriented items are the opposite of support ones: AD champions seek for slot efficiency and want big items. Some items, however, don't fit that description. Let's focus on Executioner's Calling and similar ones.\n\nhttp://i.imgur.com/8hbJbkas.jpg\n\n**Executioner's Calling**\n\n*Purpose:* Heal reduction\n\n*Problem:* ADC items need to be more slot-efficient and lategame-oriented, and crit chance is an ADC stat. Current EC is built on pretty much noone.\n\n*What this item needs to be:* Either a mid-tier fast item building into something bigger or a better lategame scaling one.\n\n*Who should build it:* Top laners facing immense sustain or bruisers wanting to shut down carries.\n\n*My suggestion:* Make it an Advanced tier item building into a Legendary one when combined with Avarice Blade and/or Vampiric Scepter. This leaves more time to stack Avarice, gives the upgraded EC a better \n\nlategame prevalence and allows to build EC right when it's needed. This concept of EC needs to be not cost efficient in bare stats and the Grievous Wound application to occur under lower % of health to avoid \n\nabusing it in ranged AD lanes (or make it melee only?).\n\n*Example build:* **Brawler's Gloves + Longsword**, granting about 15 AD and 10% crit for ~1100 g. Needs a new item to build into - generally an AD+crit one. Avarice + EC + Pickaxe seems like the way to go here, but another concept would be tweaking Spellbreaker (Hexdrinker + EC).\n\nhttp://i.imgur.com/rbD4sCQs.jpg\n\n**Atma's Impaler**\n\n*Purpose:* Tanky DPS; metagolem\n\n*Problem:* We've got better bruiser items (BC, Hydra, Gauntlet, Sunfire) and this one was always painful to fit into the build - it grants two stats nowhere to find in any other item that very few champions can utilize while granting third stat basing off fourth stat.\n\n*What this item needs to be:* \"I'm tanky. Now I want to deal damage\"\n\n*Who should build it:* AD Bruisers\n\n*My suggestion:* Replace Avarice Blade with pretty much anything else. Bruisers do not scale with crit chance.\n\n*Example builds:* **Chain Vest + Kindlegem** or if we're scared of Renekton **Chain Vest + Catalyst the Protector**\n\nhttp://i.imgur.com/MB1X4fgs.jpg\n\n**Runaan's Hurricane**\n\n*Purpose:* AoE ranged ADC damage\n\n*Problem:* ADC as a role is about maximizing single-target DPS, which makes the item underwhelming in most situations. Arguably the least problematic of the bunch.\n\n*What this item needs to be:* AoE when needed, not a lackluster when no AoE possible.\n\n*Who should build it:* Anyone but Teemo\n\n*My suggestion:* Merge it with another underused item, Sword of the Divine. This way Hurricane will gain two purposes: you either focus on one target or deal damage to multiple ones. New core item on Twitch.\n\n*Example build:* Same, just with 10% less AS and SotD active. Passive is lost (along with AS) while active is on cooldown.\n\nhttp://i.imgur.com/oJQqJ4gs.jpg\n\n**Guinsoo's Rageblade**\n\n*Purpose:* \"Hi, I'm Jax, and I'm so fed that I've decided about to embarass you with this thing. Imagine if I had a real item\"\n\n*Problem:* Extremely niche and impossible to balance because of two champions who can abuse it\n\n*What this item needs to be:* Hybrid item that would be attractive to not only Kayle and Jax, but also some other champions\n\n*Who should build it:* Any champion that can be played AD and AP - Ezreal, Twisted Fate, Varus, Kennen\n\n*My suggestion:* Remove AS and stacking component. Add crit chance related mechanics to prevent Jax and Kayle from abusing it. Make it an item that enables hybrid builds on more champions. Hybrid penetration or weird scaling, perhaps? (possible weird scalings: crit chance applies to spell damage, if spell crits it deals true damage?)\n\n*Example passive:* Critical strikes reduce your target's magic resistance by 20% for 2 seconds. Magic damage reduces your target's armor by 20% for 2 seconds.","replies":[{"poster":"bahamutkaiser","date":"2013-09-23T21:56:15.463+0000","up_votes":1,"down_votes":0,"body":"I totally agree about Atma's, it lacks potency with a gimmick concealing that it doesn't offer enough damage, while having weak armor and crit which doesn't optomized well rounded builds and melee fighter behavior.\n\nI wrote an extensive piece on how critical can be altered to benefit melee more than ranged carry in GD (unholy mountain). But a simplified solution would be to replace avarice blade with Brutalizer for real damage, and supplemental Armor Pen + CD.","replies":[{"poster":"Thats My Brand","date":"2013-09-23T22:22:27.644+0000","up_votes":1,"down_votes":0,"body":"You could've linked said piece. Anyway, Brutalizer build would make Atma become a new Black Cleaver from the time of its infamous reign.\n\nAll you need is to drop crit. Atma is for bruisers and bruisers focus more on AD scaling abilities than autoattacks and while a gp10 investment is a good thing for a lategame item, those champions make no use of crit chance.\n\nKindlegem build would be perfect for bruisers such as Renekton, Nasus, Shyvana, Jarvan etc. since they all have important abilities that go well with CDR.","replies":[{"poster":"Sulfuric","date":"2013-09-24T03:07:28.836+0000","up_votes":1,"down_votes":0,"body":"I agree with dropping crit from Atma's. Bruisers usually don't need crit and having that stat instead of something else makes the current Atma's a very awkward item.","replies":[]}]}]}]},{"poster":"Thats My Brand","date":"2013-09-23T15:46:04.371+0000","up_votes":1,"down_votes":0,"body":"**Support items**\n\nSupports need cheap, team-efficient items. Some of those don't fully satisfy support players and generally need some bigger tweaks.\n\nhttp://i.imgur.com/RJCMSyks.jpg\n\n**Banner of Command**\n\n*Purpose:* Splitpushing, pushing, siegeing\n\n*Problem:* Promote strats used to utilize this summoner spell in every phase of the game, while Banner is not an item to be rushed. Emblem of Valor is the main component of Aegis, which is just better in \n\nevery aspect - regarding its minion buff, also in the pushing department. Moreover, Fiendish Codex is not an item that any support would go for before Kage's.\n\n*What this item needs to be:* Splitpush threat; minion boost (now that Aegis lost it); team aura.\n\n*Who should build it:* Supports, pet-users\n\n*My suggestion:* A cheap ~1500 g item building out of Emblem of Valor and Mana Manipulator, making it the true \"banner of command\". Move the minion boost that used to be on Aegis here. It will be a good item \n\nto be rushed, but flat regen aura will fall off later.\n\n*Example build:* **Emblem of Valor + Mana Manipulator + 550 g**\n\nhttp://i.imgur.com/9AjsZlms.jpg\n\n**Shard of True Ice**\n\n*Purpose:* \"I missclicked and bought Mana Manipulator\"\n\n*Problem:* Awkward set of stats that don't play well with each other; requires high coordination to utilize properly\n\n*What this item needs to be:* CC on demand\n\n*Who should build it:* Mages or supports\n\n*My suggestion:* Throw away Mana Manipulator from the build path of Shard and replace it with Blasting Wand (mage-oriented) or Kindlegem (support-oriented).\n\n*Example build:* **Kage's Lucky Pick + Kindlegem** or Kage's Lucky Pick + Blasting Wand\n\nhttp://i.imgur.com/2dIrEVys.jpg\n\n**Mana Manipulator**\n\n*Problem:* Doesn't build into anything interesting\n\n*What this item needs to be:* Better support item\n\n*Who should build it:* Supports\n\n*My suggestion:* Make it build into Banner of Command (see above) and Arcane Helix (see below).\n\n> http://i.imgur.com/8W6bIPBs.jpg\n\n> **Arcane Helix**\n\n> Recipe: Kage's Lucky Pick + Mana Manipulator + Hextech Revolver\n\n> 80 AP\n\n> Unique Aura - Spell Vamp: Abilities restore health equal to 20% of damage dealt (one-third effect on DoT and AoE)\n\n> Unique Aura - Mana Leech: Abilities restore mana equal to 10% of damage dealt (one-third effect on DoT and AoE)\n\nhttp://i.imgur.com/uCZ3tV4s.jpg\n\n**Eleisa's Miracle**\n\n*Purpose:* \"I'm a support and I want to improve my gimmicky summoner spells\"\n\n*Problem:* Absolutely ridiculous item path (dilemma between keeping Philo and upgrading it). Supports are the last team member to look for slot efficiency.\n\n*Who should build it:* Supports.\n\n*My suggestion:* Make Eleisa a permanent GP10 item building out of Philo.\n\n*Example build:* Same. Keeps the g-10 passive from Philom but doesn't disappear after 3 levels.","replies":[{"poster":"DarkeChampion","date":"2013-09-24T01:42:34.235+0000","up_votes":2,"down_votes":0,"body":"Good idea on Eleisa's, but one thing.  Let it disappear after 3 levels, because when it does the boosts become permanent stats.  This way later on you don't feel obliged to purchase Shurelya's revelry on a team with more than 300 base movement speed.  In order to balance this out with permanent gp10, have it build from Mana Manipulator, reduce the selfish mana regen, and give it the mana regen aura.  After this, add somewhere between 100-200 gold to final price.  That way it becomes an item used if your lane is getting pressured by DRAAAVEN or Caitlyn or someone without removing/delaying your late game setup.  It also helps if your ADC is getting a little overzealous with their pokes and runs out of mana in 3 minutes. (I run into this problem a lot more than I need to, even in Ranked)","replies":[]}]},{"poster":"Pryotra","date":"2013-09-23T21:21:25.631+0000","up_votes":2,"down_votes":1,"body":"So, it looks like Shard is up there without reason. I have used it on Leona quite a bit, it is better than people give it credit for. Although I will admit, it is niche.\n\nAlso, banner is primarily bought by Heimerdinger, though that might change after his rework.\n\nAs for the rest, most are underutilized due to either being overnerfed, or being support items in a meta that has supports preferring multiple stacks of wards over items. I think some of this might even out after support/jungle money problems are dealt with.","replies":[{"poster":"Thats My Brand","date":"2013-09-23T22:41:16.642+0000","up_votes":1,"down_votes":0,"body":"http://www.lolking.net/items/3092#statistics\n\nShard has below 1% pick rate. The problems with the item is that everything but the active falls off on supports (welp, gp10 is decent). The mana regen aura is negligible even in the laning phase, and as the game goes on it becomes irrelevant.\n\nHeimerdinger. Yeah.","replies":[{"poster":"Pryotra","date":"2013-09-24T01:06:45.416+0000","up_votes":1,"down_votes":0,"body":"It also has a solid winrate of >60%. So I don't think that power is the problem. I don't really see anything falling off but the mana regen, which can still help depending on team comp. Considering how little you spend on that, I wouldn't say that the item itself is neccessarily to blame. Perhaps the meta, where supports focus on wards primarily, is to blame?","replies":[]}]},{"poster":"bahamutkaiser","date":"2013-09-23T21:45:11.792+0000","up_votes":1,"down_votes":0,"body":"I agree that shard is quite good and needs little more than a minor boost if anything. It would be nice if banner had a more distinct impact on minion waves though for more supports and for pet users.","replies":[]}]},{"poster":"Lord Graves III","date":"2013-09-26T02:32:36.350+0000","up_votes":1,"down_votes":0,"body":"Saying bruisers don't scale with crit is just untrue. If you like to autoattack you scale with crit. Its a cold hard truth of autoattackers. The crit from triforce isn't wasted on anyone. People with AD scaling don't think its good, but its just fine. Autoattacks scale with crit. If you are an autoattacker you like crit.\n\nI like a lot of your ideas but Executioners and Atmas are underrated. Atmas just needs an armor buff, and maybe its passive buffed slightly. You mentioned renek, his W crits you know. It hurts when it does. If you like autoattacks you like crit. :P","replies":[]},{"poster":"Desiderium","date":"2013-09-24T18:42:18.933+0000","up_votes":1,"down_votes":0,"body":"How dare you insult Shard of True Damage?\n\nhttp://i.imgur.com/uTuGvG7.png","replies":[]},{"poster":"Frayace","date":"2013-09-24T01:24:15.099+0000","up_votes":1,"down_votes":0,"body":"when i saw this thread, i thought it meant Madred's, HoG, Ionic Spark, ETC. :P","replies":[{"poster":"IS1762f773d4918ba8eb372","date":"2013-09-24T11:10:44.712+0000","up_votes":1,"down_votes":0,"body":"Same here xD\n\nThe items discussed are not \"abandoned\", they are more niche due to current meta.","replies":[]}]},{"poster":"CarbonWyre","date":"2013-09-24T08:59:02.165+0000","up_votes":1,"down_votes":0,"body":"**Support Items**\n\nSupport items are strong for 5 reasons\n\n* Gold Efficient/Generation\n* Team Aura's/Actives\n* Scalable early to late game\n* Build out of closely related and useful items\n* Must cover a broad area of requirement\n\nTo be efficient and able for a support to use an item must be not only viable but also effective throughout the game. Right now the major items such as Aegis of the Legion, Shurelya's Reverie, Ruby Sight Stone, and a couple others, provide stats that are useful early game and are items that scale into deep late game.\n\nFor example, Ruby Sight Stone provides wards, wards are an integral part of the game. Shurelya's provides early game health, builds out of an item that is not only gold efficient for purchasing but also generate gold. This allows it to scale as deep into late game as the support needs and can be upgraded to something that will also be extremely useful late game. Both of these items cover broad requirements (wards and speed boosts can be used offensively and defensively).\n\nNow that I have given an example of what is required for a support item to be useful let's talk about the items in question.\n\n**Banner of Command**\n\n Purpose: Pushing\n\nProblems:\n\n* Not gold efficient\n* Stats are less should be compared to other items\n* Builds out of Emblem of Valor\n* Not achievable early game\n\nTo expand on those, the item is mainly main for pushing, this is a problem simply because by the time a support can collect the gold needed for it it is at least mid game. Rushing the item isn't an option when Aegis is cheaper, more effective, and uses the same items. This item does not build out of a gold generating item and the items it does build out of have stats that a support can get elsewhere for cheaper and in more effective ways.\n\nSolution: Change the items used to build to something gold generating or more effective.","replies":[]},{"poster":"Thats My Brand","date":"2013-09-23T15:52:13.700+0000","up_votes":1,"down_votes":0,"body":"**Other utility items**\n\nSome items sit below 1% pick rate because they're just plain broken. Yeah, I'm talking about Ohmwrecker here, but WotA and Zeke's seem really underwhelming as well.\n\nhttp://i.imgur.com/E2rS7SWs.jpg\n\n**Ohmwrecker**\n\n*Purpose:* Wildcard in difficult sieges (when your team can't tank the turret - for example with Tryndamere top and Nocturne jungle)\n\n*Problem with first version (Catalyst + Chain Vest):* Tanks could spend money on better items like Warmogs or Sunfire to dive turrets with no problem\n\n*Problem with current version:* Supports have way better items to go for and they can't afford that much pure AP; mages won't find it slot-efficient and they don't build Philo\n\n*What this item needs to be:* Something that can be built on demand when your team isnt tanky enough to dive turet, without long preparations\n\n*Who should build this item:* Mages\n\n*My suggestion:* Make it build out of commonly found mid-game mage items like Blasting Wand, Seeker's Armguard or Chalice of Harmony. Don't require people to plan on buying this item long before they realize if they need it or not.\n\n*Example builds:* **Seeker's Armguard + Chalice of Harmony**, Blasting Wand + Kindlegem, Blasting Wand + Fiendish Codex\n\nhttp://i.imgur.com/QHYYNcRs.jpg\n\n**Will of the Ancients**\n\n*Purpose:* AP, Spellvamp\n\n*Problem:* No reason to build it over Spectral Wraith. AP aura is negligible most of the time; those who need to rush spellvamp go for Revolver first and don't really get much gold from Kage's (hence \n\npopularity of Spectral Wraith), while it's still a bad idea for supports.\n\n*What this item needs to be:* Something generally more attractive\n\n*Who should build it:* Mages under heavy harass; bruiser mages\n\n*My suggestion:* Ditch the aura and Kage's build (moving it to Arcane Helix); make it selfish spellvamp and buff the item.\n\n*Example build:* Hextech Revolver + Fiendish Codex (with around 90 AP and 15% CDR)\n\nhttp://i.imgur.com/x9q4gZGs.jpg\n\n**Zeke's Herald**\n\n*Purpose:* AD boost aura\n\n*Problem:* This item was much better lategame when it granted Attack Speed. Flat Attack Damage falls off and supports have way better options to go for, especially since they cannot utilize AD or LS \n\nthemselves.\n\n*What this item needs to be:* Team boost for AD champions that makes sense for its wielder\n\n*Who should build it:* AD champions who want to boost their carry, so that would be bruisers/AD casters, mostly junglers\n\n*My suggestion:* Give it some better lategame prevalence. Right now bruisers can amplify ADC's power by going for Black Cleaver. This item should grant something more, then: I suggest a unique utility boost that would be the Rage aura.\n\n*Example build:* **Vampiric Scepter + Phage** (aura: 10% lifesteal, 10 AD, Rage).","replies":[{"poster":"Sulfuric","date":"2013-09-24T03:13:12.729+0000","up_votes":1,"down_votes":0,"body":"I think that WotA is a fine item, and lategame should be a replacement for Spectral Wraith. I'm curious as to what would happen if the Aura was changed slightly, though. What do you think would happen if it only gave 30AP to the user and 50 AP in the aura? Too OP?\n\nAlready it's very close to Spectral Wraith minus the CDR and jungle passive. Otherwise, it gives 40 more AP and 30 of that to your allies.","replies":[]}]},{"poster":"Seminole Sun","date":"2013-09-24T01:50:59.764+0000","up_votes":1,"down_votes":0,"body":"Will of the Ancients appears to be forgotten but really shouldn't be. I suspect that a tiny buff (even 5AP for just the user) would remind people how good it can be in the double and triple AP comps.\n\nZeke's Herald is likewise a strong choice in very specific circumstances and probably just needs a very minor tweak to it.\n\nRunaan's Hurricane dances on a knife's edge where if they buff it any more it would be dangerously OP (even 10AD on it would make it a huge item)","replies":[]},{"poster":"KingOfTheAnimes","date":"2013-09-23T20:35:47.787+0000","up_votes":1,"down_votes":1,"body":"Another one for the pile: Sword of the Divine. AD carries are never going to build an attack speed item with no crit that competes for a slot with phantom dancer or shiv, ad assassins and bruisers are never going to build a pure attack speed item period, and on-hit builds (scarce as they are) don't care about the ability to get critical hits. On top of all that, you lose the attack speed when the active is down.\n\nIn theory, I think this is MEANT to be a PD/Shiv replacer on ad carries that forgoes the consistent damage of other options for guaranteed burst. Or maybe it's supposed to be a sixth item troll build on glass cannon Rengar.\n\nYou mentioned possibly merging it with runaan's hurricane, but I disagree if only because Hurricane seems aimed so strongly at on-hit builds that don't care about critical hits. I would suggest just straight-up buffing this item or giving it AD instead of AS, but I'm already having visions of Talon and friends deleting target champion from the game. Frankly, I think this item just needs to go back to the drawing board and figure out exactly what it's trying to accomplish.","replies":[{"poster":"Thats My Brand","date":"2013-09-23T22:17:17.692+0000","up_votes":1,"down_votes":0,"body":"SotD in its current state needs to go away. If you want to troll on Rengar there are stacking items, like Sword of the Occult or Bonetooth Necklace.\n\nAnd about champions not building crit - keep in mind SotD active grants 100% crit chance on those 3 hits, so you don't really need to build crit. Yes, I purposefully meant it to not be so good on Teemo (who can still use the basic version), but ADCs like Varus or Kog'Maw tend to build IE anyway. Any other on-hit ranged champions that I missed?","replies":[{"poster":"Tortferngatr","date":"2013-09-24T01:17:47.191+0000","up_votes":1,"down_votes":0,"body":"Why does SotD need to go away?\n\nHurricane might be a more interesting item if it was, say, 1800 gold, gave 60% AS, and the passive prioritized champions. It could then build into a late-game attack speed item with longer-range-from-original-target bolts, and perhaps some sort of active that fired 5 bolts at and around a target.\n\nIt might be interesting if Blade of the Ruined King became melee-only but Hurricane (or hurricane upgrade) bolts dealt 2.5% max health physical damage to targets they hit.","replies":[]}]}]},{"poster":"bahamutkaiser","date":"2013-09-23T20:39:38.297+0000","up_votes":1,"down_votes":0,"body":"Character limit? WTH, that's gonna be problematic for guides and complex posts...\n\nAnyway, i feel you on Zeke and Atma's. But phones gonna die so I cant discuss it...","replies":[]}]}