{"poster":"Facux Oropel","date":"2017-09-20T06:26:55.936+0000","title":"Queridos flamers..","subforum":"Charlas Generales","up_votes":3,"down_votes":2,"body":"Cuando van a entender que tiltearse los hace jugar peor? todos los que flamean se tiltean y juegan horriblee y terminan trolleando encima o se van AFK, el juego es para divertirse y ganar jugando en EQUIPO y con colaboraci&oacute;n, insultar a alguien no lo va a hacer jugar mejor,  y encima los pueden banear y despu&eacute;s se van a venir a quejar al foro.. As&iacute; que jueguen callados y en equipo y van a ganar mas y divertirse mas.","replies":[{"poster":"Yo sin Ella","date":"2017-09-20T17:42:34.804+0000","up_votes":2,"down_votes":0,"body":"Luego de mucho flamear,creo que alcancé la maestría en el flameo.Flameo,sin tiltearme","replies":[]},{"poster":"NickBruzz","date":"2017-09-20T06:32:18.161+0000","up_votes":1,"down_votes":0,"body":"Eso es un pensamiento muy utópico para la distopía actual que es este server, toxicidad 100% garantizada, que ojo no digo que estes mal solo que es imposible no para la mayoría no tiltearse con cierto tipo de players","replies":[{"poster":"Facux Oropel","date":"2017-09-20T06:36:58.435+0000","up_votes":2,"down_votes":0,"body":"Es que la gente no sabe que todos tenemos malas partidas, nadie va a carrear siempre,  puedo salir 24/1/14 y la siguiente partida 1/9/3","replies":[{"poster":"NickBruzz","date":"2017-09-20T06:39:18.635+0000","up_votes":1,"down_votes":0,"body":"Por supuesto, hay que saber perder y aceptar cuando alguien sale mal, pero el caso es cuando sale mal a propósito, en fin, a no tiltearse y a implementar el nuevo sistema de mutes","replies":[]}]}]},{"poster":"Okama16","date":"2017-09-20T07:23:34.185+0000","up_votes":1,"down_votes":0,"body":"Y si incitas a que flammeen?. La gente que provoca tienen parte de la culpa también, no es que los flammers flammean por que les gusta flammear, esta gente provocadora pone izi, dicen cosas acerca de algún pariente tuyo con tal de lograr que te tiltees (esto pasa muy a menudo) , no estoy defendiendo a esta gente \"flammer\" ni mucho menos, solo digo que estos no tienen toda la culpa (a menos que te tiltees de la nada). También hay casos en los que te insultan por andar mal de score o de farm. \n Y bueno en fin, hay millones de motivos por el cual uno puede ser flammer.","replies":[{"poster":"rokushoger","date":"2017-09-20T11:51:35.805+0000","up_votes":1,"down_votes":0,"body":"> También hay casos en los que te insultan por andar mal de score o de farm.\n\nEsto no es excusa bajo ningún concepto.\n\nEntiendo que puedan tiltearse si los provocan (en el entendido que realmente haya una provocación y no se la estén imaginando) y aún así está bien cuando los castigan, pero lo de arriba es inadmisible y la culpa es solo y únicamente del flamer.","replies":[]}]},{"poster":"DezFuzerDka","date":"2017-09-20T06:47:04.145+0000","up_votes":1,"down_votes":0,"body":"Men, lo muteas y apoyas a tu equipo con buenas palabras y ojala con una carreada de tu parte y listo, y si es una normal déjate llevar y sigue les el juego si para eso están las normales para divertirse un poco ( no me refiero a que le respondas con la misma moneda si no que le des la razón y mutearlo :b), no hay nada que hacer contra ello , ademas de que **RIOT NO HACE NADA** para evitarlo y siguen con su **MEDIOCRE** sistema de reportes que sirve de algo, pero no lo suficiente, se limpian las manos con una I.A (inteligencia artificial) porque **NO QUIEREN** poner mas dinero en empleados que vean los reportes de los jugadores que en verdad quieren ayudar a la comunidad. Es **TÍPICO** dentro de un **NEGOCIO **tener falencias en su servicio (_movido por la avaricia_), que en este caso es un videojuego.\n{{summoner:13}}","replies":[{"poster":"Okama16","date":"2017-09-20T07:25:04.080+0000","up_votes":1,"down_votes":0,"body":"Mucha razón bruh. La sabiduría es poder.\n{{summoner:13}}","replies":[]}]},{"poster":"Tihy","date":"2017-11-07T10:00:58.449+0000","up_votes":1,"down_votes":1,"body":"Y te restringieron el chat\nhttps://imgur.com/a/4gsqL","replies":[]}]}