{"poster":"AndyClarky","date":"2016-11-11T21:41:37.714+0000","title":"Dodge queue timers. FIX PLEASE","subforum":"Client Discussion","up_votes":1,"down_votes":0,"body":"This is stupid. Due to your client not working, I have to wait 15mins to queue up for a game. Fix your problems!!!\r\n\r\nI queue up for a game, then I go to my internet and do my own thing. I have one monitor so I can&#039;t see the client in the background. 3 times it did not pop up as &quot;accept the game&quot; so it gave me a queue timer telling me I was dodging too many times!! What the hell is this. Fix your client!! I don&#039;t want to be waiting 15mins for a queue every game for your bug problems. Fix this and I expect some RP as compensation for me waiting so damn long for queues where your client was the problem!!!","replies":[{"poster":"mosguinz","date":"2016-11-12T00:24:35.587+0000","up_votes":1,"down_votes":0,"body":"Keep in mind that this updated client is still in its beta stage.\n\nFrom [DevBlog](http://oce.leagueoflegends.com/en/client-update/article/3a587e99-6c9b-437a-a03b-7a7ac2be4bf8):\n> Before you grab the download, you should understand that this is a **beta**, which means we're still working out a few kinks. The updated client is still missing a few features (like spectator mode) that we'll be adding over the next few patches. It also doesn't yet have some of the flashy animations that we've been working on. We'll take a few patches to turn things on and make optimisations, so if you decide to upgrade now we'll need you to be patient with us while we work everything out.\n\nYou can switch back to the Legacy client using the button on the updated client login screen.\n\nhttps://support.riotgames.com/hc/en-us/article_attachments/215576628/Launch-Legacy-Client.jpg\n\n{{champion:17}} ","replies":[{"poster":"AndyClarky","date":"2016-11-12T00:41:08.589+0000","up_votes":1,"down_votes":0,"body":"I didnt upgrade, it did it automatically. I'm still wondering when you will fix other bugs from back in season 3 that are still around?","replies":[{"poster":"mosguinz","date":"2016-11-12T07:45:45.473+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AndyClarky,realm=OCE,application-id=PpTM71nT,discussion-id=3mENzWRM,comment-id=00010000,timestamp=2016-11-12T00:41:08.589+0000)\n>\n> I didnt upgrade, it did it automatically. I&#x27;m still wondering when you will fix other bugs from back in season 3 that are still around?\n\nYou can still launch the Legacy client using the button on the updated client login screen.\n\nhttps://support.riotgames.com/hc/en-us/article_attachments/215576628/Launch-Legacy-Client.jpg\n\nIf you have any bug that you want to report, please post them in the [Report a Bug (NA)](http://boards.na.leagueoflegends.com/en/c/bug-report) forum, or if you have any questions, you can submit a ticket to Riot Games Support [here](https://support.riotgames.com/hc/en-us/requests/new).\n\n{{champion:17}}","replies":[]}]}]},{"poster":"AndyClarky","date":"2016-11-11T22:47:49.407+0000","up_votes":1,"down_votes":0,"body":"WOOOOW another problem!! YOU CAN'T CHOOSE A CHAMP WITHIN 3 SEC LEFT!!!! what the hell Riot. That is still 3 seconds on the timer!! So I am allowed to pick one up intil 0 seconds. Fix your crap","replies":[]}]}