{"poster":"Twin Fang","date":"2018-12-10T08:47:28.782+0000","title":"NEW FUNDED TEAM: All positions considered, Only Gold + Considered","subforum":"Team Recruitment","up_votes":1,"down_votes":0,"body":"Brand new funded team looking for skilled players to form the founding team. Any rank gold and above will be considered providing you have the right attitude and willingness to learn.  This is an expression of interest only and will be contacted for further discussion **ONLY IF** you meet our requirements.\n\n** ALL APPLICANTS MUST BE AT LEAST 18 YEARS OF AGE**\n\n**Post below: **\nYour current rank:\nPreferred Position:\nNZ or AUS: \nAny Team Experience:\nAny Competition Experience:\nWhy do you want to pursue advanced level gaming:\nA bit about you:","replies":[{"poster":"lachlanbdd","date":"2018-12-10T09:35:13.980+0000","up_votes":2,"down_votes":1,"body":"current rank: plat 3\n\nPreferred Position: adc\n\nNZ or AUS: AUS\n\nAny Team Experience: none\n \nAny Competition Experience: none \n\nWhy do you want to pursue advanced level gaming: Because I've always wanted to play league of legends competitively and proving that I am the best . I also want to improve at the game and one way I can do that is by versing highly skilled players where you find in a highly competitive environment.\n\nA bit about you: Im 19 years old played games all my life from Halo to call of duty. when i heard  about e-sports I was instantly interested when I saw a game of LCS i feel in love with it. I always try my best especially in a team because i don't want to let my team mates down. I watch twitch follow LCK the most out of the all the regions. Got a  licence. The thing i like to do the most is play league of legends. If i got a opportunity to prove myself I would be very thankful","replies":[]},{"poster":"Sultan","date":"2018-12-26T07:18:13.927+0000","up_votes":1,"down_votes":0,"body":"Your current rank: Diamond 4\nPreferred Position: ADC ( can play all champs )\nNZ or AUS: AUS\nAny Team Experience: I have previously been in challenger teams back in the old system of teams\nAny Competition Experience:\nWhy do you want to pursue advanced level gaming: I am a competitive player, always has interested me to play at a high level and maybe one day i might be up there vs faker ;)\nA bit about you: 22 years old, i take e sports very serious always had a passion for it hoping i would be the one playing instead of watching, if given the opportunity i will do my best.\nIGN: Sultan","replies":[]},{"poster":"Birde","date":"2018-12-22T11:57:01.620+0000","up_votes":1,"down_votes":0,"body":"Your current rank: Plat 1\n\nPreferred Position: Support\n\nNZ or AUS: NZ\n\nAny Team Experience: no\n\nAny Competition Experience: no\n\nWhy do you want to pursue advanced level gaming: Its a dream to play league competitively and I want to begin to get experience early. My dream is to go to worlds and I think this is the way to start off.\n\nA bit about you: I'm 16 years old and I've played league since season 2 so I can practice a lot after school and on weekends. I've got a 55% win rate and im climbing pretty fast. I think i could be a really good support player in the future","replies":[]},{"poster":"tralop","date":"2018-12-12T05:24:01.644+0000","up_votes":1,"down_votes":0,"body":"Your current rank: Gold 4\n\nPreferred Position: Support\n\nNZ or AUS: Aus\n\nAny Team Experience: Played on a few ranked teams and flex teams, nothing too serious\n\nAny Competition Experience: None\n\nWhy do you want to pursue advanced level gaming: I want to get better at League of Legends and I enjoy being part of a team in a serious but constructive environment.\n\nA bit about you: Living in Sydney and I just finished high school so I have quite a bit of spare time on my hands. I am all about learning and growing as a player. I don't flame or judge, everyone has off days/ off games. Cheers!","replies":[]},{"poster":"Izou","date":"2018-12-12T02:37:14.972+0000","up_votes":1,"down_votes":0,"body":"Your current rank: g4\nPreferred Position: Mid\nNZ or AUS: NZ\nAny Team Experience: Previous manager of OPL team Team Regicide, also participated in scrims with the OCS team\nAny Competition Experience: Played many tournaments but I have managed OPL scrims and been at riot HQ for games.\nWhy do you want to pursue advanced level gaming: There was nothing like the thrill of being at that top level, i seen my players have it and I want to again experience that thrill of competitive gaming\nA bit about you: 21 year old thats been playing since late season 2. Hadn't played much all season but came back right at the end and have been enjoying the game quite a lot with friends. currently home all the time due to ACL reconstruction surgery so im free all the time","replies":[]},{"poster":"Warrikon","date":"2018-12-11T15:09:54.707+0000","up_votes":1,"down_votes":0,"body":"Your current rank: Gold 2. I took a break this year so I've demoted a lot, but my highest has been diamond 4 (on two different accounts)\n\nPreferred Position: generally anything that leads to a hyper carry late game (eg. mid, top, adc)\n\nNZ or AUS: Aus\n\nAny Team Experience: Been in a fair few teams and used to play in teams back in NA. I can't remember their names though... been a few years.\n\nAny Competition Experience: Played in a uni based competition oceania wide, coming second out of all the uni's. We were all diamond level +\n\nWhy do you want to pursue advanced level gaming: Always have done competitive gaming but I have never done it from a team perspective at the start. As in, building the foundations of the team dynamics, then working upwards. I've always joined up with teams and tried to fit the pieces of the jigsaw together as we went. Most of the time that went well! But it didn't create the best environments to be in. I think positivity + generally not giving up are most important than winning lane, etc. But they're not the only things, and as I said I was diamond and played in a high level team so its all gud.\n\nA bit about you: I love playing unconventional things and proving to people that they are valid, not just in league. I've always mained things which were at the time considered horrible, eg. mained ziggs when he was horrible, azir when he was bad, darius when he was considered underpowered and many other trolly types of things (such as skarner top, vi mid) always with pretty good win rates (65%+) when I put my head to it. So, yes, I've recently completed uni and want to get back into it :)","replies":[]}]}