{"poster":"Supportsmanlike","date":"2016-12-17T06:26:42.623+0000","title":"Beschwörernamen von permanent gebannten Accounts","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"Halli Hallo,\r\n\r\nals ich gerade auf der Suche f&uuml;r einen neuen Namen f&uuml;r einen Thresh Main war, ist mir aufgefallen, dass viele gute Namen Leuten geh&ouml;ren, die gebannt sind.\r\n\r\nJetzt w&uuml;rde mich mal interessieren, ob f&uuml;r diese Accounts immer noch die selbe Regelung zutrifft, wie f&uuml;r jeden anderen, sprich 2 Jahre und 6 Monate Immunit&auml;t. Und wenn ja, was haltet ihr davon?\r\n\r\nIch wei&szlig;, dass es nicht unbedingt klug ist, sich wie jemand zu nennen, der eben erst permanent gebannt wurde, aber es w&auml;re doch auch Schade, wenn diese Namen dann f&uuml;r zweieinhalb Jahre da verrotten.","replies":[{"poster":"Humpelstilzche","date":"2016-12-17T06:41:09.154+0000","up_votes":3,"down_votes":0,"body":"Ich denke diese Namen werden genauso behandelt wie alle anderen. \n\nDer Hintergrund warum die Namen nicht sofort wieder frei werden, ist, dass das den permagebannten Spielern erlauben würde, einfach einen neuen Account mit dem selben Namen zu machen. Der Verlust der \"Identität\" ist ein wesentlicher Bestandteil von Permabans, der bei einigen Spieler durchaus den Ausschlag dafür gibt, das Spiel wirklich hinter sich zu lassen, was ja das Ziel eines Permabans ist. \nDaher bleiben die Namen leider ganz normal vergeben.","replies":[{"poster":"Supportsmanlike","date":"2016-12-17T08:57:08.719+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=YnZkMR0R,discussion-id=NUYHA6q2,comment-id=0000,timestamp=2016-12-17T06:41:09.154+0000)\n> \n> Der Hintergrund warum die Namen nicht sofort wieder frei werden, ist, dass das den permagebannten Spielern erlauben würde, einfach einen neuen Account mit dem selben Namen zu machen.\n\n\nDaran habe ich überhaupt nicht gedacht :D\nDann macht das ganze natürlich schon mehr Sinn, auch wenn es schade ist.","replies":[]},{"poster":"Vapertank","date":"2016-12-22T22:54:59.293+0000","up_votes":1,"down_votes":2,"body":"Ne es juckt eigentlich keinen, sinnlose Funktion die 2,5 Jahre zu halten.","replies":[]}]},{"poster":"Mischaa","date":"2016-12-17T23:30:00.974+0000","up_votes":1,"down_votes":0,"body":"Wenn die Leute ihren Account vom support löschen lassen. Kann man den Namen wieder benutzen. \nDa ich einen smurf hatte der gebannt wurde. Habe den dann durch den support löschen lassen und konnte den wieder benutzen.","replies":[]}]}