{"poster":"DarkSnake72","date":"2019-10-09T11:22:06.845+0000","title":"Aiutatemi Pls.","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Volevo chiedervi un parere dato che io sono indeciso tra quale supporto utilizzare in questo momento sono indeciso tra: morgana, soraka, Nami, Bard, zilean e janna.\r\nSecondo voi chi sarebbe migliore tra questi?","replies":[{"poster":"Rinnegatamante","date":"2019-10-19T10:13:58.986+0000","up_votes":1,"down_votes":0,"body":"Dipende anche in che elo sei.\nSoraka in elo gold alti o superiori diventa inutile perchè il team nemico ha abbastanza neuroni da buildarsi una chiamata del carnefice o un morello e renderti inutile. In low elo questo non accade e Soraka è libera in mid/late game di rendere il suo alleato target immortale castando heal da 1k a botta ogni 2 secondi...\n\nJanna a me non ha mai detto molto come champ (anche se immagino che in elo veramente alti (diamond+) sia un ottimo support (in poche parole è uno di quei champ che vedi masterare alla perfezione per riuscire a giocarla in maniera ottimale).\n\nDi qulli che hai nominato, io mi concenterei personalmente su Morgana (se te la lasciano open essendo uno dei support col più alto banrate attualmente) dato che ha una carica massiccia di CC ma soprattutto il suo dark shield countera qualsiasi CC mettendoti nella posizione di rimediare al tuo adc che si misposiziona oppure Zilean per via del fatto che in late, con una build AP e presence of mind + ultimate hunter semplicemente scioglie i nemici con 2 bombe e ti permette di letteralmente spammare la R.","replies":[]},{"poster":"FVS OniMiao","date":"2019-10-10T11:07:56.636+0000","up_votes":1,"down_votes":0,"body":"Ehi,\nallora la più forte al momento di quello che hai indicato è Nami.\nNami richiede molto allenamento visto che è uno dei campioni più difficili da usare . \n\nIn ordine di scelta :Nami,Soraka,Janna","replies":[]},{"poster":"Luckynanix","date":"2019-10-09T12:20:00.792+0000","up_votes":1,"down_votes":0,"body":"Dipende che stile giochi ma ti sconsiglio Bard visto che molti ADC non sanno cos'è il roaming (cosa su cui si basa Bard) e ti flammano anche solo se vai a wardare il drago.","replies":[]}]}