{"poster":"iTwn Epic","date":"2016-06-27T11:50:07.052+0000","title":"plat V Jungler/Support sucht Mitspieler, ca. Gold 2 -Plat 3, 20+","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey Community,\r\n\r\nich (m/24 Jahre, plat V) suche Mitspieler/innen f&uuml;r Dynamic Queue, nachdem meine vorherigen Mitspieler zu CS:GO abgewandert sind.\r\n\r\nzu mir:\r\nIch bin Main jungler (falls interessant, h&ouml;chste Platzierung letzte season war plat II, diese plat III) , meine Ausweichrollen sind Support und Top, was ich auch spielen kann ist Midlane, wenn sich entsprechende Mitspieler finden nat&uuml;rlich ;)\r\nMein Championpool bel&auml;uft sich am liebsten auf Vi, sonst spiel ich auch ganz gern Gragas und Rengar, lasse aber je nach Teamcomp mit mir diskutieren :)\r\nTS h&auml;tte ich welche zur Auswahl, wenn jemand Optionen hat nehme ich die auch gerne.\r\n\r\nzu dir/euch:\r\nVorweg m&ouml;chte ich sagen, dass ich weder gezielt nach Einzelmitspielern noch nach einem bereits eingespielten Team suche, ich bin erst mal nur auf der Suche nach Mitspielern, wenn sich daraus im Laufe der Zeit ein f&auml;higes Team ergibt w&auml;rs nat&uuml;rlich extra fein, ist aber nicht &quot;Pflicht&quot; f&uuml;r mich, wenn ein Team auf der Suche ist, freue ich mich aber auch auf einen Invite.\r\n\r\n- Alter w&auml;re mir ab 20 recht, because microwave \r\n- Elo Gold 2 - Plat 3\r\n- Ts nat&uuml;rlich\r\n- Saltyness und ein lockeres Mundwerk sind kein Problem f&uuml;r mich (hab ich selber manchmal ;) ) solange es sich nicht merklich aufs Spiel auswirkt\r\n- was ich NICHT suche sind z.B. Dia 3 smurfs, die ihren main spammen wollen, nur um zu stompen, wenn jemand smurft um andere rollen zu &uuml;ben w&auml;r ich voll dabei, allein um einen Lerneffekt im Thema Gameplay zu haben.\r\n\r\nWenn ich Interesse geweckt habe, dann schick mir eine Anfrage an &quot;iTwn Epic&quot;, ich freu mich :D\r\n\r\np.s.: gerne k&ouml;nnen wir auch mit normals zum Testen anfangen","replies":[{"poster":"Nice Flash Bruuh","date":"2016-06-27T17:38:02.102+0000","up_votes":1,"down_votes":0,"body":"Hier! Plat 3 Main mid und adc, suche ein team mit dem man vorran kommt! suche aber nur ernsthafte teams sprich die das spiel geanu so ernst nehmen und aufsteigen wollen! ich suche keine fun teams","replies":[]}]}