{"poster":"Claviature","date":"2015-12-18T05:09:41.952+0000","title":"Does anyone else find toxicity amusing?","subforum":"Player Behavior","up_votes":15,"down_votes":5,"body":"Without it we wouldn&#039;t have gems like:\r\n\r\nhttp://40.media.tumblr.com/cc115d87790cd6e081b116a66bdccbd7/tumblr_ngzuj6pe2s1re04pso1_500.jpg\r\nhttp://41.media.tumblr.com/ba3102e197fa6dbcbf8e24119269f03c/tumblr_nlvx92Puvo1re04pso1_500.jpg\r\nhttp://40.media.tumblr.com/95b0390a31648a4d5abd3a952b90797f/tumblr_nn8ouyVY0S1re04pso1_500.jpg\r\nhttp://36.media.tumblr.com/a62f1faf98526806b6d4bc54547331cf/tumblr_nbgbrsehOi1re04pso1_500.jpg\r\nhttp://41.media.tumblr.com/3e7e214b4969f93184beaab3ff02dcf0/tumblr_n7xoxjPh1T1re04pso1_500.jpg\r\n\r\nI wouldn&#039;t even be mad if someone flamed at me like this. I&#039;ll actually probably feel better LMAO.","replies":[{"poster":"Reket DeAlk","date":"2015-12-18T05:39:30.322+0000","up_votes":13,"down_votes":0,"body":"When it gets creative like that, yeah it's funny. \n\nWhen it's the usual \"stfu noob I report u\", it's just sad and annoying.","replies":[]},{"poster":"Riot Whiskies","date":"2015-12-19T04:57:17.582+0000","up_votes":12,"down_votes":1,"body":"Ahem. I do not find _toxicity_ funny. Being toxic is big no no!! *srsfrownyface\n\nBut I find good wit and sarcasm in the appropriate settings to be hilarious ☆⌒(*＾-°)v","replies":[]},{"poster":"GetMariahCarried","date":"2015-12-19T04:07:25.712+0000","up_votes":7,"down_votes":0,"body":"Once in a group, I muted this one toxic guy (in League chat, and voice) so he switched to the voice-client's text-chat, and enabled electronic voice translation...\n\n... for the next 5 minutes, I hear the voice of Steven Hawkings re-enacting every rage monologue in moba history while everyone else in the voice client is trying not to crack up.","replies":[]},{"poster":"Void Nargacuga","date":"2015-12-18T05:16:01.857+0000","up_votes":3,"down_votes":1,"body":"It can be entertaining at times like the ones you posted. But sometimes its just...\n{{sticker:slayer-jinx-unamused}} I think that Jinx face explains it well.\n\nEDIT: I'm being honest with the jinx face. I personally have been the target of toxicity a few times and it wasn't funny to me is what I'm trying to say. The player was just an outright jerk.","replies":[{"poster":"Xilixer","date":"2015-12-19T08:06:28.938+0000","up_votes":1,"down_votes":2,"body":"not trying to be a jerk or nothing but typically when a person is being \"toxic\" there is some reasoning for it. while the debate would be if it was that much toxic really needed regardless its likely that said person made a critical mistake.","replies":[{"poster":"Void Nargacuga","date":"2015-12-19T08:51:12.720+0000","up_votes":3,"down_votes":0,"body":"Yeah this is true. But when they just say: Noob Zed. GG. Open mid. I have better things to do. Or other things along those lines.\n\nIt just ruins the game. And takes a lot of the fun out of it.","replies":[{"poster":"Xilixer","date":"2015-12-20T05:39:06.671+0000","up_votes":2,"down_votes":0,"body":"agreed. i wouldnt totally rage over it but id rather at least acknowledge the mistake and tell them what they should have done instead. fool you once shame on them fool you twice shame on you.","replies":[{"poster":"Void Nargacuga","date":"2015-12-20T05:51:45.936+0000","up_votes":1,"down_votes":0,"body":"Sadly the things I noted where actually said to me. I prefer to hear constructive criticism over anything else.\n\nThis is the match with the [jungler who thought it was a better idea to be a jerk and give up, then to try and help the team](http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2020780639/228001655?tab=overview). Sadly I wish I was kidding. The opposing team was very nice and friendly though!","replies":[]}]}]}]}]},{"poster":"TrulyBland","date":"2015-12-19T03:50:29.785+0000","up_votes":3,"down_votes":0,"body":"One of my favorites (paraphrased, don't know word by word):\n\nPlayer A: Hey, Player B, can you say \"hello\" please?\nPlayer B: hello\nPlayer B: ?\nPlayer A [all]: Okay guys, I just checked, he's not a bot.\n\n\nBut yeah, toxicity can be rather funny... even without humour, extreme overreactions can be pretty comical when you're on voice comms with a friend.","replies":[{"poster":"Decrit","date":"2015-12-19T12:13:41.883+0000","up_votes":1,"down_votes":0,"body":"well, the example you posted is not toxicity! Cmon, is like asking to report the only player that has not a skin in your team!","replies":[]}]},{"poster":"Kochiya Sanae","date":"2015-12-18T05:29:54.315+0000","up_votes":4,"down_votes":3,"body":"THRESH ONE\n\nSAVED.\n\ngotta remember that one","replies":[{"poster":"Sona Ping","date":"2015-12-18T06:24:45.693+0000","up_votes":2,"down_votes":7,"body":"Not cool, dude.  Stealing other peoples jokes and parroting them is unfunny, desperate and just generally pathetic.\n\nThere's a reason people hate Denis Leary.","replies":[]}]},{"poster":"Bandit King Z","date":"2015-12-19T00:28:19.631+0000","up_votes":2,"down_votes":1,"body":"I think Dunkey was fucking hilarious but I wasn't shocked at all he got banned. I kinda feel the same about this, like yeah sometimes it's funny, but do the crime, pay the time.","replies":[]},{"poster":"Photos of Ghosts","date":"2015-12-19T19:46:26.942+0000","up_votes":1,"down_votes":0,"body":"Uhm. I agreed with the title, because I find most people flaming me to be funny in how they run face-first to their ban. But your point was actually that the flame can be snarky and humorous in itself...\n\nHere's my opinion on that:\nhttps://www.youtube.com/watch?v=DjZONFu1fps","replies":[]},{"poster":"ADepressedLeona","date":"2015-12-19T09:28:09.028+0000","up_votes":1,"down_votes":0,"body":"That Garen one gets me every time XD\n\nAlso that Sion burn lol","replies":[]},{"poster":"Decrit","date":"2015-12-19T12:18:53.195+0000","up_votes":1,"down_votes":1,"body":"But i do not consider this toxicity at all. Well, maybe except the cases like the Rengar and Ezreal ones.\n\nComplaining is fine if done properly. When you do it in an hyper aggressive ( or passive aggressive ) way then it gets \"toxic\" to me, but if you complain with humor, or wit, or with something that is not purely whine then it' s still a complain but with a different effect. If i were that Annie i would have chocked on laughter.\n\nThen again, if even that case gets abusive it is toxic again. Please, don' t be so thin skinned and claim everything that criticizes a person is toxic.","replies":[]}]}