{"poster":"Astralia","date":"2019-09-01T21:57:09.250+0000","title":"Sospensione account","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Buona sera ragazzi,\r\nvolevo semplicemente un chiarimento. Il mio account è stato sospeso \"giustamente\" per 14 giorni. Nel messaggio c'era scritto che il livello di maestria sarà tipo bloccato e senza più premi. La mia domanda è questa: una volta riavuto il mio account e semplicemente giocando come sempre, potrei riavere la mia maestria? Come funziona?\r\nPs: Grazie a League of legends per agire subito sui comportamenti \"ingiusti\", quali i miei. Ma grazie anche a League of Legends quando giochi con serietà e divertimento e ti ritrovi in squadra \"troll e altro\" che  rovinano le tue buone intenzioni iniziali. \r\nGrazie in anticipo a chi risponde.","replies":[{"poster":"Unlucky Cuchu","date":"2019-09-02T19:00:07.209+0000","up_votes":2,"down_votes":0,"body":"Ma ti sei fatt@ bannare in un’aram?","replies":[]},{"poster":"Floppyz","date":"2019-09-01T22:47:10.086+0000","up_votes":1,"down_votes":0,"body":"Ciao, qui trovi tutte le info del caso (capitolo _PENALITÀ E BLOCCHI_): https://support.riotgames.com/hc/it/articles/115008474148\n\nRisposta breve:\n>Se dimostri di aver intrapreso la retta via, i progressi dell'onore si sbloccheranno dopo un tot di tempo dalla limitazione.\n\nSe dopo averlo letto hai altre domande, chiedi pure!","replies":[{"poster":"Astralia","date":"2019-09-01T23:50:45.374+0000","up_votes":1,"down_votes":0,"body":"Grazie mille ^^ allora per come gioco presumo che mi si sbloccherà in pochissimo. Anche all'arcangelo Gabriele penso che gli possa scappare un Vaffa***... \nTy","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-09-03T08:50:39.261+0000","up_votes":1,"down_votes":0,"body":"Se giochi in premade e ti fai dare 4 Honor a game può essere che tu riprenda l'honor 2 in boh,200-300 games circa. Essendo che sei verso fine season e non credo tu giochi costantemente con 4 premade, non ci arriverai in tempo. Ma tranquillo,con l'inizio della nuova season si riazzera.\nComunque dopo qualche game l'honor si sblocca,e puoi avere tutto ciò che potevi avere prima,ad eccezione del drop delle chiavi fino al LV 1. Se fossi almeno Gold comunque con i 14 giorni la skin di fine season la perdi comunque","replies":[]},{"poster":"TheViceroys","date":"2019-09-02T07:16:36.470+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Astralia,realm=EUW,application-id=MJVj50Jw,discussion-id=AAaKB9vc,comment-id=00000000,timestamp=2019-09-01T23:50:45.374+0000)\n>\n> presumo che mi si sbloccherà in pochissimo.\n\nFidati, non sarà pochissimo, il media per tornare a livello 2 ci vogliono 2-3 mesi\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]},{"poster":"PR3D4TOR3","date":"2019-09-01T22:50:50.772+0000","up_votes":1,"down_votes":0,"body":"se per maestria intendi il livello onore, allora si. \nUna volta che potrai giocare di nuovo con il tuo account ti troverai il livello onore bloccato.\n A quel punto ti basterà giocare per un certo periodo seguendo le regole e ti si sbloccherà, così potrai riprendere i checkpoints per farlo salire fino al 5","replies":[]},{"poster":"Cromarlimo","date":"2019-09-01T23:00:46.780+0000","up_votes":1,"down_votes":3,"body":"Perdi alcuni premi e l'onore scende a zero. L'onore tornerà come prima solo dopo un'infinità di partite perfette a causa della stupidità dei riot quindi non ci perdere troppo tempo al riguardo perchè non ne vale la pena. Perdi alcuni premi in palio ma niente di grave oltre ai premi legati all'onore. \nDopo il ban dei 14 giorni c'è il \"permaban\", cioè un bann permanente da LOL, grazie alla stupidità dei riot. \nAttento, se tipo adesso smetti e ricominci a giocare tra 5 anni e quando ricominci sei reportato otterrai il permaban, in quanto i bann sono conteggiati e non conta il tempo intercorso tra i bann (lo so è ridicolo ma è così!). \nNon conosco la realtà dei fatti, ma personalmente se hai offeso un vero troll, hai la mia comprensione. Buon game!","replies":[{"poster":"Astralia","date":"2019-09-01T23:48:32.256+0000","up_votes":2,"down_votes":1,"body":"Grazie mille, volevo solo capire meglio la questione del blocco maestria, che tra l'altro non mi interessa molto! L'unica cosa che mi dispiace è quella di perdere l'account sul quale ho speso abbastanza soldi. Giustamente è un gioco e giustamente devi sempre stare zitto.  Gioco con serietà e divertimento, sempre, e quando ti ritrovi in partita delle persone che \"intenzionalmente\" si fanno ammazzare e \"altro, una parolaccia ti scappa dopo. Sopratutto quando i troll ti rovinano un gioco. Bhè perchè anche se non fai nulla, bastano 4 segnalazioni di una squadra e sei disabilitato dal sistema \"automatico\". Ad entrare nell'account posso però non posso giocare. Tuttavia, lo shop è aperto e potrei liberamente acquistare. AH si, quando i soldi sono l'economia. Ma LOL non dovrebbe bloccarmi anche il negozio? \nGrazie mille per la risposta.","replies":[{"poster":"Floppyz","date":"2019-09-02T14:07:52.270+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Astralia,realm=EUW,application-id=MJVj50Jw,discussion-id=AAaKB9vc,comment-id=00020000,timestamp=2019-09-01T23:48:32.256+0000)\n>\n> L'unica cosa che mi dispiace è quella di perdere l'account sul quale ho speso abbastanza soldi.\n\nC'è un modo sicuro al 100% per non perdere il proprio account per una sospensione: **comportarsi sempre bene**, anche con quelle persone che invece si comportano male e a cui vorresti dirgliene quattro. In questi casi, la cosa migliore è segnalarle, tanto anche rispondendogli male non imparano niente, mentre se invece le segnali vengono punite, e magari può essere che migliorino (e se non migliorano prima o poi verranno sospese permanentemente, quindi il problema si risolve comunque).\n\nTutti a volte vorremmo dirgliene quattro a qualche evocatore che ci rovina volontariamente la partita, ma alla fine se ci pensi, l'unica persona che ci rimetterebbe sei te, quindi sempre meglio evitare.\n\n> Bhè perchè anche se non fai nulla, bastano 4 segnalazioni di una squadra e sei disabilitato dal sistema \"automatico\". Ad entrare nell'account posso però non posso giocare.\n\nIl numero delle segnalazioni ricevute in una partita è ininfluente: che sia **una o nove, vengono considerate come una unica**, e verificate dal sistema, che punisce **solo nel caso in cui effettivamente ci sia stata una violazione delle regole**.\n\n\n >Tuttavia, lo shop è aperto e potrei liberamente acquistare. AH si, quando i soldi sono l'economia. Ma LOL non dovrebbe bloccarmi anche il negozio?\n\nNon so se sia effettivamente così, ma potrebbe essere perché la sospensione serve a tenerti lontano dagli altri giocatori, quindi non è necessario impedirti di usare il negozio. Considera anche che a volte ci sono delle offerte o delle promozioni per un tempo limitato di cui potresti volere approfittare, e se non potessi accedere neanche al negozio non potresti farlo!","replies":[]},{"poster":"Cromarlimo","date":"2019-09-02T11:59:38.713+0000","up_votes":1,"down_votes":2,"body":"se otterrai il permaban non potrai fare niente, nè giocare nè negozio, e quindi dovrai iniziare con un nuovo account, cioè ti chiudono fuori la porta ma ti lasciano aperta la finestra accanto (cosa ridicola ma è così!). \nI soldi gli fanno sempre piacere, io personalmente non ci ho speso niente in quanto potrebbe finire tutto all'improvviso e non ti rimarrebbe niente, oltre al fatto dei bann che è da tenere di conto.\nNon dovresti stare zitto, in quanto è un gioco di squadra online e c'è una chat che dovresti poter usare, purtroppo politiche fallimentari hanno contaminato gravemente la qualità del game, soprattutto ranked, es eclatante è che un troll può reportarti facendoti bannare e lui continuare a trollare piacevolmente.\n Il flame può essere punito col permaban, quasi tutti i permaban sono stati dati per flame, mentre per afk o per trollare non succede mai, pacca sulle spalle e torni a suicidarti in lane e se qualcuno ti insulta lo reporti (bella vita lo so!).","replies":[]}]}]},{"poster":"Ignotum ITA","date":"2019-09-03T12:41:27.712+0000","up_votes":1,"down_votes":3,"body":"OMMIODIO LA PRIMA PERSONA CHE AMMETTE DI ESSERE STATA BANNATA GIUSTAMENTEEEEEEEEEE MIRACOLOOOOOOOOOOOOOOO","replies":[{"poster":"mangialavandini","date":"2019-09-03T14:31:22.296+0000","up_votes":1,"down_votes":1,"body":"> Ps: Grazie a League of legends per agire subito sui comportamenti \"ingiusti\", quali i miei. Ma grazie anche a League of Legends quando giochi con serietà e divertimento e ti ritrovi in squadra \"troll e altro\" che rovinano le tue buone intenzioni iniziali.\n\nLeggi tutto","replies":[]}]}]}