{"poster":"Krelna","date":"2019-05-04T16:22:02.729+0000","title":"Warum YASUO der dümmste Champ im Spiel ist!!","subforum":"Champions & Gameplay","up_votes":4,"down_votes":5,"body":"Ich kann mir gut vorstellen, dass die ganzen Yasuo Mains schon lange die Schnauze voll haben, doch leider habe ich keinen Post dazu gefunden, in dem es mal jemand erklärt.\nIn dem folgenden Text können die Angaben zum Level vielleicht etwas abweichen, jedoch sollten sogar die ungebildetsten Yasuo Mains verstehen, worauf es mir ankommt!\nYasuo kann schon mal auf CDR verzichten, da sein Q mit Attackspeed skaliert. Mit normalen Runen fängt er bei 13% an, womit sein Q direkt 3,69 Sekunden anstatt 4 Sekunden abklingt. Heißt also, er kann seinen Knockup alle 11,07s benutzen. Dieser, nicht zu vergessen, ist AoE mit einem 100% ad-scaling. Und mal ehrlich. der wirbel fliegt nicht gerade langsam. \nProbiert man gegen einen Yasuo mit Level 1 zu traden verliert man zu 90%, da er direkt seinen passiv Schild bekommt (Schildstärke 100) und er seinen Q bestimmt 2 mal nutzen kann. Wie Ihr hoffentlich wisst, lädt sich der Schild durch Bewegung auf, d.h. sobald er Level 2 ist benutzt er seinen Dash (E) durch die nächste Minion-Wave und hat somit spätestens den Schild wieder zur Verfügung für den nächsten Trade.\nGehen wir davon aus, dass er Level 6 ist ,dann mit 1.300 Gold in die Base portet und direkt mit \"Eifer\" zurück auf die Lane kommt. Durch das Item und die Attackspeed-Steigerung pro Level sinkt die Abklingzeit vom Q direkt auf 3,09s ; sein Knockup also auf 9.27s.\nNach dem nächsten Besuch beim Händler kommt er wieder mit den \"Berserker-Schuhen\" und ca. Level 9, wodurch sein Q schon auf 2,08s sinkt. Wenn Ihr noch folgen könnt ergibt das einen Knockup alle 6,24s. Denkt dran AoE und 100% scaling.\nDie Schildstärke seiner passiv ist übrigens mittlerweile auf 165 gestiegen.\nMit Level 11 und einem fertigen \"Phantomtänzer\" steigern wir unser Attackspeed bereits auf 99%, was die Abklingzeit vom Q auf 1,6s (Knockup 4,8s!!) senkt.\nIn die Berechnungen sind noch nicht einmal die Legenden-Steigerungen mit einbezogen, falls er ein paar Kills bekommen sollte (1,5% / kill).\nManche Yasuos gönnen sich zusätzlich noch ein BotRK, was den Q auf 1,33s bzw. Knockup auf 3,99s senkt. D.h. der Wirbel hat nun eine geringere Abklingzeit als der eigentliche Q ohne Attackspeed! \nIm Klartext heißt das: Durch dieses bescheuerte Attackspeed-Scaling erreicht Yasuo im Prinzip eine Abklingzeitverringerung von ca. 75% !!!!!!!!!!!!!!!!\nDas gibt es bei keinem anderen Champion im Spiel und ich wüsste gern welches Design-Team sich das hat einfallen lassen, ohne es mal wirklich vorher zu durchdenken.\nDazu kommt ja noch, was viele vielleicht vergessen, die Ausführungsdauer (Animationszeit) des Q verringert sich zusätzlich noch mit Attackspeed. Achja Treffereffekte löst der Spell ja auch noch aus (z.B. Lebensraub, Crit, etc).\nAuf die doppelte Crit-Chance will ich gar nicht erst eingehen.\n\nMEIN VORCHLAG: Setzt den Knockup (Wirbel)  auf jeden 4. Q! \nWenn man sich die Rechnungen anschaut, sollte das meiner Meinung nach sogar für die Yasuo Mains in Ordnung sein!!\n\nIch bedanke mich hier schon mal für die hoffentlich nette Diskussion.\n\nMfG Krelna                                          \n\n#LetTheFlameBegin\n\nedit: Die Meinung von ein paar Yasuo Mains zu meinem Vorschlag (Wirbel mit jedem vierten Q) würde mich interessieren. Nicht welche Champions ansonsten noch nervig sind.","replies":[{"poster":"SuicidePlank","date":"2019-05-04T16:51:39.414+0000","up_votes":1,"down_votes":2,"body":"Nah, Kennen und Vladimir sind schlimmer.","replies":[{"poster":"Angel Ayume","date":"2019-05-04T17:16:52.356+0000","up_votes":1,"down_votes":0,"body":"Hey :( Kennen ist n toller Champ D:","replies":[{"poster":"SuicidePlank","date":"2019-05-04T17:24:04.402+0000","up_votes":1,"down_votes":1,"body":"Richtig, gegen einen Ranged zu spielen mit einer winzigen Hitbox, einem CC der sich in fast instant proccen lässt, einen Gapcloser in dem du ihn nicht catchen kannst und einem für fast alle Melees nicht zu dodgenen All In, macht richtig viel Spaß gegen zu spielen.\nBin ja froh das die Resistenzen geshifted wurden, aber ich hasse diesen Hamster und habe nicht mehr Respekt für seine Spielerschaft als Riven.\nDodge jedes Game wo ich diese abstoßende Ratte sehe.","replies":[{"poster":"Angel Ayume","date":"2019-05-04T18:37:11.691+0000","up_votes":2,"down_votes":1,"body":"Das mag ja alles stimmen. Aber die letzte Nacht hat mir wieder gezeigt, wie viel Probleme ein Kennen gegen extrem viele Match Ups auf der Toplane hat. Die meisten davon sind einfach nicht spaßig zu spielen. \nWenn ich Toplane spiele, bin ich Kennen Main. Ich habe also einige Match Up Erfahrungen. \n\nVielleicht spiele ich den Champion auch falsch, vllt bin ich auch einfach zu schlecht, keine Ahnung. Aber gegen sehr viele Match Ups habe ich  Probleme. Wobei ich sagen muss, viele Match Ups habe ich dominiert und die Lane nur verloren, weil der Jungler im richtigen Moment da war.\n\nAber Kennen ist längst nicht so nervig oder anstrengend wie manch anderer Champion.","replies":[{"poster":"SuicidePlank","date":"2019-05-04T18:45:47.895+0000","up_votes":1,"down_votes":1,"body":"> Wobei ich sagen muss, viele Match Ups habe ich dominiert und die Lane nur verloren, weil der Jungler im richtigen Moment da war.\n\nDas bist halt du..\n\nKennen ist halt einfach unfassbar save und gleichzeitig dominant auf der Lane, vorallem mit einem E max wie es fast alle tun, wenn du den nicht aggressiv benutzt außer du kannst den Gegner töten, wirst du niemals mit irgendwas außer Riven, Vlad oder Gnar Probleme haben, einfach weil niemand diese Gap closen kann die du mit deiner E aufbaust, zudem hat er auch früher sehr hohe Resistenzen mit seiner E bekommen und dazu noch einen der billigsten und schnellsten Powerspike auf der Toplane mit Protobelt, außer halt du spielst Vlad dagegen.\n\nUnd sorry wenn ich das sage, du wenn du Toplane spielst Kennen Main. Ich bin Toplane Main und ja, Elo als Faktor aufzurufen ist gemein, aber ich habe gegen Kennense in high Platin/low Diamond gespielt, du halt gegen Silber/Gold...","replies":[{"poster":"Angel Ayume","date":"2019-05-04T19:23:02.114+0000","up_votes":1,"down_votes":0,"body":"Na ja aber während du als Toplaner immer einen festen Championpool hast und das Match Up quasi nur mit diesen Champs kennst, musste ich als Kennen Main schon gegen alle möglichen Match Ups spielen. \n\nAber ja, es ist was anderes gegen Platin und Dia zu spielen als gegen Silber und Gold. Aber die Champions gegen die ich spielen muss bleiben dennoch dieselben.","replies":[{"poster":"SuicidePlank","date":"2019-05-04T19:42:44.597+0000","up_votes":1,"down_votes":0,"body":"Naja, aber auf wieviele Games? Du hast insgesamt, in vier Seasons (ich kann nur Ranked miteinbeziehen) 116 Kennen Spiele.\nNur zum Vergleich, ich habe diese Season alleine schon 269 Toplane Games gespielt, die Seasons davor bedeutend mehr, heißt ich habe höchstwahrscheinlich mehr gegen Kennen mit verschiedenen Champs gespielt, als du Kennen gegen verschiedene Champions.\n\nJa, aber der Spieler wird schlauer. Wenn ich auf meinem Smurf Darius gegen Iron, oder Silber spielen würde, würde ich andere Ergebnisse bekommen als in meiner tatsächlichen Elo, sprich, die Leute lernen wie sie mit ihren Champion umzugehen haben, wie sie mit Jungle Pressure auf der Toplane umgehen müssen, wann sie pushen und und und.\n\nDas fehlt halt vieles in der low-mid Elo und da kann man schon sagen das Kennen erträglich ist, weil der Spieler einfach nicht weiß wie er ihn zu 100% nutzt, oder einfach die Rolle nicht kann.","replies":[{"poster":"Krelna","date":"2019-05-04T19:51:48.453+0000","up_votes":2,"down_votes":0,"body":"> Das fehlt halt vieles in der low-mid Elo und da kann man schon sagen das Kennen erträglich ist, weil der Spieler einfach nicht weiß wie er ihn zu 100% nutzt, oder einfach die Rolle nicht kann.\n\nDas heißt im Umkehrschluss, dass du in deiner \"high elo\" einfach nicht weißt, wie DU gegen kennen spielen musst?","replies":[{"poster":"SuicidePlank","date":"2019-05-04T19:55:00.586+0000","up_votes":1,"down_votes":1,"body":"Ich weiß wie man gegen ihn spielt? Heißt ja nicht das er nicht frustrierend gegen zu spielen ist, wie ich dir jetzt zum zweiten Mal schreiben muss.\nGenauso wie ich Zileans Ult oder Zhonyas frustrierend finde, oder Lucian wenn er mit seinem Doppelschuss meine Barrels zerstört. \nLucian könnte keinen Schaden machen aber es würde mich trotzdem nerven.\nIch sage nicht das diese Champs broken sind, ist für mich nichts außer Vayne oder Riven.","replies":[{"poster":"Krelna","date":"2019-05-04T20:35:49.378+0000","up_votes":1,"down_votes":0,"body":"Es geht in diesem Thread aber nicht darum, was frustrierend in dem Spiel ist, sondern dass bei Yasuo der Q mit dem Scaling + Items einfach zu früh einen zu starken Powerspike ergibt. Das ist fakt. Und um nichts anderes geht es hier. Also bleib beim Thema oder öffne selber einen Thread: \"Warum und weshalb ich in LoL immer das heulen anfange!\"","replies":[{"poster":"SuicidePlank","date":"2019-05-04T20:38:19.038+0000","up_votes":1,"down_votes":1,"body":"Ich sage nicht das Spiel, ich sage gewisse Champions. Außerdem, wenn du eine Diskussion mit Fakten und Werten haben willst, dann wähle doch bitte einen anderen Titel.\nWie wäre es denn mit einem für dich ,,Ich werde persönlich und beleidigend, wenn mir eine Meinung nicht passt\"?","replies":[{"poster":"Krelna","date":"2019-05-04T20:41:46.617+0000","up_votes":1,"down_votes":0,"body":"Was ist an dem Titel falsch? Ich stell ein Thema und äußere mich anschließend dazu. \nWer hier andauern andere und unpassende Themen einbringt bist du.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Krelna","date":"2019-05-04T17:30:53.470+0000","up_votes":1,"down_votes":0,"body":"ja du hast erklärt, was der champ kann. ansonsten aber nix.","replies":[{"poster":"SuicidePlank","date":"2019-05-04T17:33:31.893+0000","up_votes":1,"down_votes":2,"body":"Lustig das du das so siehst, ich habe aufgelistet was frustrierend daran ist gegen ihn zu spielen.\nWenn du das nicht siehst, vielleicht fehlen ja die ,,!!!!!!!!!!!!!\", wie du es zu tun pflegst.","replies":[{"poster":"Krelna","date":"2019-05-04T17:49:37.696+0000","up_votes":1,"down_votes":0,"body":"items? zahlen? fallbeispiele? stats? das nenn ich fakten. \nwarum du den champ nicht leiden kannst, is ne andere sache","replies":[{"poster":"SuicidePlank","date":"2019-05-04T18:39:43.668+0000","up_votes":1,"down_votes":1,"body":"Brudi, ich habe dir gesagt wieso ich ihn frustrierend finde, deshalb habe ich meine Argumente aufgelistet, genau wie du es in deinem Post getan hast.\nIch brauche keine ,,items? zahlen? fallbeispiele? stats?\" oder schlichtweg Fakten um das zu erklären.","replies":[]}]}]}]}]}]},{"poster":"Krelna","date":"2019-05-04T17:24:33.676+0000","up_votes":1,"down_votes":0,"body":"Klar die beiden können auch nervig sein. Jedoch sind sie nicht so überladen wie Yasuo. Wenn du jedoch der Meinung bist, dann erläutere es bitte so, wie ich es getan hab!!! Ansonsten ist das nur dein persönliches Denken.\nIch dagegen habe klare Fakten aufgezeigt, welche niemand wiederlegen kann!","replies":[{"poster":"SuicidePlank","date":"2019-05-04T17:26:15.783+0000","up_votes":1,"down_votes":1,"body":"Habe ich, unten. \nAußerdem sind Satzzeichen keine Rudeltiere, ein Ausrufezeichen genügt, obwohl ich selbst dieses übertrieben finde.","replies":[]}]}]},{"poster":"Angel Ayume","date":"2019-05-04T16:50:14.383+0000","up_votes":2,"down_votes":1,"body":"Du solltest nicht so böse über einen Yasuo Main urteilen. Das ist ziemlich fies von dir.\nJeder darf spielen was ihm gefällt. Und wer Spaß an Yasuo hat, darf diesen auch haben. Da ist weder was ehrenlos dran noch unfair. \n\nDas der Champion ein überladenes Kit hat will ich hier nicht anzweifeln, aber die Spieler können schließlich nichts dafür. Sie nutzen nur das, was Riot ihnen zur Verfügung stellt.","replies":[{"poster":"Krelna","date":"2019-05-04T16:55:25.779+0000","up_votes":2,"down_votes":0,"body":"Habs raus genommen. Hast ja recht. :)\n\nAber Yasuo selber ist ehrenlos. \"Yasuo der entehrte Krieger\"","replies":[]}]},{"poster":"Léon Lemond","date":"2019-05-04T20:05:26.536+0000","up_votes":1,"down_votes":1,"body":"> Das gibt es bei keinem anderen Champion im Spiel und ich wüsste gern welches Design-Team sich das hat einfallen lassen, ohne es mal wirklich vorher zu durchdenken.\n\nSona? Ultimate reduziert die Abklinkzeit ihrer Spells um 40%+45% normale CDR.\nSind wir also bei einer CDR von 85%","replies":[{"poster":"Krelna","date":"2019-05-04T20:31:20.197+0000","up_votes":1,"down_votes":2,"body":"> Sona? Ultimate reduziert die Abklinkzeit ihrer Spells um 40%+45% normale CDR.\n> Sind wir also bei einer CDR von 85%\n\nPassiv: Reduziert die Abklingzeit von Sonas Grundfähigkeiten um 10/25/40 %.\n\nLevel 16 erreichst du als Supporter eh so gut wie nie. Erst informieren, dann reden!","replies":[{"poster":"Léon Lemond","date":"2019-05-04T21:01:24.681+0000","up_votes":1,"down_votes":0,"body":"Die Grundaussage war, dass es das bei keinem anderen Champion geben würde. Sona kommt mit lv 11 schon auf 70% (und das erreichst du als Support oft). Somit ist deine Grundaussage faktisch falsch.\n\nErst lesen, dann schreiben!","replies":[{"poster":"Krelna","date":"2019-05-04T21:59:21.096+0000","up_votes":1,"down_votes":0,"body":"Haha außerdem hast du da nen groben Denkfehler. Das mit den 70% ist faktisch falsch. Die Abklingzeit der Ulti wird VORAB berechnet. D.h. auf LvL 11 (25%) hat zum Beispiel der Q anstatt 8 nur noch 6 Sekunden CD. Ziehen wir nun noch 45% reguläre CDR ab dann kommen wir auf 3,3s CD. \nDas ergibt eine \"effektive\" Abklingzeit von 58,75% und nicht 70%! \nErst mit Level 16 (40% von Ult) kommst du auf eine \"effektive\" Abklingzeit von 77%.\n\nGern geschehen :)","replies":[{"poster":"Léon Lemond","date":"2019-05-04T23:26:48.312+0000","up_votes":2,"down_votes":1,"body":"Oh. Gut zu wissen, das erklärt warum die Q sich auf lv 6 trotzdem noch so lange angefühlt hat.  Danke.\n\nFakt ist aber: Sona hat auch einen CDR im kit.\nFakt ist auch: Yasuo ist ein Huso","replies":[{"poster":"Krelna","date":"2019-05-04T23:33:46.586+0000","up_votes":1,"down_votes":0,"body":"Ok jetz sind wir uns in beiden punkten einig xD","replies":[]}]}]},{"poster":"Krelna","date":"2019-05-04T21:21:37.982+0000","up_votes":1,"down_votes":0,"body":"Ok von mir aus sind 70% erreichbar. Das Problem ist nur, die Rechnung die ich vorgenommen habe, bezog sich bei Yasuo auch nur bis Level 11. Im Gegensatz zu Sona erreicht Yasuo meistens noch ein paar Level mehr, wodurch sein Cooldown noch weiter sinkt. Ich kann es gern noch mit fullbuild, LvL 18 und Runen ausrechnen.","replies":[]}]}]}]},{"poster":"Cenâreth","date":"2019-05-09T10:33:03.273+0000","up_votes":1,"down_votes":0,"body":"Yasuo ist wirklich aktuell mal ein Champ wo ich sag der hatn Nerf notwendig, weil sein Scaling mit der aktuellen Crit Situation absolut banabel ist jeder n00b spielt den mittlerweile und egal wie mechanisch schlecht er ist, kills machen die ohnehin, solange sie wissen welche Items sie bauen müssen.","replies":[]},{"poster":"PlsLoLMMO","date":"2019-05-04T20:07:14.893+0000","up_votes":1,"down_votes":0,"body":"Also ich finde {{champion:30}}  ja 10x dümmer xd","replies":[]},{"poster":"SnapIntoASlimJim","date":"2019-05-04T17:34:26.525+0000","up_votes":1,"down_votes":0,"body":"Yasuo ist zwar schon echt nervig und ein wenig überladen, aber man muss bedenken, dass er sich mit seiner Ult ins gegnerische Team schmeißt. Das kann man auch mal gut gegen ihn einsetzen.","replies":[{"poster":"Krelna","date":"2019-05-04T17:46:16.900+0000","up_votes":1,"down_votes":0,"body":"nur kommt es eher selten vor, dass er 1v5 reingeht. die meiste zeit hast du mindestens 2 andere meeles dabei die mit dem yasuo im gegnerteam stehen!","replies":[{"poster":"SnapIntoASlimJim","date":"2019-05-04T17:52:16.261+0000","up_votes":1,"down_votes":0,"body":"Es ist aber auch eher seltener, dass er direkt 5 Leute gleichzeitig ultet. Somit hat man selbst auch noch Champions die handlungsfähig sind. Würden die Supporter zB. nicht in 90% ihrer Games Ignite mitnehmen (ich weiß, kürzere CD + DMG + Healreduce), sondern eher Exhaust, würde das einen Yasuo durchaus in Teufels Küche bringen.","replies":[{"poster":"Krelna","date":"2019-05-04T19:06:33.460+0000","up_votes":1,"down_votes":0,"body":"häng dich nicht zu sehr an dem 1v5 von mir auf. ich hätte auch 1v3 schreiben können. es is so, wenn er ins gegnerteam ultet, hat er entweder unterstützung oder er weiß, dass er es alleine gegen wie viele auch immer aufnehmen kann. im zweiten fall lässt es sich meiner meinung nach wieder auf sein \"überladenes\" kit zurück führen. wobei es falsch ist das gesammte kit zu nennen. im grunde ist es der q mit dem attackspeed scaling, welches ihm viel zu einfach einen lead im spiel aufbaut.","replies":[]}]}]}]},{"poster":"uBad","date":"2019-05-04T23:27:29.676+0000","up_votes":1,"down_votes":1,"body":"Das einzige Problem an Yasuo ist das er in 99,99%, wenn nicht sogar in 100% aller Spiele feedet. Fakt. \nDagegen sollte etwas unternommen werden. Wie kann es denn sein das der super Yasuo main mit 800k Mastery Points in jedem Spiel 2/11 steht? Mit einer 39% winrate auf 200 Spielen? Wie kann dieser Person sowas Spaß machen? Alle Yasuo mains sind abschaum, nicht weil Yasuo so mega op ist sondern weil Yasuo Spieler ausschließlich eines kennen: feeden\nDer Champ an sich ist Klasse, aber die Personen die diesen spielen, ja das ist der Abschaum von League of Legends. \nAllein schon wie die sich immer aufführen... ekelhaft","replies":[]}]}