{"poster":"Panta Chilly","date":"2017-09-03T13:43:02.297+0000","title":"Support sucht neues Zuhause (Team/Clan/Community)","subforum":"Clans & Teams","embed":{"description":"Panta Chilly / Silver 2 0LP / 30W 15L Win Ratio 67% / Ekko - 15W 5L Win Ratio 75%, Thresh - 9W 1L Win Ratio 90%, Janna - 4W 1L Win Ratio 80%, Braum - 3W 2L Win Ratio 60%, Morgana - 1W 1L Win Ratio 50%","url":"https://euw.op.gg/summoner/userName=pantachilly","image":"http://s3.ap-northeast-2.amazonaws.com/opgg-static/images/logo/2015/reverse.rectangle.png"},"up_votes":1,"down_votes":0,"body":"_**Hey hey. Ich bin&#039;s, der Timo. Ich bin 16 und suche ein neues Zuhause.**_ \r\n\r\n&bull; Ich bin Supporter und spiele mich gerade von Silber 2 wieder hoch (Mein account wurde geheackt.\r\n&bull; **_WARNUNG:_** Klickt niemals in eurem Client auf irgendwelche Links sondern kopiert sie und f&uuml;gt sie dann ein!). \r\n&bull; Ich bin ein netter und verst&auml;ndnisvolle Mensch der jeden Fail versteht und euch nie b&ouml;se ist. \r\n&bull; Ich verzeihe gerne aber nur, wenn ihr mir auch verzeiht, wenn ich an einem Trainingstag mal nicht erscheinen kann. \r\n&bull; Ich habe Montag und Mittwoch Abends ab 18 Uhr sogut wie nie Zeit, da ich Training habe (Boxen). \r\n&bull; Ich kann mich reif verhalten und habe nichts dagegen, wenn ihr mich kritisiert. \r\n&bull; Ich kritisiere meistens sachlich und versuche demjenigen etwas mitzuteilen, was nicht bedeutet, du bist schlecht sondern eher konstruktive Kritik sein soll. \r\n&bull; Ihr solltet mich nicht immer zu ernst nehmen aber meistens solltet ihr den Ernst einer Lage auch verstehen. \r\n&bull; Ich komme mit jedem Adc klar, der auch mit mir klarkommt.\r\n&bull; Ich bin immer offen f&uuml;r DuoQ mit meinem Adc. \r\n&bull; Ich spiele auch gerne DuoQ mit meinem Team oder trolle etwas in Normals (Bronze bravery, Call ist Call, etc.). \r\n&bull; Dazu verfolge ich noch das Ziel ein Tryhard Team zu werden und in den meisten Turnieren gut abzuschliessen.\r\n\r\nHabe ich euch nochnicht &uuml;berzeugt? Schaut auch mal bei meinem Profil dabei um zu schauen, was meine Mains sind (Mein Account besteht nochnicht ewig lange und deshalb fehlen mir viele Champions: [Klick mich](https://euw.op.gg/summoner/userName=pantachilly)\r\n\r\n**Meine W&uuml;nsche:**\r\n &bull; Eigenen Teamspeak 3 Server/Discord Server\r\n &bull; Eigenen Channel in Ts&sup3;/Discord\r\n &bull; Nette Atmosph&auml;re\r\n &bull; Tryhard Team\r\n &bull; (Volles) bestehendes Team \r\n(&bull; eigenen Clan/Community indem das Team spielt)\r\n(&bull; Einen Sponsor f&uuml;r ein Namechange)\r\n(&bull; Ein Adc der richtig zu mir passt)\r\n(&bull; Coach, Subs und Analyst)\r\n_(Eingeklammerte Begriffe sind kein muss, w&auml;re nur sehr sch&ouml;n zu haben)_\r\nWenn ich euer Interesse geweckt habe dann schreibt mir doch bitte kurz etwas zu eurem Team. Es muss kein ewig langer Text sein es reichen ein paar Zeilen mit eurem ts/discord vllt Website etc. Mitspieler, Alter, etc. pp. mit eurem Summoner Name bei dem ich mich melden muss (Alternativ mich einfach adden, Name steht beim op.gg Link)\r\nLg Timo =)\r\nP.S.: Danke an alle die es mit mir versuchen wollen :3\r\n{{sticker:slayer-jinx-catface}}","replies":[]}