{"poster":"PaTroKlos8050","date":"2017-07-03T17:31:02.712+0000","title":"client buggato fa schifo","subforum":"Segnalazioni bug Client Alpha","up_votes":2,"down_votes":1,"body":"gradirei che si risolvesse il seguente problema .... il client fa schifo ha un sacco di bug nel champ select mi da ogni tanto un errore che mi fa chiudere il client e non me lo fa riavviare fino a quando la champ select e finita ovviamente con penalita leaver buster ... il problema si e presentato solo con questa patch spero si possa risolvere il problema perche non ho intenzione di perdere ancora promo per colpa del vostro maledetto client nuovo","replies":[{"poster":"RVN Trobugno","date":"2017-07-04T06:20:47.605+0000","up_votes":1,"down_votes":0,"body":"Ti prego la grammatica.. Mi è venuto il mal di testa a leggere il post.\n\nComunque ci sono delle cose che potrebbero migliorare la tua situazione:\n- Modalità tostapane: Usa questa modalità dalle impostazioni per ridurre le animazioni, ed alleggerire il carico al tuo PC.\n- Abilita chiusura del client quando si è in game: aumenta sensibilmente le prestazioni ma ci impiega un pochino di più a tornare alla schermata dei punteggi di fine partita.\n\nPrima di abilitare queste opzioni tuttavia ti consiglio di avviare lo strumento di riparazione del client in tal modo controllerà e sistemerà eventuali file danneggiati.\n\nUna volta fatto tutto ciò verifica le prestazioni con una partita normale.","replies":[{"poster":"PaTroKlos8050","date":"2017-07-04T06:22:42.664+0000","up_votes":1,"down_votes":0,"body":"Mi capita solo nell ultima patch secondo me e qualche problema che risolveranno con la prossima non saprei","replies":[{"poster":"Sodets","date":"2017-07-04T07:49:26.997+0000","up_votes":1,"down_votes":0,"body":"l'ultima patch funziona benissimo, vuol dire solo che ti si è scaricata male. La prossima volta cerca di non usare il pc, o di usarlo al minimo mentre sta facendo l'aggiornamento. Per risolvere il problema o reinstalli il gioco o usi lo strumento di riparazione.","replies":[]},{"poster":"RVN Trobugno","date":"2017-07-04T07:09:02.240+0000","up_votes":1,"down_votes":0,"body":"Prova ad usare lo strumento di riparazione allora.","replies":[]}]}]}]}