{"poster":"Leizham","date":"2015-03-09T03:41:19.818+0000","title":"Creo que esto representa la situación más claramente","subforum":"Problemas Técnicos","embed":{"description":null,"url":"http://s17.postimg.org/5jpmowd4v/Screen21.png","image":null},"up_votes":16,"down_votes":2,"body":"Ping 47ms, FPS: 187\n\nYa bastante desgastado de este asunto, que yo no soy el único que lo tiene si no que muchos users no saben reconocerlo por cuestiones técnicas o a veces se enmascara con el ping y el bajo hardware, esto es una buena prueba de que no tiene que ver con eso. El problema más grande viene de acá, el Delay.\n\nEn europa se juega (jugaba, ahora están mal también) con 250 de ping tan cómodamente como si acá estuviesemos con 90 o 100. No es el ping, no son los FPS. ¿Que otra queda? Cuello de botella en los servers.","replies":[{"poster":"xNicox","date":"2015-03-09T14:39:24.767+0000","up_votes":2,"down_votes":0,"body":"A mi me me pasa tambien, lo mas loco es que esta todo normal andando de lujo y derrepente en una TF o en cualquier momento del game el champ se te va y aparece \"reanudando conexion\" y no sube el PING, una kk jugar asi ya que al menos a mi me ah estado pasando en todas las partidas.","replies":[{"poster":"Leizham","date":"2015-03-09T21:01:12.978+0000","up_votes":1,"down_votes":0,"body":"Por qué justo en una TF? ¿server Ka-Boom? a eso me suena, teniendo en cuenta que \"El server\" en realidad es un conjunto de muchos equipos servidores interconectados entre sí, veo perfectamente plausible que uno se sobreesfuerce al calcular el caudal de eventos que suceden en una TF. pero esto le debería de suceder a PCs sin potencia... no a las que deberían de tener como servers ahí.\n\nAca hay menos equipamiento del que dicen, no me creo ni de broma eso de que el server tiene capacidad \"holgada\" para trabajar.","replies":[{"poster":"Rocofu","date":"2015-03-10T00:13:42.886+0000","up_votes":6,"down_votes":2,"body":"Sin embargo, la capacidad de los equipos en donde se hace el hosting de las partidas tiene más que suficiente capacidad, incluso en el pico máximos de jugadores conectados y jugando. Si hubiera un equipo que estuviera batallando para mantener juegos, ya estaría fuera de circulación. Este tipo de cosas la mantenemos bien monitoreadas.\nSi fuera un problema de capacidad de equipos en donde no estuvieran pudiendo calcular a tiempo todo lo que sucede, el tipo de lag que verías sería muy similar a algo de FPS pero de manera constante, no importa si estas en TF o en bot, mid, jungla, etc. Considera que en el mismo servidor que estás jugando hay muchas otras partidas corriendo.\n\n¿Qué puede estar sucediendo?\n\n* Si hay saturación o cuello de botella en algún lado, es en la red en que los ISPs se conectan entre ellos y luego a nosotros. Ya sea su propia red o el backbone al que se conectan. Por nuestro lado, nos aseguramos que los enlaces por los que vamos a recibir tráfico tienen capacidad sobrada para recibir el tráfico de hoy y de más (en caso de picos de tráfico malicioso, etc). Otros ISPs quizás no estén preparados con la infraestructura en enlaces o en puertos físicos para atender incrementos de tráfico. Por dar un ejemplo muy sencillo. Digamos que nosotros usamos un corredor y puertas por las que caben 10 personas al mismo tiempo pasando. El proveedor o los backbone que usan quizas tienen puertas o corredores por los que solo pasan 2 personas. Si el tráfico máximo consta de 3 personas al mismo tiempo, pues a nosotros nos cabe perfectamente pero los ISP o su proveedor de backbone podrían tener problemas.\nEsta saturación normalmente provoca pérdida de paquetes o incrementos de latencia. ¿Porqué esto afectaría a LoL? Muchos servicios de internet no son sensibles a la pérdida de paquetes como LoL y pueden sobrevivir sin problemas a pérdida de paquetes por saturación o cambiar rutas a una sin saturación sin importar el impacto de latencia.\n\n* Un evento puntual de algo que sucedió en la conexión (por ejemplo, un corte de fibra en el enlace Argentina-Chile) que provocó pérdida de paquetes o problema en la conexión. \n\n* Un evento en tu red local o de tu ISP. Hacen mantenimientos, tienen caídas, cortes, etc que nuevamente podrían no afectar a otros servicios y a LoL si. O lo mismo para el proveedor de backbone al que se conecta el ISP (esto es más común con ISPs más pequeños o locales)\n\n* Drophack/DDoS\n\n* Si el tema es de FPS (que es lo más común cuando los problemas están en las TF) podría estar ubicado en tu equipo o en el código del parche que provoca que no se lleve bien. Por ejemplo, desactivamos las nuevas tarjetas de presentación porque un bug provocaba problemas con la memoria lo que después causaba problemas de FPS. De igual manera el modo de Anti-solapamiento provocaba problemas en algunos equipos.\nTambién, algunos programas pueden provocar serios problemas en LoL especialmente en algunos parches ya que algo del código nuevo ya no es compatible. A mí me ha pasado que el bajón de FPS es tan rápido que no me doy cuenta y me tienes revisando todo el estado del servidor y las conexiones para ver si hay un problema cuando es algo de desempeño local.\n\n* Saturación, interferencia, muchos equipos, desempeño, puertos no redirigidos, etc relacionado a tu router si juegas por Wi-Fi. \n\n\nEsto sólo por mencionar unas pocas posibilidades. El cartel de \"reanudando conexión\" es sólo un síntoma y no demuestra que el servidor esté en llamas o teniendo problemas. Los picos de latencia (que derrepente sube a 1000ms+) son mucho más comunes con problemas locales que generales. La latencia que incrementa es casi siempre un problema de ruteo origen de algún cambio local al ISP. Y más.\n\n\nTe menciono todo esto porque sí, yo sé que ha habido problemas en desempeño en algunas redes (otras no tienen problemas), que hay eventos de desconexión que nos causan problemas a muchos, que hay actualizaciones que pasan bien y otras que nos hacen pasar malos ratos. Hay muchas cosas que podemos hacer mejor y en donde podemos mejorar y otras que va a ser muy difícil o tomará tiempo (super conexiones con todos los ISP?) Pero capacidad de los equipos para mantener, correr y llevar los juegos; al día de hoy NO es un problema.","replies":[{"poster":"Melodie","date":"2015-03-10T01:30:28.481+0000","up_votes":1,"down_votes":1,"body":"Rocofu este problema viene desde los cortes de cable de fibra supuestamente lo arreglaron pero hay gente que le sigue andando mal, por ejemplo a mi me tira 100 de ms y me sube a 400 de golpe pero enrealidad me sube mas y el juego no me lo muestra, y aunque yo este descargando el ping latencia ms sigue igual en 100, no mi internet no es rapido tengo 1 mb de descarga bah casi un mega y 0.50 de carga asi que nose que sera este problema pero el calculador de ping anda mal o nose tu sabras mas que yo estaria buenisimo que me respondas ya que me comunique con el soporte por este problema y nomas obtuve respuesta de bots que no me solucionaron nada. Espero tu respuesta :D","replies":[{"poster":"Rocofu","date":"2015-03-10T01:46:59.910+0000","up_votes":3,"down_votes":1,"body":"Los cortes de fibra no es algo que se solucione como tal. Son frecuentes y comunes en el mundo de internet. Lo malo es que nos pegan fuerte. Pero lo que sí hemos hecho es agregar enlaces para distribuir el tráfico y si llegara a haber un corte en un enlace, afecte a menos jugadores que antes. Ahora bien. Un corte de fibra es algo que sucede en un momento, se arregla el corte y listo. No afecta más. \n\nLo que te muestra el medidor de ping es precisamente sólo la latencia. No es un medidor global de \"lag\". Es posible que tu latencia no cambie porque los paquetes siguen tomando el mismo tiempo en transferirse pero puede que estés teniendo pérdida de paquetes o bajones de FPS. Dependiendo de la pérdida de paquetes, la frecuencia y cantidad, esto se podría reflejar en un incremento de latencia pero no necesariamente.","replies":[]}]},{"poster":"keke","date":"2015-03-10T04:11:41.249+0000","up_votes":1,"down_votes":0,"body":"Yo siempre juego con 40 de ping y mi ISP es Antel,aveces hay un delay en las partidas que no te dejan jugar normalmente y otros dias el ping sube repentinamente ,cuando me comunico con la empresa ,siempre me dicen que todo esta bien y no tienen ningun problema ellos en su red","replies":[]},{"poster":"ProyectoMlD","date":"2015-03-10T03:56:46.538+0000","up_votes":1,"down_votes":0,"body":"Esta todo muy lindo, pero si yo tengo un negocio de coca cola y la empresa de botellas de vidrio y de plástico me hacen paro y cierran, me joden a mi el negocio. Así que si nosotros invertimos plata y tiempo en el juego y las rutas de nuestros proovedores se saturan, también deberían ustedes poner presión y hacer algo al respecto, porque es SU negocio el que resulta perjudicado cuando la gente se empieza a ir y deja de jugar.","replies":[]}]}]}]},{"poster":"Revolución","date":"2015-03-09T12:58:02.585+0000","up_votes":3,"down_votes":0,"body":"El otro día estuvimos haciendo un ranked team en donde la composición era protección al híper carry, yo era el híper carry y la partida estaba muy pareja. En una team fight decisiva cerca del final hubo una sola persona en toda la partida a la que le ocurrió esto una única vez, adivinen a quién, y eso definió la derrota de mi equipo. La partida venía mal en principio para nosotros, luego empezamos a remontar y a tomar objetivos clave, veníamos en una muy buena levantada cuando esto ocurrió y por cómo se estaba dando la team fight y cómo estaban parados los contrarios tengo la impresión que en condiciones normales terminábamos ganando esa pelea y la partida.\n\nCon mis compañeros decidimos no volver a practicar esta composición porque el estado del servidor no da las garantías de que no vuelva a ocurrir esto.\n\nTengo la repetición de la partida, podría subir la partida entera y demostrar que realmente fue esa la razón de la derrota, pero no creo que logre solucionar nada y es todo un trabajo: abrir la repetición, abrir fraps, grabar toda la partida en vivo (50 minutos), abrir el conversor de video, pasar la partida a un formato más liviano (30 minutos), subirla a youtube (4 horas).","replies":[{"poster":"VampiroMedicado","date":"2015-03-09T18:44:11.879+0000","up_votes":1,"down_votes":0,"body":"Si queres pasala... Estoy al pedo y estaria para ver replays 8)","replies":[{"poster":"Revolución","date":"2015-03-09T18:58:35.511+0000","up_votes":1,"down_votes":0,"body":"podría subir el momento exacto de la team fight que te digo, como dije para subir la partida completa es un proceso que inutiliza mi pc al menos 5 horas","replies":[{"poster":"FallenDemonX","date":"2015-03-09T20:49:41.361+0000","up_votes":1,"down_votes":0,"body":"Pasa la edicion solo de la TF. Quiero ver la composición XD","replies":[{"poster":"Revolución","date":"2015-03-09T20:54:58.650+0000","up_votes":1,"down_votes":0,"body":"Estoy entrando en partida y subirla a youtube me daría mucho ping, después la subo. Por lo pronto te digo mi team era Lulu top, Maokai jg, Thresh supp, Syndra mid y yo Tristana. No era exactamente como yo la quería jugar, hubiera preferido un mid con más peel, pero hay que reconocer que una Q+E de Syndra puede servir de algo y Maokai como jg era más para tener una front line segura, quizás un Lee Sin hubiera estado mejor. Tristana es una excelente híper carry, pero yo esa partida tenía ganas de jugar Kog' Maw y por los picks enemigos siempre estuve más convencido que hubiera sido mejor. Ellos eran Garen top, Braum support, Kassadin mid, Kalista adc y Lee Sin jg.","replies":[]}]}]}]}]},{"poster":"Melodie","date":"2015-03-09T20:16:08.775+0000","up_votes":2,"down_votes":0,"body":"Es cierto lo que decis pero por algun motivo riot no esta respondiendo nada sobre quejas por el delay ni ping alto ni nada :C En mi caso si muestra el ping alto","replies":[]},{"poster":"MasterNightmare","date":"2015-03-09T15:29:08.448+0000","up_votes":2,"down_votes":0,"body":"Me ha pasado y la verdad es que es frustrante, sobretodo cuando ocurre en medio de una team fight o en una situacion donde tu reacción es clave a si vives o mueres. Al principio pensé que era mi internet: A veces estaba lo mas bien (entre los 50 y los 70 de Ping) y de repente me subía a mas de 1000...\nPero últimamente es distinto, me ocurre lo mismo que a vos: Ping y FPS normales, y de una segundo a otro ¡pum! Cartel de desconexión -.-\nLos servidores van cada vez peor... y la razón es que la cantidad de usuarios aumenta mas rápido de lo que Riot puede tolerar por servidor; por eso se crean los cuellos de botella.","replies":[]},{"poster":"Yagamii2k","date":"2015-03-09T20:12:52.008+0000","up_votes":2,"down_votes":1,"body":"FREE ELO CHILE","replies":[]},{"poster":"MissingDota","date":"2015-03-09T20:33:12.738+0000","up_votes":1,"down_votes":0,"body":"Leizham no quiero desvirtuar el tema, pero ya que tengo la posibilidad de encontrar a alguien que tenga tantos FPs te lo voy a preguntar. Como hiciste? Yo siempre tengo 80 y tengo una computadora que podría tirar para muchisimo mas, tengo i5, 8gb de ram, una placa de video de 2GB. Imaginate... \n\nMuchas gracias y perdón por el desvirtúe pero nunca nadie me pudo contestar...\nSAludos!","replies":[{"poster":"Leizham","date":"2015-03-09T21:17:19.523+0000","up_votes":1,"down_votes":0,"body":"yo tengo una Raden HD 5770, AMD Athlon 270X (como es una arquitectura vieja ya está recontra pulido el bicho xD, igual tu i5 probablemente sea mejor), más que nada cuestion de apagar algunos procesos que comen mucho procesador que normalmente están de base, hay que tener mucho cuidado con esto por que muchos procesos sirven para más cosas que las que dicen pero me los conosco bastante, otra cuestion es que el procesador aunque se la banque que igualmente trabaje lo más frio posible, y tengo las ram a 1600Mhz, eso te levanta aunque no mucho, el rendimiento general del sistema en todo ámbito. Usualmente a menos que ponga algo pesado en Java (que se devora todo xD) el uso del procesador no pasa del 30%.\n\nPor otro lado es algo más de lo que logro usualmente... normalmente entre los 120~160, pero en este caso capáz subió hasta casi los 190 por que el juego no tenía otra cosa que hacer que esperar a reconectar xD","replies":[]}]},{"poster":"Dixon Daryl","date":"2015-03-09T06:33:45.439+0000","up_votes":1,"down_votes":0,"body":"He escuchado que en el server euw les esta pasando lo mismo y va empeorando con cada parche !! igual que a nosotros.!","replies":[{"poster":"Leizham","date":"2015-03-09T21:04:45.491+0000","up_votes":1,"down_votes":0,"body":"También juego en el sv euro con unos amigos, y sí, a ellos tb les pasa y sí, empeora con cada parche, pero igual allá el ping puede ser bestial xD\n\nTienen más problemas de ping que nosotros, con diferencia, pero con 250 de ping allá yo juego como si tuviese 80 o 100 acá, no al 100% pero relativamente  cómodo.","replies":[]}]},{"poster":"Peter","date":"2015-03-09T20:17:35.659+0000","up_votes":1,"down_votes":0,"body":"Nice Server Riot.","replies":[]},{"poster":"ALEXKOND","date":"2015-03-09T17:16:31.624+0000","up_votes":1,"down_votes":0,"body":"De momento vengo safando de este problema pero la semana pasada me ocurrió en un par de partidas donde era 1 min de juego normal y luego micro cortes, y siempre en los momentos claves, nunca cuando estaba en base comprando {{summoner:3}} \n\nP.D: Dat FPS, yo con suerte oscilo entre 25 y 35","replies":[]},{"poster":"Maldito Tomi","date":"2015-03-09T05:15:07.585+0000","up_votes":2,"down_votes":4,"body":"Por lo general anda bien, yo por suerte ahora juego mucho menos, antes me volvia re loco cuando me pasaba eso, cuando ande asi de mal no juegues, no hay otra solucion, por lo general, no es problema de riot, sino de la interconeccion entre argentina y chile y no se que.","replies":[{"poster":"Leizham","date":"2015-03-09T21:10:19.318+0000","up_votes":1,"down_votes":0,"body":"A mi, a mis sobrinos y a un amigo no nos quedó otra que darle duro al minecraft esperando que el server funque mejor xD","replies":[]}]},{"poster":"Windhorn","date":"2015-03-09T12:38:02.371+0000","up_votes":2,"down_votes":4,"body":"Mirá, no sé qué problema tengas. Yo hasta la fecha estoy jugando muy bien, sin ningún tipo de drama. De cualquier modo, si tuviese un problema así, lo primero que haría en tu lugar sería reparar el cliente (si es que no lo hiciste) y limpiar el registro de la pc usando CCleaner.","replies":[{"poster":"Leizham","date":"2015-03-09T21:07:46.020+0000","up_votes":1,"down_votes":0,"body":"El CCleaner es pura verdura xD , igual, acá tengo 4PCs y en todas les puede pasar lo mismo (y les ha pasado unas cuantas veces) y a más gente que conosco","replies":[]}]}]}