{"poster":"K6 VoidHunter","date":"2017-11-27T03:44:49.900+0000","title":"Un estudiante que no puede dormir se desahoga en un post.","subforum":"Off-topic y temas personales","up_votes":6,"down_votes":2,"body":"Yo durante todo el ciclo lectivo estuve a full; Estudiando, trabajando para sacar las mejores notas por puro orgullo. No fue f&aacute;cil para nada, pero todo tiene su compensaci&oacute;n al fin y al cabo, me es suficiente con la autosatisfacci&oacute;n que puede provocar.\r\n\r\nAhora mismo son las 12:33 y ma&ntilde;ana tengo colegio. &iquest;Qu&eacute; hago despierto? Y nada, como todas las semanas, un trabajo jodidamente largo sin sentido que luego el profesor corrige en 2 minutos... Pero yo me la tengo que pasar sentado frente al libro, copiando, razonando y armando muchos cuadros durante m&iacute;nimo 8 horas.\r\n\r\nLa semana pasada estuve desde las 7 (De la tarde, o de la noche como quieran decirle) hasta las 7 (De la ma&ntilde;ana) en un trabajo. &iexcl;Yo a las 7 de la ma&ntilde;ana voy al colegio, no pude dormir en toda la noche haciendo un maldito trabajo de secundaria! Y aunque no lo crean, la profesora lo corrigi&oacute; en menos de 30 pu&ntilde;eteros segundos. No es la primera (NI DE LEJOS) ni ser&aacute; la &uacute;ltima vez que hago un trabajo de 12 horas o mas.\r\n\r\n&Eacute;sto es una tortura mental para mi, el da&ntilde;o neuronal irreversible que me hace estar tanto tiempo en mi escritorio, sentado, es insano. &Uacute;ltimamente estoy mentalmente enloqueciendo con cada noche que pasa, no recuerdo la &uacute;ltima vez que me fui a la cama sin preocupaciones o angustias respecto al &aacute;mbito escolar, mas espec&iacute;ficamente de los estudios.\r\n\r\nSi yo estoy asi ahora, en secundaria ni me imagino c&oacute;mo va a ser en la facultad de f&iacute;sica (Una de las carreras mas dif&iacute;ciles del pa&iacute;s).\r\n\r\nYo estoy a punto de dejar todo. De agarrar, abrochar a lo que tengo echo, que no da ni para un 5 y a la mierda todo. El enfado que tengo encima me est&aacute; matando, y mas a estas alturas del a&ntilde;o donde uno lo &uacute;nico que quiere es que ya sean vacaciones y poder dormir 8 horas por dia como la gente civilizada, que en nuestra sociedad cada vez hay menos por la increible preci&oacute;n que provocan los de arriba.\r\n\r\nAdem&aacute;s de no pasarla bien, no me queda absolutamente NADA, me voy a olvidar de todo esto en 2 horas y no voy a saber nada del tema a futuro lejano.","replies":[{"poster":"LightDagger","date":"2017-11-27T04:03:50.424+0000","up_votes":2,"down_votes":0,"body":"Una siestita de 1 o 2hs es lo que hago cuando tengo que hacer un trabajo que lleva mucho tiempo, sirve más que trabajar de corrido (cuando es por la noche que tengo que hacerlo).","replies":[{"poster":"K6 VoidHunter","date":"2017-11-27T04:10:31.432+0000","up_votes":1,"down_votes":0,"body":"Yo me pongo el despertador y aun asi, se despierta toda mi familia antes de que yo pueda despertarme. Y si me despierto, empiezo con el \"5 minutos mas\" hasta que se hace demaciado tarde.","replies":[]}]},{"poster":"Evanz","date":"2017-11-27T04:28:16.391+0000","up_votes":1,"down_votes":0,"body":"Muchachito! lo que te espera en la universidad no es comparable a lo que te pasa ahora, trabajos que te llevan semanas no horas, profesores que se limitan a dar su explicación y ya está. si entendiste bien, sino ahí tenes los apuntes, y si vas a estudiar fisica. te recomiendo tener mucha pero mucha fluidez con las matematicas.","replies":[{"poster":"K6 VoidHunter","date":"2017-11-27T04:41:14.302+0000","up_votes":1,"down_votes":0,"body":"> te recomiendo tener mucha pero mucha fluidez con las matematicas.\n\nEstoy jodid*.\nYa se que el 50% es matemáticas, pero aun asi me apaciona todo lo teórico respecto a física.\nNo tengo nada bien definido.","replies":[{"poster":"Evanz","date":"2017-11-30T00:37:41.670+0000","up_votes":1,"down_votes":0,"body":"es hermosa la fisica! de hecho, la fisica teorica es para mi una cuestion pendiente en mi vida. Mucha suerte!","replies":[{"poster":"K6 VoidHunter","date":"2017-11-30T01:57:26.259+0000","up_votes":1,"down_votes":0,"body":"Math`s wins!","replies":[]}]}]}]},{"poster":"fenixerege","date":"2017-11-27T12:46:26.992+0000","up_votes":1,"down_votes":0,"body":"yo trabajaba mientras estudiaba como vos, no me costo nada\ny cuando termine me puse mi propio negocio, no es obligacion seguir estudiando","replies":[]},{"poster":"Tortuguita","date":"2017-11-27T12:15:27.836+0000","up_votes":1,"down_votes":0,"body":"Organización , este universo siempre nos da el tiempo justo y indicado (hasta de sobra) para completar nuestras obligaciones sin recibir daño en nuestro comportamiento pero para eso debes aplicar lo anterior a un nivel muy decente.\nMejora ese aspecto y el resto fluirá como el caudal de un rió. Suerte !\n\nPD: Y si es una cruda verdad , la forma en la que la sociedad , su estructura , esta creada es totalmente abominable contra cualquier ayuda para mantener o promover a tu felicidad. Es el mayor y peor error que ha creado el ser humano pero a su vez es la que impulsa a su progreso , algún día cambiara o tal vez no.","replies":[]},{"poster":"Sushi and Beer","date":"2017-11-27T09:17:43.735+0000","up_votes":1,"down_votes":0,"body":"si lo corrige en 2 minutos sera por que el ya estudio todo eso?  sera por que es el profesor y vos el estudiante?","replies":[{"poster":"Tortuguita","date":"2017-11-27T12:07:30.898+0000","up_votes":1,"down_votes":0,"body":"30 segs dijo , debe tener como 20 paginas y existen profes que ven las 5 primeras (30 segs) y califican sin mas ni menos xD. Estamos hablando de la secundaria ojo , en la uni eso esta bien.","replies":[]}]},{"poster":"Mazer Rakham","date":"2017-11-27T12:07:11.734+0000","up_votes":1,"down_votes":0,"body":"Consejos:\n\nProcrastinación, no! Si tenes un trabajo para la semana que viene hacelo hoy mismo. \nDescansa siempre que lo necesites.\nSaca toda fuente de distracción de tu ambiente.\nPonete música clásica para estudiar o hacer trabajos (a mi lo que más me gusta para estudiar es Bach)","replies":[]},{"poster":"MILFortune","date":"2017-11-27T06:44:32.956+0000","up_votes":1,"down_votes":0,"body":"Las alteraciones de humor que te producen no dormir y estar sentado mucho tiempo, son inaceptables. DaVinci no paraba de estudiar y trabajar pero tenía un método que lo mantenía cuerdo y fresco como una lechuga: tomaba siestas de 15-20 minutos cada 3 horas. Y si de repente sentía \"fiaca\" como le decimos acá, no dudaba y se echaba un rato a dormitar","replies":[]},{"poster":"TSW Rorschach","date":"2017-11-27T05:46:55.280+0000","up_votes":1,"down_votes":0,"body":"Me pasó eso con química en el último año de secundario, nos daban trabajos prácticos impresionantemente extensos, llevaban una semana hacerlos  y la profesora tenía una actitud tan bipolar que a veces ni siquiera te aceptaba el trabajo **de una semana entera**, sin razón alguna. Fue muy frustrante para mi ese año xD terminé con cambios muy fuertes de sueño y al día de hoy me cuesta dormir a una hora que no sea antes de las 3-4. Ahora con el tema de los parciales no dormí casi en esta semana. Pero nunca me importó mucho(?\n\nPensá que estás a nada de que se termine todo. Si podés, tratá de tomarte un pequeño descanso o siesta entre horas para no estresarte tanto. Salite a caminar una vuelta, algo así para aclararte la mente, hacé la fotosíntesis al menos(? jaja.","replies":[]},{"poster":"SecretWindow","date":"2017-11-27T04:14:23.522+0000","up_votes":1,"down_votes":0,"body":"amigo...siento tu dolor, la verdad que si, vivimos en un mundo bastante loco y enfermo, muy poco practico, parece que la felicidad es algo que a la sociedad no le interesa, yo tambien cuando tengo que hacer practicos o estudiar me enojo porque es tanto esfuerzo para practicamente nada, te mando un abrazo y te recomiendo no jugar al lol, sino los estudios se vuelven mas dificiles de llevar adelante","replies":[{"poster":"K6 VoidHunter","date":"2017-11-27T04:16:53.188+0000","up_votes":1,"down_votes":0,"body":"Tus palabras de aliento me llegaron en el cora.\nGracias, nunca pensé que alguien me entendería. Creí que dirían \"Ah, vas a ver lo que te espera luego\" \"Pero qué niño vago\" \"Secundaria no es nada\"...\n\n> te recomiendo no jugar al lol, sino los estudios se vuelven mas dificiles de llevar adelante\n\n¿Y qué otra droga voy a consumir a partir de ahora?\nSi no es LoL, otra cosa será... Es lo mismo que nada.","replies":[]}]}]}