{"poster":"Pall Mall Rojo","date":"2016-03-29T21:44:07.576+0000","title":"Duda con los fragmentos de llave","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"hace rato me falta solo un fragmento de llave, he ganado ya normales y rankeds, he sacado &#039;&#039;S&#039;&#039; ganado las partidas y aun as&iacute; no me dan nada hace ya unos 5 d&iacute;as, por eso si alguien me puede decir si es pura suerte el que te salgan llaves, ya que me hab&iacute;an dicho que solo ganando partidas te las daban.\r\nSaludos","replies":[{"poster":"Whitesse","date":"2016-03-29T23:36:08.988+0000","up_votes":1,"down_votes":0,"body":"Yo abri 4 cofres ya y sin comprar llaves o los pack de cofre y llave.\nEs suerte, no te va a tocar siempre, la onda del sistema este es que tengas aunque sea un skin gratis cada sierto tiempo, no cada 2 días.","replies":[]},{"poster":"gustavo197","date":"2016-03-29T23:26:06.493+0000","up_votes":1,"down_votes":0,"body":"yo gano partidas y lo único que me dan son S y no las llaves para mi que esta bugeado","replies":[]},{"poster":"TeemoTankeTiamat","date":"2016-03-29T21:54:20.288+0000","up_votes":1,"down_votes":0,"body":"es suerte y cada vez que consigas un fragmento de llave el siguiente será más difícil de conseguir.","replies":[{"poster":"RaynTL","date":"2016-03-29T22:18:00.665+0000","up_votes":1,"down_votes":0,"body":"Bueno pero llevo dos dias ganando en todos los modos con campeones que tengo saco S ni cofre ni llave ta buggeado el sistema y sobre el cofre ya entiendo el sistema que cada tanto te dan un cofre","replies":[{"poster":"danye15000","date":"2016-03-29T22:23:02.609+0000","up_votes":1,"down_votes":0,"body":"pues no se que deecirte (tampoco se porque escribo si no puedo ayudarte) a mi me anda y saque ya las 4 cajas iniciales y... espera, tenes alguna sancion vigente? en ese caso no podes conseguir cofre por un tiempo","replies":[]}]}]},{"poster":"2l2","date":"2016-03-29T22:11:34.797+0000","up_votes":1,"down_votes":0,"body":"Creo que hay un bug, yo igual llevo sin poder conseguir fragmentos, además hay un bug en la tienda, que al comprar muchos cofres se bugea, se queda pegado y te dan mas cofres de lso que compraste","replies":[]},{"poster":"RaynTL","date":"2016-03-29T21:59:26.728+0000","up_votes":1,"down_votes":0,"body":"Ta buggeado Saque S y no me dan ni caja ni fragmentos de llave y llevo dias que no me dan nada y nadie parece que no le importa","replies":[{"poster":"danye15000","date":"2016-03-29T22:01:46.201+0000","up_votes":1,"down_votes":0,"body":"el fragmento es aleatorio y cada vez que consigues 1 el siguiente se hace mas dificil pero las probabilidades se reinician todos los meses. la caja al inicio podes conseguir 4 y despues de estas 1 cada semana pero nunca con 1 campeon que no poseas o ya haya ganado caja esta temporada","replies":[]}]},{"poster":"Ksual Gira","date":"2016-03-29T22:00:35.732+0000","up_votes":1,"down_votes":0,"body":"A mi me paso lo mismo.Hace un tiempo me saque una ¨S¨ y me dieron un cofre y ahora no me dan nada","replies":[]}]}