{"poster":"Blueclaws","date":"2017-07-14T00:48:28.175+0000","title":"DirectX Error","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I just patched the client to the newest version. I have not had this error before, nothing on my system has changed since before the patch. I am currently using the most updated version of DirectX, Graphics Drivers etc. \r\n\r\nI keep getting this every time I try to enter a game since the patch. \r\n\r\n\"An unknown DirectX error has occurred and League of Legends cannot start. Please make sure your video card is using the latest video drivers from the manufacturer.\"","replies":[{"poster":"Broporo","date":"2017-07-14T01:59:58.008+0000","up_votes":1,"down_votes":0,"body":"I'd first check that you do still have the most recent [**DirectX updates **](https://support.microsoft.com/en-us/help/179113/how-to-install-the-latest-version-of-directx) juuuuuuust in case one was missed or reverted somehow. Once that's done, make sure you go through all the steps in our [**FPS guide**](https://support.riotgames.com/hc/en-us/articles/201752684-Low-Frame-Rate-FPS-Troubleshooting) if updating directx wasn't able to get you up and running.","replies":[{"poster":"Blueclaws","date":"2017-07-26T02:42:27.338+0000","up_votes":1,"down_votes":0,"body":"I have went through and tried every thing on my end that could help with a graphical issue.  The day after I made the original post, I booted up my PC and the league client started working just fine, it has been working fine since with no issues. Today it showed up again and restarting my PC doesn't seem to help at all. I went down the FPS Guide and nothing there has fixed the issue.\n\nHelp me Broporo, you're my only hope.","replies":[{"poster":"Broporo","date":"2017-07-28T00:22:39.914+0000","up_votes":1,"down_votes":0,"body":"http://i.giphy.com/QwH7v7J1tBrq0.gif\n\nHuh....that's pretty odd that League would start working normally after a restart, and then after the next restart stop working again =\\ . Try running a repair with our [**Hextech Repair Tool**](https://support.riotgames.com/hc/en-us/articles/224826367-Automated-Troubleshooting-Hextech-Repair-Tool), and if that still doesn't help hit up our tech guys in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new)!","replies":[{"poster":"Blueclaws","date":"2017-07-28T01:04:46.465+0000","up_votes":1,"down_votes":0,"body":"https://media.giphy.com/media/3o6vY4TH9Nc3zmADAc/giphy.gif","replies":[{"poster":"Broporo","date":"2017-07-28T01:30:12.027+0000","up_votes":1,"down_votes":0,"body":"What can I say? I really like Boku no Hero Academia okay xD","replies":[{"poster":"Blueclaws","date":"2017-07-28T03:08:12.450+0000","up_votes":1,"down_votes":0,"body":"I just recently watched the new Castlevenia on Netflix, you should check that out. {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Broporo","date":"2017-07-28T03:26:18.301+0000","up_votes":1,"down_votes":0,"body":"Bruh I binged that the day it came so. SOOOOOOOOOOO GOOOOOOOOOOOOOD","replies":[]}]}]}]}]}]}]},{"poster":"Rackier","date":"2017-07-28T02:05:15.642+0000","up_votes":1,"down_votes":0,"body":"reinstall this as admin\n\nhttps://www.microsoft.com/en-us/download/details.aspx?id=8109\n\nthis is happening from the game, not client, right?","replies":[{"poster":"Blueclaws","date":"2017-07-28T03:10:01.781+0000","up_votes":1,"down_votes":0,"body":"It happens right after champ select before the game can load, but not all the time which is really odd.","replies":[]}]}]}