{"poster":"The Ecdysiast","date":"2016-09-01T19:20:02.641+0000","title":"PSA: This isn't WoW, Warframe, or TERA","subforum":"Player Behavior","up_votes":2,"down_votes":18,"body":"Important: If you don't play other competitive games, don't comment. Don't vote. This is for discussion between players who actually know what it's like in different games-- not players who are new to competitions or play nothing PvP besides League. \n\n\nJust to list a few games where players have incentive to be polite to each other, and have little reason to be mad at anyone. \n\nThis is a competitive Player vs. Player game. Riot doesn&#039;t seem to understand that concept in regards to player interaction. They want to baby anyone with glass bones and paper skin as if the experience this game offers were the same as a Player vs. AI game. It&#039;s not.\n\nHere, whether you win or lose can be decided by things other players do. And you can&#039;t redo a match. The interactions that coincide with that _cannot_ be expected to match games that have no such hindrances to solo play. \n\n\nThere&#039;s a mute button for a reason. This isn&#039;t a game where some level 70 players is going to hand you his leftovers from 60 levels ago out of the kindness of his heart. It&#039;s a game where, like any other competitive game, a high ranked player will laugh in your face to make himself feel better about wasting time. \n**Unless he's threatening you, your mother, your race, your religion, or your sex**\n\n--- don't bother reporting. All that does is reduce the number of paying customers keeping this company in business. \n\n\n**Important: No, I've never been punished for \"verbal abuse\" or \"harassment.\" I got Lord Mordekaiser from one free gift from Riot and Karma from the other. But it's incredibly unnerving how little Riot cares about players, to force them out of the game just for talking the way their type of game makes people talk. While players who ruin matches intentionally with their play go unpunished. ","replies":[{"poster":"EvilDustMan","date":"2016-09-01T22:08:28.500+0000","up_votes":4,"down_votes":0,"body":"Maybe it's time for people to stop being dicks in competitive games.","replies":[]},{"poster":"MissingKayo","date":"2016-09-01T19:53:52.257+0000","up_votes":4,"down_votes":0,"body":"Nah.","replies":[]},{"poster":"redniwediS","date":"2016-09-01T19:26:51.698+0000","up_votes":2,"down_votes":1,"body":"The sad thing is that some people require intensives in order to not be assholes...\n\nI play games like League to compete, not to watch people who can't control their emotions go off on one another.  If someone can't keep themselves in line I see no legitimate reason not to report them.","replies":[{"poster":"The Ecdysiast","date":"2016-09-01T19:31:29.563+0000","up_votes":1,"down_votes":3,"body":"There's a mute button for everyone. There's no excuse not to use it if players can't handle the type of things gamers will say regularly.","replies":[{"poster":"RcGjWO640w","date":"2016-09-01T19:37:51.050+0000","up_votes":5,"down_votes":1,"body":"Your logic is that just because someone can mute them means that whatever horrible things they say are suddenly okay.\n\nThat's not how it works. Everyone deserves to play a game for entertainment without having some 16-year-old flaming and raging at them for 40 minutes. If you can't control the shit that you say, that's on you.","replies":[{"poster":"The Ecdysiast","date":"2016-09-01T19:41:21.631+0000","up_votes":1,"down_votes":3,"body":"Well, you're right and wrong. \n\nI'm not saying it's okay. I even stated what isn't. But having some stranger slightly hurt your feelings for less than an hour because you played a little poorly--or too well-- on a video game isn't justification for having the game steal money from them. \n\n\nBut yes. Everyone deserves to play the game without that. WHICH IS WHY THERE IS A MUTE BUTTON AT ALL. _Utilize it._","replies":[{"poster":"RcGjWO640w","date":"2016-09-01T20:00:50.556+0000","up_votes":3,"down_votes":0,"body":"You should read the Terms of Service sometime. They're pretty clear on the fact that you don't own anything. You pay for _access_ to the skins, champions and whatnot. They reserve the right to revoke that access at any time if you're being a dick.","replies":[]}]}]},{"poster":"redniwediS","date":"2016-09-01T19:38:15.534+0000","up_votes":2,"down_votes":1,"body":"And?  Mute buttons don't get people punished for poor behavior.  I'll gladly mute people so that I can actually make use of timers and comments from people on my team who are actually trying, but the moment someone decides to be an asshole they have earned a report from me.\n\nThere's no good excuse to allow that kind of behavior in a competitive setting.  If you can't control yourself you simply should not be allowed to compete.","replies":[{"poster":"The Ecdysiast","date":"2016-09-01T19:42:45.157+0000","up_votes":1,"down_votes":1,"body":"Well... There is, actually. There's no excuse to expect a competitive game's players to act different from what's become the norm for competitive games. If you don't play other competitive games, then it's on you to learn what the norm is. \n\nThe claim that the type of game lends nothing to behavior is completely false. No matter how many players get their money stolen from them, there's always going to be more players who talk a little rude-- _because that's the kind of game this is._","replies":[{"poster":"redniwediS","date":"2016-09-01T19:56:14.762+0000","up_votes":1,"down_votes":0,"body":"You're forgetting that each and every one of us agreed to certain behavioral guidelines.  That is why we can expect players to behave themselves, and that is why your points fall flat.\n\nWhether that should or should not be the case is a very different topic, but whether or not players should currently be held to a behavioral standard is pretty clear.","replies":[]}]}]}]}]},{"poster":"RcGjWO640w","date":"2016-09-01T19:25:25.560+0000","up_votes":4,"down_votes":1,"body":"The only thing that makes someone a dickhead is themselves. No game or person can make anyone do or say anything. When you tell people \"fking %%% feeedeers. Boosted morons, go kill yourself!\", that's you saying it, not the game.","replies":[{"poster":"The Ecdysiast","date":"2016-09-01T19:28:10.245+0000","up_votes":1,"down_votes":0,"body":"That's threatening. I covered that as something that isn't okay. \n\nBut calling people feeders is nothing more than a MOBA jargon. The term was coined by MOBA players and is about the state of the game.","replies":[{"poster":"GaleWinUnleashed","date":"2016-09-01T19:40:59.801+0000","up_votes":1,"down_votes":0,"body":"Even so, you don't have to phrase it in such a rude manner. Instead, find a way to say \"please try harder not to die\" that doesn't come off as sarcastic. It doesn't cost you anything to *not* be insulting.","replies":[{"poster":"The Ecdysiast","date":"2016-09-01T19:48:14.768+0000","up_votes":1,"down_votes":0,"body":"Unfortunately, that will still lead to a report. Because there are too many players who don't know what online interactions are like. Hell, some players even report for Advice that they clearly need but \"don't want.\" ","replies":[{"poster":"GaleWinUnleashed","date":"2016-09-01T19:49:44.327+0000","up_votes":1,"down_votes":0,"body":"Then take that into account too, and don't say anything at all. That takes even less effort than trying to be positive.","replies":[{"poster":"The Ecdysiast","date":"2016-09-01T19:51:58.298+0000","up_votes":1,"down_votes":0,"body":"Like I said in the post, I haven't been punished for this. I don't need advice on what to do. I know and I do it. \n\nThe thread's for all the other players who get wrongfully punished just because Riot likes to coddle extremely casual, new players in the hopes they'll stay when game changes make the old players leave.","replies":[]}]}]}]}]}]},{"poster":"Kitty Cat Tosha","date":"2016-09-01T20:14:01.776+0000","up_votes":2,"down_votes":0,"body":"Yep, it is a competetive game. So I do not tolerate anyone who is actively trying to lessen my chances to win. And whether you like it or not - flaming DOES decrease your chance to win. That mute button is not going to change that - by the time I use that, the damage to the team morale and the game have already been done.\n\nI would expect someone who is truly competetive to actually BE competetive, which means trying their hardest to increase the chance of a win by any means possible. And not flaming (or better yet: being positive and supportive towards your team) is one of those means. \nSo yes, I will report flaming players - if only to prevent others from getting matched with them in other games.","replies":[]},{"poster":"Randomonium","date":"2016-09-01T19:58:47.226+0000","up_votes":2,"down_votes":0,"body":"I don't really care if its in a video game or if its in real life, you shouldn't be an ass to someone.  That's just common sense.  If you act like an ass, there are repercussions.  That might mean that you get you ass kicked or you get fired from your job or you get suspended from school.  In video games, since you are anonymous, the only thing that we can do is get your account banned.  I'm all for Riot banning people because it teaches losers who think its cool to be a dick to people online that your actions have repercussions.\n\nIts not about babying people.  Its about treating people with the respect that they deserve.  If you're not mature enough to do that then that's your problem.","replies":[]},{"poster":"Xidphel","date":"2016-09-01T23:40:57.230+0000","up_votes":1,"down_votes":0,"body":">Important: If you don't play other competitive games, don't comment. Don't vote.\n\nDownvote","replies":[]},{"poster":"MagicFlyingLlama","date":"2016-09-01T19:57:28.123+0000","up_votes":1,"down_votes":0,"body":"I see no reason to tolerate being put in a game with screaming degenerates. Nobody misses the worthless if they get banned.\n\nI can quite safely say the Warframe and WoW both have far worse communities than LoL does, and i would assume TERAble is similar, by its reputation. You are simply not forced to play with the rager scum and tryhard elitrash, unlike here, where you have to make some effort at cooperating with them for 30 or 40 minutes.","replies":[]}]}