{"poster":"Fancer","date":"2015-11-18T19:46:45.287+0000","title":"Me corre el lol en un lenovo g5030?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Me.compre uno reci&eacute;n. 4 gb RAM, 1 TB memoria, Procesador Intel Pentium, tarjeta gr&aacute;fica 1 GB. Me corre sin problemas?","replies":[{"poster":"Tesnologo1","date":"2015-11-18T22:08:03.541+0000","up_votes":1,"down_votes":0,"body":"Yo corro con este tarro 720p 30-60 Fps todo en muy alto (nunca bajones):\n\nIntel Pentium D925 3.0 GHz\nRam 2 Gb Ram DDR2\n9500 GT 1 Gb DDR2\nHDD 320 Gb\nWin 7\n\n(Pc del 2008)","replies":[]},{"poster":"SKT T1 Smoke","date":"2015-11-18T19:57:58.451+0000","up_votes":1,"down_votes":0,"body":"Da mas especificacion sobre la tarjeta y el procesador.","replies":[{"poster":"Fancer","date":"2015-11-18T20:27:36.534+0000","up_votes":1,"down_votes":0,"body":"Este es amigo,http://cyber.ripley.cl/product/?partNumber=2000353061695P","replies":[{"poster":"SKT T1 Smoke","date":"2015-11-18T20:42:34.548+0000","up_votes":1,"down_votes":0,"body":"No te podria decir con exactitud, porque en las especificaciones solo dice Tarjeta de Video Gráfica Nvidia 1 GB. Tendria que saber que modelo es, ya que la tarjeta de video es la que influye en los FPS.\n\nPero con los datos que veo en la pagina, te puede ir el lol en una configuracion bajo-medio.\n\nEdito: No te lo recomiendo mucho, por lo que vi tiene una tarjeta de video muy pesima, te andaria pero en todo bajo y muy lageado, te recomiendo que busques otro con una buena video.","replies":[{"poster":"Fancer","date":"2015-11-18T21:16:48.001+0000","up_votes":1,"down_votes":0,"body":"Bien, gaste mis ahorros en vano...","replies":[{"poster":"Fancer","date":"2015-11-18T21:17:58.839+0000","up_votes":1,"down_votes":0,"body":"Igual me parece raro, tenia un lenovo con tarjeta 512 mgb 4 RAM y procesador celeron y el lol me andaba rebien solo con problemas de desconexión pero nada de lag que lo asocio mas a problemas de internet","replies":[{"poster":"SKT T1 Smoke","date":"2015-11-18T22:05:47.079+0000","up_votes":1,"down_votes":0,"body":"Creo que estas pensando que entre mas mb una tarjeta es mejor, no es asi, todo depende del modelo y sus capacidades, los mb de una tarjeta solo sirven para dar mas espacio para las aplicaciones como juegos, videos y funciones que cumpla la tarjeta, no se mi explico bien xD. funciona como una ram, pero solo para juegos.\n\nY Como te dije cada tarjeta de video es un modelo diferente, diferentes capacidades, ojo no pienses que una tarjeta de 2gb es lo maximo y te correran todos los juegos, hay tarjetas de 1gb y hasta menos que pueden correr los ultimos juegos.\n\ny por el procesador, bueno es de un solo nucleo y pocos mhz, por lo que no es tan buena.\n\nPD: Si te la compraste hace menos de un mes creo que puedes ir a devolverla y que te devuelvan tu dinero.","replies":[]}]}]}]}]}]},{"poster":"SuperLoky","date":"2015-11-18T21:27:57.991+0000","up_votes":1,"down_votes":0,"body":"No se te ocurrio preguntarlo antes de comprarla? porque ya una vez comprada...","replies":[]},{"poster":"Lazengan","date":"2015-11-18T21:27:31.062+0000","up_votes":1,"down_votes":0,"body":"Yo tengo una Lenovo G555 y me anda bastante bien, graficos, efectos, todo muy bajo, pero me lo tira.\n3 gb de ram, Procesador AMD Athlon II Dual-core M320 2.1 Ghz","replies":[]},{"poster":"Hwaxinghz","date":"2015-11-18T21:23:20.327+0000","up_votes":1,"down_votes":0,"body":"Creo que te quedas corto con el procesador. Pero habría que intentarlo. Si tiene 1gb de vídeo como dices debería andar bien, pero de nuevo, insisto, busca notebooks que tengan mucho procesador porque las GPU (núcleos de vídeo o \"placa de vídeo\" propiamente dicha) se simulan dentro del procesador, y si tiene uno con capacidad media pobre (como un Pentium) vas a tener problemas a la hora de jugar correctamente.\n\nPor ejemplo: Tengo una notebook con un Procesador Intel Core i5 4670k de 4 GHZ, 8 gb de ram, disco de 1 tb y sin placa de vídeo (pero mi GPU tiene memoria gráfica de 256mb, y una extensión de 4gb de video tomados de RAM), con lo que se puede decir que tiene 4gb de vídeo Intel HD Grapics 4500. La uso para programación y hacer simulaciones (por curiosidad les comento). Con eso me corre el LoL con gráficas al máximo (haciendo Gameplay con OBS incluido) a 60 fps sin bajones.\nY tengo un amigo que tiene una notebook con un Pentium de 3.4 GHZ , 4 gb de ram, 512 gb de disco y sin placa de vídeo (pero con el GPU con 2 gb de vídeo sacada de RAM), le corre el LoL a 30 fps con todo al mínimo y con bajones en TF's. Por eso te digo, el procesador es muy importante a la hora de elegir una buena Notebook. Te recomendaría un Intel Core i3 mínimo (de serie de Intel), o un AMD Turion 2 de 3 GHZ (de la serie de AMD, solo que a esta se le debe añadir si o si una placa de vídeo ATI extra) para que funcione bien para el LoL o algún otro juego pequeño.\n\nNo suelo recomendar notebooks para jugar, pero bueno, en mi caso por comodidad puedo usarla y no me trae complicaciones porque tiene mucha potencia, pero como te digo, las notebooks no están hechas para juegos.","replies":[]}]}