{"poster":"Pollo al Ornno","date":"2018-11-17T13:23:22.334+0000","title":"Tipos de flamers","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"1- (el mas normal) El que se pone a insultar cuando le va mal y se tiltea\r\n\r\n2- El que flamea de entrada (ya desde el lobby) porque no le gust&oacute; un pick o no gano la linea que el quer&iacute;a jugar\r\n\r\n3- El que se pone a hablar puramente por el /all dando mas importancia al chat que al game (seria un flamer tipo &quot;1-&quot; pero mas &quot;avanzado&quot; digamos)\r\n\r\n4- El que da ordenes de mala manera, tratando despectivamente a sus compa&ntilde;eros, sin parar crey&eacute;ndose que se sabe todas y es Faker hard-stucked en plata III\r\n\r\n5- El buen y viejo confiable compa&ntilde;ero que pierdes un minion (en caso que vayas adc y &eacute;l support) y ya te esta tirando 48 pings\r\n\r\n6- El que a la primera que haces algo mal ya esta pidiendo por el chat /all tu report (sin parar)\r\n\r\n7- Los que generan un ambiente negativo por sus comentarios llenos de odio e iron&iacute;a\r\n\r\n8- Los xen&oacute;fobos que por ser chileno, por ejemplo, te dicen cosas como &quot;te va a tragar el mar&quot; &quot;no sabes hablar&quot; &quot;chileno de mierd*&quot; &quot;chileno tenia que ser&quot;, o si sos argentino, &quot;islas Falkland&quot; &quot;narigon klo&quot; &quot;argensimio&quot; &quot;nargentino&quot;, etc\r\n\r\n9- (el mas molesto de toda la lista) Ese que por no haberlo gankeado una vez muere y entonces ya se rinde y se la pasa insultando y escribiendo por el chat /all diciendo lo malo que es su team y lo tr&aacute;gica que es su vida por jugar con 4 mancos de ese calibre, y por lo tanto decide quedarse o en base sin hacer nada pero escribiendo tirando mala onda a todos o directamente decide intear para arruinarte completamente la partida por una estupidez\r\n\r\n10- Ese que cuando va mal y le dicen que, por ejemplo, &quot;juegue pasivo as&iacute; no muere mas&quot; empieza a decir que la season pasada fue challenger, que jugo con Faker, que fue a la guerra de vietnam, que b&aacute;sicamente es un h&eacute;roe y si no fuera &quot;porque tiene poco tiempo para jugar&quot; estar&iacute;a top 1 del server as&iacute; que mejor no le digamos nada que este es dios\r\n\r\n11- Ese que culpa al lag al ir mal (cuando realmente no tiene lag) y se pone muy pesado diciendo a los dem&aacute;s que su internet es malo y esas cosas\r\n\r\n12- El t&iacute;pico AFK-Farming que por no haberlo gankeado cuando quiso decide no ayudar mas al team (mayormente esto ocurre en la linea de Top) por lo tanto se queda AFK en su linea sin importar que tan avanzado vaya el rival por las dem&aacute;s lineas.\r\n\r\n13- Parecido al &quot;11-&quot;, pero en vez del lag es &quot;lo re-contra roto que esta el champ que esta usando el rival de linea y lo f&aacute;cil que es de jugarlo entonces el no tiene manos por jugar cosas tan f&aacute;ciles que yo maineo cosas dif&iacute;ciles porque soy un pro y que vos sos un manco por jugar LeBlanc y matarme de 2 hits como un pussy&quot;\r\n\r\n_**&iquest;Cu&aacute;l de estos 13 tipos de flamers te encuentras mas en tus partidas? &iquest;Cu&aacute;l te molesta que te toque mas? &iquest;Cual es el mas influyente en cuanto al resultado de la partida? &iquest;Te sent&iacute;s identificado con alguno de estos 13 tipos?**_\r\n\r\n\r\ndejenme aca en los comentarios que opinan :3","replies":[{"poster":"Only Clässic VG","date":"2018-11-17T15:41:23.984+0000","up_votes":4,"down_votes":0,"body":"falta el que solo escribe los scores cuando su team va mal.\n\n1/8/3\n0/5/0\n2/11/3\n0/7/1","replies":[]},{"poster":"HarpaX","date":"2018-11-17T19:34:36.417+0000","up_votes":3,"down_votes":0,"body":"mmm faltaron tipos:\n14- **el AFK flamer**: el que por la razon que sea se pone a flamear estando afk en base, o si esta en linea se queda quieto, super expuesto, mientras responde con insultos al tipo con el que esta discutiendo.\n\n15- **el flamer medianamente decente**: Juega normal, farmea, tradea etc, pero en los tiempos muertos (cuando esta muerto, o caminando de base a linea, etc) flamea todo lo que puede a sus compañeros. _~~(yo la temporada 7)~~_\n\n15- **el flamer ninja**: no dice nada en toda la partida, pero en el lobby post-game se caga putiando a diestra y siniestra. _~~(yo cuando pierdo una  promo)~~_\n\n16- **el flamer \"gringo\"**: el que se pone a flamear en otro idioma, ya sea para hacerse el extrangero o simplemente para ser mas desagradable.\n\n---\n\nDe entre los que pusiste y los que puse, los que mas odio son el **12- afk farimng** y **14- AFK flamer**,  porque directamente desbalancean la partida, no hacen nada, es como tener 1 jugador menos, los otros flamers los muteas y ya esta (por lo general).\n\nY el **8- xenófobo**, me caga el dia cuando un superdotado de esos se pone a denigrar a una persona por su pais de origen, sea cual sea, y si es a  mi, o a la gente de mi pais, peor obviamente,  ya que seria mas personal.\n---\nBuen post, me rei un poco y me tiltie otro poco.\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Pollo al Ornno","date":"2018-11-18T02:58:45.592+0000","up_votes":2,"down_votes":0,"body":"gracias por tu comentario :3\n\nsi, el numero 8- es el mas asqueroso la verdad :/","replies":[]}]},{"poster":"NLG Walter","date":"2018-11-17T13:40:37.270+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Bud Dicec","date":"2018-11-17T18:20:05.619+0000","up_votes":3,"down_votes":0,"body":"No podes flamear silenciosamente. Vos decis los que juegan toxico.","replies":[]}]},{"poster":"LolisOfLove","date":"2018-11-17T16:00:31.351+0000","up_votes":3,"down_votes":0,"body":"El único buen flammer es el flammer permabaneado. Riot debería ponerse bien Bolsonaro con todos los que empeoren la experiencia de juego.","replies":[{"poster":"DragonFelgrand8","date":"2018-11-18T02:14:37.162+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GranateFM,realm=LAS,application-id=v7qsfXsE,discussion-id=mh4XtMUa,comment-id=0004,timestamp=2018-11-17T16:00:31.351+0000)\n>\n> El único buen flammer es el flammer permabaneado. Riot debería ponerse bien Bolsonaro con todos los que empeoren la experiencia de juego.\n\nMe recordo a Goblin Slayer con lo de \" el unico duende bueno es el que se queda en su agujero\" xd","replies":[]}]},{"poster":"Fransoi ","date":"2018-11-17T13:44:15.751+0000","up_votes":3,"down_votes":0,"body":"los flamers son arte están los flmers normales ej: andaré a cagá pinche tu wea están los flamers apurados ej: no sr quw estás haxiriendo note tores bajo torre llv 3 jijo de p también están los flmers educados ej: muy buenas tardes quiero tomar un ratito de su tiempo para informarles que son hijos mancos por favor sepan entender mi opinión de que son unas mier muchas gracias que pasen muy buenas noches . tardes perdón gracias amen","replies":[]},{"poster":"QADRA JHIN","date":"2018-11-17T18:20:26.003+0000","up_votes":2,"down_votes":0,"body":">  entonces ya se rinde y se la pasa insultando y escribiendo por el chat /all diciendo lo malo que es su team y lo trágica que es su vida por jugar con 4 mancos de ese calibre\n\nMe estallé con esa frase {{sticker:sg-kiko}} \n\n\nSin duda el mas detestable es el 10. Le dan un consejo que es simplemente sentido común y se sube en un pedestal el tipo","replies":[]},{"poster":"Shulys","date":"2018-11-17T16:05:06.697+0000","up_votes":2,"down_votes":0,"body":"Vaya, veo flamers asi 1 de cada 5 partidas y realmente son molestos.\n\nCreia que todos eran niños mal educados, hasta que empece a jugar con unos amigos y familiares y algunos eran iguales. La edad no es una característica principal en el flamer.\n\nAl que veo mas seguido es aquel que insulta a su jg.","replies":[]},{"poster":"DragonFelgrand8","date":"2018-11-18T02:17:00.712+0000","up_votes":1,"down_votes":0,"body":"¿Y qué hay del ADC que te flamea por \"robarle\" un minion con el {{item:3302}} ?","replies":[]},{"poster":"Bud Dicec","date":"2018-11-17T18:19:11.670+0000","up_votes":1,"down_votes":0,"body":"Te falto los que son como vos. Los que flamean a los flamers.\nAunque no creas este post es flamear. Pero no te vas a dar cuenta. Vas a flamear.","replies":[{"poster":"Pollo al Ornno","date":"2018-11-17T21:00:33.241+0000","up_votes":1,"down_votes":0,"body":"Todos somos flamers. No hay ningun santo en este juego lamentablemente, si, incluso vos sos flamer.","replies":[]}]},{"poster":"MoonGL","date":"2018-11-17T14:18:27.977+0000","up_votes":1,"down_votes":4,"body":"habla por al// todo el rato es flamear? alv que sensibles :v","replies":[{"poster":"Pollo al Ornno","date":"2018-11-17T18:09:23.192+0000","up_votes":2,"down_votes":0,"body":"habar todo el rato por el /all diciendo lo malo que es tu team o lo malos que son los rivales es flamear","replies":[]},{"poster":"Shulys","date":"2018-11-17T16:00:28.232+0000","up_votes":2,"down_votes":0,"body":"Segun las reglas, eso es abuso de chat y tiene penalización.","replies":[{"poster":"MoonGL","date":"2018-11-17T16:34:07.719+0000","up_votes":1,"down_votes":1,"body":"nunca me atraparan con vida !","replies":[]}]}]}]}