{"poster":"AdcStoleMyAs5ist","date":"2016-09-06T10:50:29.762+0000","title":"League Readers and Writers Club - All welcome!","subforum":"FanFiction","up_votes":8,"down_votes":0,"body":"Heyo, people who see this!\r\n\r\n_Enjoyed reading the contest entries? Impressed by any in particular? Are you looking for more stories to sink your teeth into?_\r\n\r\n_Or did you enjoy constructing your own entry? Would you appreciate other like-minded writers giving you feedback (doesn&#039;t have to be league related!), maybe revealing areas for you to improve?_\r\n\r\nhttp://imgur.com/iHhMb5f\r\n\r\nI&#039;ve started a club for readers and writers alike, with the intention of assembling a group of people who are collectively appreciative of both League  and Fiction.\r\n\r\nTo join, if you&#039;re not a friend of someone who is a member, send me (that&#039;s &#039;_adcstolemyas**5**ist_&#039;) a friend request, and once I accept it, I&#039;ll send you an invite. Afterward, there&#039;s no obligation for you to keep a casual, unranked scrub like me on your friends list, but it is appreciated** (ɔ˘з˘)ɔ**.\r\n\r\nMembership is NOT limited to contest participants; everyone who wants to take part, including any of your friends, is more than welcome! \r\n\r\n~~unless you a filthy Riven main who types &#039;first time go ez plz&#039;, then flashes your mastery emote over my ADC&#039;s corpse.~~","replies":[{"poster":"Jason","date":"2016-09-06T11:48:08.600+0000","up_votes":2,"down_votes":0,"body":"Pretty awesome to see this starting up. Anyone who considers themselves a fan of good literature should get in on this. :D","replies":[]},{"poster":"itsaneeps","date":"2016-10-03T23:21:32.239+0000","up_votes":1,"down_votes":0,"body":"This sounds like a grand idea :) I can't add you just yet because of I'm not on my League client, but will do so soon. How does this all work anyway?","replies":[]},{"poster":"Water Wolf","date":"2016-10-02T06:23:35.144+0000","up_votes":1,"down_votes":0,"body":"Any chance of starting a dedicated area of the forum to write stories in?","replies":[]},{"poster":"THE RlVER KlNG","date":"2016-09-11T02:29:39.734+0000","up_votes":1,"down_votes":0,"body":"I'll definitely join but I'll have to do it on my OCE account.","replies":[]},{"poster":"azaki","date":"2016-09-07T00:13:41.648+0000","up_votes":1,"down_votes":0,"body":"Hey, this sounds really cool! I'll be sure to join once I get home. Looking forward to meeting other literature fans! :)","replies":[]}]}