{"poster":"Technø","date":"2016-06-08T20:22:58.601+0000","title":"¿Que sucede con Riot game? ¿ya no es mas un juego competitivo? (entren y dejen su opinion)","subforum":"Charlas Generales","up_votes":2,"down_votes":8,"body":"Hola chicas/os , la raz&oacute;n de este post es para opinar y mantener siempre el respeto de lo que les puede parecer cierto o no, por como yo lo veo el juego ha estado sufriendo muchos cambios desde el d&iacute;a 1 hasta hoy, algunos cambios muy buenos otros no tantos y  otros directamente malos, pero quien soy yo para decir lo que esta bien o mal, lo unico que vengo a plantear es el siguiente tema de las Ranked y de lo que dejo de ser riot game como compa&ntilde;&iacute;a. \r\nComo muchos ya saben reddit es un foro por no decir &quot;el se&ntilde;or foro&quot; de league of legend y ah&iacute; se les informa varias cosas a la comunidad del lol, hasta hace unos d&iacute;as se anuncio el final de la solo Q permanente y que en su lugar se usara solo y exclusivamente la colas din&aacute;micas, en mi opini&oacute;n esto le a quitado la competitividad al juego, aun recuerdo cuando me costaba un huevo literalmente subir por que jugaba p&eacute;simo y no sabia nada del juego (de hecho soy apenas un oro 5) pero algo veo en mis amigos y en mi ahora es mucho mas f&aacute;cil subir y ser carreado, riot ha sacado tantas ayudas en las junglas que pr&aacute;cticamente el juego cada ves se torno mas facil cuando hace unos meses necesitabas saber y calcular el tiempo de los bufos ahora ya no es necesario tenes indicadores en el mapa relojes y faltar&iacute;a una alarma que te diga &quot;che ac&aacute; esta tu red&quot; este es un claro ejemplo de que riot esta yendo para un camino que realmente no entiendo, ahora solo tengo que juntar cuatro amigos platinos rankear con ellos y subir as&iacute; de f&aacute;cil se pusieron las cosas y actualmente no tenes forma de medir REALMENTE tu nivel. por otra parte tenemos la otra cara de la moneda la gente que es realmente buena y llega a diamante no podr&aacute; con mas de 2 personas cont&aacute;ndose el osea un m&aacute;ximo de 3 personas, b&aacute;sicamente le eliminan la posibilidad de jugar de a 4 o de a 5 como un team a lo que me lleva otra cosa, si este es un juego competitivo no deber&iacute;a incentivar poder jugar en team?  por que en elo alto no  pero en elo bajo si? realmente el juego esta tomando una forma poco agradable donde antes disfrutaba crear un team y jugar con mis amigos para aumentar el ELO de ese team ahora no se puede por que te jugas tus puntos donde antes sabias que si eras 5 los otros tambi&eacute;n serian 5 hoy en d&iacute;a no podes entrar en ranked siendo 3 o 4 por que del otro lado existe la posibilidad de que te toquen 5 premades y viceversa .\r\nEn pocas palabras los mismos jugadores profecionales te lo dicen en sus stream NO JUGUES SOLO NO PODES SUBIR y no hablo de  plata 3 a plata 2 hablo de plata a oro y de oro a platino y de platino a diamante y asi.\r\n\r\nConcluyo el post pidiendote tu opinion al respecto {{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"KarmaUnder","date":"2016-06-08T20:43:21.400+0000","up_votes":2,"down_votes":0,"body":"la verdad que no me gusta para nada la dinamic y la nueva seleccion nose.... antes recuerdo que me costaba mucho ganar, sobre todo porque si me tocaba jugar adc (order pick) yo siempre jugaba mal, hoy en dia sigo dando asco de adc, pero sin embargo pude subir hasta platino porque ahora solo juego top, porque el juego me pone para jugar top, eso esta bueno porque puedo subir jugando lo que me gusta, pero tambien esta mal, porque baja el nivel de juego, antes para subir tenias que poder jugar bien todas las lineas, tenias que ser versatil, ahora aunque seas un manco como yo que solo sabe jugar bien de top vas a subir igual :V","replies":[{"poster":"Technø","date":"2016-06-08T21:06:45.697+0000","up_votes":1,"down_votes":1,"body":"Yo tengo un amigo que solo juega mid y sup y es platino","replies":[]}]},{"poster":"Bustatos xD","date":"2016-06-08T20:41:40.330+0000","up_votes":1,"down_votes":0,"body":"No se pero a este paso cada vez se ira bajando el nivel de los servidores ya le bajaron el requisito par llegar a 30 a la mitad -.- osea mas mancos en ranked gente que no conoce cosas básicas ahora mismo están rankeando...\nTambién el elobost que era sanción en riot ya no podrán hacer nada por que ahora pueden subir como premades.\nDe todas maneras a mi me gusta jugar solo y que eliminen el soloq lo encuentro una real estupidez, ellos mismo dijeron que querían que la gente subiera mas fácil de ligas. Pero esto sera a costa del nivel en las ligas ya que cada vez se ve gente mas mala.\nA mi particularmente me gusta jugar solo y si ahora me están obligando a jugar en premade que pasara ??? para mi sera un poco mas aburrido el juego y si sigue así cada vez se vera mas perjudicado el nivel de los servidores.","replies":[{"poster":"Technø","date":"2016-06-08T21:08:54.922+0000","up_votes":2,"down_votes":1,"body":"somos las y lan el nivel de por si ya era malo imaginate ahora","replies":[]}]},{"poster":"Ks Erwyn","date":"2016-06-08T22:48:27.737+0000","up_votes":1,"down_votes":0,"body":"Un juego competitivo donde sus profesionales se están yendo a jugar otras cosas..... y donde estas obligado a rankear en premades para subir o al menos no comerte 4 ragequit seguidos (como yo antenoche), o emparejamiento nada p̶a̶j̶e̶r̶o̶s parejos ...","replies":[{"poster":"DDementeV2","date":"2016-06-09T01:47:50.641+0000","up_votes":1,"down_votes":0,"body":"Aaajajajajaajjaajajaja\nParejos... Claasico Jaja\n{{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"L9 Letalis Umbra","date":"2016-06-08T20:29:32.213+0000","up_votes":1,"down_votes":0,"body":"Yo juego desde 2014 y el año pasado no quise jugar rankeds porque no me sentía en condiciones (pc junaeb, net horrible, principiante), este año quería jugar rankeds y tener marquito y todo pero con esto de que se fue la soloq, creo que será mejor ser unranked 4 life{{summoner:31}}","replies":[{"poster":"Bustatos xD","date":"2016-06-08T20:31:09.758+0000","up_votes":1,"down_votes":0,"body":"Como que se fue el soloq ?","replies":[{"poster":"L9 Letalis Umbra","date":"2016-06-08T20:35:50.118+0000","up_votes":1,"down_votes":0,"body":"No me refiero a que se fue, si no a que es un suicidio hacerlo.","replies":[{"poster":"Bustatos xD","date":"2016-06-08T20:44:12.872+0000","up_votes":1,"down_votes":0,"body":"Aahhhh puff creí que lo eliminaron, de todas maneras a mi me da igual si hay premades en el otro lado solo tengo que ganarle a los 2 y si son 3 a los 3 me da igual :D","replies":[{"poster":"L9 Letalis Umbra","date":"2016-06-08T20:54:02.015+0000","up_votes":1,"down_votes":0,"body":"La comunicación es primordial para ganar, no pierden segundos valiosos escribiendo o haciendo pings, pero si son malos si se les gana xDD","replies":[]}]}]},{"poster":"Technø","date":"2016-06-08T20:36:34.651+0000","up_votes":1,"down_votes":1,"body":"Dejaran la cola dinamica chau solo q nunca mas y si podes jugar \"solo\" en cola dinamica pero es al pedo vas a perder seguro por que te meten a 2 premades del otro lado y fuiste","replies":[]}]},{"poster":"Technø","date":"2016-06-08T20:30:31.461+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=aniballmlxd,realm=LAS,application-id=v7qsfXsE,discussion-id=eolhFu2n,comment-id=0000,timestamp=2016-06-08T20:29:32.213+0000)\n>\n> Yo juego desde 2014 y el año pasado no quise jugar rankeds porque no me sentía en condiciones (pc junaeb, net horrible, principiante), este año quería jugar rankeds y tener marquito y todo pero con esto de que se fue la soloq, creo que será mejor ser unranked 4 life{{summoner:31}}\n\nlo que tenes que hacer es simple jugar con amigos pero y el que no quiere? ahi esta el problema","replies":[{"poster":"L9 Letalis Umbra","date":"2016-06-08T20:33:43.503+0000","up_votes":1,"down_votes":0,"body":"Mis amigos no son lo muy habilidosos como para jugar rankeds con ellos D: además que no siempre estarán disponibles cuando uno quiere jugar, por lo que del tiempo que uno tiene disponible se divide en la cantidad de premade que son y te queda una miseria:/","replies":[]}]}]},{"poster":"BUSCANDO A JORGE","date":"2016-06-08T20:41:40.941+0000","up_votes":1,"down_votes":0,"body":"Sacar el soloQ es menos competitivo? Pero si la competencia es en saber cual es el mejor equipo y lo hace mejor durante la partida, y con premades sera mas fácil hacer eso.","replies":[{"poster":"Technø","date":"2016-06-08T21:04:50.920+0000","up_votes":1,"down_votes":1,"body":"jugar solo demostrando tu habilidad individual ya se perdio a ese competitivismo me refiero","replies":[]}]},{"poster":"Khimea","date":"2016-06-08T20:31:09.259+0000","up_votes":1,"down_votes":0,"body":"Yo subi de bronce 1 a gold 5 solo.\nEs lo unico que tengo para decir.\nEntendi mal o dijiste que en diamante no se puede hacer ranked de mas de 3 personas?","replies":[{"poster":"Bustatos xD","date":"2016-06-08T20:33:32.066+0000","up_votes":1,"down_votes":0,"body":"En efecto de diamante solo se puede 3 max ya que los mismos pro y otra gente de elos altos reclamaron por el hecho de los disparejo que quedaban los enfrentamientos...","replies":[{"poster":"Khimea","date":"2016-06-08T20:37:35.627+0000","up_votes":1,"down_votes":0,"body":"Lo que se hizo en diamante fue achicar los rangos de los conjuntos, ya los platinos 5 no pueden estar con los diamantes 5.\nPero se puede jugar de a 5 que yo sepa.\nY lo veo todos los dias xD. Al menos que eso sea solo en LAS.","replies":[]}]},{"poster":"Technø","date":"2016-06-08T20:37:06.256+0000","up_votes":1,"down_votes":0,"body":"exactamente como digo mi amigo bustatos","replies":[]}]},{"poster":"Ellora","date":"2016-06-08T20:33:50.610+0000","up_votes":1,"down_votes":0,"body":"Lo que pasa que hay muchisimo jugador casual y manco, por eso implementaron el dinamicQ para que se armen premade y puedan subir, carreados, eloboosteados, de la manera q sea pero q suban.\nDinamicQ + tiempos de jungla, baron , dragones + tiempos de ultis y hechizos, cada vez mas facil es el juego y al pasar esto cada vez la gente piensa, analiza menos por algo cada vez hay menos nivel en oro y platinos, que hoy x hoy es mas facil subir y puede llegar cualquiera.","replies":[{"poster":"Technø","date":"2016-06-08T20:35:12.013+0000","up_votes":1,"down_votes":0,"body":"Entonces opinas como yo dejo de ser un juego competitivo para ser un juego simplemente, yo tambien veo gente en platino y no tienen el nivel que antes tenia un platino","replies":[]}]},{"poster":"JACKY FANBOY","date":"2016-06-08T21:11:14.654+0000","up_votes":1,"down_votes":1,"body":"Soy un amante de los juegos de estrategia, items, niveles, counters, builds, posicionamiento, timing y creo que LOL la implementaba hasta ciertos parches, y lo que mas me jodio fue el temporizador de la jungla\ntambien el DQ me perturba un poco ya que dara mas facilidad al eloboost, de hecho un amigo rankea con un diamante (en plata) y subre como la espuma xD","replies":[{"poster":"Technø","date":"2016-06-09T20:51:35.514+0000","up_votes":1,"down_votes":1,"body":"Mal XD","replies":[]}]}]}