{"poster":"Technø","date":"2018-05-17T23:58:03.315+0000","title":"Jugar solo  en \"solo Q\" y \"flex\" (experiencia propia )","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Buenas hoy termine de hacer un poyecto que tenia para inicio de este a&ntilde;o y ver los resultados que ahora les comentare y quiero saber sus opiniones, basicamente inicie la colas clasificatorias solo ambas esa era la idea jugar todas las partidas solo sin ayuda de nadie y resulta que despues de 254 partidas 119V y 135 D en solo q quede en oro V  y cada ves que entro el tipo de gente es muy inferior al nivel que  puedo mostrar en cambio en flex  en apenas 143 partidas 81V y 62 D termine hoy por quedar en platino V con gente muy superior y que entiende mas el juego, el jugador en este caso yo soy el mismo nunca di mu cuenta a nadie y he grabado unas cuantas partidas stream , como es posible esta diferencia psicologicamente admito que las flex me las tomo mas con calma pero las juego igual de calculador que las solo Q y que bueno tanta gente de solo q que me metio el sistema de mmr que sinceramente ya no me dan ganas de seguir jugando en esa cola. pero bueno ustedes que piensan?","replies":[{"poster":"DIOS TUTI","date":"2018-05-18T00:03:58.755+0000","up_votes":2,"down_votes":0,"body":"opino al revez, soy diamante 2 en soloq y ex challenger flex (actualmente d1 porque me canse de jugar flexibles, deje que la inactividad me baje)\n\nen soloq, los emparejamientos son perfectos (por lo menos en diamante, no hay smurfs y si los hay, tambien me emparejan con ellos en las cuentas mains, no hay mucha diferencia de nivel)\n\nen flex, siendo challenger, me emparejaban con platinos y diamantes de flex, que eran diamantes+ en soloq, por lo tanto tenia una partida balanceada, pero si la ganaba me daban 5 de pl y si la perdia me sacaban 30 de pl, porque el sistema no ve el elo de soloq, solo el de flex, y me emparejaban con platinos-diamantes de esa cola.\n\nen flex challenger, hay de todo, desde gente d5 soloq estancada, hasta challengers en las 2 colas, en cambio en soloq, es todo parejo, no hay tanta aleatoriedad en el emparejamiento, las disfruto mas, y flex voy a jugar 1 vez por mes para sacar la inactividad de diamante, y a final de season voy a ver si puedo subir.\n\nedit: mi desempeño es casi el mismo en las 2 colas, no hay diferencia (con mi main, despues los otros games fueron de autofill, no las tomo en consideracion)\n\nhttps://imgur.com/oZEmsxd\n\nhttps://imgur.com/a4TUfDl","replies":[{"poster":"Technø","date":"2018-05-18T00:14:13.998+0000","up_votes":1,"down_votes":0,"body":"ha bueno en mi caso como juego mid/top me desempeño mejor asistiendo al resto cuando ellos son premades ponele","replies":[{"poster":"DIOS TUTI","date":"2018-05-18T00:21:01.177+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nick Warren,realm=LAS,application-id=v7qsfXsE,discussion-id=r9KF70xQ,comment-id=00000000,timestamp=2018-05-18T00:14:13.998+0000)\n>\n> ha bueno en mi caso como juego mid/top me desempeño mejor asistiendo al resto cuando ellos son premades ponele\n\nyo, te recomendaria que agregues gente para armarte premades de 5, no te digo un team fijo, pero yo por ejemplo, tengo a la mayoria de mi elo en flex agregados, y armabamos teams de 5 para jugar, podrias hacer lo mismo, mejoras bastante la toma de decisiones en equipo y la coordinacion, y mas que nada si tenes comunicacion via discord/chat de voz, y aprendes a usar los pings mejor.","replies":[{"poster":"Technø","date":"2018-05-18T01:12:02.847+0000","up_votes":1,"down_votes":0,"body":"si es lo que estoy buscando justo ahora :D","replies":[]}]}]}]},{"poster":"LéonKaiser","date":"2018-05-18T00:04:35.106+0000","up_votes":2,"down_votes":1,"body":"Hola!\n\nSi te va bien en Flex, significa que eres un jugador que sabe aprovechar la sinergia con sus compañeros. Generalmente en Flex siempre te encontrarás premades, y si sabes jugar con eso, puede ser una ventaja.\n\nYo a veces juego FlexQ también, y a veces me toca contra una premade top-jungla o mid-jungla, entonces es \"fácil\" saber donde irá el jungla al principio.\n\nDe todas formas, mi consejo es que no valores una cola por encima de la otra, si estás cómodo en Flex, juega ahí. \n\nMejor actitud > subes más > aprendes más\n\nY ya luego el día que vuelvas a jugar SoloQ serás mejor jugador y ganarás más ^^\n\nMi opinión :3","replies":[{"poster":"Technø","date":"2018-05-18T00:12:37.838+0000","up_votes":2,"down_votes":1,"body":"se agradece buen  hombre","replies":[]},{"poster":"Bienzahar","date":"2018-05-18T00:10:05.638+0000","up_votes":1,"down_votes":1,"body":"Esto es lo politicamente hablando y hablado sin haber jugado flex xD","replies":[{"poster":"LéonKaiser","date":"2018-05-18T00:12:43.425+0000","up_votes":1,"down_votes":0,"body":"No te creas eh, soy consciente de lo que la gente comenta como \"mal emparejamiento\", de hecho, muchas veces he jugado partidas muy muy desbalanceadas (tanto por un lado como por otro).\n\nPero es una cola totalmente ajena a SoloQ, valorar tu emparejamiento en Flex por el rango que tengan tus compañeros en SoloQ no acompaña. Es como cuando alguien se queja de que en una normal le emparejan con gente de elo alto o elo bajo, son emparejamientos distintos y absolutamente no tienen nada que ver.\n\nDiría que últimamente juego más FlexQ que otra cosa :3","replies":[{"poster":"Zoliza","date":"2018-05-18T00:36:26.299+0000","up_votes":1,"down_votes":0,"body":"Siendo platino en flex jugué con el rank 1 de flex en contra con 1100lp querés sacar vos la cuenta de la diferencia de mmr entre los dos? 4 ligas enteras en lp  y alguien que es arriba de diamond en soloq nunca es más bajo en flex , pasa al revez.","replies":[]},{"poster":"DIOS TUTI","date":"2018-05-18T00:18:53.101+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LéonKaiser,realm=LAS,application-id=v7qsfXsE,discussion-id=r9KF70xQ,comment-id=000100000000,timestamp=2018-05-18T00:12:43.425+0000)\n>\n> No te creas eh, soy consciente de lo que la gente comenta como &quot;mal emparejamiento&quot;, de hecho, muchas veces he jugado partidas muy muy desbalanceadas (tanto por un lado como por otro).\n> \n> Pero es una cola totalmente ajena a SoloQ, valorar tu emparejamiento en Flex por el rango que tengan tus compañeros en SoloQ no acompaña. Es como cuando alguien se queja de que en una normal le emparejan con gente de elo alto o elo bajo, son emparejamientos distintos y absolutamente no tienen nada que ver.\n> \n> Diría que últimamente juego más FlexQ que otra cosa :3\n\nflex es totalmente ajena a soloq, pero la persona que las juega en las 2 colas es la misma, ese es el gran problema del emparejamiento en flex, y no veo una solucion posible, por eso la cola es menospreciada, porque con mucha suerte, podes llegar a subir a una liga a la cual no perteneces, por la aleatoriedad en los emparejamientos.","replies":[]}]}]}]},{"poster":"Bienzahar","date":"2018-05-18T00:07:02.524+0000","up_votes":1,"down_votes":0,"body":"Yo juego al igual que tu solo q y flex solo (en esta cuenta) por lo que puedo decir que el emparejamiento en Flex es demasiado malo, o te perjudica mucho o te beneficia mucho. En cambio el emparejamiento en solo q es mucho más justo.\nEn flex suele ir gente de elo alto a pasarla bien con su premade que es low elo, aprovecha de subir al low elo a oro y de paso prueba cosas de una forma un poco más seria. \nLo que yo veo en tu caso es que realmente tu nivel es de oro 5 y no de platino, pues como digo en flex los emparejamientos son muy malos xD","replies":[{"poster":"Technø","date":"2018-05-18T00:12:02.530+0000","up_votes":1,"down_votes":1,"body":"en todo caso oro 3/2 por que no se justifica  una diferencia de 5 colas","replies":[{"poster":"Bienzahar","date":"2018-05-18T00:13:13.685+0000","up_votes":1,"down_votes":1,"body":"En solo q eres oro 5, nivel de oro 5 xD","replies":[]}]}]}]}