{"poster":"How to Gato","date":"2017-04-20T23:13:19.463+0000","title":"Migrate some files From PC to MAC, AVOID UPDATE (LOW CONECTION)","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hi guys, i maked a Hackintosh for my work propouse on my old windows PC. Windows is on HDD and Macos on SSD as main disk. i Have LoL updated without problems on windows i wanna install the maco, my download rate is 100kbps so it take 24 hours or more on downloading all 14gbs of update... \r\n\r\nAny way to move some files from the pc to mac to avoid some MBS/ GBS of Re Download?","replies":[{"poster":"Broporo","date":"2017-04-21T20:25:43.553+0000","up_votes":1,"down_votes":0,"body":"If you move the files over as opposed to downloading them normally, you risk some of the files becoming corrupted and unplayable. Your best bet for a clean install would be to let that download run its course. You could try switching to ethernet to boost that download speed, or check out some of the steps in this [**guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) for some other ways to increase the speed.","replies":[{"poster":"How to Gato","date":"2017-04-23T06:45:25.259+0000","up_votes":1,"down_votes":0,"body":"Hi Broporo the problem is that my IPS give me only 1 - 1.5mbps so my download is 100kbps. The main problem is that last night i let it all nigh downloading ok it downloaded like 4GB of data. i was needing use the internet so i closed the launcher, at night when i let it to download again it come again from 13gb of downloading data! all right i did let it other night =/- 3gb downloaded, when restarted the pc and try again... again 13gb, so its hard for mr me download the game again without a Pause Restore download, Any help?","replies":[{"poster":"Broporo","date":"2017-04-23T20:28:26.296+0000","up_votes":1,"down_votes":0,"body":"Ahhh so you're having problems with your download speed not being able to finish overnight =\\ . We can't really help increase your internet speed, and we don't have a way of pausing the updates right now, but the steps in that connection guide might be able to help speed up the patch a bit. You might be able to get a little faster download too if you use a wired connection instead of wireless, if you haven't tried that yet.","replies":[{"poster":"How to Gato","date":"2017-04-23T23:01:17.784+0000","up_votes":1,"down_votes":0,"body":"Thanks for repply, The main problem here isnt my aconnection roporo, the main problem is that every time i close the Launcher and open download start from beging, How i can fix that?","replies":[{"poster":"Broporo","date":"2017-04-23T23:38:58.129+0000","up_votes":1,"down_votes":0,"body":"We don't have a way to pause the download, you'll need to let the patcher fully update in one sitting. Closing the launcher during the patch process will cancel it entirely, causing you to restart, and could also cause issues with corrupted files from canceling it so many times once you finally get it installed.","replies":[]}]}]}]}]}]}