{"poster":"AofJustice","date":"2016-12-23T11:30:24.301+0000","title":"Ich habe eine kleine frage zu Ranglisten Spielen und zum Spielverhalten","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":2,"body":"Hey Leute ! :)\r\n\r\nIch wollte mal nur sagen das ich mit dem Spiel etwas &uuml;berfordert bin . \r\n\r\nN&auml;mlich wenn ich ein Ranglisten spiel starte bekomme ich nur Diamant Spieler im Gegner Team ( Ich war PLATIN IV!!! ) und die sind im durchschnitt Diamant III ... wenn ich normal Games spiele bekomme ich nur Flamer und extrem Toxische Mitspieler und Gegenspieler . \r\n\r\nIch wollte fragen warum das so ist ?\r\n\r\nDanke f&uuml;r euren Feedback , Tipps w&auml;ren auch nett :)","replies":[{"poster":"Abasin","date":"2016-12-23T12:16:04.596+0000","up_votes":2,"down_votes":0,"body":"Erst einmal scheinst Du hier Spielstärke und Verhalten in einen Topf zu werfen. Deshalb möchte ich nochmal nachfragen:\n\n1. Sind Deine Ranglistenmitspieler auch toxisch? Denn eine hohe ELO sagt ja noch nichts über das Verhalten ingame aus.\n2. Welchen Rang in etwa haben Deine Mitspieler in den Normals? Auch Platin?\n\nSo gesehen ist Deine Eingangsschilderung totaler Quatsch, weil Du zwei unvereinbare Sachverhalte, nämlich toxischer Verhalten einerseits und Diamondrang andererseits unzulässig vermischst.\n\nEs gibt grob gesagt insgesamt 4 Möglichkeiten der Spielerfahrung:\n\nDiamond (Ranked) - toxisch\nDiamond (Ranked) - entspannt\n\nDiamond (Normal) - toxisch\nDiamond (Normal) - entspannt\n\nDie Frage nach dem warum entfällt somit, weil Du nur von Deinen begrenzten Erlebnissen ausgehen kannst. Andere haben andre Erfahrungen gemacht. Ich zum Beispiel habe es im Ranked mehr als genug erlebt, dass schon in den ersten Minuten irgendwer total ausgetickert ist. Geht also alles.\n\nMein Tipp an Dich. Basierend auf Deinen Erfahrungen spiel weiter Ranked und erspare Dir die Normals. Spiele stattdessen ARAM.","replies":[{"poster":"AofJustice","date":"2016-12-23T12:22:58.096+0000","up_votes":1,"down_votes":0,"body":"Also eigentlich wollte ich das mit dem Diamant Rang extra als Thema machen aber es gibt keine \"Topics\" dafür deshalb nahm ich es hier mit dabei es tut mir leid für die Verwirrung .\n\nAlso In normal Games Spiele ich meistens immer gegen und mit Silber Spieler.\n\nIm Ranked sind die meistens auch Toxisch ( Diamant halt , manche denken halt die wären Götter ) aber was mich am meisten stört ist , dass ich noch in den Placements bin und somit die Spiele verliere .\n\nAber ECHT DANKE FÜR DEINE TIPPS :) !!!","replies":[]}]},{"poster":"Tjarven","date":"2016-12-23T12:15:54.197+0000","up_votes":1,"down_votes":0,"body":"In der Rangliste ist das so, dass du eine MMR hast und du wirst deshalb gegen Diamond Spieler gematched weil du anscheinend eine hohe MMR hast.\nDas mit den Toxischen Mitspieler und Gegenspieler hat man überall in jedem Modus.","replies":[{"poster":"AofJustice","date":"2016-12-23T12:23:21.953+0000","up_votes":1,"down_votes":0,"body":"Meine MMR war letzte Season 1900-2000 Max. \n\nTrotzdem hast du recht :)","replies":[{"poster":"Tjarven","date":"2016-12-23T12:35:59.919+0000","up_votes":1,"down_votes":0,"body":"Das ist nicht die MMR.\n\nEdit:Die MMR weiß niemand,da Riot die Daten nicht heraus gibt.","replies":[{"poster":"AofJustice","date":"2016-12-23T13:03:55.932+0000","up_votes":1,"down_votes":0,"body":"Auf OP.GG euw ist sehr genau ( die benutzen das Season 4 System oder 5 )","replies":[{"poster":"Tjarven","date":"2016-12-23T13:17:59.791+0000","up_votes":1,"down_votes":0,"body":"Ja aber das mit 1900-2000 ist LKS nur bzw. die Zahl für die Elo aber nicht die MMR.","replies":[]}]}]}]}]},{"poster":"three stodges","date":"2016-12-23T12:15:36.780+0000","up_votes":1,"down_votes":0,"body":"Ich bin nur ein Low Elo Spieler und schaue auch nicht was die Gegner für Spieler haben , zum Ende der letzten Season war Ich Silber 5 in der Pre Season  noch auf Silber 4 gespielt letztendlich war Ich gute 4-5 Monate in Silber. Nach den abgeschlossenen Placement Matches kam die Ernüchterung Ich bekomme zwar für ein Sieg 25 Pkte und bei Niederlage 18 abgezogen allerdings habe Ich von den letzten ca 40 Spielen nur noch 5 Gewonnen warum auch immer ,zumal Ich täglich gespielt habe daher kann Ich nicht aus der Übung sein. Toxischer ist es in Low Elo nicht geworden höchstens Champs die gespielt werden aber da bin Ich eigentlich großzügig drin.","replies":[{"poster":"Abasin","date":"2016-12-23T12:30:51.837+0000","up_votes":1,"down_votes":0,"body":"> Ich von den letzten ca 40 Spielen nur noch 5 Gewonnen warum auch immer ,zumal Ich täglich gespielt habe daher kann Ich nicht aus der Übung sein.\n\nGeht mir ähnlich. Ich denke auch schon, dass ich irgendwie alles verlernt habe.","replies":[]},{"poster":"AofJustice","date":"2016-12-23T12:27:34.673+0000","up_votes":1,"down_votes":0,"body":"Ok . \n\nJa Silber und Bronze Sind eher weniger toxisch das stimmt . \n\nAber mach dir nichts draus das du die Spiele verlierst , das wird schon wieder ! :) \n\nVersuche ADC zu Mainen in Silber hilft das , da der ADC selten in Teamfights gefocust wird und du somit scheinen könntest.\n\nUnd Trainiere immer in Freien Spiel mit Bots ( alter launcher ) oder mit Freunden ( Egal ) Zum Beispiel die Lee sin kombo : R dann Flashen .\n\nSind zwar winzige tipps aber ich hoffe ich konnte dir entgegen helfen ^^ \n\nUnd danke für deinen Beitrag :)","replies":[]}]}]}