{"poster":"Professor Thresh","date":"2016-06-30T07:38:43.338+0000","title":"Question For Riot","subforum":"Player Behavior","up_votes":3,"down_votes":2,"body":"o_o who checks the chat logs to see if people are being toxic or not? because im one of those people who sometime wants to go out of meta and try new things(but never in a ranked game), today i got a 14 day ban for being &quot;Toxic?&quot; in game but the chat logs dont match at all. It showed me 3 game chats and all of them i went out of meta (won 2/3 of those games ) and it does not help that i play solo (#ForeverAlone no one plays with me cuz im bad XD) so most of the time i get placed with premades and they get mad because i dont follow the meta and junk...so they report me im mad but im not too mad because i have a second account thats like lv12 but all my friends are on the lv30 account (the account im on right now) i know there is not a report tab for &quot;Playing a champ in a role it was not made for&quot; so why do i have to get punished for it. to be fair one of the games i did use some dark humor but nothing intense \r\n\r\n**Main questions **\r\n1. Who checks the chat logs to see if people are being toxic or not? \r\n2. Does riot even check the full game chat log of other players in the game?(not just the person that got reported)\r\n\r\nWell i thanks im just gonna sit here and wait because league is basically my life and the reason i haven&#039;t drunk this lemonade flavored bleach","replies":[{"poster":"Riot Tantram","date":"2016-06-30T18:30:24.464+0000","up_votes":7,"down_votes":2,"body":"> Who checks the chat logs to see if people are being toxic or not?\n\nYou were not punished for off-meta play. I took a glance at only the first chat log provided in your reform card and I can tell the punishment is deserved. You are welcome to post the chat logs here for the community to weigh in on them.\n\n> Does riot even check the full game chat log of other players in the game?\n\nNo, they are irrelevant. Each person is responsible for what they type.","replies":[{"poster":"Stasis691","date":"2016-07-01T02:45:53.174+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Tantram,realm=NA,application-id=ZGEFLEUQ,discussion-id=6BJjwANs,comment-id=0004,timestamp=2016-06-30T18:30:24.464+0000)\n>\n> You were not punished for off-meta play. I took a glance at only the first chat log provided in your reform card and I can tell the punishment is deserved. You are welcome to post the chat logs here for the community to weigh in on them.\n> \n> No, they are irrelevant. Each person is responsible for what they type.\n\n\"I can tell the punishment is deserved.\"\n\nIs that like when you took a glance at mine as well and concluded that I intentionally fed even tho the replay of the games themselves CLEARLY SHOWS that I did not? \n\nI just played my first game since I was unbanned. I reported six players. There were six flamers, 2.5 afks, and my only chat entry was \"love unicorns and butteryfly sugar\" but my score was 0/5/1 on a team that was 1/14 with a bunch of afks. \n\nGood thing you're not judging me further based on that game because I'm sure you could have just told that I must have been intentionally feeding and it didn't have anything to do with it being a 5v2.\n\nEither way, I'm not going to further subject myself to this nonsense. I got a two week ban for a false accusation and chat logs that would be lucky to trigger a 5 game restriction. I come back, I play one game, and I am assaulted on six different fronts by people who literally did the same thing as me or much, much worse. \n\nHow can you say with a straight face your product works?","replies":[]},{"poster":"iisabrina","date":"2016-06-30T19:49:39.262+0000","up_votes":3,"down_votes":12,"body":"OP to elaborate and introduce you to this person, This is the guy who apparently coded the tribunal system of automated reports/banning/chat restrictions (punishments). \n\nBasically what he hasnt mentioned is he created a program to ban people. Now his program isnt very good because he blacked out while writing the program and he currently doesnt even know how the banning tier system reacts to various kinds of punishable offenses. (Request evidence link and I will provide if you care that much)\n\nWere you banned for racism or homophobic slurs OP? Because if you were banned for some \"off topic\" consideration that Riot considers toxic and no other person in the world ( jury hint hint) would consider toxic. I urge you to research the firms which are currently taking Riot on in a class action suit and report your incident to them\n\nRiot will do what ever they can to cover their ass.","replies":[{"poster":"Masalar","date":"2016-06-30T20:29:07.326+0000","up_votes":6,"down_votes":2,"body":"Op, to elaborate and introduce you to this person, they're someone who feels they should be able to say anything they want to anyone they want, if should anyone find it offensive they just need to \"grow up\". They got punished for some combination of offensive language and trolling/afking/feeding, but clearly think that such punishments are illegal.\n\nThey probably had a conversation where they claimed they did nothing wrong and then immediately switched tactics and tried to prove that someone else in one of their games said something rude and THEY didn't get punished, so even though they DID feed/rage/curse, it was totally ok because they weren't the only one.\n\nAfter being punished 3-4 times they spend their time trolling the boards trying to turn people against Riot all because they couldn't keep their vitriol to themselves.\n\nThey will do whatever they can to shift blame elsewhere.","replies":[{"poster":"iisabrina","date":"2016-06-30T21:06:50.145+0000","up_votes":2,"down_votes":9,"body":"Op to inform you, this person doesnt know what hes talking about. Ive had one 10 game chat restriction a LONGGG time ago but this guy is probably someone who enjoys getting people banned so he has come up with this sexual fantasy to satisfy himself and orgasm while he types it out.\n\nOn the other hand my comments about Riot Tantrum are true. \n\nHe thinks im trolling but hes bronze, cant expect anything else out of those trolls lol.","replies":[]}]},{"poster":"Mig89","date":"2016-06-30T21:04:36.059+0000","up_votes":3,"down_votes":1,"body":"You tell all kinds of people to post their research but never are able to provide a link to them.\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"iisabrina","date":"2016-06-30T21:11:02.376+0000","up_votes":2,"down_votes":4,"body":"http://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/H4OBljNi-suspension-14-days-why?comment=0003000200000001 was the post where he proved he had no idea how the punishment tier system works. \n\nAfter I pointed that out, and showed he was wrong , the moderators decided to remove the entire thread.","replies":[]}]},{"poster":"Stasis691","date":"2016-07-01T02:37:43.545+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=iisabrina,realm=NA,application-id=ZGEFLEUQ,discussion-id=6BJjwANs,comment-id=00040000,timestamp=2016-06-30T19:49:39.262+0000)\n>\n> OP to elaborate and introduce you to this person, This is the guy who apparently coded the tribunal system of automated reports/banning/chat restrictions (punishments). \n> \n> Basically what he hasnt mentioned is he created a program to ban people. Now his program isnt very good because he blacked out while writing the program and he currently doesnt even know how the banning tier system reacts to various kinds of punishable offenses. (Request evidence link and I will provide if you care that much)\n> \n> Were you banned for racism or homophobic slurs OP? Because if you were banned for some &quot;off topic&quot; consideration that Riot considers toxic and no other person in the world ( jury hint hint) would consider toxic. I urge you to research the firms which are currently taking Riot on in a class action suit and report your incident to them\n> \n> Riot will do what ever they can to cover their ass.\n\nCan you point me in the right direction for the class-action suit? I have recently complied very much information specifically along these lines and was considering passing it on to Kotaku or other large gaming outlets to expose this nonsense. I just played my first game back since my two week ban and there were six players who individually committed violations more egrerious than anything Riot produced against me. 2.5 afks and 6 flamers.\n\n\"I took a glance and I can just tell it was justified. Case close.\"\n\nSounds like the US court system these days.\n\nRIot says \"Chat logs are irrelevant because each person is responsible for what they say.\" Rito doesn't actually practice this because while sure, it is irrelevant what another person said in context to what you're saying, if they are still incurring violations, then NEED TO BE PUNISHED RATHER THAN IGNORED. \n\nIf Riot was serious they wouldn't play hunt the witch.\n\nhttp://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/3LxKyFOV-my-first-game-after-two-week-ban-six-extremely-toxic-players-25-afks","replies":[]}]},{"poster":"Professor Thresh","date":"2016-06-30T23:16:00.172+0000","up_votes":1,"down_votes":1,"body":"{{sticker:slayer-jinx-unamused}}  OK w/e cuz you can tell if someone is serious through chat that 1st game as i said i used dark humor ill just play on my smurf or play a better game and why would i want the community's opinion they are the reason im in this situation that's the reason why the title is \"Question for Riot\" not \"Question for internet trolls\" Thanks for your reply though.","replies":[]}]},{"poster":"Friend of Falcor","date":"2016-06-30T18:31:18.266+0000","up_votes":3,"down_votes":0,"body":"Post your chat logs.","replies":[]},{"poster":"AramsAreBest","date":"2016-06-30T07:41:50.079+0000","up_votes":2,"down_votes":0,"body":"Wheres your chat logs","replies":[]},{"poster":"Deep Terror Nami","date":"2016-06-30T09:37:12.117+0000","up_votes":3,"down_votes":2,"body":"The system is automated. If you get reported too much it'll review the logs of your reported matches and look for negative behavior, and if you're negative consistently enough you'll be punished. You can read a little more about the **Instant Feedback System** here; http://na.leagueoflegends.com/en/news/game-updates/player-behavior/reports-how-do-they-work\n\nThe system will only check the chat of the person it is reviewing. Retaliation is not a reason to become toxic and you're only responsible for your own behavior, so what they did is irrelevant. If you want to post the logs here I can review them with you to point out what negative behavior may have resulted in your punishment. Punishment is also [done in 4 tiers](http://boards.na.leagueoflegends.com/en/c/gameplay-balance/Boqd81O0-upcoming-upgrades-to-chat-restrictions); it usually goes up only one step each time you're punished, but extreme behavior may skip steps.\n\n> Well i thanks im just gonna sit here and wait because league is basically my life and the reason i haven't drunk this lemonade flavored bleach\n\nI don't know if you're just joking or if you're really feeling depressed without League, but don't make rash decisions. There are always other things you can do to enjoy yourself while you wait for your account. If you need to talk don't hesitate to let someone know, and if you want help anonymously you can call the National Suicide Prevention Hotline at 1-800-273-8255","replies":[{"poster":"Cosmere","date":"2016-07-01T02:22:34.212+0000","up_votes":1,"down_votes":0,"body":"Savage.","replies":[]}]},{"poster":"Kim Chi Vendor","date":"2016-06-30T08:06:15.377+0000","up_votes":1,"down_votes":0,"body":"You could make an ARAM account while you're banned and play that.  No one checks the chat log an automated system banned you for saying hate speech probably.","replies":[]}]}