{"poster":"Myrmidones","date":"2016-08-19T16:35:53.327+0000","title":"I haven't played in a very long time but someone has been playing my account!!","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Okay this is a little bizarre because I haven't played League in probably 2 years but today I get an email that my account bought $10.00 worth of RP. I was FUCKING DUMBFOUNDED. So I try my password and couldn't log into MY account. So I reset the password and come to find out someone has been playing under my account! I have no idea when my account was compromised and have no idea what I need to do to talk to Riot about this. Is this shit common?","replies":[{"poster":"Porocles","date":"2016-08-19T17:03:33.752+0000","up_votes":2,"down_votes":0,"body":"It's important to have good account security practices for any account, even outside of League.  In cases that an account is accessed by an unauthorized party, we can help!  reach out to us in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) to look into reparations!  In the meantime, you can also use our [account recovery](https://support.riotgames.com/hc/en-us/articles/201751694-Recovering-Your-Account) to secure your account.  We'll respond asap!","replies":[{"poster":"Myrmidones","date":"2016-08-19T17:13:49.358+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Porocles,realm=NA,application-id=osqw6G4M,discussion-id=1QZ2iQVj,comment-id=0000,timestamp=2016-08-19T17:03:33.752+0000)\n>\n> It&#x27;s important to have good account security practices for any account, even outside of League.  In cases that an account is accessed by an unauthorized party, we can help!  reach out to us in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) to look into reparations!  In the meantime, you can also use our [account recovery](https://support.riotgames.com/hc/en-us/articles/201751694-Recovering-Your-Account) to secure your account.  We&#x27;ll respond asap!\n\nThank you for the fast response but I was able to get my account back because it was still under my email. I changed the password to something much harder but I'm more concerned about my account being banned because the inevitable chargeback that occurs because he is now locked out.","replies":[]}]},{"poster":"Myrmidones","date":"2016-08-19T18:51:09.773+0000","up_votes":1,"down_votes":0,"body":"So I installed the game but couldn't check anything because he was in game. I waited for him to get done to get the necessary information. He added his buddies from his other account which through chat logs admits his real summoner account.","replies":[]}]}