{"poster":"Br0ken Sword","date":"2015-10-24T23:18:04.587+0000","title":"Proposta per nuovi item e cambiamenti ad altri per la season 6","subforum":"Campioni e gameplay","up_votes":0,"down_votes":2,"body":"Salve, come da titolo, sono qui per proporre alcuni cambiamenti e l&#039;introduzione di nuovi item, spero di non fare qualcosa di estremamente sbilanciato..\n\nMedaglione dei Solari di Ferro ( {{item:3190}} )\n\n* Lo scudo scala anche con l&#039;1,5% della vita massima del possessore. \n* 400 punti vita---&gt; 350 punti vita\n\nScimitarra di Mercurio ({{item:3139}})\n\n*  35 resistenza magica ---&gt; 40 resistenza magica\n*  3700 g ---&gt; 3500 g\n\n\nScettro del Potere\n\n* 120 potere magico\n* 10% cooldown reduction\n* 3300 g\n\nAbilita passiva unica: Ogni 8 secondi la tua prossima abilit&agrave; infligge danni puri per il 10% del tuo potere magico totale.\nAbilit&agrave; attiva unica - Potere: Per 4 secondi tutte le tue abilit&agrave; infliggono danni puri per il 5% del tuo potere magico totale. \n\nPer costruirlo ci vogliono: {{item:1058}} + {{item:3108}}  + 1230 g\n\n\nAscia del Berserker (Solo Mischia)\n\n* 40 attacco fisico\n* 15 penetrazione armatura\n* 10% cooldown reduction\n* 2512 g\n\nAbilit&agrave; passiva unica: Quando colpisci un nemico con un attacco base o un&#039;abilit&agrave; a bersaglio singolo lo rallenti del 25% per 1,5 secondi.\n\nPer costruirlo ci vogliono: {{item:3134}} + {{item:1036}}  + 815 g\n\nE&#039; tutto, spero che accogliate in bene la mia proposta e anche se non sar&agrave; cos&igrave; vi prego di commentare.","replies":[{"poster":"BrattishSolid6","date":"2015-10-25T08:18:21.697+0000","up_votes":2,"down_votes":0,"body":"Premetto che, mi spiace per te, ma questi cambiamenti non verranno neanche lontanamente presi in considerazione. Alla Riot sanno già cosa cambiare per le prossime patch, e alcuni di questi oggetti li hai sbilanciati proprio tu ahahahah Tutto quello che dirò ovviamente prendilo per quello che è, ovvero una mia personale opinione :) Andiamo con ordine:\n\nMedaglione dei Solari di Ferro.\nCambiamento carino, ma l'1,5% degli hp massimi sai quanto è? Su un tank da 4000hp incrementeresti lo scudo di appena 60. Valore minino persino per i champ più squishy, non sarebbe worth come buff. Poi, diminuisci di 50 gli hp aggiuntivi e alzi il prezzo, rendendolo alla fine un item costoso che dà statistiche minori. A me non piace molto come cambiamento.\n\nScimitarra di Mercurio.\nIl cambiamento all'attiva è controproducente. La si usa per rimuovere buff e **scappare**. Se non aggiungi quel minimo di velocità aggiuntiva diventa una semplicissima Purificazione. Se io adc vengo focusato e vengo colpito da più CC, difficilmente poi resterei lì a combattere. La presenza di più CC implica il trovarmi in un tf, e se sono già arrivati a me, mettermi a sparare contro 2/3/4 persone stando fermo sarebbe l'ultimo dei miei pensieri. Bisogna riposizionarsi, o scappare, o piuttosto continuare un inseguimento se si è stati CCati durante quest'ultimo. Inoltre, solitamente è un item da late game (solitamente, ribadisco) e limitarne anche l'attacco fisico a favore della resistenza magica non mi sembra così buono. A quel punto della partita si è identificato il ruolo di un champ: chi è tank è tank, chi è squishy è squishy. Aumentare le difese a discapito dell'attacco, inserendo quindi un minimo fattore \"tank\" su uno squishy con alto potenziale di danno e togliendo \"attacco\", mi sembra controsenso.\n\nScettro del potere. \nNon so se te ne sei accorto, ma la quantità di danni che procurerebbe con attiva e passiva sarebbe trascurabile. In genere un champ full AP in late game arriva ad avere tra i 700 e i 1000 AP. Il 5% su 1000 AP sarebbe 50. 50 danni puri. Ogni 30 secondi. Il timing suggerirebbe l'essere un item da lane. Lo scaling da late-game e tf. In un tf significa attivare la passiva UNA VOLTA SOLA. E per infliggere 50 miseri danni in più. Con l'attiva, presupponendo che tutte le tue abilità facciano danno e che tu le attivi tutte entro 3 secondi, faresti l'8% del tuo AP come danno puro aggiuntivo. Su una base di 1000 AP faresti 80 danni puri, non trascurabilissimi, ok, ma a quel punto non conviene comprarsi un oggetto che dà direttamente più AP o che aggiunge penetrazione magica? A me sembra fin troppo debole, considerando che esistono già item {{item:3100}} che ogni 1.5 secondi aggiungono il 50% del tuo AP come danno al prossimo AA.\n\nAscia del Berserker\nScusa ma non ho più tempo e volevo postarti quello che avevo già scritto c: A prima vista mi sembra una seconda versione del {{item:3022}}, ma non ho tempo di approfondire.\n\n\nScusa se ti ho distrutto tutto quello a cui avevi pensato ^^","replies":[{"poster":"Br0ken Sword","date":"2015-10-25T19:32:07.257+0000","up_votes":1,"down_votes":0,"body":"Non hai bisogno di scusarti, leggendo il commento mi sono reso conto che hai ragione su alcune cose, però ti devo dire che 60 di scudo in più su 5 persone sono 300 danni in un teamfight, quindi non è proprio brutto come cambiamento, diciamo che fa comodo ma non è un granchè, ho ridotto di 50 gli hp a causa dello scaling sulla vita massima, per il resto hai ragione, per questo ho cambiato un pò le statistiche.\nRiguardo all'Ascia penso che l'unica cosa che ha in comune col {{item:3022}} è lo slow sugli aa.\nSullo scettro del potere come hai detto tu è un item da lane con scaling per il late-game, è infatti ideato come sostituto del Luden, lo dovresti fare come primo o secondo oggetto se fai il Morello.","replies":[{"poster":"BrattishSolid6","date":"2015-10-25T19:54:09.237+0000","up_votes":1,"down_votes":0,"body":"Ascia del Berserker:\nNon male come item. Perlomeno sarebbe l'unico sostituto alla Youmuu come evoluzione del Brutalizzatore (se non sei jungler). Questo la rende carina, sì. Applica slow sugli AA. Come volevo dire stamattina, io la vedo come una seconda versione del {{item:3022}}. Quest'ultimo per i tank, questa Ascia per i più squishy che intendono rimanere tali. \n\nRiguado allo scettro del potere, continuo a pensare che sia un po' strano come abbinamento il \"item da lane\" con \"scaling da late-game\" xD più che altro aumenterei lo scaling. In early-mid game sarebbe TOTALMENTE trascurabile. Voglio dire, con 200AP faresti 2 danni puri. 2. Con 500AP ne faresti 10. Voglio dire, è troppo troppo poco. Ha anche statistiche difensive (quei 300HP) che lo spingono verso il tank/utility (come lo scettro di Rylai per intenderci) ma poi di utility non ha nulla.\n\nNon so, a parte l'ultimo, che si potrebbe ancora perfezionare ulteriormente, gli altri non mi convincono così tanto. Se non altro è bello che qualcuno pensi a possibili cambiamenti, aiuta molto a pensare a cosa gli oggetti sono mirati (esistenti e non) :D se avrai altre idee e vuoi un'opinione, il forum credo sia proprio il posto giusto","replies":[{"poster":"Br0ken Sword","date":"2015-10-25T20:53:44.955+0000","up_votes":0,"down_votes":0,"body":"> [{quoted}](name=BrattishSolid6,realm=EUW,application-id=cAOZwaUi,discussion-id=BpFL4qE0,comment-id=000000000000,timestamp=2015-10-25T19:54:09.237+0000)\n>\n> Ascia del Berserker:\n> Non male come item. Perlomeno sarebbe l'unico sostituto alla Youmuu come evoluzione del Brutalizzatore (se non sei jungler). Questo la rende carina, sì. Applica slow sugli AA. Come volevo dire stamattina, io la vedo come una seconda versione del {{item:3022}}. Quest'ultimo per i tank, questa Ascia per i più squishy che intendono rimanere tali. \n> \n> Riguado allo scettro del potere, continuo a pensare che sia un po' strano come abbinamento il \"item da lane\" con \"scaling da late-game\" xD più che altro aumenterei lo scaling. In early-mid game sarebbe TOTALMENTE trascurabile. Voglio dire, con 200AP faresti 2 danni puri. 2. Con 500AP ne faresti 10. Voglio dire, è troppo troppo poco. Ha anche statistiche difensive (quei 300HP) che lo spingono verso il tank/utility (come lo scettro di Rylai per intenderci) ma poi di utility non ha nulla.\n> \n> Non so, a parte l'ultimo, che si potrebbe ancora perfezionare ulteriormente, gli altri non mi convincono così tanto. Se non altro è bello che qualcuno pensi a possibili cambiamenti, aiuta molto a pensare a cosa gli oggetti sono mirati (esistenti e non) :D se avrai altre idee e vuoi un'opinione, il forum credo sia proprio il posto giusto\n\nPer lo scettro ho pensato di aggiungere 20 ap e di togliere gli hp per sostituirli con 10% di cooldown reduction, il che porterebbe a mettere solo 5% cdr nelle rune per gli ap caster invece del 15% cosicchè 5% dalle rune + 5% dalle masteries + 20% dal morello + 10% da questo e si arriva a 40% lasciando spazio nelle rune per prendere mres. Così non è più un item da lane, ma totalmente da mid-late game.\nL'ascia mi sono accorto che non aveva senso che si costruisse dal brutalizer e non avesse cooldown reduction e ho ridotto l'ad che aveva perchè sommato a quei 15 di penetrazione armatura dava qualcosa di troppo forte, specie se lo si buildava come primo oggetto.","replies":[]}]}]}]}]}