{"poster":"proMINscuous","date":"2015-04-16T02:55:08.690+0000","title":"Yasuo","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":2,"body":"Has Yasuo been changed or something? Cause whenever a Yasuo is on my team or on the enemy team most of the time in lane they will feed, sometimes rarely I see a Yasuo does well in lane, but most of the time they feed in lane. Can someone tell me why is that?","replies":[{"poster":"Heckiron","date":"2015-04-16T12:45:31.095+0000","up_votes":1,"down_votes":0,"body":"not always.it depends on the chamipos they are fighting.for example i sometimes  go well if im fighting another yasuo or ahri but i Dont do so well when i am fighting agianst a xearth or  victor.Or maybe just bad luck.","replies":[{"poster":"kJs","date":"2015-04-18T00:47:17.437+0000","up_votes":1,"down_votes":0,"body":"Viktor bypasses your wall with his W, E, and R. Xerath also does with Q, W and R. Whilst Yasuo can pass through another's wall, and Ahri can effectively be negated if all of her abilities are blocked by the wall.","replies":[{"poster":"Heckiron","date":"2015-05-28T07:35:28.291+0000","up_votes":1,"down_votes":0,"body":"Yeah your wind wall is useless when your versing a champion you\n cant block","replies":[]}]}]},{"poster":"WEETBIX 4 BREKKI","date":"2015-04-17T15:49:31.814+0000","up_votes":1,"down_votes":0,"body":"they made it so you need to think when you play yasuo, this doesn't generally go down well with the league community thus now he can't penta with just his ult people are feeding.","replies":[]},{"poster":"Sniff","date":"2015-04-17T10:26:30.325+0000","up_votes":1,"down_votes":0,"body":"People are still adjusting to the recent nurfs and changes to him. He has change a lot the last couple of patches","replies":[]},{"poster":"iNoob","date":"2015-04-16T04:20:07.420+0000","up_votes":1,"down_votes":0,"body":"Yasuo is best if you are duoing or playing in high elo, because he is so easy to gank... but with solid mechanics and a jungler which counterganks he can be deadly...","replies":[{"poster":"IDØL","date":"2015-04-16T12:37:57.724+0000","up_votes":1,"down_votes":0,"body":"Yup. He's squishy as poo early game.\n\nYou really need some damage items on him before he can actually go ham.","replies":[]}]},{"poster":"RLG Shaky","date":"2015-04-16T12:06:02.320+0000","up_votes":1,"down_votes":0,"body":"I'm pretty sure he's doesn't have a 100% crit strike anymore, i think its like 97.somethign, I'm not to sure but i think many people play yasuo cause of how op he was but only skilled yasuos handled the nerf, while the others just can't do it, nd your probably getting trash cans that play yasuo","replies":[]},{"poster":"Shashe","date":"2015-04-16T03:23:18.984+0000","up_votes":1,"down_votes":0,"body":"Maybe you're just being matched with bad Yasuos.","replies":[]}]}