{"poster":"ZealxWest","date":"2017-01-31T12:29:03.028+0000","title":"Horrid Top player needing help","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":1,"body":"Hey guys, I main Renekton, Jayce and Garen top lane.... I picked um for i like their mechanics and their ability to do well in lane. I just levelled to 30 did my 10 games, but when i did my 10, i noticed how bad i was at this game. I really really enjoy the game i play close to 5 hours a day and watch about 2 hours of videos on you tube about league.  I have played previous seasons in NA but never took it seriously. Now im seeing just how bad i am... In my 10 games i won 2 and never did i win my lane... i think out of 10 games i got 5 kills and probably a total of 400 cs.... but i was ganked heaps and bullied in my lane to the point i couldn&#039;t cs.... I just don&#039;t know what to do... any tips or inspiration would be great cause im to the point i pretty much dont wanna play anymore. :/","replies":[{"poster":"dragon poo","date":"2017-01-31T14:07:42.955+0000","up_votes":3,"down_votes":0,"body":"play at least 1000 game sof normals, familiarize yourself with the game, the champions, how fast things travel, the core elements of the game.","replies":[]},{"poster":"SEKAI","date":"2017-01-31T13:01:28.561+0000","up_votes":2,"down_votes":0,"body":"By the 10 games you meant the Ranked Provisional?\n\nIf that's so your problem is the severe lack of experience, because you just leveled to 30. And the solution is simply:\n**\nPlay more Normal games,** most experienced players in LoL would tell you that you need at least 200 Normal wins under your belt to be qualified to even think about tackling Ranked mode.\n\nThe reason for this is that this genre itself emphasises a lot on the burden of knowledge and experience. You need to learn not just your champions, but also your opponents and allies', the different match-ups, synergy, countering, the different routes, general game-sense and all sorts of stuff; and currently you most likely lack too much.\n\nJust relax, and play more Normals.\n\nBesides, there is no need to come rushing into Ranked in the first place anyway, since the seasonal rewards are all cosmetics like icons and borders which mean pretty much nothing and the seasonal skin rewards are generally not the prettiest anyway, unless you are the show-off kinda guy then well. So just take your time and learn the nuances.","replies":[]},{"poster":"gimble","date":"2017-02-01T00:24:28.224+0000","up_votes":1,"down_votes":0,"body":"I'm going to suggest something a bit different to the others.\nI think the reason people suggest not rushing in to ranked is due to the likelihood of being placed low... and ending up in Cardboard 12 MMR.... Ego.\n\nOne of the problems with normals is that not everyone playing normals is playing to win... people will be trying odd builds, off meta team comps, etc much more frequently. Also theres the hassle of champ select, trying to play the role you want to play.\n\nIf you are keen to get better at league and don't mind the blow to the ego that would be being the lowest rank... just play ranked que.\nConcentrate on 2 things only first: CS and 'Not Dying'\nIf you can CS at even 5/min and keep your deaths to <5 per game you are already streets ahead of most people in the depths of Bronze.\nTry to ping when your lane opponent is missing\nDon't worry about or focus on kills or objectives yet...\nOnce you can maintain CS and not die... then start worrying about harrassing, engaging, objectives.\n\nIt may be slow progress but you will climb with this strategy.\nI did the same thing... played mainly Co-op until level 30, then tried ranked. Ended up being placed in S1, somehow managed to climb into silver with Vayne, prob was carried... then dropped like a lead weight to B5! I just used the time in B5 to learn.\n\nTLDR; take ego out of the equation, learn in the depths of bronze, and climb out. ez pz.","replies":[]},{"poster":"Arkangyle","date":"2017-01-31T23:37:24.921+0000","up_votes":1,"down_votes":0,"body":"Same as the previous two comments. Play more. I rushed into ranked too, biggest thing I learned early is that if your lane opponent is outfarming you (and I'm talking 30-40cs in the first 5-10 minutes) you're going to be behind all game.\n\nThe champs you like all do really well if they can get ahead early and snowball. Doesn't look like that's been how your games have been going.\n\nHaving a quick look at your last few ranked matches:\n\n72 cs in a 28min game\n113 cs in a 29min game\n98 cs in a 29min game\n\nAll ended up as losses.\n\nYour most recent top lane win was 180+ cs (and you picked up 7 kills) - the difference between that and the losses was at the same time in the game you had 2-3 items plus boots instead of 1 item and some components.\n\nSo practice. Practice practice practice. Get better at farming. Know when to go for a kill and when to burst and fall back. Know when to chase and when not to. Place more wards to increase your chance of surviving ganks. Learn some of the common matchups you get in your lane and how to play against them.","replies":[]}]}