{"poster":"Captain Fortune","date":"2017-04-05T00:19:28.342+0000","title":"Rakan and Xayah Gameplay and Strategy Discussion","subforum":"Gameplay & Strategy","up_votes":5,"down_votes":2,"body":"[ÜRES]","replies":[{"poster":"I Stealth I","date":"2017-04-05T08:03:49.427+0000","up_votes":1,"down_votes":0,"body":"Well, I know that they're supposed to be a bot lane comp but is it possible to take Xayah mid? \n\nThe reasons for why I see this is that \n\nA) You need to prepare for a kill using your feathers \nB) All your abilities have a 100% AD ratio, so an assassin build could potentially work, considering that she has an attack speed steroid in her kit \nC) She does have low mana costs and cooldowns AND a fairly good CC\n\nWhat do you think?","replies":[{"poster":"Ninox","date":"2017-04-05T09:05:39.511+0000","up_votes":1,"down_votes":0,"body":"Obviously having not played her, I'd be inclined to say yes. Her kit definitely seems like it would work out well there. Not sure how we'll she'd do with an assassin build since her mobility/cc is very limited, but a damage heavy bruiser build would likely work pretty damn well on her. In fact, she'd probably make a pretty good top laner too.","replies":[{"poster":"Captain Fortune","date":"2017-04-05T12:32:54.953+0000","up_votes":1,"down_votes":0,"body":"Hey Seras,\n\nThe point you have brought up about building her like a heavy bruiser intrigues me since I can't really think of a ranged AD bruiser at the current moment off the topic of my head. Since she wouldn't be able to buy something for example such as a Titanic Hydra, what sort of item build do you think she would go for to pull of this heavy bruiser build that you mentioned? I am curious.\n\n~Elam","replies":[{"poster":"Ninox","date":"2017-04-05T12:43:39.466+0000","up_votes":3,"down_votes":0,"body":"Well the closest comparison I have would be to someone like Quinn (who doesn't really build that way anymore but used to). Item like BC, Edge of Night, any Lifesteal items. Stuff that's heavy on the damage but still have defense elements. Basically just not full AD/AS/Lethality builds, throw some health/res/LS in there.","replies":[{"poster":"Captain Fortune","date":"2017-04-05T12:53:24.561+0000","up_votes":1,"down_votes":0,"body":"Ahhh, I see what you mean.\n\nDo you think possibly item combinations such as either Blade of the Ruined King (Or Bloodthirster) paired with a Spirit Visage would work well for this sort of build? Giving her the Magic Resist and Health from the Spirit visage, but also increasing the healing from the life steal of the other item helping her sustain for longer in team fights.\n\nI think that this also might come down to how fast her attack speed is and if you run attack speed quints/marks on her, so runes are also something that might be worth considering here. Let me know what you think.\n\n~Elam","replies":[{"poster":"Ninox","date":"2017-04-05T13:27:28.889+0000","up_votes":2,"down_votes":0,"body":"I think yes, and I do think you'll have to build some attack speed int here somewhere so BotRK will likely be a must in such a build if you don't cram in it there elsewhere (maybe Wit's End?). Ofc having an enemy team for which Spirit's would be appropriate is easier said than done.","replies":[{"poster":"Captain Fortune","date":"2017-04-06T00:23:22.982+0000","up_votes":1,"down_votes":0,"body":"Yea I agree with your points.\n\nPossibly vs an AD team could you consider the likes of items such as Iceborn Gauntlet or Sterak's Gage? Both of which would give you some of the stats you need to take AD damage but also give you damage. It also made me think of the possibly of a Frozen Mallet possibly working on her, It has been a while since we have seen that item but it could may work given the correct situation.\n\nThoughts?\n\n~Elam","replies":[{"poster":"Ninox","date":"2017-04-06T04:47:20.259+0000","up_votes":2,"down_votes":0,"body":"Pretty much my thoughts. All those tanky AD items that only really see niche use where a brusier like Rene will buy one or two of them. I think some combination of those items with some AS and LS would make for a solid top lane build on her.","replies":[]}]}]}]}]}]}]},{"poster":"Captain Fortune","date":"2017-04-05T12:17:55.814+0000","up_votes":1,"down_votes":0,"body":"Greetings StealthVortex88,\n\nYou have some good points with what you have brought up, I am curious though with you being an Assassin player yourself, how do you think the builds on her would pan out if you were to play her mid?\n\nI can imagine items such as Youmuu's Ghostblade working quite well as it gives her the movement speed that she needs to be an assassin along with the damage she needs to burst down people. I can also see items such as Hexdrinker and Black Clever working well, but I am curious if you had thoughts as to what could work well on her considering what we know about her kit if we were to play her like an Assassin.\n\nLet me know what you think/if you have any ideas.\n\n~Elam","replies":[{"poster":"I Stealth I","date":"2017-04-05T13:15:24.206+0000","up_votes":1,"down_votes":0,"body":"Honestly, i think a Lethality Build would work but I'm unsure until I've actually tried it. \n\nSomething like:\n\nYoumuu's for kite/engage\nEdge of Night for the spell shield\nDuskblade for the true damage\nNinja Tabi for damage reduction\nBlack Cleaver for armour shred \nFinal item would be situational\n\nPotentially a Trinity Force, considering she needs to use her abilities to utilise her passive \n","replies":[{"poster":"Captain Fortune","date":"2017-04-06T00:30:06.452+0000","up_votes":1,"down_votes":0,"body":"Yea I could see this sort of build working great. IMO the boots that you build would be situation though between Ninja Tabi and Mercury's Treads. Depending on if you are vsing a lot of auto attacking damage such as a Vayne or etc, or vsing a lot of hard crowd control. (Actually makes me think QSS as a possible situational item.)\n\nAs for the last item that would be situation, do you think for defensive items things such as a Guardian Angel, Banshee's Veil or a Randuin's Omen would work well? I can see each of them fixing a specific situational need that she might need in a game depending on the team comp she is going up against, or depending on how many Guardian Angels are on your team already. _Since having a team with 3+ Guardian Angels can work quite well in team fights, and be frustrating for the enemy team._\n\nWhat are your thoughts?\n\n~Elam","replies":[]}]}]}]},{"poster":"MYSTICmagic","date":"2017-04-05T13:57:41.829+0000","up_votes":1,"down_votes":0,"body":"just an idea how would deathsdance go with Xayah I feel like it would be good with her ult and e and even maybe her q or passive but I am not sure. Off the top of my head but doesn't deaths dance heal increase from 15% to 33% if it is aoe damage. Could be wrong but Xayah seem to have a bit of aoe and she would work good with cooldown reductions as well.","replies":[{"poster":"Ninox","date":"2017-04-05T15:45:16.380+0000","up_votes":1,"down_votes":0,"body":"It's 33% as effective for AoE, so instead of 15% it's like 5% (with a whole bunch of ugly decimals that come from trying to split 100 into 3). 15% heal from Aoe damage would be more than a little OP, 33% would just be broken.\n\nThat said, Death's Dance may well be a good item on her.","replies":[{"poster":"Talon12","date":"2017-04-06T00:52:39.190+0000","up_votes":1,"down_votes":0,"body":"Think they just meant 33% of 15%, muddles wording though.\n\nAnd I meant 50% of her w damage, the 80% was as in the damage he does is 80% of hers","replies":[{"poster":"Ninox","date":"2017-04-06T04:46:14.191+0000","up_votes":1,"down_votes":0,"body":"Yes that's what I meant, 33% of 15 is roughly 5 if you ignore the ugly numbers....unless my math is worse than I thought it was, but I'm pretty sure I got that one right at least.\n\nI'd still argue it won't be 50% but I don't think we'll really know for sure till we can play her/them.","replies":[{"poster":"Talon12","date":"2017-04-06T05:10:42.725+0000","up_votes":1,"down_votes":0,"body":"33% is generically equal to 1/3, 1/3*15=15/3=5","replies":[{"poster":"Ninox","date":"2017-04-06T06:06:42.521+0000","up_votes":1,"down_votes":0,"body":"yay so I was right :) 5%~ healing","replies":[{"poster":"Talon12","date":"2017-04-06T09:37:13.167+0000","up_votes":2,"down_votes":0,"body":"Its not approx, it is simply 5% not 5.01 or 4.99","replies":[{"poster":"Project Xayah","date":"2017-04-06T11:03:52.041+0000","up_votes":1,"down_votes":0,"body":"I'd agree with this.\n\nI'm under the impression that the \"33%\" represents 1/3 (33.3-recurring-%), though was simply kept as \"33%\" for clarity (it get's confusing when you work with recurring decimals, so easier to just show people a flat number that basically represents the same thing), so the \"15%\" would get reduced to a flat \"5%\".","replies":[{"poster":"Ninox","date":"2017-04-06T13:18:16.737+0000","up_votes":1,"down_votes":0,"body":"Yeah but assuming 33 is the actual number they are using and not just a nice display number in place of the recurring then it's not quite 1/3 (it'd be just under) but that's really just a technicality. A fraction of a percent of lifesteal isn't going to make any practical difference ever :P\n\nOfc, it could just be they're using 1/3 but wanted to keep percentages for clarity since that's what's everything else uses then it would just be a flat five yeah.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Mordekáiser","date":"2017-04-05T02:14:08.047+0000","up_votes":1,"down_votes":0,"body":"Does Xayah's W apply on-hit effects such as BotRK, or does it function like Ashe Q's mini projectiles?\n\nCan't seem to find this anywhere and it has a pretty big bearing on how the champ functions..","replies":[{"poster":"Captain Fortune","date":"2017-04-05T03:25:46.317+0000","up_votes":1,"down_votes":0,"body":"Greetings Sans,\n\nI have a friend of mine testing this on the PBE as we speak, I have been told that it does apply Red Buff, but it doesn't add extra stacks to Guinsoo's Rageblade. Getting them to test BotRK atm, and along with that: Runaan's Hurricane as I think that would be a cool synergy if the feathers went to all 3 targets.\n\n(Keep in mind as these things are on PBE, there might be a few changes to stats or how these things work before these two go live.)\n\nI will let you know what happens when they test it.\n\n**EDIT:**\n\nThey have tested Runaan's Hurricane and it does work with her W. \n\nAs for BotRK, we are currently trying to figure out a way to accurately test if this works because to test it I think you would have to have the exact amount of AD without a BotRK, check the damage from W, then get the exact same amount of AD with BotRK then check the damage again. Any ideas for this?\n\n~Elam","replies":[{"poster":"Mordekáiser","date":"2017-04-05T05:11:09.401+0000","up_votes":1,"down_votes":0,"body":"Mm,\n\nCould test using either Wit's End or Nashor's Tooth; they have set values for their damage, and as they do magic damage it should be easier to see how the ability interacts with just the on-hit effects. Nashor's would probably be best, as the lack of MR shred makes mathing easier.\n\nI'm guessing three potential scenarios:\n\nGivens: Assuming no additional AP and no MR: Nashor's will deal 27 magic dmg on-hit for one auto\nXayah activates her W then auto's once:\n\nScenario 1: the W applies on-hit effects fully; Target takes X amount physical dmg due to auto and 54 magic dmg due to nashor's proccing twice \n\nScenario 2: the W does not apply on-hit effects; Target takes X amount physical dmg due to auto and 27 dmg dmg to the initial auto's nashor's tooth on-hit\n\nScenario 3: the W takes the 20% dmg text very seriously; Target take X amount physical dmg due to auto and 27+5.4 magic dmg from both the nashor's tooth auto and the bolt.\n\nSo pretty much: Auto once with a nashor's without the W on, then once with a nashor's with the W on. If there is no increase in the amount of magic dmg taken, then it is Scenario 2. If the magic dmg increases very slightly, then it is Scenario 3. If the magic dmg doubles / nearly doubles (accounting for MR), then it is Scenario 1.\n\nObviously Nashor's is probably not ideal build on her, but it is the easiest way to determine how on-hit effects in general will work.\n\nThanks for your time!\n\nsans","replies":[{"poster":"Captain Fortune","date":"2017-04-05T12:29:13.264+0000","up_votes":1,"down_votes":0,"body":"Good thoughts, when I get a chance I will either have my friend who tested Runaans for me or I will test it myself and see what becomes of it and let you know.\n\nThanks for the ideas and clear layouts of the scenarios, this will be an interesting way to test things if it works out well. While I am at it might as well test if it works with any of Rakan's abilities for something we might have missed that could open the path to new builds. Makes me think that Iceborn Gauntlet could work quite well on him, even more so if his Q procs the slow effect.\n\nI will let you know what I find out.\n\n~Elam","replies":[{"poster":"Mordekáiser","date":"2017-04-08T11:09:19.390+0000","up_votes":1,"down_votes":0,"body":"Any luck finding out how it works?","replies":[{"poster":"Captain Fortune","date":"2017-04-08T23:27:39.325+0000","up_votes":1,"down_votes":0,"body":"Alright so, I tested this this morning and decided to record what happened to make sure I was understanding the interaction correctly.\n\nhttps://youtu.be/g0fMsLICbtk\n\nSo from what I understand, it is \"Scenario 2\" that you described in the fact that the target took the on-hit magic damage (Being 13 in this case because Target Dummies have 100 magic resist.) However they don't take any magic damage past this when using Xayah's W: Deadly Plumage.\n\nI tested this using two Target Dummies so that the difference in damage could clearly be seen. One taking a regular auto attack from Xayah, the other taking a W.\n\n_All this testing was done on the PBE on the patch of when this is being written._\n\n---\n\nHopefully I have understood this correctly and all that fun stuff, let me know if that all makes sense.\n\n~Elam","replies":[]},{"poster":"Captain Fortune","date":"2017-04-08T12:11:46.328+0000","up_votes":1,"down_votes":0,"body":"Going to be testing this out hopefully tomorrow! Thank you for the reminder.\n\n~Elam","replies":[]}]}]}]}]}]},{"poster":"Project Xayah","date":"2017-04-05T01:55:39.540+0000","up_votes":1,"down_votes":0,"body":"Seems like they would be ideal as a damage focused duo bot lane, Xayah as the ADC and Rakan as the support. Honestly, I thing this may do a world of good for bot-lane synergy, and (based on how things look now) I would definitely recommend these two to any bot lane mains, I know I'm going to get them (somehow).\nRakan also seems like a (potentially) decent jungler. Regular shielding from the passive, heals from champs and epic monsters, good engages and a good little bit of crowd control.\nXayah could, perhaps, work as an assassin. Seems to have fairly reliable \"sustained burst\" damage, as well as a movespeed buff. Personally, though, I'd take her top, if not bot.","replies":[{"poster":"Captain Fortune","date":"2017-04-05T03:21:02.506+0000","up_votes":1,"down_votes":0,"body":"Yea me and a friend of mine were thinking very similar things. \n\nOn the note of Rakan possibly working in the jungle, a big thing to consider is his speed in the jungle clear and damage he can deal without a few items to help him. I personally am not very expierenced in jungling, but how do you think his clear would stack up vs the other flavor of the month junglers? Imo I think his jungle clear speed and damage would make or break how strong it is.\n\nOn that note though what smite/enchant do you think would work well? I am currently thinking blue smite, but for enchant I could see really any of them working for different reasons.\n\n~Elam","replies":[{"poster":"Project Xayah","date":"2017-04-05T05:18:45.426+0000","up_votes":1,"down_votes":0,"body":"Honestly, I'm not a jungler either. I avoid jungle whenever possible. I don't even know what the clear speed of \"flavour of the month\" junglers is, so I have no basis for comparison. My observations go as far as \"he has some good utility to assist his jungling potential\".\n\nIf I had to pick a smite/enchant, though, I'd have to go with Challenging Smite, for the damage reduction it gives (Chilling Smite steals movespeed, which doesn't seem to be a problem for Rakan), and either Cinderhulk (for a defence focus) or Runic Echoes (for an offence/mobility focus).\n\nThough, considering their potential for jungler/assassin, it's possible they could work well as more of a \"roam duo\" with Xayah taking midlane and Rakan taking the jungle, as long as they can keep the enemy midlaner in check to allow opportunities to roam (which is likely going to be a great deal harder with the completely unnecessary Lux buffs that just went through).","replies":[{"poster":"Captain Fortune","date":"2017-04-05T12:24:37.645+0000","up_votes":1,"down_votes":0,"body":"Yea you have some great points with the damage reduction from Challenging Smite. \n\nAnother thing to consider would also be to consider picking up a Tracker's Knife. Reason being with Rakan's mobility, he could easily duck in and out of the enemy jungle placing key wards to keep an eye on where the enemy jungler is and tell that information to your team.\n\nI could also see the roam duo working quite well, another thing to consider is if you were playing Xayah mid lane you could have something like a Shen on the team as well, that would allow for the entire team to be bot lane if needed to start a team fight very quickly or be able to turn a gank. This could even be said for if you wanted to take the Xayah pick top lane, you could also pick something like a Twisted Fate in mind for that roaming ult.\n\nI agree with your enchant choice that is what I was thinking myself, unless we are missing something with possibly Warrior, but I feel like if we wanted damage Runic Echoes might be better on him. However I would like to test both to see which works better.\n\nLet me know what you think.\n\n~Elam","replies":[{"poster":"Project Xayah","date":"2017-04-05T14:05:12.341+0000","up_votes":1,"down_votes":0,"body":"Thing is, Rakan has no AD scaling, so the Warrior enchantment would likely only be good for the CDR, with the additional AD being useful in the early, perhaps mid, stages of the game, then falling off. Honestly, I'd see more reason to use Bloodrazer for the bonus attack speed, which would work well with his passive, and the bonus damage, if you were going for a more \"AA sustained damage\" build (which doesn't seem to make much sense for Rakan).\n\nThing is, with an AP scaling tank/bruiser in the jungle, Runic Echoes is leagues ahead of Warrior because of the additional AP, the movement speed, the Echo passive and the 250% damage with 18% of missing mana from using the passive on large monsters. I just can't see any reason to use Warrior over Runic Echoes on a champion like Rakan.","replies":[{"poster":"Captain Fortune","date":"2017-04-06T00:46:35.682+0000","up_votes":1,"down_votes":0,"body":"Yea you have a good point, thinking about it with the stats you brought up Runic Echos is the better choice it seems if we wanted a damage enchant.\n\nCurious, if we were to spin the build in a direction of an AP scaling tank/bruiser, what other items do you think would be built on him to match this play style? Do you think he would build similar to junglers like Elise maybe? I could see some similarities thinking about it in items that would work well on both.\n\nThoughts?\n\n~Elam","replies":[{"poster":"Project Xayah","date":"2017-04-06T02:59:42.453+0000","up_votes":1,"down_votes":0,"body":"If I had to pick out some items myself, I'd go with a Randuin's Omen as an Armour item (or maybe a Knight's Vow if duo bot/roaming with a Xayah), a Spirit Visage for Magic Resist (or perhaps an Abyssal Scepter if there's a couple strong allied mages/AP assassins), perhaps a Warmog's Armour (or Guardian Angel), a Rylai's Crystal Scepter or Rod of Ages for some AP and a Mercury's Treads for the Tenacity.\n\nThat's just me, though.","replies":[{"poster":"Project Xayah","date":"2017-04-07T00:24:53.030+0000","up_votes":1,"down_votes":0,"body":"So there's a few item reworks that have appeared on the PBE that would influence this build, so I'm just going to keep track of the changes and (try) to keep a list of updates in this post. Currently using item changes as stated here: http://www.surrenderat20.net/2017/04/46-pbe-update.html#balance\n\nRanduin's Omen has a few changes; lower cost, Health and Slow Duration, no longer impacts Critical Strikes and has a higher Slow percentage, I'd still use this as an Armour item.\nSpirit Visage; Seems to just be shifting a bit of power from Health to Magic Resist, I'd still use it.\nAbyssal Scepter; Had base stats swapped with Banshee's Veil, I'd definitely switch over for the Spell Shield passive.\nWarmog's Armour; Passive Health \"activation\" limit reduced, passive Health Regen increased, I'd definitely still use it.\nGuardian Angel; Magic Resist removed, Attack Damage added, passive buffed, seems less useful for an AP scaling tank/bruiser, taking it out of build (possibly replace with Gargoyle Stoneplate [new item]).","replies":[{"poster":"JasonWazza","date":"2017-04-07T00:51:07.661+0000","up_votes":1,"down_votes":0,"body":"Honestly, if you have Xayah i'd go with GA, otherwise i would consider swapping it, the reason being that the buffs Xayah gives means the AD multiplies in worth meaning GA isn't a bad pick for her, otherwise, the AD portion will just be relatively wasted.","replies":[]}]},{"poster":"Captain Fortune","date":"2017-04-06T03:21:50.799+0000","up_votes":1,"down_votes":0,"body":"Yea I was thinking very similar things, if I may allow me to think outloud here but what would be your thoughts on the following items on him in a jungler AP role?\n\n* Hextech Protobelt\nFor engage potential along with some extra damage.\n\n\n* Hextech GPL-800\nFor helping him hit his ult on more targets in a team fight with the slow for the active.\n\n\n* Iceborn Gauntlet\nFor reasons of damage, armour and the AOE slow.\n\n\nThey might not be perfect fits or 100% buy items on him, but they might be situation pick-ups if needed. \n\nThoughts?\n\n~Elam","replies":[{"poster":"Project Xayah","date":"2017-04-06T07:37:44.642+0000","up_votes":1,"down_votes":0,"body":"Protobelt:\nHonestly, I don't see the need for the \"extra\" engage potential this would provide (and honestly, it's not much). Rakan seems like he has enough engage using his Battle Dance (E) if needed to jump to an ally and his Grand Entrance (W), even using the 50% movespeed bonus from The Quickness (R). Seems like a Rylai's or ROA would give about as much AP and health with some extra, more useful, (passive) \"abilities\". I *might* be a bit biased on this one, though, as I tend to stray away from items with actives (especially \"combat\" actives) where possible.\n\nGLP-800 (I think you misspelt this one):\nPersonally, I'd still go with a ROA over the GLP. The active seems to be pretty much only useful (compared to ROA) for the additional damage from the active (the slow seems pretty insignificant, especially compared to what you would get from a Randuin's and/or Rylai's) and, personally, I'd much rather have the additional 200 health that ROA would give. Not to mention ROA has the same passive (mana back on being damaged, health back on mana expenditure).\n\nIceborn Gauntlet:\nI've always seen this as being suited to AD scaling bruisers, in fact it's an item I might rarely use on Quinn (rarely being the operative word). I don't see it being overly useful for Rakan, especially if we were to talk about a tankier or AP oriented build. You can still get the armour and superior damage potential from other items and the slow can easily be replaced by a Rylai's, which seems to give better stats for Rakan.","replies":[{"poster":"Captain Fortune","date":"2017-04-06T07:51:39.219+0000","up_votes":1,"down_votes":0,"body":"Good points, and yes seems I did miss spell that xD I agree with what you have brought up, at the moment I am just kind of throwing things at the wall and seeing what sticks, without really thinking too much initially before throwing it. (Since we are really just theory crafting atm, and there is always time for experimenting in normals and such.)\n\nReason being is sometimes new metas can be born because of things that are deemed \"not good\" without giving it proper thought. So thought I might give these items a shot, just in case.\n\nAny other ideas for items we might not have considered yet?\n\n~Elam","replies":[{"poster":"Project Xayah","date":"2017-04-06T08:50:04.901+0000","up_votes":1,"down_votes":0,"body":"To be honest, Nashor's Tooth might prove to be a (situationally) strong item on Rakan. The bonus Attack Speed and high Ability Power would have a strong effect on his passive shield, as well as providing some CDR and extra AA damage. Likely better in situations that demand more sustained fighting.\n\nIn a jungle scenario against a team with minimal Crowd Control, Mobility Boots might prove more useful than Mercury's Treads.\n\nLooking a bit closer into it, items that build out of Forbidden Idol (Redemption, Mikael's Crucible and Ardent Censer) look to be promising ways of buffing his support potential, thanks to the additional Heal/Shield power.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Lord Sesshomaru","date":"2017-04-05T10:07:51.186+0000","up_votes":1,"down_votes":0,"body":"Im actually genuinely impressed with these two. (especially with Rakan)\n\nObviously they are meant to be kind of like the 'Kindred-that-could-have-been', and work best when they are together. But even individually I think they will be a positive influence in-game.\n\nThe most popular playstyle (at least from my experience) is that of the flashy mobile assassin, and despite neither of them truly being one, they seem to embody all the positive aspects of that playstyle. Bringing that fun playstyle into other lanes (without bringing the much-hated bursty baggage of a true assassin) is great. \n\nIt lets support players have the opportunity to make flashy interesting plays that Lee Sin's, and Leblanc's get to enjoy, without just creating an 'assassin-in-the-bot-lane' type champ like Vayne that just causes problems.\n\nBecause of this, assassin mains will have less animosity when autofilled (or calling late) to support, _(because lets be honest, its usually them that make a fuss)_ and now they have a champion that they can still enjoy just as much, while actually helping the team. \n(FYI picking Zed support isn't helping... You all know who you are!)\n\nXayah as well seems to be a more flashy/ability orientated ADC than others, and those kind of champs (Ezreal, Jhin, Vayne etc.) have always been historically popular. She performs the role of an ADC, but looks to play more like an assassin (unlike Vayne who plays like an ADC but is an assassin), which again opens doors to players who love that style of play.\n\nI think these two will relieve a bit of pressure on mid lane. \nI see many games where sustained or control mages such as Cassiopeia or Viktor would be much more beneficial to the team, but people cant shake the need to play more flashy/playmaking 'exciting' champs. These two provide a unique avenue for people to channel that need, but without compromising the team-comp.\n\nSo lots of mid players may start trying their hand at these two (Hell if there was a support like Azir or Sol, id be on that shit in seconds!) which hopefully frees up the mid lane pool a little. (I'm always striving to see more in-game variety)\n\nIts very clever of Riot to see the styles people find fun, and rather than just releasing more and more assassins (the easy route), they have tried to bring the assassin playstyle into more avenues of the game. Thusly, widening the respective champions a great majority of the population want to play. Which is a lot more positive than flooding the market with more of one very specific class.\n\n\n_________\n\nMy concerns:\n\nwell my greatest concern is Rakan's ultimate. The last time they brought a 'charm' into the game, it quickly became the most cancerous CC known to man. And it was only a **single target skillshot**, not a multi-target.... (i don't even know what to call it).\n\nHowever, it is an ultimate, and unlike Ahri, Rakan alone doesn't seem to have the damage to completely shut-down an opponent in the brief moment that they are disabled. So perhaps there is hope yet.\n\nAnother concern is Xayah's returning feathers. Thats a lot of utility and damage that an opponent has to look over their shoulder for (especially when the actual enemy is in front of you), and it could become very confusing to fight her, you're having to dodge things from both sides, and you lose a lot of damage when trying to sidestep a barrage of snares flying at you from behind.\n\nAlso her untargetability worries me a little, she looks very slippery and hard to catch already, and the whole point of an ADC is that when you do catch them, they DIE! Having someone with that much damage output _(and what also looks like really good kiting potential)_ being able to negate abilities like Camille's ult, Veigar's ult, Leona's ult, etc etc. Abilities that usually are (and should be) death sentences for ADCs. So it will be interesting to see how far she can push this without it becoming a problem.\n\nAgain though, it is an ultimate, and not and E (looking at your sorry ass Fizz), so it might end up actually being quite balanced, its hard to say. \n\nAnother concern: Pick/Bans.\nWhile they can be played separately, they are meant to be together, and when one is banned, it seriously reduces the viability of picking the other.\nLikewise, when you see the enemy team pick one of them, it would be instinct to deny them getting the other, so it will be simple logic to pick the other and deny them the full duo (or ban the other, if this new system of banning comes in with the 10 bans). Because of this, I would assume it would be difficult to get the duo in ranked without prior-organising to pick them in the opening when your team can pick twice in a row. (and if we are honest, that wont happen in any elo below plat, without serious luck.)\n\n________\n\nOverall, I look forward to their release, I'm interested to see where the winds take them. \n\nAnd that recall.... perhaps one of the neatest things ever released in this game.\nand with a fair amount of play potential too. (you can essentially give Xayah more farming time while backing)","replies":[{"poster":"I Stealth I","date":"2017-04-05T10:20:09.704+0000","up_votes":1,"down_votes":0,"body":"But Lorrrrrrrrrd, I'm an assassin main that can play any role and doesn't complain about it. \n\nJokes aside, you do realise that Rakan's Ult is kinda like a OP ghost, so he has to walk through enemies to utilise it? So, i guess he'll have to build tank so he can live while walking through enemies\n\n\nPersonally, I'm looking forward to Xayah because it's like Talon had a daughter and her playstyle, as you said, is very assassin like. Man, all these blade related abilities got me hyped.\n\nHopefully, when I get back from India, the hype would've died down so i can play the champion in peace","replies":[{"poster":"Lord Sesshomaru","date":"2017-04-05T10:37:45.775+0000","up_votes":1,"down_votes":0,"body":"Hahaha yea i know xD (and i play my fair share of assassins too, but don't tell anyone. ;) haha) \n\nYea I know, its an interesting mechanic, i would imagine he would have to build tankier like you say. (or be in a movement speed-orientated team and zip around like the Flash!) But i expect that his dash/shield will come in useful. Tanks will be mid-fight, and he just jumps between them, stunning everything he hits.\n\nWhen I first saw Xayah, i had a feeling you'd like her! :P She does look a lot like Talon's daughter (who knows, perhaps on a mission to Ionia... met a certain fox lady... who can say ;) hehe)\n\nOhh india! Nice! That'll be a shock to the system so ive been told.\nI remember when Taliyah came out, I was in italy, and I was hyped to play her because she reminded me of Azir. \nPerhaps like me and Taliyah, Xayah will join Talon in the ranks of your mains :P","replies":[{"poster":"I Stealth I","date":"2017-04-05T10:50:42.653+0000","up_votes":1,"down_votes":0,"body":"Potentially, yes. I guess it'll take a while for me to get back into the swing of league when i get back. I've been told the Tank update is next, and I won't be back until the 5th of May, so I'm screwed :P","replies":[{"poster":"Lord Sesshomaru","date":"2017-04-05T10:55:36.949+0000","up_votes":1,"down_votes":0,"body":"It doesn't take tooooo long to get back into the swing of it haha xD\n\nWow thats a fair way away. When do you leave? (Maybe you'll be lucky enough to miss the Lee epidemic when this whole God-fist thing explodes.)","replies":[{"poster":"I Stealth I","date":"2017-04-05T11:02:47.838+0000","up_votes":1,"down_votes":0,"body":"I left on the 31st of March, so i missed the 'bots prank' :(\n\nTrue, i hope the Lee sin epidemic is dead by the time i get back","replies":[{"poster":"Lord Sesshomaru","date":"2017-04-05T12:38:58.147+0000","up_votes":1,"down_votes":0,"body":"Oh so you're there now? awesome!\nThe prank was kinda neat, but nothing game changing, don't worry about it haha. :P\n\nYea, i hope so too, but chances are it wont be xD","replies":[{"poster":"Talon12","date":"2017-04-06T09:37:43.274+0000","up_votes":1,"down_votes":0,"body":"Oh man that yasuo rework looks like a damn blast\nFinally fixed all the problems he had in his kit.","replies":[{"poster":"Lord Sesshomaru","date":"2017-04-06T10:02:51.861+0000","up_votes":1,"down_votes":0,"body":"haha I knew you'd like that xD\n\nThe fact that they chose him for the April fools video means they know that he was the one most likely to exact a cry of fear from people :P  Meaning they know that he is too strong already. ;)\n\nThat being said though, recently he hasn't been much of a problem in games (popularity wise) gotta give credit where credit is due!","replies":[{"poster":"Talon12","date":"2017-04-06T10:49:34.751+0000","up_votes":1,"down_votes":0,"body":"Hasnt been popular because near piss status atm. No one has enough skill to play him without feeding, they have realised this and dropped it.","replies":[]}]}]}]}]}]}]}]}]}]}]}