{"poster":"Sensei Katarina","date":"2018-07-03T02:47:01.624+0000","title":"ban di 14 giorni","subforum":"Discussioni generali","up_votes":0,"down_votes":9,"body":"ragazzi ho l account principale bannato per 14  giorni sta cosa non mi garba io so che la colpa e tutta mia xk ho fatto int per&ograve; le motivazione le avuto era una cazzo di normal in blind pick eravano in 3 premade la partita &egrave; durata 17 minuti non &egrave; un po esagerato che mi si banna un account per cosi poco e poi in ranked trovo tumori che flammano feedato a palla insultano tutti e nessuno o almeno una buona parte non viene bannato cio&egrave; la riot &egrave; stupida ? non capisco","replies":[{"poster":"Aurelion Shmoll","date":"2018-07-03T07:43:54.556+0000","up_votes":3,"down_votes":0,"body":"Se non capisci, rileggi il regolamento che sei costretto ad accettare ad inizio di ogni singola patch.","replies":[{"poster":"Sensei Katarina","date":"2018-07-03T10:31:38.288+0000","up_votes":1,"down_votes":0,"body":"io qui mi sto a lamentare nel esagerazione perche alla fine si ok ho sbagliato ma ripero eravamo 3 premade in normal con un partita durata 15 o 17 minuti dove per di più la ragione doveva essere la mia","replies":[{"poster":"Koria","date":"2018-07-03T10:37:26.722+0000","up_votes":2,"down_votes":0,"body":"Che sia normal o ranked sei sempre punibile nella stessa maniera","replies":[{"poster":"Sensei Katarina","date":"2018-07-03T11:04:48.072+0000","up_votes":1,"down_votes":3,"body":"appunto tutto sbagliato","replies":[{"poster":"Koria","date":"2018-07-03T13:06:01.878+0000","up_votes":1,"down_votes":0,"body":"è giusto invece, lol mica è solo ranked","replies":[{"poster":"Sensei Katarina","date":"2018-07-03T13:43:09.384+0000","up_votes":1,"down_votes":2,"body":"ma almeno abbiamo la decenza di valutare le situazioni apposto di far bannare cosi come se nnt fosse","replies":[]}]}]}]},{"poster":"Aurelion Shmoll","date":"2018-07-03T10:45:12.485+0000","up_votes":1,"down_votes":0,"body":"Se non condividi il regolamento, puoi anche non accettare le condizioni d'uso e non giocare.","replies":[]}]}]},{"poster":"Floppyz","date":"2018-07-03T13:44:52.428+0000","up_votes":2,"down_votes":0,"body":"Cerchiamo di mantenere dei toni civili, altrimenti oltre ai ban, chiudiamo il topic.","replies":[]},{"poster":"beppedessi","date":"2018-07-03T06:57:52.880+0000","up_votes":2,"down_votes":1,"body":"Senza offesa ma non si viene bannati per un unico episodio di int o di flame (a meno che quest'ultimo non sia molto pesante). Sei senza dubbio \"recidivo\". Ti consiglio di utilizzare questi 14 giorni per rilassarti e sbollire, perché il prossimo ban sarà permanente. In futuro ti sconsiglio di scrivere qualsiasi cosa che possa anche solo essere lontanamente considerata flame, compreso il famoso\" /all pls report tizio\" che è reportabile come flame.","replies":[{"poster":"Athìs","date":"2018-07-03T07:56:28.599+0000","up_votes":2,"down_votes":0,"body":"Invece no, puoi ricevere il ban di 2 settimane anche al primo caso di int.\nProvato sulla mia pelle.","replies":[]},{"poster":"Sensei Katarina","date":"2018-07-03T10:29:13.546+0000","up_votes":1,"down_votes":3,"body":"non ho avuto precedenti .","replies":[]}]},{"poster":"Feitan Portor","date":"2018-07-03T06:15:03.129+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Sensei Katarina","date":"2018-07-03T10:27:51.168+0000","up_votes":1,"down_votes":3,"body":"ma tumore ci sarai te lol neanche mi conosci e vai con gli insulti ero tiltato mi è successo una sola volta cioè ieri in una NORMAL inutile , non ho ma ifatto feeding int o flamato per fatti capire sono stato bannato con il mio account 3 volte con questa e ti dico le precedenti : la prima volta è stato all inizio perche non ne capivo nulla e quando mi stufava staccavo la partita appunto ban per afk la seconda volta mi hanno rubato l account e sto cretino tedesco si è fatto una ranked flamando a tutti ed ho preso un ban di un mese che non potevamno togliermi ma l account lo ripreso adesso tu dimmi chi sarebbe il tumore ?","replies":[{"poster":"Aurelion Shmoll","date":"2018-07-03T10:52:11.387+0000","up_votes":2,"down_votes":0,"body":"Io non sono convinto che tu dica il vero. Visto che in 5 parole sei riuscito a violare il regolamento 5.3 e 5.3 (iii).","replies":[{"poster":"Sensei Katarina","date":"2018-07-03T11:02:28.942+0000","up_votes":1,"down_votes":1,"body":"io non scrivo nei forum ma se quello mi chiama tumore senza che mi conosce mi sembra stupido  comunque il ban  l ho preso per feeding che quello che realmente fatto ma non ho mai avuto precedenti e mi sembra una reazione esagerata 15  giorni per una normal \ncon premade se proprio volevano darmi la sospensione che almeno usino un metro di misura razionale","replies":[{"poster":"Aurelion Shmoll","date":"2018-07-03T11:15:35.628+0000","up_votes":1,"down_votes":0,"body":"Avresti potuto leggere il regolamento che sei stato costretto ad accettare, in ordine di evitare questa sgradevole sorpresa.","replies":[{"poster":"Sensei Katarina","date":"2018-07-03T11:28:50.261+0000","up_votes":1,"down_votes":0,"body":"l ho capito l hai detto 3 volte  lo so che sono punibile mi lamento sul ban per me inutile potevano mettermi un altra punizione","replies":[]}]}]}]}]}]}]}