{"poster":"zarxus1234","date":"2018-01-31T04:02:49.203+0000","title":"kog maw nerf over bruiser what a joke of a balance team","subforum":"Gameplay","up_votes":2,"down_votes":6,"body":"never had a kog maw 1v2 at level 4. Never.  You are nerfing kog maw over bruisers. Its a joke. \r\n\r\nEvery fucking game is determined by top lane.  Top lane is dominating lcs play right now. I can show you the replays if you want riot. Because you seem top be pretty fucking oblivious to whats good and whats not.\r\n\r\nOut of the 14 games i&#039;ve played to far this season 13 out of the 14 games the better top laner has won.\r\n\r\nGet a clue before you make balance changes.  The fact you are nerfing kog maw shows how oblivious you are to what is actually going on in your game. And there are replays to prove it.","replies":[{"poster":"PulsarPollo","date":"2018-01-31T04:49:58.521+0000","up_votes":2,"down_votes":0,"body":"> Out of the 14 games i've played to far this season 13 out of the 14 games the better top laner has won.\n\nIsn't that expected?","replies":[{"poster":"zarxus1234","date":"2018-01-31T06:05:02.059+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=h0ne,realm=NA,application-id=3ErqAdtq,discussion-id=7nmuu1Zd,comment-id=0000,timestamp=2018-01-31T04:49:58.521+0000)\n>\n> Isn&#x27;t that expected?\n\nnow its 15 out of 16 games. Not at this rate. Other peoples performances should matter. There have been bot and mid lanes that won their lane but lost due to top lane. \n\nWhats the point in playing when only 1 lane matters. My performance doesnt mean anything. You switch the top laners last game. I lose that game. We had garen we won the game.  How is that remotely fair or fun for anyone.\n\n\nAnd the same thing happens in the lcs.","replies":[{"poster":"Kai Guy","date":"2018-01-31T06:18:38.701+0000","up_votes":1,"down_votes":0,"body":"You ever stop to think it might be your 1 tricking a jungler who will have almost 0 impact on top lane early game because that's where a majority of shacos counters lane?  \n\nWell keep asking for buffs to your 1 trick by requesting counters to be nerfed.","replies":[{"poster":"zarxus1234","date":"2018-01-31T06:49:02.253+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kai Guy,realm=NA,application-id=3ErqAdtq,discussion-id=7nmuu1Zd,comment-id=000000000000,timestamp=2018-01-31T06:18:38.701+0000)\n>\n> You ever stop to think it might be your 1 tricking a jungler who will have almost 0 impact on top lane early game because that&#x27;s where a majority of shacos counters lane?  \n> \n> Well keep asking for buffs to your 1 trick by requesting counters to be nerfed.\n\nme being shaco doesnt have anything to do with it. I've won 8 games so far. All 8 games my top lane won. The enemy didnt have a shaco jungle. You think there is some hidden agenda here but its not. \n\nIt goes both ways. My wins are predicated on my top lane and my losses are predicated on top lane.  If shaco jungle was the issue then all 8 of my wins wouldn't have the winning top lane on it.  \n\nLCS shows that top lane is dominating this game. But we can live in the pass and pretend that adc's are the issue right now.","replies":[{"poster":"Ceazaru","date":"2018-02-07T07:47:09.289+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=zarxus1234,realm=NA,application-id=3ErqAdtq,discussion-id=7nmuu1Zd,comment-id=0000000000000000,timestamp=2018-01-31T06:49:02.253+0000)\n>\n> me being shaco doesnt have anything to do with it. I&#x27;ve won 8 games so far. All 8 games my top lane won. The enemy didnt have a shaco jungle. You think there is some hidden agenda here but its not. \n> \n> It goes both ways. My wins are predicated on my top lane and my losses are predicated on top lane.  If shaco jungle was the issue then all 8 of my wins wouldn&#x27;t have the winning top lane on it.  \n> \n> LCS shows that top lane is dominating this game. But we can live in the pass and pretend that adc&#x27;s are the issue right now.\n\nI love how you bring up bruisers as if they’re in a good state in the current meta. They’re not the only bruisers who are relevant is Camille and GP because he has kleptomancy which got nerfed. The vast majority of bruisers just get outscaled by tanks when team fighting starts because it takes them a lot longer to build their items because they have one of the most expensive build paths in the game. The only top laners that are relevant right now are tanks and other picks like vlad, GP and Camille.","replies":[]}]}]}]}]},{"poster":"BeatzBoyFTW","date":"2018-01-31T06:19:27.767+0000","up_votes":1,"down_votes":0,"body":"> Every fucking game is determined by** top** lane.\n\nDo you need to see a doctor?","replies":[]}]}