{"poster":"Meowstic F","date":"2016-04-19T22:06:08.869+0000","title":"Zyra update is an immense nerf. Really disappointed.","subforum":"Gameplay","up_votes":4,"down_votes":2,"body":"Basically : damage nerf, Q extremly nerfed with this new shape... \r\n\r\nYou can&#039;t farm anymore. \r\n\r\nYour plants deal no damage while lasting for half the duration until you max your W. Your q spawn plant if your near a seed making it extremly clunky and incontrolable. \r\n\r\nI have no idea what their goal was except maybe make support Zyra a pushing machine and cs stealing machine. \r\n\r\nReally really disappointed.","replies":[{"poster":"Meowstic F","date":"2016-04-19T22:52:12.938+0000","up_votes":1,"down_votes":0,"body":"Guys keep in mind that the pbe people said \"skarner, garen and darius are really weak atm, they need to be buffed\" and we all know how that went.\n\nYes I have played her.\n\nBasically your passive spawn seed at random location.\n\nYour q base damage and scaling got nerfed hard. Whenever you use your Q near seeds, they will bloom and plant will spawn. => the Q shape makes it hard to hit the whole wave and to do it you basically have to go in a position that makes you an easy target to ganks. Plus the radius is so small, ennemis can walk out of it so easily it's not even funny... \n\nYour seeds don't give vision anymore.\n\nYour e is the same, dunno if they nerfed the damage or not. Ult too.\n\nYour plants last for half the duration, you don't gain passive cdr anymore.","replies":[]},{"poster":"I am Pacman","date":"2016-04-19T22:46:06.717+0000","up_votes":1,"down_votes":0,"body":"Really confused here.  So far from what I've heard from people on the PBE she is pretty good.  Have you played her yet?","replies":[]},{"poster":"Vekkna","date":"2016-04-19T22:23:13.156+0000","up_votes":1,"down_votes":0,"body":"On the bright side, we get 340 base MS. \n\nThe PBE feedback is positive so far, so I'm reserving judgment. From first look, it seems like she's more at the mercy of plant AI than ever. Frankly, that's a terrifying prospect, so it's hard to be optimistic.","replies":[]}]}