{"poster":"ElTotodile","date":"2018-05-12T01:39:47.665+0000","title":"Consejos de un jg noob, para los jgs nuevos mas noobs.","subforum":"Charlas Generales","up_votes":6,"down_votes":4,"body":"En jg:\r\n\r\nEs ley, cada vez que vez al jg en algun lado, le vas a robar la parte contraria de la jg, esto lo deja literalmente en la mierda, mas si ya farmeaste tu jg tambien, porque el va a farmear la suya, no encuentra nada, perdio tiempo en el recorrido, entonces va a tu jg, y tampoco encuentra nada, perdio el tiempo x2.\r\n\r\nPor favor, si no tiene flash el enemigo, es ley tambien, MINIMO, 2 ganks le tenes que meter.\r\nNo se puede desaprovechar terrible ventaja.\r\n\r\nVeo muchos jgs, que queman el flash en una linea no se, al min 5, y aparecen recien en el min 15 gankeando, cuando ya tienen 20 flashes mas.\r\n\r\nTe van a joder al 100% con las se&ntilde;as, es asi, cada vez que alguien muera, va a ser tu culpa, dalo por hecho, nadie, pero NADIE, muere por su propia cuenta, aunque estes en otra punta del mapa, la culpa de que ellos murieron fue tuya.\r\n\r\nLiteralmente, esta foto la guarde porque fue epica, min 2:06, recien empezaba el segundo campamento y un yasuo ya me estaba pidiendo ayuda en top\r\n\r\nhttps://imgur.com/a/PC0q695\r\n\r\nLos drakes son importantes, pero tampoco hay que desvivirse, gane partidas con 0 drakes, y no porque no los haya querido hacer, sino porque el team de ellos iba de a 3, o 4 a hacerlos y tu team cuando le pedis ayuda te ignora al 100%.\r\n\r\nEso si, aunque le pidas ayuda en los drakes y no te hayan ayudado en ni uno, despues te van a decir: &quot;0 drakes&quot;, &quot;y los drakes? best jg&quot;.\r\n\r\nTrata de ver a tu team tambien como el team enemigo, si ves que tenes al tipico desesperado por la kill, que esta pusheando a 50 de vida, porque el enemigo esta a 50 de vida tambien, es obvio que va a parar ahi el jg de cabeza, trata de anticipar y hacer counter gank.\r\n\r\nCosas que se puede sacar provecho siendo jg:\r\n\r\n- Tilteo del enemigo al campear\r\n- Que se peleen entre ellos mismos cuando sale mal un gank y mueren los 2 por tu counter gank\r\n- Abusar de la linea mas debil, o snowballear la linea que pienses que mejor juega (esto te da bastante control de partida, porque decidis en quien centrar tu ayuda)\r\n\r\n\r\nNo dudes en llevarte kills, si te lo llevas, te van a putear, sino te los llevas y los dejas, tambien te van a putear porque se les escapan.\r\nMe ha pasado cientos de veces, de correrme a un costado, dejar el kill y ver que mi team se da vuelta y lo deja pensando que yo lo mataba, por eso, da igual, si te tenes que llevar 3 kills hacelo.\r\n\r\nLlevate un pink a todos lados, siempre que backees, backea restando el oro de 1 pink, eso te ayuda mucho en cada gank, por mas que esten wardeados, al no ver que desaparece lentamente el ward porque le estas pegando, se olvidan hace cuanto tiempo lo pusieron y piensan que desaparecio solo, lo que te habilita un gank.\r\n\r\nSi ves que el jg enemigo esta por detras, que no representa ni un peligro, o que directamente no es de invadir, trata de en cada gank, dejar tambien un ward, yo siempre que gankeo, cuando me voy yendo les wardeo la linea, o a veces mismo, aunque no vaya a gankear si se que va a pasar el jg enemigo por ahi, les dejo un ward.\r\n\r\nNunca falta, el que te pide y spamea como loco la se&ntilde;a de ayuda, cuando el enemigo esta clavado en torre y pusheado, a ese, muted en las se&ntilde;as y listo, no se porque cuando estan full push y metidos dentro de su torre, tienen la mania de pedir ayuda a lo loco.\r\n\r\nSobre todo, si vas a empezar en la jg, lo mas importante, es paciencia, porque te vas a encontrar muchisimos subnormales, muchisimos, ni te imaginas de que tipo, ayer un ejemplo, me cruce a un kennen top, que murio con un darius 4 segundos antes de que llegue yo aproximadamente, murio el kennen, yo mate a darius y me dijo: &quot;GG JG DE MIERDA LLEGA PAL KS NO DEJA NI UNA KILL&quot;, estaba muerto el kennen, o sea, no habia forma de dejarle el kill, eso que la primera sangre la habia hecho en top y se la habia dejado la kill.\r\n\r\nTienen que aprender a mutear a full, hacen se&ntilde;as? muted a las se&ntilde;as, flamean? muted al chat y ignorar a todos y centrarte en quienes pienses que pueden jugar bien :D\r\n\r\nYo no soy experto, pero le transmito mis conocimientos a los nuevos jgs que espero que les sirva de algo :d","replies":[{"poster":"Juice Wrld","date":"2018-05-12T01:46:51.002+0000","up_votes":1,"down_votes":1,"body":"Estaba de acuerdo con tu post hasta que vi que te subiste la E de ZAC a lvl 2","replies":[{"poster":"ElTotodile","date":"2018-05-12T03:05:02.599+0000","up_votes":1,"down_votes":0,"body":"Te explico, los que no saben nada de jg, hablan generalmente.\n\nPero en la jg, se usa mucho las estadisticas, los miserables puntos que hay de diferencia entre la Q y la E, equivale a la distancia recorrida con el salto de un buff al otro ahorrandote 5 segundos mas de tiempo y lo haces mas rapido que aumentandote la Q de segundas.\n\nPero estoy seguro que ya lo sabias o no?, porque venis muy seguro a decirlo :)","replies":[{"poster":"Juice Wrld","date":"2018-05-12T21:31:07.811+0000","up_votes":1,"down_votes":1,"body":"Acabo de tomarme la molestia de ver tu perfil, perdón pero no puedo tomarte en serio XD\nEsa arrogancia es innecesaria, pero bueno ya que sos arrogante puedo ser el doble nwn\n\nTengo maestria 7 a ZAC 153k puntos, un wr no tan bueno pero decente (56%) y soy el ZAC 3440 de LAS, no es mucho pero es mas de lo que tenes :P además lo juego desde antes del rework. \nBásicamente quiero decir que tengo mas experiencia con el campeón y voy a borrar mi otro comentario para adjuntar lo dicho a este.\nLa Q tiene mucho menos CD que la E, además te da chance a generar 2 trozos de si mismo, tener la W 2 segundos antes. \nTenes más sustain y limpias mas rápido, por lo de la W... \nY respecto a lo de los 5 segundos UFFF flor de bolazo, te explico:\n\nLa E tiene mucho CD que la Q, vas a demorar una vida y media, ademas con un Slow es mas fácil kitear la jg.\nSupongo que cargas la E para que levante mas (Por si no sabias mientras mas la cargas mas dura el cc) son 2 segundos minimo.\nY por último pero no menos imortante... estan las piñas explosivas amigo, no se de que 5 segundos hablas.\n\nAdemás una ruta estándar de ZAC deja el segundo buff para lo ultimo o penúltimo, ejemplo:\nDigamos que empezas arriba, haces Red, picuchillos, lobos, blue y para sacar 4 podes robar picuchillos enemigos o hacer el escurridizo para estar full vida ahi hacer tu primer gank en mid o bot. \nA que voy? Con los lobos vas a tener el lvl 3 para saltar al blue :P","replies":[{"poster":"ElTotodile","date":"2018-05-13T00:07:34.400+0000","up_votes":2,"down_votes":0,"body":"Ni te lei, dijiste \"TENGO M7 Y 153K\" y deje de leer automaticamente.\n\nTipico que piensa que la maestria te hace jugar mejor o da manos jaja como los que dicen: \"Soy main Yasuo 1000000000 de k de maestria y m7\". \n\nLa maestria la juntas saliendo 0/40 todas las partidas, se acumulan usando el campeon, no jugando bien, saludos fan!","replies":[{"poster":"Gonk","date":"2018-05-13T04:58:00.955+0000","up_votes":1,"down_votes":0,"body":"> Tipico que piensa que la maestria te hace jugar mejor o da manos jaja como los que dicen: \"Soy main Yasuo 1000000000 de k de maestria y m7\".\n\nSi hubieras leido un poco mas te darias cuenta del por que lo dice.\n Si no hubiera puesto eso le dirias, vos que sabes de eso? ñiñiñi etc","replies":[]},{"poster":"Juice Wrld","date":"2018-05-13T01:14:30.202+0000","up_votes":1,"down_votes":0,"body":"Bueno, como digas :P","replies":[]}]}]}]},{"poster":"Yo sin Ella","date":"2018-05-12T02:41:02.252+0000","up_votes":1,"down_votes":0,"body":"Si ves que tienes justo un chance para gankear,¿por qué no?","replies":[{"poster":"Juice Wrld","date":"2018-05-12T20:43:17.544+0000","up_votes":1,"down_votes":0,"body":"Tiene muy poco rango la E a lvl 1 es muy raro un Gank de ZAC a lvl 2, pero si se da tampoco es mala opción \nSolo si se da...","replies":[]}]}]},{"poster":"Zoliza","date":"2018-05-13T07:24:57.569+0000","up_votes":1,"down_votes":0,"body":"El post no está tan mal pero algo debes hacer muy mal para seguir en silver.\n\nPd:  por el amor de Jesús no buildees tan mal a Evelynn xd","replies":[{"poster":"ElTotodile","date":"2018-05-13T11:25:04.245+0000","up_votes":1,"down_votes":0,"body":"Tengo 25 champs nomas esta cuenta, y empece a usarla hace 2 dias nomas, estaba en plata 5 y hoy ya en plata 1 :)","replies":[{"poster":"Zoliza","date":"2018-05-13T18:13:32.941+0000","up_votes":1,"down_votes":0,"body":"Y porque no haces el post desde tu main (?","replies":[]}]}]},{"poster":"LightrayAvatar","date":"2018-05-13T13:25:02.375+0000","up_votes":1,"down_votes":0,"body":"Que feo cuando sos Main supp yendo jg y tenés que dejar que muera el que va mal y ayudar al que va bien. Yo quiero ayudarlos a todos.","replies":[]},{"poster":"LightrayAvatar","date":"2018-05-13T13:24:48.769+0000","up_votes":1,"down_votes":0,"body":"Que feo cuando sos Main supp yendo jg y tenés que dejar que muera el que va mal y ayudar al que va bien. Yo quiero ayudarlos a todos.","replies":[]},{"poster":"DIOS TUTI","date":"2018-05-12T20:45:26.224+0000","up_votes":1,"down_votes":0,"body":"no esta mal, es muy basico pero que le sirve a alguien que va a entrar a la jungla teniendo 0 idea.","replies":[]},{"poster":"SmokeyShauna","date":"2018-05-12T01:56:37.915+0000","up_votes":1,"down_votes":1,"body":"util, +1","replies":[]}]}