{"poster":"TKBazinga26","date":"2018-07-19T19:49:51.871+0000","title":"Proposta Cambiamento puntatore di Spostamento Temporale ( R - Zilean)","subforum":"Campioni e gameplay","up_votes":1,"down_votes":2,"body":"Salve, \nsono un main support nonch&egrave; un amante di Zilean {{champion:26}} . \nNell&#039;ultimo periodo, causa raggiungimento non ancora compiuto della tanta agognata maestria 7 (Un miraggio lontano visto il sistema di valutazione dei support molto discutibile secondo il mio parere {{summoner:14}} ), ho giocato esclusivamente Zilean support (circa 60 game di fila). \nCome tutti sappiamo, il punto di forza di Zilean &egrave; la sua ulti, che usata nel momento giusto pu&ograve; ribaltare le sorti di un teamfight. \nUn main Zilean deve essere una persona dal sangue freddo, molto attento (ping permettendo), che deve ricorrere alla ulti solo quando strettamente necessario e, se vogliamo, solo appena prima che il campione alleato stia per morire (cos&igrave; da non sprecare la sua ulti o, peggio ancora, da trasformarla in un &quot;bait&quot; per l&#039;alleato stesso, costringendolo al suicidio e, spesso e volentieri, vedendolo morire allo scadere della ulti [[CON RELATIVO FLAME ACCANITO]] {{summoner:3}} ). \nIl problema sta nel fatto che, con tutti gli assassin che girano sulla landa oggigiorno, l&#039;amatissimo adc (o chi fa le sue veci in questo strano meta) &egrave; spesso shottato istantaneamente 100-0 senza possibili reazioni.\n\n\nLe mie reaction time sono migliorate nel tempo, gioco pur sempre a 80 ping, ma ritengo che il puntatore della ulti di Zilean sia, al momento, MOLTO POCO benevolo. Bisogna cliccare esattamente sul champion designato, rendendo il tutto parecchio difficile da castare in un lasso di tempo piccolo. [[CON RELATIVO E ULTERIORE FLAME ACCANITO DI TUTTI QUELLI CHE NON CONOSCONO COME FUNZIONI ZILEAN, APPUNTO {{summoner:3}} ]]. \nCredo che la mia &quot;fedina penale dell&#039;evocatore&quot; sia piena zeppa di report di gente tiltata con la scritta &quot;Zilean non mi ha ultato al minuto X&quot;.\n\nProprio per questo volevo proporre agli sviluppatori ( e anche ai miei colleghi main support e non) di rendere il puntatore della Ulti di Zilean con le stesse modalit&agrave; di quello di &quot;Crescita Selvaggio&quot; (R - Lulu). Quel puntatore &egrave; davvero molto comodo e soprattutto molto clemente. Circonda il champion che vuoi ultare con un cerchio e rende molto pi&ugrave; veloce un cast quasi istantaneo sulla persona che sta per essere assassinata. Questo puntatore, a mio avviso, &egrave; molto pi&ugrave; parsimonioso e, proprio per questo, veloce da castare e adatto a salvare la vita di un povero adc in una situazione di danno burst (evitando, tra l&#039;altro parecchio flame {{summoner:13}} ).\nCredo sia una miglioria da tenere in considerazione, sperando che ci sia qualche altro Zilean player che mi appooggi in tale appello.\n\nTL DR; Cambiamo il puntatore della R di Zilean con il puntatore della R di Lulu per renderne pi&ugrave; facile il cast.\n\nGrazie per l&#039;attenzione {{sticker:vlad-salute}}\n\nhttps://www.youtube.com/watch?v=Xpe-JoGyPsY     (Questa è solo per i VERI main)","replies":[]}