{"poster":"AlexanderSager","date":"2015-09-02T11:40:21.032+0000","title":"Wo sind meine Skins/Champions","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo liebe Community und hoffentlich auch liebe Riot Mitarbeiter oder so etwas...,\r\nich habe mir vor einiger Zeit Skins und Champions im Wert von damals 50&euro; gekauft, nach dem ich das spiel jetzt seit ca einem Jahr nicht mehr gespielt habe und ich es heute wieder neu Installiert habe sind sie weg.... Ich bin schon so auf dieses Spiel eigentlich nicht gut zu sprechen und jetzt kommt auch noch so etwas, ich habe kein hohes Einkommen das ich die mir einfach Neu kaufen k&ouml;nnte oder so etwas(bin halt erst 17). Da ich mir dieses Spiel nur runtergeladen habe um noch ein mal den Spiel eine Chance zu geben, wende ich mich nun direkt an die Entwickler und sage: Mit anderen k&ouml;nnt ihr so was vlt. machen, aber nicht mit mir! Sollte ich nicht meine Skins sowie meine Champions wieder erhalten werde ich sehr Sauer und werde andere Ma&szlig;nahmen einleiten m&uuml;ssen und die werden nicht nur das deinstallieren des Spieles beinhalten. (Meine Laune ist gerade am Boden -.-&quot;)","replies":[{"poster":"3ffect23","date":"2015-09-03T10:34:15.691+0000","up_votes":2,"down_votes":0,"body":"Drohen würde ich jetzt wegen 50€ nicht.\nIn meinem Account stecken auch über 500€ und wer glaubts bin auch erst 17 :P\nNein, nichts von den Eltern bekommen.","replies":[]},{"poster":"Alustus","date":"2015-09-02T13:00:41.883+0000","up_votes":1,"down_votes":0,"body":"Wurde schon alles von Legofreak gesagt.\n\nTrotzdem fand ich diesen Teil sehr amüsant:\n\n> (bin halt erst 17). Da ich mir dieses Spiel nur runtergeladen habe um noch ein mal den Spiel eine Chance zu geben, wende ich mich nun direkt an die Entwickler und sage: Mit anderen könnt ihr so was vlt. machen, aber nicht mit mir! Sollte ich nicht meine Skins sowie meine Champions wieder erhalten werde ich sehr Sauer und werde andere Maßnahmen einleiten müssen und die werden nicht nur das deinstallieren des Spieles beinhalten.\n\n\nSolltest du bei deiner Supportanfrage dann lieber weglassen, den ein schlecht gelaunter Support mitarbeiter wird dir wahrscheinlich nicht gut helfen wie ein gut gelaunter.","replies":[]},{"poster":"legofreak1","date":"2015-09-02T12:08:41.950+0000","up_votes":1,"down_votes":0,"body":"Sicher, dass dies der richtige Account ist? Hast du vielleicht noch einen anderen Account oder hast du den Account vielleicht auf einem anderen Server erstellt?\nAnsonsten musst du dich bei Problemen mit deinem Account an den [Support](http://support.leagueoflegends.com) wenden, wir im Forum können dir da nicht helfen.","replies":[]}]}