{"poster":"Letioscar","date":"2016-04-28T17:41:01.045+0000","title":"Insulti gravi","subforum":"Aiuto e supporto","up_votes":2,"down_votes":2,"body":"Salve, sono un giocatore di League of Legends da anni ormai.. Durante questo tempo ho incontrato svariate tipologie di giocati, da quelli molto corretti e amichevoli a quelli che ci danno davvero  pesante con le parole. Vorrei segnalare la presenza di un giocatore che oggi ha dato il peggio di se e gradirei che fossero presi provvedimenti verso lui e chi ha certi atteggiamenti. Solitamente non mi sconvolgo così tanto, ma questo ha esagerato minacciandomi addirittura di morte. E' stato praticamente tutta la partita ad insutare me ed i suoi compagni. Io gli ho dato corda dicendogli il classico noob per vedere fin dove si sarebbe spinto e ha fatto davvero schifo. Ho svariati screen di ciò che ha scritto e se la Riot volesse indagare, sarei lieto di collaborare. Grazie\n\n\n_Edit by mod: c'è la regola del no name&shame_","replies":[{"poster":"Letioscar","date":"2016-04-29T06:39:19.693+0000","up_votes":3,"down_votes":0,"body":"Grazie per i condigli e il supporto raga. Ho tolto i nomi e spero di non incontrare più gente così(non mi sono fatto influenzare e abbiamo pure vinto). Spero di incontrarvi in qualche game. Un abbraccio ROCCIOSO {{champion:54}}","replies":[{"poster":"Giovarco","date":"2016-04-29T23:01:36.809+0000","up_votes":1,"down_votes":1,"body":"> Un abbraccio ROCCIOSO {{champion:54}}\n\nPlease non ci stritolare! *RIP*","replies":[]},{"poster":"Sexy Win","date":"2016-04-29T22:06:16.179+0000","up_votes":1,"down_votes":1,"body":"Ehi vacci piano , non copiare me che copio i bot del supporto ahahahha xD\n\n\nFIDDLESTICK è Totipoteeenteeee  {{champion:9}} ","replies":[]}]},{"poster":"Frattaglia","date":"2016-04-28T18:26:31.113+0000","up_votes":2,"down_votes":0,"body":"Ciao, mi dispiace per quello che ti è successo, ma sul forum ufficiale c'è la regola del no name & shame, cioè non si fanno nomi per accusare/denigrare/raccontare fatti negativi. Insomma, magari hai anche ragione, ma siamo contro le crocifissioni in sala mensa :)\n\nPer situazioni del genere è sufficiente il report a fine partita. Sappi che se una persona si comporta in modo MOLTO tossico (come dovrebbe essere la situazione che hai raccontato), il sistema se ne accorge prima e scattano da subito punizioni pesanti. Non lo dico tanto per dire ma è successo a gente che conosco (le punizioni molto pesanti dopo aver avuto un comportamento molto tossico).\n\nSe qualcuno ti molesta in partita il consiglio migliore che ti faccio è quello di mutarlo, premendo TAB e successivamente il pulsante dell'altoparlante a fianco al suo nome. Aiuta a ignorare il ~~cretino~~ molesto e ti permette di concentrarti sul gioco. :)","replies":[{"poster":"RAT TO RANK 2","date":"2016-04-28T19:23:17.052+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=98NGV4Al,discussion-id=J9RMdMnB,comment-id=0005,timestamp=2016-04-28T18:26:31.113+0000)\n>\n> Ciao, mi dispiace per quello che ti è successo, ma sul forum ufficiale c&#x27;è la regola del no name &amp; shame, cioè non si fanno nomi per accusare/denigrare/raccontare fatti negativi. Insomma, magari hai anche ragione, ma siamo contro le crocifissioni in sala mensa :)\n> \n> Per situazioni del genere è sufficiente il report a fine partita. Sappi che se una persona si comporta in modo MOLTO tossico (come dovrebbe essere la situazione che hai raccontato), il sistema se ne accorge prima e scattano da subito punizioni pesanti. Non lo dico tanto per dire ma è successo a gente che conosco (le punizioni molto pesanti dopo aver avuto un comportamento molto tossico).\n> \n> Se qualcuno ti molesta in partita il consiglio migliore che ti faccio è quello di mutarlo, premendo TAB e successivamente il pulsante dell&#x27;altoparlante a fianco al suo nome. Aiuta a ignorare il ~~cretino~~ molesto e ti permette di concentrarti sul gioco. :)\n\nio trovo il report a fine partita troppo inutile ci sono di quei tossici che ti viene voglia di disinstallare lol  e te pur reportandoli mandando screen degli insulti copia incolla, seconso me non verranno  mai bannati, non mi è mai arrivato un avviso di un giocatore che è stato bannato grazie al mio aiuto quindi... e anche i posto su facebook fanno vedere che è rarissimo che succedi quello","replies":[{"poster":"Frattaglia","date":"2016-04-28T19:34:16.313+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YoloMeoloY,realm=EUW,application-id=98NGV4Al,discussion-id=J9RMdMnB,comment-id=00050000,timestamp=2016-04-28T19:23:17.052+0000)\n>\n> io trovo il report a fine partita troppo inutile ci sono di quei tossici che ti viene voglia di disinstallare lol  e te pur reportandoli mandando screen degli insulti copia incolla, seconso me non verranno  mai bannati, non mi è mai arrivato un avviso di un giocatore che è stato bannato grazie al mio aiuto quindi... e anche i posto su facebook fanno vedere che è rarissimo che succedi quello\n\nQuel messaggio ti arriva solo se sei stato l'ultimo a reportare un tizio che è stato bannato. Comunque solo nell'ultima settimana ricordo almeno 3-4 topic di gente permabannata, l'esperienza personale è abbastanza relativa.\n\nComunque è ovvio che se non usi il report a fine partita o lo usi male (anche quando non è necessario) fai perdere valore allo strumento.","replies":[]}]}]},{"poster":"Sexy Win","date":"2016-04-28T17:49:06.073+0000","up_votes":2,"down_votes":0,"body":"il Name&Shame è vietato sul forum . Ti consiglio di sostituire il suo nome con EvocatorePaxxerello o con qualunque nick fittizio ritieni appropriato affinchè il post non venga eliminato . Si capisce la frustrazione ma non si tollera il Name&Shame, rivolgersi al supporto per segnalare il comportamento del suddetto giocatore.\nCordiali saluti \nFIDDLESTICK è Totipoteeenteeee {{champion:9}}","replies":[]},{"poster":"Menfrix","date":"2016-04-28T17:48:11.359+0000","up_votes":2,"down_votes":0,"body":"Il report a fine partita è sufficiente, credo sia addirittura indispensabile per poter risalire al match in questione...","replies":[]},{"poster":"Liebestraume","date":"2016-04-28T17:44:04.467+0000","up_votes":2,"down_votes":1,"body":"Scrivendo un ticket direttamente al supporto puoi segnalarlo e anche allegare gli screenshot\n\nCome se effettivamente succedesse qualcosa","replies":[]},{"poster":"Mikan Yuuki","date":"2016-04-28T18:31:11.106+0000","up_votes":1,"down_votes":0,"body":"Non serve a niente, mi è capitata la stessa identica cosa, reportato a fine game con spiegazione facoltativa annessa.\nLo trovo ancora a giocare senza problemi, bel sistema quello della Riot, davvero. L'importante è guadagnare dopotutto.","replies":[]},{"poster":"LightIsMyPath","date":"2016-04-28T18:05:11.453+0000","up_votes":1,"down_votes":0,"body":"Ciao, ti consiglio di togliere il nome o verrai ripreso ( e comunque verra' editato). Tanto nessuno qui ci puo' fare nulla, lo screen mandalo al supporto con una descrizione di cio' che e' successo, a me han risposto facendo cosi'.","replies":[]},{"poster":"kharonte90","date":"2016-04-28T18:01:01.147+0000","up_votes":1,"down_votes":0,"body":"io le volte che ho reportato i flame pesanti, dopo nemmeno 20 secondi mi è arrivato il messaggio di ringraziamento per mantenere pulita la community e blablabla.\npurtroppo non accettano report per screen, altrimenti verrebbero inondati di casi e a giocare rimarrebbero veramente in pochi x)\nl'unica cosa da fare è reportare a fine game.","replies":[]},{"poster":"Laiho88","date":"2016-04-28T18:39:53.898+0000","up_votes":1,"down_votes":1,"body":"il name&shame purtroppo è vietato, io proporrei di sostituire i nomi con il termine\"coglione\" :D:D:D","replies":[]}]}