{"poster":"silverknigth cl","date":"2019-04-29T06:08:24.957+0000","title":"Baneenme porfavor ya no aguanto mi elo.","subforum":"Comportamiento del jugador","up_votes":0,"down_votes":9,"body":"llevo jugando desde el 2013 y siempre he sido casual pero como me estaba llendo bien en las normales el año pasado un mes antes del fin de temporada me puse a rankear llegue oro sin problema y este año no me tomo nada de tiempo recuperar ese rango aparte de que también comencé a hacer flex\r\n\r\nluego de llegar a las promos a platino y perder un par, cosa que creo normal, todo se fue al carajo. las ultimas semanas han estado imposibles. y no es lo comun, de ganar y perder equitativa mente, llevo ya casi 20 derrotas seguidas distribuidas entre solo/duo y flex y en el las ultimas 2 semanas todo en general empeoro, de encontrarme un troll entre 5 partidas a encontrarlos en cada una. \r\n\r\n.- de lo mas recalcable que me e topado recuerdo:\r\n.- suports ap carrys dedicados a robar kills y minioms principal mente {{champion:79}} {{champion:45}} {{champion:161}} \r\n.- unrankeds sin experiencia con picks \"exoticos\"\r\n.- una {{champion:21}}  suport que practicamente me queria obligar a ir {{champion:22}} \r\n.- y sobretodo jugadores \"hypercarrys\" flamers que critican tu forma de jugar. los pick, buildeo o runas pero al final en 30 minutos de juego no llevan ni 5k de daño (parece exagerado pero van varias veces)\r\n\r\nlo que me parece incoercible es que los encuentre camino a platino contra oponentes con un mínimo de experiencia y nociones de juego y aun asi al hacer calls marcar el mapa o señalar una ventaja numerica no reaccionan, no responden y no ayudan. \r\nme faltan los dedos para contar cuantas veces un JG fedeo  una linea y al momento de tener una clara oportunidad de recuperar el oro de la recompensa 500/600 o mas prefieren irse a farmear el grompo o los pajaros, o de lleno dedicarse a robar farm mientras el JG enemigo gankea todo y luego se va a la jungla aliada y farmea tranquilo. son un monton de cosas que te hace pensar lo facil que seria ganar si pudieras ser tu en todas las posiciones al mismo tiempo. \r\n\r\notro problema es el desvanece y la snowball de algunos campeones que los hace imposibles de matar para cualquiera solo independiente de los errores que cometan. ase un tiempo cuando los tankes eran utiles un {{champion:59}} {{champion:120}}  no podia hacer jugadas  con diveo antes de lvl 6 ahora si estan fedeadisimos con dos o 3 kills antes de lvl 5 te matan de un combo aun teniendo 1k de vida \r\nprincipal mente por que pueden denegar al jungla enemigo muy facil mente y asegurar una agresividad incomparable teniendo algun carry ayudandolo \r\n\r\n\r\nen fin creo que dejare de jugar ya me esta enfermando esto y no se si se deba a un crecimiento de los jugadores y por consecuencia un montón de novatos que no saben jugar pero quieren carrear y se dedican a sacar hypercarrys y cuidar su KDA para despues decir que son OTP como esta de moda. pero realmente me da pena por que el juego comenzaba a volver a ser divertido con la escena competitiva balanceada ahora solo es un pozo de frustración y toxicidad","replies":[{"poster":"Maito Gui","date":"2019-04-29T06:59:54.323+0000","up_votes":4,"down_votes":1,"body":"no son tus compas , sos vos que no podes marcar la diferencia cruk{{sticker:slayer-jinx-wink}}","replies":[{"poster":"DNZ PROSTAGMA","date":"2019-04-29T10:11:36.244+0000","up_votes":1,"down_votes":0,"body":"Nunca escuche algo tan crudo, pobrecito","replies":[]}]},{"poster":"amantedeljuani","date":"2019-04-29T06:30:54.343+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"Mascheranox","date":"2019-04-29T10:36:50.672+0000","up_votes":1,"down_votes":2,"body":"El juego esta bueno,los de riot lo estan haciendo mierda","replies":[]}]},{"poster":"Zelos From Jonia","date":"2019-04-29T10:27:19.483+0000","up_votes":1,"down_votes":0,"body":"> lo que me parece incoercible es que los encuentre camino a platino contra oponentes con un mínimo de experiencia y nociones de juego y aun asi al hacer calls marcar el mapa o señalar una ventaja numerica no reaccionan, no responden y no ayudan.\n\n>  por consecuencia un montón de novatos que no saben jugar \n\n- Dos cosas que dicen todos los que llegan a Bronce en varias temporadas y aun no pisaron plata.\n- Dos cosas que dicen todos los que llegan a Plata en varias temporadas y aun no pisaron Oro.\n- Dos cosas que dicen todos los que llegan a Oro en varias temporadas y aun no pisaron platino.\n- Dos cosas que dicen todos los que llegan a Platino en varias temporadas y aun no pisaron Diamante.\n\nSi hay gente que se estanca en cada liga quizás el problema no es la gente de la liga, quizás el problema es el que se estanca.\n\nQuizas estas haciendo calls y tratando de que  el equipo actue de una forma cuando el que ves la jugada sos vos. Si vos mereces platino y vos estas capacitado, ¿por que esperas que reaccionen los demas cuando deberias reaccionar vos?\n\nMe pasa seguido hacer duo y esperar coordinacion por estar hablando por disc, ¿pero sabes que pasa? el duo pasa por todos lados menos por mi linea \"porque yo la gano la linea\" no es su culpa, es mia por asumir que el tipo entiende que la ventaja esta en estar comunicados no en el juego.\n\nLo mismo vos, no asumas que porque vos ya ves el problema los demas deben entenderlo, para la pelota y mira que es lo que VOS tenes para contrarrestar esas situaciones. Asi se sube entre ligas. No es el campeon, el gran dominio del micro(que tambien es importante) ni ningun secreto oculto, es solo aprender a reaccionar a ciertas situaciones y a no hacer nada en otras. Pero la key de todo esto es que sos VOS el que lo hace porque sos VOS el que merece la liga.\n\nHoy por hoy, reconoces los factores, pero seguis jugando como ORO ese es el problema.","replies":[{"poster":"silverknigth cl","date":"2019-05-09T21:20:32.601+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zelos From Jonia,realm=LAS,application-id=PJAKt7ph,discussion-id=qTZYqVVF,comment-id=0004,timestamp=2019-04-29T10:27:19.483+0000)\n>\n> - Dos cosas que dicen todos los que llegan a Bronce en varias temporadas y aun no pisaron plata.\n> - Dos cosas que dicen todos los que llegan a Plata en varias temporadas y aun no pisaron Oro.\n> - Dos cosas que dicen todos los que llegan a Oro en varias temporadas y aun no pisaron platino.\n> - Dos cosas que dicen todos los que llegan a Platino en varias temporadas y aun no pisaron Diamante.\n> \n> Si hay gente que se estanca en cada liga quizás el problema no es la gente de la liga, quizás el problema es el que se estanca.\n> \n> Quizas estas haciendo calls y tratando de que  el equipo actue de una forma cuando el que ves la jugada sos vos. Si vos mereces platino y vos estas capacitado, ¿por que esperas que reaccionen los demas cuando deberias reaccionar vos?\n> \n> Me pasa seguido hacer duo y esperar coordinacion por estar hablando por disc, ¿pero sabes que pasa? el duo pasa por todos lados menos por mi linea \"porque yo la gano la linea\" no es su culpa, es mia por asumir que el tipo entiende que la ventaja esta en estar comunicados no en el juego.\n\nsi juegas duo pero dices que el problema no es la liga te contradices solo, por que el problema que señalo no es que alguien trolle y yo no pueda carrearlo, es que el nivel completo del team decae principal mente entre oro 2  y 1 .\nsi algo se nota en esa temporada es que no puedes carrear solo y jugar con alguien mas al que conoces o sabes como juega te asegura por lo menos un \"soporte\" para tu forma de jugar. o sino no lo agregarías a tu lista de amigos si la partida donde lo conociste fedeo toda las lineas y flameo a todo los compañeros.\n\nahora ase 2 partida volvi a oro II y el primer soporte que me toco fue un {{champion:412}}  que se metio al blue con todo el equipo enemigo invadiendo el bush y eso que lo deje wardeado (simplemente no vio el mapa y partio afk) luego se puso a flamear y termino regalandose un par de veces. \nmientras tando el resto de mi team discutia y se echaban la culpa perdieron el ritmo y todos terminaron dando 2 o 3 kills antes de que perdiéramos en 15 minutos. \n\nlo RARO es que bajo oro II o cuando encuentro a los que van a entrar a oro, ves peleas donde si pasa algo asi puedes reponerte mas del 50% de las veces. un invade y una FB no significan nada para esa sona competitiva. \n\nahora si juegas en premade para elo de oro II te vas a encontrar puros teams como el que mencione recien encontra tuyo, pero con una linea armada con tu duo o con un tu amigo en otra linea haciendo jugadas decentes y esperando el late. puedes ganar facil 90% de las veces mientras que solo pierdes el 90% solo por tu team. o por que eres el unico que trata de recobrar la ventaja en el juego. \n\naparte que el tema del autofill siempre termina cabreando a la mayoria y tratar de carrear con un ADC sin un sup en tu linea y contra un duo bot es aun mas imposible","replies":[{"poster":"silverknigth cl","date":"2019-05-09T21:49:26.440+0000","up_votes":1,"down_votes":0,"body":"Niqoh se unió a la sala\nsilverknigth cl se unió a la sala\ncachito1233 se unió a la sala\nANeroWolfs se unió a la sala\nFiSuRa se unió a la sala\ncachito1233\nHDX2\n:  otra vez el teemo xd\nNiqoh\nNYG\n:  :)\ncachito1233\nHDX2\n:  no tengo nada contra vos igual xd\nANeroWolfs\nBuRR4\n:  porfavor no vallas temo\nANeroWolfs\nBuRR4\n:  en late nos violan\ncachito1233\nHDX2\n:  dejalo\nNiqoh\nNYG\n:  flaco, no me rompas los huevos\ncachito1233\nHDX2\n:  no hiso nada mal\ncachito1233\nHDX2\n:  a bue\nNiqoh\nNYG\n:  bueno, que paja tener que trollear\ncachito1233\nHDX2\n:  no trolies la ***\nANeroWolfs\nBuRR4\n:  tu pick ya era troll\nNiqoh\nNYG\n:  y bueno\nANeroWolfs\nBuRR4\n:  asi que es lo mismo\nNiqoh\nNYG\n:  gente idiota hay en todos lados\nNiqoh\nNYG\n:  tipicos oritos\nNiqoh\nNYG\n:  mancos de re ******\ncachito1233\nHDX2\n:  la **** que los pario estoy a 1 de promo\ncachito1233\nHDX2\n:  no troleen\nANeroWolfs\nBuRR4\n:  tienes un win rate de teemo del 40%\nANeroWolfs\nBuRR4\n:  con teemo\nNiqoh\nNYG\n:  del 55%\nNiqoh\nNYG\n:  pedazo de tarado\nNiqoh\nNYG\n:  actualiza el op.gg\n\ntercera partida de oro II y en los picks se ponen a flamear por un temo. ","replies":[]}]}]},{"poster":"Tsukuyomi100","date":"2019-04-29T17:37:56.651+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-brand-facepalm}}  pathetic","replies":[]},{"poster":"Mascheranox","date":"2019-04-29T10:35:46.252+0000","up_votes":1,"down_votes":0,"body":"No pensaste en cambiar de champ ?","replies":[]},{"poster":"Drakeyobesus","date":"2019-04-29T06:59:07.563+0000","up_votes":1,"down_votes":0,"body":"Me regalas tu cuenta?","replies":[]},{"poster":"MrFriki","date":"2019-04-29T06:32:18.557+0000","up_votes":1,"down_votes":0,"body":"no estoy tan de acuerdo con lo ultimo que pusiste, pero si queres agregame y voy jg, ultimamente se me esta dando mejor.","replies":[]}]}