{"poster":"Rakiltx","date":"2016-03-09T23:34:57.503+0000","title":"Perdi las 2 primeras rankeds (duda)","subforum":"Nuevos jugadores","up_votes":2,"down_votes":1,"body":"No me llenen de negativos :v pero perdi mis 2 primeras rankeds el 1 lo admito jugue algo mal pero el 2do se fue afk uno de mi team -.-\nQuisiera saber q liga qedaria \nllegue a leer x ai q las primeras rankeds son las mas importantes \nAun podre qedar en plata aunqesea? :L\nPd: 1ra ves q rankeo \n{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Lucrexio","date":"2016-03-09T23:48:42.678+0000","up_votes":2,"down_votes":0,"body":"Jugar sin miedo es lo mejor que te puedo aconsejar, y las primeras rankeds no son las más importantes, las más importantes son las partidas de promoción de liga, ahi si que no queres perder, en cuanto a mi experiencia, todo depende, mis primeras 10 rankeds gane 5 y perdi 5, dejandome en plata IV, luego le empecé a dar hasta subir a oro el año pasado.\nAunque ganes 10 de 10 no vas a quedar en diamante, incluso si quedas en bronce V no importa, la idea es subir de división, puede ser frustrante, pero si jugas seguido, es poco probable que uno \"muera en bronce\".\nSaludos y suerte!","replies":[]},{"poster":"TheLeyend07Soure","date":"2016-03-14T14:09:51.881+0000","up_votes":1,"down_votes":0,"body":"Emm si dices que es la primera vez que rankeas yo te tiro a bronce III o I despues contestame como te va :V","replies":[]},{"poster":"Lukisapp","date":"2016-03-13T21:08:47.964+0000","up_votes":1,"down_votes":0,"body":"Yo creo que si perdiste 2 ya , ganando bien las 8 que te quedan teniendo un buen score,  estarias en un plata IV o III","replies":[]},{"poster":"danye15000","date":"2016-03-10T00:26:51.069+0000","up_votes":1,"down_votes":0,"body":"yo = :P pero creo que es mas importante como juegas que si ganas o perdes las primeras 10, lei a alguno llorando de que gano las 10 y quedo bronce 5 (aunque probablemente sea mentira)","replies":[{"poster":"Lukisapp","date":"2016-03-13T21:07:32.802+0000","up_votes":1,"down_votes":0,"body":"Puede ser verdad , pero quisa la season anterior era bronce V y tiene el elo muy bajo y suma poco cada vez que gana . PD: le paso a un amigo","replies":[]}]},{"poster":"La corrupción","date":"2016-03-10T17:10:55.646+0000","up_votes":1,"down_votes":0,"body":"Mira, con ganar 2 o 3 de las 10 quedas en plata, pero no hagas premade con bronces v o iv porque te cagan el mmr si perdes","replies":[]},{"poster":"EPH Cris","date":"2016-03-10T16:44:17.704+0000","up_votes":1,"down_votes":0,"body":"Yo la primera vez que jugue ranked quede 4w-6l y quede plata 3, rankea sin miedo y si quedas bronce, se sube.","replies":[]},{"poster":"Waninoko Main","date":"2016-03-10T10:03:40.751+0000","up_votes":1,"down_votes":0,"body":"2 partidas no tienen importancia y las primeras 10 son las menos importantes son mas importantes las siguientes 100 partidas que te suben de liga XD","replies":[]},{"poster":"elaguirree","date":"2016-03-09T23:45:03.116+0000","up_votes":1,"down_votes":0,"body":"no, vas a quedar en bronze 1 si ganas las que te quedan .","replies":[{"poster":"TheeBoneless","date":"2016-03-10T00:20:22.484+0000","up_votes":1,"down_votes":0,"body":"yo gane 4 de las 10 primeras...habré cagado 2 en total...después las demás es como si yo hubiera tenido la maldición del team \"toxipetflammtrolfeedafk\" \n y quede en bronce 1...... osea, si hubiera ganado 2 mas capaz que quedaba en plata 5 :p","replies":[]}]},{"poster":"Ufaaaaaaaaaa","date":"2016-03-09T23:36:10.326+0000","up_votes":1,"down_votes":0,"body":"si ganas las 8 restantes (y asumiendo que no rankeaste la temporada pasada) es probable que logres quedar en plata.","replies":[]},{"poster":"Yrox the Third","date":"2016-03-09T23:35:57.021+0000","up_votes":1,"down_votes":0,"body":"Si tu MMR es alto quizas, pero si son tus primeras rankeds en esa cuenta entonces si, son bastante importantes.","replies":[]}]}