{"poster":"HGS Headsky77","date":"2018-02-13T21:11:07.166+0000","title":"perché perdo 23 lp e se vinco ne prendo 15?","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"sono gold 5, ho perso 7 game consecutivi (di cui 3 a 0lp). \r\nDa lì in poi quando vinco un game guadagno 15 lp invece se perdo me tolgono 23. ho controllato il mio mmr su op.gg ed era arrivato a silver 3, ora anche riavendolo portato alla normalità perdo molti più lp di quanti non ne guadagno. sapete dirmi il perchè, grazie","replies":[{"poster":"A Yordle ln Heat","date":"2018-02-13T21:21:17.643+0000","up_votes":4,"down_votes":0,"body":"Op.GG non è completamente affidabile, daltronde non hanno l'algoritmo esatto che viene usato su League of Legends.\nPer dirlo in parole semplici, il matchmaking ritiene che tu non meriti la posizione in cui ti trovi (e quei sette game persi di fila potrebbero essere la causa principale), perciò sta tentando di farti scendere.\n\nVinci una manciata di partite e riporta il tuo winrate ad una posizione più stabile, e il problema dovrebbe risolversi.","replies":[]},{"poster":"Demigod Summoner","date":"2018-02-13T21:56:47.563+0000","up_votes":1,"down_votes":1,"body":"In parole povere il sistema ti mette contro a dei silver 1-2 e tu perdi","replies":[{"poster":"Lunatic Shacster","date":"2019-05-28T08:33:59.991+0000","up_votes":1,"down_votes":0,"body":"succede anche a me in questo momento, ma se guardi il mio kda è ok, la wrate mi si è abbassata da 70% totale (dalla gold 4 avevo 95% su seju) a 50% perché la maggior parte delle volte da quando sono in plat 4 vengo trollato, non scherzo x) e pensare che pensavo di hittare il diamante easy questa season, è inspiegabile quello che mi sta succedendo lol","replies":[]}]},{"poster":"Saibbo","date":"2018-02-13T21:36:45.735+0000","up_votes":1,"down_votes":0,"body":">ho controllato il mio mmr su op.gg ed era arrivato a silver 3\n\nEmh si, Op.gg calcolo l'MMR in modi totalmente diversi da quelli effettivi del sistema ranked. \nOgni volta che perdi l'MMR(vero) si abbassa, e continuando a perdere ti mette sempre di più con gente di MMR più basso e se l'MMR e' più basso di quello dell'elo in cui ti trovi perdi più LP di quelli che vinci perché il sistema calcola che tu ti trovi ad un elo troppo alto per te e cerca di bilanciare portandoti ad un elo più basso. L'unica soluzione e' quella di iniziare almeno ad avere un win-rate attorno al 50% per \"stabilizzare\" l'MMR e tornare a vincere più di quanto perdi.","replies":[]}]}