{"poster":"Spongeling","date":"2015-08-05T10:52:32.752+0000","title":"Kölns erste Gaming-Bar","subforum":"Esports","embed":{"description":"We want gaming and eSports to grow - from a side event in a rented bar into something unique. That's why we want to open up our own dedicated gaming & esports bar in Cologne! A place where gamers, cosplayers and the hardest tabletop-tradingcard-anime-scifi-LARP-comic-nerds feel at home and can share their passion with others.","url":"http://gamingbar-koeln.de/","image":"http://gamingbar-koeln.de/img/portfolio/dreams.png"},"up_votes":3,"down_votes":0,"body":"Hallo zusammen :)\r\nich bin Andy und organisiere seit Ende 2012 die Bar of Legends Cologne Events - das ist quasi &ldquo;Public Viewing&rdquo; f&uuml;r LoL Turniere, inklusive https://www.facebook.com/media/set/?set=a.166281333554485.1073741830.165445626971389 unserer selbst-kreierten LoL-Cocktails. https://www.facebook.com/BarOfLegendsKoeln/photos_stream?tab=photos_albums Hier findet ihr ein paar Fotos von unseren Events. Jetzt wollen wir unsere eigene eSports-Bar er&ouml;ffnen.\r\n\r\nZu diesem Zweck haben wir gerade ein Crowdfunding gestartet auf \r\nhttp://gamingbar-koeln.de/\r\nWenn ihr mal bei uns wart oder uns einfach nur unterst&uuml;tzen wollt k&ouml;nnt ihr gern etwas spenden, es reicht aber auch schon wenn ihr einfach unsere Seite teilt. Das hilft uns enorm und ihr supportet eSports! Danke an euch alle und habt einen sch&ouml;nen Tag :)\r\n\r\nAndy\r\nBar of Legends Cologne","replies":[{"poster":"Coblift by far","date":"2015-08-05T13:28:04.048+0000","up_votes":1,"down_votes":0,"body":"Geiler Shiat, werde demnächst mal auftauschen!\n\nFalls Ihr mal Unterstützung braucht, ich bin euer Mann!","replies":[]},{"poster":"SwissKeks","date":"2015-08-05T10:56:57.586+0000","up_votes":1,"down_votes":0,"body":"War zwar damals nicht dabei, hab aber die Fotos gesehen und mit ein paar Leuten die da waren gesprochen, auf jeden Fall eine super Bar! Komme beim nächsten mal sicher vorbei ;)","replies":[]}]}