{"poster":"Mira Arya Enthe","date":"2017-08-05T23:01:50.956+0000","title":"Some Opinions for When Kayle is Reworked","subforum":"Gameplay","up_votes":55,"down_votes":6,"body":"Kayle. One of my favorite possible Champions as I have a huge thing for Dark Angels, Angels, Demons and Valkyrie. With some of the potentially most boring non-interactive game play in any game ever. &quot;Hur dur not every champion is Azir!&quot; That argument doesn&#039;t even make sense because Azir was non-interactive, and dominated the entire game when he was strong. So let&#039;s please not act like there isn&#039;t a middle ground, a healthy amount of skill requirement and dynamic gameplay, counterplay and fair design without being Riven.\r\n\r\nThat all in mind I have some personal directions I would personally enjoy if Riot took. So I will state my personal opinions on where I would personally like to see Kayle go. Most of these are gameplay related opinions I personally hold so I put it here so I&#039;ll get the one lore related thing out of the way.\r\n\r\n1: I&#039;ve said this before and it&#039;s more lore related so I&#039;ll be brief on it. Basically please don&#039;t follow the non-stop trope everybody is doing of &quot;the dark one is actually the good one&quot; you&#039;re supposed to be able to pick either side, let&#039;s not make Kayle intolerably evil for the sake of making Morgana look good like every other single one of these matchups between light and dark. I would honestly find Kayle unbelievable and dull if she had no humanity or morality for the sake of riding the never-ending Edge train. It would be awesome if both sides were well meaning and therefore assumed they were right in being opposites. Rather than opposing assholes where we desperately try to find something agreeable about them.\r\n\r\n2: This is the gameplay part though aimed a bit more on the in game visuals and such. I would love it if Kayle actually felt really powerful. No I&#039;m not talking a big and muscular like Illaoi, as an immortal magical being that is far from necessary. Nor am I talking about her feeling always in control of every situation like Camille, that is just frustrating to play against ~~and annoying to play as stfu Camille~~(just a joke). I&#039;m talking about visually and in audio, having the kind of high impact High weight and power feel that you can apply with proper effects, voice overs and who visual design. \r\n\r\nBasically I wanted to feel like she is raining fire on your head, blasting you with hallowed forces, smiting you down. Screeching, howling, thundrous sounds. And when she shields or heals somebody that needs to feel truly redeeming and like you/she is invincible within her presence. For some reason content creators only think that dark supernatural beings need any kind of aura or presence, as a writer I find this to be foolishly missed opportunities. Kayle could have a very ominous, powerful and amazing feel about her. Reflected most through her gameplay, the visual effects of her abilities, her audio, voiceover and model.\r\n\r\n3: The game play direction I would prefer with Kayle is a bit different than she is right now. I hate how her E doesn&#039;t even so much feel like an ability for her, and more feels like a limitation placed on her early game. This reminds me of Ashe&#039;s old slow, it doesn&#039;t feel like a rewarding button to press, it feels like a penalty that becomes less encumbering as the game goes on. I do understand why it exists for balance and fairness.\r\n\r\nThat said a rework is the ideal time to change a Champions core purpose to be more fun, more played, more fair, healthier, to have a good level of skill expression, healthy power scaling, and counter play. I think the biggest mistake that could be made with the Kayle rework, is to stick to the core gameplay of being a mage ADC who is just limited early game but becomes ridiculous if she&#039;s allowed to get a few Farm. Being utter trash early game, but if the meta or team composition or enemy team lets her get too late game, she loses all sense of counterplay and fairness. So I think the biggest thing that is unhealthy about Kayle is her E.\r\n\r\n4: That brings me to another point. This rework must define what Kayle is. As it stands she has abilities ranging from support to marksman to fighter to mage. And while I certainly believe in multi-purpose Champions who can do more than one thing or are worth more than one button, in Kayle&#039;s case that has led to this unhealthy amalgamation that in certain meta is insanely overbearing in just about any role. But in any other meta is a piece of trash, whose stats just don&#039;t check.\r\n\r\nShe can be a kiting monster, a frustrating make the Marksman invincible piece of trash, or actually just a piece of trash. Me personally, I would aim for a semi ranged fighter, with limited but good feeling supportive capabilities. That to me embodies an Angel. Then Riot will need to decide what Lanes balance her around. Personally I would prefer her to be balanced as a bot Lane alternative to a standard Marksman and/or a bot lane alternative to a standard support. That said I will not push this agenda on anybody, if her fan base, Riot or the general player base would prefer her elsewhere so be it. Top, Mid and Jungle are all fine too.\r\n\r\n5: I have a love-hate relationship with Kayle. She&#039;s frustratingly boring to play yet is so close to being something awesome, she fills one of my favorite archetypes alongside dragons, Valkyrie and others. And can be frustrating as heck to play against, and playing as her as frustrating unless you&#039;re super fed and even then somewhat boring. So I really hope that Riot goes right with her rework. It would be the first release or rework that has excited me in a while. I would say a lot about Morgana who is equally exciting, but Riot tends to be pretty good at making dark stuff. And I don&#039;t have many problems with directions they could go with Morgana gameplay.\r\n\r\nAs usual I hope you enjoyed this read, I posted this with the best intentions for the direction of this champion. And I&#039;d love to see your views on a Kayle rework.\r\n\r\nMira Arya Enthe.","replies":[{"poster":"SweedishGunner","date":"2017-08-06T01:51:50.323+0000","up_votes":31,"down_votes":2,"body":"If she could not be like a ranged Tryndamere that'd be great.","replies":[{"poster":"AirKingNeo","date":"2017-08-06T02:41:47.238+0000","up_votes":3,"down_votes":10,"body":"I didn't know Kayle was an RNG based champion with a 5 second undying effect.","replies":[{"poster":"aspects1","date":"2017-08-06T09:04:19.588+0000","up_votes":8,"down_votes":2,"body":"shes got 3s immortality, which is pretty close","replies":[{"poster":"junglerboy16","date":"2017-08-06T13:21:03.144+0000","up_votes":2,"down_votes":1,"body":"and the range, shred, and targeted slows don't help.","replies":[{"poster":"AirKingNeo","date":"2017-08-06T15:01:48.825+0000","up_votes":2,"down_votes":4,"body":"low MR, a shitty heal, Q damage that falls off, weak passive that falls off late game, and mana issues don't help her either.\n\n\"But kayle has no weaknesses and I've never played kayle nor understand kayle. Just fuck kayle.\"","replies":[{"poster":"I am Spongeboob","date":"2017-08-06T16:51:32.513+0000","up_votes":8,"down_votes":1,"body":"Paasive falls off late game? What drugs are you smoking? Lv 1 she can shred only 5ish armor/MR. Late game you're basically a walking Black Cleaver/Void Staff for your team.","replies":[]},{"poster":"Elikain","date":"2017-08-06T21:17:25.148+0000","up_votes":3,"down_votes":0,"body":"What were you expecting exactly?\nThat her passive equals a full item for tank killing and that should also be an ability that someone else from your team might use to their advantage?\n\nI'm not even saying that she has no counter but that playstyle is just boring for both parties.\nKayle's dueling can only go up with the pace of the game, not down. Because the more items she has, the less time she has to hit you to kill you and outside of your Flash, dash or whatever ability you have to escape, you're locked in her range while she can just ult herself and you're then waiting to die. That's how interactive she is.","replies":[{"poster":"AirKingNeo","date":"2017-08-06T22:43:35.923+0000","up_votes":1,"down_votes":1,"body":"If her passive is worth 1 tank item tank (which I doubt), then you must consider the fact that LDR is about 2 tank items of armor plus a 20% damage boost.\n\nSeriously, compared Kayle DPS vs a tank to an ADC's DPS vs a tank.","replies":[{"poster":"Elikain","date":"2017-08-07T02:34:31.364+0000","up_votes":2,"down_votes":0,"body":"Kayle is not a Marksman nor does she equal their late game DPS.\nKayle's got a lot of DPS on her own but it's really locked to her core items that are quite expensive. The thing about Kayle and her DPS is all about her ult. Most champions she wants to duel don't have hard CC to buy time for her ult to go down so even in a 1v1 against a late game Marksman, things are definitely in her favor.","replies":[]}]}]}]}]},{"poster":"AirKingNeo","date":"2017-08-06T15:00:20.282+0000","up_votes":1,"down_votes":1,"body":"2/2.5/3\n\nVery different since it doesn't require to be at 1 HP.","replies":[{"poster":"aspects1","date":"2017-08-07T07:50:54.888+0000","up_votes":1,"down_votes":0,"body":"hence why i said pretty close\nthey serve the same purpose: keep you from dying while you do damage","replies":[]}]}]}]}]},{"poster":"DorkunedAuras","date":"2017-08-05T23:42:17.313+0000","up_votes":17,"down_votes":0,"body":"Ok, just throwing ideas here since this seems to be the place to do it. \n\nLet's work off her basis that her ult, in some form or another, is staying. She will be able to make selected person invincible. The big thing is how exactly it works. I think right now, her ult is goddamn stupid. Instantly \"You no die now\". I want some counterplay. Something the enemy fighting her can do.\n\nFor example, When Taric hits R, you have stuff you can do. You can destroy everyone in the area, you can knock people away from his ult. Ya know, proactive things. That's what I want from this invulnerability. If she has to have it, let her enemies not be sad.\n\nBeyond that, I'm skeptical of the idea of \"possible DPS or Utility source\". Whenever a DPS champ has too much utility, that's always been a problem. Either their DPS needs to be lower than what you'd typically want, or their utility isn't that significant. There's never been a successful case of a champ being both Primary DPS or Supportive utility based on speccing without serious issues.","replies":[{"poster":"Arakadia","date":"2017-08-06T02:25:33.806+0000","up_votes":1,"down_votes":0,"body":"Aren't mages usually a solid mix of DPS and utility?","replies":[{"poster":"Mira Arya Enthe","date":"2017-08-06T02:32:38.935+0000","up_votes":8,"down_votes":0,"body":"Burst and utility.","replies":[{"poster":"Fefnil","date":"2017-08-06T17:39:17.875+0000","up_votes":2,"down_votes":0,"body":"Depends on the mage. Burst mages are burst, Battle mages are DPS, and Artillery are a mix of both, having pretty much a consistent low dps poke and secondary skills to burst.","replies":[]}]}]},{"poster":"Mira Arya Enthe","date":"2017-08-05T23:48:14.993+0000","up_votes":2,"down_votes":1,"body":"I agree. I would prefer she lose that primary DPS role. It feels bad as her focus imo to just be a late game AoE magic damage ADC with a invincable shield. I'd prefer a shift towards fighter with some utility and some range.\n\nKey words. Prefer. Just a warning to readers these are those wicked opinion things.","replies":[{"poster":"AirKingNeo","date":"2017-08-06T00:52:19.625+0000","up_votes":2,"down_votes":9,"body":"Then that's really Kayle. Kayle is a high DPS (but not the greatest tank buster) with single target utilities (which aren't even that strong into the late game) and has an invulnerability (which makes up for her Q, W, and Passive being kinda weak). Changing identities to a well defined champion wouldn't exactly be good.\n\nEDIT: Fuck constructed opinions.","replies":[{"poster":"DorkunedAuras","date":"2017-08-06T01:51:01.176+0000","up_votes":8,"down_votes":2,"body":"A rework's job is to mess with their identity a bit to make it actually distinct and not a mess like several old champs were. Kayle's going to have to change to not have an incredibly stupid kit, which she does have right now.","replies":[]}]}]},{"poster":"woodvsmurph","date":"2017-08-06T08:14:45.858+0000","up_votes":3,"down_votes":6,"body":"Taric ult protects up to his entire team; kayle ult protects 1 person. Taric ult gives cc immunity if I am not mistaken; kayle ult still leaves you vulnerable to cc.\n\nKayle ult must be properly timed to block maximum damage or it is wasted. Zilean ult doesn't always have to be times so perfectly.\n\nKayle has to choose a target to ult, zac and aatrox get to revive themselves without pressing anything or worrying about timing.\n\nKayle can't ult herself while hard cc'd; tryndamere can.\n\nKayle can block 100% of enemy damage for like up to 3 seconds every 40 seconds late game. Jax can block 100% of aa damage and 75% of aoe damage for like 4 sec straight before having to wait another 4 sec to use the ability again. Oh, and jax can access this ability at level 1.\n\nYes clearly kayle ult is so much more broken than all the other abilities in the game... said no one who clearly thought about the issue.\n\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"DorkunedAuras","date":"2017-08-06T08:22:54.694+0000","up_votes":3,"down_votes":1,"body":"Ok, let's break this down 1 by 1, because clearly you have an understanding of the examples.\n\nTaric ult: Has a 2.5 second delay, must be used in advance, cannot be done reactively. Does not give CC immunity.\n\nZilean ult: Done too early and enemies back off, waiting out the timer, or just pop the person, wait by the reviving corpse, and kill them again. Kayle ult by comparison will guarantee you live the next 2-3 seconds. Granted, both can be cast immediately reactively, and both casts can be stopped by CC.\n\nAatrox has to fight while his passive is up. If he doesn't have all 5 stacks and his power up mode active, he will not revive, even if it's off CD. Meanwhile, you can just kill Zac while he's reviving.\n\nTrynd... not addressing that one\n\nJax counterstrike lasts 2 seconds and dodges 25% of AoE damage. Assuming a standard 20% CDR from Triforce and no other sources, standard for Jax (I have 200k in him, I'd know), counterstrike has a 6.4 second CD after the ability ends. Even with max CDR, it goes down to a 4.8 second CD, which is actually close to your argument. Congratulations on having a second accurate point.\n\nSo, about that \"thinking about the issue\" thing...","replies":[{"poster":"woodvsmurph","date":"2017-08-06T08:40:58.925+0000","up_votes":2,"down_votes":6,"body":"1. You just said zil ult and kayle ult are more or less the same thing. Your \"camp the corpse\" strat is no different from from sitting on whoever kayle ults until her ult ends.\n\n2. If aatrox isn't fighting he loses his revive? If kayle isn't in combat, there's no point to her ult so uh... I fail to see the difference here?...\n\n3. Trynd - yeah you just admitted you lost this one; so that's actually point 3 for me.\n\n4. Jax = 4th point.\n\nIf you can't handle kayle ult, just ban her. But don't falsely argue that her ult is completely unique in it's abilities/effects or that it is by far stronger/better than all other similar abilities.","replies":[{"poster":"DorkunedAuras","date":"2017-08-06T08:45:32.014+0000","up_votes":5,"down_votes":2,"body":"The big difference between Zilean ult and Kayle ult is that if Zilean ult goes off, you can stand on the body and they can't do anything. If Kayle ult goes off, you're standing next to her while she's wailing away on you.\n\nAatrox has to manage his passive and make sure he has it up. It's not always up in combat, it's a thing he has to carefully manage and can be readily played around.\n\nHow is Jax a won point for you? I pointed out that most everything you said about him was incorrect.\n\nNot to mention, I pointed out that most of your information about these champions was wrong.\n","replies":[{"poster":"woodvsmurph","date":"2017-08-08T09:43:25.949+0000","up_votes":1,"down_votes":1,"body":"Completely false. Kayle can easily be cc'd during her ult leaving her as useless as the \"dead body\" zilean strat you suggest. If your team drafts no cc, that's your fault. Simply threaten her with burst, drop some cc when she ults while holding off your burst or nail her with burst after you cc her if she didn't respect your damage and ult herself. Then kaboom, a second after her ult ends (during which she MAYBE got off 1 sec of dps) you delete her. Wow so damn hard lol.\n\nAatrox passive isn't always up? So kayle ult has 0 cd? And you are missing the whole damn point. Either because you are that challenged, or more likely because you are intentionally trying to hide it. Aatrox gets his \"op\" revive available as soon as level 1 while kayle has to wait for level 6.\n\nFinally, you admitted jax has his counter-strike up for about 50% of the time he is in combat. And don't forget all the free resistances he gets from his ult in addition to his counter-strike. Oh, and that's another ability available at... level 1. Compared to level 6 for kayle ult. And much, much, much lower cd on counter-strike.\n\nKeep dreaming. You are completely utterly blindly biased to argue against me or you have never played the game and simply like to argue without putting any thought or research into what you say. So bored of arguing with someone who doesn't use their brain.","replies":[{"poster":"DorkunedAuras","date":"2017-08-08T20:57:25.426+0000","up_votes":1,"down_votes":0,"body":"> counterstrike has a 6.4 second CD _**after the ability ends**_\n\nLess than 25% uptime.","replies":[]}]}]}]}]},{"poster":"SanKakU","date":"2017-08-06T15:02:07.994+0000","up_votes":2,"down_votes":0,"body":"Can't believe how many down-votes you're getting. I guess people just can't accept that their full offense build isn't as good as they think it is, and Kayle is one of the most hideous champions to them because she's allowed to build full offense and strike them down while they are essentially helpless. It's not like Kayle does a ton of burst damage, so if you're dying to her 1 vs 1 during her ultimate it's your own fault for not building enough health.\n\nAlthough, I guess you could've made sure your numbers were a bit more accurate, so maybe that's why people are triggered.","replies":[{"poster":"woodvsmurph","date":"2017-08-08T09:49:18.009+0000","up_votes":1,"down_votes":0,"body":"No, it's just a bunch of low skill players who hate kayle because they have 0 clue how to play against her. That and people who main the champs I talk about who feel that kayle is stronger than them and that their champs need a buff or something. The same people who cried for zed nerfs after lethality was majorly nerfed after the first time it was buffed half a season ago. The same people who are perma-banning janna now because omg she has a shield and an ult that aoe heals and saw it played to success in the pro scene. I appreciate you being willing to post here despite all the downvotes though. Most people stay silent even if they agree because they might get downvoted too.","replies":[]}]}]}]},{"poster":"NineTailedMystic","date":"2017-08-06T00:16:34.315+0000","up_votes":2,"down_votes":6,"body":"Pls not a Fighter.","replies":[{"poster":"Mira Arya Enthe","date":"2017-08-06T00:24:34.871+0000","up_votes":8,"down_votes":1,"body":"Well she is a heavily armored angel with a sword. And making her a tank, juggernaut, assassin or skirmisher would be far too far from her design. Her being a mage or ADC seems... odd. And being a pure support conflicts entirely with her lore and visual design. Her being a fighter with some ranged and/or support and/or mage attributes tends to line up the best, and was her original intent in an old version of the game where the designers still weren't sure if this game was still a ripoff of dota or not, which is the only reason she is the mess she is today.\n\nWhat class would make more sense for her character and thematic when setting aside all bias and vendettas?","replies":[{"poster":"Doozku","date":"2017-08-06T00:45:16.549+0000","up_votes":12,"down_votes":2,"body":"Perhaps some kind of semi-ranged Skirmisher character. Think like what they did with Urgot but instead of Juggernaut she's a skirmisher because she has some slight range.\n\nAlso maybe even some utility on her kit like how she has right now, although I'd rather they go against just making it a bland heal.\n\nThey could also go the option of making her into a unique playstyle champ. Riot never designs champions with unique playstyles these days.","replies":[{"poster":"Mira Arya Enthe","date":"2017-08-06T02:11:05.709+0000","up_votes":4,"down_votes":0,"body":"So like Ekko?","replies":[]},{"poster":"FantasySniper","date":"2017-08-06T09:50:51.128+0000","up_votes":2,"down_votes":0,"body":"Unfortunately, that kind of archetype could overlap heavily with Kennen.","replies":[]},{"poster":"DorkunedAuras","date":"2017-08-06T02:00:08.624+0000","up_votes":2,"down_votes":0,"body":"Skirmisher but with range and utility sounds terrifying. Most skirmishers have limited utility and are melee, stuff you can play around. They have strong defensive tools, but they're situational and selfish. Kayle doesn't align with the ideas of a skirmisher. If anything, she's a marksman/enchanter hybrid right now.","replies":[]}]},{"poster":"NineTailedMystic","date":"2017-08-06T00:47:45.138+0000","up_votes":3,"down_votes":4,"body":"I mean, I'm just speaking entirely from bias. Kayle is one of the very few champions I enjoy, and I just don't like Fighters.","replies":[{"poster":"DorkunedAuras","date":"2017-08-06T01:59:01.291+0000","up_votes":3,"down_votes":0,"body":"I think we all know what you _really_ like","replies":[]}]},{"poster":"NineTailedMystic","date":"2017-08-06T04:24:12.266+0000","up_votes":2,"down_votes":0,"body":"Alright I've thought about harder and what I like about Kayle. What I think I like about her is how she fits a Paladin archetype. She is the other side of the coin to Taric. Where Taric is the Paladin who defends his allies, Kayle is the Paladin who smites her enemies.\n\nAnd honestly, that should be a Fighter kit as much as I don't like that.","replies":[]}]}]},{"poster":"AirKingNeo","date":"2017-08-06T00:49:17.915+0000","up_votes":5,"down_votes":3,"body":"Kayle's E is actually her entire playstyle and design and I think abilities that are static like that are fine. I also don't want Kayle to be made complex in any way. I think her being simple and based around her E is a different direction and uniqueness than any other champion in the game.\n\nKayle is a self peel marksman who falls off against tanks in the late game due to being hybrid damage and whose peel falls off in the late game (her heal does not scale way and she can't build into any sustained healing). I think her current kit is fine because her Q being targetted allowed her to negate a lot of the high and somewhat extreme outplay potential of a lot of champions and assassins. Her heal exists because she doesn't have lifesteal, though I guess changing her W into something a lot different and upping HP regen a but would be fine. Her E is her core gameplay and uniqueness. Her ultimate is something that takes a lot of power budget and is my personal favorite while is also the most basic way to learning ability timing (on a beginner champion).\n\nAs for lore and VO and character design? I'd just update on her current model and her sword should be tied or relate to her lore if it has those weird symbols on it. Probably update the Aether Wing lore too. Attack animation should be fixed on both base and Aether (Aether is a bit clunky at low attack speed). Probably fix her auto canceling where a sound and even the E's splash animation shows but deals no damage. I like her current lore so maybe keep it a bit similar and improve on it.\n\nEDIT: Fuck people having constructed opinions.","replies":[{"poster":"DorkunedAuras","date":"2017-08-06T02:03:14.185+0000","up_votes":6,"down_votes":1,"body":"She can absolutely build into Sustained healing. {{item:3153}} {{item:3146}} are both viable options on her.\n\nHer peel doesn't fall off, her Q slow is still massive, her W still gives a bunch of movespeed, her Ult is her ult.\n\nShe can shred tanks with her extremely high sustained damage late game.\n\nHer E is an incredibly boring ability built to limit her early game and force her to build CDR if she wants to maintain her uptime. I'd rather she have her power gated behind a real ability, rather than a glorified toggle with an extended CD.","replies":[]}]},{"poster":"The Mighty Flea","date":"2017-08-06T07:31:54.698+0000","up_votes":4,"down_votes":0,"body":"I think she should have a Imperius from Diablo 3 vibe to her in regards to her power and attitude","replies":[]},{"poster":"Vallalan","date":"2017-08-06T09:12:31.311+0000","up_votes":4,"down_votes":1,"body":"her ult is the most toxic part of her kit, note the E. I'd argue the Q, W are boring and can be throw away abilities. but the E is iconic to kayle players. It's what makes Kayle, well...kayle.\n\nthe ult though is super busted. it's why they constantly have to gut her and not do other buffs to her like increase the range she has when she pops E, etc. they can't buff her. as long as she can go god mode and kill everyone in 3 seconds once she gets enough items, she can't be balanced.\n\nrework the ult cuz its cancer, and the Q and W because they are boring. they you can create a healthy and fun to play champion. \n\nalso its important to note that we need multiple options for sustained magic damage in this game. \n\nif you change Kayle's E then thats one less champ. right now there's pretty much just Cassio, Kayle, and Azir. Maybe you can include Karthus and Ryze in there as well. regardless there aren't many sustained magic damage dealers. I like that identity for Kayle. I just don't like the ult.","replies":[{"poster":"DarkRitual","date":"2017-08-06T12:21:59.117+0000","up_votes":5,"down_votes":1,"body":"The E is what makes Kayle KAYLE, because the rest of her kit is extremely meh. It's all she has aside from her ult.\n\n{{champion:98}} syndrome.","replies":[]}]},{"poster":"Ahristocats","date":"2017-08-06T08:22:04.375+0000","up_votes":4,"down_votes":2,"body":"azir is interactive?","replies":[{"poster":"TyrekGoldenspear","date":"2017-08-06T12:15:33.542+0000","up_votes":3,"down_votes":2,"body":"Yes.","replies":[{"poster":"Ahristocats","date":"2017-08-06T12:19:04.834+0000","up_votes":4,"down_votes":1,"body":"look you know i also play azir\n\nthere is nothing interactive about someone sitting 800 range away (1175 with the radius of soldiers) with an untargeable soldier pushing the lane","replies":[{"poster":"TyrekGoldenspear","date":"2017-08-06T12:28:33.108+0000","up_votes":3,"down_votes":1,"body":"Wow you reply fast. You use Rubick to copy Ekko ult?\n\nAlso, sure describe one aspect of a champ in a limited phase of the game and use it to call the whole champ uninteractive.","replies":[{"poster":"AirKingNeo","date":"2017-08-06T15:12:10.492+0000","up_votes":1,"down_votes":1,"body":"There's nothing interactive about a high damage extremely long range mage with the best self peel abilities every to invalidate anyone diving him and a dash to further invalidate.","replies":[{"poster":"TyrekGoldenspear","date":"2017-08-06T17:50:25.285+0000","up_votes":3,"down_votes":0,"body":"I think you're having flashbacks of release Azir.\n\nHave you even tried trading with current Azir? It is very possible in his weakened state.","replies":[]}]},{"poster":"Ahristocats","date":"2017-08-06T12:40:46.738+0000","up_votes":2,"down_votes":1,"body":"ok, but i wouldn't put azir as an example of interactive champion","replies":[]}]}]}]}]},{"poster":"GGLineaR","date":"2017-08-06T01:27:13.324+0000","up_votes":2,"down_votes":3,"body":"I kinda want their lore to be tied to the blessed isles and the shadow isles.\n\nSay they were part of an ancient race that fought against Mordekaiser, and Morgana was enslaved for her immense magical power, or something like that.\n\nOf course, that's just because I'm a dirty Mordekaiser fanboy.\n\nEDIT: Why am I getting downvotes now? lol","replies":[{"poster":"Mira Arya Enthe","date":"2017-08-06T01:58:44.649+0000","up_votes":3,"down_votes":0,"body":"Pretty sure they will end up enemies of the Darkin","replies":[{"poster":"KoKoboto","date":"2017-08-06T17:48:57.012+0000","up_votes":3,"down_votes":0,"body":"Wait holy shit you're probably right. A race that made weapons to fight stuff but than the weapons became evil (probably cuz Morgana and her gang) and they destroy everything. Wow that also really ties into the theory that Aatrox is part of the same race as Kayle and Morgana.\n\nHOLLLLLY SHIIIIIIT.","replies":[]}]}]}]}