{"poster":"Grafeno","date":"2018-06-08T23:24:56.216+0000","title":"No se que día van a arrancar a castigar a las premades..","subforum":"Comportamiento del jugador","up_votes":11,"down_votes":3,"body":"Ya estoy harto, no se cuantos posts he hecho ya acerca del tema, es un problema que Riot no se digna ni resolver, las premades de 4 y de 3 la cosa m&aacute;s t&oacute;xica que existe en el juego, y cualquiera que haya tenido que pasar por eso, de ser el 1 fuera de la premade lo entiende perfectamente, es un asco como se defienden, un asco como te abusan, un asco como no te ayudan y luego te echan la culpa, un asco como te flamean, un asco como te trollean, y un asco como cada partida en la que hay m&aacute;s de 2 premades la partida va para la *******.\r\n\r\nOjala Riot se diera cuenta e hiciera 1 de las 2 cosas que puede hacer, 1 empezar a meter castigos m&aacute;s fuertes por estar en premade en lugar de ver individualmente o 2 poner una opcion para decidir si quiero que me toquen o no, me importa un bledo si la cola se me hace mas larga, Detesto, no ODIO jugar con premades especialmente las de 4m que quien sabe por que celestial razon son 4 y no 5.... y me borraran el post, o me lo downbotearan hasta el Averno, pero que es verdad lo que digo, m&aacute;s de 1 lo sabe bien.\r\n\r\nCada partida con premades as&iacute; termina mal, desastrosamente mal, horrible, 20 5, uno se va afk, fedean, mueren a cada rato, ni entre ellos se entienden parecer&iacute;a, y cuando pones surrender cuando vas perdiendo 50 10, te ponen que no y te obligan a quedarte en el juego 40 minutos igual sabiendo que van a perder, solo para hacerte enojar.... y eso es lo peor de todo, porque te obligan ya que si te vaz te encajan report por irte, una barbaridad se est&aacute;n yendo de las manos las premades en estos d&iacute;as, y no hay nada que los desmotiva a hacerlo.\r\n\r\nEncima el que termin&oacute; peor el que termin&oacute; 1/8/1 a ese le dan todos honor bien para restregarme por la cara que hacen lo que quieren y que les importa 2 huevos o una docena de ellos.","replies":[{"poster":"Juliietta","date":"2018-06-08T23:40:28.294+0000","up_votes":8,"down_votes":2,"body":"Wau, si que te hicieron enojar.\nPues, no todos los premades  son malos y trolean, pero si es cierto que otros si lo hacen y se defiendenentre ellos y at que tener cuidado o los 4 te pueden reportar.\nNo eres el único que detesta los emparejamientos, muchos están dispuestos a esperar mucho para tener dignos compañeros de juego.\nPero la realidad es que te la tenes que aguantar, el emparejamiento es así y los castigos nunca son suficientes.\nHay que jugar con all Mute y evitar ser tan idiiota de responder los flameos porque nunca sirvió de nada.\n\nNo siempre toca gente así, por eso aún disfruto el juego.","replies":[{"poster":"Grafeno","date":"2018-06-09T00:11:58.844+0000","up_votes":2,"down_votes":0,"body":"https://i.imgur.com/XaZj7sm.png\n\nesos son 3 premades + el que yo estaba revisando ósea los 4\n\n7 partidas en promedio jugando de a 4 ganaron 2 25% de victoria tienen entre los 4, la verdad no entiendo para qué siguen jugando en premade, yo preferiría arrancar a jugar solo nomas despues de perder tantas veces con mis amigos. Ensima cada vez que me pasa cuando reviso en op.gg es la misma historia las premade sesas de 4 tiene menos de 40% de winrate juntos... como dijiste no son todos, pero cada vez que me toca es la misma historia :S","replies":[{"poster":"TeamSayori","date":"2018-06-09T09:54:46.059+0000","up_votes":4,"down_votes":0,"body":"Si es normal no tiene tanto misterio, juegan por diversion, y aveces hasta se trollean. en cuanto a mi 1 sola vez me toco un premade de 4 toxico y hasta me reportaron los 4 (de todas formas no me banearon)","replies":[]},{"poster":"WhiteMax","date":"2018-06-09T14:23:26.540+0000","up_votes":3,"down_votes":0,"body":"Y les gustara jugar juntos como amigos y no solo tryhardear.","replies":[]}]},{"poster":"Grafeno","date":"2018-06-09T00:03:23.676+0000","up_votes":2,"down_votes":1,"body":"Yo se que no es siempre, pero lamentablemente es el 75% de las veces que pasa es una experiencia negativa, o soy yo el que tiene mala suerte nomas :V","replies":[]},{"poster":"Dada Life","date":"2018-06-09T20:23:11.423+0000","up_votes":1,"down_votes":1,"body":"muchos están dispuestos a esperar mucho para tener dignos compañeros de juego.\n\nyo soy de esos, anteayer perdi una hora y media por penalizaciones de dodgeo y ayer una hora por lo mismo. y aun asi no tenes las de ganar si te tocan malos ya estas listo para prder que se le a a hacer. el juego te dice cuando vas a ganar y cuando vas a perder es muy obvio","replies":[]}]},{"poster":"Bl4ziken","date":"2018-06-09T19:29:57.909+0000","up_votes":2,"down_votes":0,"body":"Hay una solución para eso, /muteall.","replies":[]},{"poster":"OzymandiasV","date":"2018-06-11T19:29:08.614+0000","up_votes":1,"down_votes":0,"body":"Quedate tranquilo que el honor entre premades no suma.Y si, es un pijazo.\nLo mejor que podés hacer es mutearlos de entrada y seguirlos (en el buen sentido).","replies":[]},{"poster":"TerrSinManos","date":"2018-06-09T14:16:06.582+0000","up_votes":1,"down_votes":0,"body":"A mi no me molesta que jueguen mal o vayan antimeta, total, todos tenemos malas partidas o a veces nos dan ganas de probar algo nuevo. El problema es que al ir con premades automáticamente tienes que ir a su ritmo porque son mayoría, y si no te ajustas a SU juego te dejan solo, te toxiquean o te reportan. Como solo player no puedes hacer nada, estas totalmente a merced de la dichosa premade por lo que dure la partida. Al final casi siempre termina siendo desagradable, porque ellos están metidos en su propio juego y tú te tienes que mamar eso :/","replies":[]},{"poster":"AxElL93","date":"2018-06-09T02:13:24.050+0000","up_votes":2,"down_votes":2,"body":"desintalar el juego sera lo mejor :3\nrecomendado","replies":[]}]}