{"poster":"xEvilEagleX","date":"2016-11-11T15:13:30.237+0000","title":"Assasin Rework KOMPLETTER Reinfall?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":7,"body":"Ich habe heute den neuen Talon {{champion:91}}  gespielt und fand ihn am anfang echt mega nice ich war gefeedet und so alles toll und dann ich bin gefeedet wie sonnstwas aber kann nichtmal einen ADC oneshoten. Mit 19/6/5 oder springe ich auf die Sivir{{champion:15}} was Passiert nichts sie rennt einfach mit ult weg und so war es mit allem eine shywana macht mich fasst im 1v1 mit 0/5/0\nalso diese \"counterplay\" zerstört (also bei talon) den ganzen champ","replies":[{"poster":"Enderized","date":"2016-11-11T15:23:49.789+0000","up_votes":3,"down_votes":0,"body":"Von der Überschrift her bin ich ausgegangen, dass du das gesamte Assasin Rework meinstes und wenigstens ein paar Argumente auflisten würdest und genaueres .... naja :D","replies":[]},{"poster":"Im a Papaya","date":"2016-11-11T15:39:23.739+0000","up_votes":2,"down_votes":0,"body":"Shyvana, Einer der stärksten 1v1 Champs im Spiel \ngegen\nEinen Talon der gerade seine gesamten Fähigkeiten auf Cooldown hat.\n\nDas Ergebnis ist, nüchtern betrachtet, nicht schwer vorauszusehen.","replies":[]},{"poster":"Teemo Main","date":"2016-11-11T15:36:17.533+0000","up_votes":2,"down_votes":0,"body":"Wenn du 19/6 stehst haste doch sicher 300 AD da macht doch die passive schon ka 500-600 schaden lass mich lügen egal,\nwenn du auf nen adc deine kombo nicht drauf bekommst dann fass dir mal an den Kopf 🙅🏼‍♂️😅\nUnd shyvana isn tank mit Bloodrazor isses eh schwer die zu plätten die kannst doch nicht bursten was los mit dir :D\n\nAber Ja absoluter Reinfall das Riot nicht die Unfähigkeit einiger spieler mit einberechnet hat.","replies":[]},{"poster":"DontKillMySoraka","date":"2016-11-11T15:24:13.806+0000","up_votes":2,"down_votes":0,"body":"Ich glaube, du hast dann irgendwas falsch gemacht...","replies":[]},{"poster":"Kata Ga Kill","date":"2016-11-12T01:35:34.856+0000","up_votes":1,"down_votes":3,"body":"Finde ebenfalls das komplette Update ein Reinfall.\nOverall ist der Patch nur ein reiner Assassinen NERF.\n\n\nMages etc. können instant den ADC killen aber Assassinen NOPE.\nNicht nur das der Burst weniger ist das Outplay potential ist nicht gegeben man muss eher seinen Squishy Nahkampf Schild hinhalten auf dem steht:\n\"Lieber ADC bitte töte mich\".\n\nDaneben sind AP Assasinen die Behind sind useless die haben kein Lethality.\nAssassinen sind in Teamfights weiterhin useless und das war einer der Punkte die man verbessern wollte damit die Teamfight orientierter werden davon ist aber pustekuchen.\n\nMan hat sich lieber mehr um SUP Items und Jungle Pflanzen gekümmert.\n\nGanz ehrlich Assassinen sind Schlecht und deswegen sollte ein Klassen Update kommen, war aber nurn NERF.\n\n\nAuch Kata Mains finden sie Furchtbar das ist keine Kata mehr das ist iwie ein schlechter nutzloser Clunky Champ.","replies":[{"poster":"Die Bohrmaschine","date":"2016-11-12T08:04:52.443+0000","up_votes":1,"down_votes":0,"body":"Die neuen Assassins sind einfach nur unglaublich schwer zu spielen. Warte mal ab bis einer im professionellen Bereich ausgepackt wird und dir zeigt wie stark die sein können wenn man den nötigen Skill besitzt. Sie sind halt keine faceroll Champions wie beispielsweise Kata es voher war mehr und deswegen halte ich den Patch für gelungen.","replies":[{"poster":"Kata Ga Kill","date":"2016-11-12T13:58:45.845+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xQ WalkingWard,realm=EUW,application-id=Wj1wcocU,discussion-id=LXQsdWEb,comment-id=00070000,timestamp=2016-11-12T08:04:52.443+0000)\n>\n> Die neuen Assassins sind einfach nur unglaublich schwer zu spielen. Warte mal ab bis einer im professionellen Bereich ausgepackt wird und dir zeigt wie stark die sein können wenn man den nötigen Skill besitzt. Sie sind halt keine faceroll Champions wie beispielsweise Kata es voher war mehr und deswegen halte ich den Patch für gelungen.\n\nKein Pro wird verrückt genug sein einen Champ zu spielen der keinen DMG mehr macht, der danben keine Utility fürs Team besitzt.\nBzw. anders formuliert kein Pro wird auf ein Mage verzichten der in allen belangen besser ist:\nRange, Hard CC, und weitaus mehr Burst DMG bzw. genug um den ADC in einer Sekunde zu töten.\nDas beste vom besten eben, da pickt man keine 2te bzw. 3te Wahl.\nSchnell und effizient sollte es sein, man reskiert zu viel um 10 Sekunden draufzukloppen auf dem ADC, da geht nicht nur der Assassine schnell RIP sondern die Teamkämpfe gestallten sich weiterhin 4 vs 5  weil der Assassine mal wieder nix ausrichten kann wenn keiner Low ist (und bedenke hier nochmal weniger Burst bei Assassinen, wenn die dazu behind sind ist 4 mal RIP als früher). \nDa will man lieber nen Mage der aus sicherer distanz Peelen kann und eben instant einen one shotten kann.\n\nDesweiteren haste nicht gescheckt das die Assassinen selbst gemeistert eben nur Rotz sind, in vergleich zu den Pro Picks.\nDas Rumtänzeln wird kaum helfen sondern endet bei wenigen nur darin das man diese Tanky wie Ekko, Fizz, Yasuo baut.\nTank Kata funktioniert besser als die AP Variante wenn dus mal ausprobiert hast.","replies":[]}]}]},{"poster":"Oyasumi Punpun","date":"2016-11-12T10:24:50.380+0000","up_votes":1,"down_votes":0,"body":"Summoner Icon sagt schon alles.","replies":[]},{"poster":"Sephi51","date":"2016-11-12T00:15:49.702+0000","up_votes":1,"down_votes":0,"body":"Ich find es auch schrecklich.\nNen Assasinen der nichts aushällt immer 2 Sekunden warten zu lassen, und nicht nur warten zu lassen sondern auch noch sie dazu zu zwingen am gegner dran zu bleiben, weil das ja nach 4 Sekunden wieder abläuft... ich verstehe es nicht. in 2 Sekunden wirst du von den Gegnern zerissen, wenn nich vom ad carry sogar selbst. das Prinzip von counterplay hin oder her, es passt im Moment nicht in das Spiel rein.","replies":[]},{"poster":"LCG mozuki","date":"2016-11-11T15:44:05.309+0000","up_votes":1,"down_votes":0,"body":"Talon ist nicht mehr so einfach wie die meisten immer noch anehmen Talon ist Schwer geworden du musst dir überlegen was du machst und warum du es machst kannst nicht einfach yolo reingehen und alles platz das geht nicht mehr xd am besten lies dir nochmal alle Beiträge von den letzten 4 Monaten durch incl. die 6.22 Patchnotes!","replies":[]},{"poster":"Santas hoe","date":"2016-11-11T15:42:05.513+0000","up_votes":1,"down_votes":0,"body":"Das du ein einziges Game mit einem einzigen champion sofort auf das \"KOMPLETTE\" assassin rework beziehst finde ich... mutig. Wieso müssen assassine nur aus oneshots bestehen? Dadurch, dass du nichtmehr entweder auf jemanden draufspringst, ihn oneshotest oder stirbst (oder beides) ist doch gut. Sowohl er als auch du haben die Möglichkeit, aus dem 'fight' zu entkommen. Auch eröffnen sich beiden Seiten dadurch neue Möglichkeiten, plays zu machen.\nZumindest ist das meine meinung\nLg\nThe evil in pink","replies":[]}]}