{"poster":"VvVVvV","date":"2016-09-13T16:32:23.040+0000","title":"2 Problems Here....Anyone Have A Clue?????","subforum":"[ARCHIVED] Help & Support","embed":{"description":"Captured with Lightshot","url":"http://prntscr.com/chkuct","image":"http://image.prntscr.com/image/1cfccc9273f84ea3a0f39a0cf9cb4386.png"},"up_votes":1,"down_votes":0,"body":"1. The screenshot - This is a screenshot of what pops up on my desktop everytime I go to launch League of Legends. it has been happening for awhile now but I never asked about it because I can just click yes and it will launch the game. But I know it shouldnt be normal should it?\r\n\r\n2. My second issue I can not screenshot. It has to do with the client crashing. It doesnt happen ALL the time but it only crashes for me after games. It seems that when a game ends for me.......If I click on the League tab in profiles or Hextech Crafting tab on the home page of the client...my client will crash. Like I said it doesnt happen each time but those are the only times it crashes for me. I dont know the elapse time but it seems if I wait for a certtain amount of time after a game then it will not happen.\r\n\r\nAlso, uninstalling and reinstalling the game has not stopped it from happening.\r\n\r\nAny clue or suggestions?","replies":[{"poster":"Porocles","date":"2016-09-13T16:40:17.642+0000","up_votes":1,"down_votes":0,"body":"The first issue you're seeing usually happens when you try to open league multiple times, and will result in that order as it's only able to launch one single client.    It sounds that you are still able to login and play without issue.  If not let me know!\n\nThe second issue can happen when you are using third party programs that interact poorly with league.  Remove any apps like play.tv, lolrecorder, or overlays as they've been known to cause these problems.  Let me know if you have any questions!","replies":[{"poster":"SlaWNibproo","date":"2016-09-13T16:42:05.146+0000","up_votes":1,"down_votes":0,"body":"Porocles. PLease answear me. I really need help ;)","replies":[{"poster":"Porocles","date":"2016-09-13T16:51:21.644+0000","up_votes":1,"down_votes":0,"body":"What's up, friend?  \n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"SlaWNibproo","date":"2016-09-13T17:02:46.333+0000","up_votes":1,"down_votes":0,"body":"YES FINALLY. OMG I AM SO HAPPY AT THE MOMENT. i have sooo many questions. This might be the luckies day of my life. Please hang on.\n\nI recently found out that one of my friends logged into my account in EU West and changed region TO RUSSIA. I have now changed password and email on my account in russia so therefore he wont be able to log into my account anymore. Now the problem is to go back to EU West.  I am really desperate to get my account back since league is just soo big for me. It honestly changed my perspective of life and i am not even joking even though it sounds a bit silly. I have watched all the league of legends ´´live play mini seriies`` on youtube and i can relate to all of them. Having my account back to EU west would be the dream for me. I have already sent 5 tickets to riot. Sorry for causing so much trouble but like i mentioned earlier. League is a part of my life.\n\nPLease help me Porocles.","replies":[{"poster":"Porocles","date":"2016-09-13T17:06:33.245+0000","up_votes":1,"down_votes":0,"body":"No worries, we can look into for you.  I know it may be a stressful situation, but actually creating so many tickets like that end up causing both confusion and delay.  Depending on the size of the queue it may be a bit to receive a response, but one ticket should do the trick.  Our account recovery team will be able to assist with both recovery and any reparations like transferring you back.  Hang tight!","replies":[{"poster":"SlaWNibproo","date":"2016-09-13T17:10:39.093+0000","up_votes":1,"down_votes":0,"body":"ahhhh. Thank you soo much. It is enough for me hearing if you guys have got my ticket. I just want to know if you have recieved it. The last days have been soo tough for me. I cant concentrate properly because the only thing that comes in my mind is. ´´did they recieve it? What if they did not recieve it? What if riot did recieve my message but forgot to answear? But i am really glad to hear that you have recieved my tickets. i can wait as long as you need to help me. I just want to know if you recieved my ticket and i am really glad that you Porocles answeared. \n\nThank you so much.","replies":[{"poster":"Porocles","date":"2016-09-13T17:16:49.370+0000","up_votes":1,"down_votes":0,"body":"Rest easy, I've confirmed that your ticket was received!  It's been escalated to our account recovery team to help out.  You'll receive a response as soon as possible- just make sure not to keep replying to the ticket as it can actually bump you back to the bottom.  Patience is key here!","replies":[{"poster":"SlaWNibproo","date":"2016-09-13T17:20:12.946+0000","up_votes":1,"down_votes":0,"body":"I dont know how to thank you enoug sir. You really made my day a lot happier. Now i can acctually concentrate and do my work properly. Thank you soo much. \n\n´´We rise by lifting others``","replies":[]}]}]}]}]}]}]},{"poster":"VvVVvV","date":"2016-09-13T16:53:14.295+0000","up_votes":1,"down_votes":0,"body":"1st issue - Yes I am still able to eventually login and play. But it pops up even when I close the client or it crashes and i try to re-open it. maybe my cpu just doesnt realize its no longer open?\n\n2nd issue - No known 3rd party programs that i know of....at least none u listed. ive only installed micro soft office and other games on this computer.\n\n\n\ni understand that my issue may not be as important as others...its just annoying when they occur.","replies":[{"poster":"Porocles","date":"2016-09-13T17:07:47.762+0000","up_votes":1,"down_votes":0,"body":"Your issue is important to me, and I want you to get back into the game!  It sounds like you have a weird series or combination of issues that our Tech Team can look into with you.  I suggest grabbing some logs via our [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) and attaching them to a [support ticket](https://support.riotgames.com/hc/en-us/requests/new).  We'll look into this deeper and figure out what's going wrong!","replies":[]}]}]},{"poster":"SlaWNibproo","date":"2016-09-13T16:41:00.362+0000","up_votes":1,"down_votes":0,"body":"I have played this game in 2 years. No bro. that is not any problem. As long as you can run ´´league of legeds`` everything is fine. \n\n´´Another instance of the running. Do you want to determine it`` it usually happens whenever you open 2 league clients at the same time. I am not a riot remember or employe but i am here trying to help you. Mostly because it is kind and i like to help others but also because i have a problem aswell and i want to help others as fast as possible so riot has less people to help and therefore hopefully they have time to help me :)\n\nYours sincerely. A proud league of legend player","replies":[{"poster":"VvVVvV","date":"2016-09-13T16:53:57.883+0000","up_votes":1,"down_votes":0,"body":"Yes I understand. I appreciate any help. Also good luck with your problem u are having.","replies":[]}]}]}