{"poster":"PlaŹma","date":"2015-04-30T18:57:44.799+0000","title":"MKlol es legal??","subforum":"Charlas Generales","up_votes":3,"down_votes":5,"body":"Busque en el foro y solo por parte de usuarios se menciona que es ilegal. Los de RIOT una vez publicaron un post que decia que era ilegal por el timer de la jugla ya que te daba una ventaja sobre los otros jugadores. Ahora que el timer ya esta incluido sigue siendo ilegal??\r\n\r\nrespuestas serias pls.","replies":[{"poster":"Sir DaL","date":"2015-04-30T19:14:55.088+0000","up_votes":9,"down_votes":2,"body":"Hola wertyx,\nHace un tiempo anunciamos que si el programa cambia la experiencia de juego desde el momento en que presionamos \"jugar\" hasta que termina la partida, es algo que no es legal ya que esta violando nuestros terminos de uso\n\nEl caso de MK Lol o Mk jogo es justamente ese, no está permitido ya que modifica el juego y cambia la experiencia que uno tiene luego de presionar el botón \"jugar\"\n\nSaludos!!","replies":[{"poster":"Jonshi","date":"2015-04-30T22:54:55.725+0000","up_votes":1,"down_votes":0,"body":"Pero... se puede usar solo para grabar partidas? Porque a veces LoLReplay anda mal.","replies":[{"poster":"Jonshi","date":"2015-04-30T22:55:22.841+0000","up_votes":1,"down_votes":0,"body":"Y armar las condiciones de servicio para que MKLoL solo se use para grabar las partidas","replies":[]}]},{"poster":"ElnarkoReturn","date":"2015-09-18T16:18:25.368+0000","up_votes":1,"down_votes":2,"body":"RITO Y PARA CUANDO VAN A IMPLEMETAR LAS GRAVACIONES?","replies":[]},{"poster":"Desaroll","date":"2015-04-30T19:38:04.761+0000","up_votes":1,"down_votes":3,"body":"Gracias!\n\nRespuesta oficial para linkear :D\n\nSuerte!","replies":[]}]},{"poster":"Grafeno","date":"2015-04-30T19:13:45.341+0000","up_votes":1,"down_votes":3,"body":"loko  yo no los entiendo, si dijeron q es ilegal es ilegal y lo va a seguir siendo para siempre, no entiendo por que siguen preguntando..... dejen de preguntar es ilegal y punto les pusieron los contadores en el lol para que se dejen de usar esas cosas y siguen molestando por lo mismo, y apra que sepas no es ilegal por los timers, es ilegal porque es un programa externo que modifica lo que ves en el juego listo simplemente eso dejen de preguntar y de molestar con el tema","replies":[{"poster":"PlaŹma","date":"2015-05-06T22:58:06.042+0000","up_votes":1,"down_votes":0,"body":"espero que te calmes =). gracias los demas por su cortesia y respuesta!!","replies":[]}]},{"poster":"LygaNN","date":"2015-04-30T23:06:56.630+0000","up_votes":1,"down_votes":0,"body":"Yo tengo entendido que si es baneable al usar skin del MK, por que es como ''robar'' a Riot.\n\nYo no conozco bien ese programa pero a lo que entiendo es que quien lo usa puede usar las skins que quiera aunque no las vean sus compañeros.\nSi es así entonces si es baneable, porque Riot te deja jugar LOL gratis y para lo único que te cobran es si quieres aspectos (o iconos, aspectos de centinelas, etc...), al usar ese programa estás disfrutando de una skin que deberías haber pagado. Que las vea o no el enemigo o aliados no importa, al fin y al cabo tu compras las skin para que tu las disfrutes, no las compras para que las vea el enemigo que tanto odias xD (bueno quiza no lo odias tanto (8)","replies":[]},{"poster":"Runth","date":"2015-04-30T21:36:15.585+0000","up_votes":1,"down_votes":0,"body":"Nein, usa otro programa q este es demaciado inseguro y te afectara demaciado el cliente","replies":[]},{"poster":"Desaroll","date":"2015-04-30T19:14:22.305+0000","up_votes":1,"down_votes":3,"body":" No, no es legal.\n\nSuerte.","replies":[]}]}