{"poster":"PlaŹma","date":"2015-07-22T05:13:39.215+0000","title":"Hack RYZE","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"revise el video nuevamente, y este usuario usa el hack que sale aca, en esta pagina:\n\nhttps://www.nulled.io/\n\ncomo puedo denunciarlo? (por razones obvias no ponde el link del hack)\n\nlleva 22 W / 3 L en ranked\n\nel usuario es este:\n\nhttp://www.lolskill.net/summoner/LAS/kelpy/champions\n\naca el historial\n\nhttp://matchhistory.las.leagueoflegends.com/es/#match-history/LA2/1129913\n\n\ndejó la duda a todos al final... porque no nos quizo decir si era RTTC o Fun house el hack que usaba. solo decia \"soy bueno, asuman\"\n\nhttps://www.youtube.com/watch?t=37&v=-3KCDBhwFfw\n\ncon mas detalles, les explico abajo\n\nEn top estaba Ryze vs Cassio, cassio no pudo atinar ninguna Q sin embargo ryze atinaba todo, pense que era mala la casio, pero cuando fui con Nautilus JG a tomarlo, el era lvl 6 y yo lvl 5 full vida, puse el escudo y le pegue el gancho + smite rojo + e. le baje casi nada obviamente, el corria hasta que se activo el escudo pasivo de RYZE y ahi me tiro el combo y en 2 seg mori, full vida y con el escudo de Nautilus. le di la 3 kill, luego no habia como bajarlo porque deleteaba.\nEl segundo caso fue un alistar lvl 13, full vida y con ulti activado, el ryze tenia el escudo y de una Q le bajo toda la vida siendo este lvl 15.\nla ulti de alistar reduce un 70% el da&ntilde;o creo...\n\nLLeva una racha de victorias con ryze y me dijo que como se actualizaba hoy, se borrarian los hack.\n\nQue puedo hacer?","replies":[{"poster":"Exit","date":"2015-07-22T05:27:49.525+0000","up_votes":3,"down_votes":0,"body":"man dudo que hagan algo y mas poniendolo acá en el foro, hay 2 challengers que usan scripts y por mas reports que le tiremos no pasa nada asi que dudo que pase algo jaja suerte","replies":[{"poster":"PlaŹma","date":"2015-07-22T05:33:54.952+0000","up_votes":1,"down_votes":0,"body":"http://matchhistory.las.leagueoflegends.com/es/#match-history/LA2/1129913?champion=13&matchType=2\n\nla ultima partida es la que jugo contra mi, dejo de jugar porque le dije el nombre del hack, y que lo iba a denunciar. WASTED xD","replies":[]}]},{"poster":"SenpaiDeathx","date":"2015-07-22T05:53:48.883+0000","up_votes":1,"down_votes":4,"body":"Amigo no hay hack en todo el mundo que haga que les aumente el daño y los deletee, el scrip lo unico que hace es hacer los combos en caso de que el ryze estuviera usando y algunos tambn estan configurados para evadir habilidades. Tanto te dolió perder la partida si el tipo lo único que juega es ryze, que esperabas? que lo usara mal? :S","replies":[{"poster":"PlaŹma","date":"2015-07-22T05:59:51.956+0000","up_votes":1,"down_votes":0,"body":"mira su historial\n\nhttp://matchhistory.las.leagueoflegends.com/es/#match-history/LA2/1129913?champion=13&matchType=2\n\nbusca en partidas normales si jugo con ryze, todas las jugo hoy, y busque en internet y encontre el script que uso, en la pagina de arriba esta, solo hayq ue buscarlo. Solo revisa su historial con ryze.","replies":[{"poster":"SenpaiDeathx","date":"2015-07-22T06:29:11.618+0000","up_votes":1,"down_votes":1,"body":"lo único que se ve en su historial es que lleva jugando desde el viernes ryze sin para, porq tiene que extrañar tanto que salga alguien bueno xDD\n\nSi ryze esta tan roto no me extraña que gane tanto, por algo lo van a nerfear ahora xDD solo se aprovecho de lo roto que estaba creo :s\n\nEl tipo tiene 306 partidas en normal y platino 5, no has pensado que el debe tener otra cuenta principal tal vez challenger o diamante algo. O que tal vez esta eloboosteando ?","replies":[{"poster":"Tatsuya","date":"2015-07-22T14:55:58.416+0000","up_votes":2,"down_votes":0,"body":"la verdad sos un estupido.\n1) vez en su historial que a veces alterna el flash con la D y la F. señal que no es la unica persona que juega esa cuenta.\n2) su KDA con otros champs es malo, tirando a horrible.\n3) unico champ con el cual tiene un W/L ratio anormal es con el cual es sospechado el uso de script","replies":[]}]}]}]},{"poster":"HefferWolf","date":"2015-07-22T05:56:40.305+0000","up_votes":2,"down_votes":0,"body":"hola! soy el Varus de la partida.\n\nNecesitamos que se vea la replay, es evitente que el usaba un programa externo, en otras plataformas tales como reddit se han visto multiples jugadores haciendo uso ilegal de \"scripts\". Por lo que pude observar dentro de su comportamiento, este Ryze se comportaba como si usara el script que te deja esquivar las cosas (basta con buscar en youtube los videos), lo que caracteriza a este script es que te permite \"esquivar\" skillshots (en realidad solo te saca fuera del rango, pero no en la direccion mas inteligente, sino la más corta). En general es fácil de ver cuando alguien usa scrip porque se hacen unas movidas, realmente, super humanas.\n\nHay multiples antecedentes de ban a jugadores que han alterado el cliente en beneficio propio. Sé que es una acusación grave y por lo mismo requiere que se investigue a este personaje.\n\nEs realmente preocupante que haya gente que juegue ahora abusando de una alteración al cliente para sacar provecho y subir ranking. es Injusto y esta persona debe ser baneada.","replies":[]},{"poster":"sERmAIND","date":"2015-07-22T05:48:04.597+0000","up_votes":2,"down_votes":0,"body":"Yo estuve en esa partida y lo tuve en top lane. Una pena como ocupa scripts para ganar las partidas pero bueno...","replies":[]},{"poster":"GreppiM","date":"2015-07-22T16:41:17.876+0000","up_votes":1,"down_votes":1,"body":"1. No se puede publicar nombres en el foro, te lo van a cerrar si no.\n2. No es un hack, en todo caso es un script.\n3. Ni siquiera es tuyo ese vídeo.\n4. No prueba nada ese vídeo, no se nota mucha la diferencia de un Ryze normal.\n5. Mandalo al soporte, no lo publiques acá, no sirve que lo pongas acá.\n6. No existe un script que le de mas daño a un campeón, y con el único que tiene buen KDA y winrate es Ryze, porque usaría a Ryze entonces y no campeones como Cassio, Syndra?\n7. Este \"\"hack\"\" se activa JUSTO cuando se activa la pasiva de Ryze... Mucho no se puede hacer con lo que mostras y decís.\n7. Probablemente sea un elobooster o incluso varias personas jugando en esa cuenta.","replies":[{"poster":"PlaŹma","date":"2015-07-22T19:20:21.660+0000","up_votes":1,"down_votes":0,"body":"en mi ignorancia dije hack por no saber especificamente como llamarlo, pero ahora si se q es un script. durante los ultimos minutos de la partida, busque \"hack ryze\" y me meti en varias paginas, y encontre info del hack que habia salido el viernes pasado, y el 20 de julio se hizo la actualizacion 2.0 que solo serviria para antes de la otra actualizacion de LOL. Durante la partida (el final) les dije a todos en ALL que habia encontrado el hack o script, le puse el nombre de los 2 posibles que encontre y de ahi Ryze no hablo mas. Y curiosamente, no tiene mas partidas con ryze =). NO QUIERO RECUPERAR MIS LP, solo quiero que se le castigue por utilizar script o algo mas para sacar ventaja. Creo que es lo indicado o no?  si piensas que no, no creo que tengamos mas que hablar, a mi por lo menos me gusta el juego limpio.","replies":[]}]},{"poster":"Jash","date":"2015-07-22T07:19:03.770+0000","up_votes":1,"down_votes":0,"body":"pregunta:\nEse hacck sera de moda en ese campeón?\nporque me han tocado ryze en partidas  totalmente descuadrado. aun recuerdo uno que ni entre 3 campenes le quitamos algo de vida a el solo. de verdad que me dio para sospechar.","replies":[]},{"poster":"Tatsuya","date":"2015-07-22T06:53:01.541+0000","up_votes":1,"down_votes":0,"body":"usa script y esta en platino V rofl, que pete. con la cantidad de mancos que estan en platino V, incluyendome, y este necesita script para siquiera llegar ahi.","replies":[]},{"poster":"Kyousuke","date":"2015-07-22T05:29:19.997+0000","up_votes":1,"down_votes":0,"body":"bajate el fraps o algun otro programa y pone a grabar la filmacion de la partida","replies":[{"poster":"xmarcelo","date":"2015-07-22T06:39:52.575+0000","up_votes":1,"down_votes":0,"body":"pues yo recomiendo el plays.tv , no te gasta 3000 gb del disco duro por vídeo y te graba igual a 1080p :/  ademas de guardarte automáticamente toda la partida, te muestra los momentos en que salio una kill, assist, y los puedes cortar con el mismo programa para subirlos a youtube (y el mismo programa hace el render y lo sube)","replies":[]}]},{"poster":"PlaŹma","date":"2015-07-22T05:38:19.180+0000","up_votes":1,"down_votes":0,"body":"Lamentablemente, despues de las 2:30 queria grabar la partida, pero me tira error y no puedo revisarla.","replies":[]},{"poster":"PlaŹma","date":"2015-07-22T05:14:37.084+0000","up_votes":1,"down_votes":0,"body":"Tengo el video de la partida, pero como se actualiza, no podre reproducirlo mñn asi que estoy haciendo capturas de pantallas. y luego lo enviare a soporte.\n","replies":[]}]}