{"poster":"SickBananas","date":"2019-08-11T20:16:48.603+0000","title":"Das Spiel bleibt mitten im Spiel stehen","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich versuche es nochmal,da das Problem mich extrem nervt.\r\n\r\nDas Spiel hängt sich mitten im Game auf und kann nur durch einen kompletten neu start beim Pc behoben werden,da lol auf nix mehr reagiert.Es lässt sich nicht mehr schließen oder minimieren.\r\n\r\nMeine Treiber sind auf dem neusten stand und das Problem taucht bei kein einzigen Game auf.\r\nIch kann also stunden lang andere Spiele spielen,ohne das was passiert.\r\nIch habe die Fehlersuche auch durch führen lassen und das Spiel auch 2 mal schon deinstaliert.\r\nEr findet anscheinend auch keine Fehler.\r\n\r\nIch bin also extrem ratlos und hoffe das jemand mal das selbe Problem hatte.\r\nIch hoffe also,das mir jemand weiter helfen kann.Vorher hatte lol das Problem gehabt das es mitten bei der Champion auswahl nicht mehr weiter ging,das Problem ist aber seit 1 Woche oder länger behoben und jetzt ist das Problem aufgetaucht.\r\n\r\nWie gesagt:Treiber auf dem neusten stand und es passiert nur bei LoL.\r\n\r\n8 gb Grafikkarte \r\nI  5 Prozessor\r\n16 gb ram \r\n\r\n\r\nIch bedanke mich schonmal für hilfreiche versuche und informationen.","replies":[{"poster":"Asasél","date":"2019-08-11T22:03:00.450+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nich hatte das selbe Problem. Da ich aber schon mehr mals den Support dieses Spiels versucht habe zu erreichen (Was immer mindestens 8 Stunden dauerte), habe ich mich selber versucht zu informieren und zu kümmern. \n\nLeider vorerst erfolglos...\n\nAls dann nach langen gewarte  auf Gutefrage.net einer mir eine ziemlich symple und irgendwie logische Antwort gab, konnte ich mein problem lösen...\n\nRepatch dein Game einfach mit dem Hextech-Repair-Tool...\n\nIch habe keine Ahnung was sie so oft beim patchen  verkacken, aber es scheint bei RIOT Standart zu sein und der repatch hilft unerwartet tatsächlich gut.\n\nMittlerweile repatche ich jede Woche und habe seit dem mit dem Game-Client keine Probleme mehr.\n\nLG Asasél\n\nPS: Ich weiß das du es bereits getestet hast... versuche es aber einfach nochmal und setze bei jeder test und repair möglichkeit einen Kaken.\n\nPPS: idk warum deinstallieren nicht so gut hilft wie das Hextech Reapir-Tool... RIOT eben...\n\nRepair-Tool: https://support.riotgames.com/hc/de/articles/224826367-Automatisierte-Fehlerbehebung-Hextech-Repair-Tool","replies":[{"poster":"SickBananas","date":"2019-08-12T08:22:32.238+0000","up_votes":1,"down_votes":0,"body":"Habe lol jetzt über mein AMD Programm laufen,der alles einstellt damit es wieder klappt,seit dem habe ich keine Probleme mehr.Aber erstmal abwarten und das Programm hatte mir nicht geholfen gehabt leider","replies":[{"poster":"Asasél","date":"2019-08-12T20:07:27.513+0000","up_votes":1,"down_votes":0,"body":"Okay dann wünsche ich dir noch Viel Glück und Spaß :D","replies":[{"poster":"SickBananas","date":"2019-08-13T16:58:49.173+0000","up_votes":1,"down_votes":0,"body":"fängt wieder an,lief öfters mal wieder gut und jetzt fängt es wieder an","replies":[{"poster":"Asasél","date":"2019-08-18T18:26:24.798+0000","up_votes":1,"down_votes":0,"body":"Das tut mir leid :/","replies":[]}]}]}]}]},{"poster":"astrofan","date":"2019-08-11T21:12:59.822+0000","up_votes":1,"down_votes":0,"body":"Also außer an den Support schreiben fällt mir da ehrlich nichts ein, da du ja schon alles gemacht hast was ich sonst vorgeschlagen hätte. Weil die Hardware ist mehr als genug um LoL laufen zu lassen.","replies":[{"poster":"SickBananas","date":"2019-08-11T21:26:56.532+0000","up_votes":1,"down_votes":0,"body":"trotzdem danke ^^","replies":[]}]}]}