{"poster":"benstone326","date":"2014-04-23T13:34:32.327+0000","title":"Hivatalos HUNlap","subforum":"Hibabejelentés","up_votes":1,"down_votes":0,"body":"Hali!\r\nTudom, hogy mindenki nagyon elvan havazva, meg elvileg csak BÉTA a dolog, de felnéztem a hivatalos magyar honlapra eune.leagueoflegends.com/hu, és azt vettem észre, hogy az ingyen játszható hősök listája a múlt heti, valamint a leértékelt hősök és skinek is péntekiek.\r\nLátom, hogy az emberibb botok cikk is csak 8 órája került fel, holott a RITO már múlt héten megírta, ebből gondolom, hogy a feltöltések folyamatban vannak.\r\nSzép napot mindenkinek!\r\n\r\n*Ezt a cikket PBE fórumon tettem közzé tegnap, csak ide irányítottak át.","replies":[{"poster":"iSPZ","date":"2014-04-23T13:41:02.158+0000","up_votes":1,"down_votes":0,"body":"Köszönjük az észrevételt, az oldalon már elérhetőek ezek az információk! [Heti ingyenes hősök](http://eune.leagueoflegends.com/hu/news/champions-skins/free-rotation/uj-heti-ingyenes-hosok-ashe-master-yi-pantheon-es-sokan-masok), [Akciós hősök és kinézetek 04.22 - 04.25](http://eune.leagueoflegends.com/hu/news/store/sales/akcios-hosok-es-kinezetek-0422-0425)!","replies":[{"poster":"benstone326","date":"2014-04-23T13:44:06.158+0000","up_votes":1,"down_votes":0,"body":"Csak főoldalon kicsit megtévesztő, hogy a múlt heti hősök vannak felül, tehát olyan, mintha azok lennének a frissek. Skinekből meg az újak nem szerepelnek a főoldalon, csak erre szerettem volna felhívni a figyelmeteket :)","replies":[{"poster":"iSPZ","date":"2014-04-23T13:52:32.628+0000","up_votes":1,"down_votes":0,"body":"Tisztában vagyunk vele, csak a témák már hamarabb létre lettek hozva, mint megnyitva az oldal, és azok a posztok össze keveredtek. De mostmár sorban jönnek!","replies":[{"poster":"benstone326","date":"2014-04-26T17:16:04.889+0000","up_votes":1,"down_votes":0,"body":"\"MOST RECENT NEWS\" , \"VIEW ALL NEWS\" - honlapon nem magyarul szerepelnek.","replies":[]}]}]}]},{"poster":"Dilneor","date":"2014-04-24T11:53:23.235+0000","up_votes":1,"down_votes":0,"body":"Hali!\nHa még nem küldte volna el valaki, lehet én vagyok a béna...de az oldalon találtam egy hibát ( amit lehet csak én vélek annak ):\nhttp://viewingparties.eune.leagueoflegends.com/hu/","replies":[{"poster":"iSPZ","date":"2014-04-24T11:54:56.411+0000","up_votes":1,"down_votes":0,"body":"Köszönjük a jelentést, az oldal folyamatosan frissül és töltődik fel a tartalmakkal!","replies":[]}]},{"poster":"DannyT","date":"2014-04-23T13:42:31.255+0000","up_votes":1,"down_votes":0,"body":"Üdv! :)\n\nÍgy van, a cikkek folyamatosan kerülnek majd fel a hivatalos magyar oldalra.\n\nHa rögtön, az angol cikk megjelenésének pillanatában nem találjátok azt a magyar oldalon, magyarul, nem kell pánikolni, hamarosan meg fog jelenni. ;)\n\nA fejlesztőknek most gondolhatjátok, hogy a megjelenés miatt mennyi teendőjük van. De igyekszenek mindegyiknek eleget tenni. ;)","replies":[]}]}