{"poster":"kosmoka","date":"2017-03-04T10:59:01.507+0000","title":"Platin adc sucht team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"moin was ich suche steht ja schon da bin Platin 4 main adc k&ouml;nnte zu not auch jungle. bei fragen oder interesse einfach adden ; Kosmoka","replies":[{"poster":"Randleq","date":"2017-03-04T11:53:59.622+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nwir sind ein Clan von ca. 40 Leuten welcher momentan 6 Teams stellt, die in Zukunft in einer Art Ligasystem\n(ähnlich der Fußball-Bundesliga) gegeneinander trainieren wollen. Auch sind in jedem Team feste wöchentliche Trainingszeiten\ngesetzt und Turniere werden von Zeit zu Zeit auch angepeilt. Unser erstes Team sucht wieder einen kritikfähigen, soliden ADC\nwelcher sich an das Team bindet und verlässlich ist. Falls du Interesse an uns hast, adde mich doch bei LoL. Unser nächstes gemeinsames\nTraining ist am Sonntag Abend um 20 Uhr, dort können wir dich - falls du Lust hast - willkommen heißen ;)\n\nDas Niveau unseres Teams ist momentan im unteren Gold-Bereich angesiedelt, allerdings vertreten wir die Meinung, dass die ELO\nnicht das einzig entscheidene ist und wir uns von Zeit zu Zeit auch so verbessern können.\n\nWas wir bieten:\n+ eigener TS mit Rollen- und ELO-Verteilung\n+ eine WhatsApp-Gruppe voller aktiver Mitglieder mit denen man das eine oder andere DuoQ machen kann\n+ eine Leitung, welche ständig neue Ideen aufbringt um die Zeit im Clan für alle kreativ zu gestalten\n+ ehrgeizige Teams welche nicht perfekt sind, jedoch Ziele anstreben und diese auch gemeinsam erreichen\n\n{{sticker:slayer-pantheon-thumbs}} \n\nLiebe Grüße!","replies":[]},{"poster":"Gravost","date":"2017-03-04T11:10:52.730+0000","up_votes":1,"down_votes":0,"body":"Moin, \nwir erstellen regelmäßig Teams und haben inzwischen 16 Teams zwischen Bronze und Master auf unserem Server.\n\nKlar könnte ich dich adden, aber das zeigt mir, dass du 1. aktiv im Forum nach Antwort schaust und dich sozusagen wirklich dafür interessierst und 2. ich die Menschen dazu bringe, Initiative zu zeigen.\n\nWenn du Interesse hast, adde Gravost - du erhälst dann Zugriff auf den TS. :) Ich brauche dann FlexQ-Elo von dir, da das Team in der FlexQ spielt und deine Position. \n\nLiebe Grüße","replies":[]}]}