{"poster":"WatashiOrzo","date":"2018-05-05T13:57:53.569+0000","title":"Volto della Montagna... scomparso per sempre?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Oggi creo questa discussione riguardo ad un oggetto per me (main Thresh) molto importante: il Volto della Montagna.\r\nNon credete anche voi che dovrebbe essere rimesso? Secondo me s&igrave;, e non solo per Thresh, anche per un fatto di dimestichezza.\r\n{{sticker:sg-ezreal}} \r\n\r\nDitemi che ne pensate, rispondendo nei commenti e ancche votando {{champion:412}}  :D","replies":[{"poster":"Darkinknight","date":"2018-05-05T15:24:05.791+0000","up_votes":2,"down_votes":0,"body":"Probabilmente no. Hanno capito che la league of shield non è cosi divertente","replies":[]},{"poster":"Ser Nalor","date":"2018-05-05T14:47:51.751+0000","up_votes":1,"down_votes":0,"body":"Se non ho capito male è stato \"pianificato\" un rientro delle attive di quelli che erano gli oggetti da support ma in altri item a sé stanti, vedi le ombre gemelle {{item:3905}} con la attiva (i fantasmini) del vecchio oggetti support AP, vedi lo shurelia {{item:2065}} con la attiva (la speed ad area) del vecchio oggetto support linea moneta antica\n\nSicuramente metteranno in futuro un qualche altro item con la vecchia attiva di volto della montagna, ovvero lo scudo a single target (che ottiene anche chi attiva l'oggetto) e che rallenta gli avversari circostanti alla sua esplosione","replies":[{"poster":"Anubis Raven","date":"2018-05-07T08:30:06.855+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ser Nalor,realm=EUW,application-id=MJVj50Jw,discussion-id=xoWB6ljM,comment-id=0000,timestamp=2018-05-05T14:47:51.751+0000)\n>\n> Se non ho capito male è stato &quot;pianificato&quot; un rientro delle attive di quelli che erano gli oggetti da support ma in altri item a sé stanti, vedi le ombre gemelle {{item:3905}} con la attiva (i fantasmini) del vecchio oggetti support AP, vedi lo shurelia {{item:2065}} con la attiva (la speed ad area) del vecchio oggetto support linea moneta antica\n> \n> Sicuramente metteranno in futuro un qualche altro item con la vecchia attiva di volto della montagna, ovvero lo scudo a single target (che ottiene anche chi attiva l&#x27;oggetto) e che rallenta gli avversari circostanti alla sua esplosione\n\nin realtà hanno detto che il volto della montagna era noioso insieme alla combinazione con {{item:3190}} e anche questo da solo è stato nerfato. hanno detto che i shield in league of legends erano una meccanica troppo abusata dai tank support e quindi niente volto della montagna ci si accontenta con {{item:3190}}","replies":[]}]}]}