{"poster":"SirReggae","date":"2016-08-01T13:38:55.335+0000","title":"Mouse Binding Probleme","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hi Community.\r\n\r\nIch habe ein Gro&szlig;es Problem und hoffe hier schlaue leute zu finden die mir helfen k&ouml;nnen.\r\nVor ca. 2 jahren habe ich Attack move click auf den linksklick meiner maus gebindet um meine adc skills zu verbessern. Jetzt, nach neuinstallation, ist dieses Binding weg und die bindings generell durcheinander. So muss ich jetzt die Mittlere maustaste f&uuml;r normales klicken benutzen und kann auch nichtmehr mit ihr scrollen.\r\nNun bin ich ja nicht doof und dachte mir &quot;geh ich eifnach in die config.cfg rein und stell das wieder auf normal&quot;.\r\nDas habe ich gemacht, aber es hatte keinen effekt. Ich habs 10 mal ge&auml;ndert aber es passiert einfahc nichts. Um ehrlich zu sein kann ich die config &auml;ndern wie ich will und es &auml;ndert nichts :S\r\nDeswegen ist wohl die frage: wo finde ich die Config, mit der das spiel tats&auml;chlich arbeitet. Weil die im LoL ordner ist es offenbar nicht :(\r\n\r\ndanke schonmal f&uuml;r die hilfe.\r\nmfg\r\nSirReggae","replies":[{"poster":"Sree","date":"2016-08-01T14:27:10.125+0000","up_votes":1,"down_votes":0,"body":"Die Einstellungen werden beim Start des Spiels vom Server geladen, wodurch deine lokalen Aenderungen wieder ueberschrieben werden. So hat dein Account an jedem Rechner die gleichen Einstellungen.\n\nWenn du sie manuell veraendern willst, schau mal [hier](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/X3waeihA-wrenchmens-toolbox-lasungen-zu-bekannten-problemen-und-fehlern?comment=0001) unter der Ueberschrift **Änderungen an den Spieleinstellungen manuell vornehmen**.","replies":[{"poster":"SirReggae","date":"2016-08-01T15:22:14.350+0000","up_votes":1,"down_votes":0,"body":"RIESENDANK!!!\nIch hoffe du hast eine vorstellung davon wie dankbar ich dir bin.\nSoo ein schönes gefühlt endlich wieder normal den linksklick zu benutzen ^^ HUGE thx!!","replies":[]}]},{"poster":"Homunculi","date":"2016-08-01T13:42:14.906+0000","up_votes":1,"down_votes":0,"body":"Schon in einem Bot Game über die \"Optionen\" versucht?\n\nEvtl. ist die Config.cfg Schreibgeschützt?","replies":[{"poster":"SirReggae","date":"2016-08-01T14:23:19.055+0000","up_votes":1,"down_votes":0,"body":"in den optionen kann man maustasten nicht verändern, vorallem nicht den normalen linksklick.\n\nne config.cfg hab ich nichtmal direkt, nur ne input.ini und ne game.cfg. \nSowohl das reinschreiben in diese brachte keine änderung als auch das erstellen einer config.cfg in der die richtigen bindings stehen :(","replies":[]}]}]}