{"poster":"J Lancer","date":"2018-04-29T00:05:13.614+0000","title":"Hola en LAN esta phohibido decir VENECO = BAN DE 15 DIAS","subforum":"Charlas Generales","up_votes":5,"down_votes":9,"body":"un rioter de LAN, el cual debe ser venezolano, me suspendi&oacute; dos semanas por decir VENECO - _**EN EL FORO SI SE&Ntilde;ORES EN EL FORO**_, NO LO DIJE DENTRO DEL JUEGO.. A mi me dicen PERUCA en LAN Y LAS. Nunca escuche el baneeo de un Chileno, Colombiano, argentino,etc. Los argentinos le dicen chilitos a los chilenos y ellos les dicen Nargentinos y no he visto BANEOS en los foros de LAS. Por favor sabemos lo que esta pasando Venezuela pero por decir VENECO no pueden banearme dos semanas. Si aplicamos la misma regla para todos MEDIO SERVER DE LAS Y LAN estaria baneado.\n\nSolo queria descargar mi testmonio ya que en LAN estan baneando en **FOROS Y JUEGO **por decir solo = VENECO.\n\nhttps://imgur.com/ERzDTqE","replies":[{"poster":"ZanahoriaAsesina","date":"2018-04-29T00:08:20.505+0000","up_votes":2,"down_votes":0,"body":"¿Y cuando ingresas al cliente y al foro que te aparece?¿Tenes alguna captura?","replies":[{"poster":"J Lancer","date":"2018-04-29T00:11:29.734+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZanahoriaAsesina,realm=LAS,application-id=v7qsfXsE,discussion-id=FAwbakrE,comment-id=0000,timestamp=2018-04-29T00:08:20.505+0000)\n>\n> ¿Y cuando ingresas al cliente y al foro que te aparece?\n\nbaneado por 15 dias en el cliente por decir VENECO  en los FOROS,  nunca fue en el juego.","replies":[{"poster":"ZanahoriaAsesina","date":"2018-04-29T00:14:41.469+0000","up_votes":3,"down_votes":0,"body":"Desconozco que tan seguido son las sanciones en el foro de LAN ni tampoco se como se maneja la moderación pero esto es lo que dicen sus reglas:\n\n\n> #\"La regla de oro\" \n> \n> El mayor requisito para poder convivir en el foro de la región, es el respeto, y ese respeto debe ser para todos por igual. Respeta a **los demás jugadores de la comunidad, a los moderadores y a los rioters.** Todos estamos aquí para pasarla bien, haciendo y jugando lo que amamos, por lo que es necesario que se respeten a los individuos que forman parte de esta, nuestra región. Es importante ser seguidor del sentido común.\n\n> **No seremos tolerantes con el mal comportamiento.** Aquellas personas que insulten, acosen y/o degraden a los demás jugadores, moderadores y/o rioters verán sanciones en el foro, o incluso, sanciones que puedan ser escaladas en el juego. **\"Estar jugando\"** no es una excusa en cuánto a lo que el comportamiento se refiere.","replies":[{"poster":"J Lancer","date":"2018-04-29T00:17:43.778+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=ZanahoriaAsesina,realm=LAS,application-id=v7qsfXsE,discussion-id=FAwbakrE,comment-id=000000000000,timestamp=2018-04-29T00:14:41.469+0000)\n>\n> Desconozco que tan seguido son las sanciones en el foro de LAN ni tampoco se como se maneja la moderación pero esto es lo que dicen sus reglas:\n\nHermano si vamos netamente al significado de la palabra VENECO = HIJO DE COLOMBIANO Y VENEZOLANO. Peruca que significa ? chilito que significa, yorugua que significa?. Eso claramente no tiene significado y es ofensivo.  has escuchado alguien baneado por decir PERUCA, NARGENTINO,ETC. Yo nunca y he visto en temas que se matan con esos peyorativos.  Acaso LAN Y LAS son tan diferentes ?","replies":[{"poster":"ZanahoriaAsesina","date":"2018-04-29T00:45:07.627+0000","up_votes":2,"down_votes":0,"body":"Cada servidor tiene su propia moderación, así que las reglas y las sanciones aplicadas pueden variar.\n\nLo único que sé es que son términos despectivos, a mí entender, pero repito, no se como sancionan allá, así que es difícil determinar si fue o no injusto.\n\nLa veo un poco rebuscada pero no se puede hacer mucho desde acá.\n\nDeberías reclamar con el Soporte de LAN.","replies":[{"poster":"J Lancer","date":"2018-04-29T00:59:30.344+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZanahoriaAsesina,realm=LAS,application-id=v7qsfXsE,discussion-id=FAwbakrE,comment-id=00000000000000000000,timestamp=2018-04-29T00:45:07.627+0000)\n>\n> Cada servidor tiene su propia moderación, así que las reglas y las sanciones aplicadas pueden variar.\n> \n> Lo único que sé es que son términos despectivos, a mí entender, pero repito, no se como sancionan allá, así que es difícil determinar si fue o no injusto.\n> \n> La veo un poco rebuscada pero no se puede hacer mucho desde acá.\n> \n> Deberías reclamar con el Soporte de LAN.\n\nHermano pero el soporte de LAN no me ayuda para nada. ACASO RIOT **no es una multinacional y las reglas y JUSTICIA es igual para todos? ** Ni me han contestado. Apelando a tu juicio y sinceridad si nos ponemos a buscar ahora mismo en el foro palabras como chilito, peruca, nargentino cuantas personas deberiamos banear ? o deberias banear?\n\nhttps://imgur.com/vzuvYUE","replies":[{"poster":"ZanahoriaAsesina","date":"2018-04-29T03:05:35.926+0000","up_votes":1,"down_votes":0,"body":"Tardan en contestar, de vuelta, no se como se manejan allá, probablemente tarden uno o dos días.\n\nComo te dije antes, cada servidor tiene distintas reglas, si estas usando el foro de LAN, tenes que atenerte a las reglas de LAN.\n\n> Apelando a tu juicio y sinceridad si nos ponemos a buscar ahora mismo en el foro palabras como chilito, peruca, nargentino cuantas personas deberiamos banear ? o deberias banear?\n\nNo lo sé, supongo que muy pocas.\n\nEse tipo de comentarios dentro del juego se castigan con dos semanas de suspensión, realmente no estoy al tanto de casos del foro escalados al juego en LAS.","replies":[{"poster":"J Lancer","date":"2018-04-29T03:49:00.892+0000","up_votes":1,"down_votes":0,"body":"Amigo, estas equivocado. Trabaje en dos multinacionales con matriz en FRANCIA. Siempre las reglas(rules) son iguales en todos los paises no pueden cambiar de pais o region. Las reglas de las y lan, que estan casi juntas, no deben cambiar. No pueden banear usuarios por que le ofendio o tuvo ganas de banear. Yo se que la mayoria de aca son adolescentes o pèrsonas que no conocen sus derechos. Pero a mi que he trabajado en multinaciones y me suceda esto y riot que parece una empresa seria. ME PARECE SER que me quieren tomar de estupido no me importa el ban sea de 15 o un mes. Voy al hecho de que ellos piensan que UNO/YO/Nosotros somos idiotas. Y SI es un juego pero tus razones/convicciones se aplican en todo momento. Como bien dices tu del foro al juego, ban de 15 dias ?. Escucho que soy el primero. seria bueno que le comentes esto a un rioter de tu confianza. Como vuelvo a reperitr aqui leemos y en el juego y no me dejas mentir - nargentino, naringones, chilotes, chilitos, yorugua, provincia rebelde, bolita, peruca, etc, etc. hay bans? NO.","replies":[{"poster":"ZanahoriaAsesina","date":"2018-04-29T05:48:50.931+0000","up_votes":1,"down_votes":0,"body":"Tenes razón, me equivoque, tanto en el foro de LAS como en el foro de LAS, las reglas dicen que **los castigos pueden escalar a una sanción en el juego.**\n\nLo único que puede variar es la moderación y el criterio que usen al aplicar sanciones.\n\nAlgo aclarar, en ningún momento dije que fueras el único, dije que **desconozco** casos similares en LAS, repito, LAS.\n\nTu sanción viene de LAN, no sé cómo ni porqué tu castigo escalo al juego ni tampoco sé si hubo casos de este estilo en LAN.\n\n>  Como vuelvo a reperitr aqui leemos y en el juego y no me dejas mentir - nargentino, naringones, chilotes, chilitos, yorugua, provincia rebelde, bolita, peruca, etc, etc. hay bans? NO.\n\nSi. \nLos comentarios de este tipo, **en el juego**, son dignos de una suspensión de dos semanas, esto es un hecho.\n\nCon respecto a las sanciones en el foro, desconozco, ya lo dije.\n\n----\n\nVas a tener que esperar a que contesten tu solicitud, no hay de otra, lo lamento.\n\nCabe aclarar que fuiste bastante desagradable con tu comentario, así que veo difícil que las cosas terminen bien pero bueno... suerte.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"bombastico","date":"2018-04-29T00:35:39.082+0000","up_votes":2,"down_votes":0,"body":"Pero este es el foro de LAS, difícil que te resuelvan algo aquí.","replies":[{"poster":"J Lancer","date":"2018-04-29T00:55:38.617+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=bombastico,realm=LAS,application-id=v7qsfXsE,discussion-id=FAwbakrE,comment-id=0001,timestamp=2018-04-29T00:35:39.082+0000)\n>\n> Pero este es el foro de LAS, difícil que te resuelvan algo aquí.\n\nCORRECTO, pero en LAN nadie me ayuda hermano. Me banearon y ya. ni siquiera a hay una razon de mi baneo en el server. Por eso he tenido que venir a la comunidad de LAS que son casi hermanas","replies":[]}]},{"poster":"Naxo Brewmaster","date":"2018-04-29T01:13:55.144+0000","up_votes":2,"down_votes":1,"body":"A mi cuando me dicen chilito o Chilote no me molesta (a los de la Isla de Chiloe en Chile se les dice asi), quizas el rioter se sintio ofendido por un simple gg o un izi. Re ardido y solo por tener poder te  baneo.","replies":[]},{"poster":"Yoen","date":"2018-04-29T00:53:59.149+0000","up_votes":1,"down_votes":0,"body":"Hola\n\nPero esto es el foro de LAS, aquí no comprendemos\ncomo se hablan coloquialmente en los países de LAN,\n\nLa sanción esta bien aplicada, porque primero, la palabra\nque usaste, según dices que no es ofensivo, estas equivocado,\neso no depende de tí, sino como lo interpretan los demás,\nsi usas palabras, apodos, personificaciones para referirte a alguien,\nese alguien puede tomarlo a mal y es una posibilidad.\nAntes esa posibilidad pueden denunciarte si es el caso.\nLo ideal es llamarlo por su nombre de invocador y no lo que se\nte ocurra.\n\nDebes darte cuenta que todos los comentarios está la opción de \"denunciar\"\neso significa que cualquiera puede usar esto, en el caso que se sienta ofendido\npor una palabra no apropiada para referirse alguien o a quienes.\n\nSi banean a gente de acá por referirse a una nacionalidad con palabras\nno apropiadas y con el fin de burlarse.\n\n\nEspero que lo entiendas y cambies tu postura\n\nSuerte","replies":[{"poster":"J Lancer","date":"2018-04-29T01:04:54.584+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Yoen,realm=LAS,application-id=v7qsfXsE,discussion-id=FAwbakrE,comment-id=0003,timestamp=2018-04-29T00:53:59.149+0000)\n>\n> Hola\n> \n> Pero esto es el foro de LAS, aquí no comprendemos\n> como se hablan coloquialmente en los países de LAN,\n> \n> La sanción esta bien aplicada, porque primero, la palabra\n> que usaste, según dices que no es ofensivo, estas equivocado,\n> eso no depende de tí, sino como lo interpretan los demás,\n> si usas palabras, apodos, personificaciones para referirte a alguien,\n> ese alguien puede tomarlo a mal y es una posibilidad.\n> Antes esa posibilidad pueden denunciarte si es el caso.\n> Lo ideal es llamarlo por su nombre de invocador y no lo que se\n> te ocurra.\n> \n> Debes darte cuenta que todos los comentarios está la opción de &quot;denunciar&quot;\n> eso significa que cualquiera puede usar esto, en el caso que se sienta ofendido\n> por una palabra no apropiada para referirse alguien o a quienes.\n> \n> Si banean a gente de acá por referirse a una nacionalidad con palabras\n> no apropiadas y con el fin de burlarse.\n> \n> \n> Espero que lo entiendas y cambies tu postura\n> \n> Suerte\n\nEXACTO, Depende de quien lo lea. Aquel rioter venezolano lo noto ofensivo y listo me baneo. Que pasaba si el rioter era peruano o argentino, chileno,etc. Sabes? No pasaba nada. Deberia ser como la justicia. Deberia poder cambiarse el JUEZ O RIOTER y que verifique mi caso. Es correcto es un juego pero yo voy al hecho de que banean por banear y de una manera dictatorial y sin RAZON NO HAY UNA RAZON DE MI BANEO SOLO DECIR VENECO, ??  https://imgur.com/vzuvYUE","replies":[{"poster":"Yoen","date":"2018-04-29T01:11:16.288+0000","up_votes":2,"down_votes":1,"body":"No me entendiste :d\nEl ban esta bien puesto\nEl rioter hizo lo correcto, la nacionalidad del rioter no tiene que ver.\n\nSi quieres referirte a alguien o a  quien sea,** llámalo por su nombre**\nno digas palabras informales o jergas.\n\nPorque si lo llamas por su nacionalidad con palabras así, la\n**persona puede sentirse ofendida y está en su derecho denunciarte,\ny  te sancionarán por eso.**\n\nEspero que me entiendas\n\nSuerte","replies":[]},{"poster":"Yoen","date":"2018-04-29T01:21:28.903+0000","up_votes":1,"down_votes":0,"body":"Ahora que veo, el foro no tiene nada que ver con el juego,\n\nrevisa tu e mail asociado a tu cuenta de LoL, ahí te\ndarán las razones porqué te banearon en el juego.\n\nAhora en el foro, ya estas bien baneado.\n\n\nBuenas Noches","replies":[{"poster":"J Lancer","date":"2018-04-29T01:34:05.781+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Yoen,realm=LAS,application-id=v7qsfXsE,discussion-id=FAwbakrE,comment-id=000300000001,timestamp=2018-04-29T01:21:28.903+0000)\n>\n> Ahora que veo, el foro no tiene nada que ver con el juego,\n> \n> revisa tu e mail asociado a tu cuenta de LoL, ahí te\n> darán las razones porqué te banearon en el juego.\n> \n> Ahora en el foro, ya estas bien baneado.\n> \n> \n> Buenas Noches\n\nhttps://imgur.com/K8fdiCF\n\nesas son las razones de mi baneo","replies":[{"poster":"Yoen","date":"2018-04-29T01:41:12.333+0000","up_votes":1,"down_votes":0,"body":"Solo te queda enviar una petición a soporte,\ntendrás que esperar, porque no responden inmediatamente.\nAsí que paciencia.\n\nEs extraño lo que te sucedió. aunque creo que no es necesario \nsacar conclusiones deliberadamente, o decir que te banearon por decir esto \ny por lo otro :p\n\nLo siento \nBuenas Noches","replies":[]}]}]}]}]},{"poster":"DIOS TUTI","date":"2018-04-29T03:52:33.312+0000","up_votes":1,"down_votes":0,"body":"esta bien el baneo papu, a llorar a otro lado","replies":[]},{"poster":"Errør 404","date":"2018-04-29T02:17:08.804+0000","up_votes":1,"down_votes":0,"body":"Yo soy Argentino y es la primera vez en la vida que escucho lo de \"Nargentino\" ¿por qué la N? ¿que significa? Por fuera de eso, jamás vi a nadie decirle a un chileno \"chilito\".\n\nRespecto a tu comentario, no solo demuestra actitud negativa (por lo de dejen de jugar lol) sino también xenofobia. Para mi el baneo que te dieron es justo.","replies":[{"poster":"Vi Sexual","date":"2018-04-29T02:52:43.905+0000","up_votes":1,"down_votes":0,"body":"Nargentino por la nariz, esta ese \"estereotipo\" de que los argentinos tenemos la nariz grande.","replies":[]}]},{"poster":"J Lancer","date":"2018-04-29T01:35:32.439+0000","up_votes":1,"down_votes":2,"body":"fue un ban dictatorial \n\nhttps://imgur.com/K8fdiCF","replies":[]}]}