{"poster":"Krustentier","date":"2016-01-26T14:38:24.198+0000","title":"2x chat bann ohne wirklichen Grund","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":3,"body":"Hey Leute,\r\n\r\nIch habe heute ein Chat Bann bekommen, f&uuml;r naja PillePalle. Schon den ersten den ich bekam war total l&auml;cherlich, aber da wollte ich nichts sagen, weil da 4 S&auml;tze waren, die eigentlich unn&ouml;tig waren.\r\nAber jetzt bekomme ich ein Bann, weil ein Lucian, unsere Ahri flamt wie sonst was, werde hier den Verlauf mit rein packen, und gebe nat&uuml;rlich zu das ich auch etwas weniger h&auml;tte schreiben k&ouml;nnen, aber der Lucian ging ein sowas auf den Sack....\r\nW&uuml;rde gerne wissen ob es sich lohnt den Support zu schreiben ?\r\n\r\n~~~~~~~~~~~~~~~~~~~~~\r\nnever saw that cait skin before\r\n4\r\nok ^^\r\ni saw it\r\nred&gt;top\r\nminimap dude\r\nahri man\r\nyour lb is roam 2477\r\nand u come to late and dont push tower again\r\nu follow dude\r\ndont flame other if u die\r\nreport that lucian for flame 24/7 pls\r\nreports just check chat history\r\ni dont flame ;)\r\nthat we are idiots they are3 premades and report everyone and he think we get bann them xdD\r\ngp ult is broken :D 0 cd\r\ngj gnar\r\nleona and lb no ignite\r\ncold kill u but thought u are lb cait xd\r\nahri can u hit 1 charmed &szlig;\r\n?\r\nxD\r\nThat silver kiddies always :D\r\nyeah platin on 2 accounts easy\r\nand then a silver kid that flame cause school is over xD\r\nHAHAHAHAHAHAHAHAHA THAT LUCIAN ULT XDDDD\r\nhmm good call\r\ndude i am not a tank\r\nthey focus me while i am zhonya and u guys stand there and attack leona\r\ndude its a normal :D\r\nif i want play serious i go normal\r\nidc your report xD\r\ngj leona that focus on me is great :)\r\nwould be more fun game would that lucian not flame all time xD\r\n~~~~~~~~~~~~~~~~~~~~~","replies":[{"poster":"Parunpata","date":"2016-01-26T14:41:43.158+0000","up_votes":4,"down_votes":0,"body":"Hey, das ist wirklich eher harmlos, aber trotzdem verdient.\n\nVersuch dir einfach selber beizubringen, nicht mehr so viel zu schreiben. Wenn jemand flamed, dann lass ihn flamen. Nicht darauf antworten. Im Prinzip schreibst du ja auch gute Sachen. Musst nur noch die kleinen Seitenhiebe sein lassen. (Und die Reportaufrufe)\n\nDu kannst dem Support gerne schreiben, aber zu 99,9% nehmen die sowas nicht zurück. Also akzeptier es einfach und versuch dich zu bessern.\n\nVollständigkeitshalber die Sachen, die meiner Meinung nach nicht sein müssten:\n> \n> report that lucian for flame 24/7 pls\n> reports just check chat history\n> That silver kiddies always :D\n> and then a silver kid that flame cause school is over xD\n> HAHAHAHAHAHAHAHAHA THAT LUCIAN ULT XDDDD","replies":[{"poster":"Sirrkas","date":"2016-01-26T14:57:41.383+0000","up_votes":2,"down_votes":0,"body":"Das würde ich auch beanstanden. Und vom TE wüsste ich gerne, was dieser Abschnitt bedeuten soll:\n\n>that we are idiots they are3 premades and report everyone and he think we get bann them","replies":[{"poster":"Krustentier","date":"2016-01-26T15:01:41.791+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=Ei0tUzrV,comment-id=00000000,timestamp=2016-01-26T14:57:41.383+0000)\n>\n> Das würde ich auch beanstanden. Und vom TE wüsste ich gerne, was dieser Abschnitt bedeuten soll:\n\nLeona fragte mich warum wir wollen das LUCIAN reportet wird, was  er denn so sagt da habe ich ihr das geschrieben, was du liest.\nAuch das mit Lucian ult war kein flame, sondern er hat ein geilen KIll gemacht, wie mit den good call warauch an ihn, ohne die anderen Chat Verläufe sieht es halt schlimmer aus","replies":[{"poster":"Sirrkas","date":"2016-01-26T15:05:20.357+0000","up_votes":2,"down_votes":0,"body":"Ich wollte eigentlich eher eine Übersetzung ins Deutsche, weil ich den Sinn der Zeile nicht verstehe.","replies":[{"poster":"Maíko","date":"2016-01-26T15:34:32.884+0000","up_votes":1,"down_votes":0,"body":"> that we are idiots\n\nDass wir Idioten sind\n\n>they are3 premades and report everyone\n\nSie sind ein 3er Team und melden jeden\n\n>and he think we get bann (them = then?)\n\nund er glaubt, dass wir dadurch einen Ban bekommen\n\n\ndas wäre die sinnvollste Übersetzung, die mir dazu einfallen würde^^","replies":[{"poster":"Sirrkas","date":"2016-01-26T16:00:06.884+0000","up_votes":2,"down_votes":0,"body":"Ich dachte eher an:\n\nDass wir Idioten sind, sie sind 3er Premades, und reporten jeden und er glaubt, dass wir sie dadurch gebannt kriegen.","replies":[]}]}]}]}]}]},{"poster":"Krustentier","date":"2016-01-26T15:36:06.101+0000","up_votes":1,"down_votes":1,"body":"Also finde das schon hart, wenn das alles als Flame gesehen wird, ist ja dann eher eine weinerliche Community :D\nIch meine man kann sich auch anstellen xD","replies":[{"poster":"Sirrkas","date":"2016-01-26T15:50:13.101+0000","up_votes":2,"down_votes":0,"body":"Vielleicht interessiert dich dieser Lytepost:\n\nhttps://ask.fm/RiotLyte/answers/132333433282","replies":[]},{"poster":"Parunpata","date":"2016-01-26T15:39:09.698+0000","up_votes":2,"down_votes":0,"body":"Nicht unbedingt Flame, aber das fällt unter den Punkt \"Negative attitude\"\n\nAußerdem hast du \"nur\" ein CR bekommen. Würdest du schlimm flamen wäre es wohl ein Bann geworden.\n\nUnd wie es schon ein anderer schrieb, \"Kleinvieh macht auch Mist\".\nWenn du pausenlos und dauerhaft solche Sticheleien und Provokationen machst und nicht aus deinen Fehlern lernst, wirst du halt irgendwann dafür bestraft. Und ja, wenn du weiter so machst, kriegst du auch den 2 Wochen Bann durch sowas.","replies":[]}]},{"poster":"Krustentier","date":"2016-01-26T14:51:46.668+0000","up_votes":2,"down_votes":2,"body":"Dude auf ein Account habe ich 3 Skins für positives Verhalten bekommen.\nDas Silver Kiddies mag etwas über die Strenge zu schlagen und selbst die Lucian Ult ahahha war geschrieben, weil er echt ein lustigen kill holte.\nIch habe den Support mal geschrieben, den nur dieses eine Game und davor vor längere Zeit 1 einziges game wo ich wirklich 4 unnette sachen geschrieben habe.\n\nAber wenn das schon für  Reports und besonders Banns reicht, dann ... :D \nbin echt sprachlos wie man das als flame auffassen kann, der bestraft gehört","replies":[{"poster":"HyperionCH","date":"2016-01-26T15:06:42.160+0000","up_votes":2,"down_votes":0,"body":"Du hast ja bereits eine CR kassiert, was bedeutet, dass du immer wieder etwas flamest.\nKleinvieh macht auch Mist.\n\nDu blamest deine Mates (\"Silver Kids\" oder dass der Midlaner nicht hinterher geht, wenn der gegnerische roamen geht) und irgendwann ist auch dies einfach zu viel. Denn die Teamstimmung hast du sicherlich nicht wirklich gefördert, sondern eher verschlechtert.","replies":[{"poster":"Krustentier","date":"2016-01-26T15:33:57.221+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HyperionCH,realm=EUW,application-id=KYnfKGf0,discussion-id=Ei0tUzrV,comment-id=00030001,timestamp=2016-01-26T15:06:42.160+0000)\n>\n> Du hast ja bereits eine CR kassiert, was bedeutet, dass du immer wieder etwas flamest.\n> Kleinvieh macht auch Mist.\n> \n> Du blamest deine Mates (\"Silver Kids\" oder dass der Midlaner nicht hinterher geht, wenn der gegnerische roamen geht) und irgendwann ist auch dies einfach zu viel. Denn die Teamstimmung hast du sicherlich nicht wirklich gefördert, sondern eher verschlechtert.\n\nAhri gehörte zu mir war kein Flame :D wir honorn uns auch ;)","replies":[{"poster":"HyperionCH","date":"2016-01-26T15:38:03.170+0000","up_votes":2,"down_votes":0,"body":"Dies wissen die anderen Mates nicht und ob die Chatanalyse dies immer korrekt erkennt, ist mehr als fraglich.\n\nWenn du solche \"Jokes\" mit Premades machst, dann besser in TS/Skype/etc.\nSobald du es im chat machst, darfst du dich nicht wundern, dass dies auch nach hinten losgehen kann.\n\nDu musst dir vorstellen, dass deine anderen Mates (Randoms) nicht wissen, dass ihr Premades seid. Wenn dann jemand so etwas schreibt, nerft dies auch die Randoms und die Teamstimmung wird verschlechtert (-> gem. WdB verboten).\nEntsprechend ist dies - selbst wenn ihr es nicht ernst meintet - auch report-würdig.","replies":[]}]}]},{"poster":"CooL Ice Tea","date":"2016-01-26T15:01:16.244+0000","up_votes":2,"down_votes":0,"body":"Dude, es sind unter anderem auch die Report aufrufe die du sein lassen solltest, ich schreibe das hier nochmal extra weil du das in diesem Post nicht nochmal erwähnst. \n\nCalm down und hör auf mit der tipperei, es behindert sowohl dich als auch deine mates.","replies":[]},{"poster":"Tungsteel","date":"2016-01-26T15:27:03.095+0000","up_votes":1,"down_votes":0,"body":"Die Silver Kiddies sind sicher nicht ganz nett, was aber auch als Flame zählt, sind die Reportaufrufe (z.B. \"Report that lucian for flame\"). Es ist nachvollziehbar, dass man sich ärgert, wenn jemand ein Flamer ist. Allerdings tragen Reportaufrufe eben auch nicht wirklich zu einer guten Atmosphäre bei. \nAußerdem ist es egal, ob ein Spieler nach dem Spiel von einem oder von 9 Spieler reportet wird (vorrausgesetzt der eine Spieler reportet nicht immer wieder aus Spaß andere Spieler zu unrecht).","replies":[]}]},{"poster":"Shacoláde","date":"2016-01-26T14:56:24.807+0000","up_votes":2,"down_votes":0,"body":"> **That silver kiddies always :D**\n>** HAHAHAHAHAHAHAHAHA THAT LUCIAN ULT XDDDD**\n> **and then a silver kid that flame cause school is over xD**\n\nDas reicht doch völlig aus. Ist leider verdient mein Freund.","replies":[]},{"poster":"sN00Bdogg","date":"2016-01-27T05:00:17.372+0000","up_votes":1,"down_votes":0,"body":"Ist das alles von Dir? LOL! \nWenn ich soviel tippen würde, käme ich nicht mehr zum spielen. Wie lang ging denn das Match? Ich hab ca 34 Zeilen gezählt. \n\nMir würde das ganz schön auf den S*ck gehen, zumal ich es ja doch lese und so wieder einen kleinen Augenblick abgelenkt bin.\nWenn dann noch Aussagen wie \"push tower\" mit 5 Pings begleitet werden .... Kein Wunder, daß es als Flame rüber kommt und man genervt ist! Und nochmal abgelenkt, da man den Pings ja auch  hinterher schaut!","replies":[]},{"poster":"zoroyashie","date":"2016-01-26T14:47:11.001+0000","up_votes":1,"down_votes":0,"body":"Auch die kleinsten verstösse gehören bestraft.\nAuch wenn Rito meistens ein Auge zudrückt, passiert es immer wieder.\nAber ich wette mit dir du hast in anderen spielen auch geflamt.\nDen Riot bestraft nieman wegen nur einem Flamer Spiel.\nIch wurde früher auch regelmässig chatgebannt habe abr nie verstanden warum.\nJetzt habe ich es erkannt.{{sticker:zombie-nunu-hearts}}","replies":[]},{"poster":"Spicavius","date":"2016-01-26T14:46:44.138+0000","up_votes":1,"down_votes":0,"body":"Du warst schon auffällig geworden.\nJetzt wird jedes Vergehen von dir beobachtet.\nBzw schlägt jeder report stärker auf den Trigger für die Chatanalyse.  Somit wird dein Chat schneller überpüft werden als sonst.\nWenn du aber nichts negatives / toxisches geschrieben hast, wird die Chatanalyse sagen \"ok alles gut, er kriegt keine Strafe, denn er hat ja nichts böses geschrieben.  Der Typ, der ihn reportet hat wird jetzt weniger Einfluss auf weitere Reports haben\"\n\nAber du in diesem Chatlog viele unnötige Sachen geschrieben, hast du ja selber gesehen. Somit ist es gerechtfertigt.\n\nLass dich nicht auf unnötige Diskussionen ein. Mute den Knecht und reporte ihn am Ende des Spiels.","replies":[]},{"poster":"Prodigy Rumiho","date":"2016-01-26T17:26:26.995+0000","up_votes":1,"down_votes":1,"body":"Absolut verdient. \n\nBeleidigungen/Schimpfwörter sind kaum vorhanden aber ALTER du bist in diesem Game sowas von nervig, mir kommt das Kotzen!\n\n> report that lucian for flame 24/7 pls\n> reports just check chat history\n> i dont flame ;)\n\nDanach wärst du bei mir gemutet gewesen, und das völlig zurecht...\nAbgeshen davon, Leute die die ganze Zeit \"xD\" schreiben triggern mich richtig...","replies":[]},{"poster":"Rainbow Dashie","date":"2016-01-26T15:21:56.354+0000","up_votes":1,"down_votes":1,"body":"Ich geb dir den Chatlog mal zurück mit dingen die, meiner Ansicht zumindest nach, gegen den Weg der Beschwörer verstoßen und somit du der 2. CR geführt haben.\n\nnever saw that cait skin before\n4\nok ^^\ni saw it\nred>top\nminimap dude\nahri man {{summoner:14}} \nyour lb is roam 2477 {{summoner:14}} \nand u come to late and dont push tower again {{summoner:14}} \nu follow dude {{summoner:14}} \ndont flame other if u die\nreport that lucian for flame 24/7 pls {{summoner:14}} \nreports just check chat history {{summoner:14}} \ni dont flame ;)\nthat we are idiots they are3 premades and report everyone and he think we get bann them xdD {{summoner:14}}  (würde ich so mal deuten auch wenn mir der deutsche Sinn komplett nicht in den Kopf will)\ngp ult is broken :D 0 cd\ngj gnar\nleona and lb no ignite\ncold kill u but thought u are lb cait xd\nahri can u hit 1 charmed ß {{summoner:14}} \n?\nxD\nThat silver kiddies always :D {{summoner:14}} \nyeah platin on 2 accounts easy {{summoner:14}} \nand then a silver kid that flame cause school is over xD {{summoner:14}} \nHAHAHAHAHAHAHAHAHA THAT LUCIAN ULT XDDDD {{summoner:14}} \nhmm good call\ndude i am not a tank\nthey focus me while i am zhonya and u guys stand there and attack leona {{summoner:14}} \ndude its a normal :D\nif i want play serious i go normal\nidc your report xD \ngj leona that focus on me is great :) {{summoner:14}} \nwould be more fun game would that lucian not flame all time xD {{summoner:14}} \n\nTatsächlich nur 2 Flames dabei, aber auch 13 Nachrichten mit Negativer Einstellung.\nDas macht 15/34 Nachrichten die gegen den Weg der Beschwörer verstoßen.\n\nDu könntest dir auch die Frage stellen warum du auf die Fehler deiner Mats hinweisen musst und was du damit bezwecken willst z.b.\n>ahri man your lb is roam 2477 and u come to late and dont push tower again\n\n>ahri can u hit 1 charmed ß \n\n>they focus me while i am zhonya and u guys stand there and attack leona \n\noder warum du anderen unter die Nase reiben musst das du eindeutig über ihnen stehst.\n\n>yeah platin on 2 accounts easy","replies":[]}]}