{"poster":"Inquizelus","date":"2014-12-14T03:17:28.298+0000","title":"The Scarlet Kin [Epic Story inside]","subforum":"[ARCHIVED] General Discussion","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=zTvFL3LaNM4\r\n\r\nThe Scarlet King\r\n\r\nTo this day I refuse to speak his name. The name of the Scarlet King. Years ago this land was beautiful. I remember verdant plains, seas of grain and forests older than memory. Words fail to describe their splendor, the bustling markets, the mighty walls and shining temples. I was young in those days, foolish, but still they called me a sage, prophet; titles I never thought myself worthy. The visions came to me all the same, however I did not foresee the horror that was to come.\r\n\r\nEstmont was the first to fall to his foul sorcery. I have seen what remains of the once magnificent city; only a blackened scar. His path to the throne was paved in destruction and fire, it is called the Ashen Road and remains a monument to his terrible power. Ten thousand men rode out to fight him, to bring him down. Ten thousand of our strongest, our best and bravest. He faced them alone on the plains. The survivors say his steps never slowed as the sky rained fire and the ground trembled beneath his feet. They say he was like a force of nature. A god.\r\n\r\nI was there when he took the throne. The king lay broken at his feet as he placed the stained crown upon his head, the blood of the royal family upon him. It was then that he named himself the Scarlet King.\r\n\r\nNo, I will not speak the name of such a monster.\r\n\r\nThe forests were cut, the fields burned and our temples desecrated. The people were made slaves and feared the day they would be taken to fuel his dark magic. As years passed hope seemed to fade from the world.\r\n\r\nThen the vision came to me. I foretold of a mighty hero upon a roan horse who would lead a coup and bring an end to the Scarlet King.\r\n\r\nFar and wide I searched for him. I spoke of my vision in my wanderings, and the people gathered around me. They were rife with malcontent and they flocked to my promises of a hero to deliver them.\r\n\r\nAt last I found him, Tam, just a boy then. Hero, I proclaimed him. We molded him, trained him, shaped him into the hero we needed. He grew to be a man, strong and tall. A fierce fighter and a leader above all else. Our army had grown with him, and at last we were prepared.\r\n\r\nI remember the day we set out to slay the Scarlet King. The Hero sitting astride his mighty horse. Copper rings glittered on his fingers, a crown of bone upon his brow, and a spear of ice in his hand. He was hope.\r\n\r\nAnd I was there, when the Scarlet King struck him down. I still remember the confusion in the Hero’s eyes, he did not understand how he had failed. I told him,\r\n\r\n\"I lied\"\r\n\r\nUntold riches I was promised, and untold riches I received. My family is safe now, guaranteed security from a fate so many others will suffer. Yet it all feels hollow to me. Sometimes—sometimes I wonder at the price I paid for such things.\r\n\r\nAnd sometimes I wonder about the Hero, the real Hero of the vision. I found him early in my searching, but discounted him to preserve the lie. Does he still draw breath? Does he gather his army? If he comes I know I shall not escape his wrath, but even so, I hope.","replies":[]}