{"poster":"Shy Dragon","date":"2017-04-14T21:03:36.766+0000","title":"Arams & allgemeines Verhalten anderer Spieler!!!!","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":4,"body":"Liebes Riot-Team und liebe Community,\r\nmir ist in letzter Zeit immer wieder aufgefallen, dass das Verhalten der Spieler im Spiel von Tag zu Tag immer schlimmer wird. Dies geht von permanenten &quot;EZ, easy&quot; schreiben w&auml;hrend und nach dem Spiel bis zu Beleidigungen, weil man seine Lane verliert wenn man mal einen neuen Champ spielen bzw. lernen m&ouml;chte. Ich finde dieses Verhalten einfach nur traurig, dass die Community sich in diese Richtung entwickelt und ich finde es viel trauriger, dass Riot nichts gegen diese &quot;Flamer&quot; macht, obwohl man diese daf&uuml;r nach dem Spiel reported, da sie wie gesagt einen permanent meinen beleidigen zu m&uuml;ssen. Finde es wie gesagt einfach nur noch traurig und es macht deswegen auch zunehmend keinen Spa&szlig; mehr, daher hoffe ich das ihr, liebes Riot-Team und auch ihr liebe Community, mal etwas dagegen unternehmt und League of Legends wieder zu einem &quot;freundlichem&quot; Game macht.\r\n\r\n\r\nDesweiteren kann es nicht sein, dass ich, obwohl ich alle Champions besitzte, im Aram nur die selben 10 bekomme, klar es ist ARAM ( ALL RANDOM...), aber es kann doch nicht sein.... Hinzuzuf&uuml;gen ist auch, dass es, was das Matchmaking angeht es nicht sein kann, dass man mit einem Silber / Bronze Team gegen High-Gold / Platin gematcht wird, oder mit in einem full Bronze Team gegen full Platin spielen muss, da diese Teams von &quot;Skill&quot; her auf sehr unterschiedlichen Leveln sich befinden und sich dies zu 95% auch im Spiel bemerkbar macht.\r\n\r\n\r\nIn der Hoffnung das, mein Beitrag einen Mitarbeiter von Riot erreicht und dieser sich etwas Zeit nimmt dar&uuml;ber nachzudenken, w&uuml;nsche ich allen einen angenehmen Tag, Abend or what ever... und hoffentlich Teams, welche euch nicht daf&uuml;r flamen, dass ihr einen neuen Champion spielt und nicht gleich 10 / 0 geht.\r\n\r\n\r\nMit freundlichen Gr&uuml;&szlig;en, in entt&auml;uschter Stimmung\r\nShy Dragon","replies":[{"poster":"eingew","date":"2017-04-14T22:47:06.942+0000","up_votes":3,"down_votes":0,"body":"Gegen Flame hilft primär Mute und Report. Entgegen deiner Annahme, dass Riot nichts tue, gibt es eine Chatanalyse, welche, sobald ein Spieler durch genügend auffällige Spiele auf sich aufmerksam macht, diesen Spieler überprüft und bei Fehlverhalten bestraft. Die Strafen starten mit einigen Spielen Chatrestriction und gehen über einen zweiwöchigen bis zu einem permanenten Ban, je nach dem, ob sich der entsprechende Spieler entscheidet sich zu bessern oder nach der Strafe einfach weiter zu flamen. Dabei werden übrigens 70% der Spieler nach der ersten Strafe nie wieder straffällig, sie bessern sich also so weit, dass sie nicht einmal mehr wirklich reported werden.\nZudem werden Spieler mit einer Strafe von den Hextech-Belohnungen ausgeschlossen und erhalten diese erst wieder, wenn sie sich wieder einen gewissen Neutralitätsstatus erarbeitet haben.\n\nDer Clou am Zufall ist, dass wir Menschen schlichtweg nicht in der Lage sind, ihn vorherzusagen. Unsere subjektive Meinung macht uns jedes Mal, wenn wir eine Schätzung machen wollen, einen Strich durch die Rechnung und redet uns Dinge ein, die nur dann Sinn machen, wenn es hinter dem Zufall ein System gibt. Das ist einer der Gründe dafür, warum fast alle Shufflefunktionen in allen Musikapps oder -programmen am PC in Wirklichkeit gar keine zufällige Wiedergabe liefern. Stattdessen ist die Wiedergabe so manipuliert, dass ein Lied möglichst nicht zwei Mal vorkommt, denn die ursprünglichen wirklich zufälligen Wiedergaben wurden meist mit massiven Kundenbeschwerden quittiert (obwohl die Funktion halt nur das gemacht hat, was sie angab zu tun).\n\nNun, im ARAM geht es eben genau darum. Es ist drin, was drauf steht. Wenn dir das nicht gefällt, schlage ich vor du suchst dir etwas anderes? Meine persönliche Vorliebe ist da eine beliebige Seite aufzurufen, die dir einen zufälligen Champion vorschlägt (Ultimate Bravery Seiten bieten sich da an), da klickst du so oft rum, bis du einen findest, der dir gefällt und den spielst du dann im Normal. Quasi Random mit endloser Reroll-Funktion. Geht halt nur nicht in der Howling Abyss Map. Aber vielleicht findest du dafür ja auch Customs?","replies":[{"poster":"Shy Dragon","date":"2017-04-15T10:54:47.013+0000","up_votes":1,"down_votes":1,"body":"Im großen und ganzen muss ich Ihnen Recht geben, jedoch was die Geschichte mit z.B. Ultimate Bravery angeht ist es halt wieder so, dass wenn dieses \"Format\" spielst, direkt wieder geflamt wirst wenn es mal nicht ganz klappt, womit ich wieder bei meinem 1. Punkt angekommen wäre ... Verstehen Sie was ich meine?","replies":[{"poster":"eingew","date":"2017-04-15T10:58:50.620+0000","up_votes":1,"down_votes":0,"body":"Wenn es ihnen nichts ausmacht können wir ruhig beim duzen bleiben ;). Ist in Foren eigentlich meistens so üblich, wir üben hier schließlich ein Hobby aus und schreiben keine geschäftlichen Texte.\n\nIch wollte auch nicht sagen, dass man Ultimate Bravery spielen sollte. Das ist gemeinhin schlichtes trollen und kann sogar bestraft werden. Ich wollte nur darauf hinaus, dass man, wenn man einen zufälligen Champion zugewiesen bekommen haben möchte, auch solche Seiten dafür benutzen kann, während man die dabei vorgeschriebenen Builds geflissentlich ignoriert.","replies":[{"poster":"Shy Dragon","date":"2017-04-15T11:01:30.439+0000","up_votes":1,"down_votes":1,"body":"Okay dann danke ich dir für diesen Tipp und werde es mal versuchen ob es \"klappt\". \n\nIch hoffe nur, dass man nicht direkt wieder geflamt wird wenn man mal nen Champion auf einer vllt. etwas anderen Position spielt, als es in der \"Meta\" gemacht wird.","replies":[{"poster":"eingew","date":"2017-04-15T11:08:39.272+0000","up_votes":1,"down_votes":0,"body":"Solange hinter einer Position ein Sinn und eine logische Überlegung steckt, zum Beispiel dass Anivia durchaus das Potential zu einem guten Support hat, mit Vayne sogar eine excellente Combo ergibt, kann man sich jedenfalls ungeachtet des Flames sicher sein, dass man nichts falsch gemacht hat. Und meistens wird das dann ja auch akzeptiert, ich erlebe jedenfalls recht selten Flame wegen sowas.\n\nWas vielleicht noch eine Möglichkeit ist, die mir vorher entfallen war: Premades sind eine gute Methode für flamefreie Spiele. Such dir doch einfach im Unterforum \"[Clans und Teams](https://boards.euw.leagueoflegends.com/de/c/clans-teams-de)\" Leute aus, die dir gefallen, oder gehe gleich in eine Community, die sich explizit dem guten Verhalten verschrieben hat, die [Liga der Gentlemen](https://boards.euw.leagueoflegends.com/de/c/clans-teams-de/XZilr2EV-zocken-ohne-flamer-die-liga-der-gentlemen).","replies":[]}]}]}]}]},{"poster":"Alekra","date":"2017-04-14T22:21:57.117+0000","up_votes":1,"down_votes":0,"body":"Und woher nimmst du die Info, dass Riot nichts gegen Flamer macht?","replies":[{"poster":"Shy Dragon","date":"2017-04-15T10:52:14.393+0000","up_votes":1,"down_votes":2,"body":"naja klingt vllt. ein bisschen komisch, aber merkt halt nicht wirklich viel davon ... und es kann halt nicht sein, dass wenn ich z.B. Teemo spiele schon in der Lobby teilweise beleidigt werde ... und trotz das ich diese Spieler reporte, passiert halt nichts ...\n \nKann mich da jetzt auch komplett irren, aber so kommt es mir nuneinmal vor.","replies":[{"poster":"eingew","date":"2017-04-15T11:01:26.010+0000","up_votes":1,"down_votes":0,"body":"> naja klingt vllt. ein bisschen komisch, aber merkt halt nicht wirklich viel davon ... und es kann halt nicht sein, dass wenn ich z.B. Teemo spiele schon in der Lobby teilweise beleidigt werde ... und trotz das ich diese Spieler reporte, passiert halt nichts ...\n\nNaja, zwischen \"man merkt nichts\" und \"nichts passiert\" besteht ja schon ein Unterschied. Dass Riot dich nicht extra darauf aufmerksam macht, dass sie jetzt genau diesen Teemo bestraft haben sollte klar sein. Abgesehen davon könnte Riot durchaus etwas mehr Transparenz in das System bringen. Was vielleicht hilft: Hier im Forum Beschwerdethreads zu Strafen lesen.\n\nFalls du Informationen zum gesamten System suchst, wirst du [hier](http://en.volu-eu.org/pbkb_general_user_view.php?art=7) fündig.","replies":[]},{"poster":"Abasin","date":"2017-04-19T11:13:51.705+0000","up_votes":1,"down_votes":0,"body":"Naja, Flamer sind nachwachsender Rohstoff. Für jeden permanent Gebannten scharrt der/die Nachfolger/in schon mit den Hufen. Und dass Du nicht über jeden von Dir reporteten Fall Feedback bekommst, erklärt sich durch die gigantische Menge an Traffic (und Folgekosten), die dadurch entstehen würde. Denn gefühlt wird eigentlich im Schnitt einmal pro Spiel reportet. \nEs wäre sicher eine Überlegung wert, Wochenstatistiken zum Bannverhalten auszugeben, um ein Trendbarometer zu erhalten und diese im Client zu veröffentlichen. Das ist ja leicht zu ermitteln und der neue Client kann so etwas locker verkraften.","replies":[]}]}]}]}