{"poster":"Heisenberge89","date":"2015-02-12T22:13:25.317+0000","title":"Troppi troll, mi sono rotto","subforum":"Discussioni generali","up_votes":4,"down_votes":3,"body":"Salve a tutti,\r\nvoglio esprimere il mio giudizio negativo su questo gioco che presenta forse un sistema di ban troppo leggero. Non è possibile che si dia la possibilità a certi individui di continuare a rovinare partite dove uno ci mette tutto l'impegno per migliorare, che segue canali e live per imparare sempre di più e poi deve trovarsi come compagni o contro (molto poco frequentemente) dei giocatori che o giocano bene e poi si stancano e cominciano a feedare o escono dalle partite o semplicemente sono dei troll.\r\nMi sono rotto di perdere partite che si potrebbero benissimo vincere se si collaborasse. E non è possibile anche che nelle stesse ranked ti vai a trovare dei giocatori che giocano tanto per giocare, rischiando di farti scendere di livello o facendoti piazzare a livelli bassi, quando invece tu ha giocato bene. Io non ho ancora fatto le ranked per questo motivo.\r\nIl mio non è un discorso del tipo \"io sono un pro gamer e gli altri sono noobs\" perché anche io non sono bravo; però di certo non mi comporto come certa gente che ti ritrovi in partita quando stanno perdendo, ci metto sempre l'impegno massimo.\r\nIl punto è: o si migliora il sistema di ban per certi elementi o è meglio smettere di giocare e passare a qualcos'altro perché io ne ho le tasche piene. Grazie dell'attenzione","replies":[{"poster":"Jack Rubino","date":"2015-02-13T14:37:12.049+0000","up_votes":2,"down_votes":0,"body":"Ma se invece di fare la figura dell'idiota come le altre miliardi di persone che si lamentano inutilmente dello stesso motivo tuo e non migliorano e, di conseguenza, non vanno avanti, perché non cerchi di diventare migliore? E poi che è sta storia che la gente non può giocare ranked se non si megatryhardsspaccandosiilculo. Uno prova a giocare al meglio ogni volta che è in una partita, non è che ora mi faccio salire l'ansia perché sono in una ranked. Oltretutto tu hai scritto che manco le ranked hai fatto ancora, quindi di che ti lamenti se perdi qualche normal? Andrà come dovrà andare e sarai piazzato dove dovrai stare. Salire e migliorare è un altro discorso e dipenderà dalla serietà della tua voglia di migliorare. O semplicemente continui a lamentarti e rimani a ani completamente vuote. Alla fine ci puoi solo guadagnare quando giochi, e quando sei in ranked puoi solo guadagnare di più, non ci perdi niente a farle.","replies":[{"poster":"Heisenberge89","date":"2015-02-14T18:28:28.978+0000","up_votes":1,"down_votes":0,"body":"Ti ringrazio per la tua risposta e vorrei dirti che se parlo è con cognizione di causa. È vero si che non ho fatto ranked ma non vuol dire che non abbia esempi anche vicini a me che mi fanno dire quello che penso.","replies":[]}]},{"poster":"Jolly Roger","date":"2015-02-13T12:33:56.431+0000","up_votes":3,"down_votes":1,"body":"io ho iniziato ranked settimana scorsa.. iniziato di merda beccando diversi afk durante le promo..\npoi la cosa si è invertita, serie positiva di prima 10 vittorie, 2 sconfitte, poi 7 vittorie.\nin totale ho una 40 di ranked e sto con un ratio del 60% di win.. ma su queste 40 solo 1 partita è stata combattuta dove entrambi i team non flammavano o han pianto per i report.\nultima ranked, nonostante avessi dato il first blood, la riven nemica a lv 3, dopo avermi killato, ha scritto \"gg easy, i leave\" e ha quittato facendo perdere gli altri.\nse questo è normale...\n\ncome dicevo già la scorsa season in elo hell non esistono partite basate sulle skill, c'è poco da fare. tutto è determinato dalla fortuna nel trovare buoni mate o nemici pessimi. non è possibile finire ranked in gold/platino facendo 30 kill di team contro 3 in 20 minuti. sono score da aram.","replies":[]},{"poster":"TheAwesomeJ","date":"2015-02-13T00:18:11.875+0000","up_votes":2,"down_votes":1,"body":"Ti capisco veramente :I è un discorso ambiguo che irrita solamente, ma il fatto è lievemente diverso e penso che abbia a che fare con il rispetto reciproco.\nIo, ad esempio, in ogni partita cerco di metterci il massimo e rispetto tutti quelli che nel bene o nel male giocano in questo modo, il problema è quando alla gente non gli importa nulla e giocano casualmente/trolleggiando. Ciò è un'insulto a tutti quei player che si sono impegnati.\nPerchè poi questi \"troll\" spesso e volentieri sono i primi che in un match flammano e infamano gli altri solo perchè gli può essere andata bene la lane.\n\nPensa che io ho sempre giocato per stare in compagnia con gli amici, ma poi nella s4 (dopo 2 anni di normal) ho provato a rankare e ho vinto 6 ranked di qualificazione di fila, alla settima partita uno ha iniziato a trollare e feddare senza motivo mentre stavamo pure vincendo, da li mìè presa male e ho iniziato a giocare solamente con amici come già facevo prima.\nOra qualche sera a settimana, quando capita magari che c'è del tempo da perdere e si è in 2 si prova a fare ranked e \"come và , và\"\n\nTi dò un consiglio: prova a farti un gruppetto di brava gente, divertiti e prendila con calma, in questo modo migliorerai in game e sarai più sereno/tranquillo.\nPoi quando vorrai potrai reiniziare con ranked e tutto il resto :)","replies":[{"poster":"Heisenberge89","date":"2015-02-13T10:58:18.794+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=TheAwesomeJ,realm=EUW,application-id=MJVj50Jw,discussion-id=zKgoe5rR,comment-id=0000,timestamp=2015-02-13T00:18:11.875+0000)\n>\n> Ti capisco veramente :I è un discorso ambiguo che irrita solamente, ma il fatto è lievemente diverso e penso che abbia a che fare con il rispetto reciproco.\n> Io, ad esempio, in ogni partita cerco di metterci il massimo e rispetto tutti quelli che nel bene o nel male giocano in questo modo, il problema è quando alla gente non gli importa nulla e giocano casualmente/trolleggiando. Ciò è un'insulto a tutti quei player che si sono impegnati.\n> Perchè poi questi \"troll\" spesso e volentieri sono i primi che in un match flammano e infamano gli altri solo perchè gli può essere andata bene la lane.\n> \n> Pensa che io ho sempre giocato per stare in compagnia con gli amici, ma poi nella s4 (dopo 2 anni di normal) ho provato a rankare e ho vinto 6 ranked di qualificazione di fila, alla settima partita uno ha iniziato a trollare e feddare senza motivo mentre stavamo pure vincendo, da li mìè presa male e ho iniziato a giocare solamente con amici come già facevo prima.\n> Ora qualche sera a settimana, quando capita magari che c'è del tempo da perdere e si è in 2 si prova a fare ranked e \"come và , và\"\n> \n> Ti dò un consiglio: prova a farti un gruppetto di brava gente, divertiti e prendila con calma, in questo modo migliorerai in game e sarai più sereno/tranquillo.\n> Poi quando vorrai potrai reiniziare con ranked e tutto il resto :)\n\nMi fa piacere che anche qualcun'altro condivida il mio sconforto. Infatti gioco con alcuni amici però non sempre ci siamo tutti e alcune volte mi trovo a giocare da solo. Ok per il rispetto dei player però non trovo giusto che gente del genere possa ancora continuare a giocare. Non per qualcosa ma io seguo jake sieghardt e gli hanno bannato l'account smurf che usava per la serie road to diamond per elo boost; probabilmente qualcuno gli avrà portato quell'account al livello 30 e poi lui ha iniziato con le ranked. Poi ti ritrovi gente che che gioca male anche di proposito che probabilmente viene reportata e si ritrova l'account bloccato per qualche giorno forse o qualche settimana. Io penso che quegli account debbano essere ugualmente bloccati. Con questo non sto dicendo che non avrebbero dovuto bloccargli l'account a jake che comunque può fare richiesta per farsi sbloccare l'account, sto facendo solo un paragone tra due vicende differenti e \"punite\" (lo metto fra virgolette) in maniera differente.","replies":[{"poster":"Ringiel","date":"2015-02-13T11:39:25.706+0000","up_votes":2,"down_votes":1,"body":"mi dispiace deluderti ma la gente che trolla non viene bloccata ... gli unici report che ti possono bloccare l'account sono flame e afk ed è questo che secondo me è sbagliato,finchè non sarà bannabile esisteranno sempre i troll player in lol ... soluzioni se ne potrebbero trovare tipo mettere un sistema di kick nei pick dove servono 4 voti per kikkare un player \nla cosa migliore rimane sempre trovarsi 4 amici e fare le ranked team ... almeno là ti arrabbi di meno e se perdi te ne fai una ragione.","replies":[{"poster":"Heisenberge89","date":"2015-02-14T18:26:05.625+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ringiel,realm=EUW,application-id=MJVj50Jw,discussion-id=zKgoe5rR,comment-id=000000000000,timestamp=2015-02-13T11:39:25.706+0000)\n>\n> mi dispiace deluderti ma la gente che trolla non viene bloccata ... gli unici report che ti possono bloccare l'account sono flame e afk ed è questo che secondo me è sbagliato,finchè non sarà bannabile esisteranno sempre i troll player in lol ... soluzioni se ne potrebbero trovare tipo mettere un sistema di kick nei pick dove servono 4 voti per kikkare un player \n> la cosa migliore rimane sempre trovarsi 4 amici e fare le ranked team ... almeno là ti arrabbi di meno e se perdi te ne fai una ragione.\n\nPotrebbero anche inserire nell'elenco dei Ban quello per troll","replies":[]}]}]}]},{"poster":"Pasticcino Sexy","date":"2015-02-13T16:43:39.992+0000","up_votes":1,"down_votes":0,"body":"Non sono pienamente d'accordo.\nInfatti secondo me non è colpa esclusivamente del sistema di ban. La Riot purtroppo non può leggere nella mente dei 60 milioni di giocatori, quindi se un giorno \"Tizio\" si sveglia e decide di trollare, per chissà quale strano motivo, il sistema non può fare niente finchè la partita non finisce. Quando \"Tizio\" verrà bannato magari \"Caio\" comincerà a trollare e così via, quindi non aspettarti che un giorno i troll saranno completamente assenti o quasi, perchè non succederà mai, purtroppo fanno parte del gioco.","replies":[]},{"poster":"Dantazzo","date":"2015-02-13T14:50:26.987+0000","up_votes":1,"down_votes":0,"body":"Il numero di vittorie non vuol dire nulla, io ho un amico che ha tipo 600 vittorie in normale ma è molto più scarso di altri amici che ne hanno 200/300.","replies":[]},{"poster":"Firenheit","date":"2015-02-13T11:00:23.616+0000","up_votes":1,"down_votes":1,"body":"Purtroppo il sistema punisce chi si arrabbia, non chi fa arrabbiare... Io concordo con te al 120%","replies":[{"poster":"tiè","date":"2015-02-13T13:16:09.220+0000","up_votes":1,"down_votes":1,"body":"ci vuole una soglia di sbarramento per chi vuole giocare ranked : almeno 300 games normali vinte, almeno 5 pagine di rune, full runes di armor, MR , AD e Power ability. Se uno poi lascia troppe volte deve fare una serie di partite senza leave per accedere di nuovo alle ranked.","replies":[{"poster":"vegetable61","date":"2015-02-13T14:27:04.855+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=tiè,realm=EUW,application-id=MJVj50Jw,discussion-id=zKgoe5rR,comment-id=00010000,timestamp=2015-02-13T13:16:09.220+0000)\n>\n> ci vuole una soglia di sbarramento per chi vuole giocare ranked : almeno 300 games normali vinte, almeno 5 pagine di rune, full runes di armor, MR , AD e Power ability. Se uno poi lascia troppe volte deve fare una serie di partite senza leave per accedere di nuovo alle ranked.\n\nSi anche secondo me non è sufficiente essere a livello 30, ho degli amici che sono  quasi al 30 e fanno pena, ma tanto; tipo usare la Q di darius contro le torri e la E per prendere i minion","replies":[{"poster":"Frattaglia","date":"2015-02-13T14:43:31.852+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=vegetable61,realm=EUW,application-id=MJVj50Jw,discussion-id=zKgoe5rR,comment-id=000100000000,timestamp=2015-02-13T14:27:04.855+0000)\n>\n> Si anche secondo me non è sufficiente essere a livello 30, ho degli amici che sono  quasi al 30 e fanno pena, ma tanto; tipo usare la Q di darius contro le torri e la E per prendere i minion\n\nScusate ma questo è un problema vostro: ho uno smurf livello 28 con una cinquantina di normal vinte (ci faccio per lo più aram e partite coi bot appunto per non far salire il numero di vittorie) e non dubito che riuscirei a piazzarlo in silver alto se non direttamente in gold. Ho pure parecchi champ, l'unica limitazione è che ho solo due pagine di rune :(\n\nNon è lo scarsone che incontrerete una volta sola in una singola partita a impedirvi di scalare.","replies":[]}]},{"poster":"kremis88","date":"2015-02-13T15:13:15.444+0000","up_votes":1,"down_votes":1,"body":"5 pagine mi sembra eccessivo anche perché per chi come me non shoppa ci vuole 1 anno per farsele (io ne ho 3 e gioco da sei mesi) però sono d'accordo sulle 300 win e secondo me dovrebbero inserire il cosiddetto metagame anche nel gioco stesso. Mi spiego dovrebbero inserire dei consigli su dove giocare un determinato campione in modo ottimale... per esempio non puoi pretendere di giocare fizz giungla in ranked e vincere la partita in solo queue o janna mid.... tanto per citarne alcuni.... i giocatori inesperti purtroppo non conoscono i ruoli dei champ e finiscono per perdere è anche vero che secondo il metagame quinn va giocata top (è il mio main adc.. ho detto tutto) però vabbé... ti do ragione insomma ma tolgo il fatto delle pagine di rune secondo me è eccessivo","replies":[]}]}]}]}