{"poster":"Gses","date":"2018-05-02T19:05:52.113+0000","title":"Wie funktioniert das LeaverBuster-System wirklich ?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":1,"body":"Ich hab mehrere Infos dazu gefunden habe aber immer noch offene Fragen:\r\n-Ich wurde aufgrund von Internetabst&uuml;rzen zweimal gepunished. Beim ersten mal gabs 5- und beim zweiten mal gleich zehn Minuten.\r\nAlso scheinen sie sich zu stacken. Auf wie viele Stacks kommt ein Ban ? Und ist dieser dann Zeit-begrenzt oder Permanent ? \r\nAu&szlig;erdem habe ich irgendwo gelesen dass durch gutes Spielverhalten die Stacks zur&uuml;ck gehen k&ouml;nnen (?) \r\nAber wie sollte Riot denn gutes Spielverhalten mitbekommen k&ouml;nnen ? Ich meine schlie&szlig;lich gucken sie ja erst hin wenn man negativ Auff&auml;llt. \r\nDas w&auml;ren soweit meine Fragen :) \r\nIch hoffe ich hab keinen Forenbeitrag &uuml;bersehen wo meine Fragen bereits beantwortet wurden. Falls doch tut es mir leid.Bisher hab ich jedoch keinen gefunden der meine Fragen zur gen&uuml;ge beantwortet. \r\nWas ich allerdings zu &auml;hnlichen Fragen gefunden hab waren Antworten wie &quot;Leave einfach nicht dann musst du dir dar&uuml;ber keine Sorgen machen.&quot;\r\nIch bin jemand der (nach einer Erfahrung in der Das gegnerische Team bereits am Nexus war und wir erst 2 Tower oder so hatten. Sprich es war ziemlich Aussichtslos..Wir haben ein Ass erzielt, alle zusammen gepushed und hatten ca. zwei Minuten(!) nach dem Ass den Nexus klein.) glaubt dass man jedes Game noch umdrehen und Siegen kann egal wie Aussichtslos es l&auml;uft. Weshalb es mir oftmals schon schwer f&auml;llt zu surrendern ^^\r\nAlso sind solche Kommentare nicht n&ouml;tig :)\r\nFreu mich schon auf eure Antworten :D\r\nDanke im Voraus :)","replies":[{"poster":"Sirrkas","date":"2018-05-02T19:12:31.169+0000","up_votes":2,"down_votes":0,"body":"Ich glaube du vermischst hier Infos zu verschiedenen Systemen.\n\nZuerst beschreibst du den Leaverbuster. Der steigt auf bis zu 5 mal 20 Minuten Zeitstrafe vor betreten der Warteschlange an. Mir ist noch kein Fall bekannt, indem jemand einen 2 Wochenbann oder Permabann für AFK/DC/Leaven erhalten hat, Riot hält sich diese Option aber offen. \n\nDie Strafstufen lassen sich grundsätzlich durch positives Verhalten reduzieren. Beim Leaverbuster heißt das eben, nicht afk gehen und die Spiele anständig beenden. Dann werden irgendwann aus den 5 mal 10 Minuten, die man zuvor hatte, eben wieder nur 5 mal 10 oder auch nur 5 mal 5 Minuten Zeitstrafe, wenn man wieder vermehrt afk ist, da sich die Stufen reduziert haben. \n\nEs ist aber nicht bekannt, wie lange man dafür braucht. Vielleicht brauchst du 200 Spiele ohne nennenswerte AFK-Zeiten, vielleicht dauert es 1000 Spiele um von 20 Minuten auf den Anfang zu kommen. \n\nPositives Verhalten wird wohl durchaus irgendwie erkannt, wie genau, kann ich nicht sagen. Es reicht aber, sich neutral zu verhalten. Wobei positiv beim Leaverbuster bedeutet, eben nicht afk zu sein.","replies":[{"poster":"Mad Loony","date":"2018-05-02T19:14:22.565+0000","up_votes":1,"down_votes":2,"body":"Ich glaube es genügen weniger als 50 Spiele. Bei mir ging das jedenfalls sehr schnell.","replies":[{"poster":"clair de lune289","date":"2018-05-02T20:09:33.978+0000","up_votes":4,"down_votes":1,"body":"welch eine \"Überraschung\" das du als \"unschuldiger\" Spieler auch noch mit dem Leaverbuster zu tun hattest,das ist bestimmt nur \"Zufall\"\n\n**ACHTUN:** ich habe \"\" benutzt damit auch wirklich jedem klar ist,das es sich um Ironie handelt","replies":[{"poster":"Mad Loony","date":"2018-05-03T09:14:04.861+0000","up_votes":1,"down_votes":4,"body":"Hast recht, ist Zufall.","replies":[]}]},{"poster":"Sirrkas","date":"2018-05-02T19:16:07.587+0000","up_votes":2,"down_votes":0,"body":"Ich hatte noch nie einen Leaverbuster, deswegen habe ich dazu keine genauen Infos. Leider melden sich auch nur die wenigsten, wie lange sie etwa gebraucht haben, um eine Stufe abzusteigen.","replies":[]}]},{"poster":"e621 Rengar","date":"2018-05-03T07:24:20.328+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=6lMMyNh3,comment-id=0000,timestamp=2018-05-02T19:12:31.169+0000)\n>\n> Ich glaube du vermischst hier Infos zu verschiedenen Systemen.\n> \n> Zuerst beschreibst du den Leaverbuster. Der steigt auf bis zu 5 mal 20 Minuten Zeitstrafe vor betreten der Warteschlange an. Mir ist noch kein Fall bekannt, indem jemand einen 2 Wochenbann oder Permabann für AFK/DC/Leaven erhalten hat, Riot hält sich diese Option aber offen. \n> \n> Die Strafstufen lassen sich grundsätzlich durch positives Verhalten reduzieren. Beim Leaverbuster heißt das eben, nicht afk gehen und die Spiele anständig beenden. Dann werden irgendwann aus den 5 mal 10 Minuten, die man zuvor hatte, eben wieder nur 5 mal 10 oder auch nur 5 mal 5 Minuten Zeitstrafe, wenn man wieder vermehrt afk ist, da sich die Stufen reduziert haben. \n> \n> Es ist aber nicht bekannt, wie lange man dafür braucht. Vielleicht brauchst du 200 Spiele ohne nennenswerte AFK-Zeiten, vielleicht dauert es 1000 Spiele um von 20 Minuten auf den Anfang zu kommen. \n> \n> Positives Verhalten wird wohl durchaus irgendwie erkannt, wie genau, kann ich nicht sagen. Es reicht aber, sich neutral zu verhalten. Wobei positiv beim Leaverbuster bedeutet, eben nicht afk zu sein.\n\nFrüher gab es fürs AFK gehen auch richtige Banns :D","replies":[{"poster":"Sirrkas","date":"2018-05-03T09:05:01.974+0000","up_votes":2,"down_votes":0,"body":"Wie lange früher? Ganz am Anfang ja, da hatte man Tagesbanns. Aber das ist jetzt schon ewig her.","replies":[{"poster":"e621 Rengar","date":"2018-05-03T09:51:56.648+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=6lMMyNh3,comment-id=000000010000,timestamp=2018-05-03T09:05:01.974+0000)\n>\n> Wie lange früher? Ganz am Anfang ja, da hatte man Tagesbanns. Aber das ist jetzt schon ewig her.\n\nSeason2-3 ^^","replies":[{"poster":"Sirrkas","date":"2018-05-03T09:56:52.849+0000","up_votes":1,"down_votes":0,"body":"Ja, das meinte ich in etwa. Ich erinnere mich sogar an einen Freund, der einen neuen Account erstellt hatte, weil er früh einen DC gekriegt hat und als Feigling Stufe 1 vermerkt wurde.","replies":[]}]}]}]}]},{"poster":"Mad Loony","date":"2018-05-02T19:12:36.167+0000","up_votes":1,"down_votes":2,"body":"Soweit ich das selbst erlebt habe ist die maximal Strafe 20 min Warteschlange für 10 Spiele. Permabann wirst du nie bekommen. \n\nEs könnte ja ein Notfall passieren. Wenn jemand stirbt, weil ein Spieler einen Perma durch afk entgehen will und weiterzockt, wäre das ein riesen Skandall für Riot. \n\nIch habe allerdings auch irgendwo gelesen, dass du doch einen Perma bekommen kannst, wenn dir zu 100% wiederholendes Ragequitten nachgewiesen werden kann. Allerdings glaube ich das nicht wirklich. Du solltest also save sein.","replies":[{"poster":"Sirrkas","date":"2018-05-02T19:15:14.112+0000","up_votes":2,"down_votes":0,"body":"Im Grunde steht alles über den Leaverbuster auf der [Supportseite](https://support.riotgames.com/hc/de/articles/201752714#h3q2). \n\nWenn ich mich recht erinnere, stand da auch mal, dass es dafür Banns geben kann. Aber aktuell finde ich das in dem Artikel nicht, eventuell wurde das gestrichen.","replies":[{"poster":"Mad Loony","date":"2018-05-02T19:21:14.004+0000","up_votes":1,"down_votes":2,"body":"Ja. Dafür das Ragequitten ein Spiel komplett zerstört, sind die Strafen sehr überschaubar. Es macht irgendwie Sinn das Riot deshalb Drohungen ausspricht.\n\nUngewolltes afk gehen oder ein dc, rechtfertigen die längere Warteschlange auf jeden Fall. Einen Perma sollte es dafür aber nicht geben. Es passiert ja jeden mal, dass er völlig überraschend das Spiel verlassen muss.","replies":[{"poster":"eingew","date":"2018-05-03T05:35:04.703+0000","up_votes":1,"down_votes":0,"body":"Ja. \"Mal\". Nicht ständig. Und nur für ständig gibt es einen Leaverbuster.","replies":[]}]}]}]}]}