{"poster":"RIGHTCLICK A BIT","date":"2018-11-21T17:14:49.439+0000","title":"P3 ADC sucht motivierten und aktiven Supporter für DuoQ (P4+)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Heyho, sch&ouml;n das ihr euch Zeit nehmt, den Artikel etwas genauer zu betrachten.\r\nWie der Titel schon verr&auml;t, bin ich auf der Suche nach einem Supporter f&uuml;r DuoQ.\r\n\r\nAber erstmal etwas zu mir:\r\n\r\nBin 22 Jahre alt und spiele LoL seit Season 4. Focus auf Improving und Climb lege ich erst seit Season 7.\r\nLetzte Season habe ich mit Platin 5 abgeschlossen. Danach habe ich &quot;competetive in einem low-mid Platin Team bei Fenris eSports angefangen, mich sehr detailliert mit dem Spiel auseinander zu setzten. Nachdem sich das Team vor ca 6 Monaten aufl&ouml;ste und ich eine ca 3 monatige Pause eingelegt habe, bin ich nun seit ca bisschen mehr als einem Monat wieder sehr interessiert und fokussiert in dem Spiel unterwegs.\r\nMomentan pendel ich zwischen Platin 3 und Platin 2.\r\n\r\nAuf ADC favorisiere ich momentan Lucian, Kaisa, Xayah, Ezreal und Jhin.\r\nIch habe durch das &quot;competetive&quot; spielen in der Organisation ein sehr gutes und positives Mindset bekommen. Ich lasse mich nicht mehr wirklich tilten von dem Game und bevorzuge den Mute-Button, wenn Teammates oder Gegner ein wenig zu offensive oder zu viel reinchatten. Au&szlig;erdem bin ich &auml;u&szlig;ert motiviert, stetig im Spiel zu climben und zu improven. Dazu geh&ouml;ren aber auch Niederlagen, die mich mittlerweile eher st&auml;rken als niederstrecken.\r\n\r\nGenau diese Anforderung erwarte ich auch von meinem DuoQ Supporter. Ein positives Mindset gegen&uuml;ber dem Spiel. Der Wille und das Durchhalteverm&ouml;gen in dem Spiel zu improven und somit auch zu climben.\r\n\r\nNo offense an dieser Stelle, aber OTP&#039;s sind eher unerw&uuml;nscht.\r\n\r\nF&uuml;r weitere Fragen oder Anmerkungen bin ich immer offen.\r\n\r\nHinterlasst mir gerne hier eine Nachricht oder addet mich einfach Ingame: LFT Cursed\r\n\r\nMFG Cursed\r\n\r\nPS: TS und Discord vorhanden, jeweils aber kein Server.","replies":[{"poster":"Flexidoll","date":"2018-11-21T17:18:47.540+0000","up_votes":1,"down_votes":0,"body":"Heyho, hast du lust mal auszutesten ob wir eine Synergie haben? Bin supp main, hab aber letzte season nicht viel gespielt daher nur gold. davor die season war ich plat 1, bin auf plat 3 gedroppt und hab es dann deinstalliert. dadurch auf gold1 gedroppt. davor die season war ich aber plat 2 :D also wenn du bock hast, adde mich und wir probieren mal ob wir zusammen \"passen\".''\n\nLG Flexi {{sticker:zombie-nunu-hearts}}","replies":[]}]}