{"poster":"darkdill","date":"2015-03-09T06:17:46.190+0000","title":"Got any ideas on stuff Nintendo should add to future Zelda titles?","subforum":"[ARCHIVED] General Discussion","up_votes":1,"down_votes":0,"body":"Though the new Zelda Wii U is coming out sometime soon, I'd like to have a topic up to discuss what could be added to future titles in the franchise. Try thinking up not just gameplay stuff, but even story elements or other unique things.\n\nHere are a few things I think should be done in future Zelda games.\n\n1. **Hero Mode akin to Skyward Sword**  \nIn A Link Between Worlds, Hero Mode only really caused you to take X4 damage, which was a real letdown. Skyward Sword, on the other hand, made the game a lot trickier by doing more than just making you take double damage; it also made hearts much harder to acquire.  \nBut in future Zelda titles, I want a Hero Mode to go even further. Stuff like tougher enemies appearing earlier in the quest, bosses having new attacks and patterns, etc. That would make things really rewarding if you can beat it.\n\n2. **Voice Acting**  \nWhile Link is always meant to be a mute protagonist, that doesn't mean all we should hear out of every character is a strange sound, a gasp, or a cry of pain. Having some voiced cutscenes could really improve the experience of a Zelda title, especially if good voice actors are picked. Note that Link should remain a mute; no need to have him suddenly voiced beyond his usual grunts, yells, etc. But having someone voice Zelda or Ganondorf would be great.\n\n3. **More than one playable hero/heroine**  \nNavi and Midna made good companions for Link, but ultimately act as the little angel/devil floating on your shoulder. Zelda herself helped Link out as a ghost in Spirit Tracks, which was definitely a step in the right direction. However, I would LOVE to see a Zelda title where you could command more than one hero.  \nFor instance, say Link is made to team up with a young mage (let's just call her Lana for the sake of ease), who can solve puzzles that he simply can't (i.e. ones involving magic). With some gameplay hook, you could switch between Link and Lana when the situation calls for it, each having their own different capabilities and playstyles.  \nAnd to make it even more interesting, how about a replacement for Boss Keys? Imagine that to get into a dungeon boss' lair, Lana has to perform a complicated spell that will remove a seal over the entrance to the lair, but said spell takes time and will draw pretty much every nasty creature in the dungeon to her. During that time, Link has to protect her. Sounds like awesome?  \nThere's a whole lot that could be done with a Zelda game that features two playable protagonists, especially when one isn't a fairy, imp or ghost.\n\n4. **Politics!**  \nThis is gonna sound strange, but hear me out. Hyrule seems to never be in some sort of politically dicey situation, when its history has continually claimed that other nations have gone to war with it over the Triforce. Did all of those nations suddenly call it quits? LAME!  \nA future Zelda title could have a very interesting setting if it were taking place during a war between Hyrule and another nation, or even during a Hylian Civil War. Link could be forced to fight or avoid soldiers from the rival faction, and certain scenarios could become rather troublesome due to certain nobility or Link not wanting to make the war worse.  \nIt'd all make for some really interesting storytelling, IMO. The only problem is that it'd be very tricky to get it just right.\n\n5. **More complex boss fights**  \nMost bosses just have you hitting it with a specific item or reflecting an attack back at it, and then hack it apart with your sword. Kinda boring. On the other hand, franchises like God of War and Bayonetta keep fights fresh and furious by having unique ways in which you had to kill each boss. And yes, they would usually include the dreaded QUICK-TIME EVENTS. I know people don't like QTE's, but would it be so bad if some boss fights had them? Link could pull off some crazy cool stuff if they were used.  \nIf not QTE's, at the very least the boss fights need to involve a series of actions to bring a boss down. Armogohma's fight (Twilight Princess) was a terrible example of how to make a boss fight; let's not go that path again, shall we?\n\n---\n\nGot anything else to suggest? Or got anything to say about what's already suggested? Post it up!","replies":[]}