{"poster":"darkdill","date":"2015-04-22T07:58:32.965+0000","title":"@Kindlejack: How would you or another Rioter develop a thief Champion?","subforum":"Concepts & Creations","up_votes":1,"down_votes":0,"body":"League has Champions who are former thieves ({{champion:40}} {{champion:91}} {{champion:104}} {{champion:4}} to name a few), but none of them have really kept it as a running occupation, or at least don&#039;t give off the &quot;thief vibe&quot;.\r\n\r\nWhen I think thief, I&#039;m thinking something like Sly Cooper or the Thieves&#039; Guild in Elder Scrolls. They make a living pilfering your valuables without you knowing they were there until you see your shiny necklace is missing. Fun stuff.\r\n\r\nHas Riot ever tried making a thief Champion? If so, what went wrong? Couldn&#039;t make something interesting or cohesive?","replies":[{"poster":"Kindlejack","date":"2015-07-08T07:48:49.094+0000","up_votes":6,"down_votes":0,"body":"Hmm well I'm not on the champion team, but if I had to design the appearance and story for a thief I would start with a motive and a source of power. The only thief archetype that works as a heroic character would be Robin Hood style where they are stealing and redistributing power in rebellion against an imbalance. Believe it or not, stealing is by and large frowned upon so a villainous character might work? \n\nIn the game of League what could this champion be out to steal?  Gold is probably off the table because that would just be a terrible experience for players. Items same as gold. Experience would be equally misery-inducing.  Mana has been tried in the early days (and not everyone has it). Vision? Damage? Time? Stats? A new resource created just to be stolen perhaps? Thematically they could be trying to steal the very legends themselves - the memories or stories that made these champions so great... not sure how to convert that into a meaningful mechanic though.\n\nSo maybe they are trying to steal the memories of the champions? A mind thief could be a cool sort of mage and I'm sure there could be some mechanic around stealing their experiences and using it against them. Almost every time I try to come up with characters they end up being mind mages. I guess that's just my jam. I can see from some quick ideation though that anything meaningful that you could steal in a game would make it as bad an experience for your opponents as actually getting robbed, so I guess that could be a blocker. But I don't know this is just me taking a crack at it.","replies":[{"poster":"BA Tetsuo","date":"2015-07-08T20:50:14.441+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kindlejack,realm=NA,application-id=A8FQeEA8,discussion-id=AEQtcETq,comment-id=0004,timestamp=2015-07-08T07:48:49.094+0000)\n>\n>Snip\n\nMind thief. Have you considered having their damage scale with the target's level/experience or scale with how much damage they've dealt,  or something like that? IE: Stealing the memories of fights past, and using those memories against you. \n\nObviously, the first thought is to have them literally, mechanically steal experience or something. Maybe their abilities could look similar to trundles, where you're stealing stats for a time period?","replies":[]},{"poster":"ExecutorDill","date":"2015-07-08T15:33:06.014+0000","up_votes":1,"down_votes":0,"body":"an Energy Thief, set out to steal power: http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/1WEAAX8a-champion-concept-saje-the-energy-thief","replies":[]},{"poster":"Ramuhdo","date":"2015-07-08T15:00:07.085+0000","up_votes":1,"down_votes":0,"body":"Stealing their legends, eh?\n\n> *R* Legends Are Born!\n200 Range // 100 Mana cost // 90 / 80 / 70s Cooldown\n*Thief* steals the target's identity. For 5 seconds, *Thief* takes on the appearance of the target. They can activate this skill again to use that target's ultimate ability while this ability is active. The level equals the level of this ability. While taking on the target's appearance, *Thief* appears as an ally to the target's allies, but is still normally hit by abilities and can still be targeted with targeted abilities.\n\nSo you basically get to steal someone's \"legend\" by briefly becoming them and using their biggest power against the team. Short range means you really need to get in close (and if I were to design an entire kit, either an invisibility or gapcloser'd be included...), and taking on their appearance helps disorient a bit. Of course, you get questions like, \"If I steal Tahm's identity, do I also steal his voracious appetite?\" and \"What if their ultimate lasts longer than *Legends Are Born!*? \n\nBut those're questions I'd rather not think about right now!","replies":[]},{"poster":"5D Paragon","date":"2015-07-08T14:05:25.769+0000","up_votes":1,"down_votes":0,"body":"What if they had an ability, where it's kind of a force robbery attack thing.\nLike you said they try to \"steal the legend,\" or something of these people therefore the attack does a base damage, okay?\n\nSo let's say the base damage is 150 (+45% AD)\nThen it was randomly select one of the opponents abilities and add its damage value to this attack.\n\nSo let's say it does 150, then it selects an opponents ability that does 350, the total damage would be 500. \n\nIdk I'm bad at explaining things :s","replies":[]},{"poster":"Lifthrasir","date":"2015-07-08T13:12:46.993+0000","up_votes":1,"down_votes":0,"body":"How about stealing from the shop, a skill that allows you to “borrow” things from the shop like:\n\nYou can steal items from the shop. Stolen items can't be combined with purchased items or upgraded with gold.\n\nlvl 1: you can steal up to 400 gold worth of items from the shop.\nlvl 2: you can steal up to 1000 gold worth of items from the shop.\nlvl 3: you can steal up to 1700 gold worth of items from the shop.\nlvl 4: you can steal up to 2500 gold worth of items from the shop.\nlvl 5: you can steal up to 3400 gold worth of items from the shop.\n\nYou can only use this skill when you are on the base panel, no cd and no mana cost.\n\nWhen the skill is used the shop window opens, only instead of your current gold it will show how much you can still steal from the shop.\n\nFor example: at max rank, with a stolen G.A. you can steal another 600 gold worth of items, or return the G.A. to steal other things worth up to 3400 gold.","replies":[{"poster":"Tussetafsemann","date":"2015-07-08T14:00:09.365+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lifthrasir,realm=NA,application-id=A8FQeEA8,discussion-id=AEQtcETq,comment-id=00040004,timestamp=2015-07-08T13:12:46.993+0000)\n>\n> How about stealing from the shop, a skill that allows you to “borrow” things from the shop like:\n> \n> You can steal items from the shop. Stolen items can't be combined with purchased items or upgraded with gold.\n> \n> lvl 1: you can steal up to 400 gold worth of items from the shop.\n> lvl 2: you can steal up to 1000 gold worth of items from the shop.\n> lvl 3: you can steal up to 1700 gold worth of items from the shop.\n> lvl 4: you can steal up to 2500 gold worth of items from the shop.\n> lvl 5: you can steal up to 3400 gold worth of items from the shop.\n> \n> You can only use this skill when you are on the base panel, no cd and no mana cost.\n> \n> When the skill is used the shop window opens, only instead of your current gold it will show how much you can still steal from the shop.\n> \n> For example: at max rank, with a stolen G.A. you can steal another 600 gold worth of items, or return the G.A. to steal other things worth up to 3400 gold.\n\nWhile the figures you posted are far too large in my opinion, I think with some tweaking, this could work. Returning items makes it OP though. Perhaps it could be so that you can steal one item at level 6, one at level 11, and one at level 16? The level 6 item being worth, say, 300 gold max, increasing appropriately in later ranks.","replies":[]}]},{"poster":"Varnoc","date":"2015-07-08T13:11:27.315+0000","up_votes":1,"down_votes":0,"body":"Going off your memory stealing thought, what if the character in question stole the abilities of another champion? For instance, hitting a specific combo stole one of the three basic skills of the target at random, available for one time use. Would be very interesting to play, but the character would need other options should they steal a crappy spell. I can't recall specifically, but I've heard of plenty of thieves that can imitate the voices, appearance, or abilities of others to get at treasures. Could be cool. (EDIT: Parasite from DC comics is a good example, though he isn't a thief directly, he can temporarily absorb the abilities of others.)","replies":[]},{"poster":"ULTRAF0RCE","date":"2015-07-08T12:24:31.340+0000","up_votes":1,"down_votes":0,"body":"You culd also have a thief who steals hextech from piltover with an emphasis in game on stealing bonus damages and other similar things.","replies":[]},{"poster":"darkdill","date":"2015-07-08T08:29:16.230+0000","up_votes":1,"down_votes":0,"body":"My present thief design \"steals\" gold as a gameplay mechanic in that she actually just marks an enemy Champion and, if she can land a basic attack on a marked enemy, gets a good amount of bonus gold. Since you can chain several marks in a combo, you could earn something like 40 gold off one trade!\n\nThe downside? She's squishy and takes a huge gamble when she wants to trade. Someone like Darius would absolutely destroy her if she tried to pick his pocket (in-game).\n\nSo she doesn't actually steal gold out of another player's coffers, as that's toxic. But she gets bonus gold for being aggressive. Gameplay vs thematic, and I tried to make a compromise.\n\nAs for other stealing, her ultimate lets her steal a large amount of AD from an enemy Champion and heal herself for a large amount of her target's maximum HP, but ONLY if her ultimate is the killing blow (ala Darius). Thankfully, the attack does bonus damage based on % of the target's missing health, so it works well as an execute. (Does that sound too assassin-y?)\n\nIf you want more context, how about you give my thief, Severa, a looksie?\n\nhttp://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/gEIw1dEE-severa-the-princess-of-thieves","replies":[]},{"poster":"Solideus","date":"2015-07-08T08:13:16.768+0000","up_votes":1,"down_votes":0,"body":"Gangplanks new mechanic for collecting Silver Serpents is a nice thief-like mechanic; pirates are the bandits of the sea, after all.","replies":[]}]},{"poster":"FloRaider42","date":"2015-04-22T14:16:36.020+0000","up_votes":1,"down_votes":0,"body":"How exactly would you play a champion like that ?\nThiefs are, by their nature, invisible (perma stealth=op) to the uncautious and leave undetected (no combat ?) after they have stolen a treasure (no treasures on the Rift :I).\nImplementing such a concept in a normal champion seems impossible.","replies":[{"poster":"Tussetafsemann","date":"2015-07-08T13:55:23.640+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FloRaider42,realm=EUW,application-id=A8FQeEA8,discussion-id=AEQtcETq,comment-id=0002,timestamp=2015-04-22T14:16:36.020+0000)\n>\n> How exactly would you play a champion like that ?\n> Thiefs are, by their nature, invisible (perma stealth=op) to the uncautious and leave undetected (no combat ?) after they have stolen a treasure (no treasures on the Rift :I).\n> Implementing such a concept in a normal champion seems impossible.\n\nYour statement that thieves are by nature invisible is questionable. One can be a thief without being undetected. The definition at http://dictionary.reference.com/browse/thief seems to permit detection: \"a person who steals, especially secretly or without open force; one guilty of theft or larceny\". The definition _does_ state that the term is used **especially** when it is done secretly, but does not categorize it as a defining characteristic of a thief. To put it in perspective, if you were to come home while a thief was in your house and you saw him escape through the window, you would still call him a thief. In addition, the \"treasure\" stolen could easily be the passive mentioned above.","replies":[{"poster":"FloRaider42","date":"2015-07-30T22:12:50.749+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tussetafsemann,realm=EUW,application-id=A8FQeEA8,discussion-id=AEQtcETq,comment-id=00020000,timestamp=2015-07-08T13:55:23.640+0000)\n>\n> Your statement that thieves are by nature invisible is questionable. One can be a thief without being undetected. The definition at http://dictionary.reference.com/browse/thief seems to permit detection: \"a person who steals, especially secretly or without open force; one guilty of theft or larceny\". The definition _does_ state that the term is used **especially** when it is done secretly, but does not categorize it as a defining characteristic of a thief. To put it in perspective, if you were to come home while a thief was in your house and you saw him escape through the window, you would still call him a thief. In addition, the \"treasure\" stolen could easily be the passive mentioned above.\n\nYes the definition is different, but I personally only call (mostly) stealthy criminals thieves and brutish ones burglars or robbers.\nI still think that the main aspects of a thief should be less about open conflict and more oppurtunistic and maybe have one fight or escape ability if he ever gets caught instead of being a typical assassin.","replies":[]}]}]},{"poster":"Cats The Musical","date":"2015-04-22T22:46:39.438+0000","up_votes":1,"down_votes":0,"body":"{{champion:28}} ??? her kit is kinda like a thief","replies":[]},{"poster":"Kãtãrinã","date":"2015-04-22T08:09:41.251+0000","up_votes":1,"down_votes":0,"body":"Not sure if this would work as one. Honestly i made this forum post way back on the old boards and reading your post made me Re-post it. Obviously needs a lot of work or at least a decent amount. Enjoy the concept though.\n\nhttp://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/WmoQ1mNg-ace-the-master-thief","replies":[]},{"poster":"IcyPepper","date":"2015-04-22T08:01:46.925+0000","up_votes":1,"down_votes":0,"body":"I can see a passive where you get gold for harassing a champion, kind of like spellthief's edge. Maybe extra gold if you kill them, like Draaaaaaaven's passive.","replies":[{"poster":"darkdill","date":"2015-04-22T08:05:58.688+0000","up_votes":1,"down_votes":0,"body":"That would definitely have to be in the kit. It'd be as close to actual \"gold theft\" as you could get (taking money out of your opponent's accounts would be crossing the line).","replies":[]}]}]}