{"poster":"LACTE4","date":"2018-05-19T18:21:12.554+0000","title":"Idea para hartesania hextech.","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"Se que es imposible que metan esto y que me estoy contradiciendo\r\nporque la hartesania ya te da skins gratis.\r\nPero hoy me toco kog&#039;maw battlecast (la epica) pero no lo juego a dicho campeon.\r\nY pense... Yo quiero una skin pero nunca me toca &iquest;Porque no puedo desencantar por un poco de rp el aspecto? \r\nEso mismo desencantar skins  por lo menos la mitad o un cuarto de rp que vale la skin en la tienda.\r\n&iexcl;Espero que comparten sus opiniones!\r\nSaludos! :D\r\n-El lacteo mas lactoso LACTE4. {{champion:154}}","replies":[{"poster":"Katastrofica","date":"2018-05-20T02:03:47.625+0000","up_votes":1,"down_votes":0,"body":"Porque la idea de hextech es que no puedas elegir lo que queres.\n\nImaginate que te tocan 3 skins de 1820.\n\nRiot no quiere que desencantes los 3 twisted fate magnífico para tener una skin de 1820 que vos quieras, quieren que si queres algo en concreto, lo compres y si no, que intentes conseguirlo (De esta manera además consiguen que la gente se enganche al juego)\n\nDigamos, la Esencia Naranja es una especie de RP para objetos hextech.\n\nNormalmente, Riot te permite girar la ruleta, y que cruces los dedos para que te toque una skin decente.\n\nPero, los \"RP aleatorios\" (Escencia Naranja) Te permiten que si te toca una skin que REALMENTE deseas, la puedas intercambiar (a cambio de AÚN más esfuerzo)\n\n\nHacer que al girar la ruleta y no obtener el premio que querías te puedas retractar y obtener parte de lo que quieres, le quita la escencia a las... bueno, esencias.\n\nEs un riesgo que tomas, en todo caso, implementar una pequeña devolución, por mínima que sea, le genera pérdidas a Rito gomez, y nadie quiere que este juego tenga suscripción mensual.\n\n\nEdit: Con \"Girar la ruleta\" me refiero a los rerolls, no se por que no me salía la palabra en el momento de escribir esto xD","replies":[{"poster":"LACTE4","date":"2018-05-20T03:46:09.528+0000","up_votes":2,"down_votes":0,"body":"Wow! Me has abierto la boca :O\nen realidad tienes razon. Si podrias canjear por rp las skins que no te gustan la hartesania perderia todo el sentido de no saber que te va a tocar.\nAl final todo es aleatorio eso lo hace divertido :P\nsaludos!","replies":[]}]},{"poster":"0nlyRenektonSolo","date":"2018-05-19T18:32:43.585+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"LACTE4","date":"2018-05-19T19:14:10.083+0000","up_votes":1,"down_votes":0,"body":"Con eso estoy conforme (?","replies":[]}]}]}