{"poster":"BlankLeer","date":"2017-11-22T16:09:34.673+0000","title":"lol.launcher.exe nicht im lol ordener???","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo Liebe Mitbeschw&ouml;rer\r\nIch hab ein problem und zwar das ich wenn ich wooxy installieren will muss man ja seinen lol ordner ausw&auml;hlen aber bei mir kommt nh fehlermeldung das sich &quot;lol.launcher.exe&quot; oder &quot;lol.launcher.admin.exe &quot; nicht im ordner befinden.\r\nkann mir jemand helfen? \r\nhab auch schon eine vollst&auml;ndige reperatur gemacht hiflt trzd nicht.\r\nDanke im voraus","replies":[{"poster":"DrYatty","date":"2017-11-22T16:33:08.903+0000","up_votes":2,"down_votes":0,"body":"Kannst du League of Legends ohne Probleme starten? Falls ja, dann ist alles an seinem richtigen Ort. Ich kenne mich mit diesem Drittanbieterprogramm nicht aus und kann dir dabei euch leider nicht weiterhelfen. \n\n> ##CUSTOM-CHAMPIONMODELLE UND -ARTWORK\n>Fürs Erste verweilen Custom-Modelle und -Artwork fest in der Kategorie „Benutzen auf eigene Gefahr“, aber wir behalten sie im Auge. Wir können das Spiel nicht für Dinge optimieren, die wir nicht entwickeln. Sollten sie zu einem Problem werden (z. B. messbare Spielervorteile ermöglichen), werden wir basierend auf unserer soeben dargelegten Haltung agieren.\n>\nAbgesehen von ein paar Grauzonen gibt es definitiv ein paar Anwendungen, die nicht in Ordnung sind. Auch wenn die Anzahl der Spieler, die sie nutzen, sehr gering ist (nur der Bruchteil eines Prozents), bleiben wir wachsam und bestrafen jene Spieler, die Muster konsequenten Missbrauchs aufweisen.\n>\n> ######_Wir behalten uns das Recht vor, Maßnahmen gegen Anwendungen zu ergreifen, die den Einsatz unseres Eigentums kostenlos ermöglichen (auch bekannt als Skin-Hacks)._\n\nMehr Informationen dazu findest du hier -> https://support.riotgames.com/hc/de/articles/225266848-Third-Party-Applications","replies":[{"poster":"BlankLeer","date":"2017-11-22T16:44:20.913+0000","up_votes":3,"down_votes":0,"body":"Ja das spiel läuft ohne problem muss dann wohl am drittanbieter liegen.\ndanke","replies":[{"poster":"DreiPunkteDE","date":"2018-06-13T14:20:11.094+0000","up_votes":1,"down_votes":0,"body":"Ist daraus Mittlerweile was geworden?\n: )","replies":[]}]}]}]}