{"poster":"00Kirigiri00","date":"2015-08-26T19:12:56.924+0000","title":"Wie komme ich aus Bronze V raus?","subforum":"Ligen & gewertete Spiele","up_votes":3,"down_votes":5,"body":"Ich verliere jedes zweite Ranket und es liegt nicht immer, aber sehr oft an meinem Team.. Kann mir jemand helfen?","replies":[{"poster":"Termii TFT","date":"2015-08-26T20:04:34.366+0000","up_votes":2,"down_votes":0,"body":"ich habe mir mal deine Stats und Champions angeschaut: \nhttp://www.lolskill.net/summoner/EUW/00Kirigiri00/champions\n\noffensichtlich spielst du sehr viele Champs, das ist aber extrem schlecht für neue Spieler wie dir!\n\nLerne neue Champions durch beobachten kennen und nicht durch spielen. Baue dir einen Core-Championpool auf, in dem du 3 Lanes mit 10 Champions abdeckst und **nur** diese im ranked spielst, schaue streams/Youtuber und lerne zu lasthitten:\nhttps://www.youtube.com/watch?v=r7KiO8nToH0","replies":[{"poster":"00Kirigiri00","date":"2015-08-26T20:23:31.282+0000","up_votes":1,"down_votes":5,"body":"habe ich schon","replies":[{"poster":"Vogeljunges","date":"2015-08-27T07:06:04.493+0000","up_votes":2,"down_votes":1,"body":"Starke Antwort! \nDu fragst hier wie du dich verbessern kannst, ne menge leute gehen auf dich ein und wollen dir helfen, posten links, geben tipps und das ist deine reaktion? wenn du dir wirklich alle guides und videos und krams zum besser werden angeschaut und verstanden hast, dann liegts wohl letztendlich an dir selbst dass du die kurve nicht kriegst","replies":[{"poster":"00Kirigiri00","date":"2015-08-27T11:40:17.333+0000","up_votes":1,"down_votes":4,"body":"ich höre hier nur das was ich überall gehört habe... ich habe schon tausende von diesen videos gesehen, aber ich werde nicht besser wenn ich mir angucke was ich schon weiß.. oft kann ich einfach nicht farmen weil mein gegner mich daran hindert.","replies":[{"poster":"Vogeljunges","date":"2015-08-27T12:17:35.593+0000","up_votes":8,"down_votes":1,"body":"Dann erlaube mir die frage, warum du überhaupt diesen thread eröffnet hast wenn du alles ja eigentlich schon weißt, alles schon gesehen hast und du hier auf KEINEN einzigen Hinweis positiv reagierst... Oder trollst du hier nur rum und erfreust dich daran, dass sich deine Mitmenschen einige Minuten Zeit für dich nehmen? \n\nIm Grunde genommen beantwortest du dir ja so deine frage schon selbst - \" Wie komm ich aus Bronze 5 raus?\" - \"Gar nicht, denn obwohl ich alles weiss, scheitere ich daran, es auch nur im Ansatz umzusetzen \"","replies":[]},{"poster":"OrangeBubble","date":"2015-08-28T13:04:23.709+0000","up_votes":2,"down_votes":1,"body":"Wenn du weißt, wie man last hittet, wieso bist du dann noch in B5? X)","replies":[{"poster":"00Kirigiri00","date":"2015-08-28T13:46:27.303+0000","up_votes":1,"down_votes":2,"body":"Allein durch lasthitten kommt man nicht aus b5 raus","replies":[{"poster":"HyperionCH","date":"2015-08-28T13:50:55.641+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=00Kirigiri00,realm=EUW,application-id=ip27PlEH,discussion-id=yazAVGan,comment-id=000500000000000000010000,timestamp=2015-08-28T13:46:27.303+0000)\n>\n> Allein durch lasthitten kommt man nicht aus b5 raus\n\nBeweise uns das Gegenteil. ;)","replies":[{"poster":"00Kirigiri00","date":"2015-08-28T14:30:52.992+0000","up_votes":2,"down_votes":2,"body":"habe ich schon xD","replies":[{"poster":"HyperionCH","date":"2015-08-28T14:39:23.604+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=00Kirigiri00,realm=EUW,application-id=ip27PlEH,discussion-id=yazAVGan,comment-id=00050000000000000001000000000000,timestamp=2015-08-28T14:30:52.992+0000)\n>\n> habe ich schon xD\n\nWann denn?\n\nIch habe alle Rankeds seit Monatsfrist nachgeschaut:\nBei keinem einigen Game (als Top, Mid oder ADC) hast du über 5 Creeps pro Minute Lasthiten können. \n\nWenn du im Schnitt (exkl. Sup oder Jungler) 5-6 Lasthits pro Minute schaffst (was nicht wiriklich viel ist, aber trotzdem knapp das Doppelte, was du derzeit schaffst) und immer noch B5 bist, dann sprechen wir weiter. ;)","replies":[{"poster":"00Kirigiri00","date":"2015-08-28T15:09:31.989+0000","up_votes":1,"down_votes":2,"body":"mit yasuo hatte ich die letzten games keinen schlechten farm und trotzdem alle außer einem verloren...","replies":[{"poster":"HyperionCH","date":"2015-08-28T15:36:44.688+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=00Kirigiri00,realm=EUW,application-id=ip27PlEH,discussion-id=yazAVGan,comment-id=0005000000000000000100000000000000000000,timestamp=2015-08-28T15:09:31.989+0000)\n>\n> mit yasuo hatte ich die letzten games keinen schlechten farm und trotzdem alle außer einem verloren...\n\nDu hast nur 4x davon 5 CS/Min. oder mehr gemacht und dabei 3x verloren und 1x gewonnen.\n\nLanegegner (inkl. CS/Min):\nBeim Sieg: Bronze 2 (4.6)\nBei den Niederlagen: Silber 4 (6.0), Silber 5 (5.1) und Bronze 2 (3.7)\n\nDeine Lanegegner waren also in allen 4 Games bezüglich Rang stärker und farmten auch grundsätzlich besser als jene Gegner, die du in Rankeds derzeit bekommst.\nNur bei der letzten Niederlage hattest du mehr Farm und hast trotzdem verloren. Da scheint mir aber auch, dass das geesamte gegnerische Team einfach besser war (insbesondere Toplaner und Jungler; Botlane war beidseitig erstaunlich schwach). Man kann aber nicht alle Games gewinnen.\n\nAnsonsten hast du keinen wirklichen Farm-Vorsprung erarbeitet, was daran liegt, dass die Gegner doch wesentlich besser als B5 sind. Gegen B5-Gegner würde es sicherlich besser aussehen, wenn du jeweils mehr als 5 CS/Min. farmst.\n\nDeine Deaths sind natürlich immer noch viel zu hoch. Aber dafür lernt man ja auch in Normals. Wahrscheinlich gehst du noch zu offensiv rein (Yasuo hat kaum Escape-Möglichkeiten) und wenn die Gegner oberes Bronze bis tiefes Silber sind, nutzen sie diese Fehler auch aus.","replies":[{"poster":"00Kirigiri00","date":"2015-08-28T15:45:16.798+0000","up_votes":1,"down_votes":1,"body":"Na also..Ich werde jetzt drei rankets spielen und mich AUSSCHLIESSLICH aufs lasthitten konzentrieren. Ich wette ich werde trotzdem mit einem schlechten score verlieren","replies":[]}]}]}]}]}]},{"poster":"OrangeBubble","date":"2015-08-28T13:55:09.535+0000","up_votes":1,"down_votes":0,"body":"Doch.\nIch war auch B5.\nIch hab nur aufs Lasthitten konzentriert.\nBin damit bis B1 aufgestiegen.\nLol,","replies":[]}]}]}]}]}]}]},{"poster":"NG Drakuboy","date":"2015-08-26T19:33:42.571+0000","up_votes":1,"down_votes":11,"body":"Feeder der keinen einzigen Ward setzt. Woran kanns nur liegen...","replies":[{"poster":"Black Mage","date":"2015-08-26T19:40:33.740+0000","up_votes":7,"down_votes":0,"body":"konstruktive kritik wird geduldet, aber jemanden \"runterzumachen\", weil er spielmechanismen nicht beherscht, ist unter aller sau!","replies":[]}]},{"poster":"HyperionCH","date":"2015-08-27T08:19:52.335+0000","up_votes":3,"down_votes":0,"body":"Hier einmal die wichtigsten Punkte:\n\n1. Du musst den Willen haben, dich verbessern zu wollen.\n2. Du musst auf Tipps anderer (User hier im Forum oder von einem Coach) eingehen\n3. Du musst ingame bis zum Zerstören des Nexus gewillt sein, dein Bestes zu geben.\n\nEhrlich gesagt habe ich bei allen 3 Punkten meine Zweifel, dass du dafür bereit bist.\nBei Punkt 1 und 2 scheint du (noch) nicht so weit zu sein. Zwar möchtest du aus B5 rauskommen, aber die Tipps hier scheinst du nur knapp zur Kenntnis zu nehmen (\"habe ich schon\"). Klar hast du vielleicht Lasthits trainiert, aber wenn du a) weiterhin B5 bist und b) deine CS-Werte sehr schlecht sind, dann hast du offenbar zu wenig trainiert.\nBezüglich Punkt 3 spreche ich von deiner Einstellung ingame. Ich sehe sofort einige Rankeds, bei denen du deine Items verkaufst und Troll-Builds baust (z.B. nur noch diverse Schuhe etc.). Sorry, dies ist nicht nur disrespect gegenüber deinen Mates und Gegner, sondern einfach eine sehr schlechte Einstellung, die dich in Rankeds nicht weiterbringt. Und dies tust du nicht, wenn der Nexus eh gerade fällt, sondern viel früher (1x z.B. in der 14. Minute!) und spielst bzw. feedest noch minutenlang.\n\nKlar gibt es Games, die man auch nach 14 Minuten nicht mehr gewinnen kann. Aber man kann vom Game immer noch lernen, auch wenn viele dies nicht glauben. Es ist ja nicht so, dass du nichts mehr lernen kannst; denn sonst wärst du bezüglich deinem Rang ganz woanders als in B5.\n\nErst wenn du wirklich im Kopf bereit bist, dich bzw. deinen Skill verbessern zu wollen, dann kannst du die Tipps hier richtig aufnehmen, sie bestmöglich umsetzen und dann auch aufsteigen. Vorher bringen dir die hier von den anderen Usern gebrachten Tipps (die auch alle eigentlich sehr hilfreich und korrekt sind) so gut wie nichts.","replies":[{"poster":"00Kirigiri00","date":"2015-08-27T11:43:52.579+0000","up_votes":1,"down_votes":5,"body":"Ich will meine skills verbessern aber allein mit lasthitten und warden komme ich ganz sicher nicht aus bronze raus... Und wenn der gegnerische adc in der 14 miute schon 7/0 steht und der midlaner 6/1 habe ich auch keine motivation mehr","replies":[{"poster":"HyperionCH","date":"2015-08-27T12:11:13.252+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=00Kirigiri00,realm=EUW,application-id=ip27PlEH,discussion-id=yazAVGan,comment-id=00090000,timestamp=2015-08-27T11:43:52.579+0000)\n>\n> Ich will meine skills verbessern aber allein mit lasthitten und warden komme ich ganz sicher nicht aus bronze raus... Und wenn der gegnerische adc in der 14 miute schon 7/0 steht und der midlaner 6/1 habe ich auch keine motivation mehr\n\nDoch.\nEin besseres Farmen + mehr Vision reichen eigentlich aus, um aus Bronze rauszukommen. Derzeit farmst du oft so um 3 CS/Min. (teilweise mehr, teilweise aber auch weniger).\nWenn du knapp 6 CS/Min. hättest (was noch kein Spitzenwert ist, aber es ist OK), dann hast du nach 12 Minuten eine Spitzhacke zusätzlich erfarmt.\n\nDies heisst: pro Autoattack 25 mehr Schaden.\nDamit gewinnst du auf der Lane jeden Trade und die Gegner können dich nur schlagen, wenn sie (durch Ganks) in Überzahl sind.\n\nWenn du nun auch wardest (zumindest das gelbe Trinket voll ausnutzt), dann siehst du jedoch jeden Gank frühzeitig (natürlich auch immer auf die Mini-Map schauen^^) und es kommt gar nicht zur besagten Überzahl des Gegners.\nDamit kann weder der Jungler noch der Midlaner der Gegner durch Ganks etwas machen. Bleibt also nur der TP-Gank des Toplaners (falls er TP hat, was in Bronze nicht immer der Fall ist). Aber a) dauert der TP immer etwas und du kannst auch hier frühzeitig zurück gehen und b) da in Bronze kaum jemand wardet (auch beim Gegner), kann der Toplaner kaum TP-Ganks durchführen.\n\nNatürlich gibt es Games, die man nicht gewinnen kann. Aber die gibt es auch in Silber, Gold und höher. Umgekehrt gibt es auch Games, die man dank den Mates nicht verlieren kann. Dies gleicht sich aus.\nWichtig sind deshalb, die ausgeglichenen Games, die du durch gutes Spiel (u.a. Farmen und Warden) gewinnen kannst.","replies":[{"poster":"Rocket in Pocket","date":"2015-08-29T19:41:15.367+0000","up_votes":1,"down_votes":0,"body":"> Doch.\n> Ein besseres Farmen + mehr Vision reichen eigentlich aus, um aus Bronze rauszukommen. Derzeit farmst du oft so um 3 CS/Min. (teilweise mehr, teilweise aber auch weniger).\n> Wenn du knapp 6 CS/Min. hättest (was noch kein Spitzenwert ist, aber es ist OK), dann hast du nach 12 Minuten eine Spitzhacke zusätzlich erfarmt.\n> \n\nWo sieht man seinen durchschnittlichen farm?","replies":[{"poster":"HyperionCH","date":"2015-08-30T08:51:52.031+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Rocket in Pocket,realm=EUW,application-id=ip27PlEH,discussion-id=yazAVGan,comment-id=0009000000000001,timestamp=2015-08-29T19:41:15.367+0000)\n>\n> Wo sieht man seinen durchschnittlichen farm?\n\nEntweder mit Taschenrechner berechnen (Total Farm durch Spielzeit), oder die Seite op.gg ( http://euw.op.gg/summoner/userName=Rocket+in+Pocket ) gehen. Dort siehst du pro Spiel der durchschnittliche Farm pro Minute.\n\nNatürlich muss man darauf achten, welche Rolle man spielte. Als Toplaner, Midlander und ADC sollte man möglichst gut farmen. Der Support farm grundsätzlich nicht (höchstens ein ganz wenig, wenn man das grüne Gold-Item - für Tank-Support - besitzt). Der Jungler wird normalerweise auch weniger Farm haben als die Spieler auf der Lane (exkl. Support). Aber die Jungler-Monster geben dafür mehr Gold. Zudem kommt es beim Jungler auch auf seine Spielweise an, wie viel Farm man hat.","replies":[]}]},{"poster":"00Kirigiri00","date":"2015-08-27T12:29:18.914+0000","up_votes":1,"down_votes":2,"body":"Was is CS und wie bekomme ich \"mehr Vision\" ? XD","replies":[{"poster":"GummibaumXYZ","date":"2015-08-27T20:33:59.828+0000","up_votes":2,"down_votes":0,"body":"CS ist die Abkürzung für Creepscore. Mit dem CS wird also die Anzahl der Lasthits auf Minions und Monster gemessen. CS pro Minute heißt also wieviele Minions und Monster du pro Minute lasthittest.\n\nVision bedeutet Sicht, also Sicht durch Wards und Beobachten der Mini Map.","replies":[]}]}]}]}]},{"poster":"Poppy Lee Jones","date":"2015-08-26T19:15:49.801+0000","up_votes":2,"down_votes":7,"body":"lerne einen tier1 champion. und spiele nur den bis ca. silber 4- google einfach mal \"league of legends champion tiers\" da soltest du eine aktuelle liste bekomen. mfg Threshy","replies":[{"poster":"Busty Botter","date":"2015-08-26T19:18:00.081+0000","up_votes":4,"down_votes":1,"body":"PLS...in Bronze+Silber kannst du mit allem Carrien. Da brauchst du keine \"Metapicks\" da musst du nur Champs picken, die du spielen kannst.","replies":[{"poster":"Sirrkas","date":"2015-08-26T21:26:14.060+0000","up_votes":3,"down_votes":0,"body":"Ich bin mir sicher in Soloqueue kann man alles fast überall erfolgreich spielen. Wird vermutlich erst ab Dia 1 oder Challenger wichtig, was man spielt.","replies":[]}]}]},{"poster":"Busty Botter","date":"2015-08-26T19:15:25.055+0000","up_votes":3,"down_votes":5,"body":"Bist du weiblich Kappa","replies":[{"poster":"Maexle","date":"2015-08-26T21:24:13.335+0000","up_votes":6,"down_votes":2,"body":"Diese Frage xD\nWenn er weiblich wäre, dann wäre er Silber 5 Main Support und seine lieblingschamps wären Lulu, Nami, Janna und vielleicht Sona ;P","replies":[{"poster":"Busty Botter","date":"2015-08-26T21:38:06.296+0000","up_votes":2,"down_votes":0,"body":"Mein erster Skin in LoL war Armor of the Fifth Age Taric, anderen auch bekannt als Rosenquarz Taric. Ich bin männlich, noch Fragen? <3","replies":[{"poster":"Maexle","date":"2015-08-26T22:37:02.966+0000","up_votes":2,"down_votes":0,"body":"Ja, wieso fragst du dann, ob er weiblich ist? ;P","replies":[]}]}]}]},{"poster":"Elxeam ","date":"2015-08-26T21:32:55.429+0000","up_votes":1,"down_votes":1,"body":"Mach weniger Fehler. Stumpfe Aussage, ist aber der beste Weg um direkt Challenger zu kommen… oder erstmal Bronze 4 ;P","replies":[{"poster":"00Kirigiri00","date":"2015-08-27T16:28:00.760+0000","up_votes":1,"down_votes":2,"body":"Ist genau so wie wenn ich sagen würde \"du musst games gewinnen um so schnell wie möglich challanger zu werden\"..\n\n\nleichter gesagt als getan","replies":[{"poster":"Elxeam ","date":"2015-08-27T21:51:44.243+0000","up_votes":1,"down_votes":0,"body":"Nein das ist nicht das Gleiche… jeder Spieler macht Fehler und deswegen musst du ja überlegen, was für Fehler du gemacht hast und sie im nächsten Spiel nicht mehr machen… {{Champion:17}}","replies":[{"poster":"00Kirigiri00","date":"2015-08-28T12:13:40.646+0000","up_votes":1,"down_votes":1,"body":"als ob ich mir jede aktion aus dem vergangenen spiel merke.. ich habe danach alles vergessen{{champion:32}}","replies":[{"poster":"OrangeBubble","date":"2015-08-28T13:01:16.047+0000","up_votes":2,"down_votes":1,"body":"Vllt mal darüber nachgedacht, die Spiele einfach aufzunehmen x)?","replies":[{"poster":"00Kirigiri00","date":"2015-08-28T13:47:20.227+0000","up_votes":1,"down_votes":1,"body":"habs versucht, kriegs aber nich hin","replies":[{"poster":"BigSnipe","date":"2015-08-29T16:52:55.098+0000","up_votes":1,"down_votes":0,"body":"es gibt lol replay","replies":[{"poster":"00Kirigiri00","date":"2015-08-30T17:52:03.038+0000","up_votes":1,"down_votes":1,"body":"kann ich nich downloaden weil es angeblich eine gefahr für meinen laptop darstellt","replies":[{"poster":"Night Lead","date":"2015-09-01T07:57:53.678+0000","up_votes":2,"down_votes":0,"body":"nimm baronreplay","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Laelae","date":"2015-08-26T19:47:56.916+0000","up_votes":2,"down_votes":0,"body":"Wenn du möchtest kannst du mich adden. Werde dir zuschauen, aufnehmen und dir dann schicken falls es dir helfen sollte ^^","replies":[]},{"poster":"coldfighter1","date":"2018-10-15T08:29:24.134+0000","up_votes":1,"down_votes":2,"body":"spiel Disco Nunu dann gewinnst du jedes game","replies":[{"poster":"Mjölnir Kind","date":"2018-10-15T08:31:38.547+0000","up_votes":2,"down_votes":0,"body":"_Schaufel aus der hand reiß_\n\nWP fürs ausgraben eines 3 jahre alten Threads ..","replies":[{"poster":"coldfighter1","date":"2018-10-15T11:47:21.394+0000","up_votes":1,"down_votes":0,"body":"hey gib mir meine Schaufel wieder!!! {{summoner:14}}","replies":[{"poster":"Sirrkas","date":"2018-10-15T14:47:47.435+0000","up_votes":1,"down_votes":0,"body":"Ich fürchte, Prinzessin arbeitet für Acne Grease and Shovel:\n\nhttps://www.youtube.com/watch?v=i7SqSd3ZSBU&feature=youtu.be&t=195\n\nDie Schaufel wirst du wohl nicht mehr wiedersehen.","replies":[]}]}]}]},{"poster":"Soúp","date":"2015-08-27T09:57:29.596+0000","up_votes":2,"down_votes":1,"body":"Seinen Antworten nach, hat er gar nicht vor etwas zu lernen, sondern will nur die Bestätigung, dass man mit 4 Noobs im Team nicht gewinnen kann. \n\nDas LoL-Leben ist ein ständiger Lernprozess, bei dem man immer wieder Etappen durchmacht. Kennt wahrscheinlich jeder von sich selbst. \nEs gibt eine Phase in der man das Gefühl hat, man ist besser als seine Teamkollegen - \"ich feede nie meine Lane\" / \"ich gewinne immer meine Lane\" / \"alle anderen feeden nur rein\". Das mag zwar in dem Moment so stimmen, aber das Große Ganze betrachtet man dadurch natürlich nicht. Da hört man dann auch gerne Tips wie \"nicht die anderen sind Schuld, sondern DU!\" - das will man nicht glauben, man sieht es ja schließlich an den Stats. Tatsächlich sollte man aber versuchen darüber nachzudenken. An den Teammates konnte man in solchen Game nichts ändern, also muss man zwangsläufig überlegen, was man selber hätte anders machen können. Standartantwort ist auch hier wieder: warden! Selbst wenn man selbst nicht durch Ganks stirbt, oder das Gefühl hat, auch ohne Vision zu wissen was los ist - du hilfst deinem Team ENORM, wenn du selbst gute Wards setzt. Ich empfehle also so früh wie möglich dein Trinket auszubauen! Allein das grüne Upgrade lässt dich 3 Wards setzen. Dein Jungler und die anderen Lanes wissen also, wenn du sie sinnvoll setzen kannst, wo sich die Gegner befinden, bzw. was die Gegner als nächstes machen werden. Wenn man also drüber nachdenkt, was man selbst hätte anders machen können, stößt man immer wieder auf \"ich hatte meinen Lanegegner im Griff, wieso hat der trotzdem so viele Kills? Ich bin schließlich nie durch ihn gestorben\" - das ist auch ein klassischer Anfängerfehler. Selbst wenn man von den Mechanics besser ist als der Lanegegner, so kam er doch auf eine gute KDA - wie hat er das gemacht? Höchstwahrscheinlich, indem er in richtigen Momenten, die richtigen Entscheidungen getroffen hat - zB hat er dich auf der Midlane farmen lassen und hat sich entschieden die Botlane zu ganken. Wie gesagt - von den Mechanics ist er möglicherweise schwächer als du, aber er hat eine bessere Mapawareness, bzw. ein besseres Gespür für Teamfights/Ganks/etc. \n\nIn dieser Phase befindest du dich wahrscheinlich gerade. \n\nIch kann dir nur folgende Hinweise geben: \n* **Wards**! Du kannst dein Trinket mit lvl9 ausbauen - versuche es so früh wie möglich zu tun! (Spätestens lvl 12-13), weil Vision euch einen enormen Vorteil bringt! \n* **Lasthitten**! Mein Kollege ist da ein gutes Beispiel. Er achtet nie darauf welche Minions gut zum lasthitten sind. Während seine Minions ein gegnerisches töten, nimmt er sich irgendein anderes und lasthittet das dann. Das lernt man mit der Zeit. Darauf achten, welche gegnerischen Minions low sind und sie dann töten- vielleicht auch mal üben tatsächlich nur den Lasthit und sonst keinen Damage am Minion zu machen (Stichwort Lane freezen). Lasthitten ist wirklich eine spannende Sache - und eben nicht einfach. Man muss darauf achten zu lasthitten, gleichzeitig noch den Spells der Gegner ausweichen und möglichst selbst noch ein wenig damage an den Gegner bringen (und gleichzeitig natürlich noch auf den Jungler achten, usw.). Du kannst dir ja mal Videos zu folgenden Sachen angucken: Lane freezen, Slowpushen - ist ganz interessant und eröffnet dir vielleicht neue Möglichkeiten. Und ganz wichtig auch - unterm Tower farmen! Die meisten Leute verlieren fast die komplette Wave, weil sie eine simple Mechanik nicht verstehen. Melee-Minions und Caster-Minions. Dein eigener Tower tötet die Melee-Minions mit 3 Schüssen - nach zwei Schüssen des Towers musst du einfach den Lasthit machen (das Minion hat nach 2 Towerhits so wenig Leben, dass du nur eine Autoattack drauf machen musst). Caster-Minions sind schon nach 2 Towerhits tot. Du solltest also versuchen eine Autoattack auf das Minion zu machen, bevor der Tower es trifft. Die Reihenfolge sieht dann also so aus: Melee-Minion --> Towerhit + Towerhit + deine Autoattack, Caster-Minion ---> Autoattack + Towerhit + Autoattack. Eigentlich recht simpel - wissen viele allerdings nicht. \n* **Teamfights**! Kommt häufig vor, wenn man lasthitten üben möchte ^^ Das eigene und das gegnerische Team beschnuppern sich irgendwie auf der Map (zB vor dem Dragonpit) und man denkt sich \"ich komme gleich dazu, mache nur noch eben die Wave zu Ende\" --> NEIN! Du lasst dann halt die 3-4 Minions mal links liegen und gehst sofort zu deinem Team. Dein Damage kann der entscheidende sein, um diesen Teamfight zu gewinnen. Häufig kommen die Leute dann zu spät dazu, weil sie noch die Minionwave clearen wollten - dann steht man aber auf einmal nicht 5 vs 5, sondern eben 2 vs 4 .. direkt zum Team gehen. Letztenendes bringt es auch nichts, wenn deine 4 Teamkameraden sterben und du kannst stolz sagen \"ich bin nicht gestorben, meine KDA ist super\"! Das gilt natürlich nicht für jeden Teamfight, aber dann solltest du vielleicht per Ping andeuten, dass du die Vorbereitung auf den Teamfight nicht so optimal findest ;-)\n\nIch schätze mal, dass du das eh nicht lesen willst, also höre ich an dieser Stelle mit Tips auf. \n\nGruß","replies":[]},{"poster":"Maexle","date":"2015-08-26T21:29:58.541+0000","up_votes":2,"down_votes":1,"body":"Spiele wenige Champs die dir Spaß machen und die du ganz gut kannst. Versuche nach jedem Spiel zu überlegen, was du falsch gemacht hast und versuche dann die Fehler im nächsten Spiel nicht mehr zu machen. Die ganzen Grundmechaniken, wie z.B Farmen, warden, und eine gute Übersicht sollten natürlich auch nicht fehlen. \nZu den Champs würde ich dir empfehlen erstmal die zu spielen, die dir am meisten Spaß machen, aber generell auch Champs wie Annie ( Mitte), die relativ einfache Mechaniken haben und kaum ein Gegner bis Gold weiß, was er dagegen machen muss.","replies":[]},{"poster":"zRk Jakoo","date":"2015-09-07T10:58:52.743+0000","up_votes":1,"down_votes":0,"body":"Wenn ich später Zuhause bin kann ich ein paar duoq mit dir machen wenn du willst :)","replies":[]},{"poster":"OrangeBubble","date":"2015-08-28T10:31:46.283+0000","up_votes":1,"down_votes":0,"body":"Du musst dir Bronze 5 so vorstellen, wie ein grausames Verlies mit Untoten und Zombies, die dich einfach nicht gehen lassen wollen, egal wie gut du bist, egal wie stark du bist, du wirst da unten für immer bleiben. \nWas ich dir sagen will, du kommst da nicht raus, weil Bronze 5 > all Skills. Einmal B5 , immer B5 x3\n\nPS: In meinem Herzen bin ich immernoch in Bronze 5 gefangen x3","replies":[{"poster":"Night Lead","date":"2015-09-01T07:42:57.277+0000","up_votes":1,"down_votes":0,"body":"Stimmt nicht ganz mein ADC hat sich in einer Woche von B5 auf b1 gespielt.","replies":[{"poster":"OrangeBubble","date":"2015-09-05T13:07:24.106+0000","up_votes":1,"down_votes":0,"body":"Es stimmt nicht ganz, es stimmt gar nicht. \nDu kannst mit jeder Rolle aus Division X oder Liga X rauskommen.\nIch bin selber von B5 bis S5 mit ADC Corky gekommen.\nEs war schlicht Sarkasmus. I.wie wollte ich wissen, ob jemand genau so eine Antwort auf meinen Kommentar gibt x)\n\nLg","replies":[]}]}]}]}