{"poster":"iPrawn","date":"2019-06-14T22:12:35.656+0000","title":"If you don't know how to use CTRL + ALT + DEL, you cannot play League on a regular bases.","subforum":"Report a Bug","up_votes":4,"down_votes":0,"body":"Every single day, when I bring my laptop back out of sleep, I have a message telling me that League of Legends couldn't reconnect. I click OK, and it shuts down the client. Only it doesn't fully shut down. Instead, there are two, three, maybe even four \"League of Legends\" processes still running in my task manager. The client window is gone, but those processes are still there, usually using 0% CPU.\r\n\r\nIf I then double-click League's icon to start it up again, nothing happens. Or sometimes the splash screen will appear for a moment, and then nothing. Those processes that are running in the background will continue to prevent me from opening League again.\r\n\r\nOnly way to fix the problem is for me to press CTRL + ALT + DEL, and manually shut down those processes.\r\n\r\nI can't imagine I'm the only person who experiences this problem. Surely, League must lose tens of thousands of new players every month, simply because the got on one morning and tried to start League, and it wouldn't open. So they tried a few times, got frustrated, and simply decided to double-click a different game's icon instead, and that was the last time they played League. Honestly, new players can leave over an inability to start the game. \r\n\r\nAnd the worst part is, this bug has existed for basically as long as the new client has been around. I've had to CTRL + ALT + DEL probably a thousand times by now, and that's the only reason I'm still playing League. It baffles me that Riot still hasn't fixed this, considering how it's no doubt causing them to lose so many players. Do they like, not care that they are losing players?","replies":[{"poster":"Unemployed Ninja","date":"2019-06-15T05:16:03.833+0000","up_votes":1,"down_votes":0,"body":"What OS are you running on? The only time I've ever had a problem remotely similar to this was on XP, and that was many many many years ago.","replies":[{"poster":"Luther King Jr V","date":"2019-06-15T05:36:27.927+0000","up_votes":1,"down_votes":0,"body":"I use win7 i have same \"problem\"\nclient is bugged on start and restart\n \ni have to terminate the processes (there are 3 or 4 of them for just one client)\n\nthen open client again, and again until it finally starts but i am used to it, kinda annoyed by how slow it loads tho","replies":[]}]},{"poster":"KFCeytron","date":"2019-06-15T05:28:59.367+0000","up_votes":1,"down_votes":0,"body":"Windows low-power modes (CPU throttling, sleep, hibernate, etc.) have never worked properly.","replies":[]},{"poster":"holystack","date":"2019-06-15T05:19:34.172+0000","up_votes":1,"down_votes":0,"body":"I have that same exact issue at times lol. Having to open up my task manager and finding 3-4 LoL processes, just waiting to be closed. It's definitely a small inconvenience and should be fixed eventually, assuming that problem happens a lot more frequently than we think.","replies":[]},{"poster":"Dynikus","date":"2019-06-14T22:31:18.353+0000","up_votes":1,"down_votes":0,"body":"ctrl + shift + esc brings you straight to the task manager btw. It's faster than ctrl + alt + del\n\n> League must lose tens of thousands of new players every month\n\nseems like a gross exaggeration. It's probably no where near as big of an issue as you're making it out to be. ","replies":[]}]}