{"poster":"Vampie1","date":"2016-02-09T17:05:45.260+0000","title":"Suche Hilfe für Sivir Ausrüstung","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey alle, ich spiele und liebe Sivir, macht echt spass mit ihr zu spielen. Mein problem ist nur, das ich irgendwie gegen kaum einen Champ eine chance habe.... Ich renne die lines rauf und runter, vasallen und t&uuml;rme sind f&uuml;r mich kein problem, aber ich komme eigendlich aus jeden Game mid &uuml;ber 10-15 t&ouml;tungen raus..... ich sterbe einfach viel zu oft, auch wenn ich auf save spiele.... Ich kille zwar haufenwei&szlig;e t&uuml;rme und vasallen, was mir auch spass macht, aber gegen champs hab ich irgendwie keine chance... sieht dann immer etwa so aus: 3/ 14/ 8.......  ich habe so zwar schon viele games rumgerissen wenn wir am verlieren wahren, da ich die t&uuml;rme auseinander nehme und so, aber werde immer als noob beschimpft, obwohl ich viel zum spiel beitrage, nur packe ich einfach kaum einen gegnerischen champ..... haupts&auml;chlich nur gl&uuml;ckstreffer oder so.... ich hoffe ihr k&ouml;nnt mir da etwas weiterhelfen. \r\n\r\nmfg Vampie1","replies":[{"poster":"Ireliα","date":"2016-02-09T17:54:13.431+0000","up_votes":2,"down_votes":0,"body":"Was du beschreibst ist weniger ein Problem deiner Items sondern mehr deiner Spielweise.\n\n1.) Die meisten Adc's sind schwache Duellanten. Dies verstärkt sich nochmal um ein Vielfaches wenn man nicht richtig kiten kann. Zur Erklärung wenn du des englischen mächtig bist:\n\nhttps://www.youtube.com/watch?v=dgMMxTofZ5A\n\n2.) Splitpushen (Alleine auf eine Lane gehen und dort in Richtung der gegnerischen Tower pushen) ist nur in wenigen Situationen als Adc sinnvoll. Das überlässt man im Regelfall den anderen Rollen. Sie sind im 1v1 viel stärker und haben häufig auch den besseren Escape\n\n3.) Wenn man Slitpusht braucht man Vision auf das gegnerische Team. Entweder musst du es direkt sehen oder das Gebiet in dem du pushst muss so mit Wards ausgeleuchtet sein, dass du Gegner rechtzeitig sehen kannst und noch die Möglichkeit hast abzuhauen.\n\n4.) Sivir ist mit ihrer Ultimate und ihrem Aoe Schaden viel besser in Teamfights aufgehoben als im Splitpush. Hier gilt für den Anfänger immer nur das anzugreifen was dir am nächsten ist. Versuche nicht den gegnerischen Adc zu fokussieren sondern die Ziele die dich töten wollen.\n\n5.) Auf der Seite Replay.gg kann man seine Spiele ohne Anmeldung o.ä kostenlos aufzeichnen lassen. Wenn du das machst und die Leute hier im Forum bittest einmal über dein Game zu schauen könnten dir Sicherheit wertvolle Tipps gegeben werden :)","replies":[{"poster":"Vampie1","date":"2016-02-09T18:09:06.641+0000","up_votes":1,"down_votes":0,"body":"Dupree0991^^ haha, läuft soweit ganz gut so^^ aber giebt mit sicherheit besseres XDD\n\nbin leider mit english nicht so auf dem laufenden... leider , aber bin dabei^^ leider sagt mir das video nicht all zu viel...","replies":[{"poster":"Ireliα","date":"2016-02-10T16:46:31.760+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Vampie1,realm=EUW,application-id=Wj1wcocU,discussion-id=VjdmXX0w,comment-id=00030001,timestamp=2016-02-09T18:09:06.641+0000)\n>\n> Dupree0991^^ haha, läuft soweit ganz gut so^^ aber giebt mit sicherheit besseres XDD\n\nDie Effekte mancher Items verstärken sich gegenseitig. Um Als Adc guten Schaden zu machen braucht man Angiffsschaden, Angirffsgeschwindigkeit und eine Erhöhung der kritischen Trefferschchance.\nDeswegen baut man normalerweise am Anfang {{item:3031}} oder {{item:3508}} . Um die Skalierung in Gang zu bringen geht man jetzt auf Angriffsgeschwindigkeit + noch mehr Kritchance mit einem von diesen {{item:3087}} {{item:3046}} {{item:3094}} {{item:3085}} .\n\nAb jetzt hast du Schaden und fängst auf fortgeschrittenerem Niveau an situativ auf das Spiel zu reagieren. Standardmäßig wäre wohl jetzt Lebensraub mit{{item:3072}} . Das lässt dich länger kämpfen da du Schaden gegenheilst und verleiht dir dazu einen Schild um Burst besser überstehen zu können.\n\nDu stellst von nun an eine Gefahr dar und deine Gegner werden früher oder später anfangen Rüstung zu bauen um mit dir umgehen zu können. Deine Antwort darauf wäre {{item:3036}} \n\nSpätestens jetzt hast du mehr als genug Schaden und du suchst nach Möglichkeiten in einem Kampf länger zu überleben, da bieten sich vor allem diese Möglichkeiten: {{item:3102}} {{item:3026}} {{item:3140}} {{item:3053}} \n\n\nBehalte auf jedem Fall im Kopf, dass es nichts bringt nur viel Schaden auszuteilen wenn du nicht in der Lage bist im Kampf etwas zu überleben. Tod machst du keinen Schaden.\n\n\n> \n> bin leider mit english nicht so auf dem laufenden... leider , aber bin dabei^^ leider sagt mir das video nicht all zu viel...\n\nDas ist auch kein Problem, mit so etwas muss man vor Gold/Platin Niveau auch nicht anfangen. Falls es dich trotzdem interessiert, hier nochmal etwas auf Deutsch dazu:\nhttps://www.youtube.com/watch?v=TVJhIcrhv3w","replies":[]}]},{"poster":"Bergelmir32","date":"2016-02-09T17:58:25.465+0000","up_votes":1,"down_votes":0,"body":"Du hast dir wohl nicht angeschaut was er so baut^^.\nDorans > Trippel BF > double PD > Ausbau IE","replies":[{"poster":"Sergeant Hill","date":"2016-02-10T05:12:31.818+0000","up_votes":1,"down_votes":0,"body":"Wo sieht man eigentlich, was er baut? Wenn ich auf seinen Spielverlauf klicke, dann wird mir angezeigt, dass er noch keine Ranked Spiele gemacht hat und dass ich mit ihm befreundet sein müsste, um seine Normals zu sehen.{{summoner:3}}","replies":[{"poster":"Bergelmir32","date":"2016-02-10T07:25:34.755+0000","up_votes":1,"down_votes":0,"body":"lolking.net oder op.gg > Name eingeben > fertig","replies":[]}]}]}]},{"poster":"CLT Key","date":"2016-02-09T17:32:52.755+0000","up_votes":2,"down_votes":0,"body":"{{item:3508}} {{item:3006}}  {{item:3094}} {{item:3031}} {{item:3072}} {{item:3026}}","replies":[]},{"poster":"Bergelmir32","date":"2016-02-09T17:41:19.500+0000","up_votes":1,"down_votes":1,"body":"1./2.{{item:3508}}  oder {{item:3031}} danach das was du von den beiden noch nicht genommen hast.\n3.{{item:3072}}  oder {{item:3812}} \n4.Eines der Items das sich aus {{item:3086}} baut, oder eines der Items das sich aus {{item:3035}}, oder {{item:3071}}, oder{{item:3142}}.\n5. Eines aus 3. oder 4. welches du noch nicht hast oder eines davon {{item:3139}} {{item:3022}} {{item:3065}} {{item:3143}} {{item:3102}} {{item:3156}} {{item:3026}} {{item:3053}} \nIrgendwann zwischendurch Schuhe.\nJe nach Spiel kann es sein das eines der unter 5. aufgezählten Items schon früher geholt werden sollte aber in Großen und Ganzen solltest du damit eigendlich erstmal recht gut fahren.\nItems doppelt kaufen sollte man nur wenn man ganz genau weis was man da tut.\n\nAnsonsten solltest du mit Sivir versuchen den gegener ersteinmal mit Q und W Schaden zu machen bevor du dich auf einen direkten Kampf mit ihnen einlässt.\nGrade bei Fernkämpfern solltest du versuchen die Distanz grade zu Nahkämpfern auch zu wahren, also angreifen weglaufen wieder angreifen etc. Das nennt sich Kiten kannst du gerne mal bei Youtube suchen wenn du mehr darüber wissen willst.","replies":[{"poster":"Sergeant Hill","date":"2016-02-10T04:22:46.772+0000","up_votes":1,"down_votes":0,"body":"Warum holst du dir erst so spät ein Attackspeed Item? Die geben 30% oder sogar bis zu 45% mehr Attackspeed, also 30% oder 45% mehr Schaden. Es ist zwar richtig, dass Sivir viel Schaden mit ihrem Q macht, aber in der Zeit, in der das Q auf Cooldown ist muss er so viele Autoattacks wie möglich rausbringen. Außerdem hilft Attackspeed ungemein beim Lasthitten. Und er kriegt ja außerdem eine erhöhte Critchance und eine Ability dazu. (Falls dir meine Meinung nicht reicht, die LCS Spieler bauen auch alle sehr früh Attackspeed. http://probuilds.net/champions/details/Sivir)  Ich würde ganz stark zu folgendem Itembuild raten:\n1.) {{item:3508}} \n2.) {{item:3006}} \n3.) {{item:3094}} \n4.) {{item:1053}} \n5.) {{item:3031}} \n6.) Das {{item:1053}} zu entweder {{item:3072}} (gegen weiche Ziele) oder {{item:3153}} (gegen Tanks mit viel Leben) weiterbauen\n7.) Eines der defensiven Items, die du bei 6. genannt hast.\n\nNatürlich kann man dieses Build ein bisschen abwandeln, aber ich denke, dass es eines der besten ist, wenn man mit ADCs noch nicht so gut ist. Das frühe Vampirische Zepter hilft, wenn man sich zwischendurch noch mal heilen muss. Dadurch, dass man so viel Crit baut, ist man auch noch im Lategame gut. Und die Rapid Fire Canon hilft außerdem dabei, die geringe Range von Sivir auszugleichen. Stattiks braucht Sivir nicht, weil sie ja sowieso sehr guten Waveclear hat. Und Phantomdancer ist sehr teuer und trotzdem schlechter im Early und Midgame. Und man kauft sich ja das Attackspeed Item sehr früh, also ist Phantomdancer eher eine schlechte Wahl (es sei denn, man will unbedingt diese Passive haben).","replies":[{"poster":"Bergelmir32","date":"2016-02-10T08:04:54.660+0000","up_votes":1,"down_votes":0,"body":"Mit Aussagen wie 30% mehr AS sind gleich 30% mehr Schaden wäre ich vorsichtig. Ich bin mir relativ sicher das das wenn man es nachrechnet nicht stand hält.\n\nSivir ist AD Caster, sie bekommt AS von der Passiven ihrer Ult wärend ihr W aktiv ist, was mit CDR alle 3 bis 4 Sekunden der Fall ist. Bis sie mal eine gescheite Menge AD aufbaut damit ihre Fähigkeiten, die sie als AD Caster ja schön und oft einsetzten soll, ordentlich Schaden machen dauert bei deinem Vorschlag doch ein ganzes Weilchen.\nBei deinem Vorschlag wird das Vampierische Zepter auch nicht eher gebaut als bei meinem, bzw sogar noch später.\nWarum allen so einer auf die RFC abgeht kann ich nicht nachvollziehen. Sie hat die schlechtesten Stats der 4 AS/Crit Items. Wo sie wirklich gut ist, ist das Sieging, nichtmal das Türme einreißen sondern vorallem das Belagern, dadurch das man aus relativ sicherer Entfernung seinen Verstärkten AA drauf machen kann und sich dann wieder zurück ziehen, wobei diese \"sichere Entfernung\" in Sivirs Fall Caitlyns Grundreichweite ist. Ansonsten noch ein bisschen das Poken, wobei auch da wieder Sivir nur auf Caitlys Grundreichweite kommt mit RFC up. Der On-Hit Schaden ist auch nicht so überragend, wenn ich mit SS crite mache ich genauso viel und wenn ich IE dazu hab sogar mehr, ganz davon abgesehen das ich mit SS bis zu 5 Gegner treffen kann, was potenziell 500 ( 1000, 1250) Schaden sind im Vergleich zu 200 und das noch vor den Buffs zu SS und Nerfs zu RFC in diesem Patch.","replies":[]}]}]},{"poster":"Vampie1","date":"2016-02-09T18:05:04.067+0000","up_votes":1,"down_votes":0,"body":"Hey :) danke schonmal an alle für die schnellen antworten :)\n\nhabt mir schon mal etwas geholfen:) oke eher teamfights, geht kla ^^\n\naber wie ich jetzt am besten die rüstung aussuche weiß ich leider immer noch nicht... wieso wesshalb warum^^ auf was genau soll ich eher gehen? schnelligkeit, stärke, oder was ganz anderes^^ und wenn warum, was bringt es genau. bin leider in dieser art game ein totaler neuling^^ viele sagen mach es so oder so, und dann doch wieder so, aber keiner sagt mir warum genau das der beste weg sein könnte^^ \n\nwill halt auch n verstehen warum ich was mache und so \n\nmfg  Vampie","replies":[]},{"poster":"BloodyVampir","date":"2016-02-09T17:36:36.836+0000","up_votes":1,"down_votes":0,"body":"Ich bin zwar kein ADC Main. Aber {{champion:15}} ist von Natur aus sehr schwach in einem 1v1 und generell auch ein sehr Utility lastiger AD-Carry. Wie gesagt, ist ADC nicht mein Fachgebiet, aber ihre Stärke liegt in den Teamfights. \nSie ist in der Lage ihr komplettes Team zu unterstützen und mit der Q und W jede Menge AOE Schaden auszuteilen, deswegen würde ich dir empfehlen dich mit dem Team zu bewegen und auf die Teamfights hinzuarbeiten. Mehr kann ich dir dazu auch nicht sagen, aber ich hoffe ich konnte dir trotzdem ein wenig helfen. \n{{sticker:slayer-jinx-catface}}","replies":[]}]}