{"poster":"Teh Song","date":"2016-11-22T02:59:58.142+0000","title":"If you're going to get rid of item sets, just get rid of items altogether.","subforum":"Client Discussion","up_votes":12,"down_votes":1,"body":"No I don&#039;t actually want them to get rid of items. I want my item sets back.\r\nWith the item sets being stolen from us, it actually kind of feels like they did remove items though.\r\n\r\nWhenever I found I sufficiently enjoyed and played a champion, I would spend X amount of time carefully making them a custom item set. I would have the champion&#039;s wiki up, test stuff in bots, customs, and eventually norms, and eventually work down to the defined items I used on that champion. There were even some champions that I had narrowed down to 6 constant items, because they didn&#039;t have the need for situational items as I played them.\r\n\r\nAnd now they&#039;re gone. For no valid reason.\r\n\r\n&quot;Just buy what you used to buy-&quot; I don&#039;t KNOW what I used to buy. I spent all that time finalizing these item sets, so I no longer had to actually look at what I was buying, I just had to get click the right spot in the right tab. After enough time, I forgot what the items I was buying actually were, I just knew I chose them carefully, so I didn&#039;t need to worry about it anymore.\r\n\r\nI don&#039;t want to have to pick things out of the entire item pool every time I go to buy something, I want to be able to go &quot;Oh, I&#039;m in this situation, I&#039;ll take this predefined choice I made and have ready for this situation&quot; like I used to do. Now, even if I get myself to memorize specific items, I still have to search them too, which takes valuable seconds I might not have, and I&#039;m not the best at memorization to begin with.\r\n\r\nI want item sets. And I&#039;m far from the only one.\r\n\r\nThere was no valid reason to remove them.\r\n&quot;Not many players were actually using the feature.&quot;\r\nYea, I read that too. I could repeat myself.\r\n\r\nPut them back in.","replies":[{"poster":"GáyChúngüs","date":"2016-11-23T01:36:19.616+0000","up_votes":3,"down_votes":0,"body":"They didn't REMOVE anything. They were planning on not adding them back, but after the initial backlash, they said they were re-discussing it. I guarantee they will be back. BUT, not until near the end or after the beta.","replies":[]},{"poster":"Reviport","date":"2016-11-23T18:03:19.599+0000","up_votes":1,"down_votes":0,"body":"Riot disappoints me yet again...\n\nPlease- the custom item builds are my favorite feature added in the past 3 years. I play league since preseason 1 on this account and I always had to use third party programs to do item builds but since you guys implemented it I was so happy and I used it every day for all my theory crafting and builds! I can't imagine to play again with mods to client or other third party applications and spreadsheets for all custom fun builds. :/ I really need it!!!!\n\nVery inconsistent, lazy, unorganized, unfair, opinionated decision making. Get it together Riot!","replies":[]},{"poster":"ForRift","date":"2016-11-22T18:01:13.038+0000","up_votes":1,"down_votes":0,"body":"they are removing them they just haven added them beacuse \"its not priority\".","replies":[]},{"poster":"High Bliss","date":"2016-11-22T16:02:21.145+0000","up_votes":1,"down_votes":0,"body":"I don't know why the heck they removed the item sets from new client... I literally went to make an item set yesterday and spent around 20 minutes trying to find it because I figured I missed it, before coming to terms with the fact that they took it out. I only used it a handful of times, and albeit not many may have used it, but those who did use it were using it because it worked for them. Why take out something like this? It couldn't have taken up that much space considering how big the game itself is, and taking it out only shows how lacking you were willing to code it into the new client. I'm willing to bet they tried, experienced some sort of bug/glitch with new items, and said \"aw well who cares, not worth fixing\" and gave us these bs excuses. \n\nDon't let your game start dying Riot :P","replies":[]},{"poster":"Strad","date":"2016-11-22T07:17:27.079+0000","up_votes":1,"down_votes":0,"body":"I know it sucks man... But you might have to go the old fashion way since it doesn't seem Rito is going to be changing their mind... In the long run it will probably benefit you to learn the items by name and know exactly what every item does without having to look at anything but the icon.\n\nBut having invested that time into it, I feel you. And I feel your pain man. Oh the feels...","replies":[]},{"poster":"TheSpikey","date":"2016-11-22T03:45:40.100+0000","up_votes":1,"down_votes":0,"body":"Exactly! I built in-depth item sets for all of my main picks! Stop dropping the ball, Riot!","replies":[]}]}