{"poster":"Noobinho","date":"2016-02-21T19:24:10.301+0000","title":"Video fuer Youtube aber  wie?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":1,"body":"Guten Abend LoL Com,\r\n\r\nich habe mich jetzt das Wochenende damit beschaeftigt, wie ich am besten Videos fuer Youtube erstellen kann. Aber irgendwie ist alles nicht so das Wahre. Ich wuerde gerne die Videos downloaden aus der spectator mode. Wie mache ich das? Denn wenn ich es aus meinem Bildschirm aufnehme, dann ist das gesamte Spiel auf mich bezogen, was vielleicht nicht so interessant ist.\r\n\r\nVielleicht koennt ihr mir ein paar Tipps geben, mit welcher Software man arbeiten sollte und wie man am besten Spiele downloadet.","replies":[{"poster":"Maíko","date":"2016-02-21T23:04:10.822+0000","up_votes":1,"down_votes":0,"body":"LoL Summoner Information wäre auch ein Weg es aufzunehmen.\nhttp://www.leaguelsi.com/\n\nEs wird von Riot unter der Kategorie \"COMMUNITY HIGHLIGHTS\" angeshen.\nHeißt, sie wissen das es existiert und sie betrachten es als eine große Errungenschaft der LoL-Community.\n\nAber natürlich wie bei jedem anderen Drittanbieterprogramm ist es Benutzung auf eigene Gefahr.\nZurzeit ist es erlaubt, jedoch können jederzeit Features hinzukommen welche gegen die Regeln verstoßen und zu einem Ban führen.\n\nhttps://developer.riotgames.com/","replies":[]},{"poster":"Rucking Fiot","date":"2016-02-21T20:27:30.400+0000","up_votes":1,"down_votes":0,"body":"Installier dir Baron replays... nimmt automatisch im hintergrund auf ^^ natürlich im spectator mode :D","replies":[]},{"poster":"SoloQisMentlBoom","date":"2016-02-21T19:28:08.048+0000","up_votes":1,"down_votes":0,"body":"Ist bei mir schon etwas länger her, aber ich habe damals immer Baronreplay benutzt. Leider hatte es irgendwann nichtmehr funktioniert, aber hab von einigen Leuten gehört, dass es wieder funktioniert.\n\nDas speichert jedes deiner Spiele, ohne das du etwas machst. [Das müsste die Downloadseite sein.](https://ahri.tw/en/Download/)","replies":[]},{"poster":"TerrorRaven","date":"2016-02-21T19:26:53.948+0000","up_votes":1,"down_votes":0,"body":"Versuch mal replay.gg, da brauchst du nicht mal ein Programm dafür. Alternativ geht auch Skinspotlight Replay, aber das ist nicht 100% zuverlässig.","replies":[]}]}