{"poster":"RR FâCe","date":"2016-04-25T22:36:26.823+0000","title":"3v3 Teamrank Matchmaking","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":1,"body":"So langsam versteh ich warum kaum noch 3v3 Rank Teams unterwegs sind. Warum? \r\nIch hatte heut 4 Games mit meinem Team dass zur Zeit Gold V eingestuft ist. \r\nErster Gegner Gold I Team. Das mag in Ordnung sein da wir ja schon eine hohe Winraten hatten und dadurch auch gegen bessere Teams spielen m&uuml;ssen. Dieses Spiel haben wir verloren.\r\n\r\nZweiter Gegner.... und das schie&szlig;t den Vogel ab. Einer war Dynamic Queue Master und in 3v3 auch. Seine Teammitglieder waren high diamond(Dynamic Queue). Einer war dazu high diamond in 3v3 und der andere..... Challenger 300 Punkte. WIE?!?!?!!?!?! Haben wir auch verloren &gt;.&gt; wer h&auml;tt&#039;s gedacht.\r\n\r\nDritter Gegner Diamond(Dynamic Queue) und Platin III 3v3. Super fair: Gold V gegen PLat III (nach 2 Niederlagen). Wieder Niederlage....\r\n\r\nVierter Gegner HIGH DIAMOND (DYNAMIC QUEUE) W....T.....F. Plat 3v3.\r\nDanach wars meinem Team einfach zuviel.\r\nIch wei&szlig; dass es nichts &auml;ndert wenn ich es hier reinschreib....aber der Frust muss irgendwo raus XD","replies":[{"poster":"D4RKEVA","date":"2016-04-28T12:19:44.498+0000","up_votes":1,"down_votes":0,"body":"Das liegt daran das die normale elo 0 mit der 3v3 zu tun hat!\n\nUnd das es wenige teams gibt ^^\n\nBeides führt zu sowas!\n\nAber man lernt davon also kopf hoch ich spiele auch häufiger gegen high dia im 3v3 und habe insgesamt(auf mehreren accounts in 2 season) nur 2 looses von 30 games","replies":[]},{"poster":"Pure Cynicism","date":"2016-04-26T08:45:27.303+0000","up_votes":1,"down_votes":0,"body":"Geht uns genauso. Wir sind im Team Bronze I und DynQ zwischen Silber II-V. Wir spielen oft gegen Platinum-, manchmal auch gegen Diamond-Spieler. Umgekehrt hatten wir auch schon Gegner, die völlige Anfänger auf 3-3 waren und die 20-0 gestompt wurden. Hat denen wohl auch kaum Spaß gemacht. Gegner, die unser Niveau haben, haben wir echt selten.\n\nJa, das Matchmaking ist echt im Eimer. Riot investiert halt null in 3-3. Ich befürchte, dass 3-3 als nächstes der Rationalisierung zum Opfer fallen wird.","replies":[]}]}