{"poster":"LFD Peiro","date":"2015-06-06T15:11:39.399+0000","title":"Ist es so schwer ein Game fertig zu spielen","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"Leute mal so ne Frage was mich zur Zeit nervt . Wieso spielt niemand mehr ein game sobald man mal was wei&szlig; ich 10 kills hinten ist. Immer afk in der Base stehen und rumheulen das das ned zu gewinnen ist. Das ist erst seit der Season so wieso was hab ich verpasst. Ich versteh das einfach ned entweder man spielt oder man l&auml;sst bleiben ( bevor man ein game startet ) aber die Devise never surrender gibts in lol wohl nicht mehr.","replies":[{"poster":"Judaz","date":"2015-06-08T13:16:55.751+0000","up_votes":2,"down_votes":0,"body":"Manche spiele laufen wirklich schlecht und man will surrendern ich kenn des selber aber inzwischen ist es mir so oft passiert das nen game des ich abgeschrieben habe dochnoch gewonnen wurde das ich wirklich probiere spiele fertig zu spielen. Im late game kommt es oft nur auf diesen letzen team fight an und wenn man dann die gegner aced und adc + 1 tank noch leben kann man teilweise finishen ohne das dafür nen inhi tower down war.\n\nGefeedete Leute neigen einfach dazu zu overextenden oder total rücksichtslos zu spielen weil sie denken dass sie sowieso nichtmehr verlieren können.\n\nDeshalb mein Rat probieren fertig zu spielen auch wenn man verliert nen spannendes 50 min game macht mehr spaß als 2 mal die gegner in 20 min zu stompen!! ( DIe 10 min differenz sind champ select lade bildschirm und Endscreen)","replies":[]},{"poster":"malleusmintaka","date":"2015-06-06T15:31:52.175+0000","up_votes":2,"down_votes":1,"body":"Weil never surrender einfach manchmal falsch ist. Wenndas Team negativ ist etc. WILL man nciht mehr gewinnen, sondern eine neue Runde machen. Das ist genauso zu respektieren wie du willst, dass man deine Ansicht respektiert.","replies":[{"poster":"LFD Peiro","date":"2015-06-06T17:18:59.089+0000","up_votes":1,"down_votes":0,"body":"Kla das versteh ich aber nach 5 Minuten ?","replies":[{"poster":"malleusmintaka","date":"2015-06-06T17:29:22.073+0000","up_votes":1,"down_votes":0,"body":"vielleicht haben sie einen schlechten tag, vielleicht gibt es einen besonderen grund, dass sie surrendern wollen, z.b. dass sie wegmüssen etc.  \nsie es einfach so: du stehst über so profanen dingen :)","replies":[{"poster":"Forunes Of War","date":"2015-06-06T19:20:08.337+0000","up_votes":1,"down_votes":0,"body":"Es stimmt aber wirklich. Fällt mir auch in letzter Zeit auf. Von 10 spielen die ich spiel werden ca. 6 surrendert. Egal ob von uns oder den Gegnern. Bei mir wird es immer seltener das n Spiel mal 50 min dauert oder 40..","replies":[{"poster":"malleusmintaka","date":"2015-06-07T07:31:00.664+0000","up_votes":1,"down_votes":0,"body":"das kann ich nicht beurteilen, aber wenn ihr beide es sagt, dann wird es schon so sein","replies":[]}]}]}]}]},{"poster":"grimmiexlove64","date":"2015-06-08T11:06:03.156+0000","up_votes":1,"down_votes":0,"body":"Es geht nicht immer nur darum ob man vom Gold hinten liegt, die Gegner mehr Objekte haben oder nen Inhibitor, ob ein Gegner gefeedet ist oder ob mann ein schlechteres Matchup hat.  Allein zu sehen wie manche Leute Entscheidungen treffen lässt einem an gesunden Menschenverstand zweifeln.\n\nHatte gestern ein Spiel gehabt als ADC. Meine Top und Midlane haben ihre Lane verloren. Vom Matchup her hätten wir aber locker noch ein Comeback hinlegen können. Wenn ich dann aber sehe wie die, die ganze Zeit über gespielt haben wurde mir klar: Selbst im Late-Late Game mit unserem Champion-Vorteil werden wir das nicht gewinnen. Dafür sind die Mates einfach, (NETT AUSGEDRÜCKT!!!!) nicht gut genug im Vergleich zu denn Gegnern.","replies":[]},{"poster":"Hexalilon","date":"2015-06-07T18:41:05.260+0000","up_votes":1,"down_votes":0,"body":"Ist mir in letzter Zeit auch aufgefallen.. Manchmal sind wir noch total im unentschiedenen Midgame und plötzlich fährt die Kamera zum gegnerischen Nexus \"Victory!\". Und ich denk mir so \"wat\". \nTrotzdem habe ich es oft, dass es early 0-15 steht, all unsere Türme down sind und keiner kooperiert und weiter in Rage feedet und anderen die schuld gibt. Dann sag ich auch nichts groß und /ff'iere mal gerne wenn es offensichtlich nichts mehr wird. Aber definitiv nicht so schnell wie am Anfang beschrieben.","replies":[]},{"poster":"Nuix","date":"2015-06-07T10:48:23.364+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist sicherlich, gerade im Ranked, das zum Frust der Niederlage noch der Abzug der Ligapunkte hinzu kommt. Dieser wird ja leider nicht weniger wenn man ein Spiel zu ende spielt, anstatt nach 20 Minuten aufzugeben. Auch wenn ein sieg noch möglich ist, so ist er doch oftmals unwahrscheinlich, und viele wollen dann keine weiteren 30 Minuten mehr investieren, sondern haben das Spiel bereits (mental) abgehakt. Oft ist es auch so, das ein überlegenes Team dann zwar doch gewinnt, aber eben nicht innerhalb weniger Minuten sondern doch erst nach weiteren 20 oder 25. Das dauert den meisten dann zu lange. Würde das überlegene Team wirklich innerhalb von 10 Minuten den Sack zu machen, wäre dies sicherlich anders.","replies":[]},{"poster":"zuckerman","date":"2015-06-07T09:42:01.374+0000","up_votes":1,"down_votes":0,"body":"Jap ich wäre auch dafür das man nur 3 Spieler braucht damit der Surrender durchkommt, zumindest im normal Game könnte man das einführen im ranked Game kann es gerne bei 4 bleiben.","replies":[]}]}