{"poster":"Liliths","date":"2016-06-16T22:03:03.372+0000","title":"Gracias Riot Games","subforum":"Charlas Generales","up_votes":8,"down_votes":2,"body":"Hola, esto mas que ser un Post relevante solo una recopilaci&oacute;n de ideas que tengo acerca de Riot Games y su producto League of Legends.\r\nConoc&iacute; League of Legends durante 2012, aunque fue creo que reci&eacute;n en 2013 cuando lo descargue y jugu&eacute;. En aquellos momentos durante el evento de Freljord, yo empece a jugar y me pareci&oacute; un juego muy raro. Nunca hab&iacute;a visto un MOBA en mi vida y lo mas parecido que haba jugado a eso eran los RTS que francamente no tienen nada en com&uacute;n mas que la perspectiva de c&aacute;mara. Empece a jugar y me pareci&oacute; divertido, luego se abri&oacute; el servidor Latinoamericano y por Dios. Mis manos nunca hab&iacute;an conocido un Ping tan bajo. Los servidores andaban bien, aatrox estaba rotisimo, era todo espectacular y as&iacute; pasaron los a&ntilde;os.\r\n\r\nHoy 2016, sigo con la misma PC que en aquel entonces. Mi Notebook tiene ya 4 a&ntilde;os y sigue corriendo League of legends. Mis mas sinceras gracias a Riot por pensar en los tostadores del mundo :3 . Siempre han escuchado a la comunidad, y nos han dado un monton de cosas, modos de juegos. Cuando salio URF fue el mejor momento de mi vida en League of legends *-*. Nos dieron eventos que nos dieron ideas nuevas acerca de Runaterra, han equilibrado y desequilibrado tantas cosas a lo largo de los a&ntilde;os que no me alcanza la memoria para recordarlas, desde el la Lamparita con da&ntilde;o a ponys hasta el malzahar jungla, siempre cosas muy locas. Cuando parec&iacute;a que por fin todo hab&iacute;a quedado equilibrado, AH&Iacute; ESTABA RITO SACANDO UN NUEVO PARCHE DE TEMPORADA, con cambios a los suports, a los junglas, AL MAPA. Siempre pensaron en nosotros; si bien aun me discuto conmigo mismo por que. Me gusta pensar que en cierta forma les importamos, y que no es solo para poder vender skins :v (debo estar errado, espero que no).\r\nY No se como ser&aacute;n las cosas en Turqu&iacute;a o Brasil, en Rusia o Europa Oeste, pero siento que Riot esta cerca de nosotros. En fin tengo muchas cosas en mi cabeza con la etiqueta *Mi amor por Rito* pero transmitirlo en palabras es dif&iacute;cil jajaja.\r\nHay cosas que no entiendo como por que tardan tanto en hacer &quot;cambios&quot; o agregar cosas, no se si por falta de Personal y recursos o simplemente por ahorrar plata o tener mayores ganancias, pero solo quiero decir Gracias Riot, y espero que nosotros, los decenas de millones de jugadores, las cientos de millones de cuentas y ustedes, podamos tener muchos mas a&ntilde;os juntos.\r\n\r\nMe gustar&iacute;a conoces que piensan los dem&aacute;s miembros de la comunidad acerca de Riot Games, League of Legends y los A&ntilde;os de entretenimiento que nos han brindado.\r\n\r\n{{sticker:slayer-pantheon-thumbs}} \r\n\r\nPD: Donde pasan los cables de fibra &oacute;ptica &iquest;? Quiero poner una cerca anti-Alpacas &gt;:v\r\n\r\nNota: Aunque hice ciertas criticas a las pol&iacute;ticas de Riot Games, en todo momento que lo escrib&iacute; lo hice con una sonrisa en cara. En ning&uacute;n momento con la intensi&oacute;n de parecer ofensivo.","replies":[{"poster":"Voy Shaco","date":"2016-06-16T23:05:49.357+0000","up_votes":2,"down_votes":0,"body":"Qué bueno ver a alguien que nombra a Riot sin putear ni escribir Rito xD,está bueno que de vez en cuando le agradezcamos lo que hacen.","replies":[]},{"poster":"Daaaaaake","date":"2016-06-16T22:19:22.667+0000","up_votes":2,"down_votes":0,"body":"Mmmh... ahora que lo pienso cacho que en verdad nos han dado muchas cosas... los modos de juego.. diversas skins hermosas.. y no hemos valorado tanto lo bueno pero si lo malo xD... GRACIAS riot por TODO <333 {{sticker:zombie-nunu-hearts}}","replies":[]},{"poster":"Get Banned","date":"2016-06-17T03:19:11.185+0000","up_votes":1,"down_votes":0,"body":"Estoy muy de acuerdo en todo, Pero sigo esperando que dejen de nerfear a ryze hahaha {{champion:13}} {{item:3070}}","replies":[]},{"poster":"vaVav","date":"2016-06-16T22:14:20.766+0000","up_votes":1,"down_votes":0,"body":"De nada! {{sticker:slayer-jinx-catface}} \n\n-Riot Nova","replies":[{"poster":"God Won","date":"2016-06-16T22:17:31.269+0000","up_votes":1,"down_votes":0,"body":"¬u¬ esto es sospechoso :'u","replies":[]}]}]}