{"poster":"Liliths","date":"2017-03-19T20:32:12.515+0000","title":"¿No me pueden permabanear el chat?","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":25,"body":"Nomas digo, acabo de recibir mi 3er Baneo de chat en 4 a&ntilde;os, y la verdad es que ya estoy super saturado de todos, y no, no voy a parar de jugar. Ya estoy jugando mucho menos que antes y seguire jugando.\r\nPero no podrian Permabanearme el chat hasta nuevo aviso ? Nomas digo, no consigo nada teniendo el chat, solo flammeo (porque si tengo la posibilidad de flammear a un retrasado mental, lo voy a hacer, no vengo a hacerme el santo).\r\nTrato de no flammear, pero realmente apenas consigo nada.\r\nNo puedo hablar con algun rioter para que me baneen el chat durante, nose, 3 meses? 5? 6? quizas mas nose, el punto es que lo unico que consigo es perjudicar a otras personas y MAS IMPORTANTE arriesgarme a un baneo (porque siendo sincero es lo &uacute;nico que me interesa).\r\n\r\n\r\nNOTA: No voy a &quot;mutear a  todos&quot;, vos que estas leyendo sabes que no lo voy a hacer, yo se que no lo voy a hacer, todos sabemos que no voy a mutear a todos, todos sabemos que voy a hacerlo 3m, y cuando alguien comience a trollear voy a empezar a insultarlo igual.\r\n\r\nOtra cosa, me alegra en cierta forma que me hayan baneado porque comprueba que el sistema (aunque bastante mal) funciona. Aunque sigo pensando que es una MIERDA que solo te avisen que tu report funciono, si es la ultima partida que jugaste es decir.\r\nVos reportar en una partida X.\r\nSi a esa persona la Banean, solo vas a recibir el famoso cartel de &quot;tu reporte a funcionado&quot; si esa Partida X fue la ultima que jugaste, en lo persnal me parece UNA MIERDA ASQUEROSA eso de que solo se avise cuando es la ultima partida. Pero bueno, asi es Riot y aveces hace URF&#039;s y a veces hace Reclutamient Nemesis.","replies":[{"poster":"Charlôtte","date":"2017-03-19T21:09:52.073+0000","up_votes":4,"down_votes":0,"body":"https://youtu.be/QDslOEl6SeM","replies":[]},{"poster":"Vaendrys","date":"2017-03-19T20:53:42.583+0000","up_votes":4,"down_votes":0,"body":"Que poco autocontrol.\nEs como pedir que te metan en la carcel unos 5 o 6 meses, por si te cruzas a un boludo y te da ganas de cagarlo a piñas xD","replies":[{"poster":"Liliths","date":"2017-03-19T21:30:59.596+0000","up_votes":1,"down_votes":4,"body":"en la vida real creo que le dicen psiquiátrico.","replies":[]}]},{"poster":"Lucio22","date":"2017-03-19T20:36:12.417+0000","up_votes":2,"down_votes":2,"body":"...\n\nDe madurar, crecer y hacerse hombre ni hablamos, no?","replies":[{"poster":"Liliths","date":"2017-03-19T20:44:43.727+0000","up_votes":1,"down_votes":4,"body":"se se se, dale sermones a quien el importe.","replies":[{"poster":"martincarp","date":"2017-03-19T22:38:19.106+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Liliths,realm=LAS,application-id=PJAKt7ph,discussion-id=wVzX7hGi,comment-id=00010000,timestamp=2017-03-19T20:44:43.727+0000)\n>\n> se se se, dale sermones a quien el importe.\n\nComo que los sermones deberían importarte a vos... o sea, ¿para qué vienes al foro si no estás dispuesto a recibir opiniones de quienes pasamos por acá?\n\nSi no querés sermones ni que te digan que podrías hacer no vengas a un lugar público.","replies":[]}]}]},{"poster":"AuroraExecution","date":"2017-03-19T20:53:52.134+0000","up_votes":3,"down_votes":1,"body":"Ojala no te lo baneen y te terminen permabaneando la cuenta asi no flameas mas.","replies":[{"poster":"Nuke","date":"2017-03-19T21:22:39.972+0000","up_votes":1,"down_votes":0,"body":"Si le permabanean el chat tampoco flameara mas xD","replies":[]}]},{"poster":"vaVav","date":"2017-03-19T22:25:56.656+0000","up_votes":2,"down_votes":1,"body":"Mutea a todos.","replies":[]},{"poster":"LichaLopez9","date":"2017-03-19T20:34:27.816+0000","up_votes":1,"down_votes":0,"body":"¿Sabes que se puede desactivar?","replies":[{"poster":"Liliths","date":"2017-03-19T20:45:17.825+0000","up_votes":1,"down_votes":4,"body":"Si lo hago yo lo terminare activando.","replies":[{"poster":"LichaLopez9","date":"2017-03-19T20:48:20.899+0000","up_votes":2,"down_votes":0,"body":"Si Riot te haria caso, solo estaria haciendo las cosas mal, vos mismo tenes que aprender a controlarte, por muy dificil que parezca","replies":[{"poster":"Liliths","date":"2017-03-19T20:57:46.528+0000","up_votes":1,"down_votes":5,"body":"En ese proceso de aprendizaje solo perjudico a otros, y mas importante: Me arriesgo a un ban. Que caso tiene eso de aprender?","replies":[{"poster":"LichaLopez9","date":"2017-03-19T21:01:15.794+0000","up_votes":2,"down_votes":0,"body":"Aun asi no creo que sea la medida correcta, si vos estas como veo conciente de tu error, creo que deberias aprender de tus experiencias, si eso incluye que te permabaneen. Riot nunca te va a dar una restriccion de chat porque lo pidas","replies":[{"poster":"Liliths","date":"2017-03-19T21:30:11.247+0000","up_votes":1,"down_votes":5,"body":"Vos me estas diciendo que ME BANEEN PARA PERDER LOS 110 CAMPEONES QUE TARDE 5 AÑOS DE MI VIDA EN CONSEGUIR!?!?! Y QUERES QUE NO FLAMEE!?","replies":[{"poster":"El Silve","date":"2017-03-20T00:52:35.332+0000","up_votes":1,"down_votes":0,"body":"ya estas flameando de nuevo man y a la gente que te esta intentando ayudar, calma las sheshes :v","replies":[{"poster":"Liliths","date":"2017-03-21T21:09:29.404+0000","up_votes":1,"down_votes":0,"body":"El se merece mi flameo.","replies":[]}]},{"poster":"LichaLopez9","date":"2017-03-20T00:01:24.318+0000","up_votes":1,"down_votes":0,"body":"Flamear te llevo a poder perder todo eso, no es al reves.","replies":[]}]}]}]}]}]}]},{"poster":"Ulphurus","date":"2017-03-20T04:06:31.432+0000","up_votes":1,"down_votes":0,"body":"tranqui ya te va a caer el permaban, pero no del chat :v :v :v","replies":[]},{"poster":"SAD Katarina","date":"2017-03-19T22:36:22.011+0000","up_votes":1,"down_votes":0,"body":"A pesar de que sos flamer, queres cambiar y te respeto por eso. Deberias tener autocontrol, pero si no lo tenes, me parece una buena solución.\nEn el foro no te van a ayudar mucho, te recomiendo mandar un ticket al [Soporte](https://support.riotgames.com/hc/es-419) pidiendo que te lo permabannen.","replies":[]},{"poster":"Nuke","date":"2017-03-19T21:26:14.067+0000","up_votes":1,"down_votes":0,"body":"Me parece muy valiente de tu parte admitir tu defecto y querer cambiar. Mas es muy dificil para vos, por eso recurris a estas peticiones, pero no creo que se hagan realidad o que recibas una respuesta. Yo te diria que te desquites con toda la ira, rabia e insultos y cuando termines el mensaje, preciona \"Esc\" para cancelarlo. \n\nDe verdad, no se a que vienen los negativos si el tipo se esta portando fantastico.\n\n¡Un saludo!","replies":[]},{"poster":"Espada","date":"2017-03-19T23:14:34.201+0000","up_votes":1,"down_votes":1,"body":"que poco autocontrol, y si simplemente tomas esto como lo que es? un juego y te diviertes sanamente (?) ... tan dificil no es y te diviertes a miles xD {{champion:92}}","replies":[]},{"poster":"El Silve","date":"2017-03-19T20:42:24.259+0000","up_votes":2,"down_votes":2,"body":"Mutea a todos y no les prestes atención man, concéntrate en TU juego","replies":[{"poster":"Liliths","date":"2017-03-19T20:44:16.770+0000","up_votes":2,"down_votes":9,"body":"No lees el post?","replies":[]}]}]}