{"poster":"M0xx","date":"2019-09-04T22:09:38.379+0000","title":"El lol y la gente mayor","subforum":"Charlas Generales","up_votes":7,"down_votes":9,"body":"me parece una muy gran falta de respeto a la gente menor que juega este juego que tengan que soportar una gran variedad de insultos de parte de la comunidad toxica llena de gente con 40 a침os sin nada que hacer en la vida. Una frase t칤pica ya que aburre por ejemplo es : \"anda a dormir nene que ya es tarde\", esto es demasiado est칰pido, amigo SOS MAYOR e insultas a un nene EN UN JUEGO, pens치 un poco antes de hacer algo. ^^\r\nun saludo a la gente menor y suerte con sus rankeds\r\n{{sticker:slayer-pantheon-thumbs}} \r\n(gimenito jiji)","replies":[{"poster":"ElpistolaxD","date":"2019-09-04T22:12:42.574+0000","up_votes":12,"down_votes":0,"body":"Anda a dormir nene{{champion:245}}","replies":[{"poster":"M0xx","date":"2019-09-04T22:14:29.193+0000","up_votes":1,"down_votes":1,"body":"JASDJJASD","replies":[]}]},{"poster":"Sunflowers DI","date":"2019-09-05T08:39:52.389+0000","up_votes":9,"down_votes":0,"body":"쯇or qu칠 los nenes juegan a la madrugada? \nLas madrugadas nos pertenecen, esta en la constituci칩n lolera.","replies":[{"poster":"M0xx","date":"2019-09-05T12:02:43.513+0000","up_votes":2,"down_votes":0,"body":"tengo 14 a침os y juego a la madrugada porque hay m치s lvl, si me pongo a jugar a las 5 de la tarde no paro de perder sjjs","replies":[]}]},{"poster":"devilman10","date":"2019-09-04T22:14:39.543+0000","up_votes":4,"down_votes":0,"body":"/mute all y listo, no mas \"nene anda a dormir\"\n\nPD: deber칤an dejar de jugar de noche","replies":[{"poster":"M0xx","date":"2019-09-04T22:15:12.109+0000","up_votes":1,"down_votes":0,"body":"te haces el picante?","replies":[{"poster":"Shino Asada","date":"2019-09-05T22:02:26.657+0000","up_votes":1,"down_votes":0,"body":"la peor hora de jugar lol es en las madrugadas","replies":[]},{"poster":"devilman10","date":"2019-09-04T22:16:57.111+0000","up_votes":1,"down_votes":0,"body":"https://pbs.twimg.com/media/DY3VvHCXcAA3uYy.jpg","replies":[]}]}]},{"poster":"Crucifixor","date":"2019-09-05T20:51:46.935+0000","up_votes":5,"down_votes":1,"body":"Jajajaja si los mas flammer son los ni침os ratas como vos.. Tu comentario da pena y verg칲enza ajena","replies":[]},{"poster":"AMD Radeon RDNA","date":"2019-09-05T00:54:09.995+0000","up_votes":3,"down_votes":0,"body":"Eso es ver de un solo lado de la moneda y la otra parte? Tambien hay menores (o adultos que vos decis que se comportan como ni침os de 12) que flamean a mas no poder. \n\nPor ejemplo, mi caso, estoy afuera de casa todo el dia y a la noche juego. Quiero hacerlo tranquilo y pummmm me toca casi siempre los premades trolls. A que me refiero con \"troll\"? Que solo flamean y/o NO ayudan. Me da igual que salgan 0/900","replies":[]},{"poster":"Kadar","date":"2019-09-05T21:44:33.038+0000","up_votes":2,"down_votes":0,"body":"Pasa que en general, los nenes echan a perder la experiencia de un buen juego. {{summoner:4}}","replies":[]},{"poster":"Kylo","date":"2019-09-05T02:26:43.404+0000","up_votes":2,"down_votes":0,"body":"Nose si jueguen se침ores de 40 a침os... pero si que hay ni침os de 8 a 13 a침os aunque 칰ltimamente gracias a dios veo que se van a fortnite.\n\n*anda a dormir nene*","replies":[]},{"poster":"Kraftrad","date":"2019-09-04T22:29:37.985+0000","up_votes":2,"down_votes":0,"body":"Como sabes que es mayor? A lo mejor te lo dice y tiene 12 a침os.","replies":[{"poster":"Fl치nn","date":"2019-09-04T22:42:05.942+0000","up_votes":1,"down_votes":0,"body":"cuando tenia 12 lo dije as칤 que...eso jaja","replies":[]}]},{"poster":"Mikeel Cornish","date":"2019-09-04T22:17:44.748+0000","up_votes":1,"down_votes":0,"body":"Creen que por ya no ser ni침os mantenidos, pueden reprocharnos eso en la cara de una forma toxica y molesta. Peor  en ranked que si vas mal \"No se para que rankedo en fin de semana, pura rata\", y siguen y sigue. Lastimosamente que te digan eso no es baneable.","replies":[{"poster":"M0xx","date":"2019-09-04T22:20:11.039+0000","up_votes":1,"down_votes":1,"body":"si es baneable, entra en la categor칤a de flameo :D\n{{sticker:slayer-pantheon-thumbs}} \ngimenito","replies":[{"poster":"Mikeel Cornish","date":"2019-09-04T22:22:01.096+0000","up_votes":1,"down_votes":0,"body":"No. Es toxico pero no lo suficiente para un ban. Asi me han dicho en el soporte todas las veces que me flamearon usando eso.\n\n***no se como carajos adivinaban que era menor ***","replies":[{"poster":"M0xx","date":"2019-09-04T22:24:26.710+0000","up_votes":1,"down_votes":2,"body":"Pero si lo reportas por flammer en alg칰n momento si sigue como en ese mismo game (flamenado) lo van a tener que banear por acumulaci칩n de reportes 1000 iq\n{{sticker:slayer-pantheon-thumbs}} \ngimenito","replies":[{"poster":"Kraftrad","date":"2019-09-04T22:31:28.984+0000","up_votes":3,"down_votes":1,"body":"Eres de la nueva generaci칩n. Reportan todo y si cuela, cuela. Me hace acordar a muchas denuncias falsas de violencia de genero si cuelan cuelan. Casi me olvido los reportes falsos y mentirosos tambi칠n son reportables.\n\nPD: Se llama MARLOS!!!","replies":[{"poster":"OwenS","date":"2019-09-05T16:08:48.842+0000","up_votes":1,"down_votes":0,"body":"**@Dalas Nalgas** yo te invoco!!!","replies":[]}]}]}]}]}]},{"poster":"AMIINA","date":"2019-09-05T08:22:34.106+0000","up_votes":2,"down_votes":1,"body":"Ahora decirlo sin llorar","replies":[{"poster":"M0xx","date":"2019-09-05T12:03:54.275+0000","up_votes":1,"down_votes":0,"body":"?","replies":[]}]},{"poster":"vivakayn","date":"2019-09-04T22:24:09.475+0000","up_votes":3,"down_votes":3,"body":"eso pasa porque los ni침os juegan de noche, a esas horas todos los adultos quieren jugar sin soportarlos","replies":[{"poster":"AMIINA","date":"2019-09-05T08:20:55.652+0000","up_votes":2,"down_votes":1,"body":"Tal cual. 游녪游녪\nDespu칠s de las 22 hs deber칤a ser solo para mayores de 21 a침os. Q hacen a esa hora molestando ?\nY q tanto lloran si son peor q pirata borracho insultando los pubertos. ","replies":[{"poster":"MattNur","date":"2019-09-05T09:34:43.884+0000","up_votes":1,"down_votes":0,"body":"Eheheheh, yo soy el nene m치s sanito de todos","replies":[]}]}]},{"poster":"Jurecah","date":"2019-09-06T14:08:55.154+0000","up_votes":1,"down_votes":0,"body":"La verdad yo tengo 25 a침os pero juego lol desde hace casi 6 a침os! No uso yasuo lo odio jaja y peor cuando me toca un ni침o de 9 a침os yasuo M7 en mi team! Pero no flameo hay adultos que jugamos tranqui yo me despierto a las 7 y salgo  a laburary vuelvo a las 21 hs y a partir de las 22 me pongo a jugar la verdad molesta cuando trollean pero no flameo! Es mas trato de ayudar les digo no sigan las kill, que uno pushee top, wards en baron bueno tengo mucha experiencia por lo menos para intentar ayudar si se muere el top o el mid mas de 3 veces en 10minutos les digo farmea bajo torre o jg prioriza mid un rato o prioriza el gankeo a quien tenga mas kills ya sea si el top va 4/0 entonces asegurar esa linea y que pueda rotar rapido a mid o a bot bueno a todo yo juego adc sup y top y a veces llego muy cansado y en early me cuesta last hitear o kitear y me como uno o 2 ganks y me empieza a flamear alguien eso molesta si otro muere 4 veces yo le digo dale vos podes en late ganamos, aguanten farmeen, etc y si me rompen mucho las bolas me consta con decir una cosa nada mas gg jg o gg top y se rayan a no poder mas nervioso se pone y no le digo nada mas ya te dicen inutil, pajero, anda dormi nunca nadie menciona su edad pero es facil diferenciar un nenito que de alguien mayor la verdad! Jaja al menos yo pero la peor decision que pueden tomar y no les recomiendo es rankear en vacaciones de invierno o de verano lastimosamente ahi si repletos de ni침os ratas cometi el error y baje mucho jaja pero ahora estoy recuperandome juego una o 2 rankeds por noche pero molesta la verdad cuando  ese nene de 15 a침os que juega hace apenas unos meses se cree faker despues de ver un video en youtube y meterse a ranked con ese champ ayer y te trollea o flamea sin saber ese novato con quien esta hablando!! Ayer me toco un morde top en el equipo yo hiba miss adc estaba como 7/2 y estaba tranqui gane linea rote y gane mid y el morde flameando y mankeando me decia pajero que no ayudo el tipo se metia de una en tf como si fuera un mundo full tanke el vago tenia 180 de ap y nada mas al minuto 35 y un poco de armadura apenas hina 3/9 pero el no era el problema .. eso creia el, se creia el lider del team pero no sabia farmear y dale que decian los de bot y los de bot  tenia 88 crepps estez, yo hice mi trabajo y tire todo mid pero creeran que perdimos por culpa de este ya comenzaba a desmoralizar al team se gano lindo report obvio pero yo me centraba en objetivos y morian todos menos yo y entonces decia que yo no ayudo y bla bla boludo soy una miss yo desde atras con mi r mientras el morde le daba su r al garen full tanke Dios mioo y bue gg top jajaja pero solo le contestaba s sus insultos.. (si morde si con 100 de ap haces mas que yo )! Nada mas jajaj en fin no flameen y vayan a dormir nenes","replies":[]},{"poster":"Dat Morgana","date":"2019-09-06T12:58:24.742+0000","up_votes":1,"down_votes":0,"body":"Chileno traidor, and치 a dormir","replies":[]},{"poster":"qumladestructora","date":"2019-09-05T13:09:52.661+0000","up_votes":1,"down_votes":0,"body":"Es gracioso que se hagan los mayores cuando usan a Yasuo porque \"no tienen tiempo para aprender las mec치nicas de otro champ\"\nQue conste que yo tengo amigos que son mayores y son muy amables y buenos jugadores, as칤 que esto no es generalizado.\nSi son mayores y juegan LoL, disfrutenlo.\nSi son mayores y flamean en LoL, vayan a trabajar.","replies":[]},{"poster":"MatiasLy8","date":"2019-09-05T10:08:01.329+0000","up_votes":1,"down_votes":0,"body":"A m칤, mi pap치 me grita cuando me equivoco\n(Ya casi ni lo hace pero antes lo hac칤a mucho...)","replies":[{"poster":"M0xx","date":"2019-09-05T12:03:26.260+0000","up_votes":1,"down_votes":0,"body":"wtf xd","replies":[]}]},{"poster":"MuralamB","date":"2019-09-05T10:38:57.327+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=M0xx,realm=LAS,application-id=v7qsfXsE,discussion-id=lbNFsqEM,comment-id=,timestamp=2019-09-04T22:09:38.379+0000)\n>\n> me parece una muy gran falta de respeto a la gente menor que juega este juego que tengan que soportar una gran variedad de insultos de parte de la comunidad toxica llena de gente con 40 a침os sin nada que hacer en la vida. Una frase t칤pica ya que aburre por ejemplo es : \"anda a dormir nene que ya es tarde\", esto es demasiado est칰pido, amigo SOS MAYOR e insultas a un nene EN UN JUEGO, pens치 un poco antes de hacer algo. ^^\n> un saludo a la gente menor y suerte con sus rankeds\n> {{sticker:slayer-pantheon-thumbs}} \n> (gimenito jiji)\n\nLa mayor칤a de la gente que dice este insulto son nenes...","replies":[]},{"poster":"18 03 2007","date":"2019-09-04T22:13:28.490+0000","up_votes":1,"down_votes":0,"body":"Yo cuando salgo mal en una partida me flamean a full :(","replies":[{"poster":"iii칤","date":"2019-09-04T23:41:09.875+0000","up_votes":1,"down_votes":0,"body":"mutealos amigo, aunque salgas 0/10 no te tienen porque flamear","replies":[]},{"poster":"M0xx","date":"2019-09-04T22:14:37.706+0000","up_votes":1,"down_votes":0,"body":"bueno","replies":[]}]},{"poster":"Fl치nn","date":"2019-09-04T22:56:59.986+0000","up_votes":1,"down_votes":0,"body":"Realmente no es tan molesto.","replies":[]},{"poster":"Maito Gui","date":"2019-09-04T22:47:09.411+0000","up_votes":1,"down_votes":0,"body":"cuantas copas tenes?","replies":[]}]}