{"poster":"Durkio","date":"2017-10-11T10:20:35.671+0000","title":"Suspension within half an hour of buying RP for 50.00 EUR","subforum":"Player Behavior","up_votes":1,"down_votes":8,"body":"Hi Riot,\r\n\r\nPlease take your time to read this through instead of using a Zendesk answer, it would seriously mean alot to me.\r\n\r\nSo my account just got permanently suspended, and i think it is kind of harsh punishment for my actions (Logs attached). \r\n\r\nMy behaviour did improve since my last ban, and i no longer wish death and cancer upon people, since i do realize that it is kind of demonic behavouir, and i dont want to be that.\r\nI won&#039;t even type in the chat no more.\r\n\r\nWhile i can completely see and understand that my behaviour is not pretty, i think a perma ban is kind of harsh for the actions i comitted.\r\nI hope that you can maybe re-evaluate my ban.\r\n\r\nHere is where the real problem lies though: The ban i got came literally minutes after buying the biggest package of RP you can buy on credit card. I feel kind of robbed off, and i just spend 50 EUR on riot points, and i get banned after going to the Barber before i even manage to spend it. \r\n\r\nWould there be any chance of maybe getting the unspent RP transferred to a new account, i did understand what i did wrong, and i want to start a fresh account. But seriously i dont wanna get robbed off 50 EUR, thats a lot of money for me, way more than i should spend on any game banned or not. Since i do have more accounts it would mean a lot to me if the RP could be transferred over there, since i literally bought it within an hour of my ban, and has not even spended it yet.\r\n\r\n\r\nLogs: https://pastebin.com/6CWF79qb","replies":[{"poster":"Chermorg","date":"2017-10-11T16:15:03.882+0000","up_votes":3,"down_votes":0,"body":"If you spent literally none of the RP before you were kicked off with the ban, you ***may*** be able to get a refund. I have heard stories (but don't have any confirmation that I have handy) of players being issued \"goodwill\" refunds in cases like this. Riot isn't out to get you or piss you off, and so if you explain the situation in a support ticket they may refund the charge to you.\n\nNo guarantees, and I'd say it's honestly quite a bit less than 50/50 since it was still your own doing that got you the punishment, but it's the only chance you have so I figured I'd point you in that direction.","replies":[]},{"poster":"TrulyBland","date":"2017-10-11T10:39:54.680+0000","up_votes":3,"down_votes":1,"body":"In this very specific instance, I'd say it's fair enough to issue a chargeback to get your money back as you were indeed denied access to the thing you bought for reasons that happened actually before you bought them.\n\nThat said: I recommend **not** spending that on a new account. The fact that you bought RP after **that** game (presumably not anticipating any consequences for what was very toxic behaviour) shows that you seem to still have absolutely no idea what is or isn't tolerated by Riot.\nIf this is your improved behaviour (let alone your attempt at not even typing anymore) I can't really see any of your accounts safe from permabans.","replies":[]},{"poster":"Friendly Ram","date":"2017-10-11T16:22:59.602+0000","up_votes":1,"down_votes":0,"body":"https://support.riotgames.com/hc/en-us\n\ntry a support ticket and get back to us.","replies":[]},{"poster":"Jo0o","date":"2017-10-11T14:34:41.716+0000","up_votes":1,"down_votes":0,"body":"Holy shit, you spent entire games rotating through your teammates and finding ways to verbally harass and abuse them. These are extremely toxic logs.\n\nOh, you've improved past the point of literally wishing death and cancer upon your teammates for DARING to perform less-than-perfectly while playing a video game with you? GOOD JORB.","replies":[]},{"poster":"Dreamspitter","date":"2017-10-11T10:41:32.217+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Durkio,realm=EUW,application-id=ZGEFLEUQ,discussion-id=wvtLle3z,comment-id=,timestamp=2017-10-11T10:20:35.671+0000)\n>\n> Hi Riot,\n> \n> Please take your time to read this through instead of using a Zendesk answer, it would seriously mean alot to me.\n> \n> So my account just got permanently suspended, and i think it is kind of harsh punishment for my actions (Logs attached). \n> \n> My behaviour did improve since my last ban, and i no longer wish death and cancer upon people, since i do realize that it is kind of demonic behavouir, and i dont want to be that.\n> I won&amp;#039;t even type in the chat no more.\n> \n> While i can completely see and understand that my behaviour is not pretty, i think a perma ban is kind of harsh for the actions i comitted.\n> I hope that you can maybe re-evaluate my ban.\n> \n> Here is where the real problem lies though: The ban i got came literally minutes after buying the biggest package of RP you can buy on credit card. I feel kind of robbed off, and i just spend 50 EUR on riot points, and i get banned after going to the Barber before i even manage to spend it. \n> \n> Would there be any chance of maybe getting the unspent RP transferred to a new account, i did understand what i did wrong, and i want to start a fresh account. But seriously i dont wanna get robbed off 50 EUR, thats a lot of money for me, way more than i should spend on any game banned or not. Since i do have more accounts it would mean a lot to me if the RP could be transferred over there, since i literally bought it within an hour of my ban, and has not even spended it yet.\n> \n> \n> Logs: https://pastebin.com/6CWF79qb\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Geauxx","date":"2017-10-11T10:32:10.123+0000","up_votes":1,"down_votes":0,"body":"1. How long ago was your 14 day ban.\n2. in game 1 of the chat logs you flame and even add hate speech in there which riot has 0 tolerance for.\n3. You flame almost just as hard as the previous game.\n\nAlso saying \"he/she started it\" or \"he/she flamed me too\" doesn't mean you have a free pass to flame them.\n\n\n\nWhy even spend if you know you flame alot after having been banned for 14 days before?","replies":[]}]}