{"poster":"KIN Füme","date":"2017-02-02T00:16:50.150+0000","title":"Forgotten Email","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"It does indeed sound very foolish to forget the email that I synced up my account with, but it happened. Basically, my account that I made a post about (Ao Féng) before, and I recently sent in a ticket for the said account to try and recover the lost username and password. I have the Username now, and someone replied to me, CrunchyBonBon to be exact, that they sent it an order to have my password reset. But there's the problem, I already knew my password, just not the email and username. Now that it's reset, I can't login to my email (since I don't have it) and change it.\r\n\r\nIn the ticket I already sent in regarding this issue, I gave enough information to show it was mine (transactions, previously gifted champs, etc.) If you want me to prove more I can even give off the transaction ID's, or screenshots of my account gifting Ao Féng Yasuo/Aurelion Sol.\r\n\r\nI hope that you guys can tell me the email, as I've tried almost everything and it doesn't seem to work. I give you credit for giving me my username, but I don't know if giving out emails is a thing.\r\n\r\n(P.S. I also realized that on my ticket I sent in, I said Ao Shin instead of Aurelion Sol LOL)","replies":[{"poster":"Porocles","date":"2017-02-02T00:36:42.429+0000","up_votes":1,"down_votes":0,"body":"Not to worry, we can continue assisting.  Just reply to the specialist in your ticket, and we can look into updating your account information like the registered email.  Our account recovery team won't make changes without a shadow of a doubt that you're the owner, so you may be asked some more questions too.  Continue corresponding with your specialist!  Good luck!","replies":[{"poster":"KIN Füme","date":"2017-02-02T21:34:34.046+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Porocles,realm=NA,application-id=osqw6G4M,discussion-id=Q8OrZKra,comment-id=0000,timestamp=2017-02-02T00:36:42.429+0000)\n>\n> Not to worry, we can continue assisting.  Just reply to the specialist in your ticket, and we can look into updating your account information like the registered email.  Our account recovery team won&#x27;t make changes without a shadow of a doubt that you&#x27;re the owner, so you may be asked some more questions too.  Continue corresponding with your specialist!  Good luck!\n\nI've already sent in a response by just simply replying to the email sent to me. Hopefully that's what I was supposed to do, I don't want to wait forever on something that'll never come. Thank you!","replies":[]}]}]}