{"poster":"Ashiviere","date":"2016-05-22T07:55:19.245+0000","title":"Probleme in der SoloQ","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":1,"body":"Hey Leute,\r\nIch habe im Moment einige Schwierigkeiten in der SoloQ (bzw Dynamic Queue) weiterzukommen. Das soll jetzt &uuml;brigens kein Heulthread &uuml;ber die Elohell oder so einen Schwachsinn sein.\r\nIch bin Gold V (Mid/Jungle) und versuche aufzusteigen, doch ich schaff es nicht meine Spiele konstant zu gewinnen. Wenn ich meine Mitte bekomme ist das meistens so, das ich etwa 50 bis 80 Farm mehr habe als mein Gegner (bei der 20 Minute), aber irgendwie trotzdem nicht gewinne. Beim Jungle spiele ich bevorzugt Farm-Attackspeed Jungler, die aber seit dem es keinen Devourer, gibt Kacke sind (Ich mein man kann ganz offen sagen das dieser Bloodrazor einfach ein schlechtes Item ist, zumindest meiner Meinung und Erfahrung, die Stats sind einfach nicht schlecht).\r\nMeine Picks sind:\r\n\r\n- Kayle  (Mid/Jungle; Funktioniert in der Mitte ganz gut, mit Nashors Tooth, AS oder MRpen Stiefel, Rabadons und Lich Bane, sp&auml;ter noch Ryalis Kristallzepter, Leerenstab; Im Jungle aber eher nicht so gut, weil wie gesagt, der Bloodrazor ist kein gutes Item)\r\n{{champion:10}}-------{{item:3115}} {{item:3020}} {{item:3089}} {{item:3100}} {{item:3116}} {{item:3135}} --------{{summoner:4}} {{summoner:14}}\r\n{{champion:10}}-------{{item:1418}} {{item:3006}} {{item:3115}} {{item:3116}} {{item:3124}} {{item:3135}}--------{{summoner:4}} {{summoner:11}} \r\n\r\n- Vel&#039;Koz &amp; Lux (Bei Velkoz hab ich das Gef&uuml;hl, das gerade wenn die Gegner sehr Mobil sind, man ab dem Midgame &uuml;berhaupt nicht mehr machen kann. Vor allen ist die Neue Ult ja darauf ausgelegt das man erst 3 Stacks durchkriegt, und das schafft man bei weitem nicht immer. Bei den Stiefel variiere ich von den Geschwindigkeitsstiefeln, &uuml;ber die Zauberstiefel und die Ionenstiefel (Cooldownbotten). Zwischen Ludens, Stundenglas nehm ich mir das, was der Situation besser passt\r\n{{champion:161}} -------{{item:3165}} {{item:3009}} {{item:3089}} {{item:3116}} {{item:3285}} {{item:3135}} -------{{summoner:4}} {{summoner:21}} \r\nBei Lux kann das Letzte Item auch Rylais sein, je nachdem.\r\n{{champion:99}} -------{{item:3165}} {{item:3020}} {{item:3285}} {{item:3089}} {{item:3135}} {{item:3157}}--------{{summoner:4}} {{summoner:21}} \r\n\r\n- Master Yi (Jungle): Seit dem Bloodrazor hab ich &uuml;berhaupt keinen Plan mehr was ich auf dem bauen soll. Davor konnte man mit Devourer, Botrk und Youmus, oder Devourer Youmus bauen, und denn Rest tanky in beiden F&auml;llen, klappt aber nicht mehr richtig. Also funtioniert nur wenn man am anfang ein wenig feed bekommt, ansonsten gar nicht. Gegen die anderen jungler hat der 0 Chance.\r\n\r\n\r\nWollte hier so meine Picks vorstellen, etwa einen Plan von meiner Situation machen. Was mache ich falsch ist die Frage? Welche besseren Picks k&ouml;nnte ich machen, welche Builds? Ich spiel das Spiel auch zum Spa&szlig;, deswegen, spiel ich auch gerne die Champs oben genannt, aber ich komm mit den Picks (Vor allem Kayle und Yi) &uuml;berhaupt nicht weiter.\r\n\r\n\r\nHoffe Jemand kann mir Helfen, danke im Vorraus.\r\nMfG Ashiviere","replies":[{"poster":"play a faya","date":"2016-05-22T10:15:58.000+0000","up_votes":1,"down_votes":0,"body":"Yi war einer meiner Main Jungle vor 6.9, ich versteh dich also ;-)\nGanz ehrlich, spiel Yi nicht mehr, bis er wieder gebufft wird. Der Alpha-Strike Bug ist imo sogar noch schlimmer geworden, also lass es lieber.\n\nIch selbst bin derzeit Gold IV, also in einer ähnlichen Situation wie du.\nOhne ein Replay von dir gesehen zu haben, kann ich dir nicht wirklich sagen, was du flasch machst. Und genau hier liegt mein Tipp für dich. Wenn du ein Spiel verlierst, das ganz gut für dich gelaufen ist und am Ende doch verloren hast, dann schau dir das Replay an.\nSchau dir jede einzelne Situation im Spiel genau an,  was hättest du besser machen können?\nPositioning im Teamfight, Wards, Mapawareness, etc..\nItems und Runen sind imo zweitrangig, solange du auf einem offensiven Champ AD bzw. AP baust und auf einem deffensiven Champ Tankitems.\n\nSchreib dir nach jedem Replay den größten deiner Fehler auf, den du gemacht hast, und versuche im nächsten Spiel, das besser zu machen ;-)","replies":[]},{"poster":"Hibiki Yamazaki","date":"2016-05-22T18:11:28.531+0000","up_votes":1,"down_votes":1,"body":"ich verstehe euch voll und ganz als udyr spieler habe ich die volle breitseite abbekommen als ob sie den turtle stance und und phönix stance nicht genug genervt hätten wurde auch das runic echos zerstört befinde mich momenatna in einem tief aus dem ich nicht mehr rasukomme weil das spiel mir kein spaß macht . ich bin auch ein bisschen am verzweifeln was ich genau jungeln soll und wie ich mich usefull fühlen kann . ich riot schafft es den champ mal wieder auf forderman zu bringen weil momentan kannst du udyr in die tone hauen","replies":[]}]}