{"poster":"Sergius Slavic","date":"2017-07-25T14:57:24.849+0000","title":"[Support sucht ADC] Raus aus Bronze! Zusammen schaffen wir es :D","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Diese Elo ist einfach unm&ouml;glich... Da kommt man ja direkt auf den Gedanken neuen Acc hoch zu ziehen, um endlich aus der Bronze raus zu kommen.\r\n\r\nAber nein! Wir k&ouml;nnen es auch so schaffen. Ich suche einen ADC als Partner.\r\n\r\nWie ich es mir vorstelle und alles weitere besprechen wir entweder per Skype, TeamSpeak oder Whatsapp. \r\n\r\n\r\n\r\nFreundliche Gr&uuml;&szlig;e\r\n\r\nSergius Slavic","replies":[{"poster":"Killersnake","date":"2017-07-25T16:08:44.395+0000","up_votes":1,"down_votes":0,"body":"Hi ich bin Support main und habe mich von Bronze 5 bis Plat 5 (aktuell) hochgespielt.\nWenn du möchtest kann ich versuchen dir zu helfen","replies":[{"poster":"Sergius Slavic","date":"2017-07-26T12:46:36.933+0000","up_votes":1,"down_votes":0,"body":"Ich würde sehr gerne einige deiner Tipps in Gebrauch nehmen.\n\nWie kann ich dich erreichen? Wie ist dein Ingame Name?","replies":[{"poster":"Killersnake","date":"2017-07-26T23:03:58.333+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sergius Slavic,realm=EUW,application-id=ElKI1ocy,discussion-id=gqP0fwl8,comment-id=00010000,timestamp=2017-07-26T12:46:36.933+0000)\n>\n> Ich würde sehr gerne einige deiner Tipps in Gebrauch nehmen.\n> \n> Wie kann ich dich erreichen? Wie ist dein Ingame Name?\n\nMein ingamename ist Killersnake\nOder TheBlobfisch7 da könnten wir auch duoQ spielen","replies":[]}]}]},{"poster":"Arathorten","date":"2017-07-26T19:42:27.554+0000","up_votes":1,"down_votes":0,"body":"Ja das hier ist mein  Ingame Name. Kannst mich adden ^^\nMuss noch den Leave Buster meines Bruders abarbeiten <.<","replies":[]},{"poster":"Arathorten","date":"2017-07-25T16:00:31.248+0000","up_votes":1,"down_votes":0,"body":"Huhu Sergius,\n\nich bin wieder drum und dran wieder lol zu Spielen. Da ich eine Pause von einigen Jahren hinter mir habe werde ich sicher bei Bronze starten und mich wieder einlernen müssen. Wäre gut einen Partner zu haben und mit ihm gemeinsam zu wachsen.\n\nHabe früher ADC und Jung gespielt zur Not auch Top und Mitte. Mein Niveau war bei Gold rum was jetzt nichts mehr heissen soll xD \n\nLg Kevin","replies":[{"poster":"Sergius Slavic","date":"2017-07-26T12:48:43.893+0000","up_votes":1,"down_votes":0,"body":"Hallo Kevin,\n\nso sieht es auch bei mir aus, damals begann ich noch in Silber zu spielen, allerdings sind auch bei mir einige Pausen dazwischen und nun bin ich sehr aktiv und möchte auch erreichen und fürs erste dann zumindest aus Bronze raus.\n\nWie erreiche ich dich? Ist das auch der aktuelle Ingame Name? \n\n\nLg\nSergej","replies":[]}]},{"poster":"Jhin is Back","date":"2017-07-25T16:12:09.254+0000","up_votes":1,"down_votes":0,"body":"Hey Ich hätte auch interesse da ich die letzten atge auch nur am suchten war bin ich jetzt fast in gold zusammen packen wir des dann schon :) ich suche auch schon seit ewigkeiten einen neuen duo q partner da mein alter aufgehört hat und ich fast immer alleine spiele.","replies":[]}]}