{"poster":"OtakuBurrito","date":"2019-12-17T21:50:43.928+0000","title":"I'm offcially done playing league","subforum":"General Discussion","up_votes":1,"down_votes":5,"body":"Yeah I'll still joke around on the boards but I just got out of a game that literally broke my heart. So a few weeks back I ran into this person who would all chat racial slurs, add people after games to continue, and even link their stream and there were literally on there with a \"c-n board\" to show how many \"n\" they killed. So of course I reported it and guess what, nothing happened. Was a surprised? No. Nothing rarely happens. Riot allowed this individual to just continue. And I know they have been reported both on Riot and on Twitch. I ran into them when I was doing duos and flex and again everyone reported, and nothing happened. They're still streaming, they're still being racist, they're still doing what they please. They have multiple accounts they do this on. Riot honestly doesn't care. \r\n\r\nAnd not to bring race into this but idc what racial slur was used, the fact called someone a r- or a degenerate will get you in trouble faster than calling someone a porch n- or a j- soap box or spamming W- Power in chat and Riot does nothing. Then this added to the fact pro players can use racial slurs and only receive fines but calling someone a- gets you banned from Pro scene makes me honestly disgusted with playing this game. Riot doesn't allow people to police others and people are too scared to tell them to shut up because they don't want their account to get canned. It's just trash. Things like this wouldn't eb going on if, we still looked at the ENTIRE game chat log and saw that you have 9 people telling one person to stfu because they're way out of line and everyone agrees they need to be put in check. \r\n\r\nLeague is just another YouTube where the most insane and irrational things are considered bullying and punished harder and faster than people actually causing known harm to others. I just can't anymore. This shit is beyond fucking wack. I don't even care when people call me racial slurs because I know it comes from a place of ignorance it's just that in this situation the fact people telling someone to shut up are seen to be escalating a situation and therefore worse than the person spamming racial slurs in chat is really really REALLY disheartening.","replies":[]}