{"poster":"Matthu","date":"2018-03-14T16:57:13.033+0000","title":"Bajones de FPS","subforum":"Problemas Técnicos","up_votes":3,"down_votes":0,"body":"Hola, tengo una pc nueva: \r\nAMD 4-4000  APU with Radeon(tm) HD Graphics 3.00GHz\r\nMotherBoard Gigabyte F2A68HM-H\r\n4Gb de Ram Ddr3\r\nWindows 8.1 Pro\r\n1Tb Disco Duro\r\nAsus GeForce Gt 1030 2Gb Ddr5\r\nEl problema es que jugando tengo muchos cambios de fps, nose cual sea el problema pero he actualizado todo, hasta cambie de windows, corre a 90fps en base, al salir y llegar a linea tiene muchos cambios hasta llegar a 06fps, sube y baja constantemente!!!\r\nAyundenme estoy asi hace mucho, compre esta placa nueva pensado que era mi antigua Gt 730 2Gb ddr3","replies":[{"poster":"Ingratitud","date":"2018-03-14T17:03:49.535+0000","up_votes":2,"down_votes":0,"body":"Hola AphrooMath, como estas? Pueden ser muchas cosas, lo que lleva a una caída de FPS. Algo que puedes hacer para optimizar tu PC y poder ejecutar mejor el LOL es:\n\n* Bajar los gráficos del juego al mínimo.\n* Realizara un arranque en limpio, ya que debido a que puedes tener varios procesos ejecutándose, que podrían causar problemas (ejemplo bajar el rendimiento de tu pc).\n* También puedes ajustara las definiciones del antivirus y spyware para no tener problemas durante la ejecución del juego.\n\nMira este enlace https://support.riotgames.com/hc/es/articles/201761974#wq7 \n\nPor ultimo puedes comunicarte  con soporte técnico. Puedes mandar tu solicitud por aquí: \nhttps://support.riotgames.com/hc/es-419/requests/new\n\n{{sticker:slayer-jinx-catface}} \n\nEspero AphrooMath que puedas solucionar tu problema.","replies":[{"poster":"Matthu","date":"2018-03-14T18:28:08.269+0000","up_votes":2,"down_votes":0,"body":"Hola te comento: Me compre esta pc nueva con una gt 730 2gb ddr3, los fps son muy inestables y no se puede jugar porque llegan a 6 fps, cambie de windows 7 a 8.1 pro para ver si se solucionaba (seguia igual), compre otra placa gt 1030 2gb ddr5, (sigue igual)\nJuego con todo al minimo, ningun otro programa ni pc se estan ejecutando es ese momento, con mi internet en otra pc juego bastante bien, actualize los drivers... nose que mas hacer!","replies":[]}]}]}