{"poster":"Sephi51","date":"2016-11-23T21:56:12.649+0000","title":"Riot bannt für non-meta picks","subforum":"Allgemeiner Chat","embed":{"description":"Riot Games says they will perma ban Highest Mastery Points Singed, AdellaideSkyhart if he continues to play Support Smite Singed due to it negatively effected his team mates. He has been reported a number of times because of his non-meta playstyle. Do you think he deserves to be perma banned or even constantly suspended?","url":"https://www.youtube.com/watch?v=h3C4-pnMiGc","image":"https://i.ytimg.com/vi/h3C4-pnMiGc/hqdefault.jpg"},"up_votes":1,"down_votes":4,"body":"Das ist ja die gr&ouml;&szlig;te Frechheit &uuml;berhaupt, Riot zerst&ouml;rt schon seit langem nach und nach ihr Spiel, aber das!\r\nMan wird also daf&uuml;r gebannt, dass man nicht Meta pickt?\r\n&auml;h, Hallo? \r\nGehts noch?\r\nDein Team nicht zu beleidigen, nicht zu bedrohen, nicht absichtlich zu feeden oder verlieren, das ist alles logisch und nachvollziehbar.\r\nAber weil jemand Singed als support pickt? Das man seine Kreativit&auml;t auslebt, dass man versucht spa&szlig; zu haben in diesem kotz langweiligen Meta-Game, daf&uuml;r wird man fast perma bannt?\r\nSind da wirklich Menschen hinten am Werk?\r\nLeute die sich einbilden &quot;mitte&quot; zu sein, weil sie als erstes &quot;mid&quot; in den chat geschrieben haben und andere leute daf&uuml;r reporten, und Riot die dann bannt, das ist so ziemlich das niveau.\r\nIn dem Video wird erw&auml;hnt, dass der Singed entgegen der W&uuml;nsche der 4 anderen Spieler gehandelt hat.\r\nDas hei&szlig;t also wenn ich mit nem 4er premade team spiele, und wir wollen dass der random nach unserer pfeife tanzt wird das von Riot unterst&uuml;tzt? Ja? Wird der gebannt wenn wir in reporten, weil er nicht warmogs gekauft hat wie wir es wollten?","replies":[{"poster":"Megamaexx","date":"2016-11-23T22:19:20.564+0000","up_votes":7,"down_votes":0,"body":"Es ging dabei nicht um den Pick an sich, sondern um die Art und Weise. Er hat Singed als Support ausgewählt, hat Smite mitgenommen und ist Counterjunglen gegangen. Er kam also erst auf die Botlane, als er Stufe 2 war. Ich wette, würde so ein Spieler in deinem Team auftauchen und du wärest der ADC, würdest du ihn auch des Trollens bezichtigen. Eben an dem Punkt beginnt die Sache nämlich schwammig zu werden. Der ADC verpasst seinen Farm dafür, dass der gegnerische Jungler zurückfällt. \nDie Frage hier ist, lohnt es sich wirklich? Lohnt es, dass dein ADC so ca die ersten 10 Farm verpasst und früh zurück muss, wenn er doch mal versucht, lasthits zu machen? Sowas sollte eben abgesprochen sein. Das bedeutet nicht anzukündigen, sondern abzusprechen.","replies":[{"poster":"VERY ggwp","date":"2016-11-25T17:31:39.148+0000","up_votes":1,"down_votes":1,"body":"Nur weil der ADC alleine ist, heißt das nicht, dass er garnicht farmen kann. Dann muss er halt auf 1-2 Farm verzichten. Dafür ist der gegnerische Jungler low, verpasst seinen red smite und muss back, was ihn mindestens genauso viel farm kostet und dem eigenen Jungler ermöglicht Plays zu machen, ohne einen Counter-Gank erwarten zu müssen.\n\nIch kann dem OP hier nur zustimmen, dass man niemanden bannen sollte, nur weil er außerhalb der Meta pickt. Singed hat jetzt auch nicht das schlechteste Kit was man als Supporter haben kann. Einen guten AoE Slow, akzeptablen Engage dank dem Movement speed, guten Sustain, guter Schaden und einen Stun, wenn man ihn richtig einsetzt. Klar gibt es bessere Supporter, aber er scheint ja seinen Job zu machen, wenn er eine Winrate von 55% hatte und maßgeblich an den Siegen beteiligt war.","replies":[{"poster":"Megamaexx","date":"2016-11-25T18:41:05.330+0000","up_votes":1,"down_votes":0,"body":"Probier es doch selbst mal aus, allein gegen 2 Gegner zu farmen. Am besten noch gegen eine offensive Gegnerlane. Es ist sehr matchupabhängig. Als Ezreal gegen Vayne+Janna klappt das vielleicht noch ganz gut. Als Twitch gegen Zyra+Lucian sehe ich keinen Erfolg.\nIch bin ja nicht komplett gegen diesen Spielstil, jedoch sollte man den nicht mit randoms spielen. Es tut einfach nicht gut, wenn ein Spieler 4 anderen Spielern seinen Willen aufzwingt.","replies":[]},{"poster":"Sirrkas","date":"2016-11-25T17:37:45.932+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=YnZkMR0R,discussion-id=Kyi7uef6,comment-id=0003,timestamp=2016-11-23T22:14:32.506+0000)\n\n> Ich werde hier nicht viel darüber reden, das Thema wurde schon ausführlichst in anderen Threads behandelt. \n> \n> So viel sei aber gesagt. \n> \n> Er hat nicht Singed Support gespielt. Er hat nicht Blindpick gespielt. Er hat Ranked (Draftpick) gespielt. Er hat Support oder Bot als Rolle gehabt und in der Champselect einen vorgefertigten Text reinkopiert, bei dem er erklärt, dass ihm im Grunde alles egal ist, er wird Singed als Counterjungler spielen. Er hat damit perplexe Spieler auf der Botlane alleine gelassen, die zum Beispiel Janna als Support gespielt haben und sich wundern, warum sie die ersten 3 oder 5 Minuten alleine in der Lane sind und im Grunde nichts machen können.\n> \n> Es gibt einen sehr großen Beitrag im NA-Board, wo Riot Stellung dazu nimmt. Der Spieler hat sich dafür bedankt und will in Zukunft besser mit seinem Team solche Taktiken kommunizieren, damit auf der Bot keine einsame Soraka, Janna oder Sona steht, die ihren {{item:3303}}/{{item:3301}}  völlig umsonst gekauft hat und jetzt Lasthitten soll.","replies":[]}]},{"poster":"Wernicke","date":"2016-11-24T18:17:22.241+0000","up_votes":1,"down_votes":0,"body":">  Ich wette, würde so ein Spieler in deinem Team auftauchen und du wärest der ADC, würdest du ihn auch des Trollens bezichtigen\n\nJa TE sag mal was dazu! Manchmal muss man eben bissl mitdenken oder Inhalte komplett lesen bevor man voreilig threads aufmacht!\nbtw: SuFu!!","replies":[]}]},{"poster":"Sirrkas","date":"2016-11-23T22:14:32.506+0000","up_votes":5,"down_votes":0,"body":">Aber weil jemand Singed als support pickt? Das man seine Kreativität auslebt, dass man versucht spaß zu haben in diesem kotz langweiligen Meta-Game, dafür wird man fast perma bannt?\nSind da wirklich Menschen hinten am Werk?\nLeute die sich einbilden \"mitte\" zu sein, weil sie als erstes \"mid\" in den chat geschrieben haben und andere leute dafür reporten, und Riot die dann bannt, das ist so ziemlich das niveau.\n\nIch werde hier nicht viel darüber reden, das Thema wurde schon ausführlichst in anderen Threads behandelt. \n\nSo viel sei aber gesagt. \n\nEr hat nicht Singed Support gespielt. Er hat nicht Blindpick gespielt. Er hat Ranked (Draftpick) gespielt. Er hat Support oder Bot als Rolle gehabt und in der Champselect einen vorgefertigten Text reinkopiert, bei dem er erklärt, dass ihm im Grunde alles egal ist, er wird Singed als Counterjungler spielen. Er hat damit perplexe Spieler auf der Botlane alleine gelassen, die zum Beispiel Janna als Support gespielt haben und sich wundern, warum sie die ersten 3 oder 5 Minuten alleine in der Lane sind und im Grunde nichts machen können.\n\nEs gibt einen sehr großen Beitrag im NA-Board, wo Riot Stellung dazu nimmt. Der Spieler hat sich dafür bedankt und will in Zukunft besser mit seinem Team solche Taktiken kommunizieren, damit auf der Bot keine einsame Soraka, Janna oder Sona steht, die ihren {{item:3303}}/{{item:3301}}  völlig umsonst gekauft hat und jetzt Lasthitten soll.","replies":[]},{"poster":"CMan","date":"2016-11-23T22:11:39.042+0000","up_votes":4,"down_votes":0,"body":"Ach Kinners, bitte informiert euch doch einfach mal vollständig, bevor ihr hier rumhatet:\nhttps://www.youtube.com/watch?v=IsRaR3o5zSc\n\nDer Boy wurde NICHT permagebannt.","replies":[]},{"poster":"ViviD VooiD","date":"2016-11-23T22:07:50.836+0000","up_votes":2,"down_votes":6,"body":"gucke mir das video nicht an. zu muede. aber ich weiß, das manche bans ungerechtfertigt sind.\n\nein spiel, in dem ein language filter PER DEFAULT aktiviert ist, sollte spieler nicht wegen unangebrachter wortwahl bannen.\n\nauch solche peinlichen worte wie \"easy\" oder auch gerne \"ez\", dafuer wurden schon spieler gebannt.\nwenn ich mir dann aber die wortwahl von den heros anhoere, z.b. olaf bzw. brolaf, der macht Mutterwitze\n\nhttps://www.youtube.com/watch?v=T918N8hzxIQ\n\nwer als developer eines spieles, ein SOLCHES niveau ins spielgeschehen bringt, einen langauge filter per DEFAULT an schaltet, sollte sich im grunde schaemen, spieler accounts wegen unangebrachter wortwahl zu bannen.\n\nmit dem richtigen kleingeld, der zeit und der ausdauer, koennte man riot fuer etwaige bans verklagen.\n\nnur am rande, nein ich habe lediglich einen 10 spiele chat ban erhalten, weil ich einem teammember sagte ich reporte ihn, nachdem er mich \"low elo noob\" bezeichnet hat. richtig, ich erhielt einen chatban fuer  das reporten eines \"verbal abuse\" eines mitspieler..\n\nin diesem tibunal damals und in dem neuen automatischen reporting system, ist soviel sinn dahinter, wie in dem oben genannten beispiel\n\nin lol laeuft einiges schief, aber ich habe mein temperament zum glueck unter kontrolle, sodass ich mich da keiner großen gefahr ausgesetzt sehe. i just dont give a ... ya know","replies":[{"poster":"Sirrkas","date":"2016-11-23T22:10:30.985+0000","up_votes":4,"down_votes":1,"body":"Das klingt eher so, als wären die Banns angebracht. Nur weil es einen Wortfilter gibt, ist das kein Freifahrtschein fürs Flamen.\n\n>wer als developer eines spieles, ein SOLCHES niveau ins spielgeschehen bringt, einen langauge filter per DEFAULT an schaltet, sollte sich im grunde schaemen, spieler accounts wegen unangebrachter wortwahl zu bannen.\n\nEigentlich sollte sich der Spieler schämen, in einem Spiel unangebrachte Wörter zu wählen.\n\n>mit dem richtigen kleingeld, der zeit und der ausdauer, koennte man riot fuer etwaige bans verklagen.\n\nHaben schon viele angekündigt, noch keiner hat je darüber erzählt. \n\n>nur am rande, nein ich habe lediglich einen 10 spiele chat ban erhalten, weil ich einem teammember sagte ich reporte ihn, nachdem er mich \"low elo noob\" bezeichnet hat. richtig, ich erhielt einen chatban fuer das reporten eines \"verbal abuse\" eines mitspieler..\n\nDu hast eine Strafe für negative Einstellung erhalten. Reportaufrufe sind unnötig und stören nur die Atmosphäre. Mute die Spieler die dich stören einfach und melde sie. Du weißt ja jetzt aus erster Hand, dass das System funktioniert. \n\n>in diesem tibunal damals und in dem neuen automatischen reporting system, ist soviel sinn dahinter, wie in dem oben genannten beispiel\n\nDie funktionieren/funktionierten beide prächtig. Dein Beispiel hat ist leider auch leicht toxisch. \n\n>in lol laeuft einiges schief, aber ich habe mein temperament zum glueck unter kontrolle, sodass ich mich da keiner großen gefahr ausgesetzt sehe. i just dont give a ... ya know\n\nDann wäre es das beste, wenn du Flamern gar nicht mehr antwortest. Wenn du das hinkriegst und ansonsten auch nicht negativ auffällst, wirst du nie wieder bestraft. ","replies":[{"poster":"ViviD VooiD","date":"2016-11-23T22:12:39.382+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=YnZkMR0R,discussion-id=Kyi7uef6,comment-id=00000000,timestamp=2016-11-23T22:10:30.985+0000)\n>\n> Das klingt eher so, als wären die Banns angebracht. Nur weil es einen Wortfilter gibt, ist das kein Freifahrtschein fürs Flamen.\n\nflames werden nicht mal vom language filter geblockt. flames sind einfach \"verbale emotionale ausbrueche\". ob nun in sehr negativer wortwahl oder bedachter wortwahl.\n\nein flame, ein ausdruck wie schlecht jemand gerade war, ist KEIN GRUND jemandes spiel account zu bannen.","replies":[{"poster":"Sirrkas","date":"2016-11-23T22:27:48.215+0000","up_votes":4,"down_votes":1,"body":"Doch, wenn er das immer und immer wieder macht und sich wohl nie bessern wird. Dann macht Riot vom Hausrecht gebrauch. Da 95 % aller Spieler nie eine Strafe für ihren Chatlog erhalten haben, kann man sich also locker anständig benehmen.","replies":[]}]}]}]},{"poster":"Shacoláde","date":"2016-11-23T22:13:57.331+0000","up_votes":1,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/rTOH7u3k-aber-den-singed-support-spieler\n\nEinen Post über diesen Singend-Spieler gibt es schon","replies":[]}]}