{"poster":"Sephi51","date":"2015-07-22T11:58:09.861+0000","title":"Riot Live designer far too underpaid","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":2,"body":"Es ist oke wenn man zu starke champs nerfed. Aber warum zum Teufel bufft ihr balanced champs? oder zumindest ok champs\r\n\r\n\r\nWie Bitte? Tank Meta? wir haben doch nur ein &uuml;bertrieben starkes tank item auf dem markt gebracht, grundlos, zusammen mit diesem seltsamen tank jungle item. Tja, smite toplane.\r\n\r\nWarte, Tank meta? black cleaver ist doch da etwas was man gut f&uuml;r buffen kann!\r\n\r\nWas jetzt sind die tanks zu stark? Heca toplane ist zu stark? kein PRoblem wir nehmen ihm die teleport ganks und machen ryze op\r\n\r\nWie jetzt ist wieder Ryze op nachdem wir ihn gerade erst gebufft haben? Kein Problem, wir nerfen ihn und buffen runengleve damit es noch mehr dmg macht.  Buffen wir doch Elise gleich sinnlos mit dazu, die synnegiert ja so gut mit dem item, \r\n\r\nOh warte, wir m&uuml;ssen runengelve nerfen, warum buffen wir dann nicht sinnlos devourer?.\r\n\r\nWas Azir ist zu stark? ja nerfen wir ihn 3-4 Monate sp&auml;ter, sind ja nicht schnell im denken und brauchen die Zeit, und buffen dann einfach mal grundlos vayne.\r\n\r\nWie Elise ist  noch nicht zu stark? ich denke wir m&uuml;ssen sie wieder buffen \r\n\r\nundim n&auml;chsten patch: Das Ad jungle item ist balanced? Nicht mit uns! Smite Botlane solls ja schlie&szlig;lich auch noch geben !\r\n\r\nBitte Riot, ihr braucht weit mehr als ein Quartal um zu checken dass Azir ein bisschen zu stark ist. Nutzt diese Zeit um auch andere Champions mit Bedacht zu &auml;ndern.  Spielt das Spiel zumindest ein paar mal selbst um feststellen zu k&ouml;nnen dass das was ihr macht sinnlos war, und &auml;ndert es dann!","replies":[{"poster":"Snowgen","date":"2015-07-22T12:12:00.197+0000","up_votes":1,"down_votes":0,"body":"Bei so vielen Champs und items ist es schwer alle gleichzeitig zu balancen.\n\nJeder Champ und jedes Item hat mal seine Glanzzeiten. Und würde Riot nichts ändern, wäre es langweilig. \n\nViele Champs werden erst op, wenn andere Champs dafür generft werden. Das ist ein ewiger Kreislauf und es wird nie \"Das perfekte balanced LOL\" geben, find dich damit ab. Und seien wir mal ehrlich, wie sollen über 100 Champs gleichzeitig balanced sein. \n\nDas ist einfach unmöglich, also genieße die Änderungen und freue dich mit mir , dass wir jede Woche neue Sachen sehen und spielen dürfen\n\nMfG\n\nLaw{{champion:42}}","replies":[{"poster":"Sephi51","date":"2015-07-22T12:29:06.326+0000","up_votes":1,"down_votes":0,"body":"Das würde kein ewiger Kreislauf sein wenn Riot nicht sinnlos normale champions buffen würde. \nAls Azir auf dem markt kam war er einigermaßen normal, und Riot muss ihn dann direkt buffen.\nNachdem Rengar auf dem Markt kam war er auch normal, und Riot gibt ihm the biggest buff EU.\nSinged hat in den letzten Patchs 10 Buffs bekommen. Und jetzt buffen die Vayne? Ein champ der immer eigentlich stark war und ist? \nKlar werden andere stärker wenn welche generft werden, aber ich verstehe diese sinnlosen Buffs die aus der Luft gegriffen wurden sind nicht.","replies":[]}]}]}