{"poster":"Shandera","date":"2018-08-20T16:15:34.243+0000","title":"ME BANEARON EL CHAT INJUSTAMENTE POR REPORTES DE TROLLS","subforum":"Problemas Técnicos","embed":{"description":"Cada partida es una historia; visita el nuevo historial de partidas de League of Legends para saber cómo termina esta y comparte la tuya.","url":"https://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/608030065/201749893?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":9,"body":"En 2 partidas distintas me toco jugar con teams de premades que estaban trolleando (No se movian a ayudar en los roam y los ganks, flameaban por cualquier cosa, insultaron toda la partida y nos dijeron a mi y a mi duo barbaridades por ser argentinos) Cuesti&oacute;n que me banearon el chat por 24 partidas cuando yo dije poco y nada comparado a ellos. Ahora subo las pruebas: \r\nPartida 1\r\nEn partida\r\nShandera: dale ahri\r\nShandera: Afk (Era mi 3er gank y Ahri no se mov&iacute;a)\r\nShandera: gg no team (HICE UN CHISTE, NO ME QUEDE AFK NI 2 SEG)\r\nShandera: Ahri\r\nShandera: tengo unas ganas\r\nShandera: de flamearte\r\nShandera: pero no te voy a decir nada \r\nShandera: solo que mires el mapa (En serio decir eso es motivo de ban??)\r\nShandera: si te venias\r\nShandera: te llevabas un doble\r\nShandera: que cancer que me da sus vidas (ESTO LO DIJE LUEGO DE UNA TF EN QUE TODO EL OTRO TEAM QUEDO EN MENOS DEL 5% DE HP Y SE SALVARON. NO LOS INSULTE NI A ELLOS A NI MI TEAM CUANDO DIJE ESTO.)\r\nShandera: Capo\r\nShandera: hablaba de los HP\r\nShandera: tan re traumados con sus vidas (Dije esto porque mi Braum (El que me reporto) me habia flameado dici&eacute;ndome cosas como que era un gordo sin vida social y cosas as&iacute; por el comentario de arriba (Siendo que lo hab&iacute;a dicho por las HP del otro team... No quer&iacute;a insultar a nadie)\r\nShandera: jajajaaja\r\nShandera: Como erras eso\r\nShandera: mute\r\nShandera: Braum\r\nShandera: estas mal de la cabeza flaco\r\nShandera: mira todo lo insultaste \r\nShandera: en 10 seg (El Braum no dejo de insultar 1 seg en la partida)\r\nShandera: en un jueguito\r\nShandera: sos chileno? (Solo lo pregunte porque me decia wn malo, wn ctm, wn mereces la muerte, que hacis e insultaba a mi al resto del team por ser argentinos)\r\nShandera: solo eso contesta\r\nShandera: Se dan cuenta que soy el mejor de mi team no?\r\nShandera: y que voy 4 k de oro arriba? (Se lo dije al otro team porque mi team me estaba solicitando REPORT porque lo que habia dicho arriba (NI UN SOLO INSULTO!)\r\nShandera: Me siguen flameando loco\r\nShandera: no me pararon de flemar un seg\r\nShandera: no se que les pasa\r\nShandera: No insulte a nadie\r\nShandera: y me flamean\r\nShandera: Ese braum va al foro\r\nShandera: por favor reportenlo\r\nShandera: Por favor\r\nShandera: y reporto a elise\r\nShandera: No flamie nunca\r\nShandera: No insulte\r\nShandera: Ahri y braum son los toxicos de la partida...\r\n\r\nPartida 2\r\nEn partida\r\nShandera: TE PODES TIRAR\r\nShandera: Y AYUDAR\r\nShandera: PUSHEA\r\nShandera: PYUSHEA\r\nShandera: PYSGHEA\r\nShandera: PUSHEA\r\nShandera: NO PUSHEAS\r\nShandera: COLGEAS\r\nShandera: SOS UN MOGOLICO (Primera y &uacute;nica vez que insulte)\r\nShandera: TENES\r\nShandera: TODA\r\nShandera: LA\r\nShandera: MANA\r\nShandera: No\r\nShandera: no puede ser \r\nShandera: Me re trolleo la pasiva (REFERIDO A QUE NO TENIA PASIVA)\r\nShandera: No ayudas amigo (PARA ESTE MOMENTO YA HABIA IDO 4 VECES A TOP Y EL NASUS SE QUEDABA EN TORRE)\r\nShandera: no sabes jugar en equipo\r\nShandera: lo estoy hacuendio\r\nShandera: DUO\r\nShandera: POR FAVOR\r\nShandera: LOCO\r\nShandera: POR FAVOR\r\nShandera: AYUDEN\r\nShandera: HAGAN ALGO GUACHO\r\nShandera: NO PUEDE SER\r\nShandera: MUEVANSE\r\nShandera: Nasus\r\nShandera: ayuda\r\nShandera: que te pasa\r\nShandera: estas mal de la cabeza (En este momento el Nasus ya habia flameado como 15 min seguidos por que eramos argentinos y le pediamos que se mueva durante los ganks y el roam, el duo estaba igual solo insultaban y nos pedian report, siendo que eramos los mejores del team mi duo y yo (No por como jugabamos sino como iba la partida en ese momento))\r\nShandera: como no ayuda\r\nShandera: al team hermano\r\nShandera: te gankeo 10 veces\r\nShandera: y no te tiraste\r\nShandera: Ez\r\nShandera: Sos de la peor basura del lol nasus (Esto lo dije porque me iban a reportar siendo que solo pedia que se muevan en los ganks y habia insultado una vez (Ya se que mogolico es un insulto grabe pero fue UNO solo)\r\nShandera: ustedes entienden\r\nShandera: que perdieron al partida\r\nShandera: por no ayudar?\r\nShandera: lo entienden?\r\nShandera: que si te gankean\r\nShandera: tenes que moverte?\r\nDespu&eacute;s de la partida\r\nShandera: por favor reporten al nasus\r\nShandera: va al foro.\r\nShandera: Loco\r\nShandera: es increible\r\n\r\nGente yo sinceramente he sido flammer pero honestamente no creo que merezca ban de chat por 24 partidas por estos motivos. Siendo que mis teams me habian insultado todo el game sin que yo les dijera nada y me reportaron. Lo siento increiblemente injusto y exigo que se me saque el ban y que baneen el chat a los que me reportaron (A mi opinion) sin motivo. \r\n\r\nEn caso que de verdad haya sido flammer a su opinion haganmelo saber, porque yo solo pedia que se movieran no los insultaba! Por favor haganmme saber su opini&oacute;n. Muchas gracias!","replies":[{"poster":"ToxicRunner","date":"2018-08-20T16:19:33.272+0000","up_votes":5,"down_votes":0,"body":"Shandera: mute\nShandera: Braum\nShandera: estas mal de la cabeza flaco\nShandera: mira todo lo insultaste\nShandera: estas mal de la cabeza\nShandera: Ez\nShandera: Sos de la peor basura del lol nasus \n\n¿Y te da la cara para decir que son reportes injustos?","replies":[{"poster":"Shandera","date":"2018-08-20T16:30:22.315+0000","up_votes":1,"down_votes":5,"body":"Vos no te das una idea de todo lo que me dijeron. Me desearon HASTA LA MUERTE por errar una ulti. Le dije que estaba mal de la cabeza no lo insulte ni nada!!!","replies":[{"poster":"UnforgivenPast","date":"2018-08-20T17:39:44.821+0000","up_votes":4,"down_votes":0,"body":"Es difícil sin el contexto del otro equipo, pero igual no justifica ninguna respuesta de tal carácter. Fuego con fuego no funciona","replies":[{"poster":"ZanahoriaAsesina","date":"2018-08-20T19:17:13.405+0000","up_votes":1,"down_votes":0,"body":"^ Ídem.","replies":[]}]}]}]},{"poster":"Baiken","date":"2018-08-20T19:48:16.061+0000","up_votes":3,"down_votes":0,"body":"Solo te puedo decir, ADIOS RECOMPENSAS DE FINAL DE TEMPORADA... JAJAJAJJAJAJJAJAJAJAJAJAJAJA","replies":[]},{"poster":"Mithrilium X","date":"2018-08-20T17:43:33.639+0000","up_votes":3,"down_votes":0,"body":"solo dire esto:   la verdad bien merecido el baneo....\n\n\n_Editado por moderación: Se bueno ^^_","replies":[]},{"poster":"SolidDisk","date":"2018-08-20T19:00:30.905+0000","up_votes":2,"down_votes":0,"body":"> yo dije poco y nada comparado a ellos.\n\nEsto es clave, vos manejas solo tu teclado, el culpable de lo que aparece en tu chat sos vos.\n\nLos demas son tan reportables como vos y son sancionados por sus acciones de igual forma.","replies":[]}]}