{"poster":"icoN2k7","date":"2015-08-19T01:37:28.364+0000","title":"Leute zum zocken?","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hey Leute, \r\n\r\nich suche ein paar Leute die mit mir Zocken wollen Normals &amp; etc. Am beste vom Skill her** besser wie** ich, ich bin zurzeit **Silver 3**, mir geht es hauptsache um den **Spa&szlig;** und das ich mich vielleicht durch euch **verbessern** kann. \r\n\r\nW&auml;re  sch&ouml;n wenn sich vielleicht der ein oder andere angesprochen f&uuml;hlt. \r\n\r\nGru&szlig; icoN.","replies":[{"poster":"Pacenko66","date":"2015-08-19T07:36:12.866+0000","up_votes":1,"down_votes":0,"body":"es wäre schön wenn du ein bisschen mehr von dir preis gibst am wichtigsten ist eigentlich dein alter \nwelche Lane du spielst und wie oft du on bist \nkurz zu uns wir sind 5-8 leute gold silber gemischt sind alle über 20 und suchen noch aktive leute zum zocken","replies":[{"poster":"icoN2k7","date":"2015-08-19T15:58:33.251+0000","up_votes":1,"down_votes":0,"body":"Hey Sorry, mein fehler^^\n\nIch bin 24 Jahre alt und meine Main-Posi ist meistens Mitte. Mein Main Champion ist Ahri & Zed.\nIch bin meist zwischen 18-00 Uhr - 24-00 Uhr on. Aber die nächsten 3 Wochen meist den ganzen Tag bis die nacht aufhört^^, ich hab nämlich Urlaub :D\nIch zocke seid ende season 2 war aber bestimmt schon 4 x Inaktiv weil ich wieder CS angefangen hab zu zocken wo ich sehr erfolgreich gespielt hab. Jetzt hab ich aber wie den geschmack an LoL gefunden durch meinen Bruder der auch sehr aktiv LoL spielt. Wie oben beschrieben suche ich Leute mit dennen man Spaß im TS, Games und einfach so haben kann vielleicht auch in anderen Games. Natürlich würde ich mich auch gerne verbessern, weil ich trotz Spaß auch einen gewissen ehrgeiz habe mich zuverbessern, deswegen am besten Leute die Gold oder so sind. Natürlich darf mich der Rest auch adden :)\n\nGruß icoN.","replies":[]},{"poster":"xJustplay","date":"2015-08-19T12:38:19.241+0000","up_votes":1,"down_votes":0,"body":"Servus pacenko\nBin der moritz 20 Jahre Spiele seit s1 LoL eigentlich auf jeglicher lane, Main ist adc und top aber ich passe mich gerne den Mitspielern an.\nSuche auch nen paar nette Leute für rankeds oder normals Vllt habt ihr ja mal Lust mit mir zu zocken! Wäre cool ;) bi. Auch ein aktiver Spieler \nGruss","replies":[]}]}]}