{"poster":"Muerto el 9del12","date":"2019-07-23T03:15:01.256+0000","title":"Otra misión de TFT bugeada?","subforum":"Teamfight Tactics","up_votes":4,"down_votes":0,"body":"Buenas. Así como la de juntor tanto oro antes de la ronda 11 (que el bug te lo tomaba hasta la ronda 7) ahora se trata de \"Obtén 20 de oro en una sola etapa\", viejo, acumule 50 de oro en 5 partidas distintas... No sé si a alguien más le pasa, o si hay que ganarla a la partida o qué, saludos.","replies":[{"poster":"G NaGaTo","date":"2019-07-23T03:35:06.935+0000","up_votes":1,"down_votes":0,"body":"Es muy facil la mision, la hice a la primera... tenes que ahorrar 20 de oro en un \"split\" completo como le digo yo... que es el split completo? son las 5 rondas que aparecen arriba, las 4 de pvp y la de Pve (sin contar el carrousel).\nLa mision te pide que juntes 20 de oro en esas 5 rondas antes de que pase a la otra fase... aunque es medio raro que decis que juntaste 50 y no te lo tomo, aunque quiza fuiste gastando y ahi esta el probelma que pormas que tengas mucho oro no cumplis con lo que pide la mision.\n\nFijate que yo aca estoy por las que dan 70 puntos ya para que veas que note miento.\nhttp://prntscr.com/oiqhvi\n\nSuerte bro.{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Branca89","date":"2020-01-06T15:17:20.632+0000","up_votes":1,"down_votes":0,"body":"yo no gaste mas que 1 de oro para comprar champ  baratos llegue a 55 de oro terminando la face y no me dio nada","replies":[]}]},{"poster":"Lyo","date":"2019-07-23T07:15:31.939+0000","up_votes":1,"down_votes":0,"body":"por lo que tengo entendido tienes que generar en un etapa 20 de oro por INTERES, hice calculos y tendrias iniciar la etapa 3 con 30 de oro\n\nronda 3-1(30oro) a 3-2 (30oro+5oro_fijo+3oro_interes=38oro) / interes=3\nronda 3-2(38oro) a 3-3 (38oro+5oro_fijo+3oro_interes=46oro) / interes=3\nronda 3-3(46oro) a 3-4 (46oro+5oro_fijo+4oro_interes=55oro) / interes=4\nronda 3-4(55oro) a 3-5 (55oro+5oro_fijo+5oro_interes=65oro) / interes=5\nronda 3-5(65oro) a 3-6 (65oro+5oro_fijo+5oro_interes=45oro) / interes=5\n\n3+3+4+5+5=20oro, y con eso completarias la mision.\n\npara llegar a la etapa 3-1, no se debe gastarnada de oro, si se comienza con 0oro la etapa 2, tedrias que ganar obligatoria mente 1 o tener racha de derrota.\n\nyo aun estoy que pruebo, pero me eliminan antes de llegar a la ronda 3-4, antes los ajustes se podia llegar a la ronda 4-1 sin gastar oro y con derrotas, pero ahora ya no, lo mejor que te puede pasar es tener un buen dropeo de champs al inicion, ganar algunas de la etapa 2, y aguantar hasta la ronda 3-4 ya que para tener la ganancia maxima solo se necesitan 50oro, asi que podrias gastar esos 5 oro, lo mismo en la ronda 3-5","replies":[{"poster":"Exałted","date":"2019-07-24T17:51:35.903+0000","up_votes":1,"down_votes":0,"body":"Llegue a 3-1 con mas de 30 de oro, (el interés me daba 4 de oro ya) entonces...\n\n3-1 a 3-2 = 4\n3-2 a 3-3 = 5 - 2 = 3 (Porque me compre 2 campeones que valían 1 de oro, aunque no le veo problema a esto porque todavía tendría 20 o un poco \n3-3 a 3-4 = 5              mas  y no creo que por gastar 2 de oro sea si o si gastar el interés, porque ganas oro adicional que no es del interés)\n3-4 a 3-5 = 5\n3-5 a 3-6 = 5\nO sea      = 22 o 24 (Pongo 24 por si no importa por los 2 de oro que gaste)\n\nY nada, no me dio la misión, aclaro que no gaste nada salvo los 2 de oro esos, (hasta pasar al 4-2 que ahí empece a gastar todo, porque tenia como 100 de oro, si se preguntan porque si solo tenia los 22 o 24 que dije recién, es porque solo hablo del interés arriba, no del total que juntaba) después me mataron el la ronda 4-3, no se si eso incumbe.","replies":[{"poster":"Exałted","date":"2019-07-24T17:52:28.793+0000","up_votes":1,"down_votes":0,"body":"Ahiii me la dioooooooooooooooo!","replies":[]}]},{"poster":"Exałted","date":"2019-07-24T17:04:40.034+0000","up_votes":1,"down_votes":0,"body":"Interés, ahí esta la cosa, Riot no especifica, en ningún lado dice interés.","replies":[]}]},{"poster":"AustinAries","date":"2019-07-23T03:32:33.204+0000","up_votes":1,"down_votes":0,"body":"No esta bugueada... Lo que tenes que juntar son 20 de oro en INTERESES durante un stage (Osea una serie de rondas). Personalmente te recomiendo que la hagas durante el stage 3 que es el mas largo (tiene 6 rondas)","replies":[{"poster":"Exałted","date":"2019-07-24T17:04:03.998+0000","up_votes":1,"down_votes":0,"body":"Creo que ya entiendo, igual esta muy mal redactada la misión. Gracias","replies":[]}]},{"poster":"GODPandisimoLAS","date":"2019-07-24T06:10:24.000+0000","up_votes":1,"down_votes":0,"body":"- Junté oro por interés...no me dio la misión\n- Llegué primero hasta el 1v1 quedando solo mi contrincante y yo, vendí todo generando casi 80 de oro...no me dio la misión\nNo entiendo...{{sticker:sg-lux-2}}","replies":[{"poster":"AustinAries","date":"2019-07-24T14:28:17.973+0000","up_votes":1,"down_votes":0,"body":"El tema de los intereses es que no puede ser cuando vos quieras, debe ser todo durante el mismo stage... \nLa mision funciona correctamente, y no importa que vendas todo, de esa forma no vas a completar la mision","replies":[{"poster":"Exałted","date":"2019-07-24T17:02:07.872+0000","up_votes":1,"down_votes":0,"body":"Junte 51 de oro en el segundo stage y no lo gaste hasta pasar el tercero y no vendí ningún campeón, pero aun así no me dio la misión.","replies":[]}]},{"poster":"Exałted","date":"2019-07-24T17:01:10.496+0000","up_votes":1,"down_votes":0,"body":"X2 De hecho yo junte mas de 20 de oro en el stage 2 y el 4 en una misma partida... sin gastar nada en esos 2 stages. Y no me dio la misión.","replies":[]}]}]}