{"poster":"YOU BEEN WARNED","date":"2015-01-27T04:19:03.474+0000","title":"The best profitable IP sink solution for Riot and the players","subforum":"Gameplay","up_votes":3,"down_votes":1,"body":"I'll head straight to the point.\n\nIP -> Gift\n\nTwo rules: \nRule 1: 2 skins gifted maximum for a lifetime per account.\nRule 2: If an account receives both skins --mentioned in rule 1-- from your account, you are unable to gift that account any more.\n\n(Example: Voyboy can send his girlfriend only 2 skins using IP and that's it. He will only be able to send Runes/Pages/Champions to different friends with the rest of his IP.)\n(Example conversion factor: 100k IP -> 975 RP skin. or 20k IP -> quint rune)\n\nWhy is this better than IP -> RP or IP skins ?\n\nFirst off, it isn't exploitable. Sure you can send a couple skins to your smurf, but your smurf will not have the champions or the runes & rune pages of your main account rendering the exploit useless. \n\nThe main reason: because it legitimately encourages four things we want to do for this community.\n\n1- Give incentive to bring more players to League of Legends, players with extremely large amount of IP will only be able to spend the IP through giving. Encouraging the introduction of their relatives and acquaintances and so on.\n\n2- Reinforcing good behavior and morals in the game since gifting represents effort and support from one player to another.\n\n3- Enhancing new player experience, the ability to gift runes will reduce the rune price crisis when a player starts his league journey.\n\n4- Honoring veteran, loyal players of the game who spent a massive amount of time on League by giving them the ability to make a difference with that stack of IP; all without damaging the company's income.\n\nThese changes will not break the game, but change it into a better place by ~6% I would say.","replies":[{"poster":"Mayor Stubbs","date":"2015-01-27T05:18:29.304+0000","up_votes":2,"down_votes":0,"body":"i would love this but riot would likely lose money","replies":[]},{"poster":"SmokingPuffin","date":"2015-01-27T04:38:31.731+0000","up_votes":2,"down_votes":0,"body":"I'm not a fan.  It makes new players feel like they need a friend with tons of IP to get into the game.  Would much rather see perks that players with tons of IP can spend it on.\n\nFor example, I think it would be interesting to be able to buy a new level 30 account with IP, for those who like to smurf and don't want to spend the time leveling again.","replies":[]},{"poster":"Zydin","date":"2015-01-27T04:33:59.451+0000","up_votes":1,"down_votes":1,"body":"I think this is a really good idea","replies":[]}]}