{"poster":"elzeta123","date":"2017-04-22T02:37:22.815+0000","title":"Campeones para iniciar a jugar jg?","subforum":"Guias y consejos","up_votes":6,"down_votes":0,"body":"B&aacute;sicamente lo har&eacute; bastante resumido; soy main top, pero he empezado a jugar diferentes roles y muchos me han gustado, pero el rol de jg es el que mas debil tengo a la hora de jugar( no soy malo jugando jg, se hacer ganks, pero creo que me demoro mucho para conseguir farm),tal vez por que tengo pocos campeones jungla que de verdad me gusten.\r\n&iquest;que campeones me recomendar&iacute;an jugar, que sean divertidos pero interesantes como para masterizarlos?","replies":[{"poster":"Azirlian","date":"2017-04-23T03:43:02.703+0000","up_votes":2,"down_votes":0,"body":"Soy main jungla y te puedo decir los mas divertidos y los que mas dan fruto ahora mismo para mi gusto.\n\n{{champion:421}} , {{champion:60}} ,{{champion:104}} ,{{champion:120}}, {{champion:107}} ,{{champion:154}} ,{{champion:113}} ,{{champion:121}} \n\nPor mi lista seria entre dificultad y lo que rinde fruto quedaria\n\n-Elise (Buen stun, muchas habilidades utiles, velocidad de movimiento con araña, mucho daño, tank en late, salto op)\n-Graves (Mucho daño, buena ulti con poco cd, buena q muy util y mucho daño, buen kiteo, limpia bien la jungla)\n-KhaZix y Rengar (Asesinos, dificiles de aprender y de saber entrar y salir)\n-Reksai , Hecarim (Tanque y con buen cc, escape y utilidad, muy buena jg) (Hecarim: hermoso)\n-Warwick (simplemente es un champ para mancos y esta roto, seria como el Yasuo de la jungla a mi gusto)\n-Sejuani (Esta rota en el servidor de pruebas, hay que ver como la dejan, si sigue asi, quedara igual de bien que RekSai)\n-Zac (Buenos gank, muy tank, dificil de dar fruto con el)\n-Lee Sin (Dificil, un poco mas que Elise, pero que no estaria dando tantos frutos como una elise bien jugada, sin tener en cuenta el late.)\n\n\n\nSaludos!{{sticker:slayer-pantheon-thumbs}} \n\n{{summoner:13}} {{champion:421}} {{summoner:13}}","replies":[{"poster":"elzeta123","date":"2017-04-23T04:29:10.342+0000","up_votes":1,"down_votes":0,"body":"Un comentario bastante completo, creo que ire por elise, heca o zac :D (pregunta aparte:¿como se usa la e de elise?)","replies":[{"poster":"JayInc","date":"2017-04-23T05:14:16.051+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo no jugar Elise si solo la vas a usar de vez en cuando como relleno cuando te toque jugar jungla. Es díficil de usar efectivamente y hay que dedicarle tiempo. La E en forma de araña se usa como:\n\n1. Gap closer: Apretas la E sobre un enemigo (subditos, campeones, mascotas, bichos de la jungla e incluso plantas) y caes inmediatamente sobre ellos. \n2. Para sobrevivir o esquivar habilidades. Apretas E sin tener el cursor sobre ningun objeto enemigo y te quedas en el aire por un par de segundos. No te puede pegar nada mientras estas en el aire, pero cualquier daño que tengas de antes si es efectivo. Por ejemplo si zed te ultea y ocupas tu E, su ulti aun te va a hacer daño aunque estés en el aire.","replies":[]}]}]},{"poster":"TheFalc","date":"2017-04-22T23:31:01.040+0000","up_votes":2,"down_votes":0,"body":"Yo soy un main supp asi que supongo que presupones que no se carrear una partida\nEs asi, asi que we, una vez fui forzado a jugar jungla por lo que pickie a Warwick\nNo tuve mucha presencia durante los primeros ~6 minutos de la partida, pero conozco que podes hacer el dragon a nivel 3, lo que ayuda bastante\nWarwick es muy facil de usar, y si lo aprendes a usar, tiene mucho mejor desempeño, te lo recomiendo\nSuerte con tu aprendizaje!","replies":[]},{"poster":"Alvatruz","date":"2017-04-22T03:44:42.967+0000","up_votes":2,"down_votes":0,"body":"Justamente para aprender la esencia del roll para mi lo mejor es {{champion:20}}  encima ahora esta medio roto por el update que le metieron , seguro a pocos le gusta jugar esto pero este champ te enseña como hacer el camino correcto en la jg , priorizas dragones buffs hasta heraldo, al no tener un buen gapcloser los ganks son algo complicados por lo que tenes que saber cuando y como entrar basicamente te enseña como llevar un buen tempo y a centrarte en el macro game que es lo que deberia hacer todo jg.\n\nEn cuanto champs a los cuales podes traducir lo que aprendiste, si es que lo hiciste, o simplemente jugarlos porque te gustan y masterizarlos tenes {{champion:32}} {{champion:59}} {{champion:64}} {{champion:19}} {{champion:35}} {{champion:154}}","replies":[{"poster":"TheFalc","date":"2017-04-22T23:32:02.930+0000","up_votes":1,"down_votes":0,"body":"lo voy a tener en cuenta, tambien quiero retomar el jungleo, gracias!","replies":[]}]},{"poster":"Alfisto","date":"2017-04-22T02:46:42.620+0000","up_votes":2,"down_votes":0,"body":"Warwick, tenes sustain, no perdes vida y sus ganks son muy decentes.\n Vi, ultra recomendada para un iniciado en jg.\n Amumu, el nuevo amumu no solo limpia bien, ahora mata facil, gankea excelente y hasta carrea partidas el solo. \nSejuani, el tanque que es un cc constante a todo lo que se mueve.\nFijate alguno de esos...","replies":[{"poster":"elzeta123","date":"2017-04-22T02:53:31.614+0000","up_votes":2,"down_votes":0,"body":"Valdria la pena sejuani ahora con el nuevo cambio de mitad de temporada?","replies":[{"poster":"Alfisto","date":"2017-04-22T02:58:58.176+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=elzeta123,realm=LAS,application-id=8sKIclmi,discussion-id=GGsc2XXg,comment-id=00010000,timestamp=2017-04-22T02:53:31.614+0000)\n>\n> Valdria la pena sejuani ahora con el nuevo cambio de mitad de temporada?\n\nImposible saberlo,  pero supongo que sí. De hecho sus habilidades nuevas las veo como una potenciación de las anteriores. Esperá en todo caso al rework, probalo cuando esté gratis y sacá tus propias conclusiones. En cuanto a pi: ww y amumu son ambos de 450, no te cuestan nada.","replies":[]}]}]},{"poster":"Zhanderail","date":"2018-04-05T13:56:34.212+0000","up_votes":1,"down_votes":0,"body":"tienens razon Sov3g pero ahora mismo con los buffeos que le metieron a voli esta bastante fuerte{{champion:106}} {{sticker:sg-lux-2}} {{item:3800}} con este item revienta","replies":[]},{"poster":"Luka kpo1","date":"2017-04-22T20:46:06.014+0000","up_votes":1,"down_votes":0,"body":"Warwick y Xin Zhao son buena opcion para empezar","replies":[{"poster":"elzeta123","date":"2017-04-23T04:26:50.442+0000","up_votes":1,"down_votes":0,"body":"Xin lo encuentro un campeon bastante aburrido la verdad, tratar de dar todos los botones para ver si puedes matar a alguien no es muy interesante.por el otro lado ww me parece bien","replies":[]}]},{"poster":"El Koreano","date":"2017-04-22T02:44:20.357+0000","up_votes":1,"down_votes":0,"body":"personalmente creo que elise y lee sin son faciles, con mecanicas, fuertes y muy divertidos, podes hacer varias plays.\nSino como alternativa mas tanque Zac tiene lo suyo","replies":[{"poster":"elzeta123","date":"2017-04-22T02:54:49.703+0000","up_votes":1,"down_votes":0,"body":"Lee me tienta, se ve bastante bueno.\nseria worth zac con el cambio que le haran?","replies":[{"poster":"El Koreano","date":"2017-04-22T20:46:29.903+0000","up_votes":1,"down_votes":0,"body":"las nuevas habilidades de zac son de otro planeta, imaginate tomar los campeones enemigos y llevarlos al lugar que quieras, si es para rankear te lo van a banear siempre asi que si es para normal super bueno","replies":[]}]}]},{"poster":"ThePunkRocker","date":"2017-04-22T02:59:49.516+0000","up_votes":1,"down_votes":0,"body":"{{champion:5}} {{champion:19}} {{champion:32}} {{champion:59}}","replies":[]},{"poster":"Relium","date":"2017-04-22T05:08:06.343+0000","up_votes":1,"down_votes":1,"body":"{{champion:120}}","replies":[]}]}