{"poster":"SpongebobIsLife","date":"2018-08-24T04:54:42.533+0000","title":"If  we are going to allow autofill to continue to exist.....","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"Can we please not allow JG to be a possible autofilled role? The role is way too complex and different from the others. The differnce between a jungle main and a person who only has a possible handful of jg games is clear as day...especially as you climb. You can work with an autofilled mid bc several champs in other lanes can go mid and function, top is the least influential role atm (lets be honest), adc can also b a bit problematic, but if you have a good support, you can at least get through laning phase. Support is to be expected as its the least popular role (might not be anymore, not sure), but, and I might get a lot of feedback from this, support is not as difficult to play as top plus most people would probably agree that if someone had to get autofilled, they&#039;d rather it be support.\r\n\r\nBut Jungle, a good or bad jungle can EASILY decide the game not to mention, the map awareness, macroplay, pathing, and decision making that jungle requres on a much higher level than any other role. It is almost a guaranteed loss if your jungle is autofilled.","replies":[{"poster":"Colton147","date":"2018-08-24T06:46:21.643+0000","up_votes":1,"down_votes":0,"body":"For the best meta, implementing my suggestion threads inti the game will shake the game.\n{{sticker:poppy-wink}}","replies":[{"poster":"SpongebobIsLife","date":"2018-08-24T07:14:50.084+0000","up_votes":1,"down_votes":0,"body":"hm? i just think certain roles are harder to playe or are more important than others. In reality, I do not think there should ever be an autofilled mid/jg/ad in the game. These roles are too crucial as they generally makeup a large percentage of the team's damage as well objective and map control. And to be honest again, I find it hard to believe that there really aren't enough mid or ad players to the point where you can be autofilled mid or ad.\n\nI know this will never happen which is why I was suggesting the change to jg.","replies":[]}]},{"poster":"Geauxx","date":"2018-08-24T05:39:56.266+0000","up_votes":1,"down_votes":0,"body":"Thats not a good argument.\n\nEventually the meta could POSSIBLYshift back to like it was back jungle was just a walking ward role and top lane could end up being the most important role again.\n\n\nthe difficulty of a role also depends on the playstyle of the player/teamcomp being used also.\n\n\nremember, jungle use to be \"pick a tank and survive till late\" and everything that happened in between didn't matter.","replies":[{"poster":"SpongebobIsLife","date":"2018-08-24T06:38:54.419+0000","up_votes":1,"down_votes":0,"body":"idk man, since autofill's inception, jg has been the one role where it's extremely obvious if ur autofilled or not.","replies":[]}]}]}