{"poster":"HyenaLoL","date":"2015-04-29T16:50:09.388+0000","title":"Adaptando a Warwick al Meta","subforum":"Guias y consejos","up_votes":3,"down_votes":1,"body":"Luego de la Profanaci&oacute;n del Cuerpo de Warwick tan brutal, fria y desproporcionada por los cambios de season y el devorador, quedo bastante relegado en el meta, perdiendo casi un 15% de winratio por un periodo... \nAhora, con la vuelta de la mole lo tenemos de nuevo, esta vez dejando de ser un campeo de cazada con tendencia tank a uno tank-antitanks (con capacidad de cazada, pero ya no es lo central en la mecanica del personaje)\n\nRecordando su anterior build \n{{item:3718}} {{item:3020}} {{item:3091}} {{item:3153}} {{item:3065}} {{item:3110}} \n1-El devorer, que ofrecia un escalado brutal hacia el late, con un smite rojo que potenciaba sus ataques basicos para darle un da&ntilde;o absurdo eran prioridad.\n2-Luego soccerer y wits end, antes que botrk ya que en midgame no predominaba mucho la acumulacion de hp lo que hacia menos efectiva la botrk, en cambio estos items al dar penetracion y reduccion de mr (a demas del da&ntilde;o magico por basico del wits end) ofrecian sinergia con el da&ntilde;o magico del devorer, de su pasiva, de su q y su ultimate logrando que sea da&ntilde;o cercano al verdadero \n3-La BotRK ya saliendo de mitad de partida, como 4to item para potenciar aun mas el da&ntilde;o, dar un plus a la pobre capacidad de acercarse al objetivo de warwick y aumentando su sustain\n                                                                             Con esto ten&iacute;amos completada la itemizacion ofensiva(ibamos a cazada)\nQuedaba la parte tanky, pero como eramos cazadores nesesitabamos utilidad en ese aspecto, entonces? CDR para ultear mas seguido, tirar mas q.. etc\nEl spirit visage nos aportaba vida resistencia magica, un sustain aun mas brutal y 10% de cdr\nLuego, pasando a el lado de la armadura, un Frozen Hearth, que da utilidad al team reduciendo la velocidad de ataque enemiga, 100 de armor que es una bestialidad y otra vez 20% de cdr\n\nLa composicion de runas y maestrias podia variar del 9-21 al 21-9 dependiendo de la composicion de equipo, pudiendose buscar alli un 10% de cdr extra para llegar al cap.\n Aun asi yo preferia una personalizada 5-21-4 centrada en velocidad de ataque y da&ntilde;o a subditos en lo ofensivo, defensivo deafult, y velocidad de movimiento con recall para acelerar limpieza y consecuentemente llegada al 6. \nCon quints a velocidad de movimiento, marcas de da&ntilde;o, sellor y glifos deafult de tank\n_____________________________________________________________________________________________________________\nViniendo al meta actual, warwick revivio por su capacidad antitank con el beneficio del cinderhulk\nsiendo su nueva build:\n{{item:3717}} {{item:3111}} {{item:3153}} {{item:3110}} {{item:3065}} {{item:3190}}\n-En caso de ir muy por delante se puede seguir optando a {{item:3020}}  en lugar de {{item:3111}}  y {{item:3091}}  antes de {{item:3110}}  y no sacar{{item:3190}} \n-Por otro lado en caso de necesidad de mayor armadura que resistencia m&aacute;gica se puede recurrir al nuevo {{item:3143}} resignando el cap de cdr en items por mayor velocidad de ataque, y cubriendo esta falencia en runas\n\nSeteo de Runas y maestr&iacute;as esencialmente tanks (las que yo utilizo me siguen resultando convenientes)\n\nComo se juega esto entonces? Meta de tanks=meta de cc, ultear al carry siempre va a ser la mejor opcion, pero es 100 veces mas probable que cancelen su uso, por lo que si no es para matar a alguien desposicionado fuera de la jung es mejor dejarla guardada para el momento oportuno(como una kata), y en caso de tener un asesino (veanse zed/lb) que se encargue del carry, podr&iacute;amos usarla sobre cualquier tank molesto que pueda intentar tunelvision a nuestro carry, cumpliendo mas funci&oacute;n de peel que de cazada, ya que a dem&aacute;s con la botrk le haremos mucho da&ntilde;o por la acumulaci&oacute;n obscena de vida en este meta\n\nSe ve ademas el desinter&eacute;s que tenemos por acumular da&ntilde;o m&aacute;gico o reducci&oacute;n de estas resistencias, y es que hay tanta de ella en este meta que buildear as&iacute; en un caso de igualdad entre equipos seria inefectivo \n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nSobre Warwick como campeon:\nWarwick NO ES ASESINO, asesinos son {{champion:238}} {{champion:7}} {{champion:84}}  entre otros, no tiene porque hacer siempre focus al adc, en el team siempre deber&iacute;a haber otro cumpliendo esa funci&oacute;n (generalmente el mid) en caso de que no lo halla, podria verse forzado a ocupar el lugar, pero no es lo optimo. \nHaciendo referencia a lo anterior dicho, warwick a dem&aacute;s puede por ejemplo ultear al jungler enemigo en dragon antes de smitear, para evitar el duelo y ganar el smite de dragon sin arriesgarlo (plz no ser tan estupido de salirse de rango al ultear)\n\nWarwick NO ES INICIADOR, ellos son {{champion:54}} {{champion:113}} {{champion:254}} con fuerzas imparables o capacidad de reiniciar el ingreso, ww tiene solo un intento, a un campe&oacute;n y es un casteo tal como la ulti de {{champion:55}} , pero sin los resets, una vez entra, si se la cortan perdio el da&ntilde;o y quedo sin herramientas. Confundir a ww con un iniciador puede ser raz&oacute;n principal de perder tf.  El rol de iniciador en caso de tener un ww en partida seria propicio cubrirlo con el supp o el top\n\nLa w de Warwick en late, es de las herramientas de soporte para realizar sieges rapidos mas utiles que hay (a pesar del nerf exesivo que le tiraron para disminuir su sustain)\n\nQuitando estas consideraciones que complican muchisimo su roleo, por su sustain y simpleza de mecanicas, warwick es uno de los mejores campeones para empezar a junglear, aprender a hacerlo y subir elo en esta posicion. Si quedan dudas o cosas en las que desacuerden pueden recurrir a los comentarios","replies":[{"poster":"ZanahoriaAsesina","date":"2015-04-29T17:13:10.953+0000","up_votes":2,"down_votes":0,"body":"****Lindo aporte  (:\nOpino lo mismo con lo de no confundir a Warwick con un iniciador.****","replies":[{"poster":"HyenaLoL","date":"2015-04-29T20:02:11.777+0000","up_votes":1,"down_votes":0,"body":"+1? :3","replies":[{"poster":"ZanahoriaAsesina","date":"2015-05-01T02:50:26.372+0000","up_votes":1,"down_votes":0,"body":"**+10 por el esfuerzo pensé que lo había puesto antes jaja.\nBuen Día.**","replies":[{"poster":"HyenaLoL","date":"2015-05-02T03:04:27.169+0000","up_votes":1,"down_votes":0,"body":"lovya","replies":[]}]}]}]},{"poster":"Jonshi","date":"2015-04-29T18:43:04.335+0000","up_votes":1,"down_votes":0,"body":"WW es un fighter, por lo que tiene muchisimo balance entre damage y tank. Ademas, para los jugadores que tienen un nulo o basico concepto de jungleo, le conviene empezar con Warwick. Su stun hace que pase a stunear al tank mientras el ADC le hace el daño necesario (algo que, en tfs, deja mal posicionado al enemigo). Al andar con mucho Attack Speed tanto en mid como en late, a donde envie al laner enemigo a base tiene la ventaja de su laner y su W para voltear torreta, hacer drake y farmear un poco en jungla en cuestion de segundos. Si le agregamos que es un hipercarry, es el clasico champion que da vuelta una partida facilmente SIEMPRE que se organize bien. Probablemente pueda ganar un 5/6% de winratio ahora, pero depende de cuantos jugadores lo manejan y crean tacticas usandolo. Aun asi, no es un iniciador (el tipico rol del fighter), por lo que tendrias que tener el apoyo de UN iniciador en el pickeo de champs. \nY con las runas, las runas basicas de AD, o agregarle Attack Speed + AD en quints nomas. Dependiendo, obviamente, de si cambias la mejora del item de jungla a Warrior o no.","replies":[{"poster":"HyenaLoL","date":"2015-04-29T19:15:28.213+0000","up_votes":1,"down_votes":0,"body":"warwick no tiene stun, es un supress, funcionan de manera distinta","replies":[{"poster":"Jonshi","date":"2015-04-29T19:20:24.087+0000","up_votes":1,"down_votes":0,"body":"Diferencia entre supress y stun?","replies":[{"poster":"HyenaLoL","date":"2015-04-29T19:57:44.035+0000","up_votes":1,"down_votes":0,"body":"el stun se puede quitar con cimitarra, mikael, clean, w de gangplank\nel supres solo con cimitarra y w de gangplank\n\ny el stun se lanza y dura el efecto mientras que la mayoria de los supres (malz y ww, no aplica a skarner) son casteados por lo que se puede reducir su duracion al cortarlos con cc","replies":[{"poster":"Jonshi","date":"2015-04-30T21:31:08.560+0000","up_votes":1,"down_votes":0,"body":"Ok. Gracias","replies":[{"poster":"HyenaLoL","date":"2015-05-02T03:04:50.284+0000","up_votes":1,"down_votes":0,"body":"np, como son tipos de cc mas raros la gente los confunde seguido","replies":[{"poster":"Jonshi","date":"2015-05-07T23:10:01.534+0000","up_votes":1,"down_votes":0,"body":"Si, eso pasa cuando no estas muy informado del LoL. :v","replies":[]}]}]}]}]}]}]},{"poster":"Nombre ofensivo","date":"2015-04-29T17:13:48.313+0000","up_votes":1,"down_votes":0,"body":"esta buena tu guia pero siendo francos ww cuando apenas salio esta season era una de las cosas mas rotas que se vieron","replies":[{"poster":"HyenaLoL","date":"2015-04-29T19:14:31.134+0000","up_votes":1,"down_votes":0,"body":"no era un kassadin, y no era el, eran los items","replies":[]}]}]}