{"poster":"HyenaLoL","date":"2015-07-09T19:42:30.420+0000","title":"BLOQUEAR DE RANKED al campeon nuevo 1 semana desde su salida","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Tal como uds no quieren ver en competitivo a los campeones nuevos por el riesgo que representa desde bugs hasta stats muy fuera de lugar y demas\r\n\r\nNADIE quiere ver en su team un instapick de campeon nuevo sea cual fuere el rol que le toca y este con quien este.\r\n\r\nCreo que hablo incluso por los rioters que juegan dia a dia cuando digo que no queremos verlos hasta saber que estan minimamente practicados\r\ny mas cuando requieren interaccion con otros jugadores, como son kalista o thamkench, que no tengo ni puta idea de como usar su comida pero no paraban de comerme durante todo el game, me cancelaban autoataques que mataban, y salvaban a mis aliados. Caso particular. pero de algo que se repite de formas distintas cada vez que sale campeon nuevo","replies":[{"poster":"Rebkans","date":"2015-07-09T19:48:43.137+0000","up_votes":2,"down_votes":1,"body":"Si estoy dea cuerdo, yo todavia no lo he visto en rankeds pero deberia ser bloqueado hasta que la gente lo sepa usar correctamente.","replies":[]},{"poster":"Immeryse","date":"2015-07-09T19:50:06.392+0000","up_votes":1,"down_votes":0,"body":"A mi me gustaría que bloqueen a los nuevos champs pero no tanto porque mi equipo no sepa jugar con ellos, sino porque la mayoría no saben jugar CONTRA ellos xD","replies":[{"poster":"HyenaLoL","date":"2015-07-09T21:48:11.726+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Immeryse,realm=LAS,application-id=v7qsfXsE,discussion-id=mmEJc6FV,comment-id=0001,timestamp=2015-07-09T19:50:06.392+0000)\n>\n> A mi me gustaría que bloqueen a los nuevos champs pero no tanto porque mi equipo no sepa jugar con ellos, sino porque la mayoría no saben jugar CONTRA ellos xD\n\ntambien, es que trae un monton de complicaciones","replies":[]}]},{"poster":"Marz","date":"2015-07-09T20:16:18.543+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"potato support","date":"2015-07-09T20:42:45.402+0000","up_votes":1,"down_votes":0,"body":"como vengo diciendo, los niveles de \"maestria\" literalmente no reflejan que tan bueno sos con un champ, solo demuestran que jugaste x cantidad de partidos con estos.\n\nej: puedo jugar con un free champ contra alguien que tiene maestria lvl 5 con ese champ y ganarle igual.\n\n\nlo mejor para mantener la integridad competitiva es hacer como lo hacen en el ambito competitivo profesional, en el cual el champ esta deshabilitado por un periodo de tiempo.","replies":[{"poster":"Marz","date":"2015-07-09T21:08:43.113+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"HyenaLoL","date":"2015-07-09T21:47:37.620+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RedStrip,realm=LAS,application-id=v7qsfXsE,discussion-id=mmEJc6FV,comment-id=000300000000,timestamp=2015-07-09T21:08:43.113+0000)\n>\n> Estoy de acuerdo con que la maestría no refleja qué tan bueno sos, justamente lo que dije fue que poniendo un mínimo de maestría en ranked te da la garantía que el jugador ya ha jugado algunas partidas con el campéon en cuestión. Si es bueno o no jugando, es otro tema, y el sistema \"lo sabrá\" (?). De todas formas no me opongo a bloquear el campeón nuevo por un período de tiempo, solo me parecía una mejor solución usar las maestrías.\n\nla complicación de eso son los jugadores que manejan ciertos campeones (ej: yo manejo yorick que tenia 60% win ratio en la S3) y no saltan porque no se usaron desde la implementacion del sistema","replies":[]}]}]}]},{"poster":"datbion","date":"2015-07-09T20:01:37.772+0000","up_votes":1,"down_votes":0,"body":"eso haría que las ventas bajaran muchisimo. es decir, olvidate xd","replies":[{"poster":"HyenaLoL","date":"2015-07-09T21:45:11.867+0000","up_votes":1,"down_votes":0,"body":"quien lo compra para rankear? lo compran para usarlo y lo pueden usar tranquilamente en normals","replies":[]}]},{"poster":"Rito JeZylZ","date":"2015-07-09T21:03:22.707+0000","up_votes":1,"down_votes":0,"body":"ami en mi opinion NO LO AGAN en mi equipo y en el equipo enemigo les a ido bastante bien con jugadores que ya saben dominarlo y para mi opinion esta bien","replies":[]}]}