{"poster":"2801","date":"2015-08-04T01:05:21.570+0000","title":"Nuevo Campeon","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Hola Rito, queria ver si aceptan mi campeon para League Of Legends. \n\nNombre del Campeon: Mho, el rey vengador\n\nAP y AD\n\nCuerpo A Cuerpo\n\nGenero: Monstruo \n\n*Pasiva*: Heredero: Mho al usar una habilidad quema al enemigo por 3 segundos. esto inflinge el 5% de la vida de Mho.\n\n*Q*: Mho lanza un rayo que inflinge 150 de da&ntilde;o al enemigo. \n*Pasiva*: Mho recibe 3% mas de movimiento por 4 segundos.\n\n*W*: Mho crea ojos en el suelo, cual aliado lo pise recupera 5% de vida. Si el enemigo lo pisa, a este le quita 50 de da&ntilde;o magico.\n\n*E*: Mho se desplaza hacia un subdito enemigo. \n*Pasiva*: este ignitea al enemigo que se desplaza sacandole 25 de da&ntilde;o durante 2 segundos.\n\n*R* Mho crea un portal para teleportarse a cualquier parte del mapa. \n\nPrecio: PI: 4800 o 6300.\n\nHistoria: Mho era el hijo del rey, tal monstruo cual mirabas y presenciabas a la muerte cerca. Mho, al nacer el rey murio por un cazador. Nadie sabia quien y donde se encuentra el asesino. Mho salio del reino para buscar al cazador. Mho mientras lo buscaba encontro un enemigo del rey. Cassiopeia. Mho todavia no sabia que el dependia de una gran responsabilidad ya que seria el proximo rey. Mho se lanzo hacia Cassiopeia, dejandola gravemente herida, Cassiopeia veia como se le quemaba la piel, desde ahi Cassiopeia huyo. Mho no sufrio ni un rasgu&ntilde;o, y siguio su camino.\n\nMho encontro una cueva con un cazador, parecia ser para Mho. Mho se lanzo a asesinarlo y el cazador desaparecio, Mho empezaba a alucinar de que tambien lo mataria a el. pero Mho se lanzo hacia el ruido y logro atrapar el cazador. Tuvieron una lucha muy fuerte, el cazador revelo que se ha metido en problemas, y huyo. Mho ha quedado feliz de tratar de vengar a su padre. \n\n&#039;&#039;Cuando Buscas Algo y lo encuentras, aveces desearas no haberlo encontrado&#039;&#039;\n-Mho\n\nMho: https://www.google.com.ar/search?q=fotos+del+rey+monstruo&rlz=1C1RZHW_enAR651AR651&espv=2&biw=1038&bih=621&tbm=isch&tbo=u&source=univ&sa=X&ved=0CBsQsARqFQoTCLKR1JudjscCFcNWHgodhv8NLg#imgrc=rcydKiLTi3eYQM%3A\n\n*Aspectos*: - Mho la venganza ardiente: https://www.google.com.ar/search?q=fotos+del+rey+monstruo&rlz=1C1RZHW_enAR651AR651&espv=2&biw=1038&bih=621&tbm=isch&tbo=u&source=univ&sa=X&ved=0CBsQsARqFQoTCLKR1JudjscCFcNWHgodhv8NLg#imgdii=rcydKiLTi3eYQM%3A%3BrcydKiLTi3eYQM%3A%3ByTwsksejenRZeM%3A&imgrc=rcydKiLTi3eYQM%3A","replies":[{"poster":"JinxLaLinda","date":"2015-08-04T06:57:45.786+0000","up_votes":1,"down_votes":0,"body":"Critica constructiva, y destructiva... debes expresarte mejor, porque muchas habilidades no se entienden, la E por ej. se desplaza hacia un subdito, osea que no sirve nada mas que para ir hacia un subdito?, el ignite a un enemigo que se desplaza?, en que sentido?, no seria muy fruta un pj que te este pegando todo el dia 25,25,25,25,25 con una pasiva?, porque en el juego temprano arruinaria a todos... demasiadas pasivas... La idea esta buena, pero mejorale las habilidades, explicate mejor, y sacale un par de pasivas o que sean mas razonales.","replies":[{"poster":"2801","date":"2015-08-05T21:55:35.729+0000","up_votes":1,"down_votes":0,"body":"a demas, Gangplank el nuevo rework prende fuego en basicos. ._. creo q gangplank es mas fruta que esta vercion xD","replies":[]},{"poster":"2801","date":"2015-08-05T14:58:25.276+0000","up_votes":1,"down_votes":0,"body":"ya lo he cambiado, fijate en mi perfil!!","replies":[]}]},{"poster":"Steel","date":"2015-08-05T15:53:51.349+0000","up_votes":1,"down_votes":0,"body":"por ultimo deja alguna imagen in boseto .. algo","replies":[]},{"poster":"4hsy","date":"2015-08-04T09:15:54.689+0000","up_votes":1,"down_votes":0,"body":"las habilidades son.... muy.....como normales por asi decirlo, si quieres que riot tome en cuenta tu idea de campeon tiene que ser nuevo, inovador, con skills que no se hallan visto nunca.  la Q me recordo a ryze la W es como un santuario de bardo. la e no la entendi si te soy sincero, y la R es un tp. , aunque la pasiva creo que safa un poco. \n\nSalu2 :D y ojala pueda updatear tu campeon a unos niveles en que riot lo tome en cuenta\n{{champion:20}} {{summoner:11}}\n\nPd: la historia esta bastante entretenida,\nPd2: no te sirve de nada poner valor : 4800-6300 todos los campeones que salen si son NUEVOS cuesta 7800 y al cabo de 1 semana se rebajan a 6300 y de ahi a que bajen a 4800 estaran un buuuuueeeen rato.","replies":[{"poster":"2801","date":"2015-08-05T14:42:38.183+0000","up_votes":1,"down_votes":0,"body":"Gracias, estaba pensando en cambiarlo, te explico la E, yo supuestamente esa E era para otro personaje, la E de Mho se basa en que vuela y stunea al enemigo, yo use copy-paste tengo demasiados champs para publicar, la Q la verdad tienes razon, pero no se me ocurria alguna otra cosa, por ahora estoy pensando si publicar de nuevo el champ pero con las habilidades que debian, tengo como 5 carpetas con personajes, gracias por comentar!!","replies":[]}]},{"poster":"Sir Crucifix ","date":"2015-08-04T02:04:36.525+0000","up_votes":1,"down_votes":0,"body":"mho < {{champion:114}}","replies":[]},{"poster":"GámerS","date":"2015-08-04T01:15:57.582+0000","up_votes":1,"down_votes":0,"body":"repetis la palabra mho como 40 veces, cada frase la empezas con mho esto mho lo otro xD","replies":[{"poster":"2801","date":"2015-08-04T01:17:27.398+0000","up_votes":1,"down_votes":0,"body":"{{item:3151}}","replies":[{"poster":"Rayxah","date":"2015-08-04T01:58:41.487+0000","up_votes":1,"down_votes":0,"body":"Mundo gustar publicación. ¡Mundo! {{champion:36}}","replies":[{"poster":"2801","date":"2015-08-04T02:03:19.048+0000","up_votes":1,"down_votes":0,"body":"Gracias ¡Mundo!  {{champion:36}}","replies":[]}]}]},{"poster":"2801","date":"2015-08-04T01:19:07.614+0000","up_votes":1,"down_votes":0,"body":"solo lo dije 19 veces :'v","replies":[]}]}]}