{"poster":"2801","date":"2017-07-04T14:58:37.632+0000","title":"¿Y mis recompensas?","subforum":"Problemas Técnicos","up_votes":4,"down_votes":4,"body":"Miren, primero que todo me enfada que tenga que poner dinero para cajas porque no me dan lo que aparece que me da!\r\nTermino una partida con Zac, S me dice has ganado un cofre + la pieza de m7.\r\nTodo bien voy al loot y no tengo nada riot.\r\nMas que me dan 3 honores, dicen que fui el mas honorable de la partida pero ningun fragmento.\r\nYo opino que antes de sacar el honor tendr&iacute;an que haber previsto si iba a funcionar porque no funciona.\r\nMe dieron un solo fragmento de llave despu&eacute;s de 2 dias de que haya ganado los 3 honores, y eso fue apenas sali&oacute; el honor.\r\nArreglen esto porque de verdad me enfada muchisimo que no pueda ganar cosas gratis.","replies":[{"poster":"minecrafgamer777","date":"2017-07-04T14:59:54.636+0000","up_votes":2,"down_votes":0,"body":"olle amigo relajate","replies":[{"poster":"2801","date":"2017-07-04T15:03:03.945+0000","up_votes":1,"down_votes":0,"body":"Estoy completamente relajado, pero si van a sacar algo nuevo, en el PBE se ven los errores y creo que no se han fijado en los errores que causa ahora, esa es mi opinión","replies":[{"poster":"minecrafgamer777","date":"2017-07-04T15:09:40.276+0000","up_votes":1,"down_votes":0,"body":"pero no es error ah si es el sistema la llave no es auto matica","replies":[{"poster":"2801","date":"2017-07-04T21:04:59.004+0000","up_votes":1,"down_votes":0,"body":"Es error del juego, que no me den lo que me aparece que he ganado esta mal.","replies":[]}]}]}]},{"poster":"PlatiNami","date":"2017-07-04T15:05:43.562+0000","up_votes":1,"down_votes":0,"body":"lo del loot deberias haberle sacado captura a la notif. de que recibiste caja + pieza y mandar un ticket si relogueando no aparecen, pero no tiene que ver con el honor, son 2 cosas aparte ^^ y lo otro, es random tengo entendido, no siempre vas a conseguir llaves por mucho honor que recibas. a mí me dan honor en un 95% de partidas tranquilamente y apenas me dieron 2 fragmentos desde que empezó :)","replies":[{"poster":"2801","date":"2017-07-04T15:07:12.479+0000","up_votes":1,"down_votes":0,"body":"Si, eso lo tuve que haber hecho.\nVoy a empezar a hacerlo por si ya no me sale en el loot.\nRelogee como 5 veces creo, y no tengo ninguna de esas cosas que ''me he ganado''\nIgual siento que 3 honor tendrían que ser un frag de llave y que los honores se acumulen para subir de nivel.\nGG","replies":[]}]},{"poster":"2801","date":"2017-07-04T15:02:26.458+0000","up_votes":1,"down_votes":0,"body":"> Termino una partida con Zac, S me dice has ganado un cofre + la pieza de m7.\n> Todo bien voy al loot y no tengo nada riot.\n\nLo de Zac me apareció, pero el mensaje del cofre me sale pero no tengo el cofre ni los fragmentos que en teoria deberia ganar.","replies":[]}]}