{"poster":"2801","date":"2017-11-12T13:26:19.883+0000","title":"Problema con la mejora de maestrías.","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"&iexcl;Hola!\nYo sinceramente creo que esto de que valgan 3900 esencias las de maestr&iacute;a 7 y 3250 las de maestr&iacute;a 6 esta perfecto...\n\nPeeeeeeero...\nhttps://gyazo.com/5c79545c9e2251132bd108b11b000349.png\n\n''Desbloquear con un Lee Sin permanente'' si recuerdan, ya no se puede hacer re-roll de campeones, b&aacute;sicamente no te puede salir ese campe&oacute;n en un intercambio, entonces &iquest;como se consigue eso? comprado fragmentos de campeones que valen casi lo mismo que mejorarla y con la posibilidad que ni te salga...\n\nNo se que opinan, yo opino que deber&iacute;an sacar eso y poner otro m&eacute;todo o inclusive borrarlo directamente o regresar el re-roll.","replies":[{"poster":"IgeiTon","date":"2017-11-12T15:50:07.192+0000","up_votes":2,"down_votes":0,"body":"Mira el nuevo sitema esta orientado a que inviertas dinero si queres algo, Nerf a las esencias narnajas, osea queres una skin en particular comprala o juga y reza a odin para que en algun momento te salhga y tengas lo necesario para upgradearla. Queres jugar un campeon especifico? Reza a odin nuevamente o jugate mill partidas para subir de lvl, queres mostrarle a los demas cuan bueno sos con un campeon, ps lo mismo, farmea a lo idiota, oooooooooo sino tenes otra opcion que es meter dinero, comprarte los campeones por RP y sus skins por RP y las esencias azules las usas para las maestrias y pajinas de runas adicionales. Te quedo claro o lo intento con manzanas? PD: lo de las manzanas era un chiste ;)","replies":[{"poster":"DEBIRUMAN","date":"2017-11-12T16:07:12.325+0000","up_votes":1,"down_votes":0,"body":"como compras hojas de runas ?\nahora en el nuevo sistema xD","replies":[{"poster":"IgeiTon","date":"2017-11-12T16:14:51.132+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DrNerfThisPardo,realm=LAS,application-id=v7qsfXsE,discussion-id=3gVb9hit,comment-id=00000000,timestamp=2017-11-12T16:07:12.325+0000)\n>\n> como compras hojas de runas ?\n> ahora en el nuevo sistema xD\n\nDE la misma manera que antes, por RP o EA (antes usabas pi) igual te recomiendo esperar al 2x1 de paginas, osea, calculo que eso no lo van a sacar, o mejor dicho espero que no lo saquen sino seria el descaro maximo. Saludos","replies":[{"poster":"2801","date":"2017-11-12T17:31:38.574+0000","up_votes":1,"down_votes":0,"body":"Y si... hay que pagar, pero el post no está orientado en eso, si no en que hay una opción que ya no sirve para nada en la mejora de maestrías.","replies":[]}]}]}]}]}