{"poster":"2801","date":"2017-07-17T17:29:48.877+0000","title":"Descuentos de PI semanales","subforum":"Creaciones de la comunidad","up_votes":20,"down_votes":4,"body":"Hola, pues se me ha ocurrido esta idea pensando en el PI que tengo, y pues, como hay descuentos de RP en campeones, me encantaria por cada semana, un descuento de PI para X campeones, en vez de un descuento de RP.\nYa que ha mi idea, comprar campeones con RP es una forma de malgastar dinero aun que lo haya hecho.\nSeria mejor las ofertas de RP solo para skins, ward skin, pero no para campeones, ya que se pueden conseguir de forma gratuita.\n","replies":[{"poster":"devilman10","date":"2017-07-18T10:15:39.221+0000","up_votes":1,"down_votes":0,"body":"Yo solo pido 5% de descuento en pagina de runas y 5% mas de probabilidad de que te toque esencia en los fragmento de campeón","replies":[{"poster":"Flip","date":"2017-07-18T20:51:28.797+0000","up_votes":1,"down_votes":0,"body":"cambiaran las runas y maestrías dentro de poco así que seria inútil","replies":[{"poster":"devilman10","date":"2017-07-18T22:02:25.687+0000","up_votes":1,"down_votes":0,"body":"pero las paginas de runas queda igual","replies":[]}]}]},{"poster":"Mobius One","date":"2017-07-17T22:52:49.428+0000","up_votes":1,"down_votes":0,"body":"La idea me gustaría a mí y a todos los que sentimos que nuestro tiempo vale mucho más que el poco PI que nos dan por partida. Pero mi razón que me contradice es esta:\n\nEs un juego free to play. SIEMPRE van a querer incitarte a que compres el RP porque eso es lo que los mantiene. Sucede con todos! Fijate algún jueguito de Android de esos que tenés que construir tu base y tarda tiempo real en terminar un edificio. Sólo te da la opción para terminarla al instante con moneditas que se consiguen sólo con dinero real (o que te dan 5 o 10 cada cierto tiempo pero la actividad más barata te sale 1000 moneditas).\n\nJuego hace 4 años y Riot NUNCA hizo un descuento de PI, excepto los 2x1 en runas, pero porque eso es, un 2x1. Luego en campeones, se justifican con que les bajan el precio a los campeones cada vez que sale otro, pero para mí eso no es suficiente ya que algunos no nos gastamos el PI sólo en campeones, también están los chromas o íconos que salen en los eventos, y coleccionar cosas del juego sin gastar dinero cada vez se vuelve más difícil (claro ejemplo, el evento de Navidad y el del Deleite Lunar).\n\nLa única ventaja de todo esto es que no hay nada que el dinero real haga a un jugador mejor que otro.","replies":[]}]}