{"poster":"Xenic","date":"2016-10-18T09:08:39.724+0000","title":"LeaverBuster Given in Error?","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"My client wouldn't load. I had to force-close the client, and eventually I loaded and got into the game. After I loaded, I bought my items, and began to move into lane. I even typed something. Then the surrender yes/no option came up, I clicked no, as well as a second person clicked no - the three others clicked yes. So the game was remade, and I was issued my FIRST LeaverBuster. Someone even in chat asked why they clicked yes when I had came back.\r\n\r\nLike I said, I bought items, typed in chat and began moving into lane, and the surrender option had 5 spaces (as opposed to the usual 4 when someone isn't there).","replies":[{"poster":"Porocles","date":"2016-10-18T17:05:30.601+0000","up_votes":1,"down_votes":0,"body":"What game was this for?  During the time of your thread here, the servers may have taken down ranked for an update so there may have been issues but all games ended as ties.  I don't see any games in your history where you were marked for leaver.  Let me know if this is still an issue!","replies":[{"poster":"Xenic","date":"2016-10-21T08:59:55.422+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Porocles,realm=NA,application-id=osqw6G4M,discussion-id=L9Enx9d0,comment-id=0002,timestamp=2016-10-18T17:05:30.601+0000)\n>\n> What game was this for?  During the time of your thread here, the servers may have taken down ranked for an update so there may have been issues but all games ended as ties.  I don&#x27;t see any games in your history where you were marked for leaver.  Let me know if this is still an issue!\n\nIt wasn't a ranked game, it was just a normals. But if you don't see one in my history, that's great then. I doubt I'd get another, as that was my first one. But a pop up did come up asking me to agree to the leaverbuster thing. Maybe it was just a warning then.","replies":[]}]},{"poster":"Nergaaal","date":"2016-10-18T16:55:39.123+0000","up_votes":1,"down_votes":0,"body":"Apparently Riot thinks you need to have a kill by 3 mins and perhaps take down an inhibitor for you not to be tagged as inactive.","replies":[]},{"poster":"GreatKingCurtis","date":"2016-10-18T10:58:36.886+0000","up_votes":1,"down_votes":0,"body":"Same thing happened to me in dis mother fcker man","replies":[]}]}