{"poster":"Vileplume","date":"2017-12-23T10:48:48.274+0000","title":"Soy yo o Riot Games parece tener la mentalidad de Dr. Mundo?","subforum":"Charlas Generales","up_votes":35,"down_votes":10,"body":"Estaba leyendo el &quot;Preg&uacute;ntale a Riot: URF&quot; y yo ya no s&eacute; si esta gente es especial o que.\r\n\r\nCito: &quot;URF causa que algunas personas dejen de jugar LoL, pero a muchos jugadores realmente les encanta. Entonces, en vez de matar URF, seguiremos experimentando para encontrar una versi&oacute;n m&aacute;s sana del modo. Dinos qu&eacute; piensas de URFAR Nevado; escucharemos y aplicaremos lo aprendido en la pr&oacute;xima aparici&oacute;n de Fuego Ultrarr&aacute;pido Aleatorio.&quot;\r\n\r\nCabe destacar: &quot;**Entonces, en vez de matar URF, seguiremos experimentando para encontrar una versi&oacute;n m&aacute;s sana del modo.**&quot;\r\n_Riot no se si se dieron cuenta, pero cada vez que sale una nueva versi&oacute;n de URF, m&aacute;s cansina es. URF ya muri&oacute; y siguen experimentando y volviendo a matar con algo que est&aacute; muerto._\r\n\r\nURF No causa que algunas personas dejen de jugar LoL, sus propias decisiones dentro del juego hacen que dejen de jugar. S&oacute;lo vuelven para lo mejor que ~~tiene~~ ten&iacute;a el juego. Un gran porcentaje de la comunidad lolera a nivel global se queja del nuevo sistema de esencias y nivel, esos jugadores dejan de jugar... Pero ven que vuelve URF y juegan un rato. Se fijan como est&aacute; compuesto este nuevo &quot;&quot;&quot;&quot;&quot;&quot;URF&quot;&quot;&quot;&quot;&quot;&quot; y vuelven a dejar de jugar. As&iacute; de simple riot\r\nTenemos 5 banneos por equipo pero hay que hacerlo todo random (tocan siempre los mismos campeones).\r\n\r\nOtra cosa que cabe destacar: [&hellip;] &quot;**escucharemos y aplicaremos lo aprendido en la pr&oacute;xima aparici&oacute;n de Fuego Ultrarr&aacute;pido Aleatorio.**&quot;\r\n\r\nRealmente Riot Games aprende algo de la queja de sus jugadores?\r\n\r\nhttps://nexus.leagueoflegends.com/es-ar/2017/12/ask-riot-urf/\r\n\r\nSalu2 {{sticker:galio-happy}}","replies":[{"poster":"Yamisuke","date":"2017-12-23T16:42:57.412+0000","up_votes":18,"down_votes":0,"body":"{{champion:36}} MUNDO ARCHIVAR","replies":[{"poster":"30KT","date":"2017-12-23T18:10:13.374+0000","up_votes":1,"down_votes":0,"body":"Venia a comentar eso nomas, likazo.","replies":[{"poster":"RosarinoComefeto","date":"2017-12-24T04:40:16.224+0000","up_votes":1,"down_votes":0,"body":"+10","replies":[]}]}]},{"poster":"Braian Oliva","date":"2017-12-23T11:30:59.149+0000","up_votes":10,"down_votes":1,"body":"Un post perfecto +1","replies":[{"poster":"Nuke","date":"2017-12-23T20:46:46.516+0000","up_votes":5,"down_votes":3,"body":"No se si entendieron bien.\nDicen que URF atrae muchísimos jugadores, pero luego, al acabar el evento, MUCHÍSIMOS jugadores dejan el juego en comparación a ANTES DE QUE PUSIERAN URF (Y eso no se recupera rápido, si es que se recupera), creo que en el caso de NA una vez perdieron la mitad de jugadores en la región. No tiene nada que ver las \"decisiones dentro del juego\", porque no cualquier dia del año tantas personas dejan de jugar LoL.\n\nConclusión: El causante de que esos jugadores dejen el juego es URF.\n\n> Otra cosa que cabe destacar: […] \"escucharemos y aplicaremos lo aprendido en la próxima aparición de Fuego Ultrarrápido Aleatorio.\"\n> Realmente Riot Games aprende algo de la queja de sus jugadores?\n\nSus quejas no dicen nada. Solo dicen \"Devuelvan el URF\", eso no sirve. Justamente ellos dicen que es el causante de que muchas personas dejen de jugar. La única propuesta que leí y recuerdo es la de que ahora tenemos 10 baneos. Pero vamos, dudo mucho que algo tan simple solucione las cosas.\n\n> Cabe destacar: \"Entonces, en vez de matar URF, seguiremos experimentando para encontrar una versión más sana del modo.\"\nRiot no se si se dieron cuenta, pero cada vez que sale una nueva versión de URF, más cansina es. URF ya murió y siguen experimentando y volviendo a matar con algo que está muerto.\n\nEllos intentan que no pierdan tantos jugadores y a la vez que la gente disfrute URF.\nSi vos fueras hipotéticamente el lider máximo de RIot y vieras que luego de que URF sale la mitad de jugadores deja de jugar por un muy buen tiempo (O no vuelven), ¿Dejarías el modo? Seguramente si, pero ahora, muchas personas quieren jugar a este modo. Y vos, como sos buena persona, vas y se lo ponés pero con modificaciones para eviar efectos secundarios.\nURF no murió, estás re paranóico, y no \"lo están matando\", mas bien intentan revivirlo. \n\nPero URF el manatí, murió. Si, no va a volver, no les voy a mentir: Murió dolorosamente.\n\nSaludos.","replies":[{"poster":"Reavenn","date":"2017-12-24T00:41:14.181+0000","up_votes":2,"down_votes":2,"body":"> Dicen que URF atrae muchísimos jugadores, pero luego, al acabar el evento, MUCHÍSIMOS jugadores dejan el juego en comparación a ANTES DE QUE PUSIERAN\n\nVos mismo lo decís ATRAE MUCHA GENTE, y al acabar muchísima gente abandona el juego. La mayoría de esa gente que atrae es la gente que no juega mas lol y que solo volvía a jugar por URF, pero ahora con los  cambios no regresa tanta gente ya que no les gusta, a pesar de que a mi este me gusto aunque lo juegue muy poco y en el PBE,porque me fui de vacaciones :(.\n\n> Conclusión: El causante de que esos jugadores dejen el juego es URF.\n\nConclusión : El causante de que esos jugadores regresen y dejen el juego es urf","replies":[{"poster":"Nuke","date":"2017-12-24T04:21:10.656+0000","up_votes":1,"down_votes":1,"body":"> Vos mismo lo decís ATRAE MUCHA GENTE, y al acabar muchísima gente abandona el juego. La mayoría de esa gente que atrae es la gente que no juega mas lol y que solo volvía a jugar por URF\n\nEntendiste para el orto xD.\nVolvé a leer:\n\n> Dicen que URF atrae muchísimos jugadores, pero luego, al acabar el evento, MUCHÍSIMOS jugadores dejan el juego en comparación a ANTES DE QUE PUSIERAN URF (Y eso no se recupera rápido, si es que se recupera)\n\nLo puse en mayúsculas. La pérdida es del público de ANTES de poner el juego URF, no mientras estaba disponible URF.\nEjemplo:\n\n- Hay 100 personas jugando LoL, todo el año estuvieron jugando un aproximado de 100 personas. \n- Ponen URF y ahora juegan al LoL 200 personas. \n- Sacan URF y ahora hay un aproximado de 50 personas jugando LoL. Y tarda mucho en recuperarse jugadores para que sea como antes, y muchos no se recuperan. \n\n¿Quedó mas claro?\nTienen menos jugadores en comparación a ANTES de que pongan URF, no mientras... Si no, es super tonto :P\n\nConclusión: El causante de que esos jugadores dejen el juego es URF.","replies":[{"poster":"Reavenn","date":"2017-12-24T05:56:19.499+0000","up_votes":1,"down_votes":0,"body":"Yo comprendi eso, y lei el post de rito y lo entendi perfectamente. Nunca quise decir que todos los jugadores que se van son los que regresan por urf, sino que es la mayoría de la gente, por ahi me exprese mal. Es entendible que una parte de los jugadores deje el juego luego de urf y esto tiene varias razones no solo por el modo en si. Por ejemplo en mi caso la 2 vez que salio urf me acuerdo que lo jugué muchísimo y me divertía muchísimo, especialmente con amigos, aunque después de jugar algunas partidas siempre me jugaba alguna normal para no perder la costumbre de como era una partida real. Una vez que termino el urf y volví a jugar me acuerdo que las personas eran super toxicas a comparación de urf que no había toxicos o por lo menos no al mismo nivel y eso me saco las ganas de jugar, a tal punto de que lo deje por 3 semanas porque no tenias ganas de jugar asi ( si  se lo del mute y todo eso pero siento que muchas veces me pierdo cosas interesantes que pueden decir sobre la partida y que el flameosolo se les escapo o fue un momento de calentura). Tengo otros amigos que descansaron un  poco del juego despues del vicio que pegamos, otros que solo volvieron por urf, otros que  después  del urf no volvieron a tocar el juego por que ya no les parecía divertido .Como ves hay MUCHÍSIMAS razones por las que la gente  abandona el juego y no todas estan totalmente relacionadas con la jugabilidad del modo. \nEntiendo que rito es una empresa y que lo principal para ellos es la cantidad de jugadores, pero no creo que modificar el urf (aunque a mi no me molesto, pero comprendo a la gente que si) para que te toque un champ que no te gusta usar, que te aburre o que simplemente no tenes ganas de usarlo o para jugar desanimado, porque sabes que esa partida se perdió desde la selección de campeon comparando los dos equipos, sea la solución. Creo que ahora con los 10 bans seria muy razonable poner el urf normal, o incluso se podrían tomar otras medidas como limitar la cantidad de veces que podes elegir un mismo campeón cada cierto  número de partidas o algo así. \nEsto de los champs al azar también afecta mucho a youtubers, un ejemplo es vandiril, que hizo un montaje de trynda ap pero en los comentarios tuvo que pedir disculpas en cierta manera por lo que tardo en sacar video, diciendo que tardo por lo difícil de que es que te toque el mismo champ.\nAdemas algo que nunca entendí  ( esto no tiene nada que ver con la discusión pero siempre me lo pregunte lol) ¿Por qué  las personas que decían que urf era para divertirse, se quejaban de que siempre se repetian los mismos champs op? Si ellos lo juegan para divertirse no deberían molestarse que del otro equipo haya un zed por ejemplo, total ellos pueden divertirse igualmente aunque no ganen. Por lo menos eso es lo que pienso yo, nunca me molesto mucho perder en urf y siempre trataba de llevar campeones con los que me iba a divertir sin importar el resultado de la partida o los campeones del otro equipo, la cantidad de veces que me reí jugando urf cada vez que me deleteaban/ yo deleteaba es enorme, así que no veo razón en quejarse por eso\n\nPerdón por el testamento que escribí lol","replies":[]}]}]}]}]},{"poster":"iLegault","date":"2017-12-23T14:51:54.286+0000","up_votes":8,"down_votes":2,"body":"Este urf solo es un intento desesperado de vender sus skins feas de navidad","replies":[{"poster":"ICrookShanks","date":"2017-12-23T15:45:09.937+0000","up_votes":2,"down_votes":1,"body":"diste justo en el clavo campeon jajajaja","replies":[]}]},{"poster":"Piedravidente","date":"2017-12-23T12:39:17.876+0000","up_votes":5,"down_votes":4,"body":"Estoy seguro que Riot tiene más info para decidir sobre lo que es conveniente para la empresa afectando lo mínimo posible al cliente/consumidor, aunque a veces se equivoquen. Salu2","replies":[{"poster":"Vileplume","date":"2017-12-23T13:38:16.874+0000","up_votes":7,"down_votes":2,"body":"Por eso mismo el servidor de Latinoamérica Sur está como está\nSe cae más que una vieja sin bastón","replies":[]}]},{"poster":"Johnny16","date":"2017-12-24T16:25:15.623+0000","up_votes":2,"down_votes":0,"body":"10/10 sin comentarios","replies":[]},{"poster":"Cloud9 Gun","date":"2017-12-23T20:52:59.763+0000","up_votes":2,"down_votes":0,"body":"Aguante el urf comun que este arurf es el mas feo de todos","replies":[]},{"poster":"KillgoreZ","date":"2017-12-23T16:17:08.295+0000","up_votes":5,"down_votes":4,"body":"Soy el único al que le gusto urf? seguro porque no jugué el anterior {{champion:105}}","replies":[{"poster":"BlackMargoiv","date":"2017-12-24T01:06:58.493+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=KillgoreZ,realm=LAS,application-id=v7qsfXsE,discussion-id=YksR1vQ8,comment-id=0006,timestamp=2017-12-23T16:17:08.295+0000)\n>\n> Soy el único al que le gusto urf? seguro porque no jugué el anterior {{champion:105}}\n\nMira como te llenan de negativos XD","replies":[{"poster":"KillgoreZ","date":"2017-12-24T05:34:44.967+0000","up_votes":1,"down_votes":0,"body":"Pos no paso nada :p","replies":[]}]},{"poster":"Nuke","date":"2017-12-23T20:50:32.795+0000","up_votes":1,"down_votes":0,"body":"Si te seo honesto no me gustó ni el  último URF y mucho menos me gustó el último ARURF. No se por qué, pero este ARURF navideño si que lo estoy disfrutando, será porque lo estoy jugando con amigos xD.","replies":[]}]},{"poster":"Thortilla86","date":"2017-12-23T23:36:35.927+0000","up_votes":2,"down_votes":1,"body":"una de las cosas que mencionaban era que algunos jugadores podrian quedarse saturados con urf y luego dejar de jugar para descanzar pero luego no volvian, ademas del problema de las caidas del server.\n\nuna posible solucion seria poner urf normal pero limitar a los jugadores la cantidad de partidas de urf al dia o algun sistema de \"tickets de entrada\" para jugar urf que se ganen jugando normales.","replies":[]},{"poster":"PantaBlack","date":"2017-12-24T14:29:00.211+0000","up_votes":1,"down_votes":0,"body":"Mmmmm... Quien sabrá más, gente que tiene acceso a estadísticas, archivos y cuentas de el juego o alguien que se queja de que no puede seleccionar campeón en su amado urf?","replies":[{"poster":"Vileplume","date":"2017-12-25T07:15:06.197+0000","up_votes":1,"down_votes":0,"body":"Tenés a mas de media comunidad lolera quejandose sobre lo mismo. El cliente siempre tiene la razón c:","replies":[]}]},{"poster":"El Mago Oscuro","date":"2017-12-23T15:15:11.208+0000","up_votes":2,"down_votes":2,"body":"Me recordó al meme de \" para,ya está muerto\" ,pero si,deberian leer lo que quiere la comunidad y tratar de darlo,sin que ellos pierdan,ni nosotros.","replies":[{"poster":"Nuke","date":"2017-12-23T20:48:21.670+0000","up_votes":1,"down_votes":1,"body":"> pero si,deberian leer lo que quiere la comunidad y tratar de darlo,sin que ellos pierdan,ni nosotros.\n\nEs exactamente lo que están haciendo... Pero ellos no tienen una varita mágina que haga que todo sea posible, y como humanos lo intentan y se equivocan. Se van a equivocar mucho mas hasta que puedan encontrar una solución; Son humanos, no magos.\nLeé:\n\n> \"URF causa que algunas personas dejen de jugar LoL, pero a muchos jugadores realmente les encanta. Entonces, en vez de matar URF, seguiremos experimentando para encontrar una versión más sana del modo.\"","replies":[{"poster":"Send Núdes","date":"2017-12-23T23:00:28.572+0000","up_votes":1,"down_votes":0,"body":"Ahora vamos a ver como hacen eso con one for all:#","replies":[{"poster":"Nuke","date":"2017-12-24T04:26:14.677+0000","up_votes":1,"down_votes":0,"body":"Hasta ahora jamás dijieron algo como que OFA hace que jugadores dejen el juego.","replies":[{"poster":"Send Núdes","date":"2017-12-24T14:30:19.468+0000","up_votes":1,"down_votes":0,"body":"Van a salir con el ''Este juego es insano por x razon'' y lo van a hacer aleatorio.\ny la forma seria.\n''Tocan 5 sin que los elijamos. todos al 20% y al terminar el tiempo se escoje uno''\ny asi seria re feo xd\nPero esperemos que para 2018 ni piensen en tocarlo","replies":[]}]}]}]}]},{"poster":"Miss Waldorf","date":"2017-12-24T07:14:07.383+0000","up_votes":1,"down_votes":0,"body":"Qué linda es la gente q pretende q una empresa multimillonaria como Riot Games escuche las quejas u opiniones de sus usuarios, preferible ilusionarse con eso q con volver a jugar un urf decente ;(","replies":[]},{"poster":"myth of misifo","date":"2017-12-24T05:16:17.751+0000","up_votes":1,"down_votes":0,"body":"dsp del inecesario rework a rengar me quedo claro","replies":[]},{"poster":"GDPhyros","date":"2017-12-24T05:10:28.546+0000","up_votes":1,"down_votes":0,"body":"estoy deacuerdo, historicamente riot no escucha a sus usuarios, no se renueva, no hace su juego mas atractivo.\nLo mas destacable es sacar un campeon nuevo, absurdamente roto, y corregirlo un poco para que no afecte tanto el juego.\n\nriot no escucha a sus jugadores y de a poco los esta perdiendo.","replies":[]},{"poster":"Gothic Crocodile","date":"2017-12-23T14:58:04.586+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Nuke","date":"2017-12-23T20:51:12.057+0000","up_votes":1,"down_votes":0,"body":"No dicen que no puedas, dicen que el causante de esa decición es URF, y por ende no pueden ponerlo porque pierden mucha gente.","replies":[]}]},{"poster":"Teemokeo","date":"2017-12-23T11:36:56.167+0000","up_votes":1,"down_votes":0,"body":"la respuesta es no, no lo hacen.","replies":[]},{"poster":"FedecarboneroUY","date":"2017-12-23T19:15:49.111+0000","up_votes":1,"down_votes":5,"body":"Para mi que tendrían que hacer 2 colas, pero no lo van a hacer porque no hay presupuesto (\"\"\"\"no hay\"\"\"\") entonces lo que deberían hacer es poner el URF AR que tanto a LA COMUNIDAD DE LAS LE GUSTA, y poner que se puedan jugar customs de urf COMUN, URF, para los que no nos gusta perder 20 minutos de nuestra vida con un champ aleatorio =)","replies":[]}]}