{"poster":"NewCodeCrash","date":"2017-05-30T15:44:58.353+0000","title":"Suche ADC-Main für Rankeds/Normals/Flex und zum Quatschen! :) (Männlich oder Weiblich)","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Heyho! :)\r\n\r\nMein Name ist Stefan und ich bin inzwischen 21 Jahre jung und mit Leib und Seele Support Main.:)\r\nIch spiele seit mehr als 2 Jahren League und bei mir hat sich inzwischen auch relativ viel Wissen angeh&auml;uft. :D\r\nMeine Mains sind Thresh,  Sona, Janna (spiele aber an sich alles). \r\nWar in S5 Silber 4, S6 (dank Platzierung in B4 und dadurch fehlender Motivation Bronze 1), und bin derzeit Bronze 4 mit 100 LP.\r\nDa ich derzeit sehr viel Zeit habe w&uuml;rde ich mich gern aus Bronze rauscarrien, allerdings ist es mit einem Mate oder einer Matine wesenlich angenehmer. :) und die Motivation geht nisso schnell fl&ouml;ten. :D\r\n\r\nAlso wenn du 16 Jahre oder &auml;lter, ein offener Mensch, kritikf&auml;hig und kritikgebend (denn Nobody&acute;s Perfect ;D), Bock auf Rankeds und Fun-Spiele, &uuml;ber TS3 oder Discord verf&uuml;gst und einfach nur Lust hast zu Quatschen und gechillt zu zocken, daaaaaannnn.....\r\n\r\nadd mich einfach ^.^\r\n\r\nFreu mich auf dich!!! ^-^\r\n\r\nIngame: NewCodeCrash","replies":[{"poster":"BTT Jukka","date":"2017-05-30T16:14:53.823+0000","up_votes":1,"down_votes":0,"body":"Hi ich bin der Julian 16 Jahre alt und derzeit Silber 3 98 Lp ADC Main.Ich wollte mich jetzt nicht als Duo Partner bewerben sonder wollte einfach mal Fragen ob du bock auf ein Team hast den ich und mein Team FDTC suchen zur Zeit einen Supporter und Top laner","replies":[{"poster":"NewCodeCrash","date":"2017-05-31T16:29:36.221+0000","up_votes":1,"down_votes":0,"body":"Ja hätte ich allerdings! :)\nHab dich geaddet! :3","replies":[]}]},{"poster":"Die Todesfaust2","date":"2017-05-30T16:10:02.212+0000","up_votes":1,"down_votes":0,"body":"heyho Ich bin Patrick 22 Jahre alt derzeit main adc bin Bronze 2 derzeit und spiele auch seit season 5 LoL also wenn du bock hast ich habe ts3 und suche immer leute mit denen man zusammen spielen kann.^^\n\nPS: War in s5 Bronze 3 in s6 war ich Bronze 4 oder so ka :p also adde mich wenn du bock hast.","replies":[]}]}