{"poster":"Venowolf","date":"2015-02-28T02:46:20.776+0000","title":"Tank Junglers: Enchantment : Cinderhulk = Please add more Tenacity items!","subforum":"Gameplay","up_votes":6,"down_votes":0,"body":"Well this issues come back again...\n\nThe Juggernaut enhanced pasive with Tenacity removed (on PBE). No more Tabis' etc ehh (Force to buy the Merc boots but don't bring teh same speed than the mobility boots)\n\nAnd there are only 2 items with Tenacity : zephyr or merc.boots . (and the situational Elixir of Iron)\n\nMaby it's time to create new item with tenacity or add to another item?\n\nNow that the \"Colussus\" enhanced lost the Tenacity passive, why  not add the Passive Tenacity to \"Righteous Glory\" the engage and init item ? It's by far the best item to have the Tenacity component, Tenacity have a lot of Synergy with the active of RG and the passive...\n\nEvery new champion that has come out (with the exception of Lucian but he's older now) has had CC.\n\nAlso the Cinderhulk are not compatible with {{item:3068}}  Sunfire Cape so this left an free slot to build another health/armor item... so why not a tenacity defensive items?\n\nI believe these items need  to give tenacity specially the Rigtheous Glory:\n\n\n{{item:3800}} {{item:3083}} {{item:3056}} \n\nThe {{item:3083}} can be a optional Tenacity buff because its more oriented to the \"long survability, so it's not a must but the {{item:3800}}  \"Righteous Glory\" and {{item:3056}}  \"Ohmwrecker\" are items oriented to init or engage a team figth and both are oriented to tanks so why not put the Tenacity component (Both items have a low popularity and this can increase considerable his usage IMO)\n     \nTenacity should be a  boot enhanced and Mercs need to be reworked.\n\nI don't think this is asking too much since every champion has some form of hard CC now.\n\nSo what other items should give tenacity?","replies":[{"poster":"Tsugaga","date":"2015-02-28T02:48:40.473+0000","up_votes":1,"down_votes":4,"body":"The juggernaut jungle item gives 35% tenacity.","replies":[{"poster":"Blackmage9","date":"2015-02-28T02:51:50.055+0000","up_votes":4,"down_votes":0,"body":"Not any more. It no longer exist.","replies":[{"poster":"Venowolf","date":"2015-02-28T03:03:12.167+0000","up_votes":2,"down_votes":1,"body":"Yep you are rigth! we need the tenacity item to engage like a true tanks.\n\nAlso Cinderhulk vs {{item:1011}} \n\n Cinderhulk put the {{item:1011}}  Giant Belt into a very under position, I think so that the {{item:1011}}  need a cost reduction to 950g to no be overshadow. IMO","replies":[]}]},{"poster":"Venowolf","date":"2015-02-28T02:51:34.548+0000","up_votes":3,"down_votes":0,"body":"Nope in PBE Juggernaut has been removed now we have the Cinderhulk instead of that.\n\nsource: http://www.surrenderat20.net/2015/02/227-pbe-update.html\n\nIt's that the reason why I make this new post, because the tenacity options each time are lesser...","replies":[]}]},{"poster":"aaronconlin","date":"2015-02-28T06:26:32.338+0000","up_votes":3,"down_votes":0,"body":"You said something about Colossus, I think that could be a cool name for a new item.\n{{item:1011}} + {{item:3067}}\n+600 Health\n+10% Cooldown Reduction\nUNIQUE Passive: Tenacity\nUNIQUE Passive: Reduces damage by 10% from enemies with impaired movement. ","replies":[{"poster":"Duke Anax","date":"2015-02-28T14:40:27.333+0000","up_votes":1,"down_votes":0,"body":"A nice start but for a Colossus it seem a bit small, maybe add another {{item:1028}} or a {{item:1033}}  CC is often paired with Magic damage.","replies":[{"poster":"aaronconlin","date":"2015-02-28T16:25:15.233+0000","up_votes":1,"down_votes":0,"body":"I was also thinking maybe a % damage reduction, to counteract % health damage","replies":[]}]},{"poster":"Venowolf","date":"2015-02-28T13:38:51.842+0000","up_votes":1,"down_votes":0,"body":"I love engage and init tf with tank junglers but without the tenacity in the Juggernaut we need anotehr item that can bring the tenacity!","replies":[]}]},{"poster":"Bonipherus","date":"2015-02-28T14:14:06.285+0000","up_votes":1,"down_votes":0,"body":"Tanks definitely need tenacity to withstand chain cc in order to make their way into the fray and avoid being kited like a baby. This results in tanks having to take merc treads out of sheer necessity- resulting in a real lack of strategic diversity, something that riot claims is part of their goals. The fact that riot took out the quill coat component of tank jungler items speaks for how much they really looked into the jungle issues even when the whole preseason was centered around the jungle.","replies":[{"poster":"Venowolf","date":"2015-03-01T05:38:04.507+0000","up_votes":1,"down_votes":0,"body":"Exactly with items like Ohmwrecker and Rigtheous Glory with tenacity we have more \"strategic diversity\". A tank without tenacity can be kited for days...","replies":[{"poster":"Bonipherus","date":"2015-03-02T03:10:34.377+0000","up_votes":2,"down_votes":0,"body":"Honestly, in the future I would like cc to be looked at critically by riot. There are a lot of abilities that are not at all clear. A great example would be Nami's Q. It isn't a knockup even though visually they are and Yasuo can ult off of it. But the ability is cleansable unlike knockups. This means player knowledge is something that is needed prior to the matchup-which, lets be honest here, isn't what clarity is about at all. I would propose consecutive cc abilities to naturally have a % reduction when hit by chain cc. Will probably create a post about this soon.","replies":[]}]}]},{"poster":"Arcade Andrew","date":"2015-03-01T05:40:18.791+0000","up_votes":2,"down_votes":0,"body":"My problem with tenacity is it doesnt stack, Why get a tenacity item when you can just get the boots? which are (arguably) the best boots in the game? \n\nthey offer a good amount of MR same movespeed as everything else and tenacity! \n\nwho needs slow resitance on the speed boots when you can get tenacity on merc treads?","replies":[{"poster":"Venowolf","date":"2015-03-09T17:15:40.643+0000","up_votes":1,"down_votes":0,"body":"The problem is that: The mercury boots make the junglers mobility so slow in comparision with the mobility also are too expensive to rush in early so if they removed the tenacity need to put in some other item to all those that can't build the mercury boots.","replies":[{"poster":"Arcade Andrew","date":"2015-03-09T17:18:51.734+0000","up_votes":1,"down_votes":0,"body":"I almost always get merc treads no matter what unless Im facing an ALL AD team because I like to have some MR against the enemy mid laner no matter what I am, The only times I dont get merc treads are when Its an all AD team (armor boots yo)\n\nor Im ADC (who needs magic res when i can two shot them?)","replies":[{"poster":"Venowolf","date":"2015-03-09T17:21:48.951+0000","up_votes":1,"down_votes":0,"body":"You can move faster througth the jungle with the merc boots, when you are the jungle you need to be very fast to arrive in each lane and also to the camp junglers, your time its very imortan the MS Quints and Mobility boots are a core part to the jungle IMO.","replies":[]}]}]}]},{"poster":"Venowolf","date":"2015-05-04T23:07:59.206+0000","up_votes":1,"down_votes":0,"body":"Omhwrecker need Tenacity passive.","replies":[]},{"poster":"Duke Anax","date":"2015-02-28T14:31:45.821+0000","up_votes":1,"down_votes":0,"body":"I think it could be interesting if {{item:3056}}  had a variation of Point Runner that gives Tenacity instead of movespeed. It would also make it more satisfying when using it together with {{item:3512}} .\n\nSimmilarly {{item:3800}}  could have Tenacity tied to the active.","replies":[{"poster":"Venowolf","date":"2015-05-02T00:21:25.861+0000","up_votes":1,"down_votes":0,"body":"Ohmwrecker is for me the best Tenacity candidate.","replies":[]}]},{"poster":"RogueWill","date":"2015-02-28T16:32:07.320+0000","up_votes":1,"down_votes":0,"body":"why woudl I go Juggernaut now then {{item:3717}}. Better go straight {{item:3714}} or {{item:3724}} and grab a {{item:3065}}","replies":[{"poster":"Duke Anax","date":"2015-02-28T17:40:01.090+0000","up_votes":1,"down_votes":0,"body":"That's exactly the point why they remove Juggernaut, it got no damage to it.","replies":[{"poster":"RogueWill","date":"2015-02-28T21:00:50.067+0000","up_votes":1,"down_votes":0,"body":"the point of juggernaut was the tenacity with a bit of hp. It was the only reason I was getting juggernaut instead of just changing it to a spirit visage that has similar stats and price","replies":[]}]}]},{"poster":"Venowolf","date":"2015-02-28T04:19:11.361+0000","up_votes":1,"down_votes":0,"body":"What happen with the tenacity items?","replies":[]}]}