{"poster":"IsK Anxiety","date":"2015-05-21T10:24:47.800+0000","title":"Daten werden vom Server abgerufen! MEGA ANGEPISST!","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"es kann echt nicht sein ich hab seit l&auml;ngerer zeit diesen scheiss client bug und verliere st&auml;ndig punkte weil ich aus der warteschlange geschossen werde weil ich nichts picken kann habe dadurch schon -15 alleine nur heute schon bekommen und ich habe die schnauze langsam gestrichen voll. dieser scheiss bug existiert wohl schon l&auml;nger und ich verstehe einfach nicht warum RIOT sich nicht mal darum k&uuml;mmert es fuckt mich &uuml;bertrieben ab!\n\nich habe jetzt grade zweimal ein ranked game gestartet bzw war im champions pick und dann werde ich gekickt weil ich keinen champion picken kann oder bannen kann geschweige denn meine summoners &auml;ndern kann und das zweimal hintereinander!\n\nk&uuml;mmert euch endlich um diesen scheiss bug das geht &uuml;berhaupt nicht sowas!\n\n-15 Punkte da k&ouml;nnte ich platzen!\n\nes ist nicht die welt aber das problem an der sache ist das es ständig vorkommt und es fast unmöglich ist Ranked Games zu spielen!","replies":[{"poster":"Yaxtee","date":"2015-05-21T10:42:14.990+0000","up_votes":3,"down_votes":0,"body":"Das ganze wird wahrscheinlich an deiner Verbindung liegen.\nBenutzt du WLAN? Kannst mal den IP Hilfsdienst deaktivieren und beenden? \nAußerdem erstell mal bitte ein Tracert :)\n\n\n* Deaktiviere den IP-Hilfsdienst\n  * Drücke die Tasten [Win] + [R] ( [Win] befindet sich zwischen [Strg] und [Alt] )\n  * services.msc eingeben\n  * **IP-Hilfsdienst** deaktivieren **und** beenden\n\n>**6. Tracerts erstellen**\n\n>Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n>Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n>Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download: http://www.pingplotter.com/downloads/pngplt_std.exe\n>1. Das 'Trace Interval' sollte auf '1 second' eingestellt werden.\n>2. Die 'Address to Trace' ist in unserem Fall 185.40.65.1\n>3. trace starten\n>4. Es wird jetzt jede Sekunde ein tracert durchgeführt. Während Pingplotter im Hintergrund läuft, kann man ein Testspiel in LoL starten um zu testen ob Probleme auftreten.\n>Sollte es Verbindungsprobleme geben, geht es mit Schritt 5 weiter. Gibt es keine Verbindungsprobleme sind die tracerts vermutlich nutzlos.\n>5. Sollten Verbindungsprobleme aufgetreten sein, müssen die tracerts abgespeichert werden. File -> Export to textfile... http://fs1.directupload.net/images/141125/hmj3jxtl.png\n>6. Samples to Export: All Samples http://s14.directupload.net/images/141125/tn9c75t4.png\n>7. 'Export...' Speichert die Textdatei am besten auf dem Desktop oder an einem Ort wo ihr diese auch wieder findet.\n>8. Datei im Forum hochladen wenn ihr eure Antwort erstellt\n\nAnhand der tracerts kann man häufig die Fehlerquelle finden, wenn es sich bei den Verbindungsproblemen um Paketverlust oder einen hohen Ping handelt","replies":[{"poster":"IsK Anxiety","date":"2015-05-21T10:58:12.356+0000","up_votes":1,"down_votes":0,"body":"das ist jetzt während eines spiels (free game)\nhilfedienst ist beendet und deaktiviert","replies":[{"poster":"Yaxtee","date":"2015-05-21T11:03:01.550+0000","up_votes":2,"down_votes":0,"body":"Wenn das ganze durchgelaufen ist (freies Spiel ist gut^^, lass es mal 5 Min durchlaufen), dann exportier das ganze btte noch als Textdatei. Steht alles oben in der Anleitung :)","replies":[{"poster":"IsK Anxiety","date":"2015-05-21T11:04:51.701+0000","up_votes":1,"down_votes":0,"body":"also bei dem was du mir geschickt hast um die tracerts zu erstellen kannst du es nicht in eine text datei verwandeln\nich werde den text gleich einfach hier rein kopieren","replies":[{"poster":"Yaxtee","date":"2015-05-21T11:16:44.120+0000","up_votes":4,"down_votes":0,"body":"Ich bräuchte es aber und bei mir kann ich das als Textdatei speichern.\nBevor du hier was reinkopierst, kopier es doch auf pastebin, das ist übersichtlicher :)","replies":[]}]},{"poster":"IsK Anxiety","date":"2015-05-21T11:30:57.714+0000","up_votes":1,"down_votes":0,"body":"so hier ist es","replies":[{"poster":"Yaxtee","date":"2015-05-25T14:21:50.081+0000","up_votes":3,"down_votes":0,"body":"Sorry. War die letzten 3 Tage nicht wirklich daheim^^\nKanst du vielleicht auf eine LAN Verbindung umstellen für kurze Zeit um zu schauen ob es funktioniert?\nIch hatte gehofft dass der IP Hilfsdienst das ganze behebt^^","replies":[{"poster":"IsK Anxiety","date":"2015-07-02T10:12:49.659+0000","up_votes":1,"down_votes":0,"body":"ja vllt liegts am repeater is aber egal passt schon trotzdem danke","replies":[]}]}]}]}]},{"poster":"IsK Anxiety","date":"2015-05-23T20:11:22.716+0000","up_votes":1,"down_votes":0,"body":"schon was gefunden?\ntext datei wurde unten geuploadet","replies":[]}]},{"poster":"Nephirelle","date":"2015-05-21T10:30:44.533+0000","up_votes":1,"down_votes":0,"body":"Fix deinen Rechner. \nDer Support hilft dir sogar dabei, wenn du eine etwas gesittetere Ausdrucksweise an den Tag legst.","replies":[{"poster":"IsK Anxiety","date":"2015-05-21T10:34:02.441+0000","up_votes":1,"down_votes":0,"body":"wenn es immer und immer wieder vorkommt hat man die schnauze langsam gestrichen voll!\n\nfix deinen rechner was für ein kommentar :'D\n\nder is nigelnagel neu","replies":[{"poster":"XxKampflappenxX","date":"2015-05-21T11:18:48.256+0000","up_votes":1,"down_votes":0,"body":"Das interessiert nicht ob der neu ist. Wenn deine Konfigurationen scheisse sind, sind die halt scheisse. Dann musst du die so einstellen dass es klappt. Da kann Riot nichts für. Deaktiviere deinen IP Hilfsdienst und gut ist. Hat mir auch weitergeholfen. Einer der Supporter/Wrenchmen hat sich über Teamviewer in meinen Rechner eingeloggt und das Problem in ein paar Klicks behoben!","replies":[]},{"poster":"Alustus","date":"2015-05-21T10:39:46.987+0000","up_votes":1,"down_votes":0,"body":"Das hat nichts damit zu tun wie alt er ist oder ob er zu schlecht ist.\n\nWenn deine Einstellungen Falsch sind kannst du selbst mit einem 10 000 Pc nicht spielen.\n\nFakt ist, dass nur sehr wenige Leute Probleme haben daher ist es wahrscheinlicher, dass diese wenigen Leute die falschen Rinstellungen haben als das der Server bugt. \nLol hat im Deutschen Raum sicher ein paar Millionen Spieler aber hier im Forum sehe ich nur eine Handvoll leute welche ein ähnliches oder gleiches Problem wie du haben.\n\n\nEdit:\nSchreib den Support an dieser wird dir sicher weiterhelfen, auch wenn dies einige Zeit in anspruch nehemen kann.\n\nGrundsätzlich ein paar allgemeine Hilfestellungen:\n\nGrundsätzlich mal die Frage: Hast du LoL schoneimal koplett gelöscht und neu installiert?\nWenn nein, machen.\n\n- Überprüfe ob du alle Windows Updates installiert hast, wenn nicht updaten.\n- Überprüfe ob du Adobe Air, .NetFramework, DirektX installiert hast wenn nicht machen.\n- Teste ob dein Antivirus,Firewall oder der Winows Defender vllt LoL blockiert. (am besten alles deaktivieren und dann schaun ob es Funktioniert wenn ja Schalte diese nach und nach wieder ein um herauszufinden welche dieser Programme LoL blockiert, dan bei dem Problem  Verursachenden Programm die einstellungen so ändern, dass lol nicht blockiert wird)\n","replies":[{"poster":"IsK Anxiety","date":"2015-05-21T10:59:43.192+0000","up_votes":1,"down_votes":0,"body":"ja wurde komplett entfernt und wieder neu runtergeladen und installiert\nes bringt nichts... \naber den tracerts zu urteilen liegt es am paket loss","replies":[]}]},{"poster":"dugg","date":"2015-05-21T10:40:41.012+0000","up_votes":1,"down_votes":0,"body":"Bevor du hier Dampf ablässt, kannst du auch erst einmal aus deiner Warte heraus alles tun, damit der Bug nicht mehr vorkommt. Vorallem, wenn du der Meinung bist, dass Riot es nicht hinbekommt.\n\nRechtfertig der neue Rechner, dass das Spiel einwandfrei läuft? Hast du es schon einmal mit einem Reinstall probiert? Oder hast du den Cache komplett gelöscht? Vielleicht hängt einfach nur irgendwas. Hast du dich DIREKT an den Support gewendet? Wenn nicht, dann würde ich das mal schnellst möglichst tun. Seit wann tritt dieser Bug denn auf?","replies":[]}]}]}]}