{"poster":"GGEXOGG","date":"2015-05-29T20:30:55.868+0000","title":"Ich bin voll Schlecht -.-","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey leute,\r\nin der letzten Zeit wie z.b. Heute ich weis nicht irgendwie bin ich so schlecht und ich habe das Gefuhl ich werde schlechter das ist so Mies kann mir vielleicht einer Tipps geben ich weis nochtmehr weiter :/ -.-\r\n\r\nIch spiele zur zeit SEHR viel mit {{champion:84}}  habe jetzt auch {{champion:45}} und {{champion:22}} versucht aber Ashe ging voll in die Hose.\r\n\r\nKann mir jemand bitte weiterhelfen?\r\n\r\nPS: bin lvl 17","replies":[{"poster":"OrangeBubble","date":"2015-05-29T20:41:43.268+0000","up_votes":1,"down_votes":0,"body":"Mit lvl 17 ist es doch net schlimmes schlecht zu sein? \nDu kannst entweder einfacher Champs picken oder nur aus Spaß spielen oder dich mit deinen Lieblingschamps verbessern o.o","replies":[{"poster":"GGEXOGG","date":"2015-05-29T20:43:44.306+0000","up_votes":1,"down_votes":0,"body":"Is nur blöd wenn mein Freund die ganze Zeit rumlabert \"Wie konntest du den nicht Killen?!\". Aber er schaft es Problemlos. Es ist auch jeder besser als ich das nerft mich ja","replies":[{"poster":"OrangeBubble","date":"2015-05-29T20:46:33.249+0000","up_votes":1,"down_votes":1,"body":"Oh Gottchen, warum fragst du ihn dann nicht einfach? ^^ Ansonst wenn es um Akali geht, du musst wissen, wieviel DMG du machst. Entweder intuitiv oder du rechnest dir aus. Die meiste Midlaner haben max. 42MR, min. aber 30 MR (30MR hat eigentlich jeder Champ). \n\nWas baust du denn so auf Akali? Wie spielst du denn mit ihr? Farmst du gut? oder gehst du nur auf Kills?\n\n/edit:  Eigentlich sollte man den DMG Output immer kennen, also auch mit Veigar, Ashe usw. ","replies":[{"poster":"GGEXOGG","date":"2015-05-29T20:51:22.825+0000","up_votes":1,"down_votes":0,"body":"Ob ich gut Farme kann ich nicht Bewerten ich glaub richtig schlecht... \nIch versuche eine Prositive KD zu halten und andere immer zu Helfen.\nJa das weis ich mit der DMG auch vorallem wen ich Glanz habe\n\nBild: http://prntscr.com/7aw70q\n\nPS: Wäre geil wenn mir jemand sagen könnte ob mein Itembaum gut ist","replies":[{"poster":"OrangeBubble","date":"2015-05-29T21:22:35.334+0000","up_votes":3,"down_votes":0,"body":"Ich spiele selber kein Akali, daher kann ich dir nicht unbedingt sagen, ob der Itembuild gut ist. \n\nIch poste dir aber mal 2 Seiten, die ok sind. \n\nAuf ProBuild kannst du dir die Itembuilds von ChallengerPlayer anschauen. Das Ding ist nur, dass du es nicht stupide nachbauen solltest, da es situativ sein kann. Daher sollte man schon überlegen <wenn man besser werden will>, warum der Spieler nun die Items gekauft hat. Natürlich gibt es Core Items, die man immer baut und die eigentlich immer im Builds sind (hallo rabadon), aber es gibt auch Items, die baut man nur in bestimmten Situationen. \n\nhttp://www.probuilds.net/champions/Akali\n\nGenerell gilt aber für APler:\n\n{{item:3089}} immer bauen, weil es einen Powerspike gibt. Das ist einfach ein Core Item, dass man immer baut!\n------------------------------\n{{item:3135}} gibt MPEN und ist gut gegen Gegner, die MR stacken. \n----------------------------\n{{item:3020}} immer bauen und so früh wie möglich. Gibt der einen Powerspike. 15 Mpen Flat sind super. Der Gegner hat nur max. 42, d.h. mit den Schuhen hat er nur noch 27!!! Wenn er keinen MR Runen hat, hat er sogar nur noch 15!! \n------------------------------\nAlternativ: {{item:3117}}  ABER du musst das auch ausnutzen. Mit den Dingern kannst du super roamen, aber ich rate dir davon erstmal ab. Die MPen werden dir auf der Lane mehr helfen und roamen ist so eine Sache. Wenn du besser mit Akali bist, dann könnten die eine Alternative sein. Später wirst du sie aber durch die Zauberdurchdringungsschuhe ersetzen!\n----------------------------------\n{{item:3111}} können helfen, wenn du zu viel CC abbekommst, aber ist sehr situativ!\n---------------------------------\n{{item:3285}} dieses Item ist einfach klasse. Du generierst damit super Stacks, da durch gute Reichweite mit der Ult zurück legst und durch deinen Nebel auch MS bekommst. Solltest du auf jedenfall holen.\n--------------------------------\n{{item:3146}} Core item für Akali. Deine Passive synergiert super mit dem Item!\n---------------------------------\n{{item:3157}} Super Item. Richtig eingesetzt, fängst du Dmg ab. Hinzu kommt, dass es super DMG bringt! Z.B. du gehst auf den ADC, haust ihn raus, machst schnell Zhonyas, fängst dadurch den Schaden vom Gegner ab und zischst dann zum APC und haust den um. Nur du musst es auch einsetzen in den RICHTIGEN Situationen.  Solltest auf jedenfalls fast immer kaufen :P\n\n{{item:3191}} Gegen AD'ler in der Mitte, holst du dir das so früh wie möglich :P\n---------------------------------\n{{item:3026}} du wirst wiederbelebt, wenn du stirbst. Kann super sein, wenn du fed bist und im prinzip nach deinen Tod die Reste abräumen kannst. Das muss du ebenfalls gut einsetzen. \n---------------------------------\n{{item:3100}} Ich mags nicht so, aber es passt auf Akali. Kannst es ruhig kaufen, aber nicht unbedingt als First item. Zuerst Glanz und dann erstmal ein anderes AP Item (z.B. Raba).\n----------------------------------\n{{item:3116}} Gibt dir Leben, gute AP und einen Slow. Wenn du die HP brauchst, ist es bestimmt gut, ansonsten hol dir was anderes ^^\n-----------------------------------\n{{item:3041}} Nein. Hol dir das nicht. Das Ding ist sehr riskant und wenn du nicht gerade roflstompst und im early schon alles easy Kills, ist es kein Item für dich. \n------------------------------------\n{{item:3001}} wenn du die MR wirklich, wirklich dringend brauchst, ist es ok. Hol dir das, wenn du 0 Chance gegen den anderen Apler hast.\n\nDas sind so ein paar Items, die mir spontan einfallen. Es gibt sicherlich noch ein paar, aber sind auch wieder sehr situativ. Das kommt aber, wenn du dich mehr mit den Items beschäftigst.\n\nEine andere Seite ist lolking. Da gibt es Guides, aber diese sollte man auch mit bedacht genießen und reflektieren, was der Typ dir erzählen will ^^ Der beste Weg, um besser zu werden, ist, sich selber Gedanken zu machen ^^\n\nhttp://www.lolking.net/\n\nAchja wegen Lasthitten, mach einfach ein Custom Game und übe es dort. Sollte recht schnell gehen :3","replies":[{"poster":"GGEXOGG","date":"2015-05-29T21:38:38.602+0000","up_votes":1,"down_votes":0,"body":"Danke dir! Ich werd mich mal in die Seite anschauen und deine Tipps übernehmen!","replies":[{"poster":"EpicDieterBohlen","date":"2015-05-30T07:28:02.231+0000","up_votes":1,"down_votes":0,"body":"im moment ist es ganz einfach:\nLudens > jedes andere ap item\nfluch des lichs solltest du erst holen wenn du schon viel ap hast sonst bringt es relativ wenig","replies":[]},{"poster":"SlaveOfThisAdc","date":"2015-05-30T00:54:52.428+0000","up_votes":1,"down_votes":0,"body":"hey^^\n \nich kann dir diese seite hier empfehlen, \n\n**http://www.lolking.net/guides/135867**\n\nhier findest du auch, falls du andere champs ausprobieren willst builds.\n(falls du deutsch spielst, kannst du die namen der items auch auf englisch eingeben und sie werden dir angezeigt)\n\n\n\nwas ich dir zu farm sagen kann ist eigentlich nur das, was mir mein freund immer sagt ^^\n\n\" du musst mindestens genauso viel farm haben wie dein gegner, am besten natürlich mehr und du solltest ab \nminute 20 mindestens 120 farm haben\"\n\nansonsten kann ich orange bubble da nur zustimmen.\n(bin selber schlecht im farmen, desswegen spiel ich auch support xD)","replies":[]}]}]}]}]}]}]},{"poster":"HüpfDuSau","date":"2015-05-30T09:29:06.667+0000","up_votes":2,"down_votes":0,"body":"Wenn du mal Zeit, Lust und Skype/TS hast kann man ja mal ein oder zwei Übungsmatches machen.\n\nDas was mir am ehesten bei dir aufgefallen ist: Dein Minionscore ( also Minions / Zeit ) ist relativ niedrig, das solltest du ändern. Übe Lasthitten bei der Wave und Lasthitten unterm Turm. 12 Minions ~ 1 Kill, Minions sind also im Grund die beste Geldquelle die du hast, du solltest auf jeden Fall versuchen, das auszunutzen ;)","replies":[]},{"poster":"FakeMirror","date":"2015-05-30T12:16:29.147+0000","up_votes":1,"down_votes":0,"body":"Ähm Du musst mit Akali pre6 unbedingt Safe Farmen und spielen. Eigentlich ist sie super einfach, da sie ein one item Champ ist (hextech Revolver!). Außerdem solltest du rabadons/ zhonyas danach Rushen! Zuletzt greifst du immer mir q und dann r und e an!! Die machen dann mehr damage! Akali ist gar nicht schwer!","replies":[{"poster":"GGEXOGG","date":"2015-05-30T13:08:47.524+0000","up_votes":1,"down_votes":0,"body":"Ja das weis ich mach ich immer aber danke!","replies":[]}]},{"poster":"erzi222","date":"2015-05-29T20:38:37.603+0000","up_votes":1,"down_votes":0,"body":"- probier mehr andere champions aus\n- nehm eventuell tipps an von anderen spielern\n- les dir paar guides zu den champions durch die dich interessieren\n- level dich erstmal irgendwie bis level 30, vorher hat man immer die schlechteren chancen gegen andere\n- zum leveln eignet sich dominion oder aram, wobei dir dort die praktische erfahrung fehlt zur normal map, also 5 vs 5","replies":[{"poster":"GGEXOGG","date":"2015-05-29T20:41:39.157+0000","up_votes":1,"down_votes":0,"body":"Ja aber ich spiele derzeit lol gerne mit nem Freund und der is halt LvL 30 und gold... Er hat einen 2ten Acc gemacht aber irgendwie wenn ich da mit spiele mit dem 2ten Acc bin ich auch schlecht.","replies":[{"poster":"OrangeBubble","date":"2015-05-29T20:43:42.078+0000","up_votes":1,"down_votes":0,"body":"Weil seine MMR ganz fix hoch geht und ihr dann tdm gegen zu starke Gegner spielt. Also Gegner, die für dich zu stark sind, aber für ihn eigentlich zu leicht sind u.u","replies":[{"poster":"GGEXOGG","date":"2015-05-29T20:44:47.021+0000","up_votes":1,"down_votes":0,"body":"Achso danke o.O","replies":[]}]}]}]},{"poster":"Hazzil","date":"2015-05-29T22:04:05.903+0000","up_votes":1,"down_votes":1,"body":"Wenn ihr schon duo zockt, und dein Mate so gut ist, wieso geht ihr dann nicht zusammen auf die Bot, er carried, und erklärt dir, wie man gescheit supportet. Supporter braucht das Land :D","replies":[]}]}