{"poster":"Pixavis","date":"2018-01-06T22:08:08.703+0000","title":"Ping Probleme ausschließlich bei League zu bestimmten Zeiten.","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Moin, ich verzweifel gerade ein wenig an meinem ingame Ping.\r\nVor etwa 3 Monaten bin ich umgezogen und habe meine Internet von einer 16k auf eine 200k Leitung verbesert.\r\nTrotzdem habe ich in meiner neuen Wohnung bei League (&uuml;berwiegend Abends) Ping Probleme so dass ich nichtmehr spielen kann.\r\nNehmen wir den heutigen Tag als Beispiel:\r\nIch habe um 15 Uhr angefangen zu spielen und bis 20 Uhr ohne Probleme mit meinem standard 32 Ping gespielt.\r\nAb ca. 20 Uhr stieg dann mein Ping im Laufe eines Spieles auf 85 und schwankte danach zwischen 51 und 145.\r\nIch bin per Kabel mit dem Router verbunden und alle anderen Spiele, sowie Stream laufen ohne Probleme und ohne Ping Probleme :/\r\nIch habe auch schon mit meinem Internetanbieter telefoniert (Kabel Deutschland), der mir nur best&auml;tigt hat, was jeder Speedtest im Internet sagt, n&auml;mlich das mein Ping bei 31/32 liegt. \r\nIch wei&szlig; nun echt nicht weiter und finde diesbez&uuml;glich auch nichts in diversen Posts aus den vergangen Jahren...\r\nHier ist noch ein Tracert von gerade eben aus einem Custom game, dies lief etwas fl&uuml;ssiger als normals:\r\nhttps://pastebin.com/PTX9xdxE\r\n\r\nVielleicht kann mir ja jemand beim auswerten helfen, verstehe davon nicht so viel.\r\nVielen Dank schon einmal und noch einen sch&ouml;nen Abend :)\r\nLG Coco","replies":[{"poster":"Pixavis","date":"2018-01-18T19:49:21.363+0000","up_votes":1,"down_votes":0,"body":"Aber woran liegt es dann, dass ich jetzt zum Beispiel überall einen 26 Ping habe nur nicht in LEague, da ist er bei 75. Ich kann so unmöglich spielen und verliere meinen Teammates regelmäßig Placementspiele...","replies":[]},{"poster":"Homunculi","date":"2018-01-08T14:09:44.402+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\ndein Problem beginnt schon in der KabelDE Landschaft, evtl. mal den Support den Tracert zukommen lassen.\n\nDesweiteren, der Speedtest im Internet ist nur für das eigene Ego gut und hat keine Aussagekraft für z.B. Spieleserver.\n\nDie Leitung mag in Ordnung sein, aber die Verbindungen zu den einzelnen Knotenpunkten bishin zum RIOT Server sind eine kleine Katastrophe.","replies":[]},{"poster":"silibum","date":"2018-01-07T10:31:14.623+0000","up_votes":1,"down_votes":0,"body":"Kabeldeutschland ist leider bekannt dafür gerade zur \"Prime Time\" nicht die beste Verbindung zu liefern. Da wirst Du wenig gegen machen können. \n\n> Kabel-Internet (\"Kabel-\"DSL\" gibt es nicht) ist ein shared medium, sprich Du mußt Dir die maximale Bandbreite mit dem Wohnblock (oder mehr) teilen.","replies":[]}]}