{"poster":"The Sword Saint","date":"2016-05-26T00:43:29.183+0000","title":"Possible things Air dragon could give you:","subforum":"Gameplay","up_votes":77,"down_votes":3,"body":"* No unit collision\n* Bonus movespeed when moving towards allies\n* Wards have more sight range\n* Taking scuttle crab makes it stay in ward mode for longer\n* Gain the ability to move through enemy base gates\n* Cooldown reduction\n* Shorter recall timers\n* shorter teleport cooldown\n* faster / longer lasting homeguards (that don&#039;t go away from in combat?) (that take less time when standing in fountain to activate?)\n* speed up nearby minions\n* casting time decrease\n* slow duration / strength reduction (like swift boots)\n* reduced death timers","replies":[{"poster":"MunchCrunchLunch","date":"2016-05-26T04:14:48.236+0000","up_votes":23,"down_votes":1,"body":"slow resist.\n","replies":[{"poster":"Papa Slothy","date":"2016-05-26T04:54:11.589+0000","up_votes":2,"down_votes":1,"body":"that sounds pretty viable","replies":[{"poster":"QjTHqo3RTq","date":"2016-05-26T05:28:46.343+0000","up_votes":37,"down_votes":0,"body":"{{champion:22}} GOD DAMN IT PLEASE, I JUST GOT OUT OF THE SWIFTIES META","replies":[{"poster":"Remlap1223","date":"2016-05-26T10:38:28.165+0000","up_votes":6,"down_votes":0,"body":"She needs more than just a metagame shift to help her stupidly weak base slow.","replies":[{"poster":"XeroKimo","date":"2016-05-26T18:15:28.462+0000","up_votes":1,"down_votes":0,"body":"TBH I wish they didn't give ashe crit slows and just revert it to having a base slow that is somewhat relevant","replies":[]}]},{"poster":"Selrick002","date":"2016-05-26T07:22:50.144+0000","up_votes":1,"down_votes":1,"body":"Yeah, and only the base ms for the boots are being nerfed. The slow reduction is staying the same. So with boots and mastries for Tenacity/SlowReduction I don't think they should add Ten/Sr to air.","replies":[{"poster":"QjTHqo3RTq","date":"2016-05-26T08:26:50.452+0000","up_votes":1,"down_votes":0,"body":"To be fair, we longer live in a world where people ONLY buy swifties if they didnt need the cdr boots, people MIGHT buy swifties if they dont want mercs, since ninja tabi are feeling pretty alright and cdr boots are nice for builds that dont weave a ton of cdr in there","replies":[]}]}]}]}]},{"poster":"CeexSett","date":"2016-05-26T09:14:15.107+0000","up_votes":17,"down_votes":0,"body":"Cast time decrease? Are you sure you would want that? Not only it is massive hidden power, it also has a snowbally effect on cast time champions: the Champions with low or zero cast times would be unnafected, while high cast times champions would get buffed.\n\nImagine Zed's Shadow being even faster, Ekko's W casting sooner or Caitlyn/Ezreal's ults going off faster. Woulnd't be really fun.","replies":[{"poster":"SOLOQSUPERHERO","date":"2016-05-26T19:20:05.558+0000","up_votes":2,"down_votes":0,"body":"Not to mention it may make it harder to hit skillshots like Nami's bubble for example -- i aim it based on where i think they're going to move and the cast time of the skill etc...","replies":[{"poster":"CeexSett","date":"2016-05-26T20:38:38.121+0000","up_votes":1,"down_votes":0,"body":"Exactly. As a Soraka main, I got used to predicting where the enemies will be to land my Q. Reducing the cast time would make it harder to get used to.\n\nHow would I also land R seriously Soraka would get unplayable.","replies":[]}]},{"poster":"Velzard of Koz","date":"2016-05-26T15:41:17.636+0000","up_votes":1,"down_votes":0,"body":"I believe Ekko's W is mostly delay rather than cast time.\n\nBy the way, Annie has a slight (maybe 0.35 seconds?) cast time on her Tibbers. :D Not that anyone would notice, but it would be buff to something people wanted even more delayed, lol.","replies":[{"poster":"CeexSett","date":"2016-05-26T15:50:00.567+0000","up_votes":1,"down_votes":0,"body":"Yeah, I checked again, Ekko's W has delay. My bad.\n\nIt would also make assassins have faster combos, and I'm sure no one wants that in their games.","replies":[]}]}]},{"poster":"Drakylon","date":"2016-05-26T01:35:52.848+0000","up_votes":7,"down_votes":0,"body":"Some of those effects are hard to implement using a 3-stack system without going into paragraphs of explanation. For example, how would you scale absolutes like \"no unit collision\" and \"can walk through enemy base gates\"?","replies":[{"poster":"The Sword Saint","date":"2016-05-26T01:45:45.101+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Drakylon,realm=NA,application-id=3ErqAdtq,discussion-id=rR0i2AAi,comment-id=0001,timestamp=2016-05-26T01:35:52.848+0000)\n>\n> Some of those effects are hard to implement using a 3-stack system without going into paragraphs of explanation. For example, how would you scale absolutes like &quot;no unit collision&quot; and &quot;can walk through enemy base gates&quot;?\n\nIn those cases you'd have both the atomic effect that you get for having even 1 dragon (can go through base gates for example) and a scaling effect (gain 4%/8%/12% movespeed for 3 seconds when going through a base gate for example).","replies":[{"poster":"zero356","date":"2016-05-26T04:36:41.276+0000","up_votes":2,"down_votes":0,"body":"Or add it as levels\nHave getting one be one effect, getting the next be the other, etc.","replies":[]},{"poster":"Arakadia","date":"2016-05-26T02:23:41.938+0000","up_votes":2,"down_votes":1,"body":"Or give moving through gates a cd?","replies":[{"poster":"IGotScuttleCrabs","date":"2016-05-26T11:38:54.235+0000","up_votes":1,"down_votes":0,"body":"LV 1 can enter enemy base gate > high risk\nLV 2 can leave enemy base gate > moderate risk\nLV 3 can see other side of enemy base gate? low risk","replies":[{"poster":"Arakadia","date":"2016-05-26T22:17:52.984+0000","up_votes":1,"down_votes":0,"body":"Actually sounds pretty kool!","replies":[]}]}]}]}]},{"poster":"HighH1","date":"2016-05-26T19:17:00.048+0000","up_votes":7,"down_votes":1,"body":"Players will only want Air dragon if it gives SoloQ","replies":[{"poster":"RookPusher","date":"2016-05-26T19:31:37.116+0000","up_votes":4,"down_votes":1,"body":"He'd be the most contested objective in game.","replies":[]}]},{"poster":"Hellpyre","date":"2016-05-26T00:45:55.614+0000","up_votes":5,"down_votes":0,"body":"I hope we get something. All the other dragons give some sort of bonus (even if Fire > Earth in most situations) worth fighting _for_.  I've only ever contested Air because I prefer to not give any buffs to the enemy team if possible.","replies":[]},{"poster":"Ebonmaw Dragon","date":"2016-05-26T19:57:16.167+0000","up_votes":4,"down_votes":0,"body":"A Hug.\n\nIts too much to ask?","replies":[]},{"poster":"billxx","date":"2016-05-26T11:52:01.875+0000","up_votes":1,"down_votes":0,"body":"The no unit collision is kind of dumb, because it is the primary part of some champs passive.","replies":[{"poster":"The Yetii Rider","date":"2016-05-26T17:26:24.408+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=billxx,realm=NA,application-id=3ErqAdtq,discussion-id=rR0i2AAi,comment-id=000a,timestamp=2016-05-26T11:52:01.875+0000)\n>\n> The no unit collision is kind of dumb, because it is the primary part of some champs passive.\n\nWhat?!\n\nFizz takes reduced damage from auto attacks, and Kassadin takes reduced magic damage.\n\nPlus, the other dragons steal thunder from passives too.\n\nCloud Drake (OOC MS) - Miss Fortune\n\nMountain Drake (Bonus damage to towers and epic monsters) - Nunu, Ziggs, Tristana\n\nInfernal Drake (Bonus AD/AP) - Master Yi, Zed\n\nOcean Drake (Out of combat health and mana regen) - Garen, Tahm Kench","replies":[{"poster":"billxx","date":"2016-05-26T18:38:47.603+0000","up_votes":2,"down_votes":1,"body":"But all those can be changed with numbers. Besides, the other parts for kass and fizz are lacklustre as hell","replies":[]}]}]},{"poster":"GhastlyGhoulMan","date":"2016-05-26T16:12:54.085+0000","up_votes":3,"down_votes":0,"body":"Reduced death timers? ;)","replies":[]},{"poster":"xevi","date":"2016-05-26T18:23:07.428+0000","up_votes":2,"down_votes":0,"body":"Distortion bonus? 5%, 7.5%, 10% CDR on Flash and Ghost?","replies":[]},{"poster":"Velzard of Koz","date":"2016-05-26T15:38:37.821+0000","up_votes":2,"down_votes":0,"body":"> Gain the ability to move through enemy base gates\n\nThe gate was possibly created so that jungler doesn't need to take journey through Narnia to get to desired camp while still not allowing enemy to have this easy and unprotected access to the base. I think this shouldn't be thing of change from any item/mastery/buff...\n\n> Taking scuttle crab makes it stay in ward mode for longer\n\nI believe scuttle is not so important objective so it might end up being as only occasionally and partially useful as the current effect. And it may end up being hard to balance out.\n\n> Cooldown reduction\n\nMeddler thinks each class and subclass should have good access to CDR, now they'll be giving it to the classess with roster updates (Juggernauts may be partially included, mainly it got customized for Marksmen and Mages). So this may help early, but chances you get multiple (and kill) Cloud Drakes early in the game are small, plus it may end up being very useless for many champs in later phase of game.\n\nHowever If it scaled well, I might see it as substitution for one or two CDR items that the player can now replace with for him more useful additional stats/passive/active. Question is whether this would not create unhealthy environment. Meddler said they are focusing on making the acess for CDR being tradeoff of something, If I remember correctly. This may create champs (ehm... {{champion:105}} ) who relied in their brokeness on some stat (CDR for frequent zhonyas) but had to trade off at least a little bursty dmg, now they'd might get 40%CDR with too much dmg to handle.\n\nEven though hard to balance out, I think Item CDR might be more on point.\n\n> Shorter recall timers\n\nGood point, tho shorter death timers might be more appreciated nowadays, lol.\n\n> casting time decrease\n\nAgain, this may be hard to balance out for entire roster and some champs might not even notice it.\n\n> Bonus movespeed when moving towards allies\n> slow duration / strength reduction (like swift boots)\n\nIf expanded not only for slows, tenacity is the word. Yeah, these two points are the best IMO, I'd echo them. +1 And I forgot that the ward thing is also good.","replies":[]},{"poster":"DJ S0NA","date":"2016-05-26T14:18:23.054+0000","up_votes":2,"down_votes":0,"body":"> Cooldown reduction\n\nYes\n\n> Shorter recall timers\n\nAbsolutely\n\n> Wards have more sight range\n\nYes please","replies":[]},{"poster":"SwiftKitten88","date":"2016-05-26T02:49:41.648+0000","up_votes":2,"down_votes":1,"body":"other than \n\n\"Cooldown reduction\" ,\"Shorter recall timers\" \"increased ward sight range\" \"tenacity\"i don't really like the list much.\n\npermanent no unit collision would be too strong\nmovement speed when moving towards allies would be op in a teamfight\nscuttle crab change is too strange and specific, i think the general increased ward sight range change is better\nenemy base gate change would be crazy broken, very interesting idea, but completely broken\nfaster longer homeguards? idk would still seem as bad as the current air drag\nspeeding up nearby minion, again an interesting idea but it isnt that great\ncasting time decrease?  again interesting but seeing as that stat isnt even in the game at the moment i dont think so\n\nthe ones i like :\n\"cooldown reduction\" this would be very nice even if it didnt increase the cap\nshorter recall timers isnt wonderful but would still be good as a extra bonus for the drag, as long as it isn't the main effect\ni LOVE the increase ward  sight range idea\nbut probably my favorite one is the \"tenacity\" change, for CC reduction\n\nthis would DEFINITELY make air drag VERY useful in certain matchups, and very contestable even to just deny your opponent it if your team has alot of cc\n\ni think this is the best idea overall, and fits the current \"theme\" of air dragon very nicely","replies":[{"poster":"Chaotic Reks","date":"2016-05-26T14:09:07.008+0000","up_votes":1,"down_votes":0,"body":">casting time decrease? again interesting but seeing as that stat isnt even in the game at the moment i dont think so\n\nit is though, whenever you cast a spell, there is a delay which is the Cast time for it.","replies":[]}]},{"poster":"SkyBlade79","date":"2016-05-27T12:25:40.615+0000","up_votes":1,"down_votes":0,"body":"Actually tho, we should really just make it reduce death timers. That would be amazing.","replies":[]},{"poster":"Teemodanegro","date":"2016-05-27T02:32:30.248+0000","up_votes":1,"down_votes":0,"body":"This list makes me want to kill drag now.","replies":[]},{"poster":"Champion Skin","date":"2016-05-27T02:26:03.313+0000","up_votes":1,"down_votes":0,"body":"> slow duration / strength reduction (like swift boots)\n\n{{item:3009}} only reduce the strength of slows not the duration.... this makes it especially useful against reapplying slows or slowing fields\nAlso keep in mind that it reduces the strength of attack speed slows","replies":[]},{"poster":"Zyorhist","date":"2016-05-26T22:17:03.211+0000","up_votes":1,"down_votes":0,"body":"how about just a phage passive for movespeed in combat with enemy champions.","replies":[]},{"poster":"Wolfeur","date":"2016-05-26T22:14:40.865+0000","up_votes":1,"down_votes":0,"body":"Bonuses that can't scale can't be added\n\nRemove:\n\n* No unit collision\n* Passing enemy gates","replies":[]},{"poster":"Hyrum Graff","date":"2016-05-26T21:53:44.616+0000","up_votes":1,"down_votes":0,"body":"Most of these help you in combat. The intent is that Air dragon helps you create map pressure, not fight.","replies":[]},{"poster":"Biff Manly","date":"2016-05-26T21:13:24.161+0000","up_votes":1,"down_votes":0,"body":"It has to be something numerical, so they can increase it step by step. Something like unit collision would be harder to implement.","replies":[]},{"poster":"Lysdexic1","date":"2016-05-26T19:20:12.370+0000","up_votes":1,"down_votes":0,"body":"I kind of like the current air dragon buff as a jungler; it makes ganking and engaging a bit easier. It also helps supports, assassins, melee champions and map mobility in general","replies":[]},{"poster":"Smitty Manjensen","date":"2016-05-26T16:33:07.833+0000","up_votes":1,"down_votes":0,"body":"Would literally kill for no unit collision.","replies":[]},{"poster":"chubs1224","date":"2016-05-26T13:54:40.819+0000","up_votes":1,"down_votes":0,"body":"What about summoner spell cooldown? 5% per rank cuts 45 sec off flash and I think the same for tp makes splitting much stronger and safer at later levels","replies":[]},{"poster":"macromite","date":"2016-05-26T13:34:21.362+0000","up_votes":1,"down_votes":0,"body":"I like the first one. would make air dragon the most important dragon.","replies":[]},{"poster":"SIayton","date":"2016-05-26T12:43:55.205+0000","up_votes":1,"down_votes":0,"body":"CDR sounds great too. 5% per dragon + 15 ooc movespeed would be appealing.","replies":[]},{"poster":"Kingnewgameplus","date":"2016-05-26T11:36:16.586+0000","up_votes":1,"down_votes":0,"body":"Cooldown reduction on a rng dragon would break the game in half.","replies":[]},{"poster":"Supreme Senpai69","date":"2016-05-26T11:17:51.317+0000","up_votes":1,"down_votes":0,"body":"Don't forget that Riot has said many times they want the air dragon to affect split pushing. Suggesting new ideas is awesome but they won't listen if they aren't what they're looking for. Speeding up nearby minions would affect split pushing, but anybody who wants to freeze a lane wouldn't want an air dragon. Nasus would literally beg his team to let the enemy get that air dragon.","replies":[]},{"poster":"BloodyTompon","date":"2016-05-26T10:25:25.943+0000","up_votes":1,"down_votes":0,"body":"Most of those are no-no's. Some are binary (unit-collision), some are balance problems (cast time decrease), and some are not universal enough (teleport). Only conditional movement speed (which we have already in a different form) and minion speed would be thing's they'd do.","replies":[]},{"poster":"Mhihnj","date":"2016-05-26T06:11:37.777+0000","up_votes":1,"down_votes":0,"body":"Death timer reduction?","replies":[]},{"poster":"Spoofghoul","date":"2016-05-26T15:41:42.331+0000","up_votes":1,"down_votes":1,"body":"{{champion:90}} did you knew air drake can give you aids\n\nwanna know how that happened?","replies":[]},{"poster":"Weiner the Pooh","date":"2016-05-26T15:17:02.457+0000","up_votes":1,"down_votes":1,"body":"Why not attack speed/crit? Yasuo is like all attack speed and crit and hes wind based so why not make wind dragon reflect that thematic even more?","replies":[]}]}