{"poster":"Turbo Rojo","date":"2015-12-30T21:56:18.088+0000","title":"Items","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"quisiera hacer una consulta debido a la itemnisacion de los campeones, es un punto de vista mio, el cual siento que favoreceria a mucha gente.\r\nhay personas que tardan mucho comprando un item en la tienda, y pierden tiempo para regresar a la linea en la que estan sea mid. bot o top. a lo que voy es que, para evitar ciertos retrasos, seria bueno y conveniente para muchas personas, que cada campeon que elijan, tengan su propios objetos en la tienda, por si no me entienden, lo que trato de explicar es que si escogen a un campeon AP, cuando comienze la partida, y tengan que comprar items, sean solo items que a ese campeon le favorezca, o sea items de ap, si es un campeon AD, sean solo items de AD, los que hayan en la tienda, si es un soporte, que hayan items de soporte en la tienda, y asi sucesivamente, creo que eso funcionaria y tardaria menos cada persona en comprar y volver a la linea, no lo se solo digo quizas sea mucho quilombo, pero es una buena idea... Saludoos!","replies":[{"poster":"Galiers","date":"2015-12-31T18:00:18.231+0000","up_votes":1,"down_votes":0,"body":"puedes usar el creador de builts para hacer eso... \n\nprofile -> Items Sets\n\napretas la + y te pones a armar el set de items a gusto, puedes seleccionar el campeón o campeones para ese set de items, puedes tener varios sets de items asignados a un mismo campeon y cambiarlos ingame dependiendo de como quieras armarlo\n\nenjoy","replies":[]},{"poster":"Ranpage","date":"2015-12-30T22:13:08.065+0000","up_votes":1,"down_votes":0,"body":"EM no porque hay gente que le gusta hacer builds especiales y todo eso y habeses sale bien\nGG: Soraka tanque pentakill\nGG: temoo ad con robo de vida creado por las personas que les gusta teemo y no sabes que es ap sin ofender en un momento todos no sabíamos que era ap o poder de habilidad y comprabamos todo ad o resistnecia o vida\nGG: tresh ap mid\nGG: YI ap\nGG: Garen  con 45% de reducción de infriamento\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"Turbo Rojo","date":"2015-12-31T17:38:45.847+0000","up_votes":1,"down_votes":0,"body":"no me trates de ignorante, por que no lo soy, se que es ap, y A VECES no Habeces... me parece perfecto que haya gente que haga builds especiales, pero bueno solo era mi punto de vista, y pense asi, que no seria mala idea, pero buen q se le va a hacer no? xD saluds!","replies":[]}]}]}