{"poster":"Óbito Uchiha","date":"2017-07-01T14:27:42.524+0000","title":"Cola de baja prioridad","subforum":"Charlas Generales","up_votes":3,"down_votes":2,"body":"Me parece totalmente injusto que por temas de servidor que hubo ayer a la noche me tengan que poner baja prioridad por un problema de ustedes. Encima me borran la publicacion por insultar, y si, que esperas?","replies":[{"poster":"Rebkans","date":"2017-07-01T15:04:47.474+0000","up_votes":1,"down_votes":0,"body":"Obviamente que te van a borrar el post si flameas en el foro. Se entiende malestar que hubo anoche pero no es justificacion para insultar.\n\nPodes mandar un ticket al soporte pero no te la van a quitar ya que el LeaveBuster solo sanciona a aquellos que se van afk en reiteradas ocaciones.","replies":[{"poster":"Óbito Uchiha","date":"2017-07-01T15:17:34.659+0000","up_votes":1,"down_votes":0,"body":"Si, tenes toda la razón del mundo pa, pero me fui afk dos veces en las ultimas dos semanas, la ultima vez fue por el problema de inicio de sesión. Se me fue el internet al rato de empezar la partida, y no reconectaba, me decia \"No tienes conexion a internet\" y no me dejaba conectar, pero podía mirar youtube. Así que cerré el juego e intenté entrar de nuevo y por el problema de inicio de sesión no podía entrar, estuve creo que 30 minutos hasta que me dejo entrar.","replies":[{"poster":"Óbito Uchiha","date":"2017-07-01T15:19:14.710+0000","up_votes":1,"down_votes":0,"body":"ph: Volvió rápido el internet, 5 minutos como mucho, pero aunque tenía internet no me conectaba a la partida, asi que sali de la partida y tampoco me dejaba volver a conectarme desde el launcher, ahí fue que cerré el juego","replies":[{"poster":"Rebkans","date":"2017-07-01T15:27:34.320+0000","up_votes":2,"down_votes":0,"body":"Que raro hermano.\n\nMandá un ticket al soporte en ese caso. Capaz se trate de algun error tecnico u otra cosa porque si tenias internet pero el juego no funcionaba, será porque algo andaba fallando.\nPodria ser que de haya instalado mal el parche o de haya dañado alguna carpeta.\n\nProbá mandando ticket al soporte y contales lo que te pasó. De paso preguntales sobre tu LeaveBuster. No sé si haran algo o no pero no se pierde nada con preguntar. :)\n\nLamento no poder ayudarte mas, pero mi conociniento sobre esas cosas es casi nulo.\n\nSaludos!","replies":[]}]}]}]},{"poster":"MinusValido","date":"2017-07-01T14:29:27.572+0000","up_votes":2,"down_votes":0,"body":"Bueno ya tenés la cola hecha, quedate satisfecho, no te la pueden deshacer.","replies":[]},{"poster":"iFraan","date":"2017-07-01T14:42:15.472+0000","up_votes":1,"down_votes":0,"body":"El flameo no tiene excusa salu2.","replies":[]}]}