{"poster":"Calas 13","date":"2017-02-06T19:42:55.233+0000","title":"Spielverschiebung zwischen Fight till death und MakePinkwardGreatAgain","subforum":"Battlegrounds-Turniere","up_votes":1,"down_votes":0,"body":"Hallo, \r\n\r\nwir w&uuml;rden das Spiel gerne auf Donnerstag Abend 19:00 Uhr vorverlegen. \r\n\r\nIch habe schon mit dem Teamleader des anderen Teams gesprochen und Sie sind einverstanden.","replies":[{"poster":"Witchking7399","date":"2017-02-09T19:07:09.425+0000","up_votes":1,"down_votes":0,"body":"Hallo, \nwir haben das Spiel jetzt beendet und Fight till death hat gewonnen. In der Phase des Turniers ist das ganze doch ein Best of 1, d.h. wir sind jetzt eine Runde weiter, richtig? Hab das in den FAQs übersehen oder es steht nicht drin. Best of 3 müsste doch erst bei den Gruppen Finals sein oder?\n\nBesten Dank und viele Grüße,\n\nWitchking","replies":[{"poster":"Elthision","date":"2017-02-09T19:11:38.402+0000","up_votes":1,"down_votes":0,"body":"Hey,\nIhr habt das Match heute gewonnen und seid somit weiter. Euer nächstes Spiel wird dann in Runde 4 sein, welche am Samstag dem 18.2. stattfindet. Wer gewonnen hat, wann ihr Spielen müsst und wer eure Gegner sind könnt ihr immer auch auf dem [Turnierbaum](https://battlegrounds.leagueoflegends.com/w83nXNxoDDWiC7XWNMdFgywL/brackets/de/406#Fight%20till%20death) einsehen.\nBest-of-3 gilt erst ab dem Gruppenfinale und das Finale ist schliesslich noch ein Best-of-5.\nmfg Elthision","replies":[]}]},{"poster":"koko707","date":"2017-02-06T21:45:23.089+0000","up_votes":1,"down_votes":0,"body":"Hi, \n\nbin einverstanden jungs und danke \nmfg koko","replies":[{"poster":"Elthision","date":"2017-02-06T22:02:09.339+0000","up_votes":1,"down_votes":0,"body":"Alles klar! Ihr werdet noch eine Email bekommen, in der Samstag 18 Uhr als Spieltermin genannt wird, aber Donnerstag, 19 Uhr, ist für euch eingetragen und somit verbindlich. Viel Glück beim Match!\nmfg Elthision","replies":[]}]},{"poster":"Elthision","date":"2017-02-06T20:53:06.547+0000","up_votes":1,"down_votes":0,"body":"Hey,\nFür uns ist dieser Termin akzeptabel. Wenn der gegnerische Captain diesen Termin noch bestätigt, so können wir diesen Termin zum offiziellen Termin erklären und somit wäre er verbindlich für beide Teams. Ihr müsst dies aber nicht tun - ihr könnt das Spiel auch sonst schon am Donnerstag spielen.\nDen Turniercode werdet ihr rechtzeitig noch erhalten. Falls am Donnerstag Probleme auftreten müsst ihr uns halt hier über das Forum oder über Social Media kontaktieren, da am Donnerstag normalerweise kein Adjudicator im Chatraum ist.\nmfg Elthision","replies":[{"poster":"Calas 13","date":"2017-02-06T21:32:15.129+0000","up_votes":1,"down_votes":0,"body":"Hi,\n\ndanke für die Antwort.\nIch habe den Link bereits an den gegnerischen Captain weitergegeben.\n\nmfg Calas","replies":[]}]}]}