{"poster":"Xswimming poolsX","date":"2016-03-08T09:13:16.279+0000","title":"bringt den urf mode zurück .","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":8,"body":"URF war das geilste in lol was ich in 3 jahren spielzeit jemals erlebt habe , dewegen muss es dieses jahr noch besser balanced sein find ich , riot m&uuml;sste also bei manchen champs f&uuml;r die urf zeit anpassungen vornehmen damit es einfach (fast) allen spass machen kann ,( 1000 mal in ner minute das keyboard zu dashen) . :D","replies":[{"poster":"BGGL Silence","date":"2016-03-08T10:26:51.820+0000","up_votes":4,"down_votes":0,"body":"http://euw.leagueoflegends.com/de/news/game-updates/gameplay/demnachst-verfugbar-die-spielmodus-rotation\n\nInformier dich bitte erstmal!","replies":[{"poster":"Xswimming poolsX","date":"2016-03-15T09:07:14.308+0000","up_votes":1,"down_votes":0,"body":"hab ich ja auch aber es gefiel mir nicht ich wollte es ändern , verstehst du?","replies":[]}]},{"poster":"Xswimming poolsX","date":"2016-03-08T09:15:33.238+0000","up_votes":1,"down_votes":2,"body":"ich mein  es sollte wieder zur osterzeit on kommen . {{champion:50}}  {{champion:105}} , die beiden waren sowieso die stärksten :D. Muss doch gar nicht immer der 1.te april sein , 24 märz würde doch besser sein weil da noch die osterferien sind und ich mehr zeit zum lol zocken haben würde als am 1.mai zum beispiel (bin bestimmt nicht der einzige dem es so geht ) .","replies":[{"poster":"Humpelstilzche","date":"2016-03-08T09:53:45.536+0000","up_votes":4,"down_votes":0,"body":"Scheinbar ist dir das Muster noch nicht aufgefallen...URF kam bisher immer am 1. April. \n\nBezüglich Balancing: Bin ich absolut dagegen. Bei URF geht es ja genau darum die Dinge zu finden, die irgendwie OP, also NICHT gebalanced sind. Ich fänds gut wenn sie es so machen würden wie vor zwei Jahren, dass sie alle paar Tage die meistgespielten Champs bannen.","replies":[{"poster":"Xswimming poolsX","date":"2016-03-08T10:08:53.005+0000","up_votes":1,"down_votes":2,"body":"stimmt es ist mir noch nicht aufgefallen weil ich es schon wieder vergessen   hab :D mein fail aber egal es geht um das wesentliche , und ok man kann es auch unbalanced lassen aber dann haben halt immer ne menge leute was zu meckern . Ich fänds halt toll wenn sie den termin ändern wie es im forum steht und dann jedes wochenende urf machen .oder noch besser die doom bots :D .","replies":[]}]}]}]}