{"poster":"Sexy Win","date":"2016-08-02T15:32:45.068+0000","title":"E tu ...... Sei \"STUDIATO\" ??? [SoS]","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Ragazzi , non leggo le patch , qualche buon samaritano che mi spiega che &egrave; sta roba di icone e casse strane?\r\nMagari anche a voce se &egrave; pigro o sul client \r\nIGN : SeMiGankiNonVale","replies":[{"poster":"Kopoo","date":"2016-08-02T16:14:23.790+0000","up_votes":4,"down_votes":0,"body":"Se intendi le nuova casse PROJECT è molto semplice, al momento sono disponibili 4 casse, una di Ashe, una di Ekko, una di Katarina e la Cassa Potenziata (disponibile solo tramite crafting o RP).\nLe casse di Ashe, Ekko e Katarina possono esser acquistate solamente una volta (le puoi prendere tutte e 3, ma solamente una volta), con IP (750) oppure con gli RP (75) e all'interno troverai:\n1 Icona (differente per ogni cassa), 1 Nucleo, 1 Schema Icona PROJECT (differente per ogni cassa) e un frammento di cassa potenziata.\nQuello che ti interesserà principalmente di queste casse è lo Schema Icona PROJECT, che potrai sbloccare usando 5 Nuclei tramite l'Hextech Crafting. Una volta sbloccato, ti permetterà di avere nella schermata di caricamento un bordino \"PROJECT\", ma solamente se possiedi la skin PROJECT in questione, ad esempio: Compri la skin \"PROJECT: Ashe\", dalla sua Cassa troverai sicuramente lo Schema Icona Project: Ashe, lo crafti e quando sarai nel loading screen ti ritroverai col bordino PROJECT. (In pratica ti conviene craftarli solamente se hai intenzione di comprare le skin di Ashe, Ekko o Kata).\nIl frammento di cassa potenziata può esser combinato con altri 2 frammenti di cassa potenziata (3 in totale) e otterrai una Cassa Potenziata, il che significa che se comprerai le 3 casse di Ashe, Ekko e Kata, avarai la possibilità di craftarne una. All'interno troverai: 1 Frammento di skin casuale, 1 contenuto Cassa Hextech (ovvero 1 frammento di campione oppure 1 frammento di skin oppure un frammento di skin ward), 2 Nuclei e la possibilità di trovare un frammento di cassa potenziata.\nFra una settimana verrà resa disponibile la Cassa DISORDINE (1500IP, 150RP, acquistabile solamente 1 volta) che conterrà:\n1 Icona DISORDINE, 7 Nuclei, 2 Frammenti di Cassa Potenziata ma soprattutto 1 Schema di Frammento Skin PROJECT (Casuale).\nQuel che più ti interesserà di questa cassa, oltre ai 7 Nuclei, è lo Schema di Frammento Skin PROJECT perchè fondendolo con 11 Nuclei, ti darà un Frammento di Skin PROJECT casuale (Escluse le skin PROJECT di Kata, Ashe ed Ekko).\nUltima cosa: Le casse di Ashe, Ekko e Kata saranno disponibili fino al 16/08 e la Cassa DISORDINE sarà disponibile dal 09/08 al 16/08.\nFammi sapere se hai qualche domanda ^^.","replies":[{"poster":"Sexy Win","date":"2016-08-02T17:03:58.428+0000","up_votes":1,"down_votes":0,"body":"Grazie mille solo una cosa \n\n> Fra una settimana verrà resa disponibile la Cassa DISORDINE (1500IP, 150RP, acquistabile solamente 1 volta) che conterrà:\n\n> e la Cassa DISORDINE sarà disponibile dal 09/08 al 16/08.\n\nFra una settimana o un mese ? xD","replies":[{"poster":"Kopoo","date":"2016-08-02T17:42:06.986+0000","up_votes":1,"down_votes":0,"body":"09 è il giorno :P \nDal 9 Agosto, fino al 16 Agosto.","replies":[{"poster":"Sexy Win","date":"2016-08-02T18:43:48.076+0000","up_votes":1,"down_votes":0,"body":"Dio va ahahahhaa\natto mancato hahahahah\nPensavo fosse settembre l'08 :facepalm: ahahah","replies":[{"poster":"Kopoo","date":"2016-08-02T19:11:43.540+0000","up_votes":1,"down_votes":0,"body":"Ahahahahaha","replies":[]}]}]}]}]},{"poster":"Floppyz","date":"2016-08-03T07:41:04.471+0000","up_votes":1,"down_votes":0,"body":"Io cercavo di capire se prenderle o no, quindi\n\nho letto sul sito... e non ci ho capito... \nho letto su surr@20... e non ci ho capito...\nho chiesto nel club del forum (grazie a chi mi ha gentilmente aiutato...) e non ci ho capito\npoi allora ho chiesto a S. Google, e ho trovato questo: https://www.reddit.com/r/leagueoflegends/comments/4vruak/project_chest_guide_for_dummies/","replies":[]},{"poster":"wellyT93","date":"2016-08-02T15:46:09.478+0000","up_votes":1,"down_votes":0,"body":"http://euw.leagueoflegends.com/it/site/2016-season-update/champion-mastery.html","replies":[]}]}