{"poster":"KatVay OmegaChan","date":"2015-10-12T01:57:36.343+0000","title":"Skin para Thresh","subforum":"Charlas Generales","up_votes":3,"down_votes":2,"body":"Buenas, vengo a recomendarle a Riot que haga una Skin pata Thresh \r\nLa skin se basa en que comparte tematica con Yasuo Osea forajido\r\nPasiva: Que las almas sean &quot;Tumbleweed&quot; (Para los que no sepan son los arbustos del desierto esos que ruedan)\r\nQ: Tira un latigo\r\nW: Que el caballo en el que va montado se aleje y lleve a un aliado tirando polvo (no mucho que sino molesta la jugabilidad)\r\nE: Con el l&aacute;tigo empuja a los enemigos y lanza polvo\r\nR: Que los muros sean polvo\r\n\r\nen todos los casos el polvo sea marron como la W de Yasuo o algo asi Gracias Riot por leer esto (si es que lo leen)\r\nDe antemano gracias :D","replies":[{"poster":"Cipher","date":"2015-10-12T02:29:25.415+0000","up_votes":2,"down_votes":0,"body":"Me parece buena idea. Y que además tenga el famoso SQUICH! del latigazo al momento de acertar a un enemigo.\n\nLa W puede ser una especie de cantimplora y la pasiva gotas de agua.\n\n¿Qué genial y tan terrorífica la idea de que nuestro Señor Thresh exprima el líquido vital de sus adversarios, para luego saborear gota a gota, disfrutando de la cosecha producida a través del trabajo arduo y placentero de reclamar la vida de los adversarios?","replies":[]},{"poster":"MewMewKittyCutie","date":"2015-10-12T03:50:43.122+0000","up_votes":1,"down_votes":0,"body":"Para tener tanto polvo en game se vería muy bien :3 yo me imagino a la R como que saca  un corral así ni los {{champion:12}} ni las ovejas  {{champion:203}} podrán salir >:3","replies":[{"poster":"Aioria99","date":"2018-08-21T23:52:53.489+0000","up_votes":1,"down_votes":0,"body":":v","replies":[]},{"poster":"Zabivaka","date":"2015-10-12T04:25:53.580+0000","up_votes":1,"down_votes":0,"body":"bue kindred podria saltar pero alistar se lo lleva puesto","replies":[]}]},{"poster":"Figueroa45","date":"2015-10-12T03:14:57.542+0000","up_votes":1,"down_votes":0,"body":"La parte de las habilidades me parece una muy buena idea, solo falta el diseño del personaje... algo así como el alguacil de la ciudad (Traje negro mas o menos así   http://mexablog.com/wp-content/uploads/2011/02/cwswvardas_thumb.jpg claro ahora quita a la persona, ponle un latigo y coloca a Thresh :3) Con esta idea espero que esta skin prospere suerte (Saluda un main Thresh{{champion:412}} )","replies":[]}]}