{"poster":"Whettamyessam","date":"2015-01-16T01:06:52.244+0000","title":"I got banned for leaving a custom game without any previous leaves.","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":2,"body":"I had played a few games in a row, when i get on the next day i want to see how ireilias abilities scale (to physical dmg or Ap) and i leave without any bots in the game and i leave 35 seconds in and get put in the leavebuster que which is not the worst i can wait ten minutes. But every time i try to que up it resets back to 10 minutes and if i cannot play why wait in a leavebuster que when nothing will pop up but if it does and i dont accept than it will probably reset and i know it isnt a consistant problem but that leaving a custom game shouldnt count against me and not only that but it isnt on my match history as a leave so i am in leavebuster que for no reason\r\nPlease fix this riot\r\ni know u wont stop it while i wait but this is rediculous and needs to be reported","replies":[{"poster":"Riot Tantram","date":"2015-01-16T01:40:45.855+0000","up_votes":3,"down_votes":0,"body":"PentaKill Bruh,\n\nI wish I could help you out, but I can't. Those cases have to be handled by player support.","replies":[]},{"poster":"Riot Tantram","date":"2015-01-16T01:19:19.840+0000","up_votes":5,"down_votes":3,"body":"Sorry for the confusion. You did not get a leaver buster penalty for leaving the custom bot game. Recently many players were having connectivity issues, so we turned the leaverbuster system off temporarily. Now that the issue has been resolved, the system has been turned back on. It just so happens that you had a punishment to serve when the system was turned off. You may have forgotten about it, or thought you completely served the punishment.\n\nLeaverbuster detects AFKs as well as leaves, so the offending game may not be evident in your match history. Now that the system is back online, punishments and the reduction of them will be applied directly after the game. That should help out greatly with the confusion.","replies":[{"poster":"PentaKill Bruh","date":"2015-01-16T01:37:00.821+0000","up_votes":1,"down_votes":2,"body":"Hi can you please look into my recent permanent suspension it is a wrong doing because i do not deserve a ban of any sort i have never been toxic and it didn't tell me why i got banned in the email only after i made a ticket did i get a message for \"Toxicity\" but it was a automated message and its been 15 hours no1 replied when i said please look at my chat logs then unban me when you see I've done nothing wrong.","replies":[]},{"poster":"Gekkousama","date":"2015-01-16T01:23:13.883+0000","up_votes":3,"down_votes":7,"body":"Sorry but when your forums are flooded with the same bug report from hundreds of players at the same time, you need to admit defeat and provide due compensation instead of lying to everyone's faces.","replies":[]}]},{"poster":"several lbs lean","date":"2015-01-16T01:26:47.106+0000","up_votes":2,"down_votes":4,"body":"i have a feeling it wasnt his fault. Since ive started playing again ive left exactly 0 games and got the queue dodge warning several times for no reason.","replies":[{"poster":"Riot Tantram","date":"2015-01-16T01:34:23.432+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=feathand,realm=NA,application-id=LqLKtMpN,discussion-id=J2EpG4G6,comment-id=0001,timestamp=2015-01-16T01:26:47.106+0000)\n>\n> i have a feeling it wasnt his fault. Since ive started playing again ive left exactly 0 games and got the queue dodge warning several times for no reason.\n\nHey Featand!\n\nThanks for the comment, and help me if I'm incorrect. The queue dodge warning is not related to leaverbuster in any way, and I believe the two of you are talking about different warnings/systems. They do look similar though.","replies":[]}]},{"poster":"hey im your dad","date":"2015-01-19T03:27:43.376+0000","up_votes":1,"down_votes":0,"body":"Go play Dota 2, they wont ban you for such silly things, trust.\nAnd league of legends also copy everything from dota2, they know it is a colorful kiddy game. You have to trust me.\nI wasted 3 years of my life by playing lol gold(1)\n\nRead this thread in the link!, You have to read it.\nhttp://forums.euw.leagueoflegends.com/board/showthread.php?t=1311711&page=38\n\nQuit league of legends, im not saying you are bad or anything. i just say you have to trust me.\nim 21 years old and have a life now!","replies":[]},{"poster":"osleeZy","date":"2015-01-16T03:24:56.340+0000","up_votes":1,"down_votes":3,"body":"ALL RIOT MEMBERS, just say \"TOXIC\" \"TOXICITY\" uhm, hello look up the definition in the dictionary..","replies":[{"poster":"Riftasaurus Rex","date":"2015-02-11T09:20:18.026+0000","up_votes":1,"down_votes":0,"body":"Saying toxic is just a cop out, come up with a word that actually holds a scrap of context.. It comes with this new age of people that have no spine and think they have the right to never be offended. Being offended and harassed are different beasts but riot has some philosophically challenged managers.","replies":[]}]},{"poster":"EternalDarknez","date":"2015-01-16T01:33:36.065+0000","up_votes":1,"down_votes":4,"body":"why does riot lie so much =/\n\nit makes me sad ='(","replies":[]}]}