{"poster":"Sh1n1gam1Kun","date":"2019-12-07T02:32:58.071+0000","title":"¿Que pasa con la compra de RP en LAS?","subforum":"Problemas Técnicos","up_votes":13,"down_votes":1,"body":"Me gustaría saber que esta sucediendo con el tema de Boa compra y las tarjetas, mucha gente quiere comprar RP de esta forma pero no aparece la opción y no se ha dado ni información ni avisos, quizás he buscado mal, pero parece que a #Riotgames® no le interesa ganar lo que ganaba hace unos meses en el servidor de LAS. Me despido cordialmente esperando una respuesta seria y si alguien también desea saber que esta sucediendo por favor hagan \"viral\" esta discusión.","replies":[{"poster":"ˆˇˉˉˉˉˉˉ","date":"2019-12-07T06:12:46.750+0000","up_votes":4,"down_votes":0,"body":"Tengo entendido que es por el cambio gubernamental... por esto BCRA (Banco central de la república Argentina) bajo el marco del DNU 609/2019 no puede autorizar transacciones de dolares hasta que se implementen los parámetros del nuevo gobierno que viene el 10 de diciembre, creo... o era 12, no recuerdo... es cuestión de espera hasta que venga el nuevo gobierno n.n... Aunque puede durar hasta el 31 de diciembre dependiendo de lo que dicte el nuevo régimen gubernamental.\nPD: esto afecta a la Argentina nada más creo, no se si afecta a otros países..\n.. \n{{sticker:sg-ahri-2}}","replies":[]},{"poster":"Lunari Red Mask","date":"2019-12-07T21:18:58.216+0000","up_votes":1,"down_votes":0,"body":"La información en Estado del Servicio man. Cito:\n\"\nOperaciones de Red – 04/11/2019\n\nActualmente, las compras con tarjetas de crédito a través de BoaCompra se encuentra desactivadas. Por el momento no tenemos fecha de resolución. Si deseas adquirir RP, por favor intenta con otros métodos de pago\n\"","replies":[]},{"poster":"ˆLuluˆ","date":"2019-12-07T18:20:33.130+0000","up_votes":1,"down_votes":0,"body":"Antes compraba RP con Cuenta Rut en Webpay, ahora compro lo mismo pero con Cuenta Rut Visa\n(No es necesario tener mas de 18 para comprar) {{sticker:slayer-jinx-catface}} \n\nSi eres de Chile y no puedes comprar con tarjetas locales, como la cuenta Rut solo cámbiala por Cuenta RUT VISA la habilitas y demás y con eso puedes comprar rp\n\nO usa la aplicación Mach también en Chile si eres mayor de edad suerte\n\nEntonces en argentina no pueden comprar RP, que mal ojala lo solucionen pronto\nSuerte argentina que se mejoren besos abrazos y me voy ir almorzar. {{sticker:sg-poppy}}","replies":[]},{"poster":"Sâbo","date":"2019-12-07T17:29:43.358+0000","up_votes":1,"down_votes":0,"body":"hace rato q queria comprar rp para el evento de \"tu tienda\" pero no podia porq estaba deshabilitada la opcion, y riot no ha dado ninguna respuesta y dudo q lo hagan, he visto q responden tonteras como \"que se siente tomar mate con magical\" pero no sobre esto cuando comenzo el problema, nefasto los rioters","replies":[]},{"poster":"Niño Macaquiño","date":"2019-12-07T16:50:58.573+0000","up_votes":1,"down_votes":0,"body":"Deberían avisar al menos si es por el cambio Gubernamental","replies":[]},{"poster":"Hnk Kenshiro","date":"2019-12-07T03:13:55.045+0000","up_votes":1,"down_votes":0,"body":"Esta desabilitada hasta nuevo aviso practicamente.","replies":[]}]}