{"poster":"UniversalPulsar","date":"2016-12-08T11:17:55.984+0000","title":"Ma....Katarina?!","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Salve, mi domandavo come sarebbe provare {{champion:55}} ...mi sembra un champ divertente e con molta mobility (come piace a me), ma sinceramente mi sembra un po complicata da giocare e io non &egrave; che abbia molto tempo a disposizione per poter imparare al meglio un champ. Quindi la mia vera domanda &egrave;: voi cosa ne pensate di lei....si pu&ograve; giocare decentemente anche se non si ha il tempo per mainarlo, o &egrave; troppo difficile per uno che gioca abbastanza raramente come me? A me sinceramente piace e non cerco champ che mi diano per forza la soddisfazione di ottenere grandi risultati in partita, ma champ che mi divertano, infatti io gioco solo draft, quindi anche se perdiamo la partita per colpa mia non succede niente. Bisogna non dimenticare che si tratta di un gioco dopo tutto. Se avete dei consigli da darmi sul gameplay o anche sulla build saranno ben accetti.\r\nGrazie in anticipo per il tempo accordato a leggere un post di uno che &egrave; abbastanza ignorante in questo gioco.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"NOLIMIT Vladimir","date":"2016-12-08T12:12:17.770+0000","up_votes":1,"down_votes":0,"body":"Prima del rework era: Q-E-W-R tripla, era veramente semplice e sbalanced. Ora con il rework è nolto più difficile e anche nuova, non è più ripetitiva come prima e fa altissimi danni anche senza ulti grazie alle daghe. Inoltre è un champ unico nel suo genere, nessuno ha uno stile del genere con un sistema simile di daghe.","replies":[{"poster":"oroora6","date":"2016-12-08T12:14:31.698+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MrYellowZ,realm=EUW,application-id=98NGV4Al,discussion-id=z1XZAAr7,comment-id=0001,timestamp=2016-12-08T12:12:17.770+0000)\n>\n> Prima del rework era: Q-E-W-R tripla, era veramente semplice e sbalanced. Ora con il rework è nolto più difficile e anche nuova, non è più ripetitiva come prima e fa altissimi danni anche senza ulti grazie alle daghe. Inoltre è un champ unico nel suo genere, nessuno ha uno stile del genere con un sistema simile di daghe.\n\nSbalanced..... SBALANCED\nVERGOGNA! E' PER LE PERSONE COME TE CHE I GIUOVANI PARLANO INGLESIZZANDO LE PAROLE\nComunque si dice unbalanced, peccatore","replies":[{"poster":"NOLIMIT Vladimir","date":"2016-12-08T12:22:52.944+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=oroora6,realm=EUW,application-id=98NGV4Al,discussion-id=z1XZAAr7,comment-id=00010000,timestamp=2016-12-08T12:14:31.698+0000)\n>\n> Sbalanced..... SBALANCED\n> VERGOGNA! E&#x27; PER LE PERSONE COME TE CHE I GIUOVANI PARLANO INGLESIZZANDO LE PAROLE\n> Comunque si dice unbalanced, peccatore\n\nQuindi Killare, Pokkare e Gankare vanno bene e sbalanced no? {{champion:17}}","replies":[{"poster":"ViaMalinconiaN9","date":"2016-12-08T13:56:26.432+0000","up_votes":1,"down_votes":0,"body":">Quindi Killare, Pokkare e Gankare vanno bene e sbalanced no? \n\nQuesta è un'altra cosa.","replies":[{"poster":"NOLIMIT Vladimir","date":"2016-12-08T15:00:30.986+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AnjoCaìdo,realm=EUW,application-id=98NGV4Al,discussion-id=z1XZAAr7,comment-id=0001000000000000,timestamp=2016-12-08T13:56:26.432+0000)\n>\n> Questa è un&#x27;altra cosa.\n\nNon è un altra cosa, in \"Killare\" è stato preso il verbo \"Kill\" e aggiunto un suffisso italiano per indicare un verbo \"are\", in \"sbalanced\" è stato preso il verbo \"balanced\" e aggiunto il prefisso \"s\" che in italiano indica il contrario. È la medesima cosa...","replies":[]}]}]}]}]},{"poster":"Sarchiapon","date":"2016-12-08T11:26:38.777+0000","up_votes":1,"down_votes":0,"body":"Proprio perchè è un gioco, potresti tranquillamente giocare ranked e fregartene. Se qualcuno rompe, basta che lo silenzi (non rispondere con nessun tipo di insulto e non spammare, se ti reportano potresti andarci di mezzo. Silenzia e basta, non scrivere proprio niente, e dopo se vuoi reporti). Tieni presente che in ranked ci sono un pò meno flammoni e troll, proprio perchè il \"rischio\" di perdere rank tiene un pò a freno i bollenti spiriti. \n\nKatarina non è più \"premi R e muoiono tutti\". Fa sempre molti danni ma c'è da impegnarsi un pò di più lanciando i coltelli in punti strategici e saltando qua e la per prenderli. Non so darti consigli specifici ma fossi in te vedrei qualche video di giocatori che la sanno usare. E' tutt'altro che scarsa, è solo che non è più \"piangi per 20 minuti - killi tutti dopo\" come prima.","replies":[]}]}