{"poster":"Space Spoon","date":"2016-04-28T20:04:57.146+0000","title":"Que asco","subforum":"Charlas Generales","up_votes":3,"down_votes":11,"body":"Que es Garen, tiene todo, velocidad, da&ntilde;o...","replies":[{"poster":"xxxcanabisxxxx","date":"2016-04-28T20:11:55.024+0000","up_votes":2,"down_votes":1,"body":"poco cc,mucho cd, countereable con MANOS  mmm","replies":[{"poster":"Algroth","date":"2016-04-28T22:39:17.836+0000","up_votes":1,"down_votes":0,"body":"Desde cuando es un tanque puro con ulti dirigida por 1000+ de daño verdadero countereable con manos? \n\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Boni FuFuu","date":"2016-04-29T03:56:43.283+0000","up_votes":1,"down_votes":0,"body":"Te juro que con manos se le gana xd, la E de sivir evita su ulti, la W de fiora cancela su ulti , y si sos lucian o vayne o cait (sino te silencio y tiro flash y todo eso) es facil de kitear, a y me olvide que la W de nocturne también cancela su ulti. Con el tiempo podrás hacerle frente en casi cualquier caso.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Algroth","date":"2016-04-29T05:32:29.375+0000","up_votes":1,"down_votes":0,"body":"En ranked y si tenés el counter-pink, seguro. Si estás jugando una normal o si te lo pickean en tu contra jugando un bruiser o carry más común, no tanto. No es que no se puede jugar en contra de un Garen, por cierto, pero lo que hace falta no son \"manos\".","replies":[{"poster":"Boni FuFuu","date":"2016-04-29T06:46:37.464+0000","up_votes":1,"down_votes":0,"body":"Claro, pero a lo que vengo yo con \" manos\" es conocer bien sus cooldows y cuando atacarlo (estrategia básicamente). Queria agregar también que con Irelia si tienes cuidado le ganas y con Renek  no se si era malo o yo sabia bien sus cooldows que sali 4/0 de linea , yo una vez vi un garen perder contra teemo xd","replies":[{"poster":"Algroth","date":"2016-04-29T22:14:50.858+0000","up_votes":1,"down_votes":0,"body":"Pero todos sabemos que Teemo es counter de todos. :v\n\nYo diría que todo eso no es tener manos sino conocer a un nivel más estratégico, en vez de mecánico, el juego. ;-) Además, unos de los problemas de Garen es precisamente que es un super-tanque que además tiene una pasiva que le permite regenerarse cualquier harrass. En una ventana de cuatro segundos no vas a poder burstear al personaje nunca, ni hacerle gran daño. En línea al menos. La mejor forma de counterear a un Garen es un trabajo coordinado de equipo, buscar castigarlo tempranamente, permitir que el toplane contrario si es un bruiser pueda conseguir una ventaja de itemización, y por lo tanto escalado, sobre el mismo de Garen, y buscar luego hacer peel y bajarlo de a equipo en los teamfights, no dejar que se acerque. Es uno de esos tanques que aportan muy baja utilidad al equipo y por lo tanto es inútil cuando está atrás, pero tiene muchas herramientas a su disposición para no *quedarse* atrás. El problema es que en normales y SoloQ, al menos de elo bajo, esa clase de coordinación es muy, muy rara.","replies":[{"poster":"Boni FuFuu","date":"2016-04-29T22:37:10.258+0000","up_votes":1,"down_votes":0,"body":"vlad es counter de teemo . Si tal cual , el problema es en normal y soloq en elo bajo.","replies":[{"poster":"Algroth","date":"2016-04-29T22:51:52.122+0000","up_votes":1,"down_votes":0,"body":"Era un chiste.\n\n{{sticker:slayer-jinx-unamused}}","replies":[]}]}]}]},{"poster":"Boni FuFuu","date":"2016-04-29T06:47:36.873+0000","up_votes":1,"down_votes":0,"body":"\nLa ulti tiene daño verdadero si estas marcado. cuestión un buel peel y listo","replies":[]}]}]}]},{"poster":"West Coast","date":"2016-04-28T20:40:55.897+0000","up_votes":1,"down_votes":1,"body":"Mucho cd? A lvl UNO la Q cada 4 segundos te parece mucho cd?","replies":[{"poster":"Algroth","date":"2016-04-28T22:35:43.537+0000","up_votes":1,"down_votes":0,"body":"El cd base de la Q es 8 segundos en todos los niveles. >_>","replies":[]}]}]},{"poster":"Joseph Joestarr","date":"2016-04-28T20:10:29.473+0000","up_votes":2,"down_votes":1,"body":"bienvenido a league of legends mijo :v","replies":[]},{"poster":"Chellx","date":"2016-04-30T00:02:24.269+0000","up_votes":1,"down_votes":0,"body":"Entonces juga con garen okno :v","replies":[]},{"poster":"Sera Eterno","date":"2016-04-28T22:26:53.547+0000","up_votes":1,"down_votes":0,"body":"se ve que alguien lo masacro un garen :v","replies":[]}]}