{"poster":"Riot Nebo","date":"2017-01-11T18:48:39.099+0000","title":"¿Como pasar de Oro V? ¡Necesito sus consejos!","subforum":"Off-topic y temas personales","up_votes":21,"down_votes":5,"body":"Hola chicos y chicas del foro \r\n\r\nVengo con esta peque&ntilde;a consulta y pido sus consejos muy honestamente, pero antes les cuento un poco sobre mi modo de juego:\r\n\r\nJuego desde la temporada 3 si no estoy mal, en esa &eacute;poca jugaba Warwick Jungla y Top, era mi main y jugu&eacute; en esas posiciones durante muchos a&ntilde;os. Me gustan muchos los tanques {{champion:154}}  {{champion:48}}  {{champion:27}} \r\nLuego por azares del destino empece a jugar Support, lo cual juego actualmente. Me gustaba jugar {{champion:53}}  {{champion:12}}  {{champion:201}}  {{champion:44}} \r\nEn las temporadas pasadas no sub&iacute;a sino a Plata I y ah&iacute; quedaba.\r\nLa temporada pasada empece a jugar mas cauteloso, menos agresivo y con Taric, el cual es mi main actualmente. Llegue a Oro V, lo cual fue satisfactorio y me sent&iacute; mucho mejor como jugador, pero intente subir y subir a Oro IV y no pude, parec&iacute;a que siendo support no lo iba a lograr. \r\n\r\nEste a&ntilde;o volv&iacute; a jugar las 10 partidas clasificatorias y qued&eacute; en Plata II y ah&iacute; voy intentando subir. \r\n\r\n&iquest;Que me recomiendan? &iquest;Cambio de linea? &iquest;Busco un duo ADC? &iquest;Juego mas campeones? \r\n\r\n&iexcl;Ayuda!","replies":[{"poster":"9081913DEL1","date":"2017-01-11T19:12:58.453+0000","up_votes":4,"down_votes":9,"body":"Pues deja de usar taric.\n\nTaric es buenisimo cuando estas de punta, estas 100% en el game, pues la carreas. Ahora te toco solo bot por una fc y quedaste out media partida si es que se remonta.\n\nSiempre que quieras subir elo la comunicacion es laa clave, y vamos que es un juego de equipo\n\nSoportes, ve soportes que sean efectivos a la hora de apoyar al adc y pokear. Como karma o morgana. O soportes que tengan buen balance entre utilidad y tankeo com tresh o bardo.\n\nLa cosa para subir a elos medios es basicamente dejar de pensar en TU linea y apoyar al resto. Darle ventaja, no es tanto quien se lleva la kill mas bien poder estar en dos lados a la vez. Lo mas facil son bardo, soraka, shen etc. \n\nSi cambias de rol ve por jungla, los invis hacen muchisimo acoso actualmente. Elise, senj, voly son buenas opciones tambien.\n\nDe oro para arriba el que aprovecha mejor el cc gana, atento a que mas o menos deberian dominar el champ que usan se basa mucho en jugar a la tf todavia, asique si ganas, o les deniegas el exito en cada inicio ganas.\n\nUsa campeones de cc duro y juega pasivo, en oro se gankea mucho a veces demasiado, tambien se empujan mucho las lineas o se mantienen demasiado estaticas y eso lo facilita. \n\nSaludos.","replies":[{"poster":"Natchin","date":"2017-01-11T19:35:06.394+0000","up_votes":20,"down_votes":1,"body":"Un tipo que hace 3 días llegó a Master jugando solo Taric no está de acuerdo contigo.\nhttps://www.reddit.com/r/leagueoflegends/comments/5mqqqc/hello_i_played_taric_to_master_100_lp_and_this_is/","replies":[{"poster":"resnov15","date":"2017-01-11T19:39:12.827+0000","up_votes":11,"down_votes":1,"body":"Ese tipo si que tiene las gemas bien puestas http://st.elohell.net/public/chill/b2f317b0553663fa7786756247e529ad.gif","replies":[]}]}]},{"poster":"Neros II","date":"2017-01-11T19:47:37.728+0000","up_votes":13,"down_votes":0,"body":"Voy a usar tu op.gg de referencia si no te molesta.\nVistazo rápido:\n1. No juegues taric top!!!!\n2. TRINKET ROJO\n2. Abusá de CotC (la maestría de colosos), el escudo está demasiado fuerte.\n3. Capa de fuego solar no es buen item de support\n4. Participá más de peleas en equipo y rotaciones, participás de pocas kills\n\nEn general jugar un solo campeón no está mal. Taric además no se banea casi nunca y es fuerte. Soporte es un gran rol para subir, aunque la gente diga lo contrario. Jugás mucho contra gente que en realidad quería otro rol y gente que cree que los soportes no tienen que hacer nada. Si intentás mejorar te volvés mejor que el supp contrario muy rápido.\n\nVamos a los detalles:\n-  Necesitás comprar más wards de control. El máximo que vi que sacases fue 4, el rpomedio cerca de 2. Deberías sacar todas las partidas más. Incluso si la ward queda y nadie la ve, probablemente es porque está en una zona poco transitada y da poca información. Movela y usá para deswardear. Lo que nos llevá al segundo punto.\n- Deswardear: Deswardear no es casual, hay que recordar dónde hay wards y hacer todo lo posible por sacar esa ward lo antes posible, especialmente en lugares clave como el río o el pit de dragon/baron. Pero cómo vas a hacer eso sin wards de control y sin trinket rojo? En el primer o segundo back se saca el lente revelador y apenas backees siendo nivel 9 se mejora. SIEMPRE. Es demasiado bueno como para ingorarlo, deja al otro equipo a ciegas, es impagable.\n- Maestrías: CotC es demasiado fuerte en este momento con cualquier cosa que tenga un hard cc. El único caso en el que garras del inmortal es una buena maestría es contra otros supps melee como pueden ser Leona, Braum, Alistar, etc., contra los que vas a poder usarla más de una vez en una misma pelea. Contra supps de rango es prácticamente inútil. Thunderlords es inútil y punto. En todo caso si queré sel 5% de CDR extra podés ir con windspeakers, pero no estoy seguro de que valga la pena.\n- Items: Sacás siempre Ionian boots+ el ojo de tanque. No está del todo mal eso, pero es muy poco flexible. En taric prácticamente todas las botas sirven, adaptate a la partida. Son 4 ad+ Janna? Ninja tabi. Tienen ap mid y top y mucho cc? Merc treads. Querés dar vueltas por el mapa y estar en todos lados? Mobis.\nEn cuanto a items defensivos, capa de fuego solar y deadmans plate no son items de support. Punto. No dan peel de ningún tipo, tu objetivo no es hacer daño ni correr a la gente hasta matarla. Frozen heart y solari son tus amigos, esos items sirven para tu equipo y peleas en equipo, que es lo que quiere taric, lo mismo que el item nuevo de soporte que es un casquito y me olvidé el nombre.\n\nSi se me ocurre algo más edito. Suerte!","replies":[{"poster":"Riot Nebo","date":"2017-01-11T20:24:27.492+0000","up_votes":5,"down_votes":0,"body":"¡Solo [jugué ](http://las.leagueoflegends.com/es/news/champions-skins/champion-spotlight/taric-carril-superior-paciencia-y-perseverancia)una veeeeeeezzzzzz! \n\nLos trinkets los voy a comprar mas a menudo.\n\nLa nueva maestría me parece muy adecuada, mi build la manejo muy situacional, pero voy a revisarlo mejor.\n\nLas botas las saco para la reducción de enfriamiento, spammear la habilidad E de Taric me ha ayudado bastante. Corazón de hielo lo sacaba bastante la temporada pasada (pero no me daba vida), Solari lo usaba muy situacional, voy a probar con esa build que me recomiendas. \n\nDe los items nuevos uso Redención, en combinación con la Ulti de Taric en una TF, me ha funcionado increíblemente bien. \n\n¡Gracias!","replies":[{"poster":"FedecarboneroUY","date":"2017-01-11T20:52:22.704+0000","up_votes":7,"down_votes":1,"body":"{{item:3068}} es muy season 5 nebito, te vas denuncia3","replies":[{"poster":"Riot Nebo","date":"2017-01-11T21:12:16.120+0000","up_votes":10,"down_votes":0,"body":"Me gusta quemar con el fueguito... :(","replies":[]}]}]}]},{"poster":"Neo Gaussrik","date":"2017-01-11T19:32:57.108+0000","up_votes":9,"down_votes":1,"body":"En mi experiencia, Oro es el punto en el que los jugadores empiezan a diferenciarse mas.\n\nHasta este punto, el gran diferenciador en habilidad de los jugadores suele ser cuanto oro ganan en sus partidas (CS para los carrileros, frecuencia de emboscadas exitosas para el junglero, consistencia de la mecanica del objeto de oro para el soporte).\n\nDe Oro para arriba, cada vez mas son otros factores los que le dan una ventaja en victorias a un jugador.\n\nAdjunto algunas recomendaciones mas especificas, quizas te sean de ayuda:\n\n----\n\n**Pensar en composiciones de equipo**\n\nAunque esta no es una regla absoluta, en general, los equipos necesitan:\n* Un campeon capaz de actuar de linea frontal, con resistencia *pasiva* y control de masas.\n* Un campeon cuya contribucion principal sea causar daño al enemigo y cuyo daño es principalmente **fisico**, y otro cuyo daño es principalmente **magico**.\n* Un campeon capaz de alcanzar la linea trasera enemiga **consistentemente** para eliminar una amenaza critica del equipo rival, **_O_** un campeon que fuerza al equipo enemigo a hacer lo mismo y perder.\n* Un campeon capaz de destruir torres y eliminar monstruos epicos de manera rapida y consistente.\n\nMuy abstracto? Veamos unos ejemplos.\n\nSupon que tu equipo tiene un tirador ({{champion:202}} ), un escaramuzador ({{champion:157}} ), un tanque en carril superior ({{champion:78}} ) y un tanque en la jungla ({{champion:79}} ).\n\nLos campeones que te gusta jugar son todos tanques, pero como soporte, tener la flexibilidad de poder cumplir un rol de acarreador te permite arreglar esta composicion dandole una fuente primaria de daño magico ({{champion:63}}, {{champion:143}} ).\n\nMi recomendacion es tener una variedad de roles que puedes cumplir en tu posicion. Como soporte, eso significa no solo tanques protectores, sino que tambien tanques agresivos, magos, y encantadores. Idealmente mas de uno para que no seas demasiado vulnerable a que te bloqueen el unico campeon que sabias jugar en el rol.\n\n----\n\n**Auto-evaluacion y humildad**\n\nAl final de cada partida, es una buena costumbre detenerse un momento y pensar \"como lo pude hacer mejor\"?\n\nSubir o bajar clasificacion en League of Legends no se soluciona en una partida, y a veces la diferencia entre una division u otra puede ser menos de 1% de victorias.\n\nEntonces, en vez de enojarse y culpar al equipo (o al rival), es bueno siempre enfocarse en uno mismo y como podria mejorar.\n\n----\n\n**Versatilidad de posiciones**\n\nA veces, nos toca el autocomodin y tenemos que jugar en otra posicion.\n\nCasi nadie tiene el mismo nivel de habilidad en las 5 posiciones, pero no es necesario serlo. El objetivo no es acarrear la partida, es hacer suficiente contribucion a tu equipo para que el equipo pueda ganar.\n\nCuando sea que te toca jugar alguna posicion en la que no estas comodo, la responsabilidad de acarrear la partida no debiera caer en ti. Simplemente practica lo suficiente para que tengas alguna idea de que estas haciendo e intenta sobrevivir lo mejor que puedas. Recuerda: el objetivo no es ganarlas todas, es **perder menos** y **ganar mas**.\n\n----\n\n**Finalmente, Paciencia**\n\nEn el fondo, subir de MMR significa mucho tiempo y esfuerzo- y es exponencialmente mas tiempo y esfuerzo a medida que mejoras.\n\nNo te frustres, no te rindas, y persevera. Juega regularmente y lentamente vas a ir mejorando y subiendo. Los trucos ayudan, pero la clave real para subir es mas practica.\n\n----\n\nAnimo, y suerte en tus partidas! :D","replies":[{"poster":"Riot Nebo","date":"2017-01-11T20:31:07.068+0000","up_votes":3,"down_votes":0,"body":"Voy a probar los soportes magos, me parecen muy alineados con lo que quiero. Pero siempre me da prevención lo de robar las muertes al ADC o a otro personaje, con Zyra me falta puntería o algo, con Brand me pasa lo mismo. ¡Hasta con la Q de Sona!","replies":[]}]},{"poster":"Nilan Peyton","date":"2017-01-11T19:00:51.881+0000","up_votes":7,"down_votes":2,"body":"Podes subir jugando sup, no te rindas\nPero podrias intentar jugar sups agresivos (zyra, tresh, blitz,)\no ajustarte a la composicion del team, hay adc que van mejor con sups agresivos y viceversa\ntienes que fijarte en esos detalles tambien","replies":[{"poster":"Riot Nebo","date":"2017-01-11T19:06:44.550+0000","up_votes":8,"down_votes":2,"body":"Intente Zyra, pero me llevaba la kill y no era lo optimo, me ganaba las puteadas de mi ADC XD.\n\nBlitz me ha gustado mucho la capacidad de silenciar, el stun y ob y lo he visto muy activo últimamente.","replies":[{"poster":"Ode to dark","date":"2017-01-11T22:38:58.259+0000","up_votes":5,"down_votes":0,"body":"Ahhh, un clásico, que te de igual si te llevas la kill, si te sientes capaz de carrear llévate todas las kills que necesites a menos que sea una kill muy regalada, ahí se la dejas la carry. Si te preocupas de \"dejar la kill\" en una pelea, no estarás haciendo lo óptimo, que es aplicar la mayor cantidad de daño. Yo voy con {{champion:43}} con Thunderlord y si me llevo las kills bienvenidas sean. Lo importante es que tú y el carry salgan bien parados de línea. Lo que te recomiendo es hacer bastante roaming e intentar tirar todas las torres posibles, yo estoy actualmente en plata I porque no he jugado mucho luego de las diez primeras pero no creo que me cueste ya que en estos elos basta con tener visión de juego, map awareness (o sea saber trackear al enemigo y tratar de pensar donde estarán). También intenta pedirle a tu equipo que wardeen más, como support debes estar atento al mapa ya que también es parte de \"suportear\" a tu equipo, si no tienen wards en partes peligrosas y están pusheando mucho, pingéales para que lo hagan o al menos para que tengan más cuidado. También puedes intentar putear un poco el lvl 1 del jungla enemigo dependiendo del campeón (con {{champion:53}} le quitas los monstruos, con{{champion:143}}  o {{champion:43}}  lo puedes pokear para que no se la haga tranquilo pero cuidado con tirar las habilidades porque puedes terminar ayudándolo xD) Suerte en los campos de justicia! xD","replies":[]}]}]},{"poster":"Maycoltf2","date":"2017-01-11T18:52:21.839+0000","up_votes":3,"down_votes":3,"body":"Nunca estuve en oro , pero actualmente veo a {{champion:412}} {{champion:117}} {{champion:12}}  muy fuertes.","replies":[{"poster":"René Héctor","date":"2017-01-11T18:54:31.264+0000","up_votes":4,"down_votes":1,"body":"Puro {{champion:40}} mas arriba , igual ase poco me toco con un tipo que solo usaba {{champion:81}} suport , me parecio buen sujeto , lo agrege a amigos","replies":[{"poster":"FedecarboneroUY","date":"2017-01-11T20:55:17.452+0000","up_votes":5,"down_votes":0,"body":"EzrealsupportOP (?\n\nestoy seguro que era ese xd","replies":[]}]}]},{"poster":"lPikachu","date":"2017-01-11T20:39:06.760+0000","up_votes":5,"down_votes":0,"body":"A.- **Hay una clave super fuerte en plata y oro y es tener algo llamado liderazgo y fast-reaction...**\n_¿A que voy con esto?_\n1.- Por ejemplo en Top si le sacas una muerte a tu enemigo es buena idea pushearle y tirarle la torre rápido (si tienes un campeón con una buena limpieza y rapidez) o bien entrar con teleport a bot (suponiendo nivel 6) y forzar una pelea para ganar objetivos (dragón o torre de abajo).\n2.- Si vas de soporte con bastante CC (que es tu caso) intenta forzar a que tus compañeros hagan los objetivos, marcarles, da señales, sirven mucho, aveces la gente se queda mirando después de por ejemplo ganar un trade, una teamfight.\n3.- Siendo support tu Peel no es exclusivo para el adC, aceptemoslo aveces el adC es un cretino que no te hara caso ni aunque sea lo mas obvio, por ende si ves que por ejemplo el mid va super bien y hace las cosas como se debe protegelo después de la base de lineas. Iguales bueno hacer roaming a medio o a top inclusive (si tienes buena velocidad y mejoras la rotación).\n-----------------------------\nB.- **Recomendaciones personales.**\n1.- Si vas soporte es bueno que aprendas a jugar un support peeler también por ejemplo {{champion:40}}  es una buenísima opción, aunque también {{champion:267}} {{champion:16}}  son buenas para ese rol.\n(La cosa es que sepas tener a la mano un iniciador, un disingage, disruptivo, a la mano cada vez que a merite la ocasión y lo que haga falta en la composición).\n2.- Si vas en top, jugando con tanques exclusivamente los teleports son herramientas muy fuerte en esos personajes, bien utilizada te hace ganar, igualmente son 4 segundos aprox que debes calcular al lanzarte en bot o una tf en dragon por ejemplo. En Top por ejemplo {{champion:48}}  tienes eso que te suple todo... igual otro campeón que te recomendaría es {{champion:62}} (que es un iniciador fuerte resistencia y daño) o {{champion:39}} (gran duelista y capacidad rápida de limpieza) son fuertes y no requieren de gran cantidad de partidas para usarlos bien. (Irelia inclusive al perfeccionarla es poderosisima).\n3.- Un duo es util, pero puedes prescindir de él igual...\n4.- El uso de trinkets y desmantelar los wards es super importante o ponerlos, nunca te olvides de ese detalle!\n----------------------","replies":[]},{"poster":"KarmaUnder","date":"2017-01-11T18:56:15.241+0000","up_votes":7,"down_votes":2,"body":"Te armabas penetracion con taric ( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)\n\nLo que le digo a todos... juga top xD la linea mas facil y impacta demasiado ademas de ser facil :v\n\nmainea algo con linea fuerte y tenes free elo hasta platino  xD","replies":[]},{"poster":"Chase me","date":"2017-01-11T20:07:52.532+0000","up_votes":4,"down_votes":0,"body":"Yo soy main singed xD","replies":[]},{"poster":"Sagittarius Köga","date":"2017-01-12T16:56:17.002+0000","up_votes":3,"down_votes":0,"body":"si el post lo hacia alguien que no fuera rioter lo cagaban a negativos","replies":[]},{"poster":"Paluz","date":"2017-01-12T16:08:30.706+0000","up_votes":3,"down_votes":0,"body":"yo la solucion para salir de oro fue simple... dejar de ser OTP y pickear mi main contra viento y mareas {{champion:27}} , solo usarlo ocasionalmente para counterear y ganar facil\nlo mejor es especializarte en 2 o 3 mas q sirvan para muchas comp, x ej yo tmb uso tanks y suelo usar {{champion:33}} vs comp AD, {{champion:32}} vs comp AP y cuando los enemigos tienen poco cc saco a la bestia {{champion:11}} \ndespues de un gank siempre hay q pushear... las torres ganan las partidas > si el enemigo rota malk castigalo con mas torres, generalmente cuando tiras la primera torre y son 3 personas podes pushear hasta la 2da y reventarla muy rapido... eso genera muchisima ventaja en early","replies":[]},{"poster":"RodriiB","date":"2017-01-12T08:51:27.663+0000","up_votes":3,"down_votes":0,"body":"Vi que te dejaron consejos muy buenos de suport, no conozco demasiado el rol. Soy main top, y ahí podría ayudarte algo mas, ya que parece que es tu rol secundario. \n\nSi no me equnívoco top es el la línea que más tipos de campeones hay. Tenes Asesinos, Magos, Colosos, Duelistas, Tanques, Tiradores. \n\nCon 4/5 campeones podes tener muchisima versatíridad a la hora de elegir viendo tu equipo y el enemigo. Actualmente considero que lo mejor es: \n\nRumble: Un safepick poderosisimo, es bullylane por excelencia, es muy dificil que pierdas la linea, tiene un wave clear excelente, podes desgastar mucho a tus enemigos y mandarlos a base a cada rato, y una R espectacular, que podes poner tf a tu favor la mayoría de las veces. Además no se banea y se pickea poco. Otro buen safepick son jayce y kennen, se los puede jugar en la mayoría de las composiciones. Pero los jugué muy poco. \n\nIrelia o Fiora: Excelente 1 vs 1, buenos splitpushers, si sacas un poco de ventaja sos dios, es imposible que pierdas. Ambos aguantan muchísimo y tienen mucho daño. No son campeones muy difíciles de dominar. Su principal función en tf es tratar de ir en contra de los carrys. Son campeones muy buenos, y en el caso que te fue mal en linea, escalan mucho al late. Dependes muchísimo que tu equipo tenga un iniciador. Ambos son fuerte contra asesinos. \n\nPoppy/Trundle: Dos tanques buenísimos, que bien buildeados aguantan lo que no está escrito. Generalmente, recomendaría pickearlos cuando tu equipo hay campeones con poca movilidad, o el otro team tiene campeones con muchos gapcloser. muy buenos haciendo disengage, poppy con la e, w, r y trundle con el pilar. NO SON INICIADORES. No te metas de cabeza a empezar a pelear, al menos que la veas muy clara.\n\nNauti/Malphite: Cuando tu equipo tenga daño en area, estilo oriana, mf, amumu, estos aportan muchisimo. Tienen a mi parecer, junto con sejuani y quizás zac las iniciaciones más fuertes del juego. Tienen un solo problema, que necesitas que tu equipo haga el daño. \n \nEligiendo alguno de cada caracterisitica que te nombre, tenes campeones para jugar en top a la perfección. Además hay otros tantos que son buenos en casos muy especiales.\n\nGnar para jugar en contra de gangplank, o de los colosos. \n\nShen en caso que juegues en premade. La combinación con Hecarim es fantastica.\n\nTrynda y nasus en caso que tengas un equipo con buen wave clear estilo ziggs, velkoz, brand, viktor en mid y sivir, ezreal, varas en bot. Que sabes que son buenos defendiendo y asediando y puedas hacer splitpush. \n\nEspero que lo leas y te sirva de consejo, no se que mas explicarte, pero si tenes alguna duda pregunta.\n\nPd: No seas asqueroso y jugués Pantheon, y menos con ignite.","replies":[]},{"poster":"RSN SilverWolf","date":"2017-01-12T02:51:34.974+0000","up_votes":3,"down_votes":0,"body":"Hola Nebo, soy unranked (oro V en Ranked team), main support. Mi consejo es como support es tener dominio de un support de cada tipo, es decir:\n\n-Uno que se enfoca principalmente en proteger {{champion:40}} ,{{champion:117}}, {{champion:267}} , {{champion:16}} .\n\n-Uno tanque de iniciación/protector {{champion:201}}, {{champion:412}} , {{champion:12}} , {{champion:44}}, {{champion:223}}  .\n\n-Un support mago {{champion:37}} ,{{champion:26}}, {{champion:43}} , {{champion:25}}  no digo {{champion:143}} , {{champion:63}} , {{champion:161}} , ya que en mi opinión no tienen muchas habilidades de protección mas que un stun.\n\n-Un tanque iniciador {{champion:89}} ,{{champion:111}} ,{{champion:53}} .\n\n-Y el que a mi personalmente es uno de los mas completos {{champion:432}}, y explico mis razones, tiene una pasiva que incita a salir de tu linea, esto hace que tengas que rotar, para hacerlo hay que saber cuando y permite ayudar otras lineas mayormente mid, lo cual puede generar una ventaja en esa linea, esta misma pasiva tiene daño para hostigar la linea enemiga en trades cortos, las campanas dan buen sustain de maná. Tiene un stun, aunque situacional, es de 1 segundo a lvl 1, y sube hasta 1.8 segundos. La W da un sustain no tan bueno como otros supports, ya que necesita cargarse para curar bastante, pero es útil. La E es una buena habilidad para roamear, escapar, y habilitar gankeos. Y una de las razones por la que mas me gusta el personaje, es su ultimate ya que puede cambiar el curso de una pelea para bien o para mal, según como se utilice.\n\nLa idea es tener en dominio alguno de estos y utilizar cada uno dependiendo los equipos. Los que yo mas utilizo personalmente son {{champion:432}} , {{champion:53}} , {{champion:44}} , {{champion:412}} , {{champion:25}} y {{champion:201}}, ya que son los que mas se adaptan a mi forma de jugar.\n\n\nDespués de eso, aportar visión a tu equipo, si estas en ventaja en la jungla enemiga siempre es útil colocar un centinela de control, si estas en desventaja o un jungla enemigo agresivo que hace counterjungle al tuyo, ayudarlo con la visión. Tratar de tener un buen ambiente de juego, si alguien hace algo bien felicitarlo, si alguien hace algo mal, aconsejarlo y decirle \"no pasa nada\", otra cosa importante, si ves que tu ADC no aporta mucho al equipo y es inútil darle ánimo ayuda al que este dando su mayor esfuerzo de tu equipo, ya que si ayudas al que intenta ganar, habrá más posibilidades de hacerlo.\n\nLa build, casi todos son similares, lo primero es tratar de juntar poco mas de 800 de oro para comprarse la piedravidente, un centinela de control, cambiar la baratija amarilla a la roja algunas pociones si hacen falta y las botas,  luego mejorar el item de support, las botas y la baratija a lvl 9 , personalmente prefiero las mejoras básicas de los items de support ya que sus activas son bastante útiles, luego dos items que no pueden faltar ya que son buenos para aportar supervivencia al equipo son {{item:3190}} y {{item:3107}}, despues de esto sobra un espacio o dos si compraste la fusión de la piedravidente y el item de supp ({{item:2303}}  {{item:2301}}  {{item:2302}} )  es más situacional, puede ser un {{item:3143}} , {{item:3512}}, {{item:3174}} para un mago, {{item:3050}}, {{item:3110}} , {{item:3504}} , {{item:3109}} , etc.  Y una muy importante y tambien es una de las razones por la cual compro las mejoras básicas de supp es el {{item:2045}}  ya que la pasiva que tiene es muy buena la cual es 20% CDR en los activables, esta la mejoro casi siempre antes del ultimo item.\n\n\nLas runas y mastrias yo personalmente uso estas: \n\nEstas utilizo con los supports tanques.\n\nhttp://imgur.com/8etI1bR \n\nhttp://imgur.com/rgGLbZM\n\nEstas runas con los supports agresivos de AP y los Protectores \n\nhttp://imgur.com/7lGBwjs\n\nEstas maestrías con los supports Protectores. \n\nhttp://imgur.com/E49npaK\n\nY estas maestrías con los suppports agresivos.\n\nhttp://imgur.com/wobhVKo\n\n\nY en cuanto a linea secundaria te recomiendo:\n\n-En top a  {{champion:117}}  y {{champion:98}} \n\n-En Jg a {{champion:427}}  y {{champion:111}} \n\n-En mid a {{champion:43}}  y {{champion:117}} \n\nYa que estos campeones pueden \"supportear\" desde esos roles aportando diferentes cosas que de la linea de supp.\n\nEso es todo, si me acuerdo algo mas lo agrego como \"edit\"\n\nEspero que te sea de ayuda y un saludo.\n\n\n-------------------------------------------------------------------------------------\n\nEdit 1:  Hechizo de invocador.\n\n{{summoner:14}}  Para supports agresivos ya sean ap o tanques, contra linea enemiga \"débil\" al inicio (min 0-15),  para hacer snowball y aportar mas daño.\n\n{{summoner:3}}  Para cualquier support, aunque muchos crean que este es solo defensivo también es muy ofensivo ya que baja el daño, velocidad de ataque, y resistencias. Este es muy bueno cuando en el equipo enemigo hay campeones que son difíciles de parar facilmente ({{champion:92}}  {{champion:238}}  {{champion:157}} {{champion:67}}  {{champion:11}} {{champion:18}}, etc , básicamente asesinos o campeones con bastante movilidad y daño), esto ayuda a aplicarle mas CC, dar reacción al equipo, y bajarle el daño para que no elimine al que mas daño hace de tu equipo rápidamente.","replies":[]},{"poster":"DarksWaves","date":"2017-01-11T20:42:09.288+0000","up_votes":2,"down_votes":15,"body":"Hola soy de riot y no se jugar mi propio juego.\n\nNi platino .... XD ya esta, estos son los que crean el juego, despues se preguntan a quien se le ocurren los cambios.\n\n\nSalir de oro es facil, simplemente hace duo, farmea 15 minutos y mete toda la presion en una sola linea. si agarras jungla es facil, campeale top tanto que tenga que venir el mider asi tu mider va tirando torres. Baitea, se comen el facecheck como el pan, baitea baron, dragon, wardeo e invadi buffos, despues del inicio ya no wardean.","replies":[{"poster":"Riot Nebo","date":"2017-01-11T21:15:19.410+0000","up_votes":8,"down_votes":1,"body":"No es que no sepa jugar, de hecho todos los rioters juegan LoL.\nSino que no tengo suficiente habilidad para ser una liga mas alta, es algo normal. Eso se gana jugando, mejorando y practicando.\n\nY no trabajo en el equipo de desarrollo ni de gameplay, hago parte de la gran mayoría de jugadores que están en Bronce, Plata y oro. \n\n¿Con Jungla cual me recomiendas? Me siento cómodo jugando con Amumu, Sejuani y Warwick.","replies":[{"poster":"La corrupción","date":"2017-01-12T00:43:53.266+0000","up_votes":3,"down_votes":0,"body":"zac es más de lo mismo que esos, gragas se parece bastante, heca aunque no es lo más recomendable se le puede hacer una build más tanque de lo normal ({{item:3025}} en vez de {{item:3078}}) y también tendría un juego parecido a todos esos. Warwick rara vez te lo recomendaría pero sirve para lockear a un asesino rompe****","replies":[]}]}]},{"poster":"Locked ULIvE","date":"2017-01-11T23:42:06.328+0000","up_votes":3,"down_votes":0,"body":"El mejor consejo en mi humilde opinión es no flamear ni tiltearse :3","replies":[{"poster":"Sthask Vermillio","date":"2017-01-12T00:07:04.397+0000","up_votes":2,"down_votes":0,"body":"Perdone por la ignorancia, pero que es tiltearse? :v","replies":[{"poster":"Mioen","date":"2017-01-12T00:17:51.229+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Sthask Vermillio,realm=LAS,application-id=J8qpiO2I,discussion-id=fqAeqET0,comment-id=001c0000,timestamp=2017-01-12T00:07:04.397+0000)\n>\n> Perdone por la ignorancia, pero que es tiltearse? :v\n\nBloquearse, molestarse o madear lo suficiente como para no poder concentrace bien en el juego.","replies":[{"poster":"Sthask Vermillio","date":"2017-01-12T00:37:03.351+0000","up_votes":2,"down_votes":0,"body":"Gracias por iluminarme con tu sabiduria :v","replies":[{"poster":"Mioen","date":"2017-01-12T04:34:50.831+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sthask Vermillio,realm=LAS,application-id=J8qpiO2I,discussion-id=fqAeqET0,comment-id=001c000000000000,timestamp=2017-01-12T00:37:03.351+0000)\n>\n> Gracias por iluminarme con tu sabiduria :v\n\nNo hay problema, no es una expresion muy usada en esta region es mas de NA o EUW.\nMedianamente conoci la palabra por algunos videos en ingles.","replies":[]}]}]},{"poster":"Locked ULIvE","date":"2017-01-12T04:27:10.476+0000","up_votes":2,"down_votes":0,"body":"Significa fustrarte y no concentrarte en la partida, hacer malas iniciaciones o caiteo o calls","replies":[]}]}]},{"poster":"H3AR THIS MUSIC","date":"2017-01-11T21:24:34.370+0000","up_votes":3,"down_votes":0,"body":"la bot lane en estos momentos esta horrible... te recomiendo irte a mid o jungla ya que de ahí puedes carrear a tu equipo fácilmente.","replies":[]},{"poster":"MID Madness","date":"2017-01-11T19:52:02.518+0000","up_votes":4,"down_votes":1,"body":"En mi experiencia, oro es la liga donde esta la mayor cantidad de gente que entra a perder partidas a proposito (tanto por que no les gusta ser carreados o por que mueren una vez en linea y ya se van afk), es la liga mas frustrante que me ha tocado jugar por que todos quieren ser las divas del equipo y si no les sale algo ya tiran surrender o se van afk, lo importante no es el campeon que juegues sino la actitud que tengas, si te va mal en linea apoyate en tus compañeros, si te va bien rota o ejerce mucha presion en tu linea cosa que el equipo enemigo tenga que separarse y venir a por ti para que no les tires la base.\n\nComo digo, esto es mi experiencia, llegue hasta oro 1 la season pasada jugando casi puramente mid, y las veces que gane es por que salia bien en linea y mis compañeros se dejaban ayudar, pero me ha tocado con taaanta gente que no queria ganar rankeds o que yo los carree que baje hasta oro 5, en esa liga esta la peor gente sin ninguna duda.\n\nY seguro me van a decir \"no puedes culpar al resto por perder la partida\", pero lo que yo pase en oro no lo pase jamas en bronce ni en plata, incluso tenia varias capturas sacadas de rankeds donde la gente me decia textualmetne \"no quiero que me carrees, asi que prefiero perder\" o \"como voy mal la partida ya perdimos, no molesten queriendo recuperarse\" y asi...\n\nLo importante es la actitud!","replies":[{"poster":"Riot Nebo","date":"2017-01-11T20:17:52.110+0000","up_votes":3,"down_votes":0,"body":"Si, la actitud es super importante, casi siempre juego escribiendo y apoyando cuando hacen buenas jugadas, algunas veces casi no hablo para evitar saturar los canales. \n\nMe han tocado pocos AFK´s o trolls menos mal, casi siempre mis compañeros de equipo quieren salir de Oro y ayudan muchísimo XD","replies":[{"poster":"MID Madness","date":"2017-01-11T21:19:46.972+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Riot Nebo,realm=LAS,application-id=J8qpiO2I,discussion-id=fqAeqET0,comment-id=00110000,timestamp=2017-01-11T20:17:52.110+0000)\n>\n> Si, la actitud es super importante, casi siempre juego escribiendo y apoyando cuando hacen buenas jugadas, algunas veces casi no hablo para evitar saturar los canales. \n> \n> Me han tocado pocos AFK´s o trolls menos mal, casi siempre mis compañeros de equipo quieren salir de Oro y ayudan muchísimo XD\n\nTe recomiendo encarecidamente usar soportes de roamming muy fuerte {{champion:432}} {{champion:412}} {{champion:111}} , vas a ser la pesadilla de tu mid rival y podras sacar mucha ventaja moviendote por el mapa (en oro no son muchos los que se mueven en fase de lineas, usalo a tu favor)\n\ny tambien te recomiendo ir con ignite, ejercer mucha presion en la linea con este hechizo te permite hacer que tu carril enemigo juegue defensivo y aproveches para poner vision ofensiva o rotar al medio!","replies":[]}]}]},{"poster":"KingOfApples","date":"2017-01-11T19:42:19.931+0000","up_votes":3,"down_votes":0,"body":"si te consideras bueno de supp entonces buscate un duo adc que entienda como y cuando tradear, aunque sinceramente a mi no me gusta jugar bot ahora, el hecho de que siempre es la linea donde te caen los 5 facilmente, te tiran la torre y se van a mid a presionar, te recomendaria top y mid, jungla no tanto porque puedes darle toda la ventaja a una lane pero si el jugador es malo no sabra que hacer con ella, suerte","replies":[{"poster":"Riot Nebo","date":"2017-01-11T20:25:12.817+0000","up_votes":3,"down_votes":0,"body":"Estoy buscando Top como segunda linea, intente jugar Pantheon, peor me masacraron en linea. \n\n¿Que campeón recomiendas?","replies":[{"poster":"KingOfApples","date":"2017-01-11T20:37:06.886+0000","up_votes":2,"down_votes":0,"body":"ahora mismo camille esta demasiado rota, es free win, poppy es buenisima en 1v1 y en tf y maokai en late aguanta y resiste mucho, pero pickea eso considerando que deberas estar siempre ejerciendo presion en todas las lineas, ahora si quieres jugar a stompear al rival entonces prueba con gangplank, yasuo, riven, darius, jayce o renekton, personalmente yo juego gp con exhaust a lo Tobias Fate y sirve muchisimo, ademas que tu ulti con 45%cdr puedes cambiar la tf cada vez que se te antoje","replies":[]},{"poster":"Craaazy Diamond","date":"2017-01-11T20:33:25.211+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot Nebo,realm=LAS,application-id=J8qpiO2I,discussion-id=fqAeqET0,comment-id=000f0000,timestamp=2017-01-11T20:25:12.817+0000)\n>\n> Estoy buscando Top como segunda linea, intente jugar Pantheon, peor me masacraron en linea. \n> \n> ¿Que campeón recomiendas?\n\nActualmente en los juegos estan intentando cerrar pronto, alargar las partidas para los asesinos no es muy buena idea, por ende en la top line te recomendaria campeones tales como {{champion:58}}, {{champion:92}} (En algunos casos es necesaria jugarla con {{summoner:14}} , en ese caso debes estar atento a las rotaciones del top enemigo y intentar cortarla), {{champion:164}} (Aunque pase muy baneada), y tambien los clasicos iniciadores tales como {{champion:54}}, {{champion:57}}. Pero recuerda, siempre es mas importante que jueges con algo con lo que te sientas comodo **_El meta no es superado por el grado desarrollable por un campeon por el cual te gusta_** \n\nSaludos cordiales \n{{sticker:slayer-jinx-catface}}","replies":[]}]}]},{"poster":"Numerítos","date":"2017-01-11T20:40:18.949+0000","up_votes":4,"down_votes":1,"body":"te admiro, no te puedo traer consejos (Solo soy plata V y creo que podria descender) pero si te doy todo mi apoyo  y que tengas exito","replies":[]},{"poster":"Hada de Azucar","date":"2017-01-12T03:28:32.603+0000","up_votes":2,"down_votes":0,"body":"No sé, yo jugué con un tal Riot Force, bastante manquito, lo llené de curas con mi Soraka master race, pero el tipo no cazaba una y llegó a decir \"Surrender@20\" :(","replies":[{"poster":"Force2018","date":"2017-01-12T23:07:04.785+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Uxiop,realm=LAS,application-id=J8qpiO2I,discussion-id=fqAeqET0,comment-id=002b,timestamp=2017-01-12T03:28:32.603+0000)\n>\n> No sé, yo jugué con un tal Riot Force, bastante manquito, lo llené de curas con mi Soraka master race, pero el tipo no cazaba una y llegó a decir &quot;Surrender@20&quot; :(\n\n{{champion:32}}","replies":[]}]},{"poster":"Emix ","date":"2017-01-12T01:27:39.997+0000","up_votes":2,"down_votes":0,"body":"Mira te dejo estos consejos de acuerdo a la línea que vayas, te vendrá bien en ese elo ya que hay muchas personas que prefieren las kills antes que objetivos;\nSi sos top mid adc: ponte a hacer split push cuando veas el momento correcto, si farmeas bastante luego contribuiras bastante en las TF. O si estompeas tu lane y estas feed trata de estompear la partida ayudando a las demas lineas los enemigos generalmente al ver que el de su team te fedeo y luego vos los estas stompenado van a enojarse con el y lo empezaron a flamear o a generar un mal ambiente para el y mas aun si no manda mias. Y eso sera una gran ventaja para tu team.\nJg: En early ayuda las lineas cosa de que si los ayudas con un par de kills y ellos van por las kills luego tienen mas posibilidades de ganar el trade. Luego en midgame si ves que se complica farmea jg y trata de hacer objetivos(splt push, dragones). Te recomendaria un portal Zz riot en caso de no ser asesino. En lategame trata de robar baron, dragones y buena suerte en las tf trata de defender al mas feed en caso de que no seas asesino, si lo sos busca al mas feed de ellos y trata de bajarlo si no puedes bueno no armen tf. Directamente trata de buscar a alguno mal posicionado.\nSup: En midgame Portal Zz colocarlo donde veas que la linea no sea muy visitada por el enemigo y cuando queiras acordar estara push uno de ellos ira a defender y ahi busquen pushear los 5 o armar tf. Mientras tanto sigue a tu adc, si este esta jugando mal, es decir, se regala de gusto. Sigue al que le veas pinta de ser bueno y tenga posibilidades de carrear. PD: la rendicion te ayudara bastante en tf te la recomiendo.\nOtra cosa que es muy importante en todas las posiciones: PONE WARDS Y TEN VISIÓN ANTES DE REALIZAR LA ACCIÓN QUE DESEAS REALIZAR. Y MANTEN LA COMUNICACIÓN CON TU EQUIPO GENERALMENTE HAY ALGUNO DE TU TEAM QUE TIENE CABEZA Y TE PUEDE AYUDAR.\nEspero que te sirva y mucha suerte, cualquier cosa agregame y trato de ayudarte con consejos, seguramente me olvido muchas cosas pero no tengo tiempo para redactar tanto je :D","replies":[{"poster":"Riot Nebo","date":"2017-01-12T22:13:29.522+0000","up_votes":2,"down_votes":0,"body":"¡Mañana en la noche voy a jugar! Te agregué para que juguemos, las de Flex aun no las juego.\n\n \n> Sigue al que le veas pinta de ser bueno y tenga posibilidades de carrear. \n\nEste consejo me lo dan muy a menudo.","replies":[]}]},{"poster":"IISeraphII","date":"2017-01-12T14:35:22.032+0000","up_votes":1,"down_votes":0,"body":"Juga jungla {{summoner:11}} , yo en la season 5 de oro 5 a oro 2 subí jugando solo jungla. Después de oro 2 a platino 5 subí jugando support con lulu y soraka. Unos picks que te recomiendo para la jungla {{champion:32}}  {{champion:120}}  {{champion:254}} {{champion:121}} {{champion:79}}  {{champion:59}} {{champion:56}} {{champion:5}}. A {{champion:121}}  te lo recomiendo cuando ganes un poco más de experiencia en este posición. Y una cosa más... acostúmbrate al flameo de los laners :' v","replies":[{"poster":"Riot Nebo","date":"2017-01-12T22:06:32.252+0000","up_votes":2,"down_votes":0,"body":"Jungleaba mucho con {{champion:5}}  hace un año largo, {{champion:254}}  también la jugué bastante en su época.\nCreo que voy a volver a usarlos.\n\n¿Builds recomendadas para estos dos?","replies":[]}]},{"poster":"Elyasviel","date":"2017-01-12T03:13:05.309+0000","up_votes":2,"down_votes":0,"body":"Holaa, buenas noches Nebito. Yo llegue a duuras penas en oro 5, quede en plata 1 y de ahi subi hasta donde estoy ahora. Tengo los siguientes consejos si es que vas a jugar supp :o \nLo mejor seria encontrar un duo adc en el que confies, yo subi a oro 5 con un supp amigo :)\nVer videos ayuda no se si siendo rioter se te escapa algo (?\nMi mejor consejo seria usar muchas veces el mismo champ y sentirte super confiado con el, como un blitz que no se equivoca con las q, o una zyra que siempre va a hacer mas daño que el adc :D, jugar muchas rankeds y aprender de eso xD\n\nSry si no tengo consejos que te cambien de una a diamante pero es lo que me ayudo a subir un poquito :) \nSoy adc, cualquier cosa podemos jugar alguna vez, avisame ;)\nSuerte en tus rankeds!","replies":[]},{"poster":"Ahrmadyl","date":"2017-01-12T00:18:35.321+0000","up_votes":2,"down_votes":0,"body":"Hola, lei lo que te comento Neros II, y tiene razón. Si jugás soporte, los items MANDATORIOS serían {{item:3107}}  y {{item:3190}} . Después de eso, varía con el soporte que juegues. La {{item:3068}} no es buen item de support porque tu rol es proteger al ADC, no ir al medio de la Team Fight, entonces no logras poner en uso lo bueno que tiene ese item, que es la pasiva.\nPero lo que principalmente te sube de categoria, son las decisiones. Si vos sos Faker en las mecánicas pero matas a todo el team enemigo y volves a base, tus partidas van a ser un 50%/50% de ver quien gana la ultima team fight. Eso se aprende con el tiempo, y no haciendo siempre lo mismo. Yo cuando era entre Silver II y Oro IV, no consideraba el Baron Nashor antes del minuto 30'. Ahora apenas sale ya estoy atento a fijarnos cuando lo podemos sacar, sea matando al team enemigo, haciendolo sin que ellos se enteren, o matando a los suficientes como para que no puedan disputarlo ni robarlo.\nEs eso, todo lo que esté debajo de Diamond III, gana unicamente el que controle mejor el mapa, podes ganar definitivamente con Taric top, con cualquier cantidad de \"picks trolls\". \nSi queres agregame y jugamos, ~~asi me hago el piola con mis amigos de que tengo un amigo Rioter~~ yo tambien quiero mejorar en mi toma de decisiones.\nSaludos!{{champion:112}}","replies":[]},{"poster":"Aıejandro","date":"2017-01-11T21:23:19.249+0000","up_votes":2,"down_votes":0,"body":"Te recomiendo a {{champion:16}} {{champion:16}} ,tengo un winrate de 100% de solo 5 partidas que Jugue,POR EL PODER DE LAS BANANAS!!!","replies":[]}]}