{"poster":"BatsuX","date":"2015-02-25T10:14:59.031+0000","title":"Veigar, First Ban/Pick agli LCS, un Nerf ci voleva.","subforum":"Discussioni generali","up_votes":2,"down_votes":3,"body":"Ho provato il nuovo Veigar ed effettivamente non è poi così male:\n\nLa Q ora per farla come si deve (e magari beccare due target) devi andare in faccia al farm ed esporti a qualsiasi trade che, in early, Veigar perde per forza. Non sei più libero di colpire il siege minnion in mezzo allo schieramento. In teamfight non puoi lanciarla su qualunque carry se hanno davanti support e tank (inoltre ora è pure dodgabile). Inoltre, costa sempre 80, almeno prima era safe da spammare, se la lanciavi non potevi fallire. Ottimo lavoro sulla Q.\n\nLa dark matter costa meno ed ha un cd minore, ragazzi che buff, assurdo...la skill che si uppa per ultima e che viene usata solo ed esclusivamente con la gabbia, perché altrimenti è totalente inutile. 0.75 delay sullo stun, 1.25 sulla gabbia, o béh, sono solo 2 secondi alla fine...e come giocare con ping a 500, ma dopotutto la RIOT ha già provveduto ad allenarci per questo. CD e mana reduction, siete matti a buffare così la W di Veigar?!\n\nE qui, standing ovation, sembrava avessero fatto un lavoro approssimativo, ma invece si sono impegnati per rendere questa skill inutile al 100%. Costa sempre qualcosa come 1/4 del mana totale, il cd è stato ridotto di 2 secondi circa...ma almeno ora è evitabile da qualunque champion con un minimo di mobility (Zed, Talon, Katarina, Caitlyn, Vayne, Kallista, Graves, Jarvan, Vi, Fizz...), qualunque champ che abbia attiva la summoner flash e, nientepopodimeno, qualunque champ che possa camminare...perché, capolavoro dei capolavori, ora un alone circolare annuncia dove comparirà la gabbia, ed uno si può semplicemente fermare in mezzo e spaccarti il culo senza battere ciglio. OMMMIODDDIO, IL PREMIO NOBBILE, SUBITO!!!\n\nConcludiamo la combo mortale con la ultimate, chissenefrega della gabbia no? Tanto Veigar può contare su un burst impressionante. O forse dovrei dire poteva? Perché con la riduzione dello scaling ap e la rimozione del deathfire, dov'è il burst ora?.\nVeigar, ora come ora, non può più stunnare, non può più bersagliarti sicuro con la Q, con la dark matter centra solo i minions, han ridotto lo scaling ap sulla ulti e niente più deathfire per amplificare i danni (che ormai non è neanche più detto che faccia)...\n\nVeigar first ban/pick agli lcs, ci voleva proprio questo Nerf. \nE pensare che la scusa di questo aborto è stata la scomparsa del Deathfire, ma lasciarlo com'era invece di ridicolizzare un campione già pieno di punti deboli? Grazie RITO.\n\nP.S.:\nProvate a fermare Talon, Zed, Katarina ed Akali ora...o a killare un adc come Lucian, Graves o addirittura Sivir...una lane contro Annie, perché no? Tanto lei ~~NON~~ ha una q a target ed uno stun istantaneo ad area con la ulti, giusto?. Una lane contro qualsiasi campione? Range ridicolo, costi di mana che rimangono assurdi, fragilità (vita base seconda in pochezza solo ad Anivia), no mobility e neanche nessuna difesa ora...forse si riesce a fare una lane contro Mordekaiser, ma con la riduzione del burst dubito che si possa anche solo andare oltre lo scudo.","replies":[{"poster":"Ryuk1980","date":"2015-02-25T11:47:11.660+0000","up_votes":1,"down_votes":0,"body":"nuovo veigar? ma dove? sul pbe?","replies":[{"poster":"Frattaglia","date":"2015-02-25T11:54:11.531+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ryuk1980,realm=EUW,application-id=MJVj50Jw,discussion-id=f0QxEFGj,comment-id=0001,timestamp=2015-02-25T11:47:11.660+0000)\n>\n> nuovo veigar? ma dove? sul pbe?\n\nLeggi le note patch.","replies":[]}]},{"poster":"vegetable61","date":"2015-02-25T11:47:05.216+0000","up_votes":2,"down_votes":5,"body":"Uuuuuuuh che goduria vedervi rosicare per il nerf a veigar!! Pensavo che non si potesse superare il livello raggiunto con l'abolizione del death fire grasp, ma mi devo ricredere. Più vi incazzate e più mi fate godere","replies":[{"poster":"Ryuk1980","date":"2015-02-26T10:31:32.051+0000","up_votes":1,"down_votes":1,"body":"Ma quale nerf....Ieri ero curioso di provarlo per capire un po. Altro che nerf, perchè è più forte così. L'unica rottura è il ritardo della E, ma basta un po di pratica e cambia poco. La Q ha un range più lungo e adesso puoi shottare 2 minion con una Q, questo significa il doppio del bonus. Praticamente è diventato una sorta di nasus mage non tankoso. Quando già in early game (intendo i primi 12 minuti) hai +80/100 AP, dimmi un po se non hai un gran vantaggio rispetto all'avversario, che per fare un item da 80 AP spende un bel po di gold.\nA questo punto, secondo me, come secondo item conviene fare il \"bastone del vuoto\" che da magic penetration e shotti chi vuoi.","replies":[]}]}]}