{"poster":"SirDekan","date":"2017-03-23T14:48:45.943+0000","title":"Losing streak","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":2,"body":"Hey Leute, \r\nIch hoffe es k&ouml;nnt mir irgendwie helfen, ich habe eine richtig harte losing streak derzeit. \r\nNun it die frage was tun ? ich bin echt an verzweifeln habe, mehrere tage einfach nicht mehr gespielt, habe auf mein smurf gespielt und habe wieder auf mein main gewchselt und bin immer nich in dieser losing streak. \r\nBrauche hilfe denn es bl&ouml;d die ganze zeit zu verlieren und verliere auch langsam die lust am spielen.","replies":[{"poster":"Revilous","date":"2017-03-24T00:16:06.747+0000","up_votes":2,"down_votes":0,"body":"Hey es gibt eine ganz einfache Lösung. Spiel einfach weiter ohne darüber nachzudenken. Spätestens wenn du nach Diamond 5 abgestiegen bist solltest du anfangen nicht nur das Gegnerteam zu stompen sondern auch dein Team. Dann werden die Gegner dich sogar bitten, der Gewalt und Unterdrückung ein Ende zu bereiten und das Spiel endlich zu beenden. Das gibt dir dann so ein gutes Gefühl, dass du erstmal auf den Winstreak deines Lebens gehst.\n\nSo war es zumindest bei mir.","replies":[]},{"poster":"Shacoláde","date":"2017-03-23T15:55:50.666+0000","up_votes":2,"down_votes":0,"body":"Am ehersten gewinnst du wenn du nicht um jeden Preis gewinnen musst.\nKlingt zwar blöd... aber man versteift dann ingame und hat Angst fehler zu machen.\nVergiss nicht... es ist nur ein game... da geht die Welt nicht unter egal ob man verliert oder gewinnt.\nSolche Phase hatte jeder mal, also mach dir keine Sorgen ;)\n\nEine Anmerkung zum Gameplay habe ich trotzdem:\nDu stirbst etwa alle 3min 1x.  (33min 10-11 Tode).\nDementsprechend ist dein Farm auch nicht besonderlich gut, vorallem als ADC.\nMehr farmen... weniger sterben, dann läufts auch ^^","replies":[]},{"poster":"RAG Ryve","date":"2017-03-23T18:43:30.485+0000","up_votes":1,"down_votes":0,"body":"Vlt ist es keine gute Idee auf einem Smurf zu spielen wenn dein Main noch nicht sonderlich weit oben ist.^^\nBleib auf deinem Main Acc, übe fleißig und verbessere alles woran es noch etwas hapert.","replies":[]}]}