{"poster":"P R O Void Omen","date":"2019-02-19T12:12:45.996+0000","title":"Dubbi esistenziali","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Sono quasi una settimana e mezzo che non riesco a vincere ranked, né in solo né in flex con i miei compagni di team ( non siamo fortissimi, ci aggiriamo intorno al silver alto gold basso, anche se la scorsa season sono arrivato a G1 gli ultimi giorni ^^). Mi hanno piazzato S2 e ok, ci sta, credo, ma il mio win rate è totalmente andato a puttane, la scorsa season avevo un 52/53% su un bel po' di game ( 2000 circa, credo) adesso arrivo malapena a 35%, la scorsa season ho totalizzato un winrate del 70% circa su kayn in  un centinaio di game, questa season non riesco a usarlo, così come tutti i miei Champ migliori (Aatrox, Yas, Kayn, Kindred, Swain e Jhin) fanno pena, o per qualche motivo non riesco più ad usarli correttamente, di conseguenza non riesco più a carryare i game da solo, e come se non bastasse spesso mi trovo in squadra con gente che gioca da poco, è molto tossica, o che fa pessime giocate. Non so cosa fare, devo continuare a insistere sui miei main o devo farmene degli altri?","replies":[{"poster":"Alkinesio","date":"2019-03-20T14:00:17.803+0000","up_votes":2,"down_votes":0,"body":"Ti parla un main Kayn, dopo l'inizio della season nemmeno sono riuscito più a giocarlo nonostante un win rate del 60% (Silver elo ahimè, ma da pochi mesi ho iniziato a rankare dopo anni di gioco). Così ho giocato ovunque e mi sono trovato incredibilmente bene come supporto carriando ogni ranked facendo feedare ogni adc (se è scarso andate full danno con morgana per esempio) o giocate con un buon amico adc.\n\nÈ stato incredibile che sulla bot lane l'aggressività che ho usato ha portato oltre a un 80-90% win rate (aiutando il resto del team dopo la prima torre). Ovviamente chi mi guarda il win rate attuale magari ha dei dubbi al riguardo, ma ho applicato tale strategia da una ventina di game fa. Giocate con qualcuno che ritenete simpatico e abbia passione del gioco.\n\n{{summoner:13}}  Grazie per l'attenzione gente :P","replies":[{"poster":"Ridchard","date":"2019-09-16T20:03:17.221+0000","up_votes":1,"down_votes":0,"body":"{{sticker:vlad-salute}}","replies":[]}]},{"poster":"Triplestarsystem","date":"2019-02-19T19:13:18.534+0000","up_votes":1,"down_votes":0,"body":"Essendo dello stesso identico elo, ti posso chiedere l'amicizia? Magari giocando qualche game possiamo capire assieme a cosa è dovuto questo losing streak. \nConsidera che il losing streak estremo può capitare a tutti e che passa con il tempo. Lo scoraggiamento è normale. Purtroppo se non sei al top i compagni tendono a fartelo pesare in game.\n\nAvendo un milione di punti su Sona non ti dico che aspettative hanno nei miei confronti, come se giocare tanto un campione ti faccia diventare master. Perciò o gioco alla perfezione, altrimenti bastano 2 ulti mancate e mi flammano subito e mi auto flammo pure.","replies":[]},{"poster":"The Fluffy Lamb","date":"2019-02-19T12:17:18.560+0000","up_votes":1,"down_votes":0,"body":"Parlo per kindred.\n\nTi assicuro, che col cambio degli crit items non è minimamente peggiorato. Anzi","replies":[{"poster":"P R O Void Omen","date":"2019-02-19T12:53:15.479+0000","up_votes":1,"down_votes":0,"body":"Gli unici ad essere peggiorati sono jhin e aatrox, gli altri non riesco più ad usarli {{item:3070}}","replies":[]}]},{"poster":"The Fluffy Lamb","date":"2019-02-19T12:26:42.359+0000","up_votes":1,"down_votes":0,"body":"Anyway mi sta sucedendo la stessa cosa con gli adc.\n\nIO che ho al 7 : jinx xayah vayne ashe e tristana non riesco a stare in bot. I game che ho giocato normalmente si contano su una mano","replies":[]}]}