{"poster":"P R O Void Omen","date":"2016-09-12T18:00:39.437+0000","title":"Aiuto per un povero bronzo : /","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Salve, ok cercher&ograve; di essere breve: perdo. Perdo sempre. Uso i miei Main e perdo. Uso campioni sgravi e perdo. Faccio 20/5/16 prendo 6 torri da solo 3 inib 2 Baron e 3 draghi e perdo.vinciamo 7 team fight su 9 eppure quegli ultimi due gli sono sufficienti per fare un ace e vincere, sono feeddato eppure la Bot nemica &egrave; cos&igrave; avanti che l&#039; adc si tanka il Baron. So di essere in bronzo, &egrave; di non essere fortissimo ( anche se potrei sostenere un fight con gold 3/4 ) ma dico: teemo jungler? Pantheon adc? G adc? Ma davvero? Cerco campioni nuovi da mainare, perch&eacute; ora come ora vinco solo con kha&#039; zix, il punto &egrave; che &egrave; piuttosto macchinoso e alle lunghe annoia. Potete consigliarmi?","replies":[{"poster":"Dalbo89","date":"2016-09-13T10:50:42.983+0000","up_votes":3,"down_votes":0,"body":"Guarda, io sono bronzo 5 come te quindi, da un lato posso unirmi al tuo sgomento, dall'altro posso confermare alcune cose che sono state dette. La settimana scorsa, vedendomi costretto più volte dall'autofiller a giocare supporto, mi sono comprato un bel campione specifico per il ruolo - Lulu - (prima giocavo Poppy con esiti non molto felici) e ho cominciato a vincerle tutte - ma proprio tutte - fino a salire fino a metà bronzo 4 dove, inspiegabilmente, ho ricominciato a perdere. Chiaro che in ciò sta un po' la fortuna di non avere in squadra troll, o gente che prova un nuovo campione per la prima volta in ranked (non sai quanti negli ultimi giorni). Generalmente penso tuttavia che l'equazione \"meno morti = più vittorie\" sia valida, di fatto, con lulu sono morto pochissimo, preferendo andarmene quando i compagni facevano una stronzata - a rischio di beccarmi il classico flame \"nice help\" - piuttosto che regalare agli avversari una kill ulteriore. Molti campioni si trasformano quando cominciano ad avere i loro oggetti essenziali e, per quante kill tu possa aver fatto, feedare loro significa, a un certo punto, cominciare a subire quegli ace di cui parli, apparentemente inspiegabili, con 10/15 kill di vantaggio della squadra che, spesso, tra l'altro, comincia a sentirsi forte in virtù di un vantaggio che non c'è e che può essere disintegrato in un paio di teamfight, prendendo azzardi che non dovrebbe. \n\nPersonalmente quando subisco un assalto di 3/4 persone, sono solo e ho la certezza di morire nell'assurdo tentativo di difendere una torre che cadrà comunque, la abbandono - se ho certezza di riuscirci; solo in caso contrario (elevata velocità o CC nemico) rimango e cerco la kill. Prima ovviamente pingo, sperando in un intervento ma, se non vedo movimento alleato sulla mappa, faccio presto a voltarmi, magari sfoltendo prima i minion, nel tentativo di dissuadere la squadra nemica da un assalto. Stessa cosa, se sto difendendo, siamo a vita bassa, e gli avversari si fanno avanti minacciosi me ne frego dell'eventuale \"don't touch my farm\" e disintegro quanti più minion nel minor tempo possibile.\n\nI giocatori più esperti mi correggano se ho detto delle stronzate.","replies":[{"poster":"P R O Void Omen","date":"2016-09-13T17:26:57.961+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dalbo89,realm=EUW,application-id=MJVj50Jw,discussion-id=NkRNmgWq,comment-id=0006,timestamp=2016-09-13T10:50:42.983+0000)\n>\n> Guarda, io sono bronzo 5 come te quindi, da un lato posso unirmi al tuo sgomento, dall&#x27;altro posso confermare alcune cose che sono state dette. La settimana scorsa, vedendomi costretto più volte dall&#x27;autofiller a giocare supporto, mi sono comprato un bel campione specifico per il ruolo - Lulu - (prima giocavo Poppy con esiti non molto felici) e ho cominciato a vincerle tutte - ma proprio tutte - fino a salire fino a metà bronzo 4 dove, inspiegabilmente, ho ricominciato a perdere. Chiaro che in ciò sta un po&#x27; la fortuna di non avere in squadra troll, o gente che prova un nuovo campione per la prima volta in ranked (non sai quanti negli ultimi giorni). Generalmente penso tuttavia che l&#x27;equazione &quot;meno morti = più vittorie&quot; sia valida, di fatto, con lulu sono morto pochissimo, preferendo andarmene quando i compagni facevano una stronzata - a rischio di beccarmi il classico flame &quot;nice help&quot; - piuttosto che regalare agli avversari una kill ulteriore. Molti campioni si trasformano quando cominciano ad avere i loro oggetti essenziali e, per quante kill tu possa aver fatto, feedare loro significa, a un certo punto, cominciare a subire quegli ace di cui parli, apparentemente inspiegabili, con 10/15 kill di vantaggio della squadra che, spesso, tra l&#x27;altro, comincia a sentirsi forte in virtù di un vantaggio che non c&#x27;è e che può essere disintegrato in un paio di teamfight, prendendo azzardi che non dovrebbe. \n> \n> Personalmente quando subisco un assalto di 3/4 persone, sono solo e ho la certezza di morire nell&#x27;assurdo tentativo di difendere una torre che cadrà comunque, la abbandono - se ho certezza di riuscirci; solo in caso contrario (elevata velocità o CC nemico) rimango e cerco la kill. Prima ovviamente pingo, sperando in un intervento ma, se non vedo movimento alleato sulla mappa, faccio presto a voltarmi, magari sfoltendo prima i minion, nel tentativo di dissuadere la squadra nemica da un assalto. Stessa cosa, se sto difendendo, siamo a vita bassa, e gli avversari si fanno avanti minacciosi me ne frego dell&#x27;eventuale &quot;don&#x27;t touch my farm&quot; e disintegro quanti più minion nel minor tempo possibile.\n> \n> I giocatori più esperti mi correggano se ho detto delle stronzate.\n\nNono nessuna stronzata. Anche io faccio così. Di solito però trovandomi sempre ad affrontare smurf  ( che secondo me non dovrebbero esistere perché limitano la possibilità di vittoria dei ranghi più bassi soltanto perché si vuole ricominciare da capo a rankare, e non mi sembra giusto, ad esempio per le persone come me che hanno più di 300 game in bronzo ) stavo dicendo: gli smurf sanno come evitare che io scappi e spesso mi circondano tutti insieme. Poi ovvio se vengono tutti dalla stessa direzione scappo si xD","replies":[]},{"poster":"Frattaglia","date":"2016-09-13T11:03:08.288+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dalbo89,realm=EUW,application-id=MJVj50Jw,discussion-id=NkRNmgWq,comment-id=0006,timestamp=2016-09-13T10:50:42.983+0000)\n>\n> Guarda, io sono bronzo 5 come te quindi, da un lato posso unirmi al tuo sgomento, dall&#x27;altro posso confermare alcune cose che sono state dette. La settimana scorsa, vedendomi costretto più volte dall&#x27;autofiller a giocare supporto, mi sono comprato un bel campione specifico per il ruolo - Lulu - (prima giocavo Poppy con esiti non molto felici) e ho cominciato a vincerle tutte - ma proprio tutte - fino a salire fino a metà bronzo 4 dove, inspiegabilmente, ho ricominciato a perdere. Chiaro che in ciò sta un po&#x27; la fortuna di non avere in squadra troll, o gente che prova un nuovo campione per la prima volta in ranked (non sai quanti negli ultimi giorni). Generalmente penso tuttavia che l&#x27;equazione &quot;meno morti = più vittorie&quot; sia valida, di fatto, con lulu sono morto pochissimo, preferendo andarmene quando i compagni facevano una stronzata - a rischio di beccarmi il classico flame &quot;nice help&quot; - piuttosto che regalare agli avversari una kill ulteriore. Molti campioni si trasformano quando cominciano ad avere i loro oggetti essenziali e, per quante kill tu possa aver fatto, feedare loro significa, a un certo punto, cominciare a subire quegli ace di cui parli, apparentemente inspiegabili, con 10/15 kill di vantaggio della squadra che, spesso, tra l&#x27;altro, comincia a sentirsi forte in virtù di un vantaggio che non c&#x27;è e che può essere disintegrato in un paio di teamfight, prendendo azzardi che non dovrebbe. \n> \n> Personalmente quando subisco un assalto di 3/4 persone, sono solo e ho la certezza di morire nell&#x27;assurdo tentativo di difendere una torre che cadrà comunque, la abbandono - se ho certezza di riuscirci; solo in caso contrario (elevata velocità o CC nemico) rimango e cerco la kill. Prima ovviamente pingo, sperando in un intervento ma, se non vedo movimento alleato sulla mappa, faccio presto a voltarmi, magari sfoltendo prima i minion, nel tentativo di dissuadere la squadra nemica da un assalto. Stessa cosa, se sto difendendo, siamo a vita bassa, e gli avversari si fanno avanti minacciosi me ne frego dell&#x27;eventuale &quot;don&#x27;t touch my farm&quot; e disintegro quanti più minion nel minor tempo possibile.\n> \n> I giocatori più esperti mi correggano se ho detto delle stronzate.\n\nNo, mi sembrano tutti ottimi consigli.\nL'unica cosa che aggiungerei è, se decidi di non seguire i tuoi compagni suicidi, di pingare anche ritirata in modo che capiscano che non li seguirai e abbiano meno scuse per lamentarsi. :)","replies":[]}]},{"poster":"P R O Void Omen","date":"2016-09-12T19:46:37.332+0000","up_votes":1,"down_votes":0,"body":"Grazie per il consiglio... ma io prova a non morire, il punto è che spesso mi vengono sempre a fightare 2 o 3 vs 1 e poi mi divano e muoio. Vorrei improvvisamente diventare platino, così almeno i jungler sanno dove gankare e quando gankare... no sta gente che gankare a caso senza pingare e stealla il farm.","replies":[{"poster":"Dr LouD","date":"2016-09-13T08:21:13.704+0000","up_votes":2,"down_votes":1,"body":"Beh ma se ti divano e ti uccidono allora vuol dire che un jungler che sa gankare nel tuo elo c'è","replies":[{"poster":"Seamus83","date":"2016-09-14T16:47:33.973+0000","up_votes":2,"down_votes":0,"body":"se ti divano e ti uccidono vuol dire che non eri abbastanza lontano ! se puoi difendere la tower fallo se non puoi lasciagliela , meglio torre+kill o solo torre?","replies":[]}]},{"poster":"Łinkimaru","date":"2016-09-12T23:49:51.640+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Adreus01,realm=EUW,application-id=MJVj50Jw,discussion-id=NkRNmgWq,comment-id=0001,timestamp=2016-09-12T19:46:37.332+0000)\n>\n> Grazie per il consiglio... ma io prova a non morire, il punto è che spesso mi vengono sempre a fightare 2 o 3 vs 1 e poi mi divano e muoio. Vorrei improvvisamente diventare platino, così almeno i jungler sanno dove gankare e quando gankare... no sta gente che gankare a caso senza pingare e stealla il Farm.\n\nSeeee nei sogni a platino i jungler sanno dove gankare e quando gankare Ahaha beata ignoranza ;) platino è peggio del bronzo","replies":[{"poster":"Ardens33","date":"2016-09-13T21:15:35.091+0000","up_votes":1,"down_votes":0,"body":"silver elo più bello!","replies":[]}]},{"poster":"furry72","date":"2016-09-13T07:59:59.298+0000","up_votes":1,"down_votes":0,"body":"ancora non avete capito che le persone che giocano con i piedi ci sono anche a challenger  {{item:3070}}","replies":[]},{"poster":"EmiLapsus","date":"2016-09-13T07:42:30.022+0000","up_votes":1,"down_votes":0,"body":"Allora, i dive 3v1 sono spesso prevedibili, quindi puoi semplicemente andare back e lasciare la torre, tanto la prenderebbero lo stesso. In alcuni casi il dive si può counterare, con l'aiuto del jungler se è presente o di ulti globali come quella di gp, tf o shen.\nPer quanto riguarda i gank non pingati è un grave errore anche tuo, devi avere sempre congnizione di quello che ti sta succedendo attorno, i ping aiutano, spesso per indicare QUANDO ingaggiare per il gank, ma dovresti essere in grado da solo di accorgerti dell'arrivo del tuo jungler tramite la minimap.\nSe poi vuoi un vero consiglio per salire di elo è: gioca mid o al massimo jungle, sono i ruoli da cui carriare meglio. Se snowballi in mid puoi far feedare anche i tuoi compagni roammando.\nSe invece giochi top il mio consiglio è di usare un champ come gp, con altissima possibilità di carry, e con un ulti che ti permette di splitpushare forndendo comunque un aiuto non indifferente al tuo team, di contro però devi sapere che è un champ prettamente da lategame quindi molto molto fragile in early, anche in seguito ai nerf alla w e agli hp di base","replies":[]}]},{"poster":"P R O Void Omen","date":"2016-09-13T17:32:48.199+0000","up_votes":2,"down_votes":0,"body":"Ah, volevo dirvi che grazie ai vostri consigli sto diventando veramente bravo con kha. Oggi ho vinto tutte le parti giocate con lui, tranne 2 remake e quella dove mi si è disconnesso il modem. Quel fottuto operatore mi ha fatto perdere qualcosa come 30/35 game. Oggi in particolare ho fatto un Bal game intorno alle 12, chi è interessato per vedere qual' è la mia situazione ( e so che ci sono perché in questa community ci sono si molti flammers ma anche molte persone disposte ad aiutare il prossimo come possono ) può andare a vedere","replies":[]},{"poster":"Frattaglia","date":"2016-09-13T08:07:45.722+0000","up_votes":2,"down_votes":0,"body":"Per me si può partire analizzando i tuoi replay.\nRegistrati su www.replay.gg , poi fatti qualche partita. Quando te ne capita una che non sia stravinta (è inutile guardarla) o strapersa al punto che surrendate al 20 te la rivedi e cerchi di capire come potevi fare meglio.\n\nSe vuoi ti dò la disponibilità per fare l'analisi di un replay (di più no perché non ho molto tempo libero).\n\nPer ora posso dirti che:\n- giochi troppi ruoli, praticamente li giochi tutti. Scegli due ruoli da giocare in ranked e gioca solo quelli, in normal gioca quelli che ti pare\n- giochi troppi campioni, mi sembra che a volte li provi direttamente in ranked (tipo Yorick jungle), e questo non va bene. In ranked gioca solo pochi campioni con cui hai già confidenza, le prove si fanno in normal \n- quando sei support dopo che hai la sightstone cambia il trinket con quello rosso o al massimo quello blu. \n- togli le rune da attack speed sulla pagina ap. Quella pagina per come l'hai fatta va bene per i jungler ap, teemo e kayle, ma dato che hai solo due pagine conviene farla più generica mettendo ad esempio i marchi di magic penetration.\n\n:)","replies":[{"poster":"Seamus83","date":"2016-09-14T16:33:20.731+0000","up_votes":1,"down_votes":0,"body":"anche dalle stra-perse si può imparare! a volte nelle stra-perse ti puoi rendere conto di quando potevi forzare una giocata e non l'hai fatto di quando hai regalato una kill ecc... io le quelle partite le amo. \nMi fanno capire quanto sono nabbo e che c'è sempre un modo per migliorare !","replies":[{"poster":"Frattaglia","date":"2016-09-14T17:12:37.871+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Seamus83,realm=EUW,application-id=MJVj50Jw,discussion-id=NkRNmgWq,comment-id=00030000,timestamp=2016-09-14T16:33:20.731+0000)\n>\n> anche dalle stra-perse si può imparare! a volte nelle stra-perse ti puoi rendere conto di quando potevi forzare una giocata e non l&#x27;hai fatto di quando hai regalato una kill ecc... io le quelle partite le amo. \n> Mi fanno capire quanto sono nabbo e che c&#x27;è sempre un modo per migliorare !\n\nQuello è vero... ma di solito sei così deconcentrato che non ne ricaveresti comunque molto, per quello penso che sia meglio analizzare quelle combattute :)","replies":[]}]}]},{"poster":"vondarck","date":"2016-09-13T08:05:05.038+0000","up_votes":2,"down_votes":1,"body":"allora, calma\n\nho guardato le tue stat, giochi troppi ruoli e troppi champion, ti consiglio di specializzarti in 2 ruoli\n\nper quei 2 ruoli mainati 3/4 champion con caratteristiche \"simili ma diverse\"\n\nti do il mio esempio:\n\nmain jung:\n\ntank AD {{champion:48}} (se me lo bannano, allora {{champion:106}} o {{champion:120}})\ntank AP {{champion:154}} (se me lo bannano o servono hard cc {{champion:113}} )\nbrusier {{champion:62}} (se me lo bannano prendo la cavalletta)\nassa {{champion:121}} (se me lo bannano prendo la scimmia)\n\nsecondario, top:\n\ntank AD {{champion:75}} \nbrusier/offtank {{champion:58}} {{champion:80}} (early forte)\n\npoi adesso voglio imparare {{champion:83}}  perchè mi piace molto, però non lo porterei in ranked\n\ncome puoi vedere in jungla che sono più \"rodato\" ho più varietà di champ (in base ad i ban plausibili per il mio elo)\np.s. i champ che ti ho citato in jungla (apparte i tank ap che gli ho reintrodotti di recente ma ho il livello 4) li ho tutti a livello 5","replies":[]},{"poster":"Ardens33","date":"2016-09-13T21:13:01.737+0000","up_votes":1,"down_votes":1,"body":"1 irelia eveywhere, anche support, tanto carry il mondo a bronzo con lei, mid jungla dove ti pare\n2 non penso che sosterresti n fight con gold 3/4 perché io che sono stucked in silver 5 ho preso in mano un acco b5 di un mio amico e ho finito 20/3 con ashe top,  quindi direi che gente di una lega sopra esce dal bronzo in una ventina di game in winstreak.","replies":[{"poster":"P R O Void Omen","date":"2016-09-14T05:03:36.824+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ardens33,realm=EUW,application-id=MJVj50Jw,discussion-id=NkRNmgWq,comment-id=0009,timestamp=2016-09-13T21:13:01.737+0000)\n>\n> 1 irelia eveywhere, anche support, tanto carry il mondo a bronzo con lei, mid jungla dove ti pare\n> 2 non penso che sosterresti n fight con gold 3/4 perché io che sono stucked in silver 5 ho preso in mano un acco b5 di un mio amico e ho finito 20/3 con ashe top,  quindi direi che gente di una lega sopra esce dal bronzo in una ventina di game in winstreak.\n\nAl mio sesto game con yasuo stavo facendo 1 Vs 1 con un Main yasuo gold2 per un torneo e lui ha preso il first blod per una botta di culo perché la torre mi ha hittato 2 volte. Comunque il problema è propio questo, uso champ che carryato poco, ed è per questo che ho deciso di spammare kha fino alla morte ( irelia non mi piace )","replies":[]}]},{"poster":"Zedant","date":"2016-09-13T15:49:31.142+0000","up_votes":1,"down_votes":0,"body":"Se sei fortunato sali\nanche se in realta vale solo per me...","replies":[]},{"poster":"P R O Void Omen","date":"2016-09-13T09:54:32.219+0000","up_votes":1,"down_votes":0,"body":"Comunque un coaching replay mi farebbe bene, grazie : D","replies":[]},{"poster":"P R O Void Omen","date":"2016-09-13T09:52:47.840+0000","up_votes":1,"down_votes":0,"body":"Grazie a tutti per l' aiuto... tralasciando kha con lui ho un win rate del 70 qualcosa % mi sono accorto di usare bene anche brand. Vorrei imparare a usare zac e jarvan che mi farebbero comodo. ( comunque è vero. Spesso faccio first time in ranked. So che è sbagliato, ma il motivo per cui lo faccio è che nel mio è lo la gente si impegna solo nelle ranked ma neanche tanto, però sempre di più che nelle normal, e poi di solito prima di provare un champ mi imparo tutta la teoria xD )","replies":[]},{"poster":"Ringiel","date":"2016-09-12T18:19:28.486+0000","up_votes":1,"down_votes":0,"body":"il problema non sono i campioni,ma il fatto che muori troppe volte ... quasi tutti i tuoi game hanno le morti a doppia cifra;\nimpara a essere meno yolo e vedrai che scalara il bronzo sarà una cagata.","replies":[]}]}