{"poster":"FrozenBall1312","date":"2017-02-01T19:21:47.032+0000","title":"Tank???","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hi, \r\nich wollte mal fragen, welche Tanks ihr mir empfehlen w&uuml;rdet und welche die wirklich viele Leben haben (auch ohne Runen, und auch ohne Items am Schluss sondern wirklich am Anfang). Sie sollten vor allem Toplaner sein. \r\nDanke schon mal im Vorraus.\r\n{{summoner:12}}","replies":[{"poster":"Lynuin","date":"2017-02-02T12:53:32.311+0000","up_votes":1,"down_votes":0,"body":"Tanks sind grundsätzlich nicht besonders stark(was die Tankyness betrifft) bevor sie entsprechende Items und die Levels haben -\nVon allen Champions würde ich sagen sind diese diejenigen die sehr früh im Spiel besonders tanky sind\n\n{{champion:106}} {{champion:111}}  <---- eher eine subjektive Einschätzung habe mir keine Zahlen angesehen oder verglichen...\n oder diese auf der Support position  {{champion:89}} {{champion:223}} {{champion:201}} \n\nIm Mid-Late game sind diese {{champion:57}} {{champion:111}}  {{champion:78}} {{champion:14}}  zurzeit die solidesten Frontliner und stecken am meisten weg\n\n\nRunen sind essentiell - und eine EInmalinvestition auf die man nicht verzichten sollte.","replies":[]},{"poster":"OPChampsSucks","date":"2017-02-02T05:04:13.539+0000","up_votes":1,"down_votes":0,"body":"Trundle finde ich zurzeit eher schwach und wird auch weniger gesehen. Hält auch meiner Meinung nach nicht so viel aus wie manch andere Tanks. \n\nZurzeit stark sind definitiv Poppy und Darius wobei Darius im Early eher schwächelt durch sein geringen Manapool. im Lategame dafür haut er alles kurz und klein und wenn er einmal seine 5 Stacks in nem Teamfight zusammenbekommt machste auch locker n Penta. Zudem healst du dich bei nem Teamfight teilweise mit einer Q um 35% deines Lebens und bist dadurch eher zu spät tot als das es deinen feinden lieb wäre. \n\nPoppy hat den Vorteil des Max life dmgs und ist durch die neue Keystone Kolossus sowie ihrem Passive shield auch schon im early ziemlich tanky. Jedoch fehlt auch da recht schnell das Mana was sich ohne entsprechende Items auch im Lategame bemerkbar macht. Man sollte wenn möglich zumindest 1 Item mit max Mana kaufen damit Poppy auch durchaus mehr als 10 Sekunden zu gebrauchen ist ohne B2B. Garen ist durch seine Passive im klaren Early Vorteil da er für seinen Heal nicht zur base zurück muss und damit einiges an CS sowie EP erspielen kann während dein Gegenspieler in der Base ist. Durch sein SIlence und seinem Q Speed ist er auch recht schnell teilweise und der Gegner kann teilweise wichtige Skills nicht einsetzen. Zudem teilt er gelegentlich True Damage aus und hat ne Starke Rüstungsdurchdringung. seine W gibt dir nochmal eine starke Schadensreduzierung.\n\nMaokai ist so ne Sache. ja er ist ziemlich tanky aber kann gegen Darius oder Garen zb nichts mehr ausrichten da der Heal von denen einfach zu stark ist. Auch nen Nasus haut nen Mao im late kurz und klein. Daher halte ich Mao zurzeit für einen eher ungeeigneten Champ weil er gegen Offtanks einfach kaum Burst hat.\n\nCho Gath könnnte mit dem 7.3 Patch auch zu den stärkeren Tanks zählen der dazu noch unmengen an schaden raushaut. Er hat True damage eine gute Range muss nur selten in den Nahkampf und dazu noch ne silence w. Er kriegt pro stack knapp 200 leben auf seine Ult permanent ab 7.3 und ab ult max. DIese ist unbegrenzt stackbar wenn man es den PBE entnimmt und bis zu 6 Stacks kannst du an Minions stacken. Das heißt du bekommst nur durch deine Ult schon 1,2k Life passive und mit jedem Championkill den du durch die Ult verursachst weitere 200 leben. Das Macht ihn zu nem 2.0 Veigar oder Sion XD jenachdem ob du ihn full Ap oder Full tank bauen wirst.\n\nMundo kann man auch spielen aber da Mundo kein CC besitzt hast du es teilweise schwer n Kill zu kriegen. Jedoch hat er genug Leben um kaum zu sterben. ist auch im Early schon recht tanky.\n\nShen ist glaub ich ein eher unbekannter Toppick. Ist eigentlich recht einfach zu spielen und verdammt tanky. Zudem hat der shield, AA block und nen guten Roam. Sieht man eher selten finde ich ist aber verdammt stark. Erfordert jedoch ein bisschen übung und ist kein \"first try aber trotzdem 10 Pentas in einem Game\" Champ wie Darius. \n\nAlso es gibt viele Champs die ein Tanky potential haben . Tham und Illaoi zb könnt man noch nehmen oder auch teilweise etwas risikofreudigere champs mit nem Tankbuild wie zb Teemo. Skarner und Kled sind definitiv auch starke tanks aber sieht man auch selten dafür das die so gut sind.","replies":[]},{"poster":"Mi3zekatze","date":"2017-02-01T19:53:36.634+0000","up_votes":1,"down_votes":0,"body":"Offtank heißt es dann. \n\nTrundel, Poppy, Maokei sind drei SUPER gute Tanks die die Meta dominieren. \n\nAuch empfehlen würde ich Shen auch wenn er viel Mapawerenness benötigt. Zudem kann keiner bis Platin Shen gut im Team ausspielen. Deswegen ehe eingeschränkte Empfehlung.","replies":[]},{"poster":"FrozenBall1312","date":"2017-02-01T19:27:13.347+0000","up_votes":1,"down_votes":0,"body":"Außerdem sollte er auch viel Schaden verursachen. Ich glaube, dass es Semitank heißt.\n{{champion:122}}","replies":[]}]}