{"poster":"Vesne","date":"2016-04-07T09:57:17.574+0000","title":"Glitch - Can't Move, No Lag","subforum":"Gameplay & Strategy","up_votes":3,"down_votes":0,"body":"I&#039;ve been getting a really frustrating bug where my champ freezes and I sometimes also can&#039;t use abilities. It&#039;s no lag, my ping doesn&#039;t spike at all and I can see movement of creeps/champions and receive damage in real-time like normal. I thought it was my mouse and keyboard because they&#039;re so old, but in a game today a Kalista on the other team was having the same issue (obviously a huge issue for her passive in particular). I thought it would be worth posting to see how many people are affected by this and if it is something that needs to be addressed. It&#039;s extremely frustrating when you&#039;re about to escape, or just farming, or tower diving, and then you freeze and die in a stupid way and then get flamed.","replies":[{"poster":"Simple Sam","date":"2016-04-09T06:17:26.584+0000","up_votes":1,"down_votes":0,"body":"I am having the same problem since a few days ago. Clicking to move the character does not register an in-game move consistently.  If I ping/tracert that IP address I get time outs. \n\nHere is the link for the tracert \nhttp://pastebin.com/qXtYezKR\n\nAlso, the ICSI report: http://n2.netalyzr.icsi.berkeley.edu/summary/id=36ea240d-10141-513811ac-bcf9-40b9-84c8\n\nI've checked on my Ubuntu installation and I can't ping or tracert that IP either. I tried contacting the ISP and they said nothing is wrong. I checked the ports on the router and they seem to be okay.","replies":[{"poster":"Simple Sam","date":"2016-04-10T02:38:46.014+0000","up_votes":2,"down_votes":0,"body":"anecdotally, it seems to be since the last big patch that i have had this problem","replies":[]}]},{"poster":"Vesne","date":"2016-04-10T01:58:02.216+0000","up_votes":2,"down_votes":1,"body":"I played with more people today who are having this issue. It's definitely not just me.","replies":[{"poster":"Ingénue","date":"2016-04-10T02:15:37.382+0000","up_votes":2,"down_votes":0,"body":"Please link them to this thread and get them to follow the instructions. The more information, the easier it will be to figure out the problem.","replies":[]}]},{"poster":"SephirothSG","date":"2016-04-07T10:21:06.228+0000","up_votes":2,"down_votes":0,"body":"Hey there,\n\nCould you do the following for me.\n\n* [Download WinMTR](https://sourceforge.net/projects/winmtr/files/WinMTR-v092.zip/download) and run a traceroute to the following IP. (Allow this to run for 5-15 minutes)\n  * 103.240.227.5\n* Once adequate time has passed, stop the traceroute, export your results as text and reply back with them here (You can use [pastebin](http://pastebin.com/) for this)\n* Run the [ICSI netalyzr](http://netalyzr.icsi.berkeley.edu/) and email your results to oce-wrenchmen@googlegroups.com.","replies":[]},{"poster":"jojobmx","date":"2017-07-05T15:15:19.732+0000","up_votes":1,"down_votes":0,"body":"I have a problem similar to this\ni have 40-50 ping \nI can move freely cant attack\nwhen minions die they stay there attacking other dead minions i take damage even tho i have run away from a fight and sometimes it will unglitch and i will be dead\ntoday i played a game of aram and my heath depleted and i could still move then it unfroze and it told me i was dead\nPlease help me","replies":[{"poster":"Ninox","date":"2017-07-06T03:53:44.425+0000","up_votes":1,"down_votes":0,"body":"Likely a packet loss issue.\nhttps://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues","replies":[]}]},{"poster":"Simple Sam","date":"2016-04-12T09:26:50.859+0000","up_votes":1,"down_votes":0,"body":"I did some more investigation. It turns out to be a mouse issue. My clicks aren't registering with LOL full screen because of the mouse. If I use 'A' (attack-move) I can move fine. If I reassign move from MB2 to another key I can move. I tried reinstalling my mouse drivers but to no avail (maybe it is a Windows issue?).","replies":[]},{"poster":"BigWhite40","date":"2016-04-11T17:58:03.007+0000","up_votes":1,"down_votes":0,"body":"Same thing has happened to me.  Cost me 40 LP today because my character just freezes in the middle of the lane, and I watch him get murdered full time.  I'm not lagging, I have 40 ping.   I can type.  I just cant move, fight, use summoners, any abilities, or items.  I can move my camera around the map. This needs to be fixed.  It is not a connection issue on my end.","replies":[]}]}