{"poster":"Jared","date":"2015-02-04T19:55:42.154+0000","title":"Feierabend [STREAM] by EuJared - Main Top (Urgot OP)","subforum":"Streams & YouTube","embed":{"description":"EulenJared - EulenQueue - still verschnupft :-D","url":"http://www.twitch.tv/eujared","image":"http://static-cdn.jtvnw.net/jtv_user_pictures/eujared-profile_image-4caadc16d0a6c254-300x300.jpeg"},"up_votes":3,"down_votes":3,"body":"Hey Leute, hey {{champion:6}} \n\n\nVorab: ein **tl;dr:** ist unten angefügt^^\n\nEin erneutes mal versuche ich mich beim streamen. Allerdings strukturierter und mit besserem Equipment und technischen Voraussetzungen. Ich hatte vor meinen alten Thread zu aktualisieren, damit ich nicht erneut einen Thread erstellen muss... aber der Threadname wurde nicht übernommen :<\n\n**Über mich:**\nIch heiße Simon Jared und bin 20 Jahre jung. Komme aus NRW und habe einfach Spaß am zocken/streamen.\nHabe schon so einiges gezockt, aber bei LoL sind definitiv die meisten Stunden zusammen gekommen.^^\nNeben dem zocken bin ich natürlich auch gerne mal unterwegs, treibe Sport um mich fit zu halten und gehe ganz normal arbeiten.\n\n**Konzept:**\nIch arbeite immer recht lange, bis 18Uhr mindestens. Und von da an kommen wir auch zu meinem Stream Konzept:\nGeplant ist eine Art \"Feierabend Stream\". Man kommt nach Hause, hat nichts wichtiges mehr zu tun und will einfach die Füße hochlegen.\nEinfach runterkommen. Jeder macht es auf seine Art und Weise. Also warum nicht in einen entspannten Stream einschalten?\n\nWas könnt ihr erwarten?\nWas ihr in meinem Stream erwarten könnt? Spaß (Ab und zu bin ich auch mal lustig!:O)/Lernen. (Ab und zu auch einfach mal Entspannung :D)\nAber der Fokus liegt mehr auf Entertainment.\n\n**Weiteres:**\nIch bin nicht der schlechteste Spieler, aber gewiss auch nicht der beste. Allerdings mag ich von mir selber behaupten, dass einige definitiv noch was von mir lernen können.\nAber ich bin auch dankbar für Tipps! Also immer her damit, Verbesserungsvorschläge, konstruktive Kritik - alles gerne gesehen. Andernfalls kann ich mich nicht verbessern.\n\nSei es nun in Hinsicht aufs spielen oder auf den Stream selbst.\nIch versuche auch immer alles in Zukunft zu erklären - \"Warum ich was gekauft habe, wieso diese Aktion und nicht diese\". Allerdings bitte ich natürlich um Verständnis. Ich bin recht neu in der Genre und muss mich da auch erstmal reinfinden. Aber ich bin zuversichtlich, das wird schon:)\nUnd sobald ihr z.B. fragt ist es sowieso kein Problem.\n\n\nNatürlich ist mir bewusst, dass es unzählige Streamer gibt und es auch nicht wirklich einfach ist. \nAber selbst eine kleine Zahl würde mich schon freuen, da es mir wichtig ist zu sehen, dass scheinbar einige Freude daran empfinden bei mir einzuschalten.\n\n**Streamzeiten:**\nDie Streamzeiten werden in der Woche immer Abends sein. Ab 19Uhr ca. \nEinen genauen Plan gibt es bisher nicht - also subscriben und checken ob ich da bin. :D\nDementsprechend werde ich auch die Facebook Seite aktiv benutzen um den Stream anzukündigen, genauso wie diesen Thread.\nAnsonsten werde ich am Wochenende mit Sicherheit aktiver und auch schon früher streamen.\nEvents wird es auch in Zukunft geben.\n\n\n[B]Musik[/B] und [B]Facecam[/B] sind auch vorhanden. Falls es zu der Musik irgendwelche Wünsche gibt, lasst es mich wissen. Lässt sich alles immer einrichten!:)\n\n\n\n**Ingame Daten:**\nIch bin im Moment Platin 4 - spiele auch aktiv Ranked. Sowohl DuoQ als auch SoloQ.\nEs wird aber auch desöfteren Teamrankeds zu sehen sein. \nAllgemein werden großteils Rankeds gestreamt. Sollte Bedarf bestehen, bin ich natürlich auch Bereit für Viewergames.^^\n\n**Meine favorisierten Rollen sind: Top/Mid Lane.**\nFür genauere Champs: Lolking Link unten angegeben.\n\n\nDer Stream läuft in [B]720p auf 60 FPS[/B] (Ich könnte auch mit 1080p streamen - aber ich befürchte das einige einfach noch schlechtes Internet besitzen (Mein Beileid) und dementsprechend nichtmal\nannähernd einen 1080p Stream gucken könnten.)\nAuch hier: Stört euch irgendetwas? Ist irgendetwas fehlerhaft? Musik zu laut - Stimme zu leise? Sagt es mir! Was euch gefällt sagt weiter, was euch stört sagt mir!\n\n\nNun, das war es dann erstmal wieder von mir. Ich hoffe euch hat die Wall of Text nicht erdrückt und gelangweilt. Nur möchte ich nicht meinen Stream hier so hinklatschen wie manch andere das tun..^^\n\n\n\n**Facebook Link: https://www.facebook.com/pages/Jared-Stream/572570706093106?ref=hl\nTwitch Stream Link: http://de.twitch.tv/eujared\nlolking: http://www.lolking.net/summoner/euw/19321130#stream**\n\n\n\nIch hoffe ihr schaut mal rein und gebt mir eine Chance.\nWürde mich freuen. Und über ein Hallo im Chat freue ich mich immer^^\n\n\n**tl;dr:**\n\n- Feierabend Stream (Ab 19Uhr meist online)\n- Platin SoloQ\n- Teamrankeds\n- Top/Mid Laner {{champion:6}} {{champion:68}} \n- Streamsprache: Deutsch (ggf. Englisch)\n- 720p (1080p möglich, sobald ich Partner bin xD)\n- Facecam/Musik vorhanden\n\n**\nSpecial**\n- Ich habe eine bestimmte seltene Gegebenheit!:D\nEin Freund von mir wird nun in Zukunft desöfteren für Musik im Stream sorgen. Dies erfolgt über live! Also eine Art \"DJ\" ^^\nSo muss ich mich nicht um die Musik während des Spielen kümmern und es wird abwechslungsreich sein. Zumal so auch gut auf Wünsche eingegangen werden kann. Ich hoffe das alles so reibungslos ablaufen wird!\n\n- Lolking Stream hinzugefügt","replies":[{"poster":"Jared","date":"2015-02-07T14:41:29.524+0000","up_votes":1,"down_votes":0,"body":"Online - auf der Suche nach einem Jungler :-)){{summoner:11}}","replies":[]},{"poster":"eingew","date":"2015-02-04T19:57:59.670+0000","up_votes":1,"down_votes":0,"body":"Viel Spaß dabei das ganze hübscher zu machen :P Du hättest das nicht aus Schreibfenster kopieren sollen glaube ich... :P","replies":[]}]}