{"poster":"Cuching","date":"2016-05-01T00:32:09.438+0000","title":"Actualizaciones de Campeones","subforum":"Charlas Generales","up_votes":4,"down_votes":3,"body":"La Actualizaci&oacute;n de Magos ( 6.9 ) estar&aacute; llegando para el martes o miercoles de la semana que viene.\nDespu&eacute;s de esta actualizaci&oacute;n, llegar&aacute; a Ryze El Hechizero Rebelde, con un cambio de texturas y de juego.\nLuego de Eso, llegar&aacute; la Ansiada actualizaci&oacute;n de Yorick, El Enterrador.\n**REITERO QUE SOLO QUIERO INFORMAR SOBRE LA ACTUALIZACIÓN DE RYZE**\n\nPodemos verlo aqu&iacute;, en la secci&oacute;n &quot;Plan de Actualizaci&oacute;n de Campeones&quot;.\n\nhttp://imgur.com/TG4ysom","replies":[{"poster":"Kyousuke","date":"2016-05-01T00:35:02.891+0000","up_votes":11,"down_votes":0,"body":"ultimo momento: acaban de realizar un atentado a las torres gemelas, seguiremos informando","replies":[{"poster":"Cuching","date":"2016-05-01T00:44:05.196+0000","up_votes":1,"down_votes":1,"body":"Además, solo quería informar lo de Ryze, si tu te lo tomas tan mal, no es mi culpa ;)","replies":[{"poster":"Kyousuke","date":"2016-05-01T01:20:51.799+0000","up_votes":3,"down_votes":0,"body":"https://k39.kn3.net/taringa/6/0/8/7/6/7/vagonettas/9CA.gif","replies":[]}]},{"poster":"Cuching","date":"2016-05-01T00:39:36.616+0000","up_votes":1,"down_votes":1,"body":"Ozhe ke te pasha?","replies":[]}]},{"poster":"MD Abýssou","date":"2016-05-01T00:36:44.424+0000","up_votes":3,"down_votes":0,"body":"acordate que van a poner algo, cualquier cosa, antes del rework de yorick\nno me sorprendería para nada","replies":[{"poster":"Cuching","date":"2016-05-01T00:42:56.538+0000","up_votes":1,"down_votes":0,"body":"Si, de seguro lo querran dejar de lado :c xD","replies":[{"poster":"Ranpage","date":"2016-05-01T02:47:56.897+0000","up_votes":2,"down_votes":1,"body":"después cuando terminen el rework de ryze va a ver un comentario de un rioter diciendo que alfin llego el momento de el reworck de yorick de un post gracioso\ny después de un dia van a hacerle primero el reworck a renekton y haci hasta la season 12 donde harán un evento sobre el reworck de yorick pero se le derrama el café a riot gausk y como tiene configurado su pc dira GG IZI al apagarse para siempre y el rework de yorick y el rework de aurelion sol junto con el modo sandbox y la creación de ao shin que lo hiban a sacar junto con el reworck de yorick se va a perder junto con el 50 % de la grieta del invocador que tendrá riot gausk al comprar el 25 % de league of legends\n","replies":[{"poster":"MD Abýssou","date":"2016-05-01T06:17:19.976+0000","up_votes":1,"down_votes":0,"body":"y que van a hacer el re-relanzamiento de sion\ny el re-rework de fiora\ny asi es como va a morir olvidado y sin entrar en las rotaciones el querido yorick","replies":[]}]},{"poster":"Sondorax","date":"2016-05-01T02:41:14.815+0000","up_votes":2,"down_votes":1,"body":"Si lo quisieran dejar de lado,la verdad seria mas facil pausarlo indefinidamente,como le paso al pobre urgot,estaban trabajando en el y lo pausaron,ya ni saben que hacer con el tipo","replies":[{"poster":"Whitesse","date":"2016-05-01T04:47:24.837+0000","up_votes":1,"down_votes":0,"body":"Urgot esta perfecto, no me gustaría que le hagan un cambio en las habilidades. Velocidad de movimiento en la W no estaría mal.","replies":[]}]}]},{"poster":"Caipirinhã","date":"2016-05-01T03:36:54.673+0000","up_votes":1,"down_votes":0,"body":"Akali 100% Confirmed","replies":[]}]},{"poster":"Jcyrano","date":"2016-05-01T08:19:55.526+0000","up_votes":1,"down_votes":0,"body":"el rework de Yorick y el de Ryze son 2 equipos Independientes ninguno retrasa al Otro, lo que si es que requieren diferentes Tiempos, no recuerdo que Rioter lo dijo pero esta en el Red TRACK","replies":[{"poster":"Numerítos","date":"2016-05-01T23:27:30.166+0000","up_votes":1,"down_votes":0,"body":"Donde dijeron eso?","replies":[{"poster":"Jcyrano","date":"2016-05-02T00:28:48.507+0000","up_votes":1,"down_votes":0,"body":"Surrender @ 20 había linkeado el red track en donde decían eso y por twitter también estaba la \"charla\" con Moobeat quien pregunto sobre si los próximos Updates eran Independientes o no entre si.\nte dije que hay un Red Track, no te mentí, y al menos que la situación haya cambiado, son Independientes.","replies":[{"poster":"Jcyrano","date":"2016-05-02T00:51:25.952+0000","up_votes":1,"down_votes":0,"body":">Ryze Update likely before Yorick\n In a boards thread inquiring on the new champion update and if it will be the Yorick update,** Reav3** noted that as it is a smaller scope rework Ryze is more likely to be released before Yorick :\n\"Quote:\nAnd they have 1 team working on Ryze while another one working on Yorick. Neither of them are effecting the release date of the other.\nThis is correct. Yorick is a much larger rework then Ryze and also is a minionmancer, which is generally a heavy resource type of champion. This means that although the team working on Ryze started later, Ryze will most likely come before Yorick. This is subject to change of course.\"\nReav3 continued, reminding Ryze's update will include new visuals and splash art:\n\"Quote:\nis Ryze getting a new base splash?\nas for skins, is Pirate Ryze getting a new splash art?\nYes, and new models. The only splash we won't be updating is whitebeard.\"\n**Reav3** also again mentioned Ryze will have new voiceovers:\n\"New VO for sure. As for his voice we will do auditions for his voice, not sure if that will mean a new voice or not.\"\nAs for why Ryze is getting another set of gameplay changes following his 2015 update, Reav3 commented:\n\"The problem is that when he is balanced for ranked, he is unbalanced for competitive and vice versa. Ryze's competitive ban rate is once again insanely high, he was 100% ban during NA finals for example.\".\n[Surrender @ 20 22/4/2016](http://www.surrenderat20.net/2016/04/red-post-collection-lcp-ep-18-on.html)","replies":[]}]}]}]},{"poster":"Junox","date":"2016-05-01T23:43:15.250+0000","up_votes":1,"down_votes":0,"body":"Día 9981203545. Aún no hay rastros del Rework de Urgot. \nZZZ","replies":[]},{"poster":"Arrat","date":"2016-05-01T23:35:52.774+0000","up_votes":1,"down_votes":0,"body":"Solo 2 actualizaciones completas en lo que queda del año... Riot si seguimos asi no terminamos mas con todos los champs antiguos.","replies":[]},{"poster":"LEONEL1440","date":"2016-05-01T02:44:17.100+0000","up_votes":1,"down_votes":1,"body":"siii y tambien va a salir aurelion sol qhe emhosionante","replies":[]}]}