{"poster":"MKEYMAIK","date":"2015-07-07T15:11:45.007+0000","title":"Frage bezüglich perma bann","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":3,"body":"hallo Leute ich habe schon ziemlich viel Geld in lol investiert ( 120 ) was schon ziemlich viel Geld in meinem alter ist. Die frage ist: man kann halt perma gebannt werden und ist es so das wenn man viel Geld f&uuml;r lol aussgegeben hat man trotzdem einen permanente Speere bekommt ? denn es ist schon ziemlich viel Geld und wenn das einfach mal so weg ist ?                                                                  Ich freue mich auf hilfreiche Kommentare...DANKE","replies":[{"poster":"Living Tempest","date":"2015-07-07T15:14:28.494+0000","up_votes":5,"down_votes":0,"body":"Ja kann man. Und das Geld ist nicht weg - es ist bei Riot.","replies":[]},{"poster":"Humpelstilzche","date":"2015-07-07T15:21:33.198+0000","up_votes":2,"down_votes":0,"body":"Ja. Das ausgegebene Geld wird bei Bans grundsätzlich nicht berücksichtigt und man kriegt im Falle einen Permas auch nichts erstattet. Wer es fertig bringt sich permanent bannen zu lassen (und dafür muss man sich EINIGES erlauben) sieht sein Geld nie wieder und das ist auch gut so. Angesichts dessen was man tun muss um permanent gebannt zu werden, ist das noch eine  sanfte Strafe. \nUnd bevor die Frage aufkommt: Nein, Permabans werden auch ganz grundsätzlich NIE aufgehoben. Einmal Perma, immer Perma.","replies":[{"poster":"MKEYMAIK","date":"2015-07-07T15:36:32.945+0000","up_votes":1,"down_votes":0,"body":"und wie siehts mit leaven aus ? denn das ist zurzeit mein größtes Problem","replies":[{"poster":"Humpelstilzche","date":"2015-07-07T15:41:27.040+0000","up_votes":2,"down_votes":0,"body":"Genauso. Wie bereits gesagt: Geld wird nicht berücksichtigt. Egal bei welcher Strafe.\n\nWenn Leaven für dich ein Problem ist: Fix das Problem. Eine Internetleitung lässt sich fixen, Provider lassen sich wechseln, mit Eltern/Freundin kann man reden, seine Zeit kann man planen, seine Hardware reparieren usw...\n\nEs ist problemlos möglich, Leaves nahezu vollständig zu vermeiden (von höherer Gewalt wie Stromausfall und Zombie-Apokalypse mal abgesehen), wenn man nur will.","replies":[{"poster":"MKEYMAIK","date":"2015-07-07T15:49:30.555+0000","up_votes":1,"down_votes":0,"body":"ok aber wenn man es so sieht hatte ich aber auch einige bugs wo ich keinen champ ausswählen konnte da kann man leider nichts gegen tuen trotzdem danke für die Aufklärung","replies":[{"poster":"Humpelstilzche","date":"2015-07-07T21:55:25.715+0000","up_votes":1,"down_votes":0,"body":"Wenn nur die diese Bugs hast und keiner sonst dann liegt, so leid mir das tut, die Schuld sehr wohl auf deiner Seite und man kann auch was dagegen tun. Da googelt man eben, wie man das Problem lösen kann oder fragt den Support.","replies":[]}]}]}]},{"poster":"Th3St0rmD3Ath","date":"2015-07-07T15:26:21.215+0000","up_votes":1,"down_votes":0,"body":"Ganz streng genommen werden manche Perma's schon aufgehoben :D sei es weil man sein Bankkonto überzogen hat oder wenn Rito mal ein Fehler machen WÜRDE ;)","replies":[]}]},{"poster":"Neamhoilte","date":"2015-07-07T15:21:40.492+0000","up_votes":2,"down_votes":0,"body":"Das Geld ist bei einem Perma Bann weg.\n\nAlso, niemals Flamen, Blamen und Co.\n\nNicht Scripten, Account sharing, Exploits ausnutzen.","replies":[]},{"poster":"cremnik","date":"2015-07-07T15:19:08.719+0000","up_votes":1,"down_votes":0,"body":"Ja, denn die AGB's denen du zugestimmt hast, erlauben das. Streng genommen gehört dir der Account auch nicht selbst, sondern Riot. Also lass es besser nicht darauf ankommen ;)","replies":[]}]}