{"poster":"NalamiHUN","date":"2015-03-08T16:55:50.542+0000","title":"Kayle mire jó?","subforum":"Segítség és támogatás","up_votes":1,"down_votes":0,"body":"Kayle melyik ösvényen OP?","replies":[{"poster":"Shiina","date":"2015-03-09T10:51:04.783+0000","up_votes":2,"down_votes":1,"body":"Erdésznek a kommentje közelíti meg leginkább a valóságot.\nAzonban figyelmedbe ajánlom a guide-omat: http://www.solomid.net/guide/view/127555-kayle-build-guide-fighter-by-shiina\nMelyben a Crit Kayle Top-ot ismertetem.\n\nSzóval: Top + AD {{item:3031}}","replies":[]},{"poster":"frvr13","date":"2015-03-09T12:36:20.614+0000","up_votes":1,"down_votes":0,"body":"Főleg topra és midre, bár látni lehet supportként is, néha-néha pedig junglerként is.\nTop és mid: Tökéletes counterpick több hős, például Zed ellen. Jobb a pokeod, nem hagyod farmolni és kiszoritod a torony alá, ezáltal vagy megfosztod a roamolásától, vagy pedig egy tornyától.\nSupport:  Hasznos az olyan adc-k mellé, mint Ashe vagy Jinx, hogy az enemyt a végtelenségig tudjátok kiteolni a rengeteg lassitással, tudsz adni nekik egy  kevés bónusz mobilitást, és a teamfightokban immunitást is képes adni manafelhasználás nélkül, ami egy üvegágyú hősnek rettenet hasznos.\nJungler: Eddig csak ritkán láttam, akkor is normálban, de elvileg lehetséges a sustainje és az AoE alaptámadásai miatt. Bár a gankjei nem éppen erőteljesek, mint egy Lee Sin, Sejuani, vagy Fiddlesticks gank.\nAdc-nek is el tudnám képzelni, mert elegendő töltési idő csökkentéssel képes folyamatosan távolsági lenni, bár a sebzése főleg AP-ból jön.","replies":[]},{"poster":"Brăd","date":"2015-03-08T16:59:37.308+0000","up_votes":1,"down_votes":0,"body":"Mindegyiken.","replies":[{"poster":"M4dr4c","date":"2015-03-08T17:28:31.656+0000","up_votes":1,"down_votes":0,"body":"Szerintem inkább sehol. A nerfek óta nem OP, de megállja a helyét még topon és miden. Jungle biztos vagyok benne, hogy túl erős neki, adcnek meg supportnak meg egyenesen rossz. :D","replies":[{"poster":"Brăd","date":"2015-03-08T18:44:38.120+0000","up_votes":1,"down_votes":0,"body":"[Csak hogy válaszoljak.](http://matchhistory.eune.leagueoflegends.com/hu/#match-details/EUN1/1065478237/210349909?tab=overview)","replies":[]},{"poster":"Thadreas","date":"2015-03-08T17:35:51.606+0000","up_votes":1,"down_votes":0,"body":"Nos én supportnak továbbra is szeretem, erős...\n\nMaximum annyi, hogy inkább ad orientáltabb hybridként szoktam vinni.\n\nAdc-nek még sosem láttam mondjuk....\n\nTop/mid még mindig elég idegesítő tud lenni, ha értesz hozzá.\n\nMÉg mindig hypercarry szóval ha a döcögős startot átvészeled, csak jobb és jobb lesz a helyzet ahogy a meccs halad.\n\nSzerintem.","replies":[]}]}]}]}