{"poster":"NalamiHUN","date":"2016-02-20T13:24:42.434+0000","title":"Balance s Division rasszimus","subforum":"Általános beszélgetés","up_votes":2,"down_votes":0,"body":"K&eacute;t dologr&oacute;l akarok inf&oacute;t k&eacute;rni.\n\n1, Most kapott ugye Poppy nerfet, de Xin Zhao, aki v&eacute;lem&eacute;nyem szerint OP, meg buffot.\n\nAzon t&ouml;r&ouml;m a fejem, hogy mi&eacute;rt van az, hogy a Zed f&eacute;l&eacute;ket buffolj&aacute;k, de pl Syndra (akit &eacute;n akkor l&aacute;ttam utolj&aacute;ra kb, mikor &eacute;n kipr&oacute;b&aacute;ltam egy r&eacute;gi ingyenes heten) meg kapja a nerfet?\n\n2, Miért van ez az úgymond division rasszizmus (amikor az egyik sértegetni kezdi a másikat, meg ráförmed, hogy fogja be a pofáját csak azért, mert bronzosnak-silveresnek nézi)? Mert szerintem nem csak &eacute;n unom, hogy l&aacute;tni lehet ilyent a h&iacute;rek alatt is, meg a f&oacute;rumban is, meg n&eacute;ha j&aacute;t&eacute;kban is, m&eacute;g ha nem is mindennap.","replies":[{"poster":"DzsoFTW192","date":"2016-02-21T00:20:17.825+0000","up_votes":1,"down_votes":0,"body":"> Azon töröm a fejem, hogy miért van az, hogy a Zed féléket buffolják, de pl Syndra (akit én akkor láttam utoljára kb, mikor én kipróbáltam egy régi ingyenes heten) meg kapja a nerfet?\n\nEzt nem mondanám most a Syndra pont egy olyan karakter, ami nagyon erős tud lenni, ha valaki jól kezeli. Szerintem nevezhetem már magam Syndra mainnek mert 20meccsből 15 meccsen általában carry szerepet töltök be. Azért nincsen sok Syndra mert nem egy nehéz de nem is könnyű karakter. Nekem már az első meccsnél nagyon kézre állt. Hasonló, mint egy Azír csak picit könnyebb és gyorsabban lehet kitörölni valakit a térképről.","replies":[{"poster":"NalamiHUN","date":"2016-02-21T09:47:29.957+0000","up_votes":1,"down_votes":0,"body":"Értem, ez esetben elnézést, rossz volt a példa ^^\"","replies":[]}]},{"poster":"panzergodx","date":"2016-02-20T14:20:46.999+0000","up_votes":1,"down_votes":0,"body":"> 2, Miért van ez az úgymond division rasszizmus (amikor az egyik sértegetni kezdi a másikat, meg ráförmed, hogy fogja be a pofáját csak azért, mert bronzosnak-silveresnek nézi)? Mert szerintem nem csak én unom, hogy látni lehet ilyent a hírek alatt is, meg a fórumban is, meg néha játékban is, még ha nem is mindennap.\n\nazért mert azok az emberek nem azért vannak silverbe meg bronzba mert: elohell, noobmates, unluckygame, hanem mert a játéktudásuk, a játékhoz való hozzáállásluk szerint oda valók, gondolok itt arra hogy egyáltalán nem gondolkodnak, csak állnak a turret alatt azt várják h majd valaki megnyerni a gamet, teljesen logikátlan döntéseket hoznak (már ha egyáltalán hoznak és nem azt várják hogy az enemybe afkoljanak ki 2en), random afkolgatnak a jungelbe/kezdőn, folyamatosan allchatet spammelik (egyáltalán mi a %%%%nak ez az allchat ebbe a játékba, minden negatív dolognak az allchat a forrása) és ezek azok az emberek akik annyira szeretnek mindent megmagyarázni a ladder legaljáról hogy pl. az ap ekko support az jó, az ilyen playerek ne akarják már megmondani a plat/diamon+os embereknek hogy mégis hogyan kell játszani ezt a játékot","replies":[{"poster":"NalamiHUN","date":"2016-02-20T19:24:20.981+0000","up_votes":1,"down_votes":0,"body":"én arra gondoltam, mikor jogtalanul förmednek rá arra a szerencsétlenre, a jogosnál én is azt mondom, hogy jól tette.","replies":[]},{"poster":"AsD The Dreamer","date":"2016-02-20T15:20:56.254+0000","up_votes":1,"down_votes":0,"body":"Attól minek flamelni? Egyébként gratula a helyesírásért.","replies":[]}]},{"poster":"Anonym Feeder","date":"2016-02-20T16:02:30.384+0000","up_votes":1,"down_votes":0,"body":"Na legalább nem nekem kell leírnom, hogy broken a Xin. Bár nem tudom ki szerint nem az.. \nAmúgy igen, Zednek ez az új item valami ritka erős  lett (Ha tudják használni). Egyébként zed jó ahogy van szerintem nem is op, nem is gyenge, pont balancolt. Ami nem mondató el Jaxről aki 1 v 5-ben lehoz egy meccset ha tud focusálni, főleg XIN + Jax combo szinte verhetetlen Guinsoo aztán gg wp.\n\nEngem nem érdekel ha lebronzoznak, mivel nem bronz vagyok, ha valaki azzal jön csak úgy reagálok rá, hogy \"Yes im bronze 5, problem?\" (nem valami nagy az angol tudásom...).\nPanzergodx leírta amit most ide írnék, 100%-ban ugyan ezt gondolom. Igaz én is silver vagyok jelenleg, de szerintem jobban teljesítek mint az átlag bronze, silver. Semmi ego. \nEgyébként nem flamelem őket, pont fordítva, segítenél nekik de nem tudsz, mert vagy nem írnak vissza, sőt nem is olvassák el amit leírsz vagy ez jön válaszul \"fk u\", \"%%%%%%\" stb.","replies":[]},{"poster":"R3wan","date":"2016-02-20T15:53:57.156+0000","up_votes":1,"down_votes":0,"body":"1. Erre talán maga a Riot sem tudja a választ. :D \n\n2. Mert azt hiszik, hogy mert magasabban vannak, az feljogosítja őket, hogy másokkal így beszéljenek. Tisztelet a kivételnek, persze. Bunkók, ennyi.","replies":[]},{"poster":"AsD The Dreamer","date":"2016-02-20T14:01:14.479+0000","up_votes":1,"down_votes":0,"body":"Következő patchben csökkentik a Xin Zhao w attack speedjét, erről ennyit. Amit viszont én nem értek, hogy Viktor miért fog kapni nerfet.\n\nÁmbár ezt nem szabad készpénznek venni, de valószínűleg bekövetkeznek.","replies":[]}]}