{"poster":"AnimeGuy2205","date":"2017-09-19T16:33:50.257+0000","title":"Having Ping and DC issues since yesterday.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I had high ping Saturday jumping to 300-1500. It was gone Sunday so I thought it was just a server issue. Monday(Yesterday) It started again. Horrific ping. I'm usually at atleast 200+. It goes down to 60-70 or a few seconds sometimes then jumps back up to 200-400+. I've seen alot of people complaining about ping and random DC during matches for a days now. Is it my laptop or the server? I have good ping to my internet provider.","replies":[{"poster":"Porocles","date":"2017-09-19T17:18:45.976+0000","up_votes":1,"down_votes":0,"body":"If these spikes are sudden they could be due to packet loss.  League is always online, so you'll often see connection issues reported but they can happen for a variety of reasons.  Run a [log reader](https://support.riotgames.com/hc/en-us/articles/209765743-Connection-Troubleshooting-Log-Reader) of the impacted games to get an analysis of your case.  The results should also offer some troubleshooting steps, and let me know what you find.","replies":[{"poster":"AnimeGuy2205","date":"2017-09-19T17:36:17.602+0000","up_votes":1,"down_votes":0,"body":"I have the Hextech Repair tool. Could I send a log from that?","replies":[{"poster":"Porocles","date":"2017-09-19T17:38:55.760+0000","up_votes":1,"down_votes":0,"body":"Those are different logs that our tech team can use to assist directly.  You're welcome to attach it to a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) so we can assist you through there.  Otherwise, the log reader is different and uploaded to the site directly.","replies":[{"poster":"AnimeGuy2205","date":"2017-09-19T17:49:15.722+0000","up_votes":1,"down_votes":0,"body":"\"Your average percentage of packet loss for this game was 3.29%.\n\nOverall, this means you had a high amount of packets lost during the game. This can be caused by various network issues, so please see below for a few common steps that can help reduce packet loss.\"\n:(","replies":[{"poster":"Porocles","date":"2017-09-19T17:52:44.622+0000","up_votes":1,"down_votes":0,"body":"Ohh yeah, that's quite a bit!  No worries, though, our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide should be able to help here.  Run through each step to tune up your local network settings and get back in game, just be sure to test it in custom first.","replies":[{"poster":"AnimeGuy2205","date":"2017-09-19T20:16:05.743+0000","up_votes":1,"down_votes":0,"body":"The ping is alot better now, but still having random DC.","replies":[]}]}]}]}]}]}]}