{"poster":"SoloMundoScYx17","date":"2015-12-11T00:33:55.984+0000","title":"¿Vale la pena jugar League of Legends?","subforum":"Charlas Generales","up_votes":3,"down_votes":22,"body":"&iquest;Vale la pena jugar League of Legends? \r\n\r\nB&aacute;sicamente, _esa _es la pregunta que todos deben hacerse en su cabeza. \r\n\r\n\r\nTiene que ser como &quot;ok, voy a jugar este juego, ser&eacute;  , porque no vale la pena salirte del juego si sacas first blood, obviamente, y solo por eso \r\n\r\nPero quiz&aacute;s tienes un composici&oacute;n de equipo terrible y tienes cada carril perdiendo y t&uacute; mismo tambi&eacute;n te equivocaste as&iacute; que dices: &quot;Ok, todos est&aacute;n perdiendo, yo las cagu&eacute;, como que, probablemente, solo deber&iacute;amos declarar que ya se perdi&ograve; y pasar al siguiente juego. Como que, en resumidas cuentas, esa es la estrategia.\r\n\r\nS&eacute; que hay personas que juegan p&oacute;ker  y que tienen como 30 partidas corriendo al mismo tiempo, y es como que... (o no s&eacute; cuantos tienen corriendo al mismo tiempo, pero tienen un mont&oacute;n de partidas abiertas al mismo tiempo). Y es algo as&iacute; como el mismo concepto. No s&eacute;, es como, no s&eacute; si podr&iacute;a comprometerme a eso. Como que...pero, no s&eacute;. En todo caso, me he dado cuenta de algo interesante, como que cuando miro a un _streamer _de p&oacute;ker mostrando p&oacute;ker y tiene todas estas mesas abiertas al mismo tiempo, y es como que no lo puedo comparar con league porque, obviamente, no puedes tener m&agrave;s de una partida abierta al mismo tiempo.  Es como que no quieres estar pegado en una partida de league. Cuando tratas de subir la ladder vas con la mentalidad de &quot;Voy a subir, voy a ir y los voy a mandar al basurero&quot;. No quieres estar pegado en una partida donde todos est&aacute;n fallando, incluso hasta t&uacute; mismo, como que...o quiz&aacute;s lo est&aacute;s haciendo bien y no quieres estar atrapado en esa partida. B&aacute;sicamente, eso es todo. \r\n\r\nGracias por estar leyendo hasta ac&aacute;.\r\n\r\nAs&iacute; que s&iacute;, como que b&aacute;sicamente es eso.  Esa es la raz&oacute;n por la que pusieron ese sistema. Porque los jugadores que se salen de las partidas eran un gran problema.  Pero no ser&iacute;a un problema...ellos ya no son un problema _ahora_ . La gente no va a dejar partidas en ranked porque si est&aacute;s en Plat&iacute;no o Diamante o Challenger o el que sea. Y t&uacute;, si te pasa algo malo y tienes que salirte del juego consistentemente, no vas a estar en Challenger por mucho m&aacute;s tiempo, Sino puedes manejar ciertas situaciones que te tiran no vas a estar en Challenger. As&iacute; que el juego va a filtrar quien merece ser de ELO alto. Y eso, ah&iacute; mismo va a solucionar todos los problemas de toxicidad; porque la raz&oacute;n por la que las personas son t&oacute;xicas es que no quieren estar atascadas con estas personas con las que no quiere jugar o que lo est&aacute;n haciendo mal y no pueden ganar. Porque &iquest;Cu&aacute;l es el punto estar ah&iacute;? Estar pegado en el juego! Como en el colegio, Es como volver al colegio donde, b&aacute;sicamente, fui a una escuela nueva, lectores, en la que no pod&iacute;a salir a comprarme un almuerzo, como que ten&iacute;a que sentarme ah&iacute; a la hora del almuerzo con...fui a una escuela nueva, como a los 17 a&ntilde;os. Y onda, como que no conoc&iacute;a a nadie. As&iacute; que quer&iacute;a salir durante la hora del almuerzo, porque no quer&iacute;a pasar tiempo con ellos. Y ten&iacute;a que quedarme pegado en la escuela durante el horario de almuerzo . Y era como lo m&aacute;s...no me gustaba en lo absoluto. Era apestoso. Me quiero ir del campus e ir a otro lugar por donde vendan comida. Hab&iacute;a un lugar muy cercano pero no se pod&iacute;a ir porque si te ibas del campus mientras era la hora del almuerzo un polic&iacute;a te iba a seguir y despu&eacute;s te amonestaban y castigaban con dinero a tus padres. As&iacute; que no se pod&iacute;a salir. Porque un est&uacute;pido ganaba.  Hab&iacute;a un regla, porque ac&aacute; es donde se une a LeAGUE. alg&uacute;n idiota se fue del colegio y no llegaban a clases a la hora. As&iacute; que por esos idiotas hicieron una regla    en la que _nadie _pod&iacute;a salir del Campus ahora, en vez de _esos _est&uacute;pidos. Pero esos retrasados solo deb&iacute;an, todos ellos reciben castigo porque sus notas van a bajar. Sus notas van a empeorar. La escuela secundaria no es una est&uacute;pida guarder&iacute;a.  Esto no es una guarder&iacute;a. League of Legends no es una guarder&iacute;a, ok? Si alg&uacute;n idiota se quiere salir consistentemente de sus partidas y no pueden ganar esas partidas va a perder MMR. Va a perder y va a ser basura. Y es lo mismo con el colegio. Si alguien no quiere estar ah&iacute; no van a conseguir nada con tener a alguien ah&iacute; sentado en la escuela. Como que esa es una de las cosas principales que no entiendo de la escuela secundaria en general. como que, lo toman como una guarder&iacute;a. Los polic&iacute;as pasaban su tiempo sentados afuera asegur&aacute;ndose de que las personas no salieran del campus. Es como _WTF _es eso.  que van a hacer.  Y hab&iacute;an peleas todos los d&iacute;as, esto es lo m&aacute;s, lectores, hab&iacute;an peleas cada puto d&iacute;a.  Las personas peleaban.  As&iacute; que...en mi otra escuela no era as&iacute;. Pero cuando fui a la escuela (censurado) en (censurado) hab&iacute;an peleas todos y cada uno de los d&iacute;as. La gente peleaba entre ellos a pu&ntilde;o limpio y toda la mierda. Y por alg&uacute;n motivo no lo registraron en su cabeza. De que &quot;quiz&aacute;s por estar todos atascados en ese lugar con personas que no se ca&iacute;an bien entre ellos. Quiz&aacute;s si pudieran salir de ese lugar cerrado&quot; (?_? ) ( ?_?) quiz&aacute;s eso hubiera detenido las peleas. Pero no lo registraron. Pensaron &quot;Oh es genial, tenemos a todos aqu&iacute;, encerrados en este peque&ntilde;o lugacito, esta escuela&quot; y, s&iacute;, es una gran cosa que no puedas, que nadie pueda salir.  Hay que tener a todos aqu&iacute;. no hay raz&oacute;n para tener m&aacute;s esta regla, b&aacute;sicamente.  Y s&iacute;, eso es pr&aacute;cticamente todo.  As&iacute; que...como sea.\r\n\r\nEs solo que creo que gran parte de la toxicidad, se resolver&iacute;a si pudieras salir del juego porque tu equipo apesta. No tendrias que enojarte contra ellos, solo te ir&iacute;as de la partida. Y es lo mismo con DOTA. DOTA tiene el mismo problema, lectores, DotA es mucho peor en todo caso, por esto es que dota es mucho peor, porque b&aacute;sicamente,  esto es lo que est&aacute; mal en dota, lectores, quiz&aacute;s ni siquiera me crean esto, pero b&aacute;sicamente, en DOTA puedes reportas a alguien por abolutamente nada y tu report de verdad importa. Si a esa persona la reportan, onda, una cierta cantidad de veces, la dejan en baja prioridad. Sin importar lo que hayan hecho.  NO hay sistema, solo les tiras reportes y se quedan en ellos y como que ese es otro report hacia prioridad baja. As&iacute; que Dota est&aacute; mucho peor, porque de hecho a mi me han reportado un mont&oacute;n de veces por el equipo enemigo porque jugu&eacute; demasiado bien. Escrib&iacute;an el /all chat. Yo me ponia a hacer splitpushing y el enemigo decia como &quot;Hey, no debes hacer splitpush en este juego. No deberias estar haciendo splitpush. Yo iba como 23-0 mandando ni&ntilde;os en el basurero haciendo splitpush todo el juego. Poniendo tanta presi&oacute;n y el equipo enemigo estaba como &quot;No puedes hacer eso, amigo&quot;.  y me dieron low priority despu&eacute;s de ese juego. Fue la basura m&aacute;s absurda. 3 jugadores del equipo enemigo me reportaron, escrib&iacute;an en el chat en Espa&ntilde;ol como &quot;Broodmother...spider...Ara&ntilde;a no, y creo que dijeron algo de coque no s&egrave;  que significa eso en espa&ntilde;ol, quiz&aacute;s es un insulto en castellano pero, como sea,  DOTA est&aacute; mucho peor. Deber&iacute;as poder salir de las partidas, eso es practicamente todo. El sistema rankeds hace que el juego sea de forma tal que no hayan leavers en los games (ausentacias). Puede ser que haya gente que se ausente de las partidas, pero la gente no se va a ir sino hasta cuando el juego ya est&eacute; arruinado. Cr&eacute;anme. As&iacute;, eso es casi todo, lectores. \r\n\r\nEsa es mi opini&oacute;n en estos trascendentes asuntos. Yeah. \r\n\r\n\r\nOk, en una de mis escuelas escuela s&iacute; se pod&iacute;a salir durante el almuerzo pero despu&eacute;s cuando fui a la otra escuela no nos permit&iacute;an salir, y luego creo que cambi&oacute; la regla en mi escuela antigua. Creo que hay una ley, Creo que se convirti&oacute; es una ley estatal despu&eacute;s. Estaba mal porque antes, cuando era nuevo en la escuela no existian ninguna de estas leyes y todos lo s que eran mayores se iban y lo pasaban muy bien. Pero despu&eacute;s cuando yo llegu&eacute; a ser de los mayores ten&iacute;an todas estas reglas y basura. Bastante est&uacute;pido. Como sea\r\n\r\n\r\n--------","replies":[{"poster":"Ryoga","date":"2015-12-11T00:52:05.105+0000","up_votes":4,"down_votes":0,"body":"Resumen pls.","replies":[{"poster":"Lunari Red Mask","date":"2015-12-11T00:53:33.531+0000","up_votes":1,"down_votes":4,"body":"Hecho.","replies":[]}]},{"poster":"WáF WíthoütEquál","date":"2015-12-11T00:36:21.185+0000","up_votes":5,"down_votes":1,"body":"No.","replies":[]},{"poster":"Platinum491","date":"2015-12-11T00:44:08.837+0000","up_votes":6,"down_votes":2,"body":"Mucho texto, confuso y mal redactado, ademas de comparaciones inutiles con tu escuela y tu vida y experiencias personales","replies":[]},{"poster":"Lunari Red Mask","date":"2015-12-11T00:49:18.887+0000","up_votes":6,"down_votes":3,"body":"Para todo el que no quiera leer este post, un resumen:\nEl chico esta enojado porque no le van bien las partidas y desea que halla un sistema donde irse afk/abandonar por la excusa que quieras sea no reportable.\nAhora bien, respondiendo a tu post: te puse un negativo porque lo que decís no tiene sentido. Y todo es altamente discutible, pero por reglas del foro que yo respeto, no te puedo denominar de mala forma. Te aconsejo que moderes tu lenguaje y que hagas lo que quieras de tu vida sin incluir a los demás en tus decisiones. Sin embargo sí te vas afk/abandonas, espérate un report. Y es así como dices: los que están en elo bajo, lo están porque no merecen subir. Otros como yo, simplemente suben a pequeños pasos y aprenden.\nSaludos.","replies":[]},{"poster":" Acantha","date":"2015-12-11T00:43:00.072+0000","up_votes":4,"down_votes":2,"body":"¿Nos vienes a contar tu opinión de LOL o de tu vida cotidiana :p?","replies":[]},{"poster":"SunnShyn","date":"2015-12-11T00:39:58.451+0000","up_votes":3,"down_votes":3,"body":"mucho para leer, paso!","replies":[{"poster":"ZanahoriaAsesina","date":"2015-12-11T01:27:38.872+0000","up_votes":2,"down_votes":0,"body":"Sos la pachorra personificada jajaj!","replies":[]}]},{"poster":"Peace Sells","date":"2015-12-11T00:55:59.200+0000","up_votes":3,"down_votes":2,"body":"Intento interpretar tu texto, corríjame si me equivoco.\n\nSentís que league of legends es como un lugar donde no esta permitido salir una vez que ingresaste a una partida. Que esta mal que te baneen porque abandonaste una partida en la que nadie te obligo a entrar? \n\nSi vos no te llevas bien con la competitividad, este juego no es para usted!","replies":[]},{"poster":"Runth","date":"2015-12-11T08:06:39.707+0000","up_votes":1,"down_votes":0,"body":"no, pero los aburridos si","replies":[]},{"poster":"lordeman10","date":"2015-12-11T07:51:54.934+0000","up_votes":1,"down_votes":0,"body":"seria bastante triste que solo jueguen los que ganan por más que hipoteticamente se filtre correctamente seria desagradable que sean un monton de partidas abandonadas con solo los 5 jugadores que van ganando jugando y los otros afk \n\nla frustracion y el trabajo en equipo para salir adelante son parte del juego, la victoria no tendria sabor si tu rival no se resiste (mas dura la batalla mas dulce la victoria)","replies":[]},{"poster":"Landidzu","date":"2015-12-11T03:12:53.143+0000","up_votes":1,"down_votes":0,"body":"Nadie va a leer todo eso, ya desde el principio la redacción es pésima.","replies":[]},{"poster":"Ryoga","date":"2015-12-11T02:58:00.677+0000","up_votes":1,"down_votes":0,"body":"deporte? jaja les dire eso cuando me digan gordo xd","replies":[]},{"poster":"Starleon","date":"2015-12-11T02:49:02.419+0000","up_votes":1,"down_votes":0,"body":"El LoL es JUEGO para unos, DEPORTE para otros. Està en uno decidir si vale la pena o no.","replies":[]},{"poster":"Jhin Freecss","date":"2015-12-11T01:43:34.217+0000","up_votes":1,"down_votes":0,"body":"TL:DR","replies":[]},{"poster":"waffen SS","date":"2015-12-11T01:39:02.114+0000","up_votes":1,"down_votes":0,"body":"a mi me acaba de tocar un velkoz troll recien pero a pesar de darle 2 kills al mid rival, la linea la gane asi q fue a trollear al bot donde se suponia q era suport, no contento con eso por q vio q la linea la gane y ayude a la linea de bot, volvio a mid a trollear y regalar kills","replies":[]},{"poster":"Are You Oky","date":"2015-12-11T01:34:22.453+0000","up_votes":1,"down_votes":0,"body":"lo q quiero decires q esta muy mal redactado por favor un resumen de alguien q sepa escribir compresivamente","replies":[]},{"poster":"Zevko","date":"2015-12-11T04:05:44.268+0000","up_votes":1,"down_votes":1,"body":"si te divierte, juga.\nSi no te divierte, no jueges.","replies":[]}]}