{"poster":"WeedKhalifaBro","date":"2018-12-15T13:01:02.505+0000","title":"Új büntetés rendszer?!","up_votes":2,"down_votes":1,"body":"Nem is tudom, tal&aacute;n itt van &eacute;rtelme elmondani a gondolataimat, &eacute;szrev&eacute;teleimet, mivel nap mint nap azzal szembes&uuml;l&ouml;k, hogy 1-1 ember eg&eacute;szen k&ouml;nnyed&eacute;n rontja el az eg&eacute;sz j&aacute;t&eacute;k&eacute;lm&eacute;nyt ak&aacute;r az eg&eacute;sz csapatnak.\r\nV&eacute;lem&eacute;nyem szerint ezt pedig, hogy emberek apr&oacute; kis dolgok&eacute;rt is m&aacute;r r&aacute;kot k&iacute;v&aacute;nnak a j&aacute;t&eacute;kosoknak &eacute;s az eg&eacute;sz csal&aacute;djuknak &eacute;s hallva sz&uuml;letett gyerekeket, az nem elint&eacute;zhető annyival a supportok r&eacute;sz&eacute;ről, hogy kapnak egy &uuml;zenetet a j&oacute;l ismert &quot;mindenkinek lehet rossz napja&quot; sz&ouml;veggel vagy NE ADJ ISTEN 3 meccsre megvon&aacute;st a chat funkci&oacute;k al&oacute;l...\r\nIgen is ezt a riotnak k&eacute;ne valahogy kord&aacute;ban tartania &eacute;s nem nekem győzk&ouml;dni az utols&oacute; rosszindulat&uacute; kis pondr&oacute;t is, hogy ugyan m&aacute;r ne k***a any&aacute;zz, ugyan m&aacute;r ne hagyd el a j&aacute;t&eacute;kot, ugyan m&aacute;r ne &ouml;lesd meg magad direkt..\r\n&Eacute;n szem&eacute;ly szerint, b&aacute;r lehet csak &eacute;n vagyok rossz indulat&uacute;, de a hasonl&oacute;kat akik &aacute;tkoz&oacute;dnak, csal&aacute;dtagokat szidnak, ugyan &uacute;gy mint azt aki kil&eacute;p a meccsből, hogy legal&aacute;bb 5x 20percet kapjon minden meccskeres&eacute;sre, arr&oacute;l nem is besz&eacute;lve, hogy legal&aacute;bb hetekre eltiltan&aacute;m a chattől..\r\nszerintetek?","replies":[{"poster":"Gresident","date":"2018-12-15T14:15:38.798+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem? Harmadolódna a játékos állomány, meg 10+perces meccskeresések lennének!\nIlyen a játékos \"közösség\"... a szándékosan hülyéket én is szidom (kulturált kereteken belül, idiot, retard, pls uninstal lol...)\n\nMondjuk nexux blitzen különösen hozzájárul az is, hogy képes 4-500MMR csapatot eltérést is felállítani, ilyen platina + dia vs silver + gold + unranked.","replies":[{"poster":"M4dr4c","date":"2018-12-15T16:21:21.437+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mert teljesen más matchmaking van rankedhez és a nexushoz. A kettőnek semmi köze egymáshoz, így az MMR-nek se.","replies":[{"poster":"Gresident","date":"2018-12-15T16:27:37.624+0000","title":null,"up_votes":2,"down_votes":0,"body":"Rankeden is pont ugyanez van, ha visszább nézel pár témát írták is, hogy flexen is összevissza dobál be. \nNem tudom miért kell védeni azt, ami sz@r, már az szar, hogy valaki lehet az egyik MMRen Dia mester stb, a másikon meg bronz.\nAz egész rankedrendszer egy TRAGÉDIA.","replies":[{"poster":"M4dr4c","date":"2018-12-15T18:04:11.647+0000","title":null,"up_votes":1,"down_votes":0,"body":"Itt most nem arról volt szó, hogy jó a rendszer vagy sem, hanem, hogy mit írtál annak nem sok értelme van, hisz két külön MMR-ről beszélünk. Főként, hogy valaki lehet diamond szinten akkor is, ha sose játszott még rankedet...","replies":[{"poster":"Gresident","date":"2018-12-15T19:38:22.495+0000","title":null,"up_votes":3,"down_votes":0,"body":"Ne nevettessük már ki magunkat... majd mindjárt jön az is, hogy eltérő tudás kell a két szinthez... tisztában vagyok vele, hogy ez a nagyon jól működő rendszerben külön van MMR, de azért nézzük már azt is, hogy ha valaki soloban dia mester stb szinten van, flexen meg bronzba, akkor a nem sok értelmet én is aláírom, csak az ellenkező szemszögből.\n\n**Ez biztosan azért van, mert a más játék módokra másfajta tudás kell, lásd a solo és a flex közötti eltérést. **{{sticker:zombie-brand-mindblown}} \n\nHa mindenhol más MMR van, akkor meg aztán tényleg fölösleges a rang, tiszta szégyen hogy 1400+ vs 1900+ csapatokat állít össze a machmaker, és ezt ennyivel megmagyarázzuk, más MMR...  \n\nMagyarán ez a normális:\nPlayer 1 Solo Mester / Flex Bronz\nPlayer2 Solo Gold / Flex Platina\nÖsszeengedjük őket 1-1 játékra...\n\nTehát soloban a Player 1 fog győzni Mester Platina ellen, flexben meg a 2es, mert Bronz ellen van Platina, és ezt adják ki az MMR értékek...\n\nEz kb az a szitu, hogy délelőtt agysebész, délután meg a műtőt takarítja...","replies":[{"poster":"Temp65432","date":"2018-12-18T08:43:48.882+0000","title":null,"up_votes":2,"down_votes":0,"body":"Sajnos a small indie company még nem jutott el arra az agyi szintre, hogy az egyik gamemode befolyással legyen a másikra. Számukra logikus, hogy ha egy challenger top 1 játékos elindítja a 3v3at akkor ott bronz szintű lesz, mert még életében nem játszott vele. Ne csodálkozz, pont ugyan annyira van elbaszva a matchmaking mint minden más amihez hozzányúlnak az inkompetens kezükkel.","replies":[{"poster":"nr1Red","date":"2018-12-18T12:10:37.085+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem tévedsz. A te op.gg-d is azt mutatja hogy mindegy hogy milyen módban játszol, hasonló soloq szintű játékosokkal dob össze. Tehát nyilván a soloq rangod hatással van a többi game mode-ra. Én a büdös életbe nem játszottam 3v3-at, mégis az előző szezonban lejátszottam a besorolókat és dettóra ugyanolyan soloq-s rangú emberekkel dobott össze mint a többi játékmódban.\nNormalon, aramon, most a blitz-en kicsit eltérőbb, de mégis mindig ugyanolyan soloq-s rangú emberekkel dob össze. Tehát nettó baromság az hogy egy challenger játékos bronzosokkal játszhat mondjuk aramon, mert ő még nem aramozott soha...hülyeség.\nItt van a blitz mód, a legjobb példa, még elég új tehát elvileg a te/ti elméletetek szerint a soloq bronzost símán összedobná a soloq diással akár...és most nézd meg hogy te milyen soloq rangú emberekkel játszol blitzet és nézd meg hogy én milyen soloq rangú emberekkel játszok blitzet...Mivel hasonló a winrátánk, így mint új mód, ugyanolyan soloq rangú emberekkel kellene hogy játszunk mind a 2-en, de nem így van. Ergo a játékosok rangsorolása globális kell hogy legyen, és a különböző játékmódok mmr-je egymásra muszáj hogy hatással legyenek és ez látszik is ha átböngészel egy-két op.gg oldalt.","replies":[{"poster":"Knight Thyme","date":"2018-12-18T14:22:04.625+0000","title":null,"up_votes":1,"down_votes":0,"body":"De ezzel nem cáfoltad meg az állítását. Ő azt mondta, ha valaki új játékmódba kezd, akkor az ottani rankját nem határozza meg a többi játékmódban elért eredményei. \nNerd sokat játszik normálon, mivel nyilván nem felejti el a játéktudását a normálra, ezért aszerinti játékosokkal dobja össze a gép. Ha jönne egy új játékmód, amivel Nerd elkezd játszani, az elején mindenfélével összehozná.\n\nSimán megtörténhet, hogy flexelsz silverben és ott jön veled szembe soloQ-ban diás, mert csak most vette a fáradtságot, hogy elkezdjen foglalkozni a flex rankjával (vagy mert eltrollkodja és szórakozásra használja a flexet).","replies":[{"poster":"nr1Red","date":"2018-12-18T22:34:31.306+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem meg de, megcáfoltam. Soloq silveresként, más játékmódokban találkozok diással, de elvétve. De biztos vagyok abban, hogy ha soloq goldos lennék..akkor már még több alkalommal találkoznék diással más játékmódokban és ha meg diás lennék, mint ahogy Nerdcore az...majd minden meccsemen találkoznék velük. \n\nÉs jött egy új játékmód, a blitz. Ő soloq diásként, jóval többször találkozik szintén soloq diás játékosokkal..mint mondjuk én. Ez csak azért lehet, mert a soloq-s, vagy gondolom bármelyik másik preferált játékmódban elért eredményeid hatással vannak a többi játékmód meccskeresésére. Ha nem így lenne, akkor sokkal de sokkal nagyobb káosz lenne mint ami most van :)","replies":[{"poster":"Knight Thyme","date":"2018-12-20T08:21:44.214+0000","title":null,"up_votes":1,"down_votes":0,"body":"Latom, hogy a masik szalon megcafoltak es elfogadtad.","replies":[]},{"poster":"ScreamForMeBaby","date":"2018-12-19T19:51:42.372+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mikor sötét kocka korszakomat éltem és felmentem diamondba, akkor soloQ-n diamond/platina ellenfeleim voltak. 3v3-t életemben játszottam összesen 20 alkalommal, de az egyik cimborám imádja, évente kb 2 alkalommal én is csatlakozom hozzá. Ott unranked, bronz, silver ellenfeleket kaptam. Történetesen azért, mert az mmr-em abban a játékmódban gyakorlatilag a friss accokkal megegyező volt.\n\nMásik példa: Szintén sötét kocka korszakomban kvázi csak rankedeztem, nyomtam, mint a hülye. Normálra baromkodni jártam fel a cimborákkal, ott próbálgattam main suppként az ap-yasuom, meg a first time Rivenem. A normálos mmr-em le is ment a béka segge alá úgy, hogy minden meccsen kaptam a sok oltást, hogy mit keres a silver-gold mezőnyben ez a hülye diamond.\n\nA különböző játékmódoknak semmi közük egymáshoz. Sőt, normálon a premadek totál bezavarják a dolgot. A dia1-es haver játszik a silver5 cimborájával egy meccsen(Ez ugye jelenleg csak normálban kivitelezhető, ezért lehetnek baromi nagy eltérések a játékosok között mind a két csapatban, és ezért nem mérvadó a normál). Erre te mit látsz goldosként? Hogy dia1 ellenfeled van. Ebből levonhatnád a számodra tetsző következtetést, hogy neked Dia mmr-ed van, holott nem. Vagy levonhatnád azt, hogy ez a dia1 nem is igazi dia1, csak a másik játékmódban 10000-ből 99999 alkalommal mázlija volt, és véletlenül dobta fel odaa rendszer, pedig nem erről van szó. Hanem arról, hogy te vagy a dia1 és a silver5 premade átlaga, ezért kaptak téged ellenfélnek. De ezeket már leírták kb 2000 alkalommal, havi szinten.","replies":[]}]}]},{"poster":"Temp65432","date":"2018-12-18T15:36:28.109+0000","title":null,"up_votes":1,"down_votes":0,"body":"Te hol látod azt, hogy én mindegy milyen módban játszok ugyan olyanokat kapok? Csak hogy összefoglaljam az elmúlt pár hét/hónap tapasztalatait.\n\nSoloqba átlagosan plat 1- dia3 kapok. Ez gondolom kb a reális szint amin játszok.\n\nNormal 5v5ben: Teljesen random, silver - dia tetejéig minden megtalálható teljesen hasraütésszerűen szétosztva. Pl az utolsó meccs amit játszottam (d4/én-g4,g4,unranked,g4 <->  d4, d3,d4,g1,p4). De mondhatnám az előtte levő 2 meccset is ahol a legalacsonyabb silver3, a legmagasabb pedig d1 volt. Változó, hogy épp melyik csapatba melyik kerül ,tehát még csak azt se mondhatod, hogy rendszeresen ugyan olyan szintűek a csapattársaim. Erről süt, hogy nem veszi figyelembe a ranked divet normal matchmakingnél. Különösen, hogyha azt nézed, hogy egy unrankednek ha fejenáll se lesz olyan mmrje mint egy rankednek lévén, hogy nem rankedezett még.\n\nDe nézzük csak tovább, mert kerestem még pár érdekes dolgot.\n\nNexus blitz: g4,p4,iron2,d4,g4 <->d4,p4,d4,d4,p4, majd egy meccsre rá teljesen megfordulva g4,g2,d4,d3,p3 <-> ur, s4,d1,ur,p4. Megintcsak ha feltételezzük, hogy egy meccs alatt nem változott jelentősen az mmrem akkor semmi értelme, hogy miért volt két ennyire különböző csapat.\n\nÉs akkor a kedvencem, amiről már sajnos konkrét számadataim nincsenek, mert még season zárás előtt lejátszottam a 3v3 besorolóimat.\nA szintén dia4 és gold4 premade társaimmal elkezdtem 3v3 rankedet játszani, és az egész besoroló alatt bronze teteje/silver alja enemyket kaptunk.\n\nNemtudom, hogy te kinek az opggjét nézted, de ha te ebben látsz bármiféle rendszert akkor gratulálok.  Az égvilágon semmi logika sincs abban, hogy minden meccsen teljesen random kapom a csapattársakat/enemyket. Egyszer dia, egyszer master, majd utána iron. Ez csak és kizárólag akkor lenne lehetséges ha minden meccs után jelentősen változna az mmrem (amit garantálok, hogy nem változik lévén, hogy 10k+ meccset toltam le eddig életemben tehát nem fog rajta 1-1 meccs jelentősen változtatni).\nBár megmondom őszintén egészen lenyűgöző, hogy 8 éve ugyan olyan használhatatlan a matchmaking és még mindig vannak emberek akik megpróbálják belemagyarázni, hogy mmr így meg mmr úgy :D \n\nui: arra is nagy összegeket mernék tenni, hogy az unranked 35ös szintű csapattársamnak nem volt többezer meccsből 53+% winrateje mint nekem, tehát sanszos hogy a normal mmres faszság amit annyira szerettek emlegetni is megbukott.","replies":[{"poster":"nr1Red","date":"2018-12-18T22:22:38.088+0000","title":null,"up_votes":1,"down_votes":0,"body":"Most elbeszélünk egymás mellett, én egyáltalán nem arról beszéltem hogy milyen a matchmaking. Én egy mondatodra reflektáltam, miszerint nincsenek a különböző játékmódok rangsorai összefüggésben. Tehát nem a matchmaking-et akarom védeni, csak szerintem igenis van kapcsolat a játékmódok rangsorai között. Amit szerintem bizonyítottam is, te soloq diás-ként, más játékmódban is leginkább a soloq-s szinted beli játékosokat kapsz, persze vannak eltérések hiszen azok mégsem soloq-k.\nA blitzet mondtam is hogy ott nagyobb az eltérés, de ott is te jóval több soloq diással találkozol, mint én valaha is fogok :) És ezt biztos hogy nem a kisujjából szopja ki a matchmaking rendszer, csak a soloq-s rangodból fakadóan történhet.\n\nAzt meg én is nagyon jól tudom hogy nem a legfaszább a rendszer, nagyon sokszor teljesen egyenlőtlenül rakja össze a játékosokat..ezzel nem is akarok vitatkozni.","replies":[{"poster":"Temp65432","date":"2018-12-19T09:35:12.048+0000","title":null,"up_votes":1,"down_votes":0,"body":"Össze vissza beszélsz ember...mondod, hogy az hogy én diásokat kapok bizonyíték arra, hogy a quek összefüggnek, csak épp azt már kihagyod a mondatból , hogy ugyan abba a matchben ahol én diást kapok van 20as szintű is meg iron 2es is (akikkel meg nyilvánvalóan nem függ össze, csak azt a részét már lefelejtetted az érvelésednek) Elárulom neked a nagy titkot, azért kapok normalon nagy dives enemyket mert sokat normalozok és magas a winratem, tehát nem sok köze van a soloq rankomhoz. Ha tényleg normálisan működne a rendszer és a que mmrek összefüggésbe lennének akkor nem lenne olyan, hogy rendszeresen bekerül a játékba 1-2 kis dives/kezdő/etcetc vagy az , hogy bemegyek 3v3ra és megkapom a full bronz/silver csapatokat csak azért mert összesen 20gamet játszottam eddig 3v3on. Ja és azt még hozzá teszem, hogy nincsenek premadebe, direkt megkérdeztem.","replies":[{"poster":"nr1Red","date":"2018-12-19T11:31:35.825+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ámen, legyen akkor neked igazad.","replies":[{"poster":"M4dr4c","date":"2018-12-19T12:22:49.106+0000","title":null,"up_votes":1,"down_votes":0,"body":"Neki van igaza tényleg, az MMR-ek közt semmi kapcsolat nincs.","replies":[{"poster":"nr1Red","date":"2018-12-19T23:53:26.054+0000","title":null,"up_votes":1,"down_votes":0,"body":"Tudom, a szarkazmus csak a stílusa miatt volt. Egyébként elolvastam a support oldal mmr-el foglalkozó részét ami elég egyértelműen fogalmaz.\n\"A játékos minden várólista esetében külön MKP-val rendelkezik, tehát az egyik várólistán elért eredmény a többit nem befolyásolja.\"\n\nBár az én tapasztalatom ennek a szöges ellentéte, de attól még elfogadom..a probléma az én készülékemben van :)","replies":[]}]}]}]}]}]},{"poster":"Gresident","date":"2018-12-18T13:49:59.474+0000","title":null,"up_votes":1,"down_votes":0,"body":"[https://p1.picsto.re/oJvgs.jpg](https://p1.picsto.re/oJvgs.jpg)\n\nEnnyire függ össze... és nem ez a legnagyobb eltérés...","replies":[{"poster":"nr1Red","date":"2018-12-18T22:48:05.546+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ez egy tökéletes példa arra hogy lehetne jobb is a matchmaking...de az én kommentemhez nem sok semmi köze van.\n\n\n\nMi van veletek? Én szedek itt egyedül béres cseppet? Tényleg senki nem érti hogy miről beszélek? :D","replies":[]}]}]}]}]}]},{"poster":"Complex VN","date":"2018-12-15T16:41:11.900+0000","title":null,"up_votes":2,"down_votes":1,"body":"> Nem tudom miért kell védeni azt, ami sz@r, már az szar, hogy valaki lehet az egyik MMRen Dia mester stb, a másikon meg bronz.\n\nAzért lehet, mert semmi köze a két queuenak egymáshoz.","replies":[{"poster":"Storiaron","date":"2018-12-15T21:15:14.426+0000","title":null,"up_votes":2,"down_votes":1,"body":"They hated Jesus because he told them the truth","replies":[]}]}]}]},{"poster":"WeedKhalifaBro","date":"2018-12-15T15:29:39.238+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hát igen, az is külön kategória ahogy az mmr-t állítja össze, alapból ha rangsorolt meccsen nem egyedül játszol, gyengébb lesz a csapat maradék tagja pl: silver, gold alja, míg az ellenfél platina..","replies":[]}]},{"poster":"4444444","date":"2018-12-22T09:43:35.911+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nálam személyes preferencia ha nem a játékkal kapcsolatos információkkal oszt meg mondjuk go dragon, jungle top side, nincs flash top-on vagy nonstop phus-ol tudsz gank-olni hanem pingel meg mindenkit szid hogy szar akkor azt az embert mute-olom 2 ilyen után. Nem az egész csapatod toxic mert egy ember rage-el.\n{{sticker:sg-ahri-3}}","replies":[]},{"poster":"ScreamForMeBaby","date":"2018-12-17T23:14:02.517+0000","title":null,"up_votes":1,"down_votes":0,"body":"Egyszerű, pénz.\n\nA Riot kb 4 éve nem próbálkozik azzal, hogy tartalmat gyártson, vagy minőséget mutasson fel. Minél több embert akart behúzni, bármi áron. Minden egyes filter/szűrő csökkenti a fizető játékosok számát. Nem az érdekli a Riotot, hogy hányan szidják egymás %%%%% anyját, és hányan mesélnek arról, hogy hogyan vágták análba egymás anyját, hanem, hogy hány ember vesz skineket. \n\nMegjegyzés: Éveken át tűrt a közösség, elnézte ezeket, mert hazudtak az összes platformon. \"Készül az új rendszer, ami majd visszaszorítja ezt\". \"Működik a rendszer most is, csak hát elkerülhetetlen, hogy néha valakinek rossz napja legyen\". Látod itt a fórumon is, hogy hányan hazudnak erről. Holott mindenki aki rendszeresen játszik a játékkal, tudja, hogy ez nettó hazugság. A játékosok pedig tűrtek, most meg lépnek. Ezért látod már jó ideje a Riot kapkodását, értetlenségét. Ezért kérdezi meg a kliensben, hogy jól szórakoztál-e, mennyire szórakoztál jól, mi az ami zavart, stb. Még most is tettetik a hülyét. De ne tápláljon senki hiú reményt, nem lesz új rendszer. A jelenlegi pedig mint látjuk, nem működik. Ez a büdös %%%%% anyázást a játék és a fórum nívója, ennyi az egész.","replies":[]},{"poster":"Mind The Gap","date":"2018-12-15T15:11:25.689+0000","title":null,"up_votes":1,"down_votes":0,"body":"Tudtommal kapnak büntetést. Egy sráccal egyszer premadeltem 1 meccs erejéig, aki annyiért chat restrictiont kapott, hogy beírta, hogy “uninstall game”.","replies":[{"poster":"WeedKhalifaBro","date":"2018-12-15T15:30:45.998+0000","title":null,"up_votes":1,"down_votes":0,"body":"Töredékük, csak vedd azt alapul, hogy ha büntetésre kerül egy általad jelentett játékos, te üzenetet kapsz róla, én napi szinten kb 5-10 jelentést küldök, és heti 1-2 üzenetet, hogy intézkedés történt feléjük...","replies":[{"poster":"Knight Thyme","date":"2018-12-15T19:22:31.162+0000","title":null,"up_votes":1,"down_votes":0,"body":"Vannak toxic ismeroseim, latom, ahogy cserelodnek az accountjaik. A rendszerben van tolerancia, mert tenyleg lehet rosszabb idoszaka valakinek, meg sok a false report is.\n\nAmugy amig pondronak hivod oket, te se vagy sokkal jobb naluk :(","replies":[{"poster":"WeedKhalifaBro","date":"2018-12-16T14:55:54.663+0000","title":null,"up_votes":2,"down_votes":2,"body":"Szóval a pondró kifejezés egyenértékű azzal hogy azt kívánod hogy valakinek a rákos anyja szüljön halott csecsemőket?\nAhogy gondolod...:)","replies":[{"poster":"Knight Thyme","date":"2018-12-17T11:29:57.804+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem írtam azt, hogy egyenértékű, de nem sokkal jobb, ha mindenféle néven hívod őket, ugyanúgy toxikus viselkedést mutatsz, csak más mértékben teszed.","replies":[]}]}]},{"poster":"M4dr4c","date":"2018-12-15T16:20:05.831+0000","title":null,"up_votes":1,"down_votes":0,"body":"Csak akkor kapsz visszajelzést, ha a te reportod volt az utolsó, ami kellett a büntetéshez, ha jól tudom.","replies":[]}]}]},{"poster":"The One ESCANOR","date":"2018-12-16T19:21:46.992+0000","title":null,"up_votes":1,"down_votes":0,"body":"Erre mondják azt hogy ami késik az nem múlik :D Szóval lehet hogy jó néhány meccset végig flamelnek a játékosok de egyszer csak arra kelnek hogy chat ban/14 napos kitiltás/végleges kitiltás és nem is kell már többször játszani a játékkal :) Sőt amilyen balszerencsések ezek a flamerek a kitiltás előtt biztos hogy költöttek valamennyit a játékra ( mert az ilyenek mindig költenek :D ) és az is megy a levesbe.\n\nMegnézünk más felkapott játékokat pl. CSGO, Overwatch, WOW, Fortnite, Dota 2 szerintetek ott mennyire bannolnak egy \"KYS\" vagy \"motherfucker\" kifejezés miatt ? Semennyire...mondjuk a CSGO-nak szerintem sokkal rosszabb toxikusabb közössége van mint a LoL-nak. Ami persze nem magyarázza meg azt hogy a LoL-nak a közössége szimplán csak nem hisz abban hogy bannolnák őket pár sor flame miatt is. \n\nElég ha csak itt fórumon visszatekerünk a Novemberi témákra mikor szezonzárás volt. Napi szinten volt 1-2 topic ami arról szólt hogy az illető flamelt és nem tudja hogy kap-e jutalmat majd :D","replies":[]},{"poster":"Jack Eron","date":"2018-12-16T09:23:13.075+0000","title":null,"up_votes":1,"down_votes":0,"body":"Van olyan ismerősöm, aki napi szinten, szinte kivétel nélkül %%%%%anyázik, hacsak valaki, mondjuk a jungle gank közben elvisz 1-2 farmot. A killek elviteléért szinte mindig flamel. Nem spammeli szét a chatet, 1 vagy 2 alkalommal írja be.\n\nLevel 5 honornál jár.\n\nÉn egy hosszabb vita után, ahol érvelek, és megkérdezem, miért kell 7. alkalommal is 1v1re kényszeríteni azt, aki már zsinórban 6x elvert, bannt kapok. A támogatás szerint a szarkazmus és az \"oktató jellegű\" megszólalás nem megengedett, de ez az ismerősöm mások családtagjait sértegeti rendszeresen, és életében nem kapott semmiféle büntetést, és a legdicsőségesebb emberek között van? :D Hát igen, ez ilyen.","replies":[]},{"poster":"zznoid","date":"2018-12-16T08:23:02.989+0000","title":null,"up_votes":1,"down_votes":0,"body":"/mute all  :)","replies":[]},{"poster":"Kai Keiki","date":"2018-12-15T19:27:52.459+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az a legnagyobb baj a játékosok bizonyos hányadával hogy messze nem veszik komolyan a büntetés-végrehajtás rendszerét. Amíg nem veszik észre Demoklész (a Garen ulti talán találóbb. Nem?) kardját, ahogy a fejük fölött süvít el, addig menni fog tovább egymás zaklatása.\nA legtöbbjük még öt percet se szán arra, hogy a Summoners Codexet átolvassa, még így, a rövidített változatra se szánnak időt. De mégis mit várunk mi? Ha arra nem képesek hogy előbb gondolkodjanak, aztán írjanak, mégis hogy vennék rá maguk hogy felnézzenek a fórumra, vagy elolvassanak bármit is a weblapon?\nVéleményem szerint csupa meggondolatlan, emberségben megkérdőjelezhető személyiség az összes. Legalábbis nem tartom sokra azt, aki képes más családját átkozni.\nAmi pedig azt illeti, már egy caps on-ban irt noobozás is fel tud bosszantani. ha pedig kérésre se képes moderálni magát, én már reportolom is, mert velük ellentétben, én hiszek abban, hogy ennek nem az a célja hogy az épp rosszul teljesítőket vagy netán a kimagaslóbbakat szabotáljuk, hanem hogy a hozzájuk hasonló méregzsákokat moderáljuk.","replies":[]}]}