{"poster":"Her slave","date":"2018-11-13T05:12:41.582+0000","title":"¿Recompensas de final de temporada? ¿Las hay para honores 0 como yo?.","subforum":"Charlas Generales","up_votes":5,"down_votes":1,"body":"Hola, tengo esa duda. Porque recien me salto el cartel de que termino la temporada y bla bla bla no se que, pero no me dio el marco y la skin :(\r\nSoy honor 0 desde que lo implementaron y no pude subir ni a 1 todavia.\r\nBye :D","replies":[{"poster":"AC Wolf","date":"2018-11-13T05:25:31.551+0000","up_votes":2,"down_votes":0,"body":"Buenas!\n\nNo quiero ser portador de malas noticias :'(, pero para recibir las recompensas de final de temporada ( y esto incluye el marco) tenías que terminar la season con un honor de 2 o superior ^^.","replies":[{"poster":"xbulkix","date":"2018-11-13T06:10:12.500+0000","up_votes":2,"down_votes":2,"body":"No consideran los que quedaron honor 1 3/3? Estuve toda la semana ocupado como para llegar a honor 2 y sé que a nadie le importa, pero alguien que no llegó por nada a honor 2 y quedo honor 1 3/3 no merece nada?","replies":[{"poster":"AC Wolf","date":"2018-11-13T06:16:18.756+0000","up_votes":1,"down_votes":0,"body":"Podría consultarlo en el soporte, pero dudo mucho que se de, ya que en su post oficial explicaron que no habría excepciónes.","replies":[{"poster":"OneTrickDiana","date":"2018-11-13T08:16:51.983+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=AC Wolf,realm=LAS,application-id=v7qsfXsE,discussion-id=xBF3lJfp,comment-id=000300000000,timestamp=2018-11-13T06:16:18.756+0000)\n>\n> Podría consultarlo en el soporte, pero dudo mucho que se de, ya que en su post oficial explicaron que no habría excepciónes.\n\nyo tuve UN SOLO  ban de chat en todo el año, el cual me dejo honor 0 y ahora me quedo sin marco, nunca hacen nada bien en riot games -.-","replies":[{"poster":"Akari Kuro","date":"2018-11-13T12:53:48.333+0000","up_votes":1,"down_votes":0,"body":"no tengas ban chat vos, nunca nada bien estos jugadores","replies":[{"poster":"OneTrickDiana","date":"2018-11-13T18:43:01.472+0000","up_votes":1,"down_votes":0,"body":"si redactaras mejor, capaz entiendo","replies":[]}]}]}]}]}]},{"poster":"rafihttta","date":"2018-11-13T05:24:21.098+0000","up_votes":2,"down_votes":0,"body":"Usted se porto mal, así que se queda sin nada.","replies":[]},{"poster":"giotatengue","date":"2018-11-13T05:23:16.752+0000","up_votes":2,"down_votes":1,"body":"No, no te lo dan. Igual tarda al rededor de 2 semanas en entregar las recompensas, asi que si estuvieras en honor 2 tampoco las tendrias.","replies":[]},{"poster":"Her slave","date":"2018-11-13T17:35:45.798+0000","up_votes":1,"down_votes":0,"body":"A mi una vez me dieron ban de chat por \"Toxicidad\" porque cante en el chat general cuando tenia la posibildad de hacerlo durante la partida (mientras estaba muerto por ejemplo). Con eso dejo en evidencia lo mal que funciona el sistema de baneos.\nMe puse a cantar canciones Argentinas (sin insultos) mientras estaba muerto, mi idea era comprobar si me baneaban a pesar de que no insulte.\nLo más irónico de todo es el cartelito que te salta con los mensajes \"tóxicos\" xD\n\"Ella durmio, al calor de las masas, y yo desperté, quieriendo soñarla...\"\n\"La ruta semi-vacía como mi vida sin vos...\"\n\"Empieza el ritual, nadie dice nada pero, yo lo siento igual...\"\nNo puedo creer, cuantos insultos. ¡Bien hecho Riot Games!\nLos reportes los tenía por bronca de los demás jugadores y esa necesidad de culpar a alguien por la derrota (Todos lo vivimos partida tras partida, si vas perdiendo siempre se pide report para vos u para otro). En fin, la cuestión es que el sistema de baneos automatizado es malo, si juntas muchos reportes y detectan mensajes en el chat, vas adentro.\nSaludos.","replies":[]},{"poster":"Kata Killer","date":"2018-11-13T08:10:24.890+0000","up_votes":1,"down_votes":2,"body":"me gustaba la idea del honor por parte de los fragmentos de llave, o cofres etc. etc, pero nunca pense que seria sin sentido eso de terminar la temporada con honor 2 :/ es algo realmente inesperado","replies":[{"poster":"Kata Killer","date":"2018-11-13T08:10:44.085+0000","up_votes":1,"down_votes":0,"body":"y yo que queria mi marco u.u tanto para nada","replies":[{"poster":"Akari Kuro","date":"2018-11-13T12:54:36.321+0000","up_votes":1,"down_votes":0,"body":"lo dijieron desde el primer dia...","replies":[]}]}]},{"poster":"Akari Kuro","date":"2018-11-13T12:52:23.349+0000","up_votes":1,"down_votes":0,"body":"nos vemos amigo, tenes que ser minimo honor 2 para tener algo de las recompensas","replies":[]},{"poster":"MoonGL","date":"2018-11-13T05:13:15.762+0000","up_votes":1,"down_votes":0,"body":"no uwu","replies":[]}]}