{"poster":"ElXandresX","date":"2016-02-20T21:01:18.622+0000","title":"Sobre LoL y su historia. Un dilema, una solución.","subforum":"Charlas Generales","up_votes":16,"down_votes":4,"body":"Te he de advertir, este post es largo. Es una sugerencia a largo plazo, que no puede ser implementada de la noche a la ma&ntilde;ana, pero si obtiene un buen feedback puede ser muy ben&eacute;fica para todos y cambiar&iacute;a el como vemos al juego. En el futuro intentare agregar algunas im&aacute;genes para hacer menos densa la lectura. Por lo m&aacute;s, agradezco su tiempo y comprensi&oacute;n.\n\nLlevo ya un buen tiempo jugando League of Legends, juego que me ha traído buenos momentos y agradables horas de entretención. Pero siendo franco, el juego carece de algo fundamental para considerarse “completo”, cosa que viene siendo una historia consistente.\n¿Qué podría ser una historia consistente? No soy alguien muy versado en las palabras, pero en mi comprensión de estas, vendría siendo una historia que se logre mantener con el tiempo de modo que los hechos tengan su origen, su efecto y su consecuencia en el mundo de Runaterra, sin mencionar que perdure a medida progresa el juego.\nSobre el pasado y el presente\nEntremos un poco en contexto para tener claro el problema:\nhttp://i.imgur.com/tYzbppm.jpg\nComo muchos recordaran, en sus inicios existía propiamente la “Liga de Leyendas”, organización sin banderas que reunía a campeones de todo el mundo, que representan ya sea a su nación o sus propios intereses. Puedo estar equivocado, y agradecería si me corrigen esta parte, pero si no me equivoco la cosa funcionaba más o menos así:\n1.\tExistía un conflicto que se estimaba iba a dejar consecuencias nefastas sobre el continente y sus naciones.\n2.\tSe establecían 2 grupos de a 5 campeones que representaban cada parte del conflicto.\n3.\tEn el denominado “Instituto de Guerra”, un grupo de 5 invocadores por bando (nuestros avatares ingame), personas con grandes poderes mágicos, establecían un vínculo con alguno de los campeones, permitiendo que vieran a sus compañeros, se comuniquen a distancia con ellos, etc. todo con tal de ganar.\n4.\tLos invocadores protegían a sus campeones, de modo que si uno estaba a punto de morir realmente lo retiraban del combate y con sus poderes les restauraban para que pudieran volver a salir y continuar la lucha (véase las cinemáticas originales).\n5.\tDespués de la ardua lucha, se destruía uno de los nexos de alguno de los 2 bandos y se daba por terminado el conflicto, de modo que el impacto en Runaterra fuera mínimo (en esencia el juego como lo conocemos, implicando además la historia).\nhttp://i.imgur.com/lizL4Lt.png\nSobre los invocadores, vale la pena destacar que sus poderes mágicos en conjunto superaban de sobre manera a todo lo conocido, pues no todos los campeones de la liga estaban “voluntariamente”, si no que más bien campeones como Nocturne, Xerath o Cho’gath estaban siendo contenidos (razón por lo que Cho no ha seguido creciendo de forma desproporcionada). ¿Qué ejemplo puede haber del gran poderío de los invocadores? Bueno, campeones como Kayle o Morgana, son entes celestiales cuyo poder está más allá de la comprensión de un humano corriente, pero aun así de acuerdo al lore de aquella época, Kayle ofreció 10000 años de sus servicios a la Liga con el fin de que no intervinieran en su tierra. ¿No es suficiente? En su antiguo lore, Nasus y Renekton eran alienígenas con poderes cósmicos incontrolables; con tal de que su caos no afecte a Runaterra los invocadores usaron sus poderes para traerlos al instituto de guerra, donde podían vigilar que no fueran a destruirlo todo en sus enfrentamientos. En alguna parte se mencionó que esos dos eran hermanos, hecho que solo hiso más confusas las cosas…\nhttp://i.imgur.com/dKthyF3.png\nAhora mismo me imagino que una buena parte de los que leen esto, recordaran el JoJ o bien “Diario de Justicia”, que funcionaba precisamente así, como un diario para invocadores y escrito por invocadores, informando sobre los conflictos y novedades del mundo. Con un toque humorístico en ciertas ocasiones y con un toque más serio en otras, a través de este diario, se mantenía vigente el viejo lore de League of Legends. Pero es también debido a esto en parte, que el juego tiene este problema que mencione sobre la consistencia. Sepan los más nuevos, que este JoJ era visible desde el cliente en la página principal una vez nos logueabamos, pero como dije “era”.\nConforme paso el tiempo, el JoJ se dejó de publicar, pero se le dejo en el cliente como un recuerdo de los viejos tiempos (o simplemente se les olvidaba retirarlo en cada parche… quien sabe). Pero eventualmente como algunos se lo temían este dejo de existir en el cliente y fue eliminado en algún punto. En parte debido a esto, el lore del juego parecía haberse estancado, pero entonces llego la denominada “Ascensión”.\nhttp://i.imgur.com/RZlwg3P.jpg\n“Ascensión” fue un evento donde se reescribió la historia de todo league of legends, pero solo parcialmente. ¿Cómo es esto? Varios de los lores de los campeones relacionados a Shurima fueron cambiados, y a medida el evento progresaba se iban atando los nuevos cavos sueltos en la historia de estos campeones, es decir poco a poco evolucionaban como personaje hasta lo que son hoy en día. –Un segundo, esto no parece un gran cambio para el lore, solo algunos ajustes aquí otros allá, no parece la gran cosa...—A esto le debemos sumar la aparición de Azir quién empezó la reconstrucción de su imperio. Renekton y Xerath escaparon de su prisión. Acontecimientos importantes, pero que entraban en conflicto con lo que sabemos de estos, pues tanto Xerath como Renekton estaban en el instituto de guerra, luego un nuevo imperio nacía entonces ¿Qué hacia la liga mientras tanto?\nEste es el punto de quiebre más importante en el juego, por la sencilla razón de a partir de este evento el aclamado “Instituto de Guerra”, los invocadores y la liga en general, desaparecieron. Así de simple.\nLa historia del juego, desde que empezó este evento hasta lo que es hoy en día se ha escrito como si nunca hubiese existido nada referente a la liga de leyendas o los invocadores, cosa que dejo ENORMES vacíos en la historia general del juego y personal de los distintos campeones.\nDebido a esto, muchos intentamos entender a que se debía este cambio tan radical y aunque Riot hablo al respecto, en esencia dijeron que conforme pasaba el tiempo, no quería que y cito en palabras de algún Rioter (Sir Dal?): “No queríamos que invocadores todo poderosos tuvieran un control sobre todo lo que ocurría en el mundo” Bueno no es la cita textual, pero fue el mensaje que Riot entrego en su momento. \nPersonalmente intente racionalizar lo que ocurría y aborde esta perspectiva, que considero en parte fue la de Riot:\nA medida que el juego progresaba salían y salían campeones, cosa que Riot dejo claro que no tienen planeado darle un término. En otras palabras hasta nuevo aviso seguirán sacando campeones, no hay una fecha en la que el juego “acabe”. ¿Qué pasaría con la liga entonces? Se llenaría de campeones de distintos bandos habiendo no tantos “conflictos” que resolver. Luego están los independientes ¿Qué hacen realmente en la liga? ¿Por qué deberían pelear por los conflictos de otros en primer lugar?\nhttp://i.imgur.com/JkJ0DL8.jpg\nLa liga eventualmente se convertiría en un refugio para aquellos que son perseguidos por sus naciones como Riven o Yasuo, y estas no podrían hacer nada en absoluto para impedirlo, pues es la liga quien los protege. De esta forma creo yo (y puedo estar muy equivocado), se limita considerablemente el potencial de cada campeón por separado. Aunque la vieja historia si tenía consistencia, a la larga dejaría de ser sustentable. Al menos si el juego sigue sacando campeones. Entonces Riot se da cuenta de esto y debe tomar una decisión: Mantener el juego como está, de modo que algún día termine por explotar sin control, o bien hacer que explote ahora que se puede contener el impacto y empezar un nuevo proyecto a partir de lo que logre quedar intacto. También es rebatible esto, pues la historia del juego podría seguir igual sin estallar y sin limitar el potencial de los campeones, si se tiene buenos guionistas y en conjunto con los distintos equipos de Riot hacen un buen trabajo. Pero el hecho es que Riot opto por la segunda alternativa y empezó a reescribir su propia historia.\nDejando esto en claro, se establecen como he mencionado, dos tipos de historia: El viejo lore con la Liga y el nuevo sin esta, que tenemos actualmente.\nHay muchas cosas que hay que arreglar y que Riot nos asegura trabaja para que quede algo estable y accesible para todos, y al menos yo confió en esto. Aunque una parte de mí no esté tan conforme. No es tan sencillo como algunos se imaginan crear una buena historia, indiferente de todo el dinero y personal que se maneje. Esto requiere tiempo, si no pregúntense por qué %$#\"!/&% no salido “Vientos de Invierno” todavía… Recordar lo que demoro “Danza de Dragones” no ayuda mucho…. Ok, esto no tiene que ver con el juego, pero al menos algunos ya se hacen una idea de a que me refiero. Es más difícil aún reescribir una historia, considerando la cantidad de protagonistas que tiene además de los que están todavía por ser agregados.\nhttp://i.imgur.com/QTkPo8N.jpg\nNunca leí el JoJ, pero a lo largo de sus páginas hay cosas que lo dejan pensando a uno… Sabían por ejemplo que Malzahar en una especie de ritual sacrifico a una muchacha enviándola al Vacío cosa que Kassadin intento impedir, terminando en el arresto de ambos por el alboroto que causaron… Y por alguna razón Karthus apareció muerto en la escena del crimen, pero eso no hiso mucho sentido… Bueno, eso es lo que recuerdo haber leído en alguna parte donde se comentaba al respecto sobre una de las columnas del JoJ, cosa que al ser una historia inconclusa solo fórmula más dudas. El juego está en una etapa de reescribir su historia, por lo que lo referente a la liga no se puede considerar como parte de la historia actual, entonces esa chica que fue sacrificada ¿No regresara a futuro? Es lógico pensar que nada de lo que apareció en JoJ va a tener una continuidad en el futuro, pero esta historia inconclusa ha abierto un buen debate sobre que podría o no ocurrir a futuro. Este tipo de cosas me gustaría que las aclaran, pero siento que probablemente si un Rioter ve esto, respondería algo como que “no he escuchado nada al respecto” o bien “no la hemos considerado pero tampoco descartado”, pues he leído por ahí que algunos miembros del Staff de Riot son diabólicos y les gusta jugar con nuestras expectativas, jeje.\nhttp://i.imgur.com/ntyIuIB.jpg\nSobre el problema\nPero bueno, dejando la clase de historia de lado, ahora viene el verdadero problema en el que no encontramos y que algunos percibimos:\nLa historia se está reordenado y buscando una continuidad, testimonio de esto son los eventos recientes como el de Aguas turbias y la masiva actualización del lore de las islas de las sombras y los campeones relacionados con estas. Todo bien hasta acá, el propósito y la intención Riot lo tiene bien claro. El problema es entonces el cómo lo efectúan.\nSi algo tienen los videojuegos, es que hay formas bastante practicas he inmersivas sobre como contar su historia de un modo envolvente y que se lleva nuestra atención. En juegos como WoW uno descubre la historia a medida progresa en el juego, las distintas misiones que recibe, los distintos lugares que visita y más importante, los distintos jefes finales que enfrenta en el trascurso de sus actualizaciones. Juegos como Mass Effect llevan todo esto a un nuevo nivel, aplicándole peso a las decisiones del jugador, cosa que afecta sus compañeros y su universo entero. Solo lo primero mencionado, mantiene al WoW como uno de los juegos que más han influido en mundo de los MMORPG, y lo mencionado luego ha convertido a la trilogía de Mass Effect en un clásico moderno en muy poco tiempo.\nhttp://i.imgur.com/Dn89csI.jpg\n--Ok, mucha palabrería, ¿Dónde está el problema entonces?—Con la salida de Lissandra, también se hiso un evento como Ascensión (pero ocurrió antes que este), donde se declaró un guerra por tres bandos (aún existía la liga en este punto, pero nunca se le mencionó ni por asomo), en donde se buscaba declarar una reina en Freljord peleando Lissandra, Ashe y Sejuani. Bien, el evento termino y todos los que participamos obtuvimos nuestro icono conmemorativo del bando que apoyamos. Ahora es cuando yo pregunto... ¿Y la guerra? ¿En qué termino? ¿Quién gano? En ese momento no le di importancia pero eventualmente me lo pregunte… ¿Cómo termino realmente? En esto puedo estarme equivocando, pero si no me equivoco la guerra obtuvo más victorias quienes pelearon defendiendo el símbolo de Ashe y sus “Discípulos de Avarousa”, seguidos “La Guardia de Hielo” y finalmente “La Garra Invernal”. Bien…… Ashe es Reina, ¿Y luego qué? O bien me equivoque en lo anterior, la guerra la ganaron Sejuani o Lissandra. ¿Y luego qué? ¿Acaso no deberían haber muerto las otras? ¿Ser prisioneras? ¿Quedar exiliadas? Pues lo que paso es más simple. ¡Termino el evento! El último en salir que cierre por favor….\n.\n.\n.\nEsperen esperen… ¿es en serio? No estoy tan seguro de que sea o no oficial esta guerra considerando que fue antes del punto de quiebre de la historia vieja. Pero el hecho es este, indiferente del resultado final, no hubo consecuencia alguna luego del fin del evento. Esto puede haber sido un gran error por Riot (enserio, dígame alguien que me equivoque desastrosamente en este punto, porque esto dejo más preguntas que respuestas a la larga).\nSiendo justos con Riot, ellos abiertamente dicen que buscan nuevas formas de contar la historia de un modo que sea accesible a todos y que la puedan disfrutar. Esto parecía una gran idea, un evento mundial, en donde a la larga terminaban por darle un desenlace los mismo jugadores. Todo bien, pero acá nos quedamos sin lo más importante, un desenlace.\nhttp://i.imgur.com/xlyIVLp.jpg\nRiot actualmente intenta contar la historia del juego a través de eventos como el más reciente sobre Aguas turbias, donde se pudo ver todo lo que no se vio en la guerra de las tres reinas, unas historia más desarrollada, una mayor inmersión de sus protagonistas, y lo más importante una conclusión. Por otro lado Riot experimento con algo que se venía pidiendo desde hace tiempo que hicieran, un evento con recompensas desbloqueadas por nuestros logros que vendría siendo los iconos tematizados con este evento, además de regalar una skin tematizada. Se nos dio a elegir un “bando”, pero a diferencia del anterior, esto no tenía ningún efecto en el desarrollo de los hechos. La historia misma por su parte es bastante entretenida, y sirve para poder sumergirte más en los personajes, pues ahora se les conoció de una forma más directa que leyendo una página resumiendo su historia. En este evento, se crearon algunos cuantos capítulos donde cada fragmento era narrado por cada uno de los involucrados desde su perspectiva. Esto enriqueció mucho a los personajes y su desarrollo se sentía de verdad, como cuando se lee un buen libro. Pero acá apareció otro problema.\nAhora poseíamos una historia detallada, que de verdad tenía un efecto en el mundo de Runaterra, los personajes se las arreglaban sin tener que depender de invocadores todopoderosos. Todo parece estar bien, salvo lo más importante a la hora de contar una historia. El medio. ¿Ahora qué ocurre? Toda esta historia, sobre la rivalidad de Graves y TF, hasta el plan y la venganza de Miss Fortune, TODO fue contado a través de un web diseñada para contener la historia de forma escrita.---¿Y qué, no te gusta leer?—Por el contrario, me encanta. Pero ahora no hablamos de mí y mis apreciaciones, si no que hablamos de los miles y miles de jugadores que componen la comunidad del juego. No solo los que andan por los foros, hablo de todos. A muchos podrá gustarles leer, pero a muchos otros no realmente. En esto Riot no logra transmitir debidamente la historia de su juego, y el trabajo de los distintos artistas involucrados en la elaboración de esta misma. A la fecha hay varias personas que llevan mucho rato jugando el juego y no tienen ni idea de que le paso a Gangplank durante el evento.\nhttp://i.imgur.com/lJ0z5pp.jpg\nLa cosa no termino ahí. Eventualmente llego el “Harrowing” época del año que muchos creímos iba a tener algún evento especial o algo por el estilo, pero como dijeron por ahí, paso sin pena ni gloria. Pero claro está que otra cosa muy importante ocurrió durante esa época, y fue la unificación de la historia de los personajes de las “Islas de las Sombras”, y la presentación de Illaoi. Suena genial, pero ¿En que se resume esto? MÁS texto. En este punto simplemente no entendí como fue que actuó Riot. Tiempo atrás vi a un Rioter contestar a alguien que preguntaba sobre por qué algunos campeones que les habían actualizado el lore ingame tenían uno tan simple y básico (4 o 5 líneas de texto), a lo que este contesta que se dieron cuenta que poner estas grandes cantidades de texto eran muy poco vistas actualmente, por lo que querían emplear otros métodos para poder profundizar en los campeones. Ahí es lo que no entiendo. ¿Por qué entonces recrearon la historia de las Islas de las Sombras (bastantes buenas de hecho), poniendo toneladas más de texto? Y más que la historia en el evento de Aguas turbias, esta fue poco vista.\nhttp://i.imgur.com/LPPREEA.png\nSin verla como es ahora, ¿Cuantos saben cómo es la historia de Mordekaiser? ¿Cómo fue antes? Si no me equivoco en el viejo lore fue un misterioso personaje que llego a la liga de leyendas pidiendo formar parte, sin dar más explicaciones. Luego se empezaron a preguntar que quien era, pues a juzgar por su aspecto tenía que ser un general, y de ser así ¿De qué ejercito? ¿Dónde se encontraba este? Pero luego lo cambiaron a ser una especie de alma errante de las islas de las sombras, que silenciosamente vagaba por Runaterra atormentando las almas de algunos desdichados. Pero hoy en día ¿Qué es? Pues en su época (miles de años antes), fue un poderoso y tiránico conquistador versado en las artes de la nigromancia, de modo que si moría en combate, lo que era derrotado era su espíritu y no su cuerpo. Su dominio fue tal en el mundo antiguo que erigió una gran fortaleza llamada “El Bastión Inmortal”, edificación que mostraba su dominio ante el mundo. Pero que con el tiempo fue derrotado y encerrado por mucho tiempo… Se llegó a considerar que su historia no era más que una leyenda. Con la caída de las “Islas Bendecidas” en lo que hoy conocemos como las “Islas de las Sombras”, logro liberarse y empezó a “contemplar” como volvía a someter al mundo bajo sus pies (y digo contemplar en el sentido que un Rioter explico hace un tiempo con la salida de Jhin). Se debe mencionar que este “Bastión Inmortal” es lo que conocemos hoy en día como Noxus. ¿Qué nos quiere decir con eso Riot?¿Se viene un evento “Islas de las Sombras” vs. Noxus? Si lo hicieran seria la cosa más enfermamente épica que podía hacer un mucho tiempo… Paso de ser un extraño con armadura, a ser un ente misterioso, para terminar convirtiéndose en una especie de Sauron O.o\nBueno, atendiendo a la realidad, solo hable de un personaje y el cambio que ha recibido actualmente le sienta de mil maravillas, y es además bastante enriquecedor para el lore del juego. Pero no se logró llegar con esto a una gran parte de la comunidad, que podría enormemente disfrutarla.\nSi tienes un juego, y no logras transmitir debidamente su historia, es poco disfrutable y muy olvidable en ese aspecto. Actualmente los jugadores no formamos parte del desarrollo de la historia, y solo somos tenemos una participación mínima durante los eventos. Desde otra perspectiva esto no es malo, es la historia de Riot y tampoco debería hacer mucho nosotros por modificarla, pero esta no inmersión hace que el juego se sienta vacío a la vez. Pero eso es otra historia. Ahora mismo estamos viviendo como la nueva historia se expande al “Monte Targon”, cosa que parece seguir la misma idea de las islas de las sombras, por lo que me preocupa que ocurra el mismo problema.\nAntes hable sobre el WoW y Mass Effect, pero claro está que Riot no puede emplear del todo las herramientas usadas por estos para narrar su historia. Pero hubo un evento que logro narrarla CASI de una manera más accesible a todos.\nAhora volvamos al evento más importante hasta ahora en cuanto a la evolución de la historia del juego, que es Ascensión. El gran problema que tuvo este evento que le quito lo memorable, fue que no supo satisfacer las expectativas que habían al respecto, pues se hiso mucha especulación sobre que seria, que traería consigo. Pero indiferente de esto, el cambio en el lore no se vio reflejado durante el evento si no que desde acá se empezó a reescribir la historia nuevamente, pero a diferencia del evento de Aguas Estancadas, no se hiso con grandes textos he historias. Se hiso por medio de unas cinemáticas. En aspectos técnicos, más sencillas de producir que cinemáticas como “A Twist of Fate”, pero dada la buena narrativa y la calidad misma de la animación en pocos minutos se contó una gran historia sobre la caída de Shurima y su re alzamiento. Su problema, fue la poca difusión que se les dio. Para algunos la lectura es buena en lo que a contar una historia refiere, pero una cinemática es algo que casi todos logran disfrutar.\nhttp://i.imgur.com/6IgU2Rr.jpg\nPero todo lo anterior son solo la punta de iceberg del problema real. Dejando todos los puntos anteriores claros, el verdadero problema es que aunque tengas una buena manera de involucrar a los jugadores en la historia, aunque tengas propiamente una buena historia, aunque sepas como involucrar al receptor en ella, nada de esto perdura.\n¿A qué me refiero? Una vez termina el evento aunque las webs temáticas siguen activas, todo lo acontecido en estas queda ahí. Quienes actualmente juegan y no formaron parte de dichos eventos no tienen forma de entender que esos hechos fueron, pasaron y tuvieron sus debidas consecuencias en el mundo, a menos que se den el trabajo de buscarlo y averiguarlo. --¿Cómo es eso un problema? Digo si quien quiere averiguarlo se da el trabajo de buscarla, la encontrara y quien no se limitara a jugar--- Pues pasa que carece de un verdadero propósito el haber hecho el evento en primer lugar. Los jugadores se entretienen sí, es el propósito del evento en primera instancia. ¿Pero qué pasa con el trabajo de todos aquellos involucrados en crear tales historias? ¿Es justo que quede en el olvido el trabajo de meses de todas estas personas? ¿Es acaso la forma en que se debe contar una historia? Los eventos que ha tenido Riot tienen aquellas cosas buenas y malas que mencione antes. Todos enriquecen la historia del juego, pero esta misma no perdura, y eso realmente es un problema. Bien podrá ser el juego más jugado de la época, bien está claro que la prioridad es juego en el ámbito competitivo, pero si bien teniendo este gran potencial en cuanto a su historia, lo desperdician de esta forma, league of legends solo será un juego más del montón.\nSobre una solución\nPero el propósito de este post, no establecer que está vigente este problema. El verdadero propósito es aportar una solución:\nLos eventos que sacado a la luz Riot, tienen sus pros y contras como los mencione antes, al menos en lo que yo percibí. Esta también claro que Riot no puede darle un completo nivel de inmersión al juego, dado las características del mismo. Pero si es el propósito de Riot darnos a conocer la historia a través de estos eventos, ¿Cómo hacerlo de un modo inversivo, donde uno realmente sienta que está siendo parte de la historia, de modo que perdure, que posea una buena difusión y que sea accesible para todos? La respuesta es algo que todos en algún momento nos hemos planteado si es posible o no, y es un modo “Campaña”.\n¿Cómo diablos puede algo así funcionar en el juego? Es un juego online a fin de cuentas, pero Riot ya nos mostró que es posible hacerlo funcionar. Por “Campaña” imagínenlo como las campañas de “Age of Empire II”, luego vallamos por partes para entender esto:\n1.\tLas campañas propiamente son secuencias de misiones a realizar ingame, cuyos objetivos y dificultad de los mismos, varían dependiendo de en qué punto de la campaña nos encontremos. En un inicio pueden ser objetivos sencillos como obtener cierta cantidad de minions eliminados en una partida. Obtener ciertas clasificaciones con X campeón, que pueden variar desde A+ en adelante. La cantidad de posibles objetivos en inmensa.\n2.\tLas campañas se organizaran por volúmenes y episodios, de modo que la campaña completa se dividirá en algunos volúmenes y estos a su vez se dividirán en episodios, que son los que se completan con las misiones.\n-\tUn ejemplo del orden por episodios puede ser el evento de Aguas Turbias, que al escoger un bando se nos asignaron algunas misiones para obtener cierta recompensa.\n-\tEstas misiones SOLO se podrán completar en partidas normales y por ningún motivo en Ranked.\n-\tSi el jugador se va AFK, no se le considera el progreso en la misión.\n-\tJugadores que hayan tenido suspensiones por conducta o similares podrán acceder a las misiones, pero no a las recompensas dado un determinado tiempo según el criterio de Riot.\n3.\tEstas campañas, tienen una bandera, es decir, una campaña estará dedicada a Shurima, otra a Aguas Turbias, etc.\n4.\tAlgunos volúmenes de campaña serán inmersivos, pidiéndole que dada la historia, el jugador adquiera un bando. Otros en cambio están destinadas a la exploración y serán lineales o no dependiendo de la situación.\n5.\tAlgunos episodios permitirán desbloquear recompensas, que pueden variadas entre todo el contenido que Riot puede ofrecernos. Más adelante hablare sobre lo que sugiero aparte.\n6.\tLos eventos constituirán un volumen completo por campaña. Al terminar el evento, quienes lo hayan completado obtendrán el volumen automáticamente, de modo que puedan repasarlo en cualquier momento.\n7.\tLos volúmenes de eventos anteriores, así como aquellos que no se pudieron terminar a tiempo, se podrán adquirir desde la tienda en cualquier momento, al precio que corresponda. Más detalles abajo.\n8.\tSolo se podrá adquirir un volumen en la tienda si es el primero de su bandera, o se ha completado el volumen anterior.\nhttp://i.imgur.com/ZrQNFme.gifv\nAhora muchos se preguntan, ¿Los eventos anteriores se podrán integrar? Si los complete en su momento ¿Deberé comprarlo igual? Si esta propuesta llegara a realizarse, sería Riot quién decida esto, pero lo lógico por parte de ellos sería que si hagan parte de este sistema de volúmenes a los eventos anteriores, e idealmente que quien los haya completado, reciba estos volúmenes de forma gratuita. \nAhora sobre las recompensas, estas podrían ser diversas cosas, pero NO puntos de influencia o RP. Luego comentare sobre esto. De la misma forma que en el evento antes mencionado, podrían obtenerse muchas recompensas tales como iconos tematizados o lo bien, si me permiten hacer una sugerencia dentro de otra, skins. Así como lo dije, skins que hagan referencia al volumen en cuestión. Pero no mal entiendan esto, no hablo de skin que signifique ENORMES cambios como un DunkMaster Darius o un DJ Sona. Hablo de skins más modestas, que no superen los 750 de RP en cuanto a calidad. Skins que solo se puedan obtener mediante el volumen, cosa que les daría una exclusividad a los volúmenes. Además con las artesanías Hextech podrían incluir cofres tematizados con el volumen, como surgieron antes Riot. Otro punto importante es que esta skin solo es obtenible si se tiene al campeón, la skin NO viene con el campeón. Otra cosa que sería bueno agregar, podría ser el tener que escoger una recompensa entre 2 o más ¿Pero y si quiero ambas? Bueno, lo que propongo una vez acabado el volumen aquellas recompensas que no escogiste, las puedas obtener en la tienda mediante RP.\nPero eso sugiero, sea solo un tipo de recompensa. Entre otras posibles, está el que se puedan desbloquear pistas musicales, para poner como una alternativa a la música actual. Estas pistas se podrían poner en cualquier mapa. Otra idea sería el poder obtener nuevamente la skin de Aguas Turbias para ARAM, como una recompensa final, de modo que se decida al azar que skin de mapa se utiliza una vez se está jugando (al igual que un custom skin este cambio solo lo apreciaría el jugador). También poder obtener la voz de Gangplank como el anunciador de nuevo y que como las pistas de música se pueda escoger cual poner. Además, a medida que se progresa en el volumen, ir obteniendo algunas pequeñas cinemáticas que vallan narrando la historia y que estén accesibles en cualquier momento. No hablo con esto, de links para ver el canal de YouTube correspondiente (este fue el error de difusión de antes), si no que cinemáticas completamente integradas al cliente.\nhttp://i.imgur.com/GxQdSZd.jpg\nEstas cinemáticas a su vez no tienen por qué ser de un ENORME presupuesto, si no que algo más simple y sencillo, tampoco algo largo y muy detallado. Como un ejemplo puedo dar las pequeñas cinemáticas de “Diablo III” que se veían entre algunos actos y durante los mismos, donde nuestro personaje narraba un poco sobre la situación y donde se veía unos dibujos en páginas contar la historia, con un toque rustico. De tanto en tanto, podría ser bueno ver texto contando la historia, pero no algo tan denso como lo de las “Islas de las Sombras”.\nPero corresponde otro detalle, y es el mencionado previamente “precio”. Pasa y resulta que Riot no trabaja gratis siempre. Todo este contenido requiere aún más trabajo que los mismos eventos, y horas y horas de programación hasta que quede bien. Riot podría parecerle buena mi sugerencia, pero si no algo redituable, podrían simplemente desecharla, a fin de cuentas es una empresa y se debe ganar el fruto de su trabajo. Por lo que sugiero algo que podría dejar conforme a todas las partes:\nQuienes completen un evento obtienen el volumen desbloqueado de forma gratuita, es la recompensa justa de sus esfuerzos. Quienes por otro lado tengan que comprarlo podrían hacerlo mediante RP o 10000 PI (dejo a su criterio que correspondería en cuanto a RP). Esto tiene un propósito, y es que esa cantidad de PI al ser tan considerable hará que todos se evalúen si realmente quieren completar el evento o no, si vale la pena invertir en algo así o comprar aquellas runas que tanto te hacen falta… En cuanto a las recompensas, que el precio de RP varié en función de las recompensas obtenidas durante el volumen de modo que sea justo en este ámbito. Los 10000 IP podrán reducir su costo hasta un mínimo de 4000 IP, dependiendo si uno posee o no a determinados campeones que sean protagonistas de dicho volumen. Sugiero además, que se habilite la compra de un pase que desbloquea de forma automática TODOS los volúmenes de las distintas campañas en medida que son liberados. Este pase solo se podrá adquirir mediante RP, o bien en algún evento por medio de las tarjetas que Riot reparte en ocasiones. Este pase seria de por vida, pero con un precio considerable. Debido a esto, el coste asociado y lo demás, las recompensas no deberían ser con IP ni con RP.\nLos eventos ya pasados como Ascensión requerirían una reestructuración para ser integrados a este sistema, establecer las misiones y su progreso ingame y no en una web externa, cosa que no le veo sentido… Pero con empeño y ajustes creativos, se podría hacer perfectamente. Eventos como el de la guerra de las tres reinas que deberían tener un desenlace, quien lo jueguen y escojan apoyar el bando que no gano, que les aparezca algún mensaje que diga que pese a sus valientes esfuerzos las cosas no resultaron y bla bla bla, de modo que concluya diciendo que paso realmente con la reina que apoyaron.\nLas posibilidades con estos eventos son casi infinitas, por dar un ejemplo, podría hacerse un evento de invasión del vacío previo a la salida de un campeón (la muchacha de antes…), y que decida por medio de una competencia mundial si será un campeón que apoye al vacío o lo enfrente, cambio que se notara en su skin secundaria que representaría lo que hubiera sido el campeón. Quienes compren y completen el evento en el futuro podrían obtener un descuento en el campeón y su skin.\nDe esta forma Riot solo lograría sorprendernos. \nNo es la forma en que WoW o Mass Effect cuentan su historia, pero si repasamos:\n1. Riot de forma inmersiva cuenta la historia de Runaterra y sus habitantes.\n2. Preservan su historia y su trabajo creativo de modo que todas las generaciones de jugadores lo puedan apreciar.\n3. De una forma clara y entretenida hacen realmente la historia parte del juego.\n4. Riot logra obtener algo de todo esto, sin volverse un Pay 2 Win.\nConsiderando todo esto, Riot obtendría una forma propia y original de mantener activa su historia. Convertirían el LoL en un juego que no sea unicamente conocido por lo competitivo, parte que yo realmente no disfruto. Pero eso es otra historia.\nSi te tomaste tu tiempo de leer hasta acá, te lo agradezco. Al final del día esto es solo una sugerencia, pero el problema de la historia es algo latente que Riot tiene en mente. Basado en los criterios con los que Riot quiere dar a conocer su historia, esta considero es la mejor solución a su problema. Por ello espero este post no quede en el olvido.\nGracias.\n------------------------------------------------------\nAclaraciones:\n1. Las \"recompensas\" van a criterio de Riot, acá solo hay sugerencias mías al respecto. No se pretende con esto quitar del todo la exclusividad de ciertas recompensas obtenidas previamente (iconos en general hasta ahora). Por lo que bien podrían en futuros eventos haber recompensas que solo se obtengan mediante el evento y no en el volumen. \n2. Uso el corrector de palabras de Office. Si algo se ve sospechoso, cúlpenme a mí por ser tan ingenuo.\nTL;DR Para llenar el vacío del lore del LoL sugiero crear un modo campaña basado en los diversos eventos que Riot trae cada tanto tiempo, que incluye misiones donde se puedan desbloquear determinadas recompensas.\n","replies":[{"poster":"Vi Sexual","date":"2016-02-20T23:01:05.386+0000","up_votes":4,"down_votes":0,"body":"Yo me lo leí todo.\n   Probablemente mi comentario viva y muera efímeramente en este foro (lamentablemente como sabrás, Latinoamérica no tiene tanto peso como NA por ejemplo). Pero mas allá de eso...\n\n     Soy de esos tipos que juegan al lol básicamente por el Lore. Que no se me malinterprete: No juego normales, mi objetivo son las ranked, mejorar como jugador, obtener scores/resultados/_**LOGROS**_. Pero lo que mas me llama la atención del juego es el lore (Soy un enamorado de {{champion:254}}  y su lore, por poner un ejemplo). Estoy consciente del problema que mencionas vos en tu texto respecto a la historia, y el problema de su duración (eso que vos nombras diciendo que \"no perdura\").\n\n        Te puedo asegurar que la raiz de todo el problema respecto a la historia del lol,en mi opinion al menos, la acabe de nombrar en estas pocas lineas de texto y es nada mas ni nada menos que inclusive a una persona como yo, la cual adora y que juega practicamente por el lore del LoL, se interesa por las ranked; osea, este sistema de esfuerzo/recompensa que tanto le rinde a Riot como empresa. Debes saber tan bien como yo, que muchos de los jugadores jugan lol con tal de obtener algo (no me refiero a skins, me refiero mas pescisamente a algo tal vez inmaterial, como puede ser: ganarle a otro, mejorar como jugador, o inclusive flamear cuando vas ganando con tal de demostrar que \"sos mejor\" como lamentablemente pasa) y que ese algo no esta relacionado con el lore . Con esto no quiero decir, ni doy por sentado que a Riot le importa nada mas el dinero y como hacer para generar adicción en nosotros para que sigamos invirtiendo (que si te pones a pensar, no es descabellado, porque es el objetivo de cualquier empresa), me refiero a que Riot apunta a lo que le resulta eficaz, y _**lamentablemente**_ el Lore de LoL no es lo que le rinde.¿A qué me refiero con rendirle? Los jugadores que se interesan por el lore de League of Legends no deben ser ni la mitad de los jugadores netos, estadistícamente hablando. La mayoria juega para divertirse con amigos, para rankear con amigos, para llegar a diamante, para streamear en twitch o youtube, o para distraerse. Claro está que hay quienes juegan que les gusta el juego por su historia, pero como un Rioter menciono alguna vez (cito casi textualmente) \" un MOBA no es la mejor forma de transmitir una historia\".\n\n      A ver, quiero dejar en claro mi posición respecto a este asunto: estoy TOTALMENTE de acuerdo en que el League of Legends sea una especie de Super Smash Brawl, osea, que la Grieta sea simplemente el lugar donde vos podes elegir un campeón de todos los disponibles, y que sus historias sean totalmente independientes de este. El viejo lore (con lo del Institute of War, los Summoners, el JoJ, etc.) era bastante interesante, inclusive como bien sabrás las {{item:3158}}  son consecuencia de algo que sucedió con ese viejo lore (que por cierto, yo no pude vivir, no jugaba en ese entonces, pero el solo imaginármelo se me hace bastante entretenido), este tipo de cosas terminan teniendo \"peso\" dentro del juego, porque a alguien a quien le gusta la historia, y lee la descripción de las botas, termina picado por el bichito de la curiosidad y consecuentemente, investiga de QUÉ PASO (historicamente hablando dentro de LoL) que llevó a eso lo cual hace que perduré; volviendo a la realidad, ni la mitad deben haber leído o siquiera preguntarse el POR QUÉ de estas botas.\n      Pero por algún motivo la interacción de Campeones con los Summoners (osea, nosotros) no me terminaba ni me termina de convencer. Parece ser que a Riot tampoco, por algo decidieron cambiarlo y probablemente sea lo que vos nombras en tu texto; en algún momento esa formula para contar historias, terminaría por explotar.\n\n   Me gusta lo que proponés, pero soy conciente que, a mi parecer, un sistema así (Modo Campaña) no terminaría de encajar en el juego de League of Legends,porque considero que el principal problema del lore esta en que es Riot mismo el que no termina de \"entusiasmar\" con el tema del lore, no a todo el mundo le gusta jugar pensando en la historia como yo, pero a los que nos gusta tampoco nos termina de cerrar, o al menos yo no me termino de sentir satisfecho (por cierto, si algun Rioter lee este testamente, me gustaria aclarar que AME el evento de AguasTurbias, los modos de juegos alternativos, las recompensas, la historia, y los detalles; de hecho lo que mas me fascino fue que incluyeran el cartel de alerta propio del cliente para anunciar que Gangplank estaba muerto, la verdad, una joya)*. No puedo aportarte en este momento alguna solución alternativa, solo aportarte mi punto de vista,mi sincero deseo de que algún Rioter se sume a la discusión y mi predisposición a seguir debatiendo de esto, porque la verdad es algo que me interesa y bastante, y de lo cual me encantaría que se llegase a algo nuevo.\n\n* Quise hacer un punto y aparte con el tema de Aguasturbias, que mencione y que vos también lo hiciste en tu texto. Para mi, lo que hizo exitoso el evento fue nada mas ni nada menos la cuestión de ser efímero, de saber que no todos los jugadores lo vivieron pero \"yo si\" (hablando a nivel general) lo que te produce satisfacción de tener un icono coleccionable, es saber que no es conseguible por cualquiera. A este tipo de cosas debería apuntar Riot, y creo que es en lo único que discrepo con vos y tu idea. El pensar el un Modo Campaña implicaría que cualquiera que iniciase el juEgo, podría conseguir lo que yo (por poner a cualquier persona en mi lugar) conseguí VIVIENDO el evento. Porque es eso, un evento, que ocurre una vez. Es lo que la mayoría de las personas NO ENTIENDE con el modo de juego URF. ¿Porqué es tan exitoso? Porque es TEMPORAL, porque no esta para siempre, porque lo podes disfrutar un rato y después te lo sacan. Yendo mas lejos ¿Porque existen coleccionistas? ¿Porque los objetos de colección son tan caros y deseados por millones de personas? ¿Porque sagas como Star Wars tienen tanta mercadería coleccionable y a su vez, exitosa?, simple, porque son efímeras, y NO TODOS pueden tenerlo. Volviendo al LoL ¿Porque son tan preciados los skins, siendo que no te modifican EN NADA el juego, más que visualmente? Porque a menos que tengas RP, generalmente no los podes conseguir; los de legado son aun mas exitosos, porque no están los 365 días del año disponible (acá es donde tiene ganancia Riot, pero dejemos de lado el dinero,ganancia, empresa, capitalismo y bla bla bla, en si por un momento). Pongámonos objetivos por un minuto. Si pusieran las skins por IP ¿Tendrían la misma gracia? Comprarías tus skins favoritas o tal vez ni siquiera, porque sabes que las podes conseguir de todos modos.\n   Para ser sincero, no se como finalizar, porque se que me quedan muchas cosas en el tintero, pero muy sinceramente, me encantaría seguir este debate,y mas aun con un Rioter, siento que se podrían sacar cosas muy fructíferas.","replies":[{"poster":"ElXandresX","date":"2016-02-21T02:22:43.128+0000","up_votes":1,"down_votes":0,"body":"Si el propósito del comentario es el debate, al menos yo lo recordare :V\nContrario a ti yo soy un jugador que no pretende jugar nunca Rankeds, EN LO PERSONAL no me aportan nada que busque en un juego. Supongo que en gran parte debido a ello hice esta sugerencia, de modo que el LoL aporte algo más que su ámbito competitivo al ambiente.\n\nEl propósito de esta sugerencia, no es que entre en conflicto con las Rankeds, también soy consciente de que son lo que mueve al juego al final del camino, si no que más bien el juego no se limite a ello. Siempre es posible expandir las fronteras mismas, especialmente en una empresa. Ahora que lo mencionas, recuerdo haber leído también cuando un Rioter dijo eso, esa respuesta solo me dejo gusto a poco :X\n\nEsta idea propiamente no es algo que valla a rendir económicamente hablando a Riot, y no me sorprendería que desechen esta idea solo por eso. Al final de todo son una empresa, por ello también pensé en lo del \"pase\", pero si, sé que con eso ni de chiste incrementarían las ventas de Riot del modo que a ellos les gustaría. Solo lo mencione para no esté tan \"desbalanceada\" la sugerencia.\n\nPor otro lado, mi sugerencia no es derechamente entusiasmar a los jugadores con la historia, si no que sumergirlos en ella, de modo que si lo desean vuelvan del fondo o no, jeje. Tal vez yo me quiera quedar un buen rato buceando, pero no por ello traeré conmigo a alguien que no le guste nadar.\n\nTambién recuerdo lo de las botas, pero nunca lo investigue debidamente. Corríjanme si me equivoco de nuevo, pero ese no fue derechamente un evento, si no que una competición con jugadores profesionales, puso fin a la guerra entre Noxus y Ionia (cosa que si sabemos ocurrió por el video de Bardo), habiendo participado Amumu y Morgana por Ionia y Noxus respectivamente (en alguna parte creo haberlo leído..).\n\nEl evento de  Aguas Turbias fue algo único, y sin dudas algo que lo hiso más único fueron las recompensas y su modo de obtención. El evento mismo es algo que solo se pudo vivir en aquel momento, eso no lo discuto. Pero futuras generaciones solo lo conocerán como una leyenda algo que un amigo les conto, algo que vieron a alguien comentar en un foro, etc. pero nada más que eso. Para ellos no me parece muy justo. Con esto no pretendo que vivan el evento de la misma manera que nosotros, sino que sepan que fue en el pasado lo que ocurrió para entender su presente. Probablemente en el futuro vengas nuevos eventos, y del modo que está haciendo Riot las cosas lo mas lógico seria que les den continuidad con esto. Si hicieran un evento en donde los jugadores a nivel mundial compitieran por un bando, saber cuál fue ese bando y que consecuencias reales tuvo esa \"victoria\".\n\nConcuerdo con lo de las recompensas, tal vez en ello se me fue la mano. Aunque sería bueno obtener recompensas, podrían hacer algunas destinadas exclusivamente al evento y otras menores destinadas tanto al evento como al \"volumen\". No es por codicia aclaro, pero es forma de hacer realmente más entretenida una campaña, perseguir determinadas recompensas. Además dije también, que estas no tenían que ser solo skins o iconos exclusivos, hay cientos de posibilidades.\n\nEn cuanto a U.R.F. creo ocurre algo distinto. Creo que lo que lo hace popular es el hecho de que es jodidamente divertido, y el que sea temporal solo funciona como catalizador a la emoción que genera. Aunque contrario a los demás eventos, este un modo de juego que muchos esperan valla a volver cada año. Estos eventos en cambio no vuelven y pasan al olvido. No el evento en cuestión, si no que su impacto en el mundo.\n\nTampoco creo tener mucho más que decir, pero agradezco tu tiempo ^^","replies":[{"poster":"Vi Sexual","date":"2016-02-21T03:25:22.556+0000","up_votes":1,"down_votes":0,"body":"Vallamos por partes dijo Jack el destripador (cuek, arrancamos con un chiste malo) jajaja.\n\n>Contrario a ti yo soy un jugador que no pretende jugar nunca Rankeds, EN LO PERSONAL no me aportan nada que busque en un juego. Supongo que en gran parte debido a ello hice esta sugerencia, de modo que el LoL aporte algo más que su ámbito competitivo al ambiente.\nEl propósito de esta sugerencia, no es que entre en conflicto con las Rankeds, también soy consciente de que son lo que mueve al juego al final del camino, si no que más bien el juego no se limite a ello. Siempre es posible expandir las fronteras mismas, especialmente en una empresa.\n\nQuiero aclarar que tampoco digo que todo el mundo deberia jugar Rankeds porque ESO es League of Legends, no soy apologizador (creo que no existe la palabra pero bue). Me referia a que, justamente eso, como la mayoria lo prefiere, a los pocos que nos gusta\nel tema de la historia, tenemos que \"pagar el precio\" y/o adaptarnos (como lo terminé haciendo yo) al sistema competitivo. Tranquilamente podria jugar al LoL si no hubiese nada respecto a la Clasificatoria o algo parecido, lo jugaria si fuese solo por su historia, pero bueno.\n\n>Ahora que lo mencionas, recuerdo haber leído también cuando un Rioter dijo eso, esa respuesta solo me dejo gusto a poco :X \n\nTotalmente de acuerdo. Entiendo los motivos por lo cual lo dijo (convengamos que ningun Rioter \"es\" Riot, solo son voceros). Aun asi, saber que la historia es \"lo de menos\" es como que...te deja con ganas de mas.\n\n>También recuerdo lo de las botas, pero nunca lo investigue debidamente. Corríjanme si me equivoco de nuevo, pero ese no fue derechamente un evento, si no que una competición con jugadores profesionales, puso fin a la guerra entre Noxus y Ionia (cosa que si sabemos ocurrió por el video de Bardo), habiendo participado Amumu y Morgana por Ionia y Noxus respectivamente (en alguna parte creo haberlo leído..).\n\nExacto, no fue un evento, fue un suceso.Riot aclaró que si bien \"la batalla en la grieta nunca ocurrio\", el hecho como lo es la guerra de  Ionia vs Noxus es Canon en el lore de Runaterra.\n\n\n>También recuerdo lo de las botas, pero nunca lo investigue debidamente. Corríjanme si me equivoco de nuevo, pero ese no fue derechamente un evento, si no que una competición con jugadores profesionales, puso fin a la guerra entre Noxus y Ionia (cosa que si sabemos ocurrió por el video de Bardo), habiendo participado Amumu y Morgana por Ionia y Noxus respectivamente (en alguna parte creo haberlo leído..).\n\nEn ese sentido estoy de acuerdo. A lo que me referia yo es que, ese sentido de \"epico\" o \"legendario\" que sentis cuando ves un hecho historico pasado, te lo da justamente, que sea pasado. Lo mismo opino con el evento. Osea, AguasTurbias fue lo que fue, y lo vivieron los que lo vivieron, y asi deberia ser en mi opinion. En lo que si tendrian que profundizar/perfeccionar es en el hecho de que los cambios en la historia, todo lo que ocurrio en el evento y demas, SI DEBE quedar constatado para las futuras generaciones que no pudieron vivirlo. Para ejemplificarlo: Es como la Segunda Guerra Mundial, mas alla de que una guerra es nefasta e injustificable, no quita lo fascinante de este hecho historico y todas sus consecuencias en la historia de la humanidad, lo cual OBVIAMENTE DEBE quedar constatado para las futuras generaciones, pero lo que paso, ya paso. En ese aspecto del evento me base para escribir lo que escribí.\n\n>Concuerdo con lo de las recompensas, tal vez en ello se me fue la mano. Aunque sería bueno obtener recompensas, podrían hacer algunas destinadas exclusivamente al evento y otras menores destinadas tanto al evento como al \"volumen\". No es por codicia aclaro, pero es forma de hacer realmente más entretenida una campaña, perseguir determinadas recompensas. Además dije también, que estas no tenían que ser solo skins o iconos exclusivos, hay cientos de posibilidades.\n\nCuriosamente estoy a favor de los sistemas de recompensa, porque como nombre en mi primer post, el hecho de que algo sea \"coleccionable\" es lo que lo hace valioso. Pero justamente eso, coleccionable, que lo puedas conseguir de tal y tal forma. Igual parece ser que estamos de acuerdo con eso.\n\n>En cuanto a U.R.F. creo ocurre algo distinto. Creo que lo que lo hace popular es el hecho de que es jodidamente divertido, y el que sea temporal solo funciona como catalizador a la emoción que genera. Aunque contrario a los demás eventos, este un modo de juego que muchos esperan valla a volver cada año. Estos eventos en cambio no vuelven y pasan al olvido. No el evento en cuestión, si no que su impacto en el mundo.\n\nEs jodidamente divertido, obvio que si, pero lo que lo hace deseado es que es temporal. Mas alla de que no le conviene a Riot ponerlo como modo permanente (se dividirian mucho las colas, mandarian al carajo a las ranked jaja), si lo pusiesen, creeme que al año no tendria tanto \"hype\" como lo tiene ahora. Justamente, el ponerlo por un par de semanas te genera el famoso sindrome de la abstinencia, asi funciona el cerebrito humano \"cuando no lo tengo, lo quiero, y cuando lo tengo, lo olvido\".\n\nY si, me gusta debatir siempre que sea de manera respetuosa y siempre teniendo en cuenta que no hay que esperar cambiarle la forma de pensar al otro. Hay un dicho que lei una vez que decia algo asi como \"No obligues al otro a pensar como tu, deja que tus argumentos lo hagan por ti\" jaja x)\n\nSaludos. {{champion:254}}","replies":[{"poster":"ElXandresX","date":"2016-02-21T04:07:41.125+0000","up_votes":1,"down_votes":0,"body":"Olvide preguntarlo.. ¿Alguna sugerencia para hacer esta propuesta más coherente?","replies":[{"poster":"Vi Sexual","date":"2016-02-21T04:14:01.564+0000","up_votes":2,"down_votes":0,"body":"Yo haria una especie de modo campaña pero que no sea en un 5vs5 en la Grieta del Invocador. Que tenga el sistema de recompensas, o que te de alguna \"ventaja\" (a ver, no ventaja netamente en el juego en si, sino que, no se, te desbloquee una runa, una maestria, o que al completarlo te de una pagina de runas en especifico, mas que nada para aquellos a los que, inevitablemente, les interesa jugar mas que nada, claro esta). Como una especie de minijuego, o \"novela grafica\" como la de Illaoi que paso muy desapercibida. O tal vez, hacer el lore interactivo. \n\nSe me ocurre por ejemplo lo que planeas de la Guerra en Freiljord, que sea narrada por (no se, Braum, contandote lo que pasa) y que en un momento se te pregunte de que lado te pones, que puedas elegir, y que siga narrando la historia en relacion a la opcion que elegiste (ya que estamos con Mass Effect y el sistema de accion-consecuencia).\n\nSeria bastante interesante ver algo asi, al menos en mi opinion. Que pensas al respecto?","replies":[{"poster":"ElXandresX","date":"2016-02-21T15:26:04.224+0000","up_votes":1,"down_votes":0,"body":"Si es un modo campaña debe de tener objetivos que se cumplan jugando, si no me imagino que sea otra cosa. Me gusta la idea de las Runas, incluso podrían ser Runas especiales con algún diseño propio de la campaña (solo diferentes de las normales en el aspecto claro está). Las maestrías no creo que sea buena idea, eso ya sería una verdadera ventaja.\n\nCreo que una novela gráfica es otra cosa... Pero si, integrar ese tipo de contenido en el cliente es precisamente lo que pretendo al menos yo. De hecho es bastante buena la idea lo de Braum. En mi idea original imaginaba algo como darle click a un botón y con una pequeña animación o algo se vaya avanzando o que se yo...\n\nSi no es jugando en un 5vs5 o bien en un 3vs3 ¿Qué se te ocurre para que sea propiamente una campaña? Yo pienso que si se le quitara el factor de las misiones, perderán un gran atractivo para el precio que propuse. Una solución claro esta sería dejarlo que cuesten menos IP, pero dejaría de ser una campaña... ¿Qué piensas?","replies":[{"poster":"Vi Sexual","date":"2016-02-21T21:55:51.387+0000","up_votes":1,"down_votes":0,"body":"Si obviamente, pero claramente Riot no mezcla el juego (por lo menos el 5vs5 en la Grieta) con el Lore de LoL. Por eso intente adaptarlo a algo separado. Otra de las cosas seria poder desbloquear estas \"novelas graficas\" alcanzando ciertos objetivos en la grieta (No se, si alcanzas 100 minions en una partida con Lux Garen Jarvan o Poppy se desbloquea el volumen de Demacia)  o algo en ese sentido. Otra cosa que entre dentro de la realidad y expectativa tanto nuestra como de Riot, no se me ocurre, porque dejaron bastante en claro que no van a mezclar juego con historia :(","replies":[{"poster":"ElXandresX","date":"2016-02-22T13:34:15.584+0000","up_votes":1,"down_votes":0,"body":"Francamente, hasta que lo comentaste en algún punto por ahí, no se me había nunca planteado que el juego como tal sea una especie de Super Smash Bros hecho MOBA x.x El hecho de que personas sin relación directa se peleen entre si con el nuevo lore no posee ninguna explicación hasta ahora. Aunque recuerdo que cuando llego la nueva grieta, se le decidió dejar el nombre de siempre como un recuerdo de lo que siempre fue, y algún Rioter dejo un pequeño indicio de que tal vez ahora \"el invocador\" fuera alguien... Si eso es así ¿De verdad Riot no quiere mezclar el juego con el lore? Creo que eso ultimo debería definitivamente de acláralo alguien de Riot, pues lo que es yo solo puedo hacer suposiciones al respecto.\n\nPero si aplicamos objetivos, que se deban desarrollar en el juego para obtener un progreso en el lore ¿No sería en esencia lo mismo? Acá no entendí del todo tu punto...\n\nA fin de cuentas lo ideal sería que un miembro de Riot venga a dejar su punto de vista, tanto como jugador como Rioter. No sé qué más decir...","replies":[{"poster":"Vi Sexual","date":"2016-02-22T22:17:51.980+0000","up_votes":1,"down_votes":0,"body":"Respecto a lo primero, en el mismo post donde el Rioter dijo \"un MOBA no es el mejor medio para contar una historia\" es donde el mismo rioter, (u otro, pero era en la misma conversacion) menciono que el LoL en efecto ES una especia de SMB. Basicamente confirmo que son personas sin relacion directa, que pelean porque si. Basicamente la Grieta no es parte del lore (segun Riot).\n\nSi, pero me referia a que no tengas que jugar una partida en especifico para sacar los premios desbloqueables (con el fin de evitar que alguien se meta en una partida normal, haga la X mision, y se valla afk, o regale la partida por querer cumplir la mision), sino que los objetivos a cumplir sean cosas del mismo juego que se desarrollan una vez tras otra en todas las partidas 5vs5. Tal vez te referias a esto en primer lugar y yo lo malinterprete, me disculpo de antemano.\n\nY si, sigo con la esperanza de que algun rioter se pase sinceramente.","replies":[{"poster":"ElXandresX","date":"2016-02-24T13:01:43.748+0000","up_votes":1,"down_votes":0,"body":"Bueno, queda ver si Riot comenta más al respecto. Personalmente quisiera ver que le intenta sacar algo más de provecho a la Grieta, que solo un lugar más y ya... Veremos que ocurre.\n\nClaro que a eso me refiero. Tampoco es la idea que pongan como objetivo bailar 10m frente a Baron esperando que baile con uno, jejeje. La idea es que los objetivos siempre sean cosas relacionadas con el juego. Como sugerí, puede ser una cantidad mínima de minions en una partida, por poner objetivos simples. Para las últimas etapas del volumen, deberán ser cosas más complejas, que ciertamente no se puedan completar en una partida, como matar X veces a un Baron (solo uno por partida). OBIAMENTE, si alguien se va AFK, aunque su team gane la partida, que el progreso no se registre. No sería justo. Por otro lado, también me planteo si sería buena idea que el progreso solo se pueda dar con victorias.\n\nEn este punto ya veo algo difícil eso... Eres el único que se mantiene atento al post :X\nPero he conseguido un buen feedback, así que gracias ^^","replies":[{"poster":"Vi Sexual","date":"2016-02-25T01:29:30.631+0000","up_votes":1,"down_votes":0,"body":"Es que la verdad es algo que me interesa bastante.\n\nSabes hablar/escribir ingles? porque si la respuesta si, podrías plantear este tema en un post en Reddit (donde polulan bastantes Rioters de NA) ademas de que podrias llegarle a muchas mas personas. \nSi necesitas ayuda en traducir el post y/o publicarlo, me ofrezco en facilitarte lo que mas pueda.\nOjala se llegue a algo :).","replies":[{"poster":"ElXandresX","date":"2016-02-25T02:00:11.072+0000","up_votes":1,"down_votes":0,"body":"También me he planteado dejarlo en Reddit, y si, se hablar/escribir inglés. Pero claro está que un post de tal magnitud demoraría lo suyo en traducirlo debidamente. Pero la no práctica en ello, me complica un poco las cosas... Primero haré como tenía planeado, pondré el post en LAN para ver que más se puede obtener de acá en Latinoamérica (:\n\nEventualmente veré como logro postearlo en otros lados como Reddit o incluso en NA, nunca se sabe... Y claro está que cualquier ayuda es bienvenida ^^","replies":[{"poster":"Vi Sexual","date":"2016-02-25T02:29:32.101+0000","up_votes":1,"down_votes":0,"body":"Bien, entonces no dudes en agregarme y/o comunicarte conmigo que en lo que necesites para difundir esta idea, estoy disponible.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"ElXandresX","date":"2016-02-21T03:57:40.796+0000","up_votes":1,"down_votes":0,"body":"Supongo que agregare una nueva palabra a mi diccionario... Je\nBueno, mas sobre eso al meno yo no tengo para decir, el juego competitivo y yo no funcionamos simplemente.\n\nLo se sobre los Rioters, pero hasta donde se los voceros pueden funcionar en dos sentidos, y eso es lo que busco con mi comunicado principal :V\n\nBueno es saber que concordamos en algo mas (8)\n\nLo fundamental de esto, es que LoL tiene un gran potencial en su historia, pero no lo aprovecha debidamente.\n\nEste sistema que propongo no haría que todos tuvieran acceso a los \"volúmenes\", si no que les daría la posibilidad de obtenerlo. Por ello en primer lugar considero estos deben de ser vendidos, pues aunque tengas el descuento completo sigue siendo una cantidad de IP o RP a considerar. Eventos como U.R.F. no pasaran al olvido, pues es como navidad en LoL. En cambio lo demás... :X\n\nSaludos!","replies":[{"poster":"Vi Sexual","date":"2016-02-21T04:22:19.289+0000","up_votes":1,"down_votes":0,"body":"Esta perfecto, no a todo el mundo le gusta competir, como no a todo el mundo le interesa la historia, en eso estamos de acuerdo tambien jaja.\n\nY si, ojala funcionara (no digo que no funcione, sino que ojala funcione en este caso) asi. Me da esperanza saber que por ejemplo, la skin de Fizz del Vacio fue gracias a una propuesta salida de aca de Las, tal vez se repita la historia.\n\nTotalmente de acuerdo. Un poco en relacion, y un poco aparte; como te conte en el tocho gigante de texto de arriba, soy amante (no en sentido erotico-fisico eh jajaja) de Vi y su lore, por lo tanto soy seguidor de Gipsylord (creador de Vi). En estos dias, menciono en el foro de NA, que le ve demasiado potencial al lore de Piltover, mas especificamente al de Caitlyn ( y por correspondencia, al de Vi). Opino igual que vos, y que él, lo dijo de manera \"tapada\" pero lamentablemente Riot no toma su potencial en lore como lo vemos nosotros, de afuera.\n\nCon URF el \"problema\" es, justamente como mencionaste, que es un modo de juego, no un evento en si (el evento en todo caso seria el April's fools day). Lo traje a la narracion mas que nada para comparar el POR QUÉ es tan \"deseado\" y tal vez sacar alguna conclusion y/o solucion para que sea el Lore el que se vuelva deseado. Seamos sinceros, a mi (parece que a vos tambien) y a bastantes, aunque no la mayoria, disfruta de leer la historia. A mi particularmente no me molesto para nada tener 5 parrafos para leer del Evento de AguasTurbias, pero tambien me paso de tener amigos que \"ahhh mucho para leer, prefiero jugar directamente\" o como nuestro amigo aca en el post, que prefieren un TL;DR. Lo cual, repito, no esta mal, no a todo el mundo le tiene que gustar la historia, simplemente me gustaria que le gustase al menos a un par mas.","replies":[{"poster":"ElXandresX","date":"2016-02-21T15:13:14.794+0000","up_votes":1,"down_votes":0,"body":"Mira tú, sabia que era una skin de un jugador, pero no que fuera de LAS. Jeje\n\nAhí mismo tienes un buen ejemplo, el lore del juego tiene un enorme potencial, no solo conceptos para sacar algunos campeones y darles algunas estrechas relaciones entre si. Personalmente me gustaría que profundicen más en el lore del Vacío o en Viktor, a quien desde hace tiempo parecen tener olvidado...\n\nPor ello propongo que por medio de este modo se cuente la historia en diversas formas, no solo con páginas de texto. Me pareció un muy buen movimiento por parte de Riot hacer que en ARAM Lissandra cuente la historia al acabar la partida, francamente me tomo por sorpresa descubrirlo. Ese tipo de cosas son buenas maneras de profundizar la historia en un juego que se le dijo alguna vez \" un MOBA no es la mejor forma de transmitir una historia\". Jeje","replies":[{"poster":"Vi Sexual","date":"2016-02-21T21:52:39.174+0000","up_votes":1,"down_votes":0,"body":"Si si,totalmente de acuerdo.","replies":[]}]}]}]}]}]}]},{"poster":"LovelySenpai","date":"2016-02-20T23:13:18.697+0000","up_votes":1,"down_votes":0,"body":"Alguien pongase un TL;DR , Gracias.","replies":[{"poster":"Vi Sexual","date":"2016-02-20T23:35:55.833+0000","up_votes":3,"down_votes":0,"body":"TL;DR:\nPropone un modo campaña con recompensas desbloqueables para que los jugadores se interesen en la historia de LoL","replies":[{"poster":"LovelySenpai","date":"2016-02-20T23:55:03.789+0000","up_votes":1,"down_votes":0,"body":"Me gusta la idea, gracias por el TL;DR","replies":[{"poster":"ElXandresX","date":"2016-02-21T02:39:09.436+0000","up_votes":2,"down_votes":0,"body":"Algo se me tenia que olvidar :V\nGracias Sennaku!","replies":[{"poster":"Vi Sexual","date":"2016-02-21T03:28:16.352+0000","up_votes":1,"down_votes":0,"body":"jajajaja Sennaku, dando TL;DR desde tiempos inmemoriables x)","replies":[]}]}]}]}]},{"poster":"Fiky","date":"2016-02-21T00:27:08.894+0000","up_votes":1,"down_votes":0,"body":"que yo tenga entendido {{champion:127}} fue la que ganó la guerra, no estoy seguro que tenga mucho que ver pero los objetos {{item:2301}} y {{item:3092}} tienen que ver aunque no haga mucha referencia a ella particularmente. Lo que si, con cada evento pequeñas cosas nos dejan, no muy notorias por ejemplo la ultima {{item:3742}} hace referencia a {{champion:41}} y entre más campeones nuevos salen, más se profundisan ingame estas cosas.\n\nNo estoy seguro de que el modo \"campaña\" sea una solución, creo que está bien esto de que el juego y la parte sería venga por un lado y el lore, los eventos por otro, hay gente que realmente no le interesa, a mi si... me gusta más leer que ver un vídeo, pero eso es cosa mía.\n\nAhora bien, te pongo un ejemplo, estoy en promo a.. no se digamos, oro 5... uno de mis compañeros tiene como objetivo asesinar al barón Nashor, estamos ganando, pero el quiere terminar su misión... todo sale mal nos lo roban y perdemos, cosa que se podía evitar porque tenían el nexo al descubierto. \n\nYo creo que tu propuesta es buena, pero en modo de eventos un tanto más seguidos... el ritmo al que estamos acostumbrados no es del todo conveniente pero se que también lleva tiempo organizar y preparar todo, más allá de que el LoL sea un juego más competitivo y no tanto de historía","replies":[{"poster":"ElXandresX","date":"2016-02-21T02:36:25.820+0000","up_votes":1,"down_votes":0,"body":"Bueno sabía que me debía de haber equivocado en algo jeje.\nPero en parte en eso está mi punto. Ahora mismo gente como yo da casi por sentado algunos hechos que no son más que rumores. Esto a la larga solo crea falsas teorías y confusión entre el público, por tanta especulación.\nAhora si de verdad fue Lissandra quien gano la guerra, tiene más sentido que existan esos objetos. Pero sobre la coraza estoy casi seguro que fue uno de los objetos presentes durante el evento y su modo de juego, y que debido al buen feedback de la comunidad se decidió integrar más tarde. Pero ahora que término de escribir esto lo estoy dudando... No me hagan caso mejor :X\nA mi también me gusta la lectura, pero todo el texto narrando el nuevo lore de las \"Islas de las Sombras\", en palabras de un amigo, se cansó solo de ver lo párrafos jejeje. Bueno fue un mal ejemplo.\n\nY claro, olvide aclarar un punto importante, que es que estos objetivos SOLO se puedan completar jugando normales y para NADA  durante las Rankeds. No hay que mezclar las cosas. Si alguien se limita a cumplir lo que le falta y quedarse AFK luego, que este progreso no se considere.\n\nNo discuto que el LoL sea basado en el competitivo, lo que apunto es que no se deje la historia de lado, pues el cómo se plantea su evolución, no resulta ser tan eficiente.\n\nSaludos!","replies":[{"poster":"DkA Darkito","date":"2016-02-21T03:13:34.145+0000","up_votes":1,"down_votes":0,"body":"Yo pensaba más en un modo campaña Single Player, o sino uno de un team, pero todos con la misma temática (para dar la concordancia a la obra) contra una serie de desafíos. Un MvP en resumen, los jugadores contra el entorno que propondría Riot. Aunque claro, esto SÍ que tomaría tiempo, sería como un nuevo juego básicamente, aunque yo lo esperaría xD.","replies":[{"poster":"ElXandresX","date":"2016-02-21T03:40:56.527+0000","up_votes":2,"down_votes":0,"body":"También pensé en eso en su momento, pero resulta que si fuese así eso realmente alejaría la historia del juego como es. El juego mismo no es manejar un campeón, comprarle cosas y mejorarlo, el juego es asumir el papel de lo que alguna vez fue el invocador, y junto a tu equipo combatir contra el equipo rival.\nBTW igual quisiera probar un modo single player :V","replies":[]}]}]}]},{"poster":"Are You Oky","date":"2016-02-21T01:42:28.199+0000","up_votes":2,"down_votes":0,"body":"Me encantó leí todo fue bastante largo pero me gusta leer y tampoco es tan grande el texto como un libro de 500 hijas \nY la verdad no creo q hagan esto por dos cosas una insignificante y otra un poco más significativa\n1- este foro es muy poco visto por riot \n2- riot tardaría 1 año o menos (Nose cuantos trabajadores tiene riot ) pero eso gastaría mucho dinero y trabajo y es un montón con lo q ya han dado \nLos iconos de freljord, la skin de gankplack capitán y no se si algo más. Aunque es poco es mucho. \nA mi me encantaría obtener esas cosas q decís como mods de mapas o cambiar al narrador eso me encantaría ya q me gustaron mucho pero riot ha dicho q no hace estas cosas porq no ha muchos les gusta leer o ver estas historia \n\nTe doy tu +1 para ver si riot un día pasa a ver este comentario Tuyo y se da una idea así. Sigue adelante por tus sueños","replies":[{"poster":"ElXandresX","date":"2016-02-21T02:45:50.918+0000","up_votes":1,"down_votes":0,"body":"No estoy tan seguro que el foro no sea visto por Riot, solo que no creo que  se dediquen a contestar todo lo que aparece en él. Pero ya es otra apreciación mía...\nEl propósito no es obtener las skin o los iconos, esa es solo una sugerencia más para hacer los \"volúmenes\" más llamativos y tentadores. Felizmente pueden descartar esto si gustan.\nCualquier forma de apoyo en el margen de lo permitido, la agradezco ^^\nMis sueños van más allá que esto, pero sería un buen comienzo. (8)\n\nSaludos!","replies":[]}]},{"poster":"ElXandresX","date":"2016-02-24T13:06:04.341+0000","up_votes":1,"down_votes":0,"body":"Bueno gente, a todos los comentaron y le dieron up al post, gracias. Tristemente esto está quedando en el limbo, y no se podrá vera que progrese mucho en el tiempo. No por eso me rendiré, pues he decidido recrear esta sugerencia en LAN, con todo el feedback que han aportado (:\nClaro está que este post seguirá activo y lo responderé siempre que se pueda.\n\nSaludos y suerte!","replies":[]},{"poster":"Costal de Basura","date":"2016-02-22T06:34:33.424+0000","up_votes":1,"down_votes":0,"body":"Antes de todo, tengo que decir que me leí todo, 30 minutos leyendo :v\nbaia :v comento por 2 cosas: por favor que un rioter lea esto porque la verdad esta buenisima tu proposición, muy bien redactada y desarrollada, aunque se nota el corrector de palabras de office :v\nY bueno, la otra cosa, quería dar mi \"opinión\" por decir asi xd\nsi bien es cierto que la historia del lol está mal desarrollada y tiene sus vacíos, hay un porque detras de esto: es un MOBA, un rioter dijo que un MOBA no era lo mejor para contar una historia. Respecto a tu solución, me parece increíble, me parece algo así como Hearthstone: puedes comprar expansiones por dinero real o por monedas del juego, y cada expansión tiene sus respectivas recompensas. Sin embargo, siguiendo con la solución, la verdad me parece buena, pero no aplicable, al menos no para un MOBA. Para que pasara lo que tu dices el LoL tendría que convertirse en un RPG, por lo que dejaría todo el lado competitivo de lado, que, sinceramente, no creo que Riot quiera hacerlo. \nMi solución (Estúpida, pero fue lo que se me vino a la cabeza a las 3:30 de la mañana :v) es que Riot, al ser una EMPRESA, desarrolle otro juego que sirva para seguir con el lore del lol. \nEs decir, Riot Games tiene solo un juego, que es el LoL. Vean a Blizzard, tiene (creo) 5 franquicias grandes, cada una con su historia. No quiero hacer comparaciones ya que es obvio que Riot, al ser mas nuevo en la industria, no puede competir con una empresa que lleva decadas, como lo es Blizzard. Esta solución llevaria años de desarrollo, pero es simplemente una idea :v\nQuizás no me explique bien, tengo sueño ñkasldkasd\nnos vimos :v","replies":[{"poster":"ElXandresX","date":"2016-02-22T13:50:25.010+0000","up_votes":1,"down_votes":0,"body":"Cuando leas esto lo único que puedo recomendarte es un buen tazón de café e.e\n\nNo es como que intente ocultar lo del Office.....    (8)\n\nLa verdad no te explicaste bien, jeje. ¿Por qué se convertiría en un RPG? Mi propuesta consta de misiones que se mantiene registrado su progreso, a modo que permiten el desarrollo e involucración del jugador en la historia. Ok, así en parte funcionan los RPG's, pero el \"progreso\" de nuestro \"héroe\" se reinicia al acabar cada partida de modo que se debe iniciar una nueva. Sin mencionar que no siempre es requerido usar al mismo personaje, y en contextos diferentes dependiendo de los objetivos. El progreso no es a nivel personal de un jugador y sus capacidades, sino que es para/con el lore del juego. Tal vez luego de ese café puedas hacer que mi tonta cabeza razone mejor esto x.x\n\nNo se me había ocurrido la idea de otro juego, pero de hecho no es mala. El detalle es que eso definitivamente requiere un mayor presupuesto por parte de Riot para invertir. Como dato curioso, se que Riot de hecho tiene planes para un nuevo juego bajo su nombre, que debería empezar a mostrarse al mundo como es, durante este este año. Pero también dijeron que no iba a estar relacionado con LoL :X\n\nBueno, queda esperar lo que dice Riot al respecto de lo último.\n\nSaludos!","replies":[]}]},{"poster":"LyghtSh","date":"2016-02-22T01:17:12.201+0000","up_votes":1,"down_votes":0,"body":"No llegue a leer todo porque no me dieron los 20 minutos de baja prioridad para leerlo, pero debo contribuir diciendo, que ujna de las razones que \"\"\"eliminaron\"\"\"\" el viejo lore, era porque le quitaba \"poder\" o \"realismo\" al lore, debido a que como era posible que bestias como nasus, renekton, xerath, cho gath, fueran controladas por invocadores?, como que els quitaba ese aire de \"super poderosos\" a los campeones.","replies":[{"poster":"ElXandresX","date":"2016-02-22T13:37:17.500+0000","up_votes":1,"down_votes":0,"body":"Ciertamente con eso taparon vacíos en la consistencia del antiguo lore, pero a su vez crearon otros x.x","replies":[]}]}]}