{"poster":"II Mc Pott II","date":"2016-04-21T07:17:18.863+0000","title":"2-3 Sekunden lags bei Teamfights etc.","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey,\r\n\r\nich hab mir jetzt einige Posts durchgelesen, welche sich mit lags, FPS-Drops oder Pingproblemen etc. befassen. \r\nAllerdings hilft nichts bei mir. Desweiteren habe ich auch keine FPS oder Pingprobleme.\r\n\r\nIch versuche mal die Situation zu beschreiben:\r\nIch bin in der Mitte... Jungler denkt dr&uuml;ber nach zu ganken und steht im Busch... sobald der engage beginnt, der Jungler also den Busch verl&auml;sst, habe ich f&uuml;r 2-3 sekunden ein Standbild, welches nat&uuml;rlich den ganzen Gank in Sand setzt... Gerne Passiert sowas auch, wenn der gegnerische Tower gerade das Feuer auf mich er&ouml;ffnet, was nach Ende des Standbildes nicht selten mit dem Tod bestraft wird. Ebenfalls, wenn ich einen Busch betrete wei&szlig; ich f&uuml;r 2-3 sekunden nicht, ob ich gerade in eine riesen Falle laufe oder alles ok ist...\r\n\r\nIch habe mal einen Post gefunden, welchen ich nach dem Formatieren meines Rechners leider nicht wieder gefunden habe.\r\nDa wurde auf der gef&uuml;hlt 14. Seite eine Antwort gepostet die geholfen hat. Ich sollte in der Aufgabenplanung einen Task erstellen, welcher sich (ich glaube) &#039;AMP_off&#039; nannte... Danach war alles super! Nur finde ich diesen, oder vergleichbare Posts nicht mehr.\r\n\r\nDiese Lags nerven echt hart... Hat jemand n Tipp?\r\nIch kann leider nicht sagen, wann das angefangen hat... aber Treiber etc. sind auf dem neusten Stand.\r\n\r\n\r\nMc Pott","replies":[{"poster":"Shiny Absol","date":"2016-04-21T13:39:02.023+0000","up_votes":1,"down_votes":0,"body":"Hast du mal deinen Treiber downgraded? Hab seit Samstag einen neuen Rechner und hatte bis gestern dasselbe Problem.\nHatte ab und zu mal random freezes obwohl bei mir alles auf dem neusten Stand ist. Und versuche mal deine fps zu cappen und lasse sie nicht uncapped ^^ Der neuste Nvidia 960 Treiber macht wohl Probleme im Bezug auf LoL bei mir... Hab mir dann einen älteren Treiber installiert.","replies":[]},{"poster":"HaudenSack","date":"2016-04-21T10:57:21.423+0000","up_votes":1,"down_votes":0,"body":"Versuch mal das Spiel auf dem C:\\\\  bzw auf der SSD zu installieren.\n\nHatte ein ähnliches Problem und bei mir hat das funktioniert.","replies":[]},{"poster":"p0hil","date":"2016-04-21T09:22:14.533+0000","up_votes":1,"down_votes":0,"body":"Inwiefern hast du denn schon alles ausprobiert ? Eine Aussage wie 'Hab schon alles ausprobiert' kann alles sein, daher eher schwer einzugrenzen um dir zu helfen.\n\nHast du denn auch versucht dein Spiel zu reparieren oder mal neu zu installieren ?\nUm das Spiel zu reparieren öffne dein League of Legends (nicht einloggen), geh dann oben rechts auf das Fragezeichen und dann auf 'Spiel reparieren'.\n\nSolltest du das Spiel neu installieren wollen, denk bitte bei der Deinstallation daran alle Restdaten von League of Legends zu löschen, da bei der Deinstallation nicht alle Daten automatisch gelöscht werden.","replies":[{"poster":"II Mc Pott II","date":"2016-04-21T09:53:19.958+0000","up_votes":1,"down_votes":0,"body":"naja, genau sowas^^\nSpiel neu installiert/repariert\nInternetverbindungen gewechselt (Wlan/Lan)\nTreiber aktuallisiert\nGrafik umgestellt (läuft auf High genau so wie auf low)\n\nKannst du dir vorstellen, was das für ein Task gewesen sein könnte, welchen ich in der Aufgabenplanung eingrichtet habe?\nDanach hats nämlich immer super funktioniert. (Den Task musste ich nach jedem Start von Windows ausführen.)","replies":[{"poster":"p0hil","date":"2016-04-21T10:21:39.082+0000","up_votes":1,"down_votes":0,"body":"Ich kenn AMP OFF nur als Shutdown für Windows, also damit dieser nach einer bestimmten Zeit Windows herunterfährt, neustartet o.ä.\n\nAllerdings die Programme wie AMP winOFF haben die Funktion den Rechner in den Ruhemodus zu setzen, oder Energiesparmodus. \nKönntest du bitte nachsehen ob bei dir der Energiesparmodus aktiviert ist ?","replies":[]}]}]}]}