{"poster":"IxPROJECTxI","date":"2015-10-14T01:53:52.081+0000","title":"FIORA IST ZU OP","subforum":"Champions & Gameplay","up_votes":1,"down_votes":9,"body":"0 skill der champ %%%%t alles auf der top-line","replies":[{"poster":"Scrotum 420","date":"2015-10-14T11:14:32.522+0000","up_votes":1,"down_votes":1,"body":"> wie den Mordekaiser-Bann in der Silver-Ranked Elo. Die wenigsten spielen ihn, und davon die wenigsten können ihn\n\nÄhm... Wie kann man Mordekaiser \"nicht können\"? Ist genau so ein Haudrauf-Champ wie Darius. 0 Skillz.","replies":[{"poster":"MeDontEnglish","date":"2015-10-14T12:43:33.298+0000","up_votes":1,"down_votes":0,"body":"Wenn das Gegnerteam weiß was es zu machen hat, kann man Morde vergessen - außer er ist besser.\nAber ein gutes team mit einem guten ADC und etwas CC/Slow wird dafür sorgen das ein Morde niemals an die Carrys rankommt und das der ADC ihn zu tode kiten kann.\n\nMorde brauch vlt nicht so viel Skill bei den Fähigkeiten aber dafür beim Decision making!","replies":[]}]},{"poster":"Gâlahad","date":"2015-10-14T12:41:47.835+0000","up_votes":1,"down_votes":0,"body":"Fiora kann fies sein mit manchen Champions. Im Notfall einfach Rüstung und Leben kaufen, safe spielen und dann findest du sie vmtl. gar nicht mehr so OP.\nVor dem Rework habe ich meistens als Counter-Pick Volibear genommen und hatte nach wenigen Minuten meistens stats wie 8/0, aber kA ob das nach dem Rework auch noch so gut klappt.","replies":[]},{"poster":"Der Wohltäter","date":"2015-10-14T02:02:48.715+0000","up_votes":1,"down_votes":0,"body":"Sonst noch was?","replies":[{"poster":"OrangeBubble","date":"2015-10-14T11:03:27.338+0000","up_votes":1,"down_votes":0,"body":"Kindred ist op? ._.","replies":[]}]},{"poster":"HxH Clayman","date":"2015-10-14T03:17:48.542+0000","up_votes":1,"down_votes":0,"body":"**Jaja und eine Lulu ist OP, ein 0:25:0 Nocturne ist auch OP, Oh ich vergaß die 3:16:2 Soraka :o **\n\nMan man man wieso meint ihr immer das ein Champ \"OP\" sei, nur weil ihr ein bis zweimal gegen ihn auf der Lane verloren habt? Weil vllt ein anderer Spieler ihn gut spielen kann. Deine Aussage finde ich genauso Schwachsinnig, wie den Mordekaiser-Bann in der Silver-Ranked Elo. Die wenigsten spielen ihn, und davon die wenigsten können ihn. Anstatt immer rumzuheulen, dass ein Champ \"OP\" sei, schaut euch lieber Guides an wie ihr den und den gut Countern könnt, oder vorrangig schaut euch Guides an, wie ihr euren eigenen Champ zu spielen habt -.- .{{summoner:14}} {{summoner:14}} {{summoner:14}}","replies":[{"poster":"Kartoffelking983","date":"2015-10-14T04:42:52.952+0000","up_votes":1,"down_votes":4,"body":"Also ich sehe fast jedes game einen morde im ranked wenn ich ihn nicht banne und es ist schon etwas op wenn ne fiora auf einen springt 5 hits macht und man nurnoch 60 hp hat oder ein teemo ne q macht 15ß2064i35ß069i hp abzieht und man dann noch am gift stirbt","replies":[]}]}]}