{"poster":"21 Fiora","date":"2018-07-27T04:34:38.897+0000","title":"Skins que valgan 100% la pena comprar.","subforum":"Guias y consejos","up_votes":1,"down_votes":1,"body":"S&oacute;lo eso, no me puedo decidir","replies":[{"poster":"Mecha Sétt","date":"2018-07-27T04:39:54.264+0000","up_votes":3,"down_votes":2,"body":"Una skin de tu  campeon preferido con buenos efectos de particulas. esa vale 100% la pena comprar. Me gusta warwik y una de mis mejores compras, fue warwik guardian lunar y warwik urf.","replies":[]},{"poster":"Musidora Klemm","date":"2018-07-27T12:17:33.189+0000","up_votes":2,"down_votes":1,"body":"Mmmmm.. bueno a ver. Vi que campeones usas en rankeds así que voy a usar esos para recomendarte skin.\n\nFiora: veraniega ( es una temática que me gusta mucho) también tiene skin proyecto. No es una temática que me guste pero es popular y tiene buenos efectos.\nAhri: Guardiana estelar o Arcadia.\nTristana: si esperas a octubre que salen las skins de Halloween la de brujita está realmente buena. Entrenadora de dragones es una buena opción.\nYasuo: la skin de Portador del anochecer, es de las caras si mal no recuerdo pero eso ves vos cuanto queres gastar, como con Fiora, Yasuo tiene skin proyecto. Otra linda sino es luna de sangre.\nIrelia: a mi me gusta la de orden del loto, no es una skin con efectos cambia la apariencia y nada más.\nKatarina: reinos en guerra o proyecto\n\nSkins random que a mi me gustan: Varus/Orianna estrella oscura, fiddlesticks fiesta sorpresa, Ashe y Shyvana de campeonato, Hecarim de Arcadia (bah cualquier skin de Arcadia me gusta), Gangplank nova terrorífica, Garen reinos en guerra, Darius Rey de las Clavadas, Sion mecha Zero, Galio kikiriki o cómo se llame la que está vestido de gallina, Morgana embrujada, Riven Portadora del amanecer, Nunu bot, Alistar Vaquita Mu, Shen pulso de fuego, la temática Programa.","replies":[]},{"poster":"SumbalumbA","date":"2018-07-27T20:14:51.591+0000","up_votes":1,"down_votes":1,"body":"Personalmente: Ashe de campeonato. Jax Báculo Divino. Zed juramento funesto. Malzahar y Brand subjefe. Garen Rey divino. Rakan alba cósmica. Karma orden de loto. Ezreal pulso de fuego. Proyecto Vayne. Shen luna de sangre. Udyr guardián de espíritus. La de rammus que es un escarabajo. Jhin el forajido.","replies":[]},{"poster":"Falkon","date":"2018-07-27T15:44:28.459+0000","up_votes":1,"down_votes":1,"body":"Pizzivir, Proyecto Vayne, Yasuo Portador del Anochecer,Kayle Pentakill, Proyecto Vi, Yi Espada cosmica, ya sabes, cosas legendarias mas que nada.","replies":[]},{"poster":"fenixerege","date":"2018-07-27T12:13:56.360+0000","up_votes":1,"down_votes":1,"body":"la skin que mas te va a gustar va a ser del campeon que juegues con mas regularidad, hay skin muy lindas y los cromas tambien les queda muy bien a varias skins","replies":[]},{"poster":"Kamikaze Lenna","date":"2018-07-27T12:07:36.403+0000","up_votes":1,"down_votes":1,"body":"yazuo portador del anochecer :)","replies":[]},{"poster":"ChocoMix","date":"2018-07-27T05:00:39.060+0000","up_votes":1,"down_votes":1,"body":"Solo te diré que si quieres comprar alguna skin de un campeón mires un video en youtube donde muestren todas (ojala de este año) o las pruebes en el PBE antes de comprarlas.\n\n^ Ese consejo es porque hay algunas skins de 750 o 975 que realmente valen la pena y que deberían costar 1350.   Un ejemplo es Irelia Aviadora, que cuesta 520 pero tiene la calidad para ser de 975.","replies":[]}]}