{"poster":"Lucke","date":"2017-11-18T01:20:28.134+0000","title":"Que pasó con Skarner?","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Hola gente, este tema se me vino a la cabeza al jugar un aram y me toc&oacute; skarner.\r\n\r\nEstaba pensando que hace muuucho tiempo no veo un skarner en partidas normales o clasificatorias.. esta nerfeado? o solo se a dejado de jugar? antes lo veia en alguna que otra partida, pero ahora nunca lo veo.. \r\n\r\nSaludos {{champion:131}}","replies":[{"poster":"Punchygus","date":"2017-11-18T01:46:55.299+0000","up_votes":2,"down_votes":0,"body":"No sabria decirte, es un campeon muy bueno. Pero la gente lo unico que quiere jugar es zed o yasuo. Asi es esto my friend","replies":[]},{"poster":"Lucke","date":"2017-11-19T16:46:11.098+0000","up_votes":1,"down_votes":0,"body":"Wow, gracias por todas sus teorias/respuestas!","replies":[]},{"poster":"Sosio la extraño","date":"2017-11-18T12:26:50.722+0000","up_votes":1,"down_votes":0,"body":"Te aviso, Skarner ERA un campeón bastante bueno, con un buen daño, una buena ulti, su E que ralentizaba mucho, etc, su pasiva que junto con su E era muy buena, Pero a Riot se le ocurre cambiar muchas cosas del campeón, l antigua pasiva esta en la E, su pasiva np sirve en TF a menos que sean en la jungla, su Q ya no pega tanto a menos que lo hagas asesino (además de que esta habilidad no tiene daño básico al igual que la R) y LO PEOR QUE LE HICIERON ES NO PODER GOLPEAR AL CAMPEÓN QUE TENGAS ATRAPADO CON LA R, NUNCA SABRAS DEL VERDADERO MIEDO CUANDO SKARNER DE AGARRABA CON SU R Y TE PEGABA Y TE LANZABA SU E Y DOS Q Y TE ACTIVABA SU PASIVA, ERAN COMO 5 SEGUNDOS DE STUN, PERO A RITO LE GUSTA HACERNOS SUBRIR\nPD: Soy m5 con Skarner y lo uso desde hace mucho tiempo (ya ni me acuerdo) pero después del rework ya casi ni lo uso","replies":[]},{"poster":"Rock41t","date":"2017-11-18T04:52:09.660+0000","up_votes":1,"down_votes":0,"body":"Horrible el rework que le hicieron ademas de que la pasiva es inbalanceable (o esta rota o es inutil, no hay puntos medios). Probablemente cuando le hagan el rework anual a Rize vuelvan a reworkear a Skarner.","replies":[]},{"poster":"TSW Rorschach","date":"2017-11-18T04:19:01.525+0000","up_votes":1,"down_votes":0,"body":"Tal vez solo no es popular ni se rompió (o no le han descubierto lo roto) con las nuevas runas. La verdad que cuando lo jugué no me pareció un mal jg.","replies":[]},{"poster":"MarKowniKoff","date":"2017-11-18T02:01:25.327+0000","up_votes":1,"down_votes":1,"body":"Skarner? Que es eso? Un nuevo item? xd \nLa season pasada creo que era estuvo entre los tops jg pero ni asi se jugaba, quiza en elo alto, pero en bajo no se jugaba. A parte es aburrido, y en elo bajo todos juegan asesinos xd","replies":[{"poster":"Cuchufleitor","date":"2017-11-18T03:43:54.009+0000","up_votes":1,"down_votes":0,"body":"No se, a mi se me hace muucho mas aburrida una sejuani y la vez hasta en la sopa. El tema es que la ultimate no pega con la onda coloso del personaje, creo que eso lo arruina un poco. deberia ser alg que le sirviera mas como duelista y no tanto de utilidad.","replies":[]},{"poster":"Nuke","date":"2017-11-18T02:15:06.331+0000","up_votes":1,"down_votes":2,"body":"¿Aburrido? Depende, si lo llevas tanque si... PERO SI LO LLEVAS ASESINO... :V\n\nhttps://i.gyazo.com/97fd16ab90cb901aa67d6c79ff6d3344.mp4\n\nhttps://i.gyazo.com/dfd37c93d320cae7217b974f36404c2b.mp4","replies":[]}]},{"poster":"Zafphlyn","date":"2017-11-18T02:22:34.621+0000","up_votes":1,"down_votes":0,"body":"Por esta razón {{item:3140}}","replies":[]},{"poster":"Nuke","date":"2017-11-18T02:13:57.781+0000","up_votes":1,"down_votes":0,"body":"Esta pregunta se puede formular a muchos campeones.\nEs que es de esos champs que nadie usa por pura popularidad. Depende tu liga, no se.\n\n\n\n¡Saludos!","replies":[]}]}