{"poster":"Azhit","date":"2015-02-14T02:43:49.164+0000","title":"Poros de Fiesta de Máscaras","subforum":"Charlas Generales","up_votes":15,"down_votes":1,"body":"Hola solo vengo a proponer una idea que estaria buena. Me encantaría que los poros que representan cada personaje de lol ( http://promo.las.leagueoflegends.com/es/fiesta-de-mascaras-2015/rewards.html ) nosotros pudieramos tener uno de esos poros gratis y utilizarlo como icono en el juego. \n\nLa idea esta buena porque cada uno elegiría el poro que mas le guste y que represente a su campeon favorito, además de que habrá muchísima variedad de íconos de poros, sería genial!! Y ademas no se, me siento de otra manera si tuviera a mi poro Azir. Y SOLO SE PUEDE TENER 1 ICONO PORO POR CADA JUGADOR.\n\nOjala les haya gustado la idea y la implementen. Para lograr tener el aspecto del campeon poro que te guste tendrias que jugar con dicho campeon en el creador de equipos (asi en normal no se la pasan trolleando solo porque quieren ese porochamp).\n\nGraciaaas por leer","replies":[{"poster":"GødLîkë","date":"2015-02-14T03:42:53.577+0000","up_votes":4,"down_votes":0,"body":"se ve genial !\n\nlo que no me gusta es como sobre explotan los poros en cada evento...  pobres criaturitas... No enserio busquen algo mas ya cansa un poco tanto poro acá poro allá... administren mejor los poros o los van a extinguir.{{summoner:31}}","replies":[]},{"poster":"Romte","date":"2015-02-14T19:49:07.712+0000","up_votes":2,"down_votes":0,"body":"A mi me gustaria que los pongan en la tienda, pero por IP porfavor, o en todo caso por RP e IP, están muy buenos y creo que si no les dan uso dentro del juego se desperdiciaria un poco el gran trabajo que han hecho para crearlos","replies":[]},{"poster":"Azhit","date":"2015-02-16T22:46:25.720+0000","up_votes":1,"down_votes":0,"body":"Y que onda, necesito alguna respuesta (UP)\n\n{{champion:61}}    {{champion:268}}","replies":[]},{"poster":"juancuko","date":"2015-02-14T03:48:31.493+0000","up_votes":1,"down_votes":0,"body":"la verdad que si seria genial que pudiéramos elegir entre todos esos, y la idea de que sea solo uno esta buena, le da mas exclusividad al asunto.. ojala que lo implementaran.. aunque lo dudo mucho :S \nme pido uno de {{champion:59}} el porincipe de demacia!","replies":[{"poster":"Mat Voyny","date":"2015-02-15T21:29:02.353+0000","up_votes":1,"down_votes":0,"body":"en días asi solo tienes que agarrar tu espada innecesariamente grande y girar gritando \"DEMACIAAAA\"","replies":[]}]},{"poster":"Nahuey","date":"2015-02-14T17:57:50.492+0000","up_votes":1,"down_votes":0,"body":"Buena idea!","replies":[]},{"poster":"Deal With it","date":"2015-02-14T17:55:02.637+0000","up_votes":1,"down_votes":0,"body":"por ultimo que lo pongan en la tienda a 250RP o 3500 de PI :3 tambien seria buena idea :P\npd: como se consigue el icono de teemo?","replies":[]},{"poster":"Galathria","date":"2015-02-14T07:50:25.935+0000","up_votes":1,"down_votes":0,"body":"Está buenísima la idea. Pero lamentablemente no creo que se dé. Riot Games no escucha tanto a las ideas de LATAM. Recomendaría que hagas este post en inglés en el EU o NA server. También, me imagino, las mentes de los administradores de LATAM se deben estar centrando en arreglar la inestabilidad.\n\nDeseo esté equivocado y tu idea sea tomada y realizada, pues mucho me gusta. \n\nPD: Mi ícono sería de {{champion:34}}","replies":[{"poster":"Azhit","date":"2015-02-14T13:39:59.136+0000","up_votes":1,"down_votes":0,"body":"En eso tenes mucha razón, aca no nos darian bola a una idea.\n\nPD: El mío sería de {{champion:268}}  o  {{champion:61}}","replies":[]}]},{"poster":"GaßY","date":"2015-02-14T11:46:57.277+0000","up_votes":1,"down_votes":0,"body":"Creo que habilitaría la opción de poder elegir las fotos de los poros como ícono dentro del foro.","replies":[]},{"poster":"IrOAChI","date":"2015-02-14T04:27:24.625+0000","up_votes":1,"down_votes":0,"body":"Me encantaría, como con los iconos de freljord que los iconos eran 3 y solo podías elegir 1\nMe encanta los iconos ''únicos'' Es mi favorito ahora y es el que eh usado siempre {{champion:127}}","replies":[]},{"poster":"Tushima","date":"2015-02-14T04:26:56.943+0000","up_votes":1,"down_votes":0,"body":"Oh que pongan un pack con todos los iconos a 3000 rp aprox.... XD yo lo pagaria","replies":[]},{"poster":"Tygra","date":"2015-02-14T03:42:35.653+0000","up_votes":1,"down_votes":0,"body":"la verdad seria la primera ve que pagaría por un icono pues están muy kawai","replies":[]},{"poster":"Progerie","date":"2015-02-14T03:23:20.204+0000","up_votes":1,"down_votes":0,"body":"Estaria genial..","replies":[]}]}