{"poster":"NoPenta4You","date":"2017-03-13T14:13:15.278+0000","title":"S-Bewertung","subforum":"Champions & Gameplay","embed":{"description":"League of Legends (LoL) Summoner data for Meister Yoda 0 in Europe West. Contains statistics, match data and more to help players analyze and improve performance.","url":"http://www.lolking.net/summoner/euw/80547141/Meister%20Yoda%200","image":"http://lkimg.zamimg.com/images/v2/summoner/profile-headers/21_headerb.png"},"up_votes":2,"down_votes":4,"body":"Sehr geehrte League-Gemeinde,\r\nich möchte mich an dieser Stelle primär an Riot wenden, da es mir auf der Riot Website nicht gelungen ist Kritik dazulassen. Ich habe vor ein paar Tagen eine Anivia Runde gespielt. Es war nicht zu übersehen, dass ich das Team mithilfe meines Freundes \"getragen habe\". Voller Erwartungen blickte ich der Bewertung entgegen. Als sich der Bildschirm des Ende der Runde öffnete. Mir fiel direkt auf, dass ich keine Level-6-Marke erhielt. Also ging ich mit der Maus über meine Bewertung und was sah ich?!? Ein a. Dies hat mich natürlich nicht sonderlich erfreut. Demnach wende ich mich an die Community, sowie Riot in der Hoffnung, dass\r\na. dieses System ausgeglichener wird\r\nund b. mir jemand erklären kann wo der Fehler meiner Leistung lag.\r\n\r\nMit freundlichen Grüßen\r\nMeisterYoda0","replies":[{"poster":"NoPenta4You","date":"2017-03-14T15:29:06.072+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank für eure Kommentare. Haben mir wirklich sehr geholfen. Ich war an dem Tag wohl ein wenig in Rage, weil unsere top lane vayne afk war, aber wir es trotzdem noch drehen konnten. Ich werde an meinem Farm arbeiten","replies":[]},{"poster":"Gebudsan","date":"2017-03-13T14:22:38.904+0000","up_votes":1,"down_votes":0,"body":"Und was ich noch gerade sehe, der durchschnittliche farm einer Anivia liegt in deiner Elo bei 181. Das ist schon nicht gut, in Silver ist das Farming einfach noch nicht gut, aber DEIN durchschnittliches Anivia Farming liegt nochmal krass darunter bei gerade mal 135,7 Minions. Wenn du das nicht verbesserst wirst du niemals ne S Bewertung bekommen. Wie gesagt nen CS von mindestens 6CPM sollten es sein, damit du überhaupt die Chance auf ein S hast.","replies":[]},{"poster":"Gebudsan","date":"2017-03-13T14:19:56.545+0000","up_votes":1,"down_votes":0,"body":"Ich kann dir EXAKT sagen woran es liegt. Ich nehme mal an du hast Anivia mid gespielt. 25 Kills sind nice, 5 Tode.. okay, könnte weniger sein. Aber 178 Farm, als Midlaner, nach 38 Minuten?\nDas entspricht einem Cs von 4,68 pro Minute, das ist unterirdisch. Das ist krass gesagt ein stumpfes D als Midlaner. Und das hat dich deine S Bewertung gekostet, ich kenne das leider zu gut, als ADC hab ich auch meist Kills ohne Ende und es scheitert am CS. \nDu solltest MINDESTENS einen CS von 6 pro minute haben, 7-8 sind dann A und S. Der CS wird oft unterschätzt. \nKlar kann man sich fragen: Was soll ich mit Minions? Ich hab mein Gold durch Kills und bin full build. Aber Das AUTOMATISCHE Bewertungssystem zählt den CS mit und der ist halt einfach schlecht gewesen in diesem Spiel.","replies":[]},{"poster":"Rudeltreiber","date":"2017-03-13T14:19:34.583+0000","up_votes":1,"down_votes":0,"body":"178 Farm in 38min ist halt VIEL zu wenig, das A ist gerechtfertigt","replies":[]}]}