{"poster":"SleeperAwakening","date":"2019-07-14T21:25:17.897+0000","title":"Emparejamiento op y free pl","subforum":"Problemas Técnicos","up_votes":3,"down_votes":0,"body":"Me acaba de tocar la partida MAS INJUSTA de la vida\r\n\r\nmi amigo y yo (plata 1 y oro 4) nos acaba de tocar con compañeros platas tambien\r\n\r\nel team enemigo GRAN MAESTRO, DIAMANTE, PLATINO(en solo/duo).  Obviamente perdimos por goleada y regalamos pl a full \r\n\r\nChe me parece que su emparejamiento esta medio para atras por que la diferencia de lvl se notaba a Kilometros\r\n\r\ndescubrimos que esa gente platino maestro y diamante eran unraked en flex y solo por eso lo emparejaron con unos pobres degraciados platitas como nostros :c","replies":[{"poster":"Thotiana","date":"2019-07-14T22:44:26.268+0000","up_votes":4,"down_votes":0,"body":"***","replies":[{"poster":"Te voy a Trolear","date":"2019-07-14T23:58:37.821+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Thotiana,realm=LAS,application-id=X54mVVp0,discussion-id=hfnucV8R,comment-id=0001,timestamp=2019-07-14T22:44:26.268+0000)\n>\n> eso es algo que me molesta de flex. yo creo que deberian por lo menos considerar el elo en soloq cuando emparejan en flex. no veo ni una desventaja de implementar esto\n\nSep estaria bueno como cuando uno hace las placement se hace aprox con el elo de la season pasada, mejoraria el emparejamiento tanto en soloq para flex y viceversa.","replies":[]}]},{"poster":"Este No Es Zelos","date":"2019-07-15T17:43:46.878+0000","up_votes":2,"down_votes":0,"body":"Hola, te iba a pedir el enlace hasta que lei:\n\n> esa gente platino maestro y diamante eran unraked en flex\n\nEs otra cola, muchos usan las flex para entrenar, calculo que el mmr inicial de ellos era incluso menor al de ustedes. No por habilidad si no porque todavia no tenian partidas correctas al estar unranked. \n\nP.D.: Jamas te quejes del unranked, el unranked NO TIENE ELO DEFINIDO, puede ser retador o bronce, y solo lo vas a descubrir jugando.","replies":[]},{"poster":"Pátif Stalin","date":"2019-07-15T10:38:24.343+0000","up_votes":2,"down_votes":0,"body":"deduzco que estaban en racha de victorias.\nhasta donde vi, la racha de victorias afecta el mmr de una manera abusadora.\nsi no es así culpa de rito xd","replies":[]},{"poster":"Te voy a Trolear","date":"2019-07-14T23:55:43.419+0000","up_votes":2,"down_votes":0,"body":"Osea ustedes eran silver 1 y oro 4 en soloq supongo, en flex o tienen el elo mucho mas alto o son unrankeds. Pero igualmente el supuesto emparejamiento en flex es mucho peor q soloq.","replies":[{"poster":"SleeperAwakening","date":"2019-07-15T01:45:00.948+0000","up_votes":1,"down_votes":0,"body":"yo soy unraked en soloq xd por eso tambien","replies":[]}]},{"poster":"EL Plumas","date":"2019-07-14T21:33:26.319+0000","up_votes":1,"down_votes":0,"body":"no tiene nada que ver el elo en solo/q que en flex asi que te va a seguir pasando :v","replies":[{"poster":"SleeperAwakening","date":"2019-07-14T21:45:30.825+0000","up_votes":1,"down_votes":0,"body":"y ahi esta el problema los locos eran unraked en flex pero en solo/q eran gran maestro\n\nPartida mas difcil que matar un burro a pellizcos","replies":[]}]}]}