{"poster":"Sirricer","date":"2017-02-17T20:11:03.464+0000","title":"Talons Ultimate zu Schwach?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Ich pers&ouml;nlich finde es sehr schade das talon in seiner Ultimate gestuned werden kann und auch Turm schaden bekommen tut {{champion:91}} ","replies":[{"poster":"TerrorRaven","date":"2017-02-17T20:31:57.197+0000","up_votes":4,"down_votes":0,"body":"Unsichtbarkeit soll nicht gleich Unverwundbarkeit sein.","replies":[{"poster":"byDomey","date":"2017-02-17T20:35:15.463+0000","up_votes":1,"down_votes":0,"body":"Gut ausgedrückt.","replies":[]}]},{"poster":"SSI CptHaunted","date":"2017-02-18T09:14:38.433+0000","up_votes":1,"down_votes":0,"body":"Schon lustig dass es bei der Frage ob der Buff kommen sollte nur Ja und Egal aber kein Nein gibt...\n\nTalon ist so wie er ist stark genug um seine Aufgaben zu erfüllen, von daher braucht er keinen Buff. Allein die Unsichtbarkeit ist ziemlich gut, einige andere Ultis sind dagegen gefühlt schwächer.","replies":[]},{"poster":"Mi3zekatze","date":"2017-02-17T21:18:51.059+0000","up_votes":1,"down_votes":0,"body":"Es gibt nur noch sehr wenige wirklich unsichtbare Champs und Talon wird in seiner Ult unsichtbar. Allein das macht seine Ulti sehr gut! Der DMG ist ein Nebeneffekt den man dankend annehmen sollte (Kha hat in seiner Ult keinen Schaden)","replies":[]},{"poster":"OT Riku","date":"2017-02-17T20:50:56.520+0000","up_votes":1,"down_votes":0,"body":"Ich denke nicht das Talons R zu schwach ist.\nTalons Schaden kommt durch seine Spellkombo wenn du denkst er macht zu wenig Schaden setzt du seine Spells vielleicht nicht richtig ein.\nDer neue Übungsmodus ist für soetwas übrigens hervorragend geeignet.","replies":[]},{"poster":"byDomey","date":"2017-02-17T20:26:21.718+0000","up_votes":1,"down_votes":0,"body":"Er kann lediglich gestunned werden, wenn er gesehen wird oder von einem Skillshot/AoE-Stun getroffen wird, da er nicht anvisiert werden kann. (vorausgesetzt du bist nicht unter dem Turm.) Ich verstehe dein Problem nicht ganz, ein Turm macht allem Schaden, was er sehen kann. Da ein Turm alles aufdeckt, ist es legitim, dass Talon Schaden davonträgt, und das ist so gewollt, ebenso wie bei Akali's W, Kha'Zix' R und jeglicher anderer Unsichtbarkeit, egal ob Camouflage oder Invisibility.","replies":[]}]}