{"poster":"Saterrun","date":"2016-07-30T21:20:20.176+0000","title":"Idea para un nuevo modo de juego original----creacion de campeones----","subforum":"Creaciones de la comunidad","up_votes":1,"down_votes":0,"body":"Primero que nada creo que algunos ya se cansaron de los modos de juegos semanales. y bueno creo que una buena idea es un modo de juego para crear campeones.\r\n\r\nme explico: 1 -tomas la textura de un campeon EJ(Malphite)\r\n                   2 -luego le agregas las Habilidades y Pasiva EJ (PASIVA de {{champion:266}}     Q de {{champion:12}}   W de {{champion:22}}  E de {{champion:432}}  y ULTIMATE de {{champion:1}} \r\n                   3- en el modo de juego solo encontraras jugadores usando sus propios personajes con combos de habilidades mezclados y muy locos\r\n                    4 el limite de creacion de campeones es 5 y la barra secundaria de todos es el Mana\r\n\r\nespero les Haya Gustado{{sticker:slayer-pantheon-thumbs}}  Comenten Constructivamente que les parece?","replies":[{"poster":"korkun","date":"2016-07-30T23:03:23.324+0000","up_votes":2,"down_votes":0,"body":"Pasiva de Taric (Dos basicos potenciados despues de cada habilidad en porcentaje a tu armadura que encima bajan sus enfriamientos)\nQ de Olaf (Hachazo con daño fisico y un slow)\nW de Rammus (Aumento drastico  en armadura y resistencia magica y obtención de una mini cota de espinas)\nE de Shen (Taunt con dash)\nUlti de Kayle (Inmortalidad)\nCombo basico, taunt, dos basicos, w, dos basicos, y asi metiendo ulti y q y ya está, permakills XD","replies":[]},{"poster":"FallenDemonX","date":"2016-07-30T23:01:50.154+0000","up_votes":1,"down_votes":0,"body":"Ya juge el del Dota y la verdad es que hace tiempo que estaria bueno un modo asi. En Dota es un poco demasiado random, si lo implementasen tendria algunas modificaciones importantes.","replies":[]},{"poster":"Rolando Magic","date":"2016-07-30T21:23:53.388+0000","up_votes":1,"down_votes":0,"body":"Eso es taaaaaaan dota :v","replies":[{"poster":"PWG Raeghast","date":"2016-07-30T21:24:39.591+0000","up_votes":1,"down_votes":0,"body":"Yo prefiero que lo copien tal cual de Dota y sea aleatorio.","replies":[{"poster":"Rolando Magic","date":"2016-07-30T21:41:07.041+0000","up_votes":1,"down_votes":0,"body":"Ni idea, no se como es el modo de dota solo se que existe","replies":[{"poster":"PWG Raeghast","date":"2016-07-30T22:53:15.791+0000","up_votes":1,"down_votes":0,"body":"Elegis un personaje para las texturas y te dan 4 skills aleatorias","replies":[]}]}]}]}]}