{"poster":"TCD Knuckels","date":"2015-07-25T20:40:15.710+0000","title":"Team Challenged Division sucht Platin+  Top+Mid","subforum":"Clans & Teams","up_votes":2,"down_votes":1,"body":"Hallo Community, mein Name ist Stephane aka. Knuckels und ich bzw. wir suchen eine erfahren Top Lane und einen  Jungler.\n\nZu meiner Pers&ouml;nlichkeit:\n\nIch hei&szlig;e Stephane und bin 17 Jahre alt. Meine League of Legends Erfahrung reicht bis zur Season 2 zurück . In der S4+5 habe ich es bis Diamant geschafft und bin f&uuml;r die n&auml;chste Season zuversichtlich:). Jetzt versuche ich ein Team aufzubauen, was nicht nur ein bisschen rumspielen m&ouml;chte, sondern etwas zusammen erreichen will. Es geht nicht darum in den n&auml;chsten 2 Wochen die Lcs zu erreichen, sondern viel mehr darum sich Tag f&uuml;r Tag zu verbessern und sich auf langer Zeit gesehen hochzuspielen.\n\nWas wir dir bieten k&ouml;nnen:\n\nWir sind eine gesellige Truppe, die aus drei RL-Kollegen besteht wo die Chemie sofort gepasst hat und die n&ouml;tige Erfahrung im Spiel ebenfalls:). Wir k&ouml;nnen dir also ein Umfeld bieten was gute Laune hat und den n&ouml;tigen Spa&szlig; am Spiel, aber auch dann beim Training sich auf das Spiel fokussiert und versucht das bestm&ouml;gliche Ergebnis zu erreichen. Desweiteren sind wir zielstrebig, das bedeutet wir wollen Trainingszeiten vereinbaren, die erstmal aus dem praktischen Teil bestehen, aber auf langer Sicht gesehen auch teilweise theoretisch werden (Replays analysieren etc.).\n\nWas wir von dir erwarten: \n\nWie schon am Anfang erw&auml;hnt suchen wir einen Jungler und eine Top Lane der viel Erfahrung im Bereich der Soloqueue und im Teamranked vorweisen kann. Au&szlig;erdem sollte er als \"Beweis\" f&uuml;r seine Erfahrung und seinen Skill mindestens die Elo \"Platin\" erreicht haben. Diese Erfahrungen sind n&ouml;tig, da wir auch noch gleichzeitig einen \"Shotcaller\" f&uuml;r das Early-Midgame suchen. Noch ein wichtiger Aspekt w&auml;re der Charakter der Person, da es keinen Sinn ergibt als Team agieren zu wollen, wenn die Chemie zwischen den Personen nicht stimmt. Dazu geh&ouml;rt auch eine gewisse Reife und die F&auml;higkeit mit Kritik umgehen zu k&ouml;nnen.\n\n\nAD Carry : SD Datdingda\n\nSupport : TCD Darko\n\nMid Lane : TCD Knuckels\n\nTop Lane : Du ?\n\nJungle : Du ?\n\nErf&uuml;llst du unsere Erwartungen und wir deine? Dann schreib doch eine Bewerbung an sauer.stephane@web.de mit dem Betreff \"TCD\"und beweis uns dein K&ouml;nnen!\n\nP.S.: Bitte keine 3-Zeiler. Eine ausf&uuml;hrliche Bewerbung zeigt uns gleichzeitig, ob du wirklich Lust drauf hast, auf lange Zeit gesehen, im Team spielen zu wollen.\n\nEdit: Hab mich, wie ihr vielleicht schon gemerkt habt, im Titel geirrt, wir suchen natürlich Top + Jungle.","replies":[{"poster":"TCD Knuckels","date":"2015-08-02T17:30:00.469+0000","up_votes":1,"down_votes":0,"body":"push :)","replies":[]},{"poster":"TCD Knuckels","date":"2015-08-01T00:45:48.446+0000","up_votes":1,"down_votes":0,"body":"push :)","replies":[]},{"poster":"TCD Knuckels","date":"2015-07-31T21:54:03.397+0000","up_votes":1,"down_votes":0,"body":"push :)","replies":[]},{"poster":"TCD Knuckels","date":"2015-07-31T09:47:06.977+0000","up_votes":1,"down_votes":0,"body":"push :)","replies":[]},{"poster":"TCD Knuckels","date":"2015-07-28T19:15:11.778+0000","up_votes":1,"down_votes":0,"body":"push :)","replies":[]},{"poster":"TCD Knuckels","date":"2015-07-26T20:56:46.565+0000","up_votes":1,"down_votes":0,"body":"Oh, vielen dank für diesen Hinweis :D","replies":[]},{"poster":"Cayce","date":"2015-07-25T20:51:28.583+0000","up_votes":1,"down_votes":0,"body":"Im Titel steht Top+Mid, Jungler werden also weniger in diesen Thread schauen :D","replies":[]}]}