{"poster":"Sakunosuke Oda","date":"2016-01-11T14:36:29.684+0000","title":"Experten","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":2,"body":"Musste eben etwas schmunzeln &uuml;ber diesen Satz\r\nWARUM DAUERT DAS SO LANGE?\r\nBitte beachte, dass dieser Best&auml;tigungsvorgang recht lange dauert, weil deine Informationen von unseren EXPERTEN sorgf&auml;ltig gepr&uuml;ft werden. Aus Sicherheitsgr&uuml;nden werden dir im Verlauf des Best&auml;tigungsvorgangs unter Umst&auml;nden noch weitere Fragen gestellt.\r\n\r\nWenn man bedenkt das diese Experten Kaffe &uuml;ber die Maschine f&uuml;r die Serven versch&uuml;ttelt haben(Namen vergessen)\r\nNaja nehmt es mit Humor ist auch nix schlimmes einfach nur Humor ;)","replies":[{"poster":"Humpelstilzche","date":"2016-01-11T14:47:54.650+0000","up_votes":4,"down_votes":0,"body":"> Wenn man bedenkt das diese Experten Kaffe über die Maschine für die Serven verschüttelt haben(Namen vergessen)\n\nDas ist nichts weiter als ein populärer Witz, das ist nie passiert. Hätte auch eine extrem große Tasse Kaffee sein müssen, da Riots Supporter in Irland sitzen und die Server in Amsterdam. Um da rüberzuschwappen braucht man schon eine Tasse mit planetaren Ausmaßen.","replies":[{"poster":"HyperionCH","date":"2016-01-11T15:18:12.406+0000","up_votes":1,"down_votes":0,"body":"War da nicht bei einem 1. April-Scherz etwas geschrieben, dass dies passiert sei und deshalb NURF nicht verfügbar wurde (und deshalb als Ersatz erneut URF kam)?\n\nIch glaube aber, das war dann kein Kaffee, sondern ein Energydrink (OK, Kaffee ist auch so etwas; zumindet für mich. ^^).\n(Beim (N)URF-Event der LCS-Spieler wurde hingegen ein anderer Grund gezeigt^^)\n\nAnsonsten stimmt deine Aussage natürlich.\nDer Witz ist nicht nur populär, sondern auch schon ziemlich alt. Die Sprüche kamen noch aus Zeiten, als Server gross wie Schränke waren und als Speichermaterial noch Magnetbänder besassen. Die Gehäuse waren schlecht isoliert, weshalb auch Flüssigkeiten in den Server-Räumen auch verboten waren.\n\nHeute sind Server nicht nur geräumiger, sondern halten auch ein \"Flüssigkeitsangriff\" in Form eines Beches/einer Tasse/einer Dose gut stand.","replies":[{"poster":"Humpelstilzche","date":"2016-01-11T16:03:06.326+0000","up_votes":1,"down_votes":0,"body":"Sagt das Wort \"April-Scherz\" nicht schon alles über den Wahrheitsgehalt dieser Aussage aus?^^","replies":[{"poster":"HyperionCH","date":"2016-01-11T16:12:07.035+0000","up_votes":1,"down_votes":0,"body":"Wer weiss, ob es nicht doch Spieler gibt, die jener Story Glauben schenkten und einen \"Schrein des unbekannten Riot-Informatiker\" erstellten, weil dieser sie von NURF rettete bzw. URF zurückholte. XD","replies":[]}]}]}]},{"poster":"Maíko","date":"2016-01-11T15:01:05.576+0000","up_votes":1,"down_votes":0,"body":"So ein Server muss ja auch 24/7 durchlaufen....ohne Kaffee würd ich das auch nicht schaffen...","replies":[]}]}