{"poster":"Vilemaw Bot","date":"2015-06-09T07:23:23.177+0000","title":"APRIL FOOLS 2016 SKIN IDEAS","subforum":"Player Creations","up_votes":1,"down_votes":0,"body":"This is my best idea I have so far so here it goes...\r\n\r\nDefinitely not Cho&#039;Gath: Wears a baron costume and starts looking more like the real thing as his stacks get bigger.\r\nQ: Baron tentacle comes out of ground\r\nW: Spits out acid like baron\r\nE &amp; R: Same as classic\r\n\r\nDefinitely not Elise: Human form wears a Vilemaw costume. Spider form looks more like the real thing except no spider nest thingy on her back.\r\nHuman Q: Shoots out Vilemaw&#039;s range transparent looking single target web. Spider Q: Same as classic\r\nHuman W: Same as classic. Spider W: Elise&#039;s auto attacks look like Vilemaw&#039;s fast melee attacks using 2 of it&#039;s legs.\r\nHuman E: Same as classic. Spider E: Same as classic.\r\n\r\nDefinitely not Shyvana: Wears a dragon costume and looks more like the real thing when ulting.\r\nHuman Q: Same as classic. Dragon Q: Same as classic.\r\nHuman W: Same as classic. Dragon W: Flaps wings maybe?\r\nHuman E: Shoots fireball that looks like the dragon&#039;s fireball. Dragon E: Same as human except it shoots from the mouth.\r\n\r\nThose are my ideas, if I had to give them a price I would make Cho&#039;Gath 1350RP, Elise 950RP, Shyvana 950RP.\r\nRemember these are only IDEAS so don&#039;t get too mad at me if I didn&#039;t have much ideas for Shyvana or Elise as I do not play them much :(\r\nThanks for taking the time to read my post! :D","replies":[{"poster":"SEKAI","date":"2015-06-09T07:27:48.366+0000","up_votes":4,"down_votes":0,"body":"You misses the point of April Fools, \n\nIt should be a Definitely Not Cho'gath skin where it looks EXACTLY like his Classic in-game, but you won't know until you've bought it (as the splash art would indicate otherwise), which they would refund you the RP later on.\n\nNow that's what we call a good April Fools.","replies":[]},{"poster":"sparklefart","date":"2015-06-09T23:46:01.382+0000","up_votes":1,"down_votes":0,"body":"Shyvana is a dragon, why would she wear a dragon costume?","replies":[{"poster":"DiamondAries","date":"2015-06-10T03:25:04.753+0000","up_votes":1,"down_votes":0,"body":"Because bananas.","replies":[]}]},{"poster":"Alamo","date":"2015-06-10T02:40:14.252+0000","up_votes":1,"down_votes":0,"body":"> You misses the point of April Fools,\n\nIt should be a Definitely Not Cho'gath skin where it looks EXACTLY like his Classic in-game, but you won't know until you've bought it (as the splash art would indicate otherwise), which they would refund you the RP later on.\n\nNow that's what we call a good April Fools.\n\nTrue dat","replies":[]}]}