{"poster":"TurretBud","date":"2017-01-22T21:54:27.049+0000","title":"70+% of your community is below Gold. Have you played ranked recently?","subforum":"Gameplay","up_votes":28,"down_votes":5,"body":"This snowball meta is ridiculous. Practically every game feels completely one-sided. A single kill, or gank can completely destroy any laner. Once ahead, masteries make trades even more punishing and with towers being paper thin, the game is often decided before 15 minutes. Having small mistakes be so punishable has made ranked a less competitive experience, especially in low elo.\r\n\r\nAdding all of that to the amount of champions that can abuse masteries, all of the balance issues... Honestly masteries need to be reverted and changed so that they don&#039;t create so many balance issues. Balancing champions around which mastery is best on them is stupid.","replies":[{"poster":"five oh tree ","date":"2017-01-22T22:22:22.751+0000","up_votes":6,"down_votes":3,"body":"> Once ahead, masteries make trades even more punishing\n\nthen stop trading with your lane opponent if they're ahead lol?","replies":[{"poster":"The Deckowner","date":"2017-01-22T22:40:15.215+0000","up_votes":4,"down_votes":6,"body":"so you mean take free damage?","replies":[{"poster":"Attticus Finch","date":"2017-01-22T23:04:22.248+0000","up_votes":6,"down_votes":0,"body":"Yes. \n\nHide under tower like a bitch, try not to feed and accept that you're either going to get carried or lose.","replies":[{"poster":"Supreme Senpai69","date":"2017-01-23T13:44:02.535+0000","up_votes":3,"down_votes":0,"body":"This is so true... sadly nobody else does this. If you're in a game, you HAVE to carry because your team feeds because they don't do this. It's sorta sad that the responsible players who follow this probably lose more games, up until a certain ELO. \n\nGetting carried is a skill no matter what anyone else says. But you don't really get carried in like... bronze and low silver. Feelsbadman.","replies":[]},{"poster":"Snowman Arc","date":"2017-01-24T10:43:27.249+0000","up_votes":1,"down_votes":0,"body":"So, is that healthy gameplay? Making a single mistake is now somehow turning you into a position of \"afk under tower and hope for the team to carry you\"?\n\nThat doesn't seem like healthy gameplay to me. At the same time, one kill isn't always that hard to come back from. It's more about the players' skill gap itself, rather than 300 gold.","replies":[{"poster":"vOmvbrawfU","date":"2017-01-24T10:53:43.123+0000","up_votes":1,"down_votes":0,"body":"Except it's not a single mistake. Why do people always say this? Player in lower elos do not have the ability to win lane after a single mistake. They just don't. There are a shit ton of opportunities to get back into the game after making a mistake, I do it all the time.\n\nThe problem is that players die and then continue to all in the enemy like hurr durrs.","replies":[]}]}]},{"poster":"five oh tree ","date":"2017-01-22T23:03:12.603+0000","up_votes":2,"down_votes":0,"body":"Or don't put yourself in the position to take damage lol? the only time you can't help it is basically against artillery mages, but they're not going to proc thunderlord's on you with one poke. \n\nYou don't HAVE to get that cs, even if it's under your tower. If you're going to take a full rotation for 3 casters, just don't. Accept that they're ahead and that you have to sacrifice gold.","replies":[]},{"poster":"Cocho","date":"2017-01-23T08:08:17.153+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Deckowner,realm=NA,application-id=3ErqAdtq,discussion-id=pMTpTlad,comment-id=00040000,timestamp=2017-01-22T22:40:15.215+0000)\n>\n> so you mean take free damage?\n\nNo wonder games are so 'snowbally' xD","replies":[]}]},{"poster":"Dominick Destine","date":"2017-01-22T23:26:37.544+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Time And a Half,realm=NA,application-id=3ErqAdtq,discussion-id=pMTpTlad,comment-id=0004,timestamp=2017-01-22T22:22:22.751+0000)\n>\n> then stop trading with your lane opponent if they&#x27;re ahead lol?\n\nNo no, remember that logic has no place in Bronze Chaos.\n\nJust do nonsense and hope to climb the ladder.","replies":[]}]},{"poster":"Blue Kaozi","date":"2017-01-22T22:15:22.690+0000","up_votes":3,"down_votes":6,"body":"70% of the community has ALWAYS been below gold, that's how it works. (Bar first season where bronze was ~1250 elo and you were unranked below) Not sure what that has to do with the meta.","replies":[{"poster":"TurretBud","date":"2017-01-22T23:16:23.910+0000","up_votes":7,"down_votes":0,"body":"No... I'm saying they need to pay some attention to how changes have affected competitive in lower elo, even gold, I've played at a  low gold elo for a several of seasons, but the past two season have been particularly stupid. If the majority of the community is not enjoying the competitive side of the game, that's a problem.","replies":[]}]},{"poster":"dominusx","date":"2017-01-22T22:14:21.667+0000","up_votes":4,"down_votes":12,"body":"punished lmfao.. people dont punish shit in low elo. the only way to lsoe in low elo is if you go afk legit.","replies":[{"poster":"Divine Winds","date":"2017-01-22T22:59:08.333+0000","up_votes":4,"down_votes":2,"body":"A lot of people actually can punish you for a mistake. Many Bronze players have been playing for a while, but they restrict themselves to playing the same thing every game and not adapting. They know how to punish a mistake, but don't know how to turn that into a lead. And contrary to popular opinion, you literally cannot solo carry at lower ELOs because sometimes your teammates make very **very** dumb choices.","replies":[{"poster":"Cocho","date":"2017-01-23T08:45:33.002+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=xXrushaXx,realm=NA,application-id=3ErqAdtq,discussion-id=pMTpTlad,comment-id=00010001,timestamp=2017-01-22T22:59:08.333+0000)\n>\n> A lot of people actually can punish you for a mistake.\n\nBronze players aren't very good at punishing most mistakes because they can't really identify them. For example,\nI was ranking up a smurf and I was able to walk up with old {{champion:55}} and cs melee minions without taking auto attacks from champs like {{champion:112}} {{champion:61}} . lol\n\nThey'd throw a laser/ball, but they wouldn't auto. \n\nThere's alot of things like this in bronze. Like backing without shoving the wave lol. I could just back, and they would do the same. They aren't really super obvious mistakes. \n\n> Many Bronze players have been playing for a while, but they restrict themselves to playing the same thing every game and not adapting. \n\nhttps://gyazo.com/557035974816c0f8193d6ff6fe7110eb\n\nYou don't need to play other champs. You just need to have improving being the goal in mind","replies":[{"poster":"Divine Winds","date":"2017-01-23T22:58:50.777+0000","up_votes":1,"down_votes":0,"body":"I'm in bronze, I know how to zone against melee, or freeze waves, or shove when backing or leaving for objectives.\nThe problem is the objectives. \nI've had games where we would ace, their jungler was up in 11 secs and we have free baron. Instead, they began pushing the wave to enemy turret when the wave was near our inner turret. This is a waste of time. If they pushed, then went for baron, maybe it could have worked. Instead, they chose to hit the turret a few times before backing off from enemy team respawning.\nHere you can see a mistake. Going for turrets is correct, but not when the conditions aren't met. This is poor decision making. And Bronze players may be as mechanically skilled as Silver or Gold, but we lack in map and objective control.","replies":[{"poster":"Snowman Arc","date":"2017-01-24T10:50:26.317+0000","up_votes":1,"down_votes":0,"body":"It can't happen so often in every game. There comes a point where it's 50-50 between you and the enemy team, and if you are better than your laning opponent, you should win more and get out. I played on a B5 smurf. Games were as retarded as it gets. Yet, I was still able to easy carry with Irelia, even when my bottom lane was 0/15. You just need to attack the weaknesses that the bronzies have. One of the best things you can do is pick Jax and splitpush.","replies":[]},{"poster":"Cocho","date":"2017-01-24T01:08:00.540+0000","up_votes":1,"down_votes":0,"body":"Theres always exceptions, its good that you know something that you could improve on. I'm kinda the same way with objectives","replies":[]}]}]},{"poster":"GayFluffyUnicorn","date":"2017-01-23T16:42:17.524+0000","up_votes":2,"down_votes":2,"body":"Yes you can solo carry lower elos. \nEasily. More  than in any other elo. \nNo bronzes don't punish mistakes accordingly otherwise they wouldn't be bronze.","replies":[{"poster":"Divine Winds","date":"2017-01-23T22:55:44.314+0000","up_votes":1,"down_votes":0,"body":"You can't really solo carry against 4 fed.\nContrary to popular opinion, yasuo **cannot** 1v5 against a fed team","replies":[{"poster":"Snowman Arc","date":"2017-01-24T10:51:51.942+0000","up_votes":1,"down_votes":0,"body":"There are games that can't be salvaged. But that's not every single game. If you consistently go 10-0 in your lane, you can't really lose that many games.","replies":[]}]}]},{"poster":"dominusx","date":"2017-01-22T23:05:18.401+0000","up_votes":3,"down_votes":8,"body":"yeh it's so hard to carry low elo..so hard to kill the enemy 500times and make them afk cause they are too dumb to respect powerspikes etc. w/e if you think low elo is hard to carry you are there for a reason tbh. just like i'm hardstuck diamond cause i cant work with adc players and general teamwork is a nono for me since last season.","replies":[{"poster":"Divine Winds","date":"2017-01-22T23:28:49.346+0000","up_votes":3,"down_votes":1,"body":"It might seem easy for you, since you are diamond, but when you compare a bronze with a bronze, the skill level is the same. Much like comparing a challenger to a Gold and then challenger to a challenger","replies":[{"poster":"Snowman Arc","date":"2017-01-24T10:46:43.851+0000","up_votes":1,"down_votes":0,"body":"That's what he's saying. The bronze guy can't carry bronze guys, which is why he stays in bronze.","replies":[]},{"poster":"dominusx","date":"2017-01-22T23:32:20.074+0000","up_votes":2,"down_votes":5,"body":"its easy for anyone with a brain when i go to my local net to coach my silver buddy he just listens to what i tell him and he rolfstomps his way outta silver. I told him when i 1st started teaching him YOU DO WHAT I SAY WHEN I SAY boom he is already silver 1 from 5.","replies":[]}]}]}]},{"poster":"vOmvbrawfU","date":"2017-01-24T10:54:33.233+0000","up_votes":1,"down_votes":1,"body":"Lol, you're also low elo. So why don't you win every game?","replies":[{"poster":"dominusx","date":"2017-01-24T18:49:57.472+0000","up_votes":1,"down_votes":0,"body":"d2 is low elo but not THAT low elo.","replies":[]}]},{"poster":"NastyMcOutplay","date":"2017-01-23T08:49:27.413+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=dominusx,realm=EUNE,application-id=3ErqAdtq,discussion-id=pMTpTlad,comment-id=0001,timestamp=2017-01-22T22:14:21.667+0000)\n>\n> punished lmfao.. people dont punish shit in low elo. the only way to lsoe in low elo is if you go afk legit.\n\nwell one team has to lose","replies":[]},{"poster":"420 grams","date":"2017-01-22T22:15:33.664+0000","up_votes":3,"down_votes":7,"body":"> [{quoted}](name=dominusx,realm=EUNE,application-id=3ErqAdtq,discussion-id=pMTpTlad,comment-id=0001,timestamp=2017-01-22T22:14:21.667+0000)\n>\n> punished lmfao.. people dont punish shit in low elo. the only way to lsoe in low elo is if you go afk legit.\n\nYou're EU; you're whole region is low elo","replies":[{"poster":"dominusx","date":"2017-01-22T22:18:10.501+0000","up_votes":3,"down_votes":8,"body":"bronze player having oppinion about other regions rank let alone ranks in general eks di boys. this is why we flame people.","replies":[]}]}]},{"poster":"Dominick Destine","date":"2017-01-22T22:38:55.529+0000","up_votes":7,"down_votes":8,"body":">as made ranked a less competitive experience, especially in low elo.\n\nLOL.\n\nThe moderation hates when I say this, but it has to be said;\nEverything below plat is just clown fiesta. \n\n\"Less competitive\"? how do you get \"Less competitive\" than zero? you can't. It has always been terrible... you at the very least need players that understand basic game mechanics, and Bronze Chaos is not it. The game only really begins at Plat, I guess gold is kind of debatable, in some instance, but the vast majority of players that are competent exist plat and above always.\n\nInb4 moderation deletes this post for \"Racism against Bronze bracket\" or whatever \nBRONZE ISN'T A RACE RIOT. STOP USING FALSE CHARGES AGAINST ME.","replies":[{"poster":"Divine Winds","date":"2017-01-22T22:56:33.482+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Dominick Destine,realm=NA,application-id=3ErqAdtq,discussion-id=pMTpTlad,comment-id=0006,timestamp=2017-01-22T22:38:55.529+0000)\n>\n> LOL.\n> \n> The moderation hates when I say this, but it has to be said;\n> Everything below plat is just clown fiesta. \n> \n> &quot;Less competitive&quot;? how do you get &quot;Less competitive&quot; than zero? you can&#x27;t. It has always been terrible... you at the very least need players that understand basic game mechanics, and Bronze Chaos is not it. The game only really begins at Plat, I guess gold is kind of debatable, in some instance, but the vast majority of players that are competent exist plat and above always.\n> \n> Inb4 moderation deletes this post for &quot;Racism against Bronze bracket&quot; or whatever \n> BRONZE ISN&#x27;T A RACE RIOT. STOP USING FALSE CHARGES AGAINST ME.\n\n\n\n\nAnd it sucks when you actually know what to do at a point in the game, and you suggest it to your teammates and they don't listen to you.","replies":[]},{"poster":"TurretBud","date":"2017-01-22T23:24:41.217+0000","up_votes":4,"down_votes":2,"body":"I mean sure, in very low-elo I'm sure it's been pretty bad, but from my ranked experience in previous seasons (S4-High Silver, S5-Low Gold, S6-Low Gold), being better than my opponent had an impact on the game no matter what role I was playing. Right now, it feels like the skill gap between my opponent and myself is practically meaningless unless they are severely worse than I am. And even then, if the jungle match-up is bad, my impact feels irrelevant.","replies":[]}]},{"poster":"A Basic Island","date":"2017-01-22T22:15:02.968+0000","up_votes":1,"down_votes":0,"body":"apparently gold is top 13%\n\nhttp://www.leagueofgraphs.com/rankings/rank-distribution\n\nalways thought it was 20% lol","replies":[{"poster":"Cocho","date":"2017-01-23T08:10:33.101+0000","up_votes":1,"down_votes":0,"body":"In general, after its been some time and most people that are going to play ranked are placed, \n\nits like\nbronze - 30%\nsilver - 40%\ngold - 30%\nplat - 9%\ndiamond - 1%\nmaster/challenger - 0.02%","replies":[{"poster":"HeeroTX","date":"2017-01-23T21:27:14.798+0000","up_votes":2,"down_votes":0,"body":"30+40+30+9+1+0.02 = 110.02%\nhttps://cdn.meme.am/cache/instances/folder209/67019209.jpg","replies":[{"poster":"Cocho","date":"2017-01-23T22:04:15.951+0000","up_votes":1,"down_votes":0,"body":"XD whoops lol\n\njust take 10% from silver out lol","replies":[]}]}]},{"poster":"dominusx","date":"2017-01-22T22:27:34.082+0000","up_votes":2,"down_votes":1,"body":"that's right now. diamond is like 0.7 or something now late season its 3%","replies":[]}]},{"poster":"grug","date":"2017-01-22T23:06:53.156+0000","up_votes":2,"down_votes":0,"body":"gold should be the average considering how long a lot of these long term goons have been playing, but it appears 2000+ games dont make you better at league h4h4h4h4.\n\non OCE roughly 80% + are below gold","replies":[]},{"poster":"Lovelle","date":"2017-01-22T22:33:12.830+0000","up_votes":2,"down_votes":1,"body":"Sounds like the Twisted Treeline meta has made its way to SR.","replies":[]},{"poster":"salty testi","date":"2017-01-24T10:20:43.093+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"TurretBud","date":"2017-01-24T19:39:32.687+0000","up_votes":1,"down_votes":0,"body":"I'm not a professional player, but the game shouldn't be entirely balanced on professional play. People who are not good at the game should still enjoy playing it. If you watch professional games now, the laning phase is practically not a thing. Mid gets roamed on 24/7, bot lane gets pounded by globals, and the game either ends early, or turns into whoever fucks up loses. And top lane is... tanks noodling each other.\n\nTake a look at Game 3 of FNC vs. G2, even watching it is frustrating. Practically every lead is given by the jungler, Amazing gives Caps a good lead mid (practically ends any chance Perkz has of killing Caps in lane) Caps has all the pressure. Trick pressures bot and allows them to get first blood turret, and that snowballs their lead into mid, and then Ashe arrows just fuck the whole game catching people out.\n\nThe only way a bot lane first blood turret won't decide the game is if your scaling isn't as good as the other team, and you can't close out the game soon enough. Or you're severely worse than the enemy team.","replies":[]}]},{"poster":"YOU LOST LMAO","date":"2017-01-22T22:01:06.255+0000","up_votes":2,"down_votes":3,"body":"feelsgoodman to be above gold","replies":[{"poster":"venomous frost","date":"2017-01-22T22:09:20.570+0000","up_votes":1,"down_votes":2,"body":"And then you realise you are still the 30% thrash\n\nFeelsBadman","replies":[]}]}]}