{"poster":"Zearth","date":"2016-09-15T03:19:45.391+0000","title":"Emparejamiento (La peor exp para un jugador nuevo)","subforum":"Nuevos jugadores","up_votes":2,"down_votes":2,"body":"Hola, quer&iacute;a armar un debate acerca del mal emparejamiento que tiene el juego y ver si podemos consientizar a Riot para que nos de una soluci&oacute;n a este problema que nos afecta a los nuevos jugadores. \r\n\r\nHoy estaba jugando con mi cuenta y al entrar a la partida un compa&ntilde;ero nos dice, que el equipo contraria hab&iacute;a 2 plata y un oro. Lo cual me dejo en duda y decid&iacute; fijarme en un pagina [(link)](http://imgur.com/a/0qi9n) entonces me doy cuenta que era verdad. intentamos jugar lo mejor posible, pero era imposible. A los 20 min de partida disidimos mandar surrender.  \r\n\r\nCreo que el sistema de emparejamiento no deber&iacute;a emparejar a los jugadores nuevos que reci&eacute;n estamos aprendiendo a jugar con jugadores que ya tiene una experiencia abismalmente  avanza. A mi parecer o entendimiento, esto es contraproducente. La verdad no me da ganas de seguir jugando y menos de apoyarlo. \r\n\r\n Dejen su comentario. Y tratemos de llegar a un entendimiento razonable.  \r\n\r\nSaludos","replies":[{"poster":"Summer Nights","date":"2016-09-15T03:33:20.491+0000","up_votes":1,"down_votes":1,"body":"Eso pasa cuando los silvers/golds hacen premade con low levels, como resultado los pone vs otros low levels en su mayoría. Dudo que sea aproposito esto anyway, en algunos casos deben jugar con amigos que estan subiendo una cuenta o aprendiendo también así que son casos aislados. Dejando eso de lado ser silver/gold no es la gran cosa, cuando llegues a 30 lo más probable es que juegues como un silver promedio así que no te sientas tan intimidado!","replies":[{"poster":"Zearth","date":"2016-09-16T02:13:37.239+0000","up_votes":1,"down_votes":1,"body":"Mismo caso diferente respuesta de la anterior. Lo que se busca en el post es saber opiniones y sugerencias para resolver este problema.\nLo que me paso a mi solo fue un ejemplo. \n\nSaludos.","replies":[{"poster":"Summer Nights","date":"2016-09-16T02:15:22.810+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zearth,realm=LAS,application-id=njUm58At,discussion-id=OaZtMXwt,comment-id=00000000,timestamp=2016-09-16T02:13:37.239+0000)\n>\n> Mismo caso diferente respuesta de la anterior. Lo que se busca en el post es saber opiniones y sugerencias para resolver este problema.\n> Lo que me paso a mi solo fue un ejemplo. \n> \n> Saludos.\n\nNadie opinó al respecto porque la mayoría de los que jugamos hace tiempo no lo vemos como un problema, es algo normal.\nSaludos.","replies":[]}]}]},{"poster":"Nehalem","date":"2016-09-15T03:35:20.876+0000","up_votes":1,"down_votes":0,"body":"Es inevitable eso, por lo general funciona bien, estas cosas pasan cuando esos lvl bajo son premade de los plata, entonces al sistema no le queda otra. Quizás debieron ponerte algún plata a vos también pero sería raro que a un random plata lo hagan jugar con muchos lvls bajo, el plata que no tiene nada que ver con nadie se quejaría y tendría razón.","replies":[{"poster":"Zearth","date":"2016-09-16T02:11:19.522+0000","up_votes":1,"down_votes":0,"body":"Lo que me paso a mi solo fue un ejemplo. EL tema era para saber opiniones sobre este tema para poder concientizar a riot para que estas cosas no pasen. A mi parecer no seria muy justo, suponiendo que vos estés en bronce, que te emparejen con 2 maestros, 1 challenger y 2 bronces. Como afectaría tu \"humor\" al pasarte eso? \nEsto es un juego. Entramos a divertirnos no a llevarnos una mala experiencia. No se, es mi opinión. \nRepito, lo que se busca en el post es conocer opiniones y sugerencia de como tratar este tema. \nSaludos","replies":[]}]}]}