{"poster":"Brownie Senpai","date":"2018-10-26T12:49:04.766+0000","title":"Main support tippek, mi az ideális support egy gyengébb adchez?","subforum":"Tippek és trükkök","up_votes":3,"down_votes":0,"body":"Sziasztok! Olyan emberek tanácsát, segítségét kérném akik main suppolnak és gold-platosok. Megragadtam egy szinten, olyan silver 3 környékén. Először is, mint support ti mivel tudtatok úgy hozzájárulni egy meccshez, hogy sikerült kijutni innen?  Az új stats menü alapján tudom megnézni mik az erősségem és hiányosságaim. A legerősebb tulajdonságom a map control. Igyekszem a lehető legtöbbet és jól wardolni ezzel nincsen gondom. Gyengébb vagyok a buldel, elég kevés goldot szerzek, és lassan fejlődöm. A legnagyobb gondom az, ha egy olyan adc-t kapok magam mellé aki más lanen játszik általában, egyszóval gyengébb, és nem tudom megvédeni. Tudom ez így nehéz, mert 1.nem valami jó a farmja, 2.minden enemy spellje betalál neki, 3. ha tudom, hogy rosszabb akkor csak a def, viszont ha sikerül megvédenem, és tegyük fel egy leonával sikerül stunnolnom az enemyt akkor azt hiszi itt az alkalom és visszarohan, de meghal. Ezeken nem tudok segíteni, de szerintetek melyik az a support champ, amivel a legjobban meg tudnám védeni? Inkább Janna, Soraka, Sonát, Morganát szoktam ezekre alkalmazni (meg szoktam nézni a champ selectionnál, hogy kivel leszek boton), de többször kéne tank a teambe, de ha azt hozok akkor jön az, hogy miért nem megyek bele. Ez az early game-re vonatkozik. Ha pl jó a jungos és segít, akkor meg lehet oldani, de nem mindig. Szóval szeretnék jó tanácsokat kérni, mint main support más nagyobb divíziós supportoktól, hogy mire figyeltek, mire törekedtek, és, hogy mikor milyen champeket visztek :) Köszönöm!{{sticker:sg-soraka}}","replies":[{"poster":"KedvesKisPóni","date":"2018-10-27T11:07:01.817+0000","up_votes":4,"down_votes":1,"body":"Szia! \nÁtérzem teljes mértékben.. Lényegében amennyiben ténylegesen támogató karaktert játszol abban az esetben ki vagy szolgáltatva és a csapatra kell hogy hagyatkozz. úgy értve hogy nem tudod egy sorakával le carryzni a játékot ha támogató tárgyakat vásároltál és a csapatod meg garbage.... alacsony elóban nem érdemes támogató karaktert választanod!! értem hogy szereted de plat-diamondig felejtsd el. nekem is a main role-om volt a support. VOLT!\nsajnos még platban is előfordul hogy fogalmuk sincs az általuk és mások által választott karakterek képességeiről és fontosságukról így értelmét veszíti a támogatói pozíció.  Főleg úgy hogy az adc- lövész pozíció az egyik leg nehezebben elsajátítható role. ------>Számtalanszor megtörtént hogy sajnos szólnom kellett a csapatnak hogy értelmetlen az alsóösvényen maradnom mert a lövészünk reménytelen és inkább a csapat többi tagjára szeretnék nagyobb figyelmet fordítani. ebben az esetben vision controll ami fontos és hogy légy ott ahol szerinted lenned kell de a mérges 10 éves gosu-t kerüld el és mute-old ! &lt;------ ezt a tanácsot solo que-ban érdemes alkalmazni. \nEgyetlen esélyed van támogatóként climbolni!!!!! \nTalálj egy lövész játékost aki értékeli a fáradalmaid és tud lövész karaktereket játszani!\nCsak is kizárólag vele játssz támogatóként!!! 10/8 meccs sorsát ketten döntitek majd el!\nÉs kérlek ne hallgass az ap mage támogató zsenikre mert haszontalan.. \nSzámtalan meccsen írták hogy gg soraka vs brand és mondtam hogy free win btw. és tényleg az lett! az ap mage karakterek a középső ösvényre valók nem véletlenül és semmi képpen sem a támogatói pozícióba mert elveszítik a powerspike-ot.. haszontalan fosok lesznek 0 dmg-vel és még gyógyítani sem tudnak.. max cc de mire leadja a kombót megölik.. csak egy biztos arany forrás vagy az ellenségnek ha nem botok ellen játszol :\"D ezért szeretem lövészként ha jön egy brand. lvl 2-n azonnal megölöm :\"D papír forintos és könnyen kikerülhetőek a képességei. Gondolj bele hogy egy xerath mit tud tenni támógatóként. semmit XD az ellenséget támogatják az ap mage zsenik boton XDDDDD \nA hard engage supportok pl alistar vagy leona őket is felejtsd el csak beugrasz és hagynak meghalni. vagy 0 válasz érkezik az engage-edre és akkor is meghalsz. és még a csapatod lesz felháborodba meg kérdésjeleznek meg report blabla..  XDD ezért kérik pls pick tank hogy te dögölj meg folyton és ne ők . gáz nagyon XD \nÖsszefoglalva csak duoban játsz támogatót vagy könnycseppjeid szivattyúzni kell majd a szurdokból !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nRemélem tudtam minimálisan segíteni! Bocsánat a helyesírási hibák miatt.","replies":[{"poster":"Brownie Senpai","date":"2018-10-29T18:16:34.617+0000","up_votes":2,"down_votes":0,"body":"Egyébként teljes mértékben azt érzem amit leírtál. Tényleg szeretek suppolni, de kevés a jó adc silverben. Van aki jó, sőt kiválóval is találkoztam silverként, de a legtöbb harmatgyenge. Nem farmolnak, beugranak, healt rosszul használják, aggresszívak mikor nem kéne stb. Sajnos nincs senki akivel tudnám hozni a botot. Ha meg pl jön egy Brand, te azt mondod könnyű, ki tudod kerülni, de most képzeld el azt a helyzetet, hogy ott állsz és végignézed, hogy az enemy összes spellje betalál az adcnek, mert egyszerűen nem kerüli ki. Persze, hogy rá fókuszálnak, nem rám, de jó eséllyel így meghal és akkor jön a \"gg report my supp\" gyermekes felkiáltás. És most magyarázd el neki, mint egy gyereknek, hogy használd az egeret arra, hogy ha odébb kattintasz akkor arrébb is mozdulsz. Ilyenekkel vagyok együtt. Bocsánat a kitörésért, csak érdekelt, mint support, hogy lehet kijutni a válságból, vagy ne adj úristen én csinálok valamit nagyon rosszul.","replies":[]}]},{"poster":"Shikaichi","date":"2018-10-26T15:06:02.871+0000","up_votes":1,"down_votes":0,"body":"Szerintem Nami is jó lehet ilyen szempontból, mert az a passzívja, hogy a W és az E képessége mozgási sebességet ad annak a szövetségesnek, akire rakod, tehát egy elpozicionált ADC esetleg jobb helyzetbe kerülhet (ha eszébe jut a menekülés). Ami fontosabb, hogy a Q és az ulti viszont nem csak kezdeményezésre, de menekülésre is nagyon jó.\nSona is jó lehet, de őt ugye írtad. Ulti, gyógyítás, gyorsítás, mind hasznos menekülésnél.","replies":[{"poster":"KedvesKisPóni","date":"2018-10-27T10:38:17.432+0000","up_votes":1,"down_votes":0,"body":"Olvasd el még egyszer a passzívját. :\"D akármilyen képessége talál el szövetségest az mozgási sebességet ad akár a Q akár az Ulti/ R ezért nagyon erős a nami engage csapatharcokban..","replies":[{"poster":"Shikaichi","date":"2018-10-27T12:19:11.139+0000","up_votes":1,"down_votes":0,"body":"Oké, igazad van, végül is az ulti is eltalálhatja a szövetségest is, de ha most csak úgy rádobom a Q-t az is? Mert nem szoktam ilyesmit látni, inkább az E-t rakják rá, hogy gyorsítást adjon.","replies":[{"poster":"KedvesKisPóni","date":"2018-10-27T12:47:20.535+0000","up_votes":2,"down_votes":0,"body":"Nem okoskodni csak segíteni szerettem volna. de igen a Q-val ha ledobod a társad az is mozgási sebességet biztosít neki csak kevesen tudják :) például ha üldöztök egy biztos gyilkosságot és kivül esik a buborékod hatótávján de a társad előrébb  van és egy kis + movementspeedel behozná nyugodtan dobd le őt bubival működni fog :)","replies":[{"poster":"Shikaichi","date":"2018-10-27T12:56:38.837+0000","up_votes":1,"down_votes":0,"body":"Dehogy vettem annak! Köszi a tippet! :)\nJátszok amúgy Namival, csak nem olyan sokat. Ilyen második lehetőségként tanultam meg, hogyha muszáj supportnak lennem, de banolják/elpickelik Sonát, akkor legyen még azért valaki, akivel megy.","replies":[{"poster":"Brownie Senpai","date":"2018-10-29T18:18:37.765+0000","up_votes":1,"down_votes":0,"body":"Sajnos úgy érzem Nami nem való egy gyenge adchez. Healel, meg mozgási sebességet ad, de egy gyenge adc nem ismeri, nem fogja kihasználni Nami rejtett képességeit, csak azt tudja, hogy tud healelni, és ott a buborék. Én ezt tapasztaltam az elmúlt időszak alatt.","replies":[]}]}]}]}]}]},{"poster":"Storiaron","date":"2018-10-26T20:34:32.855+0000","up_votes":2,"down_votes":0,"body":"Alistar/leona/braum nekem nagyon bejöttek. Egyrészt mivel van engageük, kilehet használni az ellenfeled hibáit. Másrészt a teamfightokban is jóval \"magától értetődőbb\" a feladatod mint egy utility supportal. (Kinek peelelsz ha az adc kuka? Hogy helyezkedj ha a csapat magatokra hagy egy rengarral pl. Stb)\n\nIlletve ehhez a trióhoz nem kell skillshotokat eltalálni ami nekem gigamegasupersaiyan öröm, meg értelemszerűen megbízhatóbb is.\n\nPlusz shen, obvious why.\n\n\nFeltételezve, hogy support support akarsz lenni.\nHa nem, akkor a szokásos opciók (zyra/brand/xerath/velkoz)mellett syndrát ajánlom a figyelmedbe.","replies":[]},{"poster":"Temp65432","date":"2018-10-26T20:05:34.292+0000","up_votes":3,"down_votes":1,"body":"Ha haladni akarsz előre és nem zavar hogy elázik a lábad az adc könnyeitől, akkor brand/xerath/fiddle/lux (apra).\n\nAz utility supportok most elég uselessek. Janna szutyok. Nagyon max soraka/nami, de soraka eléggé adc függő. \nTankok közül több választási lehetőség van. Pyke/Rakan/Naut az atyaúristen, Alistar/Thresh/Braum is jó választás lehet.\n\nUi: Sonát felejtsd el, ha az enemynek több esze mint gyök 0 akkor annyit ér mint a spawnkor eltűnő pillangók.","replies":[{"poster":"Monique X Janna","date":"2019-08-20T08:03:26.878+0000","up_votes":1,"down_votes":0,"body":"Ezzel nem feltétlen értenék egyet. Janna igen is erős, ha tudod kezelni. Season 5 kezdete óta csak Jannával supportkodok, és b3-ból képes voltam anno, G3-ba kijutni. Nami teljesen jó pick, mivel kisebb pickrate, nagyobb winrate, ugyanis az emberek nem tudnak hozzászokni a Nami elleni matchuphoz, úgy mint Thresh vagy Rakan. Soraka igen az teljesen bátor dolog, ha behozod, mert egy cc alatt megfogható, de figyelj...\nVan több support, aki igaz papír, mégis erősebb, mint akiket te mondasz. Morgana pl. 1 Q-t, ha betalál szépen, azaz ember ott megfeküdt. Ultit, ha jól időzíted, egy meccset is megfordíthatsz vele. Yuumi, aki új hősként érkezett, jelenleg nagyon erős lane-n, hiszen a Q sebzése erős, passzívja kellemes összegben ad manát és pajzsot, E-vel lehet csatákat nyerni, az Ulti is elég hasznos nagyobb teamfightban már. \n\nAkiket felsoroltál, igazán erősek tény és való, de melyik eloban fognak jól teljesíteni? Gold? Nem, mert néha le se követik, amit csinálsz. Diamond? Ott már talán, de nagyon könnyen kijátszható szerintem. Alistar ilyen szempontból jó support, mert nem lehet elcseszni vele dolgokat, szintén Naut, hogy újra supportként metába került. \n\nNem mondanám, hogy a utility supportok szutykok. Elfogadom a véleményed, csak valahol ellene is vagyok. Tank supportok nem mindig erősebbek, mint egy utility. :)\n\nKettő typus között az a különbség csak, hogy az egyikkel lehet soloq-ban carry-zni, de másikkal nem, viszont ez nem feltétlen így van. Tudni kell játszani az adott hőssel is. :)\n","replies":[]}]},{"poster":"kecskeharcos100","date":"2018-10-26T13:17:27.505+0000","up_votes":1,"down_votes":0,"body":"Szia!\nEgyáltalán nem vagyok support main, de amikor suppként kellett (vagy akartam) játszani, mindig Bardot hoztam, és nagyon tudom ajánlani mindenkinek a champet. Bár nem az általad említett, teljesen az adc védelmére fókuszáló supp, sőt mi több, nagyon agresszív stílusa van inkább. Az adc-det lvl 6 előtt csak az instant w nem túl nagy healjével tudod védeni, de mind a Q, mind az E, mind az ulti borzasztóan nagy potenciállal rendelkezik, ráadásul akár még late game-ban is 1v1-ezi az adc-ket, ~~és trollkodni is nagyon lehet vele~~.","replies":[]}]}