{"poster":"Hopwiesel","date":"2018-06-09T22:07:42.912+0000","title":"Ach wie toll riot hat mir wieder ein game sabotiert bekam die tollen premades","subforum":"Champions & Gameplay","embed":{"description":"Every game is a story; visit the new League of Legends match history to check out how this one ends and share your own!","url":"https://matchhistory.euw.leagueoflegends.com/en/#match-details/EUW1/3663938106/237365051?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":3,"body":"ja wie toll kaum bin ich Gold 5 begin nt es wieder eine tolle premade Botlane geht nach 30 minuten einfach Afk wie herrlich hey riot wie w&auml;re es wenn ihr es net so offensichtlich macht ;)","replies":[{"poster":"OPChampsSucks","date":"2018-06-09T22:10:40.956+0000","up_votes":1,"down_votes":0,"body":"naja verstehe halt nicht was riot dafür kann. man kann denen höchstens vorwerfen das da mal wieder nichts passieren wird bzgl bestrafung weswegen man nur mit nem guten premade spielen sollte um die aids-elo´s zu überwinden^^","replies":[{"poster":"Hopwiesel","date":"2018-06-09T22:13:51.817+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OPChampsSucks,realm=EUW,application-id=Wj1wcocU,discussion-id=8Oy0A1o3,comment-id=0000,timestamp=2018-06-09T22:10:40.956+0000)\n>\n> naja verstehe halt nicht was riot dafür kann. man kann denen höchstens vorwerfen das da mal wieder nichts passieren wird bzgl bestrafung weswegen man nur mit nem guten premade spielen sollte um die aids-elo´s zu überwinden^^\n\ndas tolle ist solche kriege ich ab dem zeitpunkt wo ich G5 erreiche und dann hört es bis zum drop nicht auf ;) riot wirft diese mit absicht in meine games","replies":[{"poster":"Tempname2919","date":"2018-06-10T02:16:18.956+0000","up_votes":1,"down_votes":0,"body":"Das sind verdammt gute Hellseher, diese Menschen von Riot.\nDie wissen nämlich bereits vor dem Game wer AFK geht und stecken sie zu dir.\nMachen sie es, weil sie dich nicht mögen? Weil sie gerne Gott spielen? Oder einfach nur aus einer Laune heraus um ein wenig Zeit zu vertreiben.\n\nWahrscheinlich werden wir niemals eine Antwort auf diese Fragen erhalten, aber was sicher ist, ist das der Spieler Hopwiesel anscheinend viel zu wenig von seinem eigenen Skill hält, so dass er jegliche Siege und Niederlagen von anderen abhängig macht und keinerlei Einfluss darauf hat, eine arme Seele. Das ist so sicher, wie das Amen in der Kirche.\n\nHALLELUJAH!","replies":[]}]}]},{"poster":"Hopwiesel","date":"2018-06-09T22:43:55.908+0000","up_votes":1,"down_votes":0,"body":"FULL AP UDYR und der klassische Ich feede da vayne main spieler mit dem Project skin https://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3664066012/237365051?tab=overview","replies":[]}]}