{"poster":"Whenkel","date":"2017-08-11T00:14:29.501+0000","title":"Pregunta sobre blitzcranck","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Quer&iacute;a saber cuales son los puntos fuertes y d&eacute;biles de este campe&oacute;n","replies":[{"poster":"davichost","date":"2017-08-11T00:20:42.449+0000","up_votes":2,"down_votes":0,"body":"Su early, a diferencia de supps de escudo como {{champion:40}}  o {{champion:37}} , tienes el gancho que puede asegurar kills para tu adc, tienes mucho zoneo y engache\n\nSus debilidades son que gasta bastante mana a niveles bajos, no tienes peel ni una forma real de aguantar daño (solo tu pasiva) y en late game no es tan útil como los soportes que blitz counterea {{champion:40}} {{champion:37}} {{champion:267}} {{champion:16}}  titnen mucho mas impacto en una tf en late, cosa que para que tu con blitz tengas prescencia tienes que meter una buena Q, que puede ser complicado en late donde hay ams espacio y mas herramientas para hacerle frente a tu combo","replies":[{"poster":"WhiteMax","date":"2017-08-11T00:29:41.500+0000","up_votes":1,"down_votes":0,"body":"Añado: Es el mejor Sup para sacar a rivales de Torre y uno de sus mayores counters es {{champion:25}}  (el escudo de ella cancela el gancho).","replies":[{"poster":"furikake","date":"2017-08-11T12:47:55.832+0000","up_votes":1,"down_votes":0,"body":"Ni hace falta hacer counter a blitz, se hace auto-counter en mid/late game ya que se vuelve inútil jaja","replies":[]}]},{"poster":"ANYASZOMORÍTÓK","date":"2017-08-11T00:33:07.032+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=davichost,realm=LAS,application-id=v7qsfXsE,discussion-id=iRoIZEHB,comment-id=0000,timestamp=2017-08-11T00:20:42.449+0000)\n>\n> Su early, a diferencia de supps de escudo como {{champion:40}}  o {{champion:37}} , tienes el gancho que puede asegurar kills para tu adc, tienes mucho zoneo y engache\n> \n> Sus debilidades son que gasta bastante mana a niveles bajos, no tienes peel ni una forma real de aguantar daño (solo tu pasiva) y en late game no es tan útil como los soportes que blitz counterea {{champion:40}} {{champion:37}} {{champion:267}} {{champion:16}}  titnen mucho mas impacto en una tf en late, cosa que para que tu con blitz tengas prescencia tienes que meter una buena Q, que puede ser complicado en late donde hay ams espacio y mas herramientas para hacerle frente a tu combo\n\nLa Q y la E de Blitz se pueden usar como peel para el ADC cuando un asesino o un tanke se le quieren tirar. No sé que es eso de que no tiene peel. Y si lo armas bien tanque (HP+MR+ARMOR) la activa del Solari es algo para ver.","replies":[{"poster":"furikake","date":"2017-08-11T01:50:29.944+0000","up_votes":1,"down_votes":0,"body":"Peel se refiere a protección de aliados.\nBlizt tiene muy poco peel ya que su E es bastante mierda y su R se activa desde la posición del mismo. Para usar la R tienes que exponerte y se sabe que blitz no es buen tanque comparado con otros soportes tanques.\nSu única función es acertar la Q, son muy básicas sus mecanicas.","replies":[]},{"poster":"davichost","date":"2017-08-11T01:05:13.868+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dat de la Boi,realm=LAS,application-id=v7qsfXsE,discussion-id=iRoIZEHB,comment-id=00000001,timestamp=2017-08-11T00:33:07.032+0000)\n>\n> La Q y la E de Blitz se pueden usar como peel para el ADC cuando un asesino o un tanke se le quieren tirar. No sé que es eso de que no tiene peel. Y si lo armas bien tanque (HP+MR+ARMOR) la activa del Solari es algo para ver.\n\nno se compara a el ulti de una janna o sona, ni a todos los escudos que puede poner en una tf, en cuanto a sus resistencias si aguanta justamente porque lo haces tanke, pero sigue sin tener ningun escudo, % de resistencias o algo que aproveche esos stats, lo unico es su barrera de mana y es mas bien situacional","replies":[{"poster":"ANYASZOMORÍTÓK","date":"2017-08-11T01:08:14.820+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=davichost,realm=LAS,application-id=v7qsfXsE,discussion-id=iRoIZEHB,comment-id=000000010000,timestamp=2017-08-11T01:05:13.868+0000)\n>\n> no se compara a el ulti de una janna o sona, ni a todos los escudos que puede poner en una tf, en cuanto a sus resistencias si aguanta justamente porque lo haces tanke, pero sigue sin tener ningun escudo, % de resistencias o algo que aproveche esos stats, lo unico es su barrera de mana y es mas bien situacional\n\nLo que no tiene de escudo y curación lo tiene en potencial de ganar una partida metiendo un buen hook, algo que soportes como Sona, Soraka y Janna no tienen.","replies":[{"poster":"davichost","date":"2017-08-11T01:26:50.411+0000","up_votes":1,"down_votes":0,"body":"ya lo habia dicho antes, dije que blitz podía meter un hook y cambiar el curso, pero mientras no lo haga es un costal de papas, fin\n\npd: los supports de utilidad si viven lo suficiente terminan cambiando el curso de todas formas, por sus heal y escudos tienes de ejemplo {{champion:44}}  con su ulti , {{champion:16}}  con sus curaciones y silencio, {{champion:40}}  con su peel, etc.\n\nSi te fijas en op gg todos los soportes de utilidad, TODOS tienen un winrate positivo en late","replies":[{"poster":"furikake","date":"2017-08-11T01:46:47.128+0000","up_votes":1,"down_votes":0,"body":"blitz despues de fallar la Q es basura.","replies":[]}]},{"poster":"WhiteMax","date":"2017-08-11T01:12:05.989+0000","up_votes":1,"down_votes":0,"body":"No hablaban de Peel? \n\nPD: {{champion:201}} .","replies":[]}]}]}]}]},{"poster":"Whenkel","date":"2017-08-11T01:13:12.365+0000","up_votes":1,"down_votes":0,"body":"Tengo una duda si blitz se arma botas de mercurio estas reducen la relantizacion de su E ?","replies":[{"poster":"WhiteMax","date":"2017-08-11T01:17:28.381+0000","up_votes":1,"down_votes":0,"body":"{{item:3111}}  Reducen un 30% cualquier CC y relentizacion.\n\nLa E de quien?","replies":[{"poster":"Whenkel","date":"2017-08-11T13:25:10.644+0000","up_votes":1,"down_votes":0,"body":"Error mio xD es w de blitz gracias por avisar","replies":[]}]}]},{"poster":"TSW Rorschach","date":"2017-08-11T01:47:22.284+0000","up_votes":1,"down_votes":0,"body":"Blitz es el supp con mejor lvl 1 de todos en mi opinión, porque es capaz de lograr la primera sangre si llega a agarrar a uno desprevenido o una desventaja fuerte para el equipo rival (por ejemplo, invadiendo le sacás el blue o el red con el gancho, tu jg lo smitea y le cagaste el lvl 2 al jg contrario). Eso sí, el cd largo de esta habilidad hace que mal usado sea una forma de castigarte, ya que el supp enemigo va a aprovechar eso y el coste de maná es alto. En sí Blitz es un soporte para lograr la kill fácil, más que nada. En eso es muy fuerte.\n\nEn fase de líneas, es una pesadilla zoneando para todo supp squishy como {{champion:37}} {{champion:40}} {{champion:16}}  y muy especialmente {{champion:432}}. Sin embargo {{champion:25}} es la única excepción ya que counterea tu gancho de forma muy sencilla con su escudo, que cuesta mucho menos maná que tu gancho. Despues si te toca una {{champion:43}} muy buena, usa su escudo para con la velocidad esquivarte el gancho, pero no suele pasar tanto. Otra pesadilla para Blitz son los tanks {{champion:89}} {{champion:12}}, ya que si los agarrás a ellos, les regalaste un acercamiento gratuito a tu adc y justamente, otra desventaja de Blitz es que como soporte, **es malo haciendo peel**. {{champion:412}} también resulta molesto para él.\n\nLas tfs con Blitz tienen un poco de ventaja y desventaja: Un buen gancho al ap o ad carry enemigo, es una ventaja enorme. Un buen gancho al coloso enemigo de turno si justo se lo tanqueó, es vender una tf {{champion:31}} {{champion:122}} {{champion:75}}. Por eso mismo, en lo posible rinde más ponerte a emboscar con alguien, que es el fuerte de Blitz, en vez de armar tfs contra soportes donde son muy fuertes en ello {{champion:267}} {{champion:117}}","replies":[{"poster":"furikake","date":"2017-08-11T01:52:06.667+0000","up_votes":1,"down_votes":0,"body":"Por esa razón no es un soporte muy recomendado ya que es muy dependiente de la Q para ser útil.","replies":[{"poster":"TSW Rorschach","date":"2017-08-11T02:09:01.115+0000","up_votes":1,"down_votes":0,"body":"Como dijiste, en elos bajos es bueno por el asunto de que el squishy no suele evitar el gancho y se consiguen kills fáciles además de denegar al jg rival de forma fácil también. Pero a comparación del resto de los supps, se queda muy atrás tanto en peel como iniciaciones, incluso para los que en un principio sería counter xD así que si te toca un supp bueno de enemigo con buena tf, te deja inútil no, lo siguiente.","replies":[{"poster":"furikake","date":"2017-08-11T12:44:55.378+0000","up_votes":1,"down_votes":0,"body":"Por lo general los soportes no deberían ser tan dependientes del early game para ser útiles, por eso blitz no es recomendado (salvo en elos bajos donde los rivales no saben jugar en contra).","replies":[]}]}]}]},{"poster":"furikake","date":"2017-08-11T01:45:12.663+0000","up_votes":1,"down_votes":0,"body":"Blitz es un campeón muy sencillo:\nSu Q es un gancho que atrae al rival a tu posición. Es lo mejor que tiene ya que si aciertas a un campeón fragil, es muerte segura. En cambio, si traes a un tanque se pone jodido para tu equipo.\nSu W no es muy útil\nSu E es un hard cc (levantamiento) individual. Lo malo de esta habilidad es que tienes que estar a melee para usarla.\nSu R es un silencio en area sin embargo el centro es la posición de blitz por lo tanto: para acertar tienes que estar muy cerca de los rivales o usar tu gancho para aplicarlo al rival.\n\nEs un gran campeón contra soportes frágiles como {{champion:37}} {{champion:40}} {{champion:267}} {{champion:16}}  ya que un gancho bien aplicado contra estos campeones es muerte segura.\nEs muy debil contra tanques ya que {{champion:89}} {{champion:12}}  pueden quitar a tu adc de posición y evitando daño que podria recibir el rival que atrapaste.\n\nSinceramente, es un soporte para elos bajos nada más. Su potencia en early game radica en traer a alguien y matarlo entre varios sin embargo a medida que avanza la partida se vuelve inútil ya que ofrece muy poco peel a los aliados (su E es mala y su R tiene alcance corto). Si lo eliges tienes que tratar de ganar rápido sino en late game no haces nada.\n\nPuede ser tanque aunque es bastante malo en este rol ya que su función es iniciar con su Q nada más, por eso es un campeón muy sencillo.\n\nNo lo recomiendo ya que me parece tan malo de soporte, es mejor soportes que pongan escudos/curación o buffos como vel mov.\n\nRECORDATORIO: si vas a jugar con blitz, acerta las Q obligatoriamente o sos más inútil que un minion.","replies":[]}]}