{"poster":"Estilo Angelxd","date":"2016-11-17T02:10:49.980+0000","title":"Exceso de resolución en ambos clientes","subforum":"Bugs en cliente Alfa","embed":{"description":null,"url":"http://fotos.subefotos.com/63fe6e2c3adb2190fa78aef93159f423o.png","image":null},"up_votes":2,"down_votes":0,"body":"En Venezuela (Y apuesto que en muchos otros pa&iacute;ses que tienen el proyecto Canaima en pie, desconozco de cuales) regalan una especie de laptop, muy buena para jugar al League of Legends, pero con una pantalla b&aacute;sicamente, peque&ntilde;a, de 800x600, en el cliente normal, los que usamos las laptop Canaima, ten&iacute;amos la posibilidad de jugar con el Cliente antiguo, sin embargo, sin tener la posibilidad de Chatear, o ver que amigos est&aacute;n jugando, ahora intento usar el Alfa o como dicen nuevo cliente, y la resoluci&oacute;n es excesiva si mal no recuerdo desde que use un monitor externo con mi laptop Canaima, la m&iacute;nima resoluci&oacute;n que soporta el cliente es de 1024x576, por lo que esto nos quita la posibilidad de siquiera entrar en la cuenta, y no solo eso, no es que solo pase con laptops Canaimas, no... Esto pasar&iacute;a con toda aquella computadora de menos de 800x600 o incluso un poco mas alto, sin embargo tocara el punto en que nuestras caracter&iacute;sticas nos den la posibilidad de jugar, a excepci&oacute;n de una tonter&iacute;a... La pantalla. (Ojo en ambos clientes hay problemas de resoluci&oacute;n)","replies":[{"poster":"ChillerPet","date":"2016-11-17T02:15:35.166+0000","up_votes":1,"down_votes":0,"body":"Es mucha pinta para nada, la interfaz anterior estaba bien.{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Estilo Angelxd","date":"2016-11-17T05:07:09.277+0000","up_votes":1,"down_votes":1,"body":"Claro, para ti se ve bien ya que tu pc no tiene esa resolución mínima, en todo caso deberías de informarte mas.","replies":[{"poster":"ChillerPet","date":"2016-11-18T02:04:43.024+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Estilo Angelxd,realm=LAS,application-id=kXVTocsM,discussion-id=R43tP8VW,comment-id=00000000,timestamp=2016-11-17T05:07:09.277+0000)\n>\n> Claro, para ti se ve bien ya que tu pc no tiene esa resolución mínima, en todo caso deberías de informarte mas.\n\no.oU me encanta comosetiran tierra entre gente de la comunidad. COMUNIDAD...DAD...DAD...DAD... (Si, palabra hueca por estos lares){{champion:36}}","replies":[]}]}]},{"poster":"Sonya Kyron","date":"2016-11-17T14:34:01.570+0000","up_votes":1,"down_votes":0,"body":"Hola, ese problema lo solucione hace un año antes de que salga el cliente alfa, pero todavía no hice el tutorial para haerlo andar, vas a tener que esperar hasta mañana que con suerte si me deja mi novia lo armo.\n\nTe recuerdo que NINGUN CLIENTE DEL LOL anda en XXX-576, usan 800x600 minimo, y la pantalla es 1024x600 con lo cual ambos clientes funcionan bien.\nLo mas importante es que JAMAS SE OCULTE EL TRAY porque te buguea todo.","replies":[{"poster":"Estilo Angelxd","date":"2016-11-17T23:52:25.926+0000","up_votes":1,"down_votes":0,"body":"https://fotos.subefotos.com/08d1bdcc115457f09e77886493d8c596o.png","replies":[{"poster":"Sonya Kyron","date":"2016-11-18T00:01:04.877+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Estilo Angelxd,realm=LAS,application-id=kXVTocsM,discussion-id=R43tP8VW,comment-id=00010001,timestamp=2016-11-17T23:52:25.926+0000)\n>\n> https://fotos.subefotos.com/08d1bdcc115457f09e77886493d8c596o.png\n\nEso muestra claramente que es tamaño de ventana, para programación ventana se considera a un área de pantalla que va desde 2x2 a el total de la pantalla -1 pixel.","replies":[]}]},{"poster":"Estilo Angelxd","date":"2016-11-17T23:48:18.713+0000","up_votes":1,"down_votes":0,"body":"Te estas equivocando de cliente, incluso la misma configuración dice que el mínimo es 1024x576","replies":[{"poster":"Sonya Kyron","date":"2016-11-17T23:58:08.497+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Estilo Angelxd,realm=LAS,application-id=kXVTocsM,discussion-id=R43tP8VW,comment-id=00010000,timestamp=2016-11-17T23:48:18.713+0000)\n>\n> Te estas equivocando de cliente, incluso la misma configuración dice que el mínimo es 1024x576\n\njajaja, **lo bueno de tener 27 años arreglando computadoras es saber cuando se es el unico que no se equivoca**.\nNO HAY PANTALLAS EN ESA ROSULUCION NUNCA EXISTIERON, la pantalla es 1024x600 de las netbooks, pero con el TRAY que tiene 24 pixeles de alto, el área visible se reduce a 1024x576 pero si ponemos cualquier cosa en una resolución virtual se desformaria la imagen produciendo muchos BUGs con lo cual el tray en ese formato de pantalla NO SE PUEDE deshabilitar o OCULTAR AUTOMATICAMENTE.\n\nCon lo cual quien escribió esa resolución \"ficticia se equivoco\" ya que el x576 solo se invento para televisores formato 4x3 siendo la única resolución que la contempla la 768x576 PAL (Argentina Alemania y brasil).","replies":[]}]}]}]}