{"poster":"rendex","date":"2020-02-08T09:17:57.753+0000","title":"Trow a game and then afk","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"mi sta capitando moooooooolte volte di gente che entra in partita(solo/duo), da le sue belle 7-8 kill e poi va afk \r\n2  consecutive  e molte altre nella fantastica comunity dei casual gamer\r\nadesso so che ci sono le pene a tali comportamenti, ma se 10 birboni trollano le partite non credo di trovare piacere nel giocare in questo modo sia dalla mia parte che dalla parte nemica.\r\noltre al ban non chiedo ma \"pretendo\" che ci sia almeno un sintomo di scuse da parte della riot nei nostri confronti,\r\nnon dico di rimborsarmi il tempo che ho perso a causa loro facendomi capitare gentaglia del genere\r\nma almeno farmi perdere una parte figurativa  di PL  a causa di queste scorregge nel gioco (2-5)(?)\r\nattività di abuso ad esempio smurf che boostano altri abbandonando la partita e facendo perdere meno pl all'amicone possono essere sviati dal rimborso solo in caso di abbandono da parte di un giocatore non in premade o se la vogliamo fare lunga nella lista amici\r\nciò darebbe meno frustrazione non credo soltanto a me, ma alle mille migliaia di persone che si ritrovano buffoni del genere che mandano a schifo la partita solo perché la mamma non li ha allattati per bene la mattina","replies":[{"poster":"Hýbrís","date":"2020-02-09T13:24:48.486+0000","up_votes":1,"down_votes":0,"body":"Sarà sempre così e rimarrà sempre così . Metodi per risolvere questo problema almeno del 90% ci sono eccome ma alla riot va bene come è e riguardo la community se proponi delle soluzioni eccellenti ti flammano anche contro . Nulla è perfetto e se lol appunto non avesse queste problema sarebbe il gioco perfetto.","replies":[]},{"poster":"Rhaego98","date":"2020-02-08T12:34:58.848+0000","up_votes":1,"down_votes":0,"body":"Quello che dici ha completamente senso e condivido la frustrazione che provi, tutti quanti abbiamo sperimentato sulla nostra pelle quello che ti è capitato  se abbiamo giocato almeno 10 ore a questo gioco XD Non credo che togliendo meno punti in caso di sconfitta con leaver possa cambiare effettivamente qualcosa. Anzi credo sia più complicato per chi fa i codici per l'mmr. Io credo invece che la risposta migliore sia una più rigida punizione per i flame. Del resto per quanto tu possa avere una brutta partita o tu stia tiltando per altri motivi, avere dei compagni di squadra che ti vanno addosso non aiuta tantissimo al tuo benessere mentale, soprattutto in situazioni di stress come quelle. Ecco immagina di avere un brutto momento e invece di buttarti giù hai non uno non due ma quattro compagni che ti sostengono a fare di meglio. Ti viene anche voglia di giocare meglio. Non lo so, detta così sembra davvero una fantasia ma mi piacerebbe un sacco fosse così. Del resto quando non vediamo in faccia una persona è più facile insultare e sfogarsi ma non sempre ci ricordiamo che c'è una persona dietro ad un computer. Btw spero ti vada meglio con le prossime partite ;)","replies":[]},{"poster":"Fazzolino","date":"2020-02-10T16:29:58.545+0000","up_votes":1,"down_votes":1,"body":"Tranquillo, l'importante è che non inizia a fare flame.......quello si che è brutto forte.  se potessi esprimere un desiderio non direi \"vorrei che ci fosse pace nel mondo\" o \"aiutiamo tutti gli affamati\"....direi \"vorrei non ci fosse più quel brutto flame in lol, brutto brutto cattivo!\"","replies":[]}]}