{"poster":"3lB3sT1aN3Gr4","date":"2018-09-14T16:11:17.688+0000","title":"3 afks en una normal","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":0,"body":"hoy d&iacute;a estaba jugando una normal porque reci&eacute;n estaba llegando a la casa, la cosa es que me puse a jugar con mi main el cual es &#039;&#039;{{champion:17}} &#039;&#039; la cosa es que en la primera sangre la cual fue del jg enemigo, mi jg se va afk el cual es un graves ya ah&iacute; no se notaba la diferencia iba feed le estaba ganando la linea al {{champion:14}} pero de pronto el sup ({{champion:45}} ) se va afk ahi mi botlane estaba ultra mal por que no hab&iacute;a jg entonces iban mal y el veigar se fue afk ah&iacute; yo con la mf y el brand intentamos durar hasta el minuto 15 para tirar FF, ya la cosa ya en minuto 15 aparece el graves y el mid y el adc se van afk de la nada siendo que igual podr&iacute;amos un 4vs5 ademas estaba feed pero no sucedi&oacute; eso y se fueron afk, y aparte fallo el FF ; ya yo y el graves intentamos durar aunque sab&iacute;amos que nos iban a ganar quer&iacute;amos hacer tiempo para ver si regresaban los otros pero no, y perd&iacute; la partida mientras los enemigos felices de la vida por que los idiotas de mi team les regalaron la partida y ninguno reporto excepto el kayn el si reporto pero fue el &uacute;nico que reporto. se que esto deber&iacute;a estar en el soporte pero no me cargaba y me dejaba bug la pagina as&iacute; que no puse en el foro espero que alg&uacute;n Rioter vea esto y le de el castigo a estas personas y eso bye  {{sticker:vlad-salute}}","replies":[{"poster":"Salvor","date":"2018-09-14T16:15:39.641+0000","up_votes":2,"down_votes":0,"body":"Digo, repito y sostengo que tienen que aumentar la penalizacion a los AFK, pero en ranked, por suerte te paso en normal.","replies":[{"poster":"3lB3sT1aN3Gr4","date":"2018-09-14T16:17:05.436+0000","up_votes":2,"down_votes":0,"body":"sip por lo menos me paso en normal pero igual les una paja tremenda tener que jugar así","replies":[{"poster":"Salvor","date":"2018-09-14T16:18:29.004+0000","up_votes":1,"down_votes":0,"body":">  paja tremenda tener que jugar así\n\nSurrender al 10 con 5 votos, al 15 con 4.\nSe suponía que lo iban a probar en Oceanía eso, pero al final no lo hicieron.","replies":[{"poster":"PasoPackXHonores","date":"2018-09-14T22:07:58.798+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Salvor,realm=LAS,application-id=PJAKt7ph,discussion-id=elWNx81F,comment-id=000000000000,timestamp=2018-09-14T16:18:29.004+0000)\n>\n> Surrender al 10 con 5 votos, al 15 con 4.\n> Se suponía que lo iban a probar en Oceanía eso, pero al final no lo hicieron.\n\nDe que sirve un surrender al 10 con 5 votos, si el AFK o troll no va a votar que si. Debe haber sanciones mas severas. \nTe quedaste AFK? 1 día sin poder jugar. Y listo. Van a ver como se acaban esas ratas.","replies":[]},{"poster":"AlphaLyrae","date":"2018-09-14T18:16:16.078+0000","up_votes":1,"down_votes":0,"body":"El problema es que el surrender y el remake tendrían que tener alguna forma distinta, por ejemplo si son 2 o más personas afk que sea válido con menos votos (A menos que vayas muy feed y seas muy bueno es dificil ganar una 3 vs 5). Por ejemplo, el otro día jugue una normal en la que eran 4 pre-made, dos se fueron afk con la excusa de \"ya volvemos\" , recién arrancaba la partida. Tire remake, obviamente sus dos amigos restantes dieron que no, así que jugamos una partida 3 vs 5 horrible. A todo esto el \"ya volvemos\" se volvieron 25 minutos, durante el cual me rechazaron el remake y los surrender \"porque sus amigos ya volvian\", volvieron cuando ya estaban rompiendo el nexo.","replies":[]}]}]}]},{"poster":"Zalvagzk","date":"2018-09-26T00:38:55.641+0000","up_votes":1,"down_votes":0,"body":"\"en una normal\". pero no pierdas la esperanza, los van a banear, como lo hicieron conmigo por entrar sin ganas a jugar y trollear, así que sigue reportando xd","replies":[]}]}