{"poster":"YolpZ","date":"2015-08-16T16:02:34.135+0000","title":"Was haltet ihr von Mordekaiser?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Ich bin noch relativ neu und wollte euch einmal fragen ,was ihr von Mordekaiser haltet. Also eher stark / schwach , OP / Nicht OP. Ich entschuldige mich schon mal, falls die Veteranen unter euch das jetzt als unn&ouml;tig empfinden. :)","replies":[{"poster":"PinguinBIFI","date":"2016-08-17T16:51:12.330+0000","up_votes":1,"down_votes":0,"body":"Morde ist momentan nicht so gut, aber wenn du den Champ mainst, dann gewinnst du wirklich immer. Eigene Erfahrung. hab mittlerweile ca. 460k mit dem und du kannst ihn überall zocken. WICHTIG: rylais first item. dann kannst du immer slowen.","replies":[]},{"poster":"YolpZ","date":"2015-08-16T21:17:56.382+0000","up_votes":1,"down_votes":0,"body":"Danke bisher für eure hilfreichen Kommentare :)\n@Misaki Alien , okay danke, ich versuche im Moment Wukong Top und Fizz Mid zu meistern. Im großen und ganzen habe ich mich (bis jetzt) auf Toplane und Midlane eingeordnet, weswegen ich da jetzt so ein wenig recherchiere :D","replies":[]},{"poster":"MeIsTeR MaNne","date":"2015-08-16T17:58:37.434+0000","up_votes":1,"down_votes":0,"body":"Persönlich finde ich ihn recht cool aber ein Problem ist (für “Anfänger“) dass er keinen guten Escape hat, ich hoffe meine Infos über seine Fähigkeiten sind korrekt, dadurch musst du einen guten Überblick der Karte bekommen: wo ist der gegnerische jungler? Und du musst gut warden. Wenn das geht ist er bestimmt nicht schlecht. Allerdings nicht op. Von daher viel Spaß mit oder auch ohne Mordekaiser in den kommenden Spielen! Lg Kraxxm","replies":[]},{"poster":"ClAO KAKAO","date":"2015-08-16T16:39:54.219+0000","up_votes":1,"down_votes":0,"body":">Mordekaiser wird demnächst ganz anders zu spielen sein, zumindest seine Rolle also ist es ziemlich egal was die Leute hier sagen atm","replies":[]},{"poster":"Misaki Alien","date":"2015-08-16T16:26:03.897+0000","up_votes":1,"down_votes":0,"body":"Ganz gut, nicht OP, aber er ist nicht ganz einfach zu spielen, meiner Meinung nach.\nWenn du überlegst welchen Champ du  kaufen möchtest (da du Stufe 16 bist gehe ich einfach mal davon aus), dann würde ich dir empfehlen eher die Rota abzuwarten. Grade am Anfang ist es relativ schwer sich auf Champs festzulegen und zudem gibt es so massig davon, da würde ich länger überlegen welchen Champ ich kaufe.\n\nAch btw denke ich, dass Morde bald auf jeden Fall um einige stärker sein wird als jetzt wenn man sich den angekündigten Buff anschaut. \n(iwo unter Neuigkeiten angekündigt in letzer Zeit)","replies":[]}]}