{"poster":"Jindrodium","date":"2017-11-03T16:41:06.147+0000","title":"Ist Yasuo einer der \"most skilled Champions\" oder ehr einer der \"Braindead Champions\"","subforum":"Champions & Gameplay","up_votes":3,"down_votes":2,"body":"**Guten Tag in die Runde,\r\n**\r\nich stelle mich mal vor. Ich bin Jindrodium, ein erfahrener Spieler der seit Season 2 League of Legends spielt.\r\nWie ich auf das Thema kam? Ich habe neulich eine runde Rangliste (solo/duo) gespielt und traff auf einen Bard spieler, der meinte Yasuo\r\nwäre ein \"Braindead Champion\" und würde kein Skill benötigen.\r\n\r\nNun Ja, anstatt mich mit dem pubertären Kind zu streiten, habe ich mich entschlossen eine kleine Runde auf zu machen und dieses Thema mal zu diskutieren. Meiner Meinung nach kann ein Champion nicht als unskilled bezeichnet werden wenn er komplex aufgebaut ist. \r\n\r\nMeiner Meinung nach ist Yasuo ein Champion der ein großes outplay Potenzial hat und daher sehr skill lastig ist. Je Komplexer ein Champion ist, um so mehr Skill benötigt er um ihn auf seinem maximalem Level zu spielen. Es gibt für mich nicht wirklich ein \"Braindead Champion\", es ist nur leichter manche auf ihrem Maximum zu spielen. \r\n\r\nSchreibt doch einfach mal was ihr denkt!!\r\n\r\nEuer Jindrodium{{champion:157}}","replies":[{"poster":"Janzwing","date":"2017-11-03T16:45:37.206+0000","up_votes":3,"down_votes":0,"body":"Das stimmt Yasuo ist ein wirklich high skilled Champion. Es mag zwar sein, dass er einfach zu spielen ist, aber ihn zu meistern benötigt viel Können.{{champion:92}} \n{{sticker:galio-happy}}","replies":[{"poster":"Jindrodium","date":"2017-11-03T16:48:30.466+0000","up_votes":2,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Eceroth","date":"2017-11-03T16:51:04.827+0000","up_votes":1,"down_votes":1,"body":"als highskilled würd ich ihn jetz nicht gerade bezeichnen es gibt sehr viele champs die sowohl schwerer zu spielen als auhc noch schwere zu meistern sind","replies":[{"poster":"Allerbester Biss","date":"2017-11-03T17:59:20.605+0000","up_votes":1,"down_votes":0,"body":"xD wer brauch denn mehr Skill um effektiv zu sein?","replies":[{"poster":"Eceroth","date":"2017-11-03T18:11:58.654+0000","up_votes":1,"down_votes":0,"body":"wie wäre es mit den meisten mages mit skillshot  zum beispiel ryze ziggs cassio syndra taliya","replies":[{"poster":"Allerbester Biss","date":"2017-11-03T19:28:59.778+0000","up_votes":1,"down_votes":0,"body":"Und wie ist es mit Positioning?\nAls Mage ist es deutlich leichter sich zu positionieren als für einen Nahkämpfer","replies":[{"poster":"Eceroth","date":"2017-11-03T20:06:16.239+0000","up_votes":1,"down_votes":0,"body":"positioning brauch jeder champ und jeder auf ner anderen position das garnichts damit zu tun ob du den champion beherschen musst oder nicht","replies":[{"poster":"Allerbester Biss","date":"2017-11-04T09:40:16.350+0000","up_votes":1,"down_votes":0,"body":"WIE bitte? XD\nAlso Positioning von einem Tank ist genauso schwer wie von einem ADC? oder wie von einem Assasin?\nOder wie von Yasuo?","replies":[{"poster":"Eceroth","date":"2017-11-05T00:48:20.317+0000","up_votes":1,"down_votes":0,"body":"nein natürlich hat jeder ein anders schweres positioning aber das musst du für jeden champion lernenund das ist auch bei jedem abnders mein freund","replies":[]}]}]},{"poster":"Jindrodium","date":"2017-11-03T21:15:57.337+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Oriius","date":"2017-11-04T03:00:12.898+0000","up_votes":1,"down_votes":0,"body":"wtf willste mir erzählen das cassio,ziggs,syndra mehr skill erfordern als yas? vermutlich brauch yi auch mehr skill als riven ._.","replies":[{"poster":"Eceroth","date":"2017-11-05T00:47:39.395+0000","up_votes":1,"down_votes":0,"body":"yasou macht auch ohne seine q noch mehr als genug schaden versuch mal nur mit autoattacks als mage zu arbeiten da wirds ohne skillshots schwer ne :)","replies":[]},{"poster":"Roxãs","date":"2017-11-04T10:25:59.725+0000","up_votes":1,"down_votes":0,"body":"Auch als Yi braucht man gewissen Skill.\nWann gehst du rein, wann gehst du raus, was machst du dann und dann und wie.\nIst zwar mehr Game knowledge, aber bei manchen Champs sind diese dinge einfacher als Yi.\nGeh als Yi falsch rein und du bist sofort Tod oder nutzlos ohne was gemacht haben zu können.\nRiven kann da viel einfacher engangen oder CC Dodgen als Yi.","replies":[]}]}]}]}]}]},{"poster":"Like a Sir","date":"2017-11-07T14:25:15.321+0000","up_votes":1,"down_votes":0,"body":"Er ist einfach überladen mit einem guten Kit vorallem sein W ist meiner Meinung nach richtig lächerlich da er mit einer non Ultimate so viele Ultimates einfach nur countert und er in jeder Phase des Spiels stark ist anders als andere Champs wie Panth oder Renekton die im early Götter sind aber später ziemlich hart abfallen im Vergleich zu anderen Champs.\n\nAuch denke ich das Yasuo bei den Leuten aufgrund seiner dashes Wall Ultimate einfach sein Auftreten in dem Spiel wenn man ihn spielt oft denkt wie gut man ist und wie toll das jetzt aussah etc. wodurch viele ihn spielen wollen da einfach die \"Plays\" so gut aussehen im Vergleich ein Rammus der um die Ecke rollt stinkt ab gegen einen Yasuo der durch die Wand in die Raptor rein En kann :) (Rammus -> langweilig kann nur rollen Yasuo -> aufregend, spannend und sieht gut aus)\n\nIch für meinen Teil finde es halt frustrierend nen Yasuo zu sehen der extrem behind ist x mal auf der Lane stirbt dann in einem fight 2 kills abstaubt und dann einfach anfängt zu snowballen da fehlt mir einfach das Balancing...\n\nIch hab ihn vor einigen Wochen paar mal gespielt/versucht ich habe meist haushoch verloren auf der Lane war aber bei einem Spiel immer noch in der Lage (dieses Spiel blieb mir im Gedächtnis) mit meinem massiven \"Skill\" ein W zu drücken um damit 2 Ultimates abzuwehren (Nami Wave und Xayah R) und meinem Team damit einen Teamfight zu gewinnen.... \nLeicht zu Spielen ist er nicht sehe ich mitlerweile ein nach ein paar Spielen wurde es dann besser und ich hatte Sogar einmal eine Lane mit ihm gewonnen.\n\nNach den Spielen bin ich der Meinung wenn man ihn ein paar mal gespielt hat und die Grundzüge seiner Mechanics verstanden hat ist man durchaus in der Lage seinen Lane Gegner einfach nur zu Stompen, da wenn Range du ihn unter den Tower pushend ab und an ne Windwall reinstellst um den Farm zu verwehren (unglaublich Tiltend sowas) oder um seine Autos / Spells abzuwehren, gegen nen Meele rein mit dem E ein q poke vielleicht noch ein Auto und wieder weg mit dem E.\n\n\nNachdem ich in gespielt habe bin ich nun der Auffassung in Lower Elo Bronze, Silber und Gold ist er sicher zu Stark mit dem Kit welches er besitzt  in der höheren ist er wahrscheinlich sogar Balanced (mit Ausnahme des W ist einfach lächerlich) aber in der Low Elo in welcher die Meisten Spieler sind ist er einfach viel zu stark vorallem wenn er early paar kills auf der Lane holt und dann einfach 1 v 5 spielen kann....","replies":[]},{"poster":"Sihari","date":"2017-11-03T16:58:42.975+0000","up_votes":1,"down_votes":0,"body":"Ich bin der Meinung, dass Yasuo zwar viel Skill benötigt um ihn bis zum äußersten zu nutzen, aber andererseits hat er auch einige Mechaniken, die auch ein paar speziellen Spielern helfen so auszusehen, als ob sie mehr drauf haben, obwohl sie einfach nur irgendwie alle Knöpfe hämmern und beten.\nWegen diesen Mechaniken macht es auch nur wenigen Leuten Spaß gegen ihn zu spielen und ich hoffe so sehr, dass RIOT den Plan ihm mal n Mini-Rework zu geben endlich auch durchzieht und nicht nur davon redet.","replies":[{"poster":"Jindrodium","date":"2017-11-04T16:10:14.191+0000","up_votes":1,"down_votes":0,"body":"Stimme dir zu bis du zu dem Rework kamst :)","replies":[{"poster":"Sihari","date":"2017-11-04T17:55:33.946+0000","up_votes":1,"down_votes":0,"body":"Wieso wärst du denn gegen ein Rework?\nYasuo zählt leider zu den Champions, die im Punkt \"es macht Spaß gegen ihn zu spielen\" am wenigsten ausbalanciert ist. Spielst du selbst zB soetwas wie Jax, dann hast du keinen Spaß, weil du ohne viel Aufwand gewinnen kannst und warum Fernkämpfer, und vor allem die mit Skillshots niemals Spaß gegen Yasuo haben werden, kannst du dir sicher vorstellen.\nKleine Änderungen könnten das verbessern und dann wäre Yasuo auch nicht einer der Champions, der trotz normaler Winrate permanent unter den meistgebannten Champions landet.","replies":[]}]}]},{"poster":"MarCommander2211","date":"2017-11-04T17:17:07.211+0000","up_votes":1,"down_votes":0,"body":"Wie ein Blizzard-Spiel ist Yasuo easy to leran, but hard to master, und dabei sind schlechte Yasuos unglaublcihe Grütze während sehr gute Yasuos besser rasieren als Gilette.","replies":[]},{"poster":"MrWoscht","date":"2017-11-03T18:16:12.391+0000","up_votes":1,"down_votes":0,"body":"Jeder Bronze V hat entweder yasou lvl 7 oder Yasuo ist number #1 Noobchamp","replies":[{"poster":"Reverted Rengod","date":"2017-11-03T19:18:34.469+0000","up_votes":1,"down_votes":0,"body":"Jeder der das sagt wirkt selber wien bronzie lol","replies":[{"poster":"Jindrodium","date":"2017-11-03T21:16:29.052+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Reverted Rengod","date":"2017-11-03T19:19:57.862+0000","up_votes":1,"down_votes":0,"body":"Da du selber erst S5 bist werde ich diese Antwort erst recht nicht ernst nehmen","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2017-11-03T17:08:28.153+0000","up_votes":1,"down_votes":0,"body":"Naja... also... ich sag das mal so... das hängt davon ab... Wenn ich Malphite und Zac in meinem Team habe, kann selbst ich Yasuo spielen... Die R Taste finde ich dann schon...\nWenn ich mir dagegen alle Knock Ups selber erarbeiten muss... Ich sag das mal so: Das kriege ich nie hin. Dementsprechend reicht mein Skill nicht aus, um ihn zu spielen... was vielleicht mehr über mich aussagt, als über den Champ... andererseits... kann ich mittlerweile die Q-Flash-Combo auf Alistar oder die E-Flash-Combo auf Ahri...\nNen \"Noobchamp\" sieht definitiv anders aus...","replies":[]}]}