{"poster":"Chaos11377","date":"2017-05-16T10:04:02.007+0000","title":"Bronze Support will sich verbessern","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hallo liebe Beschw&ouml;rer.\r\nMein Name ist chaos11377 und ich habe league of legends f&uuml;r mich entdeckt. Doch ich bin einfach nicht mit mir zufrieden. Ich habe kurzzeitig versucht, auf der Toplane zu spielen, habe dies aber auch aufgegeben und mein Herz ist an der Support Position h&auml;ngen geblieben. Was mein Anliegen nun ist: Ich suche jemanden, der mir meine Fehler aufzeigt und mir hilft, allgemein besser zu werden. Ich bin vielleicht nicht grade der beste Spieler, doch ich will besser werden und n&uuml;tzlich f&uuml;r ein Team sein. Ich bin Bronze 3 und dar&uuml;ber bin ich nicht gl&uuml;cklich. Ich will aber auch nicht geboosted werden, dann w&auml;re es ja nicht meine Leistung. Ich suche nur jemanden, der besser ist als ich und Spa&szlig; daran hat, mit mir zu spielen und mich explizit auf meine Fehler hinzuweisen. Ich hab leider nicht so viel Geld, weswegen ich auf eine gute Seele hoffe, die mir helfen will. Denn es hei&szlig;t so sch&ouml;n: &quot;Die Hoffnung stirbt zuletzt&quot;. Aber sie stirbt irgendwann. Solltest du so eine nette Person sein, die mir helfen w&uuml;rde, w&auml;re das toll, wenn du dich bei mir melden w&uuml;rdest. Ich bin 19 Jahre alt und flame so gut wie nie. Solltest du mir auch helfen k&ouml;nnen, so werde ich mich irgendwann erkenntlich zeigen. Das verspreche ich.\r\nMit freundlichen Gr&uuml;&szlig;en\r\nchaos11377","replies":[{"poster":"MeMyselfandBaal","date":"2017-05-16T15:02:38.811+0000","up_votes":2,"down_votes":1,"body":"Das aller erste, was ich dir empfehlen würde, ist: Spiele Sona. \nDafür gibt es 2 Gründe: 1. Sona ist zwar in keine Rolle die Beste (weshalb man sie bei den Profs nie sieht), aber in allen Rollen ziemlich gut. Dass heißt, du kannst sie gegen alles und mit allem, was sonst so gespielt wird, spielen.\n2. Sona ist grundlegend (bis man irgendwann anfängt mit den Powerakkorden rumzuspielen... und bevor du fragst: auf dem Q ist der meistens verschwendet... Schaden wird überschätzt) ein sehr, sehr einfacher Support: Du machst nen Schritt vorwärts, drückst Q, kriegst 16 Gold, gehst zurück. So sieht im wesentlichen deine Laningphase aus. Das bringt einen ganz entscheidenden Vorteil mit sich: Du kannst dich auf deine versteckte geheime Aufgabe konzentrieren: Die Karte im Blick haben: Wo stehen gerade unsere Wards? Kann ich daraus schließen, wo der gegnerische Jungler ist? Haben wir überhaupt Wards im River? Wann kriege ich die dorthin platziert? (Sona ist da natürlich nicht die einzige Option. Aber so was macht sich allgemein auf defensiveren Supports wie Janna, Braum, Tahm Kench besser als auf Leona und Alistar, wo du ständig auf deine Lane achten und abschätzen musst, wann du all in gehen kannst...)\nUnd ja, du solltest dir angewöhnen alle 5 Sekunden kurz auf die Minimap zu gucken und die Informationen, die du dort erlangst, weiterzugeben. Auch wenn du den Jungler dann auf der Topside siehst, kannst du ihn anpingen.\n\nUnd bei deinen Wardzahlen fällt mir auch sofort etwas auf: Die schwanken extrem mit der Teamleistung. Aber nur weil dein Team am verlieren ist, wird das Warden nicht unwichtig. Eher im Gegenteil. Du musst halt auch lernen, wie du im Falle eines Rückstandes deinen eigenen Jungle defensiv wardest. Genau so, wie du im Falle eines anstehenden Sieges den gegnerischen Jungle wardest, weil beim Pushen von dort die Gefahr für dich kommt.\n\nEinen weiteren meiner Meinung nach recht offensichtlichen Fehler, den du begehst, ist: Aufs Anrecht der Frostkönigin zu gehen. Dabei geht es primär um 2 ganz böse Begriffe: Sloteffizienz und Goldeffizienz. Beides ist für dich als Support verdammt wichtig, da du weniger Slots (du brauchst als einziger den Sightstone, hast also nur 5 Itemslots... von denen einer für Pinkwards draufgehen sollte) und weniger Gold als alle anderen besitzt. Die Support Meta besteht seit Saisonbeginn gefühlt aus einem \"Redemption Rush\". Wer dieses Item als erstes fertig hat und sinnvoll anwendet, gewinnt das Spiel. (Auch wenn die Zeiten, wo den Sightstone überspringen, vorbei sind...). Und diesen Powerspike zu erreichen, machst du dir unnötig schwer. Nehmen wir einfach mal dein letztes Spiel auf Nami. Da baust du in Minute 19 von 25 das Anrecht fertig. Steckst aber auch 1.600 Gold in dieses Item, um ein Mal die Geister loszuschicken. Danach fängst du dann noch an Redemption zu bauen. Wenn du in diesem Moment (auf Grund des Rückstandes) das Level 2 Gold Generation Item und den Sightstone behältst, kriegst du deinen Redemption Song in Minute 21 fertig (Kostenpunkt 2.200 Gold). Und dann kannst du mit dem gut platzierten Heal den Kampf in Minute 22 rumdrehen... Oder zumindest spannender gestalten. Wenn du statt auf das Anrecht auf das Auge des Wächters gehst, hast du immer noch die Möglichkeit dein Redemption vor Spielende fertig zu bekommen.\nUnd ja, auch wenn das Spiel schlecht aussieht, seit ihr in Minute 16 (in der du dich quasi für das Anrecht entscheidest) nur 3,7K Gold hinten. Das Spiel kann man also noch drehen, wenn man sich die richtigen Items holt.\n\nUm das Thema Sloteffizienz noch etwas auszubauen: Dies wird vor allem wichtig, wenn du dein 3. oder 4. Item zusammenbauen willst. Also als Support Main hast du in Minute 25 (wenn es gut läuft) das Anrecht, dem Sightstone, Schuhe, Pinkwards und Redemption im Inventrar. 5 von 6 Slots sind belegt. Du kommst mit 900 Gold nach Hause... jetzt kannst du dir einen Magiemantel oder eine Stoffrüstung kaufen um irgendwann das Locket zu bauen. Ich habe dagegen (in einen schlechter laufenden Spiel, also mit weniger Gold) das Auge der Wächter, Schuhe Pinkwards und Redemption im Koffer. Kann mir aber den Magiemantel und die Stoffrüstung kaufen und komme somit schneller zum Locket. Wenn es für dich wirklich Kacke läuft, kommst du dann irgendwann in der Basis an und kannst dir gar nichts mehr kaufen (oder musst auf Pink Wards verzichten), weil du einfach keinen Platz mehr im Inventar hast... So was ist immer schlecht.\n\nUnd Redemption und Locket sind halt die beiden großen Itempowerspikes, die du erreichen willst. Und ja, in Season 7 gibt es dies das erste Mal für Supports. Vorher war es abgesehen von Mikaels gefühlt vollkommen egal, was du in welcher Reihenfolge gebaut hast. Jetzt ist so was wichtig. Versuche so schnell und direkt wie möglich zu diesen beiden Items zu kommen und lerne sie im richtigen Moment an die richtige Stelle zu setzen... dass ist gerade bei Redemption nicht sooo einfach...\n\nAn sonsten gilt halt Üben Üben Üben... der Hauptgrund, warum ich kein Bronze Support mehr bin sondern mich Platin schimpfen darf, sind 5 Jahre Erfahrung. Und LoL lebt halt extrem davon, dass du abschätzen kannst, welche Kombination in den nächsten 10 Sekunden gerade stärker ist als das Gegenüber. Dafür muss man zum einen Wissen, was sein eigener Champ kann. Man muss aber auch das Schadenspotenzial der anderen kennen. Oder die Playmaking Möglichkeiten. Da hilft einfach nur zocken.","replies":[]},{"poster":"Poogle Woogle","date":"2017-05-16T20:50:41.526+0000","up_votes":1,"down_votes":0,"body":"hab dich mal geaddet, war sehr lange main support :)","replies":[]},{"poster":"Baked Jesus","date":"2017-05-16T10:14:41.384+0000","up_votes":1,"down_votes":0,"body":"Wenn du Replays verschicken kannst, wäre ich gewillt, mir deine Spielweise mal anzuschauen.","replies":[{"poster":"Chaos11377","date":"2017-05-16T12:00:37.669+0000","up_votes":1,"down_votes":0,"body":"Erst einmal bedanke ich mich, dass du mir deine Hilfe anbietest.\nNun kommen wir zu den Replays. Leider habe ich keine Seite mehr, wo Replays gespeichert sind. Ich war mal auf Replay.gg, doch diese seite gibt es nicht mehr, dank des neuen clients. Die gedownloadeten Replays vom User aus dem Client müssten aber irgendwo gespeichert sein, weswegen ich diese heraussuchen könnte und schicken könnte. Hab gehört, die kann man auch umständlich so angucken. Oder aber ich speichere ein spiel als \"highlight\" und lade das als youtube video hoch. wie du willst","replies":[]}]},{"poster":"Shakês Beer","date":"2017-05-16T10:20:29.750+0000","up_votes":1,"down_votes":0,"body":"Ich kann dir vielleicht auch helfen. Grundsätzlich kann ich dir einen Tipp geben wie man automatisch als Sup Elo macht:\nWarde den kompletten River ab und habe Mapawareness. Du musst generell so denken: Dein ADC(Midlaner, Toplaner auch) ist entweder Stockdumm oder ist einfach zu sehr mit Farmen etc. beschäftigt, ergo sieht er vielleicht mal nicht auf die Karte. (Das kommt viel häufiger vor als es sollte) Wenn du diesen Part übernimmst kannst du relativ häufig deine Mates warnen :) Damit gewinnst du in Low elo automatisch sehr stark an impact, da du so verhindern kannst, dass deine Mates ihre Lane loosen :)","replies":[]},{"poster":"Bayonetta38","date":"2017-05-26T09:21:01.709+0000","up_votes":1,"down_votes":1,"body":"Hi :) bin SuppMain seit langer Zeit (Season 2 glaub ich). Ich bin zwar momentan nicht sehr hoch in der Elo aber ich war von Bronze bis Platin vertreten und weil ich schon sehr lange dabei bin (Season 1) könnte ich dir paar Tipps geben. Wegen sowas würde ich niemals Geld verlangen, ist doch bescheuert. Wegen einem Spiel verlange ich kein Geld, allgemein jemanden zu helfen ist nichts wofür man Geld verlangen sollte. Im Gegenteil , ich würde mich freuen wenn ich mein Wissen mit jemanden teilen könnte und es dieser Person wirklich helfen würde :).\n \nFalls du noch jemanden suchst kannst du gerne mich gerne adden :).","replies":[]},{"poster":"NoName12221","date":"2017-05-16T12:23:54.106+0000","up_votes":1,"down_votes":4,"body":"dan hör auf supp zu spielen in der bronze elo und spiel eine carry  lane (mid, Jng )","replies":[]}]}