{"poster":"Raston","date":"2015-02-16T14:45:07.682+0000","title":"Report-Funktion fuer Scripting !?!","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":1,"body":"Gruesse liebe Mitbeschwoerer!\r\n\r\nMir ist bekannt, dass Riot ja gegen unsere allseits beliebten Scripter vorgeht, aber dennoch kann hier und da mal einer durchschluepfen. Hatte gestern mal wieder so ein Game auf LatinAmericaNorth, wo eine Kata schneller durch unser Team gehuepft ist, als ich \"LOL\" sagen konnte.\r\n\r\nNatuerich war ich nicht der Einzige, der das bemerkt hat: Sogar ihr eigenes Team wollte sie dafuer reporten. Alles schoen und gut, aber unter welcher Reportfunktion soll ich denn das bitte melden? Entweder wandern die Reports direkt in den Muell ( \"schlechter Spieler\") oder werden vom System ueberprueft und meine schoene Bemerkung \"blabla Scriptusing blabla\" wird nicht zur Kenntnis genommen.\r\n\r\nIch sage ja auch nicht : \" Das war zu 100 % ein Script-user! Gogo ban oder ich zahle nie wieder einen Cent!\" Nein, aber ich wuerde mir wuenschen, dass auf Grund einiger Reports vielleicht mal ein Tool durchlaeuft um diesen Spieler zu ueberpruefen.\r\n\r\nGerade bezueglich der steigenden Popularitaet solcher Script-Programme, trotz diverser Ban-Wellen seitens Riot, waere eine solche Report-Funktion angebracht.\r\n\r\nWas denkt ihr darueber?\r\n\r\nSo long\r\nRaston","replies":[{"poster":"Humpelstilzche","date":"2015-02-16T14:50:44.328+0000","up_votes":2,"down_votes":0,"body":"Es gibt keine Report-Funktion dafür, da Riot nicht auf diese Reports angewiesen ist und Scripter auch so identifizieren kann. Sonderlich nützlich wären die Reports, wie du ja bereits selber angedeutet hast, sowieso nicht, da damit viel zu sehr einfach nur gute Spieler und nicht Scripter reportet würden. Riots Methoden sind da deutlich zuverlässiger.","replies":[]},{"poster":"eingew","date":"2015-02-16T14:46:31.486+0000","up_votes":1,"down_votes":0,"body":"Script User kannst du nur über den Riot Support melden. Den Link findest du oben rechts. Natürlich kann auch mal ein solcher Nutzer durch das System schlüpfen, das ist allerdings sehr unwahrscheinlich.","replies":[]}]}