{"poster":"Sage Manmeet","date":"2017-07-26T20:13:36.718+0000","title":"Placement in lower priority Que.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Getting placed in the lower priority que just because of a network problem is unfair. I get it if a person is afk during a game he or she deserves to be placed in a lower priority que. But if my network breaks down and i am unable to reconnect, there is nothing really i can do about it. its not our fault that our network broke down all of a sudden these things can happen. Nobody can avoid it. Now I have to wait half an hour before the game starts for five games, and it wasnt even my fault. They should really add an exception for cases like these. \r\n\r\nI hope this gets really looked upon","replies":[{"poster":"LightSword","date":"2017-07-26T20:42:02.145+0000","up_votes":2,"down_votes":0,"body":"If I don't say it, someone will.\n\nLeaverbuster doesn't target players with bad networks to punish bad networks, but because disconnecting will still have the same negative effect on the players who are still in the game, regardless of why it happens.","replies":[]},{"poster":"Porocles","date":"2017-07-26T21:18:43.217+0000","up_votes":1,"down_votes":0,"body":"Players who are intentionally afk'ing are likely to face harsher punishments than just a [leaverbuster](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ) if consistent.  I feel you that getting a leaverbuster for network issues suck, but it's also unfair for other players who had to be down a player as a result.  \n\nIt's really important that your connection is in good health before entering a game, and you can use our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to troubleshoot instability to the game server.  Take a break from matchmaking for now, and go over those steps until you're sure you can stay connected.  Be sure to test it in a custom to prevent further penalties!","replies":[]}]}