{"poster":"Doo ","date":"2016-01-14T21:14:04.037+0000","title":"Masteries & Runen","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":3,"body":"Hi, mir ist es schon &ouml;fters aufgefallen das manche Leute in ranked weder masteries noch runen haben. Meiner Meinung nach sollte man eine Sperre einrichten sodass man wenigstens Masteries haben muss um ranked spielen zu d&uuml;rfen. Ich meine, wer spielt ranked ohne masteries oder runen? - Anscheinend gibt es ja so Leute.","replies":[{"poster":"Temudschinn","date":"2016-01-14T22:17:05.221+0000","up_votes":3,"down_votes":0,"body":"Ist doch schön, wenn es Leute gibt die sich handycaps geben, leichtere Gegner :)","replies":[]},{"poster":"Megnok","date":"2016-01-14T21:45:35.865+0000","up_votes":1,"down_votes":0,"body":"ich denke auch die sehen halt schon was sie davon habe. Aber ärgern würde ich mich auch arg wenn ich sie im team hab ^^","replies":[{"poster":"FrankerX","date":"2016-01-15T11:54:27.184+0000","up_votes":1,"down_votes":1,"body":"sie sehen eben nicht was sie davon haben weil sie es meist nicht begreifen. wenn du eine full support soraka in deinem team hast mit der masterie die dich bei krit dmg heilst und sie fragst warum sie das hat und sagt \"why not? it heals with crits\" dann kapiert sie es offenbar nicht und sieht es auch nicht","replies":[{"poster":"Megnok","date":"2016-01-15T13:46:48.186+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Brâ1ncânc3r,realm=EUW,application-id=KYnfKGf0,discussion-id=caxvm1iW,comment-id=00010001,timestamp=2016-01-15T11:54:27.184+0000)\n>\n> sie sehen eben nicht was sie davon haben weil sie es meist nicht begreifen. wenn du eine full support soraka in deinem team hast mit der masterie die dich bei krit dmg heilst und sie fragst warum sie das hat und sagt \"why not? it heals with crits\" dann kapiert sie es offenbar nicht und sieht es auch nicht\n\nVielleicht ist auch einfach die Lernkurve geringer. Als die neuen masteries kamen hab ich Soraka ähnlich gespielt, bis ich malgenau verstanden hatte was da los ist. Und bis heut wechsel ich mit ihr die Materie hin und her, mal denke ich dieses Lebensding ist op, dann wiederum find ich die Supportermastery besser.\n\nMans ollte halt nicht so schnell verurteilen oder die Leute abschreiben.\nKlar gibts genug Leute die wahrscheinlich eher als Lern-Resistent einzustufen sind, aber in der großen masse gehen die einfach unter. Calm down, mein bester Tipp dazu.","replies":[]}]},{"poster":"eingew","date":"2016-01-14T23:33:55.717+0000","up_votes":2,"down_votes":0,"body":"Was glücklicherweise nicht so oft auftritt, wie gegen sie zu spielen.","replies":[]}]},{"poster":"legofreak1","date":"2016-01-14T21:20:48.053+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=X Earthshaker X,realm=EUW,application-id=KYnfKGf0,discussion-id=caxvm1iW,comment-id=,timestamp=2016-01-14T21:14:04.037+0000)\n>\n> Hi, mir ist es schon &ouml;fters aufgefallen das manche Leute in ranked weder masteries noch runen haben. Meiner Meinung nach sollte man eine Sperre einrichten sodass man wenigstens Masteries haben muss um ranked spielen zu d&uuml;rfen. Ich meine, wer spielt ranked ohne masteries oder runen? - Anscheinend gibt es ja so Leute.\n\nDie einzige Einschränkung ist, dass man lvl 30 sein muss und das ist gut so. Die Rangliste sorgt dafür, dass jeder dort einsortiert wird, wo er vom Skill her hingehört und mit Spielern auf demselben lvl spielt. Wenn ein Spieler der Ansicht ist, dass er keine Runen und Masteries braucht, dann ist das eben so, wobei er dadurch wahrscheinlich schlechter spielt. Allerdings wird er damit in der Rangliste wahrscheinlich absteigen.","replies":[{"poster":"M4UR1C31234","date":"2016-01-15T08:30:51.525+0000","up_votes":1,"down_votes":0,"body":"*Man muss Level 30 sein und (wenn es nicht geändert wurde) 16 Champions besitzen.\n\nMit Freundlichen Grüßen {{champion:92}} {{champion:92}} {{champion:92}}","replies":[{"poster":"The valiant Hero","date":"2016-01-15T09:02:42.103+0000","up_votes":1,"down_votes":0,"body":"9 für die anderen spieler und 6 banns. Man braucht mindestens 16 Champions für den fall, dass die anderen 15 schon entweder gebannt oder gepickt wurden.","replies":[]}]},{"poster":"XxX Nomad","date":"2016-01-14T23:49:49.833+0000","up_votes":1,"down_votes":0,"body":"jupp, natürliche auslese halt ^^\n\nwas die leute reitet weis ich dennoch nicht","replies":[]}]},{"poster":"Ender Chest","date":"2016-01-14T22:02:06.602+0000","up_votes":2,"down_votes":1,"body":"Kann ja mal passieren. Keine Ahnung in welcher Division du bist, aber als ich noch Silber-Gold war hab ich jedes Mal 10 Sekunden vor dem Start \"Check Runes & Masteries\" geschrieben. Hat paar mal noch einige Spiele gerettet.\n\nIch spiele öfters mit einem Kumpel zusammen, der 1-2 mal pro Woche League spielt. Er vergisst ständig, dass neue Masteries da sind und spielt ständig ohne.","replies":[]},{"poster":"nox5555","date":"2016-01-14T23:52:24.741+0000","up_votes":1,"down_votes":0,"body":"Mir wirft man das ständig vor, dabei spiele ich nur nicht mit flat ap...","replies":[]}]}