{"poster":"Doo ","date":"2016-09-05T19:34:58.423+0000","title":"OP.GG MMR","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Hallo, ich wollte mal nachfragen inwiefern man den Angaben von OP.GG trauen kann. Ich bin momentan Silber3, laut op.gg werde ich &quot;2Divisionen aufsteigen&quot;, da meine MMR wohl um 200 h&ouml;her ist als der Durchschnitt dieser Elo.\nIst es vielleicht auch m&ouml;glich das ich eine Division &uuml;berspringen kann? Ich werde als Silber 3/4 Spieler oft mit hohen Gold- Platin gematcht, im ranked. \n\n\nhttp://www.directupload.net/file/d/4469/5r52j5pg_png.htm","replies":[{"poster":"kuchenbro","date":"2016-09-05T19:43:52.007+0000","up_votes":1,"down_votes":0,"body":"Riot hat irgendwann mal gesagt, dass die OP.GG MMR gar nichts mit der MMR von Riot zu tun hat und dass die MMR (meistens) komplett falsch ist\nDer einzige Weg wie du deine MMR schätzen kannst ist auf die LP zu schauen die du beim SIeg/Niederlage gewinnst/verlierst \n{{sticker:slayer-jinx-wink}} \nUm Divsionen zu überspringen braucht man schon eine extremst gute MMR ( laut meiner Erfahrung reicht +26LP und -14LP nicht um eine Division zu überspringen), wird also sehr unwahrscheinlich Divisionen als Nichtsmurf zu überspringen","replies":[{"poster":"Nycaria","date":"2016-09-05T20:33:06.016+0000","up_votes":1,"down_votes":0,"body":"Meiner Erfahrung nach reichen +26LP aus,allerdings darf man zwischen den Promos wohl kein Game verlieren.","replies":[{"poster":"Julian Chopper","date":"2016-09-05T20:57:49.184+0000","up_votes":1,"down_votes":0,"body":"Ist egal, ob man dazwischen ein Spiel verliert oder nicht.","replies":[]}]},{"poster":"MacDeath","date":"2016-09-05T20:14:08.449+0000","up_votes":1,"down_votes":0,"body":"Da ist meine Erfahrung etwas anders, ich habe diese Season 2 Divisionen übersprungen, 26LP müssten reichen.\nOP.GG ist sicherlich nicht verlässlich aber ich denke es geht oft in die richtige Richtung, zumindest war das bei mir so.\n\nVorallem wenn man nach den placements eine sehr hohe winrate hat kann man auch schnell mal ein paar divisionen überspringen.","replies":[]}]},{"poster":"Julian Chopper","date":"2016-09-05T20:27:03.835+0000","up_votes":1,"down_votes":0,"body":"> Ist es vielleicht auch möglich das ich eine Division überspringen kann?\n\nJa. Wird auch passieren wenn du jetzt bald in die Promo kommst und sie schaffst.","replies":[]}]}