{"poster":"IGS maomaosshots","date":"2015-03-04T09:42:08.311+0000","title":"Rune livello 2, possono valerne la pena?","subforum":"Campioni e gameplay","up_votes":2,"down_votes":0,"body":"Buongiorno =)\r\nSo che può sembrare una domanda stupida, ma mi sono trovato difronte al seguente dilemma: può valere la pena di comprare rune di livello 2 e usarle in combinazione a quelle di livello 3 che ho al momento in attesa di completare queste ultime? (Mi mancano pochi match per raggiungere il livello 30 quindi gli slot ormai li ho tutti a parte l'ultima quintessenza).\r\nQuesto in quanto ho speso molti PI per farmi un set generico o da ADC, ma ormai da tempo gioco per lo più come support. Al momento quindi non ho abbastanza PI per completare un set per il ruolo che voglio fare e stavo comprando le varie rune poche per volte, ma vedendo poi il prezzo di quelle di livello 2 e che le differenze non sono così enormi (magari meglio una runa che mi dia un pò meno di quello che occorre, piuttosto che una di livello 3 che non aiuta) mi chiedevo se non valesse la pena... Alla fine 9 rune lvl 2 con 350 PI te la cavi anziché comprarne una per volta in chissà quanto tempo (alcune di quelle che vorrei prendere stanno a 840 l'una...XD)\r\nChe ne pensate? =)\r\n(Non additatemi subito come nabbo nel caso il ragionamento sia così \"nabbo\" XD)","replies":[{"poster":"Frattaglia","date":"2015-03-04T12:04:28.960+0000","up_votes":3,"down_votes":0,"body":"Prendi direttamente quelle di livello 3, che finirà che delle altre non te ne farai niente :)","replies":[]},{"poster":"Dr LouD","date":"2015-03-04T10:01:55.071+0000","up_votes":3,"down_votes":0,"body":"Risparmi gli ip e compra direttamente quelle di livello 3 se ormai sei vicino al lvl 30 :)","replies":[]},{"poster":"IGS maomaosshots","date":"2015-03-04T13:06:37.715+0000","up_votes":2,"down_votes":0,"body":"Grazie a tutti delle dritte. Spero che potrò permettermi un giorno altre pagine ahaha :P","replies":[]},{"poster":"Zorby","date":"2015-03-04T12:06:55.450+0000","up_votes":2,"down_votes":0,"body":"Risparmia e compra quelle di livello 3.\nTi consiglio di fare 2 pagine generiche, una ad ed una ap.\nSe poi comprerai altre pagine le farai un po' più specifiche (io per esempio ho una ad, una ap, una supp tank, una supp ap ed altre 2 che cambio a seconda dei champ).","replies":[]},{"poster":"Firenheit","date":"2015-03-04T11:13:32.193+0000","up_votes":2,"down_votes":0,"body":"Ti conviene aspettare, le rune di lv1 e 2 non bisogna MAI comprarle! (:","replies":[]},{"poster":"kirchhoff","date":"2015-03-04T18:30:05.800+0000","up_votes":1,"down_votes":0,"body":"No.","replies":[]}]}