{"poster":"Athenes Lulu","date":"2015-01-25T09:32:13.214+0000","title":"[POLL] Does Veigar really need a DFG?","subforum":"Gameplay","up_votes":1,"down_votes":7,"body":"Title.\r\n\r\nForget Ahri, who got buffs because of the DFG removal, even though she doesn't need it. Forget about Lissandra or Annie, who don't necessarily build these all the damn time. We're talking about our tiny master of evil right here.\r\n\r\nLegends have said that once he gets DFG, he reaches midgame so he can start combo'ing people and murdering them. To some, they disregard about even building the DFG on Veigar.\r\n\r\nRito even specifically mentioned that they're gonna \"look into it\" concerning Veigar changes. However, we still don't see any PBE updates concerning that little guy (is that a short joke??). So, why he hasn't gotten any changes yet? Is it because he actually doesn't need it? Is it because Rito does \"favoritism\" towards Ahri and the other ladies (or so we have heard)?\r\n\r\nWhat do you think?","replies":[{"poster":"Terff","date":"2015-01-25T20:20:09.175+0000","up_votes":1,"down_votes":0,"body":"I always forget to use the active so I think he's fine without it.","replies":[]},{"poster":"Gunpoint","date":"2015-01-25T18:38:21.873+0000","up_votes":1,"down_votes":0,"body":"Probably because the reason DFG was removed is because they are tired of people just point and click 1 shotting enemies so they may have a rework in their sights for Veigar himself.","replies":[]},{"poster":"skyfall619","date":"2015-01-25T11:59:23.590+0000","up_votes":1,"down_votes":0,"body":"im surprised rito has said anything about veigar yet they probably have something huge in store.","replies":[{"poster":"TheKingDodo","date":"2015-01-25T18:32:45.324+0000","up_votes":1,"down_votes":0,"body":"\"Is that a short joke?\"","replies":[]}]},{"poster":"Syn Zykan","date":"2015-01-25T11:54:42.300+0000","up_votes":1,"down_votes":0,"body":"It's good for deleting the enemies tank/initiator if you catch him out of position, I would even consider it core if only for the stats it gives. I do however feel if he gets a compensation buff it should be somewhere other than what dfg allowed him to do.\n\nI think if I was in charge I would start with helping his early game defensive stats (leave him about the same as he is currently late game just give him more at the start). It is so easy to punish him and make him miss farm, unlike Nasus. I think people should have to actively try to stop the little bugger from farming rather than throw a stray ability his way and harrass him out of lane because he has no sustain and cant really afford to trade back.","replies":[]},{"poster":"Decrit","date":"2015-01-25T10:34:29.933+0000","up_votes":1,"down_votes":0,"body":"I play him loads of times, however i don' t always pick DFG. I recognize is absurdely OP on him but i pick it only if i need to dispense damage between different targets or an enemy is very tanky. Also i started not picking him and go for a different strategy, i will miss it only for AP ratio and cdr...","replies":[]},{"poster":"Zair Umbras","date":"2015-01-25T09:37:42.102+0000","up_votes":1,"down_votes":0,"body":"I... don't really get a DFG. With just an Arch Angel's, Rabs, and Void, I have 1k AP and can one shot squishies with just the Q and W. On those rare occasions that I catch both their carries, I hit their AP carry with R for a one shot, then the W and Q for the ADC. Pretty easy stuff. Just gotta farm your Q. If they buff him at all, it'd be his mana costs. They're outrageously high, even with his passive and a Tear/Arch Angel's.","replies":[]},{"poster":"Oliver The Fiend","date":"2015-01-25T09:33:23.957+0000","up_votes":1,"down_votes":0,"body":"I never build DFG on Veigar, and I play him all the time.\nOn the rare occasion I do build it I never use it's active, I just get it for the huge AP boost.","replies":[]}]}