{"poster":"MarvelNerd","date":"2015-10-16T13:08:18.781+0000","title":"Im Spiel ständig Verbindungsaufbau, seit mehreren Tagen bitte um Hilfe","subforum":"Hilfe & Support","up_votes":3,"down_votes":2,"body":"Hey Leute ich hoffe ihr k&ouml;nnt mir weiter helfen. Seit &uuml;ber einer Woche jetzt schon hab ich ein gro&szlig;es Problem mit LoL. N&auml;mlich, ich starte ein Spiel und erstmal passt alles aber dann nach ca. 5 minuten kann ich mich einfach nicht bewegen und nichts kaufen etc. dann kommt das Symbol Verbindungsaufbau, dann in der Regel Standbildschirm und dann l&auml;ufts wieder f&uuml;r ca. 5 minuten und dann geht das von vorne los. Habe alles probiert: Neu installiert, client repariert alles :( an meinem internet liegt es auf keinen fall. Bitte um Hilfe","replies":[{"poster":"Schlachtpartie","date":"2015-10-16T13:14:25.470+0000","up_votes":1,"down_votes":0,"body":"Haben ganz viele das Problem momentan, liegt an den Servern","replies":[{"poster":"TryHardlon","date":"2015-10-16T19:06:35.084+0000","up_votes":1,"down_votes":0,"body":"SAME HERE ! und nur bei leuten mit KabelDeutschland soweit ich gelesen hab :( hab nehmlich den selben Fehler !","replies":[{"poster":"bongpow3r","date":"2015-10-17T10:14:40.847+0000","up_votes":2,"down_votes":0,"body":"Hab auch Kabel Deutschland mit den oben genannten Problemen:.....","replies":[]},{"poster":"Schlachtpartie","date":"2015-10-16T19:14:08.711+0000","up_votes":1,"down_votes":0,"body":"Telekom (Austria) auch","replies":[]}]},{"poster":"MarvelNerd","date":"2015-10-17T10:43:33.659+0000","up_votes":1,"down_votes":0,"body":"Hab auch Kabel Deutschland :( das heißt abwarten nehme ich mal na oder :(","replies":[]}]},{"poster":"YTBetterBanJayce","date":"2015-10-16T20:09:20.852+0000","up_votes":2,"down_votes":0,"body":"du wiIIst das weg haben? keine Iust auf Iags und aIIe mögIichen anderen faxen beim zocken? dann is IoI nich das richtige für dich! denn hier werden miIIionen verdient aber gefühIt nichts investiert!","replies":[]},{"poster":"W0RN","date":"2015-10-16T14:07:07.847+0000","up_votes":2,"down_votes":0,"body":"Hab das Problem auch, kann mich einfach nicht bewegen, das Spiel läuft aber normal weiter. Danach steht da Attempting to Reconnect und geht wieder weg, kann mich aber trz nicht bewegen.","replies":[]},{"poster":"legofreak1","date":"2015-10-16T13:42:30.848+0000","up_votes":1,"down_votes":0,"body":"Kannst du bitte ein Tracert erstellen, wenn du im Spiel bist und das Problem in diesem Spiel hast?\n> Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n> Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n> Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\n> https://www.pingplotter.com/download.html\n> 1. Das 'Trace Interval' sollte auf '1 second' eingestellt werden.\n> 2. Die 'Address to Trace' ist in unserem Fall 185.40.65.1\n> 3. trace starten\n> 4. Es wird jetzt jede Sekunde ein tracert durchgeführt. Während Pingplotter im Hintergrund läuft, kann man ein Testspiel in LoL starten um zu testen ob Probleme auftreten oder das Programm besser noch komplett während eines Spiels im Hintergrund laufen lasse.\n> Sollte es Verbindungsprobleme geben, geht es mit Schritt 5 weiter. Gibt es keine Verbindungsprobleme sind die tracerts vermutlich nutzlos.\n> 5. Sollten Verbindungsprobleme aufgetreten sein, müssen die Ergebnisse exportiert werden:\n> Edit > Copy as Text\n> Nach [Pastebin.com](http://pastebin.com/) gehen, das Ergebnis dort einfügen, auf \"submit\" klicken und den Link zum Ergebnis im Forum posten.","replies":[{"poster":"xedosh","date":"2015-10-16T20:23:54.803+0000","up_votes":1,"down_votes":0,"body":"@Legofreak: Ich habe mal ein PingPlot erstellt und es wäre klasse, dein Feedback dazu zu bekommen. Ich habe wie viele hier immer mal wieder PingSpikes von 1-2 Sekunden in denen der Bildschirm wirklich festfriert und ich nichts machen kann. Dann geht der Ping wieder runter auf um 35 ms. Ich hoffe inständig das das Problem alsbald irgendwie behoben werden kann. :( Ich bin wirklich sehr frustriert.\n\nhttp://pastebin.com/Ggjz2DcF","replies":[{"poster":"legofreak1","date":"2015-10-16T21:00:05.115+0000","up_votes":1,"down_votes":0,"body":"Du hast nen Packetloss von 2,5% und teilweise einen Ping von 2,5 Sekunden zu deinem Router. Das ist ne katastrophale Verbindung. Ich nehem an, dass du WLAN verwendest, kannst du es bitte mit einer LAN-Verbindung versuchen?","replies":[{"poster":"xedosh","date":"2015-10-18T19:19:02.081+0000","up_votes":1,"down_votes":0,"body":"Hallo Legofreak, ich wollte mich noch einmal zurückmelden. Ich habe es geschafft ein DLAN einzurichten und das Problem ist wirklich nicht mehr vorhanden. Vielleicht ließt das hier der Ein oder Andere: Es lag tatsächlich am WLAN. - Danke für deine Hilfe Legofreak!","replies":[]},{"poster":"xedosh","date":"2015-10-16T21:11:00.976+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Rückmeldung! Ich werde mal schauen ob ich das morgen umsetzen kann. Da die Phasen in den Stromleitungen komisch gelegt sind, ist Powerlan gerade keine Lösung. Ich melde mich wieder.","replies":[]}]}]},{"poster":"TryHardlon","date":"2015-10-16T19:08:11.122+0000","up_votes":1,"down_votes":0,"body":"Eine frage welche IP muss da hin und wo finde ich die ?","replies":[{"poster":"legofreak1","date":"2015-10-16T19:11:05.719+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TryHardlon,realm=EUW,application-id=7hciEY9w,discussion-id=QPGAoULI,comment-id=00010000,timestamp=2015-10-16T19:08:11.122+0000)\n>\n> Eine frage welche IP muss da hin und wo finde ich die ?\n\nIn meinem Post findest du die:\n> 2. Die 'Address to Trace' ist in unserem Fall 185.40.65.1","replies":[{"poster":"TryHardlon","date":"2015-10-17T10:24:41.250+0000","up_votes":1,"down_votes":0,"body":"also meine standartgateway ip oder welche und wo finde ich die das ist meine frage ? :D","replies":[{"poster":"legofreak1","date":"2015-10-17T10:34:14.949+0000","up_votes":1,"down_votes":0,"body":"Ich versteh grade nicht, was du von mir möchtest bzw wo das Problem liegt. Ich hab dir schon zwei mal die Adresse geschrieben, die du bei Pingplotter verwenden sollst. Wenn das Problem woanders liegt, dann musst du es besser beschreiben oder davon einen Screenshot machen.","replies":[]}]}]}]}]},{"poster":"ooCr4nkoo","date":"2015-10-16T16:51:37.873+0000","up_votes":1,"down_votes":0,"body":"bei mir ist es so ähnlich, nur hab ich kein verbindungsaufbau, sondern einfach nur 130-140 ms. Und wenn ich lol beende und wiederverbinde, dann gehts wieder bi zum nächsten match.","replies":[]}]}