{"poster":"Gekou","date":"2016-08-04T11:29:40.690+0000","title":"Zeitfenster Teamranked?","subforum":"Ligen & gewertete Spiele","up_votes":0,"down_votes":0,"body":"Hallo liebe Community und hallo Riot-Team,\r\n\r\nnach l&auml;ngerer Pause habe ich nun wieder mit ein paar Freunden angefangen Ranked zu spielen und wir haben feststellen m&uuml;ssen dass es jetzt Zeitfenster f&uuml;r Ranked-Teamspiele gibt? \r\n\r\nNun meine eigentliche Frage. Gibts einen besonderen Grund f&uuml;r diese Entscheidung?","replies":[{"poster":"Alustus","date":"2016-08-04T11:34:44.533+0000","up_votes":2,"down_votes":0,"body":"Die DynamicQ ist der Grund.\n\nUm lange Wartezeiten zu vermeiden gibt es das Teamrank nur noch zu Zeiten an denen viele Spieler online sind.\nEin anderer Grund wäre noch die High Elo damit sich Teams nicht mehr so leicht puschen können.","replies":[]},{"poster":"Skagerak","date":"2016-08-04T11:34:20.851+0000","up_votes":2,"down_votes":0,"body":"Riot wollte damit verhindern das Teamranked zu lange Queues hat. Wobei ich das total unnötig finde weil man doch eh selber entscheiden sollte ob man jetzt bock drauf hat und etwas länger wartet oder nicht. Besonders für Diamant find ich das Blöd weil man dann halt nur paar Stunden am Tag Teamranked zocken kann. Für Platin Spieler oder darunter ist das ja eigentlich eh egal weil die ja eh 5pre zocken können.","replies":[]},{"poster":"SFCFlo","date":"2016-08-04T11:32:36.452+0000","up_votes":2,"down_votes":0,"body":"Anfangs zu dieser Season wurde das Teamranked ja komplett deaktiviert.\nNun aber seit ca. einem Monat, glaube ich, hat RIOT erkannt das wir Spieler Teamranked haben wollen und daher wurde es wieder eingeführt jedoch aber mit einem Zeitfenster zu den Zeiten wo am meisten Spieler online sind.","replies":[]},{"poster":"CYPHΕR","date":"2016-08-04T11:32:55.903+0000","up_votes":3,"down_votes":1,"body":"In dem Fall weder danach gegoogelt noch in den News geschaut oder? ;)\n\n[Riot Infos zu den Ranked-Queues](http://euw.leagueoflegends.com/de/news/game-updates/features/5er-gruppen-und-die-dynamische-warteschlange)\n\n[Zeitliche Infos zu 5er-Premade-Ranked](http://euw.leagueoflegends.com/de/news/game-updates/competitive/5er-gruppen-rangliste-kommen-begrenzt-zuruck)","replies":[{"poster":"Gekou","date":"2016-08-04T16:32:08.412+0000","up_votes":1,"down_votes":0,"body":"Ich hatte tatsächlich gegoogelt, aber wie du auch schon aufzeigst geht es dabei um 5v5. Mir ging es eher ums 3v3, denn dazu gibt es keine wirklichen Begründungen. Außerdem gibt's dafür auch keine Dynamic-Queue. \n\nHabe ich aber auch vergessen zu erwähnen :D","replies":[]}]}]}