{"poster":"ViaMalinconiaN9","date":"2016-02-15T20:20:29.935+0000","title":"Rework grafici.","subforum":"Discussioni generali","up_votes":17,"down_votes":4,"body":"\nVolevo sapere pi&ugrave; o meno cosa ne pensate dell&#039;aspetto visivo dei champion e delle ability.\nMi &egrave; venuta in mente questa cosa, prendendo spunto da CommonDotaPlayer, ovviamente questo non &egrave; un post all&#039;altezza di quelli, che ovviamente saranno fatti meglio e accurati nei dettagli, e scritti da qualcuno sicuramente pi&ugrave; esperto di me.\nMa non c&#039;&egrave; nessun divieto o copyright che mi impedisce i fare questo post, quindi, lo faccio =3\nSecondo me:\n##Rework visivi:\n{{champion:103}} **Ahri**\nAhri è bellissima, non ho niente da dire, questo non è un proprio rework, ma un \"Aggiustamento grafico\" il che quello che state per vedere, e al limite del sovrumano anche per Runeterra, un qualcosa di disgustoso, inguardabile:\nQuesta è Ahri:\nhttp://ddragon.leagueoflegends.com/cdn/img/champion/splash/Ahri_0.jpg\nCome sappiamo una volta era un volpe, che poi si trasformò in una umana con con 9 code.\nQueste 9 code, sono posizionate così su Ahri:\nhttp://i.imgur.com/qCJ6nHe.png[/img]\nEbbene si! Ad ogni parte del posteriore corrisponde 1 coda, per esempio \"1 coda al sud della pacca sinistra\" un'altra coda \"a est della pacca destra\" xD\nDiciamolo, è ridicolo, dovrebbero uscire tutti dallo stesso punto.\nTutti diciamo che Ahri è una dei champion più sexy, ma sinceramente non vorrei mai vedergli il didietro xD \n___\n{{champion:53}}  **Blitzcarnk**\nHa una grafica obsoleta, &egrave; giallo, ok, ci sta, ma rispetto alla spalsh art, sembra arruginito e vecchio, costruito con i piedi (ormai con la tecnologia che c&#039;&egrave;: Heimer Bandle city, Viktor Zaun, Jayce Piltover non credo vanno a costruire una macchina cosi, vecchia).\nVedendo alla splash art, sembra un vero e proprio robot bello luccicante.\nSe notiamo gli occhi, non sapremmo mai cosa sono.\nIl materiale con cui &egrave; stato costruito? (mistero).\nSempre rispetto alla splash art, &egrave; davvero, ma davvero poco dettagliato in game.\nRagazzi, pensate che questo sia blitzcrank?\nhttp://ddragon.leagueoflegends.com/cdn/img/champion/splash/Blitzcrank_0.jpg\nNo, questo &egrave; Blitzcrank:\nhttp://i.imgur.com/uDe1o8M.png[/img]\n___\n{{champion:90}} **Malzahar**\nIniziamo con gli errori tra la spalsh art &egrave; il modello in game:\n##Guanti\n**Splash Art:** Sono dei semplici guanti viola (in pelle?) con qualche scritta in celeste brillante in verticale\n**In game:** Una mano blu con un cerchio celeste al centro. KAPPA. poi un cono di metallo con delle strisce celeste brillante in direzioni casuali(?)\nhttp://i.imgur.com/BVLYwNF.png[/img]\n\n##Scarpe\n**Splash Art:** Scarpe viola/porpora in (stoffa/pelle, non importa) semplici, tipo come quelli medioevali, con varie X una sotto l&#039;altra, che rappresentano i &quot;lacci&quot;\n**In game:** Piede ricoperto di uno strano materiale fucsian, che lo fa sembrare gommoso, in punta e il collo in metallo.\nhttp://i.imgur.com/ngWxTze.png[/img]\n\n##Pugnale\n**Splash Art:** &egrave; un pugnale con un manico di vetro/cristallo che contiene/brilla un/di un potere magico celeste, in custodia in una fodera color porpora con dei &quot;venamenti&quot; arancioni, probabilmente sar&agrave; fatto con qualche materiale, un qualche pietra del Void o di Runeterra.\n**In game:** Una sciabola con il manico di ferro e un osso a caso, rinchiusa in una fodera di ferro con decorazioni di oro(?) poco luccicante.\nhttp://i.imgur.com/Y2noqZW.png[/img]\n\n##Colori &amp; Corpo/Viso\n**Splash Art:** Sciarpa, cappuccio e la banda d&#039;avanti alla bocca, di color viola, una maglietta a mezze maniche stracciate in viola scuro, con una striscia, enorme viola d&#039;avanti al petto che parte dalla sciarpa e scende fino dentro ai pantaloni, dove sopra ai pantaloni di colore viola scuro c&#039;&egrave; uno &quot;straccio&quot; avvolto intorno alla vite di colore porpora, il tutto con molti marchi e scritte che brillano di celeste.\nHa dei bellissimi occhi (a mandorla molto aperti) che gli brillano di celeste, con dei capelli castani scuri medi che gli cadono leggermente d&#039;avanti - nel lato de viso.\n**In game:** Sciarpa, cappuccio e la benda d&#039;avanti alla bocca, colore fucsian, facendo sembrare il tutto gommoso e non come un tessuto con scritte e marchi celesti, che sembrano gli scarabocchi di un bimbo, lui, in game, non ha una maglietta a mezze maniche stracciate di color viola scuro, ma bens&igrave; una giacca che non si pu&ograve; chiudere color BLU, dove fuori escono delle maniche fucsian stracciate... KAPPA. Ha il busto tutto scoperto, al contrario nella splash art, che &egrave; completamente coperto, come se si volesse evitare proprio di far vedere tutto il busto, ma in game fanno le cose al contrario ;) \nHa una sciarpa attorno alla vite, sempre color fucsian, e pantaloni bizzarri.\nDa notare che Malzahar dovrebbe essere un uomo bello robusto e forte, da come si pu&ograve; notare dalle maniche stracciate e i suoi bracci nella splash art, ma in game lo hanno fatto sembrare un ragazzino abbastanza fringuellino.\nIl suo viso sembra un pezzo di legno con due pallini celesti infilzati al suo interno.\nhttp://i.imgur.com/pcGSYPB.png[/img]\n\nQuesto non &egrave; Malzahar:\nhttp://ddragon.leagueoflegends.com/cdn/img/champion/splash/Malzahar_0.jpg\n\nMa &egrave; bens&igrave;, lui:\nhttp://i.imgur.com/ddJI4n9.png[/img]\n\nBeh spero che con l&#039;aggiornamento su di lui che uscir&agrave;, lo aggiusteranno un po da questo punto di vista.\n___\n{{champion:44}} Taric\n\nInutile spiegarlo, tanto a breve verr&agrave; reworkato, sia visivamente che nel gameplay ;)\n___\n\n##Aggiornamenti visivi\n\nQuesti sono i champion che hanno assolutamente bisogno di un aggiornamento visivo:\n{{champion:22}} Solo io noto che &egrave; troppo, troppo scura?\n{{champion:42}} Sopratutto il suo mezzo.\n{{champion:11}} Stile obsoleto, specialmente gli occhiali.\n{{champion:56}} E&#039; perfetto se non per quella sua coda di ombra, che fa leggermente cagare.\n{{champion:20}} Un po tutto, lo stile &egrave; obsoleto ormai.\n{{champion:134}} Stile obsoleto, sembra sporco e non tutto coincide bene con la splash art.\n{{champion:77}} Stile sempre un po obsoleto/bizzarro/strambo.\n{{champion:6}} Va beh, sinceramente &egrave; un champion brutto, anche con una aggiustatina sar&agrave; sempre brutto.\n{{champion:110}} Si deve assolutamente aggiustare, quello che lo ricopre per tutta la parte inferiore e le mani, sembra del catrame viola/rosso mattone, con pezzi a forma sferica incastrati dentro a questo strano materiale che quasi sembrano dei brufoli viola che stanno per esplodere, poi ha uno stile sempre obsoleto come gli altri, e i capelli sono da aggiustare.\n{{champion:101}} E&#039; un champion complesso da fare il modello in game, infatti &egrave; fatto un po maluccio, un bell&#039;aggiornamento gli sarebbe.. non utile, ma.. BELLO xD\n___\n##Aggiornamenti visivi delle abilit&agrave;\n{{champion:131}} Un qualcosa di pi&ugrave; liscio e pulito, non gli farebbe male.\n{{champion:28}} Tralasciando che non si sa che &quot;potere&quot;/cosa usa per attaccare, credo che un aggiornamento e un chiarimento su ci&ograve;, gli farebbe bene.\n{{champion:81}} Skill obsolete.\n{{champion:85}} Troppo obsoleto, so che l&#039;effetto dei fulmini &egrave; difficile da fare.\n{{champion:7}} Non so cosa sono le sue abilit&agrave;, aggiornatele e rendetele pi&ugrave; chiare.\n{{champion:68}} Obsoleto.\n{{champion:134}} Obsoleto, non sembra stia usando il potere dell&#039;oscurit&agrave;, le abilit&agrave; sono leggermente state trascurate sopratutto la E. Rispetto alle altre (giustiziera e atlantidea) non sono chiare e pulite le abilit&agrave;, Atlantidea sono proprio belle le skill, si capisce che &egrave; acqua, stessa cosa giustiziera, si capisce che &egrave; luce, invece la classica.. boh, non so.\n{{champion:110}} Dategli prima una personalit&agrave;, aggiustatelo visivamente, fateci capire cosa &egrave;, che potere usa, cosa lancia e poi aggiustategli quelle abilit&agrave;. (che diamine &egrave; quella freeccia? quei marchi? la roba a terra? O.O)\n{{champion:45}} Troppo obsoleto, come al solito.\n\n**Se vi piace questo post e pensate possa essere utile, possa cambiare qualcosa, che viene notato da un Rioter e che alle community piace, qualcuno se ne ha voglia lo traduca in inglese cosi da pubblicarlo sia sul NA che sul board english.**\n\n*Mi scuso per eventuali errori grammaticali/battitura*","replies":[{"poster":"Dave Du Couteau","date":"2016-02-17T09:52:38.017+0000","up_votes":2,"down_votes":0,"body":"Bellissimo post, eccetto per una cosa (almeno io non l'ho vista) \nE Pantheon? :D con quei piedoni n° 67?","replies":[]},{"poster":"Dante Hellfire","date":"2016-02-15T21:02:11.849+0000","up_votes":2,"down_votes":0,"body":"Io sono d'accordo con le osservazioni dettagliate che hai effettuato su Blitz e Malzahar. Lì hai dimostrato la cosa in modo impeccabile e ti supporto per quella parte lì.. Per fare una cosa fatta bene dovresti analizzare anche gli altri champ da te citati in quella maniera per rendere la cosa più chiara.","replies":[{"poster":"ViaMalinconiaN9","date":"2016-02-15T23:46:45.527+0000","up_votes":2,"down_votes":0,"body":"Ho dimenticato ahri, ti domanderai: \"perché?\"\nLo scoprirai domani","replies":[]}]},{"poster":"Aegis Winebeard","date":"2016-02-16T11:45:30.304+0000","up_votes":3,"down_votes":1,"body":"Una sa cosa: i modelli di lolking sono molto meno dettagliati di quelli in game, personalmente è sbagliato prenderli come esempio.","replies":[]},{"poster":"Nibbio Bianco","date":"2016-02-15T20:34:57.543+0000","up_votes":7,"down_votes":7,"body":"Obsoleto di qua. Obsoleto di là. \n\nMa a che gioco stai giocando? Prato fiorito?","replies":[{"poster":"ViaMalinconiaN9","date":"2016-02-15T20:55:39.271+0000","up_votes":5,"down_votes":3,"body":"Invece di scrivere queste cose inutile commenta in questo modo:\nCosa ne pensi di Blitzcrank?\nCosa ne pensi di Malzahar e di quello che ho scritto?\n\nNon andare a leggere solo gli aggiornamenti visivi e quelli alle abilità <.<\nSe vengono aggiornati è perché sono obsoleti, e anche tanto se ogni tanto ho scritto qualcosa, non c'e ne era proprio bisogno.\nI piccoli aggiornamenti visivi come quelli per Morgana, Alistar perché vengono fatti? semplicemente perché erano obsoleti, vecchi e quindi fatti male, non c'è bisogno di spiegare i motivi su cosa va e non va come ho fatto per i rework, che guarda caso non sono un aggiornamento visivo. \nQuando su Surr@20 notiamo un aggiornamento visivo, nessuno si chiede perché o che cosa sta combinando la Riot, egli non spiega neanche il motivo, è obsoleto. Punto. E' lo stesso termine che la Riot stessa usa.\nDi la verità, non hai letto tutto e ti sei offeso perché ho insultato Urogot ù.ù","replies":[{"poster":"Nibbio Bianco","date":"2016-02-15T21:20:05.250+0000","up_votes":5,"down_votes":3,"body":"> [{quoted}](name=AnjoCaìdo,realm=EUW,application-id=MJVj50Jw,discussion-id=4o0aR0qk,comment-id=00010000,timestamp=2016-02-15T20:55:39.271+0000)\n> Di la verità, non hai letto tutto e ti sei offeso perché ho insultato Urogot ù.ù\n\nOvvio! :D","replies":[]}]}]},{"poster":"ubercodlegend200","date":"2016-02-15T21:43:51.330+0000","up_votes":1,"down_votes":3,"body":"{{champion:84}} il gameplay fà schifo in corsia è ingiocabile è un punta e clicca con un aoe \n{{champion:81}} è più legnoso di fiddle nei movimenti (ma tanto sappiamo che la riot non lo reworkerà per la suprema come udyr)\n{{champion:82}}  non penso ci sia da discuterne troppo\n{{champion:107}} rengo lo metto non per l' estetica me per il gameplay salta e sotta è divertente giocarlo non giocarci contro\n{{champion:45}} uno dei miei champ preferiti ma è la copia brutta del mago di ff\n{{champion:19}} questo champ grida pietà a livello visivo\n\nah dimenticavo {{champion:80}} quei piedi sono inguardabili","replies":[{"poster":"ViaMalinconiaN9","date":"2016-02-15T23:51:59.228+0000","up_votes":1,"down_votes":0,"body":"Va beh, questo era un post sul visivo, non sul gameplay :\\\nQuindi ti rispondo sull'aspetto:\nAkali: è perfetta.\nEzreal: Non ne ha bisogno di aggiornamenti visivi rispetto ad altri champ che ora come ora fanno piangere sangue.\nMordekaiser: È okey.\nRengar: idem Morde\nVeigar: purtroppo è il concept assolutamente sbagliato per uno yordle.\nWarwick: È già stato reworkato visivamente, anche le skin e sinceramente a livello d'estetica, ora sta bene, il problema sono i suoi movimenti che lo fanno semvrare un pupazzetto, cioè, hai visto l'aa? xD","replies":[{"poster":"Whommy","date":"2016-02-16T10:31:37.003+0000","up_votes":2,"down_votes":1,"body":"> Ezreal: Non ne ha bisogno di aggiornamenti visivi rispetto ad altri champ che ora come ora fanno piangere sangue.\n\nGuarda Pulsfire Ez.... poi rileggi la frase\n\n> Mordekaiser: È okey.\n\nè un champ rimasto identico visivamente dal primo concept, per quanto ami il metal è esteticamente inguardabile e sproporzionato\n\n> Warwick: È già stato reworkato visivamente, anche le skin e sinceramente a livello d'estetica, ora sta bene, il problema sono i suoi movimenti che lo fanno semvrare un pupazzetto, cioè, hai visto l'aa? xD\n\nSono stati fatti solo fix ai colori per l'aggiornamento della landa la season scorsa, vale lo stesso discorso di mordekaiser","replies":[{"poster":"ViaMalinconiaN9","date":"2016-02-16T17:26:37.573+0000","up_votes":1,"down_votes":0,"body":">Guarda Pulsfire Ez.... poi rileggi la frase \n\nParlo delle skin base, Ez ne ha bisogno di un aggiornamento, certo, ma sinceramente no come altri (alla skin base)\n\n>è un champ rimasto identico visivamente dal primo concept, per quanto ami il metal è esteticamente inguardabile e sproporzionato\n\nParlo di estetica nel gioco, non parlo del concept! Anche Urgot è orrendo a livello di concept, ma in game è fatto bene, pur essendo brutto, è la stessa cosa per morekaiser, per me è guardabile (a me non piace il suo concept)\n\n>Sono stati fatti solo fix ai colori per l'aggiornamento della landa la season scorsa, vale lo stesso discorso di mordekaiser\n\nSi, ma sinceramente, per il momento è okey rispetto ad altri.","replies":[]}]}]}]},{"poster":"Vileblood Pyke","date":"2016-02-15T21:33:41.135+0000","up_votes":2,"down_votes":1,"body":"Stavo pensando che Corki andrebbe aggiornato per renderlo più simile agli altri yordle.\nEvelynn invece dovrebbe ricevere un upgrade completo, ma vabbé...\n\nCredo basti avere un po' di pazienza e tutti i campioni più o meno bisognosi saranno aggiornati.","replies":[{"poster":"ubercodlegend200","date":"2016-02-15T22:50:36.386+0000","up_votes":1,"down_votes":0,"body":"corky, teemo, anche rumble e lulu sarebbero tutti e 3 da rimettere un po' in rigah rigurado l' estetica per essere adattati agli altri yordle","replies":[{"poster":"Vileblood Pyke","date":"2016-02-16T14:53:56.667+0000","up_votes":1,"down_votes":0,"body":"Teemo, Rumble e Lulu sono già abbastanza simili agli altri yordle. Corki invece è rimasto un Megling.","replies":[{"poster":"ubercodlegend200","date":"2016-02-16T17:04:29.256+0000","up_votes":1,"down_votes":0,"body":"teemo mi sembra un po' piccolo e troppo un criceto, rumble mi ricorda fin troppo un pesce e lulu mi dà l' impressione di essere una specie di beta di quelle che sono ora tristana e poppy  un misto tra vecchio e nuovo stile che gli dà un aria abbastanza sproporzionata","replies":[]}]}]}]},{"poster":"LunSeiSleidee","date":"2016-02-17T16:26:27.043+0000","up_votes":1,"down_votes":0,"body":"Malzhar ha bisogno di un rework grafico completo, proprio da zero, al livello di Sion.\nVeigar fa schifo, ma non avrà un rework tanto presto perché la sua skin \"Boss Finale\" è bellissima. QUELLA skin è Veigar, tutto il resto non esiste. Un po' come per Udyr insomma.\nAhri mi sta tanto sulle palle quindi se anche la reworkano in un pixel rotolante mi sta benone.","replies":[]},{"poster":"Axelney","date":"2016-02-16T18:28:27.900+0000","up_votes":1,"down_votes":0,"body":"devi considerare che league of legends esiste da 6 anni e che molti modelli si riferisconoa  spalsh art più vecchie che poi sono state aggiornate. ma ovviamente rifare il modello è più complesso del rifarte una splash art. anche se negli ultimi nani hanno aggiornato tutto quindi sicuramente arriverà uil momento dei modelli più vecchi.","replies":[]},{"poster":"Artorikus","date":"2016-02-16T11:31:15.504+0000","up_votes":1,"down_votes":0,"body":"Buona discussione.","replies":[]},{"poster":"Jet Rocket","date":"2016-02-16T00:24:17.065+0000","up_votes":1,"down_votes":0,"body":"Lol l'autoattacco di warwick : manata, manata, manata, manata, manata, alla velocità della luce.\n\nCmq non so a voi ma a me ha fatto troppo ridere vedere i dettagli di malzahar o come si chiama paragonati all'immagine.","replies":[]},{"poster":"Jet Rocket","date":"2016-02-15T20:59:20.962+0000","up_votes":1,"down_votes":2,"body":"Tarik, Kennen, e quelle pinne al posto dei piedi di blitzcrank","replies":[{"poster":"ViaMalinconiaN9","date":"2016-02-15T21:09:08.796+0000","up_votes":1,"down_votes":0,"body":"Taric verrà aggiornato a breve.\nKennen è già stata aggiornata graficamente e ora è stupenda, le abilità non sono granché (i fulmini)\nBlitzcrank, concordo :P","replies":[{"poster":" Sborrachiodi","date":"2016-02-15T23:31:58.702+0000","up_votes":1,"down_votes":0,"body":"No aspetta... Kennen è femmina ??? :O","replies":[{"poster":"ViaMalinconiaN9","date":"2016-02-15T23:44:42.448+0000","up_votes":1,"down_votes":0,"body":"Giusto.. Quel coso.. Quanto lo odio, sembra femmina.","replies":[]}]}]}]},{"poster":"Dante Hellfire","date":"2016-02-15T20:28:45.763+0000","up_votes":1,"down_votes":0,"body":"Yi ha subito un aggiornamento non molto tempo fa. Un rework grafico fantastico che lo hanno reso il bel campione che è ora (a livello estetico) . . Su alcune cose non concordo, usi la parola obsoleto un po' per tutto senza rendere chiaro quello che vuoi dire. /:","replies":[{"poster":"ViaMalinconiaN9","date":"2016-02-15T20:47:28.832+0000","up_votes":1,"down_votes":0,"body":"Obsoleto sta per uno stile \"vecchio\" la Riot sta facendo un ottimo lavoro e i champion obsoleti li ha già aggiornati:\ntipo, ricordi gli aggiornamenti/rework visivi di:\n{{champion:12}} \n{{champion:22}} \n{{champion:1}} \n{{champion:31}} \n{{champion:81}} \n{{champion:9}} \n{{champion:114}} \n{{champion:86}} \n{{champion:43}} \n{{champion:38}} \n{{champion:55}} \n{{champion:96}} \nE posso continuare all'infinito, dagli aggiornamenti visivi completi a quelli solo per ripulire un po.\n\nCon obsoleto intendo:\nhttp://news.cdn.leagueoflegends.com/public/images/articles/2014/november_2014/CHAMPUP/SorakaNid_thumb.png\nLa vedi la vecchia nidalee? quello una volta era un modello fighissimo, quasi perfetto in qui tempi, ma nei tempi di oggi, quello è diventato uno stile obsoleto, vecchio ;)\nIdem per la Landa.\nIdem per le splash art:\nNew vs Old splash art of Nidalee:\nhttp://i.imgur.com/jUjxD.jpg\nPerché lo aggiornano? perché una volta andava bene, era il top, ma ora con la nuova tecnologia possiamo fare una grafica bellissima rispetto a una volta\n\nIdem per le skill:\nLe skill di morgana vennero aggiornate perché erano troppo brutte, non andavano più bene, vecchie, il tutto si racchiude in una parola: Obsoleto, superato, passato quel periodo vecchio. è l'ora di aggiornare!!\n\nAnche morgana fu aggiornata leggermente visivamente, insieme ad essa anche la splash art.","replies":[]}]}]}