{"poster":"ViaMalinconiaN9","date":"2015-07-21T14:47:55.239+0000","title":"Diana Jungle?","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Volevo sapere se Diana jungle va bene, cio&egrave; &egrave; forte? pulisce abbastanza veloce i campi dei mostri??\r\nO meglio Mid?\r\nInsomma, illuminatemi con tutto quello che sapete su Diana!","replies":[{"poster":"Dr LouD","date":"2015-07-21T14:55:59.259+0000","up_votes":3,"down_votes":0,"body":"Ovviamente Mid è meglio, ma anche Jungle worka benissimo.\n\nVa buildata esattamente come in mid con smite.\nL'unica pecca è che nei gank diventa utile solo una volta arrivata al 6","replies":[{"poster":"ViaMalinconiaN9","date":"2015-07-21T15:10:17.122+0000","up_votes":1,"down_votes":0,"body":"Appena arrivo a 6300 la compro e vediamo ;)","replies":[]}]},{"poster":"Fappelion Dong","date":"2015-07-21T17:20:31.293+0000","up_votes":2,"down_votes":0,"body":"Mettiamola così: il {{item:3708}} è stato reworkato apposta per permettere a lei e {{champion:60}}  di non sembrare delle mongole perchè sulle schede hanno scritto jungler","replies":[{"poster":"SickAnto","date":"2015-07-21T17:30:28.054+0000","up_votes":1,"down_votes":0,"body":"Diana andava bene jungler anche prima del rework dell'item jungle, ovviamente ora è meglio.","replies":[]}]},{"poster":"Lord Valotz","date":"2015-07-21T16:20:22.142+0000","up_votes":1,"down_votes":0,"body":"è l'ap più veloce a pulire i campi e ti fai tutto il giro di jungla senza bisogno di recall, il problema di DIana è che pre 6 non puoi dare una particolare presenza alle tue lane, quindi devi sperare che non perdano male, inoltre quando ganki devi aspettare di avere la certezza di colpire con la Q, altrimenti perdi la metà dei danni che puoi fare dato che non puoi riattivare la R. Quindi se la cava discretamente però non è la scelta ideale per ogni occasione.","replies":[]},{"poster":"Heavenly Yasha","date":"2015-07-21T16:11:27.938+0000","up_votes":1,"down_votes":0,"body":"Meglio mid senza ombra di dubbio.\nPerò è anche utilizzabile in giungla, ma c'è decisamente di meglio. Il clear comunque è buono ma praticamente può solo farmare fino al 6 prima di poter fare qualcosa.","replies":[]}]}