{"poster":"ViaMalinconiaN9","date":"2015-03-07T01:05:34.416+0000","title":"Perché ho avuto la limitazione chat??","subforum":"Discussioni generali","up_votes":2,"down_votes":5,"body":"Raga davvero non capisco...\r\nIo credevo davvero nella riot, che il sistema dei report fosse vero e utile, ma a quanto pare si basano solo su report falsi, in quanto ho giocato con i giocatori i livello basso con mio cugino per impararlo a giocare, e i nemici e gli amici mi reportano, perché non voglio arrendermi e perché mi feddo, ma che ci posso fa io??\r\nIo sono un giocatore attivo, appassionato di questo gioco e seguo molto il forum! non sono un tipo che va afk oppure flamma oppure fedda, ma a parte ciò , non capisco... ù.ù\r\n\r\nAllora potrei iniziare anche io a reportare per qualsiasi minimo dettaglio, reporterò per ogni cosa, tanto non avvengono mai quasi controlli per vedere se il report è vero o no, se no non mi avrebbero messo la limitazione chat..\r\n\r\nMi spiegate cos'è sta limitazione chat? \r\n\r\nRiot, mi avete veramente, ma veramente deluso.. sono senza parole.. o cambiate il sistema report o continuiamo a fare gli scemi con sti report alla caz**, falsi, e senza controlli.\r\n{{champion:32}}","replies":[{"poster":"Ucr0niA","date":"2015-03-07T08:56:56.699+0000","up_votes":7,"down_votes":0,"body":"Scusate la cosa un pò off topic ma\n\n> [{quoted}](name=xXDarkxXxAngelxx,realm=EUW,application-id=MJVj50Jw,discussion-id=nz0Q31c0,comment-id=,timestamp=2015-03-07T01:05:34.416+0000)\n>\n>  con mio cugino per impararlo a giocare\n\nTantissimo ho sofferto, consolando l'italiano.","replies":[{"poster":"ViaMalinconiaN9","date":"2015-03-07T12:01:29.230+0000","up_votes":1,"down_votes":1,"body":"Va beh dai.. sai che scrivo molti thread sul forum, e senza errori di ortografie e punteggiatura, sbagliare è umano, scusatemi se siete miss perfettina/o.\nVeramente mi sembrate gente piccola, che lo fa per mettere in ridicolo gli altri , io non lo modifico neanche per aggiustarlo, perché a me non interessa.\n\nVa beh UcroniA ricorda che stai dietro un desktop...","replies":[{"poster":"Ucr0niA","date":"2015-03-07T13:48:57.373+0000","up_votes":2,"down_votes":0,"body":"Ma questa risposta da tipo giusto?\n\n> [{quoted}](name=xXDarkxXxAngelxx,realm=EUW,application-id=MJVj50Jw,discussion-id=nz0Q31c0,comment-id=00020000,timestamp=2015-03-07T12:01:29.230+0000)\n>\n> Va beh UcroniA ricorda che stai dietro un desktop...\n\nHo scherzato, vuoi sclerare duro?","replies":[{"poster":"ViaMalinconiaN9","date":"2015-03-07T18:26:03.245+0000","up_votes":1,"down_votes":2,"body":"beh fallo notare che scherzi ","replies":[]}]}]}]},{"poster":"Menfrix","date":"2015-03-07T07:56:29.492+0000","up_votes":1,"down_votes":0,"body":"Non è che per caso, forte della tua superiorità di livello a fine game scrivi Gg easy o ez o izi, il sistema non è poi troppo stupido ;)","replies":[]},{"poster":"Onecesco","date":"2015-03-07T13:09:08.388+0000","up_votes":1,"down_votes":1,"body":"Io ho più volte ricevuto degli avvisi per il fatto che \"non mi stavo comportando in linea con le linee guida\" anche se non avevo mai aperto bocca o altro, semplicemente in questo gioco basta che 3 alleati o avversari premade si mettano d'accordo per reportarti e sei fregato ^^.","replies":[{"poster":"ViaMalinconiaN9","date":"2015-03-07T18:26:31.077+0000","up_votes":1,"down_votes":1,"body":"quello che mi è successo xD","replies":[]}]},{"poster":"Ediwir","date":"2015-03-07T04:01:17.931+0000","up_votes":2,"down_votes":2,"body":"I controlli avvengono su tutti, in maniera automatizzata.\nL'algoritmo oramai è abbastanza accurato da aver sostituito per intero la parte manuale, ora si verifica a mano solo in casi di dubbio e durante i controlli a campione per assicurarsi che non ci siano errori.\nIl tasso di accuratezza corrente è \"non calcolabile\", o \"superiore al 99.9%\". Ovvero, non c'è nessuna discrepanza tra i controlli a mano e il risultato dell'algoritmo (ma \"100%\" non si usa: il fatto che su poche migliaia di verifiche non vengano rilevati errori, non significa che non siano possibili nei grandi numeri).\n\nIn altre parole, lamentare la \"mancanza di controlli\" è una carta che non vince. I controlli funzionano meglio ora di quando si faceva tutto a mano ;)\n\nps. No, non so esattamente \"per cosa\" hai ricevuto la tua restrizione. E no, difficilmente qualcuno al supporto si prenderà la briga di chiedere a uno del PlayerBehaviour di prendersi mezz'ora per leggere i tuoi log se non c'è una situazione di dubbio sul tuo caso. So che evidentemente un motivo c'è, e per ora mi basta.\n\npps. Indizio&consiglio: se inizi a spammare report o a reportare senza motivo, dopo un po' i tuoi report verranno ignorati a prescindere...","replies":[{"poster":"ViaMalinconiaN9","date":"2015-03-07T11:58:00.386+0000","up_votes":2,"down_votes":2,"body":"va beh, io credo che ho avuto la limitazione chat, perché giocando con mio cugino con i livelli bassi (io non ho assolutamente parlato, neanche gg easy(perché abbiamo perso ^^), l'unica cosa che ho fatto è non arrendermi, perché le sorti di un gioco possono cambiare, ma... visto che i 3 amichetti volevano arrendersi e spammavano report su flame,  a fine partita tutti e 3 mi hanno reportato, perché erano amici.. ovvio) \nIo credo che il supporto, vedendo 3 report abbia deciso di non controllare la chat, se no avrebbe capito che doveva mettere la chat limitazione, a quei 2 (uno non parlava proprio).\n\nIo d'ora in poi sostengo che il supporto controlli le chat, ma avvolte (come nel mio caso) non controlli le chat(tanto pensano: vabbe.. ha avuto 3 report inutile controllare) \nSarei molto felice, se (uno di quelli che si occupa di controllare la chat) mi farebbe vedere la chat, oppure mi dicesse cosa ha letto per mettermi questa limitazione chat :).\n\nSpero che questo mio post ci sia un'altra risposta.","replies":[]}]}]}