{"poster":"TheLeperMessiah","date":"2016-12-28T11:44:28.844+0000","title":"I don't know what to do anymore in Solo Queue. I need people I can DUO with or heaven forbid a team","subforum":"Team Recruitment","embed":{"description":"Every game is a story; visit the new League of Legends match history to check out how this one ends and share your own!","url":"http://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/159004494/201021950?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":0,"body":"I&#039;ve played League of Legends for a few years now and have played roughly 1500 games (I think) with not a lot in ranked.\r\n\r\nI think I placed in B1 when I played in my first ranked games two seasons ago with 4 wins out of 10 in my promos. It was a long and steady descent into madness once I got into ranked though so I figured I had a lot to learn and I would most likely be middle of the pack maybe S3 with practice so I went back to norms worked out my Runes, Masteries, Skill and Item progression and have accumulated quite a number of other champs I have been able to play relatively well with and not all supports which surprised me.\r\n\r\nGot to pre-season 7 and thought hell lets give this a go again.\r\n\r\nWon 5 out of 10 in promos. Played some bad games and played some great games. Thought that a 50% win rate was ok as a starting point.\r\n\r\nGot placed in Bronze 5. Yes, I understand that this happens in pre-season and all player get a lower rank and especially so if they did poorly in previous seasons, but I am at a loss as to what to do now.\r\n\r\nBronze 5 is for the worst players. You know the feeders, the AFK&#039;ers, the ones that don&#039;t understand the game. I went from playing in my promos where I was playing (I thought quite well in quite challenging games at times) and thought that had something to do with my ability as a middle of the road player. In my first two games as a Bronze 5 I&#039;ve had games like this;\r\n\r\nhttp://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/159004494/201021950?tab=overview\r\n\r\nThen this;\r\n\r\nhttp://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/159180723/201021950\r\n\r\nHell I was the MVP in a game playing as a support with the most kills, most assists, most wards placed, most damage to champs and a decent cs count, but could not win the game because my team mates were potatoes.\r\n\r\nLook I get it I could get good and stop being a noob, but let&#039;s face reality here I am not a Diamond smurf and not even a gold player I just want to play with a few people who get the concept that walking up to an Annie that is clearly shitting on you means stop buying AD items and buy something with some magic resistance because you are clearly not going to carry this game with your pro skills.\r\n\r\nI have carried games by warding great spots and managing my lanes with Zz&#039; Rot portals so we can defend multiple lanes, I have gained pentakills as a bard playing in Jungle by playing strategically. Saved losing team fights by chain stunning enemies chasing down team mates with tiny slivers of health and have learned that if I get kills as bard I can still snowball a game by being a tanky nuisance that can hold towers and save team mates instead of being blown up in two hits.\r\n\r\nI don&#039;t care if I am a silver player who will have to rise to the challenge simply to climb from the depths of Bronze I just don&#039;t want to play with the people who need to go back to the drawing board just to learn basics like what letting your health bar go down is going to lead to you being in fountain more than on the Feilds of Justice.\r\n\r\nI don&#039;t care if you are ranked in Bronze I just want to play some ranked with some belief that at least one other member of my team isn&#039;t just going to throw in the towel after the enemies get 2 kills","replies":[{"poster":"DTreats","date":"2017-01-08T14:30:26.840+0000","up_votes":2,"down_votes":0,"body":"I'll be keen to duo, with an experience of about 1000 games mixed with ranked and non ranked. This is a new account but i'm serious about climbing elo this season.","replies":[]},{"poster":"Elitehippo","date":"2017-01-06T10:38:12.833+0000","up_votes":2,"down_votes":0,"body":"Hey :)\n\nI recently came back to league and dropped from silver 1 to bronze 1, if you need someone to duo with i'd love to play with someone chilld (I'm an adc btw)\n\nAdd me!","replies":[]},{"poster":"Spidicus","date":"2016-12-29T05:41:23.184+0000","up_votes":2,"down_votes":0,"body":"That's a well written post. Based on that alone I'd like to duo with you.\n\nOne point you will need to realize is that Bronze 5 is for the worst of the worst, so being a support is a testing thing because your ADC is going to be a potato 9 times out of 10. When you end up vs a 18/1 twitch like you did in one of the games you linked, you should add the twitch as a friend and ask them if they want to duo.","replies":[]}]}