{"poster":"Paelmchen","date":"2017-04-23T09:32:27.053+0000","title":"Bestrafung mit Punktabzug bei Remake","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":8,"body":"Wieso zu H&ouml;lle werde ich bestraft wenn mein Buddy durch ein Pc Problem nicht ins Spiel kommt und wir da durch Remaken m&uuml;ssen. Soll das nen schlechter Witz sein was kann ich f&uuml;r einen anderen Spieler auch wenn wir das Spiel zusammen Gestartet haben. Sollte mal &uuml;ber dacht und &uuml;berarbeitet werden.","replies":[{"poster":"XenesisCH","date":"2017-04-23T09:35:22.814+0000","up_votes":3,"down_votes":0,"body":"Das ist eine Sicherheitsfunktion, dass man als Premades die Remakefunktion nicht missbrauchen kann ;-).","replies":[]},{"poster":"Paelmchen","date":"2017-04-23T09:38:40.168+0000","up_votes":1,"down_votes":9,"body":"Das ist schön nur wenn man wie in der letzten Zeit leider vermehrten auftreten, das man in der Warteschlange hängen bleiben kann und somit nicht spielen kann oder im Lade Bildschirm. Da ist Sicherheit hin oder her sowas Sinkt hart. Vor allem wenn echte Leaver, Feeder und Flamer nicht bestraft werden aber solche Probleme.","replies":[{"poster":"Snowgen","date":"2017-04-23T11:17:45.711+0000","up_votes":3,"down_votes":0,"body":"Dann sollte er mal das Spiel fixxen und nicht sinnlos weiter zocken. Wäre es ein globales Problem , hätte Riot schon was dazu gesagt. \n\nUnd ausserdem werden echte Leaver und Flamer gebannt , mach dir da mal keine Sorgen drum.\nBei Feedern handelt es sich meistens um Leute, die ein schlechtes Game haben.","replies":[{"poster":"Pandaphiri","date":"2017-04-23T11:36:58.179+0000","up_votes":1,"down_votes":0,"body":"ne ne ist doch klar das riot bei einem schuld ist wenn immer wieder das spiel crasht. das man selber shculd sein sollte oder mal überlegen und was dagegen machen könnte ist völlig abwegig","replies":[]}]}]},{"poster":"ΔRC RΔFUNZΞL","date":"2017-04-23T11:00:18.660+0000","up_votes":1,"down_votes":0,"body":"das ist doch eh nur ab dia so","replies":[]}]}