{"poster":"Arammus","date":"2018-03-06T04:24:18.665+0000","title":"\"ist nur XY Gamemode wem kümmerts?\" mich z.b","subforum":"Spielerverhalten & Moderation","up_votes":10,"down_votes":5,"body":"ich habe diese aussage so oft gelesen um schlechtes spielen/inting/trolling zu rechtfertigen\n&quot;ist nur ranked flex&quot;\n&quot;ist nur aram&quot;\n&quot;ist nur random funmode&quot;\n&quot;ist nur ein normal&quot;\n\nwoher kommt diese dumme aussage? bitte korrigiert mich wenn ich falsch bin aber meines wissens nach z&auml;hlen DIE SELBEN REGELN in jedem modus. in der soloq, im flex, in funmodes und auch gegen riot-bots.\nund selbst wenn man leute darauf hinwei&szlig;t dann kommt im besten fall sowas wie &quot;lol nerd&quot; (was ich auch nicht kapiere)\n\nmich k&uuml;mmert es. es ist doch eine regel das man in jedes match reingehen soll mit dem ziel zu siegen oder etwa nicht?\nund (beispiel) 5mal als lee sin in ein 1v3 zu q&#039;en einfach weil &quot;es nur ein normal oder sonstwas&quot; ist ist f&uuml;r mich sabotage. bzw nicht die einstellung gewinnen zu wollen.\nwenn man spaß haben will ist das schön und gut, ist ja auch sinn des spiels und ich sage auch nichts wenn man mal etwas blödsinn macht, aber mit der einstellung reinzugehen \"mir ist alles total egal, auch ob meine teammates das match ernst nehmen oder nicht\" sollte doch ein regelverstoß sein?\nein BESTRAFBARER regelverstoß.\n\nwarum habe ich also das gef&uuml;hl das die leute f&uuml;r sowas nie bestraft werden?","replies":[{"poster":"MelikeWombat","date":"2018-03-06T09:22:05.713+0000","up_votes":5,"down_votes":0,"body":"Ich gehöre zu den Menschen, die  durchaus auch mal schreiben \"chill it's aram\". Für mich bedeuten Normals und ARAMs, dass ich entspannt vor mich hin spielen möchte. Also bin ich nicht voll konzentriert und versuche auch nicht zwingend das Spiel zu carrien, was nicht heißt, dass ich feede oder afk gehe. Gerade im ARAM (Funmode) dafür dumm angemacht zu werden, dass ich lieber full ap Malphite als Tank spiele, finde ich ziemlich daneben. Ich sabotiere das Spiel nicht absichtlich, aber ich tue auch nicht alles in meiner Macht stehende um zu gewinnen.","replies":[]},{"poster":"Abasin","date":"2018-03-06T06:54:31.589+0000","up_votes":6,"down_votes":1,"body":"Wenn jemand sich offensichtlich nicht anstrengt, egal welcher Mode, dann reporte ich ihn. Genauso, wenn ich ihn mit einem \"come on, help us\" oder ähnlich an seine Pflicht zum spielen erinnere und so eine Aussage kommt. Ich kann so eine Einstellung auf den Tod nicht ausstehen. Man geht ins Spiel, um sein Bestes zu geben oder man lässt es. Wenn man eigentlich keinen Bock hat, sollte man sich erst gar nicht anmelden, denn man verärgert 4 Mitspieler mit seiner Einstellung.","replies":[]},{"poster":"5weeds","date":"2018-03-06T08:47:54.786+0000","up_votes":3,"down_votes":0,"body":"Dass man im Ranked, egal ob Flex oder SoloQ sein bestes geben *muss*, ist indiskutabel.\n\nIm Normal ist die Sache schon schwieriger.\nWenn Jemand einen neuen Champ ausprobiert, oder mit Runen/Itembuilts usw. rumexperimentiert, dann ist es mMn in Ordnung wenn man schlecht spielt, oder gar feeded.\nAber nur solange es nicht durch eine \"mir Egal\" oder \"Troll\"- Attitüde zum Feed kommt!\n\nAuch wenn es *nur* ein Normal ist, sollte man sich trotzdem Mühe geben!","replies":[]},{"poster":"Doo ","date":"2018-03-07T17:32:14.428+0000","up_votes":2,"down_votes":0,"body":"Einführung einer reinen SOLOQ wäre durchaus sinnvoll. Dann könnte man noch DuoQ einführen und halt Flex beibehalten, aber die wären dann eher zum Spaß.\n\n> und (beispiel) 5mal als lee sin in ein 1v3 zu q'en einfach weil \"es nur ein normal oder sonstwas\" ist ist für mich sabotage.\n\nAlle die in SoloQ zu zweit spielen, dass ist genauso Sabotage. Spieler 1 ist vom Skill her Silber. Spieler 2 ist skilltechnisch Dia und spielt mit einem Smurf. = Sabotage, Eloboost, illegal. Was unternimmt man dagegen? Nichts.\nRiot soll endlich die reine SoloQ einführen, es macht einfach keinen Sinn ein ranksystem zu haben wenn man aber nicht nach seinem eigenen Skill bewertet wird. DuoQ Spieler werden immer einen Vorteil gegenüber reinen Solo Spielern haben. Allein schon wegen der Kommunikation und wegen langem zusammenspielen. \n\nVon Flexq möchte ich gar nicht Erst anfangen, das kann man doch nicht Ernst nehmen. ","replies":[]},{"poster":"ReignOfTerr0r","date":"2018-03-07T06:29:58.513+0000","up_votes":2,"down_votes":0,"body":"Ich gebe dir vollkommen Recht, wobei ich da bei Normals und ARAM noch etwas großzügiger bin. Gerade bei ARAM ist es ja nicht unwahrscheinlich, dass man einen Champ bekommt, den man noch nie oder zumindest nur sehr selten gespielt hat. Da kann man nicht zwangsweise immer top GamePlay erwarten.\n\nBei 5vs5-FlexQ und bei 3vs3-Ranked gebe ich dir dagegen recht. Ich finde es unverständlich und ehrlich gesagt auch ne Frechheit, wenn Leute in Rankeds gehen, meinen Sie können sich da mal ausragen oder irgendeinen Champ First-Time spielen und sich dadurch rechtfertigen, dass es \"nur\" ein FlexQ oder 3vs3-Ranked ist. Was ist denn das für ein Käse? Ich gehe doch auch nicht in ein SoloQ-Ranked, trolle da rum, spiele nen Champ first Time und sag dann \"chill ist doch nur.......\" nur weil mich z.B. das SoloQ-Ranked nicht juckt. Das man dadurch nämlich mal geschmeidig den übrigen Teammates das Spiel versaut, ist solchen Individuen vollkommen egal.\n\nDas Problem ist eher, dass Riot nichts gegen solche Leute unternimmt. Die werden nciht verwarnt, gebannt, bestraft. Da kann sogar offensiv in den Chat geschrieben werden, dass man ja nur trollt. Das ist Riot egal. Aber wehe du stehst mal ne halbe Sekunde zu lange in der Base. Zack haste eine Chatrestriction oder ähnliches. Ich finde das so bescheuert. Dann soll doch Riot nicht fordern, dass man fair spielt und nicht trollt, wenn es schlussendlich eh nicht bestraft wird.","replies":[{"poster":"eingew","date":"2018-03-07T07:52:24.326+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ReignOfTerr0r,realm=EUW,application-id=KYnfKGf0,discussion-id=QURZaqRk,comment-id=0012,timestamp=2018-03-07T06:29:58.513+0000)\n>\n> Das Problem ist eher, dass Riot nichts gegen solche Leute unternimmt. Die werden nciht verwarnt, gebannt, bestraft. Da kann sogar offensiv in den Chat geschrieben werden, dass man ja nur trollt. Das ist Riot egal. Aber wehe du stehst mal ne halbe Sekunde zu lange in der Base. Zack haste eine Chatrestriction oder ähnliches. Ich finde das so bescheuert. Dann soll doch Riot nicht fordern, dass man fair spielt und nicht trollt, wenn es schlussendlich eh nicht bestraft wird.\n\nEigentlich gefällt mir ja dein Post, aber dieser Absatz hier ergibt zu großen Teilen keinen Sinn. Also du hast ja Recht, dass Riot Trolle zu selten bestraft und noch immer zu lange braucht, diese zu erkennen, aber was bitte hat die Bewegung deiner Championfigur mit einer Chatrestriction zu tun? Wenn du dich zu wenig bewegst, kommst du in die Low Priority Queue, weil dich der Leaverbuster erkannt hat. Aber dazu braucht es einiges mehr als \"eine halbe Sekunde\". Du wirst nur dann mit der LPQ bestraft, wenn du mehrfach Spiele verlassen hast.\n\nDie CR dagegen kriegst du ausschließlich für Fehlverhalten im Chat. \n\nWas deinen Vorwurf angeht, dass Riot es gar nicht erst fordern soll, wenn sie es nicht angemessen bestrafen können... halte ich für eine ziemlich schlechte Einstellung. Wenn es bei einer OP nur eine sehr geringe Überlebenschance gibt, wird sie dadurch sinnlos? Obwohl einige Leben damit gerettet werden können?\nKlar, das System ist gerade bei Trollen von Perfektion sehr weit entfernt. Aber die Vorstellung, dass es deshalb irgendetwas bringen würde, komplett darauf zu verzichten, ist doch völlig absurd.","replies":[]}]},{"poster":"5 Dunks 1 Darius","date":"2018-03-06T18:28:23.095+0000","up_votes":2,"down_votes":0,"body":"Du hast vergessen: \"Ist nur mein Smurf\"","replies":[]},{"poster":"Nordwolf87","date":"2018-03-06T05:45:53.920+0000","up_votes":2,"down_votes":0,"body":"Naja ich verwende es regelmäßig in der phrase \"calm down, its just a normal/aram(mus)/funmode\" wenn einer flamed.\n\nEs geht einfach darum, dass in normals/arams/funmodes man champs übt, neue rollen testet, item/runenbuilds versucht etc. Bei funmodes kenn ich zb noch nicht mal alle und muss mir öfters erst anschauen wie der funzt bzw bekommt man in zb arurf (und auch in aram) champs, die man noch nie gespielt hat. Dass man da dann nicht die topleistung bringt ist daher klar. Daher sollten alle etwas \"großzügiger\" bei schlechten leistungen sein.\n\nWo die grenze liegt, sind die regeln. Diese gelten in allen modes für mich. Inten/Flamen/trollen sind da auch nicht in ordnung und gehören genauso reported und geahndet wie in ranked.","replies":[{"poster":"Arammus","date":"2018-03-06T06:23:25.128+0000","up_votes":2,"down_votes":0,"body":"das ist ja was anderes. aber ich meine wirklich leute die bei jedem play und allem sagen \"its just a normal bla\"","replies":[{"poster":"Nordwolf87","date":"2018-03-06T10:38:37.628+0000","up_votes":2,"down_votes":0,"body":"Ja auch da kommts auf die dosis an. Wenns bei jedem play ist, ists daneben. Wenn man aber halt mal plays ausprobieren will, die man sich im ranked nicht traut ists ok.\n\nDas typische \"its a normal\" ist ja meist nur die verteidigung gegen flame/blame hab ich die erfahrung gemacht.","replies":[]}]}]},{"poster":"A Ryze From Dead","date":"2018-03-06T10:10:17.824+0000","up_votes":2,"down_votes":0,"body":"Ich stimme dem, was einige hier schon geschrieben haben zu. Bei Ranglistenspielen gehört es zum guten Ton sein Bestes zu geben und alles moralisch vertretbare für den Sieg zu machen.\n\nBei Nicht-Ranglistenspielen ist es ohne Frage immer noch das Gemeinziel zu gewinnen, aber die Ambition und Verbissenheit Leistung zum Sieg zu erbringen ist variierbar. Schließlich gibt es für _dich_ ja keinen wirklichen Leistungsunterschied zwischen jemanden der einen Champion zum ersten Mal spielt und sein Bestes gibt, oder ob genau der gleiche Typ mit seinem Main Trollbuilds spielt oder schwache Spielzüge macht.\n\nEinen schlechten Champion zu spielen, ein schweres Matchup zu üben, riskante Sachen zu machen, das alles sollte im Normal meiner Meinung nach nicht als Sabotage gelten.","replies":[]},{"poster":"yasuolover97","date":"2018-03-06T10:18:14.146+0000","up_votes":3,"down_votes":1,"body":"***","replies":[{"poster":"Rena","date":"2018-03-06T13:10:17.244+0000","up_votes":1,"down_votes":0,"body":"Ich bin zwar nicht oft deiner Meinung aber hier muss ich dir zustimmen. \n\nNormal games sind nun mal zum Spass da und für viele (z.B. für mich) auch als Übung wenn ich einen Champion lernen will. Wenn ich also first Time Katarina im Normal spiele und faile weil ich sie nicht kann, wäre das so falsch von mir? Schon klar wenn mich dann jemand flamet sage ich \"it's just a normal game im new to Kata\".\n\nEs gibt dann auch irgendwelche Leute die sagen \"Spiel gegen Bots\". Gegen Bots lernt man so gut wie gar nichts, die Lanephase gegen Bots ist ja ein Witz also was soll man davon schon mitnehmen ausser villeicht ein paar Combos.\n\nIch finde auch nichts falsch daran, Nonmeta sachen in Normals auszuprobieren (z.B. AP Malphite). Dafür ist ja League da um Spass zu haben. Klar wenn man first time AP Malphite im Ranked spielt finde ich es wieder nicht so gut (ausser es ist AP Malphite main), aber in Normals ist das doch total inordnung.\n\nJedoch für Inten/absichtlich das Spiel verlieren gibt es keine Entschuldigung, aber \"schlecht spielen\"? wo soll man denn lernen/Spass haben, im Ranked?\n","replies":[]}]},{"poster":"Sentinence","date":"2018-03-08T08:24:54.378+0000","up_votes":1,"down_votes":0,"body":"Wie soll man LOL denn bitte sonst trainieren als in den normals? Die Bots sind Mega lächerlich. Würde man an denen mal richtig arbeiten, könnte man neue Champs und Builds auch in Bot Games testen. \n\nUnd natürlich ist es ein Ziel das Spiel zu gewinnen, aber wir reden hier von einem Game was nicht Balanced ist und niemals sein wird. LOL basiert auf einer funmap eines wirklich guten Games. \n\nWarum sollte man Einzelspiele fördern? Warum ist flex. nicht genauso wichtig wie solo? Ihr wisst schon das es sich um ein Teamspiel handelt? Meiner Meinung nach sollte das viel mehr gefördert werden. In SC1 und WC3 gab es so gut wie gar keine Flamer oder Trolls. Man hätte sein Clan und repräsentierte diesen. Flamer wurden gekickt und in keinen guten Clan aufgenommen. LOL ist für ein teamspiel viel zu solo lastig. Das ist echt zum kotzen wie viele Gamer da rumspringen die sich einen auf Kills runterholen oder das Team schwächen, indem sie eine viel zu hohe kill / Death rage haben und man als guter Gamer mit vielleicht 3 1 5 nicht mehr hinterherkommt. \n\nWenn ihr solo Zeug spielen wollt, dann fragt Riot nach Kampagnen.\n\nPS: ich bin sogar jemand der manchmal sagt, „alter das ist nur ein Game“ - jeder loose macht dich besser. Und wenn ich anfange die lane zu verlieren und das Team denkt es könnte es besser - ja dann lasst halt Lanes switchen. Ich habe selten ein Game mit solch einer eingeschränkten Kreativität erlebt. Naja - wie gessgt verlangt es dem Gamer die kognitiven Fähigkeiten einer funmap ab","replies":[]},{"poster":"VTL Vito","date":"2018-03-06T09:48:29.002+0000","up_votes":1,"down_votes":1,"body":"Bis auf Ranked Flex muss ich dir widersprechen, LOL ist nunmal ein Spiel und wenn ich mich nicht 100% anstrengen möchte und einfach nur trollen will oder mit Freunden spiele etc. und dann geflamet werde, weil meine full tank anivia nicht alles wegklatscht, schreibe ich auch \"Chill its only blabla\" einfach weil es auch nur das ist. Im Flex allerdings kann ich das nachvollziehen..","replies":[{"poster":"VTL Vito","date":"2018-03-06T09:51:17.944+0000","up_votes":1,"down_votes":0,"body":"Dafür Reporten und nen Bann fordern ist einfach nur kindisch","replies":[]}]},{"poster":"Ηastur","date":"2018-03-06T09:48:02.126+0000","up_votes":1,"down_votes":0,"body":"lol.. its just normal. calm down dude","replies":[]},{"poster":"Time2Whine","date":"2018-03-06T08:20:55.660+0000","up_votes":1,"down_votes":0,"body":"Da bin ich voll bei dir, allerdings muss man etwas differenzieren was du mit deinem Beispiel schon begonnen hast. Es gibt diejenigen die in \"Nicht-Ranked\" Modi sowas tun wie du beschrieben hast. Das ist natürlich strafbar da es unter Sabotage fällt, jedoch ist es sehr schwer nachvollziehbar für das System zu bestrafbaren. Nehmen wir mal an, dass der Spieler bis auf die beschriebebene Situation sonst ein passables Spiel macht wird er kaum bestraft werden, weil das System sehr vorsichtig Strafen verteilt da jeder mal einen schlechten Moment/schlechtes Spiel haben kann.\n\nDann gibt es jedoch die Leute, die genau sowas zu anderen Spielern sagen wenn sie geflamet werden, weil sie gerade einen neuen Champ oder eine neue Rolle probieren. In solchen Situation sind solche Aussagen legitim denn dafür sind Normals, ARAMS, Bot-Games da. Solange man in solchen Siuationen sein Bestes gibt, ist sowas in meinen Augen in Ordnung.","replies":[]},{"poster":"Nephiłim","date":"2018-03-06T08:11:07.607+0000","up_votes":1,"down_votes":0,"body":"Also wenn jemand rumflamed oder generell droht jemanden zu reporten schreibe ich überall außer im SoloQ \"Chill its just a \"xy\" game\" ganz einfach da meiner Meinung nach alles außer SoloQ zum üben da ist. \n\nFlex/SoloQ :\nWas ich jedoch NICHT gutheise ist wenn man nicht mit vollem Einsatz spielt! Es ist immerhin ein Teamgame und es geht im großen und ganzen darum sich zu verbessern.\n\nVon mir aus kann man mal in Normals oder Ranked games 0/5 gehen oder so, solange man wenigstens Ehrenvoll bleibt und nicht direkt einen Teammate beleidigt. Denn wenn man als 0/5 Yasuo die 0/4 botlane flamed, wird man reported denn selber kacke spielen und sich das Recht zu nehmen andere, die vielleicht auch einen schlechten Tag haben, zu flamen ist einfach nur Idiotisch.","replies":[]},{"poster":"MisterFirstBlood","date":"2018-03-06T07:47:44.991+0000","up_votes":1,"down_votes":0,"body":"Reporte trotzdem jeden der im aram mit zilean Bomben in teammates flashed, Flamed und afk geht. Wenn es von riot Intended wäre dass Leute dort keine Regeln befolgen hätten sie das Report System deaktiviert.\nWenn man das Spiel nicht ernst nimmt sollte man nicht vom ranked ins aram gehen sondern einfach aufhören zu spielen. Das ruiniert nach wie vor 4 anderen Leuten den Spielspaß","replies":[]},{"poster":"TheFoxRox","date":"2018-03-06T05:56:32.785+0000","up_votes":1,"down_votes":0,"body":"Also wenn jemand in einem normal total durchdreht und ständig report ausruft, nur weil der jungler nicht regelmäßig für einen gank bereitsteht, dann kommt von mir dieselbe Phrase. Aber natürlich sind normals usw kein Freifahrtschein um rumzutrollen.","replies":[]},{"poster":"manial fly","date":"2018-03-06T05:42:47.825+0000","up_votes":1,"down_votes":0,"body":"Das man in normals z.B. neue Champs spielt oder welche die man nicht gut kann ist ja legitim. Wenn man Pech hat läufts dann halt auch nicht optimal. Aber ja grundsätzlich gelten überall die selben regeln.\nIch hatte mal vor ein paar Wochen ein Blutmond Spiel in dem eine Camille aus meinem Team, nachdem sie einmal gestorben ist nur noch afk in der Base stand. Jemand anderes meinte dann das er sie reporten wird und darauf hin ist ein Rengar in meinem Team völlig ausgerastet von wegen es wäre ja nur ein Funmode und wir sollten Spaß haben. Ich hab ihm dann geschrieben das ich keinen Spaß hab wenn man die ganze Zeit 4vs5 spielt und es in jedem Mode verboten ist nur afk in der Base rumzutanzen. Darauf hin musste ich mir dann die übelsten Beleidigungen von ihm anhören und so Sachen wie ich soll aufhören zu tryharden. Ich meine ich finds in Funmodes oder Arams auch übertrieben sich über jemanden aufzuregen der blöde Stats hat. Gerade im Aram hat man ja auch keinen Einfluss auf seine Champs. Aber das ganze Spiel in der Base rumtanzen ist einfach on keinem Mode erlaubt. Sowas hab ich echt noch nie erlebt hab am Ende natürlich beide reportet, aber so wie man das System kennt ist nichts dabei rumgekommen.","replies":[]},{"poster":"Ich bin Toxic","date":"2018-03-06T05:19:51.525+0000","up_votes":1,"down_votes":0,"body":"es ist halt unlucky, aber die meisten leute geben sich halt ''nur in normals'' keine mühe.","replies":[]},{"poster":"BMW E39 525d","date":"2018-03-06T22:32:33.951+0000","up_votes":1,"down_votes":2,"body":"Ich bin damit einverstanden, wenn schlecht spielen und grobe Fahrlässigkeit ein bestrafbarer Regelverstoß in der SoloQ ist.{{champion:28}} \n\nMir sind die anderen Gamemods auch alle egal, die Spiele ich um Spaß zu haben. Man gibt sich immer Mühe, aber man probiert halt Picks die man nicht kann. Ich zocke normal ausschließlich Support aber halt auch nun seit kurzem Caitlyn ADC in Flex. Ich bin Flex Bronze 1, was soll ich sagen, ich spiele den Champ First Time besser als die anderen ihre \"Mains\" in der Elo. Flex ist sowieso Müll, weil die Elo da so durcheinandergewürfelt wird. Da zockst du als Master gegen Platin und umgekehrt und das nicht selten, da sind die Leute SoloQ Challenger und SoloQ Gold.\nDie MMR in Flex ist halt komplett kaputt, weil der Gamemode uninteressant ist und das niemand spielt.\n\nEs geht in erster Linie darum Spaß zu haben, AUßER in der SoloQ. Nur in der SoloQ gehts ums gewinnen und tryhard.\nDer Rest ist fürs Vergnügen da. Chill einfach mal dein Leben. Mir ist das auch egal, weil sie haben ja Recht. Solange sie nicht trollen solls mir egal sein, aber davon gibts ja selbst in Normal Games genug. Das verstehe ich viel weniger, wieso man in Normal Games alles so ernst nehmen muss und in Champselect beim bannen und picken schon trollen muss.","replies":[{"poster":"eingew","date":"2018-03-07T07:55:23.070+0000","up_votes":1,"down_votes":0,"body":"Ranked ist nicht gleich Ranked, bloß weil du das sagst?","replies":[{"poster":"BMW E39 525d","date":"2018-03-07T08:59:27.189+0000","up_votes":1,"down_votes":2,"body":"Denk doch was du willst.\nFlex Q sagt gar nix aus, deswegen nimmt das auch keiner ernst, weil das System komplett quatsch ist. Ich sage auch nicht das man trollt, aber Leute spielen halt lieber das was sie wollen und nicht das was sinnvoll wäre. Aber nur weil man andere Qs locker sieht tun alle gleich immer so als würde man trollen...","replies":[]}]}]},{"poster":"WC9 Umbra","date":"2018-03-06T07:21:35.636+0000","up_votes":1,"down_votes":1,"body":"in normals is mir das völlig egal, da geht es ja um nichts. Wer aber ranked spielt hat eine Verantwortung","replies":[]},{"poster":"Oriius","date":"2018-03-06T05:26:22.392+0000","up_votes":1,"down_votes":5,"body":"Weil  es immer einen gibt der irgendetwas sagt und 5 mio Deppen ohne Hirn plappern nach. Eigene Meinung kann sich niemand bilden scheinbar....","replies":[]}]}