{"poster":"Arammus","date":"2018-08-22T12:55:06.356+0000","title":"warum es so schwer ist inter zu bannen:","subforum":"Spielerverhalten & Moderation","embed":{"description":null,"url":"https://puu.sh/Bitbx/d271fed697.jpg","image":null},"up_votes":2,"down_votes":7,"body":"die morgana war am inten richtig?\r\nnein. sie hat nur gemacht was viele leute in low elo machen.\r\ndas team als useless bezeichnet, gesagt sie wird solo carrien und deshalb 24/7 alleine auf lanes zu sein und gecatched zu werden.\r\ntwitch mit, f&uuml;r 57min spielzeit, fast 0 farm und einem ie kauf in der 54. min ist doch eindeutig ein troll oder? nein auch das ist in low elo v&ouml;llig normal.\r\n\r\nich denke das sind die gr&uuml;nde warum inting schwer festzumachen ist.\r\ndie morgana hat nicht geinitet, sie gab nie einen kill einfach so ab. sie war immer alleine und hat sich verteidigt. (nur hat sie nie n spell getroffen aber egal) aber jeder der eine 0/21 morg sieht die noch dazu kaum assists im vergleich hat, w&uuml;rde sagen sie intet. obwohl sie es nicht getan hat","replies":[{"poster":"MeMyselfandBaal","date":"2018-08-22T20:35:08.203+0000","up_votes":3,"down_votes":0,"body":"Weil der Unterschied zwischen der 21 Tode Morgana und dem 22 Tode Fizz minimal ist... Man könnte sogar behaupten, der Fizz hat wesentlich schlimmer gefeedet, als die Morgana, die am Ende so viel Wert war wie ein Ward... Während der Fizz wahrscheinlich mehrere Shutdowns abgegeben hat.\n\nHat die Morgana eine suboptimale Taktik gespielt? Bestimmt. Aber wenn man alle Spieler, die dies machen, instant bannt... wird es selbst in Gold sehr sehr schnell sehr sehr einsam.\n\nUnd ja, Bronze Spiele machen haufenweise Fehler. Aber genau das macht es für Riot halt schwer zwischen \"Ist einfach nur schlecht\", \"ist einfach nur tilted\" und \"sabotiert mit Absicht\" zu unterscheiden...","replies":[{"poster":"Arammus","date":"2018-08-22T22:37:14.324+0000","up_votes":2,"down_votes":0,"body":"meine worte.","replies":[]}]},{"poster":"Alpacana","date":"2018-08-22T13:02:38.118+0000","up_votes":2,"down_votes":0,"body":"Also für ein 57-Minuten Game sind so viele Tode im Spiel für ein Low-Elo Game \"normal\".\nSieht mir jetzt nicht so aus als dass einer die Mitte runtergerannt ist und ich habe lieber jemanden der sich als last item IE holt als dass er es sich als erstes Item holt.\n\nFür mich sieht es nach einem Spiel aus, das einer Clown-Fiesta geglichen hat. So kommen nunmal viele Tode zustande, das ganze dann noch gepaart mit einem schlechten Spiel des jeweiligen Spielers und tada, du hast jemanden der dich für inten reporten will.\n\nIch will hier auch mal nicht bemerken, dass Morgana fast die gleiche KP wie du hast...\n\nAlso zusammengefasst:\nDieses Spiel ist weitaus entfernt von irgendwelchem \"inten\"","replies":[{"poster":"Lonser","date":"2018-08-22T13:17:19.259+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alpacana,realm=EUW,application-id=KYnfKGf0,discussion-id=JaopJHR8,comment-id=0000,timestamp=2018-08-22T13:02:38.118+0000)\n>\n> Also für ein 57-Minuten Game sind so viele Tode im Spiel für ein Low-Elo Game &quot;normal&quot;.\n> Sieht mir jetzt nicht so aus als dass einer die Mitte runtergerannt ist und ich habe lieber jemanden der sich als last item IE holt als dass er es sich als erstes Item holt.\n> \n> Für mich sieht es nach einem Spiel aus, das einer Clown-Fiesta geglichen hat. So kommen nunmal viele Tode zustande, das ganze dann noch gepaart mit einem schlechten Spiel des jeweiligen Spielers und tada, du hast jemanden der dich für inten reporten will.\n> \n> Ich will hier auch mal nicht bemerken, dass Morgana fast die gleiche KP wie du hast...\n> \n> Also zusammengefasst:\n> Dieses Spiel ist weitaus entfernt von irgendwelchem &quot;inten&quot;\n\nSeh' ich genauso, auch wenn es natürlich immer etwas unglücklich ist, wenn man eine 0/21/XX Morgana im Team hat, in Low Elo kann man sowas problemlos ausgleichen mit genug persönlichen Skill und wenn der Rest des Teams gut zusammen spielt, aber in höherer Elo (Plat+) wird sowas sehr schwierig, da zählt nun mal jedes Teammitglied.","replies":[{"poster":"Alpacana","date":"2018-08-22T13:26:36.508+0000","up_votes":3,"down_votes":0,"body":"Stimme dir grundsätzlich zu, kommt aber immer auf den individuellen Skill an^^ Ein High Challenger Spieler wird auch noch in Diamond solo gewinnen können, auch wenn seine Morgana 0/30 steht^^","replies":[]}]}]},{"poster":"OPChampsSucks","date":"2018-08-22T14:24:51.797+0000","up_votes":1,"down_votes":6,"body":"Konnte jetzt keinen Int erkennen nur n absolut schlechtes spiel. Reported hätte ich die Morgana maximal anhand der Elo. Ich sehe tagtäglich Leute die so etwas reißen die dann aber platin sind oder dia sind. Solche leute werden bei mir bewusst dann unter \"Betrug\" reported weil so etwas in Platin oder Dia ist im Gegensatz zu Bronze /Silber wo anfänger spielen meiner Ansicht nach eher nicht zu tolerieren. Man sollte auch einfach mal den Stand der Spieler berücksichtigen allerdings könnte man die Morgana trotzdem fürs absichtliche zuspielen reporten.\n\nMir erschließt sich der Sinn aber nicht was du uns hiermit jetzt beweisen willst. Soll das der Grund sein wieso man inten nicht bzw schwer reporten /bannen kann? \n\nRiot ist eine große Firma . es gibt vielfältige und auch sehr kostengünstige Möglichkeiten Spiele manuell zu überprüfen und das muss man hier einfach auch nur wenn man sich als Firma einen Dreck drum schert weil das Geld schließlich auch so fließt wieso sollte man zu irgendwelchen Maßnahmen greifen?  Wenn man als Firma zusammen mit der Community dagegen vorgehen würde dann würden sich Inter innerhalb von ein paar Wochen auf ein absolutes minimum reduzieren lassen aber da weder die Community so richtig bereit dazu ist als auch Riot sich irgendwie mal um so etwas kümmern möchte wird das eher nicht geschehen.","replies":[{"poster":"Alpacana","date":"2018-08-22T14:44:21.606+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OPChampsSucks,realm=EUW,application-id=KYnfKGf0,discussion-id=JaopJHR8,comment-id=0003,timestamp=2018-08-22T14:24:51.797+0000)\n>\n\n> Riot ist eine große Firma . es gibt vielfältige und auch sehr kostengünstige Möglichkeiten Spiele manuell zu überprüfen\n\n\nDas interessiert mich jetzt. Welche vielfältigen, kostengünstige Methoden gäbe es denn da deiner Meinung nach?","replies":[{"poster":"7deadLeeSlnz","date":"2018-08-22T15:12:06.982+0000","up_votes":2,"down_votes":1,"body":"Leider ist er an keiner Diskussion interessiert und wird nicht antworten. Er redet einfach nur Riot schlecht ohne Argumente vorzubringen.","replies":[{"poster":"Alpacana","date":"2018-08-22T15:14:19.576+0000","up_votes":2,"down_votes":0,"body":"Weiß ich, versuchen kann man es ja aber trotzdem mal, denn diese Punkte die er anscheinend hat würden mich echt interessieren.","replies":[]}]}]},{"poster":"Awsane","date":"2018-08-22T14:35:07.798+0000","up_votes":2,"down_votes":0,"body":"> Man sollte auch einfach mal den Stand der Spieler berücksichtigen\n\n\nich halte es Problematisch anhand der Elo zu sagen das Verhalten in Silber ist okay aber in Platin nicht.\nDas sollte eigentlich Elounabhängig einheitlich für alle gleich sein.\nAnsonsten bräuchte man nen ganz klaren Katalog wo was erlaubt ist und wo nicht. Allein den schon zu erstellen ist nen Ding der Unmöglichkeit, weil der Skill in LoL geklustert ist und nicht linear, so kann es durchaus Aspekte des Spiels geben die ein Silber Spieler kann und ein Platin Spieler nicht, aber beide zurecht in ihrer Elo sind, weil der Platinspieler doch viel gut kann und der Silber Spieler eher wenig.","replies":[]}]},{"poster":"Nordwolf87","date":"2018-08-22T13:31:16.520+0000","up_votes":3,"down_votes":1,"body":"Das war kein Ranked game das war ein Massaker {{sticker:sg-janna}} \n\nGrob gerechnet: 140 kills in 55 minuten = 2,5kills/minute\n\nIm Durchschnitt!! {{sticker:sg-ahri-1}} \n\nDas ist fast der CS/min wert von dem Twitch (2.6) {{sticker:sg-zephyr}} ","replies":[{"poster":"Arammus","date":"2018-08-22T13:47:06.721+0000","up_votes":4,"down_votes":2,"body":"darum ist bronze ja auch so geil/amüsant :D","replies":[]}]},{"poster":"Pilze","date":"2018-08-22T19:16:58.278+0000","up_votes":1,"down_votes":2,"body":"Wenn ich mir die Antworten und auch den Thread durch lese, weiß ich genau wieso solche Leute es immer und immer wieder machen werden. Man kommt gut damit weg weil niemand dagegen etwas tut, sicher war das Inten und sicher hat der oder die Spielerin es absichtlich gemacht. 21 Tode ist selbst in Silber oder Bronze zu viel, aber redet euch alle mal ein das jeder so schlecht ist in der Elo. \nGott diese Com ist sowas von verdorben und Blind, das man hier echt alles machen kann und so gut wie kaum reported wird.","replies":[{"poster":"Angel Ayume","date":"2018-08-22T23:13:28.818+0000","up_votes":2,"down_votes":0,"body":"Nein. Der Spieler hat offenbar einfach nur sehr sehr schlecht gespielt. Wahrscheinlich war er ziemlich krass getiltet, hatte kein Bock mehr und hat nicht mehr 100 % gegeben. Das er bewusst, also mit der Absicht zu sterben, in die Gegner gelaufen ist, würde ich hier nicht behaupten. ;) \n\nDie Absicht dahinter ist eben wichtig. Und seine Intention, dass Game durch seinen Feed zu verlieren war sicher nciht gegeben. Ich sehe lediglich einen Spieler der meiner Vermutung nach, einfach super getiltet war und dauerhaft falsche Entscheidungen getroffen hat. \n\nUnd natürlich sind 21 Tode sehr viel, aber hast du auch die Gamingzeit angesehen? Eine Stunde. Das sind alle 2,9 Minuten ein Tot. \nDu hattest ein Game wo du alle 3,8 Minuten oder so gestorben bist. Da würdest du sicher auch nicht behaupten, dass du geintet hast oder?","replies":[]}]},{"poster":"Izaya Kumiho","date":"2018-08-22T13:18:10.185+0000","up_votes":1,"down_votes":0,"body":">die morgana war am inten richtig?\nnein. sie hat nur gemacht was viele leute in low elo machen.\n\nFür ein 1h game 21 tode und 21 Assists als Supporter zu haben? \nUhm... ja, das klingt relativ normal.\n\n>das team als useless bezeichnet, gesagt sie wird solo carrien und deshalb 24/7 alleine auf lanes zu sein und gecatched zu werden.\n\n\n...sie hat mehr Assists, als die zwei ADC's an Kills haben ô_ô\nAußerdem kannst du solche Leute muten D:\n\n>twitch mit, für 57min spielzeit, fast 0 farm und einem ie kauf in der 54. min ist doch eindeutig ein troll oder? nein auch das ist in low elo völlig normal.\n\nWenn er es nicht besser weiss...\nhttp://i.imgur.com/6gcuvFD.gif\n\n\n\n>aber jeder der eine 0/21 morg sieht die noch dazu kaum assists im vergleich hat, würde sagen sie intet. obwohl sie es nicht getan hat\n\nWahrscheinlich weil die Assists mehr oder weniger aussagen, ob die Person bei Teamfights tätig gewesen ist, oder eher nicht.\nWenn jedoch für das ganze Team keine Kills gefallen sind, wird es wieder schwer als \"normal sterblicher Forenuser\" eine Stellung zu nehmen.","replies":[]}]}