{"poster":"Elphrihaim","date":"2014-12-18T00:38:55.655+0000","title":"Character Limit when Editing","subforum":"Boards Feedback","up_votes":1,"down_votes":0,"body":"Is still 4096. Why is this hard? Why can't I just **have a large post that wasn't large the first time** because I have since been corrected, and thus need to expand the post?\r\n\r\nThat's really really stupid. The character limit when making a new post is **larger** than the character limit when editing it.\r\n\r\nWhich means, NATURALLY, that the same is going to be true for making opening posts of discussions-- they won't be able to be edited if they're more than 24000 characters despite allowing us an unlimited number of characters when posting it the first time.\r\n\r\nWhich hurts everybody in Roleplaying, Story & Art, as well as anybody that makes Champion Concepts. It hurts Tips & Tricks (they can't edit the post if they find something wrong in their huge body). It means that if somebody wants to suggest something for Gameplay & Balance, but they find they made a mistake, they have to trim down their post in order to be able to fix the error? \\>\\_\\>\r\n\r\n","replies":[{"poster":"MaliceCity","date":"2014-12-18T04:02:52.151+0000","up_votes":3,"down_votes":0,"body":"Hey guys, this is a bug and we will fix it. Sorry about that! We were not aware of it before now.","replies":[{"poster":"Elphrihaim","date":"2014-12-18T05:18:18.907+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bear Hat Alice,realm=NA,application-id=bzRrPGQO,discussion-id=OJrAy0YJ,comment-id=0001,timestamp=2014-12-18T04:02:52.151+0000)\n>\n> Hey guys, this is a bug and we will fix it. Sorry about that! We were not aware of it before now.\n\n...\n\nI have to ask, because it will eat at me if I don't--\n\nHow does this happen?\n\n(Not the fact that this bug exists and it was unknown, the bug itself.)","replies":[{"poster":"MaliceCity","date":"2014-12-19T03:08:53.113+0000","up_votes":5,"down_votes":0,"body":"We had specified the limit in a few different places. When we changed it from 4K to 10K, we missed the form for editing comments. But now it is fixed!\n\nTo prove it, I am editing my comment and entering as much of Pride and Prejudice as I can: \n\nPRIDE AND PREJUDICE\n\nBy Jane Austen\n\n\n\nChapter 1\n\n\nIt is a truth universally acknowledged, that a single man in possession\nof a good fortune, must be in want of a wife.\n\nHowever little known the feelings or views of such a man may be on his\nfirst entering a neighbourhood, this truth is so well fixed in the minds\nof the surrounding families, that he is considered the rightful property\nof some one or other of their daughters.\n\n\"My dear Mr. Bennet,\" said his lady to him one day, \"have you heard that\nNetherfield Park is let at last?\"\n\nMr. Bennet replied that he had not.\n\n\"But it is,\" returned she; \"for Mrs. Long has just been here, and she\ntold me all about it.\"\n\nMr. Bennet made no answer.\n\n\"Do you not want to know who has taken it?\" cried his wife impatiently.\n\n\"_You_ want to tell me, and I have no objection to hearing it.\"\n\nThis was invitation enough.\n\n\"Why, my dear, you must know, Mrs. Long says that Netherfield is taken\nby a young man of large fortune from the north of England; that he came\ndown on Monday in a chaise and four to see the place, and was so much\ndelighted with it, that he agreed with Mr. Morris immediately; that he\nis to take possession before Michaelmas, and some of his servants are to\nbe in the house by the end of next week.\"\n\n\"What is his name?\"\n\n\"Bingley.\"\n\n\"Is he married or single?\"\n\n\"Oh! Single, my dear, to be sure! A single man of large fortune; four or\nfive thousand a year. What a fine thing for our girls!\"\n\n\"How so? How can it affect them?\"\n\n\"My dear Mr. Bennet,\" replied his wife, \"how can you be so tiresome! You\nmust know that I am thinking of his marrying one of them.\"\n\n\"Is that his design in settling here?\"\n\n\"Design! Nonsense, how can you talk so! But it is very likely that he\n_may_ fall in love with one of them, and therefore you must visit him as\nsoon as he comes.\"\n\n\"I see no occasion for that. You and the girls may go, or you may send\nthem by themselves, which perhaps will be still better, for as you are\nas handsome as any of them, Mr. Bingley may like you the best of the\nparty.\"\n\n\"My dear, you flatter me. I certainly _have_ had my share of beauty, but\nI do not pretend to be anything extraordinary now. When a woman has five\ngrown-up daughters, she ought to give over thinking of her own beauty.\"\n\n\"In such cases, a woman has not often much beauty to think of.\"\n\n\"But, my dear, you must indeed go and see Mr. Bingley when he comes into\nthe neighbourhood.\"\n\n\"It is more than I engage for, I assure you.\"\n\n\"But consider your daughters. Only think what an establishment it would\nbe for one of them. Sir William and Lady Lucas are determined to\ngo, merely on that account, for in general, you know, they visit no\nnewcomers. Indeed you must go, for it will be impossible for _us_ to\nvisit him if you do not.\"\n\n\"You are over-scrupulous, surely. I dare say Mr. Bingley will be very\nglad to see you; and I will send a few lines by you to assure him of my\nhearty consent to his marrying whichever he chooses of the girls; though\nI must throw in a good word for my little Lizzy.\"\n\n\"I desire you will do no such thing. Lizzy is not a bit better than the\nothers; and I am sure she is not half so handsome as Jane, nor half so\ngood-humoured as Lydia. But you are always giving _her_ the preference.\"\n\n\"They have none of them much to recommend them,\" replied he; \"they are\nall silly and ignorant like other girls; but Lizzy has something more of\nquickness than her sisters.\"\n\n\"Mr. Bennet, how _can_ you abuse your own children in such a way? You\ntake delight in vexing me. You have no compassion for my poor nerves.\"\n\n\"You mistake me, my dear. I have a high respect for your nerves. They\nare my old friends. I have heard you mention them with consideration\nthese last twenty years at least.\"\n\n\"Ah, you do not know what I suffer.\"\n\n\"But I hope you will get over it, and live to see many young men of four\nthousand a year come into the neighbourhood.\"\n\n\"It will be no use to us, if twenty such should come, since you will not\nvisit them.\"\n\n\"Depend upon it, my dear, that when there are twenty, I will visit them\nall.\"\n\nMr. Bennet was so odd a mixture of quick parts, sarcastic humour,\nreserve, and caprice, that the experience of three-and-twenty years had\nbeen insufficient to make his wife understand his character. _Her_ mind\nwas less difficult to develop. She was a woman of mean understanding,\nlittle information, and uncertain temper. When she was discontented,\nshe fancied herself nervous. The business of her life was to get her\ndaughters married; its solace was visiting and news.\n\n\n\nChapter 2\n\n\nMr. Bennet was among the earliest of those who waited on Mr. Bingley. He\nhad always intended to visit him, though to the last always assuring\nhis wife that he should not go; and till the evening after the visit was\npaid she had no knowledge of it. It was then disclosed in the following\nmanner. Observing his second daughter employed in trimming a hat, he\nsuddenly addressed her with:\n\n\"I hope Mr. Bingley will like it, Lizzy.\"\n\n\"We are not in a way to know _what_ Mr. Bingley likes,\" said her mother\nresentfully, \"since we are not to visit.\"\n\n\"But you forget, mamma,\" said Elizabeth, \"that we shall meet him at the\nassemblies, and that Mrs. Long promised to introduce him.\"\n\n\"I do not believe Mrs. Long will do any such thing. She has two nieces\nof her own. She is a selfish, hypocritical woman, and I have no opinion\nof her.\"\n\n\"No more have I,\" said Mr. Bennet; \"and I am glad to find that you do\nnot depend on her serving you.\"\n\nMrs. Bennet deigned not to make any reply, but, unable to contain\nherself, began scolding one of her daughters.\n\n\"Don't keep coughing so, Kitty, for Heaven's sake! Have a little\ncompassion on my nerves. You tear them to pieces.\"\n\n\"Kitty has no discretion in her coughs,\" said her father; \"she times\nthem ill.\"\n\n\"I do not cough for my own amusement,\" replied Kitty fretfully. \"When is\nyour next ball to be, Lizzy?\"\n\n\"To-morrow fortnight.\"\n\n\"Aye, so it is,\" cried her mother, \"and Mrs. Long does not come back\ntill the day before; so it will be impossible for her to introduce him,\nfor she will not know him herself.\"\n\n\"Then, my dear, you may have the advantage of your friend, and introduce\nMr. Bingley to _her_.\"\n\n\"Impossible, Mr. Bennet, impossible, when I am not acquainted with him\nmyself; how can you be so teasing?\"\n\n\"I honour your circumspection. A fortnight's acquaintance is certainly\nvery little. One cannot know what a man really is by the end of a\nfortnight. But if _we_ do not venture somebody else will; and after all,\nMrs. Long and her neices must stand their chance; and, therefore, as\nshe will think it an act of kindness, if you decline the office, I will\ntake it on myself.\"\n\nThe girls stared at their father. Mrs. Bennet said only, \"Nonsense,\nnonsense!\"\n\n\"What can be the meaning of that emphatic exclamation?\" cried he. \"Do\nyou consider the forms of introduction, and the stress that is laid on\nthem, as nonsense? I cannot quite agree with you _there_. What say you,\nMary? For you are a young lady of deep reflection, I know, and read\ngreat books and make extracts.\"\n\nMary wished to say something sensible, but knew not how.\n\n\"While Mary is adjusting her ideas,\" he continued, \"let us return to Mr.\nBingley.\"\n\n\"I am sick of Mr. Bingley,\" cried his wife.\n\n\"I am sorry to hear _that_; but why did not you tell me that before? If\nI had known as much this morning I certainly would not have called\non him. It is very unlucky; but as I have actually paid the visit, we\ncannot escape the acquaintance now.\"\n\nThe astonishment of the ladies was just what he wished; that of Mrs.\nBennet perhaps surpassing the rest; though, when the first tumult of joy\nwas over, she began to declare that it was what she had expected all the\nwhile.\n\n\"How good it was in you, my dear Mr. Bennet! But I knew I should\npersuade you at last. I was sure you loved your girls too well to\nneglect such an acquaintance. Well, how pleased I am! and it is such a\ngood joke, too, that you should have gone this morning and never said a\nword about it till now.\"\n\n\"Now, Kitty, you may cough as much as you choose,\" said Mr. Bennet; and,\nas he spoke, he left the room, fatigued with the raptures of his wife.\n\n\"What an excellent father you have, girls!\" said she, when the door was\nshut. \"I do not know how you will ever make him amends for his kindness;\nor me, either, for that matter. At our time of life it is not so\npleasant, I can tell you, to be making new acquaintances every day; but\nfor your sakes, we would do anything. Lydia, my love, though you _are_\nthe youngest, I dare say Mr. Bingley will dance with you at the next\nball.\"\n\n\"Oh!\" said Lydia stoutly, \"I am not afraid; for though I _am_ the\nyoungest, I'm the tallest.\"\n\nThe rest of the evening was spent in conjecturing how soon he would\nreturn Mr. Bennet's visit, and determining when they should ask him to\ndinner.\n\n\n\nChapter 3\n\n\nNot all that Mrs. Bennet, however, with the assistance of her five\ndaughters, could ask on the subject, was sufficient to draw from her\nhusband any satisfactory description of Mr. Bingley. They attacked him\nin various ways--with barefaced questions, ingenious suppositions, and\ndistant surmises; but he eluded the skill of them all, and they were at\nlast obliged to accept the second-hand intelligence of their neighbour,\nLady Lucas. Her report was highly favourable. Sir William had been\ndelighted with him. He was quite young, wonderfully handsome, extremely\nagreeable, and, to crown the whole, he meant to be at the next assembly\nwith a large party. Nothing could be more delightful! To be fond of\ndancing was a certain step towards falling in love; and very lively\nhopes of Mr. Bingley's heart were entertained.\n\n\"If I can but see one of my daughters happily settled at Netherfield,\"\nsaid Mrs. Bennet to her husband, \"and all the others equally well\nmarried, I shall have nothing to wish for.\"\n\nIn a few days Mr. Bingley returned Mr. Bennet's visit, and sat about\nten minutes with him in his library. He had entertained hop","replies":[{"poster":"Daen","date":"2014-12-19T03:21:18.655+0000","up_votes":2,"down_votes":0,"body":"Needs more zombies.","replies":[]},{"poster":"Hyrum Graff","date":"2014-12-19T04:54:32.240+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bear Hat Alice,realm=NA,application-id=bzRrPGQO,discussion-id=OJrAy0YJ,comment-id=000100000001,timestamp=2014-12-19T03:08:53.113+0000)\n> To prove it, I am editing my comment and entering as much of Pride and Prejudice as I can: \n>\n>-sniiiiiiiiiiiip-\n\nYou bring a smile to my face. :)","replies":[]}]},{"poster":"Hyrum Graff","date":"2014-12-18T18:48:42.690+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Elphrihaim,realm=NA,application-id=bzRrPGQO,discussion-id=OJrAy0YJ,comment-id=00010000,timestamp=2014-12-18T05:18:18.907+0000)\n>\n> ...\n> \n> I have to ask, because it will eat at me if I don't--\n> \n> How does this happen?\n> \n> (Not the fact that this bug exists and it was unknown, the bug itself.)\n\nThey used to have that shorter character limit for comments. Most likely, there's one place in their code that specifies the character limit for editing, and a different place that specifies the character limit for posting initially.\n\nOf course, they *should* aim to have a single point of truth (single place they have to change) for that kind of stuff...\n\n######(Just poking fun, Alice, I know it might not make sense, depending on your code base)","replies":[{"poster":"MaliceCity","date":"2014-12-18T22:00:56.083+0000","up_votes":2,"down_votes":0,"body":"There are actually multiple places where the character limit was enforced, and while I thought we got them all I was wrong.\n\nI do not think it is practical for us to abstract the limits to a single source of truth because we have completely different code bases (js, php, java) that rely on them and the overhead and complexity of maintaining that would probably negate any value we gain.","replies":[]}]}]}]},{"poster":"Elphrihaim","date":"2014-12-19T05:36:44.565+0000","up_votes":1,"down_votes":0,"body":"Giggity! :D","replies":[]},{"poster":"Daen","date":"2014-12-18T00:49:28.745+0000","up_votes":1,"down_votes":0,"body":"I've noticed some oddities with the new character limit, and have hit it occasionally even after the changes Riot put out.  Have you confirmed that it's still 4096 regardless of the board and as recently as this week?  This would be a pretty big issue and worth reporting to Riot if so.","replies":[{"poster":"Elphrihaim","date":"2014-12-18T01:48:53.108+0000","up_votes":1,"down_votes":0,"body":"Let it be observed that this post is 10240 characters after you discount the linebreaks.\n\n1234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890","replies":[{"poster":"Elphrihaim","date":"2014-12-18T01:49:53.870+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Elphrihaim,realm=NA,application-id=bzRrPGQO,discussion-id=OJrAy0YJ,comment-id=00000001,timestamp=2014-12-18T01:48:53.108+0000)\n>\n> Let it be observed that this post is 10240 characters after you discount the linebreaks.\n\nAllow it to be stated that I cannot edit this post without reducing it to 4096 or fewer characters.","replies":[]}]},{"poster":"Elphrihaim","date":"2014-12-18T01:47:24.278+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Daen,realm=NA,application-id=bzRrPGQO,discussion-id=OJrAy0YJ,comment-id=0000,timestamp=2014-12-18T00:49:28.745+0000)\n>\n> I've noticed some oddities with the new character limit, and have hit it occasionally even after the changes Riot put out.  \n\nEh. I don't have a lot of trouble hitting a 10240 character limit, I just make sure I don't be as winded.\n\n>Have you confirmed that it's still 4096 regardless of the board and as recently as this week?  \n\nAs recently as **today**.\n\nAnd it's not \"still 4096\"-- when typing a reply (I will demonstrate with spam in another post), it is actually the new 10240-- but if you EDIT a post, it only lets you have 4096 characters (so if you type a reply that's >4096 characters and make a typo, you can't fix it).","replies":[]}]}]}