{"poster":"Coyd3","date":"2015-04-14T20:50:32.067+0000","title":"Comprar RP","subforum":"Problemas Técnicos","up_votes":2,"down_votes":0,"body":"Buenas a todos, Mi pregunta:\r\n\r\n&iquest;Cu&aacute;ndo estar&aacute; disponible la compra de rp nuevamente?\r\n\r\nHe visto que la inhabilitaron pero no dieron fechas de su restauraci&oacute;n, Quiero aprovechar las ofertas de MARTES - VIERNES pero ahora no puedo adquirir nada ya que no puedo cargar RP. Quisiera saber si podre cargar antes de que terminen las ofertas, o si se pudiese extender el periodo, ya que durante estas fechas tal ves no se pueda cargar RP.","replies":[{"poster":"HelHounds","date":"2015-04-15T21:27:00.714+0000","up_votes":1,"down_votes":0,"body":"yo compre rp con movistar y me llego en la factura pero nunca me llego el rp ¬¬","replies":[]},{"poster":"Mr Lemos","date":"2015-04-15T03:58:38.995+0000","up_votes":1,"down_votes":0,"body":"yo sigo esperando el rp que compre hace 3 semanas {{item:3151}}","replies":[]},{"poster":"zhac","date":"2015-04-15T01:21:54.454+0000","up_votes":1,"down_votes":0,"body":"riot ya areglaron el problema del rp con movistar","replies":[]},{"poster":"Chabelo Reloaded","date":"2015-04-14T23:30:13.731+0000","up_votes":1,"down_votes":0,"body":"Ya esta habilitado nuevamente","replies":[{"poster":"Haides","date":"2015-04-17T09:47:18.673+0000","up_votes":1,"down_votes":1,"body":"Realice la compra con Movistar, recibí los mensajes para responder con la palabra clave RIOT3, lo hice y aun no tengo mis Riot Points. Envié Tickets al Soporte de Riot y también a Boku y de parte de ambos solo recibi su respuesta automática a través de mails pero no una respuesta concreta acerca de los Riot Points. Envié varias veces las palabras clave y aun no se acreditaron los Riot Points que ademas luego de enviar la palabra clave tampoco me llego el mensaje de confirmación de parte de Riot y cuando quise intentar nuevamente un nuevo cartel dice, que no puedo porque excede mi presupuesto, pero como si tengo bastante crédito en la linea y ademas luego tire error y que intente mas tarde. Son varias las personas que cargaron con Movistar y aun no recibieron sus Riot Points y el soporte tampoco esta dando una solución concreta a las demandas de los clientes en cuanto a la compra de Riot Points a través del sistemas de sms. Hace unos días le hice una recarga a mi amiga y esta se efectuó correctamente, pero luego del inconveniente que tuvieron con los pagos no se que sucedió pero dado que la situación se arreglo entonces se supone que este tendría que funcionar con normalidad pero aun así sigue de la misma manera. Esta claro que este mensaje no tendrá una respuesta o su respuesta sera claramente corta y con una explicación para dejar satisfecho al cliente en estos casos. Espero que Riot solucione la situación y asuman la responsabilidad ante una situación que se podría considerar fraude si el dinero es extraído de las cuentas de cada linea de los clientes que contratan el servicio de la empresa Movistar y no se realizan las recargas de Riot Points.","replies":[]}]},{"poster":"LilSlam","date":"2015-04-14T23:00:04.353+0000","up_votes":1,"down_votes":0,"body":"ya funciona pero a mi el servicio movil de movistar no me funciona y no se como hacerlo lo eh intentado 3 veces ayuda riot condor PLS {{item:3070}} {{item:3151}} {{champion:32}} \n","replies":[]},{"poster":"Akalistoparatodo","date":"2015-04-14T21:31:45.257+0000","up_votes":1,"down_votes":0,"body":"algun dia","replies":[]},{"poster":"ghost26229975","date":"2015-04-14T21:30:11.311+0000","up_votes":1,"down_votes":0,"body":"cuando riot cuando D: pls {{item:3151}}","replies":[]}]}