{"poster":"LaserDeathBlade","date":"2014-10-30T01:17:12.882+0000","title":"As a Plat 1 Yasuo main with 400+ Yasuo games, Yasuo needs a damn rework.","subforum":"Gameplay","up_votes":823,"down_votes":174,"body":"Plat 1’s not the highest of ELOs, but I have hundreds of games with Yasuo and he is the only champion I really enjoy in League and can play every match without getting bored of - but his current state is cancer and mere numbers changes won’t fix him. \n\nAfter his huge wave of nerfs, Yasuo’s basically lost his identity as a champion because his kit is just unimaginably difficult to balance. He has simultaneously the highest ban-rate AND the lowest win-rate in solo queue because ain't nobody want his ass on their own team, and certainly don't want him on the enemy team either. \n\nI’m supposing that Riot intended to release a very unique melee DPS champion who has a strong balance of offense, defense, and utility - and quite possibly become the first mADC that’s not uber-cancer. But instead his most popular play-style currently across almost every ELO is a LOT like a Japanese version of Fiora where he ults into a team fight, spams everything, and hopes to deal tons of damage before he dies in 2 hits. We already have plenty of cheese-lord melee “baneling” ADCs, we don’t need Yasuo to be another mADC glass cannon with just a slightly different power-spike path.{{champion:11}} {{champion:23}} {{champion:114}} \n\n\n*Here’s my suggestions to change Yasuo:*\n\n* -Remove his double crit. What the hell was the point of it? It makes his power spikes stupid strong and completely inconsistent with any other champion in the game and cancer to play against. It doesn’t really contribute to him thematically (Does have 20 eyes like {{champion:11}} {{champion:24}}  or something?), has no counterplay, limits his build paths, and just seems like a gimick damage steroid that was thrown on to boost his DPS up to match other mADCs, but in the end has cost his kit a LOT in nerfs just to keep.\n\n* -Restore the strength of his shields and his W’s passive but reduce it’s duration. His flow/shields/windwall are what make him unique to other mADCs. \nUnsurprisingly, the “Japanese wind guy with a sword” is a pretty established trope, and for damn good reason: it’s cool as hell and almost makes sense. What DOESN’T make sense is why Riot decided to keep his uber-gimmick crit passive, but nerfed the flow/turbulence system that was central to Yasuo into a gimmick.\nTo add more interactivity with his shield, it should only activate when he faces away from the damage source, and of course when he ults. It’s actually pretty arbitrary what his shield trigger should be, but it sure as hell shouldn’t be “whenever the hell it’s up”. Having it only activate when he turns away kind of fits into his “always on the run” lore, synergies with his dash, has a ton of interactivity, and allows opponents to trade with him when he goes on the offense.\n\n* -His Windwall should drain his  FLOW. Allow it to completely eat the first non-minion projectile, give it a small amount of base health, and allow it to have scaling health based off how much Flow Yasuo has. It doesn’t make sense that Yasuo has to generate his flow to cast his passive shield, but suddenly whips a ton of wind out of his ass-cheeks to cast an indestructible wall of flatulence. Combined with his original Windwall passive, leveling this ability gives him a stronger wall because he generates flow quicker.\n\n* -Remove the damage on his E. Clearly the early game damage on his E for a late-game scaling champion like Yasuo has been a problem for the balance team (Smells like Tristana). His sweeping blade is used for mobility and flow, not everything needs to do damage.\n\n* -Make his ult do more damage and remove the armor pen on it. Like, what was the point of his current ult? Probably the most satisfying thing on Yasuo is flying into the air, screaming wildly, and slamming the enemy team into the ground to do an outrageous amount of damage, but that’s actually NOT what happens with his current ult. Almost all of his current ult’s power lies in the armor pen it gives (why does it even give armor pen?) and its utility. You can’t even Q during his ult anymore, so when he screams and body slams enemies, it actually does a very unsatisfying amount of damage.\n\n\n\n\n\n\n**TL;DR: \n-Make him do less damage because we don't need more {{champion:114}} {{champion:114}} {{champion:114}} {{champion:114}} {{champion:114}} \n-Remove the non-interactive and uncounterable parts of his kit (his stupid crit and armor pen)\n-Remove the gimmicks, reinforce his theme\n-Make him tankier so noob-suos can stop feeding.**\n\n\nUpdate:\nThe main concern seems to be that Yasuo would be lacking damage with these changes, but I don't think this would be the case.\n\nIt's not necessary for Yasuo to remain an Assassin/mADC, actually given his relationship with Riven, it'd make a lot of sense for him to be a fighter. His AA reset with Steel Tempest is already a huge boost to his DPS, something closer to Riven's Q rather than Yi/Trynd. Like Riven, he doesn't need to build a lot of AS, he will max out with only Shiv assuming you have proper runes and masteries, which means he has space for other itemization.\n\nBesides, logically he shouldn't have anywhere near the same amount of damage as pure DPS champions because he has one of the most CC heavy kits in the game.","replies":[{"poster":"Ellphi","date":"2014-10-30T01:27:02.708+0000","up_votes":219,"down_votes":15,"body":"+1 just for the windwall suggestion.","replies":[{"poster":"Rew711","date":"2014-10-30T02:29:48.397+0000","up_votes":176,"down_votes":4,"body":"+1 for the and I quote\n>It doesn’t make sense that Yasuo has to generate his flow to cast his passive shield, but suddenly whips a ton of wind out of his ass-cheeks to cast an indestructible wall of flatulence.\n\nbecause I couldn't stop laughing.","replies":[{"poster":"Featherztorm","date":"2014-10-30T03:02:38.860+0000","up_votes":25,"down_votes":4,"body":"I stopped reading just to recollect myself from all the laughter when I read this.  Great suggestions, though!","replies":[]}]}]},{"poster":"DryJuice","date":"2014-10-30T01:22:55.976+0000","up_votes":113,"down_votes":10,"body":"+1 Was surprised with the thought out arguments","replies":[]},{"poster":"SecretAgentHulk","date":"2014-10-30T02:06:56.963+0000","up_votes":62,"down_votes":3,"body":"I came in expecting to downvote because \"Y U NERF YASUO RITO\", and instead I find myself agreeing with changes that will make him more fun to play against and to play. +1, good sir/madam.","replies":[]},{"poster":"Narasimha","date":"2014-10-30T01:39:08.245+0000","up_votes":17,"down_votes":76,"body":"This... isn't much of a rework. If anything, you're taking away all his power and giving him...nothing solid in return.","replies":[{"poster":"LaserDeathBlade","date":"2014-10-30T01:48:05.171+0000","up_votes":62,"down_votes":6,"body":"On the contrary, I'm suggesting we remove some of his uninteractive strengths and shift his power to more visible and interactive outlets.\n\nAdding damage to his ult activation and taking away his armor pen makes for a bigger splat against squishies but allow tanks to itemize against Yasuo, which is pretty fun for everyone. It also removes the huge pressure for late-game Yasuo to \"ult whatever gets knocked up\" just to get his armor pen as soon as possible - allowing for more strategic gameplay.\n\nRestoring his old shields makes him tankier and more forgiving to play, so teams won't be scared and frantically LoLKing-ing an ally who picks Yasuo in order to decide whether or not to dodge.\n\n\nPerhaps these suggestions may or may not leave him on the weak side, but giving him a healthier and more clearly defined kit is the first step to a better Yasuo","replies":[{"poster":"TheUntitledKing","date":"2014-10-30T02:59:26.210+0000","up_votes":25,"down_votes":1,"body":"Yeah, if I'm correct what you're suggesting is take away damage from vague sources like E and the post R armour pen and localizing it to very identifiable things. The Crit is also vague and gives an incredibly unbalanced power spike (most lategame champs need more than two items to achieve their respective lategames). \n\nOne of the issues with Yasuo I've always had is that he just does too many things and has too much to work with. While that's the key point of a higher skill champion, on Yas it's too much. Right now, he has the same amount of stuff in his kit as he did before the big nerfs, but now they're all weaker across the board. It's better to have identifiable and fewer strengths (three things that each have a 4/5 in power rather than then things ten things that each have a power of 1/5) than vague and multiple mediocrities. He's not combo-oriented, he's not supposed to chain everything like Veigar or Syndra.\n\nHowever, thinking on it the thing that makes Yasuo a lategame mADC is his crit chance. He doesnt have the natural autoattack steroids of {{champion:11}} {{champion:114}} {{champion:24}} , so he can't just build the same as them (AD, AS, Crit) and still be (as) effective. Current Yasuo is pigeonholed into building crit, crit and more crit, with the mandatory Last Whisper after IE/SS. So if you want to remove crit chance (something I'm wholly in favour of because it broadens him as a character and a champion) you'd have to come up with some sort of compensation in damage. I personally don't think I have the experience in either the champion or the game - as much as you at least - to suggest something valid, but perhaps you might consider it?","replies":[]},{"poster":"BranchofSin5580","date":"2014-10-30T14:26:07.890+0000","up_votes":32,"down_votes":10,"body":"What I don't understand is why you, as a Yasuo main, would want this super cool wind Samurai to play like a regular bruiser instead.\n\nRemoving the double crit chance? What would you give him return for that?\n\nYou said you would buff the Shield passive, but then you want him to be unable to pop the shield whenever he is facing the enemy.\n\nHow does that even make sense? You have a stronger shield that only works when you are running away or when you ult? \n\nThen you want his Windwall to have a health bar and scale with Max HP. This already is a nerf by itself. The windwall in its current form is unbreakable and blocks nearly all projectiles.\n\nYou want his E to deal no damage, which honestly, I really don't care as I only use it for lvl 2 cheeses, farm creeps in the lane and to dodge spells in teamfights. Whatever. \n\nBut then you take the free bonus pen he gets from his ult and want to give him bonus damage as compensation for it.\n\nSo you are taking away:\n\n- Double crit chance, something that is a huge part of his kit, you want to take it away and give nothing in return.\n\n- The actual usefullness of his shield, even if it is stronger, it only really pops on his ult and when he is facing away from the enemy, what's the point of him having a shield if the shield is not there when he needs the most?\nEven if it regens faster.\n\n- The Windwall usefullness. Giving it an HP bar, when it is unbreakable in its current form, allowing him to only use the Windwall when his Flow is full, which he might aswell do anyway as the shield you suggested would literally be useless.\n\n- Taking away the damage from his E, whatever, makes last hitting slightly harder.\n\n- The Bonus Armor pen he gets from his ult, sure, you want it to nuke harder in return. Sure, it would allow tankier champs to itemize easier against him, but would that extra damage compensate for all the Bonus Armor pen you would take away from him?\n\nWhat would be the purpose of taking Yasuo over a champion like Riven?\nA champion who matches him in terms of damage and mobility atm.\n\nShe would deal more damage, her defenses would still be better as she only needs to itemize for AD, her R would nuke harder as it scales with %Missing HP and is far easier to hit as it is an huge AoE that doesn't need any setups to be used.\n\nThe only thing Yasuo would have over Riven would be his Windwall, something you would want nerfed.\n\nI don't understand how Yasuo would become more fun that way. \n\nUnless you want to play Bruiser Yasuo, get bullied the fuck out of the lane as you literally deal no damage, still be squishier than any other bruiser and call that shit fun, then call it. I don't see how it is fun but maybe some people find it that way.\n\nThat's not changing his power from A to B or B to A, That's literally just a huge nerf to his damage and a slight buff to his tankiness.","replies":[{"poster":"Frikgeek","date":"2014-10-30T14:47:12.429+0000","up_votes":7,"down_votes":1,"body":"Riven's ult doesn't scale with %HP, at least not in the same way that every other execute does. It gets up to 3x more damage the closer the enemy is to 1/4 of their total HP. It's not like Garen's ult or Elise Q where you actually get more damage if the enemy has more HP. There's no reason you couldn't tweak Yasuo's numbers so that he deals more damage in an average scenario.\nAnd Riven's isn't a melee ADC, she's a bruiser or an assassin, depending on your build. Even without his crit passive yasuo would have to rely on AS and crit scaling for his Q, not just stack AD. His current passive is so ridiculously strong that you are forced to build crit, as it's extremely gold efficient on him, giving him a bit more wiggle room in his build would be a good thing.\nAs for the arpen on his ult, there's no reason he should be nuking tanks as hard as he is. Being able to itemize against him but give him more damage vs squishies would actually force him to pick his targets, not just slash through everyone.","replies":[{"poster":"BranchofSin5580","date":"2014-10-30T15:02:21.307+0000","up_votes":15,"down_votes":3,"body":"I'm not saying Yasuo couldn't use some changes\n\nRiven is neither a Bruiser or an Assassin, she is the AD version of Diana.\n\nThe more Assassin-like you build, the tankier you get as your shield scales with AD.\n\nI'm saying taking away his 2x Crit Chance would literally make him useless. Do you have any idea how his Numbers would have to go through the roof to make up for the loss of such passive?\n\nHis Q would need to deal 4 times as much damage as it does on live. There would be no point in auto attack with Yasuo at that point.\n\nHis Shield would need to regen so fast that he would pretty much have it before it the previous one expired.\n\nHis Windwall would need to have like, 8 seconds cooldown to make up for the HP bar.\n\nHis E, whatever, who cares about his E damage. It's only useful to last hit and dodge stuff.\n\nHis R would literally need to deal 2x damage to make up for all the damage he would be losing it.\n\nHow come people complained about Yasuo destroying Mages for 1 Season when Orianna has been doing the same exact thing for 3/4 seasons now?\n\nHow come people haven't realized how much of a lane bully Xerath is and how unfun it is to play against a champion like that, especially when he scales to late game like a f*cker and can literally throw out a Q every 2 seconds inlane after Unholy Grail?\n\nMakes no sense.","replies":[]}]},{"poster":"BiZeBoY","date":"2014-10-31T08:18:48.845+0000","up_votes":2,"down_votes":3,"body":"you have no imagination it seems, think about lack of double crit chance and hey heres an idea No nerfed crit damage!\n\nhow do you not get the idea of wind on a persons back or that its used when a melee ad caster is breaking away from a trade....\n\nobv windwall is op to block everything... aka why they took away its turret shot blocking ability - so obv it probably needs a better tweak.. bruams ult comes from the ground ya? why should a wind wall block something that comes from the ground...\n\nhe already answered the rest of your questions in his original post stop reiterating questions to be complicated","replies":[{"poster":"BranchofSin5580","date":"2014-10-31T13:50:54.816+0000","up_votes":9,"down_votes":3,"body":"> you have no imagination it seems, think about lack of double crit chance and hey heres an idea No nerfed crit damage!\n\nWOW! No nerfed Crit damage, how kind of you.  With these changes Yasuo wouldn't be building Crit anyway.\n\nHe would get something like a Bork and then go full tank.\n\nI love how people still think Yasuo has a stupid kit when Riven exists.\n\n> how do you not get the idea of wind on a persons back or that its used when a melee ad caster is breaking away from a trade....\n\nHow do you not get the idea of a wind empowered blade just ripping you wide open with 1 strike at the hands of a skilled samurai? \n\nAnd the same wind that is ripping you wide open is also protecting its master?\n\nIt's nice to have something to watch your back when \"breaking away from a trade\", that's why Windwall exists.\n \n> obv windwall is op to block everything... aka why they took away its turret shot blocking ability - so obv it probably needs a better tweak.. bruams ult comes from the ground ya? why should a wind wall block something that comes from the ground...\n\nI think Windwall should be changed to be more of a reactionary thing. That's all, lower cooldown for a lower duration. That's the only change I would do to him.\n\nWindwall only lasts 1 second, any projectiles the windwall consumes will further extend this duration by 1 second, Up to a maximum of 4 seconds.(Doesn't work with minion projectiles or neutral monsters projectiles).\n\nHere, Windwalls counterplay is now at the enemies hand. If they want to keep hitting it, then sure, it's just like the Live version of it, if they don't, then it only lasts 1 second anyway so the enemies shouldn't be getting too annoyed by it.\n\nCooldown lowered to 14/13/12/11/10 seconds.\n\n> he already answered the rest of your questions in his original post stop reiterating questions to be complicated\n\nI am not reiterating questions\n\nI just think Yasuo is balanced and he needs no nerfs or buffs, let alone a rework.\nAs I said, he could use some changes, but nothing major.\n\nHe is fun to play, hits hard and gets hit hard.\n\nHe either gets ahead and goes god mode, like many other champions, Karthus being the most obvious one as you he is an hyper carry with stupid ammounts of damage output that doesn't even care if he dies or not as a Requiem is enough to take over 50% hp of every enemy.\n\nOr he gets shut down and falls behind, something that is a common trait among all assassins.","replies":[]}]},{"poster":"Knight SoIaire ","date":"2014-10-30T18:17:15.525+0000","up_votes":2,"down_votes":1,"body":"its not a regular bruiser (thats the main point of op ) \nyasuo has to lose some dmg but become an agile meele dps isntead of assasin (assasin is the role that riot forced on him with their ballancing, but just like fiora yasuo is not made to be an assasin) \n\nhis dmg has to fall down but he has to get his shield up allowing a skilled yasuo to become naturaly tanky (not a tank class tanky, but he wont get just blown up by a random mage who was passing by) and go full glasscannon reaching the dmg output of an adc  while still having a counterplay and not being tied to the fiora playstyle (unload and hope your dmg is high enough to kill everyone before you die)","replies":[{"poster":"BranchofSin5580","date":"2014-10-30T18:29:55.930+0000","up_votes":12,"down_votes":6,"body":"Maybe it is just me\n\nI feel like Yasuo is a really fun Assassin who has already enough hard matchups as he stands now (Any meele champ will absolutely destroy Yasuo)\n\nI rather have him as an Assassin than as a Bruiser.\n\nWe have enough Bruisers already. \n\nSame with Fiora.\n\nThere is counterplay to his kit, and that counterplay is the exact opposite of Darius.\n\nAgainst Darius you pick Ranged, against Yasuo you pick Meele (or Xerath)\n\nI would hate having this extremely fun to play champ turned into another bruiser because people refuse to adapt their playstyle to his.\n\nNo counterplay my ass.","replies":[{"poster":"Knight SoIaire ","date":"2014-10-30T19:00:29.435+0000","up_votes":2,"down_votes":1,"body":"i dont realy know how to explain this to you \nwhat is an adc? find your own concept ... yasuo has to be a meele version of that (not just some bruiser) \nhis kit is made to work that way already but riot pushed yasuo with numbers to the role of an assasin (and we already concluded by looking at yasuo and fiora that they dont work so well as an assasins)","replies":[{"poster":"BranchofSin5580","date":"2014-10-30T19:12:16.497+0000","up_votes":4,"down_votes":3,"body":"> i dont realy know how to explain this to you \n> what is an adc? find your own concept ... yasuo has to be a meele version of that (not just some bruiser) \n> his kit is made to work that way already but riot pushed yasuo with numbers to the role of an assasin (and we already concluded by looking at yasuo and fiora that they dont work so well as an assasins)\n\nBut why don't they work as Assassins?\n\nThat's the thing\n\nimo they are perfectly fine as Assassins.\n\nThey either murder everyone or they don't murder shit, what's so wrong with that?\n\nWhat's a good Assassin for you? Kha'Zix? someone who either gets fed enough to murder a single target and jump away?\n\nImo, if they want to rework Yasuo, they should keep him as an Assassin.","replies":[{"poster":"Knight SoIaire ","date":"2014-10-30T20:10:08.212+0000","up_votes":1,"down_votes":0,"body":"> But why don't they work as Assassins?\n\nthey dont burst and they dont escape which causes a toxic situation when they either owerwhelm your team because they are ahead enough or die trying, and they have literaly no other options than to attempt that all in \n\n> They either murder everyone or they don't murder shit, what's so wrong with that?\n\nget counter picked= you are out of the game  \nthats one thing \nthe main problem is that their stats decide the game instead of their skill \nfiora cant do anything else than unload, so there is no such a situation where she can cast her ult better or use her w better because the outcome stays the same (almoust) and is always decided by her stats not her playing the game better than enemies\n\nyasuo is slowly pushed into the same role \n\n> imo they are perfectly fine as Assassins.\n\nbesides them lacking some specific characteristics of assasin class \nthey dont deal burst dmg  \nthey cant escape \nthey are made to do diferent things so their kits prove to be flawed when played as assasins ","replies":[{"poster":"BranchofSin5580","date":"2014-10-30T21:18:43.751+0000","up_votes":3,"down_votes":1,"body":"How can you say Yasuo has no burst?\n\nHis Q deals more damage than some champions ultimate.","replies":[{"poster":"Knight SoIaire ","date":"2014-10-31T05:40:53.149+0000","up_votes":1,"down_votes":0,"body":"its not about the amount of damage but the way he deals it \n\nfor instance zed or talon an actual assasins  \nwhen they go for the kill they just unload one combo and help their team with the skills that have lower cooldown \ntheir main kill potential is usualy tied to their ults or high cooldown combos \n- if you have something that is tied to long cooldown and is best used as a combo to kill a squish thenn its burst dmg (mages like syndra and adc like vayne or graves have some too)\n\n\nyasuo on the other hand has noo cooldowns and never runs out of any resource \nhe has no actual combos with his skills and is able to unload for the infinite time  \n- if you can just unload without worrying about running out of something or cooldowns its sustained dmg \n\nand one thing for clarity (i just dont want ppl to misunderstand me) \nchampion with no burst is still able to burst someone down if they have enough dmg (adc spamming his crits is the perfect example, his dmg is so high that enemy gets melted in seconds, but that specific champion is not required to have any bursty combos)","replies":[{"poster":"Sightless66","date":"2014-10-31T06:09:51.203+0000","up_votes":3,"down_votes":1,"body":">their main kill potential is usualy tied to their ults or high cooldown combos\n\n{{champion:121}} \"Wait a minute... I have a low cooldown on my Q, a moderately low one on my W, resets on my E, and very little reliance on my ult for burst. Am I not an assassin now? Do I have to go back to building Tank'zix? NOOOOO.\"\n\n{{champion:84}} \"I'm scared too. I've never had to not be an assassin before. What else can I be? Curse my extremely low cooldowns!\"\n\nAssassins are defined by the need to engage opportunistically, high burst damage, ease in picking off exposed targets and defense primarily in the form of spliperiness and high mobility. That's Yasuo defined. Melee AD carries tend to have strong assassin elements because there isn't any other way for them to function. Long cooldowns and combos are champion-specific balance and design elements. If they're made defensive, then they build defenses and become bruisers. If they have offense and mobility, they use it to instagib people and get out. If they can't do either, they don't get played (see old AD lifesteal tank Sion). You can define melee AD carries as a subclass of assassin.","replies":[{"poster":"Knight SoIaire ","date":"2014-10-31T07:57:21.563+0000","up_votes":1,"down_votes":0,"body":"hence the word \"usualy\" in the sentence\nevery champion differs in design so being insanely specific is hard here  \n\nand yes akali and kha deal sustained dmg despite being assasins, thanks to the stealth and mobility (my personal opinnion is that they should fix akali to rely on some sort of combo that cant be repeated every 5 seconds)\n\njust one little gimmick that i wanted to mention while im at it \n> their main kill potential is usualy tied to their ults or high cooldown combos\n\n-kha zix gets no sht without his ult, no evolutions so yeah his main kill potential is his ult, or rather his entire kill potential because all he relies on are his evolutions \nakali  again cant do sht without her ult- because its her only gapcloser, so no ult = no chance to do anything for her (she can catch bruisers but wont even scratch them without being fed)\nit does not bring anything important to the post \n\n> Melee AD carries tend to have strong assassin elements because there isn't any other way for them to function\n\nthe main gooal riot had when creating yasuo was to give meele the tools he needs to work as meele adc instead of being tied to assasins playstyle ,and well ... they failed so they pushed him ito fiora state because its a stable ground, they knnow where fiora stands while pushinghim to a diferent spot now can cause some big changes right befoire their worlds (they already creid that they cant touch maokai or tristana too hard cause lcs already took them in, so yeah they cant just change yasuos role cause he mmight blow the thing up)\n\ni think that its better for them to go for their goal isntead of making more fiora like champs, because they just dont work so well  (assuming that they are ballanced, assasin without an escape like fiora or yasuo is always weaker in comparison to assasins with escapes )","replies":[{"poster":"Sightless66","date":"2014-10-31T17:09:17.827+0000","up_votes":3,"down_votes":0,"body":"Before I get into this, I want to make my general point clear: The overall motivation for wanting to rework Yasuo isn't bad. Trying to make a non-assassin style melee carry is desirable. However, if you just make it tanky with no scaling damage build options, it turns into a autoattacking bruiser like Xin Zhao. There are possibilites for making a better melee carry, but this specific rework idea has absolutely no chance of accomplishing it. The actual details of this rework are bad. This rework has very little that will make Yasuo work in any way other than a bruiser.\n\n>kha zix gets no sht without his ult, no evolutions so yeah his main kill potential is his ult\n\nKha has his evolutions tied to his abilities. He may get them at level 6 and 11 and 16, but they are in no way tied to his ult for actual fighting purposes. He can get in, murder something and get out without pressing R. He's not ult reliant.\n\nAlso, for his assassin elements, Yasuo is quite reliant on his ult. He uses it to get in and instaburst people. It does that job quite well. He meets your \"ult-reliant\" qualification very well.\n\n>the main gooal riot had when creating yasuo was to give meele the tools he needs to work as meele adc instead of being tied to assasins playstyle\n\nFirst, I don't think that was Riot's goal. Riot has spoken ain the past about how squishy melee champions are always going to tend towards assassin elements because otherwise there isn't any reason to pick them over safer and more consistent ranged carries. If a melee champion is low-burst and squishy but has decent sustained dps, then they have to build tanky instead.\n\nThis isn't even unique to League. In Dota, melee carries tend to build tanky, and they rely on base damages or rewards for fighting for extended periods of time. Damage doesn't rely nearly so much on scaling modifiers there, so it's much easier for them to work building tanky. That isn't an option in League.\n\nSecond, even if that is a viable goal, this rework has no chance to accomplish it. If you have no reward for building scaling damage, there isn't going to be any scaling damage, and if there is no burst, then tankiness is going to be needed. We've seen this exact form of melee carry before. It's called Xin Zhao. Decent tankiness and sustained damage but without any scaling damage item options = bruiser. That is a form of melee carry, but it's not the type Yasuo should be.\n\nThe only way this rework will work with Yasuo still being a melee ADC is if it has a higher straight nuke on the Q and the ult nuke is majorly increased so they can almost instagib squishies. So, if he can assassinate with those, he'll do ok. I don't think that's the goal here though.\n\nLook, I get that you want a melee ADC that isn't assassin-style. That's not a bad idea. However, just making it bruiser style isn't the right way to go, and with no scaling damage options and no burst, that's all you're going to have. There needs to be a real scaling damage option. As much as OP hates them, there is going to have to be a steroid. If there isn't, I'm not going to use him as an autoattacking carry. It's as simple as that. There just won't be any reason to.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"YossarianSensei","date":"2014-10-30T01:32:44.424+0000","up_votes":27,"down_votes":3,"body":"\"Yeah man, Yasuo gets TWICE D CRIT CHANCE but onli does 90% dmg of normal crit! Totally not gimmickey\" -Riot balance team.","replies":[]},{"poster":"Cron0s","date":"2014-10-30T02:09:20.881+0000","up_votes":25,"down_votes":2,"body":"Well thought, well written, and damn well deserved. Great post.","replies":[]},{"poster":"Squeaky Dreemurr","date":"2014-10-30T01:45:42.990+0000","up_votes":20,"down_votes":3,"body":"Bravo.  Yasuo right now is pretty cancerous to play against (particularly with his bizarre double crit chance), and yet situationally weak and gimmicky at the same time.  I love your ideas and reasoning to back them up.  I hope some of the balance guys have a chance to see this post.","replies":[]},{"poster":"Matezoide","date":"2014-10-30T05:03:42.589+0000","up_votes":16,"down_votes":2,"body":"I hate how Riot keeps nerfing the fuck out of Yasuo while leaving his crit chance passive alone.\n\nThey nerfed his E, they nerfed his shield, his W's passive, his base stats...\n\nIt is all pointless. His free stats are the issues at hand, and what makes Yasuo so hated to play against.","replies":[]},{"poster":"Yfrappefort","date":"2014-10-30T02:39:58.891+0000","up_votes":14,"down_votes":1,"body":"+1 for you. I agree with pretty much everything you said.\n\nCurrently, I hate Yasuo. I don't even care that he got nerfed to the ground simply because he is the most cancerous champions I ever got to face since I started playing in 2011. Nobody likes fighting against him. Everything about him is infuriating. He really need that rework.\n\nLike you said, a shift from free stats to more flow things is the way to go. Remove the crit x2. Remove the armor penetration. Buff his ultimate damage. Buff his base stats again. Increase the interaction with his flow. Make players actually choose what they block with wind wall instead of \"her, derp, I'm blocking everything and there is nothing you can do\".\n\nSo yeah overall, just need to improve what makes Yasuo's identity while removing the frustrating aspects about him.","replies":[]},{"poster":"OwlMechanic","date":"2014-10-30T01:38:33.855+0000","up_votes":14,"down_votes":2,"body":"Very nice, I never even thought much about it since I don't yasuo much, but your suggestions make a ton of sense in comparison to how badly his thematic strengths have been nerfed to cater to his lame and random passive damage continued existence.\n\nAs for the shield, I'm not sure if that's the best way to use it but it would definitely give a (walks away from the explosion without looking back) vibe.\n\nI still am not too familiar with how boards rate up things, just by discussion amount? Any sort of +1 thing?","replies":[]},{"poster":"ceaselessphantom","date":"2014-10-30T05:29:52.903+0000","up_votes":6,"down_votes":3,"body":"So if I understand correctly\nyou want to leave his shield and make him scale off health as well as remove all of his damage scaling steroids?\n\n\nYou do realize there is no way he would continue being a melee adc after this right?\n\nAlso you said you did not want another Fiora that just ults in and bursts.  Than you say raise the damage of his ult but remove the bonus armor pen it gives?","replies":[{"poster":"LaserDeathBlade","date":"2014-10-30T07:20:32.512+0000","up_votes":12,"down_votes":3,"body":"Yasuo gets a lot of damage from animation canceling, theoretically he doesn't need to build a lot of attack speed because unlike Trynd/Yi, he can use Steel Tempest to artificially boost his DPS. This in itself is a very strong damage steroid.\n\nI don't necessarily think he needs to remain a melee ADC in the traditional sense (crits + super DPS), but he needs to have the less interactive parts of his kits swapped out because his current balancing sacrifices his champion theme just to keep frustrating elements of his kit around, which is annoying for both the player and the opponent.\n\nI drew the Fiora comparison because she's a mADC that once she commits, she doesn't expect to retreat or reposition - not necessarily because her ult is an insta-gib. Yasuo's original kit was built to be a skirmisher, but at the moment is being played very similarly to Fiora because Riot kept his offensive passives, but gutted his Flow/Shields.\n\nAs for the proposed ult changes on Yasuo, my thought is that by removing the armor pen but boosting the upfront damage, Last Breathe will have a lot more interactivity for both the player and the opponent. Most obviously, doing more damage with such a flashy ability is both expected and celebrated, but perhaps less obvious is: as I mentioned in a post earlier in this thread, when Yasuo hits late game, he's extremely pressured to ult the first safe target he can in a team fight - even if it's a tank because his armor pen is too strong to wait to activate midway through an engagement. This is both frustrating for the player because he can't afford to hold his ult for an opportune moment given how important the armor pen is and how likely he is to die early in the fight - and it's similarly frustrating for the opponent because obviously building 300 armor just to get shredded like a squishy is pretty lame. It's also quite annoying how players are punished even if they avoid Yasuo's ult because if an ally sets off Yasuo's armor pen, anyone Yasuo targets also suffers his armor pen.","replies":[]}]},{"poster":"Rrett","date":"2014-10-30T07:38:27.378+0000","up_votes":9,"down_votes":1,"body":"Make it so his ult triggers on KNockups and not displacements.\n\nNever got that one. Fucking trundle wall give him a dash target. \n\nTo address the win/ban issue, He's just cancerous in general. He's extremely likely to lose you the game, but he's the most annoying champion to play against(my oppinion). He's like morgana mid, just terrible to play against, but you're still going to win the game because they're just terrible for some reason.\n\nHe also lacks counter play. You can say all you want, but a near no cd dash is just stupid in context of current yasuo.\n\nI like all the changes you've presented. My favorite would have to be the shield only when facing the other way mechanic. That would make it so much nicer to play against.\n\nregarding his wind wall though, I'd like if they fixed it so that it doesn't get projected from him. It's really annoying when a spell gets canceled when it was literally touching him.","replies":[]},{"poster":"A Rusty Venture","date":"2014-10-30T03:03:07.620+0000","up_votes":6,"down_votes":0,"body":"I love all of this,especially the idea of his Windwall costing Flow,it not only makes it fair,but also gives Yasuo his own unique resource","replies":[]},{"poster":"KoKoboto","date":"2014-10-30T02:00:10.900+0000","up_votes":6,"down_votes":0,"body":"Exactly, when I saw Yasuo I was all dayum bought him with RP and was gonna main but hes pretty broken and those flow nerfs... if he was more balanced i'd totally play him more!","replies":[]},{"poster":"AkabaneKun","date":"2014-10-30T21:54:16.499+0000","up_votes":6,"down_votes":2,"body":"Yasuo should be a bruiser, samurais dont come off has squishy charcs, but more like ppl that can hold in the battlefield for a while alone, he was suppose to be the WANDERING samurai, but he is a squishy team dependent charc, talk about missing the mark.\n\nTL;DR Yasuo should be a mobility bruiser, with less dmg than other bruiser ofc but more utility and mobility.","replies":[{"poster":"junglerboy16","date":"2014-10-31T00:53:20.745+0000","up_votes":7,"down_votes":1,"body":"This^ Yasuo is a Ronan (rogue samurai) so he should act like one. The way his ult synergizes with certain team comps is really cool and all, but it just doesn't make any sense thematically. The double crit part of his passive is stupid, to put it bluntly. The shield is only broken on him because it lets him be tanky *while having an absurdly high amount of damage*. Take away the double crit and then you can give him back the cool parts of his kit that are fun but not broken. When he first came out, I was amazed at how well designed his kit was (excluding the double crit); every single spell interacted with another spell somehow, Q with ult, E with W, Q with E, and it was all about being mobile and fleeting. They took out the neat bits (kit synergy and self interaction) so they could leave his precious crit modifier. Now his shield has absolutely no connection with his kit anymore the E doesn't give it a bonus based off of your W or anything. If they left these things alone and removed the double crit, as well as the \"any knock up counts for ult\" mechanic, then they could leave his shield strong and he could be more focused on dashing in, Qing in AOE, ulting everyone, and running with it from there. Instead they left the sick part of his kit, the part that isn't fun and interactive, just feast or famine DPS. \n\nRiot, please make Yasuo what he was supposed to be.","replies":[{"poster":"Watch9","date":"2014-10-31T01:21:36.033+0000","up_votes":1,"down_votes":8,"body":"Your still excluding the other extremely unbalanced champions in the game. For example Jax, many people here can argue that he is broken and needs to be nerfed and cattled like Rengar. Jax is OP because thats how he was when he was released. Yasuo is OP because thats how he came to be released. Are you implying that Riot gives no shits about OP champions? Riot doesn't know the strengths of every champion when they are released, and they can't just completely eradicate him just after people are happy with it.","replies":[{"poster":"junglerboy16","date":"2014-10-31T01:24:43.228+0000","up_votes":6,"down_votes":0,"body":"Uh, no. I suggested changes that I thought could help him, I didn't say anything about him being the only OP/Broken champ in the game (Far from it). I am only talking about Yasuo here because it is a Yasuo thread; if it were a Jax thread, I would talk about Jax. It is called *staying on topic*.","replies":[]}]}]}]},{"poster":"Navarune","date":"2014-10-30T02:42:06.813+0000","up_votes":7,"down_votes":1,"body":"Some really good points here.\n\n> *Here’s my suggestions to change Yasuo:*\n> \n> -Remove his double crit.\n\nI wholeheartedly agree that this is probably the worst aspect of his kit to balance around presently. This means a *single item* is automatically drastically increased in value without any input or decision making from the player (other than picking an item with reasonable crit chance) and has zero counterplay.\n \n> To add more interactivity with his shield, it should only activate when he faces away from the damage source, and of course when he ults. \n\nWhile I certainly like this idea tying in to his theme, I could see activating this during the middle of a teamfight getting pretty difficult. I honestly don't see a problem with it activating automatically as is.\n\n> * -His Windwall should drain his  FLOW. Allow it to completely eat the first non-minion projectile, give it a small amount of base health, and allow it to have scaling health based off how much Flow Yasuo has. It doesn’t make sense that Yasuo has to generate his flow to cast his passive shield, but suddenly whips a ton of wind out of his ass-cheeks to cast an indestructible wall of flatulence. Combined with his original Windwall passive, leveling this ability gives him a stronger wall because he generates flow quicker.\n\nTHIS. ALL OF THIS. PLEASE!\n\n\n> * -Make his ult do more damage and remove the armor pen on it. Like, what was the point of his current ult? Probably the most satisfying thing on Yasuo is flying into the air, screaming wildly, and slamming the enemy team into the ground to do an outrageous amount of damage, but that’s actually NOT what happens with his current ult. Almost all of his current ult’s power lies in the armor pen it gives (why does it even give armor pen?) and its utility. You can’t even Q during his ult anymore, so when he screams and body slams enemies, it actually does a very unsatisfying amount of damage.\n\nHigher damage while removing the passive armor penetration is a step in the right direction, but I don't think it goes far enough. This change still ignores the fact that Yasuo's ult has a *tremendous amount of CC* that cannot be cleansed. I would be satisfied if his damage is left as is, the armor pen removed, and add a passive effect that activates and *doubles* his shield amount while maintaining its current duration upon ult activation.","replies":[]},{"poster":"H3llion","date":"2016-01-10T20:49:39.276+0000","up_votes":5,"down_votes":0,"body":"I stand in awe of this well thought out and reasonable post. Dear Riot plz consider or at least acknowledge this.","replies":[]},{"poster":"mákku","date":"2014-10-30T10:31:42.276+0000","up_votes":5,"down_votes":0,"body":"> I’m supposing that Riot intended to release a very unique melee DPS champion who has a strong balance of offense, defense, and utility - and quite possibly become the first mADC that’s not uber-cancer.\n\nI'm starting to think people are interpreting way too much into what happens in the design process of a champion, especially how much thought is really put into champion identities, strengths & weaknesses.\n\nAt the end of the day, Yasuo is just a CertainlyT champion, and most if not all of them have these things in common:\n\n- Stupidly absurd kits that do about everything in the game\n- Free stats everywhere\n- Weaknesses usually limited to something along the lines of \"low base HP\"\n\nThese things lead to them 'breaking the game' at release, which makes them sell well (that's a plus I guess) but also cause huge troubles for the people that then have to clean up the mess afterwards. As you already identified, number adjustment nerfs just don't cut it, a rework is needed. But quite frankly, that's the case for most CertainlyT champions.","replies":[]},{"poster":"DadimPregnant","date":"2014-10-30T01:48:56.664+0000","up_votes":7,"down_votes":2,"body":"LOVE THE WINDWALL THOUGHT","replies":[]},{"poster":"The Queen Viper","date":"2014-10-30T15:26:06.377+0000","up_votes":2,"down_votes":7,"body":"... meanwhile XiaoWeiXiao plays him just fine.\n\nhttp://www.youtube.com/watch?v=F3GQxtMWhQM","replies":[{"poster":"Stars Shaper","date":"2014-10-30T15:28:54.661+0000","up_votes":5,"down_votes":0,"body":"> ... meanwhile XiaoWeiXiao plays him just fine.\n\nAnd while this is an extreme case of \"outplay\" (and this is what happened each time a Yasuo performed well in professional play) you will still find self acclaimed pros that will just state that Yasuo is OP.","replies":[]}]},{"poster":"FizzOnMyJayce123","date":"2015-01-26T18:03:58.630+0000","up_votes":4,"down_votes":0,"body":"I completely agree with this argument, but i'm commenting because in the wind wall section when you said \"suddenly whips a ton of wind out of his ass-cheeks\" made me laugh too damn hard xD","replies":[]},{"poster":"Zoukeeper","date":"2014-10-31T01:49:25.012+0000","up_votes":1,"down_votes":0,"body":"How is crit not thematically fitting for a samurai? \n\nAnyways, I have no idea how Yasuo is supposed to do any damage whatsoever without some sort of auto attack steroid, which pretty much every carry has in some form or another.\n\nJust to throw out some ideas, What if he had a steroid attached to his ultimate, either by passively ranking it up, or by the actual activation of it? Granted there are problems with both of these approaches (passively ranking it makes Yasuo feel like a ball of stats, and relying on the activation for the steroid doesn't solve the current problem of ulting off the first knock up with no thought whatsoever)\n\nThere are probably better ways to give him a proper non-cancer steroid but this is the best I've got so far\n\nOtherwise I love the windwall idea and the ult change +1\n\nAgain, just throwing out ideas","replies":[{"poster":"Sire Hippington","date":"2014-10-31T12:41:21.553+0000","up_votes":4,"down_votes":0,"body":"how is crit not fitting?\nThe Samurai way of fighting is about studing ur enemy(well, anyone with a brain does that, no matter if boxing, western swordfighting or whatever), and most of all agillity+precision.\nThey wait for an opening and strike with **calculated** precision.\n\nCrits however are not calculated and also don't resolve from studiing ur enemy as they ocure randomly.\nCrits fit to a champ like tryn, just brawling down his foes with bruteforce, pressuring till he gets an random opening in defense.\n\nYasous stacking up Q+E give the feeling of studiing ur foe and dacing around till u find an opening really well, and the massive burstspike from q-knockup into ult fits a precies calculated hit once u find an opening.\neverything besides the crit perfectly cuntributes to that way of fighting.","replies":[]}]},{"poster":"Kat  Head","date":"2014-10-30T03:09:41.404+0000","up_votes":4,"down_votes":0,"body":"Fantastic read op.\n\n1 Kat Head for you, Enjoy !{{champion:55}}","replies":[]},{"poster":"Lord Of Forest","date":"2016-05-07T05:30:57.292+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"IronwallJackson","date":"2016-05-07T05:57:12.557+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Lord Of Forest,realm=NA,application-id=3ErqAdtq,discussion-id=lBkYPFEW,comment-id=00f9,timestamp=2016-05-07T05:30:57.292+0000)\n>\n> But this is the way how RIOT make new heroes. :D\n\nWhat the hell are you doing necro-ing a year old thread? Get outta here man.","replies":[]}]}]}