{"poster":"OVGU Calivia","date":"2018-09-24T12:47:33.853+0000","title":"Bronze Bravery Turnier","subforum":"Turniere & Veranstaltungen","up_votes":2,"down_votes":0,"body":"Es geht richtig los!\n\n❗** BRONZE BRAVERY TURNIER** ❗\n\nAm 29.09.2018 um 18 Uhr startet unser Bronze Bravery Turnier!\n\n**Was passiert bei dem Bronze Bravery Turnier?**\n\nJetzt eskalieren wir komplett !\nIn wochenlanger Absprache mit Riot haben wir es nun geschafft ein 2 t&auml;giges Bronze Bravery Turnier auf die Beine zu stellen.\nWer nicht wei&szlig;, was Bronze Bravery ist, hier ein Link:\nhttps://www.bronze-bravery.com/Home/Rules\n\n80 Teilnehmer sind erwartet.\nF&uuml;r weitere Informationen k&ouml;nnt ihr einfach das Event auf Battlefy angucken und euch auch dort registrieren:\nhttps://battlefy.com/404-multigaming/404-bronze-bravery/5ba523c67525f605a153be72/info?infoTab=details\n\n**Wo melde ich mich bei Fragen oder zur Anmeldung?**\n\nDa wir dieses mal von Riot gesponsored werden l&auml;uft die Anmeldung f&uuml;r die Preise auch &uuml;ber die Eventseite von Riot:\nhttps://events.euw.leagueoflegends.com/events/352483\n\nIhr k&ouml;nnt euch sowohl als ganze Teams als auch als Einzelspieler anmelden.\nDenkt daran, dass ihr euch wirklich auf Battlefy und auf der Eventseite von Riot f&uuml;r das Turnier anmeldet, da ihr sonst nicht an der Preisvergabe teilnehmen k&ouml;nnten, oder gar nicht erst in den Teams auftaucht.\n\nBei Fragen schreibt mir einfach einen Kommentar oder Added einen unsere Manager ingame: 404 Calivia, 404 Storm oder 404 Shura.\n\n**Anmeldeschluss** : L&auml;uft &uuml;ber die Riot Website.\n\nWir freuen uns &uuml;ber zahlreiche Teilnehmer/Teams, die fair gegeneinander um den Sieg k&auml;mpfen wollen!\n\nEuer 404 Eventmanagment","replies":[{"poster":"i own hookers","date":"2018-09-24T14:04:44.557+0000","up_votes":2,"down_votes":0,"body":"Finde ich eine geile Sache. Bei einem Bronze Bravery wird viel Personal benötigt, damit es nicht möglich ist zu betrügen (Build-Reihenfolge usw.). Da stellt ihr euch vor eine grosse Herausforderung. Gibt es Livestream?\n\nViel Erfolg auf jeden Fall!","replies":[{"poster":"OVGU Calivia","date":"2018-09-24T15:05:33.891+0000","up_votes":1,"down_votes":0,"body":"Hey,\nJa wir wissen dass es viele Probleme geben kann aber wir vertrauen da auch ein Stück weit auf die Ehrlichkeit der Spieler. Sind aber ein Team von 7 Leuten und können demnach fast alle Spiele zugucken. \nJa wir werden das Turnier zumindest im Halbfinale und Finale über unseren Hauptkanal casten: https://www.twitch.tv/404_multigaming\n\nDankeschön !","replies":[]}]},{"poster":"Sakuritou","date":"2018-09-27T10:21:53.960+0000","up_votes":1,"down_votes":0,"body":"Der Event Page Link funktioniert nicht. Just saying :)","replies":[{"poster":"OVGU Calivia","date":"2018-09-27T12:45:02.545+0000","up_votes":1,"down_votes":0,"body":"Versuch ihn mal zu Copy & Pasten :)\nDann geht es meist. Die Weiterleitung funktioniert nur ab und zu nicht.. \nWarum habe ich auch noch nicht rausgefunden \nBei einigen geht es ohne Probleme und andere haben immer einen Weiterleitungsfehler","replies":[]}]},{"poster":"Sirrkas","date":"2018-09-27T12:28:32.668+0000","up_votes":1,"down_votes":0,"body":"Eigentlich heißt es ja Ultimate Bravery. Bronzebravery wurde es genannt, als die Youtuber Ultimate Bravery auf Bronzeaccounts gemacht haben. Da kommt dann etwas wie Fulltank Graves dabei raus, der in Bronze dennoch carriet, da der Spieler eben deutlich besser als Bronze ist.","replies":[{"poster":"OVGU Calivia","date":"2018-09-27T12:43:57.090+0000","up_votes":1,"down_votes":0,"body":"Ultimate Bravery ist genau die selbe Seite wie Bronze Bravery nur dass die Bronze Bravery Seite komplett auf Deutsch ist :D","replies":[]}]}]}