{"poster":"OVGU Calivia","date":"2019-03-07T19:02:09.037+0000","title":"404 rekrutiert wieder","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Seid Ihr auf der Suche nach einer League of Legends Community, einem eSports Team oder einfach ein paar Leuten zum zocken? \nDann seid Ihr bei uns genau richtig!\n\nAber wer sind wir eigentlich?\n\nWir sind 404 Multigaming, ein eSports Verein aus Dresden mit angeschlossener Community. Aktuell haben wir 200 aktive Community Mitglieder, von denen ca. 20 auch Vereinsmitglieder sind.\n\nWie der Name schon sagt, spielen wir nicht nur League of Legends, sondern auch andere Spiele z.B. Overwatch, Fortnite, CS:GO uvm.  Im Moment sind wir dabei, unsere Teams auszubauen und generell frischen Wind rein zu bringen. Und genau dafür suchen wir DICH! Wenn Du also auf der Suche nach einem Team/ einer Community bist und Dir unsere Beschreibung gefällt, dann bewirb dich doch bei den unten stehenden Links. \n\nWas bieten wir euch?\n-\tEine Homepage die sich stets weiterentwickelt und verbessert \n-\tEine große Community welche sich über viele Spiele erstreckt. \n-\tEinen TS3 Server und Whatsappgruppen zur besseren Kommunikation\n-\tÜber 7 Jahre Erfahrung im Bereich Community-Management\n-\tAusgebaute Strukturen und Erfahrung im eSport\n-\tAngenehmes und freundliches Miteinander\n-\tUnterstützung von Streamern und Youtubern\n-\tInterne Events\n-\t\nWas du mitbringen solltest:\n-\tMindestalter 12 Jahre\n-\tKommunikationsbereitschaft und Interesse am Teamplay (TS3+Headset)\n-\tEin freundliches und angenehmes Miteinander ist bei uns Pflicht, Flamer wollen wir nicht haben \n\nWas verfolgen wir für Ziele?\n-\tBis Ende des Jahres die Overwatch Abteilung auf 20 aktive Mitglieder ausbauen\n-\tBis Mitte 2020 \no\tAktive Mitglieder in der Abteilung: 50\no\tein eSports Team für die Overwatch-Open Division stellen\n-\tWeiterhin League of Legends, und CS Teams in Community und Pro-Bereich ausbauen.\n\nHomepage: https://404-multigaming.com/\nBewerbungen: https://404-multigaming.com/anlaufstelle/\nTS: ts.404-multigaming.com","replies":[]}