{"poster":"Caponimo","date":"2018-09-07T15:39:15.575+0000","title":"Vayne, tryndamere con rango","subforum":"Jugabilidad, balance y narrativa","up_votes":10,"down_votes":10,"body":"Despu&eacute;s de jugar numerosas partidas por fin llegue al final de mi deliberaci&oacute;n sobre .\r\nVayne, es un campe&oacute;n cuyo set de habilidades encuentro totalmente irritante y molesto. Cada vez que juego contra este campe&oacute;n siento algo morir dentro de mi, porque, a diferencia de  o , Vayne es un personaje que no requiere mucha habilidad para jugar y es altamente injusto, ac&aacute; esta el porque:\r\n\r\n-Vayne no tiene un solo skillshot, esto significa que todas sus habilidades no pueden ser erradas de forma que el esquivarlas esta fuera de cuestion.\r\n-Es un Adc que no solo destroza tanques con su da&ntilde;o % verdadero, sino que encima one shootea a los dem&aacute;s adcs, es uno o lo otro papa, no las dos cosas.\r\n\r\n-Vayne puede, como se dice en ingles &quot;Outplay you&quot;, pero el problema es que vos no podes hacerle lo mismo. El hecho de que se haga invisible cada dos segundos y evite todo tipo de da&ntilde;o de b&aacute;sicos y que si sos un melee te pueda empujar con su E es una estupidez, en el peor de los casos es un displacement y en el mejor un displacement+stun. Esto hace que tanto como melee y como adc sea imposible jugarle. Tampoco podes esquivar sus habilidades as&iacute; que nada de plays coreanas cagandole la rotaci&oacute;n de hechizos con un flash o un dash. La &uacute;nica debilidad que tiene es el mid game, en mi opini&oacute;n.\r\n\r\n-Vayne ni siquiera tiene un mal early. Con todo el peel que otorgan los supps y el alto sustain de las nuevas runas,  es imparable. Con Fleet Footwork Vayne tiene el sustain que no deber&iacute;a tener en linea, haci&eacute;ndola inmune al poke de otros adcs (Su supuesta debilidad), y al tener la pasiva de la W se viola al otro supp. Ni hablemos de su Q ni de si MS extra. Se coje al adc enemigo tambien. 550 de rango no es poco.\r\n\r\n-Vayne recibe una cantidad de oro en stats que da asco. A lvl 1 su pasiva le da 30ms al dirigirse a un enemigo, eso son unas botas a lvl 1 man, no solo te tira la Q que esta en un cooldown de 2 segundos(si te pega, que es siempre) y se te acerca sino que tambi&eacute;n es mas r&aacute;pida que tu champ. Su Q hace que de un dash y su siguiente ataque basico haga da&ntilde;o extra, pero el problema es que al activar la ulti, esta habilidad no solo le permite hacer eso, si no que la hace invisible. En un 1vs1, una team fight va a violar a todos porque nadie la va a poder CCar.","replies":[{"poster":"fenixerege","date":"2018-09-07T16:00:50.215+0000","up_votes":3,"down_votes":1,"body":"claro ahora explicame como la pasa en early segun vos no tiene debilidades ???......\ny otra mas porque tiene {{champion:67}} la estadistica mas alta de todos los ADC's de perder la primera torre siempre en bot ???.....\ny ademas porque solo brilla en late ???? sera champ de late exclusivo ???\ny ademas si hay 1 rengar del otro lado decime como se salva si ya uso su R ???? por mencionarte 1 solo insta deleteador\nsiempre fue un champ fuerte pero jugalo y trata de huir de un {{champion:238}} \ndecime como le va contra {{champion:51}} si pensas que te va a dejar dar ultimos golpes sin aprovechar su rango ??\nhacete invisible y esquiva la R de {{champion:21}} ??? se hace invisible y no le pueden hacer daño ???\nsi te aparece un {{champion:35}} por atras y de los buenos decime como te sacas de encima ese primer golpe de los main {{champion:35}} ???\n\ndecime sabes hacer counter champion en eleccion de campeones ???? respondeme esto antes de todo lo demas ..........","replies":[{"poster":"Caponimo","date":"2018-09-07T16:51:35.530+0000","up_votes":3,"down_votes":2,"body":"No podes justificar cancer con cancer. Es un circulo. Como zed te emte R+Basico y  te mata, vayne tiene que mirarte y matarte. No esta bien. Es como el hecho de que lulu es fragil para que puedas matarla antes de que te tire el CC solo porque ese CC dura un monton, ergo, moriste. Con la Q esquivas a mf, y con el dps que tenes, que parece burst, la bolas enseguida. Te concedo a Shaco y a cait, pero shaco es un sidita(Q a traves de la pared y listo, moriste. Eso se aplica a cualquier cham igual.) y cait esta debil la mayoria del tiempo.","replies":[{"poster":"Phaedra","date":"2018-09-07T18:03:33.989+0000","up_votes":3,"down_votes":0,"body":"Te estas quejando de un campeon que ni siquiera es god tier. Vayne es un adc fuerte, y en buenas manos puede carrear. Rota esta MF que te mata de una Q...","replies":[{"poster":"Caponimo","date":"2018-09-07T18:46:26.904+0000","up_votes":1,"down_votes":3,"body":"Rotas estan las dos, como dice arriba no justifiques un mal con otro.","replies":[]}]}]},{"poster":"TheSilverCross","date":"2018-09-07T16:12:21.980+0000","up_votes":1,"down_votes":0,"body":"Puede parecer exagerado, pero el otro dia jugando un blind, un rengar aliado mató 23 veces a una Vayne, se guardaba las últis para matarla solo a ella, recuerdo que me sorprendió mucho que ella ni se quejó.","replies":[]}]},{"poster":"Phaedra","date":"2018-09-07T15:59:09.918+0000","up_votes":4,"down_votes":1,"body":"Pero mi amigo, entonces por que mo jugas vayne y subis a challenger siendo OTP?","replies":[{"poster":"Caponimo","date":"2018-09-07T16:52:22.759+0000","up_votes":2,"down_votes":4,"body":"Porque no me da la Ea para comprarla, ademas, si me estoy quejando no voy a ser un sorete e ir a jugarla despues.","replies":[]}]},{"poster":"EpicHit","date":"2018-09-07T15:56:21.804+0000","up_votes":2,"down_votes":0,"body":"Vayne es Yi con ballesta xd","replies":[]},{"poster":"Avant Garde","date":"2018-09-07T16:52:37.008+0000","up_votes":3,"down_votes":1,"body":"...\" Vayne es un personaje que no requiere mucha habilidad para jugar y es altamente injusto\"...\n[](https://www.youtube.com/watch?v=f9G8mu6rCpI)","replies":[]},{"poster":"Doca","date":"2018-09-07T16:10:08.728+0000","up_votes":1,"down_votes":1,"body":"Discrepo en todo lo que decís en este post y es más, pienso lo contrario, ósea lo opuesto a lo que escribís acá. Vayne es mala en casi todas las fases de la partida (sólo es Dios en late game). Podemos decir que no tiene a skil shoot, pero al tener tan poco rango, tenes que tener un excelente posicionamiento. El resto de que outplayea a los mele y a los adc... que queres que te diga, una cait o un un mundo se la viola, o mismo una kaisa. Yo la he jugado algunas veces y la verdad es que no me termina de convencer, prefiero jugar una jinx o tristana que le sacó más jugo","replies":[{"poster":"Caponimo","date":"2018-09-07T16:48:24.285+0000","up_votes":2,"down_votes":2,"body":"No tiene poco rango. Cait en un adc cuya funcion es abusar de otros adc, sin embargo, decime como te pokea cait a basicos todo el tiempo sin que la castigue el supp. El basico de cait es el rango de una habilidad cualquiera.\nEdit: a lvl 3 la pasiva de la W te hace 4% de tu vida maxima + 50 de daño verdadero. Su E te empuja 475 unidades que sirve para sacar de encima al supp, o stunear al adc con facilidad durante 1,5 sec. No tendria problemas con vayne si no fuera por su W que a rango 5 te hace 14% de tu vida maxima como daño verdadero, y la E. Una habilidad asi de fuerte tiene que ser por lo menos un skillshot.","replies":[{"poster":"Doca","date":"2018-09-07T22:01:42.368+0000","up_votes":1,"down_votes":0,"body":"mira, te voy a mostar los numeros. actualmente vayne tiene un 49,80% de win rate y esta en la posicion N 12 en la bot lane. Un ejemplo de un campeon roto es quinn, que es un adc asesino y tenia casi un 0% de counter play, llegaba con la R, basico, E, basico y PUM muerto, nisiquiera te tiraba la Q, luego iba  a mid, top y jg y te hacia lo mismo, las partidas duraban menos de 30 min, ademas que es un campeon que la podes llebar a 4 de las 5 posiciones que hay en el juego. ESO SI ESTABA O ESTA ROTO\n\n\npero bue, pensa lo que quieras, y si esta roto, sacale jugo y espero que llegues a chalenger. Hace decuenta que sos un mini tyler1 con draven (en este caso seria vayne ;D)","replies":[{"poster":"Caponimo","date":"2018-09-08T20:30:17.182+0000","up_votes":1,"down_votes":0,"body":"49,8 de winrate es un montón para un champ que la gente dice que es difícil de jugar. Imagínate si azir tuviera ese winrate. Además, me da un asco jugar adc, literal solo tenes que saber in poco de posicionamiento y tener un mouse y ya estas","replies":[]}]}]}]},{"poster":"Main Cocina S3","date":"2018-09-08T02:27:10.209+0000","up_votes":1,"down_votes":0,"body":"la unica solucion es el ban","replies":[]},{"poster":"CyberZoe 2077","date":"2018-09-08T00:34:11.412+0000","up_votes":1,"down_votes":0,"body":"Con vayne te tiras el ulti y dices ''soy dios, pego clicks derechos'' \n\nPD; Si cuando juegas vayne te crees el mas chulo del barrio el daño te sube y llegaras pronto a tu promo a plata IV despues de 930 partidas","replies":[]},{"poster":"vicente4157","date":"2018-09-07T19:00:35.322+0000","up_votes":1,"down_votes":0,"body":"Casi siempre me pasa que mi bot aliado deja a la vayne enemiga 0/10 en ranked y al late se los deletea a todos, es feo","replies":[]},{"poster":"TheSilverCross","date":"2018-09-07T15:52:58.019+0000","up_votes":1,"down_votes":0,"body":"> Cada vez que juego contra este campeón siento algo morir dentro de mi\n\nAsí es como me siento cada que veo una Lux, aunque claro, hacer counter a Lux es relativamente \"sencillo\" porque depende completamente de sus skillshots, entiendo que tiene que dar la q para hacer su máximo daño, pero así y todo me resulta una habilidad muy molesta. ","replies":[]}]}