{"poster":"Sulbatamol","date":"2016-10-02T03:24:31.256+0000","title":"How riot games abuse its heavy users","subforum":"Miscellaneous","up_votes":1,"down_votes":2,"body":"Yesterday I spend approx 4000 for hextech crafting and ended getting a couple of wards, skins and an artist poro icon that not many ppl in dis server own. However, this experience makes me ponder why hextech still throws out a bunch of champion fragements for people who already own all champs in its game. There goes my idea - hextech is bs in a sense that rito tries to steal more money out of its heavy users who are likely to spend more money for league of addicts. I got some nice sets of skins from hextech such as project soraka and challenger nid for free, but there is no need for spending rp in hextech if  you are heavy users. This is because it is unlikely to benefit you as you are more likely to get things you already own in comparison to light users ; i got weather girl janna fragment which I alrwady own. Therefore, do not spend rp for hextech if u r heavy users as there are better ways to spend rp in dis game as riot does decent bundle sales and star guardians coming soon to league. Anyway, it is very disappointing that rito deems its royal customets to be meer dollar in the air and fuk u rito and ur marketing department...!","replies":[{"poster":"AshenOCE","date":"2016-10-06T04:37:26.621+0000","up_votes":1,"down_votes":0,"body":"Something that is called Self discipline. Or Self control. It is a vital skill in the world. When you press the buy button you acknowledge the fact that this is chance. Some people have better chances and some have worse. It is random. You should have the self control to be able to not click that button if you cannot handle the fact that you might get unlucky.","replies":[]},{"poster":"CHEESYLEEKS","date":"2016-10-02T06:28:36.619+0000","up_votes":1,"down_votes":0,"body":"take 3 of those champ shards, reroll when new champs come out, never have to purchase new champs again.","replies":[{"poster":"Essembie","date":"2016-10-02T06:50:28.936+0000","up_votes":1,"down_votes":0,"body":"Actually thats not bad. Champ shard costs ~1700 IP, 3 of them cost 5,100 IP. New champ costs ~6300IP.\n\nLets see how long it takes for them to plug that hole. Better buy a sh!t load of champ sharts right now.","replies":[{"poster":"CHEESYLEEKS","date":"2016-10-02T06:53:34.341+0000","up_votes":1,"down_votes":0,"body":"Well when they come out they are usually 7800 arn't they?","replies":[{"poster":"Essembie","date":"2016-10-02T07:06:38.022+0000","up_votes":1,"down_votes":0,"body":"good point. Even greater savings.\n\nShh - dont tell the reds.","replies":[{"poster":"Essembie","date":"2016-10-05T09:17:04.526+0000","up_votes":1,"down_votes":0,"body":"did it. re-rolled 3 for ivern.","replies":[]}]}]},{"poster":"Talon12","date":"2016-10-02T10:23:43.464+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Essembie,realm=OCE,application-id=Ntey9fRZ,discussion-id=EUUXwZ5L,comment-id=00010000,timestamp=2016-10-02T06:50:28.936+0000)\n>\n> Actually thats not bad. Champ shard costs ~1700 IP, 3 of them cost 5,100 IP. New champ costs ~6300IP.\n> \n> Lets see how long it takes for them to plug that hole. Better buy a sh!t load of champ sharts right now.\n\nits cheaper than a 6300 because its not that high chance you will get the champ you want, let alone a 6300","replies":[]}]}]},{"poster":"Sneed","date":"2016-10-03T04:39:03.621+0000","up_votes":1,"down_votes":0,"body":"implying its riots fault that u spend money on hextech","replies":[{"poster":"AshenOCE","date":"2016-10-03T04:44:34.357+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mesprit,realm=OCE,application-id=Ntey9fRZ,discussion-id=EUUXwZ5L,comment-id=0003,timestamp=2016-10-03T04:39:03.621+0000)\n>\n> implying its riots fault that u spend money on hextech\n\nExactly, dont spend money if u cant handle the consequences","replies":[{"poster":"Sulbatamol","date":"2016-10-04T09:03:26.457+0000","up_votes":1,"down_votes":0,"body":"Implying its always people's faults, when people get addicted into alcoholism, gambling, illegal drugs and smoking. Why if those things dont exist in the first place, and what if system effectively prevent people from getting into those from very beginnig?","replies":[]}]}]},{"poster":"Essembie","date":"2016-10-02T03:36:14.756+0000","up_votes":1,"down_votes":0,"body":"I do think it is a bit weird giving champ sharts to folks who own all champs.","replies":[{"poster":"Amaryliss","date":"2016-10-02T07:55:24.466+0000","up_votes":1,"down_votes":0,"body":"Might be so that people can disenchant those shards for lvl6/7 masteries","replies":[{"poster":"Essembie","date":"2016-10-02T08:12:46.123+0000","up_votes":1,"down_votes":0,"body":"the thing is tho, you've got a ~1/130 chance of getting the shard for the champ you want to get 7 mastery on.\n\nI've got 19 shards on champs I have no interested in upping the mastery on, and 2 mastery tokens on 8 of my regularly used champs that I never get shards on, sooooo.....","replies":[{"poster":"Amaryliss","date":"2016-10-02T08:17:51.059+0000","up_votes":1,"down_votes":0,"body":"Note that I said disenchant lol, for the essence...:P","replies":[{"poster":"Essembie","date":"2016-10-02T12:08:28.631+0000","up_votes":1,"down_votes":0,"body":"indeed.","replies":[]}]},{"poster":"Talon12","date":"2016-10-02T10:22:39.502+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Essembie,realm=OCE,application-id=Ntey9fRZ,discussion-id=EUUXwZ5L,comment-id=000000000000,timestamp=2016-10-02T08:12:46.123+0000)\n>\n> the thing is tho, you&#x27;ve got a ~1/130 chance of getting the shard for the champ you want to get 7 mastery on.\n> \n> I&#x27;ve got 19 shards on champs I have no interested in upping the mastery on, and 2 mastery tokens on 8 of my regularly used champs that I never get shards on, sooooo.....\n\nyou dont need a shard for the champ you want. just disenchant and use.","replies":[]}]}]}]},{"poster":"Talon12","date":"2016-10-02T10:21:24.252+0000","up_votes":1,"down_votes":0,"body":"When did riot release a drug? I wanna see the people who OD'd on it","replies":[]}]}