{"poster":"Nandogeno","date":"2016-02-14T03:27:27.323+0000","title":"Carta de Agradecimiento a Riot","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"Buenas:\nEsperando que no sea muy tarde ya para escribir esto, escribo este post para nada m&aacute;s agradecer de todo coraz&oacute;n a toda la gente de Riot Games por la creaci&oacute;n de un personaje tan interesante y fascinante como {{champion:202}} Jhin. Confieso que he visto varias veces el video, y tengo que admitir que me encanta su m&uacute;sica de campe&oacute;n. Pero lo que m&aacute;s me gusta de &eacute;l, y en esto quiero extender mis agradecimientos en particular a el equipo de Doblaje Latino, por la voz que le dieron en la traducci&oacute;n latina. Este es uno de los casos en que el doblaje, a mi humilde parecer, supera en creces al original. Mientras que la voz original en ingl&eacute;s tiene una... dulzura refinada combinada con su frialdad de asesino, s&oacute;lo en el doblaje latino logra que la voz posea una pasi&oacute;n sublime, un tono anguloso y a la vez reteniendo su caracter&iacute;stico refinamiento cruel y bello. Es mucho m&aacute;s emotiva y apasionada, refleja perfectamente lo que uno pensar&iacute;a de c&oacute;mo es el personaje. &quot;Una obra maestra&quot; como dir&iacute;a el mismo Jhin. Sin duda hay mucho talento aqu&iacute; en el equipo creativo, y los actores latinos son de primera. \n\nPues eso, les extiendo mis agradecimientos, mi cari&ntilde;o por entregarnos un personaje con un background, un tema tan genial y por hacer este juego una gran experiencia entretenida, memorable y creativa.\n\n\nA expensas de sonar como un loco psic&oacute;pata homicida (&iexcl;Hola Jhin!) me gustar&iacute;a dedicarle una carta al personaje, si pudiera &#039;tomar la piel&#039; de un personaje dentro del juego (un rol), y &#039;hablarle&#039;:\n\n_&quot;Virtuoso:_\n _Desgraciadamente no nos conocemos en persona, pero he visto tu arte. He visto las obras que nos has dejado; en tu ascensi&oacute;n como &quot;Demonio Dorado&quot; en tus inicios en Zhyun. C&oacute;mo con cada muerte, has ido perfeccion&aacute;ndote en tu t&eacute;cnica y belleza. C&oacute;mo he lamentado tu presidio en Tuula, a manos del Maestro Kusho, quien nos arrebat&oacute; de tu genialidad y tu sublime arte. Por chance del Concilio Jonio he de disfrutar tus obras una vez m&aacute;s, poniendo a prueba tus aptitudes y ...creatividad con el corriente y aburrido lienzo que han sido las fuerzas Noxianas en Jonia. Yo, como t&uacute;, veo la cruel belleza en el arte de matar. C&oacute;mo cantan y bailan las marionetas que son las personas, al son de una Granada Bailarina. El bello despertar de un Brote Letal, orquestando la muerte en una maravillosamente violenta composici&oacute;n. C&oacute;mo Cada Momento Importa en  una obra perfecta-- una obra maestra, inspiradora de &aacute;vido terror en los ojos de tus testigos. Yo soy tu Audiencia Cautiva, quien te hace un LLamado a Escena con toda el ansia de ver un Virtuoso como t&uacute; actuar y iluminarnos con su arte terror&iacute;ficamente inspirador; Con cada disparo, una catarsis reveladora. Con cada bala, un hermoso ballet. Un ballet de un bailar&iacute;n sin piernas, que canta con las voces de sus v&iacute;ctimas La Muerte En Cuatro Actos, d&aacute;ndonos atisbos de tu verdadero rostro con cada pincelada que deja el Susurro de tu alma._ \n _El mundo es cruel; has sido reducido a un trabajador a sueldo del concilio Jonio, y nadie m&aacute;s que yo comprende tu genialidad. Eres un vanguardista solitario, un genio fuera de su tiempo. Pero el mundo no tiene por qu&eacute; ser feo. Tu libertad y los fondos que se te han otorgado le han dado a dicho mundo otra oportunidad de tenerte; otra oportunidad para ti de dejar el inmortal rastro que es tu arte. Las condiciones tal vez no sean las &oacute;ptimas, pero conf&iacute;o que tu habilidad podr&aacute; lograr sopesar esas dificultades, logrando obras maravillosas que realzar&aacute;n y elevar&aacute;n aquel escenario de mal gusto que es la Grieta del Invocador. He aqu&iacute;, en este mismo escenario, en que tu humilde servidor te deja un sutil y vago guión, que tal vez te inspire a convertirlo en una de tus obras maestras._\n\n_**Primera Obra: La Ca&iacute;da del Ejemplar de Demacia (Jarvan IV)**_\n_En un principio, la muerte de un noble demaciano como lo es el Pr&iacute;ncipe Jarvan IV podr&aacute; otorgar de una sombr&iacute;a y deliciosa atm&oacute;sfera a tu obra. Que su armadura dorada, su experiencia en combate y su duro semblante no te enga&ntilde;e; una vez que est&eacute; al centro del escenario, caer&aacute; con tu llamado. Que su muerte sea en un d&iacute;a lluvioso. Que las estatuas mismas de sus ancestrales reyes demacianos lloren su p&eacute;rdida, que viertan sus &#039;l&aacute;grimas&#039; a trav&eacute;s de sus p&eacute;treas mejillas, mientras que el heredero mismo del trono vierta su sangre por tu querido p&uacute;blico y tu obra, que se re&uacute;na con los sacrificados bajo su mando, como lo fueron los caballeros de su extra&ntilde;a y misteriosa expedici&oacute;n._\n\n_**Segunda Obra: La Tragedia de los Amantes Desafortunados (Garen/Katarina)**_\n_&iquest;Qui&eacute;n no disfruta de un cl&aacute;sico melodrama que es el amor ba&ntilde;ado por el infortunio? En este acto, puedes hacer una obra rom&aacute;ntica para ensalzar este teatro. Garen, el h&eacute;roe Demaciano, quien a trav&eacute;s del combate singular, lo &uacute;nico que ansia es que su amor, que posiblemente no es correspondido, le llegue a su pelirrojo contrincante. A trav&eacute;s de una bala t&uacute; llegar&aacute;s a tocar su coraz&oacute;n. Y la solitaria Katarina, una mujer marcada por el peso del deber y endurecida asesina como lo es un miembro de la familia Du Coteau, que descubra el final revelador de su &uacute;ltima actuaci&oacute;n; que se de cuenta que es en realidad un dueto, el dueto de un combate pintado por el amor, y consumado por la misma muerte._\n\n_**Tercera Obra: La Uni&oacute;n de la Eternidad con lo Eterno (Kindred)**_\n_&iquest;Acaso un esp&iacute;ritu eterno puede morir? &iquest;Si la muerte es definitiva, eterna, acaso el esp&iacute;ritu mismo de la muerte podr&aacute; un&iacute;rsele en tal concepto? Te invito a ser creativo en esta ironía. Tal vez improvisar un poco, si es que eso no es pecar en tu credo. Kindred es aquel que recoge los despojos de tus obras. Quien act&uacute;a en tu sombra, recogiendo los pedazos de tu lienzo que no sirven o no fueron part&iacute;cipes de tu actuaci&oacute;n. Hazle un favor, y hazlo participar; pero no s&oacute;lo tras bambalinas como siempre, sino que tomando un papel principal como bailar&iacute;n en tu obra. Que su naturaleza dual no te enga&ntilde;e. Al morir la Oveja, el Lobo caer&aacute; con ella. Una coreograf&iacute;a sublime, sincronizada, que seguro disfrutar&aacute;s._\n\n_**Cuarta Obra y Final: El Eclipsar del Ojo Del Crep&uacute;sculo (Shen)**_\n _El desenlace que sin duda has ansiado saborear desde hace ya mucho tiempo. Como siempre, es mejor guardar lo mejor para el final. Es una l&aacute;stima que Kusho haya muerto en manos de Zed, rob&aacute;ndote la posibilidad de hacerlo participar en alguna de tus obras maestras. Por fortuna, su reemplazo puede incluso hasta realzar la idea original. Demu&eacute;strale el bello contraste de la ausencia de equilibrio a tu compatriota jonio, el concepto vanguardista que te identifica, a la vez que tome en su muerte el rol al cual siempre quisiste tener un actor para tu obra. La verdad reveladora que es la muerte, y que el a&uacute;n no lo sepa hasta su dram&aacute;tico final._\n\n\n _Con este sencillo y crudo gui&oacute;n, me despido. Ve ahora. Demu&eacute;strale a tu p&uacute;blico de lo que eres capaz. Sorprende con tu genialidad una vez m&aacute;s. No puedo esperar a que llegue tu noche de estreno, a que levantes el tel&oacute;n y liberes a tu audiencia de su sofocante peso, y levantes el velo de la ceguera que es tu ausencia._\n\n_En la Grieta del Invocador te estaremos esperando, Virtuoso. Tu p&uacute;blico te llama._\n\n_--N_\n\n\nP.D. : Pentakill? Supongo que ser&iacute;a posible xD\n\nGracias por leer!","replies":[{"poster":"Gudrid","date":"2016-02-14T04:27:22.168+0000","up_votes":2,"down_votes":0,"body":"¡toma tu like! {{sticker:slayer-pantheon-thumbs}} \n\n {{item:2043}}  (wardeado por si acaso xd)\n\n{{sticker:slayer-jinx-catface}}  salu2","replies":[]},{"poster":"AleSeek","date":"2016-02-14T04:26:09.045+0000","up_votes":2,"down_votes":0,"body":"mmm lo de la muerte de jarvan iv si  que es algo deseado por varios,  lógicamente el estaría encantado en que recibiera una paga de noxus, pero creo que no se le ha ofrecido  por que hay otras personas que se quieren encargar con sus propias manos del princeso  {{champion:59}} .         especialmente {{champion:50}}  que se le logro escapar","replies":[]},{"poster":"SKT T1 Daemonz","date":"2016-02-14T03:40:28.359+0000","up_votes":1,"down_votes":0,"body":"No leí ni la primera palabra","replies":[{"poster":"Nandogeno","date":"2016-02-14T03:43:48.352+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GameplayMDFK,realm=LAS,application-id=v7qsfXsE,discussion-id=i6n6URTU,comment-id=0000,timestamp=2016-02-14T03:40:28.359+0000)\n>\n> No leí ni la primera palabra\n\nSupongo que podría reducirse todo ese texto a una sola palabra: Gracias!\nEl resto es verborrea extrema xD","replies":[{"poster":"SKT T1 Daemonz","date":"2016-02-14T03:56:56.438+0000","up_votes":1,"down_votes":0,"body":"No me creo que hayas escrito toda esta pedazo de parrafaba xd","replies":[{"poster":"Nandogeno","date":"2016-02-14T04:08:48.263+0000","up_votes":1,"down_votes":0,"body":"No es una traducción, ni una copia de otro sitio. 100% propio, un texto que estuve editando por una hora, y los agradecimientos son de todo corazón. Sufro de incontinencia textual severa, que en casos muy esporádicos se vierte sobre foros. xD\n\nEspero que alguien de Riot lea esto :C","replies":[{"poster":"Nyán","date":"2016-02-14T16:26:07.447+0000","up_votes":1,"down_votes":0,"body":"Toma mi +1 \nCualquiera que escribe por una hora o mas, lo merece :p","replies":[]}]}]}]}]},{"poster":"Un Sin Corazón","date":"2016-02-14T04:38:17.743+0000","up_votes":1,"down_votes":0,"body":"Toma tu {{item:2052}} \nMe lei el titulo, la primer palabra y la ultima.","replies":[]}]}