{"poster":"samael00","date":"2015-07-06T12:03:10.706+0000","title":"Ma com'è possibile che è cosi pieno di errori questo gioco?","subforum":"Discussioni generali","up_votes":1,"down_votes":5,"body":"Ho ripreso a giocare a lol da poco ed &egrave; una cosa insostenibile\r\n\r\n1) Almeno due partite al giorno vengo disconnesso mentre pingo 80 e la mia rete va benissimo.\r\n2) Ogni tanto i game nemmeno partono mentre internet va a meraviglia.\r\n3) Solo in questa settimana almeno in tre partite mi &egrave; capitato che tutte e due le squadre si disconnettessero pi&ugrave; volte insieme.\r\n4) Se per caso ti disconnetti il programma &egrave; troppo stupido per abbattere una connessione e crearne un&#039;altra da solo, quindi devi chiudere lol e riavviare tutto altrimenti ti da un problema di rete dopo aver caricato al 100% (sottolineo che probabilmente non superi nessun corso di laurea in informatica con indirizzo reti se non sai fare questa cosa)\r\n5) La patch &egrave; un&#039;incognita, non si sa mai se patchera o si bloccher&agrave; ad una percentuale e devi resettare tutto finch&egrave; non decide di funzionare.\r\n6) Il packet loss si sente pesantemente anche a ping bassi.\r\n\r\nE&#039; l&#039;unico gioco online che io abbia mai provato che richiede tutto sto casino di caricamenti, davvero non ci posso credere che in un game dove ci sono 10 utenti ci vuole pi&ugrave; del doppio del tempo che connettersi ad una stanza con mille utenti. Su altri giochi on line posso fare quello che voglio con il router, cambiare IP o perdere connessioni e non succede nulla! Si riconnette appena ho di nuovo la connessione com&#039;&egrave; normale che sia.\r\n\r\nMa poi davvero sono tutti problemi di soluzione semplicissima! Perch&egrave;? Perch&egrave; mio fratello senza sapere nulla li aveva fixati molto semplicemente con programmi scaricati on line, il gioco a lui andava benissimo patchava sempre e si riconnetteva velocemente, c&#039;era pure meno packet loss. Peccato che per questo gli &egrave; stato bannato l&#039;account per l&#039;utilizzo di programmi di terze parti... cio&egrave; non solo aveva fixato gli errori della riot si &egrave; pure ritrovato bannato, ora io per paura di ban mi ritrovo in questa situazione di merda, ad aspettare come minimo 5 minuti per una riconnessione e sperare soltanto che alla prossima patch il patcher funzioni correttamente dopo un paio di tentativi.\r\n\r\nDavvero il gioco &egrave; bellissimo, per&ograve; non &egrave; possibile che facciano un gioco bello e poi tutto il resto intorno &egrave; programmato da schifo, e non ti permettono nemmeno di fixarlo da te. Che poi nelle patch nel periodo che sono mancato ho letto solo modifiche a champ, oggetti e altro, non ci provano nemmeno a fixare queste cose, probabilmente non cercano nemmeno di assumere qualcuno in grado di farlo, ormai sembra reggersi tutto sull&#039;idea base del gioco che &egrave; bellissima e divertente e sulla pubblicit&agrave; che gli viene fatta. Spero solo che presto qualcuno crashi ai vari tornei che fanno, magari si decidono ad assumere qualcuno che fixi qualcosa, tanto credo sia solo una questione di calcolo delle probabilit&agrave;, prima o poi con questo sistema qualcuno crasher&agrave; anche ai tornei con tutti i server dedicati.","replies":[{"poster":"Whommy","date":"2015-07-06T12:53:58.855+0000","up_votes":3,"down_votes":0,"body":"tralasciando che non menzioni nessun errore, il packet loss è indipendente dal ping ed è imputabile solo alla linea.","replies":[{"poster":"samael00","date":"2015-07-06T13:30:19.059+0000","up_votes":1,"down_votes":0,"body":"Come non ho menzionato errori O.O Forse abbiamo un concetto diverso di errore, per me una cosa gestita male è un errore.\n\nOk il packet loss è imputabile alla linea ma dipende da come viene gestito, se avessi lag in tutti i giochi direi \"ok è la mia linea\", ma se è solo su lol significa che effettivamente questi pacchetti sono gestiti male. Cioè pochissimi pacchetti persi danno un grosso svantaggio a livello di gioco cosa che effettivamente non accade in altri giochi on line.","replies":[{"poster":"Whommy","date":"2015-07-06T13:40:07.996+0000","up_votes":1,"down_votes":0,"body":"un errore è qualcosa di sbagliato nel gioco, per un bug o cose simili, es. ieri con yasuo in una partita non potevo ultare perchè non veniva la linea tratteggiàta della R perchè la partita non mi registrava i knockup (anche alleati). \n\nquando giochi ti connetti da un punto A ad un punto B, se il tragitto è pieno di interruzioni o nello stesso ci sono problemi di collegamento avrai  packet loss, disconnessioni, lagspike,....\n\nil 99% dei giochi in europa hanno i server in Germania, il data center Riot è ad Amsterdam (probabilmente per tassazione minore), i nostri provider non hanno un buon instradamento verso l'olanda, per questo siamo più soggetti ai problemi di linea.\n\nIl provider è colui che ti fornisce la linea, se la gestisce male è colpa sua, ma si parla della tua linea, la RIOT non c'entra niente finchè non arrivi con un bit nel suo server.","replies":[{"poster":"samael00","date":"2015-07-06T14:05:32.504+0000","up_votes":1,"down_votes":1,"body":"Si ok quello che dici però è vero fino ad un certo punto, ammesso che sia istradato male verso l'olanda mentre verso la germania è istradato benissimo comunque sono loro che hanno messo i server in olanda senza fare test prima o dare una soluzione alla cosa migliorando il numero di pacchetti persi per dare problemi. Ok va bene è un gioco, nulla di importante, ma dovrebbe essere un gioco per noi e un lavoro per loro teoricamente.\n\nMa ammesso che questi provider hanno sbagliato totalmente il routing e quindi chissà che fanno sti pacchetti, cioè se ne perdono talmente tanti che non si può stabilire che succede sul client, comunque restano i problemi a livello superiore. Il fatto di non poter abbattere una connessione e ricrearla non è un problema di livello rete, la patch che si blocca sicuramente non è un problema di livello rete, e se lo sono significa che sono fatte male perchè dovrebbero essere ad un livello superiore a quello di rete.","replies":[{"poster":"Whommy","date":"2015-07-06T14:48:54.398+0000","up_votes":1,"down_votes":0,"body":"L'instradamento, le interconnessioni fra provider e aziende di telecomunicazione sono gestite da terzi, usi loro come tramite per arrivare ai server RIOT. \nSono Telecom, Fastweb, Wind, Vodafone,... che hanno accordi con i rispettivi concorrenti esteri per il libero scambio di dati, andiamo al risparmio perchè siamo in ITALIA le nostre infrastrutture attualmente non ci permettono altro, invece di andare in autostrada siamo rimasti al medioevo e andiamo col ciuchino (manco il cavallo).\n\nPerchè io azienda RIOT dovrei controllare cosa fanno altre aziende?\n\nAl contrario di quanto pensi questa cosa la stanno facendo, stanno chiedendo la collaborazione dei provider europei per migliorare l'interconnessione verso di loro (e non sono tenuti a farlo), un programma simile è già stato implementato in NA.\n\nIl problema di riavvio client per riconnettersi è un non problema.\n\nQuando ti connetti ad una partita ti colleghi con un indirizzo, in caso di disconnessione-riconnessione vieni generato con un nuovo indirizzo e cerchi di accedere con il nuovo al client aperto con registrato il vecchio indirizzo--> Famoso errore firewall.\n\nRiavvii il client, connessione al server nuova di pacca.\n\n\nTi sfido a riconnetterti a BF4 sul PC se ti crasha una partita (e sono server dedicati in germania)","replies":[]}]}]}]},{"poster":"Fab77","date":"2015-07-06T13:07:41.590+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=tommyhaze17,realm=EUW,application-id=MJVj50Jw,discussion-id=a0VuoXUc,comment-id=0000,timestamp=2015-07-06T12:53:58.855+0000)\n>\n> tralasciando che non menzioni nessun errore, il packet loss è indipendente dal ping ed è imputabile solo alla linea.\n\nIn aggiunta a quello che ha detto giustamente Tommy, il team della Riot mi ricordo mise a disposizione un tool per il supporto ai giocatori: \n\n[http://forums.euw.leagueoflegends.com/board/showthread.php?t=1765644](http://forums.euw.leagueoflegends.com/board/showthread.php?t=1765644)\n\nNon è detto che possa fare al caso tuo, ma tentare non costa nulla.","replies":[]}]}]}