{"poster":"samael00","date":"2015-11-15T10:54:32.423+0000","title":"problema skill shot e visuale","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Dopo la mega patch della preseason mi capita un problema molto strano. Io uso la visuale mobile e quando sono ad esempio con lux visto che ha un raggio molto ampio delle spell nei tf cerco di mettere la visuale con il mio champ proprio sul bordo della stessa, in modo da avere visione di tutto il tf mentre io sto lontano quindi non mi serve avere visione del mio pg.\r\n\r\nIl problema &egrave; che a volte questo lancia spell all&#039;indietro, nonostante sia praticamente impossibile che io clicchi alle spalle del mio champ visto che non ho modo di mettere il puntatore li per via della visuale. Ci ho messo un po a capire cosa fosse perch&egrave; vedendo il tf e non il personaggio pensavo che le spell non partissero proprio, invece poi ho notato che le lanciava all&#039;indietro, quasi come se il mio champ fosse al centro della visuale e io clicco alle sue spalle. Mi &egrave; capitato anche una volta con ahri, mentre scappavo senza muovere la visuale ho fatto una E all&#039;indietro quando ero quasi completamente fuori dalla visuale, e ha lanciato lo skill shot verso l&#039;esterno della visuale.\r\n\r\nC&#039;&egrave; qualcun&#039;altro che ha questo tipo di problema? E&#039; un problema noto?","replies":[{"poster":"CineseInBorghese","date":"2015-11-15T11:03:25.585+0000","up_votes":1,"down_votes":0,"body":"Sei sicuro che non stavi puntando il cursore sulla minimappa?","replies":[{"poster":"ShowterX","date":"2015-11-15T12:12:06.543+0000","up_votes":1,"down_votes":0,"body":"! quoto!!! stai attento che se per sbaglio punti sulla mini mappa con il cursore le skill vanno per fatti loro!\n\n","replies":[{"poster":"samael00","date":"2015-11-17T08:52:53.418+0000","up_votes":1,"down_votes":0,"body":"Oddio non posso dire di esserne totalmente certo di non averlo fatto >.< la prossima volta che mi capita ci farò caso. Comunque se ricordo bene ero sulla \"parte alta\" dello schermo, però ripeto non ne sono sicuro quindi può essere che è come dite voi.","replies":[]}]}]}]}