{"poster":"SSF Reliewz","date":"2018-11-24T13:58:47.242+0000","title":"Esport Verein SSF sucht Streamer & Caster, die den eSport in Deutschland repräsentieren möchten","subforum":"Streams & YouTube","embed":{"description":"Sabotage & Security Force e.V. - Multigaming Clan since 2004. WoW, FIFA, CS, CS:S, CS:GO,LoL, Shakes and Fidget, Starcraft II Squads","url":"http://sabsecforce.de","image":null},"up_votes":1,"down_votes":0,"body":"Hallo LoL Community,\r\n\r\nZun&auml;chst einmal m&ouml;chte ich ein paar Worte &uuml;ber den Verein - Sabotage &amp; Security Force e.V. - selbst sagen:\r\n\r\nGegr&uuml;ndet wurde der Verein 2004, indem haupts&auml;chlich Counter Strike gespielt wurde. Durch die selbstlose Arbeit des drei k&ouml;pfigen Vorstands und allen Mithelfern wie Spielern, Organisatoren, [Sponsoren](https://play.eslgaming.com/team/4675499/)  sind wir zu dem **gr&ouml;&szlig;ten eSport Verein in Nord Deutschland** herangewachsen.\r\nNeben den Wurzeln wie Counter Strike haben auch andere Spiel Genres wie FIFA, NBA, League of Legends und viele mehr etabliert.\r\n\r\nDa in Deutschland eSport noch nicht als richtiger Sport anerkannt wurde, ist es unser gr&ouml;&szlig;tes Ziel aktiv an einer Ver&auml;nderung dieses Sachverhaltes Mitzuwirken. Wir leisten also Pionierarbeit in Sachen eSport mit dem zuk&uuml;nftigen Beitritt in den - [Esport Bund Deutschland e.V.](https://esportbund.de/) - sowie den Beitritt als selbst&auml;ndige eSport Sparte in den Sport und Turnverein der [TSV Burgdorf](http://www.tsv-burgdorf.de/)  - jetzt kommst du ins Spiel.\r\nAuf unseren Social Media Kanal auf [Twitch](https://www.twitch.tv/ssf_ev) m&ouml;chten wir Zuschauern, aus dem deutschsprachigen Raum, die M&ouml;glichkeit bieten die Leidenschaft, wie wir sie kennen und welche beim eSport entsteht mitzuerleben.\r\n\r\n**-&gt; An unsere zuk&uuml;nftigen Caster**\r\n\r\n&Uuml;ber den genannten Twitch Kanal wird sich zuk&uuml;nftig dein Einflussbereich erstrecken, du wirst unsere qualitativ hochwertigen Teams in Turnieren und &Uuml;bungsspielen (Scrims), sowie bei Offline Events begleiten und die Stimme des Vereins f&uuml;r die &Ouml;ffentlichkeit werden.\r\n\r\nIn Zusammenarbeit mit den Teams und dem Vorstand werden wir den Stream auf ein Niveau, dass  jeder egal ob er das Spiel spielt oder nicht, Spa&szlig; beim Zusehen entwickelt.\r\nGesucht wird also jemand, dessen Leidenschaft es ist League of Legends Spielen Leben einzuhauchen und durch seine ganz pers&ouml;nliche Note die Zuschauerschaft zu begeistern. \r\n\r\n**An unsere zuk&uuml;nftigen Streamer**\r\n\r\nDes weiteren suchen wir Streamer, die Lust haben ihr Gameplay auf einem Portal mit moderater Zuschaueranzahl zu pr&auml;sentieren.\r\nZun&auml;chst wirst du auf unserem Kanal gehosted werden. Alles weitere ist von verschiedenen Faktoren abh&auml;ngig und einer gewissen Zusammenarbeit &uuml;ber einen gewissen Zeitraum hinweg.\r\nWichtig ist, dass du nicht Fluchst und deine Einstellung zu dem Spiel und deinem Team auf Respekt beruht. (Positives Mindset)\r\n\r\nFalls ihr Interesse habt meldet euch um eure pers&ouml;nlichen Konditionen f&uuml;r diese Arbeit auszuhandeln:\r\nBei mir und meinem Team\r\n-&gt; ssf.frost@gmx.de \r\noder unserer Clanadresse\r\n-&gt;  info@sabsecforce.de\r\n\r\nIch freue mich auf euch und bis bald\r\nsportliche Gr&uuml;&szlig;e\r\n\r\nKai Zwie&szlig;ler i.A. Sabotage &amp; Security Force e.V.","replies":[]}