{"poster":"No Team Report","date":"2017-12-22T01:18:29.669+0000","title":"Increible","subforum":"Problemas Técnicos","up_votes":6,"down_votes":0,"body":"Es totalmente incre&iacute;ble que de 120 fps me baje a 40, e igual que ahora en todas las partidas al ir a la pantalla de cargar se me cierre el lol y luego que lo abra me diga que hubo problema de conexi&oacute;n, que no tengo Internet y debo revisarlo.\r\nLuego por culpa de esto entrar 8 minutos tarde a las partidas generalmente, no queda mas que volver a descargar el lol y instalarlo ya que la soluci&oacute;n que me dio un rioter no me sirvi&oacute;{{summoner:14}}  para nada (reparacion hextech)","replies":[{"poster":"AC Wolf","date":"2017-12-22T01:31:09.009+0000","up_votes":4,"down_votes":0,"body":"holaa que tal! ?\nmm si la herramienta hextech no te funciono te invito a que crees un nuevo post al soporte  para comunicarles el resultado y que te den nuevas formas de solucionarlo. (una amiga tenia el mismo problema le dieron buenos consejos de optimizacion y pudo recuperar bastantes fps).\nno obstante te dejare algunas guias de como optimizar  tu pc.\n\n**como no se que sistema operativo tienes te dejare algunas opciones**\nwindows 10 : [Click aqui](https://www.youtube.com/watch?v=3B4tqU_jwQw)\n\nWindows 7 : [Click aqui](https://www.youtube.com/watch?v=lq7E46OOM6U)\n\nDesfragmentar disco: [Click aqui](https://www.youtube.com/watch?v=7WGjMYfpiYk)\n\n**espero que puedas solucionar tu problema ^^, si necesitas algo mas no dudes en escribir  con mucho gusto te ayudare ^^ **\n\n**un saludo y recuerda... Siempre sigue aullando!**\n**-Wolf** {{champion:19}}","replies":[{"poster":"TiToldero","date":"2017-12-22T01:38:49.551+0000","up_votes":2,"down_votes":0,"body":"y este ser de luz? No parece de LAS xD","replies":[{"poster":"AC Wolf","date":"2017-12-22T01:43:25.306+0000","up_votes":2,"down_votes":0,"body":"lo que sea por ayudar y seguir mejorando esta comunidad ^^","replies":[]}]}]},{"poster":"brushiebrush","date":"2017-12-23T21:09:00.602+0000","up_votes":1,"down_votes":0,"body":"Hoy regrese de un largo hiato por estudios, me lanzo a una partida y la experiencia a la que me sometí podria describirse mejor como una presentacion de diapositivas que como una partida de lol.\n\nNo se que le tocaron al juego pero ahora en mi tostadora es imposible jugar ni siquiera una coop.","replies":[]}]}