{"poster":"ViperFangs","date":"2016-09-14T13:34:39.941+0000","title":"OMG! ARE U KIDDING ME!","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"i just got a 5 game ban\r\ni w\\finished all of them after the lkaast one got 5 more wow\r\nare u kidding me riot please fix this","replies":[{"poster":"Anotherherolost","date":"2016-09-14T17:59:24.934+0000","up_votes":2,"down_votes":0,"body":"Just play hearthstone while your waiting","replies":[]},{"poster":"Targons Blade","date":"2016-09-14T17:33:02.328+0000","up_votes":1,"down_votes":0,"body":"It sounds like you may be frequently disconnecting from matches. A 5-game low-priority queue only comes up when there has been a trend of disconnections from matches on your account. \n\nLet me know the details around what's going on and any error messages you're seeing so we can work towards resolving this for good.","replies":[{"poster":"ViperFangs","date":"2016-09-15T04:14:40.032+0000","up_votes":1,"down_votes":0,"body":"and one more thing my net is working fine but i kept disconnecting in the last match for like 2 or 3 min then it was working fine it was a ranked game we won it i guess thats the issue i didnt leave the game but i got a ban again","replies":[{"poster":"Targons Blade","date":"2016-09-15T15:41:03.781+0000","up_votes":1,"down_votes":0,"body":"Given the context you provided, I believe that your disconnections from the last match was what prompted the [Leaverbuster](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ) system to administer another penalty for frequent disconnections. Since these types of disconnections are most often caused by your client not being able to establish a stable connection to the server, I recommend working through our [connection guide.](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues)\n\nLet me know if those steps caused any change in your connection.","replies":[]}]},{"poster":"ViperFangs","date":"2016-09-15T04:11:35.156+0000","up_votes":1,"down_votes":0,"body":"My first ban went like this my net went out in loading screen and team remaked i got a 5 game ban i was ok with it then after the 5th game i got another 5 game ban like what i havent done anything wrong please fix this","replies":[]}]}]}