{"poster":"Bruce Lee","date":"2016-02-26T19:01:33.769+0000","title":"Historia de leona","subforum":"Charlas Generales","up_votes":5,"down_votes":2,"body":"Ayer le&iacute; todas las historias del monte targon y aunque en general me agradan, me sorprendi&oacute; c&oacute;mo cambiaron tan radicalmente la moralidad de leona, de ser una persona con el objetivo de cuidar a todo ser vivo y evitar los conflictos, a alguien con fe ciega capaz de matar a alguien por contradecir lo que sus creencias dicen . \r\nNo se, es algo que note y me sorprendi&oacute;, ustedes que opinan?","replies":[{"poster":"vk0utsider","date":"2016-02-27T01:47:41.100+0000","up_votes":3,"down_votes":0,"body":"Me paso exactamente lo mismo, sobre todo cuando describen como actúa cuando se deja llevar por el aspecto que la posee, me sonó a una fanática religiosa con ansias de sangre más que a la guerrera noble y protectora que hasta ahora veía en ella ... veremos como sigue la historia.","replies":[]},{"poster":"TerrSinManos","date":"2016-02-27T01:42:48.554+0000","up_votes":3,"down_votes":0,"body":"Realmente detesté el cambio de Lore que sufrió Leona... es que prácticamente es un giro en 180°! \nLa Leona de antes era compasiva, la causa de su ruptura con los Rakkor fue la negativa de matar a uno de los suyos ¿Y ahora me salen con ésto? Y por si dejar a la Leona compasiva reemplazada por una fanática vengativa (sube persiguiendo a Diana para matarla ¿Donde está lo que era antes?) no fuera suficiente, encima Riot hace que sea una especie de semi-diosa inhumana. \nQue quieren que les diga, la gente encargada de hacer ésto se pasó por las pelotas la vieja identidad de Leona, o esa es mi sensación. Tener que mamarme a ésta intrusa cada que juegue con Leona (seguramente le cambiarán los diálogos e incluso la voz para encajar con su nuevo Lore) será una patada en los testículos. Que lata cuando hacen ésto.","replies":[]},{"poster":"Casandra Lange","date":"2016-02-26T22:11:39.247+0000","up_votes":3,"down_votes":0,"body":"No me gustó la historia de mi amada Leona. Ahora es una fanática de un dogma que ni siquiera conoce. No la podré mirar igual. GG Riot, te la cagaste.\n{{champion:89}} {{item:3070}}","replies":[]},{"poster":"Ks Erwyn","date":"2016-02-26T21:10:58.504+0000","up_votes":3,"down_votes":0,"body":"Cambiaron mucho, volvieron a Leona una Fanática fundamentalista de su religión representa un poco lo que eran los templarios en la antiguedad, redimieron un poco a Diana, no puedo considerarla una villana como antes, su intención no es mala pero serán sus extremistas acciones lo que la definirá. \n\nAl haber ascendido por asi decirlo algo debieron haber aprendido, no quedo calro si leona ahora busca a diana por venganza, esta claro que la ve como una amenaza, pero tras lo aprendido y experimentado algo debe de haber cambiado en su meta de perseguir a diana.\n\nNo se que papel jugara Pant en esta historia, su relato parace ajeno a los solari y lunari a pesar de la indirecta participación de leona","replies":[]},{"poster":"Vlindrel","date":"2016-02-27T04:31:35.765+0000","up_votes":2,"down_votes":0,"body":"A pesar de que la historia es más completa que la de antes, me decepcionó un poco. Me gustaba esa Leona más \"protectora\" que la Leona malota que nos presentaron ahora... La relación con {{champion:80}} también cambió y no me gustó, prefería la amistad que había entre ellos en vez de esta especie de rivalidad :(\n\n{{champion:80}} fue muy {{champion:223}} al acusar a Leona de salvar a la critura y no matarla :(","replies":[]},{"poster":"Bruce Lee","date":"2016-02-26T21:52:03.305+0000","up_votes":2,"down_votes":0,"body":"Aparte la ascensión (voy a decirle así a la posesión de un ente estelar a  un cuerpo humano) de pantheon parece ser diferente a la de leona o diana. Donde claramente ellas siguen controlado de su cuerpo pero tienen una mentalidad ligeramente cambiada y poseen conocimientos nuevos, pero en el caso de pantheon esto es al revés donde parece que pantheon conserva sólo una fracción de lo que alguna vez fue.\n\nTambién quisiera saber quienes podrian ser los espacios en blanco mis suposiciones es que uno es taric con el rework y el otro Aurelion (ao shin)\n\nY por ultimo que otros campeone están relacionados a estos entes como brand que en el viejo lore es un hombre poseído por un espíritu ígneo","replies":[]},{"poster":"Khimea","date":"2016-02-26T19:26:14.102+0000","up_votes":2,"down_votes":0,"body":"y tambien que antes  pantheon y leona eran amigos y ahora practicamente son enemigos xD","replies":[]},{"poster":"GinTaicho","date":"2016-02-26T19:23:18.272+0000","up_votes":1,"down_votes":0,"body":"A mi igual me sorprendió un poco, pero teniendo en cuenta que ahora es la líder de una legión templaria de los Solari, no puede permitirse titubear (a lo Garen :v), sin embargo antes le era totalmente indiferente la existencia de Diana o quizás un poco disconforme, ahora la busca por entender lo que ambas vieron en la cima del Monte Targon, que el Sol y la Luna deben estar en equilibrio y no en conflicto, quizás eso cambie su forma de ser más adelante conforme avance la historia.\n\nLo que si me dejo mal sabor de boca es que ahora Pantheon ya no sea tan amigo de Leona, por sus ideales y por lo que paso en el pasado, pero esperemos que se reconcilien o algo como paso con Twisted Fate y Graves.","replies":[]},{"poster":"Pablove90","date":"2016-02-26T19:19:40.668+0000","up_votes":1,"down_votes":0,"body":"yo todavia no lo lei.. pero en la que pueda voy a chusmear me encanta la colo ♥","replies":[]},{"poster":"sangre de perro","date":"2016-02-27T02:54:10.391+0000","up_votes":1,"down_votes":1,"body":"leona no era tan pacifica entes, igual tiene un tipo de juego super agresivo y en sus frases dice cosas como, \"unete a mi\", \"avanza la primera divicion\" o \"rompere sus filas\" a mi me parece que el lore de leona estaba un tanto abierto a la interpretacion y por eso tuvieron que reforzarlo. y no me parece que contradiga a la enterior en lo absoluto :/","replies":[]}]}