{"poster":"LadyMara","date":"2016-06-26T12:13:49.381+0000","title":"Getting Help from My “Son” – A Viktor Date?","subforum":"FanFiction","up_votes":1,"down_votes":1,"body":"**A/N: I asked my partner to throw out a random league champion. He said &quot;Viktor&quot; and I actually really enjoyed writing this. It&#039;s kinda heart-warming to me to read. (No it isn&#039;t a Blitz x Vik, no no no.)\r\nFeaturing: {{champion:112}} {{champion:53}} **\r\n\r\n\r\nWhile I have no interest in the world of dating and the female gender, something compels me to try it. I fear my weakness from my more human side is showing and it craves what humans call a &ldquo;date&rdquo;.  I know who can aide me in this endeavour. My son, Blitzcrank, is rumoured to run a dating program for others. He will know what to do.\r\n\r\nI walk as fast as my legs will take me to where he resides. The door opens creakily and my senses find him. &ldquo;Blitzcrank, my son, help me find a date.&rdquo; Blitz blows some steam and raises his head from his papers. &ldquo;Creator? I, uh, will try to. But why?&rdquo; His head twists a little to the left, he is confused? &ldquo;Because I want to.&rdquo; Blitz nods as if that&rsquo;s all he needs. &ldquo;Come creator, let us sit at a common date area so I can get your answers on my &lsquo;Match Questionnaire.&rdquo; I followed him without hesitation as he grabbed a sheet of paper and left his rather messy office.\r\n\r\nWe walked for what seemed like 2 minutes. My patience was shortening but was silenced when we arrived. It was a small, quite appealing, caf&eacute;. Blitz stomped ahead and took a seat in the outdoor seating. I followed suit and sat across from him. There was a lot of&hellip; reds and pinks at this caf&eacute;. &lsquo;Romantica&rsquo; was an odd name indeed. \r\n\r\n&ldquo;Let us start. What is your name?&rdquo;\r\n\r\n&ldquo;Viktor.&rdquo;\r\n\r\n&ldquo;What are your hobbies?&rdquo; His mechanical voice sounded like bliss to me. It was the only robotic thing around me apart from myself.\r\n\r\n&ldquo;Turning everyone into robots to complete my glorious evolution.&rdquo;\r\n\r\n&ldquo;Is that all?&rdquo;\r\n\r\n&ldquo;Yes.&rdquo;\r\n\r\n&ldquo;Hmm. Why did you come to me?&rdquo;\r\n\r\n&ldquo;To fulfil one of my current human desires. I seek companionship for a short period of time. Then, I will never contact my date again as per the protocol?&rdquo;\r\n\r\n&ldquo;No, Creator, I am not the Matchmaker to set up one-time dates. The goal when dating is for a lasting and satisfying relationship.&rdquo;\r\n\r\n&ldquo;Oh, I will take this into consideration.&rdquo; I feel some sort of amusement. My creation is trying to teach me, of all things. It is an entertaining situation to be sure.\r\n\r\n&ldquo;What do you seek in a date?&rdquo; I paused a moment, noting Blitzcranks eyes seemingly narrowed. Did I give him the ability to &lsquo;stink-eye&rsquo; others? I don&rsquo;t remember if I did.\r\n\r\n&ldquo;I seek companionship and some sort of mechanical parts within them.&rdquo;\r\n\r\n&ldquo;Hmm.&rdquo;\r\n\r\nI look to the outside of our seating zone. I see couples walking, holding flesh hands to one another. I recognize a few from the league. I turn back to Blitz whose data is processing as we go.\r\n\r\n&ldquo;Viktor.&rdquo; My eyes beneath my mask widened. &ldquo;We are spending time together. Is this company satisfying?&rdquo; I slump into my hand and cock my head to the side. &ldquo;It is different from other times I have spoken to you.&rdquo; I recall many times being yanked by my son if he is fighting on the enemy side or times when his arm would fail him on the Rift and need minor repairs. \r\n\r\n&ldquo;We do not talk often.&rdquo; I mused and noticed a waitress waiting on us to take our order. Blitz seemed unfazed by my lack of response and turned to the woman. &ldquo;Oil.&rdquo; I looked to the woman, who seemed calm and wrote down the order.\r\n\r\n&ldquo;I will have tea. Earl Grey.&rdquo; She nodded, wrote it down and skipped off. Blitz turned back to me and seemed to have an improved mood. &ldquo;This place is used to all kinds of creatures, I set up mostly league champions.&rdquo; My curiosity sparked and I leant in to him. &ldquo;Have you assessed yourself and assigned a partner yet?&rdquo; Blitzcrank nodded and began to speak of an interesting robot he had met, and how she was more human then bot in her emotions. I did not approve, but he was his own sentient being now. My work had been done, even if it was when I was young and couldn&rsquo;t make him completely emotionless.\r\n\r\nThe waitress placed our drinks down and hurried off to serve some more customers. Then it was Blitz and I again. We drank our drinks in silence. I could see his head processing, and searching.\r\n\r\n&ldquo;Could you be with a fully organic human?&rdquo;\r\n\r\n&ldquo;Perhaps, but the bond could only be really made over turning her into a robot.&rdquo;\r\n\r\n&ldquo;So no?&rdquo;\r\n\r\n&ldquo;I guess so.&rdquo;\r\n\r\nBlitz rumbled for a few seconds then stopped, beeping twice. I scooted my chair closer to the table, the hole where my mouth was contained opened to allow the tea in. &ldquo;Results in. No one is compatible with you. Sorry, Father.&rdquo; I shrugged, realising this may have been the harsh reality you get from shutting everyone out and augmenting yourself until you were more metal then man.\r\n\r\n&ldquo;But, this has been enjoyable. I wish to do it again.&rdquo; Blitz sipped his oil politely and gave off a happy aura. \r\n\r\n&ldquo;Was this the thing humans call a date?&rdquo; I asked, trying to recall what my upbringing had taught be on human customs. One on one, over a drink or meal and typically with someone you like. I liked my creation well enough out of all I knew.\r\n\r\n&ldquo;In a way Creator, it is. I would like to go on many more with you. Spending time with my creator is very fun.&rdquo; Blitz paid for the bill and we walked back to his office. We stood for a moment and I chuckled with no malice. \r\n\r\n&ldquo;Is it alright if I call you Father?&rdquo; Blitz asked with such a cautious edge to his tone.\r\n\r\n&ldquo;Yes, Blitz. My Son.&rdquo; I shook his hand and turned toward my own place. Time to get back to my glorious evolution. My need to companionship was at bay for now, but I knew how to contact Blitzcrank should the need ever arise again. I hope it does.","replies":[{"poster":"Oneechan","date":"2016-07-10T11:52:27.057+0000","up_votes":1,"down_votes":0,"body":"Never thought I'd say this about Victor and Blitz, but that was really cute :3","replies":[]},{"poster":"Waysted1","date":"2016-06-29T01:12:23.035+0000","up_votes":1,"down_votes":0,"body":"this is gold, thank you","replies":[]}]}