{"poster":"Rebonack","date":"2016-12-06T20:44:41.979+0000","title":"@Meddler How do you guys feel about Juggermaw?","subforum":"Gameplay","up_votes":1,"down_votes":1,"body":"No, not &#039;Juggermaw&#039; in the sense of building a high peel/utility team around Kog.  I mean building one or two offensive items on Kog and then going tank-heavy to play off his high (and soon to be higher) base damage?  Juggermaw as in Juggernaut Kog.\r\n\r\nThe problem is that anything that benefits the former (Glass Kog needs to be VERY strong mid game for it to be worth building a mostly damageless team around him) arguably benefits the latter just as much, if not more so.\r\n\r\nI ask because it feels like many of the recent Kog changes haven&#039;t been thought through and have had some pretty major side-effects down the road.  I don&#039;t have any issue with tanky Kog, personally.  I was kind of infamous for it over in Dominionland.  But I&#039;m curious what Riot&#039;s official stance on durable Voidpuppies is.","replies":[{"poster":"Meddler","date":"2016-12-07T02:10:52.669+0000","up_votes":3,"down_votes":0,"body":"We wouldn't want a really tanky Kog to be his dominant playstyle given it both removes an intended weakness and risks flattening out desirable skill checks (positioning mainly). Some use of defensive itemization seems ok though. Haven't personally seen really tank heavy builds show consistent success over more damage focused builds, interested in VODs or match histories that show it though.","replies":[{"poster":"Rebonack","date":"2016-12-07T05:44:51.704+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=yOGzz3Is,comment-id=0002,timestamp=2016-12-07T02:10:52.669+0000)\n>\n> We wouldn&#x27;t want a really tanky Kog to be his dominant playstyle given it both removes an intended weakness and risks flattening out desirable skill checks (positioning mainly). Some use of defensive itemization seems ok though. Haven&#x27;t personally seen really tank heavy builds show consistent success over more damage focused builds, interested in VODs or match histories that show it though.\n\nI've been running some variation on it since... geeze, Season 2 I think?  Discovered that durable Kog could out-duel many champions who could crush glass Kog without much trouble.  And considering how rich Dominion has always been in duelists, divers, and assassins, being able to win skirmishes has always been pretty important.\n\nNot really sure how amazing (or not) it is over on Rift, but I'll spam the hell out of it over the coming patch and see how it shapes up with the boost to Kog's %HP damage.  The basic build runs on Wit's, Tabi, Rageblade, Mallet, and then two situational tank items (or BorK if you're really stomping).  Idea is to be resilient enough to survive a few seconds of focus such that even the most incoherent of Solo teams can still peel for Kog before he explodes.\n\nIf Juggermaw *does* end up getting too powerful in the coming patches, I would *strongly* recommend looking into lower W base damage coupled with some form of Crit chance interaction.  While a bonus AD ratio could do the same job, the most effective builds still pack a decent amount of AD on account of Rageblade.","replies":[]}]},{"poster":"Dolasaur","date":"2016-12-06T22:00:26.217+0000","up_votes":1,"down_votes":0,"body":"Doesn't seem like it's a thing yet. I recommend you play tons of it now and maintain a 50%+ win rate with it, and then brag about how you played it before the pros picked it up.\n\nTanky Kog'Maw also doesn't have a lot of the base stats that other tanky builds in the past year have had. He has no hard CC and no mobility, poor wave clear if he's not building damage (and you can't max E first if you're relying on W's base damage vs champions), and low base stats due to being ranged. On its own, that makes it way harder to be as annoying as tanky Akali, let alone Fizz or Ekko.","replies":[{"poster":"Rebonack","date":"2016-12-07T05:52:01.035+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dolasaur,realm=NA,application-id=3ErqAdtq,discussion-id=yOGzz3Is,comment-id=0001,timestamp=2016-12-06T22:00:26.217+0000)\n>\n> Doesn&#x27;t seem like it&#x27;s a thing yet. I recommend you play tons of it now and maintain a 50%+ win rate with it, and then brag about how you played it before the pros picked it up.\n> \n> Tanky Kog&#x27;Maw also doesn&#x27;t have a lot of the base stats that other tanky builds in the past year have had. He has no hard CC and no mobility, poor wave clear if he&#x27;s not building damage (and you can&#x27;t max E first if you&#x27;re relying on W&#x27;s base damage vs champions), and low base stats due to being ranged. On its own, that makes it way harder to be as annoying as tanky Akali, let alone Fizz or Ekko.\n\nIt was (sort of) a thing for a while during the machine gun Kog insanity.  And I've been playing some variation on it since Season 2 or so.  TanKoggy has his attack speed, resist shred, W, and Ult as his main damage sources.  And he's arguably got the most powerful Taunt in the game.  People *will* dive him even if he's durable because the damage he can put out over time is still immense, and that usually leaves them confused when he turns around and murders them or at least stalls them until his team can intervene.","replies":[]}]},{"poster":"Jalkan","date":"2016-12-07T03:31:24.374+0000","up_votes":1,"down_votes":0,"body":"It's not that good.","replies":[]},{"poster":"Quil Evrything","date":"2016-12-06T21:01:06.235+0000","up_votes":1,"down_votes":0,"body":"riot doesnt have an official stand on player's playstyles, I would think.","replies":[]}]}