{"poster":"JG Aaron","date":"2017-12-16T16:53:41.926+0000","title":"JupiterGamingNetwork | Teams | Community | Events","subforum":"Clans & Teams","embed":{"description":"The JupiterGamingNetwork - Music Department is providing you music from chosen Producers. ¬ Founded in 2013, the JupiterGamingNetwork is a constantly growing Network & Organization, active in games like League of Legends and Battlefield. Now starting to release music over JGN´s Music Department (Founded 2016).","url":"https://soundcloud.com/jgnmscdpt","image":"http://i1.sndcdn.com/avatars-000337795346-p7zd0r-t500x500.jpg"},"up_votes":1,"down_votes":0,"body":"http://www.fotos-hochladen.net/uploads/bannerberunsg2m5ohpnr6.png\r\n\r\nJupiterGamingNetwork ist eine deutschsprachige Spielgemeinschaft (Community), welche durch die Gr&uuml;nder Daniel &quot;JG Fr3akless&quot; Mayer und Aaron &quot;JG Aaron&quot; Bernstein ins Leben gerufen wurde. Die Gr&uuml;ndungszentren, der seit 2013 bestehenden Community, liegen in Stuttgart und Zwickau.\r\nSeit 2013 liegt unsere Spezialisierung vorwiegend auf League of Legends. Unser Grundgedanke war eine Gemeinschaft zu schaffen, welche dem stressigen Arbeitstag einen angenehmen und enspannten Abgang bietet. Unsere Community gliedert sich in drei Bereiche: dem Casual Gaming, dem Teamsport in Form eines Rankedteams und der administrativen Ebene.\r\n\r\n**Ein Auszug aus der Rede unseres Anf&uuml;hrers JG Aaron:**\r\n\r\n[&hellip;] Ich bin der Auffassung, dass es falsch w&auml;re den Spielern in League of Legends eine Community aufzuzwingen, denn dies f&uuml;hrt nur zu Problemen und Rivalit&auml;ten.\r\nIch bin vielmehr der &Uuml;berzeugung, dass die Spieler selbst, gesteuert durch ihre Interessen, sich eine Gemeinschaftsform w&auml;hlen sollten. Dabei ist es egal, ob dies ein Clan, eine Community oder eine Organisation ist.\r\nDabei haben wir als Community die wichtige Aufgabe einen Ort der Gemeinschaft zu erm&ouml;glichen. Bei uns soll das freie Handeln der Mitgliedern sowie ihre individuellen Gedankeng&auml;nge die Grundbasis bilden. Doch, es ist auch wichtig, dass wir in einer Gemeinschaft eine klare Struktur behalten. Eine Struktur die durch Moderatoren und einen Anf&uuml;hrer gekennzeichnet ist.\r\nOhne diese Autorit&auml;tspersonen k&ouml;nnte die Gemeinschaft nicht wie ein intaktes Uhrwerk funktionieren. [...]\r\n\r\nhttp://www.fotos-hochladen.net/uploads/bannerwirbietentyepkmrhus.png\r\n\r\n- Hauptzeiten zwischen 16.00 Uhr - und 24.00 Uhr\r\n- 50- 60 aktive Mitglieder pro Tag \r\n- aufstrebende Community mit engagiertem Management\r\n- erfahrenes Admin-, Support- und Managementteam\r\n- Communityinterne Veranstaltungen (Interne Liga von JupiterGamingnetwork, Sketchleague etc.)\r\n- eigenes Musikdepartment (mit mehreren Komponisten und Interpreten)\r\n- WhatsApp- und Facebookgruppe\r\n- Unterst&uuml;tzung bei der Teamsuche und Gr&uuml;ndung (keine 0815 Angabe, sondern wirklich gut organisierte Teamsuche)\r\n\r\n**WISSENSWERTES**\r\n\r\nUnser Vorstand legt gro&szlig;en Wert auf die F&ouml;rderung und Entwicklung von Teams. Dabei spielt es keine Rolle auf welchem Stand sich ein Team befindet, ob in der Anfangsphase oder eingespielt, es gibt eine Unterst&uuml;tzung in vielen Formen. So stellen wir euch einen Analysten, Teamchannel mit Grafiken, Lerndokumente sowie einen Designer f&uuml;r euer individuelles Logo.\r\nDer folgende Link zeigt, wie viel Aufmerksamkeit ein neues Team bekommen kann. Dementsprechend finden sich schnell die passenden Leute f&uuml;r euer Team.\r\n\r\nLink zum Team Jupiter Gaming - Ambition: https://boards.euw.leagueoflegends.com/de/c/clans-teams-de/TolAKxqA-jupitergaming-ambition\r\n\r\n**ZUKUNFTSPL&Auml;NE**\r\n\r\n- eine eigene Webseite (bereits im Aufbau; http://jupitergamingnetwork.eu/) \r\n- Ausbau unserer Musikabteilung\r\n\r\nhttp://img5.fotos-hochladen.net/uploads/bannerwirerwartqdjfan2yiw.png\r\n\r\n- Teamspeak ist kein &quot;Nice to have&quot; f&uuml;r dich\r\n- Eigenschaften: kommunikativ, kritikf&auml;hig, ehrgeizig sein und Spa&szlig; am Spiel haben\r\n- Interesse an der Community, nicht nur an einem Team, Turnieren und anderen Dingen die in der Community stattfinden\r\n- funktionsf&auml;higes Mikrofon und Headset\r\n\r\nhttp://www.fotos-hochladen.net/uploads/bannersocialmedm9yvhn1suc.png\r\n\r\nWir pflegen eine gro&szlig;e Liebe zur Musik; dementsprechend besitzen wir seit zwei Jahren ein eigenes Musiklabel. Die Hauptleitung tr&auml;gt der Interpret und K&uuml;nstler Daniel &quot;JG Fr3akless&quot; Mayer.\r\n\r\n**Music Department**\r\n\r\nhttps://soundcloud.com/jgnmscdpt\r\n\r\n**Twitch**\r\n\r\nhttps://www.twitch.tv/jupitergamingnetwork\r\n\r\nTwitter: https://twitter.com/jgn_eu\r\nFacebook: https://www.facebook.com/JupiterGamingNetwork/\r\nWebsite: http://jupitergamingnetwork.eu/\r\n\r\nhttp://www.fotos-hochladen.net/uploads/bannerkontaktat7z63kgmi.png\r\n\r\nSofern Ihr Interesse an JupiterGamingNetwork habt, f&uuml;gt bitte\r\n\r\n- JG Aaron\r\n\r\nzu eurer Freundschaftsliste hinzu. Alle noch offenen Fragen werden auf unserem Teamspeak: **ts.jupitergamingnetwork.eu** besprochen.","replies":[]}