{"poster":"Fancy X","date":"2018-11-05T15:46:31.765+0000","title":"LoL Spielen mit Mobile Daten","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hey Leute ✌️\r\nHab eine Frage und vielleicht kennt sich jemand aus, bzw hatte auch diese Situation.\r\nIch habe momentan noch kein Internet, da ich ausgezogen bin. Nun habe ich 8GB Datenvolumen und k&ouml;nnte ein bisschen davon f&uuml;r LoL verschwenden, meine Frage ist nun: Wie viel verbrauche ich? ZB f&uuml;r ein game, l&auml;nge 40 min?","replies":[{"poster":"Kitty GirI","date":"2018-11-05T15:58:04.477+0000","up_votes":2,"down_votes":0,"body":"Huhu, \nhab eine Zeit lang auch via Hotspot üper Mobile Daten gezockt.\nWie viel genau eine Runde dieser länge kostet, kann ich nicht sagen, aber ich habe in 2 tagen und ca 15 runden ca 320 mb verbraucht. ( nur lol war offen am pc)","replies":[{"poster":"Fancy X","date":"2018-11-05T16:03:23.512+0000","up_votes":1,"down_votes":0,"body":"Oha, ja dann ist easy ^^ dann kann ich ja später n bissl zocken, inet kommt bald :D\nDanke für die schnelle antwort <3","replies":[{"poster":"Shuowian","date":"2018-11-05T16:31:49.429+0000","up_votes":2,"down_votes":0,"body":"eine ARAM-Runde brauch zwischen 30-45mb^^","replies":[]},{"poster":"Enderized","date":"2018-11-05T16:08:01.740+0000","up_votes":2,"down_votes":0,"body":"wichtig ist halt nur, dass du bestimme dinge wie Automatische Updates von diversen Programmen ausstellst x)","replies":[]}]},{"poster":"Shacoláde","date":"2018-11-06T08:43:01.198+0000","up_votes":1,"down_votes":0,"body":"Kann ich bestätigen... hatte vor einem Monat ebenso keine I-Net. Falls du ein feste LTE-Verbindung hast, ist der Ping etwa zwischen 40-90ms.\n(Bei mir je nach Tageszeit)","replies":[]}]},{"poster":"Andrej553","date":"2018-11-06T12:17:00.170+0000","up_votes":1,"down_votes":0,"body":"Vor allem Windows Updates solltest du (nur in dieser Zeit) ausschalten. Hotspot wird nämlich häufig nicht als Mobile Daten erkannt und daher die Updates im Hintergrund geladen. \n\nLol selbst (also ohne patchen etc) sollte vergleichsweise nichts an Daten kosten.","replies":[]},{"poster":"Angel Ayume","date":"2018-11-06T11:11:59.029+0000","up_votes":1,"down_votes":0,"body":"Kann man auch gut mit dem Handy nutzen, wenn einem mal mitten im Spiel das Internet ausfällt. :D \nIst mir schon zweimal passiert. Hab dann meinen Laptop schnell mit meinem Handy verbunden und mein Handy als Hotspot verwendet, um das Game zumindest zuende zu spielen. \n\nAllerdings leidet der Ping darunter. Hatte meist so 80 ms. Aber immer noch besser als Afk zu sein. ^^","replies":[]}]}