{"poster":"Spart1c","date":"2016-06-27T22:25:11.657+0000","title":"Reducing the LP Loss as the Result of an AFK","subforum":"Gameplay","up_votes":2,"down_votes":0,"body":"Even with the new /remake system I am still getting plenty of games where there is an AFK during the middle of the match or practically anytime after the /remake is no longer usable.  While this is sometimes hard to avoid whether the guy rage quits or DC&#039;s its still a huge handicap on the team it happens too, and the majority of the time the afk&#039;s team looses. \r\n\r\nI&#039;m grateful for the /remake for when you get stuck with an afk at the start but there needs to be something done for mid - late game afk&#039;s.  Obviously restarting the match at that point is not really an option at all.  But could there at least be a smaller penalty to LP lost when the game see&#039;s that there was an afk player?  It just seems so unfair when it happens to you, and there is very little you can do about it.  And of course the afk player gets the full penalty or maybe even harsher so that they can&#039;t abuse the system by leaving and getting a lessened LP loss.\r\n\r\nWhat do you guys think?","replies":[{"poster":"Zelnick","date":"2016-06-27T22:38:33.415+0000","up_votes":2,"down_votes":0,"body":"Seems reasonable, it's been thought of before but I haven't seen Riot's reason for refraining from implementing it.","replies":[{"poster":"Votable Jester","date":"2016-06-27T23:29:03.264+0000","up_votes":1,"down_votes":0,"body":"They don't implement it because it would encourage players to tilt their teammates into afking.","replies":[{"poster":"Zelnick","date":"2016-06-27T23:33:00.581+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Votable Jester,realm=NA,application-id=3ErqAdtq,discussion-id=aQHyYasJ,comment-id=00010000,timestamp=2016-06-27T23:29:03.264+0000)\n>\n> They don&#x27;t implement it because it would encourage players to tilt their teammates into afking.\n\nWell what if the afk-er still get the full penalty?","replies":[]}]}]},{"poster":"MunchCrunchLunch","date":"2016-06-28T03:41:13.375+0000","up_votes":1,"down_votes":0,"body":"the other day. we were winning a game. like it was a stomp we were some 20 kills ahead the enemy had no turrets dragons ahead just messing around at that point we tried to push to end and our support. which was godly. she was the reason the adc got so fed. the nami. was too good. she dced. and we ended up losing. i mean she came back later but it was at a point where the enemy has gotten a lead on us so yeah i would like to see lp reduciton","replies":[]},{"poster":"CrazFight ","date":"2016-06-27T22:27:25.154+0000","up_votes":1,"down_votes":1,"body":"Would be an abused system, team mates would afk for eachother so they would lose less LP.","replies":[{"poster":"Spart1c","date":"2016-06-27T22:31:08.962+0000","up_votes":1,"down_votes":0,"body":"Thats why I said that the afkers would get the full amount or harsher penalty.  The penalty could even be given to all of the people in the group if they are duo+. That would stop the abuse because they would lose more LP if one of them AFK's.","replies":[]}]}]}