{"poster":"rrexeν","date":"2016-06-12T12:32:53.988+0000","title":"Wie verdammt soll man im jungle ein S bekommen für das Mastery LVL 7?","subforum":"Champions & Gameplay","embed":{"description":null,"url":"http://imgur.com/h7uhBs5","image":"http://imgur.com/h7uhBs5s.jpg"},"up_votes":2,"down_votes":5,"body":"Hi, ich bin PrOF LEE und wie offensichtlich ist, Lee Sin main mit 300k Punkten. Derzeit versuche ich seit einiger Zeit meine LVL 7 Token zu bekommen, wobei ich einige Games hatte von dene ich sagen w&uuml;rde, dass ich nen S sicher verdient h&auml;tte (hard carry mit ner KDA von 4-5), aber keines f&uuml;r mich so eindeutig war wie das Game im Link...  Ein fucking 53min. Game aus dem ich als Lee mit einer KDA von 6.60 und 47 Wards aus dem Spiel bin (also 1,12 Wards in der Minute).. Wie soll man diese beschissene Token denn sonst bekommen? Was verlangt Riot da bitte von einem?","replies":[{"poster":"Kata Ga Kill","date":"2016-06-13T12:52:41.086+0000","up_votes":2,"down_votes":0,"body":"Ich gebe dir den Tip spiel Lee Sin nicht im Jungle du wirst nur mit anderen Lee Sins gemessen, spiel ihn zB. Toplane da spielt ihn kaum einer, was dir ziemlich leicht ein S einbringt.\n\nHabe selbst Probleme damit Midlane Kata auf Lv7 zu bringen meist ist es immer nur ein A.\nAber habe sie einmal Top gespielt und es hat mir keine Mühe gekostet ein S zu erreichen.\n\nKomischwerweise habe ich mit Garen Toplane direkt jedes Match S in Folge bekommen und habe schon Lv7 fertig in meiner Werkbank liegen......\n\nverdoomt XD","replies":[{"poster":"rrexeν","date":"2016-06-13T18:21:41.137+0000","up_votes":1,"down_votes":0,"body":"Ja wobei ich ja ein recht guter Lee Sin Spieler bin und keine Probleme habe gut zu spielen^^. Aber wenn das System so retarded ist das man sowas machen muss ist das wohl so^^","replies":[]}]},{"poster":"Schesam","date":"2016-06-12T14:19:59.996+0000","up_votes":2,"down_votes":0,"body":"http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2698646583/210264309?tab=overview\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2685829095/210264309?tab=overview\n\nhab bei beiden ein S bekommen :) Kill Participation, Mapmovement und Objective-Control steht ganz vorne soweit ich weiß","replies":[]},{"poster":"Living Tempest","date":"2016-06-12T12:35:38.667+0000","up_votes":2,"down_votes":0,"body":"u.a.: besser Farmen","replies":[{"poster":"rrexeν","date":"2016-06-12T12:45:40.249+0000","up_votes":1,"down_votes":0,"body":"Ich halte es für redundant in den Jungle zu gehen, wenn wir einen Lead haben, statt den Lead auf die Lanes weiter auszubauen. So gewinnt man nämlich Spiele. Nicht mit Farm... Mmn. sollte das geändert werden ist einfach nur retarded..","replies":[]},{"poster":"Hakkuu","date":"2016-06-12T12:40:22.677+0000","up_votes":1,"down_votes":0,"body":"Ja.\nHeißt aber nicht, dass das auch Sinn macht, aber so ist das System nunmal...\nDu kannst 24/7 ganken, und noch so viel für dein Team tun - Wenn du keinen Farm hast bekommst du teilweise trotzdem kein S.\nMeiner Meinung nach (zumindest als Jungler) ziemlich blöd gelöst. Was du z.B. machen kannst, is dir late ne Hydra zu holen und damit bisschen zu waveclearen.","replies":[]}]},{"poster":"Veezey","date":"2018-05-01T14:58:06.031+0000","up_votes":1,"down_votes":0,"body":"Omg der alte Client :O","replies":[]},{"poster":"Bandit137","date":"2018-04-30T18:42:51.168+0000","up_votes":1,"down_votes":0,"body":"also mein letzes game als shyvana jgl 13/2/10 mit 237 farm ein 36 minuten game war auch nur A+ es hat einiges an farm zutun wieoft du an objekten beteiligt warstz und soweiter im  grunde heist das mehr objekte bekommen und mehr farms","replies":[]},{"poster":"Loarya","date":"2016-08-24T14:55:29.805+0000","up_votes":1,"down_votes":0,"body":"Mein Tipp ist, dass du dir einfach einen Premade sucht, der bereit ist Supporter zu spielen. Dann wählst du einfach Supporter aus und dein Premade Jungle. Das Spiel merkt ja dann nicht, dass du eigentlich Jungle spielst und dein Premade Support. Deine Bewertung wird dann wie bei einem Supporter gerechnet und die S Bewertung bekomnst du quasi geschenkt. Nur für deinen Premade springt dabei leider nichts raus. :)","replies":[]},{"poster":"DeathFresh","date":"2016-06-15T08:57:31.418+0000","up_votes":1,"down_votes":0,"body":"So hab mir die Frechheit genommen und ein bisschen dein Spiel analysiert.\nDeine KDA sieht auf dem ersten Blick gut aus aber wenn man genauer hinschaut, hast du nur 42K Damage an Champion verursacht.\nHier ein kleiner Überblick:\nDamage on Champion:\nDu      ---> Lee   42K Damage\nDeine ---> Lux   81K Damage (fast das Doppelte)\nDeine ---> Cait  98K Damage (Doppelt soviel)\n\nUnd der Farm spricht für sich --> 177 in 53 Min\n\nEDIT: Das mit \"Damage on Champion\" wird nur von mir vermutet, dass dies auch ein Faktor ist, welcher einberechnet wird ;)","replies":[{"poster":"rrexeν","date":"2016-06-16T15:27:15.686+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt es bringt dir nichts den damage aus dem Kontext zu reißen... Schließlich spiele ich nicht ABILITY POWER CARRY oder ATTACK DAMAGE CARRY sondern Jungle - also keinen Carry sondern einen FIghter. Daher macht es mmn. wenig Sinn den dmg zu vergleichen. Aber whatever habe jetzt meine fehlenden Token..","replies":[]}]},{"poster":"ELOW Cronos","date":"2016-06-15T09:07:44.501+0000","up_votes":1,"down_votes":0,"body":"Also ich habe keine Probleme meine S im Jungel zu bekommen ^.^. Und bitte hört auf, auf die Lanes zu gehen für eure S Tokens. Wer auf seiner Main-Position mit seinem Main-Champ keine S gebacken gekriegt hat lvl 6 & 7 nicht verdient.","replies":[]},{"poster":"Johnny rules","date":"2016-06-15T03:54:48.604+0000","up_votes":1,"down_votes":0,"body":"Hai! Habe lee auf lvl 7 und stand für ein S+ ungefähr 32-3 in nem ranked xD","replies":[]},{"poster":"Revilous","date":"2016-06-12T12:41:17.932+0000","up_votes":1,"down_votes":0,"body":"Tja das Problem als Jungler ist, dass man nicht so viel Schaden an Champions macht und wenig Farm bekommt ;) Ich hab für mein Nocturne Level 7 ihn auf der Lane gespielt.","replies":[{"poster":"OMG Nerf Diana","date":"2016-06-12T15:23:48.424+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Revilous,realm=EUW,application-id=Wj1wcocU,discussion-id=vL1Iii6W,comment-id=0001,timestamp=2016-06-12T12:41:17.932+0000)\n>\n> Tja das Problem als Jungler ist, dass man nicht so viel Schaden an Champions macht und wenig Farm bekommt ;) Ich hab für mein Nocturne Level 7 ihn auf der Lane gespielt.\n\nDas ist irrelevant. Wenn du Jungle als Lee Sin wählst werden alle Jungle Lee Sins mit dir verglichen und dadurch wird dann die Note vergeben. Wenn du Nocturne beispielsweise als Support spielst würdest du leichter S bekommen, weil es einfach keine Vergleichswerte gibt. Es spielt nun einmal keiner Nocturne Support. \n\nDas heißt für den TE eigentlich nur, dass es irgendwo hinkt und er deswegen mit Jungle Lee Sin kein S bekommt. Killparticipation, Farm, etc.","replies":[{"poster":"Revilous","date":"2016-06-12T15:46:50.242+0000","up_votes":1,"down_votes":0,"body":"Trotzdem kriegt man das S wenn man viel Farm und Schaden an Champions hat. Und das erreicht man auf der Lane leichter. Vergleichswerte hin oder her.","replies":[]}]},{"poster":"rrexeν","date":"2016-06-12T12:44:04.280+0000","up_votes":1,"down_votes":0,"body":"Wäre ne Überlegung wert, ihn mal als Top oder Supporter im Premade zu spielen^^.","replies":[{"poster":"Ender Chest","date":"2016-06-12T13:42:19.451+0000","up_votes":1,"down_votes":0,"body":"Ein Kumpel von mir hat Lee Sin auf der Botlane mit mir zusammen gespielt. Sind schneller an Lvl 7 rangekommen.","replies":[]}]}]},{"poster":"Titanium70","date":"2016-06-12T13:57:18.578+0000","up_votes":1,"down_votes":0,"body":"Uhm, an wie vielen Objectives warst du beteiligt? (Drakes, Turrs, Nash, Herlad)\nAußerdem ist deine Kill Participation zwar hoch, aber nicht perfekt.\n\nDas sind so die 2 Punkte, die mir spontan einfallen. \n\n\nAuf meinem Aurelion (mit dem ich bei quasi jedem win S bekomme) habe ich immer extrem hohe Participation und hole viele Objectives. Keine Ahnung wie das für den JGL gewertet wird, aber daran könnte es liegen. =)","replies":[]},{"poster":"xXTheFalloutXx","date":"2016-06-12T13:24:45.801+0000","up_votes":1,"down_votes":0,"body":"Also ich habe es mit TF JGL ohne Probleme geschafft, brauche jetzt nur noch 600 Essenz. :P","replies":[]},{"poster":"Arzog93","date":"2016-06-12T12:50:06.410+0000","up_votes":1,"down_votes":0,"body":"53min 177 farm da hast deine antwort :)\n\nlg","replies":[]},{"poster":"Revelate","date":"2016-06-12T12:45:37.901+0000","up_votes":1,"down_votes":0,"body":"ich hatte schon mal mit 12/2/8 nen B- bekommen","replies":[]},{"poster":"BloodCrystalx3","date":"2016-06-12T12:43:37.149+0000","up_votes":1,"down_votes":0,"body":"Also mit Kindred klappt dieses sehr gut. \nMacht Schaden als Marksman, sowohl kannst gut Lanes/ deinen Jungle cleanen.","replies":[]}]}