{"poster":"Brate the best","date":"2017-09-20T18:03:29.811+0000","title":"Lethality und Ad unterschied","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Mal eine noob frage die mich aber schon sehr lange besch&auml;ftigt und zwar frage ich mich was ganz genau lethality &uuml;berhaupt ist. So wie ich es verstanden habe, negiert es armor und mr vom Gegner ( falls dies nicht stimmt bitte sagen ). Doch wo ist jetzt der unterschied zwischen zum beispiel ad runen oder lethality runen auf zum beispiel jhin oder zed nehmen? Weil wenn lethality wirklich armor und mr negiert ist es doch egal ob mein gegner weniger resistenzen hat oder ich mehr schaden. Bitte nicht direkt aggressiv werden ich bin neu und mich besch&auml;ftigt diese frage schon lange. Ich hoffe jemand erkl&auml;rt sich bereit den genauen unterschied zu erkl&auml;ren, damit auch ich es endlich wei&szlig;","replies":[{"poster":"Humpelstilzche","date":"2017-09-20T18:06:30.620+0000","up_votes":1,"down_votes":0,"body":"> So wie ich es verstanden habe, negiert es armor und mr vom Gegner ( falls dies nicht stimmt bitte sagen )\n\nNur Armor. \n\n> Doch wo ist jetzt der unterschied zwischen zum beispiel ad runen oder lethality runen auf zum beispiel jhin oder zed nehmen? \n\nAD erhöht deinen Schaden \"flat\", also um einen festen Wert. Die Steigerung durch Lethality ist im Endeffekt prozentual, da ja Rüstung den Schaden prozentual verringern und Lethality dafür sorgt, dass man einen Teil der Rüstung ignoriert. D.h. es hängt stark von der Situation ab, was von beidem dann am Ende in mehr Schaden resultiert.","replies":[{"poster":"Brate the best","date":"2017-09-20T18:22:27.097+0000","up_votes":1,"down_votes":0,"body":"Also hat man zwar mit Lethality im early game keinen so großen vorteil gegenüber ad runen, aber dafür im late game deutlich höheren schaden mit lethality oder ?","replies":[{"poster":"Humpelstilzche","date":"2017-09-20T18:43:53.573+0000","up_votes":1,"down_votes":0,"body":"Jein. Man muss auch bedenken dass Lethality umso schlechter wird, je mehr Rüstung der Gegner hat, was wiederum damit zusammehängt, wie die Berechnung der Schadenreduktion durch Rüstung funktioniert. \nAlso prinzipiell ist Lethality im Lategame besser, aber nur dann, wenn die Gegner nicht auch ihre Rüstung stark steigern.","replies":[]}]}]}]}