{"poster":"LiL Bunnie FuFuu","date":"2017-08-02T06:02:06.396+0000","title":"Placed into low priority queue for things completely outside my control","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hi,\n\nmy name is TiredOfLeague and, a few minutes ago, I was placed into low priority queue (20 minutes) for \"leaving games\". I had started a game and right before it began the client lost connection and I was unable to load it after trying to do so several times. I then looked at the programs running in the task manager and found that the league client was still running in the background so I closed it and the game opened. \n\nBecause of this, I was placed in low priority queue for 5 games even though I did not 1) have any intention of leaving and 2) did not close the client and exit the game for any reason other than to fix a (presumably buggy) client that would not even load it (in spite of my having a internet connection the entire time - I did several google searches to make sure) so that I could rejoin the game.\n\nIs there anything that can be done about this? I would prefer to avoid further punishments from Leavebuster let alone a ban, especially for something that I have no control over.\n\nThanks","replies":[{"poster":"Porocles","date":"2017-08-02T21:45:47.707+0000","up_votes":1,"down_votes":0,"body":"The client and the game are separate of each other.  You might have [Close Client During Game](https://i.gyazo.com/a39e12ca76e54359342203c476a0e9c1.png) enabled, which will close the client when loading into the game.  The game itself should still get you connected to the game server and launch the game.  It sounds like you might be having a connection problem reaching the game server, so I recommend going over the [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to troubleshoot.\n\nI know it was not your intention to leave, but [leaverbuster](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ) will treat all leaves equally because it still causes other players a negative experience.  It's really important to get this resolved, because based on that escalated timer it seems like you might have a history of leaves.  Take a break from matchmaking if necessary, until this is resolved for good!","replies":[]}]}