{"poster":"Turk e JD","date":"2016-08-07T23:18:57.165+0000","title":"HubGames RP e giochi gratis","subforum":"Off-topic","up_votes":1,"down_votes":2,"body":"ciao a tutti, vorrei parlarvi di un sito, creato da pochi mesi, e completamente made in italy. HubGames.\nIn questo sito, simile ai pi&ugrave; famosi TremorGame e Gamekit, si potranno ottenere HubPoints (valuta del sito) che potranno, in seguito, essere scambiati per giochi steam, RP, buoni steam, buoni amazon, PS card, ecc... o potranno essere usati per partecipare ad aste giornaliere per ottenere giochi steam, steam card ecc... o per partecipare a giveaways.\nGli HubPoints, al contrario degli altri siti sopa citati, possono essere solo guadagnati giocando a dei minigiochi (vengono dati punti ogni tot secondi random mentre si gioca) o attraverso le aste.\n\nL&#039;ho provato personalmente e posso dire che funziona ho gi&agrave; riscattato 20 euro di rp e vinto 3/4 giochi steam. l&#039;unica cosa che non potrebbe piacere a molti &egrave; che per fare punti bisogna spenderci leggermente pi&ugrave; tempo rispetto ad altri siti che offrono anche altri modi, tipo sondaggi, per ottenere  punti ma del resto &egrave; anche giusto sia cos&igrave;.\ncome gi&agrave; detto &egrave; un sito creato da pochi mesi e completamente italiano quindi non ci sono ancora moltissime persone ma &egrave; un sito che per me merita quindi anche solo se siete in queque per LoL e non sapete che fare andate a darci un occhiata e fare qualche game per vedere se vi piace il tutto.\n\nquesto &egrave; il link del sito: https://www.hubgames.it/\nquesto &egrave; il link di facebook: https://www.facebook.com/HubgamesIT/\n\n\nGrazie dell&#039;attenzione\n\n_Edit by NiraBlade - Emissary: referral non consentito_","replies":[{"poster":"99White Terror99","date":"2016-08-08T09:29:03.626+0000","up_votes":1,"down_votes":0,"body":"io l'ho provato, perchè non avevo più missioni che potevo fare su gamekit e anche perchè lì ora il cambio tra punti ed rp è aumentato incredibilemente rispetto all'inizio (l'ultimo preso erano 1350 rp e con i punti che ho usato in passato avrei potuto prendere quello da 3150 -.-), però mi trovo male, cioè, lo trovo  frustrante, forse anche perchè quasi tutti i giochi che provo a fare non vanno sul mio pc, però richiede veramente molto tempo\nte quanto ci hai messo a prendere la carta da 20€?","replies":[{"poster":"Turk e JD","date":"2016-08-08T20:10:11.485+0000","up_votes":1,"down_votes":0,"body":"per la carta da 20 ci ho messo un mesetto e mezzo.\ni giochi danno in media 2/3 punti al minuto ma alcuni, non so perchè, in media ne danno molti meno","replies":[{"poster":"99White Terror99","date":"2016-08-08T22:39:14.461+0000","up_votes":1,"down_votes":0,"body":"ok, si mi ero accorto che alcuni giochi davano punti meno spesso, il che è un pò una fregatura perchè non sai quali sono","replies":[]}]}]},{"poster":"Anubis Raven","date":"2016-08-08T01:42:13.000+0000","up_votes":1,"down_votes":0,"body":"guarda io gia da quando ho visto che i prezzi che mi interessano girano intorno a 7000 punti e per ogni gioco 1 punto lo prendi ogni minuto mi servirebbero 7000 minuti ovvero 110 ore di gioco su hub games che sinceramente non ho voglia di spendere","replies":[{"poster":"Turk e JD","date":"2016-08-08T20:17:40.596+0000","up_votes":1,"down_votes":0,"body":"in media i punti al minuto sono di 2/3 ma alcuni giochi si ne danno più o meno 1 al minuto e di certo non ti tirano 10 o 20 euro di roba solo per aver loggato... un po di tempo bisogna spederlo.\nanche se ci metti 3 mesi per una cosa giocando 30 minuti al giorno, mentre stai in queue o in champion select, non è male. \nson gusti","replies":[]}]},{"poster":"NiraBlade","date":"2016-08-08T04:48:39.871+0000","up_votes":1,"down_votes":0,"body":"ti ho editato il thread togliendoti il referral, benché lo avessi fatto in buona fede (scrivendo che cosa fosse, evitando un click bait) non è consentito postare i propri referral all'interno del nostro forum. \nVisto che precedentemente è stato consentita l'apertura di thread che guidassero gli altri utenti a siti come Gamekit non ritengo sia necessario chiuderti il thread (a meno che non mi vengano date altre indicazioni successive a questo messaggio), sopratutto visto che hai parlato sia degli aspetti positivi che di quelli negativi.\n---\nParlando invece del sito ho visto che accanto ad ogni premio c'è un numero in alto a sinistra - Premi rimanenti. Quindi una volta terminati bisogna attendere una specie di \"rifornitura\" del prodotto?","replies":[{"poster":"Turk e JD","date":"2016-08-08T20:12:47.709+0000","up_votes":1,"down_votes":0,"body":"non sapevo di questa cosa, scusa.\nper i giochi, ogni mese, se finiscono vengono riaggiunti (l'ho chiesto ai membri delle staff perchè non ero sicuro come funzionasse questa cosa)","replies":[]}]}]}