{"poster":"ShyN3ko","date":"2017-01-18T17:52:44.402+0000","title":"Illaoi Q Änderung","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":4,"body":"Illaoi Q:\r\nErh&ouml;ht den von Tentakeln veursachten Schaden. Wenn die F&auml;higkeit aktiviert wird, l&auml;sst Illaoi einen Tentakel ausschlagen, der normalen Schaden verursacht.\r\nPassiv: Schlagschaden wird um 10/15/20/25/30% erh&ouml;ht.\r\nAktiv: Illaoi schwingt ihren G&ouml;tzen und l&auml;sst dadurch ein Tentakel nach vorn schlagen.\r\n\r\n\r\n\r\nIch finde die Q sollte eine &Auml;nderung durchmachen,denn Illaoi soll eigentlich mehr ein Tank sein.\r\nAber diese Skalierung ist soooo hoch, das man 1-2 Damage Items immer baut.\r\nUnd sie k&ouml;nnte auch mal CC gut gebrauchen.\r\nDann w&auml;ren ihre Tentakel um ein&iacute;ges nerviger.\r\n\r\nZ.b. Ihre Tentakeln lassen ein Feld entstehen wenn sie zuschlagen.\r\nEs bleibt 1 Sekunden bestehen und slowt denn Gegner um 5/10/15/20/25/30%.\r\nUnd ihre Verteidigungswerte sinken um 5/10/15/20/25/30% wenn sie in einem Feld sind.\r\nWenn mehrere Felder aufeinander sind dann erh&ouml;hen sich beide Effekte nur um 50%.\r\n\r\nNur so als Beispiel :3\r\n\r\nViel Spa&szlig; gegen die Hentai G&ouml;ttin\r\nWenn sie weitere Ideen haben, dann bitte zu Illaoi gehen ;3\r\nGl and Hf","replies":[{"poster":"Flüssigsubstanz","date":"2017-01-18T18:21:28.917+0000","up_votes":2,"down_votes":0,"body":">Illaoi soll eigentlich mehr ein Tank sein.\n\nWer sagt das? Ansich ist sie ja mehr glaube ich generell als bruiser/juggernaut designed. Viel Damage gutes durchhalte vermögen dafür wenig CC/mobility. \n\nIch finde Illaoi ist in Ordnung so wie sie ist, man muss halt nur damit klarkommen auszuweichen oder einfach nicht in ihrer ulti fighten und challenger haben ja auch so mit ihr viel Erfolg. Siehe als beispiel Quas. Der ist zwar NA und nicht EU aber er spielt generell häufiger champs die seltener gespielt werden und schafft es mit den bis in Challenger. Wenn ich mich nicht irre war Quas auch der erste professionelle spieler der AP Nasus in die Welt gebracht hat. \n\nKlar die Änderung die du vorschlägst würde vielleicht dazu beitragen das man sie mal in der Esports scene sieht, aber notwendig hat sie das nun wirklich nicht,  da sie nunmal wie gesagt als Juggernaut schon richtig designed ist IMO.","replies":[]},{"poster":"Shakês Beer","date":"2017-01-19T13:40:28.433+0000","up_votes":1,"down_votes":0,"body":"Die Änderung ist unnötig.\nIllaoi ist momentan balanced - das hören viele Spieler nicht gerne aber es ist wahr.\nUnd es heißt: Never touch a running system - also sollte man das bei ihr auch nicht.","replies":[]}]}