{"poster":"UmLaiTunq","date":"2018-08-23T18:21:05.617+0000","title":"Nach Championselect Blackscreen .. Fehler \"Verbindung nicht möglich\"","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Hallo und schönen guten Abend an alle,\n\nNachdem die Championselect durch ist, bekomme ich bei Spielstart einen Blackscreen mit der Meldung: Verbindung nicht m&ouml;glich! Verbindung zum Server konnte nicht hergestellt werden. Bitte &uuml;berpr&uuml;fe deine Netzwerkverbindung und versuche, die Verbindung mit deinem Spiel wiederherzustellen.&quot; \n\n2 Auswahlm&ouml;glichkeiten:\n1) Wiederholen - Funktioniert nicht! Meldung kommt nach ca 30 sek einfach wieder!\n2)Abbrechen - Funktioniert ebenfalls nicht! Bin wieder im Clienten wo dann das Standartfenster Das Spiel l&auml;uft noch. Verbindung wiederherstellen. Dann geht der kram wieder von vorne los... Blackscreen + Fehlermeldung !\n\n-.- \n\nIch komme absolut in kein Game mehr rein... Leaverbuster natürlich vorprogrammiert … ! \n\nWas tun ?{{sticker:zombie-brand-clap}} \n\nHabe vergessen zu erwähnen dass eine Netzwerkverbindung vorhanden ist ! Internet läuft einwandrei!","replies":[{"poster":"UmLaiTunq","date":"2018-10-08T18:05:37.931+0000","up_votes":1,"down_votes":0,"body":"Bei mir war wohl ein NICHT aktueller Windows das Problem !\nHabe ein Windows update durchgeführt und auf den neusten Stand gebracht!\n\nEs läuft wieder einwandfrei :)","replies":[]},{"poster":"daKriegsDeKraetz","date":"2018-08-28T18:17:28.946+0000","up_votes":1,"down_votes":0,"body":"Ich habe seit 3 Tagen genau das selbe Problem, davor lief alles einwandfrei. Ich komme in kein Spiel mehr rein, und habe mittlerweile den Leaverbuster. Nervt extrem. BTW, alle Schritte aus dem Lag Hilfe Eintrag habe ich mithilfe des Hextech repairtools unternommen.","replies":[{"poster":"daKriegsDeKraetz","date":"2018-08-31T17:27:41.281+0000","up_votes":1,"down_votes":0,"body":"funktioniert seit dem patch von gestern wieder","replies":[{"poster":"daKriegsDeKraetz","date":"2018-09-01T00:28:04.898+0000","up_votes":1,"down_votes":0,"body":"nach 3 spielen tritt das problem jetzt leider wieder dauerhaft auf... habe auch wieder den bann; ich denk ich werde einfach deinstallieren; bye","replies":[]}]}]},{"poster":"aWakeLegend","date":"2018-08-27T17:05:03.266+0000","up_votes":1,"down_votes":0,"body":"Habe das selbe Problem. Bei mir funktioniert es manchmal nachdem ich \"Abbrechen\" drücke und auf \"Verbindung wiederherstellen\" drücke.\nAber meistens muss ich auf \"Abbrechen\", den LoL-Client neu starten und wieder auf \"Verbindung wiederherstellen\".\nWenn es dann immernoch nicht funktioniert, probier ich es einfach weiter und nach einer Weile geht es.\n\nVielleicht hat dir das ja etwas gebracht, falls du eine Lösung findest, das Problem einfacher zu beheben, würde ich mich sehr freuen!","replies":[]}]}