{"poster":"About 9 Kenyans","date":"2015-01-23T03:52:16.869+0000","title":"Toxic player","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Every single game I have played the past week players are getting more toxic, from harassment to just feeding and so on, is there going to be punishment for them? or are people like me going to be punished for dcing bc of league is broken as usual?","replies":[{"poster":"Kadaj","date":"2015-01-23T17:55:58.094+0000","up_votes":1,"down_votes":0,"body":"If you shut up and stop treating LoL like a chat program, the toxic people won't have anyone to be toxic toward.\n\nLess talking, more doing things. GG.","replies":[{"poster":"Oceanic Man","date":"2016-02-02T08:53:37.488+0000","up_votes":1,"down_votes":0,"body":"No that deosnt work, I was playing riven agasint garen and i played my part wrong and messed up badly went 4/10 cause i was having a bad game not only did i get flamed for loosing lane cause riven usually beats garen but i was insulted by the garen like wut... so are u telling me than one can't have a bad game like are u serious. i know reporting for intentional feeding doesn't do anything cause i wasn't intentionally feeding but i just hate that this type of people exist like u beat me ok don't have to shove it in my face shoot me with a bullet than proceed to spit on my remains like come on","replies":[]}]},{"poster":"Ingénue","date":"2015-01-23T10:11:32.119+0000","up_votes":1,"down_votes":0,"body":"Leaverbuster is an automated punishment that does not discriminate between accidental and purposeful afks, because either way you are decreasing the positive gameplay experience for the other members of your team. \n\nTo actually reform toxic behaviour such as insulting, intentionally feeding and threatening takes a larger scale psychological model to be effective. Creating an effective punishment system (e.g tribunal) takes a while due to having to factor in many aspects of why a player may be reacting like a ♥♥♥♥♥♥. \nRiot is taking steps to lower toxicity levels through positive reinforcement (IP boosts and mystery gifts) and negative punishment (chat restrictions, ranked restrictions). The tribunal has been ineffective in the past and is currently in the works for a makeover (no server has one right now).\n\nAt the current point in time,  there is only one way of reporting toxic behaviour, and this is reporting them at the end of game screen.\nAlternatively, I enjoy collecting game history and chat dialogue and once I hit 20-30 cases of toxic players I send the summoner names and evidence through a support ticket to Riot.","replies":[]},{"poster":"FetusDeletus1","date":"2015-01-23T05:43:11.563+0000","up_votes":1,"down_votes":0,"body":"Others being toxic won't excuse you for going AFK.","replies":[]},{"poster":"RNG Remilia","date":"2015-01-23T04:51:41.540+0000","up_votes":1,"down_votes":0,"body":"All these flavours...","replies":[]}]}