{"poster":"Unlucky Cuchu","date":"2016-01-06T19:39:07.837+0000","title":"Voglio riorganizzare la mia squadra per la season","subforum":"Reclutamento","up_votes":1,"down_votes":0,"body":"Salve a tutti, in vista della nuova season volevo riorganizzare la squadra (unranked) che avevo creato qualche tempo fa. Riorganizzare nel senso che ho gi&agrave; dei giocatori, ma purtroppo siamo sempre 2-3 e non riusciamo mai a mettere insieme un gruppo per giocare 5 v 5. Ho bisogno dunque di gente con questi requisiti:\r\n- Attiva, almeno la sera. E soprattutto **sempre** disponibile a giocare col team quando siamo tutti online.(nel senso che non si mette a fare soloq se almeno altri 4 compagni sono online)\r\n-Che usi o sia disponibile ad usare Teamspeak o Skype.\r\n-Che abbia almeno una presenza agli Lcs degli ultimi 3 anni..... scherzi a parte, basta che sia disponibile a impegnarsi al massimo e imparare dagli altri compagni.\r\nSe siete interessati aggiungetemi e presentatevi oppure scrivete qui :D \r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"megaltech98","date":"2016-01-24T11:44:42.694+0000","up_votes":1,"down_votes":0,"body":"ciao io sarei interessato maino top, gioco da 3 anni ed ho un ampio pick select. ho sia curse che skype che teamspeak e sono disponibile ogni giorno di sera","replies":[]},{"poster":"Satan My Master","date":"2016-01-10T12:57:00.274+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Unlucky Cuchu","date":"2016-01-10T17:39:04.789+0000","up_votes":1,"down_votes":0,"body":"mmm per quel ruolo siamo ben forniti, ti aggiungo comunque e ne parliamo bene","replies":[]}]},{"poster":"Skydago","date":"2016-01-10T13:54:34.925+0000","up_votes":1,"down_votes":0,"body":"Heilà\nSono un main mid che cerca un team per trovare il vero lato competitivo di LoL.\nMid so usare una gamma di champ più o meno buona\nIn ordine di esperienza: ahri, malzahar, ekko, ezreal, fizz, veigar, zed, fiddlesticks, diana e attualmente sto cercando di imparare leBlanc e Karma.\nSono NEGATO E DICO **NEGATO** ad usare Viktor e yasuo, perciò se mi vuoi chiedere di imparare dei champ per il team non questi due plz.\nSe ti va aggiungimi in game","replies":[]},{"poster":"Hype GENERAL ZOD","date":"2016-01-08T10:31:47.017+0000","up_votes":1,"down_votes":0,"body":"Sono silver2 ma dalle 10di qualificazione nn ho più fatto causa pessima esperienza con i compagni di team XD se serve un jungler/top lane aggiungimi pure.tendenzialmente uso sejuani,gragas in giungla e top darius,j4,gp o maokai ma se serve un champ specifico per il team vasta dire e lo imparo (oramai so le meccaniche del gioco quindi imparare nn é difficile). Se vuoi Adda.i e facciamo delle partite di prova per vedere se ci troviamo insieme e se ci andiamo bene a vicenda XD","replies":[{"poster":"Unlucky Cuchu","date":"2016-01-08T13:22:19.512+0000","up_votes":1,"down_votes":0,"body":"Certo ti aggiungo, volendo ci sono ancora un paio di posti","replies":[]}]},{"poster":"Akesha","date":"2016-01-07T13:24:50.164+0000","up_votes":1,"down_votes":0,"body":"Elo ??\nIo anche con altri amici del ts stiamo cercando di mettere su un team sopratutto che gioca la sera, siamo 5 ma non sempre on quindi cerchiamo altri membri anche per fare qualche normal il pomeriggio e stare in compagnia in ts.","replies":[{"poster":"Unlucky Cuchu","date":"2016-01-07T15:46:55.738+0000","up_votes":1,"down_votes":0,"body":"Sono silver, aggiungimi pure :)","replies":[]}]}]}