{"poster":"Kijaku","date":"2016-08-04T11:41:29.150+0000","title":"Analyst GESUCHT","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Das Deutsche Rankedteam Royal Spartans sucht einen professionellen Analysten der unser Team nach vorne bringen kann und uns einige basisdinge  erkl&auml;ren k&ouml;nnte. Das Team mag zwar nur Silber sein aber wir haben vor gro&szlig; rauszukommen und uns auf Challenger hochzuspielen. \n\nBei Fragen bitte einfach meinen ingamenamen adden.\n\n&Uuml;ber eine Zeitige Antwort w&uuml;rden wir uns sehr freuen.\n\nMit vielen Gr&uuml;&szlig;en\nNils (RSP M for Mature) Heine","replies":[{"poster":"AldoKing","date":"2016-08-04T12:20:05.897+0000","up_votes":1,"down_votes":1,"body":"Ich könnte euch bisschen helfen, bin derzeit plat 5, spiele mit/gegen plat1-2/dia5-4 spieler, also ist meine mmr nicht mal so schlecht glaub ich, wenn ihr bock habt, meldet euch bei mir.\nMfG AldoKing","replies":[{"poster":"CYPHΕR","date":"2016-08-04T12:29:47.736+0000","up_votes":3,"down_votes":0,"body":"Also die einzigen 5v5 Rankeds die ich bei dir sehe haben Spieler zwischen Gold 1 und Platin 3.\n\nInteressanter finde ich allerdings, dass du mit einem Champion den du vorher in allen Seasons im Ranked noch nie angerührt hast und in Normals fast schon extrem schlecht performst innerhalb eines recht kurzen Zeitraums eine extrem hohe Winrate mit extrem guten Stats hast.\nDanach hast du den Champ im Ranked aber nie wieder angerührt und nur noch mit anderen Champions ziemlich schlecht gespielt...","replies":[]}]},{"poster":"Killerkante","date":"2016-08-04T12:57:45.509+0000","up_votes":2,"down_votes":0,"body":">professionellen Analysten\n\nFür ein Silber Team? {{sticker:slayer-jinx-unamused}} \nNichts für ungut aber was wollt ihr mit Zahlen und Statistiken wenn ihr nichtmal wirklich die basics beherrscht?\n\nFangt erstmal klein an, sucht euch 'nen Coach der Erfahrung im Gold/Plat bereich und lasst euch fürs erste guiden.","replies":[]},{"poster":"RankaxLee","date":"2016-08-04T14:45:58.438+0000","up_votes":1,"down_votes":0,"body":"Was wir denn so bezahlt?","replies":[]},{"poster":"XerxesLOL","date":"2016-08-04T13:38:21.858+0000","up_votes":1,"down_votes":0,"body":"ich mag ja keine träume zerstören aber wer schon seit einer season silber ist wird wohl eher nicht challenger werden,allein innerhalb von dia 1-5 liegen welten","replies":[]}]}