{"poster":"Over Innsmouth","date":"2016-04-13T15:57:50.672+0000","title":"So...does everyone think Aurelion Sol is awful?","subforum":"Gameplay","up_votes":40,"down_votes":12,"body":"Really?\r\n\r\nI personally really like him. I like his design, his VO, the way he moves; almost everything is perfect.\r\n\r\nFor his gameplay; yeah I&#039;d admit he doesnt really do anything special. He hasnt got the raw burst some Champions are known for, or the range, or the utility, or the roaming power; but he has a bit of everything.\r\n\r\nW gives him range. Q gives cc (potentially a gigantic stun). He&#039;s got a little burst if you queue Q-R together. His E is actually among the top list for roaming power, and his teamfight is definitely one of the better examples I&#039;d say.\r\n\r\nSure, it takes a while to learn how to access his power, but once you do he&#039;s at least a formidable threat on the Rift.\r\n\r\nYeah, he&#039;s not blatant release bullshit like {{champion:245}} , {{champion:223}} , or {{champion:429}} were, but he&#039;s far away from {{champion:432}} levels of release-awful.\r\n\r\nIs it just me who thinks this?","replies":[{"poster":"Keevalroy","date":"2016-04-13T17:10:58.947+0000","up_votes":29,"down_votes":0,"body":"I think it's more that people are used to new releases having 3 pages worth of information for how your passive works and each ability doing 12 different things.     Sol is fine. Not obnoxious, not overloaded, not mobility creeped to hell, doesn't feel strong or weak...\n\nNah, Sol is great - I'd love it if Rabid Llama continued to design more champions.","replies":[{"poster":"A Miss Fortune","date":"2016-04-13T19:24:04.401+0000","up_votes":6,"down_votes":0,"body":"I agree, Aurelion Sol is really refreshing to have as a champion in League, especially when champions are beginning to have more passives than abilities on release with super overloaded kits. From a health/balance perspective I think he's really balanced and healthy in his state as a support-y mage. He usually relies on his team to back him up on his large AoE engages and when he roams, but when his team does followup he can be extremely successful.","replies":[]},{"poster":"Arakadia","date":"2016-04-15T04:17:44.443+0000","up_votes":1,"down_votes":0,"body":"I also would LOVE if Rabid Llama makes more champions. I'm a pretty big Bard player too, and his champions are some of my favorites.","replies":[]}]},{"poster":"Llanite","date":"2016-04-13T19:14:24.834+0000","up_votes":4,"down_votes":8,"body":"Hit kit lacks cohesion. His Q and E works well with each other but other than that, his W and R are cool abilities but have nothing to do with  the rest of the kit. \n\nSomething like Yasou or Llari are magnificent, you need to be able to use all 5 abilities to perform well. There are also no other version of them in other games. \n\nSol is ok, but nothing too special.","replies":[{"poster":"charcharmunro","date":"2016-04-13T20:20:53.863+0000","up_votes":10,"down_votes":0,"body":"...Llari?","replies":[{"poster":"KillerKell","date":"2016-04-14T04:38:50.234+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=charcharmunro,realm=NA,application-id=3ErqAdtq,discussion-id=oL7vEw0K,comment-id=001e0000,timestamp=2016-04-13T20:20:53.863+0000)\n>\n> ...Llari?\n\nHe meant Illinois.","replies":[]}]},{"poster":"Quepha","date":"2016-04-13T21:43:39.743+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Llanite,realm=NA,application-id=3ErqAdtq,discussion-id=oL7vEw0K,comment-id=001e,timestamp=2016-04-13T19:14:24.834+0000)\n>\n> Hit kit lacks cohesion. His Q and E works well with each other but other than that, his W and R are cool abilities but have nothing to do with  the rest of the kit. \n\nDid you notice the range that his R knocks the enemy back to? Or how the duration of the stun on his Q is the perfect length to hit the enemy with your passive? And how well a rylai's proc on his passive makes it easy to stun with a Q? Or what about how his E lets him roam to fights but has enough drawbacks to that process in terms of speed and vision that he can't really surprise enemies by doing that? Aurelion Sol's entire kit fits together very well to make a mid-range zoner/kiter.","replies":[{"poster":"Llanite","date":"2016-04-13T22:42:11.341+0000","up_votes":2,"down_votes":3,"body":"No one said he was weak. I said he was generic and ordinary. \n\nHe has no special combo, no setup, no reward or punishment for pulling/fail to pull all 4 spells. No unique skill required, someone who plays other long-ranged mage will pick him up in 1-2 matches and there would not be a great difference to a person who have been playing him exclusively 1000 games. \n\nSol's another 1001th champ that people will pick for roleplaying and look, not his kit.","replies":[{"poster":"Quepha","date":"2016-04-13T22:46:30.181+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Llanite,realm=NA,application-id=3ErqAdtq,discussion-id=oL7vEw0K,comment-id=001e00020000,timestamp=2016-04-13T22:42:11.341+0000)\n>\n> No one said he was weak. I said he was generic and ordinary. \n> \n> He has no special combo, no setup, no reward or punishment for pulling/fail to pull all 4 spells. No unique skill required, someone who plays other long-ranged mage will pick him up in 1-2 matches and there would not be a great difference to a person who have been playing him exclusively 1000 games.\n\nThis thread is about Aurelion Sol, I don't know who you're talking about.\n\nAurelion Sol, the only champion that needs to manage his movement and position to maintain a constant stream of dps at a specific range.\nAurelion Sol, the only champion with an indefinitely growing AoE stun, and on a regular ability no less\nAurelion Sol, the only champion who can constantly reapply the Rylai slow without even canceling his movement commands.\n\nNot only is he a unique mage, he is easily one of the MOST unique mages in the game.","replies":[{"poster":"Wimbledofy","date":"2016-04-14T04:10:51.505+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Quepha,realm=NA,application-id=3ErqAdtq,discussion-id=oL7vEw0K,comment-id=001e000200000000,timestamp=2016-04-13T22:46:30.181+0000)\n\n> Aurelion Sol, the only champion who can constantly reapply the Rylai slow without even canceling his movement commands.\n> \n\nSinged, amumu and syndra can all do this.","replies":[{"poster":"Quepha","date":"2016-04-14T04:54:35.967+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Wimbledofy,realm=NA,application-id=3ErqAdtq,discussion-id=oL7vEw0K,comment-id=001e0002000000000001,timestamp=2016-04-14T04:10:51.505+0000)\n>\n> Singed, amumu and syndra can all do this.\n\nsinged is 100% dependent on the enemy walking into his poison. Amumu's is very short range, and Syndra needs to land skillshots.","replies":[{"poster":"Wimbledofy","date":"2016-04-14T06:44:35.335+0000","up_votes":2,"down_votes":0,"body":"and aurelion needs to land his W/passive. Just because they have to do different things to apply rylais slow doesn't mean they don't fit the criteria you already said. You can edit it and change the criteria, but you can't say singed amumu and syndra do not do the same thing.","replies":[{"poster":"Quepha","date":"2016-04-14T15:16:42.534+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Wimbledofy,realm=NA,application-id=3ErqAdtq,discussion-id=oL7vEw0K,comment-id=001e000200000000000100000000,timestamp=2016-04-14T06:44:35.335+0000)\n>\n> Just because they have to do different things to apply rylais slow doesn&#x27;t mean they don&#x27;t fit the criteria you already said.\n\nIt does make Aurelion Sol into a different, unique champion who is certainly better at kiting for his team than any of the champions you mentioned.","replies":[{"poster":"Wimbledofy","date":"2016-04-14T22:51:24.307+0000","up_votes":2,"down_votes":0,"body":"yes i know, and i don't care, you completely missed my point. All i was pointing out was that syndra amumu and singed CAN APPLY RYLAIS CONSISTENTLY WITHOUT CANCELING MOVEMENT. Has nothing to do with who can do it best.","replies":[]}]}]}]}]}]}]}]},{"poster":"Ackelope","date":"2016-04-13T23:31:15.656+0000","up_votes":4,"down_votes":0,"body":"Use all 5 abilities? Where's the 5th that I've been missing?","replies":[{"poster":"Llanite","date":"2016-04-14T00:59:46.151+0000","up_votes":1,"down_votes":0,"body":"Passive shield fyi.","replies":[{"poster":"Ackelope","date":"2016-04-14T02:31:38.218+0000","up_votes":1,"down_votes":0,"body":"Ah yeah, passives can be very important, although I think it's pretty dependent on the champion at hand. In the case of Yasuo, oftentimes it feels like you can sorta forget about his passive and it does work on its own.","replies":[{"poster":"Llanite","date":"2016-04-14T03:31:06.597+0000","up_votes":1,"down_votes":0,"body":"You have to constantly move to \"activate\" it, which changes the playstyle dramatically. I've yet to find any Yasou \"sorta forget\" to charge it, even in bronze.","replies":[{"poster":"Ackelope","date":"2016-04-14T03:39:54.679+0000","up_votes":4,"down_votes":0,"body":"I'm not saying people forget to charge it, I'm saying it's easy to forget about because it charges on its own, you don't need to pay attention to it and play around it for it to be valuable. Not that it isn't useful when you're aware of it, though.","replies":[]}]}]}]}]},{"poster":"Troll for Trump","date":"2016-04-13T21:24:23.735+0000","up_votes":4,"down_votes":0,"body":"Yasuo is too synergistic, to the point where it's too strong.\n\nLike Lee Sin sorta. TOo much.","replies":[{"poster":"Llanite","date":"2016-04-13T22:27:58.718+0000","up_votes":1,"down_votes":3,"body":"Still a masterpiece.\n\nSomething like Yi might be balance, but awfully generic.","replies":[{"poster":"Troll for Trump","date":"2016-04-14T04:28:26.015+0000","up_votes":2,"down_votes":0,"body":"Yi isn't really that balanced. He's as generic as Yas.\n\nYas, the wandering lone wolf samurai, with a tragic past, where all his loved ones betrayed him/died. He was accused of a murder he didn't do, and he now seeks revenge towards the one that had commited the crime.","replies":[]}]}]}]},{"poster":"Gunslinger744","date":"2016-04-13T17:03:48.317+0000","up_votes":7,"down_votes":0,"body":"Everyone always thinks new releases are awful, I've caught myself doing it on several occasions.\n\n{{champion:202}} Now one of my favorite champions, and my go-to ADC\n\n{{champion:420}} Initial reaction was \"Ew\", now pretty positive about her\n\n{{champion:161}} Now one of the 2-3 champions I play when I'm not playing top lane.\n\n{{champion:119}} Was my main for like 2 years \n\nGiven a few weeks, people will lighten up to new releases. Sol is a very interesting hero that brings a lot of new mechanics to the table. A lot of change. People don't like change. Given time to adapt, they will like grow to like him eventually.","replies":[{"poster":"Shonjl","date":"2016-04-13T18:07:24.076+0000","up_votes":3,"down_votes":0,"body":"Wasn't Illaoi the opposite? Everyone thought she was broken as fk on release, but once people figured her out, she is literally Urgot and Yorick levels of played and bad?","replies":[{"poster":"JafarThePanda","date":"2016-04-13T21:49:47.578+0000","up_votes":4,"down_votes":0,"body":"She's still a decent top lane bully but I imagine she falls off late game because [insert ranged ADC here] can just poke her to death.","replies":[{"poster":"ForeverLaxx","date":"2016-04-14T17:06:02.910+0000","up_votes":2,"down_votes":0,"body":"That's because they built her entire kit around the lane phase. When you're in the part of the game where fights stop happening in your entrenched tentacle hatchery, there's nothing for you to do. Her entire sustain is built around those tentacles, and without them, she's not threatening. Even her ult, which I'm sure was supposed to compensate for this, has too small of an area to be effective.\n\nShe's pretty much the current posterchild for \"win lane, lose game\".","replies":[]}]},{"poster":"HayRoss","date":"2016-04-13T21:58:06.351+0000","up_votes":2,"down_votes":0,"body":"I put her in the same boat as Teemo, Good champion? No, not really, but HOLY FUCKING SHIT, playing against them is about as fun as sticking a rusty sawblade up your ass","replies":[]}]},{"poster":"Over Innsmouth","date":"2016-04-13T17:10:42.812+0000","up_votes":2,"down_votes":0,"body":"Jhin's a god if you can get to 3+ items. Helps that his VO/animations are amongst the best Riot's ever done.\n\nIllaoi is a lane bully I find, and she needs to at least win (if not dominate) to be relevant lategame. She's great, but she's not a top laner I'd pick in ranked.\n\nVel'Koz is amongst one of my favourite Champions right now, I picked him up about a month ago and I hate myself for taking so long (I started the game at the Vel'Koz release), but I still feel anxious picking him because of the current state of mages vs. AD shitlords.\n\nI think what people don't like most about Sol is his lack of flashiness. Sol doesnt kill you by {{champion:420}} summoning a god or {{champion:238}} neatly assassinating you. He takes his time exposing you to his wondrous stars, and as a player all you have to do is keep him in position.","replies":[{"poster":"Gunslinger744","date":"2016-04-13T17:59:05.146+0000","up_votes":2,"down_votes":0,"body":"Vel'koz is great, actually. His range and CC make it so he has no big issues with assassins. Bruisers are trouble, but you can reposition yourself easily while casting your AoE abilities. And NOBODY respects the Q slow. You should try it in a normal if you're nervous, he's really pretty good once you get used to him.","replies":[]}]}]},{"poster":"ZT Xperimentor","date":"2016-04-15T02:45:24.370+0000","up_votes":3,"down_votes":0,"body":"He would've been better, back in season 3 when positioning was important; before all this mobility & damage creep.","replies":[{"poster":"XantyLeonhart","date":"2016-05-03T17:04:47.250+0000","up_votes":2,"down_votes":0,"body":"Completely agree. Right now he is only good in teamfight scenarios so he can't get jumped on and insta-killed. His laning phase is garbage against anyone with a gap closer. He gets countered hard.","replies":[{"poster":"ZT Xperimentor","date":"2016-05-03T17:09:20.070+0000","up_votes":1,"down_votes":0,"body":"If riot wants him (or the other third of the champ list) to be played, they need to make most mobility (ekko, yasou, kalista, ext.) have some kind of debilitating cost (like what they did to blitzcrank).","replies":[]}]}]},{"poster":"ForeverLaxx","date":"2016-04-14T17:01:20.407+0000","up_votes":3,"down_votes":0,"body":"I don't think he deserves the nerfs he's getting, but that's because I view Anivia as the better of the two champions for what they bring to a team. The only thing A.Sol does better than Anivia is gank, and even that's pretty iffy at best. For team role and expected play pattern, and even the tools used to help offset their shared weakness to assassins, Anivia is the better option.\n\nA.Sol is fun, but most of his power and fun is tied into his mobility skill allowing him to carry a galaxy down lane. In standard play, I'd rather have an Anivia on my team.","replies":[]},{"poster":"LatetotheRace","date":"2016-04-14T05:43:10.054+0000","up_votes":3,"down_votes":0,"body":"I'm not sure why they released him into a meta where assassins and facehuggers are prevalent. I'm not exactly sure what was supposed to happen, but I don't think this is it.","replies":[{"poster":"KillerKell","date":"2016-04-14T18:48:16.577+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LatetotheRace,realm=NA,application-id=3ErqAdtq,discussion-id=oL7vEw0K,comment-id=0038,timestamp=2016-04-14T05:43:10.054+0000)\n>\n> I&#x27;m not sure why they released him into a meta where assassins and facehuggers are prevalent. I&#x27;m not exactly sure what was supposed to happen, but I don&#x27;t think this is it.\n\nWhich is why you play him Support.\n\nIf an Assassin is jumping the Support, the rest of the Team should be deleting the Assassin.","replies":[{"poster":"LatetotheRace","date":"2016-04-14T19:10:28.274+0000","up_votes":1,"down_votes":0,"body":"He does far too much collateral damage to be a support, and his crowd-control/harass are far too mediocre to be a successful support.","replies":[{"poster":"KillerKell","date":"2016-04-14T19:13:33.447+0000","up_votes":2,"down_votes":0,"body":"He has Poke.\n\nHe has a Buffer Zone that has to be bypassed to engage.\n\nHe has Hard CC.\n\nAs far as Collateral Damage (if you mean Accidental Creep Kill) a smart Sol can soften (if pushing) the wave and them reposition to not finish them.\n\nThere is literally nothing that keeps Sol from being a Frost Queen Support.","replies":[]}]}]},{"poster":"Profirix","date":"2016-04-14T15:16:37.770+0000","up_votes":2,"down_votes":0,"body":"THIS.","replies":[]}]},{"poster":"uJhisper","date":"2016-04-13T17:55:53.482+0000","up_votes":3,"down_votes":0,"body":"Hey, fellow Bard main & Aurelion Sol exhibitionist here. \n\nSimilar to Bard, you need to play Aurelion Sol knowing that your damage output is situational. He's very special in the way that his hit revolves around (no pun intended) knowing your enemy's mobility; he completely destroys champions who can't speed up/dash often. \n\nExample:\n\nAgain, a {{champion:92}} completely destroys Aurelion Sol. This is only because she can go in, stop your stars, shield, go out, and repeat. This leaves you with missing health and her's full.\nHowever, a champion with {{champion:10}}'s level of mobility is easy food for Sol. The enemy's speed is irrelevant to Aurelion, it's gap closers where the enemy can get in and out that are problematic. \n\nI think the problem with most Aurelion Sol players is that they're hesitant to use his (W) often. Use your W to poke, use your W to farm, use your W for _everything._ You'd be surprised that it doesn't use much mana at all -- it's not a Karthus E. I usually push the lane HARD with my W until they're stuck on their turret for a bit. I then ping either top/bot and gank constantly; flying over wards/walls/camps makes this extremely easy. His mobility could get him from mid to bot in a couple of seconds. When I see my lane pushing, I go back, clear, and repeat this. Your lane won't begin roaming either due to precious farm being eaten up by the turret.\n\nHe has major potential. A tank aurelion sol LATE game is terrifying. Anyone who thinks Aurelion Sol is garbage hasn't seen a good one yet.","replies":[]},{"poster":"Cremepie","date":"2016-04-13T16:23:00.934+0000","up_votes":1,"down_votes":0,"body":"1. He looks, sounds, and acts amazing.\n2. His game play is fun when you don't lane against someone who can easily jump/stick to you making your passive useless. We are playing in a time of high mobility so good luck with hitting Q's  in an offensive format in lane. \n3. I wouldn't call him underpowered at all and definitely is not overpowered either, he is just easily out played by a lot of strong champion kits.\n4. I think most players are not satisfied with his lanning phase as a result of the above.\n\nTD;LR Lanning phase countered by mobility leaves some players unsatisfied.\n\nI've only played him a couple times in bot matches, but I've lanned against him numerous times, not impressed yet.","replies":[{"poster":"Over Innsmouth","date":"2016-04-13T16:32:28.484+0000","up_votes":3,"down_votes":0,"body":"I can see that, but still - the sustained damage he provides in teamfights is pretty damn substantial. I'm happy to suffer through a painful lane (I frequently do, since my mains include {{champion:8}} {{champion:45}} and{{champion:112}} ) for that mid-lategame power.","replies":[]}]},{"poster":"Emperor Time","date":"2016-04-14T03:41:21.537+0000","up_votes":2,"down_votes":0,"body":"Idk I feel like he doesn't do a lot of meaningful things. Like he has one play making strategy and that's about it. He's very one dimensional, like Vi or Warwick.","replies":[]},{"poster":"5050BS","date":"2016-04-13T23:08:28.104+0000","up_votes":2,"down_votes":0,"body":"He is not as bad as {{champion:420}} is currently.","replies":[]},{"poster":"Critmaster Garen","date":"2016-04-13T16:09:03.090+0000","up_votes":2,"down_votes":0,"body":"i think his animations look absolutely amazing. not thrilled with his kit though, and his model looks kindof terrible.\n\nthe way his tail is phasing out and drags behind his body, looks like his lower half is lifeless and makes his head look way too big.\n\ni dont even like that they made him a mage tbh. they should have made him larger and a tank.","replies":[]},{"poster":"Junsui Aoi","date":"2016-04-13T16:07:31.159+0000","up_votes":2,"down_votes":0,"body":"He's just not that easy. His design and everything is super cool though!","replies":[]},{"poster":"Hethalean","date":"2016-04-13T16:05:59.237+0000","up_votes":2,"down_votes":0,"body":"I think that most people are unhappy with the skillcap required to be good with him compared with the skill cap of other champions released and how OP they were to how easy they were.","replies":[]},{"poster":"therealdragon","date":"2016-04-13T18:21:07.806+0000","up_votes":2,"down_votes":1,"body":"I also like how before boards was all like \"wtf sol so weak buff please\"\n\nNow a week later and people who actually KNOW sol are saying \"ummm....he isn't weak? He's good?\" and people are generally agreeing.\n\nHow the tables have fucking turned. (but whats new with over half the champs)","replies":[{"poster":"The Loveless","date":"2016-04-13T21:32:33.785+0000","up_votes":2,"down_votes":1,"body":"Typical boards thinking they know it all.","replies":[]}]},{"poster":"Oleandervine","date":"2016-04-13T16:40:47.938+0000","up_votes":2,"down_votes":1,"body":"I'm verging on regret for buying him. I like his concept, his appearance, and his voice lines. Hit kit is just clunky as hell, and he's not even a dated champion. He has little to no activity in his play style, other than find the perfect distance and wait for your opponent to die from star fire. Q and R are on such icky cooldowns that they're useless as both CC and burst, both of which Sol needs to make sure his excessively passive play style can kill his opponents. The E+Q combo is a gimmick at best, but overall, I don't like him from a game play standpoint. \nSome fixes I think would help:\n-AP or AS stats increase orbital speed of stars. Preferably AS, since he has to rely so heavily on AAs to do a lot of damage.\n-Have W increase orbital speed. Also have W change the orbital pattern from circular to atomic,  so that the stars cross through his center and give him some defense against being rushed. Sol dies waaaaaaaaaayyyyy too hard to being rushed, which is absolute death on arrival in the game of mobility creep. OR give W a sort of Sunfire Effect for Sol while he has it active. When W is active, he's most vulnerable to being rushed. This would help.\n-Drop his auto attack range to be that of his basic orbital. This would help immensely when trying to stick to enemies and ensure you can actually damage them with the stars.","replies":[{"poster":"XantyLeonhart","date":"2016-05-03T17:00:53.211+0000","up_votes":1,"down_votes":0,"body":"He doesn't need all that. What he really needs is just 2 very simple things:\n-His passive W range should be closer to him or have a bigger hitbox to cover melee range.\n-His Q should be changed so it can be insta-detonated like Anivia's Q.\n\nOtherwise, he is completely defenseles against anyone that gets in melee range with a gap closer: his passive cant even hit the enemy and his q will just pass through the enemy doing nothing. It is really frustrating and ridiculous that you don't have any way of defending yourself at melee range. At least Azir and the other mages can cast their spells at melee range.\n\nHalf the champions in the game have some way of gap closer, and thus can counter him easy. That is too much in my opinion to leave him the way he is right now.\n\nUntil they try to fix this, i'll keep building him with sunfire cape/cinderhulk, that way at least you can do some damage and not get insta-killed by any melee champ.","replies":[]}]}]}