{"poster":"bloodreddragon26","date":"2016-05-25T02:18:08.976+0000","title":"Champion Mastery and how to get points???","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hey guys,\r\n\r\nI am a new player and have been wondering why I don't seem to be getting any mastery points with my character - Ashe\r\n\r\nI would hate to be the noob playing PVP as I am lvl10. Everyone hates a noob right? So I have been playing bots to get my runes and help me level up but not once have I received mastery points. \r\n\r\nMust I be a certain level to get mastery points or is it simply not available whilst playing against A I \r\n\r\nI have read about 3 threads from riot but none of them list the basic requirements for earning champion mastery points, should include level requirement, what style of game (PVP or Bots or twisted tree, etc. ) and maybe an incentive of the kind of rewards that will be available other than a badge :p\r\n\r\nIf someone can clear this up, that would be swell :)\r\n\r\nKind regards,\r\n\r\nBlood Red Dragon","replies":[{"poster":"RiotBok","date":"2016-05-25T03:39:00.469+0000","up_votes":4,"down_votes":1,"body":"Welcome to League of Legends! To answer your specific question, Co-Op vs. AI is not eligible for Champion Mastery points.  To save you a few clicks, Champion Mastery is currently available in Summoner's Rift normal (blind/draft), ranked queues, and all rotating game modes.\n\nAs to your other questions, pretty much all of that information is available in the [Champion Mastery Guide](https://support.riotgames.com/hc/en-us/articles/204211284-Champion-Mastery-Guide) on our support site :D  Let me know if you have any other questions and I'll be happy to help you find answers","replies":[{"poster":"Kürama","date":"2016-05-25T22:07:01.759+0000","up_votes":1,"down_votes":0,"body":"When is TT gonna have this feature?","replies":[]}]},{"poster":"AshKetchup ","date":"2017-09-17T06:53:18.265+0000","up_votes":1,"down_votes":0,"body":"ohhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh i was wondering the same lol i have been playing bots the whole time sad","replies":[]},{"poster":"Tract","date":"2016-05-26T02:28:28.087+0000","up_votes":1,"down_votes":0,"body":"Welcome to League! I generally only give this offer to those punished in Player Behavior and Moderation who need help getting back on their feet, but feel free to add me and I will explain what I can if you want :)","replies":[]}]}