{"poster":"Resault","date":"2020-02-20T13:54:30.119+0000","title":"ADC MIDLANER E JUNGLER PER TEAM SERIO CON COACH (elo bronzo/silver basso)","subforum":"Reclutamento","up_votes":2,"down_votes":0,"body":"Come dal titolo, stiamo cercando delle persone per comporre un team di elo bronzo/silver alto academy di un altro team gold nei seguenti ruoli:\r\n- Jungler\r\n- Midlaner\r\n- AdCarry\r\nSe siete dei Toplaner o dei Support non esitate comunque a contattarci, per magari un ulteriore academy, ma nulla di certo al momento.\r\nGli obbiettivi di questo team sono il miglioramento e il solito divertimento in compagnia ma con un minimo di serietà quando necessario. I requisiti che dovreste avere per entrare sono:\r\n- Serietà e voglia di migliorare \r\n- Possibilità di presiedere a un minimo di due allenamenti settimanali\r\n- Disposizione ad ascoltare eventuali consigli e/o champion assegnati da allenare dal suddetto coach\r\n\r\nNel caso siate interessati e abbiate tutti i requisiti sopra citati contattate me o \"Fraycx\" su LoL\r\nGrazie e buona giornata","replies":[{"poster":"ParionS","date":"2020-02-21T12:32:41.993+0000","up_votes":1,"down_votes":0,"body":"main jgl se volete vi lascio il mio id: ParionS","replies":[{"poster":"Resault","date":"2020-02-22T13:28:12.667+0000","up_votes":1,"down_votes":0,"body":"ti ho mandato la richiesta","replies":[]}]},{"poster":"Rivai Akkaman","date":"2020-02-20T16:28:35.572+0000","up_votes":1,"down_votes":0,"body":"Io sono Rivai Akkaman Silver 4, main adc, se volete aggiungetemi!","replies":[]},{"poster":"GorillaNecro","date":"2020-02-20T15:36:42.337+0000","up_votes":1,"down_votes":0,"body":"Salve, Sono gorillanecro\nGioco/provo a mainare  jungler(OTP WW) sono elo gold IV solo perchè voglio prendere la skin a fine season (eh già),però non sono fortissimo.. faccio ancora tanti errori, se vorreste sono disponibile al momento tutti i giorni dato che sono in malattia fino al 24.\nP.S gioco anche support (Pyke,Senna,Morgana)\nFlammo poco, non bestemmio però sono molto silenzioso.\nContattatemi.","replies":[]}]}