{"poster":"FerrymanOfHades","date":"2016-08-25T22:12:27.921+0000","title":"Prendere S con un support in aram. Mission impossible?","subforum":"Aiuto e supporto","up_votes":2,"down_votes":0,"body":"Buona sera, scrivo in merito all&#039;ennesima beffa con support in aram. premetto che non sono un abile giocatore quindi per me sono molto rari i gradi S, ma se gioco support in aram, tipologia di game che mi intriga di pi&ugrave; me la cavicchio. detto questo ritorno alla beffa, dopo diverse partite come support (non cito quelle dove sono tank o adc o ap) continua a venirmi grado A o A+, dapprima ho pensato che fossi morto troppe volte, o ucciso troppo, oppure troppe poche assist, ma porca miseria con l&#039;ultima partita fatta avevo Soraka e ho concluso con un (secondo me) raguardevole 2/4/49 su 57 kill totali della squadra ed ecco la beffa, A+. mentre un membro della mia squadra con kyle ha fatto 21/9/22 e ha preso il grado S-. che diavolo devo fare per predere quei forzieri maledetti!!!!","replies":[{"poster":"ObsidianSin","date":"2016-08-26T13:33:07.111+0000","up_votes":2,"down_votes":1,"body":"Il degrado dei commenti... sinceramente io gioco aram per provare tattiche impossibili, e non punto alle S, ma ovviamente ogni tanto ne prendo. Sono riuscito 1 sola volta a prendere gradi alti con i support in aram: S+ con soraka. Grazie a un bellissimo punteggio di 9/7/69. Partita durata secoli, dove il mio punteggio di guarigioni era maggiore dei danni subiti dal tank e dal carry messi insieme. Sinceramente se vuoi prendere S in aram ti consiglio di non fare support, ma di buildarti carry.","replies":[]},{"poster":"Kim114","date":"2016-08-25T22:28:33.220+0000","up_votes":1,"down_votes":1,"body":"In ARAM le casse non vengono date da quel che ricordo...\nProva a usare {{champion:14}} supp, io così ho cambiato il mio voto medio (B+) a prendere tante S consecutive","replies":[{"poster":"NiraBlade","date":"2016-08-26T04:53:39.034+0000","up_votes":1,"down_votes":0,"body":"Prima che introducessero i voti in aram infatti non era possibile, ora invece dovresti riuscire ad ottenerli","replies":[]}]},{"poster":"Piemoo","date":"2016-08-26T01:52:03.033+0000","up_votes":1,"down_votes":1,"body":"Per sbaglio ogni tanto mi è capitato di beccare qualche S in aram, basta che giochi un minimo safe. Forse anche troppo, visto che in aram tenti le giocate del secolo, morendo miseramente e in teoria non dovrebbero flammarti :D\n\nSulle chest non sono sicuro, ma mi pare di averle ottenute in aram. Ricordo bene o sbaglio? E' da tanto che non gioco.","replies":[]},{"poster":"oroora6","date":"2016-08-26T01:40:16.838+0000","up_votes":1,"down_votes":1,"body":"in aram non ci sono support, c'è la distruzione, uno non gioca aram \"per andare support\", lo gioca perchè... hem.... scusate perchè la gente gioca aram? ah si, per lamentarsi che una modalità fatta per essere sbilanciata, sia sbilanciata\n\nvai nella landa se vuoi le S","replies":[]}]}