{"poster":"IROTRAS","date":"2017-01-25T17:20:35.097+0000","title":"ivern, nautilus o orianna?","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"salve a tutti,\r\nso che sono tre champ molto diversi ma sono veramente indeciso su cosa prendere.\r\nSto cercando un nuovo champ divertente da giocare perch&egrave; ormai mi annoio a giocare sempre gli stessi, qualsiasi consiglio &egrave; ben accetto.\r\ngrazie mille in anticipo.","replies":[{"poster":"WhiteToArcher","date":"2017-01-25T17:39:12.397+0000","up_votes":1,"down_votes":0,"body":"Come dice Fedy nautilus è giocabile quasi ovunque.\nOrianna sa essere molto utile al team, perchè puoi farci le wombo combo.\nIvern è un campione particolare sin dal suo clear della giungla, trovo una meccanica carina quella di creare bush per la mappa, e secondo me potrebbe essere uno dei pochi jungler che non soffre delle ultime modifiche della giungla e che potrebbe addirittura approfittarsi delle difficoltà del jungler avversario.\n\nDecidi tu quello che ti piace, anche se ti consiglio di provarli qualche volta quando sono free. Tendenzialmente sono campioni abbastanza differenti, poichè Orianna si gioca MID, Nautilus si gioca solitamente SUPP o TOP, e Ivern si gioca solitamente JUNGLER.","replies":[{"poster":"Ringiel","date":"2017-01-25T18:32:35.074+0000","up_votes":1,"down_votes":1,"body":"ivern a elo basso non funziona ... è un champ che porta solo utilità e deve far vincere in modo assurdo l'early ai suoi compagni(stile {{champion:64}} ma molto più difficile perchè non ha danni),altrimenti andando avanti in game il team si trova con un champ che non ha tutti sti gran cc e nemmeno danni.\nconviene giocarlo support,anche se non sfrutta la passiva,piuttosto che giungla.","replies":[{"poster":"WhiteToArcher","date":"2017-01-25T18:47:54.300+0000","up_votes":1,"down_votes":0,"body":"Si è possibile che sia un champion da early, ma questo non significa direttamento che in elo basso non worka. \nIo personalmente non posseggo il campione e al momento non mi interessa (perchè gioco mid), ma secondo me utilizzato con un pò di logica potrebbe essere utile anche in late grazie a Daisy.","replies":[{"poster":"Ringiel","date":"2017-01-25T19:15:22.114+0000","up_votes":2,"down_votes":0,"body":"il problema non è lui ma i suoi compagni ^^' ogni champ può workare,ma se i tuoi compagni non sanno sfruttare il vantaggio che porti e ti ritrovi in late game,il tuo team avrà 2 support al posto di 1 e 20k di danni in meno ... i cc non ti portano alla vittoria se mancano i danni.","replies":[]}]}]}]},{"poster":"Orgazmico","date":"2017-01-25T19:14:31.617+0000","up_votes":1,"down_votes":0,"body":"Nautilus...con l'attacco base blocca i movimenti del champ avversario, afferra in stile blitz e in caso di mischia, la final stunna tutti gli avversari che incontra sul cammino","replies":[]},{"poster":"Ringiel","date":"2017-01-25T18:41:55.705+0000","up_votes":1,"down_votes":0,"body":"{{champion:61}}  è un mid,{{champion:111}}  top/giungla/support e {{champion:427}} giungla/support... tra i tre io ti consiglierei {{champion:111}} visto che è quello più versatile,però se sei un main mid,orianna è un ottimo pick,visto che ha un ulti che se data bene può far vincere un team fight alla tua squadra;\nivern te lo sconsiglio ... è un champ completamente da early game,ma è privo di danni(non può invadere) e in giungla attualmente c'è sicuramente di meglio tipo {{champion:254}} {{champion:154}} {{champion:120}},ma se proprio vuoi un champ da early c'è sempre il buon vecchio {{champion:64}}","replies":[]},{"poster":"fedy99","date":"2017-01-25T17:32:19.671+0000","up_votes":1,"down_votes":0,"body":"Nautilus lo puoi giocare ovunque ap ad e tank","replies":[]}]}