{"poster":"Sir DaL","date":"2015-02-02T21:30:42.980+0000","title":"Tips para crear mensajes en el foro como un titán","subforum":"Charlas Generales","up_votes":9,"down_votes":1,"body":"{{champion:85}} **1.    Usa la ~~fuerza~~ fuente, Luke**\n\nEl botón [ ? ] a la derecha del recuadro tiene un montón de información acerca de cómo \ndarle formato a tus mensajes –la elegante negrita, la intrépida cursiva, la poco \nimpresionable línea de tachado. Se trata de herramientas que pueden serte muy útiles al \ndarle forma a tus mensajes. Juega con ellas y descubre lo que eres capaz de crear. ¡Utiliza \n# antes de cada bloque de texto para hacerlo un poco más grande!\n\n------------\n\n{{champion:107}} **2.    Incrustación directa de imágenes**\n\nGracias a sitios como imgur que permiten vincular imágenes, puedes incrustar elementos \nvisuales directamente en tus mensajes. Las imágenes se ajustarán automáticamente hasta \nuna escala máxima de 425px. Con esto, puedes crear encabezados fantásticos, hacer \ncapturas de pantalla de tus trabajos o dividir los párrafos con líneas separadoras \npersonalizadas.\n\n------------\n\n{{item:2052}} **3.    Campeones, hechizos, objetos**\n\nAl igual que en la sección de comentarios de las noticias, tienes la habilidad de escoger tus \níconos favoritos del juego y utilizarlos en un [[FLASH]]. La cantidad de bromas que puedes \ncrear tiene como único límite tu imaginación, y todo esto será [[VI]]-sible para los demás.\n\n------------\n\n{{summoner:17}} **4.    Alineación de textos**\n\nEsto va para la gente que busca algo un poco más complicado. Puedes usar tablas para \nalinear tus textos. Estas tablas tendrán líneas divisorias invisibles, con las cuales podrás \nasegurarte de que la columna donde está tu texto esté correctamente alineada.\n\nArriba de las líneas divisorias, crea los encabezados de las tablas, y usando las mismas \nlíneas divisorias (:-- para alinear a la izquierda; :--: para centrar; y --: para alinear la \nderecha) ubica tus textos tal como tú prefieras.\n\nSi eliminas el texto entero de las otras columnas y sólo dejas el del centro, tendrás una \ncolumna central perfectamente centrada, válgame la redundancia, y si eres aún más \ncreativo puedes recortar la sintaxis todavía más.\n\nEste ejemplo es un tanto básico. Estamos seguros de que tú podrás hacer algo mejor.\n\n------------\n\n{{champion:27}} **5.    Vota, crea, experimenta**\n\nDe lo que se trata es de experimentar con el formato y descubrir todo lo que eres capaz de \ncrear. Seguiremos haciendo ajustes a los foros, así que dinos qué otros elementos te \ngustaría tener y cuáles crees que no están funcionando como deberían.\nEsto es todo por el momento. Utiliza este mismo hilo de discusión para poner a prueba tus \nhabilidades en los comentarios de abajo.","replies":[{"poster":"Nagato Akatsuki","date":"2015-02-02T22:07:22.378+0000","up_votes":3,"down_votes":0,"body":"Gracias por la Guía Sir DaL, también lo invito a responder a las diversas necesidades y preguntas que mantienen muchos jugadores en el foro, saludos!","replies":[]},{"poster":"Vön Kelsier","date":"2015-02-08T12:49:01.404+0000","up_votes":1,"down_votes":0,"body":":-- hola --:\n","replies":[{"poster":"Vön Kelsier","date":"2015-02-08T13:18:32.361+0000","up_votes":1,"down_votes":0,"body":":--::--:asd:--::--:","replies":[]}]},{"poster":"Ionian Blade","date":"2015-02-03T17:12:26.927+0000","up_votes":1,"down_votes":0,"body":"¡Gracias Lince con la legendaria pelada de {{champion:201}}!\nAhora podemos hacer mensajes como unos verdaderos troesmas que la tienen re clara {{summoner:13}}","replies":[]},{"poster":"rokushoger","date":"2015-02-03T13:34:36.071+0000","up_votes":1,"down_votes":0,"body":"Ni ahí me voy a poner a utilizar todo eso, soy demasiado vago para eso jajajajajajj, pero gracias por la info igual.","replies":[]},{"poster":"LordHarek","date":"2015-02-03T12:11:25.599+0000","up_votes":1,"down_votes":0,"body":"Hola, **Sir Dal **\n\nte hago una pequeña consulta:\n\nPor que en nuestro foro cuando hay muchos comentarios en un thread, este mismo no se divide o ordena por paginas. Por ejemplo en el [thread](http://boards.las.leagueoflegends.com/es/c/charlas-generales/Lwgf2J4G-tutorial-subo-imaagenes-en-15-segundos-y-te-lo-muestro) donde explicas como subir una imagen en 15 segundos, actualmente tiene 97 Comentarios y cuando vas bajando para abajo para leerlos aparece un boton que dice: \"**Mostrar Mas**\"\n\nPregunto esto por que he visto en los foros de NA que hay threads con **menos** comentarios y los divide en paginas. Acá un dejo el link de un thread de NA como ejemplo:\n\nhttp://boards.na.leagueoflegends.com/es/c/GD/hZWEETtJ-moderation-universal-rules-report-button\n\nEse mismo, marca que tiene unos 67 comentarios y los comentarios están divididos en 4 paginas. \n\nCreo que seria bueno tener el mismo sistema aca, ya que es medio incomodo apretar el botón, para ver comentarios que están bien al fondo.\n\nSaludos.","replies":[]},{"poster":"Raki96","date":"2015-02-03T06:25:29.386+0000","up_votes":1,"down_votes":0,"body":"***Un honor usar todas estas ~~Mierdas~~ hermosas herramientas ***","replies":[]},{"poster":"ALEXKOND","date":"2015-02-03T00:29:28.878+0000","up_votes":1,"down_votes":0,"body":"Sir, por algún motivo las imágenes externas no se muestran en los hilos (solo se ven los enlaces en texto) ¿Se debe a algún error de la página? ¿O hay que cumplir algún tipo de requisito para que muestre las imágenes?\n___\nhttp://s23.postimg.org/5x8mnf9ff/No_Leer.jpg","replies":[]},{"poster":"ALEXKOND","date":"2015-02-03T00:27:49.795+0000","up_votes":1,"down_votes":0,"body":"Sir, por algún motivo las imágenes externas no se están mostrando (solo se ve el enlace a ellas) ¿Se trata de un error de la nueva página? ¿O hay que cumplir algún tipo de requisito para que si las muestre?\n___\nhttp://forums.las.leagueoflegends.com/board/attachment.php?attachmentid=24010&d=1422908631","replies":[]},{"poster":"GaßY","date":"2015-02-02T22:57:53.523+0000","up_votes":1,"down_votes":0,"body":"**Negrita**  *Cursiva*  ~~Tachado~~\n> ¿cita?\n\n\nA veces extraño los comandos comunes de un foro \"Standard\"... (me refiero a los que aparece \"[b][/b]\" y así).","replies":[{"poster":"LordHarek","date":"2015-02-02T23:03:46.045+0000","up_votes":1,"down_votes":0,"body":"Igual, pero bueno habrá a que acostumbrarse, de todas formas para algo están los botones. Faltaría que agregaran el Subrayado.\n\n_Saludos_","replies":[]}]},{"poster":"LordHarek","date":"2015-02-02T22:00:41.644+0000","up_votes":1,"down_votes":0,"body":"#Probando:\n\n:-- hola\n:--: hola\nhola --:\n\n:--:hola\nhola--:\n:--hola\n:--hola;\n:--:hola;\n:hola--:\n\nSin exitos mode {{champion:32}}  On. Lo único que tubo éxito fue lo del texto mas grande {{champion:119}} .","replies":[]},{"poster":"lordeman10","date":"2015-02-02T21:47:58.004+0000","up_votes":1,"down_votes":0,"body":"ummm por que no se alinea a la derecha?\nhola?  --:\n\n:--: hola :--:","replies":[{"poster":"Excorpion","date":"2015-02-02T21:57:13.149+0000","up_votes":1,"down_votes":0,"body":":-- sirve ?\no no ?\nparece que no\n:--: hello ?\n:-- hellow \n--: naah","replies":[]}]},{"poster":"LordHarek","date":"2015-02-02T21:55:15.147+0000","up_votes":1,"down_votes":0,"body":"Gracias por este mini guia Sir Dal {{champion:201}} .\n\nYa que estamos con respecto al punto **2.** no se si es problema mio, pero desde unos días me pasa que ahora las imágenes no se ajustan automáticamente, no se me ven, si no me quedan como Links. Lo puedes apreciar en tus guías de [subir imágenes](http://boards.las.leagueoflegends.com/es/c/charlas-generales/Lwgf2J4G-tutorial-subo-imaagenes-en-15-segundos-y-te-lo-muestro).\n\n**3.**\n\nMe parece genial la idea de que hayan agregado iconos tanto para los comentarios y thread. {{summoner:31}} \n\n**4.**\n\nNo estaba enterado sobre lo de alinear textos, es un poco difícil entender como se hacen, deberían agregarlo como botones para crear los threads de forma sencilla.\n\n**5.**\n\nSobre sugerencias tengo algunas pero para no hacer largo el comentario te dejo un thread que hice hace uno días: [Link](http://boards.las.leagueoflegends.com/es/c/charlas-generales/sIwgcuby-sugerencias-para-el-nuevo-foro).\n\nSaludos.","replies":[]},{"poster":"ReturnSpeedTwo","date":"2015-02-02T21:43:44.928+0000","up_votes":1,"down_votes":0,"body":"*Ya lo había visto, pero ty*","replies":[]}]}