{"poster":"Sir DaL","date":"2015-01-19T18:01:47.439+0000","title":"Contactar al soporte","subforum":"Problemas Técnicos","up_votes":23,"down_votes":13,"body":"El soporte de Riot games, son todas aquellas personas que tienen bases de conocimientos técnicos dentro y fuera del juego, que ocasionalmente (no siempre, no son dioses y no todo lo pueden hacer y resolver por si mismos, pero a eso vamos mas arriba) pueden resolver nuestros problemas referentes al juego \"League of Legends\"\r\n\r\nEn primer lugar, como contactar al soporte. para esto hay 2 formas\r\n\r\n1) dando click en el botón que dice \"SOPORTE\" en la parte superior derecha de su pantalla\r\n\r\n2) ingresando a la pagina de soporte directamente en este https://support.leagueoflegends.com/home/?locale=1194\r\n\r\nDeben registrarse en la pagina de soporte, para mas facilidad y comodidad, ya que si no estan registrados no podrán ver su registro de solicitudes\r\n\r\ndesde este link que les adjunto pueden enviar una solicitud directamente, rellenando previamente los campos, recuerden lo que dice a la derecha de la pantalla sobre los (*)\r\n\r\n\r\nTambién recuerden seleccionar correctamente su servidor e idioma y la razón por la cual envían el ticket para que este sea respondido directamente por el departamento correspondiente.\r\n\r\npero la parte mas importante del ticket que envíen es la descripción, mientras mejor describan su problema, y menos divaguen en cosas sin importancia que rodean al mismo, el soporte podrá puntualizar mejor en el mismo, ayudarlos mas efectivamente.\r\n\r\n____________________________________________________________________________________________________\r\n\r\n\r\nMUCHAS GRACIAS POR SU ATENCIÓN y espero que esta guía corta y sencilla en mi opinión ayude a muchas personas con la duda de como enviar una duda o solicitud al equipo de soporte de RIOT latino\r\n\r\nCreditos de esta guía para DeeJam","replies":[{"poster":"Pablincho","date":"2015-02-14T06:01:23.951+0000","up_votes":13,"down_votes":3,"body":"No entro demasiado para pedir ayuda de ustedes pero la verdad esto ya es un caso que no tiene solución y yo como muchos otros estamos sufriendo perdidas de tiempo debido a que jugamos con gente que no entiende el juego, se dedica a molestar o simplemente decide perder la partida. Me hacen perder tiempo y puntos de liga que cuesta demasiado subir, por lo que después de mucho pensar creo que la mejor solución para su servidor que realmente tiene muchas deficiencias es que:\n1.- Tenemos que poder salir de las colas de clasificatorias sin perder puntos ya que cuando te das cuenta que alguien de tu equipo esta eligiendo mal apropósito la partida se pierde antes de empezar.\n2.- Tenemos que poder excluir del emparejamiento futuro en solo duo cuando alguien arruina una partida muriendo repetidas veces con el único fin de perder, hoy solo tenemos los reportes que por cierto ustedes no leen. Tenemos que tener la opción de ignorarlos.\n3.- Van varias veces que realizo reportes y ustedes no leen o no los tienen en cuenta.\n4.- Cuando un jugador deja de jugar una partida se lo penaliza con 5 a 30 min de espera, pero el hecho de que 4 personas pierdan su tiempo por culpa suya debería ser penalizado con mas perdida de puntos de liga y no poder entrar a partidas durante un día. \nentre otras cosas estas son las mas notables.\nEspero que minimamente me respondan ya que de nosotros los jugadores ustedes viven basiacamente pero no se ocupan de nuestro bien estar en el juego gracias.","replies":[{"poster":"AguustinOX","date":"2015-09-15T19:15:19.556+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Pablincho,realm=LAS,application-id=X54mVVp0,discussion-id=yP5chBPb,comment-id=0018,timestamp=2015-02-14T06:01:23.951+0000)\n>\n> No entro demasiado para pedir ayuda de ustedes pero la verdad esto ya es un caso que no tiene solución y yo como muchos otros estamos sufriendo perdidas de tiempo debido a que jugamos con gente que no entiende el juego, se dedica a molestar o simplemente decide perder la partida. Me hacen perder tiempo y puntos de liga que cuesta demasiado subir, por lo que después de mucho pensar creo que la mejor solución para su servidor que realmente tiene muchas deficiencias es que:\n> 1.- Tenemos que poder salir de las colas de clasificatorias sin perder puntos ya que cuando te das cuenta que alguien de tu equipo esta eligiendo mal apropósito la partida se pierde antes de empezar.\n> 2.- Tenemos que poder excluir del emparejamiento futuro en solo duo cuando alguien arruina una partida muriendo repetidas veces con el único fin de perder, hoy solo tenemos los reportes que por cierto ustedes no leen. Tenemos que tener la opción de ignorarlos.\n> 3.- Van varias veces que realizo reportes y ustedes no leen o no los tienen en cuenta.\n> 4.- Cuando un jugador deja de jugar una partida se lo penaliza con 5 a 30 min de espera, pero el hecho de que 4 personas pierdan su tiempo por culpa suya debería ser penalizado con mas perdida de puntos de liga y no poder entrar a partidas durante un día. \n> entre otras cosas estas son las mas notables.\n> Espero que minimamente me respondan ya que de nosotros los jugadores ustedes viven basiacamente pero no se ocupan de nuestro bien estar en el juego gracias.\n\nTotalmente de acuerdo","replies":[]},{"poster":"KALUS","date":"2016-05-21T19:31:27.316+0000","up_votes":2,"down_votes":0,"body":"Carnal me hiciste llorar RESPECT","replies":[]},{"poster":"Ch3jetOw","date":"2016-08-05T18:42:00.590+0000","up_votes":1,"down_votes":0,"body":"Pienso igual que vos hermano del alma, recién me acaban de suspender la cuenta permanentemente por decirle a un tipo que pare de fedear reiteradas veces. Me da bronca porque como vos decis a esas personas no les hacen nada a la cuenta y a la mía me la banean.\nAlguien sabe como puedo hacer para recuperar mi cuenta?","replies":[]}]},{"poster":"Flautakb","date":"2016-06-21T02:13:26.842+0000","up_votes":3,"down_votes":0,"body":"Señores de RIOT necesito la devolucion de mi dinero o estableceré una demanda por estafa, e mandado correos me han respondido que espere a los 5 días y ya se va a cumplir 7 días que no me cargan los RP, ayer en la noche mande el ultimo correo y no recibi respuestas ya no esperare mas. Es incomodo y desagradable a de mas de todo los malos ratos que e pasado en estos días y que no se haga nada al respecto. ( player support - Orejachope - Amyir) ellos son los que me han tramitado que me espere y ya se cumplió el plazo. Gracias","replies":[]},{"poster":"Jessi Lover","date":"2015-08-11T23:11:34.142+0000","up_votes":3,"down_votes":0,"body":"HOLAAA estoy con problema terrible , me sale q estoy en partida cuando no empeze una. Que hago?\n{{item:3151}}","replies":[]},{"poster":"BurritoOrtega","date":"2015-05-04T18:15:51.760+0000","up_votes":2,"down_votes":0,"body":"Buenas tardes por favor estoy necesitando su ayuda mas que nunca, me están sancionando en partidas por abandono haciendo mas largas mis colas de espera cuando el problema no es mio, estoy teniendo SERIOS problemas al momento de iniciar la partida se me sale el juego y cuando vuelvo a ingresar para re-conectarme no me da ni bola. Quisiera por favor que me ayuden!!! Me están castigando sin ser mi culpa!!!! Necesito ayuda por favor!!!!!!","replies":[]},{"poster":"Destrucktorletal","date":"2015-02-03T18:02:12.749+0000","up_votes":3,"down_votes":2,"body":"Riot, estoy muy molesto divido a que al abrir el juego, aparece un recuadro que dice \"se ha producido un error no especificado. CONSULTE A LOS REGISTROS para obtener mas información\" la verdad es que no entiendo.. porque coloco la opción CONTINUAR y el juego no carga y al colocar ENVIAR REGISTROS tampoco carga.. ¿Que puedo hacer?","replies":[]},{"poster":"LastShock","date":"2015-07-19T22:21:28.070+0000","up_votes":2,"down_votes":1,"body":"en serio , hacen un posteo de como usar el soporte y la gente sigue preguntando en los foros sobre cosas como \nBugs y \"Me faltan x Rps\" \nA ver si hacen una guia de como usar el soporte usenlo lean al menos , seguramente vieron la palabra soporte y fueron corriendo poner sus bugs y problemas en un posteo que no tiene nada que ver\nOdio cuando ponen problemas individuales que no tiene nada que ver con el posteo solo porque lo posteo un rioter","replies":[]},{"poster":"circuito66","date":"2015-02-04T04:34:45.855+0000","up_votes":2,"down_votes":1,"body":"* quisiera saber por q cuando entro a una partida  no pasa nada y solo me aparee la partida sigue en curso cuando le doy pero no me entra a la partida si no q queda en el escritorio y no se abre el juego","replies":[]},{"poster":"P47O","date":"2015-02-03T01:11:43.540+0000","up_votes":2,"down_votes":1,"body":"Riot, estoy bastante molesto, ya que hay un bug (al menos yo y otros 10 amigos) que no deja iniciar el juego, queda pegado en 33% y ya hemos actualizado el lol, y no nos deja clickear en ejecutar, me parece bastante molesto, debido a que sacan actualización tras actualización arreglando bugs de un solo champ incompleto, pero no pueden arreglar un bug para jugar el juego, la verdad es que no se que lo que puede estar pasando, ayuda!!!","replies":[]},{"poster":"A1nU","date":"2017-05-20T22:53:17.517+0000","up_votes":1,"down_votes":0,"body":"no puedo entrar al juego por que me dice que fui bloqueado \npero si me deja entrar en la paguina y no x que","replies":[]},{"poster":"zinedin","date":"2016-10-19T23:43:58.018+0000","up_votes":1,"down_votes":0,"body":"buenas noches , quisiera saber si me pueden ayudar con un problema que me viene ocurriendo seguido.... desp de estar un tiempo conectado o ya sea jugando , me salta un cartel que dice que mi cuenta fue abierta en otro lado y me saca del juego, me lo cierra automaticamente ... ayuda por favor ... sera que me han hackeado la cuenta{{champion:64}}","replies":[]},{"poster":"SL0W","date":"2016-10-14T18:22:47.423+0000","up_votes":1,"down_votes":0,"body":"Hola queria  saber como funciona el sistema de leaver buster porque juego las partidas y de 10 me salgo 1 partida y me dan 5 partidas en cola, o como anterior mente me paso que se me caia el internet y cuando reconectaba al salir de la partida me dan 5 partidas en baja prioridad \nesto no puede ser asi para eso no juego y listo","replies":[]},{"poster":"JØ VerónYasuo ","date":"2016-10-13T07:33:24.722+0000","up_votes":1,"down_votes":0,"body":"GRACIAS A USTEDES Y SU BUG ENTRE A PARTIDA  la janna de mi team se fue afk ni le cargo en la pantall de cargar y despues pasaron 3 minutos para tirar remake que paso?? si se bugeo no los dejo tirar remake por un bug del juego porque culpa de un bug tubimos que cagar todos y no la janna ???? gracias riot por cagarme la ranked son los mejores :) espero que lean esto {{item:2049}}","replies":[]},{"poster":"Parripoyo","date":"2016-10-04T09:29:54.777+0000","up_votes":1,"down_votes":0,"body":"A las 5 menos 20 de la mañana se me callo el server. EL internet andaba perfecto. Todos jugaban menos yo. Perdi la promo. Y quede en 60 puntos.\nintento inciar sesion donde me indican pero no me deja la pagina, me vuelve a redirigir a la misma pagina... no puedo basicamente iniciar sesion en el soporte. \nque hago? la verdad es que estoy muy enojado, porque fue un problema de riot. Yo hablaba por skype con mis compañeros de juego mientras ellos jugaban, asi que el internet no era. Cuando me queria conectar me tiraba error y pantalla en negro. UN ASCO RIOT. Ya me a pasado varias veces. Quiero esta vez que alguien me ayude o que me devuelva a la promo o que haga algo. No es asi esto, no es que un error y se va todo a la mierd#. Necesito ayuda","replies":[]},{"poster":"vinjiotails","date":"2016-09-27T02:24:04.515+0000","up_votes":1,"down_votes":0,"body":"señores tengo un problema enorme... no puedo iniciar una partida... el problema partió cuando ganamos una partida y el juego se trabo, al momento de iniciar otra partida (ya que la anterior termino por que la ganamos) no me permitió ingresar a mas partidas... favor vuestra ayuda urgente, ya que no tiene gracia estar tampoco penalizado ni nada por un error que fu netamente de aplicativo...","replies":[{"poster":"DarkGiacfo","date":"2016-09-29T23:13:36.973+0000","up_votes":1,"down_votes":0,"body":"ME PASA LO MISMO, NO PUEDO JUGAR MAS","replies":[]}]},{"poster":"matii427","date":"2016-09-24T16:25:14.229+0000","up_votes":1,"down_votes":0,"body":"nunca me llego el icono que regalaban la skin si me llego pero el icono no","replies":[]},{"poster":"FoxSiel","date":"2016-09-12T21:38:43.550+0000","up_votes":1,"down_votes":0,"body":"Buenas, la verdad necesito de su ayuda urgentemente , dado a mi estupides he borrado mi email sin antes cambiarlo y ahora no puedo cambiar el correo de mi cuenta al correo oficial que uso siempre , necesito ayuda para poder arreglarlo.","replies":[{"poster":"FoxSiel","date":"2016-09-22T21:07:31.491+0000","up_votes":1,"down_votes":0,"body":"LLevo esperando bastante tiempo por una respuesta avisenme si pueden ayudarme les dejo un correo en el cual puedan hablarme ya no tengo más el correo con la cuenta asi que no podran hablarme desde ahi . aqui les dejo el correo Kisefiregmail.com espero su respuesta .","replies":[]}]},{"poster":"dEEPWOLVES","date":"2016-09-22T09:11:14.143+0000","up_votes":1,"down_votes":0,"body":"entro  la pagina de soporte y no puedo mandar mi solicitud porque me redirecciona a otro lado y no toma mi cuenta!\nnecesito saber que pasa con mi cuenta...\ndado que en una partida me emparejan con dos premades (normal) y amenazaron con reportarme.. y asi paso, me reportaron y me suspendieron la cuenta por 14 dias (ya pasaron 17 dias sin mi cuenta)\nquiero mandar una solicitud para recuperarla y no me deja\nincio secion y dice que quedo bloqueada permanentemente y la verdad no esta bueno que te bloqueen la cuenta solo porque te reportaron por ODIO\nhasta ahi ESO...\nrecien 6:00 am del 22... jugue una partida normal tambien.. donde me toco un hermano chileno demasiado toxico\nla verdad nose.... nunca le di motivo de nada pero resulta que me reporto y tengo MI OTRA CUENTA que me costo Subir... tambien bloqueada por 14 dias\nExpliquemen una cosa por favor... c:\n\ncomo hago para que las vuelvan a habilitar?.. porque aca meparece que te reportan y ca..... la cuenta, pero cuando vos reporstas nunca pasa nada...\nnecesito mis cuentas\nque alguien me responda por favor.\nmuchisimas gracias","replies":[]},{"poster":"roob007","date":"2016-09-19T07:42:52.562+0000","up_votes":1,"down_votes":0,"body":"quiero recuperar mi cuenta ya que por jugadores que son troles y no dejan jugar bien me banearon la centa por decirles la verdad no entiendo como dejan jugar a estos tipos y banean a las personas que realmente juegan y les gusta el juego, claro ven los mensajes que ellos copian pero no ven los que ellos mandan arreglen esta situación mejor RIOT DE VERDAD EL JUEGO SE ESTA CONVIRTIENDO EN ALGO FOME Y DESAGRADABLE POR ESTOS TIPOS Y QUIERO RECUPERAR MI CUENTA..{{champion:24}}","replies":[]},{"poster":"Assuna","date":"2016-09-18T01:52:35.799+0000","up_votes":1,"down_votes":0,"body":"Aún no me llega el icono de invocador del aniversario T_T el skin si pero el icono ni lo vi {{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"Pizarro 1414","date":"2016-09-16T01:39:18.754+0000","up_votes":1,"down_votes":0,"body":"Holap, ultimamente me aparece bastante seguido el bugsplat en las rankeds y me gustaria saber si lo podrian arreglar rapido porque ya van 5 veces que entro a las rankeds y al empezar la partida me sale el molesto y insoportable bugsplat ya lo intente arreglar pero me sale igual, publico esto porque recien me salio el bugsplat al entrar a una ranked y para que se deje de molestar tube que reiniciar el pc, cuando entre a lol me tube que comer 20 minutos de espera por culpa de ese error mas molesto que toda la comunidad entera, y no solo tube que esperar 20 minutos sino que tambien me sacaron nosecuantos PL solo por eso, estaba en 59 y al entrar estaba en 39, porfavor arreglen rapido esto, porque no es responsavildad mia comerme esos 20 minutos en 5 partidas porque no fue mi culpa, yo no me los merezco.","replies":[]},{"poster":"FNC Negrekkles","date":"2016-09-15T19:25:31.410+0000","up_votes":1,"down_votes":0,"body":"Por favor necesito que me ayuden con este problema plz intente todo, vi videos pero nada me sirvio me sigue diciendo lo mismo y es:\"El archivo o directorio C:/Riot Games/ League of legeds/Rads/projects/lol_game_client/filearchives/0.0.0.251 esta dañado y no se puede leer. ejecute el programa Chkdsk\".\nPor favor que alguien me ayude hice todo lo del video pero no me funciono! PLZ AYUDA!","replies":[]},{"poster":"Pablincho","date":"2016-09-06T21:55:09.930+0000","up_votes":1,"down_votes":0,"body":"IBA A INICIAR OTRA CONVERSACION PERO LO EXPLICO AQUI:\n\nEn base al comentario donde dicen que en elos mas altos la gente es poca se debe a estos problemas en elos bajos, muchos nos encontramos atrapados por estas personas. Es normal que el baneo no se ejerza porque va encontra de los intereses economicos de RIOT.\n\n¿PERO QUE CULPA TENEMOS LOS QUE REALMENTE JUGAMOS ESTO COMO UN DEPORTE Y NO COMO UNA DISTRACCION?\n\nLos que nos dedicamos a estudiar las partidas las selecciones y las caracteristicas de las sesson no tenemos porque sufir derrotas en base a gente que le da igual perder o ganar.\n\nLas partidas normales estan para eso\nLas clasificatorias son para los que se toman en serio el juego.\n\nCOMO SOLUCION PROPONGO QUE EL ELO NO SEA EN BASE A VICTORIAS Y DERROTAS SINO EN BASE AL JUEGO INDIVIDUAL\n\nAsi como lo es la maestria de personaje es factible juntar a gente que juega bien con otra gente que lo hace igual sin importar la cantidad de partidas ganas y poerdidas.\n\nPD: RIOT muchos dejan el juego por este problema deberian tomar en cuenta lo que aqui se plantea.","replies":[]},{"poster":"Demented of soul","date":"2016-08-18T22:22:52.141+0000","up_votes":1,"down_votes":0,"body":"ami me sacaron 4000pi al terminar una partida con poppy conseguí un fragmento de maestrías 6 y al salir de hay me sacaron 4000pi si puede resolverme el problema necesito que me los devuelvan","replies":[]},{"poster":"SaiKill","date":"2016-08-18T16:58:43.280+0000","up_votes":1,"down_votes":0,"body":"hola a noche estaba jugando ranked 1:30 hs de la madrugada , la actualizan a las 2 hs d la madrugada...me agarro un ping de desconexion durante la partida tenia k salir entraba y sa salia asi estuve los ultimos 10 minutos  d la aprtida..pero fue involuntario pueden revisar que es asi.....la partido termino con vicotira nuestra..pero a mi me saco mis puntus que tenia me dejo en cero...encima me pone abandono..cuando fue una cosa d ustedes y no mia..... kisiera que me devuelvan mis puntos y me den los puntos de la vicotria que me toco abandono por que la culpa es d ustedes no mia..... saludos y gracias saikill saludos desde argentina.","replies":[]},{"poster":"PuSh2r","date":"2016-08-16T04:35:08.434+0000","up_votes":1,"down_votes":0,"body":"Buenas noches Señores de riot.. bueno eh sido victima de un hack de cuenta.. al pareser me hakearon la cuenta y me cambiaron la contraseña. el \nID:Elrobadrop recientemente estube jugando desde mi otra cuenta y no eh jugado demasiado de dicha cuenta hakeada. por favor necesito la ayuda para recuperar mi cuenta. gracias. PD. Push2r es mi otra cuenta. SErvidor LAS. las dos cuentas","replies":[]},{"poster":"XMISEX","date":"2016-08-11T03:04:57.384+0000","up_votes":1,"down_votes":0,"body":"Hola , Quiero cambiar mi contraseña de Lol y me pide un correo q no me acuerdo la contraseña y tampoco lo pude recuperar a su vez me pide otro correo q tenia asociado y obviamente no lo recuerdo..Si podrian solucionarme este problema se los agradeceria mucho .. desde ya muchas gracias {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"TheSamurayDark","date":"2016-08-07T06:31:18.521+0000","up_votes":1,"down_votes":0,"body":"Bueno yo tengo una pregunta sobre los cofres proyectos de ashe ekko y kata aolo se pueden comprar una ves ???","replies":[]},{"poster":"TevezEnzoElCrack","date":"2016-08-05T22:23:46.336+0000","up_votes":1,"down_votes":0,"body":"Riot necesito que me ayuden me hackearon mi cuenta y necesito que me pasen la contraseña este es el invocador de mi otra cuenla luacrio28 por favor riot por este invocador pasenme mi contra de mi cuenta","replies":[]},{"poster":"DocTorCoGOllo","date":"2016-07-25T17:23:45.730+0000","up_votes":1,"down_votes":0,"body":"Hola foro..o riot.. Es la primera vez qe tengo un problema de años qe juego lol.. no se qe es lo qe le pasa me anda trabado el juego..le vaje los graficos,el video todo y sigue igual,qeria saber si ustedes podian hacer algo.\nlo desistale lo instale de vuelta para ver si era eso pero no sige andando igual,ya no se como hacer para qe me vuelva andar bien,.\nles explico como me anda,cuando entro al login tarda en logear(y aveces me tira error o se queda en iniciando secion)..en seleccion de champ se cuelga..y en juego es como si tubiece ping pero no lo tengo .. asique ya no se que hacer..por favor recomenden hacer algo qiero seguir jugando.! SALUDOS UN ABRAZO","replies":[]},{"poster":"DocTorCoGOllo","date":"2016-07-25T17:02:28.215+0000","up_votes":1,"down_votes":0,"body":"Hola foro..o riot.. Es la primera vez qe tengo un problema de años qe juego lol.. no se qe es lo qe le pasa me anda trabado el juego..le vaje los graficos,el video todo y sigue igual,qeria saber si ustedes podian hacer algo.\nlo desistale lo instale de vuelta para ver si era eso pero no sige andando igual,ya no se como hacer para qe me vuelva andar bien,.\nles explico como me anda,cuando entro al login tarda en logear(y aveces me tira error o se queda en iniciando secion)..en seleccion de champ se cuelga..y en juego es como si tubiece ping pero no lo tengo .. asique ya no se que hacer..por favor recomenden hacer algo qiero seguir jugando.! SALUDOS UN ABRAZO{{champion:86}} {{champion:32}} {{champion:266}}","replies":[]},{"poster":"SrYuri","date":"2016-07-18T16:28:03.074+0000","up_votes":1,"down_votes":0,"body":"hola una colsulta loleros de corazon tengo 10 cofres y no me deja abrirlos mi campeon esta maestria 7 ya sera x eso que no me deja abrir esos 10 cofres desde ya gracias","replies":[{"poster":"anikilavisser","date":"2016-07-22T15:24:12.562+0000","up_votes":1,"down_votes":0,"body":"necesitas tres fragmentos de llave para construir una llave, con una llave puedes abrir uno solo de tus cofres si es que obviamente los ganas en partidas y los tienes en tu artesanía hextech","replies":[]}]},{"poster":"bauty362748","date":"2016-07-15T01:35:09.952+0000","up_votes":1,"down_votes":0,"body":"HOLAA.. RIOTQUIEROPEDIR ALGO SI PUEDEN CUMPLIRME  SEGURO QUE TODOS TAMBIEN QUERRAR XD.\nSI PODRIANN PONER LOS 3 REEMBOLSOS O ALQUESEA UNO SOLO ES QUE ME EQUIVOQUE CON UNA COMPRA CON RP :( \nY QUIERO TENER ESOS RP QUE GASTE SIN SABE LO QUE HACIA Y PIDO SUPLICO DE RODILLAS QUE PONGAN LOS 3 REEMBOLSOS PORFAVOR \nEH GASTADO MUCHA PLATA EN EL JUEGO AGANME ESTE FAVOR AUNQUE SEA PORFAVOR #RIOT ESPERO QUE ME RESPONDAS RAPIDO COMENTEN LOS QUE QUIEREN RITO LO AGA HAY MUCHOS QUE TAMBIEN GASTARON RP QUE LES COSTO COMPRAR EN COSAS MAL D:{{champion:32}}","replies":[]},{"poster":"Athelsttan ","date":"2016-07-13T16:41:02.826+0000","up_votes":1,"down_votes":0,"body":"Hola buenos dias , ayer antes de la actualizacion jugue una clasificatoria y la gane , y no me dieron los puntos. Alguna ayuda ?","replies":[{"poster":"h3llSiT0","date":"2016-07-14T07:26:17.076+0000","up_votes":1,"down_votes":0,"body":"Me paso lo mismo no me sumo los puntos de mis victorias, en un robo.","replies":[]}]},{"poster":"why so palero","date":"2016-07-13T05:46:14.395+0000","up_votes":1,"down_votes":0,"body":"loco venia a reclamar xq justo ricen{{sticker:slayer-pantheon-thumbs}}  no me di cuenta q había actualización de parche y entre a una ranked  no me dejo vanear y así me hacen perder puntos de liga x un problema de el juego si me los pueden arreglar agradeceré xq no estoy para andar regalando partidas no me sobra el tiempo para jugar y trato de acender de divicion así q arreglen eso","replies":[]},{"poster":"Im Get Froggen","date":"2016-07-13T01:20:27.342+0000","up_votes":1,"down_votes":0,"body":"acabo de comprar anivia prehistoria con descuento y me saco los rp y ahora me sale que no la tengo :C porfavor ayudenmeee riot me estafo{{sticker:zombie-brand-clap}}","replies":[]},{"poster":"nekoshiki","date":"2016-07-12T00:45:50.730+0000","up_votes":1,"down_votes":0,"body":"Bunas tarde  hace unos dias baje el lol a mi pc , el internet me andaba un poco mal y por eso creo que el chat no me conectaba, pero ahora me sale  \"no se ha podido establecer conexión con el servidor PVP.net\"  y buscando  opciones  de ayuda que hay en el foro encontre  pero aun no puedo jugar me sigue saliendo el mismo error. Porfavor necesito ayuda!!!! {{champion:32}} {{item:3070}}  {{item:3070}}  se los pido{{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"Isiso2","date":"2016-07-01T04:21:13.782+0000","up_votes":1,"down_votes":0,"body":"¡NECESITO AYUDA! Desde ayer estoy intentando lugar y no puedo, inició sesión hasta ahí vamos bien, una vez ya dentro del juego (página de inicio obvio) me sale un cartel que dice \"se ha producido un error con el servidor MAESTRO\" ya he desistaladm el juego he llamado a un técnico para que se fijará si no era problema de mi Internet y tampoco es.\nLa verdad estoy un poco cansada e intentar y no conseguir nada. Agradecería todo tipo de información. Saludos!","replies":[{"poster":"Donlans","date":"2016-07-08T02:34:13.211+0000","up_votes":1,"down_votes":0,"body":"hola, has podido resolver tu problema? yo estoy  con eso mismo desde hace 1 mes aproximadamente sin poder jugar en mi pc. ya lo he intentado todo que aparece en la web. eliminar  antivirus, desactivar firewall etc. ya no se que hacer. he mandado una un mensaje al soporte pero hasta ahora no me han dicho nada.","replies":[{"poster":"Isiso2","date":"2016-07-11T03:04:14.193+0000","up_votes":1,"down_votes":0,"body":"Esto decepciona y mucho,ojala todo se solucione pronto :c {{champion:74}}","replies":[]}]}]},{"poster":"Kabuutto","date":"2016-07-08T16:45:29.268+0000","up_votes":1,"down_votes":0,"body":"hola buenos dias señor administrador solo le queria pedir un simple fabor yo nunca abandono una partida si se fija mi historial nunca aunque valla perdiendo siempre me quedo no me voy afk ni me desconecto en estos ultimos dias el servidor me estaba andando muy mal de repente estaba bien y de la nada me aperecia el juego con 1800 mms lo unico que le pido es si me puede sacar de cola de sancionamiento poque yo no abandonava si no que me andaba mal el juego desde ya muchisimas gracias y que tenga un buen dia","replies":[]},{"poster":"Quierojugar","date":"2016-07-03T22:20:11.055+0000","up_votes":1,"down_votes":0,"body":"Hola, buenas tardes queria preguntar si hay un bugg o algo en el juego, ya que estaba entrando en una clasificatoria y se buggeo y no me dejo seleccionar campeon y me hizo perder puntos de liga y me voto del juego con el reanudando conexion y despues no me dejaba entrar en la cuenta, quiero saber que paso mas que nada, espero que sea leido pronto y tener una respuesta gracias por la atencion Atte: Quierojugar :D","replies":[]}]}