{"poster":"Jink","date":"2015-06-27T16:06:45.573+0000","title":"\"I would love to vs Gragas or Sejuani today\".","subforum":"Miscellaneous","up_votes":2,"down_votes":3,"body":"Said no one ever.\n\nThe removal of Tank items led to a tank meta because most of them can deal with what are now AD and AOE dependent Champs everywhere due to the buff to base movement speed which more or less eliminated skill shots and most of them are tanks so why not be tank and do AOE stuff - also this was an indirect buff to CC so where most games turned aggressive around level 8 - they are now aggressive around level 1-3 or 3-5 and tanks are good at countering aggression or dealing with aggression and now that the game is more about late-game and being able to deal with aggression then is easier for tanks there are tanks everywhere running the Rift.\n\nCouple this with the fact that in early levels they benefit hugely from being able to AOE or CC because of the move speed buff and you&#039;ve got the main culprit of the tank meta - HP and defense item nerfs aside (Warmogs and Force of Nature Removal). While they may not be as nightmarish late-game as they would with these items as they were or with Force of Nature still in the game (AD&#039;s were more true carries than AP&#039;s) the nightmare is now the tank and AD Carry and bruiser and AP and the ADC Meta was enforced by these Changes because not only are they as viable as they were they are actually now even more important to have in the team because otherwise Tanks wouldn&#039;t be able to be taken down however it left the game very frustrating for tanks because they just get kited to death and have literally no impact on the game if their AD Carry gets assassinated and are basically useless if this happens so being able to CC became incredibly strong to stop this happening however the Champs with good CC usually aren&#039;t as mobile as others hence leading to frustrating CC vs CC matchups where everyone basically just CC&#039;s the crap out of each other and sees who gets caught out and in most cases: The team with more CC wins.\n\nHence Sejauni OP and Gragas OP - complained about and nerfed as a direct result - however, buffing an AD item like Blade of the Ruined King and nerfing Melee AD Carries would have sufficed because this puts more pressure on Tanks early game leading to aggressive play and they can be shut down which eases up life for AD Carries who tend to top lane as it is very far from the action and a relatively safe place as you can play safe with relative ease and just wait for a few levels before you have an impact on the game.\n\nI just say this because playing tanks is intrinsically boring to me personally and I find Glass Cannon&#039;s far more entertaining and chaotic and I also think this type of Game setup would be more fun than how things currently are because despite you wanting to remove passive play: You didn&#039;t delete Nasus and he is the epitome of passive play: Doing nothing with his advantage but farming more: Much like Champions like Gragas who do very little with their advantage but scale into late game (Sejuani too) and they literally don&#039;t need to do anything for ages but gank a few times and farm into late game basically leaving lanes in the same scale as they were before they came and CC&#039;d the hell out of people to give their allies a kill or HP advantage and then come in and repeat their CC chain to win a team fight and basically do what they want.\n\nYou may as well nerf Cho&#039;Gath because he&#039;s a joke right now.\n\nTrundle.\nJarvan.\nGaren.\nShen.\nKassadin.\n\nBasically any AP that is viable with Rod of Ages and Basically any Champion that can build HP items first and get away with it because that is the epitome of stale play (I have more HP than you, deal with it) as opposed to them building some form of offense or interesting items at all and they would but it&#039;s too risky if Cho&#039;Gath comes in with 3K HP because no amount of damage as a Mao&#039;Kai will help you because he&#039;s just gonna tunnel vision and CC/Zone your carry and you wont be able to stop him with damage because he&#039;s too tanky and all you can do is do the same to their carry or try and fight him: Which is where you get tank vs tank fights which are the worst thing ever to watch because they take ten years to kill each other while everyone else dies in like 2 seconds and deal insane amounts of damage and if you balance your team correctly the fights are always the same setup: Tank zones carry, one tank retreats - non-retreating team wins and in the rare cases where no one tanks the games are a billion times as fun and there&#039;s nothing fun about a 4K HP Cho&#039;Gath or 3.5K HP Jarvan or 4K HP Xin Zhao 5 shotting your carry in 1 second late game and Carries defensive items: plain and simple; suck.\n\nTanks with Banshee&#039;s gain 5x as much from it, you put insane amounts of pressure on AD Carries to the point where if the carry dies: It&#039;s GG and all this leads to is a protect the carry meta rather than be one and be a balanced team with equal input. The tank meta is the personification of poor choices when it comes to stylizing fighting and easy as pie to change; and I really think the Assassin meta and almost all the previous patches were about aggressive play, rather than the current patch and while it could be frustrating being dominated by Assassins or carries or bruisers: At least it wasn&#039;t 5K HP tanks frontlining wrecking entire teams and you sitting and watching 3 tanks win the game because they all have 4K HP because you couldn&#039;t pressure their lane stale-mating early game while they farmed Jungle, Top and as a Support tank because in a lot of matchups its easy for them to stalemate and play safe and come late game if you don&#039;t have that exact same lineup - you&#039;re basically ruined and even if you do it&#039;s just \"Who has better CC\" that wins.\n\nCC isn&#039;t aggressive play, AD Carries carrying is aggressive play and right now it&#039;s the tanks carrying and the carries supporting them and there&#039;s little interesting about a farming carry for 15 minutes and a Sejuani ganking mid 3 times in 15 minutes and I personally think you should do something about it and implement drastic changes.\n\nThere&#039;s a reason we still ban Sejuani and Gragas even despite nerfs. Nerfs do very little to change a norm implemented by Itemization and map-wide changes and any previous patch is more interesting than \"Will sejuani gank mid, or will sejuani gank mid\" and \"who can ward the Sejuani best\" and \"Will they pick Sejuani\" because \"Quicksilver sash is a smart buy\" when you have an AD Carry to deal with and you don&#039;t have Sejuani and \"Will Sejuani survive camping their GA\" in the off chance you try a slightly more viable item considering you face a 300 damage auto&#039;ing AD Carry to vs and \"Like Sejuani is going to die camping their reviving DPS\".\n\n2 Carries fighting is the most fun thing in the game and a carry attacking a tank the least exciting as you can see exactly where it's going, there's no \"will they crit\" etc and I know you hate \"chance\" because of the removal of dodge stats etc and \"unpredictability\" but isn't that the point of \"aggressive play\" because \"guarantees\" are \"stale\" and \"non-aggressive\" and more chancy things encourage aggression etc while critting a tank is like \"yay\" and engaging on a slightly stronger carry or taking risks is a lot more fun than just slowly hacking down tanks.\n\nI know you made carries take more skill but you literally made tanks even more passive and they take literally 0 skill. I play Shyvana and I know she takes 0 skill but she's fun. Even though you nerfed tanks, they still take 0 skill because you didn't really change them and to counteract how strong carries can be they are pigeonholed into more defensive builds and more passive playstyle because of the inherent dangers and this leads to mid-late game problems for tanks vs carries in that one slip up is an Ace and while this may be awesome to watch it's really not fun when one CC gets everyone killed and the tanks with more/better CC usually wins overall and everyone stale-mates until that tank or whatever (Sejuani) has a few items and can smash on with everyone and get you aced and it makes playing tanks really boring and passive and the only reason I play tanks is because ganking can be entertaining but I prefer to carry because its way more fun and I feel for tanks that get smashed because once they're shut down they have literally 0 impact and half the game is \"farm up your advantage\" and I really think tanks should be able to build and play more aggressively: Damage wise - so they have an impact even if they game slightly slants against them - rather than as it currently is where you get CC stormed by people again and again and can do nothing but wait for the game over.\n\nIt's rare that games aren't like this and completely one side or relatively one sided and frankly I think although you made carries more skill requiring and active you could have done it without making tanks even more boring and even more passive and made it so they don't snowball 1 or 2 people with their extraordinary punishment to the high base movespeed and low defense map as it is and without making them completely shut down your teams chances if they aren't incredibly lucky at picking people off or catching someone roaming or catching someone with a ward because if the enemy team play safe, once this has happened (a few advantages) they just scale into late game and wreck your turrets and Champs rather than actually fighting and not even fighting under turret can turn the game because of the ridiculous tankiness of a lot of Champs and a lot of the time you just sit back and slowly await the defeat while tanks run back and forth saying \"gg gg gg\" - you can't fight, you can't play aggressive and most of the time it's simply because of Sejuani or Gragas and their stupid kits and the rest of the time it's because they played safe and it's a Sejauni or Gragas.\n\nPlease respond. I know it sounds like I'm whinging but the game turned from fights and skirmishes into wombos within a few patches and I honestly think fights and skirmishes are way cooler than wombos with kiting etc and lots of skill involved and now the game is more heavily about timing which to me is less skilful because previously it even involved more timing etc on blindspots and combos and now your whole team can be dead in the blink of an eye which never used to really happen and while it may look cool or be cool and be back and forth its way less about skill and more just about picks.\n\nPicking is far more math related than the skill previously involve din the League and these wombos are far less skill involving than the League previously was (many patches ago) and even then it still had occasional wombos and had a lot of perceptive play on tracking junglers or timing engages when you guessed Junglers weren't around etc and I honestly think it took a lot more skill many patches ago - than it does now and I think Riot should do something to make the game more interesting and chaotic and variable like it used ot be, than it is now because there are sooooo many games with the same rough matchups and soooo many games with the same basic Champs being taken for their wombo potential and setup potential and most of the time its the ones that haven't been nerfed yet and it seems like Riot is pressuring us into picking better rather than playing better and pressuring us into safe play and sequencing rather than chaoticly fighting pressuring us into wombos rather than outskilling people in lane etc. Even though there is some out-skilling in lane, late-game and mid-game there's not a lot of out-skilling and theres a lot less skirmishing etc because people would usually rather just jump on Bristle's back with Sejuani and snowball in to victory like a Dota Tuskarr gank rather than fight in 1v1's etc and while 5v5's may be cool - summoner's rift is turning into ARAM and I'd prefer the tangeable exciting nature of a 3v3 or 1v1's in lane with skirmishes etc and trades and junglers out of the blue and roaming with your advantage and bot ganking mid etc than the 5v5 mid lane wait for Sejuani ult then smash their entire team because not only is it unfair most Champions don't have that kind of now solidifiedly strong engage; but it actually doesn't matter how well you played and how for ahead you are of your carries because that kind of CC setting up rotations for their whole team will quickly put you in your place (even after the nerfs) and encourage hasty insta-bans of Sejuani.\n\nHecarim's the same - constantly banned.\nGragas is the same - constantly banned.\n\nPeople ban them because they wreck and even though they are popular solo queue bans I honestly think its mainly to make the game more interesting, rather than to gain an advantage. I ban Sejuani because I'd rather a 5v5 where skill is involved, not a bit of timing and 1 skillshot.\n\nFiora > Sejuani. IMO.\n\nBasically all I saw in LCS ws Hecarim ults and RIP enemy team and the only time Hecarim wasn't the MVP was when they had a Sejuani and this caused a stalemate and actual interesting fight and the rest of the time it was just \"someone got engaged on by Gragas, sit back and watch them die lest we be ulted\".\n\nTryndamere vs Fiora is way more fun than this because they don't spend ten years in the jungle and they fight constantly.","replies":[{"poster":"csm","date":"2015-06-28T01:07:08.929+0000","up_votes":2,"down_votes":0,"body":"I'll take that as a no.","replies":[]},{"poster":"csm","date":"2015-06-27T16:27:06.259+0000","up_votes":2,"down_votes":0,"body":"Do you ever stop whinging?","replies":[{"poster":"Unseen Predator","date":"2015-06-27T16:35:23.735+0000","up_votes":1,"down_votes":0,"body":"Well i didn't read the whole post only the first line and title, but he has a point, they're seen pretty much every game and it is kinda dumb.\n\nidc about the rest of his post.","replies":[{"poster":"JasonWazza","date":"2015-06-27T16:37:19.505+0000","up_votes":1,"down_votes":0,"body":">they're seen pretty much every game and it is kinda dumb.\n\nAre you kidding?\n\nI rarely see them in game because they are always banned.","replies":[{"poster":"Unseen Predator","date":"2015-06-28T11:32:13.375+0000","up_votes":1,"down_votes":0,"body":"That's what i said? Being banned counts as being seen every game.","replies":[]},{"poster":"Jink","date":"2015-06-27T17:06:51.592+0000","up_votes":1,"down_votes":0,"body":"My point is there are a lot of Champions right now that can completely pub bash solo queue and minor nerfs don't change this, the current meta made huge problems for Solo queue players. Pub bash champs get mained in pro games until they get nerfed then you rarely see them but they are still horrendous in solo queue which is 90% of the league and Riot just sits there counting their dollars and saying f*ck you to solo queue while putting more pressure on team work and less emphasis on individual skill whilst saying they're promoting aggressive play when they are actually promoting passive play in solo queue. (Late game CC is far less devastating than early game and also easier to expect in 5v5 team-fights because it becomes very obvious when people have their ultimates up etc so the game tends to be predictable etc and people take less risks than in early game where they may have to guess cooldowns etc but they actually take way fewer risks than they used to because by promoting aggressive play they actually reward it so ridiculously heavy that its actually better to play 5x as safe and rely on picks and scaling - which is why I pointed out how the game is slanted towards picks and not skill and late game people play super aggressive with their scaled advantage etc and this makes Champions that can initiate ridiculously strong and a very common pick however most of them are tanks (tanks have easy and safe engages and most have insane crowd control and can CC consistently and relatively safely) and having others that can chain this CC (other tanks etc) makes the game full of tanks which are usually stale hence I think Riot should revert to the assassin or bruiser meta or simply a carry meta because they all make for better plays, cooler plays, more fun and less of this pop preppy \"wombo\" bs and who can \"wombo\" the best because it might be \"climactic\" but its really frustrating to endure and often there's little skill involved - especially when it comes to champs like sejuani and most of the time the game is realistically over in Champ select and the game just has the illusion of being unpredictable when 9x out of ten you can see the combo coming and know exactly how it feels when flash Sejuani wins the game and you simply can't do anything because you picked someone that takes slightly more skill or because your wombo wont stop their wombo hence GG at champ select 9 times out of ten mainly due to \"counter engage\" which is why I emphasis 90% of the game is currently \"combos\" and \"picks\" not \"skill\" and \"timing\" even though both of each of those is realistically under the same category.\n\nSejuani is still free wins unless the person playing her noobs out or your team decide to be stupid but it's not her that's the problem it's that general style and she is just a prime example of the concept that has turned the game into being a pick war rather than a real war and nerfing her isn't going to change the whole \"boring CC\" champ like malph top which is soooo boring to play but turns team games even if he has like 0 farm and did nothing all game but ult a few people mid-game and I think Riot should look deeply into this concept of CC wars because I find skill-shot, kite and trade wars more fun than \"play safe and outscale then engage with sej\" which tends to be the majority of pro and solo queue games and despite Riot making AD Carries more active at some points in the game - overall they're usually far less active.\n\nI'm forced to lane freeze for 15 minutes in a lot of my games to deny their carry farm and all they can do is roam between mid and bot and farm a few neutrals and occasionally enter lane or we sometimes fight at Dragon and if I don't do this I lose power over them so by me playing passively they lose out on a lot and it actually used to be stronger to do this however because overall - farming is less rewarding it just feels boring to do because the advantage I am holding isn't as much as it used to be but it is still basically all I can do - so while Riot reduced passive play they didn't actually punish it in any way to stop this behaviour and tanks are the cause because I don't want to go play aggressive mid until I can shred their tanks because if I go before I can they can play aggressive on me which ruins me and while this gives their ADC time to catch up all I need to do is finish my Last Whisper or whatever my core is before the enemy carry and then I can easily force fights mid and everyone snowballs. This happens consistently and when the game was more passive farm fests at least Top lane and Mid lane had time to make some more interesting plays and people could roam and gank etc a lot more rather than the whole game basically resting on the ADC's shoulders and the Sejuani/Gragas Jungle.","replies":[]}]}]},{"poster":"Jink","date":"2015-06-27T16:46:06.067+0000","up_votes":1,"down_votes":0,"body":"One day.","replies":[]}]},{"poster":"Rooksy","date":"2015-06-28T23:32:39.722+0000","up_votes":1,"down_votes":0,"body":"\"It's rare that games aren't like this and completely one side or relatively one sided and frankly I think although you made carries more skill requiring and active you could have done it without making tanks even more boring and even more passive and made it so they don't snowball 1 or 2 people with their extraordinary punishment to the high base movespeed and low defense map as it is and without making them completely shut down your teams chances if they aren't incredibly lucky at picking people off or catching someone roaming or catching someone with a ward because if the enemy team play safe, once this has happened (a few advantages) they just scale into late game and wreck your turrets and Champs rather than actually fighting and not even fighting under turret can turn the game because of the ridiculous tankiness of a lot of Champs and a lot of the time you just sit back and slowly await the defeat while tanks run back and forth saying \"gg gg gg\" - you can't fight, you can't play aggressive and most of the time it's simply because of Sejuani or Gragas and their stupid kits and the rest of the time it's because they played safe and it's a Sejauni or Gragas.\"\n\n\nThis is one sentence.\nBe amazed.\n{{champion:32}}","replies":[]},{"poster":"TouchMyKimchi","date":"2015-06-28T13:06:18.433+0000","up_votes":1,"down_votes":0,"body":"Wew.\n\nAnother wall of text that no-one reads.","replies":[]},{"poster":"Bookbash","date":"2015-06-28T02:07:49.096+0000","up_votes":1,"down_votes":0,"body":"I love the tank meta. Like you said, more emphasis on team work :) Noobs with no strategy get owned.","replies":[]},{"poster":"Only Heimer","date":"2015-06-28T00:11:04.342+0000","up_votes":1,"down_votes":0,"body":"tl;dr","replies":[]}]}