{"poster":"Jink","date":"2015-11-14T19:18:08.609+0000","title":"Way too many balance issues right now.","subforum":"Miscellaneous","up_votes":1,"down_votes":2,"body":"No idea what Riot are doing but they are making this game worse, not better.\n\nThey ignored so many issues with the previous patch where there were several problems and all they did was create more problems with this one.\n\nI understand problem solving is an element of this game but it&#039;s not mathquest and 90% of the reason SKT won the Championship was through their problem solving, not their skill.\n\nIf you did a reaction speed and aim skill test of SKT members vs all the other Finals Teams players, they would not represent a dominant force : They won simply through planning and strategy. Most likely abuse of mechanics and systems and choices and setups and compositions, which is what this patch encourages.\n\nTheir team compositions were Unique. Their play style and choices were Unique.\n\nTheir builds were meta. Their playing was average.\n\nWhile this patch encourages off-meta building, it does nothing about the Champion pool meta and there were so many problems with the last patch that in a patch like this, with more chaos - only end up becoming more problematic (more balance issues).\n\nThe pros years back mixed things up. Now they scramble for OP Picks then pick compositions around them. SKT went one step further and used closet OP setups, with strategies to back them up and managed this a lot better than many teams in the finals who mimicked a similar strategy, but that is just as bad because while it is slightly more creative; it&#039;s still the same OP picks/compositions scramble but with less orientation on one OP and all hands on deck for another.\n\nWe didn&#039;t see Poppy in the Finals for good reason.\n\nOr a variety of other Champs.\n\nThis patch, while it brings more unique builds and options etc doesn&#039;t solve the one greatest problem:\n\nStarting items.\n\nMost of the unplayed Champions have awesome options and no way to enable them, because they don&#039;t get anything useful out of starting items. This means they are not a safe first pick, let alone a smart one and while their stats may be OK because educated players can use them against teams with a weakness, or with teams they synergize with - in a standalone, first picked - they are laughable opponents and having like 4 possible starting items is the real problem as it is where issues begin and end and where the problems of Champions like Poppy can be solved in a heartbeat; and while these new starting items etc would exaggerate other Champions powers: at least in letting it be this way for a while: their true strength would reveal itself rather than only show the tip of the iceberg of why they are OP and in bringing other Champs up to power rather than doing mild tweaks to the OP ones, the game would actually be fun and have variety while it was intrinsically balanced: rather than how it is currently where you must counterpick, you must counterbuild and you must counterplay against their early picks unless an ally mixes things up and while it may seem like it would be more annoying in the end to do things this way, at least the OP champs would be balanced correctly and not 100% pick/ban rate like at worlds and like will happen again if Riot don&#039;t do something but on the plus side - some of the weaker Champs would at least be playable while we wait for them to fix these broken azz pieces of shizz.\n\nFiora darius veigar GP elise reksai for lyf.\n\nInsert 10 counters/pre-counters and the synergies/occasional off meta comps and closet OPS here with their strats and you have a relatively small champion pool and that is what the meta is right now and its pretty said because that is not variety at all when there should be thousands of viable comps and there really arent. (fact).\n\nI would do the maths but this is from experience and observation - the maths would be infinite.","replies":[{"poster":"Tele","date":"2015-11-14T22:10:36.395+0000","up_votes":3,"down_votes":0,"body":"Buffs to champion viability:\n\n1. Zed\n2. Talon\n3. Leblanc\n4. Fizz\n5. Akali\n6. Jax\n7. Master Yi\n8. Every ADC (that's 21 champions).\n9. Every Tank support (7 champions, due to bond of stone BTW)\n10. Every sustain support (4 champions).\n11. Yasuo\n12. Tryndamere\n\nThat's 41 champions total, that are now much more viable than before. That's not all the viable champions this patch though, we have some champions who are staying in the spotlight for another season (Lee Sin, Rek'Sai, Olaf...) and others who have left (Viktor, Anivia, Orianna...).\n\nWill this patch have more viable champions than last? I don't know, I think it's looking promising at the moment.** The issue with champion viability is people assume only what they see is viable.** \n\nLets be honest who the hell thought Ryze Mid, Shen Support and Kennen ADC were going to be World tier picks?\n\nHow many champions like those are available right now but no one knows how to execute them?\n\nPoppy is getting a rework BTW so don't worry about her, they've already leaked teasers on the PBE. In case you don't know why she's been slightly weaker for a while, it's because she has the most broken kit in league. Worse than Lee Sin and Riven combined. Not a joke, Riot has said she's being kept out of meta purposefully.","replies":[{"poster":"Gravelord","date":"2015-11-15T01:34:23.196+0000","up_votes":1,"down_votes":0,"body":"Hahahah you've listed basically all the champs OCE play man :p","replies":[{"poster":"Tele","date":"2015-11-15T02:23:59.152+0000","up_votes":1,"down_votes":0,"body":"Yeah we really like our AD carries and assassins here :D","replies":[]}]}]},{"poster":"JasonWazza","date":"2015-11-15T01:37:42.753+0000","up_votes":1,"down_votes":0,"body":"Worlds patch was broken to the side of juggernauts, no one is arguing against that, hell the fact that Kennen ADC was picked shows just how much juggernauts were broken (reasoning is basically, people were willing to pick Utility ADC's because ADC's did sweet fuck all)\n\nBut are you really using that to argue that this patch has no viable champions?\n\nI think Poppy is one of the main unviables, and that's for a damn good reason as she has a rework in the path and any buffs would make her so broken.\n\nHonestly this patch opens up so many champions and playstyles to the meta for the sheer fact that the masteries are amazing in so many different ways.\n\nJust because your being closed minded doesn't mean that there are less viable champions this patch.","replies":[]},{"poster":"Lord Sesshomaru","date":"2015-11-14T19:30:44.802+0000","up_votes":1,"down_votes":0,"body":"Balance has gone out the window, I've played probably 20+ games in the pre-season and only in ONE of them were we not completely stomped on, or completely stomped the enemy.\n\nno one likes those games, everyone prefers a good hard battle, no one likes 14/50 team scores.","replies":[{"poster":"Jink","date":"2015-11-14T20:06:09.929+0000","up_votes":1,"down_votes":0,"body":"Yeah it's been like this for a while for me, where one kill in lane leads to a turret, which leads to a mid group, which leads to skirmishes where you usually lose out which leads to dragons.\n\nThe whole game snowballs out of control if ADC gets ahead and I'm guilty of doing it and when you are in this situation and doing it you can see that it's basically game from the enemys team, like if they don't have a late scaler or whatever and you do or something like that and even in other certain situations know that you can push faster than the enemy can try to outscale even they've won lane.\n\nLike each lane has had their influence on each other limited immensely when it comes to helping people who are behind, ganking there are 500 wards so if you leave mid you've walked past 1 and top 100% knows if you are roaming towards bot and even when you get there there are 100 wards.\n\nLike winning a lane gives them map dominance which means wards and then it's game over because of the wards and while they did minor changes to this - this patch, they gave people a strong farsight mechanic for free on the ADC and cheaper pinks and sightstone upgrades and you get more free wards now so they basically crapped on \"even\" play and have done so more and more and put power in the hands of wards which is like a mini-game (crap one at that) and shut down turnarounds, discouraged aggressive play because of how much risk is involved which is why pro play is like 5 deaths a game (yawn) and said they were doing the opposite on both parts, promoting aggressive play (they promoted aggressive ward clearing and warding rlly) and promoting turnarounds (no such thing) [least not for solo queue].","replies":[]},{"poster":"DragonOfTheVoid","date":"2015-11-14T20:05:50.057+0000","up_votes":1,"down_votes":0,"body":"its to do with the crit keystone the new items and passives on old items rift herald and minions the extra 150% damage on them wen you get 2 towers its bs","replies":[]}]}]}