{"poster":"Jink","date":"2015-09-03T15:26:47.414+0000","title":"Ryze is bs.","subforum":"Miscellaneous","up_votes":1,"down_votes":2,"body":"QWEQWEQWEQWEQWEQWEQWEQWEQWEWQWEQWEQQWEQWEQWEWQEWQ dead.\n\nAll he does is snare me then mash QWE until im dead and I cant move for the duration hes doing it.","replies":[{"poster":"DragonOfTheVoid","date":"2015-09-03T15:43:07.059+0000","up_votes":2,"down_votes":1,"body":"um bud a flash out and raze cant perma stun you were you not around about a month ago were he could perma stun you before lv 6 and he is not as op as your stating now he needs lv 6 and there is a 1 sec delay before he can stun you in-between his qwe","replies":[{"poster":"Ekrah","date":"2015-09-03T17:21:48.452+0000","up_votes":1,"down_votes":3,"body":"***","replies":[{"poster":"DragonOfTheVoid","date":"2015-09-03T17:55:58.177+0000","up_votes":2,"down_votes":1,"body":"ow get over it your just bad in lane and cant handle a champ that's not op","replies":[]}]}]},{"poster":"DianasGotSwag","date":"2015-09-06T09:03:26.886+0000","up_votes":1,"down_votes":0,"body":"He was worse before the rework. You have to time your fights against him AND BUY MR IF HE GETS OUT OF CONTROL OMG. Too many people saying \"my build wins games\" while refusing to change them when it sure as hell won't win the one they are playing.","replies":[]},{"poster":"Twynko","date":"2015-09-05T01:26:51.882+0000","up_votes":1,"down_votes":0,"body":"are you that sad, ryze had the lowest win rate last week, and you are saying he op. PLEASE WHAT ABOUT THE 124 OTHER CHAMPS THAT HAVE HIGHER WIN RATES?","replies":[{"poster":"Jink","date":"2015-09-05T01:58:06.468+0000","up_votes":1,"down_votes":0,"body":"Yeah but they have counterplay, Ryze just snares you to death.","replies":[{"poster":"Twynko","date":"2015-09-05T02:01:30.604+0000","up_votes":1,"down_votes":0,"body":"you are missing the point, he has the lowest win rate and if he snares you and you dont move once you are unsnared its entirely your fault if you get snared again :) gidgud","replies":[{"poster":"Jink","date":"2015-09-05T02:37:15.462+0000","up_votes":1,"down_votes":0,"body":"No you're missing the point that he can position and perma snare you.\n\nYou make it like 5 teemos before being snared again wow that's f*cking helpful.","replies":[{"poster":"Lone Summoner","date":"2015-09-06T00:09:44.189+0000","up_votes":1,"down_votes":0,"body":"Who are you playing as to get burst like that to Ryze. Because normally Ryze is a tank so IDK how he is bursting you that fast.","replies":[{"poster":"Jink","date":"2015-09-06T06:51:31.121+0000","up_votes":1,"down_votes":0,"body":"His burst damage is insane man. If he gets in range of you when he has his 5th skill almost up and he pops ulti he just QWEQWEWQEWQEQWEWQ mashes you until you're dead and the snare literally wears off for like 0.1 seconds then you're snared again. You can flash and he'll just flash after you and QWEWQEWQEWQEWQ you more - takes him literally 5 seconds to kill you and for that 5 seconds you are able to move for like 0.2 of it.\n\nhttps://www.youtube.com/watch?v=1EnHZX44o_Q\n\nThey nerfed his snare duration by like 0.2 seconds at max rank and now he can't get his Arcane mastery as fast and it doesn't last as long but he's still the same bs artist that just snares you to death at level 11 for 1400 damage in like 5 seconds while you are incapable of moving and may as well just afk while you die.","replies":[{"poster":"Lone Summoner","date":"2015-09-06T08:15:16.179+0000","up_votes":1,"down_votes":0,"body":"Then build quicksilver sash or in masteries get the cc reduction upgrade. or play GP his e removes all debuffs","replies":[{"poster":"Jink","date":"2015-09-06T08:53:55.095+0000","up_votes":1,"down_votes":0,"body":"He gets his arcane mastery like once every 20 seconds.\n\n10% CC reduc not gonna help you, even as Irelia he still perma snares you with your CC reduc and your CC reduc masteries and Mercury's treads.","replies":[]}]}]}]}]}]}]}]},{"poster":"Garens Harem","date":"2015-09-06T00:21:41.015+0000","up_votes":1,"down_votes":0,"body":"karthus  is bs. \n\nQQQQQQQWEQQQQQQQQQQ\nR\n\nall he does is w me and q spam me until im 60% hp and then he uses his counter ulti and 1 shots me","replies":[]},{"poster":"Lone Summoner","date":"2015-09-04T09:38:45.267+0000","up_votes":1,"down_votes":0,"body":"Ryze stare is his W so if he can QWE you while you are stared I think he is hacking. (or has really low CD)","replies":[]},{"poster":"Azirious Mistake","date":"2015-09-04T00:29:36.661+0000","up_votes":1,"down_votes":1,"body":"ryze is trash tho???","replies":[]}]}