{"poster":"Jink","date":"2015-10-15T18:19:57.721+0000","title":"Rather people ban Veigar than Darius.","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"At least he has some form of counterplay (kiting) as opposed to &quot;dive the backline to avoid the 2K nukes in team fights&quot; which isn&#039;t really counterplay but more of a 9/11 mission where even when you win, you dont win.","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-15T19:07:12.150+0000","up_votes":1,"down_votes":0,"body":"hmm I wonder if you counter him like nasus nar","replies":[{"poster":"Jink","date":"2015-10-15T19:50:47.970+0000","up_votes":1,"down_votes":0,"body":"His lane phase is nothing like Nasus is is legit 100% safe in lane at all times.","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-15T20:44:14.869+0000","up_votes":1,"down_votes":0,"body":"let him push get a gank get a kill win lane shut him down","replies":[{"poster":"Jink","date":"2015-10-15T20:48:11.603+0000","up_votes":1,"down_votes":0,"body":"Doesn't work like that bruz, he loses mid turret and now you have to overextend to get him and he has a shield turret and he doesn't want to push at this point and can control waves wickedly.\n\nPlus you snowballing as an ap increases his ult damage. Plus he has fast access to zhonyas so he gets a huge utility very early and that can shut down AD mids or w/e too and then he just free farms all game and picking non aps leaves you vulnerable to many things such as Armor stackers, HP stackers or tank synergy champs and anti melee champs and not having AP you miss a lot of AOE or single target and often ranged burst and then gg.","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-15T20:56:33.989+0000","up_votes":1,"down_votes":0,"body":"You are a nub why do you need to take his tower you don't wen I top as a split pushing champ I wont take a tower till 15 min so they need to over extend to get cs and letting me kill them. And as for the ap thing with his ult if you get a zhonya's and have any skill at all then you will use it as he ults and his ult will go on cd and wen its up you will have zhonya's ready to use done magic.","replies":[{"poster":"Jink","date":"2015-10-15T21:14:33.964+0000","up_votes":1,"down_votes":0,"body":"Or you cop one CC and he flash ults you for 1.2K dmg.\n\nPushing turret depends on game, but leaving it isnt always good as if you take it it frees you up to roam plus you have more map control around mid lane plus he has to overextend sometimes but so do you and with Veigar he can lane freeze wickedly strong plus zone plus harass.\n\nIf they have any other form of late game champ the whole game dynamic becomes problematic as you have to prioritise where you pressure or gank and with a vayne and a veigs or a jinx and veigs or even a jungle yi and veigs it becomes difficult to pressure or gank both of them and he desperately needs to be shut down but if you want to snowball other lanes or w/e he gets free farm.\n\nIt's the same thing that makes nasus annoying but on a worse scale and junglers camp his lane etc and your jungler has to respond and this puts all the focus on his lane which can cause extreme problems and he is a very safe early pick and its difficult to set up team comps to negate the problematic dynamics he causes (worse than nasus tho).","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-15T22:10:33.883+0000","up_votes":1,"down_votes":0,"body":"all what im hearing is that you don't ward and cant lane get good","replies":[{"poster":"Jink","date":"2015-10-16T18:11:11.473+0000","up_votes":1,"down_votes":0,"body":"http://wardscore.loltools.net/?name=level1pentakill&region=oce\n\nI ward more than 70% of Mages.\nI ward more than 97% of Supports.\nI ward more than 94% of Tanks.\nI ward more than 20% of Marksmen.\nI ward more than 40% of Fighters.\n\nReason I don't ward much with Fighters is because I often just use a few pinks that don't get taken down and I defend them and as a Marksmen I usually have a good support warding or use Blue Trinket and my ward scores for Tanks are high because I play Tank Junglers and Tank Supports and often go Sightstone or as a Jungler I tend to ward craploads since I'm all over the map etc.\n\nSo don't say I don't ward. That's not the problem in this matchup.","replies":[]},{"poster":"Torea2","date":"2015-10-16T02:38:04.687+0000","up_votes":1,"down_votes":0,"body":"All I'm seeing is your lack of grammar, punctuation and manners","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-16T02:59:08.404+0000","up_votes":1,"down_votes":0,"body":"ow how cute you think I care","replies":[{"poster":"Torea2","date":"2015-10-16T06:10:03.744+0000","up_votes":1,"down_votes":0,"body":"Where on Earth did I say i cared in the slightest about it?\nI was just pointing it out dude","replies":[]}]}]}]}]}]}]}]},{"poster":"SorakaXHealBoT","date":"2015-10-15T21:35:24.958+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Level1Pentakill,realm=OCE,application-id=Ntey9fRZ,discussion-id=2Oj82E1p,comment-id=00000000,timestamp=2015-10-15T19:50:47.970+0000)\n>\n> His lane phase is nothing like Nasus is is legit 100% safe in lane at all times.\n\nhe is immobile and very easy to gank when his cage is on CD","replies":[{"poster":"Jink","date":"2015-10-15T22:04:36.788+0000","up_votes":1,"down_votes":0,"body":"No he's not lol they buffed base movespeed of all Champs and gave AP's Ludens and boot enchants.\n\nWhat so he just blows his event horizon?","replies":[]}]},{"poster":"Essembie","date":"2015-10-15T20:15:36.920+0000","up_votes":1,"down_votes":0,"body":"He seems to be in a strong place at the moment","replies":[{"poster":"Jink","date":"2015-10-15T20:42:24.360+0000","up_votes":1,"down_votes":0,"body":"There's too many broken OP Champions right now to ban them all and if you dont want to play them because most of them are boring as f u lose - its a joke.\n\nPermabans: {{champion:86}} {{champion:122}} {{champion:82}} {{champion:41}} \n\n\"Let's nerf Vaynes AD by 3\" - yeah the only one that can deal with them. I know. Why don't you buff ADC's against tanks with % pen or %HP dmg or w/e and leave tanks where they are in the dust because most of them are no skill or boring or just farm 24/7 and almost never trade or do much interesting stuff.\n\nI know there are exceptions but I'd rather Kite wars then these Champions and their broken laning phases. AD Carries are far more interesting and they're encouraging more and more tanking and sustained fights which are \"more interesting\" but not actually because there's nothing fast paced about them, they're long drawn out raid boss battles.\n\nI hate WoW and they're turning it into it - I don't mind PvP but PvE sh*ts me and they're denying PvP for PvE (verse raidbosses rather than each other) yeah ok. They're high on something.","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-15T20:48:05.538+0000","up_votes":1,"down_votes":0,"body":"None of them are op yes they have good damage and tankyness but they are not op. If you think they are op you were not on for release xin he was op we are talking he could 1v5 lv 6 and win every time. And 3 ad is nothing it wont hert her in lane and her late game will still be the same so stop b!tching.","replies":[]}]}]}]}]},{"poster":"SorakaXHealBoT","date":"2015-10-15T21:34:38.682+0000","up_votes":1,"down_votes":0,"body":"{{item:3102}} {{item:3157}} no counterplay ?","replies":[{"poster":"Jink","date":"2015-10-15T22:05:10.185+0000","up_votes":1,"down_votes":0,"body":"Banshee's so hard to pop and dodging event horizon clearly eliminates his power when there are 4 other Champions.\n\nGood job you Zhonya's'd, enjoy waking up in an event horizon for a Q-W that's 90% as much damage as his 2K ultimates.\n\nPlus good luck working Banshee's into a build anyway in the current meta.\n\nSame goes for Zhonya's when they have Malph ulti's and sh*t and you're not gonna be able to dodge them cause you copped a leona Q mid fight and he flash boomed you.\n\nHis damage is insane.\n\nEasy to get insane damage early.\n\nBroken OP Champion.","replies":[]}]}]}