{"poster":"Gabh","date":"2015-04-22T15:33:09.177+0000","title":"Solo se gana por picks?","subforum":"Charlas Generales","up_votes":1,"down_votes":7,"body":"Que miras","replies":[{"poster":"nightdarkess","date":"2015-04-22T16:06:56.770+0000","up_votes":2,"down_votes":0,"body":"el tema esta que los campeones op tienen mecanicas y/o kit de habilidades llamativas y muy buenas dentro del meta y claro hay gente que hace builds hace guias etc sobre el campeon mientras que campeones notan populares como yorick nadie sabe como se arma ni tienen una guia y/o build definitiva pero si ponemos a un campeon popular como {{champion:67}}  es un hypercarry saben que el primer item es {{item:3153}}  sin exepciones y luego hay gente armando distintos tipos de builds mecanicas como adc como top etc \na lo que quiero llegar a entender es \ncampeon op=mas guias y mas builds+mas personas interesadas al campeon=gg\ncomo pasa con {{champion:102}}  que pocas personas las jugaban (tirando a casi nadie) y ahora se hizo popular gracias a lcs y a {{item:3717}}","replies":[{"poster":"nightdarkess","date":"2015-04-22T16:08:41.855+0000","up_votes":2,"down_votes":1,"body":"pero no se gana con picks populares se gana con cabeza estrategia y {{item:2045}}","replies":[{"poster":"AetherShadow","date":"2015-04-22T16:40:29.734+0000","up_votes":2,"down_votes":0,"body":"se gana por ambos si tienes buena estrategia con un equipo de rotos entre comillas ganaras a otro de tu mismo nivel que juegan con champs fuera del meta","replies":[]}]}]},{"poster":"Sr Jaimito","date":"2015-04-22T22:43:03.426+0000","up_votes":1,"down_votes":0,"body":"Los campeones fuertes van rotando siempre. Si ganas o no también depende de que juegues con manos o muñones así como te puede partir la cara un Blitzcrank en top (con buenas manos) puede que una Shyvana top con castigo por moda sea más mala que pegarle a una anciana :/\nAhora, si ambos juegan con manos... o ambos con muñones, ganará el campeón más fuerte, está clarísimo xD","replies":[{"poster":"ragunaover","date":"2015-04-23T20:16:02.533+0000","up_votes":1,"down_votes":0,"body":"A menos que el otro sea koreano en ese caso mutara y obtendrá una cuarta o tercera mano (depende de cuantas necesite) y se hará artas plays con ese champ como el Urgot mid contra Zed.","replies":[]}]},{"poster":"Shappaw","date":"2015-04-23T17:00:03.655+0000","up_votes":1,"down_votes":0,"body":"No entiendo. Mencionás snowball pero estás con un pensamiento demasiado cerrado. Realmente estás re retorcido, che.\nMirá videos, streamings, espectá partidas, así vas cobrando experiencia en lugar de hablar tan ingenuamente.","replies":[]},{"poster":"Ryokuma","date":"2015-04-22T16:59:13.978+0000","up_votes":1,"down_votes":0,"body":"No hace falta pickear lo roto del momento para poder ganar, vos pensa que la gente se mentaliza (por lo menos de diamante 5 para abajo) en jugar con y contra lo meta que ves en el LCS y todo eso. Lo que podes hacer es, pickear lo roto, aprender a usarlo bien y ganar con eso, o todo lo contrario, pickear la cosa mas random que no ves nunca, aprender a usarla bien y ganar con eso xD. Ponele yo estoy en platino 1 y me harte del meta estupido de ahora (maineo mid), entonces decidi empezar a pavear con las cosas que me parecen divertidas como {{champion:30}} , {{champion:34}} y {{champion:11}}  mid y te aseguro que gane varias porque la gente no sabia como jugarle. Igual recorda en mantener las bases como jugador independientemente del campeon que elijas, como hacer roaming a otras lineas para ayudar, nunca insultar a tu equipo y tratar de que mantengan la calma, concentrarse en objetivos por encima de kills y recordarles a todos que es un juego de equipo, en el cual por mas que tu desempeño individual sea increible siempre vas a necesitar de los otros 4 para poder ganar la partida. Si consigues mantener esas cosas simples funcionando te aseguro que tus probabilidades de ganar la partida van a aumentar significativamente.","replies":[]},{"poster":"lordeman10","date":"2015-04-22T16:53:23.881+0000","up_votes":1,"down_votes":0,"body":"salvo en aram no","replies":[]}]}