{"poster":"Zukia13","date":"2015-11-03T13:08:47.688+0000","title":"League of ledgends 3D?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hello, I'm just wondering if I can get some advice on playing league of ledgends in 3D, I have a nvidia 970 with the glasses and emitter for nvidia 3D vision 2 along with a benq xl monitor. I've never used 3D so any advice of how to get it working or if it's even worth it would be apresisted! Thanks","replies":[{"poster":"Son Golin","date":"2015-11-06T00:05:16.155+0000","up_votes":1,"down_votes":0,"body":"Hey Zukia,\n\nI see that you want to take in the landscape of Runeterra on a whole new dimension--literally. I want to approach this with a huge \"Your Mileage May Vary\" (YMMV) disclaimer since I don't have much experience with 3D settings so I could be somewhat off base. On top of that, remember that this feature is entirely enabled from Nvidia's side.\n\nFirst of all, it looks like you're using Nvidia's 3D technology (3D Vision), thankfully it looks like League of Legends is listed as \"supported\" on their website here: http://www.geforce.com/games-applications/pc-games/league-of-legends/screenshots \n\n_Note: Don't mind the old screenshots on the webpage, that's our game--we might need to invite Zilean ({{champion:26}})  or Ekko ({{champion:245}}) to work some time magic on it._\n\nNext, you'll need to turn 3D Vision on for League of Legends. You should be able to do this either through the \"Enable 3D Vision\" shortcut or through the Nvidia Control Panel. In either cases, you'll need to install the proper video drivers (either through the Nvidia Website or GeForce Experience.\n\n1. To access it through the \"Enable 3D Vision\" shortcut, you can click on the Start button (Windows icon) and search \"3D Vision\", it should show up as an option.\n2. Alternatively--or if the previous step doesn't work--you can go to your system tray (bottom right corner of the screen), locate the Nvidia icon (or the Geforce Experience icon), right-click, and go to Nvidia Control Panel. Once there, you should have the option to go to \"Stereoscopic 3D\" and check \"Enable stereoscopic 3D.\"\nWhen you've done that, it starts the Setup Wizard which is tailored to your particular setup. It should also allow you to adjust settings for specific games. I highly recommend testing it out in various Custom Games because you don't want to run into any surprises in a matchmade game.\n\nThat's just the basics anyway. You might be able get further assistance from the Nvidia Community Forums--specifically here: https://forums.geforce.com/default/topic/573545/3d-vision/league-of-legends-in-3d-/1/\n\nYou'll note that some of their members there have done some extensive testing and adjustments for the game. Remember that what works for them and their setup might not work for you. Anyway, I hope that's enough to get you started! Good luck and have fun in the third dimension!","replies":[]}]}