{"poster":"Abzimiliarth","date":"2018-07-25T08:03:30.307+0000","title":"Un ADC o Tirador para el Monte Targón!","subforum":"Jugabilidad, balance y narrativa","up_votes":6,"down_votes":0,"body":"Hola, veía toda las historias de runaterra, ame cada una de ellas, pero me puse a pensar, \" me gustaría hacer teams por facciones, seria genial\" fue ahí cuando me di cuenta de que el Monte Targón,  (una de las facciones que mas me encanto la historia) no tiene muchos champs, ni uno que cumpla con el rol de Tirador o Adc (Zoe podría suplirlo actualmente, pero me refiero a alguien que si venga con ese rol de pormedio) se que quizas nunca sea leído, pero quiero expresar mi idea... me encantaría verlo más adelante. Gracias!","replies":[{"poster":"Ebrio De Lag","date":"2018-07-25T09:56:04.707+0000","up_votes":3,"down_votes":0,"body":"bardo con statik y trinidad salu2","replies":[]},{"poster":"Eastghost","date":"2019-05-27T08:34:53.814+0000","up_votes":2,"down_votes":0,"body":"Este año se va a lanzar un nuevo adc hacia finales, y no voy a ser yo quien te cuente que justo va a ser de targon (no preguntes como se xd)","replies":[{"poster":"Abzimiliarth","date":"2019-06-21T17:29:04.688+0000","up_votes":1,"down_votes":0,"body":"Wow eso me alegra, espero que sea cierto!","replies":[]}]},{"poster":"Shumader","date":"2018-07-25T22:00:57.922+0000","up_votes":1,"down_votes":0,"body":"De a poquito todas las facciones terminan teniendo como mínimo 1 campeón de cada clase, fijate en el caso de Aguasturbias, hasta este año no tenía un asesino como tal, y nos trajeron a {{champion:555}}, que no te sorprenda que eso pase tarde o temprano.","replies":[{"poster":"Abzimiliarth","date":"2018-09-30T22:31:21.469+0000","up_votes":1,"down_votes":0,"body":"Donde dejas a {{champion:105}}  es el asesino de aguas turbias por excelencia xD","replies":[]}]},{"poster":"ChocoMix","date":"2018-07-25T08:09:17.697+0000","up_votes":1,"down_votes":0,"body":"{{champion:16}} \n\nLa vieja y confiable Soraka adc full crítico.   \n\nIgual para crear un adc de Targon deberían tomar a un personaje X de otra facción y hacerlo portador de un aspecto, como Taric.\n\nDigo otra facción porque: La gente de Targon tienen un entrenamiento militar más melé.   De ejemplo están Pantheon, Leona y Diana. Tal vez si los Lunari existieran se podría crear uno 100% originario de Targon, pero con lo que sabemos de lore es complicado :P","replies":[{"poster":"Abzimiliarth","date":"2018-07-25T08:16:12.616+0000","up_votes":1,"down_votes":0,"body":"jhasjhsahjas me mataste con la vieja confiable! ... con respecto al lore, igual lo pensé, aunque pueden haber tantos cambios en torno a ello, solo por la creación de nuevos campeones, lo hemos visto ya, aunque la idea de hacer que alguien de otra facción llegue ahí y defienda esos colores tampoco es mala idea, la verdad es que hace falta. \nGracias por comentar! {{champion:131}}","replies":[]}]}]}