{"poster":"Pe3RLess","date":"2017-02-28T15:19:58.340+0000","title":"Silber Team sucht Top Mid und ADC","subforum":"Clans & Teams","up_votes":3,"down_votes":1,"body":"Hallo Mitbeschw&ouml;rer,\r\nWir suchen noch 3 weitere aktive Mitspieler f&uuml;r unser Team im Bereich von Silber-Gold. Die Positionen Top, Mid und ADC werden noch gesucht.\r\nDu solltest eine gute Einstellung haben, auch mal einfach Spa&szlig; am spielen haben, Kritikf&auml;hig sein und vorallem den Willen haben dich selbst und das Teamplay konstant zu verbessern. Deine Individuelle St&auml;rke ist nicht wichtiger als deine Kommunikation im Team, wir suchen also keine Solospieler sondern Teamplayer, auch wenn deine Individuelle Performance nat&uuml;rlich auch gut sein darf ;p.\r\nWir verlangen von niemandem T&auml;glich online zu sein, aber mehr als 1-2 Mal die Woche sollte auf jedenfall machbar sein.\r\nAnsonsten brauchst du f&uuml;r die ben&ouml;tigte Kommunikation ein Headset sowie TS3 auf deinem Computer.\r\nIch w&uuml;nsche euch allen noch viel Grl&uuml;ck in der SoloQue, wenn ihr an dem Team interessiert seit, Added mich einfach,\r\nGr&uuml;&szlig;e,\r\nAaron aka. oHkJared","replies":[{"poster":"Cryses","date":"2017-02-28T17:02:16.025+0000","up_votes":1,"down_votes":0,"body":"Hallihallo Lieber Aaron,\n\nich habe gerade gelesen das du ein paar Mitspieler für die FlexQ, aka schlechte Version von Teamranked, suchst.\n\nIn unserer Community veranstalten wir gerade eine Art \"Teamgründung\", ich frage alle Mitmenschen in der Community wer Lust auf ein Team hat und packe diese dann in ein Team zusammen. Davor werden wir natürlich ein paar Gespräche führen, wo geklärt wird was genau Ihr wollt etc.\nDanach werdet Ihr dann nach euren Wünschen zusammengewürfelt und Ihr habt dann erstmal ein Team was euch dann hoffentlich auch gefällt!\n\nAlso, wenn dich das Interessiert, würde es mich freuen wenn du dir das untenstehende mal durchliest und wenn du Lust hast bei uns vorbeischaust :) \n\nHier etwas zu unserer Community Magic Mirror:\n\nWir sind eine ü18-Multigamingcommunity mit den Bereichen League of Legends und CS:GO. Das soll aber nicht heißen, dass wir nur diese beiden Spiele anbieten! Du kannst bei uns natürlich mit jedem alles spielen :).\n\nWir bieten regelmäßig Events an wie z.b, jeden 2. Sonntag ein League of Legends Customgameabend, wo viele Communitymitglieder sich zusammenfinden, um gemeinsam lustige Gamemodes zu spielen. Oder ein **Sommertreffen** Mitte Mai und und und...\nWenn du Fragen zu weiteren Events hast bin ich gerne für dich da :)\n\nNebenbei bieten wir auch Server für dich an:\n- **Minecraft Server**\n- **CS:GO Server**\n- **TTT Server**\n**Natürlich für jeden zugänglich!** Und wer will kann uns ansprechen und wir erstellen Ihm einen Minecraft Server mit einem beliebigem\n-**\n\n\nEs gibt natürlich noch einiges zu erzählen, aber wenn das schon gereicht hat dein Interesse ein wenig zu wecken, dann schau dir doch mal unsere Vorstellung im Forum an:\n\n[=== Hier gehts zu unserer Vorstellung League of Legends Forum ===](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/0qdBJX3Y-18-magic-mirror-auf-der-suche-nach-weiteren-familienmitgliedern)\n\nOder direkt zu uns:\n\n[ === Hier gehts zu unserem Forum === ](http://forum.magicmirror.community/)\n\n[ === Hier gehts zur Bewerbung === ](http://magicmirror.community/?page_id=15 )\n\n\n\nMit lieben Grüßen\n\nExiledRiftWalker | Gero","replies":[]},{"poster":"Pe3RLess","date":"2017-02-28T16:58:30.972+0000","up_votes":1,"down_votes":0,"body":"Es werden keine weiteren Bewerbungen angenommen, danke für euer Interesse :)","replies":[]}]}