{"poster":"Kamikaminini","date":"2016-04-15T17:07:55.321+0000","title":"Bronze Team sucht Euch ^-^","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"schrieb vor 2 Tagen in Clans &amp; Teams\r\nHey ihr habt spa&szlig; am spielen seit zwischen 15 und 100000 jahren alt xD dann suchen wir euch #Sas Bronze Team ist ein neben clan von #sas\r\nvon mir gegr&uuml;ndet vom chef best&auml;tigt und von einem der besten spieler die ich kenne gef&uuml;hrt !!!\r\nIhr habt bock und bei zu treten ? ihr habt skill und heult nicht immer rum ? Ihr seit zwischen Bronze und Silber(maximal)\r\nIhr besetzt zu gern die top sup und jgnl lane ?? dann Schreibt mich an LightningSilver oder gleich Exabyte06\r\nbitte vergisst nicht das Ts vorhanden sein sollte und das ihr gleich nach der best&auml;tigung der fa eure lain und main champ senden sollt auserdem w&uuml;rde und der betreff SasBronze sehr weiter helfen :D\r\nich freu mich auf euch und ich bin mir sicher das wir viel spa&szlig; haben werden Euer Silver &lt;3\r\nPs. Entschuldigt die vielen schreib Fehler und Fehlenden Satz Zeichen &lt;3","replies":[{"poster":"Sandschipper","date":"2016-04-15T17:39:36.327+0000","up_votes":1,"down_votes":0,"body":"Hey ich bin jungle main und würde gerne diese position übernehmen, bronze 4 ... :/ und erst 13... werd in 20 Tagen 14.. hoffe das geht ok.. wenn ja einfach melden","replies":[{"poster":"Kamikaminini","date":"2016-04-16T10:29:11.168+0000","up_votes":1,"down_votes":0,"body":"hey naja bist relativ jung und da wir meistens bis sehr spät Spielen weis ich nicht ob es bei dir dann so gut ist ^^ bist ja noch echt jung :/","replies":[{"poster":"Sandschipper","date":"2016-04-16T18:07:24.122+0000","up_votes":1,"down_votes":0,"body":"Naja könnte unter der Woche bis 22 Uhr und am Wochenende bis 24 oder 1","replies":[]}]}]},{"poster":"flohou","date":"2016-04-15T23:20:03.164+0000","up_votes":1,"down_votes":0,"body":"War letzte Saison gold 4, hab lange nicht gespielt bin jetzt Bronze 1 und komm nich raus. Würd mein Leistungsniveau bei silber 4-5 schätzen :). Hab kein Problem zu verlieren oder auch mal einfach just4fun zu spielen, Bin 15 und top/jgl Main notfalls auch Mitte. Hätte echt Bock mitzuzocken :) - hab euch geaddet \n\nflohou","replies":[]},{"poster":"Iakai","date":"2016-04-15T17:21:16.219+0000","up_votes":1,"down_votes":0,"body":"wäre als top dabei","replies":[]},{"poster":"Quêên","date":"2016-04-15T17:15:33.513+0000","up_votes":1,"down_votes":0,"body":"Hi wäre gerne Suppoer bei euch ^^ Ich hab dir ne Fl geschickt (Shoshâ)","replies":[]}]}