{"poster":"GhostBrother","date":"2015-05-13T10:42:42.359+0000","title":"Jeden Tag selbe Uhrzeit Kick -.-","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Ich bekomme im Moment jeden tag gegen 12:15 einen Abbruch und komme dann ca. 20-30 Min. nicht mehr ins Game is klar das dieses meistens Lose ist und nen Report folgt. Hat evt. noch jemand solche Probleme? Wenn ja was kann man dagegen machen?","replies":[{"poster":"4 R4nd0m N008","date":"2015-05-13T10:56:30.153+0000","up_votes":2,"down_votes":0,"body":"Wenn du das jeden Tag hast, hört sich das nach einem Problem mit deinem Anbieter an. An Riot kann das nicht liegen, dass du jeden Tag zur **gleichen** Zeit rausfliegst. Frag mal beim Anbieter nach.","replies":[{"poster":"GhostBrother","date":"2015-05-13T11:39:11.245+0000","up_votes":1,"down_votes":0,"body":"Es ist ja nur bei LoL alles andere geht wie gewohnt","replies":[{"poster":"4 R4nd0m N008","date":"2015-05-13T12:32:11.353+0000","up_votes":1,"down_votes":0,"body":"Das muss nichts heißen. Es kann sein das dein Anbieter zu der Zeit die Ports nach Riot Games blockt. So wie bspw. die Telekom abends die Verbindung nach Youtube so sehr drosselt, dass es einem definitiv auffällt. Das Problem muss nicht bei Riot liegen. Einzelne Ports zu blocken um den Traffic zu begrenzen machen Anbieter gerne.","replies":[]}]}]},{"poster":"Śjokz","date":"2015-05-13T12:43:24.128+0000","up_votes":1,"down_votes":0,"body":"dann spiel einfach zu na anderen uhrzeit, passiert bei mir auch immer um 12uhr das sich mein router eben resettet, hab den router an nem wochenende da halt um 12uhr manuel resettet so das ich es nicht mitbekomme da ich ja um 12uhr eigentlich noch auf arbeit bin","replies":[]},{"poster":"GhostBrother","date":"2015-05-13T10:54:35.244+0000","up_votes":1,"down_votes":0,"body":"Habe gerade gesehen das Problem scheint es echt häufig zu geben also Füße still halten und weiter machen ;D bis dahin und danke für eure tipps.","replies":[]},{"poster":"Sirrkas","date":"2015-05-13T10:44:39.335+0000","up_votes":1,"down_votes":0,"body":"Das klingt für mich nach der üblichen Neuvergabe der IP. Versuch doch entweder nicht um die Uhrzeit zu spielen oder den 24 Stundenresett auf eine Uhrzeit zu legen die dich nicht stört.\n\nDazu sollte es reichen, den Router auszuschalten/auszustecken und ein wenig zu warten.","replies":[{"poster":"Zyten","date":"2015-05-13T10:47:10.058+0000","up_votes":1,"down_votes":0,"body":"Flog vor ca ner halben Stunde auch aus meinem Game raus, konnt dann auch weder auf das Forum zugreifen noch mich in LoL einloggen. Alles andere funktionierte wunderbar. Die Neuvergabe der IP liegt bei 1 Uhr, das fällt also raus. Da alles andere einwandfrei funktioniert hat, kann es kein Problem mit der generellen Internetverbindung gewesen sein.\n\nZudem war so ziemlich das komplette Gegnerteam und ein weiteres Teammitglied aus meinem Team rausgeflogen.\nIch glaube, dass grade eher die Server Mist gebaut haben.\n\nDas Problem habe ich jedoch nicht täglich. Das traf nur heute zu. ","replies":[{"poster":"GhostBrother","date":"2015-05-13T10:51:10.539+0000","up_votes":1,"down_votes":0,"body":"Also bin ich nicht der einzige dem das Passiert das ist ja ( schön ) ;D","replies":[]},{"poster":"DerZermetzelte","date":"2015-05-13T10:50:33.381+0000","up_votes":1,"down_votes":0,"body":"MOMENTAN spacken die Server. Bin auch nur hier weil Ich rausgeworfen wurde ^^","replies":[]}]},{"poster":"GhostBrother","date":"2015-05-13T10:48:16.453+0000","up_votes":1,"down_votes":0,"body":"aber das dauert doch keine 30 minuten... und der reset ist eigentlich um 01:10 Nachts bei mir damit eben so etwas nicht passieren kann.","replies":[]}]},{"poster":"GhostBrother","date":"2015-05-13T10:44:14.630+0000","up_votes":1,"down_votes":0,"body":"und siehe da genau 30 min später komme ich wieder rein, habe keinen Plan woran das Liegen könnte?","replies":[{"poster":"DerZermetzelte","date":"2015-05-13T10:48:38.226+0000","up_votes":1,"down_votes":0,"body":"Wie bereits erwähnt, kann dein Router verdächtigt werden. Wenn das immer noch nicht funzt, musst du dich wohl drauf einstellen. Wie du ja schon festgestellt hast, scheint es zu festen Zeiten aufzutreten. Also kein Problem.","replies":[]}]}]}