{"poster":"TxF Snyps","date":"2017-02-01T07:07:31.993+0000","title":"Champion-Vorschalg","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":0,"body":"Liebes Riot-Team,\r\n\r\nich bin ein sehr gro&szlig;er Fan von ihrem Spiel League of Legends und habe mir deshalb einiges an Gedanken gemacht,\r\nwie ich meinen Teil zu dem Spiel beitragen kann und bin dabei auf eine Idee f&uuml;r einen neuen Champion gekommen,\r\nwelche ich ihnen gerne vorstellen w&uuml;rde. Ich habe mir auch einiges an Gedanken gemacht, wie dieser sein k&ouml;nnte,\r\nwas seine F&auml;higkeiten und ungef&auml;hres Aussehen angeht. Falls ihnen meine Idee gef&auml;llt, sie jedoch nicht mit meinen F&auml;higkeiten oder Aussehen\r\nf&uuml;r diesen einverstanden sind, k&ouml;nnen sie dies gerne &auml;ndern, wie es ihnen gef&auml;llt.\r\n\r\nAn die League of Legends Community:\r\nIch w&uuml;rde mich auch von euch &uuml;ber eine R&uuml;ckmeldung freuen, ob euch die Idee gef&auml;llt oder nicht :)\r\n\r\nZu meiner Idee:\r\nOff-Tank f&uuml;r die Top-Lane\r\nEin Mensch, welcher &uuml;ber 2 verschiedene Formen von Kr&auml;ften verf&uuml;gt: das Licht und die Finsternis.\r\nEr skaliert je nach Form mit AD und Leben.\r\nDieser Ist so &auml;hnlich wie Jayce{{champion:126}}  und Nidalee{{champion:76}}  gedacht, in dem er mit seiner Q-F&auml;higkeit seine Form und somit \r\nauch seine Skills &auml;ndert. Dabei ist es so gedacht, das die Licht Form auf &Uuml;berlebens-F&auml;higkeiten basiert,\r\nw&auml;hrend die Form der Finsternis als Angriffs-Form dient.\r\n\r\nDies ist die Idee f&uuml;r die Gestaltung des Champions: \r\n\r\nSchindo, Gebierter &uuml;ber Licht und Finsternis\r\n\r\nOptisch stelle ich ihn mir als Mensch vor, welche von der Macht des Lichtes und der Finsternis besessen ist. Um ihre Mission\r\nerf&uuml;llen zu k&ouml;nnen, haben sie einen Pakt geschlossen, welcher Schindo gestattet, seine Linke H&auml;lfte vom Licht &uuml;bernehmen zu lassen\r\nund seine rechte H&auml;lfte von der Finsternis. Diese sieht dem entsprechend Bestialisch aus, da er von dieser Macht besessen ist.\r\nSeine H&auml;nde wirken dabei wie Klauen.\r\n\r\nSchindo hat kein Mana, daf&uuml;r eine Ressource welche ich &quot;Innere Ausgeglichenheit&quot; nenne. Diese wird f&uuml;r seine Q-F&auml;higkeit und seine\r\nR-F&auml;higkeit ben&ouml;tigt.\r\n\r\nPassiv:\t\t Schindo startet in der Finster-Form und mit Voller &quot;Innerer Ausgeglichenheit&quot;. Mit jeder T&ouml;tung wird seine \r\n\t\t &quot;Innerliche Ausgeglichenheit&quot; aufgeladen. Bei der T&ouml;tung eines Champions, wird diese komplett aufgef&uuml;llt.\r\n\r\nQ-F&auml;higkeit:\tLicht-Form: Schindo &auml;ndert seine Form zu der Finsternis-Form und sein N&auml;chster Treffer macht zus&auml;tzlichen \r\n\t\tmagischen schaden.\r\n\t\tFinsternis-Form: Schindo &auml;ndert seine Form zu der Licht vorm, welche ihm ein Schild verleiht, welcher\r\n\t\teinem pro Lvl erh&ouml;hten, festgelegtem Wert + z.b. 2% seines maximalen Lebens entspricht. Dieser h&auml;lt solange bis er von einem gegnerischen Champion oder\r\n\t\tTurm Schaden erleidet und verschwindet 2 Sekunden nachdem er Schaden durch einen Champion oder Turm erhalten hat.\r\n\t\t\r\n\t\tDiese F&auml;higkeit ist nur bei voller &quot;Innerlicher Ausgeglichenheit&quot; einsetzbar.\r\n\r\nW-F&auml;higkeit:\tLicht-Form: Schindo gibt sich ein Schild, welches mit seinem Maximalem Leben skaliert und Schaden abh&auml;lt.\r\n\t\tFinsternis-Form: Schindo sammelt Energie der Finsternis in sich und Setzt diese in From einer Kugel aus Finsternis frei.\r\n\t\tDiese kann bis zu 3 Sekunden aufgeladen werden. Bei voller Aufladung erh&auml;lt dieser erh&ouml;hte Reichweite, erh&ouml;hten Schaden\r\n\t\tund kann durch gegnerische Vasallen fliegen.\r\n\r\nE-F&auml;higkeit:\tLicht-Form: Schindo konzentriert die macht des Lichtes in ihm und setzt einen kleinen Teil davon frei, woraufhin alle Gegner \r\n\t\tin einem kleinem Bereich um ihn herum f&uuml;r 1 Sekunde Bet&auml;ubt werden. Schindo erh&auml;lt f&uuml;r jeden Bet&auml;ubten Gegner 5 R&uuml;stung und\r\n\t\tMagieresistenz f&uuml;r 3 Sekunden.\r\n\t\tFinsternis-Form: Schindos Hand vergr&ouml;&szlig;ert sich je nach Aufladezeit (bis zu 3 Sekunden) und schl&auml;gt um sich, was Schaden in einem\r\n\t\tRadius um sich macht. Die Reichweite und der Schaden wird erh&ouml;ht, je l&auml;nger diese F&auml;higkeit aufgeladen wurde. Schindo erh&auml;lt f&uuml;r\r\n\t\tjeden getroffenen Gegner ** Lauftempo.\r\n\r\nR-F&auml;higkeit:\tSchindo Entfesselt gleichzeitig die Macht des Lichtes und der Finsternis, wodurch er erh&ouml;htes Lauftempo erh&auml;lt. Zus&auml;tzlich machen \r\n\t\tseine normalen Angriffe zus&auml;tzlichen Schaden und er heilt sich mit jedem seiner Angriffe. W&auml;hrend dieser Zeit kann Schindo auf keine\r\n\t\tseiner anderen F&auml;higkeiten zur&uuml;ckgreifen. Dieser Effekt h&auml;lt 10 Sekunden an.\r\n\t\tDiese F&auml;higkeit ist in beiden Formen die selbe und kann nur bei voller &quot;Innerlicher Ausgeglichenheit&quot; benutzt werden.\r\n\r\nMFG TxF Snyps (Ehemalig Snyps2)","replies":[{"poster":"Alekra","date":"2017-02-01T08:14:34.017+0000","up_votes":1,"down_votes":0,"body":"Das problem ist:\n\nDie Q ist sollte eine Fähigkeit sein, mit der man einen Kampf eröffnen kann. Meistens ein AoE Spell oder Skillshot.\n\nDie W hat manchmal einen Passiven effekt und baut auf den Champion auf.\n\nDie E ist meistens eine Fähigkeit, die auf eine andere Fähigkeit aufbaut.\nIst meistens der Movement oder CC spell.\n\nDie Ulti und/oder die Passive ist was einen Champion einzigartig macht.\n\nDeine Q ist einfach das Formenwechseln, was sich wahrscheinlichbecht nicht gut anfühlen würde.\n\nIch sehe aich nicht ganz die Rolle deines Champs. Er bekommt Resistenzen for free, Skaliert mit maximalwn Leben aber seine Ulti verstärkt seine Autoattacks? Wenn er nicht AD hat ist diese Fähigkeit doch useless da er wenn er keinen Schaden macht sich auch nicht heilt. Wenn man aber Full Dmg baut, sind die skalierungen fürn arsch....","replies":[]}]}