{"poster":"hudzell","date":"2016-05-26T14:20:43.308+0000","title":"Can we be allowed to convert orange essence into blue essence and vice versa?","subforum":"Gameplay","up_votes":50,"down_votes":7,"body":"Please?","replies":[{"poster":"SpookyNeedle","date":"2016-05-26T14:41:09.386+0000","up_votes":16,"down_votes":0,"body":"If this is the case, why not just have 1 essence instead of 2","replies":[{"poster":"Woodakoodashooda","date":"2016-05-26T14:50:41.545+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=SpookyNeedle,realm=NA,application-id=3ErqAdtq,discussion-id=UtRbYYek,comment-id=0000,timestamp=2016-05-26T14:41:09.386+0000)\n>\n> If this is the case, why not just have 1 essence instead of 2\n\nI was just about to say the same exact thing!","replies":[]},{"poster":"Spoofghoul","date":"2016-05-27T17:45:03.903+0000","up_votes":1,"down_votes":0,"body":"well you can make orange twice as valuable as blue or vice versa\n\nand then there would be a difference but you coulD still allow conversion WOLOLO","replies":[]}]},{"poster":"Asyde","date":"2016-05-26T16:25:53.787+0000","up_votes":8,"down_votes":3,"body":"The problem here is that Champions can be bought/earned with IP/blue essence. Skins are bought with RP/orange essence. By having a conversion in place, you could bypass the store and purchase skins with IP. Effectively gutting RIOT's revenues. \n\nI know they are a billion dollar company but they've already given you ways to earn skins for free on a limited cycle (S ranked Chests). Bypassing this just opens up all skins for free/IP.\n\nPS: not to mention they are about to include a random champ shard for IP option in the store to help with mastery 6 & 7 RNG.","replies":[{"poster":"hudzell","date":"2016-05-27T15:30:52.179+0000","up_votes":1,"down_votes":0,"body":"But that doesn't make any sense... You can't do anything with IP in the hextech crafting system, how are you buying skins with IP? If there's a 2 for 1 conversion rate, it would be extremely hard to get a skin with just blue essence conversions.","replies":[{"poster":"BestTristMyHaus","date":"2016-05-27T16:18:32.371+0000","up_votes":1,"down_votes":0,"body":"SUPPOSEDLY, you will EVENTUALLY be able to buy blue essence or champ shards or something with IP. (you can \"disenchant\" champ shards into blue essence)","replies":[{"poster":"Mojihito666","date":"2016-05-27T16:33:49.984+0000","up_votes":1,"down_votes":0,"body":"> SUPPOSEDLY, you will EVENTUALLY\n\nNo one cares.","replies":[{"poster":"DorkunedAuras","date":"2016-05-27T20:43:12.939+0000","up_votes":1,"down_votes":0,"body":"how about next patch","replies":[]}]},{"poster":"DorkunedAuras","date":"2016-05-27T20:41:40.655+0000","up_votes":1,"down_votes":0,"body":"\"chest_mystery_champion_shard\" and \"chest_mystery_champion_shard_crafter\" shop asset added. These are likely related to the upcoming IP/RP purchasable item to gives a random champion shard that was  mentioned with the addition of champion mastery 6 and 7 in patch 6.10. Nothing up in the PBE shop yet.","replies":[]}]},{"poster":"Asyde","date":"2016-05-27T16:33:23.805+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=hudzell,realm=NA,application-id=3ErqAdtq,discussion-id=UtRbYYek,comment-id=00040000,timestamp=2016-05-27T15:30:52.179+0000)\n>\n> But that doesn&#x27;t make any sense... You can&#x27;t do anything with IP in the hextech crafting system, how are you buying skins with IP? If there&#x27;s a 2 for 1 conversion rate, it would be extremely hard to get a skin with just blue essence conversions.\n\nYes, Currently IP has no effect on the Hextech system but that is not the case soon (as stated by RIOT, i'll explain further down).\n\nBut here is an example of how your conversion system would cause problems:\n\nWe all know the standard system allows you to buy champions for free by earning IP, and their primary revenue source (what keeps the game going) is customers buying RP to purchase skins and other content. More simply stated: Want Champions? Play lots of games to unlock or Pay $$. Want Skins? Pay $$.\n\nNow similarly to IP/RP, blue essence/orange essence unlock the same content. As a gift from RIOT you can earn both blue and orange essence through gameplay, meaning you can get lots of skins and champs for free that you would normally have to buy RP for (lowering their revenue). However, In order to offset and control this (so they don't lose a shit ton of money) an limited RNG system was put in place (S rated hextech chests). This way, it's possible to earn skins, but you aren't getting tons and tons of skins for free in a relatively short period of time without having to pay $$.\n\nBy asking for a conversion process, you are essentially asking to convert IP into RP (blue into orange). Or more simply stated: You are asking them to rapidly increase the amount of free skins you get. Even at a 2:1 ratio, this tips the scales of how often you can get skins for free, essentially bypassing the need for pay $$ all together. This would be an utterly terrible business decision for RIOT, and if enough people abused that system it would destroy the company; They would never make enough revenue to keep the game running. \n\nNow since IP essentially = Blue essence, They are not too concerned with your ability to earn champions since you can already earn them at a steady rate through IP. This is why they are introducing a \"Buy a random champion shard\" with IP feature into the store soon. The point of this is to help alleviate the RNG on obtaining blue essence for those trying to unlock champion mastery 6 & 7.\n\nIf a conversion process was in place, especially after being able to buy Blue essence with IP, you could essentially buy everything in the game with IP.\n\nEarn IP > Buy Blue Essence > Convert to Orange Essence > Unlock Skins for free.","replies":[]}]}]},{"poster":"bulldoggamer","date":"2016-05-26T15:47:10.612+0000","up_votes":4,"down_votes":0,"body":"I would agree with the idea that 1 type of essence would be far more efficient. Champion essence is far less valuable and far less frequent. I do appreciate that they are trying to incorporate more uses for it, but it feels as if one type of essence would just be better overall.","replies":[]},{"poster":"FurretHasAGlock","date":"2016-05-26T15:22:21.858+0000","up_votes":3,"down_votes":0,"body":"Or you have have a conversion rate. Maybe something like 1-2 and vice versa?","replies":[{"poster":"Lady Hammerlock","date":"2016-05-27T09:20:46.845+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Derpasaurus Trex,realm=NA,application-id=3ErqAdtq,discussion-id=UtRbYYek,comment-id=0001,timestamp=2016-05-26T15:22:21.858+0000)\n>\n> Or you have have a conversion rate. Maybe something like 1-2 and vice versa?\n\nfor every 2 orange essence = 1 blue and vice versa sound like a great idea!","replies":[]}]},{"poster":"DorkunedAuras","date":"2016-05-27T20:40:59.542+0000","up_votes":2,"down_votes":0,"body":"\"chest_mystery_champion_shard\" and \"chest_mystery_champion_shard_crafter\" shop asset added. These are likely related to the upcoming IP/RP purchasable item to gives a random champion shard that was  mentioned with the addition of champion mastery 6 and 7 in patch 6.10.","replies":[]},{"poster":"Mazariamonti","date":"2016-05-27T18:48:34.780+0000","up_votes":1,"down_votes":0,"body":"I've got like 3000 orange essence, maybe someday I'll get that zombie brand shard","replies":[]},{"poster":"Colgate Gator","date":"2016-05-27T15:33:06.658+0000","up_votes":1,"down_votes":0,"body":"Or...Have just one kind of essence.\n\nOr...Not shoehorn Hextech thingy into Champion Masteries.","replies":[{"poster":"hudzell","date":"2016-05-27T15:41:52.421+0000","up_votes":1,"down_votes":0,"body":"\"That's a great idea, so it won't be implemented.\" -rito","replies":[]}]},{"poster":"MrRainbowPanda","date":"2016-05-27T05:24:46.324+0000","up_votes":1,"down_votes":0,"body":"This is really annoying as I get skin shards and I want to get the new mastery levels and I cant even after getting the tokens which should be the real challenge of leveling instead of hoping you get blue essence\n\n\n\nhttps://www.twitch.tv/mrrainbowpandaa\n","replies":[]},{"poster":"Zackeryss","date":"2016-05-26T19:59:57.887+0000","up_votes":1,"down_votes":0,"body":"I would take a lower conversion rate, for ex 2 blue for 1 orange essence. I don't have either blue nor orange, so ill just go sit in a corner.","replies":[]},{"poster":"macromite","date":"2016-05-26T15:54:02.697+0000","up_votes":1,"down_votes":0,"body":"good idea, But to implement it they would need to have retardedly bad returns. like 50 blue for 1 orange, and vice versa.","replies":[]}]}