{"poster":"Thresh Muay Thai","date":"2017-07-14T21:34:59.693+0000","title":"Me ban sin razon alguna es ENCERIO y NO me mandaron nada al mail PORFAVOR AYUDA","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Buenas hoy me meto al game lo unico distinto q hise fue abrir el juego de avast que es el antivirus ya q mi pc esta con virus y un amigo me lo recomendo al meterme pongo contrase&ntilde;a usuario y pum ban permanente q me fije en el mail me meto al mail y nada PORFAVOR ayudenme ya mande ticket es el numero  N.&ordm; 31006891 si alguna buena persona me puede acelerar el ticket le juro q le agradeceria del corazon no se dan una idea de lo desesperado que estoy porfavor ayudenme chicos","replies":[{"poster":"Excorpion","date":"2017-07-14T21:43:18.627+0000","up_votes":1,"down_votes":0,"body":"Tranquilo, ya te dijeron en el post anterior lo que necesitas saber.\nEl ticket demora máximo un dia, y el chat es lo que puedes probar.\nHacer más post en el foro no servirá de nada.","replies":[{"poster":"Thresh Muay Thai","date":"2017-07-14T21:44:00.763+0000","up_votes":1,"down_votes":0,"body":"como es lo del chat me podes explicar no logro abrirlo","replies":[{"poster":"Excorpion","date":"2017-07-14T21:51:19.401+0000","up_votes":1,"down_votes":0,"body":"Mientras haces una petición, al llenar todos los datos, junto con el botón de ENVIAR, aparece la opción de CHAT.\nLe haces click y aparece una ventana al lado.\nSi no te aparece en el navegador, te sugiero tratar con otro.\n\nSi por alguna razón no aparece, solo debes esperar. Que tan grave es tu problema que estas tan desesperado ? nunca habia visto una reacción asi.","replies":[{"poster":"Thresh Muay Thai","date":"2017-07-14T21:53:15.111+0000","up_votes":1,"down_votes":0,"body":"man entendeme ponete en mi lugar u momento ayer acendi a platino, hoy me levant estoy en vacaciones y igo voy a jugar una partida de lol re chill escuchando musica me meto y me aparese eso ahora estoy tratando de ver q paso no me da info el lol los sabdos no hay oporte y domingos tampoco me dijieron y no me aparese lo del chat ya trate mil cosas no te das una idea lo desesperado q estoy","replies":[{"poster":"Excorpion","date":"2017-07-14T21:54:19.160+0000","up_votes":1,"down_votes":0,"body":"aparece eso ? que te apareció ? te suspendieron la cuenta ?","replies":[{"poster":"Thresh Muay Thai","date":"2017-07-14T21:55:54.784+0000","up_votes":1,"down_votes":0,"body":"me meti al lol pum usuario pum contraseña todo bien carga me aparese que la cuenta esta ban permanente q me fije en el mail me voy corriendo al mail nada... trato de iniciar dneuevo lo mismo","replies":[{"poster":"Excorpion","date":"2017-07-14T21:59:33.928+0000","up_votes":1,"down_votes":0,"body":"Bueno pues, desesperarse no ayuda en nada, el ticket demorará más ahora en fin de semana, pero tendrás respuesta, ya está notificado, y mandaste el ticket, solo te queda esperar tu turno.\nEspero tengas suerte :3","replies":[]},{"poster":"Thresh Muay Thai","date":"2017-07-14T21:59:29.908+0000","up_votes":1,"down_votes":0,"body":"me aparece: jugador bloqueado esta cuenta a sido ban permanentemente compruebe la direcion de correo electronico....","replies":[]}]}]}]}]}]}]},{"poster":"SAD Katarina","date":"2017-07-14T21:40:00.921+0000","up_votes":1,"down_votes":0,"body":"Manda un ticket al [Soporte](https://support.riotgames.com/hc/es-419)","replies":[{"poster":"Excorpion","date":"2017-07-14T21:42:22.014+0000","up_votes":1,"down_votes":0,"body":"ya lo hizo, es su 2do post de esto.","replies":[{"poster":"SAD Katarina","date":"2017-07-14T21:43:13.997+0000","up_votes":1,"down_votes":0,"body":"Entonces que espere.","replies":[]}]}]},{"poster":"More Powder CLEO","date":"2017-07-14T21:36:07.530+0000","up_votes":1,"down_votes":0,"body":"Envia un ticket al soporte preguntandole porque te banearon.Ellos suelen responder de lunes a viernes excepto los sabados y domingos C:","replies":[]}]}