{"poster":"UltraFireFX","date":"2015-05-31T13:25:41.435+0000","title":"Give Morgana's Q a small channel?","subforum":"Player Creations","up_votes":1,"down_votes":1,"body":"Compare the effort/CC duration/CC type ratios of people like **Ekko**, **Twisted Fate**, **Karma**, **Jinx** and **Veigar** to **Morgana** and you will think it&#039;s unfair too\r\n1. **Ekko** needs to get his E in the right place with the enemy and himself in it for a 3 second stun.\r\n2. **Twisted Fate** needs to wait for his yellow card to come out and then auto-attack his target to stun him for 1 to 2 seconds.\r\n3. **Karma** needs to stay within range of her target for 2 seconds to root them for 2 seconds.\r\n4. **Jinx** needs to channel for a few seconds before slowing her target for 2 seconds, any good Jinx knows this isn&#039;t a reliable way to escape multiple people as the rest may catch up but when escaping one, it is bliss.\r\n5, **Veigar** needs to position his E in such a way that his target doesn&#039;t escape during the 0.5 second channel (or stay in the middle) to stun them for 2.5 seconds.\r\n6. **Morgana** simply needs to aim her Q (which mind you, is a rather large projectile) and root them for 2.5s, it&#039;s really easy to get away from one person this way as it barely stops her whilst ending the chase for them!\r\n\r\nNow I&#039;m not saying to reduce the duration or change the type, as that is Morgana&#039;s kit, I&#039;m simply asking the community if they think she needs a CHANNEL on it (Like Zap! or Piltover Peacemaker)\r\n\r\nTL;DR\r\nI believe CC and damage should be earned and in my personal opinion, Morgana&#039;s Q is too much for too little. What do you think?","replies":[{"poster":"DiamondAries","date":"2015-06-01T00:31:49.490+0000","up_votes":1,"down_votes":0,"body":"For one, Morg's Q hit box is funkier than Armour of the Fifth Age Taric. \n\nFor two, Morg's Q doesn't go through minions\n\nFor three, Morg's Q is a skill shot\n\nFor four, Morg's Q has a slow projectile speed\n\nFor five, Morg doesn't have any other form of peel so she is basically screwed if she misses with it while an angry Rengar is chasing her.\n\nIf you are half decent at positioning then you should be able to dodge most, if not all, of her Qs\n\nIf you want to talk BS CC, what about a shotgun Ashe Ult? Point blank and you are stunned for a solid 3 seconds.","replies":[{"poster":"UltraFireFX","date":"2015-07-24T13:58:44.720+0000","up_votes":1,"down_votes":0,"body":"> For one, Morg's Q hit box is funkier than Armour of the Fifth Age Taric.\n\nThat simply doesn't make sense.\n\n> For two, Morg's Q doesn't go through minions\n\nThere aren't minions in Dragon/Baron fights or most jungle fights or chases.\n\n> For three, Morg's Q is a skill shot\n\nSkill shots can be dodged, Ezreal's Q is a skillshot, Jinx's Ult is a skillshot and so is Ashe's Ult\n\n> For four, Morg's Q has a slow projectile speed\n\nSlow projectile speed at point blank range literally, means nothing\n\n> For five, Morg doesn't have any other form of peel so she is basically screwed if she misses with it while an angry Rengar is chasing her.\n\nNor does Katarina, or many other champions for that matter, but they cope, and mind this, peel gets enemies off a target (like headbutt or condemn), dark binding simply ROOTS them, meaning they can still auto-attack, if they are ranged they can still get kills, the main purpose of Dark binding is to allow for follow-up abilities like Tormented soil and Flame chompers.\n\nAlso, many other champions (supports included) have CC that require channels (Blitz, Thresh, Karma, Soraka, must I go on?)\n\n\nGet over the late reply, boards just pulled this back up for some dumb reason.","replies":[]},{"poster":"UltraFireFX","date":"2015-06-01T00:58:11.296+0000","up_votes":1,"down_votes":0,"body":"Firstly, a 'point-blank' Ashe ult stuns you for **1** second, it only stuns you for 3.5 seconds if you are **far away from her** (I.E. the other side of the map), besides, that is her ultimate, not her Q.\n\nSecondly, if the angry Rengar is chasing her (Which is odd in the first place as her **primary** role is support), then having to wait 0.5 of a second before rooting him for 2.5 seconds is pretty fair in my opinion.\n\nAll I was thinking is to stop Morgana's from Q'ing the group of people chasing her (and her team) without falling behind.\nBesides, Thresh's hook has a longer channel than hers and no one complains, because they can predict movement.","replies":[{"poster":"DiamondAries","date":"2015-06-01T23:45:11.719+0000","up_votes":1,"down_votes":0,"body":"Well Ashe's Ult must be bugged, because whenever I eat an arrow to the face in lane I am stunned for what seems like an eternity. Must be with her new update or something...\n\nAlso did you know her salvo works with Runaan's Hurricane? Each bolt of her salvo count's as an AA. Good thing she isn't tankier than she is or On-Hit Ashe builds would be OP\n\nAnother thing, how is it odd to get chased by a Rengar? It doesn't matter what lane your in, an enemy jungler can chase you.","replies":[]}]}]},{"poster":"kJs","date":"2015-06-01T03:09:14.342+0000","up_votes":1,"down_votes":0,"body":"Make the snare duration scale with the ability travel distance.\nLike Xerath's 2.5 second stun at max range. \n\nI also didn't vote for any of those.","replies":[]},{"poster":"JasonWazza","date":"2015-05-31T22:18:22.187+0000","up_votes":1,"down_votes":0,"body":"So lets take into account the champions/CC your comparing to Morgana.\n\nEkko: Is an assassin, and thus shouldn't have a super reliable stun.\nTwisted Fate: Has his stun on a shit all cooldown (especially compared to a Morg Q)\nKarma: Has a POINT AND CLICK way to CC someone, Morg's is a skill shot.\nJinx: Is an ADC, enough said.\nVeigar: Can insta several people on the team if they hit this CC.\n\nYeah none of these are valid arguments.","replies":[{"poster":"UltraFireFX","date":"2015-06-01T01:03:50.937+0000","up_votes":1,"down_votes":0,"body":"\"Veigar: Can insta several people on the team if they hit this CC.\"\nUmm no, because he bursts down one champion at a time, his only splash is his Dark Matter, which can't kill a full health anyone by itself.","replies":[{"poster":"JasonWazza","date":"2015-06-01T02:02:39.038+0000","up_votes":1,"down_votes":0,"body":"His W>Q can insta people a few items in, but again you didn't actually counter my point that you were wrong, fact is the champs you listed have different CC for different reasons to Morgana.\n\nTo do damage Morgana requires you to stand in her W.","replies":[{"poster":"kJs","date":"2015-06-01T03:06:06.870+0000","up_votes":1,"down_votes":0,"body":"Perfect for her Snare!","replies":[{"poster":"JasonWazza","date":"2015-06-01T03:08:16.867+0000","up_votes":1,"down_votes":0,"body":"Which is why she has a long snare, because it's a really slow DoT","replies":[]}]}]}]}]},{"poster":"Alamo","date":"2015-06-01T01:22:50.885+0000","up_votes":1,"down_votes":0,"body":"Rito did a pretty good job at reworking morg. I think she is fine as she is. There is no good reason to change her.","replies":[]},{"poster":"RLG Shaky","date":"2015-05-31T14:28:56.586+0000","up_votes":1,"down_votes":0,"body":"personally i think that morgana herself is to strong but at the same time can be counter but you need to dodge the snare which can sometimes be a hassle, so i was thinking maybe instead of a channel cause then she would be to predictable, maybe a thinner hit box, cause seriously there have been some unexpected q i have landed and it kinda made me feel bad, the channel was a good idea but i think maybe her hotbox instead. personal opinion though","replies":[{"poster":"UltraFireFX","date":"2015-06-01T01:02:38.352+0000","up_votes":1,"down_votes":0,"body":"I was thinking the same think too but the Morgana mains really hate that idea, sure she has a large hit box but so does Veigar's event horizon, and his is a stun for 2.5 seconds, rather close to a root fot 2.5 seconds, Veigar has now got a 0.5 second channel and no one really complains anymore, and I beleve the same would happen if done to Morgana.","replies":[]}]},{"poster":"Jink","date":"2015-05-31T15:50:43.158+0000","up_votes":1,"down_votes":0,"body":"Taric just point and click stuns people while being tank.\nCho'Gath just Knocks up a massive area.\nSyndra can Stun people in a huge aoe, through minions and each other at huge range.\n\nWhy is Morgana a problem, get blind snared or caught out? Map awareness & Positioning.\n\nOf course Morgana is strong, basically everyone is. Spell shields counter her as do silences to some extent for example Nocturne and Sivir because they can just eat her Snares and once that's down, she has Ultimate which in a situation where she's running is basically a huge waste to use because then your team can smash team fights and engage heavy.","replies":[{"poster":"UltraFireFX","date":"2015-06-01T01:00:56.488+0000","up_votes":1,"down_votes":0,"body":"Taric stuns them for 1.2-1.6 seconds, not 2.5 seconds, point invalid.\nCho'Gath has, like I said, a channel to his knock up, point invalid.\nSyndra requires to A. have a sphere and B. to have said sphere between her and her target, and it's only a 1.5 second stun, point invalid.","replies":[]}]},{"poster":"Alamo","date":"2015-05-31T22:54:41.797+0000","up_votes":1,"down_votes":0,"body":"Morgana is fine.","replies":[]}]}