{"poster":"Poop Jelly","date":"2016-01-30T23:59:17.214+0000","title":"Any plan for a new Janna skin?","subforum":"Story, Art, & Sound","up_votes":4,"down_votes":4,"body":"Is it possible to ask if Riot has Janna in progress of making a new skin for her? I&#039;ve heard that she might need a Visual Update so that&#039;s why she has been postponed on skins. Any confirmation on that would be nice too! :&gt;","replies":[{"poster":"Marcia","date":"2016-01-31T21:45:32.999+0000","up_votes":3,"down_votes":1,"body":"Most champions have some type of skin in the works unless their model is in really rough shapes. As of right now there hasn't been any type of discussion by Riot on Janna being in need of a Visual Update. If she receives anything, it would probably be on the scale of Miss Fortune's or Sona's.\n\nI was half expecting a Janna skin for Valentines Day because in my head it made a lot of sense, so there must be something else in store coming at some point! Janna is my favorite champion, so I definitely hope we see something for her soon, whether it's a new skin or a visual update. :)","replies":[{"poster":"moonstones","date":"2016-02-02T18:00:10.055+0000","up_votes":1,"down_votes":0,"body":"> Most champions have some type of skin in the works\n\nThis actually isn't true - while we are working on a bunch of skins, we aren't working on a skin/have plans for a skin for every eligible champion. It's pretty hard to plan ahead for over 100 champs! While we do plan pretty far in advance, creating plans for every skin in advance is a tall order to fill. :P\n\nAs for Janna specifically, she is one of the champions who is currently eligible to receive a skin, as she isn't blocked by an update on the Champion Update page. \n\nThat said, we don't generally announce what we have in the works for a champion in terms of a skin because timelines change, and sometimes, the initial concept or idea we were working on doesn't pan out in the long run, and then it's back to the drawing board! \n\nA good example of this was when a few Cyber Katarina files shipped out to PBE. We later explained that this was a skin idea we'd explored, but it ultimately didn't work out.","replies":[{"poster":"Lazlow","date":"2016-02-02T18:25:46.996+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Riot KateyKhaos,realm=NA,application-id=6kFXY1kR,discussion-id=2AyMLEwP,comment-id=00000000,timestamp=2016-02-02T18:00:10.055+0000)\n\n> As for Janna specifically, she is one of the champions who is currently eligible to receive a skin, as she isn't blocked by an update on the Champion Update page. \n\nLet me guess. Swain isn't one of those champions and he will not be getting a skin for 4 years in a row. If this happens and Ahri/ Lee Sin get ANOTHER just to pile on skins for the sake of it like Sona. I'm going to cry irl.","replies":[]}]}]},{"poster":"MistahUndaCova","date":"2016-08-28T00:56:14.318+0000","up_votes":1,"down_votes":0,"body":"Any updates on the upcoming Janna skin?\nI'm a huge Janna person. Yes, I know he has lots of skins, but it feels like she hasn't had one in like 3 years.\nA Janna skin update may up the Janna pick rate :D\nI know cancer is not a good thing but it feels good when people call her a cancerous champion.\n:D","replies":[]},{"poster":"warmcorntortilla","date":"2016-02-01T09:23:11.387+0000","up_votes":1,"down_votes":0,"body":"But she already has the best skin in the game...","replies":[]}]}