{"poster":"vaVav","date":"2016-11-13T23:59:58.530+0000","title":"Felicitaciones Riot","subforum":"Charlas Generales","up_votes":99,"down_votes":12,"body":"Voy a expresar toda la frustraci&oacute;n que tengo de la manera mas calmada que pueda, as&iacute; que no me importa si este post llega a infinitos negativos. Solo busco ver si hay personas que piensen igual que yo en los comentarios y no personas que no tengan ni dos dedos de frente. \r\n\r\nDesde hace un par de d&iacute;as que quitaron Reclutamiento Normal se puede ver claramente la verdadera comunidad, los bandos, las ideas y lo mas importante, las opiniones. \r\n\r\nRiot Games es una empresa que busca mejorar constantemente, pues bien, de lo contrario quedar&iacute;a estancada. Y como la mayor&iacute;a de las empresas, suele arriesgarse en busca de lo mejorar, por que bueno; el que no arriesga no gana.\r\n\r\nPero, el que no arriesga no pierde. Y aqu&iacute; se pudo ver claramente como Riot movi&oacute; mal la pieza.\r\n\r\nLo peor de todo, es que dejan a los jugadores dos caminos:\r\n\r\n- Ser clasificados.\r\n- Entrar a un &aacute;mbito de toxicidad. \r\n\r\nSin mencionar que los nuevos jugadores les va a tocar empezar a jugar con otros jugadores conociendo lo peor del juego, posible ra&iacute;z de lo que actualmente intentan mejorar los reports.\r\n\r\nY por si fuera poco, Riot no hace alguna de las dos cosas que podr&iacute;an solucionar el problema:\r\n\r\n**Admitir el error**, por que eso es, un error fatal que hizo que jugadores est&eacute;n quej&aacute;ndose reiteradamente en el foro para que a Riot se le prenda el foco y se le ocurra admitir la culpa.\r\n\r\n**Hacer una encuesta**. Una alternativa es hacer una encuesta con el fin de saber si la gente va a querer que Reclutamiento Normal vuelva o no. La opci&oacute;n ganadora seria la decisiva, se ver&iacute;a claramente que es lo que quiere la comunidad de LoL.\r\n\r\nAs&iacute; que bueno, felicitaciones Riot, lograste darnos a entender que de una forma u otra ibas a destrozar el juego que tardaste much&iacute;simo en crear y aun mas en ir &quot;perfeccionando&quot;. Obviamente, todo se acaba, pero tampoco deb&iacute;as cagarla como lo hiciste quitando Reclutamiento Normal. Y no, no soy un exagerado ni un llor&oacute;n, es que estoy dici&eacute;ndoles la verdad por mi medio preferido, el foro.\r\n\r\nObviamente no lo hiciste de malas, solo cre&iacute;ste que las minor&iacute;as no importamos y que todo esto seria algo lo cual nos resbalar&iacute;a a los jugadores ya que seg&uacute;n ustedes, **cantidad = calidad**.\r\n\r\nAhora Riot, que se ve que no quieren admitir que fue su mayor error o son unos cabezas duras ya que no nos quieren devolver el modo o un verdadero argumento, d&iacute;gannos:\r\n**&iquest;Como les salio todo esto?**\r\n\r\nSaludos, Dante.","replies":[{"poster":"CrowBlack","date":"2016-11-14T00:10:04.927+0000","up_votes":22,"down_votes":0,"body":">  así que no me importa si este post llega a infinitos negativos\n\n¿porque te darian negativos si piensas igual que todos? solo que rito no nos da bola.","replies":[{"poster":"vaVav","date":"2016-11-14T00:11:46.048+0000","up_votes":10,"down_votes":0,"body":"Cada vez se fue viendo como los posts sobre Reclutamiento Normal iban siendo peor tomados por la comunidad, supuse que este no iba a ser una excepción.","replies":[{"poster":"Sr Joe","date":"2016-11-14T01:33:21.147+0000","up_votes":6,"down_votes":0,"body":"Hay una diferencia entre \"Riot de mierda danos de vuelta la cola tanda de weones/boludos bla bla bla\" y los post que dan argumentos y tienen coherencia.\nLamentablemente esos post con argumentos en un comienzo siempre eran respondidos de esta misma forma: \"Pues entonces te invitamos a probar la nueva cola flexible, ya que se acerca mucho a Draft Pick\".\nTODOS sabemos que los Rioters de LAS son en cierta parte empleados de NA y si has trabajado en tu vida sabrás que llevar la contraria a tus superiores generalmente lleva a que te den una patada en el trasero y pa' la casa.\nAun asi es molesto que el personal de Riot games no se haya dado cuenta que lo mejor era hace una encuesta y que a nuestros clientes nos llegue la notificacion de \"Encuenta Blind o Draft pick. Tu respuesta importa\" y solo con eso se hubiesen ahorrado todo este descontento. Pero bueno...\n\"Somos Riot Games y queremos lo mejor para el pueblo, pero sin la opinión del pueblo\"","replies":[{"poster":"Valeren","date":"2016-11-14T17:52:23.485+0000","up_votes":3,"down_votes":0,"body":"Una cosa es decirle a tu jefe \"che viejo, sos un pelotudo están todos calientes por esto que hiciste\" y otra es \"disculpe, pero los usuarios no están felices y son muchas las quejas, siempre tuvimos unas pocas quejas de X o Y, pero ahora son mas de lo normal\". El tema, es que a estos pibes les faltan huevos, teniendo a toda una comunidad atrás que les daría la derecha si se ponen a dialogar.\n\nSe muere como un héroe o se vive lo suficiente para convertirse en villano.","replies":[{"poster":"Windy boi","date":"2016-11-15T04:59:22.614+0000","up_votes":1,"down_votes":0,"body":"la verdad es que estoy completamente de acuerdo contigo.","replies":[]}]}]}]}]},{"poster":"Hi im Eleven","date":"2016-11-14T00:05:26.856+0000","up_votes":15,"down_votes":1,"body":"A mi nunca me parecieron malas las 2 colas, siempre jugué más a la ciega que la de reclutamiento, pero al ver a la comunidad en este estado veo que la cagaron de una manera nunca vista, si, en las pasadas seasons tuvieron lo malo y lo bueno, pero ahora eligieron lo malo (además de ni importarles la comunidad, pudiendo pedir opiniones), cuando se van al carajo, se van al carajo posta.","replies":[]},{"poster":"BoRis1","date":"2016-11-14T03:00:22.376+0000","up_votes":12,"down_votes":0,"body":"Prefiero esperar 20 minutos y poder disfrutar de una partida con el reclutamiento normal antes que entrar en la selección oculta y toparme con niños ratas, flamers autolockers, etc etc.. De las 10 15 partidas que jugué fueron dos con suerte 'normales'","replies":[{"poster":"Zevko","date":"2016-11-15T00:47:35.511+0000","up_votes":1,"down_votes":0,"body":"ni eso, no tardaba mas de 5 minutos la cola jajaj","replies":[]}]},{"poster":"Kyo Hatori","date":"2016-11-14T00:18:43.883+0000","up_votes":6,"down_votes":0,"body":"La verdad que el grado de toxicidad que he visto es superior a otros años y pretemporadas.\n\nTomá tu like que es lo que opinamos muchos.\n\nFelices Pesadillas {{sticker:slayer-pantheon-thumbs}} ","replies":[]},{"poster":"Eón Grandioz","date":"2016-11-14T02:14:27.588+0000","up_votes":3,"down_votes":0,"body":"cuando una empresa toma una decisión que genera cambios radicales generalmente lo normal es que las personas afectadas se resisten al cambio, pero los beneficios, si es que los hay, se ven reflejados a mediano o largo plazo una vez que los cambios ya se asimilaron, a lo que voy es que es muy pronto para decir que fue un fracaso y riot lo dijo, eso se sabrá una vez que la gente deje de jugar y deje de comprar RP. a pesar de todo esto y personalmente me cagaron el juego y creo que es la peor decisión que pudieron tomar, yo ya no juego lol por esta mierda. gg nomas.","replies":[{"poster":"Azahar","date":"2016-11-14T22:54:05.827+0000","up_votes":4,"down_votes":0,"body":"Eso se llama gestión del cambio y rito lo hace pésimo... porque los cambios grandes en organizaciones, se hacen de la mano de los involucrados, no sólo se avisan, sino que se comparten programas, perspectivas y lo más importante SE PREGUNTA. Se mide no sólo con números, sino también con encuestas y opiniones. Más allá si es un éxito o un fracaso, la manera en que lo han hecho ha sido errónea y prepotente, dejando en claro que somos el server conejillo de indias de riot :(","replies":[{"poster":"Eón Grandioz","date":"2016-11-15T01:01:35.809+0000","up_votes":1,"down_votes":0,"body":"tienes razon hermano, pero preguntandoles a la comunidad su opinión no es la forma en que riot gestiona las cosas y el mismo riot gaussrik lo dijo.","replies":[]}]},{"poster":"Valeren","date":"2016-11-14T17:55:22.088+0000","up_votes":1,"down_votes":0,"body":"El dota hizo ese cambio y los putearon, bien dejen de jugar dota, Steam tiene otras fuentes de obtener ingresos, qué importa un juego? Estos pibes no tienen otra fuente de ingresos, me parece bastante boludo lo que hicieron y adhiero, la aceptación, si es que se da, se va a dar a largo plazo. En el mejor de los casos va a dar paso a una nueva camada de jugadores.","replies":[]}]},{"poster":"José Larralde","date":"2016-11-14T01:47:07.813+0000","up_votes":5,"down_votes":1,"body":"Yo creo que la mayor parte de los que usan el foro están de acuerdo a tu pensamiento. También son las mismas personas que no trolean, no se van afk, ni flamean, y es por eso que quieren que vuelva Reclutamiento Normal. \n\nEl resto de los usuarios que no usan el foro son los mismos que juegan Selección Oculta y, por desgracia, son la gran mayoría. Digo \"desgracia\" porque esa gente es la que instalockea sin cantar línea, se va afk si pierde línea, insulta sin parar cuando alguien comete un error, etcétera.\n\nSolamente es mi opinión. Saludos!","replies":[{"poster":"Valeren","date":"2016-11-14T17:59:14.026+0000","up_votes":1,"down_votes":1,"body":"Ey! Yo si los puteo a los mancos/estúpidos y mas si no son capaces de seguir directivas simples como \"jugá defensivo hasta que vaya el jg a gankearte\", lo de afk depende, a veces me frustro de cuidar a un \"adc\" estúpido que quiere hacerle 1v1 a vayne con un score 6/0. Y sin embargo ando por el foro donde me cogen a negativos por decir lo que varios piensan de una forma poco amigable.","replies":[]}]},{"poster":"Thails SirYordle","date":"2016-11-14T19:44:35.695+0000","up_votes":3,"down_votes":0,"body":"Es imposible darte negativo si tienes la razon\n\nPD: Sacaron las flex :v","replies":[]},{"poster":"Zabivaka","date":"2016-11-14T03:49:55.031+0000","up_votes":3,"down_votes":1,"body":"***","replies":[{"poster":"Valeren","date":"2016-11-14T17:57:08.125+0000","up_votes":2,"down_votes":0,"body":"Capaz piensan que ignorando algo va a desaparecer. Capaz sería bueno que den la cara y al menos digan \"es verdad, nos equivocamos\" y hagan mea culpa. Pero dudo que lo hagan, no tienen los huevos para decir un simple \"mb\". Son boludos y no tienen huevos.","replies":[{"poster":"vk0utsider","date":"2016-11-14T18:02:44.912+0000","up_votes":3,"down_votes":0,"body":"Es que en este caso lo que los jugadores buscamos es que vuelva la cola Normal Reclutamiento, en lo personal de nada me sirve un mea culpa de Riot si va a ser solo con la intención de calmar a las fieras y que todo siga su curso.\nLo que necesito no es una disculpa, necesito la corrección del TREMENDO ERROR que cometieron.","replies":[{"poster":"Valeren","date":"2016-11-14T19:28:33.692+0000","up_votes":1,"down_votes":0,"body":"Por algo se empieza, no?","replies":[]}]},{"poster":"Negrojefe","date":"2016-11-15T00:06:22.899+0000","up_votes":1,"down_votes":0,"body":"No pueden. Los Rioters de aca no pueden decir nada si desde Los Angeles no les dicen que lo digan.","replies":[{"poster":"Valeren","date":"2016-11-15T00:48:40.933+0000","up_votes":1,"down_votes":0,"body":"Tanto autismo pueden tener?","replies":[{"poster":"Negrojefe","date":"2016-11-15T22:21:55.853+0000","up_votes":1,"down_votes":0,"body":"No es autismo. Los Rioters que tenemos aca no tienen autoridad ninguna. Solo repiten lo que se les dice desde Los Angeles.","replies":[{"poster":"Valeren","date":"2016-11-15T23:00:26.144+0000","up_votes":1,"down_votes":0,"body":"Como se suele decir, robotitos adoctrinados para no tener libre albedrío.","replies":[]}]}]}]}]}]},{"poster":"Cadenas","date":"2016-11-14T20:59:56.708+0000","up_votes":2,"down_votes":0,"body":"La cola que debía haberse eliminado era la de Normal Oculta, ya que la misma de reclutamiento te da la opción de COMODÍN te podría tocar cualquier linea. Según vi hace unos días las colas de Normal oculta tenían una mayor cantidad de gente que las seguía utilizando que la Normal Reclutamiento, pero les falto indicar una factor mas importante... cuantas de esas personas que usan la N.O. (Normal oculta) y el N.R. (Normal Reclutamiento) coleaban de forma solitaria o duo. \nEn mi caso personal, soy un profesor que termina su jornada laboral a las 18:00 (aveces a las 20:00 revisando evaluaciones y creando material, es decir, la mayoría del tiempo xD) por lo cual, cuando llego a la casa me gusta jugar una partida de lol N.R. ... pero ahora con esto de que debo peliar una linea para poder jugar lo que me gusta, pasar malos ratos, que la gente trollee toda la partida, flameos desde el inicio de la partida, etc. es perder el poco tiempo que tengo para jugar con suerte 1 partida diaria. Ahora me obligan a jugar ranked, con el unico fin de poder colear las lineas que deseo... y mas encima, es la cola que siempre se deshabilita al suceder algo con el servidor, asi que no podría aprovechar del juego todos los días del año por lo que realizaron.","replies":[{"poster":"RedKi","date":"2016-11-14T23:20:01.345+0000","up_votes":1,"down_votes":0,"body":"El problema de Reclutamiento sería que habría campeones que prácticamente no se podría usar, ya que siempre son baneanos como Zed, darius, yasuo, vayne etc. Deberían de poner las dos colas","replies":[{"poster":"Cadenas","date":"2016-11-15T00:35:22.451+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RedKi,realm=LAS,application-id=v7qsfXsE,discussion-id=d4nYOz99,comment-id=000f0000,timestamp=2016-11-14T23:20:01.345+0000)\n>\n> El problema de Reclutamiento sería que habría campeones que prácticamente no se podría usar, ya que siempre son baneanos como Zed, darius, yasuo, vayne etc. Deberían de poner las dos colas\n\nPero en ese caso se eliminan los baneos pero no toda la cola.","replies":[]}]}]},{"poster":"vk0utsider","date":"2016-11-14T17:59:10.142+0000","up_votes":2,"down_votes":0,"body":"{{sticker:zombie-brand-clap}}","replies":[]},{"poster":"Valeren","date":"2016-11-14T17:49:20.232+0000","up_votes":2,"down_votes":0,"body":"De hecho, la encuesta es la mejor forma de hacer cosas y no cagarla, estuve en el closed beta de un juego, tenía 2 modos de juego coop y pvp, antes de hacerlo open beta hicieron un poll (encuesta) y en base a eso modificaron el pve y le dieron retoques al pvp. Y hablo de una empresa \"chica\" no algo que tiene fondos casi ilimitados como riot. Coincido en lo que dice usted, entiendo que a veces cuando se modifican cosas se cagan, le paso al dota hace unos 3 años, cuando varios comentaban su descontento, creo que algunas cosas las habían vuelto a modificar. En fin, le dejo un positivo que es lo mas que puedo hacer, tristemente.","replies":[]},{"poster":"El Misionero 14","date":"2016-11-14T13:40:06.252+0000","up_votes":2,"down_votes":0,"body":"No se que es el problema la verdad, yo por cuestiones de ping, cuando el server andaba mal, me cree una cuenta en BR, y ayer entre a jugar, ya que soy 30 y no quería estar en la comunidad de LAS, y ahi, encuentro, las Ranked Flex, Las normales ocultas, y las normales de reclutamiento, no entiendo porque nos las quitaron a nosotros, siendo que muchos la jugaban.{{item:3151}}","replies":[{"poster":"vaVav","date":"2016-11-14T13:58:31.542+0000","up_votes":2,"down_votes":1,"body":"Por que el porcentaje de jugadores que jugaban Reclutamiento Normal en BR es mas alto que en LAS.","replies":[{"poster":"Negrojefe","date":"2016-11-15T00:04:47.584+0000","up_votes":1,"down_votes":0,"body":"Que importa que el porcentaje sea bajo si el tiempo de espera era corto? Y si era corto, lo digo habiendo jugado cientos de partidas en NOrmal Reclutamiento en 2016.","replies":[{"poster":"vaVav","date":"2016-11-15T03:10:22.195+0000","up_votes":1,"down_votes":0,"body":"Concuerdo contigo, pero se ve que Riot no..","replies":[]}]}]}]},{"poster":"KatVay OmegaChan","date":"2016-11-14T01:13:54.228+0000","up_votes":2,"down_votes":0,"body":"Sea cual sea tu post Novita, te doy +1 <3","replies":[]},{"poster":"Hwaxinghz","date":"2016-11-14T14:04:08.814+0000","up_votes":3,"down_votes":1,"body":"Así les pasó a Riot con estas decisiones actuales:\n\nhttp://i.imgur.com/0RpHpot.jpg\n\nLamentablemente la minoría tenemos que aguantarla como siempre.","replies":[]},{"poster":"Kanan","date":"2016-11-14T05:42:15.063+0000","up_votes":4,"down_votes":2,"body":"Porque te dariamos negativos si tenes razon papu\n{{sticker:slayer-pantheon-popcorn}} ","replies":[]},{"poster":"guReifokkusu","date":"2016-11-15T04:15:20.998+0000","up_votes":1,"down_votes":0,"body":"Por qué no pensar igual que tú se definiría como \"No tener dos dedos de frente\" ?. Osea la comunidad la hacen los players y quieras o no quieras el que es tóxico va a ser siempre tóxico aquí y \"en la quebra' del ají\" Sin mencionar que ya empezaste siendo tóxico al plantear lo que buscas con este topic.\n\nDos opciones:\n\n1.- Ser Clasificados\n\n Si mal no recuerdo, ambas colas son diferentes SoloQ y Flex y ambas tendrán recompensas únicas. Lo cual te da más opciones a recibir premio terminando la temporada. \n\n2.- Toxicidad\n\n El ser tóxico lo elije cada jugador, veanlo como quieran. Depende de cada uno mejorar la comunidad. \n\nEs la misma historia, cuando hay cambios mayores, aparecen todos los haters, ratas, como quieran llamarlos que amenazan con dejar el juego, tiran mierda fuera del tiesto (No el dj, la vasija).\n\n\n\"Hacer una encuesta\". Simplemente es algo que alguien que \"tiene dos dedos de frente\" no debería ni pensar por el simple hecho de que no todos los que juegan viven en el foro quejándose o publicando cosas y menos leyendo ( Players que no leen siquiera las patchnotes antes de jugar )\n\nEn esa encuesta posiblemente te encuentres con que \"Tú\" opinion o de la pseudomayoría gane, obviamente.\n\nSi las estadísticas ( Números reales ) dicen que el 90% de los jugadores prefieren el blindpick > draft pick es porque así es, por otro lado, en una votación posiblemente voten el 100% de ese 10% y el 1% de ese 90%.\n\n\n\n\n\nPS: Sorry la redacción, soy malísimo y estoy publicando en tantos topic que me da pereza hacer un ensayo demostrando que no tengo dos dedos de frente.","replies":[]},{"poster":"john esnoob","date":"2016-11-15T00:08:05.528+0000","up_votes":1,"down_votes":0,"body":"ya todo el mundo hizo sus quejas pero a rito no le importo mucho , hizo una noticia hablando sobre el reclutamiento normal diciendo boludeces pero nada mas","replies":[]},{"poster":"Negrojefe","date":"2016-11-14T23:55:42.768+0000","up_votes":1,"down_votes":0,"body":"Hasta que desde Los Angeles decidan, los \"Rioters\" de aca que no son mas que loros que repiten lo que les bajan desde Los Angeles no pueden decir nada.\n\nLo malo es que estoy seguro que tampoco estan intentando convencer a la gente de Los Angeles del error que cometieron y defendiendo a la region.\n\nLa verdad, estoy muy desilusionado.\n\nNo soy de postear, pero este tema es demasiado importante, algo que Riot no entiende.","replies":[]},{"poster":"Ks Erwyn","date":"2016-11-14T00:21:58.139+0000","up_votes":2,"down_votes":9,"body":"A noooo,  esto ya es inexplicable, primero Fur y luego Nova con positivos XD\n\nPues, ahora muchas de mis derrotas o victorias dependen totalmente de si la vaynes o zed tocan de mi lado o del rival, hermoso el blind...","replies":[{"poster":"vaVav","date":"2016-11-14T00:27:08.341+0000","up_votes":8,"down_votes":4,"body":"Rara vez termino con negativos, no se de que hablas.","replies":[{"poster":"Ks Erwyn","date":"2016-11-14T11:49:18.113+0000","up_votes":1,"down_votes":7,"body":"perdón me quede en la S6 :V","replies":[{"poster":"FedecarboneroUY","date":"2016-11-14T15:33:34.554+0000","up_votes":1,"down_votes":0,"body":"antiguo csm :v\n\nesto es s7 papá actualizate osea jelouuuuuu","replies":[]},{"poster":"vaVav","date":"2016-11-14T12:18:52.871+0000","up_votes":3,"down_votes":1,"body":"En la S6 era igual..","replies":[]}]}]},{"poster":"Shijim4 de Virgo","date":"2016-11-14T04:35:36.549+0000","up_votes":3,"down_votes":1,"body":"Pero si Nova siempre tiene positivos xD Fur, teken y sonya son los fijos que tienen negativos :P","replies":[]}]}]}