{"poster":"Riot Socrates","date":"2016-01-31T05:55:36.651+0000","title":"The Future of New Champ Select","subforum":"Announcements","up_votes":159,"down_votes":17,"body":"Hey all, \r\n\r\nNow that new champ select&rsquo;s out and stable, we wanted to share how we&rsquo;re going to be updating things over the coming weeks and months. We&rsquo;ve been keeping tabs on the various forums, so hopefully you see some of your suggestions here:\r\n\r\n* Pick intent will no longer show the opposing team your champion when your turn starts\r\n* Adding filters for sorting the champion grid by role\r\n* Adding ability to pull up the champion grid at any time\r\n* Shortening pre-select, pick and ban timers in champ select\r\n* Skin purchasing will work in champ select\r\n* Lots of bugfixes:\r\n * Fixing issues with soft locks around entering / leaving lobbies\r\n * Fixing issues around entering / leaving matchmaking (such as getting hit with queue dodges if you accept a match where a player is in champ select already)\r\n * Fixing queue time display inaccuracies\r\n * Free to play champions will once again be unplayable in ranked\r\n * Fixing an issue where the client is not popping to the front each time an action (AFK check, ban, pick) is required\r\n\r\nWe&rsquo;re continuing to tune matchmaking in terms of time and quality (measured as each team having an equal chance at victory), and 6.2 brought some features like ward skin and chroma selection. This list isn&rsquo;t exhaustive, so let us know your ideas for new champ select.","replies":[{"poster":"Rocketier","date":"2016-01-31T06:41:08.607+0000","up_votes":14,"down_votes":106,"body":"In premade games you sometimes get 2 junglers in 1 team, can you guys also fix that please. I'm very meta.{{champion:17}} ","replies":[{"poster":"Sailor Mint","date":"2016-01-31T06:46:53.141+0000","up_votes":134,"down_votes":4,"body":"That's not a bug. It doesn't enforce standard meta positions in a full premade.  \n\nRiot expects full premades to be old enough to sort it out themselves.","replies":[{"poster":"Sowisa","date":"2016-02-01T04:50:02.801+0000","up_votes":3,"down_votes":5,"body":"If they expect you to be old enough to sort out groups, then you are old enough to not get banned for calling a feeder a noob","replies":[{"poster":"Harmony11","date":"2016-02-01T07:04:35.966+0000","up_votes":10,"down_votes":1,"body":"No, it means you're old enough to know better than to think that calling somebody a \"noob\" or any other insult has any positive impact whatsoever.","replies":[]}]}]},{"poster":"fukimissHarambe","date":"2016-01-31T14:35:23.148+0000","up_votes":2,"down_votes":49,"body":"Why did the person with an actual complaint about new champ select get downvoted to hell while the the troll that replys to him gets upvoted a shitton...","replies":[{"poster":"ntbcool","date":"2016-01-31T16:19:09.266+0000","up_votes":51,"down_votes":0,"body":"because in a premade you should be able to sort out if your sticking to the meta or not, it isn't a bug its intended so premades(of 5) can play they way they want to play","replies":[{"poster":"Penta Penguin","date":"2016-01-31T19:14:52.539+0000","up_votes":1,"down_votes":16,"body":"I don't agree with the poster, but you clearly overestimate the 'friendships' and premades people make in this game","replies":[{"poster":"ntbcool","date":"2016-01-31T19:59:49.305+0000","up_votes":18,"down_votes":0,"body":"why would u intentionally play with someone that is going to troll... you don't even have to be friends","replies":[]}]}]}]}]},{"poster":"CanIHaveMidPlz","date":"2016-01-31T07:40:18.950+0000","up_votes":90,"down_votes":5,"body":"First of all, thank you for the transparency! Very much appreciated. I like this trend. :) \n\nNow, for the question: Is there any possibility of allowing us to be able to \"Fill except X\"? With the current UI this could be accomplished by choosing Fill as primary, then the words \"EXCEPT FOR\" show above the secondary slot, where we select which role we don't want to fill. And if someone wants to queue for every position, just replace the secondary role's \"Fill\" with...whatever phrasing would work best. \"None\" could work, but that might be confusing. Just a suggestion.\n\nThis is just a theory, of which I have no data to back up, but this could possibly result in lower queue times. There are many people who hate a given role, and are scared of choosing Fill because of the fear of getting that role. Nobody wants to be in that position of having to choose between performing poorly or dodging because they were unlucky.\n\nThis would effectively let people in this situation queue up for four roles now instead of only two, which would lower queue times for everybody, no?","replies":[]},{"poster":"Squidguy","date":"2016-01-31T10:08:28.110+0000","up_votes":67,"down_votes":0,"body":"Personally, I think your primary role should take true priority over your secondary role. As a primary mid and secondary support, I find that I'm playing as support a majority of the time. This is probably due to support being in higher demand, but I'd rather a slightly longer queue time if it means going my primary role more often.","replies":[{"poster":"Phobos Selini","date":"2016-01-31T11:32:26.803+0000","up_votes":47,"down_votes":2,"body":"That's the most important point about the new Champselect that has to be fixed. All this Clicky-Shiny Stuff is completely irrelevant if the system is not an improvement or even equally as good as the old system in providing you your role. Even in the extreme case of 1. Mid 2. Support. The system has to provide your primary choice in a significant majority of your games or the system is just bad.\nI just started some pure Solo games and so far I got 3 times Support and 1 time Mid. I will keep track of this statistic but I have my doubts that it will get any better.\n\nWhat bothers me the most is, that most of the time the queue pops instantly, probably because I'm the only player even somewhat close to my Elo on the server that is queueing with Support in any choice at all. The system rating the queuetime over the pickchoice is completely unfair. I want to wait at least some time to find the system my preferred role if it isn't available directly.\n\nSure I could change my choice to Mid/Top as a workaround. But I don't think I should have to addapt my preferrences in order to get my first choice at all. If I have to change my playstyle for the system than the system is just flawed. The system has to fullfill the wishes of all the players not the other way around. And if it is supposed to be an improvement over the old Draftmode it has to be better at providing a player his choice.\n\nSo far the system is a huge dissappointment for me. I was hoping with the new system I could get my role most of the time, with like 20-30% second role choice to accept that queue times would be to high otherwise. \n\n---\n\nAnother point is the UI of the new champselect itself. Yes it is shiny and stuff but it is giving less overview than before. To chose a ban or pick I want to have a good overview of the entire champpool. But Riot reduced the number of champs visible by a great amount.\nI have no idea how this got through development, when one of their big design goals is to provide clear information.\n\nAnd why is there no button to look at the profile of players in the premade lobby anymore? Yesterday I played a game where only one other player was on my friendlist. I wanted to look up the other player accounts which was not possible without going the detour of searching them outside of the lobby UI.","replies":[{"poster":"Turtleshead","date":"2016-01-31T12:32:07.456+0000","up_votes":15,"down_votes":2,"body":"So you've probably picked the most extreme example here (the most sought after role against the least). Having played a lot of Team Builder selecting Support meant an instantaneous lockin whereas I could wait 10+ mins for mid or more. That said, how WOULD you want Riot to handle this case? Would you want to wait 10 mins for mid, still not get mid and then get support anyway when you could have just got support 10 min earlier? Or would you like it how the old TB used to be where you'd create a team as a Mid and wait 20 mins to get a support with 30 ADC's randomly connecting, seeing you don't have a support then dropping again.\n\nIt is *NOT* something that is solvable unless you add in a \"I'll wait xx mins for my primary role\" slider because theres a massive disparity between the popularity of roles. As there are less supports than the number of games being played so you will almost always instalock. Everyone is ALWAYS waiting for support. \n\nThe knock on effect of doing this though is that it would likely make the situation a lot worse as then you have a load of people waiting in queue for 10+ mins hoping for their primary role instead if instalocking into support.\n\nUltimately if you don't like support a lot, don't pick it as your secondary role because with how few there are you're sure as hell going to be playing a lot more of it than anything else...","replies":[{"poster":"EUW Dogs","date":"2016-01-31T14:56:15.149+0000","up_votes":9,"down_votes":1,"body":"I'm playing Jungler/Supp. I'm getting Jungle less than once every 5 games.\n\nI think Riot went way too far to reduce queue time. My average queue time is below 1 second. Most of the time, it feels like it found the game before I even clicked the button.\n\nNormally I'm fine with support, but it becomes unbearable. Particularly because I went from plat to silver, and the same support I had 70% winrate with, I now have 8% winrate because people just don't know how to play at Silver and you can't carry as supp at this elo.\n\nAgain, I'm fine with supp, but it is atrociously annoying to get support games after games, when you're a Jungler main, when the system is meant to give it priority, and you end up in a role you can't do much with. I could skyrock out of silver with Jungle, but it seems I'll stay there until they fix their system, and it feels horrible.","replies":[]}]}]}]},{"poster":"FatTaco","date":"2016-01-31T11:58:34.669+0000","up_votes":3,"down_votes":33,"body":"It's still the same issues I'm reading about Support so this once again proves my point how a lot of the player base do not like Support in its current state. No one wants to play it because you don't have many opportunities to really be the victory for your team, your items are so uninteresting and give you no dueling power to anyone other than the other support or a really weak adc. You can't CS you can only click around the lane waiting for 1 of them to make a mistep which is just uninteresting gameplay because you're waiting for who to derp out first. Supports do not get any respect or gratification by other players because they view support as weak bullet sponges. Only time support has ever been interesting is when the meta shifts and allows high damage champions to join the bottom lane ({{champion:1}} {{champion:63}} {{champion:107}} {{champion:64}} ) I feel like we need another Support update like one we had in Season 4, I think maybe a big chunk of the games code needs to be reworked so Supports can fill these problems they have. No one wants to play it unless you are a player that really does not want to take responsibility which I find is a lazy excuse to have a role in the game, 1 player gets to chill out and watch others do all the hardest work.","replies":[{"poster":"Temp3te","date":"2016-01-31T12:18:01.981+0000","up_votes":34,"down_votes":1,"body":">  You can't CS you can only click around the lane waiting for 1 of them to make a mistep which is just uninteresting gameplay because you're waiting for who to derp out first.\n\nThat's... just not how you play support.","replies":[{"poster":"Spaceman5pff","date":"2016-01-31T13:17:18.538+0000","up_votes":21,"down_votes":0,"body":"I mean... it accurately describes playing Blitz and that is about it xD","replies":[{"poster":"Abyssphere","date":"2016-01-31T17:32:12.307+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Spaceman5pff,realm=NA,application-id=Ag8jgd8Q,discussion-id=zJ4kqlHZ,comment-id=004900010000,timestamp=2016-01-31T13:17:18.538+0000)\n>\n> I mean... it accurately describes playing Blitz and that is about it xD\n\nI think a lot of people who don't play support will only ever try playing people like Blitz, so they think waiting for the enemy to get into position for a hook is all there is to it.","replies":[{"poster":"SelflessTeammate","date":"2016-01-31T19:02:51.173+0000","up_votes":13,"down_votes":0,"body":"I would tell those people, If you're not having fun with the support role, you have not yet discovered The Joy of {{champion:432}}.\n\nOther recommendations for supports I find fun are {{champion:78}} (seriously, she's amazing if they have a dash, and might be the biggest screw-you to Lee Sin, Vi, and Kindred ganks in history, and especially against a Lucian), {{champion:117}}, and {{champion:267}}.\n\nIf you're still not satisfied, try {{champion:86}} support. Seriously, it's ridiculous. Blitz/Thresh don't wanna grab him, he's got a damned fine silence, is tanky as hell, does great damage with no damage items, and best of all, you can avenge your fallen lane partner almost instantly, and there's something exceptionally satisfying about that last part.","replies":[]}]}]}]},{"poster":"cuddlykitten4","date":"2016-01-31T15:53:35.152+0000","up_votes":8,"down_votes":2,"body":"Shiiit. Come play a game against me and watch my Sona carry all over you bud. I'll tell you right now, you play supp all wrong. As support, I control the entire fate of my team in my hands. I choose if you live or if you die. I choose which one of you will be going OP each game (for the record, I always choose all 4 of my allies to go OP). I am the one who creates the opportunities to ace them that the other four of you so desperately desire. You're underestimation of my main (yes, that's right, we are out there) role is why I can go so hard. Think it's boring? Well, I happen to like half healthing the ADC straight out the gate before minions even hit my lane. A true support player will show you fear on the Rift like you've never known. Instead of playing a champ I can get fed with, I play a champ where I can feed all 4 of my allies. As for your not liking the responsibility comment? Yes, yes I will take responsibility for my 15/2 MF. You know what? I'm gonna take responsibility for the 22/1 TF in mid. the 17/4 Amumu? Mine also. Not only am I playing the most fun role in the game because I don't have to do anything but skirmish all game, but I also never have to bother with the que times. I play all the roles fairly regularly, and not one of them is as hard as support. You have to juke constantly, you have to set up kills, you have to keep an eye on your ADC to make sure they are safe, you have to zone the opponent to guarantee your laner gains more cs than theirs, you have to ward (and there's more to it than \"I dropped a ward in a bush, yay me\"), you are also in the most ganked lane on the Rift so there's that as well, you have to be aware of opportunities to take drag, you have to know when to roam mid because he needs your help and jun can't make it (while deciding if you can safely leave your ADC if they choose not to roam with you). Honestly, I could keep going, but I think I've made my point.","replies":[{"poster":"FatTaco","date":"2016-01-31T17:28:59.374+0000","up_votes":1,"down_votes":7,"body":"> [{quoted}](name=cuddlykitten4,realm=NA,application-id=Ag8jgd8Q,discussion-id=zJ4kqlHZ,comment-id=00490004,timestamp=2016-01-31T15:53:35.152+0000)\n>\n> Shiiit. Come play a game against me and watch my Sona carry all over you bud. I'll tell you right now, you play supp all wrong. As support, I control the entire fate of my team in my hands. I choose if you live or if you die. I choose which one of you will be going OP each game (for the record, I always choose all 4 of my allies to go OP). I am the one who creates the opportunities to ace them that the other four of you so desperately desire. You're underestimation of my main (yes, that's right, we are out there) role is why I can go so hard. Think it's boring? Well, I happen to like half healthing the ADC straight out the gate before minions even hit my lane. A true support player will show you fear on the Rift like you've never known. Instead of playing a champ I can get fed with, I play a champ where I can feed all 4 of my allies. As for your not liking the responsibility comment? Yes, yes I will take responsibility for my 15/2 MF. You know what? I'm gonna take responsibility for the 22/1 TF in mid. the 17/4 Amumu? Mine also. Not only am I playing the most fun role in the game because I don't have to do anything but skirmish all game, but I also never have to bother with the que times. I play all the roles fairly regularly, and not one of them is as hard as support. You have to juke constantly, you have to set up kills, you have to keep an eye on your ADC to make sure they are safe, you have to zone the opponent to guarantee your laner gains more cs than theirs, you have to ward (and there's more to it than \"I dropped a ward in a bush, yay me\"), you are also in the most ganked lane on the Rift so there's that as well, you have to be aware of opportunities to take drag, you have to know when to roam mid because he needs your help and jun can't make it (while deciding if you can safely leave your ADC if they choose not to roam with you). Honestly, I could keep going, but I think I've made my point.\n\nHey dude I know support takes more \"skill\" etc etc than my 1 sentence that I wrote but in my opinion it's not hard, sorry that's just how I feel, it's easy as hell to control and make decisions on compared to every other role. It's A to B every game and only a few niche supports have changed that opinion. I'm stating the champion labeled as support for being uninteresting and held back by being a support. It's just boring.","replies":[{"poster":"Cosnirak","date":"2016-01-31T18:13:01.137+0000","up_votes":8,"down_votes":0,"body":"That's because you're bad at playing support. Which is fine, as I'm an AWFUL jungler. But I don't say jungling is easy because you mostly just beat on npcs and once in a while flank people and easily win fights where you outnumber the opponent. That would be a gross oversimplification that mostly just describes what very new players do when first learning the role and nothing else. That's what you did with your description of support.","replies":[{"poster":"FatTaco","date":"2016-01-31T20:22:58.174+0000","up_votes":1,"down_votes":7,"body":"> [{quoted}](name=Cosnirak,realm=NA,application-id=Ag8jgd8Q,discussion-id=zJ4kqlHZ,comment-id=0049000400000000,timestamp=2016-01-31T18:13:01.137+0000)\n>\n> That's because you're bad at playing support. Which is fine, as I'm an AWFUL jungler. But I don't say jungling is easy because you mostly just beat on npcs and once in a while flank people and easily win fights where you outnumber the opponent. That would be a gross oversimplification that mostly just describes what very new players do when first learning the role and nothing else. That's what you did with your description of support.\n\nIt's not hard, I don't know what to tell you, when you say you're bad at Jungle that's because for me I understand why, Jungling is stressful, having to roam, check the minimap 24/7, counter gank, make sure your carries are getting enough gold, defending other peoples turrets, buff timers, smite timers, scuttle crab management, learning what your Jungler can and can't do. In my opinion the Jungler is the most complex and high skilled role in the game and should not be played without your full attention in Ranked. Support is simple as hell, when I am tilting but still want to play I go for Support, it's so damn easy, the only thing that makes it \"hard\" is when your laner or your team can't follow you up or doesn't cooperate but that's out of your control, there's no skill involved in making sure your team works with you. If they don't you just accept it as \"Well I tried to Support the team but none of them care so I'll just watch the train wreck\" if they do cooperate it's all about waiting for the enemy to be out of position or do a cheeky gank in mid or make sure you've warded dragon and tri brush every 3 minutes. It's so easy and I hardly ever feed as a support because I know how to play safe in LoL in general. It's easy.","replies":[{"poster":"Aeolian Melodies","date":"2016-01-31T20:37:11.094+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=FatTaco,realm=EUW,application-id=Ag8jgd8Q,discussion-id=zJ4kqlHZ,comment-id=00490004000000000000,timestamp=2016-01-31T20:22:58.174+0000)\n>\n> It's not hard, I don't know what to tell you, when you say you're bad at Jungle that's because for me I understand why, Jungling is stressful, having to roam, check the minimap 24/7, counter gank, make sure your carries are getting enough gold, defending other peoples turrets, buff timers, smite timers, scuttle crab management, learning what your Jungler can and can't do. In my opinion the Jungler is the most complex and high skilled role in the game and should not be played without your full attention in Ranked. Support is simple as hell, when I am tilting but still want to play I go for Support, it's so damn easy, the only thing that makes it \"hard\" is when your laner or your team can't follow you up or doesn't cooperate but that's out of your control, there's no skill involved in making sure your team works with you. If they don't you just accept it as \"Well I tried to Support the team but none of them care so I'll just watch the train wreck\" if they do cooperate it's all about waiting for the enemy to be out of position or do a cheeky gank in mid or make sure you've warded dragon and tri brush every 3 minutes.** It's so easy and I hardly ever feed as a support because I know how to play safe in LoL in general. It's easy.\n**\n\nIt's easy to not be the reason your team loses. Harder to be the reason why you win.","replies":[]}]}]}]}]}]},{"poster":"darkdill","date":"2016-01-31T06:00:16.097+0000","up_votes":25,"down_votes":28,"body":"Is there ANY accommodation going forward for people who only want to play one role (i.e. \"I can't play anything but top!\")?\n\nOr is it now \"Only play one role? Sorry, play another game.\"\n\nEDIT: I can play any role, but sometimes I don't want to let RNG put me in a spot other than jungle.","replies":[{"poster":"McSlap","date":"2016-01-31T07:14:41.062+0000","up_votes":12,"down_votes":18,"body":"> [{quoted}](name=Yousosmart,realm=NA,application-id=Ag8jgd8Q,discussion-id=zJ4kqlHZ,comment-id=0002,timestamp=2016-01-31T06:00:16.097+0000)\n>\n> Is there ANY accommodation going forward for people who only want to play one role (i.e. \"I can't play anything but top!\")?\n> \n> Or is it now \"Only play one role? Sorry, play another game.\"\n\nIf you can only play one role you are terrible at the game. Seriously they only require knowing 2 roles it's not that hard,","replies":[{"poster":"mk DILLY","date":"2016-01-31T07:52:39.027+0000","up_votes":13,"down_votes":16,"body":"It's not just about only being able to play one role. It's about this being a game, and I should be able to only play one role if there's only one role I really enjoy. What kind of fake pushes you into playing in some way you don't want to half the time?","replies":[{"poster":"DrCyanide","date":"2016-01-31T09:10:34.247+0000","up_votes":28,"down_votes":5,"body":"Have we been playing the same game? Are you talking about League of Legends?\n\nYou're ***always*** forced to do something you don't like in this game at one point or another. A meta shift makes your champion pool fall out of favor, you need to change your play style because you're behind, you stick out a 4v5, your team doesn't surrender when you want to, etc. \n\nIf you're looking for a game where you get to pick every little detail and have everything go your way, League of Legends is not the game for you. \n\nNow, if you're looking for a game where you have opportunities to succeed without having everything go as planned, stick around. There's a lot of fun to be had with a bit of uncertainty in the mix.","replies":[]}]}]},{"poster":"Faceplow","date":"2016-01-31T07:09:50.999+0000","up_votes":14,"down_votes":5,"body":"I wish they'd just put us \"one role\" people in a pool queue and if it takes 20 minutes to get a game to guarantee the role I want. I'm more than willing to wait.","replies":[]},{"poster":"Drackolus","date":"2016-01-31T06:16:46.564+0000","up_votes":8,"down_votes":2,"body":"> [{quoted}](name=Yousosmart,realm=NA,application-id=Ag8jgd8Q,discussion-id=zJ4kqlHZ,comment-id=0002,timestamp=2016-01-31T06:00:16.097+0000)\n>\n> Is there ANY accommodation going forward for people who only want to play one role (i.e. \"I can't play anything but top!\")?\n> \n> Or is it now \"Only play one role? Sorry, play another game.\"","replies":[]},{"poster":"24321201","date":"2016-01-31T08:53:13.323+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Yousosmart,realm=NA,application-id=Ag8jgd8Q,discussion-id=zJ4kqlHZ,comment-id=0002,timestamp=2016-01-31T06:00:16.097+0000)\n>\n> Is there ANY accommodation going forward for people who only want to play one role (i.e. \"I can't play anything but top!\")?\n> \n> Or is it now \"Only play one role? Sorry, play another game.\"\n\nTheres a new Soloqueue mode where you play alone, and maybe pick one role. Not sure about the second part though.","replies":[{"poster":"Photos of Ghosts","date":"2016-01-31T10:13:51.116+0000","up_votes":3,"down_votes":0,"body":"It's exactly the same thing, you just play alone.","replies":[]}]}]},{"poster":"Billdo","date":"2016-01-31T06:48:29.280+0000","up_votes":19,"down_votes":0,"body":"Here is my biggest issue, I am a filler, BUT TOP LANE....\n\nPLZ PLZ PLZ let me do this.  just not a fill....\n\nThank you\n\n\nEdit:\n\nWhat i mean is add after \"fill\"  add an exception if you wish\" type thing,....","replies":[]},{"poster":"Reputation","date":"2016-01-31T11:39:27.036+0000","up_votes":16,"down_votes":1,"body":"I think you should be able to queue up with your botlane partner together in dynamic queue.\n\nIf I pick ad carry as primary role and my friend picks support primary I think there should be a big chance that we're getting it. But most of the times I get my secondary role and my friends stuck with a random player. \n\nIn teambuilder you could queue up for any role you want, without selecting something you don't feel like playing.\n\nI should be able to pick botlane/support as my primary/secondary and my friend should be able to pick support/botlane as their role and we should be able to queue up for it. But it says we need   o cover more roles. Which seems a  bit odd. I would like to see this fixed because this sucks. \n\nMaybe even a blind pick teambuilder version because sometimes the champ select is longer than the game it self. while in teambuilder you queued up for your role and your g2g \n\nThis dynamic queue thing is good for ranked. But I feel like it's ruing the game experience for  people who like to play normals. \n\nThis is a good ranked system, but this just is not replacing teambuiler, in my eyes this is not even close to teambuilder. \n\n\nOhYEA this might be a neat feature. If you're  with a 5 man team and everyone selects fill, the system give out the roles In order. I would like to see that being random. So that your group goes into queue and find out what role they play rather than the host gets top, the one that joined after jungle ect.\n\nI'm very interested in what you think.","replies":[]},{"poster":"Niyumi","date":"2016-01-31T08:22:19.591+0000","up_votes":14,"down_votes":0,"body":"Hey, one feature I don't see mentioned up there is setting a default skin. In the old lobby system, whatever skin you loaded into a game with was automatically selected for you in the next lobby. It's not a big deal, but would you be able to bring that back? Sometimes I forget to pick my skin, and I have to look ugly for a game. xD","replies":[]},{"poster":"YourSh4dow","date":"2016-01-31T12:15:05.097+0000","up_votes":10,"down_votes":0,"body":"Make the Primary role matter more... After 10 or more minutes of waiting (my record is 30 minutes beforee getting into game because of some1 didnt accept , did dodge,didnt lock in pick and ban....) I want to go jungle I expect to get jungle. Not support or something else after waiting so long.","replies":[]},{"poster":"Bukakkayee","date":"2016-01-31T06:39:06.052+0000","up_votes":12,"down_votes":4,"body":"Would you guys consider doing a teambuilder thing again? i really liked that where i could pick what champ i wanted to play before hand, and if i didnt want to play with a certain team comp i could just join another group, now if i see a teemo jungle i have to wait 5 more minutes cause i dodged a que","replies":[{"poster":"GoniGooGoo","date":"2016-01-31T06:42:11.749+0000","up_votes":10,"down_votes":4,"body":"Great question.  If you have truly paid attention to feedback on boards and over internet it would seem you have a lot of people that prefer teambuilder queue to the existing one.  Will teambuilder be brought back?  If not, why the heck not?  ","replies":[]}]},{"poster":"Swizzle","date":"2016-01-31T05:58:10.795+0000","up_votes":11,"down_votes":4,"body":"> Adding ability to pull up the champion grid at any time\n\nRight from the Stonewall video! :D Good job Riot :D","replies":[{"poster":"Taunty","date":"2016-01-31T12:18:41.240+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Swizzle,realm=NA,application-id=Ag8jgd8Q,discussion-id=zJ4kqlHZ,comment-id=0000,timestamp=2016-01-31T05:58:10.795+0000)\n>\n> Right from the Stonewall video! :D Good job Riot :D\n\nright from anyone of the 80 million players, who hated not to be able to see their champs","replies":[]},{"poster":"Beloved by Calus","date":"2016-01-31T11:55:28.360+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Swizzle,realm=NA,application-id=Ag8jgd8Q,discussion-id=zJ4kqlHZ,comment-id=0000,timestamp=2016-01-31T05:58:10.795+0000)\n>\n> Right from the Stonewall video! :D Good job Riot :D\n\nYou kinda make it seem like he was the only one with that complaint","replies":[]}]},{"poster":"FatTaco","date":"2016-01-31T11:48:27.220+0000","up_votes":7,"down_votes":0,"body":"If you pick Support as your secondary you will 95% of the time get Support, can we fix this? in any way? like I don't mind support but I'd like to get my main role (Jungle) at least a few times? There's like no point picking Support as your secondary unless you really want it.","replies":[]},{"poster":"lightdragoon88","date":"2016-01-31T06:08:34.665+0000","up_votes":9,"down_votes":3,"body":"{{champion:202}} Now about this ordeal of me being ban-able, but not pick-able.","replies":[{"poster":"Oleandervine","date":"2016-01-31T06:34:06.966+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=lightdragoon88,realm=NA,application-id=Ag8jgd8Q,discussion-id=zJ4kqlHZ,comment-id=0003,timestamp=2016-01-31T06:08:34.665+0000)\n>\n> {{champion:202}} Now about this ordeal of me being ban-able, but not pick-able.\n\nEvery time I've played, Jhin has been grayed out in the ban screen and is unelectable.","replies":[]}]},{"poster":"Place Ad Here","date":"2016-02-01T00:34:20.871+0000","up_votes":5,"down_votes":0,"body":"Here is some data for my last 79 games queued as Jung/Fill:\n> \n> Top\t\n> 13\t(16%)\n> Jung\t\n>14\t(18%)\n> Mid\n>\t15\t(19%)\n> Bot\n>\t5\t(6%)\n> Sup\n>\t32\t(41%)\n> Total\n>\t79\t(100%)\n> \n\nThis only includes games that actually started.  This would be a lot better if I queued as Support/Fill.  It makes no sense how my primary role is only my third most frequently played lane.","replies":[]},{"poster":"C3LM3R","date":"2016-01-31T13:14:47.662+0000","up_votes":5,"down_votes":0,"body":"Is there any way to add a distinct sound clue that it's 'your' turn during ban phase? I've noticed that for everything else in queuing up, you guys have great audio indicators that its time to accept a game, pick your champ, and game has started, but I've noticed that when its time to choose your champ to ban, there is no distinct sound indicator until it gets the ominous 10s left countdown. So, sometimes when I minimize the LoL window to look up something else real quick, I take longer than I mean to and suddenly realize I've only got a few seconds left to ban something out.\n\nIt would really help those of us that multi-task, but have bad memories.","replies":[]},{"poster":"Hëärt","date":"2016-01-31T09:36:05.466+0000","up_votes":5,"down_votes":0,"body":"Hi, just curious on where you guys are with the Solo Ladder and if it will run on the same new champ select or the old one!","replies":[]},{"poster":"Oshosi","date":"2016-01-31T07:28:23.924+0000","up_votes":5,"down_votes":0,"body":"Can you make more emphasis on primary role please","replies":[]},{"poster":"CrystallinEagle","date":"2016-02-01T10:45:29.670+0000","up_votes":6,"down_votes":1,"body":"**Dear Riot Developers,**\n\n1st of all thank you for putting so much effort into the development of the game! That shows the community how passioned you are about your work and how many borders you have to break through when you want to change something for the sake of the game and its players!\n\nI have only 2 points which I wanted to make a note of and I didn't find here as problems listed.\n\n**1. the 1st one is a volume toggle for the champ select background music: **\nI've talked to many of my friends concerning this problem and every single one of them agreed after our exchange of views. They all wished for a volume control, so if the music is too loud and disturbs talking via skype or other 3rd party communication programs, you could simply turn the volume down in the client once and for all. Cause right now I for example workaround it through lowering the general volume of the client via the soundmixer in the right corner (OS: Windows 7). But that means also, that the volume of every other sound of the client is minimized and it is just a workaround so not comfortable at all.  Please consider to build in a volume control in the new champ selection in general! I guess many players already had the same issue with the old system, just like me and my friends did, cause we wanted that to be build in in the new champ selection as an improvement. \n\n**2. A function in the system, that remembers the roles, that have been chosen before the game starts**\n I noticed after playing several games, alone or with friends, that we had to rechoose our role picks after every finished game. But our role wishes didn't change throughout the game sessions, so all of us still locked in the same positions over and over again. And thats where I and my friends wished for a function, where the pre- lobby of the new champion selection would simply remember/keep the roles, that have been chosen from the player in the pre-lobby, locked in for the next game. Then nobody would have to rechoose their unchanged positions over and over again, game after game.\nSo if the role wish didn't change after the finished game, the roomleader could simply press \"play again\" and the team would be in the queue again. That would be very comfortable and maybe you simply overlooked the opportunity of building in a remembering function for the system concerning the roles, that have been picked for the last game. Pls think about building in something like that, so the players have the feeling of a smooth working system around them, which provides everything they need in a fast and comfortable way.\n\nI hope you will concern my suggestions! Ty for reading my comment <3 {{summoner:1}}","replies":[]},{"poster":"YoshixZeFabulous","date":"2016-02-01T11:37:28.921+0000","up_votes":4,"down_votes":0,"body":"Can we please bring back the ability to hover a champion's profile and see their abilities? I know for most people this isn't as important, but for people who haven't played in a long time or are still learning the game, it's nice to be able to get some idea of what you're up against.","replies":[]},{"poster":"Shíny","date":"2016-01-31T06:49:13.387+0000","up_votes":4,"down_votes":0,"body":"I've heard there was the possibility for a filter that sorts champs by how recently you've played them, Is that something that the team is still looking into?\nI'm mainly interested in having some more personalized filters to use in champ select, perhaps something that I can even customize, like how there are custom item sets.","replies":[]}]}