{"poster":"Icebergslasher","date":"2020-01-24T09:48:10.799+0000","title":"dinge die keinen sinn ergeben","subforum":"Champions & Gameplay","up_votes":3,"down_votes":12,"body":"einige champion sachen die komplett dumm sind:\r\n\r\ngalio ult. kein impact of allies, wieso noch champion zentriert? macht sie wie alte panth ult. free to click\r\npoppy passiv extrem schlecht. buckler sollte nach jedem treffer den schild gewähren. die cd von mir aus etwas nach oben. wäre definitv nicht op\r\ndiana immer noch kein nerf? LOL\r\nveigar scaled so sehr, reworkt die ult so wie bei fiora und ww. er braucht definitiv keine point click instakill.\r\nlissandra q range sollte etwas länger sein. sie ist zu fragil um so ne kurze range auf dem mainspell zu haben.\r\nziggs e ist iwie auch sinnlos. entweder komplett anderer spell oder so was auf die art wie, \"wenn ein gegner auf 3 minen steigt, wird er für 0,5 s gestunned\" ziggs fehlt es leider an allem.\r\nsejuani  e ist die schlechteste ability im gesamten game. eine miesere version vom braum q mit 1 sec stun und 8 sec frostschutz? sinnlos. \r\n\r\ndas sind so einige sachen die mir jetz so auf/eingefallen sind. wie sind die meinungen dazu? bzw fällt euch noch was ein, was keinen sinn oder so \"wtf?\" ist.","replies":[{"poster":"CG Mörglife","date":"2020-01-24T10:15:22.717+0000","up_votes":2,"down_votes":0,"body":"Ach du heilige...\n\n> galio ult. kein impact of allies,\n\nDen Part hab ich komplett gar nicht verstanden. Was meinst du mit alte panth ult? Das ist doch genau das selbe, bloß dass die auch noch nen Knockup hat. Und sogesehen hat sie ja einen impact auf allies, weil du alle Gegner in dem Radius hard cc'st und mit deinem Taunt ne CC-Chain hast. Heißt deine Teammates werden dadurch gesaved.\n\n> buckler sollte nach jedem treffer den schild gewähren.\n\nIch hoffe doch, dass \n\n> wäre definitv nicht op\n\nIronie war.\n\n> diana immer noch kein nerf?\n\nDiana ist stark, aber nicht so stark dass sie jetzt unbedingt wieder in Grund und Boden generft werden muss.\n\n> reworkt die ult so wie bei fiora und ww.\n\nWas hat die Fiora ult mit ww ult zu tun?\nDas eine ist ein Skillshot und bei dem anderen muss fiora von jeder Seite angreifen, damit der heal poppt.\n\n> lissandra q range sollte etwas länger sein.\n\nLissandra ist vollkommen fine. Warum Ihre q range erhöhen? Damit sie noch defensiver spielen kann als sie sowieso schon ist? Ich bitte dich.\nSie hat schon ekelhafte slows, ekelhafte stuns und einen guten escape.\n\n> ziggs e ist iwie auch sinnlos.\n\nZiggs bekommt schon buffs und die e macht durchaus sinn.\nZiggs abilities an sich sind relativ leicht zu dodgen. Der slow aus der e macht das einfach ein bisschen einfacher und du kannst damit gleichzeitig zonen.\n\n> \"wenn ein gegner auf 3 minen steigt, wird er für 0,5 s gestunned\"\n\nDas wäre ungefähr genau so wenig op wie Poppy, die durch jeden Treffer einen Schild bekommt.\n\n> sejuani e ist die schlechteste ability im gesamten game.\n\nSejuani an sich ist aber vollkommen fine. Da kann eine Ability auch mal nicht ultra strong sein wie bei anderen Champions.\nGutes gank potential, tanky af. AOE Stun/slow. Was willst du mehr?","replies":[{"poster":"Megamaexx","date":"2020-01-24T10:38:10.071+0000","up_votes":2,"down_votes":0,"body":"> Den Part hab ich komplett gar nicht verstanden. Was meinst du mit alte panth ult?\n\nMit der Galio Ult muss man einen Verbündeten als Ziel wählen. Seitdem er keine Resistenzen mehr gewährt, hat er keinen direkten Einfluss auf Verbündete. Den Knockup würde er ja behalten, nur würde eben das Zielen so erfolgen, wie bei der alten Panth Ult. So hab ich den TE zumindest verstanden und stimme bei dem Punkt auch zu. Warum einen Verbündeten als Ziel wählen, wenn der Effekt als AOE Zielfläche identisch wäre? \n\nBei den anderen Punkten stimme ich deiner Kritik an den Punkten zu, habe aber noch eine Anmerkung dazu.\n\n> Sejuani an sich ist aber vollkommen fine. Da kann eine Ability auch mal nicht ultra strong sein wie bei anderen Champions.\n\nDie E ist ziemlich geil für Jungleclear, da sie darauf keinen extra Cooldown nach dem Stun bekommt (außer ich habe die Änderung verpasst, könnte auch sein x3 ), sie kann also mit geringem Cooldown farmen.","replies":[{"poster":"CG Mörglife","date":"2020-01-24T11:15:31.875+0000","up_votes":1,"down_votes":0,"body":"Achsoo okay das mit Galio wusste ich ehrlich gesagt nicht.\nHab weder den alten, noch den neuen Galio jemals gespielt.\nJa okay, dann kann ich den Punkt auch verstehen.\nAber Lore-wise passt das besser zu Galio da er ja eher der Beschützer ist.. Naja was solls :P.","replies":[{"poster":"Megamaexx","date":"2020-01-24T12:37:10.421+0000","up_votes":2,"down_votes":0,"body":"Der ursprüngliche Gedanke bei Galio war ja auch, dass er den schützt, auf den er springt, indem er ihm auch Resistenzen gibt. Da ist das schon sinnvoll, ein Ziel zu wählen. War aber mal wieder zu stark für die Pros und zu schwach für die Noobs, wurde also entfernt^^","replies":[{"poster":"Icebergslasher","date":"2020-01-24T13:49:04.177+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=Wj1wcocU,discussion-id=yE33ktlE,comment-id=0000000100000000,timestamp=2020-01-24T12:37:10.421+0000)\n>\n> Der ursprüngliche Gedanke bei Galio war ja auch, dass er den schützt, auf den er springt, indem er ihm auch Resistenzen gibt. Da ist das schon sinnvoll, ein Ziel zu wählen. War aber mal wieder zu stark für die Pros und zu schwach für die Noobs, wurde also entfernt^^\n\nja wenn er zb keinen/ sehr wenig schaden mit ult macht, aber dafür die resistenzen hätte, das ergäbe so viel mehr sinn. aber so find ichs einfach dumm. und ja das zielen der ult war gemeint ;)","replies":[]}]}]}]},{"poster":"Icebergslasher","date":"2020-01-24T13:24:06.283+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CG Mörglife,realm=EUW,application-id=Wj1wcocU,discussion-id=yE33ktlE,comment-id=0000,timestamp=2020-01-24T10:15:22.717+0000)\n>\n> Ach du heilige...\n> \n> Den Part hab ich komplett gar nicht verstanden. Was meinst du mit alte panth ult? Das ist doch genau das selbe, bloß dass die auch noch nen Knockup hat. Und sogesehen hat sie ja einen impact auf allies, weil du alle Gegner in dem Radius hard cc'st und mit deinem Taunt ne CC-Chain hast. Heißt deine Teammates werden dadurch gesaved.\n> \n> Ich hoffe doch, dass \n> \n> Ironie war.\n> \n> Diana ist stark, aber nicht so stark dass sie jetzt unbedingt wieder in Grund und Boden generft werden muss.\n> \n> Was hat die Fiora ult mit ww ult zu tun?\n> Das eine ist ein Skillshot und bei dem anderen muss fiora von jeder Seite angreifen, damit der heal poppt.\n> \n> Lissandra ist vollkommen fine. Warum Ihre q range erhöhen? Damit sie noch defensiver spielen kann als sie sowieso schon ist? Ich bitte dich.\n> Sie hat schon ekelhafte slows, ekelhafte stuns und einen guten escape.\n> \n> Ziggs bekommt schon buffs und die e macht durchaus sinn.\n> Ziggs abilities an sich sind relativ leicht zu dodgen. Der slow aus der e macht das einfach ein bisschen einfacher und du kannst damit gleichzeitig zonen.\n> \n> Das wäre ungefähr genau so wenig op wie Poppy, die durch jeden Treffer einen Schild bekommt.\n> \n> Sejuani an sich ist aber vollkommen fine. Da kann eine Ability auch mal nicht ultra strong sein wie bei anderen Champions.\n> Gutes gank potential, tanky af. AOE Stun/slow. Was willst du mehr?\n\n\nja aber bei galio musst du auf nen ally clicken sonst kannst nicht ulten. der einschlag und so passt ja, aber wenn man immer auf nen ally angewiesen ist das ist nervig. alte panth konntest ja so spielen wie gp ult nur halt im radius.\n\ndie ults meine ich wie der untere kommentar sagt. die waren früher point click. und auch die kamen weg, und sie haben jetz skill\"shots\" nenn ichs mal. \nwarum sieht man dann keine liss in games?\nsie muss nicht ultra strong sein, aber diese ability is scheiße. wenn das wenigstens auch ranged champs triggern würden ok. aber so? blödsinn.\npoppy passive nur alle 20 sec oder wie der cd auch immer ist. ist e ziemlich lang.","replies":[{"poster":"CG Mörglife","date":"2020-01-27T09:13:14.651+0000","up_votes":1,"down_votes":0,"body":"Ja das mit Galio wusste ich bis vorhin auch nicht.\n\nEs gibt einige Point &amp; Clicks die ich gerne aus dem Spiel hätte wie Fiddlesticks fear und Silence z.B. Oder Nocturne der halt genau einen \"Skillshot\" hat und einen fear der gefühlt zwei Jahre geht und sogar während Zhonyas ausgelöst wird.\n\nLissandra ist halt einfach kein beliebter Pick.\nIch sehe auch so gut wie keinen Rumble, extrem stark ist er trotzdem.\nIch find Lissandra einfach ekelhaft zu spielen, grade als melee.\n\nPoppy ist aber halt auch ohne passive sehr stark, außer du spielst gegen ranged. Aber so gut wie jedes ranged matchup ist für toplaner ekelhaft.","replies":[{"poster":"Sirrkas","date":"2020-01-27T16:41:45.382+0000","up_votes":1,"down_votes":0,"body":"> Fiddlesticks fear und Silence\n\nIst da nicht auch ein Rework angedacht?","replies":[{"poster":"CG Mörglife","date":"2020-01-27T16:59:05.431+0000","up_votes":1,"down_votes":0,"body":"Uhh weiß gar nicht ob das ein kompletter rework wird, oder nur das Aussehen an sich.\nAber das Aussehen wird auf jeden Fall geändert, das weiß ich.","replies":[]}]}]}]},{"poster":"Westcoast38","date":"2020-01-24T10:32:47.415+0000","up_votes":1,"down_votes":0,"body":"Mit der Ww und Fiora Ult meint er warscheinlich die ganz alten Ulties. WW seine war die selbe nur das sie PointandClick war und Fiora hatte eine stärkere Master Yi Q Ult die Aoe war.","replies":[{"poster":"CG Mörglife","date":"2020-01-24T11:17:25.708+0000","up_votes":1,"down_votes":0,"body":"Ja ich weiß schon wie die Ults vorher waren aber\n\n> veigar scaled so sehr, reworkt die ult so wie bei fiora und ww. er braucht definitiv keine point click instakill.\n\nder TE will ja eben keinen Point &amp; Click mehr, sondern reworked. Eben wie bei WW, was nun ein Skillshot ist und Fiora.\nAber es macht halt Irgendwie wenig sinn.","replies":[]}]}]},{"poster":"Ráyleigh","date":"2020-01-24T10:42:51.849+0000","up_votes":2,"down_votes":0,"body":"Alles klar troll^^","replies":[]},{"poster":"HPJebaitedjet","date":"2020-01-30T23:32:49.843+0000","up_votes":1,"down_votes":0,"body":"kannst doch froh sein, dass du keine Plat against Iron Spiele hast","replies":[]},{"poster":"Jànna is Love","date":"2020-01-27T12:46:51.744+0000","up_votes":1,"down_votes":0,"body":"Diese Änderungen die du genannt hast sind viel zu broken. Die champs sind mit den Fahigkeiten die sie jett haben gut ingame nicht broken aber auch nicht weak.Wenn man an einem champ nen paar zahlen ändert kann ihn das op machen aber du schlägst vor fähigkeiten zu ändern. Das macht fast jeden champ um einiges stärker wenn nicht sogar top tier.Entweder trollst du oder du weißt ned wie man champs ballanced","replies":[]}]}