{"poster":"Icebergslasher","date":"2020-03-03T18:26:15.653+0000","title":"LOL Forum","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"hab so n league video gesehen, wo sie sagten, dass die foren gelöscht werden innerhalb der nächsten 6 monate mit so nem client \"rework\" oder so.  und halt auch alle beiträge, stimmt das? \r\n\r\nabgesehen davon, dass es oft interessant ist hier durchzustörben, gab es oft schon probleme mit dem spiel, die man durch die foren lösen konnte und wo auch google die ersten seiten nur das anzeigten. wäre ja voll schade wenn das wegfällt.","replies":[{"poster":"G2 Slippi","date":"2020-03-04T06:17:45.997+0000","up_votes":1,"down_votes":0,"body":"Ja es ist leider wahr, aber wir arbeiten bereits an einem Nachfolger ;)\nWir würden uns sehr freuen, wenn du bei uns vorbeischaust :)\nhttps://lolboards.de/forum/","replies":[]},{"poster":"Icebergslasher","date":"2020-03-03T21:24:34.347+0000","up_votes":1,"down_votes":0,"body":"doof... \n\naber cool, dass die community da was macht.","replies":[]},{"poster":"Megamaexx","date":"2020-03-03T19:40:47.931+0000","up_votes":1,"down_votes":0,"body":"Leider nicht erst in 6 Monaten (s. Link von Alekra). Da es bald kein offizielles Forum mehr gibt, sind bereits Community-Foren entstanden, wie dieses hier https://lolboards.de/forum/","replies":[]},{"poster":"ShenraZ","date":"2020-03-03T19:39:03.354+0000","up_votes":1,"down_votes":0,"body":"Ja das Forum soll geschlossen werden aber es wurde bereits abhilfe geschaffen:\n\nhttp://league-forum.de\nhttp://league-forum.com\nhttp://league-forum.net\nhttp://league-board.de\nhttp://league-board.com\nhttp://league-board.net\n\nEs ist noch im Aufbau und es soll eine Anlaufstelle für jede Region sein da die Foren auch für eine jeweilige Region angepasst wurden als hätte jede Region ein eigenes Forum worin jeder Benutzer auch jederzeit in ein anderes Forum wechseln kann.","replies":[]},{"poster":"Alekra","date":"2020-03-03T18:27:16.297+0000","up_votes":1,"down_votes":0,"body":"Jap\n\nhttps://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/ZaknxxEt-abschied-von-den-foren","replies":[]}]}