{"poster":"Icebergslasher","date":"2020-02-16T18:27:10.091+0000","title":"wie kann das sein?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"wie geht das bitte, dass ich letzte season bis gold 2 kam \r\nund jetzt 5000 games hintereinander verliere und mit iron player in ein team geworfen werde (was wir dann natürlich wieder verloren haben)\r\n\r\nv.a. das letzte team war ich silber. 1 iron 3 bronze. gegen 4 silber und ein bronze. das ist doch vollkommener unfug.... auch für den iron. ich mein wenn der total zerlegt wird, kann das sicher nicht spaßig für ihn sein, anstatt gegen seines gliechen zu spielen und ne chance zu haben...","replies":[{"poster":"Icebergslasher","date":"2020-02-17T11:55:46.612+0000","up_votes":1,"down_votes":0,"body":"aber ich hab letzte season genau gleich gespielt. wie kann man da bitte über eine divison schlechter sein? und in den letzten 10 games waren eben afk. jetz grad wieder ein smurf der uns zerfickt hat. ich mein das ist der komplette wahnsinn. \n\nich kann nicht carrien. sonst würd ichs ja tun ;)  ja der iron war der eine. wie gesagt, heisst ja nicht dass er superscheisse war. aber es is halt einfach unfair wenn quasi ein reines silber team gegen ein reines bronze team spielen muss. und halt diese trillionen smurfs die einfach 1v5 carrien können und das spiel halt für nicht-smurfs komplett ruiniern.","replies":[]},{"poster":"Eroticat Nimar","date":"2020-02-17T00:42:01.772+0000","up_votes":1,"down_votes":0,"body":"Die durchschnitts Elo deiner Games war konstant bei Silver 4/Bronze 1.\nfür die letzten 20 spiele, was die gesammtheit deiner Rankeds für diese season wäre.\n\nSo rein oberflächlich (Matchups, Spells, Items etc.) würde ich sagen baust du echt viel grütze wenn du in der Support Rolle bist, kaufst keine Controllwards, nimmst gegen high-Dmg laner Ignite statt Exhaust mit. Wie gesagt, rein oberflächlich.\n\nWürde dir auch empfehlen mir diana zu spielen.\nScheint mit dem Champ wesentlich besser gelaufen zu sein letzte season.","replies":[]},{"poster":"Empaya","date":"2020-02-17T00:27:16.606+0000","up_votes":1,"down_votes":0,"body":"In Iron und Bronze bzw noch in Silber kann man einfach carrien. Wenn du konstant gut spielst, kommst du immer aus solchen Elos.\nBetonung liegt dabei auf \"konstant\". Wenn ich hier sehe, wie du in manchen Games der einzige mit über 10 Toden bist, während alle weniger als 6 ist das schon bedenklich.","replies":[]},{"poster":"Aymira","date":"2020-02-16T20:10:03.547+0000","up_votes":1,"down_votes":0,"body":"Ich hab mir deine letzten paar Spiele angeschaut. Ich habe einen Eisenspieler bei dir im Team gefunden. Dieser hat letzte Saison mit Silber abgeschlossen. Also würde ich mal vermuten das seine MMR einfach recht stabil gewesen ist und nicht ganz so weit gefallen ist, jedoch die Maske über der MMR Eisen besagt.\n\nAnsonsten sind die anderen kürzlich gespielten Spiele alle soweit ausgeglichen...","replies":[]}]}