{"poster":"Icebergslasher","date":"2020-01-26T16:45:09.845+0000","title":"ho-ly shite","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":10,"body":"was geht denn heute ab?\r\n\r\n2 games hintereinander DER hardcore flame. wenn das \"netteste\" noch ist \" ich hoffe du bekommst krebs und stirbst, das wäre für alle das beste\" dann weisste bescheid. \r\n\r\n#prayingforpermaban \r\n\r\nunglaublich{{sticker:sg-zephyr}}","replies":[{"poster":"CptPICHU","date":"2020-01-26T17:23:57.929+0000","up_votes":2,"down_votes":7,"body":"Hallo!\n\nBitte sowas dringend reporten. Und auch andere im Spiel dazu auffordern.\nDas geht überhaupt nicht klar und wenn es so krass ist, folgt der Bann auch schnell.\nDa das System die Chatlogs automatisch prüft, fliegt man nach einem Hagel von Beleidigungen sehr schnell aus dem Spiel.\n\nDanke, dass du hilfst, die LoL-Community sauber zu halten. :)\n\nMfG,\n-Pichu","replies":[{"poster":"Raystlin82","date":"2020-01-26T17:29:32.946+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=CptPICHU,realm=EUW,application-id=KYnfKGf0,discussion-id=RjzEvEgu,comment-id=0000,timestamp=2020-01-26T17:23:57.929+0000)\n>\n> Bitte sowas dringend reporten. Und auch andere im Spiel dazu auffordern.\n\nsag mal, schlaegst du ihm jetzt aller ernstes vor, report calling zu betreiben?","replies":[{"poster":"CptPICHU","date":"2020-01-26T17:31:43.755+0000","up_votes":1,"down_votes":13,"body":"Es geht hier um offensichtlich berechtigtes Reporten.\n\nBei leider 95% aller Fälle wo jemand \"report!!!11\" in den Chat brüllt ist das ja leider nicht so.\n\nIch meine jetzt eher, wenn jemand hart flemet. Und wenn man mit premates spielt, dass diese das auch machen.\n\nGrundsätzlich ist es eigentlich egal, wie viele reports jemand bekommt. Wenn es nicht berechtigt ist, passiert so oder so nichts. Wie sonst könnte ich seit 5 Jahren spielen, ohne einen einzigen Bann?","replies":[{"poster":"Raystlin82","date":"2020-01-26T17:35:40.536+0000","up_votes":6,"down_votes":1,"body":"das ist doch scheiss egal, ob es berechtigt ist oder nicht. ein report macht genau das gleiche wie 9. nicht mehr! nicht besser!! nicht effektiver!!!\n\nalso du wirst hier kein gutes licht auf die volunteers, muss ich mal ehrlich sagen.","replies":[{"poster":"CptPICHU","date":"2020-01-26T17:36:36.673+0000","up_votes":1,"down_votes":9,"body":"> [{quoted}](name=Raystlin82,realm=EUW,application-id=KYnfKGf0,discussion-id=RjzEvEgu,comment-id=0000000100000000,timestamp=2020-01-26T17:35:40.536+0000)\n>\n> das ist doch scheiss egal, ob es berechtigt ist oder nicht. ein report macht genau das gleiche wie 9.\n\nAha. Und wenn das so ist, wo ist dann das Problem? :p","replies":[{"poster":"Raystlin82","date":"2020-01-26T17:40:52.168+0000","up_votes":5,"down_votes":1,"body":"da kommen gleich ein paar andere forum nutzer und erklaeren dir, warum die reportaufrufe ein problem sind. da bin ich mir sicher. ich hab da jetzt keine lust dazu. mach ich dann spaeter, falls sich doch niemand traut.","replies":[{"poster":"Yuiwara","date":"2020-01-26T21:42:07.260+0000","up_votes":3,"down_votes":1,"body":"reportcalling bezieht sich aufs ingame, wo man andere auffordert spieler xyz zu melden --> fördert schlechte stimmung (ingame ist es ja egal wie viele reporten und sowas senkt nur die moral während des spiels) und ist genauso ein reportgrund, egal ob gerechtfertigter oder ungerechtfertigter reportcalling. Das hier im Forum aber jemanden vorzuschlagen, der so eine situation schildert, ist in keinsterweise schlimm. ","replies":[{"poster":"Faldern","date":"2020-01-26T22:04:27.631+0000","up_votes":6,"down_votes":0,"body":"Es geht nicht darum, dass hier im Forum geschrieben wurde die beleidigenden Spieler zu Reportern, sonder um diesen Teil: \"Und auch andere im Spiel dazu auffordern.\"\nZum Report aufzurufen ist tatsächlich ein Reportgrund (wenn auch bei weiten nicht so schlimm wie die Beleidigungen).\nWas ich aber noch weniger verstehe ist, dass man dann statt seinen Fehler einzugestehen (Fehler machen ist menschlich) kommt man dann mit Aussagen:\n\n> [{quoted}](name=CptPICHU,realm=EUW,application-id=KYnfKGf0,discussion-id=RjzEvEgu,comment-id=00000001000000000000,timestamp=2020-01-26T17:36:36.673+0000)\n>\n> Aha. Und wenn das so ist, wo ist dann das Problem? :p\n\nund dass viele Report ohne irgend welchen Grund sind oder irgend welche Experimente aus Brasilien, die damit überhaupt nix zu tun haben.","replies":[{"poster":"Yuiwara","date":"2020-01-27T00:12:20.831+0000","up_votes":1,"down_votes":0,"body":"ah stimmt, den satz hab ich scheinbar überlesen xD da hast recht, in game soll man keinen dazu auffordern, das wäre reportbar (wie oben erwähnt). und andere zu strafbaren handlungen anstiften genauso.","replies":[]}]}]},{"poster":"CptPICHU","date":"2020-01-26T18:18:11.467+0000","up_votes":1,"down_votes":7,"body":"Es gab ein Event auf dem Brasilien-League-Server.\nDas war das \"Yordle-Camp\" oder so ähnlich.\nEs ging darum, dass die Community in 2 Teams geteilt wurde. Jedes Team hatte einen Lebensbalken, welcher\nmit Banns oder Punishments der Spieler gesunken ist. Und das Event hatte das große Problem,\ndass Leute Grundlos oder wegen total übertriebenen Gründen mit reports bombardiert wurden.\nDie Folge waren viele Banns und ein schnelles Ende des Events.\n\nhttps://leagueoflegends.fandom.com/wiki/Yordle_Camp\nhttps://youtu.be/93JrzfND4JQ?t=193","replies":[]}]},{"poster":"DrakoDRK","date":"2020-01-26T23:13:06.294+0000","up_votes":8,"down_votes":0,"body":"Ich frage mich wie sowas wie du Volunteer sein kann sorry. Du Schlägst jemandem vor report calling in einem Spiel zu machen, was ganz klar GEGEN die REGELN von RIOT ist!\nEs spielt keine Rolle was in einem Spiel vorfällt, report calling ist und bleibt VERBOTEN. Da es genau so bestraft wird weil das ein negatives Verhalten darstellt.\n\nNach dem Game kann man den Spieler über den Launcher und in Härtefällen über den SUPPORT reporten. \n\nDu scheinst die eigenen Regeln von Riot wohl nicht zu kennen. \n\nMan kann nur schon alleine für ein Report Calling, reported und bestraft werden.\n\nSuper Volunteer der andere dazu anstiftet einen Report Calling zu machen. {{sticker:zombie-brand-facepalm}} .","replies":[]}]}]},{"poster":"Aymira","date":"2020-01-26T23:26:55.287+0000","up_votes":4,"down_votes":0,"body":"> Es geht hier um offensichtlich berechtigtes Reporten.\n\nDann sollte man die Meldung einfach selbst durchführen statt andere dazu aufzufordern. Egal wie berechtigt es ist. \n\n> Bei leider 95% aller Fälle wo jemand \"report!!!11\" in den Chat brüllt ist das ja leider nicht so.\n\nStimmt. Die meisten Leute wollen alles und jeden gemeldet haben. Das fördert die Stimmung im Spiel absolut nicht, denn Betroffene fühlen sich dadurch verletzt oder beleidigt.\n\n> Ich meine jetzt eher, wenn jemand hart flemet. Und wenn man mit premates spielt, dass diese das auch machen.\n\nKann man so machen aber man sollte das einfach aus dem Chat rauslassen und keine Aufrufe starten. Denn:\n\n> Grundsätzlich ist es eigentlich egal, wie viele reports jemand bekommt. Wenn es nicht berechtigt ist, passiert so oder so nichts. Wie sonst könnte ich seit 5 Jahren spielen, ohne einen einzigen Bann?\n\nRichtig, egal ob du 9x oder 1x gemeldet wirst. Wenn das System nichts findet, dann wirst du auch nicht bestraft.\n\nDas ABER hinter der ganzen Sache ist allerdings das auch eine einzige Meldung genau so viel wert ist wie neun Meldungen. \nDas System reagiert bereits auf eine Meldung und läuft über den Chatverlauf drüber.\n\nDas soll nicht offensiv klingen, aber hier zu schreiben, das man im Spiel andere Leute dazu auffordern soll Person XY zu melden ist einfach falsch. Ganz gleich wie berechtigt die Meldung eventuell ist. \n\nEs fällt schnell in die Kategorie negatives Verhalten, da man mit solchen Nachrichten offensichtlich die Spielstimmung nicht verbessert, sondern nur verschlimmert. \n\nOb das ganze zur Sperrung oder zur Bestrafung führt sei mal dahingestellt. Feines benehmen ist es dennoch nicht. :)","replies":[{"poster":"BìgM","date":"2020-01-29T12:14:57.202+0000","up_votes":1,"down_votes":0,"body":"Ich will das Thema jetzt nicht verharmlosen, weil ich grundsätzlich deine Meinung teile (kein Report-Calling), aber ich finde, wenn man bei solchen (leider immer häufiger auftretenden) Ausnahmen wie Rassismus, Morddrohungen, Erkrankungswünschen etc. **am Ende des Spiels(!)** den Gegner darüber informiert, diesen Spieler genau dafür zu reporten, dann kann das dem Spiel auch nicht mehr schaden. Eher im Gegenteil dafür sorgen, dass mehr solcher Spieler aus dem Verkehr gezogen werden und es zukünftig vielleicht ein bisschen gesittiter zugeht.","replies":[{"poster":"Aymira","date":"2020-01-29T21:25:29.914+0000","up_votes":1,"down_votes":0,"body":"Am Ende stimmt das, ja. Im Grunde kann die Stimmung im Spiel dann nicht mehr kippen, allerhöchstens bricht dann nur noch n Beleidigungskrieg im Nach dem Spiel Chat aus, was dann auch jedem egal sein kann, schließlich kann man einfach gehen wenns einem nicht gefällt.\n\nNur erfüllt das dann irgendeinen Zweck? Denn auch wenn man hinterher noch schreibt das man Spieler XY wegen Blabla meldet, bringen 2 Meldungen auf dem Spieler halt auch nicht mehr als deine eine.\n\nDas einzige was du davon hast ist, das du dem Idioten noch mitgeteilt hast, wieso du die Meldung aussprichst und ihn über sein Fehlverhalten informierst. \nOb er draus lernt, ihn das interessiert oder ob er dich dann direkt weiter beleidigt steht dann aber in den Sternen. :D","replies":[]},{"poster":"Sirrkas","date":"2020-01-29T16:53:42.420+0000","up_votes":1,"down_votes":0,"body":"Ich denke eher es wäre besser andere Spieler darüber zu informieren, was wie gemeldet werden sollte. Wobei das Reportsystem aber auch davon lebt, dass jeder so meldet, wie er es für richtig hält.\n Der Reportaufruf bringt für dieses Spiel nichts. Und wenn jemand \"kys\" und ähnliches von sich aus nicht meldet, wird ein \"report him for XY\" auch nichts ausmachen.","replies":[{"poster":"Zavolta","date":"2020-01-29T19:44:51.240+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=RjzEvEgu,comment-id=000000010000000100000000,timestamp=2020-01-29T16:53:42.420+0000)\n>\n> Ich denke eher es wäre besser andere Spieler darüber zu informieren, was wie gemeldet werden sollte. Wobei das Reportsystem aber auch davon lebt, dass jeder so meldet, wie er es für richtig hält.\n>  Der Reportaufruf bringt für dieses Spiel nichts. Und wenn jemand \"kys\" und ähnliches von sich aus nicht meldet, wird ein \"report him for XY\" auch nichts ausmachen.\n\nDa das automatisches System nicht den Kontext erkennt... führt ein \"report for kys\" auch gleich zum auto-ban, wenn man aus Rache ebenfalls gemeldet wird ;)\n\nAber das schöne ist ja... wenn der Flamer im All-Chat schreibt und es jeder lesen kann... dann gibt es eine sehr hohe Chance, dass nicht nur 1er meldet :)\n\nhttps://www.bilder-upload.eu/bild-a3b568-1580326972.jpg.html\n\nAber soviel Glück hat man nicht immer...\n{{sticker:slayer-jinx-wink}}\n\n\n\nAbgesehen davon: ich schreibe immer erst in der Lobby nach dem Spiel, wen ich warum melde.\n\nPS: der Vielspieler macht seit 3 Tagen keine Spiele mehr... \n{{sticker:poppy-wink}} ","replies":[{"poster":"Sirrkas","date":"2020-01-29T20:43:57.186+0000","up_votes":1,"down_votes":0,"body":"Dann hat da wohl jemand einen Bann gekriegt.\n\nMan kann statt \"kys\" ja auch Hatespeech schreiben. Edit: Also bei dem \"Report XY\"","replies":[]}]}]}]}]}]}]},{"poster":"need elo police","date":"2020-01-26T18:45:53.961+0000","up_votes":4,"down_votes":0,"body":"Ist das eine Bestätigung, dass man andere wegen Reportaufruf nicht reporten kann? Ich verstehe nicht warum man andere dazu auffordern sollte diese Spieler zu reporten. Denn die im Team sehen was geschrieben wird, also warum aufrufen? Und im Allchat macht es keinen Sinn, weil das Gegnerteam den Chat nicht sehen kann. Und man nicht auf Verdacht jemanden reporten sollte.\n\nps: Mir und meiner Familie hat vor einer Woche jemand Aids an den Hals gewünscht und so weiter, der darf munter weiterspielen. Natürlich wurde er reported.","replies":[{"poster":"Zavolta","date":"2020-01-26T20:18:48.552+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=need elo police,realm=EUW,application-id=KYnfKGf0,discussion-id=RjzEvEgu,comment-id=00000002,timestamp=2020-01-26T18:45:53.961+0000)\n>\n> Ist das eine Bestätigung, dass man andere wegen Reportaufruf nicht reporten kann? Ich verstehe nicht warum man andere dazu auffordern sollte diese Spieler zu reporten. Denn die im Team sehen was geschrieben wird, also warum aufrufen? Und im Allchat macht es keinen Sinn, weil das Gegnerteam den Chat nicht sehen kann. Und man nicht auf Verdacht jemanden reporten sollte.\n> \n> ps: Mir und meiner Familie hat vor einer Woche jemand Aids an den Hals gewünscht und so weiter, der darf munter weiterspielen. Natürlich wurde er reported.\n\nDa gabs schon früher eine Klarstellung von RIOT, dass nicht jeder Aufruf zum Report \"bestraft\" wird.","replies":[{"poster":"Yuiwara","date":"2020-01-26T21:45:44.677+0000","up_votes":1,"down_votes":0,"body":"na dann kannst sicher den link dazu bereitstellen oder?","replies":[{"poster":"Zavolta","date":"2020-01-27T05:26:09.534+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Yuiwara,realm=EUW,application-id=KYnfKGf0,discussion-id=RjzEvEgu,comment-id=0000000200010000,timestamp=2020-01-26T21:45:44.677+0000)\n>\n> na dann kannst sicher den link dazu bereitstellen oder?\n\nWie oft denn noch?!\n\nAlso hier: offizieller RIOT-Beitrag:\n\n\"We don't ban people for asking for reports\"\n\nhttps://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/PzY1ArN3-we-dont-ban-people-for-asking-for-reports\n\nZwar schon etwas älter, aber gab seitdem anderslautende, offizielle Aussagen.","replies":[]}]}]},{"poster":"CptPICHU","date":"2020-01-26T18:56:23.610+0000","up_votes":1,"down_votes":5,"body":"Ihr müsst immernoch bedenken, dass wir auch nur Spieler sind, die Tipps geben.\n\nIch weiss LANGE nicht alles. Vorallem bin ich im Team seit nichtmal einer Woche dabei.\nUnd ganz so krass zerfressen muss man diesen Thread jetzt auch nicht.\nMan kann auch übertreiben...\n\nEs ist nicht verboten, die Community sauber halten zu wollen.\nMit SINNVOLLEN REPORTS.","replies":[{"poster":"need elo police","date":"2020-01-26T19:10:03.907+0000","up_votes":1,"down_votes":0,"body":"Alles gut. Ich weiß, dass ihr keine Riotler seid, aber in diesem Forum ist halt gut was los und da kann man schon mal verwirrt werden ^^","replies":[{"poster":"CptPICHU","date":"2020-01-26T19:29:11.662+0000","up_votes":1,"down_votes":1,"body":"^^","replies":[]}]}]}]},{"poster":"Maverick2","date":"2020-01-27T07:54:57.942+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CptPICHU,realm=EUW,application-id=KYnfKGf0,discussion-id=RjzEvEgu,comment-id=0000,timestamp=2020-01-26T17:23:57.929+0000)\n>\n> Hallo!\n> \n> Bitte sowas dringend reporten. Und auch andere im Spiel dazu auffordern.\n> Das geht überhaupt nicht klar und wenn es so krass ist, folgt der Bann auch schnell.\n> Da das System die Chatlogs automatisch prüft, fliegt man nach einem Hagel von Beleidigungen sehr schnell aus dem Spiel.\n> \n> Danke, dass du hilfst, die LoL-Community sauber zu halten. :)\n> \n> MfG,\n> -Pichu\n\nOMG! Ehrlich jetzt? Hat er das wirklich gesagt? Ein Volunteer...?\nEieieiei...","replies":[{"poster":"Haudruppmoor","date":"2020-01-27T09:41:20.809+0000","up_votes":1,"down_votes":0,"body":"https://tenor.com/view/robocop-were-only-human-forgiveness-robocop2-alex-murphy-gif-11138420","replies":[]}]},{"poster":"Shacoláde","date":"2020-01-27T10:25:07.153+0000","up_votes":1,"down_votes":0,"body":"> Und auch andere im Spiel dazu auffordern.\n\nOhje....solche Tipps bitte mir vorsicht genießen","replies":[]},{"poster":"Icebergslasher","date":"2020-01-26T17:26:07.248+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=CptPICHU,realm=EUW,application-id=KYnfKGf0,discussion-id=RjzEvEgu,comment-id=0000,timestamp=2020-01-26T17:23:57.929+0000)\n>\n> Hallo!\n> \n> Bitte sowas dringend reporten. Und auch andere im Spiel dazu auffordern.\n> Das geht überhaupt nicht klar und wenn es so krass ist, folgt der Bann auch schnell.\n> Da das System die Chatlogs automatisch prüft, fliegt man nach einem Hagel von Beleidigungen sehr schnell aus dem Spiel.\n> \n> Danke, dass du hilfst, die LoL-Community sauber zu halten. :)\n> \n> MfG,\n> -Pichu\n\nhab ich gemacht. ich hoffe, er bekommt ne strafe. {{sticker:sg-ahri-2}}","replies":[]}]},{"poster":"Julevi","date":"2020-01-26T23:26:31.223+0000","up_votes":4,"down_votes":0,"body":"Bin auch etwas von dieser offensichtlichen Wissenslücke vom Volunteer überrascht. Report-calling ist doch wirklich etwas, was oft genug diskutiert wird - eigentlich kein Ding, Sachen können ja einen einmal entfallen oder man hat diese Information nie gelesen, aber das Verhalten? Daneben. \nWenn man als ausgesuchter Volunteer mal einen Fehltritt macht klärt man das rasch auf, sollte sich vielleicht für die hilfreiche Informationen bedanken und sich beeilen sich mehr in solche Themen reinzulesen. Und nicht mit irgendeinem Event kommen, das einfach in die Kommentare geworfen wird ohne auch nur ein kleines bisschen den eigentlichen Gedankengang des Kommentarschreibers zu beschreiben (denn warum hast du genau dieses ausgesucht, was soll das jetzt genau beweisen/klären?). Und dieser Part? \n\n> Ich weiss LANGE nicht alles. Vorallem bin ich im Team seit nichtmal einer Woche dabei.\nUnd ganz so krass zerfressen muss man diesen Thread jetzt auch nicht.\nMan kann auch übertreiben...\n\nNach ein paar Rückmeldungen schon so eine Aussage? Da solltest du dir in dieser Position rasch ein dickeres Fell zulegen.","replies":[]},{"poster":"CptPICHU","date":"2020-01-27T13:43:52.115+0000","up_votes":6,"down_votes":2,"body":"Ich weiss nicht, ob das noch jemand liest, aber ich will mal noch was dazu sagen.\n\nIch bin kein Rioter. Ich bin seit nichtmal einer Woche im Team. Und ich bin nicht Wikipedia. ._.\nIch verstehe eure Kritik.\n\nIch habe mich nochmal genau Informiert.\nUnd ja - es ist völlig egal wie viele Reports es gibt.\nUnd ja - es nervt wenn Leute \"report!!!\" in den Chat hauen.\nUnd ja - das Brasilienevent war nicht wegen den Reportzahlen so chaotisch.\nMein Beitrag war doof formuliert und das sehe ich ein.\n\nEs tut mir also Leid, ich bin auch nur ein Pokém... ääähh Mensch.\nDer sich etwas zu sicher war, dass er Ahnung hat. ^^'\n\nWird nicht mehr vorkommen.\n\nLG\n-Pichu","replies":[{"poster":"Abasin","date":"2020-01-27T14:19:52.609+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"HairyAsianWife","date":"2020-01-28T23:56:51.375+0000","up_votes":1,"down_votes":1,"body":"League.","replies":[]},{"poster":"Icebergslasher","date":"2020-01-30T10:52:20.540+0000","up_votes":1,"down_votes":2,"body":"hab grad nachgeschaut.  der spieler wurde nicht mal permagebannt. interessant... also kanm ich das beim nächsten game auch schreiben und es passiert nichts haha","replies":[]}]}