{"poster":"Skinny White Kid","date":"2017-04-23T18:02:49.180+0000","title":"ISP disconnected internet in game 3 of promos, got 5 game queue penalty","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Today i was playing game 3 of my promos (1-1) and about halfway through the game my ISP disconnected my internet due to local maintenance. I DC'ed and when i tried to reconnect my league client downgraded (Heimer login) and wouldnt let me connect. 3 router resets later, i finally got to reconnect but my team had just surrendered. I was given a 5 game queue penalty AND i lost my promos. Is there anyway to get the queue ban lifted?","replies":[{"poster":"elduris","date":"2017-04-23T18:29:07.607+0000","up_votes":2,"down_votes":0,"body":"Unfortunately, no there isn't. Sucks when your internet goes out, as a Charter customer I am fully aware of that lol. There's not a good way for Riot to be able to tell whether you disconnected it yourself or if it was something out of your control, so that's why you still got those restrictions.\n\nI would just play out the 5 games. It's not too much of a restriction anyway.","replies":[]},{"poster":"Broporo","date":"2017-04-24T02:54:12.246+0000","up_votes":1,"down_votes":0,"body":"Elduris pretty much covered it here. We can't give much special treatment here since there's no way of proving how a disconnect happened. We do give some leeway though considering that you won't get a [**low priority queue**](https://support.riotgames.com/hc/en-us/articles/201752714-LeaverBuster-FAQ#h2) for just one left match. The system will only kick in if someone has a habit of leaving matches, which gives people a little wiggle room for things out of their control.","replies":[{"poster":"ICantPlayYasuo","date":"2017-05-09T01:45:09.815+0000","up_votes":1,"down_votes":0,"body":"Yeah, except the punishment for one game is FAR too excessive. we're talking 5 minutes for 5 games? my internet goes out one time and i'm punished excessively? I think one game is enough","replies":[]}]}]}