{"poster":"YaLe Neo","date":"2016-03-18T17:12:06.393+0000","title":"Mi respuesta al post \"Recuperando su confianza\", del debate de la oferta de 50% de descuento.","subforum":"Charlas Generales","embed":{"description":"Los escuchamos y sabemos que no est&aacute;n nada contentos con lo que ha sucedido con Fiesta de M&aacute;scaras. Queremos compartir el mensaje que creamos junto con Riot Central, el cual tambi&eacute;n ver&aacute;n compartido en Reddit por Wizardcrab Hola chicos, Nosotros, como Riot Games, nos hemos puesto en una posici&oacute;n bastante mala y quisi&eacute;ramos su ayuda para definir qu&eacute; hacer.","url":"http://boards.lan.leagueoflegends.com/es/c/anuncios/0HMOEpEi-recuperando-su-confianza","image":"http://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":4,"down_votes":5,"body":"Hola, Buen d&iacute;a a todos!\r\n\r\nPrimero que todo aviso que este post lo hago bajo opini&oacute;n propia bas&aacute;ndome en el sentido com&uacute;n que utilizo para resolver problemas. Me basare con ejemplo para que vean mas explicitamente el punto que explico.\r\n\r\nComo resumen de la pol&eacute;mica para aquellos que no est&eacute;n enterados, b&aacute;sicamente trata de que los jugadores de LAN reclamaron que no hab&iacute;an logrado llegar al regalo misterioso que ofrec&iacute;a el evento de festival de mascaras realizado unas semanas atr&aacute;s.\r\n\r\nAhora, como yo veo esta situaci&oacute;n es que no es correcto dar un premio de consolaci&oacute;n a aquellas personas que no pudieron cumplir con un objetivo debido a la condici&oacute;n que les toco.  \r\nComo para dar unos ejemplos (un poco tonto por asi decir):\r\n\r\nSupongamos que dos personas compiten a ver quien llega primero a un lugar caminando. Una tiene piernas mas largar y la otra mas cortas, por simple l&oacute;gica por distancia recorrida basando en los pasos que da, el de piernas largas llegar&iacute;a primero, pero si el que tiene piernas cortas aumentara su velocidad entre pasos, estoy seguro de que llegar&iacute;a a igual momento o incluso antes que el otro.\r\n\r\nEn cualquier lugar educativo sabemos todos que sino tenes los conocimientos necesarios r&eacute;probas el examen. Partiendo de la l&oacute;gica que implanta LAN, el profesor deber&iacute;a aprobar a un alumno un examen solamente por el hecho de intentarlo.\r\n\r\nPartiendo de la fabula de &quot;La tortuga y la liebre&quot; esta mas que entendido que cualquier que tenga condiciones inferiores pero se vale de su esfuerzo puede lograr mas que alguien que tiene el camino allanado. \r\n\r\nLo que quiero decir es que la excusa de &quot;estamos de vacaciones&quot; no es suficientemente valida para pedir una recompensa por no llegar a destino.\r\nSumando que es injusto para quien se esforz&oacute;, puso dedicaci&oacute;n y logro la consigna impuesta. Porque l&oacute;gicamente no podes darle al &quot;perdedor&quot; premio igual o similar que el del &quot;ganador&quot;.  _Aclaro que no se trata de ganador o perdedor, sino de quien llego mas lejos en su meta._\r\n\r\nRespecto a la situaci&oacute;n de &quot;Compramos RP por el evento, queremos reembolso&quot;, me parece una falta de visi&oacute;n o excusa para recibir lo que, para mi, no merecen por lo que aclare antes, es decir, no cumplir la meta impuesta. Porque digo que es falta de visi&oacute;n? Simplemente porque esos RPs no son un gasto mal hecho, como si no fueran a servir. Al contrario, aquel que sabe esperar sabr&iacute;a que esos RPs los podr&iacute;a usar en futuras promociones de 2x1, 50%  en cajas misteriosas, comprar un aspecto en descuento a gusto y no optar a la suerte, etc. No estrictamente valen para la promoci&oacute;n mal impuesta por RIOT.\r\n\r\nEn resumen:\r\n1) Riot deber&iacute;a poner a 50% aspectos misteriosos a LAN? No, fallaron en su meta, por condici&oacute;n desfavorable. Pero en la vida siempre uno tiene ventajas o desventajas.\r\n2) Es justo para LAS esa promoci&oacute;n? No, porque hace sentir un esfuerzo in&uacute;til a todo el servidor, ya que con quejas se logra lo mismo o similar al esfuerzo.\r\n3) Los reembolso es una soluci&oacute;n a la carga de RP? Quizas. Hay gente que necesita ese dinero para otra cosa (lo cual no me cierra ya que por algo lo utilizo en el juego), pero seria mas l&oacute;gico explicar que esos RPs pueden ser inversi&oacute;n a futuro.\r\n\r\nQuizas me he olvidado de alg&uacute;n punto o detallar mejor.\r\nEsta es mi opini&oacute;n al respecto, bas&aacute;ndome en la vida cotidiana. \r\nEstoy obviamente abierto a diferentes puntos de vistas e intercambio de ideas.\r\n\r\nSaludos a todos los invocadores.\r\n\r\nPD: Aquel que considere que es una buena raz&oacute;n que deber&iacute;a analizar RIOT, que le de &quot;like&quot; (no se como funciona en el foro, primer o segundo post que hago), a ver si alg&uacute;n miembro de RIOT GAMES lo lee. \r\nPD2: Sepan disculpar alg&uacute;n error que tenga o no respeta partes de las normas del foro.","replies":[{"poster":"Thalas","date":"2016-03-18T17:34:59.446+0000","up_votes":2,"down_votes":0,"body":"Creo que te estas desviando de la postura general que tomamos LAS como comunidad. Nosotros, o al menos la mayoría nunca tuvimos como objetivo que LAN quede sin la oferta propuesta por parte del equipo de Riot, si no que también dicha oferta sea aplicada con nosotros, ni más, ni menos..\nEstas confusiones y post son los que hacen un quiebre y/o rivalidad entre las regiones.","replies":[]},{"poster":"zukaritagamer11","date":"2016-03-18T17:46:59.332+0000","up_votes":1,"down_votes":0,"body":"me gusta, te daria like pero me los restringeron\nbump con un coment","replies":[]},{"poster":"potato support","date":"2016-03-18T17:19:38.879+0000","up_votes":1,"down_votes":0,"body":"la analogia de la carrera no es aplicable, no hay primer, segundo y tercer lugar. el de un examen si es aplicable,  si una persona se esfuerza para obtener un 10 es injusto para esa persona que al resto les regalen puntos extra para llegar al 10.\n\nno pueden reembolsar todo el rp por el hecho de que hay personas que pagaron en efectivo, el cual no hay manera de devolver.","replies":[]}]}