{"poster":"na3xX","date":"2016-03-29T18:31:56.919+0000","title":"League of Tanks (hat sich seit meiner Spielzeit vor 2 Jahren nicht viel verändert)","subforum":"Champions & Gameplay","embed":{"description":"Kostenlos Bilder hochladen. Bilder Upload ohne Anmeldung","url":"http://www.bilder-upload.eu/show.php?file=125acb-1459277179.jpg","image":null},"up_votes":2,"down_votes":0,"body":"Hey... Spiele seit ungef&auml;hr 1-2 Monaten wieder aktiver LoL. Wie ihr auf dem Screenshot sehen k&ouml;nnt frage ich mich auch nach der extrem langen kurve in wiefern es sinn macht, dass die Tanks in der lage sind nahezu bzw ab und zu mehr schaden rauszuhauen als die sogenannten dmg dealer? \r\nDer Screenshot ist &quot;nur&quot; ein Beispiel von unz&auml;hligen Spielen in denen mir IMMER wieder das selbe auff&auml;llt. Ob es ein FULL tank Garen, Shyvana, Nautilus, Mundo oder mein Lieblingsbeispiel Tiger udyr ist, welcher mal eben 3auto attacks auf nem mage macht und der dann tot ist (Fulltank build nat&uuml;rlich) \r\nWird sich da jemals was dran &auml;ndern? Kann man das eine gute Rollenverteilung nennen? Werden die dds &uuml;ber kurz oder lang aus der Solo que (nur die solo Que) verschwinden? \r\n\r\nEins ist klar. Sehr viele Spieler die weit oben dabei sind und tipss zum eigenen Elopush geben sagen immer h&auml;ufiger das man keinen ADC oder Support nehmen sollte. Diese Aussage kommt nicht von mir, aber dem habe ich schon vor meiner letzten sehr langen LoL pause festellen k&ouml;nnen. \r\n\r\nNat&uuml;rlich gibt es ausnahmen aber davon rede ich nicht!","replies":[{"poster":"JackTheStrípper","date":"2016-03-30T10:27:47.160+0000","up_votes":1,"down_votes":0,"body":"Natürlich sind Full Tanks die besten Champs. Ein Team, dass es mit 5 Fulltanks bis durchs Early Midgame schafft, gewinnt automatisch.","replies":[{"poster":"El Capitán TSV","date":"2016-03-31T16:01:17.648+0000","up_votes":1,"down_votes":0,"body":"Beste Beispiel: Aram. :D \n5 Tanks gegen 5 DDs. Erst kriegst du voll auf die Fresse. Aber sobald du 2-3 Items hast, gewinnst du easy peasy. :D","replies":[]}]}]}