{"poster":"InjectReefers","date":"2017-07-13T00:49:59.712+0000","title":"Is Kayn op?","subforum":"Gameplay","up_votes":4,"down_votes":2,"body":"Thoughts on Kayn?","replies":[{"poster":"freakyjef","date":"2017-07-13T19:51:10.400+0000","up_votes":2,"down_votes":0,"body":"Ive played him as a jungler and pre evolution he is pretty weak, but he is very versatile afterwards and scales extremely well into the game.","replies":[]},{"poster":"Liquid Psychosis","date":"2017-07-13T01:17:22.071+0000","up_votes":2,"down_votes":0,"body":"Honestly in my opinion he's pretty good","replies":[]},{"poster":"2B Father Servo","date":"2017-07-13T01:04:14.128+0000","up_votes":2,"down_votes":0,"body":"can't tell you every one is banning him I havent even got a game in with him today","replies":[]},{"poster":"DoktorKaiser","date":"2017-07-13T20:10:33.499+0000","up_votes":3,"down_votes":2,"body":"Broken as hell when fed, huge burst, huge mobility, walks through walls so cant predict where he comes from, EXTREME sustain, EXTREME untargetability.  So far the ones who didnt snowball felt crappy and didnt deal enough damage to 1 shot. His red form is far superior and is broken, his blue form feels crappy. He seems weak toplane because his early sucks, his first jungle clear is pathetic but his ganks are undodgable. \nAll in all I think he will be a problem in the future, for now he is not too problematic, imo he has far too many toxic mechanics especially longest untargetability in the game, wall walking and massive and I mean fucking massive like thousands of health heal. He is gamebreaking when he goes red form and goes 2 damage items into full tank, other forms or builds feel ok or lackluster.","replies":[{"poster":"420SWAG69","date":"2017-07-14T23:10:49.939+0000","up_votes":1,"down_votes":1,"body":"Very Trash champ, only good in lower elos when people have no idea that his 1-10 jg path is slow, and hes weaker than sej 1v1. 90% of jg can counter jg him, because not any mobility with e when inside of combat.","replies":[{"poster":"DoktorKaiser","date":"2017-07-15T00:02:47.794+0000","up_votes":1,"down_votes":0,"body":"Its pretty much like any late game champ, fuck him early but if he gets his items then get counter-fucked :D","replies":[]}]}]},{"poster":"The Pr0taku","date":"2017-07-14T01:00:02.083+0000","up_votes":2,"down_votes":1,"body":"really good at getting to fights, waaay too underwhelming when he gets there, slow spell cast animations. I REALLY hate to say this, hes not cheese enough.","replies":[]},{"poster":"RedRaider19","date":"2017-09-24T01:27:50.741+0000","up_votes":1,"down_votes":0,"body":"In my opinion, Kayn isn't op as of now, because he has two different forms people don't know how to play him, i tend to think of Rhaast as someone like nunu, and shadow assassin like Rengar, Rhaast is better in most situations but i have carried as both forms, most people will say he isn't broken and needs buffs because they just don't know how to play him. Really i don't know how broken or balanced he is because of how new he is.","replies":[{"poster":"NotNedward","date":"2018-11-13T01:23:00.168+0000","up_votes":1,"down_votes":0,"body":"Personally i find assasin better for his just quick kill potential and quicker ganks but from what ive played red its definetly a powerful choice. If you go red your gonna be in lane alot more late game but with blue youll still be in jungle and using the crap out of your E into W+Q combo","replies":[]}]},{"poster":"wagner04","date":"2018-10-02T18:29:00.729+0000","up_votes":1,"down_votes":0,"body":"Yes","replies":[]},{"poster":"Manticles","date":"2018-02-23T19:33:52.471+0000","up_votes":1,"down_votes":0,"body":"Well I've played as kayn for a while... And I would have to disagree with the majority as I think that blue is better if you want someone who can keep up and kill anyone in site. But I still play as red. (just saying I am quite new to kayn but I'm getting to know him a bit more now)\nPS. I really like him that he's actually my new main and I do recommend him to people. ","replies":[]},{"poster":"Mountain Warden","date":"2017-11-24T22:10:37.228+0000","up_votes":1,"down_votes":0,"body":"I only got back into playing a bit after a long break over the summer so I didn't play against him before they changed the rune system. He seems pretty absent early game, but he's brutal once he gets going. After 20 mins, he'll tear an entire team apart with massive damage and massive self heal. He's a smidge broken if you ask me.","replies":[]},{"poster":"Proxy345","date":"2017-11-21T21:03:41.097+0000","up_votes":1,"down_votes":0,"body":"Right now yes he is with the current runes lol","replies":[]},{"poster":"zualin","date":"2017-11-21T21:03:12.530+0000","up_votes":1,"down_votes":0,"body":"Do the math on rass %max hp dmg build lethality lets say 300ad build not hard to hit in mid to late game if your doing ok. Your Q-R-Q combo will do clos to 90% max hp dmg. That is not including the 50%ad scale that is also on the Q. or anydmg from aa or other items/abilities. buy re elixir hit 400AD and your doing 112% max hp dmg if that is not over powered i dont know what OP means. Oh and dont forget that hes also healing for % max hp as well","replies":[]},{"poster":"SwiftKitten88","date":"2017-09-24T01:49:11.807+0000","up_votes":1,"down_votes":0,"body":"... i am going to post a video.. and i'll let everyone decide for themselves\nwe all know how strong karn form is\n\nthis is assasin form\nhttps://youtu.be/f_7J0aPKlRI?t=389\n\ni choose to ban him...","replies":[]},{"poster":"ApexInTheCircle","date":"2017-09-24T01:38:04.206+0000","up_votes":1,"down_votes":0,"body":"IMO he's a feast or famine champ much like Katarina, or Yi. you either do really really well with them or you bomb and become an over glorified minion.","replies":[]},{"poster":"BDE Moonpíe","date":"2017-07-17T23:36:46.845+0000","up_votes":1,"down_votes":0,"body":"He is a decent champion in the jungle and his build path can be bent depending on how you wanna play him, I think the best way to play him is a combo of Armor and health early, then moving onto things like AD and Lifesteal. But in doing this it makes him a slow champion in the early game, but really powerful in the late game after the transformation","replies":[]},{"poster":"Recon1212","date":"2017-07-17T19:36:05.878+0000","up_votes":1,"down_votes":0,"body":"As the shadow assassin i find him very weak. For a champ that has 2 moves other than ult that does dmg his q should do more than his aas. The scaling is utter shit and his ult dmg is so underwhelming. I hope he gets buffed in some way in the assassin form anyway cause its extremely disappointing to play as.","replies":[]},{"poster":"Nestius23","date":"2017-07-17T17:16:50.973+0000","up_votes":1,"down_votes":0,"body":"He needs to be more balanced, his assassin form is lacking compared to darkin.","replies":[]},{"poster":"JediMindFlipper","date":"2017-07-16T21:33:34.531+0000","up_votes":1,"down_votes":0,"body":"Kayn feels so underwhelming right now, especially in blue form.","replies":[{"poster":"Dirty Bastard","date":"2017-07-17T12:48:15.799+0000","up_votes":1,"down_votes":0,"body":"I have to agree, I have played lots with him and only in a few games did he feel strong.  Then again, I am still learning him.  But, the Lee kick is strong than Kayn's ult.  \n\nTBH, was stoked for Kayn but my love for him has passed...","replies":[]}]},{"poster":"WoonStruck","date":"2017-07-15T22:18:45.575+0000","up_votes":1,"down_votes":0,"body":"Red, yes, blue, no.","replies":[]},{"poster":"Filoja","date":"2017-07-15T00:48:44.224+0000","up_votes":1,"down_votes":0,"body":"Playing jungle against a squishier starting jungle like Evelynn, Kayn can honestly run into their jungle and secure first blood without any issue, which I think is kiiiiiiind of op. At least in the sense that depending on his opponent he may be able to snowball super easily just by running through a wall.","replies":[]},{"poster":"Adonon","date":"2017-07-25T02:22:53.727+0000","up_votes":1,"down_votes":1,"body":"I've heard a lot of people complaining about Darkin's sustain. In my opinion, his sustain is no worse than Illaoi's, or Mundo's, or Darius'. There are items that apply Grievous Wounds, but only mages and ADCs use them for the most part. His Shadow Assassin form is a bit underwhelming compared to his Drakin form, but it's the most fun in my opinion.","replies":[]},{"poster":"yangus Beef","date":"2017-07-15T22:18:09.502+0000","up_votes":2,"down_votes":2,"body":"Possibly the worst champ I have seen at release 0 damage and no sustain. Even when ten kills ahead, he can't kill the anything with a single rotation. The best way to build him seems to be tank, likewise. Which is OK, since he has a lot of sticking potential. He can only be played in the jungle; I have yet to see him not _feed_ in any of the lanes. He is simply outclassed in terms of damage and sustainability by most other lane champions.","replies":[]},{"poster":"Calabok","date":"2017-07-14T01:27:48.333+0000","up_votes":2,"down_votes":2,"body":"nerf him","replies":[]},{"poster":"Swiff Swish","date":"2017-07-13T00:54:55.749+0000","up_votes":2,"down_votes":2,"body":"pretty crappy, can't 1v1 most Top laners especially.","replies":[]},{"poster":"undesirable team","date":"2017-07-13T00:51:02.817+0000","up_votes":3,"down_votes":4,"body":"hes weak","replies":[]}]}