{"poster":"Dream","date":"2014-11-18T22:34:31.962+0000","title":"Is this e-mail legit?","subforum":"Miscellaneous","up_votes":3,"down_votes":0,"body":"leagueoflegends@email.riotgames.com can a rioter confirm if this e-mail is actually riot?","replies":[{"poster":"ToxicHawk","date":"2014-11-18T23:20:18.463+0000","up_votes":2,"down_votes":0,"body":"Hey Dream,\n\nFirstly thanks for bringing this up. After a quick investigation (and from my general knowledge) I can't confirm 100% if that email is legit. Can you please forward it to me ToxicHawk@riotgames.com, I will be able to investigate further.\n\nNow onto your question. I don't believe your account was compromised but to be safe you could reset your password to something that is completely different from your current one.\nI suggest doing this on both your client and your email account. Just to ensure that no one can use the Forgot Password feature and reset your account password and email address.\n\nIf you have any further questions please let us know.\n\n-ToxicHawk","replies":[]},{"poster":"Sephyre3","date":"2014-11-18T22:48:15.023+0000","up_votes":1,"down_votes":0,"body":"The first thing to do is always be suspicious of weird emails! \n\nThe email address you listed is what appears when we occasionally send out information about upcoming events.\n\n**That said, people can make it appear that it comes from us when it isn't. **\n\nIf you're being asked for a password, username, personal information or to visit a site that isn't Leagueoflegends.com don't trust it!\n\nMy attitude to emails, regardless of what company it says, is suspicious until proven trustworthy. One of my old email addresses is spammed constantly by fake games company emails that are phishing for information.","replies":[{"poster":"Dream","date":"2014-11-18T22:55:04.829+0000","up_votes":1,"down_votes":0,"body":"Thanks for your reply, yes the e-mail is completely irrelevant and does not contain anything with regards to events hence why even after I saw it was a confirmed website I was suspicious because it says from riotgames instead of League of Legends the R is also not capitalized, hence why I thnought it was spoofed, I accidently clicke da link in the e-mail can you give me any recommendations on what I sh ould do to ensure my accounts are not hacked, I virus scanned yet it came up with nothing however I'm still suspicious\n\nEDIT: soz for bad english I'm in a game","replies":[{"poster":"Rok","date":"2014-11-18T23:16:37.053+0000","up_votes":2,"down_votes":0,"body":"> I accidently clicke da link in the e-mail\n\nIts all Ogre now.\nhttps://38.media.tumblr.com/41eeece7b5919af4815383966e9bcb2d/tumblr_ndhbsdxHyX1qzd410o1_400.gif","replies":[]}]}]},{"poster":"Jehovahs Witness","date":"2014-11-20T03:07:13.189+0000","up_votes":1,"down_votes":0,"body":"This is as annoying as the spammers that spam the 'Free RP Here!' links.","replies":[]},{"poster":"DianasGotSwag","date":"2014-11-19T00:13:59.343+0000","up_votes":1,"down_votes":0,"body":"There are tonnes of shifty stuff going on. I keep getting \"Your WoW account has been hacked click this link\" legit looking emails *and I don't even play WoW or have anything related to it hooked up to that email* -_-\n\nAt least Riot seem to care when this stuff happens though.","replies":[]}]}