{"poster":"Avatar Luxanna","date":"2016-06-04T11:09:24.109+0000","title":"[ab Platin 5] ADC für festes Team gesucht","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hallo ihr kleinen K&auml;seb&auml;llchen,\r\n\r\nwir haben uns dazu entschieden wiedermal ein Team auf die Beine zu stellen, welches nicht nur in der Dynamic-Queue spielen soll, sondern auch an vielen Cups bzw Ligen teilzunehmen wird. Hierzu suche ich als Supporterin einen f&auml;higen und sympathischen ADC!\r\n\r\n\r\nEure Mindestelo sollte in dieser Season mind. bei Platin 5 liegen und ihr solltet bevorzugt &uuml;ber 18 Jahre alt sein. Kritikf&auml;higkeit und der Wille sich stetig verbessern zu wollen, sollten gegeben sein, da auch wir diese F&auml;higkeiten mitbringen. Ziel ist es nicht SoloQ-Style zu spielen, sondern als Team zu funktionieren und strategisch hochwertige Entscheidungen zu treffen und auszuf&uuml;hren. \r\nWir werden feste Trainingszeiten haben, demnach solltet ihr auch damit einverstanden sein, an festen Tagen und Zeiten zu spielen.\r\nDu solltest Main-ADC sein und dein Championpool sollte sich nicht nur auf 1-2 Champs beschr&auml;nken. \r\n\r\nZu mir:\r\nIch bin Main-Supporterin seit S2\r\nMeine Main Champs sind Nami, Janna und Morgana. Ich spiele ebenfalls andere eher poke-lastige Champions wie Zyra und Karma. Ich bevorzuge es um meinen ADC zu spielen und w&auml;hle daher eher Utility-Supporter. Solltet ihr also nicht auf Alistar  in eurer Lane verzichten k&ouml;nnen, passen wir wahrscheinlich nicht zusammen.\r\n\r\n\r\nUm den Ablauf ein wenig zu skizzieren: Erst werden wir beide gemeinsam uns verst&auml;ndigen und kennen lernen. D.h. wir werden Normals spielen um zu schauen ob wir beide zueinander passen, sollte das der Fall sein, spielen wir gemeinsam im Team um zu schauen ob du ins das Gesamtbild passt. Auch hier werden wir uns erstmal auf Normals fokussieren, weil es uns mehr um das Gesamtpaket geht als um den Victory-Endscreen.\r\n\r\nWenn ihr Interesse habt, k&ouml;nnt ihr mich gerne adden. \r\nT&uuml;dels und liebe Gr&uuml;&szlig;e,\r\nAvatar Kuvira","replies":[{"poster":"LategameMonster","date":"2016-06-04T16:33:57.501+0000","up_votes":1,"down_votes":0,"body":"Hay Ho :D\nIch bin 16 Jahre alt und komme aus NRW ( Ich hoffe das Alter macht nicht all zu große Probleme\nIch versuche schon mega lange in ein Team hineinzukommen, das REGELMÄßIG trainiert, denen es wichtig ist Spaß zu haben und sich verbessern zu wollen..\nMein Championpool beschränkt sich zur Zeit auf Jinx Vayne Jhin Sivir (Cait){{champion:222}} {{champion:67}} {{champion:202}} {{champion:15}} ({{champion:51}} ) Meine Elo ist Platin 3 und ich bin seid einem Jahr ca. ADC Main :D\nIch würde mir wünschen euch kennen zu lernen und, dass wir viel voneinander lernen können :D\nWir sehen uns ;) \n\nLategamemonster\n \nBin jederzeit ansprechbar^^","replies":[]},{"poster":"Manwendi","date":"2016-06-04T14:28:03.233+0000","up_votes":1,"down_votes":0,"body":"IGN: Manwendi\nAlter: 18\nElo: momentan platin 4\nTS3: +\n \nHabe dich mal in game geaddet :) \n\nLG Manwendi","replies":[]}]}