{"poster":"Sorcio84","date":"2016-05-14T10:55:57.989+0000","title":"Aiuto. Rengar mi fa tiltare male , mi servono cure !","subforum":"Discussioni generali","up_votes":1,"down_votes":2,"body":"**IL** champ che odio di pi&ugrave; e che mi fa salire il flame.\r\nPrima di suicidarmi ingoiando il mouse mentre mi impicco col filo del pc, vi racconto la storia.\r\n\r\nInizio con {{champion:29}} , sono contro il gatto. Mi campera bot\r\nSono {{champion:19}} jng e mi salta addosso bloccandomi e shottandomi nella mia jungla prima del Lv6\r\nSono {{champion:96}} , stessa storia\r\nvado top con {{champion:17}} e me lo ritrovo contro e di nuovo campre **ME**\r\nce l&#039;ha sempre su con me ogni game.\r\n\r\nUn bel giorno sono {{champion:75}} top e ho poca vita a causa di un harass esagerato in early , da parte del toplaner nemico, giustamente per negarmi il farm.\r\nArriva io gatto con 6+ kill e salta **dal 3bush fino a sotto torre** esplodendomi easy.\r\n\r\nOgni champ che gioco me lo ritrovo dietro al collo che mi alita col fiato da merluzzo aspettando di avere le spell cariche\r\n___\r\nQuando &egrave; nella mia squadra cosa fa ?\r\nCorre dietro alle kill per tutto il game, pensa solo ad ingrassare e ingrassare fino a saltare rimbalzando come una palla di pelo e ciccia.\r\nIl drago se lo fa solo se i nemici sono tutti morti o in base e non pusha manco una lane. Sta fermo in un bush ad aspettare i nemici per altre kill\r\n___\r\nCome faccio a smettere di tiltare davanti a sta vasca di pelo che non si vede manco il collo da quanto pelo ha ?\r\nche poi la sua E in inglese ...\r\nE-bolas strike ...\r\n\r\nPs : non ditemi giocalo perch&egrave; non funziona.\r\nGia giocai una one for all con 10 rengar che dire unlucky rende l&#039;1% della mia sfiga.","replies":[{"poster":"x A N D R E","date":"2016-05-15T10:54:55.083+0000","up_votes":2,"down_votes":1,"body":"Se non lo batti con teemo sei nabbo","replies":[{"poster":"Sorcio84","date":"2016-05-15T16:16:15.973+0000","up_votes":1,"down_votes":0,"body":"Ouuu schifoso ! Tu non capisci.\nQuando divente invisibile la passiva di teemo è inutile perchè il gattaccio ottiene **visione vera** e ti vede da invisibile.\nAnche se piglia un fungo, con {{summoner:4}} e saltino , ti arriva in faccia e ti apre di skill, e il blind della Q te lo attacchi.","replies":[{"poster":"x A N D R E","date":"2016-05-15T16:42:06.598+0000","up_votes":1,"down_votes":0,"body":"Il blindato della q non te lo attacchi, è impossibile mancarlo","replies":[{"poster":"Sorcio84","date":"2016-05-15T19:16:12.681+0000","up_votes":1,"down_votes":0,"body":"Si ma a cosa serve contro un champ che ti salta addosso e ti fa una rotazione di spell ? Lo blindi ok , ti becchi QWE e appena finisce il blind inizia di AA e muori coumnque , a paritá di feed","replies":[{"poster":"x A N D R E","date":"2016-05-15T21:20:18.549+0000","up_votes":2,"down_votes":0,"body":"Convinto tu convinti tuttti","replies":[{"poster":"Sorcio84","date":"2016-05-16T23:06:52.445+0000","up_votes":1,"down_votes":0,"body":":(\nRitopls buff my skill next patch !!!\n\nEh allora sarò nabbo + sfigatho","replies":[]}]}]}]}]}]},{"poster":"TheAwesomeJ","date":"2016-05-14T15:27:42.844+0000","up_votes":2,"down_votes":0,"body":"Come jungler posso darti qualche utile consiglio su come giocartela contro rengar e quali personaggi utilizzare, nello specifico quei personaggi che gli danno particolarmente fastidio:\n\nJungler\n\n -  {{champion:64}} Hai un importante vantaggio nell'early-mid game, particolarmente al livello 2 se hai la possibilità di fare il tuo rosso ed invadere è una free kill.\nLe tue skill ti permettono di intercettarlo e tenerlo spottato durante la sua ultimate mentre con la tua R puoi salvare il carry lanciando via rengar.\n\n- {{champion:113}} Hai abbastanza controlli per tenerlo a bada e proteggere gli adc, inoltre sei un tank stratosferico e la tua passiva ti fornisce armatura. Bisogna fare attenzione solo nei primi livelli, warda subito e procurati {{item:3711}} per tenerlo sotto controllo.\n\n\n- {{champion:121}} Combattere il fuoco con il fuoco, è una partita a scacchi, che vinca il migliore.\n\nSupport:\n\n- {{champion:223}}Assolutamente il miglior anti-assassin in assoluto, importante è ricordarsi che la W deve essere usata sul carry e non sul primo nemico con poca vita, perchè rengar aspetta proprio quel momento per shottare l'adc.\n\n- Altri support come Alistar e Nautilus tendono troppo a stare in prima linea dando la possibilità a rengar di saltare comunque sul carry, ciò non toglie che se usati nel modo giusto siano comunque efficaci.\n\nAdc:\n\n- {{champion:81}} + {{item:3025}} non ti riuscirà a toccare e se ci riesce gli farai perdere la voglia di provarci. La E istantanea ti permette di evitare il salto mentre la Q lo può spottare anche da invisibile e sloware grazie al gauntlet.\n\n\n - {{champion:51}} Le trappole ti permetteranno di proteggerti durante la laning phase senza contare che, durante i fight, con una adeguata disposizione gli puoi rovinare la ultimate perchè le può prendere anche in salto. Nel caso riesca a saltarti addosso premi EQ, trappola, basic+basic e rengar sarà praticamente morto.\n\n- Altri personaggi come Corki, Tristana e Vayne vanno bene ugualmente, ma non hanno quel brio di \"fastidioso\" che fà cadere il morale del rengar nemico.\n\nTop/ (#vannobeneanchecomesupport):\n\n- {{champion:78}} Grazie alla tua W la passiva di rengar è pressochè inutile, non sarà capace di saltare con efficacia su te o sugli alleati a te vicini.\nCon un largo tempismo puoi prevedere e bloccare la sua ultimate o nel caso puoi comunque portare via rengar dal fight usando la E nel caso lo vogliate mazzare per bene o eventualmente anche con la R.\n- {{champion:98}} Il taunt e il \"dodge ad area\" bloccano totalmente l'outpout dei danni di rengar, inoltre la tua ultimate può salvare tante vite e ribaltare un gank. Bisogna essere solamente svegli nell'usarlo, una ultimate tirata male ti farà perdere solamente del tempo dato che ha un cooldown elevato.\n\n--------------------------------------------------------\n\n**Consigli**\n\n**Invadilo in early game:**\nSe hai un personaggio da early e la tua situazione di start te lo permette allora INVADI.\nUn rengar bloccato in early è un rengar che dovrà recuperare un sacco di farm e che se vorrà gankare non avrà abbastanza danni per essere efficace, specialmente se lo vai a trovare durante i primi 2 livelli dove i suoi danni sono bassissimi e dove non può stackare la passiva con efficacia.\n\n\n**Warda fin da subito:**\n{{item:3711}} è estremamente efficace, rengar non ha un'alta mobilità o un gap closer che non sia derivante dalla sua passiva. Dunque è puramente lineare e mettere le ward nella sua jungla significa tracciarne i movimenti e impedirgli di effettuare gank.\nSoprattutto dopo che han tolto il movementspeed durante l'ultimate è molto facile prevedere dove andrà perchè costretto ad usarla in prossimità della lane.\nIn early-mid è consigliato tenere sia l'item delle ward che il trinket, in modo che ad ogni recall hai 2 ward più quelle fornite dal trinket e puoi coprire praticamente tutta la mappa se gli alleati usano correttamente le proprie risorse.\nSe sei in lane, vale lo stesso discorso, warda la zona più vicina alla sua jungla perchè se metti la ward nel cespuglio a 2 passi da te semplicemente è troppo tardi quando lo vedi.\n\n**Occhio all'erba alta:**\nSe per caso ti ritrovi a combattere in un cespuglio e stai per morire, NON devi mai flashare.\nUn sacco di gente fa dei panic-flash dimenticandosi che rengar semplicemente ti \"salta\" addosso quando è nei cespugli, ergo spreca il flash.\nSe ti capita, prega di resistere e prova a portarlo fuori dal cespuglio, solamente dopo ciò puoi flashare in sicurezza.\nValuta sempre le distanze dai cespugli soprattutto quando scappi perchè può saltare anche i muri se ha la giusta visione.\n\n**Fargli sprecare la ultimate è facile**\nCon i personaggi giusti si può baitare e kitare a volontà ma bisogna essere sempre in formazione in modo che se ingaggiano si può disingaggiare facilmente.\nA tal proposito rengar ha dei tempismi, deve prevedere il fight, se lo si tiene su un filo sottile sarà estremamente tentato di premere R pensando di avere tutto il tempo possibile. A tal proposito prima ci si allontana, poi si prova a reingaggiare e così via finchè non sarà rengar a prendere in mano l'engage e a tuffarsi cadendo nella vostra trappola.\n\n**Gli item giusti**\nRengar ha un burst esagerato ma è limitato a quello, item come {{item:3053}} e {{item:3026}} lo spiazzano totalmente.\nInoltre è importante che il support abbia {{item:3401}} per mitigare i danni e, non per ultimo, il nostro caro {{summoner:3}} che gli dimezza il burst.\n\nSpero ti possa tornare utile perchè mi si è pure cancellato il post e ho dovuto riscriverlo! Maledetto tasto laterale del mouse!!","replies":[{"poster":"Yamero Senpai","date":"2016-05-14T16:13:10.071+0000","up_votes":2,"down_votes":1,"body":"aggiungo su ezreal e caitlyn, non usate mai la abilità di fuga prima che vi salti addosso, qualsiasi main rengar usarà la E per \"snarrarvi\" e quindi la vostra E sarà inutile, un alto buon carry è tristana in quanto può ultare rengar prima che gli arrivi sopra, anche sivir può essere buona in quanto il suo playstyle, centralizzato sui teamfight e avere gente con se, vi verrà naturale non andare bot da soli a farmare e con la E potete bloccare la EmpE o empQ.\n\nil GA non è molto efficacie, se siete contro qualsiasi assassino dovete buildare {{item:3812}} {{item:3046}} {{item:3053}} {{item:3139}}  a prescindere\n\nnon pickate lee per counterare rengar se non avete almeno 80+ punti su lee sin, rammus trundle xin zhao talon jungler elise, sono alcuni con cui non riesco proprio a vincere con rengar, ","replies":[]},{"poster":"Sorcio84","date":"2016-05-14T21:09:48.428+0000","up_votes":1,"down_votes":0,"body":"Grazie mi sono salvato tutto","replies":[]}]},{"poster":"Reonida","date":"2016-05-14T11:08:15.768+0000","up_votes":3,"down_votes":2,"body":"io ho una teoria personale su rengar: mentre lo si gioa il proprio qi cala drasicaente.\n\nsarà la facilità, la voce del champ, i discorsi elevati di rengar non so ma effettivamente è così\npensaci un attimo ed è vero qualsiasi player che gioca rengar si instupidisce per 40 minuti","replies":[{"poster":"Coldeath00","date":"2016-05-14T13:53:43.004+0000","up_votes":3,"down_votes":1,"body":"Così mi offendo :C\nLo ammetto, gioco Rengar (e Shaco), e posso dire senza ombra di dubbio che il champ sa rendersi parecchio antipatico.\nMa d'altronde non è questa la ragione per cui si ha voglia di giocare questo genere di champ? Per vedere il flame? Per sentire pianti?\nSono una persona brutta ma non troppo. Anche perchè se uno gioca Teemo e Twitch se lo merita.\nMeow.","replies":[]}]},{"poster":"Giunco171","date":"2016-05-14T17:42:56.395+0000","up_votes":1,"down_votes":0,"body":"Bannalo/giocalo tu! \n\n\nOppure ci impari a giocare contro che é facilissimo suvvia... Compra le pink in early/mid Game, ti compare un fottuto punto esclamativo, FLASHA, fai duo con un support buono, gioca safe, stai col tuo tank di turno così se ti salta addosso quel tank uno stun minimo lo fa, meglio di nulla.","replies":[{"poster":"Sorcio84","date":"2016-05-14T21:13:10.547+0000","up_votes":1,"down_votes":1,"body":"> Bannalo / giocalo tu\n\nhttp://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/2341230081/204743050?tab=overview\n\nNon posso bannarlo sempre\nNon lo gioco neanche sotto tortura koreana\nHo gia 2 mutui aperti con il venditore di pink\nMa tanto si feeda con gki altri e a 6 kill mi vola in faccia easy","replies":[{"poster":"Giunco171","date":"2016-05-14T21:19:46.031+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Sorcio84,realm=EUW,application-id=MJVj50Jw,discussion-id=vWteMFHb,comment-id=00060000,timestamp=2016-05-14T21:13:10.547+0000)\n>\n> http://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/2341230081/204743050?tab=overview\n> \n> Non posso bannarlo sempre\n> Non lo gioco neanche sotto tortura koreana\n> Ho gia 2 mutui aperti con il venditore di pink\n> Ma tanto si feeda con gki altri e a 6 kill mi vola in faccia easy\n\nUna volta un vecchio saggio disse: Attaccati cit.","replies":[]}]}]},{"poster":"Darki200","date":"2016-05-14T13:03:11.845+0000","up_votes":1,"down_votes":0,"body":"Un minimo di peel e lo Sterak potrebbero funzionare.","replies":[]},{"poster":"MonkeyCarriesU","date":"2016-05-14T11:36:26.307+0000","up_votes":1,"down_votes":0,"body":"Quando sei un adc con un support non premade e dall'altra parte c'è un rengar.. l'unica cosa da fare è stare in base o essere vayne.","replies":[{"poster":"Nabbomaster","date":"2016-05-14T11:59:36.443+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MonkeyCarriesU,realm=EUW,application-id=MJVj50Jw,discussion-id=vWteMFHb,comment-id=0002,timestamp=2016-05-14T11:36:26.307+0000)\n>\n> Quando sei un adc con un support non premade e dall&#x27;altra parte c&#x27;è un rengar.. l&#x27;unica cosa da fare è stare in base o essere vayne.\n\nSopratutto se prendi ADC senza escape è normale che le prendi da rengar","replies":[]},{"poster":"Sorcio84","date":"2016-05-14T11:39:38.302+0000","up_votes":1,"down_votes":0,"body":"Per quanto possa essere main di 3 adc e giochi safe, si feederà sempre con qualche mio alleato e poi verrà a divarmi.\n\nPs : il prossimo in lista è {{champion:62}} \n*spoiler*","replies":[]}]},{"poster":"Pls Buff Shen","date":"2016-05-14T15:38:13.693+0000","up_votes":1,"down_votes":1,"body":"Sai, è per gente che usa champ come {{champion:121}} {{champion:107}} {{champion:203}} {{champion:5}} {{champion:11}}  che ho imparato ad usare {{champion:35}} , all'inizio ti sembrerà molto debole ma uno Shaco usato bene fa perdere al nemico la voglia di giocare jung, anche se contro rengar in late perde, ma lo bullizzi per i primi 25 minuti","replies":[]},{"poster":"YouCanCallMeRoot","date":"2016-05-14T11:17:09.384+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"xBamBa","date":"2016-05-14T12:04:37.582+0000","up_votes":1,"down_votes":1,"body":"E scign so brav quann fann chell che ci dic o padron","replies":[]}]}]}