{"poster":"Sorcio84","date":"2016-10-13T16:26:52.823+0000","title":"Nerf vayne & thresh o buff agli altri adc","subforum":"Campioni e gameplay","up_votes":2,"down_votes":14,"body":"sono sopravvalutati da far schifo e te li trovi sempre contro.\r\na livello di teamfight bastano due tank e vayne shotta tutto il team\r\nthresh fa toppe cose, troppo bene e tanka un botto.\r\n\r\nla rito cosa fa ? buffa la Q di vayne sulle torri.\r\n\r\ngia mi nerfano i main e mi resettano {{champion:96}} , adesso manca solo che mi buffano champ gia forti e poi ?\r\n___\r\nvdiamo cosa succede dopo i mondiali e in prestagione. se ribilanciano vayne o si riferiscono a lei per bilanciare altri champ, mi faccio un nuovo sfondo desktop.","replies":[{"poster":"LionHeartV","date":"2016-10-13T16:52:06.118+0000","up_votes":6,"down_votes":0,"body":"e renzi che fa??","replies":[{"poster":"Äsha","date":"2016-10-13T17:20:41.525+0000","up_votes":1,"down_votes":0,"body":"E I MARO'? PERCHÈ NESSUNO PENSA AI MARO? E LE FOIBE? LE SCIE KIMIKE?!!?","replies":[{"poster":"Jack Garrus","date":"2016-10-14T07:34:05.702+0000","up_votes":1,"down_votes":0,"body":"ma soprattutto, AI BAMBINI!!??!?!11!1","replies":[]}]}]},{"poster":"Blade of Nashira","date":"2016-10-13T21:17:43.450+0000","up_votes":3,"down_votes":0,"body":"Sono Main Vayne e ero Main Thresh scorsa season...\n\nTi rispondo subito:\n\nVayne: \n\nCerto è fortissima ma ha uno skill cap elevatissimo (devi avere le mani per saperla giocare) e se un CC ti colpisce sei morto (adc più squishy ma con il range nella media avendo 550 e non 500 come lucian). Inoltre Vayne PER ORA si può counterare con una cosa: PINK. Basta una ward da 75 gold per poterla uccidere al livello 6 e non farle fare scaling (dopo i 3 item solitamente diventa fortissima, prima non molto se non sai giocare bene). In lane viene counterata da molti adc in meta (cait, ashe, lucian; quest' ultimo soprattutto per l' alto burst e il power spike con la sola youmui) e contro di lei giochi bene anche con Jinx, Ez. Insomma è un champ forte, fuor di dubbio ma ha debolezze che la rendono complessa da giocare soprattutto nei Team Fight. Un errore di posizionamento e sei morto, scoppiato, distrutto. \n\nThresh:\n\nAnche lui è un champ dal mio punto di vista completo, che può fare quasi di tutto. Peccato che se non lo giochi bene risulti una pippa assurda e assolutamente inutile. Motivo? Semplice: una Q ben piazzata può far vincere un Team Fight, una Q sbagliata o una E sbagliata possono fartelo perdere tranquillamente. Devi anche considerare che Thresh è un champ che NON ha armatura elevata né ha scale sulla stessa (se non per le anime) quindi è relativamente una preda piuttosto \"facile\" rispetto a una Leona, Braum o Tahm Kench. Ha utility, tuttavia NON ha cure come Nami o Sona, inoltre NON ha poke effettivamente alto come Karma o la stessa Sona. In team Fight NON hai hard CC se non la tua Q, ma non puoi neanche buttarti dentro a 5 persone dopo aver grabbato qualcuno, rischi di essere scoppiato.\n\n\nIn riassunto: champ forti, ma che hanno alti skill cap.","replies":[{"poster":"Sorcio84","date":"2016-10-14T16:17:49.574+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Blade of Nashira,realm=EUW,application-id=cAOZwaUi,discussion-id=NJQs6Ks9,comment-id=0006,timestamp=2016-10-13T21:17:43.450+0000)\n>\n> Sono Main Vayne e ero Main Thresh scorsa season...\n> \n> Ti rispondo subito:\n> \n> Vayne: \n> \n> Certo è fortissima ma ha uno skill cap elevatissimo (devi avere le mani per saperla giocare) e se un CC ti colpisce sei morto (adc più squishy ma con il range nella media avendo 550 e non 500 come lucian). Inoltre Vayne PER ORA si può counterare con una cosa: PINK. Basta una ward da 75 gold per poterla uccidere al livello 6 e non farle fare scaling (dopo i 3 item solitamente diventa fortissima, prima non molto se non sai giocare bene). In lane viene counterata da molti adc in meta (cait, ashe, lucian; quest&#x27; ultimo soprattutto per l&#x27; alto burst e il power spike con la sola youmui) e contro di lei giochi bene anche con Jinx, Ez. Insomma è un champ forte, fuor di dubbio ma ha debolezze che la rendono complessa da giocare soprattutto nei Team Fight. Un errore di posizionamento e sei morto, scoppiato, distrutto. \n> \n> Thresh:\n> \n> Anche lui è un champ dal mio punto di vista completo, che può fare quasi di tutto. Peccato che se non lo giochi bene risulti una pippa assurda e assolutamente inutile. Motivo? Semplice: una Q ben piazzata può far vincere un Team Fight, una Q sbagliata o una E sbagliata possono fartelo perdere tranquillamente. Devi anche considerare che Thresh è un champ che NON ha armatura elevata né ha scale sulla stessa (se non per le anime) quindi è relativamente una preda piuttosto &quot;facile&quot; rispetto a una Leona, Braum o Tahm Kench. Ha utility, tuttavia NON ha cure come Nami o Sona, inoltre NON ha poke effettivamente alto come Karma o la stessa Sona. In team Fight NON hai hard CC se non la tua Q, ma non puoi neanche buttarti dentro a 5 persone dopo aver grabbato qualcuno, rischi di essere scoppiato.\n> \n> \n> In riassunto: champ forti, ma che hanno alti skill cap.\n\nE io che mi aspettavo una valanga di flame. Meglio così dai.\nPrendo nota e torno ad allenarmi.\nGrazie +1\n\nPs : odio vayne lo stesso perchè ma l'hanno spammata in faccia per due mesi.","replies":[]},{"poster":"Ringiel","date":"2016-10-13T21:32:18.725+0000","up_votes":1,"down_votes":0,"body":">da molti adc in meta\n\nti sei scordato di MF e draven che se la stompano e si feedano in early è finita","replies":[]}]},{"poster":"Darkinknight","date":"2016-10-13T18:06:52.600+0000","up_votes":1,"down_votes":0,"body":"Per vayne il suo attuale danno è esageratamente alto a un certo punto del game(cose tipo 3000+danni in poco piu di un secondo)..ma fino a che ci saranno gli assasin e stun a target o area avra comunque un counterplay abbastanza grosso\nTresh è ottimo ma richiede una buona skill..a livelli medio-bassi basterebbe schivare il grab che altro non sanno fare\nSe ti trovi main op o senza counterplay perche piu easy è normale vengano nerfati prima o poi","replies":[{"poster":"Ringiel","date":"2016-10-13T19:09:57.404+0000","up_votes":1,"down_votes":0,"body":"tutti gli hypercarry sono così ... twitch fa molto più danno di vayne in late e ha un range mostruoso","replies":[{"poster":"Darkinknight","date":"2016-10-13T22:51:02.490+0000","up_votes":1,"down_votes":0,"body":"Non cosi tanto in cosi poco tempo(non ha steroid su ad e true damage% cosi elevato) e inoltre non ha assolutamente escape nel momento in cui inizia a sparare fiocinate..ma ripeto a mio parere è abbastanza bilanciata perche da no o non danno esplode sempre,differentemente senza un assasin stun ad area target la pink non fa molto..ma li è colpa di chi forma la team comp","replies":[{"poster":"Dr LouD","date":"2016-10-14T08:00:07.005+0000","up_votes":4,"down_votes":1,"body":"Vayne può comunque duellare con un nemico alla volta, un Twitch posizionato bene in un fight in late game scioglie un team intero in 4 autoattacchi","replies":[]},{"poster":"Ringiel","date":"2016-10-13T23:00:29.544+0000","up_votes":1,"down_votes":0,"body":">non ha steroid su ad e true damage% cosi elevato\n\nconsiderando la build ha molto più AD di vayne,AS bonus,danni aoe e mooolto più range ... basta che si posiziona bene ed è quasi impossibile per il team nemico prenderlo.\n\n>inoltre non ha assolutamente escape nel momento in cui inizia a sparare fiocinate\n\nin realtà ora si,quando uccide la Q si resetta,ma in teoria raramente serve se si posiziona bene\n___________\n\ncmq alla fine considerando che ha 10 ad di base in più di vayne,stiamo parlando di 20 ad in più per {{champion:67}}\n\n____________\n\n>ma ripeto a mio parere è abbastanza bilanciata perche da no o non danno esplode sempre,differentemente senza un assasin stun ad area target la pink non fa molto\n\nsono dello stesso parere,tra l'altro il meta attuale la penalizza perchè ci sono pochi tank ... lei è forte a kitare,non è il massimo se ci sta tanta gente che bursta;\nchi deve essere nerfato è {{champion:202}} ... è ancora troppo forte","replies":[{"poster":"Darkinknight","date":"2016-10-14T01:12:22.996+0000","up_votes":1,"down_votes":0,"body":"La Q si resetta ma non diventa invisibile immediatamente e non è efficace come il trumble,gli servono 2 secondi senza essere colpito,(se non erro)e se per 2 secondi non è stato colpito ha gia fatto ace o quasi..la ulti di vayne dovrebbe dare 50 ad quindi sono 40 ad in piu per vayne,uniti al danno in piu del trumble e alle varie stack della w(potrei aver dato dati errati non gioco adc,ma mi sembra siano questi)in fatto di danno fra i 2 vayne la vince,twich compensa con il range e il danno AoE\nBeh di jhin a mio parere di ignorante ci sono solo i danni della ulti,considerando che è un adc non vedo il senso di mettere cosi tanti danni in una skill","replies":[{"poster":"BrattishSolid6","date":"2016-10-14T05:29:14.788+0000","up_votes":1,"down_votes":0,"body":"Commento solo per quanto riguarda Jhin: è uno dei champ più squishy del gioco, non ha escape, ha giusto un piccolissimo buff alla ms al quarto colpo. Il fatto che faccia tanti danni con la R è proporzionale al fatto che debba rimanere soppresso sul posto.","replies":[{"poster":"Darkinknight","date":"2016-10-16T11:19:11.801+0000","up_votes":1,"down_votes":0,"body":"Varus deve rimanere soppresso sul posto,cosi come ashe,kog,sivir senza ulti..ma non hanno una ulti che prende mezza mappa che ogni colpa smezza e slowa in cui in late il 4 colpo shotta..ha ad,ms,crit e una buona dose di cc + una ulti no sense per un adc..poi a me come champ non dispiace per nulla e non lo trovo op,pero quella ulti non è \"coerente\"con un adc","replies":[{"poster":"BrattishSolid6","date":"2016-10-16T13:21:57.842+0000","up_votes":1,"down_votes":0,"body":"Varus, Ashe, Kog e Sivir non hanno affatto \"auto-soppressioni\". Identico a Jhin è solo Xerath (o Malzahar, Nunu, Urgot e Warwick, anche se questi prevedono range nettamente più bassi) , tutti gli altri hanno channeling o animations. \n\n> una buona dose di cc \n\nAshe ha un buon cc, Vayne ha un cc discreto, Jinx ha ottimi cc. Jhin ha un root difficile da mandare a segno e che prevede che il nemico sia stato precedentemente già colpito. Non lo definirei affatto \"dotato di una buona dose di cc\". Ne ha uno. Difficile. E neanche così efficiente come altri.\n\nA me come champ Jhin non piace, nonostante riconosca che al momento sia bilanciato e che nelle mani giuste possa sicuramente fare la differenza.","replies":[{"poster":"Darkinknight","date":"2016-10-17T07:22:22.239+0000","up_votes":1,"down_votes":0,"body":"Ha uno snare piu lo slow sulle trappole piu gli slow sulla ulti..sono ben 3 cc su 4 skill..\nInoltre per soppresso intendo senza mobility elevata o dash(cone vayne lucian e volendo twich)..jhin è completamente fermo solo durante la ulti ma dato che la spara praticamente dalla base non mi da questa sensazione di \"posizionamento necessario\"","replies":[{"poster":"BrattishSolid6","date":"2016-10-17T10:33:37.972+0000","up_votes":1,"down_votes":0,"body":"La sua ulti non copre mezza mappa, e se c'è un assassino nel team avversario ci mette ben poco a raggiungerlo generalmente (ogni assassin ha uno o più gap closer). Gli slow sulla R e sulle trappole non li considero neanche. Io parlavo solo di \"hard cc\".\n\nE per soppresso intendo immobile, non con scarsa mobility. Non capisco poi perché hai messo twitch (pochissima mobility) insieme a due degli adc con più mobility (superati solo da Ezreal e Kalista).","replies":[{"poster":"Darkinknight","date":"2016-10-17T22:15:59.045+0000","up_votes":1,"down_votes":0,"body":"Twich se riesce ad attivare la Q aumenta la ms oltre che diventare invisible,non diventando uno di qui champ immobili..comunque si kalista e ez sono esempi decisamente piu adatti\nGli slow sulla R e sulle trappole sono 2 cc(quelli delle trappole di permettono di attivare efficacemente il root,quello della R ti permette di prendere tutti i colpi successivi salvo flash o dash)\nPrende mezza mappa è per modo dire,verrebbe raggiunto e shottato efficacemente solo da uno zed che usa tutte le skill + yomu + flash(ha un range che copra circa la distanza fra le due torri mid),ma generalmente se ulta e si fa prendere è un po pirla quel player non il champ..poi va ben rimane sempre relativamente fragile quindi a parte nerf assurdi nel rework degli assasin,rimarra sempre counterabile","replies":[]}]}]}]}]}]},{"poster":"Ringiel","date":"2016-10-14T09:55:43.368+0000","up_votes":1,"down_votes":0,"body":">la ulti di vayne dovrebbe dare 50 ad quindi sono 40 ad in piu per vayne\n\nla ulti di {{champion:67}}  ne da 70,quella di {{champion:29}} 40 ...","replies":[]}]}]}]}]}]},{"poster":"Ringiel","date":"2016-10-13T16:33:55.036+0000","up_votes":2,"down_votes":1,"body":"{{champion:67}} attualmente fa abbastanza schifo ... ha il range troppo corto,per questo soffre i mage più spammati nella mid {{champion:134}} e {{champion:112}},perchè riescono a scoppiarla con una combo,oltre al fatto che vengono pickati pochi tank\n________________\n\n{{champion:412}} ci sono tipo altri 5-6 support che andrebbero nerfati,molto più in meta di thresh (coff {{champion:201}} coff)\n\n_______________\n\n{{champion:96}} non sapevano come nerfarlo per quello l'hanno riportato alla scorsa season ... è stata sicuramente una cagata,ma probabilmente riceverà di nuovo un \"rework\"o un big buff,perchè attualmente fa pena,non si può nemmeno più giocare ap {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"vondarck","date":"2016-10-14T07:20:46.537+0000","up_votes":1,"down_votes":0,"body":"{{champion:67}} la cambierei, le aumenterei un pelo la gittata della Q , però le diminuirei la gittata della passiva che è veramente inquietante, il problema di per se non sono neanche i danni, quanto il fatto che è un champ che quando sei al suo range non puoi ne ingaggiarla ne disingaggiarla","replies":[]}]},{"poster":"ilmejoop","date":"2016-10-14T15:57:53.146+0000","up_votes":1,"down_votes":0,"body":"Ma io gli ridurrei i danni in late perché a differenza di kog, jinx o twitch è difficilissima da uccidere per colpa del suo kit broken.\nComunque io sono dell idea che i champ tipo vayne,riven, yasuo e azir devono essere tenuti un po' indietro di potenza così uno per far qualcosa di buono deve masterarli e non che dopo una ventina di partite se la gioca.\nVuoi il champ outplay-faker-1v5? Te lo sudi ed impari a giocarlo bene.","replies":[]},{"poster":"Elrond il grande","date":"2016-10-14T08:30:32.729+0000","up_votes":1,"down_votes":0,"body":"ho visto vayne farsi gli 1v3 e rimanerne illesa","replies":[{"poster":"Ringiel","date":"2016-10-14T10:09:35.000+0000","up_votes":1,"down_votes":0,"body":"io invece il contrario, hanno fatto 1v3 per emulare i pro e sono morti male {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Niklide","date":"2016-10-14T01:22:43.277+0000","up_votes":1,"down_votes":0,"body":"il nerf a Thresh ci mancava.....complimenti x il primato ! \n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Äsha","date":"2016-10-13T17:21:46.869+0000","up_votes":1,"down_votes":0,"body":">sono sopravvalutati da far schifo\n\n-\n>a livello di teamfight bastano due tank e vayne shotta tutto il team\nthresh fa toppe cose, troppo bene e tanka un botto.\n\nDeciditi lel","replies":[]},{"poster":"superkey97","date":"2016-10-13T16:50:17.989+0000","up_votes":1,"down_votes":0,"body":"Vayne è l' ADC più difficile da giocare e anche il più squishy oh, certo, anche quello con il range più corto di tutti, deve praticamente venire corpo a corpo per colpirti e poi 1 cc e scoppia. Thresh se non hai il cervello per giocarlo, ci feedi e basta.","replies":[]},{"poster":"Chroniicles","date":"2016-10-13T16:44:57.099+0000","up_votes":1,"down_votes":0,"body":"Thresh è fortissimo ma richiede comunque di avere le mani e un cervello per sfruttare il suo kit, rispetto a Braum per esempio che è pura ignoranza o ad un Taric che ribalta partite con una ulti tirata al momento giusto (tralasciando cure, scudi e stun...).\nSu Vayne non so come esprimermi... non è così facile giocarla come molti danno a intendere, ma nelle mani giuste diventa quasi inarrestabile buildati 3 oggetti... forse basterebbe farla scalare più lentamente rispetto quanto faccia ora...","replies":[]}]}