{"poster":"Dean Winchester","date":"2017-12-24T23:32:26.020+0000","title":"ENCUESTA: ¿Cuál fue el mejor campeón del 2017? (incluidos los full-reworks)","subforum":"Charlas Generales","up_votes":6,"down_votes":1,"body":"Quer&iacute;a saber cual fue el mejor campe&oacute;n de este a&ntilde;o seg&uacute;n la comunidad de LAS, inclu&iacute;dos tambi&eacute;n los reworks, ya que considero que el nuevo trabajo sobre estos campeones viejos los hacen sentir tremendamente frescos como si se tratasen de personajes absolutamente nuevos. Realizo estas encuestas todos los a&ntilde;os, en el 2015 el ganador fue **Tahm Kench, el Rey del Río {{champion:223}} **  ... Y en el 2016 el ganador fue **Jhin, el Virtuoso {{champion:202}} **  . Veamos los campeones de este a&ntilde;o:\n\n**Warwick, la Furia Desatada de Zaun {{champion:19}} **  : Warwick es un monstruo que ronda por los callejones grises de Zaun. V&iacute;ctima de agonizantes experimentos, su cuerpo est&aacute; fusionado con un sistema complejo de c&aacute;maras y bombas, una maquinaria que llena sus venas con furia alqu&iacute;mica. Warwick emerge de las sombras y ataca a los criminales que aterrorizan las profundidades de la ciudad. Lo atrae la sangre y su aroma lo vuelve loco. Nadie que la derrame puede escapar de &eacute;l. **&lsquo;&lsquo;Derrama sangre... &iexcl;atrae a la bestia!&rsquo;&rsquo;\n**\n\n**Galio, el Coloso {{champion:3}}  **  : En las afueras de la resplandeciente ciudad de Demacia, el coloso de piedra Galio se mantiene en guardia constante. Construido como un baluarte contra los magos enemigos, se mantiene inm&oacute;vil durante d&eacute;cadas hasta que la presencia de magia poderosa lo despierta. Una vez activado, Galio pasa la mayor parte del tiempo saboreando la emoci&oacute;n de la pelea y el excepcional honor de defender a sus compatriotas. Pero sus triunfos siempre son agridulces, porque la magia que destruye es tambi&eacute;n la fuente de su reanimaci&oacute;n y cada victoria lo desactiva una vez m&aacute;s. **&#039;&#039;&iexcl;Detr&aacute;s de m&iacute;, demaciano! Tal vez no lo hayas notado, pero soy muy grande&#039;&#039;\n**\n\n**Rakan, el Encantador {{champion:497}} **  : Tan impredecible como encantador, Rakan es un vastaya infame que siempre se mete en problemas, adem&aacute;s de ser el mejor guerrero bailar&iacute;n en la historia tribal de Lhotlan. Para los humanos de las tierras altas de Jonia, su nombre ha sido por mucho tiempo sin&oacute;nimo de festivales salvajes, fiestas incontrolables y m&uacute;sica an&aacute;rquica. Pocos se imaginar&iacute;an que este artista energ&eacute;tico y viajero tambi&eacute;n es pareja de la rebelde Xayah, dedicado a su causa. **&#039;&#039;Soy libre. Tengo a una dama. Tengo una causa por la que morir&#039;&#039;\n**\n\n**Xayah, la Rebelde {{champion:498}} **  : Letal y precisa, Xayah es una vastaya revolucionaria que lleva a cabo una guerra personal para salvar a su gente. Utiliza su velocidad, astucia y plumas afiladas para abatir a cualquiera que se interponga en su camino. Xayah pelea junto a su compa&ntilde;ero y amante, Rakan, para proteger a su decreciente tribu y devolver la gloria a su raza. **&#039;&#039;&iquest;Alguna vez te han apu&ntilde;alado con una pluma?&#039;&#039;\n**\n\n **Kayn, el Segador Sombr&iacute;o {{champion:141}} ** : Shieda Kayn, un practicante sin igual de la letal magia sombr&iacute;a, lucha para alcanzar su verdadero destino: conducir la Orden de la Sombra hacia una nueva era de supremac&iacute;a joniana. Audazmente esgrime el arma darkin viva Rhaast, inmutable ante la progresiva corrupci&oacute;n de su cuerpo y su mente. Solo hay dos resultados posibles: o Kayn somete el arma a su voluntad... o la cuchilla mal&eacute;vola lo consume por completo, para dar lugar a la destrucci&oacute;n de Runaterra. ** &quot;El ni&ntilde;o no est&aacute;. El asesino permanece&quot;**\n\n**Urgot, el Temerario {{champion:6}} **  : Urgot, quien fue alguna vez un poderoso verdugo noxiano, hab&iacute;a sido traicionado por el imperio que lo hizo matar a tantos en su nombre. Atado con cadenas de hierro, lo forzaron a aprender el verdadero significado de la fuerza en el Dragado, una mina de prisioneros en las profundidades de Zaun. &Eacute;l emergi&oacute; como un desastre que propaga caos por toda la ciudad. Proyecta una imponente sombra sobre el submundo criminal. Levantando a sus v&iacute;ctimas con las mismas cadenas que alguna vez lo esclavizaron, purgar&aacute; su nuevo hogar de los indignos y lo convertir&aacute; en un crisol de dolor. **&quot;Solo hay una forma de medir a un hombre. Debes hacerlo... pedazos&quot;**\n\n**Ornn, el Fuego Debajo de la Monta&ntilde;a {{champion:516}} **  : Ornn es el semidi&oacute;s Fr&eacute;ljordiano de las creaciones y artesan&iacute;as. Trabaja a solas en una gigantesca forja construida en las cavernas de lava bajo el volc&aacute;n conocido como Hogar. Ah&iacute;, aviva las calderas burbujeantes de piedra fundida para purificar minerales y crear objetos de calidad inigualable. Mientras que otras deidades, especialmente Volibear, recorren la tierra y se entrometen en los asuntos de los mortales, Ornn se encarga de poner en su lugar a estos impetuosos seres, ya sea con su martillo confiable, o con el desmedido poder de las monta&ntilde;as misma. **&quot;Ya dije suficiente&quot;**\n\n**Evelynn, el Abrazo de la Agon&iacute;a {{champion:28}} **  : Dentro de las oscuras vetas de Runaterra, el demonio Evelynn acecha a su siguiente v&iacute;ctima. Seduce a su presa con la apariencia voluptuosa de una mujer humana, pero una vez que alguien sucumbe ante sus encantos, Evelynn revela su verdadera forma. Es en ese momento somete a su v&iacute;ctima a un inimaginable tormento y se deleita con su dolor. Para el demonio, estos encuentros son amor&iacute;os inocentes. Para el resto de Runaterra, son historias macabras de lujuria que terminaron mal y atroces recordatorios del costo que tiene el deseo lascivo. **&#039;&#039;&iquest;Tienes planes esta noche? &iquest;Qu&eacute; te parece si nos juntamos y liberamos esa enorme tormenta en tu interior?&quot;**\n\n**Zoe, el Aspecto del Crep&uacute;sculo {{champion:142}} **  : Zoe, la mensajera c&oacute;smica de Targ&oacute;n, es la personificaci&oacute;n de las travesuras, la imaginaci&oacute;n y el cambio y, como su heraldo, anuncia grandes acontecimientos que pueden alterar a mundos enteros. Su mera presencia distorsiona las matem&aacute;ticas arcanas que rigen las realidades; en ocasiones, sin ser consciente de su poder, provoca todo tipo de cataclismos. Tal vez eso explique la actitud indiferente con la cual Zoe &quot;cumple&quot; con su deber. Tom&aacute;ndose todo el tiempo de los mundos para jugar, enga&ntilde;ar a los mortales o simplemente entretenerse a s&iacute; misma. Un encuentro con Zoe puede ser alegre y alentador, pero siempre hay algo m&aacute;s detr&aacute;s de las apariencias y a menudo es muy peligroso. **&quot; Nadie tiene que crecer si no quieren hacerlo. O tal vez s&iacute; quieren. Yo no&quot;**","replies":[{"poster":"WhiteMax","date":"2017-12-24T23:53:25.557+0000","up_votes":6,"down_votes":0,"body":"Mejor rework: {{champion:19}} \nMejor campeon nuevo: {{champion:141}}","replies":[]},{"poster":"BG King Fratus","date":"2017-12-24T23:37:01.966+0000","up_votes":3,"down_votes":0,"body":"Creo que definitivamente para mi fue Urgot: Un rework esperado hace decadas, hicieron un excelente trabajo. Y destaco especialmente no solo las interacciones y frases que tiene el campeon y lo mucho que va a aportar al lore cuando salga el rework de Swain, sino tambien felicitar a Krillin y su equipo de doblaje, ya que el actor que doblo a Urgot le logro impregnar una personalidad fria y con un gran sentido del deber (aunque sea el de ser Ejecutor xD)","replies":[{"poster":"Rendezvous Alice","date":"2017-12-25T00:18:35.629+0000","up_votes":1,"down_votes":0,"body":"¡Concuerdo! Acabo de darle mi voto a Urgot. Es increíble el trabajo que hicieron a un campeón tan olvidado, que subió masivamente su play rate tras eso... Además me encanta jugarlo. Se siente como el antiguo Urgot siendo mejor: Una máquina de terror. Especialmente con esa definitiva.","replies":[]}]},{"poster":"Sparky Lulu","date":"2017-12-25T13:52:10.538+0000","up_votes":2,"down_votes":0,"body":"Mejor rework: Eve ♡ Mejor campeón nuevo: Rakan ♡\n\nElegí a Eve en la encuesta porque el hype que me generó saber que su rework estaba tan cerca no tiene nombre, y ella es una campeona bastante especial para mí (mi primer penta, por ejemplo, fue con ella). Me encantó su rework, amé su estilo de juego (me resulta muy natural) y es la que constantemente me lleva a intentar aprender a jugar a una asesina 😊\n\nEn el caso de Rakan ocurre algo similar: Cuando vi el teaser de Xayah y Rakan quedé enamorada de ambxs y estuve hypeando por días junto a mi mejor amigo sobre que seríamos el dúo bot perfecto y todo eso, jajaja xD y probarlo se sintió maravilloso, ya que soy main supp y sentía que no tenía ningún champ que me aportase un aire fresco en ese rol (estaba aprendiendo a jugar a Jhin y de golpe sentía que había encontrado a mi ADC perfecto, así que buscaba lo mismo para supp).\n\nEn fin, más que nada me decidí a votar por los feels y la nostalgia, pero ambxs campeones fueron lxs mejores para mí ete año 😊\n\nSaludos,\nLulu ✨","replies":[]},{"poster":"Jınx","date":"2017-12-25T03:16:52.277+0000","up_votes":2,"down_votes":9,"body":"{{champion:222}} \n\nSalu3","replies":[{"poster":"Thortilla86","date":"2017-12-25T06:11:05.837+0000","up_votes":4,"down_votes":0,"body":"campeones del 2017","replies":[]},{"poster":"Jinxie","date":"2017-12-25T07:53:21.402+0000","up_votes":2,"down_votes":0,"body":"Se refiere a campeones de este año xD.","replies":[]}]},{"poster":"Sir Crucifix ll","date":"2017-12-25T00:14:15.823+0000","up_votes":2,"down_votes":1,"body":"xaxa","replies":[{"poster":"Warwiick","date":"2017-12-25T12:37:49.342+0000","up_votes":1,"down_votes":2,"body":"{{champion:157}} {{champion:81}} {{champion:44}} {{champion:110}} {{champion:420}}","replies":[]}]},{"poster":"Agent Edgar Ross","date":"2017-12-25T06:14:30.918+0000","up_votes":1,"down_votes":0,"body":"Xayah, mira que al principio la odiaba pero despues la jugue y jugue hasta hartarme que la termine amando fuerte. Su personalidad, su kit de habilidades, su lore; 10/10 se mando Riot con la vastaya.\nEn cuanto a Rework¿Warwick quizas?es que de todos los campeones que reworkearon no pude jugar muchos, es mas, a Evelynn ni la toque(y eso que ya lleva un tiempo con su actualizacion).","replies":[]},{"poster":"DEBIRUMAN","date":"2017-12-25T05:07:18.440+0000","up_votes":1,"down_votes":0,"body":"Warwick tiene las mejores frases ademas de que puede hacerse dragon a nivel 3 xD\ncomo algunas de estas:\n- El hombre que yo era fue mi primera victima\n- Un monstruo vive en ti, lo sacare con mis garras\n- Los heroes siempre mueren\n- No puedo salvarlos a todos y no quiero\n- Me converti en el monstruo que siempre fui\nBásicamente no es un tipo comun que fue convertido en un arma, era una especie de cazador o secuestrador de personas que al ser transformado no quiere la redención, busca liberar a Zaun de los barones quimicos.\n\nPD: Es posible que tuviera algun problema de oido, porque cuando se transforma en quimera tendria que tener más audición pero solo posee aumento de olfato. Digo tiene orejas muy largas capaz recupero el oido nada más.","replies":[]},{"poster":"Lulses","date":"2017-12-25T00:35:09.281+0000","up_votes":1,"down_votes":0,"body":"Yo creo que rework: {{champion:6}}, es horrible jugar contra él.\nYo creo que mejor campeón: esta entre {{champion:141}}, y el dúo de {{champion:498}} y {{champion:497}}, yo creo que votaré por uno de los dos del dúo.","replies":[{"poster":"DEBIRUMAN","date":"2017-12-25T04:57:22.191+0000","up_votes":1,"down_votes":0,"body":"amigo no entiendes nada de Urgot ?\nes un tipo que disfruta hostigar y si sobrevives eres digno\nen otras palabras el early te molesta, en late te destroza \npero en todos los minutos le puedes quitear o esquivar todas las habilidades amigo\nes más dificil jugar con urgot en peleas en equipo no es tanque es offtank dura poco\nlo tengo  a maestria 4 solo gana 1 vs 1 y quiza 2 vs 1 xddddd","replies":[]}]},{"poster":"L9 Zhaher","date":"2017-12-25T00:30:09.480+0000","up_votes":1,"down_votes":0,"body":"mejor rework ww,mejor champ nuevo kayyn","replies":[]},{"poster":"CAZUELA DE POLL0","date":"2017-12-24T23:53:43.397+0000","up_votes":1,"down_votes":0,"body":"No juego rakan ni support, me parece aburrido, pero e de admitir que ese campeon esta jodidamente roto sobretodo cuando salio, loco su combinacion con xaya es imparable, su cc, escudo,curacion,charm,daño considerable, muy buen campeon","replies":[]},{"poster":"Kyousuke","date":"2017-12-24T23:42:08.613+0000","up_votes":1,"down_votes":0,"body":"dura pelea XD pero votare por {{champion:141}} ya que siempre me divierto cuando juego con el y me encanta su temática y su forma de ser.\nestaba peleado entre el, {{champion:497}}  y {{champion:19}}  ya que fueron los que mas me acompañaron este año y cada uno me divierte a la hora de jugarlo y buscar la victoria.","replies":[]},{"poster":"Jinxie","date":"2017-12-24T23:37:02.031+0000","up_votes":1,"down_votes":0,"body":"Xayah\nPero esta rota","replies":[]},{"poster":"Lucio22","date":"2017-12-24T23:36:28.731+0000","up_votes":1,"down_votes":0,"body":"entre urgot y ww es jodido, pero creo que le fue un poco mejor a urgot (ya que todavia es un poco jodido encontrarle como jugarle a diferencia de ww, que sufre muchisimo los slows)","replies":[]}]}