{"poster":"Dean Winchester","date":"2016-06-20T00:42:20.241+0000","title":"Paren con eso de la \"Decadencia del LoL\"","subforum":"Charlas Generales","up_votes":49,"down_votes":37,"body":"Basta, el LoL no va a dejar de existir. Riot est&aacute; trabajando en como arreglar lo de las clasificatorias, y en cuanto a lo de la comunidad con los reportes se arregla todo, si el jugador no cambia sus actitudes, mediante la acumulaci&oacute;n de reportes, se lo banea de por vida. &iquest;Tanto les pega una opini&oacute;n de un youtuber, que lo viralizan como si fuese Dios que habl&oacute; desde los cielos? Porfa, con la venida de Overwatch tal vez LoL experiment&oacute; un baj&oacute;n, pero acuerdense que va a volver todo a la normalidad, como pas&oacute; con Heroes, que esto que el otro, que Heroes va a ser el MOBA m&aacute;s popular y mejor... &iquest;Y? En un cyber que tengo cerca (Megasonic), ya est&aacute; Overwatch, todos los d&iacute;as paso por ah&iacute; y desde las vidrieras la gente sigue jugando LoL como si nada. League tiene sus problemas, hay que tener paciencia para todo, a mi tambi&eacute;n me trollean en rankeds, hay flamers y afk&#039;s, pero no por eso dej&eacute; de jugar. Vamos, que el juego va evolucionando cada temporada, los puedo entender con esto de la comunidad, y me doy cuenta de que la gente aveces se harta. &iquest;Pero por la salida de Overwatch? Un juego de pago y que posee requisitos m&iacute;nimos bastante exigentes, no lo creo. Me cansaron esos posts la verdad, no s&eacute; a ustedes :/","replies":[{"poster":"Yrox the Third","date":"2016-06-20T00:45:06.135+0000","up_votes":16,"down_votes":4,"body":"Estando en los foros tanto tiempo he tenido que aguantar muchos spam seguidos del mismo post siempre, paso con URF, paso con el tema de la Fiesta de Mascaras y paso ahora con esto.\n\nLo que mas me molesta es exactamente lo que dices, que solamente porque un Youtuber famoso lo dijo derrepente salieron todos sus fans diciendo que eso es cierto y lo apoyan a muerte.","replies":[{"poster":"Li Grim","date":"2016-06-20T01:15:26.700+0000","up_votes":10,"down_votes":1,"body":"Muy cierto, es como si la gente no tuviera opinión propia, hombre, hay que ser sinceros, la misma gente que se aburre de los jugadores tóxicos es la misma (o en mayoría) que dice \"reportar no sirve de nada\" o \"ya no sé por qué reporto, siguen apareciendo personas tóxicas\". \n\nRiot ya puso la solución: un sistema que funciona a base de los reportes, pero si nadie lo hace, es más inútil que regalarle un refrigerador a los esquimales. Quieran o no, son parte de una comunidad, **si juegan este juego, automáticamente se comprometen a velar por la buena convivencia del servidor, no sirve de nada que se rindan ante un puñado de personas tóxicas, eso no ayuda.**","replies":[{"poster":"El Socialismo No","date":"2016-06-20T03:08:47.709+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Slyllade,realm=LAS,application-id=v7qsfXsE,discussion-id=vkOV5Qsl,comment-id=00000000,timestamp=2016-06-20T01:15:26.700+0000)\n>\n> Muy cierto, es como si la gente no tuviera opinión propia, hombre, hay que ser sinceros, la misma gente que se aburre de los jugadores tóxicos es la misma (o en mayoría) que dice &quot;reportar no sirve de nada&quot; o &quot;ya no sé por qué reporto, siguen apareciendo personas tóxicas&quot;. \n> \n> Riot ya puso la solución: un sistema que funciona a base de los reportes, pero si nadie lo hace, es más inútil que regalarle un refrigerador a los esquimales. Quieran o no, son parte de una comunidad, **si juegan este juego, automáticamente se comprometen a velar por la buena convivencia del servidor, no sirve de nada que se rindan ante un puñado de personas tóxicas, eso no ayuda.**\n\nCreo que estas confundido amigo, esto va mucho más alla de no tener \"opinion propia\", ya que es un argumento bastante simplista de la situacion. Mira, te pondre un ejemplo:\nQué pasaría si  yo publico un tema en el foro: \"Basta ya, el lol peor cada día!\" y explico lo mismo que este youtuber en una entrada en nuestro foro?\nMe llenaría de negativos, te lo aseguro, porque no hay altura de miras en las discusiones y no faltarían los lame botas de riot, usuarios entre 10 y 15 años promedio, o gente mayor con capacidad intelectual severamente limitada, que al ser el lol el unico juego que han jugado en sus vidas, lo defienden a muerte y se ciegan ante las fallas.\nEn cambio, al decirlo alguien relativamente conocido, todos aquellos jugadores que vemos el lol cada día peor sentimos un apoyo y un respaldo a nuestra misma preocupación, por lo que el video se toma como asidero para esta gran verdad que lo niñitos por su infantilismo, y los rioters por razones obvias como lo es el interés laboral, se niegan a ver.\n\nCuando se trata de cosas buenas, soy el primero en reconocerlo, y si, riot esta haciendo un trabajo estupendo en muchas cosas, como lo es la grieta, dragones, reworks de champs, artesania hextech, la reciente actualización en aram que mucha falta le hacia, etc, pero y el resto? Algo tan fundamental como lo es la interacción entre nosotros se dejó hace años de lado ! Es cosa que veas que estamos llevando a cabo esta discusión en la BETA DEL FORO ! Osea, por favor.\n\nSon incapaces de inculcar o de generar una cultura de correcta comunicación para un juego que es 100% de equipo donde la comunicación es fundamental y de hecho, cada vez se esfuerzan más en que este juego se enfoque en el trabajo en equipo, pero y la comunicacion, donde dejamos este pequeño gran detalle? Porque al ponerle más relevancia al trabajo en equipo con mayor razon debería estar dentro del proyecto el estimular y dar un buen ambiente para que nosotros los jugadores nos comuniquemos mejor. \nY ese es solo un punto porque lo otro importante es: y como aprendemos del juego?\nPorque te aseguro que el tutorial que hace el juego, no tienes ni el 1% de lo que debes saber del juego. Cual es la consecuencia de ambos punto mencionados?\nJugadores frustrados que no entienden el juego, flamers, trolles, toxicos, etc que se traducen en una comunidad apestosa.\n\nPerdon la extensión, pero quería que comprendieras bien el punto.\nEs una gran pena, pero es la realidad.","replies":[{"poster":"Taxonometrist","date":"2016-06-20T15:33:15.321+0000","up_votes":5,"down_votes":0,"body":"No podria estar mas de acuerdo con vos, compañero. Hace mucho tiempo que vengo diciendo exactamente lo mismo, creo que incluso en el foro de NA: riot despues de proponer el sistema de honor en los finales de la S2, no se ocupo en actualizar ningun mecanismo que inculque buenas actitudes entre los jugadores. El sistema de honor es tan precario que nadie lo usa, no sirve, no aporta absolutamente nada. Si fuera un condicionador positivo para la buena conducta la gente le daria bola, pero simplemente te da un liston en la pantalla de carga, no es suficiente.\nHace tiempo vengo proponiendo:\n\n1. **Un sistema de tutorias:** En este sistema jugadores mas experimentados que conocen el juego (builds situacionales, sinergia de champs  con items, sinergia de equipo, objetivos, rotaciones, etc) le enseñarian a jugadores que recien empiezan estas cuestiones. Luego de pasar un numero de partidas sin flamear, sin trolear y aprendiendo cosas se habilitaria a esos jugadores a rankear. Hay que tener en cuenta que con los requisitos para rankear puede hacerse eso sin haber entrado a la grieta nunca.\n2. **Un sistema de honor que realmente incentive las conductas positivas:** simplemente eso, premios a los jugadores que reciben honor. Ahora que existe la artesania hextech podria ser que cada 50 veces que te dan honor te da un fragmento de llave en vez de que te la de aleatoriamente.\n3. **Premios por hacer cosas in-game:** Esto tampoco es complicado de implementar. Seria un simple sistema de achivements como existe por ejemplo en el Smite. Por ejemplo: Cada una determinada cantidad de wards puestos in-game te da un premio (llave, ip, rp, skinshard, lo que sea) ¿Por que creo que esto incentivaria buenas conductas? Bueno, los jugadores empezarian, por ejemplo, a poner mas wards ¿que pasaria despues? empiezan a poner wards, los gankean menos y flamean menos al jungla. Tambien por poner un ward se va a dar cuenta que pudo hacer una jugada interesante, etc. Un simple premio llevaria a conductas mas deportivas en los jugadores que los incentivaria a seguir haciendolo.\n\nMi teoria es que Riot se preocupa mucho por el sistema de reportes ¿que genera esto? el ojo de riot esta puesto en las conductas negativas de por si, entonces nosotros tambien ponemos el ojo ahi. Incluso la disponibilidad simbolica para decir lo que es malo es mayor que la de decir lo que es bueno: hay solo cuatro motivos para honrar a alguien pero unos 10 para reportar. Podria darse honor por tantas cosas mas: liderazgo, por prestar atencion al mapa y avisar jugadas enemigas o hacer buenos calls, por ser buen asesino, por ser buen tanque, etc.\n\nEsa es mi opinion. El sistema de Riot es un simple sistema de psicologia conductista pero mal implementado ¿Por que mal implementado? los incentivos positivos para las buenas conductas son pocos. Ser toxico no implica casi ningun ban pero ser buena onda  no trae beneficios especificos... Incluso se podria ponre a todos los toxicos emparejados juntos y que se ahogen en su porqueria entre ellos...","replies":[]},{"poster":"Li Grim","date":"2016-06-20T18:19:33.370+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Alan0990,realm=LAS,application-id=v7qsfXsE,discussion-id=vkOV5Qsl,comment-id=000000000000,timestamp=2016-06-20T03:08:47.709+0000)\n>\n> Creo que estas confundido amigo, esto va mucho más alla de no tener &quot;opinion propia&quot;, ya que es un argumento bastante simplista de la situacion. Mira, te pondre un ejemplo:\n> Qué pasaría si  yo publico un tema en el foro: &quot;Basta ya, el lol peor cada día!&quot; y explico lo mismo que este youtuber en una entrada en nuestro foro?\n> Me llenaría de negativos, te lo aseguro, porque no hay altura de miras en las discusiones y no faltarían los lame botas de riot, usuarios entre 10 y 15 años promedio, o gente mayor con capacidad intelectual severamente limitada, que al ser el lol el unico juego que han jugado en sus vidas, lo defienden a muerte y se ciegan ante las fallas.\n\n\nEso es relativo, dependerá mucho de cómo expongas el tema, si lo haces con argumentos sólidos, buena redacción, no utilizar estereotipos de tóxico como \"ya fue, el servidor murió\" o \"loco, mejoren esta mierda\" y un texto no muy extenso, atraerás la atención de la gente y ten por seguro que esas personas que tú dices no aparecerán, al contrario, se abrirá un buen debate.\n\n> En cambio, al decirlo alguien relativamente conocido, todos aquellos jugadores que vemos el lol cada día peor sentimos un apoyo y un respaldo a nuestra misma preocupación, por lo que el video se toma como asidero para esta gran verdad que lo niñitos por su infantilismo, y los rioters por razones obvias como lo es el interés laboral, se niegan a ver.\n\nUno de los temas más recurrentes de estos rostros conocidos, es la dinamycQ, Revenant, Knekro y hasta Gosu y muchos streamers de NA están en desacuerdo ROTUNDO con la nueva cola, es otra polémica actual del LoL y que genera mucho enojo más que debate por la cantidad de personas que lo apoyan. Como un firme jugador de SoloQ , apoyo su opinión, pero en ningún momento creeré que no se puede subir solo por la presencia de más premades, de hecho, me parece un divertido reto.\n> \n> Cuando se trata de cosas buenas, soy el primero en reconocerlo, y si, riot esta haciendo un trabajo estupendo en muchas cosas, como lo es la grieta, dragones, reworks de champs, artesania hextech, la reciente actualización en aram que mucha falta le hacia, etc, pero y el resto? Algo tan fundamental como lo es la interacción entre nosotros se dejó hace años de lado ! Es cosa que veas que estamos llevando a cabo esta discusión en la BETA DEL FORO ! Osea, por favor.\n\nVerdad lo último, no entiendo por qué no quitan la etiqueta de \"beta\" de una vez por todas.\n> \n> Son incapaces de inculcar o de generar una cultura de correcta comunicación para un juego que es 100% de equipo donde la comunicación es fundamental y de hecho, cada vez se esfuerzan más en que este juego se enfoque en el trabajo en equipo, pero y la comunicacion, donde dejamos este pequeño gran detalle? Porque al ponerle más relevancia al trabajo en equipo con mayor razon debería estar dentro del proyecto el estimular y dar un buen ambiente para que nosotros los jugadores nos comuniquemos mejor. \n\nEn eso estamos de acuerdo, creo que a Riot con tanta mejora, se olvidó de un \"pequeño detalle\" que de no mejorarse hará que el trabajo en equipo nunca de los frutos que se esperan, me encantaría que se implementara una medida que deje una \"huella\", que marque un antes y un después, ya sea severa o con aires de reformar a la buena, pero algo sólido y contundente, para que el sistema de reportes automático no sea visto en menos o como el \"único plan de Riot contra los tóxicos\".\n\n> Y ese es solo un punto porque lo otro importante es: y como aprendemos del juego?\n> Porque te aseguro que el tutorial que hace el juego, no tienes ni el 1% de lo que debes saber del juego. Cual es la consecuencia de ambos punto mencionados?\n> Jugadores frustrados que no entienden el juego, flamers, trolles, toxicos, etc que se traducen en una comunidad apestosa.\n> \n> Perdon la extensión, pero quería que comprendieras bien el punto.\n> Es una gran pena, pero es la realidad.\n\nEl tutorial definitivamente se puede mejorar, eso es algo indiscutible, pero de ahí a que su carencia de utilidad produzca como consecuencia tóxicos que no entienden el juego hay una distancia notable, por ejemplo, tu y yo no creo que por no entender el juego al principio de inmediato nos frustramos, yo creo que lo contrario, emocionarnos e intentar saber más y más del juego. Una medida piloto que se podría implementar es un nuevo código del invocador, uno con tintes de afiche, que TODOS deban leer al ingresar por primera vez a su cliente y que esté disponible para leer ahí mismo cuando se quiera, con un sólido lenguaje paraverbal que atraiga la atención del nuevo jugador, también podríamos añadir los 10 mandamientos del juego(?. No lo sé, es difícil dar ideas, no te lo negaré. :/","replies":[]}]}]}]},{"poster":"Whitesse","date":"2016-06-20T04:51:48.646+0000","up_votes":9,"down_votes":0,"body":"La gente no se queja del LoL por lo que dicen los Youtubers. Se experimenta la decadencia del LoL si jugas solo y Los youtubers refuerzan esa forma de \"pensar\" o \"sentir\" el LoL porque explican las cosas con detalles y como son.\n\nYo ahora estoy des instalando el LoL porque ya no soporto mas como esta el juego, de estar en Diamante 4 jugando comodamente y \"disfrutando\" el juego, pasé a enojarme porque bajé de Platino 1 a 2 y siguen trolleando los premades que no saben jugar entre sí y soportarme a los Diamante 4 carreando a un Oro 1. Despues ves al minuto 35 como el Oro 1 se garcha a tus aliados que le sacan una liga completa de \"habilidad\", dejate de joder, Los que jugamos solos nos dio por los huevos estó, pongan cola individual o no, no va a volver a ser igual, el MMR se te va por el piso si jugas solo.\n\nNi hablar del tiempo de espera. Espero 35 minutos para jugar una NORMAL clasificatoria, pero con amigos tarda menos de 2 minutos. Y no digan \"y rankea con tus amigos\" porque mis amigos con los que me divierto jugando, son Plata 5, Plata 3, Oro 5, y ellos se divierten porque juegan juntos ranked pero yo que les saco 2 ligas de diferencia te da por los huevos.","replies":[]},{"poster":"FurchiDC","date":"2016-06-20T04:29:14.140+0000","up_votes":9,"down_votes":0,"body":"Te apoyo al 100%. Muchos por aqui saben que mi cuenta es una de las mas malditas por flamers, afk, feeders, emparejamientos injustos, etc. Tengo muchas rachas de derrotas y pocas de victorias.\nAun asi el juego me tiene fascinado, es una belleza, es arte. Se siente como pocos, es el primer juego online q jugue por mas de un año y con tanta frecuencia.\n\nNo se puede comparar el OVERWATCH con el LOL. El Ow es un shooter y no me gusta, no lo bajaria ni aunq estuviera gratis.\n\n--\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[]},{"poster":"Neo Gaussrik","date":"2016-06-20T17:04:46.696+0000","up_votes":10,"down_votes":4,"body":"> [{quoted}](name=C9 Kim,realm=LAS,application-id=v7qsfXsE,discussion-id=vkOV5Qsl,comment-id=,timestamp=2016-06-20T00:42:20.241+0000)\n> Basta, el LoL no va a dejar de existir.\n\nJaja, no, estamos bastante lejos de eso. :p En efecto, todavia estamos creciendo!\n\n> Riot est&amp;aacute; trabajando en como arreglar lo de las clasificatorias, y en cuanto a lo de la comunidad con los reportes se arregla todo, si el jugador no cambia sus actitudes, mediante la acumulaci&amp;oacute;n de reportes, se lo banea de por vida.\n\nY bien, igual entiendo cuando un jugador se frustra por temas de toxicidad. Hemos mejorado, pero eso no significa que hayamos solucionado el problema.\n\n> &amp;iquest;Tanto les pega una opini&amp;oacute;n de un youtuber, que lo viralizan como si fuese Dios que habl&amp;oacute; desde los cielos?\n\nEncuentro interesante la resonancia que ha tenido el mensaje en la comunidad. Siento que esta frustracion esta asociada al tema de SoloQ/DynamicQ, pero esa es una percepcion personal.\n\n> Porfa, con la venida de Overwatch tal vez LoL experiment&amp;oacute; un baj&amp;oacute;n, pero acuerdense que va a volver todo a la normalidad, como pas&amp;oacute; con Heroes, que esto que el otro, que Heroes va a ser el MOBA m&amp;aacute;s popular y mejor...\n\nOverwatch es un juego genial! Estamos entusiasmados con el y sentimos que es mejor para los jugadores que hayan mas y mejores juegos. La competencia siempre termina siendo mejor para el jugador, y ya hemos aprendido varias cosas de Overwatch que ellos hacen muy bien. :)\n\nSaludos, y gracias por el apoyo! :P","replies":[{"poster":"IIIØÜØÜØÜØIII","date":"2016-06-20T19:19:13.400+0000","up_votes":2,"down_votes":0,"body":"Lo del soloQ/DynamicQ es un infierno y muchos nos sentimos frustrados, en especial los que jugamos solos. El sistema de emblemas no va a solucionar nada, ojala puedan dar una solución real y pronto, porque estoy cansado que me stompeen en ranked, teams coordinados por skype, crea experiencias negativas. No estoy en la obligación de buscarme un team cuando antes Riot me protegía de esas malas experiencias y creaba equipos en igualdad de condiciones.\n\nTe doy un ejemplo, desde hace como 2 semanas que no quiero jugar mas ranked, porque me tocó contra uno de estos teams coordinados y constantemente me hacian 4 jugadores dive en torre a cualquier nivel para matarme, habrá sucedido 5 o 6 veces durante el early, lo que me causó frustración y pocas ganas de jugar, ¿cómo le digo a los restantes 4 jugadores de mi equipo que me ayuden y se coordinen si no los conozco?. Espero no tener jamás que repetir una partida igual a esa.","replies":[{"poster":"Neo Gaussrik","date":"2016-06-20T20:11:51.332+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=0wU,realm=LAS,application-id=v7qsfXsE,discussion-id=vkOV5Qsl,comment-id=000f0000,timestamp=2016-06-20T19:19:13.400+0000)\n> Lo del soloQ/DynamicQ es un infierno y muchos nos sentimos frustrados, en especial los que jugamos solos.\n\nCreo que esto generaliza mucho; para los que juegan solos en ligas bajas el sistema funciona bastante bien, pero es verdad que el sistema no esta funcionando bien para nuestros jugadores con mas experiencia/dedicados.\n\n> El sistema de emblemas no va a solucionar nada\n\nLa verdad no me gusta mucho la idea tampoco, personalmente.\n\n> ojala puedan dar una solución real y pronto, porque estoy cansado que me stompeen en ranked, teams coordinados por skype, crea experiencias negativas.\n\nUna partida asi puede pasarle a cualquiera, pero los grupos de 4 son bastante raros. Es poco probable que te vuelvas a encontrar con un equipo de 4 por bastante tiempo.","replies":[{"poster":"Rolando Magic","date":"2016-06-20T21:40:17.661+0000","up_votes":1,"down_votes":0,"body":"Hola Gauss!\nAprovecho para hacerte una pregunta para saber tu opinion como jugador y como Rioter u asociado a Riot, si es que existen diferente respuestas.\nY es la siguiente, no crees que implementar un sistema de chat de voz ayudaría a contrarrestar a las premade? ya que lo que la gente mas se queja es la comunicación que tienen estas y la ventaja que da.\nYo creo que para lo competitivo que es el lol un chat se queda corto ,aun con los ping que son de muchisima ayuda, cualquier juego multijugador medianamente competitivo tiene uno. \nCreo que los beneficios que traería superarían por mucho a las cosas malas.\nSalu3 :3","replies":[{"poster":"Neo Gaussrik","date":"2016-06-20T21:44:23.409+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Camionero Kawaii,realm=LAS,application-id=v7qsfXsE,discussion-id=vkOV5Qsl,comment-id=000f000000010000,timestamp=2016-06-20T21:40:17.661+0000)\n> Hola Gauss!\n> Aprovecho para hacerte una pregunta para saber tu opinion como jugador y como Rioter u asociado a Riot, si es que existen diferente respuestas.\n\nVeamos :)\n\n> Y es la siguiente, no crees que implementar un sistema de chat de voz ayudaría a contrarrestar a las premade? ya que lo que la gente mas se queja es la comunicación que tienen estas y la ventaja que da.\n\nComo jugador y como Rioter creo que la incorporacion de un sistema de chat de voz seria un neto positivo, aunque siento que los premades igual van a tener una ventaja ya que en lo personal no creo que me darian ganas de usar el chat de voz con extraños.\n\n> Yo creo que para lo competitivo que es el lol un chat se queda corto ,aun con los ping que son de muchisima ayuda, cualquier juego multijugador medianamente competitivo tiene uno. \n> Creo que los beneficios que traería superarían por mucho a las cosas malas.\n> Salu3 :3\n\nSaludos!","replies":[{"poster":"Rolando Magic","date":"2016-06-20T22:02:29.594+0000","up_votes":2,"down_votes":0,"body":"Gracias por responder!!","replies":[]}]}]}]},{"poster":"ARG XtremePlay","date":"2016-06-20T19:51:47.517+0000","up_votes":2,"down_votes":0,"body":"pues, cuando a mi me \" stompean \" no culpo al hecho de que ellos esten coordinados y nosotros no, simplemente fue MI error, por no wardear, por pushear mucho, hacer cosas sin pensar, si decis que son 4 jugadores diveandote supongo q jugas en bot, entonses aprende a congelar linea si sos adc o a wardear bien si sos soporte.\nPor otro lado, decis \"¿cómo le digo a los restantes 4 jugadores de mi equipo que me ayuden\" osea que no estas en bot, estas en mid / top, una forma facil de jugar seguro, es usar un champ con buen wave clear, limpias y retrocedes sin intentar tradear daño... las soluciones son muchas, pero como todo en la vida es mas facil culpar a otros jaja\n\nsuerte en tus proximas partidas :p","replies":[]},{"poster":"Duk","date":"2016-06-21T04:35:28.099+0000","up_votes":1,"down_votes":0,"body":"Es cierto. Juego solo generalmente y en Rankeds siempre en solo y es muy complicado.\nLos pocos amigos que tengo xD estan en otros juegos, L2 etc y no juegan mas esto","replies":[]}]}]},{"poster":"Rebkans","date":"2016-06-20T02:47:12.957+0000","up_votes":5,"down_votes":0,"body":"Estoy de acuerdo con vos, ultimamente mucha gente lo que hizo fue copiar textualmente lo que dijo un youtuber en lugar de dar una opinion propia.\nLos trolls, y flamers son personas que siempre hubo en el LoL como en cualquier juego online, ya sea Smite, OW, HoTS, etc. Es cierto tambien que desde la S2 hasta la ahora, la cantidad de flamers han aumentado considerablemente.\n¿Como se soluciona esto? Facil, con el sistema de reports y con mucha paciencia. Hay gente que cree que una persona es sancionada inmediatamente despues de realizar el report y despues viene a quejarse diciendo que se lo encontró en la partida siguiente. Resumiendo: las quejas y spam en el foro no son la solucion, los reports si.\nRiot esta tomando medidas para **reducir** la posibilidad de que te toque este tipo de gente al mismo tiempo que se encarga de banear a los que tienen mala actitud.\nDespues vienen a comparar el LoL con el OW. Si, un juego f2p con un juego pago y el precioso grafico. Esta bien, es cierto que OW le quito popularidad al LoL pero no quiere decir que el juego vaya a terminar, es muy probable que sea temporal como paso con Smite y HoTS. Ademas, ese grafico es de algunos paises asiaticos, ¿Que influencia tiene sobre LAS, LAN, NA, EU, el hecho de que ellos jueguen eso en un cyber? Ninguno y tampoco tiene significado alguno.\n¿Puede que se acabe el LoL alguna vez? Si, puede ser pero no ahora ya que el juego tiene mucho potencial como para durar varios años.","replies":[]},{"poster":"Cayit0","date":"2016-06-20T02:18:38.128+0000","up_votes":5,"down_votes":0,"body":"Empecé a jugar en la season 3 y SIEMPRE se ha dicho lo mismo, que la comunidad, que los trolls, que \"rito\" esto que \"rito\" lo otro. Siempre va a haber gente que no le guste el juego y se van a pasar criticandolo, pero también va a haber otros que lo aceptan y como dices, reportan, mutean y juegan sin ofender a nadie.","replies":[]},{"poster":"Zenny","date":"2016-06-20T17:38:42.974+0000","up_votes":3,"down_votes":0,"body":"Estoy de acuerdo contigo\naunque yo no le preste atención a esas cosas pero bueno, yo no puedo hacer nadita de nadita {{sticker:slayer-pantheon-popcorn}} \nEs mejor olvidar que recordar esa partida y volver a jugar otra, así es la vida\nSe cierra una puerta y se abre una ventana, como las partidas \nCabe destacar que Overwatch es un juego ridículamente caro, tenes que seguir pagando por cajitas aleatorias y el juego no esta completamente terminado al 100%\nSalu2\n-Glad1us","replies":[]},{"poster":"ilChanta","date":"2016-06-20T01:58:08.488+0000","up_votes":3,"down_votes":0,"body":"Simplemente hay dos problemas MUY importantes, están los conformistas (que son un peligro) y los hater's (que son otro peligro más).\n\nBueno ahora a lo que dicen todos, es aunque les duela muy en el corazón  a los fanboys, es que LoL esta haciendo las cosas mal, y que estas quejas que salen a flote no son ninguna novedad (eran mas de esperar con esta situación), porque Riot no escucha al jugador.... si ok es un F2P, si no te gusta es simple como no jugar... PERO SABEN QUE? YO DONE GUITA A RIOT COMPRANDO SKINS y quiero que por lo menos hagan algo bien, osea un feedback como corresponde y el problema que el feedback es horrible.\n\nEsta queja esta mas echa a los altos cargos que a los rioter's perooo... los rioters tendrían que tratar de hacer algo para levantar el animo, seguimos esperando el \"evento\", siempre llegan con respuestas vacías, el sv se cae a pedazos, etc... y nunca dan la cara encima cuando lo hacen son RESPUESTAS VACÍAS con excusas mediocres (los negativos lo marcan).\n\nLuego todo ese malestar se acumula y estalla en el foro, que siempre están en llamas. Y a todo esto veo como la comunidad se va mudando a otros juegos, que sinceramente me parece bien, por que ojala les sirva como llamado de atención a Riot, porque aunque Overwatch (Que por el poco contenido que tiene, para mi no vale ese precio) se este llevando la gente esta estupendo, por que se lo merecen. Ah y esperen que Paragon esta en camino a sacar el trono que para mi ese si que es un verdadero juego.\n\nEn fin, Riot tiene cosas buenas y malas, las malas les falta mucho por arreglarlas y si esto sigue así el juego se va a terminar muriendo lentamente.","replies":[{"poster":"Una Nutrinha","date":"2016-06-20T03:55:22.580+0000","up_votes":2,"down_votes":0,"body":"Creo que lo que mas molesta en mi opinión es que de un día para el otro cuando RevenantLoL postea su vídeo todos salen a criticar y decir textualmente lo que dice en su video,El mayor problema de Riot es que no nos esta informando acerca de los asuntos en los cuales tiene que informar,Hace mucho tiempo llevamos esperando una solución o un reemplazo al tribunal y nunca lo obtuvimos,Creo que ese es el problema,yo quiero saber si ese equipo de trabajo está haciendo algo o se esta rascando a 4 manos\n\n{{champion:134}}**_~~xDeadxDeadx~~_**{{champion:203}}","replies":[{"poster":"ilChanta","date":"2016-06-20T17:37:20.538+0000","up_votes":1,"down_votes":0,"body":"Obvio que los discipulos de reve se encargan de repetir todo como loros y también tenes razón, por que Riot tendría que aclarar/responder/ordenar las cosas y bajar los humos.","replies":[]}]}]},{"poster":"ll Leoh ll","date":"2016-06-20T07:24:05.643+0000","up_votes":4,"down_votes":1,"body":"\"si el jugador no cambia sus actitudes, mediante la acumulación de reportes, se lo banea de por vida\"\n[http://images3.wikia.nocookie.net/__cb20130612215126/meme/es/images/8/85/Scientology-tom-cruise-laughing.jpg](http://images3.wikia.nocookie.net/__cb20130612215126/meme/es/images/8/85/Scientology-tom-cruise-laughing.jpg)\nCon suerte banean","replies":[{"poster":"lordeman10","date":"2016-06-20T20:50:31.582+0000","up_votes":1,"down_votes":1,"body":"y que decis de esa gente que entra y hace posts tipo: \"me banearon 5 cuentas por culpa del team\"","replies":[{"poster":"Yrox the Third","date":"2016-06-20T21:00:23.239+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=lordeman10,realm=LAS,application-id=v7qsfXsE,discussion-id=vkOV5Qsl,comment-id=000b0001,timestamp=2016-06-20T20:50:31.582+0000)\n>\n> y que decis de esa gente que entra y hace posts tipo: &quot;me banearon 5 cuentas por culpa del team&quot;\n\nEstan mintiendo, ya que los reportes falsos no sirven para banearte.\n\nSi te banearon es por algo, no fue por \"esos premades trolls que te reportaron sin razon\".","replies":[{"poster":"lordeman10","date":"2016-06-20T21:10:52.138+0000","up_votes":1,"down_votes":0,"body":"lo se, igual la cosa es peor aún te ponen que le banearon todas sus cuentas por insultar a la gente que juega mal cuando \"se lo merecen\" xd \n\ncada cosa hay en el foro","replies":[{"poster":"Yrox the Third","date":"2016-06-20T21:12:34.499+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=lordeman10,realm=LAS,application-id=v7qsfXsE,discussion-id=vkOV5Qsl,comment-id=000b000100000000,timestamp=2016-06-20T21:10:52.138+0000)\n>\n> lo se, igual la cosa es peor aún te ponen que le banearon todas sus cuentas por insultar a la gente que juega mal cuando &quot;se lo merecen&quot; xd \n> \n> cada cosa hay en el foro\n\nEso lo tengo asumido, el foro esta lleno de cosas tan raras que es increible lo que te encuentras a diario.","replies":[]}]}]}]},{"poster":"natutivo","date":"2016-06-20T08:39:06.079+0000","up_votes":4,"down_votes":2,"body":"no ves lo foros? esta lleno de personas que se quejan que los banean, imaginate las que no se quejan","replies":[{"poster":"TortugaConMuleta","date":"2016-06-20T18:08:31.166+0000","up_votes":1,"down_votes":0,"body":"no, los que no se quejan , estan jugando a otra cosa, o siguen jugando, o hacen algo mejor que esto","replies":[]}]}]},{"poster":"Saerus Anarion","date":"2016-06-20T21:18:06.713+0000","up_votes":2,"down_votes":0,"body":"Ya tengo unos años jugando lol, y nunca me paso de llegar a este nivel de que sea un milagro jugar una partida sin flammer y afks, tanto en tu equipo como en el otro.\nEmpece jugando en NA y cuando se creo LAS me pase, así que se muy bien como todo empezó y como esta ahora.","replies":[]},{"poster":"LGBT Valentina","date":"2016-06-20T01:52:22.853+0000","up_votes":4,"down_votes":4,"body":"El lol va a morir\nTodos los juegos mueren te gusten o no\nDecian lo mismo del cs 1.6 y del w3 the frozen throne online (en especial el ombuserver)\n\nY si la gente, mucha dejo el lol por overwatch, tuvo una caida fuerte, en especial en temas de cyber cafes\n\nDeci lo que quieras de lol, va a morir como todo eventualmente\n\nEs hermoso como ver que la LCS, cada vez es menos divertida\nY apoyo completamente a los profecionales de NA con lo que hicieron (y que riot baneo sus streams)\n\n\nEn este foro, normalmente (que son la > low elo), los videos como ese pegan\nPero en las foros y comunidades de los servers principales. Mirar los foros, las decisiones de los profecioneles y como Riot se esconde, es como la frutilla del postre si estas medio o bastante enojado con los ultimos cambios (s6)\n\nUsan el foro para desahogarse y esta perfecto. Si te molesta, deja de entrar al foro 2-3 semanas o ignora los post\nNo veo otras soluciones","replies":[{"poster":"Zenny","date":"2016-06-20T17:33:50.868+0000","up_votes":2,"down_votes":0,"body":"La solución es que la gente tome conciencia y empiece a dejar esas actitudes de troll/flammer/toxico. Varios post hablando que los menores de 18 hacen que pase esto y que deberia haber mas gente madura pero no veo un cambio positivo en la comunidad :/\nSalu2 \n-Comicamente Glad1us","replies":[{"poster":"LGBT Valentina","date":"2016-06-20T17:40:09.575+0000","up_votes":2,"down_votes":0,"body":"Para tomar conciencia, primero hay que educar\nEste juego, no educa. Y no estoy hablado de educar realmente\n\nYo me refiero a educar, yo hablo de educar, para poder castigar\nEl juego tiene castigos tan malos, que no educan, la gente no toma conciencia \nPor que el flammer, lo arreglas es mute, seria genial que empezemos a usar el mute mas seguido. Pero el troll?\n\n\nQue, tengo que hacer stream, llamar la atencion de Riot como hizo tyler 1? (logicamente, se fue al carajo el pibe. Aunque me parece injusto, pero bueno). Realmente me parecio injusta la casa de la oleada de bans que hizo Riot","replies":[]}]},{"poster":"Avestruz Judia","date":"2016-06-20T05:43:02.052+0000","up_votes":1,"down_votes":0,"body":"Saludos!\nMe podrías decir a que te refieres cuando dices lo que hicieron los profesionales de NA que hizo que Riot baneara sus streams?","replies":[{"poster":"LGBT Valentina","date":"2016-06-20T15:36:37.273+0000","up_votes":2,"down_votes":0,"body":"Los profecionales\nNo se si fue 1 o 2 decisiones\nEn donde, hicieron un torneo y practicamente los 10 le daban a play, osea siempre jugaban 5 vs 5 las mismas personas. Resumido es eso\nLes banearon el stream por esto \n\nLa otra decision, es que esto actualmente se sigue haciendo si no me equivoco","replies":[]}]},{"poster":"Lysaru","date":"2016-06-20T02:42:52.922+0000","up_votes":1,"down_votes":3,"body":"> Y si la gente, mucha dejo el lol por overwatch, tuvo una caida fuerte, en especial en temas de cyber cafes\n\nCyber cafes de COREA donde 1 Hora son 80 centimos, no te podes fiar de los cyber cafes ni corea ni en europa ni en america ni en ningun lado.\ny queres saber cuanto duro esa \"caida en cyber cafes\"? 3 DIAS.\n\n> Es hermoso como ver que la LCS, cada vez es menos divertida\n\nEsto es por el choti-meta que se lleva desde el año pasado, de tankes que pegan como si fueran un adc fedeado y aparte de eso en estos.. no se, 6 parches? se estan llevando cosas como fizz/ekko tanque, que ademas de tankear y pegar tienen movilidad.\n\n> Deci lo que quieras de lol, va a morir como todo eventualmente\n\nDentro de 10-12 años aprox.","replies":[{"poster":"LGBT Valentina","date":"2016-06-20T03:10:36.149+0000","up_votes":2,"down_votes":2,"body":"3 dias\nPonele\nNo se si, te pusistes a ver tambien lo que esta haciendo los profecionales de la LCS...\n\n\nLol, va a morir. 10 años\nOjala, en 10 años para mi blizzar va a morir","replies":[{"poster":"Una Nutrinha","date":"2016-06-20T03:59:31.068+0000","up_votes":3,"down_votes":1,"body":"**Morir o cambiar**\nEn el futuro van a llegar nuevas tecnologías,y es un poco patético decir que va a morir en \"10 años\",ya que es muy incierto el futuro y Riot paso a paso descubre nuevas tecnologías y mecánicas\n{{champion:134}} **_~~xDeadxDeadx~~_**{{champion:203}}","replies":[{"poster":"LGBT Valentina","date":"2016-06-20T04:21:05.674+0000","up_votes":3,"down_votes":1,"body":"No jodas\nPara eso esta paragon xD","replies":[]}]}]}]}]},{"poster":"Mistreabus","date":"2016-06-20T05:59:15.565+0000","up_votes":2,"down_votes":0,"body":"yo no apoyo a nadie, en realidad ni sabia quien era ese youtuber porque solo vi el video 1 vez pero muy al margen de la situacion todo lo que se dice es verdad.","replies":[]},{"poster":"H3rmiiT","date":"2016-06-20T01:44:03.471+0000","up_votes":2,"down_votes":0,"body":">  Vamos, que el juego va evolucionando cada temporada\n\nEs totalmente lo contrario en la S2 / S3 podías jugar tranquilo y divertirte sin que te insulten por un error\nAhora te pones a jugar y por el mas mínimo error ya se ponen a trollear y a insultar\n\nTe pongo de ejemplo la ultima partida que jugué, teníamos un lee en top contra un darius el lee murió 1 vez y ya decía que era gg y empezó a suicidarse y a insultar a todos  porque no quería que lo carreen.. lo reporto todo el team y al rato me agrego para insultarme y no veo que lo hayan sancionado o algo","replies":[{"poster":"Lysaru","date":"2016-06-20T02:30:14.464+0000","up_votes":2,"down_votes":0,"body":"S2 Cuando no jugaba ni la mitad de las personas que juegan ahora\nS3 (Si es que jugabas en LAS) la mayoria de los que jugaban en las en la s3 venian de NA y ya tenian 1 año como minimo jugando al lol.","replies":[]},{"poster":"Dean Winchester","date":"2016-06-20T02:00:02.359+0000","up_votes":3,"down_votes":3,"body":"La nueva jungla, la actualización y la perfecta optimización de la Grieta, las nuevas actualizaciones  a los campeones más antiguos, modos de juegos temporales (ahora con el nuevo modo Asedio que está genial), el Heraldo de la Grieta, la actualización a los colosos y a los magos (le siguen la actualización a asesinos) lo que implica el renacer de campeones como Akali o Talon, eventos, los nuevos dragones, nuevos aspectos, nuevos campeones. Gente tóxica siempre la hubo, pero dije anteriormente que se soluciona con los reportes, no hay que bajonearse por esas pocas personas, que jamás van a  avanzar por sus actitudes. El juego fue evolucionando y lo va a seguir haciendo, siempre con ayuda de nosotros, los juegadores.","replies":[{"poster":"H3rmiiT","date":"2016-06-20T04:29:12.229+0000","up_votes":3,"down_votes":1,"body":"Que caso tiene que actualicen todo para meterse a jugar una normal y que se la pasen insultandote\nYo lo jugaba para divertirme pero ya me esta hartando y esta season no jugué 1 sola partida equilibrada, siempre hay un troll o un afk en mi team o en el enemigo lo cual lo hace aburrido a mi parecer. Y las partidas que parece que empiezan bien alguno de todos pierde linea y se pone a feedear porque no quiere ser carreado","replies":[]}]}]},{"poster":"Narwhal","date":"2016-06-20T11:41:55.502+0000","up_votes":3,"down_votes":2,"body":"Nada va a parar la decadencia del lol, y si fuera asi, nada va a parar a los gigantes que estan arrasando como overwatch y ni te cuento cuando salga paragon.... gg izi lol paso de moda...","replies":[{"poster":"Una Nutrinha","date":"2016-06-20T17:06:56.266+0000","up_votes":3,"down_votes":1,"body":"S4,\"Llegada de smite\" **NUEVO MOBA 3RA PERSONA!**\nHasta yo empece a jugar smite y que paso? Después de 1 año volví,ademas de que lo sigo jugando en la ps4\nLa llegada de nuevos juegos no significa el fin del lol,O sea el lol tiene muchísimos puntos positivos a comparación de otros\n\n{{champion:134}} **_~~xDeadxDeadx~~_**{{champion:203}}","replies":[]}]},{"poster":"Fenrito","date":"2016-06-21T16:23:06.227+0000","up_votes":1,"down_votes":0,"body":"Solo voy a agregar que el overwatch es pago, es obvio que va a haber menos trolls y flammers por que blizzard tiene mas control sobre las cuentas ya que una cuenta blizzard sirve para varios juegos pagos y no es rentable que te baneen.\n\nEn el lol solo se ven los llantos de los que comprar rp pensando que no los van a banear por flammer o trolls.\n\nLos ultimso cambios bajaron mucho el nivel de toxicodad base que tenia el juego, solo les falta acomodar algo las DynamicQ para que sea en verdad efectivo y no una forma cómoda se eloboostear amigos para que al menos llegen a oro y tengan la skin victoriosa anual","replies":[]},{"poster":"D Godyr Gates","date":"2016-06-21T11:55:54.363+0000","up_votes":1,"down_votes":0,"body":"Yo personalmente vengo con actitud de flamer hace como 1 mes (ya sea por feders, afk o por lo que sea) y ayer recibí mi ban de 14 dias\n\nTodo puede mejorar hermano, Riot labura y tiene los sistemas correctos para hacerlo.\n\nSolamente no hay que darle bola a los CryBaby repitiendo lo de youtubers.\n\nSaludos!","replies":[]},{"poster":"LagunaStein","date":"2016-06-21T00:38:48.633+0000","up_votes":1,"down_votes":0,"body":"Alguien quiere jugar Paragon , el lol esta lleno de gente toxica y muchos afk . RIP lol en cualquier momento.","replies":[{"poster":"Hellkus","date":"2016-06-21T01:36:44.706+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LagunaStein,realm=LAS,application-id=v7qsfXsE,discussion-id=vkOV5Qsl,comment-id=0015,timestamp=2016-06-21T00:38:48.633+0000)\n>\n> Alguien quiere jugar Paragon , el lol esta lleno de gente toxica y muchos afk . RIP lol en cualquier momento.\n\ntoda la razon","replies":[]}]},{"poster":"R0VeRg4lArG4","date":"2016-06-20T20:08:56.900+0000","up_votes":1,"down_votes":0,"body":"El overwatch no es el problema, el problema es el lol en si lamentablemente","replies":[]}]}