{"poster":"Dean Winchester","date":"2016-11-16T19:19:07.816+0000","title":"¿Qué pasó con con los login screens como los de Elise o Lissandra? :c","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"&iquest;Qu&eacute; habr&aacute; pasado con esos login screens en los que el campe&oacute;n que sal&iacute;a te contaba una historia? Como fue con la salida de Elise o de Lissandra. La verdad que a mi me gustaban mucho, de hecho yo empec&eacute; a jugar cuando estaba Elise en el login y siempre me quedaba escuchando lo que contaba. Quiz&aacute;s lo hacen con personajes muy importantes para la historia de LoL, como por ejemplo Lissandra, que ser&iacute;a la anunciante de la venida de los Vigilantes y la &uacute;nica hermana viva de las Tres Hermanas. Otro ejemplo sali&oacute; con Lucian, en el que pon&iacute;an una peque&ntilde;a cinem&aacute;tica que sinceramente era hermosa *-*... O como fue en el caso de Yasuo d&oacute;nde al principio mostraban tambi&eacute;n una especie de cinem&aacute;tica en donde mataba a un par de enemigos. Despu&eacute;s del login de Yasuo no vi m&aacute;s un login screen que llame la atenci&oacute;n :/ me gustar&iacute;a saber que ha pasado con eso, ya que estaba muy bueno. Por ah&iacute; un rioter de Latinoam&eacute;rica sabr&aacute; si es que lee el post, pero bueno, son decisiones de la empresa. En fin, gracias por su atenci&oacute;n. :D Ac&aacute; les dejo los enlaces a los logins si es que algunos no habr&aacute;n o&iacute;do escuchar de ellos...\r\n\r\nLissandra: https://youtu.be/6aPWBep5Sso\r\n\r\nElise: https://youtu.be/xbVCXP_HYhM\r\n\r\nLucian (latino): \r\nhttps://youtu.be/9EWUqptALSU\r\n\r\nYasuo (latino): https://youtu.be/2cD1JDphBpE","replies":[{"poster":"Ch3mitaTd3strosa","date":"2016-11-16T20:48:21.515+0000","up_votes":1,"down_votes":0,"body":"Ahora mismo como que Rito anda apagado con las ideas de Lore, están trabajando en el pero como que no es la prioridad, nada mas andan con conceptos pero no los quieren desarrollar, etc etc\nTampoco es como si a la mayoría de jugadores les importaba mucho la historia, lamentablemente.","replies":[]}]}