{"poster":"Cryo00","date":"2016-04-14T23:49:36.702+0000","title":"What if League had an Aghanim's Scepter ?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"For those of you&#039;ll who do not know, DOTA 2 has an item known as Aghanim&#039;s Scepter that upgrades an ability (usually ultimate) by giving it bonus effects or straight up increasing the damage it does.  \r\n\r\nhttp://dota2.gamepedia.com/Aghanim%27s_Scepter\r\n\r\nHere are my thoughts on if league got the item (or a similar one) as well\r\n\r\n{{champion:134}} : Spheres stay for 2 seconds longer and the sphere cap on her ultimate is removed.\r\n{{champion:37}} : Allies near her get all of her aura bonuses when she ults, it stacks with auras gained previously and any auras they will gain from her later. \r\n{{champion:99}} : Enemies near her or in her ultimate get blinded for 1-2 seconds when she ults. \r\n{{champion:40}} : Monsoon leaves behind a thunderstorm that damages enemies that walk into the AOE.","replies":[{"poster":"Meep Man","date":"2016-04-14T23:56:01.164+0000","up_votes":1,"down_votes":1,"body":"{{champion:432}} : Allies can now move and cast spells during Tempered Fate, but still have all the bonuses of Stasis.\n{{champion:136}} : Gain 3 additional stars.\n{{champion:115}} : Increase the range of Mega Inferno Bomb to become Global and the full damage is now applied in all of the area of effect.\n{{champion:68}} : Gain the Danger Zone effect 'Increase the damage and slow amount by 50%' on The Equalizer\n{{champion:33}} : Tremors now stuns enemies hit for 1/1.25/1.5 seconds. Can only happen once per cast.\n{{champion:27}} : Insanity Potion is now a passive stat boost.","replies":[{"poster":"Cryo00","date":"2016-04-14T23:59:14.841+0000","up_votes":1,"down_votes":0,"body":"All of them seem fine except the bard one, which seems a little busted. Aurelion's is up there too but not as bad.","replies":[]}]},{"poster":"Evewynn","date":"2016-04-14T23:50:59.874+0000","up_votes":1,"down_votes":0,"body":"Viktor once again getting his ideas stolen? Poor guy.","replies":[{"poster":"Cryo00","date":"2016-04-14T23:54:15.336+0000","up_votes":1,"down_votes":0,"body":"Well, you could give him the option to upgrade any of his abilities once more.....I don't play him enough to know what can work.....","replies":[]}]}]}