{"poster":"Fhyros","date":"2015-03-17T02:42:06.797+0000","title":"Subir primero la q o la e con yasuo?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Bueno como dice el titulo, cual se deberia subir al maximo primero, y si depende de la situacion, cuando se deberia subir cada una.","replies":[{"poster":"BackBlast","date":"2015-03-17T21:21:48.879+0000","up_votes":3,"down_votes":0,"body":"te conviene empezar con la E si estas vs un rango y con Q si estas contra un melle, a lvl 2 te subis Q o E dependiendo de que elegiste al comienzo, a lvl 3  un punto mas a la E, a lvl 4 a la W, y a lvl 5 le das un ultimo punto a la E para luego maxear Q primero. Es conveniente tener esos 3 puntos en la E para que tengas menos CD en la marca que les dejas a los enemigos entonces tenes mas movilidad y un poco mas de daño.\n\nOjala te sirva mi consejo.","replies":[]},{"poster":"FrankSk","date":"2019-06-03T14:17:38.174+0000","up_votes":1,"down_votes":0,"body":"es mejor que subas la E de primera, ya que te permite tradear y desplazarte más rapido. y evitar el cc o el daño consecutivo del enemigo, ya sea mele o a distancia.","replies":[]},{"poster":"lordeman10","date":"2015-03-17T14:51:01.990+0000","up_votes":1,"down_votes":0,"body":"subir primero la Q, facilita el farmeo, no vas a chasear nivel 1 es ridiculo, tambien sirve para pokear si el enemigo es meele\n\ny maximizar yo creo que tambien siempre debería ser la Q pero no uso el champ","replies":[]},{"poster":"Caraxes","date":"2015-03-17T04:23:17.586+0000","up_votes":1,"down_votes":0,"body":"Es cuestion de como juegues la linea y contra quien estes.\n\nPero por lo general, la E si pensas en pelear antes de lvl 6, Q si vas a farmear.","replies":[]},{"poster":"Lucrexio","date":"2015-03-17T03:06:56.624+0000","up_votes":1,"down_votes":0,"body":"LA Q! UAAAAAAAAAAAAAAAAAA!! KAME HAME HAA!!!","replies":[]},{"poster":"BitWares","date":"2015-03-17T02:59:02.379+0000","up_votes":1,"down_votes":0,"body":"Tienes que subir la Q primero, luego toda la E. Y si tienes un campeón con muchos skillshots ({{champion:99}} ,{{champion:103}}  ,{{champion:127}} , ETC) te recomiendo subir la W","replies":[]}]}