{"poster":"Estand","date":"2019-10-06T02:20:07.514+0000","title":"El botón de aceptar partida/rechazar partida se queda trabado","subforum":"Problemas Técnicos","embed":{"description":"Al dar aceptar se bloquea el interfaz. Puedes ver a los demás escribir, pero no es posible responder. También puedes escuchar las voces de los campeones cuando son bloqueados, como si tu bloquearas a cada uno de ellos. Finalmente sales de la selección sin haber elegido un campeón por lo que cuenta como abandono de selección esto puede incluir sanciones.","url":"https://youtu.be/nQQkEk2CdN0","image":"https://i.ytimg.com/vi/nQQkEk2CdN0/hqdefault.jpg"},"up_votes":6,"down_votes":0,"body":"Al dar aceptar se bloquea el interfaz. Puedes ver a los demás escribir, pero no es posible responder. También puedes escuchar las voces de los campeones cuando son bloqueados, como si tu bloquearas a cada uno de ellos. Finalmente sales de la selección sin haber elegido un campeón por lo que cuenta como abandono de selección esto puede incluir sanciones, pero el interfaz seguirá bloqueado hasta reiniciar el launcher.\r\n\r\nEsto ocurrió en una partida clasificatoria flexible.","replies":[{"poster":"Gałaad","date":"2019-10-06T17:45:53.958+0000","up_votes":1,"down_votes":0,"body":"Hey!\n\nSuena a problema de permisos. Bajo estas circunstancias yo me aseguraría de que el firewall tiene todas las excepciones del league of legends correctamente agregadas.\n\nEsta es una lista de las excepciones necesarias extraida de la pagina de soporte:\n\n> C:\\Riot Games\\League of Legends\\LeagueClient.exe\n> C:\\Riot Games\\League of Legends\\LeagueClientUx.exe\n> C:\\Riot Games\\League of Legends\\LeagueClientUxRenderer.exe\n> C:\\Riot Games\\League of Legends\\Game\\League of Legends.exe\n> \n\nUn saludo.","replies":[]},{"poster":"Lil Gonzo","date":"2019-10-06T03:08:14.210+0000","up_votes":1,"down_votes":0,"body":"me paso lo mismo hace unos dias, vi como todo iba con normalidad pero me seguia apareciendo el coso para aceptar o rechazar, cerre el juego y lo volvi abiri y ya no me volvio a pasar mas","replies":[]}]}