{"poster":"Neoburstx","date":"2016-07-22T13:18:37.803+0000","title":"Asedio al nexo: total decepcion","subforum":"Charlas Generales","up_votes":6,"down_votes":8,"body":"el modo de juego que vino a destronar al rey poro en cuanto a monotonia, muy aburrido\r\n\r\ncambien esa cosa por URF queremos URF","replies":[{"poster":"Kyousuke","date":"2016-07-22T16:04:10.044+0000","up_votes":2,"down_votes":0,"body":"pues sinceramente si me das a elegir urf o asedio ya estoy abriendo la tienda para comprar {{item:3631}} {{item:3634}}  XD \npersonalmente pienso que el modo es muy entretenido, estratégico y risas aunque le hagan falta algunos retoques en cuestión de daño. si lo pulen bien hasta me encantaría jugar ranked en ese modo por como es, es totalmente distinto a lo típico y me encanta aunque como siempre solo pickeen lo mas fuerte {{champion:51}} {{champion:222}} {{champion:105}} {{champion:110}} {{champion:23}} \npero sigue siendo muy buen modo y divertido","replies":[{"poster":"rokushoger","date":"2016-07-22T17:15:04.043+0000","up_votes":1,"down_votes":0,"body":"En realidad hay muchos campeones op en ese modo, eso es lo bueno, hay mucha más variedad que en otros modos. Irelia por ejemplo con la Q te baja oleadas a lo loco en early y te hace tremendo snowball. Malzahar te saca tremenda manada de bichos. Tham kench te devora un minion y le pega a todos los demás, y con el escudo de targon encima se cura a él y un compañero.","replies":[]}]},{"poster":"rokushoger","date":"2016-07-22T15:18:53.765+0000","up_votes":2,"down_votes":0,"body":"A mi tan mal no me cae este aunque se hace pesado luego de 2 o 3 partidas, y rey poro me encanta, irónicamente urf me aburre bastante.","replies":[]},{"poster":"Khimea","date":"2016-07-22T14:04:26.672+0000","up_votes":2,"down_votes":0,"body":"Creo que dijeron que no hay mas URF hasta el año que viene.\nYo estuve totalmente comodo con este sistema de juego y eso que no soy de jugar estos modos.\nSolo jugue URF 2 veces y este lo llegue a jugar hasta 5.\nUno de los pocos modos de juego que me gustan. (solo me gustan 2, URF y este nuevo)","replies":[]},{"poster":"SHAKKAswaglife","date":"2016-07-22T14:27:35.512+0000","up_votes":1,"down_votes":0,"body":"no esta malo el modo lo que si podrían arreglar algunas cosas nada mas, y ¿acaso crees que riot no sabe que quieres urf? ellos solo lo hace para que  cuando lo pongan juegues con unos ánimos tremendos y cuando no este te desesperes todo el año hasta que lo pongan de nuevo :V","replies":[]},{"poster":"FalskBild","date":"2016-07-22T14:02:24.744+0000","up_votes":1,"down_votes":2,"body":"URF!!! hasta cuando jodiendo el lol que no entienden lo que la comunidad quiere....","replies":[{"poster":"natutivo","date":"2016-07-22T14:12:42.570+0000","up_votes":1,"down_votes":1,"body":"lo entienden, es por eso que nos lo hacen desear por que son crueles","replies":[]}]}]}