{"poster":"Genocyborg","date":"2015-11-04T22:06:19.850+0000","title":"Maestria muy op para la nueva Ashe.","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"Bueno gente esto quizas algunos lo sabran otros no, es mi aporte para que puedan sacarle el mejor provecho a la nueva Ashe, la cual de por si ya todos sabemos que esta op.\r\nLa cosa es as&iacute;, me gusta mucho jugar Trynda y  me di cuenta por error una vez que si le pongo a ashe (la esposa del tryndamacho) las maestrias de trynda se vuelve super op, por esta maestria en especial: \r\nhttp://es.mobafire.com/images/mastery-s4/frenes.png\r\nFrenes&iacute;:\r\nLos golpes cr&iacute;ticos otorgan un 5% de Velocidad de Ataque durante 3 segundos (el efecto se acumula hasta 3 veces)\r\nComo la nueva pasiva de Ashe es que todos los aa (si ya estan realentizados por la pasiva o la w) van  a ser crits, esto quiere decir que el segundo critico ya va a darte un 10% de velocidad de ataque y el tercero un 15%\r\ny esto equivale a empezar con una http://ddragon.leagueoflegends.com/cdn/5.21.1/img/item/1042.png (daga)\r\nademas de los items que te compres.\r\nademas de que durante todo el game un 15% de AS nunca viene mal.\r\nBueno eso nomas a algunos que no lo sabian les puede venir bien yo lo descubri hace poco y me di cuenta que poca gente usa esa maestria con ashe (por no decir casi nadie).\r\nAbrazo!","replies":[{"poster":"Genocyborg","date":"2015-11-04T22:33:16.825+0000","up_votes":1,"down_votes":0,"body":"yo no sabia.. y mucha gente que vi usarla hasta streamers o guias no la usan la maestria, en fin si no les sirvio, pasen de largo!","replies":[]},{"poster":"LastxJoke","date":"2015-11-05T00:03:39.841+0000","up_votes":1,"down_votes":1,"body":"Lo que pasa cuando jugas con Internet Explorer...\nPero felicidades por darte cuenta!","replies":[]},{"poster":"Kyousuke","date":"2015-11-04T22:29:44.905+0000","up_votes":1,"down_votes":1,"body":"todo el mundo lo sabia XD y todos la usan.\nigualmente ahora la van a cambiar y ya no van a ser críticos sus golpes van a causar daño extra pero no críticos, en su lugar los críticos van a meter un slow doble","replies":[]},{"poster":"Tryhard X","date":"2015-11-04T22:29:10.137+0000","up_votes":1,"down_votes":1,"body":"Jajaja me muero!\nHace cuanto jugas?\nTodos los adc llevan un punto ahi!","replies":[]}]}