{"poster":"Panzerbjorn91","date":"2014-08-31T03:18:35.133+0000","title":"Ranked csapatot keresek","up_votes":1,"down_votes":0,"body":"Űdv! Ranked csapatot keresnék jelenleg silverben vagyok tőlem független okokból! 4 éves lol tapasztalatom van, össze hős megvan mindet ismerem és a jó részüket használni is tudom, ha lenne egy olyan ranked csapat aki esélyt adna az EUNE ugyan ez a név alatt meg talál","replies":[{"poster":"VampVik","date":"2014-09-01T14:43:40.607+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mi nemrégiben alapítottunk egy csapatot. 5-en vagyunk benne, 1 ezüst, 3 goldos, és az 5. tag pár napja már platinás. A csapat célja, hogy összekovácsolódjon és a későbbiekben versenyekre is mehessen. Sajnos sokszor csak 4-en vagyunk fent és ezért nem tudunk játszani meg gyakorolni.\nHa érdekel úgy a dolog, hogy tartaléknak veszünk be (azaz amikor mind az 5-en fent vagyunk akkor az alapítók játszanak, ha meg nem akkor te is, illetve versenyre akkor jöhetsz velünk ha valaki nem ér rá) bevehetünk 6. tagnak. \n\nSzóval ha jönnél így is vedd fel és írj rá Viasco-ra (ő most a csapatmanagger) és szólj neki, hogy VampVik ajánlásával beállnál közénk.","replies":[{"poster":"Panzerbjorn91","date":"2014-09-02T12:45:59.860+0000","title":null,"up_votes":1,"down_votes":0,"body":"rendben és köszönöm a lehetőséget előre is","replies":[]}]},{"poster":"Zooty","date":"2014-08-31T07:15:00.884+0000","title":null,"up_votes":1,"down_votes":0,"body":">silverben vagyok tőlem független okokból\n\nMindig van valami kifogás:D\nUgyan mi lehet az a tőled független ok?","replies":[{"poster":"Panzerbjorn91","date":"2014-08-31T10:39:06.888+0000","title":null,"up_votes":1,"down_votes":0,"body":"meccsek 50% afkert kapok vagy még gyakrabban a csapatból 3 fel feedelik a saját posztjukat azt meg nem tudom support ként lehozni főleg hogy sokszor oda kényszerítenek de amúgy is ha már 2-3 embert el feedelnek azt hozza már le nekem valaki -.-'. De valahogy számítottam erre a kérdésre és az a vicc mindenki csak a ligát nézi és senki se azt hogy az elittő hogy játszik.","replies":[]}]}]}