{"poster":"N 4","date":"2015-09-03T08:01:56.187+0000","title":"Diamond 1+ Team LF serious coach or analyst","subforum":"Team Recruitment","up_votes":1,"down_votes":0,"body":"Hey guys,\r\nI&#039;ve put together a ranked 5s team consisting of players who are Diamond 1+ for Alura Gaming, our goal for this season is to make at least challenger and become known as a team. Our overall goal is to make it into the OPL.\r\n\r\nInformation the for analyst/coach:\r\n\r\nDo you have ts?\r\n\r\nAge:\r\n\r\nWhat previous experience do you have as analyst or coach:\r\n\r\nWhat can you bring to the team:\r\n\r\nAre you willing to watch majority of the major regions games to keep up with the meta and the current power picks:\r\n\r\nAre you also willing yo watch all our games live or through a reply if you can&#039;t make training:\r\n\r\nAny extra information about yourself that you think is Important:","replies":[{"poster":"Star","date":"2015-09-06T14:26:17.902+0000","up_votes":1,"down_votes":0,"body":"Do you have ts? Yes\n\nAge: 21\n\n**What previous experience do you have as analyst or coach:** For coaching experience, i ran one of the largest mentoring groups in OCE with 50+ people turning up every night, from bronze- diamond players. To be honest, my coaching experience could improve. \n\nI prefer the analyst position where I can assess plays, and instruct on mistakes/ positioning /plays /meta picks/ picks + bans. \n\nI was the analyst and coach for a couple of lower elo teams (1 diamond 5+, 2 plat + and 1 gold +), and as my experience in league has improved, so have the teams i've been the analyst for. Currently, i feel i'm ready to make the push to the super competitive team level.\n\n**What can you bring to the team:** Lots of experience, in lots of different situations. I've been playing League since season 1, and therefore I have a a good level of game knowledge to bring to the team. I've been watching all the tournaments and LCS  all through to season 4, and this year i took a small hiatus from league. I'm able to not only explain what plays went wrong, but also give insight into what could be improved into the future. \n\n**Are you willing to watch majority of the major regions games to keep up with the meta and the current power picks:** Yes, of course. Including OPL, EU/NA LCS etc.\n\n**Are you also willing yo watch all our games live or through a reply if you can't make training:** To be honest, for every game you lose, absolutely- perhaps 3 times over. For games were you crushed, i'm unsure if its worth taking the time out of watching other pro level games. \n\n**Any extra information about yourself that you think is Important:** I've kept all this information short and concise, to give you an overview. Obviously i've not included everything, and you should be able to get a gauge on if i appear interesting enough to go further with. I have played in the mid diamond league back in season 3 (when i was really aiming for diamond), but in the end, I wasn't mechanically gifted enough for high elo play- but i know I have the knowledge for the analyst position on a high elo team.","replies":[{"poster":"AS DLocker","date":"2015-09-19T04:20:57.195+0000","up_votes":1,"down_votes":0,"body":"Hi Star, \nAlpha Sydney is an organisation dedicated for competitive play and with the expansion into League, have started to recruit Diamond plus players for a new Ranked team. Currently, we are still in the trailing phase however is in need for an analyst. We will be happy to give you the opportunity to recruit you to the team and will get you acquainted with the players.\nIf you are interested in this offer, please add kumdozer1 in game (As his account is glitched on the boards) and we will go from there. Thank you very much for reading.\nAlpha Sydney","replies":[]}]},{"poster":"Tina Bear XO","date":"2015-09-07T17:27:46.411+0000","up_votes":1,"down_votes":0,"body":"í coached chiefs sign me up.","replies":[]}]}