{"poster":"Looter","date":"2015-06-07T16:50:49.085+0000","title":"Dühöngő","up_votes":5,"down_votes":2,"body":"A topic mag&aacute;&eacute;rt besz&eacute;l, ide mindenki j&ouml;het d&uuml;h&ouml;ngeni &eacute;s h&uuml;lyes&eacute;geket &iacute;rni.\r\n\r\n&Eacute;n kezdem.\r\n\r\nIRGUM BURGUM NAMOST AZT&Aacute;N MOCSKOS TRIBUNAL RITO PLZ H&Uuml;LYE FEEDEREK NEMIGAZ HOGY NEMLEHET NYERNI EBBEN A ROHADT J&Aacute;T&Eacute;KBAN AZ&Eacute;RT VAGYOK BRONZOS MER A CSAPATT&Aacute;RSAIM FEEDELNEK ADJATOK INGYEN RPT","replies":[{"poster":"Gavian","date":"2015-06-11T11:43:50.673+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hi!\n\n\nÉn most már teljesen fel vagyok háborodva azon, hogy megint \"alacsony prioritású várólistára\" kerültem. Az történ, a remek áramszolgáltató egy ideje pár másodperctől akár 1-2 percig tartó áramkimaradást tartalmazó szolgáltatást nyújt a pénzünkért.... és ez mind a 21. században a \"nyugati\" határnál  Sopronnál! Persze indokok sorait hallgathatod miért... ami végül is azt sugallja, hogy burkoltan leszarják a fejed...  őket nem érdekli a sok bosszúság, ami ez problémát okoz a háztartásban és a szórakozásban... csak fizesd feléjük a megadott határidőre a számlát vagy egyből jön a fenyegetőzés....\n\nNagyon bosszantó és még tetézi azt, hogy játszanák szabadidőmben és játék közben elmegy az áram... visszacsatlakozok, még megy a játék és szerencsére megnyertük. Amikor a főoldalra lépek, szépen megjelenik a figyelmeztető üzenet, hogy mostanában kilépésem és inaktivitásom miatt alacsony... hogy a jó anyukátokat.... főleg, hogy 20 perc és ez 5x20... na nekem ez munka mellett remek..... hazaérek munkából, majd szépen 20 perceket várjak, hogy egy kicsit majd játsszak ha van kedvem... de így 20 perces várólistában várjak? Ja és az is felháborít főleg, hogy kaptam már nem egy meccs után úgy inaktivitást jelző üzenetet, mert valaki reportolt és végig játékban voltam...\n\nKözbe elmentem egyet játszani és persze kiakadok ma ezen a pöcs riot játékon és akik játszanak... Katarina és Talon elkezdtek veszekedni ki legyen miden és Katarina a veszekedés közbe még benyögi, hogy \"surrender at 20 min\". Egy ideje ez nagy sláger lett sok játékos körében, hogy ha 20 perc alatt nem verjük be a másikat akkor feladjuk a meccset. Persze ez a meccs is kiegyenlített volt, el se értük a 20 percet és a csapatom feladta rajtam kívül 4-1 arányba a meccset. o.O pffff... mi a szarért játszanak az ilyenek? Persze, hogy kezdek kiakadni ezen a játékon... nem egyszer kezdték azzal, hogy 20 perc és surrender és volt hogy az ellenségnek már csak 2 tornya volt és mindenki halott az ellenfélnél, már csak a helyzetet kellett volna kihasználni, míg fel nem kelnek halálból... helyette az történt, hogy egyik benyögte 20 min pls surr és ment a válasz ok és 4-1 arányba feladtuk. És ez a full nyerő helyzetben feladás nem egyedi eset mostanában.... és ne akadjak ki ezen? és most is 20 percet vártam a pöcs várólista végett, majd le se játsszuk ezt a szar játékot, mert állandóan surrendert nyomnak a kisgyerekek... miért nem őket reportolják? Miért nem azokat a játékosokat reportolják, akik ténylegesen mindig rontják a játékélményt? Nem, inkább azokat reportolják, akik technikai hibából adódóan, vétlenül, önhibáján kívül \"lép\" ki a játékból. Na igen, még az is hozzátartozik, hogy az utóbbi 2 hónapban nem 1x a szar játék ledobált a szerverről és ezekért is kaptam üdvözlő üzeneteket... miért? Amikor nem is az én hibámból? Volt netem, nem volt semmi probléma, csak egyedül a riot game nem engedett még a játékba se visszacsatlakozni.. /vagy ha visszaengedett, akkor full nem ment a játék, nem tudtam vásárolni a boltba és nem tudtam mozogni, de mindenki mást láttam hogy mozog... xDDDD és még engem büntetnek érte. xDDD\n\nMég ragozhatnám a szart... de egy biztos, kezd elmenni ettől a  játéktól a kedvem... főleg, hogy még 4x20 perc várólista hátravan...\n\nKöszönöm pöcs RIOT!","replies":[]},{"poster":"S T U K I","date":"2015-06-09T12:41:26.319+0000","title":null,"up_votes":1,"down_votes":0,"body":"HOGY AZT A BÜDÖS ******* **** * ********* *********** ******    MEG AZT A JÓ ****** * ** *** * *** ** * ** ** ÉS NE FELEJTSEM KI AZT A TETVES ****** * ********** ** ** * * ** * ** * TÖRÖLJÉK RYZET\n\nsokkal jobb :3","replies":[]},{"poster":"Looter","date":"2015-06-08T09:04:07.860+0000","title":null,"up_votes":1,"down_votes":0,"body":"http://9gag.com/gag/aWWVYjA\n\nInstant ban ?","replies":[]},{"poster":"mactasmaister","date":"2015-06-07T23:19:02.504+0000","title":null,"up_votes":1,"down_votes":0,"body":"A ***** ***** ***** anyját az összes ******** ******* ! **** *******\n\nNa mostmar nyugodtan alszom :Dddd","replies":[]},{"poster":"NalamiHUN","date":"2015-06-07T20:00:39.648+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hogy Kha'Zix vagy Cho'Gath csókolna szájon mindenkit, aki nem tud soha normálisan viselkedni a játékban! ><","replies":[]},{"poster":"SS Enforcer","date":"2015-06-07T18:31:13.386+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hír vi gó:\n\nEZEK A FÖLDIEPERZABÁLÓ RETKES GOSUBOXBOX RIVEN/VAYNE MAINEK NÉZZENEK MAGUKBA ÉS SZÉGYELLJÉK KICSIT MAGUKAT AMIÉRT MÁSOK NEVÉVEL PRÓBÁLNAK FELVÁGNI MEG VILLOGNI, DE AMIKOR A FAROK MÁSIK VÉGÉN ÁLLNAK MÁR NEM AKKORA A POFÁJUK! HA KÉT FORINTOT KAPTAM VOLNA MINDEN EGYES ILYEN JÁTÉKOSTÓL JÖVŐ INZULTUSRÓL, MÁR MEGÉPÍTHETTEM VOLNA A SAJÁT ORSZÁGOMAT BELFÖLDI ANTARKTISZI KOLBÁSZBÓL! HOGY A NYELESGRÁNÁT VERJE KI A FOGATOKAT!","replies":[]},{"poster":"orgencs","date":"2015-06-07T18:12:10.490+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nekem a legutóbbi promóm elment azon, hogy az egyik meccsen kaptunk egy afk-t, ragequit persze, a másikon pedig a last pick azt mondta hogy ő akkor is midre megy, mert ő platina smurf, és így jungler nélkül bepickelte Annie-t. Na nem baj, legközelebb majd több szerencsém lesz! :D","replies":[]},{"poster":"Tetth","date":"2015-06-07T18:03:47.124+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ötletes, és nagyokat lehet röhögni a \"tavi rutyutyu\" kommenteken. Ritka hogy ilyesmi jól sült el de ez tetszik. :D +1","replies":[{"poster":"S T U K I","date":"2015-06-07T18:08:51.629+0000","title":null,"up_votes":1,"down_votes":0,"body":":D","replies":[]}]},{"poster":"1997Annie","date":"2015-06-07T17:50:15.555+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hát én nyugodtan írom inkább, mert én hozzá szoktam már. Megint olyan mecset mentem végig, ahol rajtam kívül csak a jungleres ért még valamit. Kedves bot lane afkoltak az első percekben. Jah igen. A leaver buster kb alig ér valamit. Mostanában annyi afkert kaptam, hogy az felháborító, néhányuk ragequiter volt. Én tudtommal értesítést kapnak azok a játékosok, akik általuk reportolt bajkeverők büntetést kaptak. Hát én még egyszer se kaptam olyat, pedig volt egy már élmény rontó kisgyerek akit reporoltam. Jah igen! Tegnapi meccsem: én és haverjaim unrankedek voltunk, kaptunk 2 bronzos srácot (egyik V). Enemy-be mi volt? Platina V, Diamond V.  Majd nem megnyertük a mecset, de végül egy elhibázott stratégia miatt vesztettünk. Mit írt be a platinás? Easy.... hát nem tudom mekkora pofa kell egy 55 perces meccs beírásához, hogy easy, de az enemy team fele toxic volt. (egyikőjük a csapatban mondta is, hogy volt gond velük, ahogy mi is tapasztaltuk) Balance rendszerről ne is beszéljünk. Ami még engem felháborít, nos igen...a feederek! Nálam egy ősrégi szabály: Ha nem tudod elverni az enemy-t, akkor deffeld a tornyot és várd a ganket, ha tudod. De persze kimetsz egy kicsit, de csak óvatosan. Nah ezek állandóan pusholtak és megölették magukat... egyszer én voltam a noob jungler, mert nem tudtam gankelni az állandóan pusholos ekko-nak (természetesen az ellenfele kapta a babysittet) és mondta a tejet a szájából, hogy topra se gankeltem egyszer se, ahha....csak legalább 5x, mert ott legalább a srácnak volt esze, hogy visszább húzódjon egy kicsit.\n\nLényeg, hogy a játék lassan teljesen élvezhetetlené válik, a feederel, a ragerel, az afkerek, és hozzátéve az all chatben magukat dicsősítő kisgyerekek miatt, mert tudtak játszani egy nagyon nem nehéz, de op karakterrel. Nem szoktam én véleményt osztani, de most már úgy éreztem le kell írnom.","replies":[]},{"poster":"mmateexd","date":"2015-06-07T17:40:42.239+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nerf Kata mert túl op és én nem tudok vele játszani de az idegesít ha más lehozza vele a gamet. Sosem tudok Ekkoval játszani mert mindig instalockolják vagy bannolják szóval report rito. Feedeltem miden mert a jungeles nem tudott gankelni pedig én pingeltem hogy a torony alatt van de ő nem jött. \n\nREKT KAPPA {{champion:115}}","replies":[]},{"poster":"S T U K I","date":"2015-06-07T17:39:55.383+0000","title":null,"up_votes":1,"down_votes":0,"body":"B+ :D Most mentem egy irgalmatlanul szar meccset, feederekkel, és erre feljövök ide és ez fogad :DDD Respect :D\n\nDe akkor már én is\n\nHOGY AZT A KÉNKÖVES MACSKAFÜTYÖLŐS PÁLINKA NYALDOSÓ SZENT ATYAÚRISTEN MEG A RETTENETES TAVIRUTYUTYU MINDENIT NEM HISZEM EL A SOK FEEDER KÖLKÖT ÁLDJA MEG ŐKET A MUZULMÁNOK ÁLTAL ELTERJESZTETT SZŰZ MÁRIA MIÉRT NEM TUDNAK JÁTSZANI AZ EMBEREK NORMÁLISAN AMIKOR ÉN  NYERNI AKAROK HOGY INKÁBB SZÁRADTAK VOLNA MEG A LEPEDŐN VAGY ANYJÁÉK MENTEK VOLNA MOZIBA IDE AZ INGYEN RPT","replies":[]}]}