{"poster":"CoBraxZeus","date":"2018-10-17T14:21:31.133+0000","title":"Honor fine stagione?","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Ma posso avere anche il bordo caricamento partita anche se ho l&#039;honot allo 0?","replies":[{"poster":"Linkimaru","date":"2018-10-17T14:26:29.217+0000","up_votes":2,"down_votes":1,"body":"No","replies":[{"poster":"CoBraxZeus","date":"2018-10-17T15:22:12.163+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Final Linkimaru,realm=EUW,application-id=MJVj50Jw,discussion-id=1rbcE28P,comment-id=0000,timestamp=2018-10-17T14:26:29.217+0000)\n>\n> No\n\nQuindi sono fottuto anche se ho fatto gold? bella merda riot","replies":[{"poster":"AHT0H","date":"2018-10-17T15:51:36.599+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=CoBraxZeus,realm=EUW,application-id=MJVj50Jw,discussion-id=1rbcE28P,comment-id=00000000,timestamp=2018-10-17T15:22:12.163+0000)\n>\n> Quindi sono fottuto anche se ho fatto gold? bella merda riot\n\nMa perché questo circolo infinito di flame?\nE' da sempre che la riot ragiona così. Sei antisportivo? Nessuna ricompensa. Ripeto da sempre.\nLa differenza con gli ultimi due anni è che nelle citate season hai una \"Barra\" per l'avanzamento della tua \"condotta in game\"; paradossalmente ora si hanno più possibilità di rimediare agli errori. Fino a tre anni fa funzionava così: \"Se prendi una punizione nei due mesi precedenti alla fine season, nessuna reward\". Oggi almeno la situazione è più dinamica e dipende anche da quanto giochi. Quindi magari puoi guadagnare quelle due/tre settimane di punizioni e rimediare giocando tanto. \n\nIn ogni caso, tolti i precedenti, perché pensi \"bella merda riot\"? \nC'è un regolamento che hai sottoscritto. Nel regolamento c'è scritto cosa puoi e cosa non puoi fare.\nPensi che flammare ti faccia vincere in barba al regolamento? Bene! La Riot si è più volte mossa per dimostrare che le partite giocate senza Flame si vincono più facilmente.\nNon credi alla Riot? Bene, credi allora a un semplice assunto che ti fa un laureando in Psicologia:\n\"Una persona sotto tensione e sotto stress tende a fare di meno rispetto le proprie reali capacità\".\nSe flammi qualcuno; quella persona non sarà mai invogliata a vincere, anzi, puoi prendere tre tipologie di persone:\n1) Gente che ti flamma a sua volta -> Partita persa perché due del tuo team invece di giocare pensano a scrivere\n2) Gente che ci rimane di merda -> Giocate con uno in meno, uno che darà il 40% di sé stesso in un game dove la maggioranza numerica si fa sentire molto più del Feeding\n3) Vieni mutato -> Probabile partita persa: Ehy, all'improvviso nessuno può più comunicare con te; pensi che con un team disorganizzato si possa vincere easy? Bene.\n4) La squadra avversaria è più scarsa -> Bonus, vinci! ma vieni reportato.\n\nE' così difficile da capire questo concetto?\nTi offendono? E 'sti cazzi, mutali o fregatene, non rispondere al flame. \n\nVuoi difenderti con la solita storia del \"Ah vbb io scrivo kys e vengo istabannato poi ci sta gente che fa 0/152165161615/0 e niente, riot merda!\"\nNemmeno questo regge; ci sono game di merda, ci sono giornate di merda; ci sono avversari che smurfano, ci sono champ che vengono outscalati. Non mi scorderò mai quel game dove al minuto 15 ero 0/8/1 con Riven. Venni instaflammato, ma a più riprese. Però ehy! quando vinsi il game al minuto 40 terminando con quadrupla e splitpush e finendo a 22/8/? nessuno si scusò per aver pensato che quel game lo stessi intando. La verità? Semplicemente non tutti quelli con lo score pessimo stanno intando.\nInoltre ricordati che un ladro non può difendersi davanti ad un tribunale dicendo: \"Ehy! c'è tizio che è ancora libero eppure ha ammazzato sempronio! Io MERITO di essere libero\"","replies":[]},{"poster":"sbepuz97","date":"2018-10-17T15:34:11.287+0000","up_votes":1,"down_votes":0,"body":"non è questione. è così da sempre, lo si sa da circa 4 mesi che bisogna essere almeno honor 2","replies":[]}]}]},{"poster":"Zarath Jedi","date":"2018-10-17T23:15:06.474+0000","up_votes":3,"down_votes":1,"body":"io un po' godo","replies":[]},{"poster":"DonSvenn","date":"2018-10-17T16:52:11.101+0000","up_votes":1,"down_votes":0,"body":"A saperlo mi sarei \" mutato\" la chat...Ho litigato 4 volte in 4 game sono sceso a 0 ... Ho creato l'account 2 mesi fa e sono in promo per p5.  Che peccato sarà per l anno prossimo allora","replies":[{"poster":"PannolinoAstuto","date":"2018-10-19T16:13:40.919+0000","up_votes":1,"down_votes":0,"body":"secondo me sbagliano sulla questione dei flame, o meglio siamo umani giusto? io penso che devi vedere i motivi per cui tu \"flammi\", cioè se sei uno che flamma sempre o che usa paroloni per sciocchezze allora per me te lo meriti . il ban intendo, ma per esempio io non prenderò reward perche 3 settimane fa ho perso la promo g5 perche avevo sugli ultimi 2 game avuto un top che ha iniziato a trollarmi pesante perche pretendeva un gank livello 3 ( non vi spiego il motivo per cui non potevo) ed ha iniziato a feedare il top arrivato a 0 8 0 in 12 minuti ha iniziato a feedare il midder avversario andando apposta a morire sotto la suo torre , al che ho iniziato a flammarlo , è vero , poiche diceva che era colpa mia bla bla bla .... e cosi via.... all ultima ho avuto afk l'adc dal minuto 5 e da li ho iniziato a tiltare male e a sbagliare tutti gank ecc e rispondevo ai vari messaggi un po aggressivo... questo si , comunque bannato per queste due partite( chat bloccata intendo), honore sceso sotto a 0 triste storia, a quanto pare per la riot se trolli o vai afk è meno grave di uno che risponde a provocazioni gg wp riot (ovviamente parlo di ranked , per me nelle normal puoi fare come ti pare ovviamente, manco ci sto a perdere tempo li)","replies":[]}]}]}