{"poster":"Nombre ofensivo","date":"2016-07-06T02:47:54.908+0000","title":"Un negativo si es tan amable? gracias","subforum":"Off-topic y temas personales","up_votes":2,"down_votes":15,"body":"Musica para leer esta maravilla de post\r\nhttps://www.youtube.com/watch?v=UmWMNi6vATY\r\n\r\nhttp://i.imgur.com/nyB22VY.jpg\r\n\r\nhttp://i.imgur.com/pqJlClV.jpg\r\n\r\n\r\nhttp://i.imgur.com/aF6QToO.jpg\r\n\r\nhttp://i.imgur.com/uosW49A.jpg\r\n\r\nAhora permitanme hablarles un poquito de mi Dios (tambi&eacute;n conocido como Monstruo de Espagueti Volador, Monesvol, Su Benevolencia, El Omnipotente, Barbudo Bonach&oacute;n, para la virgen) es una masa invisible voladora de espaguetis (hay quienes dicen que una Camisa de Flores), con dos alb&oacute;ndigas por ojos que est&aacute; parado detr&aacute;s de ti con un hacha esperando que hagas algo malo. Por desgracia, miles de doctrinas her&eacute;ticas como el Cristianismo han logrado que alguna gente (minor&iacute;as insignificantes) crea otra cosa.\r\nLos tiempos mozos del Se&ntilde;or\r\nSe sabe que Dios fue entrenado por Yoda en un desierto, donde fue instruido en los conceptos b&aacute;sicos de la fuerza: el empuj&oacute;n, caminar sobre el agua... Esas cosas. M&aacute;s tarde fue fichado por Don Sim&oacute;n con la intenci&oacute;n de transformar las aguas del Mediterr&aacute;neo en sangr&iacute;a, y as&iacute; extender la juerga pastafari a toda la gente del mundo, desde Santurce a Bilbao pasando por la Luna; no existen datos fiables al respecto de este &uacute;ltimo milagro, pero no ponemos en duda de su extenso poder.\r\nLuego tuvo que ir a Janguarts a aprender magia. Eran cosas sencillas al principio, como resucitar muertos, hacer volar tazas y dejar su huella en un campo de trigo de un lejano pueblo estadounidense.\r\nSus amplios estudios le dieron gran nombre en todos los campos conocidos y por haber. Le ofrecieron plazas de director en Harvard, el TEC de Monterrey, el Louvre y la Universidad de Tokio, despu&eacute;s de varias insistencias acept&oacute; el trabajo (en todas). \r\nLos 10 Verdaderos Mandamientos de Monesvol\r\n1- Amar&aacute;s a los tallarines y los piratas sobre todas las cosas.\r\n2- No me uses para resolver tus problemas.\r\n3- Santificaras la pirater&iacute;a.\r\n4- Santificaras todo alimento que contenga pasta de alg&uacute;n tipo, por sobre todo la sopa Maruchan y el ramen.\r\n5- Honrar&aacute;s a los videojuegos.\r\n6- No matar&aacute;s al menos que Yo en un sue&ntilde;o te lo ordene.\r\n7- No levantar&aacute;s falsos testimonios ni mentir&aacute;s, al menos que te convenga.\r\n8- Ten todos los deseos que quieras. En todo caso, no se te cumplir&aacute;n.\r\n9- No manden m&aacute;s cadenas, en especial, a m&iacute;, que tengo la bandeja de entrada llena de sus porquer&iacute;as, adem&aacute;s por culpa de estas tengo una vida de mala suerte, no encontrar&eacute; el verdadero amor, y esta noche a las 12 un fantasma aparecer&aacute; con un cuchillo y me matara...\r\n10- Honrar&aacute;s por encima de todas las cosas a todos y cada uno de los miembros de la Sant&iacute;sima Tetranidad.\r\n\r\n\r\n\r\nhttp://k38.kn3.net/taringa/4/D/D/A/2/D/vagonettas/F12.gif","replies":[{"poster":"choripancachondo","date":"2016-07-06T03:08:20.525+0000","up_votes":2,"down_votes":0,"body":"http://i.imgur.com/LOMV5MU.gif","replies":[]},{"poster":"efukt","date":"2016-07-06T02:50:10.424+0000","up_votes":2,"down_votes":0,"body":"Una sola cosa no más quería decirte, me agradó mucho tu post, en serio, es de lo más sensacional que he visto por el momento, es una obra de arte, sin exagerar, es algo que, a simple vista, podria haber sido hecho por el mismísimo Da Vinci, la genialidad que tiene se puede notar desde kilómetros de distancia, ni siquiera la peor de las malas lenguas podría decir que no nos encontramos ante una majestuosidad vista una sola vez cada mil años. No he visto en todos mis años de vida algo de esta magnitud, te provoca una sensación indescriptible, una alegria inmensa a pesar de no haber hecho acción alguna, un sentimiento raro de encontrar pero fantástico, al así como lo que se siente una brisa en un caluroso verano, o ver la alegría de un niño al abrir sus regalos de navidad, o simplemente estar con esa persona que tanto queremos. No hagas caso a las malas lenguas que critican sin cesar a cualquiera que no cumpla con absolutamente todas sus expectativas, solo creeme a mi y a todos aquellos seres que consideran y admiran a tan grandiosa obra de arte. Siempre va a haber personas que te van a decir que lo que hiciste no tiene valor, pero el secreto está en ignorarlas, esas personas darían lo que fuera por haber creado algo tan magnífico como lo que estamos viendo. Así como Dios en su infinita sabiduría creo a la humanidad, o así como un hombre enamorado crea un poema para expresar sus más profundos sentimientos, o como un pintor crea una obra de arte de algún tiempo que ni siquiera él conoce, así es como fue creado este post, de la misma forma. Puede parecer que estoy exagerando, repito, pero no esa así, ni de cerca, exageraría si dijiese que no me encuentro ante una creación admirable, increible, de una belleza de proporciones bíblicas. De hecho estoy tan encantado con semejante aporte que decidí escribir un poema al respecto, se titula \"mis ojos te lo agradecen\", aquí va: -\"Mis ojos te lo agradecen, ya que han sido acariciados, mis sentimientos te alaban, ya que han sido despertados, mi corazón te idolatra, porque lo has hecho bailar, y mi ser te dice gracias, por tan delicioso manjar, estaré esperando nuevamente, que me compartas tu alegría, aún en medio de la noche, o en el más radiante día, solo sigue creando hasta que las manos pesen, así te diré nuevamente, mis ojos te lo agradecen\"-. Espero que hayas disfrutado mi poema tanto como yo disfruté escribiendolo, te diría que lo disfrutes como yo difruté tu post, pero no creo que haya una situación en el mundo que se asemeje a tanta dicha. Para terminar siendo breve, te quería agradecer de corazón, uno en esta vida se encuentra con situacines que lo ponen de malas, piensa que no va a encontrar nada bueno en estos días y de repente se encuentra con algo así, es difícil decidir donde uno va a dejar sus puntos, y de hecho ya cansa denunciar la mayoria de los post que vé, siendo que muchos son creados por trolls y personas con ganas de molestar, nada que ver con lo que estamos observando, aquí uno piensa todo lo contrario, simplemente lo vé y se dice a si mismp \"no debe haber lugar en esta tierra, ni en el cielo ni en el inframundo, ni en otros planetas, galaxias o universos donde sea mejor dejar mis puntos, he encontrado la verdadera Atlantida, aunque no sea un lugar físico, su simple belleza es suficiente para no titubear en hacer dicha comparación\". A veces me pregunto cuanta destreza o cuanta habilidad hace falta tener para poder realizar una creación de esta índole, a veces me comparo con los creadores de hermosuras como esta y pienso que no soy si quiera un simple ser humano, al lado de dichos creadores me siento como una hormiga frente a un impotente elefante, como un peón al lado de una reina, como un niño frente a un super héroe de esas historietas que tanto gustan leer. A veces veo al cielo y pregunto \"¿podré yo crear algo que, al menos, pueda compararse con este post?\" \"¿podré algún día ser tan genial, tan creativo y talentoso como el creador de esto?\" \"¿que debe hacer uno en esta vida para conseguir tanta genialidad?\" pero por mucho que pregunte y pregunte, jamas consigo respuesta. Sueño a veces que despierto y delante de mí, junto a mi cama, se encuentra un post como este, pero en mi sueño el post tiene algo diferente, el creador soy yo. Sí, se que parece una locura, algo tan glorioso como esto no puede ser creado por un simple ser como yo, pero no hay que olvidar que se trata solo de un sueño. Si pudiera pedir un deseo, ese sería que este post jamás saliera de la home, que las futuras generaciones puedan observar su magnificencia y llenarse de dicha con lo que ven, llenarse de felicidad, de locura, de pasión... Si todos los post del mundo fueran como este, no habría guerras, no habría dolor, olvido, tristeza. Levantaríamos la cabeza y entonando en un canto al unísono, cual coro de arcángeles diríamos: \"yo creo en el mañana\".","replies":[{"poster":"Nombre ofensivo","date":"2016-07-06T02:54:02.893+0000","up_votes":2,"down_votes":0,"body":"ah asi que vos tambien tenes ese copy/paste?","replies":[]},{"poster":"juuby","date":"2016-07-06T03:05:03.046+0000","up_votes":1,"down_votes":0,"body":"y pensar que me lo leí todo","replies":[]}]},{"poster":"Ks Erwyn","date":"2016-07-06T12:26:14.036+0000","up_votes":2,"down_votes":1,"body":"Ya ni me molesto en leer tus mier&%s","replies":[{"poster":"Caipirinhã","date":"2016-07-06T16:52:29.185+0000","up_votes":1,"down_votes":0,"body":"Despidase de foreros, no queremos flamers :*","replies":[]}]},{"poster":"rokushoger","date":"2016-07-06T11:42:20.375+0000","up_votes":1,"down_votes":0,"body":"http://vignette2.wikia.nocookie.net/es.warhammer40k/images/4/47/Le%C3%AD_Todo..._Mentira.gif/revision/latest?cb=20120321202729\nhttp://i0.kym-cdn.com/photos/images/newsfeed/000/103/740/Me%20Gusta.png?1318992465\nhttp://www.troll.me/images/darth-vader/as-you-wish-my-master-as-you-wish-my-master-as-you-wish-my-master-thumb.jpg\n\nTome su negativo.","replies":[]},{"poster":"KarmaUnder","date":"2016-07-06T02:59:15.254+0000","up_votes":1,"down_votes":0,"body":"JAJAJAJAJ ELLOS TOMAN RINDE 2 JAJAJAJAJAJAJAJAJ QUE HIJO DE PUTA, TE ROBO LA IMAGEN XDD","replies":[{"poster":"FedecarboneroUY","date":"2016-07-06T05:10:04.990+0000","up_votes":1,"down_votes":0,"body":"es buenísima jaja, nunca pense que el Rinde 2 fuera argentino XD","replies":[]}]}]}