{"poster":"Kazoh","date":"2016-07-23T12:27:48.754+0000","title":"Warum immernoch \"nur\" 10 Free-to-Play Champions ?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo Riot und Community,\r\n\r\nIch spiele das Spiel nun seit Ende Season 1, und seit je her war es immer so das es 10 Frei spielbare Champs in jeder W&ouml;chentlich aktualisierten Rotation gab. Nur kamen &uuml;ber die Jahre &uuml;ber 100 Champions in die Kluft, und immernoch sind wir in der Evolution dabei h&auml;ngen geblieben zwischen 10 Champions w&auml;hlen zu k&ouml;nnen?\r\n\r\nIch Frage mich warum ist das so? Wenn ich Arbeitskollegen oder Freunden empfehle das Spiel mal zu testen, schauen sie rein und sind von der komplexit&auml;t des Spiels &uuml;berw&auml;ltigt. Und wenn sie doch mal reingefunden haben waren sie mit der Vielfalt an Champions &uuml;berfordert und es dauerte Monate jeden Champ einmal gespielt zu haben.\r\n\r\nVielleicht macht ihr da mal was oder vielleicht auch nicht, ihr werdet eure Gr&uuml;nde daf&uuml;r haben. \r\nMich w&uuml;rde allerdings mal die Meinung der Community dazu intressieren.\r\n\r\nGru&szlig;\r\nKazoh","replies":[{"poster":"Cayce","date":"2016-07-23T17:32:51.054+0000","up_votes":2,"down_votes":0,"body":"Man muss am Anfang auch nicht jeden Champ gespielt haben, hatte bis heute nicht die Lust das zu tun (gerade das Attraktivitätslevel von Bruisern ist für mich bei -10). Solange man vorher irgendwas in Richtung RPG gespielt hat, kann man, relativ schnell sehen, welche Champions für einen im Groben interessant sind. Jemandem, der in (MMO)RPGs bevorzugt Magier spielt, wird man wohl keinen Olaf empfehlen. Leute, die in alles gerne reinschnuppern, haben natürlich Probleme, das haben sie ja aber nicht nur in Lol (wenn man in nem MMORPG andauernd einen neuen Charakter erstellt, weil man jede Klasse ausprobieren möchte, wird man dem, der direkt, oder beim zweiten Versuch seine Klasse gefunden hat, auch hinterhängen.)\n\nIch denke nicht, dass eine Erhöhung der Free Champs so viel Sinn machen würde, wenn man einen Champion interessant findet, hat man die IP in der Zeit in der man wartet, auch zusammen, auch kann bei High Skill-Cap Champs, gerade auf Low Level nur schwer einschätzen, ob der Champion einem nicht doch Spaß machen würde. Bei einer IP-Erhöhung, zumindest für neuere Spiele, würde ich jedoch nicht widersprechen.","replies":[]},{"poster":"Schesam","date":"2016-07-23T13:44:40.065+0000","up_votes":2,"down_votes":0,"body":"10 Champs haben nen SInn: Es sind immer 2 potenzielle Top und Midlaner, 2 Jungler, 2 ADCs und 2 Supporter drin. Die F2P rota soll nur ermöglichen, selbst ohne Champs selber zu besitzen 2 Teams aufstellen zu können","replies":[]},{"poster":"Aenrikr","date":"2016-07-23T12:35:59.913+0000","up_votes":2,"down_votes":0,"body":"Tjaaaa, was will man machen, das Spiel wächst halt ^^\nAber das ist nicht unbedingt ein Problem.\n\nEben weil es so viele Champs gibt, sind davon immer nur 10 gleichzeitig free to play.\nDamit wird die Überbelastung für neue Spieler vermieden ^^\n\nDer Rest ist halt \"Entdecken im Laufe der Zeit\" ^^\nIch bin ja jetzt seit Season 3 oder so dabei und habe noch lange nicht alle Champs selbst gezockt.\nDa ist noch jede Menge unbekanntes und das ist toll so, das hält die Langzeitmotivation aufrecht ^^\n\nAlso, ich find das System optimal so.","replies":[{"poster":"Ritos Elo Police","date":"2016-07-23T17:57:48.087+0000","up_votes":1,"down_votes":0,"body":"Nicht komplett verkehrt aber :D\nfür ein competetives Spiel ist es Schadhaft nicht alle Champs spielen zu können. \nEinfaches Beispiel Spieler X hat das Potential zum Pro, fängt an, muss aber ewig lange spielen um sein komplettes Potential zu entfalten, weil er einfach nicht jeden champ gespielt hat, bzw gegen diese. Und man muss jeden Champ kennen damit man mit/gegen ihn spielen kann. \nDa hat Dota 2 die Nase definitiv vorne. \n#keinflameihrnasen","replies":[]}]},{"poster":"ChimeCollector69","date":"2016-07-23T13:49:55.033+0000","up_votes":2,"down_votes":6,"body":"Es spielt doch eh niemand normals. Also bringen die kaum was. Und selbst wenn man auf diese Champs angewiesen ist, weil man gerade anfängt, so kann man die 10 Champs in einer Woche kaum ausreichend spielen, wenn man wirklich alle spielen will und kann sich relativ schnell die Champs kaufen, auf die man lust hat.","replies":[]}]}