{"poster":"FallenDemonX","date":"2018-05-15T02:45:06.092+0000","title":"[Concepto de Campeon] Rovash, El Rey Olvidado","subforum":"Creaciones de la comunidad","up_votes":4,"down_votes":0,"body":"Hola a todos!\r\n\r\nHoy les traigo un concepto algo ligero. Mas basado en historia y con una jugabilidad simple pero que pens&eacute; podr&iacute;a ser divertida. Espero que les guste!\r\n\r\nCredito al artista &quot;Rotaken&quot;. No esta relacionado, pero ayuda a visualizar al champ.\r\n\r\nhttps://pre00.deviantart.net/d23f/th/pre/f/2015/193/c/f/crowknight_by_rotaken-d911lhc.png\r\n\r\n\r\nLore: \r\n\r\nOlvidado, desterrado, expurgado de los anales de la historia. Para algunos un destino peor que la muerte, para el antiguo rey vastaya, sin embargo, no pasa de una inconveniencia, quiz&aacute; incluso algo provechoso. En estos tiempos de crisis donde su gente, los vastayanos aviarios Lothlan, se ven amenazados con la extinci&oacute;n, un hombre de su resoluci&oacute;n y liderazgo es exactamente lo que buscan. \r\n\r\nHace siglos, poco antes de las guerras r&uacute;nicas, Rovash era un ni&ntilde;o especial. Fuerte, r&aacute;pido, astuto y con madera de l&iacute;der, todos lo consideraban lleno de potencial. El por su parte ten&iacute;a un gran amor por su tribu. Por aquel entonces los Lothlan estaban mejor conectados con la magia de Runaterra y no solo eran m&aacute;s fuertes, sino que tambi&eacute;n pose&iacute;an 2 alas, por lo que pod&iacute;an volar.\r\n\r\nFue as&iacute; como Rovash conoci&oacute; a los humanos. En una excursi&oacute;n con sus amigos, se posaron cerca de un templo Jonio para observar. Vieron como rezaban, como com&iacute;an, como hablaban y como se relacionaban con la magia. Mientras todos estaban impresionados Rovash se re&iacute;a de aquellos peque&ntilde;os y torpes seres con delirios de grandeza, sabiendo que nunca llegar&iacute;an a asemejarse a la gloria de los vastaya.\r\n\r\nPero quer&iacute;a saber m&aacute;s. A lo largo de los a&ntilde;os viajo a mas asentamientos, cruzo el oc&eacute;ano y vio las naciones nacientes y los imperios ca&iacute;dos. Los bastiones majestuosos y las aldeas empobrecidas, las bibliotecas y las prisiones, el arte y las pestes, vio a los humanos en todas sus formas y facetas, sus virtudes y sus faltas. Cuando volvi&oacute; de sus viajes, era un hombre cambiado, su coraz&oacute;n hab&iacute;a desarrollado un sentimiento una vez ajeno, pero ahora profundo y ardiente: Odio. Rovash no sol&iacute;a tener miedo de nada, pero ahora no solo tem&iacute;a por su tribu, pero tambi&eacute;n sent&iacute;a desprecio absoluto hacia la humanidad, para el eran una especie ca&oacute;tica y sin prop&oacute;sito, criaturas que jugaban con el mundo natural como si fuera su derecho. Las guerras r&uacute;nicas confirmaron sus miedos.\r\n\r\nAnte la crisis que se avecinaba, los Jonios buscaron en su propia tierra los recursos para sobrevivir, pero los vastaya se rebelaron. Nacidos de la magia, las tribus vastaya repelieron los invasores con su poder y con consideraci&oacute;n de sus vidas, obligando a los Jonios a ser mas agresivos. Cuando los vastaya comenzaron a caer, Rovash vio la oportunidad de hacer que su gente reaccionara. En una fat&iacute;dica batalla, lidero un peque&ntilde;o escuadr&oacute;n que cayo con impunidad sobre los generales enemigos, decapit&aacute;ndolos son sus alas afiladas como espadas y sus garras desnudas. En las batallas por venir, todos contaban con su liderazgo sin importar su estirpe, pronto lo ver&iacute;an como no solo el l&iacute;der de los Lothlan sino el de todos los vastaya de Jonia. \r\n\r\nPero incluso despu&eacute;s de expulsar a los invasores, Rovash no estaba satisfecho. Los humanos de Jonia eran solo el comienzo, en Runaterra exist&iacute;an muchas tribus vastaya bajo la amenaza de las guerras humanas. Adem&aacute;s, ning&uacute;n humano deb&iacute;a quedar sin conocer su garra de acero. La ofensiva de Rovash se convirti&oacute; en una campa&ntilde;a continental para destruir a las naciones en guerra. Se hizo de una armadura negra para combinar con su plumaje, una m&aacute;scara de cuervo, se reforz&oacute; las garras con lunaplata y forjo una espada larga de acero Jonio. Su visi&oacute;n y sus armas infund&iacute;an miedo sobre los corazones humanos, el cuervo se convirti&oacute; en s&iacute;mbolo de ruina y muerte, aun marcado en la mente de sus culturas hasta hoy en d&iacute;a. \r\n\r\nEl ahora rey se embriagaba cada vez m&aacute;s en su odio e ira. Cuando los pueblos que lideraba se dieron cuenta de los mismos sentimientos surgiendo en sus propias almas, se sintieron alienados. Ya no estaban defendiendo a su especie, estaban provocando un genocidio. La campa&ntilde;a por la salvaci&oacute;n fue revelada por lo que realmente era: una cruzada asesina por la hegemon&iacute;a vastayana. La propia magia de Jonia, como si reaccionase ante la furia de Rovash, estaba decayendo. Las runas de la guerra consum&iacute;an la poblaci&oacute;n y desestabilizaban su capacidad de asimilar magia, corrompiendo las generaciones futuras. Estaba claro que la situaci&oacute;n se hab&iacute;a salido de control hace ya mucho tiempo.\r\n\r\nEn secreto, las tribus se reunieron para derrocar al rey loco. Rovash se vio asaltado en sus aposentos por su gente. Su capacidad guerrera le permiti&oacute; contraatacar, pero su sed de sangre que tanto lo motivaba no le serv&iacute;a en este caso. Traicionado, malherido y con el coraz&oacute;n roto, huyo en la negrura de la noche, sin saber que su asesinato solo era parte del plan. El da&ntilde;o que hab&iacute;a hecho era irreparable, pero al menos se asegurar&iacute;an de que nadie asociase a los vastaya con sus atrocidades ni que alguien m&aacute;s se inspirase en su legado. Su nombre, sus logros y las escrituras sobre el fueron expurgadas, sus lealtades e incluso sus hijos asesinados y sus propiedades y los edificios erigidos en su nombre fueron reducidos a cenizas. \r\n\r\nLos siglos pasaron, los pocos que recordaban al rey hab&iacute;an muerto hace a&ntilde;os sin mencionarlo a las generaciones siguientes. Las tribus quedaron decadentes sin saber porque, los j&oacute;venes despiertan en un mundo de humanos que los exilia y se muere frente a sus ojos. Nadie siente rencor a los humanos o a otras tribus, simplemente parece sentido com&uacute;n no querer el conflicto. Pero se est&aacute; volviendo imposible ignorar la degradaci&oacute;n de Runaterra y los huecos en la historia que gener&oacute; el evento. Desde la bruma del tiempo, la sed de revoluci&oacute;n se est&aacute; implantando en la mente y coraz&oacute;n de algunos, incitando a la curiosidad y la violencia.\r\n\r\nNadie sabe qui&eacute;n es la figura oscura que se planta ante los j&oacute;venes vastayanos a lo largo del mundo. Un Lothlan como ning&uacute;n otro, m&aacute;s alto, m&aacute;s animalesco y con un par funcional de alas negras. Dicen que crepita energ&iacute;a arcana, dicen que habla de c&oacute;mo encontr&oacute; la forma de vivir por siempre. Habla de acci&oacute;n, de salvaci&oacute;n, de retomar lo que se le fue arrebatado a su especie. Algunos m&aacute;s sagaces notan su semblante de melancol&iacute;a y lo cuestionan, el extra&ntilde;o se r&iacute;e y dice que no tiene rencor o remordimientos, asegura que desde el mundo espiritual los que lo traicionaron ahora se arrodillan ante el al ver no solo que fallaron, sino que &eacute;l tuvo raz&oacute;n todo este tiempo.  \r\n\r\n\r\n ****\r\n\r\n**Pasiva: Supremac&iacute;a Marcial.**\r\n\r\nAl golpear a m&aacute;s de un campe&oacute;n enemigo con una habilidad reduce el enfriamiento de las dem&aacute;s habilidades b&aacute;sicas (no definitivas) en un 20/30/40/50% (seg&uacute;n nivel de ult) por enemigo impactado y otorga un stack que dura 3 segundos y restaura la duraci&oacute;n de las anteriores. Matar unidades tambi&eacute;n otorga un stack.\r\n\r\nLas habilidades b&aacute;sicas consiguen bonificaciones por cada stack.\r\n\r\n\r\n****\r\n\r\n**Q: Estocada Perforadora**\r\n\r\nCoste: 60/65/70/75/80 de mana\r\nCD: 10 segundos\r\nAlcance: 400\r\n\r\nActiva: Se lanza a una direcci&oacute;n r&aacute;pidamente infligiendo 60/100/140/180/220 + (100% AD) de da&ntilde;o f&iacute;sico a todos los enemigos impactados.\r\nSupremac&iacute;a Marcial: Aumenta el alcance en 50 y el da&ntilde;o en un 5%.\r\n\r\n\r\n****\r\n\r\n**W: Plumas de Acero **\r\n\r\nCoste: 80 de mana\r\nCD: 14/13/12/11/10 segundos\r\nAlcance: 450\r\n\r\n\r\n\r\nActiva: Lanza una salva de 10 proyectiles en un cono, estos atraviesan a las unidades impactadas e infligen 40/70/100/130/160 + (50% AD adicional) por proyectil, cada proyectil subsiguiente inflige solo un 33% del da&ntilde;o, hasta un m&aacute;ximo de 80/140/200/260/320 + (100% AD adicional) de da&ntilde;o f&iacute;sico.\r\n\r\nSupremac&iacute;a Marcial: Aumenta el tama&ntilde;o del cono en un 10%. El da&ntilde;o m&aacute;ximo base aumenta en 40 puntos.\r\n\r\n****\r\n\r\n**E: Acrobacias**\r\n\r\nCoste: 100 de mana\r\nCD: 20 segundos\r\nAlcance: 300\r\n\r\nActiva: Se lanza en la direcci&oacute;n opuesta, haci&eacute;ndose imparable y golpeando a los enemigos enfrente con sus alas. Inflige 70/100/130/160/190 + (100% AD adicional) de da&ntilde;o f&iacute;sico a los enemigos impactados, as&iacute; como aquellos en su trayecto y ralentizando en un 40/45/50/55/60% decayendo a lo largo de 3 segundos.\r\n\r\nSupremac&iacute;a Marcial: Aumenta el ancho de la caja de impacto en 10.\r\n\r\n****\r\n\r\n**R: Hoja Furiosa**\r\n\r\nCoste: 100 de mana\r\nCD: 100 segundos\r\nAlcance: Propio\r\n\r\n\r\nActiva: Durante 5 segundos, sus pr&oacute;ximos 3 ataques b&aacute;sicos obtienen 40/80/120% de velocidad de ataque adicional y poseen efectos adicionales. Cada golpe otorga 1 stack de Supremac&iacute;a Marcial. \r\n\r\n1er y 2ndo: Golpea en hendidura alrededor del objetivo principal, ignorando Ceguera. Todos los objetivos impactados reciben 100% AD de da&ntilde;o f&iacute;sico + 10/15/20% de la vida actual de los objetivos como da&ntilde;o verdadero.\r\n\r\n3er: Golpea con una estocada que inflige 120/140/160% AD como da&ntilde;o cr&iacute;tico y aturde por 1/1,3/1,6 segundos. \r\n\r\n****\r\n\r\n\r\nFrases:\r\n\r\nContra Noxianos: Lo que me gusta de ustedes es lo ejemplarmente imb&eacute;ciles que son, y de forma consistente.\r\n\r\n&iquest;Rinden culto a la fuerza? Bien, su brutalidad ser&aacute; su perdici&oacute;n.\r\n\r\nContra Swain: No eres digno de portar MI imagen&hellip; \r\n\r\n&iquest;Crees que voy a perdonarte por llevar mi semblante? Muy, pero muy en lo contrario&hellip;\r\n\r\nUn emperador humano, precisa un cuervo demonio para ejercer su visi&oacute;n. Absolutamente penoso. \r\n\r\nContra Ascendidos: &iquest;No te parece gracioso que un humano ascendido se vea como un vastaya?\r\n\r\n\r\nContra Demacianos: Tienes. Cero. T&eacute;cnica.\r\n\r\nUna sociedad basada en el odio hacia la magia&hellip; est&aacute;n pidiendo que los mate a todos.\r\n\r\n&iexcl;&iquest;Petricita?! &iexcl;&iquest;Usan petricita en sus construcciones?! &iexcl;Ya est&aacute;! &iexcl;Todos al pozo!\r\n\r\nContra Zed: No tienes idea de lo muerto que estas. \r\n\r\nTu&hellip; tu ser&aacute;s el primero en morir.\r\n\r\nContra Xayah: Interesante &iquest;Podr&aacute; ser&hellip;? No. No tendr&iacute;a sentido. Olvida lo que dije.\r\n\r\n&ldquo;El cuervo violento&rdquo;, otra raz&oacute;n para creer que estoy en lo correcto.\r\n\r\nHay cosas que van m&aacute;s ala de un legado escrito, simplemente hay realidades incuestionables.\r\n\r\nContra Rakan: Yo lucho por salvar a nuestro pueblo, tu luchas por una mujer&hellip; no cuestionare los resultados.\r\n\r\nHey, te entiendo. Una raz&oacute;n simple es m&aacute;s que suficiente.\r\n\r\nUn poco fr&iacute;volo, pero muy eficaz.\r\n\r\nLuchar por amor es la &uacute;nica raz&oacute;n por la que uno deber&iacute;a luchar.","replies":[{"poster":"rokushoger","date":"2018-05-15T11:47:12.733+0000","up_votes":3,"down_votes":0,"body":"La historia notable, me encantó, sinceramente.\n\nEl kit me parece que la pasiva está rotísima, pero lo demás me parece bastante correcto, salvo tal vez el \"imparable\" en la E.\n\nFelicitaciones! Es un campeón que definitivamente me gustaría jugar y ver en la grieta!","replies":[{"poster":"FallenDemonX","date":"2018-05-15T13:46:45.484+0000","up_votes":1,"down_votes":0,"body":"Si la idea era que el power budget estuviera en la pasiva. Lo del imparable es medio tentativo, realmente si esta de mas.","replies":[]}]},{"poster":"Nisinunglacert","date":"2018-05-16T00:36:27.040+0000","up_votes":2,"down_votes":0,"body":"Coincido con lo dicho por Rokushoger, una muy buena historia solo que el kit, aunque bien enfocado, no me termina de convencer. Sé que dijiste que era lo menos trabajado pero como es la parte que más me gusta analizar voy a hacerlo detalladamente:\n\n-  **P:** el valor porcentual medio alto para reducir CDs, tal vez poner un valor fijo por nivel (ej: 0,25/0,5/0,75/1s) sería más fácil. Lo otro que me imaginé es que tenga alguna fuente de velocidad de movimiento extra. Tal vez como un efecto pasivo en su R. Y algo que seguro se te paso... ¿Cuánto es el máximo de stacks? xD\n-  **Q:** sabiendo que tiene otro dash está bien en números. Creo que podría el buff que tiene en la R(solo el AS) al impactar la Q a campeones.\n-  **W:** cuando la leí me acorde de la W de Ashe/AA de Graves pero al ponerlo con la temática me parece que esta muy bien solo aclaría(por como soy yo) que las tira de afuera a adentro del cono con una animación similar a la R de Xayah pero mucho más rápida. \n-  **E:** Es la habilidad que más me gusta del kit solo tengo una sugerencia: que sea Target y el enemigo sufra un leve knockup(solo por temática). Eso aunque sea un cambio simple definiría mucho mejor el combo como asesino(Q+AA+W+2AA y remate con E para escapar). Daño por vida(al objetivo primario) le vendría muy bien para el uso que **yo** le imagino.\n-  **R:** Simplemente no me gusta, me imginaba un bossmode que le de mucho daño, o mejor aún, algún skill para debilitar y hacer engage al rival. No sé, te dejo algunas ideas: invisibilidad casi permanente(solo visible cuando hace daño), ignora Armadura y/o escudos, AA/Dash con ceguera, debilitamiento en área, ignorar colisiones, aumento muy grande de Velocidad de movimiento. Me gustaría darte un propuesta sólida pero tampoco lo tengo muy claro que puede ser, solo dejo algunas ideas.\n\nEn resumen me gusto mucho, está bueno que te hayas puesto a hacer conceptos más seguidos. Yo me cuelgo y cada vez los pospogo más y más. Además tuve unas semanas medio complicadas y dormí mucho, lo que no ayuda a que tenga tiempo xD.","replies":[{"poster":"FallenDemonX","date":"2018-05-16T01:23:06.827+0000","up_votes":2,"down_votes":0,"body":"Este concepto lo hice en, que... ¿4 horas? lo hice un poco basado en los corvianos del primer DLC Dark Souls 3, tambien conocidos como \"DEJA DE MOVERTE BICHO HIJO DE PTAAAAAAAAAAAAAAA!!\"\n\nComo sea, la idea termino siendo \"Hare el bicho bien basico, pero que pueda efectivamente spamear skills\". Luego pense que seria divertido si fuese mas fuerte cuanto mas pelea. La idea no salio muy bien. Queria un luchador hyper movil, pero no estaba seguro de como hacerlo.\n\nNo hay mucho que añadir mas que algunos detalles:\n\nNo, no tiene cap de stacks. Simplemente me reuso a ponerlo. Lo de los resets si es bastante tentativo.\n\nIba a tener una pasiva de Move Speed fuera de combate, pero queria darle la defensa adicional. Quiza pude hacer algo con los stacks, que diera un escudo onda Morde.\n\nEscribí mala la ult. El chiste era que en caso de que no pudieses sacar los resets, la ult te los daria.\n\n\nDe cualquier forma es un concepto \"bocadillo\". Estoy trabajando en uno un poco mas interesante, solo que me trabe un poco y ademas queria contar la historia de Rovash. Este otro champ tenia un lore similar que no me convencía, asi que lo recicle para el. La base la tengo pero faltan detalles.\n\nGracias por comentar. Nos vemos!","replies":[{"poster":"Nisinunglacert","date":"2018-05-16T05:08:49.989+0000","up_votes":1,"down_votes":0,"body":"Bueno, espero tu próximo concepto. ¿cómo vas con el relato \"corto\" de Bhi'orax?\n¡Nos vemos!","replies":[]}]}]},{"poster":"firefox23","date":"2018-05-16T15:38:19.660+0000","up_votes":1,"down_votes":0,"body":"pensé que era el rey arruinado pero nel xd, lo que me dejo un poco perdido es el limite de la pasiva ya que seria muy abusador de linea si no la tiene y con la {{item:3070}}  seria muy espameable la Q con la E, solo eso, la historia me gusto, en las interacciones deberia estar ryze ya que si este champ nacio antes de las guerras runicas deberia conocer a ryze o saber su existencia\n{{sticker:slayer-pantheon-thumbs}}  ojala riot sacara este campeon :v","replies":[]}]}