{"poster":"FallenDemonX","date":"2015-04-11T04:39:53.928+0000","title":"Concepto de Campeon: Mivi, el epiritu corredor","subforum":"Creaciones de la comunidad","up_votes":1,"down_votes":1,"body":"Hola Foreros\n\nHace 1 día puse este concepto. Me basto con una respuesta para saber que estaba incompleto.\n\nAñadidos:\n\n-Nuevas escalas\n- Un par de mecánicas nuevas  \n- y… *redoble de tambor* CLARIDAD!!\n\n\n\n\nNombre: Mivi\n\nEspecie: Yordle (mas o menos)\n\nRecurso: Mana\n\n\n\nRol: Mago/Asesino\n\nLíneas: Jungla/Mid/Top (no, no es supp. Técnicamente nunca lo fue, pero esa suposición es culpa mía de cualquier forma).\n\nStats\nHP: 510 (85 por nivel)\t\t\tHP Regen: 6,5 (0,7 por lvl)\nMana: 290 (50 por nivel)\t\tMana Regen: 5,5 (0,9 por lvl)\nAD: 50 (3,5 por nivel)\t\t\tArmor: 27,5 (3 por lvl)\nAttack Speed: 0,7 (2% por lvl)\tRM: 30 (1,2 por lvl)\nMove Speed: 350\n\n\nHistoria: \n\nQuerido diario.\n\nHoy escale la montaña mas alta de Runaterra, me baje, la volví a subir y acabe luchando contra una víbora-dios-cosa rara que estaba durmiendo. Cosas casuales de la vida.\n\nA este punto he llegado. Ya recorrí todo el mundo; hice de guía, de mensajera, de mercenaria, fui al océano, camine por las nubes…\n\nPero eso tú ya lo sabes.\n \n¿Sabes qué pasa? Es esta capucha que llevo encima, este “Manto del Corredor”. \n\nPuedo ir donde quiera, vivir siglos, pelear con cualquier cosa, etcétera, etcétera. Al final te aburres, sientes que te estas pudriendo en vida.\n\nYa ni se lo que soy. Solía ser una yordle, menuda y peludita. Ahora soy una cosa alta, con patas como agujas y… ah! no tengo manos! Mis brazos son mangas! Debo admitir que es divertido, raro y aterrador, pero divertido.\n\nAhora que lo pienso, tu nunca estuviste en Bandle. Ni siquiera en Valoran.\n\nA pasado tanto tiempo, estas lleno de remiendos, te faltan paginas… todo envejece menos yo al parecer.\n\nY lo que envejece, cambia.\n\nDiario, es hora de volver a casa.\n\n\nPasiva: Caminos.\n\nEl espíritu corredor recuerda los pasos dados por todos nosotros y los usa en beneficio propio.\n\nMivi deja un par de huellas al moverse que duran 5 segundos. Estas son solo visibles para aliados o enemigos con visión verdadera. Si un aliado las pisa, Mivi obtiene un 5(1 por lvl) % de Velocidad de Movimiento adicional. Si las pisa un enemigo, Mivi también gana la bonificación pero reducida a la mitad.\n\nLos enemigos dejan un rastro de huellas que dura 2/3/4/5 segundos (niveles 1/6/11/16) y solo es visible si Mivi pisa una huella o la revela con Pasos Etéreos.\n\nAl entrar en combate o al usar Borrar Rastros, Mivi pierde la pasiva durante 15 segundos. Este enfriamiento no se empieza de vuelta al seguir infligiendo daño. \n \nQ: Borrar Rastros\nCosto: 70/80/90/100/110 de mana\nAlcance: 600\nCD: 15 segundos\n\nMivi decide eliminar sus huellas… y a todos los que las siguen. Mivi crea un fuego que describe una circunferencia a su alrededor (al límite del rango) infligiendo 50/70/90/110/130 (30% AP) (10% Move Speed) como daño mágico.\n\nSi toca una huella de Mivi estas crean una reacción en cadena que va borrando el rastro de huellas. Los enemigos pueden ser golpeados por las huellas que se queman, recibiendo un 5% de velocidad de movimiento de Mivi como daño mágico a lo largo de 5 segundos \n\nW: Pasos Etéreos\n\nCosto: 90 de mana\nAlcance(Saltos):200\nCD: 17/16,5/16/15,5/15 segundos\n\nMivi salta una distancia corta (no traspasan muros) 3 veces en dirección del ratón, cada salto deja una gran huella solo visible para ella. Al aterrizar, revela los rastros de huellas cercanos y deja una huella aun mayor.\n\nE: Alma de la Corredora\n\nCosto: 60/65/70/75/80 de mana\nAlcance (Area): 200 (Linea): 760\nCD: 10/9/8/7/6 segundos. \n\nPasiva: Después de usar 4 habilidades, la próxima hará que Mivi no posea penalización de movimiento al atacar durante 4 segundos. \n\nActiva: Mivi castiga a sus enemigos por interrumpir su carrera eterna, infligiendo 60/90/120/150/170 (20% AP) mas un 20% de su velocidad de movimiento como daño mágico a los enemigos que estén a su alrededor y en una línea larga en enfrente de ella. Además los ciega durante 2 segundos.\n\nR: Corredora Sigilosa.\n\nCosto: 100 de mana\t\nAlcance: Propio\nCD: 150/130/120 segundos\n\nMivi va adonde quiera y nada se lo impide. Tras canalizar por 1,5 segundos, Mivi se vuelve invisible y ella y sus huellas son inmunes a la visión verdadera durante 5/6/7 segundos. Se revela al infligir daño.  \n\nSi resulta dañada, pasa a invisibilidad normal por 1 segundo y luego la pierde completamente. \n\n\n\n\n\n\n\n\nQuiero saber si les gusta este concepto pls. Talvez cuando tenga tiempo subo un dibujo.\n","replies":[{"poster":"MrGameAndBug","date":"2015-04-11T05:51:23.070+0000","up_votes":1,"down_votes":0,"body":"Recuerdo que en NA habia una idea parecida con el concepto medio tron xD, Un corredor. Aunque está orientado a supp por lo que veo.\nSiento que los escalados están un poco altos, al menos en la q, para ser un supp, pega mucho xD.\nY siento que la pasiva es un poco inutil con la e. Dejarlas 5 seg creo que es poco, ya que para hacer daño necesitarias acercarte, o que te persigan, sería muy situacional, si no no harías daño. No sé realmente, pero si no funciona como se espera, podrías poner que para los enemigos dure más tiempo aunque se desaparezcan luego de los 5 seg si te están persiguiendo -Por ejemplo, si duran 10 seg, y te están persiguiendo, que ellos mismos las borren y que solo dure los 5 normales, para evitar que te vean. Pero si están por el mapa, dentro de los 10 seg, las podrías usar con la E-.\nBuen concepto!","replies":[]}]}