{"poster":"FallenDemonX","date":"2016-02-07T21:27:07.512+0000","title":"Quisiera consejos para llevar a Quinn.","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"{{champion:133}} es un champ que siempre me gusto y ahora con el rework me gusta aun mas, pero todavia no le agarro la mano.\r\n\r\n&iquest;Que objetos son mejores? &iquest;Como mejoro el combo de las 3 marcas? &iquest;Como maximizo el potencial de mi ult?\r\n\r\nGracias de antemano.","replies":[{"poster":"Krilin Noda Oro","date":"2016-02-09T06:41:23.289+0000","up_votes":1,"down_votes":0,"body":"No es dificil de usar, debes cuidar el no quedar mal posicionado luego de una E y aprovechar la movilidad que te da el AA con la marca.\n\nObjetos; \n{{item:3142}}   Con la de antes y la de ahora pienso que es el mas importante.\n{{item:3072}}   Antes solia armarle Rey arruinado pero actualmente veo una sanguinaria mas fuerte.\n{{item:3156}}   Generalmente vas a necesitar la Res.Mag.  y si antes era bueno ahora mejor.\n{{item:3139}}   Otro item generalmente util.\n\nLas botas berserk son recomendables solo si vas ADC en YOP y MID tienes mejores opciones, y si piensas llevarla ADC el {{item:3508}}  le viene muy bien por el CD junto al {{item:3094}} .\n\nMejorar las 3 marcas nose muy bien a que te refieres, pero incluso antes del rework se podia stakear 3 marcas con lo que ahora podria llegar a 4 de corrido pero no logra ser muy efectiva en la mayoria de los casos. El truco consiste en esperar a que la marca en tu enemigo este a punto de desaparecer ( cuando esto pasa la marca se resetea) entonces metemos el AA justo cuando la marca se esta reseteando con esto metes la pasiva y tu enemigo volvera a estar marcado.\nNo llega a ser muy util por que debes esperarlo hasta el ultimo momento de la pasiva y lo normal es que no te dejen reventarla, solo logre darle utilidad cuando escapaba ya que logras meter una contra mas fuerte de lo que esperan.\n\nMaximizar el potencial del ulti es estar atento al mapa, wards en campamentos de la jg enemiga, ayudar en los ganks con tu jg, tambien sirve bastante para splitpush y luego aprovechar una ventaja de 4v5 gracias a la movilidad.","replies":[]},{"poster":"josuke","date":"2016-02-07T21:51:59.234+0000","up_votes":1,"down_votes":0,"body":"para adc.\n\nrunas.\n\nquintas ad.\nsellos armadura.\nglifos resitencia magica y enfriamiento en total 3 de las ultimas\nmarcas velocidad de atacke.\n\nbuild\n\ncore\n\n{{item:3094}} {{item:3508}} {{item:3006}} \n\na gusto\n\n{{item:3142}} {{item:3036}} {{item:3071}} {{item:3085}} {{item:3812}} \n\nsituacional\n\n{{item:3102}} {{item:3026}} {{item:3156}} {{item:3139}} \n\n\npara top lo unico que cambia de la build es lo siguiente.\n\n{{item:3742}}","replies":[{"poster":"Mazer Rakham","date":"2016-02-07T23:47:32.906+0000","up_votes":1,"down_votes":0,"body":"Yo le agregaría no usar la ulti al pedo. Aprender a usarla en el momento adecuado y no para ir de base a torre más rapido, por ejemplo (si, lo he visto)","replies":[{"poster":"Ruphian","date":"2016-02-08T14:49:41.075+0000","up_votes":1,"down_votes":0,"body":"Que tiene de malo? Si esta en el top 5 de las ultis con menos cd, si no me equivoco.","replies":[{"poster":"Mazer Rakham","date":"2016-02-08T15:45:31.647+0000","up_votes":1,"down_votes":0,"body":"que tenga menos cd  noquiere decir que se use a cada rato hasta para matar minions.","replies":[{"poster":"Krilin Noda Oro","date":"2016-02-09T05:55:01.426+0000","up_votes":1,"down_votes":0,"body":"Para salir de base es bueno para no perder tiempo, usarla para farmear es tonto si la Q te ayuda a limpiar bien agregando que se acaba rapido el mana a lvl bajo.","replies":[]}]}]}]}]}]}