{"poster":"iChungiez","date":"2016-10-25T20:28:22.009+0000","title":"[6] Great tips to get out of low ELO!","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"[1] Honestly i would watch streamers and just observe how they play and maybe try to learn a new tip or trick. \r\n[2] Be positive and try not to push your teammates on tilt or they may end up getting confused or really sad and throw the game.\r\n[3] Dont blame people for your mistakes and think of what you could do to not replicate the same mistake\r\n[4] For lower ELO if there is a certain champion that you are really good at like mastery 5+ you could play or try to play normal games and unlock Champions in meta for a Champion pool. (Just in case of ban)\r\n[5] Try to focus on staying offensive and keep a clear mind or listen to music or try something that calms u down to stay off tilt (salt) \r\n[6] Try to help your teammates as much as possible and take opportunities when they are given to you Example: The enemy team gets aced and its 20 mins in game you should take baron or dragon. If this tutorial helped you i really love it if u shared with friends and be looking out for another guide.","replies":[{"poster":"Targons Blade","date":"2016-10-25T21:43:38.435+0000","up_votes":1,"down_votes":0,"body":"I recommend posting this to the [Gameplay Boards](http://boards.na.leagueoflegends.com/en/c/gameplay-balance), where it will get far more visibility and reach more players who may need these tips. :)\n\nLet me know if you have any other concerns.","replies":[{"poster":"iChungiez","date":"2016-10-25T23:01:11.789+0000","up_votes":1,"down_votes":0,"body":"I'm new so I Lind of don't understand how to repost it on gameplay","replies":[{"poster":"Targons Blade","date":"2016-10-26T20:26:56.783+0000","up_votes":1,"down_votes":0,"body":"Basically copy this post, visit the hyperlinked Gameplay boards from my last message, then create a new discussion on that board. After you've made that new post, you'll want to delete this one. \n\nHope that helps~","replies":[]}]}]}]}