{"poster":"Hexenknig","date":"2016-06-24T13:14:09.024+0000","title":"Supporter bewertung verbessern","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Ich bin  der Meinung, es sollte ein unterschied bei den Bewertungen f&uuml;r Leistung geben, wenn man Supporter spielt!\r\nBei einem 1/1/7 spiel, als supp, und nach aufgabe der gegner nach 24 minuten, hat man keine chance als supp auch nur in die n&auml;he einer\r\nS- bewertung f&uuml;r eine truhe zu kommen. Nat&uuml;rlich kann man mehr kills machen und gar nicht sterben, aber als supp ist es ja die Aufgabe\r\ndem ADC die Kills zu geben und diesen zu sch&uuml;tzen, auch wenn das bedeutet man muss ich dazwischen stellen und sterben, wie soll man da an eine Truhe herran kommen? Finde ich irgendwie etwas schwer und doof gemacht!\r\n\r\nLG","replies":[{"poster":"LYN Whizzk1d","date":"2016-06-26T22:53:48.480+0000","up_votes":1,"down_votes":0,"body":"support ist bei weitem die einfachste position um eine truhe zu bekommen. ich verstehe nicht, warum das so ein problem darstellt. zur not spiel einfach einen weichen support (soraka, nami, janna, karma,...) und bleib safe und kassier jeden assist ein, den du kriegen hast. und stirb nicht für deinen adc ^^","replies":[]},{"poster":"Im a Papaya","date":"2016-06-24T17:32:53.340+0000","up_votes":1,"down_votes":0,"body":"Pink Wards spielen als Support eine große Rolle, andere Wards zu platzieren auch, Wards zerstören sowieso ansonsten kommt es stark auf deinen Champ an. Braum muss einiges mehr an Schaden eingesteckt haben als Soraka, Soraka muss einiges mehr geheilt haben als Karma und Karma muss einiges mehr an Schaden gemacht haben als **jeder** Uility Support.\nWie schon erwähnt ist das Supporter S teilweise ein wenig merkwürdig und wird zum Glück überarbeitet, denn mein erstes S+ Spiel als Thresh war einfach ein Spiel das aus vielen unlucky Momenten meines Adcs bestand wo ich dann am Ende der Laning Phase 6/1 stand.","replies":[]},{"poster":"Mypl","date":"2016-06-24T15:35:52.089+0000","up_votes":1,"down_votes":0,"body":"Hey ich bin selbst main Supp und  man kann easy S bekommen. Brauchst viele Assists, in 24 min. sind 7 nicht viele wenn du viele assists hast dann wird das schon :) Einfach immer schielden/healen auch wenn es vielleicht nicht nötig ist, wenn der jenige dann einen 1shot macht. z.B. Rangar, einfach shielden/heilen wenn er unsichtbar ist und du hast nen assist ^^ Denn es kommst ja wie du gesgat hast nicht auf die kills an, aber die assists zählen.","replies":[]},{"poster":"Iam a real Man","date":"2016-06-24T13:18:46.187+0000","up_votes":1,"down_votes":0,"body":"Im nächsten Patch wird die Support Bewertung nochmal verbessert,kannst dazu mehr auf den Pbe seiten lesen^^","replies":[{"poster":"Zero000","date":"2016-06-24T14:36:17.213+0000","up_votes":1,"down_votes":0,"body":"Vielleicht habe ich ja etwas übersehen, aber ich finde nichts dazu.\nhttp://www.surrenderat20.net/p/current-pbe-balance-changes.html\n\nAnsonsten Riot hat doch gesagt das die Wertungen danach vergeben werden wie gut man mit seinem Champion im Vergleich zu anderen Spielern mit dem gleichen Champion in der gleichen Rolle abschneidet.\n\nWieso sollte es als Support {{champion:16}} schwerer sein eins der besten 5%(Die Zahl ist frei erfunden!)  Support {{champion:16}} Spiele zu absolvieren als zum Beispiel als ADC {{champion:21}} ?","replies":[]}]},{"poster":"Aaxsus","date":"2016-06-24T13:39:12.983+0000","up_votes":1,"down_votes":0,"body":"oder dir einfach mal dieses Video hier anschauen https://www.youtube.com/watch?v=7z6vbADeRHU","replies":[]}]}