{"poster":"vlphv","date":"2016-05-20T04:09:05.151+0000","title":"Ive been hacked (with proof) Help Get This Guy Banned.","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":1,"body":"Hello,\r\nToday my opposition midlaner somehow got into my keyboard driver of my Cougar 500K and began to manipulate my keyboard inputs by spamming buttons. This inherently lost me the lane &amp; game. He was laughing about it in game and he apologised at the end of the game about what he did. (Note he was laughing before i said anything.. eg hows your keys).\r\nThis was on the Oceanic server. He was the Yasuo named Astaraath. \r\n\r\nHeres a photo of him talking after the game: http://imgur.com/r6uj5CV\r\nHeres the video taken after the game of my keyboard pressing buttons by itself: https://vid.me/1Rn3","replies":[{"poster":"SephirothSG","date":"2016-05-21T00:38:33.968+0000","up_votes":1,"down_votes":0,"body":"Hey there,\n\nI have my doubts it was the player in-game who was doing this, the only way this would be possible would be if you were to download a piece of software from that player.\n\nIt sounds to me like you might be infected with malware, from your video i can see you're running Mac OS.\n\nWhile I don't have much experience with Apple Computers, I can recommend you download [Malwarebytes](https://www.malwarebytes.org/antimalware/mac/) for Mac and run a full scan, remove any threats it finds and reboot.\n\nAfter the above has completed and any threats have been removed, I would recommend changing all account passwords ASAP as the attacker may have compromised any saved passwords and/or logged your keystrokes while you were logging into any of your accounts.","replies":[]},{"poster":"vlphv","date":"2016-05-20T04:56:08.713+0000","up_votes":1,"down_votes":0,"body":"Riot please help me out here.","replies":[{"poster":"Goliath","date":"2016-05-20T10:09:14.319+0000","up_votes":1,"down_votes":0,"body":"They won't and can't do anything. All they process is chat bans after reading one or two words.","replies":[]}]}]}