{"poster":"IcyPepper","date":"2015-08-27T00:07:02.831+0000","title":"How much of the team's warding should be on the support?","subforum":"Gameplay","up_votes":16,"down_votes":1,"body":"http://i.imgur.com/0U04sJ5.png\n\nAll too often this happens.\n\nIn games that last longer than 25 minutes (generally not curbstomps that end in a surrender vote), I&#039;ve noticed that sometimes... supports are supplying over half the team&#039;s wards. \n\nOf course, this is not always the case. Observe the picture posted above, and how the red team has a more \"equal\" distribution (and more wards total) despite their support not warding as much as the blue team&#039;s. Can you guess who won?\n\nNow, I may be a little salty, but this did get me thinking about how much a team should strive to ward and how much they should rely on their support. I like to improve my warding game, *especially* when not playing support, so I&#039;m trying to learn how to balance warding enough as opposed to warding too much/little. So my question to you is this: how much of the team&#039;s warding should be covered by the support as a guide, not a rule in games that are relatively close and/or last longer?","replies":[{"poster":"Linna Excel","date":"2015-08-27T00:18:08.641+0000","up_votes":16,"down_votes":1,"body":"I think about a third.  They've got sightstone, sure, but other champs have no excuse not to buy and upgrade their yellow.","replies":[]},{"poster":"LaughingMan11","date":"2015-08-27T00:53:03.774+0000","up_votes":6,"down_votes":0,"body":"about 20% because post level 9, everyone gets a free two wards. No reason for anyone not to ward anymore.","replies":[{"poster":"LankPants","date":"2015-08-27T02:23:20.021+0000","up_votes":9,"down_votes":0,"body":"Sweepers and Lenses are powerful too. Ignoring them as a mid/adc is often not a good idea.","replies":[{"poster":"DeynaTaggerung","date":"2015-08-27T21:55:03.205+0000","up_votes":1,"down_votes":0,"body":"I feel that the mid laner should probably still stick to more wards because they're all over and have lots of chances to place them in good spots as do top laners. With a lens on the adc and sweeper on the jungler all the roles are filled out","replies":[]}]}]},{"poster":"Nekusen","date":"2015-08-27T02:06:02.725+0000","up_votes":9,"down_votes":0,"body":"between 30-35% \nhaving in mind there are 5 teammates and that an average would be 20%, if the Sup wards 30%, the rest would (in average) ward 17.5%, meaning the Sup is warding around 80-100% more than each other teammate. \n\nthe jg has to ward key spots and lay {{item:2043}}  in defensible spots, in some cases even getting  a {{item:2049}}  of his own.\nimmediately after reaching lvl 9, everyone should upgrade their trinkets, with at least 2 other teammates getting either {{item:3361}}  or {{item:3362}}  (buying {{item:2044}} {{item:2043}}  before that)\n\nyou always find the a-hole that want's to rush items so he doesn't \"waste money\" on killable wards","replies":[]},{"poster":"1000angrybees","date":"2015-08-27T01:36:38.836+0000","up_votes":8,"down_votes":0,"body":"It's funny, because I learned that value of wards and vision when I took up support as my first role, and then when I transitioned into other roles I carried that over. I'm usually #1 or #2 at warding, depending on how much the support wards. \n\nI'll be goddamn mid and you can bet your ass I'm gonna pump out over 20+ wards at the very least.","replies":[{"poster":"TotalJerk","date":"2015-08-27T03:16:14.258+0000","up_votes":1,"down_votes":0,"body":"There are more routes (6) to mid than the other lanes (2), so that lane potentially gets fucked the hardest by bad warding.","replies":[{"poster":"Cindikle","date":"2015-08-27T03:41:33.447+0000","up_votes":1,"down_votes":0,"body":"The closer paths are easy to ward off. The rest is on your team to ward their exists so they can't go the long way around.","replies":[{"poster":"TotalJerk","date":"2015-08-27T04:56:12.308+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Cindikle,realm=NA,application-id=3ErqAdtq,discussion-id=dvXwai70,comment-id=000400000000,timestamp=2015-08-27T03:41:33.447+0000)\n>\n> The rest is on your team to ward\n\nIf there's anything I've learned about soloQ, it's that you should use your teammates, but never rely on them.","replies":[{"poster":"Cindikle","date":"2015-08-27T22:38:50.374+0000","up_votes":1,"down_votes":0,"body":"Pretty much soloQ in a nutshell.","replies":[]}]}]}]}]},{"poster":"Ace Access ","date":"2015-08-27T11:49:24.480+0000","up_votes":2,"down_votes":0,"body":"I have just one thing to say:\n\n\nbuy {{item:3361}}","replies":[{"poster":"jpguy902","date":"2015-08-27T17:50:29.880+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Ace Access ,realm=NA,application-id=3ErqAdtq,discussion-id=dvXwai70,comment-id=0017,timestamp=2015-08-27T11:49:24.480+0000)\n>\n> I have just one thing to say:\n> \n> \n> buy {{item:3361}}\n\nThis.   Its like a mini sight stone for everybody, but it constantly regenerates wards! ","replies":[{"poster":"IcyPepper","date":"2015-08-27T19:14:22.063+0000","up_votes":3,"down_votes":0,"body":"And only 250 gold, as opposed to 800 for the one person on the team who doesn't get a lot of gold!\n\nNow that shit's broken.","replies":[]}]}]},{"poster":"MarkedOfKane","date":"2015-08-27T00:11:49.266+0000","up_votes":2,"down_votes":6,"body":"About 45%. 50 if the support gets a pink trinket.\n\nLategame when everyone is full build, its more like 20%. Granted the others get the yellow trinket.","replies":[{"poster":"Aeolian Melodies","date":"2015-08-27T01:39:13.488+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=MarkedOfKane,realm=NA,application-id=3ErqAdtq,discussion-id=dvXwai70,comment-id=0000,timestamp=2015-08-27T00:11:49.266+0000)\n>\n> About 45%. 50 if the support gets a pink trinket.\n> \n> Lategame when everyone is full build, its more like 20%. Granted the others get the yellow trinket.\n\nBullshit that almost half should be on one person when everyone gets freebie wards.\n\nAlthough it's worse when I find out I warded more than 4 people put together.","replies":[{"poster":"MarkedOfKane","date":"2015-08-27T03:31:46.432+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Aeolian Melodies,realm=NA,application-id=3ErqAdtq,discussion-id=dvXwai70,comment-id=00000000,timestamp=2015-08-27T01:39:13.488+0000)\n>\n> Bullshit that almost half should be on one person when everyone gets freebie wards.\n> \n> Although it's worse when I find out I warded more than 4 people put together.\n\nA support with a sightstone and a pink trinket can put down 4 wards. The average other player doesn't upgrade their trinket generally until its convenient for them to upgrade. There are 4 other players besides the support. 1 ward per every player other than support = 4 wards. Support = By default 3 wards, 4 when upgrading trinket. Its not bullshit.","replies":[{"poster":"DrNova","date":"2015-08-27T04:36:48.955+0000","up_votes":2,"down_votes":0,"body":"Yeah but before 9, when everyone gets two free, support isn't often in a position to ward past bot/dragon and some Jung. Each lane should be warding heavy for their own area and Jung who does the roaming.","replies":[]}]}]}]},{"poster":"Teridax68","date":"2015-08-27T21:06:52.248+0000","up_votes":2,"down_votes":0,"body":"About as much as anyone with {{item:3361}}, I think. {{item:2049}} allows supports to max out on the ward cap for a static cost, but so does the upgraded yellow trinket, and for a much smaller price (granted, with a minute-long cooldown, but that's usually not an issue). Perhaps some players might pick alternate trinkets (e.g. jungler with {{item:3364}} and the marksman with {{item:3342}}/{{item:3363}}), but anyone with a warding trinket has the capacity to ward as much as the support, and should jump on the occasion (plus everyone should buy {{item:2043}}). The idea that supports have to singlehandedly cover the team's vision resources has been outdated since the beginning of Season 4, and I think ultimately the vision game shouldn't be a responsibility specifically assigned to any role in particular; rather, everyone should opt into it equally, as it's critical to mastering the game for any role, and not just the support role.","replies":[{"poster":"IcyPepper","date":"2015-08-27T21:16:37.697+0000","up_votes":1,"down_votes":0,"body":"Agreed.\n\nEarly sightstone on support is important for three reasons: 1.) gold efficiency for the role with the lowest average gold income, 2.) protecting the carry with the highest snowball potential for objective control, and 3.) objective control, both through vision and vision denial with sweeper lens.","replies":[{"poster":"Teridax68","date":"2015-08-27T22:39:59.192+0000","up_votes":2,"down_votes":0,"body":"That is true. At the same time, I think Sightstone is becoming increasingly outdated, especially now that everyone has mostly free, ultra-powerful access to massive vision, without having to sacrifice an inventory slot. Removing it now would be disastrous, because supports would then be expected to fall back to buying 3 wards on every shop trip and seriously damaging their own income, but to me the dream would be everyone contributing to vision equally, with supports not being expected to sacrifice their build for vision any more than any other role. \n\nThere's probably a support itemization overhaul waiting to happen (supports should be able to operate on an even better income than the one they have now, and be able to dip into AP much better if they want to, particularly now that raw AP items are cheaper), and ultimately it would be nice to have support builds truly empower supports in a manner that feels satisfying and unique, instead of just turning all caster supports into spammy manaless champions late-game. 40% CDR will probably remain a staple on most supports (and that's probably a good thing, since reaching the cap is satisfying for the ease of spell access it offers, imo), but it would be nice for items like {{item:3116}}, {{item:3157}} and even {{item:3089}} to be viable options on supports, rather than just ultra-luxury picks that supports would only pick late-game if they really have nothing to spend in smaller increments.","replies":[]}]}]},{"poster":"JustBoneBrook","date":"2015-08-27T14:23:49.644+0000","up_votes":2,"down_votes":0,"body":"20% max 30%","replies":[{"poster":"JustBoneBrook","date":"2015-08-27T16:16:04.849+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JustBoneBrook,realm=NA,application-id=3ErqAdtq,discussion-id=dvXwai70,comment-id=001a,timestamp=2015-08-27T14:23:49.644+0000)\n>\n> 20% max 30%\n\n(Support should not alwas build {{item:2049}} on every support champ like not all adc are good whit a {{item:3031}}) Perso i never build {{item:2049}}  whit support but alwas build {{item:3361}}  and a {{item:2043}}  in my jungle","replies":[]}]},{"poster":"SoMNia","date":"2015-08-27T14:18:17.002+0000","up_votes":2,"down_votes":0,"body":"Ideally, 20%. Maybe 30%.\n\nBunch of tossers expecting supports to spend gold they don't have on things nobody else is willing to buy. Have you seen this travesty? {{item:2049}} I can only place 3 greens and 1 pink. If the other four players combined are not placing at least twice as many wards as me, the team doesn't have enough wards, and the game will not let me do more than I'm already doing. Every player should have at least 2 wards going.","replies":[]},{"poster":"The Lexer","date":"2015-08-27T13:18:19.437+0000","up_votes":2,"down_votes":0,"body":"I say supp 30% all others 20%ish and adc 10% if they get the blue trinket instead.","replies":[]},{"poster":"CoolKnightST","date":"2015-08-27T10:17:31.009+0000","up_votes":2,"down_votes":0,"body":"It really depends on the situation:\n\n* The duration of the game\n* If the jungler goes for sightstone or not\n* How many players don't forget to upgrade their trinket\n* How many players forget to ward","replies":[]},{"poster":"Maratsune","date":"2015-08-27T08:30:56.890+0000","up_votes":1,"down_votes":0,"body":"Checking my recent match history.... ouch. One game I put down 31 wards, the next person down on my team placed 8. \n18/4...\n28/7....\nI usually get a little annoyed by the lack of vision on the map, and I'll usually say something if I see nobody else upgrade their trinket, but for the most part I've resigned myself to having to take care of at least 50% of the wards myself. \nThere was one time where the enemy top laner was the only other person in the game to have an upgraded trinket, it was like 40 minutes in. I went in all chat and said \"Bless you Fiora. Bless you and your upgraded trinket.\"\nNobody took the hint.","replies":[{"poster":"IcyPepper","date":"2015-08-27T08:47:55.384+0000","up_votes":1,"down_votes":0,"body":"The worst part is when people don't ward, but rage if you ever suggest not buying sightstone, despite it being a gold income convenient item for supports (and some junglers), not a crutch and an excuse for four other people not to ward.\n\n800 gold on the 0 cs support, and people find it hard to spend 250? That's less than any item in the game that gives any meaningful stats.","replies":[{"poster":"Steelflame","date":"2015-08-27T09:26:23.207+0000","up_votes":2,"down_votes":0,"body":"I actually love the new Mord just for the fact he starts Relic shield even from the carry position.   Meaning a FUCKTON of gold gets to go to the support for once.  Opens up a lot stronger supports.","replies":[{"poster":"IcyPepper","date":"2015-08-27T09:29:38.409+0000","up_votes":1,"down_votes":0,"body":"Unf. I love it too.","replies":[]}]}]}]},{"poster":"A Superb Villain","date":"2015-08-27T04:46:33.614+0000","up_votes":2,"down_votes":0,"body":"In all of my recent games I have place more wards than my support. With {{item:3361}}, there is absolutely no excuse for the burden of warding to be placed solely on the support.","replies":[]},{"poster":"Dakuraigun","date":"2015-08-27T04:31:31.516+0000","up_votes":2,"down_votes":0,"body":"As any character I usually upgrade my trinket. If I'm in the jungle, I grab a sightstone sometimes.\n\nIn most cases of people in my player pool of friends, I end up warding more than the support.\n\nNote, sometimes, this is me playing Mid Kat. Warding. Everywhere. Because I like to be able to see things, y'know?\n\n(andmainlybecausewardsinteractwithherE*COUGH*)\n\nBut other than that, no matter what role, at least upgrade your trinket. I've seen too many games where people don't and it's most times part of why they lose.","replies":[]},{"poster":"LankPants","date":"2015-08-27T02:20:45.102+0000","up_votes":1,"down_votes":0,"body":"I'd say around 30%-35%. Their share is a little higher than average (along with Jungles) because ADC and Mid should in most cases upgrade to blue and red trinket respectively making it a little harder for them to get wards.\n\nI'd say the ideal distribution should be around 20/25/10/10/35 for top/jungle/mid/adc/sup, although there are cases where this will be skewed such as certain assassin jungles who need sweeper and a lot of stats to be functional.","replies":[{"poster":"IcyPepper","date":"2015-08-27T02:26:42.873+0000","up_votes":2,"down_votes":0,"body":"I thought junglers took sweepers and midlaners took upgraded green/yellow? Or would you say it's more situational?","replies":[{"poster":"LankPants","date":"2015-08-27T02:48:05.040+0000","up_votes":2,"down_votes":0,"body":"Depends on the mid laner. If you're a guy like Viktor who just wants to sit mid all game and farm then yellow's super good. If you're a roaming mid like Ahri you probably want a sweeper. More mid laners tend to be roamers than sit and farm mids, so I'd say as a general rule sweeper's better on mids overall. Yellow trinket on mid can definitly skew the ideal distribution though.\n\nJunglers should upgrade sweeper if they're a gank heavy jungler and it's a fine upgrade on every jungler. If you're someone who just wants to farm up then yellow's OK too. As a rule of thumb junglers should have one of Yellow/SS/buying a lot of wards since they roam around a lot and tend to be able to place a lot of wards easily.","replies":[{"poster":"LaughingMan11","date":"2015-08-27T02:54:41.098+0000","up_votes":1,"down_votes":0,"body":"Fairly good point across the board, more often than not, imo, as long as both jungler and support have a sweeper, or jungle and mid or jungle and top, two sweepers is a good number, but until you start hitting the 6 item mark, regardless of trinket, its still everyones job to ward.","replies":[{"poster":"LankPants","date":"2015-08-27T03:09:29.190+0000","up_votes":2,"down_votes":0,"body":">but until you start hitting the 6 item mark, regardless of trinket, its still everyones job to ward.\n\nWhile I don't disagree with this I sometimes think people take this mentality too far. \n\nFor example: If you're an ADC and your support already has a Sightstone and you have 75 gold left over after buying you should buy two pots, not a ward (assuming you don't have Vamp). While the extra vision can be useful the two pots are going to help you win trades and 3-4 wards (depending on your trinket) should be enough to cover your lane.\n\nI don't think it's super important for the ADC and Mid lane to always have green wards on the map as long as their team is warding up properly, they should definitely make sure they're covered from ganks if they're splitpushing but in a siege scenario their teams greens will most likely be enough to cover them (7-9 wards is a lot).\n\nThe main thing that ADCs and Mids should focus on in regards to warding is to always keep a pink on the map. Pink wards are an incredibly limited resource that the entire team has to contribute towards and I think that pinks should probably be a good percentage of ADCs and Mids wards (especially ADC since they don't even really have to cover their own lane).\n\n>as long as both jungler and support have a sweeper, or jungle and mid or jungle and top\n\nIt should always be support and X. There's no reason for support not to have a sweeper.\n\n>two sweepers is a good number,\n\nTwo and three are both fine IMO.","replies":[{"poster":"Steelflame","date":"2015-08-27T09:24:14.198+0000","up_votes":1,"down_votes":0,"body":"If you are an ADC at 75 gold, wait for 25 more gold, grab a pink, and drop it in your jungle.  A well placed Inner jungle pink can do TONS to increase your safety net.  Or try and grab one mid-late game, and drop it in the side bush of the enemy team's lane. A Pink there can last a long damn time, grants good knowledge of if someone is heading down lane to farm (meaning you know you can pressure the other side of the map easily, or perhaps assist in having an assassin on your team catch them out).\n\nPinks are an investment EVERYONE should be making.  It is just hard to remember to do it often enough.","replies":[]}]}]}]}]}]},{"poster":"Arcade Andrew","date":"2015-08-28T14:35:49.324+0000","up_votes":1,"down_votes":0,"body":"heres how to break down warding:\n\nduring lane phase: 00:00-20:00~\ntop lane: you buy your own damn wards 100% of top wards should be bought from top lane at level 9 upgrade trinket\nmiddle lane: buy one ward or use trinket, place in one brush and stay near that side of the river, if enemy jungler come run to other side of river, if he comes from unwarded side, run away on the warded side UPGRADE TRINKET AT LEVEL 9\n jungler: since you are always roaming GET A DAMN EARLY SIGHTSTONE IF YOU GET FIRST BLOOD OR GET AHEAD\nyou are responsible for warding the entire enemy jungle and your jungle, you after all are the jungler always roaming so get to warding\nALSO UPGRADE TRINKET AT LEVEL 9\nbot lane: adc uses trinket to ward the brush in lane closer to enemy turret UPGRADE TRINKET AT LEVEL 9\nsupport: buy sightstone as first item no matter what, ward dragon and tri constantly; UPGRADE TRINKET AT LEVEL 9\n\nmid-late game \n20+mins\ntop: should have upgraded trinket, if splitpushing ward enemy gromp (if on red) or enemy krugs (if on blue) to avoid getting ganked and keep baron warded regardless of split pushing or not; YOU SHOULD HAVE UPGRADED TRINKET BY NOW\nmid: ward enemy wolf/raptor camps to avoid getting ganked while pushing: also should have upgraded trinket\njungler: can sell SS if not bee sin, should have upgraded trinket, your sole warding job is to keep vision on dragon and the area around it (via scuttle, and a deep ward in enemy side of jungle)\nadc: should have upgraded trinket, ward where needed, but focus on carrying not warding\nsupport: same deal as ADC but with SS, always drop wards 24/7 with the intent of just having them quickly there to check for 20 secs so you dont get ganked while pushing, use SS as you move, ward where you go dont ward with the intent of leaving a ward there for longer than a minute, you are the mobile warder, you drop shit tons of wards thanks to SS and when you die/go b after a teamfight you refuel for more ward adventures","replies":[]},{"poster":"TurquoiseYoshi","date":"2015-08-27T21:45:58.992+0000","up_votes":1,"down_votes":3,"body":"60% Support. The majority of wards.\n20% Jungle. Enough to ward enemy jungle and ward objectives.\n10% Top. Enough to ward their lane and maybe a ward near Baron. \n8% Mid. Enough to ward their lane.\n2% ADC. Using yellow trinket early and then getting rid of it for blue trinket later.","replies":[{"poster":"JustBoneBrook","date":"2015-08-28T03:24:15.682+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TurquoiseYoshi,realm=NA,application-id=3ErqAdtq,discussion-id=dvXwai70,comment-id=0021,timestamp=2015-08-27T21:45:58.992+0000)\n>\n> 60% Support. The majority of wards.\n> 20% Jungle. Enough to ward enemy jungle and ward objectives.\n> 10% Top. Enough to ward their lane and maybe a ward near Baron. \n> 8% Mid. Enough to ward their lane.\n> 2% ADC. Using yellow trinket early and then getting rid of it for blue trinket later.\n\n............ that support need to place like 30 wards on the 50 the team get? Jungler place 10 ward, Top place 5, mid 4 ward and the adc need to place 1 ward? ........... \n\nGame i just played and won Support 15 ward (30%) , Mid 12 ward (25%), Top 9 ward (18%) , Adc 8 ward (16%), jungler 5 ward (10%)\nAnd the enemie got \n34 ward Support (53%) , Adc 8 ward (12%) , Top 8 ward (12%) , jungler 8 ward (12%) , mid 6 ward (9%).","replies":[{"poster":"TurquoiseYoshi","date":"2015-08-28T14:19:34.378+0000","up_votes":1,"down_votes":0,"body":"The thing is, you should have a lot more total wards than 50. I've seen many times where there have been entire blank maps because we just don't have any wards down.","replies":[]}]}]},{"poster":"DazedOnlooker","date":"2015-08-27T21:51:01.099+0000","up_votes":1,"down_votes":0,"body":"Something i have noticed all too often is that i'm the one supplying well over 60% of the wards at any given point of the game almost regardless of the role i'm playing (In a recent game i was a jungler...i warded more than our support did, this happens more often than i thought disappointingly enough). But more so the sup role i'm in always places the most wards.\n\nBut not too long ago, i had a small epiphany regarding all of my games that would end in my team getting stomped hard. I noticed a huge pattern...when my team is losing badly, the warding completely stops. Like NO ONE places wards on my teams when we are losing badly... our lanes are pushed in. the minimap is 80% dark(no vision), and i'm the only one left warding, there are always 3 wards(and one pink if i can help it) on the map placed by me at any given point..these wards that i place becomes _**completely useless**_..\n\nI wondered why...was it was because since our enemy was so far ahead. they would go where they pleased?..my ward placement became irrelevant, by this point because my team just stops paying attention to the minimap . using my sweeper i would always find enemy wards at nearly any cliche spot on the map.\n\nBecause of this, **we would lose harder**. and we would **feed** harder, some people would say its because we are all on tilt because we are losing. that's one possible cause, but what about the ones who aren't' on tilt but still feed the winning team?. We get caught out..a lot. I notice that all too often we lose not because the enemy took 90% of our turrets because some of us fed a bit, but because we keep face planting into the enemy getting caught off guard because we didn't know the carry was taking the blue buff in our jungle, or that their bard had a fed escort while he was placing wards in the jungle, or that all 5 of them were sitting in the river bush in front of baron waiting for a bait, we would always end up in a 1v2 or 2v4 situation...all of which could have been avoided had there been wards in thoes areas. Its like people forget how playing as a team is supposed to work.\n\nI know this comes as common sense to the pros out there but i'm still new to pvp, and still learning how to get the edge to win and thought i should share what i had figured out myself.\n\nTLDR; My losing team's feed the hardest late game because no one want's to ward anymore.","replies":[]},{"poster":"Catastrop","date":"2015-08-27T21:50:08.419+0000","up_votes":1,"down_votes":0,"body":"I'd say about 50%, since it's a part of their job it they should contribute to most of the warding while their team evens out ward coverage with their own.","replies":[]},{"poster":"CookieKitKat","date":"2015-08-27T21:35:23.209+0000","up_votes":1,"down_votes":0,"body":"Lol one time I was going to pink a bush near mid and then I realized it was already pinked...I've never seen my river bush already pinked by someone else.","replies":[]},{"poster":"Westonbirt","date":"2015-08-27T21:06:36.085+0000","up_votes":1,"down_votes":0,"body":"The only reason support should ward more is because of early sightstone.\n\nPost level 9 there is no reason for anyone not to ward. It's even better when you're in a matchup with a lot of sneaky campy assassins dirtbags. You'd be surprised how often your opponent's tactics can be completely shut down when you're able to drop 15 checkpoints in their jungle. Even two or three are enough to secure a corridor.\n\n{{item:3361}} **_IS THE MOST GOLD EFFICIENT ITEM IN THE GAME, GODDAMNIT_**","replies":[]},{"poster":"ButterBladesX","date":"2015-08-27T17:56:51.516+0000","up_votes":1,"down_votes":0,"body":"I'll say this everybody should ward! If you look at my match history you will see that no matter what lane I am or Jung I ward a shit ton. You could say that I'm a ward addict lol. And hey it helps me a crap ton sometimes . I could see my enemy's roaming or ganks incoming. Or I can see a perfect ambush in the enemy Jung. I say everybody should ward. Vision will always help trust me","replies":[]},{"poster":"KingWanahakalugi","date":"2015-08-27T16:09:42.700+0000","up_votes":1,"down_votes":0,"body":"In low elos support is usually the sole source of vision. Mid elos usually support and jungle supply the majority of the vision. High elos everybody supplies vision. It depends on where your playing that determines how much is expected, but it should curve toward everyone buying or they have no reason to complain.","replies":[]},{"poster":"Hullabaloo907","date":"2015-08-27T11:01:43.006+0000","up_votes":1,"down_votes":0,"body":"I really just wish my team would ward baron and dragon more.  Its hard for me to set up ward screens for pushes if half my wards are on two objectives everyone knows needs to be warded","replies":[]},{"poster":"Sneak Dog","date":"2015-08-27T10:44:07.242+0000","up_votes":1,"down_votes":0,"body":"Not everyone gets an upgraded yellow trinket, some go red/blue/pink. The team wants to have pink wards, sadly the supports gold is the least valuable and as such it's optimal for the support to spend an extra 100g on a pink. \n\nI'm going for 40%.","replies":[]},{"poster":"Embertine","date":"2015-08-27T10:05:36.241+0000","up_votes":1,"down_votes":0,"body":"I've had a match where I placed 70% of the words while playing as support leona. Even though my entire team had trinkets they hardly ever placed any wards anywhere. I can't even tell you how often people say, \"Leona we need wards!\" when they haven't even used their trinket in the last ten minutes. I guess people are still stuck in the season 2 mindset of the support having to be the only one to ward.","replies":[]}]}