{"poster":"HeisenHill","date":"2016-11-16T01:52:23.874+0000","title":"Tactical Riot Gaming Winter Tournament 2016","subforum":"Turniere & Veranstaltungen","embed":{"description":"Tactical Riot Gaming (https://tactical-riot-gaming.de/ , https://www.facebook.com/TacticalRiotGaming/?fref...","url":"https://battlefy.com/tactical-riot-gaming-ev/tactical-riot-gaming-winter-tournament-2016/582b52ff02e2063f035f0ba4/info","image":"https://s3.amazonaws.com/battlefy-user-generated-assets-with-permissions%2Fauth0%7C57f6980045e9eab232bf2101/TRG-Logo-Lang-2015.png.1479232074367"},"up_votes":1,"down_votes":0,"body":"Tactical Riot Gaming Winter Tournament 2016\r\n\r\nTactical Riot Gaming (Tactical Riot Gaming e. V. , https://www.facebook.com/TacticalRiotGaming/?fref=...) veranstaltet das League of Legends Winter Tournament 2016.\r\nBeginnen wird es am Sonntag den 18.12.2016 um 14:00.\r\nPreise werden vorraussichtlich &uuml;ber Riot herausgegeben (Standardpreise).\r\nSelbstverst&auml;ndlich streamen wir dies auch auf unserem weihnachtlich gestalteten Twitchkanal mit dem besten Streamer des LoL-Bereichs. Anmelden k&ouml;nnen sich bis zu 31 Teams von Silber5 - Diamond 1. Jeder ist herzlich willkommen, ob als Zuschauer oder als Spieler :) .\r\n\r\n\r\nLiebe Gr&uuml;&szlig;e\r\nEuer Tactical Riot Gaming\r\n\r\n\r\n\r\n\r\n\r\nRules\r\nRegeln und Infos f&uuml;r Teilnehmer und Teams\r\nTactical Riot Gaming Winter Tournament | 18.12.2016\r\n\r\n1.Voraussetzungen und Anmeldung\r\n\r\n1.1 Voraussetzungen f&uuml;r die Teilnahme am Winter Tournament 2016:\r\n\r\n Ein Team muss aus mindesten f&uuml;nf Person bestehen und darf aus maximal neun Person bestehen.\r\n Mindestens 16 Champions zur Verf&uuml;gung (Rotation inklusive).\r\n Ein g&uuml;ltiges, nicht gebanntes Riot-Games-Konto auf dem Server EUW.\r\nLevel 30 erforderlich.\r\n Man muss mindestens 150 Siege haben im klassischen Normal-Spielmodus.\r\n Keine Smurfs.\r\n Es k&ouml;nnen nur Spieler eines Teams zusammen antreten. Das hei&szlig;t, das Team muss aus mindestens f&uuml;nf spielberechtigten Spielern bestehen.\r\n Jeder Teilnehmer/jedes Team muss damit einverstanden sein, auf unseren Social\r\nMedia Plattformen erkennbar dargestellt zu werden.\r\nSilber 5- Diamond 1 Elo\r\n1.2 Die Anmeldung:\r\n\r\n Ein Teammitglied meldet das Team schriftlich an &uuml;ber:\r\nhttps://battlefy.com/\r\n In der Anmeldung muss vermerkt sein, wer Teamleiter ist (ist das nicht der Fall, wird der Anmeldende automatisch zum Teamleiter).\r\n Der Anmeldende muss bei der Anmeldung den Teamnamen und die Ingame-Namen aller Spieler und Ersatzspieler seines Teams, deren Email und die Liga des RankedTeams angeben (z.B.: Ext3RLps - Ersatzspieler - Silber 3).\r\n Durch Registrierung des Teams stimmen alle Mitglieder eines Teams den Regeln des Turniers ausnahmslos zu.\r\n Danach registriert sich jeder Spieler noch &uuml;ber\r\n\r\n Alle Anmeldungen die nach dem letzten Termin eingereicht werden, d&uuml;rfen nicht mehr ber&uuml;cksichtigt werden.\r\n\r\n1.3 Teamgr&ouml;&szlig;e:\r\n Ein Team muss mindestens 1 Teamleiter und 4 Mitglieder enthalten.\r\n Es k&ouml;nnen optional 4 weitere Ersatzspieler angemeldet werden.\r\n Die Teamaufstellung darf von Beginn bis Ende des Turniers nicht ge&auml;ndert werden.\r\n\r\n1.4 Der Teamleiter:\r\n Jedes Team muss einen Teamleiter als Kontaktperson f&uuml;r Administratoren und Schiedsrichter des Turniers angeben.\r\n Der Teamleiter ist daf&uuml;r verantwortlich, dass alle Teammitglieder die Turnierregeln befolgen.\r\n Der Teamleiter muss w&auml;hrend des gesamten Turniers als Kontaktperson auf unserem Teamspeak Server erreichbar sein. (Tournaments.TRG.Community).\r\n Sollte ein Gegnerteam Regeln verletzen, so ist der Teamleiter daf&uuml;r verantwortlich, etwaige Regelverst&ouml;&szlig;e zu beweisen.\r\n Falls der Teamleiter nicht aktiv am Spiel teilnimmt, muss ein Co-Teamleiter festgelegt werden, um mit der Turnierleitung oder einem Schiedsrichter in Kontakt treten zu k&ouml;nnen.\r\n\r\n\r\n2. Das Spiel\r\n\r\n2.1 Spielgestaltung:\r\n Server: EU-West\r\n Map: Kluft der Beschw&ouml;rer | 5 vs. 5\r\n Zuschauer - verboten, nur &uuml;ber unsere Live&uuml;bertragung per Stream.\r\n Spielmodus: Turniermodus - Onlineturnier - Best of 1 (falls nach Start des Spiels ein falscher Spielmodi festgestellt wird, darf dieser nicht mehr ge&auml;ndert werden).\r\n Das Halbfinale und Finale wird im Best of 3 Modus bestritten.\r\n Info: Die Lobby muss durch den Teamleiter des Blauen Teams erstellt werden. Alle anderen Spieler treten danach dem jeweiligen Team bei. Es gibt keinen Turniercode.\r\n Das im Turnierbaum links oder oberhalb des aktuellen Gegnerteams aufgef&uuml;hrte Team hat die Seitenwahl.\r\n Linke Seite der Lobby = Team Blau | Rechte Seite = Team Rot.\r\n Sollte es in der Pick- und Bannphase zu Komplikationen kommen, oder die Lobby\r\nabgebrochen werden, werden die Beschw&ouml;rer dazu aufgefordert, ihre Champions,\r\nRunen, Meisterschaften und Beschw&ouml;rerzauber erneut zu w&auml;hlen. Sollte die Lobby\r\nmit Absicht abgebrochen werden, muss das Team mit einer angemessenen Strafe rechnen.\r\n Sollte es zu einem g&uuml;ltigen Spiel (siehe Turnierregeln Riot) kommen, gilt das Spiel\r\nals offiziell, und es d&uuml;rfen keine Neustarts mehr vorgenommen werden.\r\n Begrenzte Spieldauer auf 70 min.\r\n (Ist nach 70 Min. noch kein Team als Gewinner hervor gegangen, wird nach TournamentRules von Riot entschieden, welches Team als Gewinner hervorgeht).\r\n\r\n W&auml;hrend des Spiels haben alle Spieler die Pflicht, sich auf einem von TRG gestellten Teamspeak&sup3; Server in einem f&uuml;r das Team zur Verf&uuml;gung gestellten Channel einzufinden. (W&auml;hrend der Pausenzeit darf - im Gegensatz zur LCS - auch\r\n&uuml;ber die Taktik und das Spiel geredet werden).\r\n\r\n2.2 Zeiten:\r\nDas Turnier startet um 14:00 CET/MEZ mit der Turnierer&ouml;ffnung auf dem TeamspeakServer (Tournaments.trg.community). Dazu ist gew&uuml;nscht, dass alle Teamleiter anwesend sind, um das Turnier einzuleiten.\r\n Ist ein Teamleiter nicht anwesend, kann das den Verlust des Bannrechts im n&auml;chsten Spiel nach sich ziehen.\r\n 14:15 Wird der Turnierbaum vorgestellt.\r\n 14:25 werden die ersten Lobbys erstellt und die Vorbereitungsphase beginnt\r\n 14:30 beginnen die ersten Spiele. Ist ein Team zu dieser Zeit nicht Spielbereit, muss mit einer angemessenen Strafe gerechnet werden (Dazu muss mindestens ein Screenshot des vollst&auml;ndigen Clients mit Urzeit vorliegen).\r\n Spieler k&ouml;nnen jederzeit - mit Ank&uuml;ndigung und Au&szlig;erhalb eines Kampfes - Spiele f&uuml;r bis zu 15 Minuten je Team pausieren , falls ein Spieler die Verbindung verliert, und/oder technische Probleme hat (/pause; /p; /resume &amp; /unpause).\r\n Das pausierende Team kann disqualifiziert werden, nachdem die Pausenzeit abgelaufen ist, bzw. sie nicht bereit sind, das Spiel fortzusetzen. Bevor das Spiel fortgesetzt werden darf, muss das gegnerische Team durch das pausierende Team gefragt werden, ob fortgesetzt werden darf.\r\n\r\n3. Regeln und Regelverletzungen\r\n\r\n3.1 Fair Play:\r\n Wir erwarten, dass alle Spieler die Regeln gelesen, und ihnen zugestimmt haben.\r\n Witch-Hunting, Smurfing, Ghosting, Flame und Provokation jeglicher Art werden nicht geduldet.\r\n Die Kommunikation mit Zuschauern ist w&auml;hrend der Pause und des Spiels untersagt.\r\n Teams, welche in dieser Hinsicht auffallen, werden Disqualifiziert.\r\n\r\n3.2 Regelverletzungen:\r\n Anweisungen, die von den Administratoren (Turnierleitern/Turniersupport) erteilt werden, m&uuml;ssen unter allen Umst&auml;nden zu 100% eingehalten werden.\r\n Administratoren m&uuml;ssen bei auftretenden Problemen in Bezug auf Regelverletzung oder Anderem umgehend kontaktiert werden.\r\n\r\n3.3 Strafen:\r\n Bei Versto&szlig; gegen die Regeln kann der Schiedsrichter angemessene Strafen gem&auml;&szlig; der offiziellen TournamentRules von Riot geltend machen.\r\n- Verlust des Bannrechts bei diesem/n&auml;chstem Spiel.\r\n- Disqualifikation eines Teammitglieds.\r\n- Disqualifikation eines Teams bzw. automatischer Verlust der laufenden/n&auml;chsten Runde.\r\nAnsteigende Strafen:\r\nVerwarnung &rarr; Verwarnung &rarr; Verlust der Seitenwahl &rarr; Verlust des Banns &rarr; Spielniederlage &rarr;Matchniederlage &rarr;Disqualifikation\r\n\r\n\r\n4. Preise\r\n\r\nDie Preise unseres Turniers werden von Riot-Games gestellt.\r\nUm Preise zu erhalten, muss sich jeder Spieler bei Riot f&uuml;r das Event registrieren.\r\n\r\n5. Gut zu wissen\r\n\r\n Zu beachten ist, dass jeder Zeit von Seiten TRG das Spiel gestreamt werden darf und somit die Zuschauerpl&auml;tze immer frei zu halten sind. Zudem liegen die Streamrechte der Spiele ausschlie&szlig;lich bei Tactical Riot Gaming.\r\n Falls Fragen/Probleme aufkommen sollten w&auml;hrend des Turniers nimmt sich die Leitung heraus das Turnier pausieren zu d&uuml;rfen bis alle Fragen/Probleme gekl&auml;rt sind.","replies":[{"poster":"Temja","date":"2016-11-30T19:39:52.396+0000","up_votes":1,"down_votes":0,"body":"Hey zusammen\nIch hab mir das angeschaut und hätte mich gerne noch genauer darüber informiert und wollte auf die Battlefy-Seite gehen. Doch da stand das ihr gar kein Turnier erstellt habt.\nIst immer noch das Turnier geplant?\nGrüssle Temja","replies":[]}]}