{"poster":"bLaDe86","date":"2015-05-02T04:22:05.709+0000","title":"Reclutamento","subforum":"Esport","up_votes":3,"down_votes":1,"body":"Mancano ancora dei posti per cominciare a fare le ranked e i tornei che ci sono in circolazione. Siamo un clan SERIO che non vuole perdi tempo... Vi aspettiamo http://onuclan.forumfree.it/\r\n\r\nLeggete bene il nostro regolamento...A presto","replies":[{"poster":"Re Sombra","date":"2015-05-02T10:32:09.639+0000","up_votes":2,"down_votes":0,"body":"solo una domanda.\navete delle discriminzaioni per i \"bronzi\"???","replies":[{"poster":"bLaDe86","date":"2015-05-02T13:56:26.474+0000","up_votes":3,"down_votes":0,"body":"Assolutamente no sono tutti bene accetti","replies":[]}]},{"poster":"Nesgaffè","date":"2015-07-22T15:43:58.622+0000","up_votes":1,"down_votes":0,"body":"Solo una curiosità:\nAvete intenzione di formare uno o più roster per partecipare ai tornei? \nMi spiego meglio: nel caso in cui esistesse gia un roster per i tornei prevedete di crearne un secondo per far comunque giocare tutti o selezionate solamente i migliori e basta?","replies":[]},{"poster":"BurKerKing","date":"2015-05-20T13:49:56.161+0000","up_votes":1,"down_votes":0,"body":"Io sono disponibile ad unirmi al vostro gruppo, se avete voglia aggiungetemi. Sono argento 5, ma proprio ora devo fare le 3 partite per provare a salire in argento 4. Valutate il mio score e fatemi sapere.\nCiao","replies":[{"poster":"Rüpert","date":"2015-05-20T17:34:54.598+0000","up_votes":1,"down_votes":0,"body":"Lascia post sul forum del sito http://onuclan.forumfree.it/. Valutiamo Persone e Player, non score a se stante.","replies":[]}]},{"poster":"bLaDe86","date":"2015-05-19T07:07:43.123+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]},{"poster":"bLaDe86","date":"2015-05-05T05:04:42.496+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]},{"poster":"Ryuk1980","date":"2015-05-02T16:53:13.038+0000","up_votes":1,"down_votes":0,"body":"Scusate, ma aprite un topic ogni 3 giorni?","replies":[{"poster":"bLaDe86","date":"2015-05-02T18:49:27.091+0000","up_votes":1,"down_votes":0,"body":"Un piccolo aggiornamento visto che l'altro tipic è andato indietro di molto","replies":[{"poster":"Ryuk1980","date":"2015-05-04T14:46:11.417+0000","up_votes":1,"down_votes":0,"body":"si ma dico, basta andare sul primo topic aperto e aggiornare.","replies":[]}]}]},{"poster":"Obeytheswag","date":"2015-05-02T09:51:24.389+0000","up_votes":1,"down_votes":0,"body":"Avete già un roster o state partendo da zero?\nA cosa puntate come team?","replies":[{"poster":"bLaDe86","date":"2015-05-02T13:57:52.812+0000","up_votes":1,"down_votes":0,"body":"Stiamo partendo da zero...puntiamo sempre nel vincere e nel migliorare insieme agli altri....","replies":[{"poster":"bLaDe86","date":"2015-05-03T05:21:26.956+0000","up_votes":1,"down_votes":0,"body":"chiunque voglia info in più mi può aggiungere...bladesephy","replies":[]}]}]},{"poster":"SirZeel","date":"2015-05-02T05:09:21.268+0000","up_votes":1,"down_votes":0,"body":"\"A presto\".\n\nScusa se te lo dico, ma con una presentazione così poco accattivante ed amichevole, davvero ti aspetti che qualcuno si interessi?","replies":[{"poster":"bLaDe86","date":"2015-05-02T05:45:25.188+0000","up_votes":1,"down_votes":1,"body":"E che ho detto di così cattivo? O.o \n\nSe vuoi buttare fango su questa richiesta fai pure ma sinceramente non ho scritto nulla d che, anche perchè ho già messo una presentazione più consona questa è solo per contorno. Poi se valuti un clan per una scritta \" A Presto\" be affari tuoi....\n\nE comunque per fortuna che ci sono player che non si fermano ad una sola presentazione e fanno  comunque richiesta e si trovano molto bene con noi... Mancano dei posti se qualcuno è interessato ben venga lo accogliamo come abbiamo già fatto con altri...\n\nP.S. Siccome è molto indietro il post http://boards.euw.leagueoflegends.com/it/c/esport-it/cEBBQ5im-reclutamento-clan-onu così almeno vedi che ho già fatto una presetazione, basta leggere ","replies":[{"poster":"SirZeel","date":"2015-05-02T14:54:35.305+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bLaDeSephy,realm=EUW,application-id=wqlqxm93,discussion-id=aNeRRbpW,comment-id=00000000,timestamp=2015-05-02T05:45:25.188+0000)\n>\n> E che ho detto di così cattivo? O.o \n> \n> Se vuoi buttare fango su questa richiesta fai pure ma sinceramente non ho scritto nulla d che, anche perchè ho già messo una presentazione più consona questa è solo per contorno. Poi se valuti un clan per una scritta \" A Presto\" be affari tuoi....\n> \n> E comunque per fortuna che ci sono player che non si fermano ad una sola presentazione e fanno  comunque richiesta e si trovano molto bene con noi... Mancano dei posti se qualcuno è interessato ben venga lo accogliamo come abbiamo già fatto con altri...\n> \n> P.S. Siccome è molto indietro il post http://boards.euw.leagueoflegends.com/it/c/esport-it/cEBBQ5im-reclutamento-clan-onu così almeno vedi che ho già fatto una presetazione, basta leggere\n\nNo guarda, stavo facendo un po' di retorica ma evidentemente su un forum non viene resa come dovrebbe.\nIn primis non stavo criticando \"a presto\" [e davvero non capisco come tu sia potuto arrivare ad una conclusione del genere]. Che c'è da criticare in un \"a presto\"? Quello che stavo cercando di sottolineare cominciando con quella frase è l'evidente ossimoro fra una presentazione che non invoglia per nulla ad approfondire la conoscenza del tuo clan ed il dire \"a presto\" come se ti aspettassi che arrivino la metà dei subscriber di Yotobi.\n\nIn secondo luogo non ho buttato fango su niente, non ho insultato e di certo non stavo screditando un clan che nemmeno conosco. Ho solo scritto, a ragione, che hai fatto una presentazione né amichevole né accattivante. Perché? Perché del clan non spieghi nulla, non spieghi i suoi obiettivi, non dici chi sei, perché state reclutando, cosa offrite e nessun tipo di informazione in generale. Tutto quello che si nota in questa presentazione è che siete un clan \"SERIO\"... e lasciami dire che, a meno di voler partecipare agli LCS, prendere sul \"SERIO\" un videogioco [a maggior ragione un f2p] non è davvero un catcher affidabile.\n\nHo letto l'altra presentazione e di certo è fatta molto, molto meglio, ma come hai detto tu stesso è molto indietro ed è sicuramente passata inosservata. Non puoi pretendere che la gente si ricordi un topic con 7 risposte [di cui 5 riguardano un altro videogioco] di più di due settimane fa.\n\nSpero di essermi spiegato in maniera più comprensibile.","replies":[{"poster":"bLaDe86","date":"2015-05-02T16:51:36.690+0000","up_votes":1,"down_votes":0,"body":"Certamente ora la tua risposta la prendo più come consiglio che altro.... il fatto di serietà e generico nel senso che comunque non ci sono i classici bimbiminkia ci sono persone mature e adulte che Comunque hanno voglia di iscriversi ai tornei e quindi puntare a vincere sempre sapendo che è un gioco....  speriamo che le persone non si fermano all'apparenza","replies":[]}]}]}]}]}