{"poster":"Ytnoos","date":"2018-01-04T21:45:45.334+0000","title":"Piazzamento","subforum":"Creazioni della community","up_votes":1,"down_votes":1,"body":"Ho finito la season7 in silver4, in pre-season ho rankato e adesso sono gold2 e mi aspetto di arrivare platino5 entro l&#039;inizio della season 8. Se le piazzamento dovessero andare discretamente in che lega potrebbe piazzarmi?","replies":[{"poster":"FireM1nd","date":"2018-01-05T10:34:24.175+0000","up_votes":2,"down_votes":1,"body":"Dipende dall'mmr.  E l'mmr dipende da come vinci. Ad esempio: Mettiamo che ne vinci 7 su 10. Come le hai vinte?\n\n-  1) W/W/L/W/W/W/L/W/L/W  > probabile g4-g3\n\n- 2) W/W/W/W/W/W/W/L/L/L  > probabile g5-g4\n\n- 3) L/L/L/W/W/W/W/W/W/W  > probabile g2-g1\n\nTieni a mente che ciò che influenza maggiormente l'mmr sono:\n\n- i dati più recenti\n\n- le streak (serie win/lose)\n\nQuesto perché il sistema è sensibile, e tende all'azzeramento dell'oscillazione del risultato.  In pratica, esso tiene più conto del presente che del passato. Quindi, come hai potuto notare, a seconda di come vinci le partite puoi essere piazzato in un ventaglio di possibilità che copre un'intera lega. Anche se hai vinto 7 partite di seguito, 2) quello che vede il sistema è che ora ne hai perse 3 di fila. Quindi, è portato a mettere in dubbio il dato precedente perché ora ve ne è uno che lo contraddice, e anche di molto. Naturalmente,  maggiore è il numero di partite fatte dall'account, e più dati avrà il sistema da analizzare, di conseguenza,  premierà/punira' di meno.","replies":[{"poster":"Ytnoos","date":"2018-01-05T17:28:01.416+0000","up_votes":1,"down_votes":1,"body":"Grazie mille per la risposta!","replies":[]}]},{"poster":"Bluishlion","date":"2018-01-05T10:01:44.660+0000","up_votes":1,"down_votes":1,"body":"Mate gioca da solo senno avrai difficoltá. Comunque se arrivi plat 5 prima dell inizio della season ti metteranno credo gold4-5.","replies":[]},{"poster":"Clearωay","date":"2018-01-04T21:53:46.159+0000","up_votes":1,"down_votes":1,"body":"Se arrivi plat 5 ti metteranno gold 4-5","replies":[]}]}