{"poster":"SFCFlo","date":"2016-09-08T19:13:12.997+0000","title":"Lags während der Akku des laptop lädt","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Hallo zusammen,\r\n\r\nIch hab nun seit kurzen das komische Problem das ich w&auml;hrend der Laptop den Akku l&auml;dt ich lags im game habe. Der Ping springt eigentlich immer so zwischen 38 und knapp 1000 herum. \r\nStandardping bei mir w&auml;re 38-43.\r\nIch glaube der Ping selbst ist hier selbst nicht wirklich das Problem ich bin nur noch nicht darauf gekommen was das Problem sein kann.\r\n\r\nHabt Ihr vielleicht eine Idee was ich tun k&ouml;nnte?\r\nW10\r\n\r\nLG\r\nSFCFlo","replies":[{"poster":"DieSacknîere","date":"2016-09-08T19:26:42.366+0000","up_votes":1,"down_votes":0,"body":"Fällt mir nicht viel ein.. wie schaut denn deine CPU-Auslastung oder die Temperatur des Laptops aus während dem spielen/aufladen?\n\n- Check mal deine Energiespar-Einstellungen (Doppelklick auf Akkustatus normalerweise)\n- Aktueller Treiber vom Laptop Hersteller drauf?\n- Vielleicht ist das Netzteil etwas defekt und kann deswegen nicht ausreichend Strom liefern.\n- Ansonsten beim Hersteller Support mal nachfragen.","replies":[{"poster":"SFCFlo","date":"2016-09-09T06:34:44.822+0000","up_votes":1,"down_votes":0,"body":"Ich habe gestern am Abend dann noch nach Updates suchen lassen und diese Installiert. Muss dann heute nochmal versuchen wie es sich mit den Problemen steht.","replies":[{"poster":"Yaxtee","date":"2016-09-09T14:12:28.509+0000","up_votes":1,"down_votes":0,"body":"Eigentlich hat die CPU auslastung nicht viel mit dem Ping zu tun, dann hätte er eher FPS Probleme.\nKriegst du die Probleme denn Wirklich nur, wenn das Ladegerät angeschlossen ist?\nUnd ich glaube ein 1000er Ping ist sehr wohl ein Problem :D\nSpielst du mit WLAN und kannst testweise eine LAN Verbindung benutzen?\nWenn das nicht klappt, erstell am besten mal ein Tracert :)\n\nEin tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\nZusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\nEin gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\nhttps://www.pingplotter.com/download.html\nUm ein Log zu erstellen, ladet das Programm bitte runter und stellt es dann folgendermaßen ein:\n\nTrace Interval: 1 second\nFocus Time: all\nTarget Name: 185.40.65.1\nStartet das Programm dann über den grünen Button oben links und lasst es laufen, während ihr im Spiel seid.\nWenn während des Spiels Probleme aufgetreten sind, ist das Log verwertbar und kann folgendermaßen im Forum geteilt werden:\n\nEdit -> Copy as Text\nGeht nach Pastebin.com\nFügt das kopierte Log unter \"New Paste\" ein und klickt auf \"Create new Paste\"\nKopiert den Link zum Log auf Pastebin aus der Adressleiste und fügt diesen in euren Forenpost ein.","replies":[]}]}]}]}