{"poster":"TheLostOnes","date":"2016-07-23T19:33:00.783+0000","title":"Matchmaking PLS FIX IT","subforum":"Allgemeiner Chat","embed":{"description":null,"url":"http://puu.sh/qbUgT.png","image":null},"up_votes":2,"down_votes":2,"body":"Wann wird das Matchmaking endlich gefixxt ? Wie kann sowas &uuml;berhaupt zustande kommen ? wo soll das im geringsten fair sein ?","replies":[{"poster":"Rambi","date":"2016-07-24T01:04:24.906+0000","up_votes":2,"down_votes":0,"body":"Du bist da offensichtlich am smurfen, sowie mindestens ein weiterer Spieler aus deinem Team. Riot erkennt Smurfs an ihrer Spielweise und matcht die Accounts, unabhängig vom Level, mit anderen Smurfs oder gleichwertigen Spielern.\nDamit wird verhindert dass erfahrenere Spieler sich einen neuen Account machen und bis Level 30 einfach neue Spieler abziehen um ihr Selbstwertgefühl aufzubessern. \nDas ist jetzt nicht auf dich persönlich bezogen, aber von der Sorte gibt es in unserer Community ja mehr als genug :)","replies":[]},{"poster":"TerrorRaven","date":"2016-07-23T19:55:35.092+0000","up_votes":2,"down_votes":1,"body":"Zum gefühlt millionsten Mal: Normals und Ranked haben voneinander unabhängige MMR. Auch durch Premades aus unterschiedlichen Elos können solche Zusammensetzungen halt passieren. Und nein, so einfach kann man das nicht fixen (im Prinzip her fast gar nicht).","replies":[{"poster":"TheLostOnes","date":"2016-07-23T21:10:14.612+0000","up_votes":1,"down_votes":5,"body":"Rito kann den scheiß seid 6 jahren net fixen , die verdienen milliarden und sind zu dumm es zu fixen. Die sollen einfach allen die über bronze sind mit unter lv 30 zu spielen !!!","replies":[{"poster":"TerrorRaven","date":"2016-07-23T21:43:21.015+0000","up_votes":2,"down_votes":0,"body":"Hast du nicht richtig gelesen? Normals und Ranked haben eine voneinander **unabhängige** MMR.","replies":[]}]},{"poster":"Ninja Modus","date":"2016-07-24T01:51:25.291+0000","up_votes":1,"down_votes":0,"body":"Es gibt 2 Normals einmal Blind und einmal Abwechselnt. \nWas soll bitte das Blind pick dort meckert doch jeder das die Mid Lane für ihn seiin.\n\nBlind raus und einfach, \nUnranked mit Bronze Silver und Gold,\nGold mit Platin,\nPlatin mit Diamond,\nDiamond mit Master und Challanger, wegen der wartezeit.\n\nAbwechselt kann man ja dann einfach so unfair lassen. Hatte gerade ein Spiel gegen 3 Dia und 2 Platin, bin selber Silver 2 das ist nice oder war nur futter ist voll fair.","replies":[{"poster":"TerrorRaven","date":"2016-07-24T04:05:43.229+0000","up_votes":1,"down_votes":0,"body":"So einfach funktioniert das nicht. Du musst dir Normals wie Ranked vorstellen, nur das du nicht weist, in welcher Division du bist.","replies":[]}]}]},{"poster":"Neamhoilte","date":"2016-07-23T19:37:52.631+0000","up_votes":2,"down_votes":3,"body":"Ich rieche schon die obligatorischen Schönredner in ihren Löchern scharren. \n\n{{sticker:slayer-jinx-wink}} \n\n@TE: Schönes Beispiel","replies":[{"poster":"Der Großmugister","date":"2016-07-23T21:52:38.529+0000","up_votes":2,"down_votes":1,"body":"Also auch wenn ich meinem König ja ungern widerspreche (gelogen!), aber, das Matchmaking in LoL ist doch eigentlich super.\nIch sehe da absolut keine Alternative zu und ich hatte auch noch nie Grund mich zu beschweren.\n\nGerade in letzter Zeit läuft bei Riot einiges verkehrt, aber das Matchmaking ist gut wie eh und jeh.","replies":[{"poster":"Ninja Modus","date":"2016-07-24T01:38:05.737+0000","up_votes":1,"down_votes":0,"body":"Kann es sein das du Platin oder höher bist ? \nIch bin Silver 2 und hatte gerade ein Spiel gegen 3 Dia und 2 Platin.\nFalls du es nicht weißt BRONZE, SILBER, GOLD, PLATIN, DIAMOND, MASTER und CHALLANGER das sind die Ligen. Gold geht ja noch aber was zum Teufel soll ich mit high Platin und Diamond machen ?\n\nBin gerade deswegen auch Toxic versuche Sona zu lernen wie soll das bitte hier bei möglich sein ?\n\nDu hattest noch nie einen Grund dich zu beschweren, normal wenn man auf die kleinen einschlagen kann und sich free wins hollt.","replies":[{"poster":"Der Großmugister","date":"2016-07-24T08:48:32.886+0000","up_votes":1,"down_votes":0,"body":"Ich war letzte Season Platin, ja und in Normals wurde ich gegen silber/gold gematcht, weißt du auch wieso? Weil ich in Normals immer nur Dinge probiere, die ich noch nicht kann, ADC zum Beispiel.\nDarum verliere ich auch über 50% der Spiele gegen/mit diesen Menschen, denn mein Skill mit dem was ich in Normals spiele, ist auf dem selben oder eher einem niedrigeren Level als der ihre.\n\nAlso vonwegen auf die Kleinen einschlagen, die machen mich regelmäßig lang diese \"Kleinen\".\n\nDie MMR hat ja schon einen Sinn, die Leute denen ich zugeteilt werde, entsprechen nunmal meinem leistungsniveau in Normals, das selbe ist es bei dir.\nEs gibt keinen Grund sich über die Farbe des Rahmens zu beklagen, der sagt in dem Fall nichts aus.","replies":[]}]}]}]},{"poster":"INF NuBaS","date":"2016-07-24T11:13:30.159+0000","up_votes":1,"down_votes":0,"body":"Beste leute... Smurfen und machen damit genau das worüber Sie sich aufregen.\nKa was alle habe ich freu mich extrem wenn ich gegen High Elo spiele.\n\nMfg NuBaS","replies":[]},{"poster":"DeSyNcr0N","date":"2016-07-24T01:00:50.103+0000","up_votes":1,"down_votes":0,"body":"Ich werde fast immer mit Leuten aus niedrigerer Elo gematcht in Normals - ist also ganz \"normal\". Aber ich werde halt eigentlich nie mit Leuten unter Level30 gematcht. Das finde ich dann auch schlecht, zumal es ein großer Unterschied ist mit Masteries und Runen gegen einen zu spielen der keine Runen und Masteries hat, aber du bist eben ein Smurf und mein Smurf musste auch da durch. x)\nNaja in Normals bin ich aber auch ein richtiger Troll halt und spiele da halt nur zum \"abkühlen\" und Spaß haben, deshalb resultiert sich auch nicht jedes Normal als ein Wn trotz 3 Divisionen Unterschied. Das was mich stört, ist aber das immer andere denken ich mache jetzt den full Tryhard und knocke sie aus dem Spiel und schreiben direkt in den All Chat \"GG Diamond SUR@20\" \"no diamond in my team only silver plastics..\"  ^^\nGebt euch mal mein Viktor Spiel :D Ich bin da förmlich in die Gegner reingelaufen, weil irgendwann hatte ich auch keine Lust mehr. :D","replies":[]},{"poster":"Phazôn","date":"2016-07-23T20:03:22.222+0000","up_votes":1,"down_votes":0,"body":"ich bin silber und werd teilweise mit platin dudes gematched ._. zwischendurch mal dia  aber ich glaub  die gammeln auf gold mmr rum bzw ich auch ._.","replies":[]},{"poster":"YanKYhii","date":"2016-07-23T22:18:22.361+0000","up_votes":1,"down_votes":1,"body":"Nach 6 jahren immernoch lv 11 ? Ne spaß, aber von smurfen wird es auch nicht besser","replies":[]}]}