{"poster":"FiinixD","date":"2017-03-18T21:57:30.807+0000","title":"Starke Lagschwankungen seit Patch 7.4","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo liebe Community \r\nAlso ich habe Diverse Lagprobleme und zwar ich versuche zu erkl&auml;ren:\r\nIch starte das Spiel normal Ping 49 ms und ich spiele dann kommen die Minions dann geht er kurz hoch auf 121 ms und dann wieder runter dann greif ich zum beispiel ein minion hat bekomme Gold der Ping geht wieder hoch. Geh ins Geb&uuml;sch der Ping geht wieder hoch. Und das geht halt die Ganze zeit so.\r\nF&uuml;r mich wirkt das irgendwie so ob ich Paket Verlust habe. Aber kein Plan wie man das feststellen kann.","replies":[{"poster":"Gin","date":"2017-03-19T15:17:56.989+0000","up_votes":1,"down_votes":0,"body":"Erstell mal einen Tracert:\n\n> Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n> Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n> Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\n> https://www.pingplotter.com/download.html \n> Um ein Log zu erstellen, ladet das Programm bitte runter und stellt es dann folgendermaßen ein:\n> \n> Trace Interval: 1 second\n> Focus Time: all\n> Target Name: 185.40.65.1\n> Startet das Programm dann über den grünen Button oben links und lasst es laufen, während ihr im Spiel seid.\n> Wenn während des Spiels Probleme aufgetreten sind, ist das Log verwertbar und kann folgendermaßen im Forum geteilt werden:\n> \n> Edit -> Copy as Text\n> Geht nach [Pastebin.com](http://pastebin.com/)\n> Fügt das kopierte Log unter \"New Paste\" ein und klickt auf \"Create new Paste\"\n> Kopiert den Link zum Log auf Pastebin aus der Adressleiste und fügt diesen in euren Forenpost ein.","replies":[{"poster":"FiinixD","date":"2017-04-02T01:59:25.409+0000","up_votes":0,"down_votes":0,"body":"So hatte nicht gerechnet das mir einer zurück schreibt :D\nhier einmal der link\nhttps://pastebin.com/VmSgnxd9","replies":[]}]}]}