{"poster":"Fuyu","date":"2015-12-31T12:31:08.549+0000","title":"Support LFT - Cercasi Team Serio","subforum":"Reclutamento","up_votes":2,"down_votes":0,"body":"Ciao a tutti! Sono un giocatore di 20 anni abbastanza recente, gioco circa da un annetto e mezzo, ma ho preso abbastanza dimestichezza col gioco e il ruolo del support &egrave; quello che mi piace di pi&ugrave; e in cui mi trovo meglio, sebbene mi piacciano anche gli altri. Cerco un Team con cui affrontare una scalata verso i pi&ugrave; alti gradini della lega e con cui allo stesso tempo mantenere un rapporto di seriet&agrave; (per quanto riguarda le partite), ma allo stesso tempo essere amichevoli e divertirsi senza flammare. Maino Thresh, ma uso pi&ugrave; o meno tutti i support, anche se tendo a prediligere i tank da engage. Spero di essere stato esaustivo abbastanza, attendo risposte! Bye summoners!","replies":[{"poster":"Reonida","date":"2015-12-31T13:27:37.957+0000","up_votes":2,"down_votes":0,"body":"io ho un team in costruzione  e ci manca un support... abbiamo il top laner fuori gioco per un po a causa di un torneo di cod però se hai la pazienza di aspettarlo le porte sono aperte","replies":[{"poster":"Fuyu","date":"2015-12-31T13:41:30.392+0000","up_votes":1,"down_votes":1,"body":"Ti aggiungo su lol per parlarne meglio :)","replies":[]}]},{"poster":"Jackeg","date":"2016-01-02T09:12:18.380+0000","up_votes":1,"down_votes":0,"body":"Ciao io ho 19 anni,maino la midlane, e sono S3/2, l'unico problema è che per lavoro sono disponibile solo la sera, se non è un problema ci sono ;)","replies":[]},{"poster":"Imromano","date":"2015-12-31T16:14:38.800+0000","up_votes":1,"down_votes":0,"body":"Io sarei interessato alla cosa... sto cercando un team serio con cui giocare possiedo un team speak dove possiamo trovarci e dive sto cercando di crare una communty di lol se vuoi parliamo meglio aggiungimi su lol il mio nick è imromano oppure vieni su team speak ip: ts.dognetwork.it","replies":[{"poster":"Fuyu","date":"2016-01-01T11:40:09.067+0000","up_votes":1,"down_votes":0,"body":"Ti faccio sapere, grazie per la richiesta ^^","replies":[]}]}]}