{"poster":"gotaR","date":"2015-07-07T05:36:34.226+0000","title":"¡Lee Sin desparece del meta!","subforum":"Charlas Generales","up_votes":1,"down_votes":8,"body":"**Hola muchachada de League of Legends**\r\n\r\nHoy les vengo a hablar sobre nuestro calvo y ciego favorito.\r\n\r\n {{champion:64}}  :_No se si soy solo yo quien piensa que Lee Sin ya no es lo mismo que antes, no se si eso de la meta tanque exista pero si es as&iacute; ya no rinde mas Lee Sin, en mi opini&oacute;n lo veo muy atr&aacute;s, lo use mucho tiempo a este personaje y puedo notar que es mas dif&iacute;cil (Incluso para mi) usarlo bien ahora..._\r\n\r\nEn caso de que sea solo yo quien lo vea as&iacute;, que podr&iacute;a mejorar o que podr&iacute;a hacer yo para adaptarme al nuevo &quot;Meta&quot;.\r\n\r\n_**Gracias de ante mano \r\nATTE: iSecond**_","replies":[{"poster":"YMCA Taric","date":"2015-07-07T06:34:17.050+0000","up_votes":3,"down_votes":0,"body":"Eso del meta de tanques es una gran mentira , están mas fuertes nada mas","replies":[{"poster":"MatiasZERO","date":"2015-07-07T08:08:44.994+0000","up_votes":1,"down_votes":0,"body":"Que estén más fuertes lleva a que se usen en todos lados. Si se usan en todos lados estamos en el meta de tankes...-","replies":[]}]},{"poster":"mauro71404","date":"2015-07-07T06:42:51.744+0000","up_votes":4,"down_votes":1,"body":"Lee sin esta bien, si lo sabes usar claro..","replies":[]},{"poster":"JACKY FANBOY","date":"2015-07-07T12:29:01.691+0000","up_votes":2,"down_votes":1,"body":"lee sin sigue estando igual de fuerte si lo sabes usar :)\n\n{{item:3709}} {{item:3117}} {{item:2049}} {{item:3143}} {{item:3102}} {{item:3083}} {{item:3364}} ","replies":[{"poster":"Jancho","date":"2015-07-07T13:06:51.179+0000","up_votes":1,"down_votes":0,"body":"El potencial de Lee Sin es el early, haciendolo Full Tanque solo lo adaptas al meta, en donde hay campeones mucho más fuertes que él, campeones que escalan mejor en Late, que poseen 2 o 3 habilidades de un gran CC, Lee antes estaba fuerte ya que el Meta se centraba en carrear individualmente, meter daño por montones y terminar una partida rapido, a diferencia de ahora.","replies":[{"poster":"JACKY FANBOY","date":"2015-07-07T13:32:51.946+0000","up_votes":1,"down_votes":0,"body":"hoy en dia tienes que ver mas por el mid-late sin dejar de arrazar en early, aunque la BUILD sea de defensa se equilibra con RUNAS y MAESTRIAS de ataque","replies":[{"poster":"Jancho","date":"2015-07-07T13:56:30.752+0000","up_votes":1,"down_votes":0,"body":"Pero estamos hablando del  Meta, no digo que esté mal Lee Sin, pero no es la mejor opción tampoco, solo compara un 1 vs 1 de Lee Sin contra Sejuani o Gragas en Late, por ejemplo, o la utilidad que esta misma comparación puede entregar en una Tf, insisto en Late.","replies":[{"poster":"JACKY FANBOY","date":"2015-07-07T14:05:07.221+0000","up_votes":1,"down_votes":0,"body":"bueno aunque supongo que concordamos en que si tienes muchos tankes en tu team te lo haces offtank y si son papeles tanke  {{champion:37}}\nencuentro que el velo va si o si para poder hacer bien el insec :v","replies":[]}]}]}]}]},{"poster":"potato support","date":"2015-07-07T18:07:04.310+0000","up_votes":1,"down_votes":0,"body":"para adaptarte al nuevo meta, adaptate a lo que es la nueva meta.\n\n{{champion:20}} {{champion:113}} {{champion:79}} {{champion:421}} \n\nno te quedes _mirando_ al pasado.","replies":[]},{"poster":"Mohno","date":"2015-07-07T17:43:37.297+0000","up_votes":1,"down_votes":0,"body":"Dependiendo de la composición del team enemigo y la tuya... yo uso lee siempre que mi team tiene un top y support offtank, asi ellos seria el frente de la TF y a lee lo uso para para cubrir al adc, hacer daño e iniciar.\nTambien lo uso cuanto tengo un team full early y mid game, asi presiono mucho mas para que la partida se gane rapido y evitemos el escalado en late del team enemigo.","replies":[]},{"poster":"KNT Kekka","date":"2015-07-07T15:25:39.642+0000","up_votes":1,"down_votes":0,"body":"Nunca va a volver a ser el mismo de hace 2-3 años","replies":[]}]}