{"poster":"Code name Bullet","date":"2014-05-18T20:17:50.768+0000","title":"Curse Voice","subforum":"Általános beszélgetés","up_votes":1,"down_votes":1,"body":"Ez egy ügyes kis dolog, olyan mint a team speak csak ez benne van a lol-ban,\r\nés nem kell privát szerver hozzá. Szeretném a magyar játékosokat  ezen remek kis program beszerzésére buzdítani. Ha már mind egy nyelven beszélünk! \r\nMeg különben is, nem lenne jó, ha össze kerülsz egy magyar játékossal és rögtön \"előnyben\" lennétek az ellenféllel szemben?\r\n\r\n[Itt](http://beta.cursevoice.com/)  lehet letölteni, talán pár napot várni kell még küldenek kulcsot, de megéri.","replies":[{"poster":"4Bullet4Kill4Me","date":"2014-05-19T15:08:12.990+0000","up_votes":1,"down_votes":0,"body":"Nagy külömbség amig a TS eszik kb 20 megát memoriából, addig CRS Voice eszik 100-120 körül, overlayel együtt, szerintem annyira neméri meg olyan embereknek akik 2-3GB Ram körül csapatják a fájást","replies":[{"poster":"benstone326","date":"2014-05-20T07:26:04.376+0000","up_votes":1,"down_votes":0,"body":"Én a RaidCallról hallottam jókat. Bár élesben még nem próbáltam, mert mi is TS-sel nyomjuk.","replies":[{"poster":"EGC Shred","date":"2014-05-20T07:33:30.313+0000","up_votes":1,"down_votes":0,"body":"Én egyszer kipróbáltam, de másfél percet késett a hang, és az kicsit elvette tőle a kedvem :D","replies":[]}]}]},{"poster":"Code name Bullet","date":"2014-05-20T03:26:14.276+0000","up_votes":1,"down_votes":0,"body":"Nekem sokkal jobban tetszik CV. Nagyon egyszerű, gyors, hatékony. És nem hinném hogy a TS jobb lenne bármilyen szempontból is.Mondjuk tény hogy nincs rengeteg funkció benne még, de ez csak a béta. Persze mindenki azt használja ami tetszik neki.","replies":[{"poster":"EGC Shred","date":"2014-05-20T05:23:04.837+0000","up_votes":1,"down_votes":0,"body":"Nem mondom, hogy én nem használtam a Voice-ot, sőt, mai napig használom néha, de már annyira hozzászoktam a Teamspeak hangjához, meg a mikrofonok gusztustalan alapzajához, hogy ha nem hallom a zúgást meg az alapesetben kicsivel rosszabb minőséget amit a Speex kodek produkál, akkor szinte kényelmetlenül érzem magam.\n\nEgyébként a billentyűparancsok nekem nagyon hiányoznak a Curse-ből. Bár ott vannak a gombok játék közben, de mikor két játék között beszélünk akkor külön fel kell nyitnom a programot a tálcáról csak azért, hogy lenémítsam a mikrofonomat. Nekem kb. ez az egy funkció hiányzik, többet amúgy se nagyon használok.","replies":[]}]},{"poster":"Looter","date":"2014-05-19T06:31:01.914+0000","up_votes":1,"down_votes":0,"body":"Én eddig is ismerőseimmel játszottam. van saját ts szerverünk, egy szobában vagyunk végig. Szerintem ez a curse voice inkább a timerek miatt éri meg. Más miatt annyira nem.","replies":[{"poster":"EGC Shred","date":"2014-05-19T06:43:00.933+0000","up_votes":1,"down_votes":0,"body":"Már rég nincs benne semmiféle timer, mert Rito kérésére kiszedték őket.","replies":[]}]},{"poster":"EGC Shred","date":"2014-05-19T05:07:51.424+0000","up_votes":1,"down_votes":0,"body":"Nem kell várni, mert már nyílt béta a program, szabadon letölthető és használható, bár ha Ritót kérdeznéd azt mondaná, hogy nem örül neki...\n\nEgyébként szerintem aki eddig Teamspeaket használt az ezután is azt fog, részemről én is inkább maradtam annál. Tény, hogy ahhoz valóban szükség van egy szerverre is, de ha ez megvan, akkor egyértelmű melyik a jobb.","replies":[]}]}