{"poster":"Something Snazzy","date":"2016-02-14T18:22:02.464+0000","title":"Can we get some kind of cap on filling the same lane three times in a row?","subforum":"Gameplay","up_votes":109,"down_votes":5,"body":"I was jungle first pick, fill second pick and three games in a row I got support.  I don&#039;t mind support and I would be happy being support more than 1/5 of the time... but can there be some sort of cap of having to fill the same lane again and again?\r\n\r\nAlso, does Riot publish any stats on how many &quot;fills&quot; end up as support and/or how often &quot;fill&quot; as a second pick is chosen?  I feel like I am getting my second pick 5x as often as my main whenever my second pick is &quot;fill&quot; and that seems wrong.","replies":[{"poster":"Hayaishi2","date":"2016-02-14T19:34:19.533+0000","up_votes":43,"down_votes":1,"body":"\"Fill\" should be renamed to support because that's all you'll ever get with it.","replies":[{"poster":"Qsario","date":"2016-02-15T02:09:07.909+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Hayaishi2,realm=NA,application-id=3ErqAdtq,discussion-id=kmeaEFRR,comment-id=0001,timestamp=2016-02-14T19:34:19.533+0000)\n>\n> \"Fill\" should be renamed to support because that's all you'll ever get with it.\n\nI wish that were true.\n\nI'm pretty much a dedicated support, so I choose support/mid and I get mid...","replies":[{"poster":"VexingRaven","date":"2016-02-15T03:32:14.275+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Qsario,realm=NA,application-id=3ErqAdtq,discussion-id=kmeaEFRR,comment-id=00010000,timestamp=2016-02-15T02:09:07.909+0000)\n>\n> I wish that were true.\n> \n> I'm pretty much a dedicated support, so I choose support/mid and I get mid...\n\nSo fills always get support... But support/mid gets mid. I think this showcases pretty well how awful dynamic queue is at placing people. I'd rather wait another minute or 2 to get my preferred role and have most other people on my team also get their preferred role.","replies":[{"poster":"yoniame","date":"2016-02-15T07:26:50.832+0000","up_votes":2,"down_votes":0,"body":"last time i tried this queue as support/fill i didn't get a team in 30min then gave up","replies":[]}]},{"poster":"T RexHasTinyArms","date":"2016-02-15T14:58:37.496+0000","up_votes":1,"down_votes":0,"body":"Does support/fill get you support less often than support mid? If not then why are you going support/mid instead of support fill? It seems like the game checks for available games for your choice 1 then for games for your choice 2 so sometimes you end up w/ choice 2 even if it is a highly picked role bc it happened to time the search right that it didn't find a game starting for your first choice that is less picked, but did for your second pick bc the timing was right. Support/fill seems like it would get you support more often bc support is in high demand and it lets the game check for support on both passes (unless it doesn't check for your main role when it checks for spots that need filled, which seems stupid, but I don't play fill so I'm not sure if you can get it or not, or how you would know).","replies":[]}]}]},{"poster":"Something Snazzy","date":"2016-02-14T19:14:54.496+0000","up_votes":18,"down_votes":0,"body":"Four times in a row now.\n\n*edit*  I do appreciate the fact that my queue times have been pretty much nonexistent.... but come on.  I'd rather wait 30 seconds (or even several minutes) than have \"fill\" be a second choice for support.","replies":[]},{"poster":"Marshbouy","date":"2016-02-14T21:48:06.977+0000","up_votes":3,"down_votes":2,"body":"fill sends you to whatever lane is open in a group. the algorithm is trying to fit puzzle pieces together and a fill person can go anywhere, usually that spot is support. dont want support? dont be fill and dont try to change the fill option because then it isnt really \"fill\"","replies":[{"poster":"Something Snazzy","date":"2016-02-14T21:59:06.783+0000","up_votes":6,"down_votes":0,"body":"But a simple weighting system can make it so that we fill AND don't play the same role EVERY TIME","replies":[]},{"poster":"Vellich0r","date":"2016-02-14T23:10:18.448+0000","up_votes":5,"down_votes":0,"body":"fill is meant to shorten queue times, but since it is a near guarantee you go support people refuse to fill because it means they have to become a support main.","replies":[{"poster":"T RexHasTinyArms","date":"2016-02-15T15:01:50.176+0000","up_votes":1,"down_votes":0,"body":"Yeah, but I don't know that this is an issue w/ the fill option so much as what happens due to the ecosystem of ranked. If the decision is that people really should get the option for more diversity than 2 roles, why not just make it a check list and let people que for 3 or even 4 roles?","replies":[{"poster":"Vellich0r","date":"2016-02-15T15:50:21.838+0000","up_votes":2,"down_votes":1,"body":"The issue, again, isnt diversity of roles beyond two. its that fill, as a secondary option, gives you almost 100% uptime in the same role which isn't your primary choice. This IS an issue with the ecosystem of ranked; however, that is making the ecosystem and queue times worse since it destroys the will of most people to pick that dreaded fill. Even support mains wouldn't fill secondary, and thats pretty ridiculous as an ecosystem, so weighting it slightly better should improve your odds of getting your main role at least 33% of the time. Honestly, if it just made it so that you couldn't get the same role twice in a row if you picked fill, then it would still be able to puzzle piece teams together and you would have about 33% main role, 33% support, and 33% all other roles.","replies":[{"poster":"T RexHasTinyArms","date":"2016-02-16T06:34:26.961+0000","up_votes":1,"down_votes":0,"body":"What I was trying to say, albeit poorly worded apparently, is that the issue isn't that fill doesn't function right, but that there are not more roles which need filling. Fill is not an option that was originally designed to be an even distribution of different roles (at least not that I heard devs mention), but rather a choice that would put you in what ever role was needed on a certain team. If you are having 100% up time in the same role I'd argue this is 100% an ecosystem issue. \n\nIf you pretend that que placement functions like brain communication it's a pretty simple concept I think. The brain communicates by an axon at the end of a cell releasing chemicals (neurotransmitters) which float through the fluid between cells and hit the receptors on the dendrite of the next brain cell and cause it to react sending information down the chain. The que population is the axon, the games are the dendrites, and what roles people pick are the type of NT they are. Specific neurotransmitters only bind to specific receptors on the dendrites, so if you have 200  top players, 200 mid players, 200 ADC players, 200 jungle players, 100 support players, and 100 fill players (who can be considered as all 5 types at once), then before we even consider pairing based on making games of 5 a fill player SHOULD be picked as support almost twice as often as any other role. Basically because there are sites that pick up the role they need, and the fill players in our 1k players are 1/3 of any non support role (100 fill players + 200 of the role can be picked for that role), but a larger 1/2 of support roles (100 fill + 100 support) then the support receptors pick up fill players more often bc the fill players aren't displaced by the role specific players taking up those sites. Now if we add in the fact that a game has to receive all 5 roles before it starts the chance a fill player is picked to play support goes way up. With these 1k players the only way to have 200 games would be if all fill players were support, so for every fill player who gets picked by a receptor that isn't a support receptor there is now an only support needed game left hanging around + a non support role player hanging around for when the next 1k players are matched for games. As this continues the number of possible non fill choices that a game can receive for any role other than support goes up (thus reducing the % of that role that fill would account for if the receptors are getting the players randomly), and the number of support receptors (games needing the role) goes up as well. Every rotation the system makes it finds an ecosystem that pushes it more and more toward placing fill players in the support role.\n\nThus if fill as a role is intended to fill needed roles and create shorter que times, the ecosystem of league will inherently be an issue that makes fill primarily a support role. If on the other hand the idea is that fill is needed for players who want to play different roles than just 1 or 2 (ie you don't want to just play support/jungle or top/mid, but a bit of everything)  then simply making it an option to que for up to 5 roles would solve the problem, because you just drop rolls out as you get to play them. So maybe you que as all 5, get support, then que as the other 4 but not support for 2 or 3 games, then add support back in so you can play support as well. Thus you have a way to play a bit of everything.","replies":[]}]}]}]},{"poster":"Abyssphere","date":"2016-02-15T13:31:55.114+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Marshbouy,realm=NA,application-id=3ErqAdtq,discussion-id=kmeaEFRR,comment-id=000b,timestamp=2016-02-14T21:48:06.977+0000)\n>\n> fill sends you to whatever lane is open in a group. the algorithm is trying to fit puzzle pieces together and a fill person can go anywhere, usually that spot is support. dont want support? dont be fill and dont try to change the fill option because then it isnt really \"fill\"\n\nI think it is a bad idea to discourage people from playing Fill just because they're not willing to... be the whipping boys of champion select. Dynamic Queue wants to make queue times as short as possible and with that goal in mind it is... frankly stupid to simply tell people \"Don't pick fill if you have a problem with it\". The glue that holds Dynamic Queue together is people picking Fill and secondary Support. If people stop picking those because it's a dissatisfying experience then queue times lengthen needlessly.\n\nI mean the complaint of the OP is completely understandable. Most of my friends play every role pretty much equally but they don't like putting Fill because they got bored of getting support game after game, with the occasional jungle. \"Fill\" says you don't have a particular role in mind, but just because you don't main a particular role doesn't mean you're happy to play support all day every day. People don't like repetition in a role they don't main.\n\nAs I said, at the end of the day it is an intrinsically bad idea to tell people not to pick Fill. The system -needs- people to pick Fill, and it needs people to put secondary Support. If people who would otherwise be willing to pick Fill are being forced to avoid it for any reason, it should be discussed.","replies":[{"poster":"T RexHasTinyArms","date":"2016-02-16T06:43:58.863+0000","up_votes":1,"down_votes":0,"body":"Except that the solution isn't to make fill into something else. Above this I wrote a lengthy explanation that fill inherently SHOULD be mostly support if the math isn't doing something really weird to force it not to. If we want an option to get a bit of everything doesn't it make more sense to just have a check list for roles and que for all five roles, but drop support and only que for 4 after you play support until the next time you feel like playing support?\n\nAs long as fill is a role that fills the needed roles of games then it will heavily favor the least played role (support) because that is the ecosystem of the que. If it is not heavily favoring the least played role it is not using fill players to create short que times. So thus if you're not down for playing the least played role in back to back to back games when you're filling then it would be a logical choice to quit queing as fill. It kinda sucks that the ecosystem is like that, but it is. Lying to people and saying \"you should que as a fill player even if you don't want to play mostly support games when you get picked as a fill player\" seems like a worse thing to do than telling someone to change the behavior if they don't like the result.","replies":[]}]},{"poster":"WarlockLaw","date":"2016-02-15T19:26:49.775+0000","up_votes":1,"down_votes":0,"body":"My problem isn't so much in ranked as it is in normals. In normals I usually don't want to play adc, however after that I have no preference so long as I don't land one position too many times.  This becomes at odds with dynamic queue because I play support for 3 games then I have to actually decide between 3 positions which 2 I want to play. \n\nFrankly I've been avoiding ranked in a wait for placements to die down and soloq to return. I just want a way to better enjoy normals without having to actually call roles or play arams/blinds.","replies":[]}]},{"poster":"Anidan","date":"2016-02-14T20:03:11.640+0000","up_votes":1,"down_votes":1,"body":"Wouldn't this just serve to extend queue times even more for need of a support? Probably not that great an idea... \n\"Top/Jungle/Mid/ADC/Support/Support\" those are your options :P","replies":[{"poster":"Something Snazzy","date":"2016-02-14T21:05:22.227+0000","up_votes":6,"down_votes":0,"body":"Well, if people like me (who don't mind playing support occasionally) stop choosing fill because we are ALWAYS getting support... that'll just increase everyone's queue time right?","replies":[]}]},{"poster":"WingsofGulgazor","date":"2016-02-14T22:59:47.069+0000","up_votes":5,"down_votes":0,"body":"at the very least they need a cap on how many times you can get your secondary role. To get support 95% of the time as a secondary role is to much. I don't mind playing support and would in fact probably have support as my main role but I like playing other things every once in a while.","replies":[]},{"poster":"Kaizokumo","date":"2016-02-14T21:52:49.686+0000","up_votes":7,"down_votes":2,"body":"Theres a reason they have this new system in place. \nListen, there is an obvious skew between people who want to play mid, top, and adc compared to support.\nSupport isnt the most lucrative position, the cause of that is simply due to the mentality of the players in the game. \nMore people want to play carry roles instead of support.\nSay for example the amount of people selecting mid top and adc make 90% of the que. Someone selecting fill is at 10%\nthe system opts to fulfill ques as fast as possible. \n\nTL:DR system is not built to bend backwards in favor of the 10% who select fill.","replies":[{"poster":"Something Snazzy","date":"2016-02-14T21:59:29.883+0000","up_votes":4,"down_votes":1,"body":"We should encourage fill.  It keeps queue time down for everyone.  It should be above 10%, this shoves it down to zero.\n\n*edit* also putting some sort of cap or weight on the fill role would have almost no effect on everyone else (if anything, it'd have a positive effect as more people will fill).  So that isn't really bending over backwards","replies":[{"poster":"T RexHasTinyArms","date":"2016-02-16T07:00:58.423+0000","up_votes":1,"down_votes":0,"body":"It would impact other players in some way. It might not be huge, but in order to keep the system from giving support every time it would have to classify them as not support but everything else, and would alter que order in some way (certainly making it slightly longer, possibly making it a huge mess based on how the algorithm was changed). \n\nNow it definitely depends on how many people stop playing fill because of what is open to fill. If 90% of players who would fill if support only showed up as fill role 50% of the time instead of 100% (exaggeration) quit playing fill, then it would be worth changing because the number of games those 90% would play as support every other game would be so much more than half the number of games the 10% would play each day (if the 10% who would play at either 100% or 50% support only play at 50% support then every other game they play that way is a \"lost\" opportunity for the game to find a support, but it is outweighed by the volume of games added by the other players joining if they only have to play every other game as support). \n\nHowever, it's a hard thing to predict where that balance is. The instant that you pass the point where even if support was given more often for fill, there would not be enough players who quit filling that there were less players to pick for support, is the instant where changing the way fill is done begins to harm the que times of other players in a way that doesn't make sense. (If you simply want to just have more variability, just let people que for more than two roles, then you can que for everything except support if you've played too many support games that day)","replies":[{"poster":"Something Snazzy","date":"2016-02-16T07:09:36.160+0000","up_votes":1,"down_votes":0,"body":"I get what you are saying but I don't think we are anywhere near that balance point yet.  It seems like there are too many people fed up with fill because it is NOTHING but support.  It could use tuning back.","replies":[]}]}]}]},{"poster":"TheDuelist999","date":"2016-02-15T03:14:51.171+0000","up_votes":2,"down_votes":0,"body":"PSA here. If you put your secondary as mid you will get your primary","replies":[{"poster":"FortisDominus","date":"2016-02-15T03:51:00.781+0000","up_votes":3,"down_votes":0,"body":"I do this to get jungle every game as well","replies":[]}]},{"poster":"High5","date":"2016-02-15T00:04:45.045+0000","up_votes":3,"down_votes":0,"body":"Yeah, there should either be a bonus for fill or it should limit the amount of time you get the same lane in a row.","replies":[]},{"poster":"Something Snazzy","date":"2016-02-14T23:09:59.615+0000","up_votes":3,"down_votes":0,"body":"All I am saying is that we should accommodate people who want to occasionally play support.  It will make everyone happier.","replies":[]},{"poster":"Something Snazzy","date":"2016-02-14T21:01:21.438+0000","up_votes":3,"down_votes":0,"body":"I guess what bothered me the most about the whole thing is that fill was my SECOND choice too.  Shouldn't you get your first choice at least half the time?","replies":[]},{"poster":"Droogzy","date":"2016-02-14T21:09:30.400+0000","up_votes":4,"down_votes":1,"body":"If you looked at my rank history lately, you'd think I'd be a support main.\n\nBeen putting Jungle First, support secondary.\n\nI think 20 something games so far in ranked this year? Not a single jungle game yet.","replies":[{"poster":"YOLO420SWAGSCOPE","date":"2016-02-14T21:41:49.548+0000","up_votes":2,"down_votes":4,"body":"don't ever pick fill as secondary if u don't want support, its simple","replies":[{"poster":"Droogzy","date":"2016-02-15T00:57:53.834+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=YOLO420SWAGSCOPE,realm=NA,application-id=3ErqAdtq,discussion-id=kmeaEFRR,comment-id=00050000,timestamp=2016-02-14T21:41:49.548+0000)\n>\n> don't ever pick fill as secondary if u don't want support, its simple\n\nPoint of the whole pick selection is that you'd prefer your primary role, but you don't mind playing your prefer secondary occasionally.\n\nIf I had to pick something else just so I specifically won't get the secondary role, that literally defeats the whole point of this new queue system. I don't mind playing support every now and then, but if you place support as secondary, you instantly get placed in a team with the support role when its a secondary preference, it doesn't make sense.","replies":[]}]}]},{"poster":"Flawless Fetus","date":"2016-02-15T15:26:20.035+0000","up_votes":2,"down_votes":0,"body":"I'm not even sure how this is a complaint.  When you choose fill you are going to fill, and support is the \"least desirable\" role, so ofc you will end up playing support a fair amount of the time.  But if you truly don't want to fill, don't pick fill?  First pick jungle and second pick any role other than support to guarantee not getting support.  Dynamic queue certainly has it's flaws, but this is not one of them.","replies":[{"poster":"Something Snazzy","date":"2016-02-15T16:38:58.161+0000","up_votes":1,"down_votes":1,"body":"It isn't a \"fair amount of the time\" though.  If it were, I'd be happy.  \n\nFill is supposed to decrease queue times for everyone but it is contingent on people actually choosing it.  If enough people chose fill, there would be no queue times for anyone.  If fill is basically a secondary \"support,\" people are not going to choose it, because they are not support mains.  If they are not going to choose it, then it loses its ability to decrease queue times.\n\nI mean, why even have it if it is a secondary support?","replies":[{"poster":"Flawless Fetus","date":"2016-02-16T00:44:03.605+0000","up_votes":1,"down_votes":0,"body":"Because it is not a secondary support.  It is a fill.  Obviously, teams support needs filling more often than mid does, but pretending like every fill is a support is quite the hyperbole.  Seriously, though.  If you don't want to risk playing support, pick an option that doesn't have that potential - literally any other choice.","replies":[{"poster":"Something Snazzy","date":"2016-02-16T07:07:48.916+0000","up_votes":1,"down_votes":0,"body":"But why have fill then?","replies":[{"poster":"Flawless Fetus","date":"2016-02-16T18:45:50.700+0000","up_votes":1,"down_votes":0,"body":"...to fill...","replies":[]}]}]}]}]},{"poster":"Stalian","date":"2016-02-15T03:15:09.175+0000","up_votes":2,"down_votes":0,"body":"But... But I wanna play support all day...\n\n*Makes {{champion:432}} noises*","replies":[]},{"poster":"RisenDarkKnight","date":"2016-02-15T00:45:12.744+0000","up_votes":2,"down_votes":0,"body":"Yeah it's pretty annoying that \"fill\" as your secondary means you get support almost everytime.  I like playing support so I queue as Jungle primary and Fill secondary, and I'm fine with playing support 2/3 of the time.  But I haven't gotten jungle in like 20 games doing that.   Now I put Mid as my secondary if I really want to play JG.","replies":[]},{"poster":"Leonerdo","date":"2016-02-14T21:47:18.111+0000","up_votes":2,"down_votes":0,"body":"Yup. I've put Support as my \"secondary\" in 24 games and got Support 16 times.","replies":[]},{"poster":"Something Snazzy","date":"2016-02-14T21:13:05.930+0000","up_votes":2,"down_votes":0,"body":"Seriously though, it should not be too hard to put weights on those who get support as a fill so that they are less likely to get it next time.  I've discussed this with a few friends and they all say the same thing \"yeah, I no longer choose fill because it is always support.\"","replies":[]},{"poster":"JVP15","date":"2016-02-14T21:34:41.505+0000","up_votes":3,"down_votes":1,"body":"WHY IS IT WHEN YOU PICK FILL YOU GET SUPPORT, AND WHEN I PICK SUPPORT/FILL I GET FRIKIN MID OR TOP OR ANYTHING BUT SUPPORT! This is really getting annoying because I don't do so well at any other role.","replies":[]},{"poster":"EvilRabbitt","date":"2016-02-14T21:43:45.529+0000","up_votes":1,"down_votes":2,"body":"I think the system prioritizes your second choice over your first. Possibly reverse it?","replies":[{"poster":"Anidan","date":"2016-02-14T22:36:29.657+0000","up_votes":2,"down_votes":0,"body":"It does not. However, if you choose fill or support as your secondary then there are so many more openings in your secondary's slot that the system would find it far easier and faster to just place you there instead of searching in vain for your primary.","replies":[]}]},{"poster":"TauNoob1","date":"2016-02-14T22:27:40.230+0000","up_votes":2,"down_votes":1,"body":"As much as people are frustrated with the system, acting like this is only making the issue worse because the issue is a catch 22. People queing as Fill want to stop supporting, resulting in less people queing up as Fill/support, causing more Fill to be picked as support in addition to longer que times. With the cynamis que system this CANNOT change unless a massive wave of people start queing up as support, but we all know that will NEVER happen because of the false mentality that supports cannot carry.","replies":[]},{"poster":"GenghisEmo","date":"2016-02-14T20:58:52.238+0000","up_votes":2,"down_votes":1,"body":"Fill should be renamed \"Supp\" ^_^\n\nIt is a miracle if i get Mid or Bot when i have Fill as secondary, and even more of a miracle when Supp is secondary.","replies":[]},{"poster":"AJking101","date":"2016-02-16T22:34:40.172+0000","up_votes":1,"down_votes":0,"body":"A couple days ago, I played 3 games with my primary role being top and secondary role being mid. I got mid 3 times in a row{{item:3070}}","replies":[]},{"poster":"XeroKimo","date":"2016-02-16T02:12:53.663+0000","up_votes":1,"down_votes":0,"body":"I found out that the new queues goes like this, you pick your roles, whatever you got and someone dodges you'll get that role again 99% of the time unless you leave queue and rejoin it","replies":[{"poster":"Something Snazzy","date":"2016-02-16T07:06:55.884+0000","up_votes":1,"down_votes":0,"body":"I had four full games in a row as support.  If I counted every dodge, it'd be more like 12,","replies":[]}]},{"poster":"The Deckowner","date":"2016-02-15T03:32:32.646+0000","up_votes":1,"down_votes":0,"body":"so last game i queued up as mid fill, and i got support, ok.\n\n\nthen the funny thing is the enemy team dodged 3 times and every time the same 5 of us got back into the same team with the same role. i asked it was 3 premade and 2 of us solo.","replies":[{"poster":"Something Snazzy","date":"2016-02-16T00:39:57.310+0000","up_votes":1,"down_votes":0,"body":"That.... makes me think that they have all sorts of complex algorithms rather than a simple weighting system.  Scary","replies":[]},{"poster":"BestTristMyHaus","date":"2016-02-15T15:34:29.239+0000","up_votes":1,"down_votes":0,"body":"Yeah, if I've learned ANYTHING from dynamic queue it is this:\nIf you get a role you don't want (secondary or something from fill) and someone dodges your game, quit the queue IMMEDIATELY before getting popped back into game and wait a little bit then re-queue.  Otherwise you WILL pop directly back into the same team/role.","replies":[]}]}]}