{"poster":"DingleNutsMcGee","date":"2015-06-20T23:58:30.799+0000","title":"ADC's taking ignite recently","subforum":"[ARCHIVED] Miscellaneous","up_votes":1,"down_votes":0,"body":"more and more ive been noticing recently that adc's are starting to take ignite instead of heal in the bot lane. anyone else noticing this?? have any ideas as to why all of a sudden??","replies":[{"poster":"Maximum Zilean","date":"2015-06-21T01:15:49.238+0000","up_votes":2,"down_votes":0,"body":"For AD carries, its only really useful on short range lane bullies like {{champion:104}} {{champion:119}}. Since they are typically always in range to use it and want to get those early game kills.\n\nI would never take it on {{champion:51}} {{champion:22}} because they have to actually get in close to use it. Meaning they are sacrificing their core strength. Range.","replies":[]},{"poster":"disregardable","date":"2015-06-21T00:04:08.457+0000","up_votes":2,"down_votes":0,"body":"Ignite is all but useless past laning on ADs. The goal is to kite, not get in ignite range, and Lucian is not back in the meta.","replies":[]},{"poster":"cooZer393","date":"2015-06-21T02:28:11.559+0000","up_votes":1,"down_votes":0,"body":"Lmao... Christ kids these days are stupid. \"all of the sudden\"? Adcs have taken ignite since beta. Everyone grabbing heal is the newer thing, not ignite.\n\nSickens me watching newer kids talk about crap that's already been done as if it's new... like the relatively recent hype over morg mid or top. Like seriously... it was done years ago. Rofl.","replies":[{"poster":"DingleNutsMcGee","date":"2015-06-21T12:25:16.835+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=cooZer393,realm=NA,application-id=cIfEodbz,discussion-id=0AQe59Nh,comment-id=0003,timestamp=2015-06-21T02:28:11.559+0000)\n>\n> Lmao... Christ kids these days are stupid. \"all of the sudden\"? Adcs have taken ignite since beta. Everyone grabbing heal is the newer thing, not ignite.\n> \n> Sickens me watching newer kids talk about crap that's already been done as if it's new... like the relatively recent hype over morg mid or top. Like seriously... it was done years ago. RoFI\n\nFirst of all im not a kid, im 30 yrs old. Second of all whats the rude attitude for? Youre whats wrong with the league community....cant just respond in a civil manner, you have to be rude about it. And yo your response....I never said its never been done before. what i said was all of a sudden its becoming a thing, instead of heal/barrier. you act like im making the point like this is the first time its ever been done....not the case. My question was b\\c ive noticed a shift in summoners in bot lane almost overnight. Think about what youre saying before you respond and sound like an idiot","replies":[]}]},{"poster":"Kochiya Sanae","date":"2015-06-21T00:01:49.632+0000","up_votes":1,"down_votes":1,"body":"why not?","replies":[]}]}