{"poster":"Kriegsfürstxy","date":"2015-07-07T15:04:34.289+0000","title":"Von platin nach diamant?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":2,"body":"hallo!\r\nich bin im moment platin 4. ich war schon sehr oft diamantpromo deshalb glaube ich nicht, dass ich platin 4 geh&ouml;re. die promos habe ich verloren weil ich i-wie 3x mit dem selben adc troller reingekommen bin obwohl ich ihn reported habe. hat wer einen tipp wie man diamant kommt oder ist das unm&ouml;glich bei ein paar leuten mit sehr viel Pech beim matchmaking?\r\ndanke im vorraus","replies":[{"poster":"Busty Botter","date":"2015-07-09T12:02:28.339+0000","up_votes":1,"down_votes":0,"body":"Ich hatte letzte Saison auch geschätze 6 Promos auf G4, ich glaub sogar 8 auf G3 und dann in einen Rutsch in jeder Promo zu Platin+. Also ja man kann Pech haben. Sollte ich auf eine extrem toxische, trollastige Person stoßen, geh ich nach dem Spiel mal eine rauchen, hol was zu trinken und gehe erst ca 10-15min nach dem letzten Spiel wieder in die Queue.\n\n@I HAD FUN ONCE: ich habe auch einen Smurf letzte Saison in Platin gehabt, auch mit nur 2 Runenseiten. Man muss sich dann eigenltich nur auf ein paar wenige Champs einschränken, wo die Runenseiten besser passen als auf andere.","replies":[]},{"poster":"i had fun once","date":"2015-07-08T09:30:16.881+0000","up_votes":1,"down_votes":0,"body":"Wann warst du denn **sehr oft **in der Diamant Promo? Kann nicht die letzten Monate gewesen sein...\nAußerdem wie bist du eigentlich mit nur 2 Runenseiten nach Plat gekommen?^^","replies":[{"poster":"Bluefersan","date":"2015-07-09T11:30:56.460+0000","up_votes":1,"down_votes":0,"body":"bin ich auch :D::D auf main und auf dem gold 3 also wenn man kannst dann kann mans","replies":[]}]},{"poster":"AyRe CoNteMpT","date":"2015-07-07T15:19:34.462+0000","up_votes":1,"down_votes":0,"body":"es gibt natürlich pech beim matchmaking, das gleicht sich aber auf dauer wieder aus. zb kann es sein, dass du die promos zwar immer durch pech verlierst, aber der grund dass du überhaupt da hin kommst schon einiges an glück ist. \n\ndenk dran, in jedem game in dem du 5:0 stehst, stehst du nur 5:0 weil deine gegner die gleichen rotznasen sind mit denen du in deiner promo zusammen spielen musst.\n\nwenn du ausserdem platin 4 bist, also nicht mal platin 1, glaube ich nicht, dass du in diamant gehörst. genauso wenig wie die meisten diamant spieler übrigens ;D\n\neinen tipp den ich für dich und für jeden anderen habe: dodged eure games wenns im champselect schon beschissen aussieht. wenig CC, keine guten scaling champs, trashtalk von idioten. einfach dodgen und sobald ihr eure 2 täglichen dodges verbraucht habt, einfach aufhören zu zocken oder normals zocken.\n\nauch keine angst haben in der promo zu dodgen. das zählt zwar als loss, ihr verliert allerdings durchs dodgen keine MMR. \n\nd.h., sagen wir mal du bist in der promo von plat 4 auf plat 3 und du dodgest deine nächsten beiden matches oder du gewinnst eins und musst dann zweimal dodgen. dann hast du durch den win sogar wieder MMR dazu erhalten und durch die dodges keine verloren.\n\ndann bist du wieder plat 4 mit 70 punkten oder so. jetzt gewinnst du wieder 3 mal und dodgest dann wieder 2 mal, dann bist du wieder plat 4 mit 70 punkten, allerdings hast du 3 mal gewonnen und dein MMR erhöht. wenn du jetzt also aufsteigst, überspringst du vielleicht ein oder zwei divisionen und selbst wenn nicht, ist dein MMR so hoch dass du in der neuen division sehr viele punkte bekommst.\n\ndas soll jetzt kein trick zum MMR ercheaten sein, aber man sollte einfach nicht so viel angst davor haben zu dodgen, genau wie man nicht soviel angst davor haben sollte, all seine cooldowns rauszuballern. flash halt direkt anstatt das morgana binding und 50% damage zu kassieren und danach trotzdem flashen zu müssen ; )\n\nund genauso dodge halt direkt wenn es schlecht aussieht ansatt zu hoffen dass es doch klappt: es klappt nicht.","replies":[{"poster":"Kriegsfürstxy","date":"2015-07-07T17:19:50.432+0000","up_votes":1,"down_votes":0,"body":"danke für den tipp werds mal versuchen aber wenn es so dann nicht klappt werde ich soloq lassen weil so is mir das bissl zu blöd","replies":[{"poster":"AyRe CoNteMpT","date":"2015-07-07T21:19:00.845+0000","up_votes":1,"down_votes":0,"body":"du musst natürlich zusätzlich bedenken, dass du vielleicht garnicht so gut bist wie du denkst und dein elo absolut verdienst. sollte das der fall sein, wird auch smarteres dodgen nicht viel an deiner position ändern. besser werden hilft allerdings immer.","replies":[]}]}]}]}