{"poster":"xxBurnToAshxx","date":"2016-09-20T21:01:08.509+0000","title":"Supp gesucht!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Ich bin Main Adc  und suche einen Supp der denkt er k&ouml;nnte was, ich bin im Bereich von Silber 1 bzw Gold 5 denke ich mal, habe aber vor 2 Tagen denn Account wieder in Ranked gespelt und bin im Silber 3 gelandet, sollte aber hoffentlich schnell nach oben gehen.\r\n\r\nDa hier jeder Voraussetzungen hat werde ich mal keine haben, die einzige ist, chillig sein, gelassen und das was wir machen ernst nehmen.\r\n\r\nMir sind die Rankeds vorerst eher unwichtig, wir k&ouml;nnten uns auch im Normal einspielen, dann ist es entspannter wenn man verliert. am Anfang.\r\nHabe oft die Erfahrung gemacht das sich jemand meldet, ranked spielen will, vll ein schlechtes Game hat und so ists gleich nach dem Game vorbei da man ja jemanden sucht mit dem man gewinnen will, wenn man dann aber das erste gleich verliert ist die Motivation weiter zu machen auf 0.\r\nDeswegen lieber mit paar normals starten, bissi quatschen und dann wenn man sich n&auml;her kennt spielen wir rankeds und wissen auch wo wir was verbessern k&ouml;nnten und steigen da sicher schneller als wenn wir einfach drauf los spielen.\r\nEs k&ouml;nnen sich Spieler ab Bronze 5 melden, wie gesagt, rankeds m&uuml;ssen nicht gleich am ersten Abend sein.\r\n\r\nDa ich schullisch viel zu tun habe bin ich Abends meistens ab ca. 19 Uhr online bis ca. 23 Uhr, also mehr als genug, und &uuml;ber das Wochenende kann ich on wann ich will.\r\n\r\nIch bin 19 Jahre alt, spiele LoL seit glaube ich s4 und ja, ihr k&ouml;nnt mich mal adden und dann schauen wir weiter :)\r\n\r\nLG","replies":[{"poster":"UndergroundTiger","date":"2016-09-21T05:52:05.223+0000","up_votes":1,"down_votes":1,"body":"Du hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]}]}