{"poster":"Wraiths Wrath","date":"2015-06-24T08:14:55.450+0000","title":"Question about Tahm.","subforum":"Gameplay","up_votes":2,"down_votes":0,"body":"When Tahm eats a champ or your ally, will he be susceptible to CC? or if the ADC uses CC will he be able to eat them? An example would be Kalista using her ult with her support, would Tahm be able to eat her? or another would be Tahm eating his team&#039;s ADC and Bard&#039;s ult hitting him in the process, would that make them both stunned for 2 seconds or...I&#039;m confused by this, just a bit...\r\n\r\nMind you, I don&#039;t play PBE, so I have no clue what&#039;s going on there.","replies":[{"poster":"Meddler","date":"2015-06-24T08:40:21.717+0000","up_votes":6,"down_votes":0,"body":"Tahm can be CC'd while he's got a unit devoured.\n\nTahm can devour units (friend or foe) that are themselves CC'd.\n\nUnits devoured by Tahm are untargetable, so can't be hit by further CC while inside his belly.","replies":[{"poster":"Knight SoIaire ","date":"2015-06-24T08:51:26.934+0000","up_votes":2,"down_votes":1,"body":"so if malza ults your carry and you eat him it breaks his ult ?\nor simply makes malza waste his time while he pukes purple at invulnerable adc ?","replies":[{"poster":"Svddenly","date":"2015-06-24T15:04:21.537+0000","up_votes":1,"down_votes":0,"body":"I'm pretty sure he can't eat channeling allies. {{champion:51}} {{champion:9}} {{champion:3}} {{champion:40}} {{champion:30}} {{champion:55}} {{champion:90}} etc","replies":[{"poster":"Knight SoIaire ","date":"2015-06-24T22:43:36.511+0000","up_votes":1,"down_votes":0,"body":"yeah but he can eat an ulted fiddle or kennen and simlpy chase enemies with them","replies":[{"poster":"Svddenly","date":"2015-06-25T01:18:30.180+0000","up_votes":1,"down_votes":0,"body":"But those aren't channels. He can't eat _channeling_ allies. So he can't eat fiddle when he's charging his ult but he can eat him once the AoE is going.","replies":[{"poster":"Knight SoIaire ","date":"2015-06-25T14:30:34.192+0000","up_votes":1,"down_votes":0,"body":"also about that malza ... i asked that \nIf enemy malza ults and you eat his target ... what happens \n\nchannel breaks ?or malza wastes time ?","replies":[]}]}]}]}]},{"poster":"Huang Shaotian","date":"2015-06-24T18:16:17.978+0000","up_votes":1,"down_votes":0,"body":"Could you for example, have tahm devour his team mate jungler, then have kali pull him into ult and all 3 teleport to a ward?","replies":[]}]},{"poster":"6thSagePath","date":"2015-08-30T15:12:12.589+0000","up_votes":1,"down_votes":1,"body":"how does tahms ult effect other ults that cancel out CC. for example i just had a vi game where in mid air tahm would eat my champ and run with out no damage or cc being applied. For an ult that even says cannot be stopped and pushed champs out the way. it would seem Vi's ult would take priority. if nothing more atleast deal the damage that should have been applied. Or is there some wording in how tahms ult stops all of that?","replies":[{"poster":"Adrian Umbra","date":"2015-08-30T15:30:15.475+0000","up_votes":1,"down_votes":1,"body":"So many things wrong with this right now that make it really clear that you not only never read Tahm's kit, but never seriously considered your own question.  Tahm's Devour is his W, not his ult.  He is able to use it and rob certain skills, like Vi's ult or Malphite's, of a target or a caster.  Thus if there's no target (or no caster), then the ability fizzles, just as if the target had died instead of been rendered untargetable.  If Tahm isn't being CC'd, there's no reason why Tahm wouldn't be able to Devourer his target.\n\nAnd this is a horrible necro.  If you have a question like this, make your own thread instead of trying to tack it onto another person's thread like this.","replies":[{"poster":"6thSagePath","date":"2015-09-14T20:11:58.744+0000","up_votes":1,"down_votes":1,"body":"ive played every champ ive read them all and use them all. i know both champs inside and outside. but since lucian was already in mid ult, not that i had not already reached the target, that and vi knocks all other champions out of the way. last there is no reason to be a dick dude.","replies":[{"poster":"Adrian Umbra","date":"2015-09-16T14:16:46.424+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=6thSagePath,realm=NA,application-id=3ErqAdtq,discussion-id=aP3vsR3t,comment-id=0005,timestamp=2015-08-30T15:12:12.589+0000)\n>\n> ...Or is there some wording in how tahms ult stops all of that?\n\nNope, no wording in Tahm's ult.  Just his W doing what it do.  So... how closely did you read every champion, again?\n\nIf Vi is also not actually touching the champion, she won't knock them out of the way.  Tahm's W outranges Vi's knockback radius and thus, he's free to nom her and rob her of her ult.  Same as if J4 ults a target and dies mid-air.  Tahm CAN eat Vi mid-ultimate and cancel the ability, this is absolutely intended and I explained this pretty thoroughly in my above post.  \n\nIf you think this is a balance issue, please make your own thread to address that specific interaction.  A necro like this will get you nothing but responses like mine.  If you don't want some \"dickish\" response, go make your own thread and see how it fares.","replies":[{"poster":"6thSagePath","date":"2015-10-03T15:46:01.632+0000","up_votes":1,"down_votes":0,"body":"that was the thing, i was touching him.","replies":[]}]}]}]}]},{"poster":"darksurge","date":"2015-06-24T19:17:34.932+0000","up_votes":1,"down_votes":0,"body":"Is Tahm an ancient creature or is his species just in hiding?","replies":[]},{"poster":"pE4CbxDPQO","date":"2015-06-24T08:44:26.865+0000","up_votes":1,"down_votes":0,"body":"MEDDLER!\n\nCan Tahm eat someone then be pulled in by a Kalista ult? Say no pls lol.","replies":[{"poster":"Panwar","date":"2015-06-24T14:50:19.732+0000","up_votes":1,"down_votes":0,"body":"I saw on a video what looked like Kalista ulting her support and pulling him out of Tahm's belly.","replies":[]}]},{"poster":"Wraiths Wrath","date":"2015-06-24T09:21:42.241+0000","up_votes":1,"down_votes":0,"body":"There are so many rediculous questions we have about this \"eating\" habit he has....lol.","replies":[]},{"poster":"Piltover Customs","date":"2015-06-24T08:51:45.966+0000","up_votes":1,"down_votes":0,"body":"Can I eat Baron or Dragon.. I've a big appetite you know.","replies":[]}]}