{"poster":"Sadraal","date":"2015-02-01T16:40:38.252+0000","title":"Sadraal, The Destroyer of Darkness (A legelső LoL-projekt hős)","subforum":"Rajongói alkotások","up_votes":4,"down_votes":1,"body":"Üdv Idézők!\r\n\r\nMár egy ideje gondolkoztam azon, hogy bemutassam-e azokat a hősöket, akikkel az egész LoL-projekt indult, és ma végre elhatározásra jutottam.\r\nA most következő fan-made hős volt a legelső, akinek minden apró adatot és leírást elkészítettem, valamint vele próbálkoztam a külföldi fórumokon is. Döntésemet befolyásolta, hogy ráakadtam egy tehetséges művész alkotására, amit lent meg is találhattok - a low poly ábrázolás - az eredeti képpel együtt.\r\nA névazonosságnak elég érdekes története van, de ezzel most nem fárasztanálak titeket, inkább vessetek egy pillantást a legelső LoL-projekt hősre.\r\n\r\n**Sadraal, The Destroyer of Darkness**\r\n\r\n**Története:**\r\nAz Árnyék-sziget egykor virágzó hely volt, a nevét is csak lepusztulása után kapta, de hogy régen miként nevezték, már a múltba veszett. Az emberek békében és boldogságban élték napjaikat, nem szenvedtek hiányt semmiből, nem dúltak háborúk a vidéken. Sűrű erdők, végtelen szántóföldek borítottak mindent, a legkülönfélébb teremtmények lakták a vadont. Hogy mi történt a szigettel? Egy napon fekete fellegek borították be az eget. Az emberek addig még soha nem láttak ahhoz hasonló jelenséget, mindenki szívében gyökeret vetett a félelem magja. A napfény többé nem érintette a szigetet, a növények lassan elpusztultak, az állandó sötétségtől hamarosan egybefolytak a napok. Az emberek bíztak a változásban, de az idő múlásával megtörtek, lelkükben teljesen kihunyt a remény. Egy napon aztán valami váratlan történt: a sötét felhők közül valami a szigetre ereszkedett. A lény testében kísérteties fény derengett, amely az emberek lelkében eluralkodó rettegésből táplálkozott. Nem volt olyan erő, ami megállíthatta volna egyre növekvő hatalmát, a sziget lakói menekülni kezdtek otthonaikból. A szerencsésebbek túlélték a pusztulást, ám testüket visszavonhatatlanul megfertőzte a sötétség. Akik nem érték el az utolsó hajókat, a sziget elkárhozott rabjaivá váltak, hogy megnyomorodott életükkel szolgálják hazájukat.\r\n\r\nSadraal a sötétség teremtménye, erejét a félelem és pusztulás táplálja. Éhsége messziről vezette el egy békés szigetre, amit szép lassan megfertőzött, hogy aztán bőséges lakomát tarthasson a reményvesztett emberek között. Az általa okozott pusztítás végérvényesen megpecsételte a sziget sorsát, ami aztán egyre több rettenetes lénynek vált az otthonává. Sadraal nem bánta, hogy másokkal is osztoznia kell az új gyarmaton, hiszen tudta, a sötétség teremtményei előbb-utóbb egy legyőzhetetlen sereget alkotva törik majd át a bátorság falait, hogy porig rombolják a fény és jóság fellegvárát.\r\nMikor tudomást szerzett a Ligáról - ahol addigra már több társa is küzdött -, azonnal útnak indult, hogy megvesse lábát a következő helyen, amit romba fog dönteni...\r\n\r\n\"Közeleg a nap, mikor az utolsó fénysugarat is elnyeli a sötétség. Az lesz az én időm.\" - Sadraal\r\n\r\n**[Passzív] Creature of Darkness:**\r\nSadraal teste minden támadása után sötétséget raktároz el, amit később felhasználhat ellenségeivel szemben vagy önmaga felerősítésére.\r\nSadraal láthatatlanná válik ellenfelei számára, amíg az általa teremtett sötétségben rejtőzik. \r\n\r\n**[Q] Crippling blow:**\r\nA képesség hatására Sadraal sötétséget lövell egy adott irányba, ami minden útjába kerülő ellenfelet mágikusan sebez, a legutolsót pedig mozgásképtelenné teszi.\r\n\r\n**[W] Fear factory:**\r\nPasszív: Mikor Sadraal megöl valakit, teste az áldozat félelméből olyan sötétséget kezd termelni, ami lassan szertefoszlik, ezzel gyengítve a közelében álló ellenfelek mágikus ellenállását.\r\nAktív: Sadraal dönthet úgy, hogy felemészti a testében raktározott sötétség egy részét, ezáltal megnő a védelme egy rövid időre, valamint az életereje is töltődik.\r\n\r\n**[E] Suffocating darkness:**\r\nSadraal sötétséggel borít be mindent maga körül, ami mágikus sebzést okoz és elvakítja az ellenfeleit.\r\n\r\n**[R] Immateriality:**\r\nSadraal teste elveszíti szilárdságát, eggyé válik az általa teremtett sötétséggel, így folyamatos sebzést okozva az abban tartózkodó ellenfeleinek. Ha valaki túl sokáig érintkezik vele, eluralkodik rajta a félelem. Amíg Sadraal fenntartja ezt a formáját, nem hatnak rá az egyszerű támadások, viszont a képességek nagyobb sérülést okoznak neki. A sötétségben tartózkodva megnő a mozgási sebessége, nem hat rá semmilyen lassítás, és minden támadásával lassan újratöltődnek a képességei.\r\n\r\n**Szövegek:**\r\n\r\nHős választás:\r\nA sötétséget nem lehet megállítani!\r\n\r\nMozgás:\r\nKövetlek, amíg közösek a céljaink, Idéző!\r\nIndulok!\r\nFélelem. Félelem mindenhol.\r\nNincs értelme menekülni előlem.\r\nNyomomban csak a pusztulás marad.\r\nEngem nem lehet megállítani!\r\nMutasd az utat!\r\nMindenhova elérek.\r\nSötét fellegek kísérnek utamon.\r\n\r\nTámadás:\r\nBátorság? Megtörjük!\r\nKihunynak a fények.\r\nÉrtelmetlen az ellenállás.\r\nA sötétség erejével!\r\nRettegj!\r\nA reményt ölöm meg utoljára.\r\nNem ellenfél a számomra.\r\nKi merészel szembeszállni velem?\r\nA félelmük táplál engem.\r\n\r\nQ használata:\r\nNincs menekvés!\r\nA sötétség utolér!\r\n\r\nW használata:\r\nÉrzem a félelmük ízét!\r\nHmm, félelem!\r\n\r\nE használata:\r\nSötétségbe borul minden!\r\nUtolsó fénysugárig!\r\n\r\nR használata:\r\nÉn vagyok a sötétség!\r\nEljött a sötétség ideje!\r\n\r\n/taunt\r\n*Sadraal előredől, egyik öklével megtámasztja magát a földön, majd fekete füstöt kezd eregetni a hátából*\r\nLássuk, mi törik meg előbb: a tested vagy a lelked?\r\nNem félsz a sötétben? Végzetes hibát követsz el.\r\n\r\n/joke\r\n*Sadraal füstkarikákat kezd eregetni a hátából*\r\nMint egy kitörni készülő vulkán, de én veszélyesebb vagyok.\r\nFüstjeleket küldök az ellenségnek. Sadraal. Elpusztít. Mindent.\r\n\r\nHalál:\r\n*Sadraal lassan térdre ereszkedik, közben a mellkasára szorítja kezét. A belsőjében derengő fény felerősödik, végül egy zöld villanást követően mindene szertefoszlik.*\r\n\r\nKeleti oltár:\r\nMegmentetted a szigetet az igazi pusztulástól, Sadraal!\r\nÚj birodalmat teremtettél, Sadraal!\r\n\r\nNyugati oltár:\r\nMit tettél ezzel a szigettel, Sadraal?\r\nEgyszer újra fényárban fog úszni minden, Sadraal!","replies":[{"poster":"Gabesz00","date":"2015-02-04T19:43:56.855+0000","up_votes":2,"down_votes":0,"body":"10/11 Nagyon tetszik! Csak annyi lenne hogy egy ilyen hőst valahogy egy anti angyalnak képzelek, nem egy ilyen benga monstrumnak. Bár ha már Heca is képes a felhők tetején szörfözni akár bele is fér :D","replies":[{"poster":"Sadraal","date":"2015-02-05T14:25:51.519+0000","up_votes":1,"down_votes":0,"body":"Soha nem rajongtam az angyal-koncepcióért, ráadásul anti-angyalnak már ott van Morgana. Az Árnyék-szigetek hősi közé jobban illeszkedik ezzel a fajta megjelenéssel :)","replies":[]}]},{"poster":"MelegPunci1","date":"2015-02-03T13:05:22.652+0000","up_votes":2,"down_votes":0,"body":"Nekem nagyon bejött szerintem ahogy aszt már emlitették hogy ez a legjobb forumos cuc gratula :)","replies":[{"poster":"Sadraal","date":"2015-02-03T19:20:41.966+0000","up_votes":1,"down_votes":0,"body":"Köszönöm :)","replies":[]}]},{"poster":"Lord Babkonzerv","date":"2015-02-01T19:37:37.987+0000","up_votes":2,"down_votes":0,"body":"Szerintem ez az egyik legjobb hős, amit ez a fórum látott ;D\n\nA története is nagyon bejön, habár egy kissé fanfiction, mivel a játékban a Shadow-Isles karakterek elszórnak utalásokat arra hogy a szigetet a nagyravágyó királya rontotta meg, jobban mondva neki a feketemágusai. De grat nagyon jó lett. {{champion:35}}","replies":[{"poster":"NalamiHUN","date":"2015-02-01T19:46:34.947+0000","up_votes":1,"down_votes":0,"body":"Szerintem is!:D\n\nBár én is ezen a szinten lennék!","replies":[{"poster":"Sadraal","date":"2015-02-02T19:13:28.606+0000","up_votes":1,"down_votes":0,"body":"Örülök, hogy tetszik :)","replies":[]}]},{"poster":"Sadraal","date":"2015-02-01T20:03:29.154+0000","up_votes":1,"down_votes":0,"body":"Azért gondoltam egy kis változtatást az Árny-szigetek történetébe, mert szerintem ennyi belefér, akárcsak a shurimai rework esetében :)","replies":[]}]},{"poster":"NalamiHUN","date":"2015-02-01T17:16:02.612+0000","up_votes":2,"down_votes":0,"body":"Öregem, ez olyan jó lett, hogy nem igaz!:D\n\nNem bánod, ha említést teszek róla az új hősömnél, ami éppen készül? :)","replies":[{"poster":"Sadraal","date":"2015-02-01T17:20:26.731+0000","up_votes":1,"down_votes":0,"body":"Örülök, hogy tetszik :)\nÉppenséggel megemlítheted, ha szerinted passzol a történethez :)","replies":[]}]},{"poster":"Megtogan","date":"2015-07-01T08:23:28.464+0000","up_votes":1,"down_votes":0,"body":"nekem nagyon tetszik ez a hős, de engem az fogót meg hogy vannak aki remek alkotásokat csinál. magam is rajzolok csak nem merem meg mutatni az emberek előtt .  igazából én csak szörnyeket meg egyéb mást tudok rajzolni, de embert nem.","replies":[]},{"poster":"Amerada Clusoh","date":"2015-02-13T06:51:46.811+0000","up_votes":1,"down_votes":0,"body":"nagyon jó lett!  go play with {{champion:75}} {{item:3174}} {{item:3027}} {{item:3157}} {{item:3089}} {{item:3001}} {{item:3255}} !!!!!","replies":[]},{"poster":"Penta Tiger","date":"2015-02-11T07:58:38.400+0000","up_votes":1,"down_votes":0,"body":"Láttom sok campet csinálsz és csak azt tudom mondani így tovább és nagyon jók. Remélem lesz bent a campek között amit magyar ember csinált","replies":[{"poster":"Sadraal","date":"2015-02-11T16:21:07.865+0000","up_votes":1,"down_votes":0,"body":"Én is örülnék neki, ha valamelyik ötletem kinőné a fórumot :)","replies":[]}]},{"poster":"Code name Bullet","date":"2015-02-01T17:41:20.578+0000","up_votes":1,"down_votes":0,"body":"Gondolom a sötétség zöld színű. A kép alapján. De amúgy jó lett.","replies":[{"poster":"Sadraal","date":"2015-02-01T20:02:07.853+0000","up_votes":1,"down_votes":0,"body":"A második kép alján látható, ahogy kiengedi magából a fekete füstöt :)\nHa már sötétség, legyen fekete :D","replies":[]}]}]}