{"poster":"Preveam","date":"2017-02-16T01:16:53.278+0000","title":"An RIOT'LER gerichteter Thread","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":1,"body":"Hey,\n\nich bin vor ca zwei Monaten 16  geworden. In ein paar Jahren,  nach der Schule, werde ich mir einen Job suchen m&uuml;ssen^^.  Was w&auml;re besser, als ein Teil des Unternehmens zu sein, welches dein absolutes lieblings-Videospiel hervor gebracht hat? Gut, da g&auml;be es einiges, jedoch erfreut mich der Gedanke, bei Riot Games zu arbeiten.\n\nZu meinen Fragen:\nWarum habt ihr euch f&uuml;r Riot Games entschieden?\nWie sah euer Weg dorthin aus?\n\nIch hoffe mal, dass das nicht unangebracht ist, so etwas in diesem Forum zu Posten. Notfalls gibt es ja Supporter, die den Thread schlie&szlig;en k&ouml;nnen ...\n\nLg Preveam{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Rahzar","date":"2017-02-16T14:07:55.769+0000","up_votes":7,"down_votes":0,"body":"Wenn du 200 Leute bei Riot fragst, wie sie zu ihrem Job gekommen sind, wirst du 200 verschiedene Geschichten gehören, es gibt nicht den einen richtigen Weg oder eine Vorlage, der man folgen muss. \n\nWenn du an die Sache mit der Einstellung \"Hauptsache ein Teil von Riot sein, egal wie\" rangehst, wird das aber vermutlich schwierig. Du solltest dir schon klar machen, was du machen willst, wo deine Stärken liegen, vollkommen unabhängig von Riot\n\nWillst du Game Designer werden? Dann fang an, zu lernen, Spiele zu designen und arbeite darauf hin, der beste Gamedesigner zu werden, der du sein kannst. Wenn du das geschafft hast oder auf dem guten Weg dahin bist, dann kannst du überlegen wie du diese Erfahrungen und Kenntnisse bei Riot einbringen kannst oder ob RIot überhaupt der richtige Platz ist. \n\nDas gilt für alle Disziplinen, egal ob du in der Finanzabteilung arbeiten willst, Splash-Arts zeichnen willst oder dafür sorgen willst, dass die Server stabil laufen.\n\nWillst du esports zu deinem Beruf machen? Fang an deine eigenen Turniere zu organisieren, schau ob es vielleicht bei dir lokale oder regionale Möglichkeiten dich in esports-Clubs zu engagieren. \n\nEs muss auch nicht alles LoL bezogen sein, wenn Programmieren deine Leidenschaft ist, dann entwickle deine Fähigkeiten als Programmierer und überlege später ob und wie diese Fähigkeiten bei Riot den Unterschied machen können. Es gibt natürlich eine Liste mit offenen Stellen, da kannst du dir ein Bild davon machen, wie das Anforderungsprofil in manchen Disziplinen so aussieht und worauf du vielleicht hinarbeiten kannst: http://www.riotgames.com/careers","replies":[]},{"poster":"AI Yjuq","date":"2017-02-16T03:30:53.202+0000","up_votes":2,"down_votes":0,"body":"Frag das besser im Englischen Forum. Da wirst du mehr Antworten bekommen da dort die Leute von Riot aktiver sind.","replies":[]},{"poster":"Leylania","date":"2017-02-16T06:35:27.909+0000","up_votes":1,"down_votes":0,"body":"Wie bereits gesagt wurde wirst du im englischen Forum bessere Chancen haben jemanden von Riot anzutreffen. Ich möchte dir deine Träume nicht zerstören, aber etwa bist du extrem gut in dem was du bei Riot mal machen möchtest oder du hast überhaupt keine Chance. In irgendeinem Frag Riot wurde mal gesagt, dass es teilweise auf freie Stellen über 5000 Bewerbungen gibt, da hast du quasi keine Chance wenn du nicht extrem heraus stichst und wirklich sehr gut bist.","replies":[]}]}