{"poster":"Preveam","date":"2017-02-18T06:46:00.691+0000","title":"kinox.to legal? / League of Legends - Film in Aussicht?","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":5,"body":"Hey,\r\n\r\nvielleicht kennt sich jemand mit solchen Sachen aus.\r\n\r\nIch habe geh&ouml;rt, dass es illegal sei, (Kino) Filme, Streams kostenlos aus dem Internet runter zu laden und in sozialen Netzwerken oder auf Veranstaltungen zu zeigen. Das blo&szlig;e runterladen und das private Nutzen sei jedoch legal. Ganz zu schweigen vom direkten  Anschauen auf der Website.\r\n\r\nDa ich nirgends irgendwelche Daten von mir angegeben habe und nichts runter geladen habe, kann ich mich doch nicht strafbar machen, oder?\r\n\r\nFalls es legal ist und ihr auch gerne s&auml;mtliche Filme kostenlos schauen wollt, holt euch einen Ad-Blocker (falls ihr aus irgendeinem Grund noch keinen habt) und schaut auf kino.to\r\n\r\nSolltet ihr einen Kommentar, bez&uuml;glich zum ersten Teil des Threads senden wollen, dann bitte nur, wenn ihr wirklich Ahnung davon habt und nicht nur ein gef&auml;hrliches Halbwissen, wie ich.\r\n\r\n**League of Legends - Film**\r\n\r\nGibt es schon irgendwelche Informationen zu einem m&ouml;glichen League of Legends - Film? W&auml;re ne coole Sache. Aber am besten, eher wie der WoW - Film, bin nicht so der Anime - Fan.\r\n\r\nLg Preveam{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Nohgolgh","date":"2017-02-18T07:03:26.762+0000","up_votes":3,"down_votes":0,"body":">Ich habe gehört, dass es illegal sei, (Kino) Filme, Streams kostenlos aus dem Internet runter zu laden und in sozialen Netzwerken oder auf Veranstaltungen zu zeigen. Das bloße runterladen und das private Nutzen sei jedoch legal. Ganz zu schweigen vom direkten Anschauen auf der Website.\n\nIst rechtlich eine Grauzone. Das Herunterladen einer speicherbaren Kopie eines Werkes, auf dem das Urheberrecht liegt, ist strafbar, ganz gleich ob für öffentliche oder private Zwecke. Bei dem Anschauen eines Videos \"im Netz\" lädst du auch eine (hypothetisch speicherbare) Kopie herunter (irgendwie kommen die Daten an den Rechner), praktisch aber hast du am Ende keine solche Kopie. Darüberhinaus hat die Filmindustrie wenig Interesse daran, die Endnutzer hinter Gitter zu bringen, denn diese sind die besten Kunden (ich schaue beispielsweise kaum Filme, deswegen gehe ich auch nicht auf diese illegalen Seiten, aber ich bringe der Filmindustire somit auch nicht viel ein). \n\n>Da ich nirgends irgendwelche Daten von mir angegeben habe und nichts runter geladen habe, kann ich mich doch nicht strafbar machen, oder?\n\nUm dazu etwas sagen zu können, musst du den Sachverhalt konkreter machen. Es kann aber bereits reichen, dass du geschäftliche Verbindungen mit den illegalen Videobetreibern hast (so behauptet kinox.to meines Wissens, nur eine Suchmaschine zu sein und nichts mit den eigentlichern Betreibern am Hut zu haben, quasi wie google und ihre Ergebnisse, strafbar machen sie sich trotzdem). \n\nMein persönlicher Rat, ist es nicht auf diese Seiten zu gehen und sich keine Videos unbekannten Ursprunges runterzuladen, weil das genauso gut Viren sein können. Mein persönlicher Rat wäre aber auch, ein Buch zu lesen.","replies":[]},{"poster":"Ηastur","date":"2017-02-18T13:09:12.997+0000","up_votes":2,"down_votes":0,"body":"Wenn du einen Film streamst lädst du ihn in den Zwischenspeicher des Rechners. Rein theoretisch kann man die Datei von dort extrahieren und speichern. Ergo ist ein Stream ein download.\nEs gibt einen Präzedenzfall, in dem jemand dafür strafbar gemacht wurde, dass er filme online auf solchen Plattformen gesehen hat. Leider habe ich grade keine Quelle, aber ich denke das sollte sich rellativ fix googlen lassen. Darüber hinaus sendest du deine IP an den Host, sobald du eine Homepage aufrufst. Das bedeutet, der Seitenbetreiber, bzw. Admins können sehen wer sich einloggt oder auf der Seite befindet. Ich weiß jetzt nicht genau, ob man Leuten nachweisen kann, die sonst keine Angaben machen, dass sie auch gestreamt haben und idR. werden eher Seitenbetreiber und Uploader, bzw angemeldete User bestraft.\nDer Aufwand alle  Kinox-Nutzer von einem Tag nachzurecherchieren birgt enormen Arbeitsaufwand, der es im Grunde nicht wert ist, weshalb es unwahrscheinlich ist, dass sowas passiert. Legal ist es zwar nicht, aber so enorm unwahrscheinlich, dass mir mehrere Freunde aus juristischen Kreisen sagten, dass man sich eigenltich keine Sorgen machen braucht. Diese Info ist allerdings auch schon 2-3 Jahre alt.","replies":[]},{"poster":"Eibert Rümmel","date":"2017-02-21T21:12:43.613+0000","up_votes":1,"down_votes":0,"body":"mein letzter Stand (vor 2 jahren) ist etwa der. Das streamen ist eine rechtliche grau zone. theoretisch könnte das laden in den zwischenspeicher rechtlich mit einem download gleichgesetzt werden, was das streamen auch rückwirkend illegal machen würde. \n\nDas Posten von Links ist definitiv illegal und kann verfolgt werden. Deswegen liegen die Linksammelungen allesammt im Ausland.\n\nwer solche Seiten nutzen will, sollte einen scriptblocker verwenden und manuell nur freigeben, was man wirklich zum schauen benötigt. Sich Viren einzufangen ist auf solchen Seiten relativ leicht","replies":[]},{"poster":"thefire7","date":"2017-02-18T07:02:50.935+0000","up_votes":2,"down_votes":2,"body":"> Ich habe gehört, dass es illegal sei, (Kino) Filme, Streams kostenlos aus dem Internet runter zu laden\n\nJA es ist illegal, mach das nicht!\n\n> und in sozialen Netzwerken oder auf Veranstaltungen zu zeigen\n\nDas auch nicht!\n\n> private Nutzen sei jedoch legal\n\nNur anschauen ist glaube ich eine Grauzone, bei dem man nicht bestraft werden kann. RUNTERLADEN IST VERBOTEN!\n\n> Da ich nirgends irgendwelche Daten von mir angegeben habe und nichts runter geladen habe, kann ich mich doch nicht strafbar machen, oder?\n\nDu musst wissen, dass jeder am PC ohne eine gute VPN sozusagen im Internet mit einem Schild um den Hals surft und auf dem Schild steht Name, Adresse, Telefonnummer und EMail drauf\n\n\nZu einem Film hat sich Riot bisher bereits geäußert (in einem \"Frag Riot\") den Beitrag kannste ja mal suchen.","replies":[]}]}