{"poster":"Froskurinn","date":"2016-06-24T05:03:21.700+0000","title":"FanFiction Contest Announcement","subforum":"FanFiction","up_votes":15,"down_votes":2,"body":"http://i.imgur.com/kznPoIN.jpg\n\nSalutations!\n\nTo celebrate all forms of artistic expression and creativity of this incredible community, we&rsquo;re launching the League of Legends FanFiction contest! We challenge you to create an original story that captures the essence of League of Legends and flaunts your prowess of the pen.\n\n****\n**The Prompt:**\nThe average day in Runeterra.\n**** \n**Contest Rules: **\n- **Your submission must be no longer than 1,500 words.** There is no minimum requirement on word count however; if you can tell a compelling story in 6 words, you are truly mighty. \n-**One entry per person.** A single change can drastically alter the course of a story, but we want the best version and your gut-instinct.\n- **Your submission must be in English. **The contest will be using the primary language of the region. \n-** Entry must be appropriate for players of all ages. **League is rated Teen, so there is some wiggle room - but please, think of the children!\n-**Must be made by you, submitted by you, and made for this contest.** This is about us celebrating you and your incredible ability for this contest. \n-**Submissions must be submitted using the OCE boards in the appropriate sub-board.** This process will be detailed further down. This does mean that _you must have an Oceanic League of Legends account to claim your prize_. \n\n****\n**Grading  Rubric and Voting:**\nJudging art is always a subjective and tricky business, so we&rsquo;re getting a bit of help. This contest will have two stages. The first stage will be us collecting the entries and grading them on the Rubric explained below. From there, we&rsquo;ll create a shortlist of ten stories and announce them on the boards. The Community will then be called on to vote on that selected shortlist to determine the final five winners.\n\nThe Rubric is explained and ordered below in a weighted fashion. Creativity being the most important and Grammar being the least important to grading. \n \n* **Creativity. **The most important of the Rubric and that hardest to really quantify. In short, how did you best leave your fingerprint on the essence of League of Legends? \n* **Prompt.** Compliment or dismantle the given prompt in whichever way you fancy. \n* **League of Legends Elements.** This is a League FanFiction contest! The more elements from the game or lore (twisted or canon) the better!\n* **Grammar.** No one is perfect, we know that. And we also know that a single spelling mistake shouldn&rsquo;t detract from a great story, but we need to be able to understand and get through your story without confusion.\n****\n**How to Submit: **\nTo promote community feedback, show off your talents, and give your submissions a home during the contest, we&rsquo;re opening **[this new section of the Boards!](http://boards.oce.leagueoflegends.com/en/c/contest-fan-fiction)**\n\n**To submit your story**, simply make a new thread on the **[Contest: Fan Fiction sub-board](http://boards.oce.leagueoflegends.com/en/c/contest-fan-fiction)** with your story formatted for easy reading. We encourage everyone to peak into the new FanFiction sub-board and give feedback on our communities hard work!\n ****\n**Contest Dates: **\nThe FanFiction Contest Submissions will be open from **June 24th** to **July 10th**. The shortlist will be revealed on July 27th and Community Voting will commence! The Community will get 1 week to vote, which means that on August 4th the winners will be announced!\n\nWhen you&rsquo;re ready, [submit your masterpiece here](http://boards.oce.leagueoflegends.com/en/c/contest-fan-fiction)!  \n****\n**Prizing: **\nThe Top 5 Winners will receive Riot Points:\n_1st: 10,000\n2nd: 7,000\n3rd: 4,000\n4th: 2,500\n5th: 1,500_\n****\n**And Finally:**\nHere at Riot we don&rsquo;t do anything without thoroughly enjoying it ourselves. After careful testing of many prompts, I&rsquo;ve decided to try my own hand at FanFiction and kick us off.  \n\nYou can spot[ my submission](http://boards.oce.leagueoflegends.com/en/c/contest-fan-fiction/i18iQJOV-piltovers-finest-day) hanging out in the **[appropriate sub-board](http://boards.oce.leagueoflegends.com/en/c/contest-fan-fiction)**.\n\nBut don&rsquo;t let me have all the glory. Take a trip through the mechanical intricacies of Piltover, pillage through the grime of the Noxus sewers, or climb to the highest peaks of Mt.Targon  - but take us on a magical (or mundane) journey through the average day in Runeterra. \n\nCheers!","replies":[{"poster":"Rich Homie Quinn","date":"2016-06-24T06:07:29.785+0000","up_votes":21,"down_votes":0,"body":"So R18+ submissions aren't allowed? What about esports fanfiction? I have a particularly gripping LCK romance story called Fifty Shades of PraY that I'd like to submit.","replies":[{"poster":"Brodo1","date":"2016-06-29T16:12:53.585+0000","up_votes":3,"down_votes":0,"body":"Please post anyway","replies":[]},{"poster":"Bickie","date":"2016-06-28T05:29:38.501+0000","up_votes":2,"down_votes":0,"body":"I'd love to read this","replies":[]}]},{"poster":"Currypuff1234","date":"2016-07-27T00:13:51.769+0000","up_votes":6,"down_votes":0,"body":"Is the shortlist coming out later today???{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"azaki","date":"2016-07-27T00:45:41.708+0000","up_votes":2,"down_votes":0,"body":"It should be, but the time is unknown, and I'm getting paranoid about it!!","replies":[]}]},{"poster":"Chalze","date":"2016-06-26T05:36:56.335+0000","up_votes":5,"down_votes":0,"body":"(Joke submission, will do proper one later)\n\nYou say 6 word story? CHALLENGE ME RIOT.\n_______\n\nI'm Lee Sin.\n\nI can't see.\n\n_______\n\n10,000RP plz","replies":[{"poster":"Oneechan","date":"2016-07-10T08:32:12.312+0000","up_votes":1,"down_votes":0,"body":"This man deserves a win.","replies":[]}]},{"poster":"Maraudaur","date":"2016-06-24T05:32:30.459+0000","up_votes":3,"down_votes":1,"body":"Super excited to read all the entries! (as many as I can)","replies":[{"poster":"RUSTYtheCASTER","date":"2016-06-24T06:47:12.419+0000","up_votes":6,"down_votes":1,"body":"He is but one Maraudaur in a sea of stories, drown him with words! {{champion:267}}","replies":[]}]},{"poster":"Chronicity","date":"2016-07-09T13:19:04.094+0000","up_votes":4,"down_votes":0,"body":"Will there be fanfic contests like this in the future? This one has been a lot of fun :)","replies":[]},{"poster":"Hiitsjustme","date":"2016-07-10T10:20:57.189+0000","up_votes":2,"down_votes":0,"body":"WAIT SO RIOT IS ONLY CHOOSING 10 PEOPLE!!!!\nand here i thought they are going to let everyone vote for any story :(\nriot if u r reading this plz pick mines i worked so hard on it. I BEG OF U <3","replies":[]},{"poster":"Hiitsjustme","date":"2016-07-10T07:52:34.457+0000","up_votes":2,"down_votes":0,"body":"Plz check my one out http://boards.oce.leagueoflegends.com/en/c/contest-fan-fiction/5IWaHQzM-a-heart-without-a-beat-i-aa \nSend it to your friends if you want :P and good luck to everyone <3","replies":[]},{"poster":"Jason","date":"2016-06-28T08:10:49.470+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sno,realm=OCE,application-id=wJE2nAgV,discussion-id=TQsEsHat,comment-id=,timestamp=2016-06-24T05:03:21.700+0000)\n> **And Finally:**\n> Here at Riot we don&amp;rsquo;t do anything without thoroughly enjoying it ourselves. After careful testing of many prompts, I&amp;rsquo;ve decided to try my own hand at FanFiction and kick us off.  \n\n\nWe here at Riot? \n\nAre you joining the Sydney team Sno, or are you just claiming affiliation with the overlords?\n\nCould totally do a submission on this. xD","replies":[{"poster":"Froskurinn","date":"2016-06-29T06:17:27.091+0000","up_votes":2,"down_votes":0,"body":"I am part of the Riot team! Froskurinn here - shoutcaster for the LPL and OPL.","replies":[{"poster":"Jason","date":"2016-06-29T15:29:11.106+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sno,realm=OCE,application-id=wJE2nAgV,discussion-id=TQsEsHat,comment-id=00170000,timestamp=2016-06-29T06:17:27.091+0000)\n>\n> I am part of the Riot team! Froskurinn here - shoutcaster for the LPL and OPL.\n\nOh, nice! \n\nI always thought you were called something closer to Froskurinn.... but oh well.\n\nlove the tattoo work so far, btw","replies":[]}]}]},{"poster":"THE RlVER KlNG","date":"2016-06-26T12:59:31.237+0000","up_votes":1,"down_votes":0,"body":"I'm an American player, but I love writing. So when I heard about this contest, I made an OCE account so that I could enter and farmed it to 5; unfortunately, it isn't showing up as Level 5 on these forums. I was wondering if there was any at all way I could still enter as an NA player, I spent a lot of time working on my submission. If so, would it also be possible (if i win) for the prize be sent to this account?","replies":[{"poster":"Froskurinn","date":"2016-06-27T02:31:58.200+0000","up_votes":2,"down_votes":0,"body":"Unfortunately, the contest is limited to OCE accounts :(\n\nThat said, even if you can't enter the contest, I know I would be incredibly keen to read something that someone has so much drive for.","replies":[{"poster":"THE RlVER KlNG","date":"2016-07-25T03:23:28.354+0000","up_votes":1,"down_votes":0,"body":"I have since posted it under OCE so I think I'm set.","replies":[]}]}]},{"poster":"Mythstriker","date":"2016-06-26T12:35:43.339+0000","up_votes":3,"down_votes":1,"body":"6 words to tell a compelling story... hmmm...\n\nThat day, graves found a cigar.\nEND  ( ͡° ͜ʖ ͡°)","replies":[{"poster":"Technoscribble","date":"2016-07-11T09:40:09.773+0000","up_votes":1,"down_votes":0,"body":"*This account has been banned for attempted destruction of the balance of the universe*","replies":[]}]},{"poster":"Umi","date":"2016-06-24T17:04:13.060+0000","up_votes":2,"down_votes":1,"body":"Can I write about a Rioter instead?\n\nHis name starts with w and ends with a wu","replies":[]},{"poster":"Aznbeat","date":"2016-06-24T08:21:15.099+0000","up_votes":2,"down_votes":1,"body":"oh man i dont think im allowed to enter but i want to soooo bad","replies":[]},{"poster":"MagiKyubi27","date":"2017-01-25T02:33:55.454+0000","up_votes":1,"down_votes":0,"body":"MAAAAAN i really wish i could participate. i made a Ahri and Kindred story that i really love and i really wanna share it to see what other people think X3","replies":[]},{"poster":"MissMaddie95","date":"2016-07-25T23:39:53.722+0000","up_votes":1,"down_votes":0,"body":"I'm so eager to find out which pieces made it to the top 10. I've been reading through some and I can't believe how much talent is out there, and I have no idea how the team are going to narrow the field to just 10!\n\nPlease feel free to check out my story: http://boards.oce.leagueoflegends.com/en/c/contest-fan-fiction/w14GpeHd-puella-ex-machina-the-girl-from-the-machine \n\nBest of luck to all x","replies":[]},{"poster":"Blayzeatron","date":"2016-07-12T11:08:36.623+0000","up_votes":1,"down_votes":0,"body":"There has now been 3 late submissions. How does this work? Are they allowed to be judged? I believe that one of them had a good reason from him having to create an account on oceania before being able to submit but otherwise what is the deal?","replies":[{"poster":"Maraudaur","date":"2016-07-13T00:27:47.433+0000","up_votes":1,"down_votes":0,"body":"The ones submitted late wont be eligible for the competition.","replies":[{"poster":"THE RlVER KlNG","date":"2016-07-25T03:24:45.970+0000","up_votes":1,"down_votes":0,"body":"I had already posted it under NA very early into the contest however. It was really just because you said you needed to be OCE to enter. I entered in NA with the same story under the time limit and reposted it with an OCE acc so I would be eligible. I would hope that my entry would be eligible, then.","replies":[]},{"poster":"Luskeutua","date":"2016-07-13T01:32:37.912+0000","up_votes":1,"down_votes":0,"body":"Even if they're ineligible, will they at least be read? :)","replies":[]}]},{"poster":"Luskeutua","date":"2016-07-12T13:52:05.631+0000","up_votes":1,"down_votes":0,"body":"Oh... damn, I misread, I thought the 27st was the submission date >_<","replies":[]}]},{"poster":"AdcStoleMyAs5ist","date":"2016-07-22T23:03:03.275+0000","up_votes":1,"down_votes":0,"body":"Looking forward to the big reveal! Just a question:\n\nMany of our entries cross a wide variety of genres (something of a by-product of the open-ended and alternatively-interpretable 'average day in Runeterra' theme), which has been pretty cool to see. \nIn ways this is like judging 'Apples and Oranges' - will there be a quota of serious/sad/silly stories, will you eliminate certain genres, will you just go off judge preference, or will you stay true to the 'Creativity/Prompt/League-Elements' rubric for _all_ stories (which should be good, but looks like quite the mission!)\n\nBest of luck to all entries! ^_^","replies":[]},{"poster":"Currypuff1234","date":"2016-07-19T13:34:11.401+0000","up_votes":1,"down_votes":0,"body":"Hmm I am really curious if the community will troll when they have to vote.","replies":[{"poster":"Blayzeatron","date":"2016-07-20T06:10:27.315+0000","up_votes":1,"down_votes":0,"body":"Troll how?","replies":[]}]},{"poster":"CapNRoddy","date":"2016-06-26T06:29:18.237+0000","up_votes":1,"down_votes":0,"body":"Too bad you guys gutted everything good about the lore.","replies":[{"poster":"Technoscribble","date":"2016-07-11T09:42:00.426+0000","up_votes":1,"down_votes":0,"body":"{{champion:32}} lore used to be more than 2 lines, I cri evrytim","replies":[]},{"poster":"Lotsajames","date":"2016-06-29T16:28:56.040+0000","up_votes":1,"down_votes":0,"body":"They said in the post \"The more elements from the game or lore (twisted or canon) the better!\", so you could still use outdated lore as the basis of your story","replies":[]}]},{"poster":"Anserem","date":"2016-07-11T01:20:45.111+0000","up_votes":1,"down_votes":0,"body":"Nooo... spent my last few weeks finishing off exams, and I sit down for the first day of holidays to write my fanfic, and it's a day too late... {{item:3070}} {{champion:32}} {{item:3070}} Is it possible to enter a sneaky late entry please?","replies":[]},{"poster":"LarsTripC","date":"2016-07-09T10:55:58.924+0000","up_votes":1,"down_votes":0,"body":"Question about contest entry times\n\nThe FanFiction Contest Submissions will be open from June 24th to July 10th.\n\nIs that like finished at midnight on the 9th or midnight on the 10th?\n\nJust found out about this, wondering if there still time to enter ","replies":[]},{"poster":"The Lady Loki","date":"2016-07-07T03:05:26.088+0000","up_votes":1,"down_votes":0,"body":"Trying to write my Jinx based story, the hardest part was keeping the language clean for the kiddies. I've always seen her as swearing like a sailor and I had to keep trying to keep it out of the story.","replies":[]},{"poster":"Zinc Sakira","date":"2016-07-06T12:51:30.616+0000","up_votes":1,"down_votes":0,"body":"So like you (and the team) would read every single fanfic and then grade them? Because honestly what i wrote in my fanfic is a concept that gets shadowed in the lores, so im just hoping that you would get them so that my fate does not depend on the community where most people wont understand .","replies":[]},{"poster":"PepprMinty","date":"2016-07-02T02:37:31.371+0000","up_votes":1,"down_votes":0,"body":"So I was brainstorming ideas for a story, when I realised I could write a story about a fight between Zed and Shen or something like that. Looking back over the requirements, I realised that this idea doesn't really fit the prompt \"The average day in Runeterra.\" I just wanted to ask if it indeed does fit the prompt, as the example submission above (Piltover's Finest Day) details Caitlyn killing Jinx, two characters as intertwined in their lore as Zed and Shen.","replies":[{"poster":"Mockingjoy","date":"2016-07-02T03:42:19.094+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PepprMinty,realm=OCE,application-id=wJE2nAgV,discussion-id=TQsEsHat,comment-id=0022,timestamp=2016-07-02T02:37:31.371+0000)\n>\n> So I was brainstorming ideas for a story, when I realised I could write a story about a fight between Zed and Shen or something like that. Looking back over the requirements, I realised that this idea doesn&#x27;t really fit the prompt &quot;The average day in Runeterra.&quot; I just wanted to ask if it indeed does fit the prompt, as the example submission above (Piltover&#x27;s Finest Day) details Caitlyn killing Jinx, two characters as intertwined in their lore as Zed and Shen.\n\nThe rubric states that you can \"[c]ompliment or dismantle the given prompt in whichever way you fancy.\"\n\nIn your case, you could make a sarcastic interpretation of the prompt - the \"_average_\" day in Runeterra.\n\nMy submission is also about Zed and Shen, so if a story about the two fighting isn't allowed, I'm also screwed.","replies":[{"poster":"PepprMinty","date":"2016-07-02T04:39:43.247+0000","up_votes":1,"down_votes":0,"body":"Thanks for your help man. Good luck with your story!","replies":[]}]}]},{"poster":"Scarlax","date":"2016-07-01T14:14:00.596+0000","up_votes":1,"down_votes":0,"body":"Is the 1500 word limit strict? Or are we allowed a 10% grace","replies":[]},{"poster":"EzeBlood","date":"2016-07-01T05:19:37.570+0000","up_votes":1,"down_votes":0,"body":"So, is Rengar being burned by demonfire off limits?","replies":[]},{"poster":"Zinc Sakira","date":"2016-06-30T15:36:42.698+0000","up_votes":1,"down_votes":0,"body":"I have literally read every single champion's lores, extended lores, side stories, and champion pages. I used 2 days analyzing and sorting where each champion originates from, what their connections with other champions are, etc. (surprised to see that Aurelion Sol, Bard, Rek'Sai and Dr. Mundo have no connections whatsoever. They're literally the loneliest people across Runeterra. Ok maybe Bard has those little yellow creatures, and Dr. Mundo i can understand because he's literally insane, but aurelion sol? I expected him to somehow be related to Soraka or at least know her. Cmon. Star forger? Star child? No connection? Really Riot?) 3 pages of A5 paper, used with the tiniest font i could muster with my hand, all used up in planning. I've always been fascinated by how Riot makes a connection between everything, the creation of worlds and places that make it so real. All that preparation for this contest, just because i like writing (and i can't draw, might i add) Now, I've poured my heart and soul to my entry, and you can expect something creative and something that shouts, \"League of Legends!\" be prepared riot!","replies":[]},{"poster":"xWZDx","date":"2016-06-30T11:43:12.202+0000","up_votes":1,"down_votes":0,"body":"\"Entry must be appropriate for players of all ages. League is rated Teen, so there is some wiggle room - but please, think of the children!\"\n\nI have decided to include some gore in my story. Is that fine, kind Sir?","replies":[]},{"poster":"Horizonn","date":"2016-06-28T02:05:04.082+0000","up_votes":1,"down_votes":0,"body":"Can this story be about a character made by yourself?","replies":[]}]}