{"poster":"Rydup","date":"2015-02-13T07:58:46.484+0000","title":"Ma sul serio?:\\","subforum":"Aiuto e supporto","up_votes":17,"down_votes":5,"body":"Ieri mattina ho aspettato ben 4 ore di \"Computazione Differenze\"fino ad arrivare a 23k di files esaminati,e poi sono riuscito a giocare ancora,tutto bene fino a qui.\r\nStamattina riaccendo e cosa succede?Ancora quella dannatissima \"Computazione Differenze\"\r\nIo voglia di aspettare ancora 4 ore non ne ho,qualche consiglio per riparare il client buggattissimo di LoL?","replies":[{"poster":"Law1Rz","date":"2015-02-13T13:21:21.347+0000","up_votes":2,"down_votes":0,"body":"Non insultatemi, ma visto che league of legends è un gioco **gratuito** io non mi lamenterei troppo, si tratta di disagi temporanei che capitano meno di una volta al mese, detto questo buona giornata!","replies":[{"poster":"7 Swords or more","date":"2015-02-13T15:38:48.340+0000","up_votes":6,"down_votes":1,"body":"genio in un anno hanno fatturato 7 miliardi e più quindi un errore tecnico così evitabile e ripetuto a mio parere è scandaloso","replies":[]}]},{"poster":"Pikkkkk","date":"2015-02-13T17:35:20.719+0000","up_votes":4,"down_votes":0,"body":"Come minimo ci devono regalare una skin :)","replies":[]},{"poster":"Rydup","date":"2015-02-13T08:40:25.669+0000","up_votes":6,"down_votes":2,"body":"Allora non sono l'unico ad avere questo problema...\nLa RIOT dovrebbe pensare a fixarle queste cose invece di fare skin su skin...\nIo 4 ore di Computazione differenze non le faccio ancora... :\\","replies":[{"poster":"Princess Rengar","date":"2015-02-14T19:38:21.570+0000","up_votes":1,"down_votes":1,"body":"Perchè è risaputo che i Rioter che creano skin sono gli stessi che si occupano del settore tecnico XD","replies":[]}]},{"poster":"WillGvoN","date":"2015-02-13T17:25:58.656+0000","up_votes":2,"down_votes":0,"body":"raga anche a me è successo.. e per quanto ho letto posso  dire che per quanto lol sia un gioco ftp non vuol dire che sono noprofit.. anzi! avendo avuto un successo mondiale come gioco non solo guadagnano soldi da skin  e cazzi vari sul game (che equivalgono al 5% del fatturato totale) ma da sponsor organizzazione di eventi di qualsiasi genere e ovunque! se pensate solo che ogni squadra delle lcs ha sponsor incredibili (cito Samsung, telecom, benQ) e durante questi eventi pazzeschi tipo le world series sono strapagati per usare attrezzature e varie altre cose degli sponsor! hanno un canale yt con non so quanti milioni di iscritti (altri soldi), milioni su twitter (altri ancora), milioni di persone che affluiscono sul loro sito per il forum ( immaginate che ogni volta che succede un problemino su lol e magari non parte la patch tutti e dico TUTTI vanno sul forum a vedere cos'è successo e questo per google adsense vuol dire altri soldi, vi faccio solo capire che se in un giorno, dato che io lo faccio, 200 persone visualizzano un post avete guadagnato 10 euro, ora fate il rapporto 10/200 fanno 0.05 € a visita, considerate che lo stesso post viene visto da 20 milioni di persone) quindi dire che è ftp è giusto, ma come ogni azienda come la riot deve saper gestire i suoi utenti al meglio! ma questo in ogni caso è un problemino insignificante, non dura 4 ore ma circa 10 minuti e conoscendo la tempestività della riot aggiusteranno il problema in men che non si dica. P.S. per certa gente: non esiste il Signor Riot, ma tante persone che fanno parte di un azienda e che hanno mansioni SEPARATE.. perciò quando scrivete: \"la riot dovrebbe aggiustare ste cose invece di fare skin!!!111!!!!\" avete sparato una cazzata e basta e l'unica risposta che può ricevere è questa ---> -.-'''''' (nb. i grafici fanno le skin, i programmatori fixano i bug. Un grafico non può fixare un bug se non ne ha la mansione e viceversa. ) LoL","replies":[]},{"poster":"ShowterX","date":"2015-02-13T12:47:28.503+0000","up_votes":2,"down_votes":0,"body":"pensate io ho finito di fare aggiornamento chiudo e riapro il client e mi da file danneggiati e me li sta correggendo ora.-. aspetterò un altro pò xD.. nel frattempo mi ritiro su smite","replies":[]},{"poster":"StateSheep","date":"2015-02-13T09:23:02.857+0000","up_votes":2,"down_votes":0,"body":"idem ... che balls! ..{{champion:61}}","replies":[]},{"poster":"Okamichan84","date":"2015-02-13T09:09:49.590+0000","up_votes":2,"down_votes":0,"body":"dopo 12000 file è riuscito a fare l'aggiornamento.....","replies":[]},{"poster":"LunSeiSleidee","date":"2015-02-13T08:38:04.149+0000","up_votes":2,"down_votes":0,"body":"Stesso problema... ero finalmente riuscita a far andare il gioco di nuovo, e adesso... COMPUTAZIONE DIFFERENZE. Che volete che vi dica, alla Riot sono gentili con la concorrenza e stanno insistendo nel convincermi a scaricare DOTA2.","replies":[{"poster":"Foschìa","date":"2015-02-13T09:17:21.195+0000","up_votes":1,"down_votes":0,"body":"Lol, per così poco?","replies":[{"poster":"Rydup","date":"2015-02-13T09:29:55.189+0000","up_votes":1,"down_votes":0,"body":"Beh,oddio,cosi poco.\nio ieri ho aspettato ben 4 ore per giocare,e oggi si ripresenta il problema,per me non è poi cosi poco :\\","replies":[{"poster":"Foschìa","date":"2015-02-13T09:38:28.953+0000","up_votes":1,"down_votes":6,"body":"Boh ragazzi basta cercare una soluzione... \nAvete provato le soluzioni proposte? Ne ho lette tipo 4 diverse, mi sembra alquanto improbabile che nessuna funzioni... Comunque se per 2 giorni non che non riesci a giocare disinstalli, non è che tu (il tu è generico, visto l'andazzo meglio precisare) ci faccia proprio una passione eh :)","replies":[{"poster":"NIGERUNDAYO JoJo","date":"2015-02-13T09:49:07.713+0000","up_votes":1,"down_votes":0,"body":"Fammi capire, se qualcuno non riesce a giocare perché il client gli da problemi, dovrebbe disinstallare LoL invece di insistere per chiedere aiuto? \nIo penso che una delle maggiori priorità dello staff sia garantire una buona esperienza di gioco. E per farlo, il client dovrebbe funzionare CORRETTAMENTE.\nSe poi anche loro la pensano cosi (chi vuole giocare, nonostante  tutti sti errori e malfunzionamenti continui, allora giocasse, altrimenti puo disinstallare LoL) beh..che posso dire, non ha tutti i torti se vuole spostarsi su dota2 (magari il supporto e lo staff funzionano meglio lì che qui).","replies":[{"poster":"Foschìa","date":"2015-02-13T10:16:50.444+0000","up_votes":3,"down_votes":1,"body":"Proprio per questo lo staff, avendo un problema, cerca delle soluzioni per risolvere e le propone all'utenza... Cosa pensi che debbano fare? Mandare qualcuno a casa tua a farlo? Oltretutto il problema è di una minoranza dei giocatori non tutti, più che proporre soluzioni cosa dovrebbero fare?\n \nPoi \"tutti questi errori e malfunzionamenti\" lol? Oh non è che sia l'avvocato della RIOT ma qui vedo gente che viene a piangere perchè una volta gli è crashato il client ad esempio, se ti riferisci a questi \"errori e malfunzionamenti\", siam messi bene... \n\nMa che poi fregacazzi se andate su dota o dove, mi è solo sembrato un tantino eccessivo dire di smettere di giocare perché hai problemi ad installare una patch, evidentemente non siete abituati a lavorare e capire che certe cose possono capitare (a chi lavora), ergo avete la pazienza di un bambino di 3 anni :)","replies":[{"poster":"NIGERUNDAYO JoJo","date":"2015-02-14T19:40:25.188+0000","up_votes":1,"down_votes":0,"body":"Ho detto che dovrebbero venire a controllare  a casa mia cos'è che non va? No.\nHo detto errori e malfunzionamenti parlando \"genericamente\". Non vedo poca gente lamentarsi di crash, lag, cose come quella successa al creatore del topic..sarà solo una piccola parte dell'utenza, sicuramente, ma non capisco perché non prendere in considerazione che ci sia qualche problema al client e non al pc (visto che, ogni volta che qualcuno si lamenta , viene sempre data la colpa al pc o alla connessione..).\nE ovviamente io mi lamento sempre dopo aver provato tutte le soluzioni, non è che vengo a sparlare così sul forum senza aver consultato prima una guida per risolvere il problema..\nPs. Personalmente non smetterei di giocare per così poco, ne tantomeno farei polemiche perché ho dei problemi con le patch o simili (piuttosto cercherei una soluzione in giro, e nel caso chiederei aiuto al supporto)..il mio era uno sfogo verso il tuo post(non riesco a starmi zitto di fronte a qualcuno che se ne frega dei problemi altrui..e mi riferisco alla frase \"non è che tu (il tu è generico, visto l'andazzo meglio precisare) ci faccia proprio una passione eh :) ), non mi sono lamentato più di tanto dei problemi con la patch lol","replies":[{"poster":"Foschìa","date":"2015-02-18T17:01:45.117+0000","up_votes":1,"down_votes":0,"body":"Quante parole che hai usato per in sostanza non dire nulla...\nComunque nel 90 % dei casi è proprio colpa del pc e/o della connessione, non è che lo dicano perché non han voglia di risolvere i problemi... E poi chi ha detto che il client non ha o non ha mai avuto problemi? Ho detto che sta/stanno facendo una tragedia perché per 2 giorni  non riescono a giocare (che il problema sia del client o che sia loro)... \nSinceramente non sto nemmeno come o cosa risponderti dato che per me il 99% delle cose che hai scritto non sono inerenti... \nPraticamente stai rispondendo ad un mio commento stizzito perché i BM si lamentano del nulla, lamentandoti del mi commento ed aggiungendo dettagli di come ti approcci tu ai problemi in questi casi...... ?!?! \n\nBoh :)","replies":[]}]}]}]}]}]}]},{"poster":"Ryuk1980","date":"2015-02-13T10:33:07.416+0000","up_votes":1,"down_votes":1,"body":"ciao, scarica dota2 e non lamentarti.","replies":[]}]},{"poster":"35cm","date":"2015-02-13T08:35:23.605+0000","up_votes":2,"down_votes":0,"body":"identico problema,mi chiedo se sia per le skin non se aspettare o rimuovere il client e reinstallarlo,mi sa da robba buggata.","replies":[]},{"poster":"Okamichan84","date":"2015-02-13T08:21:52.176+0000","up_votes":2,"down_votes":0,"body":"Anche a me stessa cosa, e anzi questa volta non cè nemmeno un avviso......","replies":[]},{"poster":"Manwarh","date":"2015-02-13T08:13:10.520+0000","up_votes":2,"down_votes":0,"body":"Anche a me,la patch si era installata perfettamente senza dare problemi,apro il client stamattina e mi da una computazione differenze infinita","replies":[]},{"poster":"Ziovi","date":"2015-02-13T08:03:15.857+0000","up_votes":2,"down_votes":0,"body":"anche a me stamani è partita di nuovo la computazione differenze, e mi stavo chiedendo... è normale? riot sta facendo delle modifiche?","replies":[]},{"poster":"NIGERUNDAYO JoJo","date":"2015-02-13T09:35:22.341+0000","up_votes":3,"down_votes":1,"body":"Stesso problema anche a me.\nIn tutto ciò, nessuno dello staff che risponde.\nNon me ne vogliate se vi torna un feedback negativo per il supporto ottenuto..","replies":[]},{"poster":"7 Swords or more","date":"2015-02-13T13:19:45.143+0000","up_votes":2,"down_votes":1,"body":"l'altro ieri ho fatto il fix manuale e ho apsettato una vita il nuovo download di tutto e non sono risucito a giocare ieri il launcher si è avviato dopo 1 ora che aspettavo con la cazzo di scritta di league of leggends in mezzo allo schermo e oggi mi riprende con l'errore dell'altro ieri della computazione file? mi prendete per il culo? ed è scandaloso che non avete dato una cazzo di risposta o spiegazione..schfio 3 giorni persi e volere pure acquistare delle skin in saldo..","replies":[]},{"poster":"Svampa","date":"2015-02-15T10:51:31.750+0000","up_votes":1,"down_votes":0,"body":"A qualcuno il problema persiste ancora? Io è da tre giorni che non riesco a scaricare la patch 5.3.","replies":[]},{"poster":"monnyflare","date":"2015-02-14T03:06:09.277+0000","up_votes":1,"down_votes":0,"body":"anche a me stesa storia... visto che nel game io ci spendo anche soldi, come immagino anche altri giocatori, mi aspetterei un buon servizio in ricambio.... speriamo ci lavorino sù e risolvano sta cosa velocemente!","replies":[]},{"poster":"The Joker On You","date":"2015-02-13T19:37:58.377+0000","up_votes":1,"down_votes":0,"body":"il rotto della cuffia mi dice che non appena finito tutto al 99 % leggo 0 patch applicate ...asssurdooooooo. non so voi..","replies":[]},{"poster":"The Joker On You","date":"2015-02-13T19:17:07.820+0000","up_votes":1,"down_votes":0,"body":"Quota 14k file esaminati...ancora niente mi sta girando tantissimo il cazzo... pure dopo la patch dell altro giorno...che 30k file da esaminare per un dowload poi da 5 min... scandalosissimoooooooo","replies":[]},{"poster":"karnux","date":"2015-02-13T18:31:01.084+0000","up_votes":1,"down_votes":0,"body":"SEPLICEMENTE SCANDALOSO.....   ps: io parlo da ignorante perche di queste cose nn me ne intendo... ma teoricamente nn dovrebbero accertarsi che le patch fungono prima di rilasciarle ????","replies":[]},{"poster":"Pikkkkk","date":"2015-02-13T16:57:13.926+0000","up_votes":1,"down_votes":0,"body":"stesso problema, l'altro ieri mi ha fatto così ma almeno c'era un avviso. Ieri ho giocato ed oggi di nuovo così. Ho disinstallato e reinstallato ma niente. L'incubo è che mi riparte da 33% ogni volta.","replies":[]},{"poster":"Best Chair Euw","date":"2015-02-13T15:12:56.575+0000","up_votes":1,"down_votes":0,"body":"yuppi altre 12 k di file esaminati previsti nonostante lo abbia fatto già una volta :/\ncertamente non muoio se devo aspettare per giocare (anche se ovviamente da un po' noia il ripetersi dello stesso errore)...in altri giochi online che ho fatto quando si presentavano cose di questo genere i giocatori venivano \"ripagati\" di queste attese....penso che godyr da 32k rp sia un giusto accomodamento xD","replies":[]},{"poster":"Stefano","date":"2015-02-13T14:37:49.350+0000","up_votes":1,"down_votes":0,"body":"Io ho avuto lo stesso problema ma tempo 10 minuti ed è tornato a partire arrivato a 1500k è partito con download quindi vedete un pò voi","replies":[]},{"poster":"matteo 22999","date":"2015-02-13T13:24:20.497+0000","up_votes":1,"down_votes":0,"body":"Io sono arrivato a 3 500 file poi a cominciato a caricare","replies":[]},{"poster":"Ilario2107","date":"2015-02-13T12:58:31.112+0000","up_votes":1,"down_votes":0,"body":"Io ho lo stesso problema,si è bloccato al 33% e non va avanti sta a fare Computazione differenze | File esaminati ed è a 26500 file...","replies":[]},{"poster":"Siefilide","date":"2015-02-13T09:04:01.472+0000","up_votes":1,"down_votes":0,"body":"Vabe che ve lo dico a fa, anche a me la stessa cosa da ieri. Una volta è arrivato a 99% e si è bloccato. Un'altra a 33%, un'altra a 64% e l'ultima volta a 80%. Ho provato tutte le cose consigliate: riavviare, cancellare i dati della cartella project. Niente, assolutamente niente. La cosa che mi secca davvero tanto è che ho una connessione con giga limitati al mese, e finora solo ieri non so quanta roba Lol mi ha fatto scaricare. Non chiedo molto, ma almeno una risposta dalla riot su quanto bisogna aspettare e se effettivamente c'è un problema che stanno risolvendo. Ma comunque è chiaro che il problema c'è anche per chi riesce a loggare, bug, lag, crash etc.","replies":[{"poster":"Donny097","date":"2015-02-13T12:53:41.804+0000","up_votes":1,"down_votes":0,"body":"a me in 10 minuti ha controllato 15000 file ed ora sta scaricando 150Mb di aggiornamento {{item:3070}}","replies":[]}]},{"poster":"CallMeSamurai","date":"2015-02-13T11:15:57.575+0000","up_votes":1,"down_votes":0,"body":"idem arrivo ad un alto numero anche io ma con 15 20 minuti sto apposto\n4 ore.....esagerazione. con 4 ore disinstallo e scarico lol...","replies":[{"poster":"Rydup","date":"2015-02-13T12:07:42.368+0000","up_votes":1,"down_votes":0,"body":"Fidati che ci ho messo 4 ore,ho pure gli screen :\\\nSarà perchè ho il pc a pedali,boh.","replies":[]}]},{"poster":"REDekar","date":"2015-02-13T08:46:47.852+0000","up_votes":1,"down_votes":0,"body":"stesso problema dovrebbero essere 6670 file ragazzi","replies":[{"poster":"Okamichan84","date":"2015-02-13T08:49:29.497+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=REDekar,realm=EUW,application-id=98NGV4Al,discussion-id=t0QEyQre,comment-id=0006,timestamp=2015-02-13T08:46:47.852+0000)\n>\n> stesso problema dovrebbero essere 6670 file ragazzi\n\nio al momento ho superato i 10000 file.....","replies":[{"poster":"Suffer EternalIy","date":"2015-02-13T11:53:56.995+0000","up_votes":1,"down_votes":0,"body":"io i 12500 Kappa","replies":[]}]}]},{"poster":"Siefilide","date":"2015-02-13T11:22:53.697+0000","up_votes":1,"down_votes":0,"body":"E permettetemi di aggiungere che le uniche soluzioni proposte sono partite da normali utenti come noi, non dallo staff! L'unico messaggio dello staff è stato: riavviate di nuovo. Ma sti caxxi! Fatto almeno 5 volte. Provato anche a cambiare server per poi switchare, ZERO! si blocca al 54%. E ancora niente avvisi ufficiali. Se guardate sullo stato del server vi parlano di un Bug di teemo non so che. Tutto il resto perfettamente online. E mi fa incazzare chi dice che non bisogna lamentarsi perchè è nostro diritto avere almeno un'informazione. C'è gente che lavora e il tempo è prezioso. Per fedeltà si resta legati a Lol, ma porca miseria ogni due per tre ne esce una, e ovviamente sempre il Weekend! Ma noi accettiamo Lol con tutti i problemi. Però abbiate pietà e scassatevi le ditine a scrivere un messaggio per dire almeno: perdeteci le speranze questo weekend.  Manco lavorassero gratuitamente.","replies":[]},{"poster":"Suffer EternalIy","date":"2015-02-13T11:19:56.059+0000","up_votes":1,"down_votes":0,"body":"Ah ok allora noto che è un problema di tutti, a me piacerebbe solo capire cosa si stia aggiornando, per il resto lamentarsi è inutile bisogna solo aspettare però spero che tutto ciò finisca in fretta {{summoner:6}} Kappa","replies":[]},{"poster":"iRicky003","date":"2015-02-13T11:10:20.143+0000","up_votes":1,"down_votes":0,"body":"Pure a me si è ribuggato tutto :| {{champion:61}}  che palle... {{champion:61}}","replies":[]},{"poster":"CaosNecros","date":"2015-02-13T10:52:51.478+0000","up_votes":1,"down_votes":0,"body":"Apposto quindi non sono l'unico!! sinceramente è scocciante avere ogni 2 giorni sta cosa!!! io entro quell'oretta sperando di giocare.... poi mi ritrovo a dover aspettare il doppio...!!","replies":[]},{"poster":"chuckbart","date":"2016-06-14T17:50:15.039+0000","up_votes":0,"down_votes":1,"body":"è la terza che provo a reinstallarlo,mi da un errore dove mi dice \"aggiornamento fallito\" ero arrivato a 17k di file computati ora senza fare il repair l' ho rifatto partire ma si blocca sempre al 33% mentre continua ad analizzare i file,consigli?","replies":[{"poster":"Afrodyde","date":"2016-09-24T15:04:54.987+0000","up_votes":1,"down_votes":0,"body":"Ciao,hai risolto alla fine? perché io sto avendo lo stesso problema ora-.-\" \"aggiornamento fallito\". Cosa dovrei fare?","replies":[]}]},{"poster":"Fantaspettro","date":"2020-02-01T08:50:54.448+0000","up_votes":1,"down_votes":1,"body":"REPORT!!!!!\n^^","replies":[]}]}