{"poster":"0oflashpaulo0","date":"2018-10-10T23:40:02.663+0000","title":"partite classificate","subforum":"Discussioni generali","up_votes":1,"down_votes":9,"body":"ciao a tutti. gioco purtroppo a lol da circa 5 anni. in 5 anni a parte buttar fuori mille nuovi campioni senza senso che sono solo invisibili e che possono giocare in qualunque ruolo tanto vincono da soli,  si riuscirà prima o poi a giocare in classificata senza gente che ha raggiunto il livello 30 dal giorno prima e che gioca da circa 6 mesi? no perchè è bello perdere sempre tempo e partite con gente del genere. gente al quale permettete voi di giocare, perchè uno che arriva al 30 forse sa usare 1 campione. gente che prova i campioni in classificata, gente che gioca a caso prendendo il mid laner top oppure l assassino come adc, il support con l ignite full dmg ecc ecc... riuscirete a rendere questo gioco un po più giusto? chissa se in altri 5 anni ci riuscirete, vedremo.","replies":[{"poster":"Pellah","date":"2018-10-11T05:08:31.313+0000","up_votes":6,"down_votes":1,"body":"Il gioco è già giusto e questi giocatori non sono una scusa (anche perché hai comunque più possibilità che sia il team avversario a beccarsi quel giocatore). Per la parte del \"al livello 30 forse sa usare un campione\" ti sbagli, nemmeno quello. Il punto è che nemmeno tu lo sai fare con molta probabilità, per quanto mi riguarda puoi cominciare a dire di saper giocare un campione quando hitti il plat. Questo perché se tu da silver dai in mano il tuo champ (mettiamo che sei jungler) ad un jungler plat+ che non l'ha mai giocato e probabile che in poco più di 2 o 3 games circa lo giochi già meglio di te.\n\nSmettila di lamentarti e comincia a puntare a migliorare e vedrai che salirai, sei ancora in tempo per fare il Gold. Certo, se preferisci puoi anche continuare a lamentarti degli altri senza avere idea di quante cose sbagli e rimanere bloccato li ^^","replies":[{"poster":"mangialavandini","date":"2018-10-11T06:56:39.636+0000","up_votes":4,"down_votes":0,"body":"PELLAH non vende sogni ma solide realtà","replies":[]},{"poster":"0oflashpaulo0","date":"2018-10-11T14:46:04.770+0000","up_votes":1,"down_votes":1,"body":"Commento = 0\nSembra il commento fatto da 1 che gioca rank solo in team oppure che gioca rank solo con i campioni che sa usare anche mia madre che ti possono fare vincere da soli. Mi dispiace ma quelli non li gioco (garen darius lux brand annie MF yi jax ecc ecc!) sei il solito silver o Gold? Classico","replies":[{"poster":"Honey Queen","date":"2018-10-11T15:55:17.834+0000","up_votes":2,"down_votes":0,"body":"Che hai contro chi usa {{champion:99}} & {{champion:21}}  ! \nPS fieramente main {{champion:37}}  & {{champion:40}} ♥","replies":[{"poster":"0oflashpaulo0","date":"2018-10-11T19:00:43.359+0000","up_votes":1,"down_votes":1,"body":"Janna niente da dire. Gli altri 3 mi fanno ridere. Veigar è annie non li hai? :) \nDirei che chiunque è main lux o sona. \n\nIo sono fieramente main zed ekko yasuo shen karma vayne tresh Rengar ecc. Un po' più complicati dei tuoi, con questi non basta premere r. ","replies":[{"poster":"Ringiel","date":"2018-10-12T07:57:47.016+0000","up_votes":1,"down_votes":0,"body":">Janna niente da dire. Gli altri 3 mi fanno ridere. Veigar è annie non li hai? :)\nDirei che chiunque è main lux o sona.\nIo sono fieramente main zed ekko yasuo shen karma vayne tresh Rengar ecc. Un po' più complicati dei tuoi, con questi non basta premere r.\n\nbronze confirmed ... che poi ritieni janna un champ complicato? ok ...","replies":[{"poster":"0oflashpaulo0","date":"2018-10-12T10:59:55.084+0000","up_votes":1,"down_votes":0,"body":"Ritengo janna un campione decente che ha un utilità e non il classico champ che preme r e shotta la gente.","replies":[{"poster":"Ringiel","date":"2018-10-12T11:16:35.114+0000","up_votes":1,"down_votes":1,"body":"janna è il champ per farsi boostare per eccellenza,anche se non sai niente del macro game,ti basta premere E sul tuo carry e R quando viene ingaggiato per arrivare tranquillamente in low plat ... cmq continui a fare discorsi da bronze player (non il classico champ che preme r) e questo dimostra che il plat l'hai solo sognato,salvo che non l'hai fatto giocando support janna e soraka.","replies":[{"poster":"Honey Queen","date":"2018-10-12T13:05:59.841+0000","up_votes":2,"down_votes":0,"body":"Ei ! °-° Basta con il razzismo per le Janna e le Soraka! Q___Q {{sticker:sg-janna}}","replies":[{"poster":"Ringiel","date":"2018-10-12T15:51:47.336+0000","up_votes":2,"down_votes":0,"body":"il mio commento non voleva essere offensivo verso chi maina quei campioni,solo che se uno si vanta di giocare solamente champ con meccaniche difficili,disdegnando i champ \"facili\", e poi tra questi ci aggiunge janna,mi fa triggerare.","replies":[{"poster":"Honey Queen","date":"2018-10-12T15:58:08.887+0000","up_votes":2,"down_votes":0,"body":"Sì, tranquillo ù.ù e che quando ci si impegna con determinati champ e poi mi si dice che salgo perché uso champ ''per farsi boostare'' dopo un totale di 200 game in silver per arrivare al gold V mi si spezza il cuore Q_Q","replies":[]}]}]}]}]}]}]}]},{"poster":"Pellah","date":"2018-10-11T16:45:38.472+0000","up_votes":2,"down_votes":0,"body":"Sono leggermente D2 con Peak a D1, mai fatto DuoQ sta season perché preferisco rankare da solo.\n\n\"Mi dispiace ma quelli non li gioco (garen darius lux brand annie MF yi jax ecc ecc!)\" (Vedo che però nella tua ranked ci hai provato a giocare Yi e non ti è andata per nulla bene, che forse non sia il champ il punto? :O )\n\nPer quanto mi riguarda, quando il mio smurf stava a Gold 2 per scommessa ho fatto 2 game con Janna AD top ed ho vinto lane e game, finché sei più forte puoi giocare quello che vuoi e più si abbassa l'elo e più diventa facile farlo (vedi Fierik che smurfa a Silver vincendo i game con build troll etc).\n\nE qui potrei uscirmene anche io con un commento sarcastico del calibro \"Sei il solito silver stuck che da la colpa al team? Classico\", ma non me ne frega nulla di averla vinta, se ho deciso di mettere un po' del mio tempo in questi messaggi è perché speravo di poterti aiutare. Ti basta cambiare mentalità e cominciare ad allenarti, vedrai che anche tu migliorerai e, di conseguenza, salirai.\n\n\nSecondo te a che elo apparterresti e quali sono i tuoi errori principali? Magari scambiando due parole riesco a trovare qualcosa che possa farti cambiare idea ^^","replies":[{"poster":"0oflashpaulo0","date":"2018-10-11T18:50:40.152+0000","up_votes":1,"down_votes":1,"body":"Se guardi i champ che prendo vedi che non uso i campioni sopra citati. Ieri ho preso yi perché mi ero francamente stancato di trovare gente scarsa che mi fa perdere, perciò ho detto per una volta prendo anche io il champ nobbo che al limite provo a vincere da solo. nella partita di ieri ho staratto 2 0 con yi, peccato che in 10 minuti kassadin mid era 0 6 fiddando sia irelia sia kha zix e la bot era con kai sa 1 5 fiddando l adc avversario. Poi man mano che si andava avanti con kha zix 11 0 e l adc avversario fiddato non si poteva più fare nulla, ma non ho sbagliato io. Infatti io in questi livelli cerco sempre di Prendere campioni utili al team come shen poppy karma gp ecc... Perché preferisco essere io ad aiutare gli altri piuttosto cHe il contrario, proprio perche trovo solo dei nobbi.\nSinceramente dopo essere arrivato a plat 2 e dopo 5 anni e passa che gioco tutti i campioni non mi ritengo inferiore sicuramente a nessun plat 5 o 4 soprattutto per il fatto che arrivare a Gold ora è una cagata rispetto a prima, poi magari mi sbaglio.\n\nQuesto è il mio pensiero che può essere anche sbagliato. Ritengo solo che permettere a certa gente di giocare classificata solo perché hanno  Comprato 16 champ e sono al 30 sia un po una cagata e francamente lo vedo ogni giorno, perché ogni giorno trovo gente veramente scarsa. Purtroppo ad oggi sono solo silver 2 in questo acc. Negli altri non gioco quasi mai rank perché è la sagra dei nobbi e del nervosismo per me.\n\nVorrei farti fare le partite con me e farti vedere la gente scarsa che mediamente trovo 7-8 partite su 10. Gente che pensa che la visone sia inutile, che è meglio essere un supp con kill piuttosto che difendere l adc, gente che trolla, gente che se gli dici di giocare safe ti risponde di non preoccuparti e finisce 0 10 e alla fine ti dice \"è un gioco di merda, ho 1000 account riportami\" ecc ecc\n\nIo trovo questi.\n\nRitego che basterebbe sooo cambiare l. Impostazione delle rank aggiungendo che puoi parteciparvi solo se hai tot champ al livello 5 e che puoi scegliere solo tra quelli, poi magari è un idea di merda. \n\nPoi sono aperto ad altri pensieri e altri punti di vista.","replies":[{"poster":"Pellah","date":"2018-10-12T07:44:50.985+0000","up_votes":2,"down_votes":0,"body":"Chiariamo subito che il silver è una lega bassa, non è che la \"gente scarsa\" la trovi 7-8 partite su 10, ci sta sempre ed in entrambi i team. \n\nMi sono riguardato il game di cui parli ed onestamente oltre la prima kill in bot non hai fatto nulla di davvero utile al team. Inoltre ti lamenti che in dieci minuti kassadin sia andato 0/6, ma tu in quei 10 minuti ti sei fatto uccidere 3 volte completemente a random ed il resto del game lo hai passato andando super aggro quando non potevi, il risultato è stato continuare a morire inutilmente. I tuoi sbagli li hai fatti e ne hai fatti tanti, anche tu hai contribuito a perdere il game come non hai contribuito a vincerlo. Onestamente mi viene davvero difficile credere che tu sia arrivato plat 2, questo game assieme ad una serie di fattori come ad esempio la tua wr e le tue 7.7 morti a partita in silver non mi fanno pensare a nulla di sopra il silver, massima massimo potrebbe essere gold 5, ma foooorse. Io ti consiglio intanto di prenderti 2/3 main invece che di giocare un sacco di campioni pensando di saperli giocare quando ti assicuro che sai molto meno di quello che pensi di sapere.\n\nComunque giocare un game con master Yi non ti basta per capire come funziona e di conseguenza hai perso, anche per salire con i campioni facili bisogna saper giocare, anzi per salire con i campioni facili contano molto di più le meccaniche generali quindi se non hai quelle fai poco.\n\n\"Ritego che basterebbe sooo cambiare l. Impostazione delle rank aggiungendo che puoi parteciparvi solo se hai tot champ al livello 5 e che puoi scegliere solo tra quelli, poi magari è un idea di merda.\"\n\nE cosa cambierebbe? Avere il livello 5 non significa saper giocare un campione ed inoltre le ranked sono fatte anche per mettersi alla prova, uno che è scarso ha tutto il diritto di cominciare a giocare. Anche perché un giocatore che ha assimilato per bene tutte le meccaniche di base arriva a D4, quindi che facciamo? tutti quello sotto il D4 non possono giocare a lol? Ma anche se fosse plat: sotto il plat ci sono giocatori scarsi (Silver-Bronzo) e giocatori che cominciano a capire qualcosa ma non si possono definire bravi, sono ancora sotto la soglia. Non puoi giocare se non sei almeno plat?\n\nTranquillo che se sei più forte dell'elo in cui giochi sali.","replies":[{"poster":"0oflashpaulo0","date":"2018-10-12T11:03:04.286+0000","up_votes":1,"down_votes":1,"body":"Allora le partite che ho giocato ieri se le riguardi dovrei rispecchiare il livello silver. E cmq ciò che facciamo dipende ed è diretta conseguenza di ciò che fanno gli altri.noj vedo come  potevo vincere la partita giocata con yi con mid e adc vergognosi. Se leggi anche la chat vedrai come chiedevo di giocare safe a kassadin e come lui risponde non preoccuparti = 0 10. Quindi va bene. Si vede che sono un silver","replies":[{"poster":"Pellah","date":"2018-10-12T11:35:44.701+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=0oflashpaulo0,realm=EUW,application-id=MJVj50Jw,discussion-id=Up1tppMe,comment-id=000100010001000000000000,timestamp=2018-10-12T11:03:04.286+0000)E cmq ciò che facciamo dipende ed è diretta conseguenza di ciò che fanno gli altri.\n\nMa assolutamente no, un Challenger che gioca in bronzo comincia a giocare da bronzo?\n\nCiò che facciamo è solo ed unicamente una nostra scelta, poi basare le proprio scelte su quelle che succede è un altro conto. Se tu hai una media di 8 morti a partita non è per il team, ti concedo 1/2, massimo 3 morti per game che erano difficilmente evitabili o inevitabili, ma se muori 8 volte in un game 8 volte l'unica persona da incolpare sei solo tu.","replies":[]}]}]}]}]}]}]},{"poster":"BruschettaFelice","date":"2018-10-11T01:35:01.013+0000","up_votes":2,"down_votes":1,"body":"{{summoner:51}} {{item:3070}} {{item:3070}} \n\nSusu tieni un biscottino {{item:2012}}","replies":[]},{"poster":"Linkimaru","date":"2018-10-11T07:34:43.811+0000","up_votes":1,"down_votes":0,"body":"Il support con ignite full dmg non è troll, la gente al liv 30 appena fatto puoi trovarla comunque in entrambi i team e magari alcuni possono essere smurf, in generale in bronzo/silver non esistono proprio scusanti per perdere, si può letteralmente vincere 1vs9 perché la quantità di errori che tutti commettono sono spropositati...","replies":[{"poster":"0oflashpaulo0","date":"2018-10-11T13:54:14.061+0000","up_votes":1,"down_votes":2,"body":"io ho scritto questo perche ho 5 acc e uno di questi è platino 2. ho piu di 6000 vittorie in 5 acc e ho 50 e passa campioni al livello 5 6 e 7 solo nel main account. percio forse non sono cosi scarso e stupido da dire queste cose a caso. so quello che dico e so quello che faccio. poi l account che sto usando e che voglio portare un po in alto è solo silver 2, ma da come potete vedere è attivo da circa 3 anni se non sbaglio, quindi non sono un novellino. \nin relazione al fatto che 1 vs 9 vinci è un po una presa in giro, perchè puoi essere forte quanto vuoi ma quando gli altri del team fiddano i vari jax mastr yi ecc (che non sono campioni) puoi essere anche faker che perdi lo stesso, ma si vede che sto parlando con gente che è molto piu brava di me e che probabilmente trova solo gente capace in team con loro, percio bravi ;).","replies":[{"poster":"Dantazzo","date":"2018-10-11T14:11:12.847+0000","up_votes":1,"down_votes":0,"body":"Account \"smurf\"  attivo da 3 anni, silver 2. \nNon so manco che aggiungere è già triste così, la parte dove dici che hai 6000 vittorie e 50 champ a maestria salcazzo aggrava solo la tua nubbaggine.","replies":[{"poster":"0oflashpaulo0","date":"2018-10-11T14:37:09.116+0000","up_votes":1,"down_votes":0,"body":"Se non vuoi capire e vuoi solo sparare cagate fallo pure, non c'è problema. Come Ho Già scritto questo è quello che sto usando ora.  Vuoi vedere il più vecchio? Quello dove ho iniziato e dove gioco ogni tanto e praticamente mai in classificata? Flashpaul\nOppure c'è spalshcurry che è permea bann. \n\nTranquillo che a differenza tua le cagate non le sparo.\n\nSto solo facendo delle considerazioni e vedere se c'è qulcunaltro che la pensa come me oppure se tutti la pensano come te e allora sono veramente un cane a giocare. ","replies":[]}]}]}]}]}