{"poster":"Rob Royal1000","date":"2015-02-13T10:21:01.041+0000","title":"Spielverebindung erst beim zweiten Laden möglich","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hi,\r\n\r\nIch habe gerade versucht ein Ranked zu spielen, dabei ist folgendes Problem aufgetreten. Während des Ladebildschirms hatte ich einen Ping ~370. Das Spiel lud und der Ping blieb gleich bis ich nach ca 30 Sekunden einen DC hatte. \r\nDaraufhin nahm ich an, dass es an meinem Internet liegen könnte und habe den Router neugestartet. Jetzt hatte ich ein ähnliches Problem.\r\nIm Ladebildschirm hatte ich einen Ping von ~370. Als ich bei 100 % angelangt bin, bekam ich eine Fehlermeldung ich hätte keine Verbindung zum Internet. Allerdings funktionierte das Internet außerhalb von LoL einwandfrei (Internet Explorer, Skype, ...) . Als ich direkt auf den Reconnect Button gedrückt habe, lief alles wunderbar. \r\nNach ca 15. Minuten wieder ein DC. Ich versuche mich erneut zu verbinden. Der Ping ist wieder ~370 und bei 100% heißt es ich habe keine Internetverbindung. Ich habe wieder direkt Reconnect gedrückt und es lief einwandfrei.\r\nLeider war das gegnerische Team schon an unserem Nexus, was mich League Points und vermutlich 4-9 Reports gekostet hat. Das ist sehr frustrierend, da es offensichtlich nicht an meiner Internetverbindung lag und das Verbinden zunächst nicht klappt aber einmal Reconnect drücken später problemlos.\r\n\r\nGruß\r\nRob\r\n\r\nPS: Ihr solltet mal den Text unter \"Help\" -> \"Technical Feedback\" aktualisieren","replies":[{"poster":"Rikiz","date":"2015-02-14T11:15:30.330+0000","up_votes":1,"down_votes":0,"body":"Hi Rob,\n\nich habe aktuell ähnliche Probleme, zwar deutlich niedrigerer Ping, aber auch das Problem dass ich im Ladebildschirm nicht weiter lade und sich eine Fehlermeldung öffnet, obwohl das Internet eigentlich stabil läuft.\nBin diesbezüglich auch in einem anderen Thread nach einer Lösung am suchen.\nNun zu meiner Frage um mal was rauszufinden:\nBenutzt du zufällig einen Fritzbox 6360 (ggf. Cable Version) und / oder hast als Provider \"UnityMedia\"?\nFalls ja würde das meine aktuelle Vermutung bestätigen, dass es an (vermutlich) der Firmware liegt, die die Menge an Daten evtl. als Problem erkennt.\nZumindest tritt das, oder ein ähnliches Problem, aktuell vermehrt mit der Fritzbox 6360 auf.\n\nBeste Grüße","replies":[]}]}