{"poster":"wilboshh","date":"2015-12-02T13:21:02.608+0000","title":"Bello il racconto figurato su Poppy, ma...........","subforum":"Discussioni generali","up_votes":7,"down_votes":4,"body":"sul serio , mi piacciono un sacco sti racconti stile manga, ne facessero di pi&ugrave; o qualcuno pi&ugrave; lungo stile fumetto sarebbe veramente na figata, pero......quindi.....\r\nPoppy &egrave; un emerita idiota?\r\ncio&egrave;, cerca il vero eroe di Demacia, che riesca ad usare a dovere il martello di cui lei &egrave; la custode, \r\nsconfigge mostri terrificanti con il suddetto martello, che nessun altro &egrave; riuscito ad usare con successo fino ad adesso a parte lei.....\r\ne continua a perdere tempo e sprecare la sua vita in cerca di questo eroe che non esiste, \r\ncio&egrave; ancora peggio, &egrave; lei e proprio lei non se ne accorge? \r\nma andiamo svejate e non sprecare cosi la tua vita Poppy, inizia a fare qualcosa di veramente utile che in giro per il regno c&#039;&egrave; gente che muore sventrata da Baroni Nashor o sgozzati da ninja assassini, e tu li che girovaghi per i paeselli futilmente.","replies":[{"poster":"A Yordle ln Heat","date":"2015-12-02T13:33:21.018+0000","up_votes":6,"down_votes":0,"body":"Il viaggio non è inutile e non è uno spreco; finirà quando si accorgerà di essere lei stessa l'eroe che cerca.","replies":[{"poster":"Nibbio Bianco","date":"2015-12-02T13:59:09.157+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=CommonDotaPlayer,realm=EUW,application-id=MJVj50Jw,discussion-id=gE5MbZZq,comment-id=0001,timestamp=2015-12-02T13:33:21.018+0000)\n>\n> Il viaggio non è inutile e non è uno spreco; finirà quando si accorgerà di essere lei stessa l'eroe che cerca.\n\n\"Avendo visitato tutta Runeterra senza aver trovato l'eroe che cercava, Poppy si rende definitivamente conto che... l'eroe deve per forza trovarsi nello spazio! Astro-Poppy confurmd\"","replies":[{"poster":"A Yordle ln Heat","date":"2015-12-02T14:14:05.656+0000","up_votes":2,"down_votes":0,"body":"Sarei pronto a comprarmi una skin simile.","replies":[{"poster":"Keìron","date":"2015-12-02T16:12:11.377+0000","up_votes":2,"down_votes":0,"body":"con la ulti ti manda nello spazio stile team rocket di pokemon.","replies":[{"poster":"AcQuAmAn1","date":"2015-12-02T23:00:54.426+0000","up_votes":1,"down_votes":0,"body":"potrebbe dire in game \"preparati a partire alla velocita della luce\"","replies":[]}]}]},{"poster":"Lee Pugno Divino","date":"2015-12-02T14:11:08.629+0000","up_votes":2,"down_votes":0,"body":"Dopo aver visitato lo spazio senza aver trovato l'erore che cercava, Poppy si rende conto che...\nl'eroe deve trovarsi in altra dimensione spazio tempo\nSteins Gate Traveler Poppy","replies":[{"poster":"SennaFirstPick","date":"2015-12-02T14:27:55.135+0000","up_votes":1,"down_votes":0,"body":"arcane shift poppy, però quello che va nell'altra dimensione è chi si becca il martellone","replies":[]}]}]}]},{"poster":"IrrationalNumber","date":"2015-12-02T14:17:25.441+0000","up_votes":7,"down_votes":0,"body":"E' l'eroe inconsapevole di esserlo. E durante la sua ricerca aiuta altre persone. Umilta', forza, coraggio, ingenuita'. Non capisco, siete cresciuti a pane e dragonball con un eroe rincoglionito, adesso poppy non puo' essere un po' fessacchiotta?","replies":[]},{"poster":"kirchhoff","date":"2015-12-02T15:42:51.507+0000","up_votes":5,"down_votes":0,"body":"https://it.wikipedia.org/wiki/Sindrome_dell'impostore","replies":[{"poster":"Firenheit","date":"2015-12-02T20:20:38.569+0000","up_votes":2,"down_votes":1,"body":"+1","replies":[]}]},{"poster":"LionHeartV","date":"2015-12-02T21:04:26.619+0000","up_votes":3,"down_votes":0,"body":"Taric usa un martello, quando lo reworkeranno diventerà lui il prescelto? {{champion:44}}","replies":[{"poster":"Oinegue","date":"2015-12-02T21:08:10.178+0000","up_votes":2,"down_votes":0,"body":"Probabile, e a poppy daranno una padella.","replies":[{"poster":"LionHeartV","date":"2015-12-02T21:15:05.403+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Oinegue,realm=EUW,application-id=MJVj50Jw,discussion-id=gE5MbZZq,comment-id=00090000,timestamp=2015-12-02T21:08:10.178+0000)\n>\n> Probabile, e a poppy daranno una padella.\n\nse sono quelle di Giorgio Mastrota diventa OP","replies":[]}]}]},{"poster":"SKFF1R SubZero","date":"2015-12-02T15:28:30.006+0000","up_votes":3,"down_votes":0,"body":"> ma andiamo svejate e non sprecare cosi la tua vita Poppy, inizia a fare qualcosa di veramente utile che in giro per il regno c'è gente che muore sventrata da Baroni Nashor o sgozzati da ninja assassini, e tu li che girovaghi per i paeselli futilmente.\n\nMa è proprio grazie alla \"scusa letteraria\" della ricerca dell'eroe che lei viaggia attraverso Runeterra salvando la popolazione e diventando così l'eroe che lei va cercando! \nDiamine, è umile e magari stupida che non lo realizza immediatamente ma STA RENDENDOSI UTILE, a differenza di ciò che dici :D","replies":[]},{"poster":"MasterKeaton98","date":"2015-12-02T15:20:20.630+0000","up_votes":3,"down_votes":0,"body":"In realtà il vero eroe è {{champion:6}}.\n\nIl racconto serve solo come introduzione fin quando non prenderà il martello ed incomincerà a spaccare i culi alla gente che dice che non è forte.","replies":[]},{"poster":"LuinilFanon","date":"2015-12-02T14:13:16.405+0000","up_votes":2,"down_votes":0,"body":"Mi è piaciuto molto questo racconto e sinceramente è quello che facciamo in molti nella vita di tutti i giorni...veramente bravi :)!","replies":[]},{"poster":"rahinor","date":"2015-12-02T14:37:24.643+0000","up_votes":2,"down_votes":1,"body":"A me è proprio questo che non piace,o dovrebbero fare in modo che se ne renda conto che è lei (ci vorrebbe il solito vecchio saggio che glielo dica) oppure (seconda opzione più fantasiosa) fanno apparire il \"vero eroe \" di Demacia che magari la salva anche però che appare come un vecchio avvolto in un mantello, una roba del genere , poi si toglie il mantello e si scopre che è il solito veterano pompato ecc ma non il tipico eroe figo in armatura come quello del fumetto per intenderci.....","replies":[]},{"poster":"ForFockSake","date":"2015-12-03T12:02:48.063+0000","up_votes":1,"down_votes":0,"body":"Guarda che non tutti nella vita pensano di essere più di quello che sono( tutti i \"pro\" player in silver /bronzo),o semplicemente si rendono conto di quello che sono..molti invece si sottovlutano, pensano di essere meno degli altri, poppy rappresenta quella categoria,  ha pure un nome scentifico questo modo di essere,  ma non me lo ricordo...\n\nIn sintesi non é questione di stupidità, ma é un problema di scarsa autostima, secondo me é molto bello come messaggio","replies":[]},{"poster":"GragasTheCatfish","date":"2015-12-03T10:36:57.919+0000","up_votes":1,"down_votes":0,"body":"spigatemi una cosa perché stavano smantellando il blu buff???","replies":[]},{"poster":"SideshowEMS","date":"2015-12-02T20:55:04.040+0000","up_votes":1,"down_votes":0,"body":"Quando si punta sulla storia del \" prescelto \" ecc ecc, è sempre un rischio che si corre. Ma qui hanno esagerato ! \nSe dopo aver buttato giù un coso grande come una casa, ancora continui a cercare qualcun'altro non c'è umiltà che tenga, sei rincoglionita.","replies":[]},{"poster":"Aramanthis","date":"2015-12-02T13:31:11.259+0000","up_votes":1,"down_votes":5,"body":"in effetti sembra la classica persona che si è rotta le balle di fare ciò che fa e vuole fare la scarica barile :/","replies":[]}]}