{"poster":"Valentino Vals","date":"2018-03-09T16:44:29.786+0000","title":"En qué época está situado league of legends?","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Hola, quer&iacute;a saber en qu&eacute; &eacute;poca est&aacute; league of legends tiene a&ntilde;o? Est&aacute; en la actualidad? Osea el mundo dentro del juego digamos.\r\nGraciass","replies":[{"poster":"Rick Silence","date":"2018-03-09T16:50:28.484+0000","up_votes":4,"down_votes":3,"body":"Pantheon es de la época de la Grecia clásica. Garen es casi medieval, Flora es renacentista, Ashe también podría ser medieval. Pero Tristana tendría que ser siglo veinte como mínimo, Caitlyn y Jinx son contemporáneas. Warwick o ekko son futuristas. Eso solo teniendo en cuenta las armas que usan. Así que dudo que se lo pueda ubicar en un momento histórico real.\n(Leí mal el título, pero, la verdad, es interesante considerar lo que comenté, así que no lo voy a borrar)","replies":[{"poster":"Warwiick","date":"2018-03-09T17:04:47.076+0000","up_votes":4,"down_votes":0,"body":"Estan todos en la misma era solo que hay regiones con mas evolución que la otra asi como piltover y zaun son mas desarrolladas en tecnologia","replies":[{"poster":"Rick Silence","date":"2018-03-09T17:38:22.493+0000","up_votes":3,"down_votes":4,"body":"Pero en ese caso, Demacia no debería ser un reino poderoso. Piltover podría dominar el mundo. O sea, qué pueden hacer un escudo y una espada contra tan buenas armas de fuego? Si la historia tuviera lógica, ¿Por qué Noxus, que ama la fuerza bruta, jamás se interesó por adquirir la tecnología que aplastaría a Demacia? No sé, en cuanto a verosimilitud me parece que hay muchos huecos, si lo pensás bien.","replies":[{"poster":"KR9 Sweetlight","date":"2018-03-10T01:18:03.805+0000","up_votes":1,"down_votes":0,"body":"Es porque League of legends tiene potencial para expandirse de mil maneras y un Lore que sería muy interesante ampliar, pero a Riot no le interesa nada más que vender skins, se duerme en sus laureles y no tiene visión.","replies":[]}]}]}]}]}