{"poster":"Adam Vodkynsky","date":"2018-05-10T17:24:36.333+0000","title":"Sinergie bot","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Quali sono le migliori combinazioni adc+support? Quelle che funzionano perfettamente e sono migliori rispetto ad altre? Io credo di avere trovato solamente Shen+Lucian e Sona+Varus","replies":[{"poster":"FireM1nd","date":"2018-05-11T00:21:30.472+0000","up_votes":2,"down_votes":0,"body":"In realtà credo dipenda molto più dai giocatori che non da \"wombo combo\" magiche.   Semplicemente esistono coppie che non si incastrano manco pregando in turco.\n\nL'unica coppia che mi sento di menzionare sono xayah-rakan,  ma è per lo più dovuto al fatto che sono stati progettati assieme, e quindi.. \n\nPer il resto, basta guardare cosa fa un support e cosa fa un adc per scegliere le coppie. Zyra-jhin  worka bene tanto quanto Sona-jhin.  Il motivo, entrambi i support riescono a mettere i segnalini sulla Bot avversaria e permettono a jhin di avere spazio giocando aggressivi. Zyra tramite piante e Sona perché le sue cavolo di spell non solo danno buff ad area ma sono pure al 50% autoaim,  quindi basta avvicinarsi e premere Q.\n\nE lo dico perché avendo più di 200k punti su di lei, so quanto possa essere a prova di asilo (ha pure i colori per aiutarti..)\n\nE questo è quanto. Un esempio di quello che ho detto circa l'inesistenza delle wombo-combo? Una volta mi trovai davanti ad una jinx-blitz. Io ero una Sona con mf al seguito. Loro erano bene assortiti. Un attimo di disattenzione, una W di jinx,  un grab+E di blitz e poi jinx avrebbe dovuto chiudermi ogni via di fuga con le granate. Noi, in pratica, l'unica cosa dei kit che si incastrava un minimo erano le ulti (io ulto,  mf ulta; per il resto, tutto normale).\n\nAd un certo punto, mi malposiziono e finisco scoperto. Ed ecco che parte l'attacco da parte loro. Solo che..\n\nJinx preme prima la E della W, ma non riesce a mettere le granate davanti a me, grazie alla mia E. Quindi blitz prova a recuperare la situazione di grab. Mi grabba.  Ma tanto è nulla di fatto perché mi intercettano le granate di jinx poco indietro e io rimango fermo quasi sul posto. \n\nCome finì?  Aspettai gli 1.5 secondi e poi li ultai. A causa della situazione erano diventati loro ad essere quelli scoperti.  Mf ulto' poi  di seguito, e noi ci portammo a casa una doppia. Ecco: una combinazione che doveva farci il culo si è rivelata un disastro causa scelte dei giocatori, nonché della loro gestione della situazione. \n\nSe sei un support,  il tuo compito primario è cercare di capire cosa occorre al tuo adc che tu faccia per metterlo in condizioni di piazzare un po di danno sulla Bot avversaria. Un esempio? Xayah-Nasus.\n\nNo, sono serio. Chiunque sottovaluti xayah-nasus sottovaluta lo slow del doge.  E non è mai stata una mossa da furbi. Il bello di questa lane è che comunque,  se si invertono le priorità di nasus,  può dare un peel non indifferente: ha uno slow, ha un buon poke,   e soprattutto,  fa calare di brutto l'armor.  Essere slowati da nasus,  roottati da xayah e poi uccisi dopo altri 2 aa al livello 2 da quest'ultima ti fa ricredere parecchio su questa combinazione.  Oltretutto,  nasus può farsi tranquillamente tank e al tempo stesso staccare. Tanto, il farm arriva comunque all'adc. Questa strana coppia funziona perché il \"support\" permette all'adc di fare comunque il suo lavoro: gli dà utility,  pokka,  e può, se sottovalutato,  essere una spina nel fianco considerevole.","replies":[]},{"poster":"Myþhz","date":"2018-05-10T17:42:41.467+0000","up_votes":2,"down_votes":0,"body":"Caitlyn + Morgana, Twitch + Alistar, Kog'Maw + Lulu, Lucian + Thresh","replies":[{"poster":"Adam Vodkynsky","date":"2018-05-10T19:17:42.687+0000","up_votes":1,"down_votes":1,"body":"Lucian Tresh è ironico per la lore","replies":[]}]},{"poster":"SUN Void ","date":"2018-05-11T06:16:54.447+0000","up_votes":1,"down_votes":0,"body":"{{champion:145}} +{{champion:201}}  {{champion:63}} +{{champion:236}}","replies":[]},{"poster":"Hikayaler","date":"2018-05-10T20:28:48.461+0000","up_votes":0,"down_votes":1,"body":"***","replies":[{"poster":"Aurelion Shmoll","date":"2018-05-10T23:44:54.100+0000","up_votes":1,"down_votes":0,"body":"Ma in base a cosa ragioni? Sono molto, ma molto confuso.","replies":[]}]},{"poster":"Bss Nikko","date":"2018-05-10T21:32:25.180+0000","up_votes":1,"down_votes":0,"body":"Braun Lucian ha una laning phase op, le passive hanno una sinergia enorme anche morgana mf è molto forte tralasciando binding e ulti di morgana che sono fortissime con la ulti di mf, se morgana early prende 2 punti di w e la usa sui caster i minion vengono oneshottati dalla q di mf che costringe gli avversari a non stare dietro, di conseguenza ad essere vulnerabili alla q di morgana a me piace molto questa coppia","replies":[]},{"poster":"Tacchino Robot","date":"2018-05-10T18:26:47.617+0000","up_votes":1,"down_votes":0,"body":"Io personalmente mi trovo molto bene a giocare Nami con Draven e Zilean con Twitch","replies":[{"poster":"The Crusherp","date":"2018-05-10T20:15:18.945+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-lulu}}  sono piuttosto strane..","replies":[]}]},{"poster":"Mh012","date":"2018-05-10T17:32:35.301+0000","up_votes":2,"down_votes":2,"body":"Morgana+Jhin, Leona+Lucian, Rakan+Xayah","replies":[]}]}