{"poster":"Matrix7565","date":"2016-01-08T18:31:19.623+0000","title":"Que es lo mas chistoso que les a pasado jugando?","subforum":"Charlas Generales","up_votes":11,"down_votes":2,"body":"bueno esto es para que nos libremos un rato de los trolls y los ni&ntilde;os gg izi , para que nos peguemos unas risas.\r\n\r\nA mi  me paso que no me conectaba una partida y dije bah me salgo a los 30 min entre denuevo al lol y seguia la partida puse reconectar y justo termino y gano mi equipo gane 214 pi con la mejora del dia y me dieron compa&ntilde;erismo de sarcasmo{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Riot Maggical","date":"2016-01-08T19:51:59.096+0000","up_votes":37,"down_votes":0,"body":"Los más chistoso es que la gente cree que por trabajar en Riot somos jugadores profesionales y cuando tenemos una mala partida, o una horrible, me reportan porque _\"No eres Rioter, sos muy malo\"_, jajajajajaja...","replies":[{"poster":"MaquiBoW","date":"2016-01-09T03:50:30.626+0000","up_votes":2,"down_votes":0,"body":"Vi un Rioter que con {{champion:67}}  salio 7/21 :V\ny no estoy jodiendo eh...","replies":[]},{"poster":"Tyrr Judicator","date":"2016-01-09T21:52:32.760+0000","up_votes":1,"down_votes":0,"body":"jaajaj nunca me cruce a un rioter, quisiera saber si hay alguno den LAS mas o menos por mis ligas quizás algún día pueda jugar con alguno \npd: reporta2 por no hacerte respetar :p","replies":[]},{"poster":"Fristay4","date":"2016-01-09T07:33:09.958+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Maggical,realm=LAS,application-id=v7qsfXsE,discussion-id=3GEkaeEy,comment-id=0005,timestamp=2016-01-08T19:51:59.096+0000)\n>\n> Los más chistoso es que la gente cree que por trabajar en Riot somos jugadores profesionales y cuando tenemos una mala partida, o una horrible, me reportan porque _\"No eres Rioter, sos muy malo\"_, jajajajajaja...\n\nJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJA ahí entra tu poder como Rioter y les baneaste la cuenta (?.  Faker es considerado el mejor jugador del mundo. Y varias veces lo vi hacer cosas de bronces. En una trato de hacerse los pajaros de jg a lvl 1 y murió. en el server de korea. Fue muy gracioso.","replies":[]},{"poster":"SenpaiDeathx","date":"2016-01-09T03:53:26.582+0000","up_votes":1,"down_votes":0,"body":"gg maggical incarreable xD","replies":[]},{"poster":"Matrix7565","date":"2016-01-09T00:28:24.655+0000","up_votes":1,"down_votes":0,"body":"que honor un rioter  esta en mi post :D {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"SL Forget","date":"2016-01-08T18:37:15.634+0000","up_votes":5,"down_votes":0,"body":"Una ranked, todo el equipo enemigo desconectado. Lo más gracioso fue que algunos murieron tratando de tirar torres jajajaja","replies":[]},{"poster":"BlasterCross","date":"2016-01-09T12:19:08.563+0000","up_votes":3,"down_votes":0,"body":"Nunca les paso el bug de lee o tristana q te metian el ulti y te lansavan de bot a top lo mas chistoso ( era sona taba de sup ) es q el top enemigo era un temmo y cai justo donde ahora ta el heraldo en eso  ago regreso a base cuando aparese el cangrejo  del rio el cual camina x al lado mio y hace explotar un hongo de temo el cual me mata ....... fue epico ........","replies":[]},{"poster":"TGGX Goldenx","date":"2016-01-09T06:15:36.815+0000","up_votes":3,"down_votes":0,"body":"Cuando quede ebrio y seguía la kill como loco y yo me reía a cada rato, y me quede dormido en medio de la partida y al despertar me conecto al lol veo que gane la partida, después veo los datos,builds,etc y veo un cuadra y gane hahaha no se como pero creo de que cuando estoy muy borracho tengo manos pero no me acuerdo si es que llegué a flamear en algún momento.\n\nSalu2!","replies":[]},{"poster":"GatóMonstruo","date":"2016-01-09T02:40:32.731+0000","up_votes":3,"down_votes":0,"body":"Hice un premade con un amigo y un pibe más. En el medio de la partida, entre preguntas varias, caí en cuenta que ése pibe -el 3ro en discordia- era un chaboncito que yo conocía de antemano, que lo había visto en persona, que había estado ebrio con él (Salíamos al mismo boliche) y que en varias oportunidades chapé con él. No sé, fue muy loco.","replies":[]},{"poster":"Navaldeus","date":"2016-01-09T02:38:02.115+0000","up_votes":3,"down_votes":0,"body":"{{champion:267}} Oh mira. Una LeBlanc casi muerta (~200 - 300HP). De seguro la voy a matar y salir vivo, estoy con toda mi vida.\nResultado: terminé hecho sushi pero muerto de risa.","replies":[]},{"poster":"MateG","date":"2016-01-08T21:43:53.595+0000","up_votes":3,"down_votes":0,"body":"Estábamos en una normal con amigos y de repente vimos que en el team enemigo estaban todos desconectados. Algunos morimos por intentar torres o boludeando. La cosa es que el final de la partida reporte todos los rivales, entonces de repente se conecta Jarvan (enemigo) y resulta que, por lo que el nos dijo, se le había ido la luz al ciber donde estaban los 5 xD","replies":[{"poster":"Fetgod","date":"2016-01-09T22:57:26.948+0000","up_votes":1,"down_votes":0,"body":"JAJAJAJJA\nq mala suerte hay que tener xD","replies":[]}]},{"poster":"II Thanatos II","date":"2016-01-09T07:55:34.508+0000","up_votes":4,"down_votes":1,"body":"Una ranked con un team muy bueno y amable, ganabamos 20- 2 una stompeada en toda regla, uno del team tiro el tipico surrender por hacer la broma pero sucedio que nosotros 4 apretamos aceptar al mismo tiempo, gg para el equipo enemigo y perdimos por retrasados pero fue bastante chistoso.\n\n\nOtra sin querer pase a lanzar el ulti de malphite y sorpresa mate al teemo enemigo que estaba invisible justo en el lugar que lo lanze. xD","replies":[]},{"poster":"lPikachu","date":"2016-01-10T02:27:12.306+0000","up_votes":2,"down_votes":0,"body":"Lanzar una R de Fizz mal y que justo asesine a un teemo invisible no tiene precio XDD\n\n{{champion:105}} {{champion:17}}","replies":[]},{"poster":"Sherpard","date":"2016-01-09T18:17:00.766+0000","up_votes":2,"down_votes":0,"body":"Un Aram que en mi team toco Voli, Thresh, Blitz, Singed y Lee, no hay  mucho que explicar, si el thresh o blitz agarraban a uno terminaba en nuestra base.","replies":[]},{"poster":"DreadSentry","date":"2016-01-09T15:33:52.367+0000","up_votes":2,"down_votes":0,"body":"En una partida con unos amigos, yo iba Gragas support. Del otro lado había un Gragas mid. En un momento, el Gragas entra en nuetra base para matar a alguien creo, quedando con poca vida atrás de nuestra torre. Esto era antes de que implementaran las puertas de base.\n\nYo me acerco por fuera hacia la pared, y él hace lo mismo desde adentro. Mi equipo se acerca atrás suyo.\n\nEntonces tiramos la E los dos al mismo tiempo y todo el mundo ve a los gordos cambiar de lugar por la pared.\n\nEstaba en llamada con mi equipo y nos estuvimos riendo por un buen rato de eso. La verdad que dió risa ver a los dos Gragas re duros tirando el panzaso por la pared.","replies":[]},{"poster":"SantiQ432","date":"2016-01-09T02:03:53.306+0000","up_votes":2,"down_votes":0,"body":"No sé si divertido...pero tal vez frustrante. Esto pasó hace tiempo. Cuándo el rework de Sion salió y pasaron un meses. Sion es mi campeón favorito tengo una meta con él y es el día que tenga un PC decente para jugar (1gb de ram y una tarjeta gráfica Nvidia 8400 GS pls y con eso me va a 30 fps)  ser el mejor Sion del Mundo, un poco ambicioso y difícil de concretar ya que este juego me tiene un poco aburrido, pero sin huevos no hay gloria o era agall...bah olvídenlo. Al grano, estaba mi primo quedándose con nosotros mientra esperaba su turno para jugar y en eso un poco más  sobre el MID-GAME mi primo ve una oportunidad, los 5 del equipo enemigo (Zed,Irelia,Thresh,Caitlyn y Udyr) fueron al mid a matar un Viktor fedeadísimo. Tan fedeado que les dejo media vida a todos.\n\nMi primo dice -ULTEA ULTEA! ULTEA BOLUDO!. Le hago caso y empiezo a cargar, ese sonido como si del mismo Inframundo emergía de repente, se dieron cuenta tarde porque golpeé a los 5, parecía un sueño, ese sueño húmedo que todo Sion Player desearía senitr, golpear a los 5 con poca vida, cuándo estaba por cargar la Q al completo y ver una PentaKill izi, mi primera en la Grieta del Invocador. Pasó algo que hasta día de hoy me dan ganas de matar a mi primo. El desgraciado,hijo de p...TROPIEZA CON EL CABLE DE LA PC Y LA APAGA POR TAN SOLO CARGAR SU CELULAR DE M....\n\nMe quedé en blanco,mi primo se reía mientras conectaba de nuevo el PC. Tenía ganas de molerlo a golpes. Cuándo vuelvo a la realidad le digo - Che pelotudo, voy a dormir no me rompas las pelotas. No se me ocurrió otra cosa porque no sabía si reír o llorar. En fin era para tan solo desahogarme :c\n{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"Fetgod","date":"2016-01-09T22:59:25.029+0000","up_votes":1,"down_votes":0,"body":"Es mas triste que la historia del celular que se callo al inodoro ;c\n{{sticker:zombie-nunu-tears}}","replies":[{"poster":"nahuelrami","date":"2016-01-10T12:54:34.509+0000","up_votes":1,"down_votes":0,"body":"Te comprendo, yo solo queria cagar con entretenimiento, TENIA DIARREA CARAJO.\n{{sticker:zombie-nunu-tears}} {{sticker:zombie-nunu-tears}}","replies":[]}]}]},{"poster":"Furi Shurtugal ","date":"2016-01-09T00:58:05.512+0000","up_votes":2,"down_votes":0,"body":"Podria ser lo mas chistoso y lo mas vergonsoso al mismo tiempo, una vez con mi {{champion:102}} estaba en TOP,  la zona estaba plagada de setas de nuestro {{champion:17}}, y de repente una {{champion:99}}  y un {{champion:5}}  salvajes aparecieron , lo que hice fue lo que haria cualquiera, me hice el que me matarian y los lleve a cada seta que habia en la linea, los mate... pero la doble se la llevo {{champion:17}} que estaba en la otra punta y quedo como... -Como me lleve una doble? :V.","replies":[{"poster":"Fetgod","date":"2016-01-09T23:00:19.985+0000","up_votes":1,"down_votes":0,"body":"Hijo mio,cuando tengas a un{{champion:17}} en tu equipo ponte a rezar y a traer la cruz =V para q no te haga ks","replies":[]}]},{"poster":"lordeman10","date":"2016-01-08T19:56:56.443+0000","up_votes":2,"down_votes":1,"body":"a mi me ganaron los bot\n\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/iELpR2fU-me-ganaron-los-bot","replies":[]},{"poster":"Yitán","date":"2016-01-09T10:21:48.821+0000","up_votes":1,"down_votes":0,"body":"una pregunta, eras arhi??\nde ser asi te pegue la carreada de tu vida en esa partida, jajajaja","replies":[{"poster":"Matrix7565","date":"2016-01-11T04:07:34.509+0000","up_votes":1,"down_votes":0,"body":"me hablas a mi papu?{{sticker:slayer-jinx-catface}}","replies":[]}]},{"poster":"nahuelrami","date":"2016-01-10T13:15:07.324+0000","up_votes":1,"down_votes":0,"body":"Lo mas chistoso creo que fue cuando estaba con el viejo sion en una  cuenta secundaria (por que la principal me la banearon 1 dia por los cortes de luz¬¬) y que en una mala jugada murieron mi adc mid y jg a eso el equipo enemigo remataba con tratar de sacar  baron en lo que acudimos ahi una soraka y yo a ver que salia.\nTotal que todos(menus su adc) se giran a pegarme ignorando a soraka que la poca vida que me bajaban(full robo de vida yo obviamente) me curaba soraka y me hago un cuadra muy rapido gracias a la cantidad de ad y el daño en area de la hidra y vayne quedo sola contra el baron y tratando de escapar tira mal un flash y se come el muro de el baron pit dandome el tiempo justo para tirarle el stun antes de que se muera y llevarme el baron que le quedaba poca vida  me rei tanto que entre que me movia y demas patee un cable y desconecte la pc, perdida Y_Y.","replies":[]},{"poster":"Galiers","date":"2016-01-09T15:54:03.329+0000","up_votes":1,"down_votes":0,"body":"acá pille un video de lo que me paso \n\nhttps://www.youtube.com/watch?v=aYlwpu1v6lY","replies":[{"poster":"teh real gamer","date":"2016-01-10T00:54:51.567+0000","up_votes":1,"down_votes":0,"body":"si no me equivoco fue el señor del trueno  que hace daño en area","replies":[{"poster":"Galiers","date":"2016-01-10T01:20:09.945+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=teh real gamer,realm=LAS,application-id=v7qsfXsE,discussion-id=3GEkaeEy,comment-id=002b0001,timestamp=2016-01-10T00:54:51.567+0000)\n>\n> si no me equivoco fue el señor del trueno  que hace daño en area\n\nsuela logico, pero a mi me paso eso en S2 cuando no estaba dicha maestria","replies":[]}]},{"poster":"Fetgod","date":"2016-01-09T23:03:50.398+0000","up_votes":1,"down_votes":0,"body":"MLG 360 no scope =V\nna mentira","replies":[]}]},{"poster":"Poppy Rising","date":"2016-01-09T09:58:46.596+0000","up_votes":1,"down_votes":0,"body":"Tire una Q de Janna al dragon asi a lo random y aparece robo de dragon fue re wtf, sin vision y sin nada de daño Q lvl 1, fue epico y un cago de risa con lo que decia el team enemigo jaja","replies":[{"poster":"teh real gamer","date":"2016-01-10T00:57:00.701+0000","up_votes":1,"down_votes":0,"body":"ME PASO LO MISMO! \njanna q sin vision al dragon, DRAGON MUERTO. GG","replies":[]}]},{"poster":"yOCobain","date":"2016-01-09T12:27:06.056+0000","up_votes":1,"down_votes":0,"body":"En una ranked íbamos como 43 a 4 se los juro...hicimos todos los dragones el baron rompimos absolutamente toda su base a modo de humillación... llegamos al nexo y quedando 40% hp los 5 nos pusimos de acuerdo y tiramos surrender porque habian 3 en promo a plata en el team enemigo xD\n\n\nEpic... muy buenas personas jajaja","replies":[{"poster":"teh real gamer","date":"2016-01-10T00:55:48.904+0000","up_votes":1,"down_votes":0,"body":"da real mvp","replies":[]}]},{"poster":"Whentz","date":"2016-01-09T09:27:43.104+0000","up_votes":1,"down_votes":0,"body":"Lo más gracioso que me paso a mi y a mi hermano fue que fuimos a un ARAM y cuando comienza la partida los 3 de nuestro team se desconectaron al mismo tiempo y cuando vamos a la torre , vemos al team enemigo que solo estaba Veigar cuestión que fue un 1vs2 (literal) y la partida duro 12 min xD tambien nos paso en una normal con mi hermano en que teniamos a 3 premades en nuestro team y a los 3 (supongo) se les habrá ido la luz ya que quedamos 2vs5 y la partida no duro más de 18 minutos","replies":[]},{"poster":"Galiers","date":"2016-01-09T08:08:00.098+0000","up_votes":1,"down_votes":0,"body":"jugando con caitlyn en una tf me mori, al revivir estaban peleando en baron, fui lo más rapido que pude pero  llegue tarde a esa tf en baron... estaba bastante lejos asi que lo unico que atine fue a tirar el ulti a la maxima distancia al adc que salio en baja vida, era s2 creo cuando el ulti no daba vision extra asi que la bala salio disparada y se perdio de vista cuando puuuum doble kill \n\naun no me explico como fue... y los del equipo enemigo tampoco supieron explicar que paso... al parecer alguien en baja vida se cruzo al ulti quedando ambos, el objetivo y él, usando el mismo espacio...\n\nnunca más pude hacer eso y tampoco lo he visto en algun video...","replies":[]},{"poster":"Pianist Fantasy","date":"2016-01-09T06:30:13.075+0000","up_votes":1,"down_votes":0,"body":"Probar a Yasuo jungla:\nJustamente (no sé como) me toco uno de esos días en los que eres un faker x'D.\nEstaba jugando con Yasuo jungla, todo bien, hasta que me conseguí la cuadra (tenía el espíritu faker) y solo faltaba matar al Nasus que estaba debajo torre y con R.\nAl intentar matarlo bajo torre (ya estaba a punto de morir) vino nuestra salvadora, ¡SORAKA! Me curó casi toda la vida, tuve tiempo para utilizar mi R, y \"¡PAM!\", Pentakill, pobre Nasus, lo maté bajo torre con su R activada x'D.","replies":[]},{"poster":"Dontlookatme","date":"2016-01-09T05:37:55.740+0000","up_votes":1,"down_votes":0,"body":"Tire una Q de {{champion:64}} hacia una {{champion:117}} pero falle.........y golpie a un {{champion:17}} invisible asi bien random , tire la segunda Q, lo ultie, burstie a los dos y salio rico doble","replies":[]},{"poster":"iFailTheSkill","date":"2016-01-09T04:21:29.722+0000","up_votes":1,"down_votes":0,"body":"La primera vez que usé a {{champion:150}} fue cuando salió que me lo insta-compré y en exactamente la primera partida robe el barón a todo el equipo contrario usando una Q con mini Gnar y gané la partida \n{{sticker:slayer-jinx-catface}} ","replies":[]},{"poster":"MaquiBoW","date":"2016-01-09T03:59:18.709+0000","up_votes":1,"down_votes":0,"body":"Nose si es lo mas gracioso que me paso pero fue muuuuuuuuuuuuuuuuy gracioso, estabamos jugando a las escondidas con unos amigos, 2 nos escondiamos y 3 buscaban :V (los que nos escondiamos eramos los 2 lvl 30) y los 3 que buscaban eran lvl 13, 15 y 11, yo iba con {{champion:34}} y mi amigo que tambien se escondia iba con {{champion:223}} los estabamos re boludeando era un cago de risa y en un momento escapamos de suerte tirando el muro de Anivia, la ulti de Tahm, el {{item:3222}} , el {{item:3069}} y la {{item:3142}} y nos escondemos en un bush, de repente uno de los amigos que buscaba dice: LOS ENCONTRE HIJOS DE PUTAAAAA!! (nosotros debiamos tener 300 de vida c/u) y cuando pasa por el bush no nos ve :V :V :V\nFue muuuuy gracioso, pero como dije antes: Nose si es lo mas gracioso que me paso pero fue muuuuuy gracioso\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"alop55555","date":"2016-01-09T03:38:24.987+0000","up_votes":1,"down_votes":0,"body":"robé dragon con una ulti de nami a 4 jugadores del otro team incluído su jg y sin alguien de mi equipo cerca {{champion:267}} ","replies":[]},{"poster":"Jaja qlo","date":"2016-01-09T03:19:46.925+0000","up_votes":1,"down_votes":0,"body":"Cando agarre un portal de bardo y me tiro para el otro lado ( era un pared larga y sali como si lo hubiera puesto desde el final hasta el inicio).","replies":[]},{"poster":"Revolución","date":"2016-01-09T02:06:39.045+0000","up_votes":1,"down_votes":0,"body":"Yo no me olvido de uno de los jugadores más flamers que he tenido en mis partidas cuando era nivel 25 creo que en un momento dentro de su ataque de nerviosismo nos inusltaba a todos por \"no aprovechar que Garen no tiene maná\", cuando le expliqué la situación de Garen con el maná no volvió a decir más nada","replies":[]},{"poster":"cajaru977","date":"2016-01-09T01:38:43.816+0000","up_votes":1,"down_votes":0,"body":"En One for All eramos {{champion:64}}  vs {{champion:64}} \ny recuerdo que un enemigo que estaba al lado mio me tiro una Q, y lo patie mi aliado lo pateo  y despues otro aliado lo pateo, despues el lee enemigo se volvio a mi con la Q y derrepente Aliado salvaje aparece, flashea y se lleva la kill.\n\nSe que tal vez no parece gracioso pero en el momento fui muy  epico en ese moment","replies":[]},{"poster":"Pyke dé Limon","date":"2016-01-09T01:34:30.806+0000","up_votes":1,"down_votes":0,"body":"estaba supporteando a un premade con {{champion:432}} y para trolearlo le tire la r \nlo gracioso es que justo venia el jg y ultie a los 3 enemigos y mi amigo se salvo :V","replies":[]},{"poster":"Joey Tribbianî","date":"2016-01-09T01:24:57.654+0000","up_votes":1,"down_votes":0,"body":"En una partida, iba con {{champion:222}} y tiré la w para ver si tenía suerte y pum robé dragón. Yo estaba impakta3, no sabía si gritar o simplemente jugar sin ninguna expresión en mi cara xD. \nEn otra igual, no teníamos visión en Barón, yo con {{champion:103}} , estaba muy enojado por qué uno del equipo rival se andaba creyendo mucho (El Pro y bla bla no gankea el jg) La cosa es que dije: \"Veamos si tengo suerte\" Tire la **Q** Y ¡ME LO ROBÉ! Fue super emocionante, la partida estaba perdida. Con la robada de Barón, la partida la remontamos y fue un \"GG WP\" :D\nSe que no es muy chistoso, pero me divertí en ese momento y quería publicarlo aquí xD","replies":[]},{"poster":"Lion","date":"2016-01-09T01:21:46.889+0000","up_votes":1,"down_votes":0,"body":"El Gromp me a matado al {{summoner:4}} , lo admito y aun así es gracioso","replies":[]}]}