{"poster":"Fadedpf","date":"2015-08-04T19:27:21.405+0000","title":"Can you give us more Info about Shyvana and Olaf changes?","subforum":"Gameplay","up_votes":2,"down_votes":0,"body":"This sounds a little fishy to me. It sounds like Shyvana will probably nerfed and changed and Olaf POSSIBLY buffed. I just want to know what is planned for them and I hope they wont be nerfed badly.\r\n\r\n\r\nAlso huehuehue can have a pet dragon? \r\n\r\nhttp://googlegif.com/wp-content/uploads/2012/08/7ZyYO.gif","replies":[{"poster":"Meddler","date":"2015-08-04T19:44:42.571+0000","up_votes":4,"down_votes":2,"body":"We haven't started work on Shyvana or Olaf yet besides some really rough brainstorming, in part because we want to see how these changes, and the associated item changes, go. Assess what works, what doesn't, where we should have taken things further or pulled back etc.","replies":[{"poster":"The Capn Cook","date":"2015-08-04T20:59:28.086+0000","up_votes":4,"down_votes":0,"body":"Olaf doesn't need any buffs he needs a rework. If someone has any escape abilities, like {{champion:429}} or {{champion:92}}, it seems as though Olaf can't catch up with them even with his ulti, and you have to go way off build to get items that can catch up with the people who have unlimited escape or permakite. I think he could just overall use a rework. Although I do like his passive.","replies":[]},{"poster":"Fadedpf","date":"2015-08-04T19:51:37.873+0000","up_votes":2,"down_votes":0,"body":"Is Shyvana still going to be somewhat of a carry? I assume you might give her some changes because of How Sated and Blade of the Ruined king works on her. Will the changes be more revolving around her kit or what she can do when she buys her core items to make the most of her current kit.","replies":[{"poster":"Meddler","date":"2015-08-04T20:31:03.010+0000","up_votes":4,"down_votes":2,"body":"Can't offer you any details on what changes to her kit might look like, we haven't started talking about that ourselves yet. Would definitely expect her to retain a strong damage focus.","replies":[{"poster":"PapaGreg21","date":"2015-08-04T22:39:53.772+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=QUaHIvNa,comment-id=000000000000,timestamp=2015-08-04T20:31:03.010+0000)\n>\n> Can't offer you any details on what changes to her kit might look like, we haven't started talking about that ourselves yet. Would definitely expect her to retain a strong damage focus.\n\nI am also nervous that Shyvana will get a nerf in that rework because of her perceived boost in power with devourer and when devourer inevitably gets nerfed she will get no compensation buffs and be left worse than before the entire sated devourer change.","replies":[{"poster":"Gixia","date":"2015-08-05T02:17:08.162+0000","up_votes":1,"down_votes":0,"body":"Well, since apparently they haven't even started on Shyv changes yet, that means it's likely a fair ways away still. Meanwhile, if Devourer is going to get nerfed, it's likely gonna get nerfed sooner rather than later. So odds are it'll already have been nerfed before they get around to working on her and her remake won't have to be a nerf as a result.\n\nThat said, as somebody who's mained Shyv since her release, I do still share your concern, even if I hope it's unlikely.","replies":[]}]},{"poster":"The Blue Rajah","date":"2015-08-07T12:49:12.566+0000","up_votes":1,"down_votes":0,"body":"As a Shyvana main, and someone who loves her dearly, could I just offer my opinions?\n\nPlease don't change her kit too much. I love all of her abilities.\n\nFirst off, the animations for Twin Bite and Flame Breath are fantastic. She's got a dragon head on one hand, and the jaw on the other and brings them together for the bit, or puts them together and does a little hadouken so the dragon head is spitting out the fireball. Super cool.\n\nSecond, I love how good attack speed is on her. On-hit builds are really fun, and Shyv is the queen of on-hits, mostly due to her Twin Bite, which is a big part of why I wouldn't want it changed, combined with having a couple on hits in her kit.\n\nBurnout is easily her best skill. It's simple, but super effective, and super important to her identity. AOE is a big part of who she is, and so is magic damage. And it's got the most utility as well. On top of that, it's thematically really fun (\"I'M A BIG FLAMING BALL OF DRAGON BARRELING AT YOU\").\n\nAnd Flame Breath is simply necessary to have a dragon-feeling kit. Dragons breath fire. You can't just get rid of the fire breath from a dragon kit.\n\nThe activation on her ult I love. Figuring out when to use it is one of the biggest decision points in her kit. Should I engage with it? Or save it so I can escape? Use it to clean up? Save it for the knockback so I can interrupt a critical ability like a Katarina ult? Is it worth using in this 1v1 even though it's primarily aoe? Do I need the tankiness? It's one of the reasons she can split-push, a style I enjoy, but I also enjoy that she's in know way locked into split-pushing, she makes an excellent team brawler. And I know it's a slow dash, and easily interruptible, but that is absolutely acceptable for the length of it. Nothing quite like a dragon flying into a skirmish out of the fog of war from a direction you didn't expect.\n\nI also really like that she has strong base stats. I feel it's apropriate. She's a dragon, she should feel powerful.\n\nAnd one of my absolutely favorite things about her is how varied her build paths are. Good damage items on her: Ravenous, BorK, Triforce, Wit's End, Maw, (almost definitely Titanic Hydra). And none of them are required. You can always adapt your build to what the game needs.\n\nNow, that doesn't mean that I think she should never have any changes and everything about her is perfect. Those are just all the things I like (and I like her a lot). But there are a couple things I wouldn't mind seeing changed, such as:\n\nHer passive. I like the extra tankiness, since I think she needs it, but honestly it's very boring. I it never changed, that'd be fine, but if it did change, I wouldn't be sad to see it go. Especially if it got replaced by something particularly cool.\n\nHer ult other than the dash. The changes to her abilities are likewise fairly boring. I do enjoy them, since it's basically just more aoe, and doubling down on strengths is great. (Love getting both ravenous and sunfire, so much aoe!) But really there's no play there. As long as you're aimed at their team, you're doing it right. Again, one of those things that works and makes sense in her kit, but I'm not really attached to.\n\nAlso, I want to say, she's very kiteable. And I'm totally ok with that! She has a lot of strengths, and every champion needs weaknesses. It means you have to be aware of who you're up against, and what abilities they've used yet and pick your battles correctly. She also has a couple tools to work around her weakness, (speed and ult respectively), so she doesn't feel powerless, but by no means do they completely cancel it out.\n\nAnywho, I'm looking at this and thinking wow, this ended up a lot longer than I originally intended. Sorry about that. I just care a lot! If you actually made it all way through the whole thing, thank you so much for reading! I'd love to get in on any conversations about Shyvana (and if they're off in the future, and not happening now, that's cool, that's what you said after all). Just wanted to share my feelings as a player. Thanks again!","replies":[]},{"poster":"Hupsis","date":"2015-08-04T20:37:01.045+0000","up_votes":1,"down_votes":0,"body":"Give her a mighty dragon roar as a second activation on ult.\nThat would be cool x)","replies":[]},{"poster":"Gixia","date":"2015-08-05T01:44:15.191+0000","up_votes":1,"down_votes":0,"body":"The thing I feel makes Shyvana unique in comparison with other fighters, is that the _entirety_ of her kit scales with attack speed, every skill synergises with it in some way, which simultaneously makes on-hit builds better for her than most champs. My main concern whenever I hear about Shyvana getting changes of any kind is that she'll lose this heavy AS/on-hit focus, and I hope that she'll maintain it.","replies":[]}]}]},{"poster":"Necroid","date":"2015-08-05T19:39:09.201+0000","up_votes":1,"down_votes":0,"body":"Then please, go ahead and don't start working on them at all. For the crap you are doing to Skarner, Darius and Garen, better to stay as is.\nSpecial mention to Skarner. Damn whats that?","replies":[]},{"poster":"Dralas","date":"2015-08-05T18:49:00.586+0000","up_votes":1,"down_votes":0,"body":"Hi there! I'm a religious top lane Olaf player so I'm a bit curious. You said so far you're still brainstorming on the Olaf/Shyvana changes. Should we not be expecting anything in this upcoming patch regarding the changes, or will I be able to get my hands on some old school voyboy plays? If you could share any details regarding the changes that'd be great, but I do understand it may mostly still be tentative or just ideas and nothing that's applicable yet so it wouldn't go through. Thanks!","replies":[]},{"poster":"Penguin Eclipse","date":"2015-08-04T20:36:06.598+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=QUaHIvNa,comment-id=0000,timestamp=2015-08-04T19:44:42.571+0000)\n>\n> We haven't started work on Shyvana or Olaf yet besides some really rough brainstorming, in part because we want to see how these changes, and the associated item changes, go. Assess what works, what doesn't, where we should have taken things further or pulled back etc.\n\nPlease remember that tank (cinderhulk) Shyvana is still a thing. Nerfing Shyvana to balance devourer could easily make tank shyvana go extinct.","replies":[]},{"poster":"Anonagon","date":"2015-08-04T20:32:31.606+0000","up_votes":1,"down_votes":0,"body":"I'm just going to ask some general direction things for Shyvana in particular, if you don't mind -\n\nFirst off, do you have any plans to make her less of a... tank? Back at her release, she was billed as almost a melee carry, and honestly I would like to see her return to that sort of form - maybe making her unique niche be that she is a melee carry who does mainly mixed and/or magic damage. Since she is a primarily damage focused champion, I don't really like how she currently exists, where she goes BoRK > Tank, because honestly its not fun to play against and it has such an overlap with people like Nasus - Shyvana in her current state feels like a steamrolling Nasus whose damage really can't be delayed the way Nasus' is.\n\nSecondly, a while back, on the old forums, when discussing Shyvana with CertainlyT, he said two things in particular that interest me. He said that Shyvana would remain damage-focused, and that her ultimate would be change so that, particularly in the lategame, she would be much more of a \"raid-boss\". Does that kind of direction still apply to Shyvana?","replies":[]},{"poster":"vuduchikin","date":"2015-08-04T20:22:27.169+0000","up_votes":1,"down_votes":0,"body":"Do you or the rest of the team have any thoughts on the state of Olaf's Ragnarok that might be interesting? Do you guys like it or hate it, honestly?","replies":[]}]},{"poster":"JuscarTheDread","date":"2015-08-04T23:28:18.857+0000","up_votes":2,"down_votes":1,"body":"Ya lets just break al my favorite champs rip {{champion:82}}","replies":[]},{"poster":"BuzzinTate","date":"2015-08-27T07:36:46.539+0000","up_votes":1,"down_votes":0,"body":"the problem with olaf is even when he has movement buffs on his ult and possibly with ghost... zed with {{item:3142}} can just walk away from him","replies":[]}]}