{"poster":"Fadedpf","date":"2015-06-11T19:31:35.321+0000","title":"\"I've learned to hit my enemies 3 times, lets add some ridiculous damage to that\"","subforum":"Gameplay","up_votes":137,"down_votes":42,"body":"Can we please stop this from going into new champions kits? {{champion:150}}  and {{champion:245}}  clearly show why this isn&#039;t fun and just unnecessary.\n\nLets make a champion with big strengths and big weaknesses. People like {{champion:35}} {{champion:99}} {{champion:96}} Are some examples.\n\nShy away from massive mobility and \"3\" passives. Just make a champion with 1 passive, and 4 straight forward but strong abilities.\n\nIf they are resourceless. They better not have a ton of damage, cc and mobility. {{champion:92}} Because that&#039;s not fun mkay?","replies":[{"poster":"JustMyBassCannon","date":"2015-06-11T19:50:22.746+0000","up_votes":108,"down_votes":12,"body":"\\>Riot makes a simple champion\n\"Rito ur champs are so boring and copied from other games, y u so bad at making champs?\"\n\\>Riot makes a complex champion\n\"Rito ur champs so overloaded and have like 12 passives, y u so bad at making champs?\"\n\nThe point of having a passive that procs bonus damage after 3 hits is to make the champion want to stick to an engagement, as well as to give the opponent multiple chances to avoid the proc.","replies":[{"poster":"Abyssphere","date":"2015-06-11T21:03:25.257+0000","up_votes":7,"down_votes":22,"body":"> [{quoted}](name=JustMyBassCannon,realm=NA,application-id=3ErqAdtq,discussion-id=8EVJFih4,comment-id=0003,timestamp=2015-06-11T19:50:22.746+0000)\n>\n> \\>Riot makes a simple champion\n> \"Rito ur champs are so boring and copied from other games, y u so bad at making champs?\"\n> \\>Riot makes a complex champion\n> \"Rito ur champs so overloaded and have like 12 passives, y u so bad at making champs?\"\n> \n> The point of having a passive that procs bonus damage after 3 hits is to make the champion want to stick to an engagement, as well as to give the opponent multiple chances to avoid the proc.\n\nHow can you pretend both of those scenarios are common when the closest thing we had to a simple champion recently was Vel'Koz and people *really like Vel'Koz*. They also like Braum.","replies":[{"poster":"JustMyBassCannon","date":"2015-06-11T21:12:25.215+0000","up_votes":33,"down_votes":2,"body":"How can you pretend this didn't happen, unless you haven't been playing since before Season 1?\n\nA pattern happens over time. In the past, Riot would make simple champions, then get accused of copying their own champions, or heroes from other MOBAs (yeah, let's see someone develop something 100% new, simple and balanced in a MOBA). More recently, Riot has been making more complex champions, and now they get shit for giving a champion 2-3 passive effects and kit interactions more complex than Brand's passive.","replies":[{"poster":"Anidan","date":"2015-06-11T21:50:03.225+0000","up_votes":6,"down_votes":5,"body":"To be fair, putting the most iconic features of both Drow Ranger and Mirana into one champion is a pretty big bitch to deal with.\n\nThis game isn't meant to deal with the features DotA is equipped to deal with :\\\n\nTF would've been fine keeping his TP on his E, if he didn't also have a stun and long-range nuke on demand. NP has the travelling nuke, but it's half-way random in what it hits (hits closest to furthest targets, according to his vision), so he can't get a reliable nuke without making it a weak initial hit, and his \"CC\" is countered by tangoes to eat the tree, or a Quelling Blade/Battle Fury to cut one down. \n\nJax could've been balanced even with PA's avoidability, had there been an actually decent counter to his dodge. Also, the fact that in addition to that huge dodge chance he got defenses for building offensively was just... bad design, plain and simple.\n\nA simple but balanced hero on DotA is Crystal Maiden. Well rounded, simple to pick up and play, and effective. A simple but balanced hero on League is Annie. The opinion on her balance, however, is tenuous. But she is balanced, if annoying to play against. Though, to be fair, if you're not equipped to deal with Rylai she's a bitch and a half, too.","replies":[{"poster":"OyddAWqJ5r","date":"2015-06-12T01:15:36.787+0000","up_votes":20,"down_votes":1,"body":"To be even more fair DotA has 10 blllion overpowered items and overpowered champion abilities to counter every other overpowered item and ability.\n\nWe don't want that in League. So we won't have that.","replies":[{"poster":"Anidan","date":"2015-06-12T01:20:00.468+0000","up_votes":5,"down_votes":1,"body":"How are you defining \"OP\"? Because there's not much in DotA2 that's OP... You have to look at it within the purview of the game it's set in. If we compare it to League's items, sure. But that's because League doesn't items like Bloodstone or Eul's Scepter of Divinity, and Rylai is the only one who gets to wield her crystal scepter. \n\nIn that game, there are pretty much no OP items. Except maybe Octarine Core, but that's only because it has very strong synergy with people like Leshrac, and even then Leshrac himself got buffed at the same time, so it's kind of a wash.","replies":[{"poster":"JustMyBassCannon","date":"2015-06-12T01:35:13.133+0000","up_votes":12,"down_votes":0,"body":"In this context, OP is being used to refer mostly to binary mechanics. While that's alright in a game like Rock-Paper-Scissors, it makes MOBAs more boring. One example;\n\nScenario 1 - You lost to Champ A because you didn't have Counter B, and you aren't playing Champ C.\nScenario 2 - You beat Champ A because you had Counter B, and/or you are playing Champ C.\nNo 3rd scenario, because the champion ability and its counter do not have counter*-play*.\n\nDotA and DotA 2 have a lot of these mechanics. They even have counter-counters; simplest example is Black King Bar, which negates weakness to CC by making CC completely useless.\n\nLeague has a lot fewer of those scenarios; while counter-picking is a strategy, you can still out-play counter-picks in the majority of cases.","replies":[{"poster":"Perpetual Blur","date":"2015-06-12T14:06:41.081+0000","up_votes":7,"down_votes":1,"body":"I mained dota, then met my brother-in-law who's a plat leaguer. Since then, we've both picked up each others games to play together, and both prefer our own. So it goes. But that interaction has given a lot of insight into the difference between the two games.\n\nLeague has a big emphasis on counterplay (as you know. ;) ) That's mechanically outskilling your opponent, and making his skills not have full effect. It's great and fun.\n\nDota's emphasis is more on counter-tactics. You don't lose because you don't have counters (outside of redundant cases like 'I bought armour instead of MR into a full AP team'). You lose because you fail to plan and execute your engagements such that they can't use their skills effectively. This is why CC and mobility are so strong in dota (and so itemizable, so you can invest in better tactical tools), and why there're way more fog of war tools (terrain, cuttable trees, smoke of deceit, nighttime, team ward limit of 4). The goal is to allow you to decide, based on your initiation, how exactly you will cripple the enemy team. Of course, they're trying to do the same thing, and teamfights rarely occur as a surprise to either team. Surprise teamfights tend to be quick and lethal to the surprised one. Normal teamfights often drag out to 15-30 seconds of tactical maneuvering and ccing.\n\nIt's definitely fine to prefer league. League has a really fun fighting-game-esque style, where your mechanics and movement are the defining skill-point. Almost all champs have a HERO moment when they land that hook or whatever. It's seriously great.\n\nOn the other hand, Dota is fun too. It's a much stronger game strategically, with strategies revolving around map control and variable power spikes at different stages of the game, variable farm allocation based on predicted initiation or counter initiation needs, etc. (Seriously, it's NORMAL in pro games for the carry or mid to leave their lane and let the support farm up an item. That support will end with the lowest CS, but getting him an initiation item is valued more than rushing a better carry item.)\n\nAs an example, let's look at BKB: BKB is tactically controlled.\n\nUnlike in league, you CAN'T cleanse out of stuns. So, the first tactical solution to BKB is simply to get the drop on your enemy. Stun or polymorph them before they pop BKB, and burst them. Dota burst is weaker than league's, but with good coordination or stun stacking you can do it. \n\nBKB has a short duration (for Dota teamfights) which gets shorter with every use, and is on a 70ish second CD. So a strategy+tactics solution is to organize ganks on the BKB carrier every 70 seconds, forcing out BKB charges to stay alive, or forcing him to group and farm inefficiently.\n\nNext, you kite it. A BKB lasts less than the normal duration of a fight anyhow. Disengage counters BKB, as it runs out, and then you are effectively an item up on the enemy (BKB stats are terribly inefficient. Like, less than 50% efficient.)\n\nFinally, more than half the skills in the game pierce BKB. It blocks most spammable, low-time-cost cc, and some huge teamfight CC and damage. Heros with no tools vs BKB are somewhat defined by that. There are kiting skills vs a BKB on most teams, even in all random.\n\nEdit: tl;dr: The decision between Dota and League is not one of counters vs counterplay, but one of mechanical vs tactical play.","replies":[{"poster":"JustMyBassCannon","date":"2015-06-12T15:31:27.435+0000","up_votes":2,"down_votes":0,"body":"Mechanical vs Tactical *is* counters vs counter-play.\n\nAlso, I didn't mean to imply that DotA *lacks* counter-play. DotA's counter-play revolves around hard counters instead of soft counters.","replies":[{"poster":"Perpetual Blur","date":"2015-06-16T16:45:57.622+0000","up_votes":2,"down_votes":0,"body":"Not... really. Counters imply that there are some choices (in draft or itemization) that render a certain hero much, much weaker, without much say from the countered player. That's really not true in dota. Good play can let you beat that 'counter'. It's only a 'counter' in that it requires smarter tactics to defeat. And since it came at a cost (either in draft or itemization) to the countering hero, defeating gives you a big advantage over your enemy.\n\nI don't think counter-play is a fair word for it either. It doesn't rely on your play in the same way as league skillshots, etc. do. It relies on your prepwork, timing and positioning; mostly tactics level stuff. It's counter-tactics.\n\nI do agree that most of the tools are a lot harder and more binary in Dota. Blademail is a good example, with an active 100% return with cd instead of passive 30% thornmail (though slightly deceptive, as it returns damage after reduction instead of before.) This generally means the actives are more of the value of an item rather than stats, as the cd provides windows of opportunity, and interesting tactical play.","replies":[]}]},{"poster":"Meep Man","date":"2015-06-12T18:04:55.517+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Perpetual Blur,realm=NA,application-id=3ErqAdtq,discussion-id=8EVJFih4,comment-id=00030002000000000000000000000001,timestamp=2015-06-12T14:06:41.081+0000)\n>\n> I mained dota, then met my brother-in-law who's a plat leaguer. Since then, we've both picked up each others games to play together, and both prefer our own. So it goes. But that interaction has given a lot of insight into the difference between the two games.\n> \n> League has a big emphasis on counterplay (as you know. ;) ) That's mechanically outskilling your opponent, and making his skills not have full effect. It's great and fun.\n> \n> Dota's emphasis is more on counter-tactics. You don't lose because you don't have counters (outside of redundant cases like 'I bought armour instead of MR into a full AP team'). You lose because you fail to plan and execute your engagements such that they can't use their skills effectively. This is why CC and mobility are so strong in dota (and so itemizable, so you can invest in better tactical tools), and why there're way more fog of war tools (terrain, cuttable trees, smoke of deceit, nighttime, team ward limit of 4). The goal is to allow you to decide, based on your initiation, how exactly you will cripple the enemy team. Of course, they're trying to do the same thing, and teamfights rarely occur as a surprise to either team. Surprise teamfights tend to be quick and lethal to the surprised one. Normal teamfights often drag out to 15-30 seconds of tactical maneuvering and ccing.\n> \n> It's definitely fine to prefer league. League has a really fun fighting-game-esque style, where your mechanics and movement are the defining skill-point. Almost all champs have a HERO moment when they land that hook or whatever. It's seriously great.\n> \n> On the other hand, Dota is fun too. It's a much stronger game strategically, with strategies revolving around map control and variable power spikes at different stages of the game, variable farm allocation based on predicted initiation or counter initiation needs, etc. (Seriously, it's NORMAL in pro games for the carry or mid to leave their lane and let the support farm up an item. That support will end with the lowest CS, but getting him an initiation item is valued more than rushing a better carry item.)\n> \n> As an example, let's look at BKB: BKB is tactically controlled.\n> \n> Unlike in league, you CAN'T cleanse out of stuns. So, the first tactical solution to BKB is simply to get the drop on your enemy. Stun or polymorph them before they pop BKB, and burst them. Dota burst is weaker than league's, but with good coordination or stun stacking you can do it. \n> \n> BKB has a short duration (for Dota teamfights) which gets shorter with every use, and is on a 70ish second CD. So a strategy+tactics solution is to organize ganks on the BKB carrier every 70 seconds, forcing out BKB charges to stay alive, or forcing him to group and farm inefficiently.\n> \n> Next, you kite it. A BKB lasts less than the normal duration of a fight anyhow. Disengage counters BKB, as it runs out, and then you are effectively an item up on the enemy (BKB stats are terribly inefficient. Like, less than 50% efficient.)\n> \n> Finally, more than half the skills in the game pierce BKB. It blocks most spammable, low-time-cost cc, and some huge teamfight CC and damage. Heros with no tools vs BKB are somewhat defined by that. There are kiting skills vs a BKB on most teams, even in all random.\n> \n> Edit: tl;dr: The decision between Dota and League is not one of counters vs counterplay, but one of mechanical vs tactical play.\n\nAll of this is what makes champions in either game feel powerful. The less \"counterplay\" a champion has in League, the more powerful they feel. The more \"control\" a person has in Dota, the more powerful they feel. This is why people like Fizz, LeBlanc, and Zed feel so powerful in LoL, and why people like Tidehunter, Enigma, and Riki feel so powerful in Dota (well, as far as being powerful gets in Dota).","replies":[{"poster":"windwolf777","date":"2015-06-13T02:12:31.988+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Inept Maverick,realm=NA,application-id=3ErqAdtq,discussion-id=8EVJFih4,comment-id=000300020000000000000000000000010001,timestamp=2015-06-12T18:04:55.517+0000)\n>\n> All of this is what makes champions in either game feel powerful. The less \"counterplay\" a champion has in League, the more powerful they feel. The more \"control\" a person has in Dota, the more powerful they feel. This is why people like Fizz, LeBlanc, and Zed feel so powerful in LoL, and why people like Tidehunter, Enigma, and **Riki **feel so powerful in Dota (well, as far as being powerful gets in Dota).\n\nOne of these things is not like the other. Riki tbh is garbage. He can get supports to become starved due to buying sentries (invisible wards that only reveal invisible units if you have vision of the unit), or dust (consumable AoE reveal debuff with a very minor slow while invis). However, he relies on invis and catching people unaware. Pros are generally too coordinated for that to happen\n\nIf anything something you're looking for a good AoE team fight ult would be Magnus. Ult pierces BKB, stuns in a decent sized aoe and clumps them together, and his Skewer can reposition the entire team. But just saying, also, all 3 of the heroes we're talking about (Tide, Enigma, Magnus) also rely on them getting Blink Daggers. Which is essentially a {{summoner:4}} on a 12(ish?) CD, with a much larger range, but gets disabled if you take hero/hero summoned unit (example would be Tibbers) for 3 seconds.","replies":[{"poster":"Perpetual Blur","date":"2015-06-16T16:36:13.845+0000","up_votes":2,"down_votes":0,"body":"Riki has a 53% winrate in Very High (roughly Plat+) skilled games currently; he's not that bad. He has an uber-buffed soraka silence, built in blink with charges, and ~3x shaco passive. Plus perma-stealth, which is still quite handy for forcing the enemy out of greedy farming positions at any skill level.\n\nHe's not hugely popular anywhere but very-low-MMRs (where he is ridiculously OP) but he's not bad even at the highest skill levels.","replies":[]}]}]}]},{"poster":"Anidan","date":"2015-06-12T04:28:25.928+0000","up_votes":2,"down_votes":0,"body":"Gotta love those counter-counters. \"I got my BKB, let's do this shit!\" *activates BKB, gets black-holed by Enigma* \"Well, Enigma's ult is down, let's go again.\" *activates BKB, gets bashlorded by Alchemist/Faceless Void/Anti-Mage/Slardar/Troll Warlord* \"FUCK THIS GAME!\"","replies":[]}]},{"poster":"Narasimha","date":"2015-06-12T01:58:01.812+0000","up_votes":2,"down_votes":0,"body":"I don't think he means 'overpowered' as such, merely that items have a much greater impact in DoTA than they do in League. Its hard to compare champions to heroes when the very nature of the items skews everything.","replies":[]}]}]},{"poster":"ArkenStorm","date":"2015-06-12T01:17:07.632+0000","up_votes":3,"down_votes":1,"body":"yup, that instant aoe stun+nuke+DoT+walking meat shield is totally balanced. ;)","replies":[{"poster":"Anidan","date":"2015-06-12T04:35:08.577+0000","up_votes":2,"down_votes":1,"body":"Yes, it is. Glad you agree. Just means one less person I have to explain to that the ability you're complaining about is her ULTIMATE ability, in addition to her passive. You're receiving two of the 5 elements of her kit in one blast. That seems pretty fair for it to be pretty powerful to me. Especially with such an enormous amount of her power budget going straight to the bear and her passive. \n\nHer Q? Targeted damage, and a mana refund/cooldown reduction on kills. Her W? Conical damage, nothing more. Her E? A bit of Armor/MRes, and some damage against auto attacks. The budget on her 3 normal abilities is pitiful compared to her bear and passive. That combo together better be fucking effective or people that play as Annie would have rightful problems about it.","replies":[{"poster":"Servbot 52","date":"2015-06-12T05:53:37.179+0000","up_votes":1,"down_votes":0,"body":"you forgot to point out the relatively short range of the bear, forcing Annie to find some way to close that gap before the enemy scatters / kills her / does something else to deal with it. most of the time Annie needs to use her flash to use this trick effectively leaving her without an escape.","replies":[{"poster":"It Hertz When IP","date":"2015-06-12T07:28:49.483+0000","up_votes":3,"down_votes":0,"body":"I like hiding in bushes and waiting. ^-^","replies":[]}]}]}]}]},{"poster":"Abyssphere","date":"2015-06-11T23:29:28.352+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=JustMyBassCannon,realm=NA,application-id=3ErqAdtq,discussion-id=8EVJFih4,comment-id=000300020000,timestamp=2015-06-11T21:12:25.215+0000)\n>\n> How can you pretend this didn't happen, unless you haven't been playing since before Season 1?\n> \n> A pattern happens over time. In the past, Riot would make simple champions, then get accused of copying their own champions, or heroes from other MOBAs (yeah, let's see someone develop something 100% new, simple and balanced in a MOBA). More recently, Riot has been making more complex champions, and now they get shit for giving a champion 2-3 passive effects and kit interactions more complex than Brand's passive.\n\nBut I'm not pretending it didn't happen, I'm saying it hasn't happened in the recent past. People didn't complain about Vel'Koz and Braum being simple and I don't think what happened several years ago is relevant today. When every champion was simple it made perfect sense to complain about champions being boring, but the game hasn't been like that in a long time and you cannot assume that people would complain about Riot making simple champions in 2015 just because they did in the past.\n\nYour original post suggested that it was a case of \"Wow Rito is damned if they do damned if they don't, can't do anything to please these idiots!!!!\" but it's not, because the complaint is not \"complex champions suck\", nor \"simple champions suck\". It's \"a long line of champions all having similar (extreme) levels of complexity/simplicity sucks\".\n\nPeople don't mind complex champs (as long as they're not too ridiculous), nor do they mind simple champions (as long as they're not too braindead). But they want variety, and it's very easy for Riot to give that. If the new champion schedule looked more like complex > complex > simple > complex > simple > simple than the current complex > complex > complex > complex > complex > complex then I think everyone would be happy. It's not an impossible feat for Riot to do this right.","replies":[{"poster":"JustMyBassCannon","date":"2015-06-12T00:30:03.604+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=MotherTeresa1910,realm=NA,application-id=3ErqAdtq,discussion-id=8EVJFih4,comment-id=0003000200000001,timestamp=2015-06-11T23:29:28.352+0000)\n>\n> But I'm not pretending it didn't happen, I'm saying it hasn't happened in the recent past. People didn't complain about Vel'Koz and Braum being simple and I don't think what happened several years ago is relevant today.\n\nIf that's your opinion, I don't see why you bothered to comment on my original comment.\n\nBecause I am mocking the community's flexibility to complain about whatever Riot throws to them.\n\nI've been watching the game for years, and there has not been a single patch that had no complaints, and it was always for the same set of arbitrary reasons.\n\nAs for a \"long line of complex champions,\" I'd argue that some of them are relatively simple, and their complexity lies in how their mechanics interact, instead. They're easier to learn by playing than by explaining their playstyles, to put it one way.","replies":[{"poster":"OyddAWqJ5r","date":"2015-06-12T01:23:56.415+0000","up_votes":7,"down_votes":1,"body":"This is one of the worst cases of arbitrary complaining I've seen in awhile. These complaints are being carried over from even before he was released on PBE when people read the kit and cried OP.\n\nReally makes me cringe when i win games as Ekko and people say it's only cuz he's OP. And better yet, when people see me lose to a Ryze top (pre-LCS debut) call me bad cuz Ryze rework is the worst champion in the game. I have far too many examples to continue on but basically the community only knows what the majority says and doesn't find things out on it's own.\n\nWhich makes it all the better when playing those Sleeper Cell champions.","replies":[{"poster":"Narasimha","date":"2015-06-12T01:59:14.274+0000","up_votes":3,"down_votes":1,"body":"> This is one of the worst cases of arbitrary complaining I've seen in awhile. These complaints are being carried over from even before he was released on PBE when people read the kit and cried OP.\n\nSo...are you talking about Ekko, or Bard? Because I remember a lot of complaing on the PBE about Bard too. Hell, people were outright complaining that he made almost all other supports obsolete.","replies":[]}]}]}]},{"poster":"ArkenStorm","date":"2015-06-12T01:16:17.136+0000","up_votes":3,"down_votes":1,"body":"lets see someone develop something 100% new PERIOD.","replies":[]}]}]},{"poster":"Fadedpf","date":"2015-06-11T20:01:33.663+0000","up_votes":11,"down_votes":4,"body":"I know it adds more commitment and such but I don't like that Ekko and Gnar have mobility+slows to make it super easy to get those procs off. Riot is in the habit of making champions with a lot of safety, damage, mobility and CC. And that is NOT okay.","replies":[{"poster":"Shosuko","date":"2015-06-12T05:44:23.465+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ThatAtheist,realm=NA,application-id=3ErqAdtq,discussion-id=8EVJFih4,comment-id=00030001,timestamp=2015-06-11T20:01:33.663+0000)\n>\n> I know it adds more commitment and such but I don't like that Ekko and Gnar have mobility+slows to make it super easy to get those procs off. Riot is in the habit of making champions with a lot of safety, damage, mobility and CC. And that is NOT okay.\n\nI think with Ekko they at least made the smart decision to have his dash half skill shot, half targeted.  He can't just free-leap to safety.  The most frustrating part about laning against an assassin to me isn't their ability to combo down, but rather their ability to get out of jail free.\n\nI laned as Annie versus Fizz the other day and I didn't even bother engaging on him or even calling the jungler in.  Any poke at all he would pole away and stay safe while it was on cd (which wasn't long after 3-5 lvls).  I didn't get any kills on him and resorted to ganking other lanes.  I was able to keep him pushed back and under farmed because he played so safely, but I don't think I sent a single spell his way, just auto and he dashed away.  Jungler comes in, dashes away.  Team fight going back, dashes away...\n\nAn assassin should not be the class that gets out of every engagement with a free \"oh shit\" spell.\n\nEkko they made his dash restricted, he at least has to blow his ult, and while it comes with a heal and massive damage it's not always a free escape.","replies":[]},{"poster":"PickleBabah","date":"2015-06-12T01:46:05.065+0000","up_votes":3,"down_votes":1,"body":"JustMyBaseCannon you have a point, but like ThatAtheist said it's not all that great if they have a lot of damage, mobility, cc, etc. Especially with Gnar and Ekko, where both have range so commitment isn't always necessary to get a lot of damage off with benefits.","replies":[{"poster":"Kanzler","date":"2015-06-12T03:49:18.559+0000","up_votes":3,"down_votes":1,"body":"That's the thing about ekko. If you are getting hit by his high damage spells, it is because he either outplayed you or you did something wrong. I have difficulty understanding why you find that to be a problem? As for his mobility, it can only be most effective when used offensively, otherwise his E is a very short dash. \n\nThe trade off for ekko having some serious damage, mobility, and utility is that his Q, W, and R are highly telegraphed. It is very easy to avoid the significantly higher damage of his return Q which will make him need to put himself in a dangerous position longer in order to proc his passive. \n\nEven his E gives you time to flash the engage if you are low enough to be killed. \n\nJust because you do not know how to play against him, doesnt mean he is op. Champions like LB do more damage, in a smaller timeframe, with far less opportunity for counterplay.","replies":[]}]}]},{"poster":"Only Play Darius","date":"2015-06-12T04:32:31.439+0000","up_votes":1,"down_votes":0,"body":"I don't really have a problem with {{champion:254}} {{champion:67}} 3-hit procs, but some champs _cough {{champion:245}} cough_ just have it overloaded. Not only does he have quite an easy time getting 3 procs since all his abilities add it, but once he gets 3 he gets {{item:3044}} and you get {{item:3022}}, and it makes it extraordinarily difficult to deal with. The other champs, if I get a proc on me I still feel like I can fight back. When Ekko gets 3 hits on me, I feel like I have already lost the trade and he is running circles around me and I can't do anything to fight back.","replies":[{"poster":"JustMyBassCannon","date":"2015-06-12T15:27:31.067+0000","up_votes":2,"down_votes":0,"body":"Ekko's 3-hit passive is one of two with an internal cooldown.\n\nNow, let me back up a bit and say that *I agree* his passive has too much power in it. It'd be more balanced if the slow was the same at all levels. **But Ekko's passive is the only 3-hit damage bonus that has an internal cooldown except for Skarner, _who gets a stun with his damage bonus._**","replies":[{"poster":"Only Play Darius","date":"2015-06-12T16:24:02.406+0000","up_votes":2,"down_votes":0,"body":"Skarners passive is absolute trash compared to all the others. First and foremost, it technically takes 4 procs since he needs 3 and then he needs to basic attack. Second, his only applies on abilites, not basic attacks, and literally half of his abilities don't even apply stacks. Third, despite his multiple MS steroids, he is just incapable of sticking to anyone with any kind of dash mobility or wallhop, its embarrassing how often he gets outrun. And finally, all he gets is a micro stun and nonscaling magic damage. Keep in mind this stun is his only hard cc outside of his ult, which is a single target suppress with a long cooldown.\n\nThere is no reason to pick skarner. All the other jungle tanks like gragas, sej, sion etc. have at least two forms of hard cc, usually both AOE, on top of wallhops. Skarner can't function as a fighter/bruiser either because his enemies kite him or dash away before he can get meaningful DPS out.","replies":[{"poster":"JustMyBassCannon","date":"2015-06-12T16:35:26.083+0000","up_votes":2,"down_votes":0,"body":"Thank you for going **completely** off-topic. I'll agree with you that Skarner's passive is weaker than Ekko's, and that his kit has fallen behind, but that was not the point.\n\nMy point still stands; literally the only other 3-hit passive with a cooldown is on Skarner. Vayne, Vi, Diana, Gnar, et al. *all* can re-stack their passives without any delay. Some also deal more damage. Ekko's passive maxes at 231 +70% AP, while Diana's caps at 250 +80% AP. Vayne's 60+8% max HP on the average 2k HP champ is 220 true damage. Vi's 10% max HP is 200 per proc, shreds Armor and can be proc'd much faster due to being able to get 4 procs through abilities. Gnar's 50+14% max HP is 330 in the same range.\n\nIs Ekko's passive a bit overtuned? Sure. An 80% slow that steals the MS is a bit ludicrous with that damage proc. But, in comparison to the rest of the 3-hit abilities, it's not *that* powerful damage-wise.","replies":[]}]}]}]},{"poster":"Solaxo","date":"2015-06-12T09:00:22.303+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=JustMyBassCannon,realm=NA,application-id=3ErqAdtq,discussion-id=8EVJFih4,comment-id=0003,timestamp=2015-06-11T19:50:22.746+0000)\n>\n> \\>Riot makes a simple champion\n> \"Rito ur champs are so boring and copied from other games, y u so bad at making champs?\"\n> \\>Riot makes a complex champion\n> \"Rito ur champs so overloaded and have like 12 passives, y u so bad at making champs?\"\n> \n> The point of having a passive that procs bonus damage after 3 hits is to make the champion want to stick to an engagement, as well as to give the opponent multiple chances to avoid the proc.\n\nLesson? Make something balanced, in between. Problem solved","replies":[]},{"poster":"LICENSED HOOKER","date":"2015-06-11T19:56:47.801+0000","up_votes":2,"down_votes":0,"body":"Im down with that idea, but then shouldn't the old basic champions also get reworks and procs?","replies":[]}]},{"poster":"7ha7guy777","date":"2015-06-11T19:41:06.721+0000","up_votes":43,"down_votes":1,"body":"{{champion:161}} \nEye learn through hitting my enemies 3 times","replies":[{"poster":"FistOfSharkiesha","date":"2015-06-11T22:46:54.684+0000","up_votes":12,"down_votes":1,"body":"At least it's abilities and not auto attacks. They can be dodged, burn mana, and leave you vulnerable after being used.","replies":[]}]},{"poster":"Sir ArmaMalum","date":"2015-06-11T19:57:15.802+0000","up_votes":15,"down_votes":0,"body":"While I completely agree the 'on 3 stacks' thing has been popular lately, as well as mobility, that mechanic does have its place. It allows a form of burst that requires extended engage. Anytime it's used it's to reinforce an intended tempo and leaves an easy weakness to poke and quick trades.\n\nThe issue with 'straightforward' abilities is you start hitting ability clones. Hell, you could see it happening with champions like Morgana + Lux or (old) Xin Zhao/WuKong where, while functionally slightly different their kits seemed incredibly similar. Now, don't get me wrong, there are still *plenty* of ways to bring in a new and exciting kit into the game. But as we get more and more champions those ways are going to naturally get more and more specific/complicated until a new interaction is introduced (i.e. Yasuo windwall or Draven Axes). And those, in turn, are then wrung dry (i.e. Braum E, Zac Passive).\n\nIn fact, I wouldn't be surprised 2-3 champions from now the 'new guy' will have some form of follower or 'backtrack' mechanic to make use of Ekko's Ult's coding.","replies":[{"poster":"Abyssphere","date":"2015-06-11T21:05:37.292+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sir ArmaMalum,realm=NA,application-id=3ErqAdtq,discussion-id=8EVJFih4,comment-id=0005,timestamp=2015-06-11T19:57:15.802+0000)\n>\n> While I completely agree the 'on 3 stacks' thing has been popular lately, as well as mobility, that mechanic does have its place. It allows a form of burst that requires extended engage. Anytime it's used it's to reinforce an intended tempo and leaves an easy weakness to poke and quick trades.\n> \n> The issue with 'straightforward' abilities is you start hitting ability clones. Hell, you could see it happening with champions like Morgana + Lux or (old) Xin Zhao/WuKong where, while functionally slightly different their kits seemed incredibly similar. Now, don't get me wrong, there are still *plenty* of ways to bring in a new and exciting kit into the game. But as we get more and more champions those ways are going to naturally get more and more specific/complicated until a new interaction is introduced (i.e. Yasuo windwall or Draven Axes). And those, in turn, are then wrung dry (i.e. Braum E, Zac Passive).\n> \n> In fact, I wouldn't be surprised 2-3 champions from now the 'new guy' will have some form of follower or 'backtrack' mechanic to make use of Ekko's Ult's coding.\n\nBut every ability gets copied and it's when the weirder ones are copied that it feels most clashing. The similarity between Gnar's Hyper and Ekko's passive is hugely glaring for example, as is the similarity between Unbreakable and Windwall. But when a much more simple mechanic has something that's similar, it's far less noticeable. You wouldn't think \"omg Zyra's snare is a total rip-off of Morgana's\", for example.","replies":[{"poster":"ayNigerianPrince","date":"2015-06-12T02:01:02.103+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=MotherTeresa1910,realm=NA,application-id=3ErqAdtq,discussion-id=8EVJFih4,comment-id=00050000,timestamp=2015-06-11T21:05:37.292+0000)\n>\n> But every ability gets copied and it's when the weirder ones are copied that it feels most clashing. The similarity between Gnar's Hyper and Ekko's passive is hugely glaring for example, as is the similarity between Unbreakable and Windwall. But when a much more simple mechanic has something that's similar, it's far less noticeable. You wouldn't think \"omg Zyra's snare is a total rip-off of Morgana's\", for example.\n\nExcept zyra's snare doesn't give me enough time to take a shit in the middle of it. :c","replies":[]},{"poster":"Sir ArmaMalum","date":"2015-06-11T22:02:56.307+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=MotherTeresa1910,realm=NA,application-id=3ErqAdtq,discussion-id=8EVJFih4,comment-id=00050000,timestamp=2015-06-11T21:05:37.292+0000)\n>\n> But every ability gets copied and it's when the weirder ones are copied that it feels most clashing. The similarity between Gnar's Hyper and Ekko's passive is hugely glaring for example, as is the similarity between Unbreakable and Windwall. But when a much more simple mechanic has something that's similar, it's far less noticeable. You wouldn't think \"omg Zyra's snare is a total rip-off of Morgana's\", for example.\n\nWhile I admit a good bit if comes down to individual interpretation, but I personally feel (as an individual) it's less to do with how 'weird' or 'complicated' two abilities are to feel similar. It's almost always their use case and limitations. So by that logic, yes, Gnar and Ekko have very similar on-hits, but Braums Unbreakable and windwall don't. \n\nBeing an opinion I'm not saying you're wrong or anything, but that's my interpretation.","replies":[]}]}]},{"poster":"Rismonaught","date":"2015-06-11T21:10:42.836+0000","up_votes":14,"down_votes":3,"body":"They need a champ with four completely random abilities.\n\nPassive 5% Crit\nQ - Fires a random CC at an enemy, doing damage, sometimes applies on hit effects twice.\nW - Increases a random stat by 40% for 3 seconds\nE - Gives you a shield that randomly absorbs one type of damage or maybe a CC, when it explodes it heals allies or hurts enemies then sends you flying backwards over terrain.\nR - For the next five seconds you can't be harmed, or die immediatly.","replies":[{"poster":"JustMyBassCannon","date":"2015-06-11T21:16:27.595+0000","up_votes":9,"down_votes":3,"body":"Except RNG in a controlled environment is not fun, **especially** not when it's as drastic as this.","replies":[{"poster":"Nin10do0014","date":"2015-06-11T21:28:46.099+0000","up_votes":6,"down_votes":1,"body":"Being with RNGesus is like being in an abusive relationship.  RNGesus will screw you over, and there's nothing you can do about it.","replies":[]},{"poster":"Narasimha","date":"2015-06-12T02:00:42.970+0000","up_votes":4,"down_votes":2,"body":"No, screw you, real men play Chaos Knight.","replies":[{"poster":"JustMyBassCannon","date":"2015-06-12T02:38:46.000+0000","up_votes":2,"down_votes":0,"body":"Funny thing; none of the RNG on Chaos Knight is *negative RNG,* and all of them are relatively predictable.\n\nYou don't use any of Chaos Knight's skills as a reaction, except maybe the stun, and *that* has a guaranteed 1-second stun that might last longer. While I personally don't enjoy RNG in a MOBA, as I do not subscribe to the ideology of \"Better lucky than good,\" *all* of Chaos Knight's RNG is relatively positive.\n\nThis theoretical champion has a literally worthless shield--you don't know if it will block physical, magic or true damage, or whether or not it will block CC. The steroid buffs a completely random stat, which means that there's one chance in over a dozen that it will buff any specific stat. AD, AP, AS, Armor, MR, HP, HP regen, MP, MP regen, Crit Chance, Lifesteal, Spell Vamp, CDR...The ultimate literally says it might kill the champion automatically.\n\nI have fewer problems with Chaos Knight than I do with this champion.","replies":[]}]}]},{"poster":"KilluhMike","date":"2015-06-12T23:10:12.713+0000","up_votes":3,"down_votes":0,"body":"sounds like a version of Olaf.  Who is worthless as fuck in this game now. Flash should only be on melee Champions. lol","replies":[]}]},{"poster":"Snakezzy","date":"2015-06-11T22:23:48.063+0000","up_votes":2,"down_votes":0,"body":"I think you forgot Vayne to that 3 hit passive thingy.","replies":[{"poster":"lDontLiftIcarry","date":"2015-06-11T22:39:49.816+0000","up_votes":4,"down_votes":0,"body":"yeah but vaynes the original honestly so you can't say its taken from anything.\nIts completely unique to her thematically as well.\nEveryone else is just tacked on bullshit thats uneeded","replies":[{"poster":"ArbiterOfTruth","date":"2015-06-12T02:00:02.016+0000","up_votes":3,"down_votes":0,"body":"Not only that, but I believe that all of the new three hit passives now include spell hits making it easier to proc the passive. Vi and Vayne are the only ones off of the top of my head that rely on basic attacks to proc their passives.","replies":[{"poster":"Doctor Ivellius","date":"2015-06-12T03:56:02.201+0000","up_votes":8,"down_votes":0,"body":"The funny thing is that neither of those two are examples, either. Vi's Vaultbreaker adds a stack of Denting Blows and Vayne's Condemn adds a stack of Silver Bolts (I didn't know this for years). Both also have an auto-attack reset that helps them proc these stacks more quickly.","replies":[]}]}]}]}]}