{"poster":"Bruce1906","date":"2016-06-11T21:31:18.205+0000","title":"Kindred is dead","subforum":"Champions & Gameplay","up_votes":1,"down_votes":9,"body":"Was Riot aus den ganzen guten Champions macht ist auch nicht mehr lustig!\r\nAlleine schon Kindred ist so schwach geworden das ich (Kindred Main S+ in mid Saison) so krass mit ihr lose das sie kein spa&szlig; mehr macht!\r\nMeine Spiele mit ihr waren fr&uuml;her immer positiv aber seit dem nerf geht es nicht h&ouml;her als 2|10|3 und da hab ich genau so gespielt wie fr&uuml;her!\r\nWieso werden nutzlose champs hoch gepowert wie sonst was und die guten champs die geile mechaniks haben so runtergemacht das man sie nicht spielen kann?!?!","replies":[{"poster":"BloodCrystalx3","date":"2016-06-11T21:50:30.513+0000","up_votes":6,"down_votes":0,"body":"Und nicht zu vergessen, KINDRED ERSCHEINT BEIM TOT! :p\n\nBitte sehe meine Matchhistory, dann sage etwas von schwach..\nKindred ist halt ein Schütze, bedeutet sie ist gegen AP nicht wirklich stark ^^ Weshalb sollte sie den in der Mitte überleben können? Tut bzw, Kalista ja auch nicht. \n\nWas haben sie runtergemacht? Nur etwas Dmg. \nIch meine, erinnere dich, man konnte beim Release Solo- Baron machen ;')\n\nFazit: Kindred ist trotz den Veränderungen / Nerfs ein Champion der was kann. ^^\n\nPS: Deine Umfrage ist ziemlich ohne Sinn!","replies":[]},{"poster":"SuperplexP","date":"2016-06-11T23:57:16.563+0000","up_votes":4,"down_votes":6,"body":"Troll oder nicht, dass ist hier die Frage. Denn wenn das kein Troll ist, dann hast du echt keine Ahnung von dem Game.\nWas erdreistest du dich überhaupt, als Level 24 Spieler über das Balancing zu reden? Zumal du anscheinend kein einziges Mal LCS schaust. Da ist sie neben Nida immernoch der Toppick schlechthin.","replies":[{"poster":"Aenrikr","date":"2016-06-12T00:12:13.018+0000","up_votes":4,"down_votes":1,"body":"Das Wörtchen \"erdreisten\" ist an der Stelle ein wenig heftig.\nEin jeder Spieler kann schließlich die Blance so empfinden wie er mag, sogar unabhängig vom Level/Können.\n\nZudem ist LCS etwas vollkommen anderes als die Levelphase bzw unsere Ligensysteme.\nDas kann man gar nicht miteinander vergleichen, da stellt man überall ganz andere Anforderungen an die Champs.\n\nWährend beispielsweise in der LCS`s ein Champ wegen bestiimter Eigenschaften gut ins Team passt, spielen Leute während der Levelphase auf den Charakteren, mit denen sie gut klarkommen. \nIch hab damals z.B. gerne Kayle gespielt, Support und Midlane. Wäre mir seinerzeit nie eingefallen ne Soraka zu picken weil sie mir als zu schwach erschien, bis ich mich mit ihr mal näher beschäftigt hatte und sie dann als die Offenbarung empfand.\n\nWegen einer Empfindung also von \"erdreisten\" zu sprechen ist wirklich unpassend.\nUnd die Gegebenheiten der LCS mit einem in der Levelphase befindlichem Spieler zu vergleichen ist ebenso unangebracht.","replies":[{"poster":"SuperplexP","date":"2016-06-12T13:42:39.050+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Aenrikr,realm=EUW,application-id=Wj1wcocU,discussion-id=OA2sz3ZM,comment-id=00040000,timestamp=2016-06-12T00:12:13.018+0000)\n>\n> Das Wörtchen &quot;erdreisten&quot; ist an der Stelle ein wenig heftig.\n> Ein jeder Spieler kann schließlich die Blance so empfinden wie er mag, sogar unabhängig vom Level/Können.\n> \n> Zudem ist LCS etwas vollkommen anderes als die Levelphase bzw unsere Ligensysteme.\n> Das kann man gar nicht miteinander vergleichen, da stellt man überall ganz andere Anforderungen an die Champs.\n> \n> Während beispielsweise in der LCS`s ein Champ wegen bestiimter Eigenschaften gut ins Team passt, spielen Leute während der Levelphase auf den Charakteren, mit denen sie gut klarkommen. \n> Ich hab damals z.B. gerne Kayle gespielt, Support und Midlane. Wäre mir seinerzeit nie eingefallen ne Soraka zu picken weil sie mir als zu schwach erschien, bis ich mich mit ihr mal näher beschäftigt hatte und sie dann als die Offenbarung empfand.\n> \n> Wegen einer Empfindung also von &quot;erdreisten&quot; zu sprechen ist wirklich unpassend.\n> Und die Gegebenheiten der LCS mit einem in der Levelphase befindlichem Spieler zu vergleichen ist ebenso unangebracht.\n\nIch finde erdreisten passt hier ganz gut.\n\nNatürlich kann er die Balance empfinden wie er möchte, nur sollte er sich drüber im Klaren sein, dass er mit seiner Erfahrung und seinem Skill das Balancing überhaupt nicht einschätzen kann und für seinen Skill das Game auch nicht gebalanced ist. Damit ist der komplette Thread schon sinnlos.\n\nSelbst wenn ich die LCs einmal komplett rauslasse ist Kindred immernoch einer der stärksten Jungler in der aktuellen SoloQ (in jeder Elo). Damit bleibt das Argument ohne Probleme bestehen.","replies":[{"poster":"Bruce1906","date":"2016-06-13T13:54:13.512+0000","up_votes":1,"down_votes":2,"body":"woher willst du meinen skill einschätzen? Bruce1906 ist der 4. account den ich momentan aus langeweile spiele also wenn ihr skill usw an irgendetwas messen wollt dann in einer runde und nicht mal eben auf dem profil","replies":[{"poster":"SuperplexP","date":"2016-06-13T15:12:41.969+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Bruce1906,realm=EUW,application-id=Wj1wcocU,discussion-id=OA2sz3ZM,comment-id=0004000000000000,timestamp=2016-06-13T13:54:13.512+0000)\n>\n> woher willst du meinen skill einschätzen? Bruce1906 ist der 4. account den ich momentan aus langeweile spiele also wenn ihr skill usw an irgendetwas messen wollt dann in einer runde und nicht mal eben auf dem profil\n\nDann poste halt mit deinem Main. Generell kann man in Foren niemanden ernst nehmen, der mit seinem Smurf postet, weil da noch nie was sinnvolles bei rum kam.\n\nUnd wenn jemand nicht gerade ehemaliger Dota Profi ist, dann lässt sich anhand seiner Elo ohne Probleme auf seinen Skill schließen. Natürlich nur wenn man Smurfs außen vor lässt.","replies":[]}]}]}]}]},{"poster":"Arzog93","date":"2016-06-12T05:28:59.867+0000","up_votes":2,"down_votes":1,"body":"nutzlose champs? weil du sie nicht spielen kannst oder willst sind sie noch lange nicht nutzlos","replies":[{"poster":"Bruce1906","date":"2016-06-13T13:55:35.806+0000","up_votes":1,"down_votes":1,"body":"Im vergleich zu früher ist sie nutzlos geworden für leute die sie so gelernt haben wie sie in ihrer Bestform war","replies":[{"poster":"Arzog93","date":"2016-06-14T05:13:52.854+0000","up_votes":1,"down_votes":0,"body":"ja gut das stimmt schon\nhab sie von anfang an viel gespielt und da hast du sicherlich nicht ganz unrecht","replies":[]}]}]},{"poster":"TerrorRaven","date":"2016-06-12T00:11:38.415+0000","up_votes":2,"down_votes":1,"body":"Kindred hat im Bereich ab Platin immer noch eine sehr positive Win-Rate und ist insgesamt noch einer der stärksten Jungler http://champion.gg/statistics/#?roleSort=Jungle&sortBy=general.overallPosition&order=ascend\nAuch in der LCS wird sie sowohl in EU als auch in NA noch gespielt.","replies":[]},{"poster":"Kata Ga Kill","date":"2016-06-11T23:56:51.556+0000","up_votes":1,"down_votes":1,"body":"WTF Kindred ist noch immer OP Strong und beliebter Pick in der LCS und besonders auserhalb der EU.","replies":[{"poster":"Bruce1906","date":"2016-06-13T13:56:14.274+0000","up_votes":1,"down_votes":2,"body":"ja toll bin aber nunmal in der eu :P und die LCS hat die normalen spieler eh um längen überholt ^^","replies":[]}]},{"poster":"WC9 Umbra","date":"2016-06-11T22:49:45.271+0000","up_votes":1,"down_votes":1,"body":"Der champ fuckt im early einfach nur ab. Auch nach den Nerfs kommt ein gibt es immernoch situation in den auf lv 3 ein 50% hp Kindred auf die toplane kommt und den Full life Darius ohne leben zu verlieren killt.","replies":[]},{"poster":"Pandaphiri","date":"2016-06-11T21:42:01.737+0000","up_votes":1,"down_votes":2,"body":"komisch wenn sie doch so schwach ist warum hat sie dann  platz 1 in den Banrates?","replies":[]}]}