{"poster":"Indez","date":"2019-10-30T17:49:33.278+0000","title":"Silver Eloheel (Rage und deinstallation (fast)","subforum":"Ligen & gewertete Spiele","embed":{"description":"Indez / Silver 1 59LP / 79W 66L Win Ratio 54% / Syndra - 18W 17L Win Ratio 51%, Zed - 15W 8L Win Ratio 65%, Ekko - 4W 5L Win Ratio 44%, Pyke - 5W 2L Win Ratio 71%, Caitlyn - 3W 4L Win Ratio 43%","url":"https://euw.op.gg/summoner/userName=Indez","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":1,"down_votes":3,"body":"Hey. Spiele LoL jetzt seit 2016 und spiele seit dieser Season erst sehr aktiv (eigentlich nur) ranked. Ich spiele primär Midlane und mein Main ist normalerweise Zed, trotzdem spiele ich am meisten Syndra, da dem Team of an AP fehlt (ich lege großen wert auf guten Teamcomps) und CC hat. Nur mein Problem ist jetzt: Ich komme aus silber I nicht heraus. Egal ob ich gut spiele oder nicht, fühlt es sich für mich immer wie eine Art Zufallsgenerator an, ob ich gewinne oder verliere. Denn immer feeded entweder Botlane oder Toplane so hart, dass first turret Minute 15 fällt und der Gegner (oder die zwei Gegner komplett OP sind und in Teamfights alles Solo (oder halt zu zweit) erledigen. Ich hatte nach meiner heutigen Loststreak (wo ich mit meinem Freund JustceZZz gespielt habe) entgültig die Schnauze voll. Von 79 auf 14 LP droppen hat mich zum ausrasten gebracht, da ich endlich diese verfluchte Goldelo erreichen will (JustceZZz ist bereits Gold 1). Ich verstehe nicht was ich falsch mache. Meine letzten paar games bin ich dauernd auf der Botlane gelandet (wo ich natürlich auch teils geintet habe). Meine Frage ist jetzt, wie kann ich es endlich aus Silber rausschaffen? (ich möchte unbedingt diesen Aatrox Skin bekommen). Soll ich einen anderen Champ lernen, gibt es irgendwelche guten Videos? Was muss ich machen um diese nervige Elo, wo man für jeden kleinen Fehler 20 Fragezeichenpings abbekommt und gefühlt jedes Game REPORT __ geschrieben wird. Ich habe teilweise wegen meines Rages heute (Ich habe nichts kaputt gemacht, sondern nur verzweifelt gesagt, dass ich keinen Bock mehr hätte) teilweise gedacht das Game zu deinstallieren, obwohl es ein fester betandteil meines Lebens geworden ist. Nach einem langen Schultag etwas climben steht bei mir (Es sei denn es ist Klausurphase) auf dem Tagesplan. Mein Freund sagt immer es liegt daran, dass ich sehr schnell tilten kann, was ich auch verstehe, mein Problem ist, dass wenn der Gegner mal First Blood bekommt, oder der gegerische Jgl mal öfters gankt, ich direkt rumheule, dass das Game lost wäre und der Gegner jetzt eh total den Lead hat und somit immer weiterfeede. Da wäre ich nähmlich auch bei meiner zweiten Frage: Was tue ich am besten, wenn die Lane mal nicht so gut läuft bzw. Der gegner einen Goldlead hat?\r\nDanke für alle die bis hierhin gelesen haben. Ich schätze es sehr, dass ich euch Zeit für meine Probleme nehmt. Die zwei Fragen habe ich gestellt. Schönen Tag noch, Größtenteils liebe beschwörer","replies":[{"poster":"611FVNKBlv","date":"2019-10-31T03:34:10.542+0000","up_votes":4,"down_votes":0,"body":"Du hast 1x ne kurze Losingstreak und denkst direkt das du nicht aus s1 kommen kannst. oof.\n\nspiel einfach n tag später weiter . nach ner losingstreak kommt auch meist ne winningstreak .","replies":[]},{"poster":"Lucy Cαt","date":"2019-10-31T02:18:57.379+0000","up_votes":3,"down_votes":0,"body":"Es gibt keine Elohell wenn du nicht aus silber 1 rauskommst bist du selbst dran schuld wenn ich in silber bin spiele ich 3 games und bin instant gold es bringt nix die fehler bei anderen zu suchen du bist dran schuld und wenn du mir nicht glaubst können wir uns gerne im ts zusammen setzten und uns ein replay von dir anschauen","replies":[{"poster":"611FVNKBlv","date":"2019-10-31T03:51:40.199+0000","up_votes":1,"down_votes":3,"body":"Bro ich schaue mir dien op.gg an und frage mich folgendes\n\n1. Gold 1 rly ?\n2. Gold 1 WIE ?\n3. Gold 1 ? HÄ?\n\nund 4. Du willst von jemandem in silber 1 n replay analysieren wobei du statistisch um einiges schlechter bist .\n\nMag sein das es keine Elohell gibt (ist eher ne definierungssache) aber stell es nicht so dar das die eigene performance den climb bestimmt denn dann dürftest du vllt gerade so silber sein. Bei der performance in gold 1 würd ich instant nach jedem game reporten {{sticker:galio-happy}}","replies":[{"poster":"Lucy Cαt","date":"2019-10-31T07:24:34.021+0000","up_votes":2,"down_votes":0,"body":"Mien Op.gg wie du sagen würdest gehen mir am arsch vorbei ich hab genügend accounts in verschiedenen elos ich brauche keine bestätigung der denkt er hätte das recht über andere zu urteilen. Und muss ich mich jz unbedingt auf nen höheren acc einloggen damit ich das was schreiben darf senpai ?\n\nAußerdem sind die Coaches in der Lec und etc auch keine high elo weil es menschen gibt die das wissen haben aber unfähig sind das wissen anzuwenden. \n\nHoffe du verlierst deine Arroganz die dir nicht erlauben darfst \n\nSchönen Tag noch\n\nEdit natürlich hat die performance alles mit dem Climb zu tun last season war der acc in der Presason plat 1 wurde in Plat 2 geplaced und hab ihn dann runter geinted also muss es ja wohl daran liegen xD","replies":[{"poster":"Ráyleigh","date":"2019-10-31T07:54:53.385+0000","up_votes":2,"down_votes":0,"body":"Nimm den nicht zu ernst.\nDer schreibt alle paar Tage mit diesem Stufe 12 Acc irgendwelchen Mist und haut dann wieder für ein paar Tage ab.\nIch glaube das ist ein Acc unseres Forentroll´s","replies":[{"poster":"Lucy Cαt","date":"2019-10-31T09:04:32.354+0000","up_votes":1,"down_votes":0,"body":"Danke aber tue ich nicht mir war nur lw und wollte mit ihm ne Diskussion anfangen xD\nWer im Internet unterwegs ist und sich davon schon angegriffen fühlt hat dort nix verloren \naber ja danke","replies":[{"poster":"Ráyleigh","date":"2019-10-31T09:24:33.469+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}]}]},{"poster":"Ráyleigh","date":"2019-10-30T18:27:12.946+0000","up_votes":1,"down_votes":2,"body":"Ich muss den Text gar nicht erst Lesen.\n1 Titel gelesen\n2 Acc geprüft 163 Rankeds gespielt und spricht von Elohell\n3 Lachflash\n\nEdit: https://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/uRjbAO9d-elo-hell","replies":[{"poster":"XenesisCH","date":"2019-10-31T09:17:50.522+0000","up_votes":1,"down_votes":0,"body":"Tut mir leid, aber so eine spöttische Antwort hat der TE nicht verdient :/","replies":[{"poster":"Ráyleigh","date":"2019-10-31T09:25:25.425+0000","up_votes":1,"down_votes":0,"body":"Mea culpa\n\nDeshalb habe ich ja auch später noch den Link hinzugefügt.","replies":[{"poster":"XenesisCH","date":"2019-10-31T09:44:03.232+0000","up_votes":1,"down_votes":0,"body":"I see {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Ráyleigh","date":"2019-10-31T10:19:49.071+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-ahri-2}}","replies":[]}]}]}]}]},{"poster":"HeisserKakao66","date":"2019-10-31T09:13:58.585+0000","up_votes":1,"down_votes":0,"body":"> Mein Freund sagt immer es liegt daran, dass ich sehr schnell tilten kann, was ich auch verstehe, mein Problem ist, dass wenn der Gegner mal First Blood bekommt, oder der gegerische Jgl mal öfters gankt, ich direkt rumheule, dass das Game lost wäre und der Gegner jetzt eh total den Lead hat und somit immer weiterfeede. Da wäre ich nähmlich auch bei meiner zweiten Frage: Was tue ich am besten, wenn die Lane mal nicht so gut läuft bzw. Der gegner einen Goldlead hat?\n\nIch schreibe dir jetzt einmal von meinem Smurf Account aus, wo du dir am besten einmal das letzte Spiel bzw. das Ranked Spiel von gestern anschaust. Ich spiele mit diesem Account eigentlich nur DuoQ mit Friends. Wenn du das Spiel anschaust, dann fällt dir vielleicht die Spieldauer auf und die Stats des gegnerischen Midlaners. Dieser Viktor war auch der Grund weshalb wir gewonnen haben. Der war nämlich so tilted durch die vielen Ganks im Early, dass er sich für lustig unter einem unseren Towers hinrichten liess nach ca. 15-25 Minuten. Zudem hat er danach nicht mehr darauf geachtet, ob er Safe spielt und ist dann entsprechend immer wieder gestorben. \n\nIch kann dir aber sagen, dass wenn sich dieser Spieler in den Arsch gekniffen hätte und gesagt hätte, mir egal wenn ich dauernd durch Ganks sterbe, denn ich gebe weiterhin mein bestes und werde versuchen möglichst auf die Map zu achten und in Fights weiterhin kein einfaches Ziel zu sein und meinen Rückstand durch sicheres Spielen wieder aufzuholen (er war da schon 1/10 oder so) und um im Lategame dann zu gewinnen. Hätte er sich daran gehalten, konzentriert weitergespielt und seinen verletzten Stolz hinter sich gelassen, dann hätte er es auch geschafft einen Fullbuild hinzubekommen in der Zeit und das Spiel für sein Team entscheiden können, da bin ich mir 100 % sicher. Wir haben nur gewonnen, weil wir praktisch 4v5 gespielt haben, da es unserem Team einfach an Köpfchen gefehlt hat, um mit dem Lead das Spiel entsprechen schnell zu beenden. Da halt für einige Leute Kills wichtiger sind als Objectives (deshalb auch der Smurf, um mit Friends zu spielen :3). \n\nWas ich damit sagen will. Ein Team ist nur so stark wie sein schwächstes Teammitglied und ist der Wille zum Siegen gebrochen, ist es sehr schwer für ein Team einen solchen Spieler zu carrien, obwohl das Team die schwache bzw. verlorene Lane problemlos hätte kompensieren können. Mein Tipp an dich, höre auf deinen Freund und ändere deine Einstellung wenn es mal nicht läuft und konzentrier dich darauf die Lane so weiterzuspielen, dass du safe bist und vor allem stell jegliches schreiben bzw. rumheulen im Chat ab, das hilft dem Team nicht. Es wird weiterhin Spiele geben, welche man nicht gewinnen kann und das musst du akzeptieren, denn Aufsteigen kann ein langer Prozess sein und es geht jedem gleich wie dir beim Aufsteigen. Spass am Spiel sollte zudem im Vordergrund stehen.","replies":[]},{"poster":"Nijuga","date":"2019-10-31T08:46:01.767+0000","up_votes":1,"down_votes":0,"body":"Das Wichtigste ist, dass man es akzeptiert, dass der Gegner mal einen Lead bekommt oder mal jemand frustriert ist und eventuell etwas intet. Wenn du es akzeptiert hast, dass du jetzt einen Nachteil hast, dann überlege wie du diesen vielleicht ausgleichen kannst - wichtig wäre es an dieser Stelle selbst etwas defensiver zu spielen und zu Versuchen möglichst viele Fehler von Gegner zu punishen und diese dann in Kills und Objectives umzumünzen. Wenn du zum Beispiel merkst, dass eine Lane deiner Teammates etwas behind fällt, versuche zu roamen wenn es die Situation zulässt. Des Weiteren finde ich, ist es ein Vorteil, Spieler zu muten wenn sie flamen oder Spampingen und entgegengesetzt ist es immer positiv, dass eigene Team zu loben mit einen einfachen \"wp\" wenn sie einen Kill holen oder eine Situation gut spielen.\nBin zwar nur Gold, aber das sind so ein paar Erfahrungen die ich gemacht habe.","replies":[]}]}