{"poster":"Champion Chrome","date":"2019-01-18T13:02:47.323+0000","title":"@FauxSchizzle A lore request for my boi","subforum":"Story, Art, & Sound","up_votes":5,"down_votes":3,"body":"{{sticker:zombie-nunu-bummed}} \r\nAs a faithful Ezreal main since the days of S6, I get annoyed when some people *cough* Necrit *cough* look at Ez the wrong way - as a sociopath who remorselessly KILLS (wut) and has no feelings.{{sticker:sg-ahri-1}} {{sticker:zombie-brand-mindblown}} \r\nAs such, I would like if we get an Ez story where instead of him writing it, it is in his head and thoughts, showing his good nature as opposed to the glorified self he tries to write up to be more famous in order to have his parents come back.{{sticker:sg-ezreal}}","replies":[{"poster":"BoringLittleF","date":"2019-01-18T22:51:59.503+0000","up_votes":1,"down_votes":0,"body":"I won't say that Ez is a douche. He is more like a young Indie Jones. The guy who is hooked on the thrill and danger, likes to snatch artifacts, would kill without remorse and enjoy daring into tombs and hate to comply with authorities.","replies":[{"poster":"FauxSchizzle","date":"2019-01-30T23:54:07.049+0000","up_votes":3,"down_votes":0,"body":"Perspective that inspired Ezreal: Indiana Jones is the world's worst archaeologist. He breaks his own rules, wantonly destroys priceless artifacts, and decimates countless possible UNESCO world heritage sites. And he's rarely reprimanded for such. Despite teaching that one should never trust folklore over fact, he never abides by that golden rule. He is also my very favorite film hero for all of his flaws. He doesn't need to be good or make reparations for his escapades. He is pure pulpy escapist fun. That's what I find so enchanting about Ez -- he's naturally a magic user but refuses to allow that to make him special alone -- he wants accolades and fame -- which is exactly where Jones is early in his career. He hasn't been tempered by the forces or darkness or witnessed humbling divinity. \n\nIf the Lore Lords have their way, I will one day get to return to Ezreal, as I already have a very long arc of stories sketched out for our favorite gauntleted almost-hero.","replies":[{"poster":"AbiwonKenabi","date":"2019-01-31T15:33:42.478+0000","up_votes":1,"down_votes":0,"body":"I look forward to seeing those stories, hopefully sooner rather than later :)\n\nIs there anything you can tease for Ezreal right now? C'mon, you can talk to us, we're your friends...","replies":[]}]}]},{"poster":"Camille Ferrøs","date":"2019-01-18T13:28:50.336+0000","up_votes":2,"down_votes":1,"body":"He has feeling. And that is the reason on where he is today.","replies":[]},{"poster":"Brotha","date":"2019-01-18T13:09:17.090+0000","up_votes":1,"down_votes":2,"body":"Face it, they turned Ezreal into a douche. They did the same thing to Jayce.","replies":[{"poster":"AbiwonKenabi","date":"2019-01-31T15:35:02.999+0000","up_votes":1,"down_votes":0,"body":"He is a douche, but he's a lovable douche that has the talent to back up a lot of his douchery talk. \n\nPlus he's still pretty young so he has a lot of room to grow.","replies":[]},{"poster":"Champion Chrome","date":"2019-01-18T13:17:48.633+0000","up_votes":1,"down_votes":1,"body":"never! I REFUSE{{sticker:sg-syndra}}","replies":[]}]}]}