{"poster":"Ode to dark","date":"2015-08-29T19:09:45.582+0000","title":"¿Como le fue a KLG?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Gracias n_n","replies":[{"poster":"Jherico","date":"2015-08-29T21:33:43.880+0000","up_votes":3,"down_votes":0,"body":"Lei mas abajo que dicen no hay nivel en  LAS , es demasiado lo que podemos jugar, vivimos con lag troll y afk por doquier\nno tenemos ni varios modos de juego ni recompensas ni castigo a la gente toxica, vos queres mejorar y te encontras\ncon gente que ni vale la pena, demasiado le rompen el poporempo a los de Lan, si nos diernas mas atencion al server de las\ncreo que muchos podian mejorar tanto equipos como individuales.","replies":[{"poster":"lordeman10","date":"2015-08-30T15:58:29.025+0000","up_votes":1,"down_votes":1,"body":"eso no tiene mucho que ver con los E-sports, pasa más por los sponsors y la cultura gamer en si, no es lo mismo que en asia o usa\n\nlo que mencionaste son cosas random, un jugador profesional no va a ser peor por que le toquen trolls y afks o por no tener dominion es ridículo jaja","replies":[]}]},{"poster":"Wandúlo Smithers","date":"2015-08-29T19:15:51.131+0000","up_votes":2,"down_votes":0,"body":"Perdió por penales","replies":[]},{"poster":"Tyrr Judicator","date":"2015-08-30T18:25:57.117+0000","up_votes":1,"down_votes":0,"body":"oh dios mio para el infarto esa pelea del baron ASDADSADSADSDAS","replies":[]},{"poster":"Yrox the Third","date":"2015-08-29T21:39:03.819+0000","up_votes":1,"down_votes":0,"body":"Sigo diciendo, LA son las peores regiones del mundo junto a oceania y quizas japon, pero no pueden negar que no fue como el año pasado que nos violaron, se noto que KLG ha mejorado considerablemente, no fueron \"stomps\" pero aun asi, son 2 derrotas.","replies":[{"poster":"oh95","date":"2015-08-30T17:32:11.631+0000","up_votes":1,"down_votes":0,"body":"Oceania le gano a los turcos, salieron primeros y todo en la fase de grupos eh, perdieron en la final contra Bangkong Titans.","replies":[{"poster":"Yrox the Third","date":"2015-08-30T18:07:50.267+0000","up_votes":1,"down_votes":0,"body":"Bueno, mejoraron bastante, y rapido, pero aun asi, es probable que ya el proximo año veamos mas de estas regiones, quizas.","replies":[]}]},{"poster":"Ode to dark","date":"2015-08-29T21:59:36.263+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Yrox the Third,realm=LAS,application-id=v7qsfXsE,discussion-id=KfkhlyR6,comment-id=000b,timestamp=2015-08-29T21:39:03.819+0000)\n>\n> Sigo diciendo, LA son las peores regiones del mundo junto a oceania y quizas japon, pero no pueden negar que no fue como el año pasado que nos violaron, se noto que KLG ha mejorado considerablemente, no fueron \"stomps\" pero aun asi, son 2 derrotas.\n\nEso es cierto, el año pasado dieron vergüenza, pero este año dieron pelea :D","replies":[]}]},{"poster":"oh95","date":"2015-08-30T17:38:18.343+0000","up_votes":1,"down_votes":0,"body":"Para mí, los mejores equipso de LA y BR pueden estar en la LCS de NA o EU tranquilamente y pelear por puestos de playoffs, hablan de que no tienen nivel para plear en esas regiones pero ustedes vieron a Giants Gaming, Dignitas, el mismo C9, NME, T8, GAMBIT, SK. Europa prácticamente tiene 3 equipos (FNC, H2K y Origen) y quizás el mejorcito de los otros 7 es Roccat, pero de ahí los demás equipos tienen un nivel pésimo, acá muchos dicen LA y BR estan a años luz de LCS pero me parece que no vieron ni un partido o solo ven Highlights y ya está. En cambio yo veo todos los partidso y por eso tengo esta opinión, no digo que KLG juegue perfecto, pero lo veo mejor que equipos como Giants que tiene errores similares o que Elementz otro equipo con enormes errores y es Only Froggen, y ni hablar de Pain que me parece un equipo muy superior, pero bueno cada uno opina libremente, incluso sin haber visto nada o ve solo los partiditos de Fnatic.","replies":[]},{"poster":"Zerint","date":"2015-08-30T07:19:15.434+0000","up_votes":1,"down_votes":0,"body":"Todos se quejan porque perdieron. Volvi a ver las partidas, la primera omcontra HR perdieron y perdieron por un pequeño error, sólo uno que hizo que la partida de quiebre toda, y fue intentar pelear un dragón sin tener las condiciones ideales, es decir estaban mal posicionados y por su parte Hard Random estaba perfectamente posicionado, juliostito se mando para el carajo y destrozaron en un segundo, lo que regalo un barón y con eso término la partida. Y en la segunda partida, bueno, es pain gaming sin duda el mejor de los tres y sin embargo hicieron pelea. Doy mi fe en que si están más atentos el domingo pueden ganar las partidas. Sin embargo sirve de experiencia para seguir mejorando como equipo para klg y como region y que emñiecen a darnos pelota, pero primero hay que mejorar como comunidad gente! #GOKLG","replies":[]},{"poster":"Ellora","date":"2015-08-29T20:24:47.721+0000","up_votes":2,"down_votes":8,"body":"Que queden eliminados rapido y venga el evento de PI.\n\nNo hay nivel en las","replies":[{"poster":"Revolución","date":"2015-08-29T20:45:42.153+0000","up_votes":1,"down_votes":0,"body":"Difiero. No es tan malo el nivel de LAS como muchos piensan. Se sigue estando un paso atrás de la mayoría de los servidores, pero hay un gran crecimiento respecto del úlitmo año. Es muy fácil decir \"no hay nivel en LAS\", 0 capacidad de análisis.","replies":[{"poster":"Ellora","date":"2015-08-29T21:22:59.254+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Revolución,realm=LAS,application-id=v7qsfXsE,discussion-id=KfkhlyR6,comment-id=00090000,timestamp=2015-08-29T20:45:42.153+0000)\n>\n> Difiero. No es tan malo el nivel de LAS como muchos piensan. Se sigue estando un paso atrás de la mayoría de los servidores, pero hay un gran crecimiento respecto del úlitmo año. Es muy fácil decir \"no hay nivel en LAS\", 0 capacidad de análisis.\n\nNo se porque defienden tanto, hay que aceptar que no hay nivel y punto. Esta a años luz de los campeones de las demas regiones. LAS, LAN, incluso BR no tiene oportunidad alguna con los monstruos de KR, EU y NA","replies":[{"poster":"Revolución","date":"2015-08-30T01:40:31.200+0000","up_votes":1,"down_votes":0,"body":"Y de paso pongamos surrender al minuto 5, ni me gasto en contestarte.","replies":[{"poster":"Ellora","date":"2015-08-30T01:50:43.061+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Revolución,realm=LAS,application-id=v7qsfXsE,discussion-id=KfkhlyR6,comment-id=0009000000000000,timestamp=2015-08-30T01:40:31.200+0000)\n>\n> Y de paso pongamos surrender al minuto 5, ni me gasto en contestarte.\n\nNo, al minuto 20 que deja votar... sino vete afk que es en lo que gana este server.","replies":[]}]},{"poster":"mew under track","date":"2015-08-30T15:24:28.102+0000","up_votes":1,"down_votes":0,"body":"{{champion:29}}","replies":[]},{"poster":"Zerint","date":"2015-08-30T07:22:18.455+0000","up_votes":1,"down_votes":1,"body":"Para mi pain gaming es un gran equipo y puede darle pelea a cualquier equipo de la LCS (no digo que le gane fácil y lo estompee, pero si lo puede hacer transpirar) no se en que te basas en decir que no hay nivel. Obviamente no se comparan con skt y faker, pero el objetivo de los equipos estos es entrar al mundial y nl ganarlo porque hly en día no se puede competir con los coreanos.","replies":[]}]}]},{"poster":"lordeman10","date":"2015-08-30T16:01:03.504+0000","up_votes":1,"down_votes":0,"body":"yo respeto mucho el trabajo de KLG jugaron muy bien a pesar de los errores y que hayan perdido\n\nojala ahora ganen las dos y le cierren el {{champion:1}}  a todos jaja","replies":[]}]},{"poster":"Tyrr Judicator","date":"2015-08-29T20:08:35.995+0000","up_votes":1,"down_votes":0,"body":"como dicen están demostrando que crecieron  muchísimo comparado a la ultima vez pero igual aun muestran errores técnicos y de concentracion\nComo dicen abajo los 2 games basicamente fueron de la mano de los 2 mi laners kira y kami unos animales como jugaron si no se enfocan en esas 2 cosas mañana muy probable que no saquen puntos\n_Mid laners\n_Comunicación sobre los objetivos","replies":[{"poster":"Zerint","date":"2015-08-29T20:58:06.195+0000","up_votes":1,"down_votes":0,"body":"Kira es una bestia, y se nota que es muy superior a regi pero igual #GoKLG con todo mañana","replies":[]}]},{"poster":"Revolución","date":"2015-08-29T20:05:30.067+0000","up_votes":1,"down_votes":0,"body":"Mal, perdió los 2 juegos. Demuestran cosas interesantes en cuanto a capacidad técnica, pero han cometido errores de planificación y concentración importantes. En una partida en donde un equipo está arriba en asesinatos la mayoría del tiempo pero le hacen 7 dragones y 3 barones contra 0 propios y 10 torretas contra 3, se nota claramente dónde hay que trabajar.","replies":[]},{"poster":"Calihea","date":"2015-08-29T20:03:47.944+0000","up_votes":1,"down_votes":0,"body":"Perdieron ambas.","replies":[]},{"poster":"Zero45","date":"2015-08-29T20:03:05.915+0000","up_votes":1,"down_votes":0,"body":"Perdio las 2.... Yo pienso que MID fue su problema principal y los objetivos en la segunda partida 0 drake","replies":[]},{"poster":"FuzzyMind","date":"2015-08-29T20:02:37.197+0000","up_votes":1,"down_votes":0,"body":"Jugo bien KLG, pero los mid liners de paiN Gaming y Random Gaming juegan una barbaridad, son quienes carrearon las partidas. Lo que tendrán que hacer mañana si o si es anular esos mid liners porque sino no van a poder asegurar los puntos que necesitan para la final.","replies":[]},{"poster":"lordeman10","date":"2015-08-29T19:39:44.701+0000","up_votes":1,"down_votes":0,"body":"jugó bastante bien pero la vendió unas cuantas veces y perdieron\n\nahora están perdiendo contra los brasileros pero hay esperanza tienen la vayne de whitelotus que se está enchufando","replies":[]},{"poster":"Natchin","date":"2015-08-29T19:16:37.599+0000","up_votes":1,"down_votes":0,"body":"estan jugando ahora\nhttps://www.youtube.com/watch?v=jhgNP0_sBYw","replies":[]},{"poster":"Bienzahar","date":"2015-08-29T19:13:39.902+0000","up_votes":1,"down_votes":1,"body":"No se","replies":[]},{"poster":"Un Sin Corazón","date":"2015-08-29T22:34:11.117+0000","up_votes":2,"down_votes":3,"body":"A mi me fue bien, no se pero creo que te referís a mis iniciales :/","replies":[]}]}