{"poster":"Ode to dark","date":"2018-06-29T03:00:18.057+0000","title":"Propuesta: Poner siempre \"2do lugar\" en vez de \"derrota\"","subforum":"Off-topic y temas personales","up_votes":5,"down_votes":14,"body":"Creo que es una buena medida para combatir la frustraci&oacute;n de perder, ya que personalmente no se siente igual de amargo ver esa humorada luego de perder y muchos amigos piensan igual que yo. No es un secreto para nadie que este juego se caracteriza por ser de las comunidades m&aacute;s t&oacute;xicas as&iacute; que creo que cualquier medida que disminuya eso sirve.","replies":[{"poster":"Hanami Mirai","date":"2018-06-29T03:14:21.496+0000","up_votes":9,"down_votes":1,"body":"Interesante.\n\nEntonces que los campeones no mueran sino que se queden \"dormidos\".\n\nY cambiemos la frase de selección oculta de:\n\n**Arrasa tu carril, sumérgete en peleas de equipo de cinco contra cinco y destruye el nexo del enemigo en el modo competitivo más importante de LoL.** \n\nPor:\n\n**Abraza tu carril, sumérgete en besos y caricias de equipo de cinco contra cinco y desarma el nexo del que no es tu amigo (aún) en el modo no-competitivo más importante del LoL  pero no tan importante como tus sentimientos.**\n\n\nSi te deprime una derrota, mejora y conseguí la victoria, y si vas a perder, por lo menos perdes dando lo mejor.\n\n\nUna persona tóxica se la agarra incluso con el que le dice \"buenos días\".","replies":[{"poster":"Ode to dark","date":"2018-06-29T03:35:47.102+0000","up_votes":1,"down_votes":4,"body":"Bueno, hiciste un hombre de paja bastante fácil de derribar porque en primer lugar tú cambias varias palabras por otras diferentes y lo que dije yo es solo una. Además,  los campeones \"dormidos\" sería un concepto erróneo porque las habilidades y ataques de los campeones son dañinas así que carecería de sentido además de que iría más como una \"censura\", luego, segundo lugar ya lo dije que sea cambiado como una \"humorada\" lo cual siempre anima a las personas. Luego, me atacas personalmente diciendo que me \"deprime\" una derrota. ¿A mí? No me deprime en absoluto un simple juego, aquí lo que estoy hablando es de cambiar el ánimo para disminuir la toxicidad. Al perder y ver algo cómico en lugar de una simple \"derrota\" claramente tendrá un impacto diferente en el jugador a la hora de terminar la partida.","replies":[{"poster":"Hanami Mirai","date":"2018-06-29T04:09:19.824+0000","up_votes":4,"down_votes":0,"body":"**Además, los campeones \"dormidos\" sería un concepto erróneo porque las habilidades y ataques de los campeones son dañinas así que carecería de sentido además de que iría más como una \"censura\", luego, segundo lugar ya lo dije que sea cambiado como una \"humorada\" lo cual siempre anima a las personas.**\n\nEra un chiste pero de última cambiamos también las habilidades para que no sean tan agresivas.\n\n**Luego, me atacas personalmente diciendo que me \"deprime\" una derrota ¿A mí? No me deprime en absoluto un simple juego, **\n\nNo fue un ataque ja, ¿en serio no se puede decir nada sin que alguien se sienta \"atacado\"? Además fue más en general, mil disculpas si pensaste que fue dirigido únicamente hacia tu persona.\n\n**aquí lo que estoy hablando es de cambiar el ánimo para disminuir la toxicidad. Al perder y ver algo cómico en lugar de una simple \"derrota\" claramente tendrá un impacto diferente en el jugador a la hora de terminar la partida.**\n\nNo vas a lograr nada con eso,  mira URF (mejor ejemplo imposible), los jugadores no se molestan por el cartelito de \"segundo lugar\", se molestan por lo que sucede EN la partida, ya sea porque no llegaron al primer lugar, no jugaron el campeón que querían, no le cambiaron el campeón que querían, les toco un equipo desbalanceado, alguien murió, alguien insulto, ETC.\n\n\nImagínate en rankeds, te descuentan puntos por quedar en \"segundo lugar\" ¿en qué ayuda?¿alguien se va a sentir mejor? A fin de cuentas no ganaste, el otro sí, el otro quedo primero, el sentimiento de estar atrás de alguien te va a seguir afectando al igual que ser \"derrotado\".\n\nY lo que dije antes aplica a lo mismo:\n\n\"Si te deprime quedar en segundo lugar, mejora y conseguí el primero, y si vas a quedarte atras, por lo menos lo haces dando lo mejor.\" (NO HABLO DE VOS)\n\nA vos te parece cómico, a otros no, es bastante simple, a mi me chupa un huevo perder, me gusta divertirme y dar lo mejor, a otros no.\n\nPonele que se implemente algo así, al principio va a ser \"cómico\" luego lo van a naturalizar y van a seguir enojándose por las mismas boludeces, ESTOY SUPONIENDO LO SÉ, todos suponemos, no somos zilean.\n\nPUNTO APARTE\n\nSe nota que tenes buenas intenciones pero creo que cambiar un cartelito afecta poco y nada, deben haber mejores cosas para cambiar.","replies":[]}]},{"poster":"Rendırse Jamas","date":"2018-06-29T03:23:34.082+0000","up_votes":1,"down_votes":1,"body":"Nananana sos clave","replies":[]}]},{"poster":"Rendırse Jamas","date":"2018-06-29T03:24:07.738+0000","up_votes":3,"down_votes":0,"body":"No es una competencia en lugares, por lo cual, seria raro que diga Segundo Lugar, Derrota porque es una competencia entre dos equipos.","replies":[{"poster":"Ode to dark","date":"2018-06-29T03:37:57.826+0000","up_votes":1,"down_votes":2,"body":"Lo sé, habría una cuota de humor en eso como ya dije.","replies":[]}]},{"poster":"Diosmo","date":"2018-06-29T03:09:00.831+0000","up_votes":2,"down_votes":0,"body":"Es como festejar el Feliz No Cumpleaños jaja.","replies":[]},{"poster":"Sweeping Yasuo","date":"2018-06-29T03:06:59.420+0000","up_votes":2,"down_votes":0,"body":"DEFEAT{{sticker:sg-lulu}}","replies":[]},{"poster":"macri gatooooooo","date":"2018-06-29T03:33:17.934+0000","up_votes":2,"down_votes":1,"body":"No sube el dolar, baja el peso :u","replies":[{"poster":"Ode to dark","date":"2018-06-29T03:37:28.435+0000","up_votes":1,"down_votes":0,"body":"Lo mismo que en un ejemplo de otro comentario, los gobiernos usan eufemismos para causar un impacto diferente en las personas, solo que aquí sería para un buen objetivo y además tendría un toque de humor lo cual mejoraría la sensación al final de la partida","replies":[]}]},{"poster":"vaVav","date":"2018-06-29T03:01:45.274+0000","up_votes":2,"down_votes":1,"body":"Producto lácteo en lugar de leche y le aumentamos el precio","replies":[{"poster":"Ode to dark","date":"2018-06-29T03:05:40.729+0000","up_votes":2,"down_votes":5,"body":"Así mismo trabaja la publicidad, provocando sensaciones diferentes usando las palabras correctas, la diferencia aquí sería que el objetivo es bueno.","replies":[]}]},{"poster":"WhiteMax","date":"2018-07-01T04:13:38.844+0000","up_votes":1,"down_votes":0,"body":"Son 2 equipos, 1 gana y el otro pierde. El hecho de que ponga Derrota esta perfecto, o prefieres que ponga \"Perdedor/res\"?","replies":[]},{"poster":"POETA DEL RAYO","date":"2018-06-30T11:21:57.024+0000","up_votes":1,"down_votes":0,"body":"Jajaja , es chiste ? \n\nPor que si no lo lo es , entonces que no le saquen puntos a alguien al perder , denle el segundo premio ,\n \"si salís en primer lugar de 15 a 25 pl, si salís en segundo lugar de 15 a 20 pl\" \n\nJajaja no puede ser más incoherente este post","replies":[]},{"poster":"StąrDust","date":"2018-06-29T15:26:46.132+0000","up_votes":1,"down_votes":0,"body":"Esto es ridículo. Por más que cambien eso, vos te pensas que los que perdieron se van a alegrar? Cuando hay un troll/afk/flammer (pan de cada día en LoL), o en el peor de los casos perder una partida ya ganada porque uno de tu equipo la cago (esto es lo que más me enoja) y ver esa \"frase\" nos hace sentir mejor? Jajajaja en serio que patético, tampoco veo el humor que vos decís.","replies":[]},{"poster":"Juice Wrld","date":"2018-06-29T14:55:59.778+0000","up_votes":1,"down_votes":0,"body":"El segundo lugar es el primer perdedor.","replies":[]},{"poster":"llsShadowsll","date":"2018-06-29T11:51:00.020+0000","up_votes":1,"down_votes":0,"body":"Jajajajjaja","replies":[]},{"poster":"rokushoger","date":"2018-06-29T11:09:25.168+0000","up_votes":1,"down_votes":0,"body":"El tema es que tomarse a mal una derrota es más un tema de ustedes y/o de las personas que del juego.\nPerder, si bien no es el objetivo en la mayoría de los casos (a menos que hablemos de un troll), no es taaaaan malo tampoco, recuerda que se aprende más de una derrota que de una victoria.\nAdemás es gramaticalmente incorrecto, porque no estás en un segundo lugar, dado que eso implicaría que si hay un premio aunque menor que el primero, directamente perdiste.","replies":[]},{"poster":"Perturbado2","date":"2018-06-29T12:09:47.129+0000","up_votes":1,"down_votes":1,"body":"Y en vez de victoria gg izi click abajo para subirle la dificultad","replies":[]},{"poster":"Ode to dark","date":"2018-06-29T03:09:49.023+0000","up_votes":1,"down_votes":8,"body":"Sabía que muchos no lo entenderían, no tienen la conciencia suficiente como para hacerlo.","replies":[{"poster":"Luvwen","date":"2018-06-29T03:51:06.629+0000","up_votes":3,"down_votes":0,"body":"No se trata de eso capo. Pensa que para que haya un segundo lugar tiene que haber mas de 2 participantes por que sino no tiene sentido hacer esa aclaración sobre el puesto.","replies":[]},{"poster":"rokushoger","date":"2018-06-29T11:12:47.890+0000","up_votes":2,"down_votes":0,"body":"No entender, y no estar de acuerdo no es lo mismo. Tu no tenés una verdad universal con la cual venís a iluminar al resto, y si no lo entienden \"son unos negados\", no, tu tenés una opinión, que estás comparando con la del resto que te respondió.","replies":[]},{"poster":"WhiteMax","date":"2018-07-01T04:17:26.486+0000","up_votes":1,"down_votes":0,"body":"Se llama logica basica. Para que hubiera un 2do lugar minimamente tendrian que ser 3 equipos.","replies":[]}]}]}