{"poster":"Big Lincoln","date":"2017-05-03T00:04:11.787+0000","title":"\"Rammus needs too much work for a class update\"","subforum":"Gameplay","up_votes":70,"down_votes":18,"body":"\\*gets changes to his entire kit the patch immediately after*","replies":[{"poster":"Jeddy017","date":"2017-05-03T00:56:16.844+0000","up_votes":26,"down_votes":2,"body":"Well, these changes are probably meant to be some \"in the meantime\" love for Rammus till his inevitable VGU. Not meant to fully address his issues, but put him in a \"better\" spot till it's his turn.\n\nHe still needs work.","replies":[{"poster":"Meddler","date":"2017-05-03T01:55:36.586+0000","up_votes":46,"down_votes":6,"body":"That's our thinking here yeah. If we were putting a class update's worth of time into Rammus it'd be a much larger investment than this, we still wouldn't be able to address enough of his issues to get him out of someday VGU territory though.","replies":[{"poster":"Jeddy017","date":"2017-05-03T02:16:13.849+0000","up_votes":10,"down_votes":0,"body":"Just as a recap for ~~me~~ people who don't know, what are Rammus issues gameplay wise?","replies":[{"poster":"Skins Project","date":"2017-05-03T03:41:00.710+0000","up_votes":18,"down_votes":2,"body":"A bit too binary.\n\nHe was originally designed as an Anti-Ad\n\nI.E. if the opposing team had 5 ads it was INSTA win.\n\nHowever with the changes to armor pen/lethality that is no longer the case, and his kit is outdated and no longer fits in the the meta.\n\nSimply put.","replies":[]}]},{"poster":"LyingOnLine","date":"2017-05-03T01:56:49.483+0000","up_votes":9,"down_votes":4,"body":"Could we get a rundown of what these are supposed to _do_, though?\n\nBecause from what I've seen of them they actually look like nerfs to everything _except_ his cooldowns. The 60% self slow on W is particularly egregious.","replies":[{"poster":"Glory ln Death","date":"2017-05-03T04:10:54.376+0000","up_votes":8,"down_votes":2,"body":"Ummmmmmmm\n\nHave you seen his W changes? 20 + 70% Armor and MR? With 140 total Armor/MR he will get more bonus from the ability than his live W gives him. 300 Armor/MR just about gets him double the bonus from W. Plus, it's cooldown got drastically lowered. \n\nHave you seen his Q changes? It went from 155% movespeed at all ranks to 150% - 235% movespeed based on level.\n\nHave you seen his R changes? The damage to champions went down, yes, but he now slows anyone in the field and his damage to structures is actually higher than before, due to the x2 structure multiplier.\n\nMost of his changes are pretty significant buffs.","replies":[{"poster":"LyingOnLine","date":"2017-05-03T04:24:32.139+0000","up_votes":4,"down_votes":16,"body":"Ooooh, R does more structure damage after getting its **actual** damage nerfed. I'm sure that will compensate for _everything._\n\nQ's movespeed boost is worthless because movement speed has both soft and hard caps. What _is_ worth something is the fact that it lost a second of duration at all levels, meaning Rammus has less time to get around, covers less space, and _also_ deals less damage!\n\nWhen the fuck does Rammus realistically get to 140 Armor/MR? 1 item sure as hell isn't enough to do it. 2 items might get him there for Armor. Oooh, but wait, MR is a shit stat they're planning on shitting on anyway, so he'd have to build 2 MR items just to get to 140 MR. And on a jungler's budget, too. ~~What are you, retarded?~~ Sure sounds like a buff to me!","replies":[{"poster":"Glory ln Death","date":"2017-05-03T05:03:57.523+0000","up_votes":14,"down_votes":2,"body":"At level 9, if you level W first, Rammus has ~62 base armor. Including extra armor from runes and masteries, he only needs one item to hit 140. Yes, MR will take longer to get that (as a side note, MR is getting buffs in this update - there is more of it available, and crap items (Banshee's Veil) are actually becoming useful (Abyssal Scepter gives MR _and_ increases you and your allies' magic damage?!?!)), but tanks who can defend against any damage type just by virtue of their kit are generally unhealthy. \n\nWith these changes, Rammus can get massive amounts of Armor and MR, but he can't just immediately become unkillable to both physical _and_ magic damage - he has to choose which one he needs to defend against first. All this does is shift his power from midgame to late game, and gives him even more power there.\n\n>Q's movespeed boost is worthless because movement speed has both soft and hard caps. What is worth something is the fact that it lost a second of duration at all levels, meaning Rammus has less time to get around, covers less space, and also deals less damage!\n\nNo, there is no hard cap for movement speed. There is a soft cap, yes, but that begins at 415 movement speed, so his current Q is affected by the cap just as much. With the soft cap (no boots or speed modifiers) Rammus' current Q maxes at 490 movement speed. However, at level 18, the new Q will max at 623 movement speed. At level 9, the new Q will max at 548 movement speed. Because of the acceleration, he will go farther with the new Q once midgame hits, even though it is 1 second shorter.\n\n>Ooooh, R does more structure damage after getting its actual damage nerfed. I'm sure that will compensate for everything.\n\nOne of the biggest issues with tanks recently has been how much reliable damage they can do. The midseason update, and these Rammus changes to an extent, are trying to change that. Rammus is getting better tanking potential and increased utility in exchange for damage. He's a tank. He isn't supposed to go around murdering everyone. \n\nNot to mention, objectives are the main goal in League - you're supposed to destroy towers and, eventually, the Nexus. Bonus damage to structures is a big deal.","replies":[{"poster":"JedenVojak","date":"2017-05-03T10:42:54.166+0000","up_votes":3,"down_votes":11,"body":"> [{quoted}](name=Glory ln Death,realm=NA,application-id=3ErqAdtq,discussion-id=ssX8i89o,comment-id=000200000000000000000000,timestamp=2017-05-03T05:03:57.523+0000)\n>\n>... [T]anks who can defend against any damage type just by virtue of their kit are generally ~~unhealthy~~ **fun**.\n>\n> ...With these changes, Rammus ~~can get massive amounts of Armor and MR, but he can&#x27;t just immediately become unkillable~~ **will easily die** to both physical _and_ magic damage....\n>\n> One of the biggest ~~issues with tanks recently~~ **reasons tanks are fun** has been how much reliable damage they can do. The midseason update, and these Rammus changes to an extent, are trying to change that. Rammus is getting better tanking potential and increased utility in exchange for ~~damage~~ **his agency, and ability to fight and carry games**. He&#x27;s a tank ~~. He isn&#x27;t~~, **but he's also** supposed to go around murdering everyone. \n> \n> Not to mention... you&#x27;re supposed to destroy ~~towers and, eventually, the Nexus~~ **the souls of your enemies**.\n\nFixed that for you.","replies":[{"poster":"Glory ln Death","date":"2017-05-03T12:49:15.300+0000","up_votes":6,"down_votes":1,"body":"Fun to play, not fun to play against. As awesome as a Tank Meta sounds, it's not good for the game (I'm saying this as  a Sion main).","replies":[{"poster":"Meep Man","date":"2017-05-03T15:44:37.713+0000","up_votes":6,"down_votes":0,"body":"I think we will go into an artificial tank meta. As in, because everyone thinks we are in a tank meta, we WILL be in a tank meta.","replies":[]},{"poster":"Tobias Brackner","date":"2017-05-03T21:23:30.968+0000","up_votes":1,"down_votes":0,"body":"I'm not even sure how much a tank meta would be fun.  Sounds like it would be a lot of really long fights and really long games.","replies":[{"poster":"Glory ln Death","date":"2017-05-03T22:01:27.196+0000","up_votes":4,"down_votes":0,"body":"Two of my most enjoyable experiences in League were 1 min+ long fights as full tank Sion vs Poppy and Zac. Just these epic, 1v1 duels as beefy tanks dodging abilities, fighting to step on blobs and shields, managing minion aggro, etc. I would love to be able to have more of those!","replies":[{"poster":"Tobias Brackner","date":"2017-05-03T22:02:53.633+0000","up_votes":2,"down_votes":1,"body":"Okay yes those are really really fucking awesome.\n\nBut A whole 40 minute match of that?  Like...goddamn...","replies":[]}]}]}]},{"poster":"Whiteeye Avelyn","date":"2017-05-03T11:53:59.160+0000","up_votes":1,"down_votes":0,"body":"Every tank main on the boards in a nutshell.","replies":[{"poster":"JedenVojak","date":"2017-05-03T12:22:11.584+0000","up_votes":1,"down_votes":0,"body":"I don't think they would all fit... it would have to be a pretty big nut.","replies":[]}]}]}]}]},{"poster":"JedenVojak","date":"2017-05-03T10:32:09.642+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Glory ln Death,realm=NA,application-id=3ErqAdtq,discussion-id=ssX8i89o,comment-id=0002000000000000,timestamp=2017-05-03T04:10:54.376+0000)\n>\n> Ummmmmmmm\n> \n> Have you seen his W changes? 20 + 70% Armor and MR? With 140 total Armor/MR he will get more bonus from the ability than his live W gives him. 300 Armor/MR just about gets him double the bonus from W. Plus, it&#x27;s cooldown got drastically lowered. \n\nYeah, it's worse early and better late. Also the damage from the thorns has been nerfed quite a bit - he would need 700 armor at lv 18 to equal the live damage at skill rank 5, lv 11. Also he slows himself now while using it.\n\n> Have you seen his Q changes? It went from 155% movespeed at all ranks to 150% - 235% movespeed based on level.\n\nQ is an interruptible channel now, and got a 40% damage nerf, as well as a halved slow duration.\n \n> Have you seen his R changes? The damage to champions went down, yes, but he now slows anyone in the field and his damage to structures is actually higher than before, due to the x2 structure multiplier.\n\nBut the damage to champions isn't just down, it's WAY WAY down. Down by over a third. That is not something to just dismiss, given it's his Ultimate.\n\n> Most of his changes are pretty significant buffs.\n\nExcept the parts which are pretty significant nerfs, the main problem being that he won't deal anywhere near enough damage.","replies":[{"poster":"Glory ln Death","date":"2017-05-03T13:16:45.692+0000","up_votes":3,"down_votes":1,"body":">Yeah, it's worse early and better late. Also the damage from the thorns has been nerfed quite a bit - he would need 700 armor at lv 18 to equal the live damage at skill rank 5, lv 11. Also he slows himself now while using it.\n\nThe thorns damage is equal at 300 armor (current: W gives 120 additional armor for 420 total, Damage = 65 + 42 (10%) = 107 damage; new: W gives 230 additional armor for 530 total, Damage (lvl 18) = 20 + 53 (10%) = 73 x 1.5 = 109.5 damage). His passive deals 150% damage during W. I do agree that the slow is probably too high, and should at least be lowered to maybe 20-30%, if they _have_ to keep it.\n\n>Q is an interruptible channel now, and got a 40% damage nerf, as well as a halved slow duration.\n\nThe slow amount was also doubled, and its hitbox and collision detection were cleaned up.\n\n>But the damage to champions isn't just down, it's WAY WAY down. Down by over a third. That is not something to just dismiss, given it's his Ultimate.\n\nAnd he also gets a stacking slow on his ult, up to 64/80/96%, which is nothing to dismiss, either.\n\n>Except the parts which are pretty significant nerfs, the main problem being that he won't deal anywhere near enough damage.\n\nHe is losing upfront damage for more utility and pretty significantly higher tanking potential late game. There are tanks like Sejuani and Sion that are meant to be able to deal massive damage in certain situations, but Rammus is really meant to be a more tanky tank. \n\nThere are issues - the 60% self slow seems _way_ too high, especially after trying it on PBE, and the attack speed buff during his taunt seems... out of place. I'm not really sure why he wants an attack speed boost, especially when his W will slow him too much to make use of it after the taunt has ended. The lowered Q, passive, and thorns damage in the early game is also a bit worrying for his early clears, but they can probably fix that with a \"X% bonus damage to monsters\" on his passive if it's an issue.","replies":[{"poster":"JedenVojak","date":"2017-05-03T20:32:57.768+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Glory ln Death,realm=NA,application-id=3ErqAdtq,discussion-id=ssX8i89o,comment-id=000200000000000000020000,timestamp=2017-05-03T13:16:45.692+0000)\n>\n> The thorns damage is equal at 300 armor (current: W gives 120 additional armor for 420 total, Damage = 65 + 42 (10%) = 107 damage; new: W gives 230 additional armor for 530 total, Damage (lvl 18) = 20 + 53 (10%) = 73 x 1.5 = 109.5 damage). His passive deals 150% damage during W. I do agree that the slow is probably too high, and should at least be lowered to maybe 20-30%, if they _have_ to keep it.\n\nAh yes, I forgot to factor the extra armor into his damage. Still, he slows himself, which makes the ability bad (self CC is always bad).\n\n> The slow amount was also doubled, and its hitbox and collision detection were cleaned up.\n\nA double slow value is never worth a halved duration.\n\n> And he also gets a stacking slow on his ult, up to 64/80/96%, which is nothing to dismiss, either.\n\nThe ult is not going to stack, because everyone has access to a million leaps, dashes, flashes, and if they stand in it, it's only going to tickle now.\n\n> He is losing upfront damage for more utility and pretty significantly higher tanking potential late game. There are tanks like Sejuani and Sion that are meant to be able to deal massive damage in certain situations, but Rammus is really meant to be a more tanky tank. \n\nRammus is not supposed to be just \"a tanky tank\" he's supposed to be \"hey guys, come kill yourselves\". He needs to be able to 1v5 the enemy team, because that's what's fun. He's losing utility (lower slow duration on Q, self slowing), gaining less attack damage (because he just gets less damage off of his passive), losing ult damage AND Q damage just to get a slow on his ultimate - that's garbage.\n\nAs a melee champion, losing damage is NEVER worth it, unless you're becoming 100% unkiteable and I'm highly skeptical if this Rammus could even 1v1 carries.","replies":[]}]}]}]}]},{"poster":"Very Hard Engage","date":"2017-05-03T02:30:50.065+0000","up_votes":8,"down_votes":7,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=ssX8i89o,comment-id=00020000,timestamp=2017-05-03T01:55:36.586+0000)\n>\n> That&#x27;s our thinking here yeah. If we were putting a class update&#x27;s worth of time into Rammus it&#x27;d be a much larger investment than this, we still wouldn&#x27;t be able to address enough of his issues to get him out of someday VGU territory though.\n\nthis is a  gutting designed to keep hyper mobile AD auto reset threats in play.\n\nwe know your true motive here. you cant afford another 60% win rate champ due to item changes (despite having been previously a 55% win rate champ and has seen nothing but nerfs for 4 years) but win rate continues to rise as the meta heavily favors AD auto champs. \n\n(was he broken 4 years ago? nope, but you made the meta do so) \n\ndo us a solid and revert the W change. at the MINIMUM. needs that flat armor and punishment capability. \n\npassive could be forgiven, but not really. he also needs the AD to be capable of dealing damage himself against ADC's, the fact that you want some of it to be magic damage only goes to show you further want to cripple his damage output and make him super vulnerable to hexdrinker/QSS.\n\nrammus doesn't need atk speed as his auto animation is terrible and all of his abilities interrupt his own auto attack. so actually giving him lower cooldowns is more of a hindrance because they have cast times attached. ","replies":[{"poster":"Glory ln Death","date":"2017-05-03T04:20:11.879+0000","up_votes":4,"down_votes":2,"body":"His W is way, way stronger now, though...","replies":[{"poster":"Jorencice","date":"2017-05-03T04:44:52.903+0000","up_votes":6,"down_votes":4,"body":"It's a 60% slow TO HIMSELF which would put him around 160-200 MS.\n\n There isn't a single adc in the game that couldnt EASILY kite rammus in circles while he's slowed.\n\nHell most of them could interrupt his Q AND dash out of his ult making all the slows he got worthless.\n\nAnd with 500 Armor his W will do like 100 magic damage a hit. If they have a hexdrinker it will be even less damage like 50 and that's WITH the bonus from his W.","replies":[{"poster":"Glory ln Death","date":"2017-05-03T05:17:43.686+0000","up_votes":6,"down_votes":2,"body":"That's why he has a taunt, the initial slow on his Q, and the stacking slow on his ult - which can stack up to 64/80/96%. 60% may well be too much for his self-slow, still, and I wouldn't be surprised if they changed it (remember, this is the PBE, things change).\n\nAt 300 Armor, Rammus' current W boosts him to 420 armor and deals 107 damage per hit. His new W boosts his Armor to 530 and deals 109 damage per hit.\n\nHexdrinker means they'll take 66 damage per hit, just from your W. However, you only take 16% damage during that time. They would need to be doing over 400 damage per auto to out-damage you (assuming they don't have Last Whisper/Black Cleaver/Lethality, of course).","replies":[{"poster":"Chønklord","date":"2017-05-03T10:51:36.715+0000","up_votes":3,"down_votes":2,"body":"> assuming they don't have Last Whisper/Black Cleaver/Lethality, of course\n\nBecause _no one_ builds _those things_ anymore, ever.....\n\n/s","replies":[{"poster":"macromite","date":"2017-05-03T14:52:13.532+0000","up_votes":3,"down_votes":1,"body":"those did all receive nerfs, so...","replies":[]}]}]}]}]},{"poster":"macromite","date":"2017-05-03T03:31:37.350+0000","up_votes":1,"down_votes":0,"body":"attack speed w seems ok to me","replies":[{"poster":"MetalGearTeemu","date":"2017-05-03T03:51:30.970+0000","up_votes":1,"down_votes":0,"body":"It just makes it easier for your to survive if you somehow get caught by the new Garen'ized rammus. Has riot spiked their coffee or something to where the only champions they think have mobility problems are the ones without low cooldown jumping gapclosers.","replies":[{"poster":"macromite","date":"2017-05-03T14:49:05.503+0000","up_votes":2,"down_votes":0,"body":"pardon?","replies":[]}]}]}]},{"poster":"Votable Jester","date":"2017-05-03T05:14:47.401+0000","up_votes":3,"down_votes":0,"body":"Just something I noticed.  With the passive change (to an on-hit damage), he seems like he'll lose a lot of tower damage unless he's using his ult for that.  Is there any way to make the passive apply to structures as well?","replies":[]},{"poster":"Big Lincoln","date":"2017-05-03T02:05:59.644+0000","up_votes":8,"down_votes":6,"body":"i think these changes are fairly solid, actually. there's a lot more nuance to him with managing his new W, but he's still the same champion. he feels pretty nice to play, i think most of the issues I have with him now are just the numbers. \n\nmore of your updates should be like what Rammus is getting ahmmMmmmmmmmmm{{champion:113}}","replies":[]},{"poster":"Slythion","date":"2017-05-03T23:46:27.815+0000","up_votes":1,"down_votes":0,"body":"Is this gonna be the thought process with Aatrox, or will he be tackled in the Diver update (I know it's far away, but have you guys made any plans for that update yet). \n\nOr maybe Aatrox is fine? I just want to know your thoughts tbh","replies":[]},{"poster":"The Yetii Rider","date":"2017-05-03T17:04:09.271+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=ssX8i89o,comment-id=00020000,timestamp=2017-05-03T01:55:36.586+0000)\n>\n> That&#x27;s our thinking here yeah. If we were putting a class update&#x27;s worth of time into Rammus it&#x27;d be a much larger investment than this, we still wouldn&#x27;t be able to address enough of his issues to get him out of someday VGU territory though.\n\nI can certainly understand how, from a balance standpoint, an AS buff is better than reducing armor and his passive dealing magic damage on hit will help his jungle clear. \n\nIt just really seems to clash with his current quiet, mellow personality. In a big way. Rammus is the last champ in the league that I would expect to \"frenzy\".","replies":[]}]}]},{"poster":"Rıots Bad Client","date":"2017-05-03T04:20:47.981+0000","up_votes":14,"down_votes":0,"body":"I always wanted rammus have a tact on tool where if he bumps into a creep, instead of just doing his current thing which is just a minor knock back. \nI want him to ramp off the creep doing a sick jump, and can't change his movement in the air, but can still hit champions. \n\nI just want a mega-Bm rammus take sick jumps in my lane; blasting his mastery 7, and just leave the lane without actually doing anything.\n\nAND, If you want it more serious. \nAfter his sick ass jump, you can have a his tremor apply once opon landing(Depending on what rank he has) \n(You can't jump off blue/Red Buff, baron and dragon, But you you should be able to ramp off gromp)","replies":[{"poster":"x0wolfie0x","date":"2017-05-03T19:40:40.074+0000","up_votes":3,"down_votes":0,"body":"I have never wanted anything more in my life, take my upvote \n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Tobias Brackner","date":"2017-05-03T21:25:25.867+0000","up_votes":1,"down_votes":0,"body":"This would be the sickest fucking thing.","replies":[]}]},{"poster":"58697132DEL1","date":"2017-05-03T05:03:36.847+0000","up_votes":1,"down_votes":0,"body":"I can't wait to go full ap","replies":[{"poster":"Sp33d Zer0","date":"2017-05-03T15:52:59.447+0000","up_votes":1,"down_votes":0,"body":"It got significantly nerfed.","replies":[{"poster":"58697132DEL1","date":"2017-05-03T15:58:11.014+0000","up_votes":8,"down_votes":0,"body":"I can't wait to go full ap","replies":[]}]}]},{"poster":"JedenVojak","date":"2017-05-03T02:03:27.783+0000","up_votes":10,"down_votes":2,"body":"I could be wrong, but the Rammus changes just seem in all ways as a gutting of the champion. I don't really get why, tbh.","replies":[{"poster":"RainbowIcee","date":"2017-05-03T03:43:33.397+0000","up_votes":2,"down_votes":1,"body":"I enjoy playing rammus top, now i won't. He was a mixed damage champ now converted to AP melee damage. The one thing AD champs can build to fight against pretty well. Not only that but he doesn't lower Armor/MR anymore so this is pretty much shitting on his damage. He is just a utility bot now. Lastly you can cancel his powerball.","replies":[{"poster":"Sp33d Zer0","date":"2017-05-03T15:50:52.914+0000","up_votes":1,"down_votes":0,"body":"The removal of Armor/MR is rough, but he does get more attack speed now, and with his w up, the damage from his passive gets increased 150%, gets a higher value because he has more armor, and since the only time you taunted was with your w up, he gets an increased attack speed with the 150% bonus as well.","replies":[{"poster":"RainbowIcee","date":"2017-05-03T21:49:57.337+0000","up_votes":1,"down_votes":0,"body":"This is not going to work out in fights but i know what it's going to be abused for. It says he just gains Atk speed not just towards the target but in general, and double dmg to structures. Soooo he's probably going to become a demolishes. A split pusher if you will, and riot is not fond of split pushers yet this feels like it's encouraging it. If it does become viable it's not gonna last, he's gonna get nerfed after and just kept this way. This is why I hate riot experiments. But i look at this new rammus and i just want to abuse his structure damage and ATK speed buff on a minion to do so.","replies":[]}]},{"poster":"OtterlyLost","date":"2017-05-03T12:55:27.246+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RainbowIcee,realm=NA,application-id=3ErqAdtq,discussion-id=ssX8i89o,comment-id=00030000,timestamp=2017-05-03T03:43:33.397+0000)\n>\n> Lastly you can cancel his powerball.\n\n:( I admit, I was upset by this too. I mean, its the same principle as Udyr's bear stance and you can't cancel *that.* Or Olaf's Ult or Voli's charge. All of these champions just run straight at you and rely on being too fast for you to react. Being able to cancel his powerball now means that Rammus can't do that anymore; how is he meant to get on top of people? These changes they made to him really do seem like *massive* nerfs.","replies":[]}]}]},{"poster":"Critmaster Garen","date":"2017-05-03T12:01:16.037+0000","up_votes":2,"down_votes":1,"body":"> Maximum movement speed adjusted from 155% to 145+5% per level\n\nwoooow.\n\ndoes that actually mean 235% movement speed at lvl 18?\n\nsanic pls.","replies":[{"poster":"Robert Smith","date":"2017-05-03T14:24:04.087+0000","up_votes":1,"down_votes":0,"body":"per skill level. So a max of 170% now.","replies":[{"poster":"Critmaster Garen","date":"2017-05-03T15:35:56.753+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=RobobertSmitty,realm=NA,application-id=3ErqAdtq,discussion-id=ssX8i89o,comment-id=000a0000,timestamp=2017-05-03T14:24:04.087+0000)\n>\n> per skill level. So a max of 170% now.\n\nmeh. most people refer to abilitiy levels just as \"ranks\". shame tho. that would have been funny.","replies":[]}]},{"poster":"Sp33d Zer0","date":"2017-05-03T15:51:52.184+0000","up_votes":1,"down_votes":0,"body":"I've seen a REALISTIC rammus build (not just a full move speed build) hit about 2.2k Move speed.\n{{item:3117}} {{item:3742}} {{item:3800}} {{item:3075}} {{item:3065}}  and gargoyle plate\n","replies":[]}]},{"poster":"SpookyNeedle","date":"2017-05-03T04:36:20.206+0000","up_votes":3,"down_votes":0,"body":"Ok","replies":[]},{"poster":"Popperofski","date":"2017-05-04T00:58:04.350+0000","up_votes":2,"down_votes":0,"body":"Don't fucking touch my armor turtle riot. He's fine.","replies":[]},{"poster":"Miror B","date":"2017-05-03T02:23:54.542+0000","up_votes":2,"down_votes":0,"body":"For me, the big problem with rammus is that Malphite exists and brings more utility as a tank than he does. Although his current-patch kit as a few niche options (the ability to chase enemies down lane and the ability to get a surprisingly scary attack stat through armor hoarding), malph doesn't actually get punished that hard for building an MR item compared to rammus (as AP on malph is never a bad thing while asking rammus to build a spirit visage is like putting bicycle tires on a hummer). For a potential rework, I'm thinking they could expand on the whole \"resistances=offensive stats\" thing, or more accurately make his passive be that he not only gains attack from armor (would be reduced to accomidate the next thing) but also give him AP from MR stacking. Then hybrid builds could potentially be a thing, and if done right he could go back to being that incredibly annoying sandshrew that people have been waiting for for years.","replies":[]}]}