{"poster":"Jojobees","date":"2019-12-13T02:08:24.864+0000","title":"Coming up on 4 year anniversary of my permanent ban.","subforum":"Player Behavior","up_votes":5,"down_votes":7,"body":"Hello Summoners, it's me, Jojobees. Before you say anything, let me explain. I was permanently banned for being toxic. Was I toxic? Oh boy, was I ever. I was the second most toxic player I knew. I was so toxic, that even though I had two accounts, I got them both banned a month between each other. (My other account being TheForumGhost)\n\nI'm not here to argue that I was wrongly banned, because I wasn't. I'm not here to post chat logs or make excuses for my behavior. I am here to explain the effects of a permanent ban from the player's perspective, and appeal for my release.\n\nI knew that I was going to be permanently banned, and I did a few things to stall this. First, I tried muting everyone with the /mute all command. This didn't work because as soon as I made a mistake I just 'knew' my team was flaming me for it. I unmuted everyone to see what they were saying, and I flamed them for flaming me.\n\nThen, since that didn't work. I tried using a program called AHK (Autohotkey) to disable my enter key in chat, and I dragged the chat bar off my screen in game. This didn't work either, in the same way that chat restrictions didn't work for me. Both of these things just made me more angry as I let my toxicity build up and when I finally did get that message (in the case of a chat restrict) or I caved and alt-tabbed to close out of AHK, I was frothing with toxicity and I let it all out.\n\nSo I got banned. I got banned because I was toxic in chat. I got banned because I didn't have the self-control to keep AHK enabled, because I 'had' to know what my team was saying about me, and I got banned because I was an immature 18 year old 'kid' with raging hormones who couldn't keep himself from saying rude things in a videogame.\n\nNone of the things that I tried to do worked. None of the safeguards I had used to prevent myself from being toxic were strong enough to hold my toxic behavior back. But you know what worked? The ban hammer. The ban hammer worked.\n\nWhen my accounts got banned I cried. There I was, an 18 year old guy in college crying.\nI cried for days. I cried whenever I even thought about the game. I even had a few tears fall down my cheek writing this post.\n\nI took a hiatus from League of Legends for a few months, but it's too good of a game, I couldn't keep myself away from the competitive nature of the game. I made a few new accounts, just in case I got banned again, and I didn't spend any money on any of them for the same reason. But a few things happened. At first, anytime I wanted to say anything toxic I would think about my banned accounts, and how time-consuming leveling my new accounts was, and I wouldn't say anything. But given time, I also matured.\n\nAt this point it's been almost 4 years since my first permaban, I've opened at least two ban appeals every year for each account, and I just keep getting copy-pasted responses from the support agents. I've seen a couple unban experiments completely pass me over.\n\nHere's the thing though. League of Legends will always trigger some nostalgia in me for my old accounts. The accounts that started my adventure into this game. I shouldn't care, because I have three accounts that will never be permanently banned, but I do care. I put time, effort and money into those first accounts. I'm attached to them. They feel to me like a child that I lost in a custody battle with RIOT. So here's my suggestion, you can take it or leave it. I petition that one month bans should not be the last step before a permanent ban. I feel that a month is not nearly long enough for the maturation process.  I can't find the quote but RIOT has stated something like 'Permanent bans are only used when we believe that the player is not capable of reforming'. Well I proved that wrong, but it took me a lot longer than two weeks, or one month. So my suggestion is maybe a year, or a two-year suspension.\n\nIf you want a more personal story about where I was in my life at the time please refer to my last post on my permanent ban, 11 months ago here https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/BU2nPpJA-i-was-toxic-almost-three-years-ago-this-is-my-story","replies":[{"poster":"XVI Jake IVX","date":"2019-12-13T03:40:22.301+0000","up_votes":4,"down_votes":0,"body":"I don't understand why this post is being downvoted. It's not like he is flaming. He is having a civil conversation. O well.","replies":[]},{"poster":"XVI Jake IVX","date":"2019-12-13T02:23:47.341+0000","up_votes":4,"down_votes":0,"body":"I think a 2 week ban is fair. Riot gives you multiple chances to reform. The first is with chat restrictions. Than the final straw two week ban. You should reform be attempting to reform. If I was you I would of reached out to the player behavior and asked for advice. Back in 2010. I got banned for being extremely toxic for 7 days. I did learn my lesson for a short amount of time ,but became toxic again. However, When I saw the 14 day ban ,and I read it. I realize I had to reform. So I stopped being toxic. I started being friendly. To this day I'm not toxic. Every now in than I'm occasionally toxic ,but not enough to get banned or chat restricted.\n\nHeres what I do to prevent myself from being toxic: Take breaks from between games. I use to use a stressball. Chew gum. Play normals to detilt from rank. I stay hydrated and make sure I get my sleep so I have patience with the summoners. I understand some players may be having a bad day ,so I don't flame them.","replies":[{"poster":"Jojobees","date":"2019-12-13T02:35:11.460+0000","up_votes":3,"down_votes":3,"body":"It's not about whether or not it's fair, and it's not about whether or not two weeks is long enough for you personally to reform. Neither of those is the question I asked.\n\nIn fact, you said yourself that after the 7 day ban, you became toxic again, which means for you personally, the first ban you got was not long enough to reform. For both my accounts in 2015, the first ban they got was the two week, and that was not long enough for me to reform either.\n\nThat said, you do have some good points on how to detilt and manage your toxicity, and I'll give you an upvote so that others can see your suggestions and maybe they will help someone deal with their toxicity.\n\nPersonally I do still get tilted, but toxicity is not the result anymore. I'll typically see my gameplay suffer, or I'll see myself thinking a game is a loss before we even get in game when I'm tilted. And when that happens I find that switching accounts can help, or when that fails, I'll just play normal games or quit for the day.","replies":[{"poster":"XVI Jake IVX","date":"2019-12-13T02:42:11.305+0000","up_votes":2,"down_votes":0,"body":"They only really gave like 2 chances back than though. 7 day ban. 14 day. Permaban. I believe. I could be wrong. If I would of gotten a 14 day ban I would of still hopefully reformed. Do you have an account on League so I can friend you? If not it's cool. :) \n\nEdit: Honestly I don't see someone reforming over the course of 2 years ,but if imo it would just be easier to make another account. ","replies":[{"poster":"Jojobees","date":"2019-12-13T02:46:14.711+0000","up_votes":1,"down_votes":2,"body":"I don't know what they did back then but I never really took the chat restrictions seriously. If I had gotten a 7 day ban and then a 14 day ban I might have taken the first ban more seriously, and it may have actually helped more than the chat restriction, but I really believe it took me the rest of that year to truly reform, which is why I'm petitioning for longer ban periods before a permanent ban. I'm hoping that players will reform within a year rather than two weeks. I'll send you a friend req. on my current main account and maybe we can play or talk. You seem like a cool dude.","replies":[{"poster":"XVI Jake IVX","date":"2019-12-13T02:57:22.478+0000","up_votes":2,"down_votes":0,"body":"That's what went wrong. You didn't treat your previous punishments seriously enough. The 14 day ban though should be the scare. If I knew I could be toxic and be unban in a year. (That sadly can give me incentive to be toxic) Not saying I would.\n\nBy the way: Add Atormsul or TrashTrynd. My league is friendslist is bugged unfortunately. If it says \"players friendslist is full \" or just put your summoner name in the forums and I'll add you :D","replies":[]}]}]}]}]},{"poster":"Subdue","date":"2019-12-13T06:26:02.218+0000","up_votes":3,"down_votes":0,"body":"Given that permabanned players are already provided the leniency of being able to create a new account and continue playing, why would they deserve to get their accounts back after repeated warnings to change their behavior?","replies":[{"poster":"Jojobees","date":"2019-12-13T06:31:16.852+0000","up_votes":1,"down_votes":2,"body":"Given that some people in prison are repeat offenders, why would they deserve to have a release date?\n\nSimply put, because people change given time. I have reformed and I have known many other players who have reformed. And when I say reformed what I really mean is I grew the fuck up and stopped being toxic.","replies":[{"poster":"Subdue","date":"2019-12-13T06:55:03.510+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jojobees,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=00090000,timestamp=2019-12-13T06:31:16.852+0000)\n>\n> Given that some people in prison are repeat offenders, why would they deserve to have a release date?\n> \n> Simply put, because people change given time. I have reformed and I have known many other players who have reformed. And when I say reformed what I really mean is I grew the fuck up and stopped being toxic.\n\nUh, when you're released from prison, that doesn't mean the job you had before you went in is waiting for you.  Most people don't just pick right back up where they left off.  They start over.\n\nBesides, the analogy falls flat because League of Legends isn't life and a permanent ban from a video game is not prison.  While conceptually both are crime and punishment, the context of each is widely different and extremely significant.","replies":[{"poster":"Jojobees","date":"2019-12-13T07:20:15.233+0000","up_votes":1,"down_votes":2,"body":"Most people don't reform in League of Legends. 1 in 20 do. Does that mean that the 1 should be punished for the 19 who don't follow the rules?","replies":[{"poster":"Subdue","date":"2019-12-13T07:26:15.443+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jojobees,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=0009000000000000,timestamp=2019-12-13T07:20:15.233+0000)\n>\n> Most people don't reform in League of Legends. 1 in 20 do. Does that mean that the 1 should be punished for the 19 who don't follow the rules?\n\nAll 20 are punished the same way for the same crimes.  If the 19 keep creating new accounts and keep behaving in a toxic way, they'll keep getting banned.  If they create new accounts and they behave themselves, they won't keep getting banned.","replies":[{"poster":"Jojobees","date":"2019-12-13T07:34:22.389+0000","up_votes":1,"down_votes":2,"body":"Yep :) I don't get banned anymore. I have 3 accounts that have never received punishments and I have had them ever since after the two permanent bans 4 years ago. I shouldn't care about this account anymore but I do so where's my unban?","replies":[]}]}]}]}]}]},{"poster":"OneMustFall","date":"2019-12-13T02:44:56.326+0000","up_votes":2,"down_votes":0,"body":"If two weeks away from the game isn't a big enough wake up call that you need to change your behavior or your account is toast, then you can only blame yourself. Two weeks is a long time to suddenly be cut off from playing a game especially if you play multiple games a day. I got a 10 game chat restriction earlier this year and I disabled chat for three months until I felt I could handle looking at it again. I got back to Honor Level 4 by the end of the season. Sometimes it takes more than that for people to get it. Sometimes it's getting a two week suspension. Sometimes people actually have to have an account banned before it hits them. You're given plenty of opportunities to reform before you get banned, what you do with those opportunities is up to you.","replies":[{"poster":"Jojobees","date":"2019-12-13T02:51:09.324+0000","up_votes":1,"down_votes":2,"body":"Good for you. I'm glad that you were able to reform given only a chat restriction and I hope that you're able to continue to behave honorably in game because losing an account sucks (here I am 4 years later still mourning the loss of my account xD). Unfortunatly I was immature and it wasn't really about wake up calls for me. It was about growing up. And growing up takes more than a chat restriction or a ban in a videogame, it takes life experiences and time.\n\nEdit: Also, I didn't take the two weeks off of the game because I had another account. I took the two weeks to level up my second account that also got permabanned in the same timeframe.","replies":[{"poster":"rujitra","date":"2019-12-13T03:32:15.333+0000","up_votes":2,"down_votes":1,"body":"That’s your fault. You didn’t take it seriously. Not riots problem.\n\nYou also say yourself that you didn’t care about the 2 week ban because you had another account. Why would lengthening the ban change this?","replies":[{"poster":"Jojobees","date":"2019-12-13T03:37:05.334+0000","up_votes":1,"down_votes":2,"body":"Because it wasn't about how many warnings I got. It was about time. Change takes time.","replies":[{"poster":"rujitra","date":"2019-12-13T04:35:51.036+0000","up_votes":1,"down_votes":0,"body":"You’re free to take time off if you feel you need it. Riot didn’t force you to keep breaking the rules in game and they gave you more than enough time to reform.","replies":[{"poster":"Jojobees","date":"2019-12-13T05:40:59.815+0000","up_votes":1,"down_votes":2,"body":"I didn't feel that I needed it though. That's why I'm suggesting a 1 or 2 year ban either in addition to or in place of the 2 week ban. At the time I felt like the ban was unfair and unnecessary. It just took me a year to change as a person to understand what I was doing wrong. People don't change overnight. Change takes time.","replies":[]}]},{"poster":"CharDeeMcDenniz","date":"2019-12-13T03:41:19.489+0000","up_votes":3,"down_votes":2,"body":"it's not RIOTs job to be your therapist and make sure you grow up prim and proper over months and months\n\nit's RIOTs job to make rules and enforce punishments when the **EXTREMLY FUCKING SIMPLE** rules are broken","replies":[{"poster":"Jojobees","date":"2019-12-13T03:50:04.080+0000","up_votes":2,"down_votes":3,"body":"Two things. First, this is a civil discussion and there's no reason to get angry about it and shout profanity in all caps.\nSecond, tell me the rules are extremely simple again after you've actually read them. https://na.leagueoflegends.com/en/game-info/get-started/summoners-code/\n\nEdit: Three things actually, third, RIOT's 'job' is to make a game and make the game fun. They get paid by people who enjoy the game supporting them through in-game purchases. If we want to get into that, I'd argue that I personally would have spent more money on the game if I still had my first account and I would still have my account if I got a 1 year ban instead of a permanent ban because it was 4 years ago and I haven't gotten a single punishment since then, and I also haven't spent a single cent on the game since my permanent ban. So you're wrong, you're wrong, and you're wrong. And on top of that you're disrespecting the civil conversation we're having by using profanity and all caps.","replies":[{"poster":"CharDeeMcDenniz","date":"2019-12-13T04:02:26.783+0000","up_votes":2,"down_votes":1,"body":"well considering my profanity was directed at literally no one, I find it funny you're that bothered by it. The caps and boldness were meant for emphasis as I feel you're glossing over that very important point.\n\nand you can say \"you're wrong\" all you want to but I'm not lol. \n\nThe rules ARE simple and it's silly to expect RIOT to give everyone as many chances as they want, or change the rules bc of your specific circumstance. The are a business out to make money, not a psychiatrist office out to make sure everyone reforms up to their standards.","replies":[]}]}]}]}]}]}]},{"poster":"Prandine","date":"2019-12-13T03:58:40.756+0000","up_votes":3,"down_votes":1,"body":"While an argument could be made for an extra tier in-between 2-week and permaban, such as 1-month, I don't think a year or two is the right call, nor do I believe unbanning validly permabanned accounts is the right call because they would ultimately solve nothing. Why? Because people could just play on another [disposable] account(s) until their main one is unbanned, since there would be no lasting penalty for consistent misbehavior. Also, I feel a year+ is too long since by that time they may have already forgotten about the account and/or behavior and/or moved onto other games.\n\nUltimately while I do believe in second and sometimes third chances, the line has to be drawn somewhere. If someone despite the warnings still chooses to misbehave then they should no longer be allowed access to that particular place or item, which in this case is the League of Legends game. It's unfortunate but there has to be some lasting penalty to serve as a reminder of the consequences of consistent/egregious misbehavior.","replies":[{"poster":"XAltinaOrionX","date":"2019-12-13T05:30:43.777+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Prandine,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=0005,timestamp=2019-12-13T03:58:40.756+0000)\n>\n> While an argument could be made for an extra tier in-between 2-week and permaban, such as 1-month, I don't think a year or two is the right call, nor do I believe unbanning validly permabanned accounts is the right call because they would ultimately solve nothing. Why? Because people could just play on another [disposable] account(s) until their main one is unbanned, since there would be no lasting penalty for consistent misbehavior. Also, I feel a year+ is too long since by that time they may have already forgotten about the account and/or behavior and/or moved onto other games.\n> \n> Ultimately while I do believe in second and sometimes third chances, the line has to be drawn somewhere. If someone despite the warnings still chooses to misbehave then they should no longer be allowed access to that particular place or item, which in this case is the League of Legends game. It's unfortunate but there has to be some lasting penalty to serve as a reminder of the consequences of consistent/egregious misbehavior.\n\nAs i stated before in my other posts I got 2, 14 day suspensions 14 days apart after 1 int fed game along with toxic words. Yet my first ever  account had 1 int feeding game on purpose and perm banned just like that, funny fact 4 mths of not playing  league on that account and yet still got perm banned.  So I think if you spend lots money on RP you will get perm banned quicker. Its how i see  given my age i had to test it out.","replies":[{"poster":"Prandine","date":"2019-12-13T20:22:44.655+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XAltinaOrionX,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=00050002,timestamp=2019-12-13T05:30:43.777+0000)\n>\n> As i stated before in my other posts I got 2, 14 day suspensions 14 days apart after 1 int fed game along with toxic words. Yet my first ever  account had 1 int feeding game on purpose and perm banned just like that, funny fact 4 mths of not playing  league on that account and yet still got perm banned.  So I think if you spend lots money on RP you will get perm banned quicker. Its how i see  given my age i had to test it out.\n\nThe thing is for an account to get back in good standing you have to actually play on it and show that your behavior has improved. If you didn't play on it for 4 months and then showed punish worthy behavior in your next game or two on the account, the IFS just assumes that your behavior hasn't improved since your last punishment and assigns you the next available one. I get how that can be annoying but it's there to prevent people from trying to game the system by going inactive on the account then come back X later and still behaving like they did before they went inactive.\n\nAlso, I've spent quite a bit of money on RP myself and have yet to receive any type of warning or punishment. I'm not a saint by any means and I do have a temper but I don't intentionally try to screw over my teammates by trolling, inting or flaming them (I just yell and rage at the screen instead), so the idea that spending money=a faster ban rate is honestly quite ridiculous.","replies":[{"poster":"XAltinaOrionX","date":"2019-12-14T03:07:17.798+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Prandine,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=000500020000,timestamp=2019-12-13T20:22:44.655+0000)\n>\n> The thing is for an account to get back in good standing you have to actually play on it and show that your behavior has improved. If you didn't play on it for 4 months and then showed punish worthy behavior in your next game or two on the account, the IFS just assumes that your behavior hasn't improved since your last punishment and assigns you the next available one. I get how that can be annoying but it's there to prevent people from trying to game the system by going inactive on the account then come back X later and still behaving like they did before they went inactive.\n> \n> Also, I've spent quite a bit of money on RP myself and have yet to receive any type of warning or punishment. I'm not a saint by any means and I do have a temper but I don't intentionally try to screw over my teammates by trolling, inting or flaming them (I just yell and rage at the screen instead), so the idea that spending money=a faster ban rate is honestly quite ridiculous.\n\n20$ is nothing right now on this account, but I said  a lot of things worth a chat restriction ban.  It's a called a negative impulse buy, if Riot sees a lot of spending all at once and if reports flow in as well Riot system will ding that person. Almost like you got destroy by {{champion:203}} last game that made you tilt, so your reaction is \"impulse buy\" that champion and banned it.","replies":[]}]}]},{"poster":"XVI Jake IVX","date":"2019-12-13T04:05:18.967+0000","up_votes":1,"down_votes":0,"body":"I know this comment may get removed ,but can you accept my friend request? :D If not it's cool :)","replies":[{"poster":"Prandine","date":"2019-12-13T20:12:38.622+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XVI Jake IVX,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=00050000,timestamp=2019-12-13T04:05:18.967+0000)\n>\n> I know this comment may get removed ,but can you accept my friend request? :D If not it's cool :)\n\nSorry but I don't like adding random people that I don't know, it's nothing personal. I like to try to get to know someone first before adding them, that way I can see if they want to add me for who I am as a person and not just for the stuff I have/because I'm a high level.","replies":[{"poster":"XVI Jake IVX","date":"2019-12-13T21:12:12.045+0000","up_votes":1,"down_votes":1,"body":"Your not high level imo. xD I been playing since 2010 and have almost all champions + all runes (back when they had runes I did have all runes.) + all skins on the champs I play (Which is literally tryndamere). I wanted you to add me because I needed to discuss something with you ,and you seem cool ,but its fine. Than play league with you. Now if your toxic I'll just remove you. I don't even ask for skins. And how can you get to know someone if your not willing to add them? {{sticker:sg-soraka}}","replies":[{"poster":"Prandine","date":"2019-12-13T21:44:57.076+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XVI Jake IVX,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=0005000000000001,timestamp=2019-12-13T21:12:12.045+0000)\n>\n> Your not high level imo. xD I been playing since 2010 and have almost all champions + all runes (back when they had runes I did have all runes.) + all skins on the champs I play (Which is literally tryndamere). I wanted you to add me because I needed to discuss something with you ,and you seem cool ,but its fine. Than play league with you. Now if your toxic I'll just remove you. I don't even ask for skins. And how can you get to know someone if your not willing to add them? {{sticker:sg-soraka}}\n\nYes I'm not a high level in this particular game, but I have been playing since S2 when the level cap was 30. I don't play LoL very often anymore since the two game modes I played the most (Dominion and Twisted Treeline) were removed, and FGMs only occasionally come around. As for your question there's always just playing with someone in the game normally and conversing with them there. Based on the conversation and how they act I can get a basic idea of what they're like. It's not perfect obviously but it's better than nothing.\n\nFor what you wanted to ask me if you have a Discord account you could always message me there, or if it's something you'd like to discuss publicly you could always ask me via a Discuss the Boards thread. If you'd rather do it in-client though then I'm not entirely against that.","replies":[]}]},{"poster":"Subdue","date":"2019-12-13T20:22:21.140+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Prandine,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=000500000000,timestamp=2019-12-13T20:12:38.622+0000)\n>\n> Sorry but I don't like adding random people that I don't know, it's nothing personal. I like to try to get to know someone first before adding them, that way I can see if they want to add me for who I am as a person and not just for the stuff I have/because I'm a high level.\n\nWhat is this \"stuff\" that you have?","replies":[{"poster":"Prandine","date":"2019-12-13T20:39:29.633+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Subdue,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=0005000000000000,timestamp=2019-12-13T20:22:21.140+0000)\n>\n> What is this \"stuff\" that you have?\n\nIt depends on the game but in the case of LoL it would have to be skins, chromas, icons, that sort of stuff. If people just so happen to like the stuff I have that's fine, but if that's one of the only reasons they want to add me then that's not fine.","replies":[]}]}]}]},{"poster":"Jojobees","date":"2019-12-13T04:09:43.132+0000","up_votes":1,"down_votes":2,"body":"I respectfully disagree with almost everything you said and here's why.\n\nFirstly if I personally had received a 2 year ban instead of the 2-week suspension, I would still have my account. That's how long it took me to mature and reform.\n\n\"People would play on another [disposable] account(s) until their main one is unbanned\" Yes, of course they would play on other accounts. I spent the two week suspension grinding another account to level 30 because I was pretty sure I wouldn't be able to reform in time to save my main account. But this second account wasn't 'disposable' as no account is disposable when you could lose it.\n\n\"No lasting penalty for consistent misbehavior\" What I'm suggesting is a 1 or 2 year suspension for misbehavior before a permanent ban, so this is just a misunderstanding of what I'm suggesting. If the player is still toxic after the 1-2 years, then they get the permanent ban. That is what I'm suggesting.\n\n\"...a year + is too long since by that time they may have already forgotten about the account and/or behavior and/or moved onto other games\" I got banned 4 years ago and every year I make multiple support tickets on the issue and at least one forum post. I have not forgotten about the accounts and I never will. Also, a year + is too long and permanent is not? I'd like to understand your reasoning behind that but I can't.\n\nIn regards to your last paragraph, do you believe that if I got my first ever account back that I'd forget everything I learned in the last 4 years and become toxic again? Because if so, I disagree with you there too.","replies":[{"poster":"Prandine","date":"2019-12-13T20:36:58.429+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jojobees,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=00050001,timestamp=2019-12-13T04:09:43.132+0000)\n>\n> I respectfully disagree with almost everything you said and here's why.\n> \n> Firstly if I personally had received a 2 year ban instead of the 2-week suspension, I would still have my account. That's how long it took me to mature and reform.\n\nThat may work for you but unfortunately not everyone is like that.\n \n> \"People would play on another [disposable] account(s) until their main one is unbanned\" Yes, of course they would play on other accounts. I spent the two week suspension grinding another account to level 30 because I was pretty sure I wouldn't be able to reform in time to save my main account. But this second account wasn't 'disposable' as no account is disposable when you could lose it.\n\nI wish other people shared that mindset but sadly we've seen many players say that they don't care about their accounts and will happily lose them if it means intentionally screwing over others.\n \n> \"No lasting penalty for consistent misbehavior\" What I'm suggesting is a 1 or 2 year suspension for misbehavior before a permanent ban, so this is just a misunderstanding of what I'm suggesting. If the player is still toxic after the 1-2 years, then they get the permanent ban. That is what I'm suggesting.\n\nI get what you're trying to say here but in my opinion a year or two is too long. We may just have to agree to disagree on this point though.\n \n> \"...a year + is too long since by that time they may have already forgotten about the account and/or behavior and/or moved onto other games\" I got banned 4 years ago and every year I make multiple support tickets on the issue and at least one forum post. I have not forgotten about the accounts and I never will. Also, a year + is too long and permanent is not? I'd like to understand your reasoning behind that but I can't.\n\nMy reasoning is that if it's a year+ by the time the ban expires there's a very good chance that the person in question will have moved onto other games or accounts, and by the time the ban expires they've probably forgotten about what it was that got them punished in the first place and/or just don't care about how many times they get punished. Because of this I feel a month would be enough extra time after the 2-week ban to really get someone to stop and think about what they've done since it's 2 extra weeks away from LoL. If that's still not enough time for them then chances are a year+ ban wouldn't be enough time.\n\nI get that you say that this wouldn't be the case for you, and that's good, but based on the many posts I've seen over the years many people aren't like that, and it's just not a risk worth taking in my opinion.\n \n> In regards to your last paragraph, do you believe that if I got my first ever account back that I'd forget everything I learned in the last 4 years and become toxic again? Because if so, I disagree with you there too.\n\nFor you personally? I'd say most likely not. However, you have to keep in mind that Riot has tried unbanning experiments in the past where they had 1-on-1 conversations with people who they believed genuinely wanted to reform. Unfortunately both experiments they tried were a failure, with the lv.20 challenge in particular only having a 5% success rate. Because of this I don't believe permabanned accounts should be given back, as while I do believe history can be changed/made in this case there's no guarantee that another unbanning experiment would even work since the last two attempts failed.","replies":[]}]}]},{"poster":"AeroWaffle","date":"2019-12-13T02:51:49.753+0000","up_votes":3,"down_votes":1,"body":"One of the major issues I see with such a long-term ban such as one or two years is it pretty much guarantees that any account made while waiting out the ban is going to be treated as disposable, knowing that they'll eventually get the account that they care about back.","replies":[{"poster":"Jojobees","date":"2019-12-13T03:09:27.704+0000","up_votes":1,"down_votes":2,"body":"This is a good comment. And I can see how someone who has never had a banned account could see this. But as a player who has had two permanently banned accounts, I no longer view any of my accounts as disposable.\n\nI guess the best way to think of it is as a disease. My accounts were sick, and the sickness was my toxicity. My accounts could die at any moment because I was a toxic player. There was a transition period where I was still figuring out what worked for me and how I could get better, and during that period I made three accounts and played on them equally, so that if I did lose one, I'd still have two more. That doesn't mean that these accounts were disposable though. Each one of them was equally as valuable to me.\n\nWhen I lost my accounts I felt like I had lost a child in a custody battle with RIOT. I cried for days, weeks, and months. And if I had lost any of those three accounts I probably would have cried about them, too. Just because you have multiple accounts doesn't mean they are disposable.","replies":[{"poster":"AeroWaffle","date":"2019-12-13T03:19:17.910+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jojobees,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=00030001,timestamp=2019-12-13T03:09:27.704+0000)\n>\n> This is a good comment. And I can see how someone who has never had a banned account could see this. But as a player who has had two permanently banned accounts, I no longer view any of my accounts as disposable.\n> \n> I guess the best way to think of it is as a disease. My accounts were sick, and the sickness was my toxicity. My accounts could die at any moment because I was a toxic player. There was a transition period where I was still figuring out what worked for me and how I could get better, and during that period I made three accounts and played on them equally, so that if I did lose one, I'd still have two more. That doesn't mean that these accounts were disposable though. Each one of them was equally as valuable to me.\n> \n> When I lost my accounts I felt like I had lost a child in a custody battle with RIOT. I cried for days, weeks, and months. And if I had lost any of those three accounts I probably would have cried about them, too. Just because you have multiple accounts doesn't mean they are disposable.\n\nBut if you had an account banned for year(s), then wouldn't you have still had the same result as far as the rest of the playerbase would observe? You would still play on other accounts during your ban period and still have been getting hit with punishments for poor behavior.\n\nExcept this time you wouldn't have the ultimate penalty of losing your account until after an extreme length of time. A perma-ban isn't suppose to be fun. It's Riot's effort to get you out of the game because they believe it's extremely unlikely that you'll behave yourself.","replies":[{"poster":"Jojobees","date":"2019-12-13T03:32:46.292+0000","up_votes":1,"down_votes":1,"body":"No. I wouldn't have. Because for me it wouldn't have mattered how many warnings I got. I needed time to mature and change and develop as a human being. I was an 18 y/o dude who was still figuring out his place in life and now I'm a 22 year old commercial pilot who has direction and a purpose.","replies":[{"poster":"AeroWaffle","date":"2019-12-13T05:25:59.217+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jojobees,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=0003000100000000,timestamp=2019-12-13T03:32:46.292+0000)\n>\n> No. I wouldn't have. Because for me it wouldn't have mattered how many warnings I got. I needed time to mature and change and develop as a human being. I was an 18 y/o dude who was still figuring out his place in life and now I'm a 22 year old commercial pilot who has direction and a purpose.\n\nYou claimed you had two permanently banned accounts. Unless the perma-bans was assigned simultaneously, one must have been banned first.\n\nIf the more serious punishment (perma-ban) didn't encourage you to stop your poor behavior enough to avoid the second perma-ban, why do you think a year ban would have changed anything? I doubt you would be abstaining from league for the entire year if a perma-ban wasn't enough to make you quit, you'd be creating an additional accounts to play on during that time (you already claimed to have several accounts to cycle through).\n\nSo you would still have been accruing punishments all the same.","replies":[{"poster":"Jojobees","date":"2019-12-13T05:35:05.009+0000","up_votes":1,"down_votes":1,"body":"The two permanent bans actually were very close to each other. I say a month but I don't honestly remember how far apart they were. Coulda been a week or two.\n\nAnd like I said, it wasn't about the severity of the punishment it was about the time.\n\nI needed time to mature and change and develop as a human being. I was an 18 y/o dude who was still figuring out his place in life and now I'm a 22 year old commercial pilot who has direction and a purpose.","replies":[{"poster":"AeroWaffle","date":"2019-12-13T05:48:35.560+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jojobees,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=000300010000000000000000,timestamp=2019-12-13T05:35:05.009+0000)\n>\n> The two permanent bans actually were very close to each other. I say a month but I don't honestly remember how far apart they were. Coulda been a week or two.\n> \n> And like I said, it wasn't about the severity of the punishment it was about the time.\n> \n> I needed time to mature and change and develop as a human being. I was an 18 y/o dude who was still figuring out his place in life and now I'm a 22 year old commercial pilot who has direction and a purpose.\n\nAnd I'm saying that the community would not have been better off from the additional punishment tier in your case.\n\nUnless you would have stopped playing for the full year, then you would have still been playing and accruing punishments from poor behavior just like before.\n\nSo the only person this additional punishment tier benefits is you. While suffering from the disadvantage that I pointed out earlier, new accounts being treated as disposable by many players given such a ban.\n\nThe level 20 challenge showed that perma-banned players are far more likely to go back to their old behavior. You being the 5% anomaly that would have succeeded the challenge speaks well for your growth as a person, but the remaining 95% of the players would just make situations worse.\n\nIt's that 95% that needs to be encouraged to go elsewhere. A 1-2 year doesn't do that. A 1-2 year ban just keeps them invested in league only to likely get banned again after the 1-2 year ban was finished.","replies":[{"poster":"Jojobees","date":"2019-12-13T05:54:25.440+0000","up_votes":1,"down_votes":1,"body":"The community wouldn't have been worse off either. I was playing the game no matter what and I was also reforming no matter what. The process just took a bit longer for me than the two weeks that RIOT expects of people.\n\nDo you think that 1 in 20 is such a small number to be discounted entirely? Because I don't. I personally believe that the unban experience was a huge success for RIOT. They brought 1 in 20 players back to the game in a way that was positive for them and the community. The other 19 players obviously played league anyway whether they were banned or not. If they had gone to a different game then they wouldn't have participated in the unban experiment as they would have no interest in League of legends. So I see this as a net positive.","replies":[{"poster":"AeroWaffle","date":"2019-12-13T06:08:22.759+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jojobees,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=00030001000000000000000000000000,timestamp=2019-12-13T05:54:25.440+0000)\n>\n> The community wouldn't have been worse off either. I was playing the game no matter what and I was also reforming no matter what. The process just took a bit longer for me than the two weeks that RIOT expects of people.\n\nTwo weeks is an extremely long time as far as video game bans go. After a reasonable amount of time trying to get you to be civil, Riot should be trying to get you to go elsewhere.\n\n1-2 Years is not a reasonable amount of time. That's a length of time that you could be pushing away many hundreds of customers while you play on your alt accounts waiting out the ban.\n\n> Do you think that 1 in 20 is such a small number to be discounted entirely? Because I don't. I personally believe that the unban experience was a huge success for RIOT. They brought 1 in 20 players back to the game in a way that was positive for them and the community. \n\nI agree with Riot. Keeping a majority of what would normally be perma-banned players invested in the game for the sake of 5% is not good enough. It is not a net positive for the community.\n\n>The other 19 players obviously played league anyway whether they were banned or not. If they had gone to a different game then they wouldn't have participated in the unban experiment as they would have no interest in League of legends. So I see this as a net positive.\n\nYour suggestion to add another ban tier would also encourage those that would normally leave to instead stick around. These people are still subject to the extremely low success rate.\n\nBesides, being discouraged from playing the game doesn't have to mean quitting completely. Getting a perma-banned player to play less because the loss of all progress lowers their motivation is also a successful discouragement.","replies":[{"poster":"Jojobees","date":"2019-12-13T06:19:47.576+0000","up_votes":1,"down_votes":1,"body":"Finally I've found where we fundamentally disagree. I believe that players don't stop playing after they get permanently banned, and I am living proof of my belief.\n\nYou believe that players who get permanently banned quit the game.\n\nThat is where we really, truly, disagree. And neither of us are really wrong. There are plenty of players on both sides.\n\nI guess the real question is would a 1 year ban be a net positive for the community or a net negative? Personally I think that the players who quit for a permanent ban would be pretty much just as likely to quit for a 1 or 2 year ban. These are the players who don't really care about the game anyway.\n\nI also believe that the players who stick around eventually reform anyway, whether it takes 2 permabans or 15.\n\nThese are fundamental differences where we cannot agree and while I respect your reasoning I do not agree with your fundamental assumptions.","replies":[{"poster":"AeroWaffle","date":"2019-12-13T07:37:35.676+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jojobees,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=0003000100000000000000000000000000000000,timestamp=2019-12-13T06:19:47.576+0000)\n>\n> Finally I've found where we fundamentally disagree. I believe that players don't stop playing after they get permanently banned, and I am living proof of my belief.\n> \n> You believe that players who get permanently banned quit the game.\n\nYou are one person. I believe it to be next to impossible that losing months maybe years worth of progress doesn't discourage some people enough that they'd be willing to quit and go to a different game.\n\nMany people put down a game, never to pick it up again, when they lose their save data after several weeks of work. The same premise applies here.\n\n> That is where we really, truly, disagree. And neither of us are really wrong. There are plenty of players on both sides.\n\nI'm not claiming all people perma-banned quit the game.\n\n> I guess the real question is would a 1 year ban be a net positive for the community or a net negative? Personally I think that the players who quit for a permanent ban would be pretty much just as likely to quit for a 1 or 2 year ban. These are the players who don't really care about the game anyway.\n\nThe promise of their account back after 1 to 2 year is another thing to keep them invested in the game. There's still the attachment to their account that would discourage them from quitting.\n\nA perma-ban cuts all attachment to any account progression. It's the best chance Riot has to get them to stop playing.\n\n> I also believe that the players who stick around eventually reform anyway, whether it takes 2 permabans or 15.\n\nThere's the occasional player that wanders through this board that I believe will never behave themselves. If they change 5 years down the line, what they did to land themselves several dozen perma-bans doesn't change. Just because it's in the past doesn't mean the consequences should be lessened.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"XVI Jake IVX","date":"2019-12-13T03:00:43.991+0000","up_votes":0,"down_votes":0,"body":"Yeah in my opinion if I knew I could be toxic in 1 game. Than get a chance to get that account back in a year I might just be toxic. I can see how it can promote toxicity. However I wouldn't do that because that isn't good ,and I'm reformed. Since 2010. 7 day > 14 day taught me a lesson.","replies":[]}]},{"poster":"Toxicate13","date":"2019-12-13T04:29:53.707+0000","up_votes":2,"down_votes":2,"body":"Two weeks is NOT LONG ENOUGH TO REFORM. For most people, toxicity is an emotional response. You can't just change your emotions on a whim; if that were the case, no one would be depressed, right? I think it's ignorant to argue that someone can reform within a 2 week period because  that's just not the case.","replies":[{"poster":"Jojobees","date":"2019-12-13T04:40:10.129+0000","up_votes":2,"down_votes":1,"body":"Yes!!! This exactly. I was also depressed during this time and the loss of my accounts didn't help. I was 18 years old and I was lost. I didn't know what I was going to do with my life and that came out during the game in the form of toxicity. It took me a year to figure out what I wanted to do, and once my life turned around everything else started falling into place. I think that's when I truly reformed. When I finally knew what I was going to do in my life and I was doing it. Not when I got a 2 week suspension from a videogame.\n\nPeople need time, not warnings, to change.","replies":[{"poster":"Toxicate13","date":"2019-12-14T05:39:01.048+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Jojobees,realm=NA,application-id=ZGEFLEUQ,discussion-id=TZf8UYoq,comment-id=00060000,timestamp=2019-12-13T04:40:10.129+0000)\n>\n> Yes!!! This exactly. I was also depressed during this time and the loss of my accounts didn't help. I was 18 years old and I was lost. I didn't know what I was going to do with my life and that came out during the game in the form of toxicity. It took me a year to figure out what I wanted to do, and once my life turned around everything else started falling into place. I think that's when I truly reformed. When I finally knew what I was going to do in my life and I was doing it. Not when I got a 2 week suspension from a videogame.\n> \n> People need time, not warnings, to change.\n\nThat's how I feel bro.","replies":[]}]}]},{"poster":"Quiet Dude","date":"2019-12-13T21:13:46.124+0000","up_votes":1,"down_votes":0,"body":"Two weeks is generous, OP. If you can't process the idea that \"one more punishment and my account is gone\" in the time span of 2 weeks, I regret to inform you that reforming is the least of your worries.","replies":[]}]}