{"poster":"MoonDrah","date":"2016-10-11T17:38:02.686+0000","title":"Blobby, la partícula pérdida","subforum":"Creaciones de la comunidad","up_votes":1,"down_votes":0,"body":"Es blobby, una part&iacute;cula p&eacute;rdida de zac, despu&eacute;s de a&ntilde;os de vagar por runaterra por fin lleg&oacute; a la grieta del invocador, blobby puede conectarse a mounstros neutrales y minions  con su pasiva, agarre viscoso, esto le permite controlar a tal criatura sacrificando un porcentaje de vida, si blobby se conecta a un aliado le da 15% de velocidad de movimiento por 5 segundos y si lo hace hacia un enemigo lo realentiza por la misma duraci&oacute;n , la q de blobby le permite avanzar a una locaci&oacute;n objetiva, si golpea a un enemigo le hace 200 de da&ntilde;o m&aacute;gico (x ap) la w de blobby tiene ambas pasiva y activa, la pasiva hace que mientras m&aacute;s vida tenga blobby más daño hacen sus basicos , la activa es que se convierte en ub moco intargeteable por 4 seg b&aacute;sicos , la e es que blobby snarea a un enemigo por 2 segundos con su baba, por &uacute;ltimo la ulti de blobby le permite controlar a un enemigo por 6 segundos, los ataques enemigos le har&aacute;n da&ntilde;o a blobby s&oacute;lo si pegan en la espalda del campe&oacute;n, en otro caso ellos terminar&iacute;an matando a su propio aliado y esto le dar&iacute;a un asesinato a blobby\nY a pasiva tiene 2 minutos de cd, para balancearlo un poco","replies":[{"poster":"Tré Cool","date":"2016-10-11T17:45:43.700+0000","up_votes":1,"down_votes":0,"body":"Un poco roto, y la pasiva que dice \"blobby puede conectarse a mounstros neutrales y minions con su pasiva, agarre viscoso, esto le permite controlar a tal criatura sacrificando un porcentaje de vida\" se parece un poco a la de Ivern.\nSaludos :D","replies":[{"poster":"MoonDrah","date":"2016-10-22T02:48:19.645+0000","up_votes":1,"down_votes":0,"body":"me inspire en eso, solo que en otra forma, alguna vez viste un campeon controlando al blue? estaria buenisimo!","replies":[{"poster":"Tré Cool","date":"2016-10-22T21:28:21.006+0000","up_votes":1,"down_votes":0,"body":"Yo creo que Ivern ya tiene un blue en su ulti xD.\nIgualmente el campeón esta bueno (le falta progreso todavía, obviamente).\nSaludos :D","replies":[]}]}]},{"poster":"MoonDrah","date":"2016-10-11T17:39:20.338+0000","up_votes":1,"down_votes":0,"body":"El post se irá actualizando según más avancemos yo,lokiman123 y ciprostatus","replies":[{"poster":"resnov15","date":"2016-10-11T17:43:03.269+0000","up_votes":1,"down_votes":0,"body":"Un campeon que controle a otros seres  contra su voluntad ","replies":[{"poster":"Saryn","date":"2016-10-12T20:02:46.250+0000","up_votes":1,"down_votes":0,"body":"Se parecería a sylvanas de heroes of the storm, aunque ella solo controla el movimiento","replies":[{"poster":"MoonDrah","date":"2016-10-22T02:49:14.393+0000","up_votes":1,"down_votes":0,"body":"blobby podria controlar el movimiento y los basicos{{sticker:slayer-jinx-wink}}","replies":[]}]}]},{"poster":"ChoriPandi","date":"2016-10-15T16:41:11.496+0000","up_votes":1,"down_votes":0,"body":"Moon te propongo ayudarme con mi campeon, hice un post, se llama Yinoh, buscalo y puedo ayudarte tambien!","replies":[]}]}]}