{"poster":"Nerd Conflict","date":"2019-05-15T19:04:18.991+0000","title":"Ist es erlaubt einen Account zu verschenken?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo! Da ich aktuell und auf länger kein LOL mehr spiele, würde ich gern meinen Account verschenken. Ist das erlaubt?","replies":[{"poster":"Nerd Conflict","date":"2019-05-15T20:15:20.996+0000","up_votes":1,"down_votes":0,"body":"Hmm aber da steht nur verkaufen und nicht verschenken? Also dauerhaft verschenken geht auch nicht... wäre halt schad drum wenn der vergammelt.","replies":[{"poster":"Darkr3sQ","date":"2019-05-17T19:30:24.293+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nerd Conflict,realm=EUW,application-id=7hciEY9w,discussion-id=vRsetO2A,comment-id=0001,timestamp=2019-05-15T20:15:20.996+0000)\n>\n> Hmm aber da steht nur verkaufen und nicht verschenken? Also dauerhaft verschenken geht auch nicht... wäre halt schad drum wenn der vergammelt.\n\nUm mal die [AGB](https://euw.leagueoflegends.com/de/legal/termsofuse) zu zitieren:\n\n> 1.4. Kann ich mein Konto oder meine Anmeldedaten weitergeben oder verkaufen? (Nein.)\nWenn du ein Konto bei uns erstellst, bitten wir dich um Auswahl eines einmaligen Benutzernamens und eines Passworts (zusammen deine „Anmeldedaten“), die du bei jedem Zugriff auf das Spiel verwendest. **Du darfst dein Konto oder deine Anmeldedaten an niemanden weitergeben. Du darfst dein Konto oder deine Anmeldedaten nicht verkaufen, übertragen oder einer anderen Person den Zugriff darauf gestatten oder dies anbieten. **Du bist vollständig für die Geheimhaltung deiner Anmeldedaten verantwortlich. Bitte teile uns umgehend mit, wenn dir eine Sicherheitsverletzung bekannt wird, darunter auch der Verlust, Diebstahl oder die unberechtigte Offenlegung deiner Anmeldedaten.\n\nAus diesem Absatz, besonders aus dem gefetteten Teil, geht eindeutig hervor, dass Dein Konto nicht übertragbar ist. Das Schließt Verschenken ebenfalls mit ein, da Du hier das Konto einem anderen kostenlos überträgst.\nAuch kurzzeitiges Verleihen ist nicht gestattet, da kein anderer außer Dir Zugriff auf das Konto haben darf.\n\nAlso um es kurz zu sagen, wie es in der Klammer nach der Überschrift steht: Nein, darfst Du nicht.","replies":[]},{"poster":"Amycos Cyrus","date":"2019-05-16T04:58:20.190+0000","up_votes":1,"down_votes":0,"body":"Das liegt daran, dass Riot ja nicht prüfen kann, ob du ihn Verkauft oder Verschenkt hast.\nDas Indiz des Banns ist lediglich, dass in einem kurzen Zeitraum der Spieler sehr anders Spielt (Qualität oder Championpool) bzw. Wenn sich größere Veränderungen auf dem Account zeigen.\n\nDas sind nun einmal alles Indizien, die auch beim Verschenken auftauschen können.\n\nWeiterhin ist es ja sogar schon so, dass das Account-Sharing (also lediglich, das zwei Spieler den selben Account nutzen) laut den AGB verboten ist. Eine permanente Übergabe steht dann schon außer Frage.\n\nIch für meinen Teil wüsste aber auch nicht, warum man seinen Account unbedingt verschenken sollte. Lass ihn einfach verbleiben und falls du mal wieder Interesse hast, kannst du ja mal ein zwei Runden spielen. Ich kenne ein paar Gelegenheitsspieler, die sich vielleicht einmal pro Monat zeigen.","replies":[]}]},{"poster":"Izaya Kumiho","date":"2019-05-15T19:08:54.372+0000","up_votes":1,"down_votes":0,"body":"Nein. Die Übergabe/ das Verkaufen eines Accounts ist nicht erlaubt. Sharing/trading/gifting wird mit einem Bann bestraft.\n\nhttps://support.riotgames.com/hc/de/articles/204214670","replies":[]}]}