{"poster":"Riot Morgageddon","date":"2020-02-25T22:51:54.750+0000","title":"The Good, The Bad, and the League: 2/4 - 2/24","subforum":"Live Incident Breakdown","up_votes":1,"down_votes":0,"body":"_Your semi-weekly dose of server problem-os, NA League news, and other! _\r\n\r\n2020 is in full swing. LoR entered open beta, Sett is STILL punching an awful lot of things, Your Shop is active and C9 is undefeated...so far. Clash happened this last weekend\r\n\r\n**Follow-Ups:**\r\n\r\n* **Mac voice still not working properly** It’s being worked on! There’s improvements being done to Riot Voice and it should be fixed in the nearish future (not a Soon™ type scenario). \r\n\r\n**Ongoing**\r\n\r\n* **None**\r\n\r\n**Server Stuff: **\r\n\r\n* **MFA host has higher error rate than acceptable(2/7, ~4 hours)** Automated alerting reports that error rates for Multi-Factor Auth (MFA) are above acceptable rates. NOC notifies engineers, who investigate and fiddle with config changes. Then, additional hardware is scaled up to handle extra load, and the problem is resolved. An additional code change is scheduled to permanently fix the underlying problem. \r\n\r\n* **Elevated error rate causing login issues(2/7, ~30 minutes)** NOC is notified that error rates are reaching unacceptable levels. NOC techs cycle the boxes running the programs, which solves the problem. \r\n\r\n* **Player in Game (PIG) loss due to unknown reasons (2/10, ~8 minutes)** Automated alerting notifies the NOC that PIG dropped mysteriously. PIG recovers shortly, but investigations into why that happened find no root cause. \r\n\r\n* **NA players report inability to patch Riot Client (2/11, ~10 hours)** NOC is notified by PS that they’ve gotten a large volume of support requests due to an inability to patch the Riot Client. Investigation points to an issue with timeouts. Engineers point software towards a different box, which fixes the routing issues causing the problem. \r\n\r\n* **Issues with game starts (2/14, ~20 minutes)** Automated alerting notifies the NOC that game starts are impacted. Before an investigation can be spun up, game starts resume normal metrics, and further watching doesn’t show any additional problems.\r\n\r\n* **Signups API failure(2/21, ~6 minutes)** Automated alerting notifies the NOC that signups have reported 0 signups for 5 minutes. NOC tech takes a look and notices that one of the backend connection nodes isn’t transmitting data. Routing around the impacted node fixes the problem while the node is rebooted. \r\n\r\n* **CPU Usage too high - Mitigation steps (2/22, ~89 minutes)** CPU usage hitting warning levels due to Clash. In response, practice games are set to 10 player minimums and then the practice tool is disabled too. ARAM queue is throttled, and then all steps are undone as soon as the CPU levels lower to acceptable ranges. \r\n\r\n* **CPU Usage too high - Mitigation steps (2/23, ~95 minutes)** CPU usage hitting warning levels due to Clash. In response, practice games are set to 10 player minimums and then the practice tool is disabled too. Co-op vs. AI games are throttled, and then all steps are undone as soon as the CPU levels lower to acceptable ranges. \r\n\r\n* **Practice Games Finishing in Error (2/24, ~11 hours)** Automated alerting notifies the NOC that games are ending with unacceptable error rates. Investigation starts, and engineers notice only practice games are ending with errors. Further checks notice that unverified code around clash trophies in practice tool seems to be the culprit. A hotfix goes out that fixes the issue. \r\n\r\n**Game Stuff: **\r\n\r\n* **Network config for perks service accidentally deletes Runes (2/4, ~38 minutes)** Network engineer changes the config for perks, which accidently disables rune selection for all Riot Shards. Once discovered, the network engineer undoes the network configs for perks that caused it.\r\n\r\n_Morgageddon_","replies":[{"poster":"Thorn Fierce Red","date":"2020-02-29T01:53:35.491+0000","up_votes":2,"down_votes":0,"body":"Client dint want to open....","replies":[{"poster":"LightningVA","date":"2020-03-02T06:32:18.090+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Thorn Fierce Red,realm=NA,application-id=6WpmgL9O,discussion-id=B8mqYWVV,comment-id=0001,timestamp=2020-02-29T01:53:35.491+0000)\n>\n> Client dint want to open....\n\nmaybe the client still open even thou u have close the client. try go to task manager and end task league client and open it again","replies":[]}]},{"poster":"DartExplosion10","date":"2020-02-28T04:26:09.184+0000","up_votes":2,"down_votes":0,"body":"love it","replies":[]}]}