{"poster":"Masala Chai","date":"2016-05-07T17:18:09.127+0000","title":"Preliminary statistics for 6.9 are out. Take a look at the new champion winrates!","subforum":"Gameplay","up_votes":35,"down_votes":2,"body":"Take these with a grain of salt. Check relativity with your favorite website (champion.gg, leagueofgraphs.com, op.gg etc.) All statistics were taken from na.op.gg. May not be applicable for EUW, EUNE, LAN, LAS, OCE etc.\n**MAGE UPDATES**\nSwain (rework)\n34.39% for midlane Swain\n35.13% for toplane Swain\n\nCassiopeia (rework)\n35.80% for midlane Cass\n39.04% for toplane Cass\n\nVladimir (rework)\n40.84% for toplane Vlad\n36.94% for midlane Vlad\n\nSyndra (rework)\n46.44% for midlane Syndra\n\nVel&#039;Koz (rework)\n47.39% for midlane Vel&#039;Koz\n\nVeigar (rework)\n49.33% for midlane Veigar\n\nAnivia (rework)\n49.64% for midlane Anivia\n\nZiggs (rework)\n49.81% for midlane Ziggs\n\nKennen (rework)\n49.33% for midlane Kennen\n50.6% for toplane Kennen\n\nXerath (rework)\n50.08% for midlane Xerath\n\nZyra (rework)\n50.88% for support Zyra\n51.75% for mid Zyra\n\nBrand (rework)\n51.4% for midlane Brand\n\nViktor (rework)\n52.78% for midlane Viktor\n\nAnnie (rework)\n53.92% for midlane Annie\n\nFiddlesticks (rework)\n53.99% for jungle Fiddle\n53.02% for support Fiddle\n\nMalzahar (rework)\n54.35% for midlane Malzahar\n57.79% for jungle Malzahar\n56.39% for toplane Malzahar\n**\nOTHER CHAMPIONS\n**\nDevourer Junglers (removed item)\nMaster Yi 42.43%\nJax 44.28%\nKayle 45.43%\nShyvana 45.81%\nXin Zhao 46.83%\nWarwick 49.79%\nKindred 49.87%\n\nQSS Rework\nFiora 48.31%\nTrundle 50.13%\nZed 49.32%\nfck it too lazy. I&#039;ll do it after I&#039;m done with essay.\n","replies":[{"poster":"ll League God ll","date":"2016-05-07T18:03:52.659+0000","up_votes":1,"down_votes":72,"body":"devourer doesnt exist anymore you tool...","replies":[{"poster":"Vistha Kai","date":"2016-05-07T18:07:57.729+0000","up_votes":61,"down_votes":0,"body":"You are a tool.\n\nHe obviously listed junglers previously using Devourer as their jungle item of choice.","replies":[]},{"poster":"Sum Wun Speshal","date":"2016-05-08T01:03:22.398+0000","up_votes":23,"down_votes":0,"body":"This was painful to read. I feel physical cringe when people become arrogant when they obviously miss the point.","replies":[]}]},{"poster":"ViashinoWizard","date":"2016-05-07T19:24:45.793+0000","up_votes":40,"down_votes":2,"body":"\"These changes will ruin Viktor!\"\n\n*winrate skyrockets*","replies":[{"poster":"Big Lincoln","date":"2016-05-07T20:31:12.134+0000","up_votes":9,"down_votes":0,"body":"yeah I'll admit I was dead wrong about viktor \n\nbut I'm still going to attribute this to overbuffed numbers","replies":[{"poster":"Supreme Senpai69","date":"2016-05-08T08:43:38.772+0000","up_votes":2,"down_votes":0,"body":"It could also be that he was only difficult because people needed to re-learn him, instead of using him the same way as before the update.","replies":[]}]},{"poster":"Blacknemesist","date":"2016-05-07T21:28:50.826+0000","up_votes":5,"down_votes":3,"body":"If the initial \"idea\" for a viktor rework went through noone would play him. He felt non-responsive and his damage was a joke with a delay. Thank the feedback for the state of viktor, if riot had their way viktor would be not only really below the tier he is now but also a champion that gave no satisfaction to play.","replies":[]},{"poster":"Adolf Hit R","date":"2016-05-08T04:58:46.106+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=ViashinoWizard,realm=NA,application-id=3ErqAdtq,discussion-id=msvsHjEP,comment-id=0008,timestamp=2016-05-07T19:24:45.793+0000)\n>\n> &quot;These changes will ruin Viktor!&quot;\n> \n> *winrate skyrockets*\n\nThe problem is that he feels like shit to play. His Q and ult are strong, but his E is clunky and annoying.","replies":[]}]},{"poster":"Quepha","date":"2016-05-07T18:13:54.667+0000","up_votes":14,"down_votes":2,"body":"Neat stuff.\n\nAlthough it's pretty annoying to me that players act like a class update combined with big objective changes should be perfectly balanced upon release. Or that undertuned numbers mean a champion kit is total garbage and can never be good.","replies":[]},{"poster":"charcharmunro","date":"2016-05-07T22:11:51.175+0000","up_votes":7,"down_votes":0,"body":"{{champion:3}} is also crushing midlane and toplane, though I think that may be a mix of low playrate, everybody playing mages, him basically ignoring Malzahar, and new Catalyst being a great tool on him.","replies":[{"poster":"Athenes Lulu","date":"2016-05-08T01:18:58.661+0000","up_votes":11,"down_votes":0,"body":"It's like Malphite and Rammus top getting high winrates all over again because they shit on ADs.\n\nGalio is just the \"mage version\" of that.","replies":[]},{"poster":"junglerboy16","date":"2016-05-07T23:05:23.417+0000","up_votes":5,"down_votes":0,"body":"Not to mention Protobelt giving him an option other than Flash to get into range for his ult. It might not be gamebreakingly good, but it definitely buffs him.","replies":[{"poster":"Zedex","date":"2016-05-08T11:25:22.963+0000","up_votes":2,"down_votes":0,"body":"Lol lets be honest, its like 4 units.","replies":[]}]}]},{"poster":"Sire Hippington","date":"2016-05-08T02:03:54.062+0000","up_votes":9,"down_votes":0,"body":"well, winrates don't show the full picture.\n\nMost swains for example still seem to max E first, which is as usfull as maxing E first on Ashe...\nMost Velkoz now max Q, though maxing W still is way superior\nnearly 40% of all syndra players are now new to her while she was hardly played by anyone but mains befor, and her winrate for experinced players is about as high as it was befor","replies":[]},{"poster":"Meep Man","date":"2016-05-07T23:19:52.514+0000","up_votes":11,"down_votes":2,"body":"So basically, if these win rates don't change:\n\n**Needs Buffs**\n- Swain\n- Cassiopeia\n- Syndra\n- Vel'Koz\n- Master Yi\n- Jax\n- Kayle\n- Shyvana\n- Xin Zhao\n\n**Balanced, Maybe Extremely Small Tuning**\n- Veigar\n- Anivia\n- Ziggs\n- Kennen\n- Xerath\n- Zyra\n- Brand\n- Viktor\n- Warwick\n- Kindred (didn't use Devourer)\n- Fiora\n- Trundle\n- Zed\n\n**Probably Needs Nerfs**\n- Annie\n- Fiddlesticks\n- Malzahar\n\nI gotta say, for such a large rework, there isn't too many OP people. Of course, tons of UP people, but I would rather there be a small amount of OP and a decent amount of UP than a large amount of OP and a small amount of UP.","replies":[{"poster":"Guy Fox Teemo","date":"2016-05-08T00:00:45.265+0000","up_votes":4,"down_votes":1,"body":"I don't think Vel'Koz needs buffs, I think people jsut need to adjust that you need to land the full combo before getting massive damage on your R.","replies":[{"poster":"SeargentAnus","date":"2016-05-08T00:36:42.205+0000","up_votes":3,"down_votes":1,"body":"If they allowed his ult to apply one stack of his passive he'd feel great. Right now his entire combo along with his ult will only apply one stack of his passive.","replies":[{"poster":"Guy Fox Teemo","date":"2016-05-08T02:31:56.885+0000","up_votes":4,"down_votes":0,"body":"His ult will also deal pure true damage, which at rank one is 500 ~-~ (Thats a lot for lvl 6)","replies":[{"poster":"The Fast","date":"2016-05-08T05:27:15.477+0000","up_votes":4,"down_votes":1,"body":"They made vel'koz effectively single target, which is the issue here.","replies":[]}]}]}]}]},{"poster":"Drackolus","date":"2016-05-07T23:21:56.402+0000","up_votes":8,"down_votes":0,"body":"Soraka dropped in winrate AND ban rate to a normal level! Woohoo! I get to play my main again {{champion:16}}","replies":[]},{"poster":"The Bíg Ticket","date":"2016-05-07T17:19:51.989+0000","up_votes":11,"down_votes":4,"body":"Jax 42%...where is the hotfix?","replies":[{"poster":"Masala Chai","date":"2016-05-07T17:20:29.118+0000","up_votes":4,"down_votes":0,"body":"sorry I'll get started on Devourer junglerssss.....","replies":[{"poster":"The Bíg Ticket","date":"2016-05-07T17:21:30.044+0000","up_votes":5,"down_votes":2,"body":"I will make it easy for you: They all have sub 45% winrates except Kindred who is as broken as before.","replies":[{"poster":"Masala Chai","date":"2016-05-07T17:24:44.391+0000","up_votes":3,"down_votes":0,"body":"4 sig figs for each number doe. Keep in mind these are NA statistics, and not EUW statistics.","replies":[{"poster":"Shadow Hazard","date":"2016-05-07T20:32:02.812+0000","up_votes":2,"down_votes":0,"body":"Just slightly better across the board for dev champs, still not good overall.","replies":[]}]}]}]}]},{"poster":"layrit","date":"2016-05-08T08:04:20.425+0000","up_votes":5,"down_votes":0,"body":"It is worth pointing out that those winrates (especially on low playrate champs like Zyra, Swain) are skewed down at the moment because people who are unfamiliar with them are trying out the changes.","replies":[]},{"poster":"MrLlamaWaffle","date":"2016-05-07T21:47:04.527+0000","up_votes":5,"down_votes":0,"body":"The new fiddle feels great. I'm surprised by the syndra winrate, i thought she was very good","replies":[{"poster":"CoTheSlow","date":"2016-05-08T01:14:16.271+0000","up_votes":2,"down_votes":0,"body":"Even before the update I don't think her win rate was much higher.","replies":[{"poster":"Adolf Hit R","date":"2016-05-08T05:00:33.038+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=CoTheSlow,realm=OCE,application-id=3ErqAdtq,discussion-id=msvsHjEP,comment-id=000d0000,timestamp=2016-05-08T01:14:16.271+0000)\n>\n> Even before the update I don&#x27;t think her win rate was much higher.\n\nIt didn't actually change, which makes sense because the changes are about net neutral.","replies":[]}]},{"poster":"Dar Raksada","date":"2016-05-08T09:05:43.160+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MrLlamaWaffle,realm=NA,application-id=3ErqAdtq,discussion-id=msvsHjEP,comment-id=000d,timestamp=2016-05-07T21:47:04.527+0000)\n>\n> The new fiddle feels great. I&#x27;m surprised by the syndra winrate, i thought she was very good\n\nHe feels much clunkier now, some of the new items are good on him, but his changes definitely put me off playing him.","replies":[{"poster":"MrLlamaWaffle","date":"2016-05-08T18:33:17.677+0000","up_votes":2,"down_votes":0,"body":"Why are people over using this word \"clunky\"? I don't think that word means what you think it means, lol. \n\nHe's literally the same champion with extra bounces on E, lower range on Q, drain is better early game and got some QoL changes to his ultimate. He's the same champion and plays the exact same way, lol.\n\nNot to mention he's technically better since his winrate is up to 53%","replies":[]},{"poster":"Guy Fox Teemo","date":"2016-05-08T22:06:03.234+0000","up_votes":1,"down_votes":0,"body":"what are you talking about? He feels amazing, all of teh changes to him , were basically ALL buffs, his passive change was a buff, they lowered the W down to 4 second cd, and his e now throws for 7 times instead of 4. His R also does more damage. :l","replies":[{"poster":"Dar Raksada","date":"2016-05-09T08:27:44.646+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Guy Fox Teemo,realm=NA,application-id=3ErqAdtq,discussion-id=msvsHjEP,comment-id=000d00010001,timestamp=2016-05-08T22:06:03.234+0000)\n>\n> what are you talking about? He feels amazing, all of teh changes to him , were basically ALL buffs, his passive change was a buff, they lowered the W down to 4 second cd, and his e now throws for 7 times instead of 4. His R also does more damage. :l\n\nFirst off, feel is a subjective thing I don't agree that he feels better/smoother now\n\nThe passive was a change, not a straight buff, I preferred the old passive.\n\nHis q range got reduced -> straight nerf\n\nHis w cd got _changed_ not straight lowered as it now starts after your drain ends, which means the cd is higher in the jungle, tho it's probably better in teamfights.\n\nHis E was a straight buff from 5 to 7, not from 4 to 7\n\nI don't recall reading an R damage buff, though you'd have to balance it against them having 10 more mr than they normally would (passive).\n\nEdit: checked and there is no R damage buff in the patch notes. Seeing as they reduced the AP on some items fidd uses, like zhonya's and abyssal, and enemies now have 10 additional mr the only way I could see it doing more damage is if you need to chase a lot during it and the minor speedbuff would make the difference.\n\nDo note that I'm not arguing he got nerfed, just that he changed in a way I don't enjoy playing as much.","replies":[]}]}]}]},{"poster":"Evewynn","date":"2016-05-07T21:41:12.479+0000","up_votes":5,"down_votes":0,"body":"I wonder just how much these reduction to win rates are due to people getting use to the champion kits, as opposed to the champs just being flat-out weak (swain and cass aside, as rates that low could never be accounted for simple remastery).\n\nI think that malz will likely get nerfed again sometime after the hotfix, but his lack of mobility may make up for how safe his passive makes him. Definitely a tad on the oppressive side though.\n\nI look forward to seeing how riot will handle this, as I am sure that riot wanted the net change for most mages to be slightly stronger than before to make up for their underperformance this season.","replies":[]},{"poster":"Lady Hammerlock","date":"2016-05-08T00:07:32.066+0000","up_votes":8,"down_votes":3,"body":"Looks like all the Viktor whining in the boards was wrong lol","replies":[]},{"poster":"thumbnail9","date":"2016-05-07T18:48:51.340+0000","up_votes":3,"down_votes":0,"body":"Wow I thought ziggs would be higher up due to his ability to completely deny objective protection with his charge.","replies":[{"poster":"junglerboy16","date":"2016-05-07T23:07:58.998+0000","up_votes":4,"down_votes":0,"body":"At the point where a tower is low enough to kill with satchel charge, it's either mid game and grouped pushing has begun anyway, or it's late game and he's cleaning up unprotected towers. It seems like a rare case where he actually makes a significant boost in his pushing speed, but I guess it could be different for everyone.","replies":[{"poster":"thumbnail9","date":"2016-05-07T23:46:35.413+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=junglerboy16,realm=NA,application-id=3ErqAdtq,discussion-id=msvsHjEP,comment-id=00060000,timestamp=2016-05-07T23:07:58.998+0000)\n>\n> At the point where a tower is low enough to kill with satchel charge, it&#x27;s either mid game and grouped pushing has begun anyway, or it&#x27;s late game and he&#x27;s cleaning up unprotected towers. It seems like a rare case where he actually makes a significant boost in his pushing speed, but I guess it could be different for everyone.\n\nAt the same time, how would you ever protect inhib turrets from him? The amount of time saved by that ability is absurd when played right. Think of all the times you stall out in a push where a turret gets left at that 35% or lower. This ability is maybe more massive to pro play than pubs.","replies":[]}]}]},{"poster":"Igotlazy","date":"2016-05-07T19:38:43.092+0000","up_votes":3,"down_votes":0,"body":"Are these statistics based on games from the release of the patch until now, or just a few hours after the patch dropped? I'm never too sure when it comes to these data collecting sites.\n\n-Overall some champs are just blatantly UP even when you consider that people need time to learn them. (Cass, Swain and Vlad).\n-Some champs need to be toned down (definitely Malz, probs Annie).\n-I'm surprised that Fiddlesticks and Viktor are doing so well considering people's initial reaction to their changes.","replies":[{"poster":"YumaS2Astral","date":"2016-05-07T19:58:25.600+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Igotlazy,realm=NA,application-id=3ErqAdtq,discussion-id=msvsHjEP,comment-id=0009,timestamp=2016-05-07T19:38:43.092+0000)\n>\n> Are these statistics based on games from the release of the patch until now, or just a few hours after the patch dropped? I&#x27;m never too sure when it comes to these data collecting sites.\n> \n> -Overall some champs are just blatantly UP even when you consider that people need time to learn them. (Cass, Swain and Vlad).\n> -Some champs need to be toned down (definitely Malz, probs Annie).\n> -I&#x27;m surprised that Fiddlesticks and Viktor are doing so well considering people&#x27;s initial reaction to their changes.\n\nmobility on Fiddlesticks is extremely welcome. He has always been very immobile. Also, his previous passive was relevant early at best and non-existant once they had a single magic resistance item or once the enemy support purchased a {{item:3190}} \n\nOverall, Fiddlesticks' changes put him into a good spot. I am reconsidering playing Fiddlesticks mid once again even though he is primarily a jungler","replies":[]}]},{"poster":"PikaCHU567","date":"2016-05-08T03:44:14.361+0000","up_votes":1,"down_votes":0,"body":"It's nice to see Zyra is starting to be played a lot more often. :o","replies":[{"poster":"Solari Fortune","date":"2016-05-08T04:18:18.208+0000","up_votes":5,"down_votes":1,"body":"Its not fun having your main contested","replies":[{"poster":"PenguinOverlord8","date":"2016-05-09T03:14:32.028+0000","up_votes":1,"down_votes":0,"body":"Jesus Christ the feeling of having you main banned or picked is just ew. Zyra is my most played and it's really gross seeing other people play her for a change xD. I think she is pretty balanced so I hope plant mama zyra won't become popular or nerfed, ect.\nAlso while playing supp zyra someone told me that \"Her q is busted and you need to be leveling it first\" omg I wanted to throw up at that statement xD. Do people not realize that you almost always level up her e?","replies":[{"poster":"Solari Fortune","date":"2016-05-09T03:43:54.004+0000","up_votes":1,"down_votes":0,"body":"I level Q first, granted I play Mid Zyra not Support","replies":[{"poster":"Vekkna","date":"2016-05-09T05:04:21.675+0000","up_votes":1,"down_votes":0,"body":"Yeah, that sick OP 180 damage at rank 5. So strong. It's not worth leveling first over E when e does more damage and scales your cc. Ever. Q is trash.","replies":[]}]}]}]}]},{"poster":"warpenguin555","date":"2016-05-08T16:23:53.493+0000","up_votes":3,"down_votes":0,"body":"master yi has a 42% winrate huh. can we keep him there?\n\nswain needs massive buffs tho","replies":[]},{"poster":"Wolfram Oxford","date":"2016-05-09T00:45:29.806+0000","up_votes":2,"down_votes":0,"body":"So am I the only one that feels like Cass was one of the minor changes...they basically fucked with her passive for no reason and made her w a little bit better, not to mention E range nerf and CD. They pretty much nerfed her tbh.","replies":[]},{"poster":"Xilixer","date":"2016-05-08T05:49:13.898+0000","up_votes":2,"down_votes":0,"body":"the problem with vel'koz is for his ult to matter you HAVE to activate passive before ult. whereas before you could just throw out an ult and be good.","replies":[]},{"poster":"alfavhunter","date":"2016-05-08T01:23:57.532+0000","up_votes":1,"down_votes":0,"body":"They ruined anivias R\n\nIt's Worse for zone control now because you never get to charge it to max","replies":[{"poster":"Mister Support","date":"2016-05-08T03:10:53.624+0000","up_votes":2,"down_votes":0,"body":"Really? I think she's more powerful utility wise from the changes. Hell I tried her support a few times and loved it. The total size is larger, to where you set it and after 2ish seconds it will cover wall to tower, making the enemy back off. It's just having to plan ahead of time where it's needed, and making use of it more as a zone tool to force the enemy in a desired path or they take free damage. Though I do agree on expanse time being too high.","replies":[]}]}]}