{"poster":"Vente1","date":"2015-02-01T08:39:27.759+0000","title":"How Riot is Better than the Government","subforum":"Miscellaneous","embed":{"description":null,"url":"http://imageshack.com/a/img673/5365/Rr242B.png","image":null},"up_votes":2,"down_votes":1,"body":"Just a thought I had during economics class. Mainly relates to the Australian government, but could be applied to most of them really. Discuss.","replies":[{"poster":"Yolo Babaduchi","date":"2015-02-01T08:46:39.765+0000","up_votes":3,"down_votes":0,"body":"Plus, Riot is not run by Tony Abbott.","replies":[{"poster":"SEKAI","date":"2015-02-01T11:52:19.557+0000","up_votes":2,"down_votes":0,"body":"You never know.............................\n\nMaybe Abbott is secretly a game enthusiast who makes real world bad so people would engage in games more..........","replies":[{"poster":"Dawaraven","date":"2015-02-02T04:21:42.331+0000","up_votes":1,"down_votes":0,"body":"▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄▼ ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ▼ ◄ ▲ ►◄ ▲ ► ▼ ◄ ▲ ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ► ▼ ◄ ◄ ▲▲ ► ▼ ◄▼ ◄ ◄ ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄▼ ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ▼ ◄ ▲ ►◄ ▲ ► ▼ ◄ ▲ ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ► ▼ ◄ ◄ ▲▲ ► ▼ ◄▼ ◄ ◄ ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲ ► ▼ ◄ ▲","replies":[]}]},{"poster":"Vente1","date":"2015-02-02T08:33:54.763+0000","up_votes":1,"down_votes":0,"body":"That is very true","replies":[]}]},{"poster":"Shes my Princess","date":"2015-02-01T14:28:07.249+0000","up_votes":2,"down_votes":0,"body":"This isn't very correct at all LOL\n\n\"Employs politicians with very little practical experience\". Wat? \nThe government doesn't deal with fun. It deals with life.\nGovernment sites are as helpful and as succinct as possible, unless it's Centrelink.\nInefficient monetary systems, c'mon man. Srsly?\n\nSource: Econs major @UWA with an interest in politics. Also, anti-LNP just if wondering. This is just silly :p","replies":[{"poster":"SEKAI","date":"2015-02-02T08:06:17.382+0000","up_votes":2,"down_votes":0,"body":"Don't get too far into politics, you will want to poke your eyes out with a spoon and bleed yourself to death if you do.\n\nThere is a reason to why people mostly associate \"politics\" with negative meanings while, \n\nthe positive counterpart is called something else.","replies":[]},{"poster":"Vente1","date":"2015-02-02T08:54:07.960+0000","up_votes":1,"down_votes":0,"body":"Of course it's silly, all I know is what I've learned from the internet and two years of highschool economics :P\n\n* Most of this is guesswork, but anyway, I would imagine that a majority of politicians have only ever *been* politicians in their lives - hence their ability to make informed decisions on subjects involving, say engineering, medicine or science (e.g. what regulations should be built around them or where funding should go) is somewhat limited.\n\n* Life is about fun isn't it? :P Of course it's not a necessity, but a government that actually made you excited about its new prospects would be an interesting change for once wouldn't you agree.\n\n* I'll admit while doing university applications I found the government websites to be surprisingly useful, but there's always room for improvement - especially around things such as taxes, from what I hear\n\n* And finally, the government could definitely take a hint from Riot on their core values, specifically clarity ;P It's not often that you'll get to see the full and honest behind-the-scenes picture on why the government does what it does - not if you're just one of the general public anyway\n\nWhy be anti-LNP if you could be pro-Benevolent-Dictatorship? :D","replies":[]}]},{"poster":"Garens Harem","date":"2015-02-02T09:21:47.593+0000","up_votes":1,"down_votes":0,"body":"biased lel","replies":[]},{"poster":"Garens Harem","date":"2015-02-02T09:18:45.805+0000","up_votes":1,"down_votes":0,"body":"biased lel","replies":[]},{"poster":"PlayDis","date":"2015-02-01T14:18:08.071+0000","up_votes":1,"down_votes":0,"body":"Would be nice if Riot taxed high elo players off their RP and gave it to low elo players ;)\n\nRiot-Many recognisable champions, nerfed and buffed to improve gameplay\nGovernment-Who dafuq are these people, how do I nerf their use of our tax payments.","replies":[]}]}