{"poster":"MasterMirkinen","date":"2015-03-02T22:27:36.044+0000","title":"Merchandising Store Update","subforum":"Announcements","embed":{"description":"The Riot Games merch store is here! Discover merch crafted to capture the spirit of League in every stitch and brushstroke, so you can carry a piece of your game wherever you go.","url":"https://oce.merch.riotgames.com/en/","image":"https://d3elnwgmypt3ua.cloudfront.net/media/wysiwyg/misc/Home_Banner.jpg"},"up_votes":3,"down_votes":0,"body":"As some of you may know, we soft launched the Riot Games Merch Store Beta back in December. We’ve used the past three months to gather feedback, observe patterns and identify ways to level up both our product offering and our service. On the product offering side we have introduced some new items in the store which you can check out [here ](https://oce.merch.riotgames.com/en/). On the service side of things, we have identified some challenges with our logistics so we will be changing our approach.\r\n \r\nDuring the initial phase of beta, we heavily subsidized the cost of shipping products to OCE – which reached as high as $100 for some items – as we tested our supply chain and established the actual cost of doing business in this way. We learned that shipping from NA was the most sustainable way to get merch to OCE in the short term.\r\nSo beginning today, Oceanic store shipments will no longer be shipped from our distribution center in Hong Kong and instead will be fulfilled from North America. Shipping from NA is cheaper and will allow us to offer OCE players $10 flat rate shipping on most items (extra-large boxes cost more, like statues and orders with 4 or more items).\r\n \r\nAs part of this move to NA, the OCE website will initially be denominated in USD. This will result in an increase in effective prices of ~12% due to the recent depreciation of the Australian Dollar against the US Dollar. Our intention has always been to charge the same prices in USD as we do in AUD, and we had not yet adjusted AUD prices to account for the shift in exchange rates. In USD, the OCE store prices will be at parity with other regions.\r\nOver the longer term, we’ll continue to evaluate ways to improve the merch experience. If you have any questions about the merch store please post them in the comments below.","replies":[{"poster":"Preminition","date":"2015-03-03T20:45:06.459+0000","up_votes":1,"down_votes":1,"body":"Something that may be cool, extending the rewards people can get for getting higher in the ranked tier past the virtual world. It wouldn't have to be something big. Like a set of posters, each with a different colored border that correspond with the ranked leagues, and the same image in the center. You are only eligible to purchase the poster with the border that you ended last season in, or are currently in. Just an idea, take it or leave it.","replies":[{"poster":"Zero Infinity","date":"2015-03-04T02:20:19.819+0000","up_votes":1,"down_votes":0,"body":"How about if you achieve a certain amount of honor you can get Merch store vouchers.","replies":[{"poster":"MasterMirkinen","date":"2015-03-04T03:47:56.733+0000","up_votes":2,"down_votes":0,"body":"I like this one!\nI'll send this over.\n\nThe team has a huge backlog of features / ideas so may not be taken into consideration right away but thanks for submitting it.","replies":[]}]},{"poster":"MasterMirkinen","date":"2015-03-03T23:12:29.570+0000","up_votes":2,"down_votes":0,"body":"This is interesting.\n\nI think with merchandising we are trying to extend the universe of League for the most passionate fans. As a player, at home I want to have the best imagery possible for a League, I want a piece of art that reminds me of the Universe, not my poor (or good in your case) rank status...\n\nBasically I'm not sure as a bronze player I would want to buy a poster with the bronze border...\nI also think it may alienate some players...\n\nWhat do you think?","replies":[{"poster":"Preminition","date":"2015-03-04T00:46:10.135+0000","up_votes":1,"down_votes":0,"body":"Well that's why i didn't outright suggest only allowing something to be bought by, lets say, gold+ players. That would indeed be a stupid marketing decision to begin with, and would definitely alienate lower ranked players. But i think having the option of buying a poster, where the main attraction is the image in the center, like a collage of all the released champion portraits at the time for example, with a border around the outside much like the one during the loading screen going into a game as an added bonus, would definitely be cool. You could possibly even have another option of no border, for people that may be in bronze and don't want a bronze border hanging on their wall. I just think having something in the store that people could buy that shows their rank if they wanted, would only enhance the player base's willingness to progress in ranked. And i also think as long as the poster looks good, you'd get the same amount of people from bronze/silver/gold buying the poster that you would have anyway (and just getting it with no border), but then i think you'd find you would get a lot more sales from people in higher leagues than you normally would. What plat/diamond/masters/challenger player wouldn't want to buy something like that! \n\nI'm just using a poster with a border as an example, but it could be anything, from a poster, to clothing, through to figurines if you wanted to go that far with it. To put that into context, figurines may have a different colored base and clothing may have a small logo representing the league somewhere, with the actual figurine and design on the clothing remaining the same. Again, just an idea, i think it would be cool to have something like that in the store that i could work towards, rather than just virtual trophies. Thanks for responding :)","replies":[]}]}]},{"poster":"ForPortal","date":"2015-03-04T00:53:42.229+0000","up_votes":2,"down_votes":0,"body":"There's nothing there right now that I want to pick up, but I'm glad there's official League of Legends merchandise being produced. I'll have to have a look every now and again to see what is added.","replies":[{"poster":"MasterMirkinen","date":"2015-03-04T01:29:26.768+0000","up_votes":1,"down_votes":0,"body":"I had to buy a Braum Bodybuilders Tee...\n\nbut yes, there will be more product coming out. We are still in beta and exploring many things so keep an eye :)","replies":[{"poster":"DrNecroFlackMoe","date":"2015-03-04T14:01:05.473+0000","up_votes":1,"down_votes":0,"body":"You's should make a thingy like ocean week where you reach that goal instead its IP every stage you get 1,000 IP wouldn't that be cool?","replies":[]}]}]},{"poster":"Tokidoki Blokey","date":"2015-03-03T13:17:57.437+0000","up_votes":2,"down_votes":0,"body":"Doesn't look like the site works very well because I tried to log in to buy some things and it doesn't let you change your region from anything other than North America -_-\nTried to look at the FAQ and other things on the site to see if the store was for US residents only and kept getting an error saying I've taken a wrong turn. So if I hadn't kept searching and looked on the forums I would've assumed that we can't buy any merch here in Aus.\nWould be nice if this was fixed so I can give you some money Riot.","replies":[{"poster":"MasterMirkinen","date":"2015-03-03T23:06:59.970+0000","up_votes":1,"down_votes":0,"body":"Thanks for the report Tokidoki Blokey,\nthis was a mistake. It should be fixed now.\n\nLet us know.","replies":[{"poster":"Tokidoki Blokey","date":"2015-03-04T00:41:36.826+0000","up_votes":2,"down_votes":0,"body":"Still having problems. It has Oceania there now but when I go to log in it seems to accept my username and password then just goes back to the log in screen as if nothing happened. Also every time I try add anything to the cart and checkout it keeps saying that the cart is empty :/ \nI can't be the only one with this problem?","replies":[{"poster":"MasterMirkinen","date":"2015-03-04T01:28:17.553+0000","up_votes":1,"down_votes":0,"body":"I just tried to place an order and it worked for me.\nWhat browser are you using?\nHave you tried to clear your browsing data?","replies":[]}]}]}]},{"poster":"Zero Infinity","date":"2015-03-03T02:11:19.385+0000","up_votes":2,"down_votes":0,"body":"I had an idea, that could possibly fit into the Merch store.\nAs we know lot's of people like to make all sorts of fan art!\n\nMy idea is they could send them in to say All Chat.\nA selection of the art, even just the featured art initially, could be placed in the Merch store, as a Auction with a Buy It Now option.","replies":[{"poster":"MasterMirkinen","date":"2015-03-03T04:13:41.233+0000","up_votes":1,"down_votes":0,"body":"Thanks for the suggestion Skyprus.\nI like the idea. I'll pass it to the merch team and see what they think.","replies":[]}]}]}