{"poster":"Silberrücken","date":"2015-07-30T20:39:12.062+0000","title":"Habe 6 Ranked Spiele hintereinander Verloren. Was mache ich Falsch?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":1,"body":"Ich habe heute 6 Spiele hintereinander verloren und blicke nicht ganz durch was ich h&auml;tte besser machen k&ouml;nnen um dies zu vermeiden. Meine mechanics und mein Spielwissen sind relativ gut jedoch weiss ich wirklich nicht was ich gegen den ganzen Flame und die &uuml;bertrieben frustrierten Spieler tuen soll die nach einem Death direkt M&uuml;tter und Nationalit&auml;ten in den Dreck ziehen m&uuml;ssen.\r\n\r\nGame #1 Kalista - War mein erstes Spiel des Tages und hier muss ich wohl zugeben das es gr&ouml;sstenteils meine Unf&auml;higkeit war und ich dieses Spiel deshalb nicht carrien konnte. Loss @ 31:18\r\n\r\nGame #2 Viktor - 2 Teammates picken beide Support und fangen an zu flamen. Die Teammotivation ist nach den ersten 5 Minuten bei 0 angekommen und die ersten Mates schreiben bereits /FF und flamen sich noch einen tick h&auml;rter. Loss @ 33:26\r\n\r\nGame #3 Ezreal - Ich gewinne meine Lane und versuche mehr mappressure aufzubauen indem ich der Midlane helfe. Er (Viktor) feedet die Gegner und geht dann f&uuml;r 15 MInuten afk und schiebt am ende der Runde alles auf &quot;Laggs&quot;. Top/MId/Jungle verlieren alle gegen ihr Matchup und flamen nach c.a. 10 MInuten Spielzeit. Loss @ 38:04\r\n\r\nGame #4 Vladimir - Die Lanephase l&auml;uft f&uuml;r mich soweit gut bis der gegnerische TF anf&auml;ngt zu roamen. Wie sich herausstellt war das ein Dia+ Smurf der uns einfach systematisch zerst&ouml;rt. Trotz meines 70cs leads gegen Shen beende ich die Runde mit 3/9. Loss @ 34:05\r\n\r\nGame #5 Anivia - Ich gewinne soweit meine Lane und der gegnerische Rengar beginnt die Mitte zu campen. Daraufhin versuche ich so passiv wie m&ouml;glich zu spielen, farme einfach unter dem Turm und hole mir bei jedem back eine Pinkward. Unser Rumble Top verliert die Lane und beginnt zu flamen. Er und Lee sin geraten in einen Streit und Rumble entscheidet sich dazu den Rest der Runde auf der Toplane zu bleiben und keinem einzigen Teamfight beizutreten. Loss @ 43:41\r\n\r\nGame #6 Jinx - Evelynn und Nidalee gehen beide Jungle. Nidalee spammt &quot;Fucking russians can&acute;t play&quot; im Teamchat w&auml;hrend sie zum Spass in den gegnerischen Talon reinl&auml;uft und ihm kills feedet. Loss @ 19:16\r\n\r\n/Rant\r\nDas sind Ranked Soloqueue Spiele im Platin 4 Bereich und in jeder Runde beleidigen sich mindestens 2 Personen gegenseitig w&auml;hrend ich wie ein Depp versuche alles gut zu reden.","replies":[{"poster":"MeMyselfandBaal","date":"2015-07-30T23:21:38.611+0000","up_votes":2,"down_votes":0,"body":"Ich hätte spätestens nach dem 3. Spiel für heute aufgehört. Manchmal läuft es halt nicht, und das sinnloseste, was man machen kann, ist der Versuch, sein Glück zu erzwingen.","replies":[{"poster":"Silberrücken","date":"2015-07-31T02:29:28.497+0000","up_votes":1,"down_votes":0,"body":"Höchstwahrscheinlich hast du recht. Es ist doch etwas mad einfach durch eine losingstreak zu grinden aber ich bin jetzt wieder plat 4 :D also worth","replies":[]}]},{"poster":"Imb4lanced","date":"2015-07-31T11:20:26.179+0000","up_votes":1,"down_votes":0,"body":"einfach nicht übers verlieren oder gewinnen sorgen machen. Sondern nur über deine eigene leistung, deine eigene fehler. wenn du mit jedem spiel nicht besser wirst, egal ob in sieg oder niederlage, wirst auf der stelle stehen. Mal 6 games gewinnen und mal 6 games verlieren. \n\n6 games in einer season, wo man meist an die 600-1000 macht, sind nur ein tropfen auf dem heißen stein.","replies":[]},{"poster":"Requzz","date":"2015-07-30T20:45:42.256+0000","up_votes":1,"down_votes":1,"body":"lol ich hab auch gerade einen feeetttten losestreak von plat 4-5 :D  ich glaub manchmal hat man in plat kein luck und kriegt halt shit mates die nicht tryharden.\neinfach bisschen pause machen  was bei mir sonst immer klappt aber momentan nicht :D btw hab ca. 4k ranked games und hänge plat 5 rum ^^\n\ngood luck und viel spaß trotzem noch.","replies":[{"poster":"Silberrücken","date":"2015-07-30T21:34:07.308+0000","up_votes":1,"down_votes":0,"body":"jo bin auch gerade von plat 4 auf plat 5 gedropped.. ich häng seit gut 300 spielen zwischen plat 5-3","replies":[{"poster":"Avorox","date":"2015-07-30T23:45:49.455+0000","up_votes":1,"down_votes":0,"body":"Ist normal in Platin. Ich schwanke auch seit Monaten zwischen Platin 3 - 1. Manche Leute sind dort einfach dermaßen überheblich und machen daher viele Fehler, daher sind solche Losingstreaks keine Seltenheit. Einfach weiter machen irgendwann fängt sich das wieder.","replies":[{"poster":"Silberrücken","date":"2015-07-31T02:34:42.721+0000","up_votes":1,"down_votes":1,"body":"ja aber mich würde gern interessieren warum das ganze in Schüben kommt. Es ist ja eine richtige Seltenheit weniger als 3 Spiele hintereinander zu verlieren. Manchmal kommt es mir so vor als würde das Matchmaking einen nach einem Loss mit anderen Leuten zusammen packen die ihr letztes Spiel verloren haben. Ist wahrscheinlich Einbildung aber in Platin sind die Leute teilweise wirklich krass. Ich verstehe nicht wieso in nahezu jedem Spiel jemand dabei ist der seine Teammates Beleidigen muss.","replies":[]}]}]}]},{"poster":"thecrazykangaroo","date":"2015-08-02T09:41:51.118+0000","up_votes":1,"down_votes":1,"body":"Ich fühl mit dir hab gerade eine 7 game lose strecke ich will nicht mehr lol spielen. Keinen plan was ich anders machen soll 23/7/18 als sup und dennoch verliere ich. Wegen feed afk oder richtig dummen einzel aktionen meiner teammates ping wie ein depp das sie weg  sollen bleiben und werden weggenascht.","replies":[]}]}