{"poster":"ChaosMeteora","date":"2016-02-21T12:17:00.153+0000","title":"Mit Freunde ranken...? nicht...? Rito pls :(","subforum":"Karten & Spielmodi","up_votes":4,"down_votes":2,"body":"Servus, \r\n\r\nkennt jemand eine M&ouml;glichkeit mit seinen Freunden zu ranken die lower sind (smurfs mal au&szlig;er acht gelassen) ?\r\n\r\n Ich hab ja generell kein Problem damit wenn man nicht mehr DuoQ mit seinen Freunden spielen kann die bisschen weiter unten sind (Boosting etc) aber durch das deaktivieren von Teamrankeds (im weitesten Sinne) habe ich nun keine M&ouml;glichkeit mehr mit meinen Freunden Rankeds zu spielen die z.B. Bronze eingeteilt wurden... und n Smurf wieder zu leveln dauert zu lange... wenns da keine M&ouml;glichkeit gibt, wei&szlig; jemand ob/wann Teamranked wieder zur&uuml;ck kommt? Ich glaube nicht das sich das jetzige &quot;Teamranked&quot; lange halten wird da man in vielen f&auml;llen halt nicht mit seinem &quot;Team&quot; spielen kann. Thema verfehlt, Rito, setzen sechs?\r\n\r\nMfG ChaosMeteora","replies":[{"poster":"Maexle","date":"2016-02-21T12:24:06.731+0000","up_votes":7,"down_votes":0,"body":"Das finde ich auch ziemlich blöd, dass es kein richtiges Teamranked gibt, das ja durch die dynamic Queue ersetzt wurde. Riot meinte in den Preseason-Ankündigungen, dass sie die dynamic Queue einführen, damit man mit mehr als einem Freund ranked spielen kann aber das aktuelle System verhindert das. Vor der Preseason wollten sie auch das 5v5 Teamranked bestehen lassen, damit man eben mit Leuten spielen kann, die mehr als eine Liga unter bzw. über dir sind. Ich halte das eben auch für ein großes Problem, dass von Riot kaum Aussagen getätigt werden, ob es das 5er Ranked geben wird oder wann die SoloQ rauskommt. \nIm Moment hat man also tatsächlich keine andere Möglichkeit, als zu smurfen oder 3v3 Ranked zu spielen. {{champion:17}}","replies":[]},{"poster":"Fcktardmagnet","date":"2016-02-22T12:47:16.051+0000","up_votes":3,"down_votes":1,"body":"Es gibt keine Möglichkeit, habe dasselbe Problem.\n\nWer auf die Idee gekommen ist in einem Spiel, welches auf competitives Gaming ausgelegt ist, die Möglichkeit zu entfernen mit Freunden zusammen competitives Gaming zu betreiben, gehört entlassen. \n\nUnd wofür das ganze?! Ich sehe den Sinn dahinter nicht, eine Season zu starten ohne Teamranked und SoloQ. Früher konnte ich als Solospieler antreten gegen andere Solospieler oder im Höchstfall 2er Premades, das war okay. Heute bin ich als Solospieler nichts als Füllmaterial für Premadeteams, mit denen ich mich aber überhaupt nicht messen möchte. Ich möchte mich messen mit Spieler die dieselben Vorraussetzungen haben wie ich. Momentan ist dies nicht gegeben, weshalb ich auch ohne SoloQ kein einziges Spiel mehr machen werde. \nFrüher konnte ich mit Buddys ein Ranked Team starten, ohne Beschränkung, heute wird mir verwehrt mit denselben Spieler ranked zu spielen. Hat dies irgendeinen positiven Aspekt den ich einfach nicht verstehen will? \n\nDer EINZIGE Aspekt der mir einfällt, der eine \"Verbesserung\" zu vorher darstellt ist, dass man nun zu viert ranked spielen kann, sofern betreffende Spieler die Vorraussetzungen erfüllen. Was sich allerdings genau dann wieder erledigt haben wird wenn die SoloQ irgendwann startet. Kein Solospieler wird so doof sein sich dann noch freiwillig in der Dynamic Q anzumelden, was das Spielen als 4er Team wieder genauso unmöglich macht wie vorher.\nDies ist auch der Grund warum die SoloQ zurückgehalten und Teamranked abgeschaltet wurde, die Dynamic Q wäre nicht überlebensfähig ohne die Spieler, die sie nicht spielen würden wenn sie die Wahl hätten.\nMan zwingt die Spieler damit in diese dynamic Q, die fast ausnahmslos eine Verschlechterung zu vorher darstellt und verwehrt ihnen andere Modi um sie überhaupt am Leben zu erhalten. \nAber warum!? Für was!? Wieso hat man nicht einfach die neue Champ Select live gebracht und die Modi so gelassen wie sie waren?","replies":[{"poster":"Korean Wolf","date":"2016-02-23T09:28:10.345+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pl4t1numX,realm=EUW,application-id=cGRapXds,discussion-id=TVIyoxf2,comment-id=0002,timestamp=2016-02-22T12:47:16.051+0000)\n>\n> Es gibt keine Möglichkeit, habe dasselbe Problem.\n>\n> Wer auf die Idee gekommen ist in einem Spiel, welches auf competitives Gaming ausgelegt ist, die Möglichkeit zu entfernen mit Freunden zusammen competitives Gaming zu betreiben, gehört entlassen. \n>\n> Und wofür das ganze?! Ich sehe den Sinn dahinter nicht, eine Season zu starten ohne Teamranked und SoloQ. Früher konnte ich als Solospieler antreten gegen andere Solospieler oder im Höchstfall 2er Premades, das war okay. Heute bin ich als Solospieler nichts als Füllmaterial für Premadeteams, mit denen ich mich aber überhaupt nicht messen möchte. Ich möchte mich messen mit Spieler die dieselben Vorraussetzungen haben wie ich. Momentan ist dies nicht gegeben, weshalb ich auch ohne SoloQ kein einziges Spiel mehr machen werde. \n> Früher konnte ich mit Buddys ein Ranked Team starten, ohne Beschränkung, heute wird mir verwehrt mit denselben Spieler ranked zu spielen. Hat dies irgendeinen positiven Aspekt den ich einfach nicht verstehen will? \n> \n> Der EINZIGE Aspekt der mir einfällt, der eine \"Verbesserung\" zu vorher darstellt ist, dass man nun zu viert ranked spielen kann, sofern betreffende Spieler die Vorraussetzungen erfüllen. Was sich allerdings genau dann wieder erledigt haben wird wenn die SoloQ irgendwann startet. Kein Solospieler wird so doof sein sich dann noch freiwillig in der Dynamic Q anzumelden, was das Spielen als 4er Team wieder genauso unmöglich macht wie vorher.\n> Dies ist auch der Grund warum die SoloQ zurückgehalten und Teamranked abgeschaltet wurde, die Dynamic Q wäre nicht überlebensfähig ohne die Spieler, die sie nicht spielen würden wenn sie die Wahl hätten.\n> Man zwingt die Spieler damit in diese dynamic Q, die fast ausnahmslos eine Verschlechterung zu vorher darstellt und verwehrt ihnen andere Modi um sie überhaupt am Leben zu erhalten. \n> Aber warum!? Für was!? Wieso hat man nicht einfach die neue Champ Select live gebracht und die Modi so gelassen wie sie waren?\n\n\nDen genauen Sinn kann dir ausser Riot wohl keiner erläutern. Nichts desto trotz kannst du 4er Premade Teams nicht pauschalisieren.\nIch spiele oft mit 3 anderen Freunden, und wir versuchen weder dem Solo Spieler eine andere Rolle aufzuzwängen, noch trollen wir ihn, noch schließen wir ihn aus. Wir versuchen ihn a) ins Teamspeak zu holen sofern er/sie möchte oder b) ihn/sie über alles zu informieren was wir machen möchten. Pings werden benutzt und in ruhigen Rotas erklären wir ihm/sie was wir machen möchten.\nDie Vorrausetzung ist für alle immernoch die Selbe. Die Elo.\nDie einzige Variable die sich ändert, sind Premades. Was anfürsich garnicht so schlimm ist, da es damals diverse Tricks gab wie man auch zu dritt in eine Queue konnte ( Wer weiß wie oft du mit oder gegen 3er gespielt hast und gewonnen hast?).\nAber da ich dir in deiner Kernaussage recht gebe, will ich nicht sagen, dass ich DynQ komplett gut finde.\n\nEben weil Teamranked disabled ist, gibt es nun eben vermehrt Smurfs in den Ligen, da die Leute wie gewohnt mit ihren Mates zocken wollen.\nUnd wenn man eben gegen ein 5er Team agieren muss, die a) Smurfs beinhalten oder/und b) eine Menge Erfahrung haben in der jeweiligen Konstellation, wird es eben auch für 5er Premade Random Gruppen schwer. \nMan kann nicht davon ausgehen, dass 5 Freunde die ab und an mal zusammen zocken, in einem Team genauso gut agieren wie ein eingespieltes Team, und genau da ist der Knackpunkt. Ich denke , dass wenn man Teamranked wieder aktiviert, auch Dynamic Queue gleichzeitig etwas balancieren würde.\n\nBerichtige mich wenn ich falsch liege, aber ich meine gelesen zu haben, dass die SoloQ Wertung einfluss auf die DynamicQ haben wird.\nZudem fallen die Belohnungen in der SoloQ sehr niedrig aus. Ergo müssen selbst Solo Spieler die die vernünftigen Belohnungen wollen, auch weiterhin DynamicQ spielen.\nWarum man die Spieler so in die DynQ forced, versteh ich auch nicht ganz. Das Grundprinzip ist klar - Mehr Spieler - Besseres Matchmaking.\nLeider ist das Ergebnis was Riot erzielen möchte, etwas verfehlt.\n\n\nWenn du von einer \"ausnahmslosen Verschlechterung\" sprichst, muss ich dir ehrlich sagen, tust du dies nur weil du Mad bist.\nObjektiv betrachtet, hat die DynQ schon Vorteile - Allein die Tatsache mit der Rollenverteilung. Nur aufgrund der Umstände wird dies eben nicht so wahrgenommen, da man sich mit Recht in die Queue reingedrückt fühlt.","replies":[]}]},{"poster":"FuryFøx","date":"2016-02-22T15:02:16.066+0000","up_votes":1,"down_votes":0,"body":"Lass einfach den Spieler in der Mitte einladen.\nWenn ihr z.B. Bronze, Silber, Gold seid, dann kann der Bronze den Goldspieler nicht einladen,\nder Silberspieler kann beide einladen. Das geht natürlich nur wenn ihr nicht zu weit auseinander seid.\nHoffe ich konnte helfen.","replies":[{"poster":"ChaosMeteora","date":"2016-02-22T20:36:31.376+0000","up_votes":1,"down_votes":1,"body":"von bronze zu plat alles dabei ;( aber trotzdem danke :)","replies":[]}]},{"poster":"Shadow l Eagle","date":"2016-02-21T14:00:15.490+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=ChaosMeteora,realm=EUW,application-id=cGRapXds,discussion-id=TVIyoxf2,comment-id=,timestamp=2016-02-21T12:17:00.153+0000)\n>\n> Servus, \n> \n> kennt jemand eine M&ouml;glichkeit mit seinen Freunden zu ranken die lower sind (smurfs mal au&szlig;er acht gelassen) ?\n> \n>  Ich hab ja generell kein Problem damit wenn man nicht mehr DuoQ mit seinen Freunden spielen kann die bisschen weiter unten sind (Boosting etc) aber durch das deaktivieren von Teamrankeds (im weitesten Sinne) habe ich nun keine M&ouml;glichkeit mehr mit meinen Freunden Rankeds zu spielen die z.B. Bronze eingeteilt wurden... und n Smurf wieder zu leveln dauert zu lange... wenns da keine M&ouml;glichkeit gibt, wei&szlig; jemand ob/wann Teamranked wieder zur&uuml;ck kommt? Ich glaube nicht das sich das jetzige &quot;Teamranked&quot; lange halten wird da man in vielen f&auml;llen halt nicht mit seinem &quot;Team&quot; spielen kann. Thema verfehlt, Rito, setzen sechs?\n> \n> MfG ChaosMeteora\n\n\ngehe jetzt nur auf ende ein.\n\nDas FAQ dazu haste wohl nie gelesen oder wenigstens mal durchgeschaut oder ?\n\nNaja Dynamic QUEUE wird nur bis ende 2016 / anfang 2017 angesetzt solang wird das Teamranked verbessert / erweitert etc etc etc kurz und knapp freunde dich mit der Dyn Q an du siehst TR dieses Jahr nicht mehr","replies":[{"poster":"ChaosMeteora","date":"2016-02-22T10:43:01.830+0000","up_votes":2,"down_votes":1,"body":"Wer liest sich das FAQ durch xD\n\nich hab ja kein Problem damit mich mit der DynQ anzufreunden, nur das ich da nicht mit Freunde spielen kann, damit hab ich n großes Problem","replies":[]}]}]}