{"poster":"Party at my Lane","date":"2016-11-21T21:29:45.675+0000","title":"Perma Ban ungerechtfertigt? Ich glaube nicht...","subforum":"Spielerverhalten & Moderation","up_votes":9,"down_votes":0,"body":"Liebe Spieler/innen,\n\nich lese hier leider sehr oft das Spieler mit Ihrem Ban unzurfrieden sind und das dieser nicht gerechtfertigt w&auml;re, oftmals lese ich mir dann die Text wall der Personen durch und stelle fest, das mit diesem Schreibstil ein ban aller wahrscheinlichkeit nach zu 100% gerechtfertigt ist.\n\nGenau so lese ich sehr oft das Spieler der Meinung sind ihr einmaliges Fehlverhalten sollte nicht der Ausl&ouml;ser f&uuml;r eine permanente Account Sperrung sein.\nAn dieser Stelle schweife ich mal ein bisschen ab in meine Vergangenheit.\n\nAls ich Mitte Season 3 Level 30 erreicht hatte und anfing Rangliste zu spielen landete ich nach den Placements in Bronze 5, selbstverst&auml;ndlich war ich der Meinung ich geh&ouml;re dort nicht hin und meine Teammates w&auml;ren einzig und allein daran schuld das ich dort bin. Also began ich zu &uuml;ben und zu &uuml;ben und zu &uuml;ben und wurde schlie&szlig;lich besser, jedoch hing ich immer noch in Bronze fest. Wie so oft wenn der &quot;innerliche Schweinehund&quot; &uuml;ber einen siegt suchte ich den Fehler nicht bei mir sondern bei meinen Mitstreitern. Ich kritisierte (nicht konstruktiv), machte Spieler runter und beleidigte sie auf schlimme Weise.\n\nMit der Zeit war ich in der Lage die Spiele alleine zu gewinnen und spielte mich mit dem Sozialverhalten eines &quot;R&uuml;ppels&quot; nach Silber. Dort angekommen hing ich wieder in der Ladder fest und benahm mich weiterhin wie auch schon zuvor komplett daneben. Es folgte was folgen musste, eine Chat Sperre traf ein. \n\nDiese Chat Sperre lehrte mich mein Verhalten zu &uuml;berdenken, somit began ich mein Verhalten zu ver&auml;ndern. Leider war es bei mir immer wie bei Jekyll und Hyde. Mal benutzte ich den Chat positiv um mein Team anzuf&uuml;hren und mal um mein Team zu flamen. Es kam wie es kommen musste die n&auml;chste Chat Sperre kam zur T&uuml;r. \n\nIch spielte die notwendigen Spiele und machte weiter wie bisher. Nach einiger Zeit kam selbstverst&auml;ndlich der erste Ban. 3 Tage Sperre wegen toxischem Verhalten. Wie alle die hier gesperrt wurden war ich der festen &Uuml;berzeugung mein Verhalten w&auml;re v&ouml;llig in Ordnung und der Ban ungerechtfertigt. Also weiter wie bisher. Keine Woche sp&auml;ter kam der n&auml;chste Ban &uuml;ber 7 Tage. Naiv wie ich war dachte ich nat&uuml;rlich es w&auml;re wieder ungerechtfertigt, spieltet etwas auf meinem Smurf und ging 7 Tage sp&auml;ter zur&uuml;ck auf meinen Main Account. Nach ca. einem Monat weiterhin negativen Verhaltens wurde ich f&uuml;r 2 Wochen gesperrt und wendete mich an den Support um mit diesem &uuml;ber die ungerechte Sperre zu reden. \n\nGott sei dank hatte ich einen &uuml;beraus geduldigen und freundlichen Supporter in diesem Gespr&auml;ch. Er erkl&auml;rte mir mein Fehlverhalten zeigte mir Chat Verl&auml;ufe und &ouml;ffnete mir die Augen. Er zeigte mir all das was ich in den vergangen Wochen im Chat losgelassen habe und sagte anschlie&szlig;end folgenden Satz: &quot;Denke mal bitte ernsthaft &uuml;ber DEIN Verhalten nach unabh&auml;ngig vom Spiel selbst, noch eine Temp&ouml;r&auml;re Sperre wird es nicht geben du hast jetzt s&auml;mtliche Verwarnungen und Sanktionen hinter dir.&quot;\n\nDieses Gespr&auml;ch hat mir die Augen ge&ouml;ffnet und gezeigt das ich das Problem bin und nicht meine Teams. Ich selbst habe durch mein extrem negatives Verhalten Spiele verloren, Leuten die Motivation geraubt und vielleicht auch andere Spieler seelisch verletzt. \n\nIch kann euch wirklich nur einen ernst gemeinten Rat geben. Denkt &uuml;ber euer Verhalten nach eine permanente Sperre kommt nicht ohne Vorwarnung. \nNachdem ich mein Verhalten ge&auml;ndert habe, konnte ich das Spiel auch wieder viel mehr genie&szlig;en. Jedem brennen mal die Sicherung durch und man benimmt sich daneben, aber das wei&szlig; Riot deswegen verwarnt dich das System wenn du dich schlecht benommen hast.\n\n\nFalls es manchen immer noch nicht die Augen ge&ouml;ffnet hat m&ouml;chte ich nun gerne nochmal etwas er&ouml;rtern.\n\nWas genau bringt einem das flamen eines Feeders, Flamers oder was auch immer? (Antworten gerne in die Kommentare)\n.\n.\n.\n.\n.\nRichtig. Es bringt euch exakt nichts. Ihr nehmt euch selbst den Fokus aufs Game, demotiviert den Spieler den ihr Verbal attackiert und sorgt daf&uuml;r das sich alle aufs Chatten konzentrieren und dadurch Minions verlieren, T&uuml;rme oder sogar sterben.\n\nIch habe mich mittlerweile nach Platin 5 gespielt. Ich bin mir ziemlich sicher. dass das nicht nur an meinem Gameplay liegt sondern auch vielmehr daran, das ich versuche den Chat positiv zu halten. Wenn ein Spieler feedet und daraufhin anf&auml;ngt zu flamen bringt es nichts gegen an zu gehen. (Man kann Feuer nicht mit Feuer bek&auml;mpfen.) Bleibt cool versucht ihn mit positiven Dingen Mut zu zu sprechen und versucht ihm durch Ganks zu helfen. Lasst ihm einen Kill oder was auch immer seid kreativ Freunde. \n\nDenkt einfach dar&uuml;ber nach was euch gl&uuml;cklich machen w&uuml;rde, wenn ihr ein schlechtes Game habt und anfangt zu flamen. Sollte aber mal garnichts helfen dann seid nicht auch Toxic und mutet den Spieler einfach. Ihr schaukelt euch nur selbst hoch wenn ihr zur&uuml;ck beleidigt und vorallem lauft ihr selbst Gefahr auch in einen Ban zu laufen, aber die wichtigste Regel &uuml;berhaupt... Schreibt NIEMALS im All Chat Dinge wie, report XYZ. Damit macht ihr die Situation einfach nur schlimmer.\n\n\n\nAlso grob nochmal zusammen gefasst.\n\n1. Wurdest DU gesperrt war es mit Recht. (Grade bei einem perma Ban, gab es genug Warnungen vorher)\n2. Geb nicht anderen die Schuld, DU bist dein eigener Herr und DU entscheidest ob du Sanktionen bekommst oder nicht.\n3. Reflektiere dein Verhalten und erkenne DEINE Fehler (Das gilt nicht nur f&uuml;r spielerische Sklls sondern auch um den Menschlichen Skill ;) )\n4. Lerne aus deinen Sperren und &auml;ndere DICH!\n\nNoch ein kleiner Tipp f&uuml;r dich wenn du permanent gesperrt wurdest. Zeigst du keine Einsicht und bekennst dich nicht zu deinen Fehlern? Warum sollte man dir noch eine Chance geben? Aktzeptiere es wie es ist und zeig das du dein Verhalten reflektiert hast und dich wirklich &auml;ndern willst und sei nicht wieder negativ wenn Riot dann sagt nein. Vielleicht ist es ein Test und sie wollen sehen wie du damit umgehst.\n\nMacht das Rift zu einem besseren Ort Leute. Ich selbst habe mich ge&auml;ndert und wenn ich das schaffe dann schafft ihr das auch :) \n\nBis dahin keep it positiv :)\n\nEuer\nLuke","replies":[{"poster":"Pilze","date":"2016-11-22T17:09:21.586+0000","up_votes":1,"down_votes":0,"body":"Der Text ist wirklich gut aber für die auf andere Zeiger einfach zu lang.","replies":[{"poster":"Party at my Lane","date":"2016-11-23T12:15:27.250+0000","up_votes":1,"down_votes":0,"body":"Was meinst du mit auf andere Zeiger? \n\nIch vermute einfach mal du möchtest damit sagen das dieser Post dazu da ist Leute runter zu machen oder ähnliches. Falls es so ist muss ich dich leider enttäuschen. Der Text dient in keiner Weise dazu irgendwen zu erniedrigen oder runter zu machen. Ich wollte lediglich den Leuten im Forum einen stupser in die richtige Richtung geben. Gerne kann man mich auch adden und ich gebe in Game noch ein paar Tipps. Ich selbst habe lange Zeit mit einem Sport Psychologen zusammen gearbeitet und Teile meine Erfahrungen gerne. Auch wenn es damals in einer anderen Rubrik war, lassen sich viele Dinge auch in LoL anwenden.","replies":[{"poster":"Pilze","date":"2016-11-25T02:43:17.890+0000","up_votes":1,"down_votes":1,"body":"Ganz ehrlich? Verstehst du jetzt nicht was ich geschrieben habe oder was ist jetzt genau das Problem?","replies":[{"poster":"OrangeBubble","date":"2016-11-26T13:19:54.613+0000","up_votes":2,"down_votes":0,"body":"Ich lese deine Worte, mir erschließt sich der Sinn nur nicht.","replies":[]},{"poster":"Awsane","date":"2016-11-25T13:55:31.060+0000","up_votes":2,"down_votes":0,"body":"ich verstehe es auch nicht :D\nich weiß nicht was mit Zeiger gemeint ist\nund der Ausdruck \"für die auf andere\" verwirrt mich, ich weiß nicht worauf oder auf wen sich das beziehen soll","replies":[{"poster":"Party at my Lane","date":"2016-11-28T21:00:18.046+0000","up_votes":1,"down_votes":0,"body":"Ich verstehe es auch nicht^^","replies":[]}]}]},{"poster":"Abasin","date":"2016-12-23T12:55:06.094+0000","up_votes":1,"down_votes":0,"body":"> auf andere Zeiger\n\nIch denke er meint Leute, die gerne auf andere Spieler mit dem Finger zeigen. Also \"auf-andere-Zeiger\".","replies":[]}]}]},{"poster":"Pure Cynicism","date":"2016-11-22T19:03:27.981+0000","up_votes":1,"down_votes":0,"body":"Ich habe allerdings das Gefühl, dass die Leute momentan unerträglich sind. In jedem Spiel muss ich reporten, sei es nur wegen \"ez noobs\" oder wegen \"get cancer\". Aber die aktuelle Spielatmosphäre führt bei mir zu einem sofortigen /mute all bei Spielbeginn.","replies":[{"poster":"xinf3ct3d","date":"2016-11-25T04:49:46.504+0000","up_votes":2,"down_votes":0,"body":"Ich würde sie nicht Muten sondern einfach etwas warten. Du kannst sie am Ende ja immer noch Reporten.Vielleicht schreiben sie ja noch etwas \"sinnvolles\"","replies":[]}]},{"poster":"Sakunosuke Oda","date":"2016-11-21T22:30:49.860+0000","up_votes":2,"down_votes":0,"body":"Danke für den Text :) Hatte zwar noch kein bann bzw Chatsperre aber versuche auch gerade nicht so viel zu ragen bzw mich tilten zu lassen(gehe gerne auf provokationen ein) Etwas habe ich geschafft indem ich mir denke das dass der Grund ist warum die mit mir in Bronze stecken (Bin momentan GOld) und nicht höher kommen sowas beruhigt mich leicht :P\nSorry für die fehlenden Satzzeichen schreibe den Text gerade im Bett und bin müde werde gleichj auch schlafen gehen gute nacht^^","replies":[]},{"poster":"xinf3ct3d","date":"2016-11-25T04:46:19.219+0000","up_votes":1,"down_votes":0,"body":"Ich hab noch nie in den Games geflamed. ABSOLUT noch nie. Und jeder einzelne Flamer dem ich begegne wird Reported","replies":[]},{"poster":"Skagerak","date":"2016-11-22T17:26:19.752+0000","up_votes":1,"down_votes":0,"body":"Schöner Text :) Besser hätte ich es nicht auf den Punkt bringen können.\n\n Immer wieder schön Leute zu sehen die sich geändert haben und League zu einem besseren Ort machen, wo man sich vom Alltagsstress zurückziehen kann.","replies":[]},{"poster":"Redo1503","date":"2016-11-26T20:51:47.407+0000","up_votes":1,"down_votes":2,"body":"Naja ich bin momentan komplett frustiert, weil ich einen plötzlichen Perma-Bann bekommen hab. Hab es vor 3 Monaten geschafft direkt beide chat sperren und den 14 tage ban zu bekommen, habe aber seitdem irgendwie mich komplett verändert, und dann hat man 2 extrem unlucky games wo ich einfach aus Wut einmal einen cocky Riven Spieler sehr hard geflamed hab  und in nem anderen Game nur gegen argumentiert hab . :( ich weiß echt nicht was ich jetzt tuen soll. Weil ich eigentlich dachte das ich mich verändert hab. Ich würde nicht sagen das mein Bann unverdient ist. Aber ich versteh manchmal Report Gründe nicht.,,","replies":[{"poster":"Sirrkas","date":"2016-11-26T21:07:56.850+0000","up_votes":1,"down_votes":0,"body":"Wenn du über deinen Bann reden willst, würde ich dir empfehlen, dafür einen eigenen Thread auf zu machen und den Chatlog da einzufügen. Bei deiner aktuellen Beschreibung, klingt das aber alles passend. Nach dem 2 Wochenbann, ist die nächste Stufe nunmal der Perma, du sagst ja selbst, du bist sehr ausfallend geworden, jetzt musst du eben leider mit den Konsequenzen leben.","replies":[]}]},{"poster":"Mrs Recommended","date":"2016-12-23T00:40:04.121+0000","up_votes":1,"down_votes":1,"body":"Game 1\nMrs Recommended: darius has fervor and ignite\nMrs Recommended: earlie gank might fock him up\nMrs Recommended: oh\nMrs Recommended: gj\nMrs Recommended: no summs top\nMrs Recommended: ZAC\nMrs Recommended: COME TOP NOW\nMrs Recommended: I ASKED YOU 10 MINUTES BEFORE\nMrs Recommended: ZAC\nMrs Recommended: DO U LISTEN\nMrs Recommended: OR JUST AFK JUNGLING?P\nMrs Recommended: ZAC\nMrs Recommended: alright\nMrs Recommended: zac reported\nMrs Recommended: GUYS\nMrs Recommended: STOP TALKING\nMrs Recommended: JUST PLAY THE STUPID GAME\nMrs Recommended: VAYNE\nMrs Recommended: ONE TIME MORE\nMrs Recommended: YOU TALK\nMrs Recommended: AND UR REPORTED\nMrs Recommended: reported.\nMrs Recommended: guys\nMrs Recommended: are you trolling?\nMrs Recommended: fock me\nMrs Recommended: ZAC\nMrs Recommended: ZAC PLS\nMrs Recommended: LISTEN ONCE TO TO WHAT UR TEAM SAY\nMrs Recommended: UR FUCKIN AFK JUNGLING\nMrs Recommended: rly vayne?\nMrs Recommended: are you even trying to win?\nMrs Recommended: shes on ur lane\nMrs Recommended: no\nMrs Recommended: i didnt\nMrs Recommended: lol\nMrs Recommended: dude stop trolling\nMrs Recommended: thats all i want\nMrs Recommended: so much flame?\nMrs Recommended: ur fuckin feeding\nMrs Recommended: im just asking you not too\nMrs Recommended: oh wow\nMrs Recommended: alright\nMrs Recommended: i report you both\nMrs Recommended: gonna see whos toxic\nMrs Recommended: liss tell me\nMrs Recommended: ur pre with zac=\nMrs Recommended: ?\nMrs Recommended: hm?\nMrs Recommended: dont ping me\nMrs Recommended: yy\nMrs Recommended: you got this\nMrs Recommended: okay\nMrs Recommended: im afk\nMrs Recommended: play alone\nMrs Recommended: i prefere loosing a game\nMrs Recommended: than carry without getting helpo\nMrs Recommended: have fun\nMrs Recommended: report this troll team\nMrs Recommended: honestly\nGame 2\nMrs Recommended: ward\nMrs Recommended: n1\nMrs Recommended: lee\nMrs Recommended: camp ztop\nMrs Recommended: lee\nMrs Recommended: camp top lane\nMrs Recommended: make nasus suffer\nMrs Recommended: pls lee help gnar\nMrs Recommended: gj\nMrs Recommended: no assist?\nMrs Recommended: wtf..\nMrs Recommended: lee\nMrs Recommended: i told you 5 times now\nMrs Recommended: to camp nasus\nMrs Recommended: ez what you go after gauntlet?\nMrs Recommended: good\nMrs Recommended: y go bot gnar\nMrs Recommended: go bot now gnar\nMrs Recommended: i know..\nMrs Recommended: just go bot and try to farm\nMrs Recommended: puh\nMrs Recommended: sry ez\nMrs Recommended: i did everything i could\nMrs Recommended: #thats why\nMrs Recommended: i told you to camp top\nMrs Recommended: im trying\nMrs Recommended: but i couldnt save ez\nMrs Recommended: that plant in the middle of tf\nMrs Recommended: was fuckin ridiculous\nMrs Recommended: i allways\nMrs Recommended: have to play\nMrs Recommended: with scrub lees\nMrs Recommended: i dont get it...\nMrs Recommended: no lee\nMrs Recommended: you just\nMrs Recommended: didnt do anythign top\nMrs Recommended: i told you right in the beginning\nMrs Recommended: fuckin camp nasus\nMrs Recommended: and you did nothing\nMrs Recommended: this game\nMrs Recommended: is ur fault lee\nMrs Recommended: you get 11 kills\nMrs Recommended: and you can do a SHIT\nMrs Recommended: with that\nMrs Recommended: admit it lee\nMrs Recommended: you lost this game\nMrs Recommended: y well\nMrs Recommended: lee reported\nMrs Recommended: same for veiagr\nMrs Recommended: i dont get the idea\nMrs Recommended: beeing camped\nMrs Recommended: for 100 times\nMrs Recommended: and now ur useles\nMrs Recommended: ur farm is awwfull\nMrs Recommended: ur stacks are awwfull\nMrs Recommended: and you got CAMPED\nMrs Recommended: by lee\nMrs Recommended: stop taliong lee\nMrs Recommended: ur the worst\nMrs Recommended: talking*\nMrs Recommended: ez maybe get bork\nMrs Recommended: AHA\nMrs Recommended: REPORT US Y\nMrs Recommended: ur sop fuckin bad\nMrs Recommended: lee\nMrs Recommended: stop playing this game\nMrs Recommended: honestly\nMrs Recommended: look this build\nMrs Recommended: i hope you get banned for this\nMrs Recommended: ITS NOT GNARS FAULT\nMrs Recommended: GNAR VS NASUS\nMrs Recommended: END UP IN NASUS BEENGH SUPER STRONG\nMrs Recommended: LEARN THE FUCKIN GAME\nMrs Recommended: THATS 1X1 OF LOL\nGame 3\nMrs Recommended: gj\nMrs Recommended: camp bot\nMrs Recommended: we need at least one carry lane\nMrs Recommended: talon\nMrs Recommended: wtf are you doing?\nMrs Recommended: this is ranked you know\nMrs Recommended: you can troll in normals\nMrs Recommended: finally\nMrs Recommended: gj mid\nMrs Recommended: i wonder\nMrs Recommended: what you guys did on the lanes\nMrs Recommended: honestly\nMrs Recommended: fock you xin\nMrs Recommended: you see theme diving me\nMrs Recommended: and go golems\nMrs Recommended: and talon is reported now\nMrs Recommended: alright\nMrs Recommended: i report you 2 xin\nMrs Recommended: beleive me\nMrs Recommended: thats right\nMrs Recommended: you are just useless\nMrs Recommended: 6 kills\nMrs Recommended: anjd you do nothing\nMrs Recommended: nothing at all\nMrs Recommended: you?\nMrs Recommended: nothing\nMrs Recommended: i will talopn\nMrs Recommended: dopnt worry\nMrs Recommended: you are the worst of you guys\nMrs Recommended: you guys\nMrs Recommended: are both reporteed\nMrs Recommended: and now muted\nMrs Recommended: scrub kids\nMrs Recommended: dont troll in ranked -.-\nMrs Recommended: 55 cs\nMrs Recommended: i had 50 cs after 5 min\nMrs Recommended: so fed -.-\nMrs Recommended: how can 2 lanes\nMrs Recommended: lose so hard\nMrs Recommended: and cant even def my lane\nMrs Recommended: no not for you\nMrs Recommended: you just died\nMrs Recommended: like a scrub\nMrs Recommended: go for kills when top is gettign pushed\nMrs Recommended: i hope you guys get abnned\nMrs Recommended: good we can report you\nMrs Recommended: satisfies me\nMrs Recommended: lol\nMrs Recommended: LOL\nMrs Recommended: OH MYGV GOD","replies":[]},{"poster":"OniOxe","date":"2016-11-30T09:36:25.814+0000","up_votes":1,"down_votes":2,"body":"das deutsche LoL Forum ist schon witzig, zuviele Leute mit zu wenigen Hobbies :)","replies":[]}]}