{"poster":"PhantomGG","date":"2016-06-30T07:51:28.451+0000","title":"Riot Remember Righteous Glory?","subforum":"Gameplay","up_votes":79,"down_votes":7,"body":"That item you nerfed to the ground and than no one ever built again? \r\n\r\nI think it&#039;s about time to give it another looking at","replies":[{"poster":"Utility Veigar","date":"2016-06-30T22:37:09.080+0000","up_votes":26,"down_votes":1,"body":"Remember Ohmwrecker?\n\nThat's right, no one does.","replies":[{"poster":"Tobias Brackner","date":"2016-07-01T01:04:40.442+0000","up_votes":7,"down_votes":1,"body":"Ohmwrecker is awesome and fucking amazing.\n\nProblem is you need some hardcore team coordination to use it.","replies":[{"poster":"I was Lupxel","date":"2016-07-01T12:29:17.903+0000","up_votes":2,"down_votes":0,"body":"I use it on squishy support for the utility and tankiness.","replies":[]},{"poster":"MunchCrunchLunch","date":"2016-07-02T04:20:55.234+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tobias Brackner,realm=NA,application-id=3ErqAdtq,discussion-id=EzoWpdKv,comment-id=00030002,timestamp=2016-07-01T01:04:40.442+0000)\n>\n> Ohmwrecker is awesome and fucking amazing.\n> \n> Problem is you need some hardcore team coordination to use it.\n\numm. i dont think a cpl turret shots matter when trundle or any tank can take 20-30 turret shots. actually trundle can never die late game under turrets. hell a teemo can tank 2 turret shots and not give a fuck. team fights end before a turret even fires 3-4 shots\n\nits a bad item. the only reason i ever built it to get 10% cdr armor item but its probably worth to go over cdr limit more than buying that worthless item. or hey talisman or ascension.","replies":[{"poster":"Tobias Brackner","date":"2016-07-05T07:54:01.752+0000","up_votes":1,"down_votes":0,"body":"> actually trundle can never die late game under turrets.\n> never die late game under turrets\n>late game under turrets\n>late game\n\nYou know that there is more to the game than late game, yeah?","replies":[]}]}]},{"poster":"General Esdeath ","date":"2016-06-30T23:49:33.151+0000","up_votes":3,"down_votes":0,"body":"I remember, but it's prob not gonna be touched because of the origin","replies":[{"poster":"morris1","date":"2016-07-01T08:05:14.834+0000","up_votes":4,"down_votes":0,"body":"If I was Ohmwrecker I'd feel very insulted looking at this item.","replies":[]}]},{"poster":"PhantomGG","date":"2016-06-30T23:32:25.466+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Smite KogMaw,realm=NA,application-id=3ErqAdtq,discussion-id=EzoWpdKv,comment-id=0003,timestamp=2016-06-30T22:37:09.080+0000)\n>\n> Remember Ohmwrecker?\n> \n> That&#x27;s right, no one does.\n\nThe problem with ohm wrecker is that the idea quite frankly is far to hard to balance, but yeah it's a weird item that's just sitting their, i agree","replies":[]},{"poster":"King Solstice","date":"2016-07-01T14:57:07.188+0000","up_votes":1,"down_votes":0,"body":"{{item:3091}}  How about this ancient piece of art?","replies":[{"poster":"TequilaZombie","date":"2016-07-01T15:22:23.926+0000","up_votes":1,"down_votes":0,"body":"I'd use to grab it on my Sated devourer jungle Voli. Ohh the ridiculous AA dmg on a tank when this was NOT common.","replies":[]}]},{"poster":"Legacy Hydralpha","date":"2016-07-01T15:16:06.287+0000","up_votes":1,"down_votes":0,"body":"I did get Ohmwrecker in a {{champion:432}} game recently.\n\nNever used its active.","replies":[]}]},{"poster":"Quepha","date":"2016-06-30T14:45:09.599+0000","up_votes":11,"down_votes":3,"body":"Catalyst doesn't fit on the item very well anymore. Most tanks that lead the charge don't have a very high mana expenditure, and even a really high mana expenditure would give only a piddly amount of health to them in the late game compared to what they deal with.","replies":[{"poster":"MrNuclearPumpkin","date":"2016-06-30T16:23:59.027+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Quepha,realm=NA,application-id=3ErqAdtq,discussion-id=EzoWpdKv,comment-id=0001,timestamp=2016-06-30T14:45:09.599+0000)\n>\n> Catalyst doesn&#x27;t fit on the item very well anymore. Most tanks that lead the charge don&#x27;t have a very high mana expenditure, and even a really high mana expenditure would give only a piddly amount of health to them in the late game compared to what they deal with.\n\nNew ryze is gonna love it.","replies":[{"poster":"Quepha","date":"2016-06-30T17:33:50.103+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=MrNuclearPumpkin,realm=NA,application-id=3ErqAdtq,discussion-id=EzoWpdKv,comment-id=00010000,timestamp=2016-06-30T16:23:59.027+0000)\n>\n> New ryze is gonna love it.\n\nI don't see why he would suddenly start to like Righteous Glory more than current Ryze, certainly not by enough that he would switch away from RoA.","replies":[{"poster":"Princess Emma","date":"2016-06-30T17:49:56.411+0000","up_votes":6,"down_votes":0,"body":"I think he meant {{item:3010}}  and not {{item:3800}}","replies":[]}]}]},{"poster":"Illâoi Evê Siôn","date":"2016-07-01T08:03:58.251+0000","up_votes":2,"down_votes":1,"body":"Catalyst is a Mana sustain item. If you're buying it to replace Spellvamp you're doing something wrong. \n\nAlso, a lot of the Tanks who buy it actually do have a high mana expenditure. Blitzcrank wants it to keep his Mana up for his Shield. Amumu has always had Mana problems in drawn-out fights. Maokai wants the Mana to keep his ult up. Alistar wants it to spam his spells and heal. Hecarim wants to spam his Q.","replies":[{"poster":"Quepha","date":"2016-07-01T15:19:21.311+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Illâoi,realm=EUW,application-id=3ErqAdtq,discussion-id=EzoWpdKv,comment-id=00010001,timestamp=2016-07-01T08:03:58.251+0000)\n>\n> Catalyst is a Mana sustain item. If you&#x27;re buying it to replace Spellvamp you&#x27;re doing something wrong.\n\nOn Ryze,\n\n8hp per overload, 12-15 hp per Rune Prison, 12-15hp per Spell Flux\nlevel 9 Ryze with 900 bonus mana and 100 AP (pretty optimistic)\nOverload: 300 damage\nRunic Prison: 180 damage\nSpell Flux: 140 damage (AoE)\nFunctionally equivalent to 2.7% spellvamp on Overload, 7.8% spellvamp on runic prison, and 30% spellvamp on Spell Flux.\n\nThe Catalyst effect has a big sustain boost for both health and mana, often generating more health than the old Catalyst even early on before level ups start becoming less common.","replies":[{"poster":"Illâoi Evê Siôn","date":"2016-07-01T15:29:46.432+0000","up_votes":1,"down_votes":1,"body":"These equivalent values decrease drastically as the game progresses. Aeons might give you the early game sustain Protector gave, but it can't make up for Spellvamp. When buying Aeons on any champion, you should instead consider if you need it to sustain your Mana.","replies":[{"poster":"Quepha","date":"2016-07-01T15:38:58.318+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Illâoi,realm=EUW,application-id=3ErqAdtq,discussion-id=EzoWpdKv,comment-id=0001000100000000,timestamp=2016-07-01T15:29:46.432+0000)\n>\n> These equivalent values decrease drastically as the game progresses.\n\nWho cares? Rod is still one of the best late game items if you can stack it so all you want out of catalyst is sustain to keep you farming until then.\n\nWhy are you even trying to compare this item to spellvamp? Tanks didn't want spellvamp, most mages didn't want spellvamp, on actual tanks Catalyst's \"functionally equivalent\" spellvamp values are probably much higher since their damage values are lower and almost always pure AoE.","replies":[{"poster":"Illâoi Evê Siôn","date":"2016-07-01T16:12:25.309+0000","up_votes":2,"down_votes":0,"body":"You said the item wouldn't hold any merit on Tanks because it doesn't offer much Health sustain due to their low Mana expenditure and in comparison to the damage they have to deal with.\nYou assumed you would buy the item for Health sustain, I told you it's not here to replace Spellvamp. It's a Mana sustain item that a lot of Tanks want. \nYou made an example of how it can be for Health sustain on Ryze (even though we're talking about Righteous Glory).\nI told you that falls off late game, which you also said in your first comment.  \n\nThe point is: Righteous Glory is great for mana sustain, has a bit of Health sustain in the early to mid game, and a great active for a lot of champions.","replies":[]}]}]}]}]},{"poster":"Sire Hippington","date":"2016-07-02T12:59:55.922+0000","up_votes":1,"down_votes":0,"body":"imo catalyst is the saveing grace of the item...\nBefor the mageupdate, i never used it. With the new catalyst, i atleast bought it a few times the early catalyst really helps alot in lane on champs like olaf or heca as they really use alot mana.","replies":[]},{"poster":"TequilaZombie","date":"2016-07-01T15:23:41.271+0000","up_votes":1,"down_votes":0,"body":"{{champion:27}}","replies":[]}]},{"poster":"Arkatra","date":"2016-07-01T06:37:36.182+0000","up_votes":9,"down_votes":3,"body":"You definitely haven't seen a a charging (Q) {{champion:106}}  with {{item:3800}} 's active on running towards you.\nYes, you didn't.\nAll you can do then is to rethink your short life.","replies":[{"poster":"SerBlaise","date":"2016-07-01T12:05:32.282+0000","up_votes":5,"down_votes":0,"body":"Dead Man's Plate on Voli is just as effective if not moreso. In fact, I can't think of an instance where you should build RG instead of DMP on anyone (MAYBE on Mao for the mana). The armor-heath-speed combo is just too good.","replies":[{"poster":"Arkatra","date":"2016-07-01T15:17:41.319+0000","up_votes":3,"down_votes":0,"body":"That Volibear had both.\n{{item:1401}} +{{item:3742}} +{{item:3800}} +{{item:3053}}  +{{item:3065}} + {{item:3009}} .\n\nWelcome in afterlife, since it's nearly impossible to kite a ~870 ms voli which then slows you down.\n(voli bite is around 1.2k)","replies":[]},{"poster":"TequilaZombie","date":"2016-07-01T15:24:20.030+0000","up_votes":2,"down_votes":0,"body":"{{champion:27}} Why everybody forgets about me?","replies":[]},{"poster":"I was Lupxel","date":"2016-07-01T12:26:15.133+0000","up_votes":1,"down_votes":0,"body":"Yeah, the only champion that ises it is Maokai","replies":[]}]}]},{"poster":"Tobias Brackner","date":"2016-07-01T01:05:05.269+0000","up_votes":4,"down_votes":0,"body":"Righteous Glory is awesome.","replies":[]},{"poster":"Dengeden","date":"2016-07-01T07:11:19.800+0000","up_votes":5,"down_votes":1,"body":"Shrug, it's one of those items that are either built every game or once every 20 games. Deadman's and Randuin's have the same problem.\n\nGlory seems fine to me. The passive, stats and the active can all be quite useful.","replies":[]},{"poster":"SlashStriker","date":"2016-07-01T17:15:44.738+0000","up_votes":3,"down_votes":0,"body":"+500 Health\n+300 Mana\n+100% Base Health Regen\n\nreally poor stats","replies":[]},{"poster":"Xietnin","date":"2016-07-01T05:07:23.508+0000","up_votes":3,"down_votes":0,"body":"I feel like I should agree with you, but there's this nagging feeling of basically having Randuin's and Shurelya's active in one, and that changes to Righteous Glory could be very touchy.","replies":[]},{"poster":"Wyrmblade","date":"2016-07-01T04:44:48.567+0000","up_votes":3,"down_votes":1,"body":"It was a good item, they just fucked it over and forgot about it.","replies":[]},{"poster":"Zarvanis","date":"2016-07-01T04:36:12.700+0000","up_votes":3,"down_votes":1,"body":"It currently has a distinct lack of righteousness, and is tragically low on glory.","replies":[]},{"poster":"Baron Perenolde","date":"2016-07-01T01:36:07.346+0000","up_votes":2,"down_votes":1,"body":"Olaf might be able to make use of it now.... Maybe. It is pretty underwhelming.","replies":[]},{"poster":"TheAce123","date":"2016-07-01T19:05:04.022+0000","up_votes":1,"down_votes":0,"body":"I feel like building that item on the current ryze(not the reworked one) would be good with archangel since it would also give you extra ap and dmg(Extra mana=extra dmg for ryze) for ryze and that tankiness and that juicy button power movement speed that makes you a mad man when you activate it and ult ghost on enemy, almost no counterplay and unkillable since you would be tanky af with archangel active and rod of ages stack and that juicy 500 health from righteous glory if you can actually ryze and since its ryze ur dead if you try to 1v1 him","replies":[]},{"poster":"Omnem Occido","date":"2016-07-01T16:08:17.333+0000","up_votes":1,"down_votes":0,"body":"From what I know, it's supposed to be a support item for supports like Blitz or Alistar, with high mana usage, but are also tanky champs that benefit from just running at the enemy and cc'ing them to kingdom come. It just needs more stats that a support can get behind. For example, make the **Eternity** effect of it grant health regen to all allies nearby equal to a portion of mana consumed, stacking to a set amount. If it did that, it would become a very used support item.","replies":[]},{"poster":"Reaper Soraka","date":"2016-07-01T15:28:35.723+0000","up_votes":1,"down_votes":0,"body":"idk...  I didn't like that all tank supports could also have medallion's active in addition to their shield item.  The worst part is it fit right into their tank build with it's extra stats, so they didn't even have to think about it.","replies":[]},{"poster":"The Deckowner","date":"2016-07-01T15:17:46.339+0000","up_votes":1,"down_votes":0,"body":"I used to build this on blitzcrank and thresh when it was buffing entire team, add tailsman of ascension it gives you lots of speed boost for engaging. not anymore buying it tho.","replies":[]},{"poster":"Slamurai Jack","date":"2016-07-01T08:23:11.633+0000","up_votes":1,"down_votes":0,"body":"I still see it on occasion. It's alright, at least. Good god, never let it become meta again. The RG meta when it first came out was absolute cancer.","replies":[{"poster":"My Waifu Vanilla","date":"2016-07-01T14:15:31.465+0000","up_votes":1,"down_votes":0,"body":"It's alright at best. Mao is the only one that consistently buys it, but I SOMETIMES get it item 6 on Illaoi if I simply do not need more resists AND there have been no ocean drakes to fuel mana consumption. It is by no means a bad item but it is only really good on teams with like 2 tanks that neither of them have alternative forms of engage (Zac for instance doesn't care about the ms whereas Amumu/Mao/Leona would enjoy it since it removes skillshot risk and just makes engaging easier).","replies":[]},{"poster":"Drahcir","date":"2016-07-01T10:05:11.306+0000","up_votes":1,"down_votes":0,"body":"There's something cancerous in every meta.","replies":[]}]},{"poster":"MrWasjig","date":"2016-07-01T12:05:28.305+0000","up_votes":1,"down_votes":0,"body":"A think in it's current state should be renamed to \"Mediocre Kudos\" (I don't recall who made that joke when it was first made)","replies":[]},{"poster":"morris1","date":"2016-07-01T08:03:08.465+0000","up_votes":1,"down_votes":0,"body":"I rush it every game on Amumu to allow me to Q and land a good ultimate.\nBut you're right, it has a pretty underwhelming niche to it and only initiators who desperately need a good engage take it anymore.","replies":[]},{"poster":"Illâoi Evê Siôn","date":"2016-06-30T23:52:45.738+0000","up_votes":1,"down_votes":2,"body":"Righteous Glory is awesome now thanks to the Eternity passive? \n\nIt's a NICHE item, no buffs needed.  \n\nEdit: Scratch that. It actually has a pretty high pick rate on Tank Supports. ","replies":[{"poster":"doiminat0r3600","date":"2016-07-01T00:03:18.396+0000","up_votes":2,"down_votes":1,"body":"It may be good on certain champions (tank supports) but they mainly buy it for the MS active. The active isn't even *that* good because it only applies when going towards turrets and champions.","replies":[{"poster":"Illâoi Evê Siôn","date":"2016-07-01T07:45:38.071+0000","up_votes":1,"down_votes":2,"body":"It's also great on Juggernauts, Tanks, and Junglers. It has an offensive part that allows you to reposition yourself quickly in a fight or engage one, and it has a \"defensive\" part that keeps your Health and Mana up when trading. It also gives you practically infinite Mana during fights. \n\nI don't see what why you would want to buff that.","replies":[]}]}]},{"poster":"Vistha Kai","date":"2016-06-30T23:36:52.254+0000","up_votes":1,"down_votes":1,"body":"I'll be honest here.\n\nI completely forgot about this item.\nLike had to take a good moment, to remind myself what it was, after seeing the topic.","replies":[]},{"poster":"MKDkilla","date":"2016-06-30T19:34:24.014+0000","up_votes":2,"down_votes":2,"body":"Yes because it was fun when Thresh used RG active + mobis with his team for 600 MS to hook you out of nowhere and annihilate you.","replies":[]},{"poster":"Sire Hippington","date":"2016-06-30T14:39:24.675+0000","up_votes":2,"down_votes":2,"body":"RG's issue is that it has a to powerfull active **and** to niche active.\nAs a result, the stats it gives are horrific else we would be to powerfull. \nBut with the horrific stats, it's generally a weak item unless you can make the most out of the active.\nThe big porblem now is that the active mostly allows you to start fights, to dive the backline. However, that only is usefull if you can win the fight you start, if you can get anything meaningfull done within their backline, and for that you do need combat stats.\nAs a result, the poor stats it gives prevent you from finding good oportunities for useing the active, which would be required to offset the poor stats, thus it's only usefull if you(your team) is far enough ahead that all you want is starting fights as you already have enough combat stats to win them.\n\nSo imo what should ne done is nerfing the active and ad better stats.\nChange the slow from 80 for 2 sec to 75 decaying over 2 sec, lower the ms buff from 75% to 40 or even less, and **increase the health to 600-700**, if needed increrase the costs a bit aswell.\nIt would also be nice to seel the captains enchant on it, though that again would add niche power at the cost of consistent stats.","replies":[]}]}