{"poster":"MF all lanes","date":"2018-07-30T01:08:45.958+0000","title":"Why would this game be a B+?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"For comparison, I played 2 shen support games back to back.. one was an S+ and one was a B+... both games, realistically, should have been near the same. \r\n\r\nGame one was S+\r\n6/0/17, 22 min game, 64% kill participation, 2 control wards, 59 CS, likely similar vision score to the second or worse\r\nGame two was a B+\r\n2/2/27, 27min game, 69% kill participation, 3 control wards, 80 cs, see above\r\n\r\n\r\nHow is there that kind of discrepancy? I am already Shen level 7 so I didn&#039;t need the S or anything... but this seems like a bug. I know riot doesn&#039;t release how they grade games, but I&#039;ve played like 170 games as Shen support and have never had a game where I was that involved and gotten a grade that low... What am I missing?\r\n\r\nSorry if it&#039;s the wrong board","replies":[{"poster":"Spirt Gun Yuske","date":"2018-07-30T01:25:30.579+0000","up_votes":3,"down_votes":0,"body":"Based on KDA alone you're like what 23 kda in the first game\nand 14 kda in the second one, but then you have to check your damage , I usually think of rank more as dmg per death more than total KDA tbh dying ruins your rank\n","replies":[{"poster":"MF all lanes","date":"2018-07-30T01:44:07.552+0000","up_votes":2,"down_votes":0,"body":"aha! I just played a third game that was nearly identical to the B+ game except I didn't die (28 mins, 2/0/22, 3 control wards, slightly less CS, same gold, 63% kill part, exact same vision score etc) and got an S+... so this makes perfect sense (I mean, if using riot logic). It's really strange that 2 deaths can drop you two full ranks for basically identical games on a support especially when sometimes you have to sacrifice yourself for the adc. Definitely an enlightening post though, never thought of it as damage per death. Thanks!","replies":[]}]},{"poster":"MagicFlyingLlama","date":"2018-07-30T01:47:17.473+0000","up_votes":2,"down_votes":0,"body":"Damage output, objective participation, CC score, actual effectiveness of wards, ect all matter.","replies":[]}]}