{"poster":"Ulquiorra995","date":"2015-01-03T20:42:26.599+0000","title":"Why exactly is Vlad considered a bad design?","subforum":"Gameplay","up_votes":5,"down_votes":2,"body":"Especially with likes of Lee or Gnar running free.\r\nBecause it seems to me like he has clearly defined strengths or weaknesses. Lots of survivability, sustained damage and poke, but weak burst unless very fed, no mobility or CC to compensate. Great poke in lane, but weak to early all-ins. Terrible early, sets really good mid-late.\r\n\r\nSeriously, give me Vlad in other team over likes of Lee anytime. Because against Lee you always fight on his terms. He has the edge? You're fucked with his 2 gap closers, slow, displacement and absurd bases and scalings. You have the edge. Good luck ever catching him with 350 MS, 2 mobility tools and a huge knockback. \r\nNot just hating on Lee - but there are lots of champions far more frustrating to face than Vlad. Gnar, for example. He can kite/chase you for days with mini form slow, insane MS boost and jump, and he can also straight out out duel you in mega form. Thresh has everything a support can wish for with no obvious drawbacks. And more but I'm too lazy to list.","replies":[{"poster":"EnvyDragon","date":"2015-01-03T21:00:42.558+0000","up_votes":7,"down_votes":0,"body":"It's mostly because his sustained damage and poke are synonymous. They're also free. He has great damage for negative resource cost - most champions have to gate their abilities for some extent, but Vlad literally wants to use his transfusion as often as possible because it keeps his health up.\n\nYes, Lee is bullshit to the furthest extent. Gnar is bullshit in the hands of a good player. Thresh is bullshit on a competent team. \n\nBut all three of them are also capable of making really cool, rewarding plays - the reason Vlad gets flak is because not only is he full of toxic mechanics, but well, when was the last time you saw a clutch Vlad play? When Lee, Gnar and Thresh do well, you can SEE why, you can play around it, you can predict it. Vlad doesn't have anything you can respond to or understand - when he's strong, he just point-and-click kills you, gaining a buttload of health in return.","replies":[]},{"poster":"Junkο","date":"2015-01-03T22:36:32.638+0000","up_votes":7,"down_votes":1,"body":"Because using a point and click heal every 3 seconds has counterplay.\n\nVlad is like the only reason spell vamp is shit right now (and maybe Morde).","replies":[{"poster":"EndlessSorcerer","date":"2015-01-03T22:41:42.861+0000","up_votes":1,"down_votes":0,"body":"Forgot Akali, though she's typically has her passive and Gunblade for spellvamp.","replies":[{"poster":"Junkο","date":"2015-01-03T22:44:45.792+0000","up_votes":1,"down_votes":0,"body":"Oh yea. Everytime i play against Akali i feel cheated because of her spellvamp healing her for her massive burst, the fact that she technically has 4 single target spells (aka no spellvamp reduce) doesn't help.","replies":[{"poster":"EndlessSorcerer","date":"2015-01-03T23:02:05.057+0000","up_votes":1,"down_votes":0,"body":"4 Single Target Spells?  I know that she has her Q (which can counts at 2 if she procs the mark, depending on how you interpret it) and her R, but her E is AoE and W does no damage.\n\nEdit:  Oh, Gunblade active.  Nvm.","replies":[]}]}]}]},{"poster":"Teridax68","date":"2015-01-04T12:43:55.424+0000","up_votes":1,"down_votes":0,"body":"The biggest issue with {{champion:8}} is the low interactivity and decision-making on several of his abilities. Whereas Sanguine Pool and Hemoplague are both pretty awesome, and have high costs (a huge chunk of health and/or a long cooldown) to balance their power, Transfusion and Tides of Blood are just point-and-click abilities (Tides of Blood doesn't even require pointing) that bring combat down to a simple yes/no on whether your opponent is close enough to you. On top of this, Crimson Pact is a lot of power without gameplay, and the health-to-damage/damage-to-health conversion means full-tank and full-damage Vlad builds tend to homogenize instead of differentiating themselves. It also means there tends to only be one \"real\" stat worth focusing on (AP), when there are seemingly two valid options (so the other's a trap), and it also means Vlad's difficult to stop once he gets ahead, since he gets more tankiness on top of his damage and sustain.\n\nAnother problem that ties into this is how there's little real cost to using his Q or E non-stop: Transfusion costs nothing, provides damage and free sustain, and scales down to a fairly low cooldown, so there's very little reason to not use it literally every time it comes off cooldown (it grants a high reward for next to no risk). Tides of Blood's health cost may be a little inhibitive at early levels, but it quickly becomes irrelevant once Vlad gets spell vamp.","replies":[]},{"poster":"kirbyzama","date":"2015-01-04T06:25:33.018+0000","up_votes":1,"down_votes":0,"body":"What makes Vlad a \"bad design\" has nothing to do with his strength. He isn't broken op and he doesn't snowball out of control like other porrly designed champs like poppy.The problem is his kit informs and influences new item and champ releases negatively. His passive turns health into ap and ap into health. The same Damage that becomes survivability is present in Riven and many people hate her for it. He uses Hp as a resource on some of his abilities but its a meaningless cost with spell vamp and with his q his sustain is limitless, worse then any adc. So because of him spell vamp can't be too readily available or strong. If vlad were to be too strong health and ap itemization would be effected horribly as well. And finally he has untargetability which most people hate as a mechanic. \n\nHe is actually hardly a bad champ nor a broken one. He is more or less balanced now. However he is a champ that can easily become Ryze Top on steroids in a patch that may not even mention him because of extraneous circumstances and when vlad is strong he is destructive, overbearing, and immortal. Bad design in relation to vlad at least doesn't have to do with being under tuned or over powered or even having low counter play. Its that he is a champ that has to be designed around. \n\nThink about how yasuo gets stronger with every new knock-up that is added to the game. Its kinda like that.","replies":[]},{"poster":"Anisoptera","date":"2015-01-04T01:09:50.995+0000","up_votes":1,"down_votes":0,"body":"I really like Vladimir. He isn't a 100-0 burst champ and he has plenty of weaknesses to exploit.\nEarly game, if you bully him hard he will struggle to farm and will have to itemise early, which means delaying Hextech Revolver.\nEarly use of his E kills his health bar fast. \nCool downs are very long.\nFeed him and of course he will hurt, just like any other champion.\n\nHe is not overpowered by any means.\nAP champion players with a brain will buy Morellonomicon. Apply Grievous Wounds and watch him suffer.\nIgniting him will stop all sustain. \nHis W uses a lot of health especially when used early to avoid life-threatening CC.\n\nHe has weak early game and trades that for very strong late game. \n\nI refuse to accept he is poorly designed while every new champ in the past year has been stupidly made with overloaded kits and frustrating lack of counter play CC.\nWelcome to the League of Knockups.\n\nLike most AP casters, he needs a sustain item. His item is Will of The Ancients. \nOthers use Morellonomicon, Athenes, Tear etc. \nWotA is weak compared to the others and falls off late game in terms of helpfulness and stats. This is an item for very specific champions. \n\nTo conclude, you could cry about Vladimir all day, but he isn't picked a lot, because other more \"viable\" champs are out there (FotM champs that everybody spams).\n\nWhile Lee Sin exists, this argument will always be invalid.","replies":[]},{"poster":"Mortekaiser","date":"2015-01-03T20:48:54.504+0000","up_votes":1,"down_votes":1,"body":"hes considered bad design because he's not lee win","replies":[{"poster":"Rinky Dinky","date":"2015-01-03T23:39:12.696+0000","up_votes":1,"down_votes":0,"body":"Even Riot has admitted Lee Sin is bad design smart one.","replies":[]}]},{"poster":"Rinky Dinky","date":"2015-01-03T23:38:58.272+0000","up_votes":1,"down_votes":0,"body":"The majority of things you listed are only true in his current state. If he had high numbers, which he used to have, he would be very anti-fun and toxic.\n\nSame with poppy, if her numbers were any higher, there would be a huge problem. \n\nHis main damage/poke is also his main source of sustain.\n\nIts all point and click as well, with no resource to gate it.","replies":[]},{"poster":"Koba1t","date":"2015-01-03T22:40:02.860+0000","up_votes":1,"down_votes":0,"body":"Because you can't make OMG#LCSBIGPLAYS360SOPROKOREACONFIRMED moments as Vlad, or against vlad because of  the pool.","replies":[]}]}