{"poster":"Ulquiorra995","date":"2015-02-18T11:13:09.878+0000","title":"The longer you postpone nerfing Lee, the harder you are going to have to hit him","subforum":"Gameplay","up_votes":254,"down_votes":34,"body":"Because all these changes you put to supposedly \"keep the top junglers in check\" end up hurting other jungles more than them. Each and every one of those further widened the gap between the top jungles and the rest. And now Jarvan is getting hit while Lee remains untouched (what a surprise).\r\n\r\nThe wider the gap between Lee and others is, the bigger the fall he has to take. And you'll have to do it someday. People are sick of watching him every single game. People are sick of playing against this overloaded piece of shit every game.","replies":[{"poster":"DrMarshSwamp","date":"2015-02-18T13:10:49.546+0000","up_votes":48,"down_votes":3,"body":"Honestly with the amount of threads calling for Lee nerfs on here, reddit, and other LoL-related forums I can't help but wonder why exactly Riot refuses to touch Lee Sin if so much of the community thinks he is a big problem.\n\nWhilst a fair amount of those threads are nonconstructive (OMG NERF LEE SIN, RIOT ONLY CARES ABOUS LC$ BIG PLAYS) I've seen plenty that *are* constructive, each one detailing parts of his kits that help put him above most other Champions just by design and ratios.","replies":[{"poster":"Shaabanglyy","date":"2015-02-18T16:06:06.304+0000","up_votes":7,"down_votes":4,"body":"> [{quoted}](name=DrMarshSwamp,realm=NA,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=0001,timestamp=2015-02-18T13:10:49.546+0000)\n>\n> Honestly with the amount of threads calling for Lee nerfs on here, reddit, and other LoL-related forums I can't help but wonder why exactly Riot refuses to touch Lee Sin if so much of the community thinks he is a big problem.\n> \n> Whilst a fair amount of those threads are nonconstructive (OMG NERF LEE SIN, RIOT ONLY CARES ABOUS LC$ BIG PLAYS) I've seen plenty that *are* constructive, each one detailing parts of his kits that help put him above most other Champions just by design and ratios.\n\nBecause for every 1 person posting a hate thread, Lee has 250 players who main him and think he is fine ready to complain at any nerf.  Also,  without reworking him entirely he cant be fixed.  They don't want to change his abilities in terms of what they do, and just changing him to do no damage is a stupid fix.  I don't play him, and I am bad at him when I have tried.  He takes skill, that much is fore sure.  The problem with that is pretty much the Orianna problem as well.  When she isn't unplayable, in the hands of very skilled players, she becomes unstoppable.","replies":[{"poster":"Martyrofsand","date":"2015-02-18T19:30:06.150+0000","up_votes":17,"down_votes":2,"body":"Orianna is far from unstoppable, she is the benchmark for what a balanced champion in any moba should look like.  She has a strong laning phase and can zone well but can easily push a wave with it.  Compound this with mana issues, especially since chalice got nerfed, and no mobility and she can be fairly easy to gank in retalitation.\n\nAdditionally while she does strong damage she shines most in team fights as oppose to skirmishes and with limited mobility her roaming potential is next to nothing.  Often resulting in her pushing her lane to prevent opponents from roaming, but again opening her up to ganks.\n\nShe is strong and she is safe but she isn't without exploitable weaknesses, something you can really say about trash like Yasuo/Lee/Thresh/Kalista/etc.","replies":[{"poster":"Shaabanglyy","date":"2015-02-18T20:18:31.149+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Martyrofsand,realm=NA,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=000100000000,timestamp=2015-02-18T19:30:06.150+0000)\n>\n> Orianna is far from unstoppable, she is the benchmark for what a balanced champion in any moba should look like.  She has a strong laning phase and can zone well but can easily push a wave with it.  Compound this with mana issues, especially since chalice got nerfed, and no mobility and she can be fairly easy to gank in retalitation.\n> \n> Additionally while she does strong damage she shines most in team fights as oppose to skirmishes and with limited mobility her roaming potential is next to nothing.  Often resulting in her pushing her lane to prevent opponents from roaming, but again opening her up to ganks.\n> \n> She is strong and she is safe but she isn't without exploitable weaknesses, something you can really say about trash like Yasuo/Lee/Thresh/Kalista/etc.\n\nI mean you can say that all you want but it doesn't change the fact that MOST champions that are balanced around their skill level being high typically offer a BIG payout to the most skilled players.  Hence why Orianna, when not nerfed into unplayability, is always a viable pick.","replies":[{"poster":"Martyrofsand","date":"2015-02-18T22:27:12.994+0000","up_votes":17,"down_votes":0,"body":"Ask yourself something.\n\n\nWho does Orianna force out of mid lane or make an invalid pick?\n\n\nThe correct answer?  Damn near no one.  She might have a random champ here and there but for the most part Orianna has existed in mid lane when Ziggs/Leblanc/Zed/Yasuo/Gragas/Lux/Morgana/etc etc have all been viable and she didn't force any of them into a state in which they where bad picks.  \n\nThat is how you know you have a balanced champ.  When the champ can be played in any meta without dictating the meta and that is exactly what describes Orianna.","replies":[]},{"poster":"LeeDark","date":"2015-02-19T00:35:34.039+0000","up_votes":6,"down_votes":0,"body":"\"when not nerfed into unplayability, is always a viable pick.\"\n\nThat's not a problem.  That's called BALANCE.  Say it with me, now:  Baaaalaaance.\n\nShe isn't a must-pick, She isn't a worthless pick.  She is somewhere in the middle.","replies":[]}]}]}]},{"poster":"TheI3igDaddy","date":"2015-02-18T19:11:45.703+0000","up_votes":8,"down_votes":0,"body":"Someone (I think Morello, I could be wrong) specifically stated that nerfing Lee would cause too much backlash from his fanbase, so any changes they thought about were scrapped.\n\nIt's literally the fanbase being composed of whiners who think this overloaded POS is actually fun to play against.","replies":[{"poster":"KaisadiIIa","date":"2015-02-19T02:26:33.596+0000","up_votes":2,"down_votes":0,"body":"The problem is that Lee Sin is actually hard to play well (although he's not between the hardest ones), and thus Lee Sin mains think that he's fair and that everybody complaining are noobs that can't play. Maybe they should tone their ego down.","replies":[{"poster":"TheI3igDaddy","date":"2015-02-19T03:14:06.246+0000","up_votes":3,"down_votes":0,"body":"I have no problem with Lee Sin in low elo. There you have those who can play him and those who can't.\n\nWhen you get to Plat and above, the majority of Lee Sin players know what they're doing, and when that happens, he crowds out a lot of jungler picks. He'll counter-jungle the squishy, slow starters, and he'll gank just as hard as anyone else since he has no mana to worry about. \n\nIn the LCS, Lee never falls out of favor, because all the pro junglers know how to use him.","replies":[]}]},{"poster":"Zmuecat","date":"2015-02-20T01:42:12.509+0000","up_votes":2,"down_votes":1,"body":"I saw the post you are referring to, it was great.\n\nYou know which champions fans come out of the wood work to bitch, moan, complain, yell, scream, break glass, and shit on every Rioters toast when their champion gets nerfed?\n\n{{champion:37}} \n\nHell, a lot of her player base protested her rework, still reworked.\n\nGuess who is a poke oriented, slow, CC bot ult, weak mana efficient early heal how explodes because the enemy decided to right click her? Still Sona.\n\nGuess who gets nerfed because she's a poke oriented support with unavoidable damage (which requires you to put yourself into just about every ADCs range to be effective) that wasn't removed in her rework, and is really all she brings to a lane pre-6? Still Sona.\n\nBUT HEY, ULTIMATE SKIN!\n\nMorello, or whoever, is hiding behind something that Riot would ignore for 99% of the champion pool.","replies":[]}]},{"poster":"Risurin","date":"2015-02-18T17:54:07.468+0000","up_votes":2,"down_votes":12,"body":"> [{quoted}](name=DrMarshSwamp,realm=NA,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=0001,timestamp=2015-02-18T13:10:49.546+0000)\n>\n> Honestly with the amount of threads calling for Lee nerfs on here, reddit, and other LoL-related forums I can't help but wonder why exactly Riot refuses to touch Lee Sin if so much of the community thinks he is a big problem.\n> \n> Whilst a fair amount of those threads are nonconstructive (OMG NERF LEE SIN, RIOT ONLY CARES ABOUS LC$ BIG PLAYS) I've seen plenty that *are* constructive, each one detailing parts of his kits that help put him above most other Champions just by design and ratios.\n\nBecause \"Here\", reddit and other LoL-related forum doesn't know how balance work. I will go as far as to say that a majority of them are calling nerf because they recently lost a game, in which Lee Sin was on the enemy team, regardless of how they did, their team did, how well Lee and his team played. Its just blind (lol) hate toward a champion that has play material. \n\nHonestly Jarvan, Nidalee and Vi are much better picks, and Nidalee doesnt even have CC. (they all mobile, have a lot of damage, nidalee is the only one without a CC, some sort of %hp damage and instead of a shield, she get a heal that gives AS (scale with ADC). both Vi and Jarvan are way more tanky)","replies":[{"poster":"Bears Dont Care","date":"2015-02-19T02:49:15.855+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Risurin,realm=NA,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=00010002,timestamp=2015-02-18T17:54:07.468+0000)\n>\n> Because \"Here\", reddit and other LoL-related forum doesn't know how balance work. I will go as far as to say that a majority of them are calling nerf because they recently lost a game, in which Lee Sin was on the enemy team, regardless of how they did, their team did, how well Lee and his team played. Its just blind (lol) hate toward a champion that has play material. \n> \n> Honestly Jarvan, Nidalee and Vi are much better picks, and Nidalee doesnt even have CC. (they all mobile, have a lot of damage, nidalee is the only one without a CC, some sort of %hp damage and instead of a shield, she get a heal that gives AS (scale with ADC). both Vi and Jarvan are way more tanky)\n\nJarvan has 19 more armor.... no he is not.more tanky.\nLee sin has.more.mobility, stronger damage, and just as much utilitt.\nFor anyone to suggest otjerwise begs obe to wonder if they never.looked at lee sins numbers and kit","replies":[{"poster":"Risurin","date":"2015-02-19T03:35:43.694+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Annoth84,realm=NA,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=000100020000,timestamp=2015-02-19T02:49:15.855+0000)\n>\n> Jarvan has 19 more armor.... no he is not.more tanky.\n> Lee sin has.more.mobility, stronger damage, and just as much utilitt.\n> For anyone to suggest otjerwise begs obe to wonder if they never.looked at lee sins numbers and kit\n\nJarvan shield ability is a lot better, and it scale with surrounding opponent champions, which make it really good in teamfight (up to 510 hp shield compared to Lee Sin 200 hp shield to a maximum to 2 different target, and will often use it on a ward during team fight for \"insec\" plays which mean he doesnt get it at all. Yes, he is more tanky.\n\nLee has multiple mobility abilities, but Jarvan is not too far as mobile, and his mobility combo has knockup, armor shred, AS aura, and place him a good spot to land his ultimate that lock people up. For instance, Cloud9 game against Elements ate IEM San Jose not too long ago, displayed how good Jarvan can be, specially against immobile champions like Xerath. Then his ult combos so well with Gnar and Vayne, allowing them to easy land stuns. Jarvan just has maybe less number, but he does so much more overall. Didn't even mention how much better Jarvan scale compared to Lee.\n\nHonestly, I cant but picture people that come here to QQ about Lee, must have recently lost to a team that had a lee, regardless of lee own performance, just because they made poor decision during the game, (probably in the early stages, if the Lee was dominating). Learning how to play against champions that give you trouble is far more productive that QQ here because you struggle against a champion.","replies":[{"poster":"Bears Dont Care","date":"2015-02-19T17:29:57.793+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Risurin,realm=NA,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=0001000200000000,timestamp=2015-02-19T03:35:43.694+0000)\n>\n> Jarvan shield ability is a lot better, and it scale with surrounding opponent champions, which make it really good in teamfight (up to 510 hp shield compared to Lee Sin 200 hp shield to a maximum to 2 different target, and will often use it on a ward during team fight for \"insec\" plays which mean he doesnt get it at all. Yes, he is more tanky.\n\nIn order for Jarvan's shield to be 510, you need to hit all 5, this does not occur typically and you'll normally aura 1or  giving you lghtly more shield.\nHowever, while this affords a slight increase in eHP, this isn't significant enough to make the statement of Jarvanbeing absolutely more tanky.\n\n> \n> Lee has multiple mobility abilities, but Jarvan is not too far as mobile, and his mobility combo has knockup, armor shred, AS aura, and place him a good spot to land his ultimate that lock people up. For instance, Cloud9 game against Elements ate IEM San Jose not too long ago, displayed how good Jarvan can be, specially against immobile champions like Xerath. Then his ult combos so well with Gnar and Vayne, allowing them to easy land stuns. Jarvan just has maybe less number, but he does so much more overall. Didn't even mention how much better Jarvan scale compared to Lee.\n\nUm... Jarvan does not scale better than Lee Sin.\nLee sin Q = 340 base +180% AD + 8% health missing\nJarvan Q = 250 damage +120% AD\n\nLee Sin's E scales with AD, Jarvan's does not.\nLee SIn's ult is 600 + 200% AD\nJarvan's ult is 450 base _ 150% AD\n\n\nJarvan does not scale better period.\nIt is literally ignorant to make suc a statement,\n\nThe only reason Jarvan has been seeing more play is because his ult became a true structure allowing Gnar combos, but even then, Lee Sin is so much more flexible and can set up plays that do not requires as much of a set up.\n\n> \n> Honestly, I cant but picture people that come here to QQ about Lee, must have recently lost to a team that had a lee, regardless of lee own performance, just because they made poor decision during the game, (probably in the early stages, if the Lee was dominating). Learning how to play against champions that give you trouble is far more productive that QQ here because you struggle against a champion.\n\nThis is an ad hominem and can be rightly ignored.\nThe exact same argument can be made towards you and Jarvan, so keep your ignorance to yourself tyvm","replies":[{"poster":"Risurin","date":"2015-02-19T18:09:30.576+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Annoth84,realm=NA,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=00010002000000000000,timestamp=2015-02-19T17:29:57.793+0000)\n>\n> In order for Jarvan's shield to be 510, you need to hit all 5, this does not occur typically and you'll normally aura 1or  giving you lghtly more shield.\n> However, while this affords a slight increase in eHP, this isn't significant enough to make the statement of Jarvanbeing absolutely more tanky.\n\nLuckly for jarvan, he has tools to get in the middle of the enemy team, and lock them in a little zone. getting 3 opponent worth of shield shouldnt be too hard in a teamfight. thats 390 hp shield, about double of lee self shield. then you add up slightly more armor from stats+abilities + Lee will likely get a sightstone for ward hoping (if the lee doesnt, he isnt using his kit to is full potential, which is already a weakness) and sightstone yes has a bit of hp in it, but not as much compared to an actual completed tank item, which will have significantly more effective hp.\n \n> Um... Jarvan does not scale better than Lee Sin.\n> Lee sin Q = 340 base +180% AD + 8% health missing\n> Jarvan Q = 250 damage +120% AD\n> \n> Lee Sin's E scales with AD, Jarvan's does not.\n> Lee SIn's ult is 600 + 200% AD\n> Jarvan's ult is 450 base _ 150% AD\n> \n> Jarvan does not scale better period.\n> It is literally ignorant to make suc a statement,\n\nScaling doesnt comes only in raw damage numbers. \nYou forget to mention that jarvan Q has up to 26% armor reduce (can hit up to all opponents), which is tied up with his initiate knock up, which gives AS aura, Easy assists without the need to even hit an opponent, and scale really well with your adc (you will have one in your game, maybe more, maybe other champions that scale well with AS, like jax or azir) then your shield. his ult does indeed less damage, but you seem to forget again it combos with other champions like gnar and vayne, and more importantly lock people up, often forcing them to burn their flash, or just get destroyed by the jarvan's team. IMO better then hard to place \"insec\" that may or may not work to place a carry in harms way, but will also surely put lee in an identical spot. oh and dont forget 10% hp damage on 6 sec cd passive is actually better then 40% as for 2 sec on a not AA based champion, after some time into the game. Also, as i mentionned earlier, Jarvan gets more from shield, and since shield is literally temporary hp, it means that getting more of the other defensive stats (armor and resist),  are more effective.\n\nJarvan scale better then Lee in teamfight, which means he is better in the mid/late game. Call me ignorant if you want, but it doesn't add anything to your argument and surely doesn't mean that lee scales better.\n\n\n> The only reason Jarvan has been seeing more play is because his ult became a true structure allowing Gnar combos, but even then, Lee Sin is so much more flexible and can set up plays that do not requires as much of a set up.\n> \n> This is an ad hominem and can be rightly ignored.\n> The exact same argument can be made towards you and Jarvan, so keep your ignorance to yourself tyvm\n\nActually, jarvan has seen play before gnar has. the combo just added up to the priority of the jarvan pick. Locking up a target in player made terrain is a lot more powerful then a kick. just think about how easier it is to destroy a xerath for instance (or any immobile champion) or to follow it up with Azir soldiers, Graves ult, Lissandra kit, Maokai, Ahri corki, nidalee etc (idk if you get it, but these are a lot of champions that are currently meta, and go well with jarvans kit) \n\nYou will excuse me if i dont understand the point of making a reply and expecting it to just be ignored, although, as you said you just spend most of it just calling me ignorant, because you believe i'm wrong, instead of just making a solid argument to show me that i've made a mistake. May i suggest that, if you believe someone is ignorant, you should try to educate them and help them see your point of view. Just calling people ignorant, without any argument just makes you look like you have problems with the any previous statement, but fail to be able to show why it is wrong.\n\nFrom what i see, you just looked at raw numbers and concluded that lee scale better because he gets more from full damage build (btw both jarvan and lee going full damage, is likely to result in their quick demise, when teamfight happen, specially at later stages of the game). If you reply again, i hope its for a better discussion then just calling people ignorant. :^)","replies":[{"poster":"Bears Dont Care","date":"2015-02-19T21:41:58.504+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Risurin,realm=NA,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=000100020000000000000000,timestamp=2015-02-19T18:09:30.576+0000)\n>\n> Luckly for jarvan, he has tools to get in the middle of the enemy team, and lock them in a little zone. getting 3 opponent worth of shield shouldnt be too hard in a teamfight. thats 390 hp shield, about double of lee self shield. then you add up slightly more armor from stats+abilities + Lee will likely get a sightstone for ward hoping (if the lee doesnt, he isnt using his kit to is full potential, which is already a weakness) and sightstone yes has a bit of hp in it, but not as much compared to an actual completed tank item, which will have significantly more effective hp.\n\nLee Sin builds sight stone not because he needs it for full kit potential, but primarily because he is one of the few champions capable of affording a sightstone without a significant loss in terms of stats. It is part of what makes him such a great jungler.\nHe doesn't need to immediately build tanky or build damage.\nHe has high enough base damage, and he has the tools and capabilityof getting in and out of a fight.\nJarvan does not have the same tools, and thus, will build a randuin's instead because once he goes into a fight, he isn't expected to escape it lke Lee Sin.\nTheir build paths are different because of what they can do.\nLee Sin can escape, Jarvan cannot.\n\n\n> \n> Scaling doesnt comes only in raw damage numbers. \n\nWhen you make an ambigous statement, you cannot blame an individual for assuming such.\n\n> You forget to mention that jarvan Q has up to 26% armor reduce (can hit up to all opponents), which is tied up with his initiate knock up, which gives AS aura, Easy assists without the need to even hit an opponent, and scale really well with your adc (you will have one in your game, maybe more, maybe other champions that scale well with AS, like jax or azir) then your shield. his ult does indeed less damage, but you seem to forget again it combos with other champions like gnar and vayne, and more importantly lock people up, often forcing them to burn their flash, or just get destroyed by the jarvan's team. IMO better then hard to place \"insec\" that may or may not work to place a carry in harms way, but will also surely put lee in an identical spot. oh and dont forget 10% hp damage on 6 sec cd passive is actually better then 40% as for 2 sec on a not AA based champion, after some time into the game. Also, as i mentionned earlier, Jarvan gets more from shield, and since shield is literally temporary hp, it means that getting more of the other defensive stats (armor and resist),  are more effective.\n\n26% armor reduction relies entirely upon the armor the individual has built up to that point. While it helps keep his damage relevant, it doesn't necessarily mean his damage will be higher unless the target has a significant amount of armor which only 1 or 2 champions will possess. In which cae, focus falls upon CCing those targets, rather than trying to kill them.\n\nJarvan's ult is good, but you must also consider that the mjority of champions played in the meta can escape it without using flash, and will typically dos o.\nThis is part of why Lee Sin dominated during s4. Up until the changes to Jarvan's ult, it wasn't that much better.\n\nFurthermore, 10% HP is only on CURRENT health.\nLee Sin's Q executes based on 8% missing health, meaning it will be better as the fight continues whre as Jarvan's relies entirely upo how much of their pool exists.\nLee Sin also gets an innate 40% AS boost, which makes up for th 10% damage thatJarvan gets on his passive, especially for jungle clearing.\nLee Sin's ult is arguably better than Jarvan's.\nIt cannot be escaped as it is point and click, it disables multiple champs and does not require a 2nd party to create hard CC. If you noticed the game where the gnarvan combo was being utilized, it required much more set up and was hard to utilize under pressure. \nLee Sin can merely safequard ult the ADC, then Q to escape or vice versa.\n\nNO risk involved compared to the gnarvan combo.\nWhile Jarvan can get more from his shield, this is making the assumption that he will, and at most we really only see 1-2 champs being aura'ed unless it is in the jungle.\n\n\n\n> \n> Jarvan scale better then Lee in teamfight, which means he is better in the mid/late game. Call me ignorant if you want, but it doesn't add anything to your argument and surely doesn't mean that lee scales better.\n\nThe only aspect where Jarvan scales \"better\" than lee sin is through his tankiness through his shield which is at best, 200 more hp.\nUtility? Lee Sin maintains it.\nDamage? Lee Sin ALWAYS does more.\nPlay set ups? Lee Sin does it much more easily and does NOT require a second champion to crete hard CC on multiple targets.\nIf you are suggesting that he scales better defensively?\nYes. He does, but only due to his shield and even then, not significantly enough to say flat out that Jarvan is absolutely more tanky. \n\n\n\n> \n> Actually, jarvan has seen play before gnar has. the combo just added up to the priority of the jarvan pick. Locking up a target in player made terrain is a lot more powerful then a kick. just think about how easier it is to destroy a xerath for instance (or any immobile champion) or to follow it up with Azir soldiers, Graves ult, Lissandra kit, Maokai, Ahri corki, nidalee etc (idk if you get it, but these are a lot of champions that are currently meta, and go well with jarvans kit) \n\nNot necessarily, again, you are focusing on a champion such as Xerath, his low mobility means he is easy prey for any of the meta junglers at the time such as Kha'zix, elise, etc etc.\n\nLee SIn can just as easily work well with Lissandra's kit, Grave ult, azir ult, maokai snare, nidalee/ahri/corki.\nPrimarily because even if they attempt to escape, Lee Sin CAN and WILL stick to them.\nJarvan cannot catch a Kallista.\nLee Sin will catch her and kick her back to the front line and prevent her from decimating your team and allow your team to catch her.\nLee Sin can easily separate a champ, and due to the low cd and damageof it, he is more likely to leave them in a state where they are less likely to escape.\n\nJarvan's ult has stronger potential yes, but the set up required is often too difficult and requires certain scenarios. That isn't good for play, you want flexibility so you can pick and choose when to fight rather than being so reliant on the rest of the team.\n\n\n> \n> You will excuse me if i dont understand the point of making a reply and expecting it to just be ignored, although, as you said you just spend most of it just calling me ignorant, because you believe i'm wrong, instead of just making a solid argument to show me that i've made a mistake. May i suggest that, if you believe someone is ignorant, you should try to educate them and help them see your point of view. Just calling people ignorant, without any argument just makes you look like you have problems with the any previous statement, but fail to be able to show why it is wrong.\n\nReally?\nYou made the statement that anyone who sees a problem with Lee Sin is an individual who had issues with the champion and is thusly biased.\nThat is being ignorant and insulting.\nYour statement could be used for any champion, Jarvan, vi, etc etc.\nSo yes, being called ignorant fits you perfectly.\nDo not act indignant when your behavior has been pointed out.\n\n> \n> From what i see, you just looked at raw numbers and concluded that lee scale better because he gets more from full damage build (btw both jarvan and lee going full damage, is likely to result in their quick demise, when teamfight happen, specially at later stages of the game). If you reply again, i hope its for a better discussion then just calling people ignorant. :^)\n\nVery few people will ever go full damage outside of ADC's, primarily because hey need some survivability.\nDamage wise? Lee Sin, point for point, gets more out of damage items than Jarvan ever will. This is a fact.\nTank wise? Jarvan has a slight edge.\nUtility wise? Lee Sin retains it constantly. He doesn't need someone to set up a play, he can do it on the spot. Knocking up the entire team and ripping half the health off an ADC with your ult AND pushing them to be in front of your team is amazing, and as we saw in S4, it could be done consistently.\n\nJarvan combos? More rewarding but extremely hard to get done.\n\nThere is no reason to ever consider Jarvan more of an issue than Lee Sin.","replies":[{"poster":"Risurin","date":"2015-02-20T05:35:06.167+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Annoth84,realm=NA,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=0001000200000000000000000000,timestamp=2015-02-19T21:41:58.504+0000)\n>\n> Lee Sin builds sight stone not because he needs it for full kit potential, but primarily because he is one of the few champions capable of affording a sightstone without a significant loss in terms of stats. It is part of what makes him such a great jungler.\n> He doesn't need to immediately build tanky or build damage.\n> He has high enough base damage, and he has the tools and capabilityof getting in and out of a fight.\n> Jarvan does not have the same tools, and thus, will build a randuin's instead because once he goes into a fight, he isn't expected to escape it lke Lee Sin.\n> Their build paths are different because of what they can do.\n> Lee Sin can escape, Jarvan cannot.\n\nJarvan can esscape. And btw, in competitive, you will often see Jarvan/vi/etc get the sightstone as a jungler because of the vision, and to match the vision the enemy jungler with a sightstone can provide. we even seen khazix with a sightstone during world championship, and he didnt look any weak. Sightstone jarvan is nothing new, he can afford it and it doesnt make him any worse.\n\n> When you make an ambigous statement, you cannot blame an individual for assuming such.\n\na champion doesnt only scale with ratios. Mundo doesnt have that many good ratio, yet he scale into late game verywell. A champion scale depending on what his kit does.\n \n> 26% armor reduction relies entirely upon the armor the individual has built up to that point. While it helps keep his damage relevant, it doesn't necessarily mean his damage will be higher unless the target has a significant amount of armor which only 1 or 2 champions will possess. In which cae, focus falls upon CCing those targets, rather than trying to kill them.\n\nthe difference between 100 and 74 armor is 7% damage, at lvl 8 a champion like lissandra, with obviously Hourglass and lets say armor run has 100 armor. The difference is thru a debuff so it upgrade all sources of AD damage your team does, including your ADC. dont forget you boost his damage already with you AS aura. \n\n> Jarvan's ult is good, but you must also consider that the mjority of champions played in the meta can escape it without using flash, and will typically dos o.\n> This is part of why Lee Sin dominated during s4. Up until the changes to Jarvan's ult, it wasn't that much better.\n\na good jarvan ult, is also significally easier to land then a lee ult, and it can trap more then one champion in it. My favorite demonstration of this, is IEM Sanjose, when Cloud9 deleted 2 played because of flash jarvan ult into E Q, the lock was real.\n\nWhen i think about Season 4 jungle dominance, i think about kha'zix, not lee.\n\n> Furthermore, 10% HP is only on CURRENT health.\n> Lee Sin's Q executes based on 8% missing health, meaning it will be better as the fight continues whre as Jarvan's relies entirely upo how much of their pool exists.\n> Lee Sin also gets an innate 40% AS boost, which makes up for th 10% damage thatJarvan gets on his passive, especially for jungle clearing.\n> Lee Sin's ult is arguably better than Jarvan's.\n> It cannot be escaped as it is point and click, it disables multiple champs and does not require a 2nd party to create hard CC. If you noticed the game where the gnarvan combo was being utilized, it required much more set up and was hard to utilize under pressure. \n> Lee Sin can merely safequard ult the ADC, then Q to escape or vice versa.\n\nThing is if he only need safeguard to ult an ADC, either the adc is horribly out of position, either the enemy team are more blind then lee himself xD in reality, lee will usually need his Q to get in, W to get in position R to push the adc into his team, and suprise factor + flash to get away\nif we going with bonus AS well instead of 2sec 40% as on spell cast, jarvan get 22% passive AS +22% when he toss his flag. Also, dont forget again he has armor shred! its clear lee will do more damage early on his own, but later on, jarvan, will do a lot more then lee for far less work in a teamfight.\n\n\n> NO risk involved compared to the gnarvan combo.\n> While Jarvan can get more from his shield, this is making the assumption that he will, and at most we really only see 1-2 champs being aura'ed unless it is in the jungle.\n\nthe onyl risk of gnarvan combo, is that you miss the combo...there are still two tanky guy in the front line lol. i think 2-3 hits with shield in teamfight is pretty reasonable, and its already a lot better then lee selfshield\n\n> The only aspect where Jarvan scales \"better\" than lee sin is through his tankiness through his shield which is at best, 200 more hp.\n> Utility? Lee Sin maintains it.\n> Damage? Lee Sin ALWAYS does more.\n> Play set ups? Lee Sin does it much more easily and does NOT require a second champion to crete hard CC on multiple targets.\n> If you are suggesting that he scales better defensively?\n> Yes. He does, but only due to his shield and even then, not significantly enough to say flat out that Jarvan is absolutely more tanky. \n\nearly game, sure lee can be stronger then jarvan, thats basically what lee is, strong early game. but later on jarvan mobility isnt far inferior, his utility is far better and more diverse, his damage output should even be stronger (26% armor shred hurt even squishies, specially followed by a 10% hp dmg and a knock up in the mix, and easy target for slow and ulti. Also, while i agree 26% armor shred is the bestest, its still better then not penetration at all, and lee doesnt have any, so as the game progress, as champion get natural armor with levels, and items (even carries with the like of hourglass and GA)  Jarvan ulti is also a point and click, and you can lock so much champion in it and its far mroe easy to execute and land then an \"insec\".  jarvan does so much more then lee.\n\nThere is a reason why jarvan ban rate is 53%+ while lee is a bit less then 3%. There is a reason why jarvan win rate is also 53% while lee is at 46%.\n\n> Not necessarily, again, you are focusing on a champion such as Xerath, his low mobility means he is easy prey for any of the meta junglers at the time such as Kha'zix, elise, etc etc.\n> Lee SIn can just as easily work well with Lissandra's kit, Grave ult, azir ult, maokai snare, nidalee/ahri/corki.\n> Primarily because even if they attempt to escape, Lee Sin CAN and WILL stick to them.\n> Jarvan cannot catch a Kallista.\n> Lee Sin will catch her and kick her back to the front line and prevent her from decimating your team and allow your team to catch her.\n> Lee Sin can easily separate a champ, and due to the low cd and damageof it, he is more likely to leave them in a state where they are less likely to escape.\n\nIts always better to lock someone so that your team can follow up, then ahving 1 guy being able to solo follow across the map. Against Kalista, both the champions arent the best choice. Vi is. pantheon and wukong probably would do better as well although they arent as high tier pick. at that point its draft phase decision more then anything. And yes Lee can work well with these champion as well, but Jarvan set them up so much easier and better then lee does. \n \n> Jarvan's ult has stronger potential yes, but the set up required is often too difficult and requires certain scenarios. That isn't good for play, you want flexibility so you can pick and choose when to fight rather than being so reliant on the rest of the team.\n\nE+Q +R, you can even just flash+R and you have your lock, its a point and click as well. He just need teams to be teamfighting and of course to make sure he ult when follow up is possible. your argument kinda goes against lee sin too, because he literally jump into the enemy team to displace 1 guy. if it goes poorly he literally suicided for free.\n\n> Really?\n> You made the statement that anyone who sees a problem with Lee Sin is an individual who had issues with the champion and is thusly biased.\n> That is being ignorant and insulting.\n> Your statement could be used for any champion, Jarvan, vi, etc etc.\n> So yes, being called ignorant fits you perfectly.\n> Do not act indignant when your behavior has been pointed out.\n\ntbh honest, the first time around i though you were just genually calling your own post an ad hominen, since you were calling me ignorant multiple time in it. misread that (english is the 4th language, i'm still learning) \n\nWhat i said back there, is basically how i cant, but feel how the post are made under these conditions. not that they are necessary. That is because a lot of them dont have any solid argument other then the natural \"lee is too stronk\" and  \"his kit does X Y Z\" said in a way to make it sound more overwhelming then they do, which is seen often in these kind of posts. makes me feel liek the posts were made quickly without enough though put into them, which makes me consider they were maybe made out of recent soloq misadventure. Then i followed with the natural statement that its more productive to look for solution to your game difficulties, then just posting in a forum in hope to create enough riot against a champion. As i said, its how i perceive these post, and sometimes i do even make fun of it, but its not like i can verify it. no need to take how i feel like a direct attack lol,","replies":[]}]}]}]}]}]}]}]},{"poster":"SEKAI","date":"2015-02-18T14:20:21.931+0000","up_votes":40,"down_votes":9,"body":"He doesn't need a nerf, no.\n\n**This man needs a rework**, clearly his design was poorly thought out as he was meant to be just an Apirl Fools Joke in the first place. I mean he was released that day it's got to be that no doubt.\n\nIf I was in the Riot's design and balance team I would never EVER let a champion with a kit that is twice as big as every others, low cd, near non-existent resource system, mad cc, epic damage and scaling, infinite gap closing with second highest base MS and being blind ONLY to not being blind but also has highest amount of vision, to pass my QA test in the first place.\n\nNothing in this champ's kit actually make sense, and because of him setting the champion design bar to ridiculous level then we get today's obsession in mobility that comes with NO drawback.\n\nRework this fella shall serve as Riot's first step in self correction, if they will ever do that (I doubt but I really hope), Riot will instantly become one of The most respected game company in the whole world.","replies":[{"poster":"Retillin","date":"2015-02-18T14:48:04.082+0000","up_votes":27,"down_votes":3,"body":"I disagree. Riot's first step shouldn't be rework. It should be nerf while the rework is coming. So that we can see the strength and weaknesses that this opens for other champions and the jungle issues that need to be looked at.","replies":[{"poster":"SEKAI","date":"2015-02-18T14:58:15.216+0000","up_votes":3,"down_votes":1,"body":"I agree.","replies":[]}]},{"poster":"Nameless Voice","date":"2015-02-18T18:58:34.630+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=SEKAI,realm=OCE,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=0002,timestamp=2015-02-18T14:20:21.931+0000)\n> If I was in the Riot's design and balance team I would never EVER let a champion with a kit that is twice as big as every others\n\nSadly, this is exactly what Riot's design team seems to do, consistently.\nThey talk about good design principles, and they often use those principles when reworking old champions, but they completely ignore them when creating new champions (while also casting a blind eye to Lee Sin.)\n\nRegardless of power level, the game is full of a handful of champions with completely overloaded kits like this:\n{{champion:429}} {{champion:157}} {{champion:238}} {{champion:412}} {{champion:64}} \n\nYou can argue about their power levels any way you wish, but these are some of the worst-designed champions in the game, because of their overloaded kits and no properly defined strengths and weaknesses.","replies":[{"poster":"ecneregilleb","date":"2015-02-18T21:48:43.924+0000","up_votes":6,"down_votes":0,"body":"lol 4/5 of those champs are spawns of CertainlyT","replies":[]},{"poster":"Knight SoIaire ","date":"2015-02-18T19:38:14.667+0000","up_votes":5,"down_votes":1,"body":"> Regardless of power level, the game is full of a handful of champions with completely overloaded kits like this:\n\nyou forgot that we also have the oposites, we have champions who have barely anything that is usefull for the team in their kits and their only strenght lies in having a little better numbers than you\n\ndarius- medicore pull that is his only chance at gameplay besides a good flank or flash, still you can hit a cc on him and run, away laughing cause he wont catch you unless he spends loads of gold for movement speed, but then he will be squishy and lack some damage meaning that ppl will fighth him more often, and slow gated by worst reset ever (either you dont use it and hope you will get reduced cd or you use it and can be sure you wont get the lower cd)\n\nmordekaiser- literaly only damage, and riot nerfs him in every way they can think off \n\nsigned- he has a flip, barely any damage and its easy way to avoid it, in the end competes very little to the game\n\nolaf- basicaly a ball of stats, his immunity to cc is fine, still rekt by mobility \n\nmundo- his cleavers dont even scale  \n\ngaren- a ball of stats in its purest form, \n\nthey get some better base stats for lacking stuff, but that doesnt work as we can easily see,\n\nand compare it with stuff like the example of lee sin \npoke skillshot \ngapcloser with damage on it and execute on top of the damage \na dash to any friendly unit which shields champions\na spellwamp/lifesteal steroid \natack speed steroid \naoe magic dmg scaling off ad \naoe slow \naoe knockup with prolly biggest base damage and scaling ad champion could have \n\nand the thing is that lee sin isnt the only example of that too, Nameless Voice  listed only couple of examples and the list is preety big","replies":[]}]},{"poster":"Xela Syab","date":"2015-02-19T21:22:56.184+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SEKAI,realm=OCE,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=0002,timestamp=2015-02-18T14:20:21.931+0000)\n>\n> He doesn't need a nerf, no.\n> \n> **This man needs a rework**, clearly his design was poorly thought out as he was meant to be just an Apirl Fools Joke in the first place. I mean he was released that day it's got to be that no doubt.\n> \n> If I was in the Riot's design and balance team I would never EVER let a champion with a kit that is twice as big as every others, low cd, near non-existent resource system, mad cc, epic damage and scaling, infinite gap closing with second highest base MS and being blind ONLY to not being blind but also has highest amount of vision, to pass my QA test in the first place.\n> \n> Nothing in this champ's kit actually make sense, and because of him setting the champion design bar to ridiculous level then we get today's obsession in mobility that comes with NO drawback.\n> \n> Rework this fella shall serve as Riot's first step in self correction, if they will ever do that (I doubt but I really hope), Riot will instantly become one of The most respected game company in the whole world.\n\nreally all riot needs to do is just change his abilities to do MAGIC damage, that way he can't itemize well for armor pen.","replies":[]}]},{"poster":"Burgee","date":"2015-02-18T17:18:02.908+0000","up_votes":10,"down_votes":2,"body":"\"Lee can no longer jump to wards placed from a sightstone\" \n\nFixed him.","replies":[{"poster":"KING OF MASKS","date":"2015-02-18T19:06:14.263+0000","up_votes":26,"down_votes":0,"body":"They need to remove his ward hopping completely. It makes zero sense that an ability called \"Safeguard\" can be used on wards, ***ESPECIALLY*** when rito's reasoning for not allowing {{champion:201}} to ward hop was that an ability called \"Stand Behind Me\" wouldn't make sense if used on a ward.\n\nHypocrisy of the highest order.","replies":[{"poster":"IcyPepper","date":"2015-02-18T19:10:03.300+0000","up_votes":10,"down_votes":0,"body":"If Braum could ward hop, just imagine the #LCSBIGPLAYS\n\nCome on, Rito, you know you want to... just imagine all the baron saves.","replies":[{"poster":"Keevalroy","date":"2015-02-19T03:31:44.410+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=tombdragon,realm=NA,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=000700010000,timestamp=2015-02-18T19:10:03.300+0000)\n>\n> If Braum could ward hop, just imagine the #LCSBIGPLAYS\n> \n> Come on, Rito, you know you want to... just imagine all the baron saves.\n\nNo...NO! WHAT HAVE YOU DONE??","replies":[{"poster":"IcyPepper","date":"2015-02-19T03:46:08.088+0000","up_votes":4,"down_votes":0,"body":"At least Braum doesn't have 200% bonus HP scaling on his ultimate...","replies":[]}]}]}]}]},{"poster":"Divewing","date":"2015-02-18T12:55:51.275+0000","up_votes":12,"down_votes":0,"body":"Can only upvote once zzzzzzzzzzzzzz","replies":[]},{"poster":"warpenguin555","date":"2015-02-18T15:00:26.947+0000","up_votes":11,"down_votes":3,"body":"he doesnt need a nerf, gosh you people just dont Lee Sin\n(actually nerf this pun)","replies":[]},{"poster":"Oleandervine","date":"2015-02-18T19:26:43.824+0000","up_votes":7,"down_votes":0,"body":"Yeah, \"nerfing\" Lee Sin was like the most recent Zed \"nerf.\"\n\nBalance Team Meetings\nGuy 1: Zed is a little powerful. People want him nerfed.\nGuy 2: Where is he the strongest at?\nGuy 1: He has high burst, he's mobile and evasive, and he's energy based with high recovery.\nGuy 2: Nerf his attack speed.\nGuy 1: Of course! Why didn't I think of that!\nGuy 2: Problem Solved! Balance!","replies":[]},{"poster":"Minrog","date":"2015-02-18T20:45:19.385+0000","up_votes":5,"down_votes":0,"body":"I keep seeing nerfs on other junglers.  Most of them are crippling nerfs that prevent them from performing their role anymore, like what happened to Fiddlesticks/Elise/Kha'Zix/Olaf.\n\nJust tick off a list of the ones that got destroyed and it's not hard to see the preferential treatment this one champion is being given.  For what it's worth, I think Riot's team is messing it up pretty bad.  Overnerfing is worse than doing nothing, but how are they able to be so incompetent at this for so long and still remain gainfully employed?  Is it just because Blizzard decided not to compete with them yet, like they think they are Comcast or something?\n\nI dunno.  I feel like they jumped the shark with how they handled Warwick and Fiddlesticks.  I don't believe they understand their own game.","replies":[]},{"poster":"xSkyl1ne","date":"2015-02-18T20:15:37.812+0000","up_votes":6,"down_votes":7,"body":"Lee does not need nerfs and won't get any.\nPeople are just crying way too much about him, eventough Lee has received so many nerfs in the past, including the** complete** removal of his armor on w, and attack speed slow on his e. \nEven after that, people manage to call him \"Overloaded\". Well what does Lee have? His passive is strong, thats true, (it was nerfed before ) and honestly the only thing i see future nerfs. He has a skillshot execute on his q, his best ability by far. His w is a mediocre shield, especially since it procs only on ally cast ( another nerf ). The lifesteal on his w is great tho. His e used to be good, when it would slow attack speed as well, making it a relevant ability lategame, but now its one of the worst slows  (20% / 30% / 40% / 50% / 60%) and even decays pretty fast. His ult is a nuke, and can screw your whole team over if used incorrectly. \n\nSo we have: Burst Damage\n                      Sustain\n                      Mobility \n                      CC (only if Ult is used properly)\n\nMany Champions posses these traits aswell, sometimes trading in the mobility for Tankiness, which Lee** does not **have. Lee is squishy as hell before he gets his tank items, and even then, he drops super quickly, since none of his abilities scale of tankiness. Additionally, contrary to what people say, lee is** heavily** gated by energy, not being able to do a full rotation without the use of his passive, which, especially late game, is hard to trigger since you wont stay in a fight long enough to consecutivly auto. \nI heard someone say : \"Lee does as much damage as an assassin\", well that is because Lee** is** and assassin. he has the exact skillset off an assassin and therefore should be treated as one. Only that his burst is unreliable ( late game, try to hit that adc in the middle of his team ) making him a crappy assassin.\nHe is played as an Kick bot, his only play late game is to insec someone, or kick someone away. His oter abilites are so crappy that they are only used to setup up aforementioned kicks. He is a one trick pony, that is only seen as overpowered, because people cant play safe in the early game and get caught out by lee, in his strongest phase of the game.\n A jungle Lee that does not get any kills, is downright** useless**, a lee that cant use his abilities correctly might as well play on the enemy team. He is super item reliant, and does snowball pretty hard, like** any other assassin out there  **\nI used to main top lane lee, which even became **unviable**after the nerfs to his e, because Lee as a champion is relieing on your opponent not knowing what hes doing. Jungle Lee only works to beginn with because with because he navigates the jungle well and can setup picks and other oppurtiurnities. This is in no way overpowered. I would much rather have a vi or a jarvan in my team, how bring reliable burst and lockdown potential, which is why they are the better junglers.","replies":[{"poster":"KaisadiIIa","date":"2015-02-19T01:37:36.880+0000","up_votes":3,"down_votes":0,"body":"> His ult is a nuke\n\nHis R is meant for CONTROL.\nVeigar's R is a nuke.\nThat's why Veigar's R doesn't knock-up people.","replies":[{"poster":"Bears Dont Care","date":"2015-02-19T02:53:22.060+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=ShinobuElveszett,realm=EUW,application-id=3ErqAdtq,discussion-id=mLuAOGbt,comment-id=00100000,timestamp=2015-02-19T01:37:36.880+0000)\n>\n> His R is meant for CONTROL.\n> Veigar's R is a nuke.\n> That's why Veigar's R doesn't knock-up people.\n\n\nHis ult hits for 700 base and 200% ad iirc\nQuite sure its a nuke","replies":[{"poster":"KaisadiIIa","date":"2015-02-19T03:14:15.463+0000","up_votes":3,"down_votes":0,"body":"Pfff I will try to explain myself again:\n\nThe problem with that R is that it's not supposed to be a nuke. The fact that it hits for 600* +200% bonus AD is the problem: it deals more damage than it should be doing.","replies":[]}]}]}]},{"poster":"Junk","date":"2015-02-18T19:18:11.092+0000","up_votes":3,"down_votes":0,"body":"He is ever going to be hit?\n\nAll he got over 4 seasons was lovetap nerfs that removed or nerfed stats he never should have had on his spells in the first place. He never got major nerfs like damage or ratios (at least not huge ones)","replies":[{"poster":"VardenSalad","date":"2015-02-19T03:39:49.099+0000","up_votes":2,"down_votes":0,"body":"You know, there was a time where Lee Sin simply was not popular. Every single player in the game knew of his early power, but everyone knew that he fell off once the game hit 30 minutes. The utility he provided lategame was NOT ENOUGH to overcome his need to build tank and stop doing damage.\n\nDo you know what has happened since that point? Every single different type of jungle that isn't an early duelist has been nerfed into competitive inviability. And all the other early duelists have been nerfed as well.\n\nLee isn't a generalist. He's simply the last one standing after literally every other style of play has been nerfed. His lack of lategame used to be overcome by better scaling champion's strengths. That simply isn't the case anymore, as all competition has been removed.","replies":[]}]},{"poster":"InsaneSamurai","date":"2015-02-18T16:31:56.142+0000","up_votes":3,"down_votes":0,"body":"This assumes they're ever going to actually nerf him :P\n\nI think at this point it's obvious what Riot wants with him.","replies":[]},{"poster":"Regulas","date":"2015-02-19T15:47:19.196+0000","up_votes":2,"down_votes":0,"body":"I've increasingly found this season that Lee doesn't seem to perform as well as he has before. Don't get me wrong he's still strong and can do very well if he gets fed, but more then ever I'm seeing lee's just fail to have the classic impact. Maybe everyone's just to used to him and so know his meta too well, but even his win-rate isn't that healthy regardless of the play level. In practice as long as were careful it seems perfectly viable to manage dealing with an enemy lee, and I've found J4 to be more outright problematic currently.","replies":[]},{"poster":"Bihazard","date":"2015-02-19T14:31:15.477+0000","up_votes":2,"down_votes":0,"body":"I have played lee for a while, and i knew that he is \"Broken\". but what i have noticed is when i have a bad game with ganking, or just getting any kills, that i was basically useless until later in game with engaging. the bottom line, and in my Bronze crappy opinion is that, Lee sin isnt broken or really over powered. some people on here probably just don't know how to play him. when i first play as him, i couldn't do anything because i was so bad but after a while i got so much better with him, but never carried a game with him. so i think its a skill thing. riot probably doesn't touch him because of his skill cap, and says \" oh if your not good then you can't play this champion but if you are, then go ahead and play this Strong champion. just remember that after bronze everyone knows how to counter the shit out of him.\"","replies":[{"poster":"junglerboy16","date":"2015-02-19T14:39:39.417+0000","up_votes":1,"down_votes":0,"body":"Broken does not mean overpowered in this context. Lee's brokenness stems from the fact that if he gets ahead, he can roflstomp a match by himself, but he is equally inclined (if not more so) to also fall helplessly behind. He is binary, not OP, like you noticed, and that is why he needs a rework. Basically, the way his kit is designed (high mobility, huge early damage, pathetic late game) he will alway either be disgustingly OP, or binary to the point where it is a toss up whether you succeed with him or not.","replies":[{"poster":"Bihazard","date":"2015-02-23T20:27:09.420+0000","up_votes":1,"down_votes":0,"body":"I see what your saying. i know a lot of champions like that, or what i have seen, that if they get a head they do the same thing in turns of carrying a team. maybe i looked at it from a different position.","replies":[]}]}]},{"poster":"KaisadiIIa","date":"2015-02-19T01:27:51.394+0000","up_votes":3,"down_votes":1,"body":"I have to say that RIOT wanted to rework him (and I liked that idea) a year ago, and everyone complained about it and keep saying Lee was balanced... I'm glad people is starting to realize that Lee is ridiculously overpowered (even though it requires skill to be played).","replies":[{"poster":"VardenSalad","date":"2015-02-19T03:40:11.597+0000","up_votes":2,"down_votes":0,"body":"You know, there was a time where Lee Sin simply was not popular. Every single player in the game knew of his early power, but everyone knew that he fell off once the game hit 30 minutes. The utility he provided lategame was NOT ENOUGH to overcome his need to build tank and stop doing damage.\n\nDo you know what has happened since that point? Every single different type of jungle that isn't an early duelist has been nerfed into competitive inviability. And all the other early duelists have been nerfed as well.\n\nLee isn't a generalist. He's simply the last one standing after literally every other style of play has been nerfed. His lack of lategame used to be overcome by better scaling champion's strengths. That simply isn't the case anymore, as all competition has been removed.","replies":[]}]},{"poster":"Respakt","date":"2015-02-19T02:29:56.922+0000","up_votes":2,"down_votes":0,"body":"Perhaps Lee Sin himself wields the legendary nerf bat, randomly nerfing those such as Sona while lightly tapping his friends Zed, Kat and others and of course never himself. When other junglers dare challenge his \"power deserved by his high skill cap\", he repeatedly hits them all the way to the bottom (Elise, soon Jarvan IV).","replies":[]},{"poster":"Philbo Baggins","date":"2015-02-18T18:39:26.041+0000","up_votes":1,"down_votes":3,"body":"Lv. 18 account... trollin.","replies":[{"poster":"The DJ Pon3","date":"2015-02-19T02:19:58.788+0000","up_votes":2,"down_votes":0,"body":"I'm only a level 19. That doesn't mean I'm null to what's going on, or that I troll when I get concerned.\n\nThe only reason I'm a level 19 is because I can't play at my house - I only get to play a few games every month or so, sometimes not even that.","replies":[]}]},{"poster":"Kingsgrave","date":"2015-02-18T20:57:43.730+0000","up_votes":2,"down_votes":0,"body":"{{champion:254}} is going to get hit next probably instead of {{champion:64}} ","replies":[]}]}