{"poster":"FilxuX","date":"2016-11-29T16:43:17.507+0000","title":"Sin Fragmentos hace 2 semanas y juego todos los dias","subforum":"Problemas Técnicos","up_votes":3,"down_votes":3,"body":"tengo algunas dudas.. quiero saber si es normal que no saque llaves tan seguido, tengo 4 o 5 cofres y 1 solo fragmento de llave ademas ya hace 2 semanas aproximadamente que no me dan ning&uacute;n fragmento, quiz&aacute;s estoy bugeado o algo pero no se me inquieta ya que juego con artos amigos y siempre me dicen que le dan fragmentos y ami nada.","replies":[{"poster":"Salvor","date":"2016-11-29T18:34:13.150+0000","up_votes":1,"down_votes":0,"body":"http://i.imgur.com/PU1snj6.jpg","replies":[{"poster":"Ingratitud","date":"2016-11-29T19:42:42.402+0000","up_votes":2,"down_votes":0,"body":"_\"Dios le da pan al que no tiene dientes\"_\n\nhttp://i.imgur.com/hSsTc1M.png\n\nSi sabes cuando se reinicia tu cantador, te pasa el caso inverso.","replies":[]}]},{"poster":"Ingratitud","date":"2016-11-29T17:25:30.840+0000","up_votes":2,"down_votes":0,"body":"Buenas FilxuX , hace unos meses el \"rioter\" Chipteck publico un articulo, en la parte de soporte de riot, sobre las artesanía Hextech. Te paso un fragmento de su articulo:\n\n**\"PARECE QUE YA NO ESTOY RECIBIENDO MUCHAS LLAVES DE FRAGMENTOS. ¿QUÉ PASA?**\n\n_La tasa de aparición de fragmentos de llaves es una curva, no una línea. Con cada fragmento que ganas, las posibilidades de ganarse uno más disminuyen un poco. El número se reinicia aproximadamente cada treinta días después de que ganaste el primer fragmento de llave._\n\n_Queríamos que los jugadores que no juegan con tanta frecuencia tuvieran una buena tasa de aparición de fragmentos, sin hacer que se sintiera que acumular partidas era obligatorio para obtener llaves._\n\n_Si quieres leer el resto del articulo del \"rioter\" Chipteck, entra en el enlace de abajo, esta muy detallado, desde las gemas, fragmentos de llaves, cofres, fragmentos de campeón, skin y wards, junto con las esencias y problemas comunes con las artesanía Hextech._\n\nhttps://support.riotgames.com/hc/es-419/articles/207884233-Guía-de-Artesanía-Hextech\n\n{{sticker:slayer-jinx-wink}} \n\nEspero haber aclarado tu duda.","replies":[{"poster":"FilxuX","date":"2016-11-29T18:37:04.007+0000","up_votes":1,"down_votes":0,"body":"muchas gracias entonces esperare que este mes que viene quizas tenga mas suerte","replies":[]}]}]}