{"poster":"5a1a","date":"2017-09-11T14:37:46.096+0000","title":"no quiero que se siga subiendo a partir del nivel 30","subforum":"Jugabilidad, balance y narrativa","up_votes":1,"down_votes":11,"body":"una de las metas mas importantes para aquellos  que recientemente comencian a jugar este juego es llegar a nivel 30 junto con los deseos de jugar las ranked, con el ultimo video podimos ver como riot piensa implementar que a partir del nivel 30 se pueda seguir subiendo sola para dar una manera nueva de recompansar a aquellos q ya lleban barias temporadas dentro de runaterra, lo q no piense q este mal, ya que sino se perderia un poco el interes de los veteranos dentro del juego, pero creo q deberia ser de otra forma y  buscar otra manera de remplazar dichas recompensas... un ejemplo de su humilde servidor seria que implementen &quot;puntos cofres&quot; que al final de cada partida te bonifiquen con dichos puntos como actualmente se encuentran los &quot;PI&quot; o los &quot;PL&quot; solo queria dar mi punto de vista","replies":[{"poster":"Neo Gaussrik","date":"2017-09-11T16:36:54.611+0000","up_votes":3,"down_votes":0,"body":"Seguiras necesitando ser nivel 30 para jugar clasificatorias, asi que no veo que haga una gran diferencia.\n\nMe podrias explicar el valor del tope de nivel?\n\nSaludos!","replies":[]},{"poster":"WhiteMax","date":"2017-09-11T15:06:32.626+0000","up_votes":3,"down_votes":1,"body":"No entendi tu motivo por el cual no deba ser implementado, osea no va a afectar en nada a lo que ya hay en el juego este cambio, solamente recibiremos recompensas por subir de nivel, los de nivel 1 al 30 tambien recibiran recompensas, y el tema de las rankeds seguira como siempre, lv30 ya podes rankear.","replies":[{"poster":"And iam Iron Man","date":"2017-09-11T15:37:02.584+0000","up_votes":1,"down_votes":2,"body":"yo creo que el cambio es innecesario, primero que nada el lol perderia una caracteristica muy importante, qu es el tope de lv, otra es que los emparejamiento sera un infierno, imaginate ser lv 45 bIII, y enfrentarte en una ranked contra un bIII lv 150, creo que el punto es claro.\ny la verdad si el emparejamiento ahora no es perfecto y tiene sus errores, con est actualizacion, sera desastroso a mi parecer.","replies":[{"poster":"WhiteMax","date":"2017-09-11T15:40:21.696+0000","up_votes":3,"down_votes":0,"body":"El tope de nivel nunca significo algo en el Lol, solo el requisito para poder rankear.\n\nY tu argumento de \"ah porque es de mas nivel va a ser mejor\" es irrelevante yo puedo estar en Diamante con nivel 33 mientras hay gente nivel 72 en Bronce, es como los que piensan que por tener mas cantidad de partidas va a saber jugar mejor, algo absurdo.","replies":[]},{"poster":"Fenrito","date":"2017-09-11T17:53:29.218+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=shi no gekaii,realm=LAS,application-id=xQmJPO8F,discussion-id=81Hn6mxr,comment-id=00010000,timestamp=2017-09-11T15:37:02.584+0000)\n>\n> yo creo que el cambio es innecesario, primero que nada el lol perderia una caracteristica muy importante, qu es el tope de lv, otra es que los emparejamiento sera un infierno, imaginate ser lv 45 bIII, y enfrentarte en una ranked contra un bIII lv 150, creo que el punto es claro.\n> y la verdad si el emparejamiento ahora no es perfecto y tiene sus errores, con est actualizacion, sera desastroso a mi parecer.\n\nA simple vista un lvl 45 b3 es mejor que un lvl 150 b3 por el simple hecho de que en menos lvl esta en la misma liga.\n\nMuchos juegos tienen un sistema similar de lvl casi infinito + recompensa pot subir de nivel. Todo el cambio del sistema esta pensado para que la gente deje de grindear pi como loco para poder jugar rankeds para tener las runas y campeónes competitivos necesarios.","replies":[]}]}]},{"poster":"AJ             J","date":"2017-09-15T00:39:41.453+0000","up_votes":1,"down_votes":0,"body":"Cuando yo llegue al nivel maximo, honestamente me aburri un poco. Tener un objetivo me mantiene entretenido, me da una razon para jugar.\nEn terminos de vicioso, es como grindear en un MMO comparado con hacer una quest que te pida grindear de la misma forma. Le agrega significado a la actividad.\n\nDe hecho es algo que seguramente me haga jugar mas.\n\nHoy por hoy entro, intento sacar un cofre semanal y listo. Ni siquiera le doy importancia a la primera victoria del dia porque tengo todos los personajes que me gustan y solo uso el PI para cambiar mi nombre a modo de joda.","replies":[]},{"poster":"DarksWaves","date":"2017-09-11T15:03:46.883+0000","up_votes":3,"down_votes":4,"body":"Mira, riot hace estudios, que estudios no los sabe nadie, capaz que ni riot. Y esos estudios dieron que deben quitar el limite de nivel.\n\nSi el camino de nivel de 1 - 30 era para aprender y prepararse, este cambio da dos mensajes.\n\n- Nunca los jugadores estan ni minimamente preparados para rankear.\n\n- dado el nivel de lso jugadores da igual cuando empiecen a rankear ya que no se lo toman en serio.\n\nClaramente estos cambios estan dando que todos entren en rankeds con muchisima menos experiencia, ya que hasta el limite de campeones va a ser falso, porque podes ganar campeones mas rapido ya que no habra runas y el pi y la esencia seran lo mismo sumado a los cofres por nivel.\n\nY tu que te esforzaste durante años en mantener y aprovechar al maximo cada punto en tu cuenta y zas te borran todo de un dia para otro.","replies":[]}]}