{"poster":"Ragenas","date":"2015-11-24T19:26:39.291+0000","title":"El ABSURDO inicio de Illaoi","subforum":"Charlas Generales","up_votes":1,"down_votes":3,"body":"No he visto que nadie haya publicado algo acerca del tema, por lo cu&aacute;l voy a expresar MI OPINI&Oacute;N sobre la nueva campeona.\r\n\r\nDesde la antig&uuml;edad es sabido que los nuevos campeones tienen a estar un poco des balanceados, ya sea porque est&eacute;n por debajo como lo fue Nami o porque est&eacute; MUY rotos como es el caso de esta nueva cosa con tent&aacute;culos fantasma...\r\n\r\n\r\nSinceramente veo completamente absurdo que los tent&aacute;culos tengan un alcance aleatorio tan algo, pudieron pockear, rematar, zonear y detener recall sin hacer un m&iacute;nimo esfuerzo por parte del jugador, s&oacute;lo por pickear a ese campe&oacute;n.\r\n\r\nEl da&ntilde;o que tiene y la capacidad de fastidiar a los rivales me parecen rid&iacute;culas tanto en early como mid game, adem&aacute;s el BRUTAL y devastador da&ntilde;o que hace en las TF con su R. Por favor! si es un simple support! termina haciendo cc, da&ntilde;o, zoneo y es super tank (me recuerda al sapito glot&oacute;n) no sale rentable hacerle focus a Illaoi ya que los mid, adc y top/jungla quedan libres para hacer el da&ntilde;o que les plazca porque tampoco es que sea f&aacute;cil matar a la de los tent&aacute;culos -_- \r\n\r\nS&eacute; que en alg&uacute;n momento no muy lejano la van a nerfear y tal vez est&eacute; balanceada, por el momento S&Eacute; que va a ser tedioso y frustrante jugar hasta que llegue el pr&oacute;ximo parche (No signifique que deje de jugar) en mi OPINI&Oacute;N veo a esta campeona como FREE elo, y una victorias absolutamente f&aacute;ciles s&oacute;lo por el hecho de pickearla y en support realmente da unos resultados atroces y sencillos.\r\n\r\nS&oacute;lo quer&iacute;a expresarlo a ver si alguien m&aacute;s est&aacute; de acuerdo conmigo, por ahora resta esperar a ver si Riot logra llevar a esta campeona a un nivel balanceado (Bueno, a Riven tambi&eacute;n, pero ese es otro tema)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nES QUE M&Iacute;RENLE ESOS OJITOS  {{champion:420}} &lt;3 Viene desde el mismo infierno a buscar sangre.....","replies":[{"poster":"Whitesse","date":"2015-11-25T01:04:26.078+0000","up_votes":2,"down_votes":0,"body":"No leí tu post pero lo unico que voy a comentar es que me parece ridiculo que los tentaculos sigan apareciendo cerca del cadaver del champ, no podes pushear porque te moris.","replies":[]},{"poster":"Rock the Climber","date":"2015-11-24T19:49:12.232+0000","up_votes":2,"down_votes":0,"body":"yo ni se lo que hace y le gane igual XD","replies":[{"poster":"Mau Andrade13","date":"2015-11-25T01:01:24.716+0000","up_votes":1,"down_votes":0,"body":"yo igual xD","replies":[]}]},{"poster":"Yrox the Third","date":"2015-11-24T19:34:22.762+0000","up_votes":2,"down_votes":0,"body":"En si Illaoi es Top, y la idea es que su fase de linea es extremadamente buena, pero si no hace snowball de ahi no resalta tanto en late.\nEso si quizas algunos ajustes en los rangos de los tentaculos y quizas su daño y estaria perfecto.","replies":[]},{"poster":"Lince Salvaje","date":"2015-11-24T19:35:04.813+0000","up_votes":3,"down_votes":1,"body":"perimero no es un supp.. pertenece a la linea de top....\nque puedes usarlo de supp ? puedes, pero recuerda que tambien puedes ir supp teemo o supp garen...\nmatar a los tentaculos es facil ... son 2 basicos....\nhacele focus a un campeon es buena idea y hacerlo a este no es mala idea pero si te quejas de que dejas al adc y mid libres pues armate un  team com mas cc..\naun no la han puesto en el juego y ya estas llorando bieeeeeeen.\n(el parche dice que va a salir a lo largo de este mismo aun no corrobore si salio o no en el juego) pero dejen de llorar por un campeon antes de buscarle sus debilidades, paso lo mismo con tham con los kindred con bardo y etc... \nno lloren antes de tiempo","replies":[{"poster":"Ragenas","date":"2015-11-25T16:31:40.024+0000","up_votes":1,"down_votes":0,"body":"Ah la campeona ya salió, por algo estoy haciendo el post. y en 2 veces ya dije es MI OPINIÓN, si no le gusta ver a gente \"llorar\" por un champ que \"no ha salido\" pues no lo lea, gracias.","replies":[]}]},{"poster":"Bienzahar","date":"2015-11-24T19:34:16.101+0000","up_votes":2,"down_votes":1,"body":"Lo que me parece más absurdo es que en el PBE ya se veia que estaba desbalanceada y no hicieron nada antes de sacarla xD es cosa de buscar un gameplay en youtube y ya te das cuenta de la atrocidad pero realmente Riot no se dio el tiempo.\nIllaoi es free elo para los sin manos en este momento.","replies":[]},{"poster":"Trivío","date":"2015-12-06T20:01:55.376+0000","up_votes":1,"down_votes":0,"body":"La verdad yo coincido con ragenas esta campeona esta muy desbalanceada... causa mucha frustracion jugaar contra ella practicamente se adueña de la linea. creo que es muy nesesario  que la nerfeen. Espero riot tome en concideracion las quejas que se dan durante el transcurso de las partidas mucha gente cuestiona el daño de este champ","replies":[]},{"poster":"yOCobain","date":"2015-11-25T17:30:56.903+0000","up_votes":1,"down_votes":0,"body":"Yo hubiera puesto la canción de System of a Down \"I-E-A-I-A-I-O-\" que suena \"A-I-E-A-iE-A-iOi\" onda \"aaaieeeaaillaooiii\" (?) ok no.. defiinitivamente estoy hablando pelotudeces XD","replies":[]},{"poster":"Luni","date":"2015-11-25T16:56:21.040+0000","up_votes":1,"down_votes":0,"body":"Yo con la ulti de Lucian me la eh cargado varias veces, usas presteza, te mueves rápido y no podrá hacerte tanto daño, el problema es que te convierta en su envase, esa habilidad me parece un poco... sobre, pero en lo demás para mí está bien , debes moverte mucho y pokear, tratar de destruir sus tentaculos, tratar que salga de su posición de comodidad. Tan dificil es(?, es peor Teemo","replies":[]},{"poster":"Neroh","date":"2015-11-24T19:33:47.035+0000","up_votes":2,"down_votes":2,"body":"Como que estamos dando conclusiones antes de tiempo... La campeona ni siquiera ha salido aun XD","replies":[{"poster":"Bienzahar","date":"2015-11-24T19:32:33.160+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Neroh,realm=LAS,application-id=v7qsfXsE,discussion-id=zjUuJP5U,comment-id=0000,timestamp=2015-11-24T19:33:47.035+0000)\n>\n> Como que estamos dando conclusiones antes de tiempo... La campeona ni siquiera ha salido aun XD\n\nYa salio, viejo {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Neroh","date":"2015-11-24T19:46:20.259+0000","up_votes":1,"down_votes":0,"body":"Ya ok, perdón, no he jugado durante el día, así que no sabia. Pero aun así creo que es muy pronto para sacar conclusiones.","replies":[]}]},{"poster":"t0ma5","date":"2015-11-24T19:34:25.296+0000","up_votes":1,"down_votes":0,"body":"ya salio, esta en la tienda .-.","replies":[]}]}]}