{"poster":"TED11","date":"2019-03-23T09:40:31.361+0000","title":"Misconduct by Commentators (laughing at pro-gamers mistake)","subforum":"Esports","up_votes":1,"down_votes":2,"body":"On 23 march 2019, i was watching the live game of LCK JAG vs KT, when the game went to 28:22, Ornn used an ult but came out missed. One of the commentator said to the other one \"do you want to take over here? i am done\" and they started to laugh. \r\n\r\nAlso, throughout the game, I do not think they have ever taken the game seriously, maybe JAG and KT are at the bottom of table, I do not believe they will also laugh at GRF Sword if he made the same mis-play. \r\n\r\nIt is very serious that why are bias and missing leading words or action made by commentators, I do not think a professional commentator will do that. i am disappointed","replies":[{"poster":"ChompyWulf","date":"2019-04-01T05:35:03.806+0000","up_votes":1,"down_votes":0,"body":"I for one am glad Esports laughs at itself. Fans, commentators, and even players should be able to see goofs like that, laugh at the mistake, and move on with life. \nWhen traditional sports have notable errors happen and people DONT make a joke and instead try to make excuses, THAT is just as unprofessional because they are trying to cater to a fragile ego of the player who should have to admit they screwed up because that is part of improving yourself. \nShould LeBron James have not been mocked and laughed at when Kuzma had to PUSH HIM into position to play defense? No, he should have been laughed out of the building on the spot. \nIt's the jobs of coaches and councilors to build up a player after a mistake and a loss. It's a commentator's job to comment on what happened. If that involves laughing at a horrible mistake, that's fine.","replies":[]},{"poster":"GeminiRune","date":"2019-03-23T13:50:28.676+0000","up_votes":1,"down_votes":0,"body":"Banter like this happens a lot. It's not just because they're bottom of the barrel teams. In LCK especially though, it's been a long time case where casters criticize, joke, and even laugh from certain misplays.","replies":[]},{"poster":"Infernape","date":"2019-03-23T10:12:38.388+0000","up_votes":1,"down_votes":0,"body":"Pretty much most shoutcasters will make a joke out of a missed ability. Especially if it's a key ability  like Ornn or Orianna's ult.","replies":[{"poster":"Iota Theta","date":"2019-03-23T10:49:46.324+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Infernape,realm=EUW,application-id=9hBQwnEU,discussion-id=ZI57kU1l,comment-id=0001,timestamp=2019-03-23T10:12:38.388+0000)\n>\n> Pretty much most shoutcasters will make a joke out of a missed ability. Especially if it's a key ability  like Ornn or Orianna's ult.\n\nPretty much. I think I’ve heard some similar stuff in other competition as well. They sometimes just have to talk about something. But there’s a fine line there. They aren’t doing it to completely insult the player. It’s just one of those moments where you know what should happen and the exact opposite happens and..sometimes joking or laughing is the initial reaction. It’s like the NA Flash meme.\n\nI recall a TSM match where Broken Blade on Aatrox picked you two Ghostblades, and man the casters had a good time with that, especially when a few matches later an ADC picked up a double Statikk Shiv.","replies":[]}]},{"poster":"KFCeytron","date":"2019-03-23T10:07:46.062+0000","up_votes":1,"down_votes":0,"body":"How about a commentator calling a player an idiot?\n\nhttps://www.reddit.com/r/leagueoflegends/comments/8b93cw/olaf_outplays_himself_in_eu_masters/\n\nI think some gentle ribbing at really silly pro mistakes is okay.","replies":[]}]}