{"poster":"TheNagatoPain","date":"2017-02-08T20:05:50.674+0000","title":"Yas still broken Fix that WINDWALL","subforum":"Gameplay","up_votes":2,"down_votes":5,"body":"So even with the minor debuff that yas received last patch. The champ is still retardly unbalanced. All he has to do to any marksman or mid lanner after the 20 min mark is q and r and they die instantly. Perhaps his wind wall should only be able to block auto attacks only. IE... Like if teemo uses his blinding dart, it will still hit normally but his auto attacks would not continue to go through the windwall.","replies":[{"poster":"TheNagatoPain","date":"2017-02-08T20:09:28.801+0000","up_votes":1,"down_votes":0,"body":"yet again though it should only block auto attacks not skill attacks. The windwall thing is just to unbalanced with blocking every ability besides a champs ult.","replies":[{"poster":"GULAG 4 U","date":"2017-02-08T20:52:08.270+0000","up_votes":1,"down_votes":0,"body":"If you act like you're snared and refuse to walk and reposition, yes. Otherwise no.","replies":[]}]},{"poster":"GULAG 4 U","date":"2017-02-08T20:51:44.082+0000","up_votes":1,"down_votes":0,"body":"\"minor\" debuff? Lmao what the fk r you saying? -50 base damage is a 'minor' debuff?","replies":[]},{"poster":"InfernoFøx","date":"2017-02-08T20:43:29.735+0000","up_votes":1,"down_votes":0,"body":"Easy to bate out, long CD only 3.75 seconds. You can wait that long cant you? He snowballs hard if fed, but if hes not they you rage at him for being worthless and a shitty person for playing him. Hes a hyper carry for a reason.","replies":[]},{"poster":"xdeviltwinkiex","date":"2017-02-08T20:26:37.730+0000","up_votes":1,"down_votes":0,"body":"I think wind wall should mess up the path of a skill shot and block autos just always thought that it would be interesting.","replies":[]},{"poster":"Azure Hamster","date":"2017-02-08T20:06:41.352+0000","up_votes":1,"down_votes":0,"body":"It's annoying, but the CD on the wall is pretty long. Just wait till he pops it then unload.\n\n{{champion:51}}","replies":[]}]}