{"poster":"Solo Levelingg","date":"2019-11-10T07:30:10.404+0000","title":"SE TE QUEDA CONGELADA LA PANTALLA EN MEDIO DE UNA PARTIDA? Y NO VUELVE A ANDAR?","subforum":"Problemas Técnicos","up_votes":3,"down_votes":0,"body":"me a pasado 5 veces desde el parche, se me queda congelada la pantlla mientras juego,  y no me deja mover el mouse, ni salrime, ni nada, eh tenido que apagar la pc y volverla a prender,  y me preocupa que me terminen baneando porque esto bugg hace que cuente como que me sali de la partida.","replies":[{"poster":"Ignarian","date":"2019-11-10T15:40:32.458+0000","up_votes":1,"down_votes":0,"body":"No sos el único caso, en todos los servers pasa lo mismo, aún no encuentran la solución, infumable tener que reiniciar para recuperar tu PC","replies":[{"poster":"Solo Levelingg","date":"2019-11-13T19:11:09.785+0000","up_votes":2,"down_votes":0,"body":"es una desgracia. xd  yo pregunte en redes varias veces, y si vi que amuchos les pasa.","replies":[]}]},{"poster":"lordeman10","date":"2019-11-10T07:48:29.255+0000","up_votes":1,"down_votes":0,"body":"si, vi varios post de esto, supongo que no lo publican porque implicaría aceptar que hay un bug, y por lo tanto tener que cerrar las colas clasificatorias indefinidamente, hasta encontrar la solución estando a 1 semana de que termine la temporada","replies":[{"poster":"Solo Levelingg","date":"2019-11-13T19:09:34.070+0000","up_votes":1,"down_votes":0,"body":"que desgracia no? yo reporto enseguida el bugg cuando me pasa, y me a pasado 5 veces ya, una recién, y por suerte aun no me sancionan ni nada, xd","replies":[{"poster":"lordeman10","date":"2019-11-13T19:16:42.981+0000","up_votes":1,"down_votes":0,"body":"sisi yo estoy en la misma como 50% de que se me trabe en  ese caso apreto alt + ctr + suprimir y cierro la sesión para que se cierre el lol\n\nacá hay info\n\n> [{quoted}](name=WitchAgmar,realm=LAS,application-id=X54mVVp0,discussion-id=AvqttLKe,comment-id=,timestamp=2019-11-09T13:54:33.134+0000)\n>\n> Hola chicos y chicas.\n> \n> Ojalá les esté yendo bien el día.\n> \n> Somos conscientes de que bastantes jugadores están sufriendo alguno de los 3 problemas comentados en el título, esto se debe a que tienen un procesador **Dual Core (2 CPU's)**, normalmente suele ser también porque los componentes no cumplen con los requisitos mínimos (os dejo este [enlace de los requisitos mínimos ](https://support.riotgames.com/hc/es-419/articles/201752654-Requisitos-de-sistema-m%C3%ADnimos-y-recomendados)  ya que pide un procesador de 3 GHz.)\n> \n> No obstante os puedo dejar unas guías para ver si tras esto notan algo de mejora y puedan  jugar como corresponda:\n> \n> **1º Guía**.\n> \n> - Abre el cliente y haz click en el engranaje (o ruedita) arriba de tu nombre de Invocador.\n> \n> - En la primera opción **General** selecciona las opciones de \"Activar modo de bajo rendimiento\" y \"Cerrar cliente durante la partida\".\n> \n> - Y das a **Listo**.\n> \n> **2º Guía**.\n> \n> - Entra en una partida personalizada.\n> \n> - Ve a **opciones** y en el apartado de \"Vídeo\" selecciona **Modo daltónico** y en Modo ventana pon **Sin bordes**.\n> \n> - Aplicas los cambios y mira si ves mejoría.\n> \n> **3º Guía**:\n> \n> - Entra en este [enlace](https://support.riotgames.com/hc/es-419/articles/201752654-Requisitos-de-sistema-m%C3%ADnimos-y-recomendados).\n> \n> - Haz el paso llamado **Ajustes de MinConfig**.\n> \n> \n> **F.A.Q:**\n> \n> **¿Qué pasa si esto no me da ningún cambio favorecedor?:**\n> \n> Las guías dadas previamente no garantiza la solventación del problema en el 100% de los casos, algunos jugadores les funcionó y a otros no.\n> \n> **¿Por qué el modo daltónico ayudaría a mejorar esta situación?**\n> \n> Al poner este modo, ciertas partículas que consumen mucha gráfica pueden no aparecer por lo tanto mejoraría el rendimiento del pc en el LoL.\n> \n> **¿Esto será para siempre? **\n> \n> No tenemos información si será para siempre (debido a los requisitos mínimos) o es más bien un error que siguen investigando.\n> \n> \n> Agradezco la comprensión frente a este percance. Cuidaros mucho {{champion:51}}  ♥.\n> \n> **Update 9.11.2019**: Se me olvidaba mencionar esta otra guía.\n> \n> - Entra en este ![enlace](https://support.microsoft.com/es-es/help/929135/how-to-perform-a-clean-boot-in-windows).\n> \n> - **Asegúrate de marcar la casilla \"\"ocultar servicios de Microsoft\"\" antes de deshabilitar el resto**.\n> \n> - Cuando inicies tu computadora, no ejecutes ningún programa adicional, únicamente League.","replies":[]}]}]},{"poster":"Bestmatambrearg","date":"2019-11-10T08:36:56.699+0000","up_votes":1,"down_votes":0,"body":"Te van a banear, me acabo de comer una cola de baja prioridad, ademas de perder una ranked por esta mierda. Te recomiendo que no juegues mas, buscate otro juego viejo es la unica que queda. \nYo ya estoy re podrido, este año, fue el peor año del servidor y el juego en sí. Primero el parche de mierda con el nuevo cliente (que fue al pedo porque es igual solo que con una pantalla de carga mas), luego los ms que vinieron con el nuevo cliente, despues los bajones de fps y ahora esta mierda de que se congela todo y hasta te meten baneo. Y lo mas lindo es que queres mandar ticket y te dicen que el programa de leaver buster esta diseñado para banear a todos. Osea, les chupa un huevo y la mitad del otro si te comes un baneo y perdes la promo por culpa de su servidor de mierda. \nComo ya estoy re podrido de este juego de mierda, voy a agarrar mi cuenta pedorra y voy a grabar todas las partidas hasta que se congelen para poder subirlas a youtube y los foros y vean que tan mierda de personas son las de este juego de mierda. Invito a todos a hacer lo mismo para que o cierren el servidor o lo arreglen de una vez.","replies":[]}]}