{"poster":"Frankensteinke","date":"2016-04-20T01:35:54.924+0000","title":"Xerath New Ulti","subforum":"Gameplay","embed":{"description":"Mages are one of League's most established classes but, over the years, their strategic identities have become muddied and their gameplay hasn't kept up with evolving standards. Much like our work on the juggernauts and marksmen, we saw the opportunity to update a 'roster' of champions to ensure the class as a whole is relevant and satisfying to play.","url":"http://na.leagueoflegends.com/en/featured/mid-season-magic","image":"https://lolstatic-a.akamaihd.net/frontpage/apps/prod/mid-season-magic/en_US/5097c3f753ea65f6e1b2283c699b78d0693ae5ba/assets/img/bg-hero.jpg"},"up_votes":6,"down_votes":2,"body":"I like the new ulti but I think they should also make it zoom out kinda like jhins curtain call. It makes you feel power which fits the character and it also helps gameplay wise cause i play half lock screen half free move but i hate free moving with his xeraths R.","replies":[{"poster":"Riot Sotere","date":"2016-04-20T18:15:01.318+0000","up_votes":10,"down_votes":0,"body":"It should be zooming out now on PBE. We did it to a less drastic measure than Jhin's Curtain Call.  In Xerath's case, zooming out makes aiming a bit trickier.  But the hope is it feels awesome and transformative and we can make up the power elsewhere.","replies":[{"poster":"Stars Shaper","date":"2016-04-20T18:20:16.534+0000","up_votes":2,"down_votes":0,"body":"No change in the visual department I guess, am I wrong?","replies":[{"poster":"Predatorator","date":"2016-04-20T18:39:58.050+0000","up_votes":3,"down_votes":0,"body":"apparently not. but i still hope something will be done, they still got time =)","replies":[{"poster":"Riot Sotere","date":"2016-04-20T23:20:36.393+0000","up_votes":3,"down_votes":0,"body":"We're mainly just scaling up some of the particles to read better while zoomed out. Wouldn't expect too much but the changes should be there tomorrow.","replies":[{"poster":"Predatorator","date":"2016-04-21T09:11:05.023+0000","up_votes":1,"down_votes":0,"body":"I can't hide that makes me a bit sad, beacuse the mage pass is a great time to rework those particles to fit more with xerath's theme. On the other hand, i appreciate the honesty. \n\nCan i ask You if it's possible to make the explosion particles bigger (around his W size maybe?)? That would make a good compromise between your main plan, and what us xerath mains were actually hoping for =) beacuse it would be all about increasing the size of existing particles, without adding any new element. \n\nThank You again for answering =)","replies":[{"poster":"Riot Sotere","date":"2016-04-21T21:39:38.932+0000","up_votes":3,"down_votes":0,"body":"We definitely moved in that direction. When you have a chance to look at them let me know what you think?","replies":[{"poster":"Messaiga","date":"2016-04-22T05:20:05.069+0000","up_votes":2,"down_votes":0,"body":"After playing around on PBE, I really like the new look on his R; I noticed his E looks a bit different too.  The people who worked on that did a pretty good job.  My only complaint is that his R appears to have a larger delay in between each shot, really screws up muscle memory.","replies":[{"poster":"Riot Sotere","date":"2016-04-22T17:49:19.301+0000","up_votes":4,"down_votes":0,"body":"I'll pass on the word. We managed to borrow one of our senior, super epic, VFX artists for a short time.","replies":[{"poster":"Stars Shaper","date":"2016-04-23T17:03:51.192+0000","up_votes":1,"down_votes":0,"body":"I'm still of the idea that it would look better if he rised a \"pillar\" of arcane energy from his location and the sots would rain for it's summit.\n\nFeels too heavy in terms of visuals but maybe you can work around that.","replies":[]}]},{"poster":"Predatorator","date":"2016-04-22T09:00:16.861+0000","up_votes":1,"down_votes":0,"body":"I'm going to check into some videos on youtube, since i lack a pbe account =p in the while, are You able to make a video of that please =)?","replies":[{"poster":"Messaiga","date":"2016-04-23T06:01:26.351+0000","up_votes":3,"down_votes":0,"body":"I didn't make this, but we can thank moobeat.\n\nhttps://www.youtube.com/watch?v=LzJ_ZDGPkfc&feature=youtu.be","replies":[{"poster":"Predatorator","date":"2016-04-23T09:38:15.378+0000","up_votes":1,"down_votes":0,"body":"i already saw that, but i didn't notice anything apart the zoom out and the more barrages per rank. is this what you got in the pbe? \nThank You by the way =)","replies":[{"poster":"Messaiga","date":"2016-04-23T15:20:38.451+0000","up_votes":2,"down_votes":0,"body":"Look at the particles on R.  They aren't extremely different from current, but they're still a vast improvement. \n\nHis current particles for reference.\nhttps://youtu.be/1wK4YtibD0c?t=32","replies":[{"poster":"Predatorator","date":"2016-04-23T16:41:12.853+0000","up_votes":1,"down_votes":0,"body":"ok i literally put one video next ot the other, but it was worth, there's indeed the difference! sorry for taking that long =p","replies":[{"poster":"Messaiga","date":"2016-04-23T22:54:19.428+0000","up_votes":2,"down_votes":0,"body":"Not at all a problem.  I'm as hype as you are, my next hope is that the mage update turns out well once it hits live servers.","replies":[]}]}]}]}]},{"poster":"Predatorator","date":"2016-04-22T09:05:27.087+0000","up_votes":1,"down_votes":1,"body":"also s@20 and RoG lack of comparisons","replies":[]}]}]}]},{"poster":"Karma Deified","date":"2016-04-21T17:14:20.148+0000","up_votes":1,"down_votes":0,"body":"It's been ages since they promised to make the particles better.","replies":[]}]},{"poster":"Ultîma","date":"2016-04-21T23:05:01.860+0000","up_votes":1,"down_votes":0,"body":"Can there also be some kind of bass boost or change to the impact of the skill? Right now it really doesn't sound like a powerful ability, let alone an ultimate. A mage with the power to craterize Runaterra should have a more visceral sound associated with his ult.","replies":[]},{"poster":"Pierce The Veal","date":"2016-04-21T09:16:38.889+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Sotere,realm=NA,application-id=3ErqAdtq,discussion-id=gBYvFnJU,comment-id=0001000000000000,timestamp=2016-04-20T23:20:36.393+0000)\n>\n> We&#x27;re mainly just scaling up some of the particles to read better while zoomed out. Wouldn&#x27;t expect too much but the changes should be there tomorrow.\n\nCould we have a similar screen effect when Xerath's ult collides as that of Garen's ult? I feel like it would make what looks like raindrops feel *much* more terrifying.\n\n\"Oh it's just some rai— holy sh—\"\nEnd transmission.","replies":[]},{"poster":"Solidair3","date":"2016-04-20T23:34:05.926+0000","up_votes":1,"down_votes":0,"body":"I recall seeing Kennen on the lower tier change list, is he getting anything? Or did he and I missed it? I saw Viktor's stuff went up today, but I have yet to see anything on kennen.","replies":[{"poster":"Jungle Lux God","date":"2016-04-20T23:52:23.651+0000","up_votes":1,"down_votes":0,"body":"He got some lower energy costs, and his ultimate now hits AoE instead of hitting random targets, on the PBE.","replies":[]}]}]}]}]},{"poster":"Karma Deified","date":"2016-04-21T17:13:06.916+0000","up_votes":2,"down_votes":0,"body":"It's been 2-3 years? And the ult particles still look pathetic compared to his W and Old ult despite the **promise** of having it look powerful again after the initial reactions.\n\nIt's not just a matter of laughing everytime he ults you. It's immersion breaking when playing this powerful being to just start flinging droplets onto people, when he was calling down torrents of power from the sky to start the battle.","replies":[]},{"poster":"AMYS GRAVE","date":"2016-04-20T18:35:48.690+0000","up_votes":1,"down_votes":0,"body":"awesome","replies":[]},{"poster":"lightdragoon88","date":"2016-04-20T19:11:08.876+0000","up_votes":1,"down_votes":1,"body":"Can you also make it where shots he doesn't fire reduces the cooldown a bit? Getting the kill with 1 shot and having the full cooldown while Jhin can kill with 1 shot and have a 30% reduce cooldown feels unfair. \n\nIt doesn't have to be a % cooldown either, maybe a flat 5 second cooldown per shot un-fire?","replies":[]}]},{"poster":"IxtaliKing","date":"2016-04-20T19:07:11.375+0000","up_votes":3,"down_votes":6,"body":"Omg they actually used my suggestion xD http://boards.na.leagueoflegends.com/en/c/gameplay-balance/wu5LK1IO-can-we-make-xeraths-ult-zoom-out-like-jhins\n\nAnd to think people (Inc GypsyLord) were saying it wouldn't work lol\n\nEdit: Haters gonna hate xD","replies":[{"poster":"Pls Be Gentle","date":"2016-04-20T21:02:09.709+0000","up_votes":4,"down_votes":2,"body":"it's not 'your' suggestion, everyone thought about this when Jhin was revealed, and everyone spammed stuff about making Xerath similar","replies":[{"poster":"IxtaliKing","date":"2016-04-20T21:14:39.383+0000","up_votes":2,"down_votes":4,"body":"Lol I was waiting for someone to say this. But anyway my thread was the 1st at the time and got a red response, however I do believe this change would have happened anyway.","replies":[{"poster":"Riot Sotere","date":"2016-04-20T23:36:35.993+0000","up_votes":4,"down_votes":0,"body":"It was a good suggestion!  I think the main gain here is it feels transformative and more epic for his ultimate.  GypsyLord's points were pretty accurate. We can't scale the full distance of Xerath ulti without some bad things happening (though we definitely tested it). The tech has also gotten better since then.  \n\nAt the end of the day, it's also less useful for Xerath than Jhin to zoom out.  Trying to pinpoint targets is distinct from landing line missiles.    All that said, I'm pretty excited for more people to try it out and share what they think.","replies":[{"poster":"Stars Shaper","date":"2016-04-21T17:06:38.378+0000","up_votes":2,"down_votes":0,"body":"Since you are the one exposing yourself on Xerath...\n\nIs his mana passive staying? While the risks he takes are high in order to take full benefit from it I wonder if it's not in contrast with the mana changes for mages (AP carries) vs supports.","replies":[{"poster":"Riot Sotere","date":"2016-04-21T21:43:38.241+0000","up_votes":2,"down_votes":0,"body":"It is.  We get significant value in having mages interact with their AA, and his passive does a decent job in doing that.","replies":[{"poster":"Helmight","date":"2016-04-21T22:42:00.702+0000","up_votes":6,"down_votes":0,"body":"Speaking of Xerath's passive, is there any chance that it could restore a % of his mana instead of a flat amount for the mage update? Since mages are being incentivized to build flat mana now instead of regen, getting a small pittance of mana back per AA feels pretty bad - especially since Xerath has trouble autoattacking anything during teamfights or sieges.","replies":[]},{"poster":"Stars Shaper","date":"2016-04-21T21:53:30.883+0000","up_votes":1,"down_votes":0,"body":"Good to know. Do you have any intentions on giving him more power at higher range rather than close range except for the E stun duration (in order to emphasize his artillery/siege gameplay)?\n\nAlso, wouldn't Xerath be a good candidate for a \"Grounding\" mechanic? My first thought is on the W bullseye but even on landing the ultimate shots could be interesting.\n\nSorry for the avalnce of questions but he is a character I hold really dear :3","replies":[{"poster":"Riot Sotere","date":"2016-04-25T18:58:52.542+0000","up_votes":3,"down_votes":0,"body":"Not for now. His ultimate will be getting a bit of extra range, but he won't, for instance, be doing more damage with the barrages the further away people are.\n\nThematically I think Xerath fits for grounding. I don't think he has a particular need for it at present.","replies":[{"poster":"Predatorator","date":"2016-04-27T17:36:40.907+0000","up_votes":1,"down_votes":0,"body":"Thanks for taking Your time for us =). Should we expect other changes to xerath for 6.9?","replies":[{"poster":"Riot Sotere","date":"2016-04-27T17:53:04.254+0000","up_votes":3,"down_votes":0,"body":"Everything should be on PBE but some of the lesser noticed things will be reflected in patch notes.","replies":[{"poster":"Predatorator","date":"2016-04-27T18:11:50.608+0000","up_votes":1,"down_votes":0,"body":"Thank You, looking forward to see those =)","replies":[]},{"poster":"AbusiveEmu","date":"2016-04-27T18:09:04.996+0000","up_votes":1,"down_votes":0,"body":"A huge fan of this champ here, played him many many times in the past. I was curious if the idea of making his ult non-interruptible? I personally don't think this would be too big a boost in power as there is still nothing you can do to stop the enemy team from walking next to you and wait for you to finish lol.  \n\nIt's just that thematically having a mage with his background of wanting absolute power and all that and having him unleashing his strongest ability to be shut down in so many ways just seems... wrong... I see a few champions getting a similar change with the QSS changes and thought I would throw this idea out there.","replies":[]}]}]}]}]},{"poster":"Cherysse","date":"2016-04-22T04:06:51.785+0000","up_votes":1,"down_votes":0,"body":"Either make it scale with AP too pls, it would be good for it to get new particles (according to each skin) and to deal some valueable but low damage (it could be nive to see a {{item:3100}} xer)","replies":[]}]}]},{"poster":"Skelenth","date":"2016-04-21T00:45:10.148+0000","up_votes":2,"down_votes":0,"body":"Now that Xerath got a small zoom-out, can the same be done for Vel'Koz ultimate?\nThe thing is: his ultimate is just a teeny tiny bit bigger than display size, and if anyone plays in locked camera view, they can only guess if they hit.","replies":[{"poster":"HighH1","date":"2016-04-21T02:15:54.767+0000","up_votes":1,"down_votes":5,"body":"While we're at it let's add a zoom to everything else with long range.Oh oh and when anyone has an ability up it's shone over their heard.AND LET'S HAVE EVERY JUNGLE CAMP BE VISIBLE TO BOTH TEAMS.Can't make this game too easy dude just unlock your god damn camera.","replies":[]}]},{"poster":"IxtaliKing","date":"2016-04-21T00:52:57.697+0000","up_votes":1,"down_votes":0,"body":":)","replies":[]}]}]}]},{"poster":"Gunpoint","date":"2016-04-23T06:07:40.254+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KingKold93,realm=EUW,application-id=3ErqAdtq,discussion-id=gBYvFnJU,comment-id=0002,timestamp=2016-04-20T19:07:11.375+0000)\n>\n> Omg they actually used my suggestion xD http://boards.na.leagueoflegends.com/en/c/gameplay-balance/wu5LK1IO-can-we-make-xeraths-ult-zoom-out-like-jhins\n> \n> And to think people (Inc GypsyLord) were saying it wouldn&#x27;t work lol\n> \n> Edit: Haters gonna hate xD\n\nMe, \"Nerf Tahm Kench Q missle width as it is too hard to dodge\" Other Forum Members, \"THAT WILL NEVER WORK HE'S BEEN NERF ENOUGH\"\nNext Patch, Sure enough \"Tahm Kench Missle Width on Q reduced\" And now he's fine.","replies":[]}]},{"poster":"Fawstus","date":"2016-04-26T18:47:34.564+0000","up_votes":1,"down_votes":0,"body":"Guys, I don't think simply giving more shots or range for his ult actually works there. The ult itself does not capture the essence of Xerath's lore. Pressing that R and firing 3 or 5 arcane shots does not make him look like a being of pure power trying to release himself.\n\nI guess changing how Xerath's ult turns him into an arcane piece of artillery can fill that gap in the lore. Making his ult having charges (like Akali) to demonstrate the buildup of latent energy (even with more particles and lighting on the model to show everyone when he is able to go nova) and allowing the champion to fire those shots independently would do wonders. With this a Xerath's player could choose between using his shots for some extra poke (making it different from the new Ziggs, I will talk about it in the end) or committing all shots to try and take out a single target.\n\nI've written on it here if you want to look at it: http://boards.na.leagueoflegends.com/en/c/gameplay-balance/epEwmj0v-is-this-xerath-change-accurate?show=flat&comment=0004\n\nIMO, while Ziggs is less poke oriented and more of a wave clear until reaching the tower to bring it down fast, Xerath is more a poke and siege champion. He is there to punish enemies for standing under a turret for too long. While Ziggs can both use his ult as a huge waveclear and to finish fleeing enemies (or even start TFs), Xerath's ult only allows him to hunt fleeing enemies. It does not help him at all with poking or siege.","replies":[]},{"poster":"tYctz6q3er","date":"2016-04-21T00:37:10.182+0000","up_votes":1,"down_votes":0,"body":"What if upon cast an effect similar to one scan from sweeping lens on the ult's range would occur. That could be a potential buff if he needed one in the future.","replies":[]},{"poster":"No Leg Room","date":"2016-04-20T03:39:54.858+0000","up_votes":1,"down_votes":0,"body":"I heard they did it though, people are talking about it.","replies":[]}]}