{"poster":"Drnono52","date":"2018-12-26T02:02:46.346+0000","title":"Neue regel fürs bann system","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":12,"body":"Vorschlag f&uuml;r die Regel Ver&auml;nderung Leute die einen perma ban bekommen, sollten aber wen diese Leute Einsicht zeigen und sich auch entschuldigen oder es halt wie in meinem Fall es zum Teil anders meinten also nur gut sollten eine Bew&auml;hrungsstrafe kriegen die 1-2 Jahre geht wo halt bei der kleinsten Sache der acc Komplet gel&ouml;scht wird oder das man den ban auf 1-2 Jahre reduziert","replies":[{"poster":"KorSett","date":"2018-12-26T02:49:01.804+0000","up_votes":6,"down_votes":0,"body":"Und danach kommt jemand auf die Idee noch eine Super-letzte-Chance einzuführen und danach kommt die aller-aller-letze-Ultra-Verwarnung bis zum endgültigen Bann. \nIch denke das Bestrafungssystem ist an sich schon locker genug. Wenn du es damit schaffst gebannt zu werden hast du es eigentlich immer verdient, habe noch keinen gesehen der ungerecht Bestraft wurde.\nUnd ob man es gut meinte oder böse meinte ist immer Auslegungssache, dadurch das man so eine Subjektive Entscheidungsmaßnahme macht, wird jeder behaupten das er es doch gut meinte wie er jemandes Mutter als Edel-nutte bezeichnet. Ich denke man versteht was ich meine, wenn deine Aussage aus dem Kontext gerissen wurde kannst du das in deiner Bann-nachricht lesen und beim Support reklamieren. Letztendlich wenn der Support dann der überzeugung ist das der Kontext trotzdem gegen die Regeln verstößt wird er dich an das Forum weiterleiten, wo dir mMn genügend Leute sagen werden das dein Verhalten Respektlos oder Falsch war und vielleicht warum.\n\nLG","replies":[]},{"poster":"Alpacana","date":"2018-12-26T02:18:00.779+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Drnono52,realm=EUW,application-id=KYnfKGf0,discussion-id=ycEQ8h1A,comment-id=,timestamp=2018-12-26T02:02:46.346+0000)\n>\n>sollten eine Bewährungsstrafe kriegen die 1-2 Jahre geht wo halt bei der kleinsten Sache der acc Komplet gelöscht wird \n\nGenau das ist doch bereits der Fall. Einen sofortigen Perma-Ban bekommst du nur in den seltensten Fällen. Nach dem 2 Week-Ban bist du auf Bewährung, jeder kleinste Fehler kann zum Perma führen.\nGenug Chancen Einsicht zu zeigen gibt es auch (im Normalfall nämlich 3 Stück. 10 CS, 25 CS, 2 Week Ban). Wer dann immer noch nicht einsieht, dass er irgendwas falsch macht, verdient es auch nicht anders. Deshalb lohnt sich auch kein 1/2 Jahres-Ban (und mal so nebenbei..in den 2 Jahren wird man sowieso einen neuen Account besitzen).","replies":[]},{"poster":"Darkr3sQ","date":"2018-12-26T13:40:31.006+0000","up_votes":3,"down_votes":0,"body":"Dann lass Dir zu Deine Idee mal etwas sagen:\nVor längerer Zeit - und aktuell läuft ein neues Esperiment dazu - konnte Spieler, die dem Support **glaubhaft** versichern konnten sich gebessert zu haben, ihren permanent gebannten Account wiederbekommen. Alles, was sie dazu tun mussten war einen neuen Account auf Level 20 zu spielen ohne eine Strafe von damaligen Tribunal - was länger gedauert hat um eine Strafe auszusprechen - zu bekommen.\nLong Story Short: um die 95 % hatten vor Level 20 wieder eine Strafe und demzufolge ihren Account nicht wiederbekommen. Von den verbleibenden 5 % hat ein Großteil auf den Wiederbekommenen Account wieder einen permabann erhalten.\nWie gesagt: Damals war die Bedingung, dass man dem Support glaubhaft versichern konnte, sich gebessert zu haben. Also nicht nur ein einfaches \"Entschuldigung\" oder \"war nicht so gemeint\" sondern wirklich glaubhaft. Und selbst da hat es ein Großteil nicht geschafft. Ich bin ja gespannt, was das aktuell laufende Experiment an Daten abwirft.","replies":[{"poster":"FuriousRedPanda","date":"2018-12-26T14:59:38.355+0000","up_votes":2,"down_votes":0,"body":"War das nicht Level 30? Ist ja auch egal.\n\nIch glaube nicht, dass die Ergebnisse sonderlich anders aussehen werden als beim alten Experiment. Ich würde ganz gerne daran Teil nehmen. Mein Perma ist allerdings schon 2-3 Jahre her, wäre also auch nicht schlimm wenn der gesperrt bleibt.","replies":[]}]},{"poster":"Veezey","date":"2018-12-26T13:01:40.961+0000","up_votes":2,"down_votes":0,"body":"Okay also kann ich dann hunderte Leute beleidigen und dann einfach sagen \"es war doch nicht so gemeint\". Zack hab ich meinen Account wieder.","replies":[]},{"poster":"Asulia","date":"2018-12-26T11:12:22.415+0000","up_votes":1,"down_votes":0,"body":"Lass mich raten x) \nDie eine Stimme für >Ja<  kommt von Dir, oder?","replies":[]},{"poster":"eingew","date":"2018-12-26T09:00:36.955+0000","up_votes":1,"down_votes":0,"body":"Nichts für ungut, bloß als Tipp für nächstes Mal: Punkte und Kommas machen Texte *deutlich* besser lesbar. Vielleicht liegt es nur daran, dass es für mich noch früh ist, aber ich musste gerade die Posts der anderen beiden lesen um zu wissen, was du eigentlich von mir willst.","replies":[{"poster":"Bettnachleger","date":"2018-12-26T09:16:33.445+0000","up_votes":1,"down_votes":0,"body":"Er benutzt doch Kommas.\nZumindest eines, und das ganz falsch ... aber es ist da! Und hat mich auch stark irritiert beim lesen lol","replies":[]}]}]}