{"poster":"iamthegoatofwar","date":"2016-05-25T05:11:16.317+0000","title":"kennen ult not visable?","subforum":"Report a Bug","up_votes":3,"down_votes":0,"body":"Just got done playing a match where we couldn&#039;t see his ult on aram. My ally ryze said he could not see it either. The enemies however seemed to be able to see it from what I was told by them. He was using the &quot;karate kennen&quot; skin or something to that effect. Anyone else see this either?","replies":[{"poster":"moonstones","date":"2016-05-26T17:21:19.491+0000","up_votes":3,"down_votes":2,"body":"Hey iamthegoatofwar! \n\nThanks for the report! We're aware of the issue affecting skins and base. We're currently running compat tests to see if this is only happenng v. certain configurations, specifically graphics cards. This isn't a 100% repro rate issue, so it's been a bit hard to track down. :c","replies":[{"poster":"iamthegoatofwar","date":"2016-05-26T18:14:11.752+0000","up_votes":1,"down_votes":0,"body":"Yha it didn't seem to have any other requirements besides that skin. (Perhaps I missed something along the way that affected it). \nI payed VERY close attention to him that match having vision on him during the cast did not seem to matter as he did it from bushes with no vision and in sight.\nRange also did not seem to be a factor either. That's all I really got to report on him from there. Another reason I believe this skin is the issue is cause I've seen normal kennen's ult just fine.","replies":[{"poster":"moonstones","date":"2016-05-26T18:53:54.147+0000","up_votes":3,"down_votes":2,"body":"Thanks for the additional context. :)\n\nWe've seen reports of it occurring on both skins and the base, so we're running compat on everything to make sure we cover all bases.","replies":[{"poster":"iamthegoatofwar","date":"2016-05-27T02:52:19.866+0000","up_votes":1,"down_votes":0,"body":"so katey any update on the bug yet? Also you can just call me war or goat or something like that.","replies":[{"poster":"moonstones","date":"2016-05-31T20:04:03.452+0000","up_votes":1,"down_votes":0,"body":"Nothing at the moment - compat tests are in the process of being conducted. (When I wrote the original post, I had just sent out the request).","replies":[{"poster":"iamthegoatofwar","date":"2016-05-31T20:07:50.581+0000","up_votes":1,"down_votes":0,"body":"ok um i just made another post if you don't mind looking into it. also thanks for the update.","replies":[{"poster":"moonstones","date":"2016-05-31T20:37:05.709+0000","up_votes":1,"down_votes":0,"body":"I saw your other post, but unfortunately, it's not something I can tackle. I can pass it on, but I'm not sure we'd be able to figure it out with the description you've given.","replies":[{"poster":"iamthegoatofwar","date":"2016-05-31T20:51:01.677+0000","up_votes":1,"down_votes":0,"body":"I'm aware it's fairly vague, but to be fair so is the info I have on it...I just don't want a repeat of what happened with the servers a year or 2 back.","replies":[]}]}]}]}]}]}]}]},{"poster":"admiral anime","date":"2016-05-26T19:55:13.642+0000","up_votes":1,"down_votes":0,"body":"I've had the same issue before, just last patch. Recently, I don't have the issue anymore.","replies":[]}]}