{"poster":"MukÄnshin","date":"2016-04-12T14:26:22.284+0000","title":"El nivel de las","subforum":"Off-topic y temas personales","up_votes":13,"down_votes":7,"body":"Nose si les pasa, pero cada vez que juego una ranked, siempre me toca gente que trollea antes de empezar, siempre. Ya nose si es por mi o porque el 90% es asi pero es imposible salir de una division asi y me gustaria que mejoren de alguna manera el emparejamiento para que esto no pase.","replies":[{"poster":"Choripan Cosmico","date":"2016-04-12T14:34:51.873+0000","up_votes":8,"down_votes":1,"body":"Te digo la verdad .... me fue facil salir de bronce ... estuve 2 divisiones ahi ... si perdias una partida en bronce la perdias rapido ... en Silver te extienden una partida perdida como una hora. Flamers AFKs y gente que se cree oro. Sin olvidar a Los Premades que creen que por que estan premades van a ganar o a carrear... mentira ... se confian y pierden.","replies":[]},{"poster":"KarmaUnder","date":"2016-04-12T22:21:34.134+0000","up_votes":3,"down_votes":0,"body":"los que dicen eso son unos exageradores totales... yo no me encuentro un troll de hace meses y juego diario, aunque solo juego rankeds y ahi hay menos trols obviamente, pero enserio... enserio decis q no podes subir de liga poreso ? kapo yo saque 10 cuentas de bronce ... y hasta en bronce los trols son uno de cada 8 partidas casi... todos buscan ganar en este juego\ndecir que el 90% de las partidas son trols es una vil mentira, el emparejamiento es mas que bueno, yo cuando pierdo es porque yo jugue mal o otro jugo mal, pero no poreso es trol, todos nos equivocamos, es mas hace poco sali 0/11 en una partida Y ME CARREARON... todo mi team diciendome troll pero no entendian que me fue muy mal y quede muy atras, no fue mi intencion y aporte todo lo que pude y ganamos!","replies":[{"poster":"kilua666","date":"2016-04-13T21:47:09.467+0000","up_votes":1,"down_votes":0,"body":"es comprensible que salgan partidas en las que uno no juega bien pero cuando no lo haces bien y encima dices \"es solo un juego, son unos grabes, denle surrender\" la verdad para mi ese tipo de gente es la que deberia ser castigada me han salido con frecuencia y la verdad cuando alguien te molesta de esa manera el juego propio decae ya que el estado de animo se vuelve malisimo","replies":[]}]},{"poster":"Sir AZØR","date":"2016-04-12T15:27:03.110+0000","up_votes":3,"down_votes":0,"body":"Estamos en la misma situación, ya me da miedo tocar las rankeds {{champion:32}} {{item:3070}}","replies":[]},{"poster":"No Uso Thresh","date":"2016-04-13T06:41:52.088+0000","up_votes":2,"down_votes":0,"body":"Pasa , mira yo te digo... yo me encontre con vos en un par de ranked y no tenes nivel... jugas mal y sos caprichoso y perdi promo por tu culpa, me acuerdo bien de vos... Por eso te digo, practica y no te van a tocar troll.","replies":[]},{"poster":"bush did 911","date":"2016-04-12T16:08:37.048+0000","up_votes":2,"down_votes":1,"body":"Si eres bueno vas a subir facil, la diferencia con otros servers se nota a partir de diamante alto","replies":[{"poster":"Little T","date":"2016-04-13T02:32:43.733+0000","up_votes":1,"down_votes":1,"body":"no es tan facil, la mayoria de los diamantes u platinos que hacen cuentas smurf juegan entre premades de 3 o hasta 4 o 5. por que saben que en una liga tan llena de personas con falta de sentido comun (como bronce, plata y quiza incluso oro) es dificil remontarla solo","replies":[{"poster":"bush did 911","date":"2016-04-13T03:21:14.941+0000","up_votes":2,"down_votes":0,"body":"Los smurf tambien te pueden tocar en mi team, y yo eh smurfeado bastante y no hay tantos ... si te mereces subir lo vas a hacer es asi de facil no hay con que darle","replies":[]}]}]},{"poster":"Alpakista","date":"2016-04-12T20:48:33.781+0000","up_votes":2,"down_votes":0,"body":"Pasa en todos los servidores no creo que sea un problema de Las solamente","replies":[]},{"poster":"Ryuushin","date":"2016-04-12T16:59:04.771+0000","up_votes":2,"down_votes":0,"body":"a mi no me pasa, no sé en que liga estas, pero desde que subi a oro y estuve en platino, toda la season 5 y esta season, solo 1 vez en la selección de champs ya había un \"troll\" pero solo 1","replies":[]},{"poster":"ZeppeIin","date":"2016-04-12T19:38:35.692+0000","up_votes":3,"down_votes":1,"body":"Deberias quejarte del rendimiento de tu liga no del server, subi a challenger y ahi quejate de las personas que trolleen o que jueguen mal, no creo que te encuentres mas de 10 por mes bye{{champion:55}}","replies":[{"poster":"Me Perdi URF","date":"2016-04-12T20:43:22.801+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Void Stiles,realm=LAS,application-id=J8qpiO2I,discussion-id=JoVAJOsh,comment-id=0007,timestamp=2016-04-12T19:38:35.692+0000)\n>\n> Deberias quejarte del rendimiento de tu liga no del server, subi a challenger y ahi quejate de las personas que trolleen o que jueguen mal, no creo que te encuentres mas de 10 por mes bye{{champion:55}}\n\nConsejos de un platino 5.. vaya (Main kata ojo)","replies":[{"poster":"Ch4puLin","date":"2016-04-12T21:12:05.250+0000","up_votes":2,"down_votes":0,"body":"Pero es correcto lo que dice, sin importar su liga.\n\"No podés hablar de bajo nivel si no estás en el mejor nivel posible\", es lo que está diciendo.","replies":[{"poster":"Little T","date":"2016-04-13T02:30:28.961+0000","up_votes":1,"down_votes":1,"body":"ese pensamiento tambien esta mal. por algo es un juego en equipo y no un juego individualista.\npor que yo sea plata no quiere decir que juege mal (no en el sentido de scores). por ahi estoy con las mejores intenciones\ny es imposible remontar una partida entre 1 o 2 personas me entienden?","replies":[{"poster":"Ch4puLin","date":"2016-04-13T11:42:12.600+0000","up_votes":1,"down_votes":0,"body":"es una cuestión de estadística, si vos sos mejor que tu liga, en tu equipo siempre va a haber alguien bueno (vos) y 4 posiblidades de mal jugadores, en el otro equipo va a haber 5 posibilidades. No vas a ganar todos, pero estadísticamente, vas a ganar más. Eso es indiscutible.\nY es cierto hasta que llegues a tu nivel real, no el que vos suponés que tenés.","replies":[]}]}]}]}]},{"poster":"Elohim Essaim","date":"2016-04-13T12:16:41.182+0000","up_votes":1,"down_votes":0,"body":"la verdad es que el único problema de LAS para mejorar en todo sentido es la actitud que se tiene al jugar ya sea soloq o dinamicq , todos se enojan por todos o se tiltean por cosas estúpidas ademas de no asumir sus errores culpando a los demás , aun así hay que admitir que aveces salen troles pero al final lo único que uno puedo hacer es reportarlos y esperar que mas personas lo haga para que riot tome medidas","replies":[]},{"poster":"LuIsHi","date":"2016-04-13T03:22:11.856+0000","up_votes":1,"down_votes":0,"body":"Como hay días que te tocan trolls, van a llegar días en los que te toquen del otro lado, y ganes una partida que estaba perdída, No te frustres y seguí jugando que en cuanto vayas mejorando vas a ir subiendo, podés perder por los trolls o afk como podés ganar por eso mismo...","replies":[]},{"poster":"Willoxey","date":"2016-04-12T16:03:53.332+0000","up_votes":1,"down_votes":0,"body":"Pues la verdad que si, toca mucha gente troll, por eso es recomendable ir con una buena premade","replies":[]},{"poster":"Treno","date":"2016-04-12T15:53:09.692+0000","up_votes":1,"down_votes":0,"body":"Estoy en plata 4 dentro de poco 3 y la vedad que gracias a dios me abran tocado un solo troll que recuerde y afks menos. Empese en bronce 2 y no me costo casi  nada subir. Es mas estoy viendo gente muy buena porque las partidas me estan costando un huevo carrearlas.\nSolo tube 2 afk en dos partidas que justamente fueron mi primer promo a plata que la perdi pero despues nunca mas.\nNo piensen en eso, solo piensen en como puden mejorar ustedes y traten de pikear champs que tengan gran impacto en la partida o en la composicion enemiga.\nNo se en que liga estaras vos kpas que ahi hay mas trolls y afks pero yo no tengo mucho drama con eso.","replies":[]},{"poster":"SK Bathoryff","date":"2016-04-12T15:09:36.602+0000","up_votes":1,"down_votes":0,"body":"Te daría 10 mil votos para arriba, pero no se puede.!!!!","replies":[]}]}