{"poster":"El Ninja Ocre","date":"2016-03-19T14:51:39.815+0000","title":"MS altos en normales","subforum":"Problemas Técnicos","up_votes":2,"down_votes":0,"body":"No se que le est&aacute; pasando a mi LoL. Cuando me meto a una personalizada para probar los MS tengo 90-80, pero cuando entro a una normal juego con 500 MS o m&aacute;s (Estoy aproximadamente 1 semana con esto). El problema no es mi Internet, ya lo comprob&eacute;. &iquest;Alguien tiene alguna soluci&oacute;n por favor? {{champion:32}}","replies":[{"poster":"Emma Mirra","date":"2016-03-19T15:03:42.390+0000","up_votes":2,"down_votes":0,"body":"Me pasa mas o menos lo mismo. Juego un ARAM para probar el lag... Me meto en normal y basta con aparecer en base y ya me tira Reanudando Conexión. Despues es cada un minuto o dos se cuelga, el oro se vuelve a 0, mi level se pone en 1. Horrible. Ni hablar de los que te insultan por meterte a jugar con lag.  \nEntre mas tarde a un ARAM... no me dejo entrar, me salio el tipico cartel de que no tenia internet (obviamente tenia). Cerre todo, apague el modem...lo prendi, me reconecte , entre a la partida y habia un afk y otro que se notaba que tenia lag y que se termino desconectando. Yo tenia lag, pero intente jugar igual. \nSon las 4 de la mañana y sigo teniendo pequeños microcortes. Teniendo 44 ms. La verdad no entiendo que pasa. Hace una semana jugaba TAN bien.\n\nMe canse y me descargue el ArgenMU xd","replies":[]},{"poster":"Sakura Star","date":"2016-03-19T14:58:13.318+0000","up_votes":2,"down_votes":0,"body":"Ya habia abierto un tema de lag que causa injugabilidad, esta asi hace unos 2 dias o mas, desconozco cuanto porque recien me vengo enterando por un amigo de que esta asi de loco el lag. Yo tambien tengo 50-80 ms maximo y ahora tengo tirones de 200-400-800-1000(este fue extremo). Sin contar el \"reconectando\", gracias a eso me la he pasado muriendo mientras leveo. Yo tambien revise mi modem y esta en correcto estado, lo cual ahora volvimos al lag de hace unos meses o se quedo clavado asi hace rato... realmente desconozco....","replies":[]},{"poster":"Sakura Star","date":"2016-03-19T15:07:09.403+0000","up_votes":1,"down_votes":0,"body":"Perdon pero que tiene que ver \"Aram\" con \"league of Legends\"...\nEstamos creo que hablando de LOL no de \"ARAM\".\nSI estas haciendo una comparacion esta extremadamente mal planteada.\nIgualmente el lag este esta dando problemas, aunque me dicen mis hermanos que ellos no tienen los ataques de lag.\nCosa que se me hace raro. Esta afectando ciertas conexiones... es lo que me hace pensar.","replies":[{"poster":"Its Hero Time","date":"2016-03-19T15:55:07.430+0000","up_votes":1,"down_votes":0,"body":"aram es otro mapa de LOL... y tiene todo que ver la grieta, aram usa el mismo servidor asi que si hay lag en la grieta tambien en el puente... osea 2 dedos de frente amigo.","replies":[{"poster":"Sakura Star","date":"2016-03-19T23:42:34.373+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=D0pelganger,realm=LAS,application-id=X54mVVp0,discussion-id=KWiZi377,comment-id=00020000,timestamp=2016-03-19T15:55:07.430+0000)\n>\n> aram es otro mapa de LOL... y tiene todo que ver la grieta, aram usa el mismo servidor asi que si hay lag en la grieta tambien en el puente... osea 2 dedos de frente amigo.\n\n\"Amigo\" y tu tienes 4 dedos de frente en darte cuenta que soy mujer.  Y aparte, perdon señor sabelotodo, ignoro los otros mapas por falta de uso, asi que mejor tus 4 dedos ya sabes donde guardartelos, infeliz.","replies":[{"poster":"Its Hero Time","date":"2016-03-21T00:19:02.281+0000","up_votes":1,"down_votes":0,"body":"No soy adivino para saber que eres mujer... y porfavor no seas machista usando el argumento de que eres mujer para que no te digan algo que te molesta. \nY no soy ningun infeliz, league of legends no es solo la grieta del invocador...","replies":[]}]}]}]}]}