{"poster":"taleofsonata","date":"2018-06-28T03:07:11.004+0000","title":"Changing Aatrox numbers won't fix how clunky he is, he needs quality of life changes","subforum":"Gameplay","up_votes":66,"down_votes":3,"body":"He needs quality of life changes, doesn&#039;t matter if he has high numbers he needs more gameplay mechanics and easier to grasp and should feel smooth and crisp to play.\n\nLike E cooldown gets reduced if he hits his Red indicator with his Q, Rewarding the player for hitting his abilities and punishing running away strats like Riven.","replies":[{"poster":"MoldyCheese1","date":"2018-06-28T03:10:33.537+0000","up_votes":68,"down_votes":1,"body":"honestly his play style is god awful, hes suppose to love to fight and love to go in, but he just has a sweet spot for his qs, he pushes him self away from the enemy to land those q knock-ups or his q blows, his dash is too wimpy to compensate for that and has nothing else to make him feel like a \"god slayer\" \n\n{{champion:266}} : Stand this exact distance from me or i'm worthless, dont get too close, i fight gods but im uncomfortable in tight spaces.","replies":[{"poster":"Teridax68","date":"2018-06-28T06:17:36.787+0000","up_votes":13,"down_votes":0,"body":"I hadn't thought of this before, but it makes a lot more sense now why I found his sweet spots so unnatural. Having a zone of higher power some distance aways from oneself is fine for a champion like Camille, who's all about precision and can dynamically adjust her positioning, and is even okay on Darius, who can just move to his enemy's side, but on Aatrox, that kind of gameplay encourages him to yank himself away from his enemies just to be able to juggle them from afar. It's a complete contradiction of his supposed relentlessness, and merely contributes to a playstyle that feels altogether ill-fitting of the character.","replies":[{"poster":"Troll for Trump","date":"2018-06-28T06:39:09.654+0000","up_votes":4,"down_votes":0,"body":"He lacks the tools to position himself well. Q making him stationary makes it extremely difficult compared to Dar and Camille","replies":[{"poster":"Teridax68","date":"2018-06-28T06:43:28.977+0000","up_votes":5,"down_votes":0,"body":"Exactly, which is why his Q feels so terrible on its own. However, there's also the fact that his E is practically designed to just let him move during Q: the ability's still clunky as shit, but on top of that the whole \"counterplay\" behind having it lock Aatrox in an animation just flies out the window. Instead of an ability that feels good to use, but also clearly outplayable, we're left with one that feels crap, but also needlessly difficult to outplay properly, as Aatrox has the tools to suddenly reposition a hitbox that is meant to be static.","replies":[]},{"poster":"The Space Cowboy","date":"2018-06-28T20:15:42.986+0000","up_votes":1,"down_votes":0,"body":"Ya I think xayas ult is how his positioning should  work. His ult lasts too long too which will keep him from getting buffs. I’ve also liked the suggestion to scale animations with attack speed.","replies":[{"poster":"Troll for Trump","date":"2018-06-29T00:48:48.546+0000","up_votes":1,"down_votes":0,"body":"If you add those things you'd need to take away more power too. If he can move or have faster animation, it will make him significantly better (possibly OP).","replies":[]}]}]}]},{"poster":"stone the blacks","date":"2018-06-28T15:33:12.005+0000","up_votes":7,"down_votes":0,"body":"{{champion:136}} stand this exact distance from me or i'm worthless, dont get too close   the champion","replies":[{"poster":"ZackTheWaffleMan","date":"2018-06-28T19:54:12.535+0000","up_votes":4,"down_votes":0,"body":"AAtrox is the worse sequel to ASol.","replies":[]}]},{"poster":"CaptainAntiHeroz","date":"2018-06-28T03:39:00.119+0000","up_votes":2,"down_votes":1,"body":"True shit","replies":[]},{"poster":"AmazoX","date":"2018-06-28T11:03:51.873+0000","up_votes":1,"down_votes":0,"body":"> {{champion:266}} : Stand this exact distance from me or i&#x27;m worthless, dont get too close, i fight gods but im uncomfortable in tight spaces.\n\n\nIt's for counter play or else the boards woulda' been flooded with cries.","replies":[{"poster":"cPXt3JHpf4","date":"2018-06-28T15:56:39.052+0000","up_votes":1,"down_votes":0,"body":"Before the rework Aatrox was good and nobody complained. Aatrox had counterplay they were called knockbacks and knock ups.","replies":[]}]},{"poster":"IxtaliKing","date":"2018-06-28T14:06:22.404+0000","up_votes":1,"down_votes":0,"body":"> {{champion:266}} : Stand this exact distance from me or i'm worthless, dont get too close, i fight gods but im uncomfortable in tight spaces.\n\nThis.\n\nI think they should at least allow Aatrox to move whilst casting Q, it's awkward enough to hit as it is and E doesn't make it feel any better at all. It's horrible.","replies":[]}]},{"poster":"VICHEL CHAOS","date":"2018-06-28T03:49:32.850+0000","up_votes":23,"down_votes":2,"body":"He needs either more availability on e because it is what makes his kit loosely somewhat attempt to function or he needs more reliability in q.\n\nJust, he feels terrible to play, they can continually buff him until he sits at whatever winrate they want, but that will not make him feel good to play.\nAlso, his kit needs to not conflict with itself, like how do you land auto atack passive hits in between q casts when your enemy has to be somewhat away? How do you not lose in melee range automatically with a Juggernaut? These things need fixinf urgently.","replies":[]},{"poster":"Teridax68","date":"2018-06-28T06:20:10.750+0000","up_votes":10,"down_votes":0,"body":"This hits the nail on the head for me, and I think answers [that other bullshit thread](https://boards.na.leagueoflegends.com/en/c/gameplay-balance/Qk6MBEKs-good-job-gameplay-boards) pretty well. Up until this point, the complaints players have had haven't been about Aatrox's raw power, but about his feel, as his style of combat right now feels utterly wooden and unresponsive. His E, in particular, very clearly acts purely as a crutch for a defective Q, leading to a playstyle that is altogether janky and reliant on too many inputs to achieve comparatively simpler outputs. Buffing his numbers will certainly increase his win rate, and no doubt increase his play rate, but it won't make his core playstyle any less dysfunctional, which in the long-term is likely to make him suffer from the same issues as Galio, and lose his \"fanbase\" the moment he drops in viability.","replies":[]},{"poster":"Sire Hippington","date":"2018-06-28T13:38:35.371+0000","up_votes":5,"down_votes":0,"body":"I think there are two QoL changes he really needs: \n\n-A biger window between Qs. Right now, if you get any CC after your first Q, you most likely won't be able to get off Q2 which means Q3 also won't happen, so you sit with nearly all your damage out of the window and a massivie CD. Aatrox should really have more time to find a good position for the next Q, especially since the range also changes with each Q.\n\n-E should not only work duering a specific window of his Q but dueing the full Q, if you use it a bit to fast or to late it fales and that sucks.\n\nAsides from that, i really think his E shouldn't have any offense tagged on, it just messes with it's usecases. It feels like it should be a pure repositioning tool either for map-mobillity by getting over terrain but mostly for landing Qs if needed. The current AD-boost means you deal less damage with Qs that hit anyway and more with Qs that needthe E for re-aiming, which imo is horrible. I think that combat-power should be moved into the rest of his kit instead, especially the ult.\n\n\nBut even then, a 3 part skill that locks you in place at every use, uses sweetspots on the far end for what's supposed to be a melee that thrives in the midst of battle and even changeing the range with each use just feels clunky.\nHaveung a single high impoact move that way would work, but a 3 part combo is just bad. If it was on a mobile champ that could move duering each use(think camille W), it would be something else, but Aatrox locks him self down for a total of ~1.5sec with about no mobillity to compensate...","replies":[]},{"poster":"ShabanShaulich","date":"2018-06-28T07:43:08.677+0000","up_votes":5,"down_votes":0,"body":"Imo he needs Urgot and Swain treatment where they make him smoother to play.The e aa reset is good change imo in hotfix but instead of his numbers i think he should have his q animation speed increased and then we see from there (he might need some number nerfs after that kind of changes)","replies":[]},{"poster":"DarkinPrime","date":"2018-06-29T04:03:55.064+0000","up_votes":3,"down_votes":0,"body":"Its shit, and this is what happens when Riot ignores all of the Aatrox mains suggestions and input and decide to make a champion more like Riven.  His entire kit is Q. Yeah, thats SO much better than auto attacks with an aoe poke and a dive knock up and aoe magic damage. THAT was boring...but spamming Q is fun!\n\nRiot fucked us hard with this rework","replies":[]},{"poster":"goodiesohhi","date":"2018-06-28T23:23:04.824+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=taleofsonata,realm=NA,application-id=3ErqAdtq,discussion-id=aAuOdOf4,comment-id=,timestamp=2018-06-28T03:07:11.004+0000)\n>\n> He needs quality of life changes, doesn&amp;#039;t matter if he has high numbers he needs more gameplay mechanics and easier to grasp and should feel smooth and crisp to play.\n> \n> Like E cooldown gets reduced if he hits his Red indicator with his Q, Rewarding the player for hitting his abilities and punishing running away strats like Riven.\n\nReverse his sweetspots. I think it would fit his thematic if he EXCELLED at close range, up close conflict.","replies":[]},{"poster":"Fawksea","date":"2018-06-28T21:24:57.606+0000","up_votes":4,"down_votes":1,"body":"when you compare this rework to irelias it's just a slap in the face how clunky he feels, no respect from riot on this","replies":[]},{"poster":"l Ryden l","date":"2018-06-29T17:37:39.878+0000","up_votes":2,"down_votes":0,"body":"In general, I think the comparison of Aatrox as Riven 2.0 is the wrong way in tackling how this champion works. \n\nThe knock-up on the tip of his Q IS the reward, you don't need anything extra.\n\nI don't think having extra E's will solve his \"clunk\" especially if it just gathers dust because you're failing to follow up in the first place. \n\nIMO he's fine right now, the players just need to figure him out. Right now, everyone's *mistakingly* playing him like a Riven-like champion, when he's not. His Q times out quicker than Rivens, he only has 1 empowered basic attack every 25 seconds, and a steroid that doesn't grant a finisher. His kit also does not allow any double casting or attack animation cancelling. However you can conveniently queue basic attacks and abilities in quick succession. This isn't to be confused with attack animation cancelling, it just means that he will perform the next basic attack or ability immediately after finish the cast of the current spell.","replies":[]},{"poster":"An Draoi","date":"2018-06-29T03:40:28.035+0000","up_votes":2,"down_votes":0,"body":"Nah thats just how Riot rolls. Kit is shit? Don't fix it just add 3 million damage on to it to fix its winrate.","replies":[]},{"poster":"lykkelas","date":"2018-06-29T00:33:21.559+0000","up_votes":2,"down_votes":0,"body":"his q cast time just needs to scale","replies":[]},{"poster":"Dog of Pavlov","date":"2018-06-28T19:25:44.244+0000","up_votes":2,"down_votes":0,"body":"It's just so weird, he can do well in lane but in team fights now that I've played with/against him... he can't do ANYTHING? Like unless there is some sort of amazing set up, but he just gets wrecked pretty easily, at least from what I've seen even when he was pretty fed.","replies":[]},{"poster":"VidimoNevidim","date":"2018-06-28T07:47:15.569+0000","up_votes":2,"down_votes":0,"body":"Havent played him yet, but from the preview alone it struck me as extreamly klunky champion. With this kit in my eyes he seams like a dissruptive support for bot lane imo :)( 3 range knock ups + Slow/chain pull thingy + heal block).\n\nSeen a lot of high elo streams yesterday and as you said i dont think numeric changes will help at all - currently to land all of hes Q's semi-reliably - you need the chain and at least 1 dash ussualy 2 - if that isnt enogh to kill your oponent, you are left with no cds for 15ish seconds and no means to escape. \n\nThe way this kit would make sense to me is if landing the \"sweet spot\" of ur Q resets the CDof the passive - so in essence with the bonus AA Range from passive you will be able to Q1->Auto->Q2->Auto->Q3->Auto which feels a lot more intuitive and in synch with the concept of champion.","replies":[]},{"poster":"BearGrillz34","date":"2018-06-28T08:35:35.072+0000","up_votes":3,"down_votes":1,"body":"It's only been 1 day. Come complain after 1 week to see how people play him. I see people complain like this with Pyke lmao. It happens with almost every champ/rework release.","replies":[{"poster":"Akali Prime","date":"2018-06-28T14:58:29.471+0000","up_votes":1,"down_votes":1,"body":"im already getting pretty use to him. hes a huge bully early game and im able to easily zone off enemies from csing because his Q is actually pretty scary and keeps enemys away because they dont wanna get hit by the tip of it. so far im loving the new rework but if riot buffs him or makes him more smoother to play because of all the complaints then hey im in!","replies":[{"poster":"Baron of Bread","date":"2018-06-28T19:44:48.345+0000","up_votes":1,"down_votes":1,"body":"I would be unhappy if they buffed him now, he doesn't feel like he needs it and if it puts him over the top we can expect him to be pick/ban for a bit before getting nerfed hard.","replies":[{"poster":"My Waifu Vanilla","date":"2018-06-29T01:55:42.501+0000","up_votes":1,"down_votes":0,"body":"Before getting nerfed to be worse than release. FTFY\n\nIrelia is arguably weaker than release after this last set of nerfs and people were also calling her \"unplayable\".","replies":[]}]}]}]},{"poster":"JohnnyNeverSins","date":"2018-06-28T08:42:42.236+0000","up_votes":2,"down_votes":1,"body":"You dont need to play the game in order to balance it ;)","replies":[]},{"poster":"MasterDClone","date":"2018-06-28T06:11:41.862+0000","up_votes":2,"down_votes":1,"body":"Finally someone speaking something real.","replies":[]},{"poster":"AtheosisX","date":"2018-06-30T08:49:43.716+0000","up_votes":1,"down_votes":0,"body":"The sweet spot element to his Q's really feels terrible to me, and, let's be real, pretty much his entire kit is useless against mobile champions.  I mean how are you supposed to land your q knock ups or actually catch anyone with your w unless they are an immobile champ?  Hell, even just walking speed is often fast enough to get out of most of these things.  I like the life steal on physical damage bit, but overall his kit needs a lot of work.  Feels like an unfinished product to me.","replies":[]},{"poster":"KICK OUT AT 2","date":"2018-06-30T04:47:53.152+0000","up_votes":1,"down_votes":0,"body":"He's actually really strong in lane after the hotfix. The E buff was the most noticeable. If you aren't playing a champ that can 100-0 him, he can heal off your wave and negate any damage you did in a short trade. Outside of lane it can be a real struggle to hit his Q's though.","replies":[]},{"poster":"Crownless Exalt","date":"2018-06-28T13:59:49.991+0000","up_votes":1,"down_votes":1,"body":"To me he fits in the same category as riven (I know tons of people will flame me for this.) the \"janky feeling\" is just a part of how he functions. Just like how Riven's comboing and animation canceling is part of her kit. I don't want to see too much done to Aatrox. I get that he isn't amazing at high elo due to mechanics. This could be fixed with some minor changes to maybe his e or something, but that's not the point.  People need to learn how to use him correctly. Just like how people who try to play riven have to learn how to play her correctly or suffer horrible performance.","replies":[{"poster":"Acheron16","date":"2018-06-29T18:54:02.533+0000","up_votes":1,"down_votes":0,"body":"The problem Riven is intended to animation cancel, since her Q is short ranged.\n\nAatrox can't animation cancel because 2 of his Qs have long ranged sweetspots, on which the damage is located.","replies":[]}]},{"poster":"Decrous","date":"2018-06-29T12:36:02.277+0000","up_votes":1,"down_votes":0,"body":"I jist wish he could move with right clicks while using Q's. Even if it waa just at 100-150 base movement speed. Anything would be better than nothing.","replies":[]},{"poster":"Nanuk Pihoqahiak","date":"2018-06-29T06:15:21.468+0000","up_votes":1,"down_votes":0,"body":"I'd start with making it so he doesn't fear his own minions when he uses his ultimate, and making his passive only activate against enemy champions / baron / dragon.","replies":[]},{"poster":"Meme God Shrek","date":"2018-06-28T21:25:29.629+0000","up_votes":1,"down_votes":0,"body":"I think an easy way to make him better at close ranges would be to adjust the sweet spot of his Q. \nInstead of the tip of the blade the sweetspot for the first hit should be a line down the middle, and for the second it could be a triangle where everywhere in front of him is a knockup, and at the end of the hitbox only the very center is the sweetspot. With those he would be able to use his passive in-between Qs more effectively, and to further increase his sustainability since the sweetspots are more risky this way he could also receive a heal for landing the sweetspots on his Q, which would also liken his kit a bit more to the old Aatrox.","replies":[]},{"poster":"TheGreatNinx","date":"2018-06-28T20:09:28.364+0000","up_votes":1,"down_votes":0,"body":"Fist problem is the lock out of his q. then his e dash locket is also massive problem with his combos.  I like that we can control better when we get revive and the damage bonus we get is great  and all but I think it could be better.","replies":[]},{"poster":"CapnMorganFr3man","date":"2018-06-28T14:05:06.813+0000","up_votes":1,"down_votes":0,"body":"Would it really be that busted to just allow him to move like normal while he uses his Q like how {{champion:122}} works? Sure maybe they could give him a slow when he does it, but landing a skillshot that has to buffer before cast that is entirely dependent on having charges in your e is just flawed to begin with.","replies":[]},{"poster":"Metallikaiser","date":"2018-06-28T13:46:53.787+0000","up_votes":1,"down_votes":0,"body":"I like new Aatrox, he feels like a melee aurelion sol. Thus he will obviously have a really sharp learning curve and feel awkward and different, but I think it very well will feel pretty fun when you do get used to it. And while people say it doesnt fit his in your face warrior aspect, he is supposed to be a refined skilled swordsman, and real sword combat doesnt involve going in grappling range much.","replies":[]},{"poster":"Escheton","date":"2018-06-28T08:39:00.380+0000","up_votes":2,"down_votes":4,"body":"No!\nHe's a bruiser version of Sion more than he is a skillshot using Jax. Stop forcing shit on champions because you want a 15th generic triforce user.","replies":[{"poster":"GayFluffyUnicorn","date":"2018-06-28T09:56:46.809+0000","up_votes":1,"down_votes":0,"body":"No we just want a champion playable above silver V when people learned to use their mouse.","replies":[]},{"poster":"Marothennan","date":"2018-06-28T09:53:54.260+0000","up_votes":1,"down_votes":0,"body":"???????","replies":[]}]},{"poster":"Skorch","date":"2018-06-28T09:03:44.256+0000","up_votes":1,"down_votes":0,"body":"I agree, however i disagree that what you are recommending are \"QoL\" Changes, he'll still be clunky with lower CD on E, and he cant use his Q to run away, so \"fleeing like riven\" sounds wrong. But yes less clunk is good.","replies":[]},{"poster":"Berel Hawdos","date":"2018-06-28T08:44:15.208+0000","up_votes":1,"down_votes":0,"body":"His Q needs a faster animation and his W needs to trigger faster.","replies":[]},{"poster":"MorganFreemanBot","date":"2018-06-28T18:26:03.573+0000","up_votes":2,"down_votes":2,"body":"The design they were going for, and what they tried to accomplish for Aatrox, is honestly really smart. It's a great goal.\n\nAs Riot said, they wanted him to be a highly skilled melee duelist who works and outsmarts his enemies, utterly decimating them by being a more skilled fighter. Fiora shares a similar fantasy, but Riot has also expressed their failure in her regard two times; her skills are two 'catch all' and there's no real skill involved to hitting weak points.\n\n#Aatrox' kit looks to succesfully accomplish this. \n\nHe's rewarded for dancing into his enemies with his Q, hitting them at just the right moment, and then dancing away from them / toying with them as they attempt to retreat and drawing them in once more. \n\nThis is also why he can't move during the cast animation; he's supposed to predict their movements / force them to go where he wants, and use his small E dash to make that happen. Being able to move at full speed would remove a lot of the 'skill' involved; just get them into the range, press button, transfer burden of skill onto his enemy.\n\nHis entire kit is designed to play around his Q and force enemies to be where you want them to be. His W is a slow and re-yank so that you can pull people into it when they think they've escaped, his E is to help reposition it when they think they're safe, and his ulti lets him get people into his ranged sweet-spot due to increased movement speed.\n\nIs he currently too weak? Maybe, maybe not. The dude's been live for a grand total of about 24 hours, so given he looks to have an actual high-skill kit it's hard to say whether or not its tuned correctly. A couple of weeks worth of data and practice should tell us.\n\nRegardless, his kit is much more interesting than it used to be, and his redesign was exclusively a boon.","replies":[]},{"poster":"Eye Of Terror","date":"2018-06-29T03:52:14.215+0000","up_votes":1,"down_votes":2,"body":"Yeah, higher numbers won't solve the fact that you, Aatrox mains, are incapable of landing any skillshots so the champ would be as QoLless as before.\n\nWhat garbage Aatrox mains want is less skillshots and more right click. \n\n{{champion:23}}  Don't worry, tho! Riot has kept a champ specially designed for retards to play.","replies":[]},{"poster":"Theorchero","date":"2018-06-28T22:30:33.679+0000","up_votes":1,"down_votes":2,"body":"Aatrox is more than fine. He's legit just released. He's actually **very** smooth and is a terror to deal with as a melee champ, his kit is just so damn good.","replies":[]},{"poster":"Sergmeista","date":"2018-06-28T15:07:24.077+0000","up_votes":1,"down_votes":4,"body":"He needs to be deleted from this game. He's literally broken right now with the stupid buffs that he DIDNT need.  Perma banning him in every game. How the heck is a champion going to have a passive that grants him half life after he's been dead and is tanky and pulls people towards the team AND also deals insane amounts of dmg. A bruiser you say? No literally a champ that requires 0 skill to play. WHO THOUGHT OF THAT REWORK? If I knew who they were I'd slap them in the face. Riot devs MUST be on something.","replies":[]}]}