{"poster":"Tètè","date":"2017-03-22T17:06:30.043+0000","title":"Kindred consigli","subforum":"Campioni e gameplay","up_votes":2,"down_votes":3,"body":"Mi servirebbero dei consigli su questo champ...Chi marchiare all&#039; inizio, core item,  ordine delle spells quando si ganka , quando inizia il suo powerspike ecc ecc..insomma un po di tutto","replies":[{"poster":"The Fluffy Lamb","date":"2017-03-22T19:57:25.905+0000","up_votes":1,"down_votes":1,"body":"Allora. andiamo in ordine:\n\n1) All'inizio marchia sempre il jungler avversario perché se te lo trovi davanti e lo uccidi hai già un marchio.\n Di solito io lo marchio per poi trovarmelo davanti a Giorgio che -povero sfigato- si è preso il marchio e quindi devo ucciderlo.\n\n2) Io seguo RedKind quindi per me i core item sono {{item:1419}} , {{item:3006}} ,{{item:3085}} \nLa mia build è questa: {{item:1419}} >{{item:3006}} >{{item:3147}} >{{item:3085}} > [item da danno come la bramasangue o Youmumu] > {{item:3153}} \n\n3)Per i gank ti puoi sbizzarrire. IO:\nDato che l'animazione della E non è la piu veloce del mondo, molte volte  vado di Q>E>W>AA>AA>Q>AA>AA ecc con opportuni movimenti tra gli aa\nA volte bastano le Q e la W senza la E.\nRipeto che qua, in questo punto, dipende molto dal player. cerca la tua combo :D\n\n4) In Early non hai un danno eccezionale ma neanche troppo male. io considero kindred da late perché E SOLO SE SI RISPETTA QUESTO PUNTO nel caso tu arrivi ad una somma di marchi pari o superiore a 10/13 diventi davvero pericoloso soprattutto per i tank. Il tuo danno deriva da quelli quindi devono essere la tua priorità. RICORDA DI MARCHIARE CHI STAI PER GANKARE!\n\nMaestrie io uso 18/12 con Warlord perche utilissimo per il kite1\nRune:\n5x Marchio della Velocità d'attacco flat\n4x Marchio della letalità flat (non sto scherzando)\n\n9x Sigilli di Scaling di hp (230/250 hp in più al 18 posso fare la differenza)\n\n9x Glifi della Resistenza magica flat /\n9x Glifi della Velocità d'attacco (nel caso non i basti quella che hai con marchi e quint\n\n3x Quint Velocità d'attacco\n\n\n\nOVVIAMENTE sono apertissimo a critiche quindi fatevi avanti ^^","replies":[{"poster":"Tètè","date":"2017-03-23T12:33:15.429+0000","up_votes":1,"down_votes":0,"body":"Ma se marchiassi tipo  il toplaner visto   che c'è l'infernal e quindo preferisco dare vantaggio alla bot ma allo stesso tempo pressure top?","replies":[{"poster":"The Fluffy Lamb","date":"2017-03-23T13:45:47.341+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tètè,realm=EUW,application-id=cAOZwaUi,discussion-id=q1re5E1Z,comment-id=00010000,timestamp=2017-03-23T12:33:15.429+0000)\n>\n> Ma se marchiassi tipo  il toplaner visto   che c&#x27;è l&#x27;infernal e quindo preferisco dare vantaggio alla bot ma allo stesso tempo pressure top?\n\nUltimamente nessuno fa piu attenzione se lo marchi o no. Almeno in basso elo un nemico pusha come un dannato, io lo marchio, lui pusha peggio di prima. \n\nIo ti consiglio, nel caso ci fosse l'infernal di gankare immediatamente bot e prendete il drago prima possibile. \n\nRipeto: se non sei un famoso otp kindred non ti consiglio di marchiare per   la pressure. Marchia solo chi ganki o, nel late, chi pensi morirà","replies":[]}]}]},{"poster":"Kim114","date":"2017-03-22T17:41:57.080+0000","up_votes":1,"down_votes":1,"body":"ti lascio il post di un tizio che mi ha aiutato; leggiti il commento con cui ha risposto a me\nhttps://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/Et8LBoPW-kindred-montage?comment=0000","replies":[]}]}