{"poster":"Mioen","date":"2018-01-19T20:17:05.627+0000","title":"Rompeohmios (Regalos Y Rompeohmios)","subforum":"Charlas Generales","up_votes":11,"down_votes":1,"body":"RIOT.\n> En este momento, Rompeohmios no es una elecci&oacute;n efectiva en casi ning&uacute;n juego de LoL. &iquest;Ser&aacute; posible que lo revisen a profundidad para rehacerlo en alg&uacute;n punto? Porque la pasiva es genial y ser&iacute;a muy bueno que algo as&iacute; se convierta en meta otra vez.\n\nMioen: Ya, borren el maldito item que nadie lo quiere.\nhttps://media.giphy.com/media/3o7TKEtrfiUFQv4P2E/giphy.gif\n\nRIOT.\n\n>¡Definitivamente es posible! No es ning&uacute;n secreto que Rompeohmios no es popular, pero creemos que es un material interesante en el que trabajar. Algunos ya hemos revisado este espacio de dise&ntilde;o, pero no encontramos una idea que fuera lo bastante emocionante y que mantuviera un dise&ntilde;o similar para justificar que se acumularan los recursos para una actualizaci&oacute;n.\n\nMioen:\nhttps://tenor.com/view/gordon-ramsay-hellskitchen-gif-5108947\n\nRIOT.\n\n> ... Estos objetos son similares porque su foco de atenci&oacute;n es progresar en el juego al impactar las torretas enemigas, pero Rompeohmios es mucho menos popular. Claramente aqu&iacute; tenemos una buena oportunidad.\n\nMioen: No existe tal oportunidad, la cosa es borrar el item o reworkearlo completamente. A&uacute;n si tu objetivo es tirar una torre o divear, con otra itemizaci&oacute;n logras lo mismo y es mas efectivo.\nUn personaje tank o un soporte con Redencion puede cumplir el mismo trabajo que un RompeOhmios y logra mejores resultados.\n\nRIOT.\n\n> ... Mientras buscamos abordar un proyecto basado en la oportunidad, tambi&eacute;n consideramos que a los jugadores no est&aacute;n tan apegados a los objetos en particular, como s&iacute; ocurre con los campeones. Es por ello que cuando hay alg&uacute;n campe&oacute;n que necesita atenci&oacute;n, normalmente tendr&aacute; prioridad sobre un objeto poco popular como Rompeohmios.\n\nMioen: Entonces para que es esta publicaci&oacute;n. &iquest;Solo querian recordarnos que el item existe?\n\n**El item existe chicos, pero no es prioridad y como nadie quiere el item tampoco lo vamos a sacar del juego.**\nhttps://media.tenor.com/images/d874836c36e4bcce2adab4dd4b2777e7/tenor.gif\n--------------\nDestaco lo siguiente: &quot; los jugadores no est&aacute;n tan apegados a los objetos en particular&quot;{{item:2049}}\nMe pregunto quien les da el feedback.\n-----------\n\nNada todo normal en League.\n**Si tiene alguna opini&oacute;n sobre este item{{item:3056}}  dejen sus comentarios.\n**\nSaludos.","replies":[{"poster":"IvVicious","date":"2018-01-19T20:34:03.587+0000","up_votes":8,"down_votes":0,"body":"Si las torres no fueran de papel higiénico, quizás el Rompeohmios serviría para algo.","replies":[]},{"poster":"Ruphian","date":"2018-01-19T20:23:07.791+0000","up_votes":6,"down_votes":1,"body":"No se porque dicen \"nadie\", yo estoy pidiendo rework al sistema de objetos desde la pre s6, al ver que los cambios a tiradores eran insuficientes, pero \"bilinciir lis ibjitis is miy dificil\" para que existen pretemporada y media temporada entonces?","replies":[{"poster":"Mioen","date":"2018-01-19T20:32:36.773+0000","up_votes":1,"down_votes":0,"body":"Igual, no es uan queja de mi parte. Pero me parecia gracioso mostrar cual era mi opinion sobre esa publicación que hicieron.\nPero si hay cosas que no cambian en este juego.","replies":[]}]},{"poster":"El Impostor","date":"2018-01-20T00:50:56.721+0000","up_votes":1,"down_votes":0,"body":"Que es un ohmio de todas formas? y porque se puede romper?","replies":[{"poster":"Ks Erwyn","date":"2018-01-20T02:12:36.737+0000","up_votes":2,"down_votes":1,"body":"viene de OHM Ω, lo cual ahora que lo pillo eso quiere decir que las torres funcionan con energía **eléctrica** y no rúnica, hemos vivida en una mentira!!!\n\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Emissang","date":"2018-01-20T06:32:58.784+0000","up_votes":3,"down_votes":0,"body":"Al contrario, el OHM es la unidad que utilizan para calcular la resistencia eléctrica de cierto material. Si el item \"rompe ohmios\" quiere decir que esta rompiendo la resistencia que tiene el objeto al paso de la electricidad , por ende se podría decir que la torre se vuelve conductora de la electricidad y así deja de funcionar...? osea que las torres dejan de funcionar cuando se vuelven conductoras de energía electrica...?\nOSEA que la energía rúnica puede mitigarse con un material conductor de energía eléctrica..!?!? ESO QUIERE DECIR QUE LA ENERGÍA RÚNICA NO EXISTE PORQUE VIVIMOS EN UN MUNDO DONDE SOLO UTILIZAMOS LA ENERGÍA ELÉCTRICA?!?!?!","replies":[{"poster":"Ks Erwyn","date":"2018-01-20T06:37:22.127+0000","up_votes":2,"down_votes":0,"body":"http://chat.animeobsesion.net/smilies/580be44ae4045.gif","replies":[]},{"poster":"Emissang","date":"2018-01-20T06:40:21.034+0000","up_votes":1,"down_votes":0,"body":"Por qué estoy escribiendo esto un viernes/sabado a la noche...","replies":[]}]},{"poster":"El Impostor","date":"2018-01-20T03:29:02.570+0000","up_votes":1,"down_votes":0,"body":"https://78.media.tumblr.com/6371e4c7f9c39842cd0ab3d746563881/tumblr_inline_n291jvAlhn1ro75in.gif","replies":[]}]}]},{"poster":"Charlôtte","date":"2018-01-19T21:12:50.341+0000","up_votes":2,"down_votes":0,"body":"El cetro abisal no solo era un buen item, sino también que era core en Amumu. \n\nAaah, pero después https://image.prntscr.com/image/Au--_UXGTP6tL7QS76ahPA.png\n\n_edit: no es mi imagen_","replies":[{"poster":"Dog Bulling","date":"2018-01-19T21:22:50.116+0000","up_votes":3,"down_votes":0,"body":"Irónicamente es aún más util en Amumu actualmente, al punto de que ahora sí es core (Antes no era tampoco obligatorio, y tampoco muy rentable al inicio).\n\nAhora otorga 350 de vida, 10% de CDR, 55 de MR, 300 de maná, sustento de maná y vida, mantiene esa pasiva de daño mágico extra, y encima tiene una ruta de armado muy cómoda (Yo por lo menos puedo vivir con {{item:1057}} {{item:3010}} durante 10 minutos). ¿Que parte de eso no beneficia a Amumu, aparte de que ahora es un poco más cara? Porque el AP con amumu puede esperar hasta el juego tardío.","replies":[{"poster":"Charlôtte","date":"2018-01-19T21:27:06.113+0000","up_votes":1,"down_votes":0,"body":"No dije que el item no sirviera ahora, sólo que antes era bastante usado e igual lo reworkearon. \nSé que fue la actualización de la resistencia mágica, pero no dejaba de ser más usado que el rompehomios.","replies":[{"poster":"Dog Bulling","date":"2018-01-19T22:57:24.029+0000","up_votes":1,"down_votes":0,"body":"El problema con ese objeto es que era muy problemático de balancear, ya que daba AP, MR y más daño mágico hacia el rival. Imagínate una {{champion:55}} que obtiene 2 kills y pilla ese objeto. No la vas a matar en la vida y ella encima te hace mucho más daño. Ahora al menos con el nuevo banshee debe renunciar a buena parte de su daño si quiere esa resistencia mágica. \n\nHay que tener en cuenta que ese es un objeto para APs, pero con una pasiva más bien para tanques con daño mágico y algo rota para los magos, mientras que el banshee era para tanques, pero con una pasiva que aprovechan mejor campeones frágiles. Por eso hicieron el primer cambio. El cambio de diseño es porque un cetro no cuela como objeto defensivo como una máscara, y porque la imagen que tenía antes era bien fea.\n\nESO SÍ, NO ES EXCUSA PARA HACER ALGO, SEA UN REWORK O ELIMINAR, EL ROMPE OMNIOS. Lo único que veo allí es que los de rito que trabajan en el balance son unos vagos.","replies":[]}]}]}]},{"poster":"XVII The Star","date":"2018-01-20T00:31:21.182+0000","up_votes":2,"down_votes":0,"body":"No me parece correcto que eliminen un objeto por ser poco popular, en LoL hay muy pocas opciones y siempre vas a encontrar una \"correcta\", que si no usas te *handicapeas* a propósito.\nYo y muchos lloramos la partida del Céfiro y del Atma sin que otorgaran algo similar en reposición. No se siente tan bien para los que lo usan y los que no no ganan nada.","replies":[]},{"poster":"Salvor","date":"2018-01-19T22:22:26.740+0000","up_votes":2,"down_votes":0,"body":"Mi opinion es que si esta el \"problema\" de que las partidas terminan muy rapido, y el rompehomios no se usa.\n\nSe pueden matar 2 pajaros de un tiro, hacemos que si rompehomios se usa en una torre aliada le da algun tipo de escudo o buff, lo cual tambien serviria para contrarrestar el \"vamos los 4 a bot a divear y sacar primera torre\"","replies":[{"poster":"Mioen","date":"2018-01-20T12:36:52.221+0000","up_votes":1,"down_votes":0,"body":"Buffar tu torreta un par de segundos para evitar que te hagan un dive intenso. Eso seria interesante de ver en el competitivo.","replies":[]}]},{"poster":"Nisinunglacert","date":"2018-01-19T21:02:16.263+0000","up_votes":2,"down_votes":0,"body":"Para mi el objeto debería cambiar totalmente de estadísticas y pasiva para que sirva para junglas, no sé me ocurre muy utíl ese item en el early para los personajes que no pueden divear a niveles bajos o pre 6(sí, se que warwick suena muy roto con esto, pero bueno). Por otro lado podría ser como un {{item:2420}} de torres y tener su propia runa, reemplazando a los {{item:2403}} que no los usa nadie y con razones.","replies":[{"poster":"Mioen","date":"2018-01-19T21:26:47.843+0000","up_votes":2,"down_votes":0,"body":"En mi caso creo deberia cambiarse a un item economico de un unico uso.\n\n{{item:1083}}{{item:2423}}  Parecido a estos, con un unico uso y consumible. Permitiendo al menos 1 vez por partida divear una linea por un precio economico.\n350 G. Y que deshabilite una torre por 2 segundos.","replies":[{"poster":"Nisinunglacert","date":"2018-01-19T21:34:15.996+0000","up_votes":2,"down_votes":0,"body":"Si esa es otra buena opción, el tema es que cueste lo poco que cueste no es rentable si solo tiene un uso. Tal vez podría refrescarse al tirar la torre o cosas así. Hay mil cosas que prodrían hacer, pero viste como es Rito...","replies":[{"poster":"Mioen","date":"2018-01-20T12:35:13.715+0000","up_votes":1,"down_votes":0,"body":"La opción de hacerlo una runa no es mala idea igualmente. Quizas en la rama de valor o inspiracion pueda que sirva.","replies":[]}]}]},{"poster":"El Impostor","date":"2018-01-20T00:51:34.795+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nisinunglacert,realm=LAS,application-id=v7qsfXsE,discussion-id=83Msa26R,comment-id=0002,timestamp=2018-01-19T21:02:16.263+0000)\n {{item:2403}} que no los usa nadie y con razones.\n\n\nque es eso? un dildo?","replies":[{"poster":"Nisinunglacert","date":"2018-01-20T06:19:36.740+0000","up_votes":1,"down_votes":0,"body":"Sí, se lo pones a los minions y explotan","replies":[]}]}]},{"poster":"Cero404","date":"2018-01-20T01:21:44.189+0000","up_votes":1,"down_votes":0,"body":"Me Borran el Rompehomios y mato a todo cristo, esa cosa me la Armo en el 90% de las partidas que juego campeones como Rammus - Singed - Nasus o Shen, es un Exelente item que en Early te puede dar ganks a enemigos efectivos, ni bajo torre se salva","replies":[{"poster":"DarkMago","date":"2018-05-14T08:15:12.075+0000","up_votes":1,"down_votes":0,"body":"Yo jamas lo use..pero quiero probarlo con mi skarner jg","replies":[]},{"poster":"musashimiyamoto1","date":"2018-01-21T02:19:43.982+0000","up_votes":1,"down_votes":0,"body":"Igual xd","replies":[]}]},{"poster":"Nuke","date":"2018-01-19T23:42:08.876+0000","up_votes":1,"down_votes":1,"body":"> Aún si tu objetivo es tirar una torre o divear, con otra itemización logras lo mismo y es mas efectivo. Un personaje tank o un soporte con Redencion puede cumplir el mismo trabajo que un RompeOhmios y logra mejores resultados.\n\nAhi exageras ya xD","replies":[{"poster":"Mioen","date":"2018-01-20T12:35:41.955+0000","up_votes":1,"down_votes":0,"body":"No de hecho, no.","replies":[]}]},{"poster":"Vulcano","date":"2018-01-20T01:57:58.158+0000","up_votes":1,"down_votes":0,"body":"ese item me lo suelo armar cuando ya la partida esta asegurada y quedan solo las torres del nexo enemigo. honestamente no se que cambio se le podria hacer para que sea una buena opcion en general","replies":[]},{"poster":"Ks Erwyn","date":"2018-01-19T23:01:14.025+0000","up_votes":1,"down_votes":0,"body":"El item necesita un rework casi total, para darle un utilidad adicional que solo ser útil en asedio/diveos...","replies":[]}]}