{"poster":"Cersei Lannister","date":"2016-04-06T21:26:39.594+0000","title":"¡Estoy en contra de los nuevos Splash Arts globales!","subforum":"Charlas Generales","up_votes":67,"down_votes":27,"body":"No se si ya postearon algo similar (si es así, pueden combinar los temas), pero estoy totalmente en contra de la globalización de los Splash Arts. Como jugadora, no me siento representada en lo más mínimo con los nuevos S.A (nuevos para nuestro server), esa tendencia de fan art estilo anime me desagrada muchísimo, no soy seguidora de la animación japonesa y de verdad, me sentí decepcionada y forzada a aceptar algo que no me gusta... No entiendo cómo pudieron aceptar este magno cambio sin consultar antes con los jugadores si les parecía la ídea de la actualización global. He revisado y comparado uno por uno todos los S.A y, en la mayoría de los casos, estropearon al campeón y su skin, como por ejemplo:\r\n\r\n- Rey Tryndamere: en el nuevo S.A pareciera que padece de estrabismo -.-\r\n- Teemo Colita de algodón: en el nuevo S.A tiene una cara de drogadicto que no se la puede, cómo pudieron arruinar el rostro de una criaturita endemoniadamente angelical >:(\r\n- Garen Comando: no se si reir o llorar, para la próxima, o le agregan la boina in-game o se la quitan en el S.A.\r\n- Annie: para qué voy a hablar de ella si tan solo verla es como estar viendo a una \"loli\"...\r\n\r\nY así podría seguir nombrando campeones y skins que, según mi punto de vista, fueron arruinados por esta actualización global.\r\n\r\nEn fin, sé que no soy la única a la que no le gustaron los nuevos S.A, sólo quise venir a dejar mi queja acá en el foro.\r\n\r\nP.D: Dentro de todo mi reclamo, quiero agradecerles que hayan cambiado el S.A de Sivir la Princesa Guerrera, ya no tiene cara de travesti XD","replies":[{"poster":"Pollos Hnos","date":"2016-04-06T21:55:09.314+0000","up_votes":18,"down_votes":3,"body":"Son horribles safan muy poquitos, pero aun asi no encajan con los ilustraciones que hace Riot las cuales son geniales, es como si formaran parte de otro juego, pero si decis esto la gente se pone como loca","replies":[{"poster":"Thalas","date":"2016-04-07T00:59:14.663+0000","up_votes":2,"down_votes":1,"body":"El nuevo de Nunu Bot ni se parece al dentro del juego.. {{champion:20}}","replies":[]},{"poster":"Hendrix","date":"2016-04-07T14:07:11.039+0000","up_votes":1,"down_votes":0,"body":"Yo no se porque solo veo algunos. \nMe aparece la nueva {{champion:39}}  (me gusto mucho), el nuevo yi cazador de cabezas, el nuevo emumu...\npero sigo con el viejo garen comando, el viejo teemo colita, y la vieja annie gotica\nOjo, viendo la cara de drogado que le pusieron a teemo y la cara naif que le pusieron a annie prefiero que sea asi, aunque no se porque esta pasandome esto.\nCreo que a annie le sacaron esa cara de malvada que es su escencia, como la cara de psicotica de jinx, o las caritas dulces de sona","replies":[]}]},{"poster":"Tiranosaurio Rex","date":"2016-04-07T04:09:26.286+0000","up_votes":8,"down_votes":0,"body":"1 son los Splash art del lol Chino nada que ver a lo japones \n2 algunos safan otros estan buenos \n3 hay muchos de los que estaban que eran un cancer a los ojos \n4 no cambian en el juego si solo ignoras la pantalla de carga no pasa nada \n:D","replies":[]},{"poster":"Afrozilla","date":"2016-04-07T00:53:24.200+0000","up_votes":2,"down_votes":0,"body":"Realmente el que mas odie fue el cambio de annie gótica estaba juntado los campeones para comprarla en el paquete pero con ese nuevo plasht art lo estoy pensando","replies":[{"poster":"Seven Teemo Army","date":"2016-04-07T02:44:21.089+0000","up_votes":4,"down_votes":0,"body":"Un splash art no cambia la skin ingame","replies":[]},{"poster":"ROX Kero","date":"2016-04-07T02:24:20.482+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Afrozilla,realm=LAS,application-id=v7qsfXsE,discussion-id=s135ump6,comment-id=0004,timestamp=2016-04-07T00:53:24.200+0000)\n>\n> Realmente el que mas odie fue el cambio de annie gótica estaba juntado los campeones para comprarla en el paquete pero con ese nuevo plasht art lo estoy pensando\n\nyo lo compre hace mucho . tambien tive que desbloquear todos los champ para que me salga mas barato . el SA nuevo me parece malisimo . la cara no representa para nada la personalidad de annie . una lastima . tambien el de annie in wonderlan cambiaron . y aunque no quedo taaaan feo . prefiero infinitamente el anterior .","replies":[]}]},{"poster":"wattefak","date":"2016-04-07T02:25:00.182+0000","up_votes":3,"down_votes":0,"body":"para mi empeoraron {{champion:15}} {{champion:17}} {{champion:23}} {{champion:31}} \npd: soy el unico al que le gusto el de {{champion:39}} ?","replies":[{"poster":"IISeraphII","date":"2016-04-07T16:13:25.294+0000","up_votes":1,"down_votes":0,"body":"Ami me gusto :v, y los de eve y los de lee, y los de ahri :v","replies":[]}]},{"poster":"KShyGuy","date":"2016-04-06T22:27:23.078+0000","up_votes":4,"down_votes":1,"body":"A mi no me gustaron los nuevos S.A. de Wukong, los anteriores eran feos pero estos no cuadran con el estilo artistico actual. Es mas, el splashart de Wukong general ya estaba circulando por al web hace un laaaargo tiempo.","replies":[]},{"poster":"Ezeko98","date":"2016-04-08T12:03:21.108+0000","up_votes":2,"down_votes":0,"body":"ALGUIEN PUEDE PENSAR EN KOG'MAW? (http://i.imgur.com/1EEX0hm.jpg)","replies":[]},{"poster":"MilosKaos","date":"2016-04-08T07:06:33.013+0000","up_votes":2,"down_votes":0,"body":"Aunque es verdad que algunos zafan, la mayoria de los Splash  tienen poca calidad comparado con lo que venia haciendo RIOT, pero bueno, ahora RIOT depende de lo que decida su nuevo dueño.\n\nA proposito de los Splash, si buscan un poco en google, especialmente en reddit verán que no es la primera vez que el nuevo dueño de Riot decide cambios en los Splash de un juego. A otro juego de la competencia le paso exactamente lo mismo.\n\nTodo sera cuestión de acostumbrarse....","replies":[]},{"poster":"Ahristócrata","date":"2016-04-07T23:15:10.193+0000","up_votes":2,"down_votes":0,"body":"Acuérdense que ahora Tencent (empresa China) tiene el 100% de las acciones de Riot Games.\n\nO sea, empresa china, S.A. chinos.","replies":[]},{"poster":"Space Dragon","date":"2016-04-07T22:24:12.146+0000","up_votes":2,"down_votes":0,"body":"Todos los splash arts que agregaron parecen salidos de Deviant Art por un cualquiera, son fan arts horribles y de bajo nivel\nmi rammus fundido y rammus de freljord quedaron HORRIBLES no encanjan ni se ven bonitos","replies":[]},{"poster":"xX EMPER0R Xx","date":"2016-04-06T21:36:13.452+0000","up_votes":3,"down_votes":1,"body":"a mi no me gustan tampoco... o por lo menos algunas... y otras si... y mira que ahi gente que crea S.A que son buenos y de mejor calidad que los que hace rito... yo diria hasta poner eso S.A en vez de estos nuevos q son un poco meh! pero bueno. para gustos colores (?","replies":[]},{"poster":"Lautysan","date":"2016-04-07T01:35:40.853+0000","up_votes":2,"down_votes":1,"body":"Totalmente de acuerdo! Son muy feos la gran mayoria...","replies":[]},{"poster":"Enigma","date":"2019-02-22T07:51:51.594+0000","up_votes":1,"down_votes":0,"body":"el Garen comando, el zilean buena onda antiguo eran mejores","replies":[]},{"poster":"Lygnus dwarf","date":"2016-04-08T02:55:08.930+0000","up_votes":1,"down_votes":0,"body":"Yo vomo jugador no me siento representado por el estilo anome de los servers de asia","replies":[]},{"poster":"FlashPunk","date":"2016-04-08T01:33:59.004+0000","up_votes":1,"down_votes":0,"body":"el de lee sin dragon, no recuerod el nombre, el que tieen la camisa con el dragon es muy wowwww","replies":[]},{"poster":"Mascheranox","date":"2016-04-07T23:53:23.466+0000","up_votes":1,"down_votes":0,"body":"Alguien vio a lee tradicional? \nPERO QUE ESTA PASANDO SHIIOOOT","replies":[]},{"poster":"  Raayo","date":"2016-04-07T11:03:32.147+0000","up_votes":1,"down_votes":0,"body":"Pero estos cambios aún no están aplicados en el juego.. O sí? Yo al Teemo colita de algodon lo sigo viendo normal. Donde vieron los nuevos splash?","replies":[{"poster":"Cersei Lannister","date":"2016-04-07T20:35:37.448+0000","up_votes":1,"down_votes":0,"body":"Los están integrando de a poco con las nuevas actualizaciones. Puedes verlos acá :) \n\nhttp://www.surrenderat20.net/2016/03/325-pbe-update.html\nhttp://www.surrenderat20.net/2016/04/45-pbe-update.html\nhttp://www.surrenderat20.net/2016/03/328-pbe-update.html\nhttp://www.surrenderat20.net/2016/04/46-pbe-update.html","replies":[]}]},{"poster":"KiaserKGIsBack","date":"2016-04-07T18:30:06.255+0000","up_votes":1,"down_votes":0,"body":"Es que RIOT cree que nos gustan todos los splash art chinos, coreanos de donde sean pero no es asi, no todos lucen tan bien","replies":[]},{"poster":"ELDRIFTING","date":"2016-04-07T17:39:57.912+0000","up_votes":1,"down_votes":0,"body":"Si opino lo mismo, No me gusta nada como se ven los campeones al estilo anime, También estoy de acuerdo que hubieran preguntado antes de hacer eso, Si es cierto que arruinaron algunas Splash Arts de algunos champs, Como Garen soldado del desierto, Es horrible tiene cara de japones no me gusta nada como quedo.","replies":[]},{"poster":"Auren Seven","date":"2016-04-07T16:36:33.268+0000","up_votes":1,"down_votes":0,"body":"Para mi la mayoria son muy feos, es un paso atras el que dieron con los Splash Arts. Ultimamente los Spash tenian una calidad impresionante y estos nuevos no tienen comparacion la verdad, ni se acercan en la calidad... Es mas parecen de la S2 o S3","replies":[]},{"poster":"Nhazsk","date":"2016-04-07T15:25:04.167+0000","up_votes":1,"down_votes":0,"body":"Totalmente de acuerdo con vos, opino lo mismo.","replies":[]},{"poster":"lubillo","date":"2016-04-07T14:49:53.185+0000","up_votes":1,"down_votes":0,"body":"Los nuevos splash art son dignos de esos juegos mediocres que te aparecen en la publicidad, el unico pasable {{champion:39}}","replies":[]},{"poster":"Adheliøs","date":"2016-04-07T14:44:36.381+0000","up_votes":1,"down_votes":0,"body":"Algunas me gustaron otras no,pero la que me rompio el corazon(a lo mejor suene muy sentimental) fue ver que van a cambiar la de talon renegado, la actual es perfecta, simple, representativa, igualita ingame, y es la unica skin del campeom unica, las demas la comparte com riven y despues la ssw, renegado es especial , se relaciona con su lore en donde antes de unjrse a noxus era un joven ladron y pobre , eso se ve en nuestro splash que tienw hasta el detalle de la ropa rota, no en el chino que ni se nota que es mas joven en el chino y tiene cara de endemoniado, simplemente me decepciono porque siento que no representa al campeon correctamente.\nPd-me gusto el spash de irelia y el de mf de waterloo ^^ las nuestras estaban como muy antiguas.","replies":[]},{"poster":"GreppiM","date":"2016-04-07T10:08:25.457+0000","up_votes":1,"down_votes":0,"body":"{{champion:39}} quedo mucho mejor asi","replies":[]},{"poster":"panther189","date":"2016-04-07T07:39:42.484+0000","up_votes":1,"down_votes":0,"body":"La verdad que son un asco, le quitaron ese estilo real que tenian algunos y los caricaturizaron como si fueran comics gringos.\nHay exepciones como sivir espectacular, que nunca habia visto un splash tan feo, ese mejoro una barbaridad.","replies":[]},{"poster":"G H P","date":"2016-04-07T06:30:18.394+0000","up_votes":1,"down_votes":0,"body":"De donde sacaste que son japonesas y que justo son de estilo anime?  porque no le veo ningún parecido. (lo que si comparto es que algunos splash son horribles)","replies":[]},{"poster":"TecheX","date":"2016-04-07T06:20:26.414+0000","up_votes":1,"down_votes":0,"body":"A mi me gustan la mayoría... la verdad... a mi campeona miss fortune la mejoraron los 2 skins que tengo (waterloo y guerrera del camino). en cambio la de akali carmesi, me la compre por el splash art anterior. de igual manera esto es un balanceo global de Splash Art hasta  que lleguen los respectivos rework de aspectos a cada campeón(esto lo dice en la nota del parche 6.7).\nsi prestan atencion se darán cuenta que están unificando todos los splash art con un solo estilo, basta con ver los reworks,campeones nuevos y skins nuevas y verán que todo se esta unificando con un mismo estilo como mencione.\nestos  splash art globales estarán  solo hasta que les toque el rework de aspecto para cada campeón. como lleva mucho tiempo hacer estos dibujos de excelente calidad. nos pusieron esta solución momentánea para bien o mal.","replies":[]},{"poster":"davichost","date":"2016-04-07T05:56:04.907+0000","up_votes":1,"down_votes":0,"body":"http://bbs.lol.qq.com/static/image/smiley/mengxi/mx_10.png","replies":[]},{"poster":"newdragon","date":"2016-04-07T05:33:16.438+0000","up_votes":1,"down_votes":0,"body":"fivita, ¿que opinas del splash art de irelia?{{champion:39}}","replies":[]},{"poster":"xAspiee","date":"2016-04-07T04:26:24.025+0000","up_votes":1,"down_votes":0,"body":"Algunos parecen sacado de google imágenes","replies":[{"poster":"davichost","date":"2016-04-07T04:35:24.742+0000","up_votes":1,"down_votes":0,"body":"parecen sacados de deviantart (no ban pls)","replies":[]}]},{"poster":"Aaron","date":"2016-04-07T04:28:02.676+0000","up_votes":1,"down_votes":0,"body":"Estoy de acuerdo en muchas, están dejando demasiado asiatico el juego y nosotros no nos calientan \"tanto\" las lolis como para tenerlas de imagen XD\n\nAnnie es la que más me quejo, sus S.A estan muy bien hecho sobre todo el de nieve que encuentro el mejor.\n\nla mayoria no me agradan y espero no permitan elegir esos cambios","replies":[]},{"poster":"Chinegro Bot","date":"2016-04-07T02:43:16.450+0000","up_votes":1,"down_votes":0,"body":"Osea cambiaron skins viejas , pueden ser algo feas bueno , pero seguro que como son viejas las quieren dejar asi y no añadirlas a las que tiene splashart (nose como se escribe jaja ) porq asi se sentiría que es como una skin viejisima y que casi nadie la tiene, por asi decirlo capas esa es la esencia que quieren dejar","replies":[]},{"poster":"ROX Kero","date":"2016-04-07T02:20:25.599+0000","up_votes":1,"down_votes":0,"body":"yo soy de mirar algun que otro anime cada tanto . pero aun asi no me gustan para nada . para mi le quitan la personalidad a los campeones . siento como que el SA no tiene nada que ver con el campeon en si . no siento que los reprecente . es solo mi opinion .","replies":[]},{"poster":"tomasxdlol741","date":"2016-04-07T01:58:29.110+0000","up_votes":1,"down_votes":0,"body":"Algunos no estan tan mal (comparados con los anteriores)podrias haber nombrado esos tambien y no solo lo malo","replies":[]},{"poster":"Dios Wrys","date":"2016-04-07T01:17:52.518+0000","up_votes":1,"down_votes":0,"body":"hay algunos que se ven bien pero hay otros que simplemente son horribles como finísimo caballero Cho'gath, o los de wukong se siente como que les arruinaron el estilo","replies":[]},{"poster":"IISeraphII","date":"2016-04-07T16:14:50.189+0000","up_votes":1,"down_votes":2,"body":"Y si en lugar de quejarnos nos ponemos a mejorar la comunidad? :v, se que me llenaran de negativos por esto... pero eso es un claro ejemplo de que nos falta mejorar como persona pd: el S.A no afecta a la habilidad dentro del juego.\n Es el juego de riot y riot se lo coge como quiere.","replies":[{"poster":"Cersei Lannister","date":"2016-04-07T20:24:41.729+0000","up_votes":1,"down_votes":0,"body":"Emmm, ¿en qué afecta  a la comunidad que yo exprese mi descontento con los S.A? ¿me expresé utilizando malas palabras o insulté a alguien?, definitivamente NO. Yo mejoro la comunidad con mi buen comportamiento dentro del cliente, no siendo tóxica y respetando a los que juegan conmigo.\n\nY si, el juego es de Riot, pero se te olvida que quienes hacemos crecer las ganancias de esta empresa somos nosotros los consumidores.","replies":[]}]},{"poster":"JACKY FANBOY","date":"2016-04-07T12:40:25.906+0000","up_votes":1,"down_votes":1,"body":"Solo es el spash art, nada que afecte al juego","replies":[]},{"poster":"rokushoger","date":"2016-04-07T11:05:29.373+0000","up_votes":1,"down_votes":1,"body":"Pues yo creo que hay aciertos y pérdidas. Sivir por ejemplo ganó muchisimo con los splash además de xin chao, la mayoría de los de teemo (excepto colita de algodon), y en general todos los personajes femeninos. Por otro lado el de rey trynda es un asco es cierto, pero a mi gusto son los menos en comparación los que perdieron calidad frente a la gran mejora de los otros.\nAhora de estilo anime nada de nada, faltan los rostros curvos, ojos grandes, lineas de expresión exageradas para que puedan ser anime.\n\nEDIT: Pegale un vistazo a Irelia básico y janna de la tempestad y decime que ese look no te gusta!!! Está brutal!","replies":[]},{"poster":"7Gab","date":"2016-04-07T04:44:00.007+0000","up_votes":1,"down_votes":1,"body":"Hay que admitir, hay ALGUNOS Y SOLAMENTE ALGUNOS que safan, pero la gran mayoría son horribles. ¿Que carajo con el de Sion? Estaría bueno que se haga una votación, splash art por splash art. O que Riot haga los splash art y no los saque de por ahi (por asi decirlo).\nJuro que odio muchisimos de los que se pusieron y de los que van a poner mas adelante {{item:3151}}","replies":[]},{"poster":"Zercurgar","date":"2016-04-07T02:39:15.527+0000","up_votes":2,"down_votes":2,"body":"Oiga compañero tranquilo, aquí estamos en territorio de Rito, no en democracia.\nLa ilustración no hace mucha diferencia, nadie te obliga a tenerla de fondo de pantalla ni a verlos más que en la pantalla de carga, que puedes minimizar.","replies":[]},{"poster":"Darwin","date":"2016-04-07T02:26:33.415+0000","up_votes":1,"down_votes":1,"body":"te enteraste que todas las acciones de rito ahora le pertenecen a una empresa china?...  solo vengo a dejar ese dato que hasta en los diarios salio.","replies":[]},{"poster":"Von Misses","date":"2016-04-07T01:15:55.626+0000","up_votes":3,"down_votes":3,"body":"Estoy totalmente de acuerdo con vos . el estilo anime que quieren imponer le saca mucha personalidad a los personajes y no me gusta para nada. Tal vez es una estrategia de Riot para expandirse en Asia pero personalmente prefiero las ilustraciones americanas.\nSaludos","replies":[]}]}