{"poster":"xAlmarockx","date":"2017-01-17T02:05:51.781+0000","title":"Non riesco a giocare a League of Legends","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"_Come da titolo non riesco a giocare a lol , dopo la selezione del campione, mi rimane su partita in corso , si riduce ad icona il client e non mi fa proprio giocare, ho provato a chiudere varie volte il client ma lo stesso  mi dice partita in corso riconnettiti, clicco su riconnettiti ma il client si riduce ad icona e non parte la partita, mi tocca aspettare la fine della partita per togliere la schermata riconnettiti ,ora ditemi se &egrave; giusto che io mi devo prendere report e ban di 5 minuti per un problema vostro, il problema mi si &egrave; presentato per la prima volta stasera ,come risolvo questa cosa visto che VORREI giocare? \r\nGrazie mille in anticipo _","replies":[{"poster":"Chroniicles","date":"2017-01-17T10:09:34.406+0000","up_votes":1,"down_votes":0,"body":"Dubito che sia un problema lato server o avremmo tutti riscontrato anomalie simili.\nProva con le cose più semplici, avvia il gioco da amministratore e controlla che firewall e antivirus non stiano interferendo col client!\nPuoi anche aiutarti con HRT: https://support.riotgames.com/hc/it/articles/224826367-Risoluzione-problemi-automatizzata-strumento-di-riparazione-Hextech\nIn caso non bastasse, puoi estrarre i log e hostarli su dropbox o simili, così visionandoli potrei risalire facilmente al problema","replies":[{"poster":"xAlmarockx","date":"2017-01-17T14:28:20.227+0000","up_votes":1,"down_votes":0,"body":"_Quale file devo mandarti ho fatto tutto , ho un archivio in rar chiamato Lol Logs , ora di questi quali file devo mandarti?_","replies":[{"poster":"Chroniicles","date":"2017-01-17T15:22:27.412+0000","up_votes":1,"down_votes":0,"body":"Inviami direttamente tutta la cartella in rar","replies":[{"poster":"xAlmarockx","date":"2017-01-17T16:01:46.799+0000","up_votes":1,"down_votes":0,"body":"Ecco a te sta di fatto che ho disinstallato lol e reinstallato, ci ha messo 30 minuti caso anomalo, visto che ci vuole molto più tempo , ho 20 minuti di coda ingiustamente , provo a rigiocare e il problema rimane non so più che fare.\nEcco a te i miei logs\nhttp://www.mediafire.com/file/ds3x23ut4hax1bo/LoL+Logs.zip","replies":[{"poster":"Chroniicles","date":"2017-01-17T17:08:20.434+0000","up_votes":1,"down_votes":0,"body":"C'è voluto meno del previsto.\nMi sono balzate all'occhio subito alcune cose, diciamo che non mi sorprende che il gioco ti dia e abbia dato problemi:\n- le tue impostazioni di rete non sono ottimizzate per lol, armati di pazienza e segui questa guida: https://support.riotgames.com/hc/it/articles/201752664-Risolvere-i-problemi-di-connessione in particolar modo i punti sulle impostazioni DNS, ipv6 e port forwarding\n- Windows ti sta creando problemi, il tuo dxdiag è pieno di errori ma potrebbe essere semplicemente qualche aggiornamento che non hai fatto. In più c'è un processo di Windows bloccato in background. Controlla su Windows Update, anche tra la cronologia aggiornamenti, se qualcuno non è andato a buon fine, mi riferisco in particolar modo agli aggiornamenti cumulativi che hanno dato problemi a parecchi utenti che passavano a Windows 10, in caso affermativo forniscimi il codice aggiornamento fallito che ti linko la procedura per fixarli. \n- la partita non ti si avvia perchè non vengono correttamente caricate texture e quant'altro, **hai provato a premere alt+enter all'avvio della partita per passare alla modalità finestra?**","replies":[]},{"poster":"Chroniicles","date":"2017-01-17T16:42:34.793+0000","up_votes":1,"down_votes":0,"body":"Dammi un po' di tempo e li visiono, ti faccio sapere il prima possibile","replies":[]}]}]}]}]},{"poster":"Worst HECA Euw","date":"2017-01-17T08:44:05.232+0000","up_votes":1,"down_votes":0,"body":"il metodo più facile? cancella e reinstalla","replies":[]}]}