{"poster":"J0CS4N","date":"2016-03-28T15:22:42.762+0000","title":"Mi experiencia abriendo 81 cofres Hextech","subforum":"Charlas Generales","up_votes":12,"down_votes":15,"body":"Mi experiencia abriendo 81 cofres Hextech\r\nGaste 64 d&oacute;lares gringos, 50 mil pesos chilenos dinero adquirido con esfuerzo y trabajo, con la esperanza de obtener a Annie Hextech\r\nY abr&iacute; 81 cofres de los cuales s&oacute;lo obtuve 3 skin que no ten&iacute;a ; cho makina de guerra, veigar gandalf y otra que no recuerdo pero que en la tienda vale 260 rp.\r\nObtuve muchos champions que ya tengo y obtuve los 6 que me faltaban que pod&iacute;a haber adquirido con PI y no con RP.\r\nObtuve muchas skin que ya tengo y las transforme en esencias por que cada vez que cambiaba en el roll, me daban otra que ya ten&iacute;a XD. As&iacute; que era mucha p&eacute;rdida y prefer&iacute; transformarlas en esencia.\r\nObtuve 4 esencias  moradas para Annie hextech. Pude darme cuenta que cada 20 cofres me daba una esencia morada.\r\n\r\nMi conclusi&oacute;n es que el sistema hextech para gente como yo que tienen todos los campeones NO  es recomendable por que de campeones repetidos, \r\nEl sistema hextech no es un sistema inteligente por que me dio muchos skin que ya tengo y al rollearlos cabe  posibilidad que te de otro que tengas igual que con los campeones.\r\nNo es un sistema justo. Esto por que yo me compromet&iacute; con el servidor y mes a mes aparto dinero de mi sueldo para invertir en skin para poder mantener el servidor online y ser parte del porcentaje de jugadores que si comprenden que este juego est&aacute; online por el dinero que se invierte y abr&iacute; 81 cofres y s&oacute;lo Obtuve 4 esencias moradas para Annie hextech y ayer me tope en una partida con un usuario que ya tiene el skin y le sali&oacute; en su primera caja de regalo y la pudo adquirir con esencias de campe&oacute;n a m&aacute;s menos 3000 esencias naranjas y es un usuario que me dijo que nunca hab&iacute;a gastado un centavo para mantener el sistema de juego online.\r\nCuando yo jugaba CS GO yo gaste dinero en abrir cofres y era premiado por Valve por ser comprometido con el sistema e invertir mensualmente en el juego y me daba skin de armas muy valiosas ese sistema tiene Valve para recomendar a los usuarios que aportan.\r\nPero ac&aacute; no es lo mismo.\r\n\r\nEn definitiva malgast&eacute; una cantidad de dinero que me hubiera servido para skin espec&iacute;ficos y no lo que me sali&oacute;. S&oacute;lo me qued&eacute; con 3 skin que no ten&iacute;a, casi 9 mil en esencia de skin naranja 4 agencias para Annie hextech que para poder obtenerla deber&iacute;a invertir m&aacute;s menos $150 mil pesos chilenos para obtener las 10 esencias moradas. Unos 192 d&oacute;lares gringos.\r\n\r\nNunca hab&iacute;a recibido de un juego tan pero tan poco por tanto dinero.\r\nQue desilusi&oacute;n y frustraci&oacute;n. Que poco cuida Riot a la gente que si colabora con el juego.","replies":[{"poster":"uhgo","date":"2016-03-28T15:34:30.115+0000","up_votes":6,"down_votes":0,"body":"Hola, creo que deberias hablar con soporte, poque se supone que cuando haces reroll te debe aparecer un aspecto que no tengas, asi es como esta diseñado, solo cuando ya tienes todas las skins te deberia aparecer una skin repetida, igual con los campeones, cuando haces reroll te debe aparecer un campeon que no tienes. Solo para estos casos deberias mandar un ticket a soporte.","replies":[{"poster":"Treno","date":"2016-03-28T16:14:39.833+0000","up_votes":1,"down_votes":0,"body":"Por lo que tengo entendido es asi, cuando das reroll te da un aspeto que no tenes, si no no seria worth comprar tantas cajas, yo ubiera dado rerol a todos los repetidos. Y no tenes que echarle la culpa a riot hubieses averiguado mas, te ubieses fijado mejor en el foro que ya habia gente que compro caja y contaban que tenian que comprar muchisimas para poder conseguir a anni, tambien hay varios videos en youtube de gente que abria muchas cajas y tampoco consiguieron mucho. Estas haciendo una compra averigua bien todo antes de hacerla, es tu culpa no de riot. Y averigua eso del rerol repetido porque n tendria que ser asi. Yo compraria unas 10 cajas pero por amor al arte sin esperar que me toque algo super genial, pero si en el rerol te tocan repetidos no comparia ninguna","replies":[]},{"poster":"KS Only Supp","date":"2016-03-28T15:58:07.698+0000","up_votes":1,"down_votes":0,"body":"El no transformo las skins para que le toquen mas skins ese fue su error","replies":[]}]},{"poster":"Summer Nights","date":"2016-03-28T19:06:28.899+0000","up_votes":4,"down_votes":0,"body":"Pero eso lo podías razonar sin comprar nada de antemano lol. En los cofres tocan champs y skins random > vos tenes muchos skins y champs comprados, que crees que es lo que va pasar? obviamente el mayor porcentaje va ser repetido lol es simple estadistica basica, para alguien que no tiene muchos seguramente sea lo opuesto a vos. Lo del re-roll lo veo raro tendrías que obtener skins que no tenes, y lo de ¨ayudo a mantener el server¨ de verdad lo crees? en las primeras season tal vez fue así y los que compraron el juego fisicamente ayudaron a riot, pero ahora? Tranquilamente cierran toda la region de LAS y no les falta un peso, no estas ayudando a mantener nada y tampoco te necesitan ni a vos ni a mi, compras porque queres comprar simple as that","replies":[]},{"poster":"Tutancadead","date":"2016-03-28T18:00:28.461+0000","up_votes":3,"down_votes":0,"body":"Claro que no. Ese sistema es para los pobres.","replies":[]},{"poster":"Natchin","date":"2016-03-28T16:46:08.998+0000","up_votes":3,"down_votes":0,"body":"Si al rollear 3 escencias de skin te dan un aspecto que ya posees esto claramente es un BUG y debes reportarlo para que te devuelvan las escencias o te den skins que no poseas.\n\nEso por una parte, por otra parte, y como dijo alguien más, esto es AZAR, por lo que claramente podrías no ganar nada y es parte de las reglas del juego, por lo que si vas a invertir tanto dinero mejor asegúrate de comprar directamente lo que quieres.","replies":[]},{"poster":"tikicala","date":"2016-03-28T16:12:15.595+0000","up_votes":2,"down_votes":0,"body":"Nadie te obligó a invertir dinero en este juego, si vos no invirtieras mas no pasaria nada, el juego estaeia exactamente como esta, una empresa como esta no depende de tu dinero, asi que ahorrate las quejas.\nSi sabes que es un sistema en el que los campeones y las skins salen al azar no te podes desilucionar, porque cuando abris las cajas sabes que te puede salir cualquier cosa","replies":[{"poster":"J0CS4N","date":"2016-03-28T16:17:54.668+0000","up_votes":2,"down_votes":2,"body":"Respeto tu opinión pero recuerda que cuando nació el LOL fuimos muchos los que compramos el disco para colaborar y los mismos dueños agradecieron dando skin especiales por el aporte por que el dinero fue y es necesario para la empresa. Y hasta hoy es así.","replies":[{"poster":"tikicala","date":"2016-03-28T16:21:41.348+0000","up_votes":3,"down_votes":0,"body":"Eso esta perfecto y obvio que todos lo que aportaron ayudaron a este juego a ser lo que es hoy en dia, yo cargo rp mensualmente y cuando abri las artesanias me salieron muchas cosas malas, pero no me queje porque sabia que el premio era al azar, y no por ser alguien que invierte en el juego voy a estar privilegiado o recibiendo mejores cosas","replies":[]}]}]},{"poster":"LessPain","date":"2016-03-28T16:01:55.084+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Shijim4 de Virgo","date":"2016-03-28T16:20:42.256+0000","up_votes":3,"down_votes":0,"body":"Las gemas moradas existen, juntando 10 te dan annie hextech o 1= 1 cofre+Llave.\n+1 por que si tienes todos los champ es logica eso\n+1 por recordarle q es ALEATORIO\n+1 Combinar 3 skin nunca te da un skin q ya tengas (sino me equivoco )\n-8 por la actitud agresiva de tu comentario","replies":[{"poster":"SuperLoky","date":"2016-03-28T17:23:33.690+0000","up_votes":1,"down_votes":0,"body":"las skin te puede tocar una que ya tengas al hacer reroll\nlos campeones no a menos que ya tengas todos los campeones.","replies":[]}]},{"poster":"J0CS4N","date":"2016-03-28T16:09:34.829+0000","up_votes":2,"down_votes":0,"body":"Me huele a flamer aburrido odiando en un post que no le interesa realmente más que para descargar todo su odio y frustración diaria.","replies":[]}]},{"poster":"vk0utsider","date":"2016-03-28T15:38:06.471+0000","up_votes":3,"down_votes":0,"body":"\"El botín **aleatorio** que sale en los cofres vale más que el precio de los cofres en sí (bueno, depende de qué opinión tengas acerca de Teemo), así que podrás comprarlo con la seguridad de que será una buena adquisición **(aunque comprar directamente en la tienda seguirá siendo la mejor opción cuando busques algo específico)**.\"\n\nAclarado desde minuto 0, todo lo demás es responsabilidad del usuario y no me parece crear temas quejandose de algo que hacen a sabiendas de que les puede ir bien ... o no como en tu caso.","replies":[{"poster":"J0CS4N","date":"2016-03-28T15:43:56.765+0000","up_votes":1,"down_votes":0,"body":"Es tu opinión y la respeto, al igual que la mía.","replies":[{"poster":"Tutancadead","date":"2016-03-28T18:03:16.109+0000","up_votes":1,"down_votes":0,"body":"Si riot se contradices tiens razón. \nSo das por entendido lo que no dice es tu culpa.","replies":[]}]}]},{"poster":"Bot BIitzcrank","date":"2016-04-07T03:27:55.895+0000","up_votes":2,"down_votes":0,"body":"Creo, que tenes problemas de juego y apuestas :V","replies":[]},{"poster":"DarkSoul98","date":"2016-03-28T21:30:16.603+0000","up_votes":2,"down_votes":0,"body":"Para gente como tu estan los cofres misteriosos :v.\nLa artesania Hextech es basicamente eso, una cajita misteriosa para pobres :'v","replies":[]},{"poster":"KurosakiIchigo15","date":"2016-03-28T15:51:42.835+0000","up_votes":2,"down_votes":0,"body":"Yo no gasto ni un dólar en hextech, si es algo gratis no vale la pena gastar, yo tmb compró Rp y antes con otra cuenta compraba cajitas gaste más de 25k de Rp  Y algunas skins buenas salieron pero no todas las que quieres. Por eso en esta nueva cuenta optó por comprar la skin que me gusta del campeón que me gusta y se terminó! ! Aunque estaría Op por parte de riot darnos una skin como premio anual diseñada especialmente para los que cargan más X cantidad de dólares anuales.","replies":[{"poster":"KS Only Supp","date":"2016-03-28T15:59:55.638+0000","up_votes":1,"down_votes":0,"body":"Sacaban un skin nuevo para los que cargaron mas de 10k de rp y se llamaba tryndamere y algo que tenga que ver con el rp xD","replies":[]}]},{"poster":"Eh Ameoooo","date":"2016-03-28T15:43:01.821+0000","up_votes":2,"down_votes":0,"body":"Cada uno es libre de hacer lo que quiera con su dinero pero, si ya tienes practicamente todo deberias haber previsto que te iban a salir cosas que ya tenias. Para mi fue dinero mal gastado. En tu lugar me los hubiese gastado en un bar con mis amigos.","replies":[]},{"poster":"Pato De Bronce","date":"2016-03-28T15:30:58.842+0000","up_votes":4,"down_votes":2,"body":"2 cosas\n1 no existe esas tal esencias moradas de la que hablas sólo las gemas moradas \n2 no te pueden salir en el reroll skin que ya tengas sólo fragmentos de skin que ya tienes porque el sistema está hecho para que te salgan skin no obtenidas y si es el caso que dices que te salen skin repetidas es porque ya tienes todas las skin y gastaste plata por ingenuo porque otra posibilidad no existe","replies":[{"poster":"Brucé Wayne","date":"2016-03-28T17:07:43.119+0000","up_votes":1,"down_votes":0,"body":"Estas equivocado, si pueden tocar repetidos...  yo no tengo todas las skins, y ya son varias que me tocan repetidas...","replies":[]},{"poster":"J0CS4N","date":"2016-03-28T15:35:37.588+0000","up_votes":1,"down_votes":0,"body":"Estas equivocado. Si existen y son para crear a Annie hextech. Y no tengo todas las skin pero si todos los champions. En la noche cuando llegué a mi hogar te mostraré la screenshot de las moradas para que las conozcas. Y hablo con la verdad cuando digo que me dio skin repetidas.","replies":[{"poster":"Tiranosaurio Rex","date":"2016-03-28T17:01:40.860+0000","up_votes":1,"down_votes":0,"body":"por eso no se llaman esencia morada se llaman gemas moradas y si te pueden tocar skin repetidas es un sistema al azar no es 100% fiable","replies":[]}]}]},{"poster":"Galiers","date":"2016-09-21T00:26:12.482+0000","up_votes":1,"down_votes":0,"body":"yo he comprado varios pack de 10+1 cajas + llaves sin suerte con annie o vayne directo, con las gemas llevo 6... con las skins considerando que de los campeones que tengo solo me faltan 9 skins es bastante dificil que me salga alguna skin de las 9 faltantes, a pesar de ello el otro día me salio programa lissandra que no la tenia :)\n\nhe estado haciendo reroll con las skins que me salen sin suerte, ya tengo 14 skins permanentes que por no tener/querer el campeón han quedado en la tienda hextech con un marco dorado... mismo ocurre con las legendarias que me han salido ya que son de campeones que no quiero comprar.","replies":[]},{"poster":"Glorfindel esdla","date":"2016-09-21T00:11:34.223+0000","up_votes":1,"down_votes":0,"body":"Pero vos tenías a mas de la mitad de las skins del juego XDDD","replies":[]},{"poster":"PoorBoy","date":"2016-03-28T21:19:25.367+0000","up_votes":1,"down_votes":0,"body":"Comparto tu dolor colega, el azar es injusto muchas veces... pero es parte de o que es... azar","replies":[]},{"poster":"Kyousuke","date":"2016-03-28T16:37:20.843+0000","up_votes":1,"down_votes":0,"body":"> Cambiar Cambia tres tipos similares de botín por botín permanente del mismo tipo (por ejemplo, cambia tres campeones diferentes por un campeón permanente con garantía de que no será uno que ya poseas).\n\nhttp://las.leagueoflegends.com/es/site/2016-season-update/champion-mastery.html \n\nno diré nada que no hayan dicho hasta ahora pero dejo eso ahí. si realmente te tocaron skins repetidas deberías mandar msj a soporte ya que el reroll asegura un skin que no tengas. \nlo de los campeones están viendo para armar un sistema para los que tengan todos los champs, igualmente este artesanía se podría decir que esta en beta por que querían sacarlo lo mas rápido posible por eso no les dio tiempo a hacer algo con respecto a eso.\n\ndejando eso a un lado nadie te obliga a pagar por jugar, los skins no te dan ventaja en este juego solo es algo meramente estético y si no te toco lo que querías es por que es algo al azar, puede tocarte algo que no quieras al abrir  100 cajas y otro que abre 1 puede sacar lo que vos querías. \nsi dieran algo a los que pagan seria injusto con el resto y si te fijas rito no hace preferencia por nadie. \nen fin suerte para la próxima (si es que seguís intentando) y a no amargarse por mala suerte en el azar {{champion:4}}\n\naca por ejemplo tenes a catacroquer que le toca 1 definitiva pero es la que tiene https://www.youtube.com/watch?v=276L35cqGVU XD es cosa de la suerte, en el pbe a el le había tocado a la primera ezreal pulso de fuego ","replies":[{"poster":"SuperLoky","date":"2016-03-28T17:18:46.087+0000","up_votes":1,"down_votes":0,"body":"conosco a alguien que en su primer cajita que abrio ( no la de regalo ) le dio Ezreal Pulso de fuego {{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"condellman","date":"2016-03-28T20:53:33.476+0000","up_votes":1,"down_votes":0,"body":"A mi por ejemplo. me salio Ezreal pulso de fuego. Pero no tengo esencias para canjearlo!","replies":[]}]}]},{"poster":"KS Only Supp","date":"2016-03-28T15:45:08.474+0000","up_votes":1,"down_votes":0,"body":"Sabes que podias convertir los skins que tenias?, digo osea podrias haber conseguido mas de 3 skins asi","replies":[{"poster":"J0CS4N","date":"2016-03-28T15:58:40.055+0000","up_votes":1,"down_votes":0,"body":"Lo hice y me salieron 4 veces skin repetidos por eso opté por dejarlos como esencia.","replies":[{"poster":"KS Only Supp","date":"2016-03-28T20:37:34.051+0000","up_votes":1,"down_votes":0,"body":"me retracto de lo que dije, me salio jax skt t1 y ya lo tenia :c","replies":[]},{"poster":"Tutancadead","date":"2016-03-28T18:03:49.672+0000","up_votes":1,"down_votes":0,"body":"Eso es lo que está mal\nCuantos slin te faltan?","replies":[]},{"poster":"KS Only Supp","date":"2016-03-28T16:02:40.287+0000","up_votes":1,"down_votes":0,"body":"Eso es imposible, te toca un skin que no tengas no uno q tengas","replies":[{"poster":"J0CS4N","date":"2016-03-28T16:08:14.872+0000","up_votes":1,"down_votes":0,"body":"No es imposible ... Es por eso mi sorpresa y malestar","replies":[{"poster":"SuperLoky","date":"2016-03-28T17:26:56.694+0000","up_votes":1,"down_votes":0,"body":"estan confundidos con algo, los campeones son lo que no te pueden tocar que ya tengas ( a menos que tengas a todos en cuyo casi si empezaria a darte campeones que ya tenes como es logico y te queda la tarjeta ) \n\nLas skins podes mesclar 3 y que te salga una que ya tenes, no necesariamente te tiene que tocar una que no tengas.\n\nEspero haberles aclarado la duda.","replies":[]}]}]}]}]},{"poster":"Darwin","date":"2016-03-28T15:44:28.687+0000","up_votes":1,"down_votes":1,"body":"a un amigo le toco el fragmento de la skin de annie hextech y compro solo 5 cofres. Rito lo dijo bien claro... esto es AZAR. Hay gente que \"juega\" toda su vida y no gana nada y otros que juegan poco y nada y resultan ganadores. bienvenidos al mundo del AZAR. Ademas quiero recordar que el sistema es gratuito, nadie obliga a nadie a comprar y a proposito, si hubieras calmado tu ansiedad seguramente te hubieras enterado q en poco tiempo van a dar cofres especiales que garantizen esencias moradas. \n\nA no perder animos! saludos!","replies":[{"poster":"J0CS4N","date":"2016-03-28T16:01:10.278+0000","up_votes":1,"down_votes":0,"body":"No sabía lo de los cofres que aseguran esencia morada, gracias por comunicarlo.\nPero también debes recordar que si el juego no paga los servidores donde está alojado y al personal y no hay ganancias... El juego no existirá. Debe haber gente que costee el servicio para existir.","replies":[{"poster":"Darwin","date":"2016-03-28T19:40:59.857+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=J0CS4N,realm=LAS,application-id=v7qsfXsE,discussion-id=UjEJ1niz,comment-id=00040000,timestamp=2016-03-28T16:01:10.278+0000)\n>\n> No sabía lo de los cofres que aseguran esencia morada, gracias por comunicarlo.\n> Pero también debes recordar que si el juego no paga los servidores donde está alojado y al personal y no hay ganancias... El juego no existirá. Debe haber gente que costee el servicio para existir.\n\nsi dudas en eso estamos de acuerdo! jaj. saludos!","replies":[]}]}]},{"poster":"TerremotoChileno","date":"2016-03-28T18:23:44.839+0000","up_votes":1,"down_votes":0,"body":";v pasa un skin para los pobres","replies":[]},{"poster":"Himawa","date":"2016-03-28T17:58:16.227+0000","up_votes":1,"down_votes":0,"body":"Dijeron que mas adelante implementarían un pack que incluyera ademas de cofres y llaves, gemas.","replies":[]},{"poster":"Help Support","date":"2016-03-28T17:31:38.566+0000","up_votes":1,"down_votes":0,"body":"No es tanta plata para andar llorando, pero si el sistema favorece a los que no cargan rp, pero si queres a annie hextech con 30mil de rp la conseguis,","replies":[]},{"poster":"Neshiro","date":"2016-03-28T16:23:20.544+0000","up_votes":1,"down_votes":0,"body":"Nadie te obligo a gastarte el dinero y ellos  no tienen la obligación de recompenzarte así que GG haha","replies":[]}]}