{"poster":"MysticLulu","date":"2015-02-07T19:09:37.341+0000","title":"Soporte en Servidores","subforum":"Problemas Técnicos","up_votes":3,"down_votes":1,"body":"Creo que al hablar sobre este tema, hablo por muchos invocadores al respecto de como estamos jugando día tras día, Me parece que Ustedes (La compania de RiotGames) Se centra mas en el **dinero**, como verán, muchas skins y champions cada parche (Champions no, pero las skins...). Bueno a lo que iba es que me parece que deberían arreglar un tanto el **servidor**; Se cae, hay lag, te desconecta o directamente no te deja entrar en las partidas, lo que proponía es que si pudiesen dejar de lado un poco el dinero y arreglar los **servidores**, porque a ver... Somos millones de **jugadores**, y millones :T y me parece que en vez de darnos el lujo de vernos bien dentro de una partida, **merecemos** mejor que el servidor este estable. Sin mas que decir, ***muchas gracias*** si es que leen este post :)","replies":[{"poster":"UnknownPlayer","date":"2015-02-09T02:54:44.372+0000","up_votes":1,"down_votes":0,"body":"Es un juego Gratis :P","replies":[]},{"poster":"Frogeryer ","date":"2015-02-08T15:00:35.211+0000","up_votes":1,"down_votes":0,"body":"Tenes toda la razón riot deja al lado el dinero y establezcan bien los servidores el laucher y todo lo demás e un muy buen juego para pasar el rato tanto con amigos como jugando vos solo no lo desperdicien :)","replies":[]},{"poster":"coolduckpro","date":"2015-02-07T20:04:16.801+0000","up_votes":1,"down_votes":0,"body":"riot,perdi mi promo a plata recien pq no me podia mover :C","replies":[]},{"poster":"XxKamehousexX","date":"2015-02-07T19:43:54.759+0000","up_votes":1,"down_votes":0,"body":"YO CREO QUE RIOT DEBERIA IRSE BIEN A LA .... ","replies":[]},{"poster":"Kashnaradak","date":"2015-02-07T19:39:36.215+0000","up_votes":1,"down_votes":0,"body":"Yo creo que es verdad que deberían folcaizarse mas en el servidor. Si mejoran el servicio y ponen un sistema de baneos mas adecuado  (hubo progresos en esto, lo reconozco pero creo que no es suficiente), la gente empezaría a invertir mas dinero en el juego.","replies":[]}]}