{"poster":"Erikkegy123","date":"2015-10-22T07:29:48.569+0000","title":"Hiba!","subforum":"Minden egyéb","up_votes":1,"down_votes":0,"body":"A j&aacute;t&eacute;k a hősv&aacute;laszt&aacute;sn&aacute;l nem l&eacute;p tov&aacute;bb! &Iacute;gy nem lehet bel&eacute;pni a j&aacute;t&eacute;kba. Pr&oacute;b&aacute;ltam a ki &eacute;s bel&eacute;p&eacute;st de semmi, m&eacute;g ott sem lehet vissza csatlakozni!\r\nIlyenkor mit kellene csin&aacute;lni ??","replies":[{"poster":"Pityesz85","date":"2015-10-24T16:31:37.929+0000","up_votes":1,"down_votes":0,"body":"Valami baj van a szerevrel .... vége a gamenek és kilépek erre valami rendszer üzenet hogy valami baj van a szereverel .... ok ..... de erre lépjek vissza egy olyan játékba aminek 5 perce vége és gondolom majd megkapom jol megérdemelt büntetésem .... bár nem játszotam egy ideig és eltünt mindenem bár ezen nem agodok csak már azért nahhh ...... ","replies":[]},{"poster":"Lady tRuffLeS","date":"2015-10-23T08:26:38.699+0000","up_votes":1,"down_votes":0,"body":"Sziasztok :-)\n\nNálam ugyanez volt a probléma, a hősválasztás után nem kezdődött el a játékbetöltés, hibaüzenetet nem kaptam. Rajtam sem segített a ki-be lépés, \"a játék még zajlik\" felirat jelent meg miután kilépés után újra beléptem a játékba. Arra gyanakodtam, hogy a win10-el van valami gubanc. Segítséget kértem a játékostámogatástól, tudnak a hibáról, nagy erőkkel dolgoznak rajta. A support javaslatára újratelepítettem a játékot, most már betölt ugyan a játék, azonban pár perc után nagyon durván elkezd laggolni. Én türelmesen kivárom amíg megoldódik ez a probléma, végső esetben visszatérek a win7-hez :-))","replies":[]},{"poster":"szarjanko","date":"2015-10-22T12:19:31.559+0000","up_votes":1,"down_votes":0,"body":"Ugyanaz, a hősválasztó ideje leszámol, aztán nem lép ki belőle és nem is tölt a játék, visszacsatlakozni nem lehet, mert semmit nem csinál, majd egy idő után kiírja, hogy a játék lejárt és visszadob a kezdőoldalra.","replies":[]},{"poster":"Zooty","date":"2015-10-22T12:06:05.560+0000","up_votes":1,"down_votes":0,"body":"Mit értesz azalatt, hogy nem lép tovább? Elkezdi betölteni a játékot, és nem megy neki? Vagy ott ragadsz hősválasztóban? Esetleg kiír valamit hibaüzenetet?","replies":[]}]}