{"poster":"MidlightDschinn","date":"2019-04-14T16:54:40.188+0000","title":"Team sucht ADC im Goldbereich","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey zusammen,\r\n\r\nwir sind 4 Spieler im Gold-Bereich und suchen auch entsprechend im Elo-Bereich Gold noch einen ADC für unser Team. Das Team gehört einem festen Clan an, wobei man dazu eben sagen muss, dass ein Beitritt des Teams auch gleichzeitig ein Beitritt im Clan \"All in\" beinhaltet. \r\n\r\nNatürlich nutz ich das gleich auch mal frech für Werbung: :D\r\nhttps://www.allin-clan.de/\r\n\r\nWir alle kennen uns bisher flüchtig, wobei unser Zusammenspiel doch recht gut harmoniert. Dafür suchen wir jetzt einen entsprechend harmonischen ADC. Wir sind entweder berufstätig oder noch in der Schule, sodass uns die Zuverlässigkeit unserer Mitspieler wichtig ist. Natürlich kann jedem mal etwas dazwischen kommen, wir legen darauf jedoch gesteigerten Wert.\r\n\r\nDie meisten von uns spielen LoL schon einige Saisons und haben sich hier wohl auch ihrer Lieblingslane verschrieben. Deswegen ist uns auch wichtig, dass der Spieler schon seine Rolle auch beherrscht, das heißt: Wir wollen eigentlich vermeiden, dass jemand sagt er könne alles spielen und dann in seiner Matchhistory auch wirklich alles spielt, aber nichts gemeistert hat. Also definitiv jemanden wo man auch aus der History erkennen kann, dass es sich um einen ADC-Spieler handelt :)\r\n\r\nWas erwartet euch?\r\n\r\nEine bunt gemischte Truppe an LoL-Spielern, die das Spiel aber als solches durchaus ernst nehmen. (Und ja, natürlich darf bei uns gelacht werden... Im Keller :P)\r\nEin Team, welches sich mit dem Clan in dem es spielt auch verbunden fühlt und wir auch vor haben unser Team höher zu bringen und ggf auch an Turnieren teilzunehmen. \r\n\r\nIch denke am sinnvollsten ist es, wenn wir uns dann kennenlernen und gemeinsam ein paar Runden spielen. Immerhin sollte es ja harmonieren, nicht? :)\r\n\r\nDafür am sinnvollsten einmal AI Midlight (Supp) oder AI Deathbringer (Top und Teamleiter) adden.\r\n\r\nLieben Gruß eure\r\nAI midlight","replies":[]}