{"poster":"Son Olivia Hye","date":"2016-07-28T04:10:55.828+0000","title":"how come i've been seeing pros use natural talent now on adcs now?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"I&#039;ve been seeing this recently when i was looking at VODs and I take a look at their mastery pages.  Is Vampirism not good on adcs anymore?","replies":[{"poster":"CIickTheLantern","date":"2016-07-28T04:13:29.201+0000","up_votes":3,"down_votes":0,"body":"vamp is only good really early game for that lane sustain. It gives 2.5% at max rank and is outscaled profusely by NT lategame. in certain senarios, it can add hundreds of damage to crits. vampirism is only better on select adc's as the LS is better for almost all game on them.\nJK idk shit about this game.","replies":[{"poster":"Muted Summoner","date":"2016-07-28T04:29:57.019+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=slaughtermelon2,realm=NA,application-id=3ErqAdtq,discussion-id=gVXozA4P,comment-id=0000,timestamp=2016-07-28T04:13:29.201+0000)\n>\n> vamp is only good really early game for that lane sustain. It gives 2.5% at max rank and is outscaled profusely by NT lategame. in certain senarios, it can add hundreds of damage to crits. vampirism is only better on select adc&#x27;s as the LS is better for almost all game on them.\n> JK idk shit about this game.\n\nbut early game is bypassed with tower swapping. rushing to mid-late game is the pros priority.\n\nIm only guessing here. Its been that way for seasons mostly","replies":[{"poster":"CIickTheLantern","date":"2016-07-28T05:13:38.619+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mute Scarecrow,realm=NA,application-id=3ErqAdtq,discussion-id=gVXozA4P,comment-id=00000000,timestamp=2016-07-28T04:29:57.019+0000)\n>\n> but early game is bypassed with tower swapping. rushing to mid-late game is the pros priority.\n> \n> Im only guessing here. Its been that way for seasons mostly\n\nthanks for not being an asshole like me :D","replies":[]},{"poster":"Votable Jester","date":"2016-07-28T05:07:09.944+0000","up_votes":1,"down_votes":0,"body":"I'm not sure, but I'd assume it's because of the change making Natural Talent give more AD/AP early on than before.  This could slightly improve their early pushing, harass, and dragon/herald damage.","replies":[]}]}]},{"poster":"Muted Summoner","date":"2016-07-28T20:17:08.387+0000","up_votes":1,"down_votes":0,"body":"not to mention {{item:1053}} , or double {{item:1055}}  on 1st back or a {{item:1083}}  and a {{item:1055}}  or Warlords blood lust is all you need in the laning phase if you are going to be trading so much. If you aren't trading hits with champions normally fervor of battle is the way to go unless your Jhin then you get Deathfire touch for mid-late game.\n\n\non a side note. Why does the boards not have at least keystone masteries icons in like champions, summoners and items.\n\n\neither way having the vamp mastery over (NT) isn't too bad either.\nI always grabbed Vamp mastery but I may rethink it on some of my builds if pros are grabbing (NT) sometimes. I know they buffed it some time ago and that may be the reason because for so long Vamp mastery was just to good compared to (NT).","replies":[]},{"poster":"III BAKURYU III ","date":"2016-07-28T05:53:12.743+0000","up_votes":1,"down_votes":0,"body":"It depends on what type of player is playing if there passive or aggressive it also depends on the champions and if they have decent AP abilities or good scaling. \n\nHard hitting adc such as {{champion:104}} {{champion:21}} {{champion:18}} is good with (NT) because they scale well with the mastery and  their att speed isn't the greatest in the world.  (NT) is also good if you are looking to go ham early-mid game while the Vamp mastery is good for Lane phase and on {{champion:236}} {{champion:67}} due to having a massive att speed(Vayne) and double shot passive(lucian)","replies":[]}]}