{"poster":"Jotunheimr","date":"2015-09-24T23:29:46.232+0000","title":"@Meddler, Question for Olaf","subforum":"Gameplay","up_votes":2,"down_votes":2,"body":"Hello! First, thank you for your involvment within the community. It is very much appreciated. :)\r\n\r\nMy question for you is: With the new skin coming out, and the fact Olaf is free atm, can we expect any small buffs for Olaf in the near future? Olaf seems balanced for the most part, but flipping R tends to result in an immediate death. The champ also falls off very quickly if you die a few times. \r\n\r\nJust curious if any buffs to the Berserker can be expected. \r\n\r\nThank you for your time reading this! I eagerly await feedback. :)","replies":[{"poster":"Meddler","date":"2015-09-25T04:48:50.851+0000","up_votes":3,"down_votes":0,"body":"No current plans for Olaf, he seems to be in an okay spot for now at least (though I'm still personally a little suspicious still that the new juggernaut items might be a bit strong on him). As a side note the balance team operates independently of skin releases and free rotations, those aren't factors they take into account when considering which champions need work each patch.","replies":[{"poster":"Ralanr","date":"2015-09-25T14:49:32.283+0000","up_votes":1,"down_votes":0,"body":"is there a specific reason for that?  I'm just curious.","replies":[{"poster":"Jotunheimr","date":"2015-09-25T16:49:20.888+0000","up_votes":1,"down_votes":0,"body":"For what","replies":[{"poster":"Ralanr","date":"2015-09-25T16:59:27.550+0000","up_votes":1,"down_votes":0,"body":"Why the balance team operates independently from free rotations.","replies":[{"poster":"DrNova","date":"2015-09-25T17:20:45.533+0000","up_votes":1,"down_votes":0,"body":"Is there a reason it should be otherwise?","replies":[{"poster":"Ralanr","date":"2015-09-25T17:26:04.198+0000","up_votes":1,"down_votes":0,"body":"I was just curious. I don't really know how this stuff works.","replies":[{"poster":"DrNova","date":"2015-09-25T19:24:53.421+0000","up_votes":1,"down_votes":0,"body":"Free rotations are just so people can try champs. Balance team couldn't keep up with looking over and editing all the free champs each week I'd assume","replies":[]}]}]}]}]}]},{"poster":"Jotunheimr","date":"2015-09-25T16:23:33.091+0000","up_votes":1,"down_votes":0,"body":"Hi! Thanks for the feedback. I used the juggernaut items my last 2 games. The items make building tank more viable, so you're not dealing insignifigant damage. They give you the oppurtunity for sustained damage. There were times when a full Life Steal build would have been useful, but overall I'd say the juggernaut items do seem to balance defense and offense well. There were times when a max lifesteal build would have come in handy and saved my life, but the defense from the items also helped, especcially in team fights. I still built bloodthirster and BoRK  the lifesteal and attack speed. It is a nice median between health and damage.\nSo overall, thank you Riot for the juggernaut items. They help tanks be effecient and do help to balance Olaf's issues.\nAnd thanks again for the info, Meddler! You learn something new everyday. :)","replies":[]}]},{"poster":"rG Thundrag","date":"2015-09-25T00:25:31.964+0000","up_votes":4,"down_votes":1,"body":"Considering Olaf is one of the best fighters in the game right now since the juggernaut items, He isn't in the dire need for any changes.","replies":[{"poster":"Jotunheimr","date":"2015-09-25T01:14:09.684+0000","up_votes":1,"down_votes":0,"body":"Oh snap! Idk why I have not tried that yet. Ill try rushing titanic, sterakks, and DMP. Ive used dmp on hom, its nice. Thanks! It sounds like it'd do well and solve problems.\n\nThink about it: rush titanic. That's nice health, and damage AoE to improve waveclear early. Next, I'm thinking Sterakks, for the attack boost, hp to add to titanic, and the extra bonus with damage taken would help w out. Than DMP adds more tank, still adding to titanic.. While giving a little more damage with momentum. It sounds viable. I'm thinking after that, bloodthirster, some armor pen(or another lifesteal item to add to w), and than either randuin's or warmogs.\n\nI\"ll try this later and see how it goes:\nTitanic\nSteraks\nDead Mans\nBoRK\nBloodthirster\nNonja Tabi/Warmogs/Randuins.\n\nHas anyone built like this? If so, how is it?","replies":[{"poster":"rG Thundrag","date":"2015-09-25T03:04:12.610+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=jotunhelm,realm=NA,application-id=3ErqAdtq,discussion-id=IlrEl4wu,comment-id=00010000,timestamp=2015-09-25T01:14:09.684+0000)\n>\n> Oh snap! Idk why I have not tried that yet. Ill try rushing titanic, sterakks, and DMP. Ive used dmp on hom, its nice. Thanks! It sounds like it'd do well and solve problems.\n> \n> Think about it: rush titanic. That's nice health, and damage AoE to improve waveclear early. Next, I'm thinking Sterakks, for the attack boost, hp to add to titanic, and the extra bonus with damage taken would help w out. Than DMP adds more tank, still adding to titanic.. While giving a little more damage with momentum. It sounds viable. I'm thinking after that, bloodthirster, some armor pen(or another lifesteal item to add to w), and than either randuin's or warmogs.\n> \n> I\"ll try this later and see how it goes:\n> Titanic\n> Steraks\n> Dead Mans\n> BoRK\n> Bloodthirster\n> Nonja Tabi/Warmogs/Randuins.\n> \n> Has anyone built like this? If so, how is it?\n\nYou can just go like BC/Titanic/Deadmans all that lifesteal isn't required","replies":[{"poster":"Jotunheimr","date":"2015-09-25T03:34:26.030+0000","up_votes":1,"down_votes":0,"body":"I used to rush cleaver for the health, cdr, AD, and armor pen it gives. It's neen awhile tho.\n\nHonestly, I build life steal necause I tend to get doubles and triples. I just wail on them as much as I can of they are all low enough, hit multiple people with the axe or if they run axe them(gotta have good aim tho or you waste mana). I've even gotten some quadras in blind, it's halarious, really. \n\nLike, I'll get a double, have only a little health, the jungler comes to take me out, I flip heal, throw the axe, flip ghost for gap closer, spam e and q, activate w and wakl on the enemy. Ghost lets me stick to them if they are fast. It helps a lot with Olaf's low mobility without ult. Than boom, hello triplekill. I tend to walk away with more health afterwards because I built so much AD and lifesteal, plus lifesteal quints.\n\nAlthough it isn't like that at all in ranked. I think the tankier build we have been discussing here will be MUCH more viable in ranked.","replies":[]}]}]}]},{"poster":"warpenguin555","date":"2015-09-25T14:59:33.066+0000","up_votes":1,"down_votes":0,"body":"im gonna say no. while he really isnt that good, he can be a massive pain when ahead","replies":[{"poster":"Jotunheimr","date":"2015-09-25T16:52:19.898+0000","up_votes":2,"down_votes":0,"body":"True, but any champ is a pain when fed.","replies":[]}]},{"poster":"YoloYordle333","date":"2015-09-25T00:04:38.843+0000","up_votes":2,"down_votes":0,"body":"i think if his mana costs were lowered a bit he would be good,but i dont think he really needs increased damage.","replies":[{"poster":"Jotunheimr","date":"2015-09-25T00:22:37.302+0000","up_votes":1,"down_votes":0,"body":"Yeah, I agree, no offensive buffs. A defensive buff during ulti would be nice to keep him from being bursted into oblivion","replies":[]}]}]}