{"poster":"ing0zm0de","date":"2018-03-19T17:33:13.649+0000","title":"Hiba a kliensemben","subforum":"Segítség és támogatás","up_votes":2,"down_votes":0,"body":"Sziasztok,Id&eacute;zők!\r\nSeg&iacute;ts&eacute;geteket szeretn&eacute;m k&eacute;rni abban ami t&ouml;rt&eacute;nt velem ebben a napban mikor bel&eacute;ptem a kliensbe.\r\nElősz&ouml;r is: A j&aacute;t&eacute;kba mikor bel&eacute;ptem, pontosabban a kliensbe, elind&iacute;tottam a meccsem mivel ma &uacute;jratelep&iacute;tettem, majd ezut&aacute;n pickeltem hőst, a csapat is, majd mielőtt a t&ouml;ltők&eacute;pernyő megjelenne, (meg sem pr&oacute;b&aacute;lt jelenni) hirtelen a lol ki&iacute;rja hogy a &quot;j&aacute;t&eacute;k folyamatban van...&quot; &eacute;s csak a visszacsatlakoz&aacute;s gomb van előttem.\r\nR&aacute;megyek, &eacute;s megint mielőtt a t&ouml;ltők&eacute;pernyőbe bedobna, megjelenik megint a visszacsatlakoz&aacute;s\r\nR&aacute;mentem 15-sz&ouml;r, &eacute;s semmi\r\nSeg&iacute;ts&eacute;g, k&eacute;rlek titeket seg&iacute;tsetek.","replies":[{"poster":"VincentPapa","date":"2018-03-26T04:19:28.768+0000","up_votes":1,"down_votes":0,"body":"Ugyan ez nekem is és még mellé egyből jött a 20 perc büntetés a AFK miatt!!\n\n**Garutlálok ehez a csodás frissítéshez!!**\n\nEzelőtt 1 Dump file error jött ki egy ablakban, de azt ki tudtam küszöbölni ugy hogy vagy nem zártam be az ablakot vagy amikor pont letelt a hős választás akkor zártam be és indul újra a lol magától. utána 2-3 játékig jó volt, utána megint jött. {{sticker:sg-lux-2}} ","replies":[]},{"poster":"ing0zm0de","date":"2018-03-20T13:38:45.707+0000","up_votes":1,"down_votes":0,"body":"Azóta megoldódott, köszi a segÍtséget!","replies":[]},{"poster":"Dorfire","date":"2018-03-20T12:42:51.321+0000","up_votes":1,"down_votes":0,"body":"Hali! \n\nUgyanez a hibám nekem is, illetve, eleinte visszacsatlakozás volt, azóta \"statisztika kihagyása\" menüt dob be hősválasztás végén az idő lejártakor. Ezen semmi más nem segít csak gépújraindítás. Gépújraindítás után is bebugol néha a lol, és directx problémát dob ki, azzal ne foglalkozz. Ilyenkor viszont néha elég csak a játékot bezárni és újraindítani, ha mégse, akkor megint gépresi. Jómagam felvettem már többször is a Supportokkal a kapcsolatot, és jóformán minden létező hibát kilőttünk a gépen. Semmilyen háttérben futó programhoz, tűzfalhoz, avasthoz, net DNS-hez, vagy TCP/IP verzióhoz nincsen köze. A lol 4-es verzióval működik, így a 6-os nálam le lett tiltva, de nem segített. Csináltam tracert tesztet is, mely a netszolgáltató és a lol szerver közti adatcsomagok mozgását ellenőrzi, itt volt hiba, némely csomagok elakadnak. Viszont barátnőm is ebben a helyi hálózatban játszik mellettem, neki nem volt ilyen még, meccs közben volt 1-2x végleges kifagyása, de az ping miatt. Én jelen pillanatban csak modemről nyomatom a gépem, lefuttatom a tesztet is megint, gondolom így is rossz lesz, és megzaklatom a netszolgáltatót. De szkeptikus vagyok, hogy szervergondról lesz itt szó, mely esetenként 1-1 felhasználót érint, mintsem más problémáról. Évek óta nem volt gondom, ez 2 hónapja jelentkezett, azóta hol napokig jó, hol egy nap többször is rossz. Mindenesetre neked lehet tényleg csak valami hálózati gond lesz, próbáld meg a teljes újraindítást, mindent leáramtalanítani (gépek modem router), majd indítsd újra. Aztán ha megint van gond, akkor mindent sorba véve lődd ki a hibaforrásokat. Végső soron szolgáltatóhoz telefon, ha kell. De lehet érdemes lenne neked is supporttal felvenni a kapcsolatot, esetleg neked is egy tracert tesztet lefuttatni, abból kiderül, a netkapcsolat jó-e. \n\nRemélem tudtam valamit segíteni. \n\nÜdv, Dorfire!","replies":[]},{"poster":"Shikaichi","date":"2018-03-19T18:44:24.759+0000","up_votes":1,"down_votes":0,"body":"[Ide ](https://support.riotgames.com/hc/hu/requests/new)írj, ők jobban tudnak ebben segíteni!","replies":[]}]}