{"poster":"Honest Neos","date":"2018-01-12T07:11:30.431+0000","title":"I don't get it","subforum":"Gameplay","up_votes":13,"down_votes":3,"body":"Uh, I don&#039; know  I read the boards a LOT and it seems like the only stuff riot seems to reply to are things that aren&#039;t even remotely relevant to the huge issues players are concerned with this upcoming season. Literally posts with 6.2 k views, hundreds of upvotes but they still don&#039;t get anything. Even in the patch chat playtest thingy, I&#039;m barely seeing any rioters actually address posts that have very valid points and arguments about the upcoming changes, like do they just not want to admit they&#039;re wrong? or are they intentionally ignoring them? Don&#039;t know what to say? \r\nI&#039;m not trying to critisize riot or anything, just an observation I made, and it just doesn&#039;t seem fair that making a post about what kind of haircut should I get has a better chance of getting their attention then my concerns about where the game that people have invested a lot of time and money into is going.","replies":[{"poster":"o brigid o","date":"2018-01-12T15:21:44.656+0000","up_votes":4,"down_votes":0,"body":"This has already been addressed on a recent thread... One with riot responses.\n\nThere are a lot of reasons, including but not limited to:\n- things regarding the game are often in flux, if a rioter comments and then things change or turn out different, the butthurt outcry from the community would be ridiculous\n\n- it's really hard for any single rioter to comment on behalf of the entire company's official stance on something\n\n- not every rioter spends a lot of time on the boards, and the ones who do aren't always the right one to address specific concerns\n\n- but they are members of the community just like us and sometimes they want to participate in fun/less intense topocs\n\n- plenty other reasons too... Feel free to search for the other thread with the red tracker","replies":[]},{"poster":"Chromatic Eagle","date":"2018-01-12T16:30:34.251+0000","up_votes":2,"down_votes":0,"body":"They usually read, but it's not their job to answer. Sometimes they don't have an answer, or gave one but players expect them to change their minds.","replies":[]},{"poster":"Kairoptra","date":"2018-01-12T13:32:01.899+0000","up_votes":4,"down_votes":2,"body":"Why should they? All they do is get insulted. No, I don't mean criticized, I mean they have been flat-out called names, had their intelligence insulted, and even called to be FIRED. Why on Earth would they respond? What kind of example are they setting by doing that? By responding to these posts, they are in no way encouraging calm and polite conversation/debate, but are basically saying \"you can be as rude as you want to\". I'm not saying that their complaints aren't justified, but it's not that hard to keep a post from getting heated.","replies":[{"poster":"Karunamon","date":"2018-01-12T15:13:27.262+0000","up_votes":2,"down_votes":3,"body":">Why on Earth would they respond?\n\nBecause those posts are a minority? Because even the well-thought-out and detailed posts are, for the most part, ignored?","replies":[{"poster":"Kairoptra","date":"2018-01-12T17:02:02.573+0000","up_votes":2,"down_votes":1,"body":"“a minority”? Have you EVER been on the Boards? At least half of the posts on the Boards front page at any given time are criticizing Riot in a very insulting way, i. e. using foul language, sarcasm, satire, or otherwise being just plain rude. Very rarely do I see a post that calmly voices a concern and tries to be polite in its criticism. Of course Riot a lot of the time doesn’t get around to reading these gems because they fall by the wayside and are drowned out by the sea of circle-jerks and Riot is Evil™ posts.","replies":[]}]}]},{"poster":"TehNACHO","date":"2018-01-12T07:31:12.470+0000","up_votes":3,"down_votes":2,"body":"Honestly, Gameplay is a meme at this point if we're going to even try to discuss balance or game design.","replies":[{"poster":"Honest Neos","date":"2018-01-12T07:40:59.701+0000","up_votes":2,"down_votes":1,"body":"Oh snap I thought this was general discussion, oops lol","replies":[{"poster":"Jikker","date":"2018-01-12T18:02:09.381+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AngelThegay,realm=NA,application-id=3ErqAdtq,discussion-id=TQ31Rnnm,comment-id=00000000,timestamp=2018-01-12T07:40:59.701+0000)\n>\n> Oh snap I thought this was general discussion, oops lol\n\nYeah, this thread doesn't really belong in Gameplay so I'm going to go ahead and lock it.  You can go ahead and recreate this thread in General Discussion if you'd like.\n\nRioters are very busy so often they don't comment on the Boards.  I know in the past that they have said before that even if they don't comment, they will read threads so just because there isn't a fist next to a thread probably doesn't mean they haven't seen it.  I don't know for certain, but it's what I know from what I've heard in the past.\n\nThanks\n\n{{sticker:poppy-wink}}","replies":[]}]},{"poster":"Penns","date":"2018-01-12T08:58:48.092+0000","up_votes":1,"down_votes":1,"body":"Ye because people dont wamt fizz reverted lel","replies":[]}]},{"poster":"Peritheus","date":"2018-01-12T07:43:30.351+0000","up_votes":3,"down_votes":3,"body":"Yes, you're right, they are stubborn to admit that they were wrong, and don't like losing face. Nobody does really unless they're  kind, humble martyr.\n\nAfter trying to defuse the situations of such changes and call out posts, they stopped, and ignored it, y? because they got downvoted to oblivion for lawyer robot talk copy paste answers that were awfully responded with disappointmenting hatred for their unsympathetic patheticly worded less than 1 min answers.\n\nKeep the fro if you confident you can pull off the groovy vibe back in 60s-70s and keeping it conditioned, clean, have a pick in there you know while giving a winky smile if you have the shiny clean teeth/grill kind of laugh and also barely anyone you know or seen has a fro,\n\nIf none of those factors are in there then you can get a haircut, make your forced haircut pals less jealous/more understanding of you that it's not about the fro, but more of what you make up for it/seen as in the eyes of the beholder view. that is if it's hilariously bad like someone chopped it with a lawnmower and left crop markings in there.","replies":[{"poster":"Honest Neos","date":"2018-01-12T08:40:04.674+0000","up_votes":2,"down_votes":1,"body":"I do actually notice how lazy their comments are sometimes, the argument people use sometime's is the fact that 70% of everything on here is just complaining about what they don't like and are very rude about it. I get that, to an extent, sure some posts on here are pretty direct/not so formal about their complaint but that just emphasizes the frustration players have with the decisions that are being made, and just because maybe they used one or two insults in their post doesn't justify the fact that a rioter can't spare just 4 seconds to write 3 words in response, that's the point of even having this place, we tell you what we don't like and why, you reply, we're not asking to make everything we say a thing. \n\nIdk, I feel like if a post has a certain amount of upvotes or something, if not already done, a rioter should be assigned to reply to it. I'm not sure if riot realizes how much more communication with us would actually benefit them, the game, and their relationship with the community.","replies":[{"poster":"Peritheus","date":"2018-01-12T10:30:50.296+0000","up_votes":2,"down_votes":1,"body":"Yeah, it used to never be like this, we used to go hand in hand, the community and rioters back in the day were chill, working together making the game a better place as we did cool things for them to see and they did cool things back, bantering small trash talk was ok, everyone practically knew eachother cause it was a short population and like majority were in a good, sociable, creative mood, as it was quite wacky.bizarre with the lore and champs and design, that is until...\n\nTime and a bigger population swept the game, the game was growing too popular, making good amounts of money, like they a billionaire gaming corp,The good and sociable people they loved to chat with that made rational good points, were just drowned out by the toxic cesspool of angry complaints where many of the rarity where drifted a far from the forever brewing storm, only a few remain till there is none. In response to this, angered by how many were praising them and as soon as they make mistake turn the tables on them, they were forced to rule with an iron fist, under a cute, soft kitten glove., in fact if you look at the player behavior boards while not signed in and click as many as times as you look on click more, you're not going to barely findanything below -1 really just 100s of green, barely any blues nor reds, to hide whats going on really behind the scenes.","replies":[]}]}]}]}