{"poster":"JefferyCuddles","date":"2015-01-07T12:46:48.287+0000","title":"The Fate of Kassadin's Daughter","subforum":"Miscellaneous","embed":{"description":"Bob Nashahago reporting from Kalamanda Village An earthquake rocked the village of Kalamanda yesterday evening, causing the collapse of a mithril mine and trapping twelve Demacian miners underground. Rescue efforts began shortly after the mine caved in, though no announcement of progress has been made by the village.","url":"http://leagueoflegends.wikia.com/wiki/The_Journal_of_Justice:_Volume_1,_Issue_14","image":"/api/embedly/1/image/resize?url=http://img2.wikia.nocookie.net/__cb20100715234714/leagueoflegends/images/7/76/JoJ_Bob1.jpg&key=a45e967db0914c7fb472fd4381e6c85b&width=425"},"up_votes":2,"down_votes":0,"body":"Ok so i really love The Journal of justice wish riot would continue with them but i decided to write this because I interested about the fate of Kassadin's daughter because it states that she is trapped in the Void and not deceased. This includes my own version of the Void and i don't know what to name Kassadin's daughter (suggestions welcomed). This is only a prologue.\r\n\r\nAs Kassadin scoured the filth that was the streets of Zaun as he sought after the location of the cult of the void after they kidnapped his daughter.  As Kassadin finally found the Cult of the Void six mages surrounding his daughter and the one Kassadin hates most hidden under purple hoods, Kassadin didn't care for those grunts all he wanted was his daughter and to purge the man who hovered above his daughter the only man to not look like the rest in the sacrificial circle. Kassadin approached the circle without any thought the circle pulsed again and Kassadin heard a scream of pain from the circle he voiced his demands to Malzahar and his cursed cult “Malzahar! Get away from her! She is not yours!” The Prophet of the Void looking up from his sacrificial victim saw the man he was seeking, The Void Walker another like him a survivor of the Void making a simple offer “Brother! Enlightened Walker of the Path! Join us!” The rage built in Kassadin as he felt insulted that such an offer after the transgression of stealing his daughter a rage filled reply was all that was said “Don’t patronize me, mage! You threaten the balance! Let her go!” Kassadin fired a null sphere in his rage, towards Malzahar in an attempt to end him and save his daughter when the sphere collided with the Malzahar's dagger. Another pulse sound and the scream of his daughter than a small violent explosion of purple ripped open space pulling Kassadin's daughter into the Void and drove Zaun into pitch black night with only the stars and moon gifting the city with little light. Kassadin's rage turned to dread as he saw only Malzahar in the circle where his enemy and his daughter once was, Kassadin now fallen to his knees hear the voice of the he wishes to kill mock him for his actions “See what you’ve done! This is your doing!” Kassadin feared the worst for his daughter knowing what happened to her is his fault giving a roar of defiance to the moon and stars “No!” Kassadin now hearing the the rush of foot steps he now quickly fled the place where his daughter went missing swear that he will hunt down Malzahar and his cult.\r\n\r\nThe pain Kassadin's daughter felt through her body as she opened her eyes dulled her body she felt like she was unable to move all she could see was a cave wall the was featureless not a crack or any sign of weathering she wished to know where she is. after what felt like hours she could finally arise being able to move once again she noticed what she lie upon a stone slab, while the wall around her was a black marble but is was blank unlike the black marble she had seen as she got off the stone slab what she felt was like sand only much like the cave wall it was black she had never seen anything like it. She needed to know where she was so she looked around the cave to try and find an exit, she found a light a way out she as she emerged it was a small ledge. Was it night the sky was blanked by stars and a small moon drifting across the sky it was beautiful looking below the ledge she saw a forest of fungus like foliage emitting various shades of dull purple. what beauty was displayed below her it was shocking, but the question still ate at the back of her mind where was she.","replies":[{"poster":"GoldenTomat0","date":"2015-01-07T12:54:51.625+0000","up_votes":1,"down_votes":1,"body":"u kno she ded.","replies":[{"poster":"Mid Dumbledore","date":"2015-01-11T08:47:15.340+0000","up_votes":1,"down_votes":0,"body":"Reincarnation doe","replies":[]}]},{"poster":"Divadodo","date":"2015-01-08T00:49:24.744+0000","up_votes":1,"down_votes":1,"body":"she turned into rek sai\n","replies":[]}]}