{"poster":"SpitOnNoobs","date":"2018-06-26T05:44:10.099+0000","title":"Fizz Rework in patch 8.14","subforum":"Gameplay","embed":{"description":"Fizz New W - All Skins Classic Fizz , Cottontail Fizz , Super Galaxy Fizz , Omega Squad Fizz , Void Fizz , Atlantean Fizz , Tundra Fizz , Fisherman Fizz ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬ Thanks for Watching , See You next time :) ▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬","url":"https://www.youtube.com/watch?v=UTO_4fgcJW8","image":"https://i.ytimg.com/vi/UTO_4fgcJW8/hqdefault.jpg"},"up_votes":4,"down_votes":1,"body":"Hi all,\r\n\r\nThis post is directed towards Rioters and the community.\r\nWhy is Fizz being reworked? He is currently in such a good spot. Fizz has a high skill cap - he isn&#039;t hard to pick up, but he is very hard to master. Me, and my fellow fizz mains (aka people who actually play the champion a lot AND understand how the game works at a high level) agree on the fact that Fizz, in his current state, does not need to be changed. Currently, Fizz is not played often in plat 1 and higher elos. There are only some one tricks who play Fizz, and they all agree that Fizz is in a good spot. Which prompts the question, why is this rework even happening? In fact, many Fizz onetricks (myself included) own multiple accounts, with Fizz as their most played champion. Do not mistake this for Fizz being a popular champion. \r\n\r\nNow I would like to discuss the changes. Firstly, you are removing the mark which shows the passive being active. Why? All it does is make it easier for people to see when their w gets ready to be cast again. To me, it feels like a completely unnecessary nerf. Second, you are removing the cooldown reduction when killing any unit with the W active. Currently, the only reason that Fizz is even REMOTELY strong, is that the w can be used in lane to last hit minions. The reason that this was implemented in the first place, was to make it easier to cs against hard ranged matchups! So why do you find to need to remove this mechanic from the game now? This change specifically will hard nerf Fizz&#039;s laning power. Lastly, it appears that the w is no longer an auto attack reset? In the video that I linked, the animation of w goes at the regular auto attack speed. If this is the case, it is another nerf. These are all nerfs; I don&#039;t think Fizz is op; so why nerf?\r\n\r\nI see people on youtube already making videos about this mini rework. They all think that it is op - yet those people do not play Fizz. My fear is that you guys are going to nerf Fizz again, just because people are crying that Fizz is op. Please do not go through with this change. Fizz is already balanced, and is in a very good spot. I would really like it if you guys reached out to some Fizz players and ask them their opinions about these changes. I am always available to chat (you have my email), and I am sure than other Fizz players would be up for it as well. I hear that this is being tested in PBE - but as I am sure you all know, PBE is filled with noobs. They do not know what they are talking about. IF there is any way that \r\n\r\nThanks for your time,\r\n\r\n- Passionate Fizz Player","replies":[{"poster":"Cursedlia","date":"2018-06-26T22:38:56.797+0000","up_votes":8,"down_votes":1,"body":"RIOT R U FOR REAL? U R TRYING TO MAKE THIS GAME BETTER CUZ U KNOW ITS DYING AND YET U R MAKING IT EVEN WORSE!!!!!!! I have 1 million points on Fizz in total (including all my accounts) and i'm in Diamond elo. Fizz is a very hard to master pick, ( EVEN ACCORDING TO https://rankedboost.com/lol-tier-list-solo-queue/ ) IT JUST HAPPENS TO BE AN ASSASSIN and ppl HAVE NOOOO experience w/ Fizz and don't know how this champ actually works ( THE STRUGGLE IN FARMING AFTER ALL THIS MAGE AND AD ASSASSINS BUFFS AND U R ACTUALLY TAKING AWAY HIS W RESET AND REDUCING THE MANA REFUND???? ) FIZZ AFTER ALL THIS PATCHES ISN'T EVEN PLAYLABLE IN HIGH ELO ANYMORE! Especially after the plus 20 AP in \"Lost Chapter\" FIZZ WAS ALREADY PUT IN A WEAK SPOT! Its an item that u don't build on Fizz and u kept putting him on a weak spot patch after patch. DO U EVEN READ THE BOARDS RIOT????! U R RUINING THIS GAME by listening to ppl who are in Bronze-Gold elo that just don't know the match up, they DON'T HAVE the experience to JUDGE whether a pick (champ) is broken OR NOT! Cancel this Fizz rework I'M BEGGING U. I will not ask for a buff since the \"riot champion balance team\" is PATHETIC!!! At least if u insist on nerfing him, PLEASE give him back his W reset and BUFF his E by reducing the CD in early game by at least 1-2 secs and its mana cost!","replies":[{"poster":"Alex Gunboy","date":"2018-07-18T22:18:50.463+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nami WinkedAt Me,realm=EUNE,application-id=3ErqAdtq,discussion-id=kFIN8YPV,comment-id=0003,timestamp=2018-06-26T22:38:56.797+0000)\n>\n> RIOT R U FOR REAL? U R TRYING TO MAKE THIS GAME BETTER CUZ U KNOW ITS DYING AND YET U R MAKING IT EVEN WORSE!!!!!!! I have 1 million points on Fizz in total (including all my accounts) and i&#x27;m in Diamond elo. Fizz is a very hard to master pick, ( EVEN ACCORDING TO https://rankedboost.com/lol-tier-list-solo-queue/ ) IT JUST HAPPENS TO BE AN ASSASSIN and ppl HAVE NOOOO experience w/ Fizz and don&#x27;t know how this champ actually works ( THE STRUGGLE IN FARMING AFTER ALL THIS MAGE AND AD ASSASSINS BUFFS AND U R ACTUALLY TAKING AWAY HIS W RESET AND REDUCING THE MANA REFUND???? ) FIZZ AFTER ALL THIS PATCHES ISN&#x27;T EVEN PLAYLABLE IN HIGH ELO ANYMORE! Especially after the plus 20 AP in &quot;Lost Chapter&quot; FIZZ WAS ALREADY PUT IN A WEAK SPOT! Its an item that u don&#x27;t build on Fizz and u kept putting him on a weak spot patch after patch. DO U EVEN READ THE BOARDS RIOT????! U R RUINING THIS GAME by listening to ppl who are in Bronze-Gold elo that just don&#x27;t know the match up, they DON&#x27;T HAVE the experience to JUDGE whether a pick (champ) is broken OR NOT! Cancel this Fizz rework I&#x27;M BEGGING U. I will not ask for a buff since the &quot;riot champion balance team&quot; is PATHETIC!!! At least if u insist on nerfing him, PLEASE give him back his W reset and BUFF his E by reducing the CD in early game by at least 1-2 secs and its mana cost!\n\nI completely agree man.  This fucking sucks, even though i have far less points on him (about 200k) But still man he's my favorite game is tasteless without him. And they just fucked him up. Can't do shit with this fucking w too weak no burst. Fizz aint an assassin anymore.","replies":[{"poster":"evilmrcraft","date":"2018-08-14T18:21:05.939+0000","up_votes":1,"down_votes":0,"body":"I dont play league anymore, but as a 1 million fizz High plat player (when i was active), this patch looks terrible to me.","replies":[]}]}]},{"poster":"Patryk Ostarek","date":"2018-07-18T17:10:25.231+0000","up_votes":5,"down_votes":0,"body":"This is joke, fizz is unplayable now, Wp riot","replies":[]},{"poster":"99 Str Pure","date":"2018-07-18T20:52:51.922+0000","up_votes":4,"down_votes":0,"body":"I hate this rework. I liked the look and convenience of the passive. While we are earnest for nostalgia, I'm sure most fizz players got used to and are now comfortably with the passive bleed. I just played a game on 8.14, and honestly hate it. Riot is making me quit the game slowly.","replies":[]},{"poster":"Onlyoneblood","date":"2018-07-28T19:46:07.220+0000","up_votes":3,"down_votes":0,"body":"this rework is making me uninstall league. I hate it. fizz one trick player","replies":[]},{"poster":"huKazAmuRA","date":"2018-07-24T21:15:37.242+0000","up_votes":2,"down_votes":0,"body":"fizz is dead now.....:'(  thanks RIOT !!!!!!!!!!!  You spoiled the character who gave a lot of fun from the game.....I don't want to play in LOL ..:((((((((((((\n{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"UnreformedZoe","date":"2018-07-25T08:06:15.880+0000","up_votes":2,"down_votes":0,"body":"agree\ni should uninstall this game. they are ruining everything","replies":[]}]},{"poster":"zanz20","date":"2018-07-24T18:29:29.121+0000","up_votes":2,"down_votes":0,"body":"nice rework fizz is now useless+very hard to play because of this total nerf to w and also plz delete assassin role and make him combat only. these changes where perfect it fixed him but then a stupid total nerf rework","replies":[]},{"poster":"XXXTentãcion","date":"2018-07-18T15:19:37.781+0000","up_votes":2,"down_votes":0,"body":"AS AN ASSASIN WHYY WOULD YOU STAY 10 SECONDS MORE TO PUT AA DUE TO THE NEW Z PASSIVE ? NO SENSE PLZ CANCEL THIS REWORK","replies":[]},{"poster":"lnfect","date":"2018-06-27T15:22:20.774+0000","up_votes":1,"down_votes":4,"body":"Holy shit shut the fk up. Back to normal fizz is better. This current state of fizz sucks","replies":[{"poster":"Twilight Akali","date":"2018-07-21T05:56:17.096+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=lnfect,realm=EUW,application-id=3ErqAdtq,discussion-id=kFIN8YPV,comment-id=0004,timestamp=2018-06-27T15:22:20.774+0000)\n>\n> Holy shit shut the fk up. Back to normal fizz is better. This current state of fizz sucks\n\nhow is it better? changing him to bruiser again? making him a 50% garbage and 50% win top lane and still lose? just git gud if you hate him so much","replies":[]}]},{"poster":"Tendy je toxic","date":"2018-10-23T14:29:16.736+0000","up_votes":1,"down_votes":0,"body":"LMAO NICE REWORK RIOT 0IQ","replies":[]},{"poster":"ChickenDawg","date":"2018-07-19T00:17:34.469+0000","up_votes":1,"down_votes":0,"body":"Plat 1 fizz one trick here and I'm completely disgusted with this rework the charge up of his w never impacted me because it was never hard to proc it with proper play and positioning especially on a champion as mobile as fizz I hated the original fizz w which is what this is his original w and if the auto reset is being removed from the w this is a total nerf plis rito don't do it!","replies":[{"poster":"Dumbledore Mid","date":"2018-07-24T11:10:00.710+0000","up_votes":1,"down_votes":0,"body":"Same, but Plat 5. They finally discovered a method to destroy all Fizz mains for noobs who doesn't know how to play against him, that's some serious BS right there. First they did it to his deathfire grasp combo, then his reduced healing on W, later it was DMG on R, now this. RIP Fizz","replies":[]}]},{"poster":"Dumbledore Mid","date":"2018-07-24T11:06:45.218+0000","up_votes":1,"down_votes":0,"body":"Ok you removed my iconic ability, in return I want my reduced healing on W back, or I quit the game!!","replies":[]},{"poster":"SOMETIMES666666","date":"2018-07-23T17:30:18.751+0000","up_votes":1,"down_votes":0,"body":"RITOOOOOO ARE YOU DUMB FIREE THIS IDIOTT WHO REWORKED FIZZZ I CANT DO SHITT WITH THIS CHAMP HE IS ONE OF MY MOST PLAYABLE I HAVE AROUND 300K ONA LL ACC OR MORE WOOOTA FUKKK IS THIS HE CANT KILL WW HE CANT KILL ZED HE CANT KILL YASUO HE CANT KILL YI HE CANT KILL LUCIAN HE CANT KILLL NOBODY IDIOTTTS REWERT W AND DONT LISTEN TO TTAHT TRASH STREAMEERS STUPIDD DOG SHITT THAT DONT EVEN PLAY CHAMP STUPID AKALI MAIN HE IS TRASHH BUTT FACE HE IS IRELEVANT HE NEVER PLAYS FIZZZ CHAM IS CURENTLY USELES TO PLAY AND AKALI  KYSS TRASHHH TY","replies":[]},{"poster":"LonelyZMT","date":"2018-07-03T23:56:55.101+0000","up_votes":1,"down_votes":0,"body":"I do not play fizz at all but I have once. He is insanely good in lane especially after lvl6 and it can be annoying since tower dives are an issue all the time. Even as a ranged champ, denying fizz is near impossible. His w reset is too good for csing and I feel the rework is for more battling rather than csing. \nAs I may misunderstand the w rework, I think the 2nd cast can deal more damage to any champ than the first tagged, since there is no mark. This is better for fighting champs, if this is the case but worse for csing in lane. I do not see any issue with the update as I see no real major changes, op or weaker.","replies":[{"poster":"Twilight Akali","date":"2018-07-21T05:54:29.698+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LonelyZMT,realm=NA,application-id=3ErqAdtq,discussion-id=kFIN8YPV,comment-id=0007,timestamp=2018-07-03T23:56:55.101+0000)\n>\n> I do not play fizz at all but I have once. He is insanely good in lane especially after lvl6 and it can be annoying since tower dives are an issue all the time. Even as a ranged champ, denying fizz is near impossible. His w reset is too good for csing and I feel the rework is for more battling rather than csing. \n> As I may misunderstand the w rework, I think the 2nd cast can deal more damage to any champ than the first tagged, since there is no mark. This is better for fighting champs, if this is the case but worse for csing in lane. I do not see any issue with the update as I see no real major changes, op or weaker.\n\nyou dont understand that other champs will destroy him even with this W? you must hit a lot and the point of fizz is quick bursts you doodlehead ._.","replies":[]}]},{"poster":"rudycm","date":"2018-07-20T14:09:17.517+0000","up_votes":1,"down_votes":0,"body":"Oh, wow....they screwed up big time this time.\nAs for today Fizz's winrate went down 3.1% to 47.3%. He is the 16th worst champion (win rate) right now. This is pretty bad.\nI main Fizz and I wish I could get the money back from the skins that I bought. I'm not playing him for a while (and probably playing way less League now). This sucks.","replies":[]},{"poster":"zzepicfacezz","date":"2018-07-17T04:16:10.804+0000","up_votes":1,"down_votes":0,"body":"I have been playing Fizz in many accounts and Fizz is perfectly balance as it is.\nI don't see the point of making fizz W having stacks.\n(REASON) Fizz is reasonbly squishy as you have to pick when to go and when not to for high rewards.\nWhy make fizz stay in fight for his second W? Fizz will die before Fizz can actually do anything. Fizz is simply not a sustain fighter where Fizz stay in long fight. Fizz only possible escape is his E so Fizz won't instantly die after Fizz does Fizz's combo.\nNot to the mention Fizz \"only\" lost more than half of Fizz's health just for the combo.\n\nWhy ARE YOUR TURNNING NONSUSTAINABLE ASSASSIN INTO FIGHTERS?\n\nIn higher elo Fizz isn't even as good of a laner since there are many Ap champions that actually have some sort of sustain or shield, let's not forget champions have better escape abilities then Fizz does.\nTalking about \"Balance\"  Riot Champion Balance team is pathetic.\n\nOnly possibilities I can see for this W to have a second stacks is if Fizz gain a shield or have some sustain in fight. Which completely change fizz's kit of \" Ap quick burst\"?","replies":[]},{"poster":"GrizzlyKumas","date":"2018-07-16T23:20:42.187+0000","up_votes":1,"down_votes":0,"body":"Holy shit I'm pissed, anyone that thinks this is a \"buff\" obviously has never played fizz. This is a complete nerf to my favorite champion Riot don't put this trash Fat nerf on my champion he isn't even S tier the good thing about fizz is he has high damage up close but very low hp giving a lot of risk and reward when choosing how to go into a fight this rework takes away a lot of his damage for learning and team fights due to the fact that he cant mark targets anymore.\n{{champion:105}}","replies":[]},{"poster":"iPwn","date":"2018-07-07T17:55:16.059+0000","up_votes":1,"down_votes":0,"body":"Where is the W auto reset after 1 sec to champs? If you don't include this, and even then it's a sketchy \"buff\", Fizz is going to be dumpster tier when hes already in a good spot. Fizz isnt a sustain fighter, why would he want to just AA, when he'll get murdered? You want to poke then all in with the W executioners magic Crit.\n\nPlease Riot you wouldn't respond after two years with the Fizz + Blitz bug (  https://boards.na.leagueoflegends.com/en/c/bug-report/6EcNwMg3-fizz-e-trickster-and-blitz-e-bug ) please listen to your audience for once.\n\nSincerely,\n\nA 1 million mastery Fizz \"One Trick\"","replies":[]},{"poster":"Fizzorithm","date":"2018-07-02T21:40:24.065+0000","up_votes":1,"down_votes":0,"body":"Obviously the current Fizz isn't bad, but many players wish for the old Fizz, like Season 2 Fizz, to return. The majority of Fizz players prefer the old W, so Riot is trying to create something similar but not the exact same. The reason why Fizz players testing on the PBE feel that this new W is bad is because Riot directly stated they made the numbers smaller than they should be, so they could tune them later. However, with some increased base damages and ratios, the new W will be much stronger than the original, because it allows Fizz to actually fight after using up all his abilities. \nAlthough Fizz is in a good state, he lacks the sustain/escapes of other assassins such as Zed or Leblanc. Many players tend to think that Fizz's E is his \"get out of jail free\" card, but it's on an 8 second cooldown late game, and Fizz needs it for damage. This way, with the new W, instead of dealing massive damage immediately, Fizz still deals decent damage and has something else to do while he waits for his other abilities to come up.\nIn addition, Fizz's new W gives him \"more value\"; by wanting to have the second part of the W, Fizz can now use maximum damage with the first part of his W without having to wait 2 seconds. \nAlso I posted this kinda late so possibly I am arguing against the wrong information... you are referring to the one where he presses W then gets empowered auto attacks if target doesn't die, right? omegalol","replies":[]},{"poster":"In A Splash","date":"2018-06-27T17:02:55.040+0000","up_votes":1,"down_votes":0,"body":"Every time I log into PBE the fizz rework is not there. Is it out or not?","replies":[]},{"poster":"Shuumi","date":"2018-06-26T15:50:42.224+0000","up_votes":1,"down_votes":0,"body":"Literally, looking at the skill changeups,\nThe reason this is happening is due to ritos philosiphy of \"A more inclusive playstyle\"\nMeaning, no more just like, 1-2, stand there and auto or just spam skills as fast as you can.\nI assume this 'rework' is happening for that reason and that reason alone, plus perhaps the fact that rito wants to nerf out any form of sustain/wave clear.\n\nI dont see it affecting his gameplay much. Other champs have also taken the nerfstick to sustain items/builds.\nNo gameplay change will happen that matters, his still gona have the same str/weaknesses.\n\nI also see this kit change as a nudge towards forcing players into Lichbane type builds.","replies":[]},{"poster":"Twilight Akali","date":"2018-07-21T05:45:06.565+0000","up_votes":1,"down_votes":1,"body":"You have a VERY good point. All they did is bring back old fizz with nerfs\n<3 {{champion:105}} {{item:3089}} {{item:3100}} {{item:3152}}","replies":[]},{"poster":"Trixsta","date":"2018-06-26T10:54:26.047+0000","up_votes":1,"down_votes":1,"body":"In high elo D2+ hes pretty weak. Gets bullied too hard in lane. hes in a good spot around low elo d5 and below because he hardly gets punished. \n\nFeel like these changes wont have any impact","replies":[]},{"poster":"Kelg","date":"2018-06-26T09:31:05.874+0000","up_votes":2,"down_votes":5,"body":"Make fizz more obnoxious ty riot","replies":[]}]}