{"poster":"ElOoOo44","date":"2017-03-23T16:29:29.975+0000","title":"SERVER GEWECHSELT AUSVERSEHEN WIE KANN ICH WIDER ZURÜCK NACH WEST EUROPA BIN AUF DEM RUSSISCHEN ?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"HILFE WIE KANN ICH WIDER ZUR&Uuml;CK VON DEM RUSSLAND SERVER ZU EUWEST ? DA GIBT ES EINE ANDERE W&Auml;RUNG UND CODES GIBT ES DA NICHT ZU KAUFEN WAS SOLL ICH MACHEN BITTE UM HILFE IST SCHON SEID L&Auml;NGEREM SO HILFE BITTE DRINGEND :(","replies":[{"poster":"Patter1991","date":"2017-03-23T16:34:11.793+0000","up_votes":4,"down_votes":0,"body":"Wie kann man bitte \"aus Versehen\" auf einen anderen Server wechseln? Dafür muss man viel zu viele Klicks durchführen und viel zu präzise sein, als dass das versehentlich geschieht.\nWende dich an den Support. Wird aber unter Garantie kostenpflichtig.","replies":[{"poster":"Coopa123","date":"2017-03-23T16:47:41.395+0000","up_votes":1,"down_votes":0,"body":"Oh phew. Ich hab immer umgerechnet 20€ in Rubel auf meinem Paypal account falls ich ausversehen 30 mal genau dahin daneben klicke wo es mich dann auf den russischen Server verfrachtet.\n\nvorsorge ist besser als nachsorge!","replies":[]},{"poster":"ElOoOo44","date":"2017-03-23T16:48:33.775+0000","up_votes":1,"down_votes":2,"body":"nein ich weis nicht recht letztes jahr konnte man für 1 rp auf den russichem server wechselt das habe ich auch gemacht wäre gerne wider zurück gegangen habe aber keine möglichkeit euros einzuzahlen !","replies":[]}]},{"poster":"Shadowscreen","date":"2017-03-23T16:39:26.311+0000","up_votes":2,"down_votes":0,"body":"Ist schon seit längerem so aber auf einmal dringend? hört sich ja an wie auf arbeit...","replies":[]},{"poster":"Megamaexx","date":"2017-03-23T16:41:49.992+0000","up_votes":1,"down_votes":0,"body":"Also erst einmal kaufe dir bitte eine neue Tastatur, deine Capslock-Taste ist nämlich kaputt.\nUnd hast du jetzt deinen Account oder deinen Client auf russisch gestellt?\nWenn es nur der Client ist, dann musst du (ich glaube im Launcher) wieder auf euw umstellen. \nUm deinen Account zu transferieren, musst du dir den Transfer kaufen. Hast du keine Rubel, dann kann dir der Support bestimmt auch für Euros dasselbe machen.","replies":[{"poster":"ElOoOo44","date":"2017-03-23T16:47:19.182+0000","up_votes":1,"down_votes":1,"body":"wo finde ich denn genau denn support ? da wo hilfe und support steht kann man ja niemand anschreiben ?","replies":[{"poster":"Megamaexx","date":"2017-03-23T17:37:29.101+0000","up_votes":1,"down_votes":0,"body":"Ganz oben oder ganz unten steht irgendwo “Unterstützung“ (auf dieser Website und jede andere Seite von League of Legends). Das ist der Link zum Support.\nDer leitet dich dann da hin:\n\nhttps://support.riotgames.com/hc/de","replies":[]}]}]}]}