{"poster":"DireRaven403","date":"2016-02-15T08:48:11.817+0000","title":"I Don't want to play league anymore but i cant stop","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"I have spent the past 4 years putting money into this game and learning the champ ect. But for the past year I have wanted to quit this game. Ive tried deleting it but i just find myself re-installing it later that day. I dont know if i have an addiction to this game or not but i need some advice. \r\nI just dont want to play anymore. Its boring as shit and its just not fun anymore.","replies":[{"poster":"Alfawarrior3","date":"2016-02-15T13:51:30.958+0000","up_votes":1,"down_votes":0,"body":"just uninstall tbh fam.\nit's not that hard. you just gotta have some self control.","replies":[]},{"poster":"DarkenedKnight","date":"2016-02-15T13:39:50.237+0000","up_votes":1,"down_votes":0,"body":"I have this problem alot haha, i'll be like\" I'm just gonna have a movie night\" or im gonna spend tonight catching up on all my tv shows! OR im gonna finally play  my new xbox games i got for christmas.. But everytime im like, \"oh ill have 1 league game first\"\n\nNek minute;\n20games later.","replies":[]},{"poster":"Hyde","date":"2016-02-15T10:44:27.427+0000","up_votes":1,"down_votes":0,"body":"I fully agree with BarryButcher, it would be a good Idea to find something that is as good or just as good as playing LoL... but hopefully more productive. ;) you got to go out and find something you wanna put your time into to make the transition easier, and if you like it enough, you might not even find it that hard at all. Another option is to play the game differently, I find it is a much more fun, less competitive game playing with friends, even something as simple as a main role change can change the game up in more ways than you think. But whatever you decide. Have fun and good luck!","replies":[]},{"poster":"TrashDonnut","date":"2016-02-15T10:13:35.435+0000","up_votes":1,"down_votes":0,"body":"Try and think of other things to do, especially go outside.","replies":[]},{"poster":"Monkey D Luffy","date":"2016-02-15T09:23:21.361+0000","up_votes":1,"down_votes":0,"body":"Telling yourself you can stop is the first step, otherwise you're just making excuses, you gotta stick with it... trust me you'll feel better.","replies":[]},{"poster":"BarryButcher","date":"2016-02-15T09:14:40.044+0000","up_votes":1,"down_votes":0,"body":"Can't just quit. If your the kind of person who gets addicted to games you need to find a suitable replacement.\n\nI myself used to play a tonne of FIFA/Halo/Minecraft before I found LoL. Now I play nothing but LoL. I don't get the urge to play other games but when I do, I find that I can go 4-5 days without even thinking about LoL.","replies":[]}]}