{"poster":"Ruphian","date":"2016-02-14T16:08:14.444+0000","title":"Porque se quejan de estos personajes?","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Siempre veo que la gente dice que riven, yasuo, darius, kata, zed y garen estan rotos, pero solo los ultimos dos superan el 50% de winrate, que tienen que sea tan frustrante jugar contra ellos cuando van ganando? Porque nadie se queja de talon que tiene mas winrate que ellos y si no me equivoco es el que mas rapido te mata? Lo unico que se me ocurre es que las skills de este campeon no son tan vistosas como las de los mencionados al principio.","replies":[{"poster":"Yazzy","date":"2016-02-14T16:22:49.332+0000","up_votes":4,"down_votes":0,"body":"El bajo winrate es porque al ser tan populares se utilizan mucho en elo bajo y se pierden muchísimas partidas con ellos, están rotos, NO son noobchamps!","replies":[{"poster":"Ride the tiger","date":"2016-02-14T17:26:48.737+0000","up_votes":1,"down_votes":2,"body":"No están rotos ninguno, bueno, mi querido Zed un poquito si :c. Y no son noobchamps, son destructores de noobs más bien.","replies":[{"poster":"Yazzy","date":"2016-02-14T20:23:06.699+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JunkTheCapper,realm=LAS,application-id=v7qsfXsE,discussion-id=HAG4x8rN,comment-id=00010000,timestamp=2016-02-14T17:26:48.737+0000)\n>\n> No están rotos ninguno, bueno, mi querido Zed un poquito si :c. Y no son noobchamps, son destructores de noobs más bien.\n\nPor eso, los noobs los usan y son horribles, por eso el bajo winrate. jajajaja","replies":[{"poster":"Ride the tiger","date":"2016-02-15T11:30:19.313+0000","up_votes":2,"down_votes":0,"body":"Pero aparte de eso, cualquiera que use esos champs mas o menos bien DESTRUYE noobs xD","replies":[{"poster":"Yazzy","date":"2016-02-15T16:20:26.041+0000","up_votes":1,"down_votes":0,"body":"Si, siempre me toca ver cómo flashean en medio de la ulti de zed en vez de hacerlo despues, o como lo chasean en vez de fijarse bien en su sombra. Lo mismo con LeBlanc jajajajajajajaja","replies":[]}]}]}]},{"poster":"Adheliøs","date":"2016-02-15T12:51:14.278+0000","up_votes":1,"down_votes":0,"body":"Exacto, y Talon no es un campeón popular por lo que en rankeds lo usan los que son mains, por aclarar el ejemplo que se dio ;)","replies":[{"poster":"Hoseook","date":"2016-02-16T19:46:28.697+0000","up_votes":1,"down_votes":0,"body":"quien te conoce main, lo use para counteriar a un veigar nada más y me saco la primera sangre JAJAJAJ (antes de que saliera el nuevo item:c)","replies":[{"poster":"Adheliøs","date":"2016-02-18T21:19:39.519+0000","up_votes":1,"down_votes":0,"body":"Talon es en mi opinión el mayor counter de Veigar, si te gana un veigar sos malisimo xD, osea te tira el stun, si logras quedarte en el medio esperas que se acerque a tirar su w y te mandas donde esta con la e, le metes todo el combo y chau veigar se queda sin habilidades para defenderse y sin reacción e_e","replies":[]}]}]}]},{"poster":"Hell Darking","date":"2016-02-14T16:28:46.640+0000","up_votes":3,"down_votes":0,"body":"Imagina que tienes un juego de peleas con 160 personajes para escojer y viene un amigo a jugar\ntu amigo todas las veces escoje al mismo personaje, luego de unas peleas es fome cierto?\npasa lo mismo con lol, hay no se cuantos champions para escojer y siempre sale riven, darius, yasuo top; zed, kata, yasuo mid.\nno hay otras combinaciones, son siempre los mismos","replies":[{"poster":"Pascut","date":"2016-02-15T16:32:56.812+0000","up_votes":1,"down_votes":0,"body":"Yo hace bastante que no veo katas :P","replies":[]},{"poster":"Ride the tiger","date":"2016-02-14T17:25:43.214+0000","up_votes":2,"down_votes":4,"body":"Se llama mainear. Si tanto te joden les haces counter y listo no?","replies":[{"poster":"Hell Darking","date":"2016-02-14T22:23:25.214+0000","up_votes":1,"down_votes":1,"body":"El problema no es ese, es super facil counterearlos.. el problema es que te toca almenos 1 de todos esos en las partidas no hay variedad entre jugadores.. todos usan los mismos porque tiene \"win rate\" mas alto, cuando es 100% mentira.","replies":[]}]}]},{"poster":"LaReinaPingüino","date":"2016-02-14T20:44:15.542+0000","up_votes":2,"down_votes":0,"body":"no se, yo no los encuentro rotos para nada, pero si odio que me toque una riven en mi equipo, creo que solo me han tocado rivens malas, pero en mi experiencia, no hacen  ningun aporte al equipo,\n\n\n> {{sticker:slayer-jinx-wink}}  Encuesta muy sensual acá: http://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/Vht9ZgZ5-jugar-lol-te-ha-convertido-en-un-cretino)","replies":[]},{"poster":"Galiers","date":"2016-02-14T17:33:15.590+0000","up_votes":3,"down_votes":1,"body":"por que no saben jugarles\n\nhay mucha gente que por ejemplo va {{champion:31}} y lo arman ap... en sus 2 primeras partidas revienta, pero luego le toca alguno de los campeones mencionados y como se armo ap con el daño explosivo lo bajan antes que el pueda meter daño y después llora que el camp esta roto","replies":[]},{"poster":"Benedict","date":"2016-02-14T17:27:26.197+0000","up_votes":2,"down_votes":1,"body":"Hola humildemente lo que creo que muchos se quejan por la impunidad que tienen para matar campeones como {{champion:55}}, {{champion:157}}  y {{champion:238}}, estos tres son los que tienen mas fácil fedearse en fase de líneas, sobre todo {{champion:157}}  que con {{item:3087}}  ya esta pegando muchísimo con su pasiva, a eso súmale el escudo que tiene, la movilidad, rango con la Q, un muro que bloquea skillshot, una ulti que puede agarrar a todo el team rival y encima hace sinergia con muchísimos campeones que tenga la capacidad de levantar campeones, (dígase {{champion:12}} ,{{champion:201}} , {{champion:31}})  y a esto súmale que por mas que no le valla muy bien en fase de líneas, puede volver a la partida farmeando hacerse un par de ítems y romperte la cara como si nunca le hubiera ido mal. Creo que es el que esta mas roto de todos estos personajes que nombras.\n\n {{champion:238}} si bien también es muy molesto, con su movilidad con las sombras, el rango de su Q y la marca, necesita mas ítems para que {{champion:157}} para hacer bien su trabajo, si bien tiene una buena fase de línea y a nivel seis puede ser muy molesto, se lo puede contrarrestar con {{summoner:1}}, {{item:3157}}, {{item:3139}}, {{item:3140}} y {{item:3222}}  denegándole muchísimo daño, en late pierde mucho de su efectividad si no va feed y si el equipo rival tiene alguno de  estos ítems o el {{summoner:1}}  se le complica hacer su trabajo por mas que ya tenga sus ítems core.\n\n {{champion:55}} tiene mucho daño un dash y una ulti super molesta pero es la mas vulnerable de los mid lane que nombras, cualquier stun, le impide hacer su trabajo y si wardeas bien tu jg le denegas la chance que venga a matarte y fedearse. Aparte de que depende mucho de la composición de su equipo para hacer bien su trabajo de asesina y si no hay nadie que le facilite su trabajo es muy probable que pierda efectividad en tf, mas que es un personaje que al tirarse se arriesga a morir. Realmente es la mas fácil de counter de los mid, pero bueno muchos no saben jugarle y es uno de los campeones que usan la gente de elo alto que se hicieron una cuenta smurf. \n\n {{champion:92}} es una  bestia en early, ,muchísima movilidad, daño, un escudo en base a su ad, pero pese a eso si le sacas un tanque como {{champion:58}} es fácil denegarle gran parte de su early y si no tiene un buen early cae mucho en late.\n\n{{champion:122}} y {{champion:86}} para mi no están rotos, quizás {{champion:122}} siga un poco fuerte por su pasiva, pero son personajes con poca movilidad, no tienen escape y tanques como {{champion:150}} pueden hacerle la línea muy complicada a la hora de farmear. Si el jg te ayuda en early quedan fuera de la partida.\n\n En cuanto al punto de que aparecen en todas las partidas es cierto, pero si jugas pensando no martillando los botones asi nomas, vas a aprender a hacerle counter tanto mecánicamente como en su función dentro de la partida, por eso no entiendo las quejas muchas veces, si bien mas de una vez los padesco en las partidas cuando se fedean, no siento que sean invencibles, sino que hay que aprender a jugarles (esto puede sonar mas fácil decirlo que hacerlo pero se puede).\n\nEspero no haber ofendido a nadie es una humilde opinión sobre los campeones, si lo hice pide disculpas y éxito en sus partidas.-","replies":[{"poster":"Yazzy","date":"2016-02-15T16:29:47.464+0000","up_votes":1,"down_votes":0,"body":"Contra una Riven sacas un lindo Kennen y te la violas sin vaselina. Jajajajaja","replies":[]},{"poster":"Ride the tiger","date":"2016-02-15T11:32:47.615+0000","up_votes":1,"down_votes":0,"body":"Yasuo no esta roto :P si no se jugaría más en LCS y esas cosas no?","replies":[{"poster":"Yazzy","date":"2016-02-15T16:27:10.153+0000","up_votes":1,"down_votes":0,"body":"Está roto porque REVIENTA, pero es muy fácil de hacer counter y en un mal early necesitas ir a farmear, cosas que en la LCS no te van a dejar hacer","replies":[]}]}]},{"poster":"ZKNoXx","date":"2016-02-18T21:22:13.419+0000","up_votes":1,"down_votes":0,"body":"Muchos se quejan de esos champs pero el más roto es Gangplank, a mi no me jodan.","replies":[]},{"poster":"DFX PimpFlaco","date":"2016-02-14T21:05:36.942+0000","up_votes":1,"down_votes":0,"body":"Por que en elo bajo los talon son horribles , tienen win rate en elo alto , igual yo tengo win rate con talon de 87% pero como te digo al ser main talon , los talon de elo bajo son muy malos , y por garen y darius , champ tanke que te mete una ulti y te mata sin nada de daño","replies":[]},{"poster":"Relium","date":"2016-02-14T18:19:31.656+0000","up_votes":1,"down_votes":0,"body":"Si el campeón te gana es porque está roto, si le ganás es porque sos pro. Siempre va a ser así","replies":[]},{"poster":"LyghtSh","date":"2016-02-14T16:25:11.056+0000","up_votes":1,"down_votes":0,"body":"Las partidas son 5 vs 5, hay veces que esos campeones no hacen la diferencia, pero en fase de lineas si y en late tambien. Por eso si te fulminan.","replies":[]},{"poster":"AuroraExecution","date":"2016-02-14T16:14:28.973+0000","up_votes":1,"down_votes":0,"body":"La queja creo que viene por el lado de que te destroza en unos instantes si esta bien armado (contra determinados champs), pero hay que ver toda la composicion del team. Si tenes un team que no tienen nada de CC, la riven se hace una fiesta (por ejemplo)","replies":[]},{"poster":"Ride the tiger","date":"2016-02-14T17:28:07.528+0000","up_votes":1,"down_votes":3,"body":"Pasa que la mayoría de gente que juega contra ellos y se queja es porque son campeones que sí no sabes jugar contra ellos te hacen la partida.La culpa es del que no sabe hacer counter, no del campeón.","replies":[]}]}