{"poster":"Ruphian","date":"2015-03-23T06:33:17.092+0000","title":"[Idea de campeón] Pinx, el paquete perdido.","subforum":"Charlas Generales","up_votes":3,"down_votes":4,"body":"Aca le traigo a los amigos de Riot LAS una idea para un campeon nuevo!!!\nNombre: Pinx, el paquete perdido.\nHistoria: Pinx nacio en Chile wn ql, en uno de las tantas pc's que tiene riot las de servidor en ese pais, su mision era simple, llevar informacion de Chile a Argentina y volver, pero no logro hacerlo, porque se perdio en el camino. Fin.\n\nHabilidades:\n\nPasiva: \n¡Comienza a Perderte!: cada vez que pinx consigue un asesinato, una asistencia, destruye una construccion, usa una habilidad, ataque basico, se mueve, backea, etc, el ping en la partida aumenta durante... lo que falte para terminar la partida...\n\nQ:\nCambio:\nPasiva: la ametralladora de pinx acumula ping con cada disparo que hace. Estas acumulaciones no tienen limite de tiempo, cantidad, ni nada, duran toda la partida.\nActiva: pinx cambia a su lanza cohetes que es tan fuerte que los servidores en mal estado no pueden procesar tanta informacion y por eso se prenden fuego permitiendo que los rioters hagan asado sin madera y nos lo muestren aca en el foro, asi:\n\nhttp://i860.photobucket.com/albums/ab162/Verano-Escarlata/images_zpsvne33mvf.jpg\n\nW:\n¡asdqflsakrfjdhalskrjfdhladkrfjh!: pinx dispara un rayo de su arma de rayos que te da ping si te impacta, si no te impacta, si sos vos el que lo dispara... Nuevo tipo de cc IMPAKTADO.\n\nE:\n¡Cartelitos!: pinx empieza a lanzar cartelitos de Reanudando Conexion, lanza tres seguidos, que a veces pueden ser cuatro, cinco, seis, incluso uno solo permanente!!! depende de la efectividad de las demas skills.\n\nR:\n¡Super Mega Lagazo Requete Mortal!: pinx dispara su cohete mas grande que genera mas lag a medida va recorriendo mas camino, una vez el cohete se pierde en el mapa no importa, el lag sigue aumentando continuamente, y si impacta a un campeon enemigo o amigo, tambien sigue aumentando.\n\nPerdon, en mi cabeza parecia mas gracioso, lo dejo solo por la imagen.","replies":[{"poster":"nightdarkess","date":"2015-03-23T13:02:09.068+0000","up_votes":1,"down_votes":0,"body":"quedaba mejor si decias que era una nueva skin para jinx :/","replies":[]},{"poster":"Lord Khada","date":"2015-03-23T06:57:11.594+0000","up_votes":1,"down_votes":0,"body":"{{summoner:11}}","replies":[]},{"poster":"LuciusMagnum","date":"2015-03-23T06:34:48.922+0000","up_votes":1,"down_votes":0,"body":"JAJAJA, y su duo supp plitz","replies":[]}]}