{"poster":"Ruphian","date":"2016-01-18T02:40:44.275+0000","title":"Como me deshago de esta \"gente\"?","subforum":"Guias y consejos","up_votes":1,"down_votes":3,"body":"Eso, como salgo del elo en el que estoy? (Normales)\r\nSiempre me toca con &quot;gente&quot; que se tira 1v+de1\r\n&quot;Gente&quot; que se tira contra el que ya los mato 2 veces, les decis juga bajo torre y no te dan bola.\r\n&quot;Gente&quot; a la que les haces se&ntilde;ales para que se vayan y se&ntilde;ales de que se les acercan los enemigos pero no se van.\r\n&quot;Gente&quot; que por buscar la kill van a top a ayudar al gp al q persigue el team enemigo completo, el gp se esta escapando perfecto, pero los otros dejan de pushear mid, que por cierto nos habian roto el inhibidor, para ir a ayudar al gp, pero terminan muriendo uno atras del otro como en cola de supermercado.\r\n&quot;Gente&quot; que como no gano mid, va supp con el mago que tenia pensado usar en mid, le roba la kill al adc, se arman da&ntilde;o, si el jg es de da&ntilde;o (trynda, shaco, elise, rengar) se enojan si este ultimo se queda la kill cuando el adc no esta.\r\n&quot;Gente&quot; que quiere ir nasus jungla, solo porque en algun lado vieron que antes se usaba asi (igual no me consta).\r\n\r\nY muchos otros mas. Como salgo? Ya no se que hacer, juego lo mejor posible mis kda son bastante buenos con mis mejores personajes, pero jugando solo estos tampoco puedo salir de ese elo feo. Gracias por los consejos.","replies":[{"poster":"Ks Erwyn","date":"2016-01-18T16:46:03.007+0000","up_votes":1,"down_votes":0,"body":"Mi mmr en normales es un desastre igual, pero pasa por andar probando champ, roles y trollear......me espanto cuando veo platas en mis emparejamientos, por que o abusas de ellos o los tuyos fedean todo lo que existe.\n\nhaz premade así logras una buena racha de victorias y mejora tu mmr en normales y tus emparejamientos","replies":[]},{"poster":"escorpion023","date":"2016-01-18T03:15:50.158+0000","up_votes":1,"down_votes":0,"body":"juega con amigos un rato y fijate como va tu elo","replies":[]}]}