{"poster":"Ruphian","date":"2017-03-06T21:36:09.909+0000","title":"Basta de guardianes/protectores.","subforum":"Charlas Generales","up_votes":1,"down_votes":6,"body":"Loco, los tres primeros de los seis ultimos campeones reworkeados (no cuentan actualizaciones de clase) son guardianes/protectores, ya basta, creo que ya tuvimos suficientes, no digo demasiados, pero ya son suficientes, porque no hicieron un embestidor o  un vanguardia? las vanguardias top faltan, a diferencia de otras clases que van a top. Que falta de creatividad, esos son los cambios que le hacen al juego para que siempre sea difierente? Contando a este galio serian 4 de los ultimos 7 campeones reworkeados guardianes/protectores, que embole vieja.\r\n\r\nAntes de que se levante shurima, y para evitarles hablar estupideces les digo que Reav3 confirmo que es un guardian/protector antimagos.\r\n\r\nDescargo hecho.","replies":[{"poster":"Texter Redrum","date":"2017-03-07T00:50:59.733+0000","up_votes":1,"down_votes":0,"body":"\"guardian\" \"protector\" \"embestidor\" \"vanguardia\" wtf mano","replies":[{"poster":"RodriiB","date":"2017-03-07T06:05:30.287+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Texter Redrum,realm=LAS,application-id=v7qsfXsE,discussion-id=okEEAAy5,comment-id=0002,timestamp=2017-03-07T00:50:59.733+0000)\n>\n> &quot;guardian&quot; &quot;protector&quot; &quot;embestidor&quot; &quot;vanguardia&quot; wtf mano\n\nHace algun tiempo atras Riot público un artículo con las clases de campeones, ya que la que se usa actualmente (Tanque, Luchador, Asesino, Mago, Tirador y Soporte) es muy general. Y dividio por ejemplo, a la Clase tanque como Vanguardia y Protectores, Luchadores en Embestidores y Colosos, Magos en Magos de batalla, Disruptores y no recuerdo que más y asi, cono que cada clase recibió un nombre en especifico agrupando grupos de campeones de característica similar, de forma más específica que la utilizada antiguamente. Porque por ej, no es lo mismo un mago de batalla estilo kartus o vladimir que un mago disruptor como lo es syndra o lux.","replies":[]}]},{"poster":"Nehalem","date":"2017-03-06T21:42:42.782+0000","up_votes":1,"down_votes":0,"body":"Hay cosas mas graves, como la falta de supports nuevos, me vi \"obligado\" a jugar con rubick y disruptor hasta nuevo aviso.","replies":[]}]}