{"poster":"Ruphian","date":"2015-04-21T00:51:48.923+0000","title":"Dudas (hay una para rioters sobre la traduccion de un objeto si me hacen el favor de contestar)","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"1ro quiero pedirle perdon a este item {{item:3078}} yo antes pensaba que era una caca pero descubri una build que hace mucho da&ntilde;o para cierto personaje...\r\n\r\n1)Porque se usa Runaan en Kalista? Que tanto garpa?\r\n\r\n2)Garpa hacerle velocidad de ataque a Vayne y maxear 1ro la W? Como?\r\n\r\n3) **(si algun rioter lo puede contestar mejor)** Porque a Wit&#039;s End se lo tradujo como Final del Ingenio? O sea, google tambien lo traduce asi, pero si pones las dos palabras por separado y haces click para ver las otras traducciones wit tambien es locura y end borde, dicho esto, en wikilol en ingles hay una frase en la pagina del objeto: &quot;A snake without its fangs is like a man at wit&#039;s end.&quot; que con el nombre oficial del objeto en espa&ntilde;ol seria &quot;una serpiente sin sus colmillos es como un hombre al final del ingenio&quot;, yo no le veo mucho sentido, mas bien tendria que ser al inicio del ingenio ya que esa serpiente tendria que empezar a ingeniarselas muy bien para conseguir alimento, sin embargo &quot;una serpiente sin sus colmillos es como un hombre al borde de la locura&quot; tiene mas sentido, digo, uds. no se volverian locos si perdieran sus dientes y ya no pudieran masticar? yo creo que seria altamente tortuoso psicologicamente.\r\n\r\n3)Garparia esto para Irelia? {{item:3115}} {{item:3153}} {{item:3071}} (teniendo en cuenta los cambios del PBE) {{item:3111}}/{{item:3047}} {{item:3143}} {{item:3065}}/{{item:3102}} ? y {{item:3083}}+{{item:3026}} ? Se que tambien depende de las runas pero bueno, vamos viendo...","replies":[{"poster":"Excorpion","date":"2015-04-21T02:56:15.182+0000","up_votes":1,"down_votes":0,"body":"Que es Garpa ???\n\n1.- Kalista aprovecha los efectos de impacto de runaan al igual que lo hace un twitch\n2.- Depende si estás contra un tank de bug armor (braum)\n3.- tal y como muestras depende del contexto... no conosco el item... pero es por contexto\n4.- No tengo iiidea de eso,.... pero no tomes en cuenta los cambios al PBE tan a plomo","replies":[{"poster":"Ruphian","date":"2015-04-22T00:41:25.726+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=excorpion2013,realm=LAS,application-id=8sKIclmi,discussion-id=uYlK0wb9,comment-id=0003,timestamp=2015-04-21T02:56:15.182+0000)\n>\n> Que es Garpa ???\n> \n> 1.- Kalista aprovecha los efectos de impacto de runaan al igual que lo hace un twitch\n> 2.- Depende si estás contra un tank de bug armor (braum)\n> 3.- tal y como muestras depende del contexto... no conosco el item... pero es por contexto\n> 4.- No tengo iiidea de eso,.... pero no tomes en cuenta los cambios al PBE tan a plomo\n\nQue es un tank de bug armor?","replies":[{"poster":"Excorpion","date":"2015-04-25T23:02:20.352+0000","up_votes":1,"down_votes":0,"body":"big xDDD no me di cuenta en el momento :P","replies":[]}]}]},{"poster":"Ruphian","date":"2015-04-22T00:44:29.077+0000","up_votes":1,"down_votes":0,"body":"Gracias a todos, donde puedo saber mas sobre lo de Vayne?","replies":[]},{"poster":"kique1","date":"2015-04-21T21:25:12.016+0000","up_votes":1,"down_votes":0,"body":"Qué es garpa? en español por favor.","replies":[]},{"poster":"gupi","date":"2015-04-21T04:17:26.318+0000","up_votes":1,"down_votes":0,"body":"Runaan en Kalista como ya te lo dijeron, sirve para sacarle provecho a su E ya que atacas 2 objetivos más además de tu objetivo principal, y los stacks de la E se acumulan en los tres objetivos. Lo que no garpa es rushearlo. Juego bastante Kalista y siempre rusheo IE como en la mayoría de los adcs.","replies":[]},{"poster":"MrGameAndBug","date":"2015-04-21T02:33:04.225+0000","up_votes":1,"down_votes":0,"body":"1.- Kalissta con cada ataque tiene 1 stackk de la lanza y un salto. Osea, mientras más ataques, más stak, y más saltas para correr. Por eso, como es el item con más velocidad tienes una movilidad abusrda solo con ello. Lo demás creo que ya lo dejaron bien claro xD","replies":[]},{"poster":"NGreppi","date":"2015-04-21T01:14:21.358+0000","up_votes":1,"down_votes":0,"body":"1) Te da free stacks de la E, objeto que mas da velocidad de ataque, lo unico que necesita Kalista para sacar daño y free movilidad.\n2) Depende la linea que tengas enfrente, Vayne es el adc mas versatil del juego, se puede maxear tanto la Q como la W o la E, o ir intercalando. Pero VS una lane como Leona-Graves, vs un Braum (da armor), Taric (tambien), etc.\n3) Uso bastante Irelia pero tendria que probar esa build.","replies":[]},{"poster":"Fahrenwolf","date":"2015-04-21T01:06:48.960+0000","up_votes":1,"down_votes":0,"body":"no soy rioter XD pero respondere la primera pregunta\nRinde el runaan en kalista si maxeas su E (si no me equivoco) ya que te da un buen daño continuo, aplicas de mejor manera la pasiva, y a diferencia de otros items de velocidad de ataque, puedes colocar marcas con tu E a otros dos objetivos, sean enemigos o minions lo que te ayuda a tener una mejor limpieza de minions, y mayor oportunidad de resetear el enfriamiento de la habilidad al activarla\n\nlos contras de sacar este item es que al disminuir tu daño fisico tienes mas dificultad para destruir torretas, demoras tu contruccion de critico o de robo de vida que es muy necesario con kalista\n\n\ncon vayne no lo tengo muy claro, claro que la velocidad de ataque de vayne rinde mucho , su itemizacion generalmente es rey arruinado y statick o bailarin.\n\notros adc's que van bien con velocidad de ataque son varus y kennen AD","replies":[]}]}