{"poster":"Nęm","date":"2015-03-09T12:39:43.651+0000","title":"Secondo voi qual è il miglior support di lol?","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"secondo me thresh e braum                                   \r\nILLUMINATEMI            {{item:3362}}","replies":[{"poster":"Dantazzo","date":"2015-03-09T13:33:04.523+0000","up_votes":4,"down_votes":0,"body":"Secondo me in generale il migliore è Thresh, ha tutto, però è difficile giocarlo al meglio.\nComunque non esiste un support migliore in assoluto, dipende sempre dalla sinergia col tuo adc/dalla composizione della botlane nemica.","replies":[{"poster":"Firenheit","date":"2015-03-09T13:44:53.379+0000","up_votes":1,"down_votes":0,"body":"E la miglior risposta è:","replies":[{"poster":"ViaMalinconiaN9","date":"2015-03-09T14:33:05.510+0000","up_votes":2,"down_votes":0,"body":">E la miglior risposta è:\n\nLa mia è.è","replies":[]}]}]},{"poster":"MightyPirate","date":"2015-03-10T00:30:33.516+0000","up_votes":2,"down_votes":0,"body":"Da tizio che finisce a supportare perchè \"please no support\" gli fan pena (quindi 95% delle partite) vi dico che ogni support ha più o meno il suo perchè:\n\n*{{champion:40}} Janna se il disengage è d'obbligo, nessuno riesce meglio di lei. E poi meteorina ha due bocce notevoli.\n\n*{{champion:12}}  **Alistar** è il mio support preferito, possibilità infinite se ben usato e ha una R che lo rende immortale per 7 secondi consentendo degli ottimi dive a livello 7. Per non parlare del fatto che un Flash+W+Q a livello 2 garantisce una kill sicura su un adc disattento o su un support squishy. Unico reale difetto è che è mana ungry, paradossalmente al livello 5 la sua Q e la sua W costano di più della sua ulti (110 mana contro 100). Se ben fatta comunque la sua combo Q+W vale i 200 mana che ci buttate. Anche la E non è male, vi da quel sustain in lane che vi può essere utile contro una nami/sona/lulu.\n\n*{{champion:89}} Leona, Grossissima. Consente di zonare in lane praticamente chiunque.\n\n*{{champion:412}} Thresh, misto tra i due sopra, puoi farci delle gran giocate e consente sia ingaggio che disengage. La sua principale utilità come support puro è tirare fuori da situazioni scomode con la W idioti che rimangono indietro. (mentre con qualunque support a parte Janna forse, questi morirebbero sicuramente).\n\n*{{champion:43}} Karma, poke, poke,poke,poke. Alla fine delle partite generalmente sono quello con l'output danni più alto.\n\n*{{champion:37}} Sona, poke, tanta utility, ulti fenomenale che può portare dalla vostra un teamfight.\n\n*{{champion:44}} Taric Meccaniche interessanti, ma dal nerf della passiva ha perso decisamente un po' di burst. É tornato sulla cresta dell'onda con la comparsa in god tier di Graves, in combo con lui è una lane sostanzialmente vinta: \n-Passive di graves e taric W che scalano insieme\n-ti tiene i champ fermi con lo stun appositamente per un Q+R di Graves\n-Controbilancia il machismo sfrenato di graves con una dose di gaiosità non indifferente. (\"Brillantee\")\n\nCose che invece non mi piacciono (mia opinione, non aggreditemi, non ho la scienza infusa) :\n*{{champion:16}} Soraka, dopo il rework dio.. stai sempre sotto il 25% di vita. Doveva essere un support curatore, non un support \"abbracciatorre\". E lo dico a malincuore, mi piaceva prima e m'ero pure comprato soraka celestina. Maledetta Riot, gimme my money back.\n*{{champion:1}} Annie, la preferisco mid. Se nel momento sbagliato stai senza stun il tuo adc muore.\n\n*{{champion:53}} Blitz, giocando support so esattamente come evitare di essere grabbato e zonarlo. Basta che il tuo avversario sappia qualche piccolo trucchetto per non farti far niente la maggior parte della partita. Noia infinita. \n\n*{{champion:9}} Fiddle, è un jungler per dio. Smettetela di relegarlo bot e fargli perdere 3/4 della sua utility.\n\n*{{champion:111}} Nautilus, un grab e uno stunnino di mezzo secondo? a sto punto piglia blitzcrank. Fa le stesse cose ma meglio.\n\n*{{champion:99}}  {{champion:25}} Lux/Morgana: Non mi piacciono.. utili in qualche situazione come counterpicks magari, ma per il resto.. c'è di meglio. Morgana comunque se ben giocata è un dito al culo.\n\n*{{champion:117}}  Lulu TROPPE SPELL, non so mai cosa fare. Sto sempre senza mana, e secondo me non ha tutto sto poke, fa pochi danni o_O avrò sbagliato rune, e poi le skin a parte meraviglia bianca sono un po' bruttine. De gustibus.\n\n*{{champion:267}} Nami, support molto forte, peccato che se viene trappata in qualche modo esploda alla velocità del suono. \n\n*{{champion:26}} Zilean, boh se volete far lanare l'adc da solo garantendogli due vite.. Io preferisco qualcosa di più attivo.\n\n*{{champion:143}} Zyra A metà tra un support e un midlane.. boh, non mi piace e non ho un gran motivo in effetti.. sarà che dai tempi di diablo II i personaggi che evocano cose mi rompono le palle. Soffre un po' la sindrome del negromante.\n\n*{{champion:76}} Nidalee, PLS RITO, BAN HIM. ( c'è ancora qualcuno che la gioca support?)\n\n*{{champion:161}} Velkroz Uno slow skillshot, uno stunnino skillshot di mezzo secondo con backroll.. C'è di meglio, che fa queste cose meglio. (thresh ad esempio).","replies":[]},{"poster":"darkfollet","date":"2015-03-09T17:58:26.268+0000","up_votes":2,"down_votes":0,"body":"Che domande, è ovvio che sia bard. Non lo hanno ancora nerfato^^{{item:3157}}","replies":[]},{"poster":"wiseman89","date":"2015-03-09T17:17:14.508+0000","up_votes":2,"down_votes":0,"body":"Karma inutile.... LOL\n\ntralasciando il fatto che ho dovuto mainarla per arrivare a gold, e che ora ho dovuto riprenderla dopo mesi, per uscire da gold 5, (altrimenti col c***o che uno carria col support)\n\ndire che karma è inutile è alquanto opinabile:\n\n- con il basso cd della q , q+r (+ passiva per refreshare la r) ha un harrass/poke tra i più forti e    fastidiosi del gioco\n- cc a tutti gli effetti, anzi, dai anche il tempo al tuo adc di capire il momento esatto in cui il target rimane stunnato\n- scudo + che decente (che con la r diventa tipo la ultimate di sivir, permetti al tuo team di fare engage/disengage","replies":[]},{"poster":"SirZeel","date":"2015-03-09T13:22:53.914+0000","up_votes":1,"down_votes":1,"body":"Come previsto nessuno prende in considerazione Taric e Karma.\n\nTaric è uno dei support più OP di tutto LoL, anche se non lo sai usare.\n\n- È praticamente impossibile rubare farm\n- Cura, stunna, da armatura all'adc con la sola presenza\n- Contro gli ad è quasi immortale [non importa che il support sia AP, la stragrande maggioranza del danno la fa l'adc]\n- Con R + W pulisce qualunque wave\n- Protegge le torri anche stando fermo\n\nKarma, d'altronde, è meno difensiva ma compensa con danni e utility allucinanti.\n\n- R dal primo livello\n- Poke forte di Q, fortissimo con R + Q\n- Scudo e movimento extra per chiunque, con R + E è globale e da ancora più scudo e movimento\n- Root di W, root e rubavita con R + W\n- Wave clear eccellente nel caso di difesa torri","replies":[{"poster":"Nibbio Bianco","date":"2015-03-09T14:34:23.152+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=SirZeel,realm=EUW,application-id=MJVj50Jw,discussion-id=63PLpVYe,comment-id=0004,timestamp=2015-03-09T13:22:53.914+0000)\n>\n> Come previsto nessuno prende in considerazione Taric e Karma.\n> \n> Taric è uno dei support più OP di tutto LoL, anche se non lo sai usare.\n> \n> - È praticamente impossibile rubare farm\n> - Cura, stunna, da armatura all'adc con la sola presenza\n> - Contro gli ad è quasi immortale [non importa che il support sia AP, la stragrande maggioranza del danno la fa l'adc]\n> - Con R + W pulisce qualunque wave\n> - Protegge le torri anche stando fermo\n> \n> Karma, d'altronde, è meno difensiva ma compensa con danni e utility allucinanti.\n> \n> - R dal primo livello\n> - Poke forte di Q, fortissimo con R + Q\n> - Scudo e movimento extra per chiunque, con R + E è globale e da ancora più scudo e movimento\n> - Root di W, root e rubavita con R + W\n> - Wave clear eccellente nel caso di difesa torri\n\nKarma è il più inutile. Taric non bisogna sottovalutarlo, ma sicuramente non è il più forte perché è troppo mana e armor dependent e sei obbligato ad iniziare col cuore ghiacciato per avere un pò di mana e armatura in più, quando invece con l'attuale meta si preferisce iniziare con mikael's crucible o locket of iron solari che danno magic resist e possono permettere al tuo team di buildare armatura mentre tu dai protezioni contro magic resist o cc, anche se alla fine l'oggetto da buildare è totalmente dipende dal team avversario e dal campione che utilizzi... su una annie funziona molto bene {{item:3069}} {{item:3800}} per poter ingaggiare sempre. Su leona {{item:3190}} {{item:3401}}. Cuore ghiacciato non si fa su nessuno come primo oggetto, praticamente... con taric si. \n\nIl support più forte è Thresh, è il lee sin dei support, può richiedere meccaniche difficili ma è veramente tosto come support, per non parlare della sua passiva realmente OP.","replies":[{"poster":"SirZeel","date":"2015-03-09T14:42:47.946+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=IlRisotto,realm=EUW,application-id=MJVj50Jw,discussion-id=63PLpVYe,comment-id=00040000,timestamp=2015-03-09T14:34:23.152+0000)\n>\n> Karma è il più inutile.\n\nMi fermo qui perché sei evidentemente ubriaco.","replies":[{"poster":"Nibbio Bianco","date":"2015-03-09T15:15:12.254+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=SirZeel,realm=EUW,application-id=MJVj50Jw,discussion-id=63PLpVYe,comment-id=000400000000,timestamp=2015-03-09T14:42:47.946+0000)\n>\n> Mi fermo qui perché sei evidentemente ubriaco.\n\nè veramente il support più inutile attualmente, perché non è un supporto ma nemmeno un mago che scali decentemente in mid. Ha la Q che è una Q uguale a quella di tantissimi altri midlaner, soltanto che la sua non offre cc se non uno slow... una barriera come quella di janna o lulu, ma che non offre danni in più, una catenella che alla fine diventa uno snare che non dura quanto tu vorresti che durasse, visto che rispetto ad altri support ha meno cc, e se ci fosse un campione che si meriterebbe i 3 secondi di snare, quello sarebbe Karma, non come morgana che oltre ad avere 3 secondi di snare sulla Q ha la ultimate uguale alla w di Karma soltanto che oltre ad essere globale alla fine stunna al posto di snarare. \n\nOra passiamo alla ultimate di Karma, che possiamo definire la ultimate più inutile del gioco. Perché è inutile? Perché non scala bene col cooldown. Se Karma abbiamo detto sia un campione con scaling basso, DEVE avere dei danni di base abbastanza alti. Il problema è che i danni di base alti ce li ha la ultimate, quindi una sola skill su 3 ha dei danni di base alti, le altre 2 sono inutili, e se tu a livello 16 non mi permetti di rendere la ultimate quantomeno utilizzabile due volte in un teamfight, allora non riuscirà mai al tenere il passo di molti altri support, e quello che succede con Karma è che al livello 1 è forte, come è forte qualsiasi altro support perché è i support devono essere forti in early game, e questa è la scoperta del secolo, poi più il tempo passa più diventa inutile perché se gli altri support in late game riescono ad offrire danni aggiuntivi, protezione, cc, lei offre davvero poco perché può dar valore soltanto a una delle sue skill su 3. La vecchia Karma dava 893278978 di scudo, ad area, facendo danni ad area intorno a chi dava lo scudo, era impossibile buttare giù il campione scudato con quella Karma, la sua ultimate aveva un senso in late game, questa invece cerca di avere valori come la vecchia Karma, ma non ce li ha. è anche vero che la vecchia Karma non aveva CC, però, quando con una W puoi dare 1500 armatura ad un compagno, nemmeno shen arriva a fare tutto quello, cosa te ne frega? Questa Karma è sicuramente il campione più brutto del gioco, scopiazzato da tutte le parti e senza un punto di forza che la caratterizzi veramente.","replies":[{"poster":"SirZeel","date":"2015-03-09T15:30:23.388+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=IlRisotto,realm=EUW,application-id=MJVj50Jw,discussion-id=63PLpVYe,comment-id=0004000000000000,timestamp=2015-03-09T15:15:12.254+0000)\n>\n> è veramente il support più inutile attualmente, perché non è un supporto ma nemmeno un mago che scali decentemente in mid. Ha la Q che è una Q uguale a quella di tantissimi altri midlaner, soltanto che la sua non offre cc se non uno slow... una barriera come quella di janna o lulu, ma che non offre danni in più, una catenella che alla fine diventa uno snare che non dura quanto tu vorresti che durasse, visto che rispetto ad altri support ha meno cc, e se ci fosse un campione che si meriterebbe i 3 secondi di snare, quello sarebbe Karma, non come morgana che oltre ad avere 3 secondi di snare sulla Q ha la ultimate uguale alla w di Karma soltanto che oltre ad essere globale alla fine stunna al posto di snarare. \n> \n> Ora passiamo alla ultimate di Karma, che possiamo definire la ultimate più inutile del gioco. Perché è inutile? Perché non scala bene col cooldown. Se Karma abbiamo detto sia un campione con scaling basso, DEVE avere dei danni di base abbastanza alti. Il problema è che i danni di base alti ce li ha la ultimate, quindi una sola skill su 3 ha dei danni di base alti, le altre 2 sono inutili, e se tu a livello 16 non mi permetti di rendere la ultimate quantomeno utilizzabile due volte in un teamfight, allora non riuscirà mai al tenere il passo di molti altri support, e quello che succede con Karma è che al livello 1 è forte, come è forte qualsiasi altro support perché è i support devono essere forti in early game, e questa è la scoperta del secolo, poi più il tempo passa più diventa inutile perché se gli altri support in late game riescono ad offrire danni aggiuntivi, protezione, cc, lei offre davvero poco perché può dar valore soltanto a una delle sue skill su 3. La vecchia Karma dava 893278978 di scudo, ad area, facendo danni ad area intorno a chi dava lo scudo, era impossibile buttare giù il campione scudato con quella Karma, la sua ultimate aveva un senso in late game, questa invece cerca di avere valori come la vecchia Karma, ma non ce li ha. è anche vero che la vecchia Karma non aveva CC, però, quando con una W puoi dare 1500 armatura ad un compagno, nemmeno shen arriva a fare tutto quello, cosa te ne frega? Questa Karma è sicuramente il campione più brutto del gioco, scopiazzato da tutte le parti e senza un punto di forza che la caratterizzi veramente.\n\n#EVB\nAnche se la sbronza non ti è passata proverò a farti rinsavire.\n\nNon commento nemmeno su \"La Q non offre CC se non uno slow\". È come dire \"Non mi stai pagando il lavoro se non contiamo lo stipendio\".\nLa barriera di Karma FA danni.\nLo snare dura quanto deve durare. Il fatto che la Q di Morgana al livello 1 duri più della W di Ryze al livello 5 vuol dire che è Morgana ad essere sbilanciata, non che gli altri champion siano scarsi.\n\nPassando alla ultimate: non vedo quanti support possano partire con la R al livello 1, e di certo non conosco champion che riescano ad usare due volte la ultimate in un team fight; tuttavia Karma ha un cd sulla ultimate di 36 secondi, senza cdr. Con il 40%, che su Karma si fa, si arriva a 21,6 secondi. Quasi tre ultimate al minuto mi pare più che abbondante. Tra l'altro, ripeto, lo scudo FA ANCORA danni ad area intorno a chi da lo scudo.\n\n In late Karma fa dei danni irraggiungibili da qualunque altro support.","replies":[{"poster":"Arki44","date":"2015-03-09T18:42:34.442+0000","up_votes":1,"down_votes":0,"body":"Tra l'altro aggiungerei che lo speed di E quando sei in laning è ottimo, non so quante volte mi è capitato di avere un adc addormentato che non vedeva gli skillshot e cercando di scudarlo con il bost di velocità si scansava direttamente il proiettile senza nemmeno rendersene conto.","replies":[]}]}]}]}]}]},{"poster":"Vibora48","date":"2015-03-09T13:07:19.755+0000","up_votes":2,"down_votes":1,"body":"Per me il miglior support è Sona {{champion:37}}","replies":[]},{"poster":"andrered","date":"2019-03-04T16:42:41.924+0000","up_votes":1,"down_votes":0,"body":"Pyke è il migliore! LOL","replies":[]},{"poster":"LuckRayS","date":"2017-02-14T13:11:08.913+0000","up_votes":1,"down_votes":0,"body":"Partiamo dal presupposto che non ce n' è uno più forte secondo me. Tutto gira intorno al tuo modo di gioco. Sicuramente non approvo tutti quei commenti contro Morgana e ve lo dico io perchè con lei ho preso tante di quelle S, S-, S+ che voi non avete idea. Ultimamente gioco anche Blitz che a mio parere è uno stronzo bastardo che se ti prende, ti stupra però se trovi gente che sa  giocare veramente bene, e sottolineo, veramente, molte volte fallisce le sue q. Support che bene o male, sono forti sono: Nami, Thresh, Braum e Zyra che però, costano tanto. Quello con cui io, personalmente, mi trovo meglio, è assolutamente Morgana. Janna a me non piace e Sona la devo ancora provare ma la vedo bene. Lux mi piace.","replies":[]},{"poster":"One Tax Man","date":"2015-08-22T00:56:52.995+0000","up_votes":1,"down_votes":0,"body":"{{champion:412}} e {{champion:89}} sono i più completi per me , ma non gioco praticamente mai support quindi mi baso su quello che vedo.\nCc ad area , strong engage , utility , tankyness e presenza sia in lane che in tf : direi che volere più di così è difficile.","replies":[]},{"poster":"Revo21","date":"2015-08-21T22:19:37.197+0000","up_votes":1,"down_votes":0,"body":"per me sono {{champion:12}} {{champion:412}} {{champion:37}}","replies":[{"poster":"SirZeel","date":"2015-08-21T22:42:02.482+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Revo21,realm=EUW,application-id=MJVj50Jw,discussion-id=63PLpVYe,comment-id=0015,timestamp=2015-08-21T22:19:37.197+0000)\n>\n> per me sono {{champion:12}} {{champion:412}} {{champion:37}}\n\nNeanche il Necronomicon era capace di tanto.","replies":[]}]},{"poster":"Annielated","date":"2015-03-10T22:26:33.374+0000","up_votes":1,"down_votes":0,"body":"Leona, con lei ho iniziato a fare il supp ","replies":[]},{"poster":"IamTheDream","date":"2015-03-09T23:45:18.308+0000","up_votes":1,"down_votes":0,"body":"Da quel poco di esperienza che mi son fatto nel mondo dei support ho capito che esistono fondamentalmente 2 categorie:\n1) Quelli che danno sustain (tipo Soraka)\n2) Quelli che cagano il ....danno fastidio in lane (tipo bliz)\n\nNel primo caso (sarete costantemente gankati per primi e poi qualcuno del vostro team vi dirà \"go, engage\"), Soraka, Nami e Sona sono ideali (Sona forse più di tutti). Danno vita ad altre magie carine (Soraka blocca ed ha una R globale che da molti assist in una squadra tosta, nami da velocità e forza d'attacco con la E, Sona...da tutto e di più, con la R stunna...gli manca giusto lo slow poi sale ad un altra categoria...support-mage-fghter)\nIn questa categoria ci aggiungerei Orianna, ha i suoi difetti ma molti pregi (buon attacco, scudo, slow per i nemici e scatto per gli alleati ed una ultimate che stunna in gruppo)\n\nNel secondo caso i principali sono Bliz e Leona (fiddlestick, Darius ecc.). Grabbano e stunnano che è un piacere ma non hanno modo di supportare l'ADC se le cose vanno male. Se l'adc viene focussato in una gank... +1 agli avversari per la scelta!\n\nInfine ci son gli ibridi (una terza categoria) ossia tresh (grab + shild) Braum (tank, ideale per buttar giù le torri, shild & slow) lulù (un fighter-mage che fa da support, una che potremmo incontrarla in qualsiasi lane) ed ovviamente la...ehm...il grande taric (di cui s'è già detto tutto).\n\n\nOpinione personale:\nNami ha dei cd troppo alti.\nSoraka, fantastica ma troppo debole, basta uno sputo per morir annegata\nMorgana, ottima, nel late Q + pozzo nero + ulti = Kill\nOrianna, poliedrica con le sue magie ma troppo mana dipendente e troppo lenta\nSona...basta saperla usare e già in mid-game si spamma che è un piacere per avere costanti assist!\nBliz, è un fighter non un support...tanto vale usare darius in bot, tanto con lui difficilmente farete assist!!\nTresh? Usato troppo poco per poterlo giudicare ma 2 magie su 3 (escludendo la R) son semplici da usare...basta prenderci la mano! (io facevo di solito Q-Q (per avvicinarmi al nemico) + R per intrappolarlo e darlo in pasto al mio team)\nlulu, se si è in sintonia con l'ADC, sarete una coppia da paura (engage e disengage perfetti).\nJanna, ottima per la difesa. Potete proteggere anche le torri, slow ai nemici, velocità con la passiva ed una R spargi nemici (tipo la R di xin zao ma senza far danni)\n\nOpinione personale 2:\nL'abilità dei supporter va (andrebbe) combinata con l'ADC (Kalista e Soraka....scordatevi una lane di successo mooolto meglio bliz o tresh) e se fosse possibile scegliere in base agli avversari (contro bliz morgana è la migliore, col suo scudo annullate il grab. Se dall'altra parte c'è Kartus (mid), usate soraka per annullargli la R)\n\nIl supporter migliore? Non è nel champ ma nella propria testa, i champ son bene o male equilibrati fra loro per cui pensate a come supportare adc + team (Karma è interessante, l'ho provata e mi piace anche se vale il punto 2). Il primo supp che ho usato è Soraka e quando sono in un buon team con lei...mi sento \"perfetto\" e rendo la vita impossibile agli avversari ;)","replies":[]},{"poster":"UltraLion","date":"2015-03-09T22:26:17.472+0000","up_votes":1,"down_votes":0,"body":"Thresh è il più cazzuto","replies":[]},{"poster":"BluFoxer","date":"2015-03-09T21:53:49.606+0000","up_votes":1,"down_votes":0,"body":"Fiddle Maina tutti ruoli. Support pure. Mai provato fiddlesticks tank? Fiddle Regna! {{champion:9}}","replies":[]},{"poster":"Loki Toki ","date":"2015-03-09T21:17:35.811+0000","up_votes":1,"down_votes":0,"body":"{{champion:117}} \n\nAncora un altro giro.","replies":[]},{"poster":"Vileblood Pyke","date":"2015-03-09T20:18:16.604+0000","up_votes":1,"down_votes":0,"body":"{{champion:412}}\nIl suo kit è semplicemente perfetto per un support.","replies":[]},{"poster":"Aramanthis","date":"2015-03-09T18:38:54.862+0000","up_votes":1,"down_votes":0,"body":"{{champion:111}}{{champion:89}} {{champion:43}} ","replies":[]},{"poster":"Ryuk1980","date":"2015-03-09T17:01:28.032+0000","up_votes":1,"down_votes":0,"body":"Secondo me Paduro, quello a forma di pesce...","replies":[]},{"poster":"Ucr0niA","date":"2015-03-09T16:46:30.956+0000","up_votes":1,"down_votes":0,"body":"{{champion:267}} \nE' una bulla","replies":[]},{"poster":"lucablack","date":"2015-03-09T16:23:20.498+0000","up_votes":1,"down_votes":0,"body":"A mio parere è tresh, pero dipende da te, perche devi esser bravo a grabbare. braum è un tank fortissimo e inizia a tankare gia dal livello 1 però thresh dà molto più sostegno al proprio adc.","replies":[]},{"poster":"FerroDeDe","date":"2015-03-09T16:13:50.374+0000","up_votes":1,"down_votes":0,"body":"io sinceramente vedo come più forti leona thresh e braum\nanche se tra questi 3 non saprei dire chi è più forte, dato che bisogna affiancarli ad adc adatti alle loro peculiarità","replies":[]},{"poster":"DoubleT","date":"2015-03-09T13:56:29.286+0000","up_votes":1,"down_votes":0,"body":"Tutti si sono scordati di {{champion:143}} buildata AP andate in lane, rootate di E e poi spammate Q, W...tirate la ulti a caso in tf tanto fate così tanto danno che potreste finire con più danni ai campioni del vostro adc XD","replies":[]},{"poster":"ViaMalinconiaN9","date":"2015-03-09T13:20:40.563+0000","up_votes":1,"down_votes":0,"body":"....\n{{champion:53}} {{champion:201}} {{champion:267}} {{champion:37}} {{champion:16}} {{champion:412}} \nIl miei preferiti sono: Nami&Sona\nOvviamente ognuno adatto a un ruolo, ad esempio:\nBraum un support che si becca tutte le skil al posto tuo\no morgana che intrappola i nemici per fatteli killare\no soraka per silenziarli.\no blitz (uno dei migliori support che prende i nemici, per poi lanciarli anche in aria.\no sona, per avere un sostegno, cure velocità ecc..","replies":[]},{"poster":"Zorby","date":"2015-03-09T13:00:36.009+0000","up_votes":1,"down_votes":0,"body":"Per me è Braum","replies":[]},{"poster":"Ghost Stalker","date":"2015-03-09T12:56:04.844+0000","up_votes":1,"down_votes":0,"body":"Morgana,janna e thresh.\n\nA parere personale Janna.","replies":[]}]}