{"poster":"LisaNNN","date":"2015-06-25T02:58:59.946+0000","title":"¿Porque los menos usados son los mas rotos?","subforum":"Charlas Generales","up_votes":1,"down_votes":2,"body":"Todas las veces que juego contra alguien como {{champion:82}}, {{champion:8}},{{champion:50}}, {{champion:72}},{{champion:83}}, {{champion:134}} o {{champion:60}}. \r\nTodas las veces que juego contra uno de esos termino perdiendo la linea, excepto por {{champion:83}} Hasta el momento no me toco ninguno de este, pero me puse a analizarlo e hice lo mismo, si pierdo linea contra ellos, &iquest;Porque no hacer lo que ellos hacen?. Empece a usar a {{champion:82}} , que era el principal que nunca le ganaba la linea y le gane a muchos. Ahora estoy usando mucho a {{champion:8}} (lo compre y al dia siguiente lo dieron free, mala suerte la mia xd). Cuando lo use muy bien, voy a seguir con {{champion:50}} (1 sola vez le gane la linea).\r\nEsos 3 eran mis peores pesadillas, hasta que hice la contra y los empece a usar.","replies":[{"poster":"Aluneth","date":"2015-06-25T03:47:51.333+0000","up_votes":3,"down_votes":0,"body":"No es que estén rotos, la cuestión es que las personas que usan esos champs poco populares, suelen usarlos bien. Los juegan porque les gustan y no porque sea la moda o lo más roto de la lcs... Y el que sean poco usados dificulta más contrarestarlos (por falta de experiencia básicamente)","replies":[{"poster":"Keldor","date":"2015-06-25T04:03:17.368+0000","up_votes":1,"down_votes":0,"body":"De acuerdo contigo, es justo lo que me pasa con {{champion:134}}","replies":[]}]},{"poster":"NelsonFT","date":"2015-06-25T03:14:27.190+0000","up_votes":3,"down_votes":0,"body":"Como la gente no está acostumbrada a verlos, entonces no sabe cuales son sus fortalezas y sus debilidades y entonces no sabe como jugarles. Yo creo que si te dan resultados deberías usarlos, como a cualquier otro campeón :)","replies":[]},{"poster":"NeoGibiky","date":"2015-06-25T17:35:39.814+0000","up_votes":1,"down_votes":0,"body":"La verdad es que como dicen, estos champ no estan rotos, el problema es que nadie en elo bajo (y hasta a veces el alto) conoce sus habilidades, pasivas, etc. Ejemplo, la pasiva de poppy es la mejor de todo el juego, ya que te hace un tanke sin serlo, al igual que la antigua pasiva de sion, era buena, o como la pasiva de urgot o yorick, las cuales les hacen un mounstro 1 vs 1 (urgot) o 1 vs 3 (yorick), mas bien lo que se puede hacer es conocer estos campeones, no saber usarlos, pero si conocer quienes son y lo de los counter, a veces se pickean los counter y no saben porque lo hacen (como la moda que aparecio en plata y oro con las vayne, las cuales no saben usarlas) suerte en la grieta n.n","replies":[]},{"poster":"Escrache","date":"2015-06-25T17:15:36.453+0000","up_votes":1,"down_votes":0,"body":"Falta de experiencia, se complica pelear contra lo que no conoces, aprende a usarlos para poder ganarles despues..","replies":[]},{"poster":"RNGesus","date":"2015-06-25T04:25:56.180+0000","up_votes":1,"down_votes":0,"body":"{{champion:83}} si existiera la estadistica \"top win rate\" , yorick tendria como 70% , ya que es una pesadilla el muy malnacido xD","replies":[]},{"poster":"potato support","date":"2015-06-25T03:59:50.018+0000","up_votes":1,"down_votes":0,"body":"hay una diferencia entre jugar estos champs en una normal que en una ranked.\n\nen normal, no podes prepararte para enfrentarte a estos champs desde champ select. vas con runas/maestrias genericas y un champ que no necesariamente esta preparado para enfrentarlo.\n\nen ranked podes directamerte armar todo un equipo que tenga en cuenta las debilidades y ventajas de estos.","replies":[]},{"poster":"Ks Erwyn","date":"2015-06-25T03:37:13.496+0000","up_votes":1,"down_votes":0,"body":"pasa que generalemente los usuarios de estos campeones son fieles a ellos y buscan ser mejores con ellos, y uno al enfrentarlos poco, obviamente es complejo adaptarse a su modo de juego y mecanicas o puntos fuertes o debiles.\n\n{{champion:82}} , es un bully lane, su mayor debilidad es su falta de CC y de movilidad, como asi su modo de juego que te impulsa a pushear y te vuelve presa de gank faciles.\n\n{{champion:83}} , otro bully lane que se basa en el desgaste previo, ponle un campeon con mayor capacidad de sustain y perdera mucha ventaja.\n\n{{champion:50}} , una bestia cuando llega al nivle 6, pero tiene unos de los peores Last hit existentes, totalmente item dependiente y una movilidad casi nula, y un ignite le es fatal.","replies":[]},{"poster":"l BlackWidow","date":"2015-06-25T03:14:43.596+0000","up_votes":1,"down_votes":0,"body":"Morderkaiser es un pj hermoso y ami me faltan manos para usarlo no se porque.","replies":[{"poster":"Il Bardolino","date":"2015-06-25T03:17:20.494+0000","up_votes":1,"down_votes":0,"body":"Eso es un problema.","replies":[{"poster":"l BlackWidow","date":"2015-06-25T03:18:04.121+0000","up_votes":1,"down_votes":0,"body":"Por no saber usarlo ? jaja.","replies":[]}]}]},{"poster":"Rıot Alma","date":"2015-06-25T03:15:26.450+0000","up_votes":1,"down_votes":0,"body":"Mira....yo al principio veia a {{champion:28}}  como un champ muuuy dificil en la jungla\n...ayer la probe...y me encanto...tiene un inicio de partida muy HARDCORE...pero cuando ya esta Lvl:6 te hace la jungla sola y esos ganks que te ralentizan y devoran a quien se cruze....me encanto...los champs menos usados solo requieren eso... \n#USO!\nasi que si...sin otro particular saludo...me voy a seguir jungleando (que estoy aprendiendo y empeze a junglear con eve :v )\n> \n**TOP : **\n{{champion:75}} _-Nasus (**Una Q Bestial y tankeada Monstruosa**)\n{{champion:39}} -Irelia (**Burst Damage y CC que funciona cuanto menos vida tenga**)\n{{champion:78}} -Poppy_ (**Fea pero la mejor ulti que vi**)\n**JG:**\n{{champion:28}} _-Evelynn_ (**Busteo,Evasion de wards,Facil gankeo y Buen Late**)\n**MID:**\n{{champion:1}} _-Annie_ (**CC y Burst Damage**)\n{{champion:9}} ~~Fiddlesticks~~ (**Ya no rinde mid**)\n**ADC:**\n{{champion:51}} _-Caitlyn (**Mucho Rango,Buen Early**)\n{{champion:21}} -Miss Fortune (**Mucho daño,su Q rebota y daña mas al 2do objetivo**)\n{{champion:18}} -Tristana_ (**Bursteo de torres con su \"E\"...literalmente la mejor para tirar torres y tomar objetivos**)\n**SUPPORT:**\n{{champion:12}} _-Alistar_ (**Mucho CC...Mucha dureza...y Heal**)\n{{champion:53}} _-Blitzcranck_ (**Atrae Enemigos,CC, y Silence...algo tanke**)\n{{champion:412}} _-Tresh_ (**Tanke que se vuelve mejor cuanto mas tiempo pase...buen CC y un escudo linterna que salva vidas**)\n{{champion:89}} _-Leona_(**HARD CC y una Tankeada BESTIAL...sin dudas la mejor Support**)\n\nEsos son mis champs a recomendar :)\nSalu2\nPD: notese que solo evelynn es poco usada...y tal vez poppy","replies":[]},{"poster":"Sagas","date":"2015-06-25T03:12:35.866+0000","up_votes":1,"down_votes":0,"body":"1. El problema no es que estén rotos, es que depende de que  tan bien lo use el invocador porque un invocador que tenga poca habilidad no va a ganar aunque se elija{{champion:105}} ,{{champion:157}} ,{{champion:120}} , etc","replies":[]}]}