{"poster":"Nehue","date":"2015-07-17T05:03:53.067+0000","title":"Main SUPPORT ORO busca EQUIPO PROFESIONAL c/ EXPECTATIVAS DE COMPETICIÓN.","subforum":"Reclutamiento","up_votes":1,"down_votes":0,"body":"Buenas noches, d&iacute;as y tardes a todos;\r\n\r\nMi nombre es Nehuen, tengo 23 a&ntilde;os, soy Argentino, y me comunico por la presente con la comunidad para transmitirles que me gustar&iacute;a participar de un equipo para clasificatorias grupales, orientado a la buena comunicaci&oacute;n, desarrollo interpersonal, buena conducta y mejora y aprendizaje continuo.\r\n\r\nSi bien mi liga corresponde a Oro, soy una persona que constantemente;\r\n\r\n* Estudia sus juegos clasificatorios SoloQ y DuoQ, durante la partida y despu&eacute;s de la misma.\r\n* Observa y sigue a diario las competencias LCS NA &amp; EU.\r\n* Mantiene un perfil proactivo, anal&iacute;tico y social con sus compa&ntilde;eros de juego\r\n* Transmite buena conducta, capacidad de adaptaci&oacute;n y comunicaci&oacute;n efectiva para sus pares como para los rivales de juego.\r\n* Apuesta por la mejora colectiva del grupo en su desarrollo de mec&aacute;nicas en peleas de equipo.\r\n\r\nYa enumeradas algunas de mis car&aacute;cter&iacute;sticas como jugador, paso a informar mis aptitudes para con el juego;\r\n\r\n1. Cuento con gran disponibilidad horaria; me encuentro en receso invernal de mi Universidad, desempleado pero en b&uacute;squeda de trabajo, por lo que poseo rangos horarios muy amplios de esparcimiento y recreaci&oacute;n para jugar al LOL.\r\n2. 10 MB de conexi&oacute;n WIFI mediante FIBRA &Oacute;PTICA. Latencia de 34 MMS. Desarrollo gr&aacute;fico de  210 FPS.\r\n3. Varios canales de contacto inmediato: TW, Instagram, FB, Curse Voice, Skype, WhatsApp.\r\n\r\nY ahora si, finalizando, les comento que estos son mis supports 100% jugados, entrenados y testeados con varias configuraciones de runas y maestrias, todos con nivel 5 promediando los 50k de puntos;\r\n\r\n{{champion:432}} {{champion:201}} {{champion:40}} {{champion:89}} {{champion:117}} {{champion:267}} {{champion:111}} {{champion:44}} {{champion:16}} \r\n\r\nLos dem&aacute;s supports, se encuentran en entrenamiento, priorizando el desarrollo de Alistar.\r\n\r\nPara los interesados, mi nombre en el juego es **Nehue **... y estamos en contacto.\r\n\r\nSaludos y gracias por el tiempo de lectura.\r\n\r\nN.","replies":[{"poster":"Shiny Teemo","date":"2015-07-17T05:35:03.041+0000","up_votes":6,"down_votes":0,"body":"Ningún equipo competitivo va a buscar a un jugador bajo diamante, eso dalo por hecho.","replies":[]},{"poster":"RedPoison","date":"2015-07-17T10:00:48.661+0000","up_votes":2,"down_votes":0,"body":"Sube de oro mejor amiguete antes de buscar teams competitivos lo digo en buena {{summoner:31}}","replies":[]}]}