{"poster":"Cankutso","date":"2017-03-11T19:52:59.094+0000","title":"(BUG) Doble compra/cobro de Skin","subforum":"Problemas Técnicos","up_votes":5,"down_votes":1,"body":"Bueno ayer Recargue RP la suma fue de 3450, con lo cual me dispuse a comprar la Skin de {{champion:143}}  Hechicera de Dragones al efectuar la compra me dieron la Skin pero lo que me llamo la atenci&oacute;n fue que me descontaron mas RP que solo 1350 (el costo de la Skin) asi que revise a no ser que hubiera comprado por accidente un paquete y no fue el caso, luego me dirig&iacute; a revisar mi historial de compra y me pillo con la sorpresa de que se registro dos veces la compra de dicha Skin.\r\n\r\nhttps://68.media.tumblr.com/f279ad57d2a06b0471b6eab6d97331e1/tumblr_omo0xiqpiR1rcmvavo1_1280.png\r\n\r\nCon dudas sal&iacute; del servidor actualizado y me fui al de legado, persist&iacute;a el error, aprovechando la instancia para no perder la oferta de esta semana pese al Error que tuve con la Skin de {{champion:143}}  aproveche de comprar la Skin de {{champion:21}}  de Arcadia, con lo cual no me descontaron el RP en ese momento.\r\n\r\nhttps://68.media.tumblr.com/0fbc58083b826985559b43a7cef3cd4f/tumblr_omo0xiqpiR1rcmvavo2_1280.png\r\n\r\nYa que estaba cansado no lo mande esto en ese preciso momento y hoy al ingresar me encuentro con que me descontaron los RP por la compra de la Skin de {{champion:21}} \r\n\r\nhttps://68.media.tumblr.com/4652b13ed8043656f2a10564b34594c2/tumblr_omo0xiqpiR1rcmvavo3_1280.png\r\n\r\nYo lo &uacute;nico que quiero es que me reembolsen los 1350 RP que me cobraron por la doble compra de la Skin de {{champion:143}} , cabe mencionar que no tengo los dichosos 3 y &uacute;nicos reembolsos que ofrecen por que los gaste ya hace mucho tiempo.\r\n\r\nEspero que me puedan ayudar, por que no me puedo dar el lujo de recargar otra vez RP por este tipo de problemas.\r\nsumado a esto ya envi&eacute; un Ticket al Soporte explicando esta situaci&oacute;n , pero no se si se considerar&iacute;a problema t&eacute;cnico o no.","replies":[{"poster":"BackToPartyCity","date":"2017-03-13T14:56:46.913+0000","up_votes":1,"down_votes":0,"body":"Veo que ya te ayudaron en soporte. :)","replies":[]},{"poster":"GatóMonstruo","date":"2017-03-11T20:30:52.062+0000","up_votes":1,"down_votes":0,"body":"Buenas, Cankutso.\n\nTal como te han dicho abajo, debes presentar esta misma información en el [Soporte](https://support.riotgames.com/hc/es-419) para que puedan solucionar tu problema. No es muy complejo de solucionar :) \n\nSi ya enviaste ticket tienes que esperar, recuerda que pueden tardar hasta 24hs en responderlo. Y la categoría realmente no es de gran importancia, el ticket será leído y solucionado de todas formas :)","replies":[{"poster":"Cankutso","date":"2017-03-11T20:47:01.748+0000","up_votes":1,"down_votes":0,"body":"Bueno muchas Gracias con esto ya puedo quedar mas tranquilo","replies":[]}]},{"poster":"señor xin zhao","date":"2017-03-11T20:24:24.039+0000","up_votes":1,"down_votes":0,"body":"wtffff que bug rito plz","replies":[]},{"poster":"Maycoltf2","date":"2017-03-11T20:00:59.877+0000","up_votes":1,"down_votes":0,"body":"Que mal :/ , ya paso esto aquí y Shade lo soluciono pero creo que no trabaja los fines de semana , igual espera a que te contesten en el soporte , no te alarmes si no te contestan mañana ya que no es día laboral.","replies":[]},{"poster":"Forero","date":"2017-03-11T19:59:58.310+0000","up_votes":1,"down_votes":0,"body":"Con la petición al soporte basta, reversaran una compra o abonaran los rp, pero es un problema que pocas veces pasa, y no es difícil de arreglar.","replies":[]}]}