{"poster":"Slue Sin","date":"2015-10-13T01:04:22.847+0000","title":"Me bannearon la cuenta por 14 dias recibo al recompensa?","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":19,"body":"Me bannearon la cuenta por 14 dias recibo al recompensa?\r\nBueno lo que pasa es que yo estaba en platino 2 y fui descendiendo y les juro que fue por los trolls y afks o eloobosteados que hay hoy en dia, y obviamente ya empezas a jugar las partidas medio MAD si te pickean cosas raras o te hacen troll pick xq no lo dejas algo, cuestion me habian baneado el chat por 21 partidas y la verdad es que no flameo exepto cuando me trollean pero la gente que trollea se lo re merece, entonces me banean la cuenta pin pan pun hoy platino 5, estaba por descender creo y me toca un troll 2 veces seguidas obviamente que me caliento y lo flameo pero yo prefiero ser mil veces flamer antes que no tener manos entienden ? y es cualqueira que a mi me baneen la cuenta por flamear y a ellos por trollear no, yo ponele si arruino la moralidad de las personas siendo flamer no ? pero ellos te cagan el game directamente y no se puede jugar por que hoy 12/10 a las 8 de la ma&ntilde;ana empeze a jugar ranked y las 3 primeras rankeds YA HABIAN TROLLS , la primera en contra y la segunda y tercera me tocaron a mi, la verdad calienta y da bronca subir bajar subir bajar por que no se trata de como uno juegue sino de la gente que le toca, hay gente que es realmente incarreable y espero que se tenga encuenta esto para la penalizacion seria realmente injusto que yo no tengo el marco de platino y el skin de sivir habiendome esforzado tanto y poniendo tanto tiempo y no solo tiempo sino tambien RP en el juego ;) espero una respuesta desde ya muchas gracias\r\nNick: Slue Sin\r\nfijense el historial LA GENTE QUE ME TOCA\r\nhttp://www.lolskill.net/summoner/LAS/Slue%20Sin/matches","replies":[{"poster":"DLeppard","date":"2015-10-13T01:18:43.705+0000","up_votes":7,"down_votes":0,"body":"Pues a juzgar por lo que dices y la informacion de tu pagina de lolskill , yo diria : buen trabajo riot!","replies":[]},{"poster":"Silver000","date":"2015-10-13T01:42:09.985+0000","up_votes":5,"down_votes":0,"body":"eres flamer, mereces un ban sin importar la razón que sea","replies":[]},{"poster":"RedPoison","date":"2015-10-13T03:05:27.555+0000","up_votes":4,"down_votes":0,"body":"Me parece muy cara dura tu actitud viejo, que flameas porque se lo merecen? Eso me dice ya todo la verdad es que este juego esta para divertirse si tu te diviertes flameando ese es ya tu problema, yo creo que esta bien sancionarte por eso ya que el flameo es el que más arruina las partidas y la comunidad en si. Saludos ! {{summoner:31}}","replies":[{"poster":"Slue Sin","date":"2015-10-13T03:09:20.103+0000","up_votes":3,"down_votes":6,"body":"Y los que trollean tu partida no arruinan la comunidad ? Yo me divierto. pero me divierto ganando, para reirme me voy a normal se supone que las rankeds vas a jugarlas enserio, y no te digo que tenes que ser perfecto en todo lo que hagas solamente, si estar concentrado no es para boludiar","replies":[]}]},{"poster":"Slue Sin","date":"2015-10-13T01:30:16.479+0000","up_votes":1,"down_votes":8,"body":"Me parece tremendo riot esto eh ;), y de ultima si tan asi son con las reglas exigiria que me devueltan todo el rp que compre ;) porque gasto mucha plata en un juego como para que me ''castiguen'' a mi por instultar a gente que es eloobosteada y que juega mal para ponerte de mal humor por que es eso lo que hacen molestar a gente, por que yo hoy le puse anda a trollear con bots -'' Es que sino no tiene sentido''\nSentido de que ? de cagarle una partida a  una persona anda a saber si puede jugar solo 1 por dia y siempre le toca un troll, banneas al que insulta al que trolea y no baneas al que trolea.\nEs como a la mujer se la enseña a no ser violada en vez de enseñarle al chabon al no violar ;) Buena riot siempre tan buenos ustedes","replies":[{"poster":"kiuhm","date":"2015-10-13T01:34:29.028+0000","up_votes":6,"down_votes":0,"body":"en los termios que aceptaste al crear la cuenta, te dicen que no se devuelve nada de lo que inviertas bajo ninguna circunstancia.","replies":[]}]},{"poster":"EzrealSupportOP","date":"2015-10-13T01:10:17.589+0000","up_votes":3,"down_votes":0,"body":"Nope","replies":[]},{"poster":"Maty097","date":"2015-10-13T04:15:00.768+0000","up_votes":1,"down_votes":6,"body":"No entiendo porque tanto negativo en este post si solo veo la verdad, porque por flamear a un trol te banean, y a ese que te cago y recago el game no le hacen nada? puta injusticia","replies":[{"poster":"angeloide","date":"2015-10-13T16:25:58.336+0000","up_votes":1,"down_votes":0,"body":"vease el caso de Dunkey.. :'(","replies":[{"poster":"Maty097","date":"2015-10-14T16:28:53.755+0000","up_votes":1,"down_votes":0,"body":"Dunkey? y a mi igual me cagaron a negativos xD aguante los flamers vieja","replies":[{"poster":"angeloide","date":"2015-10-16T17:11:24.658+0000","up_votes":1,"down_votes":0,"body":"si, el youtuber dunkey, jugaba muchas ranked y tiene videos de humor. En una partida le dijo algo a un troll, lo permabanearon creo y se armo un quilombo por que a los que flamean los banean. Pero a los que arruinan el juego no. etc etc jaja","replies":[]}]}]}]},{"poster":"II Thanatos II","date":"2015-10-13T18:14:02.336+0000","up_votes":1,"down_votes":0,"body":"Por lo que dijo riot si flameaste pierdes las recompensas, si son trolls o no, eso ya es otro tema, desde que me toco un ban de 15 dias a principio de season paso de escribir nada en chat, solo drag, baron, top, blue pls y eso.","replies":[]},{"poster":"LGBT Valentina","date":"2015-10-13T04:26:30.621+0000","up_votes":2,"down_votes":4,"body":"yo estoy de tu lado\nse merece el flameo aunque pocos les importe\n\ntener a sivir realmente me da = :P\nel marco de diamond si lo quiero :(\n\ncreo que no la recibis\nestoy en duda, por que se que si te sacan el marco y iconos de season anteriores (como castigo y ademas del ban), no las volves a recibir estoy seguro de eso\ncon solo el ban tengo mis dudas, realmente me tiro mas al si (que la recibis)","replies":[]},{"poster":"Rengar Lodbrok","date":"2015-10-13T03:38:38.214+0000","up_votes":1,"down_votes":7,"body":"Lo curioso es que todos los que comentan reprochando la actitud flamer les apuesto 10 skin que han flameado/trolleado en más de una oportunidad, jajajaja gente hipócrita, vienen a hacerse los jugadores ejemplares a este foro.","replies":[]}]}