{"poster":"EinfachMichel","date":"2019-01-08T15:02:09.007+0000","title":"Was ist die MMR / ELO usw.","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hallo. {{sticker:vlad-salute}} \n\nIch spiele jetzt schon seit circa. 3 / 4 Monaten **aktiv** LoL.\nMein Problem ist nur, dass ich einfach drauf los gespielt habe.\nIch habe mich nicht wirklich mit den ganzen Items, nur mit wenigen Begriffen &amp; eben auch wenig mit diesem Elo System vertraut gemacht.\nVielleicht w&auml;re ja jemand so nett &amp; w&uuml;rde mir erkl&auml;ren, was es mit der MMR, der Elo &amp; allgemein mit diesem Ranked auf sich hat, da die Videos die ich mir dazu angesehen habe, sehr unverst&auml;ndlich f&uuml;r einen Neuling wie mich waren. ^^\n\nVielen Dank im Voraus an alle Leute, die mir antworten. ^^\n\n( Ich hoffe mal, dass ich das richtige Forum gew&auml;hlt habe... Wenn nicht tut es mir leid. )","replies":[{"poster":"Humpelstilzche","date":"2019-01-08T15:33:38.666+0000","up_votes":3,"down_votes":0,"body":"MMR und Elo sind quasi das selbe. Elo ist eigentlich kurz für \"Elo-Zahl\", benannt nach Arpad Elo, der sich dieses System für Schach ausgedacht hat. Es ist ein System, dass es erlaubt Skill (d.h. deine Fähigkeit zu gewinnen) in eine Zahl packt. Die Elo-Zahl kann außerdem vorraussagen, wie wahrscheinlich der Sieg für beide Seiten ist, was aber in League relativ egal ist, da beide Teams etwa die selbe Elo-Summe haben. Genauere Infos wie das alles funktioniert, findest du zum Beispiel im[ Wikipedia-Artikel](https://de.wikipedia.org/wiki/Elo-Zahl) dazu.\nMMR bedeutet Match Making Rating und schlicht und einfach der Name des Elo-Systems das Riot verwendet. Wie gesagt, im Prinzip genau das gleiche. \nGanz wichtig: Das MMR ist unsichtbar. Es existiert für jeden Spieler, aber man kann es nicht einsehen. Die MMR-Werte die einige Homepages angeben sind nicht von Riot und im Prinzip nur Schätzungen und können katastrophal falsch sein. Dennoch ist MMR im Prinzip das einzige, was für Matchmaking wichtig ist. \n\nRanked sind Ranglistenspiele. Diese unterscheiden sich in keinster Weise von normalen Spielen, außer dass sie in einem sichtbaren Rang resultieren. Sowohl Normals als auch Rankeds nutzen MMR um deinen Skill zu messen, der einzige Unterschied ist, dass du in Normals deinen Rang nie gesagt bekommst, was ein wenig den Druck rausnimmt und somit auch dazu führt, dass dieser Modus weniger ernst genommen wird. Es geht halt um nichts, man kann dort ohne großen Druck üben, ausprobieren, experimentieren. \nBeide Modi haben ein getrenntes MMR, d.h. wenn du außerhalb von Rankeds ein Spiel gewinnst oder verlierst, hat das keinen Einfluss auf dein MMR im Ranked...und anders rum. \n\nWas du am Ende wissen musst, ist eigentlich nur eine Sache: Willst du im Ranked aufsteigen, musst du so oft wie möglich gewinnen. MMR, Elo, LP, Ligen, Divisionen...das ist im Prinzip alles egal. Das ist entweder Hintergrund-Mathematik oder kosmetisches Beiwerk und nichts davon kannst du beeinflussen. Es gibt keine Tricks, keine geheimen Mechanismen über die man Bescheid wissen muss, keine Strategie mit der man schneller aufsteigen kann oder das sonst irgendwie beeinflussen kann. Man muss gewinnen. Punkt. \n\nWillst du zu irgendwas davon mehr Details oder ist irgendwas noch unklar?","replies":[{"poster":"Alpacana","date":"2019-01-08T15:45:03.037+0000","up_votes":3,"down_votes":5,"body":"Elo und MMR sind **nicht** das Gleiche.\nElo ist eine kosmetische Sicht deines momentan Ranked-Platzes die aber auch von deiner MMR abweichen kann.\nAußerdem gibt es sehr wohl Strategien wie man schneller aufsteigen kann. (z.B. taktisches Dodgen) :/\n\nDer Begriff Elo-Zahl wird, denke ich, schon seit Langem durch MMR ersetzt und neu definiert durch eben die kosmetische Äußerung in Form von z.B. \"Gold 1\". (jedenfalls in League)","replies":[{"poster":"Humpelstilzche","date":"2019-01-08T15:47:15.222+0000","up_votes":6,"down_votes":0,"body":"Das ist leider falsch. Elo ist nicht kosmetisch, denn Elo ist unsichtbar. Du verwechselst Elo mit Rang. \nMMR und Elo sind das Gleiche. MMR und Rang nicht, da passt deine Beschreibung. Elo/MMR ist der mathematische Wert der im Hintergrund verwendet wird, der Rang (also Liga + Division) das kosmetische System das drübergestülpt ist.\n\nSchau dir am besten mal den Link an den ich vorhin gepostet habe, da wird erklärt was Elo ist. Leider wird der Begriff von vielen völlig verkehrt für \"Rang\" verwendet, da bist du nicht alleine mit. ","replies":[{"poster":"Alpacana","date":"2019-01-08T15:53:53.102+0000","up_votes":4,"down_votes":4,"body":"Mir ist bewusst, dass geschichtlich gesehen die Elo-Wertung aus dem Schach kommt. Ich kenne mich jetzt nicht sonderlich mit Schach aus, aber im Schach wäre doch die Elo-Zahl so gesehen die MMR, da es im Schach keine MMR gibt, da dies ja schon die Elo-Wertung übernimmt, bzw wie du schon gesagt hast, es dasselbe ist.\nSchach ist also im Grunde Season 1-League. Das was du von der MMR her bist, bist du auch kosmetisch gesehen (z.B. Meisteranwärter ab 2100 Elo/MMR).\nIn League ist das mittlerweile aber ja eben **NICHT** mehr der Fall. Du kannst kosmetisch gesehen Gold sein, deine MMR aber Diamond betragen.\nIn League haben wir allerdings ein MMR-System (oder eben das Season 1-Elo-System) und nunmal die Elo. Die Elo wurde (war es Season 2 oder 3?) eingeführt, um dem Spieler ein stärkeres Erfolgsgefühl zu vermitteln. So gesehen könnte man auch Rang dazu sagen, das stimmt.\nSo wie es jetzt aber nunmal ist verbindet man Elo mehr mit dem Rang, als mit dem Matchmaking, da Matchmaking nunmal durch die MMR definiert ist und Elo (auch wenn es technisch gesehen falsch ist) den Rang definiert, also das Kosmetische.\nWas du also beschreibst wäre Season 1-League, oder nicht?","replies":[{"poster":"Humpelstilzche","date":"2019-01-08T16:11:33.062+0000","up_votes":5,"down_votes":0,"body":"Es ist nicht nur technisch falsch, es ist schlicht und einfach falsch. Sorry, aber der Begriff \"Elo\" ist fest definiert, der ist nicht nur historisch, den gibt es nach wie vor und in zahlreichen Sportarten und wird aktiv und korrekt verwendet. Zu sagen \"In Leauge ist das aber was ganz anderes\" ist nicht sinnvoll. \n\n> In League haben wir allerdings ein MMR-System (oder eben das Season 1-Elo-System) und nunmal die Elo.\n\nDas ist aber halt nicht MMR und Elo, sondern MMR/Elo. Das ist das selbe, MMR ist der Name unseres Elo-Systems, genauso wie z.B. \"Sonne\" der Name unseres Sterns ist. Aber \"unser Stern\" und \"Sonne\" sind keine zwei verschiedenen Dinge. Letzteres ist nur der Name von ersterem. \n\n>  Die Elo wurde (war es Season 2 oder 3?) eingeführt, um dem Spieler ein stärkeres Erfolgsgefühl zu vermitteln.\n\nNein, das Ligensystem wurde eingeführt^^\nUnd es ging primär darum Ranked-Anxiety zu verringern, d.h. Angst verursacht durch die Überschätzung der langfristigen Bedeutung einzelner Niederlagen und Angst vor sofortigem Abstieg auf eine niedrigere Belohnungsstufe durch einzelne Niederlagen.","replies":[]},{"poster":"Sirrkas","date":"2019-01-08T16:09:54.533+0000","up_votes":3,"down_votes":0,"body":"Riot verwendet Elo und MMR Synonym. Die haben sogar noch einen deutschen Begriff dafür. \n\n\n>Bei der Manipulation der GSW (Gegnersuchenwertung, auch bekannt als ELO-Wertung oder MMR) \n\n[Quelle](https://support.riotgames.com/hc/de/articles/201751834)\n\nDeine Gegnersuchwertung/Matchmakingrating/Elo-Wertung sind alles verschiedene Worte für die selbe Zahl. Ebenso, wie man sagen kann \"du brauchst mehr CS\" oder \"du musst mehr Minions lasthitten\" beides die gleiche Aussage, nur mit verschiedenen Buchstaben.","replies":[{"poster":"Alpacana","date":"2019-01-08T16:15:00.899+0000","up_votes":3,"down_votes":2,"body":"Alles klar, dann sollte @TE in meinem Post also einfach alle \"Elo\"'s durch \"Rang\" ersetzen^^\nGegnersuchenwertung ist ja mal ein ziemlich komischer Neologismus o.o\nGerade nochmal einen Freund der ziemlich begabt in Schach ist ausgefragt:\nLaut ihm gibt es im Schach keine MMR, lediglich die Elo-Zahl. Wieso also benutzt Riot beide Wörter als eine Definition und verwendet sie nicht einfach gleich wie beim Schach?","replies":[{"poster":"Sirrkas","date":"2019-01-08T16:18:14.813+0000","up_votes":2,"down_votes":0,"body":"Frag Riot^^\n\nVermutlich, weil das MMR System auf dem Elosystem vom Schach aufbaut. Ich stelle mir da gerade eher die Frage, wer zuerst Elo verwendet hat. Kam das von Riot auf oder hat sich das einfach bei den Spielern eingebürgert?\n\nHier hab ich noch eine kopierte Supportantwort zu MMR gefunden:\n\nhttps://boards.euw.leagueoflegends.com/en/c/player-behaviour-en/umzsjjOf-riot-support-answer-for-mmr-system-and-leaving-effect-on-outcome\n\nIch tippe aktuell eher darauf, dass Riot MMR benutzen will. Aber da Elo immer wieder aufkommt (und das im Grunde die MMR ist) wird das in dem Abschnitt, den ich weiter oben zitiert habe, eben noch mal deutlich gemacht.\n\nEdit: Laut dem Wikibeitrag aus Humpels Post, wird für Elo beim Schach offiziell auch nicht Elo verwendet. Da ist die offizielle Bezeichnung \"FIDE rating\" \"Elo-Zahl\" ist nur umgangssprachlich. Das wird sich bei LoL wohl ähnlich verhalten.","replies":[{"poster":"DerPunkt","date":"2019-01-08T16:31:53.403+0000","up_votes":2,"down_votes":0,"body":"Das hat damit zu tun das die Elo Zahl einen sehr Klare Formel ist, diese wird dann je nachdem wie man es braucht angepasst. Wenn du im Deutschen WIki Eintrag zu Elo schaust findest du da zb wie das alles für das Spiel GO angepasst wurde. Die ELO Zahl ist also an sich nur die Berechnung einer Zahl. Es gibt dann aber Unterschiede bei bestimmten Einsetzungen in die Formel zum beispiel Gewichtung von Spielen. Neue Spieler kriegen höhere Gewichtung so dass sie schnell ihren Rang erreichen. Elo Apart hatte dafür damals eine Zahl von 40 angesehen die eingesetzt werden muss. Doch die Frage ist bei wie vielen Spielen? Dh die Werte können von Spiel zu spiel anders ausfallen einfach weil anders gewichtet wird. Um hier Verwirrung zu vermeiden hilft es wenn nicht alles ELO heißt sondern man es einfach mit einem Begriff besetzt der zum Spiel passt.\nIch war neulich mal dabei ein Video dazu zu machen, leider komme ich vom 100 ins tausendste und hab dann aufgehört bis ich etwas sicherer bin wie weit so eine Erklärung gehen sollte. GGF mache ich mal ne Video reihe die dieses Rabbit hole langsam immer tiefer herunter geht.","replies":[{"poster":"Sirrkas","date":"2019-01-08T21:05:55.732+0000","up_votes":1,"down_votes":0,"body":"Klingt auch sinnvoll. Ich kann mir gut vorstellen, dass Riot einfach mal geschrieben hat, sie verwenden eine eigene Wertung, genannt MMR, das auf dem Elo-System aufbaut. Und dann haben das welche als Elo bezeichnet. Lässt sich auch viel flüssiger aussprechen.","replies":[{"poster":"DerPunkt","date":"2019-01-08T21:44:32.977+0000","up_votes":2,"down_votes":0,"body":"Nein Riot hat es ja selber Elo genannt. Season 1 und 2 liefen ganz einfach mit dem Elo system, halt für League angepasst. Vermutlich tuned riot das system jede season ein wenig um das die Formel noch besser anzupassen. Und in Season 3 waren sie dann halt der Meinung man müsse es jetzt anders nennen. Technisch gesehen ist es also nicht falsch wenn man MMR als Elo bezeichnet, immerhin ist das die Grundlage.","replies":[{"poster":"Sirrkas","date":"2019-01-08T21:55:38.778+0000","up_votes":2,"down_votes":0,"body":"Ich erinnere mich nicht mehr daran, ob Riot das selber damals so nannte oder nicht.\n\nEdit: Nach dem was sich auf die schnelle dazu finden lässt, war das aber wohl so.","replies":[]}]}]}]},{"poster":"Alpacana","date":"2019-01-08T16:21:39.389+0000","up_votes":2,"down_votes":0,"body":"Naja Elo hat ja dann definitiv Riot (bzw eigentlich Schach) zuerst verwendet, daher kommt es ja schließlich. Da frage ich mich dann allerdings wie jemand auf die Idee kam Elo mit Rang gleichzusetzen, anstatt mit MMR, wenn es doch genau MMR ist.","replies":[{"poster":"Sirrkas","date":"2019-01-08T16:25:43.729+0000","up_votes":1,"down_votes":0,"body":"Wird sich so eingebürgert haben. Wenn die Leute in Season 1 und 2 gefragt haben, was für eine Elo bist du? Kam dann halt die Zahl bzw. Ränge wie Silber und Bronze. Als es das Ligensystem dann gab, wird sich die Frage so gehalten haben. Und da man seine MMR nicht mehr sehen konnte, gibt es eben nur \"Gold/Platin/Bronze\" als Antwort. \n\nDas wäre zumindest die für mich naheliegendste Vermutung.\n\nDanach wird das von vielen eben Synonym für Rang verwendet. Und wenn dann den jemanden fragt \"was ist Elo?\" kommt eben \"deine Platzierung\".","replies":[{"poster":"Alpacana","date":"2019-01-08T16:37:06.991+0000","up_votes":1,"down_votes":0,"body":"Macht Sinn. Der Begriff wäre zwar falsch, jeder weiß aber was gemeint ist wenn es sich vollständig eingebürgert hat. Auch wenn es falsch definiert ist, habe ich es dennoch richtig erklärt oder nicht? Mein ganzer Post funktioniert deshalb ja immernoch, wenn man es nun genau nehmen will müsste man Elo wohl durch Rang ersetzen, der Sinn des Posts geht aber nicht verloren.\nRein von der Definition her hat Humpelstilzche natürlich Recht, Elo ist demnach nicht etwas anderes als MMR, aber rein vom durchschnittlichen Verständnis würde ich sagen der Großteil der Spieler verbindet Elo mit Rang und nicht mit MMR (weil es sich eben bereits eingebürgert hat).","replies":[{"poster":"Awsane","date":"2019-01-08T16:54:07.832+0000","up_votes":2,"down_votes":0,"body":"Also ich kann nur für mich und mein soziales Umfeld sprechen\naber bei uns kann von \n\n> der Großteil der Spieler verbindet Elo mit Rang\n\nkeine Rede sein, weil wir sehr klar zwischen Rang und Elo/MMR differenzieren. \n\nIch wäre auf jeden Fall vorsichtig mit einer Verallgemeinerung dahingehend.","replies":[]},{"poster":"Sirrkas","date":"2019-01-08T21:03:03.788+0000","up_votes":1,"down_votes":0,"body":"Die Frage hier ist, wie viele betrachten den Rang als Elo. Viele werden verstehen, dass du damit wohl die Platzierung meinst, aber das ist auch das einzige, was man selbst einsehen kann.\n\nWenn man die Begriffe aber erklären will, wäre es deutlich besser, die Platzierung auch passend zu bezeichnen. Da Elo eben die MMR ist. ","replies":[]}]}]},{"poster":"Humpelstilzche","date":"2019-01-08T16:26:52.142+0000","up_votes":1,"down_votes":0,"body":"> Da frage ich mich dann allerdings wie jemand auf die Idee kam Elo mit Rang gleichzusetzen, anstatt mit MMR, wenn es doch genau MMR ist.\n\nWie bist du denn auf die Idee gekommen? Die Antwort auf deine Frage ist vermutlich die selbe Antwort^^","replies":[{"poster":"Alpacana","date":"2019-01-08T16:29:12.157+0000","up_votes":1,"down_votes":0,"body":"Naja ich bin auf die Idee gekommen weil es sich inoffiziell ja schon so eingebürgert hat wie du weiter oben bereits sagtest^^\nAber es muss ja irgendwen geben, der das Ganze populär gemacht hat/damit angefangen hat.\n\nMag vielleicht ein übertriebenes (vielleicht nicht ganz passendes) Beispiel sein aber:\nIm Mittelalter haben ja auch alle an Gott geglaubt und es war einfach selbstverständlich, aber es muss ja irgendwen gegeben haben, der damit angefangen hat. Wie kommt man auf so etwas?^^","replies":[{"poster":"Humpelstilzche","date":"2019-01-08T16:53:27.248+0000","up_votes":2,"down_votes":0,"body":"> Aber es muss ja irgendwen geben, der das Ganze populär gemacht hat/damit angefangen hat.\n\nSchlecht informierte Influencer. Also Influencer :P","replies":[]}]}]}]}]},{"poster":"Humpelstilzche","date":"2019-01-08T16:21:27.658+0000","up_votes":2,"down_votes":0,"body":"Schau dir den Wikipedia-Link an. In der Formel für die Elo-Zahl sind Zahlen enthalten, z.B. die 400. Diese lassen sich anpassen. Riot kann andere Werte verwendet haben oder zusätzliche Terme in Teile der Formel eingefügt haben (z.B. muss ja die Elo von 9 Mitspielern berücksichtigt werden, nicht nur von einem selbst und einem Gegner). Das ändert nichts daran, dass es eine Elo-Formel ist, aber es ist dann eben eine spezielle Variante, der man einen Namen geben kann. \nGenauso wie unsere besondere Variante von Stern eben Sonne genannt wird, um mal bei meiner vorherigen Allegorie zu bleiben.","replies":[]}]}]}]}]}]},{"poster":"EinfachMichel","date":"2019-01-08T17:51:54.632+0000","up_votes":2,"down_votes":0,"body":"Wow, vielen Dank für deine ausführliche Antwort. ^^\nIch habe es jetzt endlich verstanden. {{sticker:slayer-pantheon-thumbs}} \nUnd nein, du musst es nicht weiter erklären. :p","replies":[]}]},{"poster":"Sirrkas","date":"2019-01-08T15:31:16.485+0000","up_votes":5,"down_votes":0,"body":"Elo bzw. MMR ist die Wertung, die das System im Hintergrund für dich hat. Das Matchmaking arbeitet danach. Drittanbieterseiten, wie etwa op.gg geben dir niemals deine korrekte MMR oder Elo an. Die haben alle ihre eigenen Schätzwerte, die mal sehr stark und mal weniger stark abweichen. Im Grunde ist das bei denen immer zufallsbasierend. \n\nWichtig ist, deine Elo/MMR verbessert sich bei Siegen und verschlechtert sich bei Niederlagen. Die Spieler werden vom Matchmaking auch nur nach MMR ausgesucht. Es ist egal, ob jemand 70 % oder 20 % Winrate hat. Wenn er deine MMR hat, kann er in deinem Team landen. \n\nZu beachten ist hier auch, dass viele Leute gerne die Begriffe anders verwenden. Manche meinen etwa, wenn sie von Elo sprechen, eigentlich deine Platzierung. Also etwa Bronze 2, Gold 4, Platin 1 etc. \n\nBasierend auf deiner MMR erhältst du LP und kannst auch Divisionen und Aufstiegsserien überspringen. Wenn man etwa Bronze 4 platziert ist, aber eine Silber 1 MMR hat, wird man gegen andere mit Silber 1 MMR antreten. Bei denen könnte etwa Gold 4 angezeigt werden oder Silber 3. Wichtig ist aber, die haben sich alle irgendwie die Silber 1 MMR verdient. Sei es, weil sie gerade sehr gut am aufsteigen sind, sie am absteigen sind oder weil die Einstufung in die Rangliste mal nicht ganz so gut funktioniert hat, wie sie sollte. \n\nWenn man jetzt Bronze 4 ist und eine Silber MMR hat, darf man damit rechnen, etwas wie +30 LP und -8 LP nach einem Spiel zu erhalten. Das liegt daran, dass das System dich näher an deine MMR bringen will und die Platzierung sehr weit davon entfernt ist. Wenn man es anders betrachtet, macht es natürlich auch keinen Sinn, von B4 nach Eisen 1 abgestuft zu werden, obwohl man gegen oberes Silber verloren hat. Deshalb wird man sich auch mit einer Winrate von 50 %, in der Platzierung hocharbeiten können.","replies":[{"poster":"Cenâreth","date":"2019-01-09T10:09:08.041+0000","up_votes":1,"down_votes":0,"body":"Deshalb wird man sich auch mit einer Winrate von 50 %, in der Platzierung hocharbeiten können.\n\nAber wäre es nicht effektiver wenn jeder die Chance bekommt sich bei einer Winrate von 54% sich hocharbeiten zu können anstatt vom System 50 % Winrate vorgegeben zu kriegen? Ich mein Spieler die sich nicht hocharbeiten wollen werden eh nicht auf die 50 % Winrate kommen.","replies":[{"poster":"Sirrkas","date":"2019-01-09T12:19:24.832+0000","up_votes":1,"down_votes":0,"body":"Was genau meinst du?\n\nLangfristig wird fast jeder 50 % Winrate haben. Jeder hat die Chance sich schneller hochzuarbeiten, vorausgesetzt, er spielt entsprechend besser.","replies":[{"poster":"Cenâreth","date":"2019-01-09T12:33:00.758+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=ip27PlEH,discussion-id=RUN4LR3n,comment-id=000000000000,timestamp=2019-01-09T12:19:24.832+0000)\n>\n> Was genau meinst du?\n> \n> Langfristig wird fast jeder 50 % Winrate haben. Jeder hat die Chance sich schneller hochzuarbeiten, vorausgesetzt, er spielt entsprechend besser.\n\nAlso wenn jeder 50% Winrate hat, kommt er in etwa jeweils 1 Divison pro Season hoch, dass würde bedeuten bei 6 Klassen, dass er etwa 24 Seasons jede Season 1 Div hochkommt bevor er nach 24 Seasons Challenger erreicht. Macht ein bisschen wenig Sinn oder etwa nicht?","replies":[{"poster":"Sirrkas","date":"2019-01-09T17:23:44.363+0000","up_votes":1,"down_votes":0,"body":"Ich glaube du verstehst nicht ganz, worauf sich meine 50 % Winrate vorher bezog. Es ging mir darum, dass man mit einer Einstufung unterhalb der eigenen Leistung auch mit 50 % Winrate aufsteigen wird, wenn deine MMR höher als deine Platzierung ist. Da sich die MMR so nicht wirklich verändert, man aber mehr LP gewinnt als verliert. Keine Ahnung, wie du da auf \"jeder steigt mit 50 % Winrate auf\" gekommen bist.","replies":[]}]}]}]}]},{"poster":"Alpacana","date":"2019-01-08T15:42:27.163+0000","up_votes":6,"down_votes":5,"body":"Edit: Ersetze \"Elo\" durch \"Rang\"\n\n\nAlso, im Grunde gibt es 2 wichtige Dinge.\nEinmal die MMR und dann noch die Elo.\n\nElo ist im Grunde deine angezeigte Division, wie du sie auf Profilen siehst (Bsp. Gold 2). Elo ist nur dazu da, um bildlich zu sehen, wie weit oben du gerade in der Ranked-Ladder bist. Es gab Seasons, wo das Elo-System noch nicht existierte und man nur seine MMR in Form einer Zahl gesehen hat (z.B. eine MMR von 2000).\nDa man mit so einem System aber kein wirklich großes Erfolgsgefühl bekommen hat, wurde das Elo-System  eingeführt. Ist ja auch verständlich. Sagen zu können \"Ich bin endlich Diamond\" hat einen viel größeren \"Wert\" als sagen zu können \"Ich bin endlich bei einer 2300 MMR angelangt\", auch wenn es im Grunde nichts Anderes aussagt.\n\n\nMMR dagegen ist komplizierter.\nMMR (Match-Making-Rating) sagt aus, mit welchen Leuten du tatsächlich im Ranked gematched wirst. Im Normal-Fall gibt es da im Elo-System keine großen Unterschiede, Dia 4-Spieler sollten im Normal-Fall auch mit anderen Dia 4-Spielern gematched werden.\nEs kann allerdings passieren, dass z.B. ein Gold 1-Spieler mit Diamond-Spielern gematched wird, weil seine MMR so hoch ist wie der Durchschnitt von Dia-Spielern. Wie das passiert erkläre ich weiter unten.\nZunächst aber erst einmal:\nWenn du neu ins Ranked startest, liegt der Startwert deiner MMR bei genau 1200. Wenn man das mit einer Elo-Anzeige verbildlichen würde, wäre das ca. mittleres Silber.\nSpielst du nun Spiele, gewinnst und verlierst du MMR, basierend auf der Durchschnitts-MMR deines und des Gegner-Teams.\nGehen wir hier einfach mal ein Beispiel an.\nDu startest gerade neu ins Ranked, wirst also mit Leuten des mittleren Silbers in deinem ersten Game gematched.\nDu bist vielleicht neu im Spiel, daher auch vielleicht etwas schlechter als diese Elo und verlierst das Spiel.\nDurch den Lose verlierst du jetzt sagen wir einfach mal 47 MMR.\nDa du bei 1200 gestartet bist, hast du nun 1153 MMR.\nJetzt spielst du weiter und verlierst noch 3x.\nJetzt dürftest du bei ca. 1000 MMR sein, was schon nicht mehr im Durchschnitt mittleres Silber ist, sondern evtl schon Bronze.\nDu wirst nun also mit Bronze-Leuten gematched, selbst wenn du noch nicht aus Silber abgestiegen bist.\n\nDu siehst also schon ungefähr wie dieses System funktioniert.\nDas Ganze geht natürlich in die andere Richtung genauso gut.\nAngenommen du bist momentan Silber 2 und gewinnst 30 Spiele hintereinander. Deine MMR erhöht sich also um ein Vielfaches wie deine Elo.\nSo kann es passieren, dass du z.B. in deiner Win-Streak Gold 3 bist, deine MMR aber schon einen Wert hat, den durchschnittlich Platin-2-Spieler besitzen.\nSomit spielst du also mit + gegen Platin-Leuten, obwohl du Gold 3 bist. Das erkennt das System natürlich und merkt, dass hier etwas nicht stimmt. Du hast so gesehen für deinen Skill also eine viel zu schlechte Elo. Deshalb wird dir das System mehr LP geben und du wirst im besten Fall sogar Divisionen überspringen, denn das System möchte dich immer schnellstmöglich in die Elo bringen, in die du skilltechnisch auch gehörst.\nSo kommt es dann also z.B. vor, dass du Gold 2 überspringst und nach deiner Gold 2-Promo direkt in Gold 1 landest.\nAndersrum natürlich: Wenn du viel mehr verlierst wirst du auch immer weniger LP pro Sieg bekommen, da das System nunmal denkt, du gehörst skilltechnisch weiter nach unten, also wieso sollte es dir dann LP geben?\nUm dieses Problem zu fixen gibt es auch verschiedene Möglichkeiten.\nAngenommen du hast nun 2000 Rankeds gespielt, bist aber permanent in Gold 4. Du wirst also nicht besonders viele LP bekommen, da das System sieht, dass du nunmal in die Elo gehörst in der du gerade bist.\nUm wieder mehr LP zu bekommen musst du dem System also beweisen, dass du besser als deine momentane Elo bist. Ergo musst du sehr viel gewinnen.\nUnd das bringt uns auch gleich zum nächsten Punkt.\nMMR bekommt/verliert man pro gewonnen/verlorenem Spiel. Dodges fallen da nicht mit rein! Das ist sehr wichtig! Wenn du also ein Spiel siehst, welches in der Champ Select schon so gut wie verloren ist (z.B. jemand kündigt das Inten an und picked Nunu mit Ghost + Cleanse) ist es wahrscheinlich besser du dodgest dieses Spiel und verlierst eben 3LP, anstatt das Game zu spielen, ca. 20LP zu verlieren und das Wichtige: Noch MMR zu verlieren.\n**Denn das Wichtige in Ranked ist nicht die Elo oder deine LP, sondern deine MMR!**\nKlar, am Ende der Season ist die Elo dann doch sehr wichtig, es bringt aber nichts dir deine MMR während der Season zu versauen, sodass du wenig LP bekommst, denn dann brauchst du mehr Spiele um aufzusteigen.\n\nDazu sei aber auch noch gesagt: Die MMR-Formel kennt **niemand** und wird dir **niemand** sagen können. Mein Beispiel mit den -47 MMR ist ein Fallbeispiel, was auf keinen Fall zu ernst genommen werden sollte! Es dient lediglich dazu, zu veranschaulichen wie das System ungefähr funktioniert.\nAuch Seiten wie op.gg kennen diese Formel nicht, können dir also **niemals** sagen, was denn jetzt genau deine MMR ist. Seiten wie op.gg haben zwar Zugriff auf die API von Riot Games, verwenden aber eine andere Formel um die MMR zu berechnen. Also nur weil op.gg dir sagt, dass du eine Platin-MMR hast obwohl du Silber bist darfst du dich nicht wundern, wenn du wenig LP bekommst. Die Werte auf op.gg sind Richtwerte, die aber auch vollkommen daneben liegen können!\n\nFalls noch weitere Fragen aufkommen immer her damit, kannst mich auch adden, dann werde ich sie dir schneller beantworten können^^","replies":[{"poster":"DerPunkt","date":"2019-01-08T16:24:29.234+0000","up_votes":1,"down_votes":0,"body":">Elo ist im Grunde deine angezeigte Division, wie du sie auf Profilen siehst (Bsp. Gold 2). Elo ist nur dazu da, um bildlich zu sehen, wie weit oben du gerade in der Ranked-Ladder bist. Es gab Seasons, wo das Elo-System noch nicht existierte und man nur seine MMR in Form einer Zahl gesehen hat (z.B. eine MMR von 2000).\n\nSchlicht Falsch\n\nEs gibt ELO, MMR und Rank (Rang)\n\nElo war das alte system. Wurde von Riot in MMR umbenannt (vermutlich da mitlerweile von System Elo stark abweichend) und Rang/Rank ist dann was dir angezeigt wird.\n\nDer Rank entspricht nur sehr grob deiner errechneten Stärke (MMR/(ELO) ) folgt dieser aber durch Trends (sehr hohe ELO und niedriger Rang führt zu schnellerem Anstieg des Rangs als üblich (mehr LP als normal pro Spiel)","replies":[{"poster":"Alpacana","date":"2019-01-08T16:26:22.599+0000","up_votes":2,"down_votes":0,"body":"Diskussion gab es schon weiter oben in dem anderen Kommentar, ist alles bereits aufgeklärt :) Wie dort schon gesagt: Ersetze alle meine \"Elo\"'s durch \"Rang\"","replies":[]}]}]},{"poster":"OT Riku","date":"2019-01-09T21:24:17.785+0000","up_votes":1,"down_votes":0,"body":"https://boards.euw.leagueoflegends.com/de/c/level-up-guides-tipps-de/c0e2BmdT-der-ranked-guide-far-dummies-i-am-a-champion\n\nLies dir das auch einmal durch, ist definitiv nicht verkehrt.","replies":[]},{"poster":"Awsane","date":"2019-01-08T15:43:45.905+0000","up_votes":1,"down_votes":0,"body":"Ich verlinke der Vollständigkeitshalber noch mal den MMR-Info Post\n\nIch weiß der ist angeheftet, aber ich finde man übersieht in doch recht einfach.\nDa steht sehr ausführlich vieles drin.\n\nhttps://boards.euw.leagueoflegends.com/de/c/ligen-gewertete-spiele/IqBzFyO9-der-informationsthread-aber-ligen-mmr-und-hidden-elo","replies":[{"poster":"EinfachMichel","date":"2019-01-08T17:53:55.287+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank! ^^","replies":[]}]},{"poster":"Stichsaege","date":"2019-01-08T17:36:11.629+0000","up_votes":1,"down_votes":7,"body":"Die Grünen werde die es zwar nicht sage, aber ich mache es jetzt.\n\nWenn du oder dein Team von ein andern Spiel allein zerstört wir , als wenn ihre 5 gegen ein verlier liegt das daran das er Smurfst.\n\nSmurfen ist wenn man mit ein Zweit Acc spielt, allso wenn sich ein Profie als Anfänger ausgibt.\n\nDa du sicher eine der einzigen in den Team bist der kein Smurf ist wird du sich oft deswegen beleidigt.\nSomit ist auch dein ELO / Mmr auch kein richtiges Maß das es lediglich dein Mindestmaß angint , nicht dein Maximalenwerdt","replies":[{"poster":"MrOrange2013","date":"2019-01-09T00:17:47.498+0000","up_votes":1,"down_votes":1,"body":"Das ist das Süßeste, das ich jemals gelesen hab :D","replies":[]}]}]}