{"poster":"PeaceK33per","date":"2015-11-06T12:39:07.688+0000","title":"Champion Concept Kit","subforum":"Player Creations","up_votes":1,"down_votes":1,"body":"Samurai like champion that can get tired or active, making players carefully think when they should attack while staying in combat.\n\nPassive: Battle Exertion\nWhen in combat or near an enemy champion, you generate Exertion up to 100. Each point Exertion reduces the health cost of your abilities which all cost 100 by 1, eventually reducing the cost to 0. Using abilities with max Exertion amplifies the ability. Using abilities with no Exertion rusts the ability. Your abilities become unusable at 200 health, regardless of Exertion. You regenerate 10 Exertion each time enemies are hit by your abilities. This regenerate amount is multiplied by 2 for 5 seconds and stacks up to a multiplier of 5.\n\nQ: Frontal Sweep\nSweep everything in of you quickly with your sword sheathed from left to right, dealing 50% of attack damage as physical damage. Using this ability with max Exertion makes you fast enough to unsheathe your blade, increasing the attack damage percentage to 100/115/130/145/160% and converting the physical damage to true damage. Using this ability with no Exertion will slow this ability&#039;s movement and immediately stop this ability&#039;s movement if an enemy is hit.\n\nW: Pounding Rain\nYour next basic attack will deal 20% of your attack damage as true damage five times. Using this ability at max Exertion will add five additional strikes and leave a mark after all hits that explodes after 1 second, dealing true damage equal to 40/50/60/70/80% of true damage and slows by 20/25/30/35/40% for 1 second. Using this ability with no Exertion will reduce the amount of strikes to two.\n\nE: Tiger Leap\nLeaps a distance. If you leap onto a wall, the ability changes into Feline Rebound, granting a second leap for 3 seconds. This opportunity is lost if the time runs out or if you move your character. Using this ability with max Exertion will add two additional leaps and damage enemies you pass through, dealing true damage equal to 30/35/40/45/50% of your attack damage. Using this ability with no Exertion will negate Feline Rebound.\n\nUltimate: Moon Streak\nThis ability will always channel for 1 second and properly work only when used at max Exertion. Exertion will only be consumed after channeling. Should one attempt to use this ability early and finish channeling will be penalised with health cost, depletion of remaining Exertion, a stun for .25 seconds and slow for .75 seconds after. When properly used, you slice the ground vertically in front of you, launching a moon shaped projectile that deals true damage equal to 160/180/200% to enemies upon contact while rapidly slowing them for 30/60/90% for .25 seconds and dealing true damage equal to 20/22.5/25% over time for 1 second after contact. This ability fully regenerates Exertion.\n\nI wanted to make this champion someone who doesn&#039;t spam his skills or instantly burst someone the moment they see them. This was to make a champion who&#039;d patiently wait for his resource bar to fill up and strike his enemy with a strong move. His ultimate allows him to slow his enemy down and follow up with a max Exertion ability. I&#039;ve made this character revolve around his passive. I&#039;ve made button mashers feel a penalty for mashing their buttons in hope of survival. Mashing buttons will cost you your life. It&#039;s going to be hard to generate any Exertion fast enough before you die so managing to use a max Exertion skill will be highly rewarding. Comment about it :)\n\nStuff Added or Removed\nI also added to the passive an Exertion regenerating multiplier so you aren't so helpless in combat, gave specifics to the ultimate and changed the damage to true damage. I removed Pounding Rain's ability to apply on-hit effects because you guys may want to build tanky, and you regenerate Exertion equal to the amount of hits. Pounding Rain does true damage, deals higher true damage and slows them after 1 second at the end of the hits. Added scalings per point in ability for max Exertion. More broke than ever. >:)","replies":[{"poster":"Tele","date":"2015-11-06T21:02:19.649+0000","up_votes":1,"down_votes":0,"body":"Sounds like a ninja Darius to me.","replies":[{"poster":"PeaceK33per","date":"2015-11-07T00:43:40.199+0000","up_votes":1,"down_votes":0,"body":"You're right, since you need to do some things to achieve high damage. But Darius has better sustainability and can easily reach max Hemorrhage by hitting multiple enemies in one go with q or finishing off a weak target with ult. This guy's power takes long to generate since you only get Exertion by being in combat or near an enemy champion, hitting or being hit doesn't effect the resource bar.","replies":[]}]}]}