{"poster":"MakingIdle","date":"2016-11-06T04:22:24.475+0000","title":"¿Que aprendo de gente como esta?","subforum":"Charlas Generales","embed":{"description":"Please read our Terms of service about our image hosting before uploading anything to avoid image deletion. Porn, hate related images, copyrighted material, and any abusive content to the network is NOT ALLOWED on the site. Thanks.","url":"https://kn3.net/6027B13717EPNG.html","image":"https://k60.kn3.net/27B13717E.png"},"up_votes":1,"down_votes":1,"body":"Cada noche, cada vez que me pongo a jugar lol, aprendo cosas nuevas, me lleno de experiencias buenas y de malas. Pero siempre intento sacar partido de lo mejor. No se como estar&aacute; sostenido el sistema de emparejamiento, pero me toco jugar contra enemigos en liga platino y oro, siendo todo mi equipo  de nivel menor a 30, sin maestrias y runas completas. No se si es bueno que tenga que bancarme el &quot;abuso&quot; que provocan estos jugadores, tanto en el juego (porque obviamente llevan mas tiempo que yo) y verbal. Por suerte, mi equipo nunca se flammeo, siempre estuvimos dispuestos a enfrentar a un enemigo un tanto imposible. No se.... Que deberia aprender de todo esto? {{item:3151}} \n\nhttps://kn3.net/600EBF71A15JPG.html \n\nhttps://kn3.net/6027B13717EPNG.html","replies":[{"poster":"Blue Striker","date":"2016-11-06T10:53:05.727+0000","up_votes":1,"down_votes":0,"body":"no puedo ver niuna mierda, no se puede aplicar zoom -.-","replies":[]},{"poster":"9081913DEL1","date":"2016-11-06T10:40:29.010+0000","up_votes":1,"down_votes":0,"body":"El emparejamiento es eso emaprejar. Te doy unos tips. Si jugas en PREMADE, te va a tocar muy probablemente un premade enemigo, Con lo cual, puede que emparejar dos premades no sea lo optimo. A ver 3 bronces, uno con un wr de 80% (bastante en bronce) Te puedo poner tranquilamente a otro premade de 2 broces y un oro 5.\nOtra cosa es esa, si venis con winrate alto, van a salir cada vez mejores enemigos, eso es el sistema de mejora y desafio, lol esta pensado para que seas mejor jugador al final de cada partida. Hay un video muy gracioso que se llama \"por que no eres challenger\" miralo.\n\nTodo esto sin tener encuenta al equipo completo. Si venis en racha, si tu mmr no concuerda con tu liga o \"si de repente mejoraste\" tus enemigos seran elegidos en funcion de tener una partida equilibrada. Recuerda que se busca eso que haya iguales chances de ganar.\n\nOtro tema es que la liga no representa la habilidad, y menos en las.\n\nSi ves oros enfrente (a fin de temporada) muy probablemente llegaron por su marquito, no creas que son buenos solo por eso. \n\nSaludos.","replies":[]},{"poster":"Chisolin","date":"2016-11-06T04:26:05.774+0000","up_votes":1,"down_votes":0,"body":"Eso nos deja una única enseñanza... El sistema de baneo no esta funcionan del todo bien...","replies":[{"poster":" Acantha","date":"2016-11-06T06:10:05.541+0000","up_votes":1,"down_votes":0,"body":"El sistema de baneo si funciona, lo que no funciona es el sistema de emparejamiento.\nEntras a lolskill durante carga la partida y te das cuenta que tu team es puro bronce y el enemigo oro. 0 lógica. Se supone que en las normales uno debería aprender algo pero jugando con jugadores que te llevan mucha ventaja en experiencia... \nhttps://31.media.tumblr.com/e697dfd2f0a04e073c8969019b439a29/tumblr_nbzycuFYzb1qm16gpo1_500.gif","replies":[{"poster":"9081913DEL1","date":"2016-11-06T10:35:09.144+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Brayanador,realm=LAS,application-id=v7qsfXsE,discussion-id=AEnWspft,comment-id=00000000,timestamp=2016-11-06T06:10:05.541+0000)\n>\n> El sistema de baneo si funciona, lo que no funciona es el sistema de emparejamiento.\n> Entras a lolskill durante carga la partida y te das cuenta que tu team es puro bronce y el enemigo oro. 0 lógica. Se supone que en las normales uno debería aprender algo pero jugando con jugadores que te llevan mucha ventaja en experiencia... \n> https://31.media.tumblr.com/e697dfd2f0a04e073c8969019b439a29/tumblr_nbzycuFYzb1qm16gpo1_500.gif\n\nClaaaaaro tu problema es que el enemigo es oro.\n\nSaludos.","replies":[]}]}]}]}