{"poster":"Charlôtte","date":"2017-04-16T18:14:56.774+0000","title":"¿Cómo se armarán los Kindred de la 7.8?","subforum":"Guias y consejos","up_votes":5,"down_votes":0,"body":"&iquest;Alg&uacute;n analista que sepa calcular c&oacute;mo ser&aacute;n los nuevos Kindred? _(alg&uacute;n colorado experto en gameplay &lt;3)_\r\n\r\nTeniendo en cuenta que de momento el runaan s&oacute;lo aportar&aacute; velocidad de ataque (ya no aplica da&ntilde;o f&iacute;sico adicional, porque no se usa m&aacute;s el arco curvado), la cuchilla oscura tendr&aacute; menos penetraci&oacute;n de armadura por acumulaci&oacute;n, el ca&ntilde;on de fuego r&aacute;pido har&aacute; menos da&ntilde;o en late, el llamado del verdugo (heridas graves) es m&aacute;s caro, el &uacute;ltimo suspiro tiene menos penetraci&oacute;n de armadura, la daga statikk se le reduce el da&ntilde;o a los s&uacute;bditos... \r\nNo s&eacute; que voy a buildearle. &iquest;sigo con la build de da&ntilde;o por segundo siendo que incluso actualmente est&aacute; floja?\r\nTen&iacute;a pensado algo como {{item:1408}} {{item:3812}}/{{item:3072}}{{item:3147}}{{item:3153}} (no est&aacute;n en orden), pero m&aacute;s o menos. Tendr&iacute;a una buena cantidad de AD, sumadas a runas de probabilidad de critico. o sea, sin velocidad de ataque...\r\n\r\nNo s&eacute;, la verdad ya pienso que pickearlos va a ser trollear D: Quiero algo m&aacute;s oriendado al early/mid, va a ser imposible llegar a late con la build de ahora, 70 de AD hasta el minuto veintipico, con unas buenas marcas apenas llegar&iacute;a a los 120 de da&ntilde;o. \r\nLa otra vez jugaba 3vs3 y la pickee, nuestro brand ten&iacute;a casi 20 m&aacute;s de AD que yo a eso del nivel 11, daba l&aacute;stima  D:  (teniendo en cuenta que es m&aacute;s dif&iacute;cil conseguir marcas en el bosque retorcido...)\r\n\r\nNo s&eacute; como lo ven ustedes. &iquest;Alguno tiene una bulid distinta que use actualmente? &iquest;Qu&eacute; se les ocurre para la pr&oacute;xima versi&oacute;n? \r\n\r\nGracias por leer :D","replies":[{"poster":"Nywt","date":"2017-04-16T18:27:27.635+0000","up_votes":1,"down_votes":1,"body":"Yo era main kindred, pero esta realmente muy flojo, cuando le quitaron la curacion de la w se dificultó todo, porque kindred esta orientado al mid game... y sin la w no tiene un buen 1v1 en early, cualquier jg le puede ganar precticamente.\nCreo que sin un buffo me voy a ir despidiendo de kindred.","replies":[{"poster":"Chisolin","date":"2017-04-16T18:30:18.053+0000","up_votes":2,"down_votes":1,"body":"Le quitaron la curación de la W y le pusieron una ralentización, se la quitaron, después le quitaron la reducción de CD de la Q cuando usabas la W, le subieron el CD a la Q, le quitaron la selección de objetivo de la R, me olvido de algo?\nUno de los campeones mas nerfeados que hay","replies":[{"poster":"TheFalc","date":"2017-04-16T19:34:52.752+0000","up_votes":2,"down_votes":0,"body":"https://i.ytimg.com/vi/dZ2OozKTrRo/maxresdefault.jpg","replies":[{"poster":"Send Núdes","date":"2017-04-16T20:51:31.696+0000","up_votes":1,"down_votes":0,"body":"Almenos irelia con todo el nerf sigue rompiendo ortos :v kindred esta useless mal","replies":[{"poster":"Chisolin","date":"2017-04-16T22:11:06.630+0000","up_votes":1,"down_votes":0,"body":"La nerfearon? Cuando? Yo la veo igual de rota que siempre .-.\n\nPero es uno de esos champs rotos que conmigo no están rotos xD","replies":[{"poster":"TheFalc","date":"2017-04-16T23:10:04.672+0000","up_votes":1,"down_votes":0,"body":"no, es un meme, la nerfearon como 5 parches consecutivos cuando habia otros campeones que estaban desbalanceados y no tocaron jajajaj","replies":[]}]}]}]},{"poster":"ImNw","date":"2017-04-16T23:09:23.252+0000","up_votes":1,"down_votes":0,"body":"Creo que explicaste mal, Le quitaron la curacion a la W y le pusieron una relentizacion, la relentizacion sigue, el reseteo de la Q le aumentaron el tiempo no se la quitaron por completo, aunque realmente da asco esperar como 4 seg, es lo mismo que esperar los 9 seg,, y si no me equivoco tambien le bajaro nel daño a la Q(Stakea con la pasiva) y le bajaron el daño y el slow a la E y el resto esta bien.","replies":[{"poster":"Chisolin","date":"2017-04-16T23:19:19.350+0000","up_votes":1,"down_votes":0,"body":"Mira si me parecerá lo mismo 9s que 4s como para no darme cuenta que aun tenia esa reducción xD\nLo que si la he usado recientemente y no he notado que aun tenga la ralentización con la que se reemplazo a la curación, para mi era incluso mejor que la curación ya que el rojo y azul no alcanzaban a tocarme","replies":[{"poster":"ImNw","date":"2017-04-17T01:52:47.392+0000","up_votes":1,"down_votes":0,"body":"obviamente pero bueno es lo que hay :c","replies":[]}]}]},{"poster":"Nywt","date":"2017-04-16T19:14:59.198+0000","up_votes":1,"down_votes":0,"body":"Se, creo que deberian crear alguna cosa que le haga mas resistente en los 1v1 en early","replies":[]}]}]},{"poster":"Handel14","date":"2017-04-16T18:24:13.702+0000","up_votes":2,"down_votes":0,"body":"los cambios a los objetos de critico fueron retirados del 7.8 para volver a ponerlos en el 7.9 xd","replies":[]},{"poster":"Rohaerlynn","date":"2017-04-16T20:18:11.671+0000","up_votes":1,"down_votes":0,"body":"Yo soy main kindred (kzi) y te voy a explicar de forma  basica como me gusta jugar el champ\n\nSiempre parto con \n{{item:1041}} {{item:2031}} {{item:3340}} y empiezo del lado opuesto de donde va el jungla del team enemigo, hago mi primer buffo y voy saltando la pared del dragon/baron a lo shaco para robarle su segundo bufo, un error que cometen muchos jugadores de kindred, es pensar que el champ tiene poco early, una vez alcanzado el nivel 3, solo hay 3 junglas que pueden ganarle el 1v1 a kindred, y son {{champion:64}}  {{champion:121}} y {{champion:35}}  (con ignite asi que chiste :u)\n\n\nDe primer back siempre compro {{item:3715}}  {{item:1001}}  {{item:2055}}  ya que el sable del escaramuzador de te da un 1v1 muy efectivo, kindred tiene una velocidad de movimiento base que es equivalente a la de un minion (literal) es lentisima caminando.\n\nMi build para el minuto 20 es algo asi como esto \n{{item:1419}} {{item:3006}} {{item:3153}} si tengo 5-7 marcas\no en su mejor caso si estoy stompeando muy fuerte y tengo 10+ marcas\n{{item:1419}} {{item:3006}}{{item:3124}} \ny despues de eso la hoja del rey\nde ultimos dos/tres items me hago primero {{item:3026}}  porque mi daño ya es suficiente en cualquiera de los dos casos (antes del angel primero un {{item:1053}} si me arme guinso de segundo item en lugar de hoja del rey) luego {{item:3085}} , {{item:3046}} u {{item:3153}} depende de que necesite mas, si el 1v1, el wave clear, o el robo de vida (ya para este punto es innecesario hacer la guinso si no la hiciste antes\ntambien podes elejir entre hacer un {{item:3036}} {{item:3033}} o {{item:3071}}  si hay muchos acorazados. \nsuerte","replies":[]},{"poster":"Dog Bulling","date":"2017-04-16T19:55:31.039+0000","up_votes":1,"down_votes":0,"body":"Veamos, Kindred busca el aplicar efectos de impacto de sus ridiculamente potentes básicos. Dudo seriamente que cambie ese objeto a una build de AD. También debes recordar que los escalados de Kindred son lo siguiente a penosos (Su Q escala con el 20% de su AD extra), haciendo que el guerrero sea totalmente inviable, en serio lo digo, y también es la razón de porque no rinde de ADC.\n\nDebería conservar su build inicial de {{item:1419}} {{item:3006}} {{item:3085}}. En cuanto a los otros tres objetos, supongo que se mantendría igual {{item:3022}} {{item:3071}} {{item:3153}} .\n\nEl problema de Kindred es que su pasiva es ridículamente poderosa (1,25% de la vida máxima del individuo con cada ataque, por cada marca acumulada. Perfectamente puedes llegar a quitar más de 1000 de vida por segundo a un tanque, sin hacerte AD), por lo que el daño de sus demás habiilidades son prácticamente nulos, debido a la lógica de riot, la cual decía que era mejor nerfear todo lo demás (en este caso prácticamente todas sus herramientas defensivas y daños base) en vez de bajar lo ridículamente roto, intentando escudarse en el \"ES PARTE DE LA IDENTIDAD DEL CAMPEÓN\", una de las excusas más malas que he oido jamás.\n\nResultado: Kindred se siente muy debil, incluso cuando no esta tan mal como lo pintan (50% de winrate actualmente, aceptable). A nivel 18 solo tiene 83 de AD base, su Q no suele pegar más de 150 a un campeón, su W solo es un decorado para dar movilidad y su E la cual no llega a ser más que un mísero slow en el juego tardío. La sensación que transmite, más que ser unos seres eternos que buscan fortalecerse cazando en la jungla rival y a sus rivales también, es la de unas presas intentando ser cazadas por el jungla rival (y los picuchillos) durante el early.\n\nPD: Va a ser en el parche 7.9, pero se entiende lo que se dice.","replies":[]},{"poster":"TheFalc","date":"2017-04-16T19:40:49.235+0000","up_votes":1,"down_votes":0,"body":"7.8 podria armarse asi:\n{{item:1418}} Navaja de Sangre: Mas daño por segundo\n{{item:1408}} Guerrero: Mas burst\n(no se cual prefiere kindred, azul verde o rojo)\n{{item:3153}} Espada del Rey Arruinado: Mas daño por segundo y robo de vida\n{{item:3085}} Huracan de Runaan: Mejor clear en la jungla y mejor pelea de equipos\n{{item:3071}} Cuchilla Oscura: Mas resistencia y reduccion de armadura a los enemigos\n{{item:3078}} Fuerza de la Trinidad: Convinaba cuando su W+Q tiene poco enfriamineto, pero no lo compres si ya tenes cuchilla, acumulan pasivas\n{{item:3047}} Tabi de Ninja: Fuertes en el Meta\n{{item:3117}} Botas de Movilidad: Mayor presencia en el mapa\n{{item:3006}} Botas de Berserker: Mayor daño por segundo","replies":[]},{"poster":"soyunmagikarp","date":"2017-04-16T19:37:29.766+0000","up_votes":1,"down_votes":0,"body":"yo seguiré haciéndome la build dps critico en top, si no te sacan ventaja con {{item:3153}} y {{item:3085}} te haces el mid game aparte si en mid game sacas marcas ya carrea sola {{champion:203}}","replies":[]},{"poster":"LGBT Valentina","date":"2017-04-16T19:35:32.030+0000","up_votes":1,"down_votes":0,"body":"la build es bloodrazor-bork-runnan-sterak-frozeen, el sterak se cambia x malmortius vs ap y el frozen puede ir antes si necesitas el kite o el hp\n\nrunas 20%-35% as y stormraider de maestria","replies":[]}]}