{"poster":"iTz Jan","date":"2015-09-15T11:50:06.837+0000","title":"Fake seiten","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":1,"body":"ich hab ein kumpel dessen acc wahrscheinlich gehackt wurde . jz ist er seit kurzem wieder online und ich bekomm fake seiten von lol geschikt wo es hei&szlig;t das man free rp und 150  skins bekommt ... nat&uuml;rlich fall ich nicht drauf rein , aber kann man villeicht etwas dagegen unternehmen , weil es gibt bestimmt leute die das glauben sich dan auf der seite anmelden und dessen acc dan weg ist . deswegen wollt ich mal fragen ob man dagegen etwas tun kann . ich wei&szlig; ich kann ihn einfach l&ouml;schen , aber villeicht sollte riot darauf strafen beziehen solche fake seiten mit text und lockangebot zu verschiken . oder gibt es da schon so etwas wie eine strafe ?!?  das interesiert mich mal also wen mir da einer eine antwort drauf geben kann w&auml;r ich ihm dankbar :) \r\n\r\nps : sorry f&uuml;r die rechtschreibfehler , habe eine rechtschreibschw&auml;che :)","replies":[{"poster":"Kaitri","date":"2015-09-15T13:52:51.708+0000","up_votes":1,"down_votes":0,"body":"das problem ist das so ein bot acc in sekunden erstellt ist, während riot ne halbe ewigkeit braucht um da mal einen zu bannen.\nes ist vielleicht nur meine meinung und klingt auch etwas brutal aber: aus dummheit lernt man. man lernt nicht das feuer heiß ist, ohne es mal anzufassen. wenn man so blöd ist und anderen nichts glaubt muss man sich halt mal selber verbrennen.\n\nan sich kannst du nichts machen, es gibt ja auch youtuber die extra vids machen wo sie sagen \"wenn ihr 'mich' in den kommentaren seht bitte klickt nichts an, das bin nicht ich ich verschenke nichts, es gibt keine gratis sachen diese leute hacken euch, schicken euch viruse auf den pc, usw.!!!\" und trotzdem siehste am nächsten tag wieder kommentare wie \"war das ein scam link letztens von dir?\"\nes wird sich für bots immer lohnen da es immer gutgläubige und/oder idioten gibt. \nam besten ist wenn du deine mates auf sowas aufmerksam machst.\n\nps: ich glaub dir das mit der rechtschreibschwäche, aber erwähne es nicht. jeder 2. behauptet er hat eine.","replies":[]},{"poster":"Neamhoilte","date":"2015-09-15T12:45:00.331+0000","up_votes":1,"down_votes":0,"body":"Du kannst den betreffenden Acc dem Support melden. Am besten mit Screenshot der Nachricht.","replies":[]}]}