{"poster":"Tyranicaltom","date":"2016-05-20T09:05:39.339+0000","title":"Syth, The Lost Scholar","subforum":"Concepts & Creations","up_votes":2,"down_votes":2,"body":"No lore or artwork yet, but if I get enough positive reviews, I'll go ahead and do that. As for a design, I was thinking of him being a really calm and intelligent warrior that wields a magical sword that floats in ranged form. Any Artwork is very welcomed if you like the concept and want to help me out.\n\nMy concept for Syth is to be an adc that will be able to get upclose and personal as well as kite and be your traditional adc. I do not have ability costs, cooldowns, and stuff yet, so I will also gladly take in and consider reccomended ideas. Let me know what you guys think in the comments below and if you would like to see this in the game, upvote it, so riot can see!\n\nAbilities:\n\nPassive: \n      For every 1 Point of AD, Syth gets ___AP; For every 1 Point of AP, Syth  gets ___ AD. In melee stance, Syth has increased health, and abilities cost no mana. In Ranged Stance, Syth gains increased movement speed, and abilities are no longer manaless.\nQ: \n     Melee Stance: No Cost; Throws forward a clone of his sword, marking and damaging enemies hit and may be recast to bring the sword back, dealing 50% damage to marked enemies, but full damage to unmarked enemies.\n     Ranged Stance: Syth Rains down sword in a selected spot, stunning enemy champions caught in the area for ___ seconds.\nW: \n      Melee Stance: No Cost; Dashes to Sword, picking it up, and dealing damage in an area around it. (If Syth is already holding the sword when w is activated, next auto attack deals ___ increased damage)\n      Ranged Stance: Syth expands sword, increasing attack speed and the range of auto attacks \nE:  \n     Melee Stance: No Cost; Syth spins once, damaging and pulling in enemies\n     Ranged Stance: Sword rotates around Syth knocking back all enemies and giving him a shield, lasting ___  seconds\nR: \n     Melee Stance: No Cost; Sword is released into the air becoming a ranged weapon\n     Ranged Stance: Sword is released from the air, and becomes a melee weapon","replies":[{"poster":"Neku21","date":"2016-05-21T04:20:19.759+0000","up_votes":1,"down_votes":0,"body":"weird to try and visualize... and that passive is akali's :l\nthough I like the second part of the passive...\nIdk why hes a scholar if hes playing with swords doh...\nand what does his w mean :l when do you lose your sword...?","replies":[{"poster":"Tyranicaltom","date":"2016-05-21T17:59:17.020+0000","up_votes":1,"down_votes":0,"body":"Idk, I might just keep the second part of the passive and maybe modify the 1st part to somethibg else or remove it. \nFor his w, it is a dash to his sword. So if you Q once to send out the sword and you do not Q it back for the return damage, you can instead dash to the sword with your w wherever you threw it instead of doing the returnactivation of your q. But, if you do activate the return damage on your q, then instead of w being a dash, you will instead get an impowered auto attack. Make sense?","replies":[{"poster":"Neku21","date":"2016-05-21T18:19:36.186+0000","up_votes":1,"down_votes":0,"body":"Yea I think so :) thats cool","replies":[{"poster":"Tyranicaltom","date":"2016-05-21T18:56:34.311+0000","up_votes":1,"down_votes":0,"body":"thanks! upvote this if you like the idea and want riot to see it","replies":[]}]}]}]}]}