{"poster":"Modo Vistima","date":"2019-02-25T21:07:09.831+0000","title":"MMR","subforum":"Jugabilidad, balance y narrativa","up_votes":2,"down_votes":1,"body":"No se como hacer para subir de liga, gano 9 al hilo y me siguen dando 11PL y sacando 24. Les parece Logico eso?.\r\nArreglen eso del elo por favor. Es un poco frustrante ganar 9 seguidas y que todas te den 11 pl y cuando pierdas te quiten 24. Coherencia por favor","replies":[{"poster":"TheKiller Justin","date":"2019-02-25T21:12:44.816+0000","up_votes":1,"down_votes":0,"body":"No creo que solo sea ganar, debe haber otras cosas más particulares que influyan\nhttps://imgur.com/a/8vRYTLM","replies":[{"poster":"Annie Botz","date":"2019-02-25T21:26:38.113+0000","up_votes":2,"down_votes":0,"body":"Le hubieras sacado captura a lo que realmente importa:\nhttps://i.gyazo.com/4c205f07286f3436a5647d525a950ede.png\n\nIgual sin esas 9 partidas que ganó de corrido estaría con un winrate negativo. De hecho subió su mmr ya que jugaba con platinos 3/2 promedio y ahora con platinos 1/2, es un avance.","replies":[{"poster":"TheKiller Justin","date":"2019-02-25T21:35:28.691+0000","up_votes":2,"down_votes":0,"body":"Nomás lo busqué para ver como había salido en esas 9 partidas porque algo debía haber y me encontré con eso, ni miré nada xD\nIgual es diamante, mucho más alto que lo que yo podría aspirar.\nEl problema está en que como tiene partidas muy buenas y buenas rachas, tiene partidas muy malas y muere mucho.\nMe acuerdo hace años cuando me puse las pilas con el juego, aunque ganara o perdiera me centraba en cuidar mi kda, y al tiempo empecé a ganar de a 30 pl, a eso me refería con que no es solo ganar","replies":[]}]}]},{"poster":"zurdiito10","date":"2019-02-25T21:23:26.013+0000","up_votes":2,"down_votes":0,"body":"No es por ser mala onda pero deberías dar gracias a todos los dioses por estar en la liga que estás, considerando tu farm, participación en kills y las muertes por partida que tienes...\n\nPreocupate en mejorar esos aspectos y verás como empiezas a subir denuevo.","replies":[]}]}