{"poster":"RIPOldYeller","date":"2016-06-21T19:04:42.021+0000","title":"Improper Ban?","subforum":"Player Behavior","up_votes":1,"down_votes":3,"body":"My account was banned last night for use of 3rd party applications. I am not sure why. I have opened a ticket, but received no reply so far. I use championify for builds, but that&#039;s it. My account was recently recovered after being used by someone who hacked the password. The only thing I can think is that someone used something illegal during that time. I have had control of the account for the last 3 months and I have not knowingly used anything during that time. If something on my system is being flagged as illegal 3rd party app I&#039;d like to know what. If it&#039;s something that was used during the period when I did not have control of the account I would like my ban lifted as I have control again and have never used anything against TOS as far as I know. Any help on getting this matter reviewed would be greatly appreciated.","replies":[{"poster":"cluvie","date":"2016-06-22T21:32:41.542+0000","up_votes":5,"down_votes":0,"body":"This happened when your account was compromised --- although you've gone through recovery, the suspension for the action came much later. I've since removed the ban on the account. Keep in mind that this is an exception -- please be sure to practice good account security! We have an article here with some pretty goods tips: https://support.riotgames.com/hc/en-us/articles/201751664","replies":[{"poster":"RIPOldYeller","date":"2016-06-22T22:44:05.293+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=cluvie,realm=NA,application-id=ZGEFLEUQ,discussion-id=b0aAKJsg,comment-id=000a,timestamp=2016-06-22T21:32:41.542+0000)\n>\n> This happened when your account was compromised --- although you&#x27;ve gone through recovery, the suspension for the action came much later. I&#x27;ve since removed the ban on the account. Keep in mind that this is an exception -- please be sure to practice good account security! We have an article here with some pretty goods tips: https://support.riotgames.com/hc/en-us/articles/201751664\n\nOMG. I have my account back. Thank you SO MUCH! <3 <3 <3.","replies":[]},{"poster":"B1Y2yU6nq8","date":"2016-06-23T03:40:41.354+0000","up_votes":1,"down_votes":0,"body":"I realize i should just submit a ticket, and i have, but i would like to ask if you can look into my account seeing how you were able to help this man out. I was hacked roughly a month ago and did not have access to my account for about a week and a half and games were played on my account. I did submit a ticket at the time and received my account back. I do believe this is when a third party software was used on my account(period of time my account was hacked). I do have the ticket number from the hacked incident. Any help will be much appreciated.","replies":[]}]},{"poster":"Da3awss","date":"2016-06-21T19:57:51.264+0000","up_votes":5,"down_votes":0,"body":"What gets me is this;\n\n\"We won't be able to go into the specifics of an account's exploit abuse, as divulging this information could compromise future investigations. \"\n\nLike how are you supposed to know what you did wrong?","replies":[]},{"poster":"Leona My Eggo","date":"2016-06-21T19:08:35.594+0000","up_votes":4,"down_votes":0,"body":"Welcome to club sir. I got this ban around 2am. Question for have you had this account for 3 years? Cause it seems everyone that has had this is around 3 to 4yr veteran at the game.","replies":[{"poster":"vrq1RbDKf1","date":"2016-06-21T20:18:05.301+0000","up_votes":1,"down_votes":0,"body":"Really, is that so? My account is also around that same age and was banned but I don't see how that would have an effect for the recent bans going around.","replies":[{"poster":"Leona My Eggo","date":"2016-06-21T20:48:56.058+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=StringyBird,realm=NA,application-id=ZGEFLEUQ,discussion-id=b0aAKJsg,comment-id=00000000,timestamp=2016-06-21T20:18:05.301+0000)\n>\n> Really, is that so? My account is also around that same age and was banned but I don&#x27;t see how that would have an effect for the recent bans going around.\n\nJust gathering up from other posts and it seems we are all around 3yrs of playing","replies":[{"poster":"Stolt","date":"2016-06-21T23:46:23.367+0000","up_votes":2,"down_votes":0,"body":"Same here, nice observation, been asking around on reddit and it does seem to be the case of everyone that claims so have been innocently banned having accounts from at least Season 3.","replies":[{"poster":"Leona My Eggo","date":"2016-06-22T00:04:55.681+0000","up_votes":1,"down_votes":0,"body":"Well thank you very much sir/ma'am. I hope this gets resolved.","replies":[]}]}]}]}]},{"poster":"B1Y2yU6nq8","date":"2016-06-22T01:10:01.023+0000","up_votes":3,"down_votes":0,"body":"Yup I was banned too. Been playing for 4 years and never used any kind of hacks or mods. My account was hacked a month ago but riot was able to get it back to me buy now I was banned for a 3rd party software but I've never used anything except dxtory and action recorder, God I hope they can get my account back.","replies":[]},{"poster":"RIPOldYeller","date":"2016-06-21T19:51:45.427+0000","up_votes":1,"down_votes":0,"body":"I got a response at least, but it was of no help.\n\n\"Hello Summoner,\n\nYour account has been permanently suspended following the use of scripts, hacks, exploits or unauthorized third-party programs in League of Legends. Accounts that are caught using hacks to gain an unfair competitive advantage are subject to permanent suspension. We work hard to preserve a fair and competitive environment in League of Legends. Regardless of intent, use of unauthorized third-party programs is explicitly against the Terms of Use, which can be found here:\n\nNA: http://na.leagueoflegends.com/legal/termsofuse\n\nKeep in mind that account sharing of any kind is also against the Terms of Use. You are responsible for all activity on your account, so be sure to keep your account information to yourself.\n\nWe won't be able to go into the specifics of an account's exploit abuse, as divulging this information could compromise future investigations. Let me know if you have any other questions or concerns.\n\nMebuChan\nPlayer Support Specialist\nRiot Games\"\n\nI need an actual person to review my case not a canned response. I have NEVER used anything against TOS to my knowledge. My account was compromised at one point due to NO FAULT OF MY OWN. If something was used during this period I should not be held responsible. This account has over 100 champions and 20 rune pages. It is over 3 years old. I need an actual review of the case or contact with someone that can explain to me what EXACTLY is going on. I have spent real money on this account since reacquiring it and will be issuing a charge back on any money spent if I can not get a response what EXACTLY is getting this account banned.","replies":[{"poster":"Dilthethrill","date":"2016-06-21T22:24:25.562+0000","up_votes":2,"down_votes":0,"body":"got the exact same copy/paste bullshit. I want to talk to them as well but so far no one is reviewing my case. Its really sad.","replies":[]},{"poster":"Leona My Eggo","date":"2016-06-21T19:54:26.349+0000","up_votes":1,"down_votes":0,"body":"That is what I got is the automatic message","replies":[]}]},{"poster":"RIPOldYeller","date":"2016-06-21T22:15:51.794+0000","up_votes":2,"down_votes":0,"body":"Is there any channel outside of the customer support tickets in which I can contact someone to review my case?","replies":[{"poster":"Dilthethrill","date":"2016-06-21T22:23:22.913+0000","up_votes":2,"down_votes":0,"body":"wondering the same here. The ticket support system so far has not helped me in anyway","replies":[]}]},{"poster":"ShowmeUrBerries","date":"2016-06-22T05:03:15.810+0000","up_votes":1,"down_votes":0,"body":"Im disgusted with riot i dont even use skype or curse and i get accused for 3rd party software? Riot please fix how you asses things cause all my time and effort was wasted. I dont care if i dont get my account again but for the rest of the community i hope you fix this cause you lost me forever.","replies":[]},{"poster":"AssauIto","date":"2016-06-22T00:11:41.058+0000","up_votes":1,"down_votes":0,"body":"Unfortunately, Riot does not lift permanent suspensions. Maybe you'll be able to have fun on a newer account.","replies":[{"poster":"RIPOldYeller","date":"2016-06-22T00:19:59.610+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AssauIto,realm=NA,application-id=ZGEFLEUQ,discussion-id=b0aAKJsg,comment-id=0006,timestamp=2016-06-22T00:11:41.058+0000)\n>\n> Unfortunately, Riot does not lift permanent suspensions. Maybe you&#x27;ll be able to have fun on a newer account.\n\nThe thing is my account has 20 rune pages, and over 100 champions. It's not something I can just simply replace. Also, since recovering my account in April I have spent $55 in RP. I don't intend to just let that money dissapear because someone else used my account irresponsibly. Hopefully I can get someone in the ticket to take an acual look at what is going on here.","replies":[]}]},{"poster":"The NA Vayne","date":"2016-06-22T00:12:04.798+0000","up_votes":1,"down_votes":0,"body":"Same thing happened to me, Happened to my 1st account so i switched to my smurf. And i never let anyone use it, here is the post \nhttp://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/Pw9Il2RQ-that-ban-wave","replies":[]},{"poster":"ShinkoMinori","date":"2016-06-21T19:15:37.148+0000","up_votes":1,"down_votes":0,"body":"This has been happening for months now, its sad but its how Riot is handling the situation, I hope you all get solutions but sadly for the record of Riot Support it looks very grim for you guys.","replies":[{"poster":"Leona My Eggo","date":"2016-06-21T19:19:47.385+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ShinkoMinori,realm=NA,application-id=ZGEFLEUQ,discussion-id=b0aAKJsg,comment-id=0002,timestamp=2016-06-21T19:15:37.148+0000)\n>\n> This has been happening for months now, its sad but its how Riot is handling the situation, I hope you all get solutions but sadly for the record of Riot Support it looks very grim for you guys.\n\nIt might be grim but I'm not going down without a fight.","replies":[{"poster":"RIPOldYeller","date":"2016-06-21T19:56:21.574+0000","up_votes":1,"down_votes":0,"body":"My account is over 3 years old, has over 100 champions and 20 rune pages. It's not something I can just replace. Very frustrated there is no live support to talk to in a situation like this.","replies":[]}]},{"poster":"RIPOldYeller","date":"2016-06-21T19:32:25.192+0000","up_votes":1,"down_votes":0,"body":"Yes, this account is over 3 years old.","replies":[]}]},{"poster":"Dilthethrill","date":"2016-06-21T19:10:42.888+0000","up_votes":1,"down_votes":0,"body":"Same here man, got banned yesterday for 3rd party programs... We are all looking for answers. Hopefully Riot cares about their players and will look into this.","replies":[]}]}