{"poster":"sLapacK","date":"2017-07-23T11:16:32.246+0000","title":"Perma banned 2 weeks after a 2 week ban? But i said back to bronze not go die in a fire","subforum":"Player Behavior","up_votes":1,"down_votes":4,"body":"So I got banned after a 2 week ban, yes I must admit I had been toxic in the past quite frankly. My toxicity was towards players making my games complete clown fiestas, is it wrong to tell someone the truth when asked? Also if this could be looked at for maybe a chat restriction instead of perm banned as I just received my loot and honor back. Is there a way for admins to see what actually was said in the game from the other players side and not only mine, because I was speaking to my team about how bad the enemy team was, and if our top laner didn&#039;t INT/AFK we would have won. RIOT TANTRAM can you please take a look at the actual inside of the game? This was my first 2 reports in 2 weeks, I was on the way to success, less toxicity and aggression in losing games. Now you have to understand that there was talking between my teammates, there was 0 aggression amongst us, only the trolling Renekton.\r\n\r\nGame 1\r\nsLapacK: bruh this bot lane sucks ass\r\nsLapacK: report them wtf\r\nsLapacK: hes jax l0l\r\nsLapacK: u gave him first kill bruh did u expect him to hold ur hand l0l\r\nsLapacK: lmao every time iget into series\r\nsLapacK: this shit happens\r\nsLapacK: is fuckin amazing\r\nsLapacK: jus gonna afk tbh\r\nsLapacK: hes mad cus hes got a negative winrate\r\nsLapacK: what do you expect l0l\r\nsLapacK: hes feeding its over\r\nsLapacK: he legit gave first kill n is blaming the team\r\nsLapacK: amazing LOL\r\nsLapacK: evceryone but me got u muted\r\nsLapacK: shut up\r\nsLapacK: L\r\nsLapacK: ok bye L take ur ur neg winrate back to bronze\r\nsLapacK: these kids suck so bad lmfao and renek jus dont wanna farm\r\nsLapacK: idc if he jus farms tht gfuckin turret the entire game n then fight\r\nsLapacK: these kids are legit ass\r\nsLapacK: lmfao its funny\r\nsLapacK: is he talking?\r\nsLapacK: hes jus been intin cus he got &quot;ksed&quot;\r\nsLapacK: imagine renek playing\r\nsLapacK: we&#039;d prob of won by now\r\nsLapacK: THEY ARE SO SHIT I THINK I NEED TO TROLL WITH RENEK\r\nsLapacK: IS THIS REAL\r\nsLapacK: L0-L406L0L\r\nsLapacK: fuck off\r\nsLapacK: i cant fight him alone its official\r\nsLapacK: akali to aggressive\r\nsLapacK: lets 5v5\r\nsLapacK: next time jax dead we can baron prob\r\nsLapacK: theyve got to b trolling lmfao\r\nsLapacK: i seen ekko ult once\r\nsLapacK: oh hjes trolling i forgot\r\nsLapacK: lmfao\r\nsLapacK: jax still strong tho\r\nsLapacK: akali?\r\nsLapacK: we need to 5v5\r\nsLapacK: ior w\\]e 4v5\r\nsLapacK: we didnt have teemo\r\nsLapacK: yh this is gg\r\nsLapacK: renek can u play so we can end\r\nsLapacK: no one has the time to report u\r\nsLapacK: if we had renek in this we&#039;d legit never lose\r\nsLapacK: they are scaling now\r\nsLapacK: whats the point of wasting 40 minutes\r\nsLapacK: make em come to us\r\nsLapacK: cus u were torllling\r\nsLapacK: if u play\r\nsLapacK: maybe ud get fuckin honored\r\nsLapacK: for trolling us tht ure good\r\nsLapacK: we cant report without being in the menu to do it?\r\nsLapacK: cmon man\r\nsLapacK: nvm\r\nsLapacK: we lost\r\nsLapacK: we cant win without renek\r\nsLapacK: i shouldnt of pushed out\r\nsLapacK: not if they elder\r\nsLapacK: we are fucked\r\nsLapacK: x9 renek\r\nsLapacK: LOL","replies":[{"poster":"The Djinn","date":"2017-07-23T14:45:09.593+0000","up_votes":3,"down_votes":0,"body":">sLapacK: bruh this bot lane sucks ass\n> sLapacK: u gave him first kill bruh did u expect him to hold ur hand l0l\n> sLapacK: jus gonna afk tbh\n> sLapacK: ok bye L take ur ur neg winrate back to bronze\n> sLapacK: these kids suck so bad lmfao and renek jus dont wanna farm\n> sLapacK: these kids are legit ass\n> sLapacK: fuck off\n\nInsulting ANY player is prohibited. If your team is all your friends that's one thing, but not everyone wants to see a teammate trash-talking on the enemy team. Treat them like you would any other player, as you can still get reported for your behavior towards them.\n\nYou're also threatening to AFK, which is a punishable offense, and giving your Renekton a hard time. If he wants to feed so be it -- report him, get him punished, and move on. Don't feel the need to harass him -- it almost never has the effect of making them stop, and all it does is put your own account at risk.\n\n----------------\n\nThe other important thing to realize is that getting a permanent ban isn't always a matter of how egregious your chat was. Telling someone to \"go die in a fire\" may earn you an escalated punishment (say, going from a 10-game chat ban to a 14-day suspension), but telling someone \"go back to bronze\" a sufficient number of times can still get you there.\n\nA 14-day suspension means that your next punishment -- be it at the level that normally earns an immediate 14-day ban level or the level that normally earns a chat-ban on a fresh account-- will earn a permanent ban.","replies":[]},{"poster":"ThePikol","date":"2017-07-23T11:47:15.445+0000","up_votes":3,"down_votes":0,"body":"Eleven lines of \"how I was trying to be less toxic, doing well, I wasn't flaming\" shit then first thing you said in game is report calling and flaming bot lane. I won't even bother to read the rest. Ban deserved","replies":[]},{"poster":"Anastaecia","date":"2017-07-23T11:25:26.385+0000","up_votes":1,"down_votes":0,"body":"can't ask for reports\n\ngeneral hostility\n\nremember, you are on super thin ice after a 2-week.  best just to not even type","replies":[{"poster":"sLapacK","date":"2017-07-23T11:32:03.808+0000","up_votes":1,"down_votes":0,"body":"This ice must be paper thin, because I simply said  \"sLapacK: hes mad cus hes got a negative winrate\" is the only thing I said to the guy who was AFK/INT the entire game, not only that he typed he was?? idk seems very absurd comparing my one comment to his 50.","replies":[{"poster":"Geauxx","date":"2017-07-23T11:33:42.914+0000","up_votes":2,"down_votes":0,"body":"Riot has stated that coming off a 2 week ban people are at the very edge, and you became toxic right after the coming back so you got perma'd.","replies":[]},{"poster":"Anastaecia","date":"2017-07-23T15:39:08.632+0000","up_votes":1,"down_votes":0,"body":"it is from what i understand.  And I already said what you did wrong.  Line 2 asking for reports.  Besides being an example of harassing another player, it is pointless if you plan to report....because the system only needs 1 report to activate the scanners.  And general hostility/harassment.","replies":[]},{"poster":"MaropaL2","date":"2017-07-23T13:48:15.046+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=sLapacK,realm=NA,application-id=ZGEFLEUQ,discussion-id=8LmIkEcH,comment-id=00000000,timestamp=2017-07-23T11:32:03.808+0000)\n>\n> This ice must be paper thin, because I simply said  &quot;sLapacK: hes mad cus hes got a negative winrate&quot; is the only thing I said to the guy who was AFK/INT the entire game, not only that he typed he was?? idk seems very absurd comparing my one comment to his 50.\n\nthe first 2 lines would have been enough for a perma, but you kept going lol.","replies":[]}]}]},{"poster":"Lemmy","date":"2017-07-23T14:46:25.649+0000","up_votes":1,"down_votes":1,"body":"I don't think you realize that Riot doesn't care about the other people in question, they just care about the one getting reported. IE, you. They care less about someone that goes 0-14, and more about the person flaming him the whole way.","replies":[]}]}