{"poster":"DAVIPIE","date":"2015-02-05T21:56:49.158+0000","title":"Markus, L'eretico","subforum":"Campioni e gameplay","up_votes":12,"down_votes":3,"body":"**MARKUS, L'ERETICO**\n \n*LORE*:   Originario di Zaun, Markus crebbe come primogenito di una delle famiglie più ricche ed influenti della città.\nPadre taumaturgo e madre gran sacerdotessa, di un culto antico e sconosciuto ai più, lo allevarono secondo le loro credenze e ideali, avvicinandolo al mondo della magia e dell'occulto. \nRaggiunta la maggiore età e diventato ormai un stregone esperto, dopo aver succeduto alla madre come gran sacerdote, noto per le sue grandi capacità magiche, venne avvicinato dalla Rosa Nera, in cerca di una possibile alleanza.\nMarkus fu affascinato dalle promesse e dal potere che questa organizzazione gli stava offrendo. Decise quindi di unirsi ad essa, ma il prezzo era elevato: doveva eliminare tutti i membri del culto di cui era a capo perché dannosi agli affari della Rosa.\nAccettò e nel giro di una notte tutti i cultisti vennero sterminati grazie all'uso dei suoi poteri. \nLa madre, scoperto il massacro, lo bandì dal culto dichiarandolo eretico e condannandolo a morte. \nMarkus però, aveva raggiunto il suo scopo, e poteva ora entrare a far parte di qualcosa di più grande.\n\n** *Con il passare del tempo a Markus furono affidate missioni di sempre più elevata importanza, la maggior parte delle quali consistevano in omicidi e distruzione. Non era solito agire seguendo un piano, o in modo furtivo: una volta ricevuto l'ordine partiva in direzione dell'obiettivo, senza esitare e senza temere le eventuali conseguenze dei suoi crimini. Gli piaceva uccidere e seminare il terrore. Era solito inoltre annunciare il suo arrivo a destinazione cominciando a distruggere piccole cose: come staccionate, animali da fattoria, alberi, casupole e granai, per poi passare alle persone ed infine al terreno stesso, divorando tutto nelle fiamme, lentamente e con calma, tra una risata e l'altra. Ci provava gusto. Stava forse... Impazzendo?\n\nUn giorno, recatosi nel luogo descritto nella missione affidatogli, si trovò all'ingresso di un antico castello nero in mezzo alle montagne. Il cielo notturno era scuro a causa delle nuvole che coprivano le stelle. Si poteva notare la tempesta avvicinarsi ed aumentare di intensità. Markus sentì un brivido percorrergli la spina dorsale e rizzandogli i capelli. Aveva un brutto presentimento. Ma non ci fece caso e si diresse verso il salone principale del castello. I muri in granito nero erano illuminati da torce appese lungo le pareti che emanavano un'inquietante fiamma azzurra. La scarsa luce prodotta riusciva a malapena ad attraversare i vetri delle finestre ricavati da sottili lastre di ossidiana, creando sfumatura di blu all'esterno di esse. Raggiunta la sala Markus rimase colpito nel vedere LeBlanc sedere su un trono nero al centro di essa. Il fioco bagliore dei fuochi, gli permise inoltre di intravedere le figure di Vladimir e Swain ai lati dello scranno. Riuscì a malapena ad intravedere anche una grande e possente figura nell'ombra, alle spalle dei tre. Una leggera luce rossa sembrava provenire dal centro di quella creatura.\n\nDopo un lungo silenzio ed uno scambio di sguardi tra quello severo di Leblanc e quello confuso e sorpreso di Markus, questa parlò. Gli raccontò di quanto lui era stato utile all'organizzazione. Di come aveva permesso ad essa di crescere e rinforzarsi. Di come lo avevano usato per raggiungere i loro scopi. Gli raccontò i motivi dietro ad ogni missione affidatogli. Gli raccontò poi il motivo dietro la prima strage che aveva compiuto, la distruzione del suo culto.\nAd ogni parola pronunciata dalla strega, Markus si sentiva come trafitto al cuore da mille aghi. Tremava e il sudore gli gocciolava dal volto sul pavimento nero. Non appena la sentì iniziare a parlare del suo primo compito e del perché gli gli fu affidato alzò lo sguardo verso di lei sbigottito e senza parole. Lei sorrise. Le diede piacere sapere di averlo ferito così profondamente. Lui chinò la testa, sprofondando nella disperazione e dei sensi di colpa.\nPoi qualcosa in lui scattò. Le mani gli si strinsero a pugno tanto forte da sanguinare. Iniziò a tremare con più forza ed alzò lo sguardo verso colei che lo aveva imbrogliato, usato, corrotto e condannato ad una vita di dolore. Il suo viso era carico d'odio e disperazione. I suoi occhi cominciarono ad illuminarsi di una luce rossa, mentre onde di energia rossa e nera cominciavano a sprigionarsi dal suo corpo. Per lui era finita. Ma anche per loro.\nPrima che i quattro della Rosa riuscissero anche solo a muovere un passo, Markus si era sollevato da terra ed aveva incominciato ad accumulare energia all'interno del suo corpo. Pochi secondi dopo, lanciando un urlo strazianto, il suo corpo rilasciò un'ondata di energia talmente forte da far tremare l'intero castello. Subito dopo un altro urlo ed un'altra ondata di energia, questa volta l'onda d'urto di colore nero fu più visibile e si sentì cedere il soffitto del palazzo. Un'altra scarica di energia ed un altro urlo. Questa volta l'onda scaraventò a terra tutti quelli nella stanza, impedendogli di muoversi. Il corpo di Markus intanto stava venendo consumato da fiamme nere e rosse, le quali, avvinghiandosi a lui, ne bruciavano la pelle e la carne, facendo evaporare il sangue. Infine, una quarta esplosione, la più devastante e dolorosa delle quattro. Dal corpo di Markus, dolorante perchè corroso dalla magia, si generò un'altra esplosione. L'energia magica avanzò come un muro di fuoco rosso e nero in tutte le direzioni, divorando e consumando tutto ciò che toccava. Il castello esplose in un'immensa fiamma, illuminando il cielo per diversi chilometri, lasciandone solo le fondamenta carbonizzate. Dei quattro della Rosa Nera non c'era traccia. \n\nMarkus si svegliò poco tempo dopo a causa del dolore. Era vivo sì, ma esteriormente ed interiormente era un altro uomo. Le fiamme scaturitesi dalla sua ira, dal dolore e dalla vendetta lo avevano consumato. Non provava alcun emozione se non l'odio. L'odio per le persone che lo avevano ridotto così, un mostro. Barcollante si diresse poi verso la strada che portava al castello e scomparve nell'oscurità.\n\nIl sole splendeva forte nel cielo terso quando Markus ricevette una lettera, un invito. Proveniva dall'Istituto della Guerra. La lettera conteneva promesse di redenzione e vendetta nei confronti di coloro che lo avevano rovinato. Gli prometteva che tutti i suoi crimini sarebbero stati perdonati e che non sarebbe più stato ricordato come un mostro.\nSenza pensarci due volte su, Markus Preparò un bagaglio e si diresse verso l'istituto, sorridendo.\nIl tempo lo aveva reso più cauto, calmo e calcolatore. Non poteva permettersi altri errori. Voleva espiare le sue colpe e avere una vita tranquilla, lasciandosi il passato alle spalle. Ma non prima di aver dato alle fiamme i maledetti che lo avevano usato e condannato ad una vita di sofferenza.\n\n\"Presto compirò la mia vendetta. E marcerò sui vostri resti consumati dalle fiamma della mia rabbia. Preparatevi, sto venendo a prendervi.\"* **\n\n\n*AMICI:* Nessuno (È nuovo all'istituto, dategli tempo di trovare qualche alleato)\n*NEMICI:* LeBlanc, Elise, Vladimir, Swain, Sion \n\t\n*DESCRIZIONE*:    Markus è un mago dotato di grandi poteri che derivano dalla sua abilità innata e dallo studio delle arti \toscure del culto di cui era a capo. Queste abilità gli consentono di infliggere danni al corpo ed allo spirito della vittima che muore agonizzante.\n\n*RUOLO*: Mago midlane-toplane / Supporto botlane\n\n____________________________________________________\n\n** *STATISTICHE* **\n\nHP: 557.8 (+87)\nRigenerazione HP: 7.42 (+0.6)\nMana: 348.6 (+53)\nRigenerazione Mana: 7 (+0.7)\nRange: 525\nAttacco Fisico: 54.256 (+2.94)\nVelocità d'Attacco: 0.625 (+1.92%)\nArmatura: 21.96 (+3.5)\nResistenza Magica: 30 (+0)\nVelocità di Movimento: 330\n\n_________________________________________________\n\n** *ABILITÀ* **:\n\nPassiva: *Ira del Dannato* : Il dolore consente a Markus di aumentare i suoi poteri magici.\n(Per ogni 1% di salute mancante Markus ottiene un bonus ad AP *(+0.2%)* ed alla rigenerazione del mana *(+0.5)*)\n\nQ: *Sferzata oscura* :     Markus muove con forza il braccio destro in avanti, fendendo il terreno e tutto ciò che vi è sopra con una lama di energia oscura.\n\t\t\t              (Tipo: Danni in linea retta, sottile ma lunga. Infligge più danni ~~all'inizio rispetto~~ *alla fine rispetto all'inizio*)\n(La lama di energia passa attraverso ostacoli, minions e campioni nemici)\n\t\t\t              (La lama di energia si muove in avanti fendendo il terreno e creando rallentamento ai nemici che ci camminano sopra)\n\t\t\t              (La lama man mano che avanza ~~perde~~ *acquista* energia e scompare, infliggendo ~~meno~~ *più* danni alla fine rispetto all'inizio)\n(Danno magico base : 30/50/80/110/150 (+0.6 AP))\n(Danno magica massimo : 90/120/180/240/310 (+1.3 AP))\n(Cooldown : ~~16/13/10/8/6~~ **12/10/8/6/5** s)\n(Range : 0-1000)\n(Larghezza : 60)\n(Velocità Abilità : Come E di Aatrox)\n(Costo : 40/50/60/80/100 mana)\n\nW: *Vendetta* : \t\t Markus punta il dito indice sinistro contro un nemico bersaglio, il quale riceverà dolore in base a quanto ne  infliggerà.\n\t\t\t                 (Tipo : Aura a bersaglio)\n\t\t\t                 (Il bersaglio viene marchiato per tre secondi, ricevendo, al termine di questi, una percentuale dei danni che ha inflitto a qualunque bersaglio in questo lasso di tempo)\n(La percentuale di danni inflitti al bersaglio allo scadere dei tre secondi ripristina gli HP di Markus della stessa quantità più un altra percentuale in base al suo AP)\n(Danni magici dopo tre secondi : 1%/2%/4%/6%/9% dei danni inflitti dal beraglio)\n(Cura di Markus dopo tre secondi : 1%/2%/4%/6%/9% dei danni inflitti dal bersaglio (+0.8 AP))\n(Cooldown : 20/18/16/14/12)\n(Range : 850)\n(Costo : 60/80/100/110/120 mana)\n\nE: *Aura del Dannato* :    Un'aura di energia negativa si forma intorno a Markus o ad un alleato bersaglio, riducendo i danni subiti ed aumentando i  danni inflitti per alcuni secondi. Col passare del tempo l'aura si affievolisce, facendo diminuire i bonus ottenuti da Markus.\n\t\t\t                (TIpo: Aura a bersaglio)\n\t\t\t                (L'aura generata da Markus garantisce un bonus ad armatura, resistenza magica, velocità di movimento e gli permettere di infliggere una piccola percentuale di danni in più)\n(Bonus Armor e MR 10/14/19/26/33)\n(Bonus Mov.S 10/15/20/30/50 %)\n(Bonus AD 10/16/23/32/45)\n(Bonus AP 25/33/46/62/85)\n(Decadimento bonus : 25% al secondo per 4 secondi)\n(Cooldown : ~~12~~ **16/14/12/10/8**  s)\n(Range : 850)\n(Costo : 60/70/85/95/110)\n\nR:* Immolazione* :  Markus sacrifica la sua energia vitale per sfinire e danneggiare con la magia tutti i nemici che lo circondano. Se Markus ~~muore durante il rituale~~ **consuma molta della sua energia vitale** , avverrà un ulteriore rilascio di energia di intensità maggiore.\n(Tipo: Danni ad aerea + rallentamento ad area)\n(Markus perde una percentuale di vita massima ogni secondo per tre secondi)\n(Ogni secondo per tre secondi viene generata un esplosione intorno a Markus che infligge danni in base al suo AP ed ai suoi HP che perde)\n(~~Se Markus muore~~ **Scende sotto il 30% della sua vita massima** mentre la usa la ultimate, sarà generata una quarta esplosione che infliggerà più danni in base al suo AP ed ai suoi HP)\n(I nemici all'interno dell'area sono rallentati di una certa percentuale in base all'AP di Markus)\n(Danno Magico : 80/150/240 (+1.2 AP) (+0.05 max HP) al secondo per tre secondi)\n(Danno Magico Bonus : 150/250/380 (+1.5 AP) (+0.8 max HP)\n(Punti vita : - 8/10/12 % vita massima al secondo)\n(Rallentamento : 30/40/55 %)\n(Cooldown : ~~180/150/120~~ **150/120/90** s)\n(Range : 600)\n(Costo : 100/120/150 mana)\n\n\n______________________________________________________________________________\n\n\nSpero che l'idea vi piaccia e che esprimiate la vostra opinione sul champ che ho pensato. Le critiche sono molto ben accette e scusate chiedo subito scusa per eventuali orrori grammaticali che mi sono sfuggiti :'D \nGrazie per aver letto {{summoner:31}}\n\n_______________________________________________________________\n\n** *AGGIORNAMENTO (06/02/15)* **\n1- Aggiunta passiva e rubavita magico all'abilità \"Vendetta\".\n2- Modificata l'abilità \"Sferzata Oscura\".\n\n** *AGGIORNAMENTO (08/02/15)* **\n1- Aggiunto dettagli abilità.\n2- Aggiunte le statistiche.\n\n** *AGGIORNAMENTO (11/08/15)* **\n\n1- Modificato CD abilità \"Sferzata Oscura\".\n2- Modificata abilità \"Immolazione\".\n3- Modificato CD abilità \"Aura del Dannato\".\n4- Aggiornato il Lore.\n5- Aggiunti gli amici ed i nemici.","replies":[{"poster":"SoulHunterXxOxX","date":"2015-02-08T19:47:15.281+0000","up_votes":2,"down_votes":0,"body":"hmmm ha tutto statistiche, abilita e storia a praticamente quasi tutto ed e fatto più tosto bene.\nforse sarebbe bello se la riot ci provasse a farlo per provarlo","replies":[{"poster":"DAVIPIE","date":"2015-02-08T20:10:40.128+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SoulHunterXxOxX,realm=EUW,application-id=cAOZwaUi,discussion-id=AqJWGGxt,comment-id=0004,timestamp=2015-02-08T19:47:15.281+0000)\n>\n> hmmm ha tutto statistiche, abilita e storia a praticamente quasi tutto ed e fatto più tosto bene.\n> forse sarebbe bello se la riot ci provasse a farlo per provarlo\n\nGrazie, ma manca ancora almeno una splash art e magari allungare un po' il lore :')","replies":[]}]},{"poster":"Gianluca4991","date":"2015-02-06T18:18:22.279+0000","up_votes":2,"down_votes":0,"body":"Davvero bello.. credo che sia realizzabile.. l'ultimate poi è stupenda.. lo shopperei subito.. credimi.. Forza Riot, createlo.. Vi scongiuro XD","replies":[]},{"poster":"FeliceXD","date":"2015-02-06T07:19:19.109+0000","up_votes":2,"down_votes":0,"body":"Pensando ad una passiva per questo champ mi sono venute 2 idee:\n1. Una passiva che gli permette di guadagnare vita (tipo quella di{{champion:103}} ) avendo un costo in vita della ultimate così alto.\n2. Una passiva che gli aumenta il potere magico in base alla vita mancante. Anche in questo caso un minimo rigenerazione gliela darei, magari sulla W","replies":[]},{"poster":"LucaCocca98","date":"2015-02-05T22:42:26.928+0000","up_votes":2,"down_votes":0,"body":"A me piaceeeee","replies":[]},{"poster":"kakashi hatake12","date":"2015-08-26T20:59:39.497+0000","up_votes":1,"down_votes":0,"body":"invece a me piacerebbe avere un altro spadaccino tra i champ simile a zoro di one piece :D magari potrebbe essere pure il fratello di yasuoo...sarebbe forte","replies":[{"poster":"DAVIPIE","date":"2015-09-04T23:05:41.587+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kakashi hatake12,realm=EUW,application-id=cAOZwaUi,discussion-id=AqJWGGxt,comment-id=0006,timestamp=2015-08-26T20:59:39.497+0000)\n>\n> invece a me piacerebbe avere un altro spadaccino tra i champ simile a zoro di one piece :D magari potrebbe essere pure il fratello di yasuoo...sarebbe forte\n\nYasuo ha ucciso suo fratello :)","replies":[]}]},{"poster":"DAVIPIE","date":"2015-08-11T18:56:37.757+0000","up_votes":1,"down_votes":0,"body":"Lore aggiornato :D{{summoner:30}}","replies":[]},{"poster":"DAVIPIE","date":"2015-02-06T08:18:01.405+0000","up_votes":1,"down_votes":0,"body":"Grazie per le risposte! :D\n\nPer la passiva ci stavi pensando ieri e poi prima di addormentarmi ho avuto l'illuminazione hahaha. Ora aggiorno la scheda del champ. Grazie del consiglio :)","replies":[]}]}