{"poster":" Jar Jar binks l","date":"2019-11-30T11:20:24.168+0000","title":"How do u win as a Melee against a ranged mage or adc","subforum":"Gameplay","up_votes":5,"down_votes":7,"body":"They poke u to death and if u want to disengage they just simply dash away.\r\n\r\nWaiting for a Jungler is not a solution , why I have to be depended on a another Player? Even pros in Challenger are playing lucian toplane","replies":[{"poster":"DuskDaUmbreon","date":"2019-11-30T12:00:03.887+0000","up_votes":5,"down_votes":1,"body":"Use your inherently superior stats.\n\nAs soon as you get in range **they're a fucking corpse**. You also generally have superior sustain, use it.","replies":[{"poster":"e46 Fanatic","date":"2019-11-30T14:42:36.064+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=DuskDaUmbreon,realm=NA,application-id=3ErqAdtq,discussion-id=Es7gcdpF,comment-id=0001,timestamp=2019-11-30T12:00:03.887+0000)\n>You also generally have superior sustain, use it.\n\ntoo bad we have an average of like 7/10 people carrying ignite(even the fkin support) and or rushing morellos","replies":[{"poster":"DuskDaUmbreon","date":"2019-11-30T14:57:10.366+0000","up_votes":3,"down_votes":0,"body":"Ignite's a summoner spell. It means jack shit against *poke* because you don't use ignite until you're looking for a kill.\n\nAnd Morello is always a 2nd+ item. Nobody first items Morello. Most people don't even 2nd item it and instead just sit on an orb unless you're a heavily sustain-based champion.","replies":[{"poster":"e46 Fanatic","date":"2019-11-30T15:14:58.558+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=DuskDaUmbreon,realm=NA,application-id=3ErqAdtq,discussion-id=Es7gcdpF,comment-id=000100000000,timestamp=2019-11-30T14:57:10.366+0000)\n>\n> Ignite's a summoner spell. It means jack shit against *poke* because you don't use ignite until you're looking for a kill.\n\nwell ignite is never 'jack shit'... but I didn't quote you about poking, just the sustain part. I wasn't really looking for a response >.> what I said originally is true, and I guess with rushing morellos I'm thinking of ARAM, where I know for sure that morellos is a first item pick for many","replies":[]}]}]},{"poster":"The thigh guy","date":"2019-11-30T19:08:52.294+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DuskDaUmbreon,realm=NA,application-id=3ErqAdtq,discussion-id=Es7gcdpF,comment-id=0001,timestamp=2019-11-30T12:00:03.887+0000)\n>\n> Use your inherently superior stats.\n> \n> As soon as you get in range **they're a fucking corpse**. You also generally have superior sustain, use it.\n\nBut but but but. This one time. A Vladimir bullied me because I tried to tower dive him at level 2. Range champs broken. :c\n\nNo for real. Wish more people got this. Melee has EVERY benefit outside of just being ranged.","replies":[]}]},{"poster":"Netorare","date":"2019-11-30T11:41:38.248+0000","up_votes":5,"down_votes":8,"body":"dorans shield&amp;second wind...\nThe only broken ranged on top are quinn,vayne,lucian\nIf you lose vs any other champs ur trolling...\nMages are irelevant since ur CAN DODGE their skillshots if ur not a monkey.","replies":[{"poster":"Daddy Ants","date":"2019-11-30T13:56:26.363+0000","up_votes":6,"down_votes":3,"body":"> [{quoted}](name=Netorare,realm=EUNE,application-id=3ErqAdtq,discussion-id=Es7gcdpF,comment-id=0000,timestamp=2019-11-30T11:41:38.248+0000)\n>.\n> The only broken ranged on top are quinn,vayne,lucian\n\nhttps://i.gyazo.com/9035b89467819fdaf8eedaeec54ed83d.png \n\nhttps://i.gyazo.com/ac57e7d5f89cfef9c5e365455c614d2d.png\n\nWow so broken.\n\n/s","replies":[{"poster":"Netorare","date":"2019-11-30T14:09:55.361+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=Antenora,realm=EUW,application-id=3ErqAdtq,discussion-id=Es7gcdpF,comment-id=00000000,timestamp=2019-11-30T13:56:26.363+0000)\n>\n> https://i.gyazo.com/9035b89467819fdaf8eedaeec54ed83d.png \n> \n> https://i.gyazo.com/ac57e7d5f89cfef9c5e365455c614d2d.png\n> \n> Wow so broken.\n> \n> /s\n\nImagine ingoring their kit and focusing on the win rate that doesn't mean jackshit when it comes to balance\nkek","replies":[{"poster":"Sir Saltarin","date":"2019-11-30T15:48:38.242+0000","up_votes":3,"down_votes":0,"body":"But Vayne and Lucian toplane are bad and played marginally.","replies":[]}]},{"poster":"DuskDaUmbreon","date":"2019-11-30T14:11:19.629+0000","up_votes":2,"down_votes":1,"body":"Yeah idk why people bitch about Vayne top. It's annoying, but it's **never** been viable outside of when Vayne's been batshit broken in botlane, and even then it's mediocre at *best*.","replies":[{"poster":"Chembaron Yamada","date":"2019-12-01T09:06:50.379+0000","up_votes":1,"down_votes":0,"body":"People complain about it not because it would be a powerful strat, most games I played against a Vayne in top lane I've won in the end.\n\nThe thing people complain about is that Vayne pretty much makes laning phase for melee champions in top lane torment. Yes, if you respect the pick and play really defensively, waiting for your jungler to gank and all then you are more likely to win the game. But people tend not to enjoy that the enemy pick completely denies them their laning phase.\n\nYou know it, people want to be the carry themselves. Then there is the Vayne who forces them into a passive playstyle.","replies":[{"poster":"DuskDaUmbreon","date":"2019-12-01T09:08:24.301+0000","up_votes":1,"down_votes":0,"body":"Oh no, the horror, someone has to *gasp* play **safely** into a lane!\n\nMy heart *bleeds* for the Darius mains who finally have to suffer what their pick has made every immobile melee have to do.","replies":[{"poster":"Chembaron Yamada","date":"2019-12-01T09:14:44.679+0000","up_votes":1,"down_votes":0,"body":"Completely agree.\n\nPart of the game is learning how to react to counter picks. If the enemy picks Vayne and she counters you, then simply adapt and play safely. Just think to yourself: as long as I don't give this Vayne any kills, she will most likely made herself lose with that pick.","replies":[]}]}]}]}]},{"poster":"Kelg","date":"2019-11-30T16:14:41.847+0000","up_votes":1,"down_votes":0,"body":"{{champion:13}}","replies":[]},{"poster":"RtClick","date":"2019-11-30T14:30:38.240+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Netorare,realm=EUNE,application-id=3ErqAdtq,discussion-id=Es7gcdpF,comment-id=0000,timestamp=2019-11-30T11:41:38.248+0000)\n>\n> \n> The only broken ranged on top are quinn,vayne,lucian\n> If you lose vs any other champs ur trolling...\n\nLOL now that's funny.","replies":[]}]},{"poster":"Ashe mage AD","date":"2019-11-30T12:14:02.540+0000","up_votes":3,"down_votes":1,"body":"Switch that fkin Conqueror for a Fleet Footwork you pleb. Why you still playing as if you're vsing a melee? You mad?","replies":[]},{"poster":"SheikhEleazar","date":"2019-11-30T17:18:50.199+0000","up_votes":1,"down_votes":0,"body":"If you play toplane, go to the toilet and wipe ur anus for 20 mins\n\nOtherwise, hug turret / farm jungle and buy tank items","replies":[]},{"poster":"Darkstar Annie","date":"2019-11-30T16:19:36.173+0000","up_votes":1,"down_votes":0,"body":"Can't vouch for other mages, but a Fiora, Camille, Kled, Irelia or Riven vs Annie is a sad day for Annie. Jump on top of her and she is easy toast with a side of milk.","replies":[]},{"poster":"WalkingInACircle","date":"2019-11-30T15:56:28.675+0000","up_votes":1,"down_votes":0,"body":"This heavily depends on what champion you're playing. Some like Irelia have the right tools to engage, others don't.\n\nIf you mean Ryze, he's just way overturned.","replies":[]},{"poster":"Sir Saltarin","date":"2019-11-30T15:49:58.396+0000","up_votes":1,"down_votes":0,"body":"You are saying nothing on this post.\n\nDepends on which melee champ you are playing and against which ranged champ you are playing. \n\nYour post is as general and useless as asking: how do I win games ?","replies":[]},{"poster":"e46 Fanatic","date":"2019-11-30T15:16:41.946+0000","up_votes":1,"down_votes":0,"body":"{{summoner:6}}  is underrated imo, helps you keep up with the kiters","replies":[]},{"poster":"LanceTheMighty","date":"2019-11-30T13:47:11.682+0000","up_votes":1,"down_votes":0,"body":"It's match up dependant, as most melees though you basically can't do anything until the enemy laner makes a mistake. I've had most success playing {{champion:13}} {{champion:36}} and sometimes I pick mid lane champions like {{champion:517}} and {{champion:38}} top. \n\nYou can try to force them into a position where they make a mistake. You can freeze your lane and stand in the wave, if they get greedy and try to get cs they get in your engage range and you kill them. But if they are smart and don't theres nothing you can do without jungle help.","replies":[]},{"poster":"Chembaron Yamada","date":"2019-11-30T12:48:36.786+0000","up_votes":1,"down_votes":0,"body":"Depends on the match up, obviously.\n\nWhen I have to deal with enemies which are outranging me, then usually I rush some resistances to withstand their damage in an all in. Most fighters have good base damages, so you can go for resistances and just all in them and they are dead. You have to play like a scaredy cat in the very early game, tho.","replies":[]},{"poster":"JustA kleo","date":"2019-11-30T13:59:10.746+0000","up_votes":2,"down_votes":3,"body":"depends:\n\ndo you play a tank? get a armor/mr item and watch them hit you for 5 minutes without lowering your health bar much\n\ndo you play a bruiser/juggernaut/fighter/whatever you call them? get trinity or black cleaver or whatever you buy first, press q + aa on them and watch half their hp bar vanish instantly.","replies":[{"poster":"PopcornBunni","date":"2019-12-01T09:11:09.011+0000","up_votes":1,"down_votes":0,"body":"Damage scales at twice the rate of resistances, and building armor/MR means you're giving up the ability to push lane and auto lose priority. Tanks lose to ranged matchups harder than any other melees do. At least Irelia can outbroken them with an all-in and auto clear because she builds damage to match.","replies":[]}]},{"poster":"FSRER","date":"2019-11-30T14:08:19.087+0000","up_votes":3,"down_votes":4,"body":"You can't.\n\nWhen you are facing Adc's and Mages at Toplane, you simply rely on them having no idea what they are doing. Once, as a Ryze for example, you grasp onto your combos and stop headbutting QWE you simply can not lose vs any melee champion. Dorans shield is completely irrelevant in this meta (reaches cull levels of uselesness) because they have balanced it around you getting poked to low health and healing a extremely small portion of it back which to the current meta is useless since every single ranged pick can simply burst you on low health and as for runes, second wind aint gonna do crap, you are better off with getting bone plating so you won't get half healthed by one combo. \nSome, who have no idea what the heck they are talking about, say \"HuR dUr RuSh DeFeNcE\". Alright, how the hell am I supposed to get any farm aka any **gold** (other than getting future's market) to get items?! When you get close to a farm wave you not only will get comboed without being able to trade but most likely will also **get stuck in your own minions** which will kill you.\nAll you can do in a melee vs ranged situation is to beg for your jungler to come. Personally when I am facing any such matchups I just say to my jungler \"I will stay under tower, if you come and we kill him/her I can snowball, if you don't I lose\" and then it is up to them but again, the meta is forcing junglers to play botside to get dragons which are game deciding so again, you can't blame the jungler for not ganking you.\n\nAll in all, you can't","replies":[]}]}