{"poster":"JimmyRampage","date":"2015-05-28T02:02:33.648+0000","title":"Que es Top, Mid, Bot y adc?","subforum":"Off-topic y temas personales","up_votes":1,"down_votes":0,"body":"Hola, tengo dudas acerca de esos terminos, comenc&eacute; a jugar hace una semana aprox. as&iacute; que soy nuevo en LoL.\r\n\r\nexiste mas terminologia como esa? donde puedo encontrar mas informaci&oacute;n? por que busque en el foro pero no encontre... o no supe buscar xD\r\n\r\nsaludos y gracias de antemano.","replies":[{"poster":"Capitan Manteca","date":"2015-05-28T02:16:04.935+0000","up_votes":4,"down_votes":0,"body":"Top es el carril superior mid el carril del medio bot el carril de abajo y jungla es la jungla xD te dejo una foto para que me comprendas mas \n\nhttps://adventuresoflol.files.wordpress.com/2014/11/summoners-rift.jpg","replies":[{"poster":"F0RZAKEN","date":"2015-05-28T04:05:42.537+0000","up_votes":2,"down_votes":0,"body":"y ADC es Atack Damage Carrier = Acarreador con daño fisico, es decir... un tirador.\n\nSoporte es el que ayuda al tirador en bottom o bot.","replies":[]}]},{"poster":"DreamTales","date":"2015-05-28T16:35:09.027+0000","up_votes":2,"down_votes":0,"body":"TOP: carril superior del mapa\n\nMID: carril central del mapa\n\nBOT: carril inferior del mapa\n\nADC: Attack Damage Carry. Es el tirador, su utilidad es aportar daño físico en las Team Fight y, ademas, pushear mucho más rapido\n\notros terminos que te pueden servir...\n\nJUNGLER/JUNGLA: jugador que hace la jungla y su objetivo es gankear los carriles\n\nTEAM FIGHT: Pelea de Equipo. básicamente pelea 5vs5 (muy mayormente se generan en MID)\n\nPUSHEAR: empujar un carril con la finalidad de tirar torres o hasta el hinibidor\n\nGANKEAR: agarrar por sorpresa al enemigo entre 1 o más jugadores con la finalidad de que gaste habilidades, hechizos o mejor aún, matarlo\n\nSS/MISS/MIA: advertir que el contrincante de tu carril desapareció\n \nLASTHIT: dar último golpe a los súbditos/minions/creeps y de esta forma llevarte el oro y experiencia (aprende a hacerlo, minimo 80 FARM min 10:30)\n\nFARM: cantidad de minions que mataste (de esto viene la mayoria de tu oro conseguido)\n\nsi queres saber más aca te dejo un LINK: http://forums.euw.leagueoflegends.com/board/showthread.php?t=410626\n\nLINK/URL: \"código\" para ingresar en una página :v","replies":[]},{"poster":"elvarsowx","date":"2015-05-28T02:09:53.752+0000","up_votes":1,"down_votes":0,"body":"top es en la parte de arriba del mapa  mid en es la parte central  bot es la parte de abajo y adc serias los tiradores ( ashe jinx lucian etc )","replies":[]}]}