{"poster":"Dog Bulling","date":"2018-02-11T22:30:35.357+0000","title":"Porque usar a... Sion","subforum":"Guias y consejos","up_votes":3,"down_votes":3,"body":"Buenos d&iacute;as, tardes, noches, o lo que sea. \n\nHoy tengo ganas de hablar de uno de los campeones m&aacute;s ignorados del juego, incluso tras haber recibido un rework total. Como no puede ser Taric (M&aacute;s que nada porque ya hice gu&iacute;a de &eacute;l) me refiero a Sion, uno de los mejores tanques que existen, aunque muy infravalorado por muchos**(Al punto que mi support me dijo que Sion era una ######, y al decirle que era de lo mejor me dijo &ldquo;Si tu lo crees todo es posible&rdquo;. Al final obtuve cofre, humill&eacute; al toplaner rival que intentaba tiltearme a toda costa y la Sona fue la que peor jug&oacute; en la partida. Una partida casi perfecta)**.\n\nhttp://i.imgur.com/OJxQ1bS.jpg\n\nPero esta gu&iacute;a no solo se centra en el sion top que todos conocen, sino que tambien en su posici&oacute;n m&aacute;s subestimada, considerada incluso antimeta, aunque la verdad es igual de efectiva: Sion soporte. SI, ME OYERON BIEN, DIJE SION SOPORTE, y la verdad es que tiene un potencial enorme. Sin m&aacute;s divagaci&oacute;n, veamos que hace.\n\n**Su pasiva: Gloria en la muerte**\n\n> Sion tras morir, se levanta durante unos segundos. Sion pierde vida r&aacute;pidamente, pero adquiere mucha velocidad de ataque, un 100% de robo de vida y sus b&aacute;sicos infligen 10% de la vida m&aacute;xima como da&ntilde;o extra. En ese estado puede usar impulso de muerte, que le da una bonificaci&oacute;n de rapidez durante 1,5 segundos. No puede usar otras habilidades, eso s&iacute;. \n\n> La Verdad no es tan buena como parece, ya que casi todo el mundo tiene destellos, saltos y/o CC potente (Por eso quieren hacerle un rework a Udyr). Pero bueno, al menos podr&iacute;a permitirnos morir llev&aacute;ndonos a alguien.\n\n**Su Q: Impacto aniquilador**\n\n> Sion levanta su hacha, haciendo da&ntilde;o en &aacute;rea al frente suyo y ralentizando brevemente a los enemigos golpeados. Si se carga por m&aacute;s de un segundo (cuando el marco del hitbox se vuelve m&aacute;s n&iacute;tido), los levantar&aacute; por los aires durante buen tiempo, hasta 2,25 segundos. El da&ntilde;o tambi&eacute;n aumenta con el tiempo de carga, desde (20-100 + 65% de AD) hasta (60-300 + 195% de AD) de da&ntilde;o f&iacute;sico. \n\n> Cuesta 45 de man&aacute; en todos los niveles y un CD de 10-6 segundos. Esta habilidad es el mayor CC de Sion. Su excelente da&ntilde;o base y utilidad en invades la hace la mejor habilidad a nivel 1, o al menos cuando vas a top.\n\n**Su W: Horno del Alma**\n\n> Pasivamente, matar un enemigo te aumenta tu vida de forma permanente. Al activarse, Sion se escuda pudiendo mitigar (30-130 + 40% de tu AP + 8-12% de tu vida m&aacute;xima) de da&ntilde;o. Tras 3 segundos y si el escudo a&uacute;n no se rompe, Sion puede hacer (40-140 + 40% de tu AP + 10-14% de la vida m&aacute;xima del enemigo) como da&ntilde;o m&aacute;gico en &aacute;rea al hacer estallar dicho escudo. Eso s&iacute;, el estallido solo impacta al primer enemigo en una direcci&oacute;n determinada.\n\n> Cuesta 65-85 de man&aacute; y tiene un CD de 11 segundos en todos los niveles. Claramente no es la mejor habilidad para maximizarse de primeras.\n\n**Su E: Rugido del asesino (El chutea minions)**\n\n> Sion ruge, ralentizando un 40-60% por 2,5 segundos, quitando armadura e infligiendo (70-210 + 40% de su AP) al primer objetivo. Si el objetivo es un s&uacute;bdito o monstruo, Este ser&aacute; empujado una considerable distancia. Los rivales golpeados por el s&uacute;bdito o monstruo sufren a&uacute;n m&aacute;s da&ntilde;o (91-273 + 52% de su AP) y tambi&eacute;n son ralentizados, aunque no pierden armadura. El s&uacute;bdito empujado no muere hasta el final del trayecto.\n\n> Cuesta 35-55 de man&aacute; y tiene un CD de 12-8 segundos. Esta habilidad es el pokeo de este zombi, y dado su estilo de juego, suele ser la habilidad que se maxea primero.\n\n**Su R: Embestida imparable (el tren descarrilado)**\n\n> Sion corre a toda velocidad durante 8 segundos, haciendo da&ntilde;o a sus rivales y aturdi&eacute;ndolos. Como bien dice su nombre, no puede ser parada salvo que se estampe con un muro o campe&oacute;n rival, as&iacute; como al pulsar nuevamente la R. Dependiendo de la rapidez alcanzada por Sion, puede hacer desde (150-450+ el 40% de su AD extra) hasta (400-1200 + el 80% de su AD extra) de da&ntilde;o en &aacute;rea a todo lo que se le cruce, y aturdir desde 0,75 hasta 1,75 segundos, as&iacute; como levantarlos brevemente. La carrera es casi en l&iacute;nea recta, aunque puede ser ligeramente cambiada con el cursor.\n\n> Cuesta 100 de man&aacute; y tiene un enfriamiento de 140-60 segundos. Como buena definitiva se maxea cuando se pueda.\n\nRealmente aqu&iacute; no tengo mucha idea del orden de habilidades. No obstante, lo que parece ser m&aacute;s fiable actualmente es este:\n\n**R(6)&gt;&gt;E(2)&gt;Q(1)&gt;W(3) en top\nR(6)&gt;&gt;E(1)&gt;W(2)&gt;Q(3)como soporte**\n\n**Pros**\n> Tiene un pokeo impresionante\n\n> Su CC es sumamente bruto y potente\n\n> Como casi todo tanque de top, tiene un da&ntilde;o base bastante bueno.\n\n> Limpia muy bien las oleadas para no hacerse a da&ntilde;o.\n\n> Sus consumos de man&aacute; son muy bajos.\n\n> Puede acumular vida de forma ilimitada\n\n> Es vers&aacute;til en el sentido de que puede ir a 2 l&iacute;neas con buen desempe&ntilde;o en ambas\n\n> Obviamente si es un tanque, tiene un aguante bastante elevado.\n\n> Tiene un buen snowball, sobre todo para ser un tanque\n\n> No es dif&iacute;cil de usar\n\n> Casi nunca es bloqueado ~~o usado~~.\n\n> No es de esos t&iacute;picos tanques aburridos\n\n**Contras**\n> Salvo su R no tiene movilidad\n\n> Su Q no es dif&iacute;cil de evitar si el rival no est&aacute; ralentizado.\n\n> Su pasiva es mucho menos &uacute;til de lo que aparenta.\n\n> Su da&ntilde;o sostenido es mal&iacute;simo fuera de su pasiva.\n\n> No tiene tanto peel cuando se juega como soporte, o al menos comparado a otros soportes tanques.\n\n> Y poco m&aacute;s. Cuando digo que est&aacute; roto es que est&aacute; roto.\n\n\n**Necesidades**\n\nVida, Resistencias, CDR.\nSon las necesidades t&iacute;picas de un tanque, por lo que no hay que buscar m&aacute;s explicaci&oacute;n. Lo &uacute;nico que merece ser mencionado es que cuando va top el man&aacute; se vuelve algo m&aacute;s importante, mientras que de soporte necesita objetos que le den m&aacute;s utilidad y peel.\n\n#Runas\n\nInvestigando me llev&eacute; una sorpresa bastante grande, y es que las runas que lleva Sion son de brujer&iacute;a como principal, m&aacute;s concretamente que suele usar cometa arcano para abusar a m&aacute;s no poder de su rugido. Las runas que suele llevar son estas:\n\n**Brujer&iacute;a:**\n> Cometa arcano: Junto al pokeo y slow de la E, convierte a Sion en una bestia casi insoportable al inicio.\n\n> Banda de man&aacute;: Para no tener problemas de man&aacute; al inicio, ya que intentaremos spamear la E cuando podamos. Aunque bueno, sion tampoco es que Queme mucho maná, pero una ayuda siempre es bienvenida.\n\n> Trascendencia: Esa taza de CDR extra es incre&iacute;blemente &uacute;til con este campe&oacute;n, ya que su armado suele llevar un 30% de CDR.\n\n> Quemadura: Quemadura + Cometa + minion chutado con la E= el rival perder&aacute; un cuarto de su vida cada 20 segundos.\n\n**Valor**:\n> Demoler (Top): Nos otorga una mejor capacidad de destruir torres, la cual se aprecia mucho en tanques de Top.\n\n> Fuente de vida (Soporte): Si vas de soporte para mantener con m&aacute;s vida a tu ADC (Porque repito, esto sirve de soporte, y con muy buenos resultados).\n\n> Sobre crecimiento (Top): Esta runa tiene una sinergia impresionante con la pasiva de la W.\n\n> Segundo aire (Soporte o Top): Para reponerse ante el desgaste rival, lo cual es incre&iacute;blemente &uacute;til en bot, aunque tambi&eacute;n tiene su utilidad ante campeones a rango en top.\n\nhttps://i.gyazo.com/1e1323d66695b0536741b67e66311ac4.png\nhttps://i.gyazo.com/66792e076a66b66016a0340e81dfc4d5.png\n\nOtras opciones: \n> **Precisi&oacute;n**\n\n> Triunfo, Legenda: Tenacidad.\n\n> **Dominaci&oacute;n** \n\n> Golpe bajo, Ward zombi, Cazador incesante.\n\n> **Brujer&iacute;a** \n\n> Sombrero definitivo, Celeridad, Tormenta creciente.\n\n> **Valor**\n\n> Aliento del ag&oacute;nico, R&eacute;plica, Perseverancia, Condicionamiento, Piel de hierro, Coraza reflejante.\n\n> **Inspiraci&oacute;n**\n\n> Entrega de galletas, Momento oportuno, Calzado m&aacute;gico, Mercado del futuro, Cuerpo celeste, Percepci&oacute;n c&oacute;smica.\n\nPero bueno. Esto es a pinta suya. Eso s&iacute;, hay que tener un m&iacute;nimo de conciencia de lo que uno busca potenciar y del personaje que est&aacute;s usando. Por ejemplo, nadie en su sano juicio usar&iacute;a claridad mental, banda de man&aacute;, R&eacute;plica, Impacto repentino o entrega de galletas con Garen, ya que el carece de CC duro, saltos o consumo de man&aacute;. Yendo a la jungla es muy dif&iacute;cil que le saques provecho a Cleptoman&iacute;a, aliento del ag&oacute;nico, Desmaterializador o Sabor a sangre.\n\n\n#Hechizos:\n> {{summoner:4}} : Obligatorio con casi cualquier campe&oacute;n, sobre todo en aquellos sin saltos.\n\n> {{summoner:12}} : Para no perder experiencia y farm cuando vamos a top, as&iacute; como la posibilidad de aportar un buen roaming.\n\n> {{summoner:14}} : La opci&oacute;n m&aacute;s agresiva de un soporte. Dado nuestro enfoque de soporte tanque agresivo, la ignici&oacute;n combina mucho mejor con este campe&oacute;n.\n\n> {{summoner:3}} : La opci&oacute;n pasiva y segura de un soporte. Realmente no es muy recomendable con este campe&oacute;n, aunque puede ser de mucha ayuda ante asesinos y para mejorar nuestro peel.\n\n#Objetos\n**Inicio**\n\n> {{item:2033}} : La opci&oacute;n agresiva cuando vamos a top. Recuerda que su pasiva nos permite desgastar m&aacute;s al rival.\n\n> {{item:1054}} : Es la opci&oacute;n m&aacute;s segura cuando vamos a top.\n\n> {{item:3302}} : En el caso de ir soporte.\n\n> {{item:3340}} : M&aacute;s vale Ward en mano que gank en el&hellip; ya saben que quiero decir.\n\n**Objetos clave**\n> {{item:3751}} (Top): Para empujar r&aacute;pido la l&iacute;nea.\n\n> {{item:3097}} (Soporte): Para obtener ese hermoso escudo y compensar que nuestro armado no es tan resistente como en top. Aparte, TODO SOPORTE DEBER&Iacute;A LLEVAR PIEDRA DE VISI&Oacute;N, o su equivalente desde el 8.2.\n\n> {{item:1001}} {{item:2422}} : TODOS DEBEN LLEVAR USAR BOTAS (Salvo la serpiente, que no puede usarlas).\n\n> {{item:2055}} : TODOS DEBEN LLEVAR Y COMPRAR CENTINELAS.\n\n**Objetos normales**\n\nTop\n> {{item:3068}} : La evoluci&oacute;n de la ceniza. Nos otorga buen da&ntilde;o m&aacute;gico sostenido contra rivales y una limpieza espectacular.\n\n> {{item:3111}} : Botas para mitigar el mayor da&ntilde;o posible. Estas aparte otorgan tenacidad.\n\n> {{item:3065}} : De lo mejor que hay contra el da&ntilde;o m&aacute;gico, aparte que mejora tu W y el robo de vida tras morir.\n\n> {{item:3110}} : Nos otorga mucho CDR a la vez que un mont&oacute;n de armadura, man&aacute; y la capacidad de bajar la velocidad de ataque.\n\n> {{item:3193}} : As&iacute; te vuelves casi inmortal mientras esperas a tener de nuevo tus habilidades.\n\n> {{item:3083}} : Nos permitir&aacute; ser pr&aacute;cticamente inmortales de toda la vida que adquirimos, y estar disponibles para una segunda batalla sin estar forzado a volver a base.\n\n> {{item:2138}} : Para mayor tenacidad y aguante.\n\n> Y si, s&eacute; de sobra que no hay mucha vida en ese armado hasta que pillemos la warmog, lo cual casi nunca terminar&iacute;amos haciendo, pero la pasiva de la W compensa ese problema.\n\n\nSoporte\n\n> {{item:3401}} : Nos da mucha vida, CDR, algo de regeneraci&oacute;n de vida y la pasiva que obtuvimos por la misi&oacute;n, es decir la capacidad de poner visi&oacute;n de hasta 4 centinelas. Nada mal por solo 1900 de oro.\n\n> {{item:3111}}: IGUAL QUE ANTES. Aparte que con tu R las botas de movilidad no las vas a necesitar en absoluto.\n\n> {{item:3364}} : Una vez completemos la misi&oacute;n lo mejor ser&iacute;a cambiarnos a este lente y mitigar la visi&oacute;n enemiga.\n\n> {{item:3190}} : Dada toda la vida que solemos acumular, el Solari es simplemente espectacular con nosotros. Eso s&iacute;, dada la p&eacute;rdida del escudo del targon, no ser&iacute;a mala idea un rush al Solari. Tambi&eacute;n podr&iacute;a considerarse hacer ese combo de Placa p&eacute;trea+Solari para hacer un escudo de m&aacute;s de 2000 de vida.\n\n> {{item:3109}} : La armadura, CDR y vida que otorga ya lo hacen decente para su bajo coste, pero si encima le sumamos esa capacidad de mitigar da&ntilde;o a nuestro carry, simplemente se vuelve incre&iacute;ble.\n\n> {{item:3800}} : Elecci&oacute;n personal. Con esto obtenemos un segundo enganche aparte de nuestra R, as&iacute; como Armadura, man&aacute; y CDR.\n\n> {{item:3107}} : Mas que nada porque carecemos de mejores opciones (RITO PLS, aumenta la gama de objetos de soporte que den vida). Y bueno, la activa de la redenci&oacute;n siempre ha sido rid&iacute;culamente buena.\n\n> {{item:2138}} : Repito, es un tanque.\n\nObjetos opcionales\n> {{item:3143}} : Mucho da&ntilde;o de cr&iacute;tico. Recuerda que no solo los b&aacute;sicos pueden hacer cr&iacute;tico.\n\n> {{item:3075}} : Para que los tiradores se vuelven menos potentes contra ti. \n\n> {{item:3047}} : Si necesitas mitigar mucho da&ntilde;o f&iacute;sico.\n\n> {{item:3025}} : Para mejorar notablemente tu limpieza y tu cadena de CC.\n\n> {{item:3742}} : Tus rivales tienen mucha movilidad.\n\n> {{item:3194}} : Alguno de tus rivales puede spamear hechizos de da&ntilde;o m&aacute;gico, aunque sea solo 1.\n\n> {{item:3001}} : El AP de tu equipo est&aacute; con mucha ventaja de oro.\n\n> {{item:3512}} : Nos ayuda al Split push. Eso s&iacute;, era mucho mejor cuando viv&iacute;an m&aacute;s tiempo los bichitos.\n\n> {{item:3060}} : El equivalente del ZZ si vas soporte. \n> {{item:3748}} : Objeto agresivo que nos da mejor limpieza y da&ntilde;o por nuestra vida.\n\n> {{item:3053}} : Opci&oacute;n agresiva que nos da tambi&eacute;n un escudo considerable en batalla.\n\n> {{item:3800}} {{item:3190}} {{item:3193}} : Lo menciono m&aacute;s que nada porque sirve en ambos roles.\n\n> {{item:3050}} : Si vas soporte y su equipo es full AD.\n\n> {{item:3383}} {{item:3373}} {{item:3379}} : Si tienes un Orrn en el equipo. Eso s&iacute;, no es buena idea comprarlos hasta el juego tard&iacute;o.\n\n\n#Consejos\n\n> 1&deg;: Tanto si eres soporte como si eres Top, **_ES MUY IMPORTANTE EL HOSTIGAMIENTO CON NUESTRA  E_**. Nuestro da&ntilde;o sostenido es bastante malo, y aunque nuestra pasiva sirva para revertir una batalla, lo ideal obviamente es no morir.\n\n> 2&deg;: Si eres top, debes intentar farmear todo lo posible para acumular vida. Como soporte debes intentar obtener los ca&ntilde;ones con el targon siempre que puedas por la misma raz&oacute;n. Eso s&iacute;, tampoco merece la pena perder media vida por un s&uacute;bdito.\n\n> 3&deg;: Nuestro CC m&aacute;s potente es muy f&aacute;cil de esquivar. Por ello es importante empezar un ALL in cuando el rival sufra del slow causado por nuestro rugido **(Usar nuestra Q cuando despu&eacute;s de conectar la E).**\n\n> 4&deg;: **Para sacarle el m&aacute;ximo partido a la W, lo ideal es usarla antes de empezar el intercambio de da&ntilde;o,** ya que el escudo ese no es la gran cosa al inicio de la partida en cuanto a mitigaci&oacute;n, y hacia el final como que los rivales tienen el da&ntilde;o para quitarte esa protecci&oacute;n de manera r&aacute;pida.\n\n> 5&deg;: **La Q no se v&eacute; si es lanzada en los arbustos. Eso significa que podemos hacer hacer la del Garen**: Meternos a un arbusto, esperar a nuestra v&iacute;ctima y all&iacute; cargar nuestra hacha para aplicarle nuestro CC. Util sobretodo si vas de soporte y tus rivales no wardean los arbustos de bot.\n\n> 6&deg;: Ahhh, el minion gordo. Ese que aguanta mucho m&aacute;s de lo normal, que otorga el triple de oro, y por el cual har&iacute;amos casi cualquier estupidez (Al igual que con la droga llamada enamoramiento). Lo que quiero decir es que **el mejor momento para intercambiar es cuando tu minion gordo esta a muy poco de vida**, ya que deber&aacute; decidir entre quedarse atr&aacute;s en oro o perder mucha vida.\n\n> 7&deg;: **Realmente no buscamos matar a nuestro rival en primera instancia**, sino que queremos hacer que el rival se vaya a base reiteradamente o que nuestro jungla nos gankee. Repito, nuestros intercambios de da&ntilde;o son algo lentos.\n\n> 8&deg;: **Quedarte en exceso en l&iacute;nea es una horrenda idea, ya que desperdicias toda la ventaja adquirida.** Lo mejor es en fase de l&iacute;neas, irse tras limpiar una oleada, o bien ayudar  a nuestro jungla a hacerse un drag&oacute;n o heraldo. Evitar enfrentarnos nuevamente al que echamos de l&iacute;nea suele ser lo &oacute;ptimo, aunque obviamente eso no es tan v&aacute;lido despues del minuto 10.\n\n> 9&deg;: **No siempre es necesario usar la R a larga distancia. Hay ocasiones en las que usar dicha habilidad a corto rango es mejor** forma para iniciar tu cadena de CC, sobretodo si hay otro iniciador en tu equipo.\n\n> 10&deg;: **No sobreestimes tu pasiva**, ya que con el meta actual (Y futuro, para que les voy a enga&ntilde;ar) con tanta movilidad y CC potente es muy dif&iacute;cil sacarle partido, y de todas formas, el tradeo ser&iacute;a un empate y no una victoria, algo que puede ser muy peligroso ante campeones de snowball.\n\n> 11&deg;: Tu misi&oacute;n es ser la vanguardia de tu equipo, es decir, el que inicia las batallas. Es muy importante atropellar al rival correcto con tu R o a m&aacute;s de uno, as&iacute; como hacer buen uso de tu Q, la cual debe tirarse seg&uacute;n las necesidades de la batalla al objetivo adecuado. Y recuerden mostrar iniciativa y ser oportunistas, ya que sin ello eres casi in&uacute;til en tu rol.\n\n> 12&deg;: Es muy importante ser consciente de que si vas soporte, no vas a aguantar tanto como yendo en top.\n\n> 13&deg;: Si bien para pushear es bueno cargar al m&aacute;ximo la Q, **contra campeones lo &oacute;ptimo es solo cargar un segundo,** o en su defecto solo hacer un slow en &aacute;rea si el rival puede apartarse r&aacute;pido.\n\n> 14&deg;: Lo he dicho en otras gu&iacute;as y lo reitero. **Si tu tirador tiene menos cerebro que alguien que se le ocurre flamear a un rioter, el claramente no es el Carry en esa partida. Ergo, no merece la mena protegerlo,** ya que no va a aportar nada m&aacute;s que oro al enemigo, as&iacute; que muchas veces dejarlo a su suerte podr&iacute;a ser lo mejor. Esto es v&aacute;lido independiente de tu posici&oacute;n, y aplicable sobre todo cuando eres el support.\n\n> 15&deg;: Por si no lo sab&iacute;an, **uno puede activar objetos durante la pasiva de sion**, aunque no pueda lanzar las habilidades convencionales o hechizos. Esto les da la posibilidad de usar un randuin para evitar escapes, un Solari que no pudistes lanzar antes, entre otros usos.\n\n> 16&deg;: Los que ya he dicho hasta el hartazgo pero a&uacute;n as&iacute; merecen la pena recordarse. No descuidar las l&iacute;neas; Reclamar una recompensa tras una victoria en TF; No extender de forma innecesaria una partida; Al ir por detr&aacute;s jugar con cautela esperando el late; Intentar mostrar tu soberan&iacute;a sin arriesgar en exceso al ir por delante; No perseguir la kill; Mirar el mapa con frecuencia; Wardear regularmente y comprar visi&oacute;n al volver de base; No malgastar tus habilidades; Volver a base de manera regular; Adaptar t&uacute; armado ante la situaci&oacute;n; No rendirse si existen posibilidades realistas(No v&aacute;lida en elos altos); respetar a los dem&aacute;s invocadores; etc.\n\nY realmente eso ser&iacute;a todo. Reitero la idea inicial: No entiendo como un campe&oacute;n de estas caracter&iacute;sticas no es m&aacute;s usado. Digo, es un pick solido en soloQ, sumamente agresivo para ser un tanque, y no es tan aburrido mec&aacute;nicamente hablando. Supongo que simplemente la gente se cree que lo de la LCS es lo mejor, o yo que se. En serio les recomiendo darle una oportunidad aunque sea, ya que dudo seriamente que alguien termine decepcionado de esta maravilla de rework.\n\nPD: Primero, mientras hac&iacute;a la gu&iacute;a Sion subi&oacute; al primer lugar en winrate tanto en top como de soporte, as&iacute; como que su popularidad en top se triplic&oacute;. Consideren banearlo si no piensan usarlo.\n#Y segundo, no pienso hacer las gu&iacute;as mas cortas.","replies":[{"poster":"GDPhyros","date":"2018-02-11T22:56:28.362+0000","up_votes":1,"down_votes":0,"body":"linda guia, bastante larga.\nuse a sion suport en la S4, me decian lo mismo pero tiene todo lo nesesario para ser soporte a esepcion de curar, porlotanto no podia estar equivocado.\n\nTambien se puede jugar full AP y hace mucho daño.\ncon respecto a las runas yo cambiaria banda de mana por el gorro definitivo y trasendencia por celeridad\nhttps://las.leagueoflegends.com/es/featured/preseason-update/8200-8229?build=21210331\n\nhttps://www.youtube.com/watch?v=0s4fqg5ekzQ","replies":[{"poster":"Dog Bulling","date":"2018-02-12T21:47:04.774+0000","up_votes":1,"down_votes":0,"body":"Sinceramente, y viendo sus escalados, no lo jugaría AP ni de broma. Full AD puede ser debido a ese 200% de escalado en la R y la Q, pero la W y la E escalan solo un 40%, insuficiente para hacer oneshots en igualdad de condiciones, por lo que era muy malo con ese armado. No es un Malphite que al menos entre todas sus habilidades escala un 190% junto a un 100% de su R, ni un {{champion:32}} , ni un {{champion:79}}, porque a diferencia de los anteriores este zombi devorajardines (He estado jugando bastante Plantas vs Zombis últimamente. No me juzguen) tiene unos escalados muy malos de AP. Pero bueno, almenos tiene daño híbrido, lo cual lo hace más dificil de resistir.\n\nAparte de lo de las runas, mencioné esas opciones como secundarias. Lo que pasa es que poner todas y cada una de las runas es mucho texto incluso para mí.\n\nPD: No entiendo como es que esta guía pasó tan desapercibida.","replies":[{"poster":"GDPhyros","date":"2018-02-13T03:50:06.648+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dog Bulling,realm=LAS,application-id=8sKIclmi,discussion-id=V3FAAuEb,comment-id=00000000,timestamp=2018-02-12T21:47:04.774+0000)\n>\n> Sinceramente, y viendo sus escalados, no lo jugaría AP ni de broma. Full AD puede ser debido a ese 200% de escalado en la R y la Q, pero la W y la E escalan solo un 40%, insuficiente para hacer oneshots en igualdad de condiciones, por lo que era muy malo con ese armado. No es un Malphite que al menos entre todas sus habilidades escala un 190% junto a un 100% de su R, ni un {{champion:32}} , ni un {{champion:79}}, porque a diferencia de los anteriores este zombi devorajardines (He estado jugando bastante Plantas vs Zombis últimamente. No me juzguen) tiene unos escalados muy malos de AP. Pero bueno, almenos tiene daño híbrido, lo cual lo hace más dificil de resistir.\n> \n> Aparte de lo de las runas, mencioné esas opciones como secundarias. Lo que pasa es que poner todas y cada una de las runas es mucho texto incluso para mí.\n> \n> PD: No entiendo como es que esta guía pasó tan desapercibida.\n\npasas por alto un par de cosas.\n\nno hay runas de mr\nlas runas nuevas otorgan un daño adicional a cada pokeo, en particular si dejas lento a alguien de un ataque\nsi bien no tiene autoataques fuertes la W escala mucho escudo por vida y AP y la E hace daño aumentado si pateas un minion.\n\nel bursteo que haces  tirando todo es muy fuerte (pokeas con un minion, si pega cargas escudo y te lanzas con la R, si no la pegas la R te detienes cerca. cargas la Q y explotas la W, si sobrevive ignite.)","replies":[]}]}]},{"poster":"Ks Erwyn","date":"2018-02-12T20:10:58.464+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Nerfeadozx","date":"2018-02-12T03:25:48.479+0000","up_votes":1,"down_votes":0,"body":"{{champion:14}}  :3","replies":[]},{"poster":"Ahrmadyl","date":"2018-02-12T02:08:28.153+0000","up_votes":1,"down_votes":0,"body":"Buena guia, pero lo principal de Sion que lo hace... diferente a los otros tanques (en top) es su CC no fidedigno. Los otros tanques tienen CC o Point & click ({{champion:57}} ) o facil de pegar. Sion no. Sion es como un tanque que tiene mas CC y daño que los otros tanques, pero que es mucho mas dificil de pegar. Y mas en esta Meta en la que hay muucha movilidad.","replies":[]},{"poster":"pepi99 manc0","date":"2018-02-11T23:41:44.715+0000","up_votes":1,"down_votes":0,"body":"se nota la dedicacion al post +1 como no uso tops no lo lie detalladamente pero sion tiene un win rate alto en elos altos","replies":[]}]}