{"poster":"CN Mengde","date":"2019-03-12T20:56:24.093+0000","title":"Disconnect im Spiel","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo, \nich habe meist das Problem das die Verbindung im Spiel getrennt wird und mir angezeigt wird das \nes versucht sich wieder zu Verbinden. Es liegt nicht meinem Internet da ich während das passiert\nimmer noch ganz normal alles andere machen kann. Ich kann da warten wie ich will aber es passiert \nnichts. Wenn ich versuche den Client neu zustarten dann funktioniert das Einloggen auch nicht mehr \nund nach ca. 5 bis 10 Minuten geht es wieder. Ich habe schon viele Spiele deswegen verloren und wurde\nauch bestraft. Die LP die ich dadurch verloren habe ist mir egal aber ist doof das ich für sowas bestraft \nwerde obwohl ich nichts dafür kann. Ich weiß einfach nicht was dazu führt das meine Verbindung \ngetrennt wird. Früher war alles ok und mir ist sowas nie passiert aber jetzt seit ca. 1 bis 2 Monaten hat \nes angefangen. \nIch hoffe, dass mir jemanden helfen!","replies":[{"poster":"Angel Ayume","date":"2019-03-12T21:06:21.596+0000","up_votes":1,"down_votes":0,"body":"Eventuell können dir die Wrenchman hier helfen.\nAber du könntest auch den Support bzgl technischer Probleme anschreiben. Die können vllt auch rausfinden was das Problem bei dir verursacht :)","replies":[{"poster":"CN Mengde","date":"2019-03-12T21:23:44.432+0000","up_votes":1,"down_votes":0,"body":"Ich habe schon ein Ticket geschrieben aber die Lösungsversuche die mir genannt wurden habe ich gemacht \naber es ist immer noch gleich.","replies":[{"poster":"Angel Ayume","date":"2019-03-12T21:33:45.617+0000","up_votes":1,"down_votes":0,"body":"Hast du das dem Support denn mitgeteilt? Normalerweise arbeiten sie mit dir an einer Lösung.","replies":[{"poster":"CN Mengde","date":"2019-03-13T17:09:42.625+0000","up_votes":1,"down_votes":0,"body":"Ja und ich warte auf die Antwort aber ich dachte vielleicht kann mir hier jemand auch helfen.","replies":[]}]}]}]},{"poster":"MetroXproXGamer","date":"2019-03-12T21:00:51.949+0000","up_votes":1,"down_votes":0,"body":"Du kriegst keine Strafe, da es die Schuld der Server ist, die aktuell nicht gehen, daher bekmmen auch gewinner nur die hälfte an LP und Verlierer verlieren nichts :)","replies":[{"poster":"Angel Ayume","date":"2019-03-12T21:04:42.286+0000","up_votes":1,"down_votes":0,"body":"Er hat das Problem seit 1-2 Monaten und er sagte er wurde bestraft.","replies":[{"poster":"MetroXproXGamer","date":"2019-03-12T21:07:31.666+0000","up_votes":1,"down_votes":0,"body":"Jaaa, vielleicht sollte man auch die letzten 2 Sätze lesen :D Dachte er meint, wegen den Server Problemen atm.....Sorry :D","replies":[{"poster":"Angel Ayume","date":"2019-03-12T21:10:40.663+0000","up_votes":1,"down_votes":0,"body":"Wäre von Vorteil :D kein Problem. :)","replies":[]}]}]}]}]}