{"poster":"MonkeyMw","date":"2019-08-28T17:26:33.356+0000","title":"AZ ALKALMAZÁS SZÁMÁRA NEM ENGEDÉLYEZETT A GRAFIKUS HARDVER ELÉRÉSE","up_votes":1,"down_votes":0,"body":"néhány napja ezt írja ki a laptopom valaki segítsen hogy ilyenkor mit kell tenni légy szives{{sticker:sg-zephyr}}","replies":[{"poster":"PowerPein","date":"2019-08-29T14:06:59.284+0000","title":null,"up_votes":1,"down_votes":0,"body":"Futtasd rendszergazdai módban.","replies":[{"poster":"MonkeyMw","date":"2019-08-29T18:01:39.630+0000","title":null,"up_votes":1,"down_votes":0,"body":"nem segített próbáltam ugyanúgy kidob a játék és küldök error reportot is mondjuk az nem tudom mire jo","replies":[{"poster":"PowerPein","date":"2019-08-30T06:30:27.585+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ha a játék weboldaláról küldted a hiba jelentést akk általában 4-5 napon belül válaszolnak. A videókártya drivere friss? Mert lehet hogy az új verzóval vannak gondok.","replies":[{"poster":"MonkeyMw","date":"2019-08-30T16:36:26.601+0000","title":null,"up_votes":1,"down_votes":0,"body":"az a helyzet nem értek hozzá nagyon hogy melyik driver frissítés megy hozzá mert leszedtem azt amit irt neki de így sem jó.\nAmúgy egy AMD Radeon HD 7640 G van a laptopban csak az a baj mindeggyik frissitést kiprobáltam már de nem jó","replies":[{"poster":"PowerPein","date":"2019-08-31T05:02:52.845+0000","title":null,"up_votes":1,"down_votes":0,"body":"Melyik windows van felrakva? Mert ha a 10-es akkor ott egy kompatibilitási móddal (ikonra jobb klikk-> tulajdonságok-> Kompatibilitás fül->  \"futtatás a következő kompatibilitási üzemmódban\" legyen ki pipálva és válaszd a win-7et pl.) meglehet próbálni. Meg mikor írja ki ezt a hibát? Egyből a kliens indítás után vagy amikor megvolt a hős választás és utána?\nA windows csinált-e verzió frissítést? A win10-hez májusban jött ki verzió váltás. \nA windows rendszer mennyire van karban tartva? Pl.: scandisk, lemeztöredezettség mentesítő (defrag), vírus írtó stb...","replies":[]}]}]}]}]}]}