{"poster":"Zindro","date":"2018-10-20T17:37:36.696+0000","title":"y si en lugar de quejarnos de LAS, vemos lo positivo?","subforum":"Charlas Generales","up_votes":9,"down_votes":15,"body":"Vi decenas de miles de post de gente quej&aacute;ndose de LAS, que su comunidad es una de las peores y mas mierdas acerca de Ranked y honor.\r\n\r\nPero dejar&eacute; eso atr&aacute;s y me centrar&eacute; en lo bueno esta vez. Por ejemplo:\r\n\r\n\r\nLATAM es el &uacute;nico servidor en el que en los doblajes de campeones se atrevieron a usar memes ej: \r\nKayn odisea: Malphite, oblogame perro!\r\n\r\n\r\nEn fan-arts somos los mas creativos incluyendo las s&uacute;per animaciones que la comunidad hace.\r\n\r\n\r\nSomos los &uacute;nicos que tuvimos una compa&ntilde;era en YT que nos daba los parches de &quot;Actualizando&quot; \r\nPd: F por Pancha.\r\n\r\n\r\n\r\nGracias a nosotros se implementaron muchas skins de la comunidad.\r\nEj: Pantheon panadero, Swain domador de dragones, etc...\r\n\r\n\r\n\r\nY por ultimo, cr&eacute;anme o no, fuimos quienes implementaron la jg al juego.\r\n\r\n\r\nMe falta algo positivo?","replies":[{"poster":"Nuke","date":"2018-10-20T18:32:56.379+0000","up_votes":13,"down_votes":1,"body":"> LATAM es el único servidor en el que en los doblajes de campeones se atrevieron a usar memes ej:\nKayn odisea: Malphite, oblogame perro!\n\nMentira\n\n> Gracias a nosotros se implementaron muchas skins de la comunidad.\nEj: Pantheon panadero, Swain domador de dragones, etc...\n\nMentira\n\n> Y por ultimo, créanme o no, fuimos quienes implementaron la jg al juego.\n\nMentira\n\n>  LAS, que su comunidad es una de las peores y mas mierdas acerca de Ranked y honor.\n\nVerdad xD","replies":[{"poster":"DevilDuriel","date":"2018-10-20T19:33:57.972+0000","up_votes":3,"down_votes":0,"body":"Totalmente de acuerdo jajaja{{sticker:sg-ahri-3}}  tanta vendida de humo parece cancha de boca xd","replies":[]},{"poster":"HarpaX","date":"2018-10-20T19:05:09.066+0000","up_votes":2,"down_votes":0,"body":"{{sticker:sg-miss-fortune}} {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Mazoku","date":"2018-10-20T18:41:16.777+0000","up_votes":4,"down_votes":4,"body":"Mucha razon.\n\n+1","replies":[]}]},{"poster":"ImNw","date":"2018-10-20T18:37:39.341+0000","up_votes":7,"down_votes":0,"body":"Dios mio cuanta mentira hay en este post, juego desde la S2, antes de que se creara LAS y la jg existe desde antes de que yo entrara a jugar, el skin de Panteon panadero y Swain DT son memes desde tambien esas epocas, en el resto es opinion a gusto personal, pero hace rato existen gente que crea contenido de todo tipo(animaciones e informacion sobre parches), y basicamente, en todos los idiomas los personajes tienen memes, yo tengo el juego en inglesy hay algunos memes conocidos de habla inglesa obviamente, ahora mismo no se me ocurre ninguno\n\nPD: Quiza no somos la region mas toxica, pero si la menos competitiva y eso no es problema del servidor, sino de la importancia que tienen los E-Sports en los distintos paises en general que basicamente es nulo y hasta se lo ve como un aspecto negativo, quiza en un futuro cambie, pero actualmente es la realidad que nos toca. Ademas cabe destacar que el nivel de desarollo personal economicamente hablando, en los paises asiaticos parece que es menor, debido a que no existe mucha distribucion de la riqueza(un ejemplo es china,o sos muy pobre, o la juntas en pala)","replies":[]},{"poster":"Winter Lion","date":"2018-10-20T18:53:08.759+0000","up_votes":4,"down_votes":0,"body":"en realidad la gran mayoria de lo que le atribuyes a latam son cosas que empezaron en NA y lo trajeron para aqui xd y en animacion hasta ahora no he visto a nadie de latam que sea mejor que dojo  y sus remix xd","replies":[]},{"poster":"LordClaus98","date":"2018-10-20T19:16:23.975+0000","up_votes":2,"down_votes":0,"body":"La mayoria de esas cosas no son buenas y la jg es mentira","replies":[]},{"poster":"CamaleonaBugeada","date":"2018-10-20T18:11:41.152+0000","up_votes":6,"down_votes":4,"body":"Bueno, digamos que no concuerdo en absolutamente nada contigo...\n\n1-A MI parecer el doblaje latino es mediocre, hay pocas voces las cuales no ME dan cringe al oírlas (la de Jinx creo que es la mejor, aunque hay otras que están bastante bien igual como la de Yorick o Kled) pero el resto, no ME agradan nada, les falta personalidad, especialmente a Lux, la cual pasa de ser una chica alegre en el audio original, a una chica que parece que se está por suicidar de lo desganada que suena su voz en el doblaje, ¿y lo de los memes? perdóname, pero el \"oblígame perro\" junto con un montón de modismos que han salido en los últimos 2 años me dan muchito asco que quieres que te diga, no puedo imaginarme a alguien decir eso sin que se me ponga la cara roja de verguenza ajena, es como escuchar a Lonrot...\n\nPero bueno, a lo que quiero llegar es que el doblaje es algo MUY subjetivo, a mi personalmente me desagrada, creo que el castellano incluso es mejor que el latino, pero como dije, son gustos personales, es como con la música, no puedes decir que algo es mejor que otro, yo detesto el death metal, y muchísima gente me sepultaría por decir esto xD.\n\n2-Creo que deberías hechar un vistazo a las comunidades americanas y chinas en esto de los fan-arts... en serio, no solo en LoL, en todo, son muy superiores...\n\n3-Nunca vi los videos de Actualizando, así que no puedo opinar al respecto.\n\n{{champion:202}}-Aquí si que te columpiaste darling, la skin de Pantheon panadero se venía pidiendo desde que el campeón se creó junto con su diálogo, es decir, 2 temporadas antes de que incluso se pensara en crear un servidor de LATAM, y la de Swain fue una skin que había sido anunciada en la s4-5 o por ahí, pero nunca fue lanzada, y luego con los años la sacaron, se había convertido en un meme ya, lo mismo le pasó a Renekton tierra calcinada y la segunda skin de Zac. Es más o menos como lo que pasa ahora con el Rework de Ryze, y no, LATAM no tuvo nada que ver con esto.\n\n5-Y... ¿Cómo es esto de la JG? En serio, ¿cómo? xD\n\nMe van a llenar de negativos por lo del doblaje, lo sé, y este es otro factor del por qué la gente se queja de la comunidad, no aceptan que otros tengan opiniones diferentes :p\n\nSee ya{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Yanx99","date":"2018-10-20T20:44:39.201+0000","up_votes":1,"down_votes":1,"body":"Si no te gusta el doblaje cambialo, saslu98","replies":[{"poster":"CamaleonaBugeada","date":"2018-10-21T11:22:04.796+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Yanx99,realm=LAS,application-id=v7qsfXsE,discussion-id=94Gz4saB,comment-id=00020000,timestamp=2018-10-20T20:44:39.201+0000)\n>\n> Si no te gusta el doblaje cambialo, saslu98\n\nLo cambié hace años :p, es solo que cuando formateé la pc (un par de veces) al re-instalar el LoL, se me venía en latino, y como me daba paja, jugaba un par de días con latino, hasta que me hartaba y lo cambiaba.","replies":[]}]}]},{"poster":"Paradisco","date":"2018-10-20T18:19:31.656+0000","up_votes":2,"down_votes":1,"body":"Todo bien con las, pero estás exagerando (por no decir mintiendo) con esos \"logros\".\nQuiero decir, hay muchas referencias a memes, al menos en voces en inglés, también hay muchos más animadores de otras regiones, como por ejemplo el del Helmer bro, el de lol animated, pantheon panadero, hay un post en Reddit del 2013  en qué hablan de panteón panadero, no sé quién de las decís que implementa ese skin, y por último por favor hermano, el concepto de jungla existe desde el mismísimo warcraft, quien te dijo que el server de las inventó la jungla???","replies":[]},{"poster":"HYG Demmir","date":"2018-10-21T03:42:04.788+0000","up_votes":1,"down_votes":0,"body":"LAS es un asco y tenes que aceptarlo. Somos la comunidad mas flamer y toxica que existe","replies":[]},{"poster":"Zardoxd","date":"2018-10-20T21:30:10.211+0000","up_votes":1,"down_votes":0,"body":"Hay un poco de post en tu ~~crap~~ humo..\n\nPD: No me explico como este post tuvo más de 5 positivos .-.","replies":[]},{"poster":"Bud Dicec","date":"2018-10-20T21:17:54.130+0000","up_votes":1,"down_votes":0,"body":"Se quejan de LAS y la mayoria nunca salio de este servidor. Y eso de los skines y pancha y no se que no importa. No tiene nada que ver. A mi no me interesa el cosplay. Me interesa que suba el nivel de los jugadores.","replies":[]},{"poster":"Shulys","date":"2018-10-20T21:08:25.953+0000","up_votes":1,"down_votes":0,"body":"Falta la buena gente con la que te encuentras y esos momentos divertidos que tienes incluso con el team enemigo.\n\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Fawaris","date":"2018-10-20T17:57:01.377+0000","up_votes":1,"down_votes":0,"body":"F","replies":[]},{"poster":"Ulphurus","date":"2018-10-20T17:42:52.965+0000","up_votes":1,"down_votes":0,"body":"F","replies":[]},{"poster":"VikingoATR","date":"2018-10-20T20:31:15.989+0000","up_votes":1,"down_votes":1,"body":"en las creamos y lincensiamos x las dudas el te: vas de wea pinche etc...","replies":[]}]}