{"poster":"SilentRado","date":"2015-05-26T04:27:59.683+0000","title":"Normal VS Creador de Equipos (Votación)","subforum":"Off-topic y temas personales","up_votes":1,"down_votes":0,"body":"Buenas Noches, me gustar&iacute;a saber a trav&eacute;s de una votaci&oacute;n cual de los modos usan mas seguido? &uacute;ltimamente no sale cola para TB que sean menores a 10-20 minutos y pues me agarr&oacute; curiosidad por saber si la comunidad lo sigue usando o no y sus correspondientes razones obviamente.\r\n\r\nPues mas que nada es eso nomas,\r\nSaludos ^^","replies":[{"poster":"Zaratrustha","date":"2015-05-26T05:18:27.933+0000","up_votes":3,"down_votes":0,"body":"el creador de equipos es lo mejor por 3 razones\n1) Vas la linea que queres jugar y no se pelea\n2) Si hay un flammerino lo kickeas\n3) Podes aceptar los champs que quieras en tu team","replies":[{"poster":"PabloBad","date":"2015-05-26T11:18:20.799+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Zaratrustha,realm=LAS,application-id=J8qpiO2I,discussion-id=mmZtHsAW,comment-id=0000,timestamp=2015-05-26T05:18:27.933+0000)\n>\n> el creador de equipos es lo mejor por 3 razones\n> 1) Vas la linea que queres jugar y no se pelea\n> 2) Si hay un flammerino lo kickeas\n> 3) Podes aceptar los champs que quieras en tu team\n\nTiene razón, pero ahora las cosas que hacen que la cola se más larga, no son la falta de jugadores, sino el exceso de filtros para entrar numero:\n1) Vas la linea que queres jugar y no se pelea (VAMOS TODOS MID!!! 20 min para que aparezca un soporte por voluntad)\n2) Si hay un flammerino lo kickeas (Soy el capitán y kickeo al que quiero porque me siento DIOS!!!!!)\n3) Podes aceptar los champs que quieras en tu team (Sivir adc? Hace mucho que no la veo, chau te fuiste. Porque? porque soy DIOS!) \n\nLamentablemente el TB no funciona, ni funcionará. \n\nSaludos.","replies":[{"poster":"SilentRado","date":"2015-05-26T20:27:07.480+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PabloBad,realm=LAS,application-id=J8qpiO2I,discussion-id=mmZtHsAW,comment-id=00000000,timestamp=2015-05-26T11:18:20.799+0000)\n>\n> Tiene razón, pero ahora las cosas que hacen que la cola se más larga, no son la falta de jugadores, sino el exceso de filtros para entrar numero:\n> 1) Vas la linea que queres jugar y no se pelea (VAMOS TODOS MID!!! 20 min para que aparezca un soporte por voluntad)\n> 2) Si hay un flammerino lo kickeas (Soy el capitán y kickeo al que quiero porque me siento DIOS!!!!!)\n> 3) Podes aceptar los champs que quieras en tu team (Sivir adc? Hace mucho que no la veo, chau te fuiste. Porque? porque soy DIOS!) \n> \n> Lamentablemente el TB no funciona, ni funcionará. \n> \n> Saludos.\n\nAhora que lo mencionas yo quería probar Quinn Top como un personaje para situaciones especiales y lamentablemente en el Creador estuve mas de 40 minutos porque nadie me aceptaba, al final tuve que empezar a usar otros Top mas tanques tipo Dr. Mundo o cosas asi.\n\nTal vez por ese \"abuso de poder\" es el motivo por el cual Riot no saca la cola para normales... o al menos eso me parece.\n\nPD: Es chistoso porque en el anuncio del Creador se muestran picks poco convencionales como Leona Jungla o Teemo/Ezreal Mid (No recuerdo bien) justamente para hacer referencia a que probemos lineas nuevas y nuevas composiciones.","replies":[]},{"poster":"Esti","date":"2015-05-26T19:56:41.020+0000","up_votes":1,"down_votes":0,"body":"Porque soy DIOS XDDDDDD","replies":[]}]}]},{"poster":"Nunca Pierdo","date":"2015-05-26T12:17:18.000+0000","up_votes":2,"down_votes":0,"body":"el creador de equipos es mejor, deberian eliminar las normal normales y dejar solo el creador de equipos","replies":[]},{"poster":"SilentRado","date":"2015-05-27T01:06:35.247+0000","up_votes":1,"down_votes":0,"body":"Pues si, supongo que tienes razón... será algo de este servidor nomas? o tal vez muchos servidores tienen este \"problema\" de que nadie quiere tener el supuesto rol \"pasivo\" del equipo?\n\nSería divertido intentar cambiar el meta y poner no se, luchadores como Supports... hace un par de días jugué acompañado de una Riven Support (Llevaba cara de la montaña y los wards) y hace semanas un amigo mio probó Xin Zhao Support tambien, considerando que Nautilus antes era únicamente Jungler y ahora lo usan de Support tal vez se puede cambiar eso, obviamente no es recomendable pero experimentando a veces salen cosas interesantes.\n\nVa digo eso como una posible \"solución\" porque sino la verdad no se como pueden hacer para que la gente juegue mas support.... lo cual haría que el TB sea mas rápido. Capaz ¿misiones semanales podría ser también otra alternativa?","replies":[]},{"poster":"Maldichion","date":"2015-05-26T22:50:22.738+0000","up_votes":1,"down_votes":0,"body":"Yo uso casi siempre el TB, pero es cierto que es mucho mas lento que las Normales...\nY eso es debido a que todo quieren KILLS, absolutamente todos... Por eso el rol de supp es tan menospreciado y nadie lo quiere jugar...\nSi le va mal al Adc, es culpa de supp... Si el Jg gankea y muere, es culpa del supp por no ayudar o no tener bien wardeado...\nEn este server nadie hace mea culpa, todos son PRO y el resto noobs... Entonces que pasa? Todos quieren usar champs que carreen partidas, obviamente con un supp esto es dificil, entonces estas 2 dias esperando que entre un supp...\nAunque hay otros roles a veces difíciles de encontrar, como el Jg en ocaciones...\nInclusive en las normales, si esperas a que todos canten linea, tenes altisimas chances de que quede solo supp, porque te repito, TODOS QUIEREN KILLS...\nLa gente cuando se fedea siente que jugo bien y que instantáneamente se convirtió en Faker o Bjersen, cuando fedearte no necesariamente quiere decir que jugaste bien, si no que el contrario tambien puede ser malisimo o estar probando un champ... \n\nMe fui... Saludos!","replies":[]},{"poster":"SilentRado","date":"2015-05-26T09:01:23.583+0000","up_votes":1,"down_votes":0,"body":"Me parece bien y tienes razón... pero justamente, por que sale mas rápido la cola de Normal que la de TB? por que será que se me hace que hay mas gente jugando normales? Será por la poca cantidad de soportes o hay otro motivo aparte?","replies":[{"poster":"Desaroll","date":"2015-05-26T13:48:20.444+0000","up_votes":1,"down_votes":0,"body":"La gente juega normales por que prefieren hacer que uno vaya lineas que no le gustan/no saben a esperar 5 minutos mas a que todos vayan la linea que quieren.\n\nDespués se quejan de flammers y demás.\n\nSuerte.","replies":[]}]},{"poster":"rokushoger","date":"2015-05-26T11:15:39.190+0000","up_votes":1,"down_votes":0,"body":"No se puede presentar como contra del creador el tiempo de partida, porque eso sucede porque no mucha gente lo usa, todos se van a normal (parecen masoquistas). Yo voto creador por lo que dijo zaratrustha, y le agrego que la gente que tiene paciencia para esperar el tiempo que demora el creador suele (ojo no es un 100% obvio) menos flamer que la mayoría en normal.","replies":[]},{"poster":"Cyclosarin","date":"2015-05-26T14:55:48.372+0000","up_votes":0,"down_votes":0,"body":"Yo prefiero en la teoría el creador de equipos, pero en la práctica noto que, en general, el creador lo usan para probar campeones casi siempre (cuando veo que la mayoría son free champs, busco otro equipo) y en normal es menos comun probar campeones, porque a veces te toca ir a posiciones que no esperabas. Dicho esto, mi record en creador de equipos es casi mitad victorias, algo asi como 110-100, mientras que en  normal es muuuuy superior mis victorias a mis derrotas, pero mucho. Mi única teoria es esa, en normal se juega para mejorar un rol/champ, en creador, para probar campeones/roles.\n\nPero, repito, teoricamente me gustaría y defiendo la idea del creador de equipos, coincido con las ventajas que les señalan.","replies":[]}]}