{"poster":"Blind Valentine","date":"2018-04-28T09:10:44.067+0000","title":"Euer ernst riot?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":6,"body":"Was soll die schei&szlig;e riot wieso macht ihr die ganze zeit so ein m&uuml;ll?!\r\nIhr bringt neue champs raus oder reworks welche einfach dumm wie schei&szlig;e sind was denkt ihr euch dabei??? Testet ihr die &uuml;berhaupt selbst???\r\nDer spielspa&szlig; geht einfach komplett verloren bei so einer schei&szlig;e wenn man gegen neue champs spielt die dich einfach oneshoten ohne &uuml;berhaupt Irgendetwas an skill zu zeigen.\r\nWisst ihr &uuml;berhaupt noch was SKILL hei&szlig;t??? Oder habt ihr nurnoch euer schei&szlig; geld im kopf jetzt mal im ernst sch&auml;mt euch hoffentlich zerbricht das spiel durch die schei&szlig;e.\r\nSeason 4 war alles besser jungler mussten noch farmen um was machen zu k&ouml;nnen konnten nicht die ganze zeit rumganken wie affen.\r\nNeue champs waren nicht so broken...\r\nLeague of Legends macht einfach kein spa&szlig; mehr wenn ein neuer champ oder ein rework rauskommt einfach nur schei&szlig;e\r\nWir wissen alle ihr nerft die champs danach eh *Zoe* Dann spielt die keine sau mehr weil der champ einfach 0 spa&szlig; macht.. er wurde nur gespielt weil er broken war und wieso war er broken? Ja klar weil riot geld braucht damit leute den schei&szlig; champ mit rp kaufen WOW Riot macht ihr super!\r\nDie neu/alte leblanc also das rework... sie macht lvl 3 q dann w und e ignite du bist tot du kannst nichts tun sie kann so hart zur&uuml;ckfallen wie sie will sie wird dich oneshoten oder springt danach einfach wieder mit W weg.\r\nFazit: Riot ihr verkackt das spiel einfach sch&auml;mt euch daf&uuml;r das ihr so geld gierig seit\r\n\r\n {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Enderized","date":"2018-04-28T10:05:58.021+0000","up_votes":3,"down_votes":2,"body":"selten so einen \"guten\" Rito post gelesen! ich danke dir für diesen genüsslichen Start in meinen Tag","replies":[]},{"poster":"Izaya Kumiho","date":"2018-04-28T10:04:15.780+0000","up_votes":3,"down_votes":2,"body":">Wisst ihr überhaupt noch was SKILL heißt?\n\n_\"Ghostcrawler\"_\n\nanyway champions werden gereworked um mehr \"abwechslung\" ins spiel zu bringen, oder alles up-to-date zu halten. Das ist normal D:","replies":[]},{"poster":"DrYatty","date":"2018-04-28T10:36:27.457+0000","up_votes":1,"down_votes":0,"body":"> Ihr bringt neue champs raus oder reworks welche einfach dumm wie scheiße sind was denkt ihr euch dabei??? Testet ihr die überhaupt selbst???\n\nNatürlich werden Champions getestet und zwar auf dem PBE, da kannst du sogar mithelfen und Feedback an die Entwickler geben. \n\n--> https://pbesignup.na.leagueoflegends.com/de_DE/pbe\n\n> Der spielspaß geht einfach komplett verloren bei so einer scheiße wenn man gegen neue champs spielt die dich einfach oneshoten ohne überhaupt Irgendetwas an skill zu zeigen.\n\nDu kannst diese Champions selber spielen oder sogar in manchen Modi bannen. Ich selbst bin ein sehr großer Fan von Thresh und Annie, viele sagen das Annie ein Noobchampion ist weil man mit ihr nicht wirklich Lasthitten muss oder irgendwelche Kombos beherrschen, das mit dem Lasthitten stimmt, aber deswegen spiele ich Annie da ich mit Magiern in der Midlane nicht gut unterwegs bin im Lasthitten, nur das man keine Kombos beherrschen muss nehmen die meisten dann zurück wenn sie selber Annie spielen und merken \"Verdammt, ich muss doch was können\". (Zwar nicht viel, aber Skill bleibt Skill egal auf welchem Niveau)\n\n > Wisst ihr überhaupt noch was SKILL heißt??? Oder habt ihr nurnoch euer scheiß geld im kopf jetzt mal im ernst schämt euch hoffentlich zerbricht das spiel durch die scheiße.\n\nSelbstverständlich spielt Geld eine Rolle, aber dadurch wird Riot nicht unverschämt und macht das Spiel Pay2Win. Ich weiß was Skill bedeutet, weißt du das denn auch? :)\n\n> Season 4 war alles besser jungler mussten noch farmen um was machen zu können konnten nicht die ganze zeit rumganken wie affen.\n\nGenau, Season 4 konnte der Jungler nur Farmen und konnte sich dadurch relativ einfach einen Vorteil aufbauen, Season 8 muss der Jungler den Lanes helfen damit sie sich einen Vorteil erkämpfen können, sowas nennt man Teamspiel. \n\n> Wir wissen alle ihr nerft die champs danach eh Zoe Dann spielt die keine sau mehr weil der champ einfach 0 spaß macht.. er wurde nur gespielt weil er broken war und wieso war er broken? Ja klar weil riot geld braucht damit leute den scheiß champ mit rp kaufen WOW Riot macht ihr super!\n\nNatürlich werden die Champions generft wenn sie zu stark sind, wäre doch auch blöd wenn Riot dagegen nichts unternehmen würde, oder? Aber wie du schon als Beispiel Zoe genommen hast, sie wird weiterhin gespielt nur nicht mehr so oft, weil sie halt nicht mehr so stark ist wie vorher. Ich muss zugeben, ich kenne niemanden der sich Champions mit RP gekauft hat, und wenn.. ist es weiterhin die Entscheidung des Spielers ob er nun RP für einen Champion ausgibt oder nicht, niemand wird gezwungen!?\n\n> Die neu/alte leblanc also das rework... sie macht lvl 3 q dann w und e ignite du bist tot du kannst nichts tun sie kann so hart zurückfallen wie sie will sie wird dich oneshoten oder springt danach einfach wieder mit W weg.\n\nDas ist mit fast jedem Champion so, stell dir mal vor du spielst deinen Lieblingschampion auf deiner Lieblingslane und stehst 0-5, weil der Gegnerische Jungler dich immer wieder geganked hat, aus deiner Perspektive könntest du jetzt AFK gehen weil du ja keine Chance mehr haben solltest um zurückzukommen, durch Hilfe/Farm etc. ? Gegen LB brauchst du einen CC und ein wenig Schaden, oder Teammates die schnellen Schaden anrichten können. LB ist ein Assassine = richtet extrem viel Schaden in kurzer Zeit an, stirb aber genauso schnell wenn man weiß wie.","replies":[{"poster":"SSI CptHaunted","date":"2018-04-28T12:31:51.648+0000","up_votes":2,"down_votes":1,"body":"Die Level 3 Combo ist bei vielen Assassinen schon ziemlich krass, wüsste nicht wer mit Level 3 genau so viel Schaden anrichten würde. Außerdem haben sie den großen Vorteil, dass Mobility abgesehen von Cooldowns und Manakosten (wenn vorhanden) nicht skalen kann bzw muss.\n\nWas ich an Assassinen nicht leiden kann, ist dass sie entweder komplett eskalieren und jeden Squishy oneshotten wie sie lustig sind oder komplett nutzlos werden wenn sie schlecht gespielt werden. Dazwischen gibts kaum was. Zudem ist Mobility gerade für Champions die sie nicht haben extrem frustrierend, da es ziemlich wenig mit Skill zu tun hat einfach über/durch eine Wand zu hüpfen und dadurch zu entkommen.\n\nAbgesehen davon hilft dir kein Schaden gegen einen Assassinen. CC hilft dir auch nur wenn du nicht geoneshottet wirst, da genug Assassinen die Fähigkeit haben zwischenzeitlich unsichtbar/untargetable zu werden und somit mehr oder weniger sicher den first strike haben. Was wirklich gegen Assassinen hilft sind tankyness und Schilde, damit man den Burst überlebt und zurückschlagen kann wenn er seine Kombo verballert hat.","replies":[]},{"poster":"Blind Valentine","date":"2018-04-28T10:52:01.535+0000","up_votes":1,"down_votes":0,"body":"Das mit dem PBE auf dem PBE müsste riot eigentlich doch sehen das die champions einfach zu stark sind (was sie ja auch sind) Wieso tun sie dann dagegen nichts und nerven den champ nicht bevor er auf die live-server kommt?","replies":[{"poster":"SSI CptHaunted","date":"2018-04-28T12:16:52.840+0000","up_votes":2,"down_votes":1,"body":"Genau das ist die Frage. Man hat einen \"Testserver\" und doch schaffen es Inhalte auf die Live-Server die dann sogar noch gehotfixed werden müssen. Wenn selbst sowas auf einem Testserver nicht auffällt erfüllt er nicht wirklich seinen Zweck.","replies":[{"poster":"Megamaexx","date":"2018-04-28T13:04:14.660+0000","up_votes":1,"down_votes":0,"body":"Ich bezweifle mal, dass sie den Testserver nutzen, um beim Balancing nachzubessern. Den Programmierern hinter den Champions kommt es in erster Linie eh erst mal darauf an, dass die Funktionalität gegeben ist, also keine Bugs oder Abstürze verursacht werden. Da die Werte den Champions nicht fest einprogrammiert werden, haben sie auch keinen Einfluss darauf, wie viel Schaden gemacht wird.","replies":[]}]}]}]},{"poster":"Pfirsich93","date":"2018-04-28T10:02:15.622+0000","up_votes":2,"down_votes":1,"body":"was ein hampelmann","replies":[]},{"poster":"Megamaexx","date":"2018-04-28T09:51:08.519+0000","up_votes":2,"down_votes":1,"body":"Hast du echt 4 Jahre gebraucht, um für dich festzustellen, dass dir das Spiel nicht mehr guttut?\nÜbrigens, währen sie so geldgeil wie du denkst, dann würden Champions kein Rework erhalten. Dadurch bekommt man nämlich keine Einnahmen.","replies":[{"poster":"Blind Valentine","date":"2018-04-28T09:54:17.294+0000","up_votes":1,"down_votes":1,"body":"Na klar bekommen die dadurch einnahmen die jenigen die den champ noch nicht haben ziehen dann eher den champ in betracht von einem kauf dadurch bekommen sie mehr geld","replies":[{"poster":"Megamaexx","date":"2018-04-28T14:03:02.078+0000","up_votes":1,"down_votes":0,"body":"Sie hätten stattdessen auch einfach einen neuen Champion raushauen können. Der wäre dann in der teuersten Preisklasse gelandet und den hätte dann noch keiner.","replies":[{"poster":"Blind Valentine","date":"2018-04-28T14:14:28.769+0000","up_votes":1,"down_votes":0,"body":"Das ist ja aber dann wieder eine andere sache. ^^ Natürlich würde das mehr profit bringen","replies":[]}]}]}]},{"poster":"Ma1days","date":"2018-04-28T09:32:01.986+0000","up_votes":2,"down_votes":1,"body":"lol","replies":[]},{"poster":"OT Riku","date":"2018-04-28T09:26:48.960+0000","up_votes":2,"down_votes":1,"body":"Lustig","replies":[]}]}