{"poster":"50CaliberHecate","date":"2020-02-28T00:47:29.674+0000","title":"Can a Rioter explain why Jinx's traps were made so god damn useless?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"Exactly what the title says, I want to know. \r\n\r\nWhen a Vayne chases me down lane, when an Ashe can just auto you to death with her crutch of a passive, when Caitlyn can insta-proc her traps under an enemy, when a Kai'sa just ults across the entire map, when a Jhin just chases you down with his passive simply from autoing... the one thing I would hope to count on for an ADC with absolutely no mobility... is to be able to have SOME SORT OF ESCAPE. I throw traps out and instead of chomping down on the enemy, they laugh hysterically at what a failure they are.\r\n\r\n I don't want to hear anything about \"it's to balance her\" because let's be honest, her extended Q range and W are what is wrong with her. \r\nThis spell is the reason I don't main her, because why worry about some stupid traps when there are WAY more reliable spells on other adcs.","replies":[{"poster":"muted team chat","date":"2020-02-28T02:26:37.325+0000","up_votes":6,"down_votes":0,"body":"Why should she have an escape? There SHOULD be some weakness to a champ.","replies":[]},{"poster":"iiGazeii","date":"2020-02-28T01:53:57.975+0000","up_votes":5,"down_votes":0,"body":"Because the rest of her kit is bananas?\n\nJinx's designer loves, loves, _loves_ to add weak, situational abilities on long delays to open up more power elsewhere in the kit (e.g., Jhin E, Senna E, Ekko W).\n\nJinx is borderline busted and can dominate a game if she gets on a roll. She needs to be immobile without good self-peel to allow for that. Rather than give her zero self-peel, she was given good self-peel that takes planning and positioning to make use of.","replies":[]},{"poster":"Pumpedhero","date":"2020-02-28T01:17:14.305+0000","up_votes":4,"down_votes":0,"body":"\"Caitlyn can insta-proc her traps under an enemy\" is false caitlyns trap probably takes a bit longer to activate than jinx's.and ADC with no mobility IS NOT DESIGNED TO HAVE AN ESCAPE. That's their counterplay.. You seem to have champion design mentality backwards. You have to lead your traps.. they are not instant deploy.. same as caitlyns.. hers isnt instantly deploy either. Jinx traps also completely lock off a 3 character model space within .5 seconds whereas caits is 1 model per trap practically unless spaced in which case then are useless for zoning a tight zone as u can walk through them.","replies":[{"poster":"IainG10","date":"2020-02-28T04:20:16.188+0000","up_votes":2,"down_votes":0,"body":"Arming times:\nCait W: 1s\nJinx E  : 0.7s\n\nCait's traps do last up to 50s though, and she can have up top 5","replies":[]}]},{"poster":"DeathBurst","date":"2020-02-28T10:50:03.182+0000","up_votes":3,"down_votes":0,"body":"> when Caitlyn can insta-proc her traps under an enemy \n\nWhat? Cait traps have a 1 second delay. Jinx have 0.7 seconds, plus they are larger and interrupt dashes.","replies":[]},{"poster":"Jamaree","date":"2020-02-28T00:54:45.213+0000","up_votes":3,"down_votes":0,"body":"One, they have always had a delay, two, why are you comparing her W to anything except other trap moves, three, no Caitlyn can't insta proc her traps, not sure how long the arm time is exactly, but they do have an arm time, four, Jinx literally has a high win rate then every other ADC you just mentioned. She gets to cruise around being good because everyone else complains about other champions as she skirts the line.","replies":[]},{"poster":"Smyrage","date":"2020-02-28T10:23:19.820+0000","up_votes":2,"down_votes":0,"body":"Jinx' E is actually pretty neat in many situations. First of all the most obvious is that it can chain CC if your support has CC. It can't prevent escapes. Second it is good for cutting off others chasing you. The last use of it is kind of novel and it requires skill, but you can technically 1v1 even Assassins with it, because it is an efficient zoning tool. It forces your attacker to go around it, giving you more opportunities to deal damage to them. I remember taking out Zeds and Kha'zixes with it.","replies":[]},{"poster":"LegitBusinessman","date":"2020-02-28T01:03:54.981+0000","up_votes":2,"down_votes":1,"body":"Jinx OTP here.\n\nThe traps are listed as 'stopping movement abilities' but this is flat out not true on so many abilities, and im not referring to Unstoppable abilities either.  That stuff tilts me to no end.  Diana E is an example of one where the dash ignores the traps.","replies":[{"poster":"The thigh guy","date":"2020-02-28T02:29:33.474+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=LegitBusinessman,realm=NA,application-id=3ErqAdtq,discussion-id=x4F7OBab,comment-id=0002,timestamp=2020-02-28T01:03:54.981+0000)\n>\n> Jinx OTP here.\n> \n> The traps are listed as 'stopping movement abilities' but this is flat out not true on so many abilities, and im not referring to Unstoppable abilities either.  That stuff tilts me to no end.  Diana E is an example of one where the dash ignores the traps.\n\nWelcome to league. They abilities flat out lie half the time.","replies":[]}]},{"poster":"MrFawknSunshine","date":"2020-02-28T00:54:35.878+0000","up_votes":2,"down_votes":0,"body":"ashe's crutch of a passive ? LMAO \n\nshe only has 3 abilities that does damage, and oh one of those , her ult scales with AP which means she gets no scaling on it for AD/AS/CRIT","replies":[{"poster":"IainG10","date":"2020-02-28T04:21:29.641+0000","up_votes":1,"down_votes":1,"body":"Only 2 abilities strictly do damage; Q is just an AS amp, like Tristana's (except not free).","replies":[{"poster":"SirHydro","date":"2020-02-29T07:16:44.791+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IainG10,realm=EUW,application-id=3ErqAdtq,discussion-id=x4F7OBab,comment-id=00000000,timestamp=2020-02-28T04:21:29.641+0000)\n>\n> Only 2 abilities strictly do damage; Q is just an AS amp, like Tristana's (except not free).\n\nJinx's attack speed ramp is free, as it costs no mana and has no cooldown.\n\nTristana's q has no mana and has a cooldown.","replies":[]}]}]},{"poster":"SirHydro","date":"2020-02-29T07:14:15.111+0000","up_votes":1,"down_votes":0,"body":"Cait's traps are not instant.\n\nKai'sa's ult is not globl.\n\nThread disregarded for hyperbole.","replies":[]},{"poster":"Crispy0Snake","date":"2020-02-28T07:51:39.303+0000","up_votes":1,"down_votes":0,"body":"They're more to chain cc or wall off an enemy's path to you\n\nYou're not meant to just throw them at an enemy and insta cc them","replies":[{"poster":"True Garen","date":"2020-02-28T17:18:20.024+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Crispy0Snake,realm=EUW,application-id=3ErqAdtq,discussion-id=x4F7OBab,comment-id=0008,timestamp=2020-02-28T07:51:39.303+0000)\n>\n> They're more to chain cc or wall off an enemy's path to you\n> \n> You're not meant to just throw them at an enemy and insta cc them\n\nWhat he said. Kind of analogous to Jinn traps. Not intended to be a strong hindrance or damage.","replies":[]}]},{"poster":"Posui Gart","date":"2020-02-28T11:09:41.981+0000","up_votes":1,"down_votes":0,"body":"> the one thing I would hope to count on for an ADC with absolutely no mobility... is to be able to have SOME SORT OF ESCAPE\n\nNo. Jinx is just as strong in terms of chasing people with her passive, W and all the movespeed boosts ADCs have. She is only weak when she has to escape, so she should be weak at escaping. If you want an instant AOE root, pick another champion","replies":[]},{"poster":"kda akali","date":"2020-02-28T07:27:14.719+0000","up_votes":1,"down_votes":0,"body":"To give her more of a weakness to assassins and anyone who can reach her. It raises her skill cap by making her be able to do better with better position and rewards good Jinx players for using the E correctly.","replies":[]},{"poster":"KFCeytron","date":"2020-02-28T06:10:07.896+0000","up_votes":1,"down_votes":0,"body":"Jinx has absolutely no mobility until she gets a champion or turret takedown, and then she is zoom zoom pew pew.","replies":[]}]}