{"poster":"Frothy Mushroom","date":"2016-11-01T02:09:29.083+0000","title":"Teams of 4 Issue","subforum":"Player Behavior","up_votes":2,"down_votes":1,"body":"So what, EXACTLY are solo queue players supposed to do when they get into a lobby of four people playing together and one of them is just a total piece of work?\r\n\r\nI JUST got into a game seconds ago and I asked &quot;You playing annie top?&quot;, and she said &quot;Just STFU and pick&quot;. Then I began getting harassed and berated by the rest of them, a couple of them following suit and telling me to &quot;STFU&quot; for asking a simple question.\r\n\r\nI haven&#039;t done anything wrong and I&#039;m probably going to get 4 reports that aren&#039;t warranted, but what could be done about THEM!?","replies":[{"poster":"Limmie","date":"2016-11-01T08:35:49.020+0000","up_votes":2,"down_votes":0,"body":"4 man premades are always awful to play with. People won't communicate with you, peel for you, and everything bad that happens is going to be your fault. It's always a 1v9. Good riddance dynamic queue.\n\nPeople already mentioned, but don't worry about the 4 reports thing. Accounts are flagged based on the number of games reported, not on reports per game. 1 report is as good (or as bad) as 9.","replies":[{"poster":"Frothy Mushroom","date":"2016-11-01T19:18:46.589+0000","up_votes":1,"down_votes":0,"body":"Well I hope that's true.","replies":[]}]},{"poster":"Miror B","date":"2016-11-01T03:06:19.913+0000","up_votes":2,"down_votes":0,"body":"See, when I get stuck in that kind of game I try to pick the cheesiest thing possible so that at the very least I can have a fun time. Playing a mid viktor game with 4 other people who are acting like douches: what basically happens whenever I play him anyways. Playing a mid tahm kench/maokai game however with 4 people who are going to harass me anyways: now the fun begins.","replies":[]},{"poster":"ShinkoMinori","date":"2016-11-01T03:19:31.162+0000","up_votes":1,"down_votes":4,"body":"Was it so hard to STFU and pick? They obviously don't want to talk to you why would you want to talk to them?","replies":[{"poster":"Frothy Mushroom","date":"2016-11-01T03:47:32.256+0000","up_votes":1,"down_votes":0,"body":"Would it have been so hard to be cordial and kind to a fellow fan of league of legends? I don't go into ranked games and say, \"EVERYONE STFU. I DON'T WANT TO TALK TO YOU BECAUSE I'LL PROBABLY JUST HATE YOU IF YOU SAY SOMETHING I DON'T LIKE.\"\n\nI, nor anyone else, should have to tolerate abusive groups/teams of players who retain power because they have a vote/report control. That's like saying it's okay to put a bunch of terrorists in the senate and see how the voting goes. Hope they're all level headed, right? I also hope I don't get verbally abused, or shot. That would be not very fun at all.","replies":[{"poster":"ShinkoMinori","date":"2016-11-01T05:13:27.734+0000","up_votes":1,"down_votes":2,"body":"It's not abusive, its just respect their desire to just don't listen nor talk to you. You could either whine like a pussy or accept it and play. You can't force others to act like you want them to, if they don't fucking want to talk to you then respect that.","replies":[{"poster":"Frothy Mushroom","date":"2016-11-01T19:17:42.264+0000","up_votes":1,"down_votes":0,"body":"Wrong. It IS abusive because \"STFU\" means \"Shut the fuck up\", which isn't a warranted or acceptable way to speak to someone at all. If you don't want to speak to another player you could just as easily say \"Shhh. I don't want to talk to you.\", or, ya know, not say anything at all, but that makes wayyyyy too much sense, right?\n\nYea, sorry. I entirely disagree with you, and if someone chooses to treat you like garbage, well, I don't think you should have to shut up and take that, lol. \n\nThanks for your opinion though.","replies":[]}]}]}]},{"poster":"CrazyBear1987","date":"2016-11-01T02:38:08.578+0000","up_votes":1,"down_votes":0,"body":"About them? not your responsibility.\n\nAll you can do is dodge out and hope for better team.\n\nor\n\nStay, get beat on and report of 4 of them. Reporting without merit means nothing. RIOT will read the chat logs as see the whole story.\n\nThey will get their individual time for their behavior. You can also summit a support ticket on the game and hope it get reviewed, \n\naside from that, only time will tell.","replies":[{"poster":"Frothy Mushroom","date":"2016-11-01T02:44:53.029+0000","up_votes":1,"down_votes":0,"body":"Not necessarily. Half the time, if it goes to tribunal, people are just hitting \"Punish\" > \"Next\" > \"Punish\" > \"Next\".\n\nI don't get why people are allowed to just flock around and not get a reprimand for being generally vile. It's not like the other team is going to report them if they're not blowing up all chat all game long, and just my report on all four of them is going to do exactly ZERO. Not that the system is broken, but it certainly doesn't apply to this situation.","replies":[{"poster":"CrazyBear1987","date":"2016-11-01T02:51:52.386+0000","up_votes":1,"down_votes":0,"body":"True, the current system right now is not proactive enough to instantly resolve anything.\n\nThey may have gotten away with it for now.\n\nBut that kind of behavior will return and they will eventually be caught.\n\ntill then, take note of the time and day of when you played with them and avoid it.\n\nNot much really that we can do until they slip up and get banned themselves.","replies":[{"poster":"Frothy Mushroom","date":"2016-11-01T03:00:31.716+0000","up_votes":1,"down_votes":0,"body":"The system, as of right now, provides a higher level of protection to toxic players the more teammates they acquire for games. It's pretty excruciating assuming you're solo and get pitched into the pit with four people you don't know who, if you say one thing they don't like, you become the target of abuse. It doesn't even have to be that bad.","replies":[{"poster":"CrazyBear1987","date":"2016-11-01T03:10:45.996+0000","up_votes":1,"down_votes":0,"body":"We can only hope that the new client will have more flexibility in finding and punishing abusive players.\n\n{{sticker:zombie-nunu-tears}}","replies":[]}]}]}]}]}]}