{"poster":"SleepyLionCub","date":"2015-03-21T01:56:04.543+0000","title":"\"Lol its just a game who cares\"","subforum":"Gameplay","up_votes":23,"down_votes":4,"body":"him:\"lol its just a game who cares\"\r\n\r\nme: \"well you shouldnt play ranked if you dont care. its for people who care\"\r\n\r\nhim:\"lol this is gold, calm down\"\r\n\r\n\r\n\r\n\r\n\r\nIm sorry im stuck in gold because of people like you. Can you like, stop playing ranked forever please?","replies":[{"poster":"BeatzBoyFTW","date":"2015-03-21T15:41:01.984+0000","up_votes":7,"down_votes":0,"body":"\"lol, it's just a game\"\n\n-the true memo of 90% of players who did nothing but feed.","replies":[{"poster":"FearEngineer","date":"2015-03-22T05:53:13.185+0000","up_votes":1,"down_votes":0,"body":"Watch out they'll nail you for verbal abuse mate lol","replies":[]},{"poster":"junglerboy16","date":"2015-03-21T22:19:50.315+0000","up_votes":1,"down_votes":0,"body":"Had a Nidalee on my team last match who was hard carrying and kept trying to surrender and suicide dive the enemy team because \"Ima plat 2 Smurf. We should let them kill us. I feel like trolling. Why won't you all surrender? This is just a game. Why so serious?\" etc. It was annoying because Even though I was having a brilliant game, we nearly threw the match because she kept trying to 1v1 people and KS and other stupid stuff. \n\nShe was 3 and 0 at 10 minutes in and had 21 kills by the end of the match, and had 3rd highest gold (19.1k) behind me (jungle Sion, 19.3k) and the enemy Jinx (19.6k). That is hardly the memo of a feeder.","replies":[]}]},{"poster":"redniwediS","date":"2015-03-21T02:21:07.158+0000","up_votes":7,"down_votes":2,"body":"Contrary to popular belief ranks don't show how good you are, they show your capability to climb the rank ladder.  You could easily be able to play and win against diamond players at your current rank, however if you're not good enough to climb that ladder you're at the rank you should have.\n\nBasically you're never stuck, you're either at the rank you're supposed to have or you're climbing/falling.","replies":[{"poster":"Thefriendlyorc","date":"2015-03-21T19:19:36.313+0000","up_votes":2,"down_votes":0,"body":"As a guy who commonly fights platinum/diamonds in normals and usually comes out on top, thank you, I usually dont have time to ranked ladder climb.","replies":[]}]},{"poster":"Vicvictorw","date":"2015-03-21T15:43:36.247+0000","up_votes":2,"down_votes":2,"body":"I don't understand the desire to climb past gold. That's when you get the maximum rewards for the season, and the amount of headache just isn't worth a new loading screen border that is more of an example of how patient/lucky you are than how skilled you are.","replies":[{"poster":"cuddlykitten4","date":"2015-03-21T16:59:14.191+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Vicvictorw,realm=NA,application-id=3ErqAdtq,discussion-id=QNg4Kpua,comment-id=000a,timestamp=2015-03-21T15:43:36.247+0000)\n>\n> I don't understand the desire to climb past gold. That's when you get the maximum rewards for the season, and the amount of headache just isn't worth a new loading screen border that is more of an example of how patient/lucky you are than how skilled you are.\n\nPatience and luck are both significantly underestimated attributes of a person.","replies":[]},{"poster":"Nucleophilic atk","date":"2015-03-21T22:21:41.282+0000","up_votes":1,"down_votes":0,"body":"I reached gold last season. I'm pretty sure people in plat were better than me, and not \"just lucky\".","replies":[]}]},{"poster":"DWT12345","date":"2015-03-21T02:21:21.359+0000","up_votes":3,"down_votes":0,"body":"that moment when somebody complains about being in gold\n\nyou know that like 20% of people are above silver right?","replies":[{"poster":"junglerboy16","date":"2015-03-21T22:20:35.520+0000","up_votes":1,"down_votes":0,"body":"And something like 60% of ranked players are bronze.","replies":[]}]},{"poster":"Kazaashi","date":"2015-03-21T15:35:41.172+0000","up_votes":2,"down_votes":2,"body":"The reason people say \"lol, its just a game\" is usually because they are interpreting what you are saying as rage or vitriol.  \n\nI play my best in Ranked when I remember that it is just a game.  Even if I loose this ranked game, even in a Promo series, I know that I can always queue up for a new one.\n\nDon't take Ranked too seriously or you'll put yourself on tilt.","replies":[{"poster":"Nucleophilic atk","date":"2015-03-21T15:37:34.303+0000","up_votes":2,"down_votes":0,"body":"What is tilt? I feel like people say \"you're on tilt\" when on a losing streak, which makes no sense. My play probably isn't the reason I'm on a losing streak.","replies":[{"poster":"Kazaashi","date":"2015-03-21T15:44:10.008+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Nucleophilic atk,realm=NA,application-id=3ErqAdtq,discussion-id=QNg4Kpua,comment-id=00070000,timestamp=2015-03-21T15:37:34.303+0000)\n>\n> What is tilt? I feel like people say \"you're on tilt\" when on a losing streak, which makes no sense. My play probably isn't the reason I'm on a losing streak.\n\nTilt is a poker term for a state of mental or emotional confusion or frustration in which a player adopts a less than optimal strategy, usually resulting in the player becoming over-aggressive. This term is closely associated with steam and some consider the terms equivalent, but 'steam' typically carries more anger and intensity.\n\nhttp://en.wikipedia.org/wiki/Tilt_(poker) --- Read it, Learn it, Know it, Gain 200-300 MMR.","replies":[{"poster":"Nucleophilic atk","date":"2015-03-21T16:09:31.073+0000","up_votes":2,"down_votes":0,"body":"See, being frustrated doesn't necessarily correlate to any of those things. Like, I can get extremely pissed at the 1/9/1 top lane, and still play my game. Just because I lose due to trolls doesn't mean I am on a losing streak because of \"tilt\" lol.","replies":[{"poster":"Kazaashi","date":"2015-03-21T16:18:30.342+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Nucleophilic atk,realm=NA,application-id=3ErqAdtq,discussion-id=QNg4Kpua,comment-id=0007000000000000,timestamp=2015-03-21T16:09:31.073+0000)\n>\n> See, being frustrated doesn't necessarily correlate to any of those things. Like, I can get extremely pissed at the 1/9/1 top lane, and still play my game. Just because I lose due to trolls doesn't mean I am on a losing streak because of \"tilt\" lol.\n\nTilt is a complex psycological phenomena.  My summery is a VERY basic explanation.\n\nThis is an older video by Gbay99 explaining tilt in relation to LoL, but the concepts still apply to this season:\n\nwww.youtube.com/watch?v=XxE8wTbYJs8\n\nEDIT: Here is a newer one that may help also:  www.youtube.com/watch?v=Vny-dT8dxQ","replies":[{"poster":"Nucleophilic atk","date":"2015-03-21T16:23:31.821+0000","up_votes":2,"down_votes":0,"body":"Yes, you keep posting examples of your emotions making you play worse. I will again say that isn't the case with a lot of players I see people saying are \"on tilt\". Every time someone loses a couple games in a row, \"awweee man you're on tilt\". No, I just went 10/1 but the team score was 11/35. Wasn't \"tilt\", but trolls.","replies":[{"poster":"Kazaashi","date":"2015-03-21T16:31:20.172+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Nucleophilic atk,realm=NA,application-id=3ErqAdtq,discussion-id=QNg4Kpua,comment-id=000700000000000000000000,timestamp=2015-03-21T16:23:31.821+0000)\n>\n> Yes, you keep posting examples of your emotions making you play worse. I will again say that isn't the case with a lot of players I see people saying are \"on tilt\". Every time someone loses a couple games in a row, \"awweee man you're on tilt\". No, I just went 10/1 but the team score was 11/35. Wasn't \"tilt\", but trolls.\n\nIt's not about individual games.  Tilt affects series' and that is all that matters in Ranked.\n\nThat \"troll\" game is one thing that will push you closer to tilt.  Tilt is not an obvious thing.  It can happening in the middle of a game, but the most insidious form of it sets in over time, causing you to lose multiple games or not play to your full potential.","replies":[{"poster":"Nucleophilic atk","date":"2015-03-21T22:22:45.400+0000","up_votes":2,"down_votes":0,"body":"Nope, troll in my game that caused me to lose. I played well. Next game, I played well and the troll caused us to lose again.","replies":[]},{"poster":"Kazaashi","date":"2015-03-21T16:36:45.783+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Kazaashi,realm=NA,application-id=3ErqAdtq,discussion-id=QNg4Kpua,comment-id=0007000000000000000000000000,timestamp=2015-03-21T16:31:20.172+0000)\n>\n> It's not about individual games.  Tilt affects series' and that is all that matters in Ranked.\n> \n> That \"troll\" game is one thing that will push you closer to tilt.  Tilt is not an obvious thing.  It can happening in the middle of a game, but the most insidious form of it sets in over time, causing you to lose multiple games or not play to your full potential.\n\nEDIT: I've been playing since season 2 and I am still dealing with tilt and how to stop it.  90% of the player base does not understand Tilt and how it affects their Ranking.  Don't dismiss it, read it and try to understand it.  Your not a bad person if you go on Tilt, literally everyone does it.\n\nEDIT 2: The C9 vs GE game at IEM Katowice is a perfect example of Tilt in Professional game.  C9 had soooo much pressure on themselves to make plays and get ahead of GE that they continuously made stupid tower dives and just fed kills to GE.  OF course C9 knows better than that, but the pressure got to them, causing them to make irrational choices and ultimately lost them the game.","replies":[{"poster":"FearEngineer","date":"2015-03-22T06:17:28.046+0000","up_votes":1,"down_votes":0,"body":"Are you just like... ignoring this dudes point?\n\nLet's say you put up a good personal performance in a game, let's make it an over exaggerated example: \n-You got fed at mid 10/0 in 20 minutes\n-All the other laners ended up 0/10 in 20 minutes\n-Your jungler died 5 times in his jungle and quit at 15 min\n-Your team surrender votes at 20 minutes 3/4, you lose. \n \nIf the same scenario unfolds game after game, that's not you being on tilt. If your personal performance stays steady or even improves, how are you on tilt? This bizarre notion that other people playing terribly **necessarily causes** you to be \"on tilt\" is just... illogical. \n\nIt's a team game. Sometimes members of your team play like shit. Sometimes it happens several games in a row. It can be demoralizing, but just as often it doesn't affect your personal performance. \n\nWhy are half the comments on the boards some attempt to normalize being terrible at the game and not caring about it? Why am I seeing you post some garbage that proposes:\n\n*perhaps the person on your team that feeds each game isn't just some feeder, but a manifestation of your own inner feeder- you must meditate and calm yourself because your attitude towards feeders is causing them to magically appear in your games*\n\nStop. Just stop.\nStarting to play badly yourself and continuing to encounter bad teammates is not the same thing.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Mcprowlington","date":"2015-03-21T14:38:36.766+0000","up_votes":4,"down_votes":3,"body":"> Im sorry im stuck in gold because of people like you. \n\nYeah. It's just you. No one else ever has to deal with this. Every team you've ever beaten has been 5 players with perfect connections and willing teammates. \n\n\nAlso, you're leaving out half the story. \"lol its just a game who cares\" is generally just a response to raging or verbal abuse and they actually do care.","replies":[{"poster":"FearEngineer","date":"2015-03-22T05:56:13.234+0000","up_votes":1,"down_votes":0,"body":"I'm not really so sure about that. A lot of my friends don't have nearly as many problems in their ranked games as I do and I have even had them watch just to prove how atrocious they are on a regular basis. Bad luck is a thing.","replies":[]}]},{"poster":"Stars Shaper","date":"2015-03-21T14:46:44.591+0000","up_votes":2,"down_votes":1,"body":"\"It's just a game\" attitude is fine in freaking Single Player or non-competitive games.\n\nIf you think you are allowed to screw up a team or perform poorly because 2it's just a game\" that should be considered trolling and an offense far worse than \"gg easy\"","replies":[]},{"poster":"FDS Desperado","date":"2015-03-21T22:19:17.192+0000","up_votes":1,"down_votes":0,"body":"OP quit being a rager.\n\nYou are stuck in gold because of you, no one else. \n\nYou're as likely to get shitty teammates as the other team.","replies":[{"poster":"FearEngineer","date":"2015-03-22T06:20:17.865+0000","up_votes":1,"down_votes":0,"body":"Just like all of us have exactly the same circumstances and luck for everything else in the world. \n\nOh sweetie, your tiny mind is beautiful.","replies":[{"poster":"FDS Desperado","date":"2015-03-23T16:41:25.899+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FearEngineer,realm=NA,application-id=3ErqAdtq,discussion-id=QNg4Kpua,comment-id=000d0000,timestamp=2015-03-22T06:20:17.865+0000)\n>\n> Just like all of us have exactly the same circumstances and luck for everything else in the world. \n> \n> Oh sweetie, your tiny mind is beautiful.\n\nBlame whatever you want, if you are \"stuck\" somewhere, you belong there. \n\nYou are statistically as likely to get said shitty teammates as a guy on the other team.\n\nIf you're good enough you'll carry, if not, you'll find yourself \"stuck\"","replies":[]}]}]},{"poster":"Kapppaccino","date":"2015-03-22T15:49:07.592+0000","up_votes":1,"down_votes":0,"body":"The problem I have sometimes is I completely forget it's ranked! I'm so used to playing normals, I don't realize people care more about that game. When I play Norma I don't really care. I'll try to win but if I feel like it'll require a lot of team effort ( which takes tons of chat spam to get your team to agree to group) I'll just not care and try to solo carry. If I can't then I'll just farm and not care too much. When I play ranked though and I remember it's ranked I 100% ward 10x more then usual, I play safer, and I try to encourage everyone even if their doing poorly. I started asking teammates to remind me I'm playing ranked every 15 minutes and they do. It's helped me win a lot more games lol. Bad memory costs elo.","replies":[]},{"poster":"Spacesuit Spiff","date":"2015-03-21T21:52:51.753+0000","up_votes":1,"down_votes":0,"body":"I just saw this happen in Plat.\nJinx: OMG noob support why you die wtf\nLeona: Well maybe try autoing someone when I go in\nJinx: LOLOLOL its just a game noob chill out\n\nGuess who won that...","replies":[]},{"poster":"Killer of Poros","date":"2015-03-21T17:34:27.749+0000","up_votes":1,"down_votes":0,"body":"We play this *game* to have fun and the people who don't even try are just dicks ruining other people's fun","replies":[]},{"poster":"warpenguin555","date":"2015-03-21T15:40:12.831+0000","up_votes":1,"down_votes":0,"body":"Atleast you are getting the end of the season reward. im in bronze...","replies":[]},{"poster":"Jefftiffy","date":"2015-03-21T15:27:52.469+0000","up_votes":1,"down_votes":0,"body":"Had almost exact same conversation in Silver as the person saying its just a game. Except he was being extremely toxic. I mean I didn't talk all game and only talked to him near the end of the game telling him to calm down and then he goes off on me and in after game chat told everyone to report me for being racist.\n\nSaid he was going to report me for it too lol. All I said was that even though this is ranked it isn't worth getting pissed off over a loss. You can get frustrated yes. But pissed off and toxic means you need to seriously need to re-evaluate how much this game means to you. I want to climb too and I want to win, but I try to avoid being toxic. I stick to self comments and don't tend to talk about my teammates much anymore.\n\nMost of the \"It's just a game\" comments are people who aren't getting pissed and being toxic. Maybe you should think about that.","replies":[]},{"poster":"OhOkYea","date":"2015-03-21T02:24:24.614+0000","up_votes":1,"down_votes":3,"body":"gold v is the same as bronze 1","replies":[{"poster":"Saianna","date":"2015-03-21T12:52:56.088+0000","up_votes":1,"down_votes":0,"body":"obvious troll is obvious","replies":[]}]},{"poster":"Saianna","date":"2015-03-21T12:52:03.627+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Malevolentslim,realm=NA,application-id=3ErqAdtq,discussion-id=QNg4Kpua,comment-id=,timestamp=2015-03-21T01:56:04.543+0000)\n>\n Can you like, stop playing ranked forever please?\n\nForever is too short :(","replies":[]}]}