{"poster":"Pr0jectseph","date":"2015-11-28T09:12:33.378+0000","title":"I've been away for nearly a year. Can anyone give my a quick head's up on some Q's I have?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Want to work on some &quot;Mains&quot;. But don&#039;t really want to bother (at this time) with constant bans. \r\nWho is often banned atm?\r\n\r\n\r\nAs Champs I am very interested in purchasing and practising, how do these guys fare lately? And are they &quot;common choices&quot;:\r\n\r\n**Ekko\r\nTahm Kench\r\nAzir **\r\n\r\n\r\nJust so I am aware, what is currently face-stomping (builds [i.e Tanks in general/ MR &amp; HP heavy/ADC], Roles, Chars) \r\nAgain, just as a heads-up so I know what to be cautious around.\r\n\r\n\r\nThanks ladies and gents!","replies":[{"poster":"JasonWazza","date":"2015-11-28T09:26:00.753+0000","up_votes":3,"down_votes":0,"body":"Bans:\nhttp://www.lolking.net/champions\n\nChamps;\nEkko: Mostly seen as either a tanky jungle or a Mage mid, mostly about outplaying opponents.\nTahm Kench: Hated by everyone, generally a support, but can go jungle and top if you really want, health tank that can take allies/enemies out of fights.\nAzir: Long range lane bully designed for mid lane, that can dispense turrets, and has soldiers which most of his kit is based around, they auto for him because being king of shurima is hard.\n\nCurrently builds are all over the place, the thing's to note is that marksman's got reworked and are thus extremely strong, so did a big chunk of AD items, and thus these are also strong.","replies":[{"poster":"Pr0jectseph","date":"2015-11-28T09:49:30.017+0000","up_votes":1,"down_votes":0,"body":"That cleared a lot up for me. Thanking you!\n\nBut why is Tahm Kench hated so much?\n\nIs he hated for the same reason Bard is/was? I hear Bard has a bad rap...","replies":[{"poster":"JasonWazza","date":"2015-11-28T11:22:43.435+0000","up_votes":1,"down_votes":0,"body":"It's more for the fact that if his allies take CC (for example a morgana binding) he can just swallow them and they basically avoid all the follow up.","replies":[]}]}]},{"poster":"THA GURT","date":"2015-11-28T18:11:41.060+0000","up_votes":1,"down_votes":0,"body":"Yeah out of those 3 Tahm is considered op/cancer, Azir is weak unless your a god with him because of the nerfs but still works and is still fun,  Ekko is fun but normally requires cc from someone else or some serious outplay to snowball. \n\nTrends-anyone that built crit was op but they are slowly nerfing things, mastery fervor is op +80ad late game, Sleeper op Rammus, Malphite. People are spamming yasuo mid and anyone that can build Guinsoos is considered good top.\n\nOther things to know-Games are shorter so early game champs are good to know, champs that have self healing or can heal allies are stronger now because of masteries, turrets are weak so split pushing is back.","replies":[{"poster":"Pr0jectseph","date":"2015-11-30T06:38:56.590+0000","up_votes":1,"down_votes":0,"body":"Awesome info. Thanks for taking the time!","replies":[]}]}]}