{"poster":"xZDarkKnightZx","date":"2016-09-24T16:33:02.667+0000","title":"¿Que significa \"Divertirse\"?","subforum":"Charlas Generales","up_votes":5,"down_votes":4,"body":"En esta partida por ejemplo, me encontre con 4 premades que no paraban de morir, por el simple hecho de que: &quot;Es URF, es para divertirse&quot;\r\n&iquest;Pero que significa Divertirse para ellos? Por que desde mi punto de vista, jugar de una manera absurda a prop&oacute;sito no tiene nada de divertido, adem&aacute;s de que le arruinas la experiencia a otros jugadores.\r\nYa que hay diferencia entre por ejemplo, querer jugar {{champion:432}} ADC, he intentarlo, a simplemente tirarse contra el enemigo.\r\nOtros dec&iacute;an: &quot;No es Ranked&quot;\r\n&iquest;Eso tiene algo que ver realmente? Osea, se que las clasificatorias deben tomarse con mas seriedad, pero eso no significa que las normals deban ser un lugar perfecto para suicidas sin nada mejor que hacer.\r\nSe que no todo en el lol es ganar, ganar y ganar; en realidad, aveces es lindo perder de una forma &quot;tranquila&quot; por que sabes que tu team lo intent&oacute; y estuvo entretenido todo en el proceso. Pero encontrar la &quot;diversi&oacute;n&quot; en que te hagan un bukkake, sin intentar nada que lo haga entretenido, es algo que yo no puedo hacer.\r\nA eso va mi pregunta, &iquest;Que significa realmente divertirse? &iquest;Esta bien la manera en la que ellos lo hacen?\r\n\r\nhttp://imgur.com/KC7NgbQ","replies":[{"poster":"AuroraExecution","date":"2016-09-24T16:36:36.907+0000","up_votes":6,"down_votes":1,"body":"Cada uno se divierte como le parece. Yo en urf toco cualquier cosa, si sale, joya, pero sin trollear y dejarme morir.","replies":[{"poster":"xZDarkKnightZx","date":"2016-09-24T16:38:47.741+0000","up_votes":1,"down_votes":0,"body":"Eso también me parece divertido, pero es justamente lo contrario a lo que ellos hacían :v","replies":[]}]},{"poster":"Zenny","date":"2016-09-25T02:04:05.992+0000","up_votes":2,"down_votes":0,"body":"La gente confunde divertirse con muerte\nPiensan que como es un juego, morir es normal, pero no se dan cuenta de como afecta a la gente\nhttp://imgur.com/BGZv7e1","replies":[]},{"poster":"LeonardoSB","date":"2016-09-24T18:53:45.371+0000","up_votes":4,"down_votes":3,"body":"Diversión = Ganar .\n\nno creo que alguien se divierta perdiendo...\ny permíteme corregirte una cosa , en Rankeds (Clasificatorias) no siempre juegan seriamente, por ahi tienen ganas de probar campeones o jugar con un campeon que no tienen ningun tipo de habilidad, pero que es \"Divertido\", y así nos va, zed mids 0/24/0 :v\n\ny para los que digan \"pues yo me divierto indiferentemente si gano o pierdo\" qué hipócritas, es mejor ganar 9 partidas y perder 1, que ganar 1 y perder 9. \n\nbajo el mismo concepto nadie saldria de bronce.","replies":[{"poster":"sonof666","date":"2016-09-24T20:36:13.548+0000","up_votes":1,"down_votes":0,"body":"+1 Perder no es divertido.\n\nPeor es perder y con LAG.","replies":[]},{"poster":"Annie Botz","date":"2016-09-24T19:39:31.382+0000","up_votes":1,"down_votes":0,"body":"Y si yo me divierto gane o pierda en mi cuenta secundaria :o? en mi cuenta secundaria me es indiferente perder o ganar, lo que me molesta es la actitud de algunas personas que insultan por todo aunque así como hay gente molesta también hay personas super simpáticas.\nPero claro, al ser secundaria le doy menos importancia pero no significa que si pierdo es porque haya jugado mal o que no me haya divertido\n\nMe parece de idiota el tener ese pensamiento tan cerrado.","replies":[]}]},{"poster":"skysoul fenrir","date":"2016-09-24T22:42:13.011+0000","up_votes":2,"down_votes":1,"body":"hace unos meses hice un post sobre el mismo tema, es una lastima que no todos entiendan bien el concepto de divertirse en grupo de igual manera","replies":[]},{"poster":"Sir Crucifix ","date":"2016-09-24T19:21:09.420+0000","up_votes":2,"down_votes":1,"body":"Esta perfecto la manera en la que ellos lo hicieron y hacen \n\nNo es ranked , es URF en este caso , podes terminar 0/800","replies":[]},{"poster":"Espada","date":"2016-09-24T17:38:20.219+0000","up_votes":1,"down_votes":0,"body":"el significado de divertirse es poder alegrarse o sentirse bien recreandose  en un determinado tiempo; por lo que corresponde a tu siguiente pregunta pues si; ellos si lo hacen de la manera correcta pues al final de todo este es un juego , en el cual buscas divertirte , ya sea ganando o jugando de una determinada manera, que esto conlleve una falta a las reglas y normas que nos han y hemos establecido es otra cosa.\nsaludos {{champion:92}}","replies":[]},{"poster":"Vaendrys","date":"2016-09-24T17:02:28.137+0000","up_votes":1,"down_votes":0,"body":"Una cosa es como yo que sigo la kill como si no hubiera un mañana en URF,otra es que salgas 0/14 xD","replies":[]},{"poster":"Un Sin Corazón","date":"2016-09-24T23:29:56.747+0000","up_votes":1,"down_votes":1,"body":"Bienvenido a LAS mi querido amigo. El país de los trolls, flamers y afks donde ellos pueden hacer lo que quieran sin recibir castigo alguno o tipo de sanción\nalguno  para cambiar su actitud. Con el tiempo te acostumbras. Y ya sabes como dice el dicho: si no puedes con ellos, une teles ;D\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Kleagle","date":"2016-09-24T19:47:41.250+0000","up_votes":1,"down_votes":1,"body":"Cada uno se divierte como quiera, sea URF, normal o ranked. Esto es un juego y es sólo para divertirse.","replies":[]},{"poster":"Cyclosarin","date":"2016-09-24T18:05:41.323+0000","up_votes":1,"down_votes":1,"body":"Y... que tiene de divertido URF? a mi me parece una mierda total, entonces respeta a los demas, si ellos se divierten en URF a su manera, ok. Yo te diria que si quieres divertirte, no juegues URF ja","replies":[]},{"poster":"sonof666","date":"2016-09-24T20:35:30.786+0000","up_votes":1,"down_votes":2,"body":"URF es un cancer. Lo peor que haya podido crear RITO.\n\nEs mas divertido jugar al Rey Poro. El cáncer no te carcome.","replies":[]}]}