{"poster":"xZDarkKnightZx","date":"2015-02-05T18:11:31.086+0000","title":"HISTORIA: Cassiopeia Colmillo de Jade","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Hola, mi main es Cassiopeia, y se me ocurrió la idea de inventar una historia para cada uno de sus skins, y posteriormente otros campeones. Empezamos con...\r\nSkins de Cassiopeia: Colmillo de Jade.\r\nCassiopeia, desde su transformación por el veneno de la tumba shurimana, comenzó a interesarse cada vez más en la magia.\r\nDe a poco fue convirtiéndose en una maga excelente, potenciando sus habilidades, su velocidad y muchas cosas más; pero, como fue antes de ser una serpentina mujer, su ambición era extrema.\r\nSu apariencia se volvió \"vieja y anticuada\" para la nueva y poderosa Cassiopeia, así que tuvo la astuta idea de \"cambiar de piel\" y para eso pensó en una piedra hermosa y fuerte, como ella, y el Jade, se le vino automáticamente a la mente.\r\nEl ritual, consistía en que Cassiopeia preparara su propia armadura y vestimenta, y, en los lugares en los que debía haber piezas de Jade, haya pedazos de madera de cerezo en perfecto estado, luego, a la madera sobrante, tenía que tallarla cuidadosamente, y hacer una forma semejante a ella, por último, en un hoyo de fuego ardiente, tirar 10 gotas de su veneno y 4 piedras de Jade , tirar el tronco de madera con ella tallada en el, y disfrutar el espectáculo.\r\nCassiopeia, siguiendo cada uno de esos pasos a la perfección, logró terminar el ritual renovante, e inmediatamente luego de hacerlo, una columna de humo verde y rojo se expandió por toda la ruina en la que se encontraba, en ella se podía oler el éxito.\r\nCassiopeia comenzó a sentir un dolor inimaginable, cuando el humo era absorbido por ella y su armadura, la cual rápidamente tomó colores tanto dorados como rojos y verdes Jade, su piel de la cintura para arriba, menos dura que antes, pero más escamosa, y de ella para abajo más blindada y rijida. sus ojos tomaron un color increíblemente pálido, prácticamente blancos, pues el humo evoluciono todo su sistema y apariencia. Físicamente, había cambiado totalmente.\r\nTodo en ella fue mejorado, su visión, su velocidad, su fuerza, sus habilidades, ¡TODO! Y cuando el humo fue absorbido totalmente, de Cassiopeia salieron destellos de luz radiantes, capaces de cegar a cualquiera; el ritual había sido terminado.\r\nElla, sintiéndose mejor que nunca antes en su existencia, partió de la ruina, como una nueva y letal criatura, buscando presas para estrenar su nueva ella.\r\n-Nada mejor que un cambio de piel- Cassiopeia Colmillo de Jade.\r\nPD: EN LA IMAGEN PODRÁN VER TALLADA EN LA MADERA LO QUE PODRÍA SER UNA PARTE DE LA COLA DE CASSIOPEIA, ASUMIENDO QUE EL RESTO DEL DIBUJO ESTA DEL OTRO LADO.\r\nY UN POCO DEL HUMO SOBRANTE DEL QUE HABLO EN MI HISTORIA.\r\nESPERO QUE LES HAYA GUSTADO Y GRACIAS.","replies":[{"poster":"Mr Blue Sky","date":"2015-02-05T20:00:20.654+0000","up_votes":3,"down_votes":0,"body":"historia ahri raposa de fuego: ahri penso que sabia cocinar, se quemo la cola FIN.","replies":[{"poster":"xZDarkKnightZx","date":"2015-02-05T20:07:03.763+0000","up_votes":1,"down_votes":0,"body":"Vamos, se más creativo :D","replies":[{"poster":"Mr Blue Sky","date":"2015-02-05T20:22:55.022+0000","up_votes":1,"down_votes":0,"body":"ahri la raposa de fuego: muyyy bien creo quee, no se tal vez ahri estaba en el espacio y se fue al sol? enn donde creo que se quemo. pero destruyo al sol y estaba muy oscuro y al parecer la cola de ahri alumbraba asi que se fue a caza del maestro yi a buscar a wukong y ademas consiguio un trabajo como lampara porque estaba muy oscuro?. emm si oscuro y en una de esas ahri se encusio la ropa y el maestro op le dio una nueva y de alli salio ahri XD\n(okno, pero me diverti escribiendo cosas sin sentido creo que crear una verdadera historia talvez no este tan mal en un futuro)","replies":[{"poster":"xZDarkKnightZx","date":"2015-02-05T20:28:09.647+0000","up_votes":1,"down_votes":0,"body":"JAJAJA XD SIIIII, ESCRIBIR COSAS SIN SENTIDO SUELE SER MUY DIVERTIDO XD","replies":[]}]}]}]},{"poster":"xZDarkKnightZx","date":"2015-02-06T17:41:08.531+0000","up_votes":1,"down_votes":0,"body":"AMIGOS! LA HISTORIA DE CASSIOPEIA SIRENA YA ESTA LISTA, COMENTEN QUE PIENSAN ;)\n\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/XE99maA2-historia-cassiopeia-sirena","replies":[]},{"poster":"GalaxiTron YZ","date":"2015-02-06T14:11:57.327+0000","up_votes":1,"down_votes":0,"body":"{{summoner:30}}","replies":[]},{"poster":"xZDarkKnightZx","date":"2015-02-06T04:03:00.708+0000","up_votes":1,"down_votes":0,"body":"HOLA CHICOS, LES COMUNICO QUE NO HARÉ LA HISTORIA DE CASSIOPEIA MITICA, PUES ME DI CUENTA QUE SIMPLEMENTE SERÍA LA MISMA HISTORIA QUE LA DE MEDUSSA DE LA MITOLOGÍA GRIEGA XD\nEN CAMBIO HARÉ LA HISTORIA DE CASSIOPEIA SIRENA ;)","replies":[]},{"poster":"Rob Halfords bae","date":"2015-02-05T19:26:00.823+0000","up_votes":1,"down_votes":0,"body":"wow si que tenes tiempo libre xd\nEs broma , la verdad muy original, buenisimo el lore\n\nQue te parece la idea de que {{champion:56}} es en realidad el sueño de {{champion:98}} ? \n\nO que {{champion:56}} es un discipulo del maestro de {{champion:98}} , que abrio la caja que posteriormente abriria {{champion:238}} ???\n\n\n\n\n\n\nPD: robado de reddit","replies":[{"poster":"xZDarkKnightZx","date":"2015-02-05T19:38:02.813+0000","up_votes":1,"down_votes":0,"body":"Jaja XD muchas gracias :D\ntambién estuve pensando en eso, pero por ahora voy a hacer todas las historias de los skins de Cassiopeia, y cuando termine haré otras historias.\nPD: Te aviso que mañana seguramente haga la historia de Mítica ;)","replies":[]}]}]}