{"poster":"ShtUpnSwaIIowIt","date":"2020-02-06T02:10:37.427+0000","title":"\"# of reports doesnt matter \"","subforum":"Player Behavior","up_votes":3,"down_votes":21,"body":"Riot \" You've been reported x # of times over Y games  \" Gj there riot. \r\n\r\nKind of like how womans rights matters to you. It doesn't.","replies":[{"poster":"KFCeytron","date":"2020-02-06T02:31:14.985+0000","up_votes":10,"down_votes":0,"body":"It doesn't impact the likelihood of your punishment. They're just telling you how many times you've been reported so you know how many people you've annoyed.","replies":[]},{"poster":"Modi","date":"2020-02-06T04:18:54.224+0000","up_votes":5,"down_votes":0,"body":"There is a difference between \"keeping track of the number of times you have reported\" and \"using that to factor into your punishment\". This is not the first time this argument has been used. There has been no definitive evidence shown that the total number of reports factors into a punishment. There is obviously a correlation, but that does not mean that it is used.","replies":[]},{"poster":"5 Dollar Holler","date":"2020-02-07T17:41:40.076+0000","up_votes":1,"down_votes":0,"body":"I would love to see how many times i've been reported over X number of games. Do they only hit you with that during a punishment? Should be open so you can check yoself before you wreck yoself.","replies":[]},{"poster":"JustA kleo","date":"2020-02-06T17:39:58.315+0000","up_votes":1,"down_votes":0,"body":"i dont get the point of this post.\nthe title suggests that you are presenting something that shows that the number of reports DOES matter.\n\nbut you just show that riot can tell you how many times you were reported. which doesnt mean you got punished and thus you actually confirmed that mass reporting does indeed NOT MATTER.","replies":[]},{"poster":"Kei143","date":"2020-02-06T02:52:21.394+0000","up_votes":1,"down_votes":2,"body":"That's actually how many games you were validly reported in, not total report count. \n\nStupid rito and their poor wordings.","replies":[]}]}