{"poster":"Wukong X Ahri","date":"2016-09-09T22:52:04.687+0000","title":"@Meddler @Riot @WHO EVER THE HELL I NEED TO YELL AND VENT AT.","subforum":"Gameplay","up_votes":129,"down_votes":35,"body":"So i read about the Kog rework again. (or unrework i should say?)\r\n\r\nNow i see you talk about Morde and how it missed the mark and all and yeah your damn right you did.\r\n\r\nSo I&#039;m asking why is it Kogmaw gets to be a special snowflake and get fixed before Morde? You all fucked him up before Kog so why is he getting the back sit?\r\n\r\nIll be real i&#039;m so honestly pissed off when i saw that post and trying my BEST not to go full rage on here and just endless rant but seriously this just feels like double standards.\r\n\r\n\r\nidk maybe i just needed to vent w.e\r\n\r\n\r\n\r\n-pissed off Hue main.","replies":[{"poster":"l Helios l","date":"2016-09-09T23:03:04.892+0000","up_votes":85,"down_votes":1,"body":"I believe the tl;dr of what Meddler said was this:\n\n\"Kog wasn't unhealthy pre-rework, so we're reverting it. Morde was unhealthy before and after, so we need to do more work instead of just removing changes.\"","replies":[{"poster":"Pika Fox","date":"2016-09-09T23:39:29.301+0000","up_votes":2,"down_votes":42,"body":"Problem is kog is more fun now than before, so theyre removing fun gameplay.","replies":[{"poster":"Schoenberg","date":"2016-09-10T00:23:24.134+0000","up_votes":34,"down_votes":0,"body":"> [{quoted}](name=Pika Fox,realm=NA,application-id=3ErqAdtq,discussion-id=fIwhjJNo,comment-id=00040001,timestamp=2016-09-09T23:39:29.301+0000)\n>\n> Problem is kog is more fun now than before, so theyre removing fun gameplay.\n\nIt really is fun to just press w and sit there clicking on people.","replies":[{"poster":"resumed","date":"2016-09-10T00:49:20.243+0000","up_votes":52,"down_votes":1,"body":"{{champion:16}} main here\nyes","replies":[{"poster":"Duke Anax","date":"2016-09-10T01:44:26.517+0000","up_votes":7,"down_votes":1,"body":"You are doing it qrong, Q is the key.","replies":[]}]}]}]}]},{"poster":"Riot ThEntropist","date":"2016-09-10T00:55:51.625+0000","up_votes":80,"down_votes":8,"body":"Yo,\n\nI don't make these decisions but my understanding of this was that Kog had a previous state that we felt was healthy and good for the game. When we looked to update the Marksman class we tried to examine him to make him even better, and missed the mark. We are okay going back to a space that we felt worked whereas we do not feel the same with Morde. \n\nI'll try to gather more info and come back with a more concrete response, but I believe that was the gist of it.","replies":[{"poster":"Karcist","date":"2016-09-10T02:53:18.965+0000","up_votes":14,"down_votes":4,"body":"> [{quoted}](name=Riot ThEntropist,realm=NA,application-id=3ErqAdtq,discussion-id=fIwhjJNo,comment-id=0011,timestamp=2016-09-10T00:55:51.625+0000)\n>\n> Yo,\n> \n> I don&#x27;t make these decisions but my understanding of this was that Kog had a previous state that we felt was healthy and good for the game. When we looked to update the Marksman class we tried to examine him to make him even better, and missed the mark. We are okay going back to a space that we felt worked whereas we do not feel the same with Morde. \n> \n> I&#x27;ll try to gather more info and come back with a more concrete response, but I believe that was the gist of it.\n\nWhy isn't his ult getting reverted too? I was ecstatic when I heard Kog was getting reworked, but then I read that his current ult was staying and it was one of the biggest letdowns I've experienced playing this game. AP Kog'maw is completely unviable right now.","replies":[{"poster":"Chibi Bronzlife","date":"2016-09-10T03:04:36.312+0000","up_votes":23,"down_votes":4,"body":"maybe because they don't want AP kog to come back?","replies":[{"poster":"Oakleaf Ranger","date":"2016-09-10T03:15:22.817+0000","up_votes":4,"down_votes":10,"body":"seriously some champions just weren't meant to go certain build paths even if they have some small synergy with it. Imagine if Pantheon was made all AD and then just shake your head in disbelief when you hear someone complain about AP Pantheon being ruined.","replies":[{"poster":"The Great Divide","date":"2016-09-10T03:46:52.128+0000","up_votes":25,"down_votes":1,"body":"But AP Kog Maw had a very legit playstyle, build path, and player base. He became a very potent high range poke threat, especially with items. If you played him well, he was one of the ultimate ap poke champs because his ult gave him insane range. \n\nComparing Pantheon who as one AP scaling on his w to AP Kog doesn't make sense.","replies":[{"poster":"Oakleaf Ranger","date":"2016-09-10T03:53:48.135+0000","up_votes":4,"down_votes":12,"body":"He also has AP scaling on his ultimate the very thing you are saying that made AP kog maw \"good\"","replies":[{"poster":"The Great Divide","date":"2016-09-10T04:04:51.324+0000","up_votes":11,"down_votes":0,"body":"It's not just about whether the spells have AP ratios attached to it (sorry about missing panth's ult). It's also about what do those spells do, can AP items enhance the spells, can AP items enhance the playstyle of the champ? In Kogmaw's case: absolutely (Seraph for mana galore and a clutch shield, rylai's for sick ult chaining, etc). \n\nIn Panth's case......","replies":[{"poster":"Oakleaf Ranger","date":"2016-09-10T04:48:57.756+0000","up_votes":1,"down_votes":13,"body":"I heard the argument being made before for AP Pantheons burst from his ultimate and W. There are definitely items that can allow that play style. Is it actually practical though? No since it needs too many things to work. Same could be said about AP kog Maw.","replies":[{"poster":"The Great Divide","date":"2016-09-10T05:28:50.242+0000","up_votes":6,"down_votes":0,"body":"No there are no items, because everyone can see his giant ult indicator, so there's that AP damage right out the window. And his W (while having 100% AP scaling) is very low range and decently cd, while also putting him in range of everything (which if he's building full AP means he just jumped into suicide)\n\nAP Kog used to have a spammable high damaging (base damage with decent scaling), super long range ult. Coupled with a long range high damaging E, he had a very potent niche of being the longest ranged poke mid. And with his very spammable ult with rylais you could chain a lot of damage from an obscene range (URF mode was just too fun).\n\nIn any regard: Kog Maw's kit allowed for him to have a practical AP build (Or at least high mana and magic penetration AP items) because of the way the spells worked. Pantheon's kit does not.","replies":[{"poster":"Oakleaf Ranger","date":"2016-09-10T06:16:20.129+0000","up_votes":2,"down_votes":6,"body":"First to be clear I'm not defending AP pantheon cause I think its good or viable. If anything I would highly discourage it but I'm playing devils advocate. Pantheon theoretically benefits from AP and magic penetration just like Kog Maw. Just because someone sees his ultimate doesn't mean they can dodge in time or he can just sit in bushes to ambush people with his W. He also has the highest base move speed to chase people down. He already hits people with his W as AD so its just as possible as AP. Also for a \"practical\" build he doesn't get the ability he relies on the most until 6, seems very practical to me.","replies":[{"poster":"The Great Divide","date":"2016-09-10T07:15:15.451+0000","up_votes":5,"down_votes":0,"body":"......... wut\n\nHe hits people with his W as AD, because it lets him proc his AD E, which is massive damage. His W is solely used for the utility. And his high base move speed does nothing if he does no damage because it's all frontloaded into one higher CD AP spell. And he doesn't rely on 6 for his AD build, it just allows to snowball the other lanes after he's snowballed his lane.\n\nHonestly, you trying to even argue that AP Pantheon is even some kind of viable in order to say AP Kog wasn't is just silly. At least use a different example, because you're arguments for AP panth are insane.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"The Yetii Rider","date":"2016-09-10T01:31:32.439+0000","up_votes":1,"down_votes":2,"body":"How do you figure? \n\nYou gutted the attack speed on Runaan's and lowered the AD on several items at the same time that you changed this previous incarnation. What is Kog supposed to build when he can't stack AS to reach 5.0?","replies":[{"poster":"l Helios l","date":"2016-09-10T02:28:07.769+0000","up_votes":4,"down_votes":1,"body":"{{item:3078}}\n\nHe was one of the original Tri-Force ADCs. Him, {{champion:42}} , and {{champion:81}} , granted on Ez {{item:3025}}  became a replacement for Tri.","replies":[{"poster":"The Yetii Rider","date":"2016-09-10T03:18:03.075+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=UltimoMark3,realm=NA,application-id=3ErqAdtq,discussion-id=fIwhjJNo,comment-id=001100010000,timestamp=2016-09-10T02:28:07.769+0000)\n>\n> {{item:3078}}\n> \n> He was one of the original Tri-Force ADCs. Him, {{champion:42}} , and {{champion:81}} , granted on Ez {{item:3025}}  became a replacement for Tri.\n\nTrinity Force only works when Kog's ult is worth casting on repeat. How is this Kog going to get multiple casts off?\n\nAlso Corki has been trash since Trinity Force lost its crit. Between Kog's ult nerf and the crit removal, I don't think people will find any success building Trinity Force on him.","replies":[{"poster":"Kog And Balls","date":"2016-09-10T12:05:12.321+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=The Yetii Rider,realm=NA,application-id=3ErqAdtq,discussion-id=fIwhjJNo,comment-id=0011000100000000,timestamp=2016-09-10T03:18:03.075+0000)\n>\n> Trinity Force only works when Kog&#x27;s ult is worth casting on repeat. How is this Kog going to get multiple casts off?\n> \n> Also Corki has been trash since Trinity Force lost its crit. Between Kog&#x27;s ult nerf and the crit removal, I don&#x27;t think people will find any success building Trinity Force on him.\n\nFucking 100% this I was so excited when I saw they were going to revert Kog rework until I saw they were going to leave his Ult in its current state. \n\nCurrent Trinity would be super sick on pre-work Kog cause he didn't heavily benefit off the crit as much as he would from the additional attack speed. \n\nWeaving ult shots in between autos was the most satisfying feeling you could get from playing Kog. I just can't believe Riot would be this dense about what the player base wants.","replies":[]}]}]}]},{"poster":"Xela Syab","date":"2016-09-11T16:18:48.773+0000","up_votes":2,"down_votes":0,"body":"idk, the morde rework made him a troll pick, kog is now a omg jungle pick. I don't think you guys goofed up with Kog, you guys just shifted way too much power into one ability and essentially one playstyle. Morde really needs a real rework for a top lane or a jungler champ not a wonkey bot lane mess.","replies":[]}]},{"poster":"Eedat","date":"2016-09-09T23:03:51.261+0000","up_votes":24,"down_votes":0,"body":"Because Kog's rework cant be dumpstered without gutting every single on-hit item in the game","replies":[]},{"poster":"Malicious Metal","date":"2016-09-09T23:56:30.459+0000","up_votes":24,"down_votes":1,"body":"Let's be completely honest here.\nNew Mordekaiser offers a ton more ways to be balanced than the old one.\n\nHe was doomed to be weak for the longest time and the rework opened many avenues for him to succeed.\nThough I agree that there could be SOME reverts to his kit, especially on the topic of base stats and his awful W","replies":[{"poster":"Lord Boltrix","date":"2016-09-10T01:29:33.610+0000","up_votes":11,"down_votes":1,"body":"This exactly.\n\nPeople often demand a reversion of Mordekaiser to his previous state, expecting that somehow balance and fairness would come along with the kit that he had pre-rework. But that was never the case, and Mordekaiser sat in a proverbial twilight zone of being so oppressively toxic to face for anyone who didn't have the tools to counter him that Riot could not give him any meaningful buffs.\n\nYou think Yasuo is annoying with all his tricks? I wonder if and when the Yasuo circlejerk could have ever handled someone who can burst your ass into nonexistence AND take hits just as well periodically BECAUSE of how much he melts your face, and this is also someone who can take the most fed person on your team and turn him into HIS team's biggest ally should said person make a catastrophic failure.\n\nFeast or famine, thy name is Mordekaiser.\n\nA rework was always in his destiny, it just so happened we got one that nobody was happy with at some point.\n\nI'm pretty sure we would be happy with a partial reversion of Mordekaiser, get to keep a few of the goodies from his rework (the dragon ghost, the shield now scaling with health, maybe the Q and maybe the heal from his W when it expires), of course numbers and costs would need to be changed if we got a partial reversion.\n\nBut please, everyone, don't act like reverting Mordekaiser would solve all his problems. Return him to a playstyle more people enjoy, very likely, but solve all his balance problems? Either you are smoking something seriously strong or you never actually played as or against Mordekaiser pre-rework and are just jumping on the bandwagon.","replies":[]}]},{"poster":"Jinzo Torrance","date":"2016-09-09T23:00:46.987+0000","up_votes":30,"down_votes":6,"body":"We {{champion:90}} Mains want a revert too","replies":[{"poster":"Tormentula","date":"2016-09-09T23:10:34.294+0000","up_votes":11,"down_votes":1,"body":"> [{quoted}](name=MarcheseDelGrill,realm=EUW,application-id=3ErqAdtq,discussion-id=fIwhjJNo,comment-id=0003,timestamp=2016-09-09T23:00:46.987+0000)\n>\n> We {{champion:90}} Mains want a revert too\n\nPlease, \n\nNew malzahar just feels so terrible, yes its like the same kit with a banshee's veil, but I constantly feel like old malzahar was more satisifying to do anything with rather than hiring the count to stand there waiting for voidlings to dive tower and die 1by1 killing nothing. \n\nhttps://i.imgflip.com/1ac5vi.jpg","replies":[{"poster":"YumaS2Astral","date":"2016-09-10T03:54:05.443+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=EliteMantis17,realm=NA,application-id=3ErqAdtq,discussion-id=fIwhjJNo,comment-id=00030000,timestamp=2016-09-09T23:10:34.294+0000)\n>\n> Please, \n> \n> New malzahar just feels so terrible, yes its like the same kit with a banshee&#x27;s veil, but I constantly feel like old malzahar was more satisifying to do anything with rather than hiring the count to stand there waiting for voidlings to dive tower and die 1by1 killing nothing. \n> \n> https://i.imgflip.com/1ac5vi.jpg\n\nNot to mention, with old Malzahar I could at least clear waves consistently during the first few levels and his damage was way higher.","replies":[]}]},{"poster":"Wukong X Ahri","date":"2016-09-09T23:13:06.057+0000","up_votes":11,"down_votes":2,"body":"I know your pain Malz was my back up pick for mid.","replies":[]},{"poster":"Save","date":"2016-09-10T00:08:55.586+0000","up_votes":4,"down_votes":5,"body":"Idk about you but in all honesty I think this Malz is just better than old Malz. I played old Malz a decent amount (mostly to counter pick some mids) but he was so immobile and so susceptible to getting ganked early and dying. Sure you could probably pull out a kill in 2v1 if you knew what you were doing but I with the new passive that doesn't happen as often. I mean, sure the laner will try to pop passive but that just lets you get just as aggressive and trade well. I feel like his damage is just way better and more than just a \"faceroll burst\" like he had before. TO SUM it up, BOTH Malz are/were great teamfight, laning, everything champions but I just think this one holds a slight edge tbh","replies":[{"poster":"The Great Divide","date":"2016-09-10T03:59:43.057+0000","up_votes":9,"down_votes":1,"body":"You just made the case for old malzahar..... Malzahar was very weak to ganks and strong engages, but he had excellent damage for a teamfight if positioned properly, and a great 1v1. His new passive broke him, because the passive itself is either broken OP, or nerfed so much its borderline useless (its state right now). And now that his passive is not very good, he plays even less aggressively than he ever has. On top of this, most of his damage was front-lined into his gimmicky w, which is so easy to negate if you know what you're doing (aka, kill the voidlings). \n\nAnd Malz was only faceroll burst if you were dumb enough to either: get in his close range, or let him walk right up to you. Most of what malzahar actually did in teamfights (contrary to everyone thinking he just flashed r'ed people all the time) was sit back and try and get E bounces, and Q damage and play a more poke-kite style. \n\nAll in all: old malz had very great strengths and very great weaknesses. New malz is totally based on his passive which can either make or break him.","replies":[]}]},{"poster":"Xilixer","date":"2016-09-09T23:25:45.214+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=MarcheseDelGrill,realm=EUW,application-id=3ErqAdtq,discussion-id=fIwhjJNo,comment-id=0003,timestamp=2016-09-09T23:00:46.987+0000)\n>\n> We {{champion:90}} Mains want a revert too\n\nhere here!!! i say!!","replies":[]}]},{"poster":"Terminus Edge","date":"2016-09-09T22:56:46.215+0000","up_votes":15,"down_votes":0,"body":"With Kog, they can just revert his W and already be making good progress to bringing him back to a good spot.\n\nFor Morde, though, it's not so simple. He basically needs a full VGU, like Ryze got, or close to it.","replies":[]},{"poster":"DorkunedAuras","date":"2016-09-09T23:28:13.156+0000","up_votes":14,"down_votes":0,"body":"Let's think of it this way. Kog before was balanced and balanceable. Kog now isn't.\n\nMorde before was forced to stay weak and was very hard to balance. New morde is slightly better in that respect.","replies":[]},{"poster":"CrazFight ","date":"2016-09-09T22:54:46.908+0000","up_votes":8,"down_votes":22,"body":"- Some morde mains like the new morde","replies":[{"poster":"Wukong X Ahri","date":"2016-09-09T22:59:26.717+0000","up_votes":19,"down_votes":1,"body":"Far more quit/don't even play him any more.\n\nhe used to have a pretty decent player base its pretty small now days.","replies":[{"poster":"Malicious Metal","date":"2016-09-09T23:54:05.824+0000","up_votes":9,"down_votes":1,"body":"I prefer the new one actually.\n\nA combination of both old and new would be great imo.\n\nEspecially that juicy ol' Creeping Death and the increased shield gen rate-","replies":[{"poster":"Wukong X Ahri","date":"2016-09-10T00:03:49.074+0000","up_votes":1,"down_votes":0,"body":"Yes i know you love the new one.\n\nand Yeah i miss the old Creeping Death the most tbh.","replies":[{"poster":"Malicious Metal","date":"2016-09-10T00:21:10.643+0000","up_votes":6,"down_votes":0,"body":"A badass cloud of shrapnel surrounding you and beefing you up with some nice resistances while also dealing a TON of AoE damage WITHOUT having to stand to other units.\n\nDamn...\nIt was such a great spell, It was by far one of the spells that screamed \"fighter\" more than any other of his old skills.\nIt'll fit on the new kit a lot better than a heal that scales with AP instead of missing hp like a juggernaut/fighter spell should be supposed to work.\n\n(Yes, I really dislike his new W, sue me!)","replies":[]}]}]}]}]},{"poster":"FantasySniper","date":"2016-09-09T23:27:56.563+0000","up_votes":8,"down_votes":0,"body":"They're reverting what now?\n\nI didn't think \"revert\" was in their vocabulary.","replies":[{"poster":"40glass","date":"2016-09-10T17:10:19.556+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FantasySniper,realm=NA,application-id=3ErqAdtq,discussion-id=fIwhjJNo,comment-id=0008,timestamp=2016-09-09T23:27:56.563+0000)\n>\n> They&#x27;re reverting what now?\n> \n> I didn&#x27;t think &quot;revert&quot; was in their vocabulary.\n\nPlease unrework Corki. his auto attacks deal 0 damage.","replies":[{"poster":"Auz the Ripper","date":"2016-09-10T17:17:22.879+0000","up_votes":3,"down_votes":0,"body":"What corki are you playing?","replies":[]}]}]},{"poster":"Alutrosity","date":"2016-09-09T23:17:48.771+0000","up_votes":6,"down_votes":12,"body":"***","replies":[{"poster":"Wulf Helhammer","date":"2016-09-09T23:21:31.080+0000","up_votes":14,"down_votes":4,"body":"Way off topic for most of the post\n\nIncredibly toxic\n\nBlames Riot for your behavior\n\nThis is just too much","replies":[]},{"poster":"Subject 5","date":"2016-09-09T23:47:15.882+0000","up_votes":8,"down_votes":2,"body":"> [{quoted}](name=Alutrosity,realm=NA,application-id=3ErqAdtq,discussion-id=fIwhjJNo,comment-id=0006,timestamp=2016-09-09T23:17:48.771+0000)\n>\n> Because they don&#x27;t actually give a fuck about what you want. This isn&#x27;t riot admitting to their mistakes as JeremyGamingCurious said, it&#x27;s riot deciding for _themselves_ that THEY disliked the Kog&#x27;Maw rework, what it presented, and how it can NO LONGER BE USED IN PROFESSIONAL PLAY BECAUSE IT&#x27;S THE ONLY THING THEY GIVE A FLYING FUCKING SHIT ABOUT.\n> \n> Yes, I was a former Mordekaiser main. The supposed rework he got wasn&#x27;t a rework AT ALL. He was turned into a fucking bot lane &quot;marksman&quot; piece of shit by riot as a way of introducing the concept that marksman can be anything and go anywhere, opening the floodgates for toxic **BULLSHIT** like Kindred, Graves jungle, Kog&#x27;Maw jungle, VAYNE JUNGLE. \n> \n> This is not for the players. This is for the pros. This is not for the players. This is for them to line their goddamn motherfucking pockets with more  money. Every time I see a picture of a riot employee it&#x27;s them with a side-ways, shit-eating, contemptuous grin showing how proud they are of themselves, their decisions, their dumbass constant pandering to SOCIAL JUSTICE CRAP through making champions like Taliyah and Illaoi, both of whom are NOT BEAUTIFUL AT ALL. One is a teenager, the other is a living, female steroid that for some reason hides behind her big dicked hentai god because she&#x27;s not a strong woman at all, she&#x27;s just another %%%%rag bitch, just like Kindred is a whiny fucking brat who does nothing but irritate you and make you want to smash your speakers every time you hear a line complaining about how &quot;WAH WAH, YOU TOOK OUR CHICKENS, THAT WAS MEANT TO BE OURS, I WAS GOING TO USE THE CHICKEN EGGS TO MAKE HIPPY VEGAN OMLETTE HEEHEE XD LOOK AT HOW TRENDY AND AWARE OF HUMANITY&#x27;S PROBLEMS I AM!&quot;\n> \n> Jesus Christ, FUCK YOU, riot.\n> \n> Fuck you for putting me on a 24 game chat restriction because I had the _gall and audacity_ to defend myself against some little shitrat Fizz player, who got ANGRY because I refused to let him play Akali top, and pull more of that let&#x27;s-make-assassins-tanky meta GARBAGE - riot knows that shit is toxic - so I get attacked by other players on the enemy team, deal with a passive-aggressive enemy Irelia who wants to ask me why I feel the way I feel, then two seconds later pull a fucking 180 and start bitching about IT doesn&#x27;t want to hear my opinion. If you don&#x27;t want my opinion, don&#x27;t ask for it, dipshit, how fucking stupid are you!?\n> \n> Sometimes I think riot is a corporate video-game manifestation of everything that is wrong with the world today. Everything they do is pandering to some retarded social agenda, punishing players for having aggressive personalities, punishing them for INSULTING EACH OTHER OVER A FUCKING VIDEO-GAME. Nobody is taking a fucking rope, tying it around their neck and hanging themselves from their fucking chandelier because some other equally assholish character trash-talked them in a game SORRY RIOT, IT DOESN&#x27;T HAPPEN, TOXICITY DOESN&#x27;T EXIST, TOXICITY IS A FUCKING OPINION SOME RETARD WITH TOO MUCH ESTROGEN IN THEIR BLOOD DECIDED &quot;TALKING MINDLESS SHIT ISN&#x27;T NICE, BUT IT SURE IS THE CRUELEST THING IN THE WORLD SINCE FUCKING HITLER!&quot;\n> \n> I could think of a lot more things to say about riot, but fuck it -  it&#x27;s pointless, nothing will change -  the only way I&#x27;ll be able to leave this toxic piece of shit game is if I find something else that is actually satisfying to play. Good luck with that though since innovation in video-games is virtually non-existent with the exception of a few things, but holy fuck, I keep praying something interesting will come out, and help fill the void of emptiness that this game, and the gaming industry as a whole has created.\n> \n> TL;DR This thread seemed like the perfect opportunity just unload and vent all my fucking frustrations about this game. No, I don&#x27;t hate women, but I think riot&#x27;s way of representing women and making them into &quot;respectable remodels&quot; that female players can look up to is backwards as shit, fucking retarded, and there are infinitely better ways to do this. Want an example? Karma. Strong, female character, good looking to boot, and not overly sluttish, or bimbo-ish. Just a strong, attractive, female champion who is intelligent through her lines, actions, and character designs, but without shoving it down your throat like some feminazi bitch.\n\n-Reads the top paragraph\n\n-Skips like 3/4 of the rant-\n\n-Reads the TL;DR\n\n-Somehow is ranting about feminism","replies":[{"poster":"TyrekGoldenspear","date":"2016-09-10T01:38:32.407+0000","up_votes":5,"down_votes":0,"body":"Here's a rough translation.\n\nJust be glad you skipped the rant, in my effort to translate I got saturated with salt. I'm going on a low sodium diet for a while...\n\n\nRiot only cares about the LCS. The only reason they reverted the rework is because he can be used in the LCS after the revert.\n\nMordekaiser's rework wasn't a rework but a gutting that tried to make anything a marksman, and blames this for ADCs going jungle. \n\nRepeat of first paragraph, but with more graphic detail on how he personally despises Riot employees, painting them as money seeking scumbags. Describes their smiles as poop eating.  Then we move into Social justice territory, with how Riot is \"pandering to femenism\" by making Taliyah and Illaoi simply because he doesn't think they are beautiful. Mocks Kindred.\n\nHe wants Riot to have an orgy.\n\nComplains about a chat restriction he was put under.\n\nCalls Riot out for \"pandering\" again, this time claiming that toxicity doesn't exist and only \"girly\" men and women claim it does so they don't get their feelings hurt. Claims that cyberbullying doesn't exist and nobody has ever killed themselves over a videogame conversation. \n\nWants to leave \"toxic\" game but can't find anything else interesting.\n\nHis TLDR. Thinks Riot's way of representing women is wrong but also claims to hate feminism. Thinks Karma is bae.","replies":[{"poster":"Alutrosity","date":"2016-09-10T02:45:57.585+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"TyrekGoldenspear","date":"2016-09-10T02:58:34.145+0000","up_votes":3,"down_votes":0,"body":"...\nBabe is just a word you use to refer to a woman you like, jeez. It's like Honey or Sweetheart. No need to be so uptight. I was half tempted to write up a translation of this as well.\n\nI only tripped over my brain cells because I have so many they overflow. :^)\n\nI'm glad you like Karma, I like her too. I like all the women in LoL, if not attractively then I like their playstyle or lore.\n\nAlso your TLDR has nothing to do with your comment. But whatever. \n\nI hope you are not this heartless in real life. People do have mental/emotional problems dude, real ones from birth. Brain chemistry isn't perfect in everyone. \n\nAnd I'm sorry if the only response you can give to trash talking is to stoop to their level and talk back to them in this way. You should know it doesn't solve anything and usually escalates the encounter to violence. (Or in the case of LoL, causes someone to DC/AFK/etc. Basically ruin the game for everyone.) \n\nIt takes two people to argue and engage in pointless nasty word throwing. Nuff said.","replies":[]}]}]}]},{"poster":"TyrekGoldenspear","date":"2016-09-10T01:14:46.505+0000","up_votes":6,"down_votes":0,"body":"Wait how did you get from reworks to feminism?","replies":[]},{"poster":"Nik Nikerson","date":"2016-09-10T00:06:59.550+0000","up_votes":2,"down_votes":0,"body":"Here's an interesting fact: Not everything in this world is designed for you to like. Other people like things you don't. They get to have things too.\n\nThis thread isn't the perfect opportunity to vent about all your issues. You want to complain about your chat restriction? Start your own thread. You want to complain about female character design? Start your own thread. Most of this has nothing to do with game play or balance.","replies":[{"poster":"Alutrosity","date":"2016-09-10T02:30:30.787+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Nik Nikerson,realm=NA,application-id=3ErqAdtq,discussion-id=fIwhjJNo,comment-id=00060003,timestamp=2016-09-10T00:06:59.550+0000)\n>\n> Here&#x27;s an interesting fact: Not everything in this world is designed for you to like. Other people like things you don&#x27;t. They get to have things too.\n> \n\nNowhere did I say or imply _at all_ that things had to be my way or the highway. Do not try to approach me with your cynical perceptions again.\n\nSecondly that would be an interesting fact if I was at-all interested in you twisting my words to make me seem like some petulant brat that wants things to be his way and his way only. I said if riot wants to portray a strong female champion who is independent, then having her rely on an outside source of power, particularly a god who from my understanding is based on Cthulhu (a male character in Lovecraft's stories) is contradictory and in fact undermine's her independence. \n\n> This thread isn&#x27;t the perfect opportunity to vent about all your issues. You want to complain about your chat restriction? Start your own thread. You want to complain about female character design? Start your own thread. Most of this has nothing to do with game play or balance.\n\nNo. I will use this thread because the very thread title itself encourages venting, and person stated they were pissed off and wanted to vent their frustrations. I'm doing the same thing, with the distinction of covering a much larger range of topics as opposed to one, that being Riot's piss poor attempts at creating strong female characters, which only happened because women with tooth-pick bodies became jealous of Miss Fortune and Sona. \n\nBoobs = healthy woman capable of breastfeeding a child, particularly big ones as they can provide more breast milk. Wide hips = healthy woman capable of spreading her legs wide enough to give birth.\n\nDumb people who are either too lazy to exercise or lack these traits become jealous, claim they are being misrepresented, and Riot caters to their idiotic pleas of social justice and \"gender equality\". This is something that pisses me off because it is fueling a fundamental misunderstanding of women both mentally and physically, and to be frank, video-games are not the medium to be pushing forth social agendas. Riot chooses to allow these views to effect their character design, and that is, in my opinion which you are welcome to wrongly disagree with, FUCKING STUPID.","replies":[]}]}]}]}