{"poster":"FeRixHD","date":"2017-04-11T18:57:15.816+0000","title":"Teamaufbau mit Ziel Turniere und EPS","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Guten Abend,\r\n\r\nmein Ziel ist es  ein Team aufbauen das Spa&szlig; am spiel hat und sich verbessern will und das Ziel hat an Turnieren teilzunehmen und auch in die ESP zu kommen.\r\n\r\nAllgemeine Vorrausetzungen:\r\n\r\n                                                  Gutes Headset oder Mikrofon.\r\n                                                  Spa&szlig; am Spiel.\r\n                                                  Verbesserungswunsch.\r\n                                                  Kein geflame selbst bei einem schlechten Game.\r\n                                                  Alter 18. (Ausnahme bei einem angemessenen verhalten m&ouml;glich)\r\n                      \r\n\r\nTs und Webseite werden um das Team aufgebaut sobald Kandidaten f&uuml;r das Team feststehen wird der Ts innerhalb von Minuten aufgesetzt. Nachdem das Team dann feststeht werde ich mich pers&ouml;nlich um die Webseite k&uuml;mmern.\r\n\r\nZu meiner Pers&ouml;nlichkeit ich spiele schon seit Season 2 hatte aber lange Pausen und habe erst diese Season wieder angefangen ernst zu spielen, was sich auch in meiner Elo wiederspiegelt die auf diesem ACC Silber 4 entspricht und auf meinem eigentlichen Main Gold 4.\r\nHabe ich Erfahrungen mit dem aufbau und Betreuung von Teams? Ja ich habe 2 CS:GO Teams mitgegr&uuml;ndet und geleitet aber diese Leitung abgegeben da das Interesse an Turnieren und der Wille sich zu verbessern nachgelassen hatte.\r\n\r\n\r\nSuche:\r\n\r\n               Was ich hiermit suche sind alle Rollen Coaches sind auch sehr gerne gesehen da sie f&uuml;r ein Team elementar wichtig sind. \r\n\r\n\r\nCoach:\r\n\r\n              Als Coach solltet ihr euch in der Elo von Gold bis nach oben offen befinden da es nicht nur auf die Elo und damit seinen Spiel k&ouml;nnen \r\n              zusammenh&auml;ngt sondern auch mit sehr viel Analyse und Taktik, wenn ihr als Coach beitreten m&ouml;chtet k&ouml;nnt ihr euch gerne bei mir Melden oder \r\n              einen Kommentar mit eurer Elo und eurer Erfahrung schreiben. Coaches werden von mir Pers&ouml;nlich getestet um ihr k&ouml;nnen zu Beweisen um dem \r\n              Team hilfreich zu sein.\r\n\r\nSpieler:\r\n\r\n             Was erwarte ich von Spielern die Elo spielt eine rolle aber es k&ouml;nnen ausnahmen gemacht werden am besten w&auml;re min. Gold 4, dies kann sich aber \r\n             auch &auml;ndern durch Kandidaten wenn dort der durchschnitt h&ouml;her liegen sollte wird die mindest Elo angehoben. Bereitschaft in Videos auf Youtube \r\n             und in Streams dabei zu sein.\r\n\r\nTrainingszeiten:\r\n\r\n             Feste Trainingszeiten sind als Team ein muss diese werden aber nach der Verf&uuml;gbarkeit der Mitglieder festgelegt.\r\n\r\nJe nach Elo bereich werde ich selbst im Team spielen oder wenn es mein k&ouml;nnen &uuml;berschreitet nur das Management &uuml;bernehmen. \r\nUm Sponsoring werde ich mich k&uuml;mmern nach dem kleine erfolge erzielt worden sind und wir etwas vorzuweisen haben. \r\n\r\nBei Interesse einen Kommentar schreiben oder mich ingame adden und dort wird alles weiter besprochen.\r\nBei dem Kommentar bitte euer Alter, Elo, Rollen und Main Champions nennen um euch besser einordnen zu k&ouml;nnen.\r\n\r\n\r\nIch hoffe auf eine gute Zusammenarbeit und noch einen sch&ouml;nen Abend.\r\n\r\n\r\nMFG FerixHD","replies":[{"poster":"D3Di","date":"2017-04-11T20:05:20.171+0000","up_votes":2,"down_votes":0,"body":"https://www.youtube.com/watch?v=thSJZBHaqh8","replies":[]},{"poster":"Niak0r","date":"2017-04-11T22:29:42.771+0000","up_votes":1,"down_votes":0,"body":"Moin, bin 17, werd in ziemlich genau 23 tagen 18, bin main suport, auch auf der toplane einsetzbar, sonst aber ziemlich unbrauchbar, aktuell gold 3, aber auf ganz gutem weg zurück nach platin wo ich letzte season war, main champs tahm kench und bard, aber der pool weitet sich über ranged wie morg, janna soraka zu tanks wie braum und thresh, bin nicht so der flamer halte mich ganz gut an absprachen hab aber nicht immer Zeit, RL geht halt vor ( also beim planen, ne absprache ist ne absprache) bei Intresse einfach mal zurückschreiben oder ingame adden","replies":[{"poster":"FeRixHD","date":"2017-04-12T05:48:10.637+0000","up_votes":1,"down_votes":0,"body":"Hört sich gut an habe dir mal eine Anfrage gesendet wenn nichts angekommen ist bitte mich Adden alles weitere wird heute Abend in einer Besprechung geklärt.","replies":[]}]}]}