{"poster":"Shake and Bake","date":"2016-04-28T18:51:54.805+0000","title":"Reports por mutear jugadores?","subforum":"Comportamiento del jugador","up_votes":6,"down_votes":1,"body":"Hola, estaba jugando una partida y yo soy de mutear a todos para no estresarme con alguno de esos jugadores simpaticos que suelen tocar, ademas estaba en premade por TS, entonces, entramos en partida. Yo escribo el comando /mute @all pero lo escribi mal, sin la /, lo pongo denuevo y sigo sin problemas, y mi amigo por el ts me dice &quot;Lol, te empezaron a bardear porque los muteaste&quot; osea, wtf, ademas de pedir report para mi jajaj, yo me rei y le dije a mi amigo q no me diga mas, por algo los mutee, y bueno, quisiera saber que opinan, mutear para jugar tranquilo merece report?","replies":[{"poster":"wattefak","date":"2016-04-28T22:22:56.852+0000","up_votes":3,"down_votes":0,"body":"mutea y carrealos para que lloren aun mas{{champion:29}} {{item:3070}} \nhttp://i.imgur.com/bs1aaWS.jpg","replies":[]},{"poster":"LaReinaPingüino","date":"2016-04-28T19:27:21.571+0000","up_votes":3,"down_votes":0,"body":"No es reportable, osea sólo usaste un coma do del lol, ni que fuese un exploit xD","replies":[]},{"poster":"Sir Crucifix ","date":"2016-04-28T19:01:37.681+0000","up_votes":2,"down_votes":0,"body":"a mi me dicen que me van a reportar por cada estupides , yo les digo si si","replies":[]},{"poster":"Murder Dealer","date":"2016-04-29T03:12:52.877+0000","up_votes":1,"down_votes":0,"body":"Yo quiero que responda alguien de riot, ya que no comunicarse con el equipo tambien seria una falta, si nadie dijo nada toxico y querian decirte de algun plan de juego? Digo en alguna situacion debe pasar eso... y es reportable","replies":[{"poster":"Voy Shaco","date":"2016-04-29T13:30:15.493+0000","up_votes":1,"down_votes":0,"body":"Para comunicarse están los ping´s,no es reportable,si lo fuera ese comando no existiria","replies":[]}]},{"poster":"Keops745","date":"2016-04-29T11:05:30.372+0000","up_votes":1,"down_votes":0,"body":"Yo los muteo siempre y te ayuda bastante si no queres estresarte mientras jugas y asi disfrutas mas el juego. {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"iLegault","date":"2016-04-29T09:51:04.216+0000","up_votes":1,"down_votes":0,"body":"Creo que antes de comenzar una partida deberias avisar que vas a mutear asi no haces problemas con la comunicación en equipo :)","replies":[]},{"poster":"Donlans","date":"2016-04-29T00:12:55.712+0000","up_votes":1,"down_votes":0,"body":"yo suelo hacer lo mismo en rank, sinceramente el 80% de las veces, los comentarios de tu equipo serán una mala influencia para tu juego.  siempre va a haber alguien con quien no se puede hablar.","replies":[]}]}