{"poster":"Shake and Bake","date":"2016-04-24T04:43:33.990+0000","title":"Por que Riot no pone URF permanente? aqui mi respuesta","subforum":"Charlas Generales","up_votes":2,"down_votes":24,"body":"Pues todos queremos el URF de forma permanente, es el modo de juego que a la mayor&iacute;a de jugadores nos encanta, nos relaja despu&eacute;s de unas rankeds, o nos divierte hacer tonterias con amigos, pero de forma limitada y seg&uacute;n lo que a Riot le parece &quot;la mejor idea&quot;, ponerlo 3 d&iacute;as, encerio? solo un fin de semana, ya que &quot;todos&quot; podemos jugar el fin de semana, yo no quiero jugar los fines de semana, el promedio de edad de la gente que me toca debe ser de unos 12 a&ntilde;os y se la pasan insultando, como si fuera la partida m&aacute;s importante, pikeando cosas como trundle o bardo para trolear a su propio team, es divertido, lo admito, cuando alguien que no conozco me trolea con una ulti de bardo me la paso bien, me divierte, pero que suceda con malas intenciones e insultando el resto de la partida molesta, el punto es, pudieron tranquilamente activarlo mas tiempo, una semana completa, yo elegir&iacute;a a que hora jugar, a que hora puedo, para poder hacerlo m&aacute;s c&oacute;modamente.\r\n\r\nAhora el porque Riot no lo hace permanente... seg&uacute;n Riot, no quieren que la gente se &quot;aburra&quot; del URF teni&eacute;ndolo siempre, de verdad? no, lo que sucede es que riot no quiere que el urf opaque el resto de modos, no quiere que la gente se pase jugando urf antes que normales o rankeds o etc, vamos, en serio? el dominio lo sacaron reci&eacute;n este a&ntilde;o y no lo jugaba ni Jes&uacute;s, y este modo que le gusta a una amplia mayor&iacute;a y no pueden poner ni siquiera de forma personalizada?. Qu&eacute; sucede, si Riot pone urf de forma permanente, descompagina el meta game, tendr&iacute;an que buffear/nerffear a campeones en base a normales y URF, lo que implica m&aacute;s trabajo, y como sabemos, en cuanto a trabajo, lo justo y necesario.\r\nAhora me pregunto yo, no podr&iacute;an ponerlo de forma personalizada? en una partida personalizada que no da ni xp ni ip, simplemente el hecho de jugar un urf para divertirse, relajarse. La gente jugara mucho si, pero para divertirse, a nadie le importa jugar urf para ganar llaves, cofres, ip, etc, juegan porque es muy divertido, se seguir&aacute;n jugando normales como siempre.\r\nTambi&eacute;n no les parece matar 2 pajaros de un tiro? poner un URF de modo &quot;&quot;&quot;&quot;&quot;&quot;Sandbox&quot;&quot;&quot;&quot;&quot;&quot; , muy muy justo podriamos llamarlo as&iacute;, no es, no es un sandbox, no es lo que la gente pide tanto, ese modo sandbox, sino el urf, donde podemos practicar combos, flashes, etc, sin esperar 5 minutos, tampoco es instant&aacute;neo como podr&iacute;a serlo en un sandbox, pero vamos, si no quieren trabajar en ello, por lo menos metanlo como URF, la gente solo se ingeniara y armara sus personalizadas de urf para practicar.\r\nY bueno, tengo otras opiniones por las que veo el porque riot no quiere hacer URF permanente, pero bueno, no creo que fuera correcto escribirlo en este foro, asi que hasta aqu&iacute; dejo mi parecer, y me gustaria ver que opinan.","replies":[{"poster":"Runth","date":"2016-04-24T05:01:41.919+0000","up_votes":5,"down_votes":0,"body":"el urf es como la moda, luego el tiempo se aburriran por seguir lo aburrido q elegir champs para una sola tecla","replies":[]},{"poster":"Fiky","date":"2016-04-24T06:58:19.633+0000","up_votes":4,"down_votes":0,"body":"no se, a mi no se me hace la gran cosa, me diverti las primeras 2 partidas, después ya cansa. Se que hay gente que le encanta pero bueno, gustos son gustos","replies":[]},{"poster":"Misery Business","date":"2016-04-24T04:49:17.108+0000","up_votes":4,"down_votes":0,"body":"La primera ves que lo juego, llevo unas 20 partidas masomenos y me aburrio un poco, siempe se eligen los mismos campeones...","replies":[{"poster":"Shake and Bake","date":"2016-04-24T04:51:13.949+0000","up_votes":1,"down_votes":8,"body":"Pues yo le tengo un lugar en mi corazón, desde el primero q salio, se vieron tantas cosas rotas y absurdas que fueron super divertidas aunque verlas en el team enemigo sean instadefeat","replies":[{"poster":"Franja","date":"2016-04-24T05:03:44.138+0000","up_votes":1,"down_votes":0,"body":"De donde sacaste que esa era la razon, tienes algun respaldo de esa info?","replies":[{"poster":"Shake and Bake","date":"2016-04-24T15:12:23.655+0000","up_votes":1,"down_votes":2,"body":"comprension de texto amigo, dije aqui MI respuesta, y si crees todo lo que dice riot de porque no pone urf permanente eres un poco ingenuo","replies":[{"poster":"Franja","date":"2016-04-24T16:04:11.505+0000","up_votes":1,"down_votes":0,"body":"Pequeñin, estoy seguro que puedes argumentar sin entrar a descalificar, vamos, que no es tan difici.","replies":[]}]}]}]}]},{"poster":"Rebkans","date":"2016-04-24T15:48:24.267+0000","up_votes":2,"down_votes":0,"body":"Por que decis que odos queremos URF permanente siendo que es mentira?\nNo generalices sin saber.\nHay mucha gente que se cansó del modo de juego en solo un fin de semana, imaginate lo que seria si lo pusieran permanentemente","replies":[]},{"poster":"Kleagle","date":"2016-04-24T15:41:50.248+0000","up_votes":2,"down_votes":0,"body":"URF es aburrido despues de unas partidas. Estoy totalmente de acuerdo con que no sea permanente.","replies":[]},{"poster":"Puynsi","date":"2016-04-24T15:25:34.107+0000","up_votes":2,"down_votes":0,"body":"Yo quiero que dejen urf asi los tryhards juegan ahi y dejan al resto rankear tranquilos.","replies":[{"poster":"Shake and Bake","date":"2016-04-24T15:27:13.005+0000","up_votes":1,"down_votes":4,"body":"guat? ajajaja conoces el concepto de tryhard?","replies":[{"poster":"Zabivaka","date":"2016-04-24T22:16:29.511+0000","up_votes":1,"down_votes":0,"body":"Si, pickear {{champion:238}} {{champion:157}} {{champion:28}} {{champion:35}} {{champion:54}} etc para ganar y nada más que ganar.","replies":[]}]}]},{"poster":"Hwaxinghz","date":"2016-04-24T15:15:02.704+0000","up_votes":2,"down_votes":0,"body":"Eso de jugar permanentemente Fizz, Zed, Lux, Blitz, Shaco y Ezreal ya aburre bastante, de hecho, yo jugué urf en 2014, 2015 y ahora en 2016 me pintó el aburrimiento, si no pickeas campeones rotos no ganas. Aburrido. Si no juegas con premades para contar chistes en las partidas, son mas para farmear PI que para divertirse.","replies":[{"poster":"Shake and Bake","date":"2016-04-24T15:24:42.890+0000","up_votes":1,"down_votes":0,"body":"Si es cierto, pero no veo eso como un problema del urf, lo veo como un problema de los que juegan, de la misma forma que en soloq se ve puros lee zed vayne.","replies":[]}]},{"poster":"martincarp","date":"2016-04-24T16:28:33.150+0000","up_votes":1,"down_votes":0,"body":"El primer año que pusieron URF literalmente jugué 3 partidas.\nEl año pasado jugué un poco más, pero aún así no jugaba porque quería, sino que jugaba porque jugaba en Skype y bueno, al menos la charla y escuchar al resto reírse era entretenido.\nY si bien este año verás solo URF en mi historial, la verdad es que solo una partida con Lulu REALMENTE me divertí, el resto fue lo mismo que el año pasado, jugar con amigos y divertirse en base a eso, no en base al modo de juego.\n\nY utilizando tu mismo ejemplo de Dominion, ¿recuerdas que en todas las notas del parche tenían que hacer algún que otro cambio para Dominion y 3v3? Eso es porque cada modo de juego tiene su propia meta, y lamentablemente URF también la tiene, y si se quiere tener el modo de juego permanentemente no queda otra que hacerlo \"justo\", y para hacerlo \"justo\" habría que balancearlo constantemente parche a parche, para que la misma meta varíe y el modo no se torne más repetitivo de lo que ya es con solo 3 días habilitado.\nY sumado a todo eso, el enfoque actual del juego es hacerlo lo más competitivo posible, llevándolo por el lado del juego colectivo, del juego en equipo. Fíjate que hoy en día jugar solo o de a 5 tiene distintos impactos en la misma cola, porque Rito quiere que ese sea el camino que tome League, el de todos jugando EN EQUIPO. Y URF no sería algo que ayude en ese sentido, porque si bien se puede jugar de a 5, jamás se jugará de manera competitiva, por lo que terminaría siendo un paso en falso en una dirección totalmente distinta a la que lleva el resto del juego.\n\nCreo que no hace falta aclarar que estoy totalmente de acuerdo en que URF permanezca como algo pasajero que vuelva eventualmente, ya que si fuera permanente terminaría siendo algo ajeno al resto del juego, justo como sucedía con Dominion (modo de juego que AMABA, pero que a su vez era de esperarse su desaparición).","replies":[]}]}