{"poster":"Celestael","date":"2017-01-27T04:46:32.591+0000","title":"Strange alternating game by game latency","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"My family moved recently and after setting up a brand new computer, installing updates and drivers included, I play League at night. Since moving I've experienced perfect connection followed by atrocious one and the only change I've seen in anything is it's based on every other game for the most part.\r\nFor instance, one game will be perfect ping at 50, it might spike to 120 at it's highest rarely, but otherwise consistent. The next game will be minimum 220, highest 410, so average 300. 50>300>50>50>300>300>50>300. That kind of pattern.\r\n\r\nI've done everything I can think of short of re-installing the entire game, reset router, modem, checked connection (strong connection), we're paying for high speed internet and have validated it as such, I'm very short distance from the router, and I've updated all the drivers and things I can find.\r\nHaven't found an easy way to look up this issue as it's oddly specific, so please I hope someone knows what this is. Thank you ^-^","replies":[{"poster":"Porocles","date":"2017-01-27T17:21:36.147+0000","up_votes":1,"down_votes":0,"body":"It sounds like there is an unstable connection to our game server that's degrading over time.  Run a [log reader](https://support.riotgames.com/hc/en-us/articles/209765743-Connection-Troubleshooting-Log-Reader) so we can get an overview of what's going on.  Let me know your results!","replies":[{"poster":"Celestael","date":"2017-01-27T23:33:11.113+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Porocles,realm=NA,application-id=osqw6G4M,discussion-id=Zl8tNBtz,comment-id=0001,timestamp=2017-01-27T17:21:36.147+0000)\n>\n> It sounds like there is an unstable connection to our game server that&#x27;s degrading over time.  Run a [log reader](https://support.riotgames.com/hc/en-us/articles/209765743-Connection-Troubleshooting-Log-Reader) so we can get an overview of what&#x27;s going on.  Let me know your results!\n\nLists average ping as 165ms, highest experienced was 401, average packet loss was 1.20%, though the graph displayed (looks like a barcode) shows a more close average among I assume latent games being 2.65%, two games as high as 5%.\nI can try a wired connection but I need to find the ethernet cable that was packed up during the move, we still have boxes absolutely everywhere.\nShould I go ahead and reinstall League to be safe? Most of the other solutions posted I've already looked into.","replies":[{"poster":"Porocles","date":"2017-01-28T00:12:16.596+0000","up_votes":1,"down_votes":0,"body":"Thanks for taking the time to do that and confirm some of my suspicions!  A re-installation wouldn't really do anything for your connection.  When you have some time available to troubleshoot, run through our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide for some steps.  The instructions should help tighten up your connection to the game server.  Let me know if you have any questions!","replies":[]}]}]},{"poster":"Quantum Lotus","date":"2017-01-27T05:27:55.945+0000","up_votes":1,"down_votes":0,"body":"It's not you, it's this patch. There is something wrong with the patch making some games have fucked ping. I had a game today were three of the people on my team got disconnected (including myself) for about a 5 minute period because of ping spiking to about 4k for all of us.\n\nThen the next game I had normal ping that would bounce to 1k ping. It's been happening to me in about all my games so I decided to stop playing for now. It could be a fault of your side but what I and many others are experiencing at the moment, is not coming from us. ","replies":[]}]}