{"poster":"CloudyMarc","date":"2016-11-23T19:01:44.210+0000","title":"my client dosent update","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"so i open LOL and i press the launch button after a good while it opens and it says that it need to do some neccesary updates and then the countdown starts. once it finishes it open a square that has the logo of league of legends and below it theres a bar thats shows you how much its updating. but as soon as that square appears the bar is full and is stuck at 55.3 out of 55.6MB and it just stays there.\r\n\r\nalso when i open the task manager i scroll down and i see 3 other league client things open im not sure if this is usefull. i hope anyone can help me solve this issue. my brother had the same issue last night","replies":[{"poster":"CloudyMarc","date":"2016-11-23T21:32:07.377+0000","up_votes":1,"down_votes":0,"body":"do i have to do all of them? or just 1 cause i did 2 allready ._. \n\nand yes its on the new client \n\noh i opened league after i did those 2 things and now its updating fine :) thank you so much u need a raise jaja {{item:3301}} ","replies":[{"poster":"Porocles","date":"2016-11-23T21:40:11.766+0000","up_votes":1,"down_votes":0,"body":"It's super important that all the steps are completed.  This will rule out many possibilities and more likely to get this all resolved.","replies":[]}]},{"poster":"Quality Broccoli","date":"2016-11-23T21:39:04.161+0000","up_votes":1,"down_votes":0,"body":"had the same issue, i just switched back to legacy client and it fixed it, its some bug with the new client","replies":[]},{"poster":"Porocles","date":"2016-11-23T19:49:22.080+0000","up_votes":1,"down_votes":0,"body":"Is this the updated client?  What percent is it stopping it?  It sounds like you might be having permissions problem, especially if you're having multiple apps lingering behind because it can't load.  Your best bet may be to go over each step of the [permissions](https://support.riotgames.com/hc/en-us/articles/204134104-Setting-up-your-Permissions) guide to make sure league is allowed access to scan game files and launch.  Hope this helps!","replies":[]}]}