{"poster":"SuperYeti110","date":"2016-02-17T14:55:10.683+0000","title":"Chatnachrichten verschwinden BITTE GENAU LESEN","subforum":"Hilfe & Support","up_votes":2,"down_votes":0,"body":"1. Lieber Riot Mitarbeiter (oder wer auch immer) dieser Thread ist der 2. Versuch einer Diskussion w&uuml;rden sie ihn diesesmal bitte GENAU durchlesen\r\n2. Das Problem: (DIE PROBLEME TRATEN VOR DEM VERWENDEN DER APP ACUH AUF) Wenn ich mit einer Freundin schreibe verschwinden einfach rdm die Chatnachrichten...\r\nAu&szlig;erdem benutze ich die App: Messenger for LoL. Das Problem trat bereits vor dem herunterladen der App auf jedoch gibt es seit dem noch ein weiteres Problem. Wenn ich eine Nachrichten per App verschicke kommt sie manchmal nicht an und wird auf dem PC auch nicht angezeigt... Diese Nachrichten kommen dann allerdings auch nicht bei dem Partner an. Das geschieht auch anders herum.\r\n\r\nhttp://puu.sh/nbfqv/d164997df0.jpg (Handy)\r\nhttp://puu.sh/nbftT/39c3c5df86.jpg (PC)\r\n\r\nbtw. Hier der grund warum mein 1. Thread entfernt wurde... http://puu.sh/nbhTK/4c81db4f01.png\r\nFalls ich etwas missverstanden habe bitte erkl&auml;ren und den Thread nicht direkt l&ouml;schen, denn ich habe kein problem mit der App...","replies":[{"poster":"Zulwar","date":"2016-02-23T14:20:17.598+0000","up_votes":1,"down_votes":0,"body":"Wieso im Client ist doch alles da.","replies":[]},{"poster":"My time to Chîme","date":"2016-02-23T14:15:24.241+0000","up_votes":1,"down_votes":0,"body":"(Betrifft nur den von Riot bereitgestellten Chat - KEINE 3. ANBIETER SOFTWARE [Messenger for LoL]) Ein Weg das Nachrichten \"_verschwinden_\", ist falls man Ingame auf direkte msgs. Antwortet. **(\"/r\") **In diesem Fall werden einem nach dem Game, bzw. bei raustabben, im Client nur die Nachrichten des Gegenüber angezeigt und nicht die eigenen. \n\nFalls deine Internetverbindung über W-Lan läuft oder du anderweitig Störungen in deiner Leitung (Upload) hast könnte es ebenfalls passieren, dass hier Nachrichten verschluckt werden.","replies":[]},{"poster":"Revilous","date":"2016-02-17T19:25:43.244+0000","up_votes":1,"down_votes":0,"body":"Habe ein ähnliches Problem, wenn ich jmd was schreibe dann tauchen meine Nachrichten vor den zuerst gesendeten Nachrichten auf was sehr verwirrend ist.","replies":[{"poster":"SuperYeti110","date":"2016-02-17T19:51:58.734+0000","up_votes":1,"down_votes":0,"body":"ich hab das Problem zwar nicht bei lol aber dafür bei Skype xD","replies":[]}]},{"poster":"PròópaGandalf","date":"2016-02-17T15:28:35.099+0000","up_votes":1,"down_votes":0,"body":"Es ist eine Drittanbieter App, und nicht von Riot. Deswegen wurde der Thread gelöscht steht doch in der Begründung deswegen gehört es nicht ins Forum.","replies":[{"poster":"SuperYeti110","date":"2016-02-17T15:38:27.068+0000","up_votes":1,"down_votes":0,"body":"Es liegt ja nicht an der App da mehrere Nachrichten vor dem Benutzen der App auch schon nicht ankamen.  Dies steht auch im Thread... deswegen genau lesen.","replies":[{"poster":"PròópaGandalf","date":"2016-02-17T15:42:24.817+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SuperYeti110,realm=EUW,application-id=7hciEY9w,discussion-id=gVqZEkwg,comment-id=00010000,timestamp=2016-02-17T15:38:27.068+0000)\n>\n> Es liegt ja nicht an der App da mehrere Nachrichten vor dem Benutzen der App auch schon nicht ankamen.  Dies steht auch im Thread... deswegen genau lesen.\n\nDas ist aber kein Problem von Riot sondern von der App deswegen musst du die Entwickler der App ansprechen","replies":[{"poster":"SuperYeti110","date":"2016-02-17T16:14:32.637+0000","up_votes":1,"down_votes":0,"body":"ich kann aller höchstens vorstellen das die app einige nachrichten abfängt o.ä. ... allerdings hatte ich das Problem das nachrichten nicht ankamen auch schon bor dem installieren der app","replies":[]}]}]}]},{"poster":"Marksmansitter","date":"2016-02-17T15:52:23.441+0000","up_votes":1,"down_votes":0,"body":"Dein Lehrer istn ganz schöner Teemo das er dir deswegen nur eine 3 gibt ..#RIPelo","replies":[{"poster":"SuperYeti110","date":"2016-02-17T16:04:28.765+0000","up_votes":1,"down_votes":0,"body":"jop xD","replies":[]}]},{"poster":"BloodCrystalx3","date":"2016-02-17T15:26:41.174+0000","up_votes":1,"down_votes":0,"body":"Wenn du diesen Löschgrund bekommen hast, ist diese App wohl keine von Riot selbst.. :)","replies":[]}]}