{"poster":"Storiaron","date":"2018-03-16T09:09:39.788+0000","title":"fps drop","up_votes":2,"down_votes":1,"body":"Hali\r\nTegnap este &oacute;ta nagyon kem&eacute;nyen leesett az fps-m, 100-120 k&ouml;r&uuml;lről 20-30 -ra. M&aacute;s is tapasztalt ilyet? Gyan&uacute;s, hogy kb a piros z&aacute;szl&oacute; &oacute;ta ilyen, de nem tud erről valaki valamit?","replies":[{"poster":"cybernet343","date":"2018-03-16T15:33:33.995+0000","title":null,"up_votes":2,"down_votes":1,"body":"Én is tapasztaltam, de nem minden meccsen, csak olykor-olykor üt be, akkor viszont végig.\nNagyjából egy hete tűnt fel először. Átlag 100 fps körülről 40 alá esik, úgy ,hogy semmi nem fut mellette a háttérben.\nMegnéztem windows feladatkezelőben, a LeagueClient olyankor szünet nélkül a CPU kapacitás 24-30%-át lefoglalja és sosem hagy alább, mígnem kikapcsolom a klienst. Tudtommal ez eddig nem volt így, az utóbbi időben kezdtem tapasztalni és most is rendszertelenül. Ma 2 aram meccsem volt. Az első simán ment, a szokásos jó teljesítmény mellett. A másodiknál jött a drop és akkor fedeztem fel a kliens nagy fogyasztását. Manuálisan kikapcsoltam és helyre rázódott.\nMúlt héten ugyanez rögtön az első elindított meccsnél beütött. \nA háttérben nem futott semmi más, erről megbizonyosodtam (de még ha úgy is lett volna, akkor sem dropol ennyit az fps-em, ha játék közben youtube-ról zenét hallgatok. És ez beszédes). \nA kliens alsó kategóriás módban futott mindig is, a drivereim és PC komponeneseim nem cserélődtek, a fenti példából pedig látszik, hogy megjósolhatatlan, hogy mikor jelentkezeik a probléma.","replies":[{"poster":"Storiaron","date":"2018-03-16T16:39:31.584+0000","title":null,"up_votes":2,"down_votes":1,"body":"Yep,csodálatos :/\n\nPedig ezúttal jó gépem is van, de gyakorlatilag a teamfightok már játszhatatlanok.","replies":[]},{"poster":"Attish87","date":"2018-03-19T14:00:20.824+0000","title":null,"up_votes":1,"down_votes":1,"body":"Nalam is egy hete kezdodott es kb jatszhatatlan a jatek,mar mindennel probalkozom de sehogy sem akar helyrejonni :\\","replies":[]}]},{"poster":"Priestee","date":"2018-03-29T18:57:44.157+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ugyan ez a probléma, nekem most 10 fps-ig süllyedt le... Játszhatatlan az egész","replies":[]},{"poster":"csibizolee","date":"2018-03-19T15:51:59.292+0000","title":null,"up_votes":1,"down_votes":1,"body":"Hali!\n\nNekem tegnap jelentkezett és gondoltam újra rakom és megoldódott. Erre ma megint 20 fps. Elég gáz, hogy alapban 200-300 fps és erre ez van. Tényleg nincs erre valami megoldás???","replies":[{"poster":"Storiaron","date":"2018-03-19T16:59:42.328+0000","title":null,"up_votes":1,"down_votes":1,"body":"A support annyit írt, hogy a hextech javító cuccost futtassam végig és küldjem el nekik az eredményt. Szóval inkább újraindítottam a gépet és rendbe jött. Amit azért nem értek mert egyből még aznap az első dolgom az volt, hogy újraindítsam, de nagyon nem néztem meg h most mi van, csak örültem, hogy működik.","replies":[]}]},{"poster":"Attish87","date":"2018-03-19T13:58:12.732+0000","title":null,"up_votes":1,"down_votes":1,"body":"Nalam is ez van mar 2 hete es nem tudok vele semmit sem kezdeni,nekem 200rol esik vissza 70re es borzalmas meg bugos az egesz jatek.... az utolso frissites ota ez megy....","replies":[]},{"poster":"Gregori","date":"2018-03-16T13:54:59.942+0000","title":null,"up_votes":1,"down_votes":1,"body":"Piros zászló?","replies":[{"poster":"Shikaichi","date":"2018-03-16T15:17:14.586+0000","title":null,"up_votes":1,"down_votes":1,"body":"Tegnap egy hiba miatt leállították a rankedet egy időre, és ugye kint volt egy piros felkiáltójel itt és a kliensben is.","replies":[{"poster":"Gregori","date":"2018-03-16T15:45:27.408+0000","title":null,"up_votes":1,"down_votes":1,"body":"Ó, hogy erre gondolt. El nem tudtam képzelni, hogy mégis milyen \"zászlóról\" beszélhet...","replies":[{"poster":"Storiaron","date":"2018-03-16T20:08:11.019+0000","title":null,"up_votes":1,"down_votes":1,"body":"Most h mondod mégsem olyan egyértelmű. Gondoltam mindenkinek feltűnt, de aztán eszembe jutott h ez kb 10 óra után lehetett.\n\nEgyszer akartam este rankedezni, de akkor is leállítják a dolgot...","replies":[]}]}]}]}]}