{"poster":"Top River King","date":"2015-09-28T18:47:47.076+0000","title":"Good Plan or Not?","subforum":"Tips & Tricks","up_votes":2,"down_votes":0,"body":"I&#039;ll keep this as short as I can. On my first account (http://na.op.gg/summoner/champions/userName=EkkoFroffles) I started ranked _way_ too early. No runes. Nonexistent champion pool. Only able to play one role (top) semi-competently. Crap warding and CSing. Went 2-15 (12%) in pre-season. It wasn&#039;t until about a month into season 5, with my record at 36-54 (40%), that I started figuring crap out. I knew which champions I was best with, started learning the other roles properly (rather than just winging it), expanded my champion pool, and focused heavily upon warding and CSing.\n\nSince that point in the season, I&#039;ve gone 78-68 (53%). My overall win ratio stands at 48% (114-122), only 8 games off of 50%. However, thanks to starting a combined 38-69 (36%), climbing has proven especially difficult on that account. At one point, I won 6 in a row, yet only gained half the LP I eventually lost for the match that ended that streak. After a while, I grew disheartened and took an extended vacation from ranked to work on improving. In that time, I became a support main.\n\nAfter months off, I randomly decided to play ranked again and started 4-0. But the next 4, in which I went 0-4, killed my spirit once more. Match 1, the enemy Jax went ballistic (35/6/2). Match 2, only I finished with fewer than 10 deaths. Match 3, Swain didn&#039;t join the match until 20+ minutes in. Match 4, our Ashe was toxic (not to mention bad), Garen was almost as bad as her, Skarner eventually left (probably due to Ashe raging at him all match), and Anivia might as well have left, since her impact was nonexistent (0/6/2). Please don&#039;t read these as excuses. I underperformed in all 4, and they weren&#039;t all unwinnable. My point is, I was tilted and put off of ranked once more.\n\nIt was around this time that I chose to start over on a new account, the one I&#039;m currently posting under. I want to go through provisionals with a clean slate, give it my absolute best shot, and see where I land without anything to hold me back. If it&#039;s bronze again, so be it. Now, the plan I came up with to best tackle this is to spend my limited IP on champions who are versatile and/or act like a second support for your team. Here&#039;s what champions I&#039;ll have come tomorrow&#039;s champion and rune sales, excluding the 450 champions I bought solely to insure I was over the champion minimum for ranked and don&#039;t intend upon playing.\n\n{{champion:32}}{{champion:1}}{{champion:22}}{{champion:51}}{{champion:245}}{{champion:86}}{{champion:40}}{{champion:127}}{{champion:117}}{{champion:99}}{{champion:54}}{{champion:57}}{{champion:111}}{{champion:98}}{{champion:15}}{{champion:223}}{{champion:161}}{{champion:19}}{{champion:62}}\n\nOf those 19, only Amumu, Ashe, Caitlyn, Garen, Janna, Sivir, and Warwick aren&#039;t able to play 2 or more roles. But they were all chosen for very specific reasons. Amumu for the fact that he's my best jungler (and the one who functions most like a support); Ashe and Sivir for their utility even when behind; Caitlyn and Warwick for their safety/ease of use&#039; Garen because I have more playtime with him than anyone, and because he&#039;s quite strong since the rework; and Janna for the fact that she&#039;s the best support in the game, statistically speaking (and one I&#039;ve grown to love).\n\nSo, do you think this was a good strategy? Or should I have invested in more champions with carry potential? Oh, and in case you were wondering, I have experience with most of these champions, even if most of that experience is in one role. In other words, I wasn&#039;t about to choose a champion I&#039;m not particularly confident about simply for their versatility or support-like qualities.","replies":[{"poster":"OhBoyItsaMegaman","date":"2015-09-28T20:48:28.367+0000","up_votes":1,"down_votes":0,"body":"> I want to go through provisionals with a clean slate, give it my absolute best shot, and see where I land without anything to hold me back. If it's bronze again, so be it.\n\nI'm sure this part of the post isn't what you wanted feedback on but I feel like I have to point this out. \"Where you land\" is not necessarily where you belong. Placement matches only give a very rough idea of what division you will ultimately settle into 100 games later. Ten games simply is not enough feedback to tell you your skill level with any degree of confidence.\n\nIf you place into Bronze, I would not recommend accepting that as evidence that you belong in Bronze. If you place into Silver, I would not recommend assuming that you belong in Silver.","replies":[{"poster":"Josheheh","date":"2015-09-28T21:13:20.159+0000","up_votes":1,"down_votes":0,"body":"provisionals are actually hilariously inaccurate. I got placed in silver 4 upon literally powerleveling my first account to 30 and immediately doing ranked. Since then, I'm like 7-20 or something in ranked because I learned how to play one champion (garen, yeah......) and just played that in normals.\nbut hey, i have a 100% winrate for the 3 games I got to play garen in ranked.","replies":[]},{"poster":"Top River King","date":"2015-09-28T21:00:00.051+0000","up_votes":1,"down_votes":0,"body":"I'm playing past the provisionals. Unless I somehow get gold or higher. In that case, I'll probably just rest on my laurels until next season, so as to insure I get the ranked rewards, then see if I can replicate and maintain that in a full season. Otherwise, I'm going to play as much as I can before the season comes to a close because I know that my rank after provisionals isn't a true indicator of where I am as a player. All I meant with that comment is that I want to see 1) how much higher I can land than B3, which is where I somehow found myself back in pre-season and 2) and to see what my skill ceiling (if I rank high) or skill floor (if I rank low) is at the moment.","replies":[]}]}]}