{"poster":"TotesKind","date":"2017-07-04T13:58:39.778+0000","title":"BUG Vladimir Q last hit","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Hello,\r\nriot plz fix vladimir Q.... thx\r\n\r\nJa da ich in letzter Zeit sehr oft Vladimir spiele, ist mir aufgefallen, dass wenn ich mit meiner Q(egal wieviele stacks) versuche, ein lane minion zu t&ouml;ten, dieser aber so wenig hp hat, das dieser w&auml;hrend meiner Q - Animation durch z.b. Eins meiner Minions get&ouml;tet wird, dann bekomm ich 1. das Gold f&uuml;r das minion nicht    2. Mein Q geht auf cooldown        3. Mein Q heilt mich nicht und gibt mir auch kein stack.\r\nSchlimm ist nicht so, aber es nerft wenn der Q dann auf cooldown ist.","replies":[{"poster":"TotesKind","date":"2017-07-04T14:07:44.174+0000","up_votes":1,"down_votes":0,"body":"ok Danke für Ihre Antwort.\nDas wusste ich nicht^^ Danke für die Aufklärung","replies":[{"poster":"SFCFlo","date":"2017-07-04T14:40:34.186+0000","up_votes":2,"down_votes":0,"body":"Das ist so gewollt, also kein Bug.\n\nDas findet man bei vielen point and click Spells, da diese Spells für das Last hitten wie autoattacks funktioniern.\n\nDa ja jeder Spell eine Cast time hat und die entfernung bis zum Minion auch berücksichtigt wird, kann es dazu kommen, dass der Spell erst gewirkt wird wenn das minion schon tot ist.\nDas selbe findet man z.B. bei \n{{champion:13}}  sein E\n{{champion:63}}  sein E\n{{champion:38}}  sein Q\n\nUnd es gibt sicher noch ein paar.","replies":[]}]},{"poster":"Lagbeard","date":"2017-07-04T14:03:35.732+0000","up_votes":2,"down_votes":0,"body":"Das ist relativ normal. Wenn dein Ziel stirbt, bevor deine Fähigkeit durch ist, verpufft sie und geht trotzdem auf Cooldown. Es gibt Ausnahmen, wie zum Beispiel die Cait Ulti, aber im allgemeinen gilt für Fähigkeiten wie für Autoattacks: Der Angriff findet statt, also geht der Spell auf Cooldown/wird der AA Timer gesstartet. Ob dann irgendwas getroffen wird, ist dafür unerheblich. \n\nFalls Vladimir eine dieser gewollten Ausnahmen ist, dann ist es tatsächlich ein Bug. Das weiß ich allerdings nicht, da ich ihn nicht spiele.","replies":[{"poster":"19Apfel91","date":"2017-07-04T14:06:37.877+0000","up_votes":1,"down_votes":0,"body":"Das mit der Vladimir Q ist schon seit einer langen Zeit so das heißt es ist höchst wahrscheinlich kein Bug.\n\nLG Apfel","replies":[]}]}]}