{"poster":"ThePunkRocker","date":"2016-03-10T18:13:17.663+0000","title":"Odio Speedy y te lo cuento.","subforum":"Off-topic y temas personales","up_votes":2,"down_votes":2,"body":"Buenas resulta que hace  3 semanas empeze con cortes de internet cada una hora fija, llame y vinieron como 4 veces a casa en estas 3 semanas, me boludearon bla bla bla y no me lo solucionaron, pedi telecentro desesperado el otro dia y recien el miercoles me lo instalan (20mb), alguno q tenga telecentro y me diga cuantos ms juega en las porfa, yo cn speedy cuando andaba bien -_- me tiraba 53 ms fijos, tengo un amigo q es de capital que juega a 35 ms y en brasil le tira  30, pero como soy de zona sur no se si me andara igual.. si alguno tiene telecentro y tmb juega en br para joder que me diga cuantos ms tiene ahi les agradeceria mucho :)\r\n\r\npd: uan dey speedy, uan dey {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Lucrexio","date":"2016-03-10T18:59:57.961+0000","up_votes":2,"down_votes":0,"body":"La verdad cualquier otra es mejor que Speedy, siempre hacen lo mismo, te dan unos meses y despues empieza a funcionar como el traste, a mi me tuvieron que cambiar el modém una vez, y también el cableado que sale a la calle (cada vez que llovia eran 150ms fijos, y los videos de youtube a 360p), tardaron más de 4 meses para hacer cada cosa, encima a los bobos los llamas para pedir que manden cuadrilla para hacer los cables, y te mandan al mongolin con el modem de prueba.... GG Speedy.\nMi caso es peor porque encima donde yo vivo no llega ninguna otra línea, a mi en particular me gusta Fibertel, en su momento cuando vivia más en el centro eran 3mb que parecian 10.\n\nEstoy seguro que telecentro es una mejor inversión, saludos!","replies":[]},{"poster":"ZanahoriaAsesina","date":"2016-03-10T18:42:18.834+0000","up_votes":2,"down_votes":0,"body":"Decírmelo a mi, todavía sigo usando Speedy 1Mb (y en realidad me envían menos, y no se puede hacer nada):\n\n* Juego con 61ms fijos, si es que no hay tormentas.\n* Durante un invierno tuve que hacer más de 19 reclamos porque no recibía la velocidad mínima que contrate.\n* Una vez uno de los técnicos vino a mi casa por un arreglo y me recomendo que me cambiara a Telecentro.\n* El mismo tipo usa Telecentro porque dice que Speedy es una reverenda zanahoria.\n* Solo por una cuadra de diferencia no me pueden dar más velocidad, imagínate yo tengo 1Mb raspando y el pibe de la esquina tiene 20Mb.\n\nConclusión cámbiate a Telecentro, yo no me cambio porque ya me acostumbre y me manejo sin problemas, por ahora pero si ves que te anda tan mal es obvio que deberías intentar por otro camino.\n\nSaludos !","replies":[]},{"poster":"Ruphian","date":"2016-03-10T18:32:10.579+0000","up_votes":4,"down_votes":2,"body":"Yo no lo odio pero tampoco me gusta, en gral. ninguno de los personajes de los looney tunes me gusta.","replies":[]},{"poster":"Nombre ofensivo","date":"2016-03-10T19:14:23.518+0000","up_votes":2,"down_votes":1,"body":"como ex trabajador de speedy te digo que el lol te va a correr a unos 34-40ms, lo mismo que fibertel","replies":[]},{"poster":"Hwaxinghz","date":"2016-03-10T21:37:01.378+0000","up_votes":1,"down_votes":0,"body":"Yo tengo Arnet y no se me corta nunca, con 50 MS, lamentablemente no puedo cambiarme a otro proveedor. Conozco gente que tiene Fibertel y le anda perfecto a 30-40 ms y gente que tiene telecentro y le anda entre 25 y 35 ms.\n\nYo te digo algo, Telecentro es la top conexión \"familiar\" en cuanto a estabilidad, calidad de servicio y velocidad de Argentina. Te digo porque tengo amigos que tienen hasta 300 MB de telecentro que le anda extremadamente bien, sin lag hasta en NA, imagínate. Ahora, lamentablemente solo está disponible en un sector, mucha gente también se queja que el servicio le anda mal (inclusive estando en Zona Norte), pero calculo que son los días de reparación.\n\nPor ejemplo, Arnet tiene como \"reparaciones\" los días Jueves y es el único día que me levantan 20 ms extra, pero el resto de los días me dejan el ping normal y no me tiran menos velocidad de lo contratado.","replies":[]},{"poster":"Tryhard X","date":"2016-03-10T19:44:52.782+0000","up_votes":1,"down_votes":0,"body":"Yo tengo telecentro 40 megas y en las me andaba a 44 ms.. Ahora en br me anda a 35!\nTelecentro es lo mejor al menos en zona norte!","replies":[]},{"poster":"Icesoul","date":"2016-03-10T18:33:40.519+0000","up_votes":1,"down_votes":0,"body":"Yo tengo 3 mb y me tira entre 75 y 80 de ping, igual yo creo que es el que mas safa porque todos los servicios famosos te terminan estafando y dan un mal servicio, realmente no hay ninguno hasta ahora, de los conocidos que haya dicho: \"so super buenos y es el mejor servicio\", a mi, cada vez que tengo un problema tardan un poco en venir y si me quedo sin internet, porque ya me ha pasado, de no tener una semana, luego el descuento se lo pasan por donde no les llega la luz, aunque el servicio de internet anda bien.","replies":[]},{"poster":"Misery Business","date":"2016-03-10T18:29:48.832+0000","up_votes":1,"down_votes":0,"body":"TEngo 2 conexiones de Speedy y cuando cambo entre una y otra andan igual de lagueadas las 2 al mismo momento, es una cagada.","replies":[]},{"poster":"IG HarleyQueen","date":"2016-03-10T18:20:27.009+0000","up_votes":1,"down_votes":0,"body":"Yo tengo telecentro con 20mb , y me anda joya queda en 35 clavaditos y anda re light! por suerte es muy raro que te suba el lag, anda ten points! {{summoner:6}}","replies":[]}]}