{"poster":"Kätzchan","date":"2015-02-21T19:25:31.631+0000","title":"Ranked: Unverschuldetes Absteigen","subforum":"Hilfe & Support","up_votes":2,"down_votes":2,"body":"Hallo erstmal (=\r\n\r\nMein Freund hat das Problem, dass er in dieser Season in der Mitte von Silber eingestuft wurde, hat sich hochspielen können bis zur Silber 1 Promo, diese zwei mal verschossen und ist seitdem auf dem absteigenden Ast. \r\n\r\nMan könnte meinen er spielt einfach zu schlecht, was ich allerdings entschieden verneinen muss, da er gut mit Goldspielern mithalten kann. Natürlich spielt er nicht perfekt, wobei das auf Gold niemand tuhen sollte. Das Problem scheint in meinen Augen einfach zu sein, dass er keine Carry Rolle in dem Sinne einnimmt, soll heißen: Er spielt Support / Tanks wodurch er in einem *\"normalen\"* Team glänzen kann und die Rolle einnimmt, die auch in seinen Rankedspielen stets benötigt werden. Trotzdem hat er das Problem, dass er, wenn er nicht verhindern kann, dass Top und Mid 0/5 aus der Lane gehen, welches er selbst nicht verhindern konnte, da diese Lanes von sich aus versagen (gegen den Lanegegner sterben) oder nicht hören wollen, wenn man sie weg pingt, etc. \r\nDiese Loosingstreak läuft mittlerweile seit etwa 20 Games bei meinem Freund und es scheint auch nicht wieder besser zu werden.\r\n\r\nDie Frage die sich mir jetzt stellt: \r\nLässt das System es überhaupt zu, dass man sich ziehen lassen kann von seinem Team oder verlangt es an gewissen Punkten, dass man selbst diese entscheidende Rolle einnimmt? \r\nIch selbst habe das momentan als Supportmain, wenn ich in der Goldpromo lande und sehe, dass Lanes versagen und nicht einmal auf Tipps hören wollen (zusätzlich kommt noch das Problem welches durch Smurfs entsteht hinzu, welches ich aber hier außer acht lassen möchte).\r\n\r\nBitte beachtet, dass Tipps wie \"spiel Kata, Yasuo, etc.\" nicht sonderlich hilfreich sind, da in solchen Spielen zu 90 % dann eben diese *supportenden Charactere* fehlen würden und es ebenso wenig das Ziel vom System sein kann (sollte), dass die Spieler genötigt werden, eben solche \"OP\" Champions zu spielen.\r\n\r\nDanke schon einmal im Voraus (=","replies":[{"poster":"UltimateLuzifer","date":"2015-02-21T19:34:14.773+0000","up_votes":3,"down_votes":0,"body":"JEDER Teil eines Teams trägt entscheidend zu Sieg/Niederlage bei. Daher ist es völlig egal, ob man eine \"Carry-Rolle\" spielt oder nicht. Ist man gut gewinnt man öfters ist man schlecht halt ned. Der Supporter trägt zum Sieg bei genauso wie der Midlaner. Das zeigt sich spätestens, wenn man mal versucht ein 4 gegen 5 zu gewinnen. Dabei ist es nämlich egal, ob der Supporter oder der Jungler afk ist, man hat einfach keine gute Chance.","replies":[]},{"poster":"Pyuri","date":"2015-02-21T21:48:19.637+0000","up_votes":1,"down_votes":0,"body":"Ich finde diese Frage absolut berechtigt und ich glaube ich weiß ganz genau wie es deinem Freund ergeht. \n\nIn dieser Season ist irgendwie der Wurm drin. Ich habe genau das selbe Phänomen.  \n\nIch erzähl mal meine Storry:\n\nLetzte Season war ich \"Gold\"\nWurde Silber 3 eingestuft.\nHab 2x die Promo zu Silber 2 versemmelt und danach kam eine Loose Serie die wohl Satan persönlich für mich kreiert hat.\nIch bin wirklich in Mitte von Silber 4 gelandet.  Und erst dann ging es wieder Berg auf.\n\nSo weit Berg auf bis ich wieder in der Promo zu Silber 2 Wahr. Auch diese  Promo habe ich tatsächlich 2x versemmelt aber diesmal war die Loose Serie so enorm hoch das ich Silber 5 mit 0 Punkten gelandet bin. \n\nIch weiß nicht genau wie dieses System im Ranked so genau Funktioniert aber es fühlt sich so an, als wenn die Spieler eben ein sortiert werden um eben ein Dynamisches Match zu erzeugen das sowohl Spieler mit Carry Potenzial als auch Spieler mit geringen Potenzial zusammen würfelt. Und wenn entsprechende Spieler das SPiel nicht carryen können sinkenden die Sieges Chancen ins bodenlose.\n\nIch habe keine Ahnung, ich lese diesen Beitrag und denk mir nur, \"ja... JA VEDAMMT, genau so fühlt es sich an!\"\n\nKennt jemand eine Seite wo vielleicht erklärt wird nach welcher Systematik dieses System arbeitet?\n\nKönnte was diese Frage betrifft eventuell aufschlussreich sein und solche Loose Serien erklären. Und wenn man es besser versteht, warum man jetzt in so einer Loose Serie ist kann man sich vielleicht mehr mühe geben etwas dagegen zu tun. Denn ich fühle mich in solche Loose Serien total machtlos.","replies":[]},{"poster":"HeTossMySalade","date":"2015-02-21T20:56:42.726+0000","up_votes":1,"down_votes":0,"body":"Dein Freund ist einfach zu schlecht für Gold. Du auch. Wenn ich kenn Unmengen an Leuten die durch Support only Gold kommen. Und in High Silber gibt es kaum Smurfs, da diese direkt in Gold landen. Sorry aber ihr scheint euch falsch wahrzunehmen.","replies":[]},{"poster":"TieKey 1337","date":"2015-02-21T19:28:43.077+0000","up_votes":1,"down_votes":0,"body":"Auf die Antworten hier bin ich mla gespannt ^^","replies":[]},{"poster":"BootyHunterRengo","date":"2015-02-21T19:38:35.663+0000","up_votes":1,"down_votes":1,"body":"mein letztes SPiel war ich 8/3, das Team zsm 14/28...\njeder nur am flamen, das bot premade natürlich besonders am feeden...\nund weiter abwärts gen Bronze 5...\n\ner soll sich nen duo suchen der plat oder so ist, diesem einen Bronze Account besorgen und dann gecarryt werden ohne selbst zu feeden. Das würde ich als mögliche Option sehen. wenn der adc nicht allzu schlecht ist, kann man ja auch als Annie/Thresh Support(meine beiden Mains) das Spiel gewinnen. speziell wenn man die Lane gewinnt, damit den Gegner aus dem Spielnimmt und mit ein wenig Glück den gegnerischen Jungler beschäftigt.\n\nSo kann sich der eigene Jungler mit den 2 weiteren Lanes beschäfftigen und möglicherweise zumindest eine davon gewinnen\n\naußerdem sollte man nach jedem verlorenen Spiel etwas Essen/Sport machen...die Engländer nennen es tilt, ein deutsches Äquivalent fällt mir nicht ein. die Ablenkung hilft zumindest dagegen.","replies":[]}]}