{"poster":"Excelionz","date":"2019-05-17T07:44:17.207+0000","title":"Neue Champions für bestimmte Zeit nicht für ranked zulassen.","subforum":"Champions & Gameplay","up_votes":9,"down_votes":6,"body":"Es geht wieder los, Yuumi {{champion:350}}  wurde released und sie weiß einfach nicht was sie tun soll. 4 andere Spieler müssen darunter leiden, weil Riot es nach Jahren immer noch nicht geschafft hat neue Champions für das ranked zu sperren. Es ist nurnoch nervig. Die ersten 2 Wochen nach einem Champion release sind im ranked unspielbar weil jeder den neuen Champion spielen möchte. Dadurch erhöht sich die Wahrscheinlichkeit auf eine Niederlage beträchtlich. 3 Games in Folge verloren weil Yuumi {{champion:350}}  praktisch nicht teilnahm. Die einfache Lösung ist Yuumi für 2 Wochen im ranked zu sperren, damit jeder der sie ausprobieren möchte ein normales Spiel starten muss. Was sagt ihr dazu? Es kommt nicht in Frage sie einfach zu bannen. Das tilted die Teammates nur unnötig und ein wertvoller ban geht verloren den man unbedingt braucht da es zu viele Champs gibt die kein balancing erfahren.","replies":[{"poster":"Chrislybär","date":"2019-05-17T17:26:53.927+0000","up_votes":2,"down_votes":2,"body":"weniger rumheulen , mehr spielen\n\nDanke.","replies":[{"poster":"Black Spongebob","date":"2019-05-25T13:59:56.723+0000","up_votes":2,"down_votes":0,"body":"Typische Non-Sense Diskutierer. Völlig ohne Argumente, Begründung und Beispiele etwas in den Raum werfen und für schlechte Stimmung sorgen. Geh bitte","replies":[{"poster":"Chrislybär","date":"2019-05-25T18:28:04.935+0000","up_votes":1,"down_votes":1,"body":"Typischer rumheuler. Geh bitte","replies":[]}]}]},{"poster":"Dela The Rascal","date":"2019-05-17T10:19:10.954+0000","up_votes":3,"down_votes":1,"body":"Gebe dir absolut recht und sehe keinerlei Ausrede dafür warum man es nicht einführen sollte das man 5-10 Games mit einem Champion im normal gespielt haben sollte bevor man damit ins Ranked geht. Aber naja .. Riot halt .. Mit Quality of Life haben die es nicht so .. hauptsache Kohle","replies":[{"poster":"Alustus","date":"2019-05-17T12:09:29.711+0000","up_votes":2,"down_votes":0,"body":"5-10 Spiele verändern nicht wirklich was.\nDavon abgesehen gibt es viele Smurfs etc, auch würde es wenig ändern ich habe ziemlich jeden Champion schon 5-10x gespielt nur ist das schon Jahre her und ich keinen plan mehr von diesen habe.\nWenn du das pro Season machst dann müssen Spieler die um die 20 Champions spielen 200 Normalgames in 9 Monaten spielen was bei einigen \nSpielern mehr ist als sie Normalerweise Spielen.\nAuch ist das ganze auch für High Elo Spieler problematisch die mehrere Account brauchen um Champions zu trainieren ohne gleich hunderte LP zu verlieren\n\n2 Wochen ist gerade für den Professionellen und semiprofssionellen Bereich problematisch da diese keine Gegner in Normal Games bekommen bei denen sie wirklich schwächen des Champions bzw. counterplay wirklich sehen können.\nAuch gibt es sehr viele Spieler die nur Ranked Spielen sprich wenn man eine 2 Wochen Champ Speere einführt dann verschiebt sich das Problem nur um 2 Wochen und löst dieses nicht\n\nDas sind jetzt zwar alles nicht die Mega Gründe, aber es ist nicht so das es keinen contra gibt.\nUnd ja der Hauptgrund wird das Geld sein.","replies":[]}]},{"poster":"Released Ape","date":"2019-05-17T09:52:33.823+0000","up_votes":2,"down_votes":0,"body":"Was ist mit der Person die jetzt Yuumi mehr gespielt hat als einen älteren Champion? Wenn dann müsste es etwas Erfahrungsbezogenes und nicht zeitlich begrenztes sein. So wie der Vorschlag von \"I bims Jayce\" das man mindestens 10 Games (ARAM nur eingeschränkt dazuzählen) oder ähnliches vorher mit dem Champion gemacht haben sollte bevor man ihm ranked spielen darf. Sollte nicht zu extrem sein und verhältnismäßig bleiben.\n\nIch mag es heute immer noch nicht, wenn jemand X reinpickt in ein Team das gar nicht gut für ihn ist und er dann schon extrem gut spielen muss um einen Nutzen zu haben. Die Leute picken selbstverständlich was sie wollen und daran wird man nichts ändern können, ich akzeptiere dann einfach den Pick und manchmal ist es gar nicht so schlimm wie erwartet und manchmal eben die erwartete Katastrophe. Ich kann Yuumi nachdem Hotfix bei jemanden der sie jetzt öfter gespielt hat nicht mehr einschätzen, ich denke da sie langsam Richtung 40 % Winrate geht.\n\nDu kannst auch wenn es keine optimale Lösung ist paar Tage auf Ranked verzichten oder mit jemanden Duo spielen der Support spielt, der Hype um den neuen Champion klingt in wenigen Tagen stark ab.","replies":[]},{"poster":"Xayah Strife","date":"2019-05-17T08:22:42.769+0000","up_votes":2,"down_votes":1,"body":"Selbst Support spielen und hoffen das der Gegner Yuumi picked und damit scheisse baut? :)\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Necromant","date":"2019-05-17T07:50:32.677+0000","up_votes":2,"down_votes":1,"body":"Theoretisch ist es ein 50/50 weil dein Team als auch das des Gegners den Champion picken können.\nDarüber sei gesagt das Leute ihren Champion nicht unbedingt beherrschen müssen, egal wie lange der Release schon her ist. Es gibt nicht umsonst immer noch Leute die mit Champs below 100k ins Ranked gehen.","replies":[{"poster":"TEA H3roHirsch","date":"2019-05-19T15:46:51.124+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Necromant,realm=EUW,application-id=Wj1wcocU,discussion-id=BAVdXG8E,comment-id=0000,timestamp=2019-05-17T07:50:32.677+0000)\n>\n> Theoretisch ist es ein 50/50 weil dein Team als auch das des Gegners den Champion picken können.\n> Darüber sei gesagt das Leute ihren Champion nicht unbedingt beherrschen müssen, egal wie lange der Release schon her ist. Es gibt nicht umsonst immer noch Leute die mit Champs below 100k ins Ranked gehen.\n\nJa, es ist ein 50/50... rng ist kacke","replies":[]}]},{"poster":"GameWave","date":"2019-05-25T16:11:18.883+0000","up_votes":1,"down_votes":0,"body":"Also Yuumi wurde Released und ich habe sie instant im Ranked gespielt und ich gewinne seitdem deutlich mehr Spiele als ich verliere ^^","replies":[]},{"poster":"Black Spongebob","date":"2019-05-25T13:58:14.013+0000","up_votes":1,"down_votes":0,"body":"Bin absolut deiner Meinung. Die Idee hatte ich auch schon. Aber anscheinend wird der Fokus nicht auf besseres Matchmaking und Championbalance gelegt, sonder darauf, die Spieler immer weiter dazu anzuregen, RP zu kaufen...Sehr enttäuschend. {{item:3070}}","replies":[]},{"poster":"Napoleon2587","date":"2019-05-18T07:50:28.573+0000","up_votes":1,"down_votes":0,"body":"Dann bitte aber auch in Normals für 2 Wochen verbieten, den Champion zu bannen, damit man nicht immer 10 Versuche benötigt um einen neuen Champion zu testen. Das es immer Leute gibt, die, ohne den Champion selbst gespielt oder gesehen zu haben, präventiv bannen bloß weil er neu ist und Youtuber XY gesagt hat er wäre KOMPLETT OP nervt.","replies":[]},{"poster":"Aymira","date":"2019-05-17T20:36:12.979+0000","up_votes":1,"down_votes":0,"body":"An sich sehe ich nichts schlechtes an der Idee, neue Champions für die Ranglisten-Spiele für eine gewisse Zeit erstmal rauszunehmen. \nAndererseits muss ich ehrlich sagen, das es mir schon ewig nicht mehr passiert ist, das irgendwer wie blöde Etwas das erste Mal im Ranglistenspiel spielt und dann komplett mieserabel ist. \n\nMir ists daher egal, da ich nach Gefühl auf 20 Spiele vielleicht eine Person hab die mich stört... Das hält sich in Grenzen. xD\nUnd wenns doch mal überhand nimmt. Was spricht dagegen sich selbst erstmal ’ne Weile aus den Ranglisten fernzuhalten bis sich die Lage beruhigt hat? :D","replies":[]},{"poster":"Icebergslasher","date":"2019-05-17T19:23:44.915+0000","up_votes":1,"down_votes":0,"body":"ich hab nur wieder angefangen mit lol wegen yuumi. und hab sie im ranked ausprobiert und da hab ich versagt. aber ab dem zweiten game eig konstant gut gespielt für meine elo. und momentan ne winrate von 60% mit ihr. und einige games die verloren wurden, war nicht aufgrund von botlane sondern von den anderen, also kann mans noch etwas nach oben setzen. wieso sollte riot nen champ bannen nur weil er neu ist?\n\nich finde zB die assasins gehören gebannt weil no risk, high reward ;)","replies":[]},{"poster":"MidlaneGod115","date":"2019-05-17T16:16:03.896+0000","up_votes":2,"down_votes":2,"body":"Wenn man nicht gerade Gold oder schlechter ist, hat man doch keine Gegner in Normal Games um einen Champion zu testen...","replies":[]}]}