{"poster":"iUmaru","date":"2017-10-12T15:41:54.359+0000","title":"I really dont get why riot doesn't accept me as the creator of the account","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I really dont get why riot doesn't accept me as the creator of the account, first of all I literally provided all the information I can before I got banned, and riot doesnt accept it. So they've decided to ask my questions about the pass of my account, which is like really around 6-7 years ago, how am I suppose to remember informations like date of birth and what champions I bought 7 years ago, like come on, stop playing around and unban my account, its really getting so frustrating as I had to create tickets again and again for recovery and I've 100% provided the correct information, but they still dont unban me, can someone rioter please help me out, I'm so frustrated by the fact that I literally told them everything I know and they still dont unban my account. I want to get back to the rift..","replies":[{"poster":"Porocles","date":"2017-10-12T16:17:27.522+0000","up_votes":1,"down_votes":0,"body":"Our account team will only restore access if they can verify ownership without a shadow of a doubt.  Unfortunately, sometimes will try to gain unauthorized access and we want to be super cautious for the protection of your account.  Even if you don't pass the first time, it's totally fine to fill out another [account recovery form](https://support.riotgames.com/hc/en-us/requests/new?ticket_form_id=72416) and try again!","replies":[{"poster":"iUmaru","date":"2017-10-12T16:23:35.898+0000","up_votes":1,"down_votes":0,"body":"I;ve tried out numerous times of submitting different tickets and providing all the information I can, however it just tells me that im not the owner, we cant unban the account, how can i remember something from 7 years ago, despite that I can tell them all my information for the recent ones before I got banned, and they dont verify me as the owner.","replies":[{"poster":"Porocles","date":"2017-10-12T16:26:10.636+0000","up_votes":1,"down_votes":0,"body":"It sucks that we weren't able to recover your account yet.  :(  Unfortunately, we aren't able to do anything on the boards about this.  Your best bet is to keep trying and to do your best with remembering what you can.  Hang in there, friend.","replies":[{"poster":"iUmaru","date":"2017-10-12T16:32:19.878+0000","up_votes":1,"down_votes":0,"body":"its been 2 weeks... sigh :( im not happy about this at all","replies":[]}]}]}]}]}