{"poster":"OG Noah do Bree","date":"2015-07-14T19:49:55.453+0000","title":"Mis ultimas Rankeds","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":0,"body":"Escribo este post para que varios jugadores pierdan el miedo a jugar clasificatorias, y de paso que intenten ser abiertos ante ciertas situaciones que se pueden dar.\r\nSoy de jugar muy pocas rankeds debido a que solo juego cuando me siento en buen nivel, ademas de que solo juego duo con un amigo debido a que me siento mas confiado al saber que sabe leer mi juego.\r\nHace un mes empece con una racha muy buena que me dejo bien parado y en promoci&oacute;n as&iacute; que me pregunte a mi mismo &iquest;que fue lo que paso para que de gravitar en el medio de mi liga desde hace meses, pase a conseguir esta racha que me dejo en promo?.\r\n Primero en todos los equipos que jugu&eacute; encontr&eacute; jugadores maduros y con ganas de ganar en vez de insultar, de hecho me encontraba en partidas en las que mi equipo se re&iacute;a de que nadie estaba flameando, de hecho hasta en la derrota mi equipo no flameaba; por lo que eso que se dice de que siempre te vas a encontrar con trolls y flamers es mentira en cierto punto, y cuando te los encontras lo que hay que ver es la actitud que tomamos al respecto. \r\nEsto ultimo me lleva al segundo tema de esta racha: mi actitud hacia los jugadores ego&iacute;stas. Hace tres rankeds me encontraba como primer pick as&iacute; que me vi en la oportunidad de usar al campe&oacute;n que mejor usaba en ese momento {{champion:1}} para no dejar dudas al respecto en el chat escribo &quot;voy mid&quot;, la fase de picks sigui&oacute; tranquila hasta que el ultimo del equipo pickea una {{champion:55}} y pone una excusa tonta como que no estaba leyendo el chat, ante este panorama resignado tenia dos opciones, insultarlo por troll y mandarlo de support (que estaba en mi derecho) o bancarmela e ir al bot. A mi esa de la justicia en ranked no me va y porque de verdad quer&iacute;a ganar la partida avise que iba support (con runas y maestr&iacute;as de mid porque no llegue a cambiarlas). Resultado: Carrito desde el bot que por tener una buena configuraci&oacute;n ganamos f&aacute;cil la linea (cosa que dudo que pase con la kata abajo), y victoria sencilla. Esta flexibilidad ayuda mucho a la hora de ganar partidas, ya que si podes transformar un pick de un rol a otro, podes cubrir los baches que tenga el equipo. En mi ultima partida pickie una {{champion:25}} para jugar supp, pero en el siguiente pick el enemigo eligi&oacute; una {{champion:7}} y mi amigo me dijo que no tenia nada con que contrarrestar a esa campeona as&iacute; que le dije que fuera supp en mi lugar y que yo con Morgana pod&iacute;a sobrevivir f&aacute;cil en el mid, resultado? carrito del bot, mientras yo con mi Morgana aportaba da&ntilde;o y utilidad en las tf mientras anulaba a una no fedeada Le Blanc.\r\nOtra de las excusas que tambi&eacute;n escucho a menudo es la de &quot;me tocan siempre gente afk&quot;, admito que esta es la peor situaci&oacute;n posible y me paso en la partida antes de entrar en promo. Que hice? insulte al top que se quedo afk? naaa me dedique a sobrevivir al campeo que me hab&iacute;an hecho  y espere al mid game. Tranquilice a mi jg que estaba furioso y sorprendentemente empezamos a ganar las peleas logrando un exterminio, ya para el final de la partida se logro reconectar el jugador afk y, si gan&aacute;bamos un 4 v 5 imaginensen un 5 v 5 GG!\r\nEscrib&iacute; esta experiencia para ayudar a los que tienen el surrender f&aacute;cil a que intenten buscar soluciones a los problemas que pasan en las rankeds, si se tienen fe en si mismos y en los campeones que eligieron, lo mas probable es que puedan dar vuelta una situaci&oacute;n adversa, y como pregunta final: ante un afk o un egoista que se pasa por encima tu pick &iquest;como se lo toman?","replies":[{"poster":"Jonshi","date":"2015-07-14T19:55:30.725+0000","up_votes":1,"down_votes":0,"body":">  pregunta final: ante un afk o un egoista que se pasa por encima tu pick ¿como se lo toman?\n\nPues, en lo personal, no me toco alguien que saltee mi pick (porque siempre voy supp), pero me lo tomo con preocupacion al afk. Porque siempre perdes una parte del damage/tank/sustain/cc/etc, y no sabes como jugarla.","replies":[{"poster":"OG Noah do Bree","date":"2015-07-14T20:23:06.672+0000","up_votes":1,"down_votes":0,"body":"Lo se, lo que pasa es que muchos se rinden sin pelear, pero se por experiencia que existen ocasiones en las que una composición es tan fuerte, o un equipo es tan superior que aun 4 v 5 logran ganan las tf, por lo que se puede ganar las partidas si lo aprovechas","replies":[{"poster":"Jonshi","date":"2015-07-14T22:48:22.468+0000","up_votes":1,"down_votes":0,"body":"SI es que piensan como pickear segun el momento...\n(Porque pickearon casi todos full AD (yo iba con Sona), por lo que se armaron armor todos los enemigos y gg. Ademas nuestro team se estaba armando magic resistance)","replies":[]}]}]},{"poster":"Li Grim","date":"2015-07-14T21:48:07.737+0000","up_votes":1,"down_votes":0,"body":"Respondiendo a tu pregunta, la verdad, me irritaría mucho ese tipo de errores en selección de campeón, pero no cedería mi linea, he tenido muchos problemas cuando le doy linea a alguien que elije después, la mayoría de las veces me ha pasado que este invocador que le cedo mi puesto termina muy mal, dejándonos las cosas difíciles para mid game.\n\nEn mi caso, los sujetos con los que juego son de otro tipo, son de los que recriminan todo lo que uno hace, desde la build hasta humillar a uno por el chat global, pondré solo 2 casos\n\n-(un jugador hace primera sangre y rompe torre enemiga, pero sigue pusheando y no advierte las mias)\"Ya me gankearon 3 veces, y tu? jungla \"$&~@#\"\n\n-(el top enemigo tpea a bot, lo acompaña el jungla y se convierte en un 4vs2) \"GG top, no usó tp, se quedó ahí\"\n\nPues eso, no se qué hacer para calmarlos, a veces les digo que por favor no peleen y que tengan la mente fría porque o si no, no ganarán simplemente, pero en la mayoría de las veces recibo a modo de respuesta un: \"ya no ganamos, gg team/surrender\"","replies":[]},{"poster":"Hwaxinghz","date":"2015-07-14T21:08:38.399+0000","up_votes":1,"down_votes":0,"body":"Los egoístas me tocaron, y demasiado, uno pickea por ejemplo Morgana Mid, Lux Mid o Nidalee Mid y piensan que vas a trollear o que vas a ir support, entonces te sale algún yasuo, kata o LeBlanc intentando ir mid (cuando vos ya dijiste mid), claramente no querías ir soporte y terminaste yendo soporte (en mi caso digo) y el resultado: Mid aliado fediando al mid enemigo, se queja del jungla que no lo gankea (cuando nosotros estábamos muy pusheados por el enemigo y el top aliado estaba perdiendo también), el punto es que nadie del equipo le dijo nada (muchas veces pasó, no fue reciente tampoco), minuto 11, le dió 5,3,4,6,8 kills al mid enemigo (Talon, Zed, Katarina, Kog'Maw y Ezreal respectivamente en las partidas que me pasó, ellos enemigos), el jungla enemigo permagank en bot, el jungla aliado perma gank top y el mid flameando a 2 manos, se termina yendo afk y claramente perdemos.\n\nMoraleja, cuando te tocan egoístas lo mejor que se puede hacer es mutear, no hagan lo que yo que perdía el tiempo leyendo las estupideces que escribe un egoísta, al final uno la termina \"cagando\" (no se me ocurrió otra palabra perdón gente) y ¿A quién le echan la culpa? Al suppor (por no wardear) y al jungla (por no gankear)... Dat elo.\nTampoco fui santo, he hecho muchas cagadas en las partidas pero no tanto para regalar 8 kills e irme afk, por ahí un flash que me sale mal, un heal que no sale a tiempo (o no me di cuenta de tirarlo a tiempo), perseguir una kill, etc. Un sin fin de cosas que pasan porque a veces a uno no se da cuenta, que se yo. Cosas que pasan. Pero nunca al extremo.\n\nLo que me molesta realmente son los flammers y los rague Quit (flammers con intención de joder partidas e irse afk). Por ahí ese es el miedo mío hasta jugando normales, nunca puedo dejar el chat sin mutearlo culpa de esa gente y la verdad me molesta bastante y hacen que me sienta realmente mal haciendo mi experiencia del juego un tanto negativa. (SIEMPRE EXCLUYENDO AQUELLAS PARTIDAS que juego en premade con mis compañeros usando SKYPE y tal, que nos divertimos de verdad)","replies":[]}]}