{"poster":"OG Noah do Bree","date":"2015-06-02T00:01:06.115+0000","title":"Comportamiento inentendible (pregunta a la comunidad)","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":1,"body":"Hay algo que no se puede entender, como la gente se puede rendir tan r&aacute;pido en una partida clasificatoria? \r\nTodav&iacute;a me acuerdo de mi primera ranked (estaba muuuy verde) cuando mi primer gankeo sale mal y dos de mi team ponen a la vez en chat /all &quot;gg&quot; (dame un respiro).\r\nLa raz&oacute;n por la que creo esto es por algo que me movi&oacute; en mi ultima ranked, me toca ultimo pick as&iacute; que tengo ventaja de conocer como hacer counter a mi enemigo (ped&iacute; ir supp por si dudan XD). Veo que el enemigo pickea a {{champion:53}}  asi que mi respuesta fue facil, uso a {{champion:25}}  y con el escudo negro ni va a tocar a mi adc. La partida en fase de lineas estaba muy re&ntilde;ida, ese blitz estaba jugando demasiado bien, me llego a enga&ntilde;ar dos veces de una manera muy buena para matarme.\r\nHasta ac&aacute; todo bien, partida peleada 3-3 en bot hasta que llega un gankeo de nuestro jg... uso mi ulti y hacemos doble kill y rompemos torre.\r\nAc&aacute; cambio completamente la actitud del {{champion:53}}, rotaciones sin sentido, se dejaba matar sin mas. Toda la partida desencadeno en una masacre a nuestro favor, terminamos muy bien con mi adc.\r\nEsto es lo que me dejo intranquilo, hasta que punto uno puede rendirse as&iacute; de f&aacute;cil, ese tipo estaba jugando muy bien, se notaba que conocia al campe&oacute;n y que la diferencia era muy remontarble en el mid game.\r\nAs&iacute; que le hago la pregunta a los que ponen gg facil:\r\n&iquest;que los hace rendir asi de facil?\r\n&iquest;como un tipo que juega tan bien la partida puede darla por perdida al min 15?\r\n\r\nTodav&iacute;a me sigo preguntando el porque, espero que me ayuden a resolver este problema","replies":[{"poster":"Desaroll","date":"2015-06-02T00:32:10.274+0000","up_votes":1,"down_votes":0,"body":"Muchas veces, he visto adcs que flamean al support de manera muy insoportable.\n\nJuego support y solo me pasó una vez, pero puedo entender (Aunque no comparta) a la gente que decide rendirse de esa manera.\n\nYo no lo hice en aquella ocación, pero cuando mi adc me dijo: \"Andate de mi linea\", recuerdo que le dije al top: \"Che, te molesta un support en top?\", y de ahí cambie de linea, ya que preferí eso a pelearme con mi adc.\n\nAlgunos ADC no entienden el tema de que un support puede counterear a otro. Por ejemplo tu con morgana seguramente arruinaste algunos ganchos del blitz. Si el adc lo flameó por no \"hacer buenas Q\", como si fuera facil (Cosa que siempre **parece** facil cuando el blitz/thresh saben lo que hacen), si el blitz era orgulloso decidió tirar la partida para hacerselo pagar.\n\nNo es la mejor decisión en mi opinion, pero si una posibilidad.\n\nEs decir, no la tira por perder, si no por actitudes.\n\nSuerte.","replies":[{"poster":"tacito92","date":"2015-06-05T03:38:32.224+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Desaroll,realm=LAS,application-id=PJAKt7ph,discussion-id=jRk8vg7v,comment-id=0000,timestamp=2015-06-02T00:32:10.274+0000)\n>\n> Muchas veces, he visto adcs que flamean al support de manera muy insoportable.\n> \n> Juego support y solo me pasó una vez, pero puedo entender (Aunque no comparta) a la gente que decide rendirse de esa manera.\n> \n> Yo no lo hice en aquella ocación, pero cuando mi adc me dijo: \"Andate de mi linea\", recuerdo que le dije al top: \"Che, te molesta un support en top?\", y de ahí cambie de linea, ya que preferí eso a pelearme con mi adc.\n> \n> Algunos ADC no entienden el tema de que un support puede counterear a otro. Por ejemplo tu con morgana seguramente arruinaste algunos ganchos del blitz. Si el adc lo flameó por no \"hacer buenas Q\", como si fuera facil (Cosa que siempre **parece** facil cuando el blitz/thresh saben lo que hacen), si el blitz era orgulloso decidió tirar la partida para hacerselo pagar.\n> \n> No es la mejor decisión en mi opinion, pero si una posibilidad.\n> \n> Es decir, no la tira por perder, si no por actitudes.\n> \n> Suerte.\n\nsoy main soporte, tendria que verte jugar para saber por que se enojo, yo aveces cuando juego adc, tambien pido a mi soporte que valla a otro lado cuando veo que no me sale rentable que me este ayudando, por lo cual seria mejor 2 contra 1 que el 2 contra 2 que plantea el soporte, por ahi tiene mala racha y el quedarse en mi linea solo fomentara su rage.","replies":[]}]}]}