{"poster":"ssem507","date":"2016-10-23T00:49:03.110+0000","title":"Help I cant reinstall American LOL after I came back from Korea C++ error","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So during summer break I went to Korea and downloaded the korean server during my stay there. But when I uninstalled it and tried to reinstall the North American server it wouldn't work. First a \"Command line option syntax error. type command / for help\" thing would pop out then a \"Visual c++ 2005 sp1 redistributable x64 mandatory prerequisite was not correctly installed\" would pop out. I tried everything, looked up ways I could solve this issue but nothing is working. I think I even tried to download the c++ 2005 thing but there was a error for that too. I'm stuck and would really appreciate some help.","replies":[{"poster":"Targons Blade","date":"2016-10-27T04:04:14.320+0000","up_votes":1,"down_votes":0,"body":"This typically happens if there are a few different issues going on. I suggest first updating Windows to ensure your OS is completely up to date. Next, uninstall any existing versions of C++ 2005 on your PC before installing a fresh copy from [this link.](http://www.microsoft.com/en-us/download/details.aspx?id=3387)\n\nLet me know if this helped.","replies":[{"poster":"ssem507","date":"2016-12-19T09:09:42.168+0000","up_votes":1,"down_votes":0,"body":"I updated everything in my windows though there was one thing (graphic adapter?) that wouldn't update. I uninstalled all existing C++ 2005 and tried to install your link but a syntax error popped out and wouldn't let me install it. The error that popped out when I try to install league was (x64) not (x86)....I tried to install both, and one without the other but nothing works. (x86 wouldn't install at all). \nWhen I checked my programs there were C++ 2008 and 2012 both (x64) and (x86) versions existing. I didn't want to touch them just in case my other programs use them, but could they be the problem?","replies":[{"poster":"Targons Blade","date":"2016-12-20T00:25:21.510+0000","up_votes":1,"down_votes":0,"body":"Not being able to install the graphics driver and C++ package is definitely not good. It could mean there are corrupt or missing files in your Windows installation and you may need to run a repair or complete reinstallation of Windows. As a last-ditch effort, I recommend performing a clean boot, then try running that C++ installation as admin by right-clicking on the executable and selecting *run as administrator*.\n\nI hope this worked for you.","replies":[{"poster":"ssem507","date":"2016-12-22T00:04:43.540+0000","up_votes":1,"down_votes":0,"body":"I tried the clean boot and run as administrator and unfortunately it didn't work.\nJust in case I searched 'riot' in my computer and tried to delete whatever was left but there were a couple of files that wouldn't delete. Could they be the corrupt files? Though they aren't windows installation....\nAlso, I tried to download the korean server and for some reason it worked? Why would the korean server work but not North American?\nThank you for trying to help me!","replies":[{"poster":"Targons Blade","date":"2016-12-26T21:45:48.685+0000","up_votes":1,"down_votes":0,"body":"I recommend we escalate this to our tech team so we can take a closer look at what's going on. You can run a set of system logs using our [**HRT App**](https://support.riotgames.com/hc/en-us/articles/224826367), then attach them to a [**support ticket**](https://support.riotgames.com/hc/en-us/requests/new) so we can get back to you.\n\nLet me know if you have any questions.","replies":[]}]}]}]}]}]}