{"poster":"GurenShiki","date":"2016-08-23T17:52:30.859+0000","title":"Help niveles bajos","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"1. Hoy viendo jugar una partida a mi pareja de nivel 15 me causo mucha impotencia ver como perd&iacute;a solo porque una persona del otro equipo sabia jugar, pienso que deber&iacute;a haber una mejor distribuci&oacute;n de equipos para las partidas, hoy en d&iacute;a los niveles bajos son solo gente con cuentas smurf que flamean a quienes no saben jugar, deber&iacute;a haber una separaci&oacute;n clara, porque por este tipo de cosas es que ya casi ni hay gente que quiera ingresar al juego de nivel bajo.No es agradable estar destinado a perder solo porque esta lleno de smurf. Pido por favor que se intente arreglar esto.","replies":[{"poster":"Sirek","date":"2016-08-23T18:19:55.222+0000","up_votes":2,"down_votes":0,"body":"Tienes que entender una cosa, que en nivel 15 todavia el juego no busca que ganes, si no que compres RP... no mentira... busca que aprendas para que al llegar a Nivel 30 puedas rankear ya con una idea básica de como jugar. Ahora, si le toca gente smurf a tu pareja lo mejor es que aprenda, como por ejemplo: Por que no le hacemos tanto daño? por que no pegamos tan fuerte como el? etc..\n\nAhora, si ese smurf flamea no corresponde, y se debe reportar. Hay gente que simplemente en la vida no son felices y al momento de jugar, como se creen superiores, tratan de humillar a los demás. \n\nLo mejor que puede hacer es tener oídos de piedra y reportar al final... las palabras son simples palabras, no más que eso, y sabemos que en este servidor cuando llegue tu pareja a rankear, los flamers se multiplicaran. \n\nDile que se divierta y que se ria con las enfermedades mentales de la gente y que al final siempre que le toque un flamer lo reporte. Que no se haga mala sangre por gente así,.","replies":[]},{"poster":"TheSnow13","date":"2016-08-24T14:55:08.147+0000","up_votes":1,"down_votes":0,"body":"Yo empece a jugar normals después de jugar unas 500 partidas contra bots, al principio me costo muchísimo y notaba que los otros era muy buenos (En ese tiempo no sabia que carajo era smurf), solo es cosa de agarrarle la mano, ademas si haces premade con tu novia siendo Gold no es muy sorpresivo que le toque con gente plata-oro, yo te diría que te crees una smurf y jueges con ella hasta que veas que tiene nivel suficiente como para ganar a gente bronce I para arriba :P","replies":[]},{"poster":"Sonya Kyron","date":"2016-08-23T18:40:00.848+0000","up_votes":1,"down_votes":0,"body":"Y vos pones a tu novia en nivel 15 a jugar contra LVLs 30 con todas las runas maestrias y 1000 ganadas.\nQue se juegue primero 200 partidas contra bots y despues empiece.\nEntrenala bien, yo hasta que no gane en las custom 1 vs 3 bots ni me tire a jugar normales de PVP.","replies":[{"poster":"AutistaKun","date":"2016-08-23T20:41:06.909+0000","up_votes":1,"down_votes":0,"body":"Esa es la duda que tenia,si el hace premade siendo oro con un level 15,obviamente le van a  tocar smurfs, silver y goldies.\nAun usando una cuenta creada,detecta que sos smurf y te empareja con smufs","replies":[{"poster":"Sonya Kyron","date":"2016-08-24T01:11:53.303+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AutistaKun,realm=LAS,application-id=v7qsfXsE,discussion-id=RiPYW0Fi,comment-id=00060000,timestamp=2016-08-23T20:41:06.909+0000)\n>\n> Esa es la duda que tenia,si el hace premade siendo oro con un level 15,obviamente le van a  tocar smurfs, silver y goldies.\n> Aun usando una cuenta creada,detecta que sos smurf y te empareja con smufs\n\nNo detecta, te empareja pror winrate cuando sos smurf, entonces si tenes un smurf con 90% de winrate te van a tocar algunos jugadores iguales.","replies":[]}]}]},{"poster":"AutistaKun","date":"2016-08-23T18:21:59.073+0000","up_votes":1,"down_votes":0,"body":"Todos pasamos por eso,aunque no lo recordemos,cuando creamos nuestra cuenta(en mi caso la primera)nos toco jugar en contra de smurfs,tengo como 4 cuentas y te digo que si jugas mas o menos bien,riot empareja a los smurfs con otros smurfs en su mayoria,a un primerizo level bajo(que juegue mas o menos bien)cuanto mucho le puede tocar algun  smurf de silver,y si bien hay una diferencia de conocimiento,no es abismal  (sin contar los casos especiales de las premades)","replies":[]},{"poster":"Lunari Red Mask","date":"2016-08-23T18:21:49.013+0000","up_votes":1,"down_votes":0,"body":"Hola, sin irme mucho de tema y sin leer demasiados comentarios que probablemente digan lo mismo, te recomiendo jugar contra bots hasta lvl 20.  De ahí comprate runas lvl 3 y entonces subi a lvl 30 más tranquilo.","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-08-23T18:16:53.077+0000","up_votes":1,"down_votes":0,"body":"Yo no sali de bots hasta nivel 20 :p","replies":[]},{"poster":"Lince Salvaje","date":"2016-08-23T18:02:43.374+0000","up_votes":1,"down_votes":0,"body":"que tengan una idea de el juego no quita que la cuenta sea lvl bajo como la suya.....\ny si alguien flamea se reporta y listo, si ves que la persona \"sabe\" jugar  que  aprenda de esa persona y listo o enseñale tu.\n\nesa persona puede haberse creado una \"smurf\" por muchos motivos, ademas quien te dice que es muy poca la gente que inicia ? donde estan los datos que te abalan ?","replies":[]},{"poster":"Klozer","date":"2016-08-23T18:01:16.281+0000","up_votes":1,"down_votes":0,"body":"Si pudre jugar con gente con experiencia mas sabiendo que sos lvl bajo.. El tema que es imposible saber para Rito cual es una cuenta Smurf o sea esta lleno por solo querer joder a los lvl bajos o porq le Permabaneraron la cuenta de lvl 30.. Jaja.. Hasta creo que no es Reportable ser Smurf creo yo si no me equivoco..","replies":[]}]}