{"poster":"SUN Void ","date":"2017-07-18T15:49:43.513+0000","title":"Ma la 1FA??????","subforum":"Mappe e modalità","up_votes":5,"down_votes":1,"body":"Ragazzi ma che fine ha fatto la One For All? &egrave; una vita che non viene messa in rotazione, sinceramente mi manca, era divertente fare i deficienti tra amici tutti con lo stesso champ XD\r\nRioter, potete per cortesia valutare di rimetterla in rotazione? avreste 5 player felici ^^","replies":[{"poster":"Jeanne dˆArc","date":"2017-07-18T16:01:30.165+0000","up_votes":1,"down_votes":0,"body":"> _**Perché Leggenda del Re dei Poro e Ascensione appaiono più spesso rispetto alle altre modalità in rotazione?**\nPuntiamo sempre a creare nuove modalità e a rilasciarle con la maggior frequenza possibile (quest'anno abbiamo pubblicato Luna di Sangue e Stella Oscura). Purtroppo, non possiamo sfornare una modalità Stella Oscura al mese. Tra una novità e l'altra, invece di avere dei weekend vuoti, riportiamo alla ribalta alcune modalità amatissime (come Ascensione e Re dei Poro), in modo che ci sia sempre qualcosa da giocare e prendersi una pausa dal gioco principale. Ci sembra un'alternativa migliore al non aver niente da giocare tra una grande novità e l'altra. Alcuni potrebbero ricordare che prima della rotazione gestivamo le modalità in questo modo, e il silenzio tra un'uscita e l'altra era lungo (circa 3 mesi, ai tempi). In questo modo c'è comunque qualcosa di divertente da fare nei weekend, anche se è qualcosa di già visto.\nStiamo anche lavorando sulla compatibilità del nuovo client con le vecchie modalità in rotazione più di successo (Uno per tutti, Hexakill), ma a volte nello sviluppo dei giochi ci vuole pazienza. Stiamo lavorando al tutto in parallelo alle nuove modalità (tipo: Luna di Sangue e Stella Oscura). La buona notizia è che ora abbiamo i Bot dell'apocalisse nel nuovo client! Le nuove modalità sono anche gratuite in termini di sviluppo, essendo state progettate da zero nel nuovo client, quindi sono molto più facili da riproporre (Luna di Sangue è appena ripartita e Stella Oscura tornerà presto).\nL4T3NCY, Lead Designer, Rotazione delle modalità di gioco_\n\n[Chiedi a Riot: Ancora il Re dei Poro?](http://euw.leagueoflegends.com/it/news/community/q/chiedi-riot-ancora-il-re-dei-poro)","replies":[{"poster":"Kim114","date":"2017-07-18T16:34:55.072+0000","up_votes":1,"down_votes":0,"body":"del tipo, le modalità non vanno fatte a ciclo ma quando vogliamo noi","replies":[{"poster":"Jack Garrus","date":"2017-07-19T07:27:24.897+0000","up_votes":1,"down_votes":0,"body":"Sottovaluti tutto l'ambaradan che serve per tenere su tutte le modalità","replies":[{"poster":"Kim114","date":"2017-07-19T10:47:18.893+0000","up_votes":1,"down_votes":0,"body":"Sono daccordo, mica la 1 for all o ARURF sono modalità leggere, ma vogliamo rimetterle o dobbiamo giocare solo a re del poro e ascenzione? Assalto alla torre non avviene da un bel pò!","replies":[{"poster":"Jack Garrus","date":"2017-07-19T12:07:37.326+0000","up_votes":1,"down_votes":0,"body":"Dal tuo precedente commento sembrava volessi avere tutte le modalità insieme così da poter scegliere quello che vuoi quando vuoi, perciò ti ho fatto presente che sarebbe un costo assurdo per Riot.\nBtw si, ci vorrebbe un po' più di varietà","replies":[{"poster":"Kim114","date":"2017-07-19T12:25:22.653+0000","up_votes":1,"down_votes":0,"body":"noooo ma che dici, il launcher esploderebbe; scusa se mi sono spiegato malissimo","replies":[{"poster":"Jack Garrus","date":"2017-07-19T15:16:13.615+0000","up_votes":1,"down_votes":0,"body":"Non c'è problema ^^","replies":[]}]}]}]}]}]},{"poster":"fedy99","date":"2017-07-18T21:29:59.932+0000","up_votes":1,"down_votes":0,"body":"ma scusa non è pi facile inserire un champ in più per squadra(oppure tutti che usano lo stesso champ)che riutilizzare la mappa della dominion vecchia cambiata completamente??","replies":[]}]},{"poster":"NOLIMIT Vladimir","date":"2017-07-18T15:56:18.761+0000","up_votes":1,"down_votes":0,"body":"Ho iniziato a giocare a LoL esattamente 2 giorni dopo che hanno tolto la 1fall come modalità di rotazione (a detta di alcuni miei amici) e gioco da  oltre 6 mesi e ancora non l'ho provata... la Re poro e l'ascensione l'ho vista almeno 4 volte l'una","replies":[]}]}