{"poster":"WrÆth","date":"2016-07-25T22:15:58.917+0000","title":"Patch 6.15 isn't showing up to install?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Do you know when it's expected to go live for install? Because i want to install it tonight so when i'm playing tomorrow i don't have to wait for it to install. Thanks!","replies":[{"poster":"Deep Terror Nami","date":"2016-07-25T23:12:30.474+0000","up_votes":1,"down_votes":0,"body":"You can check the official patch times on the Service Status page here; http://status.leagueoflegends.com/?en_US#na\n\n> Network Operations – Yesterday at 3:28 AM\nOn 07/26/16, starting at, 01:30 Pacific Time (08:30 UTC), ranked queues will be disabled in preparation for patch 6.15. At 03:00 Pacific time (10:00 UTC), the servers will be shut down and all games currently in progress will end in a draw and stats will not be recorded. We estimate the battlegrounds will be unavailable for 3 hours.\n\nAs for installing it early, switch your client to a region that patches ahead of us (like EUW or OCE) before you go to bed and you'll get the patch, and swapping to the NA client will only take a minute afterwards.","replies":[{"poster":"WrÆth","date":"2016-07-26T01:00:17.762+0000","up_votes":1,"down_votes":0,"body":"how do i do this? like how do i swtich regions?","replies":[{"poster":"Deep Terror Nami","date":"2016-07-26T01:07:00.368+0000","up_votes":1,"down_votes":0,"body":"When you open up your launcher, the dropdown option is on the top right (it'll currently say 'North America' for you).\n\nhttps://i.gyazo.com/03e9d93d66bd113cc2c6ef6671dd0f38.png\n\nKeep in mind that if you go to the next patch by switching regions then change back to NA before we are on that patch, it'll have to repatch again to go back and yet again when we do move; basically, make sure the NA patch has at least started before you go back to avoid patching multiple times needlessly.","replies":[{"poster":"WrÆth","date":"2016-07-26T12:44:45.579+0000","up_votes":1,"down_votes":0,"body":"I just opened up the launcher and its repatching again so....","replies":[{"poster":"Kürama","date":"2016-07-26T13:04:55.701+0000","up_votes":1,"down_votes":0,"body":"Each region requires a different set of files to run successfully, which is why the patcher will patch these files when you switch regions.\n\nNot all the files are different though, just a select few.","replies":[]}]}]},{"poster":"WrÆth","date":"2016-07-26T01:08:00.823+0000","up_votes":1,"down_votes":0,"body":"Also, when i switch back to NA will i have to re download the patch ?","replies":[]}]},{"poster":"Kürama","date":"2016-07-25T23:14:12.221+0000","up_votes":1,"down_votes":0,"body":"All regions receive their patches ahead of us lol.","replies":[]}]}]}