{"poster":"WrÆth","date":"2016-08-08T14:02:48.517+0000","title":"Why hate teemo when there's...","subforum":"Gameplay","up_votes":3,"down_votes":4,"body":"Instead of jumping on the teemo hate bandwagon, here&#039;s a list of champions that you can hate on instead. In my personal opinion, a lot of these are a whole lot worse.\r\n\r\nIllaoi-the new cancer of toplane. No matter who you pick against her, laning phase is a fucking nightmare. She can harass from distance with her q then chunk you down to half health with her e. To this day she is the scariest toplaner to lane against in my opinion.\r\n\r\nLux-Her snare is obnoxious as fuck and so easy to land. Her E has some of the biggest 100-0 potential in the game and is basically a jhin w on steroids. On top of that, all her abilities are hard to dodge due to the deceptive hit boxes. When you think you&#039;ve dodged her e, you still take damage and die.\r\n\r\nYasuo- ok, let never this straight. I have some problems with Yasuo as a champion, but the main thing that makes yasuo so damn cancerous is the people that play him. I have yet to meet a Yasuo main who is not rude, disrespectful, egotistical, and overly toxic. I&#039;ve never seen this happen before, but I&#039;ve heard stories of yasuo mains feeding and trolling if they don&#039;t get their position or yasuo gets picked or banned.\r\n\r\nIrelia-Triforce made her disgusting, that&#039;s all there is to say.\r\n\r\nVlad-His still a really strong pick for toplane and mid, but in my opinion, the most obnoxious part of his kit is his stupid blood pool  untargetable bullshit.\r\n\r\nSwain-I haven&#039;t played against him that much, but when I have its one of the scariest experiences ever. He&#039;s just really, really, strong right now, enough said.\r\n\r\nMalzahar-He&#039;s literally a walking talking purple cancer cell. His silence and how tanky he can get is just disgusting. The worst part? Riot keeps buffing him for some reason.\r\n\r\nCho&#039;gath-now this may seem weird to be on this list, but I hate playing against cho. No matter how much a dominate him in his laning phase, he always just seems to get so damn tanky.\r\n\r\nNasus-he&#039;s really weird to play against in general. He&#039;s kind of like a ticking time bomb, where you know if you let it get to late game and if you let him farm, he will fuck over your game singlehandedly. The other problem is, you have to prevent him from farming his q, but you can&#039;t all in him, cause he&#039;s a really strong duelist.\r\n\r\nBlitz-no explanation needed \r\n\r\nIf you have any champion you hate, comment them down below. Thanks!","replies":[{"poster":"Arkale","date":"2016-08-08T19:53:07.524+0000","up_votes":2,"down_votes":0,"body":"Malzahar-\"Riot keeps buffing him for some reason.\"\n\nX'D All these buffs he's been getting.","replies":[]},{"poster":"JamesTheMage17","date":"2016-08-08T14:11:40.288+0000","up_votes":2,"down_votes":0,"body":"Lux mains act like their champ takes so much skill because they're \"all skill shots\" when her E is not a Skillshot at all since it gets there instantly and has a huge hitbox. But if you somehow happen to get a bad angle on it, don't worry, there's a 36% slow waiting for you to ensure they can't do anything. Her W targets allies so that doesn't even count as a Skillshot, her Q is fast and has a longer range than it says but despite being ridiculously easy to hit you get such a reward for hitting them (2 second root and extremely bs damage) which sets up her other \"skill shots\" like her ridiculous R that does way too much damage with ridiculous ranges and a ridiculous hitbox. So easy it's funny.","replies":[{"poster":"WrÆth","date":"2016-08-08T14:21:45.834+0000","up_votes":1,"down_votes":0,"body":"The most tilting thing about her r is the fucking hitbox-this topic is very damn close to me cause one game when I was about to escape, this lux fired a piss poor r that missed by a mile (I wasn't even in the animation) and I still died. Also, I love how they put that little red thing that shows you were it's going but doesn't accurately represent THE FUCKING HITBOX. thanks, have a good day :)\n","replies":[]}]},{"poster":"StrangeHabits","date":"2016-08-08T14:06:32.194+0000","up_votes":2,"down_votes":1,"body":"First 3 are so true and tank yasuo is crazy stupid","replies":[]},{"poster":"Dovahkiin416","date":"2016-08-08T15:42:51.705+0000","up_votes":1,"down_votes":0,"body":"{{champion:105}} \n\nI dodge if I see this fucker","replies":[]},{"poster":"Hinu Hyuga","date":"2016-08-08T14:46:22.432+0000","up_votes":1,"down_votes":0,"body":"How about LeBlanc. 100 to 0 in 1 sec, and by the time you figure out what's going on. She's warped back to her pad.","replies":[]},{"poster":"WrÆth","date":"2016-08-08T14:27:12.809+0000","up_votes":1,"down_votes":0,"body":"Btw I mean lux's R is the one with the bullshit hitbox.","replies":[{"poster":"JamesTheMage17","date":"2016-08-08T14:29:00.933+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tazret,realm=NA,application-id=3ErqAdtq,discussion-id=U9yH69EH,comment-id=0002,timestamp=2016-08-08T14:27:12.809+0000)\n>\n> Btw I mean lux&#x27;s R is the one with the bullshit hitbox.\n\nOh trust me my friend, I know.\nLet's not forget that her E's hitbox is way larger than it shows despite it being ridiculously big, or that her Q is much much bigger than it says.","replies":[]}]}]}