{"poster":"WrÆth","date":"2016-06-23T16:48:16.129+0000","title":"4800 IP- what to get?","subforum":"[ARCHIVED] Miscellaneous","up_votes":2,"down_votes":1,"body":"Hey. I've been sitting on 4800 ip for a while now. I main jungle and I have a couple of champs in mind- Graves, Nocturne, (possibly saving up for) Rek Sai, Shaco, and that's about it. Although I main jungle, I tried rumble lane (free to play) and I really like it, but recently I haven't been doing so well with Rumble. Now my top 3 picks are looking like Graves, Rek Sai, and Rumble. I have 3 questions. 1, is Graves getting nerfed in the near future/reworked? Is Rek Sai? And should I just get rumble instead?","replies":[{"poster":"Demon King Maou","date":"2016-06-23T16:57:59.206+0000","up_votes":3,"down_votes":0,"body":"If you like rumble stick with him\nYou'll thank yourself later\n\nI used to SUCK with pantheon but after about 30+ games I started getting good at him and carrying most of my games","replies":[]},{"poster":"Sneed","date":"2016-06-24T00:01:14.478+0000","up_votes":1,"down_votes":0,"body":"rumble is VERY rewarding once you have played a lot of him. stick with him and learn his kit inside and out\n\nhe has the ability to turn losing teamfights into aces for your team. every time i see a rank 5 rumble i know im in for a good game","replies":[{"poster":"WrÆth","date":"2016-06-24T01:58:13.467+0000","up_votes":1,"down_votes":0,"body":"The main problem with rumble is, i don't actually have much experience playing lane until recently, and up until now I've played jungle.","replies":[{"poster":"Sneed","date":"2016-06-24T02:02:34.814+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tazret,realm=NA,application-id=cIfEodbz,discussion-id=kf8wm7Ht,comment-id=00060000,timestamp=2016-06-24T01:58:13.467+0000)\n>\n> The main problem with rumble is, i don&#x27;t actually have much experience playing lane until recently, and up until now I&#x27;ve played jungle.\n\nwhats your jungle playstyle?\n\nsometimes swapping to lanes may actually better depending on your playstyle","replies":[{"poster":"WrÆth","date":"2016-06-24T02:24:03.483+0000","up_votes":1,"down_votes":0,"body":"Playstyle? What do you mean?","replies":[]}]}]}]},{"poster":"Hyperiön","date":"2016-06-23T16:59:48.852+0000","up_votes":1,"down_votes":0,"body":"Rek Sai and Graves for sure. Both can lane in the top if needed too, and very safe picks overall with great potential. Nocturne is still good, but in the current meta, graves and Rek are the best bet. Can always save up and get nocturne and rumble next.","replies":[]},{"poster":"AramsAreBest","date":"2016-06-23T16:56:23.601+0000","up_votes":1,"down_votes":0,"body":"None of them are getting reworked so just pick whoever's fun.","replies":[]},{"poster":"Taric the Gay","date":"2016-06-23T16:59:06.934+0000","up_votes":1,"down_votes":1,"body":"Buy Ezreal\n\n\n\nhttp://www.auplod.com/u/pdolua802d6.png","replies":[]},{"poster":"Chaos689","date":"2016-06-23T16:49:26.311+0000","up_votes":1,"down_votes":2,"body":"Just save up for an assassin. They're fun...","replies":[]}]}