{"poster":"Te Falta Cindor","date":"2015-10-16T12:35:17.946+0000","title":"Prevenir derrota tras AFKS","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":1,"body":"Es muy injusto perder LP en rankeds por aquellas partidas con afk&#039;s 4v5 3v5 etc.  Propongo que no se quiten LP si un jugador esta AFK toda la partida.\r\nDescendi 1 categoria entera por 5 afks seguidos. Solo quiero que me respondan lo siguiente &iquest;Les parece correcto **sacarle 16-25 LP a un jugar por perder una partida 4v5?** &quot;Ingenieros&quot; de Riot, a ver si solventan este {{champion:104}}  error en el sistema de puntos.\r\n\r\nSaludos","replies":[{"poster":"Soulofthevil","date":"2015-10-16T13:21:56.251+0000","up_votes":1,"down_votes":0,"body":"Buenas, sin ofender mi estimado me parece ridiculo lo que propones. Esta bien, muchos perdemos partidas por afk´s, trolls, etc, etc. pero prevenir o restaurar la perdida de puntos de liga esta mal, seria como decir ah nos fue mal... chao cabros yo me voy quedence con sus puntos ;v, o eso es lo que creo yo.\n\nSaluos lince salvaje de la grieta del invocador {{summoner:4}}","replies":[{"poster":"Te Falta Cindor","date":"2017-08-25T03:49:20.317+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Soulofthevil,realm=LAS,application-id=PJAKt7ph,discussion-id=LghdGVEz,comment-id=0000,timestamp=2015-10-16T13:21:56.251+0000)\n>\n> Buenas, sin ofender mi estimado me parece ridiculo lo que propones. Esta bien, muchos perdemos partidas por afk´s, trolls, etc, etc. pero prevenir o restaurar la perdida de puntos de liga esta mal, seria como decir ah nos fue mal... chao cabros yo me voy quedence con sus puntos ;v, o eso es lo que creo yo.\n> \n> Saluos lince salvaje de la grieta del invocador {{summoner:4}}\n\nHola señor ridiculo.\nFinalmente luego de un tiempo Riot implemento un sistema que se debatio en este thread.\nSin ofender mi estimado, se puede meter su comentario en el lugar que mas le guste.\nUsted no es nada constructivo, es medio incompetente y evidentemente no deberia opinar sobre estos temas ya que no es capas de ponerse a pensar y/o minimamente brindar alguna propuesta que contribuya.\n\nPor otro lado sigo pensando que se puede mejorar aún mas lo actual implementado. Acaso te crees que no pensé en esa posibilidad de ponerse en duo y generar una derrota evitada?\nPor que no pones todas las variables en juego y luego evaluas lo mejor que se puede hacer?\nPorque yo ya lo hice y encontre un mejor mecanismo para evitar perdida de LP por jugadores que no reconectan.\n\nSaludos.","replies":[]},{"poster":"Ordinal Dragon","date":"2015-10-19T17:45:36.161+0000","up_votes":1,"down_votes":0,"body":"tampoco es por esa la razon, imaginate que tienes 2 afk desde minuto 0 (que no se han reconectado en toda la partida (ya sea por problemas con el launcher que suele suceder bastante seguido, o por problemas del servidor con ciertos provedores de internet)) ya me ha pasado varias veces, que por problemas del servidor se desconecten 3 o 4 de mi team (si, es increible que por ejemplo, me toque con 4 de otro pais en el team, y 5 del mismo pais que el mio en el team enemigo, o 4 del mismo pais con algun provedor diferente de internet al mio, y 5 jugadores con el mismo internet o de diferentes paises que no poseen problemas) y que por ejemplo, el problema haya tardado entre 15 a 20 minutos, y lamentablemente, riot no te da derrota evitada en esos casos, yo propongo que por lo menos, en cuanto hay un problema con el servidor, que dure de 4 minutos en adelante, den derrota evitada a todos los que hayan estado en partida durante ese periodo de tiempo, por que ya con 4 minutos de problemas, en los que por ejemplo, a los 5 de un team no los deje entrar, son minimo 2 torres de cada lane (peor seria si van mas de 20 minutos de partida, pues se ponen los 5 del team contrario a tirar una lane y ganan)","replies":[{"poster":"Soulofthevil","date":"2015-10-19T20:32:18.904+0000","up_votes":1,"down_votes":0,"body":"primero a aclarar, los problemas de Internet divido a su propio proveedor no es \"problema de el servidor\", es un problema de cada jugador con su proveedor de Internet (la mayoría de las des conexiones se provocan por esto y no por \"problemas\" con el servidor, lamentablemente esto no quiere decir que no existen fallas de parte de este). Segundo el sistema de derrotas evitadas es automático, solo se activa cuando las des conexiones son masivas culpa de fallas en el servidor.\nSaluos  {{summoner:4}}","replies":[{"poster":"Ordinal Dragon","date":"2015-10-20T01:38:48.189+0000","up_votes":1,"down_votes":0,"body":"estas mal, por que como te he dicho, son problemas del servidor con los proveedores de internet, no es problema del jugador, ya que el mismo jugador puede estar usando cualquier otro programa que requiera internet y lo podra usar tranquilamente, y segundo, no, no se activa cuando las desconexiones son masivas, solamente se activa a partir de los 10 minutos de problemas, cuando sabiendo que en 5 minutos un game se puede perder tranquilamente, y ha pasado que hay desconexiones masivas, y el sistema de derrotas evitadas no se ha activado","replies":[{"poster":"Soulofthevil","date":"2015-10-20T13:02:37.287+0000","up_votes":1,"down_votes":0,"body":"amigo buenas denuevo, si te respondo eso es por que son las respuestas dadas por los rioters en respuestas anteriores.\ncon respecto a las conexiones con los proveedores de internet como ocurrio en un caso no tan antiguo, hubo problemas en argentina puesto que ciertos proveedores tenian problemas de conexion con chile, esto NO es problema del servidor de RIOT, es problema de los propios proveedores y ademas de esto el sistema de derrotas evitadas no se activo por que las desconecciones fueron solo en argentina (y puesto que eran solo algunos proveedores) no se alcanzo el numero de jugadores para activar derrota evitada. Haora bien tal y como dije antes estos son casos exepcionales, no podemos evadir la triste realidad y decir solo se desconectan jugadores por problemas de internet o del servidor, la mayoria de las desconexiones son o por \"problemas personales\" o por que flamean o pierden partidas y NO son merecedores de quedarce esos puntos.","replies":[]}]}]}]}]},{"poster":"Yrox the Third","date":"2015-10-16T22:07:10.260+0000","up_votes":1,"down_votes":0,"body":"Yo creo que entonces seria un metodo muy facil de reproducir, imaginate que si hay un afk es derrota evitada automaticamente, entonces, un equipo va perdiendo, le dicen a uno que se vaya afk, y listo, no pierden puntos.","replies":[{"poster":"Ordinal Dragon","date":"2015-10-19T17:37:46.515+0000","up_votes":1,"down_votes":0,"body":"claro, y al que se va afk lo banean jaja","replies":[{"poster":"Soulofthevil","date":"2015-10-19T20:32:26.816+0000","up_votes":1,"down_votes":0,"body":"simple, no lo \"reportan\"","replies":[{"poster":"T0r4 S3ns3i","date":"2015-10-23T21:31:35.159+0000","up_votes":1,"down_votes":0,"body":"Leavebuster es automático","replies":[]}]}]}]},{"poster":"Ordinal Dragon","date":"2015-10-19T03:29:36.335+0000","up_votes":1,"down_votes":0,"body":"ufff, si pasara eso yo ya seria challenger jajajajajajajajaja, na pos encerio, el league of legends de las es expert mode, tiene todas las dificultades de los trolls y afks pero multiplicada por 2, aunque en tu division es bastante facil ganar las partidas con un jugador menos si sabes jugar, espera a llegar a platino, ahi jugaras con 3 jugadores menos jejeje, creo que la ultima vez que me queje por los afk me banearon :c asi que ya lo tomo asi como que fueee, si se gana se gana y si se pierde se pierde :c y asi llegue hasta aca (aunque descendi por que juegan peor que los bronces aca, sin un duo que te asegure una linea es dificil :c) bueno a todo esto, yo digo que se baneen a los que en 1 semana estubieron 7 veces afk/kitearon (algo asi a razon de 1 leave por dia) cosa de que les de miedo irse afk y jueguen, o que almenos si te tubiste que ir por una emergencia no te baneen (no creo que alguien tenga 7 emergencias en una semana)","replies":[]},{"poster":"II Thanatos II","date":"2015-10-17T17:36:57.962+0000","up_votes":1,"down_votes":0,"body":"La ultima opcion me parece fiable solo en el caso de que el afk lo este desde el minuto 0 de la partida hasta el final, los otros no son reales la gente por ejemplo diria voy 0 10 en early me voy afk y me perdona el sistema, por eso cuando el afk o el troll esta en el otro equipo no tener piedad, aunque llore","replies":[]},{"poster":"Lince Salvaje","date":"2015-10-16T13:34:32.688+0000","up_votes":1,"down_votes":0,"body":"La verdad a mi también me parece ridículo... Y los puntos que te quitan es por tu mmr","replies":[]}]}