{"poster":"Il Freddo","date":"2016-03-25T10:06:41.639+0000","title":"resoconto 25€ di hextec","subforum":"Discussioni generali","up_votes":19,"down_votes":2,"body":"Da questa mia prima esperienza ho capito molte cose del sistema hextec, andr&ograve; a suggerirvi le azioni pi&ugrave; convenienti che permettono di massimizzare il guadagno.\r\nQuesto thread pu&ograve; sembrare come &quot;la scoperta dell&#039;acqua calda&quot; ma voglio comunque esprimere le mie inpressioni.\r\npartiamo con il presupposto che il sistema &egrave; deltutto randomico, in una chest pu&ograve; capitarvi una skin o un campione che gi&agrave; avete, questo per avere un guadagno di essenze. Il mio consiglio &egrave; quello di aprire forzieri e accumulare frammenti di aspetti o di skin fino alla fine del mese, in modo tale da avere pi&ugrave; materiale su cui lavorare, i frammenti da 975+ che avete gi&agrave; vanno assolutamente trasformate in essenze, non vale la pena fare un cambia perch&egrave; in linea di massima ci perderete. La funzione cambia &egrave; un&#039;arma a doppio taglio, non la consiglio affatto ma se volete tentare la fortuna, fatelo con 3 skin da 520.\r\nL&#039;azione ideale &egrave; andare ad accumulare essenze per poi spenderle una volta che trovate un frammento che volete.\r\nQuesto ovviamente &egrave; un piano d&#039;azione a lungo termine, bisogna armarsi di pazienza ed avvumulare frammenti su frammenti.\r\nIl modo migliore per shoppare &egrave; quello di prendere solo i forzieri e accumulare le chiavi giocando, cos&igrave; andrete a spendere 125 rp al posto che 195, avendo un risparmio non trascurabile.\r\nIo, come da titolo, ho speso 25 euro comprando forziere+chiave, volevo studiarmi il sistema e ho ricavato: kindred, alistar infernale,galio hextec e janna meteorina+ frammenti di una skin da 1350 e una da 975, 2 frammenti di campione da 975 e 2 franmenti di ward.\r\nHo fatto molte azioni sbagliate, come l&#039;aver messo in cambio 2 skin da 1350.\r\n\r\nIn conclusione il sistema hextec mi ha convinto, mi piace e penso che sia un valido compromesso tra guadagno dell&#039;utente e guadagno della riot","replies":[{"poster":"Markus Vakarian","date":"2016-03-25T10:57:07.428+0000","up_votes":2,"down_votes":4,"body":"Spiegami la funzione cambia. Io sacrifico 3 frammenti di skin e non posso scegliere quella che voglio? nemmeno il campione di cui voglio una skin?\nChi me lo fa fare a sacrificare 3 frammenti per uno solo? con tutte le skin che ci sono le possibilità che esca a random una che voglio sono pari allo 0","replies":[{"poster":"Floppyz","date":"2016-03-25T10:57:36.328+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Markus Vakarian,realm=EUW,application-id=MJVj50Jw,discussion-id=TEcoEkU9,comment-id=0003,timestamp=2016-03-25T10:57:07.428+0000)\n>\n> Spiegami la funzione cambia. Io sacrifico 3 frammenti di skin e non posso scegliere quella che voglio? nemmeno il campione di cui voglio una skin?\n\nEsatto.","replies":[{"poster":"Markus Vakarian","date":"2016-03-25T11:10:24.324+0000","up_votes":1,"down_votes":4,"body":"e allora perchè mi downvoti?? è una truffa!","replies":[{"poster":"Dr LouD","date":"2016-03-25T11:13:26.276+0000","up_votes":5,"down_votes":0,"body":"Non è una truffa.\n\nConcettualmente tu sacrifichi tre frammenti di skin che NON ti interessano (quindi per te valore = 0) per una skin permanente casuale (l'esatta funzione di una mistery chest, che costa ben 490RP)","replies":[]},{"poster":"Floppyz","date":"2016-03-25T12:39:10.573+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Markus Vakarian,realm=EUW,application-id=MJVj50Jw,discussion-id=TEcoEkU9,comment-id=000300000000,timestamp=2016-03-25T11:10:24.324+0000)\n>\n> e allora perchè mi downvoti?? è una truffa!\n\nNon sono mica stato io O.o","replies":[]}]}]},{"poster":"Karob","date":"2016-03-25T11:13:07.825+0000","up_votes":3,"down_votes":0,"body":"Solo che le skin da 520 rp ti danno  120  circa di polvere.. Disincantandole non arrivi nemmeno a metà di una skin di 975.. Per questo che ha suggerito di cambiarle, perché hai buone probabilità di craftarti una skin da 975..","replies":[{"poster":"Markus Vakarian","date":"2016-03-25T11:19:40.954+0000","up_votes":1,"down_votes":0,"body":"non è mica detto che mi piaccia per forza anche costa di più. Ci saranno 5-6 skin che vorrei e quante possibilità ho di trovarle su tutte quelle che ci sono??\nalla fine meglio avere 3 skin che non mi interessano piuttosto che 1 che non mi interessa. Al massimo tramuto i frammenti in essenze se proprio voglio disfarmi di quei frammenti","replies":[{"poster":"Vileblood Pyke","date":"2016-03-25T11:21:59.622+0000","up_votes":1,"down_votes":0,"body":"Se vuoi delle skin precise, ti conviene di più comprarle dal negozio. L'hanno detto più volte.","replies":[{"poster":"Markus Vakarian","date":"2016-03-25T11:42:27.691+0000","up_votes":1,"down_votes":0,"body":"non c'entra niente il comprare. lo so che comprando è più facile (ma va???) ma la difficoltà dell'hextech è che ti capiti il frammento giusto..quello che uno aspetta. Questo lo capisco,è qualcosa in più che prima non c'era e pazienza se ti capita quello che non vuoi. \nQuello che non mi piace è dover usare 3 skin per ottenerne una. Tipo se ci fosse un sola skin per campione e avessi 3 frammenti di skin di 3 campioni che non gioco,potrei anche tentare la fortuna (anche se ci sono tipo 140 campioni e già le possibilità di beccare quello giusto sono opoche), Ma visto che mediamente ci saranno 3-4 skin per campione le possibilità sono addirittura minori!\nAl massimo potevano fare il cambio frammento con skin casuale,usando un frammento skin + essenza...non 3 frammenti","replies":[]}]},{"poster":"Karob","date":"2016-03-25T11:37:26.242+0000","up_votes":1,"down_votes":0,"body":"Se vuoi le skin precise, ti conviene comprarle.. qua stiamo parlando di convenienza ;)","replies":[]}]}]},{"poster":"Il Freddo","date":"2016-03-25T11:15:15.050+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Markus Vakarian,realm=EUW,application-id=MJVj50Jw,discussion-id=TEcoEkU9,comment-id=0003,timestamp=2016-03-25T10:57:07.428+0000)\n>\n> Spiegami la funzione cambia. Io sacrifico 3 frammenti di skin e non posso scegliere quella che voglio? nemmeno il campione di cui voglio una skin?\n> Chi me lo fa fare a sacrificare 3 frammenti per uno solo? con tutte le skin che ci sono le possibilità che esca a random una che voglio sono pari allo 0\n\nLa funzione cambia ti costa 3 frammenti di skin, che equivalgono a 3 chest + chiave ( 195×3= 585), ottieni lo stesso risultato comprando uno forziere misterioso da 490 rp","replies":[]},{"poster":"Darkinknight","date":"2016-03-25T18:32:50.316+0000","up_votes":1,"down_votes":0,"body":"Diciamo che sacrifichi 3 frammenti di champ che non userai mai..ti verra fuori un skin casuale permanente senza spendere essenze ed è la il guadagno .. D'altra parte le puoi convertire e fare scorta di essenze x quando trovi un frammento che ti interessa","replies":[]}]},{"poster":"Sorcio84","date":"2016-03-25T10:56:15.644+0000","up_votes":5,"down_votes":1,"body":"+1 e onore alla ricerca scientifica sperimentale :D","replies":[{"poster":"Dainsleif09","date":"2016-03-25T11:22:30.191+0000","up_votes":1,"down_votes":0,"body":"ww il metodo sperimentale","replies":[{"poster":"Sorcio84","date":"2016-03-25T14:55:42.468+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dainsleif09,realm=EUW,application-id=MJVj50Jw,discussion-id=TEcoEkU9,comment-id=00020000,timestamp=2016-03-25T11:22:30.191+0000)\n>\n> ww il metodo sperimentale\n\n{{champion:19}} woff\n{{champion:27}} barman un jhin tonic\n\n{{champion:202}} ha, ha,ha ...patetico","replies":[{"poster":"Dainsleif09","date":"2016-03-25T15:21:43.217+0000","up_votes":1,"down_votes":0,"body":"mi è piaciuta la battuta del jhin tonic","replies":[]}]}]}]},{"poster":"wellyT93","date":"2016-03-25T11:00:18.744+0000","up_votes":3,"down_votes":1,"body":"Grazie mille per i test, molto utile, +1 :)","replies":[]},{"poster":"Bistrus","date":"2016-03-25T22:50:55.375+0000","up_votes":1,"down_votes":0,"body":"Oggi ho aperto 25 casse. Tralasciando il fatto che sono statp fortunato (mi è uscito, tra le varie cose, 1 trynda lama demoniaca, 1 veigar boss finale, 1 aurelion cinereo, 2 vlad signore del sangue, 1 veigat boss finale, 1 skarner leggendario di cui non ricordo il nome). Consiglio di:\n1) Le shard dei campioni, se ve ne escono 3 che avete, rollate un champ permanente.\n2) Le shard delle skin. Non smontate nulla che voi non abbiate già.\n3) Smontate le skin solo quando trovate una shard che vi interessa. Con la skin sottomanda avrste anche il suo costo e potrete facilemente trovare il metodo migliore per ottenere le essenze in modo da ridurre al minimo gli sprechi\n4) In generale, è solo fortuna. Ad essmpio io oggi ho \"guadagnato\" 3000+ rp, poichè spendendo 1950x2 (due bundle da 11 casse) ho ottenuto skin e campioni per 7000 + rp. Non abbiate fretta, la skin che volevate potrebbe uscire dalla prossima cassa. E se non quella che volevate magari trovate una skin legacy o limitata","replies":[]},{"poster":"INAZUMA 33","date":"2016-03-25T20:53:40.025+0000","up_votes":1,"down_votes":0,"body":"Grazie per il lavoro svolto :)","replies":[]},{"poster":"Hype GENERAL ZOD","date":"2016-03-25T14:04:12.532+0000","up_votes":1,"down_votes":0,"body":"Sacrifichi 3 frammenti di 3 cose che nn ti interessano per una skin permanente.....hai detto poco scusa. Una skin free al mese sicuro a costo 0.","replies":[]},{"poster":"Dainsleif09","date":"2016-03-25T10:21:25.536+0000","up_votes":1,"down_votes":0,"body":"ottimo thread,approvo pienamente le tue considerazioni sulla ruota della fortuna","replies":[]},{"poster":"fedy99","date":"2016-03-25T10:17:48.840+0000","up_votes":1,"down_votes":0,"body":"Credo che ci proverò pure io a shoppare un po di chest.Grazie dei consigli","replies":[]}]}