{"poster":"Il Freddo","date":"2016-03-19T12:37:22.040+0000","title":"dying light","subforum":"Off-topic","up_votes":3,"down_votes":2,"body":"30 euro per un gioco e il season pass.\r\ncarino, la storia principale &egrave; scontata, le quest secondarie hanno tutte lo stesso profumo e il fatto che la trama del dlc&quot; the following&quot;  sia molto pi&ugrave; appassionante rispetto a quella principale, fa pensare non poco.\r\nLe armi sono moltissime, come moltissimi sono i bug, gli zombie sono veramente troppo pochi, hanno creato 6 modelli per gli zombie comuni e li hanno moltiplicati all&#039;infinito disponendoli in maniera casuale e deltutto ingiustificata per la mappa, quelli speciali sono solo 6 e anche qui sono tutti copia/incollati.\r\nNel 2015 mi aspetto centinaia di modelli, non voglio incontrare sempre gli stessi personaggi fino allo sfinimento.\r\nil parkour salva in corner il progetto ma anche qui ci sono delle pecche, hanno fatto 5 animazioni per tutto, l&#039;animazione per scavalcare un muro e saltare una staccionata sono le stesse ma si possono trascurare per chi come me gioca senza badar troppo a questi dettagli. La vera svolta avviene quando si sblocca il rampino.\r\nanimazioni facciali pressoch&egrave; inesistenti, ia degli umani troppo bassa e a volte gli zombie agili fanno dei percorsi &quot;innaturali&quot; per raggiungerti.\r\nParlando invece degli apletti positivi, vediamo come i modelli delle armi sono buoni e le textures sono decenti, non mancheranno iso spalmate su textures non loro ma sono rare e a bordo mappa, il doppiaggio &egrave; buono e il multiplayer aiuta ad avere un&#039;esperienza di gioco migliore.\r\nIl cambiamento drastico della difficolt&agrave; tra giorno e notte &egrave; una trovata tanto scontata quanto efficace, alle 9 di sera dovrete prepararvi a correre molto ma molto veloce, arrivano i notturni, zombie estremamente forti che appena vi noteranno vi inseguiranno fino ad un rifugio, senza mai mollarvi, il cambiamento di difficolt&agrave; &egrave; giustificato dalla distribuzione di xp doppi, non credete che sia facile farmare di notte, i pochi posti adatti sono tutti pieni di bug, fatti apposta per mettervi difficolt&agrave;. Credete di aver fatto il colpaccio? Credete di riuscire ad attaccare gli zombie senza subire danni grazie ad una saracinesca quasi abbassata che vi permette di colpirli alle gambe senza essere toccati? Bom lo zombie pi&ugrave; forte del gioco salta e attraversa la saracinesca entrando nella stanzetta, lasciandovi 0 chance di rimanere vivi.\r\nIl punto pi&ugrave; grave a mio parere, &egrave; il sistema di livelli &quot;leggenda&quot;, qui si nota palesemente la volot&agrave; da parte degli sviluppatori di rendere il gioco infinito, in quanto servono milioni di xp per arrivare al livello massimo. Ci&ograve; costringe i player a cercare bug e glitch che gli permettano di arrivare ad avere il massimo livello.\r\nParlo avendo giocato 60/70 ore, durante le quali sono arrivato al livello 2, dell&#039; albero leggenda.\r\nConcludendo consiglio questo gioco a chi &egrave; appasionato del genere, avviso che le componenti horror sono molto presenti, specialmente da met&aacute; gioco in poi, grazie all&#039;introduzione dei bambini infetti che se non uccisi all&#039;istante, richiameranno un gran numero di zombie, costringendovi a combattere in scomodi ed angusti spazi ridotti.\r\n&quot;Come uno zombie&quot; permette di impersonare  l&#039;infetto pi&ugrave; forte del gioco e combattere pvp contro altri giocatori, qui la techland ha fatto un buon lavoro di bilanciamento, che ahim&egrave; va scemando all&#039;aumento dei giocatori umani (max 4).\r\n&quot;L&#039;orda di Bozak&quot; &egrave; il nome del dlc pi&ugrave; brutto, una serie di prove a tempo che si concludono con il drop dell&#039;arco pi&ugrave; forte del gioco. Non vale 10 euro.\r\n\r\n\r\n\r\nSpoiler\r\nspoiler \r\nspoiler\r\nspoiler\r\nspoiler\r\n\r\n\r\nLa parte finale del gioco, quella nelle fogne, mi ha messo addosso troppa ansia.","replies":[{"poster":"Ucr0niA","date":"2016-03-27T10:31:05.935+0000","up_votes":1,"down_votes":0,"body":"Mi spiace aver trovato questo post solo ora, poichè molto incuriosito da tale titolo.\n\nPersonalmente vengo da Dead Island, titolo pilota della casa aprifila di questo capitolo videoludico, che sto giocando proprio in questi periodi.\nDevo dire che la tua recensione ha confermato a pieno le mie aspettative, bene o male sono gli stessi punti di forza/aspetti negativi, non sono un programmatore e forse parlo a vanvera, ma piuttosto che fare una decina di modelli fissi per gli zombie tipo: Donna bianca, Uomo bianco, Donna nera, Uomo nero, Uomo Bianco grasso, Uomo Muscoloso bianco, Uomo Muscoloso nero, Uomo Magro bianco, Donna magra bianca.\nCredo sarebbe stato fantastico avere 3-4 modelli di Texture per bodytipe: Magro, medio, muscoloso, grasso ad esempio, e aspetti grafici/dettagli randomizzati di spawn in spawn, cappellini, colore degli abiti, abiti stessi, capelli, etc, credo avrebbe aggiunto tantissimo al gioco onestamente.\n\nLa personalizzazione delle armi come la varietà di queste e la necessità di cambiarle sono tutti aspetti chiave del gioco e per buona parte sono ciò che ti tiene a giocare insieme ai livelli, che però come hai riassunto tu, arrivati a un certo punto del game sforano il ridicolo quanto a exping, come se il gioco volesse rubarti altre 20/30 ore a monitor per la soddisfazione di essere completamente maxato.\n\nSe non erro comunque la saga conta anche di titoli solo multiplayer a mo di diablo, come  \"Epidemic\"\nhttps://www.youtube.com/watch?v=CjTWSoBi8p8\n\nSe trovo persone con cui giocarci ci faccio il pensiero.","replies":[]},{"poster":"A Yordle ln Heat","date":"2016-03-19T13:35:29.790+0000","up_votes":1,"down_votes":0,"body":"Anche io un po' di tempo fa mi appoggiavo alla gente che diceva che le animazioni di arrampicata e scavalcata sono poche, ma poi un mio amico, che \"studia\" per fare l'istruttore di parkour mi ha fatto notare che nella vita reale, a meno che tu non ti stia effettivamente impegnando per fare una bella coreografia, quando fai qualcosa di \"semplice\", come l'appunto, scavalcare muri o arrampicarti, ti ritroverai a fare sempre gli stessi movimenti, senza mai cambiare nemmeno di un centimetro la posizione o la distanza tra mani o piedi, e cose così; da quel punto di vista è davvero realistico.\nPoi io di parkour non so niente, mi fido di quello che dice.\n\nRiguardo ai pochi modelli di zombie concordo, ma si fanno perdonare con la buona varietà di \"razze di zombie\"; i Freschi, i Notturni, i Feroci, i Luminosi, i Bambini e tanti, tanti altri; mi sono ritrovato parecchio sorpreso e soddisfatto nel vederne una così pesante varietà.\n\nInfine, secondo me il fattore che durante la notte il gioco diventa più difficile non è affatto scontato; cioè, è nella natura umana il considerare la notte un momento difficile, ma da quando i zombie diventano più forti nelle ore notturne? Solo su Dying Light succede, credo, e se il motto del gioco non fosse \"Good Night, Good Luck\" non mi sarei mai aspettato una feature simile. \n\nSto per comprare The Following; per ora ho il gioco completo più il DLC per giocare come uno zombie (che ho ricevuto in omaggio) e quello da cinque euro che ti sblocca un paio di vestiti in più e diverse armi nuove; sono parecchio soddisfatto dell'acquisto, e devo ammettere che fino ad ora non ho MAI toccato l'online; si salva bene anche come gioco Singleplayer only, e io l'avevo acquistato per quello, non per il gameplay in multiplayer. :)","replies":[{"poster":"Il Freddo","date":"2016-03-19T14:39:43.998+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CommonDotaPlayer,realm=EUW,application-id=Un6AGJq2,discussion-id=YJ8IjeHG,comment-id=0000,timestamp=2016-03-19T13:35:29.790+0000)\n>\n> Anche io un po' di tempo fa mi appoggiavo alla gente che diceva che le animazioni di arrampicata e scavalcata sono poche, ma poi un mio amico, che \"studia\" per fare l'istruttore di parkour mi ha fatto notare che nella vita reale, a meno che tu non ti stia effettivamente impegnando per fare una bella coreografia, quando fai qualcosa di \"semplice\", come l'appunto, scavalcare muri o arrampicarti, ti ritroverai a fare sempre gli stessi movimenti, senza mai cambiare nemmeno di un centimetro la posizione o la distanza tra mani o piedi, e cose così; da quel punto di vista è davvero realistico.\n> Poi io di parkour non so niente, mi fido di quello che dice.\n> \n> Riguardo ai pochi modelli di zombie concordo, ma si fanno perdonare con la buona varietà di \"razze di zombie\"; i Freschi, i Notturni, i Feroci, i Luminosi, i Bambini e tanti, tanti altri; mi sono ritrovato parecchio sorpreso e soddisfatto nel vederne una così pesante varietà.\n> \n> Infine, secondo me il fattore che durante la notte il gioco diventa più difficile non è affatto scontato; cioè, è nella natura umana il considerare la notte un momento difficile, ma da quando i zombie diventano più forti nelle ore notturne? Solo su Dying Light succede, credo, e se il motto del gioco non fosse \"Good Night, Good Luck\" non mi sarei mai aspettato una feature simile. \n> \n> Sto per comprare The Following; per ora ho il gioco completo più il DLC per giocare come uno zombie (che ho ricevuto in omaggio) e quello da cinque euro che ti sblocca un paio di vestiti in più e diverse armi nuove; sono parecchio soddisfatto dell'acquisto, e devo ammettere che fino ad ora non ho MAI toccato l'online; si salva bene anche come gioco Singleplayer only, e io l'avevo acquistato per quello, non per il gameplay in multiplayer. :)\n\nThe following è una delle espansioni piú riuscite, mischia quest secondafie e primarie in maniera ottima, la fine poi... ne rimarrai confuso e al tempo stesso affascinato.\nConcordo sul parkour ma ti accorgerai che i  the following per scavalcare le frequentissime staccionate( ti ritroverai a fare lo stesso gesto che usi per scavalcare il muro, mi riferivo a quello).\nNon comprare l'orda di bozak che fa schifo, sono 10 euro buttati.","replies":[]}]}]}