{"poster":"Il Freddo","date":"2016-09-20T16:47:05.471+0000","title":"Che belli i team che si creano sul forum","subforum":"Discussioni generali","up_votes":5,"down_votes":1,"body":"Accetto di entrare in un team, al primo game mi mandano adc, ruolo che non so minimamente giocare, secondo game pure ma vengo arato dalla bot platino terzo game in toplane stravinco la lane e quarto game toplane.\r\nVinta,persa,vinta,persa.\r\nIl team si &egrave; sciolto nell&#039;ultimo game, il tizio che cercava membri sul forum &egrave; uscito dal ts senza dire una parola, mi ha eliminato dagli amici e mi ha lasciato il team con gli ultimi 2 tipi dentro.\r\nL&#039;ultimo game &egrave; stato disastroso, solo io ho vinto la lane e facevo danni, avevo il 90% delle kill e tutti hanno feddato, ci&oacute; mi ha provocato l&#039;eliminazione.\r\nI primi a dire :&quot;cerco gente seria no flamer&quot; e poi pingano, provocano e ti rinfacciano ci&oacute; che avresti potuto fare.\r\nMi spiace ma non mi teletrasporto bot per fare un 4v4 quando i nemici sono tutti feddatii.\r\nBeh comunque questo &egrave; stato il primo eultimo team con ragazzini idioti e pure scarsi.\r\nPace","replies":[{"poster":"Black Mantra","date":"2016-09-20T16:56:32.964+0000","up_votes":5,"down_votes":0,"body":"Come ti capisco.... Trovato team qui sul forum, primo giorno grande entusiamo, scambiamoci whatsapp, abbiamo coach, siamo l'accademia di una squadra \"forte\" wow..... vabbhe qualcuno non è prorio il top a giocare ma vabbhe migliorerà :). \n\nOk ragazzi mi raccomando tenetevi liberi 3 giorni a settimana la sera alle 20-21, ci dobbiamo allenare costantemente. Prima settimana, alle 20 tutti presenti, scalpitanti e pronti per giocare mah.... oh no ne manca uno..... vabbhe appuntamento per settimana prossima ragazzi dai. \n\nLunedì tutti presenti, scalpitanti e pronti per giocare mah... oh no problema al pc, si dai può capitare, ragazzi ci becchiamo domani stessa ora mi raccomando.\nMartedì tutti presenti, scalpitanti e pronti per giocare anzi no uno è assente e irraggiungibile..... \n\nNiente paura ragazzi nuovo appuntamento sempre alle 20 mi raccomando eh. \n\nOre 19.00 del giorno prefissato per l'allenamento messaggio su Whatsapp \"Ragazzi il team si è sciolto, Good Luck\" \n\nhttp://65.media.tumblr.com/c261969b41e5033b5312625b6ac88237/tumblr_inline_ntgslfKWCu1sysrze_400.jpg\n\nOMG l'adolescenza","replies":[{"poster":"Hell88","date":"2016-09-20T18:52:43.941+0000","up_votes":2,"down_votes":0,"body":"se eri ragazza e pure bona c'erano tutti nessuno escluso{{summoner:2}}","replies":[{"poster":"NiraBlade","date":"2016-09-20T19:26:39.645+0000","up_votes":3,"down_votes":0,"body":"Insomma xD ho avuto esperienze analoghe, se non addirittura peggiori. Dopo qualche tentativo ho capito che è meglio fare team ranked con gente con cui giochi da un po' piuttosto che con perfetti sconosciuti x)","replies":[{"poster":"Hell88","date":"2016-09-20T19:38:49.334+0000","up_votes":2,"down_votes":0,"body":"sorry allora la tua figaggine non è livello over 9000...sei una URGOTTTTTTTTTTTTTTTTTTTTTTTT","replies":[{"poster":"NiraBlade","date":"2016-09-20T19:43:37.833+0000","up_votes":1,"down_votes":0,"body":"mannaggia, qua mi tocca aspettare la skin star guardian urgottina e shopparmela x)","replies":[]}]}]},{"poster":"Black Mantra","date":"2016-09-20T18:59:53.476+0000","up_votes":2,"down_votes":1,"body":"Tira più un carro di buoi che .... com'è che era ?","replies":[{"poster":"Hell88","date":"2016-09-20T19:00:55.537+0000","up_votes":2,"down_votes":1,"body":"tira più un pelo di uallera (si ci siam capiti) che un carro di buoi :)","replies":[{"poster":"Black Mantra","date":"2016-09-20T19:32:00.965+0000","up_votes":1,"down_votes":0,"body":"No non era uallera mi sono informato .... La uallera è un'altra cosa....","replies":[{"poster":"Hell88","date":"2016-09-20T19:39:31.520+0000","up_votes":1,"down_votes":0,"body":"infatti ho usato uallera per non dire fic...","replies":[{"poster":"Black Mantra","date":"2016-09-20T19:43:44.924+0000","up_votes":1,"down_votes":0,"body":"> Per uallera, in senso “letterale”, si intende l’ernia… ma un tipo di ernia tutta maschile, l’ernia scrotale; da lì in avanti una serie di associazioni ha portato voler associare questa parola al concetto di gonfiore, di pensantezza, fisica e morale, di svogliatezza e, non ultimo, di inferiorità (parecchi ricorderanno un famoso coro da stadio che volava dagli spalti del San Paolo degli anni 60 “Didì, Vavà e Pelè, sìt’ a uallera e Canè”, in cui i tifosi del Napoli relegavano i tre campioni della nazionale brasiliana bi-campione del mondo a piccola cosa rispetto al grande Faustino Canè “o Rey del calcio napoletano di quel periodo.\n> \n> Ma la cosa più interessante di questo termine è la sua origine; infatti esso deriva dalla lingua araba, in particolare dalla parola “wadara” che significa “ernia” e la cui trasformazione uallera, si riconosce attraverso il dialetto siciliano con la parola vaddara per cui il passaggio sarebbe: wadara – vaddara – uallera;\n> \n> niente a che fare, quindi, con la ntoscia e la paposcia che sono sinonimi per quanto riguarda il senso figurato della uallera ma che, analizzati, in senso letterale – perchè, ricordiamocelo, il napoletano non è per niente una lingua approssimativa – sono ben diversi; infatti la ntoscia deriva dal greco enthostídia e si riferisce a un tipo di ernia intestinale, invece la paposcia deriva dal latino parlato papùs e fa riferimentoa un generico rigonfiamento della pancia.\n> \n> Con la speranza di non avervela abbuffata…\n\nAvrei detto un pelo di Nidalee\n\n( lo sapevo il proverbio eh :D )","replies":[]}]}]}]},{"poster":"Sorcio84","date":"2016-09-21T10:00:51.033+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Black Mantra,realm=EUW,application-id=MJVj50Jw,discussion-id=9Pa8OEjF,comment-id=000000000000,timestamp=2016-09-20T18:59:53.476+0000)\n>\n> Tira più un carro di buoi che .... com&#x27;è che era ?\n\nChe un pelo di {{champion:17}}\n___\nTira più una coda di {{champion:103}} che un carro di {{champion:12}} ","replies":[]}]}]}]},{"poster":"Logek","date":"2016-09-20T18:01:49.966+0000","up_votes":2,"down_votes":1,"body":">al primo game mi mandano adc, ruolo che non so minimamente giocare, secondo game pure ma vengo arato dalla bot platino terzo game in toplane stravinco la lane e quarto game toplane.\n\nti è stato chiesto dove volevi giocare,e te hai risposto top o adc ... magari dircelo prima che eri scarso adc? no eh troppo facile :D\n\n>Il team si è sciolto nell'ultimo game, il tizio che cercava membri sul forum è uscito dal ts senza dire una parola, mi ha eliminato dagli amici e mi ha lasciato il team con gli ultimi 2 tipi dentro.\n\nsul post non si è mai parlato di team serio o di diventare \"amici\" \n\n>I primi a dire :\"cerco gente seria no flamer\" e poi pingano, provocano e ti rinfacciano ció che avresti potuto fare.\n\nmai detto ... vatti a rileggere il post di reclutamento; poi dire \" usalo il tp o almeno prendi la tower top\" è un best flame o provocazione\n\n>Mi spiace ma non mi teletrasporto bot per fare un 4v4 quando i nemici sono tutti feddatii.\n\nalmeno pusha al posto di fare un rotate in mid senza motivo più volte\n>Beh comunque questo è stato il primo eultimo team con ragazzini idioti e pure scarsi.\n\nsarai forte te :D in tutti i game che abbiamo fatto assieme passavi il 90% dei game a pushare in top e te ne strafregavi del resto del team,anche con champ che sono da TF,senza mai prendere una torre prima degli altri ... per non parlare di come ti sei comportato oggi che avevamo appuntamento alle 17 ma ti sei codato alle 16,50 facendoci aspettare fino alle 17,40.\nio mi chiedo,magari se la gente ti ha rimosso non è che la colpa è tua?\n\n>è stato il primo eultimo team\n\nmeno male","replies":[{"poster":"Il Freddo","date":"2016-09-20T20:04:11.941+0000","up_votes":2,"down_votes":2,"body":"Detto e ridetto che ero main top, se sei sordo non è colpa mia.\nCome non è colpa mia il fatto che avete feddato chiunque, siete morti 2v1 conntro malphite sottofarmato e non feddato, eravate il mid e il jungler.\nNon so a che gioco giochi tu ma se tutte le lane perdono tranne una, io non mi metto di certo a cercare lo scontro 5v5 ma piuttosto proteggerei le torri e piazzerei le Ward, nessuno ha mai comprato una Pink, fai te.\nL'altro giorno vi ho aspettati per 30 minuti ma non ho fatto pesare niente a nessuno, potevate iniziare senza di me dato che appena sono uscito dal game precedente ho visto che uno del team si era appena startato una partita.\nMeglio cosí, siete infantili e ridicoli, specialmente il support dell'ultimo game, quello che mi ha reclutato. Scarsissimo oltre che fastidioso.\nOra che ricordo sto team è nato per conquistare la ward e non per scalare, fai te.\nParli del mio comportamento quando ve ne siete andati tutti senza dire una parola, sia dal ts che dal team. Coerente","replies":[{"poster":"Logek","date":"2016-09-20T21:15:31.686+0000","up_votes":3,"down_votes":0,"body":">Detto e ridetto che ero main top, se sei sordo non è colpa mia.\n\nti sei presentato come main top/adc ...\n\n>Come non è colpa mia il fatto che avete feddato chiunque, siete morti 2v1 conntro malphite sottofarmato e non feddato, eravate il mid e il jungler.\n\nil punto è che te non facevi nulla per sfruttare il roaming di malph e non tippavi ... se avessi pushato prendevi l'inibitor per quanto ha rommato quel malph in quel game.\nal contrario nel game in cui hai gicoato malph non ti sei comportato come lui e infatti eri abbastanza inutile,visto che splittavi con malphite ...\n\n>Non so a che gioco giochi tu ma se tutte le lane perdono tranne una, io non mi metto di certo a cercare lo scontro 5v5\n\nnon si trattava di 5v5 ma di 3v2 ... ma si vede che sei abbastanza nabbo e non sai utilizzar e il tp. un consiglio,la prossima volta mettiti ignite tanto il tp te non lo usi.\n\n>L'altro giorno vi ho aspettati per 30 minuti ma non ho fatto pesare niente a nessuno\n\nti abbiamo aspettato ogni volta ...\n\n>potevate iniziare senza di me dato che appena sono uscito dal game precedente ho visto che uno del team si era appena startato una partita\n\nera in game da tipo 20 minuti,infatti ha finito alle 17 al contrario di te.\n\n>Meglio cosí, siete infantili e ridicoli,specialmente il support dell'ultimo game, quello che mi ha reclutato. Scarsissimo oltre che fastidioso.\n\na me sembri più ridicolo te che ti credi chissà chi.\n\n>Ora che ricordo sto team è nato per conquistare la ward e non per scalare, fai te.\n\nse non si vince,non si ottengono pnt ... preferisco non ottenerla,piuttosto che farmi il sangue amaro per _**vincere**_ ancora 8 game,che probabilmente sarebbero stati tipo una 30ina di game con player del tuo calibro.\n\n>Parli del mio comportamento quando ve ne siete andati tutti senza dire una parola, sia dal ts che dal team\n\nte invece parlavi molto eh? ah no non hai mai fiatato,neanche in game ...","replies":[]}]}]},{"poster":"Kim114","date":"2016-09-20T17:12:22.013+0000","up_votes":2,"down_votes":0,"body":"Amen fratello","replies":[]},{"poster":"Khuzare","date":"2016-09-20T17:09:06.005+0000","up_votes":2,"down_votes":0,"body":"Non è facile creare un team dove non ci si conosce, infatti i primi passi di una squadra sono quasi sempr incerti. \n\nIo invece sto avendo una esperienza positiva con dei ragazzi conosciuti pochi giorni fa sul forum.\n\nMagari voi che avete avuto queste esperienze potete unirvi, sapendo già che cosa si aspetta l'altro.","replies":[]},{"poster":"Frattaglia","date":"2016-09-21T10:48:39.036+0000","up_votes":1,"down_votes":0,"body":"Chiudo e vi invito a chiarirvi in privato.","replies":[]},{"poster":"FNC Glacya","date":"2016-09-20T17:12:38.459+0000","up_votes":1,"down_votes":0,"body":"Io cerco un team... sono bravo top e support ma mi piace di più support.","replies":[]}]}