{"poster":"Il Freddo","date":"2016-02-27T01:29:16.207+0000","title":"wow","subforum":"Discussioni generali","up_votes":6,"down_votes":2,"body":"Tryhardare come un disperato in una normal pensando che sia ranked &egrave; come dare il massimo in un una partita di campionato per poi scoprire che era sono un&#039;amichevole.\r\nChe brutto paragone, io odio il calcio ma &egrave; il primo che mi &egrave; venuto in mente.\r\nComunque si, state leggendo il thread di un tizio che ha dato l&#039;anima per un game e al momento della ricompensa si &egrave; accorto del suo fail.\r\nHo vinto praticamente la partita da solo con olaf, ero enorme.\r\nLa parte divertente &egrave; che tutto esaltato dallo score, starto una ranked dicendo ai miei amici: ho appena carriato con olaf, questa la vinciamo, ci penso io.\r\nprendo olaf. defeat.\r\n\r\n\r\nNon &egrave; un QQ post, spero solo di strapparvi un sorriso da questa vicenda","replies":[{"poster":"GreenArroww","date":"2016-02-27T10:12:10.470+0000","up_votes":3,"down_votes":0,"body":"Unlucky","replies":[]},{"poster":"73668109_DEL","date":"2016-02-27T14:47:06.047+0000","up_votes":1,"down_votes":0,"body":"Il bello viene , quando accade l'inverso .\nOvvero credi di giocare normal e invece è ranked , pa pa paaaaaaaaa spam di surr at 20 .\nSei stato retrocesso .","replies":[{"poster":"Il Freddo","date":"2016-02-27T16:38:40.317+0000","up_votes":1,"down_votes":0,"body":"Pfff quello mi è già successo un paio di volte","replies":[]}]},{"poster":"NicogenFTW","date":"2016-02-27T10:56:06.120+0000","up_votes":1,"down_votes":0,"body":"Successo lo stesso tempo fa, che delusione alla fine del game asd","replies":[]},{"poster":"Best Chair Euw","date":"2016-02-27T10:51:14.035+0000","up_votes":1,"down_votes":0,"body":"È successo anche con un mio amico tempo fa. Io ero top e lui jung. Non capivo perché ma lo sentivo in chiamata che voleva vincere a tutti i costi, tryhardando over 9000, e non capivo come mai...a fine partita (vinta) mi dice \"ma dove sono gli LP?\" xD \"ehm è una normal...\"","replies":[]}]}