{"poster":"Il Freddo","date":"2017-11-12T16:15:46.710+0000","title":"YASUO TANK IS BACK","subforum":"Discussioni generali","up_votes":1,"down_votes":4,"body":"ebbene si, testato personalmente, questo set di rune rende yasuo ridicolmente tankoso in quanto &egrave; un campione che basa tutta la sua laning phase sul vantaggio di minion rispetto all&#039;avversario e sul fare brevi ma frequenti trade. \r\nSenza contare che il tornado &egrave; contato come AA e quindi procca tutti gli effetti di &quot;presa dell&#039;immortale&quot;.\r\nIn sintesi: Pi&ugrave; passa il tempo e pi&ugrave; yasuo ottiene hp e resistenze, la parola chiave &egrave; &quot;push&quot; perch&egrave; ogni 45 sec, il samurai ha a disposizione un&#039;attacco potenziato contro la torre che scala con hp max.\r\n\r\nhttp://euw.leagueoflegends.com/it/featured/preseason-update/8400-8437?build=30120038\r\n\r\nOvviamente si possono creare delle varianti a questo tipo di set ma il primo ramo rimane sempre pressoch&egrave; invariato.","replies":[{"poster":"NOLIMIT Vladimir","date":"2017-11-12T16:19:02.176+0000","up_votes":1,"down_votes":0,"body":"Ora la domanda è: perchè dovresti giocare Yasuo tank quando con le stesse rune e build ci sono altri 20 mila campioni fatti apposta per essere giocati così?\nInoltre: lo hai giocato in 3v3, non hai manco fatto la PD, a me pare che tahm abbia fatto piu di te in quella partita, eravate gia 2 tank potevi buildarti danno,malphite trollava ","replies":[{"poster":"Il Freddo","date":"2017-11-12T18:11:08.796+0000","up_votes":1,"down_votes":0,"body":"madonna che stalker, non ho solo un'account, ho fatto decine di esperimenti e quello era un tentativo nella selva ma come ho detto, più va avanti il game e più questo set lo rende resistente quindi non worka bene nelle 3v3.\nYasuo è quanto di più fastidioso esista in questo mondo, perchè ha il danno di un'adc essendo combattente, grazie a questo set diventa un semibruiser semplicemente restando il linea.\nsto sperimentando diverse combinazioni perchè sono giunto alla conclusione che yasuo worka meglio con del rubavita in early.","replies":[{"poster":"Master Caos98","date":"2017-11-12T19:45:07.805+0000","up_votes":1,"down_votes":0,"body":"Meglio Darius che un yasuo tank.","replies":[]}]}]},{"poster":"Darth Ponzius","date":"2017-11-12T17:15:34.792+0000","up_votes":1,"down_votes":0,"body":"Non so a te, ma una singola partita in 3 vs 3 con nessun item da tank non mi pare una gran prova.","replies":[{"poster":"Il Freddo","date":"2017-11-12T18:12:26.028+0000","up_votes":1,"down_votes":0,"body":"l'ho testato sul mio account secondario, genio :)","replies":[{"poster":"Darth Ponzius","date":"2017-11-12T18:58:31.591+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Retox,realm=EUW,application-id=MJVj50Jw,discussion-id=JLWkpt5t,comment-id=00010000,timestamp=2017-11-12T18:12:26.028+0000)\n>\n> l&#x27;ho testato sul mio account secondario, genio :)\n\nallora portaci questi test caro, perchè la cosa continua a non avere molto senso visto che quando workava era una combinazione di varie cose (fervor, sunfire, E con più danno e maxabile come prima skill, ulti con armor pen su qualunque attacco etc), mettere solamente il grasp non gli regala molto danno gratuito pur buildando tank.","replies":[]}]}]}]}