{"poster":"GoldSolace","date":"2018-06-03T03:33:45.303+0000","title":"Toxic Banning of Champions","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"Why is it that your team is allowed to ban champions that you have hovered indicating you want to play them?\r\nI just queue&#039;d for a game with what I can only guess was a group of 4 who banned my champion then starting swearing and flaming me in the chat. I dodged the game by not selecting a champion to ban and re-queue&#039;d only to be placed in the same game with those 4 again who all selected my champion then banned it continuing to flame me. I dodged again and got put on a queue block timer. Why would I want to play a 20-40 minute game with those players who I can only guess would be even worse once in the game. They demonstrate toxic behaviour and I&#039;m punished because I&#039;d rather not suffer from it.\r\n\r\nI&#039;ve had this happen multiple times so why not prevent the same team from banning a champion you&#039;ve selected?","replies":[{"poster":"Lord Sesshomaru","date":"2018-06-03T05:24:04.761+0000","up_votes":1,"down_votes":0,"body":"Honestly, I do ban champs from my own team occasionally.\n\nNot with the intent of being toxic of course.\n\n**E.g.** Say our last pick wants to play one of 'those' champs like; Yasuo or Yi or Trynd or Zed etc etc. He's last pick, Yasuo/Zed is SUCH a popular champ. The chances of him being not picked by the enemy until last pick are somewhat low.\n\nAnd Im not going to pick Yasuo for him, because chances are: if they play Yasuo, they aren't going to have champs like Sol or Azir, that I most likely will want to play. Nor are they likely to have the whole collection of mid laners available if I want to counter pick a certain champ/comp.","replies":[]},{"poster":"TheDemonEmperor","date":"2018-06-03T03:41:26.206+0000","up_votes":1,"down_votes":0,"body":"You cant ask a company to change how people think. This is a gaming org, not a religious cult. There will always be toxic behaviors. \n\nThat aside, your champ might be OP and you're too low on the list to pick the champ, so it would be wise to ban it.","replies":[{"poster":"GoldSolace","date":"2018-06-03T04:17:56.429+0000","up_votes":1,"down_votes":0,"body":"Didn't once ask them to change how people think so I'm not sure why you brought that up. I asked why they don't prevent teams from banning champions selected by other players. \n\nAlso even If I'm first pick they can ban my champion so your justification doesn't cover all bases. \n\nI could go into a game, see what champions my team have selected and ban one of them every game I ever play and this is allowable behaviour. \nI'm not sure why the pre-ban champ selection was added to league but it makes sense that it's to indicate to your team that shouldn't ban that champion.","replies":[{"poster":"TheDemonEmperor","date":"2018-06-03T04:33:23.093+0000","up_votes":1,"down_votes":1,"body":"They will bitch about your pick ingame, you are not solving anything. Even if you are playing your selected champ; People who see it as a troll pick, will continue to put hate on it.\n\nThen what? are you gonna post how hateful people can be?","replies":[]}]}]}]}