{"poster":"Xerogears","date":"2016-07-29T07:10:26.667+0000","title":"Se les fue la mano con los nerfeos a azir y te lo muestro con datos estadísticos","subforum":"Charlas Generales","up_votes":10,"down_votes":4,"body":"Hola vengo a compartirles una opini&oacute;n fundamentada con pruebas. \r\nAzir a recibido parche tras parche un nerfeo constante, se podr&iacute;a considerar que es para que no sea tan fruta, pero llego a un punto en el cual ya no sirve de nada, les comparto 2 capturas las cuales toma de champion.gg una pagina de estad&iacute;sticas de jugadores:\r\n\r\n\r\nhttps://imageshack.us/i/pmrTzjiBp\r\n\r\n\r\n en una puede apreciarse una brutal ca&iacute;da del rate de victorias de un aceptable 47% (para quienes no lo sepan para considerase un bueno rate tiene que rondar el %50 de victorias) a un horrible 41%, algo realmente terrible, y tambi&eacute;n podemos apreciar la ca&iacute;da en absolutamente todas sus estad&iacute;sticas.\r\n\r\nhttps://imageshack.us/i/poQa505Cj\r\n\r\nEn la segunda imagen se puede ver el top en el que se encuentra y es tristemente el segundo peor mid despu&eacute;s de ryze, incluso nerfiadin esta unos cuanto lugares por encima de azir.\r\n\r\nRealmente es una tristeza, azir era unos de mis main y me fascina todo sus mec&aacute;nicas y asta su historia, pero debido a los continuos nerfeos no solo paso a ser un campe&oacute;n mediocre sino que mucho peor, a un campe&oacute;n de ba&uacute;l olvidado.\r\n\r\nMuchos dir&aacute;n que es un campe&oacute;n para late game, si es verdad, pero este campe&oacute;n no pasa del erly ni de broma, su poca vida y resistencia acompa&ntilde;ado de un jungla enemigo como unas pocos neuronas funcionando pueden matarte tranquilamente bajo torre. si juegas pasivo se te va el mid a las otras lineas y si intentas seguirlo te termina matando en el rio, esa es la historia de mi vida con azir mid.\r\n\r\ny ustedes que piensa?","replies":[{"poster":"Yo la amaba wum","date":"2016-07-29T12:07:12.775+0000","up_votes":5,"down_votes":1,"body":"Como main Azir (o ex, en verdad no se, me aburrieron los constantes nerfeos hacia el...) lo considero uno de los personajes con los cuales tienes que tener dos dedos de frente para jugarlo, Azir es como un ADC mas en el equipo, sus nerfeos se deben al spameo que tenia en las partidas competitivas, LCS, etc. Pero seamos sinceros, tampoco tenia EL WINRATE... (hablo antes del nerfeo de su R y el daño de la W a las torres, el cual me pareció el único nerfeo correcto...) Ahora no le encuentro la gracia esperar hasta el minuto 40-50 para poder ver al Azir que era antes (no en todas las partidas te vas a fedear...) Su daño se debe a su fragilidad, a Azir le metes un cc y lo desapareces, eso compensa su gran daño, al igual que varios campeones que suelen pegar una barbaridad, pero no aguantan casi nada. Estuve viendo un video de RedMercy donde el se mostraba algo descontento con lo que planea hacer Riot con Azir, algo a lo que el denomino como \"La muerte de Azir\"... Un supuesto rework con el cual planean quitarle el conocido \"Shurima Shuffle\" y CREO que le pondrían vida a sus soldados, ademas de que este rework pretende hacer al campeón mas facil, pero como dice un comentario de dicho video:\n\n\"Prefiero este Azir con 40% de win rate antes que un Azir facil con un mayor winrate.\"\n\nSi te interesa el video, aqui te lo dejo\n\nhttps://www.youtube.com/watch?v=wKLvmy__f2E","replies":[{"poster":"L9 Letalis Umbra","date":"2016-07-29T19:11:09.438+0000","up_votes":1,"down_votes":0,"body":"Además que casi ni tiene escape con lo de frenarse cuando chocas con un enemigo con la e, a veces hasta por un pixel se frena y te deja vendido","replies":[]},{"poster":"CoronavirusC0V","date":"2016-07-29T17:15:25.848+0000","up_votes":1,"down_votes":1,"body":"hola , te tengo agregado xDDD","replies":[]}]},{"poster":"LGBT Valentina","date":"2016-07-30T02:14:28.523+0000","up_votes":2,"down_votes":0,"body":"Pocas debilidades\n\nEl win rate, no justifica el win rate del champ\n\nSigue teniendo un win rate alto para todo el que lo sepa usar\n\nEs un lee ap\nTiene mas daño que alguien a mele, es long range a su vez, limpia wave facil, el soldado no lo podes matar, movilidad muy alta, engange y disangage, burts alto (por el thunder de mierda...), DPS alto\n\nLa unica debilidad en si, es que es \"squish\" dentro de todo, no para lo que es un mago\n\n\nSe lo merecia? Se, pero ya dijieron que van a hacerle un rework","replies":[{"poster":"StephenLegends","date":"2016-07-30T04:24:57.704+0000","up_votes":2,"down_votes":0,"body":"Y tremendamente difícil para hacer todo lo que dijiste.","replies":[]}]},{"poster":"Ivosch","date":"2016-07-29T23:18:41.565+0000","up_votes":2,"down_votes":0,"body":"le hicieron la gran kassadin\n{{champion:268}}  = {{champion:38}}","replies":[]},{"poster":"FurchiDC","date":"2016-07-29T20:13:45.842+0000","up_votes":2,"down_votes":0,"body":"Según Riot Gaussrik, el problema no es el winrate general sino el winrate de la gente que domina a Azir. Según él, el winrate de los jugadores expertos con Azir era ridículamente alto. \n\nTambién maineo Azir, y lo siento cada vez más inútil. Me pasa lo mismo que decís: \n\n_Este campeón no pasa del early ni de broma, su poca vida y resistencia acompañado de un jungla enemigo como unas pocos neuronas funcionando pueden matarte tranquilamente bajo torre. si juegas pasivo se te va el mid a las otras lineas y si intentas seguirlo te termina matando en el rio, esa es la historia de mi vida con azir mid._\n\nSalvo que el mid enemigo sea tan amateur como para pasearse entre mis soldados o acercarse cuando tengo la Q sin CD, se hace muy complicado. \n\n--\n>Saludos. {{champion:134}} {{item:3211}} {{champion:84}}","replies":[]},{"poster":"ZanahoriaAsesina","date":"2016-07-29T12:29:33.715+0000","up_votes":2,"down_votes":0,"body":"Perdón nada que ver pero es mas fácil subir la imagen en vez del link hacia la misma, asi queda mas linda tu discusion  :p\n\n\n-> http://imageshack.us/a/img922/9568/rTzjiB.png -> http://imageshack.us/a/img924/5555/Qa505C.jpg","replies":[]},{"poster":"Yellow Sphere","date":"2016-07-29T08:50:10.803+0000","up_votes":3,"down_votes":2,"body":"Hace unos días estuvo Azir en rotación semanal, y tuve la oportunidad de usarlo por primera vez en un ARAM. No recuerdo cuántas veces me mataron pero recuerdo que terminé con 10 kills. Si un noob como yo terminó con 10 kills en una partida relativamente corta para lo que es ARAM, no creo que esté tan nerfeado, más allá de los tecnicismos.","replies":[{"poster":"Dog Bulling","date":"2016-07-29T23:27:36.077+0000","up_votes":1,"down_votes":0,"body":"Eso es porque la pasiva de azir lo hace mucho más fuerte en aram que en la grieta","replies":[]}]},{"poster":"Supasanik","date":"2016-07-29T14:07:32.108+0000","up_votes":2,"down_votes":1,"body":"Se pasaron con el nerfeo, pero por que el nerfeo??? Fácil porque solo era spamear w y q y antes (creo) los soldados atacaban las torres entonces en lane morias una vez chau torre y en tf era la cosa mas oooop con esa ulti y con el gran spameo >:v. Pero ahora es meno de la mitad que el azir de antes y es muy tonto esperar hasta el min 30 para ver la gran magia del azir de antes :'v el nerfeo fue bueno hasta un punto y ahora es bastante difícil (y eso me gusta ewe) poca vida y poco daño en los primeros minutos, 20 min después no lo mata nadie por que el los mata xD. El nerfeo me gusto pero hasta un punto .3.  Saludos!","replies":[{"poster":"Pablidoc","date":"2016-07-29T22:06:39.921+0000","up_votes":1,"down_votes":0,"body":"Ahora no podes hacer nada con Azir en las TF, el miercoles jugue una Ranked con Azir iba todo bien, llegan las TF meto a los 5 bajo 2da torre de bot y nada como el muro dura tan poco no haces nada.","replies":[]},{"poster":"V L A D I M Y R ","date":"2016-07-29T18:24:51.914+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Supasanik,realm=LAS,application-id=v7qsfXsE,discussion-id=nBe5y6MZ,comment-id=0007,timestamp=2016-07-29T14:07:32.108+0000)\n>\n> Se pasaron con el nerfeo, pero por que el nerfeo??? Fácil porque solo era spamear w y q y antes (creo) los soldados atacaban las torres entonces en lane morias una vez chau torre y en tf era la cosa mas oooop con esa ulti y con el gran spameo &gt;:v. Pero ahora es meno de la mitad que el azir de antes y es muy tonto esperar hasta el min 30 para ver la gran magia del azir de antes :&#x27;v el nerfeo fue bueno hasta un punto y ahora es bastante difícil (y eso me gusta ewe) poca vida y poco daño en los primeros minutos, 20 min después no lo mata nadie por que el los mata xD. El nerfeo me gusto pero hasta un punto .3.  Saludos!\n\nAntes podias tirarle tu W a las torretas y les hacias daño :'c  , ahora ni eso.{{champion:32}}","replies":[]}]},{"poster":"Borriic II","date":"2016-07-29T08:34:50.647+0000","up_votes":2,"down_votes":1,"body":"el problema con azir es que una vez se pone por delante en la partida o adelanta su late gracias a su jungla se vuelve muy complicado jugarle en contra ya que puede hacer daño de rafaga y sostenido a una distancia segura y frenar cualquier intento de iniciacion con su ult, eso sumado a un escape hacia que jugar contra el fuera un verdadero dolor de cabeza (ojo, solo contra los azir buenos que maineaban el personaje y tenian experiencia, los demas al ser un campeon dificil solian morir en todas las tf)\n\nactualmente esta \"debil\" (aun destroza todo si se pone por delante) y tiene un bajisimo win rate por la cantidad de jugadores sin habilidad que lo spamean partida tras partida, pero al igual que lo que pasa con ryze, jugadores habiles hacen destrozos con esos personajes, espero que rito le de un poco de amor a azir porque si es verdad que se les fue la mano con los nerfeos (sobre todo el nerf a la ult que ahora es un chiste :/ ) pero es probable que si le bufean le nerfeen tambien algun escalado, toca estar atentos :)","replies":[{"poster":"CoronavirusC0V","date":"2016-07-29T17:27:22.377+0000","up_votes":1,"down_votes":0,"body":"la verdad es que prefiero que dure mas y haga menos daño a que haga daño aceptable pero dure una mierda,sinceramente es la ulti no parece durar nada, se te avalanzan te alcanzan al toque, deberia durar almenos 4.5 seg segun mi opinion","replies":[]}]},{"poster":"ll Leoh ll","date":"2016-07-29T07:57:57.333+0000","up_votes":2,"down_votes":1,"body":"es por que su kit es muy bueno y planean hacerle algo como un rework","replies":[]},{"poster":"lanchi123","date":"2016-07-30T02:27:55.915+0000","up_votes":1,"down_votes":1,"body":"Y esto cómo afecta a Demacia? {{champion:86}}","replies":[{"poster":"Matas23","date":"2016-08-01T21:26:25.857+0000","up_votes":1,"down_votes":0,"body":"Y a Noxus?{{champion:122}} .","replies":[]}]},{"poster":"panther189","date":"2016-07-29T14:49:37.051+0000","up_votes":1,"down_votes":0,"body":"Azir esta bien, esa pagina te muestra la estadistica de todas las ligas, si no basams en op.gg\ntenemos en el ultimo mes.\nChallenger 51.97%\nMaestro \t48.53%\nDiamante  45.55%\nplatino 44.49%\noro  44.41%\nplata 44.77%\nbronce 42.58%\n\nEn conclusion, los buenos jugadores le siguen sacando provecho.","replies":[{"poster":"Shijim4 de Virgo","date":"2016-07-29T16:15:26.787+0000","up_votes":1,"down_votes":0,"body":"Seguro maestro yi y garen tienen esas estadisticas pero al revez :P","replies":[]}]},{"poster":"XxlentaoxX","date":"2016-07-30T06:08:24.200+0000","up_votes":1,"down_votes":0,"body":"Pasa que Riot no sabe hacer algo tan simple como diferenciar a los jugadores normales a los de la LCS.\nEstamos de acuerdo que campeones como GP cuando salio el rework estaban rotos en soloQ y doblemente en competitivo, bien, después del segundo nerf GP quedo totalmente balanceado ¿pero que pasa? en competitivo, con 5 pibes que viven juntos, juegan todo el día juntos, completa coordinación, GP seguía haciendo destrozos, otro nerf y quedo inútil en soloQ. ¿Que decide hacer Riot? dynamicQ, posibilidad de jugar de a 5 como en la LCS y sacar el mayor potencial a un campeón PERO A MI ME GUSTA JUGAR SOLO. Seria tan simple como ligeras diferencias en el balance entre una cola soloQ y una de ranked team, con eso se soluciona todo, y obviamente el competitivo iría con las características de balance de ranked team. SIN DYNAMICQ.\nEsa es mi humilde opinión, y posible teoría para la solución de dicho problema, que Riot aborda mal.","replies":[]},{"poster":"DanielGarrita","date":"2016-07-30T02:38:36.925+0000","up_votes":1,"down_votes":0,"body":"pobre azir, igual probe ryze, yo pense que estaba roto, porque a nivel 3 en un trade le dejas media vida a culquier mid y a la segunda vez con el ignite lo matas.","replies":[]},{"poster":"Dog Bulling","date":"2016-07-29T23:54:12.770+0000","up_votes":1,"down_votes":0,"body":"Mi hermano incluso dejo el juego por los constantes nerfeos a su campeón favorito. Y es que es verdad, no es lo que era ni de broma, ni siquiera en late funciona decentemente. \n\nNo entiendo la manía de SHIOT de nerfear por aparecer en la LCS, CUANDO EL 99,9% DE SUS JUGADORES NO SON CHALLENGER. Pasó con kalista, con Poppy, con Gangplank, con Ryze, con Alistar, con Lulu, con Rek sai, con Tahm Kench, con Kassadin, entre muchos otros.\n\nSiendo honesto ya cansa y mucho como es que RITO solo se centre en un espectáculo que muchos ni vemos porque juegan tan pasivo que ni los comentaristas saben que narrar.","replies":[]},{"poster":"Kyousuke","date":"2016-07-29T07:26:38.345+0000","up_votes":1,"down_votes":1,"body":"y {{champion:203}} ? paso de god tier a 47% de win rate osea XD","replies":[{"poster":"Dog Bulling","date":"2016-07-29T23:30:18.255+0000","up_votes":1,"down_votes":0,"body":"Al menos esta utilizable y hace decentemente su función. Azir ni eso.","replies":[{"poster":"Kyousuke","date":"2016-07-29T23:36:09.792+0000","up_votes":1,"down_votes":0,"body":"azir sigue haciendo de las suyas, con 2 items te explota de lejos y sigue haciendo sus shurima suffles por algo se sigue usando profesionalmente","replies":[]}]}]},{"poster":"alter","date":"2016-07-29T20:25:56.663+0000","up_votes":1,"down_votes":0,"body":"3  Cosas en contra de Azir en este momento:\n1- Lo de sacarle el daño a torres con la W fue ridículo.\n2- Que el rango del casteo de la W sea menor que el del ataque básico es aún más ridículo.\n3- Y el oro que da destruir la torre de su pasiva es demasiado, ridículo tambien.\n\n{{item:3070}} {{champion:268}} {{item:3070}}","replies":[]},{"poster":"CoronavirusC0V","date":"2016-07-29T17:14:55.338+0000","up_votes":1,"down_votes":0,"body":"segun tu es inutil pero para mi es realmente op cuando se sabe usar, enserio, llevo mas de 7 partidas seguidas ganadas con el y en verdad no es tenido problema, el nerfeo esta merecido yo tambien me queje cuando se los hicieron, me sigo quejando de el nerf de la ulti pero la verdad es que si se lo merecia por que estaba muy fuerte, alguien que sabia usar el champ causaba destrozos por donde pasaba, tenia un early bastante fuerte siendo un champ considerado de late, lo que hicieron fue quitarle ese gran poder que ejercia en early y su capacidad en tf ya que era bastante fuerte tambien, aun asi sigue estando bien, se necesitan manos para sacarle provecho y de ahi se va a notar cuando un azir es bueno o malo, para mi esta muy bien balanceado actualmente","replies":[]},{"poster":"XsR reddaS","date":"2016-07-29T09:41:50.418+0000","up_votes":1,"down_votes":6,"body":"asi lo dejan de spamear en el competitivo :V","replies":[]}]}