{"poster":"PDaka","date":"2017-11-13T16:26:15.021+0000","title":"Una pregunta para todos los que se quejan de la EA y que perdieron \"Las ganas\"","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"SI dicen que perdieron las ganas de jugar por ganar poca EA, diganme, juegan por diversion o por EA? Cuantos campeons quieren? Que haran con tanto EA, no los entiendo realmente.\n\nEDIT: LA PREGUNTA ES ENSERIO, RESPONDAN","replies":[{"poster":"TSW Rorschach","date":"2017-11-13T17:03:14.873+0000","up_votes":1,"down_votes":0,"body":"Por ambas. Considerando que antes partida a partida ibas viendo que te faltaba menos para un campeón, ahora es algo desalentador pensar que tenés que subir de lvl para recién ver el esfuerzo ahi. Yo quiero comprarme todos los champs, el tema es que se siente mucho más lento el recorrido a ello.","replies":[{"poster":"PDaka","date":"2017-11-13T17:05:47.155+0000","up_votes":1,"down_votes":0,"body":"No disfrutas las partidas?","replies":[{"poster":"TSW Rorschach","date":"2017-11-13T17:07:40.220+0000","up_votes":2,"down_votes":0,"body":"Nunca dije que no las disfrutara ~~aunque claro, hay cada partida~~, sino que acumular esencia para conseguir todos los campeones se siente más desalentador.","replies":[{"poster":"PDaka","date":"2017-11-13T17:16:55.069+0000","up_votes":1,"down_votes":0,"body":"Interesante, yo por mi parte tengo pocos pero esta bien tu causa","replies":[]}]}]}]},{"poster":"Hell Darking","date":"2017-11-13T16:58:55.189+0000","up_votes":2,"down_votes":0,"body":"juegan por diversion o por EA? \nPor ambas, pero cuando ganas una partida y no ganas nada (aparte del exp) se siente que de verdad. no ganaste\ncon el sistema antiguo cuando ganabas y veias esos jugosos 200 de pi, se sentia como una victoria de verdad\n(a su ves cuando perdias y veias esos miseros 20 de pi, si se sentia la derrota mas pesada)\n\nCuantos campeons quieren? \nTodos, no es la meta de la gran mayoria aca? sacar todos los campeones?\n\nQue haran con tanto EA?\nComprar campeones (riot ya confirmo otros 2 campeones nuevos para el proximo año) y subir los campeones de maestria","replies":[{"poster":"PDaka","date":"2017-11-13T17:06:25.343+0000","up_votes":1,"down_votes":1,"body":"xD, yo solo quiero los que me gusten, no todos, pero es buena opinion igual","replies":[]}]},{"poster":"Deigex","date":"2017-11-13T19:11:39.637+0000","up_votes":1,"down_votes":0,"body":"Ya tengo todo el contenido del juego disponible por EA aunque podría comprar las pág de runas faltantes pero si para smurfear es molesto.","replies":[]},{"poster":"NLG Walter","date":"2017-11-13T17:27:16.119+0000","up_votes":1,"down_votes":0,"body":"Perdi el interes, tengo todos los campeones adquiridos en 2 años de juego, pero haciendo calculos a ojo es imposible subir a maestria 7 todos los campeones y comprar las 20 paginas de runas, podria tomar 5 años juntar esa cantidad de EA.","replies":[]},{"poster":"Hïtler","date":"2017-11-13T18:55:02.058+0000","up_votes":1,"down_votes":1,"body":"Gotta catch 'em all\n\nhttps://i.imgur.com/orQc42F.gif","replies":[]}]}