{"poster":"THE RlVER KlNG","date":"2016-11-20T19:38:52.768+0000","title":"Courage of the Colossus is disgusting on Riven","subforum":"Gameplay","up_votes":32,"down_votes":8,"body":"She builds typical lifesteal attack damage bruiser and literally becomes unkillable. You have to keep her perma-CCed so she can&#039;t keep being permashielded and lifesteal back to full with two autos. It&#039;s disgustingly unfun to play against and totally breaks an already aggravating champion. Forget Poppy, forget Hecarim, this shit is cancerous.\n\nEDIT: I'm not saying Riven is the only abuse case, she just happens to be a particularly toxic offender. Mao, Naut, Zac, Darius, etc. are all still annoying to face with this mastery.","replies":[{"poster":"Astôlfo","date":"2016-11-20T21:35:32.193+0000","up_votes":19,"down_votes":2,"body":"\"Let's put a massive shield that anyone with CC can use.\"\n\"Because there's _totally_ never been any cases with people abusing tank builds/masteries where they weren't supposed to.\"\n\n#RIOT 2016","replies":[{"poster":"Saianna","date":"2016-11-20T21:46:42.139+0000","up_votes":2,"down_votes":2,"body":"Don't worry, they will nerf CoC just right after heavy nerfs to tank items, cause why not ;P","replies":[{"poster":"Astôlfo","date":"2016-11-20T21:49:54.728+0000","up_votes":14,"down_votes":0,"body":"# SEJUANI FLASHBACKS\n# SHYVANA FLASHBACKS","replies":[{"poster":"Marshbouy","date":"2016-11-20T22:09:05.620+0000","up_votes":3,"down_votes":6,"body":"Am a i allowed to say nidalee SOTA flashbacks or no...","replies":[{"poster":"The Deckowner","date":"2016-11-21T05:21:45.102+0000","up_votes":2,"down_votes":0,"body":"no","replies":[{"poster":"Marshbouy","date":"2016-11-21T23:39:42.878+0000","up_votes":1,"down_votes":1,"body":"Why exactly? Is it because the changes haven't been out long enough or just that everyone hates nidalee too much to care that she was gutted.","replies":[{"poster":"The Deckowner","date":"2016-11-22T02:54:35.805+0000","up_votes":1,"down_votes":0,"body":"Because Sejuani and Shyvana was garbage tier until cinderhulk/sated devourer bring them back to the meta, which Rito heavily nerfed the champion, then erfed/removed the item afterward, leaving the champion in a worse state than their initial state. This is generally known as Sejuani'd.\n\nMeanwhile Nidalee is strong and had been top tier jungler all along even before SOTA was a mastery, the nerfs to Nidalee had nothing to do with SOTA, and Nidalee is still an obnoxious champion.","replies":[{"poster":"Marshbouy","date":"2016-11-22T02:57:37.065+0000","up_votes":1,"down_votes":1,"body":">Meanwhile Nidalee is strong and had been top tier jungler all along even before SOTA was a mastery, the nerfs to Nidalee had nothing to do with SOTA, and Nidalee is still an obnoxious champion.\n\nNidalee had been a strong jungler, but SOTA pushed her over the edge so riot started spamming nerfs in her direction. She was nerfed again and again because her sustain with SOTA plus it's tankiness given was just too much. \n>the nerfs to Nidalee had nothing to do with SOTA\n\nthat's bs. She got so much removed during season 6 due to SOTA buffing her so hard, I'm gonna make a list of her season 6 nerfs soon. \n>Nidalee is still an obnoxious champion.\n\ndefine obnoxious.","replies":[{"poster":"The Deckowner","date":"2016-11-22T03:04:10.991+0000","up_votes":1,"down_votes":0,"body":"Nidalee's heal comes from her blue buff E spam on cooldown.\n\nHer tankyness comes from being 2 levels ahead of the enemy jungle because of retarded clear speed.\n\nEVERYONE was using SOTA in the jungle in season 6, saying that SOTA cuses her to be nerfed is flat out BS.\n\nA vhamoion who can almost 100% get ahead of the enemy by simply playing pure PVE is fucking obnoxious.","replies":[{"poster":"Marshbouy","date":"2016-11-22T03:16:58.310+0000","up_votes":1,"down_votes":0,"body":"You have never played nidalee before, it's painfully obvious. \n>Nidalee's heal comes from her blue buff E spam on cooldown.\n\nheal was nerfed. It barely heals for anything early game too. If you are at 1% hp early game, you will only be healed for about 50, give or take a few health points from AP runes. \n>EVERYONE was using SOTA in the jungle in season 6, saying that SOTA cuses her to be nerfed is flat out BS.\n\nso it's just a coincidence that she started getting a cascade of nerfs during season 6? Read through her patch notes, it's just hit after hit after hit. \n>A vhamoion who can almost 100% get ahead of the enemy by simply playing pure PVE is fucking obnoxious.\n\nif you are playing pure PVE on nidalee you are failing as a player and you will not be ahead, you will fall off. \n\nSure she's good in LCS. But that's never stopped people from wanting to buff {{champion:268}} {{champion:98}} etc... If she has to be gutted for LCS reasons, i get that, i'll deal with it. Doesn't mean i can't claim she is gutted. \n\nIf her winrate magically jumps to 47-50% in the next few weeks to months, i'll eat my words. I promise. If it doesn't, then i'll hope she gets buffed.","replies":[{"poster":"The Deckowner","date":"2016-11-22T03:32:06.937+0000","up_votes":1,"down_votes":0,"body":"?....the heal was nerfed because she could spam it with blue buff and basically always stay full up,  Rito meeting it just shows how SOTA is not what allowed her to free sustain.\n\nSOTA doesn't heal until 30 camps/cannons, if you say that is what allowed her to stay full up throughout early game in the jungle,    you don't even know what SOTA does.\n\nIf you watch any professional league of legends, you should realize all Nidalee needs to do to get ahead is to farm , counter jungle and VERY occasionally gank.","replies":[{"poster":"Marshbouy","date":"2016-11-22T03:44:00.367+0000","up_votes":1,"down_votes":0,"body":">?....the heal was nerfed because she could spam it with blue buff and basically always stay full up, Rito meeting it just shows how SOTA is not what allowed her to free sustain.\n\nSo basically her heal is now tiny because it was too good, so, her heal is still tiny?\n>SOTA doesn't heal until 30 camps/cannons, if you say that is what allowed her to stay full up throughout early game in the jungle, you don't even know what SOTA does.\n\nIf you had 90/100 hp and you killed a camp you would get 100/110 hp(or something very close to those nombers). Sure it's not a big heal but definitely helped in early game. I do know what SOTA does. \nShe lost heal on her E, lose heal from SOTA, and lost tankiness from SOTA.\nShe got no direct nerfs in patch 6.22. Her winrate plummeted, i realize the statistics might be off but they are better than nothing. \n\n>If you watch any professional league of legends, you should realize all Nidalee needs to do to get ahead is to farm , counter jungle and VERY occasionally gank.\n\nDo i play in LCS? \nDo platinum players play in LCS? \nDo you play in LCS? \n\nThe answer is no. Nidalee is being balanced around the highest tier of play, just like other champions crowding out pick diversity. If no one complained about {{champion:268}} {{champion:163}} {{champion:136}} being hit hard with nerfs because of LCS, then i wouldn't complain about {{champion:76}}  being hit hard with nerfs because of LCS. \n\nIf you say \" sometimes league is being balanced around LCS and champions like nidalee, azir, taliyah, and shen deserve the nerfs they got\" then i'll say \"Awesome, we agreed on a middle ground, have a good day and a good night\"","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Baron of Bread","date":"2016-11-21T18:42:56.504+0000","up_votes":1,"down_votes":0,"body":"**SION FLASHBACKS**","replies":[]}]}]}]},{"poster":"ABlueQuaker","date":"2016-11-21T03:43:33.077+0000","up_votes":9,"down_votes":3,"body":"Let's just completely ignore that it's on a 30 seconds cooldown. It's like a 350 Damage shield on Riven in the first place. Ignore that she's giving up Armor Pen and FoB or Lethality and Thunderlord's Decree to use it.\n\nI swear to god, people get stomped once and just jump on the bandwagon.","replies":[{"poster":"Ultîma","date":"2016-11-21T14:07:55.804+0000","up_votes":3,"down_votes":0,"body":"Woah wait a minute.\n\nRivens who have been using CotC have been grossing _much_ [higher winrates](http://champion.gg/champion/Riven) than with other masteries. Even Riven's overall winrate has increased since the introduction of the mastery. \n\n64.44% is an absolutely broken figure - I don't think anything like that has been seen since the Skarner rework, holy shit.","replies":[{"poster":"Sightless66","date":"2016-11-21T18:42:26.567+0000","up_votes":4,"down_votes":0,"body":"We see shit like that for specific madtery combos pretty often. Hell, Olaf was rocking a 62% winrate with CoC earlier this patch. Puzzle that out.","replies":[{"poster":"Ralanr","date":"2016-11-21T18:43:33.684+0000","up_votes":2,"down_votes":0,"body":"I think Olaf is just bonkers. He's getting nothing from the mastery.","replies":[]}]},{"poster":"SwaggyMcGhee420","date":"2016-11-21T17:07:08.549+0000","up_votes":1,"down_votes":0,"body":"People who act like it's not better on her than the other masteries are just stupid. It's really good, but the winrate is a little unreliable because it's such a small sample size. The Skarner rework had thousands of games from varying experience levels, while this only has 160 games.","replies":[]}]},{"poster":"Blumpkin Nation","date":"2016-11-21T18:50:10.099+0000","up_votes":1,"down_votes":0,"body":"Well, to be fair-- Masteries should help more in the early-mid game than anywhere else. So she's not giving much up when she has two shields built into her playstyle now. Most phys champs now build 1-2 damage items and go tank. This allows Riven to go with more damage earlier and since she uses both her skills and basic attacks, losing some more damage/pen from masteries doesn't matter when you get two huge shields to mitigate damage. ","replies":[]}]},{"poster":"RexSaur","date":"2016-11-20T19:51:55.057+0000","up_votes":2,"down_votes":3,"body":"Naut AA, maokai presses W, poppy presses E and they get 2k hp shield in a team fight for using 1 point and click ability on a keystone thats already strong early game too (stronger than both tld and fervor).\n\nIts almost like the mastery is so broken that anybody that has access to atleast a single hard cc is good with it.","replies":[{"poster":"THE RlVER KlNG","date":"2016-11-20T20:52:41.183+0000","up_votes":5,"down_votes":0,"body":"Yep not disagreeing with you. It's at least sort've intended for champs like Maokai and Naut though, I hope when Riot rebalancses the mastery they do it with true Vangaurds in mind, and not Divers or Juggernauts.","replies":[{"poster":"Seenan","date":"2016-11-21T10:20:19.534+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=THE RlVER KlNG,realm=NA,application-id=3ErqAdtq,discussion-id=h76kOEsk,comment-id=00010000,timestamp=2016-11-20T20:52:41.183+0000)\n>\n> Yep not disagreeing with you. It&#x27;s at least sort&#x27;ve intended for champs like Maokai and Naut though, I hope when Riot rebalancses the mastery they do it with true Vangaurds in mind, and not Divers or Juggernauts.\n\nUh, nah. Unless Mao gets a knockback Q on more than one person, his shield will always be the lowest it can be with W. 7% + 100ish =/= 2k hp","replies":[{"poster":"NineTailedMystic","date":"2016-11-21T11:37:56.530+0000","up_votes":5,"down_votes":0,"body":"It's not enemies CC'd, it's enemies nearby when applying a CC. Maokai can W into a 5 man and get the full shield.","replies":[]},{"poster":"Ictus","date":"2016-11-25T07:20:10.097+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Seenan,realm=NA,application-id=3ErqAdtq,discussion-id=h76kOEsk,comment-id=000100000000,timestamp=2016-11-21T10:20:19.534+0000)\n>\n> Uh, nah. Unless Mao gets a knockback Q on more than one person, his shield will always be the lowest it can be with W. 7% + 100ish =/= 2k hp\n\nread it again.  you dont have to stun everyone, just have more champs around you.","replies":[]}]}]},{"poster":"The Space Cowboy","date":"2016-11-21T16:47:17.581+0000","up_votes":2,"down_votes":0,"body":"I have to say when I proc it late game with poppy it is only worth about 500hp (if I have 5k health), but when I stack it with my 1k buckler then I have a number closer to what you're mentioning. Another thing to consider is that the CoC shield dissipates faster than most of the cc that procs it. So it really just keeps the enemy from 5 man focusing you down in .5 seconds. Now you get 1 or 2 seconds to tank for your team.","replies":[{"poster":"Spoofghoul","date":"2016-11-21T17:14:36.928+0000","up_votes":1,"down_votes":0,"body":"o yes i once landed a 5 man ult with it when playing Sion then a fully charged q then the shield was gone\n\ndidn't even outlast the cc though with 4 seconds of cc on 5 people we won the fight anyway\n\nit's more a fail safe then anything really oh i didn't properly land my cc and hit just 1 guy ok ill take the 2k shield then \n\nIt's nice in lane to win trades or avoid dying to ganks  but it doesn't really last long enough to make you a supertank anyway people can just ignore you for a bit, i mean your main threat, the cc, is already on cooldown anyway. just wait out the shield then attack","replies":[{"poster":"The Space Cowboy","date":"2016-11-21T17:18:22.057+0000","up_votes":1,"down_votes":0,"body":"Accurate accept the part where you got a 2k shield from catching one person with cc. That would have to be mostly Sions own shield. Still at least you can verify that the shield duration is pretty short and thus not a very big issue. The only time it gets used 1v1 is to block minion agro damage or in a knock back were your enemy can still damage you.","replies":[{"poster":"Spoofghoul","date":"2016-11-21T18:45:57.036+0000","up_votes":1,"down_votes":0,"body":"not one person i mean if i ult into a team and hit 1 guy i still get a big shield \n\nand then its sort of usefull beyond that it's really not that strong though besides winning lane trades every now and then","replies":[]}]}]}]}]},{"poster":"Naomi CoffeeGoat","date":"2016-11-20T21:34:30.440+0000","up_votes":5,"down_votes":1,"body":"It actually allows her to engage fights more reliably and makes her sacrifice the damage output of a full damage build for better team fighting. It makes almost no difference to her lane phase if she had it or not. And she gives up the scaling on Fervor which her kit actually uses well. \n\nThat being said I'd be way more comfortable fighting her than something like poppy who builds pretty much full tank and still has high base damages to eat your ass for breakfast. She doesn't nearly rely as heavily on snowballing like Riven does and has a better kit to work with her team.","replies":[{"poster":"THE RlVER KlNG","date":"2016-11-20T21:55:01.907+0000","up_votes":4,"down_votes":3,"body":"You must not have ever faced it. She sacrifices little to no damage at all - and Fervor granted so much free power that it warped champion design, so champs _without _ it are what they should be like. Riven has generally been balanced (and balanced is a difficult word to use in the same sentence with Riven) around the fact that her E is pretty much always up, so she's being shielded for 100% of her bonus AD like all the time. Her getting more shielding off of that totally breaks how she should be played and makes her ridiculously frustrating to face. \n\nI played against a Riven last game who got fed off a _Garen_ her biggest counter mind you- with that mastery and we had to five man her to kill her, or else she was pretty much always shielded and lifestealed like crazy. It's no fun to play against and I hated every second of it.","replies":[{"poster":"Naomi CoffeeGoat","date":"2016-11-20T22:41:51.083+0000","up_votes":5,"down_votes":1,"body":"Well I have played it, but not against it. It was against a Fiora. This is only one game, just like yours was. I did beat her, but not cause of the mastery, but rather I just did outplay her in several scenarios. The most basic of that being waiting out her parry. Her getting more shielding off just helps her teamfighting when it was god awful if she isn't fed. The champ herself has always been trouble to shut down when she gets the ball rolling. \n\nAnd it's completely possible the Garen wasn't even good. Your match history shows the Riven was Diamond against a Silver player. I've tried Garen into Riven myself before thinking how easy it was a matchup to just beat her with better sustain, tankiness, and silences. It blew up in my face badly because I really am not a Garen player. \n\nAnd even then I can't really tell what she was building all game, but nothing about her build from your match history is bruiser Riven. She ended the game on a pretty standard damage build on Riven. You having to five man kill her was just her being fed most likely and Garen not doing as good as she did that game. She even had 8k gold on Garen at 22k compared to his 14k with almost double his CS. The next highest gold being Corki and Vi at 17k. \n\nThe new mastery definitely improved a lot of champs, but I think you blew things out of proportion against a fed Riven. And this was your only match against Riven with CotC.","replies":[]},{"poster":"Arkael","date":"2016-11-21T06:39:23.806+0000","up_votes":3,"down_votes":0,"body":"Actually Garen isn't her hardest match up lol. While the silence does cause Riven some issues he has ALOT longer cooldowns then her which makes taking trades against Garen quite easily once you learn to play around his silence. I'd say Rivens hardest matchups are against either Tanky Champs (Naut, Mao which are abusing the mastery more I might add) if they don't all in her early and get armor, aswell as either Jayce, or Kennen as they can both poke her down and disengage her all ins quite easily. I'm not saying the mastery isn't strong everyone with any sense of the game meta knows this mastery is extremely strong and nearly any champion who has CC in his kit (I even run it on Diana LUL) is abusing it and the mastery WILL get nerfed. Calling out one champion is pointless because they all are.","replies":[]},{"poster":"Best Ekko NA","date":"2016-11-22T03:04:15.105+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=THE RlVER KlNG,realm=NA,application-id=3ErqAdtq,discussion-id=h76kOEsk,comment-id=00030000,timestamp=2016-11-20T21:55:01.907+0000)\n>\n> You must not have ever faced it. She sacrifices little to no damage at all - and Fervor granted so much free power that it warped champion design, so champs _without _ it are what they should be like. Riven has generally been balanced (and balanced is a difficult word to use in the same sentence with Riven) around the fact that her E is pretty much always up, so she&#x27;s being shielded for 100% of her bonus AD like all the time. Her getting more shielding off of that totally breaks how she should be played and makes her ridiculously frustrating to face. \n> \n> I played against a Riven last game who got fed off a _Garen_ her biggest counter mind you- with that mastery and we had to five man her to kill her, or else she was pretty much always shielded and lifestealed like crazy. It&#x27;s no fun to play against and I hated every second of it.\n\nGaren is pretty far from Riven's worst Counter. Back in the days when Garen's Q actually silenced for 2.5 seconds and the movement from it lasted almost 5 seconds he was terrifying to face as Riven. Anymore however neither the movement speed or silence lasts long enough for an experienced Riven to be incapable of dealing with it.","replies":[]},{"poster":"PermabannedGaren","date":"2016-11-21T06:53:44.631+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=THE RlVER KlNG,realm=NA,application-id=3ErqAdtq,discussion-id=h76kOEsk,comment-id=00030000,timestamp=2016-11-20T21:55:01.907+0000)\n>\n> You must not have ever faced it. She sacrifices little to no damage at all - and Fervor granted so much free power that it warped champion design, so champs _without _ it are what they should be like. Riven has generally been balanced (and balanced is a difficult word to use in the same sentence with Riven) around the fact that her E is pretty much always up, so she&#x27;s being shielded for 100% of her bonus AD like all the time. Her getting more shielding off of that totally breaks how she should be played and makes her ridiculously frustrating to face. \n> \n> I played against a Riven last game who got fed off a _Garen_ her biggest counter mind you- with that mastery and we had to five man her to kill her, or else she was pretty much always shielded and lifestealed like crazy. It&#x27;s no fun to play against and I hated every second of it.\n\nGaren is garbage right now. An actually good champ against a garbage champ tends to mean the good champ wins.","replies":[]},{"poster":"SwaggyMcGhee420","date":"2016-11-21T03:35:17.078+0000","up_votes":1,"down_votes":0,"body":"You must not have ever played it. She actually does sacrifice a significant portion of her damage. I'm not disagreeing that the mastery is really good on her, just like Hecarim and Vi, but it's mostly useful in lane. If you're going full damage the shield isn't going to save you in the late game, and not having the AOE from Thunderlords in teamfights can prevent you from finishing someone off who you would've killed otherwise. \n\nGaren doesn't even counter her. She's a snowbally champion, who's actually pretty easy to beat in lane, unless she's much better than you (and if I'm looking at the right game, your Garen was silver 2 and Riven was diamond 5).","replies":[]}]}]},{"poster":"Liofa","date":"2016-11-20T20:00:48.229+0000","up_votes":2,"down_votes":0,"body":"cotc is disgusting on every single bruiser with \"hard\" cc","replies":[]},{"poster":"Penns","date":"2016-11-20T19:50:23.989+0000","up_votes":2,"down_votes":0,"body":"Its disgusting on anyone, I just second timed Mao since season 5, got countered in lane, basically got a penta (if my team didnt steal one of them {{item:3070}} ) and went like 12/4/10 lol.","replies":[{"poster":"Big Lincoln","date":"2016-11-20T19:53:04.374+0000","up_votes":2,"down_votes":1,"body":"that's just maokai for you\n\nawful champ design, just knowing he's back in meta tilts me","replies":[]}]},{"poster":"Randomonium","date":"2016-11-20T22:21:49.105+0000","up_votes":3,"down_votes":1,"body":"I made a video analyzing the win rates of every champion if they use CoC versus the next most popular mastery. There's a reason why I put Riven in the thumbnail, she's got a pretty insane win rate with it.\n\nhttps://youtu.be/Qqo7aHaCLwQ","replies":[{"poster":"RisenDarkKnight","date":"2016-11-20T23:11:36.439+0000","up_votes":1,"down_votes":0,"body":"Nice vid!","replies":[]}]},{"poster":"dominusx","date":"2016-11-21T12:08:32.983+0000","up_votes":2,"down_votes":1,"body":"when i said cotc was gonna get abused and gutted everyone downvoted me.. suck my d now and have fun dealing with ad bruisers cucking you.","replies":[]},{"poster":"ThePartyLeader","date":"2016-11-21T00:08:54.725+0000","up_votes":2,"down_votes":1,"body":"Welcome to preseason.... enjoy your stay","replies":[]},{"poster":"The Final Fury","date":"2016-11-30T15:33:34.922+0000","up_votes":1,"down_votes":0,"body":"I love how no one is saying that the problem is RIVEN, not Colossus.\nIf they nerf Colossus, no matter what, Riven will STILL be cancer with that mastery.\n\nEven if they nerf that \"more shield if you hit more enemies\" she will STILL be cancer in lane, almost impossible to kill and retarded as always.","replies":[]},{"poster":"PROJECT MaXym","date":"2016-11-21T17:42:43.292+0000","up_votes":1,"down_votes":0,"body":"riven is disgusting","replies":[]},{"poster":"The Space Cowboy","date":"2016-11-21T16:44:17.013+0000","up_votes":1,"down_votes":0,"body":"This is a real bummer. I could see her being perfect to abuse this keystone. I really like Courage of the Colossus because it let's me leave the tower as a melee top laner when i face a ranged champ. Let's add 'doesn't work on riven' to the tool tips and call it a day.","replies":[]},{"poster":"Mighty Mortein","date":"2016-11-21T05:39:30.352+0000","up_votes":1,"down_votes":0,"body":"The base shield needs to be either nerfed or removed entirely tbh. It's too rewarding. I mean sure, it makes divers/tanks a bit beefier, but yeah, this in the hands of a good Ekko or Riven player makes me shudder.","replies":[{"poster":"Ultîma","date":"2016-11-21T13:59:45.979+0000","up_votes":1,"down_votes":0,"body":"Agreed. It should scale off bonus health so only tanks who invest in health can really benefit from it. It has way too much innate power for carry-oriented champions to abuse if they have readily-available CC in their kit.","replies":[]}]},{"poster":"Toxic Main Riven","date":"2016-11-21T03:37:24.620+0000","up_votes":1,"down_votes":0,"body":"That's cute have you seen Poppy {{champion:78}} ?","replies":[{"poster":"RikoZerame","date":"2016-11-21T16:51:20.662+0000","up_votes":0,"down_votes":0,"body":"I saw her about 5 minutes back. That was when she ulted me; I'm still trying to get back to lane.","replies":[]}]},{"poster":"Bronze II Yasuo ","date":"2016-11-20T23:07:24.707+0000","up_votes":1,"down_votes":0,"body":"They are planning on nerfing it nerf patch so let's all hold hands in grail.","replies":[]}]}