{"poster":"InsaneCamille","date":"2018-11-12T19:41:49.536+0000","title":"Frezeeo de pantalla y consecuencias sin solucion","subforum":"Problemas Técnicos","up_votes":6,"down_votes":0,"body":"Es total mente injusto que riot game ni su soporte tecnico se responsabilise por el frezeoo y de las sanciones automaticas que esto conlleva , necesito hablar con alguien y que se haga cargo de la situacion","replies":[{"poster":"AC Wolf","date":"2018-11-12T19:49:08.172+0000","up_votes":1,"down_votes":0,"body":"Buenas!\n\nPrimeramente en los anclados del foro está la solución del problema ^^, es un problema mundial (afecta a todas las regiones) y lo más probable es que para el próximo parche este solucionado, también puedes enviar un ticket al soporte ,pero debes tener en cuenta que es fin de temporada y puede que tarden unos días en contestar D;.\n\nSaludos! ^°","replies":[{"poster":"Cya Hyun","date":"2018-11-12T19:54:03.895+0000","up_votes":1,"down_votes":0,"body":"si es problema global pero no te sacan la sancion ni te devuelven los puntos que perdiste osea de que sirve ? ya tengo dos colas de baja prioridad por ese error .... hice todo lo que me dijieron y no se soluciono","replies":[{"poster":"AC Wolf","date":"2018-11-12T20:13:56.488+0000","up_votes":1,"down_votes":0,"body":"a mi me paso en la primera de la promo a diamante t.t llegue como al minuto 8 , lastimosamente la perdimos D: .\nluego de eso seguí los pasos y me dejo de salir el error, en caso de que no te funcione lo ideal seria contactar al soporte y especificar tu información de pc D:.","replies":[{"poster":"Cya Hyun","date":"2018-11-12T20:37:04.518+0000","up_votes":1,"down_votes":0,"body":"lo he echo y tanto en solo q como en flex perdi pl y promos y me dijieron no podemos hacer nada pero tengo ssncion por eso mismo ...","replies":[]}]}]}]},{"poster":"wanted","date":"2018-11-12T20:07:42.486+0000","up_votes":1,"down_votes":0,"body":"probaste esto? no me paso eso todavia.\n\nhttps://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/nvchA8iH-soporte-sobre-los-freezeos-de-pantalla-congelamiento-de-pantalla","replies":[]}]}