{"poster":"Linnik","date":"2016-07-13T22:17:33.228+0000","title":"Remake Problem","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Habe eine Frage bzgl der Remake-Funktion.\r\nHatte eben ein Game, bei dem unser Hecarim bis Minute 2:30 keine Verbindung hatte.\r\nDann kam kurz die Meldung, dass er connected ist, war aber instant wieder drau&szlig;en und kam nichtmehr wieder.\r\nIn Minute 4:50 ist dann Firstblood f&uuml;r die Gegner gefallen.\r\nEs gab keinen Zeitpunkt, an dem wir die Remake-Funktion nutzen konnten.\r\nIch war der Meinung, dass es an dem Firstblood lag.\r\nGrade hatte ich jedoch ein Spiel, in welchem wir Firstblood in Minute 2:10 geholt haben, die Gegner konnten jedoch trozdem /remake nutzen.\r\n\r\nIst es also tats&auml;chlich so, dass die Remake-Funktion nichtmehr verf&uuml;gbar ist, sobald der Afkler wieder connected, auch wenns nur extrem kurz ist und keine Aktion ausgef&uuml;hrt wird? \r\nSchon arg l&auml;cherlich.","replies":[{"poster":"Schlampe des ADC","date":"2016-07-13T22:40:32.525+0000","up_votes":1,"down_votes":0,"body":"> - Wenn ein Spieler nach drei Minuten mindestens 90 Sekunden lang keine Verbindung hatte oder als AFK gemeldet wurde und es noch nicht zum ersten Blut gekommen ist, werden alle Spieler des unterzähligen Teams per Chatnachricht dazu aufgefordert, mit /remake die Partie zu beenden.\n> - Alle Spieler dieses Teams haben eine Minute Zeit, abzustimmen, indem sie /remake in den Chat schreiben.\n> - Es müssen mindestens zwei der vier Spieler (30 % der Spieler im Spiel) dafür stimmen, damit das Spiel beendet wird.\n> - Der (oder die) Spieler ohne Verbindung verliert die volle Anzahl an LP oder sein Aufstiegsspiel, und wird von Leaver Buster erfasst.\n> - Anmerkung für Ranglistenspiele: Um die Integrität des Wettkampfs zu gewährleisten, erleiden „Diamant V“-Spieler oder höher auch dann eine Niederlage, wenn der Spieler ohne Verbindung in ihrer arrangierten Gruppe ist. Wir behalten diese Einschränkung im Auge, um sie vielleicht auch in niedrigeren Rängen einzuführen.\n\nGelesen bei : [/remake](http://euw.leagueoflegends.com/de/news/game-updates/player-behavior/neuigkeiten-mit/remake-nur-wichtige-partien-spielen)","replies":[{"poster":"Linnik","date":"2016-07-13T23:04:28.756+0000","up_votes":1,"down_votes":0,"body":"''...und es noch nicht zum ersten Blut gekommen ist''\nDas stimmt ja schonmal nicht. Firstblood scheint keine Auswirkungen auf remake mehr zu haben","replies":[{"poster":"Good Guy Putin","date":"2016-07-15T14:13:49.380+0000","up_votes":1,"down_votes":0,"body":"Die Übersetzung ist da etwas blöd. Tatsächlich es so, dass die Gegner sogar mehrere Kills haben können, solange, der DC vor den Kills kam.\n\n Da kannst du es auf englisch noch mal nachlesen [/remake](http://na.leagueoflegends.com/en/news/game-updates/player-behavior/play-games-matter/remake)","replies":[]},{"poster":"Schlampe des ADC","date":"2016-07-13T23:05:52.958+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Linnik,realm=EUW,application-id=Wj1wcocU,discussion-id=0VEdxuyB,comment-id=00010000,timestamp=2016-07-13T23:04:28.756+0000)\n>\n> &#x27;&#x27;...und es noch nicht zum ersten Blut gekommen ist&#x27;&#x27;\n> Das stimmt ja schonmal nicht. Firstblood scheint keine Auswirkungen auf remake mehr zu haben\n\nIch habe es nur bei League gelesen ^^ Beschwer dich bei denen :D","replies":[{"poster":"Linnik","date":"2016-07-14T00:07:46.676+0000","up_votes":1,"down_votes":0,"body":"Sollte kein beschweren an dich sein, finde es ja super, dass du geantwortet hast.\nDas Remake-System ist nur irgendwie ein wenig undurchsichtig","replies":[{"poster":"Schlampe des ADC","date":"2016-07-14T00:36:36.837+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Linnik,realm=EUW,application-id=Wj1wcocU,discussion-id=0VEdxuyB,comment-id=0001000000000000,timestamp=2016-07-14T00:07:46.676+0000)\n>\n> Sollte kein beschweren an dich sein, finde es ja super, dass du geantwortet hast.\n> Das Remake-System ist nur irgendwie ein wenig undurchsichtig\n\nMade by Rito","replies":[]}]}]},{"poster":"Im a Papaya","date":"2016-07-13T23:14:59.158+0000","up_votes":1,"down_votes":0,"body":"Wenn du spielst, dein Team first blood abgibst und sagst \"gg...\" und dann das Spiel verlässt gibt es kein remake. Wenn du von Anfang an nicht da bist und dein Team first Blood abgibt hat der Afk nichts mit dem First Blood zu tun und dementsprechend gibts dann remake.\nSo habe ich das verstanden.","replies":[]}]}]},{"poster":"SF Pride","date":"2016-07-15T08:31:12.926+0000","up_votes":1,"down_votes":0,"body":"Wenn dein Team einen AFKler hat, und das gegnerische Team das First Blood holt, ist es immernoch mögliche ein remake zu machen. Holt jedoch DEIN Team MIT dem AFKler einen Kill, dann wars das mit dem Remake.","replies":[]},{"poster":"Megamaexx","date":"2016-07-14T06:48:25.448+0000","up_votes":1,"down_votes":0,"body":"Es kam wohl zu einem bug oder Hecarim war nicht ganz so AFK wie beschrieben. Das first blood hat keinerlei Auswirkungen, wenn der AFKler bereits AFK ist.\nDazu kommt, dass es nach deinen Angaben bereits nach der /remake-Zeit gefallen ist.\nSpiele mit Remake enden kurz nach Minute 3.","replies":[]},{"poster":"OT Riku","date":"2016-07-13T22:31:39.579+0000","up_votes":1,"down_votes":0,"body":"Er muss in den ersten 3 Minuten mindestens am 90 Sekunden am stück Afk sein. \nDies war bei euch warscheinlich nicht der Fall da er ja wieder Connected ist.","replies":[]}]}