{"poster":"Yrox the Third","date":"2016-02-12T18:14:44.242+0000","title":"Hablemos sobre, el que quizas seria, el PEOR server de LoL [No es QQ]","subforum":"Charlas Generales","up_votes":2,"down_votes":5,"body":"Les digo, que esto NO ES QQ, pero si quieren ver como es el peor server de LoL lean hasta el final, vale la pena para que tengan una vision mas clara de como son las cosas los servers.\r\n\r\nSin embargo, dire el nombre del server al final, por ahora veamos sus detalles:\r\n\r\n- Si cargas RP por mensajes de textos hay posibilidades de que te den codigos usados.\r\n\r\n- El soporte no existe, solo te contestaran &quot;si&quot; o &quot;no&quot; o respuestas un poco basado en eso, pero nada en concreto.\r\n\r\n- Bans sin sentido, por ejemplo, alguien sube una foto de alguien siendo excesivamente toxico pero edita la imagen para sacarle los nombres (lo que se deberia hacer), sin embargo, banean al que sube la foto, ya que puede estar inculpando a alguien mas.\r\n\r\n- Salen anuncios (como los que salen en la gran mayoria de las paginas de internet o en videos de YouTube) dentro del cliente.\r\n\r\n- Simplemente, no hay baneos, a comparacion de todos los otros servers adonde hay baneos (quizas no en una cantidad grande, pero hay) aqui simplemente no banean a nadie, pueden ser estupidamente toxicos o romper todas las reglas y ser reportados 9 veces en cada partida por 100 partidas y no ser baneados.\r\n\r\n- Se acuerdan cuando Riot regalo cajas misteriosas a los que tenian buen comportamiento? bueno en este server no lo hicieron.\r\n\r\n- Las tiendas del a&ntilde;o nuevo chino y de navidad junto a la &quot;Bola de nieve legendaria&quot; no estuvieron en el server, de hecho, nisiquiera las anunciaron (sin embargo existio la &quot;Tienda de Halloween&quot; que fue basicamente lo mismo, pero lo bola de nieve legendaria, nunca salio)\r\n\r\n- Hay problemas tecnicos frecuentes, lags y desconecciones cada dia sin parar (no se si cada dia, pero es bastante frecuente, y sin aviso previo o aviso de que lo estan reparando).\r\n\r\n- Su cliente no fue actualizado, aun siguen usando el Historial antiguo.\r\n\r\n- Los iconos de Navidad que costaban 1500 IP costaban RP en este server, solo se podia conseguir un icono sin pagar y era por jugar el modo del Rey Poro.\r\n\r\n- No hay reembolsos, nisiquiera los 3 que tienen/tuvieron todos.\r\n\r\n- El nuevo draft pick no les sirvio de nada, ya que la gente aun asi va cualquier role que quiere y no seran castigados, porque como dije antes, todos los reports son nulos.\r\n\r\n- Para que decir, si los reports son totalmente nulos la gente puede trollear, flamear e irse afk sin consecuencia alguna de ningun tipo.\r\n\r\nY la lista continua.\r\n\r\nAhora, muchos se preguntaran, &iquest;cual es este server?, facil.\r\n\r\nGarena.\r\n\r\nPara los que no saben que es, les digo, Garena es una compa&ntilde;ia aparte de Riot (esta afiliada pero no es de por si, de Riot) que es due&ntilde;a de 5 servers, estos son relativamente peque&ntilde;os ya que son de paises en especifico (como por ejemplo, Filipinas e Indonesia), asi que ellos tienen todo el control sobre el server su escena competitiva (o eSport).\r\n\r\nAhora, estos problemas se encuentran en 3 de los 5 servers, los otros 2 son servers &quot;normales&quot;.\r\n\r\n\r\nA que va esto, bueno, si se quieren quejar de que Riot LAS es lo peor que hay, lean esto, se daran cuenta que LAS es un paraiso a comparacion.","replies":[{"poster":"JACKY FANBOY","date":"2016-02-12T18:31:58.787+0000","up_votes":2,"down_votes":0,"body":"Te apoyo solo en los 2 primeros puntos\nluego dijiste cualquier cosa","replies":[{"poster":"Yrox the Third","date":"2016-02-12T18:43:27.937+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=elxathu,realm=LAS,application-id=v7qsfXsE,discussion-id=2a7gr0sm,comment-id=0001,timestamp=2016-02-12T18:31:58.787+0000)\n>\n> Te apoyo solo en los 2 primeros puntos\n> luego dijiste cualquier cosa\n\nQuizas me desvie o los tuve que haber ordenado por importancia, aunque lo lei otra vez y si, quizas los otros no son TAAAN importantes.","replies":[]}]},{"poster":"EzrealSupportOP","date":"2016-02-12T18:52:03.214+0000","up_votes":1,"down_votes":0,"body":"Que facil es hablar desde la ignorancia.","replies":[]},{"poster":"LeonardoSB","date":"2016-02-12T18:40:48.801+0000","up_votes":1,"down_votes":0,"body":"si da menos ping me importa un huevo lo demas :v","replies":[]},{"poster":"Essos","date":"2016-02-12T18:24:44.657+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-brand-clap}}  È un mondo difficile","replies":[]}]}