{"poster":"Anin777","date":"2018-06-24T00:50:43.668+0000","title":"Do we actually need more champs?","subforum":"Gameplay","up_votes":29,"down_votes":17,"body":"Really think about it. What more do we need? We have iteration after iteration of champ designs that already have some sort of similarity. We have kits that are mirroring each other. We have variety. But MOST importantly, every time a new champ is released the game&#039;s already awful gameplay balance gets worse because there are 5 other abilities to factor in and not to mention the possible items the champion might use. Just seems like an insult at this point to add more champs. The league universe is being fleshed out really nicely lorewise. Each new champ now has to fit into it and I see this becoming a problem in the future as lore will become subpar. I feel Riot should just take a whole year or 2. No new champs. Reworks are allowed and limited to 2 a year. Focus on balancing the game. ACTUALLY listen to the high elo players instead of depending on Rioters who aren&#039;t as experienced. Maybe if they did, this game would actually improve. This eSports craze will eventually die out and if players don&#039;t have a balanced game to return to, then you know what happens next.","replies":[{"poster":"Krully","date":"2018-06-24T01:03:21.968+0000","up_votes":25,"down_votes":1,"body":"yeh because 147 is uneven number and i dont like it","replies":[{"poster":"Anin777","date":"2018-06-24T01:16:05.765+0000","up_votes":11,"down_votes":0,"body":"Honestly I concur. Stop at 150. 147 doesn't sound satisfying.","replies":[{"poster":"Hexs Fortune","date":"2018-06-24T03:11:01.708+0000","up_votes":10,"down_votes":0,"body":"> [{quoted}](name=Anin777,realm=EUW,application-id=3ErqAdtq,discussion-id=sOfkMT7L,comment-id=00000000,timestamp=2018-06-24T01:16:05.765+0000)\n>\n> Honestly I concur. Stop at 150. 147 doesn&#x27;t sound satisfying.\n\n151 pokemon. Can't leave out the mew","replies":[]}]}]},{"poster":"Azadethe","date":"2018-06-24T01:32:51.972+0000","up_votes":18,"down_votes":3,"body":"New champs are part of what retains players. new patterns. new niches, new complexity.\n\nSo yes.\n\nOh. and they make new money.","replies":[{"poster":"Anin777","date":"2018-06-24T02:32:44.363+0000","up_votes":3,"down_votes":0,"body":"New money is probably the most honest reason. But you can't prove it helps retain players. Infact you could argue the opposite. Everytime a champ is released, there's a board/reddit post detailing problems. For example, when Zoe got released, so many people said they'd stop playing until the champ was hotfixed. And what niche is left to fill? Pretty much every single one has been filled by now. We don't need complexity. We need balance. People want to play a game that feels fun and rewarding. Season 5 for example was fun to play not because of new champs but because the game was fun to play. You felt good winning OR losing for the most part because you actually stood a chance. New champ hype dies after a week or 2 but good gameplay is talked about for seasons.","replies":[{"poster":"Azadethe","date":"2018-06-24T02:58:39.509+0000","up_votes":3,"down_votes":2,"body":"It's not about Hype.\n\nIt's about...\nThe desire of everyone to find their one trick. People get bored with stale old champions and their brain begins to supply less dopamine for every bit of enjoyment they receive from playing vs and picking their favorite champs. They begin to get disillusioned with the champs that define them the best, and search for new tricks.\n\nIf the champions hits its mark, it behaves like a drug. It's not just about hype. It's about addiction.","replies":[]}]},{"poster":"CaptainMårvelous","date":"2018-06-24T18:27:13.960+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Azadethe,realm=NA,application-id=3ErqAdtq,discussion-id=sOfkMT7L,comment-id=0002,timestamp=2018-06-24T01:32:51.972+0000)\n>\n> New champs are part of what retains players. new patterns. new niches, new complexity.\n> \n> So yes.\n> \n> Oh. and they make new money.\n\nThis.\n\nIf you want to blame anyone, blame Season 2. In a rush to keep their momentum and in fear of losing their playerbase, Riot pushed out a new champ every two weeks. Hence why you see so many reworks happening: Because RIot pushed out bad designs that added very little to the game and didn't think of the long term repercussions. \n\nAlso new releases are incredibly slow compared to the early days. It'd take us over 10 years to hit 200 so it's fine for Riot to make new ones, so long as they add different play patterns to the game.\n\n>This eSports craze will eventually die out and if players don't have a balanced game to return to, then you know what happens next.\n\nDoTA, CSGO and more have existed for almost two decades. I don't think esports is dying out any time soon. ","replies":[]}]},{"poster":"Ekkologix","date":"2018-06-24T01:04:33.466+0000","up_votes":8,"down_votes":0,"body":"We definitely need way more poppy/ww level reworks than new champions. These reworks were golden.\n\nI agree with having rito do 2 years w.o new champs and focus mainly on balance + reworks. They themselves specified that they will be focusing way more on reworks the upcoming seasons but still riot thinks new champs need to come every now and then to refresh the game and add to the lore which is not wrong but at this point reworks should be 100% priority at least for a whole season.","replies":[{"poster":"Anin777","date":"2018-06-24T01:20:50.122+0000","up_votes":2,"down_votes":0,"body":"Poppy is actually the best rework imo along with Sion. They felt so good after their reworks it was unreal (unlike Galio). WW however, I'm torn. On one hand, they preserved and brought out the whole essence of his character however his kit can be really ridiculous sometimes. Yeah they said so but they have already released 2. I expect 2 more before 2019. I just wish they didn't feel the need to \"refresh\" the game so often because it doesn't really work.","replies":[]}]},{"poster":"Off Meta Evan","date":"2018-06-24T02:47:40.118+0000","up_votes":7,"down_votes":0,"body":"I understand the desire for a balanced game more than anyone, however, a game with 100+ characters is NEVER going to be balanced. IMO once you hit the threshold of  45+ you abandon any hope of a truly balanced game. 100+ = legitimately 0 actual way to make every single champ equally as good as one another. The primary reason why I like new champs is because I play based on the champs archetype. I don't care about how strong {{champion:516}}  actually is, i just like the idea of playing as a blacksmith goat god, By making cooler archetypes into other roles, it'll attract people who like those archetypes into them. I'm typically not a big fan of the assassin class but {{champion:91}}  is just too cool for me not to like him.","replies":[{"poster":"Academy Kayn","date":"2018-06-24T08:28:07.260+0000","up_votes":2,"down_votes":0,"body":"Hell, look at Overwatch. What they got, like 20 heroes, and somehow they still take months for a single patch?","replies":[]},{"poster":"Anin777","date":"2018-06-24T03:09:06.404+0000","up_votes":2,"down_votes":0,"body":"Obviously it can never be 100% balanced but it will be damn well better than this current state. Season 5 was really fun to play before the whole tank meta fiasco. You know the problem about having too many options? Sooner or later, you'll run out of options to add. Then what? You like the idea of playing ornn but how many games will you play based on that? If meta makes over 70% of the roster unplayable, what is the point of new champs?","replies":[{"poster":"Off Meta Evan","date":"2018-06-26T01:11:24.200+0000","up_votes":1,"down_votes":0,"body":"I'll play as many games as i want as long as the champ is cool.  I don't usually care about what the meta says about a specific champ. (there are exceptions, like {{champion:62}}  is so terrible right now i have completely given up on playing him.) I just want more cool archetypes so i can get into different roles. By all accounts i should probably like {{champion:240}}  but i hate his character so much i refuse to play him under any circumstances.  I think riot should focus on reworks for right now, as {{champion:62}} {{champion:54}} {{champion:36}} {{champion:84}} all have extremely outdated kits (yes i know akali is being reworked i'm just sayin) but I don't think simply not releasing new champs is a good idea.","replies":[]}]}]},{"poster":"KnightsKemplar","date":"2018-06-24T03:17:24.349+0000","up_votes":6,"down_votes":2,"body":"I say we stop at 150, personally. It was a good number for Pokemon, it can be good number for League. We're pretty close, no?","replies":[{"poster":"Warlord Scrap","date":"2018-06-24T03:46:23.306+0000","up_votes":5,"down_votes":0,"body":"So 151.  How dare you forget mew","replies":[]}]},{"poster":"Battalion","date":"2018-06-24T05:22:05.470+0000","up_votes":4,"down_votes":0,"body":"I'd go for 3 more maybe 4 more, make them really ridiculously innovative, and if they turn out to be trash, rework them later, but start from the ground up.","replies":[]},{"poster":"CaptainAntiHeroz","date":"2018-06-24T02:39:28.203+0000","up_votes":1,"down_votes":0,"body":"Yes\n#ForStoryProgressionAndEntertainment","replies":[{"poster":"Anin777","date":"2018-06-24T03:09:29.969+0000","up_votes":1,"down_votes":0,"body":"Story Progression? Story was pretty much complete with the release of Azir. The rework of Eve also helped but it wasn't a champ release so not counted. ","replies":[{"poster":"CaptainAntiHeroz","date":"2018-06-24T04:00:53.834+0000","up_votes":4,"down_votes":0,"body":"Still missing some darkin, any character that actually makes ryxe not the only person interested in world runes, explanation of what the aspects are, resolution of the void ordeal, Camille hasn't actually done that much, zilean doesn't do anything really, syndra has a temple....... And stuff, lissandra it's trying to revive the iceborn, yasuo's story now has no clearly defined villain, Olaf hasn't completed his life's goal, tryndamere married Ashe.... For their people (spoiler his people are dead), sivir has done nothing, vayne doesn't have a clear endgame, Lucian hasn't saved Senna, udyr the 4 animals guy, yi taught wukong.... Slow and steady is good but if it's effective go fast, morde and xerath are bad guys,  riven works on fields forever now, Darius has no character development revolving around his lovers death, Xayah and rakan want to do.... What exactly?,  Taliyah story is going forward, mf is becoming a cold blooded killer too, Diana and Leona still haven't had a talk, why do the yordles even need soldiers if we've never heard of them actually fighting any wars (not kled bandle City yordles), talon hasn't figured anything out yet, balance in all things have been explained, Zed doesn't seem to have motivation beyond a disagreement, corki makes no sense.......\nEtc etc etc","replies":[]}]}]},{"poster":"Light of Madness","date":"2018-06-25T02:22:40.996+0000","up_votes":2,"down_votes":1,"body":"Just give me back the old GP and Taric.... do an event with all old version of the champions that you  destroyed and you will see rankeds empty.","replies":[{"poster":"SSmotzer","date":"2018-06-25T03:41:39.912+0000","up_votes":2,"down_votes":0,"body":"Gangplank is essentially the same, dot on his passive, a powerful poke, oranges, and a global aoe ult. Old Gangplank had an aoe attack speed buff, and new gangplank has high power powder kegs. Would you rather he have a support ability to give allies attack speed, or the ability to deal some big damage and clear entire waves with his kegs?\n\nTaric was pretty 1 note, and with his unavoidable stun and high damage on his shatter and ult means he could solo most champions. He was really frustrating to play against, and playing him feels like playing current Aatrox, either you have enough damage when you get in, and you always win, or you don't, and you always lose. Most old champions, who people miss, were feast or famine, which is bad.\n\nIf there was a game mode where they had unreworked champions vs their reworks, in most cases the reworked champions would win, like with Gangplank, and other times the unreworked champions would always win, because there is little you can do to counter the likes of Taric or Sion.","replies":[]}]},{"poster":"Netorare","date":"2018-06-24T14:25:04.267+0000","up_votes":2,"down_votes":0,"body":"TBH i'd rather have more champs than trash reworks even if the new champs will obviously have recycled skills and \"passives\"","replies":[]},{"poster":"ISLAMICWARRIOR99","date":"2018-06-24T03:58:03.215+0000","up_votes":2,"down_votes":2,"body":"No, we need riot to dedicate an entire season to fixing how shit the game is. No new champs, no new items, no gay events and skins, just nerf the shit that's been ruining the game for 3 seasons (tanks especially) and buff the shit that's useless. Or just revert to s5 before the cancer tank meta bc that's the most fun I think I ever had in the game.","replies":[{"poster":"Anin777","date":"2018-06-24T13:54:25.222+0000","up_votes":2,"down_votes":0,"body":"Yeah season 5 was the golden age (tanks were still strong tho. Remember that was Cinderhulk meta). But it was still the most balanced the game was. So yeah, revert to s5 and work from there.","replies":[]}]},{"poster":"Teridax68","date":"2018-06-24T04:12:41.546+0000","up_votes":2,"down_votes":0,"body":"I think as long as there are interesting new playstyles and archetypes to explore, there are more champions to have in League. However, I agree that the game is in dire need of some comprehensive balance work, far more than new champions at this point. Balancing a game with 100+ different kits is difficult enough, but it's even more so now that there are virtually no clear standards for how a match is expected to run, and what levels of damage, crowd control, etc. are considered acceptable. Riot needs to reevaluate League's framework first and dive deep into what needs to be fixed, and I think that in itself could be worth delaying a few releases.\n\nI think part of the problem now is that, while there are undoubtedly a ton more gameplay fantasies to have in League, a lot of very recent releases and reworks have been poorer in quality than what we've expected, and often fairly samey. Ornn had an interesting theme as a blacksmith, but in practice he's yet another CC-loaded tank, for example. Meanwhile, Pyke's character and backstory have the same key elements as Nautilus, a flaw Riot themselves admitted to. Also by Riot's own admission, Aatrox is now being turned into a juggernaut version of Riven. It's this relative dearth of creativity that makes me wish Riot took a step back for a moment to ask themselves what they're doing, and whether they're truly making the best use of each existing champion in their game. Too many champions blend into each other, and it feels like design is often constrained by this need to add the same mechanics in the same way, e.g. with dashes, displacement, percent health/true damage, etc. I'd rather change the game in such a way that it allowed for a greater diversity of playstyles, rather than continue with the production line of champions that have increasingly felt like they've had to follow a predefined mold.","replies":[{"poster":"Anin777","date":"2018-06-24T13:43:47.048+0000","up_votes":2,"down_votes":0,"body":"Awesome write-up man! I don't want champion releases to stop indefinitely YET. I just want Riot to take some time to actually work on balancing the game. New champs feel old because it's like \"I've seen that ability before\". Even lore isn't as good as the Shurima lore update. People say new champs keep the game fresh but I don't feel that way. Remember when Riot introduced jungle camp buffs? Wow. That was a season. Think I played 3k games that season. Felt so fun. We need more changes like that.","replies":[]}]},{"poster":"Z3Sleeper","date":"2018-06-24T10:21:15.466+0000","up_votes":2,"down_votes":0,"body":"> This eSports craze will eventually die out and if players don't have a balanced game to return to, then you know what happens next.\n\nHasn't happened yet. Also champ releases have already slowed down dramatically, but haven't halted. It's nowhere near the levels they reached back in the early days, pumping new champs out every 2 weeks.","replies":[]},{"poster":"Akali Prime","date":"2018-06-24T03:02:14.155+0000","up_votes":1,"down_votes":0,"body":"but...pokemon does it. its how they keep their game fresh and new so why not league.","replies":[{"poster":"Warlord Scrap","date":"2018-06-24T03:47:56.989+0000","up_votes":2,"down_votes":0,"body":"Pokemon has horrible powercreep.  Gen 1-4 is almost useless.  Sure some of the alolan gen 1s are fun.  But really pokemons are horrible example.  Fairy types is the first somewhat decent addition in a while","replies":[{"poster":"Spank the Fox","date":"2018-06-24T07:47:48.330+0000","up_votes":1,"down_votes":0,"body":"Uh...?\n\nNot even close bby?","replies":[{"poster":"Warlord Scrap","date":"2018-06-24T14:08:49.563+0000","up_votes":1,"down_votes":0,"body":"The only viable gen 1s are mega evolution which isnt true gen 1.  Most pokemon arent post gen 1 whether.  Now when your adding close to 100 pokemon a gen your bound to make trash pokemon.  The problem is there running out of ideas","replies":[{"poster":"Spank the Fox","date":"2018-06-24T16:26:49.064+0000","up_votes":1,"down_votes":0,"body":"I can already prove your first statement wrong. Clefable.\n\nAnd even further, Tentacruel seeing more use to counter the ever-present Clefable.\n\nCloyster is another pokemon that pops up fairly often and is incredibly surprising.\n\nChansey became a stronger wall than Blissey with Eviolite.\n\nAlso, a lot of pokemon usage varies on what formats you chose to play on. Casual play you can see almost all but the trashiest of trash to show up and wreck your day, and Gen 1 is far from having the worst mons, considering shit like Unown and Luvdisc exist.","replies":[{"poster":"Warlord Scrap","date":"2018-06-24T16:41:41.518+0000","up_votes":1,"down_votes":1,"body":"Statistics show your wrong though.  The only top non mega gen 1 is snorlax.  Mega pokemon are not gen 1.  \nAnd as for casual play that arguement is bad for purposes of the op.  Every champ is viable in league casual play as well.","replies":[{"poster":"Spank the Fox","date":"2018-06-25T02:18:51.719+0000","up_votes":1,"down_votes":0,"body":"1) you literally said “the only viable gen 1 pokemon are only megas” which you even just proved your absolute statment wrong.\n\n2) statistics based on what? Clefable is Overused by usage ATM too, so I fail to see how you proved me wrong. Even if Chansey has fallen in usage in Gen 7, it was still incredibly popular and viable in Gen 6.","replies":[]}]}]}]}]}]}]},{"poster":"ZackTheWaffleMan","date":"2018-06-24T02:15:01.929+0000","up_votes":2,"down_votes":0,"body":"Darkin 5","replies":[{"poster":"Anin777","date":"2018-06-24T02:36:12.902+0000","up_votes":2,"down_votes":0,"body":"Will they make a group like Jackson 5? :3","replies":[]},{"poster":"5000000000000000","date":"2018-06-24T06:10:33.816+0000","up_votes":1,"down_votes":0,"body":"Is 5 Darkin thing still canon?","replies":[{"poster":"Z3Sleeper","date":"2018-06-24T13:43:21.865+0000","up_votes":1,"down_votes":0,"body":"I mean, as far as we know it's not *not* canon. So idk.","replies":[{"poster":"5000000000000000","date":"2018-06-26T02:36:50.956+0000","up_votes":1,"down_votes":0,"body":"what a coincidence that it just gets confirmed that it's not :D","replies":[]}]}]}]},{"poster":"Acheron16","date":"2018-06-24T19:29:19.895+0000","up_votes":2,"down_votes":1,"body":"We don't need new champions at this point. What Riot needs to do is slow champion release to 1 per year and ramp up reworks even more.\n\nInstead of introducing more variables into an already chaotic game (and sometimes introducing blatant mistakes like Zoe {{champion:142}} ) they can rework ole champs that desperately need attention and innevitably end up being new champions in and of themselves.\n\n{{champion:78}} ? New champ\n{{champion:14}} ? New champ\n{{champion:50}} ? New champ\n\nWhy bother making new ones when reworked old ones are also new?","replies":[]},{"poster":"mlm olo mlm","date":"2018-06-24T19:08:30.762+0000","up_votes":2,"down_votes":1,"body":"Riot games is a sinking ship. The captain goes down with the ship.","replies":[{"poster":"SSmotzer","date":"2018-06-25T04:04:08.370+0000","up_votes":1,"down_votes":0,"body":"Blizzard is always a sinking ship, WoW has never recovered it's player base, but still millions of people have been playing it for 14 years. WoW has even changed everything about it's gameplay and lore multiple times, and people are still playing.\nSaying less people are playing LoL now than before means nothing.\nPeople will always come back to LoL.","replies":[]}]},{"poster":"KZ Engel","date":"2018-06-24T17:19:05.215+0000","up_votes":2,"down_votes":1,"body":"i would be completely ok with new champion releases being halted for the sake of all champions being modernized with VUs, VGUs, or reworks","replies":[]},{"poster":"LibroMastro","date":"2018-06-24T15:12:28.101+0000","up_votes":2,"down_votes":1,"body":"Yes, game needs new content","replies":[{"poster":"Anin777","date":"2018-06-24T15:29:11.030+0000","up_votes":2,"down_votes":1,"body":"Other ways to add new content.","replies":[]}]},{"poster":"Blakiepug","date":"2018-06-24T14:26:14.445+0000","up_votes":2,"down_votes":1,"body":"If we are getting no new champions, then I want no reworks as well. Too many champions have been completely removed from the game thanks to poor visual/gameplay reworks. At least when a new champion is released they don't alienate a large portion of the player base (Though I have to admit the balance team has done a terrible job balancing the last few new champs, but to be fair reworks too. I mean, come on, wtf was that hotfix Pyke got less than 24 hours of his release.),","replies":[]},{"poster":"SSmotzer","date":"2018-06-24T09:22:35.074+0000","up_votes":2,"down_votes":1,"body":"You really aren't that creative are you?\nThere are countless things from the lore to make new champions out of that wouldn't muddy the lore in the slightest, and abilities that Riot simply didn't have the technical ability to do.\n\nSaying Riot should stop making champions because everything has already been done is stupid. Like, saying we should stop making movies or writing books, because every story has already been told.\n\nLoL could be the most unbalanced MOBA in the world, and people will still enjoy the hell out of it. People have been playing WoW, and that game has been telling the same story, with the same abilities, and the same gear for 14 years. And people pay for that game. LoL is free, and even if less people are playing now than before that doesn't mean there still aren't people who like the game, warts and all.","replies":[]},{"poster":"Wild Geese","date":"2018-06-24T01:49:30.326+0000","up_votes":2,"down_votes":3,"body":"They have to keep making new champs. But they should probably slow down a bit, and I think they have been.\n\n150 would be a good number but I expect them to make 5 this year, 4 the next year... Then eventualy 3, then 2, 1.\nThen the game will die with about 170.","replies":[{"poster":"Anin777","date":"2018-06-24T01:56:21.055+0000","up_votes":1,"down_votes":0,"body":"Since s4, Riot has released 4 champs every year. s3 was 6 champs. They should stop for a year and see if gameplay is positively affected. That's really what they need to do.","replies":[{"poster":"Wild Geese","date":"2018-06-24T02:37:21.408+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Anin777,realm=EUW,application-id=3ErqAdtq,discussion-id=sOfkMT7L,comment-id=00030000,timestamp=2018-06-24T01:56:21.055+0000)\n>\n> Since s4, Riot has released 4 champs every year. s3 was 6 champs. They should stop for a year and see if gameplay is positively affected. That&#x27;s really what they need to do.\n\nSure ok, thanks for the downvote whatever.","replies":[]}]}]}]}