{"poster":"MOJOB0Y","date":"2015-10-31T18:02:00.619+0000","title":"Silver-Gold Jungler für Ranked Team (Diamond Coach)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\r\nf&uuml;r ein neues Projekt von mir wird noch ein Jungler im Silver-Gold Bereich gesucht.\r\n\r\nProjekt:\r\nIch versuche ein Ranked Team, bestehend aus Silver-Gold Spielern auf Platin zu coachen.\r\nAlle Spieler mit ambitioniertem Ehrgeiz sind daher herzlich willkommen.\r\n\r\nZu mir:\r\nIch spiele schon seit anfang Season 2, im Moment im Diamant-Bereich.\r\nWobei ich jedoch sehr wenig spiele, bzw. mich nicht unbedingt auf SoloQ konzentriere.\r\nIch hab bereits ne Menge Erfahrung im Coaching, sowohl High-Elo als auch Low-Elo SoloQ.\r\nNur mit Low-Elo Teams bin ich bisher relativ unerfahren.\r\n\r\nZu dir:\r\nDu solltest ne Menge Kritik einstecken k&ouml;nnen und wirklich das Ziel haben dich zu verbessern.\r\nMit meiner Hilfe wirst du dich, durch eigenst&auml;ndiges Training, auch in SoloQ mindestens um eine Liga verbessern.\r\nDu solltest zumindest die Basics vom Jungeln verstehen und eine Hand voll Champions bereits haben.   \r\n\r\nLiebe Gr&uuml;&szlig;e\r\nC9 TheRealMojo","replies":[{"poster":"Housemarie","date":"2015-11-03T18:15:01.538+0000","up_votes":1,"down_votes":0,"body":"Hi,\nIch bin sehr interessiert daran in deinem Team zu spielen, da ich ein sehr ehrgeiziger und motivierter Spieler bin.\nDerzeit Spiele ich im SoloQ auf Gold 5 würde mich sehr freuen teil deines Team zu sein.\nSpiele seitdem ich LOL Spiele Main Jungle, meine Lieblingchampions sind Elise (Main über 400 games), Vi, Reksai, Nocturne, Amumu etc ...\n\nWürde mich freuen wenn du meine Einladung im LOL-Client annimmst \nMfg Housemarie","replies":[]},{"poster":"MOJOB0Y","date":"2015-11-03T17:32:20.837+0000","up_votes":1,"down_votes":0,"body":"kein Preis xD\n\nTheoretisch ist Bronze auch in Ordnung, je nach dem wie Motiviert du bist :)","replies":[]},{"poster":"ThisMoment","date":"2015-10-31T23:14:17.946+0000","up_votes":1,"down_votes":0,"body":"Hi,\nich bin derzeit S4 und suche ein aktives Team am liebsten/häufigsten Jng.  \nMeine \"main-jng-Champs\" sind Diana (mein bester Champ auch wenn nicht unbedingt jng meta) Vi, Reksai, Gragas, Elise. Sind meine häufigsten Champs manche mehr in normals als im Ranked. Für mehr Infos usw. auch zu mir selbst add mich.  Lifalla\nmfg","replies":[]},{"poster":"ADONIS nyx","date":"2015-10-31T18:55:15.043+0000","up_votes":1,"down_votes":0,"body":"Würde auch Bronze 1 mit 36 LP gehen?","replies":[]},{"poster":"singl3play3r","date":"2015-10-31T18:42:02.706+0000","up_votes":1,"down_votes":0,"body":"Preis ? :D","replies":[]}]}