{"poster":"LolloKush","date":"2018-03-01T08:43:48.758+0000","title":"AIUTO! TASTIERA E MOUSE FRIZZATI IN GAME","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"HELP \r\nciao ragazzi ho un problema quando entro in game tastiera e mouse non funzionano, come se il mouse non fosse riconosciuto dal gioco, non mi esce il puntatore di lol ma la freccia semplice di windows, ho provato a disinstallare e rinstallare ma nulla ,ho provato piu volte con hextech a reinstallare le patch ma nulla, ho seguito i consigli nel supporto cancellando file input ecc ecc, ma niente non funziona, \r\n&egrave; successo ieri da nulla dopo la terza partita\r\naiutatemi grazie","replies":[{"poster":"MisogiKumagawa","date":"2018-03-01T08:47:54.375+0000","up_votes":1,"down_votes":0,"body":"Prova a disinstallare discord e usarlo su chrome invece che dalla applicazione","replies":[{"poster":"Menfrix","date":"2018-03-01T08:50:22.921+0000","up_votes":1,"down_votes":0,"body":"in realtà dovrebbe bastare disabilitare l'overlay...\nhttps://boards.euw.leagueoflegends.com/it/c/aiuto-e-supporto-it/cApLqHnk-problemi-in-game-mouse-non-funzionante?comment=0000\n\nse è questo il problema che lo affligge...","replies":[{"poster":"LolloKush","date":"2018-03-01T09:02:27.979+0000","up_votes":1,"down_votes":0,"body":"guarda preferisco disintallarlo e mi levo il problema dato che ho gia 10 min di attesa a partita per colpa di sto problema...","replies":[{"poster":"OSBA Line Hare","date":"2018-03-02T19:05:55.439+0000","up_votes":1,"down_votes":0,"body":"ho il tuo stesso problema sto bestemmiando da troppo e non so cosa fare tu hai risolto è da 2 giorni che ho questo problema","replies":[]}]}]}]},{"poster":"Solangelo 4Ever","date":"2018-03-01T10:20:06.813+0000","up_votes":1,"down_votes":0,"body":"Hai provato ad aprire le impostazioni del client e avviare la riparazione completa? Io ho fatto tutto quello che hai fatto tu, per un’altro motivo, e niente funzionava! Quando ho fatto la riparazione completa, il problema si è volatilizzato!","replies":[]}]}