{"poster":"RacuTheWolf","date":"2015-03-06T02:19:39.777+0000","title":"Riot podría responderme?","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"Quiero hacer una pregunta a algun administrador de riot si es que ve esto. Acaso no ven los problemas del servidor?, no ven que su nuevo parche causa errores de lag inexistente por falta de paquetes y un delay asqueroso. Cuando responden algo, que es casi nunca, responden diciendo que \"hacen lo mejor que pueden\", si van a abrir un servidor nuevo, tiene que ser jugable, no se les pide el mantenimiento de el server de korea, pero al menos que arreglen el delay extraño que hicieron gracias a el nuevo parche, solo eso, por que estoy cansado de jugar y estar en una ruleta rusa, aveces anda y aveces no, me tengo que quedar afk por obligacion y ni me deja entrar a la partida, gracias a su parche para sacar a Dj Sona, en ves de pensar en nuevos skins y cosas por el estilo, deberian pensar en los servers bajos y ayudar para que todos tengan una calidad optima o decente como minimo.\r\n\r\nDesde ya, gracias por leer.   {{champion:121}}","replies":[{"poster":"Dixon Daryl","date":"2015-03-06T04:28:36.518+0000","up_votes":2,"down_votes":0,"body":"me pasa que de ms tengo 40-50 en fraps tengo 60-70 y se me lagea O.O ...\nDefinitivamente es el server no puede ser que nos juntemos los del barrio a jugar y todos tengamos LAG siendo de diferentes empresas de internet!!!","replies":[{"poster":"RacuTheWolf","date":"2015-03-06T11:39:28.992+0000","up_votes":1,"down_votes":1,"body":"Raramente, en mi lugar, a la mañana y a la tarde puedo jugar, pero de noche es imposible, o eso es lo que comprobé, no estoy seguro del todo, pero es raro, diría que es mi proveedor, pero si a tanta gente le pasa al igual que a mi, no se que se supone que es, no soy técnico de redes así que no podría decir mucho.","replies":[]}]},{"poster":"CursedProfile","date":"2015-03-06T02:51:29.116+0000","up_votes":2,"down_votes":1,"body":"que el parche te provoca perdidas de paquetes ? ok osea sus modem deben estar quemando y ustedes le dicen que es culpa de riot y como es posible el 4 vs 5 ? si fuese como ustedes dicen muchos estarian afk osea no lo entiendo ya es un trauma tener q echarle la culpa el servidor","replies":[{"poster":"RacuTheWolf","date":"2015-03-06T03:03:32.823+0000","up_votes":2,"down_votes":2,"body":"Podrias informarte antes de hablar?, el mismo riot dijo que fue su culpa mientras ponian el parche: http://boards.las.leagueoflegends.com/es/c/charlas-generales/UngNpYgv-resumen-desconexiones-de-febrero-10-305pm-chiarg\n\n\"En los últimos pasos del mantenimiento, al reactivar los últimos equipos de red (una actividad que se preparó para ser totalmente transparente), un error de configuración en las políticas de ruteo en uno de nuestros enrutadores provocó que dejáramos de recibir tráfico poco a poco y de manera intermitente.\"\n\nNo te hagas el defensor de pobres si ni sabes que pasa, segun lo que vos decis, personas de diversos paises incluyendo chile, tienen modems quemados?, todos juntos?, no entendes que riot no causo un problema a la internet, sino a la conexion de internet con su servidor.","replies":[{"poster":"Cedriel","date":"2015-03-06T15:48:14.556+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=RacuTheWolf,realm=LAS,application-id=v7qsfXsE,discussion-id=u9Lz8Q1E,comment-id=00010000,timestamp=2015-03-06T03:03:32.823+0000)\n>\n> Podrias informarte antes de hablar?, el mismo riot dijo que fue su culpa mientras ponian el parche: http://boards.las.leagueoflegends.com/es/c/charlas-generales/UngNpYgv-resumen-desconexiones-de-febrero-10-305pm-chiarg\n\nEl post que citas se refiere a un problema puntual que ocurrió hace más de 3 semanas y se solucionó ese mismo día. No tiene ninguna relevancia a lo que esté ocurriendo hoy.\n\nHay muchas cosas que aclarar:\n\n- Es muy poco frecuente que un parche de juego haga cambios importantes a la manera en que los servidores reciben / interpretan información;\n\n- Si bien los parches de juego son los cambios de los que los jugadores tienen más visibilidad en este caso hay cambios que nada tienen que ver pero son mucho más importantes para temas de conectividad. Primero, hace algunas semanas hicimos un rebuild completo de nuestros servidores de juego incorporando la tecnología que hemos usado en NA, EU y otras regiones para hacer los servidores más eficientes, más efectivos a medida que aumenta la escala de los jugadores en LAS, y para proteger mejor a jugadores de ataques como DDOS a nuestros servidores o drophacking. Segundo, estamos incorporando un nuevo enlace principal con Movistar / Telefónica—[nota de Rocofu aquí](http://boards.las.leagueoflegends.com/es/c/charlas-generales/eaKemFfn--mantenimiento-programado-4-de-marzo-430am-enlace-telefanica?comment=00080000)—que debiera mejorar la velocidad de muchos jugadores pero puede causar problemas a algunos pocos (estamos pendientes para solucionarlo);\n\n- Un problema de pérdida de paquetes puede ocurrir en cualquier tramo de la conexión entre tu PC y los servidores de juego. En general, si ocurre un problema relacionado a los cambios que mencioné o se da otro problema como una falla de hardware, un corte de fibra entre nuestro datacenter y el PITT o CABASE, el efecto va a ser inmediato, inmenso y muy fácil de diagnosticar. En estos casos Riot pone un aviso para explicar qué está ocurriendo;\n\n- Nuestros registros muestran que las reconexiones / problemas de conexiones han estado estables las últimas semanas salvo por algunos problemas puntuales. Es decir, la cantidad de jugadores que están teniendo problemas de conexión hoy son pocas. Tomando en cuenta lo anterior, lo más probable es que si hay un problema de pérdida de paquetes esto esté ocurriendo en el tramo entre tu proveedor de internet y tu PC;\n\n- Si tienes un problema de pérdida de paquetes *sólo a ciertas horas del día* te puedo asegurar que no tiene relación a la infraestructura de Riot. En base a mi experiencia personal, es probable que tu proveedor de internet haya sobrevendido en tu área sin hacer la inversión necesaria en infraestructura para acomodar al mayor nivel de usuarios / tráfico, y los nodos de red locales se sobrecarguen en la noche una vez que toda la gente vuelva a sus casas y empiece a navegar / ver video en internet.\n\n\nTe sugeriría hablar con tu proveedor de internet y tratar de obtener más información. Si este es el caso, simpatizo contigo porque hace algunos años atrás, antes que yo trabajara en Riot, tuve un problema similar en mi casa al jugar League of Legends (en esos tiempos en NA). Mi proveedor de internet me tuvo dando vueltas con equipos de soporte técnico por 3 meses hasta que explicó el problema y me dijo que no estaban dispuestos a solucionarlo. Es una de las peores experiencias que he tenido.","replies":[{"poster":"RacuTheWolf","date":"2015-03-06T18:07:03.017+0000","up_votes":2,"down_votes":1,"body":"Por favor no me vengan con esas excusas baratas, mi proveedor de internet?, que decis de la gente de uruguay, chile y otros paises de LAS, que se quejan del mismo problema?, el mismo proveedor?, esa es su mejor excusa?, cuando arruinan algo, lo tapan diciendo que es una minoria y se limpian las manos. El problema nunca se soluciono, por que desde ese parche diversos problemas aparecieron, pero ustedes siguen con sus concursos y cosplay de no se que, que solo a un 20% o menos le interesan, les damos plata para que ustedes mejoren el servidor, no para que gasten en esas cosas que no ayudan en nada. No puede ser que otros mobas tengan un servicio optimo y ustedes no, Dota, smite, heroes of the storm, y unos cuantos mas no tan reconocidos que llegue a jugar. Pero bueno, sigan lavándose las manos diciendo que es problema de mi proveedor. \n{{champion:121}}","replies":[]}]}]}]},{"poster":"RayDeath","date":"2015-03-06T02:29:15.412+0000","up_votes":1,"down_votes":1,"body":"Te apoyo, desde el nuevo parche puros problemas, hay unos subidones de ping que duran 3 segundos suben de 25 entre 1000 y luego baja a la normalidad, cosa que nunca había pasado, es un asco, luego los reportes se los come uno, por eso ya no estoy jugando un fastidio mas que diversión.","replies":[{"poster":"RacuTheWolf","date":"2015-03-06T02:34:33.585+0000","up_votes":1,"down_votes":1,"body":"Y que lo digas, yo odio quedarme afk y mas que nada dejar abandonados a mis amigos, estoy cansado de esto, en este momento estan mis amigos jugando 5 vs 4 por culpa de esto u.u","replies":[]}]}]}