{"poster":"Kazushi San","date":"2016-03-18T19:37:21.427+0000","title":"sarà viabile jayce nella 6.6?","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"salve ragazzi, come dice il titolo, che ne pensate di jayce?\r\nHo sempre voluto imparare ad usarlo, ma povero non lo si caga pi&ugrave;, troppi tank che shottano a cazzo....(parlo di jayce usato nella top lane infatti, sia chiaro)\r\nche ne pensate? aiuter&agrave; il buff?\r\nmid non mi piace molto :(","replies":[{"poster":"LulaPalula","date":"2016-03-18T22:11:00.058+0000","up_votes":1,"down_votes":0,"body":"Jayce, se saputo usare è viable al momento, più mid che top. Anche se contro graves/quinn top worka molto bene.\nAlla fine in soloQ se sai usare un champ tutti sono viabili, certo alcuni sono più free elo di altri (vedi shyvana) ma per il resto vanno bene tutti.\nMeglio un champ usato bene e fuori meta che un champ in meta e guocato a caso.","replies":[{"poster":"Kazushi San","date":"2016-03-19T12:18:51.518+0000","up_votes":1,"down_votes":0,"body":"shyvana la nerferanno un pò, ma povera non mi pareva molto op","replies":[]}]},{"poster":"DuckQuack0","date":"2016-03-18T20:20:07.774+0000","up_votes":1,"down_votes":0,"body":"Ho sempre sperato in un suo ritorno, gli auguro un buon buff\nOrmai lui e parecchi altri champion sono scomparsi, io sto sempre dalla parte dei dimenticati {{champion:266}} {{champion:9}} {{champion:119}} {{champion:3}} {{champion:30}} {{champion:38}} {{champion:115}} che a mio avviso hanno bisogno di un bel buff, ognuno necessita di qualcosina in più... tipo Galio, il mana finisce in 2 spell, Aatrox? chi lo ha mai usato in queste 2 season?, karthus non è neanche tanto male, ma hittare la Q è un po' difficile, ed è l'unica spell per fare quasi tutto\naltri invece sono direttamente surclassati da altri champ\n\nPer quanto riguarda Jayce ha ricevuto un bel buff ai danni, forse non sarà così male, il contro di questo champ a mio avviso è solo la difficoltà nel giocarlo, può hard carriare un game da solo in buone mani","replies":[{"poster":"Lord Valotz","date":"2016-03-19T00:11:28.033+0000","up_votes":1,"down_votes":0,"body":"E spera che Galio continui a finirlo con 2 spell il mana, fidati e te lo dice uno che lo gioca. Comunque con le nuove maestrie non è neanche così vero. Devi si amministrare un po', ma alla fine uno usa Galio non di certo per spammare spell alla ricerca della kill, ma per hard counterare il laner nemico e dare utility al team oltre che una buona discreta dose di danni e tankosità.","replies":[]}]}]}