{"poster":"Thezuckito","date":"2016-03-25T15:46:11.558+0000","title":"kha ' zix o rengar?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Hola buenas quiero que me ayudaran con un problema es que no se que campeon comprarme para la jg y estoy entre kha &#039; zix o rengar,  ayuda .","replies":[{"poster":"Thezuckito","date":"2016-03-28T00:54:08.088+0000","up_votes":1,"down_votes":0,"body":"y vi sirve mas que kha zix?","replies":[]},{"poster":"Hexplosivo","date":"2016-03-26T19:54:26.671+0000","up_votes":1,"down_votes":0,"body":"Bueno voy a comenzar diciendo que no hay un absoluto sobre esta discusión eterna, pero vale la pena saber de los dos lados.\n_**Kha'zix:**_ Es uno de los campeones mejor adaptados a la fantasía del personaje. Es altamente evolutivo y es muy difícil encontrar guías en las que te den un armado fijo, porque la gracia de Kha'zix es su EVOLUCIÓN. Con esta propiedad puedes adaptarte a prácticamente cualquier juego, a cambio de mecánicas base más débiles.\n¿Qué quiero decir con esto? Kha'zix ES MÁS DÉBIL en la base, sus habilidades básicas hacen menos daño y tienen menos utilidad al comienzo, pero cuando subes de nivel la R, tienes dos espinas de poder muy marcadas en los niveles 6 y 11 (el de 16 no se nota tan claro como las primeras dos veces).\n- El enemigo tiene mucha movilidad y te cuesta mantenerte en rango de daño: Puedes evolucionar el salto si es que ellos pueden saltar paredes con facilidad, o si es que tienen mucha velocidad de movimiento puedes evolucionar las espinas para aplicar un slow.\n- El enemigo tiene herramientas para anular tu burst, como un escudo o una mecánica de bloqueo: Evolucionar la Q para ganar daño extra, o las espinas para pokear y romper los escudos antes de tirar el combo entero.\n- Tienen mucho CC y te están bursteando muy rápido: Evolucionas tu R y ganas un uso extra del ulti; además de 1 segundo extra por cada uso, o el salto para poder escapar cuando ya has hecho tu daño.\nEntonces tenemos que Kha'zix es muy adaptable y tiene espinas de poder claras.\n_**Rengar:**_ Es un personaje muy completo y con mecánicas bastante confiables, con un patrón de juego agresivo y unos combos conocidos. Eso puede sonar mucho mejor de entrada, y de hecho es bastante bueno para lo que hace. Es famoso por hacer 100-0 a los carrys enemigos, pero pierde algunas cosas importantes de utilidad que tiene Kha'zix: el salto y la invisibilidad.\nAhora debes estar pensando ¿Pero no tiene un salto en la pasiva Rengar? Y si, lo hace, pero no puedes escapar (fácilmente) con él, tienes el engage pero no el disengage, y en equipos con mucho peel puede ser peligroso o suicida intentar hacer tu trabajo.\nPero el lado positivo. Es un personaje que no usa maná, con un sustain mucho más confiable y poderoso que el de Kha'zix, un patrón de juego más estructurado y que no requiere una evaluación constante de lo que haga el enemigo. Vas a aprender los combos y hacer tu trabajo bien. Aunque la mecánica del ataque empoderado te da una buena gama de opciones, no involucra cambios significativos en la forma en la que juegas con cada una de ellas.\nLos contras son que si no haces snowball sufrirás un poco más que otros campeones, y si pasa lo que digo, de enfrentarte a mucho CC, puede arruinarse tu patrón de juego.\n-\nAhora, saliendo de la evaluación de los campeones, mi experiencia es que Rengar es más fácil al comienzo, y perdona mucho más los errores que Kha'zix; pero que un Kha'zix es capaz de hacer lo que quiera cuando quiera una vez superado el primer piso de maestría. Yo juego sin duda mucho más Rengar, porque honestamente me faltan dedos para algunas situaciones de Kha'zix.\n-\nAhora bien, saliendo incluso de lo que es la pelea Rengar/Kha'zix, si quieres empezar en la jungla hay campeones mucho más apropiados.\nYo por ejemplo, en los viejos tiempos  (con otra cuenta, no te guíes por el nivel de esta cuenta) usaba a {{champion:31}} {{champion:36}} {{champion:24}} {{champion:57}} {{champion:111}} {{champion:113}} {{champion:102}} {{champion:14}} {{champion:48}} {{champion:106}} {{champion:19}} {{champion:154}}. Que son más perdonadores y las mecánicas no se interponen en tu aprendizaje de la jungla.","replies":[]},{"poster":"S04 Ragnar ","date":"2016-03-26T12:59:49.164+0000","up_votes":1,"down_votes":0,"body":"Rengar sapeeee!","replies":[]},{"poster":"Ufaaaaaaaaaa","date":"2016-03-25T22:04:26.659+0000","up_votes":1,"down_votes":0,"body":"los 2. Aunque te conviene empezar por Rengar.","replies":[]},{"poster":"Yazzy","date":"2016-03-25T17:24:19.942+0000","up_votes":1,"down_votes":0,"body":"Aprovechá la rotación para probar bien a Rengar y fijate bien...\nA mi me gusta mucho más Rengar y me parece más facil de entender y de jugar. Y con más burst. El problema de Rengar es que si vas por atrás de tus adversarios capaz cuesta un poco más de lo normal el recuperarte y generar impacto en el juego medio-tardío.\n\nSaludos.","replies":[]},{"poster":"Fredrick Zoller","date":"2016-03-25T16:00:37.288+0000","up_votes":1,"down_votes":0,"body":"Va por gustos, a mi en lo personal me gusta mas Rengar, pero como veas :)","replies":[]}]}