{"poster":"GaßY","date":"2015-02-03T00:05:43.842+0000","title":"Estamos en Off-topic","subforum":"Off-topic y temas personales","up_votes":3,"down_votes":0,"body":"Si, soy obvia. \r\n\r\nEntonces, ¿Por qué se postean temas relacionados al LoL, cuando se supone que es foro para debatir cosas sin necesidad de que tenga relación?  Además, de que hay otros foros para debatir las discusiones que se crean acá.\r\n\r\n¿De qué tema se pueden hablar que no sean del juego?","replies":[{"poster":"Aweloz","date":"2015-02-10T17:23:00.008+0000","up_votes":2,"down_votes":0,"body":"Entiendo tu frustracion, como forero creo que la mayoria de la gente que postea aca no tiene ni la mas palida idea de como se maneja un foro, es mas el 90% no lee siquiera las reglas del foro que estan en todos lados... pero bueno, es un foro de que al parecer no esta muy moderado que digamos. \nAdemas eh visto por todos lados gente quejandose del lag y cosas que irian en ayuda y soporte, por todos lados... es mas, veo un comentario cada 10 que no son quejas o comentarios fuera de lugar que no tienen nada que ver con la seccion de foro.\nLo que haria falta aca serian mas moderadores...","replies":[]},{"poster":"Excorpion","date":"2015-02-03T00:10:14.364+0000","up_votes":1,"down_votes":0,"body":"Off Topic... y temas personales...\nLos temas que eh visto acá de LoL son como...\n\"Se enojo mi amigo y no se que hacer, ayuda rito\"... o\n\"Mi amigo me robo la cuenta y blah blah blah\"\n\nclaramente son temas personales dado que es algo que ellos hicieron, y Riot no puede einterferir de ninguna manera en ello","replies":[{"poster":"GaßY","date":"2015-02-03T00:15:41.851+0000","up_votes":1,"down_votes":0,"body":"De igual forma, creo que estaría mal enfocado por los usuarios que siguen conversando del LoL, cuando en este sub-foro se puede hablar de lo que sea. Ese tipo de topics son como absurdos, pero cortaría un poco XD.","replies":[{"poster":"Excorpion","date":"2015-02-03T01:43:06.940+0000","up_votes":1,"down_votes":0,"body":"Exactamente por absurdos van ahí... aunque hablen de lol, el tema no es lol, sino sus problemas personales","replies":[{"poster":"GaßY","date":"2015-02-03T02:32:05.834+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=excorpion2013,realm=LAS,application-id=J8qpiO2I,discussion-id=xoPtzJkt,comment-id=000000000001,timestamp=2015-02-03T01:43:06.940+0000)\n>\n> Exactamente por absurdos van ahí... aunque hablen de lol, el tema no es lol, sino sus problemas personales\n\n\nEs que, soy una usuaria que le gustan los foros, y en los temas de off topic, vi muchísimas variedad de temas. Pero acá, no.\nY eso que hay miles de temas: Manga, Anime, Música, quizá otros juegos... Temas absurdos y sin sentido de \"qué estas escuchando\", \"que estas mirando\",  \"qué opinan de tal tema\". \nPero los usuarios acá escriben consultando cosas del lol XD.","replies":[{"poster":"Excorpion","date":"2015-02-03T02:34:25.628+0000","up_votes":2,"down_votes":0,"body":"Es que recién empiezan los fros y aún no llega toda la gente de antes...","replies":[]}]}]},{"poster":"Revolución","date":"2015-02-03T00:26:46.625+0000","up_votes":2,"down_votes":0,"body":"Yo al menos siempre que entro al off-topic es para hablar de otras cosas, en el viejo foro hice una pregunta jamás respondida sobre usar este foro como medio de promoción para vender cosas incluso jaja","replies":[]}]}]},{"poster":"Top Is ruined","date":"2015-02-05T06:21:31.661+0000","up_votes":1,"down_votes":0,"body":"Porque usamos Charlas Generales para hablar de cosas que son No-LoL (mentira, aca en LAS siguen las reglas, esas cosas pasan en NA/EUW ","replies":[{"poster":"Spooky Golbat","date":"2015-02-06T03:15:46.867+0000","up_votes":1,"down_votes":0,"body":"Segun dice al lado tuyo es LATS (?)","replies":[]},{"poster":"GaßY","date":"2015-02-05T18:01:34.731+0000","up_votes":1,"down_votes":0,"body":"Ni idea que pasa allá, solo me pareció curioso que en esta parte del foro sigan debatiendo/consultando cosas de lol, en vez de charlar de otras cosas.\n\nCapaz estamos tan enviciados que estamos sin tanto repertorio para generar otro tipo de conversaciones XD.","replies":[]}]},{"poster":"Reprise","date":"2015-02-03T01:55:25.308+0000","up_votes":1,"down_votes":0,"body":"Autismo (?)","replies":[]}]}