{"poster":"How Do You Meta","date":"2015-04-07T04:01:03.251+0000","title":"If I change my name to something Malzahar related, would I have higher chances of getting him mid?","subforum":"[ARCHIVED] General Discussion","up_votes":1,"down_votes":0,"body":"As much as I love my name, I need to have some way to actually fucking get my Malzahar mid and increase the chances of it, would changing it to something with Malzahar such as Malzahar Only in it get me higher or lower chances of having the fuckers hellbent on pick order first picking mid Zed/Ahri/Shitty LCS Wannabe Champions to give it up for me? \n\nOut of the 217 games of ranked this season, 148 of them were with Malzahar or 68% , 96 of them were won with a 62.2% win ratio, but no matter what that is never convincing enough to any of the selfish bastards in solo queue who would rather put me somewhere with no experience because they only care about their stats and champions more than giving a one trick pony his spot. My \"highest\" win ratio is with Brand for a grand total of 8 games of ranked of 62.5%, I have a few champions I had to pick out of bad judgement in ranked once and the rest of them are at 50% out of a few games and everything else after that is below 50% win rates with the second most played champion of Morgana with a 44% out of 25 games, no I do not suck with Morgana, [I can do great with her](http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/1787081219/211305313?tab=overview), but I am not able to carry that many games with her because in a lot of cases I end up having my teammates not wanting to push down any turrets and slowly lose a painful game of never getting any dragons/barons/turrets/inhibitors, all of which I do much better as Malzahar as well as him being able to melt tanks more efficiently than Morgana as the tank meta is back.\n\nI feel like the only way I can win is keep spamming Malzahar, but the problem is that losing is almost guaranteed when I don't get him, it is not about me trolling, it is about me being a filthy one trick pony, many of which are also high elo/lcs gods themselves that only can do well with a small number of champions too, don't give me the bull shit that I need to learn how to master every champion and every role, I didn't go from Silver to Plat from filling every game and playing FOTM champions.\n\nTL;DR, would changing my name to something related to Malzahar help or not to get me mid Malzahar? My only concern is if it makes people ban him out of spite too, which has happened before because bastards care about sheepling over what is lcs eye candy rather than looking up a player's stats of a champion instead.","replies":[]}