{"poster":"Squaaad","date":"2017-08-08T00:32:17.730+0000","title":"14 Dias Ban","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":10,"body":"Sr Riot, Se que me equivoque en insultar e flamear tanto, Pero 14 Dias no es mucho por mi primer ban?? a lo que vengo es pedir perdon porque estoy arrepentido de flamear tanto y pido un unban o menos tiempo de Ban. Gracias","replies":[{"poster":"Kanan","date":"2017-08-08T01:48:25.735+0000","up_votes":3,"down_votes":0,"body":"Bien merecido por flammer \n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Raasler","date":"2017-08-08T01:38:45.348+0000","up_votes":1,"down_votes":0,"body":"vos reite , me acaban de suspender de manera permanente y no se por que. nunca me habian suspendido o avisado y no me llego ningun correo ni nada, mande ticket a soporte,  la tengo desde principios de la season 3, es para matarse","replies":[]},{"poster":"MotaLove","date":"2017-08-08T00:59:49.333+0000","up_votes":1,"down_votes":0,"body":"Todos los que tuvieron su primer ban, fue del mismo tiempo, de 14 dias.\n\n¿Que te hace pensar que tendrian que cambiar todas las reglas para darte menos tiempo de ban o desbanearte?...\n\n¿De verdad pensas que por ser simplemente vos, te sacarian el ban y tendrian a 10 mil personas quejandose pidiendo que tambien los desbaneen como a vos?.\n\n¿No es mas facil usar la logica antes de hacer un cry post como este?.\n\nAsi que, perfecto ban de 14 dias, te va a servir para analizar las cosas, y te lo digo por experiencia, despues del ban de 14 dias, ESTAS ULTRA SENSIBLE a recibir un ban permanente, a veces decis gg team, o son re malos y es suficiente para el ban permanente :)","replies":[{"poster":"AlanIvan","date":"2017-08-08T01:20:40.806+0000","up_votes":1,"down_votes":0,"body":"no es para analizar las cosas riot le hace un favor para que no entre porque esta lleno de niños rata troll y toxicos que tiran report a todos por cualquier cosa que hasta yo pediria 10 años de ban -.-","replies":[{"poster":"MotaLove","date":"2017-08-08T01:38:12.373+0000","up_votes":1,"down_votes":0,"body":"Nadie dijo que riot banea para que analicen, cada uno hace lo que quiere despues del ban, riot banea como castigo.\n\nYo le dije que en ese tiempo puede analizar si se va a seguir comportando como niñito flamer o comportarse bien...","replies":[]}]}]}]}