{"poster":"ithi","date":"2017-04-12T20:47:57.409+0000","title":"Unable to Connect to Login Queue from Beta client","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"I get the unable to connect to login queue error message when attempting to login from the beta client. The legacy client works fine.\r\n\r\nThis just started occurring today, and could possibly be related to the installation of the Windows 10 Creator's Update.\r\n\r\nAnyone else experienced this or have a solution to suggest?","replies":[{"poster":"Broporo","date":"2017-04-14T01:08:48.181+0000","up_votes":1,"down_votes":0,"body":"That's interesting that you can login on the legacy client, but the updated client is unable to connect to our servers. It may have been a coincidence that you were able to connect when trying the legacy client, but we can double check some of the possibilities by going through our [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues). The steps there should be able to narrow down any issues with your network that would stop you from getting logged in!","replies":[{"poster":"Chyrant","date":"2017-05-08T20:58:22.269+0000","up_votes":2,"down_votes":0,"body":"This is the same issue I'm having. We talked a bit about it in another forum. I submitted a ticket, but no response yet.","replies":[]},{"poster":"aeacus93","date":"2017-05-03T17:58:26.983+0000","up_votes":1,"down_votes":0,"body":"It's doing it to me as well. Did have a power outage last night while computer was on. I did however do the full repair. installed and reinstalled. Did every fix i've found online. Even got the hextech tool and did a full uninstall still won't work","replies":[{"poster":"aeacus93","date":"2017-05-03T17:59:18.866+0000","up_votes":2,"down_votes":0,"body":"Too bad we don't have access to legacy client anymore","replies":[{"poster":"Chyrant","date":"2017-05-08T20:57:17.309+0000","up_votes":2,"down_votes":0,"body":"I'm having the same issues, and submitted a support ticket. Was Riot able to help you out a all?","replies":[{"poster":"aeacus93","date":"2017-05-10T08:43:02.637+0000","up_votes":1,"down_votes":0,"body":"just kept reinstalling until it worked. i'd say if you had a restore point do so.","replies":[]}]}]}]}]},{"poster":"Holden MaGroin","date":"2017-04-14T02:06:17.947+0000","up_votes":1,"down_votes":0,"body":"Yes, I have experienced the same thing. For some reason the updated client does not work. I tried all of the stuff in the connection guide and none of it seemed to help. The problem only happened after I updated to the Windows 10 Creator's Update.","replies":[{"poster":"Holden MaGroin","date":"2017-04-14T02:10:54.618+0000","up_votes":2,"down_votes":0,"body":"Also, the chat function does not work in client, beta or legacy. It just runs \"connecting to chat\" the whole time.","replies":[]}]},{"poster":"KumaraP","date":"2017-05-21T11:49:45.654+0000","up_votes":1,"down_votes":0,"body":"I also had the error: \"LoL new Client unable to connect to the login queue\". Even though i thought i did everything good and it was a Riot server issue it wasnt.\nAllready tried all Riot's solutions and they did'n work. After some debugging i did finaly resolved the problem myself..\n\nThe problem was with a configuration setting in the Esset Security Software. And it was a setting that did'n deactivate even while u fully disable the software (like temp. disable firewall).\n\nIn the Esset software you can enable Protocol Protection in the Advanced Settings menu. From then on the software starts controlling all SSL and TLS configuration's and every certificate that comes with it.\n\nI came to this while reading the Log: 2017-05-21T13-09-01_1968_LeagueClient.log\nI has the following line:\n000012.699| ERROR| lol-login| ALE-4C0F8C92 - FAILED_TO_COMMUNICATE_WITH_LOGIN_QUEUE - Plugin \"rcp-be-lol-login\" couldn't talk to \"https://lqak.euw1.lol.riotgames.com/login-queue/rest/queues/lol/authenticate\" because: 60 - \"Peer certificate cannot be authenticated with given CA certificates\".\n\nThis got me thinking that i let Certificates be mastered by the Esset Security software and not by Microsoft. And thus i started searching in the menu and found that i could deactivate that option. It's called Protocol Filtering and SSL/TLS-Protocol Filtering. Once i deactivated both of these settings. The issue was gone.\n\nSo this got me thinking, because at some point this did work. Even with the new client. Did something in security changed on the client? Remember the old client did work, new did 2 but after a certain change it didn. So i think Riot's higher level of security also needs attention in 3rd Security Software. \n\nHope this resolution can also help others with same kinda problems.","replies":[]},{"poster":"FatOlive","date":"2017-05-05T21:32:44.386+0000","up_votes":1,"down_votes":0,"body":"I have the same problem some fixes??? I tried everything..... tired legacy it worked fine till now they closed it up.... Win 10 rocks!~!!","replies":[]},{"poster":"Holden MaGroin","date":"2017-04-14T21:41:22.169+0000","up_votes":1,"down_votes":0,"body":"UPDATE: Rolling back to the most recent version of Windows 10 (not Creator) allows the Beta Client to work. I suggest doing that until there is a more permanent fix.","replies":[]}]}