{"poster":"Sr Vegeta","date":"2016-01-04T01:06:05.411+0000","title":"Me desaparecieron dos Skins!","subforum":"Problemas Técnicos","up_votes":9,"down_votes":2,"body":"Mis saludos atentamente a Riot ! , quer&iacute;a comunicarles sobre un problema que tuve ocasionalmente , no s&egrave; si les paso a otras personas, resulta que voy a jugar una partida con mi campe&oacute;n que uso siempre , en este caso, &quot; Blitzcrank&quot; y me doy cuenta que no tengo mi skin la de &quot;Sub-Jefe&quot; Y tambi&eacute;n me paso Con la de Dj Sona , Me pongo a fijarme la skin de Blitz de porque no la tengo y despu&eacute;s me puse a mirar las dem&aacute;s y resulto que me faltaba la de Dj Sona , Los iconos si los tengo de dj sona pero la skin desapareci&oacute; al igual que la de Blitz Sub-Jefe , necesito ayuda urgentemente \r\nMi nick: PinksCamiluktzi \r\n&gt; * 1. PD: Aca una foto de los iconos que los tengo pero la Skin no :\\ \r\nLinks: https://www.facebook.com/PinksGamesLoL/photos/a.1634594080122658.1073741827.1634288223486577/1657952664453466/?type=3&amp;theater (Aca tengo los iconos)\r\nLink2: https://www.facebook.com/PinksGamesLoL/photos/a.1634594080122658.1073741827.1634288223486577/1657952924453440/?type=3&amp;theater (Aca no tengo a dj sona)\r\nLink3: https://www.facebook.com/PinksGamesLoL/photos/a.1634594080122658.1073741827.1634288223486577/1657953367786729/?type=3&amp;theater (ACA NO TENGO MI SKIN DE BLITZ) tengo fotos de partidas con el skin de blitz porfa ayudaa!","replies":[{"poster":"Holox1","date":"2016-01-04T01:29:02.430+0000","up_votes":3,"down_votes":0,"body":"Manda una foto al soporte de la pestaña de \"compras con rp\" en la tienda y la foto donde te dice no disponible.","replies":[]},{"poster":"Nutria Deliciosa","date":"2016-01-04T02:37:03.415+0000","up_votes":2,"down_votes":0,"body":"Yo la tengo, debe ser un error visual","replies":[]},{"poster":"Sr Vegeta","date":"2016-01-04T07:03:56.516+0000","up_votes":1,"down_votes":0,"body":"Osea \"amigo\" no era un amigo si no q el me envio dos skins y yo le habia pagado otra cosa :/ , es super injusto eso si es asi , por que yo no tengo nada q ver osea no sabia nada como obtuve el rp y todo eso... osea termine perdiendo yo ... q bronca u.u","replies":[{"poster":"Maedme","date":"2016-01-04T08:49:15.480+0000","up_votes":1,"down_votes":0,"body":"Tenés toda la razón, es super injusto y vos no tenes nada que ver, por eso tenes que reclamarle a tu \"amigo\" no al sistema... {{champion:10}} \nAgradece que tenes tu cuenta intacta, que hay casos (si es que este es asi) que permabanean por regalos con rp fraudulento donde el destinatario del regalo no tiene nada que ver. {{champion:86}} \nPor ultimo mirá el lado bueno, conservas los iconos  {{champion:48}}","replies":[{"poster":"Sr Vegeta","date":"2016-01-04T09:58:57.679+0000","up_votes":1,"down_votes":0,"body":"Es que mi amigo no lo vi mas conectado , y yo a el le pague otra cosa por medio de otro juego y es injusto que me los saquen a mi los skins ... por hay es verdad tenia rp de manera ilegal pero osea que sentido tiene yo di algo que tenia valor a cambio de esos skins y ahora los perdi :/ , y obvio saco el lado bueno tengo los iconos , pero tambien reclamo los skin estoy en todo derecho no te parece?","replies":[{"poster":"Maedme","date":"2016-01-04T11:35:47.571+0000","up_votes":1,"down_votes":0,"body":"Claro, estas en todo derecho de reclamar los skins, pero de reclamar a tu amigo no a riot, asi como vos bien lo dijiste vos le pagaste otra cosa por medio de otro juego a tu amigo, no se pagaste nada a riot... no es tu culpa, ni de riot, es culpa de tu amigo y por ende es con EL con quien tenes que arreglar el problema o reclamar dichas skins. {{summoner:13}}","replies":[{"poster":"Maedme","date":"2016-01-04T11:41:02.233+0000","up_votes":1,"down_votes":0,"body":"Y en caso que ya no tengas mas contacto con ese amigo, no creo que recuperes las skins por como te lo explique, solo podes pensar que pudo ser algo peor como bien dije, y aprender de esto para un futuro intercambio/negocio, etc.","replies":[]}]}]}]}]},{"poster":"Chillout","date":"2016-01-04T02:01:55.883+0000","up_votes":1,"down_votes":0,"body":"Te doy mg para que te lo solucionen rapido.","replies":[{"poster":"Sr Vegeta","date":"2016-01-04T07:04:22.613+0000","up_votes":1,"down_votes":0,"body":"gracias !!","replies":[]}]},{"poster":"Kill Dah Pollo","date":"2016-01-04T05:54:34.034+0000","up_votes":1,"down_votes":0,"body":"Si te las regalo un amigo, posiblemente ese Rp era fradulento, y te las borran, o si tu amigo fue permabaneado, tambien :v {{sticker:zombie-brand-clap}}","replies":[]},{"poster":"Sr Vegeta","date":"2016-01-04T04:29:59.637+0000","up_votes":1,"down_votes":0,"body":"Si , me la envio un amigo ! , pero no entiendo que tiene q ver eso ? las dos me la enviaron la de blitz y sona :/","replies":[]},{"poster":"Lemon Roots ","date":"2016-01-04T01:09:34.804+0000","up_votes":1,"down_votes":0,"body":"Si te las regalaron, seguro fueron problemas de pago de RP del que te las envio,","replies":[]}]}