{"poster":"Darki200","date":"2015-04-09T15:31:32.103+0000","title":"Consiglio","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve, vorrei chiedere un parere a qualcuno che &egrave; piu&#039; in alto di me. mi &egrave; appena capitata una sconfitta in ranked (Niente di grave, 10 lp lol) \nIl midlaner si &egrave; fatto prendere fuori posizione, &egrave; stato grabbato da blitz ed  &egrave; andato in zhonya. Leona ed elise hanno conseguentemente ingaggiato per non far morire diana anche se avevamo stabilito di far finire ai nemici il buff del baron. Il fight comincia e io vedo spuntarmi davanti cho&#039;gath che ha flashato per andare dritto su di me (Ero dietro rispetto a leona e company). Ora: Il cho era offtank e aveva una thornmail. Voglio capire come poter essere utile in teamfight se io ero da solo e cho mi aveva zonato paurosamente. Anche kitandolo era inutile perch&egrave; aveva la thornmail e mi suicidavo. Arrivato a met&agrave; vita, cho mi ulta, muoio e perdiamo il fight. Vorrei capire come devo comportarmi. Tentare di attaccarlo? Fuggire dal fight lasciando tutti? Sorpassare e ignorare il danno di cho ed andare a colpire i carry?\n\n\nPS. Ero jinx adc","replies":[{"poster":"IrrationalNumber","date":"2015-04-09T15:41:54.995+0000","up_votes":1,"down_votes":0,"body":"Mine, rocket mode, arretra al range massimo e cerca di kitare, se aveva thornmail tu dovevi avere last whisper e bloodthrister. Se il resto del team ti ignora e non hai peeling non puoi fare altro. L'alternativa e' flashare oltre un muro o flashare per riposizionarti. e provarci. Renditi conto che anche un assist ti avrebbe dato il boost di movimento.","replies":[{"poster":"Darki200","date":"2015-04-09T15:44:26.087+0000","up_votes":1,"down_votes":0,"body":"Sì, avevo di tutto, ero full build, ma avendo flashato proprio all'improvviso non ho avuto modo di usare i rocket (ero a 200 range da lui) e sono dovuto andare di minigun piu' kiting. Ma tutto ciò che ho fatto è stato togliergli mezza vita. Purtroppo eravamo davvero svantaggiato per via del baron ed eravamo 2 drake sotto.\n\nPurtroppo il flash era in cd ma credo che il tempo di riposizionarmi e ritornare la mia frontline sarebbe caduta.. Vabè :3","replies":[{"poster":"IrrationalNumber","date":"2015-04-09T15:46:04.541+0000","up_votes":1,"down_votes":0,"body":"Ma infatti nel riposizionarti avresti dovuto cercare di metterti in un angolo per focussare gli squishy o metterti dietro i tuoi alleati. la forza di jinx lategame sta nel range della cannon form e lo splash damage che fai.","replies":[{"poster":"Darki200","date":"2015-04-09T15:48:56.927+0000","up_votes":1,"down_votes":0,"body":"mettila così: Nel team nemico c'era Kalista e Leona ed Elise sono andati addosso a lei (Non uccidendola peraltro), Diana è morta a causa del grab di blitzcrank e jax si è buttato in mischia. Ora, anche stando dietro a 700 range del cannon come fermi un chogath armato di flash+Q? Anche perchè gli squishy del loro team erano almeno a 3000 range da me e non so come avrei potuto fare","replies":[{"poster":"IrrationalNumber","date":"2015-04-09T15:52:08.655+0000","up_votes":2,"down_votes":0,"body":"E a quel punto si, per quanto difficile era meglio cercare di uccidere il carry avversario.","replies":[{"poster":"Darki200","date":"2015-04-09T15:52:24.622+0000","up_votes":1,"down_votes":0,"body":"K, ty","replies":[]}]}]}]}]}]},{"poster":"Sìrjohn","date":"2015-04-09T15:43:06.550+0000","up_votes":1,"down_votes":0,"body":"50% errore tuo che ti sei fatto pizzicare lontano dagli alleati\n\n50% errore della tua leona che invece di difenderti ha reagito di impulso andando ad ingaggiare nonostante il mid laner fosse già fritto.\n\n> Sorpassare e ignorare il danno di cho ed andare a colpire i carry?\n\nLa situazione era già drammatica da quello che ho capito, quindi non so quanta differenza avrebbe fatto....... ma questa penso sarebbe stata la decisione più saggia","replies":[{"poster":"Hawkeyell","date":"2015-04-09T16:08:07.024+0000","up_votes":1,"down_votes":0,"body":"In realtà no, con gli ADC non hai un focus preciso. Chi hai davanti quello hitti, buttarsi in mezzo al fight per colpire i carry equivale a suicidio, bisogna sempre stare fuori dal fight, fare usare i cc pesanti ai nemici e poi entrarci, ovviamente non buttandosi dentro, ma sempre a debita distanza dai cc nemici. \nLa sua partita era un caso perso, qualsiasi cosa avrebbe fatto l'avrebbe persa comunque da quanto ho capito, meglio non consigliare di buttarsi 1vs5 con gli adc quindi. :)","replies":[{"poster":"Sìrjohn","date":"2015-04-09T16:40:21.874+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hawkeyell,realm=EUW,application-id=MJVj50Jw,discussion-id=UwHf74Ry,comment-id=00010001,timestamp=2015-04-09T16:08:07.024+0000)\n>\n> In realtà no, con gli ADC non hai un focus preciso. Chi hai davanti quello hitti, buttarsi in mezzo al fight per colpire i carry equivale a suicidio, bisogna sempre stare fuori dal fight, fare usare i cc pesanti ai nemici e poi entrarci, ovviamente non buttandosi dentro, ma sempre a debita distanza dai cc nemici. \n> La sua partita era un caso perso, qualsiasi cosa avrebbe fatto l'avrebbe persa comunque da quanto ho capito, meglio non consigliare di buttarsi 1vs5 con gli adc quindi. :)\n\nVedo che maini adc, quindi ne saprai molto più di me che ho una skill da bronzo 5 in quel ruolo :)\n\nPerò in linea di massima tra andare a cercare i carry nemici e rimanere da solo nella giungla con Cho, personalmente avrei scelto la prima.","replies":[{"poster":"Hawkeyell","date":"2015-04-09T17:59:30.655+0000","up_votes":1,"down_votes":0,"body":"Ah beh, quello è ovvio. Però nel suo caso se si fosse buttato nella mischia penso che su di lui si sarebbe buttato anche jax, avendolo molto più a portata di skills. Molto dipende dal team, ma anche dal tuo positioning. lui per ritrovarsi da solo con cho in faccia non ha avuto un buon positioning.","replies":[]}]}]},{"poster":"Darki200","date":"2015-04-09T15:49:34.044+0000","up_votes":1,"down_votes":0,"body":"Quindi quando leona ed elise hanno ingaggiato avrei dovuto seguirle e stare vicino a loro pur di stare nella mischia?","replies":[{"poster":"Sìrjohn","date":"2015-04-09T16:34:57.493+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Darki200,realm=EUW,application-id=MJVj50Jw,discussion-id=UwHf74Ry,comment-id=00010000,timestamp=2015-04-09T15:49:34.044+0000)\n>\n> Quindi quando leona ed elise hanno ingaggiato avrei dovuto seguirle e stare vicino a loro pur di stare nella mischia?\n\nQuanto meno non saresti finito solo soletto con Chogat e magari i tuoi compagni ti avrebbero dato una mano.\n\nCmq si confermo che era già andata la partita, non potevi fare molto di più","replies":[]}]}]},{"poster":"Zorby","date":"2015-04-09T16:46:35.291+0000","up_votes":1,"down_votes":0,"body":"Alt+f4, poi ti riconnetti e scrivi \"lag\".","replies":[]},{"poster":"Hawkeyell","date":"2015-04-09T16:09:26.808+0000","up_votes":1,"down_votes":0,"body":"Caso serio la tua partita, sono andato a cercarla e c'è un fattore vincente che ti manca.","replies":[{"poster":"Hawkeyell","date":"2015-04-09T16:18:55.523+0000","up_votes":1,"down_votes":0,"body":"Olaf.","replies":[{"poster":"Darki200","date":"2015-04-09T16:19:36.784+0000","up_votes":1,"down_votes":0,"body":"LOL","replies":[]}]}]}]}