{"poster":"RamarroMarrone","date":"2017-01-17T17:49:27.152+0000","title":"Che ne pensate di questa wombo-combo?","subforum":"Campioni e gameplay","up_votes":1,"down_votes":3,"body":"Ciao a tutti, ho di recente ideato una wombo-combo che posso mettere in pratica con dei miei amici e vorrei che le trovaste qualche punto debole/difetto, cos&igrave; posso migliorarla.\r\n\r\nI campioni da usare sono Yasuo, Ziggs e Nami o Braum, Nami o Braum ulta lanciando almeno 3 nemici in aria e Yasyo e Ziggs ultano a loro volta sui nemici colpiti, se tutto va bene &egrave; un massacro.\r\nChe ne pensate? Chi pensate sia meglio come supporto per iniziarla?","replies":[{"poster":"Dr LouD","date":"2017-01-18T14:13:46.951+0000","up_votes":2,"down_votes":0,"body":"{{champion:54}} Top\n{{champion:62}} Jungle\n{{champion:61}} Mid\n{{champion:429}} ADC\n{{champion:12}} Supp\n\nIBelieveICanFly Combo","replies":[]},{"poster":"wildfox99","date":"2017-01-17T19:53:31.437+0000","up_votes":2,"down_votes":0,"body":"{{champion:54}}+{{champion:61}}+{{champion:157}}+{{champion:21}}+{{champion:37}} \n","replies":[]},{"poster":"Jeanne dˆArc","date":"2017-01-17T18:13:30.927+0000","up_votes":2,"down_votes":0,"body":"Yasuo non è un campione per tutti, o lo si sa usare un minimo o si finisce per fare schifo e andare 0/10. Ziggs mid ci sta ed è molto fastidioso, se invece lo intendi bot (dato che è la moda del momento) lascia perdere. Con Ziggs bot devi chiudere la partita in 20-30 minuti, se va oltre non la vincete più. Si arriva a quel punto della partita in cui sentite la mancanza dell'ADC e non riuscite più a vincere i fight. Nami e Braum sono sempre ok. Detto ciò, la combo può anche funzionare, ma tieni presente i vari fattori elencati. \n\nCi sono combo decisamente più facili e con decisamente più danni: Annie mid (chiunque sa giocarla), Leona support (ottimo tank, cc a non finire, semplice da giocare) e MissFortune (lei è l'unica nota dolente, non è il miglior ADC al momento, devono giocarsela bene lei e Leona in lane). \n\nIn ogni caso, non giocare champ solo per fare le wombo combo, perché il più delle volte non funzionano.","replies":[{"poster":"RamarroMarrone","date":"2017-01-17T21:29:35.046+0000","up_votes":1,"down_votes":0,"body":"Ho proposto quesi campioni perché io e i miei amici sappiamo usarli, mica so' scemo XP","replies":[]},{"poster":"The Fluffy Lamb","date":"2017-01-17T20:44:41.988+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chìtoge,realm=EUW,application-id=cAOZwaUi,discussion-id=PsAr0TnK,comment-id=0001,timestamp=2017-01-17T18:13:30.927+0000)\n>\n> Yasuo non è un campione per tutti, o lo si sa usare un minimo o si finisce per fare schifo e andare 0/10. Ziggs mid ci sta ed è molto fastidioso, se invece lo intendi bot (dato che è la moda del momento) lascia perdere. Con Ziggs bot devi chiudere la partita in 20-30 minuti, se va oltre non la vincete più. Si arriva a quel punto della partita in cui sentite la mancanza dell&#x27;ADC e non riuscite più a vincere i fight. Nami e Braum sono sempre ok. Detto ciò, la combo può anche funzionare, ma tieni presente i vari fattori elencati. \n> \n> Ci sono combo decisamente più facili e con decisamente più danni: Annie mid (chiunque sa giocarla), Leona support (ottimo tank, cc a non finire, semplice da giocare) e MissFortune (lei è l&#x27;unica nota dolente, non è il miglior ADC al momento, devono giocarsela bene lei e Leona in lane). \n> \n> In ogni caso, non giocare champ solo per fare le wombo combo, perché il più delle volte non funzionano.\n\n Miss? Ho fatto una doppia da paura contro la bot nemica. È facilissima e davvero op. L'unico problema è jihn. Sbaraglio gli altri con facilità. Per ora almeno è andata cosi","replies":[]}]},{"poster":"Adam Vodkynsky","date":"2017-01-22T15:40:51.925+0000","up_votes":1,"down_votes":0,"body":"La migliore combo in bot è varus+Sona , se si coordinano con le due ulti diventa subito un 2v1 ed è vinta","replies":[]},{"poster":"Sorcio84","date":"2017-01-17T18:45:51.511+0000","up_votes":1,"down_votes":0,"body":"{{champion:115}} uso il C4 per far saltare un nemico\n{{champion:157}} ulty\nmentr il nemico è in aria {{champion:115}} ulta e la bomba cade quando il nemico tocca terra\n\nCosì dovrebbe fare più danni. Le Combo con yasuke {{champion:157}} sono tantissime.","replies":[]},{"poster":"LightIsMyPath","date":"2017-01-17T18:14:03.368+0000","up_votes":1,"down_votes":0,"body":"manca mf adc, e prova Sejuani jungler per iniziare il tutto.","replies":[]},{"poster":"BluCobalto92","date":"2017-01-17T17:52:57.535+0000","up_votes":1,"down_votes":0,"body":"Matti cho gat mid che tanka e fa schizzare in aria anche lui e in piu silenzia","replies":[]}]}