{"poster":"Leistung","date":"2018-02-09T18:17:29.871+0000","title":"Ryze es noob champ?","subforum":"Guias y consejos","up_votes":5,"down_votes":4,"body":"Hola, empec&eacute; a intentar mainear Ryze ya que me gustaron mucho sus combos y su farmeo, ahora tengo realmente unas dudas, es noob champ? O es un campe&oacute;n que requiere mec&aacute;nicas? Es counter de asesinos? (Akali, Zed, Yasuo, Katarina)\r\n\r\n{{champion:13}}  Los leo","replies":[{"poster":"Sunlight Dawn","date":"2018-02-09T18:40:04.115+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=DeaGly,realm=LAS,application-id=8sKIclmi,discussion-id=7hvbgWgF,comment-id=,timestamp=2018-02-09T18:17:29.871+0000)\n>\n> Hola, empec&amp;eacute; a intentar mainear Ryze ya que me gustaron mucho sus combos y su farmeo, ahora tengo realmente unas dudas, es noob champ? O es un campe&amp;oacute;n que requiere mec&amp;aacute;nicas? Es counter de asesinos? (Akali, Zed, Yasuo, Katarina)\n> \n> {{champion:13}}  Los leo\n\nNingun champion que vayas a usar es de Noob. Todos los champions destacan por sus combos, jugabilidad, mecánicas y demás. Usa lo que te guste y dale para adelante.  Y por lo que vi tenes que saber usarlo muy bien para poder counterear asesinos. Suerte!","replies":[{"poster":"Snooow","date":"2018-02-09T19:11:34.881+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sunlight Dawn,realm=LAS,application-id=8sKIclmi,discussion-id=7hvbgWgF,comment-id=0002,timestamp=2018-02-09T18:40:04.115+0000)\n>\n> Ningun champion que vayas a usar es de Noob. Todos los champions destacan por sus combos, jugabilidad, mecánicas y demás. Usa lo que te guste y dale para adelante.  Y por lo que vi tenes que saber usarlo muy bien para poder counterear asesinos. Suerte!\n\nMenos garen*","replies":[]},{"poster":"Šeiya","date":"2018-02-09T18:51:33.224+0000","up_votes":1,"down_votes":0,"body":"Tenes razón, a veces me cuesta clickear en los enemigos y apretar R con malzahar :/","replies":[]}]},{"poster":"Vlademir Jake","date":"2018-02-10T17:59:17.285+0000","up_votes":1,"down_votes":0,"body":"Ningun personaje es \"noobchamp\", Saludos","replies":[]},{"poster":"Rumshum","date":"2018-02-10T02:05:34.110+0000","up_votes":1,"down_votes":0,"body":"Si te gusta da igual amigo! Con el tiempo de usar a Ryze podes ganarle a casi cualquier cosa ;) disfruta del juego tal como es y no dejes que otros te digan\n\"Noob champ, gg izi noob  campeon para gente sin habilidades motoras\" u otras cosas por el estilo, a opinión personal Ryze es complicado xD. \nAparte, cada persona siente que X campeon es dificil. :o \nSi lo disfrutas de usar seguilo haciendo :3","replies":[]},{"poster":"WhiteMax","date":"2018-02-09T20:53:30.448+0000","up_votes":1,"down_votes":0,"body":"Es un campeon de combos y skill shots asi que no.\n\nSuponiendo que con noob champ te refieres a los que no tienen mecanicas, un ejemplo es tryndamer.","replies":[]},{"poster":"Not Personal","date":"2018-02-09T19:34:15.277+0000","up_votes":1,"down_votes":0,"body":"Noob champ no es ni ahi, su combo se le puede sacar muchisimo provecho si se lo usa bien, pero esto tiene bastante skill cap. Counter asesinos ad puede ser, ya que si te armas la vara de las edades + corazon helado tenes armor, cdr y daño, ademas de tener un buen dps y rango para molestar a campeones como talon que se tienen qe acercar para pegarte su combo. Zed capaz es un caso mas complicado por que con su w/r se te acerca mas facil. \n\nIgual esta bastante fuera de meta y le estan planeando otro rework si no me equivoco, asi que no se si te conviene encariñarte tanto xd","replies":[]},{"poster":"TRASHGENDER","date":"2018-02-09T19:24:59.823+0000","up_votes":1,"down_votes":0,"body":"Mira los counter no existen desde ya, si esta que un campeon sea mejor que otro en cierta fase/etapa in game/jugabilidad etc..\nQue te hacen cambiar tu estrategia de juego, ryze es un DPS( daño por segundo) que depende con la rapidez o astucia tuya puedes burstear un champ en mid o late game, pero siempre dependiendo de que items, nivel o habilidad que tengas con el( me refiero a que conozcas el daño).","replies":[]},{"poster":"Cool As Me","date":"2018-02-09T19:06:23.082+0000","up_votes":1,"down_votes":0,"body":"creo que el unico noob champ del juego es {{champion:32}}  despues todos tienen su mecanica sea mucha o poca. ejemplo, hay campeones dificiles como {{champion:119}}  pero no por eso {{champion:22}}  es facil de usar, porque tambien es adc y requiere saber kitear y cuando tirar habilidades. otro ejemplo con campeones melee, {{champion:41}}  puede ser medio rebuscado para usar a comparacion de otros, pero no por eso  {{champion:11}}  es muy facil de usar. hay que saber cuando entrar, como usar la R, como usar la W para no morir y la Q para esquivar ataques, etc. en fin, creo que casi no hay noob champs. imaginate las mecanicas de un {{champion:157}}  bronce de las y un {{champion:157}}  diamante de korea...","replies":[]},{"poster":"Šeiya","date":"2018-02-09T18:26:29.186+0000","up_votes":1,"down_votes":0,"body":"No, no es un noobchamp y se podría decir que es mas safe que otros magos en cuanto a jugar contra asesinos, pero no tengo idea si es \"counter de asesinos\" en general. \nAl tener combos y su fuente de daño principal provenir de un skillshot, lo hace bastante mas complicado de dominar de lo que pueda parecer, es un lindo pj para mainear, suerte!","replies":[{"poster":"Leistung","date":"2018-02-09T18:31:23.096+0000","up_votes":1,"down_votes":0,"body":"Qué bueno, ojalá me haga subir mucho este champ, le tengo fe, pregunté lo de los asesinos ya que quiero mainer un champ counter de asesinos y este es el mago que más me gustó.","replies":[]}]},{"poster":"shockerx","date":"2018-02-09T19:31:54.750+0000","up_votes":1,"down_votes":1,"body":"Como todo en este juego una ves fedeado todos los champ son noob","replies":[]},{"poster":"Jinxie","date":"2018-02-09T18:31:46.397+0000","up_votes":1,"down_votes":1,"body":"Se","replies":[]}]}