{"poster":"Ser Nalor","date":"2017-10-01T02:29:52.505+0000","title":"Un piccolo consiglio spassionato ai Bronzi/Silver","subforum":"Discussioni generali","up_votes":6,"down_votes":8,"body":"Salve a tutti bronzini e bronzine! (spero abbiate colto la citazione {{sticker:slayer-jinx-wink}} )\r\n\r\nSono qui per esortare tutti voi, giocatori incalliti dei bassifondi di questo universo parallelo quale &egrave; LoL, ad apprendere una meccanica base che potrebbe salvare le sorti della maggior parte delle vostre partite: il famigerato doppioclick su questo oggetto {{item:2055}} \r\n\r\nAmici e compagni di leghe il cui nome &egrave; logorato come la stessa sostanza di cui son fatte e plasmate, non &egrave; una presa in giro o una lamentela, la mia.\r\n\r\nMi trovo a scrivervi da main support: ruolo che presuppone, tra le mansioni principali, quello di dare visione ma...\r\n\r\nC&#039;&egrave; un ma.\r\n\r\nPartiamo dalle basi ovvie.\r\n\r\nQuesto oggetto di cui vi parlavo prima {{item:2055}} ha qualche particolarit&agrave; che vado a spiegarvi qualora non ne siate a conoscenza: a differenza delle normali ward {{item:3340}} ha durata illimitata, rivela ward nemiche che possono, quindi, essere tolte per negare la visione di una zona agli avversari e, ultimo ma non meno importante, pu&ograve; salvarvi la vita da eventuali gank o aiutarvi nel tenere sotto osservazione degli obiettivi.\r\nHa ovviamente anche dei contro, oltre che i pro, quali: &egrave; visibile a tutti e quindi facilmente rimovibile dal team nemico, a inventario pieno non &egrave; possibile possederlo in quanto &egrave; un **oggetto consumabile** e non ha uno slot a parte come i normali trinket e, infine, &egrave; possibile posizionare non pi&ugrave; di 1 control ward a testa nella mappa.\r\n\r\nSenza contare che vi salva da molti champ le cui abilit&agrave; li rendono invisibili o, meglio, applicano Mimesi.\r\n\r\nInoltre, udite bene, &egrave; _**accessibile a tutti**_ nel negozio.\r\n\r\nDunque, perch&eacute; non comprarlo se nell&#039;inventario avete degli slot liberi e vi avanzano quei 100 gold dopo aver acquistato il vostro oggetto super powa dopo il primo recall? Ben venga anche per i successivi!\r\nTarderete di 75 gold il prossimo oggetto ma vi garantisco che &egrave; un investimento ottimo.\r\n\r\n________________________________\r\n\r\n\r\nEsclusa la premessa da promoter delle control ward, faccio questo post perch&eacute; nelle mie partite, ranked e non, noto una nettissima disparit&agrave; di acquisto di questo oggetto tra me e i restanti player (alleati e non) tanto che, in alcune, sono davvero l&#039;unico di 10 persone a prendere e posizionare delle control ward. Di media ne compro una cosa come 5 (e pi&ugrave;) a partita.\r\n\r\nPiccola parentesi:\r\nintendiamoci: sono bronzo (quasi silver) in qualit&agrave; di casual gamer e anche perch&eacute; gioco da relativamente poco a LoL (da fine season 5), tuttavia seguo streaming che mi aiutano a ragionare sul gioco in generale e sul ruolo che mi piace giocare, per l&#039;appunto il support.\r\n\r\nPer cui vi invito a riflettere su questo piccolo gesto che potrebbe migliorare di molto le vostre partite in quanto il _dare visione nella mappa_ non &egrave; solo il compito del support. Tutti possono (e dovrebbero) contribuire.\r\n\r\nInfatti non sto qui a parlarvi di meccaniche di champ, di decision making, macro e micro meccaniche di gioco e via discorrendo. Queste cose le apprenderete pian piano solo interessandovi e approfondendo la conoscenza di LoL tramite coloro per cui il gioco &egrave; un lavoro a tempo pieno e ci studiano giocando per svariate ore al giorno per andare avanti.\r\n\r\nDal canto mio posso dirvi che &egrave; comunque bello giocare ispirandosi ai BIG, italiani e non, emulando quelle piccole chicche che fanno davvero la differenza, soprattutto a elo bassi.\r\n\r\nMa tornando al nostro discorso principale, pensate a questo: se con una squadra, composta da 5 membri, avete nella mappa 5 control ward, otterrete sicuramente 5 posti diversi in cui avrete visione costante e potrete seguire eventuali spostamenti degli avversari e, di conseguenza, potrete muovervi in anticipo, attraverso ping o parlando se state premade in cuffia, nell&#039;intercettarli o nel pianificare una strategia che vi porti in vantaggio.\r\n\r\nAl contrario, non averne, presuppone che prendiate una visione temporanea di qualche zona e, visto il cooldown del trinket giallo/blu, spesso vi ritroverete a vagare al buio dove potreste essere vittime di agguati che porteranno il vostro team ad avere dapprima uno svantaggio numerico e successivamente uno svantaggio di obiettivi.\r\n\r\nAl momento lascio questo post in queste linee generali anche se mi piacerebbe fare di pi&ugrave;.\r\n\r\nVorrei, infatti, poter integrare con delle immagini il **dove** e **quando** posizionare le control ward {{item:2055}} nella mappa in base alla lane che state giocando e/o alle varie situazioni in cui tornano utili.\r\nVolendo anche del warding in generale, se posso essere utile per qualcuno, in quanto mi reputo capace in questa meccanica.\r\n\r\nMa vorrei avere dei feedback positivi per farlo :D\r\n\r\nVi lascio con un episodio che mi &egrave; capitato tempo addietro:\r\n&gt;In champion select salta fuori che, di 5 persone, 4 erano main support (3 autofillati) e un adc (che stava nel suo ruolo). \r\nIn quella partita la mappa era illuminata pi&ugrave; di un albero di Natale!\r\nE la si &egrave; vinta nonostante 3 persone su 5 non giocavano il proprio ruolo n&eacute; il proprio main champ.\r\nLa frase di chiusura fu: &quot;This is what 4 main support can do together&quot;","replies":[{"poster":"A Yordle ln Heat","date":"2017-10-01T08:17:31.736+0000","up_votes":6,"down_votes":0,"body":"Tutto sto ambaradam per dire che la control ward serve?\nDovresti imparare ad essere più conciso.","replies":[]},{"poster":"NIGERUNDAYO JoJo","date":"2017-10-01T07:50:20.760+0000","up_votes":6,"down_votes":2,"body":"Mai visto un discorso piu inutile di questo, senza offesa","replies":[{"poster":"Kim114","date":"2017-10-01T08:12:33.204+0000","up_votes":2,"down_votes":0,"body":"sinceramente, io sono quasi sempre l'unico in squadra a comprarlo, e contro al massimo 1, quindi vedo 2 ward in game, entrambe in top...","replies":[]}]},{"poster":"Giggio","date":"2017-10-01T12:02:22.292+0000","up_votes":3,"down_votes":1,"body":"Non avete capito un cazzo di quello che c'è scritto. \n1. Il post è rivolto a silver bassi e bronzo\n2. Dove cazzo sta scritto nel post che wardare fa' salire di elo???\n3. imparate a leggere (senza offesa) \n\nUno da un consiglio e voi subito a replicare negativamente il nulla perché non avete manco letto quello che ci sta scritto o perché è bronzo e allora consigliare di comprare le control ward non è un consiglio ecc...\nMa ripigliatevi dai","replies":[{"poster":"mikellazzo","date":"2017-10-01T13:19:47.539+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=BadGiggio,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=0009,timestamp=2017-10-01T12:02:22.292+0000)\n>\n> Non avete capito un cazzo di quello che c&#x27;è scritto. \n> 1. Il post è rivolto a silver bassi e bronzo\n> 2. Dove cazzo sta scritto nel post che wardare fa&#x27; salire di elo???\n> 3. imparate a leggere (senza offesa) \n> \n> Uno da un consiglio e voi subito a replicare negativamente il nulla perché non avete manco letto quello che ci sta scritto o perché è bronzo e allora consigliare di comprare le control ward non è un consiglio ecc...\n> Ma ripigliatevi dai\n\nSì appunto, per una volta che un bronzo scrive una cosa sensata e corretta tutti ad attaccarlo solo perchè è bronzo... Se l'avessi scritto io mi avrebbero lodato con titolo di Consigliere Maggiore del warding a bronzi e silver. A quanto pare preferite i post così:\n> QUANDO CAPIRETE CHE BISOGNA COMPRARE LE CONTROLL?????!!!???\n> MA POSSIBILE CHE AL MIO CAZZO DI ELO NESSUNO COMPRA LE CONTROL COSTANO UN CAZZO E VI SALVANO IL CULO, DOPO VI LAMENTATE SE SIETE BRONZI??\n\nBah...","replies":[]},{"poster":"Floppyz","date":"2017-10-01T13:21:31.614+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BadGiggio,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=0009,timestamp=2017-10-01T12:02:22.292+0000)\n>\n> Non avete capito un cazzo di quello che c&#x27;è scritto. \n> 1. Il post è rivolto a silver bassi e bronzo\n> 2. Dove cazzo sta scritto nel post che wardare fa&#x27; salire di elo???\n> 3. imparate a leggere (senza offesa) \n> \n> Uno da un consiglio e voi subito a replicare negativamente il nulla perché non avete manco letto quello che ci sta scritto o perché è bronzo e allora consigliare di comprare le control ward non è un consiglio ecc...\n> Ma ripigliatevi dai\n\nPer favore moderiamo i toni (lo scrivo a te ma vale per tutti).","replies":[]}]},{"poster":"Floppyz","date":"2017-10-01T08:26:27.781+0000","up_votes":5,"down_votes":2,"body":"Mi spiace se hai avuto delle pessime esperienze di gioco, però non è che in bronze/silver non usino quell'aggeggio... O meglio, non è che dipenda dal rank. :P","replies":[]},{"poster":"mattuoto","date":"2017-10-02T10:24:29.958+0000","up_votes":2,"down_votes":0,"body":"guarda il tuo post manca completamente di sintesi, ma ho capito il tuo intento e lo apprezzo. io da jungler in ranked wardo tantissimo proprio perché il più delle volte è la differenza tra la vittoria e la sconfitta.","replies":[{"poster":"Ser Nalor","date":"2017-10-02T10:31:22.888+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=mattuoto,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=000b,timestamp=2017-10-02T10:24:29.958+0000)\n>\n> guarda il tuo post manca completamente di sintesi, ma ho capito il tuo intento e lo apprezzo. io da jungler in ranked wardo tantissimo proprio perché il più delle volte è la differenza tra la vittoria e la sconfitta.\n\nSì, purtroppo per come sono fatto io (stavolta parlo della persona e non del player) non mi riesce semplice sintetizzare. Tendo sempre a eccedere in giri di parole.\nTuttavia la premessa voleva essere uno spunto simpatico ma, a quanto pare, non è stato così.\nUna prossima volta sarò più diretto.\n\nContento che tu abbia apprezzato il post e, sì, un Jungler che warda tanto ha sicuramente una marcia in più!","replies":[{"poster":"mattuoto","date":"2017-10-02T13:08:06.580+0000","up_votes":2,"down_votes":2,"body":"> Tuttavia la premessa voleva essere uno spunto simpatico ma, a quanto pare, non è stato così.\n\npurtroppo su questo forum ci son persone un po' arrabbiate col mondo che si sentono meglio clicckando meno... pazienza dai.","replies":[]}]}]},{"poster":"Dantazzo","date":"2017-10-01T10:20:05.785+0000","up_votes":4,"down_votes":4,"body":"In bronzo silver le ward non servono a niente, la minimappa non la guarda nessuno.","replies":[{"poster":"SirZeel","date":"2017-10-01T13:38:36.539+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Dantazzo,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=0006,timestamp=2017-10-01T10:20:05.785+0000)\n>\n> In bronzo silver le ward non servono a niente, la minimappa non la guarda nessuno.\n\n^ This.\nIntendiamoci, la sightstone e le pink sono tra gli oggetti più utili che si possano comprare; il fatto è che il loro punto di forza è anche la loro debolezza, ovvero l'utilità per la squadra. Se hai la mappa illuminata a giorno dalle ward ma nessuno la guarda, sono soldi buttati per comprarle e oro regalato ai nemici.","replies":[{"poster":"mattuoto","date":"2017-10-02T10:22:37.825+0000","up_votes":2,"down_votes":0,"body":"non è vero.. mi è capitato in una ranked a silver 2 che in un'invation della jungla avversaria, avevo wardato il loro blue. il mio talon mid si è andato a pappare il jungler avversario ed il buff mentre se lo faceva, ringraziandomi per la ward. \n\nquesto è solo un esempio, ce ne sono tanti altri. wardare è una cosa utile e se gli altri non guardano la mappa pazienza, io la guardo e pingo i compagni. a volte seguono, a volte no. ma se fossero perfetti, non sarebbero in silver giusto?","replies":[]}]}]},{"poster":"Ser Nalor","date":"2017-10-01T11:25:40.844+0000","up_votes":2,"down_votes":0,"body":"Uhm... \nE' stato preso peggio del previsto questo post senza un apparente motivo.\n\n> [{quoted}](name=N A M B,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=0000,timestamp=2017-10-01T07:50:20.760+0000)\n>\n> Mai visto un discorso piu inutile di questo, senza offesa\n\nSenza offesa, neanche io ho mai visto un commento più inutile di questo. Se non ti interessava quel che avevo da dire potevi benissimo chiudere la pagina e andare avanti, grazie.\n\n> [{quoted}](name=CommonDotaPlayer,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=0001,timestamp=2017-10-01T08:17:31.736+0000)\n>\n> Tutto sto ambaradam per dire che la control ward serve?\n> Dovresti imparare ad essere più conciso.\n\nHai ragionissima! Purtroppo non riesco molto a essere conciso, la prima parte voleva essere uno spunto ironico ma credo sia stata fraintesa.\n\n> [{quoted}](name=Ciack,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=0002,timestamp=2017-10-01T08:26:27.781+0000)\n>\n> Mi spiace se hai avuto delle pessime esperienze di gioco, però non è che in bronze/silver non usino quell&#x27;aggeggio... O meglio, non è che dipenda dal rank. :P\n\nTutto il contrario, Ciack! Non ho avuto pessime esperienze di gioco a causa delle control ward in quanto io ne compro sempre in abbondanza e spesso fanno la differenza. Semplicemente ho fatto una statistica delle mie partite e, quando non sono in premade, vedo dai grafici di fine partita che quasi sempre sono l'unico a comprarne (e se altri ne comprano, ne comprano 1). Da qui volevo fare questo post come suggerimento di farne uso a prescindere dal ruolo a cui uno piace giocare tanto da propormi di integrare questo suggerimento con degli screen delle zone più utili dove metterle e quando metterle. Ma non credo lo farò visto come si è reagito. :)\n\n> [{quoted}](name=TDWbyll,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=0003,timestamp=2017-10-01T08:56:13.827+0000)\n>\n> fino ad un certo punto ti ho dato ragione pensando che uno di elo alto potrebbe darci dei consigli (inutili a discapito mio, se vuoi che il team compri le ward in qualsiasi elo basta chiederlo, già, basta chiederlo) ma poi ho letto:\n> \n> &quot;Piccola parentesi:\n> intendiamoci: sono bronzo (quasi silver) in qualità di casual gamer e anche perché gioco da relativamente poco a LoL (da fine season 5), tuttavia seguo streaming che mi aiutano a ragionare sul gioco in generale e sul ruolo che mi piace giocare, per l&#x27;appunto il support.&quot;\n> \n>  a quel punto mi sono messo a ridere x)\n\nNon condivido l'allusione al fatto che se sono Bronzo I come rank io non possa dare consigli ad altri di elo simile per quanto riguarda il warding o il dove piazzare control ward. Ma questo è un cliché già visto e rivisto. \n\n> [{quoted}](name=Trenitaliyah,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=0004,timestamp=2017-10-01T09:19:02.274+0000)\n>\n> Una volta ho chiesto ad una Lux support perché non avesse comprato la sightstone (eravamo al minuto 40) o perché non avesse almeno la modifica oracolo, mi ha risposto &quot;Cos&#x27;è la sightstone? E perché poi dovrei prendere la modifica oracolo?&quot;.\n\nEscluso che adoro il tuo nome xD\nEvidentemente era autofillata o non sapeva giocare il suo ruolo. O stava trollando.\n\n> [{quoted}](name=oO0oMo0Oo,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=0005,timestamp=2017-10-01T10:07:31.304+0000)\n>\n> sono silver 4 e le compero... quindi sarei un gold perchè le uso? (secondo la tua teoria)\n\nNon so dove hai letto che alluderei che comprandone saliresti velocemente di elo. Ho solo detto che migliorerebbe la qualità della maggior parte delle partite.\nOnore a te se le compri! Sono utili.\n\n> [{quoted}](name=Dantazzo,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=0006,timestamp=2017-10-01T10:20:05.785+0000)\n>\n> In bronzo silver le ward non servono a niente, la minimappa non la guarda nessuno.\n\nAnche questo, secondo me, è un cliché. Io la guardo spesso e spammo ping anche nelle altre corsie se vedo il jungler avversario, o comunque lo scrivo in chat.\nIl mio post nasce come suggerimento a quelli del mio elo per fare un piccolo passo in più e distinguersi dalla maggioranza dei bronzi/silver ma ovviamente non presuppone che sia un mezzo indiscusso con il quale si vincano le partite.\n\n> [{quoted}](name=ClearWater,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=0007,timestamp=2017-10-01T11:18:43.856+0000)\n>\n> Senza offesa ma non è che comprando le control sali automaticamente di elo. E&#x27; solo una delle tante piccole cose che ti aiutano a migliorare.\n> Anche io ho cominciato a giocare a fine season 5 e sono platino 3, ma non certo solo perché ho iniziato a comprare le pink (control attuali).\n> Se sei bronzo è per ben altri motivi credimi.\n> Ciao!\n\nCiao! Il mio post non è né una lamentela del perché io sia bronzo (ho specificato di essere un casual gamer) né un'allusione che comprando le control ward si vincano automaticamente le partite e si riesca a salire velocemente.\nHai colto che siano una delle tante piccole cose che migliorano il proprio gameplay ma ho anche scritto che per le altre meccaniche che ti completano come player, uno si debba incuriosire e documentare per fatti propri, anche attraverso coaching volendo.","replies":[]},{"poster":"Trenitaliyah","date":"2017-10-01T09:19:02.274+0000","up_votes":2,"down_votes":1,"body":"Una volta ho chiesto ad una Lux support perché non avesse comprato la sightstone (eravamo al minuto 40) o perché non avesse almeno la modifica oracolo, mi ha risposto \"Cos'è la sightstone? E perché poi dovrei prendere la modifica oracolo?\".","replies":[]},{"poster":"Ser Nalor","date":"2017-10-01T14:17:36.705+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SirZeel,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=00060000,timestamp=2017-10-01T13:38:36.539+0000)\n>\n> ^ This.\n> Intendiamoci, la sightstone e le pink sono tra gli oggetti più utili che si possano comprare; il fatto è che il loro punto di forza è anche la loro debolezza, ovvero l&#x27;utilità per la squadra. Se hai la mappa illuminata a giorno dalle ward ma nessuno la guarda, sono soldi buttati per comprarle e oro regalato ai nemici.\n\nCredo sia opinabile come idea seppur ha un suo senso.\nCioè magari è anche una conseguenza mentale, ci avete mai pensato? \nLa mappa è totalmente al buio, che la guardo a fare?\nSe fosse ben wardata si prenderebbe meglio l'abitudine di guardarla ogni tot.\nSe non ci fosse la fog e tutti sapessero dove si trovano tutti, stai pur certo che gli occhi sarebbero puntati interamente sulla minimappa.\n\nSenza contare che questo discorso mi sembra come fare il compitino in relazione agli altri.\nQuando torni a casa da scuola e ti chiedono: \"quanto hai preso al compito in classe?\" e tu rispondi \"5 ma il voto più alto è stato 6. tutti gli altri hanno preso da 4 in giù\" e ti senti rispondere \"degli altri non me ne frega niente! tu devi pensare per te!\"\nPer cui, io penso, perché adagiarmi sul fatto che a bronzo non si warda e io non debba wardare in relazione a questo? Che mi costa fare quel piccolo salto di qualità?\n\nChe ripeto: è minimo.\nNon ti fa vincere partite ma è uno strumento in più per migliorarsi ed essere utile al team.\n\nE in quanto io penso di essere bravo in questa meccanica, esponevo questo suggerimento con annesso aiuto per chiunque volesse saperne di più e che si trovi nel mio stesso elo.\n\nSpero di aver spiegato bene il mio punto di vista :)\n\n> [{quoted}](name=mikellazzo,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=00090000,timestamp=2017-10-01T13:19:47.539+0000)\n>\n> Sì appunto, per una volta che un bronzo scrive una cosa sensata e corretta tutti ad attaccarlo solo perchè è bronzo... Se l&#x27;avessi scritto io mi avrebbero lodato con titolo di Consigliere Maggiore del warding a bronzi e silver. A quanto pare preferite i post così:\n> \n> Bah...\n\nEra esattamente il senso del messaggio che volevo lanciare.\n\nParlo di elo bronzo/silver perché lo vivo in prima persona e ho statistiche a riguardo grazie ai grafici di fine partita, se avessi fatto passare questo suggerimento come valido per tutti non oso pensare che putiferio si sarebbe creato xD\n\nNon so come wardano in elo più alti per ovvi motivi.\n\nSe poi si preferiscono i downvote facili su chi viene permabannato, chi si lamenta di flamer e afk dando la colpa del proprio elo al team e alla RIOT che sembra in combutta per far rimanere in bronzo chi è in bronzo, ai champ sbilanciati, al nuovo sistema rune che non premia i veterani ecc ecc, vi do un altro consiglio spassionato e stavolta rivolto a tutti: cliccate sulla X in alto a destra :)","replies":[]},{"poster":"Mh012","date":"2017-10-04T11:56:33.338+0000","up_votes":1,"down_votes":1,"body":"Non cambierà nulla, le lungavisione non la compreranno mai per wardare baron/drake, l'oracolo manco contro Teemo, Evelynn, Twitch. Scrivono \"fk teemo and u mushroom\", \"stupid rat is everywhere\" ma una pink/oracolo non se la faranno mai e tu vedi 4 m8 al 18 con il trinket giallo","replies":[{"poster":"Ser Nalor","date":"2017-10-04T18:32:05.019+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Mh012,realm=EUW,application-id=MJVj50Jw,discussion-id=QkNGd1xx,comment-id=000c,timestamp=2017-10-04T11:56:33.338+0000)\n>\n> Non cambierà nulla, le lungavisione non la compreranno mai per wardare baron/drake, l&#x27;oracolo manco contro Teemo, Evelynn, Twitch. Scrivono &quot;fk teemo and u mushroom&quot;, &quot;stupid rat is everywhere&quot; ma una pink/oracolo non se la faranno mai e tu vedi 4 m8 al 18 con il trinket giallo\n\nTentare di dare un consiglio non costa nulla :)\n\nIn bronzo vedo ancora bannato Teemo perché non sanno giocarci contro in toplane senza farlo feeddare, Twitch un po' meno bannato ma semplicemente perché non sanno giocarci in giungla senza morirci dai campi...\n\nMa, ripeto, questo post non nasce per consigliare meccaniche di champ o come giocare contro a determinati champ considerati un dito tra le chiappe. Nasce per consigliare di comprare {{item:2055}} in bronzo/silver perché, giocandoci, noto che sono sempre l'unico ad averne nell'inventario (o uno dei pochissimi), tant'è che mi sono proposto, per chi volesse, anche a dare qualche dritta in game su dove e quanto piazzarle.","replies":[]}]},{"poster":"Clearωay","date":"2017-10-01T11:18:43.856+0000","up_votes":1,"down_votes":1,"body":"Senza offesa ma non è che comprando le control sali automaticamente di elo. E' solo una delle tante piccole cose che ti aiutano a migliorare.\nAnche io ho cominciato a giocare a fine season 5 e sono platino 3, ma non certo solo perché ho iniziato a comprare le pink (control attuali).\nSe sei bronzo è per ben altri motivi credimi.\nCiao!","replies":[]},{"poster":"oO0oMo0Oo","date":"2017-10-01T10:07:31.304+0000","up_votes":2,"down_votes":2,"body":"sono silver 4 e le compero... quindi sarei un gold perchè le uso? (secondo la tua teoria)","replies":[]},{"poster":"Bylloo","date":"2017-10-01T08:56:13.827+0000","up_votes":1,"down_votes":2,"body":"fino ad un certo punto ti ho dato ragione pensando che uno di elo alto potrebbe darci dei consigli (inutili a discapito mio, se vuoi che il team compri le ward in qualsiasi elo basta chiederlo, già, basta chiederlo) ma poi ho letto:\n\n\"Piccola parentesi:\nintendiamoci: sono bronzo (quasi silver) in qualità di casual gamer e anche perché gioco da relativamente poco a LoL (da fine season 5), tuttavia seguo streaming che mi aiutano a ragionare sul gioco in generale e sul ruolo che mi piace giocare, per l'appunto il support.\"\n\n a quel punto mi sono messo a ridere x)","replies":[]}]}