{"poster":"DanionVibit","date":"2016-09-13T07:09:13.004+0000","title":"Riot outnerfed mich :(","subforum":"Champions & Gameplay","up_votes":2,"down_votes":11,"body":"Hallo zusammen,\r\nich muss leider grade mal etwas Frust los werden.\r\n\r\nRiot outnerfed mich seit Season 4 durchgehend. Ich finde immer einen Champion der mir Spa&szlig; macht und irgendwann denkt sich Riot (selbst wenn die Proplayer diese nicht picken) nerfen wir den mal in Grund und Boden.\r\n\r\nAngefangen hat es mit Kha&#039;Zix, ja er war am Anfang sehr stark, aber knapp 3 reworks waren mir dann zu viel.\r\nIrgendwann kamen meine Toplaner dazu, wie Trundle und Voli.\r\n\r\nSeit dem Marksman Update liebe ich den neuen Kog&#039;Maw, in diesem Jahr gab es f&uuml;r mich eine Erleuchtung in Form eines Drachen aus dem Universum und einem virtuosen K&uuml;nstler. \r\n\r\nJhin war zu stark, hat Anpassungen erhalten, doch diese waren sehr heftig.\r\nKog&#039;Maw wurde schon mehrmals im Laufe des Marksman Updates angepasst.\r\nAurelion Sol wurde seit seinem Release schon zwei mal generft.\r\n\r\nKog&#039;Maw so gebe ich zu ist aktuell grade in &quot;protect the AD&quot;-Comps sehr stark.\r\n\r\nDoch warum WARUM wieder ein nerf auf meinen verbleibenden Mains... Ich spiele aktuell sehr gerne Kog, Aurelion, Illaoi und Ryze. Habe somit einen Championpool mit dem man gut was anfangen kann und mir pers&ouml;nlich genug Abwechslung und M&ouml;glichkeiten bietet!\r\n\r\nDoch auf dem PBE wird der Horror Realit&auml;t! Aurelion Sol erh&auml;lt sein dritten und Todessto&szlig; nerf, Kog&#039;Maw wird zu seinem Status im Jahre 2015 zur&uuml;ck gesetzt (WTF!!!?!?!??).\r\n\r\n\r\nDiese nerfs sind meiner Meinung nach auch sehr scheinheilig bzw. einfach nur unverst&auml;ndlich begr&uuml;ndet. \r\n\r\nKog&#039;Maw wird generft weil er wohl  zu stark im Early und Midgame ist. Say WHAT? Early ist bescheiden mit ihm und das Midgame ist nerfbar.... aber gleich reverten und das nach fast &uuml;ber nem Jahr ... holy\r\n\r\nAurelion Sol wird generft, weil Riot denkt, das es unfair gegen&uuml;ber von Spielern ist die kaum gegen ihn spielen. WAAAS?! Ach wenn ihr ein Champion released und ihn bei geringer pickrate weiterhin nerfed wird die pickrate nicht ansteigen... Rechnerisch besteht eine 2%-Chance einen ASol zu sehen und das ist auch der einzige Vorteil den ein ASol-Spieler hat und den nimmt man ihm auch noch ?!\r\n\r\nbleibt also nur noch Illaoi und Ryze.... \r\n\r\nWow zwei Champions, wenn es hoch kommt zwei Position...\r\n\r\nMein Lieblingsspiel ist LoL und ich mag es, dass es dynamisch ist, aber immer neue Champions zu lernen, weil die anderen kaputt gemacht werden ist nicht Sinn der Sache und macht mich recht traurig ;(\r\n\r\nDanke an die Leute die es bis hier hin gelesen haben! Um noch etwas Konstruktives hieraus zu machen, habt ihr auch schon einmal die Erfahrung gemacht &quot;outnerfed&quot; zu werden?","replies":[{"poster":"CYPHΕR","date":"2016-09-13T07:19:15.229+0000","up_votes":8,"down_votes":0,"body":"Spiel die Champions doch einfach weiter?\n\nWer seine Champions richtig gut beherrscht kann sich damit immer einen Vorteil herausspielen.\n\nFür dich fallen aber Champions schon aus der Auswahl raus, nur weil sie nicht mehr deutlich stärker sind als andere, bzw. ihre eigentlichen Schwächen fast keine sind aktuell? Du willst also nur Champions mainen, die von Natur aus einen Balancingvorteil gegenüber den anderen haben...","replies":[{"poster":"DanionVibit","date":"2016-09-13T07:38:41.982+0000","up_votes":1,"down_votes":7,"body":"Du willst mir also sagen, dass Aurelion Sol ein Balancingvorteil besitzt? Ein Champion der instant platzt sofern er gecatched wird und dessen EINZIGER Vorteil darin besteht die ersten zwei Waves pushen zu können um roamen zu gehen. Das sein einziger Vorteil (Championdesign)  auch noch entfernt wird ist in meinen Augen nicht Richtig - nur weil man ihn zu selten sieht und anderen Spielern eine Chance geben will weil sie ihn nicht kennen {{summoner:14}} \n\nWie ich sagte Kog'Maw ist aktuell sehr stark, aber ihn in die Jahre 2015 reverten ist richtig? {{summoner:11}} \n\nDen Jhin nerf fand ich OK, war nur sehr stark (Ich spiele ihn ja immer noch)","replies":[{"poster":"Alustus","date":"2016-09-13T07:57:13.634+0000","up_votes":2,"down_votes":0,"body":"So ziemlich jeder champ platzt wenn er gecatched wird, gerade Midlander sind dafür anfällig.\n\nAurelion hatte sicher nicht die höchste winrate im high elo weil er keine Vorteile hat.\n\nMassen CC, permanenter aoe schaden sind jetzt 2 dinge die mir auf die schnelle einfallen wo er einen Vorteil gegenüber anderen champs hat.","replies":[{"poster":"CYPHΕR","date":"2016-09-13T10:06:37.939+0000","up_votes":1,"down_votes":0,"body":"Extrem gutes Roamingverhalten, welches so unnatürlich Stark war, dass er trotz seiner \"Schwächen\" (die dank hoher Range, sehr gutem Basedmg und gutem Waveclear eh nicht so stark ausgeprägt waren) sogar im Master/Challenger, als auch in der competitiven Szene fast permanent gepickt oder zumindest gebannt wurde.","replies":[]}]}]}]},{"poster":"Humpelstilzche","date":"2016-09-13T07:59:52.052+0000","up_votes":3,"down_votes":0,"body":"Sowas passiert halt dann öfters, wenn man eine Neigung dazu hat aktuelle Trend-Champs zu spielen. Häufig haben Trends eben was mit der Stärke eines Champs zu tun, es ist also nur logisch dass diese Champs am ehesten generft werden. \n\nAnsonsten kann ich mich nur CypherHD anschließen: Spiel die Champs halt einfach trotzdem. Die Champs gefallen dir doch vermutlich nicht bloß, weil sie ein bisschen stärker sind als andere, oder? Es gibt doch bestimmt etwas am Champion an sich, dass dir gefällt. Und das bleibt in der Regel auch nach Nerfs erhalten.\n\nMein persönliches Beispiel ist Kindred. Ich hab Kindred schon nach dem ersten Spiel geliebt und hab dann wochenlang, vlt sogar für Monate kaum was anderes gespielt. Seit dem wurde Kindred immer und immer wieder generft. Ich weiß garnicht wie viele Nerfs es waren, aber ich glaube 3 Patches dürften es mindestens gewesen sein. Aber der Champ ist nach wie vor der selbe (auch wenn die Funktion der Ulti geändert wurde). Das was Kindred ausmacht gefällt mir nach wie vor. Ich spiel Kindred nicht mehr so häufig wie früher, aber es ist immer noch ein Champ, den ich wirklich mag. \nUnd solche Champs solltest du halt auch für dich finden, Champs die du auch dann noch spielen kannst und möchtest, wenn sie nicht mehr der größte Fisch im Teich sind.","replies":[{"poster":"DanionVibit","date":"2016-09-13T08:25:52.165+0000","up_votes":1,"down_votes":2,"body":"Ich werde auch weiterhin ASol spielen wie ich es auch mit Jhin mache, allerdings verstehe ich eben nicht ganz warum es ein Pocketpick wie ASol trifft. Es gibt aktuell starke Champions die nicht angerührt werden obwohl sie eine übel hohe pick/banrate haben. \n\nUnd das lustige oder ehr spaßige an z.B. Kog'Maw geht ja jetzt komplett flöten. Er wird eben wie vor dem MM-Update nun ehr selten gepickt und wenn er gepickt wird, wird ehr unerfolgreich sein (denke er wird bei 45% Winrate enden).\n\nIch spiele natürlich sehr gerne alle aufgezählten Champions im normal egal wie sie gepatcht werden, doch im Ranked kommt es natürlich auch, neben dem spaß, auf die Performance an. \n\nWie soll denn ein Champion der nach den Patch lvl12 haben sollte, gegen schnell skalierende Champions in der SoloQ bestehen können, selbst mit protect comp. \n\nWas soll ein ASol-Spieler denn nun gegen Assasins in der SoloQ machen, wenn er sich kein Farmvorteil mehr verschaffen kann ohne direkt oom zu gehen.\n\nIch spiele gerne Champions die ins Lategame skalieren. Natürlich spiele ich, sofern ich Ranked spiele, häufiger Champions die ein Balancevorteil haben, doch warum sorgt man nicht dafür, dass diese bestehen können ohne den Vorteil...\n\nIn diesem Patch ist es wieder ein super Beispiel:\nKogMaw wird erst mit lvl 12 effektiv und hat vorher weder Waveclear noch andere stärken um zumindest die Lane even halten zu können. Er bräuchte hier einen starken early Champion an der Seite ... das wären für mich sowas wie VelKoz, Zyra, Karma.... aber diese Champions haben 0 Protect potential (ok vtl Karma noch). Lulu-Maw Comp war meine Lieblings und Spaßigste Comp und das ist nach den Lulunerfs nun kaum möglich um ne Lane even zu halten.\n\nAurelion Sol hat die gleiche stärke wie jetzt mit Lvl 14 mit der Einschränkung, das er im Early nichts mehr kann, weder roamen noch pushen ohne oom zu gehen oder tons of farm zu verlieren. Die Taktik von ASol ist ja die nicht in der Mitte zu sein, wenn man OneShotter dort hat... und was wird in der mitte gespielt ... oh OneShot Nuker/Assasins .....\n\nIch habe das Gefühl dar Riot bei einigen Champions nicht weiß wohin sie mit ihnen wollen bzw. die Spielweise der Champions sich mit den Vorstellungen Riots beißt...\n\nAurelion: Early <-> LateGame, Roam <-> Lane, Nuker <-> Constant\nKog'Maw: Hypercarry <-> Midgame, Protect AD <-> Lanedominanz","replies":[]}]},{"poster":"Alustus","date":"2016-09-13T07:53:39.779+0000","up_votes":1,"down_votes":0,"body":"> Doch auf dem PBE wird der Horror Realität! Aurelion Sol erhält sein dritten und Todesstoß nerf, Kog'Maw wird zu seinem Status im Jahre 2015 zurück gesetzt \n\nAurelion Sol (Platin+) hatte die höchste winrate klar wurde er generft. (hat übrigens noch immer eine überdurchschnittliche winrate)\n\nKog Maw sein late war teilweise problematisch, außerdem macht es keinen Sinn einen Adc so zu konzipieren das er stärker ist wenn er nicht kited.\n\n\nDavon abgesehen sind all deine genannten Champs weiterhin spielbar und sicher nicht schlecht. (Befinden sich aller über dem Durchschnitt)","replies":[{"poster":"Suprèmeleader","date":"2016-09-13T10:46:38.942+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Alustus,realm=EUW,application-id=Wj1wcocU,discussion-id=pAM7QEMZ,comment-id=0002,timestamp=2016-09-13T07:53:39.779+0000)\n>\n> Aurelion Sol (Platin+) hatte die höchste winrate klar wurde er generft. (hat übrigens noch immer eine überdurchschnittliche winrate)\n> \n> Kog Maw sein late war teilweise problematisch, außerdem macht es keinen Sinn einen Adc so zu konzipieren das er stärker ist wenn er nicht kited.\n> \n> \n> Davon abgesehen sind all deine genannten Champs weiterhin spielbar und sicher nicht schlecht. (Befinden sich aller über dem Durchschnitt)\n\nEr hat nur eine hohe weil er nie gespielt eird und die die ihn spielen können ihn gut","replies":[{"poster":"Alustus","date":"2016-09-13T14:12:28.924+0000","up_votes":1,"down_votes":0,"body":"Demnach hätte jeder Champion mit einer ähnlichen Playrate eine entsprechende winrate.\nHinzu kommt das er schon eine positive Winrate nach 10-15 Spielen hat was jetzt nicht gerade eine Hohe Spieleanzahl ist,","replies":[]}]}]},{"poster":"Zovers","date":"2016-09-13T17:26:23.050+0000","up_votes":1,"down_votes":0,"body":"Vielleicht machen dir gerade die Champions Spaß, die sehr stark sind weil du dann mit diesen mehr Erfolgserlebnisse hast in Form von Kills. ^^","replies":[]},{"poster":"StillYasuoMain","date":"2016-09-13T14:46:29.898+0000","up_votes":1,"down_votes":0,"body":"Du spielst praktisch alle Champs, solange sie op sind...also da wunderts mich nicht. Ja es macht spass mit einem op champ alles zu zermetzeln, jedoch nur für den Spieler selber.","replies":[{"poster":"DanionVibit","date":"2016-09-13T15:33:50.578+0000","up_votes":1,"down_votes":0,"body":"Ich habe niemals behauptet, dass ich sie nie wieder spielen werde, ich habe nur gesagt das sie weniger effektiv sind und wenn man in der ladder climben möchte muss man Effektivität nun einmal groß schreiben.\n\nWarum haben dann Urplötzlich ALLE Korean builds gespielt ... bestimmt nicht weil es so viel Spaß macht nicht zu critten... Es war effektiv und so ist es. Man spielt im Ranglistenmodus ja ehr das was Spaß macht und einfacher ist (warum auch immer es einfacher ist). \n\nIch würde mich sogar als sehr guten Aurelion Spieler bezeichnen, aber die Pick als auch Banrate haben einen nerf nicht nötig... \n\nAber naja, der Threat war eh nur um ein wenig Frust abzubauen ... dann werden eben neue Runen, Masterie und itembuilds erarbeitet (denn ich bin einer der überlegt gerne selber) und eigentlich war ich noch nie wirklich DER Meta-Spieler....\n\nMir war klar das alle Leute denken werden, dass ich die Champions nie wieder spiele ...\nZwischenzeitlich habe ich allerdings ein wenig Theorycrafting gemacht und kann bei ASol das ganze ehr als Buff bezeichnen und KogMaw war auch recht OP damals ... mit einem Item was jetzt mehr Attackspeed gibt aber keine Crit mehr hat und somit noch besser zu ihm passt :)","replies":[]}]},{"poster":"Out of Pøsition","date":"2016-09-13T08:25:20.175+0000","up_votes":1,"down_votes":0,"body":"xD wtf das spiel ist wohl nix fuer dich. wie währe es damit auf die meta zu scheißen und deine champs einfach so gut zu spielen das du in deiner elo damit bestehst ohne zu verkacken? ich spiel viele champs die nicht im trend sind und die auch genervt wurden allerdings kommt es viel mehr auf dein skill an als auf den nerf/nicht nerf. wenn du die champs nach dem nerf einfach nichtmehr spielen kannst... dann konntest du sie wohl nie und hast nur gewonnen weil sie zu stark wahren? 1-2 games zum umgewöhnen und es passt doch wieder .. is doch auch langweilig wenn du zu deinem lane sieg echt nichts beitragen musst weil du nichts können musst ( spiel doch garen oder yi  die haben 1000 \"nerfs\" bekommen und sind immernoch op as fuk weil du sowas einfach nicht richtig nerven kannst ^^ oder villt irelia :p #betternerfirelia ) \nMFG ΏTrafalgar LawΏ","replies":[]},{"poster":"Flüssigsubstanz","date":"2016-09-13T07:44:21.347+0000","up_votes":1,"down_votes":0,"body":"Outnerfed? Um ehrlich zu sein nie, wenn man seinen champion richtig beherrscht und auch spaß mit dem hat kann man mit jeden champion noch carrien. Ich mein ich wette es gibt selbst \"hier schlechtesten champion ingame einfüg\" mains die in Masters sind. Bisher hat meiner Meinung nach das balance team von riot diese season vieles gut gemacht. So und nu zu den nerfs die dich angesprochen haben die dir widerfahren sind. Kha zix ist immernoch verdammt häufig zu sehen vorallem in NA wenn du dir mal stream anschaust siehst du die recht häufig in Diamond- challenger bereich. Jhin wird auch noch entweder gebannt oder gepickt weil seine stärke nicht wirklich verloren gegangen ist, seine stäkre ist immernoch verdammt hoch und du kannst immernoch mit der ulti \"one\" shotten und vorallem im lategame braucht er nur 1 auto Q+ attack um jemanden zu killen. So was les ich noch.. Kog Maw wird wieder zurück zum alten design gebracht. Da kann ich dir eine gute erklärung für geben, weil dieser champion mit 5.0 atk speed schwer bis garnicht zu balancen ist. Man schränkt sich  dafür  einfach zu sehr ein was balance/anpass möglichkeiten von Items angeht. Ich mein die können einfach nicht die items richtig balancen. \n\nAls beispiel würde ich Wits End (Ende der Weisheit) nehmen das teil macht 40onhit magic damage es ist ein recht solides Item auf kayle warwick irelia jax und wahrscheinlich noch vielen mehr, jedoch ist das item zu stark auf kog maw. Wenn sie widerrum 5 on hit dmg reduzieren würden würde es kog maw nicht interessieren aber den rest wer das item dann zu uneffizient weil ihnen der damage fehlt.\n\nSo, was gibs da noch.. Aurelion ich mag den champion und das ist die einzige sache wo ich ein wenig zustimmen muss das sie sich ein wenig dumm angestellt haben. Die stelle wo sie ihn JETZT nerfen ist ansich so wie es anfangs sein sollte weil du einfach W geskillt hast und komplett reinpushen konntest du warst einfach ungelogen der champion der am schnellsten alles reinpushen konnte und im earlygame ist das schon toxisch wenn man dann auch lvl 4 roams macht oder einfach den farm von den gegner denied weil der tower alles kriegt. In gegenzug sollten sie meiner meinung nach die ulti wieder um 50 buffen was sie vorher generft hatten. Das würde mir schon reichen. Selbst nach dem nerf würde ich aber trotzdem sagen das man aurelion noch immer spielen kann, gewinnen kann und spaß haben kann.","replies":[]},{"poster":"haha weed lol xd","date":"2016-09-14T08:49:23.222+0000","up_votes":1,"down_votes":2,"body":"tl;dr: OP only plays OP Shit ~ goes crazy when they nerf it cause Balance Issues.","replies":[]},{"poster":"HookEmUp","date":"2016-09-14T07:43:51.287+0000","up_votes":1,"down_votes":2,"body":"Ist doch ganz klar. Riot hat dich auf deinen Mains performen sehen und denkt sich so: Holy wir müssen nerfen. Die Champs lassen selbst so einen Carrien.:)","replies":[]}]}