{"poster":"DanionVibit","date":"2016-12-20T06:16:11.861+0000","title":"Qualität der (aktuellen) Spiele","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":1,"body":"Hallo Leute, \r\nich habe momentan ein Thema das mich besch&auml;ftigt und seit Anfang dieser Season existiert. \r\n\r\nEs geht um die Spielqualit&auml;t im allgemeinen. Ich habe das Gef&uuml;hl, dass ich aktuell nur stomps erlebe. \r\n\r\nEntweder das Gegnerteam zerst&ouml;rt oder mein Team. Unabh&auml;ngig von Sieg oder Niederlage hatte ich etwa 2 Spiele von den letzten 20 Spa&szlig;, weil es mal keine stomps waren. \r\n\r\nZus&auml;tzlich kommt es in meinen Spielen vermehrt zu schlechten Verhalten, auf beiden Seiten. Es ist sogar wieder so schlimm, dass ich meinen all-chat (nach 1 1/2 Jahren) wieder deaktivieren musste, da ich mir die geistigen Erg&uuml;sse nicht mehr geben konnte. Zudem ist sp&auml;testens nach 15 Minuten mein Team gemutet, da meine mates immer alles besser zu wissen scheinen. \r\n\r\nIst das zur Zeit nur mein Problem oder ist euch &auml;hnliche Verh&auml;ltnisse aufgefallen. \r\n\r\nP.S.: Auf diesem Account spiele ich zwar haupts&auml;chlich FlexQ, bin aber auch mit einem smurf am SoloQ spielen. Es betrifft also beide Qs","replies":[{"poster":"CustomKunibert","date":"2016-12-20T08:30:07.433+0000","up_votes":1,"down_votes":1,"body":"Gib der Season noch ein wenig Zeit. Wenn sich jeder seine Wunsch-Elo erspielt hat (und sich der flamende Rest unterhalb abgesetzt hat), wird es auch wieder ruhiger und ausgeglichener. Einfach warten, alles wird gut ;) \n:D","replies":[{"poster":"DanionVibit","date":"2016-12-20T14:33:28.242+0000","up_votes":2,"down_votes":0,"body":"Seltsam ist nur, dass es in der preseason nicht so war... liegt es vtl wieder daran das alle am übel tryharden sind und wenn nicht alles nach Plan läuft sie schnell getriggered sind... mhh","replies":[{"poster":"CustomKunibert","date":"2016-12-20T14:36:25.413+0000","up_votes":3,"down_votes":0,"body":"Das klingt nach dem LoL, das ich kenne :D","replies":[{"poster":"DanionVibit","date":"2016-12-20T14:54:10.842+0000","up_votes":1,"down_votes":0,"body":"Stimmt eigentlich :D","replies":[]}]}]}]},{"poster":"Blacky85","date":"2016-12-20T14:20:03.437+0000","up_votes":4,"down_votes":1,"body":"Ja was solll ich dazu sagen ? Meist hört man nach 9-10 Min game is over oder die Leute spielen totalen Bullshit zusammen und feeden nur noch. Oder man sieht Jhins mit Armor-Pen Build. Da bekommt man das große kotzen. Man wird mit 8:2 in Bronze 1 gematcht und bekommt dann bei seinen Promos unranked Spieler dazu. Derzeit hat Riot echt wieder viel viel mist gemacht mit der Ranked Ladder. Geil ist auch das man immer mit Positiven Stats raus geht aber dennoch die MMR immer schlechter wird (trotz win) das kann echt alles nicht sein. \n\nDerzeit ist es eine Echte Qual vorallem wegen der ganzen feeder die das dann wirklich absichtlich machen. Und das Report System um solche Idioten aus dem Verkehr zu ziehen ist auch ein Witz. Schaut man sich dann mal die vergangen Matches jenner Spieler an so sieht man immer entweder sie haben schnell nen Lead bekommen oder haben nur noch gefeedet und das zum Teil mit 12-18 Toten und mer. Das kann es doch nicht sein, dass soclhe trolle immernoch unterwegs sind. \n\nMan will hier mal 2-3 Runden vernünftig spielen und hat danach nen Puls von 360. Kann doch nicht sein das ich nach 5Min mein komplettes Team Muten muss.\n\nTeilweise hab ich nach 15min schon das verlangen mir nen Kaffee zu machen und dann nur noch zuzuschauen weil man selbst zwar 1:0:1 steht aber der gegner Bot and Top 4:0:4 und beides Lanes schon bis zum Inhib Tower gepusht sind und mein Team immernoch meint ach komm wir gehen rein. \n\nDerzeit macht es echt keinen Spaß","replies":[]},{"poster":"Kampfgnuppel","date":"2016-12-23T20:18:44.496+0000","up_votes":2,"down_votes":1,"body":"Die Qualität der Spiele ist absoult scheisse. Das Leben als ADC wird einem in dieser Season schon genug schwer gemacht. Als Dank erhält man nur Autofill-Support, die absolut nichts können. Gerade am Anfang der Season, wo ich noch mit Silber rumdümple, kann niemand Support spielen. Die Lane wird nur schon durch den Support entschieden. Gerade wenn was Gegnerteam nur schlecht ist, tilted das extrem. Speziell die Flex-Q ist eh nur noch als Troll-Q bekannt. \n\nDas Hauptproblem: Auto-Fill\nWeiteres Problem: Das System - Schlichtweg sinnlos und sch... . Für was hat man so ein System, wenn doch nicht innerhalb der Liga spielt. MMR abschaffen oder sich danach richten, ende.","replies":[]},{"poster":"Julius Cheesar","date":"2017-10-22T14:05:22.290+0000","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\nich bin in letzter Zeit total unzufrieden mit League of Lgends... Ich bin nicht so der Tryhard und spiele eher zum Spaß (dementsprechend meine Elo Silber 5)  aber in letzter Zeit ist League of Legends bei mir von meinem Lieblingsspiel abgestiegen. Ich spiele jetzt seit Season 2 und habe das Gefühl, dass sich lol in diesem Zeitraum vom Matchmaking usw. sehr schlecht entwickelt hat. Ich habe in meinem Team anscheinend nur Leute die das erste Mal lol spielen und im Gegnerteam normale Spieler... Ich habe mich schon durch die Lanes durchgespielt aber habe meistens nur verloren und komme seit mehreren Monaten nicht aus Silber 5 raus, nicht irgendwie aus Silber oder dergleichen sondern aus einer Division...\nIch hoffe, dass Riot da ein bisschen dran rumschraubt um lol wieder auf eine hohe Qualität zu bringen, dass es wieder Spaß macht und ich mich darauf freue abends mit Freunden ein bisschen zu Spielen.","replies":[]},{"poster":"Alatrion","date":"2016-12-20T08:03:28.352+0000","up_votes":1,"down_votes":1,"body":"Dass die Matches noch so unausgeglichen sind, liegt meiner Meinung nach an der beginnenden Season, da noch nicht jeder dort ist, wo er hingehört, spielst du gegen bessere und/oder schlechtere Spieler, was die stomps erklären würde.\n\nVielleicht ist das auch der Grund für die ungewöhnlich vielen Flames zur Zeit (ja ich benutze den mute button auch recht häufig zur zeit ...), da die Leute einfach unzufrieden mit ihrer Elo sind.\n\nHochachtungsvoll Alatrion","replies":[{"poster":"DanionVibit","date":"2016-12-20T14:31:42.131+0000","up_votes":1,"down_votes":0,"body":"In der preseason war es deutlich angenehmer, als jetzt und das ist was mich wundert.","replies":[{"poster":"Ireliα","date":"2016-12-20T16:27:31.673+0000","up_votes":1,"down_votes":1,"body":"Viele haben sich über ihre Platzierung aufgeregt und wollen schnellstmöglich wieder auf ihren alten Rang. Wenn sie jetzt in den niedrigeren Ligen verlieren kann es ja gar nicht an ihnen liegen, es müssen die \"dummen Noobs\" sein die in diesen Bereich gehören.","replies":[{"poster":"three stodges","date":"2016-12-22T16:40:22.671+0000","up_votes":1,"down_votes":0,"body":"Ziemlicher Schwachsinn den Sie schreiben.","replies":[]}]}]}]},{"poster":"MeThoD MaN110","date":"2016-12-20T08:49:39.704+0000","up_votes":1,"down_votes":0,"body":"also im solo q ging das voll auch auf smurfs. flex q dagegen lief bei mir überhauptnicht. habe iwie aber auch nicht so gut gespielt. oft aber auch sehr unfaire matchups gehabt, ungewöhnlich viele afks, trolls etc. wird sich denke ich aber einpendeln wenn ich da ne höhere elo erreiche und die flamer in die unteren regionen der ladder gewandert sind.","replies":[]},{"poster":"three stodges","date":"2016-12-20T12:10:17.863+0000","up_votes":1,"down_votes":1,"body":"Es geht mir ähnlich seit dem Soft Reset habe Ich auch weniger ausgeglichene Spiele, es liegt wohl daran das viele runtergestuft worden sind ,Gold 5 sind runter bis in Bronze und jetzt muss man einfach etwas Glück haben beim Matchmaking. Ich bin auch schon am überlegen es mit Ranked sein zu lassen die nächsten 2 - 3 Monate bis sich das wieder eingependelt hat von der Spielstärke her.","replies":[]}]}