{"poster":"BrattishSolid6","date":"2015-05-24T18:06:34.069+0000","title":"Braum o Thresh?","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Mi sono deciso ad attendere nuovamente i 6300 PI. Gioco prevalentemente top e support. Dopo aver rimandato l&#039;acquisto di altri champ, la scelta ricade tra Braum{{champion:201}}  e Thresh{{champion:412}}  Ho giocato entrambi nelle ultime settimane in quanto Free Champ, ed entrambi mi ispirano tantissimo.  E sono indeciso, tutto qui. Amo giocare grandi tank (vedi {{champion:54}}  {{champion:89}}  {{champion:57}} ) ma me la cavo bene come support in generale ( {{champion:16}}  {{champion:53}}  {{champion:25}}  e persino {{champion:17}} ). Se c&#039;&egrave; qualcuno di esperto che ha tempo e voglia di consigliarmi mi aiuterebbe :)","replies":[{"poster":"I Homura I","date":"2015-05-25T11:31:53.499+0000","up_votes":2,"down_votes":0,"body":"Io preferisco il Mustacchione forevah <3 Tornando seri è veramente op e fastidioso. Da main support io ti consiglio di prendere prima Braum e poi Thresh in quanto entrambi ottimi. Braum è un ottimo pick soprattutto contro adc tipo Jinx,Ezreal,Ashe,Lucian le cui ulti possono essere interrotte facilmente dallo scudo del mustacchio,solo che è un pò difficile perchè devi essere pronto e avere buoni riflessi e posizionamento per via dello scudo. Vuoi contare la passiva poi? E' quasi uno stun perenne. \nMentre Thresh è altresì forte per il grab,il rallentamento di massa e le salvezze tramite lanterne random lanciate attraverso i muri,lo reputo un pochino più safe rispetto a Braum. Poi dipende da come giochi ,se ti piace veder soffrire e bestemmiare gli altri prendi Braum se invece vuoi giocare vedendo solamente imprecare gli altri prendi Thresh :D","replies":[{"poster":"BrattishSolid6","date":"2015-05-25T11:55:42.643+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheShowMustGoOn,realm=EUW,application-id=MJVj50Jw,discussion-id=8uaEdlNU,comment-id=0005,timestamp=2015-05-25T11:31:53.499+0000) Poi dipende da come giochi ,se ti piace veder soffrire e bestemmiare gli altri prendi Braum se invece vuoi giocare vedendo solamente imprecare gli altri prendi Thresh :D\n\nQuesta parte mi ha ucciso ahahahahahahah\n\nNo seriamente, penso prenderò prima Braum. Dà molto più controllo e può intervenire attivamente. Insomma, parliamo di un baffone palestrato con uno scudo. Uno scudo enorme. E aspetto davvero solo di trovare uno degli adc che hai nominato (tra cui inserirei senza problemi anche Miss Fortune e Twitch) per vedere infrangersi i sogni dopo una ulti :D\n\nGrazie anche a te per il commento c:","replies":[{"poster":"I Homura I","date":"2015-05-25T12:00:01.505+0000","up_votes":2,"down_votes":0,"body":"Figurati ^^ Alla fine tutti i support sono forti,basta saperli usare u.u\nCompragli la skin El Tigre però..è tutto un altro mondo (io ce l'ho :D)","replies":[{"poster":"BrattishSolid6","date":"2015-05-25T12:30:18.102+0000","up_votes":1,"down_votes":0,"body":"Ehm..... Se devo essere sincero è quella che mi piace meno D: ahahahah l'ho vista su youtube e non mi piace né il concept né le animazioni :/ mi sono innamorato invece di Braum Ammazzadraghi <3 A giugno dovrebbe essere scontata da 975RP a 487RP. Sarebbe la mia seconda skin acquistata da quando ho iniziato a giocare e la terza in tutto (grazie Riot per quel Mecha Malphite a inizio anno. Ah, in quel periodo mainavo proprio Malphite. Qualcuno mi osserva, me lo sento <.<)","replies":[{"poster":"I Homura I","date":"2015-05-25T14:50:37.210+0000","up_votes":2,"down_votes":0,"body":"Solo 2?Ne comprerai altre,è nell'istinto dei giocatori di Lol :DD\nComunque a me piace quella skin di Braum,è così figherrimo con quel suo mantello svolazzante da pro prendendo a sediate tutti quanti! Mi sento gioiosa quando lo uso con quella skin,sarà il fascino del Mustacchio D:","replies":[{"poster":"BrattishSolid6","date":"2015-05-25T16:01:49.998+0000","up_votes":1,"down_votes":0,"body":"AHAHAAHAHAHAHAHAHAH il fascino del Mustacchio non lascia scampo :D\nMa mantengo la mia tendenza etero e verso Braum Ammazzadraghi. De gustibus ovviamente c: Io preferisco sputare palle di fuoco in faccia agli adc. Ognuno ha i suoi hobby ahahahah","replies":[]}]}]}]}]}]},{"poster":"Elle C","date":"2015-05-25T03:11:53.950+0000","up_votes":2,"down_votes":0,"body":"Ehm è tardi per rispondere? :) ad ogni modo scelta giusta! \"Sei al sicuro con Braum\" da main support ti posso assicurare che braum è un ottima pick e ha un buon impatto durante tutte le fasi del game... Molti pensano che il suo early non sia dei migliori ma in realtà ha del potenziale ;) dipende che lane hai contro... Ma in generale se conosci le mosse giuste il suo early può essere fortissimo grazie alla sua passiva... Personalmente ti consiglio vivamente di maxare prima la Q poi la e poi la w... Te lo dico per esperienza :) se vuoi la spiegazione del perché puoi chiederlo qui oppure se ti va mi dai il tuo nome account ti addo su lol e ti spiego un paio di cose :) non sono un challanger ma mi piace aiutare le persone per quello che posso","replies":[{"poster":"BrattishSolid6","date":"2015-05-25T08:38:25.399+0000","up_votes":1,"down_votes":0,"body":"PREMESSA OT: Della lega mi importa davvero poco, tranquillo. Io sono ancora unranked, dopo 8 partite in cui ho trovato SEMPRE almeno una o due persone che trollavano e feedavano (e quindi 8partite perse su 8 giocate) sono passato perennemente alle normal e draft. Magari in estate, quando ho più tempo, ricomincio.\n\nSul max Q -> E -> W mi interesserebbe la spiegazione, sì. Se lo scrivi qui ancora meglio, almeno sono consigli disponibili e utili a tutti C: ho guardato un po' di guide online e tutte consigliano come secondo max la W, ma se hai un'altra teoria sarei davvero interessato a sentirla.","replies":[{"poster":"Elle C","date":"2015-05-25T11:21:32.084+0000","up_votes":2,"down_votes":0,"body":"Bene allora posso scriverlo qui. Il fatto è che diciamo entrambe le skill hanno come obbiettivo la protezione di uno o più champ alleati... Però mentre la w dà solo un bonus sull armor a un solo bersaglio la e può proteggere dall intero ammontare di danni più alleati... Maxando la e non solo si diminuisce il cd ma si aumenta anche la durata dello scudo di un secondo che è tantissimo e in più anche la percentuale di danni bloccati che ti permettere di sopravvivere meglio... In lane la riduzione di cd ti permette di fare trade più spesso e di avere più possibilità di vincere la lane... In teoria potresti considerare la possibilità di maxare la w prima della e quando tra gli avversari ci sono degli assassin... Ma in realtà il bonus di armor il più delle volte non sarebbe sufficiente per salvare il tuo adc da un Ulti di zed quindi io ti consiglio di maxare la e prima della w anche in quel caso","replies":[{"poster":"BrattishSolid6","date":"2015-05-25T11:51:40.404+0000","up_votes":1,"down_votes":0,"body":"Capito. è un buon ragionamento, mi trovo d'accordo.\nA questo punto penso che maxerò (sempre come seconda) la W al posto della E solo nel caso in cui l'adc avversario stia facendo schifo.  A meno che non ci siano in game altri champ che possono attaccare a distanza con quella frequenza penso che armor in più non faccia mai male, e aiuti il riposizionamento abbastanza velocemente. Seguendo il tuo ragionamento però (giusto eh) una W non potrebbe salvare l'adc da una ulti di zed, ma tantomeno farebbe una E no?","replies":[{"poster":"Elle C","date":"2015-05-25T19:52:02.479+0000","up_votes":1,"down_votes":0,"body":"Giusto in parte... In teoria se riuscissi a scudare la Q di zed probabilmente il tuo adc sopravviverebbe... Io l'ho fatto varie volte :) ma comunque anche senza considerare questa eventualità resta il discorso precedente ovvero che lo scudo offre più utility a discapito di una ventina di armor su un solo alleato","replies":[]}]}]}]}]},{"poster":"TheAwesomeJ","date":"2015-05-24T19:12:37.345+0000","up_votes":2,"down_votes":0,"body":"Bhe diciamo come tutti i tipi di support hai a che fare con 2 tipologie diverse.\n{{champion:412}} si butta sull'utility e controllo\n{{champion:201}} invece sul paraculismo totale\nEntrambi hanno i loro punti forti, il problema è sfruttarli.\nNonostante thresh sia un pick estremamente forte, attualmente lo reputo scontato e prevedibile, per cui ti consiglierei braum!\nMolti pensano che braum sia una sottospecie di Leona(2), quindi si sei grosso e rompi le scatole e ti vien voglia di ingaggiare sempre, ma il meglio lo dà proprio quando protegge il carry e non quando carica a testa bassa!\nHa un early molto \"meh\", ma in compenso nel late guadagna stats belle interessanti e se contro hai personaggi che dipendono da skillshot non puoi trovare di meglio!\n\nDurante i fight ti basta concentrarti sulle posizioni del nemico, individuata la maggior fonte di danno (che può essere la combinazione di più nemici) cerchi di tenerli impegnati e di proteggere il tuo team con lo scudo e nel caso ci sia un'assassin hai sempre la W pronta per scattare sugli alleati.\nMa sbagliare le tempistiche della E può voler dire minare un fight e dunque serve attenzione!\nUtilizzarlo non è così \"easy\" come sembra, anche perchè la ulty è parecchio lenta in confronto ad altre skill di controllo ad area e la Q garantisce solo un piccolo CC.\nLa forza dunque sta tutta nel difendere amorevolmente il team.. e wardare!!!","replies":[{"poster":"BrattishSolid6","date":"2015-05-24T20:16:38.397+0000","up_votes":1,"down_votes":0,"body":"(Ho appena finito una partita con Braum 3/2/24). Concordo pienamente, l'early non è dei più facili, ma mi trovo davvero bene con la passiva. Oltre all'utility vero e proprio intimorisce in qualche modo i nemici, sanno che potrebbero essere stunnati diciamo ahahahah mi sto trovando bene, sempre più convinto di prendere \"il cuore del Freljord\" c: La E comunque, dopo aver letto qualche guida e visto qualche gameplay, è l'ultima che vado a maxare. Lungi dal dire che non abbia rilevanza anche se di basso livello, ma penso sia la W che dà quell'armatura bonus essenziale. Ottimo champ sotto molti aspetti, e il fatto che me lo consigliate già in due me lo conferma.\n\nP.S. Per le ward non temere, non lascio mai la base senza almeno un {{item:2044}} o {{item:2043}}  :D","replies":[{"poster":"TheAwesomeJ","date":"2015-05-24T21:22:52.635+0000","up_votes":2,"down_votes":0,"body":"Per quanto riguarda le skill ti sconsiglio di maxare la W per 2 semplici motivi:\n\n- Il primo punto garantisce 15 arm/mr, ogni punto successivo invece 2.5 cumulativi. Quindi bisogna vedere se ogni punto può garantirti altro.\n- Dura sempre 3 secondi il bonus, non è molto efficace nei fight ed è usato prevalentemente come utility per raggiungere e/o difendere.\n\nQuindi, a seconda della situazione, ti consiglio di maxare Q o E.\nLa Q garantisce dei danni che verso il livello 8 - 10 iniziano ad essere alti 195 - 240 + (%vita) e ne diminuisce di 2 secondi il cooldown di ogni secondo. Se hai la possibilità di pokkare queste Q sono estremamente fastidiose, sono teghe di 200 alla volta ogni 6 sec circa.\nSenza contare che puoi usarla per proccare la {{item:3302}}  da una distanza ragionevole.\n\nLa E invece aumenta di durata, di % di riduzione dannie e cala di cooldown. Solitamente la maxi quando hanno dei poke belli sostanziosi (pg es nami e lucian).\n\nComunque se ti sei trovato bene maxando la W, prova anche così, ti troverai meglio :)\nPoi giustamente ogni situazioni ha le sue varianti ^^","replies":[{"poster":"BrattishSolid6","date":"2015-05-25T00:00:34.960+0000","up_votes":1,"down_votes":0,"body":"Ups, mi sono spiegato male io probabilmente ^^ come prima abilità ho sempre maxato la Q. I danni aumentano in base agli HP massimi, e ciò mi permette di andare full tank e contemporaneamente massimizzare i danni possibili. Quando parlavo di \"maxare la W\" intendevo solo una volta potenziata al massimo la Q. Considera che nelle poche partite che ho fatto ho avuto parecchia fortuna, il mio adc era davvero bravo (premade :D ) e il loro ha sempre feedato. Non avendo la pressione di un tiratore nemico pericoloso non mi sono curato subito di potenziare la E. La W in queste situazioni mi permetteva di raggiungere meglio i membri in difficoltà nel team fight, tutto qui. Conferendo comunque quel 30/40 armatura bonus che non guasta mai c:\nCiò non toglie che rileggendo bene la E mi sono accorto che conferisce il 10% in più di movimento (mi sembra, o comunque un aumento di velocità). Insomma, ottimo sia per scappare in ritirata che per inseguire un nemico con un lastrone di ghiaccio in mano :D","replies":[]}]}]}]},{"poster":"mezzo minion","date":"2015-05-24T20:38:26.586+0000","up_votes":2,"down_votes":0,"body":"Effetivamente ora come ora un braum lascia molto più spiazzati i nemici per la passiva ed inoltre da una protezione pazzesca all'adc molto probabilmente lo prenderò anchio, comunque da amante di thresh non posso che consigliarti anche lui successivamente ;D","replies":[{"poster":"BrattishSolid6","date":"2015-05-25T00:07:44.696+0000","up_votes":1,"down_votes":0,"body":"All'inizio mi incuriosiva solo per il fatto di essere full tank, ma più lo gioco più mi rendo conto dell'enorme presenza che può dare in bot. Passiva, Q, W, E, R. OGNI abilità si fa sentire, hanno fatto davvero un buon lavoro. Poi se unito a un adc full attack speed (vedi Kalista) secondo me dà il meglio di sé. \n\nIl problema è che ho troppi champ da prendere e troppi pochi PI ahahahahahah ho in lista Caitlyn, Pantheon e Vi da un mesetto buono, ma appena scopro champ \"nuovi\" (vedi Thresh e Braum) non resisto. Inoltre a giugno sarà in saldo la skin Braum Ammazzadraghi. Dopo un anno di gioco non ho mai versato nulla oltre a 2,50€ (Soraka Driade. Non giudicatemi, la amo) ma penso farò un secondo strappo alla regola ahahahah\n\nE anche se ora prendo Braum, tranquillo che Thresh non lo lascio in negozio per molto ancora C:","replies":[]}]},{"poster":"Bloody Axe","date":"2015-05-24T18:33:13.601+0000","up_votes":2,"down_votes":1,"body":"Ciao! Anche io sono uno dei pochissimi main supp, maino braum ma ho mainato anche thresh tempo fa. La scelta dipende dal tuo stile di gioco, dato che ti piacciono tanto i tank ti consiglio braum, poichè può andare tank già dall'inizio della partita con lo scudo reliquia, mentre thresh va di moneta antica (lo scudo reliquia su thresh lo considero quanto di più osceno possa esistere. Braum può essere definito op per la sua passiva integrata negli attacchi base e grazie allo slow della Q (70%) potete raggiungere l'adc avversario e stunnarlo con due attacchi base ciascuno, dopodichè o falsha o muore.Per quanto riguarda utility per l'adc, Braum può difenderlo molto facilmente grazie a una W e a una strautile E, che se indirizzata bene riesce a bloccare tutti i colpi dell'adc avversario, così riesci anche a fare kill con il tuo adc a 200 hp mentre quello avversario ne ha anche il doppio. In teamfight Braum se piazza la ulti in modo decente riesce a dare molto più tempo al team per reagire a eventuali manovre avversarie grazie allo slow. I suoi difetti sono pochi, se non riesci a feedare il tuo adc diventi semi-inutile, poichè anche se utilizzi la E, a causa dei danni dell'adc feedato, ti uccidono lo stesso e poi possono anche uccidere il tuo adc senza problemi dato che il vero ostacolo da superare sei te stesso, comunque se ti feedi tu e il tuo adc potete snowbollare tutta la partita senza grossi problemi grazie allo stun integrato alla passiva. Per quanto riguarda Thresh, è un ottimo champ che nelle mani di un buon player può carriare la partita fra grab save e robe cosi. Ha molta utility per l'adc grazie alla E e alla W. Se però fallisci i grab, la tua presenza in lane diventa quasi inutile, un pò come blitz, anche se puoi comunque salvare l'adc in caso di engage degli avversari. Le sue pecche sono molte, tra cui il fatto che non va subito tank dall'inizio della partia, quindi un adc avversario feedato vi snowbolla tranquillamente e inoltre in tf non può fare granchè oltre a difendere l'adc, cosa in cui è specializzato braum. Una volta grabbato un avversario e intrappolarlo di R, puo solamente tankarti danni, poiche non hai più abilità a disposizione. Se ti piace essere tankosissimo ti consiglio Braum che SECONDO ME è anche più utile in un teamfight, dato che può applicare a tutti gli avversari gli stack di colpi stordenti se invece ti piace salvare gli alleati di W e condannare gli avversari di Q, prendi thresh. Un'ultima cosa, Thresh diventa micidiale quando riesce a grabbare gli avversari uno ad uno cosi che costringete gli avversari ad ingaggiarvi in una posizione svantaggiosa, oppure se ne restano a guardare il proprio alleato che viene ucciso, cosi puoi ricominciare da capo, grab, kill, grab, kill.\nI miei consigli per Thresh sono:\nNON PROVARE MAI a grabbare il tank avversario che è una cosa assolutamente dannosa per il tuo team, dato che da il tempo al team avversario di seguire l'alleato grabbato in modo che lui si tanki i vostri danni mentre loro vi uccidono tutti.\nNON GRABBARE NESSUNO se non ci sono i tuoi alleati dietro ad aspettare il tuo engage, cosi ti condanni a morte da solo.\nConsigli per Braum invece:\nIn teamfight, buttati per primo, ulta più persone che puoi, applica gli stack di passiva all'apc e all'adc (sempre se non sono difesi) e dopodichè salta IMMEDIATAMENTE sul tuo adc di W e difendilo di E, in tal modo hai fatto tutto ciò che poteva essere possibile con braum, appena il tuo adc è sicuro prova a chasare qualcuno di Q.\nGrazie per aver letto fin qui e spero di esserti stato utile, se avete altre opinioni dite pure cosi potrò anche migliorarmi come supp.\nQualunque sia la tua scelta io resto sempre fedele a Braum.\nCi si becca nella landa.","replies":[{"poster":"Darth Ponzius","date":"2015-05-26T15:16:26.320+0000","up_votes":1,"down_votes":0,"body":"> mentre thresh va di moneta antica (lo scudo reliquia su thresh lo considero quanto di più osceno possa esistere\n\nhttp://www.probuilds.net/champions/Thresh\n\noook... si, osceno perchè? perchè da a Thresh l'unica cosa che forse gli manca? ovvero un po' di sustain per se e l'adc? lo rende più \"tankoso\" e gli permette quindi di ingaggiare di più (cosa in cui eccelle)? L'execute sui minion non funzionerà ma puoi comunque last hittare bene i minion e avere più gold di quanto ne avresti con la moneta.","replies":[]},{"poster":"BrattishSolid6","date":"2015-05-24T18:52:19.043+0000","up_votes":1,"down_votes":0,"body":"Mi aspettavo di tutto meno che una lunga e dettagliata risposta ^^ e altrettanto utile. In realtà ero anch'io più su Braum che Thresh, ma il fatto di vederlo usato così poco rispetto a molti altri (tra cui lo stesso Thresh) mi ha fatto sorgere qualche dubbio. Ho chiesto proprio prima di spendere 6300 PI (che non sono spiccioli) per evitare di trovarmi con un champ che si rivela scomodo o non all'altezza delle aspettative. Il fatto che la sua efficienza nel late game dipenda dall'early e dall'adc tra l'altro possiamo estenderlo benissimo a qualsiasi support. Anzi, con una passiva del genere sempre utilizzabile (anche a distanza, con la Q) penso possa essere di un certo rilievo anche se la bot viene persa. All'inizio mainavo Soraka support (la vedo usata anche quella pochissimo, ma nessun altro champ permette save del genere), ora maino Leona (tank <3). A questo punto penso proprio di prendere Braum, mi hai convinto ahahaahah Thresh mi ispirava più che altro per gli engage (Q + E + se disponibile R) e per la versatilità (l'ho visto usato adc in un paio di partite ad alto livello. Paradossalmente più forte che support). Tra qualche giorno i Poro avranno un nuovo amico {{summoner:31}} \n\nGrazie mille per tutto :D","replies":[]}]},{"poster":"kirchhoff","date":"2015-05-24T20:46:08.963+0000","up_votes":1,"down_votes":0,"body":"{{champion:412}}","replies":[]}]}