{"poster":"Juanopilucool","date":"2015-02-22T19:48:02.222+0000","title":"Sali del elo hell","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Muchos dicen que hay elo hell en bronza 5 (sali de bronze 5) y yo como si nada gane 11 seguidas SEGUIDAS y estoy en promo para bronze 3 .... no existe el elo hell","replies":[{"poster":"Hordak","date":"2015-02-22T20:46:38.462+0000","up_votes":2,"down_votes":1,"body":"elo hell es todo bronze y plata","replies":[{"poster":"RNGesus","date":"2015-02-22T21:36:15.981+0000","up_votes":1,"down_votes":0,"body":"oro tambien","replies":[]}]},{"poster":"Hwaxinghz","date":"2015-02-23T14:11:47.120+0000","up_votes":1,"down_votes":0,"body":"nada es peor que plata 3, subir de bronce 3 a plata 3 es rápido, en menos de una semana lo haces seguro, en plata 3 demoré 1 semana mas o menos hasta plata 2 y te aseguro que es difícil porque te toca cada \"bronce carreado\", cada \"plata con suerte\" con 2 wins PUM plata 3 o hasta con 1 win plata 3, cuando llegué a plata 2 ya la cosa cambia, me tocaba gente un poco menos manca pero seguían los carreados, en Oro creo que fue la salvación ya que los \"plata con suerte\" no llegan a oro, por ende no te tocarán tantos mancos pero te pueden tocar Unrankeds jugando las 10 primeras con 30-40 wins normal, me ha tocado un unranked con 12 wins normal, sin runas ni maestrías en la promo para Oro, así que imagínate, encima no sabia farmear y tal. gg easi para los enemigos cuando pasa eso","replies":[]},{"poster":"Galathria","date":"2015-02-22T20:26:58.693+0000","up_votes":1,"down_votes":2,"body":"Yo salí de bronce 5 en el NA y después en el LAS y llegué a Oro I, y déjame decirte que cuanto llegues allí, no dirás lo mismo...\nTodo bronce es el \"Elo Hell\" e incluso Plata V, IV y III. A partir de Plata II se comienzan a ver jugadas más aceptables.","replies":[{"poster":"XstifferX","date":"2015-02-23T03:51:20.774+0000","up_votes":1,"down_votes":0,"body":"Un fidle top en silver I no creo que a todos se les note la salida del elo hell.","replies":[]}]},{"poster":"Innolis","date":"2015-02-22T23:41:23.972+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Juanopilucool,realm=LAS,application-id=v7qsfXsE,discussion-id=38IaMb5e,comment-id=,timestamp=2015-02-22T19:48:02.222+0000)\n>\n> Muchos dicen que hay elo hell en bronza 5 (sali de bronze 5) y yo como si nada gane 11 seguidas SEGUIDAS y estoy en promo para bronze 3 .... no existe el elo hell\n\nVas a encontrar retrasados en bronce, silver, gold, platinum, diamond etc. No es que no exista el elo hell, es que todo el juego es basicamente el elo hell...","replies":[{"poster":"XstifferX","date":"2015-02-23T03:49:40.836+0000","up_votes":1,"down_votes":0,"body":"En mi experiencia de bronce 5 admire a nasus con statick.","replies":[]}]},{"poster":"xBlackOut","date":"2015-02-23T00:26:42.429+0000","up_votes":1,"down_votes":0,"body":"Retrasados hay en todos lados, hoy estuve jugando de 8am a 12am, esas 4 horas...primer partida, una janna que insultaba a la jinx por no tradear cuando le daba la E. La jinx se enojo y se fue afk...perdi, despues de eso, juego otra...una riven top contra una nidalee, pierde la riven, va 3.7 y dice \"adios mis amores\" y se va afk tmb, la que viene despues de esa, me toca una ahri en contra que se fue afk, gane...despues de esa, un tipo que va 0-10 winrate con vayne y me toca a mi, obviamente la sigue usando y la usa muy mal, perdimos porq ue feedeo...y la ultima que juge, ya resignadisimo, juge amumu, la gane y me fui a la mierda...al menos me fui con un win, pero perdi 3 partidas que no merecia perder.","replies":[]},{"poster":"Matrek","date":"2015-02-22T22:41:06.056+0000","up_votes":1,"down_votes":0,"body":"Oro es el EloHell tremendo.","replies":[]}]}