{"poster":"MGR Niron","date":"2015-10-26T10:48:31.350+0000","title":"Supporter sucht ein Ranked Team! :) {Vorsicht vor viel text haha. :D]","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Einen wundersch&ouml;nen guten Morgen, liebe Lol-Community!\r\nWie im Titel schon steht, bin ich ein Supporter, der auf der Suche nach einem Team ist.\r\n\r\nAls erstes gebe ich nat&uuml;rlich erstmal ein paar Daten zu mir auf:\r\n- Alter: 23\r\n- Elo: Gold IV\r\n- Ts3 &amp; Skype vorhanden (dementsprechend dann wohl auch ein Headset :)  )\r\n- Spiele erst seit ende Season 4\r\n- Ich bringe sehr viel Geduld mit\r\n- Da ich Student bin, habe ich dementsprechend auch relativ viel Zeit. (H&ouml;h&ouml; :)  )\r\n- Habe auch schon in Team mit Freunden gespielt, suche aber jetzt mal etwas neues.\r\n- Habe Erfahrung gegen erfahrene Spieler, da ich durch meinen Bruder angelernt wurde (seine Elo ist Dia 4).\r\n[Soll hei&szlig;en, dass ich schon oft gegen Spieler gespielt habe, die deutlich &uuml;ber mir waren ^^]\r\n- Ich besitze so ziemlich jeden Supporter.\r\n- Spiele am liebsten: {{champion:412}} {{champion:12}} {{champion:111}} {{champion:40}} {{champion:89}}  (Tank Supporter)\r\n- Mein Spielstil ist eher passiv &amp; safe play\r\n\r\nIch denke das war es erstmal so im groben von mir, werde gleich noch etwas mehr etwas &uuml;ber mich erz&auml;hlen, aber vorerst verlange ich dann auch was von dem Team. ^^\r\nUnd zwar, dass Team sollte:\r\n- Das wichtigste finde ich ist; kein Flame, Blame, Toxic, Salty, etc.\r\n- Geduldig sein\r\n- Eher gleichgesinnt sein, was die Erfahrung angeht\r\n- Spa&szlig; haben!\r\n- nicht gaaaaaaaaaaaaaanz so jung sein. (mind. 16 ^^)\r\n\r\n_________________________________________________________________\r\n\r\nSo das w&auml;ren dann erstmal die groben Daten, nun m&ouml;chte ich nochmal auf ein paar Punkte eingehen.\r\nUnd zwar, was mir wichtig ist.:\r\n\r\nMir ist bewusst, dass die Season bald aufh&ouml;rt, dennoch m&ouml;chte ich noch gerne Team-Erfahrung sammeln und neue Leute kennenlernen, mit dennen man gut Spielen kann. Mein Ziel ist es auch nicht unbedingt in dieser Season noch gro&szlig;artig etwas zu erreichen, sondern eher wirklich gleichgesinnte Leute zu finden, um dann evtl. in der n&auml;. Season gut durchzustarten. (Bitte nicht falsch verstehen, mit dem erreichen. :D )\r\nDeswegen ist mir der Punkt mit der Erfahrung auch sehr wichtig. Ich muss ehrlicherweise sogar gestehen, dass ich nicht wirklich Lust habe auf Leute, die alles besserwissen, weil sie mehr Erfahrung haben, oder das Game schon l&auml;nger spielen.\r\nAm liebsten w&auml;re es mir wirklich, wenn sich ein Team melden w&uuml;rde, wo die Spieler auch erst seit max. Season 4 spielen. :)\r\nWie gesagt: mir geht es nicht gro&szlig;artig darum jetzt noch gro&szlig;artig etwas zu erreichen, sonder mehr darum, Erfahrungen zu sammeln, und sich somit weiter zu entwickeln.\r\n\r\nEin weiterer ganz wichtiger Punkt, den ich sehr ernst nehmen w&uuml;rde, w&auml;re der Spa&szlig;. Ich suche ein Team, dass auch wenn es vielleicht etwas schlechter ist, trotzdem zu mir passt. Ich hoffe ihr versteht, was ich damit sagen m&ouml;chte. :D \r\nDer Charakter von den Spielern muss passen, sonst macht es mir auch keinen Spa&szlig;. (Also nicht die Devise: &quot;Ach wir spielen nur mit dem, weil der gut ist&quot; etc.)\r\n\r\nIch denke zu &quot;Geduld&quot; muss ich nicht viel sagen. Ich trete in eine neue Gemeinschaft, und nat&uuml;rlich wird etwas Eingew&ouml;hnungszeit ben&ouml;tigt, und es wird  vlt anfangs nicht alles klappen, ich erwarte den n&ouml;tigen Respekt davor. :)\r\nIch bin dem aber zuversichtlich und wei&szlig;, dass man das trainieren kann, um eingespielt zu werden.\r\n\r\n__________________________________________________________\r\n\r\nUm zum Abschluss zu kommen:\r\n\r\nAlles in allem suche ich ein Ranked Team, welches vielleicht sogar langfristiger geplant ist, und sich nicht nach 2 Wochen oder so aufl&ouml;sen m&ouml;chte.\r\nEs soll/muss Spa&szlig; machen in diesem Team zu spielen, dass ist mir am unteranderem am wichtigsten.\r\nMir w&auml;re es lieber, ich w&uuml;rde euch dann aufnehmen, also bei Interesse einfach Ingame name schreiben, bzw. auch noch etwas &uuml;ber euch, danke! ^^\r\n\r\nSollten noch Fragen aufkommen, einfach hier fragen. :)\r\n\r\nIn diesem Sinne:\r\nViel Spa&szlig; &amp; Viel Erfolg! :)","replies":[{"poster":"Pyrun","date":"2015-10-28T21:33:22.850+0000","up_votes":1,"down_votes":0,"body":"Kannst du mich bitte adden? Ich will gern mit dir reden :) inamge: pyrun","replies":[]},{"poster":"SkriLlexX 21","date":"2015-10-26T12:17:04.195+0000","up_votes":0,"down_votes":0,"body":"Uch würde auch gerne einem neuen ranked team joinen ich würde allen deinen vorschriften entsprechen. Bin main adc btw vielleicht können wir mal win paar testspiele machen 😊👌","replies":[]}]}