{"poster":"TeemoXNidalee","date":"2016-05-18T22:28:44.684+0000","title":"\"True damage offers pretty clear feedback: the damage you see is the damage you get...","subforum":"Gameplay","up_votes":26,"down_votes":3,"body":"...no decreases or increases. Mountain Drake was violating that expectation (especially around smite fights), so we’re bringing it in line with the rest of the game.\"\n\n\nTurrets\nTurrets now take less true damage when the backdoor bonus is in effect.\n\nTurrets have always had a pretty massive defensive boost to discourage raw backdoor attempts, but with the increased prevalence of True Damage in the game (Mountain Drake, Red Buff) we&rsquo;re adjusting to keep it in line.\nREALLY REINFORCED ARMOR Now additionally absorbs 66% of true damage when the backdoor bonus is in effect\n\nlol","replies":[{"poster":"Meddler","date":"2016-05-19T22:51:54.418+0000","up_votes":13,"down_votes":1,"body":"Yep, that's not a great approach and we do want to maintain clarity around how  true damage functions. We threw that change in as a temporary band aid though to address some abuse cases with some champs backdooring really effectively without minions late game via true damage. Wasn't happening too often, given the need to get some Earth Drakes for it to be really effective, lacked sufficient ways to respond to it when it did though.\n\nFor an upcoming patch (possibly 6.11, not sure yet) we're investigating ways to address that issue without violating the rule that nothing makes true damage deal more or less damage, though things may absorb it (e.g. Janna shield) or be immune to it (e.g. Kayle ult). Best argument so far is to simply have the backdoor bonus on turrets make them immune to true damage entirely, though that's not a guaranteed approach yet.","replies":[{"poster":"Jesus is Savior","date":"2016-05-20T01:42:30.648+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=oTY3wiGl,comment-id=0009,timestamp=2016-05-19T22:51:54.418+0000)\n>\n> Yep, that&#x27;s not a great approach and we do want to maintain clarity around how  true damage functions. We threw that change in as a temporary band aid though to address some abuse cases with some champs backdooring really effectively without minions late game via true damage. Wasn&#x27;t happening too often, given the need to get some Earth Drakes for it to be really effective, lacked sufficient ways to respond to it when it did though.\n> \n> For an upcoming patch (possibly 6.11, not sure yet) we&#x27;re investigating ways to address that issue without violating the rule that nothing makes true damage deal more or less damage, though things may absorb it (e.g. Janna shield) or be immune to it (e.g. Kayle ult). Best argument so far is to simply have the backdoor bonus on turrets make them immune to true damage entirely, though that&#x27;s not a guaranteed approach yet.\n\nEasiest solution: remove \"true damage\" from red buff and mountain dragon (against turrets only) and rework them to do bonus physical or magical damage based on your higher stat (AD or AP), and buff the numbers a bit so they do the same damage that they did when it was true damage. It would be similar to the old dragon that did magic damage instead of true damage to turrets. The only reason you'd need to code it to do physical OR magical (based on your stats) would be because penetration against turrets is a thing now.\n\n.....Or just leave it alone, and let \"true damage\" be reduced against turrets with the backdoor bonus in effect. From a \"clarity\" standpoint it's fine, really. We're lucky we can even do true damage AT ALL to turrets. It never used to be a thing. Before Krugz existed, it wasn't a thing at all. Ever. If the \"clarity\" of it is really bothering you, then add a tooltip to the turrets when you highlight them with no minions around. If a tooltip isn't enough (since most experienced players disable \"new player tooltips\"), then add an actual text that appears above the turret (similar to how text appears when minions get killed and give you gold, or how text appears when you do damage to things, etc), and make it say in BIG BRIGHT RED LETTERS each time you autoattack the turret: **_\"BACKDOOR BONUS IN EFFECT: ALL DAMAGE REDUCED, INCLUDING TRUE DAMAGE\"_**","replies":[]},{"poster":"Critkeeper","date":"2016-05-20T01:20:25.920+0000","up_votes":2,"down_votes":0,"body":"How about just giving turrets a 500 point shield when no minions are nearby that refreshes on taking damage.\n\nIf what you wanted to do was making it difficult rather than plain impossible to take a tower with no minions nearby, reduce the shield from 500 to 100.\n\nHonestly, turrets shouldn't even have backdoor armor or backdoor damage reduction in the first place because it specifically diminishes non-true damage, and clearly that isn't what you want.\n\nIf you change it all to a shield, and then find that magic and physical damage dealers cannot back door at all, but you want them to be able to, then have the turret's backdoor-shield's maximum health permanently diminish by 5% of the physical and magic damage it blocks every time it blocks damage.\n\nThis rewards repetitive and unrelenting backdooring against a single turret, which is fair because it is gives the enemy team plenty of time to react. It amortizes the value of having true damage to be appoximately the same as not having true damage, since most of the time spent backdooring is spent making multiple trips against the tower to whittle the shield's blocking power, which doesn't care about your true damage.","replies":[]},{"poster":"The Yetii Rider","date":"2016-05-20T03:49:56.869+0000","up_votes":1,"down_votes":0,"body":"How about a buff that exists only while the Backdoor Buff is active. \"This structure rapidly heals all true damage dealt to it\".\n\nThen it gets gray health from true damage which heals at 20% per second. You can still knock the turret down, but if someone comes to stop you they get rewarded.","replies":[]},{"poster":"Nebuul","date":"2016-05-20T00:45:58.833+0000","up_votes":1,"down_votes":0,"body":"How about this backdoor bonus:\n\nWhen protected by bonus fortification, towers become supercharged by true damage, increasing their damage by 1% for 10 seconds for each point of true damage they take.","replies":[]},{"poster":"JJI744","date":"2016-05-20T00:13:24.948+0000","up_votes":1,"down_votes":0,"body":"So long as your looking into stuff like that, I think Skuttle is still taking increased true damage when stunned.\n\nEDIT: At least from Irelia W, IDK about smite.","replies":[]},{"poster":"Thryale","date":"2016-05-20T00:07:34.116+0000","up_votes":1,"down_votes":0,"body":"if you wanna stay consistent, throw on a rapidly regenerating \"true dmg\" barrier on it that absorbs a portion of the true dmg dealt to the turret.\n\nI mean, we already have a \"Magic dmg\" shield, why not a true dmg one?","replies":[]},{"poster":"thumbnail9","date":"2016-05-19T23:31:09.503+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=oTY3wiGl,comment-id=0009,timestamp=2016-05-19T22:51:54.418+0000)\n>\n> Yep, that&#x27;s not a great approach and we do want to maintain clarity around how  true damage functions. We threw that change in as a temporary band aid though to address some abuse cases with some champs backdooring really effectively without minions late game via true damage. Wasn&#x27;t happening too often, given the need to get some Earth Drakes for it to be really effective, lacked sufficient ways to respond to it when it did though.\n> \n> For an upcoming patch (possibly 6.11, not sure yet) we&#x27;re investigating ways to address that issue without violating the rule that nothing makes true damage deal more or less damage, though things may absorb it (e.g. Janna shield) or be immune to it (e.g. Kayle ult). Best argument so far is to simply have the backdoor bonus on turrets make them immune to true damage entirely, though that&#x27;s not a guaranteed approach yet.\n\nHow bout it just does a pre determined flat amount to the turret? That way you just times it by 66% and be like yo you do this amount to turret.","replies":[{"poster":"DorkunedAuras","date":"2016-05-19T23:43:49.305+0000","up_votes":1,"down_votes":0,"body":"{{champion:96}}","replies":[]}]},{"poster":"darkdill","date":"2016-05-19T23:42:06.177+0000","up_votes":1,"down_votes":0,"body":"Will such a change take Ziggs' Satchel Charge into account?","replies":[]},{"poster":"Photos of Ghosts","date":"2016-05-19T23:15:58.803+0000","up_votes":1,"down_votes":0,"body":"How about a partial block system? Like Ninja Tabi. It'd equal a shield.","replies":[]},{"poster":"Electric Buyers","date":"2016-05-20T04:29:20.935+0000","up_votes":1,"down_votes":1,"body":"TALK ABOUT SOLO QUEUE!!!","replies":[]}]},{"poster":"Old Man Teeto","date":"2016-05-19T01:52:09.131+0000","up_votes":2,"down_votes":0,"body":"How many true-damage sources affected turrets in the first place?  Pure question here.","replies":[{"poster":"The Yetii Rider","date":"2016-05-19T02:48:05.887+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Old Man Teeto,realm=NA,application-id=3ErqAdtq,discussion-id=oTY3wiGl,comment-id=0003,timestamp=2016-05-19T01:52:09.131+0000)\n>\n> How many true-damage sources affected turrets in the first place?  Pure question here.\n\nMountain Drake (10/20/30% of your auto attack damage is dealt as additional true damage). \n\nRed Buff (Burns towers)\n\nBlue Elixir (25 true damage on-hit, no cooldown against towers)","replies":[{"poster":"TeemoXNidalee","date":"2016-05-19T22:35:17.880+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Yetii Rider,realm=NA,application-id=3ErqAdtq,discussion-id=oTY3wiGl,comment-id=00030000,timestamp=2016-05-19T02:48:05.887+0000)\n>\n> Mountain Drake (10/20/30% of your auto attack damage is dealt as additional true damage). \n> \n> Red Buff (Burns towers)\n> \n> Blue Elixir (25 true damage on-hit, no cooldown against towers)\n\nThe golen smite gives a true damage burst when hitting a turret idk if they removed that","replies":[{"poster":"DorkunedAuras","date":"2016-05-19T23:45:46.880+0000","up_votes":1,"down_votes":0,"body":"nope, still there","replies":[]}]},{"poster":"Spoofghoul","date":"2016-05-19T10:21:19.154+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Yetii Rider,realm=NA,application-id=3ErqAdtq,discussion-id=oTY3wiGl,comment-id=00030000,timestamp=2016-05-19T02:48:05.887+0000)\n>\n> Mountain Drake (10/20/30% of your auto attack damage is dealt as additional true damage). \n> \n> Red Buff (Burns towers)\n> \n> Blue Elixir (25 true damage on-hit, no cooldown against towers)\n\nyea that blue elixer is pretty disgusting on anyone with super high attackspeed i kid you not. You will wreck towers so hard lol","replies":[{"poster":"Crossette","date":"2016-05-19T23:17:22.387+0000","up_votes":1,"down_votes":0,"body":"which is why you take it on Koggy\n\nespecially in URF where you hit 2.5 AS in like two or three items","replies":[]}]}]}]},{"poster":"RespectPlus","date":"2016-05-18T23:32:53.441+0000","up_votes":1,"down_votes":6,"body":"True dmg only ignores mr and armor \nAny shield or dmg mitigation item/spell/whatever can reduce true dmg","replies":[{"poster":"Jungle Lux God","date":"2016-05-19T01:11:56.817+0000","up_votes":6,"down_votes":1,"body":"Actually it doesn't. Nothing reduces true damage (except reinfoced armor on the turrets now).","replies":[{"poster":"RespectPlus","date":"2016-05-19T10:00:26.598+0000","up_votes":1,"down_votes":6,"body":"Pick Riven against Darius and use E on his ult","replies":[{"poster":"Abyssphere","date":"2016-05-19T10:21:56.380+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=RespectPlus,realm=NA,application-id=3ErqAdtq,discussion-id=oTY3wiGl,comment-id=000200000000,timestamp=2016-05-19T10:00:26.598+0000)\n>\n> Pick Riven against Darius and use E on his ult\n\nThe shield didn't reduce the damage he did, it just absorbed it. She still took 1k damage or whatever, just the shield boosting her HP temporarily meant it didn't take as much out of her real health bar as it would have.\n\nNow if you attacked an ulting Alistar with Darius then you would do all the damage you were supposed to do.","replies":[{"poster":"RespectPlus","date":"2016-05-19T11:55:31.430+0000","up_votes":1,"down_votes":5,"body":"That's probably because... \n\n> Removes disables from Alistar, and Alistar gains 60/75/90 Attack Damage and takes 70% reduced **physical and magic damage** for 7 seconds.","replies":[{"poster":"Abyssphere","date":"2016-05-19T15:38:44.848+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=RespectPlus,realm=NA,application-id=3ErqAdtq,discussion-id=oTY3wiGl,comment-id=00020000000000000000,timestamp=2016-05-19T11:55:31.430+0000)\n>\n> That&#x27;s probably because...\n\nThey put that there specifically because people like you would think that it reduced true damage otherwise. There is no need for the \"physical and magic\" part to be there, it's present in that description just for the sake of people who don't understand what true damage means.\n\nThe new tower mechanic is the first time Riot have ever purposefully added a true damage modifier to the game. It is the only thing in the game that can reduce true damage dealt.","replies":[]},{"poster":"Photos of Ghosts","date":"2016-05-19T23:17:17.344+0000","up_votes":1,"down_votes":0,"body":"That's probably because you didn't read  :3","replies":[]}]}]},{"poster":"Jungle Lux God","date":"2016-05-19T16:13:40.367+0000","up_votes":2,"down_votes":0,"body":"What do absorption shields have to do with damage reduction?\n\nThey don't reduce true damage at all, nor are they intended to. They just absorb the damage that the true damage did.","replies":[]}]}]}]},{"poster":"TeemoXNidalee","date":"2016-05-19T22:38:32.553+0000","up_votes":3,"down_votes":0,"body":"The fun thing is they've put both things in the same patch, first they say that nothing should modify true damage dealt, then just below there is a new mechanic saying that turrets now decrease true damage.","replies":[]},{"poster":"The Deckowner","date":"2016-05-19T02:00:24.905+0000","up_votes":3,"down_votes":0,"body":"As if backdoorers need true dmg to kill towers","replies":[]},{"poster":"Vistha Kai","date":"2016-05-19T22:50:32.940+0000","up_votes":2,"down_votes":1,"body":"When I read patch notes and stumbled across that part.\n\nAt first:\nhttp://i1.kym-cdn.com/photos/images/newsfeed/000/849/418/b27.gif?noredirect\n\nThen:\nhttps://media.giphy.com/media/qL2kQFdyzApRS/giphy.gif?noredirect\n\nFollowed by:\nhttp://i.makeagif.com/media/10-28-2013/tpy8GR.gif?noredirect\n\nAnd then:\nhttp://i.perezhilton.com/wp-content/uploads/2013/12/daily-show-bull-fucking-shit-edit.gif?noredirect\n\nAnd when I downvoted the Patch Notes thread:\nhttps://66.media.tumblr.com/d6088df567b5268e84ec9685322fd687/tumblr_nisch0aR051t0ddt0o1_500.gif?noredirect\n\nI never knew, somebody could be THAT full of shit.\nhttp://www.evilenglish.net/wp-content/uploads/2015/09/bullshit.jpg?noredirect","replies":[]},{"poster":"Yordlelayhehoo","date":"2016-05-18T22:40:57.288+0000","up_votes":2,"down_votes":1,"body":"Good.","replies":[]},{"poster":"Critmaster Garen","date":"2016-05-20T01:47:32.047+0000","up_votes":1,"down_votes":0,"body":"well apparantly the dragon buff did amplify smites damage, which is also true damage.\n\nso at least thats consistent now.\n\neven if its weird in case of the backdoor bonus actually reducing true damage, it is kindof necessary. otherwise red buff and earth drake would have negated too much of that effect.\n\nwe would have udyr 1v1ing turrtes again with red buff and earth drakes.","replies":[]},{"poster":"InstaPoppy","date":"2016-05-19T20:41:06.337+0000","up_votes":1,"down_votes":0,"body":"I wonder what killed me.\n\"Looks at death recap\"\nOh it was just 1000 True damage from garen ult. {{champion:32}}\nAtleast its clear what killed me.","replies":[]},{"poster":"Illâoi Evê Siôn","date":"2016-05-19T10:27:24.686+0000","up_votes":1,"down_votes":0,"body":"They should have just given them 25 more Armor or something.","replies":[]},{"poster":"The Magyk","date":"2016-05-18T22:35:47.928+0000","up_votes":1,"down_votes":0,"body":"not so true damage on backdoor protected towers.","replies":[]}]}