{"poster":"MeganSS","date":"2018-10-27T16:19:04.790+0000","title":"Was habe ich falsch gemacht","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":4,"body":"Ich verstehe es nicht, warum ich mit solchen Spielern spielen muss, die int feeden oder einfach extrem trollen.\r\nallein Heute schon\r\nAhri 0/12/2\r\nTristana 3/10/2\r\nDraven 0/10/5\r\nMf 0/14/8\r\n\r\nIch verlieren auch manchmal 10 game hintereinander.\r\nIch carry zwar nicht jedes Game. Aber warum int die so krass, ich verstehe es nicht warum und wieso \r\nVor allem, sie verlieren auch selber LP.\r\nIch verstehe es einfach nicht wieso.","replies":[{"poster":"Ηastur","date":"2018-10-28T16:13:19.799+0000","up_votes":1,"down_votes":3,"body":"Manche Leute, speziell in low Elo, haben halt einfach keine analytischen Fähigkeiten. Meint, ihnen fehlt die Fähigkeit zu reflektieren, was sie falsch gemacht haben und sie wiederholen denselben Fehler immer und immer wieder, ohne, dass ihnen bewusst ist, dass es falsch ist was sie tun.\nKurzum, sie inten. Nicht absichtlich, aber sie tun es, weil sie einfach nicht begreifen, wie man spielen muss, wenn man zurückfällt. Oder noch anders gesagt, manche Leute sind einfach dumm. Akzeptiere es und du hast weniger Stress. Das ist schade und ärgerlich und alles, aber es sind Menschen und somit ist es nicht zu ändern, bzw. zu erwarten.\n\nNatürlich gibt es auch solche, wie die von meinen Vorrednern erwähnten Trollen. In dem Fall trifft aber auch letztes zu. Sie sind dumm. Akzeptiere es und du lebst entspannter/gesünder. Gehe einfach nie davon aus, dass irgendwer dich carried und sei überrascht, wenn jemand nicht seine Lane verliert oder das Game throwed, wenn ihr ahead seid.","replies":[{"poster":"eingew","date":"2018-10-29T07:25:43.054+0000","up_votes":1,"down_votes":0,"body":"Man kann nicht unabsichtlich absichtlich feeden :P.","replies":[{"poster":"Angel Ayume","date":"2018-10-29T10:47:03.634+0000","up_votes":2,"down_votes":0,"body":"Ich finds echt doof, dass inten mittlerweile als Synonym für dumme oder unnötige Tode stehen...\n\nIn jedem Stream sagt der Streamer das der oder der oder gar er selbst intet, einfach nur, weils nen unnötiger oder dummer Tod war. Absichtlich war daran gar nichts, nur entweder schlecht gespielt oder nicht nachgedacht. \n\nDeswegen denken wahrsch auch so viele, das schlechtes spielen reportbar ist und bestraft gehört, weil sie \"inten\" ja... -.-","replies":[{"poster":"Qbert","date":"2018-10-29T14:40:34.248+0000","up_votes":2,"down_votes":0,"body":"> Ich finds echt doof, dass inten mittlerweile als Synonym für dumme oder unnötige Tode stehen...\n\nTja, streamern sei dank ... \n\nIch finde auch, Fehler passieren ... das ist aber weit weg von \"inten\" :S","replies":[{"poster":"Angel Ayume","date":"2018-10-29T14:47:58.972+0000","up_votes":2,"down_votes":0,"body":"Ja eben. Find das auch echt doof. Aber es ist mittlerweile so etabliert, das sich daran nichts mehr ändern wird. \nKacke finde ich es trotzdem ziemlich, und es nervt auch nen bisschen.","replies":[]}]},{"poster":"Bettnachleger","date":"2018-10-29T14:39:14.231+0000","up_votes":2,"down_votes":0,"body":"> Ich finds echt doof, dass inten mittlerweile als Synonym für dumme oder unnötige Tode stehen...\n\nDas geht mir irgendwie auch auf den Sack. \nInten hier, inten da usw. Das Wort wird einfach viel zu inflationaer genutzt -.-","replies":[{"poster":"Qbert","date":"2018-10-29T14:41:12.276+0000","up_votes":2,"down_votes":1,"body":"Du Inter solltest mal aufhören zu hier rumzuinten, denn sonst inte ich mal kurz und dann wirst du inten wie man intet!","replies":[{"poster":"Abasin","date":"2018-10-30T11:47:56.404+0000","up_votes":1,"down_votes":0,"body":"Schlumpfig. {{sticker:sg-kiko}}","replies":[]}]}]}]}]},{"poster":"LegendaryXenon","date":"2018-10-29T08:41:50.610+0000","up_votes":1,"down_votes":0,"body":"Du hast damit zwar Recht, aber es reicht einen dummen Fehler bei dem aktuellen Snowball zu machen. Wenn Du dann 1/3 oder so stehst, musst Du schon wirklich wissen was Du tust, um zurückzukommen.","replies":[]},{"poster":"Abasin","date":"2018-10-29T12:35:46.385+0000","up_votes":3,"down_votes":1,"body":"> Kurzum, sie inten.\n\nDu hast die Bedeutung des Wortes nicht verstanden. Inten = intentional feeden, also sich absichtlich töten lassen und den Gegner feeden. **Unabsichtlich inten** ist ein Widerspruch in sich. Man sollte nicht das Gesülze der ganzen LoL-Tuber zu dem Thema 1:1 übernehmen, die verbreiten in der Hinsicht oft gefährliches Halbwissen.","replies":[{"poster":"Ηastur","date":"2018-10-30T11:28:19.181+0000","up_votes":1,"down_votes":2,"body":"Komm, wie viele Erbsen?\nJeder weiß was gemeint ist, wenn ich inten schreibe. Natürlich ist die Wortbedeutung eigentlich eine andere, aber das zählt für so vieles im allgemeinen Sprachgebrach. Machst du da auch jedes mal den Besserwisser? Wie etwas gedacht ist und wie etwas gebraucht wird, sind unterschiedliche Dinge. Ich lebe in einer Welt wo ich rede wies mir passt und ich mir nicht von irgendwelchen Leuten, die im Alltag so tun als wär ne wissenschaftliche Analyse notwendig, sagen lasse wie ich das wort inten zu gebrauchen hab.\nNenns meinetwegen feeden, aber daran rollen sich die sicher auch die Fußnägel hoch...\n\n\nKarens über Karens.. Ich wünschte, es würde sich nicht jeder wegen allem ständig angegriffen fühlen. Das und genau DAS verhalten, was hier grade stattfindet ist grund für dieses bescheuerte Sozialverhalten was alle verachten aber mitlerweile wohl normal geworden ist. Leute wie ihr habt Apu umgebracht, weil er nicht \"PC\" war. Leute wie ihr redet am eigentlichen Problem vorbei und greift willkürlich komplett aus dem Zusammenhang gerissene Dinge an, weil ihr sie für nicht okay haltet. KÖNNT IHR, aber fühlt euch verdammt noch mal nicht von allem Scheiß laufend angegriffen!\n\nUnd am wichtigste: Bleibt verdammt nochmal beim Thema und lasst Leute in Frieden nur weil sie anders reden als ihr!\nIhr Leutchen, die ihr euch über das Wort Inten echauffiert, habt nicht einmal den Inhalt meines Beitrages erfasst, weil ihr sofort rot seht und euch darauf stürzt wie die Ratten, wenn euch ein einzelnes Wort gegen den Strich fährt. Das is ne Schande, was heutzutage passiert.\n\nDas gillt btw für alle die hier über den Begriff \"inten\" rumheulen.","replies":[{"poster":"Abasin","date":"2018-10-30T11:47:04.893+0000","up_votes":1,"down_votes":0,"body":"Hat sich was mit Erbsen. Wer Worte falsch benutzt, muss damit rechnen, nicht verstanden zu werden. \n\n> Jeder weiß was gemeint ist, wenn ich inten schreibe.\n\nGenau das bezweifle ich stark. Und wenn ich weiss wie es richtig sein sollte, mache ich es nicht - \"weil jeder es so macht\" - absichtlich falsch. Ansonsten: garbage in --> garbage out\n\nÜbrigens, um den Berg von Korinthen wegzuräumen, den ich mittlerweile produziert haben müsste, wäre es einfacher den Mount Everest einzuebnen. Auf Meereshöhe. {{sticker:slayer-jinx-wink}}","replies":[]}]}]}]},{"poster":"Inting Since 2K9","date":"2018-10-30T11:30:15.991+0000","up_votes":1,"down_votes":0,"body":"mMn spielst die falschen Champs. Du hast gute, teils sehr gut Stats auf den Support Champs. Durchweg gute Picks aber am Ende abhängig vom Team. Ich liebe BC aber musste feststellen, daß in unserer Elo klassische Supports fehl am Platz sind. \n\nBeispiel: Dein ADC ist richtig schlecht. Rennt in jeden Skillshot, stirbt immer wieder und am Ende flammt er dich dafür in der Regel.   Nun stehst du da mit Leona oder BC den Großteil der Zeit solo am Tower und versuchst verzweifelt die Minion Wave zu töten. Am besten gegen ADC + Range Support die dich Zonen oder in die Base poken. Tower weg! \n\nEs gibt Picks die dich halt abhängig machen weil sie 0 Waveclear oder nicht den Schaden für einen Solokill haben. \n\nIch spiele lieber AP Supporter. Kann man sich zur Not selbst helfen. Und mit gutem ADC gewinnt man die Lane meist genauso wie    es mit einem Tank geklappt hätte. Oder halt Pyke als Alternative zum AP Support wenn er ins Matchup passt. \n\nNatürlich heißt das nicht immer das es der bessere Pick ist.  Gegen Soraka, Sona, Nami zb Spiel ich auch Leona mit Ignite. \n\nKlingt blöd aber echte Supports sind halt in Bronze, Silber, ... ungeeignet. Du bist abhängig von teammates und wenn die ein Totalausfall sind, bist du nutzlos.","replies":[]},{"poster":"Nordwolf87","date":"2018-10-28T20:50:04.811+0000","up_votes":1,"down_votes":0,"body":"Ist mMn sehr einfach. Das spiel snowballed momentan brutal. Bist du mal 0/2 hinten dauerts nicht lange bis du 0/5 stehst (selbst wenn du versuchst so \"sicher\" wie möglich zu spielen). Dann kommen Teamfights und 2v2/3v3 Geplänkel in denen du mit nem halben Item oder ersten kompletten einfach nur jedes mal weggeflext wirst oder im Jgl in einen Gegner reinrennst und du stehst am Ende 0/12/X.\n\nDas geht sehr schnell und es ist extrem schwer alleine wieder aufzuholen. Das ist momentan einer meiner größten Kritikpunkte an dem Spiel.\n\nUnd man sieht es auch jetzt bei den Worlds. In min 20 hat man ein 1.5 bis 2k Defizit, ist jetzt kein Drama. Aber bis min 30 snowballeds dann sehr schnell auf 6 bis 10k und das Game ist mehr oder minder vorbei.\nUnd das sind wirklich gute Spieler die selten unnötige Kills abgeben oder blind ins verderben rennen.","replies":[]},{"poster":"Alustus","date":"2018-10-27T16:29:19.948+0000","up_votes":1,"down_votes":0,"body":"Nicht immer hat man etwas falsch gemacht wenn man verliert.\nWenn das ganze Team verliert dann sehen sie stats gerne mal so schlecht aus weil die Spieler tilten und die gegner gut snowballen können.","replies":[]},{"poster":"Bronze7Main","date":"2018-10-27T20:43:01.857+0000","up_votes":1,"down_votes":6,"body":"Nennt sich Season-End.   Ranked ist so schon schlimm genug aber am Ende der Season gibts viele die extra acc´s dafür haben um low elo leute zu ärgern lawl.\n\n\nKann auch sein das die einfach n schlechten Tag haben und nicht mal gewollt verlieren sondern einfach zu viele Fehler gemacht haben. Lustigerweise wird der 10:2 Spieler dann oft fürs Inten reported lawl.\n\nNoch dazu ist bei einigen der Druck jetzt hoch um eine gewisse Elo zu erreichen dadurch werden Fehler noch stärker.\n\nFinds dann nur lustig das man solche Teams dann teilweise noch carrien soll was vermutlich selbst für prospieler schwierig wird außer vllt für mid ...","replies":[{"poster":"eingew","date":"2018-10-29T07:28:04.722+0000","up_votes":1,"down_votes":0,"body":"Für die Gegner geht die Season doch ganz genauso vorbei. Klar kann man nicht jedes Spiel gewinnen, aber die Anzahl der Spiele, die man nicht gewinnen kann, hängt nicht vom  Zeitpunkt in der Season ab, sondern von der Elo, auf der man sich befindet und wie sicher man auf dieser spielt.","replies":[]}]}]}