{"poster":"bynico11","date":"2019-04-20T22:58:28.697+0000","title":"Mouse que no raciona, ruidos tipos codigo morse  y varias cosas mas...","subforum":"Problemas Técnicos","up_votes":6,"down_votes":0,"body":"El tema es lo siguiente hace un par de meses estube con varios problemas tecnicos como:\r\n-se me desactualiza el lol.\r\n-me tira error y me saca del cliente y me lo desactualiza.\r\nY en este ultimo mes, no se que paso pero no me deja entrar a bot ni a ningun otro modo solo normal y ranked.\r\nHay a veces que ni me entra a la partida y me tira problema de conexion cuando mi internet esta bien.\r\nY en la ultima partida me paso algo que no se muy bien como explicar, me empezo a no racionar bien mis movimientos y hacer ruidos tipos codigo morse y me decia que la conexion e fps estaban bien.\r\nBusque por foros y por varios lugares pero no encontre nada si alguien sabe algo sobre esto que comente se lo agradeceria mucho.\r\nGracias por leer.","replies":[{"poster":"EOOOO","date":"2019-05-03T16:19:58.458+0000","up_votes":1,"down_votes":0,"body":"a mi me pasa exactamente eso de los ruidos tipo código morse y no me responde bien el mouse ni el teclado, pero aun no se como solucionarlo, si pudiste solucionarlo por favor avisa como","replies":[]},{"poster":"lordeman10","date":"2019-04-21T02:37:08.466+0000","up_votes":1,"down_votes":0,"body":"Usas avast? yo tenia el problema del mouse, no daba los clicks, lo borre y nunca más\n\na veces el remedio es peor que la enfermedad","replies":[{"poster":"Warsong","date":"2019-04-23T01:07:58.245+0000","up_votes":1,"down_votes":0,"body":"Yo no tengo Avast y me pasa. Es un problema del juego. Cada actualización es lo mismo para mi. Ya son tres o cuatro parches que la vengo sufriendo. Y es esperar la gana de Riot.","replies":[]}]},{"poster":"Del0reaN","date":"2019-04-21T01:58:01.088+0000","up_votes":1,"down_votes":0,"body":"Una pregunta, por las dudas... a mi primo le pasó algo similar hace un tiempo atrás y resultó ser que el \"muy vivo\", abría el cliente varias veces antes que se termine de cargar. Es decir, le hacía doble clic al icono, pero como demoraba en abrir, le volvía a hacer doble clic y así unas dos o tres veces. Resulta ser que así dañaba el cliente y eso le causaba muchos problemas, entre ellos, que cada vez que quería entrar debía instalar una actualización de 1,5gb (seguramente la misma que te toca instalar a vos).\n\nNo es que el cliente \"se desactualiza\", sino que al haber un error te tira esa actualización de reparación. Personalmente, te aconsejaría lo mismo que MadQuestions: analiza el juego con la herramienta de reparación hextech, asegurate que tenga la opción de \"generar un reporte\" activada. No recuerdo cómo figura exactamente, pero eso te generará un archivo \".zip\" en el escritorio que se llama algo así como \"Registros LOL.zip\". Debes enviar un ticket al soporte adjuntando ese archivo. Ellos sabrán decirte bien qué puede estar causando tu problema.\n\nPosiblemente haya algún programa en tu PC con el que tengas conflictos y te esté rompiendo el cliente a cada rato. No sé, se me ocurre algo así como limpiadores del estilo \"Ccleaner\" o similares. Por eso, ellos te van a saber decir bien. ¡Ah! Ya te adelanto que vayas desactivando el IPv6 de tu placa de red, eso a veces hace que se rompan paquetes de actualizaciones y que se instalen de manera errónea. ;)\n\nUn abrazo! Éxitos, invocador. ;)","replies":[]},{"poster":"MadQuestions","date":"2019-04-21T00:08:39.480+0000","up_votes":1,"down_votes":0,"body":"prueba con el hextech rapair tool que ofrece riot y manda un ticket con los problemas que dices y la informacion del hextech","replies":[]}]}