{"poster":"Erkeeey","date":"2019-02-22T20:25:51.956+0000","title":"Entbannungsantrag - Riot games","subforum":"Spielerverhalten & Moderation","up_votes":0,"down_votes":8,"body":"Guten Abend\r\n\r\nLiebes Riot Team\r\n\r\nIch will mein Ban rechtfertigen mein permaban ist nicht \"gerechtfertigt\" ich bin ein sehr aktiver League of legends Spieler und hab sehr viel geld in dieses spiel gesteckt weil es mein lieblingsspiel ist ich versuche immer ruhig zubleiben . Leauge of legends ist das einzige game wo ich mein kopf abschalten konnte und alleine sein konnte nach der schule ich bitte sie riot games Entbannt mein account ich werde mir sehr viele sachen vornehmen\r\n\r\n- Den chat immer auszumachen \r\n\r\n- Meine Mitspieler immer versuchen zu motiveren weiter zuspielen\r\n\r\n- ich versuche alles\r\n\r\nAlso Liebes Riot Team Ich würde alles dafür tuen ich bitte sie alle jeder hat mal eine schlechte woche - tage also bitte ich weis nicht was ich jetzt machen soll ich mach alles dafür ich verzweilfe wirklich .... Ich bitte um verständnis ich werde mich ändern wirklich\r\n\r\nFreundlichen Grüßen \r\n\r\nErik","replies":[{"poster":"legofreak1","date":"2019-02-22T20:35:45.347+0000","up_votes":6,"down_votes":0,"body":"In der Zeit zwischen dem 27.01. und dem 10.02. hast du genau 14 Tage lang nicht gespielt, davor und danach täglich mehrere Spiele.\nhttps://matchhistory.euw.leagueoflegends.com/de/#match-history/EUW1/234423746\nIch vermute mal, dass du dort deinen 14 Tage Ban erhalten hast. In der Nachricht zum Ban wurde dir mitgeteilt, dass ab sofort jegliches Fehlverhalten zu einer permanenten Sperre deines Accounts führen kann. Anscheinend hast du danach weiterhin die Regeln gebrochen und Riot hat deinen Account entsprechend permanent gesperrt. Eine weitere Chance wird es für dich, wie für jeden anderen zuvor permanent gebannten Spieler auch, nicht geben. Lediglich Bans, bei denen Riot ein Fehler unterlaufen ist, werden wieder aufgehoben. Wenn du der Ansicht bist, dass dir dies passiert ist, poste bitte deinen Chatlog, ansonsten können wir im Forum uns kein Bild von deiner Situation machen.\nRiot erreichst du hier übrigens auch nicht, nur ganz gewöhnliche Spieler. Ein Ticket kannst du hier einreichen: https://support.riotgames.com/hc/de/requests/new","replies":[{"poster":"ToxicRedPanda","date":"2019-02-23T01:16:10.919+0000","up_votes":1,"down_votes":0,"body":"Da hat der Legobaumeister recht.","replies":[]}]},{"poster":"CuzImRussian","date":"2019-03-11T07:48:37.472+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Angel Ayume","date":"2019-03-11T08:05:49.508+0000","up_votes":1,"down_votes":0,"body":"Versuchst du echt jemanden hier zu kritisieren indem du ihn selbst beleidigst? Das macht dich keinen deut besser als den TE. \nIn meinen Augen gehörst du dann auch gebannt, so wie du hier auftrittst. \n\nUnd jemanden vorzuschlagen sich zu erhängen kommt dem \"kys\" schon ziemlich nahe. ^^ \nIch bitte also diesen Account permanent im Forum zu sperren. Danke.","replies":[{"poster":"CuzImRussian","date":"2019-03-11T09:08:30.602+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Novros","date":"2019-03-11T09:24:14.401+0000","up_votes":3,"down_votes":0,"body":"Du bist doch selber knapp Level 150, Silber 3 mit etwa 250 Spielen ... du sitzt ihm Glashaus und schmeißt mit Steinen, mein Freund.\nEventuell solltest du das Forum nicht mehr mit deiner Wenigkeit \"bereichern\".","replies":[]},{"poster":"Angel Ayume","date":"2019-03-11T09:22:23.024+0000","up_votes":1,"down_votes":0,"body":"Schön, wie du genau weißt, dass ich noch zur Schule gehe. xD \nUnd schön, wie du nach 39 Ranked Games beurteilen kannst, dass ich hardstuck bin :)","replies":[]}]},{"poster":"Raystlin82","date":"2019-03-11T08:36:59.826+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=ao0i5MyO,comment-id=00060000,timestamp=2019-03-11T08:05:49.508+0000)\n>\n> Ich bitte also diesen Account permanent im Forum zu sperren. Danke.\n\nalso ich hab seinen kommentar auch gemeldet. finde aber einen permanenten bann fuer uebertrieben, wenn er sich bisher nicht zu schulden kommen lassen hat. sogar riot bannt fuer \"kys\" nicht direkt permanent, sondern erst fuer 14 tage.\n\nedit:\nwie kommst du eigentlich auf diesen thread? der ist doch schon 17 tage alt. ich selbst kam ja nur her, weil jemand auf mein kommentar geantwortet hat und ich das angezeigt bekommen habe.","replies":[{"poster":"Angel Ayume","date":"2019-03-11T09:20:46.615+0000","up_votes":1,"down_votes":0,"body":"Ouh. Mir wird immer alles aktuelle angezeigt und da hier was geschrieben wurde, taucht das ganz oben in der Liste auf. ^^ Auf das Datum vom Thread hab ich dabei diesmal gar nicht geachtet. \n\nDu hast aber Recht, dass ein direkter Permabann vllt nen bissl zu hart ist.","replies":[]}]}]}]},{"poster":"Hundis Katze","date":"2019-02-24T16:21:35.378+0000","up_votes":3,"down_votes":0,"body":"Ich find es bemerkenswert wie die Einsicht mancher Flamer erst nach mehrere Zwischenbans kommt... Ist ja nicht so, dass man schon vorher solche Eingebungen bekommen könnte... Du hast nix begriffen, du weinst nur dem Geld hinterher, den du für Skins reingeschmissen hast, um deinen geringen Skill auszugleichen.","replies":[]},{"poster":"Raystlin82","date":"2019-02-24T15:56:31.563+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Erkeeey,realm=EUW,application-id=KYnfKGf0,discussion-id=ao0i5MyO,comment-id=,timestamp=2019-02-22T20:25:51.956+0000)\n>\n> ich bitte sie riot games Entbannt mein account ich werde mir sehr viele sachen vornehmen\n> \n> - Den chat immer auszumachen \n> \n> - Meine Mitspieler immer versuchen zu motiveren weiter zuspielen\n\ndu schaltest den chat aus und willst dabei deine mitspieler motivieren. die idee find ich klasse. wie sieht denn so eine motivierung aus? 20 mal auf den toten pingen, damit er so richtig motiviert ist nicht mehr zu sterben?","replies":[{"poster":"IIIrickIII","date":"2019-03-11T01:10:29.913+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Raystlin82","date":"2019-03-11T07:30:47.123+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IIIrickIII,realm=EUW,application-id=KYnfKGf0,discussion-id=ao0i5MyO,comment-id=00040001,timestamp=2019-03-11T01:10:29.913+0000)\n>Er meint sicher, dass er alle muted.\n>Aber selber im chat schreibt \"gj\" wenn seine mates was gutes gemacht haben\n\nden unterschied zwischen dem, was er geschrieben hat, und dem, was er damit wohl gemeint hat, fand ich eben lustig und deswegen hab ich auch mein kommentar dazu verfasst. das nennt man ironie, oder in diesem fall eher sarkasmus. aber es soll ja menschen geben, die fuer sarkasmus einfach unempfaenglich sind (aka sheldon aus der big bang theorie, oder murphy aus good doctor) - du bist nicht zufaellig einer davon?","replies":[{"poster":"Novros","date":"2019-03-11T07:35:43.736+0000","up_votes":1,"down_votes":0,"body":"als konstruktiv gemeinten Einwurf: die Ironie in deinem 1. Kommentar kann man aber auch (leicht) übersehen :) gerade im Forum werden viele solcher Kommentare gemacht, die sind dann aber auch reißerisch gemeint ...","replies":[{"poster":"Raystlin82","date":"2019-03-11T08:47:47.194+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Novros,realm=EUW,application-id=KYnfKGf0,discussion-id=ao0i5MyO,comment-id=0004000100000000,timestamp=2019-03-11T07:35:43.736+0000)\n>\n> als konstruktiv gemeinten Einwurf: die Ironie in deinem 1. Kommentar kann man aber auch (leicht) übersehen :) gerade im Forum werden viele solcher Kommentare gemacht, die sind dann aber auch reißerisch gemeint ...\n\nkannst du da vielleicht etwas konkreter werden? ich hab jetzt mein kommentar mehrmals durchgelesen und kann beim besten willen nicht vorstellen wie man da die ironie ueberlesen kann.","replies":[{"poster":"Novros","date":"2019-03-11T09:21:23.847+0000","up_votes":1,"down_votes":0,"body":"Das ist schwierig, da du schon subjektiv an den Kommentar (als Autor) rangehst.\n\nVersuche dich in jemanden hineinzuversetzen, der dich und deinen Kommentar nicht kennt, der vllt. gerade auch schlecht drauf ist und lies ihn erneut.\nEs ist nun mal großer Fehler des geschriebenen Wortes, dass Emotionen nicht transportiert werden, deshalb gibt's ja Smileys.\n\nIch habe mir deinen Kommentar noch mal durchgelesen und versuche ihn mal in deinem Kopf anders zu betonen, als du es vermutlich gerade tust.\nLies ihn mal monoton, ohne an den Fragezeichen die Stimme zu heben, wie man es bei Ironie (hämisch) tun würde. Er kann durchaus nörgelnd/vorwerfend rüberkommen.","replies":[]}]}]}]}]},{"poster":"Hundis Katze","date":"2019-02-25T14:35:05.437+0000","up_votes":1,"down_votes":0,"body":"Wahlweise geht auch:\n\n\"Omg\"\n\"Wtf?\"\n\"9x Report\"\n\"Do u even know how...?\"\nOder der Klassiker:\n\"Pls go afk\"\n\nSowas baut einen Mitspieler richtig auf und verhilft zu Sieg ;)","replies":[]}]},{"poster":"Reboot Geostorm","date":"2019-02-23T17:55:02.093+0000","up_votes":3,"down_votes":0,"body":"Na ja,  zm dir zu helfen folgende Punkte :\n\n\nHier ist das Spielerforum.  Riot ist hier nicht anwesend und wenn doch dann sicher nicht um dein Gejammer anzuhören. \n\nDer 2 Punkt ist das wir hier über deinen Ban sachlich reden können dafür brauchen wir deine Chat Logs. Und zwar am besten als Bild und nicht reinkopiert. \n\nDer 3 Punkt ist egal wie viel du Zeit,  Geld und was auch immer investiert hast der Account ist weg.\n\nUnd der letzte Punkt ist, dir steht es frei einen neuen Account zu erstellen.... Aber achte bitte auf dein Verhalten sonst erlebst du womöglich ein Déjà-vu.","replies":[]},{"poster":"Darkr3sQ","date":"2019-02-23T09:21:49.065+0000","up_votes":3,"down_votes":0,"body":"> Ich will mein Ban rechtfertigen \n\nIn Deinem ganze Post habe ich keinerlei Rechtfertigung sehen können. Lediglich dieses \"Einen schlechten Tag hat jeder mal\". Allerdings ist es bei Dir kein \"mal nen schlechten Tag haben\" gewesen, sondern wie legofreak1 schon ausgeführt hatte eine mehrmaliges Verhalten. Wenn man davon ausgeht, dass Du nicht direkt den 14 Tagesbann erhalten hast, hattest Du schlechte Tage die zur ersten CR geführt hatten, danach weitere schlechte Tage die einer weiteren CR geführt hatten, weitere schlechte Tage die zu einem 14 Tagesbann geführt hatten, und nun noch weitere schlechte Tage die zu dem letztendlich angekündigten Permabann geführt haben.\nSo viele schlechte Tage sind weder ein Versehen, noch können sie mal vorkommen. Das ist schon recht konstantes negatives Verhalten, was letztendlich zu dem Permabann geführt hatte.\n\n> mein permaban ist nicht \"gerechtfertigt\"\n\nWenn Du schon einräumst, dass Du offenbar nen schlechten Tag hattest, gibst Du ja bereits schon zu, dass eine Strafe gerechtfertigt ist. Da Du Deinen Chatlog hier nicht postest, können wir erst einmal nur davon ausgehen, dass Du in Deinem Chat toxisch warst, und dafür dann den angekündigten Perma erhalten hast.\nWenn Du Dir die Nachricht zu Deinem 14 Tagesbann durchgelesen hättest, wärst Du darüber gestolpert, dass jegliches weitere negative Verhalten zu einem permanenten Ausschluss führen wird. Da reicht schon dass kleinste \"Noob\", \"Idiot\" oder ähnliche \"leichte\" Beleidigungen aus, um den Permabann zu bekommen. Genau das ist bei Dir auch passiert.\n\nWenn Du weiterhin LOL spielen willst, mache Dir einen neuen Account und lasse das Flamen sein. Mache dort einfach das, was Du in Deinem Post versprochen hast, dann kannst Du weiterhin LOL spielen, und bekommst auch keine Strafe mehr.\n\n>  hab sehr viel geld in dieses spiel gesteckt\n\nDas ist zwar ärgerlich, aber letztendlich hast Du gegen die von Dir einmal beim Erstellen Deines Accounts und bei jedem Patch aufs Neue akzeptierten AGB verstoßen, was - wie übrigens in den AGB angekündigt - letztendlich zu einem permanenten Ausschluss führen kann. Inwiefern sollte RIOT Accounts, bei denen Geld bezahlt wurde, anders behandeln, als jeden anderen Account? Warum sollte ein Spieler, der Geld bezahlt hat, sich wie der letzte Redneck benehmen dürfen, und ein \"normaler\" Spieler nicht? Die Regeln gelten für alle Spieler gleichermaßen, und RIOT macht bei der Strafe bei einem Verstoß auch keine Ausnahmen.\n\nAber mal nur so aus Interesse halbe:\nAus welchem Grund sollte RIOT Deinen Account entbannen, obwohl andere permagebannte Spieler weiterhin gebannt bleiben sollten? Was rechtfertigt in Deinen Augen, dass Dein Account wieder entbannt wird, zumal Du nach dem 14 Tagesbann offenbar keine Besserung gezeigt hattest?","replies":[]},{"poster":"Temp1891534","date":"2019-02-22T23:06:15.717+0000","up_votes":3,"down_votes":0,"body":"{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Angel Ayume","date":"2019-03-11T08:08:30.158+0000","up_votes":1,"down_votes":0,"body":"> wo ich mein kopf abschalten konnte\n\nWohl offensichtlich gar nicht der Fall, denn du hast so sehr geflamed und dich aufgeregt, dass du einen permanenten Bann dafür bekommen hast. Für mich ist das in keiner Weise den Kopf abschalten.","replies":[]}]}