{"poster":"Dinolius","date":"2017-07-10T23:59:45.910+0000","title":"[7.14] Singed Support?","subforum":"Champions & Gameplay","embed":{"description":"( With the release of patch 7.13 to live on June 28th, we started the new 7.14 PBE cycle. ) Previous PBE Cycles in 2017 Below you will find a comprehensive list of new content, balance changes, and whatever else is included in the current PBE cycle!","url":"http://www.surrenderat20.net/p/714-pbe-cycle.html?m=1","image":"http://3.bp.blogspot.com/-M_ecJWWc5CE/Uizpk6U3lwI/AAAAAAAACLo/xyh6eQNRzzs/s640/sitethumb.jpg"},"up_votes":1,"down_votes":0,"body":"Seit der &Auml;nderung von Zekes ist mir die Idee Singed als Support zu spielen, da er mit Zekes einen starken Engage mit der Ult hat, häufig in den Sinn gekommen. \n\nJedenfalls sind mir jetzt die kommenden Anpassungen von Singed, die mit Patch 7.14 erscheinen, erstmal zuwieder gewesen. \nJedoch sind eine Passive, die slowt und einen verschnellert f&uuml;r engages praktisch. Zudem kommt noch, dass seine W nun Bewegungszauber verhindert (Wie Cassiopeias Giftfeld).\nDiese Eigenschaften sollten doch gegen Champions wie Caitlyn, Ezrael oder Lucian sehr Nutzvoll sein. \n\nWas denkt ihr dar&uuml;ber? \nW&uuml;rdet ihr als ADC Beispielsweise direkt die Lust auf das Spiel verlieren, wenn man den &Uuml;berarbeiteten Singed als Support pickt? \n","replies":[{"poster":"Kiimahrii","date":"2017-07-11T01:44:51.158+0000","up_votes":2,"down_votes":0,"body":"IdR müsste ein Gegensupport in der Lage sein, sein ADC vor Singeds Kit zu peelen, weshalb ich mir bei den meisten botlane Matchups vorstellen könnte, dass es eine schwere Zeit wäre. Abgesehen davon fände ich ihn als Support durchaus zu gebrauchen. Voraussetzung dafür ist das auch im Mid- und Lategame Singed weiterhin sein Fokus darauf legt seinem ADC Luft zu verschaffen. Wer weiterhin den ADC chased muss mit Singeds Q klar kommen. Zum Teamfight Engagen würde ich nur dann nutzen wenn das Spiel sehr sicher und free Kills sind, da zum Supporten eher entsprechende Items gebuilt werden sollten. Mobiboots + Sightstone für tiefe Wards & midlane Roaming. Viel CDR um Zekes/R regelmäßig zu aktivieren und um W/E mehr Wert zu geben. Unter Umständen midgame Liandrias oder Rylais damit das Q auch sein Zweck erfüllt.","replies":[]},{"poster":"Bayonetta38","date":"2017-07-11T08:03:15.340+0000","up_votes":1,"down_votes":0,"body":"Ich hätte beinahe gesagt Zekes könntest du ja auch auf Toplane Singed bauen aber da muss ja jemand dabeisein damit das Item funktioniert und ein Singed wird gelegentlich ehr weniger vom eigenen Jungler gegankt daher ehr nutzlos. Singed Support, hmmmmmmmm......... war da mal nicht so ein Vorfall das Singed Supports gebannt werden weil es ein Trollpick sein soll?","replies":[{"poster":"BigSnipe","date":"2017-07-11T17:29:56.046+0000","up_votes":1,"down_votes":0,"body":"Er wurde nicht gebannt weil er Singed support gepickt  hat, sondern da er eine sagen wir andere Art des supporten gegen den Willen seiner Teamkolegen gespielt hat. Er war größtenteils am roamen und war nur selten Botlane. Er hat durchaus viele Spiele dadurch gewonnen, jedoch fürte dieses Antimetaverhalten zu sehr vielen reports. \nUnd die aktuelle Meta, die von den meisten Spielern genutzt/anerkannt wird hat einen Support der in der Laningphase beim Support bleibt. \n\nWenn du also so eine Spielweise mit einem Premadeteam machst ist das überhaupt kein Problem, wenn du es jedoch in Soloq machst und dein Team das nicht will solltest du es auch nicht tun. \n\nSolange man also tatsächlich Support spielt, wird man auch als Singed Support nicht gebannt!","replies":[]}]},{"poster":"RAG Ryve","date":"2017-07-11T08:50:26.691+0000","up_votes":1,"down_votes":0,"body":"Ich würde keinen Singed Support wollen. Entweder man hat dann auf der Lane garkeinen Poke außer den eigenen, was es dem Gegner möglich macht dich zu harassen ohne irgendwelche Schilde, Heals usw-, oder der Singed denied mit seinem Gift CS, was ein NO GO ist.\n\nWenn ich einen Supporter will, der keinen Poke, keine Schilde, keine Heals, usw hat, dann nehme ich lieber..ka, es gibt sonst eigentlich fast nichts was mir weniger bringen würde. Für einen engage brauche ich einen Singed nicht, da kann auch gleich ein Malphite supporten.","replies":[]},{"poster":"Dinolius","date":"2017-07-11T01:06:27.524+0000","up_votes":1,"down_votes":0,"body":"Denke hier wäre es sinnvoll dann Flash mit zu nehmen, um \"skillshot-cc\" zu entgehen. \nNe ich will mein Team nicht trollen ich suche nur nach guten neuen Möglichkeiten Singed einzusetzen. \n\nDanke für die idee","replies":[]},{"poster":"TerrorRaven","date":"2017-07-11T00:40:05.686+0000","up_votes":1,"down_votes":0,"body":"Sofern man Singed wirklich als Supporter spielt und nicht dieses Möchtegern-Counterjungle-AbsichtlichdasSpielverlieren-Pseudosupport, scheint es eine interessante Idee zu werden.\nDas Problem hier allerdings: Der \"Engage\" besteht darin, dass er auf die Gegner zu rennt. Versuch das Mal gegen Supporter mit Snare  oder Stun oder Ähnliches (Braum, Zyra, Lulu, Morgana, ect.).\nAußerdem verlangsamt seine Passive nicht, sondern beschleunigt ihn nur. Außerdem skaliert er mehr mit Level und als Supporter ist man oftmals unterlevelt.","replies":[]}]}