{"poster":"Love Anastasia","date":"2018-06-25T01:31:00.323+0000","title":"Almost everything that has to be changed for fix the game","subforum":"Gameplay","up_votes":78,"down_votes":38,"body":"Nerf creep damage\r\n\r\nNerf electrocute, Press the atack, Conqueror (The AD increase), and Grasp\r\n\r\nBuff Tower damage, make it choose the max damage between a % of your max hp or a base damage\r\n\r\nBuff tower hp and resistances \r\n\r\nRework Fiddlesticks and change Taric and Tryndamere R \r\n\r\nNerf the gold income to supports \r\n\r\nNerf letality, make One shot a thing u are able to do when u are fed, not when you are 0-0. You can do this increasing Armor per lvl and increasing the Letality items cost\r\n\r\nNerf rift herald: Make it more difficult to made (Especially alone)\r\n\r\nDelete the scuttle crab changes \r\n\r\nIncrease Baron damage, reduce the superminions strength\r\n\r\nDelete the Elemental drakes OR make vissible in champion select which ones are gonna appear so you can pick and make a strat knowing it. RNG Ruins the game\r\n\r\nNerf overall damage. Just do it, its not normal to see everyone one shotting each other\r\n\r\n\r\n**What will this change? Games will be longer, so you will have a chance to stop snowball. This is basically the main problem that game has right now. Doing this crit ADCs will come back to the game and things like &quot;Kaisa-Braum mid/jgl&quot; will stop since you will not be able to win the game at minute 15 because towers are wet paper that heal you\r\n**\r\n\r\n\r\n**ALSO\r\n**\r\n\r\nFix the client, it works REALLY BAD\r\n\r\nPunish the players who deserve to &lt;-------- Quite important\r\n\r\nAnd finally, LISTEN THE FEEDBACK and make changes thinking in something more than the Casual player and the LCS viewers","replies":[{"poster":"I Support Solar","date":"2018-06-25T03:40:31.193+0000","up_votes":37,"down_votes":2,"body":"Also:\n\nStop changing the game just to change the game.  If game changes are made, make sure it is for a reason, like fixing something.\n\nThe game is already highly variable as it is just from constant buff/nerf cycles that naturally occur with game balance.  It doesn't need help being \"fresh.\"","replies":[]},{"poster":"Laceration","date":"2018-06-25T08:28:35.617+0000","up_votes":19,"down_votes":3,"body":"This is awful","replies":[{"poster":"Elohaven","date":"2018-06-25T21:16:54.712+0000","up_votes":2,"down_votes":1,"body":"Awful is a compliment to this post.","replies":[]}]},{"poster":"TJFish","date":"2018-06-25T01:57:12.325+0000","up_votes":11,"down_votes":3,"body":"I agree with almost everything OP says other than specific champion changes. I don't think individual champions are to blame for most of your issues, they are just a result of a broken system.","replies":[{"poster":"ValiantKiller","date":"2018-06-25T05:44:18.316+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=THaddock,realm=NA,application-id=3ErqAdtq,discussion-id=3eic1EQG,comment-id=0001,timestamp=2018-06-25T01:57:12.325+0000)\n>\n> I agree with almost everything OP says other than specific champion changes. I don&#x27;t think individual champions are to blame for most of your issues, they are just a result of a broken system.\n\nBut some come from broken design though example zoe , RNG W like the hell is that.\nAll of sudden ignite pop out from minion in lane where no one got ignite, it bad design reflect alot.\n\nWhy a damn adc like kai able to get busted shield ? it like giving assassin a busted shield cause why not.\nADC and assassin should put out damage at the cost of being easy to be killed.","replies":[]},{"poster":"TheCodeisCupCake","date":"2018-06-25T12:55:12.144+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=THaddock,realm=NA,application-id=3ErqAdtq,discussion-id=3eic1EQG,comment-id=0001,timestamp=2018-06-25T01:57:12.325+0000)\n>\n> I agree with almost everything OP says other than specific champion changes. I don&#x27;t think individual champions are to blame for most of your issues, they are just a result of a broken system.\n\nBut we do need a Tryndamere change. Its the mot monotonic thing to play vs him","replies":[]},{"poster":"DW Diana","date":"2018-06-26T10:06:52.421+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=THaddock,realm=NA,application-id=3ErqAdtq,discussion-id=3eic1EQG,comment-id=0001,timestamp=2018-06-25T01:57:12.325+0000)\n>\n> I agree with almost everything OP says other than specific champion changes. I don&#x27;t think individual champions are to blame for most of your issues, they are just a result of a broken system.\n\nYes and No. I agree the champions he has mentioned are not to blame, but the systematic nerfing of mages that used to deal with hypermobile hypercarries (assassin's, Yasuo, Irelia etc) have lead to their dominance in midlane, and as they are all snowballer/roamers they can easily take over the game which means games will become faster. This means that any champions that require scaling to be good won't be viable which negates most mages, most adcs, and most tanks.\n\nIn short, fixing SOME champions that counter the current meta could cause a chain reaction that brings a lot more champions back to the fore. Note this is the FIRST SEASON EVER where Malzahar hasn't been able to counter Yasuo, Zed, Talon etc.\n\nOther then this I agree with the OP for the most part :)","replies":[]}]},{"poster":"ALL MłGHT","date":"2018-06-25T04:58:30.948+0000","up_votes":4,"down_votes":0,"body":"riot wants to make games shorter, they'll completely disregard anything against their philosophy","replies":[]},{"poster":"Toppien","date":"2018-06-25T02:01:15.628+0000","up_votes":8,"down_votes":5,"body":"{{sticker:zombie-brand-clap}} \n\nnothing more to say i agree with everything","replies":[]},{"poster":"RekSai CoffeeCo","date":"2018-06-25T03:43:52.438+0000","up_votes":4,"down_votes":6,"body":"Balance the jungle camp experience to hit same levels as solo laners about same time, there is no need for junglers to be 2-4 levels under the solo laners for 4-5 mins.","replies":[{"poster":"Spank the Fox","date":"2018-06-25T04:27:56.325+0000","up_votes":7,"down_votes":3,"body":"What?\n\nIf you get to PvE and then pop up into any lane with a number’s advantage, you should not be the same level as a solo laner who has to juggle creep control and trades (ie actually interact with other players near constantly).\n\nThis is exactly what was wrong with the previous jungle.","replies":[]}]},{"poster":"Nøctμrne","date":"2018-06-25T17:14:56.729+0000","up_votes":2,"down_votes":0,"body":"Although most of this is true,  I don't think the keystone needs are necessary, especially grasp,  Conqueror and press the attack. Electrocute could use some fine tuning, but since I main a champion that runs it I'm a little biased.","replies":[{"poster":"Love Anastasia","date":"2018-06-25T19:34:40.261+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nøctμrne,realm=NA,application-id=3ErqAdtq,discussion-id=3eic1EQG,comment-id=0019,timestamp=2018-06-25T17:14:56.729+0000)\n>\n> Although most of this is true,  I don&#x27;t think the keystone needs are necessary, especially grasp,  Conqueror and press the attack. Electrocute could use some fine tuning, but since I main a champion that runs it I&#x27;m a little biased.\n\nConqueror should be a mastery picked in specific cases, atm its a must in all match ups for a lot of people, I think that it's basically because the +10-35 AD. Remove it so it becomes a mastery to pick against Tanks (Like it should be)\n\nI feel like you can abuse grasp so much, it grants you heal in lane (2 % of your max hp per AA), a nice amount of damage and 5 hp permanently. Compare it with Fleet Footwork which heals you like 5 hp. Try them as Fiora, spam your Q every time u get the grasp and u will understand what i'm saying xd\n\nPress the atack deals just so much damage. \"40 - 180 (based on level) bonus Attack damage and makes them Exposed for 6 seconds, causing them to take 8% - 12% (based on level) increased damage from all subsequent sources\" If it increase the damage YOU do, it would be barely balanced, but increasing the damage from all sources... it's just sick. Anyways, idk if the increased damage other people do counts as damage in the keystone meter. It's just a strong mastery in 1 vs 1, while getting an allie gank, but also at 5 vs 5 to expose the squishy enemy champ \n\nElectrocute damage is just sick, but not as much as Press the atack","replies":[]}]},{"poster":"Ayanami3rd","date":"2018-06-25T16:06:43.925+0000","up_votes":2,"down_votes":0,"body":"Classic supports are already in a bad spot. Nerf them more and you can outright delete them.\n\nOtherwise, I agree.","replies":[]},{"poster":"Cyrosi","date":"2018-06-25T15:07:33.480+0000","up_votes":2,"down_votes":0,"body":"I don't think supports need less gold. It's already a disliked role with more required items than any other role. We already get 1-2 items less than everyone else in games that don't last 40 minutes (which is most of them right now), or where our lane enemies aren't potatoes that let us hit them constantly for gold. If you have problems with a support build or character, change the problematic items or character and not the gold.\n\nThe one thing I would change about gold generation is the fact that {{item:3304}} gives a lot more gold on average than {{item:3310}}, even in matches where you're hitting enemies a lot of the time with {{item:3310}}. I want {{item:3304}} and {{item:3310}} to have about the same potential, and then you pick which one is best for your situation. Like if you're against a botlane that can outrange you and make poking difficult, you take {{item:3304}}, and if you're going to be poking a lot you take {{item:3310}}.","replies":[{"poster":"Mokuto Bunshi","date":"2018-06-25T17:54:22.147+0000","up_votes":1,"down_votes":0,"body":"I agree with this ^^^","replies":[]}]},{"poster":"Elohaven","date":"2018-06-25T21:15:59.438+0000","up_votes":3,"down_votes":1,"body":"This post is a bit biased with sarcasm on the bit. People actually upvoted this post which is sad.\n\n- Taric R doesn't need to be changed. It's baitable and has a clear weakness. You fix the jungle - you fix the Taric nuisance you see.\n- Buffing tower defensive options shouldn't mean buffing tower damage with the nerf of damage creep. This will cause towers to be too strong. Don't buff towers offensively.\n- Lethality doesn't need a nerf but a change. Assassins in general struggle in high elo. What is needed is a change to their design philosophy. I say adding a %missing health mechanic for them to burst squishies or low-health tanks/targets as this will make them more team-fight friendly and playable WITH mages.\n- Baron isn't meant to deal damage and shred. It's meant to be contested. Thus, I say buff its damage slightly so it is very difficult in the ideal mid-game (20 minutes) but its damage drastically decreases at 4+ people\n- Elemental drakes do not need a removal. Infernal drake simply needs a rework.\n- Grasp doesn't need a nerf. It's actually one of the most underperforming runes.\n- Press the Attack does not need a nerf. It is the snowball and item viability you are seeing with non-crit builds.\n- Conqueror does not need its AD increased nerfed. Its issue is its true damage, viability for losing lanes/champions, abuse cases, and its time mechanic.","replies":[{"poster":"Seenan","date":"2018-06-26T03:46:11.509+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Elohaven,realm=NA,application-id=3ErqAdtq,discussion-id=3eic1EQG,comment-id=001e,timestamp=2018-06-25T21:15:59.438+0000)\n>\n> This post is a bit biased with sarcasm on the bit. People actually upvoted this post which is sad.\n> \n> - Taric R doesn&#x27;t need to be changed. It&#x27;s baitable and has a clear weakness. You fix the jungle - you fix the Taric nuisance you see.\n> - Buffing tower defensive options shouldn&#x27;t mean buffing tower damage with the nerf of damage creep. This will cause towers to be too strong. Don&#x27;t buff towers offensively.\n> - Lethality doesn&#x27;t need a nerf but a change. Assassins in general struggle in high elo. What is needed is a change to their design philosophy. I say adding a %missing health mechanic for them to burst squishies or low-health tanks/targets as this will make them more team-fight friendly and playable WITH mages.\n> - Baron isn&#x27;t meant to deal damage and shred. It&#x27;s meant to be contested. Thus, I say buff its damage slightly so it is very difficult in the ideal mid-game (20 minutes) but its damage drastically decreases at 4+ people\n> - Elemental drakes do not need a removal. Infernal drake simply needs a rework.\n> - Grasp doesn&#x27;t need a nerf. It&#x27;s actually one of the most underperforming runes.\n> - Press the Attack does not need a nerf. It is the snowball and item viability you are seeing with non-crit builds.\n> - Conqueror does not need its AD increased nerfed. Its issue is its true damage, viability for losing lanes/champions, abuse cases, and its time mechanic.\n\nConqueror definitely needs its AD nerfed...two longswords at level 1 and 20% of your damage becomes non reduce-able. Infact, the rune needs a nerf entirely. Melee carries (and even fighters) abuse it to high heavens.","replies":[{"poster":"Elohaven","date":"2018-06-26T21:59:59.534+0000","up_votes":1,"down_votes":0,"body":"It's only 10-35 AD. It's the true damage that is the issue - not the flat AD.","replies":[]}]}]},{"poster":"iDarkWind","date":"2018-06-25T13:44:47.189+0000","up_votes":3,"down_votes":2,"body":"And you might as well delete assassins in the process, because this changes you proposed, will basicly destroy the assassins, because their only purpose to exist in first place is to one shot, and also by incresing the lehtality items cost, you will delay even further their powerspikes to the point you might as well pick a mage because you will outscale the assassin anyway. Also, with the buff to towers and other changes to make more comebacks possible, you will also delete the carry potencial of any other class except late game classes.\n\nDidn't you think that perhaps it isn't that simple to just nerf the damage overall and stall the games on purpose? It has a huge impact, and people like you seem to not understand. \nAlso saying obvious things like: \"Improve the report system\", yes, you're definitely being extremly helpful, I mean, Riot didn't even tough of that in first place, like it is so easy to fix that issue, I am right ?\n\nPlease people, start to wake up to the real life and think before posting crap.","replies":[{"poster":"Love Anastasia","date":"2018-06-25T14:05:39.160+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=iDarkWind,realm=EUW,application-id=3ErqAdtq,discussion-id=3eic1EQG,comment-id=0011,timestamp=2018-06-25T13:44:47.189+0000)\n>\n> And you might as well delete assassins in the process, because this changes you proposed, will basicly destroy the assassins, because their only purpose to exist in first place is to one shot, and also by incresing the lehtality items cost, you will delay even further their powerspikes to the point you might as well pick a mage because you will outscale the assassin anyway. Also, with the buff to towers and other changes to make more comebacks possible, you will also delete the carry potencial of any other class except late game classes.\n> \n> Didn&#x27;t you think that perhaps it isn&#x27;t that simple to just nerf the damage overall and stall the games on purpose? It has a huge impact, and people like you seem to not understand. \n> Also saying obvious things like: &quot;Improve the report system&quot;, yes, you&#x27;re definitely being extremly helpful, I mean, Riot didn&#x27;t even tough of that in first place, like it is so easy to fix that issue, I am right ?\n> \n> Please people, start to wake up to the real life and think before posting crap.\n\nDelete assasins? No.\n\nMake assassins a high risk high reward champions like it should be? Yes! You get enough advantage in lane because you are good? U can carry the game because u can one shot. At this moment, the game is \"Doesnt matter if i dont do anything the whole game, because when i got \"Insert core item\" i will one shot\"\n\n\nAnd i literally said \"Punish the players that deserve to\". And I say that because i've sent like 400 tickets reporting people, with screeenshots showing how they hard int only to see they keep playing everyday","replies":[{"poster":"iDarkWind","date":"2018-06-25T14:45:16.993+0000","up_votes":3,"down_votes":1,"body":"Dude, if they're behind, they can't one shot anyways. if this changes went through, they wouldn't one shot even when considerable fed.\nAssassins pattern of high risk high reward never changed, if you feed as an assassin, you will watch yourself being outscaled and become useless because if you build damage, you still won't have enough to do something, and if you build tank, you will still be blown up.\n\nAlso: \"At this moment, the game is \"Doesnt matter if i dont do anything the whole game, because when i got \"Insert core item\" i will one shot\"\", excuse me, that's quite bad argumentation. If the assassin takes 5 more minutes to get the item the should usually get earlier, they will still get a powerspike, but it won't be as hard as it should be for them to be able to carry and it will also reduce by a lot their one shot potencial.\n\nAlso, if they fall behind, they won't only fall in terms of gold but also in EXP, wich is a big deal because lethality scales with the assassins's lvl. This a high risk high reward playstyle either you agree or not.","replies":[]}]},{"poster":"LightIsMyPath","date":"2018-06-25T14:42:16.072+0000","up_votes":1,"down_votes":0,"body":"Assassins weren't able to 100-0 on one item before and they were viable until their targets began to 3 shots them instead, so it became a \"I need to kill x in enough time he can't react or he will kill me instead\". Even infamous 100-0 in 0,00 old Rengar didn't do that at level 6 out of the blue. The only assassin that had serious kill pressure in lane was LeBlanc , all others COULD kill but they weren't guaranteed to do it. The most skill expression assa had was the moment to enter in a fight. Go in too early, you get focused on and die, go too late and your team lost the teamfight 4 vs 5.. Now it's \"go in whatever and take them out before they can focus you or you get 2 shotted yourself\".","replies":[{"poster":"iDarkWind","date":"2018-06-26T01:12:46.582+0000","up_votes":1,"down_votes":0,"body":"They could actually.\nIn terms of itemazation, it was way better back then. We didn't need to relie on {{item:3147}} to one shot someone.\nWe had Brutalizer that gave us 10% flatArmorPen (not this thing lethality that scales with lvl) and the old 2300gold Last Whisper. \nThe combination of the old {{item:3035}} and the old {{item:3142}} was extremly powerfull, because back in the days, {{item:3142}} gave 20% ArmorPen + 10%CDR + 60AD (I think) + 15% Critical Chance, and the active provided not only movement speed, but also attack speed.\nAlso, we had {{item:3071}} that had a way better build path and offered more AD and less HP, and the passive of ArmorPen would stack up to 36% (currently only stacks up to 24%).","replies":[{"poster":"LightIsMyPath","date":"2018-06-26T02:03:49.280+0000","up_votes":1,"down_votes":0,"body":"But by the time you got those items your enemy mage could get a seeker + mana component. A kill itemless was possible but it required playing the fight better than the opponent and weaving autos into a full combo. In that scenario it's completely fair to be able to kill. Now a full optimally executed combo from almost any assassins overkills , so he can fuck up and still kill. If it wasn't this way however it would be impossible for them to do their job in the current state of the game once they leave lane.","replies":[{"poster":"iDarkWind","date":"2018-06-26T12:14:25.738+0000","up_votes":1,"down_votes":0,"body":"But back in the days {{item:3191}} alone wouldn't negate as hard the damage of the assassins, because of how ArmorPen used to work vs the Lethality stat we have nowdays. Also, mages had to actually worry  about mana management. Nowdays, you can tell me as much as you want that people still need to, but it's far more easier for them to shove 3 waves with their wave clear avantage and back.\nAlso, mages back in the days had only had the active of {{item:3157}} when they had the full item, wich nowdays you can buy it for 600 gold ({{item:2419}} ), and even tough it's a one time use, it will save you from one death and make the assassin waste his cooldowns on you wich will lead him to have to play safer because he will vulnerable and probably won't roam either without his ultimate.","replies":[{"poster":"LightIsMyPath","date":"2018-06-26T12:41:13.020+0000","up_votes":1,"down_votes":0,"body":"Sure but you could get mana regen for way less gold. 1300 gold to sustain is hard to combine with defenses and at the same time once the mage gets it there's no way to prevent wave shove. It's a loose -loose situation","replies":[{"poster":"iDarkWind","date":"2018-06-26T20:00:34.273+0000","up_votes":1,"down_votes":0,"body":"Not true, the best thing if I remenber correctly you could do was to buy 2 {{item:1056}} but only that.\nYou guys can tell me as much as you want that mages have mana problems, but I'll keep saying that with their clear advantage and the many tools that they have nowdays that they didn't have before (AKA {{item:3802}} {{item:3010}} ) you guys can perfectly shove the wave and back without losing any minion.\n\nToday I played against a {{champion:101}} and he was really good in the laning phase, even tought it had most to do with his jungler presence too, but anyways, he constantly pocked me down during the laning phase and at the same time could always shove me under my tower and he had the lead in the lane basicly. What did he build? {{item:3191}} . Arguably, I wasn't playing at my best, sure I made some mistakes (I was a {{champion:238}} ), but that guy played it perfectly in a way that made me not able to snowball at all and always making my HP low enough to make not dive him. I saw him shoving the wave and poking me at the same time, and he did run out of mana, but it took a while.\n\nSo, yeah, this discussion is becoming pointless now, but I have to say it was a pleasure to talk with you, but we just have to accept that we have different point of views.","replies":[{"poster":"LightIsMyPath","date":"2018-06-26T21:15:22.917+0000","up_votes":1,"down_votes":0,"body":"The before I was talking about was the time when lost chapter didn't exist. There was the catalyst as a component for the roa, the tear for seraph 's, the chalice for athene mages and the forbidden idol for morellonomicon users as mana sustain components.\nFor your Xerath example notice he has in-built mana sustain into his passive so if he can play it perfectly (using the passive auto on enemy champion) his mana sustain is crazy.\nSo nice finding someone who can argue without negativity 😊 . Nice to meet you and good luck on the rift 😊","replies":[]}]}]}]}]}]}]}]},{"poster":"ZephyrDrake","date":"2018-06-25T04:22:16.740+0000","up_votes":5,"down_votes":4,"body":"Oh yeah, that would surely fix everything and not introduce a whole new set of problems... also \"listen to feedback\" when literally every single change done recently has been due to the community asking for said changes. The changes blew in everyone's face and instantly it's \"we told you rito!\" When in fact, no most of you didn't but now don't want to admit that what you suggest isn't always what's best","replies":[{"poster":"Love Anastasia","date":"2018-06-25T11:10:36.911+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=ZephyrDrake,realm=NA,application-id=3ErqAdtq,discussion-id=3eic1EQG,comment-id=0006,timestamp=2018-06-25T04:22:16.740+0000)\n>\n> Oh yeah, that would surely fix everything and not introduce a whole new set of problems... also &quot;listen to feedback&quot; when literally every single change done recently has been due to the community asking for said changes. The changes blew in everyone&#x27;s face and instantly it&#x27;s &quot;we told you rito!&quot; When in fact, no most of you didn&#x27;t but now don&#x27;t want to admit that what you suggest isn&#x27;t always what&#x27;s best\n\nIm sure that everyone was asking to put a random crab that determines who win the jungle and makes risky to pick any late game champ in jungle","replies":[]}]},{"poster":"SanKakU","date":"2018-06-25T07:11:15.556+0000","up_votes":6,"down_votes":5,"body":"Honestly I feel like every balance change you want here is bad.","replies":[]},{"poster":"MasterDClone","date":"2018-06-25T20:53:11.265+0000","up_votes":2,"down_votes":1,"body":"Correction: Not fix the game but change it in a way that is more enjoyable for you. \nPersonally i prefer this meta currently than any we've had for the past 3 years.","replies":[{"poster":"Love Anastasia","date":"2018-06-26T01:39:03.034+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Master2139,realm=NA,application-id=3ErqAdtq,discussion-id=3eic1EQG,comment-id=001c,timestamp=2018-06-25T20:53:11.265+0000)\n>\n> Correction: Not fix the game but change it in a way that is more enjoyable for you. \n> Personally i prefer this meta currently than any we&#x27;ve had for the past 3 years.\n\nYeah, specially in the part where I ask to nerf letality, except because I've abused it since it's damaage makes 0 sense","replies":[{"poster":"MasterDClone","date":"2018-06-26T05:10:21.019+0000","up_votes":1,"down_votes":0,"body":"I did not say better for you i said more enjoyable for you, there is a very notable difference. I abused the shit out of the shaco buffs a few patches ago, does not mean i preferred that patch and I'm glad they nerfed him into a balanced state, I prefer to outplay my opponent rather than get a free win over and over.","replies":[]}]}]},{"poster":"PowerSlave993","date":"2018-06-25T14:15:31.294+0000","up_votes":2,"down_votes":1,"body":"You sir deserve a gold medal! I agree with everything you have said.\n\nSadly Riot will not fix anything from this. They just don't care. You have to realize that as long as China/Korea wants lower games, there's nothing Riot will do about it. They give them money > they do what they wish. They just don't care :/","replies":[]},{"poster":"LightIsMyPath","date":"2018-06-25T13:06:43.248+0000","up_votes":2,"down_votes":1,"body":"I like elemental drakes, they actually encourage you to fight for them. What I hate is they spawn randomly and you have no way to build a strategy around them. Got an all in comp and planning to have dragon control? That ocean will surely help you win xD. Got a master Yi and end up getting 2 mountains? Gg you won the game with a free baron. Hyperbolic of course but it's what it feels like","replies":[{"poster":"Love Anastasia","date":"2018-06-25T14:09:16.909+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LightIsMyPath,realm=EUW,application-id=3ErqAdtq,discussion-id=3eic1EQG,comment-id=0010,timestamp=2018-06-25T13:06:43.248+0000)\n>\n> I like elemental drakes, they actually encourage you to fight for them. What I hate is they spawn randomly and you have no way to build a strategy around them. Got an all in comp and planning to have dragon control? That ocean will surely help you win xD. Got a master Yi and end up getting 2 mountains? Gg you won the game with a free baron. Hyperbolic of course but it&#x27;s what it feels like\n\nThat's the point, and it's basically the same than \"My plan is to camp top because if I make him win the 1 vs 1 he can stay splitpushing while we as 4 push mid. The crab appears 8 times in a row at botlane\". \n\nBasically: RNG ruining the game","replies":[]}]},{"poster":"Mokuto Bunshi","date":"2018-06-25T17:53:32.014+0000","up_votes":1,"down_votes":0,"body":"I really like the drakes idea, but consider changing your opinion on the minion damage. Its kind of important to make sure assassins DON'T dominate early. Jumping on me and taking minion agro should be a punishable move. That's not to say that super minions don't need to be toned down, but if you do both then minions and wave mechanics (and probably macro as a whole) takes a hit... in a STRATEGY game that you are trying to keep from being so short.","replies":[{"poster":"Love Anastasia","date":"2018-06-25T19:36:33.721+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mokuto Bunshi,realm=NA,application-id=3ErqAdtq,discussion-id=3eic1EQG,comment-id=001b,timestamp=2018-06-25T17:53:32.014+0000)\n>\n> I really like the drakes idea, but consider changing your opinion on the minion damage. Its kind of important to make sure assassins DON&#x27;T dominate early. Jumping on me and taking minion agro should be a punishable move. That&#x27;s not to say that super minions don&#x27;t need to be toned down, but if you do both then minions and wave mechanics (and probably macro as a whole) takes a hit... in a STRATEGY game that you are trying to keep from being so short.\n\nWhen talking about nerf creeep damage I was referring specially to the moment when someone get's an inhi and the superminions are just inmortal + deal tons of damage","replies":[{"poster":"Mokuto Bunshi","date":"2018-06-26T18:06:05.923+0000","up_votes":1,"down_votes":0,"body":"Oh... then say that :P","replies":[]}]}]},{"poster":"Fighter Ignite1","date":"2018-06-26T10:00:11.146+0000","up_votes":1,"down_votes":0,"body":"> Delete the scuttle crab changes\n\nYes please","replies":[]},{"poster":"TyroneWatermelon","date":"2018-06-26T00:55:30.667+0000","up_votes":1,"down_votes":0,"body":"Ayo hol up.\nwtf is wrong with grasp? its damage and healing is shit both early mid and late, and the health bonus is mediocre at best that requires stacking in lane","replies":[]},{"poster":"Rαy","date":"2018-06-25T21:02:46.521+0000","up_votes":1,"down_votes":0,"body":"I normally dislike these posts but I actually agree with every single point you made. These are precisely the things that need to change.","replies":[]},{"poster":"Mokuto Bunshi","date":"2018-06-25T17:38:19.339+0000","up_votes":1,"down_votes":0,"body":"wait, why nerf creep damage?","replies":[{"poster":"zaire90","date":"2018-06-25T17:45:19.916+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mokuto Bunshi,realm=NA,application-id=3ErqAdtq,discussion-id=3eic1EQG,comment-id=001a,timestamp=2018-06-25T17:38:19.339+0000)\n>\n> wait, why nerf creep damage?\n\nSo assassins can keep fighting in minon waves and not care about taking aggression from the minions and then op can complain about how damage is still too high and riot keeps destroying the game","replies":[{"poster":"Mokuto Bunshi","date":"2018-06-25T17:51:14.534+0000","up_votes":1,"down_votes":0,"body":"I mean a lot of his ideas like showing drakes pre-game has merit... but this is a huge part of the strategy experience and a major balancing level. If I am loosing to a lane bully top (teemo?) The only thing I can count on is that their auto targeted autos or abilities will proc minion agro. If that goes away its less of a strategy. I could understand if he said remove ally minion block maybe...","replies":[]}]}]},{"poster":"Gregorovic08","date":"2018-06-25T14:04:25.133+0000","up_votes":1,"down_votes":0,"body":"Why nerf the gold income to supports? They live on minimum wage in the first place and don't have a lane where they can cs or get gold another way. They make so little gold that their items need to be cheap or they won't ever be able to buy them.","replies":[]}]}