{"poster":"Issiebie","date":"2019-01-24T06:43:33.019+0000","title":"Matchmaking","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"I&#039;ve been playing ranked for a few years now, 3 seasons I think. I&#039;ve always thought matchmaking was unfair. But seriously? Why am I getting people who are under level 50 in my games? I&#039;m almost level 150! \r\nI thought this was going to change with the new season? That matcmaking was especially messed up just for preseason. But it&#039;s still happening - and they&#039;re RUINING games. \r\nI&#039;ve seen people say &quot;level doesn&#039;t determine skill&quot; but it kind of does. Especially when you&#039;re in a game and the ADC doesn&#039;t know how to kite. Or a lane doesn&#039;t know how to CS/build properly, or takes TP/barrier as ADC without even asking for the supp to take heal. It&#039;s so easy to tell if someone&#039;s one of the low level beginners since they simply DON&#039;T KNOW THE BASICS. Is this really fair on people that have spent years playing the game and are a bit more experienced with the mechanics? Is it really fair on the low levels who get put in these games and then lose for the team, usually getting raged at? Especially in provisionals - I&#039;ve just had a game where bot was STOMPING, yet jg and top (who were low level premades) fed so hard we couldn&#039;t come back. How is this fair? Is Riot ever going to do anything to fix the level differences in ranked, or is it a free-for-all?","replies":[{"poster":"Thug Life","date":"2019-01-29T13:46:42.203+0000","up_votes":1,"down_votes":0,"body":"I just had my first game of ARURF and it was a 3v5 the whole match and couldn't remake because one player was in the match for 30 seconds who just gave first blood and left and then another who left after 2-3 minutes after giving away 2 kills. \n\nSolo/Duo Ranked and not joining Draft/Blind/ARAM with a full premade team will always have it's problems especially with new accounts or lower elo.","replies":[]},{"poster":"pool party heimy","date":"2019-01-24T13:12:28.032+0000","up_votes":1,"down_votes":0,"body":"if you are in the games with these people then riot thinks you are as bad as them. get gud kappa","replies":[]}]}