{"poster":"Parappapopo","date":"2017-01-21T22:58:08.685+0000","title":"free skin 2017 <3.............","subforum":"Discussioni generali","up_votes":1,"down_votes":3,"body":"Salve a tutti, stasera mi arriva un messaggio privato con questo link \n\nhttp://leagues0fskin.co.v(.....)DgFvnXSHQsT/lol/en/?i=124221 \n\na me puzza tanto di fishing, ce&#039; la possibilita&#039; di capire se i miei timori sono fondati? \n\nse lo sono posso denunciare al tribunale di lol l&#039;account che mi ha mandato questo link e come?","replies":[{"poster":"Parappapopo","date":"2017-01-22T07:35:31.106+0000","up_votes":1,"down_votes":0,"body":"grazie a tutti per le risposte link modificato per non essere piu funzionante. Ora, la mia rabbia continua! Cioe' vorrei fermarli sti criminali, possibile che non si possa fare ninte?","replies":[{"poster":"NiraBlade","date":"2017-01-22T09:39:19.409+0000","up_votes":1,"down_votes":0,"body":"Oltre a quello che ti ha già detto Ciack, ti conviene mandare uno screen del messaggio privato che hai ricevuto dal giocatore, di modo che possano occuparsi di quell'account nello specifico. Spesso dopo aver compromesso un account spediscono a tutta la sua lista amici messaggi con questi link, sperando che altri abbocchino.","replies":[]},{"poster":"Floppyz","date":"2017-01-22T09:29:30.604+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Parappapopo,realm=EUW,application-id=MJVj50Jw,discussion-id=6MVGj0Y7,comment-id=0005,timestamp=2017-01-22T07:35:31.106+0000)\n>\n> grazie a tutti per le risposte link modificato per non essere piu funzionante. Ora, la mia rabbia continua! Cioe&#x27; vorrei fermarli sti criminali, possibile che non si possa fare ninte?\n\nPuoi segnalare gli URL come indicato qui: http://boards.euw.leagueoflegends.com/it/c/aiuto-e-supporto-it/k2KH7Yx8-segnalare-un-bug-leggere-prima-di-postare\n\nPiù di questo è difficile, perché è come chiedere cosa puoi fare contro lo spam che ti arriva per posta...","replies":[]}]},{"poster":"Mist3rFl4sh","date":"2017-01-22T02:31:13.386+0000","up_votes":1,"down_votes":0,"body":"È un troll non ti fidare mai di questi link, le persone non capiscono che per avere le skin devi cacciare i soldi eccetto per qualche evento. Togli immediatamente quel link prima che qualcuno ci clicchi sopra e rimanga fregato...","replies":[]},{"poster":"Jeanne dˆArc","date":"2017-01-22T00:40:47.566+0000","up_votes":1,"down_votes":0,"body":"Fake, gli annunci ufficiali riguardo eventuali regali da parte della Riot, vengono pubblicati esclusivamente sul sito ufficiale, tutti gli altri sono solo tentativi di truffa. Inoltre, rimuovi il link prima che entri qualcuno che vedendo \"skin gratis\" e il link, ci clicchi su e rimanga fregato.","replies":[]},{"poster":"O V T R Λ G E","date":"2017-01-21T23:28:40.594+0000","up_votes":1,"down_votes":0,"body":"credimi è 100% troll \nquesti siti sono fatti apposta per rubare account ne segue che anche reportare l'account che te l'ha mandato è sbagliato perchè con molte probabilità sono account rubati a loro volta","replies":[]},{"poster":"Kim114","date":"2017-01-21T23:13:21.270+0000","up_votes":1,"down_votes":0,"body":"Per capire se è fake fai il login con un account finto\nIo premo lettere a caso e mi fà loggare su un sito bloccato","replies":[]},{"poster":"SirZeel","date":"2017-01-21T23:00:32.442+0000","up_votes":1,"down_votes":0,"body":"Very fake.\nCancella il link e non fidarti di queste cose. Le promozioni Riot sono sempre annunciate da loro e non le verrai mai a sapere la prima volta tramite messaggi privati di gente a caso.","replies":[]}]}