{"poster":"Parappapopo","date":"2017-06-15T12:03:24.953+0000","title":"Aiuto mi lagga di FPS..","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"come da titolo apro questo post perche veramente non so piu` andare a parare.. ho un i7 con win10 e non mi ha mai laggato di fps cosi`, questa cosa sembra che avvolte mi succeda persino con youtube in HD. Ho cercato su questo forum, ho comprato un buon antivirus per 1 anno e ho ridotto tutta la grafica al minimo e cio nonostante non accenna a diminuire. Questo problema me lo fa circa una volta ogni 20 minuti di gioco e gioco senza niente di aperto in background (ho provato anche a chiudere il client!) ma comunque pirima non lo aveva mai fatto anche con yt per la musica e con le grafiche al massimo. Non so veramente cosa fare. {{item:3070}} {{item:3070}}","replies":[{"poster":"Parappapopo","date":"2017-06-23T13:10:03.952+0000","up_votes":1,"down_votes":0,"body":"CI SIAMO! e stavolta credo proprio di aver risolto! ebbene si, era la temperatura elevata! in arrivo base con ventola e led da gaming. Per ora Aria raffreddante spray da 3 euro e qualche mattoncino lego strategicamente posizionato sotto al laptop fanno la magia. GRAZIE GRAZIE GRAZIE!!! Posso onorare questo intervento in qualche maniera qui sul forum?{{sticker:zombie-nunu-hearts}}","replies":[]},{"poster":"Chroniicles","date":"2017-06-16T09:14:20.257+0000","up_votes":1,"down_votes":0,"body":"La cosa più banale... hai aggiornato i driver della scheda grafica? \nStai utilizzando correttamente la dedicata invece dell'integrata?\nIl portatile è impostato su massime prestazioni?","replies":[{"poster":"Parappapopo","date":"2017-06-18T19:13:11.153+0000","up_votes":1,"down_votes":0,"body":"1)si\n2)cosa e`?\n3)si","replies":[{"poster":"Chroniicles","date":"2017-06-18T19:25:30.626+0000","up_votes":1,"down_votes":0,"body":"Facciamo così: estrai i log con [HRT](https://support.riotgames.com/hc/it/articles/224826367-Risoluzione-problemi-automatizzata-strumento-di-riparazione-Hextech), così dò un'occhiata direttamente da lì su cosa stia succedendo!\nHostali su dropbox i siti simili e condividi qui il ink così che io possa scaricarli","replies":[{"poster":"Parappapopo","date":"2017-06-18T20:06:16.596+0000","up_votes":1,"down_votes":0,"body":"te li posso dare con skype?","replies":[{"poster":"Chroniicles","date":"2017-06-18T21:19:51.905+0000","up_votes":1,"down_votes":0,"body":"Non ho skype :D al massimo addami ingame, ti giro un'email ;)","replies":[{"poster":"Parappapopo","date":"2017-06-19T12:16:46.567+0000","up_votes":1,"down_votes":0,"body":"ti ho addato, ti aspetto","replies":[{"poster":"Chroniicles","date":"2017-06-19T17:17:37.714+0000","up_votes":1,"down_votes":0,"body":"Visti i log, ti faccio un elenco di ciò che ho trovato che dovresti sistemare\n\n- i driver della VGA **NON** sono aggiornati\n--> Driver Date/Size: 06/08/2015 02:00:00, 1472992 bytes\ned è la cosa più banale da fare subito ;) elimina i vecchi con [driversweeper](http://www.guru3d.com/content-page/guru3d-driver-sweeper.html) e scarica l'ultima versione dal [sito ufficiale](http://support.amd.com/en-us/download)\n\n\n- ci sono alcuni errori di aggiornamenti falliti in Windows, apri WindowsUpdate e correggi quelli che puoi. Potrebbe aiutarti fare prima una pulizia _dei registri_ con ccleaner. In caso estremo, anche un [avvio pulito](https://support.microsoft.com/it-it/help/929135/how-to-perform-a-clean-boot-in-windows) di Windows\n\n\n- fai una media più di 100FPS, con picchi minimi di 60 e massimi di 300+... **abilita assolutamente la sincronia verticale**, ti cappa automaticamente gli FPS a 60 e non subisci sfrarfalii/flickering sul monitor\n\nIntanto prova queste cose, se serve entriamo più nello specifico ma non credo ce ne sarà bisogno ;)\n\np.s. è la prima volta che mi capita di vedere una cosa piuttosto strana nei tuoi log: nel dxdiag è riportato Win10 come SO, mentre nei log del client Win8... penso sia tutto collegato agli errori sugli aggiornamenti, non so in che modo possa impattare tutto ciò nel tuo pc quindi non sottovalutare il secondo punto","replies":[{"poster":"Parappapopo","date":"2017-06-20T09:53:46.680+0000","up_votes":1,"down_votes":0,"body":"ok fatti entrambi i procedimenti e continua a laggare.. un po` meglio di prima ma ancora va a scatti a 10 , 14 , 28 minuti","replies":[{"poster":"Chroniicles","date":"2017-06-20T09:56:38.242+0000","up_votes":1,"down_votes":0,"body":"Mi aspettavo un risultato migliore :(\nEstrai di nuovo i log (che si saranno aggiornati con le recenti modifiche) e inviameli alla stessa mail, così controllo il cambiamento!","replies":[{"poster":"Parappapopo","date":"2017-06-20T20:43:36.401+0000","up_votes":1,"down_votes":0,"body":"ho risolto!!!!... ...per un momento... poi e` tornato a laggare... dovrebbero essere i driver visto che e` l`unica cosa dove ho operato stavolta. con il programma apposito fornitomi da athlonx860 ho fatto l`installazione pulita e funzionava fino a quando non mi ha chiesto di fare il reboot.. al riavvio non funzionava piu`.","replies":[{"poster":"Chroniicles","date":"2017-06-20T21:57:44.001+0000","up_votes":1,"down_votes":0,"body":"i driver non sono cambiati, sono sempre gli stessi :( devi assolutamente provare con la procedura che ti ho descritto prima (pulizia dei vecchi driver con driversweeper e reinstallazione)\nAnche la sincronia verticale è ancora disabilitata!","replies":[{"poster":"Parappapopo","date":"2017-06-21T11:34:42.776+0000","up_votes":1,"down_votes":0,"body":"fatto e sembra essere tutto risolto! c`e` stato un momento che ho temuto per il mio pc ma ora e` tutto ok ^^. sto ancora testando chissa` che non esca qualche problemuccio nuovo.. \nCosa e` la sincronia verticale? e dove posso settarla?","replies":[{"poster":"Chroniicles","date":"2017-06-21T16:14:04.313+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Parappapopo,realm=EUW,application-id=98NGV4Al,discussion-id=thJahUKP,comment-id=000200000000000000000000000000000000000000000000,timestamp=2017-06-21T11:34:42.776+0000)\n>\n> fatto e sembra essere tutto risolto! c`e` stato un momento che ho temuto per il mio pc ma ora e` tutto ok ^^. sto ancora testando chissa` che non esca qualche problemuccio nuovo.. \n> Cosa e` la sincronia verticale? e dove posso settarla?\n\nDai non è un'operazione così terribile per il pc :P\nLa sincronia verticale la trovi nelle opzioni grafiche del gioco ;)","replies":[{"poster":"Chroniicles","date":"2017-06-22T15:22:36.198+0000","up_votes":1,"down_votes":0,"body":"Allora è proprio come pensavo, le temperature si abbassano in contemporanea al calo degli fps perchè il pc va in protezione!\nNon usi una base raffreddante? Per lo meno riesci a tenere il pc un pelo rialzato?","replies":[]},{"poster":"Parappapopo","date":"2017-06-22T15:01:34.266+0000","up_votes":1,"down_votes":0,"body":"le temperature stanno sui 55 gradi a riposo 70 all avvio di lol e 95 gradi durante il gioco sfiora i 100 e invece 85 quando lagga","replies":[]},{"poster":"Chroniicles","date":"2017-06-22T13:27:45.885+0000","up_votes":1,"down_votes":0,"body":"Quei programmi, che io sappia, non hanno una scadenza. Forse si sono corrotti con l'aggiornamento a Win10, prova a disinstallarli con RevoUninstaller e poi, dal sito della Lenovo, riscaricali da capo... non dovresti avere problemi. One drive, peraltro, non è neanche esclusiva della Lenovo!\nIn Windows update, invece di cliccare su _Verifica disponibilità aggiornamenti, clicca su _cronologia aggiornamenti_ e controlla se ci sono installazioni non riuscite (in caso affermativo, posta qui il codice degli aggiornamenti).\n\nHai controllato le temperature? Su che valori viaggiano?","replies":[]},{"poster":"Parappapopo","date":"2017-06-22T13:14:43.932+0000","up_votes":1,"down_votes":0,"body":"Allora il sistema operativo mi dice che e` aggiornato e questo laptop partiva con win8.1 poi seguendo gli incessanti suggerimenti di win lo ho fatto diventare win10 (pessima idea).\nMa la cosa che forse piu` puo` influire sugli aggiornamenti secondo me potrebbe essere che non appena scaduta la garanzia tutte le app che mi sono state fornite dalla lenovo per monitorare le funzionalita` del pc hanno smesso magicamente di funzionare... tipo il risarmio energetico tipo il \"one key optimizer\" e il \"lenovo solution center\" oltre al \"one drive online\" e altri","replies":[]},{"poster":"Chroniicles","date":"2017-06-22T07:36:09.955+0000","up_votes":1,"down_votes":0,"body":"Negli ultimi log è rimasta quell'incongruenza che ti accennavo nel post sopra\nR3d Logs:\n> 000003.217| ALWAYS| -----HARDWARE INFORMATION START-----\n> 000003.217| ALWAYS| Operating System: **8  Home**, x64\n\nDxDiag:\n> ------------------\n> System Information\n> ------------------\n> ...\n> Operating System: **Windows 10 Home** 64-bit (10.0, Build 15063) (15063.rs2_release.170317-1834)\n\nHai più fatto qualcosa per sistemare gli aggiornamenti di Windows?\n\nInoltre vorrei provassi anche un'altra cosa: scarica [realtemp](https://www.techpowerup.com/realtemp/) e tienilo aperto mentre giochi, per monitorare le temperature che raggiunge il laptop... in caso aumentassero parecchio, il pc per \"proteggersi\" diminuisce il voltaggio delle componenti per abbassare la frequenza e produrre meno calore, di conseguenza le prestazioni vengono impattate in modo negativo. Queste cose purtroppo non vengono registrate nei log che mi hai passato e devi provvedere da solo a monitorarle!","replies":[]},{"poster":"Parappapopo","date":"2017-06-21T23:44:31.280+0000","up_votes":1,"down_votes":0,"body":"che cosa deprimente...\ncio mi sta allontanando di brutto da rankre..\nbrutta cosa.","replies":[]},{"poster":"Parappapopo","date":"2017-06-21T19:39:56.908+0000","up_votes":1,"down_votes":0,"body":"come non detto, ci risiamo! stesso lag dai 10 ai 15 min per 7/8 sec a fps03","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"AthlonX860","date":"2017-06-15T12:34:46.286+0000","up_votes":1,"down_votes":0,"body":"Ciao, ti consiglio di effettuare dei piccoli test per capire l'origine del problema:\nUsa lo strumento di allenamento;\nImposta LoL in modalità finestra ad una risoluzione più piccola del tuo schermo, e apri il Gestione Attività (ctrl+shift+esc) di windows a lato di LoL nella scheda Prestazioni (disattiva il client in partita). imposta il frame rate senza tetto, e  gioca per un 30 min;\nMentre giochi tieni sotto controllo la gestione attività, e se vedi che ad un certo punto il tuo disco rigido arriva sotto stress al 100% disattiva l'antivirus e riprova.\nse anche avendo disabilitato l'antivirus e chiuso tanti processi aperti non cambia controlla la tua connessione di rete.\nPS: tieni sempre aggiornata la scheda grafica e fai vari test con vari settaggi grafici","replies":[{"poster":"Parappapopo","date":"2017-06-15T14:21:29.715+0000","up_votes":1,"down_votes":0,"body":"come posso giocarci senza schermo intero? faceva cosi' anche prima di installare l'antivirus\n","replies":[{"poster":"AthlonX860","date":"2017-06-15T14:49:13.098+0000","up_votes":1,"down_votes":0,"body":"nelle opzioni di gioco una volta entrato in game, ma tanto per sapere che scheda grafica hai??\nse non è la cpu (confermi di avere spento ogni singolo processo in background??) e non sarà il disco rigido, a quel punto o è la connessione di rete, o la scheda grafica, oppure il sistema necessità un ripristino. \nPS controlla di non stare usando una sorta di risparmio energetico","replies":[{"poster":"Parappapopo","date":"2017-06-18T19:16:02.462+0000","up_votes":1,"down_votes":0,"body":"Amd radeon da 16 mb ram,\nconfermo,\nnessun risparmio energetico.","replies":[{"poster":"AthlonX860","date":"2017-06-18T21:59:59.953+0000","up_votes":1,"down_votes":0,"body":"16 megabyte??? spero tu ti stia sbagliando le ultime schede video da 16 mega erano del 2001, cmq dammi il modello esatto se possibile, magari è un piccolo bug dei driver basta confrontarlo e in base retrocedi con i driver","replies":[{"poster":"Parappapopo","date":"2017-06-19T12:15:17.661+0000","up_votes":1,"down_votes":0,"body":"Ma perche non posso inserirci una foto???????????? \ne` una AMD Radeon R7 M360 16 mb\nil pc e` un laptop","replies":[{"poster":"AthlonX860","date":"2017-06-19T14:02:23.564+0000","up_votes":1,"down_votes":0,"body":"devi usare siti esterni per inserire immagini nel forum, cmq allora scoperto il problema, http://support.amd.com/en-us/download inserisci qui la tua scheda grafica e scarica i driver stabili (non gli Optional), durante l'installazione non fare quella rapida, ma usa quella pulita, che cancellerà i vecchi driver buggati. ora io spero che sia un problema di driver ma se continua a dirti che hai solo 16mb allora ti si è bruciata la memoria video nel caso peggiore o in quello migliore windows si è buggato (e allora ti tocca ripristinare il pc)","replies":[]}]}]}]}]}]},{"poster":"Parappapopo","date":"2017-06-18T19:52:29.404+0000","up_votes":1,"down_votes":0,"body":"inoltre ora vedo sul task manager che c`e` un certo \"windows audio device graph isolation\" che chiede un bel po` di memoria per funzionare","replies":[{"poster":"AthlonX860","date":"2017-06-18T22:04:13.815+0000","up_votes":1,"down_votes":0,"body":"si è il motore di suono primario di windows, è isolato per mantenere la stabilità con driver di terze parti, per farla breve gestice l'audio ed è normale","replies":[]}]}]},{"poster":"Parappapopo","date":"2017-06-18T19:17:17.525+0000","up_votes":1,"down_votes":0,"body":"Aggiornato il bios ed ora e` ancora peggio: lagga di fps appena si entra in gioco, quando sposto oggetti nell` inventario e quando uso D o F","replies":[]},{"poster":"Mix lyc4n ","date":"2017-06-15T13:18:11.175+0000","up_votes":1,"down_votes":0,"body":"Hai cambiato schermo?","replies":[{"poster":"Parappapopo","date":"2017-06-15T14:20:07.280+0000","up_votes":1,"down_votes":0,"body":"no, gioco con un portatile ma ho fatto una prova attaccandolo ad un maxischermo = stessa cosa: lag ogni 20 min di 6/7 secondi a fps 02","replies":[{"poster":"Mix lyc4n ","date":"2017-06-15T14:59:20.368+0000","up_votes":1,"down_votes":0,"body":"Allora controlla se hai attivato qualche programma ad avvio automatico .\nE Cerca di pulire la ventola interna, probabilmente adesso che è estate, si surriscalda piu velocemente.","replies":[]}]}]}]}