{"poster":"KunoichiKonoha","date":"2019-12-29T21:54:30.049+0000","title":"No hay gente que no sea troll ?","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"pedi gente para jugar normales y me agrega gente que solamente entra y flamea, trolea y hasta se excusa en \" puntos de vista \"; no pido jugar con faker, pero minimamente que tengan logica en lo que hace o dice...alguien para jugar?? {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"SonaFortune","date":"2019-12-31T02:14:56.037+0000","up_votes":1,"down_votes":0,"body":"Es que gente como vos tambien llaman trolls a los que morimos por causas del juego, o que no hacemos la build recomendada para el campeon elegido","replies":[]},{"poster":"Frôm the deep","date":"2019-12-30T00:44:48.495+0000","up_votes":1,"down_votes":0,"body":"Hay gente que no es troll, pero en vista de que la gran mayoría de la comunidad es de lo peor, matematicamente hablando, es casi seguro que te toque a lo menos uno por partida.","replies":[{"poster":"KunoichiKonoha","date":"2019-12-30T21:55:36.568+0000","up_votes":1,"down_votes":0,"body":"no es eso, ejemplo....uno que era jungla fue a morir a mi linea regalando bufo rojo y volvio hasta que me saco 2 niveles el top enemigo...para peor perdio todas las lineas y no aceptaba el surrender por que segun el \" se podia ganar\" cuando teniamos tirado todo mid y bot, todos los dragonerdidos y para peor, te hacen perder tiempo {{sticker:zombie-brand-clap}}","replies":[{"poster":"Frôm the deep","date":"2019-12-31T00:45:58.947+0000","up_votes":1,"down_votes":0,"body":"Con mi comentario estoy apoyando lo que dices, o lo leíste mal o aun sigues molesto por el tema, en ambos casos te recomiendo desahogarte con algún amigo, porque aparentemente te hace falta. (Asumo que mi percepción puede estar errada) Ánimos! {{sticker:vlad-salute}}","replies":[{"poster":"KunoichiKonoha","date":"2019-12-31T01:16:40.779+0000","up_votes":1,"down_votes":0,"body":"si no te gusta que me descargue en mi publicacion, no comentes en mi publicacion, vuelvo a recalcar que ei publicacion, por si no se entiende, por que puedo hacer lo que quiera en ella, asi que en vez de querer humillar a alguien, primero plantea que la publicacion es para desahogarme, asi que si tienes tanto tiempo libre cosa que aparentemente tienes, no quieras decirme que hacer {{sticker:katarina-love}}","replies":[{"poster":"Frôm the deep","date":"2019-12-31T01:57:47.323+0000","up_votes":1,"down_votes":0,"body":"Me es indiferente el tema, no me gusta ni me disgusta, y así como eres totalmente libre de postear lo que quieras, yo soy libre de comentar lo que se me antoje, en ambos casos siempre y cuando cumpla las normas de la comunidad. \n\nPuedes marcarme donde te di una orden o en que frase te humille o trate de hacerlo? {{sticker:sg-lux-2}} \nNo se si entiendes el significado de estas dos palabras, pero ordenar y recomendar son cosas completamente diferentes.\n\nAhora bien, lo que hice fue exponer mi opinión: Hablar con un amigo es más sano y reconfortante que hacerlo en un foro de un juego. Entiendo y acepto que te pueda gustar mas al revés y obviamente puedes pasar de mi recomendación, puedes hacer lo que se te pegue en gana, a mi no me importa, y a nadie mas del foro le interesa, así mismo como a ti te valga menos que nada mi opinión y demás.\n\nP.D: Entre el trabajo y la universidad apenas y tengo tiempo para respirar {{sticker:sg-ahri-1}} \nNo obstante, el poco tiempo libre que tengo me gusta perderlo dentro del juego o en el foro, cosa que se puede corroborar con mi actividad del foro, soy activo un par de días y luego no me ves en meses. {{sticker:slayer-jinx-wink}}","replies":[]}]}]}]}]},{"poster":"VenganceZ","date":"2019-12-30T04:26:50.290+0000","up_votes":1,"down_votes":0,"body":"Mmm no, trolear es una droga, una vez que empezas ya no hay vuelta atrás (Salvo el permaban que te hace recapacitar) pero es literal como la tentación te dice (llévalo AP, llévalo crítico, llévalo letalidad)  y estás jugando un champ medio tank y decís \"no, tengo que jugarlo como se debe\" y otra voz en tu mente dice \"pero mira, está habilidad escala con 100% de AP\" y vos cómo... 100% de AP!!!!! Venga ese (inserte item de AP preferido aquí)","replies":[]},{"poster":"WhiteMax","date":"2019-12-30T00:49:40.693+0000","up_votes":1,"down_votes":2,"body":"Agrega y vemos un dia. No soy troll, pero tampoco soy faker. Juego decente pero no esperes que carree.","replies":[]}]}