{"poster":"Caje12","date":"2017-01-02T15:18:31.264+0000","title":"ADCs S7","subforum":"Champions & Gameplay","up_votes":1,"down_votes":3,"body":"Hallo, ich spiele derzeit gerne Ashe, weil ich sie relativ cool finde. Allerdings kann es doch nicht sein, dass mich ein Kha Zix der 2 Level unter mir im 1v1 t&ouml;ten kann, oder ein Yasuo mit 1/4 leben mich und Lux t&ouml;ten kann und ich erst ann&auml;hernd so viel Shaden wie der midlaner mache wenn ich 3 Items habe. Mich trifft ein Yasuo Wirbelwind und ich hab halbe Leben usw, usw .\nIch finde es RICHTIG SCHEISSE.  RIOT MACH DOCH WAS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Ohne 20000000 Flashes kommst du icht Lebend irgendwo raus als adc, ich finde es sollte demn&auml;chst z.B ein Item f&uuml;r adcs geben mit welchem sie ihr Lauftempo erh&ouml;hen k&ouml;nnen und ein biissschen was zum Tanks Kaputtmachen kriegen (ein Maokai\nmit Gauntlet und 2 Rüstungen kommt (etwa 150 Armor) und einem Rod of Ages kommt, macht seine ulti, w,q und ich bin fast tot w&auml;hrend er mit einem Autoattack 150 Schaden bekommt.\n\nLg Caje macht BITTE ETWAS \n\nEdit: Danke für die Hilfreichen Antworten.\n\nedit2: Was kann ich gegen Hecarim machen, der mich oneshotted aber selber utra Tanky ist?","replies":[{"poster":"Alânte","date":"2017-01-02T16:11:36.657+0000","up_votes":3,"down_votes":0,"body":"Playing Adc in 2017 xd","replies":[]},{"poster":"Supportsmanlike","date":"2017-01-02T16:07:24.026+0000","up_votes":3,"down_votes":0,"body":"Meine ADC's haben komischerweise nie diese Probleme.\n\n1. Ja ein Kha'zix killt dich im 1 vs 1, Überraschung, wer hätte es gedacht? Das ist nunmal das wofür er gedacht ist.\n\n2. Es gibt Items mit denen du deinen Movementspeed erhöhen kannst: \n{{item:3006}} {{item:3046}} {{item:3142}} {{item:3139}} {{item:3153}} {{item:3094}} \n\n3. Noch mehr zum Tanks kaputt machen? Reichen 45% Bonus Armorpen noch nicht?\n{{item:3036}} {{item:3033}} \nDann hol dir {{item:3153}} \n\n4. Du hast noch 4 andere Teammates.","replies":[]},{"poster":"Noru Dali","date":"2017-01-03T21:12:07.650+0000","up_votes":2,"down_votes":0,"body":"Ich denke das problem ist ashe.\nEinfach zu spielen und extrem schwer zu meistern.\nAshe ist der movementgünther der ADCs.\nAls zac spring ich die an. Q ,W und ult noch en smite und die is futsch.\nMit malphite ähnlich.\nADC und vor allem ashe braucht einen sehr guten supporter.","replies":[]},{"poster":"Rv Sabo","date":"2017-01-02T21:57:16.041+0000","up_votes":1,"down_votes":1,"body":"Lustig wie mal wieder alles Leute im Forum schreiben die noch nie Adc gespielt haben. Habt ihr mal daran gedacht wie lange es dauert bis man diese so genannten 4 oder 5 Items hat?????? Da sind 90% der Spiele schon gelaufen. Aber naja für die solo Laner ist es wohl in Orndung wenn sie Adcs einfach abfarmen.","replies":[{"poster":"OT Riku","date":"2017-01-03T10:09:35.733+0000","up_votes":1,"down_votes":0,"body":"Wir sprechen hier über die Theorie, in der Praxis fließen noch viel mehr Dinge ein.\n\nAssasine>Adc\nAdac> Tank\nTank>Assasine \n\nDu scheinst zwar zu wiSsen wovon du sprichst, aber ist ja nicht so das es Adcs gibt die mit dem 1. Item schon ihren powerspike haben.\nWenn die Spiele alle schon um Minute 30 rum fertig wären, dann würden derzeit kaum lategame adcs gespielt werden aber in Wirklichkeit kommt es mit anders rum vor.","replies":[{"poster":"Rv Sabo","date":"2017-01-03T19:18:50.072+0000","up_votes":1,"down_votes":0,"body":"> Assasine&gt;Adc\n> Adac&gt; Tank\n> Tank&gt;Assasine \n\n2mal lagst du richtig aber Adcs sind nicht besser als Tanks. Adcs sind erst besser wenn du Lord Dominks hast und dieses Item bringt dir nichts wenn du nicht genug Dmg und As hast. Somit kannst du Dominiks erst kaufen wenn du IE die ausgebauten Schuhe und ein As Item hast. Umgerechnet sind dass 10k Gold wobei einem noch lifesteal fehlt und wenn ein Hecarim auf einem zuläuft überlebt man dass auch nicht wenn er ein bisschen gefeedet ist. Dann hat man aber erst 50% Crit was dich wiederum schwach gegen Assasinen macht. \nFakt ist einfach dass man erst richtig carrien kann wenn man full build ist und die meisten spielen enden schon bei Minute 30.","replies":[{"poster":"OT Riku","date":"2017-01-03T20:31:53.389+0000","up_votes":1,"down_votes":0,"body":"Wie ich oben erwähnte in der Theorie Adc>Tanks, wie es in der Praxis aussieht wissen wir alle.","replies":[]}]},{"poster":"Caje12","date":"2017-01-03T19:06:03.451+0000","up_votes":1,"down_votes":0,"body":"WIe so Pokemon XD","replies":[]}]}]},{"poster":"IIIPinkGuyZedIII","date":"2017-01-02T22:02:47.644+0000","up_votes":1,"down_votes":0,"body":"Ich persönlich finde das crit mittlerweile zu wichtig ist ich meine so viele gehen richtig spät auf maw qss ga steraks hauptsache man hat ganz viel krit was am ende sowieso erst lategame stark ist. (meine Empfehlung utility items wie qss steraks besser für adcs machen)","replies":[]},{"poster":"0815xand0r","date":"2017-01-02T15:38:07.218+0000","up_votes":1,"down_votes":0,"body":"Assassinen töten ADCs (allgemein Squishies). Dafür gibt es sie. Dass ein Kha dich also tötet, gerade im Early-Game ist so gewollt. Was die Tanks angeht, da ist es eigentlich andersrum, als ADC solltest du da weniger Probleme haben (zumal die meisten Tanks von dir gekitet werden können, vor allem mit Ashe und ihren Slows).\n\nUnd ja, ADCs machen erst mit 3 oder 4 Items wirklich Schaden, da ihre Itemization extrem auf Synergien aufbaut, d.h. das Zusammenspiel von AD, AS und Crit ist wichtig. Dann machen ADCs aber auch ziemlich viel Schaden und das konstant.","replies":[{"poster":"Caje12","date":"2017-01-02T18:19:26.441+0000","up_votes":1,"down_votes":0,"body":"Naja hab grad ein Game gegen Jayce gespielt gehabt und Annie, da kommste nicht weg :/","replies":[]},{"poster":"Megamaexx","date":"2017-01-02T16:06:06.012+0000","up_votes":1,"down_votes":0,"body":"Kiten geht auch nur bedingt. Malphite Ulti nimmt so eine Ashe aus dem Leben. Hab so schon mal einen Fight unterm Turm verloren. Malphite hatte Iceborn und hat mich und den Turm fast 10 Sekunden getankt, bevor er mich dann doch mal tot hatte. Naja, zumindest hat er mich nicht geburstet xD","replies":[]}]},{"poster":"Megamaexx","date":"2017-01-02T16:07:20.354+0000","up_votes":1,"down_votes":0,"body":"ADCs brauchen eine Zeit, bis sie Schaden machen. Gegen Assassinen braucht man peel, gegen Tanks benötigt man die richtigen Items. Blade of the ruined king und last whisper helfen.","replies":[]}]}