{"poster":"TBW Cursed","date":"2019-02-26T15:12:37.788+0000","title":"Dia4/Plat1 Jungler Sucht Platin+ Team","subforum":"Clans & Teams","embed":{"description":"xSooB / Diamond 4 0LP / 60W 41L Win Ratio 59% / Jarvan IV - 13W 5L Win Ratio 72%, Sivir - 10W 6L Win Ratio 63%, Ivern - 7W 2L Win Ratio 78%, Lucian - 6W 2L Win Ratio 75%, Nunu & Willump - 6W 2L Win Ratio 75%","url":"https://euw.op.gg/summoner/userName=xSooB","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":1,"down_votes":0,"body":"Hallo Beschwörer,\nwie der Titel des Posts schon sagt suche ich ein aktives Team und würde dann als Jungler fungieren.\n\nWas es zu meiner Wenigkeit zu sagen gibt:\n\n    20 Jahre alt\n    Dia4/Platin1 (last Season Plat3) in Flex bin ich atm gold4\n    No flame\n    Kritikfähig\n    Spiele League seit Season 4-5 und bin Main Jungler seit 1 Jahr davor war ich eher ein Allrounder\n    Habe etwas Turniererfahrung gesammelt\n    Vom Championpool ausgesehen habe ich einen sehr großen Championpool über Tanks AD/AP Fighter\n    am liebsten Spiele ich atm : Nunu J4 Olaf Gragas Sejuani Ivern Zac Warwick\n    Spiele eher für's Team anstatt alleinsinnig nur für mich \n\nWas ich suche:\n\n    Platin+\n    Kritikfähigkeit\n    No Flame\n    Ernste Vorgehensweise beim Teamplay\n    Den Willen sich zu verbessern\n    Aktive Member\n\nWenn mein Post dein Interesse geweckt hat, dann adde mich einfach Ingame.\n\nMFG xSooB","replies":[{"poster":"The White Judge","date":"2019-02-26T15:33:06.477+0000","up_votes":1,"down_votes":0,"body":"Hey, \nwir sind gerade auf der Suche nach einem Jungler!\nBin der Felix, maine ADC und auch 20 Jahre alt.\nUnsere derzeitige Elo (außer mir 😅)\nliegt zwischen Diamond und Platin.\nHabe nach 5 Jahren Pause wieder angefangen (Season 4 war ich Platin 1) und ein guten Mate für die Botlane gefunden. Mit ihm zusammen versuchen wir uns jetzt am Teamaufbau!\nWir suchen noch für heute Abend 18 Uhr einen Jungler für Tryouts.\nDeine Beschreibung deiner Suche passt sehr genau zu uns. Ziel ist es ein langfristiges, motiviertes Team zu bilden, dass an Trunieren teilnimmt und regelmäßig trainiert.\nSelbstkritik (Analyse von Spielen) und allgemeine Kritigfähigkeit wird bei uns hoch geschätzt. Wir wollen uns als Team verbessern und somit auch die Positionen des Einzelnen stärken.\n\nWenn dein Interesse geweckt ist, können wir ja in lockerer Atmosphäre heute Abend ein paar Spiele machen und gucken ob es beidseitig stimmig ist :)\n\nWürde sich später mal hinzufügen!","replies":[]}]}