{"poster":"FakerBoostedMe","date":"2017-02-17T13:20:25.859+0000","title":"@L4T3NCY URF and ARURF","subforum":"Gameplay","up_votes":4,"down_votes":2,"body":"Posting this here since I don&#039;t have PBE acc (and this is my NA acc, I&#039;m EUNE main).\r\n\r\nYou &quot;justified&quot; the delay to bring back URF and make into ARAM by &quot;getting stale too quickly, same champs... etc&quot;. So, ARURF came and totally ruined the mode.\r\n\r\nFun modes aren&#039;t supposed to be &#039;healthy&#039; or &#039;balanced&#039; or anything like that. Fun is something totally subjective. I for example may wanna spam Jayce in URF to go fire at will level 2 after getting too tilted from normal/ranked. I saw many people being frustrated for the change and rightfully; you did something without asking anyone&#039;s opinion and totally ruined something so great as URF.\r\n\r\nBy the nature of this mode, not all champs are good for it-like all the special modes. For example, yeah, Garen can keep spinning non stop but that is no good vs a full poke and cc heavy team. End result is, most games leave you with a negative experience in a mode that supposedly is for fun. Since you have no control of what you&#039;ll play. That&#039;s why I avoid modes like One for All and Nemesis Draft. Don&#039;t make me ditch URF too- or make a &#039;special URF only account&#039; with only the champs I wanna play there (I think many are considering this).\r\n\r\nIn the very least, you could do the following: make 2 separate queues. One with good-old, well-known and beloved URF and one with this (censorship) ARURF and see which gets played the most. You did that with Doom Bots recently so you can&#039;t go with &quot;2 queues is too heavy&quot;. Unless you know already which way the overwhelming majority will go thus revealing ARURF for what it is.. a !@#$%^&amp;*","replies":[{"poster":"GeminiRune","date":"2017-02-17T14:15:31.977+0000","up_votes":1,"down_votes":3,"body":"You're basically asking for the same game mode without random element. The difference between Teemoing and Gauntlet was that there was a difficulty selection built directly into the game. It was the same game nonetheless. \n\nL4T3NCY even stated at the start of the PBE Cycle its reason to bring back AR over standard. But maybe you did forget the part where he states \"_meta would set in, and there was also some pretty unhealthy play patterns._\" The game mode would literally become a pseudo Practice Tool or just a means for someone to say, \"_I'm a master on this champion_\" when the player probably hasn't even touched the champion in a normal game recently whatsoever.","replies":[{"poster":"FakerBoostedMe","date":"2017-02-18T10:43:44.521+0000","up_votes":3,"down_votes":1,"body":"^ NA post.\n\nI remember very well what he said. Which part of 'fun mode not being fun anymore because AR ruins it' you didn't get exactly?","replies":[{"poster":"VivaLaKitten","date":"2017-02-18T17:04:08.889+0000","up_votes":1,"down_votes":0,"body":"please just be nice to the people who ask for \"balance\" in a \"video game\" that's not even in \"ranked\" meant for having \"fun\" \n:/","replies":[]},{"poster":"GeminiRune","date":"2017-02-18T16:54:34.299+0000","up_votes":1,"down_votes":2,"body":"The part where you complain about it. Also what ever do you mean by \"NA Post?\" Is it because I'm telling you what you don't want to hear? Your suggestion pleases you. If you want me to agree with you and your logic, I'm not going to do that with the way you worded your grievances","replies":[]}]}]},{"poster":"VivaLaKitten","date":"2017-02-18T17:02:13.276+0000","up_votes":1,"down_votes":0,"body":"YES PLEASE\nthank you for posting this :P\nRiot needs to know people want normal URF","replies":[]},{"poster":"Oleandervine","date":"2017-02-17T13:39:36.464+0000","up_votes":1,"down_votes":3,"body":"Fun modes are intended to be fun. But it's not fun if you know you will get 100% destroyed by the URF meta for not playing any champion who isn't Hecarim, Urgot, Evelynn, Riven, Maokai, or Katarina.","replies":[]}]}