{"poster":"MasterPlayer1460","date":"2016-04-12T19:57:09.374+0000","title":"Welcher champ passt zu mir?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hi\r\nWollte mal fragen welcher champ zu mir passt\r\nKriterien :\r\nEtwas tank\r\nSp&auml;ter egal ob gut oder schlecht gespielt im Late game stark \r\nViel angriffschaden","replies":[{"poster":"Shadowscreen","date":"2016-04-14T08:17:24.659+0000","up_votes":1,"down_votes":0,"body":"Azir - Stab der Zeitalter + Rylais (+ Zhonyas) machen dich tanky    und dein Schaden im lategame ist einfach nice {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"StillYasuoMain","date":"2016-04-14T08:13:18.629+0000","up_votes":1,"down_votes":0,"body":"Shyvana, Master Yi(mit titan hydra), illaio, nasus, garen, trundle\n\nDu findest sie auch unter der Kategorie \"Kämpfer\" ;)","replies":[]},{"poster":"Tungsteel","date":"2016-04-13T12:40:34.961+0000","up_votes":1,"down_votes":0,"body":"**Nasus **- Stacken, stacken, stacken. Du hast guten Sustain und hälst schon etwas aus, machst aber auch ordentlichen Schaden. \n**Garen **- Tanky, macht durch seine Bösewicht-Mechanik aber ordentlichen Schaden. \n**Gnar **- tanky, guter Schaden, ranged und melee Form, kann durch seine CC im Lategame auch Teamfights entscheiden\n**Jax **- sehr hoher Schaden, bekommt durch seine Ulti Resistenzen, wenn er AD oder AP baut\n**Kayle **- nicht direkt tanky, aber du hast 2.5 Sekunden unverwundbarkeit und einen Heal. Ranged und sehr hoher Schaden im Lategame\n**Trundle **- Tanky und Damage, stiehlt Gegnern AD, stiehlt Gegnern Resistenzen\n**Mundo **- Guter Schaden, im Lategame extrem schwer zu töten, da er so tanky ist. Er macht trotzdem ordentlich viel Schaden\n**Olaf **- Tanky und guten Schaden\n**Shyvana** - macht guten Schaden und ist trotzdem tanky","replies":[]},{"poster":"ninju7su","date":"2016-04-13T05:56:52.942+0000","up_votes":1,"down_votes":0,"body":"{{champion:17}} \nDieser kleine B * * * * * d passt immer und überall.","replies":[]},{"poster":"TerrorRaven","date":"2016-04-12T20:02:47.106+0000","up_votes":1,"down_votes":0,"body":"Spontan fällt mir Poppy ein. Durch ihre W Passive besonders Tanky, hat einen guten Grundschaden (ihr Q macht sogar prozentualen Schaden), braucht teilweise nicht einmal ein offensives Item für unmenschlichen Schaden und sie den coolsten Disengage im gesamten Spiel. Lediglich Trundel macht ihr große Probleme.","replies":[]},{"poster":"RM Heartmeander","date":"2016-04-12T20:02:34.726+0000","up_votes":1,"down_votes":0,"body":"Illaoi wäre einer.\nExtem viel Schaden und wird tanky gespielt.\nAber du kannst nicht erwarten dass ein Champ extem stark ist im Lategame wenn du ihn scheisse spielst.\nAnsonnsten spiel Nasus.\nDa musst du nur stacken und tanky bauen.\nAber es ist egal welcher Lategamechamp du spielst wenn du im early scheisse spielst wirst du auch im Late nicht viel reissen können.\nAnsonnsten Olaf, Jax, Irelia.","replies":[]},{"poster":"PenobertLP3","date":"2016-04-12T20:08:27.737+0000","up_votes":1,"down_votes":1,"body":"Darius Garen  oder voli im jun","replies":[]}]}