{"poster":"Jonshi","date":"2015-05-24T00:13:58.696+0000","title":"[Aporte] Una solucion al lag en League of Legends (o por lo menos para reducir los ping spikes)","subforum":"Problemas Técnicos","up_votes":3,"down_votes":1,"body":"Buenas noches, invocadores.\r\nEstuve navegando por los foros de LAS (inventen sigla creativa para LAS), y me encontre con varios posts donde mucha gente tenia problemas con su conexion entre el server y su computadora. Algo que me parecio raro, ya que YO no tengo lag (digo YO porque tengo Speedy 1 Mbp y anda mas o menos bien, si aclaramos que estoy en una zona a 100 km de una ciudad). \r\nY aca es donde muestro porque no tengo lag.\r\n\r\n**__**\r\n**1- DNS de Google**\r\n\r\nAlgo que, si bien es una solucion clasica para el lag, sirve por motivos muy simples:\r\n&gt; Las DNS (Sistema de Nombres de Dominio) utilizan una base de datos distribuida y jer&aacute;rquica que almacena informaci&oacute;n asociada a nombres de dominio en redes como Internet\r\n\r\nLas DNS de Google son:\r\n8.8.8.8\r\n8.8.4.4\r\n\r\n**__**\r\n**2- Reglas de entrada y salida**\r\n\r\nLas reglas de entrada y salida llegaron a ser configuradas a mi pc gracias al problema de &quot;Se ha encontrado un problema con el servidor. Esto se debe a un bloqueo del cortafuegos... (etc)&quot;, aun teniendo el firewall de Windows y del antivirus desactivado. \r\nEsto lo solucione asi (Cito de un post que encontre en Taringa!):\r\n1: Lo primero que haremos es ir a Panel de control -&gt; Sistema y seguridad -&gt; Firewall de Windows y en la columna izquierda clickeamos [ Configuraci&oacute;n avanzada ] \r\n\r\n2: En la columna del mismo lado iremos a Reglas de entrada y en la columna derecha clickeamos en [ Nueva Regla ] \r\n\r\n3: Se abrir&aacute; una ventana, lo primero que pregunta es de qu&eacute; componente se trata la nueva regla, aseg&uacute;rate de tickear la opci&oacute;n [ Programa ], le dan a siguiente. Luego nos preguntar&aacute; la ruta del programa y pinchamos en [ Examinar ]. La ruta a buscar es: C:/Riot Games/League of Legends/lol.launcher.exe Le dan a [ Abrir ] y pinchan siguiente \r\n\r\n4: Tickean en [ Permitir la conexi&oacute;n ] y le dan a siguiente \r\n\r\n5: Ahora deben marcar las 3 opciones [ Dominio ], [ Privado ] y [ P&uacute;blico ] y luego siguiente \r\n\r\n6: Ahora le ponen de Nombre el juego para que no se les pierda en el sistema  \r\n\r\nAhora se debe repetir el proceso en las 4 rutas siguientes: \r\n\r\nC:/Riot Games/League of Legends/RADS/system/rads_user_kernel.exe\r\n\r\nC:/Riot Games/League of Legends/RADS/solutions/lol_game_client_sln/releases/0.0.1.7/deploy/League of Leguends.exe\r\n\r\nC:/Riot Games/League of Legends/RADS/projects/lol_air_client/releases/0.0.1.70/deploy/LolClient.exe\r\n\r\nC:/Riot Games/League of Legends/RADS/projects/lol_launcher/releases/0.0.0.199/deploy/LoLLauncher.exe\r\n\r\n\r\nLuego de esto debes ir atr&aacute;s y hacer exactamente lo mismo con las mismas rutas en [ Reglas de salida ] \r\n\r\n*Los slash los puse al rev&eacute;s (Taringa no me deja ponerlos bien) asi que no copien la ruta directamente. \r\nLos n&uacute;meros en negrita son aleatorios, es decir, van a cambiar seg&uacute;n el LoL de cada uno (versi&oacute;n). \r\n\r\nCon esto no deber&iacute;a salirse m&aacute;s el lol en plena carga y tirarle ese error, adem&aacute;s soluciona varios errores mas in-game que ten&iacute;an que ver con esto. \r\n\r\nY hasta ahi! Nos vemos!","replies":[]}