{"poster":"YRayleigh","date":"2017-06-14T17:21:59.627+0000","title":"MI SONO ROTTO I 3/4","subforum":"Discussioni generali","up_votes":2,"down_votes":12,"body":"NON &egrave; POSSIBILE CHE OGNI VOLTA PER I VOSTRI PROBLEMI DI ACCESSO ALLE PARTITE IO MI DEBBA BECCARE UN BAN DA 5 PARTITE E PERDERE PURE 20 LP NON &egrave; POSSIBILE!!!!!!!!!!!!!!!!\r\nFATE QUALCOSA E SE AVETE QUESTI PROBLEMI ALMENO LEVATE IL BAN PORCA DI QUELLA TEEMO{{champion:17}} {{summoner:31}} {{item:3070}} {{item:3070}} .","replies":[{"poster":"Ser Nalor","date":"2017-06-15T00:18:45.434+0000","up_votes":3,"down_votes":0,"body":"ragazzi, credo di voler spezzare una lancia a favore del malcapitato... ok perdere gli lp ma sulle penalità bisognerebbe toglierle o non darle se i problemi sono del client, di LoL o della RIOT (ovviamente verificare che sia questo e non problemi di linea o del pc del tizio)\nche poi sia preferibile non fare rank è a discrezione sua ma doversi beccare code a bassa priorità, ban ecc è fastidioso e molto poco spronante a dare fiducia al gioco e a chi c'è dietro.\nche poi, se avesse fatto lo stesso in normal e lo avessero reportato per afk, avrebbe ricevuto comunque ban e sanzioni. \nper cui non sono le ranked il problema.","replies":[]},{"poster":"Jon Moxley","date":"2017-06-14T17:38:17.516+0000","up_votes":4,"down_votes":2,"body":"E tu che ranki quando c'è un avviso grosso con un punto esclamativo in giallo che dice che ci sono problemi di accesso e decidi di rankare proprio oggi.. Farti due domandine?","replies":[{"poster":"Eye of Kraken","date":"2017-06-14T20:06:26.523+0000","up_votes":3,"down_votes":4,"body":"Perchè dovrebbe smettere di rankare, questa mi è nuova, allora visto che le ranked andrebbero evitate, perchè non disattivarle? No sense ragionamento","replies":[{"poster":"Jon Moxley","date":"2017-06-14T21:21:05.110+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=TSM RektByIllaoi,realm=EUW,application-id=MJVj50Jw,discussion-id=P03K1Tg4,comment-id=00000000,timestamp=2017-06-14T20:06:26.523+0000)\n>\n> Perchè dovrebbe smettere di rankare, questa mi è nuova, allora visto che le ranked andrebbero evitate, perchè non disattivarle? No sense ragionamento\n\nAmico mio, scusami eh.. Ma quel punto esclamativo giallo sta proprio a dirti \"occhio! ci sono problemi, stiamo risolvendo\" se tu cominci una ranked, lo fai consapevole che ci sono dei problemi, quindi te ne assumi la responsabilità","replies":[{"poster":"Eye of Kraken","date":"2017-06-15T11:04:52.026+0000","up_votes":2,"down_votes":1,"body":"Guarda io nemmeno l'ho visto ieri e comunque anche in caso, avrei comunque giocato ranked, frega poco i probemi, tanto con la connessione che ci ritroviamo qui in Italia tanto vale no? Certo che poi lamentarsi è stupido ma anche dire \" se ranki mentre ci sono problemi sei un coglione\" è da stupidi.","replies":[{"poster":"HaIIeIujah","date":"2017-06-15T11:11:24.573+0000","up_votes":2,"down_votes":1,"body":"Oserei dire che la forma corretta è \"Se ranki quando sai che ci sono problemi _e poi ti lamenti sul forum_ sei un idiota\"  , allora : V","replies":[{"poster":"YRayleigh","date":"2017-06-24T16:19:15.831+0000","up_votes":2,"down_votes":0,"body":"PURE OGGI è CAPITATO DI NUOVO, E PER GIUNTA SI METTE PURE A FARE I DOWNOAD DA SOLO INVECE DI CARICARE LA SCHERMATA CON I CHAMPIONS, guarda caso il download dura giusto il tempo di far fare a gli altri il rewark (giustamente). Ditemi voi se non è una presa per il culo. Voglio proprio vederelo sto segnale con i problemi di accesso.\nROAD TO WOOD!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nrewark, rework, relavoro: le correzzioni grammaticali tenetevele per i vostri alunni","replies":[]}]}]}]}]}]},{"poster":"Jeanne dˆArc","date":"2017-06-14T17:42:22.524+0000","up_votes":4,"down_votes":2,"body":"C'è il segnale d'avviso sia sul sito che sul client, che informa dei problemi d'accesso. Se decidi di giocare, per giunta ranked, lo fai a tuo rischio e pericolo. Quindi se perdi i punti e ti becchi la penalità, è affar tuo perché nessuno t'ha obbligato a startare un game.","replies":[]}]}