{"poster":"Hethalean","date":"2016-06-03T21:43:06.892+0000","title":"Key fragment Question","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"Should your first key fragment of the month (if it is the 3rd fragment of a key because well it's super super hard to finish more than 2 keys in a month unless you spam games) be really hard to get?  Especially if the 'chance resets'.  It feels like if it is your 3rd fragment.  It's harder to get to start.\r\n\r\nKey fragments for hextech\r\nMonth 1: 1 game (1st frag in a key)\r\nMonth 2:  2 games (1st frag in a key)\r\nMonth 3: 5+ games since I haven't even earned it yet (3rd fragment in a key)\r\n\r\nHas anyone else noticed this?  I know 3 months is a low sample size, but to jump from 2 games to 5 is a high one especially since watching how it goes up and up after every fragment.... Almost makes me wonder if I do the 50 wins like last month.  Will I even get 1 key?","replies":[{"poster":"dArtagnan","date":"2016-06-04T00:37:02.345+0000","up_votes":3,"down_votes":0,"body":"Keep in mind that key fragment chances are based on when you first receive a key fragment.  From then on, your chances resets roughly every thirty days after you earn your first key fragment.  So depending on WHEN you get your first key fragment after the reset, it depends on how long into the month it will take to earn another one.  You can learn more about this in our [Hextech Article](https://support.riotgames.com/hc/en-us/articles/207884233).\n\nI hope this helps!","replies":[{"poster":"ADCsBabysítter","date":"2016-06-05T13:20:05.606+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=dArtagnan,realm=NA,application-id=osqw6G4M,discussion-id=hyil2Nvk,comment-id=0001,timestamp=2016-06-04T00:37:02.345+0000)\n>\n> Keep in mind that key fragment chances are based on when you first receive a key fragment.  From then on, your chances resets roughly every thirty days after you earn your first key fragment.  So depending on WHEN you get your first key fragment after the reset, it depends on how long into the month it will take to earn another one.  You can learn more about this in our [Hextech Article](https://support.riotgames.com/hc/en-us/articles/207884233).\n> \n> I hope this helps!\n\nCan we have a timer for this or something. Cause I have no idea when i first received my fragment... I mean there is a timer for everything else","replies":[]},{"poster":"EvilMerodach","date":"2016-06-04T18:29:39.497+0000","up_votes":1,"down_votes":0,"body":"Have a question about that.\nI think I heard somewhere that eventually the rate will drop to 0% when you've earned enough keys to open all the boxes you've gotten/could have gotten that month, then reset.\n\nDoes that mean if you collect boxes one month, but then don't have enough time to get all the keys for them, when your key frag chance resets, do you just lose out on getting keys for the boxes you didn't get keys for, or is there still a chance, just very diminishing returns for it?\n\nCause so far I've kept up with my boxes really well, but haven't had time to play enough to collect keys. And feel like the rate is just resetting so I can keep getting keys for new boxes as their timer goes up, but I don't feel like I could ever catch back up to the old ones I missed out on.\n---\nTL;DR: I have 6 boxes to open, and 1 key frag to open them with. If I grind a LOT of games, could I eventually get enough keys for them? Or all the 'old' ones from before key% reset just lost in the void?","replies":[]},{"poster":"MrPharmD","date":"2016-06-04T01:13:42.490+0000","up_votes":1,"down_votes":0,"body":"Hi.","replies":[]},{"poster":"Hethalean","date":"2016-06-04T01:12:57.436+0000","up_votes":1,"down_votes":0,"body":"OK, that makes sense.  I can't remember where I read it but I thought it said somewhere monthly.  I took this to mean that it'd reset at the beginning of the month.  It makes more sense this way since first win of day depends on when you last got it.  Your hextech cubes recharge based on when you first got yours (or if you went back up to 4, when the first time you got a chest after then).  Feels more Riot standard.  Thanks for the info.  That really helps out a lot.","replies":[]},{"poster":"Abigar15","date":"2016-06-04T04:07:00.300+0000","up_votes":1,"down_votes":1,"body":"so in a game i was playing i got an S+ ranking with a champion and i didn't get a key or a chest, i do not believe that is fair to a player who tried his/her best with a champion and not receive any chest or key. This has happened to me before and do not think it is fair. if you can please do something about it that would be very kind of you because not being able to get anything even though i did really well in a game is very frustrating.","replies":[]}]},{"poster":"Lew","date":"2016-06-04T00:18:23.418+0000","up_votes":2,"down_votes":0,"body":"I think it is actually a ~30 day cycle based on when you first got a key fragment, not that it resets at the start of every month.","replies":[{"poster":"Hethalean","date":"2016-06-04T01:13:41.184+0000","up_votes":1,"down_votes":0,"body":"Ah, cool, I think I misinterpreted something somewhere.  It makes more sense that way then 1st of month because of how First Win of Day works, and how the Hextech Chests recharge.","replies":[]}]}]}