{"poster":"Erøse","date":"2016-07-15T14:10:37.542+0000","title":"How I Climbed Out Of Bronze!","subforum":"Gameplay & Strategy","up_votes":4,"down_votes":1,"body":"I was bronze 3 at the start of the season and right now I am sitting at silver 3 and climbing, it took me a total of 126 games to climb to silver 3 with a winrate of 53%. I was sitting at 42 winning to 52 losses before I started changing my gameplay. Before I get started I would like to mention this youtube channel who has helped me climb: https://www.youtube.com/channel/UCusLiagMahN3-N2PeatcxNQ\n\nSo here are my tips:\n\n1. Play Smart: This might be one of the most basic things in league of legends but based on my experience, bronze players just engage whenever they want to and not considering whether the enemy&#039;s summs/abilities is on cd etc.  They also need to know their champion&#039;s capabilities like if they can trade with their lane opponent and come out victorious.\n\n2. Building Pattern: Bronze players tend to think that just because your build last game worked means it would work this game, I had a game with a zed who was 0/3 in lane against ahri and he still persisted to build a youmus instead of a maw. You guys should build depending on the situation and not carrying on from the previous game.\n\n3. Attitude: Yes! You all heard of this before and i&#039;m pretty sure you guys are sick of hearing it but honestly, this is one of the most important things you need to climb in league of legends. Bronze players think that their team is the one preventing them from climbing when infact it&#039;s themselves. I used to have a bronze mentality and I decided that it was not the team and it was me, so I started watching my own replays and see my mistakes and what I could improve on, ever since I started doing that i saw a stable climb and was winning like 10 games and losing like 2 games. I mean, you can give a pro player a full bronze team and they would carry, you ask why? That&#039;s because they know what to do to win the game and when to do necessary things.\n\n4. Practice: You do not practice in norms because norms is like a mode where everyone goes to, to fuk around, you have  to ranked to practice your mechanics, shot calling and the game in general.\n\n5. /mute all: I don&#039;t know about you but I do not want any negativity in my game. Like if you die because of a stupid mistake and your support morgana starts flaming &quot;OMG THIS SIVIR IS SO SH*T&quot; ... &quot;Sivir FU*K YOU AND YOUR FAMILY&quot; etc. First thing in the game is just to type /mute all and carry on with the game. The more negativity there is, there more you respond to it, the more you get upset, the more you get tilted...the more you LOSE.\n\n6. Just have fun: Some people take ranked too seriously like as if it is life threatening and they make the atmosphere kinda like &quot;MAKE NO MISTAKES OR I KILL YOU&quot; and makes everyone in their team nervous which leads to making dumb mistakes. I like to play ranked by laughing at my silly mistakes and then learning from it. Like seriously, when I was bronze I used to take ranked like it was my LIFE and there was many occasions where I could have stolen baron and I failed but after I learned to just relax and have fun I actually stole baron 3/4 times ever since I got out from my &quot;RANKED IS MY LIFE&quot; attitude.  \n\n7. Breaks: If you are on a losing streak then just take a break and not tilt yourself.\n\n8. Grinding: Remember, no matter how many tip videos you gonna watch and you don&#039;t put the work in, nothing is gonna happen.\n\n\nI also improved by watching the youtube channel I mentioned above\n\n\nBefore I started doing all these tips I was 42 Wins and 52 Losses and after I did the things mentioned above I went to 67 Wins to 59 Losses. That&#039;s 25 wins - 7 Losses.\n\nNo such thing as elo hell and just realize that it&#039;s all about you and not your team cause there is no way you are gonna get the same team from last game, you have to learn to carry the game. There is a challenger in every single one of us ;)","replies":[{"poster":"Talon12","date":"2016-07-15T23:58:27.653+0000","up_votes":2,"down_votes":0,"body":"Lol climbing bronze is easy, its climbing silver thats the hard part, full of people who think they are god, think they are better and then do nothing but feed and toxicize all the games\n\nthe toxicity is the worst part, the game is spent fighting and cursing instead of helping, typing /mute all doesn't stop that, all it does is stop you seeing it the other 4 still do nothing\n\nyou might as well be fighting a 1v5","replies":[{"poster":"YellowBrickRoad","date":"2016-07-16T17:17:21.837+0000","up_votes":1,"down_votes":0,"body":"Theres a plateau somewhere around the middle of b4 aswell.\n\nI just recently crossed it and my winrate skyrocketed due to the players being slightly less retarded (on both teams) meaning less chaos.\n\nFor instance how do you prepare yourself as a top laner for the entire enemy team to just come pouring out the the tribush behind your turret and force you to run away from your nexus possibly giving first blood, you dont because no ones dumb enough to try that, except low mmr bronze.\n\nTheres bronze.\n\nThen theres low mmr bronze.","replies":[{"poster":"YellowBrickRoad","date":"2016-07-16T18:41:52.341+0000","up_votes":1,"down_votes":0,"body":"I spoke too soon this just happened.\n\nhttp://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/140498789/201665539?tab=overview\n\nIf only id warded more as a sup, maybe my full tank build wouldnt have done the most damage on the team by 2k despite never directly attacking people aside from hooking or popping an auto on their face.\n\nLike shit how do you win that, and in my promos of all things.","replies":[{"poster":"Talon12","date":"2016-07-17T01:51:27.499+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YellowBrickRoad,realm=OCE,application-id=FjGAIbRv,discussion-id=07pLQh3p,comment-id=000300010000,timestamp=2016-07-16T18:41:52.341+0000)\n>\n> I spoke too soon this just happened.\n> \n> http://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/140498789/201665539?tab=overview\n> \n> If only id warded more as a sup, maybe my full tank build wouldnt have done the most damage on the team by 2k despite never directly attacking people aside from hooking or popping an auto on their face.\n> \n> Like shit how do you win that, and in my promos of all things.\n\nthe fuck the gunblade for","replies":[{"poster":"YellowBrickRoad","date":"2016-07-17T10:27:40.042+0000","up_votes":1,"down_votes":0,"body":"Heals from the thornmail, works out to about an extra 2.3% damage reduction ontop of your normal reduction before enemy MR is factored in.\n\nAlso lets you heal from minion waves (was on 20 hp walked into the middle of a wave was on full health in 5 seconds)","replies":[]}]}]}]},{"poster":"Soulless Reaper","date":"2016-07-16T00:49:25.270+0000","up_votes":1,"down_votes":0,"body":"Oath to that Talon12. Bronze was again, easy. took me a week ","replies":[{"poster":"Talon12","date":"2016-07-16T05:07:18.575+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Soulless Reaper,realm=OCE,application-id=FjGAIbRv,discussion-id=07pLQh3p,comment-id=00030000,timestamp=2016-07-16T00:49:25.270+0000)\n>\n> Oath\n\nYou from south-east Melbourne or something","replies":[{"poster":"Soulless Reaper","date":"2016-07-16T09:35:25.358+0000","up_votes":1,"down_votes":0,"body":"No. I am from New Zealand. Nuff said","replies":[]}]}]}]},{"poster":"Hex caster","date":"2016-07-21T11:55:09.968+0000","up_votes":1,"down_votes":0,"body":"Hey, Thanks for these tips!, They are amazing :D ty{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Erøse","date":"2016-07-18T10:38:32.209+0000","up_votes":1,"down_votes":0,"body":"Thank you guys for the positive feedback :D","replies":[]},{"poster":"Slowdownn","date":"2016-07-18T09:09:13.560+0000","up_votes":1,"down_votes":0,"body":"Did you do all this solo?","replies":[{"poster":"Erøse","date":"2016-07-18T10:38:01.706+0000","up_votes":1,"down_votes":0,"body":"No, I played  2 ranked games with some of my friends which put me at silver 4 36 lp but the rest I solo.","replies":[]}]},{"poster":"Machismo","date":"2016-07-16T13:39:39.056+0000","up_votes":1,"down_votes":0,"body":"Good info, well put together :)","replies":[{"poster":"Erøse","date":"2016-07-18T10:35:34.368+0000","up_votes":1,"down_votes":0,"body":"Thank you for the feedback :)","replies":[]}]},{"poster":"Yasei Doubutsu","date":"2016-07-16T11:48:43.993+0000","up_votes":1,"down_votes":0,"body":"I tried clicking on the link, but it says \"Channel doesn't exist anymore\"\nThis happening to anyone else too?","replies":[{"poster":"Erøse","date":"2016-07-18T10:34:41.794+0000","up_votes":1,"down_votes":0,"body":"Try to click it again, there was a fullstop at the end which caused the link to break :(","replies":[]}]},{"poster":"Omni Presents","date":"2016-07-16T09:48:59.879+0000","up_votes":1,"down_votes":0,"body":"Now climb out of Silver.\n\nIt is high Bronze and low Silver that is a nightmare. Took me ~20 games last season to get to Silver, this season I am on ~150 games and still in Silver. A few seasons ago in about that amount of games I got Gold and could have gone higher if I bothered playing more. This season is retarded.","replies":[{"poster":"Erøse","date":"2016-07-18T10:33:18.891+0000","up_votes":1,"down_votes":0,"body":"I'll try :D","replies":[]}]},{"poster":"Obelisk d","date":"2016-07-15T22:08:24.657+0000","up_votes":1,"down_votes":0,"body":"You did a great job there. In my opinion silver isnt harder to climb out of than bronze so I think you will climb out of it soon. Especially with this attitude.","replies":[{"poster":"Erøse","date":"2016-07-18T10:32:40.093+0000","up_votes":1,"down_votes":0,"body":"Hopefully :D","replies":[]}]},{"poster":"Roguestoney","date":"2016-07-15T20:58:38.661+0000","up_votes":1,"down_votes":0,"body":"Good job pal enjoy Silver and possibly soon Gold :^)","replies":[{"poster":"Erøse","date":"2016-07-18T10:31:57.909+0000","up_votes":1,"down_votes":0,"body":"Thanks :D","replies":[]}]},{"poster":"bgentle2myashe","date":"2016-07-15T14:34:21.597+0000","up_votes":1,"down_votes":0,"body":"That's great, well done and congratulations. Good advice as well, hasn't worked for me but I'm just playing to do the best I can and at least try and have fun.","replies":[{"poster":"Erøse","date":"2016-07-15T20:32:22.674+0000","up_votes":1,"down_votes":0,"body":"Thanks ^^","replies":[]}]}]}