{"poster":"Erøse","date":"2015-11-11T10:28:49.230+0000","title":"Division Markers..if you hate them then read this","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":1,"body":"As I was reading the end of season rewards,I have been reading so many comments about how the division marker sucks because people would get salty and blah blah blah. I am silver V and tbh I don&#039;t really mind having a &quot;V&quot; in the border as a marking.I understand the points that some LoL players pointed out like &quot;When I die those toxic players would just say get back to silver V.....&quot; but hey look on the brightside,you can use that criticism as a motivation to actually climb out of whatever rank/division you are in and then reward yourself for climbing a rank/division by saying to yourself &quot;I proved those toxic players wrong&quot; In fact ranks don&#039;t lie,if you belong in a certain rank then you will be stuck there till you impove and step up your game.I&#039;m gonna be 100% completely honest here but I was a toxic player then but I learned that being toxic won&#039;t help anyone so I decided to just keep my mouth shut and play the game and also improve on mistakes that I did.Unfortunately I realised that way too late and it&#039;s too late for me to climb the rank ladder now since I have exams coming up (there&#039;s always next year ^^) So when someone says &quot;Go back to (rank/divison) ) just ignore them and play your gameplay style.It isn&#039;t called solo q  no reason,it&#039;s called solo q because you are relying on your own individual skill and not on your teammate.\r\n\r\n\r\n\r\nGoodluck on the fields Summoner!\r\nKingX","replies":[{"poster":"Sir Ganksalot","date":"2015-11-11T13:23:57.905+0000","up_votes":1,"down_votes":0,"body":"I think its fine, i can check all players in quickfind during the load anyway.\nI think it should be visible to both sides as well. I think it could help reduce toxicity.\nIf you are being owned by the platinum player on their team then everyone understand a bit more","replies":[]},{"poster":"Omni Presents","date":"2015-11-11T11:41:16.601+0000","up_votes":1,"down_votes":0,"body":"Yeh but all of those \"Go back to...\" are the type of players who will check your rank mid game online anyway, there is no way to stop them giving you shit for being in a lower rank, they don't even care if you have only 10 ranked games total, they will still give you shit for it.\n\nEven if they have hundreds of games and you have 10, you being Silver 1 and them being Gold 5, they will STILL give you shit and tell you to go back to where you came from.","replies":[]}]}