{"poster":"PainBringerS","date":"2015-12-16T17:32:43.096+0000","title":"BRAND","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"ciao a tutti ho comprato brand oggi, volevo sapere qualche consiglio su come buildarlo e quali sono i suoi counters e chi countera, inoltre ho letto che i MAIN maxano la E, la stragrande maggioranza maxa la w poi la q? non so. insomma se c&#039;&egrave; qualcuno che mi possa dare delle dritte ciao a todosssss{{champion:63}}","replies":[{"poster":"Il Freddo","date":"2015-12-16T18:50:21.911+0000","up_votes":1,"down_votes":0,"body":"maxa la w.\nliandry, rylai, zhonia, rabadon, scarpe e penetrazione magica. fine","replies":[]},{"poster":"Heavenly Yasha","date":"2015-12-16T18:44:41.833+0000","up_votes":1,"down_votes":0,"body":"**Skill order**\nR > W > Q > E \n\n**Build**\n{{item:1056}} {{item:1056}} {{item:3020}} {{item:3151}} {{item:3116}} {{item:3135}} \n{{item:1056}} {{item:2010}} --> {{item:1056}} {{item:3136}} {{item:3020}} --> {{item:3116}} --> {{item:3151}} --> {{item:3135}} \n\nPoi {{item:3089}} per aumentare i danni, {{item:3157}} come item difensivo \n\n**Rune**\nRosse: 9x Magic Pen\nGialle: 9x HP x lv\nBlu: 9x Magic Resist / 9x CDR x lv\nQuinte: 3x Mov Speed\n\n**Maestrie**\n18/12/0\n\nÈ debole contro chi ha più range e waveclear di lui {{champion:268}} {{champion:101}} {{champion:99}} o, se non si è confident del matchup, anche contro assassin come {{champion:105}} {{champion:7}} {{champion:238}}.\nÈ forte contro qualsiasi cosa sia facile da bullare in lane e in team comp con CC ad area.","replies":[]},{"poster":"Pasticcionex","date":"2015-12-16T17:33:48.858+0000","up_votes":1,"down_votes":0,"body":"i suoi counters sono quelli con mobility dato che lui ha 2 skill shot che gli fanno fare la combo. Perl a build inizi di mascherina e rylay poi full ap","replies":[]},{"poster":"Frattaglia","date":"2015-12-16T19:06:11.708+0000","up_votes":1,"down_votes":1,"body":"Allora, partiamo dall'idea che Brand al momento è un campione squilibrato.\nFa dei danni indecenti, l'80% delle volte che lo gioco support faccio più danni di tutta la squadra. Lo gioco anche mid ma come support mi trovo meglio, prima di tutto per preferenza mia (sono main support :P), ma soprattutto perché siccome in botlane i nemici sono in due e il support non farma ho più tranquillità per harrassare i champ con le skill e ho due target da prendere invece che uno :P\n\nComunque, come avrai notato, ogni abilità viene potenziata se il nemico è in fiamme; se il nemico è in fiamme, la passiva di Brand gli fa danni nel tempo per l'8% della sua salute.\nIo parto di W e maxo R>W>Q>E, oppure se sono mid e non sono contro un assassino R>W>E>Q.\nUn oggetto fortissimo (da usare anche mid) al momento è la Frost Queen (l'oggetto da support blu per capirci).\nSe sei mid parti di doran ring e pozze, se sei support parti di pugnalino blu.\nDi solito dopo il Frost Queen (e le scarpe, e la sightstone + trinket rosso se sono support) faccio il Rilay. Poi di solito o il tormento di Lyandri o il Luden's Echo, oppure in caso di necessità la Zhonya (però quella se serve la anticipo).\n\nCi sono parecchie combo:\n- w -> q: la W è facile (relativamente) da mettere a segno, con la q stunni. Se la fai in velocità e prendi la q è utile per fare un engage\n- e -> q: altro stun, ma questo lo faccio quando lo zed di turno cerca di saltarmi addosso o ho una persona che mi sta ingaggiando. Ricorda che la e è a target, inoltre così hai anche il tempo per fargli una w sotto ai piedi, dopo\n- e -> w: la W fa una marea di danno se il nemico è in fiamme\n- w -> r: basta leggere l'effetto della r per capire che se la spari dopo che i nemici sono in fiamme è meglio.\n- w -> e: se la fai sotto ai minion (che diventano in fiamme) e il nemico si avvicina quando usi la e, la e farà saltare le fiammelle anche sul nemico \n\nOvviamente nulla ti vieta di scaricargli tutte le spell che hai dopo che ne hai colpita qualcuna. Inoltre ricorda che nel momento in cui hai il Rilay tutte le tue abilità rallentano il nemico e quindi sono più facili da colpire (che poi è il motivo per cui faccio il Rilay presto).\n\nAh, penso che tra una o due patch nerferanno la Frost Queen: in quel caso se lo giochi mid sarà probabilmente più conveniente comprare il morellonomicon o il calice di athene.\n\nNote sulla ultimate: ricordati di usarla quando il nemico ha qualcosa vicino su cui possa rimbalzare. Ora non ricordo se può rimbalzare sui mob neutrali o no, però sono certa che possa rimbalzare su:  \n- nemici (e vabbè)\n- minion nemici\n- le copie dei champ, come la copia di LeBlanc e quella di Shaco :D\n\n\nQui trovi le statistiche sul modo ottimale con cui viene giocato\n[http://champion.gg/champion/Brand](http://champion.gg/champion/Brand) \n(Prende in considerazione le partite ranked di gente platino o più)\n\n\nQueste sono le ultime partite che ho fatto con Brand :D\n[http://imgur.com/XqOx5jK](http://imgur.com/XqOx5jK)","replies":[]}]}