{"poster":"Avant Garde","date":"2018-09-04T15:01:58.516+0000","title":"Los main soporte deberian saber los powerspikes de sus adc.","subforum":"Off-topic y temas personales","up_votes":8,"down_votes":3,"body":"that. Una {{champion:89}} , parrillera, queria ganar el trade contra un {{champion:202}} con {{item:1038}} protegido por una {{champion:40}}\ny yo con un {{champion:81}} con{{item:3070}} . \nDespues de decirle que no le ibamos a ganar el trade. Me dice :- todos los ezreal son lo mismo. En fin perdimos la linea, y la partida.\n\nSaludos cordiales a la {{champion:89}}  que me suporteo.\n\n*Editado por moderación: evitemos expresiones que puedan sonar malintencionadas u ofensivas. No todo el mundo simpatiza con el mismo tipo de humor*","replies":[{"poster":"Yitán","date":"2018-09-04T15:55:27.804+0000","up_votes":6,"down_votes":0,"body":"yo cuando juego soporte me pasa al revés, cada vez que acoso para desgastar al adc rival mi retADCrder se tira como si fuera inicio de una tf, donde CLARAMENTE TIENE DESVENTAJA, me pasa con {{champion:25}} cada vez que tiro la Q, y sobretodo con {{champion:497}} A PESAR QUE SIEMPRE EXPLICO QUE SALTO PARA ACOSAR Y VUELVO AL ADC, pero no, siempre que salto al adc rival el mio se pone literalmente a melee y despúes flamea por querer irme, ese instinto de bronza de tirarse aun en desventaja porque se tira un aliado (sin importar el contexto) me hizo dejar de jugar a rakkan a no ser que el adc sea mi premade...\n\n*Editado por moderación: evitemos expresiones que puedan sonar malintencionadas u ofensivas. No todo el mundo simpatiza con el mismo tipo de humor*","replies":[{"poster":"BeveBVXD","date":"2018-09-04T17:00:38.848+0000","up_votes":1,"down_votes":0,"body":"Uff men, las veces que me ha pasado xd","replies":[]},{"poster":"LeøniN","date":"2018-09-04T16:32:57.617+0000","up_votes":1,"down_votes":0,"body":"si entiendo esa situacion jajaja me pasaba tambien con rakan por eso no lo juego mucho pero es verdad hay personas que no saben leer la situacion o no estan concentrados y como dije el flameo se lo come uno xD","replies":[]}]},{"poster":"Mioen","date":"2018-09-04T15:47:19.733+0000","up_votes":5,"down_votes":0,"body":"Bueno.\n\nSi onda tiene razón Leo debería conocer que de no recibir apoyo el trade es un desperdicio de recursos.\n\nPodría ser un trade favorable para la lane de Ez y Leo si tienen una ventaja en subditos(Linea). Así la botlane enemiga tomaria el agro de los minions. Tambien es conveniente si ez o leo ya provocaron que janna o jhin gasten summs o pociones, asi estan en ventaja a la hora de realizar el trade.\n\nPero si la leo solo se mando de cabeza no es muy buena idea.\n\nNo me malentienda, Leona tenía en mente (Quizas)un trade Explosivo. Entrar y salir rapidamente para poder provocar la retirada de la botlane enemiga o en un mejor caso, un asesinato. Aunque Ez es un poco malo en trades de nivel bajo y mas si solo tiene la Lagrima recien comprada.\n\nEn si el trade, lo podría ganar leo. El tema es que es complicado que Ez pueda hacer ese follow. Si en realidad tuvieran otro ADC la accion de la Leona hubiese sido la mas acertada.\n\nPero los cuentos no siempre terminan como uno quiere. El error fue de la Leo, por no conocer el estilo de juego del Ez. Que curiosamente en un Ezreal se nota mucho mas el estilo de juego que van a tomar en los primeros niveles.\n\nPasivo y exclusivo al farm.\nAgresivo y pockeando constantemente con la Q para conseguir recursos.","replies":[{"poster":"LeøniN","date":"2018-09-04T16:26:18.459+0000","up_votes":1,"down_votes":0,"body":"buen aporte :)","replies":[]}]},{"poster":"Nisinunglacert","date":"2018-09-04T15:45:00.307+0000","up_votes":1,"down_votes":0,"body":"Más allá de ese ejemplo (dónde es muy obvia la ignorancia del support sobre tu ADC) creo que ambas partes deberían conocer sus powerspike. Más de una vez mi ADC empieza a jugar defensivo (o incluso backear) cuando estoy a punto de subir a Nivel 6 con Taric, que es cuando tiene uno de sus mayores powerspike, sin ninguna razón clara.","replies":[{"poster":"LeøniN","date":"2018-09-04T15:52:13.880+0000","up_votes":2,"down_votes":0,"body":"si si tal cual la cosa va para ambas partes mas si mainean esa linea, ahi es donde mas sinergia se debe mostrar por eso es mejor ir con un duo","replies":[]}]},{"poster":"LeøniN","date":"2018-09-04T15:21:32.860+0000","up_votes":1,"down_votes":0,"body":"si deberian saberlo pero eso ya depende de cada persona si se quiere informar, jugando soporte me ha pasado que mi adc quiere tradear cuando es obvio que no va a salir bien son cosas que pasan lamentablemente y al que flammean despues es a uno xD a veces por esa razon simplemente te terminan ganando la linea, en vez de ser porque la otra botlane jugo mejor y punto. ezreal es obvio que necesita escalar pero bueno quizas la leona no lo sabia xD","replies":[{"poster":"Avant Garde","date":"2018-09-04T15:34:19.982+0000","up_votes":2,"down_votes":0,"body":"pero si me dijo que todos los ezreal eran lo mismo. {{sticker:poppy-wink}}  yo creo que es hora de conseguirme un duo que sea main soporte","replies":[{"poster":"LeøniN","date":"2018-09-04T15:38:36.963+0000","up_votes":1,"down_votes":0,"body":"tal cual no queda otra y mas si jugas en la botlane es mas seguro jugar duo, con mucho gusto jugaria con vos pero tengo una mala pc para jugar ranked :,( pero cuando consiga te agrego :) {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"LeøniN","date":"2018-09-04T15:26:26.429+0000","up_votes":1,"down_votes":0,"body":"simplemente era farmear o esperar gankeo del jg porque si leona inicia incluso teniendo lvl 6 janna puede desenganchar facil y como mucho les gastaras hechizos pero son cosas que algunos no toman en cuenta asi que entiendo tu punto xD se tiran sin pensar y te echan la culpa, por no tener paciencia jaajaj","replies":[]}]},{"poster":"Alekséi Románov","date":"2018-09-08T02:10:03.942+0000","up_votes":1,"down_votes":0,"body":"Pero eso es algo lógico, esa leona simplemente era una estupida\nSaludos {{champion:117}}","replies":[]},{"poster":"Doven","date":"2018-09-04T19:53:19.301+0000","up_votes":1,"down_votes":0,"body":"Si me decias que era una ranked... Estas en una normal que esperas capo? El main soporte que te toco tiene 46% de winratio despues de haber jugado 4 seasons y estar hardstuck entre plata y oro (alerta de discapacidad). Si te encontras eso en una ranked tenes que dodgear automaticamente, pero en este caso no tiene importancia.\nSolo te toco una persona con poca habilidad en una normal, no hay nada de que alarmarse.","replies":[]},{"poster":"Bunny Cookie","date":"2018-09-04T17:27:17.236+0000","up_votes":1,"down_votes":1,"body":"Aquí main Ezreal, y tienes mucha razón.\n\n{{sticker:sg-ezreal}} \n\nEl problema está en que no entienden que el daño de Ezreal viene de los skillshots, la mayoría decide hacer engage cuando aun hay demasiados minions enemigos, estos pueden **bloquear** con facilidad escondiendose detrás de ellos y reducir su daño considerablemente. Es por eso que tienen un mal concepto del campeón \"no pega nada ñiñiñi\", he visto poquisimos supports que aguantan las waves de minions correctamente para iniciar.\n\nDe todas formas no te hagas problema, Ezreal es un carry que puede jugar sólo (obviamente no es recomendable) pero si tienes un support que va a su bola sin proponer algo, lo mejor es jugar como si fueses top o mid, sólo.\n\nSi se ponen pesados mutealos y listo xD, no hace falta que te comas un mal rato por el gilipollas de turno.","replies":[]}]}