{"poster":"Schokoladenhase1","date":"2015-10-23T18:14:10.885+0000","title":"Midlane","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hi,\r\nIch bin Neuling und wei&szlig; noch nicht genau wo welcher Champion spielt!\r\nIch will mich jetzt auf die mid lane konzentrieren und wollte wissen welche Champions alle auf der mid lane spielen\r\n\r\nLG,\r\nSchokoladenhase1","replies":[{"poster":"Termii TFT","date":"2015-10-23T18:41:10.377+0000","up_votes":1,"down_votes":1,"body":"Im lowlevel kannst du in der midlane eigentlich alles spielen. Viel gespielt werden Magier, aber auch regelmäßig Kämpfer oder Assassine. Ich empfehle dir Wukong mid zu spielen. Ziemlich stark im lowlevel Bereich. UND!!! du lernst direkt einen Champ, den du später auch top oder im jungle spielen kannst.\n{{champion:62}} {{item:3243}} {{item:3134}} {{item:3074}} {{item:3035}} {{item:3071}} {{item:3026}}\n\nWu mid guide:http://www.lolking.net/guides/214005","replies":[{"poster":"Schokoladenhase1","date":"2015-10-23T19:46:38.073+0000","up_votes":2,"down_votes":0,"body":"Ich danke dir!","replies":[]}]},{"poster":"M4UR1C31234","date":"2015-10-23T18:29:20.358+0000","up_votes":2,"down_votes":0,"body":"Es gibt sehr sehr viele Champions die man dort spielen kann \n\nUm mal ein paar zu nennen:\n\n{{champion:103}} {{champion:84}} {{champion:34}} {{champion:1}} {{champion:268}} {{champion:63}} {{champion:69}} {{champion:31}} {{champion:42}} {{champion:131}} {{champion:245}} {{champion:81}} {{champion:114}} {{champion:105}} {{champion:41}} {{champion:3}} {{champion:74}} {{champion:39}} {{champion:59}} {{champion:30}} {{champion:38}} {{champion:55}} {{champion:10}} {{champion:96}} {{champion:7}} {{champion:127}} {{champion:117}} {{champion:99}} {{champion:90}} {{champion:76}} {{champion:61}} {{champion:13}} {{champion:134}} {{champion:91}} {{champion:4}} {{champion:6}} {{champion:110}} {{champion:45}} {{champion:161}} {{champion:112}} {{champion:8}} {{champion:101}} {{champion:157}} {{champion:238}} {{champion:115}} {{champion:26}} {{champion:143}} {{champion:126}} \n\nWobei zu erwähnen ist das man Fiora eher Top,Corki eher ADC, Ekko eher Jungle, Ezreal eher ADC,Irelia eher Top, Jarvan eher Jungle, Lulu eher Top. Nidalee eher Jungle und Urgot eher Adc spielt, jedoch sollten diese in der Mitte auch recht spielbar sein.\n\n\nPS: Als Neuling empfehle ich dir Annie, Cho Gath, Fizz, Ahri und Katarina da sie relativ leicht zu spielen sind im Gegensatz zu sowas wie einer Cassiopaia.\n\n\nMit Freundlichen Grüßen","replies":[{"poster":"Schokoladenhase1","date":"2015-10-23T19:42:49.138+0000","up_votes":2,"down_votes":1,"body":"Ich danke dir!","replies":[]}]},{"poster":"ReDcOrSaIr2","date":"2015-10-24T09:32:38.531+0000","up_votes":1,"down_votes":0,"body":"Syndra MID mit Level 14 ??\n\n Bist du vom Mond ? :o Syndra ist ein schwieriger Champion ! Mit der Q und E kombo, Ulti Scaling etc... \n\nPS: Main Syndra","replies":[{"poster":"Sharux","date":"2015-10-26T14:45:27.369+0000","up_votes":1,"down_votes":0,"body":"Stimmt schon, aber sie hat ne recht hohe Range, kann gut poken, drückt viel dmg und kann sich recht gut bei ganks schützen finde ich. Man muss ja nicht unbedingt mit was leichtem anfangen. Mag anfangs schwerer sein aber ist dann doch umso schöner, wenn man nen schwierigen Champ spielen kann, ging mir mit Zed so. Hab den recht früh auf der Mid angefangen und anfangs zwar ziemlich anstrengend und dafür jetzt umso besser :)","replies":[]}]},{"poster":"Kata Ga Kill","date":"2015-10-25T11:52:40.708+0000","up_votes":1,"down_votes":0,"body":"Mhh ich kann dir die Videos von LRSB empfehlen, vllt hilft es dir die Lane zu wählen die du magst.\nhttps://www.youtube.com/user/Letsreadsmallbooks/search?query=lane\n\nDen Midlane ist die Lane die von Mages mit guter Range dominiert wird, und eben dadurch die Lane gehalten werden muss da die zu wichtig ist.\nAssassinen und Melees wirste nicht so erfolgreich dort spielen können, da sie nicht in der Meta, Laning Phase und Teamfight Usefull sind.\nUnd spielste jetzt als Beispiel nen AD Champ(ADC) dann fehlt eurem Team der AP schaden.\n\nEmpfele dir erstmal alle Champs zu spielen die dir optisch einfach gefallen (ohnehin wirste im Ranked alle Lanes spielen müssen/können), und später kristalliesiert sich eben welche Champs du spielen kannst und damit wird auch deine Lane bestimmt.\n\nAls Beispiel sagen wir du spielst viele Melees aber auch gerne 1-2 Mages, dann kannst du trotzdem mit den Mages auch die Top zu deiner Lane machen und demendsprechend Üben dort mit all deinen Champs.","replies":[]},{"poster":"Sharux","date":"2015-10-23T21:03:50.896+0000","up_votes":1,"down_votes":0,"body":"Ich habe eine Zeit lang nur Mid gespielt, zunehmend weniger. Also ich spiele sehr gerne Zed (Assassine [AD]), aber abgesehen von Zed würde ich dir die hier empfehlen: \n{{champion:103}} {{champion:84}} {{champion:1}} {{champion:74}} {{champion:99}} {{champion:134}} {{champion:112}} (alles AP Champs die ich als Anfänger auf der Mitte spielen würde. Katarina würde ich nicht spielen, sie ist zwar recht einfach und macht auch gut Schaden, aber gerade später wird sie schnell rausgenommen und meiner Meinung nach gibt es Champs die wesentlich mehr zu bieten haben) \n\n{{champion:238}} {{champion:91}} {{champion:157}} (AD Champs, die auf der Mid gut funktionieren) \nIch empfehle jedem mit Zed anzufangen. Er ist zwar schwer zu spielen, aber meine Meinung nach ein guter Start um die Mid zu lernen. Du hast es einfach beim farmen durch deinen hohen AD Schaden, du kannst recht gut escapen wenn es knapp wird durch deine W (Schatten) und ich denke wenn du dich direkt von Anfang an, an schwere Champs gewöhnst und lernst fällt es dir anschließend leichter auf der Mid mit neuen Champs klarzukommen. \n\n\nAuch Midlaner die du spielen könntest: \n{{champion:38}} {{champion:30}} {{champion:7}} {{champion:25}} {{champion:76}} {{champion:101}} {{champion:4}} {{champion:105}} {{champion:69}} \n{{champion:131}} {{champion:268}} {{champion:63}} {{champion:81}} {{champion:50}} {{champion:161}} {{champion:45}}\n\nSolltest dir vielleicht Videos von bekannten Midlaner anschauen und für dich da herausfinden welcher dir gefällt von den Fertigkeiten und so weiter. Dann kannst du dir den ja näher anschauen.","replies":[]}]}