{"poster":"gogoveta","date":"2016-04-08T22:53:54.828+0000","title":"rediseñar la skin de twisted fate el magnifico","subforum":"Off-topic y temas personales","up_votes":9,"down_votes":1,"body":"{{champion:4}}  esta skin val&iacute;a 1820 as&iacute; que no deber&iacute;an hacerla de nuevo ya que era legendaria  y cambiarle la ilustraci&oacute;n , pienso yo no asi twisted fate tendria una skin legendaria  , para terminar ponerla en venta{{sticker:zombie-nunu-bummed}} ","replies":[{"poster":"Kyousuke","date":"2016-04-08T23:10:21.515+0000","up_votes":4,"down_votes":2,"body":"{{champion:1}}  en el país de las maravillas también","replies":[]},{"poster":"gogoveta","date":"2016-04-15T01:49:57.915+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=the matiXD772,realm=LAS,application-id=J8qpiO2I,discussion-id=5iA908AR,comment-id=,timestamp=2016-04-08T22:53:54.828+0000)\n>\n> {{champion:4}}  esta skin val&amp;iacute;a 1820 as&amp;iacute; que no deber&amp;iacute;an hacerla de nuevo ya que era legendaria  y cambiarle la ilustraci&amp;oacute;n , pienso yo no asi twisted fate tendria una skin legendaria  , para terminar ponerla en venta\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Zexceed","date":"2016-04-09T18:09:22.759+0000","up_votes":1,"down_votes":0,"body":"estaria bueno que la mejoren, pero no que la pongan a la venta xd","replies":[]},{"poster":"Puertexcino","date":"2016-04-09T01:50:34.659+0000","up_votes":1,"down_votes":1,"body":"la verdad si es una skin que  ami parecer ingame esta bien pero ya es hora de un re diseño la verdad muy atrasado el arte de esta","replies":[]},{"poster":"gogoveta","date":"2016-04-09T01:19:07.284+0000","up_votes":1,"down_votes":1,"body":"queria que le pongan cosas y acordarse de otras y una idea seria el dia de los beteranos y vender las skin antiguas poniendole unas cositas para por ejempro un coleccionista le interese","replies":[]},{"poster":"gogoveta","date":"2016-04-09T01:16:19.259+0000","up_votes":1,"down_votes":1,"body":"no queria decir eso si no queria que lo mejore y qu ele preste atencion a otra antiguas y ponerle algo mas para no decir que no combiene esta skin por tal cosa","replies":[]},{"poster":"Numerítos","date":"2016-04-09T01:04:43.755+0000","up_votes":1,"down_votes":1,"body":"yo opino que no deben rehacerlas simplemente deberian  agregarle cosas que le faltan con respecto a otros skins de 1820, como por ejemplo una animacion de vuelta a base, mas dialogos, interacciones con otros campeones, pero sin eliminar lo que ya tiene, asi no se pierde la escensia del mismo, otro punto que un rioter dijo que iban (no se si rehacerla o mejorla) ese aspecto aprovechando el rework de los magos que sigue despues de taric.","replies":[]},{"poster":"Jarreth","date":"2016-04-08T23:38:26.125+0000","up_votes":1,"down_votes":1,"body":"Nunca creo que las cambien esas skins, imagínate a Tristana directamente le sacaron una Skin Legendaria nueva. \nLo mismo paso con Cho'Gath le sacaron un nuevo legendario y ya fue, seguramente hagan lo mismo con todos los demas. \nPor ejemplo yo me canjee con la Artesania a Corki trineo de Hielo y la verdad que no cambia nada, a su vez al canjear ese skin con la Artesania me llego la caja de las hachas giratorias y me toco otro skin legendario Mundo Ejecutivo que apenas cambia un par de cosas.\nEs una lastima que no quieran actualizarlos, el skin de Mundo Ejecutivo por ejemplo es tremendo concepto incluso muchos le tienen cariño a su Voiceover y a su aspecto visual por lo menos a mi me encanta seria horrible que fuera sustituido por otro Legendario o Definitivo.","replies":[]}]}