{"poster":"BarbieHunter1404","date":"2018-09-02T18:07:29.206+0000","title":"\"Du bist momentan gesperrt\"","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hi,\r\nheute als ich mich im Client einloggen wollte hatte ich das Problem das ich keine Verbindung zum Server herstellen konnte. Nach 10 Minuten warten und andauerndem Neustart kam ich dann rein. Als ich dann eine Lobby er&ouml;ffnen wollte der n&auml;chste Schreck. Bei jeden Gamemode war ein Ausrufezeichen und die Nachricht &quot;Du bist momentan gesperrt.&quot;. Komische Sache da ich weder eine E-Mail, Client Nachricht oder sonst irgendwas bekommen habe. Ich habe auch bisher noch nie eine Strafe bekommen. Also hab ich direkt gegooglet. Weitere komische Sache dabei, keine Offizielle Seite von Riot/League hat geladen, immer wieder die Meldung &quot;Bad Gateway&quot; bekommen. So, mein Freund meinte dann, starte einfach alles nochmal neu. Gesagt getan. Pc neu gestartet, Lol ge&ouml;ffnet, angemeldet, zack alles geht wieder. Sooooo nun die gro&szlig;e Frage, was ist passiert? Lag es an mir, meinen  Pc Einstellungen, meinem Intenet, der Firewall? Hatte das schon mal jemand?","replies":[{"poster":"Gin","date":"2018-09-03T07:18:01.379+0000","up_votes":1,"down_votes":0,"body":"Bist du dir sicher dass dort \"Du bist aktuell gesperrt\" stand? Es wäre möglich dass im deutschen hier eventuell etwas komisch übersetzt wurde, aber die einzige \"grundlose Sperre\" die ich kenne die dich davon abhält eine Lobby zu erstellen, ist wenn es einen Hotfix/einen Mini-Patch gab und du dich reloggen musst um dieses richtig anzuwenden. (Was ich persönlich bisher nur 1-2 mal hatte.)\n\nWenn das Problem nicht ein Update war, und es nicht mehr auftritt, würde ich es vorerst einfach auf eine kurze Störung schieben bevor wir hier auf große Suche zu gehen ohne irgendeinen Ansatz.\n\nSollte es allerdings wiederkommen, wäre es eine große Hilfe wenn du folgendes machen könntest:\n\n* Ein Screenshot der Fehlermeldung\n* Dich darüber informieren ob eventuell auch andere das selbe Problem haben/hatten.\n* Die Uhrzeit zu der das Problem aufgetreten ist. (Wann ist es dir aufgefallen? Und ab wann ist das Problem verschwunden?)\n\nUnd dass du dir das [HRT](https://support.riotgames.com/hc/de/articles/224826367-Automatisierte-Fehlerbehebung-Hextech-Repair-Tool) herunterlädst, es installierst, ausführst, und einfach durchlaufen lässt ohne ein Häkchen hinzuzufügen/zu entfernen. Anschließend solltest du ein Log-Verzeichnis auf deinem Desktop abgelegt haben dass du dann hier hochladen kannst damit ich mir deine Logs anschauen kann:\n\n> Zum hochladen einer Datei verwende einfach unser [Upload-Portal](https://files.wrenchbox.de). Dort hochgeladenen Dateien können nur von uns [Wrenchmen](https://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/EhBWl18X) eingesehen werden und nach 3 Tagen automatisch gelöscht.","replies":[]},{"poster":"WC9 Umbra","date":"2018-09-02T18:22:32.492+0000","up_votes":1,"down_votes":0,"body":"würde gerne wissen wie es weitergeht.","replies":[]}]}