{"poster":"Chrionxoihg","date":"2019-12-23T19:45:23.421+0000","title":"Plz Nerf Malzahar","subforum":"Champions & Gameplay","up_votes":3,"down_votes":4,"body":"Ich sage das als Malzahar-Main: er ist zu stark.\r\n\r\nIn einem Meta, in dem Mobilität aus allen Rohren kracht, kann Malz nur lachen und R drücken. Die Hitbox von seinem Q ist...fragwürdig und seine W-Viecher machen VIEL zu viel Damage. Über seine (im Lategame 12- Sekunden-)Passive will ich erst gar nicht reden. Ach ja, und sein E ist Poit-And-Click Weltraum-Aids\r\n\r\nMein Vorschlag wäre, den Cooldown von seiner Ult (und wahlweise auch passive) zu erhöhen und seinen W so ändern, dass man mehr Viecher hat, welch aber weniger Schaden machen.\r\n\r\nAber hey, wie findet ihr Malzahar momentan? Sollte man ihn eurer Meinung nach nerfen? Und wenn ja, wie?","replies":[{"poster":"II3RDB4NG","date":"2019-12-23T20:11:15.854+0000","up_votes":2,"down_votes":0,"body":"Better Nerf Irelia","replies":[{"poster":"Chrionxoihg","date":"2019-12-23T20:30:45.564+0000","up_votes":1,"down_votes":0,"body":"Why?","replies":[{"poster":"II3RDB4NG","date":"2019-12-23T22:04:41.751+0000","up_votes":2,"down_votes":0,"body":"Ach, das war früher mal ein Running Gag den Ich nicht aufgeben will ;o)\nhttp://forums.na.leagueoflegends.com/board/showthread.php?t=1913291","replies":[]},{"poster":"Eroticat Nimar","date":"2019-12-24T02:42:08.605+0000","up_votes":1,"down_votes":0,"body":"For the lulz","replies":[]}]}]},{"poster":"DontKillMySoraka","date":"2019-12-23T22:02:13.206+0000","up_votes":2,"down_votes":1,"body":"Seine Q ist sehr nervig von der hitbox, ansonsten ist nichts Besonderes oder besonders Starkes aktuell an ihm.","replies":[]},{"poster":"Supportsmanlike","date":"2019-12-23T21:43:20.302+0000","up_votes":2,"down_votes":1,"body":"Seine R hat eine sehr begrenzte Reichweite für die er stehen bleiben muss und währenddessen nichts anderes mehr machen kann. Seine Voidlings werden von jedem noch so kleinen AoE Damage direkt geoneshotted. Seine Q hat eine super lange Animation, die es recht einfach macht sie zu dodgen und seine E ist zwar nervig, aber macht allein nicht wirklich etwas. Bleibt noch seine Passive, die man mit einem einfachen Autoattack oder Smite los wird.","replies":[]},{"poster":"Veezey","date":"2019-12-25T18:40:38.790+0000","up_votes":1,"down_votes":0,"body":"Alle Champs mit Point&amp;Click Hard-CC sollten generft werden.","replies":[]},{"poster":"611FVNKBlv","date":"2019-12-25T00:57:05.973+0000","up_votes":1,"down_votes":0,"body":"Nerf benötigt er nicht wirklich. Er hat im Early nen hohen Manaverbrauch für wenig impact.\n\nSeine W ist wohl die mit abstand unnötigste Fähigkeit actually und ich glaube wäre die W einfach besser dann würde Malzahar einen ganz starken boost bekommen. \n\nUmso wichtiger ist es aber seine R und seine Q im Kit zu haben. Er kann gezielt einen Champion raushalten der entweder aufgrund der mobility (zb akali) nicht so einfach zu besiegen ist oder einen Champion der auf reichweite spielt aber dafür ein leichtes ziel sobald malzahar in range kommt oder einen Champion um den man sich kümmert wenn sein ganzes gegnerisches team down ist ( zb garen/darius o.a)\n\nSeine Q hat vielleicht ne fragwürdige hitbox ist aber an für sich leicht zu dodgen gerade je nach champion und wenn man nicht predicten kann wo der gegner hingeht oftmals auch nicht sehr impactlastig. ansonsten bietet er ebenfalls eine gute möglichkeit um zb assasins davon abzuhalten nen kill zu holen und dann wieder zu verschwinden oder einfach um gegner davon abzuhalten aoe skills mit cc zu benutzen.\n\nseine Ult kann eben mit Qss leicht umgangen werden oder durch andere items (banshees zb) als fightstarter unbrauchbar gemacht werden. Somit zwingt die ult wie in etwa skarner dazu den gegner ein item zu bauen das man vielleicht nicht haben möchte ... gäbe es das nicht wäre malzahar eben komplett nutzlos\n\nWas ich ein wenig schade finde ist eben das die W malzahar nicht mehr ausmacht, ich finde das sollte wieder in malzahars mittelpunkt geraten die interkationen mit seiner W und das geht nunmal nicht wenn selbst n minion die W-Creeps einfach oneshotten.\n\nIch glaube also eher nicht das malzahar zu stark ist aber auch nicht zu schwach. Ich glaube generell einfach nur das er in die falsche Richtung geraten ist und anfällig für ein erneutes rework. Seine W muss einfach wieder die Fähigkeit werden die malzahar ausmacht. er brauch ein kit das mit seinen creeps ordentlich interagiert und vor allem brauch er creeps die nicht passiv durch nen windstoß sterben\n\nWenn wir über op champs reden sollte man mal im vergleich dazu folgende betrachten\n\nPantheon\nOlaf\nRengar\nKarthus\nEkko\nMiss Fortune\nThresh\nDraven\nRakan\nQiyana\nDarius\nTaliyah\nElise\nKatarina\nAphelios\nJax\nFiora\nLeona\n\n\nDagegen ist Malzahar halt irgendwo n Witz in der Landschaft","replies":[]},{"poster":"Aymira","date":"2019-12-24T23:44:32.128+0000","up_votes":1,"down_votes":0,"body":"Neulich war hier noch jemand, der Malzahar zu schwach fand und sein Kit \"aktueller\" haben wollte...\n\nFinde Malzahar momentan völlig okay, also bin weder der Meinung das man ihn Schwächen oder verbessern sollte. \n\nFinde die Q okay. Eine der wenigen Fähigkeiten im Spiel die noch Schweigen verursachen. Die Trefferkiste ist auch in Ordnung, gibt dann doch wesentlich schlimmere. \n\nDer Schaden der W Fähigkeit ist gut, schon. Allerdings kippen die Viecher auch sofort aus den Latschen wenn man sie nur schief anguckt. Die sind also meiner Meinung nach nur als Schadensquelle zu gebrauchen wenn die mit der ultimativen Fähigkeit kombiniert werden. \n\nUnd die Ultimative Fähigkeit selbst mag ich ganz gerne, weils ne verlässliche Fähigkeit ist, jemanden außer Gefecht zu setzen. Ähnlich wie Lissandras. Muss halt irgendwo Kontermöglichkeiten geben, gegen all die Mobilität im Spiel. Mit einer höheren Abklingzeit würde man den Gegnern die sich viel bewegen können doch nur in die Karten spielen... Und das möcht ich nicht. Lieber einfach mal wieder mehr die Kontrollzauberer ins Spiel bringen, statt all dieser Assassinenquatsch o.o","replies":[]},{"poster":"Eroticat Nimar","date":"2019-12-24T02:44:54.123+0000","up_votes":1,"down_votes":0,"body":"Malzahar Ulti kann durch Teamwork zunichte gemacht werden, bzw durch qss gecancelt werden.\n\nEr ist kein komplizierter Caster, aber nicht unbedingt op","replies":[]},{"poster":"C4i RID","date":"2019-12-23T22:45:14.953+0000","up_votes":2,"down_votes":3,"body":"Am besten sollten die lappen das ganze Game nochmal überprüfen.","replies":[]}]}