{"poster":"Mr Luxas","date":"2017-05-16T22:45:05.284+0000","title":"Problema con el nuevo launcher ''restauramos esta instalacion a una version antigua de LoL''","subforum":"Problemas Técnicos","embed":{"description":null,"url":"http://imgur.com/38WeTIK","image":"http://imgur.com/38WeTIKs.png"},"up_votes":2,"down_votes":0,"body":"Buenas , he tenido este problema con el nuevo cliente y no me deja jugar , osea el boton para jugar esta desabilitado y me dice que no estoy conectado , que si el problema persiste use el cliente de legado , pero al ejecutar el cliente de legado solo se empieza a actualizar y me tira un error \nhttp://imgur.com/38WeTIK\nhttp://imgur.com/4d9k2Pw\nSi alguno me pudiera dar una solucion se los agradeceria! desde ya un saludo\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"SkunkxDestroyer","date":"2019-03-22T20:56:57.138+0000","up_votes":1,"down_votes":0,"body":"a mi me pasa lo mismo :'( no se como solucionarlo","replies":[]},{"poster":"Vlr","date":"2017-09-13T16:56:55.073+0000","up_votes":1,"down_votes":0,"body":"A mí me pasa siempre lo mismo, aún no pude lograr que deje de darme ese error.\nPero si le encontré una solución, cuando el juego les funcione de lujo, copien todo en un discoduro externo, si les sale el error de la versión anterior copien solo la carpeta Rads y denle reemplazar todo y se soluciona el error. Si sale errores como que no se puede ejecutar el cliente y demas lo copian completo. Pasar el juego completo al disco externo tarda alguito, pero pasarlo a la pc no demora ni 5min, lo hice varias veces y funciona","replies":[]},{"poster":"7overtherainbow7","date":"2017-05-16T22:48:44.260+0000","up_votes":1,"down_votes":1,"body":"Intenta contactarte a través del live chat con el equipo de soporte. Acá te dejo un post con los pasos que debes seguir para poder contactarte con ellos.\n¡Saludos!","replies":[{"poster":"Lector de Mentes","date":"2017-08-11T23:47:43.421+0000","up_votes":1,"down_votes":0,"body":"ME PASA LO MISMO Y NO SE COMO SOLUCIONARLO","replies":[{"poster":"7overtherainbow7","date":"2017-08-11T23:54:07.455+0000","up_votes":1,"down_votes":0,"body":"Intenta contactarte con el equipo de soporte a través del siguiente link : https://support.riotgames.com/hc/es-419","replies":[]}]}]},{"poster":"soydetangamandap","date":"2017-05-28T20:32:31.124+0000","up_votes":1,"down_votes":0,"body":"amigo si todavia tienes el problema encontre la solucion en los foros de NA, tambien tenia ese problema y ya no me da ningun drama\nhttps://i.gyazo.com/3033d0cb7dd520dc54f0fc50c5a9eca7.png","replies":[]},{"poster":"MadLuvi","date":"2017-05-22T21:25:28.776+0000","up_votes":1,"down_votes":0,"body":"me pasa lo mismo y peor, cuando selecciono el campeon y voy a jugar la ranked me dice queno estoy conectado y sale ese error de que volvio a una version anterior y cuando intento logear me dice que mi clave es incorrecta... y tengo que hacer la reparacion completa del cliente... ya e perdido 2 partidas por esto y me e comido reports que ni culpa mia son...","replies":[]},{"poster":"LCCU WujuSwørd","date":"2017-05-21T19:30:10.382+0000","up_votes":1,"down_votes":0,"body":"Pudiste solucionarlo?  porque a mi me pasa lo mismo","replies":[]}]}