{"poster":"Quantum Balance","date":"2014-11-02T05:39:56.216+0000","title":"Sion ult doesn't go through Azir ult.","subforum":"Gameplay","up_votes":47,"down_votes":4,"body":"I don't think this is supposed to happen. {{champion:268}}  ult is supposed to be a wall against enemies, not allies. so then why does {{champion:14}}  ult collide with a friendly {{champion:268}} ult as if it were a {{champion:59}} Cataclism or {{champion:34}}  wall? if this is not intentional it should be fixed. or if it is intentional can someone explain to me why they would do that?","replies":[{"poster":"Kingsgrave","date":"2014-11-02T05:40:33.289+0000","up_votes":33,"down_votes":1,"body":"It collides with a friendly Azir wall?\n\nYeah thats a bug","replies":[{"poster":"Quantum Balance","date":"2014-11-02T06:48:42.224+0000","up_votes":5,"down_votes":0,"body":"I thought so! I threw so many team fights because I would ult as {{champion:268}}  and block my ally {{champion:14}}  thanks!","replies":[{"poster":"Riot Scruffy","date":"2014-11-02T19:14:59.331+0000","up_votes":26,"down_votes":0,"body":"Yes this is fixed in the next patch.","replies":[{"poster":"Variks the Loyal","date":"2014-11-03T00:26:58.582+0000","up_votes":3,"down_votes":0,"body":"Aren't 'Unstoppable' abilities like Malphite's ult supposed to be able to go through Azir's ult? So wouldn't Sions?","replies":[{"poster":"Gnarrojanan","date":"2014-11-03T02:08:22.697+0000","up_votes":3,"down_votes":0,"body":"Yeah, you're right my friend. But the problem here is that **\"Unstoppable\" or not,** an ally should **always** passed through Azir's Soldiers Devide with ease. In this case, we're talking about a friendly Sion that can't ult through an allied Azir ult... And this is indeed, quite odd. \n\nIn an other hand, YES, **unstoppable** skills should run through the Shurima Emperor's ult and I didn't saw a recent bug on this when playing Sion jungler or Malphite against an Azir. No worries on that.","replies":[{"poster":"Variks the Loyal","date":"2014-11-03T09:16:35.770+0000","up_votes":2,"down_votes":0,"body":"Last I checked Sion couldn't run through Azir ult at all, but I might be mistaken, maybe I saw this bug on youtube and didn't know. Thanks, though.","replies":[{"poster":"Gnarrojanan","date":"2014-11-03T21:58:40.894+0000","up_votes":1,"down_votes":0,"body":"Np, have fun playing ! :)","replies":[]}]},{"poster":"Thryale","date":"2014-11-03T04:42:08.546+0000","up_votes":2,"down_votes":0,"body":"Actually, if it's an enemy sion running into an ally azir ult then the enemy sion will treat the azir ult like normal terrain(or should at least) just like how anivia's wall will stop sion from ulting.","replies":[{"poster":"Gnarrojanan","date":"2014-11-03T21:59:21.337+0000","up_votes":1,"down_votes":0,"body":"I didn't know! Thank you for the information :)","replies":[]}]},{"poster":"DrCyanide","date":"2014-11-23T06:42:10.768+0000","up_votes":1,"down_votes":0,"body":"Chalk another glorious interaction up to Riot's focus on \"Clarity\".\n\n\"Azir's ult won't block unstoppable movement\" - *proceeds to make a movement based ultimate with 'Unstoppable' in the name that's blocked*\n\n\"Cassiopeia's Twin Fangs doesn't have a cooldown when it attacks a poisoned enemy, even if an ally poisoned then\" - *ignores Gangplank's passive and Shaco's shiv, despite both claiming to be poison*\n\n\"Yasuo can only use his ultimate on airborne enemies\" - *never defines airborne, when the in game definition is very different from the common definition* \n\nI'm sure there's more I'm forgetting, but it's pretty bad.","replies":[]}]}]},{"poster":"Quantum Balance","date":"2014-11-02T20:23:28.189+0000","up_votes":1,"down_votes":1,"body":"i saw further down in this post something about {{champion:14}} ult being stopped by {{champion:35}}  boxes and {{champion:268}} soldiers. has this been looked into as well?","replies":[]}]},{"poster":"Drogmyre","date":"2014-11-02T06:53:22.123+0000","up_votes":6,"down_votes":0,"body":"I think it's a problem on Sion's end, actually. His ultimate interacts with terrain, and Azir's ult is probably considered terrain for Sion's ult.","replies":[{"poster":"Vellich0r","date":"2014-11-02T08:27:15.297+0000","up_votes":2,"down_votes":1,"body":"which makes very little sense with how it actually functions. it blocks dashes but speeds allies up. would be interesting to get riot in on this.","replies":[]}]},{"poster":"Hyrum Graff","date":"2014-11-02T16:05:52.468+0000","up_votes":2,"down_votes":0,"body":"You should post this in bug reports!","replies":[]}]}]},{"poster":"Son of Mu","date":"2014-11-02T10:48:25.539+0000","up_votes":3,"down_votes":1,"body":"I can verify this, the same happened to me.  I was Sion, and I kept colliding with my teammate Azir's wall during my ult.\n\nThere is also a game-breaking bug with Sion which causes his Q and R to be un-usable until you exit the LoL.exe and reconnect.  Happened to me when I tried to Q, but then got warwick ulted and killed during the duration.  I came alive with my passive, tried to kill someone, didn't.  When I respawned, I was unable to use my Q or R whatsoever.  I could still use my W and E.","replies":[{"poster":"Elemon","date":"2014-11-02T14:54:21.408+0000","up_votes":3,"down_votes":0,"body":"This seems to happen occasionally. When you use a channeled spell and get interrupted, it sometimes breaks ad doesn't let you use it for the rest of the game. It's happened to me with Xerath before, and I've heard of numerous cases with Vi.\nNot quite sure why your ult didn't work, though...","replies":[{"poster":"Narasimha","date":"2014-11-02T19:17:43.391+0000","up_votes":1,"down_votes":0,"body":"WW's ult has a lot of bugs in itself. The one I've most commonly seen is that a person remains suppressed for the full duration, AFTER WW has been killed.","replies":[{"poster":"ActualPain","date":"2014-11-03T02:40:59.518+0000","up_votes":1,"down_votes":0,"body":"I believe that is not a bug, but simply WW's ult. Since it is casted as an ult, I think it still pops off the full suppression duration regardless of him dying. Can anybody confirm or deny? I don't wanna be wrong on this","replies":[]}]}]},{"poster":"Direwolfiez","date":"2014-11-02T22:22:18.719+0000","up_votes":1,"down_votes":0,"body":"Yep, Dunkey was a video of the exact same thing happening.  Not just you.","replies":[]},{"poster":"AsphodelNext","date":"2014-11-02T17:58:36.622+0000","up_votes":1,"down_votes":0,"body":"I saw the fix somewhere, it's to smartcast your Q once. Then you should be able to use it again. Still annoying though.","replies":[]}]},{"poster":"Aids cuz League","date":"2014-11-02T11:15:43.778+0000","up_votes":3,"down_votes":0,"body":"Its a bug because with Azirs ult it counts as Terrain for the enemy team, for the team who has the Azir its basically a speed boost gate. Imagine an Anivia Wall that gave you Frosty tracks or something, for enemies it slows, but for you it gives you 10% extra movement speed plus anyone following you gets slowed by 20% Sion's ult if collided with terrain stops it, its a bug and it can be a really broken one. Because if timed poorly it can ruin a team fight, or if timed properly it can destroy in a team fight.","replies":[]},{"poster":"AHeroNamedHawke","date":"2014-11-02T08:29:41.509+0000","up_votes":3,"down_votes":0,"body":"It also collides with Azir's soldiers \n\nand Shaco boxes","replies":[{"poster":"AtheosisX","date":"2014-11-02T17:03:25.031+0000","up_votes":1,"down_votes":0,"body":"> It also collides with Azir's soldiers \n> \n> and Shaco boxes\n\nThresh's lantern too.  It's rather annoying some of the things that trigger it.","replies":[]}]},{"poster":"Wehrmacht Bunny","date":"2014-11-02T15:34:50.208+0000","up_votes":2,"down_votes":1,"body":"Doesn't surprise me at all. There's a ton of bugs with Azirs R. Still waiting on Riot to fix it.","replies":[{"poster":"Ch4d ThunderD1ck","date":"2014-11-02T19:39:13.111+0000","up_votes":1,"down_votes":0,"body":"> Yes this is fixed in the next patch.","replies":[{"poster":"Junkο","date":"2014-11-03T15:09:57.704+0000","up_votes":1,"down_votes":0,"body":"Riot posted that 20 hours ago, he posted that 24 hours ago","replies":[]}]}]},{"poster":"Bardsbard","date":"2014-11-23T06:12:32.375+0000","up_votes":1,"down_votes":0,"body":"Also it does say sion ult cannot pass through walls and azir ult is a wall after all","replies":[]},{"poster":"Bardsbard","date":"2014-11-23T06:09:31.650+0000","up_votes":1,"down_votes":0,"body":"its not a bug azir ult is just a normal wall that gets put in your face just like anivia wall but only you cant jump over it only teli over it","replies":[]},{"poster":"Bad Havok","date":"2014-11-03T20:29:03.037+0000","up_votes":1,"down_votes":0,"body":"sion is so bugged its not even funny","replies":[]},{"poster":"AsReelAsItGets","date":"2014-11-02T22:25:31.104+0000","up_votes":1,"down_votes":0,"body":"that is an issue isn't it?","replies":[]},{"poster":"Rikari","date":"2014-11-02T19:32:52.436+0000","up_votes":1,"down_votes":0,"body":"well he cant wall jump with his ult soo...\nunstoppable force vs immovable object","replies":[]},{"poster":"Ironclad Dragon","date":"2014-11-02T16:09:04.945+0000","up_votes":1,"down_votes":0,"body":"Azir's R counts as player-generated terrain, I think.","replies":[{"poster":"DocRedgrave","date":"2014-11-02T18:32:39.843+0000","up_votes":1,"down_votes":2,"body":"Bingo. I always pick Azir or Trundle if the enemy takes Sion because of this.","replies":[]}]},{"poster":"chumbler","date":"2014-11-02T22:38:01.256+0000","up_votes":2,"down_votes":4,"body":"Friendly reminder that the Sion rework was not intended to produce a viable champion.","replies":[]},{"poster":"KowaiKami","date":"2014-11-02T23:42:02.938+0000","up_votes":2,"down_votes":7,"body":"Riot in its infinite wisdom has 3 latin servers, and one NA server. super duper smart. Why do they have 3 servers....they don't even have clean water.... Us east coast players are stuck playing at 130-140 ping everygame. I switched to LAN and play at 40 ms...guess what? i jumped up a whole tier...and im still climbing. The pros are Cali in for the ping while Riot gives a middle finger to the rest of us. I made the realization that they aren't good....they are just at really low pings.","replies":[]}]}