{"poster":"kelerdin","date":"2015-02-14T21:46:13.020+0000","title":"Reports","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":4,"body":"Riot iam getting report messages like after every game i dont even know why i even got chat restricted for 44 games and ranked restricted for 24 draft pick wins . Ive finished my punishment for chat restriction now iam afraid of getting restricted again iam not doing anything is there maye a mistake or something like that ? cuz i dont get it like 2 weeks ago i got a mail ( on my email ) from riot in spanish from setting back my password .... crazy thing bout that .. well iam not spanish and i didnt wanted to change my password .. maybe this connects iam scared now and i just want these report messages to stop cuz its just annoying that i get report messages after every game please help me dear riot team .{{item:3070}}","replies":[{"poster":"MrTodForever","date":"2015-02-14T21:52:44.664+0000","up_votes":2,"down_votes":0,"body":"This is neither the English nor the Spanish Forum. If you want to talk English feel free doing so in the English Forum. Otherwise all here would appreciate if you would talk German (for this is the German Subforum).\n\n[EDIT] Attempt one deciphering this:\n>Dear Community\n\n>recently my access to the ranked queue and the chat was restricted as a Result of recent and repeated misbehavior on my side and for that I am sincerely sorry. But while I've worked off those restrictions, I am still getting notifications that I get reported. Can anyone help my preventing another incident like those which got me restricted in the first place. Of cause I've read the Guideline on improving my behavior (because in my situation everything else would be stupid)\n\n>Also i am getting Spanish Spam.\nWith best regards,\nkelerdin\n\nwas that so hard?","replies":[{"poster":"kelerdin","date":"2015-02-15T11:48:23.873+0000","up_votes":1,"down_votes":1,"body":"Sorry i was in panic and thanks for your edit and comment ^^ but theres 1 more problem. Iam getting friend requests from people i dont know and theyre lvl 1 have 0 xp and 0 games played ( probably bots ) Yesterday i got a request from melodicgg you can check this one i think well.... I dont know how i should react to this because i always denie but iam asking myself who are those people and what do they want from me","replies":[]}]}]}