{"poster":"kelerdin","date":"2015-06-10T17:00:37.211+0000","title":"Wurde aus einem Ranked Game geworfen und kann die verbindung nicht mehr herstellen trotz Internet","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Unable to connect to the server. Please &lt; a href = &quot; hhtps://support.riotgames.com/hc/en-us/articles/201752664&#039;target=&#039;blanc&#039;&gt;&lt;u&gt;check your network connection &lt;/u&gt;&lt;/a&gt; and attempt to reconnect to your game das Problem ist das mein Internet einwandfrei funktioniert und ich keinerlei Fehler bei meiner Verbindung besitze ich habe bereits versucht LoL Client als Administrator auszuf&uuml;hren und habe meinen Router neu gestartet jedoch kann ich mich nicht wieder der Partei anschlie&szlig;en . Wenn ich deshalb in irgendeiner Weise bestraft werden sollte z.B Leaverburst kann ich mich nur so dazu &auml;u&szlig;ern das ich nichts  daf&uuml;r kann und den Fehler nicht erkenne . Mfg Kelerdin","replies":[{"poster":"NeroNerd","date":"2015-06-12T20:32:26.275+0000","up_votes":1,"down_votes":0,"body":"Habe das selbe problem wen ich oft genug reconnte komme ich auch wieder rein nur dan verliere ich alle 2 min die verbindung{{item:2047}}","replies":[]},{"poster":"playstudent13","date":"2015-06-10T18:04:09.246+0000","up_votes":1,"down_votes":0,"body":"Scheint als wurdest du Opfer eines Drophacks","replies":[{"poster":"timCologne","date":"2015-06-10T19:38:56.135+0000","up_votes":1,"down_votes":0,"body":"Was ist denn ein Drophack?","replies":[{"poster":"kelerdin","date":"2015-06-11T14:18:10.446+0000","up_votes":1,"down_votes":0,"body":"Ich bezweifle stark das dies ein drophack war da die meist ingame geschehen. Erklärung drophacks sind programme von bestimmten hackern die z.B ingame dieses Programm nutzen um somit das gegnerische Team aus dem Spiel zu werfen um z.B die Midlane durchzupushen oder ggf einen Teamfight zu gewinnen . Ich meine das es irgendetwas mit den Servern zu tun hat und hoffe das dieses Problem so schnell wie möglich gefixt wird ich danke euch allen jetzt schon für eine tolle Rückmeldung hätte keine Antworten erwartet ^^ Gj Leute :){{summoner:31}}","replies":[]}]}]},{"poster":"kelerdin","date":"2015-06-10T17:05:46.200+0000","up_votes":1,"down_votes":0,"body":"Nun werde ich als online angezeigt und das gesammte Match wurde einfach abgebrochen als nie was geschehen ist .. Ich würde mich über eine Antwort sehr freuen da ich nun wirklich verwirrt bin","replies":[{"poster":"Devadon","date":"2015-06-11T13:50:52.438+0000","up_votes":1,"down_votes":0,"body":"Ich hatte gestern das gleiche Problem, und gerade wieder das selbe. ich habe einen Freund gefragt ob er gerade auch Verbindungsprobleme hat (kann ja an dern Servern liegen), aber er meinte das sei nicht der Fall. Er sagte das vielleicht ein Hack im Spiel war, der das ganze Game gelöscht hat. - Ist das vielleicht dieser Drophack? weil so langsam habe ich wirklich keine Lust mehr mich damit rum zu Ärgern.","replies":[]}]}]}