{"poster":"Glaums","date":"2016-08-11T12:32:22.766+0000","title":"Wertung bei AFK","subforum":"Champions & Gameplay","up_votes":2,"down_votes":3,"body":"Hallo,\r\n\r\nich m&ouml;chte den Topf mal wieder aufmachen, auch wenn es ein altes Thema ist. Ich bin Bronze 5 und wahrscheinlich geh&ouml;re ich auch dahin. Was jedoch massiv die Spielfreude nimmt, sind die verlorenen LP durch AFKler. Seit ich wieder angefangen habe, sind das gesch&auml;tzte 33% aller Spiele. Flamer kann ich muten, AFKler nicht. Ich trage dabei ihre Schw&auml;che immer mit. Mein vorletztes Spiel hatte zwei AFKler dabei und dennoch haben wir es geschafft uns bis zur 52. Minute zu halten. Ich habe in diesem Spiel eine S-Wertung erhalten und 23 LP verloren. Die Tatsache, dass AFKler so h&auml;ufig vorkommen, bei der Wertung der LP jedoch nicht mit ber&uuml;cksichtigt werden, verzerrt in meinen Augen meine Leistugseinsch&auml;tzung. Was ist denn so schwer daran, bei einem AFKler, die Wertung f&uuml;r die Verlierer einfach zu senken und dem AFKler entsprechend zu erh&ouml;hen. Dann w&auml;re eine Aussage wie: Du hast diesen Champion  bestm&ouml;glich gespielt, aber Deine Leistung in dieser Elo wird gesenkt, nicht mehr drin. \r\n\r\nIch verstehe, dass man verhindern will, dass im Falle einer Niederlage das Verliererteam einen Spieler AFK gehen l&auml;sst, um keine Punkte zu verlieren, wenn dass den AFKler jedoch alle negativen LP einbringt (das sind das so zwischen 50 und 125), dann w&uuml;rde ich behaupten macht das niemand, freiwillig. Bei TDC w&auml;re dann nur noch zu unterscheiden, ob es am Server oder am Spieler lag. Was meint ihr dazu?\r\n\r\nGru&szlig; \r\nGlaums","replies":[{"poster":"Glaums","date":"2016-08-11T16:57:57.720+0000","up_votes":1,"down_votes":0,"body":"@Good Guy Putin\nWenn Du der Meinung bist, dass ich die Unwahrheit sage, dann bitteschön, aber auf dieser Basis brauchen wir das Gespräch nicht weiterführen.\n\n@Awesane\nIn Ordnung, ich verstehe worauf Du hinaus willst. In diesem Fall wäre die Lösung für den Sieg bei AFK weder Punkte zu verteilen noch abzuziehen. Das würde natürlich alle und nicht nur die Verlierer ärgern, aber es wäre gerechter. So habe zumindest ich das Gefühl, dass ich wegen meiner mangelnden Fähigkeiten verliere, sondern öfter eben auch wegen AFK. Na dann hoffe ich mal, dass sich das wirklich über lange Zeit wieder ausgleicht. Spielen, spielen, spielen und hoffen nicht so viele AFKs zu erwischen.","replies":[{"poster":"Awsane","date":"2016-08-11T19:03:36.779+0000","up_votes":1,"down_votes":0,"body":"Ich weiss nicht\nkeine Punkte bei AFK zu verteilen bestraft öfter die Sieger als die Verlierer (weil es werden 5 Gegner bei deren Win bestraft und nur 4 aus dem Verlierer Team)\n\n\nviele afk´s entstehen dadurch, dass man am verlieren ist, für die andere Option gibt es ja mitlerweile Remake (wenn jemand gar nicht ins spiel kommt)\nes würde zudem dazu führen, dass einige Leute afk gehen um den Gegner nicht den Sieg zu geben, weil sie denken er hätte ihn nicht verdient\n\n\n\n\ngenerell will ich sagen, das man nie komplette Fairness hinbekommen wird, es wird immer etwas geben, über das man sich beschweren kann(Eltern lassen ein nicht genug zeit zum üben; die Sonne scheint ungünstig auf meinen Bildschirm, der Gegner maint ausgerechnet den Counter zu meinen main, mein main ist durch die aktuelle meta recht schwach, meine Eltern haben mir schlechtes aiming Reaktionszeit vererbt,....), ein guter Spieler zeichnet sich dadurch aus, das er sich über diese Wiedrigheiten hinwegsetzen kann und dennoch gewinnen kann, du wirst dich mit dieser Unfairness (im gesamten Leben)einfach abfinden müssen und deine Einstellung zum Spiel dementsprechend anpassen, wenn du aufsteigen willst\n\n\n\nPS bitte benutze  die kommentieren/antworten Funktion, so bekommen wir eine Nachricht im Forum das jemand geantwortet hat, war nur durch Zufall nochmal hier, normalerweise hätte ich das sonst nicht gesehen\n\nLG Awsane","replies":[{"poster":"Glaums","date":"2016-08-12T09:32:07.348+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Awsane,realm=EUW,application-id=Wj1wcocU,discussion-id=7qifE8kL,comment-id=00050000,timestamp=2016-08-11T19:03:36.779+0000)\n>\n> Ich weiss nicht\n> keine Punkte bei AFK zu verteilen bestraft öfter die Sieger als die Verlierer (weil es werden 5 Gegner bei deren Win bestraft und nur 4 aus dem Verlierer Team)\n> \n> \n> viele afk´s entstehen dadurch, dass man am verlieren ist, für die andere Option gibt es ja mitlerweile Remake (wenn jemand gar nicht ins spiel kommt)\n> es würde zudem dazu führen, dass einige Leute afk gehen um den Gegner nicht den Sieg zu geben, weil sie denken er hätte ihn nicht verdient\n> \n> \n> \n> \n> generell will ich sagen, das man nie komplette Fairness hinbekommen wird, es wird immer etwas geben, über das man sich beschweren kann(Eltern lassen ein nicht genug zeit zum üben; die Sonne scheint ungünstig auf meinen Bildschirm, der Gegner maint ausgerechnet den Counter zu meinen main, mein main ist durch die aktuelle meta recht schwach, meine Eltern haben mir schlechtes aiming Reaktionszeit vererbt,....), ein guter Spieler zeichnet sich dadurch aus, das er sich über diese Wiedrigheiten hinwegsetzen kann und dennoch gewinnen kann, du wirst dich mit dieser Unfairness (im gesamten Leben)einfach abfinden müssen und deine Einstellung zum Spiel dementsprechend anpassen, wenn du aufsteigen willst\n> \n> \n> \n> PS bitte benutze  die kommentieren/antworten Funktion, so bekommen wir eine Nachricht im Forum das jemand geantwortet hat, war nur durch Zufall nochmal hier, normalerweise hätte ich das sonst nicht gesehen\n> \n> LG Awsane\n\nHm, ganz schön provokant eher offensichtliche Ausreden mit einem AFK gleichzusetzen, der eine objektiv starke Ursache für eine Niederlage ist. Ich finde Team- und Spielerleistung bei der Häufigkeit von AFKs gleichzusetzen sehr frustrierend und spielspaß mindernd. Natürlich freue ich mich, wenn ich aufsteige, aber es ist auch ok, wenn ich in meiner Elo bleibe. Was halt einfach keinen Spaß macht ist immer wieder zu sehen, wie gewonnene Punkte wegen AFK den Bach hinunter gehen. Man fühlt sich in dieser Situation einfach Umständen ausgeliefert, welche mit dem eigenen Können nichts zu tun haben. \n\nInsofern würde ich eine Bewertung begrüßen, welche wie bei den Championpunkten von einer Analyse des Spielerverhaltens im Spiel ausgeht. Gerade für die DynamicQ, wo man nur kurzfristig als Team zusammen gewürfelt wird, wäre dies eine faire Lösung. Ich meine die (Aus)Wertung gibt es ja schon. So könnte man bei guten Leistungen selbst in einem verlorenen Spiel Punkte bekommen (und umgekehrt). Jemanden hochzuboosten wäre damit auch Geschichte. Flame könnte ein wenig gemindert werden, weil Leute die gute Leistungen bringen, wissen dass sie diese auch unabhängig vom Ausgang des Spiels gewürdigt bekommen. Nur ein spontaner Gedanke. ;)\n\nPS: Danke für den Hinweis mit dem Zitat un der Benachrichtigung!","replies":[]}]}]},{"poster":"Call me Br00t","date":"2016-08-11T12:49:46.930+0000","up_votes":1,"down_votes":0,"body":"naja dafür gibts eig ja remake nur funzt das nicht wenn die nach min 20 nen rq abziehen ...","replies":[{"poster":"1 very treey boi","date":"2016-08-11T20:13:47.574+0000","up_votes":1,"down_votes":0,"body":"in der regel sind rq in der 20 min aber dadurch bedingt, dass es flamer, feeder, troller, afkler oder alles kombiniert gibt, denn wer rq in der 20 min wenn man am gewinnen ist","replies":[{"poster":"Call me Br00t","date":"2016-08-11T22:32:36.245+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MIFMANMEISTER,realm=EUW,application-id=Wj1wcocU,discussion-id=7qifE8kL,comment-id=00000000,timestamp=2016-08-11T20:13:47.574+0000)\n>\n> in der regel sind rq in der 20 min aber dadurch bedingt, dass es flamer, feeder, troller, afkler oder alles kombiniert gibt, denn wer rq in der 20 min wenn man am gewinnen ist\n\nIdioten gibts überall ^^","replies":[]}]}]},{"poster":"Good Guy Putin","date":"2016-08-11T14:38:10.342+0000","up_votes":1,"down_votes":0,"body":">Flamer kann ich muten, AFKler nicht\n\nDoch kann man.\n\nUnd mal ehrlich 33% aller Spiele einer Afk? Da nehme ich dir nicht ab.","replies":[{"poster":"Ireliα","date":"2016-08-11T16:32:13.778+0000","up_votes":1,"down_votes":0,"body":"Ich konnte es auch nicht glauben bis ich mal einem Freund in dieser Region zuschauen durfte. Es ist unfassbar wie viele Leute da unten Afk gehen. \nOb es technische Probleme, ein Ragequit oder die nörgelnde Mutter ist kann ich nicht beurteilen. Aber definitiv werden es immer weniger je weiter man aufsteigt.","replies":[{"poster":"Good Guy Putin","date":"2016-08-11T17:41:18.177+0000","up_votes":1,"down_votes":0,"body":"Na dann gute nacht xD","replies":[]}]}]},{"poster":"Glaums","date":"2016-08-11T14:08:48.333+0000","up_votes":1,"down_votes":0,"body":"@awesane\nDen ersten Punkt verstehe ich nicht. Die aktuelle ELO-Angabe wird durch AFKler ja verzerrt, weil eine Teamwertung vorgenommen wird, statt eine Einzelwertung und in dem einen Team einfach mal weniger sind. Inwiefern beasiert die Angabe dann auf den Skill-Unterschied? Wenn AFKler die Ausnahem wären, würde das wohl untergehen, aber nicht bei der aktuellen Häufigkeit. Das ist ja genau das, was mir die Freude nimmt, dass es eben nur die Stärke einer Gruppe mit AFK wieder gibt und nicht meine. Das mit dem Aufsteigen stimmt meiner Meinung nach nicht. Nur weil man für eine AFK-Niederlage keine Punkte abgezogen bekommt, steigt man ja nicht auf. Man wird nur vom System nicht im Skill herab gezogen, wenn die eigene Leistung im Spiel dem überhaupt nicht entsprach. Gute Leistung bleibt auch bei diesem Ansatz unhonoriert, aber das wäre immer noch besser, als nur im Team bewertet zu werden und durch AFKler nach unten gezogen zu werden.\n\nPunkt zwei ist richtig. So gesehen wäre dann eine Zeitsperre wohl sinnvoller\n\n@MeMyselfandBaal\nErstens kann Riot ausmachen, ob jemand einfach stehen bleibt, bewußt aus dem Spiel geht oder es einen technischen Grund gab. Darauf bin ich oben ja eingegangen. Zweitens ist das mit der Statistik immer so eine Sache. Sie greift erst bei sehr großen Zahlen. Da hast Du grundsätzlich Recht, ich im Augenblick aber einfach nur Pech. =/","replies":[{"poster":"Awsane","date":"2016-08-11T14:43:43.865+0000","up_votes":1,"down_votes":0,"body":"das Problem ist nicht, das du keine MMR punkte bei einer Niederlage abgezogen bekommst, sondern das in diesem Fall einfach welche in das System eingeführt werden, was nicht geht.\n\nJeder Spieler bringt eine gewisse Elo Punkte in das System, wenn er anfängt rankeds zu spielen (sagen wir mal 1200) und die Anzahl an Punkten im System bleibt gleich, sprich bei einer Niederlage bekommst du -2 Punkte und der Gegner +2, sprich wenn du alle Elopunkte aller Spieler zusammenrechnen würdest und durch die Anzahl der Ranked Spieler Teilst kommst du auf genau 1200 (es können nämlich keine Punkte entstehen oder verloren gehen)\n\nwürde man nun Spieler die -2 erlassen würde auf lange Zeit mehr Elo im System Pro Spieler sein (weil ja nur die Gegner +2 Punkte bekommen du aber keine abgezogen bekommst). Das Liga System orientiert sich aber daran wieviele Punkte du hast und ordnet dich dementsprechend einer Liga zu, die angeben soll wie gut du im vergleich zu anderen bist (Master+ besten 0,01% , Dia beste 1%, Platin beste 5%, Gold besten 25%, Silber besten 50% , Bronze Rest und diese Grenzen sind an gewisse Elopunktzahlen gebunden ich weiss keine genauen Zahlen dafür aber sagen wir einfach Silber fängt bei 1200 an um es zum verstehen). Wenn nun viele Spiele gespielt werden wird auf dauer also eine ganze Menge zusätzlicher Punkte im System und sich diese Punkte homogen über alle Liegenbereiche verteilen.\nDie Punkte werden sich gleichmäßig über das System verteilen weil das was man abgezogen, dazu bekommt abhängig davon ist welche Punktzahl man im vergleich zu den Gegner hat, verlierst du gegen jemanden mit mehr Punkten als du verlierst du weniger als wenn du gegen jemanden verlierst der weniger Punkte als du hast. (sprich bis auf ein paar ausnahmen ganz oben in der ladder und ganz unten bekommt jeder das selbe an Punkten umsonst dazu, und du musst schon sehr tief in Bronze 5 sein um wirklich in diesem Bereich zu sein du müsstest in den 0,1% der schlechtesten Lol Spieler gehören um von diesem Effekt nicht zu profitieren)\n\nSagen wir mal jeder Spieler bekommt einfach 1200 Punkte so umsonst dazu. Nun wäre jeder Silber und niemand mehr Bronze und Silber würde nicht mehr angeben, dass du zu den beste 50% der Spieler gehörst.\nDas wäre die Elo Inflation","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2016-08-11T14:00:29.762+0000","up_votes":1,"down_votes":0,"body":"ähm... also... erstens: Wie sehr regst du dich dann auf, wenn du ein Mal Stromausfall hast. Oder dein Internetanbieter einfach mal sagt \"Nö, ich streike jetzt\"... ich hatte letzteres Beispiel letztens. Mit offizieller Entschuldigung seitens des Anbieters. Hätte ich es jetzt verdient wegen dieses komplett unverschuldeten AFKs von Gold II nach Gold III abzusteigen? Das ist doch eine viel zu heftige Strafe.\n\nUnd Riot kann halt den Unterschied zwischen einem Ragequit und einem unverschuldeten Problem nicht feststellen. Alles, was die machen können, ist die Leute, die Regelmäßig AFK gehen bestrafen und diejenigen, bei denen es eine absolute Seltenheit ist, relativ ungeschoren davonkommen zu lassen. \n\nBedenke einfach folgendes: Du spielst statistisch gesehen häufiger 5vs4 als 4vs5. Also unter der Voraussetzung, dass du selber nie AFK gehst und dein Verhalten auch keine Ragequits bei deinen Mitspielern förderst (also immer freundlich bist). Damit kriegst du langfristig eher mehr LP durch AFKler als du verlierst.\nGehe einfach mal alle deine Spiele durch, die dein Gegner nicht zu 5. beendet hat. Das müssten mindestens genau so viele sein.","replies":[]},{"poster":"Awsane","date":"2016-08-11T13:00:51.614+0000","up_votes":1,"down_votes":0,"body":"Das was du willst, geht aus mehreren Gründen nicht\n\nDer 1. und wichtigste wäre Elo Inflation, weil das ganze System relativ auf den Skill unterschied zwischen den Spielern basiert\nso müssen Elopunte des Besiegten abgezogen werden und diese Punkte werden den Gewinner gutgeschrieben. Wäre das nicht der Fall würde auf lange Zeit immer mehr Leute Aufsteigen und so würden die Unteren Elo Regionen immer weniger Spieler beinhalten, was die Ladder als solche usless machen würde, weil sie keine Aussagekraft mehr hätte (was ja ihr Sinn sein soll)\n\nUnd es ist nicht möglich Afkler 5 Fach die Punkte abzuziehen und dir keine, das würde das ganze System durcheinanderbringen (5 niederlagen in Folge wäre ein drastische mmr verlust- er würde also danach gegen Leute spielen, die garnicht auf seinen Skill Level sind, sprich er würde dahin zurück klettern recht schnell wo er momentan ist. Es werden bei sowas also die zukünftigen Gegner dafür bestraft, das diese Person einmal AFK gegangen ist, was ja auch nicht der Sinn sein kann.","replies":[]}]}