{"poster":"XsR reddaS","date":"2016-06-10T22:39:40.556+0000","title":"Cual es la linea que mas carrea según tu?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Yo pienso que siempre termina carreando el mid xD","replies":[{"poster":"Btta","date":"2016-06-10T23:26:03.553+0000","up_votes":2,"down_votes":0,"body":"Es difícil de decidir.\n\nPrimero que todo, para mí, varía según la composición que tenga el team y por lo tanto, los picks. Si tienes una composición donde el mid pase a ser de utilidad con la finalidad de darle más vida a tu adc, entonces el que carrea la partida es el adc.\nAlgo similar pasa con composiciones de doble tirador, donde el team se enfoca más en darle las kills que necesita al jg y al adc.\nAsí lo veo yo al menos en competitivo, ya que en \"\"\"\"Solo Q\"\"\"\" es un poco diferente.\n\nSi tuviera que elegir líneas por su \"potencial\", diría yo que la más acarreadora es la jungla, seguida de mid o bot (por el daño increíble que hacen los tiradores, vamos, que es la gracia de los adcarry).\n\nSalu2 {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Shijim4 de Virgo","date":"2016-06-10T22:44:04.970+0000","up_votes":1,"down_votes":0,"body":"Complicado (ten en cuenta que el campeon que eligas tambien depende) pero por lo general el mid o el JG son los que mas presencia tienen en el early y meten en snowball al equipo y a uno mismo (obvio) asique si MID seguido de JG","replies":[{"poster":"ProdirexPlay","date":"2016-06-10T23:03:42.466+0000","up_votes":2,"down_votes":0,"body":"yo creeria que es jg seguido de mid ya que el jg tiene la posibilidad de dar ventajas a las demas lineas sin tener que romear y por lo tanto perder farm que tu oponente en linea tendra y se traducira en oro y objetos para el si es que tu romeo sale mal.","replies":[{"poster":"Hísøka","date":"2016-06-11T00:56:51.130+0000","up_votes":1,"down_votes":0,"body":"Si estamos hablando de ligas bajas el Mid es el principal carri ya que digamos la verdad no los ganks no siempre tienen éxito y el 70% de las partidas que se ganan son por que el mid esta fedeado.\n\nPD: de que te sirve un adc si llega una Diana o un Fizz o un Zed y te matan de 2 golpes? puede tener mucho daño pero si se muere antes de darse cuenta no creo que pueda carrear mucho que digamos.","replies":[{"poster":"ProdirexPlay","date":"2016-06-11T19:04:10.511+0000","up_votes":1,"down_votes":0,"body":"el adc no muere facil, tenes que saber posicionarte y tu suport debe saber cuidarte, si fuera como decis los adc se jugarian tanques y no tendrian porque gastar oro en daño en ves de vida y armadura, ademas la mayoria de adc se arman el angel guardian al final para que cuando un zed fizz o diana se gasten el combo en ti no tengan nada para matarte cuando revives o tampoco nada para aportar en tf ya que tendran todo en cd","replies":[{"poster":"Hísøka","date":"2016-06-11T19:07:24.501+0000","up_votes":1,"down_votes":0,"body":"Y vos te pensas que en lo que revives con ángel guardián con un 30% de tu vida una diana o un fizz no tendrán un combo de nuevo? la Q de diana carga en tan solo 3,5 seg y la Q de fizz en tan solo 3 seg  ademas de eso estamos hablando de ligas bajas lo que seria el 70% de los jugadores por lo que no todos saben posicionarse con un ADC.","replies":[]}]}]}]}]},{"poster":"Hellkus","date":"2016-06-11T19:35:58.687+0000","up_votes":1,"down_votes":0,"body":"en mi opinion personal basada en mi experiencia en el juego,(juego desde la s2) generalmente es a jungla man, si el jungla hace mal su trabajo , (farmea mucho,gankea mal,(esto va de la mano en tener una buena coordinacion con sus compañeros a la hora del gank, no siempre es su culpa si el gank no sale,) pushea poco las lanes, no esta con el team, no inicia, sigue la kill como enfermo, no esta atento de los dragones. gankea solo cuando te estan pusheando, no hacer contragank, divear mal, no saber hacerlo o no lo hace. generalmente se pierde una partida. importa muchísimo el jungla en el equipo a la hora de la victoria, tanto asi, que las partidas se definen un 40% en el desempeño de su jungler. en mi humilde opinión, saludos","replies":[]},{"poster":"Vi Sexual","date":"2016-06-11T01:18:24.084+0000","up_votes":1,"down_votes":0,"body":"La linea en la cual este yo con {{champion:254}}.\n\nFuera de broma, si sabes cual es tu rol, podes carrear en cualquier linea. La mayoria de la gente piensa que \"carrear\" es tirarse en una tf y hacer todo el daño, y muchas veces las partidas te las carrea el jungla haciendo buenos calls, o el sup wardeando en las entradas a los objetivos, o un top que rota y splitpushea.","replies":[]},{"poster":"FedecarboneroUY","date":"2016-06-11T00:43:04.017+0000","up_votes":1,"down_votes":1,"body":"para mi depende del Champ nomas, no de la posicion, imaginate una partida donde van todos mal pero tu {{champion:161}};{{champion:63}}  o {{champion:143}}  supports te carrean, y no es algo que no pase nunca ..","replies":[]}]}