{"poster":"XsR reddaS","date":"2016-12-26T05:04:03.353+0000","title":"Duda existencial de un main Nasus","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Este ultimo tiempo he estado poniendo en la balanza ambos tipos de Nasus:\r\n\r\n1.- Nasus Old School: Farmear la Q minimo 300 - 400 stack minuto 20, {{item:3078}} y lo demas tanke.\r\n2.-Nasus New School: Ignorar los stacks de la Q y dar prioridad a pushear con la E acompa&ntilde;ado de {{item:1056}} {{item:1056}} para luego molestar con esto {{item:3512}} \r\n\r\nAmbos Nasus me han dado partidas y otras han hecho que solo sea un estorbo, necesito concejos, pros y contras de ambas maneras de usar a Nasus, en mi opini&oacute;n personal.\r\n\r\nEl Nasus 1 destaca si puedes sacar el {{item:3057}} en early para as&iacute; estompear a tu contrario y la partida entera, de otro modo solo debes jugar pasivo y stakear la Q.\r\n\r\nEl Nasus 2 es fuerte en early, es bully lane con el contante pockeo de la E ademas de que los dejas bajo torre muy f&aacute;cilmente para castigarle ah&iacute;, pero lo malo de ese nasus es cuando ya has botado las torres tier 1 y 2 de tu linea, es muy complicado bajar las de inibidor dado que para entonces ya tus 2 anillos de doran los habr&aacute;s vendido para tener espacios para tankearte, en este punto de la partida (minuto 30- 40 aprox) ya no tienes da&ntilde;o alguno (tendr&aacute;s unos 40- 60 stacks de la Q), solo eres un saco de boxeo que resiste para tus compa&ntilde;eros, y muchas veces por esa perdida de da&ntilde;o a esas alturas de la partida las he terminado perdiendo, porque dependo exclusivamente de mis compa&ntilde;eros :/\r\n\r\n______________________________________________________________________\r\n______________________________________________________________________\r\n\r\n_Un Main Nasus Confundido :C_ {{champion:75}}","replies":[{"poster":"Natchin","date":"2016-12-26T15:57:32.317+0000","up_votes":3,"down_votes":0,"body":"Depende de quien tengas en frente.\n\nSi vas contra una riven probablemente no podrás stackear la Q, así que será mejor hacerte el nuevo con la E y el portal ZZ. Ahora bien, si tienes un enfrentamiento fácil, como un malphite, dedicate a farmear la Q y ya está, GG IZI.\n\nEl nasus de presión de línea se inventó para cubrir su debilidad frente a enemigos con excelente early. Siempre ten eso en cuenta.","replies":[]},{"poster":"Mugii","date":"2016-12-26T07:50:13.475+0000","up_votes":3,"down_votes":0,"body":"{{item:3025}}  es mucho mejor que {{item:3078}}  porque es mucho más barato, te da más mana y armadura. Tiene CDR que tiene {{item:3078}} y la misma pasiva pero con menos daño.\nNo necesitas items que te den daño porque para eso farmeas la Q. Podes alcanzar 40% CDR comprando este item y algun otro componente que dé 10% CDR como {{item:3067}} o el item completo {{item:3065}}.\nPero en definitiva:\nOld school Nasus = carry low elo, mi preferido, amo hacer 1vs2 o 1vs3 y terminar con el triplekill y con la torre.\nQuasus = presión en early. Útil en high elo, una especie de {{champion:74}} .","replies":[]},{"poster":"RodriiB","date":"2016-12-26T14:19:54.420+0000","up_votes":2,"down_votes":0,"body":"Soy main top, aunque no jugué mucho nasus me enfrentó bastante seguido al campeón y puedo decirte que:\n\n- Guantelete es mucho mejor a la trinidad, ambos te dan cdr 20%, la trinidas algo más de daño pero el guantelete te aporta muchísimo mana, y armadura. \n\n- Considero que la mejor maestría es cabalgatormentas, por encima de todas las otras.\n\n- El nasus farmer > nasus doran PERO es porque la gente es extremista, si juegan al nasus Q,Q,Q,Q solo frizean la linea y juntan cargas, y Si juegan al Nasus pusher, Solo pushean y no juntan cargas.\n\n- Lo mejor para mi: Pushear, molestar, juntar cargas, y SIEMPRE armarse el brillo, por más que después te armes un  zz o lo que sea. A lo que voy es, no dejes de farmer la Q por pushear, y Pushea farmeando la Q.","replies":[{"poster":"XsR reddaS","date":"2016-12-27T04:55:44.141+0000","up_votes":1,"down_votes":0,"body":"muchas gracias **a ti y a todos **por los concejos me iluminaron con su conocimiento de Nasus y la top lane en general, los aplicare desde ahora en adelante ;D","replies":[]}]},{"poster":"Lince Salvaje","date":"2016-12-26T05:29:09.876+0000","up_votes":2,"down_votes":0,"body":"mmmm yo lo estoy usando como un pick seguro...\n\nLa build que le hago es \n{{item:3065}} {{item:3110}} {{item:3083}} {{item:3742}} {{item:3009}}  y de ultimo {{item:3075}} {{item:3102}} {{item:3800}}  dependiendo la situacion.\nLo que si es mio es un viejo nasus, paso farmeando la Q con la diferencia que lo uso 45% CDR\nmas o menos al min 10 ya tienes la Q cada 2 segundos (literal)\ny si te va medianamente bien en linea compras {{item:3024}} +{{item:3067}}  en el primer back, con eso tienes un 38% de CDR mas o menos al min 7 y 8.\n \nLa verdad a mi no me gustan los nasus que usan {{item:3078}}  xD como que le quita algo de potencial... aunque potencia un poco el basico, pero quien lo necesita si tienes de 400 a 600 cargas en el min 20 xD","replies":[{"poster":"XsR reddaS","date":"2016-12-26T05:36:09.769+0000","up_votes":2,"down_votes":0,"body":"yo uso {{item:3078}} porque hace sinergia con la maestría del cabalga tormentas y el {{summoner:6}} asi eres un rayo xd","replies":[{"poster":"Lince Salvaje","date":"2016-12-26T12:58:54.134+0000","up_votes":1,"down_votes":0,"body":"igualmente al min 10 puedes activar perfectamente la maestría con 2 Q","replies":[]}]}]},{"poster":"Ryûjin Ronin","date":"2016-12-26T05:28:19.132+0000","up_votes":2,"down_votes":0,"body":"El Nasus nuevo se me hace muy maricon, pusheando y corriendo del enemigo, aguante el farmer y tirarse contra todos","replies":[]},{"poster":"DarkGiacfo","date":"2016-12-26T05:08:20.466+0000","up_votes":2,"down_votes":0,"body":"Sinceramente, yo era main nasus hace mucho, pero odio el nuevo nasus de los anillos, ya que al ver un nasus pusheando en top, el jg enemigo dice \"oh, izi gank\", no tenes daño para matarlos asi que es tanquearlos hasta tu torre o morir, prefiero un buen nasus que de una q al minuto 30 saque a un adc de una pelea que un nasus que tire torre rapido, que eso se puede hacer si stompeas tu linea a base de q","replies":[{"poster":"XsR reddaS","date":"2016-12-26T05:14:25.015+0000","up_votes":2,"down_votes":0,"body":"Cuantas risas nos hemos echado deleteando de una Q al adc :'D, yo igual prefiero al Nasus Q farmer, pero aveces no puedes tomarte el tiempo de farmear si te toca contra un enemigo de rango :c y en esas situaciones el otro nasus no sufre ;/","replies":[{"poster":"DarkGiacfo","date":"2017-01-04T12:29:31.009+0000","up_votes":1,"down_votes":0,"body":"en ese caso, usa el otro nasus :v","replies":[]}]}]},{"poster":"Ks Erwyn","date":"2016-12-27T12:34:01.574+0000","up_votes":1,"down_votes":0,"body":"el segundo es aun mas autista que el primero, para que te buildearas para tf si siquiera debes participar en ellas....solo importa tirar torres y fuk el resto.\n\n\nPd. ponte \"the verve - bitter sweet symphony\" mutea a todos y a pushear...","replies":[]},{"poster":"Zoboo","date":"2016-12-26T14:47:39.741+0000","up_votes":1,"down_votes":0,"body":"La gente juega mal el \"quas nasus\" solo porque tenes que pushear no quita que no puedas farmear la Q, jugue las 10 rankeds de flexibles y soloq con nasus, al min 40 tenia 500 stacks tranqui habiendo pusheado toda la linea con zz y los dorans.","replies":[{"poster":"LICENZED","date":"2016-12-26T15:13:24.389+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zoboomafoo,realm=LAS,application-id=v7qsfXsE,discussion-id=PEfs9X7W,comment-id=0008,timestamp=2016-12-26T14:47:39.741+0000)\n>\n> La gente juega mal el &quot;quas nasus&quot; solo porque tenes que pushear no quita que no puedas farmear la Q, jugue las 10 rankeds de flexibles y soloq con nasus, al min 40 tenia 500 stacks tranqui habiendo pusheado toda la linea con zz y los dorans.\n\n500 stacks minuto 40 no es nada. XD","replies":[{"poster":"Zoboo","date":"2016-12-26T16:58:10.658+0000","up_votes":1,"down_votes":0,"body":"Para un nasus que fullea la Q no, pero estaba hablando de fullear E","replies":[]}]}]},{"poster":"Fiky","date":"2016-12-26T06:37:03.370+0000","up_votes":1,"down_votes":0,"body":"yo vi nasus con runas azules de AP por lvl (supongo que con la maestría tambien que te ad/ap xlvl) {{item:3100}} y despues tanque como siempre... la verdad no lo uso tanto (casi nada ultimamente)","replies":[]},{"poster":"DkA Darkito","date":"2016-12-26T05:36:20.713+0000","up_votes":1,"down_votes":0,"body":"Es que la onda de la build de Quas, es establecer una dominación completa de Línea, pero la gente se toma eso como que no hay que farmear y solo pokear, cuando no es así, una vez que estableces tu dominio en línea y tienes al otro toplaner de rodillas, farmeas tu Q todo lo que puedas como lo haría un Nasus normal y después pushear como lo haría cualquier Nasus.","replies":[]},{"poster":"Kyousuke","date":"2016-12-26T05:21:17.145+0000","up_votes":1,"down_votes":0,"body":"yo creo que el mejor es la combinación de ambos osea que pushee con el combo doran+zz PERO que farmee la Q, no digo darle prioridad pero si que cuando pueda lo haga y sobre todo un BUEN team, saber cuando pushear y que tu team pushee o haga objetivos mientras te van 3 a matarte. \ntambién hay que saber cuando ármate que cosa, yo creo que para matchs parejos es mejor el tanque con trinidad y farmeo, ya que vas a sacar ventaja. y para los matchs difíciles armarte el de push para joderle todo lo que puedas y tirarle la torre. es cosa de ver tu forma de juego y adaptarte a la partida según convenga.\nigualmente el nasus de splitpush es un asqueroso XD","replies":[]}]}