{"poster":"XsR reddaS","date":"2016-06-16T05:49:49.765+0000","title":"No me decido si mainear TOP o JUNGLE :/ algún consejo?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Aunque pienso que los buenos junglas se hacen notar mucho mas en la partida que los top laners\r\n\r\n{{summoner:12}} VS {{summoner:11}} \r\n\r\nque opinan ustedes?","replies":[{"poster":"Asefito","date":"2016-06-16T19:33:46.514+0000","up_votes":1,"down_votes":0,"body":"Mainea teemo top y jg, y ve al mundo ARDEEER","replies":[]},{"poster":"rokushoger","date":"2016-06-16T16:35:05.116+0000","up_votes":1,"down_votes":0,"body":"Por capacidad de stompeo no hay una mejor elección, todas las lineas tienen un gran impacto en la partida cada una a su manera. Es cuestión de gustos personales, ahora te sugiero que si sos de enojarte mucho o te afecta lo que digan tus compañeros, entonces no vayas jungla.","replies":[]},{"poster":"Fangtooth","date":"2016-06-16T06:21:18.587+0000","up_votes":1,"down_votes":0,"body":"No vas a mainear nada... y sabes por que?, porque estas buscando que mainear, y una linea sale de uno mismo mainearla... yo maineo jg, y antes odiaba la jg, me salio de la nada ahora ser un buen jg... no dije, uh quiero mainear una linea, cual sera?...","replies":[{"poster":"XsR reddaS","date":"2016-06-16T06:44:52.998+0000","up_votes":1,"down_votes":0,"body":"pido consejos por que me gustan mucho las dos lineas :v","replies":[{"poster":"jordan234","date":"2016-06-16T14:10:39.263+0000","up_votes":1,"down_votes":0,"body":"si maineas top un champ que te recomiendo es \n\n\n{{champion:266}} +{{summoner:12}} {{summoner:14}} +{{item:3153}} +{{item:3031}} = linea segura\n\n\n\nya que aatrox relentiza hace daño en area con su Q y su E da como veneno puede poner su arma a robo de vida o daño adicional al tercer golpe su R le da rango de melee velocidad de ataque daño y es dificil matarlo ya que tiene pozo sangriento que cuando resive daño letal revive por su pozo recupera la mitar almenos de la vida y no ocupa mana solamente ocupa un 1% de su vida digamos que en nivel 1 su Q solamente le quita 37 de vida a aatrox","replies":[{"poster":"KaJhinSa","date":"2016-06-16T14:28:43.540+0000","up_votes":1,"down_votes":0,"body":"Concuerdo, Aatrox es un champ muy bueno (lo digo como main Aatrox) y sinceramente no entiendo porque se suele subestimar ya que es un campeon conmucho daño y un sustain que da miedo.","replies":[{"poster":"rokushoger","date":"2016-06-16T16:33:51.905+0000","up_votes":1,"down_votes":0,"body":"Pienso lo mismo, no es de mi estilo de juego, pero es brutal en buenas manos.","replies":[]}]}]}]}]},{"poster":"Kyousuke","date":"2016-06-16T06:04:56.007+0000","up_votes":1,"down_votes":0,"body":"es facil\nque te gusta mas? los perros y monos {{champion:75}} {{champion:62}} ?\no los lobos y gatos? {{champion:19}} {{champion:76}} {{champion:107}} ? \n\nmainea las 2, normalmente la mayoría de main jg son main top","replies":[]},{"poster":"Little T","date":"2016-06-16T05:52:13.641+0000","up_votes":1,"down_votes":0,"body":"podes mainear las 2, es lo que yo hago, como a mi en lo personal me gustan muchísimo los tanques prefiero ir esas 2 lineas, a parte, muchos personajes de la top lane pueden ir jungla sin problemas","replies":[{"poster":"XsR reddaS","date":"2016-06-16T05:55:46.708+0000","up_votes":1,"down_votes":0,"body":"pero tu en lo personal cual piensas que puede estompear mas una partida?","replies":[{"poster":"Little T","date":"2016-06-16T05:59:27.413+0000","up_votes":1,"down_votes":0,"body":"ishhhh, compleja esa pregunta, si lo que queres es ayudar todo el tiempo a tu equipo jungla es buena opcion, peroooo si lo que queres es ser un tipo que puede \"carrear una partida\" top puede ser buena opcion.\nlo malo de estas lineas: jungla: si empiezas mal es difícil remontar\nlo malo de top: si tu equipo pierde mucho es difícil que la remontes por vos mismo\nen lo personal prefiero mas top","replies":[]}]}]}]}