{"poster":"Das Fluchtholz","date":"2017-05-22T19:35:14.160+0000","title":"Wenn zu viele Hextech-Truhen übrig keine Schlüssel mehr?","subforum":"Allgemeiner Chat","embed":{"description":"Willkommen zu „Frag Riot\"! Dieses Mal dreht sich alles um Schlüsselfragmente, die Spielbalance in League und das 10-Banne-System. Was genau muss ich tun, um Schlüsselfragmente zu gewinnen? Ich habe schon seit Wochen keines mehr erhalten. Als wir mit der Entwicklung der Hextech-Werkstatt begannen, testeten wir ein paar Beutesysteme in anderen Spielen, um uns einen Überblick zu verschaffen.","url":"http://euw.leagueoflegends.com/de/news/community/q/frag-riot-ich-brauche-schlussel","image":"http://euw.leagueoflegends.com/sites/default/files/styles/wide_medium/public/upload/keys.jpg?itok=ycWCwwLd"},"up_votes":1,"down_votes":0,"body":"Langsam habe ich das Gef&uuml;hl Riot vera****t die Leute. Riot meint ja, dass die Truhen nicht zu abfarmen sind und dass das f&uuml;r die Schl&uuml;ssel auch so ist. Aber ich spiele jeden Tag um die 15 - 20 Spiele und gewinne etwa die H&auml;lfte. Eine Truhe schalte ich sofort frei sobalt ich eine neue bekomme, jede Woche. Ich spiele aber jetzt seit fast 2 Monaten die oben genannte Anzahl von spielen jeden Tag und bekomme &uuml;berhaupt keine Schl&uuml;ssel mehr. Ich habe jetzt 5 Truhen in Petto und nicht ein Fragment. Der Zyklus soll ja nach einer bestimmten Zeit zur&uuml;ck gesetzt werden, nur wann soll das bittesch&ouml;n mal passieren? N&auml;chtes Jahr? Auf meinem anderen Account hatte ich ein &auml;hnliches Ph&auml;nomen beobachtet. Da habe ich erst wieder Schl&uuml;sselfragmente bekommen, als ich mir Schl&uuml;ssel f&uuml;r RP gekauft habe, da ich fast einen Anfall bekommen habe nach 10 Truhen die ich nicht &ouml;ffnen konnte.\r\nIch finds ja nicht schlimm, dass ich nur so extrem selten Schl&uuml;ssel bekomme, dann sollen die mir aber weniger Truhen zur Verf&uuml;gung stellen. Dann ist es nicht ganz so frustrierent. Geht es Jemaden genauso wie mir? Oder kann mich hier Jemand aufkl&auml;ren?","replies":[{"poster":"Nohgolgh","date":"2017-05-22T19:56:53.032+0000","up_votes":2,"down_votes":0,"body":"Riot ist ein Unternehmen. Dass es Truhen und Schlüssel umsonst gibt, ist ein klassisches Lockmittel. Wenn signifikant weniger Schlüssel droppen als Truhen, dann entsteht dadurch ein Ungleichgewicht und Leute kaufen sich Schlüssel, um die Truhen zu öffnen und höchstwahrscheinlich Skins zu bekommen, für die sie keine RP ausgeben mussten. Hypothetisch kannst du jeden Monat 12 Schlüsselfragemente und 4 Truhen bekommen, die Droprate für Schlüsselfragmente nimmt aber immer weiter ab, so dass du über lange Zeit eine Schlüsselknappheit hast. \n\nIch finde es immer putzig, wenn Leute glauben, dass Riot aus purer Nettigkeit die Truhen und Schlüssel weggibt. Das ist eine Geschäftsstrategie, die es so übrigens auch in anderen Spielen gibt.  Auf der anderen Seite bekommst du wirklich stuff for free. Mein Rat an dich ist demensprechend: Sei genügsam. Ursache deines Frustes ist deine Gier nach mehr. Und ja, ich habe inzwischen auch eine Menge Truhen. \n\nhttp://www.bilder-upload.eu/show.php?file=24d411-1495483020.png\n\nDie Umkehrung gibt es Übrigens auch. Gerade OTPs dürften in Schlüsseln schwimmen. ","replies":[{"poster":"Das Fluchtholz","date":"2017-05-23T10:20:04.199+0000","up_votes":1,"down_votes":0,"body":"Alles klar, dann weiß ich jetzt bescheid :) danke\nMfG","replies":[]}]},{"poster":"Angel Ayume","date":"2017-05-22T19:42:24.327+0000","up_votes":2,"down_votes":0,"body":"Die Wahrscheinlichkeit Schlüsselfragmente zu bekommen erhöht sich, wenn man mit Premades spielt. Dann solltest du vllt einfach nicht alleine spielen. \n\nAber mal so als Tipp, du solltest vllt auch mal was anderes mit deiner Freizeit anfangen als nur LoL zu spielen. Bei 20 Games jeden Tag bist du ja quasi nur am Zocken... Das klingt schon fast nach einer Sucht...","replies":[{"poster":"Das Fluchtholz","date":"2017-05-23T10:22:38.598+0000","up_votes":1,"down_votes":0,"body":"Ja und ich bin sehr sehr sehr sehr sehr süchtig. Wenn ich spiel dann nur exzessiv. Aber dann spiele ich eine lange Zeit Lang überhaupt nicht wenn ich mein Ziel erreicht habe.\nWar beim rachen auch so. Hab im Betrieb (Dacherdecker) nen Jahr geraucht und dann von heute auf morgen aufgehört.","replies":[]}]},{"poster":"sN00Bdogg","date":"2017-05-22T19:42:39.411+0000","up_votes":1,"down_votes":0,"body":"Ich mache die Truhe auch jede Woche. Hatte aber noch nie zu wenig Schlüssel.\n\nKenne auch einige, die zu viele Schlüssel haben, obwohl sie auch jede Woche die Truhe abholen.\n\nIch find den Algorhytmus in Ordnung.","replies":[{"poster":"Das Fluchtholz","date":"2017-05-23T10:23:27.320+0000","up_votes":1,"down_votes":0,"body":"Aber irwie unausgeglichen ;)","replies":[]}]},{"poster":"Phear","date":"2017-05-22T19:45:35.467+0000","up_votes":1,"down_votes":0,"body":"ein freund von mir silber rammus main,spielt zur 99.9% only rammus der hat ungelogen (war mal auf seinen acc um ihm die runen zur richten) über 40 fertige schlüssel xD","replies":[{"poster":"Das Fluchtholz","date":"2017-05-23T10:22:59.319+0000","up_votes":1,"down_votes":0,"body":"lol","replies":[]}]},{"poster":"Yasuo got Swag","date":"2017-05-22T19:42:26.134+0000","up_votes":1,"down_votes":0,"body":"Habe auch die letztens 2-3 Tage (5-10 Games pro Tag) keine Schlüsselfragmente bekommen.. Und habe ebenfalls 5 Truhen über","replies":[]}]}