{"poster":"tokmagocska","date":"2014-05-25T10:30:35.324+0000","title":"Meghatározatlan Hiba","subforum":"Hibabejelentés","up_votes":1,"down_votes":0,"body":"Sziasztok.\r\nTegnap éppen egy játék kellős közepében voltam mikoris teljesen befagyott a játék, ez nem is lett volna gond ha ki bírtam volna lépni belőle valahogyan. A kilépést csak a gépem kinyomásával bírtam elérni és mikor újraíndítottam és a játékot is indítottam volna el kiírta , hogy \"Meghatározatlan Hiba\" probáltam újraíndítani probáltam angol nyelven patchelni de 33%-nál vagy 100%-nál kiírja mindig a hibát és a javítás se segít mert a végén úgyanúgy hibát ír ki.\r\nHa valakinek volt hasonló problémája és sikerült megoldania kérem segítsen :)\r\nElőre köszönöm válaszaitokat!","replies":[{"poster":"Akos003","date":"2014-05-25T10:49:57.899+0000","up_votes":2,"down_votes":1,"body":"Nekem is ehhez hasonló problémám van a frissítésnél mindig újra kell indítanom a LoL patchert mert különben lefagy és nem csinál semmit ezzel \"Meghatározhatatlan hiba\" nekem azóta csinálja ezt mióta átváltottam magyar verzióra.","replies":[]},{"poster":"Istarian","date":"2014-05-25T17:39:38.227+0000","up_votes":1,"down_votes":0,"body":"Hali!\n\nHasonló hiba nálam is fellépett már, esetleg próbáld meg így, hátha sikerül :)\n(én így tudtam megoldani, ha előjött ez a probléma nálam vagy az öcsémnél):\n\n1:  Belépsz a Launcherbe /Patcherbe/ ott kiválasztasz egy másik régiót (mind1, hogy melyiket), majd nem várod meg, hogy letöltögesse a dolgokat, hanem ki \"X\"-eled a Launchert.\n\n2:  Ezután újra elindítod a Game Patchert, és kiválasztod azt a régiót amelyen játszani szeretnél, megint nem kell megvárni hogy letöltsön bármit is, hanem újból kilépsz.\n\n3:  Visszaléphetsz a Launcherbe, majd megvárod, hogy letöltsön mindent (elv. nem szabadna sok mindent leszednie), majd játszhatsz és akár a nyelvet is átállíthatod magyarra.\n\nRemélem tudtam segíteni, ha esetleg valamit nem értenél, nyugodtan írj!","replies":[]},{"poster":"tokmagocska","date":"2014-05-25T11:16:20.898+0000","up_votes":1,"down_votes":0,"body":"De nekem semilyen megoldás nem segített.Végigolvastam mindent minden nyelven probűltam patchalni. Hiba után idnítottam újra folyamatosan de emmi eredménye :/","replies":[]},{"poster":"tokmagocska","date":"2014-05-26T07:44:53.782+0000","up_votes":1,"down_votes":1,"body":"Szia.\n\n\nMár letöröltem a játékot és megprobálom úgy hogy az egészet újra patchelem.\nDe ha ez sem müködne és továbbá fennállna ez a hiba akkor megfogadom a tanácsodat :)\nKöszönöm","replies":[]}]}