{"poster":"KOBEx3","date":"2016-05-21T02:48:19.522+0000","title":"Intentional Feeder","subforum":"Miscellaneous","up_votes":3,"down_votes":0,"body":"There is a intent feeder in my game, he just keeps running in and dying, he has done it the last two games by the look of His OCE.op.gg   http://oce.op.gg/summoner/userName=xxstormxx, the other team is also supporting him and telling him to do it, it, im writing this report at the time of the game going on, he is currently 0/18 i have sent a report to riot too, with a video of it aswell! but if people could write a report it would be great","replies":[{"poster":"Stomper xD","date":"2016-11-10T08:31:22.587+0000","up_votes":1,"down_votes":0,"body":"What a Beast","replies":[]},{"poster":"Ingénue","date":"2016-05-21T03:17:48.116+0000","up_votes":1,"down_votes":0,"body":"Hi KOBEx3,\n\n**The Boards are not the right place to report things like this**\nAlso, can you please remove the link as [there is a strict no name and shame policy](http://boards.oce.leagueoflegends.com/en/c/announcements/BjArMH2B-boards-universal-rules). \n\n>In cases like this, be sure to send in a support ticket to Riot detailing exactly what happened, and any evidence you may have.\n\n>Please keep in mind that player support is busy and it may take a lil while for them to get back to you (almost always reply within a week). During this time do not lodge multiple tickets or continue adding information to your existing ticket, as it may send your enquiry to the back of the queue.\n\n>Also please keep in mind that Riot are unable to tell you if the player receives punishment due to privacy reasons.  \n\n> [In the future,  definitely utilise the end of game reporting feature. Consistent reports are the only way to ensure that a player gets punished.](https://support.riotgames.com/hc/en-us/articles/201752884-Reporting-a-Player)\n\nAs you have already done these steps, you have already done all in your power and now it's Riot's turn to deal with the situation.","replies":[]}]}