{"poster":"JimmyOld","date":"2017-01-11T12:20:25.866+0000","title":"Schermo nero, fps alle stelle","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Ciao a tutti, \r\nstamattina ho avviato lol,  ieri sera avevo giocato tranquillamente senza ombra di problema, e dopo la champ select entro nella schermata di caricamento con solo il puntatore del mouse e lo schermo nero. Utilizzo un portatile mac quindi decido di fare alt shift e vedere se si fosse buggato qualcosa. non ci faccio tanto caso e continuo fino a che, entrato in game, mi si sballa totalmente l&#039;fps, MAI avuto problemi. naturalmente faccio perdere punti al mio team e surrendiamo 20, spiacevolissimo oltre per l&#039;offese a mia madre, anche per il fatto che non stavo int ma semplicemente avevo un problema ( capita ). Quindi decido di andare nel sito della riot e fare tutti i controlli per l&#039;fps, fatti tutti, riprovo, stessa roba. addirittura abbasso la grafica che sembrava di giocare nel commodore. niente. A questo punto mi appello a qualcuno che ne capisca un minimo, il mio computer &egrave; relativamente nuovo , 1 anno, &egrave; in buone condizioni e non credo abbia un problema nella scheda grafica. Dico solo che mi sembra strano che ieri facesse e stamani dopo la patch sia andato tutto a puttane. \r\nscusate il papiro, grazie dell&#039;attenzione","replies":[{"poster":"BeardSergio","date":"2017-01-11T13:42:39.294+0000","up_votes":1,"down_votes":0,"body":"Come puoi vedere dal pallino blu in alto:\n\nWe're aware that some players are experiencing issues while running the game in full screen. This can be temporarily worked around by pressing \"Alt+Enter\" to switch out of fullscreen.\n\nStanno lavorando ad una soluzione. Vi chiedo di pazientare.\n\nGrazie","replies":[{"poster":"PhoenixRegen","date":"2017-01-11T14:41:15.612+0000","up_votes":1,"down_votes":0,"body":"peccato che non serve a niente... mi ha completamente disconnesso dalla partita, fortuna che non mi ha tolto LP","replies":[]},{"poster":"JimmyOld","date":"2017-01-11T14:06:37.619+0000","up_votes":1,"down_votes":0,"body":"Grazie comunque.","replies":[]}]},{"poster":"OmbraMattonifera","date":"2017-01-11T12:30:37.272+0000","up_votes":1,"down_votes":0,"body":"Non si tratta di problemi di pc o prestazioni, io ho un pc datato 2006, mai avuti problemi con lol anche se gioco a 30 fps fissi ma l'essere pro non è dato dal tuo computer {{sticker:slayer-jinx-wink}} , comunque anche a me da un problema simili, mi esce scritto Fuori campo 75,6 Hz / 100 Hz. Il tutto dopo aver fatto sto aggiornamento.","replies":[{"poster":"JimmyOld","date":"2017-01-11T14:06:11.048+0000","up_votes":1,"down_votes":0,"body":"Si stava meglio quando si stava peggio\ncit.","replies":[]}]},{"poster":"BeardSergio","date":"2017-01-11T12:43:49.439+0000","up_votes":1,"down_votes":0,"body":"Non ho modo di testare su mac al momento ma prova a fare così:\n\n- Fai il login con l'account\n- Cancella la cartella Config (C:\\Riot Games\\League of Legends)\n- Avvia una partita personalizzata ( questa partita applicherà le impostazioni predefinite )\n- Chiudi la partita ed il client\n- Riapri il client e riprova a far partire una partita personalizzata","replies":[]}]}