{"poster":"Asterix226","date":"2016-09-08T12:00:45.312+0000","title":"LoL über Externe Festplatte spielen?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo liebe community,\r\nIch bin in letzter zeit viel unterwegs und w&uuml;rde auf meinem Laptop gerne league spielen.\r\nJedoch will ich es nicht auf dem Laptop installieren sondern auf einer externen festplatte,\r\nKann Ich das spiel von der Festplatte aus starten?\r\n\r\nIch habe geh&ouml;rt das die Daten&uuml;bertragung zu schwach sein k&ouml;nnte?","replies":[{"poster":"DieSacknîere","date":"2016-09-08T12:12:00.012+0000","up_votes":1,"down_votes":0,"body":"Habe es noch nie ausprobiert aber sollte funktionieren. Einfach auf der externe Festplatte installieren lassen oder die vorhandenen Dateien verschieben.\n\nLG","replies":[{"poster":"Schuasdafeil","date":"2017-04-21T15:49:58.064+0000","up_votes":1,"down_votes":0,"body":"reicht der \"League of Legends\" Ordner der bei der Installation erstellt wurde oder musst du noch andere Dateien verschieben?","replies":[{"poster":"legofreak1","date":"2017-04-21T16:32:46.438+0000","up_votes":2,"down_votes":0,"body":"Wie bereits von Silibum [etwas weiter unten](https://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/7Uh84oas-lol-aber-externe-festplatte-spielen?comment=0000) beantwortet reicht es denn League of Legends Ordner zu kopieren, wenn auf dem Zielgerät DirectX und .Net 3.5 installiert sind. Wenn nicht, musst du dies nachholen, .Net 3.5 gehört aber mindestens ab Windows7 standardmäßig zu Windows dazu und DirectX wird von vielen anderen Spielen verwendet, die dies dann mitinstallieren.","replies":[{"poster":"Schuasdafeil","date":"2017-05-09T13:28:31.335+0000","up_votes":1,"down_votes":0,"body":"Super Danke! Hab es schon ausprobiert, funktioniert einwandfrei.","replies":[]}]}]}]},{"poster":"silibum","date":"2016-09-08T12:10:42.831+0000","up_votes":1,"down_votes":0,"body":"USB ist nicht das beste - es kommt aber auch hierbei auf die Version an: USB 3.0 hat deutlich bessere Übertragungsraten. Hier kommt es auf ein Versuch an. Das beste wären ein eSata Port an dem Laptop - einige haben so etwas.\n\nAnsonsten einfach bei einem Onlineversand eine USB 3.0 Fesplatte/Gehäuse zum testen bestellen. Du musst den Client nur dorthin kopieren, eine \"Installation\" auf die externe Festplatte im klassischem Sinne ist nicht nötigt. Vergiss aber nicht DirectX und .Net 3.5 ebenfalls zu installieren auf dem Laptop.\n\nMöglich wird das sicherlich sein, die Frage ist nicht ob Du es gestartet bekommst, sondern wie die Performance im Spiell am Ende ist. Der Client selber ist da relativ schmerzfrei.","replies":[{"poster":"Asterix226","date":"2016-09-08T12:23:39.981+0000","up_votes":1,"down_votes":0,"body":"Alles klar, vielen dank für die info :)!","replies":[]}]}]}