{"poster":"TipicoPlataIV","date":"2019-11-12T16:07:53.736+0000","title":"Me voy de este juego de porquería... (CryPost)","subforum":"Charlas Generales","up_votes":5,"down_votes":7,"body":"La dos unicas razones por que me voy es el mal servidor que tiene riot para latinoamerica, no la arregla (caidas de fps y ms, tambien los crasheos por parte del juego). El otro punto es que los emparejamientos no ayudan en nada, se supone que te emparejan con gente mala (segun riot quiere que los carrees) pero no se puede, esto deberia ser asi: Tienes una muy mala racha (viendo el punto de como estas jugando y como te comportas dentro de una partida) deberian emparejarte con gente de tu mismo nivel y asi subir por tu cuenta, pero no es asi ya que el que algunos que intentan jugar mejor (en ocasiones juegan mejor y carrilean) lo meten con personas que están por el tutorial. De bronce III llegue a promo a oro IV y cuando perdi esas partidas me bajaron el MMR (ahora juego con gente demasiado malo), aunque vayas un champ 1vs9 igual la pierdes por que tu team ni sabe posicionarse. Ahora lo que lean este post me daran puntos negativos (cierto, hay gente que puede carrilear pero yo no puedo porque me viven troleando). Intente subir con trynda y me funciono, perdi una sola partida lo que me bajo todo los humos (me empezaron a aparecer nuevamente duos que ni saben jugar, utilizan el chat todo el rato para flamear o bromear sin jugar concentrados).\r\n\r\nLa recompensa ademas para llegar a oro es re mala, muy fea la skin (parece la justiciera).","replies":[{"poster":"Esulc","date":"2019-11-12T17:20:53.057+0000","up_votes":4,"down_votes":0,"body":"No le crean, acabo de ver su historial y esta jugando una ranked ahora mismo.","replies":[{"poster":"WhiteMax","date":"2019-11-12T17:26:11.730+0000","up_votes":1,"down_votes":0,"body":"JAAJAJAJAJ. +1","replies":[]}]},{"poster":"SeanFelices","date":"2019-11-12T16:09:57.044+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=MrGansus,realm=LAS,application-id=v7qsfXsE,discussion-id=jmyPziIc,comment-id=,timestamp=2019-11-12T16:07:53.736+0000)\n>\n> La dos unicas razones por que me voy es el mal servidor que tiene riot para latinoamerica, no la arregla (caidas de fps y ms, tambien los crasheos por parte del juego). El otro punto es que los emparejamientos no ayudan en nada, se supone que te emparejan con gente mala (segun riot quiere que los carrees) pero no se puede, esto deberia ser asi: Tienes una muy mala racha (viendo el punto de como estas jugando y como te comportas dentro de una partida) deberian emparejarte con gente de tu mismo nivel y asi subir por tu cuenta, pero no es asi ya que el que algunos que intentan jugar mejor (en ocasiones juegan mejor y carrilean) lo meten con personas que están por el tutorial. De bronce III llegue a promo a oro IV y cuando perdi esas partidas me bajaron el MMR (ahora juego con gente demasiado malo), aunque vayas un champ 1vs9 igual la pierdes por que tu team ni sabe posicionarse. Ahora lo que lean este post me daran puntos negativos (cierto, hay gente que puede carrilear pero yo no puedo porque me viven troleando). Intente subir con trynda y me funciono, perdi una sola partida lo que me bajo todo los humos (me empezaron a aparecer nuevamente duos que ni saben jugar, utilizan el chat todo el rato para flamear o bromear sin jugar concentrados).\n> \n> La recompensa ademas para llegar a oro es re mala, muy fea la skin (parece la justiciera).\n\nBueno chau.\n\nSaludos .","replies":[]},{"poster":"ignacio137","date":"2019-11-12T16:54:20.969+0000","up_votes":2,"down_votes":0,"body":"de por si te emparejan con gente de tu mismo nivel, que después no quieras aceptarlo y simplemente creas que mereces estar mas alto porque no ganas por tus equipos no es algo real, basta con que juegues mejor que la media y vas a seguir subiendo...despues de todo teoricamente con un 51% de wr deberia bastar para llegar hasta donde sea, pero realmente si no subes no es por culpa de tu equipo, sino por culpa tuya y no necesariamente es carrear como tal pero puedes verlo de esa forma y es válido, pero tanto como tu equipo ha tirado 50 partidas porque no saben que hacer, me apuesto 15 skins a que tu también has tirado partidas por no saber ni lo que estas haciendo, despues de todo andas en la misma liga que la gente que te toca, yo mismo sin ser bueno en el juego ni nada subi de plata...3?4? no se ni que quede de las placements pero subi a oro 2 en menos de 2 semanas sin jguar mucho ni nada, y tengo claro que las partidas que perdi y que sigo perdiendo son por mi culpa, bueno si te retiras del juego, nos vemos xd, pero no es por culpa de tus equipos ni del emparejamiento ni nada que pierdes, ah y el sv a mi siempre me anda perfectisimo y los fps tambien, y no soy el unico al que siempre le funciona bien, sera una o des veces en unos 4, 5 meses que tengo algun problema por el server (y se nota porque todos andan igual en ese momento) asi que los fps es por tu pc y los ms por tu internet, saludos!","replies":[]},{"poster":"NegroMzaVII","date":"2019-11-12T16:08:41.190+0000","up_votes":2,"down_votes":1,"body":"Jaja, dale capo nos vemos!","replies":[]},{"poster":"rama144","date":"2019-11-12T17:50:13.851+0000","up_votes":1,"down_votes":0,"body":"\"deberian emparejarte con gente de tu mismo nivel\" \" meten con personas que están por el tutorial. De bronce III\"\n\nDicho por el amigo silver 3 450 partidas, flex hierro 2 70 partidas que juega solo garen trynda morde veigar nasus ww y que acaba de jugar una partida 5 minutos ante de mi comentario / claro dejar el juego ehhh\n\nDespues la gente se ofende cuando  me quejo de este tipo de gente ","replies":[]},{"poster":"JACKY FANBOY","date":"2019-11-12T16:36:44.916+0000","up_votes":1,"down_votes":0,"body":"Deja abierta la puerta que hace calor","replies":[]}]}