{"poster":"TipicoPlataIV","date":"2018-11-16T02:49:22.553+0000","title":"Quiero re-abrir un asunto de un videojuego que es ni bueno, ni malo...","subforum":"Memes & juegos","up_votes":2,"down_votes":1,"body":"Si ya saben hay muchos juegos que son as&iacute; de malos pero su trama es fabulosa, quiero hablar de este tema de nuevo... Nada m&aacute;s ni menos que &ldquo;Five nights ataque freddy&#039;s&rdquo;.\nEs un juego de un estilo muy simple, unos sustos (Jumpscares) sacado de peliculas chafas de terror o m&aacute;s bien que te dan un peque&ntilde;o salto pero despu&eacute;s se te pasa, fue un buen juego admitamoslo ya que nos engancho con su trama y las teor&iacute;as locas que nos puso Scott Cawthon pero que fue arruinado por su fandom.\n\n¿Ustedes creen que este Lore del juego pueda salvarse y convertirse en algo mejor?\n\n(Sé que ha pasado años pero igual quiero hablar de esto) \n\nYo creo que para este juego aún le queda una oportunidad... Mis ideas serían: \n-Empezar un reinicio de la historia con su saga de libro (a la verdad es interesante)\n-Cambiar su modo de dar miedo y convertirla para terror “infantil” a algo más terrorífico.\n-Como se viene probablemente una película pueden empezar con eso de hacerla de temer con esos animatrónicos y olvidarse del público JOVEN.\n-Scott puede cambiar del clickteamfusion por otro equipo mejor...\n-Eliminar fríamente a FNAF world... \n\n\nPD: Si, fui un fan de las sagas y seguidor de cada misterio e teorías que se ponían en discusión pero los niñajos jodieron todo con sus pinches fanfics además de la ternura que se le agrego. ","replies":[{"poster":"Clay Allison","date":"2018-11-16T03:32:44.780+0000","up_votes":2,"down_votes":0,"body":"{{sticker:slayer-jinx-catface}}  hula, sólo pasaba por aquí","replies":[]},{"poster":"defiejfie","date":"2018-11-16T07:12:19.646+0000","up_votes":1,"down_votes":0,"body":"La verdad como vos decis el juego se basa en su mecanica simple de Jumpscares pero a mi en lo personal me encanto mucho la historia del juego.Por mi lo dejaria como esta pero el fandom de FNFA es muy enfermo,peor que los brownies","replies":[]}]}