{"poster":"ArnoldSchwarzens","date":"2016-12-18T08:05:35.516+0000","title":"Garen's Villain Passive frustration and what I would change.","subforum":"Gameplay","up_votes":1,"down_votes":1,"body":"The thought behind it is that it encourages you to follow and kill the most dangerous member of the enemy team but it isn&#039;t like that at all. Because you&#039;re toplane, you likely won&#039;t get to attack the villain until very late into the game and sometimes there even is no villain at all in the first place. The lack of control is kind of frustrating.\r\n\r\nTake other game mechanics that deal with lack of control but are much more engaging, like for example {{champion:83}}  AI. While you can&#039;t control the way your ghouls and the maiden behave you KNOW how they will behave and can plan ahead and act accordingly. Or {{champion:203}}  passive monster marks where you can be certain that the first mark will be either a Scuttle camp or a Raptor camp, the second one will definitely either be a lesser camp etc.\r\n\r\nMeanwhile Garen not only doesn&#039;t have any control over it but also can&#039;t predict who will be the villain. If it randomly ends up being the tank, you&#039;re screwed or if somehow the support gets the most kills. Or if the villain randomly changes mid-fight because someone got a kill which is super frustrating. You can&#039;t plan ahead and you are just left with a vague hope that it&#039;ll be the enemy carry or whoever you wanted it to be.\r\n\r\nWhat if, instead of being the target that has earned the most kills in the last five minutes, you can choose one of your teammates as a protege and whoever kills that teammate becomes the villain? He/her will remain the villain until you kill him/her at which point you are able to choose another protege.\r\n\r\nThis way you have some way to plan ahead and have some influence over it instead of it being completely out of your control and it being super frustrating. In teamfights you will either become a bodyguard and protector for your carries or a revenge killer, someone who kills whoever you are trying to protect.\r\n\r\nI also think that this would fit the whole theme of it more on top of also fitting much more with Garen&#039;s character. He&#039;s a righteous man, a protector of the innocent and the weak. You don&#039;t become a villain because you are someone who randomly got to kill the most people in the last few minutes, you are a villain because you intend to hurt or already killed those who the righteous have sworn to protect.\r\n\r\nLet me know what you think.","replies":[{"poster":"Limmie","date":"2016-12-18T09:09:37.681+0000","up_votes":1,"down_votes":0,"body":"Yeah, Garen's villain mechanic would be more fit for a jungler than a toplane.","replies":[]}]}