{"poster":"Mr RosaPony","date":"2017-03-12T17:07:17.155+0000","title":"Suche Duo Que / Team Gold/Platin","subforum":"Clans & Teams","up_votes":1,"down_votes":3,"body":"Nabend alle miteinander,\r\n\r\nsuche zuverl&auml;ssigen Duo Que Partner  mit viel Freizeit an den Abenden und vorallem immer Sa+So ganztags.\r\n\r\nIch:\r\n- 25 jahre alt, Student\r\n- spiele seit S1 dies ist aber die erste Saison wo ich komplett spielen werde und ich mein ranked pushen m&ouml;chte (also tryhard jedes Game, never surrender)\r\n-  Main Jungle / Mid  Champpool ( ich jungel am liebsten Tanks Hecarim, Zac, Volibear, Amumu spiele aber auch Shyvana, Vi etc )(Mitte spiele ich Ahri, Annie, Kassadin, Malzahar)\r\n- Ich kann auf jeder Lane mindestens 2 Champs gut spielen also autofill ist kein Problem\r\n- kein flamen kritik an mich selbst oft, da ich besser werden m&ouml;chte\r\n- ich streame immer und bin immer Ts (eigener Server) wenn ich zocke\r\n- derzeit g4 Duo, g1 Flex\r\n- mein OPGG zum Schluss \r\nhttps://euw.op.gg/summoner/userName=Mr%20RosaPony\r\n\r\nDas solltest du alles mitbringen:\r\n- 18+ (auch Student w&auml;re super aber kein muss)\r\n- wenn du online bist = du bist im TS, es wird nie ohne gezockt\r\n- am anfang vom spiel wird jeder gemutet, es wird nicht gechattet man konzentriert sich auf sein Spiel\r\n- kein flamen oder tilten , wenn einer mit 10 hp weg kommt is des kein gl&uuml;ck dann hat man selbst einfach schlecht gespielt PUNKT\r\n- du brauchst keinen gro&szlig;en Championpool solltest aber auf jeder lane min. 2 gut spielen k&ouml;nnen\r\n- Du solltest zwischen gold 3 und plat 3 ca. sein\r\n- du solltest im Schnitt eine KDA von 4+ haben und eine KP von 60% +\r\n\r\nWenn dich das nun nicht abgeschreckt hat adde mich einfach ingame oder komme auf twitch.tv/mrrosapony vorbei.\r\n\r\n**Team:\r\n**\r\nIch suche ein tryhard Team f&uuml;r Flex-Que und low elo Tournaments, gerne ein Team welches schon l&auml;nger besteht und seinen Jungler verloren hat, es sollte feste Trainingszeiten geben an die sich jeder h&auml;lt und am besten eine Whatsapp gruppe f&uuml;r die koordination.\r\n\r\nPeacen Mr RosaPony","replies":[{"poster":"Mr RosaPony","date":"2017-03-19T15:28:22.876+0000","up_votes":1,"down_votes":0,"body":"push","replies":[]},{"poster":"Mr RosaPony","date":"2017-03-18T07:53:50.077+0000","up_votes":1,"down_votes":0,"body":"push","replies":[]},{"poster":"Mr RosaPony","date":"2017-03-14T17:31:08.223+0000","up_votes":1,"down_votes":0,"body":"push","replies":[]}]}