{"poster":"Ultralord13","date":"2015-11-07T14:22:37.773+0000","title":"PSC - PaySafeCard","subforum":"Hilfe & Support","embed":{"description":"Gyazo lets you instantly grab the screen and upload the image/GIF to the web. You can easily share them on Chat, Twitter, Blog, Tumblr, etc. Available for Windows, Mac and Linux.","url":"https://gyazo.com/c55729aed1f3e13cf5cd760f1798895a","image":"https://i.gyazo.com/thumb/1200/_62f00fcd738c9b27bedae7d9a6f5c22b.png"},"up_votes":1,"down_votes":0,"body":"Moin, wollte mir f&uuml;r 35&euro; PSC Guthaben RP holen, allerdings wenn ich zwei kombinieren m&ouml;chte (25&euro;+10&euro;) zeigt er mir nur noch an &quot;\r\nBezahlung mit paysafecard\r\nZahlungen &uuml;ber 100 EUR f&uuml;r nicht identifizierte Kunden mit in Deutschland gekauften PINs sind nicht m&ouml;glich. F&uuml;hren Sie bitte eine Authentifizierung durch, um mit Ihrem my paysafecard Konto bezahlen zu k&ouml;nnen.(siehe Link)&quot; Kann mir da jemand bitte helfen? Dankesch&ouml;n :)","replies":[{"poster":"Tiaryn","date":"2015-11-07T14:51:44.074+0000","up_votes":2,"down_votes":0,"body":"Das Kombinieren der Karten ist seit einiger Zeit nicht mehr problemlos möglich.\nIch glaube die Grenze war 30€ und nicht die 100€ die dir angezeigt werden.\nEin Workaround wäre mypaysafecard. Du kannst dir einen Account erstellen und dort deine PINs einlösen und dann sozusagen mit deinem Account bezahlen.\nIch vermute allerdings, dass auch der Support dir da manuell weiterhelfen kann. https://support.riotgames.com/hc/de/articles/201753064-Paysafe-Cards#h4\nDu kannst natürlich noch keine Transaktions-ID angeben, aber die anderen Infos und keine kurze Beschreibung deines Problems ist ja möglich.","replies":[{"poster":"Ultralord13","date":"2015-11-07T14:53:53.123+0000","up_votes":1,"down_votes":0,"body":"Alles klar dankeschön! Vor rund 3-4 Monaten ging es noch mit den 35€ zumindest hat es damals noch geklappt 25€ und 10€ zu kombinieren.","replies":[]}]},{"poster":"Playdaynight","date":"2015-11-07T20:51:58.115+0000","up_votes":1,"down_votes":0,"body":"genau das selbe bekomme ich angezeigt wenn ich mir in einem keystore was bestellen möchte habe das problem seit heute und immer nur wenn ich 2 paysafecards kombinieren möchte allerdings muss ich hier tiaryn wiedersprechen ich habe heute eine 19 cent paysafecard mit einer 1 euro paysafecard kombiniert dann erhielt ich die fehlermeldung","replies":[]}]}