{"poster":"DNA Polymerase I","date":"2016-02-04T14:31:44.805+0000","title":"Allow a Leaver to take a Leaver's blame","subforum":"Gameplay","up_votes":168,"down_votes":16,"body":"Sometimes I just had to leave a game or go AFK because my baby girl is crying or i gets a call from work, i can&#039;t stop it from happening and i sure as hell can&#039;t ignore them. I feel bad when i had to leave knowing I most likely cost 4 other people some hard earn LP. So please add in a feature to allow a leaver to take the blame for losing the game, take more LP of me and have no affect on other teammate. It would make me feel better when I just have to go for important reason.","replies":[{"poster":"LF Annie","date":"2016-02-04T14:43:12.939+0000","up_votes":38,"down_votes":18,"body":"no.\nno.\nno.\nno.\nno.\n\ntrolls will abuse people for this.","replies":[{"poster":"npbeisbol","date":"2016-02-04T16:17:32.032+0000","up_votes":40,"down_votes":3,"body":"How could it be abused? From what he said, it would be an _option_ to accept responsibility. If your team was trolling you wouldnt accept the additional loss and take the normal punishment or whatever. Sure, a lot of people wouldnt use it at all, but there are some out there, like OP, who respect others enough to use an option like this. I like it.","replies":[{"poster":"JavelinJoe","date":"2016-02-04T19:39:32.273+0000","up_votes":19,"down_votes":3,"body":"B5 player takes blame for all loses since he cant demote.","replies":[{"poster":"Kowagatte","date":"2016-02-06T02:29:41.653+0000","up_votes":1,"down_votes":0,"body":"It's not like with this system when someone admits leavers blame the game auto ends. The game would still continue but at the end of the game more lp would be taken from the leaving player? I don't at all see how this can be abused.","replies":[]},{"poster":"Tuss","date":"2016-02-06T01:39:28.042+0000","up_votes":1,"down_votes":0,"body":"If you're trolling to lose anyway, you'd take the normal punishment instead of trying to lessen the burden on others by taking the hit yourself.","replies":[]},{"poster":"DeynaTaggerung","date":"2016-02-05T19:37:05.308+0000","up_votes":1,"down_votes":0,"body":"Yeah...but he can only play with people in B5 and B4 so he can't do this for anyone all that often.","replies":[]}]},{"poster":"Silents429","date":"2016-02-05T18:59:49.288+0000","up_votes":2,"down_votes":1,"body":"\"Hey guys were going to lose this game anyway, let me take one for the team!\"","replies":[]},{"poster":"LegacyDAP","date":"2016-02-06T03:46:46.844+0000","up_votes":1,"down_votes":0,"body":"I think he was joking lol.","replies":[]}]},{"poster":"NegusInParis","date":"2016-02-05T08:43:12.643+0000","up_votes":1,"down_votes":0,"body":"How would they abuse it?","replies":[{"poster":"LF Annie","date":"2016-02-05T13:28:49.204+0000","up_votes":1,"down_votes":0,"body":"5 man premade playing dynamic, has 1 person leave when losing to not lose as much mmr to climb faster, cheating the system.","replies":[{"poster":"NegusInParis","date":"2016-02-17T20:19:02.563+0000","up_votes":1,"down_votes":0,"body":"Leaving a game while in a premade could disable you from playing together with other people for x minutes/hours","replies":[]},{"poster":"NegusInParis","date":"2016-02-17T20:18:40.636+0000","up_votes":1,"down_votes":0,"body":"Leaving a game while in a premade could disable you from playing together with other people for x minutes/hours","replies":[]}]}]},{"poster":"UNCLES LUMBAGO","date":"2016-02-06T19:52:28.720+0000","up_votes":1,"down_votes":0,"body":"You think trolls don't have multiple accounts?","replies":[]},{"poster":"AninLegions777","date":"2016-02-05T13:11:12.863+0000","up_votes":1,"down_votes":0,"body":"I'm trying to understand how it will be abused. Educate me.","replies":[{"poster":"LF Annie","date":"2016-02-05T13:28:03.980+0000","up_votes":1,"down_votes":2,"body":"5 man premade playing dynamic, has 1 person leave when losing to not lose as much mmr to climb faster, cheating the system.","replies":[{"poster":"KillerKell","date":"2016-02-05T21:15:22.408+0000","up_votes":1,"down_votes":0,"body":"Still doesn't work, even if they rotate.  Eventually some one gets a 30 Minute Ban, and it beefs up to an Hour Ban... so eventually they get to a point where each 'save' costs them 1 Hour just to get one player back... go to next game, goes badly, another 1 hour wait to play.\n\nWho is going to want to do that?","replies":[]}]}]},{"poster":"DeynaTaggerung","date":"2016-02-05T19:39:16.879+0000","up_votes":1,"down_votes":0,"body":"Do you really think someone is willing to accept responsibility for a loss and take a huge hit to their LP? If you make the punishment for the leaver large enough then it will discourage any abuse.","replies":[]}]},{"poster":"Narasimha","date":"2016-02-04T19:01:37.082+0000","up_votes":28,"down_votes":3,"body":"\"Shit guys, we're losing. Steve, you haven't left in a while right? I think its your turn to quit.\"\n\"Alright guys, catch you next game.\"\n\n*A Summoner has disconnected*","replies":[{"poster":"Phuc Dat Bich","date":"2016-02-04T19:24:11.553+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Narasimha,realm=NA,application-id=3ErqAdtq,discussion-id=z6fniKbs,comment-id=0004,timestamp=2016-02-04T19:01:37.082+0000)\n>\n> \"Shit guys, we're losing. Steve, you haven't left in a while right? I think its your turn to quit.\"\n> \"Alright guys, catch you next game.\"\n> \n> *A Summoner has disconnected*\n\nand steve gets banned for leaving a game\n\nThat how easy you fix that","replies":[{"poster":"Mimaropa","date":"2016-02-04T21:40:49.512+0000","up_votes":8,"down_votes":3,"body":"He only get banned if he does it multiple times. If a 5 man team do rotations of disconnecting when they are in grave danger of losing, no one in their team would be banned for constant disconnection unless they lose 50 games consecutively.\n\nRiot cant discern anyone who does this because they have no time to check millions of games and some of the games lack proof.\n\nThis will be taken advantage easily.","replies":[{"poster":"NegusInParis","date":"2016-02-05T08:44:27.007+0000","up_votes":5,"down_votes":2,"body":"Easy fix. Premades would still lose LP","replies":[{"poster":"Narasimha","date":"2016-02-05T17:09:06.617+0000","up_votes":3,"down_votes":0,"body":"So if someone in a premade has a genuine emergency, the rest of the team should be penalized for that?","replies":[{"poster":"Tuss","date":"2016-02-06T01:42:40.151+0000","up_votes":2,"down_votes":0,"body":"If you're in a premade, hopefully your partner(s) respect you enough to understand such things happen. And if they don't, then you probably don't want them on your team.","replies":[]},{"poster":"SSJTribe","date":"2016-02-05T20:27:19.507+0000","up_votes":2,"down_votes":0,"body":"They already are, so it wouldn't change anything there","replies":[]},{"poster":"Xicashina","date":"2016-02-05T19:58:55.622+0000","up_votes":1,"down_votes":0,"body":"Implementing the system is a good first step making it not work for premades is a way to stop it from being abused after we test that it works we can work on making it work for premades","replies":[]}]}]}]}]}]},{"poster":"Rendarkan","date":"2016-02-04T21:25:32.935+0000","up_votes":19,"down_votes":2,"body":"My kid sits next to me and watches me play. She thinks its all cartoons to her.\n\"Dad what happen?\"\n\"Well you see that guy that throws things? He is what they call a scrub for using that person.\"\n\"So like the lady with the crossbow that makes your health go byebye?\"\n\"Exactly.\"","replies":[{"poster":"It Hertz When IP","date":"2016-02-05T10:36:27.996+0000","up_votes":4,"down_votes":0,"body":"Relevance?","replies":[{"poster":"The Loveless","date":"2016-02-05T16:33:49.657+0000","up_votes":6,"down_votes":0,"body":"Let him make his funny.","replies":[]}]},{"poster":"KillerKell","date":"2016-02-05T16:39:35.515+0000","up_votes":2,"down_votes":0,"body":"That's adorable.\n\nBoth that Vayne wrecks you and that your amazing daughter thinks it's all cartoons.\n\nSeriously though, cool thing letting her sit in and watch and get to enjoy it.  Bonding is great, so I applaud you for that.  Many others would tell her to go play with dolls and stay quit, just so they can play (or let their children starve to death like was happening with some really sick WoW player, not that WoW was the problem, it was the horrid excuses of parents that was the problem).\n\nSo jokes aside, thumbs up to you!","replies":[{"poster":"Rendarkan","date":"2016-02-06T01:55:49.962+0000","up_votes":1,"down_votes":0,"body":"She doesn't play with dolls I tried that once. I came home to my mother who was babysitting her questioning her sanity because she ripped apart Barbie and used scissors to cut her hair off.\n\nSo naturally dolls were a no go. I blame her mother.","replies":[]}]}]},{"poster":"Urgonnalearn2day","date":"2016-02-04T15:44:32.051+0000","up_votes":16,"down_votes":4,"body":"We already have people telling others to kill themselves.  The community is not mature enough for this.","replies":[]},{"poster":"Impiety","date":"2016-02-04T17:03:49.668+0000","up_votes":4,"down_votes":5,"body":"In all seriousness,  you shouldn't be playing Ranked if you know you have a high chance of being called away from the game. It simply isn't fair to your teammates even if there was a system in place that allowed for a leaver to take more of a loss. Loss of a game and loss of LP to your teammates has an impact on their MMR as well.\n\nI would suggest you stick with the other game modes and only play Ranked when you know you can set aside a block of time to play the game competitively and uninterrupted.","replies":[{"poster":"FrickendaChicken","date":"2016-02-05T04:14:00.544+0000","up_votes":8,"down_votes":0,"body":"But he doesn't have a high chance of something happening. Sometimes his daughter just wakes up unexpectedly when he should have 30mins-1 hour of time. Sometimes his work just calls him in saying he needs to come in for an hour. He can't say no, and he had no idea his work was going to call him.\nEmergencies aren't planned, they're emergencies for a reason. He's proposing a way to assist in the fact that when these emergencies happen the player who has to leave can be dragging down their team mates. So he wants that guilt taken away from him, hence the system the OP prooposed.","replies":[]},{"poster":"KillerKell","date":"2016-02-05T16:40:35.098+0000","up_votes":2,"down_votes":0,"body":"So if you are Employed, or ever have a Child... quit League.\n\nGot it.","replies":[{"poster":"Ulquiorra995","date":"2016-02-06T11:43:25.798+0000","up_votes":1,"down_votes":0,"body":"Or don't have a personal generator in case your power goes out.","replies":[]}]}]},{"poster":"The Loveless","date":"2016-02-05T16:29:48.527+0000","up_votes":6,"down_votes":1,"body":"Oh you think you can get off easy? HELLLL NO, you take your full loss and nothing special. Stop trying to make excuses for why you screw over your team. Go fu- wait what?\n\nOh you want to take full blame and not cost others more LP loss. Okay that works. :D","replies":[]},{"poster":"PDE5 Inhib","date":"2016-02-05T16:43:15.271+0000","up_votes":3,"down_votes":0,"body":"no\nno\nno\nno\n\n_force_ a leaver to take a leaver's blame.","replies":[]},{"poster":"KrugLyfe","date":"2016-02-04T14:34:18.650+0000","up_votes":6,"down_votes":4,"body":"I would suggest you just play norms if something might come up and then when you're positive you have time to play do ranked.","replies":[{"poster":"Tsukiyo358","date":"2016-02-05T10:34:43.221+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=KrugLyfe,realm=NA,application-id=3ErqAdtq,discussion-id=z6fniKbs,comment-id=0000,timestamp=2016-02-04T14:34:18.650+0000)\n>\n> I would suggest you just play norms if something might come up and then when you're positive you have time to play do ranked.\n\nBut things can happen out of the blue, you know :/","replies":[]}]},{"poster":"Lao Fu the Tiger","date":"2016-02-05T02:51:28.116+0000","up_votes":3,"down_votes":0,"body":"If it didn't totally take away LP loss for teammates, but alleviated it somewhat, I'd definitely be on board.","replies":[]},{"poster":"1Maza","date":"2016-02-05T11:57:46.658+0000","up_votes":2,"down_votes":7,"body":"As many others have said, there's already a system in place for this. It's called: Don't fucking queue up for Ranked if you can't guarantee you'll be there for the whole damn game.","replies":[{"poster":"Solari Fortune","date":"2016-02-05T14:25:11.614+0000","up_votes":5,"down_votes":0,"body":"There are times when you queue up with plenty of time. But then something happens that you can't just say\" let me finish this game first\"\nYou can't predict getting a surprise phone call from work telling you to come in when it is your day off.","replies":[]},{"poster":"AninLegions777","date":"2016-02-05T13:15:58.273+0000","up_votes":5,"down_votes":0,"body":"Err, so if someone you love is involved in an accident, you'd keep playing? Okay mate. {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"DeathBurst","date":"2016-02-05T16:38:07.821+0000","up_votes":1,"down_votes":0,"body":"This is a neat idea on paper, but I fear that in practice it would be abused and would degrade the attitude of the community. Call me cynic, but I won't support this suggestion.","replies":[{"poster":"DeathBurst","date":"2016-02-05T16:41:01.142+0000","up_votes":2,"down_votes":0,"body":"On the other hand, I was thinking about your examples and, well, I **would** report you if you did that in one of my game, but I don't feel like someone like you should be banned from this community, we need more people like you...\n\nNow I'm torn between the 2 sides...","replies":[]}]},{"poster":"SevenStrokeRoll","date":"2016-02-05T15:26:38.256+0000","up_votes":2,"down_votes":0,"body":"Of course, everyone cares more about trolls than actual players.","replies":[]},{"poster":"Carpe Victoria","date":"2016-02-05T11:57:22.238+0000","up_votes":2,"down_votes":0,"body":"With restrictions on how often you can do it sure, might be ok. Its a righteous idea just abusable without limits.","replies":[]},{"poster":"Ninjasync","date":"2016-02-05T03:57:36.723+0000","up_votes":2,"down_votes":0,"body":"I second this notion.","replies":[]},{"poster":"Troll for Trump","date":"2016-02-05T03:30:25.644+0000","up_votes":3,"down_votes":1,"body":"The community has abused bugs in the game before, abused an automated report system, abused the tribunal before that, still abuse each other consistently, rage and try to witchhunt CertainlyT, etc.","replies":[]},{"poster":"Alsek","date":"2016-02-17T20:29:03.135+0000","up_votes":1,"down_votes":0,"body":"You probably shouldn't be playing ranked when you have vastly more important responsibilities that would likely compell you to leave games...\n\n\nRiot will never create a feature like this because:\n1. It would actually encourage people to leave games they might otherwise stay for.\n2. It would likely cause people to try and pressure someone they feel is to blame for their loss into using this feature.","replies":[]}]}