{"poster":"Wrekzzz","date":"2017-08-30T19:20:17.247+0000","title":"Runes Corner: Late-Game Focused Runes","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"Hey Everyone!\n\nI&rsquo;m Wrekz from the Runes Reforged project and I&rsquo;m back with some more Runes Corner previews! Last time we posted there was a lot of interest in seeing some of the runes that are more late-game focused and let you trade early power for a higher late-game payoff. Given how much League can snowball and accelerate in power, forgoing benefits you can claim immediately for lane phase is a big sacrifice. In exchange, however, you can take some late-game effects of considerable power. Today we have a couple examples of that pattern to show off. Give them a look and let us know what you think.\n\nFirst, Gathering Storm. This rune is in the Sorcery path, and for those keeping track it&rsquo;s in the last slot.\n\n**Gathering Storm**\n\nhttp://i.imgur.com/r7Sjcwns.jpg\n\nEvery 10 minutes gain +8 Ability Power or +6 Attack Damage, adaptive, per 10 minutes of game time that have elapsed.\n\nWorking through a quick example, that means:\n10:00    8 AP       6 AD\n20:00    24 AP    18 AD\n30:00    48 AP    36 AD\n40:00    80 AP    60 AD\n\nGathering Storm heavily concentrates its power into the late-game. Taking it is substantial risk, but with a big reward coming as the game goes on. Beyond normal linear scaling it actually accelerates its power growth as time passes. However, this rune doesn&rsquo;t just grant its power gradually, you only get its bonus at each 10 minute interval. This makes some extremely powerful late-game spikes (30, 40, 50 minutes) particularly meaningful. The stats from Gathering Storm after 30 minutes can absolutely look scary, and we&rsquo;re going to be keeping a close eye on its tuning. In general, scaling runes need to be balanced carefully and be fairly rare within the system. Their ability to be cool and powerful is proportionate to the risk you undertake in bypassing other options granting immediate and more reliable power.\n\nNext up is another rune in the Sorcery path (gasp!), this time in the first non-keystone slot. This rune has a very temporary name.\n\n**Ultimore**\n\nhttp://i.imgur.com/WXS9q3u.png\n\nGain 5% cooldown reduction and maximum cooldown reduction on your ultimate. This increases by 1.5% each time you cast your ultimate. Stacks up to 10 times.\n\nEver played a champion and wished you could just get some more time off their ult cooldown? Vi, Karthus, Amumu certainly come to mind. Ultimore lets you get just that. Instead of broad power or cooldown reduction across the entire kit, this is focused purely on your champion&rsquo;s ultimate. We&rsquo;ve seen uses on both ends of the cooldown spectrum. Some players take this to get access to their long cooldown ultimates more often, while others use it to try and reach a point where they can use their ultimate twice in a fight. Overall, we hope it creates some creative uses and different feeling builds for you try out.\n\nAs an aside, we actually tried this mechanic as  a keystone in its early iterations. Balancing delayed power in the keystone slot proved pretty hard, however. Giving enough power to make it worth the wait proved too pattern warping. When Lux starts ulting 3+ times per teamfight things get a bit scary. Moving this rune out of the keystone slot let us provide the ultimate-only cooldown effect at a more reasonable power level that everyone can still get excited about.\n\nWhat do you think of the Runes we showed off today? What other things would you like to see next? Let us know in your comments below. As always we&rsquo;ll be hanging out in the comments section below for a while answering questions. Thanks for reading!","replies":[{"poster":"SpearKitty","date":"2017-08-30T20:05:25.618+0000","up_votes":6,"down_votes":0,"body":"How would Ultimore interact with champions like Nidalee, Jayce, Elise, and other champions who have form change/augmentation Ultimates that are on relatively low cooldowns and available from level 1?","replies":[{"poster":"Weedlayer","date":"2017-08-30T20:09:22.990+0000","up_votes":56,"down_votes":0,"body":"> [{quoted}](name=SpearKitty,realm=NA,application-id=A7LBtoKc,discussion-id=3THTrhmb,comment-id=0018,timestamp=2017-08-30T20:05:25.618+0000)\n>\n> How would Ultimore interact with champions like Nidalee, Jayce, Elise, and other champions who have form change/augmentation Ultimates that are on relatively low cooldowns and available from level 1?\n\nYou probably wouldn't take it on them.","replies":[{"poster":"SpearKitty","date":"2017-08-30T20:21:03.892+0000","up_votes":5,"down_votes":2,"body":"Depending on how it works with them you absolutely would. If you could have 20% CDR at level 1-2, that seems pretty insane. Even if it doesn't increase the 5% CDR on basic abilities on each ultimate cast like I think it does, being able to switch forms basically whenever would be useful to the form change champions that don't have R cooldown resets.","replies":[{"poster":"Meddler","date":"2017-08-30T20:43:22.188+0000","up_votes":17,"down_votes":0,"body":"The CDR Ultimore offers is only applied to your ult, so you'd get a lower Transform CD but no benefit to your other abilities.\n\nWe're also looking at whether or not we'll need any additional rules for really short CD ults that can max this Rune out really fast or not (e.g. Kass R).","replies":[{"poster":"DeathBurst","date":"2017-08-30T21:25:46.058+0000","up_votes":2,"down_votes":0,"body":"What about Udyr? It's not even a matter of short CD on ult, it's just that his R spell is not an ult at all.","replies":[{"poster":"Wrekzzz","date":"2017-08-30T21:40:52.373+0000","up_votes":11,"down_votes":0,"body":"Udyr a special case insofar as he doesn't have an ultimate. I'd be interested in not making this a completely dead rune for him, but don't have specifics right now.","replies":[{"poster":"Louis Cyphre","date":"2017-08-30T23:21:07.789+0000","up_votes":33,"down_votes":0,"body":"I don't think a dead rune is a sin, especially considering that we have Cassiopeia facing dead runes already.","replies":[{"poster":"morris1","date":"2017-08-31T04:29:37.441+0000","up_votes":5,"down_votes":0,"body":"Mana runes / masteries have been around since the beginning, no need to worry.","replies":[]}]}]}]},{"poster":"Μax","date":"2017-08-30T21:04:58.290+0000","up_votes":4,"down_votes":0,"body":"You could give the stacking portion an inherent cooldown (idk something like 30s) so champions with short ultimate cooldowns wouldn't get to stack it insanely quickly, while still giving it a purpose for those characters.","replies":[{"poster":"Wrekzzz","date":"2017-08-30T21:06:45.674+0000","up_votes":6,"down_votes":0,"body":"We will be keeping an eye on how champions with really low ult cooldowns make use of it. There are a number of tweaks we can make here if necessary to balance it across everyone.","replies":[]}]}]}]}]}]},{"poster":"EROTIC RAID BOSS","date":"2017-08-30T20:39:15.423+0000","up_votes":37,"down_votes":1,"body":"Hey are you shopping around for name ideas for ultimore? \n\nI'm a big fan of the names that are nods to lore like greenfathers gift or grasp of the ruined king.\n\nHow about \"ne'zuks rising force\" or something along those lines. It's a reference to ezreal's passive that lets you reduce his cds by using spells. Ne'zuk was the original user of ezreal's gauntlet.\n\nAlso throwing this out there but you could name the new stormraiders surge after illaois god. She loves that talent/rune and it fits pretty well. Kraken's surge or nakagabouros surge","replies":[{"poster":"Wrekzzz","date":"2017-08-30T21:07:46.304+0000","up_votes":23,"down_votes":0,"body":"Thanks for the ideas!","replies":[{"poster":"DeathBurst","date":"2017-08-30T21:34:19.943+0000","up_votes":16,"down_votes":0,"body":"I'd like to add that I also love nods to the lore in small elements like that.","replies":[]}]},{"poster":"ProfDrDeath","date":"2017-08-30T21:19:25.222+0000","up_votes":5,"down_votes":0,"body":"Test of the Bearded Lady? Or Trial of the Bearded Lady?","replies":[]}]},{"poster":"Golden Tager X","date":"2017-08-30T21:04:12.965+0000","up_votes":28,"down_votes":0,"body":"{{champion:17}} +ultimore\n\n\nFuck","replies":[{"poster":"La Bello","date":"2017-08-30T22:19:48.832+0000","up_votes":18,"down_votes":0,"body":"Ive done a bit of math and it should put Shrooms on a 7 sec CD.\n\nUltimore + Intelligence rune also gives {{champion:55}} a full Ult reset after one kill.\n\nand {{champion:99}} ult on a 8 second CD if she manages to kill a champion with it.\n\n{{champion:7}} {{champion:157}}  ult goes on a 10 second CD\n\n{{champion:131}} ult goes on a 5 sec CD","replies":[{"poster":"Senfina","date":"2017-08-30T22:58:56.872+0000","up_votes":1,"down_votes":0,"body":"Are you doing math based on it being additive or multiplicative? Even at it's best case (additive) Diana ult only goes onto a 6 second cooldown at 60% CDR.","replies":[{"poster":"La Bello","date":"2017-08-30T23:01:34.069+0000","up_votes":10,"down_votes":0,"body":"pretty sure Intelligence rune makes it 65%","replies":[]}]}]}]},{"poster":"warpenguin555","date":"2017-08-30T19:24:42.395+0000","up_votes":11,"down_votes":0,"body":"Why would I ever want gathering storm when games rarely last 30 minutes? Ultimore looks good though ","replies":[{"poster":"Wrekzzz","date":"2017-08-30T19:31:36.870+0000","up_votes":25,"down_votes":2,"body":"On average game's don't last long enough for it to go insane, but if you got a massive bonus from it every game there would be no tension around picking the rune. There are a number of situations where you can predict a game will go long. Sometimes your team is running late-game champs, sometimes their team has a Ziggs/Anivia/other high waveclear champ and you can tell it will be hard to push for a win. Some people are interested in using the Rune as something of an insurance policy. If it doesn't appeal to you that's fine though, not everyone needs to like every rune.","replies":[]}]},{"poster":"Flemman","date":"2017-08-30T19:28:23.262+0000","up_votes":21,"down_votes":2,"body":"can already expect ultimore to be problematic on champ like Ekko who can already sapm it a lot, reduce the window when you can actually trade with them","replies":[]},{"poster":"EvanThomas","date":"2017-08-31T01:06:36.028+0000","up_votes":17,"down_votes":0,"body":"*can't Kilean the Zilean intensifies*","replies":[]},{"poster":"TheVibronicWand","date":"2017-08-30T20:52:43.447+0000","up_votes":6,"down_votes":0,"body":"How does Shyvanna interact with the ultmore rune? since it by default her's doesn't have a cd only a rage requirement. faster passive rage gen?","replies":[{"poster":"Wrekzzz","date":"2017-08-30T21:02:46.397+0000","up_votes":7,"down_votes":0,"body":"We will look into this. I don't have a clear answer for you right now but we'll keep it in mind.","replies":[{"poster":"Coldhawaii","date":"2017-08-30T21:32:59.250+0000","up_votes":1,"down_votes":5,"body":"And now you're at it, Gnar :)","replies":[{"poster":"Wrekzzz","date":"2017-08-30T21:41:44.067+0000","up_votes":18,"down_votes":0,"body":"Gnar's ultimate has a CD and it should be affected normally.","replies":[]}]}]}]},{"poster":"La Bello","date":"2017-08-30T20:22:07.799+0000","up_votes":5,"down_votes":0,"body":"how about some more teasers of the lesser runes ?\nIm actually interested in more of the lesser rune options so I can begin writing up and theorycrafting / metaforging some set ups.\n","replies":[{"poster":"Meddler","date":"2017-08-30T20:48:39.371+0000","up_votes":12,"down_votes":0,"body":"In case it's unclear these are both regular runes, not keystones.","replies":[{"poster":"La Bello","date":"2017-08-30T21:14:03.040+0000","up_votes":15,"down_votes":0,"body":"wait\n\nseriously....\n\nso I can have both Gathering Storm and Berserk on Jinx?\n\nhttps://i.ytimg.com/vi/6THx8HXYugs/hqdefault.jpg","replies":[{"poster":"Wrekzzz","date":"2017-08-30T21:42:41.218+0000","up_votes":8,"down_votes":0,"body":"Yes, you can have Berserk and Gathering storm if you go Precision/Sorcery.","replies":[]}]}]}]},{"poster":"Tormentula","date":"2017-08-30T19:37:57.164+0000","up_votes":12,"down_votes":0,"body":"Makes me wonder how ultimore looks like with {{champion:60}} {{champion:76}} {{champion:126}} {{champion:77}} {{champion:43}} {{champion:50}} \n\nConsidering they spam what is probably coded as ultimates and could potential have 0 CD?\n\nWere these taken into consideration? Or do you believe that such a gimmick wouldn't benefit them. {{champion:43}} could be a huge problem real fast tbh. \n\nAlso how do multicast ultimates work? \n{{champion:103}} {{champion:119}} {{champion:56}} {{champion:516}} {{champion:92}} {{champion:7}} {{champion:101}} {{champion:121}} {{champion:202}} {{champion:131}} {{champion:39}} ","replies":[{"poster":"Meddler","date":"2017-08-30T20:45:54.195+0000","up_votes":6,"down_votes":0,"body":"Multi cast - first button press is what's counted in terms of building up Ultimore stacks (e.g. Irelia). Resets by contrast would count multiple times (e.g. Diana)","replies":[]}]},{"poster":"Aenaeus","date":"2017-08-30T19:24:31.579+0000","up_votes":10,"down_votes":0,"body":"I'm going to intentionally make the game go on for 2 hours so I get mad bonuses.","replies":[]},{"poster":"ExHentai","date":"2017-08-30T19:43:30.392+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=RiotWrekz,realm=NA,application-id=A7LBtoKc,discussion-id=3THTrhmb,comment-id=,timestamp=2017-08-30T19:20:17.247+0000)\n>\n> Gain 5% cooldown reduction and maximum cooldown reduction on your ultimate. This increases by 1.5% each time you cast your ultimate. Stacks up to 10 times.\n\nIs this saying that with 40% CDR your ult can have up to 60% CDR?","replies":[{"poster":"Weedlayer","date":"2017-08-30T19:44:47.578+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=ExHentai,realm=NA,application-id=A7LBtoKc,discussion-id=3THTrhmb,comment-id=0011,timestamp=2017-08-30T19:43:30.392+0000)\n>\n> Is this saying that with 40% CDR your ult can have up to 60% CDR?\n\nUp to 65% with the Intelligence rune in Inspiration.","replies":[{"poster":"im gay 3000","date":"2017-08-30T20:53:17.075+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Weedlayer,realm=NA,application-id=A7LBtoKc,discussion-id=3THTrhmb,comment-id=00110000,timestamp=2017-08-30T19:44:47.578+0000)\n>\n> Up to 65% with the Intelligence rune in Inspiration.\n\ntfw you have The Equalizer up for every single minion wave. Waveclear rumble is a go.","replies":[]}]}]},{"poster":"NagatoFan1","date":"2017-08-31T05:37:49.849+0000","up_votes":7,"down_votes":0,"body":"Thrilled for y'all to break {{champion:43}} with Ultimore. I'm going to enjoy the time she's busted before it's nerfed.","replies":[]},{"poster":"Spideraxe","date":"2017-08-30T19:59:29.262+0000","up_votes":3,"down_votes":0,"body":"Sweet rune, can I ask about the concerns of them leading to stat checking?","replies":[{"poster":"Weedlayer","date":"2017-08-30T21:18:00.086+0000","up_votes":1,"down_votes":0,"body":"Could you explain what you mean by \"stat checking\"?","replies":[{"poster":"Spideraxe","date":"2017-08-30T21:27:06.803+0000","up_votes":2,"down_votes":0,"body":"Stat checking is when you just beat someone, not because of skill, but because you just get more raw stats then them and beat them down. Should note on the complete opposite is a skill check where you beat someone because you executed like a combo better","replies":[{"poster":"Wrekzzz","date":"2017-08-30T21:46:51.487+0000","up_votes":7,"down_votes":0,"body":"Stat checking is a deeper conversation because the term doesn't just apply to whenever you beat someone with stats. We could make a champion with 1 movespeed and an insane amount of stats, but that champion would be high on strategic counterplay. Stat-checking becomes a negative when there is no way to outplay the opponent tactically (due to stats) or strategically. When early game champions have the capacity to lane-bully this problem arises. However, when making power curve tradeoffs such as with Gathering Storm while you may gain the ability to Stat-check people more in the late game, you also open yourself up to strategic counters earlier in the game due to relative weakness during that phase.\n\nIn this case i'm not super worried, I think Gathering Storm is just more strategically slanted than tactical.","replies":[]}]}]}]},{"poster":"Jackom1","date":"2017-08-30T19:39:07.334+0000","up_votes":1,"down_votes":0,"body":"These runes looks definitely cool. \nBut as it is now, every effect that adds raw power as soon as possible is simply stronger and more desirable that any option that offers late game power. Game end pretty fast nowadays.\n\nHow can you assure us that these late game options will actually be an option, instead of having another situation where whatever gives you power as soon as possible is the better choice?\n\nI like the idea of something that makes you scary in late game, but what if getting strong early game will be the better choice in 90% of games?","replies":[{"poster":"Meddler","date":"2017-08-30T20:51:31.003+0000","up_votes":7,"down_votes":0,"body":"If Gathering Storm's never a good choice we'll balance it so it is sometimes. It's the sort of design that shouldn't be good all the time though, picking the right champs/games to use it in's the skilltest on that particular Rune.","replies":[]}]},{"poster":"Nagoh Shan","date":"2017-08-30T19:45:13.705+0000","up_votes":1,"down_votes":0,"body":"For the \"adaptive\" runes, how to they work for champs with dual scaling?\n\nFor example {{champion:84}} {{champion:55}} {{champion:10}} {{champion:90}}","replies":[{"poster":"Wrekzzz","date":"2017-08-30T19:46:49.236+0000","up_votes":6,"down_votes":0,"body":"There is a Runes Corner that covers how Adaptive works in detail, but essentially it matches whichever stat you've built more of.","replies":[{"poster":"warpenguin555","date":"2017-08-30T20:15:38.702+0000","up_votes":2,"down_votes":0,"body":"What if you somehow built equal AD and AP?","replies":[{"poster":"Apex Support","date":"2017-08-30T20:26:01.100+0000","up_votes":7,"down_votes":0,"body":"It gives you the stat that is stated the first.\nSo in this case it would be ap.","replies":[]}]},{"poster":"Sw4de","date":"2017-08-30T20:07:12.636+0000","up_votes":1,"down_votes":0,"body":"What if you start off building cutlass so you have more AD, but then progress into a full ap build? does your AP scaling fall behind or do you lose the AD scaling that you received earlier?","replies":[{"poster":"Meep Man","date":"2017-08-30T20:21:37.300+0000","up_votes":5,"down_votes":0,"body":"You get AD while you have built Cutlass, and then once you have built more AP than AD, you start getting AP.","replies":[]}]}]}]},{"poster":"AwesomeGuyDj","date":"2017-08-30T20:43:51.409+0000","up_votes":3,"down_votes":2,"body":"Is gathering storm a keystone?\nIf so it looks horrible for it.","replies":[]}]}