{"poster":"ThundercatzTZ","date":"2015-01-05T04:58:39.044+0000","title":"Bronze elo players looking to start a serious ranked team","subforum":"[ARCHIVED] Player Recruitment","up_votes":1,"down_votes":0,"body":"Are you tired of being picked on for being bronze? Do you want to start a name for yourself and prove to others that you can make it? Well hop on the same boat that I'm in. I am looking for any bronze elo players that are looking to start up a new ranked team with myself included, and climb up the ranks. I am on daily and prefer to play at night in NA (central time), but if you have a different playing time preference please let me know. I am open for any positions, i play all of them so I'm not picky. If you are seriously about starting up a team with me then please message me in game. My ign is ThundercatzTZ pm me if you want to join in.\r\nThank You for your time and have a wonderful rest of your days!!","replies":[{"poster":"The Fire on Fire","date":"2015-01-19T14:28:57.035+0000","up_votes":1,"down_votes":0,"body":"hey, im lvl 29 and  half, and yea, imma start bronze soon. (after a bit more games of course) so yea","replies":[]},{"poster":"JacqueRex09","date":"2015-01-19T14:27:20.109+0000","up_votes":1,"down_votes":0,"body":"Hey :). I'm a bronze player and I would really be interested in joining your team. PM me the details? My ign is JacqueRex09, by the way, and I main either support or adc.","replies":[]},{"poster":"PrinceofGames1","date":"2015-01-19T08:40:39.484+0000","up_votes":1,"down_votes":0,"body":"oh and I am best mid lane","replies":[]},{"poster":"PrinceofGames1","date":"2015-01-19T08:40:19.341+0000","up_votes":1,"down_votes":0,"body":"I am very much able to join I am silver l and right no I am I the makes of making a team so my in game name id PrinceofGmaes1 and  hope u and anyone else can join to strive to the top","replies":[]},{"poster":"PhiI CoIIins","date":"2015-01-19T05:57:19.780+0000","up_votes":1,"down_votes":0,"body":"Im silver 2 but i would totally be down to play with you guys. I main Jungle but i can play Top and Mid pretty well as well","replies":[]},{"poster":"ThundercatzTZ","date":"2015-01-19T05:55:54.522+0000","up_votes":1,"down_votes":0,"body":"I'm sorry that i'm responding back so late i'm adding both of you today and we can play some normal's first until we get 2 more people.","replies":[]},{"poster":"Exoticfritos","date":"2015-01-09T01:37:22.039+0000","up_votes":1,"down_votes":0,"body":"add me i wanna play top lane","replies":[]},{"poster":"Prodoggy","date":"2015-01-08T23:54:34.196+0000","up_votes":1,"down_votes":1,"body":"I'm definitely interested. I'm bronze 3, but I play with friends that are gold and plat. I'm trying to start up a team too. Add me in game and we can start this team, I main jungle.","replies":[]},{"poster":"ThundercatzTZ","date":"2015-01-05T05:46:30.403+0000","up_votes":1,"down_votes":1,"body":"Bro it's just annoying just because your in a certain elo doesn't mean you belong there so that's all I'm saying.","replies":[]},{"poster":"Dad Rock","date":"2015-01-05T05:05:33.786+0000","up_votes":1,"down_votes":1,"body":"Shit dude, I'm Plat and I'm tired of being picked on for being Plat. It's a cold harsh world out there buddy, the grass doesn't get any greener.","replies":[]},{"poster":"Zzigg Zoldyck","date":"2015-01-05T05:02:52.735+0000","up_votes":1,"down_votes":1,"body":"lmao ^^^^^^","replies":[]}]}