{"poster":"Dani NT4L","date":"2016-01-26T23:23:53.536+0000","title":"#flamer Diese capsLock Flamer -_-","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":4,"body":"Ich w&uuml;rde gerne mal einfach nur diese Rache-Gelegenheit bekommen, diese &quot;Flamer&quot; und &quot;CapsLock&quot; Junks einfach mal in den Ar*ch zu treten.. \r\nIch bin ja kein b&ouml;ser Mensch, aber es nervt und macht mich w&uuml;tend wenn man meine Mutter und Freunde in einem SPIEL das Freude machen soll beeidigt werden... \r\n\r\nMFG Dani\r\n{{sticker:slayer-jinx-catface}} \r\n\r\nPS. Liebe Riot Mitarbeiter die dies Lesen k&ouml;nnen/werden, bitte Kommentiert Diskutiert und lasst euch was mit der Community einfallen. Auch wenn esnur ums Verhalten geht...","replies":[{"poster":"Rainbow Dashie","date":"2016-01-27T00:27:03.217+0000","up_votes":5,"down_votes":0,"body":"Und über was möchtest du jetzt mit uns Foren Nutzern diskutieren bzw was soll uns dieser Thread sagen?","replies":[{"poster":"Tokogawaruf","date":"2016-01-27T03:33:28.834+0000","up_votes":2,"down_votes":1,"body":"wahrscheinlich das Flamer immer noch Flamer sind und negative Emotionen hervorrufen. Kann auch nicht mehr mit dem Thread anfangen","replies":[]}]},{"poster":"Neamhoilte","date":"2016-01-27T14:12:45.833+0000","up_votes":3,"down_votes":1,"body":"Guckst du hier Dani:\n\nhttp://boards.euw.leagueoflegends.com/de/c/clans-teams-de/EyJRt7XA-zocken-ohne-flamer-die-liga-der-gentlemen\n\nDa werden sie geholfen.\n\n\n\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Tungsteel","date":"2016-01-27T08:44:39.103+0000","up_votes":2,"down_votes":1,"body":"Wenn jemand flamet, dann mute den einfach und reporte ihn nachher. Riot hat sich schon etwas einfallen lassen - nämlich genau das. Und wenn du dich hier im Bereich \"Spielerverhalten\" umsiehst, wirst du auch an den zahlreichen Permabann-Threads sehen, dass das System recht gut funktioniert.","replies":[]},{"poster":"dugg","date":"2016-01-27T07:19:38.134+0000","up_votes":2,"down_votes":1,"body":"Wenn dich das schon stört, dann solltest du niemals Dorffußball spielen. Da geschieht so was von Angesicht zu Angesicht. \n\nDu möchtest Rache für verbale Entgleisung anonymer Menschen nehmen? Klar, du bist kein Böser...\n\nWas sollen die Riotmitarbeiter denn einfallen lassen oder kommentieren/diskutieren? Dass du mit deiner Situation unzufrieden bist? Es gibt das Reportsystem, nutze es. Wenn jemand flamet, dann wird es dafür bestraft Punkt aus! Je mehr Leute es nutzen, desto weniger Flamer gibt es.\n\nAnsonsten -> mute -> gg","replies":[]}]}