{"poster":"CrankyPants","date":"2016-07-10T09:51:20.027+0000","title":"Cambios a la Piedra Vidente (Sugerencia)","subforum":"Charlas Generales","up_votes":19,"down_votes":3,"body":"Hola a todos, me gustar&iacute;a hablar sobre un cambio que a muchos les ayudar&iacute;a (sobre todo a los que juegan de soporte) en la cual el item &quot;Piedra vidente&quot; tenga una segunda opci&oacute;n que el Rub&iacute; de visi&oacute;n en la cual pueda dar un centinela rosa.\r\n\r\nLa idea se me ocurri&oacute; al leer un post en donde ped&iacute;an un espacio para los centinelas porque, como soportes, el sacrificar un item (o parte de el) para tener un pink listo es bastante tedioso y arriesgado en muchas ocasiones. \r\nAlgunos quiz&aacute;s digan &quot;pero si est&aacute; la baratija roja&quot; a esas personas &iquest;Que har&iacute;an si se us&oacute; para limpiar alg&uacute;n ward anteriormente? \r\nTodos hemos pasado por la frustraci&oacute;n de ver desaparecer a un Shaco a bajo de vida, saber donde est&aacute; un Teemo  pero tener que esperar a que ataque para reci&eacute;n verlo y arriesgarse de que llegue el equipo enemigo a protegerlo (lo mismo se aplica a Akali )\r\n\r\n Pens&eacute; en algo as&iacute;:\r\n\r\nNombre: Piedra del Or&aacute;culo\r\nReceta: {{item:2049}} +{{item:3024}} \r\n\r\n+200 de vida\r\n+25 Armadura\r\n+250 de man&aacute;\r\nPasiva &Uacute;NICA: 10% Red. Enfriamiento.\r\nPasiva &Uacute;nica: Las activas de los objetos reducen en 10% su enfriamiento\r\nActiva &Uacute;nica, Vigilancia Absoluta: Consume una carga para colocar un **centinela de visi&oacute;n** que revela las unidades invisibles hasta que sea destruido.  Contiene una carga y se llena al visitar la tienda.\r\n\r\nEste ser&iacute;a un excelente item para esos campeones que usan invisibilidad {{champion:84}} {{champion:121}} {{champion:35}} {{champion:91}} {{champion:17}} {{champion:28}} {{champion:107}} {{champion:29}} {{champion:62}} {{champion:67}}  y espero que la comunidad el guste la idea. \r\n\r\nSaludos.","replies":[{"poster":"kipkeior","date":"2016-07-10T13:08:53.578+0000","up_votes":7,"down_votes":0,"body":"Ok wow soy idiota , cuando leí el titulo pensé que el tema se trataba de malphite  xD","replies":[{"poster":"Nyán","date":"2016-07-10T17:29:09.470+0000","up_votes":4,"down_votes":0,"body":"{{champion:54}} Vidente nueva skin?","replies":[]},{"poster":"Akalimaster","date":"2016-07-10T14:33:55.109+0000","up_votes":4,"down_votes":0,"body":"no eres el unico {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"kipkeior","date":"2016-07-10T15:43:35.462+0000","up_votes":2,"down_votes":0,"body":"Great minds think alike xD","replies":[]}]}]},{"poster":"Hnk Kenshiro","date":"2016-07-10T15:00:37.996+0000","up_votes":6,"down_votes":0,"body":"Si lo piensas, no es util, sacrificaras tus 3 wards normales por un pink (y los stats).\n\nPodria funcionar que sean 4 cargas, y al consumir 3 la 4° sea un pink.\n\nO al comprar el item, desbloqueas el espacio para pinks","replies":[{"poster":"Fukaih","date":"2016-07-10T16:44:34.099+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=v7qsfXsE,discussion-id=arivAuBA,comment-id=0004,timestamp=2016-07-10T15:00:37.996+0000)\n>\n> Si lo piensas, no es util, sacrificaras tus 3 wards normales por un pink (y los stats).\n> \n> Podria funcionar que sean 4 cargas, y al consumir 3 la 4° sea un pink.\n> \n> O al comprar el item, desbloqueas el espacio para pinks\n\nMe gusta más está idea, que la 4ta carga te de el pink, ya que como main supp, perder los 3 wards por 1 pink es bastante arriesgado, o que al mejorar la piedra vidente te desbloquee el espacio para el pink, creo que seria más útil así.\n\nOjalá un rioter lo lea y lo tomen en cuenta para futuros parches.","replies":[{"poster":"matirslorsv1","date":"2016-07-10T23:35:44.617+0000","up_votes":3,"down_votes":0,"body":"O mejor aun, que tengan 4 cargas el {{item:2049}}  y cuando lo mejoras a {{item:2045}} (que tiene 5 cargas) si pones 2 wards (uno sobre de otro) este se mejore a pink. Asi evitas poner el pink por accidente y evitas tener que spamear el ward para que salga el pink y perder la visión que tenias. \n¿Que les pareció eso?\n\n[Matirslorsv1]","replies":[{"poster":"Bot Hawk","date":"2016-07-11T16:51:35.077+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=matirslorsv1,realm=LAS,application-id=v7qsfXsE,discussion-id=arivAuBA,comment-id=000400000001,timestamp=2016-07-10T23:35:44.617+0000)\n>\n> O mejor aun, que tengan 4 cargas el {{item:2049}}  y cuando lo mejoras a {{item:2045}} (que tiene 5 cargas) si pones 2 wards (uno sobre de otro) este se mejore a pink. Asi evitas poner el pink por accidente y evitas tener que spamear el ward para que salga el pink y perder la visión que tenias. \n> ¿Que les pareció eso?\n> \n> [Matirslorsv1]\n\nBuen post tucán místico de los montes siberianos del sureste, pero quedaría mejor si hubiese sido un poco mas original tigre de bengala potenciado por uranio enriquecido de los desiertos de Kazajistán. Van mis +10, denunciado, -8, bloqueado, desfaveado, vuelto a bloquear, posteado en mi fb en publicación marcada, desbloqueado. Así que despedite de tu cuenta bombardero cósmico del séptimo comando iraní de los altos cargos galácticos Mira lince galáctico del valle artico de la galaxia de andromeda, verdaderamente tu post me parece muy malo papu, por que? Porque me parece que no te tomaste el tiempo para analizarlo, solo posteas lo primero que te sale del orto, lo captas pibe? Antes de postear lee bien tu post, todos los dias es lo mismo contigo hijo de la re mil putas, todos los dias tengo que estar viendo tus posts de mierda, no te basta con publicar tus puterias una vez, NO! Todo el dia estas pegado a la pc pensando en que mierda publicar, ya me tenes las bolas llenas rufian de pacotilla, asi que escuchame bien pendejo del orto, ve despidiendote de tu cuenta dragon milenario de 3 cabezas de la antigua babilonia, en este momento te denuncio y fiuu te despedia de tu cuenta, -10 y denunciado pero TE DIGO UNA COSA MASTER? Una sola cosa nomas queria decirte, me agrado mucho tu post, en serio, es de lo mas sensacional que he visto por el momento, es una obra de arte, sin exagerar, es algo que, a simple vista. podria haber sido echo por el mismisimo Da Vinci, la genialidad que tiene se puede notar desde kilometros de distancia, ni siquiera la peor de las malas lenguas podria decir que no nos encontramos ante una majestuosidad vista una sola vez cada mil años. no he visto en todos mis años de vida algo de esta magnitud , te provoca una sensacion indescriptible, una alegria inmensa a pesar de no haber echo accion alguna, un sentimiento raro de encontrar pero fantastico, algo asi como lo que se siente una brisa en un caluroso verano.","replies":[]}]},{"poster":"Hnk Kenshiro","date":"2016-07-10T17:45:28.283+0000","up_votes":1,"down_votes":0,"body":"Gracias por tu opinion, aunque lo veo lejano.","replies":[]}]},{"poster":"Neo Gaussrik","date":"2016-07-11T17:00:42.775+0000","up_votes":2,"down_votes":0,"body":"Iba a decir algo similar. Me llamo la atencion; perder los 3 centinelas del soporte en especial hacia el juego tardio me parece demasiado caro por un miserable pink...","replies":[{"poster":"Hnk Kenshiro","date":"2016-07-11T17:23:00.174+0000","up_votes":1,"down_votes":0,"body":"Señor Gaussrik, aprovecho de preguntar ¿Se ha pensado en poder comentar desde las actualizaciones (aunque sean menos caracteres), para evitar re-cargar varias veces la pagina del foro?\n------------------\nGracias por compartir su opinion, yo tambien habia dejado unas cuantas [ideas](http://boards.las.leagueoflegends.com/es/c/charlas-generales/Fg758tKm-baratijas-y-el-nivel-18) xD","replies":[]}]}]},{"poster":"Hendrix","date":"2016-07-10T15:33:27.874+0000","up_votes":1,"down_votes":0,"body":"Y perdes los tres wards para tener un pink?? O entendi mal?\nMmmm no me parece buena idea","replies":[{"poster":"Alpaca Suri","date":"2016-07-10T15:41:44.717+0000","up_votes":3,"down_votes":0,"body":"Pero puedes conservar la baratija amarilla :P, además que si tus compañeros tienen dos dedos de frente te ayudaran a a wardear (cosa que no me pasa nunca)","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-07-10T15:35:19.576+0000","up_votes":1,"down_votes":0,"body":"Entendiste bien :p","replies":[]}]},{"poster":"QuatiLover","date":"2016-07-10T16:52:54.824+0000","up_votes":2,"down_votes":0,"body":"Otra opción seria, un ítem con stats de utilidad para diferentes soportes (poke, sustain, tanque) que tenga el pink.\nun ejemplo para los supports de sustain:\n\n{{item:3114}} + {{item:1028}} + {{item:1052}} + 415g (2100 total)\n\n+ 100% Regeneración de mana basica\n+ 300 Vida\n+ 10% Curación y poder de escudo\n+ 35 Poder de habilidad\n+ junto con la activa de los pinks\n\nSoraka aprueba este comentario {{champion:16}}","replies":[{"poster":"Lysaru","date":"2016-07-11T05:09:56.319+0000","up_votes":2,"down_votes":0,"body":"No esta roto ni nada eh","replies":[]}]},{"poster":"Gen","date":"2016-07-11T00:56:17.419+0000","up_votes":1,"down_votes":0,"body":"no es buena idea es solo mi opinion.. y con eso sacarias de todas las partidas a los pj que son invisibles que chiste tiene que no sacrifiques nada para ganar algo  no sacrificas tu preciado espacio de item para ganar visibilidad que es el fuerte del otro champ matarias unos cuantos champs con esos cambios","replies":[]},{"poster":"Runth","date":"2016-07-10T17:30:21.615+0000","up_votes":1,"down_votes":0,"body":"no me gusta\n\nprefiero q asignen un bloque para items comestibles y q se compren sus ward a 75g y a morirse","replies":[]},{"poster":"Ks Erwyn","date":"2016-07-10T15:08:49.667+0000","up_votes":1,"down_votes":0,"body":"No!, un soporte que no es funcional sin items no es un buen soporte.......","replies":[]},{"poster":"No Uso Thresh","date":"2016-07-10T11:44:28.044+0000","up_votes":1,"down_votes":0,"body":"Esta buena, seria mejor que el rubi al mejorarlo te de 2 pink y nada mas.","replies":[]},{"poster":"Yellow Sphere","date":"2016-07-10T10:22:23.606+0000","up_votes":1,"down_votes":0,"body":"Ey, es raro que esté de acuerdo con las ocurrencias de la comunidad, pero... Me agrada tu idea. +1\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"MorochoCandente","date":"2016-07-10T10:10:24.104+0000","up_votes":1,"down_votes":0,"body":"+1 Me gusta la idea!\n\nQuizas cambiar un poco la formula, pero me parece bastante interesante ver algo asi para los soportes!","replies":[]}]}