{"poster":"DonMisterMen","date":"2019-07-31T21:31:49.105+0000","title":"Urgente! Riot envía notificaciones falsas Sobre sanciones aplicadas a  jugadores reportados.","subforum":"Charlas Generales","up_votes":96,"down_votes":8,"body":"hola porfavor leer  completo antes de comentar, esto puede ser demaciado importante\r\nantes que nada entrare en contexto:\r\n\r\nel dia domingo 29 de julio me puse a jugar la ultima ranked del dia a eso de las 11 pm.\r\ny pucha tuve la mala suerte de que entro un tipo Wiro** ( no digo su nombre para no incitar al acoso) que literalmente se conecto para solo morir y hacer perder al team (jactandose de esto en el chat, pero sin flamear) a lo que perdimos. \r\npunto a parte creo que muchos lo reportamos dentro del sistema, pero como la muerte intencional es dificil de detectar para un bot (aunque terminar 0/9/0 debería ser un poco mas obvio que paso algo raro) me decidi a pedir un ticket al soporte y reportarlo por ahi también por si las moscas. es muy importante que mencione que ese día no mande ningún reporte a otro jugador solo a el, ( ni dentro ni fuera del juego)\r\n\r\nbueno el ticket fue enviado y todo, me fui  a dormir, el dia lunes 30 no me conecte en todo el día así que el dia martes me conecte y apenas entro aparece  el tipico cuadro de **\"un jugador que has reportado recientemente ha sido sancionado\" **  wow dije hubo justicia. y nose porque pero me dio por revisar el perfil del tipo en cuestión, para ver si había seguido haciendo lo mismo o si ya venia haciendolo de antes.\r\nsorpresa el tipo tenia partidas jugadas hasta la fecha de ese mismo día martes. \r\nwtf ( la sanción por morir intencionalmente y trolear a los demás en rankeds es suspencion de 14 dias normalmente; el tipo no insulto a nadie, no flameo solo se jactaba en el chat de que haría perder al team muriendose) osea raro que le hubiesen restringido el chat injustamente o ponerlo tambien en una cola de baja prioridad no hubiese sido la sanción apropiada. \r\nasí que  en la solicitud que había enviado el domingo pedí la asistencia de un humano preguntando cual es la sanción por morir intencionalmente. y que ademas estaba pero comprobadisima (chat, kda, etc..) y le escribí que hay 2 opciones o le pusieron una sanción injusta ( restriccion de chat o cola de baja prioridad) o que realmente ese aviso era falso y solo se envía para que quedes satisfecho y dejes de joder coloquialmente.\r\n\r\nacá viene lo terrible hoy es miércoles, y me conecte prácticamente solo a jugar TFT,  ni el martes ni hoy he mandando nigun reporte( ni dentro ni fuera del juego) a las 4:30 pm termino una partida de TFT y me aparece el cuador de \" un jugador que has reportado recientemente ha sido sancionado\" \r\nWTF no he reportado a nadie en 3 dias Osea que onda, fui al soporte- mis solicitudes- la solicitud que tenia abierta reclamando todo esto \r\nSORPRESA MAYUSCULA GENTE :  a las 4:10 pm me habia escrito lo que supongo era un humano (con la típica respuesta generica que se nota que no leyeron nada( y que no te responden nada)  y parece- podria ser - un copi paste que mandan a todos.) el admin me habia mandado ese cuadro para que dejara de joder.\r\n\r\nPor si las moscas revise tambien el perfil del tipo reportado (Wiro**) seguia con partidas jugadas en este miercoles. \r\n\r\nGente esto es gravisimo Riot no esta sancionado gente y peor aun mandan los cuadros de # un jugador que has reportado recientemente blablabla...#\r\nsolo para que dejen de joder. gente porfavor esto es algo de suma importancia. como nos piden ellos como empresa que mantengamos un comportamiento adecuado si ellos mismos están mintiéndonos y protegiendo a jugadores que incurren en faltas graves. \r\nporfavor si hay mas personas que  han podido detectar una notificación falsa de estas ponganse en contacto, esto no puede estar pásando.","replies":[{"poster":"Light Z","date":"2019-08-01T02:44:35.323+0000","up_votes":23,"down_votes":1,"body":"Exijo que venga un rioter a aclarar todo. O voy a correr la palabra de esto.","replies":[]},{"poster":"TheBestGmork","date":"2019-08-01T03:40:07.954+0000","up_votes":17,"down_votes":0,"body":"Si lo que decis es cierto, este juego está en las ruinas...","replies":[]},{"poster":"Literally Me","date":"2019-08-01T03:22:58.785+0000","up_votes":17,"down_votes":1,"body":"yo digo que le mandes la info a dross para que haga un video de este caso tan perturbador","replies":[]},{"poster":"SW Qui Gon Jinn","date":"2019-08-01T03:29:55.647+0000","up_votes":9,"down_votes":0,"body":"mira, ayer con mi amigo jugamos una donde habia un premade de 3 RE TOXICOS, pero se pasaban de mambo con las cosas que decian.. al final los re carreamos y al final los reportamos y nos salio a los 2 el mensajito (tengo fotos por si las dudas) y uno de los tipos me agrego para el famoso (1 vs 1 ñiñiñi).. yo les dije ''suerte con esa sancion de chat'' onda porque alguno de esos 3 del team fue.. a lo que me responden con que a nadie le llego nada y en opgg estan ahi jugando lo mas bien... eso del mensajito estoy seguro que es un re chamuyo, todas las veces que reporte y me salio el mensaje los buscaba y estaba ahi como si nada esa gente...","replies":[]},{"poster":"askrabia","date":"2019-08-01T02:26:48.827+0000","up_votes":6,"down_votes":0,"body":"Las sanciones per se existen, la cosa es si son merecidas, a rito no le conviene los ban rápidos y justos porque se quedan sin gente, pero ponen una sanción chica para ver si cambias tú actitud, un amigo mío ya ah sido baneado varias veces, y se zarpa en tóxico, el ban es solo de chat, asique una bobada, en 10 partidas insulta de nuevo a todos, los bans gigantes existen, pero solo para los chiteros y gente así que abusa mucho\nPd: recuerdo que cuando hubo cierto exploit, un flaco con alistar salió de bronce hasta diamante jajaja","replies":[{"poster":"Osorkon21","date":"2019-08-02T07:30:36.559+0000","up_votes":2,"down_votes":0,"body":"Tengo 7 cuentas baneadas por \"toxicidad\" solo en la primera era flammer en las otras por defenderme de flammers sin insultar ni criticar a nadie, solo por discutir, segun la gente del soporte aunque no digas nada malo discutir con un flammer genera un ambiente desagradable para los demás y el permaban es merecido... Creeme que el insta-permaban te lo dan con cualquier excusa si te reportan 4 premades y le hacen creer a un par de enemigos que sos el flammer ya estas al horno\n\nLa mayoría de mis cuentas fueron baneadas en elo alto pero incluso tengo una permaban en lvl 27 en la que nunca insulte ni toxiquee, incluso evite discutir me tocaron premades toxicos, convencieron a los enemigos, no me defendi para no \"discutir y generar ambiente desagradable para los demas\" todos me reportaron y permaban sin siquiera haber recibido una sancion de chat anteriormente... Todas estas cuentas teniendo el mismo e-mail. Ahora uso otro email y no recibo ningun tipo de sanción \n\nEl bot de riot banea a cualquiera que se reporte y los de soporte ni se gastan en revisar si era justo o no... Incluso me quitaron algunos bans pero me dejaron en honor 0 y sin recompensa de temporada..","replies":[{"poster":"Kårlsęfnni","date":"2019-08-02T14:53:06.791+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Osorkon21,realm=LAS,application-id=v7qsfXsE,discussion-id=ZAJ3LtAR,comment-id=00070000,timestamp=2019-08-02T07:30:36.559+0000)\n>\n> Tengo 7 cuentas baneadas por \"toxicidad\" solo en la primera era flammer en las otras por defenderme de flammers sin insultar ni criticar a nadie, solo por discutir, segun la gente del soporte aunque no digas nada malo discutir con un flammer genera un ambiente desagradable para los demás y el permaban es merecido... Creeme que el insta-permaban te lo dan con cualquier excusa si te reportan 4 premades y le hacen creer a un par de enemigos que sos el flammer ya estas al horno\n> \n> La mayoría de mis cuentas fueron baneadas en elo alto pero incluso tengo una permaban en lvl 27 en la que nunca insulte ni toxiquee, incluso evite discutir me tocaron premades toxicos, convencieron a los enemigos, no me defendi para no \"discutir y generar ambiente desagradable para los demas\" todos me reportaron y permaban sin siquiera haber recibido una sancion de chat anteriormente... Todas estas cuentas teniendo el mismo e-mail. Ahora uso otro email y no recibo ningun tipo de sanción \n> \n> El bot de riot banea a cualquiera que se reporte y los de soporte ni se gastan en revisar si era justo o no... Incluso me quitaron algunos bans pero me dejaron en honor 0 y sin recompensa de temporada..\n\nSi defenderse es decirle \"OJALÁ TU VIEJA SE MUERA DE CANCER GAY Y LA CO**HA PU** DE TU HERMANA\", creo que está justificado el ban XD","replies":[{"poster":"Osorkon21","date":"2019-08-03T00:08:10.921+0000","up_votes":1,"down_votes":0,"body":"Como dije, sin flamear, insultar ni nada parecido simplemente explicarle porque mori, o porquue no pude ayudarlo, obviamente me discutio todo mientras me flameaba a full y bueno simplemente por seguir explicando las cosas banea3\n\nPd: tengo un amigo que al primero que muere le putea a el, su hermaba, su madre, sus tias y abuelas les desea la muerte y enfermedades como cancer sida y demas.... El man es honor 5 nunca recibió ningun castigo, esas cosas son las que no se entienden","replies":[]}]},{"poster":"Olakeasé","date":"2019-08-02T16:29:49.002+0000","up_votes":1,"down_votes":0,"body":"Me paso lo mismo hace 1 día, me defendí de un tipo que me insultó todo el game por no tirar ignite minuto 2, se fue afk, no ayudaba, yo lo reporto y calculo que el a mí también para que al final yo tenga restricción de chat de 25 partidas y el tipo me agrega para cagarse de risa en mi cara, hablé con soporte y me puso lo mismo que a vos{{summoner:3}}. PD: aclaro que no lo insulte en toda la partida","replies":[]}]}]},{"poster":"Tamer 01","date":"2019-07-31T21:44:02.145+0000","up_votes":7,"down_votes":1,"body":"stos de rito +1 para no caer en el olvido","replies":[]},{"poster":"LastHope17","date":"2019-08-01T07:37:15.995+0000","up_votes":4,"down_votes":0,"body":"Soy de reportar seguido(Porque juego mucho, no de tilt) asi que nunca me fije en si X jugador siguió jugando o que, voy a prestar mas atención de ahora en adelante.","replies":[]},{"poster":"League øf drâven","date":"2019-08-01T05:31:50.742+0000","up_votes":8,"down_votes":4,"body":"Pobresito, aun cree que hay soporte en league of legends","replies":[{"poster":"Tylr2","date":"2019-08-01T10:29:13.727+0000","up_votes":2,"down_votes":1,"body":"Pibe no seas asi de resentido vos pensas que no hay soporte si hay, solo que se realizan tantos reportes que no les da para para ver todo y se hace de a poco","replies":[]}]},{"poster":"Gabeku","date":"2019-08-01T05:34:32.608+0000","up_votes":5,"down_votes":3,"body":"Dios mío... Cómo se nota que no tienen idea de cómo funciona el reporte de retroalimentación de riot games.","replies":[{"poster":"Yellow Sphere","date":"2019-08-02T05:24:10.724+0000","up_votes":2,"down_votes":0,"body":"¿Cómo funciona? Ilumínenos.","replies":[]}]},{"poster":"Unranked721","date":"2019-08-01T05:24:50.758+0000","up_votes":3,"down_votes":1,"body":"Bienvenido al mundo real amigo ...","replies":[]},{"poster":"TRASHGENDER","date":"2019-07-31T21:55:09.994+0000","up_votes":4,"down_votes":3,"body":"Creo que es muy obvio lo que sucede y ademas de que ya varias veces se trato el tema de los carteles de notificacion de los Reportes.\nYa es redundante el tema asiq ue lo mejor que podes hacer es contactar a soporte y te explique como funciona el sistema y avisos de reports","replies":[]},{"poster":"Excorpion","date":"2019-08-01T00:47:26.073+0000","up_votes":3,"down_votes":6,"body":"xD no por que reportaste a alguien por soporte, significa que el sancionado avisado es ese MALPHITE.\nSi, es un malphite de quien hablas... y aún sigue jugando, por lo que claramente, no fue el el sancionado.\nEs más, podríamos decir que has sancionado a 2 personas gracias a tus reportes, pero ninguno de ellos es aquel malphite.\n\nEl sujeto en cuestión suele perder bastante, lo que no es sorpresa dado que usa cualquier champ, y en todos tiene un kda asqueroso... no es sorpresa para un plata 3 (lo dice un plata :V), así que no hay de que sorprenderse.\n\nTampoco incurriré en tu partida dado que no la vi... pero si se jactaba de eso en el chat como dices, debes tener alguna foto de ello, captura, o algo que hayas mandado en el reporte al soporte o no ?\n\nA todo esto... el sistema no te detecta por una partida donde hayas fedeado... eso esta comprobado. Dado que es dificil demostrar a un manco total vs un feeder... tiene que ser algo frecuente más que nada.","replies":[{"poster":"Alphimet","date":"2019-08-01T22:53:49.375+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Excorpion,realm=LAS,application-id=v7qsfXsE,discussion-id=ZAJ3LtAR,comment-id=0004,timestamp=2019-08-01T00:47:26.073+0000)\n>\n> xD no por que reportaste a alguien por soporte, significa que el sancionado avisado es ese MALPHITE.\n> Si, es un malphite de quien hablas... y aún sigue jugando, por lo que claramente, no fue el el sancionado.\n> Es más, podríamos decir que has sancionado a 2 personas gracias a tus reportes, pero ninguno de ellos es aquel malphite.\n> \n> El sujeto en cuestión suele perder bastante, lo que no es sorpresa dado que usa cualquier champ, y en todos tiene un kda asqueroso... no es sorpresa para un plata 3 (lo dice un plata :V), así que no hay de que sorprenderse.\n> \n> Tampoco incurriré en tu partida dado que no la vi... pero si se jactaba de eso en el chat como dices, debes tener alguna foto de ello, captura, o algo que hayas mandado en el reporte al soporte o no ?\n> \n> A todo esto... el sistema no te detecta por una partida donde hayas fedeado... eso esta comprobado. Dado que es dificil demostrar a un manco total vs un feeder... tiene que ser algo frecuente más que nada.\n\nRiot no puede revisar los registros de chat de una partida? como se supone que aplican sanciones de chat? xD si el tipo puso que estaba haciendo perder a su equipo a proposito cuando se pidio que se lo investigara los de Riot debieron haber revisado esos registros. Ademas el del post dijo que no había reportado a naadie en un buen tiempo ademas de al tipo este así que sería raro que le llegaran justo carteles de que sancionaron a otros jugadores que reporto. Que carajo dices man","replies":[]}]},{"poster":"DiosiTo B","date":"2019-08-02T23:11:43.215+0000","up_votes":1,"down_votes":0,"body":"Quejarte para que Riot haga algo con la comunidad es como pedirle a los policías de argentina que atrapen a todos los ladrones por que les conviene que estén sueltos ya que así ganan \"Plata\" \"Dinero\" mejor preocuparse en subir de liga","replies":[]},{"poster":"YlHADlSTA","date":"2019-08-01T19:18:52.557+0000","up_votes":1,"down_votes":6,"body":"***","replies":[{"poster":"Del0reaN","date":"2019-08-01T23:32:15.166+0000","up_votes":1,"down_votes":0,"body":"¡Yisus! Pensá lo que estás diciendo. El trolleo no se sanciona con suspensión de chat. Ese tipo de sanción es para aquellos que insultan (en su primer sanción) o los que hacen abuso verbal (uso excesivo del chat).\n\nLa sanción por trollear la partida es con suspensión de 1 día en la primer ocasión, suspensión de 14 días en la segunda y suspensión permanente en la tercera. Ahora, de ahí a que comprueben que sucedió el trolleo realmente, es otro tema.\n\nPor otro lado, el rango del usuario no tiene absolutamente nada que ver con su experiencia en el soporte. Es como pedir un título de \"Ingeniería en Sistemas\" para manejar un cajero automático. Que, además, te metas en su vida personal (diciendo que es un Plata en la vida), es peor aún.\n\nNada, deberías rever tus actitudes. Con todo respeto, si esto te parece fake, tenés la opción de mirar para otro lado y evitarte la molestia de insultar a alguien que no conocés.\n\nUn abrazo!","replies":[{"poster":"YlHADlSTA","date":"2019-08-02T19:18:49.966+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Del0reaN","date":"2019-08-02T23:01:34.888+0000","up_votes":1,"down_votes":0,"body":"Si, asumo que en algo tenés razón: recordaba que supuestamente había un ban de 1 día, pero no es así. Directamente pasa al ban de 14 días.\n\nAcá tenés un cuadro que resume el sistema de sanciones de LOL.\n\nhttps://i.imgur.com/6xa66hg.jpg\n\nNótese que, debajo de la parte donde dice \"conducta tóxica extrema\", dice claramente \"SUICIDIOS\". Ese es el caso que se está debatiendo en este post. Directamente salta al ban de 14 días. No existe el chat ban por 10 partidas por suicidios o actitud negativa comprobable.\n\nAhora, ¿Te das cuenta que el elo no importa absolutamente nada para poder hablar? Seguiremos siendo plata/bronce, pero evidentemente sabemos más que vos de este tema.\n\nEs más, ni siquiera vi tu elo, pero si fuese por lo que sabes de esto, te diría que sos hierro IV. Deberías estudiar más las reglas y profundizarte en el tema.\n\nSaludos.\n\nPD/ LTA. En otro post te explico qué significa eso. ;)","replies":[]}]}]}]},{"poster":"Chancleta Veloz","date":"2019-08-02T07:21:41.119+0000","up_votes":2,"down_votes":2,"body":"Queremos que vuelva \"el tribunal\"\n\nSí Riot no quiere o no puede suministrar un equipo que evalúe conductas de jugadores de forma satisfactoria, al menos dennos a nosotros la herramienta para poder llevar a cabo la limpieza que esté juego necesita. \n\nQué vuelva el tribunal!","replies":[{"poster":"DiosiTo B","date":"2019-08-02T23:00:22.492+0000","up_votes":1,"down_votes":0,"body":"No, ojala no vuelva no lo digo por mi conveniencia ni nada ya que yo tengo buen historial y no soy toxico pero, cuando eso estaba habían algunas injusticias","replies":[]}]},{"poster":"One Fox","date":"2019-08-02T21:01:39.189+0000","up_votes":1,"down_votes":0,"body":"Las sanciones sí existen, pero por lo general se limitan a un ban chat por \"**x**\" cantidad de partidas (en el caso de abuso textual y varia según la reincidencia llegando hasta el ban permanente). Posiblemente sea eso lo que se limitaron a hacer en el caso del loco al que reportaste. ¿Por qué? El mismo soporte lo dice cuando mandas un ticket, si bien saben que hay trolls, feeders y demás \"prefieren enfocarse en el abuso verbal\", es más fácil de probar (viendo el historial del chat) y pueden poner a un bot (que de hecho es lo que hacen) para que te sancione en el caso de hacer uso de las palabras que el bot considere ofensivas. \nEn resumen, no quieren gastar en poner gente para controlar el resto de los problemas (genera gasto de $$$ y tiempo) ni les interesa, porque se les iría mitad de comunidad de ser así.","replies":[]},{"poster":"Venganza","date":"2019-08-02T17:48:59.840+0000","up_votes":1,"down_votes":0,"body":"suban este post para que den una explicacion y que porfavor trabajen para mejorar la comunidad toxica en la que estamos, porfavor suban el post !!!!\n\nUP!!!!!","replies":[]},{"poster":"AIessa Gillespie","date":"2019-08-02T06:16:54.394+0000","up_votes":1,"down_votes":0,"body":"Al primero que entre con la idea de \"PERO ES UN BOT NO ES UN RIOTER\" yo les doy mi experiencia\n\nHace 3 años un tipo me flameo de una manera impresionante, osea imagina lo impresionante que me flameo que quede tipo \"wow\"\n\nNo puedo citar las cosas que me dijo pero uso una linda mezcla entre las palabras **\"suicidate\" \"matate\" \"mata\" \"familia\"** entre otras cosas increíblemente graves que tiro a alguien que posta que no le dijo nada \n\nFue tal el flameo que lo reporte y despues lo reporte al foro, explique todo esto y le sume diciendo **\"HAY GENTE CON DEPRESIÓN JUGANDO ESTO, GOSU ERA UN EJEMPLO Y ES UN PELIGRO QUE ALGUIEN TE DIGA MATATE BASURA\"**\n\nSaben lo que paso? **lo agregue al tipo solo para preguntarle si lo banearon y dijo que no cagandose de risa**\n\nOtra vez con riot a contarle \"COMO PUEDE SER QUE UN FLAMER DE ESTE CALIBRE ANDE SUELTO Y USTEDES A PESAR DE VERLO NO LO HAYAN BANEADO\" \n\ny no lo banearon...","replies":[{"poster":"Del0reaN","date":"2019-08-02T10:28:30.965+0000","up_votes":1,"down_votes":0,"body":"Y a mí por decir \"carajo\" me pusieron restricción de chat. Hace mucho tiempo fue. Después de eso me re cuido con el chat. De hecho, ahora lo tengo desactivado a ambos.","replies":[]}]},{"poster":"HocusPocus666","date":"2019-08-02T09:20:10.386+0000","up_votes":1,"down_votes":0,"body":"Hoy entre a este juego, hacia mucho la verdad no lo hacia por que la gente solo lo usa par insultar, trollear y molestar a toda hora, el usuario Shadow200504 insulto y troleo una partida, diciendo cosas como (BRONCE DE M....., NO SABES JUGAR, HIJO DE P...) VARIAS COSAS OFENSIVAS HACIA MI PERSONA, DE SEGURO ES 1 NIÑO QUE MOLESTA A LOS DEMAS. EXIGO QUE BLOQUEEN DE MANERA PERMANENTE AL USUARIO \"ShaDoW200504\", ahora veo una penalizacion en mi usuario, siendo el y su amigo quienes me insultaron y molestaron, tanto asi que respondi en todo mi derecho para defenderme, exigo que se penalize a esta persona y que no vuelva a jugar mas, de lo contrario me vere obligado a ir a defenza al consumidor y presentar una queja antes riot games, hablare con mis abogados a ver que procedimiento se puede tomar en estos casos, cada vez que entro a jugar LOL, es lo mismo resivo insultos y desgracias, PIDO AL RESPONSABLE MAYOR DE RIOT GAMES QUE TOME CARTAS EN EL ASUNTO POR QUE ESTO YA NO DA MAS, espero su respuesta de lo contrario me vere obligado a tomar acciones muy drasticas contra su empresa y el, por daños psicologicos y emocionales hacia mi persona, injusticias y demas, espero su respuesta prontamente, saludos. aqui los usuarios (ShaDoW200504 - Shoudo - DarkNess Zekrom - Nazza JM).","replies":[{"poster":"Del0reaN","date":"2019-08-02T10:26:35.689+0000","up_votes":1,"down_votes":0,"body":"Yo te aconsejo que desactives el chat aliado y rival. Es la solución a todos los problemas.","replies":[]}]},{"poster":"Alba Meira","date":"2019-08-02T10:15:57.965+0000","up_votes":1,"down_votes":0,"body":"Y se dieron cuenta que ninguno sale a refutar nada?","replies":[]},{"poster":"Elysium GP","date":"2019-08-02T03:39:27.550+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"CupcakeDeManteca","date":"2019-08-02T06:47:05.126+0000","up_votes":1,"down_votes":0,"body":"x2 tan falsos no son los avisos de reporte porque a mi me banearon 14 dias xd","replies":[]}]},{"poster":"PússySlap","date":"2019-08-02T04:52:07.453+0000","up_votes":1,"down_votes":0,"body":"https://plantillasdememes.com/img/plantillas/primera-vez3.png","replies":[]},{"poster":"Doxys","date":"2019-08-02T02:44:44.081+0000","up_votes":1,"down_votes":0,"body":"Si es verdad es una mierda.\n\nPd: me parece re verga que por trolear sancionen poco pero si no podes entrar a partidaS por su mierda de servidodres (mi internet anda correcto) pum baja cola de una o tambien dan mas castigos por flamear cuando no es para tanto.","replies":[]},{"poster":"Bullett","date":"2019-08-02T01:36:15.884+0000","up_votes":1,"down_votes":0,"body":"Amigo, perdón por aclararte el tema, pero si deben haberlo sancionado, las sanciones incluyen las \"Restricciones de  chat\", lo que significa que podía jugar, pero estaba con restricción de chat, esa es de las primeras sanciones aplicadas a los jugadores y no parten inmediatamente con baneos temporales o permanentes, esas son las ultimas consecuencias para jugadores que reiteran su comportamiento","replies":[]},{"poster":"Ornn lover","date":"2019-08-02T00:30:16.873+0000","up_votes":1,"down_votes":0,"body":"Hace mucho que las herramientas de reportes, tanto del juego como del soporte están funcionando de manera insatisfactoria, pueden terminar 3/21 véase foto. http://prntscr.com/on86yb  insultando durante toda la partida, dando kills de manera intencional y a la hora de reportar, este jugador NO RECIBIÓ SANCIÓN ALGUNA. lo cual hace perder confianza contra los sistemas de reportes, tampoco iba conseguir grandes avances quejándome en el soporte, dado que seras respondido por un bot (Saludos, humano, soy Bot Blitzcrank.) quien te dice cuantos reportes haces durante tus ultimas partidas; la opción pedir un humano te responderá un rioter que NO LEE lo que le escribes, solo seras respondido por un conjunto de copy paste. Frente estos acontecimientos me encuentro bastante disgustado con los rioters de LATAM, dado que no es un problema exclusivamente de LAS, sino que también de LAN, en cambio las regiones como NA y EUW tienen hasta el momento sus sistemas mas acorde a las sanciones de los diversos jugadores antideportivos.\n\n Lo que comenta __DonMisterMen __ cobra bastante asevero; a pesar que es una acusación muy grave, pero es necesario que se hable de esto, muchas veces sentimos la discordia e impotencia de jugadores que te trolean con total impunidad sin recibir alguna sanción, y que estos mismo se jacten de saber que los sistemas no funcionan. Más aun cuando no tienes apoyo de los rioter, el ultimo que me respondio me dejo con la sensación de deja de molestar:\n\n\"Comprendo lo que comentas y te agradecemos el tiempo que te has tomado para notificarnos acerca de esto último pues nos ayuda a saber que y como debemos de mejorar en el apartado de correctivos a jugadores por este tipo de acciones.\n\nTe mando un cordial saludo\"\n\nMientras que el troll no recibió sanciones algunas, lo que me dejo con un amargo sabor de impotencia, esto es algo que repite todos los dias desde diamante a hierro, pero muchas veces va mas allá de una mala partida, lo hacen de forma intencional. dudo que las condiciones que nos estamos enfrentando cambien mucho, pero al menos tengamos un respaldo de que reciban alguna sanción {{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"Alba Meira","date":"2019-08-01T19:04:05.948+0000","up_votes":1,"down_votes":0,"body":"Y esperas que estos jurios trabajen? copy paste y listo","replies":[]},{"poster":"DrumSki","date":"2019-08-01T16:45:36.876+0000","up_votes":1,"down_votes":0,"body":"Yo creo que los reportes no se hacen al poco tiempo, pienso que tardan más rn dar sanción. Porque no suelo reportar gemte de seguido, y cuando lo hago tarda mucho en llegarme el cartelito del reporte. Quiza eso que te llega es de mucho antes","replies":[]},{"poster":"SenpaiDeathx","date":"2019-08-01T16:34:15.819+0000","up_votes":1,"down_votes":0,"body":"De que si banean, banean. Si no, no habrian crypost de gente alegando que les metieron el perma ban. Me ha llegado muchas veces esa notificacion, hace dos dias un tipo se puso trollear en soloQ ( Si gustas revisas en el historial, donde fui Ezreal 9/3/11, el troll garen ) una partida que se podia ganar pero el tipo siguia con su actitud troll y que demas varios del team enemigo dijeron que lo reportarian. Y ahi lo ves sigue jugando  y por lo que vi cada vez que el tipo se tiltea trollea.","replies":[]},{"poster":"WUACHiiN","date":"2019-08-01T14:01:42.321+0000","up_votes":1,"down_votes":0,"body":"muchas coimas","replies":[]},{"poster":"TheKiller Justin","date":"2019-08-01T13:51:05.929+0000","up_votes":1,"down_votes":0,"body":"Como me gustaría que aunque sean falsas me salten esas notificaciones a mí, al menos tendría la certeza de que el reporte fué a algún lado\n{{sticker:zombie-nunu-bummed}}","replies":[]},{"poster":"Viro Q","date":"2019-08-01T13:04:34.214+0000","up_votes":1,"down_votes":0,"body":"Un desastre...","replies":[]},{"poster":"LeyendaRankeQ","date":"2019-08-01T04:41:22.818+0000","up_votes":1,"down_votes":0,"body":"Si es verdad yo reporte a un jugador que me flameo hasta la muerte y dos o tres le siguieron pero jamas me llego un cartelito de la sancion. Y uno que en ranke se dejaba matar tampoco recibio la sancion. Esta muy olvidada las. Si la comunidad es toxica que no lo defiendo es por los que la manejan. Como dice el dicho la culpa no es del chancho es el de que le da de comer.Que sean Toxicos solo lleva a que los jugadores se desconcentren etc trolls etc. Ojala desactiven el chat aca quizas mejore bastante. Deberia hacer algo Riot pero bueno mientras tanto siguen sacando Skin legendarias prestigiosas que es lo mas importante.","replies":[]},{"poster":"lordeman10","date":"2019-08-01T02:22:46.498+0000","up_votes":1,"down_votes":0,"body":"respecto a tu caso personal por ahí tenés razón, o por ahi simplemente se corrió alguna rueda de bans ahora y cayeron reportes que habías hecho antes, coincidiendo casualmente con lo del que reportaste la verdad no estoy interiorizado pero no me consta que el cartel sea falso sino aparecería más seguido yo soy de reportar bastante y nunca me salen, como te digo no descarto que tengas razon pero siguiendo tu lógica no me parece suficiente para confirmar el hecho\n\nrespecto a los ban son reales, los que vivimos acá en el foro vemos a menudo jugadores quejandose por haber sido baneados injustamente ( suelen empezar con algo como \"yo insulté, trolie y me fui afk pero..\" ) con lo que se ve claramente que el sistema si funciona","replies":[]}]}