{"poster":"Oblio rank","date":"2019-12-03T23:40:23.021+0000","title":"Se non hai l'honor 2 non puoi manco andare a votare","subforum":"Discussioni generali","up_votes":6,"down_votes":5,"body":"Salve ragazzi,\nvolevo portare alla luce un fatto riguardante il livello dell onore che mi ha lasciato veramente esterrefatto.\nDopo essere arrivato finalmente all'honor 5 mi ritrovo a giocare contro delle persone non molto simpatiche, a tratti disumane.\nNon sto qui a spiegarvi la storia visto che tanto a nessuno frega niente, e so di avere torto (manco per il casso) per aver risposto, e quindi ho accettato di buon grado le 10 partite di chat ristretta; fin qui tutto bene, ma ad un certo punto mi accorgo che il mio honor 5, sudato in mesi e mesi di sopportazione (non esagero) è sceso al livello 1 (pure bloccato per 1 settimana). Non so se a voi questa cosa sembra normale anche perchè date le tempistiche,  nonostante le molte partite giocate mi era praticamente impossibile raggiungere almeno l'honor 2 per le ricompense.\nAggiungo che oltre alle ricompense mi viene negata la possibilità di acquistare le nuove magliette, non fondamentali per la mia sopravvivenza, ma a questo punto mi sento quasi discriminato per aver flammato (che poi flammato vabbeh) in 1 partita (questo riportava l'avviso delle chat ristrette, nulla di inventato, una sola partita, niente insulti razzisti, omofobi ecc..).\nVorrei conoscere anche il vostro pensiero, e se sapevate già di questa cosa.","replies":[{"poster":"KÐβ Śarah Iημ","date":"2019-12-04T02:25:19.387+0000","up_votes":3,"down_votes":2,"body":"Mah io in 7 anni ho ricevuto una chat ristretta per spam (in sostanza invece che scrivere le frasi, inviavo ad ogni parola) senza alcun flame, ed il mio honor è rimasto un lucente honor 5. Quindi caro mio, se sei stato droppato ad addirittura Honor 1 ci deve essere una ragione ben specifica. \n\nIl sistema di cui hai appena parlato deve essere estremamente restrittivo proprio per cercare di counterare la estrema tossicità della community. Se quindi non vieni flammato da 8 persone su 10 ma semplicemente da 4 su 10, è grazie al fatto che la gente ha effettivamente paura di subire le pesantissime punizioni che la riot dà. \n\nQuindi stanne contento.\nLa storia non ci interessa ed hai ragione (dio mio grazie che finalmente qualcuno lo ha capito), ma ci interessa il chat log, in particolare le cose che hai scritto.","replies":[{"poster":"sbepi","date":"2019-12-04T11:48:01.918+0000","up_votes":1,"down_votes":0,"body":"> Mah io in 7 anni ho ricevuto una chat ristretta per spam (in sostanza invece che scrivere le frasi, inviavo ad ogni parola) senza alcun flame, ed il mio honor è rimasto un lucente honor 5. Quindi caro mio, se sei stato droppato ad addirittura Honor 1 ci deve essere una ragione ben specifica.\n\nsi tratta di un bug ^^, sei esattamente tale e quale a lui, solo hai avuto la fortuna di non droppare honor 1 bloccato semplicemente per un bug. se non mi credi chiedi pure a chi di competenza (supporto giocatori); non riceverai punizioni nemmeno se lo fai notare, in quanto è un bug e il supporto giocatori non può modificare l'honor dei player (nemmeno in caso di errato giudizio da parte dei bot)\n\n1 chat ristretta=honor 1 locked\n2 chat ristrette=honor 0 locked\n3-4-5-6-7-8-etc chat ristrette=honor 0 locked","replies":[]}]},{"poster":"1NG Faabier","date":"2019-12-04T11:05:02.160+0000","up_votes":1,"down_votes":1,"body":"Per quello che mi riguarda è una cacata, se flammi ed è necessario restringerti la chat è giusto che ti pre da una puniziine ok ma deve anche essere preso in considerazione quante volte lo fai, finire in honor1  è una punizione troppo esagerata,. Tutti possono avere una giornata no e mi sembra ingiusto essere paragonati a chi flamma per sport. A parte questo mi piacerebbe poter giocare solo con persone con honor 2+, a mio modesto parere chi lo ha più basso si merita una coda tutta sua che lo fa giocare con altri troll, flammoni ecc","replies":[{"poster":"Bertrand Paradox","date":"2019-12-09T12:53:08.536+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=1NG Faabier,realm=EUW,application-id=MJVj50Jw,discussion-id=Fen7WWcc,comment-id=0004,timestamp=2019-12-04T11:05:02.160+0000)\n>\n> Tutti possono avere una giornata no  \n\n\nMa questo non giustifica il far diventare la giornata una giornata \"no\" anche ad altre persone. È un gioco con esseri umani, non con robot, gli esseri umani sbagliano. E quando sbagliano pagano per i loro errori. Non ci trovo nulla di sbagliato","replies":[{"poster":"1NG Faabier","date":"2019-12-09T20:54:53.325+0000","up_votes":1,"down_votes":0,"body":"per avere ragione hai ragione,una punizione se la meritava anche ma bisogna guardare il contesto,se è sempre stata una persona sportiva e corretta, avrebbero dovuto solo dargli un piccolo avviso almeno,magari diminuendo di un onore","replies":[]}]},{"poster":"sbepi","date":"2019-12-04T11:37:11.837+0000","up_votes":2,"down_votes":1,"body":"il problema è questo: il sistema di ban e di conseguenza di honor non funziona correttamente\n\nquello che scrivi sarebbe applicabile nel momento in cui migliorano il sistema di ban. conosco degli scaricatori di porto che anche se honor 5 (quindi dei santi agli occhi della riot games) hanno flammato di continuo senza venir mai puniti. ad una certa senza giri di chat ristretta od altro prima ban di 14 giorni e poi perma ban nel giro di 2 mesi....i mean, non tutti gli honor 5 sono migliori degli honor 0 finchè il sistema rimane quello attuale","replies":[]}]},{"poster":"Gatto Bipolare","date":"2019-12-04T10:12:26.905+0000","up_votes":1,"down_votes":0,"body":"Ma secondo me, non sono nemmeno tanto severe, chi flamma, trolla o va afk apposta merita molto di più di ciò.\nPerò la riot ha bisogno di guadagnare e quindi non può bannare chiunque di questi player","replies":[{"poster":"Sakrem","date":"2019-12-04T10:32:27.990+0000","up_votes":2,"down_votes":1,"body":"Parlo da totale ignorante sul completo funzionamento del sistema di report ideato dalla Riot, ma credo che il loro reale problema sia veramente la capacità di assicurarsi la gravità della situazione in un determinato contesto.\nEs, tizio X è andato AFK:\n1) ragequit\n2) troll\n3) crash (magari in modo persistente fino alla fine del match a causa di un \"temporaneo\" blackout)\n4) qualsiasi problema legato al PC (freeze, bsod o altro)\necc...\n\nIl discorso del guadagno è puramente utopico, in quanto delle sanzioni più severe porterebbero irrimediabilmente i giocatori a calmarsi. Certo, servirebbero comunque delle \"vittime\", dei capri espiatori, ma un centinaio di giocatori in più bannati, non creerebbero alcun problema ai fondi della Riot. Ma vuoi mettere 100 permaban (pubblicati) tutti in un solo mese? Persino il giocatore più tossico diventerebbe una suora all'istante XD.","replies":[]}]},{"poster":"Elle C","date":"2019-12-04T01:54:47.751+0000","up_votes":2,"down_votes":6,"body":"la riot fa %%%%% il sistema di honor è una %%%%%%%%% e dovrebbero sotterrarsi tutti quelli che hanno contribuito a questo sistema di punizioni da ritardati dove chi flamma perche sta tryhardando e ci mette tutto se stesso per vincere viene punito mentre chi trolla e se la gode perche non gliene frega nulla viene premiato con honor 5. ma non statemi a sentire questa è solo una mera opinione dell intero globo.","replies":[{"poster":"Bertrand Paradox","date":"2019-12-09T12:57:55.559+0000","up_votes":2,"down_votes":2,"body":"Avere un'opinione aggressiva su qualcosa non ti sottrae al dover esprimerla in modo comprensibile. Usare le virgole sarebbe un ottimo modo per non farti sembrare una capra agli occhi di chi legge.","replies":[{"poster":"Elle C","date":"2019-12-11T00:03:59.524+0000","up_votes":1,"down_votes":0,"body":"non siamo a scuola ne a lavoro ne sto scrivendo un curriculum vitae se hai bisogno della punteggiatura per comprendere il senso del messaggio mi dispiace","replies":[]}]}]},{"poster":"V3LK0ZMAST3R","date":"2019-12-04T18:09:11.334+0000","up_votes":2,"down_votes":2,"body":"Il sistema di Honor é una pagliacciata, sia per quanto riguarda il funzionamento sia per i premi che da. Avere Honor 1 o Honor 5 non fa praticamente alcuna differenza, unica nota dolente ti serve almeno il 2 per il Clash.\nPerò che io ricordi per una chat ristretta si dovrebbe perdere solo un livello di honor","replies":[{"poster":"BMikeee","date":"2019-12-04T18:22:11.471+0000","up_votes":1,"down_votes":0,"body":"Ricordi male, l'honor viene resettato fino a 1.","replies":[]}]},{"poster":"MidZombi92","date":"2019-12-04T01:26:21.498+0000","up_votes":2,"down_votes":2,"body":"Te lo sei meritato. Magari il sistema di ban funzionasse per tutti.\nIo aggiungerei anche un sistema di ban/anti-ban del tipo, se tu reporti una persona, quel report viene analizzato non solo sulla persona reportata, ma anche su te stesso di modo che, se anche tu hai flammato anche tu che reporti vieni punito, cosi facendo, non ci sarebbero report \"a gratis\" proprio perche la gente avrebbe paura(quelli che offendono e poi reportano gli altri), mentre quello onesto non avrebbe alcun timore di reportare e di far analizzare la sua di chat e la chat del reportato. Un sistema di report a doppiotaglio, questo sarebbe ottimo.","replies":[{"poster":"sbepi","date":"2019-12-04T11:34:16.353+0000","up_votes":1,"down_votes":0,"body":"se tu reporti un player viene analizzata la chat del game in questione. tradotto: se tu hai flammato in quel game, la chat è sempre quella, i messaggi vengono visionati","replies":[]},{"poster":"XPY99","date":"2019-12-04T11:06:06.949+0000","up_votes":1,"down_votes":0,"body":"In parte è già così, la chat viene analizzata interamente, poi vengono presi provvedimenti solo se trovano uno di quei messaggi da ban immediato , così come se ad una partita ti reportano in 9 al fine di punizioni e simili ne viene contato solo 1,","replies":[]}]}]}