{"poster":"A Dragons Heart","date":"2016-03-27T08:29:27.258+0000","title":"Was reicht für eine Bestrafung aus ?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":2,"body":"Heyho, ich wollte mal nachfragen, was wirklich f&uuml;r eine Bestrafung ausreicht bzw. was bei einem einmaligen Ausrutscher passiert.\r\n\r\nAlso, wenn ein Spieler zum Beispiel keine &quot;harten&quot; Beleidigungen etc. von sich gibt, sondern immer mal wieder &quot;noob Team!&quot;, &quot;u so bad!&quot; oder &quot;surr @20&quot;. Reicht das schon f&uuml;r eine Bestrafung aus ?\r\n\r\nUnd was, wenn ein Spieler nur einmal toxisch ist, d. h. er ist sonst brav aber schreibt in einem Spiel aus irgendeinem Grund soetwas wie &quot;fuck you all&quot;, &quot;worst Player euw&quot; etc. Wird er dann direkt bestraft ? Und was passiert mit dem Report-Rating der Spieler die ihn reportet haben, wenn nicht?\r\n\r\nMfG","replies":[{"poster":"Humpelstilzche","date":"2016-03-27T08:43:20.321+0000","up_votes":5,"down_votes":0,"body":"> Also, wenn ein Spieler zum Beispiel keine \"harten\" Beleidigungen etc. von sich gibt, sondern immer mal wieder \"noob Team!\", \"u so bad!\" oder \"surr @20\". Reicht das schon für eine Bestrafung aus ?\n\nDefinitiv, ja. Was eine \"harte Beleidigung\" ist, ist Ansichtssache und im Prinzip auch zweitranging. Es geht bei diesen Strafen ja nicht darum, bestimmte Wörter zu bestrafen, sondern ein bestimmtes Verhalten. Und das Verhalten das hier problematisch ist zum einen das Beleidigen anderer Mitspieler und zum anderen der große Bereich \"unsportliches Verhalten\". Welche Worte verwendet werden um diese Art von Verhalten auszudrücken, ist weitestgehend irrelevant. Man kann sich auch wie ein Arsch verhalten, ohne ein einziges \"böses Wort\" zu verwenden. \n\n> Und was, wenn ein Spieler nur einmal toxisch ist, d. h. er ist sonst brav aber schreibt in einem Spiel aus irgendeinem Grund soetwas wie \"fuck you all\", \"worst Player euw\" etc. Wird er dann direkt bestraft ?\n\nIst nicht ausgeschlossen, ja. Gibt natürlich immer viele Faktoren die da reinspielen: Was genau hat er geschrieben? Mit welcher Frequenz? Wer hat ihn reportet? Wie ist seine Vorgeschichte? \nAber im großen und ganzen kann man schon sagen, dass auch ein einzelner Ausrutscher, wenn er nur groß genug ist, zu einer Strafe führen kann. \n\n> Und was passiert mit dem Report-Rating der Spieler die ihn reportet haben, wenn nicht?\n\nNichts. Zumindest nichts wichtiges. Die Formel mit der sich das Report-Rating reduziert ist so gestaltet, dass wirklich nur Leute ihr Rating verlieren, die diese Funktion regelmäßig missbrauchen. So lange du nur Sachen reportest die du persönlich als schlechtes Sozialverhalten ansiehst, hast du absolut nichts zu befürchten, selbst wenn viele deiner Reports nicht direkt zu Strafen führen.","replies":[{"poster":"A Dragons Heart","date":"2016-03-27T09:50:02.952+0000","up_votes":1,"down_votes":0,"body":"Also wenn einer nur einmal \"surrender pls, game dont make sense anymore\" schreibt und ich ihn deswegen reporte wird er nicht unbedingt bestraft, es wird aber gespeichert, dass ich ihn für das reportet habe aber mein Rating geht nicht runter?","replies":[{"poster":"Humpelstilzche","date":"2016-03-27T09:53:16.762+0000","up_votes":2,"down_votes":0,"body":"Ich denke das kann man so sagen, ja.","replies":[{"poster":"A Dragons Heart","date":"2016-03-27T09:55:23.188+0000","up_votes":1,"down_votes":0,"body":"Hmmm... ich frage mich dann, warum der ein oder andere Freund noch keine Strafe bekommen hat...","replies":[{"poster":"Sirrkas","date":"2016-03-27T11:39:27.566+0000","up_votes":2,"down_votes":0,"body":"Das kann viele Gründe haben. Vielleicht wurde das Verhalten vom System noch nicht als negativ genug angesehen. Es kann gut sein, dass Spieler, die nur alle 10 bis 20 Spiele mal ein paar \"noobs\" und \"useless\" von sich geben dafür nicht bestraft werden. Vielleicht weil sie niemand dafür gemeldet hat. Für manche ist das vielleicht nicht schlimm genug, um einen Report abzuschicken und andere vergessen die einzelne Beleidigung bis zum Spielende. Oder die einzelnen Vergehen befinden sich noch unter dem Schwellwert für eine Bestrafung. Da kann leider keiner genau sagen, was bei einem einzelnen der Fall ist.","replies":[{"poster":"A Dragons Heart","date":"2016-03-27T11:42:14.649+0000","up_votes":1,"down_votes":0,"body":"Es ist schon ein bisschen  heftiger ^^","replies":[{"poster":"Sirrkas","date":"2016-03-27T12:06:40.657+0000","up_votes":1,"down_votes":0,"body":"Kann trotzdem sein, dass sie Glück haben und sie keiner meldet.","replies":[{"poster":"A Dragons Heart","date":"2016-03-27T12:19:38.732+0000","up_votes":1,"down_votes":0,"body":"Ich ^^","replies":[{"poster":"FrankerX","date":"2016-03-28T03:45:38.573+0000","up_votes":1,"down_votes":3,"body":"dann bist du aber kein guter freund.","replies":[{"poster":"A Dragons Heart","date":"2016-03-28T08:49:35.294+0000","up_votes":4,"down_votes":0,"body":"Warum ich? ^^ Bin ich derjenige der sich nicht beherrschen kann ? Sag bloß du würdest deinen Kumpel schützen, wenn er andere Leute angreift, nur weil er dein Freund ist ?!","replies":[]}]},{"poster":"eingew","date":"2016-03-28T05:57:25.158+0000","up_votes":2,"down_votes":0,"body":"In einem Premadeteam?\nSolche Reports werden weniger stark gewertet. Du bist quasi zu befangen, damit das System dich genauer beachtet. \n\nIch kenne auch so einen, der ständig abfuckt in seinen Spielen. Bei dem hat es auch gedauert. Aber er hat seine Strafe bekommen. Ich bin mir sicher, dass es bei dir genau so läuft.","replies":[{"poster":"A Dragons Heart","date":"2016-03-28T08:47:59.807+0000","up_votes":1,"down_votes":0,"body":"Achso, ich dachte ein einzelner Report würde schon ausreichen um eine Chatlog-Analyse zu starten.","replies":[{"poster":"Sirrkas","date":"2016-03-28T11:28:41.849+0000","up_votes":2,"down_votes":0,"body":"Ich glaube immer wieder vom selben Spieler gemeldet zu werden, wird niedriger bewertet. Bei Ehrungen ist es ja ähnlich, der Zähler geht zwar hoch, die Wertung ändert sich aber nicht nennenswert. Es kann durchaus sein, dass solche Meldungen niedrigere Gewichtung haben.","replies":[{"poster":"A Dragons Heart","date":"2016-03-28T11:32:51.302+0000","up_votes":1,"down_votes":0,"body":"Ah ok... ^^ Danke für die Hilfe","replies":[]}]},{"poster":"eingew","date":"2016-03-28T09:26:05.490+0000","up_votes":1,"down_votes":0,"body":"So einfach ist es dann leider doch nicht. Ein bisschen mehr ist schon nötig.","replies":[{"poster":"A Dragons Heart","date":"2016-03-28T10:41:12.176+0000","up_votes":1,"down_votes":0,"body":"Achso... Danke für die Auskunft ^^","replies":[]}]}]}]}]}]}]}]}]},{"poster":"A Dragons Heart","date":"2016-03-27T09:55:49.424+0000","up_votes":1,"down_votes":0,"body":"Aber erstmal danke für die Antworten :))","replies":[]}]}]}]},{"poster":"Untouchable ProX","date":"2016-03-27T11:16:29.879+0000","up_votes":2,"down_votes":0,"body":"Dies ist immer so eine Sache.\nBei harten ''Beleidigungen'' die auch schon an Hetzreden rankommen, reichen auch einmalige Vergehen (soweit meine Infos).\nWenn jedoch nur kleinere Delikte vorliegen und man 1-2 ''Noob'' oder so schreibt, passiert in der Regel nichts. (Wobei das System natürlich eigen arbeitet).\nAber es muss nicht immer nur das sein was du schreibst. Das System erkennt auch andere Faktoren oder auch Ironie.\nKannst ja mal die Leute fragen die hier täglich über ihren Perma-Banns diskutieren, was diese geschrieben haben und warum sie unschuldig sein. :P","replies":[]},{"poster":"Lagbeard","date":"2016-03-27T08:35:03.888+0000","up_votes":2,"down_votes":0,"body":"Wenn dir ein _einmaliger_ Ausrutscher passiert, passiert dir meist nichts. Aber in der Wiederholung reicht ein \"noob Team\" durchaus, um sich Strafen einzuhandeln. \n\nReport Rating ist keine wirkliche Punktzahl die man hat, es ist eher ein Stufensystem. Wer oft falsch reportet wird herabgesetzt. Wie oft man wen wie falsch reporten kann ist nicht bekannt. Ich nehme an, dass du deine Priorität behälst, wenn dein Report gerechtfertigt war, aber nicht für eine Bestrafung ausgereicht hat.","replies":[]},{"poster":"Baickie","date":"2016-03-27T09:21:14.868+0000","up_votes":2,"down_votes":1,"body":"Also ich hab 3 Games am Stück auf dem cleanen Acc hier geflamed und hab dann 10 Games Chatsperre bekommen so als kleinen Indikator für dich, habe aber auch etwas \"kritischere\" Sachen hingegen meiner Mitspieler geschrieben.","replies":[]}]}