{"poster":"A Dragons Heart","date":"2015-08-31T11:35:17.625+0000","title":"Garens Probleme","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Hey,\r\nich wollte heute mal &uuml;ber Garens Probleme reden. \r\n\r\nWie ihr sicherlich mitbekommen habt, hat er in diesem Patch (5.16) eine Aktualisierung erfahren.\r\nWas haltet ihr von der Aktualisierung ? Hat sie ihn geschw&auml;cht oder st&auml;rker gemacht ? Und glaubt ihr, dass seine Probleme dadurch behandelt worden sind?\r\n\r\nMeiner Meinung nach, hat er die gleichen Probleme wie vorher, sprich : Kein Dash/Gapcloser, au&szlig;er seinem Q fehlende Mobilit&auml;t und dementsprechend kitebar.\r\n\r\nJetzt habe ich neulich auch noch gesehen, dass auf dem PBE &Auml;nderungen vorhanden sind, nach denen Garens Basis-Lauftempo sowie das zus&auml;tzliche Lauftempo durch sein Q verringert werden.\r\n\r\nIn meinen Augen geht Riot Games hier viel zu weit, nehmen Garen beinahe jede Chance an den Gegner heranzukommen und verschlimmern seine Probleme eher, als sie zu beheben.\r\n\r\n**Mir ist klar, dass &Auml;nderungen, die auf dem PBE nicht zwingend &uuml;bernommen werden m&uuml;ssen, allerdings alarmiert es mich.**\r\n\r\nWas denkt ihr dar&uuml;ber ? W&uuml;rde mich &uuml;ber eine kleine Diskussionsrunde freuen!\r\n\r\nMfG","replies":[{"poster":"Awecoolsome","date":"2015-08-31T15:36:14.983+0000","up_votes":1,"down_votes":2,"body":"Garen nerfs kommen im nächsten Patch. Unter anderem wird seine Mobilität generft.","replies":[{"poster":"A Dragons Heart","date":"2015-09-01T13:36:50.874+0000","up_votes":1,"down_votes":0,"body":"1. Sind das nur Änderungen auf dem PBE, sprich, es ist kein Muss, dass es kommt.\n2. Weiß ich das schon und habe auch oben darüber geschrieben.","replies":[]}]},{"poster":"Ashuna","date":"2015-08-31T11:37:24.003+0000","up_votes":1,"down_votes":0,"body":">In meinen Augen geht Riot Games hier viel zu weit, nehmen Garen beinahe jede Chance an den Gegner heranzukommen und verschlimmern seine Probleme eher, als sie zu beheben.\n\nDu musst bedenken das es aber auch keine Lösung ist wenn er auf jemaden zurennt und diese Person dann direkt vernichtet. Ich finde die änderungen schon gut. Mit Boots of Swiftness oder Merc's wird er trotzdem noch sehr nervig sein.\n\nmfg Ashuna {{champion:1}}","replies":[{"poster":"A Dragons Heart","date":"2015-08-31T11:42:01.820+0000","up_votes":1,"down_votes":0,"body":"Das hast du natürlich Recht! Allerdings sollte er überhaupt eine Möglichkeit haben, an andere heranzukommen. Da Laufen im aktuellen Meta sowieso schon ziemlich \"out\" ist, finde ich es nicht gut, ihm auch noch das zu nehmen.\n\nMfG","replies":[{"poster":"Ashuna","date":"2015-08-31T11:43:55.696+0000","up_votes":1,"down_votes":0,"body":"Garen wird seine Fähigkeit nicht verlieren jemanden zu Catchen oder im TF zu focusen. Ich verstehe nicht warum dich das stört das ein viel zu starker Champ einen kleinen nerf bekommt, der kaum etwas ändern wird. Stell dir Garen mit einer Sivir zusammen vor.\n\nmfg Ashuna {{champion:1}}","replies":[{"poster":"A Dragons Heart","date":"2015-08-31T11:49:08.692+0000","up_votes":1,"down_votes":0,"body":"Meiner Meinung nach ist Garen nicht viel stärker als andere Champions. Allerdings stört mich, dass Riot in eine Richtung geht, in der Garen überhaupt keine Mobilität mehr besitzt.\n\nMfG","replies":[{"poster":"OrangeBubble","date":"2015-08-31T14:54:42.588+0000","up_votes":1,"down_votes":0,"body":"Ich hatte keine Probleme gegen Garen, wenn ich Janna gespielt habe. Ansonsten fand ich ihn unglaublich nervtötend.\nEs ist einfach so: Garen ist sau tanky, rennt auf deinen ADC, hat meistens Mercs d.h. cc in Form von Stuns sind lachhaft und killt deinen ADC innerhalb weniger Sekunden ohne selber Schaden zu nehmen. \nIch find's gut, dass er generft wird. Ob MS der richtige Ansatz ist, wird sich zeigen. Am besten erstmal abwarten x)","replies":[{"poster":"A Dragons Heart","date":"2015-09-01T13:26:18.676+0000","up_votes":1,"down_votes":0,"body":"Auch wenn er Mercs hat, hat er, vor allem mit den PBE-Änderungen und Stuns, trotzdem Schwierigkeiten an den gegnerischen ADC zu kommen bzw. an ihm zu bleiben.\nMfG","replies":[]}]}]}]}]}]},{"poster":"Nine Arts Dragon","date":"2015-09-01T11:01:15.354+0000","up_votes":1,"down_votes":0,"body":"garen ulti passive ist zu stark und auf maximale leben des Gegners skaliert sie ja auch noch aber ich finde eine Skalierung von fast 50 % zu stark seine q hätten sie so lassen können ich sehe das Problem eher bei der ulti ich glaube aktuell hat garen eine ziemlich hohe winrate bis Platin da er jede lane mit seine ulti komplett zerstört also ein nerf wäre angebracht und garen ist \"nur die frontline\" die mit der ulti oneshotet im late also würde ich mich nicht beschweren das er genervt wird","replies":[]},{"poster":"Srepy","date":"2015-08-31T12:25:20.564+0000","up_votes":1,"down_votes":0,"body":"garen ist derzeit unglaublich stark im platin/gold bereich ist er derzeit must pick oder must ban habe bisher nur 5 ranked games mit ihm aber mit 100 % win rate , und riot hat das absichtlich gemacht das seine Probleme das er erstmal zum gegner gelangen muss mit absicht nicht angegangen . Aber wenn er erstmal beim Gegner ist kannst du direkt in den all chat GG schreiben egal in welchem Team du bist ;)","replies":[{"poster":"A Dragons Heart","date":"2015-08-31T12:35:36.456+0000","up_votes":1,"down_votes":0,"body":"Ist er so populär ? Ich sehe ich trotz der Aktualisierung nie.\nMfG","replies":[]}]},{"poster":"BronzeNap","date":"2015-08-31T12:13:08.964+0000","up_votes":1,"down_votes":0,"body":"Verstehe deine Sorge mit dem Lauftempo und finde es merkwürdig, da doch gesagt wurde, dass Garen wahrscheinlich weiterhin nichts für die kompetetive Szene ist und damit eigentlich ganz und gar ins Aus geboxt wird? Was den Profi Bereich angeht. Wunder mich nur. Ne eigene Meinung habe ich leider nicht, da ich ihn wenig gesehen habe.^^","replies":[]},{"poster":"Bemte","date":"2015-08-31T11:40:53.187+0000","up_votes":1,"down_votes":0,"body":"Guck mal ein wenig hier im Forum rum. Du wirst genug Posts finden, wo Leute sich beschweren, dass der neue Garen total OP ist, dass er 4k HP, 300 Deff hat und trotzdem jeden zerlegen kann, etc.\nIch persönlich finde den neuen Garen auch sehr nervig, aber da der alte kaum einen Nutzen hatte, sehe ich die Änderung nicht ganz negativ. Zu deiner Grundfrage: ich finde nicht, dass er zu schwach ist, eher zu stark. Vor allem (wie bereits erwähnt) mit den richtigen Boots geht der einem extremst auf den Geist...","replies":[{"poster":"A Dragons Heart","date":"2015-08-31T11:50:14.077+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank für deinen Beitrag :)\nMfG","replies":[]}]},{"poster":"Approxima","date":"2015-08-31T18:54:52.619+0000","up_votes":1,"down_votes":3,"body":"Du willst also einen Garen Buff? LOL. Garen, war und IST einer der OPsten Toplaner, Countert mega viele andere Champ wegen seinem Silence und du willst seine Q buffen? Was soll aus Garen werden? Ein Champ der jeden onehittet?\n\nMeiner Meinung hat Garen mit seinem Rework einen starken Buff erhalten, das betrifft vor allem seine Ult. Eigentlich wäre ich ja mit einer Nerf von Garen eher einverstanden, aber deine Ideen kann ich überhaupt nicht nachvollziehen.","replies":[{"poster":"A Dragons Heart","date":"2015-09-01T13:41:18.609+0000","up_votes":1,"down_votes":1,"body":"Ich habe keine einzige Idee geäußert, noch meinen Wunsch nach Buffs kundgetan.\n\nIch habe lediglich darauf hingewiesen, dass seine Probleme, weswegen er in meinen Augen ( und offensichtlich auch in den Augen der professionellen Spieler ) nicht zu den besten Toplanern gehört, nicht behoben wurden, was ich an sich nicht schlimm finde, da er so ganz gut gebalanced ist, sondern vergrößert wurden und es in Planung steht, sie noch zu vergrößern.\n\nMir ist bewusst, dass man mit diesem Champion vorsichtig umgehen sollte, allerdings geht Riot hier in meinen Augen falsch vor.\n\nBitte lies dir das nächste Mal den Text sorgfältiger durch. Danke.","replies":[]}]}]}