{"poster":"TheLittlestLulu","date":"2016-04-16T08:52:46.270+0000","title":"So I'm guessing chromas have been completely scrapped.","subforum":"Gameplay","up_votes":142,"down_votes":7,"body":"Last chroma pack was 8 months ago.\r\n\r\nGuess it didn&#039;t make them enough money lol.","replies":[{"poster":"disregardable","date":"2016-04-16T08:54:15.918+0000","up_votes":47,"down_votes":0,"body":"It's the way they chose to sell them. People want one color and an altered splash art.","replies":[{"poster":"TheLittlestLulu","date":"2016-04-16T08:58:27.226+0000","up_votes":42,"down_votes":0,"body":"> [{quoted}](name=disregardable,realm=NA,application-id=3ErqAdtq,discussion-id=FeLGEJkI,comment-id=0000,timestamp=2016-04-16T08:54:15.918+0000)\n>\n> It&#x27;s the way they chose to sell them. People want one color and an altered splash art.\n\nThe best part is you don't even get an altered splash art.","replies":[{"poster":"Velzard of Koz","date":"2016-04-16T19:07:33.243+0000","up_votes":13,"down_votes":1,"body":"It would double the prize since they would have to spend 10 more minutes in MS Paint/Photoshop on feature some other games give for free upon playing the character enough. God bless microtransaction policy.","replies":[{"poster":"Elikain","date":"2016-04-16T20:19:24.299+0000","up_votes":4,"down_votes":6,"body":"Except that outside of recoloring a skin (which is easy), they had to (for each recolor) connect the sounds for each skin, animations (+ sounds) and skills (+ sounds). Something about not having defined what a skin object is and this was literally 3x the amount of work (3 skins being made, regardless of how easy was their creation) for something that players simply didn't like.\nPlayers didn't like this because they had no choice of colors and skins to recolor them themselves.\n\nDon't be that guy who jumps on the first opportunity to call them out for being money grabbers. One part of this process was easy, the other part was 3x more work than making a single skin.","replies":[{"poster":"GaleWinUnleashed","date":"2016-04-16T21:08:19.666+0000","up_votes":4,"down_votes":0,"body":"They need to streamline the asset creation process to get Chromas going at a reasonable pace.","replies":[]},{"poster":"Velzard of Koz","date":"2016-04-16T22:21:14.689+0000","up_votes":4,"down_votes":1,"body":"Wait, are you implying they had to somehow edit animations of spells or customize the skin for movement of the figure? Man, nothing changes but color, If Riot is not doing it wrong, they just had to change one image file that holds the look the 3D mesh is folded into, then program the system of color selection and make the system load different image skin file than the original one. At least this is how it works as far as I know. It looks like you think the skin and the 3D model are connected and they had to go through programming of animation of each. If that's the case, that's their poor work.\n\nEDIT: I know they must earn money somehow, but this and RP for one-use random skin in ARAM are two things that as being paid with RP ARE ridiculous money grabbing. It's really just absurd. I laughed the moment I found out chromas will be RP-paid.","replies":[{"poster":"cuddlykitten4","date":"2016-04-17T20:58:55.867+0000","up_votes":2,"down_votes":0,"body":"but this and RP for one-use random skin AND 200 bonus ip post game regardless of victory status with 100 bonus ip to everyone else on your team as well for a total of 600 bonus ip to the team in ARAM..........I fixed that for you","replies":[]},{"poster":"Elikain","date":"2016-04-17T02:24:40.467+0000","up_votes":1,"down_votes":1,"body":"Every skin Riot releases goes through this process. It's not their poor work, it's the client that can't be implemented with new features. So they're stuck doing things the hard way until they roll out the new client.\nSo i guess that they put an RP price on them because of this. What the surveys about chromas tell us are that they were thinking about ink bottles (colors) being purchased for RP or IP and buying a chroma adder for RP (thing that unlocks a color palette for a skin). They also said that not every skin would have this option available but it's still a survey - just one direction that Chromas might go to.\n\nI personally didn't mind them at all, they were pretty decent minimalist skins. That's not a bad thing at all.","replies":[{"poster":"Velzard of Koz","date":"2016-04-17T14:39:56.293+0000","up_votes":2,"down_votes":0,"body":"I still think it is their poor work. If they'd programmed it more generally, they could have avoided that. It was already at High School we were taught in ICT Classes one of seven programming priorities is making the code non-specific and general, so that it can be easily expanded in terms of functions and features.","replies":[{"poster":"Elikain","date":"2016-04-17T15:50:27.645+0000","up_votes":2,"down_votes":1,"body":"You don't seem to grasp the situation.\nThe coding they've done for League is literally 7 years old. It's a base of spaghetti code that won't integrate with new technologies or new code because it's not made for that. Any addition or change they make to it, they have to do patch jobs to the spaghetti, making it a nightmare to even add something or rewrite it.\nIt doesn't matter how general you get, program languages change and new technologies pop up all the time.\nThe point is keeping it all up to date.\n\nAnd you saying that Riot should have planned from the beginning to be this successful and covering all bases from the start is like asking someone to be clairvoyant.\nOn the side note, if you think you're the coding expert they need, you should definitely see it they have job offers.","replies":[]}]}]}]}]}]},{"poster":"Elikain","date":"2016-04-16T20:06:34.261+0000","up_votes":2,"down_votes":0,"body":"Riot already commented on this a couple of months back.\nChromas were easy to make for them but hard to implement. Overall, people were not satisfied with the quality and Riot knew that making a 750 RP tier skin (putting in a bit extra work) is already a better option and decided to do that.\n\nThey did  send out surveys regarding chromas to random players, which we may see resurface when the new client goes live, as a new store feature for players who want a simple recolor.\nI think that there were a few versions of surveys circling around - one was about ink bottles and color palette unlocks for specific skins and buying the palette for small amount of RP to unlock a chroma for that skin. Ink could be purchased for RP or IP.\n\nI'm not against chromas, i own Morgana chroma, and i like Nami and Caitlyn. Both of these are next on my list. All other chromas are decent but i don't play these champions.\n\n##I hope that Riot does return them, i genuinely like what they have to offer.","replies":[{"poster":"It Hertz When IP","date":"2016-04-16T22:46:18.706+0000","up_votes":2,"down_votes":1,"body":"The question was never whether they look good or not, the question was why Riot charged RP for something other MOBAs give away for free, especially considering how little effort is required for them.","replies":[{"poster":"cuddlykitten4","date":"2016-04-17T21:16:39.147+0000","up_votes":1,"down_votes":1,"body":"I could give you a ride for free, but by God if I know you'll pay five bucks for it then I'm charging you five bucks. Who wouldn't? You know, you get discounts for buying economy sized stuff? That means that if you bought the same thing in regular size you pay more per whatever the product is. They can obviously afford cheaper since the economic sizes aren't bankrupting them. They just know you'll pay more so they charge more. How often do you get frustrated at that in a store? I assume you have a job, if your boss came up to you and said, \"Hey, I'm thinking about giving you a raise. There won't be any increase in your work or responsibilities, I'm just gonna pay you more.\" Would you turn him down? I mean, you will be providing the exact same good or service as before so it's greedy if you take that money according to the logic you use. There are other people who do the same job as you who will be providing the same good or service for less pay so you will obviously choose not to have your pay increased above them right? Even if you are the main guy at your job, and all the customers prefer to go to you before they go to your coworkers. You definitely wouldn't want the extra money though right? That would, after all, make you greedy from what I'm understanding here.","replies":[{"poster":"It Hertz When IP","date":"2016-04-17T21:36:35.915+0000","up_votes":1,"down_votes":0,"body":"Amazing. I only wrote a little more than two lines, and still people aren't even reading it. I had to go back and double check that I didn't accidentally write the whole thing in Chinese or something.\n\nJust in case that was a freak accident and you normally do bother to read posts before commenting, I'll reiterate; the problem is how much Riot is charging for Chromas. The fact that there are people who buy them doesn't mean that it's a fair price; if people never bought overpriced items, malls wouldn't exist.","replies":[{"poster":"cuddlykitten4","date":"2016-04-17T23:35:20.209+0000","up_votes":1,"down_votes":0,"body":"Do malls also bother you?","replies":[{"poster":"It Hertz When IP","date":"2016-04-18T00:57:33.157+0000","up_votes":1,"down_votes":0,"body":"Immensely.","replies":[{"poster":"cuddlykitten4","date":"2016-04-18T03:07:23.381+0000","up_votes":2,"down_votes":0,"body":"Obviously there is only one solution then. We must declare war on malls!","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Wyrmblade","date":"2016-04-16T14:43:26.086+0000","up_votes":36,"down_votes":1,"body":"Pay for 3 skins, only get one that you actually want.\n\nFun.","replies":[{"poster":"Aeszarck","date":"2016-04-16T21:25:00.325+0000","up_votes":2,"down_votes":2,"body":"Well, it's 3 skins for 590 RP, or 197 RP per skin.\nEven though Chromas never go on discount, that's still cheaper than a 520 RP skin on sale.\nBecause Chromas are pretty new too, even though they're just recolors, the quality of the recolor might be better than the quality on the 520 RP skin.\n\nI think they're all right, though I've never bought one.","replies":[{"poster":"Hellioning","date":"2016-04-16T23:51:58.274+0000","up_votes":3,"down_votes":0,"body":"Yes, but if you only ever plan on using one skin, even just paying for a 520 skin would be a better use of your money.","replies":[]}]}]},{"poster":"PhantomGG","date":"2016-04-16T09:14:23.568+0000","up_votes":28,"down_votes":1,"body":"It wasn't that bad idea, the problem was how they went about it, it felt so money grubby, literally every youtuber had nothing but negative comments for it, which led for a massive \"fuck chroma\" spam.","replies":[]},{"poster":"Doctor Jarvis","date":"2016-04-16T08:55:12.912+0000","up_votes":13,"down_votes":0,"body":"On the one hand, it seems like a low risk idea; they're literally just recolors. On the other hand, I can count on one hand the number of Chromas I've seen, and if you remove the number of them that were just ME, it comes down to just one. Clearly no one was buying them","replies":[]},{"poster":"Critmaster Garen","date":"2016-04-16T14:58:18.862+0000","up_votes":9,"down_votes":0,"body":"i dont want to buy an entire pack of chromas of which im only using one anyways.\n\nif they had sold single chromas for around 120 rp or so i would have thought about it.\n\nnext problem for me was, that garens chromas dont look that great. they used his base skin for some reason (alterations look rather subtle), when those recolors look a lot better on skins that are focused on a single color.\n\nlike the fizz or zac chromas look actually really good.","replies":[{"poster":"It Hertz When IP","date":"2016-04-16T22:47:34.165+0000","up_votes":2,"down_votes":1,"body":"Isn't Zac's special weapons skin basically a chroma anyway? lol","replies":[{"poster":"Karlyr","date":"2016-04-17T00:25:35.855+0000","up_votes":1,"down_votes":5,"body":"Do you even know what you are talking about ? \n\nHis blobs aren't the same and neither is his model. His particles are als slightly changed.\n\nPlease inform yourself before complaining.","replies":[{"poster":"It Hertz When IP","date":"2016-04-17T01:06:45.817+0000","up_votes":5,"down_votes":1,"body":"http://i.imgur.com/9nohQh4.jpg","replies":[{"poster":"ForeverLaxx","date":"2016-04-17T06:06:49.802+0000","up_votes":2,"down_votes":0,"body":"Don't mind him. He needs giant waving hands, klaxons, and that idiot \"kappa\" nonsense to be able to read jokes and sarcasm on an internet board. Reading comprehension is no longer taught in schools.","replies":[{"poster":"It Hertz When IP","date":"2016-04-17T10:52:07.620+0000","up_votes":1,"down_votes":0,"body":"Do you know how long it's been since I've seen \"klaxon\" used properly in a sentence? I commend your vocabulary, good sir.","replies":[{"poster":"ForeverLaxx","date":"2016-04-18T00:42:17.459+0000","up_votes":2,"down_votes":0,"body":"It's a frequent fallback of mine when I want to express ways other people need an obvious sign to see something that should have been apparent. At least someone other than myself can appreciate it.","replies":[]}]}]}]}]}]}]},{"poster":"Average Bard","date":"2016-04-16T21:07:45.590+0000","up_votes":6,"down_votes":0,"body":"Only chroma that matters is the Pink ZAC... Majin Buu ftw","replies":[{"poster":"Mistress Madoka","date":"2016-04-16T21:59:05.430+0000","up_votes":3,"down_votes":0,"body":"My favourite Zac Chroma is the Blue one. It gives him a set of Goggles, too","replies":[]}]},{"poster":"Athenes Lulu","date":"2016-04-16T19:32:06.646+0000","up_votes":6,"down_votes":0,"body":"It doesn't sell well mainly because of how it was sold.\n\nIf it was for sale for even 10k IP people would actually buy it any day.","replies":[]},{"poster":"Br4ndon","date":"2016-04-16T21:06:40.793+0000","up_votes":5,"down_votes":0,"body":"They were selling packs. No one wants to spend 900rp for 3 recolors when they can get a new skin with a unique recall with that same amount.\n\nThey could work if they just sell individual colors. 300~rp for a recolor seems reasonable but forcing you to spend 900 for 3 when you only want 1 is a turn off.","replies":[]},{"poster":"Arkhan","date":"2016-04-16T21:13:36.210+0000","up_votes":4,"down_votes":0,"body":"I believe they are coming back with a vengeance actually. I received an email survery from Riot Games regarding Color palettes. And how you would purchase certain colors that you want for 100 RP or use IP, what I would like, and if I found the prices fair. \nFrom what I gathered of it, they may be bringing Chromas back, but where you choose the colors and such. \nThis was about 5 months ago though, but like any good skin or idea on League, it takes ages to come out. As it should.","replies":[]},{"poster":"56552559_DEL","date":"2016-04-16T16:43:14.778+0000","up_votes":4,"down_votes":0,"body":"I honestly thought it was a bad idea from the start. Personally, I would rather spend RP on a new, well thought out and designed skin, than to spend the RP on a Chroma Pack that had only a primary and secondary color like you would find in racing games or something like that.\n\nTo me it is a waste of RP for something that was pretty much a half assed attempt at making more money.","replies":[{"poster":"Critmaster Garen","date":"2016-04-16T20:34:45.326+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=SirPhoenix,realm=NA,application-id=3ErqAdtq,discussion-id=FeLGEJkI,comment-id=0010,timestamp=2016-04-16T16:43:14.778+0000)\n>\n> I honestly thought it was a bad idea from the start. Personally, I would rather spend RP on a new, well thought out and designed skin, than to spend the RP on a Chroma Pack that had only a primary and secondary color like you would find in racing games or something like that.\n> \n> To me it is a waste of RP for something that was pretty much a half assed attempt at making more money.\n\nthe thing is, people asked for simple recolor skins for a cheaper price to make a return. thats why they did it in the first place.\n\nits not a bad idea. its just their sales model that messed it up. instead of getting a neat little low budget skin for something like 120 rp, they sold them only in packs of multiple colors that are almost as expensive as a regular skin.\n\nnot only that, but they made chromas mostly of non basic skins. i know ive critisized that they used garens base skin. but actually thinking about it, maybe they could have just done a slightly better job on that.\n\none of the big problems is **you have to own a certain skin before you can buy the chromas for it**. this already narrows the customer base down to a very small population.\n\ni dont know what they were thinking when they decided to only sell them in larger packs.\n\ni mean they could have anticipated that people want to chose a single chroma they like most.\n\n\nif they want to make chromas successful:\n\n- make good recolors of base skins only so theyre outright available to everyone who owns the champ\n- offer them individually at a cheap price that makes them worthwile over just getting a full blown skin.\n","replies":[]}]},{"poster":"TotalJerk","date":"2016-04-16T18:19:33.553+0000","up_votes":4,"down_votes":0,"body":"Two things they need to do next time\n\n1. sell them individually\n\n2. sell them for vanilla skins only","replies":[]},{"poster":"Randomonium","date":"2016-04-16T22:48:55.436+0000","up_votes":3,"down_votes":0,"body":"Chromas should have been rewards for champion mastery.  Riot would sold a lot more skins with happy players who could changes the colors of skins they purchased if they had enough mastery of the champion.","replies":[]},{"poster":"jazzrt","date":"2016-04-16T22:04:00.614+0000","up_votes":3,"down_votes":0,"body":"Should chromas be free and only available once you achieve mastery lvl 5 with a champion? Or is that too generous?","replies":[]},{"poster":"Pokku","date":"2016-04-17T20:19:27.871+0000","up_votes":2,"down_votes":0,"body":"I actually like the (Koi) Nami ones but unfortunately they are too expensive for what you actually get.","replies":[]},{"poster":"Left Hook Larry","date":"2016-04-17T19:26:39.081+0000","up_votes":2,"down_votes":0,"body":"Only people who bought them were people who mained the champs. If they sold them individually they could have succeeded, but I'm not going to spend 520 rp for 3 recolors.","replies":[]},{"poster":"AtheosisX","date":"2016-04-17T16:43:35.892+0000","up_votes":2,"down_votes":0,"body":"They cost way too much and you have to buy colors you don't want to get the one you do.  Yeah, no shit they failed...","replies":[]},{"poster":"Sarutobi","date":"2016-04-17T05:34:28.673+0000","up_votes":2,"down_votes":0,"body":"I would think they would probably try to release at least one per champion (Defult skin) and have them as a reward for masteries. It would make sense.\n\nBut I will say despite me liking chromas, I still haven't bought any of them. I do have a number of skins already, and while some chromas do look nice, I just want to be able to buy one! Like a certain Nami and Bard chroma I would want, but refuse to buy it if I'm buying 2 more that I more than likely won't ever use!","replies":[]},{"poster":"PaladinNO","date":"2016-04-16T20:04:06.656+0000","up_votes":2,"down_votes":0,"body":"And good riddance! Pay money for something that custom skins could do better. >-<","replies":[]},{"poster":"StankyMuff","date":"2016-04-16T20:01:26.590+0000","up_votes":2,"down_votes":0,"body":"Simple, low risk idea that was implemented horribly. They could have costed less than skins and be sold individually because of how simple it is to recolor. Instead they costed more and gave no splash art.","replies":[]},{"poster":"Forbidden Siren","date":"2016-04-16T18:02:30.005+0000","up_votes":2,"down_votes":0,"body":"I don't mind buying a chroma pack if they make one for a champion that I actually use... which is Karma. Otherwise they're non-existence in my eyes at the moment.\n\nI even pitched an idea many months ago for Sakura Karma skin that i would love to see (and obviously insta-buy).\n\nDefault: Green\nChroma 1: Blue\nChroma 2: Pink\nChroma 3: Black\n\nhttp://safebooru.org//images/1083/9d5a026d43233424c484c182c785aa69523903a5.jpg?1124321\n\nhttp://pre05.deviantart.net/3a5f/th/pre/f/2011/301/8/b/sakura_karma_by_yumedust-d4e7rc8.jpg","replies":[]},{"poster":"rescued","date":"2016-04-16T17:08:09.902+0000","up_votes":2,"down_votes":0,"body":"Only chroma I use is Leona Pool Party, but that's because she's my main and I love the blue skin.","replies":[]},{"poster":"rampaging poet","date":"2016-04-16T14:47:24.096+0000","up_votes":2,"down_votes":0,"body":"Yeah, next to nobody bought them so they stopped making them.  It's not surprising given that their response to feedback that chromas would be too expensive was a \"3 for 1 deal!\" that's priced even worse if you don't want three skins for one champion.","replies":[]},{"poster":"SH Azykan","date":"2016-04-16T10:30:00.396+0000","up_votes":2,"down_votes":0,"body":"I bought several chromas actually, I really liked the Fizz and Lee Sin ones (Yellow Fizz <3)\nOfc I only bought the lee sin one because I own an extremely similar outfit to the blue one >.>","replies":[]},{"poster":"Wulf Helhammer","date":"2016-04-16T09:02:48.987+0000","up_votes":2,"down_votes":0,"body":"I received a poll a while ago talking about an alternative to chromas. It was a repaint system that could be purchased with either currency. Found this post on it: http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/8nbrNOmB-ink-bottles-and-the-future-of-chroma-skins","replies":[]}]}