{"poster":"TheLittlestLulu","date":"2016-03-10T22:47:31.857+0000","title":"Hey Riot can you at least pretend to give a shit about support Lulu?","subforum":"Gameplay","up_votes":147,"down_votes":22,"body":"Once again you are gutting base values instead of ap ratios like you should be doing if you don&#039;t want a support to be strong in solo lane.","replies":[{"poster":"Pentarina Only","date":"2016-03-10T22:49:52.455+0000","up_votes":50,"down_votes":5,"body":"Rito's balance team is a joke. lol","replies":[{"poster":"TheLittlestLulu","date":"2016-03-10T22:57:09.385+0000","up_votes":46,"down_votes":4,"body":"Honestly it's baffling how out of touch they are about things like this.\n\nSolo lane Lulu being played way more than support Lulu? Lets just go ahead and completely shit on her ult base values.","replies":[{"poster":"rescued","date":"2016-03-11T02:31:13.962+0000","up_votes":3,"down_votes":0,"body":"#ritologic ","replies":[]},{"poster":"Elikain","date":"2016-03-11T14:28:05.131+0000","up_votes":3,"down_votes":5,"body":"> [{quoted}](name=TheLittlestLulu,realm=NA,application-id=3ErqAdtq,discussion-id=zjIdiXsY,comment-id=00000000,timestamp=2016-03-10T22:57:09.385+0000)\n>\n> Honestly it's baffling how out of touch they are about things like this.\n\nLet's break down your meltdown:\n\nNerfing the base values keeps Lulu from being oppressive early game but still keeps her relevant if she itemizes from items (in terms of how good she can support someone) and prevents these cases where she gets to go solo lane, shit on it and still be gank-proof because of the built-in utility.\nThis means she can still be viable as a solo lane pick and not strictly downgraded to a support role.\n\nNerfing ratios means she can't feel good about the item purchases because she doesn't scale well and your damage is only relevant for a certain amount of time until resistances, HP and damage of others outscales you and you start feeling like an R-bot. \n\nI hope your tantrum will stop now.\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"billxx","date":"2016-03-11T14:37:25.401+0000","up_votes":2,"down_votes":2,"body":"I like you","replies":[{"poster":"LegacyDAP","date":"2016-03-12T19:52:48.665+0000","up_votes":2,"down_votes":0,"body":"I don't like either of you :/","replies":[]}]}]}]},{"poster":"Eevee In A Jar","date":"2016-03-12T09:09:04.984+0000","up_votes":1,"down_votes":0,"body":"Riot legit doesn't know shit and everything they keep doing promotes and encourages all the crap they said they don't support. Getting into it will make me write an essay so I'll just legit say Riot has 0 clue what they are doing when they try to \"balance\" things. It's literally not helping Riot basically has a system that essentially promotes toxicity and elo boosting. While Riot's busy obsessing over little 10 year olds who say the n word or bigoted insults, the game suffers from crap balancing. This is probably universally the worst season. Almost everyone agrees regardless of when they started playing.","replies":[]}]},{"poster":"Evewynn","date":"2016-03-10T23:12:57.816+0000","up_votes":19,"down_votes":1,"body":"Lulu is the second best anti-assassin support (also really good in solo lane).\n\nAnything that prevents #LCSbigplays must never be in favor. \n\nYou're next Janna.","replies":[{"poster":"Uiraya","date":"2016-03-11T03:38:25.597+0000","up_votes":7,"down_votes":4,"body":"Are you implying that Janna has, at any point, not been on Riot's MUST DELETE list?\n\n Janna is the best champion in the game because Riot's balance team isn't good enough to destroy her. They have tried, oh God they have tried. If they did to Lee Sin or Thresh what they have done and will continue to do to Janna Riot HQ would be a smoldering crater by dinnertime. Janna's Q building knockup was a nerf that at the time was unique to her (and still might be)- Riot is willing to come up with entirely new mechanics to nerf Janna. AND THEN IT WAS BUGGED FOR OVER A YEAR. Well done, Riot!\n\n I'm sure there are other champs who have had nothing but consecutive chain nerfs on every ability and passive (mostly supports, I imagine) but nothing else even comes close to the (failed) assassination of Janna by Riot. I don't think Riot even knows they nerfed Janna hard when they changed turrets' HP and armor values. Janna getting stuff taken away from her is the kind of thing that just happens in the background, it's expected and normal now. Meanwhile the must ban list is getting up near 12 champs and Janna is nowhere close to it but don't worry about that we've got supports to murder LOOK OVER THERE SONA DAMAGED THE ADC GET HER\n\n I think part of it is that Janna doesn't rely on one particular item. Balance team only knows how to really dumpster a champ when they synergize with an item that was designed for synergy in the first place- double nerf them, rework/remove the item, leave the champ in the trash. That's worth RP! Good job boys!","replies":[]}]},{"poster":"LoLKiru","date":"2016-03-10T22:57:37.102+0000","up_votes":7,"down_votes":5,"body":"They could be doing the opposite of what happened with Janna (who could effortlessly clear waves at one point and was pretty ridiculous as a solo laner)\n\nInstead of pushing her into support again, they could be intending to balance her as a solo laner rather than as a support.\n\nNot sure if its what I'd do though.\n\nTL;DR: They could've simply given up on trying to support well, support lulu at this point for a while.\n\nEdit: And a downvote ..... because? Genuinely curious, I didn't say I even REMOTELY agreed with the reasoning, just that it was a _possible_ reasoning.","replies":[{"poster":"TheLittlestLulu","date":"2016-03-10T22:59:37.622+0000","up_votes":18,"down_votes":6,"body":"> [{quoted}](name=LoLKiru,realm=NA,application-id=3ErqAdtq,discussion-id=zjIdiXsY,comment-id=0001,timestamp=2016-03-10T22:57:37.102+0000)\n>\n> They could be doing the opposite of what happened with Janna (who could effortlessly clear waves at one point and was pretty ridiculous as a solo laner)\n> \n> Instead of pushing her into support again, they could be intending to balance her as a solo laner rather than as a support.\n> \n> Not sure if its what I'd do though.\n\nSolo lane Lulu is one of the most cancerous things in the game whenever it is strong and I don't think there is a single person in the game who enjoys going up against it.\n\nI don't know why Riot doesn't just make her a support again.","replies":[{"poster":"YumaS2Astral","date":"2016-03-10T23:59:36.629+0000","up_votes":6,"down_votes":2,"body":"> [{quoted}](name=TheLittlestLulu,realm=NA,application-id=3ErqAdtq,discussion-id=zjIdiXsY,comment-id=00010000,timestamp=2016-03-10T22:59:37.622+0000)\n>\n> Solo lane Lulu is one of the most cancerous things in the game whenever it is strong and I don't think there is a single person in the game who enjoys going up against it.\n> \n> I don't know why Riot doesn't just make her a support again.\n\nI enjoy going against Lulu. There are many champs that can lane against her rather fine, examples being Malzahar, Anivia, and any top laner that has a {{item:3211}}","replies":[{"poster":"Serika Zero","date":"2016-03-11T16:15:07.442+0000","up_votes":1,"down_votes":0,"body":"another good top lane vs Lulu would be Kayle for example. And her scaling with with current rage blade is absurdly strong","replies":[]}]},{"poster":"Reynard the ƒox","date":"2016-03-11T06:05:57.945+0000","up_votes":1,"down_votes":1,"body":"They probably want her to be a solo laner. And I mean, who cares? Just play her mid now. Easy.","replies":[{"poster":"TheLittlestLulu","date":"2016-03-11T06:08:23.387+0000","up_votes":6,"down_votes":3,"body":"> [{quoted}](name=Nubilis Nox,realm=NA,application-id=3ErqAdtq,discussion-id=zjIdiXsY,comment-id=000100000001,timestamp=2016-03-11T06:05:57.945+0000)\n>\n> They probably want her to be a solo laner. And I mean, who cares? Just play her mid now. Easy.\n\nI have a vision impairment and have a great deal of trouble with focusing on minion health for last-hitting. Support became my primary role because of this.\n\nLulu was literally made as a support. They even labeled her as a suppordle when she came out.","replies":[{"poster":"Anidan","date":"2016-03-11T07:37:31.204+0000","up_votes":4,"down_votes":4,"body":"Things change.","replies":[{"poster":"manbearswine","date":"2016-03-11T20:05:59.670+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Anidan,realm=NA,application-id=3ErqAdtq,discussion-id=zjIdiXsY,comment-id=00010000000100000000,timestamp=2016-03-11T07:37:31.204+0000)\n>\n> Things change.\n\nYet every time zyra is brought up,she should be sent back mid lane cause \"that's what she was designed for,hurr durr\"\n\nBut anyway,let me ask you this: how much potential do you think solo lane lulu has? do you really think she has a potential for a solid playerbase there?\n\nI mean as she is right now she is basically 100% pickban in competitive, which results in a 4.2% pickrate mid and 2.3% pickrate top(in solo q)...before she is \"balanced\" for those roles,which should cause a lot of people to play her less(we all know competitive influences solo q pick to a very large degree),meanwhile support lulu has a 5% pickrate without any competitive play,and with most people considering her subpar(and rightly so).\n\nI personally don't see any issues with solo lane lulu(aside from how strong she is,at least in competitive),but I'm really not getting a sense that she has good potential to appeal to players and to maintain a playerbase as a solo laner.","replies":[{"poster":"Curling Veigar","date":"2016-03-11T21:37:26.009+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=manbearswine,realm=EUNE,application-id=3ErqAdtq,discussion-id=zjIdiXsY,comment-id=000100000001000000000000,timestamp=2016-03-11T20:05:59.670+0000)\n>\n> Yet every time zyra is brought up,she should be sent back mid lane cause \"that's what she was designed for,hurr durr\"\n> \n> But anyway,let me ask you this: how much potential do you think solo lane lulu has? do you really think she has a potential for a solid playerbase there?\n> \n> I mean as she is right now she is basically 100% pickban in competitive, which results in a 4.2% pickrate mid and 2.3% pickrate top(in solo q)...before she is \"balanced\" for those roles,which should cause a lot of people to play her less(we all know competitive influences solo q pick to a very large degree),meanwhile support lulu has a 5% pickrate without any competitive play,and with most people considering her subpar(and rightly so).\n> \n> I personally don't see any issues with solo lane lulu(aside from how strong she is,at least in competitive),but I'm really not getting a sense that she has good potential to appeal to players and to maintain a playerbase as a solo laner.\n\nYeah well, what riot wants =/= what players want. They want Lulu to be a solo laner, it's been proven already.","replies":[{"poster":"manbearswine","date":"2016-03-11T23:19:24.883+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Curling Veigar,realm=NA,application-id=3ErqAdtq,discussion-id=zjIdiXsY,comment-id=0001000000010000000000000000,timestamp=2016-03-11T21:37:26.009+0000)\n>\n> Yeah well, what riot wants =/= what players want. \n\nSometimes the players don't know what they want,that's not the case here,but anyway,riot won't just harm their game for the lolz,and I just can't see the logic behind turning lulu into a solo laner,people don't enjoy playing her there,people (apparently?) don't enjoy playing against her there,she seems to have some gamehealth issues there,why do so?\n\n>They want Lulu to be a solo laner, it's been proven already.\n\nOn the contrary,everything which happened so far stands to suggest they want her as a support.\nFirst of all: They keep talking about how they don't want to nerf support lulu too hard,they even gave some (very) shitty compensation alongside some of her nerfs,even the current nerfs on pbe came with this statement: https://twitter.com/SmashGizmo/status/708081971629465600\nSecond: They have been VERY patient with lulu,almost any other champion would've been nerfed out of dominance 3 times over the period of time she dominates competitive play,clearly they see her situation as problematic,presumably over ruining her support role(as that has been brought up in several nerfs,and nothing else has been).\nthird: when itemization was changed,lulu recieved extra mana regen(alongside other supports),instead of flat mana changes(alongside other mages),not very meaningful,but still.\n\nRiot knows lulu has little potential to appeal to people in mid/top,hence they have been very careful with her,mind you the nerf on pbe takes a moronic approach to her problem,I'm not sure what they expect to come out of it.","replies":[]}]}]},{"poster":"AbrahamBaconham","date":"2016-03-11T21:23:47.692+0000","up_votes":1,"down_votes":0,"body":"True, but eyesight actually tends to worsen over time.","replies":[]}]},{"poster":"Voluug13","date":"2016-03-11T12:58:12.218+0000","up_votes":1,"down_votes":0,"body":"Zyra, Morgana, Annie and sevral other champions were midlaners or tanks, but ended up beign played support and balanced around that. Morgana no longer has a midlaner recommended page lol\n\nAs Anidan said, things change.","replies":[{"poster":"manbearswine","date":"2016-03-11T20:11:31.988+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Voluug13,realm=NA,application-id=3ErqAdtq,discussion-id=zjIdiXsY,comment-id=00010000000100000003,timestamp=2016-03-11T12:58:12.218+0000)\n>\n> Zyra, Morgana, Annie and sevral other champions were midlaners or tanks, but ended up beign played support and balanced around that. Morgana no longer has a midlaner recommended page lol\n> \n> As Anidan said, things change.\n\nWell,not true,annie was balanced around being a mid laner(at least as far as solo q goes,and she is also considered stronger mid than support in solo q).\nZyra was \"balanced\" for both roles,some claim she is good at both,some claim she is bad at both(those are right),but for the most part people don't seem to be under the impression that one is much stronger than the other(mid vs support).\nMorgana you are mostly right about,but it's worth noting she occasionally sees play mid/top,even in competitive(she is also highly favored by the tank support meta,but not so much in her matchups top/mid).","replies":[{"poster":"Voluug13","date":"2016-03-11T22:50:44.932+0000","up_votes":1,"down_votes":0,"body":"Annie was nerfed a couple of times thanks to being used as a support.\n\nZyra was gutted in both roles, yeah, but her definitive gutting was when it was played support.\n\nAnd while Morgana is used mid/top sometimes, it has an abbysmal playrate compared to support Morg.","replies":[{"poster":"manbearswine","date":"2016-03-11T23:10:35.297+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Voluug13,realm=NA,application-id=3ErqAdtq,discussion-id=zjIdiXsY,comment-id=0001000000010000000300020000,timestamp=2016-03-11T22:50:44.932+0000)\n>\n> Annie was nerfed a couple of times thanks to being used as a support.\n\nNo,she wasn't,and mid annie is stronger than she's ever been.\nThat's because every nerf she received came with a compensation for mid lane.\n\n> Zyra was gutted in both roles, yeah, but her definitive gutting was when it was played support.\n\nThat's true,but she was never changed into a support,after her hotfix she started seeing play there,then she was gutted cause riot decided she was too strong mid and support(cause winrates,you know how it goes),she wasn't exactly balanced around the support role,they just decided to destroy her over winrates,you know,like sejuani before her latest buffs.\n\n> And while Morgana is used mid/top sometimes, it has an abbysmal playrate compared to support Morg.\n\nWell,but her winrate there is good(and you know how riot balances around those),anyway support morgana is supposed to be particularly strong right now due to the support tank meta(same as janna),also pickrates are more than about balance,as you know support lulu has the highest pickrate out of all of her roles(mid/top/support),even though it's by far her weakest one.","replies":[{"poster":"Voluug13","date":"2016-03-11T23:23:07.536+0000","up_votes":1,"down_votes":0,"body":"Annie was untouched previously to being played as a support, aside from giving her a little power yeras ago when she was untouched for years. They nerfed her base damages and AA range specifically during the Annie support time, which DID hurt her midlane, as her less glass canon builds were less efficient that pure AP, similar to pre and post rework Cass.\n\nZyra WAS changes to a support, she no longer has a midlaner recommended page, just like Karma has. And she WAS being balanced around her support role after she was nerfed at first, but it failed and they decided to gut her because they couldn't balance her in her support.\n\n_Riot doesnt balance JUST after winrates._ Mid Morgana's winrate is like Malzahar's, they are unpopular champions that are also strategically powerful countepicks but arent FotM because they lack mobility and are hard to use properly in League of Mobility. \n\nTank support has been meta since S3, and its only NOW people are crying about Janna being ''horribly BROKEN OP BECAUSE WINRATE AND WINRATE ALONEEEEE!!!!1!!''. And Support Lulu is also her classic role, but that doesnt mean its currently her intended (at least by Riot) main role.","replies":[]}]}]}]},{"poster":"YumaS2Astral","date":"2016-03-11T16:41:54.035+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Voluug13,realm=NA,application-id=3ErqAdtq,discussion-id=zjIdiXsY,comment-id=00010000000100000003,timestamp=2016-03-11T12:58:12.218+0000)\n>\n> Zyra, Morgana, Annie and sevral other champions were midlaners or tanks, but ended up beign played support and balanced around that. Morgana no longer has a midlaner recommended page lol\n> \n> As Anidan said, things change.\n\nKha'Zix was a mid/top laner and ended up being played and balanced around jungle\n\nThey are literally \"khazixing\" Lulu","replies":[{"poster":"Voluug13","date":"2016-03-11T22:56:13.211+0000","up_votes":1,"down_votes":0,"body":"Kha was released in a time where they still didnt fully shove champions into specific roles. He was supposed to be Rengar's counterpart, and both of them were junglers on the beginning.","replies":[]}]},{"poster":"Serika Zero","date":"2016-03-11T16:26:25.782+0000","up_votes":1,"down_votes":0,"body":"And yet, Morgana mid win ratio: 52.65%\nMorgana sup win ratio: 49.62%\n\nIts clear which type of Morgana is superior and better to play. To bad LCS sheep decided that support is the only way Morgana can be played. Despite her being most likely the strongest supportive mid laner at this moment.\nShe is amazing when you got a hyper carry top or jungle in your team. Something like Yi, Kayle, Fiora, Shivana, Ryze, etc.\n\nTo begin with, there are very few supportive mid laners out there:\nMorgana at 52.6% win rate, Lulu at 49.2% win rate, Zillean at 51.4% win rate, TF at 51.3% win rate, Kayle at 52.7% and Karma at 50%\n\nSo, as far as \"viability\" goes. Morgana is pretty much tied with Kayle for best supportive mid laner role.\nYes, its not a carry mid laner role. As she is supposed to be a \"team player\" rather than a solo carry like the likes of Zed, Lux, etc. She relies on her team mates doing good and can't 1v5 the enemy team even if you are amazing on Morgana (same thing for other supportive mid laners).\n\nHowever, this is a type of champion that is still very strong. Yet riot only acknowledges the support Morgana. Thx LemonNation and C9 team and all the LCS sheep out there.","replies":[]}]}]}]},{"poster":"Eevee In A Jar","date":"2016-03-11T21:36:47.640+0000","up_votes":2,"down_votes":0,"body":"Let's be real though; while it may be the most cancerous thing let's remember what brought it into meta. Assassins.","replies":[]},{"poster":"Shonjl","date":"2016-03-11T08:45:45.451+0000","up_votes":2,"down_votes":1,"body":"Because they can't.\n\nITs no different than Karma. They can force it all they want, she is just a better solo laner. Hell no different than Morgana, she can support but she is far better as a mid or top laner no matter what Rito can possible do to them.","replies":[]}]}]},{"poster":"Zantumall","date":"2016-03-11T06:36:12.340+0000","up_votes":6,"down_votes":0,"body":"Firstly, there are two changes on the PBE.  One is to the ult base values and the other is to the AP scaling on Whimsy.  The latter is strictly a nerf to AP Lulu.  The base value nerf, while it does affect support Lulu, also affects early game lane safety for AP Lulu.\n\nSecondly, they've said on twitter that they're not sold on this changelist [specifically because they're worried about over-nerfing support Lulu](https://twitter.com/SmashGizmo/status/708081971629465600).  Please stop freaking out over PBE content the moment it hits the test environment, none of this stuff is guaranteed, especially not changes that Riot has _explicitly said are tentative._","replies":[{"poster":"Maximum Morde","date":"2016-03-11T14:32:27.523+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Zantumall,realm=NA,application-id=3ErqAdtq,discussion-id=zjIdiXsY,comment-id=000c,timestamp=2016-03-11T06:36:12.340+0000)\n>  Please stop freaking out over PBE content the moment it hits the test environment, none of this stuff is guaranteed, especially not changes that Riot has _explicitly said are tentative._\n\n\nYeah, like Xin Zhao.","replies":[]}]},{"poster":"Loli Lulu","date":"2016-03-10T23:00:55.081+0000","up_votes":5,"down_votes":4,"body":"Their immediate goal is probably to push Lulu out of perma-pick/ban status for those ever important LCS matches to open up \"diversity.\" After beating her up a bit more, they'll come back to put a bandaid on Lulu eventually.. maybe.","replies":[{"poster":"TheLittlestLulu","date":"2016-03-10T23:09:45.287+0000","up_votes":8,"down_votes":2,"body":"> [{quoted}](name=Loli Lulu,realm=NA,application-id=3ErqAdtq,discussion-id=zjIdiXsY,comment-id=0002,timestamp=2016-03-10T23:00:55.081+0000)\n>\n> Their immediate goal is probably to push Lulu out of perma-pick/ban status for those ever important LCS matches to open up \"diversity.\" After beating her up a bit more, they'll come back to put a bandaid on Lulu eventually.. maybe.\n\nThey never did it for the previous whimsy nerfs. They never did it for the previous shield nerfs. They aren't going to do it for this nerf.","replies":[{"poster":"YCitizenSnipsY","date":"2016-03-11T00:05:21.041+0000","up_votes":1,"down_votes":3,"body":"They never did it for the previous nerfs, and she ended up right back pick ban in competitive play. I think I'm starting to see a reason why.","replies":[{"poster":"SpecterVonBaren","date":"2016-03-11T03:41:16.846+0000","up_votes":2,"down_votes":0,"body":"Because they keep nerfing the wrong things just to appease the LCS players absolute love of solo lane Lulu?","replies":[]}]}]}]},{"poster":"Naag One","date":"2016-03-11T06:33:18.329+0000","up_votes":1,"down_votes":0,"body":"what is so cancerous about solo lane lulu?  this is a legit question as I dont watch LCS or anything, and I'm struggling at low silver(can never get past silver 4, the moment I hit silver 4, I get bronziest teams and boom back to silver v :D) and I've not seen 1 solo lane lulu in +250 ranked games I've played so far.  NOT EVEN ONCE\n\nsomeone plz enlighten me :D.  if I start playing lulu, can I carry my ass to Gold or something?","replies":[{"poster":"Voluug13","date":"2016-03-11T13:00:38.405+0000","up_votes":2,"down_votes":0,"body":"Unless you are a melee FOTM assassin, its just a normal lane against an utility mage with more emphasis on utility that damage.","replies":[{"poster":"da glorious","date":"2016-03-11T23:18:47.663+0000","up_votes":1,"down_votes":0,"body":"Mid lane yeah, but top lane lulu can be worse than teemo for melee top laners. It's basically impossible to Go aggressive on her without having most of your damage mitigated by shields/polymorph, and her harass is more obnoxious than teemo.","replies":[{"poster":"Voluug13","date":"2016-03-11T23:28:30.622+0000","up_votes":1,"down_votes":0,"body":"But she is way more gankeable that teemo, while being way more mana hungry.\n\nAnyways she is a counterpick against hyper-agressive champions, nothing more. Its a matter of counterpicking, but then again the problem is that she can be an effective 1° pick on every role. But then again again, I hate 90% of the hyper agressive champions so I love sololulu.","replies":[{"poster":"da glorious","date":"2016-03-12T01:51:38.927+0000","up_votes":2,"down_votes":0,"body":"More gankable? R u kidding me. MAYBE if teemo has a ton of shrooms up which take a crap ton of mana. Pre 6 teemo is easy unless you're xin or something similar. Lulu has a speed up/polymorph, an aoe slow, and a shield. Teemo only has one of those pre 6.\n\nShe's a Mage. Why wouldn't she use more mana. Even then it isn't really a big problem for her unless you're spamming spells in which case it should be. Once she has a catalyst/forbidden idol it's really not a problem at all. If you think she has mana problems look at lissandra. She has a passive that is only useful for mana, and she still has mana issues.\n\nThey don't have to be hyper aggressive. Playing just about any Melee against her is hell. She may be a counter against aggressive champs, but she doesn't even have to play that safe or outplay you. You can do everything right, yet she lives just by clicking r and e on herself.\n\nI don't hate lulu, but you have to understand that she is incredibly obnoxious/frustrating to lane against as most melee champs.","replies":[]}]}]}]},{"poster":"DarkRitual","date":"2016-03-11T12:09:16.859+0000","up_votes":2,"down_votes":0,"body":"Nothing inherently, but Riot is intending to nerf her usefulness for pro-tier play.\nShe's a priority pick because you can take her in an early rotation and flex her to three different spots. It's basically a free pick that gives away no information.\nRiot is intending to primarily nerf solo lane lulu, since 2 of those three spots she flexes to are solo lanes.","replies":[{"poster":"IronicGentleman","date":"2016-03-11T22:33:45.708+0000","up_votes":1,"down_votes":0,"body":"She's not only a flex pick. She's also the core pick for any protection comp, and is by FAR the best mid/top enabler for those comps.","replies":[]}]}]},{"poster":"ParaBellam","date":"2016-03-11T15:31:38.287+0000","up_votes":2,"down_votes":0,"body":"But she doesn't make the #LCSBigplays...","replies":[]},{"poster":"KetiaX","date":"2016-03-12T08:05:16.344+0000","up_votes":1,"down_votes":0,"body":"But on PBE they do nerf Lulu's W movespeed AP ratio though. Her ult gets base HP nerf though, so that's weird.","replies":[]},{"poster":"Drackolus","date":"2016-03-12T07:59:28.733+0000","up_votes":1,"down_votes":0,"body":"I don't know what happened. Last season was so nice. Everything was going so well. And then season 2016 hit and everything took a 180.","replies":[]},{"poster":"Tobias Brackner","date":"2016-03-10T23:42:40.219+0000","up_votes":2,"down_votes":5,"body":"Supp Lulu is still good.  She turns any diver into a Tanky Initiator.  I don't see what the problem is.","replies":[{"poster":"rescued","date":"2016-03-11T02:34:11.607+0000","up_votes":2,"down_votes":1,"body":"The problem is that they are nerfing support Lulu which has already been nerfed enough INSTEAD of nerfing AP solo lane Lulu.","replies":[{"poster":"Reynard the ƒox","date":"2016-03-11T06:06:30.902+0000","up_votes":1,"down_votes":0,"body":"looks like lulu isnt a support anymore\n\nthe end","replies":[{"poster":"rescued","date":"2016-03-11T17:15:23.778+0000","up_votes":1,"down_votes":0,"body":"Yet she was made as a support","replies":[]}]}]}]}]}