{"poster":"Braian Oliva","date":"2018-02-16T05:23:48.766+0000","title":"¿Se puede llegar a platino sin tener conocimientos avanzados sobre LoL?","subforum":"Guias y consejos","up_votes":3,"down_votes":2,"body":"Hola, hoy me surgi&oacute; la duda si se puede llegar a platino sin tener un conocimiento mayor sobre el juego y sin saber mucho sobre metas, build y mec&aacute;nicas etc.\r\nSe me vino a la cabeza porque cada vez juego con personas de este elo se crean partidas mas intensas y mas eficientes a la hora de aprender (No quita que la **mayor&iacute;a** sean unos egoc&eacute;ntricos, pero yo lo soy tambi&eacute;n, as&iacute; que np papu)\r\nAs&iacute; que al caso, &iquest;alguien pudo llegar a platino sin saber detalles espec&iacute;ficos del game?","replies":[{"poster":"Gaspar Noeh","date":"2018-02-16T07:05:31.918+0000","up_votes":2,"down_votes":0,"body":"Depende pero desde Oro a Platino aun la gente esta falta de conocimiento, en buil, counterbuild, ni que decir de toma de objetivos. Sabes que la season pasada no lo note tanto como en esta, lo hablabamos con un platino la vez pasada y dice que si, que es como si todo el elobost estubiera saliendo en esta season.","replies":[]},{"poster":"KzG Arconte","date":"2018-02-16T06:18:04.447+0000","up_votes":2,"down_votes":0,"body":"egocentrico y arrogante son 2 cosas muy distintas.","replies":[{"poster":"Braian Oliva","date":"2018-02-16T06:37:05.232+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KzG Arconte,realm=LAS,application-id=8sKIclmi,discussion-id=ipYoeuut,comment-id=0002,timestamp=2018-02-16T06:18:04.447+0000)\n>\n> egocentrico y arrogante son 2 cosas muy distintas.\n\nClaro, pero por lo general no me cruzo con muchas personas arrogantes, por lo general veo personas que creen que ideas son mas importantes que las de su equipo, llevando todo un team a que flamee","replies":[]}]},{"poster":"Yamisuke","date":"2018-02-17T21:29:52.826+0000","up_votes":1,"down_votes":0,"body":"Claro que se puede, yo tengo un amigo que llegó a Platino 3 a mitades de season 7 a puro {{champion:16}} {{champion:117}} y {{champion:40}} con {{item:3504}} antes del nerf que le metieron. \n\nEl tema es que no tenia mucho conocimiento sobre el juego, objetivos, wards, rotaciones, etc. Y ahí esta con su marco, no te detengas {{champion:11}}","replies":[]},{"poster":"Cuchufleitor","date":"2018-02-16T15:37:32.326+0000","up_votes":1,"down_votes":0,"body":"Si se puede!","replies":[]},{"poster":"Hwaxinghz","date":"2018-02-16T14:19:06.006+0000","up_votes":1,"down_votes":0,"body":"Todo depende del equilibrio que un jugador tenga.\n\nDigamos, puedes ser malo mecánicamente pero si tomas muy buenas decisiones, es más que suficiente para subir hasta Diamante si quieres. O sino, puedes ser muy bueno mecánicamente (es decir, ganar tu línea fácilmente) y tomar decisiones pésimas, y también puedes subir a Platino-Diamante.\n\nEl tema está en tener un mínimo estratégico BASE. Un Platino no puede NO SABER farmear, o NO SABER que hace el campeón que está usando o el del Enemigo. Muchas veces uno piensa que es Malo o que toma malas decisiones, pero inconscientemente hace cosas que pueden ayudarle a subir (Como wardear, roamear, etc).\n\nEl tema es, como digo, un equilibrio y la compensación. Si sos muy malo con tu champ pero tomas buenas decisiones y sabes wardear o saber que hace el enemigo, ya es suficiente para subir por más que salgas 0/20.\n\nEn otras palabras, respondiendo a la pregunta del título, Si, se puede subir a Platino. Farmear, Wardeo mínimo (aunque sea en los arbustos comunes), saber que hacen los campeones, entender que atacar a campeones bajo torre enemiga cambia el agro de la torre hacia tu contra, etc. Sabiendo esas cosas super básicas es suficiente para subir, pero como digo que si sólo sabes eso, tienes que compensar la falta de conocimiento con la mecánica, sino obviamente subirás por suerte y no está garantizado que puedas subir más allá de oro con esa estrategia.","replies":[]},{"poster":"DIOS TUTI","date":"2018-02-16T12:15:38.556+0000","up_votes":1,"down_votes":0,"body":"hasta diamante 4 se puede llegar sin conocimiento amplio de juego.","replies":[]},{"poster":"NLG Walter","date":"2018-02-16T12:09:47.522+0000","up_votes":1,"down_votes":0,"body":"Todo depende de tu experiencia, tengo amigos que son una wikipedia de LoL, pero con 500 partidas siguen en Bronce, en cambio gente muy ignorante pero con 2000 partidas en Plata comodo.\n\nAsi que si sos inteligente y ya tenes 1500+ normales jugadas probablemente tu nivel ya sea Oro/Platino.","replies":[]},{"poster":"Mazoku","date":"2018-02-16T06:43:02.471+0000","up_votes":1,"down_votes":0,"body":"> ¿Se puede llegar a platino sin tener conocimientos avanzados sobre LoL?\n\nObviamente. Para llegar a platino solo necesitas los conocimientos basicos (muy basicos) del juego.\n\nConocimientos avanzados necesitas para llegar a high diamond/master/challenger. Incluso ahi capas ni siquiera los necesitas.","replies":[]},{"poster":"El Moya Joya","date":"2018-02-16T11:14:10.323+0000","up_votes":1,"down_votes":1,"body":"llegue a platino usando a yasuo top mid y hasta jg asi que si se puede","replies":[]},{"poster":"FedecarboneroUY","date":"2018-02-16T05:31:34.169+0000","up_votes":1,"down_votes":2,"body":"Por supuesto que se puede llegar a platino sin saber nada del juego, sino mira los 10mil otp´s que hay ahí.","replies":[]}]}