{"poster":"Killsync","date":"2017-02-04T20:36:14.900+0000","title":"client open beta bug after bug after bug","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So this morning i thought it would be a good idea to give the new client another go after using it so long ago and having so many bug issues with it i stupidly thought why not. After 20minutes of trying to get the client to actually start installing i finally got it to work, thus being prompted with a 12gb patch i started to wonder is it worth it? Stupidly again i thought why the fuck not. Once the patch reaches 86% after 10 minutes of downloading it completely stops, after about 30minutes of trying to get this to finish its download of 200mb i gave up and decided to go back to the legacy client. Now this client stops working completely and won't let me go back so i've had to reinstall the whole game for it just to switch back and to start downloading even more patches. fuck me what a glorious start to the day, now that the client has download one 2gb patch it starts another one going from my normal speeds of 6mbs to 200kbs and not matter what i do, restarting client, running in admin, deleting the solutions folder, it still wants to run at 200kbs and take up to 3 fucking hours and ruin my whole sunday morning and only day off. All because i wanted to try and use the new client...","replies":[{"poster":"Porocles","date":"2017-02-04T21:54:27.396+0000","up_votes":1,"down_votes":0,"body":"It sounds like you've been waiting for quite a bit, and I'm sorry things haven't been too prompt today.  Spending the weekend like that is really frustrating and I wish I could make it speed up.  It seems like you've got a pretty unstable connection that can't smoothly download updates.  For example, at 86%, the patcher is trying to grab game files from our patching servers, but a bad connection can cause it to backtrack or error out completely.  Your best bet would be to run through our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to tune up your network.  Let me know if you have any questions!","replies":[]}]}