{"poster":"Shadow Guppy","date":"2016-11-03T09:51:38.130+0000","title":"Wieviel muss man auf 0lp verliren um aus silver zu droppen?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hallo!\r\n\r\nIch habe es vor kurzem in silver geschafft und wollte nun fragen wieviel Spiele ich auf Silver 5 0lp verliren muss um wieder zu droppen?\r\n(Hab in Silver noch kein einziges Ranked Game gespielt)\r\n\r\nLg","replies":[{"poster":"Asteriade","date":"2016-11-03T10:27:31.528+0000","up_votes":1,"down_votes":0,"body":"Da ich in dieser Season insgesamt 4x aus Diamond gedropt bin... (Lustig war der 2. Drop von Promo Diamond2 in 2 Wochen runter auf Platin3 und in 4 Wochen wieder auf D4^^) \n\nKann ich dir das im Groben sagen:\n\ndeine MMR muss auf der 3. Division der vorherigen Liga sein. Sprich: Diamond5 0lp, Plat3 MMR = drop, Platin 5 0lp, Gold3 MMR = drop\nDeine MMR müsste also bei Bronze3 liegen und du würdest dropen.\n\nDu kannst überprüfen wie lange es noch dauert: Wenn du ca 13-14LP pro Win bekommst weisst du, dass bei der nächsten 2-3 Game Losestreak auf 0LP der Drop kommt.","replies":[]},{"poster":"MasterYeeSin","date":"2016-11-03T10:22:15.732+0000","up_votes":1,"down_votes":0,"body":"Das ist abhnängig von deiner MMr  also deiner verborgenen Ello.  Die mmr kannst du auf Seiten wie op.gg  oder anderen nachschauen. SOweit ich weiß muss die auf Bronze 3 sein bevor du absteigst.   In 4 Tagen ist die Season aber sowieso vorbei, also kannst du einfach solange garnichtmehr Ranken falls du Angst hast vorher noch zu droppen","replies":[]},{"poster":"Lord Dominator","date":"2016-11-03T10:08:58.119+0000","up_votes":1,"down_votes":0,"body":"ich glaube 5, bin mir aber nicht sicher, vielleicht gehts bei silber auch noch garnicht dass man droppen kann","replies":[]},{"poster":"Alustus","date":"2016-11-03T10:34:51.302+0000","up_votes":1,"down_votes":1,"body":"Ganz verschieden kommt auf deine MMR an.\nWenn diese auf Bronze 3-5 Droppt steigst du ab, wieviele Spiele das sind kann man so nicht sagen.\n\nDu kannst aber durch LoL nexus ungefähr sehen in welcher Liga/Division die mitspieler/gegener sind, um ungefähr zu sehen wie deine MMR aussieht.\nDennoch sollte man das auch mit Vorsicht genießen, da die Liga/Division nicht exact die MMR wiedergibt, aber als sehr grober Richtwert ist es mMn okay.\n\nWenn du nicht allzuviele Spiele in den nächsten 4 Tagen spielst solltest du aber sowieso nicht absteigen.","replies":[]}]}