{"poster":"Czdr","date":"2015-11-30T15:17:15.777+0000","title":"Quiero mejorar","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Quiero mejorar mi juego en esta pretemporada, por lo que eh pensado que necesito ayuda de alguien que sepa.\r\nQuisiera saber si alguien estaria dispuesto a ayudarme a mejorar mi juego.\r\nSoy Top Laner: Uso principalmente a Irelia, Riven, Renekton Y Lulu.\r\nMi KDA es 3.4 esta rondando cerca de 8.5K 4.5D 6.9A.\r\nMi MMR es de 1,215.\r\nTengo un win rate de 53%, con mis principales campeones cerca del 60%.\r\nQuiero mejorar y recuperar el tiempo que no pude jugar la temporada pasada (8 meses).\r\nPor eso vengo a pedir ayuda a alguien que no le disguste gastar su tiempo para que alguien mejore.\r\nhttps://las.op.gg/summoner/userName=Czdr\r\nDesde ya, Muchas Gracias\r\n\r\nPD:Rito para de borrarme los temas que creo","replies":[{"poster":"KNT D3M0NSP3LL","date":"2015-12-01T18:18:27.324+0000","up_votes":1,"down_votes":0,"body":"hola, yo soy plata 2 actualmente, no me gusta decir si se mucho o poco, pero siempre trato de informarme y aprender todo lo q pueda, y sobretodo compartir esta informacion, si te parece puedo darte una mano, x ahi los errores o puntos a mejorar se ven mejor desde afuera, no tengo mucho tiempo para jugar x temas de estudio, pero me gustaria ayudar en todo lo q pueda. cualquier cosa hablamos, con gusto estoy a tu disposicion.","replies":[]},{"poster":"LeonardoSB","date":"2015-11-30T16:13:35.366+0000","up_votes":1,"down_votes":0,"body":"mejorar\nverbo transitivo\n1.Hacer que una cosa sea mejor de lo que era.\n\"el Gobierno prometió mejorar la situación de los pensionistas; el ejercicio físico mejora la circulación sanguínea\"\n\n2.Hacer que una cosa sea mejor que otra con la que se compara.\n\"el atleta ha mejorado el récord europeo; nuestra empresa no puede mejorar las condiciones que ofrecen las grandes compañías; su nuevo disco mejora toda su producción anterior\"\nsinónimos:\tsuperar\n\nbasandonos en la definicion de mejorar, tendrias que pensar por ti mismo que haces mal, que puedes hacer mejor, que hiciste mal en cada game y aunque ganaste, como pudo haber sido incluso mas implacable tu victoria.  las personas que copypastean un jugador (no digo que esté mal, pero ciertamente no es mejorar) tienden a quedarse estancadas en una liga o division, de esa manera tienden a repetir intencionadamente mejorar los mismos aspectos una y otra vez, pero no se dan cuenta que hay algo que podrian hacerlo mas a su manera, viendo su propio juego.\n\ncreo que con eso mejorarás bastante si lo aplicas. si no lo haces es tu decision.","replies":[]},{"poster":"TheFalc","date":"2015-11-30T15:32:37.157+0000","up_votes":1,"down_votes":0,"body":"Si quieres mejorar y sabes inglés, te recomiendo ver Jeremy Gaming Curious, da buenos consejos sobre cualquier cosa, a mi me sirve de repaso de inglés en listening xD","replies":[]}]}