{"poster":"Poke Staph Pls","date":"2015-11-18T23:47:32.787+0000","title":"Porque la gente no le da comida a los poros","subforum":"Charlas Generales","up_votes":12,"down_votes":2,"body":"todos tenemos un mal d&iacute;a, donde no queremos tener contacto con nadie pero... los poros no tienen la culpa, todos los d&iacute;as muere un poro por no alimentarlos, pierden peso hasta desaparecer, en el a&ntilde;o se pierden mas de 300.000 poro galletas por la gente que esta de mal humor.\r\n TODOS POR UN LOL DONDE NO MUERAN POROS POR GENTE CON MAL HUMOR!!.\r\n\r\nARRIBA EL ANIMO GENTE QUE LOS POROS SON LOS AMOS.\r\n\r\nTODOS POR UN LOL CON POROS FELICES{{summoner:31}}.","replies":[{"poster":"Yrox the Third","date":"2015-11-19T01:27:51.482+0000","up_votes":3,"down_votes":1,"body":"Prefiero no arriesgarme, quien sabe cuantas enfermedades o agentes infecciosos tienen esas galletas, quien nos asegura que no esten podridas considerando que estan en el hielo (Freljord).\nAsi que no, no lo hago para protejerlos.","replies":[]},{"poster":"Runth","date":"2015-11-19T05:04:15.041+0000","up_votes":1,"down_votes":1,"body":"porque es feeding al poro","replies":[]},{"poster":"Yitán","date":"2015-11-19T04:32:01.804+0000","up_votes":1,"down_votes":1,"body":"como que ya se hizo comun, podrian implementar algo mas, nose, como que crezcan mas con cada una, o que te sigan hasta que otro los alimenten, o que exploten antes\n{{sticker:slayer-pantheon-rainbows}}","replies":[]},{"poster":"LaReinaPingüino","date":"2015-11-19T02:18:30.384+0000","up_votes":1,"down_votes":1,"body":"Por estrategia, cuando tú no tienes porogalleta los poros huyen de ti, cuando la andas trayendo te siguen: me gusta que me sigan los poros y hacerlos caminar en círculos ~~mientras muere mi equipo~~, sobretodo si voy con mi Sejuani ~~esclavizadora de poros preñados~~ navideña, es de lo mas caguay. http://static2.gamespot.com/uploads/scale_super/1551/15516851/2941772-lfs21.png\n\n\nEscribiendo en serio, es verdad que si andas con tu porogalleta los chiquitos te siguen y si la regalas arrancan de ti, esto puede ser usado estratégicamente: si ves de un arbusto en que no tienes visión salir un poro es porque alguien que regaló su porogalleta entró ahí, y puedes pokear gratis con una habilidad, no quiero que nadie haga eso contra mi sólo porque alimenté a un poro, los únicos poros que alimento, son los que han sido previamente por Braum sama, no me puedo resistir http://static2.gamespot.com/uploads/scale_super/1551/15516851/2941765-lfs14.png\n\nhttp://static2.gamespot.com/uploads/scale_super/1551/15516851/2941763-lfs12.png","replies":[]},{"poster":"Dildo de Moria","date":"2015-11-19T01:48:51.362+0000","up_votes":1,"down_votes":1,"body":"#NiUnPoroMenos \nSin piedad con esos opresores abusadores de los débiles :'l \n\n¡Basta de Poricidio!","replies":[]},{"poster":"Nombre ofensivo","date":"2015-11-19T00:18:58.578+0000","up_votes":1,"down_votes":1,"body":"son unos insensibles, peor aun los que venden la poro galleta  {{summoner:11}} {{summoner:14}}","replies":[]},{"poster":"PaquiaRiat","date":"2015-11-19T00:12:02.328+0000","up_votes":1,"down_votes":1,"body":"Yo siempre quise que se puedan comprar porogalletas, al menos una mas por invocador","replies":[]},{"poster":"Whitesse","date":"2015-11-18T23:48:56.066+0000","up_votes":1,"down_votes":1,"body":"Tienen que vender porogalletas en la tienda D:","replies":[]}]}