{"poster":"MingPongChing","date":"2016-02-01T03:38:26.518+0000","title":"Bug splat in 2016 :)","subforum":"Miscellaneous","embed":{"description":"The easy way to save screenshots, GIFs, and websites. Make everyone happy by sharing smarter, faster, and with your point crystal clear.","url":"https://gyazo.com/9a280a79985ea94a6ef0cc8c7f155373","image":"https://i.gyazo.com/thumb/1200/_ece22d7cb0bb37a861f6a20ffc63056f-png.jpg"},"up_votes":0,"down_votes":2,"body":"I&#039;ve been playing this game since early season 3 and even back then bug splat was a huge pain in the ass. Through the majority of 2015 i&#039;ve had no problems with bug splat at all. But here we are, in 2016, and the same old shit. So me and my mate go to play ranked (like we always do about every single day) and it just so happens, despite the fact that i played more than 3 games just yesterday and 100&#039;s of games the weeks and months before then, that for whatever reason, my game just decided that it wasn&#039;t going to load at all. As seen in the gyazo this is somehow my fault because of &quot;network connection&quot; but it&#039;s clearly not since all the games prior went off without a hitch. This shit has been around for years and it still exists?","replies":[{"poster":"Wuks","date":"2016-02-02T06:44:04.899+0000","up_votes":1,"down_votes":0,"body":"Hey MingPongChing,\n\nI'm sorry to hear that you're encountering connection issues to the League of Legends servers. Before we start looking at factors that may be causing these issues on the ISP end, I'd first like to confirm that the issue does not lay on your end of things. Can you try as many solutions as you can that are provided in the [**Troubleshooting Connection Issues**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) Riot Games Support article?\n\nIf those solutions don't work, let's start looking into the diagnostics and see where the issue may be originating. To do this, we'll need you to provide some information for us: \n\n1. Confirmation that you've tried the solutions in the Troubleshooting Connection Issues article\n2. ISP that you're using\n3. Region and/or State\n4. Trace Route (Tracert) - If you're unsure how to do this, check out [**this guide**](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs#wq2)\n5. When did these issues begin occurring, and how often?\n6. Additional information you'd like to provide\n\nThank you for your time.","replies":[]}]}