{"poster":"Embrace","date":"2017-07-20T07:09:26.927+0000","title":"Schwere Server Lags bei 21-23ms ping","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo,\r\n\r\nhabe heute morgen eine Runde gespielt und hatte dabei lags, es f&uuml;hlte sich an als w&uuml;rde der Ping von 22 zu 200+ ms schwenken, obwohl mir immer mein normal Wert angezeigt wurde.\r\n\r\nHaben/Hatten andere auch so ein Problem und wie behebe ich dies oder wird Riot dies in k&uuml;rze von selbst l&ouml;sen?\r\n\r\nmfg LinkGrey","replies":[{"poster":"Fresh Dumbeldore","date":"2017-07-20T07:51:29.505+0000","up_votes":2,"down_votes":0,"body":"Häufig liegt es am Internet selber, zumindest bei mir. Immer wenn jemand Netflix bei uns startet, gibt es bei mir einen kurzen Ruckler. Aber ansonsten wenn es lagt kommt es auch vor, dass die ms immer bei der gleichen Zahl bleibt und nicht wechselt, obwohl es offensichtlich ist, dass diese Zahl nicht stimmen kann.","replies":[{"poster":"Embrace","date":"2017-07-20T11:58:02.165+0000","up_votes":1,"down_votes":0,"body":"Die Internet Verbindung war im normal Bereich laut Task-Manager, damit kann ich das glaub ich ausschließen. Bei mir war zu dieser Zeit keiner im Internet, ich werde, wenn dies nochmal geschieht genauer auf meine Internet Verbindung schauen.","replies":[]}]},{"poster":"ShiroNoKamii","date":"2017-07-20T07:26:07.727+0000","up_votes":1,"down_votes":0,"body":"Hatte gestern während einer Runde dasselbe Problem, zwar war mein Ping angestiegen (nur von ~23 auf ~65) habe um einen Ward zu setzen aber 2-3 Sekunden gebraucht.\nHab das Spiel danach neugestartet und dann wars wieder in Ordnung ^^.\nKann somit nicht versichern, dass es sich um einen Server lag gehandelt hat.\n\nHattest du das Problem schon öfters, oder jetzt das erste Mal? Wenn ja lass mal das Hextech Repair Tool drüber laufen ^^.\n\nhttps://support.riotgames.com/hc/de/articles/224826367-Automatisierte-Fehlerbehebung-Hextech-Repair-Tool\n\nGruß Shiro","replies":[{"poster":"Embrace","date":"2017-07-20T11:59:38.284+0000","up_votes":1,"down_votes":0,"body":"Ne, dies war das erste mal. Ich mach nacher noch eine Runde, gibt es da das gleiche Problem werde ich mal das Repair Tool probieren. ^^","replies":[]}]}]}