{"poster":"IInosukee","date":"2017-07-29T09:35:48.884+0000","title":"Que decidir en estos momentos...","subforum":"Off-topic y temas personales","up_votes":3,"down_votes":1,"body":"bueno como dice el titulo es sobre una decisi&oacute;n que hace tiempo llevo pensando la verdad mi intenci&oacute;n no es crear alg&uacute;n tipo de problema por mi post es que es la primera ves que hago esto o no se la verdad no me acuerdo pero mi intenci&oacute;n no es esa.....\r\nbueno a lo que voy es que yo tuve una novia terminamos hace como 7 meses aprox. yo no me e referido a ella en ning&uacute;n tipo de comentario ya que siento miedo de mostrarme d&eacute;bil a otras personas(padres,amigos,hermanos,etc).\r\nyo dure con ella 3 a&ntilde;os aprox. fue una relaci&oacute;n de todo un poco en la cual siempre di lo mejor de mi pero pasaron cosas en un lapso de tiempo discusiones que fueron desgastando la relaci&oacute;n ... yo en todo el tiempo que a pasado la e pensado d&iacute;a y noche ... y evito decir que la pienso cuando me preguntan por la raz&oacute;n que dije.\r\ncada d&iacute;a me cuestiono y me digo : pierdes tiempo valioso para tratar de recuperar el amor,el momento , los bellos recuerdos que se pueden salvar .\r\nla verdad mi intenci&oacute;n tampoco es parecer un princeso  .{{champion:44}} \r\ne buscado opiniones en mi familia en amigos pero encuentro que siempre me evitan siempre me ignoran o me dicen que &quot;ella no te merece&quot; la verdad yo no me creo la gran cosa no me creo bonito soy humilde para hacer mis cosas soy honesto igual y sobre todo las cosas alguien super empatico la cual aveces me traiciona ser as&iacute; pero siempre trato de pensar en los dem&aacute;s ... bueno volviendo al tema.... .aveces veo sus fotos en la cual sale &quot;cagada&quot; de la risa perdonen mi acento, y eso me hace cuestionar si de verdad tengo que llamarla si de verdad tengo que hacer lo que e pensado por tanto tiempo ... una de las frases que ella me dijo al terminar fue &quot;no me odies&quot; .\r\ncomo dije soy una persona super empatico en la cual le dije que soy no creo odiar a alguien que amo y hasta el d&iacute;a de hoy lo hago.\r\nno me sentir&iacute;a mal si a estado con otra persona igual soy una persona madura obviamente tengo emociones pero no se le puede hacer nada.\r\nbueno mi decisi&oacute;n es que hacer a pasado tiempo y todo .... el otro d&iacute;a vi una foto de ella en la cual salia con una pulsera la cual se la regale yo y ella me regalo una ... por el lado mio yo me la saque pero la sigo guardando porque es super especial no me acuerdo el motivo pero de todos era especial .\r\ny hay fue cuando me recalque la pregunta que me hago ahora si debo luchar ... como dice una frase &quot;la vida da muchas vueltas&quot; la verdad necesito un consejo ... ya que ni el poderoso me da una se&ntilde;al \r\n{{sticker:zombie-brand-facepalm}} \r\ngracias por tomarte un tiempo para leer","replies":[{"poster":"Lord Maxlum","date":"2017-07-29T09:36:40.597+0000","up_votes":3,"down_votes":1,"body":"***","replies":[{"poster":"Lucio22","date":"2017-07-29T09:57:52.130+0000","up_votes":2,"down_votes":0,"body":"...\n\nque preferis? \"sutileza reloaded\" o \"sutileza 2.0\"?","replies":[]},{"poster":"IInosukee","date":"2017-07-29T09:39:31.530+0000","up_votes":2,"down_votes":1,"body":"weon que se da la paja de escribir de nuevo la misma weaaa jajajajaj xd","replies":[]}]},{"poster":"Th3 Fake Fedklen","date":"2017-07-29T09:49:55.491+0000","up_votes":2,"down_votes":1,"body":"El pibe viene a que le den una mano y mira lo que le responden , despues quieren sus llavesitas por que son honorables \nYo creo que voy por las mismas que vos, la cosa anda mal con mi novia \nLa verdad que nunca la pase pero te recomiendo meterte en algo que te haga bien y te tenga la cabeza ocupada \nMetete de lleno en un deporte o consegui un trabajo ( no se que edad tenes), Sali, conoce gente nueva, lo pero que podes hacer es estar solo\nPor que ahi es cuando la cabeza regula y empezas a pensar 500 cosaas malas \nSi tenes la suerte de estar en una ciudad con mar te recomiendo ya empezar surf o bodyboard te cambian la cabeza \nSuerte","replies":[{"poster":"FedecarboneroUY","date":"2017-07-29T13:49:10.901+0000","up_votes":2,"down_votes":1,"body":"Siempre hacen lo mismo porque no se lo toman enserio, yo por eso no haría un post así si estuviera en una situación así, para que me boludeen un par de ****.","replies":[{"poster":"martincarp","date":"2017-07-29T13:55:26.849+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=FedecarboneroUY,realm=LAS,application-id=J8qpiO2I,discussion-id=3hOOtZE2,comment-id=00010000,timestamp=2017-07-29T13:49:10.901+0000)\n>\n> Siempre hacen lo mismo porque no se lo toman enserio, yo por eso no haría un post así si estuviera en una situación así, para que me boludeen un par de ****.\n\nNo creo que lo estén boludeando, fijate que la gran mayoría de los comentarios le responden de manera sincera.\n\nEl tema es que todos sabemos a qué vino la publicación del muchacho, simplemente necesita que alguien le convenza de hacer lo que quiere, así que aunque seamos 20 diciéndole \"dejala\", él se quedará con ese único comentario que le diga \"dale pa'delante, a por ella tigre\" (suponiendo que llegue).","replies":[{"poster":"FedecarboneroUY","date":"2017-07-29T14:26:07.091+0000","up_votes":1,"down_votes":1,"body":"Yo lo dije en base a más posts así que he leído, siempre es así...","replies":[]}]}]}]},{"poster":"Rehrs","date":"2017-07-29T11:14:00.098+0000","up_votes":2,"down_votes":1,"body":"creo que solo estas esperando un \"trata de recuperarla\" para validar lo que quieres hacer xD","replies":[]},{"poster":"Gexz Arg","date":"2017-07-29T16:22:23.669+0000","up_votes":1,"down_votes":0,"body":"Yo te recomiendo que hagas tu vida.. si ese amor termino , no trates de volver a eso ! porque de todas formas se volvera a desgastar la relacion y sera doble sufrimiento, hace tu vida.. que hay millones de mujeres ! no te detengas en solo 1 , divertite ! sali con amigos, como bien decis , ella sale riendose en fotos ! la pasa bien, entonces vos hace lo mismo, dale para adelante","replies":[]},{"poster":"Mazer Rakham","date":"2017-07-29T13:56:13.406+0000","up_votes":1,"down_votes":0,"body":"Seguí tú vida. Toma tus propias decisiones sin miedo a lo que piensen los demás, al fin y al cabo, es tú vida, no La de ellos. Si querés recuperarla, intentalo. Si querés superarlo, ocúpate de algo, estudia, aprende algo nuevo, salí. \n\nEl mejor consejo que te puedo dar es: tú vida es solo tuya, nadie vive por vos. Lo que tenga que ser, será. Y si no pudo ser, seguí adelante tú camino.","replies":[]},{"poster":"kiuhm","date":"2017-07-29T12:09:32.464+0000","up_votes":1,"down_votes":0,"body":"En estas situaciones lo que uno busca no es un consejo, sino seguir fantaseando con el amor imposible. \nNo les vas a dar bola a ninguna sugerencia asi que solo voy a decirte que si ella quisiera volver con vos, ya lo hubiese hecho. \n\nY te voy a adelantar lo que va a pasar, de alguna u otra manera vas terminar humillandote en el intento de querer entrar a su vida de nuevo. \n\n\nA todos les pasa esto o algo parecido. da igual. Al final siempre encuentran a otra persona.","replies":[]},{"poster":"TresBans","date":"2017-07-29T10:56:06.446+0000","up_votes":1,"down_votes":0,"body":"Pero no seas arrastrado! Que tipo con mentalidad de \"es mi 1er amor\".\nValorate un poco y no andes dando pena!\n\nMujeres hay para todos! Y tambien hombres, sentite libre de elegir!\n\nSolo pensa que otro la esta disfrutando, mie tras vos estas llorando en un foro!\n\nExitos.","replies":[]}]}