{"poster":"Uranbrennstab","date":"2019-03-26T07:05:08.508+0000","title":"[TGSG] Wenn einfach nichts passiert","subforum":"Allgemeiner Chat","up_votes":5,"down_votes":4,"body":"Normalerweise würde ich euch über bedeutende oder zumindest erwähnungswerte Ereignisse aus der Vergangenheit berichten die sich heute ereignet haben. Leider ist der 26.3. kein sehr guter Tag dafür. Man könnte vielleicht erwähnen, dass heute vor 671 Jahren der Bau der heutigen Prager Innenstadt, also das damalige Prag begonnen hat. \r\n\r\nEine sehr sehenswerte Stadt im übrigen, falls jemand ein Ziel für den diesjährigen Urlaub sucht und noch nicht da gewesen ist. \r\n\r\nAnsonsten wurden 1872 zwei Typen verknackt, die zwei Jahre zuvor während einer Reichstagsdebatte gefragt hatten, ob man nicht lieber Frieden mit den Franzosen schließen will, anstatt mehr Geld in den Krieg zu pumpen. Falls euch noch mal jemand sagt, es gäbe keine dummen Fragen, doch. Doch es gibt sie und Bismarck zu fragen ob man das Reich vielleicht nicht mit Blut und Eisen erweitern will gehört eindeutig dazu. Machste nix.\r\n\r\nDie Schlacht um Iwojima wurde auch heute beendet, eine recht unangenehme Sache damals. Die Japaner waren wohl die unenstspanntesten Gegner die man im zweiten Weltkrieg haben konnte.\r\n\r\nNaja ansonsten halt so dies und das. Vielleicht passiert ja heute was tolles, hab schon gelesen, dass Trump einen guten weiteren Grundstein für einen neuen großen Krieg gelegt hat. Auf den Mann ist einfach verlass. Man könnte meinen für ihn wurde der Spruch \"hold my beer\" erschaffen.","replies":[{"poster":"4 For Maggie","date":"2019-03-26T07:59:48.280+0000","up_votes":1,"down_votes":0,"body":"**Nennenswerte Ereignisse aus der Vergangenheit am heutigen Tag**\n[Klick mich hier.](https://www.pisica.de/kalender/historische-ereignisse.php)\n\nKeine Ahnung ob sie wirklich nennenswert sind, aber es gibt tatsächlich eine Seite mit solch einer Auflistung. Naja. Auch wenn da nicht steht \"nennenswert\" sondern \"historisch\".\n\nDie Russen bekommen in nicht allzu ferner Zukunft 'Lost Ark' als Open Beta zu spielen.\nIch habe wirklich keine Ahnung warum die immer bevorzugt werden! Manipulation!\n\nIch habe nichts zu essen dabei -.- nichts befriedigendes! Ein Brot und 300g Mini-Tomaten.\nBisher noch nicht einmal ins Brot gebissen weil ... Wie soll das bis heute Abend reichen? >.&lt;\n\nAm Wochenende habe ich so richtig hart in meine Ranked rein geschissen. Alle Rankeds inkl. alle ARAMs verloren. Dafür Normals gewonnen -.- mit Lux Support. Dumm.\n\nDie Serie \"The Umbrella Academy\" ist ...  durchschaubar.\n\nFrau Pferd ist in Urlaub. Ich habe gestern so viel geschafft wie in den letzten drei Wochen nicht. Einfach komplett meinen Schrank aufgeräumt und alles aussortiert, einsortiert, umsortiert und weg geworfen was ich so gefunden habe. Das ging auch zuhause direkt weiter. Erst die Küche aufgeräumt und anschließend einen schwarzen Sack zur Hilfe genommen ... und Dinge weg geworfen. Aus meinem Sideboard im Schlafzimmer. Glaub vier Paar Schuhe sind weg geflogen (bzw. verschenkt weil die nur einmal getragen wurden x)) und meine alten Laptops und Tastaturen haben ihren Standort gewechselt. Jetzt muss das Sideboard nur noch ein wenig aufgeräumt werden.\n\nOder ich nehme mir einfach noch einen schwarzen Sack und schmeiß einfach alles rein. Ich bin wahnsinnig gut im weg werfen. Ist vergangenes Wochenende auch mit meiner LoL-Client \"Friendlist\" passiert. Gott hab ich die dezimiert. Wurd wirklich mal Zeit.\n\nKatze #1 ist rollig. Mittlerweile ist es fast vorbei aber HimmelHerrGottNochmal war das eine Tortur! Zumal ich das gar nicht einordnen konnte, weil meine bisherigen Katzen immer \"instant\" sterilisiert oder Kater waren. Die hat so komische Geräusche und Zuckungen gehabt das ich dachte die stirbt mir gleich weg. Hat auch nochmal richtig gut getan bei meinen angespannten ... wohl eher durchgebrannten ... Nerven. Glaub gestern Abend hat sie sogar mein Hündchen angegraben :&lt;\n\nP.S.\nHeute bin ich bisher eher wieder normal, sprich: faul. Hab noch nichts sinnvolles getan glaube ich. Außer über aktuelle Informationen bzgl. \"Lost Ark\" zu recherchieren. Und mir einen Trailer von dem Erkundungsspiel (?) \"Beyond Blue\". Das Spiel \"ABZU\" hat schon Spaß gemacht und \"Beyond Blue\" sieht noch besser aus. Aber mal abwarten. Hier ein [Trailer](https://www.youtube.com/watch?v=lh_dq7ER3T0)","replies":[{"poster":"Xayah Strife","date":"2019-03-26T09:25:13.425+0000","up_votes":1,"down_votes":0,"body":"Du hast echt deine Katzen nur sterilieren lassen?\nIch lese immer wieder das empfohlen wird Katze zu kastieren sowohl männliche als auch weibliche.\nWeibliche Katze die \"nur\" sterilisiert werden sollen immernoch rollig werden weil die sterilisation nur verhindert das dein Tier schwanger werden kann aber der Hormonhaushalt bleibt der gleiche bleibt.","replies":[{"poster":"4 For Maggie","date":"2019-03-26T09:40:31.658+0000","up_votes":1,"down_votes":0,"body":"Sterilisation: Weibchen\nKastration: Männchen\n\nDeswegen sage ich Sterilisation °^° Aber natürlich lassen wir sie kastrieren.","replies":[{"poster":"Xayah Strife","date":"2019-03-26T10:07:52.806+0000","up_votes":1,"down_votes":0,"body":"Ne beide Geschlechter können sowohl sterilisiert als auch kastiert werden. \nDer wichtig Unterschied ist das bei einer Kastration mehr rausgeschnitten wird damit das Tier keine Hormone mehr produzieren kann. \nDas schützt nicht nur vor Krankheiten wie Gebärmutterkrebs es verhindert auch das ein Tier sein geschlechtsübliches Verhalten an der Tag liegt. Kater markieren nichtmehr Katzen werden nichtmehr rollig. Was ja keinen nutzen hätten wenn das Tier eh unfruchtbar ist.","replies":[{"poster":"Asulia","date":"2019-03-26T11:24:16.283+0000","up_votes":1,"down_votes":0,"body":"Mehr?\nWir haben da alles rausgeholt.\nAllerdings auf der Farm mit den kleinen Schweinchen.\nDas war krass, muss Ich euch grad mal schocken.\nSagt meine Tante morgens, heute werden die Schweine kastriert.\nDenk ich mir nix bei.\nDann wurde ne Leiter an die Wand gestellt, ein Eimer daneben.\nUnd zappzerapp mit ner Schlaufe hing das kleine Schweinchen am der Hinterpfote and der Leiter runter, ein Schnitt, mit 2 Fingern rein, die Samenleiter lang die kleinen Hödchen, ein schnipp und zack wars kastriert, und jetzt Du hat hieß es. 200 kleine Schweinchen.\nDie Schreie hör Ich heut noch, das war echt grausam.\n\nJaja, die Landwirtschaft, nix für Weicheier.\n\nSchafe haben ein Gummi an den Schwanz (den hinteren) bekommen, da ist der dann nach ein paar Wochen abgefallen, weil der nicht mehr durchblutet wurde. Und schon hat man sich das saubermachen der Hinterteile gespaart, die alle 2 Wochen zugeschissen waren und Ich mit ner Schere die verkaggte Wolle entfernen musste.\nOder Hörnerbrennen, hmm das ist ein Geruch und dann heißt es \"Supper is ready\"\n\nHabt Ihr mal im Sommer in einem Wohnwagen gelebt, dabei Schafe gehütet und bei einer großen Herde fallen auch Abgänge an, die hatte mein Chef in nem Hänger gelagert, bis der Kadaverbeseitigungsdienst kam.\nIm Hochsommer.\n10 Meter neben dem Wohnwagen.\n6 Wochen in Verwesungsgeruch geschlafen, dann bin Ich da weg.\n\nAber cool ist zB ein Lämmer-Mantel. Die meisten Schafe werfen ja 2 Lämmer und wenn da ne totgeburt dabei ist und du ein anderes Schaf hast, wo die Mutter das Lamm nicht akzeptiert, dann kriegt das einfach die Haut mit Fell von der Totgeburt angezogen am Bauch vernäht, wie ein Mantel und schon wird das Lamm von der Mutter akzeptiert, weil die ja nach Ihrem Wurf riecht. \n\nAch ja Ich glaub Ich hör lieber auf,  das wird sonst zu eklig ;o)\n\nhttps://abload.de/img/imag0059ksjaz.jpg","replies":[{"poster":"Metalmonni","date":"2019-03-26T11:30:09.424+0000","up_votes":1,"down_votes":0,"body":"Alter ist das eklig xD.\n\nWas zeigt mir dieses Bild?","replies":[{"poster":"Xayah Strife","date":"2019-03-26T11:52:18.697+0000","up_votes":1,"down_votes":0,"body":"Hey Metalmonni dich hab ich auch schon lange nichtmehr gesehen hier.^^","replies":[{"poster":"Metalmonni","date":"2019-03-26T12:40:44.677+0000","up_votes":1,"down_votes":0,"body":"Gestern xD","replies":[{"poster":"Xayah Strife","date":"2019-03-26T12:48:51.121+0000","up_votes":1,"down_votes":0,"body":"häh? Gestern hab ich mich eigentlich nur mit Martin und Max unterhalten. \nDer Thread von gestern war auch eher weniger erfolgreich.","replies":[{"poster":"Metalmonni","date":"2019-03-26T20:54:42.700+0000","up_votes":1,"down_votes":0,"body":"richtig, *gestern* war ich ja auch nicht da xD","replies":[]}]}]}]},{"poster":"Asulia","date":"2019-03-26T11:38:02.807+0000","up_votes":1,"down_votes":0,"body":"Meinen Kiwi und die Flaschenlämmer. \nDer hat die adoptiert und die ne Mama gebraucht.\nDie waren echt geil, Ich hab die ja mit der Flasche gefüttert und war daher die Mama, Ich bin einfach auf die Wiese und hab Määääh gemacht da kamen die schon angerannt und wollten gefüttert werden. \nWo wir in Köln/Leverkusen gehütet haben, konntest da voll die Show mit denen machen. \nDie Leut die da am Rhein spazieren gingen fanden das herzallerliebst.\nAch ja, die Flaschis.\nWar immer traurig wenn Ich die abends eingezäunt habs und feierabend gemacht hab, die standen immer jammernd am Zaun, heul^^\nhttps://abload.de/img/imag0062yhjww.jpg","replies":[{"poster":"Metalmonni","date":"2019-03-26T11:39:41.403+0000","up_votes":1,"down_votes":0,"body":"Das ist irgendwie schon niedlich ^^","replies":[]}]}]}]},{"poster":"4 For Maggie","date":"2019-03-26T10:11:34.784+0000","up_votes":1,"down_votes":0,"body":"Ja.\n\nTrotzdem sag ich einfach sterilisieren wegen 'Weibchen' XD \n\nFrüher wenn mal eine OP anstand oder sonstige Untersuchungen habe ich auch zu meiner Mama gesagt \"Ich will aber eingeschläfert werden wenn der das macht\" ... war immer lustig für die Arzthelferinnen >.&lt; Da meinte ich aber natürlich die Narkose.","replies":[{"poster":"Xayah Strife","date":"2019-03-26T10:25:03.955+0000","up_votes":1,"down_votes":0,"body":"das darf du gerne sagen. :) \n\n:D Narkose ja ich hasse sie. \nJedesmal wenn eine Zahnop ansteht will ich die Spritze. \nUnd egal wie oft die Ärztin sagt das es nicht wehtut ich will diese Spritze!!! \nLetzte Sommer hatte ich das Gefühl das sie mich verarschen wollte. \nDa hat die Spritze nämlich nicht gut gewirkt und die Schmerzen waren ekelhaft. \nAber danach als ich fertig war wirkt die scheisse aufeinmal und mein Mund ist den halben Tag taub.","replies":[{"poster":"4 For Maggie","date":"2019-03-26T10:53:37.580+0000","up_votes":1,"down_votes":0,"body":"März 2018 habe ich mir alle Weisheitszähne ziehen lassen. Mit Vollnarkose. War der wohl größte Fehler den ich hätte machen können >.&lt; Einfach mehr Probleme als vorher. Meine Panik an dem Tag war so groß das ich fast den Termin abgesagt hätte ... aber mein dummes \"Ziehs einfach durch\" bringt mich irgendwann noch um! Manchmal ist eine Flucht doch der einzige Weg!\n\nSonst habe ich da zum Glück keine Problemchen. Noch nie gebohrt bekommen o.ä. \\o/ Würde man versuchen mir eine Spritze in den Mund zu jagen, würde ich weg rennen. Definitiv. Aber mir sind zweimal Stückchen von 'nem Zahn abgebrochen XD Beide Male dank diesem verkackten Zungenpiercing das mittlerweile der Vergangenheit angehört! Also war das schlimmste bisher die OP und 'schleifen und verspachteln' XD","replies":[{"poster":"Xayah Strife","date":"2019-03-26T11:23:31.269+0000","up_votes":1,"down_votes":0,"body":"Mit dem Thema hab ich mich noch nie auseinander gestetzt. Ich weiß nichtmal ob ich Weisheitszähne habe. :D Bisher haben die noch nicht an meine Tür geklopft um Hallo zu sagen und ich hoffe das bleibt auch so. \nObwohl ich davon schon viele Horrorgeschichten gehört habe....>.&lt; \n\nIch habe ständig Probleme mit meinen. :( \nDas waren mehrere Löcher letztes Jahr und bei einem hab ich fast geheult vor Schmerzen. \nIch frage dann so ob das ein tiefes Loch war und meine Ärztin nur ganz trocken: \"Das war mitteltief\"\nOmg wie fühl sich dann ein richtig tiefes Loch an? Dann brauch ja 10 Spritzen. \nUnd wenn du trotz einer Spritze noch Schmerz fühlt und das kennst dann nimmst du immer die Spritze glaub mir.","replies":[]}]}]}]}]}]}]},{"poster":"Xayah Strife","date":"2019-03-26T08:41:15.408+0000","up_votes":1,"down_votes":0,"body":"Es ist schön dich wiederzusehen. :) \nMeine Rankeds waren auch eher durchwachsen :D\n2x gegen einen Gegner verloren wo der ADC afk war...klar der Support geht an den Tower und mein Team feeder rein und ich kann nichts machen.\nIch bin zwar keine Elo gedroppt aber nicht wirklich weitergekommen. Ich hab auch mit allen 4 Accounts gespielt die Rankedgerechtig sind. :D \nObwohl sich Bronze atm teilweise mehr wie Silber anfühlt. Einige Leute können schon krass farmen und auf der Botlane wird selten hyperoffensive gespielt, die Leute gehen auch mal für ein defensiven Move. \n\nBtw heute ist die Abstimmung über die Urheberrechtsreform ich bin gespannt.","replies":[{"poster":"00 M4ddin 00","date":"2019-03-26T09:07:51.079+0000","up_votes":1,"down_votes":0,"body":"Ach das ist doch alles schon entschieden. \nDie machen das nur um uns im Glauben zu lassen das regiert wird ...","replies":[{"poster":"Uranbrennstab","date":"2019-03-26T09:13:22.162+0000","up_votes":1,"down_votes":0,"body":"Waaaaas? Lobbyismus > Demokratie? Erzähl doch nicht...","replies":[{"poster":"Metalmonni","date":"2019-03-26T10:52:40.268+0000","up_votes":1,"down_votes":0,"body":"Jetzt hör doch auf mit deiner Ironie, du gekaufter Demonstranten Bot!","replies":[{"poster":"Uranbrennstab","date":"2019-03-26T10:56:12.320+0000","up_votes":1,"down_votes":0,"body":"Als ob ich demonstrieren war. Ich verschwende doch nicht meine Zeit.","replies":[{"poster":"Metalmonni","date":"2019-03-26T10:58:29.376+0000","up_votes":1,"down_votes":0,"body":"Das ist alles Energie die man in Waffen stecken könnte!!!","replies":[{"poster":"Uranbrennstab","date":"2019-03-26T10:59:43.986+0000","up_votes":1,"down_votes":0,"body":"Friedliche Proteste haben noch nie irgendwas bewegt.","replies":[{"poster":"00 M4ddin 00","date":"2019-03-26T12:21:31.118+0000","up_votes":1,"down_votes":0,"body":"Tja was will man von unseren \"politikern\" auch erwarten","replies":[{"poster":"Uranbrennstab","date":"2019-03-26T12:24:46.199+0000","up_votes":1,"down_votes":0,"body":"Unerwartet. Sie haben die Reform 1:1 so durchgewunken wie sie geplant war.\n\n*surprised pikatchu meme*\n\nDas überrascht mich jetzt sehr und mein Glauben in die Demokratie ist nachhaltig...\nOkay ich kann bei sowas nicht ernst bleiben. Vielleicht kaufen sich die naiven Schafe endlich Warnwesten und machen mal einen sinnvollen Protest.","replies":[{"poster":"4 For Maggie","date":"2019-03-26T12:28:15.883+0000","up_votes":1,"down_votes":0,"body":"°^° PIKACHU","replies":[{"poster":"Uranbrennstab","date":"2019-03-26T12:31:14.536+0000","up_votes":1,"down_votes":0,"body":"Wie meinen?","replies":[{"poster":"4 For Maggie","date":"2019-03-26T12:36:16.878+0000","up_votes":1,"down_votes":0,"body":"Du Nudel hast es mit 't' geschrieben c.c","replies":[{"poster":"Uranbrennstab","date":"2019-03-26T12:37:45.531+0000","up_votes":1,"down_votes":0,"body":"Ah, I see","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Xayah Strife","date":"2019-03-26T09:20:33.286+0000","up_votes":1,"down_votes":0,"body":"Ich glaube nicht.^^\nIch schaue die Debatte gerade im Livestream an.","replies":[{"poster":"00 M4ddin 00","date":"2019-03-26T09:26:32.623+0000","up_votes":1,"down_votes":0,"body":"Ja und Millionen von Menschen schauen Wrestling live im Fernsehen an ;) \n\nAlso ja was soll ich sagen ^^","replies":[{"poster":"Xayah Strife","date":"2019-03-26T09:39:14.298+0000","up_votes":1,"down_votes":0,"body":"du könntest ein super langes Wort sagen was ultra cool klingt weil es so lang ist. \nSowas wie Kraftfuttermischstation^^","replies":[{"poster":"00 M4ddin 00","date":"2019-03-26T09:48:02.540+0000","up_votes":1,"down_votes":0,"body":"Bezirksschornsteinfegermeister","replies":[]},{"poster":"Uranbrennstab","date":"2019-03-26T09:44:44.181+0000","up_votes":1,"down_votes":0,"body":"Hippopotomonstrosesquippedaliophobie","replies":[{"poster":"00 M4ddin 00","date":"2019-03-26T09:47:26.368+0000","up_votes":1,"down_votes":0,"body":"Verklickt","replies":[]}]}]}]}]}]}]}]},{"poster":"INoKami","date":"2019-03-26T15:28:58.712+0000","up_votes":1,"down_votes":0,"body":"**[Der TGSG-Blog] Geschichten eines Azubis, Tag 132**\n\nFür einen Moment dachte ich, die Woche wäre schon gelaufen. Ein neuer Analytik-Test und treue Leser dürften mittlerweile wissen: Analytik f _*_ ckt hart. Aber der Test war doch ein bisschen entspannter als gedacht und damit dürfte ich wieder ein mal dem Förderkurs erfolgreich ausgewichen sein :D\nAber noch ist ja die Woche nicht vorbei, das Labor wartet ja noch und... Überraschung! Noch ein Kolloquium! Hier seien noch ein, zwei Worte dazu gesagt, denn am Anfang des Semesters wurde uns gesagt, dass es 5 Kolloquien geben wird und einige unangekündigte für einige ausgewählte Pechvögel, wie letztes Semester. Ok, 5 Kolloquien... was wird wohl Otto-Normalmensch denken? Die 5 Tests werden schön über das Semester verteilt, so wie jeder andere Test auch.\nSchön wär´s.\nDas ist jetzt das dritte Kolloq innerhalb von drei Wochen, also ja, wir haben jetzt jede Woche eins geschrieben. Nur wird dieser Takt unmöglich einzuhalten sein, denn die Kolloquien sind immer abgestimmt mit dem, was wir im Labor machen (sollten), aber spätestens ab nächster Woche wird das nicht mehr hinhauen, denn dann werden die Kolloquien der Laborarbeit voraus sein. Und spätestens da wird es schlechte Noten hageln... als wenn das nicht längst schon passiert wäre xD\nKeine Ahnung, wollte das nur mal erwähnt haben.\n\nSoeben noch beim Arzt gewesen, weil sich eine kleine Nachwirkung meiner Erkältung hartnäckig hält. Hatte jetzt aber nicht wirklich das Gefühl, er würde mich \"ernst\" nehmen. Ein Mal kurz abgehört, ´ne Ibu verschrieben und mich verabschiedet mit: \"Wenn´s in 2-3 Wochen noch so bleibt, kommen sie nochmal!\" Hm... nicht sonderlich überzeugend. Ist aber laut meinen Eltern der beste Arzt der Stadt, also viel Alternativen gäbe es dementsprechend auch nicht. Schauen wir mal.","replies":[]},{"poster":"4 For Maggie","date":"2019-03-26T08:26:13.131+0000","up_votes":1,"down_votes":0,"body":"Ich empfehle übrigens das Browserspiel **Drachenblut 2**\n\nLeague of Angels muss ich mir auch noch anschauen °^° Könnte für die nächsten Nachmittage oder Freitag (wenn ich da noch alleine bin) relevant werden!","replies":[{"poster":"Uranbrennstab","date":"2019-03-26T12:58:41.172+0000","up_votes":1,"down_votes":0,"body":"Darkness Rising ist ein ganz interessantes Handygame. Halt ein Korea grinder. Mit allem was einen Korea Grinder ausmacht. Ein unverständliches Crafting System, unendlich viele Timesink Möglichkeiten, ansprechende Charakterdesigns, ansprechende Kostüme für ein noch viel mehr ansprechendes Charakterdesign...\nMan kennt es.","replies":[{"poster":"4 For Maggie","date":"2019-03-26T13:18:21.996+0000","up_votes":1,"down_votes":0,"body":"Handyspiele sind doof. Außer Pokemon GO :D","replies":[{"poster":"Xayah Strife","date":"2019-03-26T13:33:16.648+0000","up_votes":1,"down_votes":0,"body":"Ne das gibt auch Bloons Tower defense für das Handy.\nDas spiel ich immer auf meinen Zugfahrten.","replies":[]}]}]}]},{"poster":"00 M4ddin 00","date":"2019-03-26T12:23:50.552+0000","up_votes":1,"down_votes":0,"body":"Ich erwähne es jetzt einfach mal das Artikel 13 beschlossen wurde.... schreibt man das so ?","replies":[{"poster":"Uranbrennstab","date":"2019-03-26T12:25:30.437+0000","up_votes":1,"down_votes":0,"body":"Oh neim imma han i die bech.","replies":[]}]},{"poster":"Uranbrennstab","date":"2019-03-26T11:12:00.687+0000","up_votes":1,"down_votes":0,"body":"01010000 01110010 01100001 01101001 01110011 01100101\n\n01110100 01101000 01100101\n\n01001111 01101101 01101110 01101001 01110011 01110011 01101001 01100001 01101000","replies":[{"poster":"Metalmonni","date":"2019-03-26T11:22:04.517+0000","up_votes":1,"down_votes":0,"body":"Blood for the Bloodgod!!!","replies":[{"poster":"Uranbrennstab","date":"2019-03-26T11:24:31.403+0000","up_votes":1,"down_votes":0,"body":"*nods in Nurgle*\nAll is Ash \nAll is Ash \nAll is Ash","replies":[{"poster":"00 M4ddin 00","date":"2019-03-26T12:22:14.425+0000","up_votes":1,"down_votes":0,"body":"Groovy ^^","replies":[]}]}]}]},{"poster":"Maexle","date":"2019-03-26T11:25:22.583+0000","up_votes":1,"down_votes":0,"body":"Guten Morgen. \n{{champion:17}}","replies":[{"poster":"Uranbrennstab","date":"2019-03-26T11:33:50.651+0000","up_votes":1,"down_votes":0,"body":"Hello there","replies":[{"poster":"Maexle","date":"2019-03-26T11:37:52.864+0000","up_votes":1,"down_votes":0,"body":"Ich glaube übrigens, dass es dumme Fragen gibt. Es kommt aber auf die Person an, die die Frage beantworten soll. Dein Beispiel oben hat das wunderbar gezeigt.\n\n{{champion:17}}","replies":[]}]}]},{"poster":"Metalmonni","date":"2019-03-26T10:48:02.695+0000","up_votes":1,"down_votes":0,"body":"Als mein Kätzchen mich gestern genervt hat, als ich was am Nageln war, hab ich ihr ganz leicht mit dem Hammer auf das Köpfchen gehauen... \nAllerdings hat es dann doch sehr laut *Plonk* gemacht und ich hatte Angst, dann ich zu feste gehauen habe.\n\nDanach hat sie aber angefangen zu schnurren und den Hammer abzulecken, wird also irgendwie okay gewesen sein xD","replies":[]}]}