{"poster":"Bolraguard","date":"2018-07-02T04:55:45.568+0000","title":"Will Riot ever accept a player made Champion, or will they be ignored due to legal reasons?","subforum":"Concepts & Creations","up_votes":4,"down_votes":1,"body":"I would like to know if Riot has ever used community creations to create a champion, or is this just a fun area for us to give ideas that for legal reasons will never be able to be used?\n\nEDIT: I am specifically talking about Champion concepts not Skin ideas.","replies":[{"poster":"Quiet Dude","date":"2018-07-02T07:26:46.418+0000","up_votes":2,"down_votes":0,"body":"Riot can only have so many “Reaper, the death reaper” concepts before it becomes redundant. I think some form of reaper concept is the most popular thing I see on here","replies":[]},{"poster":"Bolraguard","date":"2018-07-02T05:01:56.504+0000","up_votes":2,"down_votes":0,"body":"Can you give me an example? I would love to see what the community has created that they used. Even for inspiration.","replies":[{"poster":"Beached Manatee","date":"2018-07-02T19:56:41.071+0000","up_votes":1,"down_votes":0,"body":"Aurelion Sol is the obvious one","replies":[]},{"poster":"Terozu","date":"2018-07-02T17:33:20.747+0000","up_votes":1,"down_votes":0,"body":"No Kindred isnt.","replies":[]},{"poster":"CauseSCIENCE","date":"2018-07-02T07:21:10.460+0000","up_votes":1,"down_votes":1,"body":"Kindred is one","replies":[]}]},{"poster":"MagicFlyingLlama","date":"2018-07-02T04:59:46.888+0000","up_votes":2,"down_votes":0,"body":"Very few concepts even remotely pass quality requirements, while also fitting into the world and a space in the (meta)game, and riot has clarified that legal issues are a problem for fan skins.\n\nSome of the more popular ideas do seem to be used as inspiration, sometimes.","replies":[{"poster":"DaBlackWizza77","date":"2018-07-02T07:13:52.488+0000","up_votes":1,"down_votes":0,"body":"Yes I do have the same question. If I post a champion idea on the forum is there even a remote chance Riot could turn it into a real life champion?","replies":[]}]},{"poster":"ezakel","date":"2018-07-03T06:34:19.710+0000","up_votes":1,"down_votes":0,"body":"A yordle that dual wield swords would be sweet. His q could be a double slash that puts a debuff of sorts on the enemy. His w could be a attack speed/movement speed buff/passive. His e could an engage of sorts. And R could be reflecting phycical damage back at the enemy. Also should come out with a deadpool type skin lol.","replies":[]},{"poster":"Ýones","date":"2018-07-02T19:27:53.504+0000","up_votes":1,"down_votes":0,"body":"All concepts in the boards are completely theoretical and might not work in the game if they're ever imported there.","replies":[]},{"poster":"nyakasgoods","date":"2018-07-02T16:26:38.066+0000","up_votes":1,"down_votes":0,"body":"I think in the tos it specifically states that any suggestions directed at Riot are made with the understanding that if any of them are taken, the suggester gives up all rights to the concept and is not entitled to any form of compensation or credit if the concept goes through. \n\nSo yeah, Riot's in the clear.","replies":[]}]}