{"poster":"UnknownEV","date":"2015-09-08T08:15:30.273+0000","title":"--------- Torri? Visione? Draghi? Obbiettivi?? Che schifo, preferisco le kill. Cit.","subforum":"Discussioni generali","up_votes":5,"down_votes":2,"body":"Imparate a comprarvi ---------------&gt; {{item:2043}} \r\n---\r\nNON solo il Support deve controllare la mappa! {{item:2049}} {{item:3364}} \r\n5 di queste {{item:2043}} (una per ogni componente del team)  messe correttamente vi evitano la morte, facendo PERDERE del tempo e gold{{item:3069}}  al nemico.\r\n---\r\nNon lasciate gli &quot;obbiettivi&quot; scoperti senza vision, e provate a contestarli &deg;-&deg;\r\n---\r\n{{summoner:2}}  &lt;----------- (Mai usato sto coso)... ma voi ADC usate questa {{item:3342}} non lasciate il vostro {{item:3340}} inutilizzato... solo perch&egrave; &quot;avete un support&quot;\r\n---\r\nMi sa che la maggior parte di chi gioca... DOVREBBE giocare le {{summoner:17}}  DOMINION {{summoner:17}} cosi impara una buona volta che per vincere non servono le kill (anche se aiutano) ma gli obbiettivi. \r\n\r\nTorri. \r\nDraghi.\r\nViSion ({{champion:254}} {{champion:14}} &deg;fugge&deg;)\r\n---\r\nNon &egrave; illegale aprire post per aiutare a capire cosa &egrave; importante in un game &deg;u&deg;\r\nDetto questo {{summoner:6}} Buon game!","replies":[{"poster":"Ste the ripper","date":"2015-09-08T08:26:17.372+0000","up_votes":9,"down_votes":3,"body":"Non ho capito il senso del post, né la correlazione tra cosa hai scritto e il sondaggio...\nComunque il drake conviene se muore 1 solo, massimo massimo 2, oltre no ( a meno che ovviamente non muoiano anche dei nemici).\nNel caso muoiano 2 bisogna valutare che fase della partita è e che drago era, perché se era il 5° drago è un conto, se era il 2° un altro ( intendo sia che lo fosse per te o che lo fosse per il nemico), inoltre se morti 2 non hai più le forze di contestare l'avversario e quello va a prendersi l'inib/ baron è un altro paio di maniche ancora.\nQuindi una risposta netta non c'è, diciamo che mediamente se muore 1 solo va bene, 2 bisogna fare i conti.","replies":[{"poster":"UnknownEV","date":"2015-09-08T09:56:35.124+0000","up_votes":2,"down_votes":1,"body":"Il senso del post era SOLO per ricordare gli obbiettivi, dato che nelle ultime partite trovo gente che se ne frega di mettere vision o fare draghi ^^\" tutto qui. \nNon mi sembra cosi grave...\nil sondaggio bho... era cosi a caso","replies":[]}]},{"poster":"UnknownEV","date":"2015-09-09T07:44:53.209+0000","up_votes":3,"down_votes":0,"body":"Voglio salutare il \"solitario\" che mette -1 a TUTTI quelli che commentano qui :) \nSpero ti stia divertendo C:\nContinua a killare e killare... SENZA obbiettivi e poi perdere al minuto 50 C:","replies":[]},{"poster":"Exploooooosion","date":"2015-09-08T10:01:20.372+0000","up_votes":3,"down_votes":1,"body":"1 morte per un drago è anche buono considerando che è un bonus per tutto il team ma già morirci in 2-3 e rischiare al 50% di non prendere il drago non è molto buono specie se il tuo jng è morto.\nLe pink 5 sono giuste .\nLa sfera blue per gli adc è buona ma non per tutti (es su tristana non è molto utile)\nEssenzialmente le cose più importanti in ordine sono:\n1)Farm la farm è l'elemento essenziale del gioco e senza di questo non vai da nessuna parte;\n2)Inebitore, che da : 1) vantaggio strategico, 2) rallenta i nemici quando devono pushare quella linea e 3) possono farti prendere le ultime 2 torri;\n3) Baron, che aumenta il potenziale sia del tuo team che dei minion senza contare che da 300 soldini a tutti e aiuta notevolmente nel push;\n4) Torri, prendere una torre è sempre buono ma ovviamente non ci possono morire in 5 per prenderne una e allo stesso tempo non possono morire in 4 per difenderla;\n5) Drago, utile per il bonus iniziale del 6% e ottimo se riesci a farli tutti e 5 ( o siete forti voi o veramente tardi i nemici);\n6)Le tanto amate kill, quando killi un nemico guadagni oro extra e fai perdere farm e livelli al tuo nemico ma nota bene che non puoi costruire il tuo intero game solo sulle kill;\n7) Piccioni e lupi nemici, l'elemento essenziale sulla quale ogni team destinato a perdere concentrerà tutte le proprie energie nel fottere questi campi al jng nemico fregandosene di prendere inebitori baron torri ecc.\n","replies":[{"poster":"UnknownEV","date":"2015-09-08T10:07:38.801+0000","up_votes":1,"down_votes":1,"body":"Bhe... dato che io tengo sempre controllato il drago, se i nemici se lo stanno facendo non glielo lascio cosi' facilmente...\nE' un obbiettivo importante... poi bhe c'è gente (non faccio nomi) che preferisce le kill... e NON colpisce le torri o rincorre fino a morire D:\n---\nOk, è un altro discorso questo... ma ho fatto il post solo per ricordare che è un gioco a squadre e di OBBIETTIVI c:","replies":[{"poster":"Exploooooosion","date":"2015-09-08T10:14:17.623+0000","up_votes":1,"down_votes":1,"body":"Fare facilmente no tenti comunque di stillarlo, ma non è possibile che muore il 50% del team facendolo","replies":[{"poster":"UnknownEV","date":"2015-09-08T10:17:51.241+0000","up_votes":1,"down_votes":1,"body":"Be ovvio xD\nsolo che vedo a volte...  che NON ci provano neanche a prenderlo... gente che se ne frega degli obbiettivi... \n---\n la Odio... e dovrebbe essere costretta a giocare le {{summoner:17}}  DOMINION.{{summoner:17}}","replies":[{"poster":"MasterErmes7206","date":"2015-09-08T20:08:14.170+0000","up_votes":2,"down_votes":1,"body":"Dovrebbero fare una punizione per chi viene reportato per \"non aiuta la squadra a prendere gli obbiettivi\" dove ti fanno fare 10/20/40 Dominion","replies":[]},{"poster":"73668109_DEL","date":"2015-09-08T17:21:05.501+0000","up_votes":2,"down_votes":2,"body":"Semplicemente , se ci provi e fallisci hai solo peggiorato le cose , bisogna capire la % rischio/riusciata.\nUn lee sin puo' entrare 1 vs 5 con la Q e uscire grazie al ward jump , puo' provare facilmente a rubarlo e restare vivo.\nUna diana puo' entrare 1 vs 5 stelare il drago e morire .\nUn WW deve camminare/sprecare un flash per provare con poche possibilità di rubare un drago , se non ci riesce , ha usato flash perso il drago , dato 1 kill e 4 assist.","replies":[{"poster":"UnknownEV","date":"2015-09-09T07:39:15.338+0000","up_votes":1,"down_votes":1,"body":"Ovvio che uno non si \"butta\" dentro per prenderlo, ma dico da fuori spara qualcosa che ne so! invece bo... a volte vedo la bot lane (per esempio con jinx o ez) che manco spara la ulti perchè NON guarda la mappa e i ping o.o","replies":[{"poster":"73668109_DEL","date":"2015-09-09T17:03:37.441+0000","up_votes":1,"down_votes":0,"body":"Per rubare un drago di ulti , devi avere un danno maggiore dello smite , o un jungler nemico nabbo, altrimenti è inutile.\nPero' certo provare non costa nulla se non si rischia di morire","replies":[]}]}]}]}]}]}]},{"poster":"Pls Buff Shen","date":"2015-09-08T15:39:33.331+0000","up_votes":2,"down_votes":1,"body":"be... c'è un opzione molto più semplice {{champion:35}} Prendi drago senza danni :P","replies":[{"poster":"MasterErmes7206","date":"2015-09-08T20:10:09.191+0000","up_votes":2,"down_votes":1,"body":"Ehm {{champion:74}}","replies":[]}]},{"poster":"One Tax Man","date":"2015-09-08T14:59:38.456+0000","up_votes":2,"down_votes":1,"body":"Premettendo il fatto che sono greedy come pochi le kill non vincono i game. Gli obbiettivi vincono i game , e di sicuro non puoi controllarli senza vision.\nIo gioco spesso assassin e di conseguenza mi servono kill per snowballare , ma se poi non sfrutto quello vantaggio per assicurare/contestare obbiettivi tutte quelle kill non hanno senso.\nEvidentemente non tutti hanno capito questa cosa : si , le kill aiutano a vincere , ma non fanno vincere da sole.","replies":[{"poster":"UnknownEV","date":"2015-09-09T07:41:17.162+0000","up_votes":1,"down_votes":0,"body":"ESATTO. \nCercavo con  sto post di farlo capire :P","replies":[]}]},{"poster":"Sorcio84","date":"2015-09-08T13:31:44.603+0000","up_votes":2,"down_votes":1,"body":"Mi piace molto farmi il drago, soprattutto per primo, così gli avversari vengono messi subito in difficoltà e sotto pressione.\n\nUna volta steso l'inibitore, torno indietro e cerco di pushare un altra lane.\nPreferisco due inibitori giu e un attacco bello grosso al nexus nemico, che un solo inibitore giu con gli alleati che pushano fino a morire davanti ai nemici che li pelano e fanno su e giu dalla fontana, davanti alle torri del loro nexus.\n\nLa cosa comica (ma anche da piangere, incavolarsi, o lanciarsi addosso a un muro)\n...sono quegli alleati a cui pinghi pericolo /!\\ due volte e gli dici di ritirarsi non tornano indietro.\nPoi vengono gankati da 4 angoli, pingano aiuto, e 2s dopo sono morti.","replies":[{"poster":"UnknownEV","date":"2015-09-09T07:42:58.792+0000","up_votes":1,"down_votes":0,"body":"e poi ti reportano per non averli aiutati XD\n---\nCmq si... meglio tanti obbiettivi (2 inibitor ad esempio) che uno solo... e tentare di vincere SOLO in mid...","replies":[{"poster":"Sorcio84","date":"2015-09-09T11:27:27.910+0000","up_votes":1,"down_votes":0,"body":"esatto, solo perchè gli dico di tornare indietro, per evitare la perdita di un vantaggio... bho.\n\nLa più bella è stata :\nio {{champion:16}} in base con 2 inibitori giu che chiedo aiuto per far fuori i minion grossissimi. gli alleati : pensaci tu.\n(O-----------0) ...\n\nMancava solo un \"ommaigad niub soraka no damaggio usoless suhpp\"","replies":[]}]}]},{"poster":"Pasticcionex","date":"2015-09-08T21:26:29.487+0000","up_votes":1,"down_votes":0,"body":"per il 1 drago secondo me si perchè prendi il 6% del danno per gli altri tralasciando il 5 secondo me no.-.","replies":[{"poster":"UnknownEV","date":"2015-09-09T07:39:59.302+0000","up_votes":1,"down_votes":0,"body":"Devi fare 5 draghi XD non è che se il nemico ne ha 4 e tu lo uccidi... ne hai tu 5 xD","replies":[]}]},{"poster":"Shàdows","date":"2015-09-08T12:55:25.570+0000","up_votes":2,"down_votes":2,"body":"A Mio parare il post e importante non sapete come mi irrita quando giocano per le kill,e non sono pochi.ce il drake poi vedono il support  quasi senza vita e si fiondano in 4 su di lui,dico di  wardare il drake mentre io warda il baron ma che parlo con il muro,dico di farci prima l inib e poi il baron in modo da tenerli occupati mentre lo facciamo e di wardare sopratutto attorno al baron no loro vanno iniziano a farlo vengono lo stellano e ci uccidono tutti. vedo degli adc che appena vedono un support con poca vita,tipo 2 hit e muore si fionda su di lui consapevole che andra in 1 vs 4 e non si preucupa dei  cc posso capire un mid laner con una buona escape va be ci sta se lo fa una {{champion:7}}  ma l adc cazzo stai dietro ai tank e fai il culo.vedo anche dei mid laner  che vanno farmando senza wardarsi attorno poi vengono in 5 e bum!! esplode dovrebbero capire che stai perdendo non bisogna andare in faccia a una {{champion:92}}  feddata e invece giocare safe e farmare e  prima poi rischierà e ci morira o magari  aspetti la gank del tuo jungler.bisognerebbe wardare prima di counterjunglare poi arriva un {{champion:11}}  dal nulla tu mezza vita e ti apre il culo,bisognerebbe focusarre l adc e il mid laner non un {{champion:86}}  con 5000 hp bisognerebbe anche  comprarsi protezioni adeguate non sapete quante volte mi e capitato di giocare contro un team full ad e vedere il mio top laner con una {{item:3065}}  e  per quando spammasi la parola {{item:3075}}  c era il support che si faceva {{item:3190}},bisognerebbe fare qualcosa per far capire a gente che l obbiettivo e distruggere il nexus e non divare un {{champion:74}}  sotto torre che ha ultato la torretta mentre  ha la {{item:3157}}  e non ce nessuno minon a prendersi i primi danni.bisogna far capire che se il tuo avversaio a 3 kill e 20 di farm e tu stai con 0 kill e 3 morti ma con 80 di farm state alla pari.Certo anche io avvolte riskio un po per prendermi una kill ma lo faccio solo se so che facendo quell azione non sia cosi grave e capisco che sbaglio e cerco di migliorarmi.ci vuole un metodo per far capire a tutti i giocatori di lol che l importante sono gli obbiettivi non le kill.","replies":[{"poster":"UnknownEV","date":"2015-09-08T13:18:52.492+0000","up_votes":1,"down_votes":1,"body":"Infatti ho tentato di aprire questo post per far capire (anche se sembra che non ci sono riuscito)... che gli obbiettivi sono importanti! :)","replies":[{"poster":"Shàdows","date":"2015-09-08T14:46:42.526+0000","up_votes":1,"down_votes":2,"body":"no aspetta gli obbiettivi non sono importanti sono essenziali come il farm e la vision il kda e importante","replies":[]}]}]},{"poster":"ubercodlegend200","date":"2015-09-08T09:51:31.434+0000","up_votes":2,"down_votes":2,"body":"Ordine obbiettivi \n\nInibitor <Drago <Torre <Baron <Kill <polli <pink","replies":[{"poster":"UnknownEV","date":"2015-09-08T09:55:14.347+0000","up_votes":1,"down_votes":2,"body":"Ecco uno che non ha capito come giocare.\nInfatti prima si fa l'inibitor... si eh... Kappa c:","replies":[{"poster":"lucanomax1994","date":"2015-09-08T10:49:25.289+0000","up_votes":2,"down_votes":2,"body":"***","replies":[{"poster":"UnknownEV","date":"2015-09-08T12:40:54.973+0000","up_votes":1,"down_votes":2,"body":"Se non butti giù la torre però xD\n---\n(non sto dicendo niente a te. Ma leggi l'ordine di importanza che ha messo...)\n---\n\"Inibitor <Drago <Torre....\" lol","replies":[]}]}]}]}]}