{"poster":"Suizhiro","date":"2016-07-18T23:55:00.550+0000","title":"Se busca Asistente de Coach para equipo semi profesional","subforum":"Reclutamiento","up_votes":4,"down_votes":0,"body":"Buscamos un coach amateur el cual pueda asistir y trabajar en conjunto con nuestro coach principal\r\n\r\n2 Entrenadores (contandote a ti) al servicio de los jugadores y del equipo\r\n5 Jugadores en la plantilla y 1 en suplencia\r\nUn Manager del equipo\r\nUn servidor de &quot;ts3&quot; privado y oficial del equipo\r\nLos requisitos solicitados son:\r\n\r\nLos requisitos solicitados son:\r\n- Ser activo especialmente en los entrenamientos.\r\n- Tener un conocimiento del juego bastante amplio y conocer las estrategias y el meta actuales en este juego.\r\n- Poseer una actitud amena y colaboradora con el equipo.\r\n- Poseer Micr&oacute;fono y tener el programa &quot;TeamSpeak 3&quot; (El cual sera el programa de comunicaci&oacute;n determinado para los entrenamientos y torneos).\r\n\r\nEste equipo no busca un maestro (en otras palabras no nos importa tu liga) si no mas bien buscamos a alguien que sepa los conocimientos de este juego y sus calificaciones t&eacute;cnicas.\r\n\r\nEn este equipo valoramos la intervenci&oacute;n de una persona versada en este juego por lo que su palabra si obviamente sabe sera respetada, tambi&eacute;n se le oferecera regal&iacute;as de rRPdependiendo de los resultados de los torneos (todo sera negociable)\r\n\r\nPor ultimo saco con recalcar que este equipo no tolerara las malas actitudes por lo que si el postulante tiene una mala actitud ni siquiera deber&iacute;a pensar en postularse, nosotros vemos la actitud y la unidad como lo central para que el equipo funcione y progrese.\r\n\r\nLos que deseen postularse pueden comentar en esta publicaci&oacute;n y los agregare. Saludos y que tengan un buen resto del d&iacute;a.","replies":[{"poster":"Sethinho","date":"2016-07-20T17:06:55.117+0000","up_votes":1,"down_votes":0,"body":"Buenas, necesitan diseñador grafico y cm??? cualquier cosa me agregan n.n www.facebook.com/loupperoficial","replies":[]},{"poster":"YTcDreaM","date":"2016-07-19T23:56:27.274+0000","up_votes":1,"down_votes":0,"body":"Tambien me interesa, tengo experiencia como jugador en otros equipos, pero nunca del otro lado y me gustaria apoyar con mis conocimientos, al igual que mejorar con ust.","replies":[]},{"poster":"Tattein","date":"2016-07-19T01:54:43.433+0000","up_votes":1,"down_votes":0,"body":"Estoy interesado, mas que nada para ayudar y aprender al mismo tiempo :D","replies":[{"poster":"Suizhiro","date":"2016-07-19T17:14:46.549+0000","up_votes":1,"down_votes":0,"body":"Agregado","replies":[]}]}]}