{"poster":"Daughter of Nox","date":"2015-01-05T03:55:01.800+0000","title":"Does toxicity get any better in the higher ranks?","subforum":"[ARCHIVED] Miscellaneous","up_votes":2,"down_votes":1,"body":"Recently migrated here from Dawngate, which has unfortunately been closed. I had heard a lot of talk about LoL having a horrible community and downright awful players, etc. etc. However, I couldn't even begin to fathom how bad it really was. I cannot play a single game where there is not a troll, leaver, flamer, feeder (by feeder, I mean someone who is intentionally feeding, not someone who is just bad). I've tried, very adamantly, to be reasonable and friendly with all of the people I have come into contact with on LoL, but I feel exhausted. One of the largest points of tension is laning positions. A lot of people have this 'it is my way or the high way' attitude. I have only been playing for about a week and a half!\n\nWhat are your guy's opinions on in-game toxicity?\n\nWhat can we do to prevent/remedy it?\n\nDoes it get better as you progress through the game?\n\nLove and hugs,\nHecate","replies":[{"poster":"Narasimha","date":"2015-01-05T04:22:30.478+0000","up_votes":2,"down_votes":0,"body":"Not really, it just changes in variety.\n\nIn lower levels, people get angry because of a general lack of skill.\n\nThe higher you go, people get angry because someone made the one mistake that heavily impacted the game.","replies":[]},{"poster":"slipstreem","date":"2015-01-05T04:07:28.566+0000","up_votes":2,"down_votes":0,"body":"as a diamond 5 i can honestly tell you that plat 1-2 was the most fun I have ever had playing solo queue with solid teamwork but mistakes are still made aplenty, just people seem to be nicer about them happening after the fact. I was actually able to talk a lot of teammates back into playing games when they were raging and have positive conversations with most people... but plat 4-5 really really sucked in terms of toxicity as everyone was a \"diamond 1 smurf\" and just ruined game after game after game with toxicity(from both sides).. I rarely had a decent game in plat IV/V but nearly every game in Plat II/I was good even when we lost.  People were much more like.. \"whelp we lost, gg lets go the next game\" instead of spewing hatred.\n\nMy lone venture into diamond 3/diamond 4 mmr made it seem like it was reasonably low toxicity in relation to silver but you will NEVER ever be rid of people who think they know how to play the game better than you and like to tell you how to do your job.  People at that elo understand that it is entirely possible to get stomped in lane and it isn't because you are a terrible player, sometimes stuff just doesn't bounce your way and you just have to do what you can to help out later on.\n\nGold 2ish was decently fun as well as people are really wanting to reach plat but the plat V you get matched with around that same time are usually awful in terms of toxicity.\n\nI suggest a liberal use of the mute button if people are being really bad.  It is better to enjoy the game than deal with hatred.","replies":[{"poster":"Daughter of Nox","date":"2015-01-05T07:49:01.375+0000","up_votes":1,"down_votes":0,"body":"Thanks for your comment. It was super helpful. I'll be sure to keep that last suggestion in mind.","replies":[]}]},{"poster":"StegosaurusToast","date":"2015-01-05T03:59:43.014+0000","up_votes":1,"down_votes":1,"body":"toxicity doesn't dissapear from the game till like D1/Master \n\nand as a level 10 you are very far from that....\n\nif you need help just add my board name in league and i might be able to teach you a few tips\n\nnot today tho, gotta sleep soon","replies":[{"poster":"Sukishoo","date":"2015-01-05T04:01:35.710+0000","up_votes":2,"down_votes":0,"body":"Not even.\n\nPeople up there complain about it all the time.","replies":[{"poster":"StegosaurusToast","date":"2015-01-05T04:05:01.946+0000","up_votes":1,"down_votes":0,"body":"well they are more busy invading and doing pro plays than being asshats\n\nit's at least a little better than bronze V","replies":[{"poster":"Sukishoo","date":"2015-01-05T04:07:59.134+0000","up_votes":1,"down_votes":0,"body":"Anything is better than BV, but not by much","replies":[{"poster":"StegosaurusToast","date":"2015-01-05T04:16:57.411+0000","up_votes":1,"down_votes":0,"body":"i really think the trolls need their own tier, just to keep them from ruining games and raging\n\nmaybe having like 30 reports or 2 bans (not from q dodging) gets you in the tier and you have to get like 100 honor points to get out?","replies":[]}]}]}]},{"poster":"Daughter of Nox","date":"2015-01-05T07:49:35.183+0000","up_votes":1,"down_votes":0,"body":"Thank you for the offer, but I think I am fine. :)","replies":[]}]},{"poster":"pcfmYiJC8R","date":"2015-01-05T05:57:09.072+0000","up_votes":1,"down_votes":0,"body":"There is even toxicity in LCS matches.","replies":[{"poster":"Daughter of Nox","date":"2015-01-05T07:44:56.255+0000","up_votes":1,"down_votes":0,"body":"Forgive me, but I don't know what LCS stands for.","replies":[{"poster":"pcfmYiJC8R","date":"2015-01-05T08:11:46.114+0000","up_votes":1,"down_votes":0,"body":"League Champion Series,  it's professional players.","replies":[{"poster":"Daughter of Nox","date":"2015-01-05T18:52:00.575+0000","up_votes":1,"down_votes":0,"body":"Oh alright. Thanks a lot. Yeah, that is sad to hear.","replies":[{"poster":"pcfmYiJC8R","date":"2015-01-05T19:07:57.256+0000","up_votes":1,"down_votes":0,"body":"it's gaming in general where there is any aspect of competitive play.","replies":[{"poster":"Daughter of Nox","date":"2015-01-06T01:59:11.383+0000","up_votes":1,"down_votes":0,"body":"Right. I just don't feel as though that means we should stop striving to prevent it when we see it and committing ourselves to rise above that sort of behavior. Your last comment seemed dismissive of it, as if there is nothing that we could or should do about it. Forgive me if I misinterpreted it.","replies":[]}]}]}]}]}]},{"poster":"DSRM Mobius","date":"2015-01-05T04:00:01.398+0000","up_votes":1,"down_votes":0,"body":"nope doesn't get anybetter from where im standing\nunless you get to gold, plat or diamond then it is very good","replies":[]},{"poster":"Sukishoo","date":"2015-01-05T04:01:00.197+0000","up_votes":1,"down_votes":1,"body":"nope","replies":[]}]}