{"poster":"OkamiSuka","date":"2017-12-29T15:57:49.420+0000","title":"Primer Pick ???","subforum":"Charlas Generales","up_votes":5,"down_votes":3,"body":"Riot que pasa ????? 7/10 partidas soy primer Pick ..... sacamela un poquito \r\n\r\ny otra cosa... loco jueguen soporte si les toca ya aburren si entran con esas tonterias de &quot; hay no soy sup! ya perdimos&quot; \r\n\r\ncreo que deber&iacute;amos tener la posibilidad de dodgear y reportar la raz&oacute;n por la cual lo hicimos \r\nno es justo perder tanto tiempo por gente que en ranked no sabe jugar supp o te dice &quot; no tengo ningun sup voy yasuo &quot; \r\nes &quot;ranked&quot; osea competitivo no sean botones en vez de comprar skin comprense manos y un poco de materia gris","replies":[{"poster":"Rick Silence","date":"2017-12-29T16:31:41.709+0000","up_votes":3,"down_votes":0,"body":"Yo no tengo ese problema. Cuando rankeo voy seleccionando de línea primaria adc y de secundaria, supp. Así jamás el autocomodín coloca en supp a alguien que no lo sepa jugar. Funciona :3\nY lo mejor de todo es que con bastante frecuencia juego mi línea principal, no me coloca de supp demasiado seguido XD\nEl resto de las veces voy con dúo :p","replies":[]},{"poster":"Borriic III","date":"2017-12-29T21:49:34.750+0000","up_votes":1,"down_votes":0,"body":"ser primer pick igual tiene su lado bueno bro, puedes elegir tu main sin miedo a que lo saquen desde el otro lado y, **EN TEORIA**, tu pick debiese definir el estilo de juego a tomar para el resto de compañeros (onda si pickeaste una oriana tu jungla puede sacar un amumu y tu adc una mf para tener las tf ganadas o si fuiste zoe tu adc puede ser un varus y tu support una janna etc etc) osea, igual sabemos que eso no pasa mucho en elo bajo pero cuando subes mas se da mas seguido y esta bueno cuando el team se acopla a una estrategia, casi siempre es victoria segura :)","replies":[{"poster":"OkamiSuka","date":"2017-12-30T03:23:53.821+0000","up_votes":2,"down_votes":0,"body":"y si digo por mas counter pick que me hagan tengo la confianza de no fedear pero llega un punto que es molesto jugar a la defensiva, no poder farmear bien o rotar bien porque sabes que si te agarran te deletean o todo el rato con la presión de saber que si te adelantas estas muerto sea por la razón que sea ... la verdad que si, es difícil que alguien tenga en cuenta las composiciones para utilizar el campeón indicado","replies":[{"poster":"Borriic III","date":"2017-12-30T19:57:18.595+0000","up_votes":1,"down_votes":0,"body":"en ese sentido comparto completamente tu opinion, solo trataba de señalarte el lado mas positivo de las cosas, pero si, es tipico que te counterpickean siempre si sos primer pick\n\nlo unico que podria aconsejarte es que trates de banear los counter mas molestos al campeon que vas a jugar, onda baneas el mas hard tu y el resto tratas de negociarlos con el team, generalmente cuando voy teemo baneo pantheon y le pido al team si alguien puede banear vlad, no siempre pasa pero de vez en cuando el pibe que banea zed/yasuo por banear algo, te toma en cuenta y banea lo que le pediste","replies":[]}]}]},{"poster":"UnMainMordeTonto","date":"2017-12-29T17:25:22.990+0000","up_votes":1,"down_votes":0,"body":"El que no piensa eres tu. Las rankeds se juegan para dar TODO tu potencial y en una linea que no dominas eso no se puede. En lo especial solo voy soporte si se que mi team puede ganar sin que los carree, pero el rol que nunca jugaría es ADC, es mi peor rol y por ende si me toca es instat dodge. Nadie los puede obligar a jugar un rol que no saben, si probablemente al no conocer nada de un rol no subirán o se estancaran fácilmente, pero eso, que te importa a ti? Digo, si ves que pickean un Yasuo supp dodgea, son 3 LP menos y 5 m no es tanto.\n\nInformación sacada de esta guia: https://boards.las.leagueoflegends.com/es/c/guias-y-consejos/LoGlkvhR-la-mejor-guaua-de-league-of-legends-camo-subir-de-bronce-a-diamante-todo-explicado-100-paginas","replies":[{"poster":"Borriic III","date":"2017-12-29T21:46:32.686+0000","up_votes":2,"down_votes":0,"body":"suport no requiere ninguna habilidad, el rol es basicamente ayudar a otros a explotar su maximo potencial y el unico requisito minimo que requiere es ser capaz de pensar en el equipo (lo cual se supone igual haces si vas de las otras lineas)\n\npara mi cualquier jugador que me sale con la clasica \"no se jugar support\" basicamente me esta diciendo \"no se jugar y ya tienes uno menos en el team, ahora carreame con ese handicap\", generalmente verlos jugar confirma mi hipotesis, desde que pickean troll hasta el tipico 0/13/1 \"yo les dije que no sabia jugar support\"\n\nesas partidas antes que dodgearlas prefiero jugarlas y reportar a esos tipos, me alegra saber que ayudo a erradicar una plaga de jugadores toxicos que no trabajan en equipo, de hecho cada vez que me aparece el cartelito de jugador sancionado me alegra el dia :)","replies":[{"poster":"UnMainMordeTonto","date":"2017-12-29T23:58:46.972+0000","up_votes":2,"down_votes":0,"body":"El rol de soporte no requiere habilidad mecánica (Algunos campeones si) Pero requiere mas habilidad analitca (macrogame) que los otros roles. A mi me gusta jugar soporte, me hace sentir... Algo así como el líder del team, he carreado múltiples veces como soporte. \n\nY lo de dodgear, es lo mejor, no tiene sentido jugar esa partida.","replies":[{"poster":"Borriic III","date":"2017-12-30T20:03:40.652+0000","up_votes":1,"down_votes":0,"body":"no bro, requiere la misma habilidad analitica de los demas roles, solo que otorga un mayor margen de tiempo y error para aplicarla (osease es mas facil) , yo tambien disfruto jugar soporte, es el rol mas relajado, esta bueno eso de armar jugadas para el equipo o cubrir a alguien tan bien que leas en el chat all \"sup $%$% que molesto sos\", igualmente un suport no puede carrear, he salido de partidas onda 0/0/15 siendo suport con un 90% de contribucion en kills y objetivos pero aun asi esa partida no la carree yo, la carreo el adc/mid de turno al que yo ayude a brillar, el support no carrea porque no tiene el daño para tomar los objetivos, aunque puede ser de vital importancia ayudando a los que si tienen ese daño\n\ndodgear es lo mejor para el elo propio; jugarla y darle a riot 9 motivos mas para banear a un jugador toxico es lo mejor para la comunidad x)","replies":[]}]}]},{"poster":"OkamiSuka","date":"2017-12-30T04:14:51.890+0000","up_votes":1,"down_votes":0,"body":"si... yo me retiro de las partidas cuando noto un troll... pero todos los días? cola de baja prioridad es artante y no de 5 min ya me fume varias veces las de 20 min.. antes cambiaba de linea muy seguido pero es sencillo, ya lo sufrí el que no sabe jugar un rol el 80% de los casos hacen hasta lo imposible por perder","replies":[]}]},{"poster":"Sir Crucifix ll","date":"2017-12-29T22:06:44.928+0000","up_votes":1,"down_votes":2,"body":"jugar de support es un asco , todos farmeando llevando kills y vos con chupete y mamadera por toda la zona de guerra","replies":[{"poster":"UnMainMordeTonto","date":"2017-12-29T23:56:13.509+0000","up_votes":2,"down_votes":0,"body":"Que estupidez, el rol de soporte es el que tiene que pensar todo por el team, es mas, es el ADC el que tiene que seguirle y hacerle caso.","replies":[]},{"poster":"OkamiSuka","date":"2017-12-30T03:42:39.983+0000","up_votes":1,"down_votes":0,"body":"el rol de soporte es tan importante como cualquier otro, cuando no entiendes un rol ya no estas entendiendo gran parte del juego y aunque tal vez no te des cuenta muchas decisiones perjudican directa o indirectamente a un compañero de equipo.. y por que? porque no sabes lo que necesita tu compañero ya que no comprendes su rol... ejemplo... tu jg esta haciendo counter jg próximo a tu linea... vos te vas a base, te morís o lo que sea etc etc --- (dejas de generar presión) tu contrincante rota junto al otro jg y matan a tu jg .. tu jg le regala doble buff a tu contrincante... va a base.. compra... vuelve a linea y te mata... luego tu dices GG jg Y NO ENTIENDES porque paso eso..no solo eso, te gana en kill en farm en nivel, te tiene bajo torre, te divean, te la rompen, te stompean y solo podes pensar en culpar a tu jg y así hay muchas situaciones..","replies":[]}]},{"poster":"WhiteMax","date":"2017-12-29T16:02:29.030+0000","up_votes":1,"down_votes":1,"body":"Juga tu de sup (?).","replies":[{"poster":"OkamiSuka","date":"2017-12-29T16:29:37.353+0000","up_votes":1,"down_votes":0,"body":"juego de sup cuando me toca :) y lo juego como se debee","replies":[{"poster":"SpawnJ","date":"2017-12-29T17:18:03.348+0000","up_votes":1,"down_votes":0,"body":"veigar full ap empezando anillo de dorans?","replies":[{"poster":"OkamiSuka","date":"2017-12-30T03:14:50.055+0000","up_votes":1,"down_votes":0,"body":"justo ni comprado tengo a veigar xD juego soportes acorde a las composiciones","replies":[]}]}]}]}]}