{"poster":"Sinche","date":"2015-07-17T03:20:57.021+0000","title":"[DUDA] Ligas.","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Un amigo me dijo que de Oro V no se pod&iacute;a descender a Plata, y que de Plata V no se pod&iacute;a descender a Bronce aunque tengas 0 PL y pierdas muchas seguidas, eso es cierto? La verdad que no le veo sentido porque no podes morir en una liga, si sos malo te deben bajar de liga no?","replies":[{"poster":"Urgel","date":"2015-07-17T04:35:25.146+0000","up_votes":1,"down_votes":0,"body":"Yo subi a plata III hace una semana por ahi, y solo jugue tres partidas... ahora no ando jugando por el tema de la mala conexion a internet... pero si no juego medio mes ponele,,, tengo riesgo de bajar de liga?? o sea a bronce o plata V?","replies":[{"poster":"Black","date":"2015-07-17T18:35:12.922+0000","up_votes":1,"down_votes":0,"body":"Por 1 el primer mes sin jugar te quitan no recuerdo bien, pero unos 15 pts o algo así, y luego de eso siguen descontandote puntos cada 1 semana.","replies":[]}]},{"poster":"xBlackOut","date":"2015-07-17T07:27:56.711+0000","up_votes":1,"down_votes":0,"body":"Si se puede bajar de plata 5, oro 5, y cualquier liga si perdes varios games teniendo 0 lp,  esto no siempre fue asi, antes podias estar en oro 5 y perder, perder, trolear, perder, trolear, probar champs y no bajabas jamas, creo que eso lo cambiaron para que la gente que estaba en 5 no diga \"ah bueno, ya llegue hasta aca, ahora que no me bajan, hago lo que quiero\" Lo que no se puede es bajar de plata y oro por inactividad.","replies":[]},{"poster":"Resonances","date":"2015-07-17T03:52:33.562+0000","up_votes":1,"down_votes":0,"body":"No es cierto, de oro v y plata v no podes bajar por INACTIVIDAD solamente, pero si jugas y perdes teniendo 0 LP si bajas (plata v y oro v son las unicas ligas q no se baja por inactividad)","replies":[]},{"poster":"Jota312","date":"2015-07-17T03:25:33.003+0000","up_votes":1,"down_votes":0,"body":"Si te bajan eso si es mas dificil , ya que solo bajas si tu elo baja mucho (y para eso aveces es necesario perder muchisimo).\nCreo que ya no se baja por inactividad en ciertas ligas pero no recuerdo bien eso(esto lo puedes encontrar dentro del juego hay informacion) .\n\nSuerte :D","replies":[]}]}