{"poster":"Caliban90","date":"2016-03-15T14:01:19.402+0000","title":"Ma il report per abuso verbale funziona davvero?","subforum":"Discussioni generali","up_votes":3,"down_votes":1,"body":"Ciao a tutti. Ho appena perso una ranked, ero support con Morgana - che in teoria &egrave; il mio main, ma sta partita non azzeccavo una Q, lo ammetto, ma stavo cercando di rimediare, non fosse che sono stata ripetutamente offesa, ma offesa pesantemente. Lasciamo perdere che il jungler mi dicesse che faccio schifo e sono inutile, ma mi ha addirittura invitata ad ammazzarmi. Il mio adcarry, che tra l&#039;altro mi ha invitata a giocare, ha preso a offendermi dal minuto 3, dicendomi tipo che si scopa mia mamma. Pu&ograve; anche essere che il team avversario fosse pi&ugrave; bravo di noi? \nVorrei capire se davvero il report per abuso verbale funziona, perch&eacute; sono davvero stufa di avere a che fare con gente cos&igrave;. E no, mi spiace, non &egrave; &quot;sindrome dei sentimenti offesi&quot;, perch&eacute; mi sono anche sentita augurare il cancro, ma tanto quella che viene reportata per intentional feeding sono io, capite? Per intenderci, alla fine della partita il tizio mi ha scritto questo in chat privata:\n>[14:46]_ Teemo_: fy and fyour moragana \nfy and fyour moragana \nso noob fcker \n[14:46] Tsuki no Faith: wow\nyou are a mature person\ngg\n[14:46] _ Teemo_: i wanna put my dick into you\n[14:47] Tsuki no Faith: keep on offending me\nI will report everything to riot\n[14:47] _ Teemo_: bye\n\n\n_edit by mod_","replies":[{"poster":"Menfrix","date":"2016-03-15T19:36:03.140+0000","up_votes":2,"down_votes":1,"body":"Meh, quella è gente che ha seri problemi in testa... ignorali e reportali.\nSe cerchi summoners con cui giocare passa nella chat in game lolforumita, non che si trova sempre molta gente che accetti, ma non ho mai trovato tossici di quel calibro.","replies":[{"poster":"Caliban90","date":"2016-03-15T19:41:47.637+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Menfrix,realm=EUW,application-id=MJVj50Jw,discussion-id=eBivOowR,comment-id=0007,timestamp=2016-03-15T19:36:03.140+0000)\n>\n> Meh, quella è gente che ha seri problemi in testa... ignorati e reportali.\n> Se cerchi summoners con cui giocare passa nella chat in game lolforumita, non che si trova sempre molta gente che accetti, ma non ho mai trovato tossici di quel calibro.\n\nSpammano tanto \"get cancer\", ma penso che il cancro l'abbiano visto solo sull'oroscopo. Io non so come si faccia a permettere a gente così tossica di giocare.","replies":[]}]},{"poster":"Chroniicles","date":"2016-03-15T14:39:52.081+0000","up_votes":2,"down_votes":1,"body":"Se te la prendi per il rage di un bimbonutella qualunque, fai il suo gioco. Non dargli sta soddisfazione, ignoralo... prima o poi verrà bannato!\nPoi toccherà a noi sopportarlo sul forum, come è di moda aprirà un post dove osannerà la sua innocenza, flammerà chiunque tenti di instaurare un dialogo o cerchi di farlo ragionare. Prassi!","replies":[{"poster":"Caliban90","date":"2016-03-15T14:45:35.132+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Chroniicles,realm=EUW,application-id=MJVj50Jw,discussion-id=eBivOowR,comment-id=0004,timestamp=2016-03-15T14:39:52.081+0000)\n>\n> Se te la prendi per il rage di un bimbonutella qualunque, fai il suo gioco. Non dargli sta soddisfazione, ignoralo... prima o poi verrà bannato!\n> Poi toccherà a noi sopportarlo sul forum, come è di moda aprirà un post dove osannerà la sua innocenza, flammerà chiunque tenti di instaurare un dialogo o cerchi di farlo ragionare. Prassi!\n\nIo ho la tendenza a passarci sopra e a lasciar perdere, ripeto mi è stato augurato il cancro, ho taciuto, reportato e sono andata avanti. Ma vi renderete conto che alla lunga la voglia di giocare ranked passa.","replies":[{"poster":"Chroniicles","date":"2016-03-15T14:52:09.341+0000","up_votes":1,"down_votes":0,"body":"Giusto per sdrammatizzare, guarda tra i nuovi post aperti. Ho fatto in tempo a dirti questo che hanno aperto un topic del genere.\nIo ti \"sono vicino\" per quello che riguarda il dispiacere di fare un game non eccellente e doversi pure sorbire del flame gratuito, che non aiuta, ma davvero non abbatterti così, consolati sapendo che tu potrsi continuare a giocare mentre verti individui no","replies":[{"poster":"Caliban90","date":"2016-03-15T14:55:41.144+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Chroniicles,realm=EUW,application-id=MJVj50Jw,discussion-id=eBivOowR,comment-id=000400000000,timestamp=2016-03-15T14:52:09.341+0000)\n>\n> Giusto per sdrammatizzare, guarda tra i nuovi post aperti. Ho fatto in tempo a dirti questo che hanno aperto un topic del genere.\n> Io ti \"sono vicino\" per quello che riguarda il dispiacere di fare un game non eccellente e doversi pure sorbire del flame gratuito, che non aiuta, ma davvero non abbatterti così, consolati sapendo che tu potrsi continuare a giocare mentre verti individui no\n\nIo dico sempre che a me piace giocare a League of Legends, ed è spesso la gente a fare schifo. Perché preferisco essere scarsa o nabba piuttosto che una persona di merda (scusate il francesismo). Come se in B4 non si trovassero gli smurf gold o platino, dunque più skillati di me... Ma uno cosa ci può fare, inventarsela, la skill? Grazie comunque per l'appoggio.","replies":[{"poster":"Chroniicles","date":"2016-03-15T15:07:36.408+0000","up_votes":1,"down_votes":0,"body":"Domanda stupida, ma giochi da sola ranked? Non hai amici con cui joinare (mica per forza altri 4, anche uno o due)?","replies":[{"poster":"Caliban90","date":"2016-03-15T15:44:17.797+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chroniicles,realm=EUW,application-id=MJVj50Jw,discussion-id=eBivOowR,comment-id=00040000000000000000,timestamp=2016-03-15T15:07:36.408+0000)\n>\n> Domanda stupida, ma giochi da sola ranked? Non hai amici con cui joinare (mica per forza altri 4, anche uno o due)?\n\nIl tizio che mi ha offesa era un mio \"amico\". E il 70% delle volte non gioco sola in ranked.","replies":[{"poster":"Chroniicles","date":"2016-03-15T15:52:38.319+0000","up_votes":2,"down_votes":0,"body":"ok, mi ero perso quella parte. Ancora più triste come storia!\nComunque, fatti una bella cerchia di amici e vedrai che questo genere di episodi diventeranno più unici che rari","replies":[]}]}]}]}]}]}]},{"poster":"Ivalice89","date":"2016-03-16T13:44:16.315+0000","up_votes":2,"down_votes":0,"body":"Ieri mi è capitata una cosa simile. Giocando da adc ho fatto una pessima partita, può capitare a tutti! Il jungler (Master yi) non aiuta dicendo che ormai bot è persa. Decide di giocare da solo. Alla fine perdiamo e sono stato coperto di insulti pesantissimi. Anche a me ha augurato ogni sorta di male, malattie, AIDS ecc. ecc. Ha tentato anche di aggiungermi agli amici per insultarmi ancora, ovviamente non glielo ho permesso. Ho fatto gli screen della chat perchè il tutto l'ha detto dopo la partita, e non è visibile quella chat per valutare i report. Ho inviato gli screen alla Riot chiedendo un ban per il giocatore in questione, perchè NON DEVE esistere gente così in un videogioco. LoL è prima di tutto SVAGO, DIVERTIMENTO!! Non augurare il male ad altri giocatori per una partita persa. Spero si prendano provvedimenti al più presto.","replies":[{"poster":"Caliban90","date":"2016-03-16T13:56:36.635+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ivalice89,realm=EUW,application-id=MJVj50Jw,discussion-id=eBivOowR,comment-id=000a,timestamp=2016-03-16T13:44:16.315+0000)\n>\n> Ieri mi è capitata una cosa simile. Giocando da adc ho fatto una pessima partita, può capitare a tutti! Il jungler (Master yi) non aiuta dicendo che ormai bot è persa. Decide di giocare da solo. Alla fine perdiamo e sono stato coperto di insulti pesantissimi. Anche a me ha augurato ogni sorta di male, malattie, AIDS ecc. ecc. Ha tentato anche di aggiungermi agli amici per insultarmi ancora, ovviamente non glielo ho permesso. Ho fatto gli screen della chat perchè il tutto l'ha detto dopo la partita, e non è visibile quella chat per valutare i report. Ho inviato gli screen alla Riot chiedendo un ban per il giocatore in questione, perchè NON DEVE esistere gente così in un videogioco. LoL è prima di tutto SVAGO, DIVERTIMENTO!! Non augurare il male ad altri giocatori per una partita persa. Spero si prendano provvedimenti al più presto.\n\n^^^^^^^^^^^^^^^^^^^","replies":[]}]},{"poster":"Caliban90","date":"2016-03-15T14:07:49.974+0000","up_votes":2,"down_votes":0,"body":"Sì, ma magari ha insultato me solo oggi e con gli altri si para il fondoschiena, capite? E quella reportata dal mio team sono io perché \"noob intentional feeding useless\". Vabbé...","replies":[]},{"poster":"BrattishSolid6","date":"2016-03-15T14:04:38.662+0000","up_votes":2,"down_votes":0,"body":"Sì, funziona.\nNon funziona al primo report, intendiamoci. Ma solitamente un flamer è recidivo: se flamma una volta, flamma anche due volte. E se i report si accumulano, arrivano le sanzioni, anche abbastanza velocemente. Nel giro di un mese potrebbe già avere il suo bel ban da 3gg o 14gg.","replies":[]},{"poster":"Wigur","date":"2016-03-15T14:47:00.199+0000","up_votes":3,"down_votes":1,"body":"Lo hai tolto dalla lista amici ?","replies":[]},{"poster":"Caliban90","date":"2016-03-17T12:55:06.319+0000","up_votes":1,"down_votes":0,"body":"Tengo a precisare che ho seguito il vostro consiglio e al primo segnale di flame ho insta-mutato, quindi non so cos'altro abbiano detto durante il game.","replies":[]},{"poster":"Caliban90","date":"2016-03-17T12:53:35.383+0000","up_votes":1,"down_votes":0,"body":"E si continua:\n> Tsuki no Faith joined the room. \n> _Avversario_: gg wp :) \n> _Avversario_ left the room. \n> xx: best retard bot ever \n> _Avversario_  left the room. \n> _Avversario_  left the room. \n> Tsuki no Faith Rep4F: Dont worry \n> Tsuki no Faith Rep4F: you'll enjoy your report \n> xx: nik ommok \n> xx: go fuk your mom \n> xx: son of a bitch- \n> Tsuki no Faith Rep4F: nice \n> _Mio Adcarry_ : excellent \n> Tsuki no Faith Rep4F: keep on \n> xx: i hope you get blood cancer \n> xx: bi-tch \n> Tsuki no Faith Rep4F: i copy paste \n> Tsuki no Faith Rep4F: everything to riot \n> Tsuki no Faith Rep4F: right now \n> _Avversario_ : ANTA 3ARBE \n> _Avversario_ : report him \n> xx: go ahead son of a bi-tch \n> xx: nik yemmak \n> Tsuki no Faith Rep4F: i'm sending a ticket \n> Tsuki no Faith Rep4F: right now \n> xx: nik yemmak \n> xx: fuk- your mom \n> Tsuki no Faith Rep4F: Sure, keep on \n> xx: bitc-h \n> xx: nik ommok ya wlid el 9ahba","replies":[]},{"poster":"Unlucky Cuchu","date":"2016-03-15T23:43:25.984+0000","up_votes":1,"down_votes":0,"body":"Un po' di giorni fa ero Singed e, dopo aver ucciso Lee sin e aver lasciato malphite con 100 hp, quest'ultimo ha scritto : \"Singed i hope ur entire family gets cancer in real life\" io ci ho riso su e gli ho scritto \"anything else?\" e lui \"no just die in hell with ur mom and dad\". Alla fine son solo parole, io mi ci faccio una risata quando succede.","replies":[]},{"poster":"Caliban90","date":"2016-03-15T14:52:49.732+0000","up_votes":1,"down_votes":0,"body":"Penso che per primo mi abbia tolto lui, in ogni caso l'ho reportato e bloccato. Ho anche mandato un ticket al supporto","replies":[]},{"poster":"Nabbomaster","date":"2016-03-15T14:34:00.456+0000","up_votes":1,"down_votes":0,"body":"solo la settimana scorsa mi sono arrivati un messaggio che mia avvisavano che in seguito alle mie segnalazioni qualcuno era stato bannato","replies":[]},{"poster":"Frattaglia","date":"2016-03-15T14:10:30.035+0000","up_votes":1,"down_votes":0,"body":"Mi spiace, purtroppo sono cose che capitano. E, si, i report funzionano tant'è che quando arrivi a un certo livello di gioco i flamer diminuiscono (perché vengono bannati prima).\n\nLa prima cosa che ti consiglio di fare quando la gente inizia a rompere così è, se ti interessa vincere la partita che stai giocando, impara a mutarli. In quel momento se vuoi cercare di vincere comunque non vuoi distrazioni, quindi ignora questa gente come si fa con le mosche.\nUna volta finita la partita però reportali. Se sei una persona che fa report motivati (cioè, se non sei il tipo di persona che reporta tutti per partito preso, perché in quel caso vieni ignorata) il sistema dà peso al tuo report e, quando ne avrà abbastanza, andrà a controllare se questa persona si è veramente comportata male o no e darà una punizione.\n\nSe poi questo tizio continua a molestarti dopo la partita, penso che puoi provare a mandare un ticket al supporto con screenshot e quant'altro, ma non so in quel caso quanto seguito possa avere quel tipo di segnalazione.\n\nAd ogni modo quel genere di persona è meglio perderla che trovarla, ti consiglio di eliminare quel ragazzino dalla tua lista amici e di trovarne di migliori. Per fortuna in giro c'è gente più simpatica con cui giocare. :)","replies":[]},{"poster":"Drakethehero","date":"2016-03-16T15:49:43.399+0000","up_votes":1,"down_votes":1,"body":"ehi mi sono preso delle ranked restricted perché quando la gente mi flamma e mi da la colpa, quando sono quello che sta palesemente giocando meglio, lì mi va il sangue alla testa, io non sono perfetto, non sono un pro, ma di sicuro ho più cervello del silver medio, adesso, per evitare restricted e ban muto tutti appena leggo il primo flame, così sto tranquillo e a fine partita, report per feeding e verbal abuse tanto per andare sul sicuro, infatti ho ricevuto solo oggi 2 messaggi in cui venivo informato che il mio report ha comportato il ban di un player tossico, gg","replies":[]},{"poster":"DjEndermanxx1567","date":"2016-03-15T19:44:07.836+0000","up_votes":1,"down_votes":1,"body":"Chiedilo al mio account bannato","replies":[]}]}