{"poster":"Niko3396","date":"2016-08-17T14:19:08.729+0000","title":"Rating Problems","subforum":"Campioni e gameplay","up_votes":2,"down_votes":1,"body":"I was wondering about the league of legends rating sistem becouse i think u give too much weight to the CS i know is an important part of the gameplay (if not the most important mechanic) but recently i played a match with MID Ekko and i kinda destroyed the enemy team i ended  26/3/21 of KDA but i only Made 127 CS  becouse at that point i left the farm to my team and i went for the champions instead but the game gave me &quot;only&quot; an A+ rating is still an high rating but i was expecting more like an S+ becouse i pratically dominated that game (with a great support thresh).","replies":[{"poster":"Ryukito","date":"2016-08-17T15:06:42.637+0000","up_votes":2,"down_votes":0,"body":"Anche io ho lo stesso \"problema\". Dopo 100 games con Ekko, ho ottenuto proprio 5 minuti fa la prima S e di conseguenza il primo gettone per la maestria 7. L'ho giocato in giungla, quindi ancora più difficile per quanto riguarda il CS. Ti linko le statistiche sul mio game, avendo screennato perche anche per me è un evento piu unico che raro.\n\n[IMG]http://i67.tinypic.com/2mxogh4.png[/IMG]\n\n[IMG]http://i63.tinypic.com/2lmqr5s.png[/IMG]\n\n[IMG]http://i64.tinypic.com/2zpjkpl.png[/IMG]","replies":[{"poster":"Niko3396","date":"2016-11-26T13:39:26.030+0000","up_votes":1,"down_votes":0,"body":"una cosa che ho notato è che le uccisioni determinano poco il punteggio generale molto importante è il CS e il numero di morti","replies":[]}]},{"poster":"Andreiv14","date":"2016-08-17T14:54:35.358+0000","up_votes":2,"down_votes":0,"body":"Per ottenere una valutazione superiore ad un A+ devi tenere in considerazione tutte le variabili: cs, kda, partecipazione a kill, ward... Ti sarebbero bastate la metà delle kill e qualche cs in più. Se giochi per le ricompense ti conviene concentrarti su tutte le variabili, se invece vuoi vincere, fai quello che hai fatto. A volte cercando di vincere riesci a ottenere anche la valutazione adatta.\n\nP.S.: A parte qualche errore di ortografia, pensi che scrivendo in inglese ti risponda direttamente la \"RIOT\"?\n\n{{champion:7}}  \"Trust me!\"","replies":[{"poster":"Niko3396","date":"2016-11-26T13:36:57.485+0000","up_votes":1,"down_votes":0,"body":"in realtà mi sono scordato che il forum è italiano perche tengo il gioco in inglese :D\n\n{{champion:103}}  \"don't you trust me?\"","replies":[]}]},{"poster":"HaIIeIujah","date":"2016-08-17T14:49:26.485+0000","up_votes":1,"down_votes":0,"body":"S means \"Absolute Perfection\".\nTo get that rating, you need to excel in every field.\nThink less like Devil May Cry, where you go up in rating by just playing, and more like Advance Wars, in which your final rating is a combined sum of your rating in various fields.\nYou can't get \"absolute perfection\" if one of your field sucks, no matter how good the others are.","replies":[]}]}