{"poster":"KingxOfxHeaven","date":"2017-01-05T09:29:59.593+0000","title":"TF als ADC","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Moin zusammen,\r\n\r\nIch sehe im Moment vermehrt APler auf der Botlane. Wenn es so weiter geht, w&auml;re dann nicht TF + CC-Support eine gute Option.\r\nTF mit AP - Build.\r\nDadurch das TF einen Stun mit sich bringt, w&auml;re er auch sehr gut im engage. Zus&auml;tzlich hat er mit seiner Q einen &quot;starken&quot; Poke und weil er einen Supporter noch hat, ist die Laningphase auch ein wenig angenehmer im Early. (Finde diese pers&ouml;nlich zimlich nervig am anfang, solange bis er DMG hat)\r\nWie seht ihr das ?","replies":[{"poster":"xXTheFalloutXx","date":"2017-01-05T14:22:07.613+0000","up_votes":1,"down_votes":0,"body":"Ich bin Twisted Fate Main, sehe meinen Account, und Spiele ihn meistens Jgl oder Botlane, ich habe ihn noch NIE, NIE Midlane gespielt.\nIch bin ein Spieler für ungewöhnlich Picks, außer im Ranked.\nTF auf der Botlane, hier hat man mehrere möglichkeiten ihn zu Spielen da Tf sehr flexibel ist:\nMein Normales AD/AP Carry Build:\n{{item:3006}} {{item:3094}} {{item:3153}} {{item:3124}}  {{item:3072}} \nDas Letze Item variiert stark nach gegnerteam Bevorzugen tue ich jedoch:\n{{item:3078}} {{item:3031}} {{item:3026}} \n\nWenn man ein Full AD Team hat empfiehlt es sich folgende Items zusätzlich in Betracht zu ziehen:\n{{item:3116}} {{item:3027}} {{item:3157}} \n\nTrotzdem finde ich Tf jgl stärker da man hier noch mehr variieren kann. So geht man kurzerhand Tanky mit 100 MR und Armor, 3k Hp und 2,5atk speed.","replies":[]},{"poster":"Noobinho","date":"2017-01-05T10:03:51.622+0000","up_votes":1,"down_votes":0,"body":"Allerdings wenn das Team darauf abgestimmt ist mit einem ADler Mitte wie Zed oder Yasuo, durchaus denkbar. In einem 5er Team könnte das schon sehr interessant sein. Die Frage ist, ist ein Zed oder Yasuo stärker als ein guter ADC?!","replies":[]},{"poster":"Irdrosil","date":"2017-01-05T09:54:01.609+0000","up_votes":1,"down_votes":0,"body":"Wäre dann eher TF APC :p\nAD TF funktioniert nur bedingt, auf ARAM ok, aber sonst so eher schwach wegen fehlender AD Skalierung der Stille bzw. der Grundschaden der Skills ist magisch.","replies":[]},{"poster":"Mi3zekatze","date":"2017-01-05T15:50:58.678+0000","up_votes":1,"down_votes":1,"body":"Ich denke mal nach den Kriterien die ein APC auf der Botlane braucht ist TF SUPER GUT!\n\nEr pusht super schnell\nEr reißt Tower mega schnell ein\nEr tradet ziemlich gut \n\nSein einziges Problem dürfte der DMG sein. Er hat halt im Ealry nicht genug. Sonst denke ich mal ist es einer der Top besten APC auf der Botlane","replies":[]}]}