{"poster":"Theorchero","date":"2015-11-16T18:13:46.149+0000","title":"Okay, so BFNA got banned for calling a bunch of kids who are telling him to kill himself \"Pussies.\"","subforum":"[ARCHIVED] General Discussion","up_votes":28,"down_votes":11,"body":"???????\n\n&gt;Wanting a Ban Looked Into (Forum, 1 Day)\nJust saying I think my 1 day ban from Boards was kinda unwarranted.\nYep. I asked people if they were retarded, and I called people pussies and pieces of trash.\nThis was after several people all grouped up on me, literally like over 5 people in the same thread, told me to kill myself, said they would pay for the rope or gun and send it to me.\nYep. \nAnd while their comments were being removed, those ones actually stayed up for at least 30 minutes. Others were removed, mods didnt bother removing the &quot;Hey, we&#039;ll buy you rope to kill yourself with.&quot;\nSo I said they were retarded (You&#039;re grouping up to tell someone to off themselves, I mean come on...), and I called them pussies because they were cowards behind a computer screen.\nOf course -they- dont get immediately banned, at all.\nTHEY got to keep posting for quite a while.\nWhy werent the ones literally, in a group, telling me to kill myself, immediately banned?\nBut of course I &quot;hurt their feelings&quot; by calling them &quot;bad names&quot; as retarded and pussies. \nI dont care if I hurt their feelings I&#039;m sticking up for myself because the moderators here wouldnt.\nThey removed posts but literally left up the ones telling me they would pay to give me the access to kill myself.\nThis wasnt one person either this was several.\nSo guess what? Mods left it up, I decided to stand up for myself and basically tell them to fuck off.\nYet THAT instantly gets me banned?\nWhat the hell is wrong with you guys. Please just remove this shit thanks and for the love of god, dont wait at a bare minimum 30 minutes to remove  people in groups telling someone to off themselves, that&#039;s fucked up.\nBy the way I tried posting this on the Player Behavior/Moderation Forum, but it won&#039;t let me. Great coding, wish I could dispute this there but nope. \n\n&gt;~SnowKittyNidalee/BFNA \n\ntl;dr Bunch of people telling BFNA to kill himself has their posts up for a much longer time than BFNA&#039;s &quot;fuck off&quot; posts.\n\nHonestly in my personal opinion if you tell someone to kill themselves (like genuinely, as it was obviously the case here) you should get a 2 week ban on the forums at a MINIMUM. That kind of shit shouldn&#039;t be tolerated at all. I&#039;d go so far as to say that it deserves an in-game suspension.\n\nThe more appropriate reaction, according to reason and the forum rules,** is to remove all posts involved, suspend/punish the offenders (and the smurfs used) and remove his posts and give him a warning**. Like, he was pretttty provoked.\n\n**All in all this is a pretty fucked up situation. if you delete this thread mods, then you are just a fucking joke and just refuse to do your job.**\n\nEdit:\n\nBorrowed Bleediss quote because holy shit the quote function doesn't fucking work on this forum\n> [{quoted}](name=Bleediss,realm=NA,application-id=mNBeEEkI,discussion-id=yyL5IGm7,comment-id=0000,timestamp=2015-11-16T18:15:39.775+0000)\n>\n[1:07:07 PM] Niku (BFNA): Main points:\n[1:07:24 PM] Niku (BFNA): -People were sayng they'd pay for me to kill myself in mass, this was a group of over 5 people\n[1:07:45 PM] Niku (BFNA): -They were being watched by the moderators as content was being deleted, but specific posts saying they'd pay for that were still left up for over 30 minutes\n[1:08:16 PM] Niku (BFNA): -I stood up for myself and called them \"pussies\", \"trash\", and \"retarded\" because I felt they were stupid and cowardly for typing what they were, and i got immediately one day banned.\n[1:08:35 PM] Niku (BFNA): -It was at that time they finally got their stuff removed despite it being up for far longer when other things were.\n[1:11:07 PM] Niku (BFNA): Remember kids, cant use \"naughty words to hurt other people's feelings\" because telling people that want you to kill yourself to fuck off is very bad okay? \nFuck the mods\n[1:12:21 PM] Niku (BFNA): oh and seriously it is a 1 day ban though im just really irate regardless because it's going to be a mark on my account i dont want to stay there.\n[1:12:41 PM] Niku (BFNA): My \"one more warning\" thing was about x rated content specifically\n\nhttps://gyazo.com/f28740a7cfa5ae99f6e02edb95f4a78b.png","replies":[]}