{"poster":"Hi im xcJ","date":"2017-08-25T16:19:38.423+0000","title":"Ingame mal Schnell mal langsam","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo, ich habe seid heute ein ganz komisches Problem bei LoL. \r\nIngame wechselt es immer zwischen Slowmo und Fast. Es sind keine FPS drops oder Laggs da l&auml;uft alles super, aber der Ingame speed ber&auml;ndert sich alle paar sekunden was mega komisch ist, vllt kann mir da jemand weiter helfen","replies":[{"poster":"Qbert","date":"2017-08-31T04:47:02.231+0000","up_votes":1,"down_votes":0,"body":"Klingt ein wenig nach Rubberband ... könnte ergo auch an deiner Internetverbindung liegen.\nStarte vielleicht mal deinen Router neu, ohne die Einstellungen zu resetten. Vielleicht schafft das Abhilfe.","replies":[]},{"poster":"Hi im xcJ","date":"2017-08-30T16:54:41.488+0000","up_votes":1,"down_votes":0,"body":"Problem besteht leider immer noch","replies":[{"poster":"Pandeonor","date":"2017-08-31T04:36:26.939+0000","up_votes":1,"down_votes":0,"body":"\"Neue Teile\". Je nun... Scrooge... spare mal nicht so mit Informationen ☺. Die kosten nur etwas Zeit, sonst nichts. :-P\n\nEntweder Bios, Treiber oder Hardware funktionieren nicht wie sie sollen. Überlege Dir welche \"Teile\" neu sind und gehe von Bios bis zu Treibern alles durch an notwendigen Einstellungen. Vielleicht hast Du neuen RAM und der taktet nicht richtig oder...oder... [.... mein Zauberspiegel ist gerade krank gemeldet, hat Mumpitz]. Mache mal ein paar Angaben und dann sehen wir weiter. ☻","replies":[]}]},{"poster":"Allerbester Biss","date":"2017-08-25T17:11:51.077+0000","up_votes":1,"down_votes":0,"body":"Stell die Geschwindigkeit wieder auf normal sonst wirst du am Ende noch wegen Scripting Hacks usw gebannt.","replies":[{"poster":"Hi im xcJ","date":"2017-08-25T18:09:26.542+0000","up_votes":1,"down_votes":0,"body":"Was für ne Geschwindigkeit :D ? also was für ne einstellung meinst du ? \n\nHatte erst meinen Rechner komplett neu gemacht wegen neuer teile etc und seitdem ist das so :D","replies":[]}]}]}