{"poster":"Dumbledøge","date":"2017-07-01T00:14:56.611+0000","title":"Gebannt wegen Drittanbieter Programm...","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":2,"body":"Heyo,\r\nich musste heute Abend leider feststellen das mein Account gesperrt wurde. Aus der gesendten Email konnte ich entnehmen das ich angeblich Drittanbieter Programme verwendet habe (aus irgendeinen Grund haben sie meinen Benutzernamen sogar klein anstatt gro&szlig; geschrieben. Da sieht man ja was f&uuml;r Leute da arbeiten...). Ich wei&szlig; ehrlich gesagt nicht ganz genau was alles unter &quot;Drittanbieter Programme&quot; f&auml;ltt aber ich gehe mal von scripts aus. ich habe jedoch nie solche Scripts benutzt.\r\nIch meine, ich bin Support main und das nichtmal gut, spiele aber auch wenn ich bock habe mal andere Rollen und sucke meistens. Ich verstehe also absolut nicht warum ich gebannt worden bin.\r\nIch habe schon ein Ticket an Riot geschrieben aber ich meine mal geh&ouml;rt zu haben das ein Perma Ban nicht zur&uuml;ckgenommen wird.\r\nGibt es also &uuml;berhaupt ein Chance und was kann ich noch machen?\r\nBin f&uuml;r jede R&uuml;ckmeldung Dankbar.\r\nMFG","replies":[{"poster":"Camillus","date":"2017-07-01T01:17:20.954+0000","up_votes":2,"down_votes":0,"body":"Laut Riot ist das System zur Erkennung dieser Dritten Software sehr genau, zumindest berufen sie sich darauf und dementsprechend hast du wenig bis gar keine chance das sich das irgendwie positiv in deine Richtung verändert","replies":[]},{"poster":"Kiimahrii","date":"2017-07-01T01:21:54.169+0000","up_votes":1,"down_votes":1,"body":"Alle, und ich wiederhole alle und ausnahmslos, Posts die ich letzer Zeit gelesen haben über Spieler die einen Ban aufgrund der Nutzung Drittanbieter Programme, behaupten das sie nicht einmal wüssten was das sein solle.","replies":[{"poster":"Dumbledøge","date":"2017-07-01T01:31:50.757+0000","up_votes":1,"down_votes":2,"body":"Wenn du richtig lesen könntest würdest du sehen, das ich geschrieben habe das ich nicht genau weiß was \"ALLES\" unter Drittanbieter Programme fällt. Mir ist natürlich klar was Scripts und Hacks sind, aber ich weiß halt nicht was noch zusätzlich unter diese Kategorie fällt.\nWer lesen kann ist klar im Vorteil.","replies":[{"poster":"Kiimahrii","date":"2017-07-01T02:05:21.057+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Dumbledøge,realm=EUW,application-id=KYnfKGf0,discussion-id=KETRTMK5,comment-id=00010000,timestamp=2017-07-01T01:31:50.757+0000)\n>\n> Wenn du richtig lesen könntest\n\n\nIch bin mir ziemlich sicher das dieser Ton mitsamt die anderen 4 Posts in denen du andere Community Benutzer mit harte Worte beleidigst bereits zeigen, dass dein Ban berechtigt ist. Hier glaubt dir keiner das du Unschuldig bist weil jeder weiß das du nicht Unschuldig bist. Wenn nicht wegen 3tAnbieterprogramme dann wäre es eh wegen dein Verhalten gekommen.\n\nDas du deine Laune auch noch an Leute aus lässt die versucht haben dir zu helfen, tststs. Gleich kommt wieder ein neuen Thread mit milden Ton bis der nächste Kommentar dir erneut vor Augen führt das dein Ban wohl verdient ist. Einer weniger.","replies":[{"poster":"eingew","date":"2017-07-01T09:22:21.168+0000","up_votes":3,"down_votes":1,"body":"Also nix für ungut, aber konstruktiver bist du selbst nun auch nicht gerade... diese Stigmatisierung zum Flamer ist doch reine Provokation und führt zu nichts.","replies":[{"poster":"Kiimahrii","date":"2017-07-11T00:08:43.891+0000","up_votes":1,"down_votes":2,"body":"Er ist mitsamt zich-tausend andere Spieler einer von denen, die Drittanbieter genutzt haben und von einer Banwelle erwischt worden sind. Das Forum wimmelt nur von solchen Unschuldslämmer. Was wäre deiner Meinung nach eine konstruktive Antwort? Die 0815 \"Melde dich bei Riot per Email falls du Unschuldig bist\"-Antwort obwohl wir alle wissen, dass er das nicht ist?","replies":[{"poster":"Kaorî","date":"2017-07-12T19:20:06.992+0000","up_votes":1,"down_votes":0,"body":"Kennst du die Unschuldsvermutung Kiimahrii?\n\n,,**Jeder Mensch, der einer strafbaren Handlung beschuldigt wird, ist solange als unschuldig anzusehen, bis seine Schuld** in einem öffentlichen Verfahren, in dem alle für seine Verteidigung nötigen Voraussetzungen gewährleistet waren, gemäß dem Gesetz **nachgewiesen ist**.“\n\nDas hier ist zwar ein Spiel, jedoch sollte man sich sowas immer vor Augen halten und nicht ohne eindeutige Beweise jemanden beschuldigen.\n\n{{sticker:slayer-jinx-wink}} ","replies":[]},{"poster":"eingew","date":"2017-07-12T09:20:02.107+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt: Es ist komplett sinnlos dem TE noch tausend andere schlechte Charaktereigenschaften anzudichten, bloß um dein persönliches Menschenbild zu bestätigen und sonst 0 damit zu erreichen. Inwiefern der Ban für Drittanbieterprogramme gerechtfertigt ist, darüber habe ich keinerlei Aussage getroffen, wozu auch, wo Camillus doch längst alles gesagt hat, was zu dem Thema gesagt werden muss.","replies":[]}]}]}]}]}]},{"poster":"eingew","date":"2017-07-01T09:24:44.496+0000","up_votes":1,"down_votes":0,"body":"Hast du jemals auf fremden Computern gespielt oder den Account ausgeliehen? Könnte jemand Fremdes auf deinem Account gespielt haben, ohne, dass du es gemerkt hast? Hast du irgendwelche Programme runtereladen, die sich in irgendeiner Weise auf League beziehen, wenn ja: Welche? Benutzt du Makros an deiner Maus und Tastatur?\n\n> Ich habe schon ein Ticket an Riot geschrieben aber ich meine mal gehört zu haben das ein Perma Ban nicht zurückgenommen wird.\n> Gibt es also überhaupt ein Chance und was kann ich noch machen?\n> Bin für jede Rückmeldung Dankbar.\n\nDas gilt für gerechtfertigte Bans. Sofern du Riot einen Fehler in ihrem System aufzeigen kannst, entbannen sie dich.","replies":[{"poster":"Dumbledøge","date":"2017-07-01T11:23:47.361+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Hilfe. Ich hab mal als ich beim Kumpels war auf deren PC/Laptops gespielt aber soweit ich weiß benutzen die auch keine Scripts, Hacks etc. Programme welche sich auf LOL beziehen hab ich auch keine.\nDas einzige womit ich mir das erklären kann ist das Riot Games zu viele Reports wegen meinen Kalista Games bekommen hat.\nAls ich mir vor Drei Monaten zwei Finger beim Fußball gebrochen hatte habe ich einen Champion gesucht welcher möglichst wenig Tasten braucht um gespielt zu werden. Ich hab damals herausgefunden das wenn man in den Einstellungen, wenn man unter Spielerbewegung/Aggrssiv Bewegen (ich glaube auf Englisch heißt das Attackmove) auf eine der anderen Maustasten packt, bei Kalista nur noch diese Taste drücken muss um zu Kiten und das Ziel anzugreifen. Somit kann man Skillshots natürllich einfacher dogden da man sich nicht mehr auf den gegner kozentrien muss, bzw diesen anklicken muss. Ich habe das auch bei Streamern gesehen (Doublelift, Sneaky) und habe versucht heraudzufinden wie das geht.\nMöglicherweise habe ich damals reports bekommen weil das aussah wie Scripts, Hacks.\nAber das sidn ja ingame Einstellungen und daher kiene Drittanbieter Programme.\nAls meine Finger dann wieder verheilt waren, habe ich wieder Support gespielt. \nich weiß nicht ob Riot sich dachte das ich in der Zeit geboosted, gescripted habe oder sowas aber das habe ich ja nicht.\nKann das der Grund gewesen sein?","replies":[{"poster":"XExEcUtOrX04","date":"2017-07-01T12:20:31.475+0000","up_votes":1,"down_votes":0,"body":"Bei Reports gehts nicht darum wer oder wieviele dich reportet haben sondern darum **ob** du wirklich etwas \"verbochen\" hast - wenn du nichts gemacht hast hast du auch nichts zu befürchten.","replies":[{"poster":"Dumbledøge","date":"2017-07-01T12:51:32.007+0000","up_votes":1,"down_votes":2,"body":"Außer bei Riot Games sitzt ein Praktikant der random Spieler bannt...","replies":[{"poster":"XExEcUtOrX04","date":"2017-07-01T12:58:53.807+0000","up_votes":2,"down_votes":0,"body":"Wird von einem automatischen System geregelt und ich glaube nicht das ein Unternehmen wie Riot einen Praktikanten hat der aus Jux und Tollerei Leute bannt.","replies":[{"poster":"Dumbledøge","date":"2017-07-01T14:07:38.400+0000","up_votes":1,"down_votes":0,"body":"War ja auch nur ein joke :)\nBin gerade ien bisschen tilted","replies":[]}]}]}]}]}]},{"poster":"Nazawe","date":"2017-07-01T12:11:24.177+0000","up_votes":1,"down_votes":0,"body":"Benutzt du Overwolf?","replies":[{"poster":"Dumbledøge","date":"2017-07-01T12:50:30.963+0000","up_votes":1,"down_votes":0,"body":"Nein","replies":[]}]}]}