{"poster":"Mario Lopez","date":"2018-06-06T09:04:04.156+0000","title":"Year 3 of no Rek'Sai skin","subforum":"Story, Art, & Sound","embed":{"description":"Kind of bummed out that Rek&#039;Sai hasn&#039;t had a new skin in two years this coming June 26th. She&#039;s my favorite champ too &lt;/3 I get that there are other champs that haven&#039;t got one in a while. But Rek&#039;Sai is a relatively modern champ.","url":"https://boards.na.leagueoflegends.com/en/c/story-art/xp7hkEMG-reksai-hasnt-had-a-new-skin-in-two-years","image":"https://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":6,"down_votes":1,"body":"June 26th will mark the 3 year anniversary of Pool Party Rek&#039;Sai&#039;s release. I made a post around this time last year and will do so every year from now on until Rek&#039;Sai finally gets a skin =( Alot of people pointed out that there were a handful of champs that have gone longer without a skin than Rek&#039;Sai in my post from last year. However, 95 percent of the champs that people listed have gotten a skin since that post. I get anxious whenever PBE gets updated hoping that my wait will finally come to an end, but I&#039;m only met with disappointment when I see that champs like Lux or Miss Fortune get their 2nd skin in the span of a year. If any Rioter reads this, please at least let me know if there is a skin in development for Rek&#039;Sai. That&#039;ll be enough to keep me happy for a long time. Even if it doesn&#039;t come out for a bit. I really hope its a Gemstone skin since Riot seems to give not very popular champs those kinds of skins. Hextech Rek&#039;Sai sounds amazing =(","replies":[{"poster":"Geauxx","date":"2018-06-06T09:22:14.788+0000","up_votes":6,"down_votes":1,"body":"There will be hope, shen just got  his first skin since 2012, progress is being made","replies":[]},{"poster":"QMighty","date":"2018-06-07T03:47:10.201+0000","up_votes":2,"down_votes":0,"body":"I'm super on board with a new Rek'Sai skin, but I don't want it to be a gemstone skin.  After waiting so long for her it'd be a shame to have her first skin in forever (and only her third skin) be near un-obtainable.","replies":[]},{"poster":"ZevBenjamin","date":"2018-06-06T14:56:45.696+0000","up_votes":2,"down_votes":0,"body":"Rek'Sai definitely needs a skin for sure. May i also add....\n{{champion:39}}  <--------- 3 years no skin. So I feel your pain buddy.\nStar Guardian Irelia or DawnBringer Irelia will suffice riot. \nTY.\n{{sticker:sg-jinx}}","replies":[{"poster":"Budget Yami","date":"2018-06-06T15:55:31.532+0000","up_votes":4,"down_votes":3,"body":"But irelia got a rework so uhm does that count as a skin?","replies":[{"poster":"ZevBenjamin","date":"2018-06-06T17:33:35.499+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=BLT2121,realm=NA,application-id=6kFXY1kR,discussion-id=LtVUBgzY,comment-id=00010000,timestamp=2018-06-06T15:55:31.532+0000)\n>\n> But irelia got a rework so uhm does that count as a skin?\n\nNo.\nThats like getting a car and it got mad dirty over the years and then you finally wash it. It's the same car lmao.","replies":[]},{"poster":"Neamean","date":"2018-06-07T03:55:02.522+0000","up_votes":1,"down_votes":1,"body":"She lost a skin though RIP Frostbutt Irelia.","replies":[]}]}]}]}