{"poster":"RybackxLegend","date":"2017-11-25T23:39:04.599+0000","title":"perma banned","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":13,"body":"Ich möchte mich an die Spieler aufrichtig entschuldigen das ich only geflamet habe und damit das Spiel zum absoluten (nerv) spiel gemacht habe und mein ganzes Team genervt habe \r\nAber mir gefällt das spiel wirklich sehr und ich habe es echt oft gespielt und bin jetzt pema banned es würde mich echt freuen wenn das riot team mich unbannen könnte ich werde auch mich in zukunft fügen und nicht mehr flamen oder gegen irgen andere Regeln verstoßen \r\nVielen Dank im voraus für die Antwort :D\r\ning: rybackxlegend","replies":[{"poster":"MeMyselfandBaal","date":"2017-11-25T23:42:46.626+0000","up_votes":4,"down_votes":1,"body":"Wenn der Bann berechtigt und nicht durch einen Fehler ausgelöst wurde, kannst du dich noch so oft entschuldigen: Dein Account ist für immer weg. \nDen Gedanken, dass es blöd ist, wenn dein Account für immer gebannt wird, hättest du dir während des 14 Tages Bann, den du normalerweise erhalten haben solltest, gemacht gemacht haben. Jetzt kannst du es auf einem neuen Account noch mal versuchen, aber diesen wirst du nie wieder zurück bekommen.","replies":[]},{"poster":"Sirrkas","date":"2017-11-25T23:40:25.140+0000","up_votes":4,"down_votes":1,"body":"Berechtigte Strafen werden von Riot nie aufgehoben. Wenn du das wirklich ernst meinst und dich auch besser benehmen kannst, steht es dir aber frei, einen neuen Account zu erstellen.","replies":[]},{"poster":"CptPICHU","date":"2017-11-26T11:46:25.100+0000","up_votes":2,"down_votes":0,"body":"Du hast schon relativ viele Chancen, die Riot dir gibt. Sie sagen dir locker 3 mal \"Benimm dich!\" bevor der Hammer zuschlägt.\nDas dieser Permanbann aufgehoben wird... Das glaube ich nicht. Da müsste es schon einen Grund für geben. Und es muss ja gehen.\nIch spiele seit 2 Jahren und habe noch nie überhaupt einen Chatbann bekommen. Und viele andere sicher auch.\nIch bin schon froh, dass das System so weit ist, dass nicht jedes Spiel irgendjemand nervt.\n\n___________________________\nSpielt Ehrenvoll Leute. Spielt fair, habt Spaß.\n-MfG SRB Toad {{champion:117}}","replies":[]},{"poster":"Darkr3sQ","date":"2017-11-26T10:26:23.129+0000","up_votes":2,"down_votes":0,"body":"Warum sollte RIOT gerade Deinen Perma aufheben sollen? Was genau prädestiniert DIch dazu, wo doch der Unbann für alle anderen Perma-gebannten Spieler verwehrt bleibt?","replies":[]},{"poster":"Coopa123","date":"2017-11-28T12:56:42.803+0000","up_votes":1,"down_votes":0,"body":"Och wie süß <3","replies":[]}]}