{"poster":"Leohwan","date":"2018-10-07T17:18:02.948+0000","title":"Está difícil jugar","subforum":"Charlas Generales","up_votes":6,"down_votes":1,"body":"Hola!\r\nYo vengo a escribir ac&aacute; ya que tengo una inquietud. Soy un invocador que viene jugando hace 3 o 4 a&ntilde;os aunque no de forma continua (tengo grandes periodos de inactividad) y siempre estuvo el mismo problema: los afk. Mas de la mitad de las partidas que jugu&eacute; en estos d&iacute;as fue con gente que se desconecta en el medio de la partida con alguna excusa, o que directamente no entra cuando empieza el juego. Hace 4 a&ntilde;os era as&iacute;, y ahora lo sigue siendo.\r\nEscribo esta discusi&oacute;n ya que me parece una falta de respeto al compa&ntilde;ero que utiliza tiempo, del poco que tiene, para jugar una partida y divertirse y frustrarse porque a uno se le ocurre desconectarse. Sinceramente, me dan ganas de no entrar m&aacute;s y estoy seguro que hay mas gente que piensa as&iacute;.\r\nAhora que hable y dije lo negativo, una idea que se me ocurre para mejorar la situaci&oacute;n es que haya consecuencias mas graves para esa gente que se desconecta porque si (no los que tienen problemas de conexi&oacute;n o de pc), como un baneo por 24 horas, o una multa que se cobre en esencia azul o roja, o por el estilo.\r\nA medida que vaya viendo estas situaciones voy a ir sacando capturas de pantalla, as&iacute; tengo evidencia jaja.\r\nEn lo que si noto una mejora es en los trolls, no hay tantos como antes. Eso es algo positivo para destacar.\r\n&iexcl;Saludos!\r\n{{sticker:sg-ezreal}}","replies":[{"poster":"VikingoATR","date":"2018-10-07T22:05:10.811+0000","up_votes":2,"down_votes":0,"body":"Hola man como stas no lei todo pero con el comiezo m di cuenta d q se trata\nes cierto pasa muy seguido \nt recomiendo jugar a la madrugada s el mejor horario tengo un par d amigos q solo juegan rank a altas horas d la madrugada y actualmente el q sta peor sta en platino 5","replies":[{"poster":"Leohwan","date":"2018-10-08T12:52:16.863+0000","up_votes":1,"down_votes":0,"body":"No todos tenemos el tiempo para entrar a esas horas 😆.\nSi hay consecuencias más fuertes para la gente que se va afk porque si, supongo que habria menos afk jaja.","replies":[]}]},{"poster":"xJUANFORETEx","date":"2018-10-07T22:04:55.216+0000","up_votes":2,"down_votes":0,"body":"El flameo y el trolleo es entendible, pero el afk aun que nos de mucha rabia puede tener sus razones, lamentablemente es asi, ahora si dices que vos tambien no juegas mucho, ten en cuenta que muchas veces es cuestion de suerte el ser emparejado con buena gente, juega mas y veras que no hay tantos afk, a mi me resulta raro cruzarme con uno, muy raro, pero si veo mucho troll y flamers","replies":[{"poster":"Leohwan","date":"2018-10-08T12:49:18.245+0000","up_votes":1,"down_votes":0,"body":"2 partidas seguidas con afk pérdidas y 2 remakes de clasificatoria también seguidos por afk en un día.\nMás de la mitad de las partidas que juego tienen afk o trolls, y mas aún flamers.","replies":[{"poster":"xJUANFORETEx","date":"2018-10-08T16:01:41.566+0000","up_votes":1,"down_votes":0,"body":"Tenes una muy mala suerte entonces, ya se va a poner mejor, y no es por discriminar ni nada jajaja pero en bronce y plata veia mas afk, al subir a oro vi mas trolls y flamers que otra cosa, capaz es cuestino de elo tambien, ni idea","replies":[]}]}]},{"poster":"Expectø Patronum","date":"2018-10-07T17:39:15.268+0000","up_votes":2,"down_votes":0,"body":"esto es asi desde siempre y nunca va a cambiar, el server las segundo con mas cantidad de afks, y riot no quiere hacer nada , muchas veces se hablo de esto y nunca se dijo sobre  mejorar las sanciones . mas que el tipico leaverbuster de 30 minutos no pasa.","replies":[{"poster":"Fransoi ","date":"2018-10-07T18:09:14.302+0000","up_votes":2,"down_votes":1,"body":"y vos te vas afk?","replies":[{"poster":"Expectø Patronum","date":"2018-10-07T18:11:22.247+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SpectralMasterGf,realm=LAS,application-id=v7qsfXsE,discussion-id=Hr6YJ4t3,comment-id=00010000,timestamp=2018-10-07T18:09:14.302+0000)\n>\n> y vos te vas afk?\n\nnunca me voy afk, nunca juego con internet malo.","replies":[{"poster":"Fransoi ","date":"2018-10-07T21:50:52.616+0000","up_votes":2,"down_votes":0,"body":"y si un dia de repente tenes un apagon en la ciudad por x motivo? \"te estas llendo afk\" te mereses un baneo ? o sancion mas grande por eso ? cuando te estas llendo afk :S no verdad tenes que tener encuenta que capas vos tenes un internet copado copas vos tenes una computadora de 100.000 pesos argentinos capas vos vivis en una zona donde el intenet es muy bueno pero la verdad es que muchos no tienen una gran computadora ni un gran internet ponele que tengan 6 megas que es bueno pero viven con su hermanito que quiere usar el internet","replies":[{"poster":"Expectø Patronum","date":"2018-10-07T22:00:56.659+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SpectralMasterGf,realm=LAS,application-id=v7qsfXsE,discussion-id=Hr6YJ4t3,comment-id=0001000000000000,timestamp=2018-10-07T21:50:52.616+0000)\n>\n> y si un dia de repente tenes un apagon en la ciudad por x motivo? &quot;te estas llendo afk&quot; te mereses un baneo ? o sancion mas grande por eso ? cuando te estas llendo afk :S no verdad tenes que tener encuenta que capas vos tenes un internet copado copas vos tenes una computadora de 100.000 pesos argentinos capas vos vivis en una zona donde el intenet es muy bueno pero la verdad es que muchos no tienen una gran computadora ni un gran internet ponele que tengan 6 megas que es bueno pero viven con su hermanito que quiere usar el internet\n\nno juegues, asi de simple. no tenes una pc/interter que no cumple los requisitos minimos para un juego online 5vs5. la luz como mucho se te puede cortar una vez al mes. si te vas afk seguido estas arruinando la experiencia de juego a los demas. hay otros juegos que no requieren internet/pc buena","replies":[]},{"poster":"Leohwan","date":"2018-10-08T12:47:13.082+0000","up_votes":1,"down_votes":0,"body":"Hay gente que no tiene mas opción que irse afk por razones importantes. Este post está dirigido a los que se van afk por un mal gankeo, a la gente que se tiene que ir a almorzar, gente que no tiene ganas de jugar y se desconecta a los 5 min, etc.","replies":[{"poster":"Fransoi ","date":"2018-10-08T21:33:45.530+0000","up_votes":1,"down_votes":0,"body":"oka :S","replies":[]}]}]}]}]}]},{"poster":"Tur1nTur4mb4r ","date":"2018-10-07T19:19:57.949+0000","up_votes":2,"down_votes":0,"body":"Decimelo a mi que tengo afk la PC","replies":[]},{"poster":"exrex","date":"2018-10-07T17:50:37.687+0000","up_votes":2,"down_votes":0,"body":"En este momento en donde el lol esta \"debil\" no van a aplicar cambios que reduzcan la cantidad de jugadores. \nEn NA por ejemplo, en vez de banear permanentemente, lo estan quitando...","replies":[{"poster":"Leohwan","date":"2018-10-07T19:10:07.130+0000","up_votes":1,"down_votes":0,"body":"Es verdad eso! No van a banear y perder jugadores (clientes). Pero eventualmente van a perder jugadores por otro lado por los afk.","replies":[]}]},{"poster":"agemax","date":"2018-10-07T17:26:56.728+0000","up_votes":2,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"QUBE","date":"2018-10-09T20:41:19.301+0000","up_votes":1,"down_votes":0,"body":"En general yo no veo tantos afk pero cuando lo piensas lógicamente tampoco es un problema.\nEstando seguro de que vos no te vas afk las chances don 4/9 de que este en tu equipo el afk y 5/9 de que este en el enemigo. Se que no es divertido jugar con un afk pero mientras vos seas constante en tus partidas vas a subir más por ellos que bajar.\n\nTambién mientras mas te alejes de bronce menos vas a ver. La gente que se va afk seguido también pierde seguido. Por lo que están amontonados en lo más bajo de la tabla.\n\nViéndolo de está manera me parece innecesario e injusto con los que se van por problemas serios sancionar de manera más severa","replies":[]},{"poster":"Skhertaz SRn","date":"2018-10-09T14:40:26.665+0000","up_votes":1,"down_votes":0,"body":"Es cierto que esto pasa muy seguido y es una lástima, todos esperamos ese glorioso día en el que RIOT comience a penalizar más a esta gente.\n\nTambién hay que entender que muchos no tienen el mejor nivel de internet y se les desconecta","replies":[]},{"poster":"Shulys","date":"2018-10-07T19:56:21.830+0000","up_votes":1,"down_votes":0,"body":"No es dificil jugar.\n\nYo en ocaciones me eh ido afk. \nTengo excelente internet, pero en este mes creo que me eh ido afk 2 veces por problemas repentinos. \nEn una debia ir a la farmacia a comprar el medicamento para mi mama urgente, en otra tenia que retirar a mis hermanitos por una amenaza de bomba en la escuela.\n\nLas razones para irse afk son variadas, y muchos juzgan. Pero algunos se van porque tienen buenas razones, y otros si por un mal internet. \nPor tal motivo aportaria una idea que creo que ya la han mencionado, de colocar los MS (Creo que se escribia asi) en el cliente, para que el jugador sepa si tiene lag antes de jugar y que el sistema prohiba a este jugador inciar partida debido al ms registrado.\nPD: Nunca me eh ido afk en ranked. \nPD 2: Me preocupan mas los troll que los afk.\nPD 3: Es un hermoso dia el de hoy ¿verdad?\n\n{{sticker:sg-kiko}}","replies":[{"poster":"Leohwan","date":"2018-10-08T12:50:25.319+0000","up_votes":1,"down_votes":0,"body":"Claro! Yo hablaba de la gente que se va porque si","replies":[{"poster":"Shulys","date":"2018-10-08T17:09:08.900+0000","up_votes":1,"down_votes":0,"body":"Lo entiendo corazón, pero el sistema no tiene manera de saber la razón del abandono de partida, por eso no banean con severidad.","replies":[]}]}]}]}