{"poster":"Pasarillo","date":"2016-04-13T20:07:02.012+0000","title":"Me suspendieron permanentemente","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":17,"body":"Hola RIOT, quiero saber si me pueden dar soluciones, porque me SUSPENDIERON PERMANENTEMENTE la cuenta por flameo, no voy a decir que no porque flamie, pero el motivo de mi insulto, fue porque 2 ranked seguida me toco el mismo trol, que se puso a regalar killes en medio de esas 2 ranked, y me suspenden y porque no le hacen algo al que trolea? Por favor si pueden hacer algo porque  da mucha rabia que  hagan eso! Muchas gracias","replies":[{"poster":"AuroraExecution","date":"2016-04-13T21:01:22.340+0000","up_votes":4,"down_votes":0,"body":"Gracias riot por hacer bien tu trabajo eliminando la cuenta de un flammer. Ahora la comunidad va a estar un poco mas limpia.","replies":[{"poster":"Kyo Hatori","date":"2016-04-13T21:15:02.076+0000","up_votes":3,"down_votes":0,"body":"Totalmente de acuerdo, esto significa que el sistema da buenos resultados a veces :D","replies":[{"poster":"AuroraExecution","date":"2016-04-13T21:18:00.632+0000","up_votes":4,"down_votes":0,"body":"Riot reconoce que el sistema es lento, pero es efectivo.","replies":[{"poster":"Kyo Hatori","date":"2016-04-13T21:23:42.046+0000","up_votes":3,"down_votes":0,"body":"La verdad que si, con que funcione soy feliz :3","replies":[]}]}]}]},{"poster":"Yrox the Third","date":"2016-04-13T20:21:18.952+0000","up_votes":4,"down_votes":0,"body":"Para empezar, el ban permanente no es la primera opcion.\nSegundo, flamear es una razon para ban permanente, pero solamente si ya te han dado los otros castigos.\nTercero, no te banean por 2 partidas.\nCuarto, es ban merecido.","replies":[{"poster":"Zevko","date":"2016-04-13T21:53:10.158+0000","up_votes":1,"down_votes":0,"body":"a mi hermano no le habian echo nada ( ni baneado chat) y le banearon 14 dias de una.","replies":[{"poster":"Yrox the Third","date":"2016-04-13T21:55:05.364+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tziiah,realm=LAS,application-id=PJAKt7ph,discussion-id=ecP1sQRb,comment-id=00010000,timestamp=2016-04-13T21:53:10.158+0000)\n>\n> a mi hermano no le habian echo nada ( ni baneado chat) y le banearon 14 dias de una.\n\nDepende de lo que haya hecho (porque los reports falsos son revisados), por ejemplo no siempre hay advertencias o ban de chats (por ejemplo, no te van a banear el chat si solo estas regalando partidas sin flamear, es estupido), asi que eso es posible, pero el ban permanente solo pasa sin aviso si fue por hacks.\n\nAh, y no te creo que a tu hermano lo hayan baneado sin razon alguna.","replies":[{"poster":"Zevko","date":"2016-04-14T00:13:53.081+0000","up_votes":1,"down_votes":0,"body":"nono si lo banearon por flamear pero de 0 a 14 dias me entendes? xD","replies":[{"poster":"Yrox the Third","date":"2016-04-14T00:21:09.832+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tziiah,realm=LAS,application-id=PJAKt7ph,discussion-id=ecP1sQRb,comment-id=0001000000000000,timestamp=2016-04-14T00:13:53.081+0000)\n>\n> nono si lo banearon por flamear pero de 0 a 14 dias me entendes? xD\n\nNo te entiendo, osea, tiene el ban de 14 dias.","replies":[{"poster":"Zevko","date":"2016-04-15T00:41:10.497+0000","up_votes":1,"down_votes":0,"body":"el no flameaba nunca, y por eso no tenia ninguna penalizacion, flameo una partida y ban 14 dis xd.","replies":[{"poster":"Yrox the Third","date":"2016-04-15T15:22:59.137+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Tziiah,realm=LAS,application-id=PJAKt7ph,discussion-id=ecP1sQRb,comment-id=000100000000000000000000,timestamp=2016-04-15T00:41:10.497+0000)\n>\n> el no flameaba nunca, y por eso no tenia ninguna penalizacion, flameo una partida y ban 14 dis xd.\n\nDepende que haya hecho,  si flameo toda la partida dando insultos excesivos y lo reportaron los 9 es probable que lo banen,  aun asi,  es raro que de verdad haya sido solo por una partida.","replies":[]}]}]}]}]}]}]},{"poster":"ImBuGs","date":"2016-04-13T20:12:00.149+0000","up_votes":3,"down_votes":0,"body":"No te suspenden permanentemente por flamear 2 partidas, seguramente ya haz tenido advertencias anteriormente como baneos de chat o suspensiones temporales de 3 o 14 días. \n\nAl troll que te hizo perder las partidas ya lo atraparan a su tiempo si la gente lo reporta.\n\nSi dices cambiar de actitud eres totalmente de crear una nueva cuenta y empezar desde 0, si aun crees que fue un error puedes contactar al soporte aquí: https://support.riotgames.com/hc/es-419 pero MUY rara vez un baneo permanente es ejecutado erróneamente. \n\nUno menos, gracias Riot.","replies":[]},{"poster":"Kyo Hatori","date":"2016-04-13T21:15:34.986+0000","up_votes":2,"down_votes":0,"body":"Que buena onda Riot, me encanta saber que dan permaban a los tóxicos. Laikaso\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"JACKY FANBOY","date":"2016-04-13T20:25:51.800+0000","up_votes":3,"down_votes":1,"body":"Banmerecido\n¿entienden? como bien, pero ban\nokno :v","replies":[{"poster":"efukt","date":"2016-04-13T21:04:56.747+0000","up_votes":1,"down_votes":0,"body":"es como decir bien merecido pero mezclado con ban (de baneo) = banmerecido, es un juego de palabras jajajaj xD","replies":[]}]},{"poster":"Ancient Gromp","date":"2016-04-16T15:08:04.380+0000","up_votes":1,"down_votes":0,"body":"Ha empezar de 0 o desistalar (mejor opcion para vos y la comunidad)","replies":[]},{"poster":"Pasarillo","date":"2016-04-15T16:30:46.421+0000","up_votes":1,"down_votes":0,"body":"Miren, yo lo acpeto pero a ustedes no le pasa, que vivan tocandoles troll, y lo odio es una normal no tengo problema, pero que creen cuentas   para joder en una ranked y la sigan jodiendo me saca mucho porque es ranked osea que wtf? Es demaciado injusto a ustedes capaz no le moelste que les toquen trol en clasificatorias, pero a mi si porque amo este aunque no juege muy bien, y quiero seguir subiendo de ligas, pero asi no se puede y me pasa cada 2 de 4 o 5 partidas, ustedes tiene un punto de vista que es el a flamer, bien hecho riot otro flamer menos para la comunidad, pero nadie entiende que es un clasificatoria y si importa como se juega eso da rabia, y que ustedes no lo entiendan menos, pero gracias por el ban!","replies":[]}]}