{"poster":"LionHeartV","date":"2015-07-03T09:21:39.323+0000","title":"Il tasto \"report\" serve a qualcosa?","subforum":"Discussioni generali","up_votes":2,"down_votes":4,"body":"o &egrave; solo una valvola di sfogo per frustrati? :P","replies":[{"poster":"Dantazzo","date":"2015-07-03T11:31:24.555+0000","up_votes":5,"down_votes":0,"body":"Il tasto report ha una duplice funzione:\n1) Serve a reportare i comportamenti negativi degli altri player\n2) Serve a far placare gli animi degli spastici che credono che premendolo sempre ad ogni game causino migliaia di ban.","replies":[{"poster":"73668109_DEL","date":"2015-07-03T18:49:22.601+0000","up_votes":1,"down_votes":1,"body":"La cosa triste è che spesso gli spastici riescono nel loro intendo.","replies":[{"poster":"Ediwir","date":"2015-07-03T23:55:28.254+0000","up_votes":3,"down_votes":1,"body":"No, la cosa migliore è che ci credono.","replies":[{"poster":"73668109_DEL","date":"2015-07-04T14:34:42.135+0000","up_votes":1,"down_votes":1,"body":"In teoria ogni 30 report scatta il controllo giusto no ?\nBhe se 25 spastici reportano a caso e 5 reportano con cognizione di causa , i 25 spastici faranno prendere la punizione :D.","replies":[{"poster":"Ediwir","date":"2015-07-06T03:12:47.880+0000","up_votes":2,"down_votes":1,"body":"Sbagliato.\nOgni report ha un valore diverso determinato da vari fattori (sostanzialmente, affidabilità del tizio che reporta). Quando la somma di questi valori raggiunge un totale sufficiente, scatta il controllo, che in alcuni casi causa una restrizione (e in altri no).\n\nPiù chiaro così? :)\nAh, giusto per chiarire: se il controllo dà risultato nullo, l'affidabilità cala. È il motivo per cui chi reporta a caso ha un valore di report prossimo allo zero (lo zero è raro solo perchè, andando a caso, almeno uno giusto lo prendi).","replies":[{"poster":"73668109_DEL","date":"2015-07-06T04:43:41.080+0000","up_votes":1,"down_votes":0,"body":"Ma e' proprio quello che intendo io , i report a caso fanno aumentare il contatore per il controllo....basta che  tu abbia flammato in alcune partite e ti fanno avere la restrizione....anche se non hai flammato nelle partite in cui ti hanno riportato , quindi ti fanno bannare indirettamente...","replies":[{"poster":"Ediwir","date":"2015-07-06T05:13:20.710+0000","up_votes":1,"down_votes":0,"body":"Sì babbé, ora che ti arriva un check per report a caso diventi vecchio. Già coi report validi prendendoti solo cecchini incensurati te ne occorrono 'na cinquantina, di bassi ti ne servirebbero sei-settemila.\nQuanto ci metti a incontrare 7000 giocatori che ti reportino? Io non credo di aver giocato abbastanza partite, e son qui da 5 seasons...","replies":[{"poster":"73668109_DEL","date":"2015-07-07T18:01:34.782+0000","up_votes":1,"down_votes":2,"body":"siiiiiiiiiii 50 cecchini per avere una punizione ?\nMa dai questa te la potevi risparmiare....","replies":[{"poster":"Ediwir","date":"2015-07-08T04:49:22.460+0000","up_votes":2,"down_votes":0,"body":"Vedi tu, almeno non sto sparando a caso.","replies":[{"poster":"73668109_DEL","date":"2015-07-08T16:28:25.498+0000","up_votes":1,"down_votes":1,"body":"Io ho passato un periodo di \"gioco\" molto movimentato dal punto di vista punizioni.\nTi posso assicurare che bastano molto meno di 50 cecchini per passare da una restrizione ad un' altra.\nSICURO.","replies":[{"poster":"Ediwir","date":"2015-07-10T03:08:14.200+0000","up_votes":1,"down_votes":0,"body":"Ah beh, per passare da una a un'altra no, chiaro, una volta che ti sgamano ti tengono d'occhio più da vicino per un po'.\nParlo della prima, quando sei ancora incensurato e non ti hanno mai beccato a flammare.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"LionHeartV","date":"2015-07-03T10:45:48.116+0000","up_votes":3,"down_votes":0,"body":"In una partita 2 soggetti deliziosi si sono messi a darmi del ritardato perchè ho scazzato un paio di volte usando leona, intimandomi di andari afk o uscire dalla partita altrimenti mi avrebberò reportato. Da quando il report è diventata una minaccia? :P","replies":[{"poster":"Ediwir","date":"2015-07-06T03:22:16.263+0000","up_votes":2,"down_votes":0,"body":"Da parecchio. \"Report\" è la parola più usata da chi riceve punizioni.","replies":[]}]},{"poster":"ZOMBIE 4 ALEX","date":"2015-07-03T10:27:06.493+0000","up_votes":2,"down_votes":0,"body":"Ragazzi reportiamo tutti LionHeartV!!! Poi dicci se funziona =p {{summoner:31}}","replies":[]},{"poster":"ztJackieChan","date":"2015-07-06T07:00:05.231+0000","up_votes":1,"down_votes":0,"body":"l'unico report realmente affidabile è il verbal abuse.\nda come trollerete e feederete non si potrà mai notare o capire la sostanziale differenza tra l'intento volontario e la tragicomicità dei bronze.\nma la certezza della prolissità nelle chat è ben chiara e visibile.\n\nio ho fatto l'errore di rispondere, sempre in maniera educata, ai miei compagni di team, mentre feedavo 0-20... svariate volte.\nvi sono mai arrivate le notifiche in cui la Riot vi ringrazia perchè ha bannato un giocatore grazie alle vostre segnalazioni ? A me diverse volte, almeno 3, solamente quest'anno, e io il tasto report lo premo ben poco, dal momento che mi faccio sempre i caxxi miei.\n\nVoi trollate e strafeedate 0-20, loro in chat vi lanciano tutte le madonne di questo mondo, voi fate report per verbal abuse, loro vengono bannati. Tu NO. :D\n30-70 partite con chat ban vedi come li calma.\nCome vi ho detto, ho fatto l'errore di rispondere, qualche volta e ho avuto la chat bannata per alcune partite. Ma tanto a me che me frega, io trollo. :D","replies":[]},{"poster":"kirchhoff","date":"2015-07-03T14:14:00.748+0000","up_votes":1,"down_votes":0,"body":"entrambi","replies":[]},{"poster":"Whommy","date":"2015-07-03T10:17:35.314+0000","up_votes":1,"down_votes":0,"body":"epico","replies":[]}]}