{"poster":"PRINZESSINSPOTON","date":"2017-06-24T19:42:56.213+0000","title":"Supporter sucht ADC mit Gehirn (Einsteiger)","subforum":"Clans & Teams","up_votes":2,"down_votes":1,"body":"Hey Community,\r\n\r\nich habe Lol erst mit dieser Seasion angefangen,da ich gerne Ranked spielen mag und ohne  gute Kommunikation es schwierig wird gute Spiele hinzubekommen suche ich ein ADC.\r\n\r\nMein eignene Skillgruppe kann ich leider nicht einsch&auml;tzen dennoch denke ich, das ich mich  stets verbessere.\r\n\r\nGenerell w&uuml;rde ich mich &uuml;ber jeden Anfrage freuen wenn ihr &uuml;ber 20&acute;zig seid und ein funktionsf&auml;higes Headset habt.\r\nDas Alter ist mir schon wichtig , da ich gerne konstruktive Kritik bekomme aber auch gerne vergebe.\r\n(j&uuml;ngere Menschen gehen halt mit Kritik in der Regel meist pers&ouml;nlicher um)\r\n\r\n\r\nEs k&ouml;nnen aber auch  gerne h&ouml;herer Skillgruppen mich adden aber bitte nicht soviel erwarten da es einfach an Erfahrung noch mangelt.\r\n(spiele Lol seit ca. 3 Monaten/t&auml;glich)\r\n\r\nAnsonsten einfach mich adden und kurz schreiben das es hier um den Post geht:)\r\n\r\n\r\nRandinfos: Ich besitze alle Supporterchamps und meine Runensets sind so gut wie auch fast komplett bzw.\r\n                   Mein Main ist Soraka weil es ein sch&ouml;ner Einstiegschamp ist dennoch habe ich auch kein Problem andere Supporter zu spielen.","replies":[{"poster":"FF20 Revenge","date":"2017-07-02T16:18:44.351+0000","up_votes":1,"down_votes":0,"body":"Habe nach 4 Jahren wieder lol angefangen :) würd mich freuen, wenn wir mal zusammen zocken könnten!","replies":[]},{"poster":"Knightmeister","date":"2017-06-24T20:07:07.663+0000","up_votes":1,"down_votes":0,"body":"Hi suche auch einen langfristigen duoQ Partner bin main Elo Gold spiele aber auf meinem Smurf Account bin 23 Jahre hab TS3 und freue mich immer über gute und nette Leute in meinen Teams. Bin Main Top und Adc mit Jinx Mf Draven und Cait. Falls du Lust hast mit mir zu Spielen habe dich geaddet","replies":[]}]}