{"poster":"xDanox","date":"2018-03-01T08:05:44.942+0000","title":"Mala suerte interminable, trolls,afks y malos equipos, qué hacer?","subforum":"Guias y consejos","up_votes":2,"down_votes":1,"body":"Buenas gente!\r\n\r\nEscribo este thread para escuchar sus opiniones, sus consejos sobretodo, relatos, historias y tambi&eacute;n c&oacute;mo descargo personal, me gustar&iacute;a, si alguien m&aacute;s se encuentra en una situaci&oacute;n parecida, tambi&eacute;n puede usar este thread c&oacute;mo descargo personal, saber que no estamos solos en esta y por ah&iacute; darnos &aacute;nimos los desafortunados del match making\r\n\r\nVolv&iacute; a jugar hace algo de 3 meses por recomendaci&oacute;n de un amigo, el juego hab&iacute;a mejorado mucho y la comunidad estaba menos t&oacute;xica, despu&eacute;s de un largo periodo de normales, adaptarme nuevamente, entender el meta y los cambios, volv&iacute; a rankear, mi meta siempre fue llegar a Platino V, pero siempre qued&eacute; estancado en Oro I por distintas razones, jugu&eacute; las 10, qued&eacute; en Oro V y r&aacute;pidamente llegu&eacute; a Oro I, con cerca de 20 victorias arribas de derrotas, algo as&iacute; c&oacute;mo 40 - 20, no me acuerdo los n&uacute;meros exactos. En el camino hab&iacute;a tenido buenos equipos, malos equipos, trolls y afks en mi equipo, trolls y afks en el equipo enemigo, lo normal.\r\n\r\nY... lo peor empez&oacute;, una racha de derrotas, pero interminable, malos equipos tras malos equipos, trolls, afks, etc...  (jajaja, qu&eacute; cara dura al culpar mi equipo no?, nadie pierde 20 partidas por culpa de su equipo no?) bueno, yo pensaba exactamente igual que ustedes... entonces me dije &quot;No puede ser que siempre que llego a Oro I empiezo a perder por &quot;Mala suerte&quot; el malo soy yo, voy a practicar&quot; y as&iacute; fue, practiqu&eacute;, practiqu&eacute; y practiqu&eacute;, uff mejor&eacute; much&iacute;simo, qu&eacute; malo era antes, con raz&oacute;n no sub&iacute;a. Volv&iacute; a las rankeds, volv&iacute; a perder, mi equipo feedeaba todas las l&iacute;neas o se iba afk o por una discusi&oacute;n trolleaban (estamos hablando de Oro I), yo jugaba Renek y Nasus con los cu&aacute;l ten&iacute;a un win rate de arriba de 60% con ambos, si pickeaba Nasus, feedeaban todos antes de minuto 15 y luego tiraban surrender, con Renek era otra cosa, pod&iacute;a ayudar mucho m&aacute;s en el early, sacar kills en mi l&iacute;nea, tirar TP bot, dar kills... pero... tampoco serv&iacute;a, Renek decae en el late y mi equipo no sab&iacute;a aprovechar TODA la ventaja. (Dios qu&eacute; bronce hip&oacute;crita al culpar a su equipo no?) Si, yo pensaba igual que ustedes, as&iacute; que no me desalent&eacute;, empec&eacute; a ver mis replays y encontr&eacute; varios errores que correg&iacute; y algunos otros que todav&iacute;a intento corregir.Realmente... mejor&eacute; un mont&oacute;n, pero mucho y me dije a mi mismo &quot;Si pod&iacute;a mejorar todo esto, entonces es que realmente me faltaba para llegar a Platino&quot; recargado, volv&iacute; a jugar rankeds... pero ya no era equipos malos... eran equipos terribles!, mi MMR de Platino V, hab&iacute;a bajado hasta Oro III, bot lane cae al minuto 5 (si, al minuto 5, incre&iacute;ble) todos 0/4 al minuto 10, cosas por el estilo... y ya no sab&iacute;a que hacer, prob&eacute; de cambiar campeones, si Nasus es d&eacute;bil en early, pero fuerte en late y Renek al rev&eacute;s, tengo que usar algo que se mantenga, pero al no tener la pr&aacute;ctica que tengo con esos campeones, no me fue muy bien... y eso si, fue culpa m&iacute;a. PERO TODAV&Iacute;A NO ME REND&Iacute; Y DIJE, FUCK THIS SHIT, con Nasus todav&iacute;a tengo un win rate arriba del 60%, no me importa si me trollean, eventualmente voy a subir, pero la cosa empeor&oacute; todav&iacute;a m&aacute;s, tengo un troll/afk cada 2 partidas.\r\n\r\nYa s&eacute; qu&eacute; me van a decir &quot;No es un troll, es alguien que solo juega mal y ten&eacute;s que carrearlo&quot;, &quot;la estad&iacute;stica dice que si vos no sos un troll, entonces hay m&aacute;s probabilidad que toque en el equipo enemigo&quot; y estoy totalmente deacuerdo, pero el azar no es exacto y cu&aacute;ndo la mala leche se presenta, realmente rompe toda estad&iacute;stica. Si era gente que intencionalmente perd&iacute;a, no gente que simplemente feedeaba y NO, ninguna vez toc&oacute; en el equipo enemigo, al menos, no en las &uacute;ltimas 20 partidas.\r\n\r\nBuscando por internet, digo, es demasiada coincidencia, 10 partidas, 6 trolls o afk, encontr&eacute; que el matchmaking de Riot trata de forzarte un 50% de win rate, con el score que ten&iacute;a, ten&iacute;a un win rate de 68% y la pesadilla comenz&oacute;... me han llegado a feedear una partida por decir &quot;Hola&quot; y me dijeron &quot;Qu&eacute; saludas conchetumare?, esto es LAS, ahora te voy a trollear&quot; SI, LES JURO, tambi&eacute;n encontr&eacute; un viejo thread que hice de hecho, en... la misma situaci&oacute;n que ahora, bajar de Oro I porque una racha interminable de equipos mediocres, con pruebas y todo (aunque ahora s&eacute; que esas partidas las estaba jugando tilteado y eso es culpa m&iacute;a en parte, pero no quita... lo que era la gente que me emparejaba Y PUEDEN VERLO)\r\n\r\nhttps://boards.las.leagueoflegends.com/es/c/guias-y-consejos/HAeVlIgw-mala-suerte-o-mal-desempeao-imposible-llegar-a-platino-con-imaagenes-para-probarlo\r\n\r\nNo recib&iacute; ninguna respuesta m&aacute;s que ser un mediocre por culpar a mi equipo, siendo que siempre trato de no hacerlo y concentrarme en mejorar mi juego.\r\n\r\nEn fin, qu&eacute; procede?, qu&eacute; consejos me podr&iacute;an dar?, pasaron por algo parecido?, es mala suerte o es algo que no estoy viendo?, es Oro I el elo hell de Oro?\r\n\r\nMuchas gracias para los que se tomaron la molestia de leer todo y agradecer&iacute;a cualquier tipo de opini&oacute;n, consejo o historia n_n","replies":[{"poster":"ÅTLAS ","date":"2018-03-01T09:06:44.877+0000","up_votes":3,"down_votes":0,"body":"Mira justo ayer me encontre con una shyvanna que llevaba una racha de 14 derrotas consecutivas  estaba en platino 3 y bajo a platino 5 casi por bajar a oro 1 yo lo anime en el lobby le dije ahora la cortamos a la racha pero al ver como jugaba esa shyvanna como se buildeaba tenia sentido que este perdiendo partida tras partida por suerte con un amigo en duoQ pudimos carrilearla. \n\nSuelo subir a Platino con esta y otra cuenta no es muy difícil digamos la gente comete muchos errores parece que van stompeando pero tiran la partida en cualquier momento. \n\nMi consejo es que si jugas Top mainees esa linea y tengas claro que campeon vas a jugar vs todos los machups te banees el que no podes ganar y de ahi tengas claro que funcion vas a tener en la partida y que vas aportar ejemplo vas con Camille pick muy fuerte que no lo van a nerfear en unos cuantos parches entonces jugas camille: Que haces con ella? Si sacas ventaja en top normalmente la gente en soloQ oro no hace swap de linea asi que seguis por top haces split si no vienen 2 a matarte no se puede entonces tiras torre tras torre le indicas a tu equipo quedarse presionando medio sin pelear y si te vienen 2 de ellos tu equipo puede pelear 4 vs 3 por mas malos que sean por algo ellos estan oro algo podran hacer de todas formas vos tenes que ser el carry el famoso 1 vs 9. \n\nQue pasa si tenes una mala partida en fase de lineas te podes recuperar sigamos con el ejemplo de camille te va mal podes usarla para hacerle un pickup a alguno con E y R seguis siendo util pero por lo que lei vos jugas renek (sin snowball es inservible y esta muy mal en winrate) y nasus hace 1 parche estaba muy bien ahora cayo mucho pero depende de tener un early suertudo para seguir escalando de oro 1 problablemente te toque con muchos platinos 5 o 4 que ya saben como contrarrestar a un nasus muy facil te diria que cambies tu championpool por algo mas general y meta.\n\nDigamos puede que sea factor campeones o tambien puede ser mental que al llegar a oro 1 te empieces a sentir mas inseguro. \n\nMi consejo practicate bien un campeon meta en una normal mirate la replay proba de nuevo en la normal fijate si arreglas esos errores y tryhardea duro en ranked. Si jugas bien por mas equipo malo que te toque la vas a terminar ganando","replies":[{"poster":"xDanox","date":"2018-03-01T22:00:43.802+0000","up_votes":1,"down_votes":0,"body":"Hola, muchas gracias por tu respuesta!, estoy deacuerdo con todo lo escrito, justamente, estaba practicando Darius y Camille ya que me parecen campeones fuertes de principio a fin, con gran utilidad para el equipo, el problema es que me apresuré a usarlos en ranked y... no me fue tan bien, voy a seguir tu consejo y practicarlo en normales ya que son campeones \"Meta\", un poco de lástima me da, leí en demasiados lugares que se puede llegar con cualquier campeón, que al spammear, hacer OTP de un campeón, tarde o temprano tenés un conocimiento tan basto sobre todo match-up,situación,objetivo con ese campeón que aún así no esté en el meta podés carrear partidas, pero supongo que eso es para gente mucho más avanzada que yo, o Nasus y Renek justo no son los mejores campeones para carrear, debido a su debilidad en early (Nasus) y su debilidad en late (Renek).\n\nIgual debo decirte que casi siempre juego al Split Push, el problema es que últimamente mi equipo no sabe aprovecharlo, puedo tener 4 en top y se van a quedar haciendo la jg, farmeando o vienen a buscar kills muriendo en el proceso, esto es algo que me pasa muy seguido, gano mi línea, me llevo 1 o 2 kills en el camino y... luego?, el top enemigo simplemente juega super pasivo bajo su segunda torre (algo que no puedo tirar yo solo) y para cuándo quiero darme cuenta estamos score 3vs14. Qué debería hacer en estos momentos?, forzar objetivos?, intentar tirar otra torre tier 1?","replies":[{"poster":"ÅTLAS ","date":"2018-03-02T03:20:10.284+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xDanox,realm=LAS,application-id=8sKIclmi,discussion-id=rfuvgA9n,comment-id=00000001,timestamp=2018-03-01T22:00:43.802+0000)\n>\n> Hola, muchas gracias por tu respuesta!, estoy deacuerdo con todo lo escrito, justamente, estaba practicando Darius y Camille ya que me parecen campeones fuertes de principio a fin, con gran utilidad para el equipo, el problema es que me apresuré a usarlos en ranked y... no me fue tan bien, voy a seguir tu consejo y practicarlo en normales ya que son campeones &quot;Meta&quot;, un poco de lástima me da, leí en demasiados lugares que se puede llegar con cualquier campeón, que al spammear, hacer OTP de un campeón, tarde o temprano tenés un conocimiento tan basto sobre todo match-up,situación,objetivo con ese campeón que aún así no esté en el meta podés carrear partidas, pero supongo que eso es para gente mucho más avanzada que yo, o Nasus y Renek justo no son los mejores campeones para carrear, debido a su debilidad en early (Nasus) y su debilidad en late (Renek).\n> \n> Igual debo decirte que casi siempre juego al Split Push, el problema es que últimamente mi equipo no sabe aprovecharlo, puedo tener 4 en top y se van a quedar haciendo la jg, farmeando o vienen a buscar kills muriendo en el proceso, esto es algo que me pasa muy seguido, gano mi línea, me llevo 1 o 2 kills en el camino y... luego?, el top enemigo simplemente juega super pasivo bajo su segunda torre (algo que no puedo tirar yo solo) y para cuándo quiero darme cuenta estamos score 3vs14. Qué debería hacer en estos momentos?, forzar objetivos?, intentar tirar otra torre tier 1?\n\nSi tenes ventaja la suficiente como para matar yo le pediria ayuda al jungla y trataria de divearlo pero yo porque tengo un estilo mas agresivo de juego lo mas seguro seria wardear la jungla enemiga donde este tu toplane y luego rotar botlane o midlane si tiene poca vida la torre, si wardeas en su jungla ya sabes o que esta ahi o esta cerca de bot en caso que este en la jungla de top podes forzar facil en bot, si no tenes otra cosa que hacer ponele que ganas muy rapido la linea lo mejor es wardear jungla rival y tratar de buscar emboscadas en mid o bot como dije antes ya que vas sobrenivelado y vas a pegar mas. \n\nUn consejo mio es tratar de mandarlos afk o cortar la relacion top jungla si lo matas repetidas veces muy pocos lo soportan suelen enloquecer \n\nComo vos decias si ganaste linea y no tenes como forzar nada pedi heraldo o trata de buscar al jungla si no me equivoco ponele que sacaste primera sangre primera torre manejaste bien las oleadas deberias tener 2 niveles mas que el jungla deberias matarlo rapido seas darius o camille. \n\nYo soy muy fan de irelia con mi otra cuenta llegue a meterme en las mejores 100 irelia de Las y con eso subia muy rapido de elo el problema es que te puede arruinar la jugabilidad con otros campeones pero es una forma facil de subir tambien.\n\nMas alla de estos consejos trata de probar en normales estas rotaciones o trata de guiar al equipo siempre pensa que vos sos el capitan del equipo y se muy autocritico creo que es la unica forma de mejorar","replies":[]},{"poster":"Rick Silence","date":"2018-03-02T02:07:26.855+0000","up_votes":1,"down_votes":0,"body":"Quizá rotar con la botlane y derribar torre de bot, luego ver si en una rotación a mid derribás su torreta... También podrías sacar el heraldo y lanzarlo para derribar otra torre. Asegurar un objetivo como los dragones, si estás en bot... Tirar tp a bot cuando sea conveniente para llevarte una doble kill?\nEso se me ocurre, no sé qué tanto se puede hacer","replies":[{"poster":"Néd Stark","date":"2018-03-02T02:09:38.332+0000","up_votes":1,"down_votes":0,"body":"._.","replies":[]}]}]},{"poster":"Rick Silence","date":"2018-03-01T16:21:38.379+0000","up_votes":1,"down_votes":0,"body":"+1 estoy de acuerdo con lo que decís.","replies":[]}]},{"poster":"Rick Silence","date":"2018-03-01T16:17:10.120+0000","up_votes":1,"down_votes":0,"body":"A la mañana creo que hay un ambiente mucho mejor. A la mañana, tipo nueve y después de las nueve de la noche también.\nOtra cosa: tengo la hipótesis todavía no verificada de que el sistema empareja a los jugadores con buenas actitudes juntos, y lo mismo pasa con los de malas actitudes.\nSi esto llega a ser cierto, sin flamear, reportando solo cuando es estrictamente necesario, dando honor a un compañero al final de cada partida (normalmente siempre hay por lo menos uno que se lo merece) y recibiendo honor, paulatinamente llegarías a jugar en la mayoría de los casos con teams que valen la pena.\nY jamás flamear, por más mal que juegue alguien. He ganado más partidas por mantener la calma y dar ánimos al equipo que por cualquier otra cosa. Si en algún punto de la partida el equipo se pone a flamearse, es casi seguro que esa partida va a resultar derrota.","replies":[{"poster":"xDanox","date":"2018-03-01T22:14:59.273+0000","up_votes":2,"down_votes":0,"body":"Hola, gracias por tu respuesta, estoy deacuerdo con lo de los horarios, en esas horas, tuve equipos, ya sean malos o buenos, en los que había armonía y no tanta toxicidad, definitivamente el peor horario para jugar es la madrugada. Debo decir que no me parece acertada tu hipótesis, siempre fui positivo e igualmente me tocaba gente super tóxica, de hecho me encuentro gente tan pero tan tóxica que realmente llegó a afectarme, no, no me volví flammer, simplemente opté por hablar lo justo y necesario (antes hacía de niñera positiva emocional para el equipo y la verdad... funcionaba pero es un estrés extra lidiar con esa gente que no lo vale), ignorar cualquier mensaje de mi team que no sea útil para ganar la partida y simplemente decir \"Top no f, Top no Tp, Jg empieza en red\" y así, sin embargo me sigue emparejando con gente super flammer.","replies":[{"poster":"Rick Silence","date":"2018-03-02T02:10:02.852+0000","up_votes":1,"down_votes":0,"body":"Ah, genial. Gracias por darme datos! Entonces yo solo he tenido suerte. n.n\nOjalá logres subir!","replies":[]}]}]},{"poster":"LeonardoSB","date":"2018-03-01T11:22:50.058+0000","up_votes":2,"down_votes":0,"body":"mira me lei todo capo, la verdad el lol es...como decirlo...una basofia XD\n\nyo jugue las 10 quede oro 3 y el otro dia jugue con un pibito duo y dios mio, el chabon era smurf y no podia ganar, y los demás me focuseaban (claro, tenia 80% de winrate) , por no decir que los equipos que me salian eran muy malos.\n\nincluso en una smurf la mayoria de derrotas fueron de equipos que mis compañeros terminaban 1/11 o 2/15 y scores por el estilo.\n\nel problema de lol es que hay mucha venta de cuenta y eloboost, y lo peor de todo es que no podes evitar eso, puesto que ni rito puede solucionarlo, de esta manera solo te queda aceptar que la region es una basofia y soñar con tu nivel ideal.\n\nsalu2.","replies":[{"poster":"Rick Silence","date":"2018-03-01T16:19:28.508+0000","up_votes":1,"down_votes":0,"body":"Pero si merecés estar en una liga alta, con el tiempo deberías poder subir aunque cada tanto te toque a alguien así, puede ser?","replies":[{"poster":"LeonardoSB","date":"2018-03-01T22:05:29.753+0000","up_votes":1,"down_votes":0,"body":"si, con el tiempo...todo es tiempo, con el tiempo tambien podes convertirte en ingeniero, empresario, abogado.\n\nhay muchas cosas que se pueden hacer con el tiempo, y mejorar 100 veces por dia, y aun asi frenarte por gente que no está a tu nivel, es como...un desperdicio de tiempo.\n\nes como que riot quisiera que en las partidas perdidas nos pongamos a estudiar en vez de jugar.","replies":[]}]}]},{"poster":"Zelos From Jonia","date":"2018-03-01T12:20:48.574+0000","up_votes":2,"down_votes":1,"body":"Hola xDanox!\n\nTu caso no es algo aislado, y leo que solo llegas a oro 1, les pasa a muchisimos players que no pueden pasar a la siguiente liga y solo se barren entre divisiones y a veces bajan. La realidad basica estas en tu elo. Por eso no subes, y he aconsejado a mas de 500 players ya para salir de eso, pero estoy 100% seguro que si tu limite es oro 1, es por ti. Para ver el problema deberíamos ver tus partidas, pero la clave es esta \"las demas lineas fedean\", cuando alguien dice eso, tiene razón, lo que sucede es que vos no estas cubriendo eso.\n\nEn cuanto a los equipos, si o no, si la mala suerte existe, tambien esta el \"elo hell\", que no es el matchmaking. \n\nEl matchmaker no sabe quien se va a ir afk, o quien va a ser un troll, si tiene un historial (que creo que no usa mucho pero es otro tema), lo que si sabe el matchmaker es que el jugador A, esta en tu rango de emparejamiento segun tu mmr y tus ultimas partidas. Si venis de perder 4 partidas, y queres seguir jugando tenes que saber que el emparejamiento va a bajar (parejo a ambos lados) pero por ese alo que tenes de que viene todo mal, tu equipo siempre se siente como el peor. \nBasicamente, caes en ese circulo donde tenes mala suerte y encima el mmr global baja y no ves cooperacion en tus aliados. La clave es parar enfriarse y jugar a ganar tu linea y el juego.\n\nPrimero necesitas una estrategia, no podes pickear nasus (un champ autista casi 25 minutos) y quejarte de las demás lineas, si no estas para ayudarlos hacen lo que pueden, recorda que el que es bueno en el juego sos vos. Es muy muy tipico, creer que se juega bien, pero errar el pick por ejemplo, hasta d5 se ve exactamente el mismo error \"siempre gano linea y mi equipo pierde\", bueno empeza a dejar tu linea y buscar mas ganar la partida.\n\nSiento que lo que escribí se lee como una critica y no lo es. En tu lugar, enfriarte, relajarte y jugar tranqui, practicar, pero para mejorar hay que ver los fallos, ir a practicar a ciegas no sirve. Este post que hiciste seguro te sirvió para liberar tension tambien ;D\n\nSuerte!\nZelos.","replies":[{"poster":"xDanox","date":"2018-03-01T22:08:15.460+0000","up_votes":1,"down_votes":0,"body":"Holaa!, Muchas gracias por tu respuesta!, es la clase de respuesta que quería conseguir, lejos de verlo cómo una crítica, en tal caso la veo cómo una constructiva y acertada, esa es exactamente la razón por la que dejé de pickear Nasus y si, probablemente me las agarré con mi equipo, siendo que no tuve tan en cuenta que era impotente con Nasus hasta minuto 20 dejandolos en una clara desventaja. Lo del MMR, si logro revertir la \"Mala racha\" haciendo carry hard, podré tener un poco de alivio con equipos \"algo\" mejores jaja?. Al igual que me aconsejaron más arriba con los picks, estoy practicando Darius y Camille, el tema es que realmente no puedo mejorar mucho en normales, en las normales SI puedo carrear con facilidad, pero nunca puedo hacer lo mismo en rankeds por obvias razones. Si, exactamente, siempre gano mi línea pero hasta ahí queda mi ventaja, cómo expliqué más arriba, supongamos que tiro torre, salgo de mi línea 2/0 con un buen farm, el Top enemigo se queda farmeando super pasivo bajo su segunda torre y al salir de mi línea, me encuentro con mi equipo (minuto 15 ~ 20, tal vez antes) ya está score 4vs13 o 2vs11, qué debería hacer?, admito que no sé precisamente cómo llevar mi ventaja a otras líneas.","replies":[{"poster":"Zelos From Jonia","date":"2018-03-04T10:36:19.565+0000","up_votes":1,"down_votes":0,"body":"Hola, disculpa la demora. \n\nBueno retomando, ayer tuve una aprtidita donde iba bastante feed, un equipo enemigo decente y mi equipo muy cerrado un supp afk, un top no tradicional (perdiendo linea) un jungla que minuto 30 queria seguir buildeandose asesino (con un score de 2/8) y un adc que era nuevo y hacia lo que podia.\n\nPerdi la partida, sali con buen kda y farm, creo que obtuve una a, tire 5 torres y un nexo, mas de eso no llegue, sencillamente el enemigo debe haber estado en premade, dobles rotaciones y superioridad en todos lados exepto en mi linea.\n\nBien, hasta aca yo podria decir perdi por mi equipo, y en si los tuve en contra, pero yo que hice? \n- Yo rote, saque la primera sangre, el drake solo, cubri objetivos, farm, kills, ayude. Pero no gane, por que?\n\nBueno primero y principal, no se las gana todas, es un juego de equipo, yo tenia desventaja y el enemigo se organizo, no hay mas (sin mencionar que me enfocaban cada vez que aparecia).\n\nLo que pude sacar en limpio para mejorar es que no pude lograr que el jungla dejara de trolear, desde el inicio le fue mal, trate de darle consejos, de calmarlo, y en lo posible le mostre que todos eran un blanco facil si nos organizamos, hasta ganamos una tf algo abstracta. \n\nPodria quejarme, pero tomo lo que vi como punto flaco para mejorarlo. Poca vision (aunque mis wards fueron los unicos, me faltaron wards), mi itemizacion no lo compenso, no llegue a hacer el estandarte, para seguir la carrera de daño contra tanks, ni me hice el draktar con el que podria haber limpiado mas, No encontre una condicion de victoria clara, quizas si gankeaba al menos gankeable de todos (el solobot) podria haber hecho escalar mas a una cait.\n\nLa cuestion para avanzar es refinarse, y mejorar uno.\n\nYo era un zed (con el que estoy hiper oxidado) mis jugadas fueron buenas, mis mecanicas decentes, bajas pero decentes, lei el mapa, saque objetivos, kills, hice \"todo bien\" pero evidentemente en esa partida no era lo que hice lo optimo.\n\nSi vas top, por ejemplo darius o camille, mi consejo es que estes con tp, y muy atento a bot, y sobre todo a mid. Lee muy bien un gank enemigo, para contracaer en bot, y en mid podes caer desde atras de la linea enemiga si esta pusheado y pokeado.\n\nRecorda que no siempre necesitas daño, por ejemplo hasta platino1, con un shen podes solo farmear y mantener en linea al top rival (acordate que le podes cancelar el tp con tu taunt) y estar en el resto del mapa dando vuelta tradeos con la ult. Al menos esa sencilla jugada sigue siendo muy op.\n\nSaludos y suerte!","replies":[]}]}]}]}