{"poster":"James Moriarty","date":"2015-09-27T23:32:24.908+0000","title":"Modo Fuego amigo,  CC Aliado o Todos contra todos","subforum":"Charlas Generales","up_votes":42,"down_votes":2,"body":"**Modo Fuego amigo**\n\nNo deberia ser la unica persona que penso en poder **atacar a aliados en algun tipo** **de modo**. Asi como algunos _shooters_ u algun otro tipo de _Death Match_. Desde el vamos es una gran diferencia entre este y otro tipo de juegos, pero  implementar algo asi en_ League_ no es descabellado con tantos modos genialmente explotados aqui, pero siganme la corriente un poco mas.\n\nPongamos una escena, el **_abismo de los lamentos_** por ejemplo.\nPiensen en algunas consecuencias divertidas o , porque no , interesantes de da&ntilde;o aliado en este mapa:\n\n* Hongos de Teemo siendo pisados indiscriminadamente\n* Blitzcrank agarrando aliados tanto para **salvarlos** como para da&ntilde;arlos\n* Los aliados podrian tener que esquivar las ultis de Jinx , Ashe, Ezreal, Nami entre otros\n* inclusive las bombas de Zilean lo convertirian en un permaban (siempre suponiendo bans como en todos los modos temporales de League)\n\n\n* un datalle extra **La voz del relator** diciendo **_&quot;has matado a un aliado&quot;_**\n\n**Ajustes de Fuego amigo que seleccione del comentario de _Gambito700_:**\n\n1.  los aliados no pueden pegarse ataques basicos\n\n2. ** Uno puede asistir las kills del enemigo**. (stune a mi suport con los mascafuegos de jinx y el adc enemigo la mato. Asistencia para mi y kill para mi enemigo)\n\n3.  El oro por asistir kills del enemigo sera el mismo que el de asistir kills de aliados.\n\n4. ** Las trampas no las ven los aliados y pueden activarlas.** (si lleno mi jungla de hongitos de teemo puede venir a mi jungla y pisarlos todos. Este sera envenenado y relentizado (con un porcentaje reducido) Tambien las cajas de shaco aplicarian fear a mis aliados y estas les disparan (daño reducido) trampas de cait, nida, etc)\n\n5. **Los daños y relentizaciones en area afectaran un 30% menos de relentizacion y 70% de daño (Para aliados!)** Por ejemplo:\nUna Morgana Ultea en medio de una TF stunea a todos los enemigos y aliados pero a los aliados un 30% menos de tiempo y un 70% menos de daño a aliados (pero si aplicaria los efectos de vampirismo (pasiva de morgana) Asi mismo el \"charco\" de morgana dañara y relentizara en menor cantidad a los aliados.\n\n6. **Al dañar a un aliado el atacante queda silenciado 3 segundos**\n\n7. Los **asesinatos hacia aliados no dan oro** y a su vez asesinar un aliado hace **perder todo el oro ganado hasta el momento**\n\n8. Se debera recompensar **NO A LOS ASESINATOS ALIADOS** sino a las victimas por aliados. De esta forma podria otorgarse un icono particular del evento a quienes allan sido asesinados por aliados 30 veces. \n\n\n\n-Entre el puntos 6 , 7 y 8 motivaria mucho menos liquidar aliados. (actualizado 28/09)\n\n\n**Modo CC Aliado**\n\nLas opciones son variadas, pero si lo pensamos detenidamente no seria muy efectivo tener un team que seguramente correra a matarse entre aliados **( o si?)**. \nTal vez podria no necesariamente jugarse a **atacarse entre aliados** sino utilizar un _control de masas _ entre aliados (sin causar da&ntilde;o) y de esta forma poder utilizar habilidades del mismo en aliados, las siguientes como ejemplo:\n\n* Los empujones de Alistar\n* La pasiva de braum\n* El gancho de Blitzcrank\n* Las trampas de Caitlyn\n* El ulti de Urgot\n* El stun de Morgana\n* La ulti de Gragas\n* La ulti de Zac\n\nEntre otras tantas variables divertidas.\n**Pos data: esto se veria brutalmente afectado si se pudiesen modificar algunas valores en este modo de juego que permitieran &quot;menos gravedad&quot; y asi impulsar con las habilidades a otros jugadores un poco mas lejos**\n\n**Todos contra todos**\n\nTras ver lo improductivo del modo fuego amigo o lo dificil de recrear un modo CC Aliado puede derivar en lo siguiente, un modo **Todos contra todos **:\n\nPosiblemente mas efectivo en un mapa como el _**Dominion**_ respawneando un personaje por cada espacio o editando dicho mapa para mas espacios de respawn. (estoy mas que seguro de que la comunidad con conocimiento del tema ayudaria en esto al menor pedido por parte de Riot).\nUn problema logico podria ser la cola , propongo una cola similar a la clasificatoria, dependiendo de cuantos jugadores puedan aplicarse al modo, por orden de llegada.\nAunque aparescan en dos bandos en seleccion de campeon, seguramente, con mucho trabajo de rito, pueda reconocerse cada jugador como independiente del resto. (&iquest;llevaria un tiempo desarrollar esto?)\n\n\n\n**imaginen las posibilidades de cada modo**\nPersonalmente me motiva mas el CC Aliado pudiendo ayudar o divertirme con mis aliados con algunos ejemplos:\n\n* Alistar tirando un aliado bajo torre, o incluso Vayne dejando un aliado como carnada\n* Blitzcrank salvando a su aliado con gancho, algo similar podria hacer Urgot con su ulti, o incluso Darius con su E agarrar a un aliado tanto para salvarlo como para llevarlo al mas alla\n* Sona corriendo por sobrevivir ultea a sus aliados para que los maten y poder sobrevivir ella\n(algo similar con la ulti de varus , el tornado de Janna o el stun de morgana)\n* Gragas pudiendo hacer un desastre con su ulti, desparramando tanto aliados como enemigos por todos lados\n\n\nLas opciones podrian ser infinitas y por demas graciosas en estas variables de modo. Espero que les guste o que propongan mejoras a esta base de modo. Una buena critica constructiva seria clave para perfeccionar cualquier idea.\nEspero que les guste.","replies":[{"poster":"Desaroll","date":"2015-09-27T23:41:34.733+0000","up_votes":15,"down_votes":0,"body":"Como modo temporal sería muy entretenido.\n\nNo se por que me imaginé un \"Los Juegos del Hambre\" en la grieta. Sin visión del mapa, las torres y demás enemigas de todos, y un timer al inicio con un \"alto el fuego\" de unos 3 minutos. Luego de eso, todos contra todos!\n\nPodría llegar a ser muy entretenido xD\n\nSuerte!","replies":[{"poster":"kiuhm","date":"2015-09-29T23:29:01.255+0000","up_votes":2,"down_votes":0,"body":"y que haya items escondidos por ahi :o","replies":[]}]},{"poster":"Natchin","date":"2015-09-28T02:43:23.117+0000","up_votes":9,"down_votes":0,"body":"Por fin sale un post decente de este antro de trolls.","replies":[]},{"poster":"Rebkans","date":"2015-09-28T00:03:46.515+0000","up_votes":4,"down_votes":0,"body":"Yo tambn venia pensando en el modo de todos contra todos. Seria muy divertido y opino lo mismo que vos, en que el mapa de dominion seria el ideal para dicho modo. Salvo que Riot diseñe otro mapa, cosa que veo complicado que lo haga.\nSobre los otros modos, no se me habian ocurrido, aunque parecen muy divertidos","replies":[]},{"poster":"gambito700","date":"2015-09-27T23:56:56.913+0000","up_votes":4,"down_votes":0,"body":"estaria bueno, pero con algunas restricciones. por ejemplo:\n- Los aliados solo podrian ser afectados con control de masas.\n(nada de agarrarse a basicos en base por que seria una locura) Por ejemplo una jinx te atrapa con sus cocodrilos pero no te puede agarrar a basicos.\n- Los daños y relentizaciones en area afectaran un 30% menos de relentizacion y 70% de daño (Para aliados!) Por ejemplo:\nUna morgana Ultea en medio de una TF stunea a todos los enemigos y aliados pero a los aliados un 30% menos de tiempo y daña a los aliados un 70% menos (pero si aplicaria los efectos de vampirismo (pasiva de morgana)) Asi mismo el \"charco\" de morgana dañara y relentizara ({{item:3116}} )  en menor cantidad a los aliados.\n- Un aliado no puede matar a ningun aliado, Pero si puede bajarle un 90% de vida como maximo. (usando daños y etc en areas y demas)\n- Los efectos de impacto aplicarian las mismas reglas anteriores. Una R de jinx explotaria si toca un aliado pero no le realiza el mismo daño que a un enemigo. Asi mismo la explocion tendria su daño reducido para aliados.\n- Uno puede asistir las kills del enemigo. (stune a mi suport con los mascafuegos de jinx y el adc enemigo la mato. Asistencia para mi y kill para mi enemigo)\n- El oro por asistir kills del enemigo sera el mismo que el de asistir kills de aliados.\n- Los ganchos de blitz, tresh, empujones de alistar, R de tristana, R de jana, vayne, hecarim (habilidades que muevan al enemigo/aliado) se pueden usar en aliados, pero le supondran un aumento de movimiento. (si le lanzo un gancho a mi adc con blitz le causare daño pero le dare un leve aumento de movimiento temporal) (si le lanzo la R de trist a mi suport lo empujo y gana un aumento de movimiento temporal y le causare daño reducido) \n- Las trampas no las ven los aliados y pueden activarlas. (si lleno mi jungla de hongitos de teemo puede venir mi jungla y pisarlos todos. Este sera envenenado y relentizado (con un porcentaje reducido) Tambien las cajas de shaco aplicarian fear a mis aliados y estas les disparan (daño reducido) trampas de cait, nida, etc)\n\n\nNo se me ocurre nada mas pero, con esas modificaciones quedaria muy bueno el modo de juego.","replies":[{"poster":"James Moriarty","date":"2015-09-28T00:08:30.414+0000","up_votes":1,"down_votes":0,"body":"El modo CC aliado cubre la idea de usar solo el control de masas sin daños. ahora , las restricciones que hiciste a lo que le llamo \"fuego amigo\" son espectaculares, te envidio, se me tendria que haber ocurrido. {{item:3151}}","replies":[{"poster":"gambito700","date":"2015-09-28T07:35:55.988+0000","up_votes":2,"down_votes":0,"body":"tu idea es buenisima y te recomiendo que la re-postees en un par de dias en diferente horario. Asi tendras mas opcion para que la vea un rojo. Con algo (mucha mucha) de suerte, alguno lo vera y lo planteara en riot. Asi con mucha mucha mas suerte quizas un dia veremos este modo de juego. \n(despues podran decir que lo tenian pensado hace 2 años, pero estaba in-progres, Todos disfrutamos del modo de juego y ellos tendran una idea nueva :) )","replies":[]}]},{"poster":"James Moriarty","date":"2015-09-28T03:16:58.113+0000","up_votes":1,"down_votes":0,"body":"ahi edite algunas cosas , gracias por tus ideas, sos un genio.","replies":[]}]},{"poster":"FoXSk4IP","date":"2015-09-28T02:41:03.074+0000","up_votes":2,"down_votes":0,"body":"Yo pienso en un \"todos contra todos\" pero en pareja , osea, \"5 Parejas\" peliando contra las demas.\nSeria como un \"2 v 2 v 2 v 2 v 2\"\n\nSimple pero cooperativo :D","replies":[{"poster":"James Moriarty","date":"2015-09-28T03:53:16.766+0000","up_votes":3,"down_votes":0,"body":"Deberias hacer un post desarrollando esa idea o te la robo \n{{champion:36}}","replies":[{"poster":"FoXSk4IP","date":"2015-09-28T10:49:36.439+0000","up_votes":3,"down_votes":0,"body":"Robala si queres :D\nPodrias agregarla al post y poner debajo (idea robada de un comentario), mientras que se haga el mod no me importaria jajajaj","replies":[]}]}]},{"poster":"Whitesse","date":"2015-09-29T11:19:35.889+0000","up_votes":2,"down_votes":0,"body":"Me encantó","replies":[]},{"poster":"Dracárys","date":"2015-09-29T02:01:17.457+0000","up_votes":2,"down_votes":0,"body":"Creo que seria bueno cambiar algunas cosas... yo pondria un modo definitivo en el que se pueda asesinar a un aliado cuando ya no tenga opcion de vida,\nejemplo: un aliado con ignite, o algun tipo de veneno... de esta forma denegarlo y simplemente evitar que el enemigo se lleve el oro del asesinato  \n(esto se tendria que poder realizar cuando el aliado tenga  menos del 3% de su vida)","replies":[{"poster":"James Moriarty","date":"2015-09-29T03:04:04.221+0000","up_votes":1,"down_votes":0,"body":"\"el asesinato aliado como forma de denegarle el oro al enemigo\" brillante, una posibilidad espectacular","replies":[]}]},{"poster":"CJ14","date":"2015-09-29T00:17:17.090+0000","up_votes":2,"down_votes":0,"body":"Esta es la mejor idea que he leído en harto tiempo. Denle una porogalleta a este hombre...Y ojala se cumpla y tengamos el modo.","replies":[]},{"poster":"tacito92","date":"2015-09-28T22:26:22.682+0000","up_votes":2,"down_votes":0,"body":"esta buena la idea pero el fuego aliado, seria demasiado divertido para aquellos que solo buscan, molestar de manera muy sutil, lo podrían emplear para matar aliados todo el rato y hacer que pierda su equipo, con ese tipo de intenciones.","replies":[{"poster":"James Moriarty","date":"2015-09-29T00:06:09.072+0000","up_votes":1,"down_votes":0,"body":"Eso es algo que solo podemos comprobar al jugarlo , por suerte.","replies":[]}]},{"poster":"Zabivaka","date":"2015-09-28T04:11:26.894+0000","up_votes":2,"down_votes":1,"body":"No entiendo porque los modos de juego tienen que ser temporales\nsi despues de 1-2 años que estuvieron en el supuesto taller los cambios son minimos y para mal","replies":[{"poster":"Assert","date":"2015-09-28T14:37:59.760+0000","up_votes":2,"down_votes":0,"body":"Los sacan para que no estén todo el año y la gente se aburra de ellos. Lo usan como una herramienta para elevar la cantidad de usuarios cuando entra a caer por aburrimiento o otra cosa.","replies":[{"poster":"Zabivaka","date":"2015-09-28T21:42:07.119+0000","up_votes":2,"down_votes":0,"body":"Y pero es opcional jugar esos modos, no es que esta reemplazando las colas normales, si la gente se aburre simplemente lo ignora y ya esta.\nCon esa logica deberian sacar el aram, aunque sea bastante jugado hay gente que se aburrio de el","replies":[{"poster":"Assert","date":"2015-09-28T22:07:26.028+0000","up_votes":1,"down_votes":0,"body":"Creo que no me entendiste, crear un modo de juego no es nada fácil; puede llevar hasta años dependiendo de la tarea que se realice. Es mas fácil sacar el juego y que la gente este ansiosa un cierto tiempo, que dejar el juego que se aburran de él y la gente les reclame algo nuevo o distinto.\n\nARAM existe y permanece, al igual que creador de equipos(que según ellos resulto un fracaso - para mi no), por el simple hecho de que todo Juego en general tiene que tener al menos una versión alternativa del juego tradicional (es un axioma básicamente en lo que respecta a la creación del juego).\n\nSaludos","replies":[{"poster":"Zabivaka","date":"2015-09-29T00:04:09.305+0000","up_votes":1,"down_votes":0,"body":"A lo que voy es que no pido que hagan otro modo de juego, sino que pongan todos los modos temporales que existieron y los dejen permanentes, asi la gente tendria una variedad grande y siempre que se aburra de un modo puede ir al otro.","replies":[{"poster":"James Moriarty","date":"2015-09-29T00:16:56.812+0000","up_votes":1,"down_votes":0,"body":"No , Riot utiliza tematicas diferentes, una serie de eventos diferentes entre si, que sirven para dar \"aire fresco\" a LoL y poder renovar ventas o productos promocionales. Es una estrategia entre el entretenimiento y el marketing.","replies":[{"poster":"Assert","date":"2015-09-29T01:41:08.033+0000","up_votes":1,"down_votes":0,"body":"Lo que el dijo no llegue a responderte antes, que es lo que no me entendes.\nSi los hacen permanente tarde o temprano se van a aburrir, lo cual produce la caida de usuarios del LoL. Lo que implica tener que salir a buscarlo, por ende tienen que hacer algo nuevo y es mas facil poner algo viejo y poco usado.\nMismo ejemplo que navidad, xq se come pan dulce en esa época y xq esta rico comerlo. Pensalo\n\nSaludos","replies":[]}]}]}]}]}]}]},{"poster":"Soraka Skymaiden","date":"2015-09-28T20:22:39.306+0000","up_votes":2,"down_votes":0,"body":"{{champion:55}}   !!!!!!NONAKILL!!!!!!  .... EXTERMINIO","replies":[]},{"poster":"HornBore","date":"2015-09-28T19:17:33.246+0000","up_votes":2,"down_votes":0,"body":"Riot hazte presente para presenciar tan increible idea {{item:3151}}","replies":[]},{"poster":"CinosMatoi","date":"2015-09-28T17:51:32.383+0000","up_votes":2,"down_votes":0,"body":"hijo mio uste tiene mucha imaginacion :3 , me gusta tu idea","replies":[]},{"poster":"HalliaN FrøZCøre","date":"2015-09-28T16:40:43.584+0000","up_votes":2,"down_votes":0,"body":"Siii me gustaria demasiado... en todo caso ami me gustaria un Capture the flag Seria muy divertido envez de ir por el nexo por una bandera y tratar de derribar al enemigo que la tenga protegiendo a su aliado con la vida para llegar a la base... claro esta que si la bandera de nosotros tampoco esta... no podremos meter el punto... y habra que ir a pelearla no más jajaja seria muy buena","replies":[]},{"poster":"demondragon48","date":"2015-09-28T00:11:50.386+0000","up_votes":2,"down_votes":2,"body":"yo durante mucho lo pense y estaba por crear un tema en el foro, como tu, hasta que pense ¿y los troll?\nellos harian de estos modos de juego imposibles de jugar, no faltara el que se dedicara a solo molestar al equipo aliado y entregarselos al equipo enemigo para que los mate, es lamentable pero existen personas asi que no dejarian que este modo de juego llege a ser divertido, y sobretodo en este server\n\ny es una pena ya que abriria un mundo de posibilidades entre combos, estrategias y demases\n\npara que funcione todos aquellos jugadores que hayan recibido un numero significativo de reports por \"trollear\" tendrian que estar baneados del modo de juego, pero dudo que Riot pueda hacer algo asi","replies":[{"poster":"Natchin","date":"2015-09-28T12:51:13.518+0000","up_votes":2,"down_votes":0,"body":"Por si no lo entendiste, lo divertido del modo de juego sería precisamente eso","replies":[]},{"poster":"James Moriarty","date":"2015-09-28T00:17:12.941+0000","up_votes":1,"down_votes":0,"body":"Los trolls son inevitables en cualquier liga  y modo, no se puede jugar o crear cambios pensando unicamente en esta gente. Yo creo que este modo es mas bien para ver que puede hacer la comunidad con las herramientas que ofrece el CC aliado. con buena gente podrias armar buenas estrategias y con \"malos invocadores\" reirte un rato matandose entre si. La idea es tener la opcion de \"trollear\" y divertirse con las alternativas.","replies":[]}]},{"poster":"Rock the Climber","date":"2015-09-28T12:04:40.541+0000","up_votes":2,"down_votes":0,"body":"imagínate la ulti de {{champion:3}}  o {{champion:154}} La TF del caos XD","replies":[]},{"poster":"Tw0Bullets","date":"2015-09-28T01:42:41.090+0000","up_votes":2,"down_votes":0,"body":"Yo si tuviera que jugar uno seria el todos vs todos,seria bastante interesante verlo","replies":[]},{"poster":"LC ICloud","date":"2015-09-28T00:57:53.672+0000","up_votes":2,"down_votes":0,"body":"Buenishimo xD","replies":[]},{"poster":"MrAres","date":"2015-09-28T00:21:10.255+0000","up_votes":2,"down_votes":0,"body":"Alguien podria aprovecharse de esto... {{champion:30}} \nYo:{{champion:119}} \nLos demas:{{champion:63}}","replies":[]},{"poster":"Runth","date":"2015-09-29T11:54:09.570+0000","up_votes":2,"down_votes":1,"body":"no mas modos monotonos","replies":[]},{"poster":"minecraftprohack","date":"2015-09-29T12:16:41.397+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=James Moriarty,realm=LAS,application-id=v7qsfXsE,discussion-id=AKHVZMVQ,comment-id=,timestamp=2015-09-27T23:32:24.908+0000)\n>\n> **Modo Fuego amigo**\n> \n> No deberia sfffff\n{{summoner:7}} er la unica persona que penso en poder **atacar a aliados en algun tipo** **de modo**. Asi como algunos _shooters_ u algun otro tipo de _Death Match_. Desde el vamos es una gran diferencia entre este y otro tipo de juegos, pero  implementar algo asi en_ League_ no es descabellado con tantos modos genialmente explotados aqui, pero siganme la corriente un poco mas.\n> \n> Pongamos una escena, el **_abismo de los lamentos_** por ejemplo.\n> Piensen en algunas consecuencias divertidas o , porque no , interesantes de da&ntilde;o aliado en este mapa:\n> \n> * Hongos de Teemo siendo pisados indiscriminadamente\n> * Blitzcrank agarrando aliados tanto para **salvarlos** como para da&ntilde;arlos\n> * Los aliados podrian tener que esquivar las ultis de Jinx , Ashe, Ezreal, Nami entre otros\n> * inclusive las bombas de Zilean lo convertirian en un permaban (siempre suponiendo bans como en todos los modos temporales de League)\n> \n> \n> * un datalle extra **La voz del relator** diciendo **_&quot;has matado a un aliado&quot;_**\n> \n> **Ajustes de Fuego amigo que seleccione del comentario de _Gambito700_:**\n> \n> 1.  los aliados no pueden pegarse ataques basicos\n> \n> 2. ** Uno puede asistir las kills del enemigo**. (stune a mi suport con los mascafuegos de jinx y el adc enemigo la mato. Asistencia para mi y kill para mi enemigo)\n> \n> 3.  El oro por asistir kills del enemigo sera el mismo que el de asistir kills de aliados.\n> \n> 4. ** Las trampas no las ven los aliados y pueden activarlas.** (si lleno mi jungla de hongitos de teemo puede venir a mi jungla y pisarlos todos. Este sera envenenado y relentizado (con un porcentaje reducido) Tambien las cajas de shaco aplicarian fear a mis aliados y estas les disparan (daño reducido) trampas de cait, nida, etc)\n> \n> 5. **Los daños y relentizaciones en area afectaran un 30% menos de relentizacion y 70% de daño (Para aliados!)** Por ejemplo:\n> Una Morgana Ultea en medio de una TF stunea a todos los enemigos y aliados pero a los aliados un 30% menos de tiempo y un 70% menos de daño a aliados (pero si aplicaria los efectos de vampirismo (pasiva de morgana) Asi mismo el \"charco\" de morgana dañara y relentizara en menor cantidad a los aliados.\n> \n> 6. **Al dañar a un aliado el atacante queda silenciado 3 segundos**\n> \n> 7. Los **asesinatos hacia aliados no dan oro** y a su vez asesinar un aliado hace **perder todo el oro ganado hasta el momento**\n> \n> 8. Se debera recompensar **NO A LOS ASESINATOS ALIADOS** sino a las victimas por aliados. De esta forma podria otorgarse un icono particular del evento a quienes allan sido asesinados por aliados 30 veces. \n> \n> \n> \n> -Entre el puntos 6 , 7 y 8 motivaria mucho menos liquidar aliados. (actualizado 28/09)\n> \n> \n> **Modo CC Aliado**\n> \n> Las opciones son variadas, pero si lo pensamos detenidamente no seria muy efectivo tener un team que seguramente correra a matarse entre aliados **( o si?)**. \n> Tal vez podria no necesariamente jugarse a **atacarse entre aliados** sino utilizar un _control de masas _ entre aliados (sin causar da&ntilde;o) y de esta forma poder utilizar habilidades del mismo en aliados, las siguientes como ejemplo:\n> \n> * Los empujones de Alistar\n> * La pasiva de braum\n> * El gancho de Blitzcrank\n> * Las trampas de Caitlyn\n> * El ulti de Urgot\n> * El stun de Morgana\n> * La ulti de Gragas\n> * La ulti de Zac\n> \n> Entre otras tantas variables divertidas.\n> **Pos data: esto se veria brutalmente afectado si se pudiesen modificar algunas valores en este modo de juego que permitieran &quot;menos gravedad&quot; y asi impulsar con las habilidades a otros jugadores un poco mas lejos**\n> \n> **Todos contra todos**\n> \n> Tras ver lo improductivo del modo fuego amigo o lo dificil de recrear un modo CC Aliado puede derivar en lo siguiente, un modo **Todos contra todos **:\n> \n> Posiblemente mas efectivo en un mapa como el _**Dominion**_ respawneando un personaje por cada espacio o editando dicho mapa para mas espacios de respawn. (estoy mas que seguro de que la comunidad con conocimiento del tema ayudaria en esto al menor pedido por parte de Riot).\n> Un problema logico podria ser la cola , propongo una cola similar a la clasificatoria, dependiendo de cuantos jugadores puedan aplicarse al modo, por orden de llegada.\n> Aunque aparescan en dos bandos en seleccion de campeon, seguramente, con mucho trabajo de rito, pueda reconocerse cada jugador como independiente del resto. (&iquest;llevaria un tiempo desarrollar esto?)\n> \n> \n> \n> **imaginen las posibilidades de cada modo**\n> Personalmente me motiva mas el CC Aliado pudiendo ayudar o divertirme con mis aliados con algunos ejemplos:\n> \n> * Alistar tirando un aliado bajo torre, o incluso Vayne dejando un aliado como carnada\n> * Blitzcrank salvando a su aliado con gancho, algo similar podria hacer Urgot con su ulti, o incluso Darius con su E agarrar a un aliado tanto para salvarlo como para llevarlo al mas alla\n> * Sona corriendo por sobrevivir ultea a sus aliados para que los maten y poder sobrevivir ella\n> (algo similar con la ulti de varus , el tornado de Janna o el stun de morgana)\n> * Gragas pudiendo hacer un desastre con su ulti, desparramando tanto aliados como enemigos por todos lados\n> \n> \n> Las opciones podrian ser infinitas y por demas graciosas en estas variables de modo. Espero que les guste o que propongan mejoras a esta base de modo. Una buena critica constructiva seria clave para perfeccionar cualquier idea.\n> Espero que les guste.","replies":[{"poster":"James Moriarty","date":"2015-09-29T19:25:07.736+0000","up_votes":1,"down_votes":0,"body":"acabas de citar la publicacion, no de responder.","replies":[]}]},{"poster":"Steel Dragon","date":"2015-09-29T04:46:36.783+0000","up_votes":1,"down_votes":0,"body":"A mi me gustaria un modo survival como en un mapa de W3 (el enfos) xD seria entretenido :P{{summoner:31}}","replies":[]},{"poster":"MasPlau","date":"2015-09-28T22:55:10.253+0000","up_votes":1,"down_votes":0,"body":"En el modo todos contra todos, habria problemas con soraka( su w) y shen y kalista (sus r), habilidades que no se podrian usar. Pero buena idea","replies":[{"poster":"James Moriarty","date":"2015-09-29T00:14:27.556+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MasPlau,realm=LAS,application-id=v7qsfXsE,discussion-id=AKHVZMVQ,comment-id=0018,timestamp=2015-09-28T22:55:10.253+0000)\n>\n> En el modo todos contra todos, habria problemas con soraka( su w) y shen y kalista (sus r), habilidades que no se podrian usar. Pero buena idea\n\nSucede algo similar con otros modos temporales de Rito, donde por estar demasiado fuerte o demasiado debil simplemente los inhabilitan para esa cola. Capaz podria ser, como dijo otro invocador en los comentarios, que sean varios equipos de 2 jugadores en lugar de todos vs todos. El post plantea que se hagan este tipo de preguntas y que completen lo que no les cierra o no les gusta.","replies":[]}]},{"poster":"Ryu Kayzer","date":"2015-09-28T20:24:22.085+0000","up_votes":1,"down_votes":0,"body":"El problema es que no todos los campeones tienen cualidades para pelear o defenderse por si solos. Por ejemplo los del rol asesino y luchador reinarían o solo tanques. Sería entretenido pero por categorias","replies":[]},{"poster":"SKT TI XPEKE","date":"2015-09-28T18:40:29.487+0000","up_votes":1,"down_votes":0,"body":"estaria bueno \n{{champion:107}} {{item:3031}}","replies":[]},{"poster":"Ar Neko","date":"2015-09-28T18:13:25.299+0000","up_votes":1,"down_votes":0,"body":"si es deathmatch es deathmatch,,, a lo que me refiero es que, para un modo de juego asi deberian sacar un mapa nuevo, sin torres y con, por ejemplo, tantas bases como jugadores halla en la partida, una para cada uno.\nasi se cumpliria el todos contra todos que todos queremos, ganando asi la partida el jugador que llegue a determinado puntaje.","replies":[]},{"poster":"Galiers","date":"2015-09-28T16:16:25.143+0000","up_votes":1,"down_votes":0,"body":"buena idea, pero tendria que ser en un mapa nuevo o modificar el mapa de dominion para que el spam sea aleatorio en cualquier lado del mapa... un modo así donde todos tengan el spam en el mismo lado seria un punto de campeo seguro y aburriria al final","replies":[]},{"poster":"SpektremZ","date":"2015-09-28T16:11:48.458+0000","up_votes":1,"down_votes":0,"body":"Sinceramente , creo que un juegos del hambre bien pensado y diseñado como dice Desaroll , estaria sumamente bien , podria superar a U.R.F aunque es bastante dificil , tal cual lo dijo esta perfecto ya , aunque riot siempre puede mejorar todo","replies":[]},{"poster":"Assert","date":"2015-09-28T14:36:19.064+0000","up_votes":1,"down_votes":0,"body":"Perdona, pero va a ser un despelote divertido (a mi me gustaria). Pero piensa 2 min en la comunidad que tenemos, y ahora piensa como afectaría esto en la comunidad actual. A mi parecer no muy bien.\n\nSaludos","replies":[]},{"poster":"El Socialismo No","date":"2015-09-28T17:25:49.232+0000","up_votes":1,"down_votes":1,"body":"Es genial la idea, pero dado a la cantidad de trolles y gente que se toma poco en serio el juego si no es ranked, lo más probable es que terminaría siendo una partida frustrante.","replies":[]}]}