{"poster":"Høku","date":"2019-11-22T00:14:37.648+0000","title":"¿Estas tan cansado de la caida de FPS como yo?","subforum":"Problemas Técnicos","up_votes":19,"down_votes":2,"body":"..{{summoner:14}} Como saben desde los ultimos parches 9.20 en adelante, se reportaron multiples errores en el juego sobre caida de fps masiva y hasta congelamiento total de la pantalla. Partiendo desde el pedido se sabe que muchas personas con CPU \"bien armados\" tiene este problema, pero tendrian que darse al margen de la gente (como yo) que tiene DUAL CORE en su PC o NoteBook, que no podemos pagar por equipos mas caros y cual grande es el problema a la hora de jugar en la grieta con todos los cambios nuevos que se estan poniendo. \r\nQuizas el mensaje es igual para todos, muchos de nosotros nos sentimos frustrados ya que por mas que tengamos varios problemas con rankeds o toxicidad en el juego tengamos que tener un problema mas y sobre todo tan \"Molesto\" como es el de tener errores en el juego por la mala optimizacion en el mismo.\r\nPor eso convoco a todos nosotros para hacer valer nuestra comunidad en los demas servidores, para que entiendan que no todos podemos tener buenos equipos, y que los que tienen y tambien comparten los mismos errores o bugs puedan hacerse escuchar de una vez por todas¡¡ RIOT DANOS UNA SOLUCION A PROBLEMAS, LOS EVENTOS Y CAMBIOS PARA OTRO MOMENTO, ENTIENDE QUE SIN GENTE ACTIVA POR PROBLEMAS, NO PODRAS SUMAR INVOCADORES {{summoner:14}} ..\r\n{{sticker:sg-ahri-1}}  PORFAVORRR¡¡¡","replies":[{"poster":"Riot Mokarran","date":"2019-11-22T03:59:00.826+0000","up_votes":14,"down_votes":27,"body":"Reposteando lo que puse en el foro de LAN, como hace falta unir los foros eh...\n\nEl equipo en general como yo en particular hemos estado dando seguimiento a este problema. Entendemos que frustrante es, y los desarrolladores saben de el y están trabajando para encontrarlo.\n\nEl problema es que este fallo en particular esta limitado a configuraciones de hardware muy especificas y en general menos modernas que el standard, lo cual dificulta enormemente el encontrarlo. Nos vemos tan afectados en LATAM como se ven los jugadores de Turquía, Rusia y Brasil, quienes tienen rezagos tecnológicos similares al de nuestra región.\n\nPor una parte algunos jugadores vieron mejorías pues el ultimo parche optimizo bastante el nuevo cliente (lo que usas para dar click a Jugar, no el juego) pero aunque hay buenas pistas para encontrar el problema, hasta ahora no se ha encontrado y por lo mismo no se ha resuelto.\n\nEl equipo va a seguir buscando, pero no les puedo dar un horario o momento exacto donde este se va a resolver. :/","replies":[{"poster":"SonBots","date":"2019-11-22T06:55:37.676+0000","up_votes":19,"down_votes":0,"body":"Pero de que retargo tecnologico me hablas? en el Na hay gente con problemas de stuttering en placas 2080 rtx, desde el parche de pre season el juego no para de dar tirones en configuraciones que mueven una media de 300 fps en calidad maxima, no es un tema de hardware esto.. yo tengo un I7 7700k, gtx 1070, 16 de ram y el game instalado en un ssd y el juego me va como el culo desde el parche, cuando jamas tuve un problema para mover este potato game en calidad maxima.. muevo el RDR2 en calidad alta a mas de 60 fps con este pc sin tirones..q retargo tecnologico? haganse cargo de que rompieron el game y eso se llama incapacidad y encima ahora tambien le podemos poner inoperancia ya que no saben como mierda lo rompieron...","replies":[{"poster":"EstebanKote","date":"2019-11-22T15:32:29.677+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=SonBots,realm=LAS,application-id=X54mVVp0,discussion-id=aMhrcczw,comment-id=00020001,timestamp=2019-11-22T06:55:37.676+0000)\n>\n> Pero de que retargo tecnologico me hablas? en el Na hay gente con problemas de stuttering en placas 2080 rtx, desde el parche de pre season el juego no para de dar tirones en configuraciones que mueven una media de 300 fps en calidad maxima, no es un tema de hardware esto.. yo tengo un I7 7700k, gtx 1070, 16 de ram y el game instalado en un ssd y el juego me va como el culo desde el parche, cuando jamas tuve un problema para mover este potato game en calidad maxima.. muevo el RDR2 en calidad alta a mas de 60 fps con este pc sin tirones..q retargo tecnologico? haganse cargo de que rompieron el game y eso se llama incapacidad y encima ahora tambien le podemos poner inoperancia ya que no saben como mierda lo rompieron...\n\nEnviado desde mi Notebook con intel hd graphics.","replies":[{"poster":"Vaali","date":"2019-11-22T16:56:32.097+0000","up_votes":2,"down_votes":3,"body":"Que mas se puede esperar de un goldie desinformado\n> [{quoted}](name=EstebanKote,realm=LAS,application-id=X54mVVp0,discussion-id=aMhrcczw,comment-id=000200010000,timestamp=2019-11-22T15:32:29.677+0000)\n>\n> Enviado desde mi Notebook con intel hd graphics.","replies":[{"poster":"EstebanKote","date":"2019-11-22T21:03:24.988+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Vaali,realm=LAS,application-id=X54mVVp0,discussion-id=aMhrcczw,comment-id=0002000100000001,timestamp=2019-11-22T16:56:32.097+0000)\n>\n> Que mas se puede esperar de un goldie desinformado\n\ntípico ad hominem, que esperar de un platino 4 diciendo goldie ajjaaj {{summoner:14}}","replies":[{"poster":"Vaali","date":"2019-11-24T00:42:46.316+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=EstebanKote,realm=LAS,application-id=X54mVVp0,discussion-id=aMhrcczw,comment-id=00020001000000010000,timestamp=2019-11-22T21:03:24.988+0000)\n>\n> típico ad hominem, que esperar de un platino 4 diciendo goldie ajjaaj {{summoner:14}}\n\nNo jodas loco si sé que aquí en LAS no hay mucho nivel en general, pero es que tus respuestas no aportan en nada a los problemas que ha dado este parche (que OJO sólo fue de 100mb) a mucha gente.","replies":[{"poster":"Høku","date":"2019-11-24T17:40:28.699+0000","up_votes":2,"down_votes":0,"body":"típico.. no tengo problemas con lo mio y tiro negatividad en las cosas de los demás..  ni le hagas caso{{sticker:slayer-jinx-unamused}}  vaali","replies":[]}]}]}]}]},{"poster":"Skgwet","date":"2019-11-22T15:43:29.267+0000","up_votes":2,"down_votes":1,"body":"jajajja yo tengo un i3 6100,1060 3gb,8gb de ram y me anda perfecto 144 fps+ y todavía no se me congelo la pantalla :P...puede que sea el windows? tengo el windows 10 actualizado :S","replies":[]},{"poster":"Zeirøx Notwênd","date":"2019-11-22T17:58:23.115+0000","up_votes":1,"down_votes":0,"body":"¿Cómo puede ser? La pc de mi hermano tiene un AMD A8-7680 - 4GB de RAM y sin tarjeta gráfica, solo la integrada del procesador con W8.1. Y el juego le funciona a 60-70 fps sin caídas. Da que pensar lo tuyo...","replies":[{"poster":"Høku","date":"2019-11-24T17:41:33.616+0000","up_votes":1,"down_votes":0,"body":"te invito a leer los demás post sobre los mismo problemas en distintas pcs.. si mi problema fuera solo mio.. saldría al soporte por mi cuenta o pediría una ayuda mas individual..","replies":[]}]}]},{"poster":"IvVicious","date":"2019-11-22T13:10:38.101+0000","up_votes":7,"down_votes":0,"body":"Es lo único que les faltaría. Ya unieron nuestro soporte con el soporte horrible de LAN, nos sacaron nuestros rioters, se están tardando en sacarnos el foro y llevarnos al cementerio de LAN xd","replies":[{"poster":"Høku","date":"2019-11-24T17:41:59.872+0000","up_votes":1,"down_votes":0,"body":"sacto","replies":[]}]},{"poster":"Excorpion","date":"2019-11-22T11:52:43.915+0000","up_votes":8,"down_votes":0,"body":"Unir los foros es lo último que falta para deshacerse de LAS completamente...\n\n... Asi que la pretemporada se quedará sin mucho jugadores...","replies":[]},{"poster":"PasoPackXHonores","date":"2019-11-22T19:08:58.391+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Mokarran,realm=LAS,application-id=X54mVVp0,discussion-id=aMhrcczw,comment-id=0002,timestamp=2019-11-22T03:59:00.826+0000)\n>\n> Reposteando lo que puse en el foro de LAN, como hace falta unir los foros eh...\n> \n> El equipo en general como yo en particular hemos estado dando seguimiento a este problema. Entendemos que frustrante es, y los desarrolladores saben de el y están trabajando para encontrarlo.\n> \n> El problema es que este fallo en particular esta limitado a configuraciones de hardware muy especificas y en general menos modernas que el standard, lo cual dificulta enormemente el encontrarlo. Nos vemos tan afectados en LATAM como se ven los jugadores de Turquía, Rusia y Brasil, quienes tienen rezagos tecnológicos similares al de nuestra región.\n> \n> Por una parte algunos jugadores vieron mejorías pues el ultimo parche optimizo bastante el nuevo cliente (lo que usas para dar click a Jugar, no el juego) pero aunque hay buenas pistas para encontrar el problema, hasta ahora no se ha encontrado y por lo mismo no se ha resuelto.\n> \n> El equipo va a seguir buscando, pero no les puedo dar un horario o momento exacto donde este se va a resolver. :/\n\nY el problema de LAG para algunos ISP? es un chiste este servidor.","replies":[]},{"poster":"Blaing","date":"2019-11-22T23:57:38.401+0000","up_votes":3,"down_votes":0,"body":"asi piensan sacar 5 juegos mas? dios nos libre los  problemas que tendrán","replies":[]},{"poster":"MILFortune","date":"2019-11-22T14:10:32.859+0000","up_votes":6,"down_votes":1,"body":"> \n> están trabajando para encontrarlo.\n> \n\nEs el anti-cheat. Mirá, lo encontré. ¿algún inconveniente en admitirlo?","replies":[]},{"poster":"Meî","date":"2019-11-22T05:16:11.599+0000","up_votes":4,"down_votes":1,"body":"Es frustrante sí, pero yo comprendo lo difícil que es encontrar y solucionar un error de esta magnitud\nTomense su tiempo\n\nAl menos a mi me va algo mejor con este parche, así que me conformo con ello\n\nSólo espero puedan dar con el problema y solucionarlo, sin importar la fecha \nMientras nos avisen, pues está bien\n\nPor cierto, en caso de poder ayudar, como por ejemplo; enviando mi registro de lol creado con la herramienta de reparación Hextech(aunque dudo poder ayudar de esa manera, pero quién sabe si sirviese de algo) eso me lo puedes afirmar tú, pues no tendría drama en hacerlo.","replies":[]},{"poster":"lordeman10","date":"2019-11-23T01:45:09.280+0000","up_votes":3,"down_votes":0,"body":"Mi casa de barro en minecraft ya se convirtió en mansión de tanto esperar\n\nhttps://i.ytimg.com/vi/cMHe26pEsPg/hqdefault.jpg\n\nya va a salir!\n\nRespecto al tema de las arquitecturas.. es un dato interesante aunque está claro que mucha parte de los que jugamos lol lo elegimos desde un principio porque no pide mucho para estar a un nivel competitivo con otros jugadores, es decir el factor \"corre en cualquier máquina\" es una característica muy importante de lol al menos eso creo yo, si no le dan prioridad máxima a esto se les va a caer la popularidad del juego en picada, es decir si no lo hacen a tiempo los jugadores van a migrar a otros juegos","replies":[]},{"poster":"kai for the win","date":"2019-11-23T23:25:00.089+0000","up_votes":2,"down_votes":0,"body":"tengo una laptop de con intel celeron 1.6 Ghz, 8 de ram, con windows 10 y 64 bits y un ssd de 250 gb pero ya no me corre el lol bueno puedo entrar a partida pero va a 24 y deciende a 14 o 19 se que mi laptop es un asco pero antes podia jugar normal mente (desde la sesson 4 a la 9.2) despues de no se que parche no pude volver a jugar quede en platino 2 dos por eso asi que ahora juego solo normal para pasar el tiempo y si juego a full graficos al bajo sin ventana abierta durante la partida y todo lo posible para  que me ande mas estable pero nada funciona asi que solo me queda jugar aram y normal cuando termino de trabajar (si me an recomendable comprar una laptop nueva pero tengo que pagar arriendo, luz, agua, gas , hacer un pedido para el mes y con mi sueldo no me da el lujo). eso queria contar y ver si me daban alguna solucion de como hacer para poder jugar a minimo 30 fps","replies":[]},{"poster":"iNGENiO","date":"2019-11-23T18:20:49.800+0000","up_votes":2,"down_votes":0,"body":"Quisiera expresarte lo mucho que me molesta que digas que hace falta unir los foros, que te manifiestes quejándote de tener que escribir 2 veces lo mismo en 2 foros distintos.\n\nTe comento que este es el foro de LAS no es el de LAN. Entiendo que te dejaron a cargo de los 2 servers y te molesta tener que escribir las cosas 2 veces.\n\nTe cuento que con un copy and paste se resuelve fácilmente y no es necesaria la queja y la pesadumbre.\n\nTambién podrían decirle a tus superiores que pongan gente para LAS y otra para LAN. Así no tienes el fastidio que te provoca escribir 2 veces lo mismo en foros de diferentes regiones.\n\nAsí También que le den un poco de importancia al problema del PING al to para Movistar Argentina y otros proveedores porque ya van meses que no puedo rankear.\n\nY otros problemas que pasan en LAS. No es LAN.\n\nOjala nunca unifiquen los foros como es tu deseo.\n\nY ojala que vuelvan a poner gente a trabajar en LAS, y jamas tenga que escuchar a un rioter decir lo que vos decis.","replies":[]},{"poster":"yOCobain","date":"2019-12-16T19:19:38.079+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Mokarran,realm=LAS,application-id=X54mVVp0,discussion-id=aMhrcczw,comment-id=0002,timestamp=2019-11-22T03:59:00.826+0000)\n>\n> Reposteando lo que puse en el foro de LAN, como hace falta unir los foros eh...\n> \n> El equipo en general como yo en particular hemos estado dando seguimiento a este problema. Entendemos que frustrante es, y los desarrolladores saben de el y están trabajando para encontrarlo.\n> \n> El problema es que este fallo en particular esta limitado a configuraciones de hardware muy especificas y en general menos modernas que el standard, lo cual dificulta enormemente el encontrarlo. Nos vemos tan afectados en LATAM como se ven los jugadores de Turquía, Rusia y Brasil, quienes tienen rezagos tecnológicos similares al de nuestra región.\n> \n> Por una parte algunos jugadores vieron mejorías pues el ultimo parche optimizo bastante el nuevo cliente (lo que usas para dar click a Jugar, no el juego) pero aunque hay buenas pistas para encontrar el problema, hasta ahora no se ha encontrado y por lo mismo no se ha resuelto.\n> \n> El equipo va a seguir buscando, pero no les puedo dar un horario o momento exacto donde este se va a resolver. :/\n\nBuenas... ya pasó casi un mes de este comentario y sigo viendo que ocurre el problema. La \"mejoría\" que pude notar por decirlo de algún modo, es que el juego ya no se freezea de 3 a 5 segundos (es decir fps = 0), sin embargo el bajon de FPS sigue. Para ser más claro, la partida arranca en 36 fps. Incluso se puede armar una TF en ese \"inicio\" y anda de lujo, bajará un poquito, pero lo normal, no perjudica mucho la jugabilidad, al menos no a quienes ya estamos acostumbrados a jugar con una media de fps no muy alta pero aceptable. \n{{sticker:vlad-salute}} \n\nAhora viene el problema, tan solo unos minutos después el juego tiene momentos donde los FPS caen abismalmente a 06fps de media por un rato largo eh!... imaginate como se ve eso y lo perjudicial que es. Ultimamente, para no dejar de jugar, estuve jugando mucho JUNGLA, ya que si eso me pasa mientras hago un campamento no sería tan grave como que me pase mientras juego de ADC/SUPP por ejemplo... cuando voy a gankear tengo que rezar para que no me pase... ya que a veces no me ocurre y el gank sale magistral y a veces pasa en el mismo tipo de jugada, y me arruina absolutamente todo lo que pude planificar por la falta de reaccion del mouse al clic, por ejemplo...\n\n{{sticker:zombie-brand-mindblown}} \n{{sticker:zombie-brand-facepalm}} \n\nEl problema es serio porque afecta incluso a personas que tienen una buena PC. Sería muy interesante tener más novedades sobre este tema, porque con el tiempo que pasó desde entonces, se me hace un poco fuerte que todavía, casi 3 meses luego, no haya sido solucionado este punto, lo que hace que el juego sea..sinceramente... poco disfrutable.\n\nMuchas gracias.\nSaludos!\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Carmat","date":"2019-11-22T00:17:03.851+0000","up_votes":5,"down_votes":2,"body":"lo chistoso es que vienen a publicar aquí como si riot latam tienen algo que ver , el problema del cliente ojo no del servidor sino del cliente es de riot central porque ellos arman el software y el problema es a nivel mundial pero se nota mas en LAtam porque aquí muchos siguen jugando con pc de 5 a 10 años de antigüedad. yo particularmente nunca tuve esos problemas pero espero que lo solucionen justamente porque en latam urge mas por el nivel de adquisición de nuestra region.\n\nVa llegar un tiempo que ya ni con optimizar el juego correrá en arquitecturas antiguas, lol tiene como 10 años y mientras mas cosas ponen mas debe subir los requerimientos de la pc","replies":[{"poster":"Høku","date":"2019-11-22T00:21:20.411+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=RED Rąnger,realm=LAS,application-id=X54mVVp0,discussion-id=aMhrcczw,comment-id=0000,timestamp=2019-11-22T00:17:03.851+0000)\n>\n> lo chistoso es que vienen a publicar aquí como si riot latam tienen algo que ver , el problema del cliente ojo no del servidor sino del cliente es de riot central porque ellos arman el software y el problema es a nivel mundial pero se nota mas en LAtam porque aquí muchos siguen jugando con pc de 5 a 10 años de antigüedad. yo particularmente nunca tuve esos problemas pero espero que lo solucionen justamente porque en latam urge mas por el nivel de adquisición de nuestra region.\n> \n> Va llegar un tiempo que ya ni con optimizar el juego correrá en arquitecturas antiguas, lol tiene como 10 años y mientras mas cosas ponen mas debe subir los requerimientos de la pc\n\nsabes la cantidad de personas con GEFORCE 2080 TI, core I7 que se quejan de que el juego les anda en 30 de fps? y no me parece justo que pidan mas requisitos porque no todos tenemos para comprar maquinas nuevas.. yo tengo una notebook del 2017 y aun asi tengo estos problemas.","replies":[{"poster":"EstebanKote","date":"2019-11-22T15:30:56.427+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Høku,realm=LAS,application-id=X54mVVp0,discussion-id=aMhrcczw,comment-id=00000000,timestamp=2019-11-22T00:21:20.411+0000)\n>\n> sabes la cantidad de personas con GEFORCE 2080 TI, core I7 que se quejan de que el juego les anda en 30 de fps? y no me parece justo que pidan mas requisitos porque no todos tenemos para comprar maquinas nuevas.. yo tengo una notebook del 2017 y aun asi tengo estos problemas.\n\nque casualidad que haya una cantidad de personas con una 2080ti, otra gráfica para mentir no se les podía ocurrir no?","replies":[{"poster":"Høku","date":"2019-11-22T23:55:18.916+0000","up_votes":1,"down_votes":0,"body":"pasa que te quería hacer entender.. pero ya que sos tan listo no te tendría que explicar el reclamo.. si no tenes nada mas que aportar constructivo en vez de tirar mala onda.. kitea el post..","replies":[{"poster":"EstebanKote","date":"2019-11-24T13:10:28.367+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Høku,realm=LAS,application-id=X54mVVp0,discussion-id=aMhrcczw,comment-id=0000000000000000,timestamp=2019-11-22T23:55:18.916+0000)\n>\n> pasa que te quería hacer entender.. pero ya que sos tan listo no te tendría que explicar el reclamo.. si no tenes nada mas que aportar constructivo en vez de tirar mala onda.. kitea el post..\n\nporque llorar en un foro es algo constructivo?","replies":[{"poster":"Høku","date":"2019-11-24T17:37:13.266+0000","up_votes":1,"down_votes":0,"body":"bro.. desde el minuto 1 que escribiste \"llorar\" como todo toxico de LAS.. ya es nula tu opinión.. déjalo ahi","replies":[{"poster":"EstebanKote","date":"2019-11-26T14:42:24.140+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Høku,realm=LAS,application-id=X54mVVp0,discussion-id=aMhrcczw,comment-id=000000000000000000000000,timestamp=2019-11-24T17:37:13.266+0000)\n>\n> bro.. desde el minuto 1 que escribiste \"llorar\" como todo toxico de LAS.. ya es nula tu opinión.. déjalo ahi\n\nsi no vas a responder a mi argumento supongo que gane al discusión salu2","replies":[{"poster":"Høku","date":"2019-12-06T00:20:14.542+0000","up_votes":1,"down_votes":0,"body":"si te sentís contenta en tu cabecita.. felicidades ganaste una discusión.. encara la vida con esa actitud que vas re bien crack","replies":[{"poster":"EstebanKote","date":"2019-12-07T12:49:44.952+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Høku,realm=LAS,application-id=X54mVVp0,discussion-id=aMhrcczw,comment-id=00000000000000000000000000000000,timestamp=2019-12-06T00:20:14.542+0000)\n>\n> si te sentís contenta en tu cabecita.. felicidades ganaste una discusión.. encara la vida con esa actitud que vas re bien crack\n\n \"felicidades ganaste una discusión\" gracias pa","replies":[]}]}]}]}]}]}]},{"poster":"Zeirøx Notwênd","date":"2019-11-23T02:28:16.576+0000","up_votes":1,"down_votes":0,"body":"No puede ser, ya mencione anteriormente, una pc con un procesador [AMD A8-7680](https://www.google.com/search?q=AMD+A8-7680&amp;rlz=1C1MSIM_enAR872AR872&amp;oq=AMD+A8-7680&amp;aqs=chrome..69i57j0l4j69i60.623j0j7&amp;sourceid=chrome&amp;ie=UTF-8) + 4GB de RAM sin placa gráfica, LoL va 60 FPS sin caídas.\n\n{{sticker:vlad-salute}}","replies":[{"poster":"iNGENiO","date":"2019-11-23T18:27:49.628+0000","up_votes":1,"down_votes":0,"body":"Un a8 tiene 4 núcleos. No entiendo cual es tu punto.\n\nLa nota habla de procesadores de 2 núcleos. \n\nEntiendo al muchacho que dice que su i7 tiene problemas.\n\nPero en tu caso no se a que vas.","replies":[{"poster":"Zeirøx Notwênd","date":"2019-11-24T14:37:17.064+0000","up_votes":1,"down_votes":0,"body":"A lo que voy es que pretenden ampliar y sumar problemas a procesadores como un I7 con una 2080ti??? Solamente compare eso con el caso de la AMD A8 de 4 núcleos.","replies":[]}]}]}]}]},{"poster":"Sorceress White","date":"2019-11-22T04:42:51.015+0000","up_votes":3,"down_votes":0,"body":"re mil harta , pero bueno nadie se hace responsable , yo recomiendo crear una cuenta en LAN y denunciar lo que pasa en LAS , les puedo asegurar que riot no esta enterado de los problemas de sud américa","replies":[]},{"poster":"Kobü","date":"2019-11-22T19:34:14.870+0000","up_votes":1,"down_votes":0,"body":"yo no creo que sea por los hardware viejos , juego en una i3 2100 4 gb ram y una gt 710 1 gb ddr3 y me anda de 10 el juego, no en ultra pero me anda en  minimo 110 fps constantes, asique creo que el problema esta por otro lado :/","replies":[]},{"poster":"Akusai","date":"2019-11-22T16:39:15.027+0000","up_votes":1,"down_votes":0,"body":"Caida de fps? yo juego con un phenom x4 3.2 de hace 10 años y con una placa de 512 mb y el juego me tira a mas de 60 fps con todo en alto.  Decir que a todos les pasa es un sinsentido de otra forma maquinas como la mia andaria mucho peor de lo que andan las nuevas con respecto a este juego.","replies":[]},{"poster":"Carmat","date":"2019-11-22T00:26:41.541+0000","up_votes":1,"down_votes":3,"body":"seguro que habrá uno que otro problema en esas pcs pero son mínimas , yo escribo de lo que mas hay informacion , no tengo pruebas que tantas personas tienen problemas en pcs potentes , yo con mi i3 y gforce de gama baja no tengo problemas xd , si llegan a optimizar el juego sera para esas arquitecturas modernas pero olvidence para las pc de arquitectura antigua lo cual es el caso en latam, espero equivocarme porque muchos amigos míos juegan su lolcito en cores 2 duo todavía , pero siendo sincero lol ya tiene 10 años y no me sorprende que suba mas sus requerimientos.","replies":[{"poster":"AgrêsoR","date":"2019-11-22T23:09:50.516+0000","up_votes":1,"down_votes":0,"body":"Creo encontrar la solucion, siempre he ocupado la aplicacion Blitz para el lol, donde te entrega runas estadisticas etc etc, bueno lei en reddit que cerrando la app cuando jugabas lol no habian mas bajones de fps, LO PROBE  y taran! ningun problema mas, deberian probar si es su caso!","replies":[]}]}]}