{"poster":"UOL LagsAlot","date":"2015-05-14T17:31:02.435+0000","title":"Master Tier 1 Midlaner sucht ein Team (Dia2+)","subforum":"Clans & Teams","up_votes":9,"down_votes":7,"body":"http://imgur.com/v8yb4gD\n\nHey Leute,\nmein Name ist Lucas \"LagsAlot\" und ich spiele momentan im Master Tier 1 SoloQ auf dem EUW Server. \nMeine beste Platzierung war Top 72 und meine Peak League war Master Tier 1 352 LP.\nIch spiele meistens aggressive Midlaner wie z.B. Ahri, Nidalee, Fizz und Le Blanc, da ich die Situation des 1v1 und Counterplays sehr sch&auml;tze.\nIch bin auf der Suche nach einem deutschsprachigen  Team (bevorzugt), bei dem ich gerne die Position des Midlaners einnehmen w&uuml;rde. Alle Spieler des Teams sollten mindestens Diamant 2 sein. Eine dahinterstehende Organisation ist nicht notwendig. \nMeine Ziele (und damit auch die Ziele des Teams, welches ich suche) sind:\n- Trainieren, um selber und als Team besser zu werden\n- Erreichen der Challenger League (Teamranked 5v5)\n- EPS\n- -> Challenger Series\n\nWenn ihr Interesse habt, meldet euch bei mir ingame (LagsAlot) oder schreibt einen Kommentar unter diesen Post.\nDanke f&uuml;r das Durchlesen und ich w&uuml;nsch euch einen sch&ouml;nen Tag. :)","replies":[{"poster":"Kiimahrii","date":"2015-05-14T19:22:55.102+0000","up_votes":2,"down_votes":0,"body":"Habe deine YT-Kanäle gefunden, bist recht sympatisch und auch wenn ich dir im Sinne dieses Threads nicht weiterhelfen kann so hast du ein neuen Abo bekommen, wunsche dir das du ein gutes Team findest / gründest und ihr es tatsächlich bis ganz oben schafft!\n\nHier der Link zu seinem Kanal:\nhttps://www.youtube.com/user/LagsAlotLP/","replies":[{"poster":"UOL LagsAlot","date":"2015-05-14T19:48:30.572+0000","up_votes":1,"down_votes":0,"body":"Danke für die netten Worte. Ich versuch mein bestes. :)","replies":[]}]},{"poster":"Inqubus","date":"2015-05-14T20:00:05.565+0000","up_votes":1,"down_votes":0,"body":"ich mache gerade ein team auf  wir  sind dia 3 und dia 4 kannst dich bewerben falls interesse ist vieleicht nicht ganz wonach du gesucht hast aber kannst ja mal gucken","replies":[{"poster":"UOL LagsAlot","date":"2015-05-14T22:19:19.600+0000","up_votes":1,"down_votes":0,"body":"Laut eurem Post sucht ihr nicht nach einem Midlaner, daher kein Interesse. :)\nAber viel Glück.","replies":[{"poster":"Inqubus","date":"2015-05-15T08:50:37.352+0000","up_votes":1,"down_votes":0,"body":"unser midlaner kann top und midlane  spielen er ist variabel hatte aber mehr lust auf mid  aber er ist eigentlich auf beiden lanes glaich gut","replies":[]}]}]}]}