{"poster":"wasted13900ip420","date":"2015-11-15T01:00:21.093+0000","title":"Matchmaking","subforum":"Foren-Feedback","up_votes":1,"down_votes":0,"body":"Liebes Riot Team ich habe eine Frage die mich jetzt seit 3 Tagen besch&auml;ftigt.Doch um auf diese Frage zu kommen erst einmal etwas Vorwissen:Ich bin eigentlich relativ gut daf&uuml;r das ich silber bin,der Grund daf&uuml;r das ich silber bin ist die Tatsache das ich keine Ranglistenspiele spiele,weil sie mir keinen Spa&szlig; machen.Darum geht es aber nicht,sondern es geht um Normale Spiele.Ich spiele,wie eigentlich alle Spieler immer mit meinen Freuden,weil man dann einfach mehr Spa&szlig; hat.Jedenfalls ist mir aufgefallen dass meine sonstigen Gegner immer im Gold-Platin Bereich waren was f&uuml;r mich kein Problem ist da man bei Normalen Spielen ja auch etwas lernen soll,jedoch sind meine Gegner nachdem ich mit meinen Freunden viele Spiele hintereinander verloren hatte auf einmal statt Gold/Platin einfach Diamant was ich nun schon 4 mal innerhalb der Tage hatte.Es war immer das gleiche Prinzip wir hatten eine winning Streak dann eine totale loose Streak und haben dann nur noch gegen Diamonds gespielt was mich dann dazu veranlasst nicht weiter zu spielen da ich obwohl ich eigentlich wirklich gut bin &uuml;berhaupt gar keine Chancen habe.Mich &auml;rgert das halt nur weil man dann 20 Minuten erstens nur auf den Surrenderbuton wartet ;zweitens da man dann total deprimiert ist und drittens man die lust am spielen verliert und dann vielleicht anf&auml;ngt einfach nur noch zu flamen was ja auch nicht das Ziel des Spiels ist.Ich finde das schade weil ich mich echt doll auf die neue Saison gefreut hatte doch wenn sie schon so losgeht w&uuml;rde ich am liebsten nur noch meinen Account auf Ebay verkaufen damit ich noch etwas davon habe.Ich erhoffe mir keine wirkliche Antwort doch ich wollte das nur einmal loswerden da ich eigentlich gerne euer Spiel spiele und es eigentlich auch weiterhin gerne spielen w&uuml;rde.Danke f&uuml;r die Zeit die sie sich genommen haben um meinen Artikel zu lesen,ich hoffe es war keine verschwendete Zeit das hier zu schreiben so wie dei 4 Spiele die nur 20 Minuten lang waren. :)","replies":[{"poster":"MeDontEnglish","date":"2015-11-15T11:00:15.565+0000","up_votes":1,"down_votes":0,"body":"Es gibt da so eine Taste, nennt sich Enter und befindet sich unter dem großen nach Links zeigenden Pfeil.\nDiese Taste fügt einem Text Absätze hinzu und das wiederum führt dazu, dass dein Text besser lesbar ist.\n\nSo eine Textwand ist einfach nur schwer zu lesen..\n\nZum Thema an sich: \n\nWenn du die ganze Season nur Rankeds gespielt hast und Dia1 geworden bist aber keine Normals gespielt hast, dann ist deine Normal MMR ziemlich niedrig.\nWenn diese dann Normals Spielen, gerade Ende der Season, passiert es leider das diese aufgrund der niedrigen MMR auch mit Silber/Gold gematched werden bzw dagegen.\n\nIch finde das teilweise auch unfair, aber so ist es eben.. \n\nIst ja nur ein Normal und das hat man in 10min eh wieder vergessen.","replies":[]}]}