{"poster":"Lorgoglio","date":"2015-11-19T21:25:28.795+0000","title":"Poche skin per molti campioni","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ho notato che ci sono un casino di champion che hanno veramente poche skin, nonostante siano gi&agrave; usciti da molto tempo. Tra questi il mio preferito, {{champion:6}} , che &egrave; tra i primi campioni usciti (il 6&deg; ad essere stato ultimato), ed ha solo 2 skin!!! Per questo ho creato questa pagina dove chi vuole pu&ograve; sfogarsi esprimendo skin inventate da lui, dandone anche una descrizione, e chi ci riesce mettendone l&#039;immagine. Non valgono aspetti presi da altri siti o inventati da altri. E non aspetti di champion che abbiano 5 o pi&ugrave; skin (quindi non pi&ugrave; di 4). Comincio io.\n\nUrgot: Urgot Acchiappa-Pupazzi.  Ispirato alle claw machine, la parte sotto &egrave; l&#039;&quot;artiglio&quot;, la testa &egrave; chiusa nella vetrina della macchinetta, con intorno alla testa alcuni pupazzi, magari quelli venduti ufficiali dalla Riot, ma pi&ugrave; piccoli. Con la E, al posto di una bomba acida lancia un pupazzo, che esplodendo marchia i nemici di... ovatta.\n\nYorick (supremo): Yorick Araldo Dell&#039;Apocalisse.  In pratica, in base all&#039;ultima skill usata Yorick diventa simile al cavaliere dell&#039;Apocalisse corrispondente. Ed al posto di una pala ha una EPICISSIMA E GANZA SPADA!!!\n\n\nOra, a voi la fantasia!!! Chiss&agrave; che in futuro non mi vengano in mente altri campioni! Ma adesso aspetto i vostri!!!\n\nAggiornamento: 25/11/15\n\nTham Kench: Moby Kench.  Tham Kench ispirato a Moby Dick. è bianco, ha una cicatrice sull'occhio ed ha un arpione sul fianco inficcato. Con il CTRL+1 vomita il capitano Achab (caspita, spero si scriva così!).\n\nAzir: Azir dei picchi innevati.  Questa è molto semplice. In pratica, Azir, invece che assomigliare ad un falco d'oro (si, tranquilli, so che è un riferimento a Horus), assomiglia ad un'aquila reale.\n\nOrianna: Orianna festa in piscina.  Si, lo so, Orianna ha già 5 skin, quindi supera le 4 imposte proprio al pelo. Ma questo è piu che altro un accorgimento, infatti questa skin è già stata inconsapevolmente fatta dalla Riot! In pratica: Orianna festa in piscina: vedi l'Orianna che passa sullo sfonfo di Lee Sin festa in piscina.\n\nIllaoi: Devy Illaoi (o Illajones).  Questa è semplice. è Illaoi la sacerdotessa del kraken? Dice Devy Jones liberate il kraken? Bene, spiegazione è fatta.\n\nBraum: Braum insegnante.  Braum ha una lavagna al posto dello scudo e al posto della neve usa il gesso. Inoltre, ha quegli occhialini da vista senza stanghette piccolini tanto fighi.","replies":[{"poster":"Giacux","date":"2015-11-19T22:01:31.358+0000","up_votes":2,"down_votes":0,"body":"Urgot ne ha 3, e non è assolutamente il sesto campione, è stato rilasciato nel 2010...\nSia lui sia Yorick riceveranno sicuramente una skin quando arriverà il loro rework.","replies":[{"poster":"Lorgoglio","date":"2015-11-20T11:57:16.399+0000","up_votes":1,"down_votes":0,"body":"Si, è il 6 campione. Se ordini il negozio per ordine di uscita, lui sarà il 6. Inoltre, se anche mostri la sua icona in un dialogo, ad esempio così:{{champion:6}}, tra le 2 coppie di parentesi graffe ci sarà scritto champion:6 .\nInoltre, ho creato questa discussione non per vedere che ne pensate delle mie skin (grazie comunque delle info per Urgot e {{champion:83}}, anche se quest'ultimo non mi interessa particolarmente) ma per vedere la creatività degli altri utenti! ; )\nQuindi, perché non ti inventi qualche aspetto e me lo descrivi? Sarei veramente curioso! ^^","replies":[{"poster":"Giacux","date":"2015-11-20T15:55:37.770+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lorgoglio,realm=EUW,application-id=MJVj50Jw,discussion-id=uGoKXv9l,comment-id=00000000,timestamp=2015-11-20T11:57:16.399+0000)\n>\n> Si, è il 6 campione. Se ordini il negozio per ordine di uscita, lui sarà il 6. Inoltre, se anche mostri la sua icona in un dialogo, ad esempio così:{{champion:6}}, tra le 2 coppie di parentesi graffe ci sarà scritto champion:6 .\n> Inoltre, ho creato questa discussione non per vedere che ne pensate delle mie skin (grazie comunque delle info per Urgot e {{champion:83}}, anche se quest'ultimo non mi interessa particolarmente) ma per vedere la creatività degli altri utenti! ; )\n> Quindi, perché non ti inventi qualche aspetto e me lo descrivi? Sarei veramente curioso! ^^\n\nNon è assolutamente il sesto, lol è uscito nel 2009 con 40 campioni, e lui è uscito nel 2010.\nComunque http://st.elohell.net/public/chill/4047aad67f18089af35eb59a230bbaa7.jpg","replies":[{"poster":"Lorgoglio","date":"2015-11-21T13:55:56.649+0000","up_votes":1,"down_votes":0,"body":"Scusa, in effetti hai ragione tu, ma io non sono così veterano, e mi ero basato sui dati del negozio (questo vorrebbe dire che Annie di conseguenza potrebbe non essere il 1° campione? : (      ) ).\n\nComunque, visto che siamo già entrati nel tema? Voglio quel Battle Bunny Urgot! XD\nL'hai fatto tu? Perché scherzi a parte è davvero bello! \nSu su, altre skin! (quest'ultima frase riferita a tutti)","replies":[{"poster":"Giacux","date":"2015-11-21T14:32:23.589+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lorgoglio,realm=EUW,application-id=MJVj50Jw,discussion-id=uGoKXv9l,comment-id=0000000000000000,timestamp=2015-11-21T13:55:56.649+0000)\n>\n> Scusa, in effetti hai ragione tu, ma io non sono così veterano, e mi ero basato sui dati del negozio (questo vorrebbe dire che Annie di conseguenza potrebbe non essere il 1° campione? : (      ) ).\n> \n> Comunque, visto che siamo già entrati nel tema? Voglio quel Battle Bunny Urgot! XD\n> L'hai fatto tu? Perché scherzi a parte è davvero bello! \n> Su su, altre skin! (quest'ultima frase riferita a tutti)\n\nNono non l'ho fatto io, sono una scimmia con tumori alle mani a disegnare xD","replies":[]}]}]}]}]},{"poster":"MasterKeaton98","date":"2015-11-20T12:15:36.313+0000","up_votes":2,"down_votes":0,"body":"Lucian del ghetto:\n\nFelpa con cappuccio bianca, pantaloni stracciati neri o tuta blu. Collane d'oro e anelli d'oro. Tatuaggi dappertutto. Come armi, due revolver dorate.\n\nRyze anni 80.\n\nRyze Afro, con questo vestito:\n\nhttp://masters.mo-am.com/wp-content/uploads/2013/05/all2new_sml.jpg\n\nvedere il maschio.\n\nLancia palle di discoteca con la Q e la E.","replies":[{"poster":"Lorgoglio","date":"2015-11-25T13:51:44.266+0000","up_votes":1,"down_votes":0,"body":"Perché ho l'irrefrenabile voglia di comprarmi Lucian del ghetto, dovesse costare 9000 RP?\n\nQuanto a Rize, avrebbe già ben più di 5 skin ma... chi non vorrebbe un afroamericano che lancia palle da discoteca in faccia alle persone?\n\nPardon the intrusion! Yohohooo!!! Music is power!","replies":[]}]},{"poster":"Nibbio Bianco","date":"2015-11-20T00:01:48.712+0000","up_votes":2,"down_votes":1,"body":"Più sexy Urgot skins!","replies":[{"poster":"Lorgoglio","date":"2015-11-20T12:09:27.530+0000","up_votes":1,"down_votes":0,"body":"Già, sono d'accordo! XD","replies":[]}]},{"poster":"BosTiK JuNi0R","date":"2015-11-19T22:29:26.831+0000","up_votes":1,"down_votes":1,"body":"Si va beh...anche se io avrei notato che nel mio paese ci sono molte donne che hanno i pochi würstel..!","replies":[]}]}