{"poster":"BFISascha","date":"2015-06-12T04:17:26.396+0000","title":"Riots Strafen zu lasch??","subforum":"Spielerverhalten & Moderation","up_votes":0,"down_votes":2,"body":"Hallo Liebe Forum Mitglieder,\r\n\r\njeder kennt Sie:\r\n- Die Flammer;\r\n- Die Beleidiger;\r\n- Die Teacher;\r\n- Die Feeder (wobei meist ist es ja nicht absichtlich)\r\n- Die &quot;izi&quot; schreiber\r\n\r\nDoch warum gibt es soviele von Ihnen ??\r\n\r\nIch bin der Meinung, dass die Bann-Wellen, Chat-Einschr&auml;nkungen und Verwarnungen nochnicht genug sind.\r\n\r\nIch selber hatte eine Chat-Einschr&auml;nkung f&uuml;r 5 Spiele (Die Strafe war einfach l&auml;cherlich! - Nicht weil sie unbegr&uuml;ndet war, weil Sie einfach zu wenig war - 5 5er Premade spiele und das Thema war gegessen.)\r\n\r\nEs gibt immer noch sehr sehr viele Flammer in diesem Spiel, aus dem Grund das die Strafen einfach noch zu &quot;lasch&quot; sind, klar nach und nach verbessert es sich, von 3 premades im Team flammen nurnoch 2 oder 1er!\r\n\r\nWer ist auch meiner Meinung ? - Das es schon besser geworden ist, aber das System immer nochnicht hart genug durchgreift ?\r\nWer ist anderer Meinung ? und warum ?\r\n\r\nFreue mich auf eine sch&ouml;ne Diskussion :) Bitte ohne Flammen oder angreifen {{summoner:14}}","replies":[{"poster":"Humpelstilzche","date":"2015-06-12T09:33:07.816+0000","up_votes":2,"down_votes":0,"body":"2-Wochen-Bans, Chatrestrictions über tausende von Spielen, instant Permas....ich glaub härter geht es nicht mehr, ohne die Spieler zuhause zu besuchen.","replies":[{"poster":"Sirrkas","date":"2015-06-12T16:36:48.224+0000","up_votes":2,"down_votes":1,"body":"Riot schickt dann ein paar zwielichtige Gestalten, auch bekannt als Playerbehaviouraußendienstmitarbeiter, als letzte Stufe zu den Flamern und Trollen nach Hause. Würde bestimmt für Schlagzeigen sorgen.","replies":[{"poster":"Balmung","date":"2015-06-12T19:27:01.508+0000","up_votes":1,"down_votes":0,"body":"\"Guten Abend, wir würden gerne mit ihnen über Verhalten reden...\".\n\nIch denke was der Threadersteller wünscht sind nicht härtere Strafen, sondern eine niedrigere Hemmschwelle im System. Für \"easy\" am Schluss des Spiels, \"%%%%%%\"-Wünsche oder sonstiges dürfte es schonmal nen Timeout von ner halben Stunde geben :x","replies":[{"poster":"Sirrkas","date":"2015-06-12T20:28:06.195+0000","up_votes":1,"down_votes":0,"body":"Für mich klingt es eher so, als wären die Strafen einfach zu niedrig angesetzt. Aber ich weiß wirklich nicht, was man nach einem Perma noch machen soll. \n\n5 CRs sind für jemanden, der gerade so noch geprüft wird doch ein passender Ansatz und Denkanstoß zur Verhaltensbesserung.","replies":[{"poster":"Balmung","date":"2015-06-12T20:59:38.247+0000","up_votes":1,"down_votes":0,"body":"Auch denkbar, von seinen Beispielen ausgehend denke ich wäre ne Mischung aus beidem möglich.\n\nLeider, wie du bereits angesprochen hast, geht es einfach schlecht \"noch härter\" als Perma.\nVielleicht wären einfach mehr \"Denkanstöße\" nötig - für \"easy\" oder flamen mal ne Warnung nach dem Spiel mit 10 Minuten Sperre oder 5 Chatrestrictions.\n\nAktuell muss man sich ja schon ziemlich anstrengen bis man mal ne Strafe riskiert (welche sich dann meist auch ziemlich gewaschen hat), eventuell wäre es einfach besser wenn man Leuten eher verdeutlicht das \"Papa Riot\" auch mal so auf die Finger schaut.","replies":[]}]}]}]}]},{"poster":"Rkoturdo Ndo","date":"2015-06-12T07:49:41.897+0000","up_votes":2,"down_votes":1,"body":"Heya\nNur mal schnell eingeworfen, härtere Strafen sind nicht immer besser. \nhttp://www.praeventionstag.de/nano.cms/dokumentation/details/2339\n\nMfG Rkoturdo","replies":[]},{"poster":"Temudschinn","date":"2015-06-12T22:29:11.134+0000","up_votes":1,"down_votes":0,"body":"Bevor wir härtere strafen fordern sollten wir Studien suchen, die zeigen dass härtetre Strafen auch wirklich was bringen. Leider gibt es diese bisher afaik nicht wirklich...","replies":[]},{"poster":"Kaitri","date":"2015-06-12T19:14:07.086+0000","up_votes":1,"down_votes":0,"body":"5 spiele kriegst du auch selten.\ngibt leute die haben über 5000 spiele bann. die siehste nie wieder flamen :D","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-06-12T08:09:05.044+0000","up_votes":1,"down_votes":0,"body":"such mal nach \"14 Tage Banns\" in diesem Forum. Denn lese dir die geposteten Chat Logs durch, die aktuell reichen, um 14 Tage komplett rauszusein. Dann fälle dein Urteil, ob das zu lasch ist... Aber dann weißt du, wovon du mit konkreten Fällen redest...","replies":[]},{"poster":"Soulja38","date":"2015-06-12T05:27:44.164+0000","up_votes":1,"down_votes":0,"body":"wat labasch du :D\nich hab 4800 games chat ban beklommen sollte reichen oder :)","replies":[{"poster":"Caligo","date":"2015-06-12T05:36:56.256+0000","up_votes":1,"down_votes":0,"body":"Dann hast du's aber auch verdient xD","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-12T07:28:58.647+0000","up_votes":1,"down_votes":0,"body":"jo er hat verdient nie wieder den chat benutzen zu können. das system is einfach nur lächerlich.","replies":[{"poster":"4 R4nd0m N008","date":"2015-06-12T08:01:36.071+0000","up_votes":1,"down_votes":0,"body":"Wenn er/sie so ein schlimmer Flamer ist hat er/sie es auch verdient den Chat nie wieder benutzen zu dürfen. Keiner möchte das solche Leute etwas schreiben dürfen, wenn eh niemals etwas konstruktives dabei raus kommt.","replies":[]},{"poster":"Caligo","date":"2015-06-12T07:35:03.692+0000","up_votes":1,"down_votes":0,"body":"ja stmmt. perma bann wäre besser gewesen!","replies":[{"poster":"Sirrkas","date":"2015-06-12T07:39:23.441+0000","up_votes":1,"down_votes":0,"body":"Könnte ja noch kommen, wenn er weiter flamt. Ich schätze mal, die 4k CR sind noch von vor der Einführung der 2 Wochenbanns und Soulja38 könnte wohl als Kandidat dafür betrachtet werden.","replies":[{"poster":"Caligo","date":"2015-06-12T07:42:08.444+0000","up_votes":1,"down_votes":0,"body":"ja er/sie muss recht viel geflamt ahben, um nie wieder den Chat zu benutzen (ich bestreite jetzt mal dass er/sie so viele games macht)","replies":[]},{"poster":"AyRe CoNteMpT","date":"2015-06-12T14:26:40.875+0000","up_votes":1,"down_votes":4,"body":"das schlimme ist ja, dass die strafen total sinnlos sind. die chat restriction ändert absolut nichts daran, wenn jemand flamen will, sie straft nur leute, die TATSÄCHLICH teamplayer sind aber halt mal nen böses wort verlieren. einfach totaler quatsch","replies":[{"poster":"matamora","date":"2015-06-12T16:15:29.364+0000","up_votes":2,"down_votes":0,"body":"Wenn man \"mal ein böses Wort verliert\" kommt da nicht genug zusammen um ne Chatrestriction zu bekommen.\nWenn man allerdings genug miese Stimmung verbreitet um eine Chatrestriction zu erhalten, würde ich nicht mehr von einem \"Teamplayer\" sprechen... \n\nWenn du Teamplayer allerdings so verstehst, dass er Anweisungen gibt und alle halten sich dran (Und wenn jemand was \"falsches\" macht wird direkt geflamed, anders merkt der das doch nicht\")....\nDann hast du eine seltsame Auffassung von \"TEAMplayer\" ^^","replies":[]}]}]}]}]}]}]},{"poster":"crit in ur anus","date":"2015-06-12T06:28:47.074+0000","up_votes":1,"down_votes":0,"body":"glaubs mir flamer werden automatisch erkannt das system kennt wörter sogar sätze ;) schreibt zb eine bronze trash erkennt das system das und kommt es zu oft for gibts ne cr verbessert er sich in der CR nicht gibt es eine längere CR die direkt nach der ersten kommt^^\n\ngenauso gibts/wird es einen feederbuster geben der feeder erkennt ;)\n\nich muss dazu sagen wie ich angefangen hab hab ich auch teils richtig hart geflamed und auch mit lvl 30 etc ich war  da extrem toxisch jedoch habe ich dann schon selbst gemerkt das es so nicht geht bin jz schon lange sauber und versuche so gut es geht neulingen(spielern mit weniger wins) so gut es geht zu helfen, und das team zu motivieren","replies":[]},{"poster":"Iron IV dude","date":"2015-06-12T06:08:13.302+0000","up_votes":1,"down_votes":0,"body":"Gestern die ersten 3 Rankeds seit kp nem Monat gehabt. \nGame 1: Eine Annie die nur am flamen war, weil sie die Lane gegen Kata verloren hat und der Jungler nur bot war.\nWir haben das Game btw Haushoch gewonnen.\nGame 2: Traumgame, hatte eine schlechte Laningphase und alle waren freundlich ala \"Don't worry, we've got this\". So solls sein!\nGame 3: Fast Traumteam, außer unser Midlaner, der sich dachte \"Pah Teamfights, ich gehe solo durch die Gegend\", was letzten Endes jedoch eine richtig gute Entscheidung war (War ein Morde, ich war Tryn, splitpush as hell!)\n\nEntweder ich hatte mal Glück, oder es ist wirklich viel besser geworden.","replies":[]},{"poster":"Nuix","date":"2015-06-12T09:38:21.002+0000","up_votes":1,"down_votes":1,"body":"Für jeden Flamer, Afkler, Troll und dergleichen der eine Strafe erhält kommen zwei neue dazu. Zumindest erscheint es mit so.","replies":[]},{"poster":"XOFree","date":"2015-06-12T05:29:35.654+0000","up_votes":1,"down_votes":1,"body":"Doch warum gibt es soviele von Ihnen ?? ^^ weil es so viele kinder sind ^^","replies":[{"poster":"XOFree","date":"2015-06-12T05:30:44.185+0000","up_votes":1,"down_votes":1,"body":"ps: und ja es ist besser geworden","replies":[]}]},{"poster":"erzi222","date":"2015-06-12T06:35:22.273+0000","up_votes":1,"down_votes":8,"body":"warum es so viele flammer gibt? ganz einfach.\n\ndie leute sind mit dem ist-zustand des games unzufrieden, was schon in der champ selection anfängt.\nwenn die leute einem die leiblingsposition wegschnappen okay, ist so, geht man auf eine andere lane.\ndoch wenn man dann mit ansehen muss wie hohl gewisse leute spielen, kann ich flamme auf jedenfall verstehen.\n\nbei den teachern .... manche geben wirklich gute hinweiße, die aber gekonnt ignoriert werden.\nich habe selber mal einem nasus empholen magic ressist zu kaufen gegen einen rumble auf der toplane.\ndoch nasus musste erstmal sunfire cap kaufen und nach dem 7ten fed hat er auf mich gehört, aber es war schon zu spät.\n\nwegen easy .... riot sollte einfach den all chat entfernen, weil dieser keinen besonderen sinn hat, und nur für trollerei und beleidigungen da ist, oder um die gegner zu beten spieler xy zu reporten, was aber eigentlich 98% der leute egal ist. da gleiche geht für den after game chat. ein easy schreibe ich immer nur im teamchat, so beleidige ich keinen der gegner und kann mich über die unfähigkeit der gegner amüsieren (sry aber manche leute picken so dämlich, dass man schon drüber lachen muss).\n\nansonsten ... riot ist da wirklich ziemlich weicheierich ... wobei sie ja jetzt 2 wochen banns ausgesprochen haben, nachem sie ewigkeiten nach geeigneten strafen gesucht haben ..... lol. das hätte auch meiner oma einfallen können ... ehrlich richtig schlecht. \n\ndie chatbanns bringen null .... die leute benutzen dann eben nur noch die paar möglichkeiten des schreibens zum flammen und beleidigen. ka was sich riot bei diesem misst ausgedacht, klingt sehr nach züchtigung. eine richtige strafe wäre einfach den chat komplett einzuschränken. dann ist es auch fast eine wirkliche strafe und nichts halbes ... bzw es ist auch keine besondere belohung mit leuten dieser community schreiben zu dürfen.\n\nnaja, ich bin gespannt was für tolle ideen riot in zukunft bringen wird x) !","replies":[{"poster":"oOBerlinOo","date":"2015-06-12T09:06:06.545+0000","up_votes":1,"down_votes":0,"body":"Allchat ganz entfernen fände ich persönlich schade, ich nutze den nämlich eher dafür dem Gegner auch mal ein fettes Lob auszusprechen (z.B Ziggs Ult klaut mal eben den Drachen , weil keiner drauf warten mag das ich erstmal die Wards cleare ^^) . \nDas was du beim teachen ansprichst , musste ich leider auch erleben . Bin frisch im Ranked und dann auch noch Main Supp.....3 Leute sind auf Killjagd , keiner denkt ans pushen. Und was hat denn der Supporter schon für ne Ahnung ,wenn er drum bittet im Jungle ohne Sicht nicht einem einzelnem Gegner nachzujagen.....ist doch ein easy kill.....und schwupps waren es 5 gegner ^^. So musste ich leider 6 von meinen 10 Einstufungsspielen verlieren , 2 weitere aufgrund von afklern ^^.\nDas Report-System nutze ich inzwischen lediglich bei extremen Beleidigungen oder AFK , egal ob bei mir oder dem Gegner. Über ein \"izi\" steh ich inzwischen drüber.\nDas einzige was ich zu bemängeln hab is,t wenn man ein Report androht , oftmals die Antwort kommt: Mach doch , ist eh nur mein Smurf !\nStrafen jucken die meisten nunmal nicht. Ich hatte in meinen 4 Jahren einmal eine Verwarnung ..... wohl wegen Beleidigung ......konnte das leider nicht nachvollziehen , da ich eigentlich freundlich auf Dinge hinweise...wäre vielleicht gut wenn man in der Verwarnung einsehen könnte , was genau der Anlass dafür war ( also die Situation ...... oder Situationen^^) Bin seitdem sehr sehr vorsichtig in meiner Wortwahl geworden.","replies":[]}]}]}