{"poster":"Miccinov","date":"2016-12-08T14:56:50.740+0000","title":"Penso sia ora di disinstallare","subforum":"Discussioni generali","up_votes":2,"down_votes":5,"body":"Salve m8. Ok prima di flammarmi voglio sapere una cosa. Dopo un lungo periodo di inattivit&agrave; ripartendo dal bronzo V riesco nella scorsa season ad arrivare al silver IV. Ora nella preseason faccio 7 win e 3 lose...e mi sbatte in bronzo IV. E sappiamo benissimo tutti quanto sia difficile uscire dal bronzo e dal silver....mi aspetavo almeno di rimanere in silver IV e non di essere risbattuto cos&igrave; in basso...passa la voglia di giocare. come mai mi ha messo cos&igrave; in basso?","replies":[{"poster":"Sorry NoOb","date":"2016-12-08T16:10:48.576+0000","up_votes":2,"down_votes":4,"body":"Ragazzi è ridicolo, fate passare la voglia di giocare. Due season fa non giocai proprio quindi nella scorsa season dopo le qualificazioni fui inserito in bronzo 4, durante la season 6 giocando sono arrivato a s2 promo, ieri faccio le qualifiche e con 6 w e 4 L mi sbatte in bronzo 3. Oggi provo a giocare e su 3 game che faccio ho avuto la fortuna di capitare con 1 troll pick adc ( 10 minion in 37 minuti non avendo neanche scelto un adc ma un jungler...) , 1 troll pick supp( dopo 17 minuti era 0/15)  e 1 afk dopo aver feeddato il top player , ditemi voi come faccio a scalare la classifica?.... Onestamente mi sta passando la voglia di giocare, ci sono persone che non sanno giocare e si trovano in gold / platino e altre persone che sanno giocare che si ritrovano in bronzo / silver. Capisco che LoL è un gioco di gruppo e non un single player quindi purtroppo bisogna dipendere anche da altre persone, però cercate di essere obiettivi, cambiate metodo di qualificazione, non so., posizionate le persone in base allo score che fanno ogni game, fate una media tra tutte le partite , kill e death..... Cioè è assurdo che un player come me che di norma fa dalle 7 alle 15 kill a game giochi con persone che rendono inutile il tutto perchè cerebrolmente lesi.","replies":[{"poster":"Darkinknight","date":"2016-12-08T17:28:12.742+0000","up_votes":1,"down_votes":1,"body":"Ci sono persone che non sanno giocare e sono gold/platino concordo\nC'è gente che sa giocare e si trova a bronzo/silver...devo seriamente risponderti?chi si trova li è niubbo punto..accettatelo non è un crimine,è cosi e basta","replies":[{"poster":"Sorry NoOb","date":"2016-12-08T19:19:54.103+0000","up_votes":1,"down_votes":1,"body":"Sbagli, c'è chi come me che per qualche season non ha giocato e quindi non essendosi classificato purtroppo si ritrova in queste divisioni nonostante uno score positivo nelle 10 di qualifiche. E credimi è davvero una grande rottura di palle uscire da queste divisioni soprattutto quando trovi gente afk o troll.","replies":[{"poster":"Darkinknight","date":"2016-12-09T04:43:06.985+0000","up_votes":1,"down_votes":0,"body":"Ci sono stato anche io season scorsa,e ci andro questa season probabilmente..salire da li se non è il tuo elo è veramente ez\nLo score positivo non buol dire nulla,si viene piazzati piu in basso rispetto al mmr che si aveva precedentemente..quindi diverse season fa eri che so gold/silver?si viene buttati giu mediamente di una lega abbondante da qui deriva il bronzo IV,come per i platini il gold/silver e i diamond il gold\nChe poi il sistema fi piazzamento delle 10 qualificate non piaccia nemmeno a me è un altro discorso,perche è enormemente esagerato,ma se sono gold e finisco bronzo 4 salgo in veramente poche partite,è solo lo sbatti di fare quei 40-50 game per tornare vicino all'elo precedente..esempio l'altra season ero in promo per gold V,season scorsa sono stato messo B2..fino a s2 ho mantenuto una win rate intorno al 80%..se tu non riesci a vincerne molte beh..il sistema di qualificazioni allora ha funzionato bene(senza stare a ripetere la stessa solfa dei afk troll sia nel tuo team che nell'avversario e i vari motivi matematici che ti portano a salire senza problemi se sei piu forte del elo dove ti trovi)\nDa parte mia ti consiglio di non rankare per ora,perche ora come ora in bronzo trovi moltissimi ex gold oltre che i soliti bronzi e va piu a culo che non altro(salvo che tu non sia davvero molto piu forte di dove ti trovi","replies":[{"poster":"Sorry NoOb","date":"2016-12-09T17:19:00.970+0000","up_votes":2,"down_votes":0,"body":"Ragazzi non ho detto che è impossibile salire, ho solamente detto che è uno sbatti dal momento che trovi gente lesa a volte nel tuo team e a volte contro. Ieri sono salito da b3 a b2 ma ho dovuto fare 6 game di fila senza lose, se capita e credetemi capita che incontri qualche leso da 6 diventano 8 e cosi via, calcolando che ogni game dura mediamente sui 35 min se ti fai un conto sono 3,5 / 4 ore di gioco per 1 divisione senza mai perdere. Lo scrivere :\" passa la voglia di giocare\"  significa che se devo nerdare 4 ore alle buone per salire di 1 divisione e per lo più intossicarmi quasi ogni game scrivendo\" Plz regroup mid ecc ecc\" cose che reputo realmente le basi di league of legends , il mio svago dopo una giornata di lavoro diventa un mix di rompimento di scatole e nervature varie, quindi meglio smettere.","replies":[{"poster":"Darkinknight","date":"2016-12-09T18:01:29.951+0000","up_votes":1,"down_votes":0,"body":"Siamo a inizio season,non necessiti di nerdare e intossicarti..fai pure 1/2 ranked al giorno,hai 11 mesi per salire..oltre che non ci sono solo le ranked\nAltrimenti fai qualche giorno di nerdare esci da li e via(seriamenti cerchi di far ragionare i bronzi?io stompavo la lane e via dritto fino al nexus)\nSe vuoi smettere comunque liberissimo di farlo,ma non ne vedo molto il senso se questo è il motivo","replies":[]}]}]}]}]},{"poster":"DuckQuack0","date":"2016-12-08T16:19:02.454+0000","up_votes":2,"down_votes":6,"body":"> Capisco che LoL è un gioco di gruppo e non un single player\n\nEd ecco perché sei bronzo...\n\nImpara a giocare da solo ed imparerai a vincere","replies":[{"poster":"Sorry NoOb","date":"2016-12-08T18:53:20.612+0000","up_votes":2,"down_votes":0,"body":"Penso tu abbia frainteso il senso, gioco solo. Sicuramente il fatto di \"dipendere\" da altri player influisce in modo negativo sulle vittorie.","replies":[]},{"poster":"ImaqtWimmolo","date":"2016-12-08T17:15:12.272+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=DuckQuack0,realm=EUW,application-id=MJVj50Jw,discussion-id=2hEwnMgH,comment-id=00040000,timestamp=2016-12-08T16:19:02.454+0000)\n>\n> Ed ecco perché sei bronzo...\n> \n> Impara a giocare da solo ed imparerai a vincere\n\nQuoto tantissimo xD","replies":[]}]},{"poster":"Darth Ponzius","date":"2016-12-08T17:20:47.527+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Sorry NoOb,realm=EUW,application-id=MJVj50Jw,discussion-id=2hEwnMgH,comment-id=0004,timestamp=2016-12-08T16:10:48.576+0000)\n>\n> Ragazzi è ridicolo, fate passare la voglia di giocare. Due season fa non giocai proprio quindi nella scorsa season dopo le qualificazioni fui inserito in bronzo 4, durante la season 6 giocando sono arrivato a s2 promo, ieri faccio le qualifiche e con 6 w e 4 L mi sbatte in bronzo 3. Oggi provo a giocare e su 3 game che faccio ho avuto la fortuna di capitare con 1 troll pick adc ( 10 minion in 37 minuti non avendo neanche scelto un adc ma un jungler...) , 1 troll pick supp( dopo 17 minuti era 0/15)  e 1 afk dopo aver feeddato il top player , ditemi voi come faccio a scalare la classifica?.... Onestamente mi sta passando la voglia di giocare, ci sono persone che non sanno giocare e si trovano in gold / platino e altre persone che sanno giocare che si ritrovano in bronzo / silver. Capisco che LoL è un gioco di gruppo e non un single player quindi purtroppo bisogna dipendere anche da altre persone, però cercate di essere obiettivi, cambiate metodo di qualificazione, non so., posizionate le persone in base allo score che fanno ogni game, fate una media tra tutte le partite , kill e death..... Cioè è assurdo che un player come me che di norma fa dalle 7 alle 15 kill a game giochi con persone che rendono inutile il tutto perchè cerebrolmente lesi.\n\nper uno che non compra mai la sighstone da support è anche troppo., visto e considerato che l'unico modo in cui fai tutte queste kill è andare full ap con Brand da support senza ward o item da support. Quind praticamente il tuo è un continuo rubare risorse agli altri e non dare l'utilità che la tua posizione richiederebbe (neanche quella più basilare delle ward). Con un nome simile e un modo di giocare come il tuo è anche troppo alto il bronzo 3","replies":[{"poster":"Sorry NoOb","date":"2016-12-08T18:24:51.964+0000","up_votes":1,"down_votes":0,"body":"Be dal momento che sei andato a vedere i match history controlla anche il damage dato che dici \"rubo risorse agli altri\", il mio adc è perennemente feeddato. La sightstone non la compro ? dipende da come si evolve il game, di solito la compro altre volte no, cmq compro un bel po di ward... Ad ogni modo non meriteresti neanche risposta.","replies":[{"poster":"Laiho88","date":"2016-12-09T11:19:55.460+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sorry NoOb,realm=EUW,application-id=MJVj50Jw,discussion-id=2hEwnMgH,comment-id=000400010000,timestamp=2016-12-08T18:24:51.964+0000)\n>\n> Be dal momento che sei andato a vedere i match history controlla anche il damage dato che dici &quot;rubo risorse agli altri&quot;, il mio adc è perennemente feeddato. La sightstone non la compro ? dipende da come si evolve il game, di solito la compro altre volte no, cmq compro un bel po di ward... Ad ogni modo non meriteresti neanche risposta.\n\ngiochi support e non prendi la sightstone?Quello è quasi sempre il primissimo item da prendere!!!!!\n{{sticker:zombie-brand-mindblown}}","replies":[]},{"poster":"Darth Ponzius","date":"2016-12-08T20:21:46.121+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sorry NoOb,realm=EUW,application-id=MJVj50Jw,discussion-id=2hEwnMgH,comment-id=000400010000,timestamp=2016-12-08T18:24:51.964+0000)\n>\n> Be dal momento che sei andato a vedere i match history controlla anche il damage dato che dici &quot;rubo risorse agli altri&quot;, il mio adc è perennemente feeddato. La sightstone non la compro ? dipende da come si evolve il game, di solito la compro altre volte no, cmq compro un bel po di ward... Ad ogni modo non meriteresti neanche risposta.\n\nsi ok, 1 control ward per partita è comprare tante ward, e piazzi tanti trinket quanto i compagni, ciò significa mancanza di ward per la mappa che si fa sentire per tuto l'arco della partita. Non devi vedere come va, le devi comprare e stop. Se fai support ti devi attenere a fare certe cose, fare il mid laner aggiunto tagliando tutta la parte della visione e dell'utility non serve a nulla ed è dannosa per tutto il team. Però suppongo sia più semplice dire che gli altri sono lesi...","replies":[{"poster":"Sorry NoOb","date":"2016-12-08T20:55:19.562+0000","up_votes":1,"down_votes":0,"body":"Con questa nuova season fortunatamente ci sono i replay, se vuoi dai tu un giudizio sul se sono lesi o meno i player che incontro ^^ .","replies":[{"poster":"Darth Ponzius","date":"2016-12-08T21:03:28.733+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sorry NoOb,realm=EUW,application-id=MJVj50Jw,discussion-id=2hEwnMgH,comment-id=00040001000000000000,timestamp=2016-12-08T20:55:19.562+0000)\n>\n> Con questa nuova season fortunatamente ci sono i replay, se vuoi dai tu un giudizio sul se sono lesi o meno i player che incontro ^^ .\n\nnon vorrei sorprenderti ma a bronzo ci siamo passati bene o male tutti. E se continui a rimanere li significa che i problemi li hai tu nel tuo modo di giocare, come io o i miei per essere ancora a gold. è inutile trovare sempre la scusa di turno per non analizzare dove si sbaglia","replies":[{"poster":"Sorry NoOb","date":"2016-12-08T22:49:23.558+0000","up_votes":1,"down_votes":0,"body":"Ma non continuo a essere qui, se avessi letto, ho scritto che il posizionamento in bronzo 3  è ridicolo se un player ( come me )  era in promo per gold5 nella season scorsa. Inoltre esprimevo il mio malcontento nel giocare con player che  vanno afk dopo aver feeddato  o trollano in champ select, la scalata a gold o platino in questo modo è davvero una gran rottura di scatole e a lungo andare il giocare con queste persone ti fa odiare il gioco. Fine del discorso. : )","replies":[]}]}]}]}]}]}]},{"poster":"ImaqtWimmolo","date":"2016-12-08T15:49:10.973+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Miccinov,realm=EUW,application-id=MJVj50Jw,discussion-id=2hEwnMgH,comment-id=,timestamp=2016-12-08T14:56:50.740+0000)\n>\n> E sappiamo benissimo tutti quanto sia difficile uscire dal bronzo \n\nLol, per niente","replies":[{"poster":"DuckQuack0","date":"2016-12-08T16:09:59.592+0000","up_votes":2,"down_votes":1,"body":"io ci misi 3 giorni per salire da b3 a gold 5\n\nI Bot sono dei challenger in confronto xD","replies":[{"poster":"HeiKatarina","date":"2016-12-08T16:31:17.237+0000","up_votes":1,"down_votes":0,"body":"Vuoi dirmi che hai fatto la media di 8 partite al giorno? \nNon ti si sono fulminati i neuroni?","replies":[{"poster":"DuckQuack0","date":"2016-12-08T16:55:49.451+0000","up_votes":2,"down_votes":0,"body":"vincevo quasi 30 pl a partita ed ho saltato s4 e s2","replies":[{"poster":"HeiKatarina","date":"2016-12-09T15:13:05.736+0000","up_votes":1,"down_votes":0,"body":"Perdona l'ignoranza... \"saltato\" che significa?","replies":[{"poster":"DuckQuack0","date":"2016-12-09T19:26:22.147+0000","up_votes":1,"down_votes":1,"body":"Che diciamo sono troppo bravo per quei elo, il mio mmr era troppo elevato e salivo di 2 divisioni alla volta","replies":[{"poster":"HeiKatarina","date":"2016-12-10T17:27:34.916+0000","up_votes":1,"down_votes":0,"body":"Ah... \nScusami sono ignorante su alcune cose, davvero. \nCome posso vedere il mio mmr? e quali punteggi sono ritenuti alti?","replies":[{"poster":"Floppyz","date":"2016-12-11T12:32:17.685+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jackals17,realm=EUW,application-id=MJVj50Jw,discussion-id=2hEwnMgH,comment-id=0003000000000000000000010000,timestamp=2016-12-10T17:27:34.916+0000)\n>\n> Ah... \n> Come posso vedere il mio mmr?\n\nNon puoi. Se posso darti un suggerimento, gioca senza farti tanti problemi di rank.","replies":[]}]}]},{"poster":"Ardens33","date":"2016-12-09T18:10:05.358+0000","up_votes":1,"down_votes":0,"body":"Invece di farti fare 1-division in 2/3 game è piu ragionevole passare da silver 5 a silver 3 pef esempio","replies":[]}]}]}]},{"poster":"ImaqtWimmolo","date":"2016-12-08T17:14:41.559+0000","up_votes":1,"down_votes":1,"body":"Una volta che ci esci, non avrai piu difficoltà a rifarlo","replies":[]}]},{"poster":"Sorry NoOb","date":"2016-12-08T19:20:30.402+0000","up_votes":1,"down_votes":1,"body":"Incoerenza.","replies":[{"poster":"ImaqtWimmolo","date":"2016-12-09T15:54:48.055+0000","up_votes":1,"down_votes":1,"body":"In che senso? Ho semplicemente detto che non è vero che è difficile uscire dal bronzo, dove sarei incoerente?","replies":[]}]}]},{"poster":"Ekelume","date":"2016-12-08T15:35:06.790+0000","up_votes":2,"down_votes":0,"body":"accanna le ranked hahahahaha vivi meglio {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"DuckQuack0","date":"2016-12-08T15:00:10.971+0000","up_votes":2,"down_votes":0,"body":"Perché altrimenti saremmo tutti in challenger dopo 2 season","replies":[]},{"poster":"ObsidianSin","date":"2016-12-11T12:17:27.261+0000","up_votes":1,"down_votes":0,"body":"Eddai raga. Basta con ste cazzate. Sarà il trentesimo post con scritto \"ah ma io ho vinto 3849 partite di placement e ne ho perse solo 2727 meritavo di essere piazzato in ASCIUGAMANO V\". \nMi dispiace, ma il positioning di lol è fatto col CULO. \nSi risolve qualcosa a scriverlo sul forum 27282 volte? No! E allora le opzioni sono due:\ncontinui a giocare senza lamentarti\nOppure disinstalli il gioco, perché di bimbi in questa community NON NE VOGLIAMO. \n#MAKELOLCOMMUNITYGREATAGAIN","replies":[]},{"poster":"LightIsMyPath","date":"2016-12-08T19:57:21.111+0000","up_votes":1,"down_votes":0,"body":"Prova a giocare, probabilmente guadagnerai qualcosa sui 26-31 pl ( a seconda di quanto è alto il tuo mmr ) e ne perderai 13-18. Con un bilancio del genere si sale bene anche con un winrate al 50%, ed essendo molto in basso rispetto al tuo vero livello di abilità ( almeno x quel che dici) dovresti vincere più del 50%, quindi salirai velocemente.\n\n\nPS: Uscire dal bronzo non è difficile, io ci sono uscita 6 volte sta season.. Trovo più difficile non rientrarci  quando tilto e ne perdo 20 di fila :p","replies":[]},{"poster":"HeiKatarina","date":"2016-12-08T15:04:48.092+0000","up_votes":1,"down_votes":0,"body":"Leggi le info sulla nuova Stagione.\nE poi c'è scritto anche quando inizi a fare le pre select che saremo tutti sbattuti più in basso. \nIo ero G5, sono B1 con 6/4","replies":[]},{"poster":"Kazushi San","date":"2016-12-08T17:20:06.402+0000","up_votes":1,"down_votes":1,"body":"difficile? lel","replies":[]}]}