{"poster":"TzunaX","date":"2015-11-25T22:07:53.569+0000","title":"permaban de un amigo que le hackearon la cuenta","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"como hago para pedir ayuda a riot? le permabenaron la cuenta a un amigo,alguien se logueo con su id y cuando quizo entrar ya tenia el permaban? como puedo hacer? mi amigo esta desesperado e invirtio mucho rp en esa cuenta,alguna solucion?","replies":[{"poster":"Un Sin Corazón","date":"2015-11-26T00:16:54.363+0000","up_votes":1,"down_votes":0,"body":"Ah o sea que alguien que él desconoce le robó la cuenta para : trollear, flamear, perder apropósito e irse afk ... claaaaaaaaaaaaaaaaaaaaro que si campeón...\n\n Ó  \n\nEl jugaba en su cuenta y de un día para el otro le cae el bann (  claro ) : nunca se fijó su historial de partidas ( partidas que él nunca jugó) y demás ...\n\nY con la falta de ortografía y con la poca garra que le pusiste a este post podría asegurar que estas mintiendo ademas de que el Lol no se puede hackear. \n\nY si el tenia una contraseña y un nick demasiado facil ?  Poco creíble","replies":[{"poster":"TzunaX","date":"2015-11-26T02:02:50.970+0000","up_votes":1,"down_votes":0,"body":"mira,yo le hago un favor preguntando.lo conozco de toda la vida a mi amigo y no es de insultar o agredir,mucho menos irse afk,me parece que tuvo que ver con la pagina trucha de harrowing o como se diga...me dijo que todo bien si no recupera la cuenta,pero no va a volver a jugar desde el lvl 1 con todo el rp que invirtio,dijo que esperaria al overwatch,estaria genial si se la devuelven,aunque la posibilidad es infima debo preguntar,no pierdo nada.pero aun no cae de lo que le paso... :(","replies":[]}]},{"poster":"TzunaX","date":"2015-11-25T23:37:37.389+0000","up_votes":1,"down_votes":0,"body":"como envio un ticket? juego desde la s2 y nunca supe como (nunca tuve problemas con mi cuenta)","replies":[{"poster":"Un Sin Corazón","date":"2015-11-26T00:19:46.405+0000","up_votes":1,"down_votes":0,"body":"Anda a Soporte y enviar un ticket ;D","replies":[]}]},{"poster":"Hnk Kenshiro","date":"2015-11-25T23:14:04.098+0000","up_votes":1,"down_votes":0,"body":"Decimo, ticket al soporte de manera educada para conocer todos los detalles y poder apelar es siempre el camino.","replies":[]},{"poster":"Galiers","date":"2015-11-25T22:35:42.375+0000","up_votes":1,"down_votes":0,"body":"dificil que la recupere... no he visto nunca que levanten una sanción a alguien, ni del juego ni del foro.","replies":[]},{"poster":"Ryoga","date":"2015-11-25T22:13:10.642+0000","up_votes":1,"down_votes":0,"body":"y como se puede saber si lo que dices cierto?","replies":[]}]}