{"poster":"ZetsubouFallen","date":"2016-04-28T17:39:50.277+0000","title":"PSA: Argentina esta teniendo problemas de DNS, por ende algunas paginas y League of Legends no logea","subforum":"Problemas Técnicos","up_votes":6,"down_votes":1,"body":"Los DNS son el rediccionamiento que se hace cuando uno quiere ir a una pagina, es la transformacion del dominio &quot;Google.com.ar&quot; a una direccion de IP.\r\n\r\nActualmente varios proveedores de internet estan teniendo problemas, se aconseja cambiar los DNS a los siguientes.\r\n\r\n208.67.222.222 &middot; 208.67.220.220\r\n\r\nEstos corresponden a OPEN DNS.\r\n\r\nPara cambiar DNS recomiendo seguir este tutorial.\r\n\r\nhttp://windows.microsoft.com/es-es/windows/change-tcp-ip-settings#1TC=windows-7\r\n\r\n\r\nEsto es para windows 7 pero es similar para windows 8 y 10, asi como windows XP.\r\n\r\nPD:\r\n\r\nPSA significa Servicio de Anuncio Publico (Public Service Announcement)","replies":[{"poster":"MasterRaceGaming","date":"2016-04-29T23:39:32.573+0000","up_votes":1,"down_votes":0,"body":"Mejora el ping hacer esto? No creo porque yo probé con los DNS de Fibertel y con los de Google y me sigue andando mal, el problema parece venir por otro lado, el routeo que hacen las empresas y el servidor.","replies":[]},{"poster":"Adheliøs","date":"2016-04-28T21:43:29.507+0000","up_votes":1,"down_votes":0,"body":"A mi me paso exactamente lo mismo y soy de Uruguay, se arreglo solo después de una hora más o menos xD","replies":[]},{"poster":"Sakura Star","date":"2016-04-28T20:52:55.046+0000","up_votes":1,"down_votes":0,"body":"A mi no me deja cambiar las DNS... si hago eso adios controlador de red(de la placa) y ahi me toca hacer restaurar, ya me lo intento hacer un amigo antes eso y casi la cagamos los dos. Puede que con algunos funcione pero con el modem este de cuarta que tengo xD dudo que funcione...\nSuerte para quien le funcione...\n{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"LemønPykë","date":"2016-04-28T20:17:13.139+0000","up_votes":1,"down_votes":0,"body":"me paso eso, mande un mensaje a arnet (a demas de bardear porque hace 1 semana anda muuuuy mal), 2 min después me andaba de 10","replies":[]},{"poster":"Dark Asterion","date":"2016-04-28T19:48:46.518+0000","up_votes":1,"down_votes":0,"body":"yo tengo el problema que al loguear queda en \"iniciando sesion\" y no abre.. cual seria la solucion?","replies":[]},{"poster":"TerrenceLovesYou","date":"2016-04-28T18:06:44.246+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-nunu-bummed}}","replies":[]},{"poster":"S4nt1PCLOL","date":"2016-04-28T17:59:13.396+0000","up_votes":1,"down_votes":0,"body":"¿Este problema afectaría también al juego INGAME o solo los foros? Gracias por informar :D. De todas formas si esto no se arregla dudo que lo puedan leer a mi no me dejo entrar hasta hace 2 mins.","replies":[]}]}