{"poster":"Urashiru","date":"2016-05-27T10:04:32.466+0000","title":"Der Untergang der Liga.","subforum":"Community-Kunstwerke","up_votes":6,"down_votes":1,"body":"Hallo Community,\n\nich habe mich nach langem &uuml;berlegen dazu entschieden, meine Fan-Story nochmals hochzuladen und mit eich zu teilen. Sie hat schon ein paar Jahre auf dem Buckel (weshalb einige Champions nicht mehr aktuell dargestellt sind). Ich hoffe, sie gef&auml;llt trotzdem dem ein oder anderen. Die Geschichte umfasst knapp 50 DIN A4 Seiten Lesespa&szlig;, also seid gewarnt: Wenn ihr ne Geschichte nur zum &uuml;berfliegen sucht, seid ihr hier glaube ich falsch. Ich habe die Geschichte &uuml;ber einen langem Zeitraum geschrieben, was sich meiner Meinung nach in der schwankenden Qualit&auml;t wiederspiegelt.\n\nDie Geschichte handelt von keinem bestimmten Champion, sondern umfasst Geschehnisse in der gesamten Welt von League of Legends, begleitet aber einen andere Figur, die ihr wahrscheinlich nicht kennt, da sie meinem unkreativen Kopf entsprungen ist :) Zus&auml;tzlich ist in der Geschichte ein &quot;Easter Egg&quot; f&uuml;r meinen besten Kumpel versteckt, da ich eine seiner Championideen verbaut habe und dieser selbst erdachte Champion einen kleinen Kurzauftritt hat. Bitte beachtet, dass diese Geschichte keinen Champion bevorzugt. Wer f&auml;llt, tut dies um die Geschichte voranzutreiben, nicht weil er &quot;schlechter&quot; dargestellt werden soll.\n\nMeine Freundin hat zus&auml;tzlich zur Geschichte ein Titelbild entworfen, dass ich euch, alleine ihr zur Liebe, nicht vorenthalten will:\nhttp://fantasyofkingdoms.deviantart.com/art/Cover-Der-Untergang-der-Liga-Redraw-395544822?q=gallery%3AFantasyOfKingdoms%2F37203076&qo=31\n\nAber nun genug gelabert. Ich pr&auml;sentiere euch meine komplette Geschichte zu Mira, einem M&auml;dchen, dass von mir in eine gro&szlig;e, gef&auml;hrliche Welt geworfen wird. Etwaige Rechtschreibfehler d&uuml;rfen von ihren Findern behalten werden :)\n \n \n \n**KAPITEL 1: EINE HELDIN WIRD GEBOREN**\nMira blinzelte. Das Licht der Sonne fiel an diesem strahlenden Morgen direkt in das\nZimmer unserer zuk&uuml;nftigen Heldin. Doch niemand konnte auch nur im Entferntesten\nerahnen, dass die 17-j&auml;hrige Tochter eines einfachen Dorfschmiedes Runeterra vor dem\nUntergang bewahren k&ouml;nnte.\nMira selbst wusste dies nicht, als sie an jenem Morgen nach ihrem t&auml;glichen\nReinigungsritual das Haus ihres Vaters in Richtung Wald verlie&szlig;. Jeden Montagmorgen\nstand die Pilzsuche an und wie jedes Mal lie&szlig; Mira es sich nicht nehmen, ein wenig die\nGegend zu erkunden. Und so geschah es, dass sich Mira im Wald verirrte.\n\n_&bull;Zwei Wochen vorher_\n\nDurch die Macht&uuml;bernahme von Jericho Swain als &bdquo;gro&szlig;er General&ldquo; wurde das\nEndzeitalter eingeleitet. Auf seinen Befehl hin befreiten noxische Elitesoldaten das Kind\nder Leere Cho&acute;Gath aus den F&auml;ngen der Beschw&ouml;rer. Sie wussten, dass der Tag, an dem\ndies geschehen w&uuml;rde, den Untergang der Liga, Runeterras und all jener, die\nrechtschaffend und gut sind, bedeuten w&uuml;rde. Durch eisernen Willen und durch das\nWissen, welche Art von Bestrafung ein Scheitern bedeuten w&uuml;rde, angetrieben,\nst&uuml;rmten die Elitesoldaten das Hauptgeb&auml;ude der Liga. Durch das Gift, welches durch die\ngef&uuml;rchteten Alchemisten Zauns hergestellt wurde, war es ein Leichtes f&uuml;r sie, das Kind\nder Leere zu &bdquo;befreien&ldquo; und es zur&uuml;ck nach Noxus zu begleiten.\nDort angekommen wartete Swain bereits ungeduldig. Dem Meister der Taktik war es\ngelungen, einen Weg zu finden, die Feinde Noxus zu vernichten und Herrscher &uuml;ber\nRuneterra zu werden. Durch die Macht Cho&acute;Gaths gelang Swain das Unm&ouml;gliche: Er\n&ouml;ffnete einen dauerhaften Durchgang zwischen Runeterra und der geheimnisvollen\nDimension, die man die Leere nannte.\nBereits wenige Sekunden, nachdem das Portal aktiv war, str&ouml;mten unz&auml;hlige D&auml;monen\nund &auml;hnlich furchterregende Kreaturen in den gro&szlig;en Thronsaal, den Jericho Swain\nk&uuml;rzlich anfertigen lie&szlig;. Die anderen Kinder der Leere zeigten sich &uuml;berraschenderweise\ndankbar und schw&ouml;rten Swain die Treue unter einer Bedingung, die Cho&acute;Gath lautstark\nverk&uuml;ndete: &bdquo;Wir werden dir helfen, Valoran und ganz Runeterra zu unterwerfen, jedoch\nwerden wir die komplette Runenenergie f&uuml;r uns beanspruchen. Runeterra wird grau und\nschwarz werden!&ldquo; Swain k&uuml;mmerte dies nicht. Ihm war es nur wichtig, die Macht Noxus&acute;\nzu vergr&ouml;&szlig;ern. Wie die Welt nach diesem Kreuzzug aussehen w&uuml;rde, war ihm gleich.\nUnd so befahl er seinen noxischen Kriegern, gef&uuml;hrt durch das Oberkommando und\nseiner neuen d&auml;monischen Armee, die Eroberung Valorans: &bdquo;Geht! Macht keine\nGefangene und kehrt nicht eher zur&uuml;ck, bevor auch nicht der letzte Landstrich unter\ndem Banner Noxus&acute; vereint ist!&ldquo;\n\n_&bull;Zur&uuml;ck zur Gegenwart_\n\nOhne guten Orientierungssinn, verlor sich Mira recht schnell in dem gro&szlig;en Wald, der an\nihr Dorf angrenzte. Ein Dorf, zu klein um &uuml;berhaupt in den Geschichtsb&uuml;chern erw&auml;hnt\nzu werden. Miras Vater warnte sie jeden Tag aufs Neue vor den Gefahren des Waldes.\nDoch obwohl Mira vorsichtig war, hatte sie keine Angst vor diesen Gefahren. Denn im\ngleichen Ma&szlig;e, in dem ihr Alter wuchs, wuchs auch ihr Talent im Kampf mit dem\nSchwert. Sie trainierte heimlich mit durchreisenden Abenteurern und demacianischen\nSoldaten, die in dem kleinen Dorf Halt machten, um ihre Vorr&auml;te aufzustocken. Doch\nselbst das h&auml;rteste Training konnte sie nicht auf das vorbereiten, das sie erwarten\nw&uuml;rde, sollte sie jemals einen Weg aus dem Wald finden.\nNach mehreren Stunden ziellosem Umherwanderns fand Mira schlie&szlig;lich den Weg\nwieder und war sichtlich erleichtert. Sie lie&szlig; sich auf den Boden fallen und war froh,\nwieder nach Hause zu finden. Doch gerade als sie aufstehen wollte, fielen ihr die\nAbdr&uuml;cke auf der Stra&szlig;e ins Auge. Ihre Augen weiteten sich vor Angst, denn Mira kannte\ndiese Art von Abdr&uuml;cken von der Zeit, als ihre Familie noch in Ionia lebte. Es handelte\nsich um noxische Belagerungsmaschinen. Getrieben von ihrer Angst, rannte Mira zu\nihrem Dorf, doch als sie dort ankam, war es bereits zu sp&auml;t. Ihr Dorf war niedergebrannt.\nVoller Entsetzen schrie sie ihre Wut heraus: &bdquo;Nein!!! Wieso nur?&ldquo;. Dies sollte sie teuer\nbezahlen, denn kurz darauf tauchte vor ihr, wie aus dem Nichts, einer der gef&uuml;rchtetsten\nAssassinen auf, die Noxus aufzubieten hatte: Talon. Talon griff Mira ans Kinn und fragte:\n&bdquo;Was macht ein so sch&ouml;nes Kind wie du alleine an der noxischen Grenze? Bist du etwa\neine Schmugglerin?&ldquo;. &bdquo;Fass mich nicht an, du Monster!&ldquo;, schrie Mira &bdquo;Das hier ist kein\nHoheitsgebiet deines verachtenswerten Stadtstaates!&ldquo;. Emp&ouml;rt von der Respektlosigkeit\ndes offensichtlich j&uuml;ngeren M&auml;dchens, rastete Talon aus. Er stie&szlig; Mira zu Boden und\nz&uuml;ckte eine seiner Klingen. Gerade, als Talon zum Wurf ansetzte, wurde dieser von\nseinem Vorhaben abgehalten. Mit unglaublicher Kraft wurde Talon von Mira\nweggesto&szlig;en. Dieser richtete sich sofort wieder zur vollen Gr&ouml;&szlig;e auf, um seinem neuen\nGegner in die Augen zu sehen. Er konnte sein Gl&uuml;ck kaum fassen, denn endlich hatte er\ndie Chance, einen Dorn im Auge Noxus&acute; zu entfernen: Riven. &bdquo;Nur die Verbannte konnte\nso dreist sein, sich dem Willen Noxus&acute; in den Weg zu stellen!&ldquo;, fluchte Talon. Doch Riven\nentgegnete dem mit fast furchteinfl&ouml;&szlig;ender Ruhe: &bdquo;Ich habe nichts mehr f&uuml;r Noxus\n&uuml;brig. Glaubst du wirklich, dass dem Oberkommando etwas an deinem Leben liegt?&ldquo;.\nOhne weitere Worte auszutauschen, griff Talon zu einer seiner Klingen und st&uuml;rmte auf\nRiven zu. Gerade, als er zum Sto&szlig; ansetzte, tauchte, wie aus dem Nichts, Mira vor ihm\nauf und stie&szlig; seine Klinge zur Seite. &Uuml;berrascht von der Schnelligkeit dieses jungen\nM&auml;dchens, wusste Talon nicht so Recht, wie ihm geschah, denn Riven nutzte diesen\nMoment der Unachtsamkeit, um Talon mit einem gewaltigen Hieb seine rechte Hand\nabzutrennen. Sichtlich durch Schmerzen gequ&auml;lt, schrie er, unsicher wem seine Drohung\ngelten sollte: &bdquo;Letztendlich wird meine Klinge doch einen Weg in dein Herz finden!&ldquo;.\nGerade, als Riven zu einem erneuten Sto&szlig; ansetzen wollte, verschwand Talon genauso\nschnell wie er aufgetaucht war.\nTrotz ihrer Angst und Trauer verga&szlig; Mira jedoch nicht ihre H&ouml;flichkeit und bedankte sich\nbei ihrer Retterin. Riven hatte ihre zerbrochene Klinge jedoch schon wieder geschultert\nund war bereits wieder auf dem Weg Richtung Westen. Mira blickte auf das verbrannte\nGebiet, auf dem heute Morgen noch ihr Dorf gestanden hatte. Sie hatte nun niemanden\nmehr. Ihre Familie, ihre Freunde und alle, die ihr etwas bedeuteten, weilten nun nicht\nmehr unter den Lebenden. Mira fasste den Entschluss, ihr Leben f&uuml;r etwas Gutes, etwas\nNotwendigem zu verschreiben. Sie wollte Noxus aufhalten. Sie blickte noch einmal auf\nihr Schwert, eines der besten Schwerter, das ihr Vater jemals angefertigt hatte, bevor sie\nes wieder wegsteckte. Mit dem Gedanken, es w&auml;re besser, nicht alleine zu reisen, lief\nMira Riven hinterher und hatte diese auch bald wieder eingeholt. Nachdem einige Zeit\nvergangen war, in der sich Riven und Mira angeschwiegen hatten, unterbrach Riven die\nRuhe: &bdquo;Es tut mir Leid, was mit deinem Dorf passiert ist.&ldquo;. Mira entgegnete dem mit\ngespielter Fr&ouml;hlichkeit: &bdquo;Vielen Dank f&uuml;r dein Mitgef&uuml;hl. Ich dachte immer, dass die Liga\nsolche Aktionen unterbinden w&uuml;rde. Wir m&uuml;ssen unbedingt verhindern, dass noch mehr\nBewohner so leiden m&uuml;ssen wie ich&ldquo;. &bdquo;Du hast es nicht mitbekommen? Die Liga existiert\nnicht mehr. Das Oberkommando wusste, dass die Liga verschwinden musste, bevor\nNoxus seine schwarze Hand &uuml;ber Valoran ausstrecken konnte.&ldquo;, erz&auml;hlte Riven, &bdquo;Ich bin\nunterwegs, um das demacianische Heer vor der ann&auml;hernden Gefahr zu warnen,\nw&auml;hrend einer meiner Freunde mit dem Schiff nach Ionia unterwegs ist.&ldquo;. &bdquo;Ist das\nwirklich n&ouml;tig? Ich meine, Demacia konnte es fr&uuml;her alleine mit Noxus aufnehmen! Was\nk&ouml;nnte sich so ver&auml;ndert haben, dass wir Ionia informieren m&uuml;ssen. Ionia war noch nie\nsonderlich milit&auml;risch ausgebildet.&ldquo;, entr&uuml;stete Mira. Riven entgegnete wieder mit\nst&ouml;rrischer Ruhe: &bdquo;Ohh, du scheinst dich auszukennen. Das Problem ist jedoch, dass\nNoxus nicht mehr das Land ist, das es fr&uuml;her einmal war. Ich f&uuml;rchte, wir werden die\nUnterst&uuml;tzung s&auml;mtlicher freien V&ouml;lker ben&ouml;tigen, wenn wir diese gewaltige Armee\naufhalten wollen. Au&szlig;erdem sollen sich in Demacia die letzten &uuml;berlebenden\nBeschw&ouml;rer aufhalten. Ihre Hilfe w&auml;re ein unsch&auml;tzbarer Gewinn f&uuml;r unsere\nGegenwehr&ldquo;. Noch bevor Mira wieder mit ihrem Wissen angeben konnte, vernahmen\ndie beiden einen gewaltigen Schrei: &bdquo;Ihr noxischen Hunde!!! F&uuml;r Demacia!!!&ldquo;. Riven\nkannte diese Stimme und lief ihr entgegen, doch wurde sie von Mira &uuml;berrascht. Das\nkleine M&auml;dchen war nicht sehr stark, jedoch mit einer &uuml;bernat&uuml;rlichen Schnelligkeit\ngesegnet. Wie ein Blitz raste Mira auf die Lichtung zu, von der der Schrei zu vernehmen\nwar. Selbst Riven &uuml;berraschte eine solche Schnelligkeit, hatte sie auf ihren Reisen schon\neiniges gesehen. Als Mira auf der Lichtung ankam, verschwendete sie keine Zeit, die &uuml;ber\n30 noxischen Soldaten zu z&auml;hlen. Ihr einziger Gedanke war, dem gewaltigen\ndemacianischen Krieger zu helfen, der sich alleine dieser &Uuml;bermacht stellte. Immer\nwieder stachelte sich dieser mit einem lauten &bdquo;Demacia!&ldquo; selbst an und versetzte sich so\nin einen regelrechten Blutrausch. Ein gezielter Dolchwurf riss diesem Mann sein\ngewaltiges Schwert aus den H&auml;nden und gerade, als ein noxischer Assassine zum finalen\nSchlag ausholte, erreichte Mira den Krieger. Mit rasender Geschwindigkeit teilte Mira\nSchl&auml;ge aus. Noch nie hatten die noxischen Soldaten etwas Derartiges gesehen. Wenige\nAugenblicke sp&auml;ter lag der noxische Sp&auml;htrupp am Boden. Mira hatte sich vollkommen\nverausgabt und st&uuml;tzte sich mit Hilfe ihres Schwertes ab. Der demacianische Krieger, der\nnoch immer verbl&uuml;fft von dem kleinen M&auml;dchen war, ergriff sein Schwert und nahm\nKampfhaltung an, denn neben Mira war eine junge Frau aufgetaucht. Ihre R&uuml;stung war\nmit Symbolen des noxischen Oberkommandos best&uuml;ckt, ihr rotes Haar fiel &uuml;ber ihr\nGesicht, konnte jedoch nicht die Narbe verdecken, die ihr sonst so makelloses Gesicht\nverunstaltete. &bdquo;So treffen wir uns wieder, Garen.&ldquo;, sprach die Frau mit fast beruhigender\nStimme. &bdquo;Doch dieses Mal wird es nicht zu einem Unentschieden kommen, Katarina!!!&ldquo;,\nschrie der Krieger, dessen Name zweifellos Garen war. Mit diesen Worten fuhr sein\nSchwert bereits auf Katarina nieder, die diesen Angriff jedoch ohne Probleme abwehren\nkonnte. Nach einigen ausgetauschten Schl&auml;gen, sah es f&uuml;r Garen nicht besonders gut\naus. Katarina war durch ihr Training zu schnell f&uuml;r Garen geworden und immer wieder\ntraf sie mit ihren Dolchen die Schwachstellen von Garens R&uuml;stung. Als dieser in die Knie\nging und Riven immer noch nicht eingetroffen war, fasste Mira einen Entschluss.\nGetrieben von der Sorge um Garen, richtete sich das M&auml;dchen auf. Ein unheimlicher\nblauer Schein fiel aus ihren Augen, der sich in ihrem Schwert manifestierte. Mit einem\nlauten Schrei schlug Mira in die Luft, was eine blau schimmernde Druckwelle\nhervorbrachte, die auf Katarina zuraste. Trotz ihrer &Uuml;berraschung gelang es ihr dennoch\nauszuweichen, so dachte sie zumindest. Obwohl sie der Angriff nicht getroffen hatte,\nklaffte eine gro&szlig;e Wunde aus ihrem Bauch. &bdquo;Wie ist das m&ouml;glich? Ich, Noxus&acute; beste\nAssassine, besiegt von einem Bauernm&auml;dchen?&ldquo;. Mit diesen Worten brach Katarina\nzusammen, doch Mira hatte ihre letzte Kraft in diesen m&auml;chtigen Angriff gesteckt. Sie fiel\nkurz nach Katarina ohnm&auml;chtig zu Boden.\nAls Mira wieder zu sich kam, brannte vor ihr ein kleines Lagerfeuer. Riven sa&szlig; neben ihr\nund blickte geistesabwesend in die Flammen. Mira blickte sich um, konnte in der\nDunkelheit der Nacht Garen jedoch nicht entdecken. Dieser war etwas abseits des Lagers\ndabei, letzte Handgriffe an das Grab von Katarina anzulegen. Mira richtete sich auf. Riven\nbemerkte dies und reichte unserer Heldin ein St&uuml;ck gebratenes Fleisch. Mira nahm das\nEssen dankend an, versuchte jedoch trotz ihres gro&szlig;en Hungers an F&ouml;rmlichkeiten\nfestzuhalten. Sie a&szlig; nur mit Bedacht und biss nie zu gro&szlig;e St&uuml;cke ab. Als sie den letzten\nBissen verspeist hatte, trat Garen aus der Dunkelheit und setzte sich ans Feuer. Er blickte\nin Miras angsterf&uuml;lltes Gesicht, wohlwissend, was dieses kleine, unschuldige M&auml;dchen\ndurchgemacht hatte. &bdquo;Ich glaube wir haben uns noch gar nicht vorgestellt.&ldquo;, begann\nGaren mit tiefer Stimme das Gespr&auml;ch, &bdquo;Mein Name ist Garen Kronwacht. Und wie ist\ndein Name?&ldquo;. &bdquo;Mira!&ldquo;, antwortete sie kurz. Garen bemerkte ihre Besorgnis und\nversuchte, Miras Angst von ihr zu nehmen: &bdquo;Du brauchst keine Angst zu haben. Du wirst\nsehen, am Ende wird sich alles zum Guten wenden. Au&szlig;erdem m&ouml;chte ich mich bei dir\nbedanken. Ohne deine Hilfe w&uuml;rde ich wahrscheinlich nicht hier sitzen.&ldquo;. Mira nickte, um\nden Anschein zu erwecken, ihre Angst w&auml;re von ihr gewichen. Doch ihre Gedanken lagen\nimmer noch bei ihrer Familie. Sie konnte nicht glauben, dass sie alle gestorben waren.\nWie sehr w&uuml;nschte sie sich, noch einmal ihren Eltern oder ihrem Bruder sagen zu\nk&ouml;nnen, wie sehr sie sie liebte. &bdquo;Was machst du eigentlich hier, Garen?&ldquo;, unterbrach\nRiven die Stille. Garen erkl&auml;rte, dass er und seine Schwester beauftragt wurden, den\nSohn des K&ouml;nigs zu finden, da dieser sich zum Zeitpunkt des Angriffes nicht in Demacia\nbefand. Riven fragte nach: &bdquo;Der Angriff auf Demacia hat bereits begonnen?!?&ldquo;. &bdquo;Ja. Das\nMonster Cho&acute;Gath f&uuml;hrt den Angriff pers&ouml;nlich an. W&auml;hrend er mit seinen\nDienerkreaturen die Stadt belagert, setzt Singed den Menschen innerhalb der Stadt mit\nseinen Giftgas-Angriffen zu.&ldquo;, begann Garen zu schildern. Mira stand auf und fasste einen\nEntschluss: &bdquo;Dann haben wir drei Ziele: Erstens m&uuml;ssen wir deine Schwester suchen. Da\nsie nicht bei dir ist, bef&uuml;rchte ich, dass ihr etwas zugesto&szlig;en ist. Zweitens m&uuml;ssen wir\nJarvan finden. Da er letzte Woche erst durch mein Dorf kam, kann er nicht weit\ngekommen sein. Und drittens m&uuml;ssen wir die Belagerung von Demacia durchbrechen.&ldquo;.\nSowohl Riven als auch Garen waren &uuml;berrascht von der Entschlossenheit des M&auml;dchens,\nverloren doch beide allm&auml;hlich den Mut, f&uuml;r ihre Sache zu k&auml;mpfen. Dieses M&auml;dchen\nhatte etwas Au&szlig;ergew&ouml;hnliches, etwas G&ouml;ttliches. Nicht viele Menschen besa&szlig;en diese\nGabe.\nAls am n&auml;chsten Tag die Sonne aufging, war die Gruppe bereits zum Aufbruch bereit.\nMan wollte das erste Ziel angehen. Um Garens Schwester finden zu k&ouml;nnen, bedarf es\nkeiner gro&szlig;en Vorbereitung. Die Drei hatten geplant zur der Stelle zur&uuml;ck zu kehren, an\nder sich Garen und seine Schwester w&auml;hrend eines Angriffes trennen mussten. Da die\nnoxischen Heeressoldaten keine Meister im Spuren verbergen waren, sollte es ein\nLeichtes sein Luxanna zu finden.\nAm sp&auml;ten Nachmittag erreichten die drei Gef&auml;hrten das Schlachtfeld. Selbst ein Blinder\nh&auml;tte festgestellt, dass Lux in einen Kampf verwickelt wurde. Eine gewaltige Schneise,\nquer durch den Wald, war entstanden. An s&auml;mtlichen B&auml;umen waren Verbrennungen\nfestzustellen, fast so, als h&auml;tte jemand einen riesigen Flammenwerfer abgefeuert. Da nur\nLuxanna die Macht besa&szlig;, solch einen Laser zu aktivieren, wurde Garen klar, dass seine\nSchwester in echte Bedr&auml;ngnis gekommen war. Als Riven und Garen sich nach etwas\numsahen, das ihnen bei der Suche nach Lux helfen konnte, entdeckte Mira den\nZauberstab von Lux. &bdquo;Garen, komm bitte schnell her!&ldquo;, rief sie. Dieser eilte zu unserer\nHeldin. &bdquo;Das ist der Stab von meiner Schwester. Sie muss &uuml;berw&auml;ltigt worden sein. Sie\nw&uuml;rde nie ihren Stab mitten im Wald liegen lassen. Wir m&uuml;ssen sie finden.&ldquo;. Garen war\nsichtlich besorgt, bedr&uuml;ckte ihn doch die Angst, seine Schwester vielleicht nie mehr\nwieder zu sehen. Doch wie bereits vorhergesehen, war es ein Leichtes eine brauchbare\nSpur zu finden und bereits wenige Stunden sp&auml;ter n&auml;herten sich Mira, Riven und Garen\neinen noxischen Lager. In der Mitte des Lagers war ein K&auml;fig aufgestellt, in dem sich die\nGesuchte befand. Sie wurde wie ein Tier festgehalten. Garen, der zur einen Seite von\nrasender Wut gepackt wurde, als er seine Schwester in einem so erb&auml;rmlichen Zustand\nsah, wurde andererseits durch seine Vernunft zur&uuml;ckgehalten. Mira schlug vor, dass es\nbesser w&auml;re, sich im Schutz der Dunkelheit an den K&auml;fig anzuschleichen und Luxanna zu\nbefreien, anstatt sich durch die Reihen der Noxianer zu k&auml;mpfen. Riven stimmte dem zu.\nGaren war jedoch sichtlich darauf aus, Streit mit seinen Erzfeinden anzufangen. Da\nGaren jedoch &uuml;berstimmt wurde, n&auml;herten sich unsere drei Helden vorsichtig dem Lager.\nAlles verlief soweit gut. Die meisten Wachen schliefen und die wenigen, die noch\naufmerksam Wache hielten, waren leicht zu umgehen. Bereits wenige Minuten nach\nBeginn der &bdquo;Operation&ldquo; standen Mira und ihre Begleiter vor dem K&auml;fig, in dem Lux in\nunm&ouml;glicher Position zu schlafen versuchte. &bdquo;Wie bekommen wir jetzt den K&auml;fig auf?&ldquo;,\nfragte Garen regelrecht fordernd. &bdquo;Sei still, &uuml;berlasst das mir!&ldquo;, antwortete Mira, als sie\neine kleine Haarspange aus ihrem t&uuml;rkisfarbenen Haar streifte und diese auseinander\nbog. Gekonnt setzte sie die, zu einem Dietrich umfunktionierte, Haarspange an dem\nrostigen Vorh&auml;ngeschloss an, das Garens Schwester an ihrer Freiheit hinderte. Riven\nfl&uuml;sterte fast vorwurfsvoll: &bdquo;Wo hast du das gelernt?&ldquo;. &bdquo;Ach, das ist nur ein Relikt aus\nmeinen wilderen Tagen.&ldquo;, meinte Mira, wobei sie sich ein kleines L&auml;cheln nicht\nverkneifen konnte. Mit einem lauten &bdquo;Klack&ldquo; entriegelte das Schloss und Garen konnte\nseine Schwester endlich wieder in den Arm nehmen. Beide Geschwister umarmten sich,\nden Tr&auml;nen nahe, hatten sie doch beide Angst um den jeweils anderen gehabt. Nachdem\nLux sich bedankt hatte, stand nun die Flucht an. Diese w&uuml;rde sich jedoch als unm&ouml;glich\nheraus stellen, denn in dem Moment, in dem sich die Gruppe auf den R&uuml;ckweg machen\nwollte, ert&ouml;nte ein lautes &bdquo;Wachen!!! Alarm!!!&ldquo; aus der N&auml;he. Sofort wurde es Taghell in\ndem Heereslager. Reihen von Noxianer umzingelten die Fl&uuml;chtlinge, von denen jedoch\nkeiner angriff. &bdquo;Hmm, merkw&uuml;rdig.&ldquo;, staunte Riven. Mit diesen Worten &ouml;ffneten die\nNoxianer ihre Reihen und die beiden wahren Gegner in dieser Nacht traten hervor: die\nbeiden noxischen Br&uuml;der Darius und Draven. &bdquo;Habt ihr wirklich gedacht, ich lasse es zu,\ndass meine Beute entkommt?&ldquo;, fragte Darius sp&ouml;ttisch. &bdquo;Es wird Zeit zum Spielen. Sie\nhaben gegen den unglaublichen Draven keine Chance! Ihr Soldaten d&uuml;rft euch gl&uuml;cklich\nsch&auml;tzen, an diesem Schauspiel teilnehmen zu k&ouml;nnen!&ldquo;, feuerte Draven sich selbst an.\n&bdquo;Was f&uuml;r ein Angeber!&ldquo;, dachte sich Mira, als sie ihr Schwert z&uuml;ckte und mit\nunglaublichen Tempo auf das Br&uuml;derpaar zuraste. Doch dieses Mal sollte es nicht so\neinfach werden. In dem Moment, als Mira vor Darius auftauchte, schlug dieser mit all\nseiner Kraft zu und traf Mira in ihr Gesicht. Das M&auml;dchen flog quer &uuml;ber den Platz, schlug\nan dem K&auml;fig auf und fiel bewusstlos zu Boden. Garen sah mit weit ge&ouml;ffneten Augen auf\nden regungslosen K&ouml;rper des jungen M&auml;dchens. Doch seine &Uuml;berraschung wandelte sich\nschnell in Wut. Nicht noch einmal w&uuml;rde er zulassen, dass er machtlos einem Noxianer\ngegen&uuml;ber stand. Er z&uuml;ckte sein Schwert und st&uuml;rmte auf Darius zu. Dieser umfasste mit\nbeiden H&auml;nden fest den Stiel seiner Axt. Unter lautem Gebr&uuml;ll prallte die gigantische\nKlinge, die Garen sein Eigen nannte, auf die Axt seines Gegners. Draven st&uuml;rzte sich\nebenfalls in den Kampf: &bdquo;Wie immer! Der gro&szlig;e Draven wird sich jetzt mit Leichtigkeit\num zwei Gegner gleichzeitig k&uuml;mmern. Lasst das Schauspiel beginnen!&ldquo;. Mit diesen\nWorten nahm Draven eine seiner &Auml;xte und warf sie den beiden Damen entgegen, gegen\ndie er sich zu behaupten hatte. Obwohl die Axt eindeutig f&uuml;r Lux bestimmt war, stellte\nsich Riven sch&uuml;tzend vor Luxanna und parierte die Klinge, die in einem hohen Bogen\nnach oben flog. Eine weitere Axt traf Riven in ihr linkes Bein und w&auml;hrend sie zu Boden\nsank, fing Draven bereits seine erste Axt, um ihr erneut ein Ziel vorzugeben. &bdquo;Ich habe\nkeine Zeit f&uuml;r deine Spielchen!&ldquo;, schrie Lux. Noch bevor die Axt in ihre N&auml;he kam, feuerte\ndie Lichtmagierin einen gewaltigen Strahl geb&uuml;ndelter Energie auf Draven ab. Dieser\nkonnte nicht mehr ausweichen und verschwand in dem Laser. Nachdem der Lichtstrahl\nabklungen war, war keine Spur mehr von Draven zu erkennen. Lux hatte ihn schlicht\naufgel&ouml;st. Sofort begann Luxanna mit der Behandlung von Riven, wusste sie doch, dass\nihr Bruder sein Bestes geben w&uuml;rde, um mit Darius fertig zu werden. Keiner der beiden\nKontrahenten gab nach. Eher w&uuml;rde der Stahl der Waffe bersten, bevor der Wille eines\nK&auml;mpfers brechen w&uuml;rde. Sowohl die Axtklinge von Darius als auch die Schwertschneide\nvon Garen waren f&uuml;r diesen unglaublichen Druck nicht ausgelegt. Beide Waffen drohten\nzu zerbrechen. Keiner der K&auml;mpfer wich zur&uuml;ck, als die Waffen bereits zu knirschen und\nzu splittern begannen. Doch das Gl&uuml;ck sollte Garen an diesem Tag beiseite stehen.\nObwohl die Bearbeitung der noxischen Axtklinge makellos war, handelte es sich bei\nGarens Schwert um das Meisterst&uuml;ck des besten Schmiedes Valorans, einem Mann, der\nim Dienste Demacias stand. Die mehrfach gefaltete und mit Gold verst&auml;rkte Klinge hielt\ndem Druck l&auml;nger stand als der normale Stahl, aus dem Darius&acute; Axt hergestellt war. Die\nKlinge fuhr tief in die rechte Schulter von Darius und teilte diesen fast komplett. Kein\nMann k&ouml;nnte so etwas &uuml;berleben.\n&bdquo;Will vielleicht noch jemand der Macht von Demacia gegen&uuml;bertreten?&ldquo;, schrie Garen in\ndie Menge der zur Salzs&auml;ule erstarrten Soldaten. W&auml;hrend Lux Riven abst&uuml;tzte und vom\nLager davon half, trat Garen an die, noch immer bewusstlose, Mira heran und nahm sie\nauf. So wie ein Br&auml;utigam seine Braut tr&auml;gt, so trug Garen die angeschlagene Heldin vom\nSchlachtfeld. Die noxischen Soldaten konnten es immer noch nicht fassen. Sie f&uuml;hlten\nsich unbesiegbar, wurden sie doch ohne Zweifel von zwei gro&szlig;en K&auml;mpfern angef&uuml;hrt.\nEiner der Soldaten fasste seinen Mut zusammen, zog sein Schwert und rannte auf Garen\nzu. Er dachte sich, es w&auml;re ein Leichtes. Schlie&szlig;lich war Garens Schwert besch&auml;digt und\ner hatte gerade keine Hand frei. Mit lautem Gebr&uuml;ll rannte der F&auml;hnrich auf Garen zu.\nSichtlich genervt drehte sich dieser um und stie&szlig; den F&auml;hnrich mit einem starken Tritt\num. &bdquo;Junge, mach keinen Fehler! Steh auf und geh wieder zur&uuml;ck zu deinen Kameraden!\nIch werde dir nichts tun!&ldquo;, redete Garen auf den am Boden liegenden F&auml;hnrich ein. Die\nkleine Gruppe um Mira stampfte in den Wald. F&uuml;r sie war der Tag vorbei. Doch ein neuer\nMorgen zeichnete sich bereits am Horizont ab.\n\n**KAPITEL 2: DIE VEREINIGUNG RUNETERRAS**\nVon alle dem ahnten die Menschen jenseits der Kriegswege Noxus&acute; noch nichts. Doch\nein Mann hatte sich vorgenommen, dies zu &auml;ndern. Vor kurzem war er noch mit Riven\nunterwegs, um seine Kampfk&uuml;nste zu trainieren und nach verloren Sch&auml;tzen zu graben,\ndoch hatte sich dies alles ge&auml;ndert, als er Cho&acute;Gath an der Spitze einer noxischen Armee\ngesehen hatte. Er wusste, was dies zu bedeuten hatte, und traf mit Riven die Absprache,\nsie w&uuml;rde Demacia verst&auml;ndigen, w&auml;hrend er zuerst Ionia aufsuchte und anschlie&szlig;end\ndie Yordle und Freljord mobil machen w&uuml;rde. Er hatte sich das so einfach vorgestellt.\nDoch Noxus blockierte mittlerweile die &ouml;stlichen H&auml;fen. Doch um nach Ionia &uuml;bersetzen\nzu k&ouml;nnen, brauchte er ein Schiff. Die einzige M&ouml;glichkeit, die ihm noch blieb, war\nBilgewasser. Als er Bilgewasser betrat, war er mit Hilfe einer Kutte verkleidet. Einige\nnoxischen Wachtrupps waren bereits in der Stadt und fahndeten nach Gesuchten.\nImmer wieder kamen sie mit den betrunkenen Piraten und Schl&auml;gern aneinander. Einer\nder Piraten legte sich alleine mit mehreren Soldaten an. Nach einer kurzen Schl&auml;gerei\nlagen die Soldaten auf dem Boden. Der Pirat stellte sein Bein auf den Bauch des am\nBoden liegenden Hauptmanns. &bdquo;Ich werde mein Schiff niemandem unterwerfen. Der\ngro&szlig;e Gangplank f&auml;hrt nur unter seiner eigenen Flagge!&ldquo;, schrie der Piratenkapit&auml;n. So\njemanden konnte man gebrauchen, um nach Ionia &uuml;berzusetzen. Eilig ging der\nvermummte Mann auf Gangplank zu. &bdquo;Verzeihung. Ich br&auml;uchte jemanden, der mich\nnach Ionia &uuml;bersetzt.&ldquo;, sprach der Mann Gangplank an. &bdquo;Wer bist du?&ldquo;, fragte Gangplank\nvorwerfend. Der Mann zog die Kapuze seiner Kutte aus seinem Gesicht. &bdquo;Ich hei&szlig;e\nEzreal. Ich bin Mitglied der Widerstandsgruppe gegen Noxus!&ldquo;. &bdquo;Und was springt f&uuml;r\nmich dabei raus, he?&ldquo;, schrie der Kapit&auml;n. &bdquo;Du w&auml;rst daran beteiligt, wenn die Welt vor\nder gr&ouml;&szlig;ten Bedrohung aller Zeiten gerettet wird!&ldquo;, erkl&auml;rte Ezreal, doch Gangplank\nantwortete, dass man sich davon weder Rum noch Grog kaufen k&ouml;nne. Nach langen\nVerhandlungen einigten sich die M&auml;nner darauf, dass Gangplank eine &uuml;beraus\nzufriedenstellende Bezahlung erhalten w&uuml;rde. Auf die Frage von Ezreal, ob der\nPiratenkapit&auml;n zuverl&auml;ssig mit den noxischen Seefahrern fertig werden w&uuml;rde, war\nGangplank sichtlich beleidigt. Er war der Herr der Meere. Das Schiff, das seine geliebte\nTodesquell versenken k&ouml;nnte, m&uuml;sse erst noch gebaut werden. Eine Frage hatte der\nKapit&auml;n noch, bevor die Reise begann: &bdquo;Ahhrrr, wieso hast du dich nach Bilgewasser\n&uuml;bersetzen lassen, statt direkt nach Ionia zu segeln?&ldquo;. &bdquo;Machst du Witze?&ldquo;, entgegnete\nEzreal, &bdquo;Die Insel um Bilgewasser geh&ouml;rt mittlerweile zum Hauptkontinent. Die Kinder\nder Leere haben die Erde in der Meeresenge angehoben, damit die noxischen Truppen\nes einfacher haben.&ldquo;.\nDie Ausfahrt aus dem Hafen sollte sich als recht einfach herausstellen. Gangplank hatte\nseinen Vertrauten den Befehl gegeben, so viele Hafenkanonen wie m&ouml;glich zu besetzen\nund mit Hilfe einer wei&szlig;en Fahne zu kennzeichnen. Als das gigantische Schiff ablegte,\nnahm es ohne zu z&ouml;gern all die Kanonen unter schwerstes Feuer, welches &uuml;ber keine\ndieser Fahnen verf&uuml;gte. Es waren insgesamt 5 der 23 Hafenkanonen. Gangplanks\nM&auml;nner hatten gute Arbeit geleistet und auch seine Kanoniere schienen sich bereits\neingeschossen zu haben. Die noxischen Soldaten in den ersten 3 Kanonen-Unterst&auml;nden\nwussten nicht, wie ihnen geschah. Schnell hatte Gangplanks Dauerfeuer die Kanonen\nsamt ihrer Besatzung vernichtet. Die vierte Kanone war in einem der Hafent&uuml;rme\nuntergebracht. Von dem Feuer auf die ersten drei Kanonen aufgeschreckt, luden die\nnoxischen Kanoniere gerade ihre Waffe, als Gangplanks vernichtendes Feuer ihnen\nbuchst&auml;blich den Boden unter den F&uuml;&szlig;en wegschoss. Eine Salve aus mindestens 4\nKugeln schlug in den Turm ein, der f&uuml;r eine solche Belastung nicht ausgelegt war. Mit\nlautem Poltern brach der Turm in sich zusammen. Eine Kugel, abgefeuert aus der\nverbleibenden Kanone, verfehlte Gangplanks Schiff. Durch diesen Fehlschuss lenkten sie\njedoch die Aufmerksamkeit der Salzwassergei&szlig;el auf sich. Unter der Verwendung von\nGangplanks m&ouml;rderischsten Waffe, seiner eigenen Kreation, der Schrotmunition, gelang\nes Gangplank mit einem einzigen Schuss die sechsk&ouml;pfige Mannschaft der gigantischen\nHafenkanone auszuschalten, ohne der Kanone auch nur einen Kratzer zuzuf&uuml;gen. Es war\ngeschafft. Vor Gangplank und Ezreal lag das Meer des Beh&uuml;ters und hinter ihnen? Nun\nja, hinter ihnen nahmen drei noxische Fregatten die Verfolgung auf. &bdquo;Mit denen werden\nwir spielend fertig! Die Kanonen mit Kettengeschossen laden! Wollen wir doch mal\nsehen, ob diese Landratten auch ohne Segel mit uns mithalten k&ouml;nnen!&ldquo;, schrie\nGangplank quer &uuml;ber das Deck seines gigantisches Schiffes Todesquell. Ohne\nWiderworte gehorchte jeder seiner M&auml;nner. Gangplank selbst &uuml;bernahm das Steuer,\nw&auml;hrend Ezreal in seiner Kutte neben ihm stand. &bdquo;K&auml;pt&acute;n, Schiff voraus!&ldquo;, schrie einer\nder Piraten. Gangplank nahm sein Fernrohr und sah sich das am Horizont auftauchende\nSchiff an. Es war die Fregatte seiner gr&ouml;&szlig;ten Rivalin, der einzigen Frau, die ihr Schiff gut\ngenug man&ouml;vrieren konnte, um Gangplank ernsthaft gef&auml;hrlich werden zu k&ouml;nnen.\n&bdquo;Ahrrr, das ist die Piratenj&auml;gerin!&ldquo;, schrie Gangplank. &bdquo;Miss Fortune?&ldquo;, fragte Ezreal,\n&bdquo;wieso arbeitet die mit den Noxianern zusammen?&ldquo;. &bdquo;Wei&szlig; ich nicht! Aber du kannst sie\nja selbst fragen, wenn sie uns versenkt hat, Jungchen!&ldquo;, antwortete Gangplank.\nIn einer engen Wende steuerte Gangplank auf seine Verfolger zu. Die drei noxischen\nFregatten n&auml;herten sich in einer alten Seeformation, mit der Gangplank keine Probleme\nhatte. Zwei der Fregatten segelten parallel nebeneinander auf gleicher H&ouml;he, w&auml;hrend\ndas dritte Schiff zwischen den beiden etwas weiter hinten segelte. So erhielten alle drei\nFregatten gen&uuml;gend Wind und k&ouml;nnten ein feindliches Schiff schnell umzingeln. Doch\nGangplank nutzte genau dies zu seinem Vorteil. Er fuhr sehr schnell zwischen die ersten\nbeiden Fregatten und bevor diese &uuml;berhaupt reagieren konnten, nahm Gangplank beide\nins Dauerfeuer und verpasste ihnen eine volle Breitseite, was beide Schiffe nicht\nsonderlich gut verkrafteten. Sowohl Haupt- als auch Nebensegel des ersten Schiffes\nbrachen und schlugen auf die Oberfl&auml;che der rauen See. Das zweite Schiff hatte ein\nwenig mehr Gl&uuml;ck. Nur das Nebensegel war gebrochen, jedoch hatte Gangplank das\nRuder getroffen und es eingeklemmt. Das Schiff konnte lediglich im Kreis fahren. Die\ndritte Fregatte sollte Gangplank jedoch &uuml;berraschen. Denn als er seinen ersten Offizier\nan Deck erkannte und Gangplanks Piratenflagge hoch &uuml;ber dem Mast wehte, wusste\nGangplank, dass jetzt nur noch Miss Fortune zwischen ihm und der offenen See stand.\nUnter lautem Gebr&uuml;ll hielten die Besatzungen beider Schiffe auf die Piratenj&auml;gerin zu.\nSie wussten, dass Miss Fortunes Schiff nicht f&uuml;r eine Seeschlacht, sondern f&uuml;r die\nVerfolgung eines fliehenden Piraten ausgelegt war. Die Bewaffnung der Steuer- und\nBackbordseite fielen bei ihrem Schiff eher gering aus. Doch Miss Fortune verf&uuml;gte &uuml;ber\neine f&uuml;nfl&auml;ufige Kanone am Bug ihres Schiffen, welche sie bis zu drei&szlig;ig Grad sowohl\nnach rechts als auch nach links drehen konnte. Die einzige Chance bestand darin, ihrem\nSchiff eine Breitseite zu verpassen. Diese riesige f&uuml;nfl&auml;ufige Kanone konnte einem\nwirklich Angst einjagen. Die Kanone war so gigantisch, dass sie zwar &uuml;ber Deck\nabgefeuert wurde, beim Rotieren jedoch unter Deck f&uuml;hrte, wo sie nachgeladen wurde.\nEs war ein Dauerlauf f&uuml;r die Besatzung der Kanone. W&auml;hrend an Position 1 die Kanone\nabgefeuert wurde, lie&szlig; Miss Fortune sie nach einer Drehung an Position 2 abk&uuml;hlen. An\nden Positionen 3 und 4 wurden die Triebladung und die Kugel geladen, um schlie&szlig;lich an\nPosition 5 angez&uuml;ndet zu werden, sodass sie bei erneutem Erreichen der ersten Position\ndirekt feuerte. Die M&auml;nner der Piratenj&auml;gerin brachten es zur ihrer Glanzzeit mit unter\nauf 17 Schuss pro Minute. Durch ein einzigartiges Man&ouml;ver gelang es Gangplank, der\nPiratenj&auml;gerin auszuweichen und ihr Schiff man&ouml;vrierunf&auml;hig zu machen. Indem er sein\nGeleitschiff als Deckung nutzte, kam er in Schussreichweite f&uuml;r seine Kanonen und\nkonnte mit Hilfe der Kettengeschossen s&auml;mtliche Segel des gigantischen Dreimasters\nzerst&ouml;ren und so ungehindert die &Uuml;berfahrt nach Ionia antreten. Gangplank gefiel eine\nsolch langweilige Seefahrt nicht, war er schlie&szlig;lich kein F&auml;hrmann, sondern ein\ngef&uuml;rchteter Pirat, wenn nicht sogar der gef&uuml;rchtetste aller Piraten. Doch Ezreal kam dies\ngerade recht. Er lie&szlig; sich die frische Seeluft durch die Haare wehen, wusste er doch, dass\ner am Ende dieses Jahres entweder tot auf einem Schlachtfeld liegen w&uuml;rde oder um die\ngefallenen Kameraden trauern w&uuml;rde.\nEs dauerte nur wenige Tage, bis die K&uuml;ste Ionias auftauchte, die noch v&ouml;llig unber&uuml;hrt zu\nsein schien. Noxus konzentrierte sich in erster Linie auf Demacia und war f&uuml;r eine\nerneute Invasion Ionias noch nicht bereit. Dies w&uuml;rde Ezreal wertvolle Zeit bescheren. Er\nbefahl Gangplank, direkt am Hafen der Hauptstadt anzulegen. Mit eingeholter Flagge lief\ndas gewaltige Schiff in den ionischen Hafen ein. Als Gangplanks M&auml;nner die Taue an dem\nSteg befestigten, z&uuml;ckte Ezreal einen Beutel von Gold, &uuml;berreichte ihn Gangplank und\nverschwand von Deck. Ohne Unterbrechung st&uuml;rmte Ezreal auf den Palast zu, in dem der\nhohe Rat Ionias diskutierte. Ohne sich von den Wachen aufhalten zu lassen, unterbrach\nEzreal eine ihrer Sitzungen. &bdquo;Hoher Rat! Runeterra ben&ouml;tigt Ionias Hilfe. Noxus hat sich\nmit der Leere verb&uuml;ndet und &uuml;berrennt nun Valoran. Es ist unabdingbar, dass alle V&ouml;lker\nzusammenhalten m&uuml;ssen, um Noxus erneut in die Schranken zu verweisen. Ich bitte\neuch, Truppen nach Demacia zu entsenden. Dort wird Noxus zuerst zuschlagen und\nwenn Demacia f&auml;llt, ist ein Sieg unm&ouml;glich!&ldquo;, verk&uuml;ndete Ezreal, als er auf den Tisch in\nder Mitte der Ratshalle sprang. &bdquo;Junger Mann, ihr wisst wohl nicht, wo ihr hier seid.\nDeshalb lasse ich euch diese Respektlosigkeit noch einmal durchgehen. Wir werden &uuml;ber\neuer Anliegen beratschlagen. Euer Antrag sollte in zwei Monaten fertig sein.&ldquo;, antwortete\neines der Ratsmitglieder mit st&ouml;rrischer Ruhe. Auf die Anmerkung von Ezreal, dass dies\nsofort geschehen m&uuml;sse, wurde dieser aus dem Saal verbannt, doch bevor auch nur eine\nWache den Ratssaal betrat, schritt ein Anderer in die gro&szlig;e Halle. Der Mann schien\nselbst von der Dunkelheit verzerrt worden zu sein. Ezreal kannte ihn. Er hatte schon viel\n&uuml;ber ihn gelesen, &uuml;ber seinen Heldenmut und &uuml;ber das Opfer, das er aufbrachte, um sich\ngegen Noxus zu stellen. In der Ratshalle stand Varus, seinen Bogen im Anschlag, obwohl\ner sich unter Freunden befand. &bdquo;Dieser Rat hat seinen Blick f&uuml;r wichtige Dinge verloren.\nHier wird &uuml;ber Politik geredet, w&auml;hrend da drau&szlig;en eine Welt in Scherben liegt. Hiermit\nenthebe ich den Rat all seiner Rechte. Ezreal! Ich werde eine ionische Streitmacht\naufstellen, wie es sie in der Geschichte unseres Landes noch nicht gab! Und ich werde\nnach Demacia segeln. Demacia hat uns damals geholfen, gegen Noxus zu bestehen und\nes wird Zeit, dass wir diese Schuld begleichen. Es wird Zeit, dass wir diesen noxischen\nHunden zeigen, dass sie nichts weiter sind als Menschen. Menschen, die man besiegen\nund t&ouml;ten kann.&ldquo;, verk&uuml;ndete Varus. Ezreal gab im Recht und gab ihm den Rat, direkt\nnach der Verteidigung Demacias zum Gegenangriff auszuholen. Er w&uuml;rde unterdessen\ndie Yordle und Freljord verst&auml;ndigen und kurz vor der noxischen Hauptstadt auf die\nArmeen des Guten treffen. Der Rat realisierte nicht, was eben geschehen war, denn\nEzreal st&uuml;rmte in Richtung des Hafens, um mit einer kleinen Schaluppe nach Piltover\n&uuml;berzusetzen. Er wollte damals die Yorlde bereits in Bandle verst&auml;ndigen. Die Stadt\nwurde jedoch dem Erdboden gleichgemacht. Alle &uuml;berlebenden Yordle lebten nun in\nHeimerdingers Universit&auml;t in Piltover. Varus hetzte stattdessen in Richtung der Kasernen.\nJeder ionische Soldat, der auch nur einen Tropfen Ehre im Leib hatte, w&uuml;rde sich ihm\nanschlie&szlig;en. Au&szlig;erdem waren dort auch die ionischen Champions nach dem Untergang\nder Liga untergekommen. Helden, die in ihrer Zeit vor und w&auml;hrend der Liga gro&szlig;es\ngeleistet hatten, w&uuml;rden auch im Kampf gegen Noxus noch gro&szlig;es leisten. Als er die\nKaserne betrat, erwarteten ihn bereits die beiden Champions Karma und Irelia. Beide\nhatten geh&ouml;rt, was geschehen war, und schlossen sich Varus&acute; neuer Armee schnell an.\nEzreal verlie&szlig; w&auml;hrenddessen den sicheren Hafen auf der heruntergekommensten\nSchaluppe, die in der gro&szlig;en Stadt zu finden war. Er dachte sich, er w&uuml;rde so am\nwenigsten Aufsehen erregen, doch nun hatte er Bedenken, dass das kleine Boot die\n&Uuml;berfahrt nicht unbeschadet &uuml;berstehen w&uuml;rde. Die Besatzung der &bdquo;Windbrecher&ldquo;, wie\ndas kleine Boot liebevoll getauft war, bestand aus dem Kapit&auml;n, einem alten Mann, der\nw&auml;hrend der gro&szlig;en Invasion von Noxus in Ionia ein Auge verlor und nun als einsamer\nFischer lebte. Neben dem Kapit&auml;n erkannte Ezreal noch eine weitere Person an Bord.\nEine Person, die er nicht kannte. Er hatte die besagte Person weder w&auml;hrend seinen\nLigak&auml;mpfen entdeckt, noch w&auml;hrend seinen Forschungsreisen getroffen. W&auml;hrend der\n&Uuml;berfahrt mit der kleinen Schaluppe kam Ezreal mit dem mysteri&ouml;sen Fremden ins\nGespr&auml;ch. Es stellte sich heraus, dass die Person weiblich und ihr Name &bdquo;Icthria&ldquo; war. Sie\nwurde von einem Beschw&ouml;rer nach Runeterra gerufen, wurde aber an der Liga nicht\nangenommen, da kein offizieller Befehl vorlag. Ebenfalls erkl&auml;rte Icthria, dass sie von\nihrem Herbeirufer mit den M&auml;chten der Elemente ausgestattet wurde. Icthria fragte\nEzreal, ob er ihr einen Gefallen tun k&ouml;nne. Icthrias Eintrag m&uuml;sse sich noch in den\nArchiven befinden. Sie bat Ezreal darum, in den Archiven nach dem Namen des\nBeschw&ouml;rers zu suchen, der sie herbeirief. Sie w&uuml;rde ihn gerne um alles auf der Welt\npers&ouml;nlich kennen lernen. Ezreal erkl&auml;rte, dass die Bauten der Liga von Noxus zerst&ouml;rt\nwurden und er nicht wisse, ob das Archivegeb&auml;ude oder gar ihr Herbeirufer noch\nexistiere. Icthria blickte traurig auf den Boden des kleinen Bootes und sprach w&auml;hrend\nder gesamten &Uuml;berfahrt kein einziges Wort mehr. Icthria verschwand in der\ndarauffolgenden Nacht auf mysteri&ouml;se Weise von Bord.\nAm n&auml;chsten Morgen erreichten Ezreal und der alte Mann den Hafen von Piltover. Doch\ndie Begr&uuml;&szlig;ung gefiel Ezreal nicht. In der kompletten Stadt waren Sch&uuml;sse und &auml;hnliche\ngrauenvolle Ger&auml;usche zu h&ouml;ren. Rauch stieg von der Universit&auml;t auf. Jener Universit&auml;t,\ndie sich auf Ezreals Route befand. Dort hielten sich die &uuml;berlebenden Yordle und einige\nehemalige Champions der Liga auf. Ezreal wusste zumindest von einer, die nicht zu den\nYordle geh&ouml;rten: Caitlyn. Vermutlich hatte sie sich den Rebellen angeschlossen. Ezreal\nbefahl seinem Kapit&auml;n, nicht anzulegen, sondern nah an der K&uuml;ste vorbeizuschiffen. Als\nsich das kleine Boot der K&uuml;ste n&auml;herte, nutzte Ezreal die Macht seines Handschuhs, ein\nArtefakt, das er auf seiner bislang erfolgreichsten Expedition fand. Er teleportierte sich\nauf die Hafenmauern von Piltover und begann sich zwar schnell, jedoch vorsichtig, der\nUniversit&auml;t zu n&auml;hern. Als er durch die dicht bebauten Stra&szlig;en der scheinbaren\nGeisterstadt lief, h&ouml;rte er weitere Sch&uuml;sse, deren Ursprung sich zu n&auml;hern schien.\nGerade, als er den Blick in eine Seitengasse wagte, rannte Caitlyn in ihn hinein. Ezreal\nerkannte sie trotz ihres zerzausten Aussehens, hatte er sich doch w&auml;hrend seiner Zeit in\nder Liga mit ihr angefreundet. &bdquo;Ezreal! Hilf mir!&ldquo;, flehte Caitlyn, &bdquo;jemand oder etwas\nverfolgt mich!&ldquo;. &bdquo;Beruhige dich doch! Wieso schie&szlig;t du hier wie wild herum?&ldquo;, fragte\nEzreal, bevor wie aus dem Nichts etwas Unmenschliches vor ihnen auftauchte. Bei\nn&auml;herem Hinsehen erkannte Ezreal die Gestalt von Talon. Doch war seine rechte Hand\ndurch seine Klinge ersetzt worden. Au&szlig;erdem waren seine Brust, seine Beine und sein\nrechter Arm mit Metallplatten verst&auml;rkt. Jedoch trug er keine R&uuml;stung. Die Metallplatten\nwaren direkt in sein Fleisch vernietet. Auf dem R&uuml;cken trug er eine Maschine, die\nregelm&auml;&szlig;ig eine violette Fl&uuml;ssigkeit in seinen K&ouml;rper pumpte. Ezreal kannte diese\nFl&uuml;ssigkeit. Es handelte sich um einen Leistungsverst&auml;rker, eine Kreation aus dem Hause\nMundo, welche ihren Anwender st&auml;rker, schneller und schmerzunempfindlicher machte,\njedoch auf Kosten seiner Menschlichkeit und geistigen Gesundheit. Im Gesicht trug Talon\neine Maske, die seine Nase und seinen Mund verdeckte und augenscheinlich seine\nAtmung steuerte. Egal was Talon dazu bewegte, sich solch einer, h&ouml;chstwahrscheinlich\nsehr schmerzhaften, Operation zu unterziehen, machte sie jedoch aus ihm einen\nweitaus m&auml;chtigeren Gegner, als er es zur Zeiten der Liga je war. Mit gequ&auml;lter Stimmer\nsprach Talon zu Ezreal: &bdquo;Oh, noch so ein verhasster Rebell. Das Oberkommando wird mit\nMecha-Talon zufrieden sein&ldquo;. Caitlyn unterbrach die Ansprache von Mecha-Talon, wie er\nsich nun selbst nannte, indem sie einen Schuss auf seine Brust abgab, der die\nPanzerplatte jedoch nicht durchdringen konnte und schlichtweg abprallte. Mit lautem\nund grauenvollem Lachen trennte Talon den Lauf von Caitlyns Gewehr ab. &bdquo;Dein\nl&auml;cherliches Gewehrchen kann mir nichts anhaben!&ldquo;, schrie Talon, der jedoch von einem,\nvon Ezreal abgefeuerten, magischen Pfeil getroffen wurde. Talon hob mit seinem\nges&uuml;nderen Arm die &uuml;berraschte Caitlyn hoch und warf sie gegen eine der\nStra&szlig;enlampen von Piltover. Caitlyn schlug mit dem R&uuml;cken an der Laterne auf und fiel\nzu Boden, in der Hand noch immer ihre besch&auml;digte Waffe. Ezreal feuerte\nw&auml;hrenddessen immer wieder magische Ladungen auf Talon, die ihn zwar scheinbar\nschmerzten, ihn jedoch kaum stoppen konnten. Talon schlug Ezreal immer wieder in den\nMagen. Bei jedem Sto&szlig; wurde Ezreal einige Meter weggeschleudert, sodass er meistens\ngen&uuml;gend Zeit hatte, um ein bis zwei Sch&uuml;sse abzugeben, bevor er wieder einen Treffer\nzu verzeichnen hatte. Talon spielte lediglich mit Ezreal. Er benutzte seine neue &bdquo;Klingen-\nHand&ldquo; nicht. Er wollte ihn nicht t&ouml;ten, sondern ein wenig Spa&szlig; haben. Nach einer Reihe\nvon mehreren Schl&auml;gen sank Ezreal bewusstlos zu Boden. Talon trat &uuml;ber den, auf dem\nBoden liegenden Ezreal, hob seinen Kopf an seinen Haaren hervor und legte seine Klinge\nan seinem Hals an. Als Talon zu seinem verheerenden Schnitt ansetzen wollte, schlug\neine gewaltige Energiekugel in Talons Oberk&ouml;rper ein und schleuderte ihn von Ezreal\nweg. Talon blickte sich um und entdeckte einer Krieger auf sich zu rennen, der aus den\nNebelschwaden heraustrat, die sich inzwischen &uuml;ber Piltover gelegt hatten. Der Krieger\ntrug eine gewaltige Kanone, die noch immer von dem Energieschuss qualmte. &bdquo;Egal wie\ngro&szlig; deine Waffe ist, im Nahkampf bist du Chancenlos!&ldquo;, schrie Talon dem mysteri&ouml;sen\nKrieger entgegen. Dieser l&auml;chelte stumm und seine Kanone begann sich zu verwandeln.\nBinnen weniger Sekunden hatte sich die Kanone in einem ebenso gewaltigen Hammer\nverwandelt und der Krieger st&uuml;rmte auf Talon zu. Als der erste Schlag des riesigen\nHammers auf die Brustplatte von Talon traf, h&ouml;rte man das Metall unter dem Hammer\nknirschen. Die verwundete Caitlyn blinzelte, um ihren Retter zu erkennen, und murmelte\nseinen Namen: &bdquo;J&hellip;Jayce.&ldquo;. Jayce f&uuml;hrte seine Folge von Angriffen weiter fort. Er schlug\nmit dem Hammer in Talons Unterleib, hob ihn mit seinem Hammer &uuml;ber sich selbst\nhinweg und schlug ihn auf der Gegenseite zu Boden. Jedes Mal, wenn sich Talon zur&uuml;ck\nzog, um der Angriffsserie zu entgehen, wandelte sich Jayces Hammer in die Kanone,\nnahm Talon unter Beschuss und als dieser zum Nahkampf &uuml;berging, transformierte sich\ndie Kanone zur&uuml;ck in den Hammer und das Schauspiel begann von neuem. Es sah gut f&uuml;r\nJayce aus, doch war Jayce keine Maschine, so wie Talon jetzt eine war. Jayce wurde mit\njedem Schlag, den er ausf&uuml;hrte, m&uuml;der und m&uuml;der. Talon h&auml;tte dagegen ewig\nweitermachen k&ouml;nnen. So kam es, dass Jayce irgendwann zu schwach war, um seinen\nHammer anzuheben. Diesen Moment der Schw&auml;che nutzte Talon aus und zog Jayce\neinen nicht tiefen, aber dennoch verh&auml;ngnisvollen Schnitt zu. Jayce sank vor Talon zu\nBoden und r&uuml;hrte sich nicht weiter. Talon f&uuml;hlte sich als Sieger und trat auf Jayce, um\nsich in seiner vollen Gr&ouml;&szlig;e zu zeigen. Doch seine Gedanken wurden von dem Zerbersten\nvon Glas unterbrochen. Talon schaute zu Boden und erkannte die Fl&uuml;ssigkeit, die in\nseiner Maschine gespeichert war. Jene Fl&uuml;ssigkeit, die ihn am Leben hielt. Als er sich\numdrehte, sah er Caitlyn. Sie hatte sich mit letzter Kraft aufgerichtet und ihre\nbesch&auml;digte Flinte angelegt. Noch immer stieg Rauch aus der abgeschnittenen M&uuml;ndung\nihres Gewehres. Talon sp&uuml;rte, wie seine Lebenskraft dahinschwand, und sah das Ende\nn&auml;her kommen. Sein Blick wurde tr&uuml;ber und die Kraft, die ihn auf den Beinen hielt,\nverschwand. Er fiel. Doch noch bevor sein, mit Metall verst&auml;rkter K&ouml;rper, den Boden traf,\nwaren s&auml;mtliche Lebenszgeister von ihm gewichen. Talon war besiegt und dieses Mal\nendg&uuml;ltig. Caitlyn schleppte sich zu Ezreal und r&uuml;ttelte diesen wach. Ezreal sah sich um.\nEr erkannte Talon, der tot am Boden lag, und einen Fremden, der scheinbar schwer\nverletzt war. &bdquo;Wir m&uuml;ssen Jayce zu Universit&auml;t bringen. Heimerdinger kann ihm helfen!&ldquo;,\nflehte Caitlyn den verwirrten Ezreal an. Caitlyn half Ezreal auf die Beine, da sie sich selbst\nlangsam von ihrem Hieb erholt hatte, den Talon ihr verpasst hatte.\nEzreal griff Jayce unter die Arme und Caitlyn hob seine Beine an. Zusammen trugen die\nbeiden den verwundeten Jayce bis zur Universit&auml;t, an deren Tor schon mehrere Yordle\nwarteten und mit mehr oder weniger geeigneten Waffen den Eingang bewachten. Einige\nhatte sich eine R&uuml;stung aus Eimern und alten Blechen zusammen geschraubt, andere\nhatten dagegen eine zu gro&szlig;e Uniform an. Die Waffen bestanden zum gr&ouml;&szlig;ten Teil aus\nSteinschleudern, Blasrohren, Gartenger&auml;ten und St&ouml;cken. Nur die wenigsten hatten\nechte Waffen aus Stahl. Die Yordle kannten Caitlyn und Jayce, waren aber Ezreal\ngegen&uuml;ber misstrauisch. Auf dem Torbogen stand einer der bekannteren Yordle: Ziggs.\n&bdquo;Ezreal! Alter Haudegen, dass ich dich noch mal wiedersehe. Komm rein! Bevor dieses\nKanonenfutter von Noxus wieder auftaucht.&ldquo;, schrie Ziggs mit schriller Stimme von seiner\nerh&ouml;hten Position, von welcher aus er anr&uuml;ckende Noxianer schon fr&uuml;h mit Bomben und\nGranaten bewerfen konnte. Das gewaltige Tor &ouml;ffnete sich, sodass Caitlyn und Ezreal den\nverwundeten Jayce hineintragen konnten. Heimerdinger war gerade auf dem Hof und\nschraubte zusammen mit ein paar weiteren Yordle an den Verteidigungsanlagen, die vor\nkurzem installiert wurden. Als Heimerdinger den verletzen Jayce sah, wies er zwei Yordle\nan, sich um diesen zu k&uuml;mmern. Zwei Yordle, beide hatten wei&szlig;e Binden mit einem\nroten Kreuz um ihren Arm gewickelt, kamen auf Caitlyn und Ezreal zu und lie&szlig;en sie\nverstehen, dass sie Jayce auf eine Holztrage zu legen hatten. Kaum abgelegt, begannen\ndie Yordle mit der Versorgung von Jayce. Ezreal ging zu Heimerdinger, denn schlie&szlig;lich\nwar er nur hierhergekommen, um die Yordle f&uuml;r den Feldzug gegen Noxus zu\nmobilisieren. Heimerdinger lehnte dies jedoch ab. Es sei nicht der Krieg der Yordle.\nEzreal wies ihn darauf hin, dass es jedermanns Krieg sei. Heimerdinger solle sich doch\nnur einmal umsehen, denn &uuml;berall auf dem Hof lagen verletzte Yordle. &bdquo;Ezreal hat Recht,\nalter Freund!&ldquo;, meldete sich Jayce zu Wort, der zwar schon wieder aufstehen konnte,\naber sich immer noch mit seinem Hammer abst&uuml;tzen musste, &bdquo;wie lange willst du noch\nwarten, bevor ihr Demacia aktiv helft?&ldquo;. Heimerdinger blickte zu Boden. In diesem\nMoment schlug etwas in die Universit&auml;t ein. Einige Steinplatten fielen aus der\nHausfassade und begruben einige Yordle unter sich. Ziggs schrie panisch vom Torbogen\nherunter: &bdquo;Urgot! Urgot! Urgot!&ldquo;. Heimerdinger reagierte sofort. Er befahl einigen\nYordle, die Schilde hochzufahren. Andere sollten die Verletzen in Sicherheit bringen.\nKaum hatte er den Befehl ausgesprochen, aktivierte sich eine kleine Schildkuppel &uuml;ber\ndem Vorhof, die die Yordle vor kurzem entworfen und dort installiert hatten. Ziggs\nschrie: &bdquo;In Deckung!&ldquo;. In diesem Moment durchbrach ein gelber Roboter die Tore der\nUniversit&auml;t. Blitze schlugen aus ihm heraus und trafen einige, panisch umherrennende,\nYordle. &bdquo;Ziggs! Bring die Kinder ins Haus!&ldquo;, schrie Heimerdinger auf. Ziggs sprang sofort\nvon dem Torbogen und nahm zwei kleine Yordlekinder unter seine Arme und trug sie ihn\ndie Eingangshalle der Universit&auml;t. Immer wieder kam er unter schwerem Beschuss\nherausgerannt und packte sich zwei &auml;ngstliche Kinder, um sie in Sicherheit zu bringen.\nCaitlyn erkannte den Roboter: &bdquo;Blitzcrank!&ldquo;. &bdquo;Was? Das kann nicht sein! Blitzcrank\ngehorcht nur seinem Erschaffer. Und das w&uuml;rde bedeuten, dass Viktor f&uuml;r Noxus\nk&auml;mpft!&ldquo;, schrie Jayce. &bdquo;So ist es!&ldquo;, br&uuml;llte Viktor vom Dach der Universit&auml;t. Jayce schrie\nHeimerdinger an, er solle die neue R&uuml;stung jetzt aktivieren. Die Anmerkung, dass der\nPrototyp der Vollmetall-R&uuml;stung noch nicht getestet sei, war ihm egal. Nach kurzer\nDebatte f&uuml;hrte Heimerdinger Jayce in ein kleines H&auml;uschen, aus dem dieser nach kurzer\nZeit in einer High-Tech-R&uuml;stung heraustrat. Mit einem einzigen Sprung sprang Jayce zu\nViktor und verwickelte diesen in einen Kampf. Heimerdinger unterdessen wies Ezreal an,\nzu ihm in das Haus zu kommen. Ezreal blickte zu Heimerdinger, anschlie&szlig;end zu\nBlitzcrank und letztlich zu Caitlyn. Diese rief ihm entgegen: &bdquo;Geh schon! Ich k&uuml;mmere\nmich um diesen Blecheimer!&ldquo;. Ezreal rannte in das Haus und Heimerdinger verschloss die\nT&uuml;r hinter ihm. &bdquo;Bitte hilf mir mein Volk zu retten!&ldquo;, flehte Heimerdinger den verwirrten\nEzreal an. Dieser entgegnete, dass er dies vorhabe und er hinaus m&uuml;sse, um den\nanderen zu helfen. &bdquo;Warte!&ldquo;, schrie Heimerdinger, &bdquo;Ich kenne dieses Artefakt an deiner\nHand. Das ist das Schl&uuml;sselst&uuml;ck zu meiner neuesten Erfindung. Sagt dir der Begriff\n&bdquo;Pulsfeuer&ldquo; etwas?&ldquo;. Ezreal entgegnete, dass es sich bei dem Pulsfeuer um eine\nunglaubliche Energie handele, man sie aber nicht kontrollieren k&ouml;nne. Heimerdinger gab\nEzreal Recht, widersprach ihm jedoch in seiner letzten Bemerkung. Mit diesen Worten\nzog er einen Vorhang beiseite und Ezreal erblickte eine R&uuml;stung, in der sich das\nlegend&auml;re Pulsfeuer f&ouml;rmlich sammelte. Heimerdinger befahl Ezreal, die menschengro&szlig;e\nR&uuml;stung anzulegen, was dieser auch tat. Heimerdinger f&uuml;gte hinzu, dass er lediglich eine\nMacht brauchte, der das Pulsfeuer folgen konnte. Eben diese Macht wohnte Ezreals\nHandschuh inne. Als Ezreal die Pulsfeuer-R&uuml;stung komplett angelegt hatte, erwachte\ndiese zum Leben. Nach und nach aktivierten sich der eingebaute Thermal-Reaktor und\nder Fusionskern. Als beide Ger&auml;te aktiv waren, begann sich eine Kanone um Ezreals\nHandschuh zu bilden. Heimerdinger freute sich und gab Ezreal zu verstehen, dass er\nloslegen konnte.\nAls Ezreal zur&uuml;ck in den Vorhof kam, waren Yordle und noxische Soldaten in mehrere\nK&auml;mpfe verwickelt. Die gut ausgebildeten Soldaten hatten leichtes Spiel gegen die\nkleinen Yordle. Caitlyn hatte Blitzcrank mittels einer kleinen Yordle-Pistole\nniedergestreckt. Von Jayce und Viktor war nichts mehr zu sehen. Jedoch stand Urgot nun\nin mitten der umherrennenden Yordlekinder. Unter einem seiner F&uuml;&szlig;e lag Ziggs und\nr&uuml;hrte sich nicht mehr. Die Pulsfeuer-R&uuml;stung, die Ezreal trug, analysierte das Geschehen\nund zeigte Ezreal den besten Weg, um den Kampf m&ouml;glichst schnell zu gewinnen. Ezreal\nkonzentrierte sich, um einen seiner magischen Bolzen abzufeuern. &Uuml;berlagert von seiner\nPulsfeuer-Kanone, feuerte sein Handschuh einen gewaltigen Energieschuss ab, der eine\nvon Urgots F&uuml;&szlig;en abtrennte. Dieser schwankte und fiel zu Boden. &Uuml;berrascht blickte er\nsich um und sah Ezreal angsterf&uuml;llt an, denn schlie&szlig;lich kannte er Ezreals Kraft von den\nRichtfeldern. Ezreal blickte auf seine Kanone, war er doch von deren Kraft selbst\n&uuml;berrascht. Urgot ordnete die Fu&szlig;soldaten an, sich auf Ezreal zu konzentrieren. Ezreal\nblickte in die sich n&auml;hernde Armee und bereitete seine st&auml;rkste F&auml;higkeit vor: Das\nEnergietrommelfeuer. Als sich der Rauch von der gewaltigen Anh&auml;ufung von Energie\ngelegt hatte, war die noxische Armee verschwunden und Ezreal legte seine Kanone aus\nn&auml;chster N&auml;he an Urgot an. &bdquo;Jetzt wirst du f&uuml;r deine Verbrechen an den Yordle\nbezahlen!&ldquo;, schrie Ezreal auf Urgot nieder, bevor er sein zusammengeflicktes Fleisch mit\nseiner Kanone durchschoss. Urgot sackte nach diesem letzten Treffer in sich zusammen\nund begann sich aufzul&ouml;sen. Caitlyn trat an Ezreal heran und fragte, was mit Urgot\ngeschieht. Ezreal antwortete nur mit den Worten: &bdquo;Das Pulsfeuer verbrennt alles!&ldquo;.\nVon einem lauten Schrei aufgeweckt, blickten Caitlyn und Ezreal zur Spitze der\nUniversit&auml;t. Dort stand Viktor und hatte Jayce mittels moderner Technik gefesselt. Noch\nbevor irgendjemand etwas dagegen tun konnte, feuerte Viktor seinen t&ouml;dlichen Laser ab\nund durchbohrte Jayces Herz. Dieser fiel leblos in seine Fesseln, und als sich diese\nFesseln l&ouml;sten, st&uuml;rzte Jayce vom Dach der Universit&auml;t und schlug hart auf dem Vorhof\nauf. Caitlyn hielt sich eine Hand vor den Mund und begann zu weinen. Auf das herzhafte\nLachen von Viktor antwortete Ezreal mit einem lauten &bdquo;Du Bastard&ldquo; und mehreren\nungezielten Sch&uuml;ssen, denen Viktor leicht auswich. Doch nach einiger Zeit unterdr&uuml;ckte\nEzreal seine Wut, seine Sch&uuml;sse wurden gezielter und Viktor hatte es immer schwerer\nauszuweichen. Immer wieder streifte ihn einer von Ezreals Energiesch&uuml;ssen. Viktor\n&uuml;berlegte nicht lange und wollte Ezreal in einen Nahkampf verwickeln. Er sprang von\ndem Dach der Universit&auml;t, doch auf dem Weg nach unten traf ihn bereits einer von\nEzreals Sch&uuml;ssen. Als er unten ankam, musste er in die Knie gehen, um die Schmerzen\ndes Treffers zu verkraften. Ezreal hatte seine Wut komplett unterdr&uuml;ckt, hatte aber den\nTod von Jayce noch immer vor seinem inneren Auge. Viktor geriet in Panik, als er mit\nansah, wie die Pulsfeuer-R&uuml;stung von Ezreal sich aufzuladen begann. Viktor und Ezreal\nbegannen beide gleichzeitig damit, s&auml;mtliche, ihnen zur Verf&uuml;gung stehenden, Kr&auml;fte in\nein gewaltiges Feuerwerk magischer Energie zu legen.\nNach einem stundenlangen Aufeinandertreffen beider Gegner, verstummte der Krach,\nder von den magischen Explosionen ausging. Als sich schlie&szlig;lich auch der Rauch\nverzogen hatte, standen beide Krieger auf dem Vorhof. Ezreals Pulsfeuer-Kanone war\nnoch immer auf Viktor gerichtet, der mit seinem Roboterarm auf Ezreal zielte. Als Ezreal\nin die Knie ging, zeichnete sich auf Viktors Gesicht ein fieses Grinsen ab, das jedoch\nverstummte, als er merkte, dass sein K&ouml;rper begann sich zu vaporisieren. Viktor stie&szlig;\neinen letzten, hasserf&uuml;llten Schrei aus, bevor sich sein K&ouml;rper g&auml;nzlich aufl&ouml;ste. Ezreal\nerhob sich wieder und sah sich um. Caitlyn sa&szlig; neben Jayce und trauerte um ihn.\nHeimerdinger vernahm das Fehlen von weiteren Kampfger&auml;uschen, kam aus dem\nkleinen H&auml;uschen heraus und trat auf Ezreal zu. &bdquo;Du hattest Recht! Dieser Krieg betrifft\nalle.&ldquo;, erkl&auml;rte Heimerdinger, als er die Mehrzahl seiner Yordle tot auf dem Vorhof liegen\nsah, &bdquo;Ich wei&szlig; von einer weiteren Gruppe von Yordle. Gib mir nur Zeit, um zu trauern,\nund euch wird die &Uuml;berlegenheit der Yordle-Technologie im Kampf gegen Noxus zur\nVerf&uuml;gung stehen!&ldquo;. Ezreal bedankte sich und erkl&auml;rte Heimerdinger, dass er zur\ndemacianischen Armee sto&szlig;en solle, sobald er bereit sei.\nAls am n&auml;chsten Morgen die Sonne aufging, standen Ezreal und Caitlyn an dem frisch\nerrichteten Grab von Jayce und verabschiedeten sich von diesem. Heimerdinger stand\netwas abseits und gab einem Yordle-Sp&auml;her den Befehl, die andere Yordle-Gruppe zu\nverst&auml;ndigen. Dieser Yordle, der sich selbst mit &bdquo;Sp&auml;her Teemo bereit zum Dienst&ldquo;\nbemerkbar machte, nahm ein Schreiben von Heimerdinger an und machte sich auf den\nWeg. Ezreal gab Caitlyn zu verstehen, dass er seinen Auftrag in Piltover erf&uuml;llt habe und\nnun nur noch Freljord auf seiner Liste stand. Es w&auml;re unabdingbar, sich die Hilfe von\nAshe und den n&ouml;rdlichen St&auml;mmen zu sichern. Caitlyn verstand und verabschiedete sich\nvon Ezreal mit einer Umarmung. Sie wollte ihn nicht begleiten, da sie den Yordle bei\nihrem Wiederaufbau helfen wollte. Ezreal trat an Heimerdinger heran, verabschiedete\nsich von diesem und wollte ihm die Pulsfeuer-R&uuml;stung zur&uuml;ckgeben. Dieser jedoch\nerkl&auml;rte ihm, dass diese R&uuml;stung nur mit Ezreals Handschuh funktionsf&auml;hig bleiben\nw&uuml;rde und bot sie Ezreal als Geschenk an. Ezreal nahm die R&uuml;stung dankend an und\nmachte sich auf den Weg nach Freljord.\nNach einem Fu&szlig;marsch von drei Tagen erreichte Ezreal die Ausl&auml;ufer des Freljord-\nGebirges. Die Reise verlief ohne Zwischenf&auml;lle und die Vorr&auml;te, die Ezreal von den Yordle\nerhielt, waren gro&szlig;z&uuml;gig bereitgestellt und gen&uuml;gten noch f&uuml;r zwei weitere Tage in der\nWildnis. Ezreal wusste nicht, wo sich der Stamm von Ashe befand, aber er hoffte, dass\nihn jemand in der Eisw&uuml;ste finden w&uuml;rde. Ezreal wies seine R&uuml;stung an, nach jeglicher\nArt von Leben Ausschau zu halten. Mit jedem Schritt, den er tiefer in das Freljord-\nGebirge machte, wurde die Umgebung um Ezreal lebensfeindlicher. &bdquo;Wie kann denn hier\n&uuml;berhaupt etwas &uuml;berleben?&ldquo;, fragte Ezreal sich selbst, als er tiefer und tiefer in den nun\naufziehenden Schneesturm trat. Er hatte Gl&uuml;ck, denn seine R&uuml;stung hielt ihn warm und\ner brauchte sich um die vorherrschende K&auml;lte keine Gedanken zu machen. Jedoch\nmachte ihm der Wind zu schaffen und erschwerte sein Vorankommen erheblich. Nach\nguten dreizehn Stunden Fu&szlig;marsch war es mittlerweile Nacht geworden und der\nSchneesturm tat sein &Uuml;briges. Ezreal sah seine Hand nicht mehr vor Augen und egal in\nwelche Richtung er blickte, f&uuml;r ihn sah alles gleich aus.\nAls der Morgen anbrach, schlug die R&uuml;stung, die Ezreal trug, an. Immer wieder erfasste\nsie ein Lebenszeichen, das jedoch kurz darauf wieder verschwand. Ezreal hatte keine\nErkl&auml;rung f&uuml;r diese Vorkommnisse und ignorierte sie kurz darauf v&ouml;llig. Pl&ouml;tzlich teilte\nihm seine R&uuml;stung mit, dass Ezreal von menschlichen Wesen umzingelt sei. Ezreal blieb\nstehen und blickte sich um. Er erkannte durch den Schneesturm nichts. Da er seiner\nR&uuml;stung wohl Glauben schenkte, ging er in Angriffsstellung, doch als er eine Stimme mit\nden Worten &bdquo;So schreckhaft?&ldquo; vernahm und sich der Schneesturm pl&ouml;tzlich aufl&ouml;ste,\nwusste Ezreal, dass er gefunden hatte, wonach er suchte. Vor ihm stand Tryndamere, der\nMann jener Frau, die Ezreal suchte. Ezreal erkl&auml;rte Tryndamere, dass er Ashe unbedingt\nsprechen m&uuml;sse. Dieser erwiderte, dass Ashe sich mit den restlichen Stammesanf&uuml;hrern\ntraf, um &uuml;ber die Aufstellung einer Armee zur Hilfe von Demacia zu entscheiden. Ezreal\nvernahm diese Worte wie einen Segen. Endlich ein Volk Runeterras, das sich nicht nur\num seine eigene Belange k&uuml;mmerte und aktiv in den Kampf um Valoran eintreten wollte.\nTryndamere bot Ezreal an, in die Niederlassung seines Stammes zur&uuml;ckzukehren und auf\nAshe zu warten. Ezreal nahm dankend an und die beiden ehemaligen Champions der\nLiga begannen ihren Weg, begleitet von mehreren Stammeskriegern des Stammes der\nAvarosa.\nMehrere Tage waren nun bereits vergangen. Ezreal und Tryndamere warteten\nungeduldig auf die Ankunft von Ashe. Mehrmals am Tag musste Ezreal seine R&uuml;stung\nuntersuchen, die offensichtlich nicht f&uuml;r eine derartige dauerhafte K&auml;ltebelastung\nausgelegt war. Ezreal entschied sich dazu, die Pulsfeuer-R&uuml;stung vor&uuml;bergehend\nabzulegen, da er f&uuml;r sie im Moment keine Notwendigkeit sah. Als sich am siebten Tag\nnoch immer nichts tat, betrat Ezreal am fr&uuml;hen Abend das Zelt von Tryndamere. Dieser\nsa&szlig; an einem kleinen Tisch und war in Gedanken versunken. Als Ezreal sich ihm n&auml;herte,\nerkannte er, dass auf dem Tisch ein St&uuml;ck Pergament lag. Ein Brief von Ashe. Darin\nbeschrieb sie, dass die Aufstellung der Armee bereits beschlossen sei, jedoch bedarf es\nder Abstimmung &uuml;ber den Anf&uuml;hrer. Eine solche Abstimmung m&uuml;sse unbedingt\neinstimmig erfolgen, da es sich bei dieser Person um jemanden handeln muss, der\nfreiwillig seine Macht nach Ende des Krieges wieder abgeben w&uuml;rde. Die kleineren\nSt&auml;mme w&uuml;rden zustimmen, dass Ashe sie anf&uuml;hrt, und auch unter den drei gro&szlig;en\nSt&auml;mmen, von denen ja einer von Ashe angef&uuml;hrt wurde, g&auml;be es nur eine Anf&uuml;hrerin,\ndie gegen Ashe stimmte und selbst die Freljord-Armee f&uuml;hren wollte: Sejuani. Schon\nimmer wollte Sejuani Ashe bezwingen. Zwar hatte sie eingesehen, dass es notwendig\nw&auml;re, Noxus zu bek&auml;mpfen, aber sie wollte es als Anf&uuml;hrerin tun und auf keinen Fall\nunter Ashe in einer Armee dienen. Ashe schrieb in ihrem Brief weiter, dass die\nAbstimmung jeden Tag wiederholt w&uuml;rde, es aber jedes Mal zum gleichen Ergebnis\nkommen w&uuml;rde, weil Sejuani nach wie vor stur blieb. Erst jetzt bemerkte Tryndamere\nseinen Besucher. Ezreal fragte ihn, ob es eine M&ouml;glichkeit g&auml;be, zur Abstimmung zu\nreisen und bei der Versammlung zu sprechen. Tryndamere antwortete ihm, dass die\nVersammlung an einem Ort statt finde, der nicht sehr weit entfernt lag. Jedoch w&uuml;rde\nman Ezreal nicht empfangen, da es nur Mitgliedern von Freljord-St&auml;mmen gestattet\nw&auml;re, die heiligen Hallen zu betreten. Ezreal bat Tryndamere dennoch darum, ihn\ndorthinzuf&uuml;hren. Er musste es zumindest versuchen. Tryndamere lie&szlig; sich nach einer\nkurzen Debatte &uuml;berzeugen und wies einige der Stammesbewohnern an, Vorr&auml;te\nbereitzustellen.\nAm n&auml;chsten Morgen brachen Ezreal und Tryndamere auf, um die heilige Halle\naufzusuchen, jenen Ort, an dem die Versammlung statt fand. Der Weg war nicht weit,\njedoch recht schwer zu gehen. Er f&uuml;hrte nah an einem tiefen Abgrund vorbei und\nschlie&szlig;lich musste der Reisende noch eine schmale Steintreppe hinaufsteigen, die durch\nden andauernden K&auml;ltebefall glatt und rutschig geworden war. Ziemlich genau zur\nMittagsstunde erreichten die beiden Wanderer die Steintreppe. Tryndamere erkl&auml;rte,\ndass es sich um 2000 Stufen handele, die zur Auslese der Unw&uuml;rdigen diene. Des\nWeiteren w&uuml;rde Tryndamere Ezreal nicht weiter begleiten. Dies w&auml;re die Pr&uuml;fung von\nEzreal und nur wenn er alleine die heilige Halle erreichen w&uuml;rde, h&auml;tte er &uuml;berhaupt\neine Chance auf Einlass. Ezreal bedankte sich bei Tryndamere und begann seinen\nAufstieg zur heiligen Halle. Die ersten Stufen &uuml;berwand Ezreal noch mit Leichtigkeit,\ndoch bereits bei 400 Stufen begann er zu schw&auml;cheln. Die Wetterverh&auml;ltnisse\nerschwerten die Sicht und wenn Ezreal zur&uuml;ckblickte, sah er nur Stufen. Vor ihm sah es\nnicht besser aus. Doch Ezreal gab nicht auf. Obwohl ihm langsam kalt wurde und er sich\ndie W&auml;rmereaktoren seiner Pulsfeuer-R&uuml;stung zur&uuml;ckw&uuml;nschte, nahm er Stufe f&uuml;r Stufe.\nAls es langsam dunkel wurde, war Ezreal immer noch unterwegs. Er hatte aufgeh&ouml;rt die\nStufen zu z&auml;hlen, doch weit konnte es nicht mehr sein. Ezreal sch&auml;tzte auf gute 1800\nStufen, die er bereits zur&uuml;ckgelegt hatte. Gegen Mitternacht erklomm Ezreal die letzte\nStufe und vor ihm erhob sich die heilige Halle. Er hatte es geschafft. Mit letzter Kraft\nerhob sich Ezreal und wollte an das gigantische Tor klopfen, doch dieses &ouml;ffnete sich von\nalleine und Ezreal trat ein. Er stand in einer gro&szlig;en Halle, die gut beleuchtet war. Die\nW&auml;nde waren mit Wandteppichen geschm&uuml;ckt, die die Symbole aller St&auml;mme von\nFreljord zeigten. Aus den Tiefen der Halle kam Ashe auf Ezreal zu und fragte fordernd,\nwie er es vollbracht hatte, die heilige Halle zu erreichen. Aus einem anderen Teil der\nHalle erschallte eine bekannte Stimme: &bdquo;Ich habe ihn hergef&uuml;hrt und habe ihm die 2000\nStufen gezeigt.&ldquo;. Tryndamere tauchte aus den Schatten auf und bevor Ezreal fragen\nkonnte, wie er vor ihm hier ankam, antwortete Tryndamere: &bdquo;Die 2000 Stufen sind eine\nIllusion, um den Willen des Besuchers zu testen. Ich bin hinten herumgegangen. Da gibt\nes einen nicht verzauberten Eingang.&ldquo;. Ezreal schaute Tryndamere ungl&auml;ubig an und als\nAshe herzhaft zu lachen anfing, &uuml;berkam Ezreal auch ein Kichern.\nAm n&auml;chsten Morgen kam es, wie gedacht, zur erneuten Abstimmung. Die Versammlung\nschlug Ashe als Anf&uuml;hrerin f&uuml;r die Freljord-Armee vor und als Sejuani an der Reihe war,\nlehnte sie den Vorschlag wie erwartet ab. In dieses Moment trat Ezreal aus den Schatten\nhervor und sprang auf den gro&szlig;en Tisch, der in der Mitte der Halle stand. Mit lauten\nWorten begann er seine Rede: &bdquo;Ehrenwerte Versammlung von Freljord. Ehrenwerte\nStammesanf&uuml;hrer. Mein Name ist Ezreal. Lasst mich zu euch sprechen und h&ouml;rt mir\ngenau zu! Der Krieg zwischen Noxus und den restlichen L&auml;ndereien tobt bereits.\nTausende Menschen sind bereits gestorben, tausende werden folgen, ihr wollt eure\nStreitigkeiten nicht beiseitelegen und gemeinsam f&uuml;r eine Zukunft k&auml;mpfen. In der Zeit,\nin der ihr &uuml;ber den Anf&uuml;hrer eurer Armee debattiert, wird Demacia bereits belagert. Ich\nwei&szlig; nicht, ob Demacia &uuml;berhaupt noch steht oder ob es bereits gefallen ist. Was der\nUntergang Demacias bedeuten w&uuml;rde, brauche ich den gesch&auml;tzten Kriegsherren nicht\nzu erkl&auml;ren. Neben Noxus ist Demacia die milit&auml;risch st&auml;rkste Macht in Valoran, wenn\nnicht sogar in ganz Runeterra! Begrabt eure Streitigkeiten ein f&uuml;r alle Mal und macht\neuch hier und jetzt auf den Weg Richtung S&uuml;den. Demacia braucht euch. Weder morgen,\nnoch in einem Monat. Es braucht euch jetzt!&ldquo;. Als er diese Worte gesprochen hatte,\nerhoben sich drei Personen und traten zu Ezreal auf den Tisch. Der erste war\nTryndamere, der sein gewaltiges Schwert mit einem einzigen m&auml;chtigen Schlag in den\ngro&szlig;en Steintisch versenkte. Er schlug Ezreal als Anf&uuml;hrer der Armee vor und bot ihm f&uuml;r\ndieses Unterfangen seine Treue an. Danach trat Ashe an Ezreal heran und legte ihre\nHand auf seine Schulter. Sie stimmte Tryndamere zu und wartete auf die Entscheidung\nder anderen Stammesanf&uuml;hrer. Diese willigten einstimmig ein und schlie&szlig;lich trat die\ndritte Person an Ezreal heran. Es handelte sich um Sejuani. Sie sprach zu Ezreal: &bdquo;Du bist\nhier nicht willkommen, du st&ouml;rst die Versammlung und du beleidigst die Anf&uuml;hrer von\nFreljord. Ich habe dir nur eins zu sagen: Entz&uuml;ndet das gro&szlig;e Feuer! Ab heute befindet\nsich Freljord im Krieg!&ldquo;. Mit einem L&auml;cheln im Gesicht schaute sie zu Ezreal, w&auml;hrend auf\nder Spitze der heiligen Halle ein Leuchtfeuer ungeahnten Ausma&szlig;es entz&uuml;ndet wurde.\nJeder Mann und jede Frau in Freljord wusste, was dies zu bedeuten hatte. Jeder, der\nf&auml;hig war, eine Waffe zu halten, ergriff eben jene Waffe und machte sich auf den Weg\nRichtung S&uuml;den, Richtung Demacia. An der Spitze lief Ezreal und jeder, egal von welchem\nStamm er stammte, folgte ihm. Die Mitglieder von Ashes Stamm hatten ihm seine\nPulsfeuer-R&uuml;stung gebracht. Stolz hatte er sie wieder angelegt und f&uuml;hrte die\ngewaltigste Armee nach Demacia, die Freljord jemals aufgestellt hatte. Demacia w&uuml;rde\nnicht fallen. Nicht so! Als die Armee die Ausl&auml;ufer des Freljord-Gebirges erreichten, stie&szlig;\njeder einen gewaltigen Kriegsschrei aus, der hinab in die T&auml;ler schallte.\n\n**KAPITEL 3: DAS LICHT ERSTRAHLT IN NEUEM GLANZ**\nSeit der Rettung von Luxanna waren bereits einige Tage vergangen. Mira sch&uuml;ttelte ihren\nKopf, um ihre Konzentration wieder zu erlangen. Vor ihr lag Demacia und was sie sah,\nerf&uuml;llte ihr Herz mit Trauer und Schmerz. Die einst so prachtvolle Stadt war schwarz. Die\nKriegsmaschinerie von Noxus hatte ganze Arbeit geleistet. Vor den Toren Demacias\nerhob sich Cho&acute;Gath und lie&szlig; seine Leerenbrut immer wieder an die Mauern branden,\nw&auml;hrend Singed den Belagerungswaffen neue Ziele zuwies und diese mit giftigen\nChemikalien lud. Mira griff zu ihrem Schwert, doch einer ihrer Begleiter hielt sie vor\neiner wahrscheinlichen Dummheit ab. Als sich Mira umdrehte, sah sie in das Gesicht von\nJarvan. Mira erinnerte sich sofort an ihr erstes Treffen mit dem demacianischen Prinz.\n\n_&bull;Vier Tage vorher_\n\n&bdquo;So, unser erstes Ziel h&auml;tten wir erreicht!&ldquo;, stimmte Garen lautstark an. Er hatte Recht.\nNach dem Plan, den Mira aufgestellt hatte, war das erste Ziel, n&auml;mlich die Rettung von\nLux, gegl&uuml;ckt. Doch nun stand ein weitaus schwierigeres Unterfangen auf dem Plan:\nJarvan. Bei der Rettung von Luxanna hatte Mira den Vorteil, dass Garen einen\nAnhaltspunkt hatte, doch Jarvan war wie immer von der Bildfl&auml;che verschwunden. Das\neinzige, was Mira von Jarvan wusste, war die Tatsache, dass er erst vor kurzem ihr\nHeimatdorf durchquert hatte. Deshalb folgten Mira, Riven, Lux und Garen dem Weg, den\nJarvan wahrscheinlich genommen hatte. Sie begannen ihre Reise an der Stelle, an der\nMiras Dorf gestanden hatte. Wieder &uuml;berkam Trauer und Wut die junge Kriegerin. Mira\nerinnerte sich an die Himmelsrichtung, in der Jarvan und sein Gefolge unterwegs waren.\nDie Suche sollte sich letztendlich doch einfacher herausstellen. als anf&auml;nglich gedacht.\nDie Spuren, die Jarvan hinterlie&szlig;, waren gut zu sehen, weil es schon eine l&auml;ngere Zeit\nnicht mehr geregnet hatte. Au&szlig;erdem schien Jarvan den &Auml;rger f&ouml;rmlich anzuziehen,\ndenn immer wieder waren Kampfspuren auf dem Weg zu erkennen. Immer wieder\nfanden sich tote Soldaten. Sowohl Noxianer als auch Demacianer pflasterten Jarvans\nWeg. Demnach wurde der Begleittrupp des Prinzen immer kleiner.\nNach einem Tag intensiver Verfolgung wurden die Spuren immer frischer. Die Gruppe um\nMira wusste, dass sie sich Jarvan n&auml;herten. So wie die Spuren aussahen, hatte Jarvan\nkaum noch Begleiter. Als Mira einen etwas h&ouml;heren H&uuml;gel erklommen hatte, erblickte sie\nin dem darauffolgenden Tal den gesuchten Prinzen. Es sah nicht gut f&uuml;r ihn aus. Er stand\nR&uuml;cken an R&uuml;cken mit seiner letzten Begleiterin, umgeben von toten Demacianern und\numzingelt von einer gro&szlig;en noxischen Armee. Garen erkannte die Armee. Es war die\ngleiche, die Draven und Darius angef&uuml;hrt hatten, denn Garen erkannte den &auml;ngstlichen\nF&auml;hnrich, den er bei der Rettung von Luxanna umgesto&szlig;en hatte.\nDie Noxianer bildeten einen undurchdringbaren Ring um die beiden Freunde. Jarvan\nsprach zur seiner Begleiterin: &bdquo;Es war mir eine Ehre, an deiner Seite gek&auml;mpft zu haben,\nShyvana!&ldquo;. Shyvana erwiderte diese Worte mit einem Kopfnicken. In diesem Moment\nst&uuml;rmten die ersten noxischen Soldaten auf die beiden Helden ein, die mit aller Kraft\nversuchten, sich zu wehren. Es gelang ihnen einigerma&szlig;en. Auch deshalb, weil sich die\nBegleiterin des Prinzen inmitten des Kampfes in einen Drachen verwandelte und so\nganze Reihen des Gegner niederbrannte. Doch die Anzahl der Angreifer schien nicht\ngeringer zu werden. Als die Ersch&ouml;pfung der beiden Demacianer gr&ouml;&szlig;er wurde, lichteten\nsich die Reihen der noxischen Soldaten. Ein Gesch&ouml;pf, halb Mensch halb Schlange,\nerschien und lie&szlig; mit einem Blick Jarvan zu Stein erstarren. Mira erkannte die Gefahr, in\nder sich Shyvana nun befand, stand sie nicht nur einem noxischen General, sondern\nauch einer kompletten Armee gegen&uuml;ber. Genau in dem Moment, in dem Mira\nlossprinten wollte, tauchten vor Miras Gruppe zwei Monster auf. Bei einem handelte es\nsich um einen Werwolf, der jedoch mit Symbolen von Noxus verzieht war. Bei dem\nanderen handelte es sich definitiv um eine Kreatur der Leere. Eine baldige Hilfe f&uuml;r\nShyvana war nicht in Sicht. Die beiden Monster waren aus der Liga bekannt: Warwick\nund Kog&acute;Maw. Diese verwicktelten die Gruppe um Mira in einen Kampf. In dieser Zeit\ngeriet Shyvana immer mehr in Bedr&auml;ngnis. Obwohl sie sich in ihrer Wildheit effektiv\nverteidigen konnte, gelang es immer wieder einigen Soldaten, den Drachen mit ihren\nSpeeren zu verletzten. Und auch die Bestie, die Jarvan in Stein verwandelte, setzte\nShyvana schwer zu. Ihre Giftattacken lie&szlig;en den Drachen immer schw&auml;cher werden und\nschlie&szlig;lich fiel Shyvanna zu Boden und verwandelte sich in ihre menschliche Form\nzur&uuml;ck. Mira erkannte die bedrohliche Situation aus dem Augenwinkel und blickte von\ndem H&uuml;gel hinab. Sie sah, wie das Schlangenwesen an Shyvana herantrat und sie mit\nHilfe eines Speers erstach. Wieder einmal hatte der Widerstand ein Opfer gefordert.\nDoch Mira hatte keine Zeit, dies zu verarbeiten. Obwohl jeweils zwei aus Miras Gruppe\ngegen einen der beiden Monster k&auml;mpfte, lief es f&uuml;r Mira und Garen nicht gut, denn\nWarwick setzte den beiden stark zu. Er nutzte den Moment, in dem Mira abgelenkt war,\num sich voll und ganz auf Garen zu konzentrieren. Eine gewaltige Abfolge von\nKrallenhieben schlug auf den demacianischen K&auml;mpfer ein. Seine R&uuml;stung hielt diesem\nTrommelfeuer nicht lange stand und nach wenigen Schl&auml;gen h&auml;mmerte Warwick auf\nGarens Fleisch ein. Garen selbst wusste nicht wie ihm geschah. Er hatte keine Chance auf\nGegenwehr und innerhalb von wenigen Sekunden war Garen von Klauenspuren\n&uuml;bers&auml;ht und sank zu Boden. Als Mira das Fallen ihres Kameraden h&ouml;rte, blickte sie\nwieder zur&uuml;ck. Garen lag auf dem Boden und blutete sehr stark. Getrieben von ihrer\nWut und ihrer Trauer, trat Mira dem Monster Warwick nun alleine gegen&uuml;ber. Mira\nwusste um Warwicks Schnelligkeit und um die ihre. Dies wollte sie zu ihrem Vorteil\nausspielen. Als Warwick eine seiner Pranken hob, um Mira einen Hieb zu versetzen,\nergriff diese ihre Gelegenheit und setzte ihre komplette Kraft in einen Hieb, der direkt\nauf Warwicks Handgelenk zielte. Der Schnitt ging tief in das Fleisch von Warwick, konnte\ndie Kralle jedoch nicht abtrennen. Miras Schwert steckte in Warwicks Knochen und egal\nwie hart Mira daran zog, das Schwert l&ouml;ste sich nicht mehr. Warwick hob Mira an ihren\nHaaren an und schleuderte sie weg. Anschlie&szlig;end stie&szlig; er ein lautes Wolfsheulen aus,\ndenn er wusste, dass ein Herausziehen des Schwertes unweigerlich zur Verblutung\nf&uuml;hren w&uuml;rde, da Mira wichtige Adern durchtrennt hatte. Warwick sah seinem Schicksal\nmutig entgegen und zog das Schwert mit einem gewaltigen Ruck heraus und warf es zu\nBoden, bevor er auf allen Vieren in den Wald rannte, um sich einen Platz zum Sterben zu\nsuchen.\nKog&acute;Maw hatte jetzt ein echtes Problem, denn obwohl er Riven und Lux besch&auml;ftigen\nkonnte, war er nun stark in der Unterzahl, denn Mira hatte ihr Schwert bereits wieder\naufgehoben und hatte sich dem Kampf gegen das Leerenmonster angeschlossen. Die\ndrei Heldinnen dr&auml;ngten Kog&acute;Maw gegen einen Baum und als dieser seine ausweglose\nSituation erkannte, ergriff er seine letzte Chance. Er spuckte eine giftgr&uuml;ne Kugel auf\nseine Gegnerinnen, die ihrerseits ihre Gesichter abdeckten. In diesem Moment der\nUnachtsamkeit rannte Kog&acute;Maw davon. Luxanna verhinderte sein Entkommen, indem sie\nihn mit Hilfe ihrer Lichtmagie festhielt. F&uuml;r Kog&acute;Maw war dieses Gef&uuml;hl ungewohnt. Als\nder Effekt abklang, drehte sich Kog&acute;Maw wieder seinen Gegnern zu, doch was er sah,\nlie&szlig; ihn seinen Untergang vorherahnen. Mira stand einige Meter weit weg von ihm, in\nihren Augen schimmerte noch immer ein blauer Schein. Doch etwas &auml;ngstigte ihn mehr.\nEin gewaltiger, blauer Energieschnitt raste auf ihn zu und noch bevor er realisieren\nkonnte, dass das junge M&auml;dchen diesen gewaltigen Angriff ausgef&uuml;hrt hatte,\ndurchschnitt ihn dieser magischer Schwerthieb in der Mitte. Kog&acute;Maws Leben war\nausgel&ouml;scht und beide H&auml;lften seines K&ouml;rpers fielen zu Boden. Mira wusste um ihren\nSieg und steckte die noch rauchende Klinge zur&uuml;ck in ihre Schwertscheide.\nNun stand die Rettung Jarvans auf dem Plan. Die Soldaten von Noxus luden den\nversteinerten Prinz auf einen Karren, als Riven und Mira von dem H&uuml;gel st&uuml;rmten.\nLuxanna blieb zur&uuml;ck, um f&uuml;r ihren, im Sterben liegenden Bruder zu sorgen. Sofort\nbildeten die noxischen K&auml;mpfer eine Verteidigungslinie, doch die meisten der Soldaten\nkannten Mira und Riven von dem Kampf gegen ihre fr&uuml;heren F&uuml;hrer, Draven und Darius.\nRiven erreichte den Trupp als erste und begann sofort damit, die Reihen der\n&uuml;berraschten Noxianer zu zersprengen. Immer wieder f&uuml;hrte sie gef&auml;hrliche Angriffe mit\nihrer zerbrochenen Klinge aus. Mira unterdes eilte zu Jarvan, der als Statue immer noch\nauf dem noxischen Wagen stand, auf dem er zur Schau gestellt werden sollte. Gerade als\nsie versuchte, auf den Wagen zu klettern, zog etwas die junge Heldin zur&uuml;ck. Mira blickte\num sich und entdeckte das Monster, dass Jarvan verwandelt hatte. Erst jetzt erkannte\nMira sie. Sie hatte bereits Geschichten &uuml;ber die noxische Schlangenfrau geh&ouml;rt und erst\njetzt erinnerte sich Mira an den Namen dieses Gesch&ouml;pfes: Cassiopeia. Mira war noch\nimmer von dem Kampf gegen Warwick und Kog&acute;Maw ersch&ouml;pft. Jetzt noch gegen einen\nweiteren Gegner zu k&auml;mpfen, d&uuml;rfte sie jegliche Kraftreserven kosten. Dennoch bestand\nkeine Aussicht auf baldige Hilfe. Also musste sich Mira in einen weiteren Kampf st&uuml;rtzen.\nSchnell und gewandt zog sie ihre Klinge. Mira malte sich einen Vorteil aus, da sie ein\nSchwert besa&szlig; und Cassiopeia unbewaffnet war. Doch ihre Vorstellungen zerplatzen, als\nsie merkte, dass Cassiopeia ihr Schwert mit blo&szlig;en Klauen stoppte. Immer wieder\nversuchte Mira, mit ihrem Schwert einen Treffer zu landen, doch es war f&uuml;r Cassiopeia\nein Leichtes, die Hiebe der erm&uuml;deten K&auml;mpferin abzuwehren. Mira versuchte es bereits\nmehrere Minuten lang, bevor Cassiopeia in einem Anflug von Langeweile zu einem\nGegenangriff ausholte und Mira mit einem schweren Angriff vergiftete. Mira fiel zu\nBoden und zuckte unter Schmerzen immer wieder zusammen. Cassiopeia hatte wohl\ngewonnen und sie lie&szlig; Mira zum Sterben zur&uuml;ck. Doch war f&uuml;r sie der Sieg noch nicht\nvollkommen. Noch immer m&auml;hte Riven durch die Reihen der noxischen Soldaten. Mit\nunmenschlicher Geschwindigkeit schl&auml;ngelte sich Cassiopeia in Richtung der ehemaligen\nnoxischen Elite-K&auml;mpferin. Riven erkannte die Gefahr gerade noch rechtzeitig und war\ngerade noch in der Lage, den &Uuml;berraschungsangriff abzuwehren. Gerade als der Kampf\nder beiden Frauen noxischen Blutes beginnen sollte, vernahmen beide eine\nungew&ouml;hnliche Stimme, die ihnen jedoch doch recht bekannt erschien. Beide drehten\nsich in die Richtung, aus der die Stimme erschallte, und nun zeigte das unscheinbare\nBauernm&auml;dchen, das vor wenigen Sekunden noch sterbend auf dem Boden lag, ihr\nwahres Gesicht. Der Grund, warum sie sich &uuml;bermenschlich schnell bewegte und warum\nsie Luft zerschneiden konnte, war schlicht und einfach der, dass dieses M&auml;dchen eben\ndoch etwas G&ouml;ttliches hatte. Mira hob vom Boden ab, getragen von ihren neuen und\nw&uuml;ndersch&ouml;nen, blau schimmernden Fl&uuml;geln. Ihre langen, blauen Haare waren ihr ins\nGesicht gefallen und dennoch war der starke, blaue Schimmer in ihren Augen zu\nerkennen. Als Mira ihr Schwert zog, war von der Klinge nichts mehr zu sehen. Es schien,\nals w&uuml;rde dieses Engelsm&auml;dchen mit ihrem Griff die pure Energie f&uuml;hren. Mit\nschallender Stimme stie&szlig; Mira einige wenige S&auml;tze hervor: &quot;Ich bin der Engel, geschaffen\nzum Schutz der Armen und Hilflosen, gebunden an das M&auml;dchen. Die Runenenergie\ndurchstr&ouml;mt mich. Mein... Name... ist... Mira!&quot;. Mit diesen Worten erkannte Cassiopeia\nihren, nun unausweichlichen Untergang. Obwohl sie um ihr Leben floh, hatte Cassiopeia\nkeine Chance. Mit einem gewaltigen Ruck blieb die ver&auml;ngstigteTochter des Du Couteau-\nGeschlechtes stehen. Jegliche Bewegung war unm&ouml;glich und auch nicht mehr von\nN&ouml;ten, denn vor ihr erschien ihre Richterin und Henkerin. Mit dr&ouml;hnender und\nherzzerrei&szlig;ender Stimme sprach der Engel: &quot;Tochter von Noxus. Du hast das\nGleichgewicht dieser Welt erheblich gest&ouml;rt. Trete nun deine einzig wahre Strafe an und\nverlasse diese Welt!&quot;. Ohne dass sie es wollte, antwortete Cassiopeias Stimme mit\neinem &quot;Ja, meine Herrin&quot; und mit diesen Worten l&ouml;ste sich der K&ouml;rper der Schlangenfrau\nin einen Schwarm aus leuchtenden Schmetterlingen auf und flog davon. Der Engel\nlandete und Miras Fl&uuml;gel l&ouml;sten sich auf. Ihr Schwert nahm wieder seine urspr&uuml;ngliche\nForm an und der Schimmer in Miras Augen verschwand. Mira war unverletzt. Jegliche\nKampfspur war von dem jungen K&ouml;rper verschwunden und Mira streifte sich ihre\nStr&auml;nen aus ihrem makellosen Gesicht.\nMit dem Tod von Cassiopeia - wenn man es denn Tod nennen wollte - kehrte auch der\ndemacianische Prinz zur&uuml;ck unter die Lebenden. Durch eigene Kraft konnte er seinen\nSturz, hervorgerufen durch das pl&ouml;tzliche Zur&uuml;ckverwandeln, gerade noch abfangen. Er\nrichtete sich zur vollen Gr&ouml;&szlig;e auf, hob seine Waffe und blickte in die Umgebung. Doch\nwas er sah, ersch&uuml;tterte ihn. Ein gewaltiges noxisches Heer lag um den Karren, auf dem\ner gerade noch stand. In mitten dieser, vernichtend geschlagenen Truppen, erkannte er\nden gefallenen K&ouml;rper seiner Gef&auml;hrtin Shyvana. Als sein Blick, getr&uuml;bt von gewaltiger\nTrauer, in ferne Gebiete abschweifte, erkannte er eine weitere Person. Luxanna sa&szlig;\ntrauernd neben ihrem k&uuml;rzlich verstorbenen Bruder. Jarvan konnte es nicht fassen. Sein\nWaffenbruder, mit dem er unz&auml;hlige Schlachten geschlagen hatte und mit dem er\naufgewachsen war, lag tot auf dem H&uuml;gel unweit des Schlachtfeldes. Jarvan verlie&szlig; die\nHoffnung. So viel Trauer konnte der Prinz nicht aufnehmen. Doch dann sah er das junge\nM&auml;dchen, das neben Riven stand. Wie konnte das m&ouml;glich sein. Diese, noch so blutjunge\nKriegerin stand, unversehrt von den K&auml;mpfen, und besprach, obgleich der Vernichtung\nund des Todes um ihr herum, das weitere Vorgehen mit Riven. Mira konnte und wollte\nes nicht zulassen, dass weitere Unschuldige sterben mussten. Sie w&uuml;rde diesen Krieg\nbeenden. Mit allen, ihr zu Verf&uuml;gung stehenden Mitteln, w&uuml;rde sie die Leere aufhalten\nund wieder Frieden nach Runeterra bringen. Diesen Entschluss hatte sie gefasst.\nSp&auml;ter am Tag war wieder Ordnung eingekehrt. Die verbliebenen Champions hatten\nzusammen mit Mira die Toten in einem gro&szlig;en Grab zusammen getragen. Ein gro&szlig;es\nKreuz, gezimmert aus den Brettern des Wagens, mit dem Jarvan nach Noxus gebracht\nwerden sollte, makierte die Stelle. Weiter oben auf dem H&uuml;gel, hatten die Freunde zwei\nH&uuml;gelgr&auml;ber errichtert. Eines f&uuml;r Shyvana, die im Kampf um das Leben des\ndemacianischen Prinzen gefallen war, und somit das Geschlecht der halbbl&uuml;tigen\nDrachenmenschen schlie&szlig;lich von Valoran verschwand. Das andere Grab beherbergte\nGaren. Obgleich er hunderte Schlachten ohne Verletzung geschlagen hatte, war es ein\neinzelner Gegner, der ihn sein Leben kostete. Ein noxischer Champion hatte ihn\nbezwungen. Jeden anderen Tod w&auml;re er stolz gestorben, doch die Tatsache, dass ein\nKrieger des einzigen Erzfeindes ihn bezwungen hatte, lie&szlig; ihn vermutlich in Schmach\nsterben. Mira trat an Jarvan heran, um ihren niedergeschlagenen Prinzen aufzumuntern.\nSie trat vor hin, kniete nieder und sprach: &quot;Mein Prinz, wieso beansprucht Noxus, was\nuns geh&ouml;rt? Ist es nicht an der Zeit, dass sich Demacia erhebt und wieder Frieden\neinkehrt?&quot;. Obwohl Mira die Kleinste innerhalb dieser Truppe war, so musste doch jeder\nzu ihr aufsehen, denn sie hatte Gro&szlig;es geleistet und sie w&uuml;rde noch Gro&szlig;es leisten. Als\nJarvan den Mut in Miras Augen erkannte, fasste er selbst einen Entschluss. Energisch rief\ner die verbliebenen Champions zusammen. Er erkl&auml;rte Lux, Riven und Mira, dass es Zeit\nw&auml;re, nach Hause zur&uuml;ckzukehren und die Ketten der Unterdr&uuml;ckung abzuwerfen. Vollen\nMutes marschierte der Trupp Richtung Demacia.\n\n&bull;Zur&uuml;ck zur Gegenwart\n\nJarvan erkl&auml;rte Mira und den beiden anderen Champions, wie er vor hatte, in die Stadt\nzu kommen. Es g&auml;be auf einem verlassenen Friedhof, weit au&szlig;erhalb der Stadt, einen\ngeheimen unterirdischen Tunnel. Noxus k&ouml;nne diesen Tunnel nicht finden und so w&auml;re\nes ein Leichtes, den Belagerungsring zu umgehen. Mira erkl&auml;rte sich sofort\neinverstanden, hatte sie jedoch immer ein bisschen Angst vor Friedh&ouml;fen.\nWenige Minuten sp&auml;ter kam der kleine Trupp auf dem Friedhof an. Tats&auml;chlich war keine\nSpur von noxischen Truppen zu sehen. Gerade als die Gruppe um Mira den Friedhof\nbetreten wollte, entdeckt Mira einen noxischen Sp&auml;her am Horizont. Sofort sprangen\nMira und die anderen hinter einigen B&uuml;schen in Deckung. Der noxische Sp&auml;her betrat\nden Friedhof und rief ein geheimes Passwort. Kurz darauf tauchten einige noxische\nAttent&auml;ter auf, die sich in ihrer Unsichtbarkeit versteckt hatten, um auf einen\nahnungslosen, demacianischen Soldaten zu warten. Der Sp&auml;her erkl&auml;rte den Assassinen,\ndass es gelungen sei, das Haupttor von Demacia einzurei&szlig;en und dass sie sofort\nmitkommen sollten. Einer der Attent&auml;ter nickte und pfeifte kurz darauf eine seltsame\nMelodie in den Wind. Daraufhin erschien ein Monster der Leere. Es hatte einen\nseltsamen K&ouml;rperbau. Seine Haut schien der eines Insektes &auml;hnlich, wuchsen ihm doch\nzwei Insektenfl&uuml;gel aus dem R&uuml;cken. Jedoch lief dieses Monster auf zwei Beinen.\nW&uuml;tend rammte es die beiden Klingen, die aus dessen Armen wuchsen, in den Boden\nund fragte den noxischen Assassinen, was jetzt schon wieder los sei. Der Noxianer befahl\ndem Monster, mitzukommen. Zornig trennte das Leerenmonster den Kopf des\nAttent&auml;ters ab. &quot;K&uuml;mmerlicher Mensch! Du wirst es dir nicht nochmal erlauben, mir\nBefehle zu erteilen. Doch wenn Cho&acute;Gath meint, er m&uuml;sse mich zu ihm rufen, werde ich\nmitkommen.&quot;, br&uuml;llte das Monster auf die Leiche ein, bevor er sich mit rasender\nGeschwindigkeit der Stadt Demacia n&auml;herte. Nach dem &uuml;berraschenden Auftritt des\nLeerenmonsters machten sich auch die noxischen Soldaten auf den Weg, um der\nSchlacht beizuwohnen. Mira hatte das Schauspiel aufmerksam beobachtet und sie\nkonnte nicht glauben, was da gerade passiert war. Ihre Aufmerksamkeit wurde durch\neinen lauten Schrei von Lux unterbrochen. Als sich Mira, Jarvan und Riven umdrehten,\nerkannten sie Lux, deren Bauch von einer rie&szlig;igen Klinge durchdrungen war. Lux wurde\nangehoben und wie ein Stein weggeworfen. Nun sahen alle den Angreifer. Es war das\nLeerenmonster, dass sie gerade eben beobachtet hatten. &quot;Habt ihr tats&auml;chlich geglaubt,\nich h&auml;tte euch nicht bemerkt? Ich verfolge euch nun schon seit zwei Tagen. Nun werden\neure k&uuml;mmerlichen Versuche, unsere Invasion in eure Welt aufzuhalten, zerschlagen\nwerden.&quot;, schrie das Monster, bevor es zum Angriff auf Jarvan ansetzte. Dieser konnte\nden gewaltigen Sprungangriff des Monsters abwehren und es zur&uuml;ckwerfen. Mira rannte\nunterdessen zu Lux, um Hilfe zu leisten, doch das Monster hatte ganze Arbeit geleistet.\nF&uuml;r Luxanna kam jede Hilfe zu sp&auml;t. Als sich Mira umdrehte, um nun auch in den Kampf\neinzugreifen, erschrak sie. Das gewaltige Monster war mitten in einem Angriff auf sie.\nKurz bevor eine der Sichelklingen in Miras Fleisch fuhr, wurde der Angriff unterbrochen.\nEine Schlinge hatte sich um die F&uuml;&szlig;e des Angreifers gewickelt und ihn zu Boden\ngeworfen. Sowohl die Gruppe um Mira, als auch das Monster blickten sich um. Miras\nRetter stand wenige Meter entfernt. Es war ein wei&szlig;er L&ouml;we, der jedoch auch auf zwei\nBeinen lief und mit Dolch und Handklingen bewaffnet war. Das Leerenmonster schnitt\ndie Bola um seine F&uuml;&szlig;e durch und stand auf. Der wei&szlig;e L&ouml;we schrie das Leerenmonster\nan: &quot;Kha&acute;Zix! Endlich habe ich dich eingeholt. Ich bin bereit, mir eine Troph&auml;e zu\nverdienen!&quot;. Kha&acute;Zix erwiderte den Schlachtruf lediglich mit dem Namen des L&ouml;wen:\n&bdquo;Rengar!&ldquo;. Als die beiden Konkurrenten auf einander zust&uuml;rmten, riefen beide die Worte:\n&bdquo;Die Jagd hat begonnen!&quot; heraus. Als die Waffen der beiden J&auml;ger aufeinandertrafen,\nergriff Jarvan die Chance und zerrte Riven und Mira in den Geheimgang auf dem\nFriedhof. Jarvan trieb die beiden Frauen im Inneren der alten Gruft immer weiter an, bis\nRiven um eine kleine Pause bat. Auf die Frage von Jarvan, seit wann noxische Soldaten\neine Pause brauchten, selbst wenn es Fahnenfl&uuml;chtige seien, konterte Riven mit den\nWorten: &quot;Du selbstverliebter Trottel! Nicht ich brauche eine Pause, sondern Mira. Sie\nund Lux verstanden sich sehr gut. Gib ihr einen Moment zum Trauern!&quot;. Jarvan erkannte,\nwie unangebracht seine Worte waren, und stimmte der Pause zu. Riven nahm Mira in\nden Arm, die ihren Tr&auml;nen freien Lauf lie&szlig;. Jarvan stand einige Meter entfernt und\nkontrollierte den richtigen Sitz seiner R&uuml;stung. Mira blickte Riven mit ihrem Tr&auml;nen\n&uuml;berst&ouml;mten Gesicht an und schluchzte: &quot;Ich will nicht mehr. Alle, die mit mir unterwegs\nsind, sterben. Es sind schon zu viele!&quot;. Als Jarvan diese Worte h&ouml;rte, kam er auf Mira zu,\nzerrte sie aus den Armen von Riven und gab ihr eine schallende Ohrfeige, sodass Mira\ndas Gleichgewicht verlor und auf den bemoosten Boden fiel. Jarvan schrie die verwirrte\nMira an: &quot;Du dummes M&auml;dchen! Geh doch zur&uuml;ck, wenn du nicht mehr kannst. Ich\nwerde jedoch nicht zulassen, dass der Tod meiner Freunde umsonst war oder dass noch\nmehr unschuldige Menschen sterben m&uuml;ssen!&quot;. Mit diesen Worten lief Jarvan\nunbeeindruckt weiter. Riven half Mira hoch und versuchte, sie zu tr&ouml;sten. Mira schluckte\nund erkl&auml;rte Riven, dass er ja Recht habe. Mit neuem Mut folgten die beiden Frauen\ndem demacianischen Prinzen.\nNach zwei Stunden, die Mira wie eine Ewigkeit vorkamen, erreichten sie das Ende des\nGeheimganges. Jarvan erkl&auml;rte den beiden Frauen, dass sie sich hinter einem Gem&auml;lde\nim Thronsaal seines Vaters befanden. Bevor Jarvan das Gem&auml;lde entfernen konnte, um\nso den Ausgang zu &ouml;ffnen, h&ouml;rte er eine bekannte Stimme. Es war die Stimme der\nT&auml;uscherin, einer Championesse, &uuml;ber die nicht viel bekannt war. Sie geh&ouml;rte zu Noxus\nund obwohl LeBlanc nie offen f&uuml;r das noxische Heer gek&auml;mpft hatte, stand sie nun vor\ndem demacianischen K&ouml;nig, Jarvans Vater. Nach einer kurzen Diskussion verlie&szlig; LeBlanc\nden Thronsaal mit dem Befehl, den K&ouml;nig hinrichten zu lassen. Jarvan stie&szlig; das Bild weg,\ndoch konnte er nur noch mit ansehen, wie die gef&auml;hrlichste, noxische Kampfmaschine\nseines Vaters Kopf abtrennte. Als Sion den Sohn seines Opfers erblickte, sah er die\nChance, die Blutlinie der Lichtschilds zu beenden. Ohne Vorwarnung griff Sion den\n&uuml;berraschten Jarvan an, der immer noch wie angewurzelt im Thronsaal stand. Der Tod\nseines Vater kam f&uuml;r ihn zu pl&ouml;tzlich. Sion h&auml;tte ihn get&ouml;tet, h&auml;tte Riven den\nverheerenden Angriff nicht mit ihrer Exilklinge abgewehrt. Jarvan hatte den Angriff nicht\nbemerkt. Sein Blick war leer und kalt. Ohne auf die lauernde Gefahr zu achten, ging\nJarvan zur Leiche seines Vaters, kniete nieder und fing in tiefster Trauer zu weinen an.\nMira und Riven waren in dem Kampf gegen die T&ouml;tungsmaschine Sion auf sich alleine\ngestellt. Der Kampf schien recht ausgeglichen zu sein. Sion schaffte es nicht, einen\nt&ouml;tlichen Angriff zu landen, da die beiden Frauen aufeinander aufpassten und sich im\nNotfall aus der Angriffslinie zogen. Auf dem H&ouml;hepunkt des Kampfes wich die\nAufmerksamkeit von Sion, Riven und Mira auf Jarvan, der einen lauten Schrei aufstie&szlig;\nund nun voll Zorn und Wut in den Kampf einschritt. Ohne dem &uuml;berraschten Sion eine\nChance zu geben, durchbohrte der wutentbrannte Jarvan den Rumpf des untoten\nChampions. Eine solche Verletzung konnte Sion jedoch nicht aufhalten, denn er wurde\nvon noxischen Nekromanten ins Leben zur&uuml;ckgerufen. Sion zog die Lanze des neuen\ndemacianischen K&ouml;nigs nach vorne aus seinem Bauch und warf sie weg. In einer\nruckartigen Bewegung schlug Sion den wehrlosen Jarvan quer durch den Thronsaal und\nschleuderte ihn so auf den Thron seines Vater, sodass das einstige Symbol der\ndemacianischen Herrschaft, gefertig aus einem massivem Goldblock, in tausend Teile\nzerbrach. Mira erkannte die Gefahr und konzentrierte sich, um ihre Kr&auml;fte erneut zu\nwecken. Der hellblaue Schimmer in ihren Augen kehrte zur&uuml;ck und auch ihr Schwert\nnahm neue Kraft in sich auf. Doch der darauffolgende Versuch, Sions Leben mit einem\neinzigen, gezielten Luftschnitt zu beenden, scheiterte. Sion wehrte die Attacke mit\nseinem magischen Schild ab, das selbst Mira nicht durchdringen konnte. Mira war die\nHilflosigkeit und die Angst ins Gesicht geschrieben. Als n&auml;chstes versuchte Riven ihr\nGl&uuml;ck. Sie lud ihre Exilklinge auf und versuchte Sion ebenfalls mit einem Windschnitt zu\ntreffen, doch kurz bevor Riven ihren Angriff durchf&uuml;hren konnte, stoppte sie\nirgendetwas. Riven wusste nicht, was geschehen war, doch Mira sah, dass Sion f&uuml;r die\nBewegungsunf&auml;higkeit ihrer Freundin verantwortlich war. Mira blickte zu Jarvan, der sich\nscheinbar nicht so schnell von dem gewaltigen Treffer erholte. Die Situation erschien\nausweglos, konnte Sion jeden Angriff der beiden K&auml;mpferinnen abwehren. Riven\nerkannte eine M&ouml;glichkeit, den untoten Champion zu besiegen. Riven sprang &uuml;ber den\nKopf von Sion, landete hinter ihm und lenkte ihn so ab. Mira erkannte ihre Chance und\nkonzentrierte all ihre Kraft in ihrer Klinge. Kurz bevor Mira bereit war, startete Riven\neinen erneuten Windschnitt gegen ihren Widersacher, der diesen sofort abwehrte. Nach\ndem Sions Schild abgeklungen war, kam Miras gro&szlig;e Stunde. Mit all ihrer Kraft schnitt sie\nmit ihrem Schwert zwei Mal in die Luft und ein x-f&ouml;rmiger Luftschnitt raste auf den\nR&uuml;cken von Sion zu. Der untote Champion sah die Gefahr nicht kommen und sein K&ouml;rper\nwurde in vier Teile zerschnitten. Doch der Preis f&uuml;r diesen Sieg war hoch. Riven stand\ngenau in der Fluglinie von Miras Attacke. Sie wusste, dass sie nicht ausweichen konnte\nund lie&szlig; den Windschnitt auf ihren K&ouml;rper treffen. Riven hatte ihr Leben geopfert, um\nSions Tod zu erm&ouml;glichen. Mira wusste, dass Riven ihr Leben absichtlich opferte und\nk&uuml;mmerte sich um Jarvan.\nNachdem sich Jarvan von Sions gewaltigen Angriff erholt hatte, gab es nun eine Stadt zu\nverteidigen. Jarvan &ouml;ffnete die gro&szlig;en, goldenen T&uuml;ren des Thronsaals und lief\nzusammen mit Mira zu einer Stelle, von welcher man die komplette Stadt beobachten\nkonnte. Als sie dort ankamen, bot sich ihnen ein Anblick des Schreckens. Gro&szlig;e Teile der\nStadt waren von dichtem, gr&uuml;nen Smog durchzogen. In den wenigen Stadtteilen, in\ndenen das &Uuml;berleben &uuml;berhaupt noch m&ouml;glich war, tobten immer wieder K&auml;mpfe, die\ngr&ouml;&szlig;ten Teils zu Gunsten der Noxianer endeten. Die demacianische Armee hatte keine\nChance gegen die &Uuml;bermacht der D&auml;monen und schwarzen Kriegern. Doch auf dem\nMarktplatz, der in mitten der sterbenden Stadt lag, gab es K&auml;mpfe, die von einem\neinzigen demacianischen Krieger immer wieder gewonnen wurden. Jarvan zeigte auf\ndiesen Markplatz und erkl&auml;rte Mira, dass sie dahin mussten. Der demacianische Krieger,\nder schon ganze noxische Heere aufgehalten hatte, w&auml;re der Schl&uuml;ssel zur Befreiung\nDemacias. Mira erkl&auml;rte sich einverstanden und zusammen st&uuml;rmten die beiden Helden\nin die Unterstadt.\nAls sich Mira, dicht gefolgt von Jarvan, dem Marktplatz n&auml;herte, erkannte sie den\nKrieger. Er war bereits durch Miras Heimatdorf gereist und hatte sich mit ihr\nangefreundet. Der Krieger war hoffnungslos in der Unterzahl, doch nahm er es gelassen.\nMit den Worten: &bdquo;Gebt auf, ich hab&acute; euch umzingelt!&ldquo; begann der Lanzenk&auml;mpfer die\nReihen des noxischen Trupps, der ihn umstellt hatte, zu lichten. Bereits nach wenigen\nMinuten hatte sich Xin Zhao des noxischen Kampftruppes vollst&auml;ndig angenommen und\nerblickte jetzt Jarvan und Mira. Ohne auch nur ein Anzeichen von Schw&auml;che, ging er zu\nden beiden hin&uuml;ber. Mira begr&uuml;&szlig;te ihren alten Freund mit einer Umarmung.\nAnschlie&szlig;end verbeugte sich Xin Zhao vor Jarvan. Auf seine Worte &bdquo;Es ist eine Freude,\neuch wiederzusehen, mein Prinz&ldquo; erwiderte Jarvan letztendlich nur: &bdquo;Ab jetzt wirst du\nmich mit K&ouml;nig anreden! Mein Vater ist tot!&ldquo;. Xin Zhao vernahm diese Worte mit\nschwerem Herzen, doch weckte ihn eine Frage von Jarvan aus seiner Trauer auf: &bdquo;Wei&szlig;t\ndu, wo die &uuml;berlebenden Beschw&ouml;rer sind, die wir seit der Vernichtung der Liga\naufgenommen haben?&ldquo;. Xin Zhao nickte und lie&szlig; Mira und Jarvan verstehen, dass sie\nihm folgen sollten.\nNach wenigen Minuten erreichten die drei Kameraden ein altes, verlassenes Lagerhaus.\nXin Zhao klopfte ein geheimes Muster und ein Mann mit einem grauen, langen Bart\n&ouml;ffnete die T&uuml;r. Xin Zhao bat um Einlass und der Mann, der sich als ein ehemaliger\nBeschw&ouml;rer herausstellte, f&uuml;hrte Mira, Jarvan und Xin Zhao in die Tiefen des\nLagerhauses. Nach wenigen Schritten erreichten sie einen Bereich, in dem sich mehrere\nM&auml;nner und Frauen aufhielten. Alle waren sie gekleidet wie der Mann, der unseren\nHelden die T&uuml;r &ouml;ffnete. Xin Zhao blickte zu Jarvan und gab ihm zu verstehen, dass dies\nalle &uuml;berlebenden Beschw&ouml;rer des Massakers an der Kriegsakademie seien. Die\nBeschw&ouml;rer blickten in das Gesicht des neuen demacianischen K&ouml;nigs, doch fielen ihre\nBlicke anschlie&szlig;end auf Mira. Einer der j&uuml;ngeren Beschw&ouml;rer stand auf, ging zu Mira\nhin&uuml;ber und umrundete sie pr&uuml;fend. Ein anderer Beschw&ouml;rer fragte ihn: &bdquo;Sie ist es,\noder?&ldquo;. Ein kurzes Nicken gab Mira zu verstehen, dass sie die Beschw&ouml;rer entweder\nkannten oder auf sie gewartet hatten. Sie unterbrach die Stille: &bdquo;Wer bin ich? Kennt ihr\nmich?&ldquo;. Der &auml;lteste unter den Beschw&ouml;rern kam auf Mira zu: &bdquo;M&auml;dchen, wahrscheinlich\nhast du bereits herausgefunden, dass du &uuml;ber besondere Kr&auml;fte verf&uuml;gst.\nH&ouml;chstwahrscheinlich kannst du au&szlig;erordentlich gut eine bestimmte Magie\nkontrollieren. Ich werde dir jetzt erkl&auml;ren, warum dies so ist. Vor 17 Jahren kam dein\nBruder an die Akademie. Er war, wie wir alle, ein angesehener Beschw&ouml;rer. Ihm folgten\ndeine Eltern, ein alter Dorfschmied und seine Frau. Deine Mutter war damals mit dir\nschwanger und du standest kurz vor deiner Geburt, doch irgendetwas stimmte nicht.\nDein Bruder war ratlos, denn obwohl alle Beschw&ouml;rer in Medizin und Technik gelehrt\nwaren, konnte er bei deiner Entbindung nicht helfen. Deshalb bat er einige &auml;ltere\nKollegen um Hilfe. Wir halfen ihn und brachten deine Mutter in unsere Krankenstation.\nZur gleichen Zeit wurde in einem anderen Teil der Akademie ein extrem gef&auml;hrliches\nExperiment durchgef&uuml;hrt, mit deren Hilfe wir uns erhofften, die Runenmagie, die ganz\nRuneterra durchflie&szlig;t, wieder aufzubauen. Du wei&szlig;t ja, dass die Runenkriege diese\nempfindliche Magie stark geschw&auml;cht hatten. Das Experiment schien gut zu verlaufen.\nWir schafften es, ein Wesen aus purer Runenenergie aus einer anderen Welt zu\nbeschw&ouml;ren. Es hatte die Gestalt eines Engels, leuchtete aber wegen des enormen\nEnergielevels in einem hellen, t&uuml;rkisfarbenen Ton. Das Wesen sprach unsere Sprache\nund es konnte uns viel &uuml;ber die Welt erz&auml;hlen, aus der es kam. Viele bedeutende\nDurchbr&uuml;che der modernen Zeit konnten wir nur erreichen, weil uns das Wesen in\nrasender Geschwindigkeit mit Wissen f&uuml;tterte. In dem Moment, in dem unsere\nMedizinspezialisten dich unbeschadet zur Welt brachten, kamen wir endlich zu dem\nPunkt, weshalb wir dieses Wesen - wir nannten es Mira f&uuml;r &bdquo;Mighty Improved Rare\nAngel&ldquo; - beschworen hatten. Wir fragten es, ob es sich mit der Welt verbinden k&ouml;nne,\num sie zu heilen. Auf diese Frage reagierte das Engelswesen mit Zorn und es begann zu\ntoben. Es st&uuml;rmte geschwind durch die Akademie und wir verloren es aus den Augen. Als\nwir es endlich wieder fanden, konnten wir nur noch sehen, wie es &uuml;ber deinem kleinen,\nunschuldigen K&ouml;rper schwebte. Auf ein lautes &bdquo;Nein, Mira&ldquo; hin, stie&szlig; das Wesen in\ndeinen K&ouml;rper und verband sich mit ihm. Deine Mutter nannte dich daraufhin Mira, weil\nihr der Name scheinbar gefiel und dieses Engelswesen der Grund f&uuml;r deine Kraft ist. Du\nbestehst zu einem Gro&szlig;teil aus Runenenergie.&ldquo;. Mira blickte den Beschw&ouml;rer mit\nmisstrauischem Blick an, wusste sie jedoch tief in ihrem Inneren, dass es stimmte.\nEndlich wusste sie &uuml;ber ihre wahre Natur bescheid. Sie wusste, welche Kraft damals im\nKampf gegen Cassiopeia ihren K&ouml;rper &uuml;bernommen hatte und sie von der Vergiftung\nheilte. Es war, als w&uuml;rde eine schwere Last von ihren Schultern fallen.\nJarvan unterbrach diesen Moment mit rauer Stimme: &bdquo;Genug &uuml;ber alte Zeiten\ngesprochen! Beschw&ouml;rer, ihr m&uuml;sst mit uns zum Palast kommen. Wenn mein Vater die\nalten Pl&auml;ne zur Verteidigung vollzogen hat, sind alle B&uuml;rger dort in einer geheimen Halle\nuntergebracht. Ihr m&uuml;sst eure Magie dazu einsetzen, einen Schild um den Palast zu\nbeschw&ouml;ren!&ldquo;. Ein alter und verwirrter Beschw&ouml;rer meldete sich zu: &bdquo;Das ist so verr&uuml;ckt,\ndass es funktionieren k&ouml;nnte!&ldquo;. Die versammelte Beschw&ouml;rer-Gilde machte sich auf den\nWeg zur&uuml;ck zum Palast. Doch bereits nach dem Verlassen ihres Versteckes wurde die\nGruppe von mehreren Feinden entdeckt. Es bestand nicht wirklich eine Chance auf einen\nSieg oder auf eine erfolgreiche Flucht, dennoch rannten Mira, Jarvan, Xin Zhao und die\nBeschw&ouml;rer so schnell es ging zum Palast zur&uuml;ck. Dort hatten sich bereits s&auml;mtliche\n&uuml;berlebenden B&uuml;rger in der geheimen Halle zusammengefunden und der Rest der\ndemacianischen Armee hatte innerhalb der Palastmauern Stellung bezogen, um die\nB&uuml;rger zu verteidigen. Zu diesem Zeitpunkt war das gewaltige, demacianische Heer\nbereits um mehr als die H&auml;lfte geschrumpft.\nW&auml;hrend die Gruppe um Mira sich dem Palast n&auml;herte, stieg die Zahl ihrer Verfolger\nimmer mehr. In dem Moment, als die Gruppe die Treppen zum Palast erreichten, blieb\nMira kurz stehen und schaute zur&uuml;ck. Auf den Ruf Jarvans kam sie wieder zur Besinnung\nund bekann die Stufen zu erklimmen. Als sie etwa die H&auml;lfte der H&ouml;henmeter\nzur&uuml;ckgelegt hatte, stolperte Mira. Mira schlug auf dem harten Ziegelboden auf. Sie\nversuchte wieder aufzustehen, doch gelang es ihr nicht. Offenbar hatte sie sich an ihrem\nrechten Knie verletzt und so blieb ihr nichts anderes &uuml;brig, als verzweifelt vor den\nanr&uuml;ckenden Noxianern davonzukriechen. Dies gelang ihr nur bedingt und bereits nach\nwenigen Momenten hatten die noxischen Elitek&auml;mpfer sie eingeholt und umzingelt.\nW&auml;rend f&uuml;nf Lanzen auf ihren Kopf gerichtet waren, trat eine Frau an Mira heran. Mira\nerkannte die Frau. Es war die gleiche Frau, die vor wenigen Augenblicken den K&ouml;nig von\nDemacia, Jarvans Vater, ermorden lie&szlig;. Mira stotterte &auml;ngstlich: &bdquo;Du hei&szlig;t LeBlanc,\nrichtig?&ldquo;. &bdquo;Wie ich sehe, eilt mir mein Ruf voraus. Sehr schmeichelhaft.&ldquo;, grinste LeBlanc\nselbstzufrieden. &bdquo;Nein, eigentlich nicht.&ldquo;, konterte Mira, &bdquo;Du bist nur das Mistst&uuml;ck, das\nJarvans Vater auf dem Gewissen hat!&ldquo;. LeBlanc wurde sichtlich sauer und schrie: &bdquo;Du\nwirst ihm gleich folgen, genauso wie all jene, die zu ihm stehen! M&auml;nner! T&ouml;...&ldquo;. In dem\nMoment, als LeBlanc den Befehl zum Todessto&szlig; geben wollte, schoss ein Pfeil durch sie\nhindurch und schaltete sie in einem Augenblick aus. Mira und die noxischen Elitekrieger\ndrehten sich um und entdeckten den Sch&uuml;tzen. Es war Varus, der kniend auf einer Zinne\nsa&szlig;. W&auml;hrend er die noxischen Krieger mit Leichtigkeit ausschaltete, schrie er in die\nbrennende Stadt: &bdquo;Ionia ist eingetroffen!&ldquo;. Varus eilte zu Mira und half ihr auf. Mira\nklopfte sich den Staub von ihren Kleidern, blickte hinab in die Stadt und was sie sah,\nerf&uuml;llte sie zu gleichen Ma&szlig;en mit Freude als auch mit Ehrfurcht. Hinter der Stadt erhob\nsich eine gewaltige Armada aus dem Meer. Hunderte ionische Schiffe setzten Truppen an\nder K&uuml;ste Demacias ab. Vielen ionischen K&auml;mpfern war es bereits gelungen, in die Stadt\neinzufallen und bereits kleine Teile des Stadtstaates waren zur&uuml;ckerobert und von\nionischen Heilern von Singeds Gift ges&auml;ubert worden. Auf der anderen Seite des\nSchlachtfeldes erkannten Cho&acute;Gath und Singed, die beiden Herresf&uuml;hrer der noxischen\nArmee, die Lage. Cho&acute;Gath schrie Singed an: &bdquo;K&uuml;mmerlicher Mensch! Du sagtest, Ionia\nw&auml;re nicht in der Lage, einen milit&auml;rischen Gegenschlag auszuf&uuml;hren!&ldquo;. Singed stotterte\nzur&uuml;ck: &bdquo;Das sind sie auch nicht! Das muss ein Trick sein. Das... Das... Ich kann das mit\nmeinen Giften be...&ldquo;. Cho&acute;Gath unterbrach das Gewimmer von Singed, indem er den\nnoxischen Giftmischer hochhob, zerriss und verspei&szlig;te. Cho&acute;Gath wendete sich wieder\nder Stadt zu. Er konnte immer noch nicht glauben, was geschah. Seine Armee der Leere\nwurde von einfachen, menschlichen Soldaten niedergerungen. Doch das Schlimmste\nstand dem Leerenmonster noch bevor. Varus hatte auf der langen Seereise von Ionia\nnach Demacia bereits einen Schlachtplan ausgearbeitet. Das Hauptziel war die Befreiung\ndes Palastes in mitten der Stadt. Nebenbei war es wichtig, die Stadt von Feinden zu\ns&auml;ubern. Gerade als Cho&acute;Gath versuchte, wieder einen &Uuml;berblick zu erhalten, h&ouml;rte er\ndas demacianische Kriegshorn erklingen. Cho&acute;Gath blickte genau hin und erkannte, dass\ndie ionischen Streitkr&auml;fte den Palast erreicht hatten und dass Jarvan nun als K&ouml;nig die\nArmeen Demacias und Ionias zum Gegenschlag f&uuml;hrte. Hoch zu Ross reitete Jarvan an\nder Spitze einer Elite aus ionischen und demacianischen Reitern aus der Stadt und hielt\nauf Cho&acute;Gath zu. Direkt hinter Jarvan ritt Mira, die sich dem Ausfall sofort angeschlossen\nhatte. Das Kind der Leere erkannte sofort die Bedeutung dieses unscheinbaren M&auml;dchen\nmit den t&uuml;rkisfarbenen Haaren. Vor Cho&acute;Gath &ouml;ffnete sich ein Spalt zwischen der Leere\nund der normalen Welt. Sofort forderte Cho&acute;Gath ein Heer aus Verst&auml;rkungstruppen an.\nNeben den zahlreichen D&auml;monen trat auch ein Mensch aus dem Leerenportal. Er war in\nabendl&auml;ndlichen Kleidern geh&uuml;llt und obwohl er menschlichen Blutes war, so schien ihm\ndie Leere zu folgen. Cho&acute;Gath befahl dem schwebenden Mensch den Gegenschlag\nabzuwehren, das M&auml;dchen gefangenzunehmen und in die Leere zu bringen. Mit diesen\nWorten verlie&szlig; Cho&acute;Gath das Schlachtfeld durch den Spalt und Jarvan sah sich nun einer\nneuen Armee gegen&uuml;ber, hatte Demacia doch gerade erst die Belagerungstruppen von\nNoxus niedergeschlagen.\nW&auml;hrend Jarvan auf die sich formierenden Armeen der Leere zuritt, eroberte Varus mit\neinem Teil der ionischen Ladungstruppen Demacia vollst&auml;ndig zur&uuml;ck. Die ionischen\nHeilkundigen beseitigten Singeds Gift restlos und versuchten sich nun an einem\nneuartigen Schutzzauber, dessen Aufgabe es war, Demacia mit einer Schildkuppel zu\numgeben und so vor weiteren Angriffen zu bewahren. Der Zauber funktionierte, denn\ndie Geschosse der d&auml;monischen Belagerungswaffen l&ouml;sten sich beim Eintritt in den\nZauber in Luft auf. Jarvan befahl seinen Reitern sich in Keilformation aufzureihen und mit\nlautem Gebr&uuml;ll rasten die berittenen Soldaten auf den Wall von Gegnern zu. Die ersten\nReihen der Leere wurden von den bestens ausgebildeten Ioniern niedergeritten und erst\nals die Armee Jarvans auf die zweite Welle der Angreifer traf, geriet der Vorsto&szlig; ins\nStocken. Sofort teilten sich die Reiter auf und verwickelten die d&auml;monischen Krieger in\nwilde K&auml;mpfe, die sowohl hoch zu Pferd als auch direkt am Boden gef&uuml;hrt wurden.\nJarvan, der mitten in einem Kampf steckte, erblickte den Heerf&uuml;hrer der Leere. Es war\nein ehemaliger Champion der Liga. Sein Name war in den n&ouml;rdlichen Regionen Valorans\ndurchaus bekannt. Es handelte sich um Malzahar, den Propheten der Leere. Ohne sich\num den Ausgang der Schlacht zu k&uuml;mmern, schwebte Malzahar zielgerade auf die\nk&auml;mpfende Mira zu, denn letztendlich war es sein Befehl, das M&auml;dchen zu entf&uuml;hren\nund keinen Krieg zu gewinnen. Jarvan rannte auf Mira zu, um sie von den gierigen\nGriffen von Malzahar zu sch&uuml;tzen, doch kam er zu sp&auml;t. Bevor er Mira erreichen konnte,\ngriff Malzahar nach ihr, setzte sie mit Hilfe seiner Leerenmagie au&szlig;er Gefecht und\nverschwand mit der gefangenen Mira in einem Leerenportal, das sich kurz vor Jarvan\nwieder schloss. Mira war entf&uuml;hrt worden. Niemand wusste, was mit dem unschuldigen\nM&auml;dchen geschehen w&uuml;rde und was Cho&acute;Gath einer jungen Frau antun w&uuml;rde. Der\nHimmel &uuml;ber dem Schlachtfeld wurde schwarz wie die Nacht und es begann zu regnen.\nObwohl Ionia und Demacia letztendlich siegten, lag doch ein schwerer Schleier auf der\nWelt.\n\n**KAPITEL 4: DER STICH INS SCHWARZE HERZ**\nJarvan drehte sich um. Vor ihm lag ein Meer aus toten Noxianern und Leerend&auml;monen.\nDemacia war gerettet und der Feldzug des Guten konnte beginnen. Doch um welchen\nPreis? Viele waren gefallen und Mira war verschleppt worden. Jarvan blickte auf seine\nStadt. Die ionischen Heiler fuhren den Schutzzauber herunter. Varus und Xin Zhao kamen\nauf zwei Pferden zu Jarvan geritten. Besorgt und nachdenkend fand Xin Zhao seinen\nneuen K&ouml;nig vor. Varus erkl&auml;rte Jarvan, dass die Armeen Demacias und Ionias bereit\nseien, um den Gegenangriff zu starten. &bdquo;Nein!&ldquo;, schrie Jarvan, &bdquo;Unser wichtigstes Ziel ist\ndie Befreiung Miras. Malzahar hat sie in die Leere entf&uuml;hrt. Dieses M&auml;dchen ist zu einem\nSymbol des Widerstandes geworden und ohne sie w&auml;re ich schon lange tot. Mehr als\neinmal hat sie mich gerettet.&ldquo;. Varus blickte zu Boden und &uuml;berlegte. Xin Zhao erkl&auml;rte\nJarvan, dass es wahrscheinlich keinen Eingang in die Leere gebe. Niemand w&uuml;rde sich\ndort auskennen. &bdquo;Doch!&ldquo;, schrie eine Stimme aus den Baumkronen und pl&ouml;tzlich\ntauchten die drei ionischen Ninjas auf, die bei der Befreiung Demacias heimlich\nmitgewirkt hatten. Die Frau und der Kleine, scheinbar einer der Yordle, standen weiter\nhinten, w&auml;hrend der Mann der drei Ninjas auf Jarvan und Varus zuging. &bdquo;Es gibt\njemanden, der wei&szlig;, wie man die Leere betreten und auch wieder verlassen kann. Es ist\njemand, dem die Leere inne wohnt und der trotzdem nicht auf deren Seite k&auml;mpft. Ich\nrede von Kassadin. Mein Team und ich k&ouml;nnen ihn finden und wir werden das M&auml;dchen\nauch befreien!&ldquo;, erkl&auml;rte der Ninja. Varus antwortete: &bdquo;Shen, Akali, Kennen! Wenn ich\njemanden zutraue, die Leere unbeschadet zu bestehen, dann seid ihr das. Legt los! Wir\nbereiten w&auml;hrenddessen den Gegenschlag vor.&ldquo;. Im gleichen Moment verschwanden die\ndrei Ninjas und Varus erkl&auml;rte Jarvan, dass er sich nun keine Sorgen um Mira machen\nm&uuml;sste. Das wichtigere Ziel sei nun die Organisation der Armee. Jarvan l&auml;chelte und\nmachte sich auf den Weg in die Stadt, gefolgt von Varus und Xin Zhao.\nShen, gefolgt von Akali und Kennen, raste mit wahnsinniger Geschwindigkeit durch\nValoran. Das Team w&uuml;rde wie immer zusammenarbeiten, um Mira aus den F&auml;ngen der\nLeere zu befreien. Die Stille der Reise wurde von Kennen unterbrochen, der sich\nbedr&uuml;ckt Akali zuwand: &bdquo;Sag mal, wo sollen wir denn nach Kassadin suchen? Er hat doch\ndie Kriegsakademie bereits Monate vor dem Angriff der Noxianer verlassen. Woher\nsollen wir denn wissen, ob er &uuml;berhaupt noch lebt?&ldquo;. Noch bevor Akali antworten\nkonnte, schrie Shen zu seinem Freund: &bdquo;Ich wei&szlig;, dass er lebt. Und unser Ziel hei&szlig;t\nShurima.&ldquo;. &bdquo;Du meinst doch wohl nicht etwa die W&uuml;ste Shurima? Ich hasse die W&uuml;ste!&ldquo;,\nschrie Kennen, doch Shen interessierte das nicht. Der Orden der Kinkou hat die Aufgabe,\ndas Gleichgewicht zwischen Gut und B&ouml;se aufrecht zu erhalten. Und in diesen\nschwierigen Zeiten bedarf es der Rettung Miras, de sie war der Schl&uuml;ssel, um das\nGleichgewicht wiederherzustellen. Kennen akzeptiere schlie&szlig;lich das Ziel der Mission,\nhoffte jedoch inst&auml;ndig, dass die Reise durch Shurima nicht lange dauern w&uuml;rde.\nEinige hundert Kilometer weiter wurde Shen wieder aus seinen Gedanken gerissen, doch\ndieses Mal war es Akali, die ihn st&ouml;rte: &bdquo;Shen, ich habe nichts gegen die W&uuml;ste, aber hast\ndu dir Gedanken &uuml;ber unsere Vorr&auml;te gemacht? So wie ich dich kenne, sind wir wieder\nviel zu schnell aufgebrochen und jagen wieder zweifelhaften Informationen hinterher. Es\nwundert mich, dass du &uuml;berhaupt das Gebiet kennst, in dem sich Kassadin aufhalten soll,\naber ich bezweifle, dass du den exakten Standort kennst. Ich schlage deshalb vor, dass\nwir eine Pause bei den Solari einlegen sollten. Sie liegen auf unserer Route und\nau&szlig;erdem kennen wir alle drei dort jemanden, der uns helfen wird.&ldquo;. Shen wusste, dass\nsie mal wieder ins Schwarze getroffen hatte. Sie kannte ihn einfach zu gut. &bdquo;Ja, du hast\nRecht. Ich wei&szlig;, wen du meinst. Leona wird uns bestimmt helfen.&ldquo;, stimmte Shen zu und\n&auml;nderte die Reiserichtung geringf&uuml;gig ab, sodass das Team den Berg Targon ansteuerte.\nNoch bevor es dunkel wurde, erreichten die drei Ninjas den Fu&szlig; des Berges. Nach einer\nkurzen Abstimmung beschloss das Team, einen Moment zu rasten und im Morgengrauen\nden Berg zu erklimmen. Kennen und Akali machten sich auf den Weg, um in der\nUmgebung nach Feuerholz zu suchen, w&auml;hrend Shen sich den Berg ansah und sich einen\nPlan f&uuml;r den bevorstehenden Aufstieg zurechtlegte. Nach wenigen Augenblicken kehrten\nAkali und Kennen zur&uuml;ck, legten das Feuerholz ab und machten sich daran, ein kleines\nLagerfeuer zu machen. Jeder der drei Ninjas hatte eine Kleinigkeit zu essen aus seinem\nRucksack hervorgeholt. Es schien nicht viel zu sein, doch war die Nahrung genau das,\nwas ein Reisender nun mal brauchte und man wurde &uuml;berraschender Weise davon satt.\nEinzig Shen hatte es sich angew&ouml;hnt, seine Mahlzeit aufzuw&auml;rmen, und so suchte er sich\neinen Stock und ein gro&szlig;es Blatt, w&auml;hrend die beiden anderen ihre Mahlzeiten bereits\nherunterschlangen. Shen wickelte sein Essen in das Blatt ein und befestigte es an einem\nStock, den er dann &uuml;ber das Feuer hielt. So wurde seine Nahrung schnell warm und\nbereits nach kurzer Zeit a&szlig; auch er. Nachdem sie gegessen hatten, schw&auml;rmten die drei\nFreunde in Erinnerungen, bevor sie sich auf dem harten Boden zur Ruhe betteten.\nDie Nacht war ruhig und der Vollmond stand hoch am Himmel. Das Lagerfeuer war\nheruntergebrannt und klimmte noch ein wenig vor sich hin. Jeder hatte seine Waffen\nabgelegt und sie, zusammen mit ihren Rucks&auml;cken, neben sich platziert. Shen und\nKennen hatten ihre Kopfbedeckungen abgezogen, Akali stattdessen hatte ihren\nMundsschutz herunter gezogen und schlief von allen drei am unruhigsten. Mitten in der\nNacht fuhr sie hoch und blickte um sich. Zuerst blickte sie ihn die Baumkronen. Ihr war\nso, als w&uuml;rden die Schatten nach ihr greifen. Danach blickte sie tiefer in den Wald hinein.\nSie entdeckte einen Schatten hinter einem Baum, der ein paar Meter von ihr wuchs. Als\nsie jedoch den Schlaf aus ihren Augen rieb, war der Schatten verschwunden. Akali\nsch&uuml;ttelte ihren Kopf. Wurde sie verr&uuml;ckt? Oder hatte sie sich den Schatten im\nHalbschlaf eingebildet? Sie wusste es nicht. Pl&ouml;tzlich sp&uuml;rte sie einen festen Griff um\nihren Kn&ouml;chel, der sie aus ihren Gedanken hochfahren lie&szlig;. Sie schaute hinunter und sah\nden Schatten einer menschlichen Hand, der nach ihr griff und langsam an ihrem Bein\nzog. Als Akali dagegenhielt, lie&szlig; die Schattenhand los und verschwand so pl&ouml;tzlich, wie\nsie aufgetaucht war. Akali schlief nicht mehr ein und lag beunruhigt auf dem Boden. Sie\nbeschloss, Shen und Kennen nichts von den Erlebnissen zu erz&auml;hlen.\nAm n&auml;chsten Morgen machten sich die drei Ninja an die Besteigung des Berges Targon.\nNach wenigen gezielten Spr&uuml;ngen n&auml;herten sich die drei Freunde dem Dorf der Rakkor.\nShen, Akali und Kennen marschierten langsam in das Dorf, in dessen Mitte sich zwei\nBewohner pr&uuml;gelten. Beide trugen die gleichen R&uuml;stungen und Waffen. Einer der\nzuschauenden Rakkor bemerkte die Fremden zuerst und machte seine Kameraden auf\ndie Eindringlinge aufmerksam. Sofort eilten die Kriegsbesessenen zu ihren Waffen und\numstellen das Ninja Trio. Pl&ouml;tzlich zog einer der Rakkor, die gek&auml;mpft hatten, seinen\nHelm ab und schrie: &bdquo;Shen, Akali, Kennen! Was macht ihr denn hier?&ldquo;. Die Ninjas\nerkannten den Mann. Es war Pantheon, der einzige Rakkor, der in der Liga gek&auml;mpft\nhatte. Shen erkl&auml;rte Pantheon, dass sie die Solari um Verpflegung bitten wollten, da sie\nin Richtung W&uuml;ste unterwegs waren. Nach langem Hin und Her wurden die Rakkor &uuml;ber\ndie Umst&auml;nde der Reise aufgekl&auml;rt. Shen erz&auml;hlte ihnen von dem Krieg, der in der Welt\ntobte, von Mira und eigentlich von allem, &uuml;ber das er etwas wusste. Pantheon h&ouml;rte bis\nzum Ende zu, vor allem das Wort &bdquo;Krieg&ldquo; stie&szlig; bei ihm auf Geh&ouml;r. Er war Rakkor und als\nsolcher war Krieg das einzige, was ihn wirklich interessierte. Es gab nichts gr&ouml;&szlig;eres als\nden Adrenalinschub, den er bekam, wenn er sich durch feindliche Reihen metzelte. Er\nkonnte die drei Ninjas aber trotzdem nicht auf den Gipfel des Berges lassen. Die Rakkor\nhatten zwei Aufgaben: Die erste Aufgabe war schlicht und einfach Krieg zu f&uuml;hren und\njeden zu vernichten, den es zu vernichten gab. Die andere Aufgabe bestand darin, die\nSolari zu sch&uuml;tzen und so stellten sich Pantheon und die anderen Rakkor den drei Ninjas\nin den Weg. Shen verstand zun&auml;chst nicht, doch als Pantheon seinen Speer auf ihn\nrichtete, wurde ihm klar, dass er zu k&auml;mpfen hatte. Akali und Kennen zogen ebenfalls\nihre Waffen und stellten sich mit Shen R&uuml;cken an R&uuml;cken, um sich gegen jeden Angriff\nverteidigen zu k&ouml;nnen, denn die Rakkor hatten sie umzingelt. Ein Sieg w&uuml;rde schwer\nwerden, waren sie doch hoffnunglos in der Unterzahl.\nDer Wind wehte &uuml;ber das Dorf und keine der Parteien schien den ersten Angriff starten\nzu wollen, doch einer der Rakkor unterbrach die Ruhe vor dem Sturm und startete einen\nAngriff, indem er mit vorgehaltenem Schild und Speer auf die Ninjas zust&uuml;rmte. Er griff\nAkali an, die ihn jedoch rechtzeitig bemerke und auswich. Shen, Kennen und Akali\nwussten, dass sie zu gewinnen hatten, wenn sie die Solari nach Vorr&auml;ten fragen wollten,\ndoch wollten sie keinen der Rakkor ernsthaft verletzen oder gar t&ouml;ten. Akali hatte eine\nM&ouml;glichkeit gefunden, gleich mehrere Angreifer auszuschalten, ohne sie zu t&ouml;ten. Vier\nRakkor st&uuml;rmten auf Akali zu, die sich einfach in ihrem Zwielicht-Schleier versteckte,\nauswich und so die &uuml;berraschten Rakkor zusammenstie&szlig;en lie&szlig;. Vier Rakkor waren\nausgeschaltet. Akali freute sich und blickte zu Shen, der gerade dabei war, einen\nweiteren Rakkor kampfunf&auml;hig zu machen. Mit Hilfe seines Schattensturzes schoss er an\ndem Rakkor vorbei und lie&szlig; den nun fast hypnotisierten Rakkor in eine Falle laufen, die\nan einer der H&uuml;tten hing. Kennen hatte es am schwersten, seine Gegner auszuschalten.\nIhm standen Pantheon und ein weiterer Rakkor gegen&uuml;ber. Kennen sprang in einem\nR&uuml;ckw&auml;rtssalto auf den Kopf des Rakkors und drehte seinen Helm um, sodass er\nkurzzeitig die Orientierung verlor. In diesem Moment der Unachtsamkeit warf Kennen\nihm seinen Wurfstern in den Fu&szlig;, sodass er sich fallen lie&szlig; und somit kampfunf&auml;hig\nwurde. Als Kennen sich umdrehte, sah er noch Pantheons Schild auf ihn zukommen, das\nihn mit einem harten Schlag traf und ihn quer &uuml;ber den Platz in eine der H&uuml;tte\nschleuderte. Kennen kletterte verwirrt aus den Tr&uuml;mmern der H&uuml;tte und erkannte\nPantheon, der mit vorgehaltenem Speer auf ihn zusprang. Gerade als der Speer Kennen\nzu durchbohren drohte, tauchte Shen in einer lila Wolke vor ihm auf und wehrte den\nAngriff ab. Pantheon war &uuml;berrascht und ein Tritt von Akali lie&szlig; ihn zu Boden gehen.\nShen half Pantheon wieder auf die Beine und Pantheon erkl&auml;rte sich als geschlagen. Er\nakzeptierte seine Niederlage und versprach den drei Ninjas, dass er sie zu den Solari lie&szlig;.\nDoch es wurde bereits dunkel und Akali, Shen und Kennen konnten in der Nacht keinen\nGipfel erklimmen und so baten sie Pantheon um eine Schlafstelle. Die Rakkor hatten\njedoch keine Gasth&auml;user oder Tavernen. Wozu auch? Jeder Gast war entweder ein Feind\noder wurde zu einem gemacht. Willkommene G&auml;ste waren &auml;u&szlig;erst selten und so\nmussten die drei Ninja wieder im Freien am Feuer schlafen.\nEs war dunkel in dieser Nacht. Der Mond wurde durch dichte Wolkenschleier bedeckt\nund nur das Feuer erhellte die Lagerst&auml;tte der drei Freunde. Akali schlief tief und fest. Sie\nhatte die Erlebnisse der letzten Nacht verdr&auml;ngt und vergessen. Shen hatte sich heimlich\nvon der Feuerstelle entfernt und blickte von dem Berg hinab. In der Ferne sah er\nDemacia. Die Stadt war hell erleuchtet und um die Stadt brannten tausende Lagerfeuer.\nDie Armee gegen Noxus war gewachsen und sie wuchs t&auml;glich mehr. Weiter im Norden\nerkannte Shen auch ein gewaltiges Lager und er schlussfolgerte, dass es sich um das\nHeer von Freljord handeln musste, das zu Demacia stie&szlig;en wollte. Kennen unterdessen\nschlie&szlig; sehr unruhig und ein brechender Ast in der N&auml;he lie&szlig; ihn hochfahren. Er schaute\nsie um, erkannte jedoch nichts. Als er sich wieder schlafen legen wollte, schlugen drei\nschemenhafte Wurfsterne vor ihm in den Boden ein, die jedoch kurz danach\nverschwanden. Kennen erschrak sich, doch nachdem er sich beruhigt hatte, sah er sich\nerneut um. Wieder erkannte er nichts und schrieb die Wurfsteine seiner Einbildung im\nHalbschlaf zu. Er dachte sich nichts weiter dabei und beschloss, ebenso wie Akali in der\nNacht zuvor, den anderen nichts davon zu berichten.\nAm n&auml;chsten Tag machten sich die drei Ninjas auf den Weg zum Gipfel des Berges. Das\nTreffen mit den Solari stand auf dem Plan. Kurz nachdem sie die Siedlung der Rakkor\nhinter sich gelassen hatten, wurde Shen unruhig. Er f&uuml;hlte einen Verfolger. Er blickte sich\num, jedoch so, dass Akali und Kennen nichts merkten. Pl&ouml;tzlich zog er eines seiner\nSchwerter, drehte sich um und stie&szlig; es vor Akali in seinen eigenen Schatten. Akali und\nKennen sprangen zur&uuml;ck, w&auml;hrend sich aus dem Schatten ein Mensch bildete. Shen\nerkannte den Mann: &bdquo;Zed! Dachtest du wirklich, ich w&uuml;rde dich nicht bemerken?&ldquo;. Der\nneu aufgetauchte Ninja antwortete nicht, sondern griff Shen ohne Vorwarnung an. Shen\nwehrte jedoch jeden Angriff ab und erst als Akali und Kennen reagierten, stoppte Zed\nseine Angriffsfolge. Er blickte sich um und erkannte, dass die drei Ninjas ihn umstellt\nhatten. &bdquo;Du bist umzingelt und in der Unterzahl!&ldquo;, schrie Akali. Zed fing an zu lachen und\nbr&uuml;llte: &bdquo;Bist du sicher?&ldquo;. Mit diesen Worten tauchten zwei weitere Exemplare von Zed\nauf, die jedoch aus lebenden Schatten bestanden. So war der Kampf ausgeglichen. Zed\ngriff Shen wieder an, w&auml;hrend seine Schatten Akali und Kennen angriffen. Es war ein\nharter Kampf f&uuml;r alle Beteiligten. Obwohl Zed sich als &uuml;berlegen sah, so schw&auml;chte ihn\ndoch der andauernde Gebrauch zweier Schatten. Shen, Kennen und Akali erkannten dies\nund wussten, dass sie die Schatten und Zed gleichzeitig besiegen mussten, damit Zed\nnicht an Kampfkraft gewann. Als eingespieltes Team gelang es ihnen, Zed und seine\nDoppelg&auml;nger zusammenzutreiben. Shen f&uuml;hrte einen seitlichen Hieb gegen Zed aus.\nDieser wich aus, doch Shen hatte dies geahnt und so griff er spontan einen der Schatten\nan und vernichtete ihn. Im gleichen Moment konzentrierten Akali und Kennen ihre\nAngriffe auf den zweiten Schatten und l&ouml;schten auch ihn aus. Zed war nun alleine und\numzingelt und noch bevor er weiter handeln konnte, f&uuml;hrte Shen einen Angriff gegen ihn\naus, der ihn t&ouml;dlich verletzte. Um einem schmerzvollen Ende zu entgehen, &ouml;ffnete Zed\nein Tor ins Reich der Schatten und verschwand darin v&ouml;llig.\nZed war schnell besiegt worden und nun war es endlich an der Zeit, den Berg entg&uuml;ltig\nzu erklimmen und die Solari zu treffen. Doch als Akali, Shen und Kennen die Ausl&auml;ufer\ndes Solari-Tempels erreichten, erkannten sie ein schreckliches Ausma&szlig; der Vernichtung.\nDer komplette Tempel war zerst&ouml;rt worden. Kein Stein war mehr auf dem anderen und\ntote Solari pflasterten die Wege. Shen st&uuml;rmte sofort tiefer in den Tempel und seine\nbeiden Begleiter folgten ihm. Pl&ouml;tzlich tauchte aus den Schatten Leona auf und griff\nShen an. Dieser wehrte Leonas Angriff trotz der &Uuml;berraschung ab. Erst jetzt erkannte\nLeona ihren Gegen&uuml;ber. Sie warnte die drei Ninjas: &bdquo;Los! Verschwindet von der Stra&szlig;e.\nSie wird euch finden!&ldquo;. Gerade als sie diese Worte ausgesprochen hatte, drehte sich der\nWind. Bl&auml;tter flogen &uuml;ber den Boden. Aus der Richtung, aus der der Wind kam, n&auml;herte\nsich Diana, die ehemalige Solari. &bdquo;Schnell in Deckung!&ldquo;, schrie Leona. Shen konnte nur\nwenige Augenblicke vor Dianas Angriff ausweichen. Shen blickte in das Gesicht seiner\nneuen Gegnerin, doch was er sah, war keineswegs Hass oder Zorn, wie er es von seinen\nbisherigen Gegner immer gewohnt war. Nein, stattdessen blickte er in das Gesicht einer\nangsterf&uuml;llten Frau. Eine Frau, die sichtlich Hilfe brauchte. Leona, Kennen und Akali\nrannten zu Shen. Dieser teile Leona mit: &bdquo;Etwas stimmt nicht mit Diana. Sie k&auml;mpft nicht\naus freien St&uuml;cken.&ldquo;. &bdquo;Ich wei&szlig;.&ldquo;, antwortete Leona, &bdquo;aber sie hat s&auml;mtliche Solari\nausgel&ouml;scht. Wir m&uuml;ssen sie hier und jetzt aufhalten. Ganz egal was es kostet!&ldquo;. Shen\nnickte zustimmend und begab sich in Kampfstellung. Akali und Kennen erkannten\nebenfalls den Ernst der Lage und taten es ihrem Anf&uuml;hrer gleich. Diana st&ouml;rte als erste\ndie Ruhe vor dem Sturm. Es &uuml;berraschte Shen, denn Diana k&uuml;mmerte sich nicht um die\nNinjas. Sie wich nur den Angriffen aus, konzentrierte aber ihre eigenen Hiebe stets auf\nLeona. Wie in Rage h&auml;mmerte Diana mit ihrer Mondklinge auf das Solari-Schild von\nLeona ein. In einem letzten, gewaltigen Hieb schmetterte Diana ihre Klinge gegen das\nSchild und mit einem lauten Bersten zerbrachen beide Waffen. Leonas Schild zerbrach in\nder Mitte und die Mondklinge fiel in drei gro&szlig;en Teilen auf den Boden. Die Bruchst&uuml;cke\nl&ouml;sten sich in einem leuchtenden, wei&szlig;en Schein auf. Diana sank auf ihre Knie und kam\nlangsam wieder zu sich: &bdquo;Was habe ich getan? Leona, vergib mir, ich wollte das nicht.&ldquo;.\nLeona blickte &uuml;berrascht auf die niedergeschlagene Diana und antwortete ihr: &bdquo;Du warst\neinst eine Schwester der Solari. Glaubst du wirklich, wir h&auml;tten den Mondkult ohne\nGrund ausgel&ouml;scht? Sie waren eine Gefahr f&uuml;r alle lebenden Wesen. Ich vergebe dir,\nSchwester. Hilf mir den Solari-Kult wieder aufzubauen!&ldquo;. Mit diesen Worten reichte sie\nDiana ihre Hand, um ihr aufzuhelfen.\nAls am n&auml;chsten Tag die Sonne aufging, waren die drei Ninjas erneut zum Aufbruch\nbereit. Leona hatte sie mit gen&uuml;gend Vorr&auml;ten versorgt, um tief in die W&uuml;ste eindringen\nzu k&ouml;nnen. Shen blickte zur&uuml;ck. Hinter ihm standen seine beiden Freunde und am Rand\ndes Solari-Tempels standen Leona und Diana. Leona sah ohne ihren typischen,\ngewaltigen Schild komisch aus. Er war immer ihr Markenzeichen gewesen. Diana trug\neine Solari-R&uuml;stung. Irgendwie merkw&uuml;rdig, dass die Frau, die zeitlebens gegen die Solari\ngek&auml;mpft hatte, nun doch wieder eine ihrer R&uuml;stungen trug. Shen gab seinen Begleitern\nein Zeichen. Akali und Kennen sprangen von der Klippe. Shen blickte noch einmal zur&uuml;ck\nund sprang dann hinterher. Die drei Ninjas erreichten den Fu&szlig; des Berges bereits nach\nwenigen Augenblicken. Die Zeit war reif f&uuml;r die Reise in die W&uuml;ste. Sie mussten schnell\nKassadin finden und ihn &uuml;berreden, sie in die Leere zu f&uuml;hren, um Mira zu befreien. Zu\ndritt durchquerten sie die gro&szlig;e Barriere am Mogran Pass und drangen in die Shurima\nW&uuml;ste ein. Shen &uuml;berlegte, wo es wohl am sinnvollsten w&auml;re, nach Kassadin zu suchen.\nEs fiel ihm nur ein Ort ein. Jener Ort, an dem Malzahar damals die Leere in sein Herz lie&szlig;\nund zu dem Monster wurde, das sich heute selbst Prophet nannte. Shen hatte nur\nGer&uuml;chte &uuml;ber diesen Ort geh&ouml;rt und kannte die genaue Lage nicht, jedoch hatte er\ndurch eben jene Ger&uuml;chte zwei m&ouml;gliche Standorte ausgemacht. Shen gab seinen\nBegleitern zu verstehen, dass sie zu stoppen hatten. Die drei Ninjas sammelten sich und\nShen erkl&auml;rte, wie sein Plan nun aussah. Eine der beiden berechneten Position lag tief in\nder W&uuml;ste. Er selbst hielt diesen Punkt f&uuml;r die bessere Anlaufstelle, jedoch w&uuml;rde eine\nReise in die tieferen W&uuml;stengebiete gro&szlig;e Gefahren mit sich bringen. Man musste sich\nalso sicher sein. Deshalb schlug Shen vor, zuerst die zweite Position anzusteuern, die sich\nn&auml;her an der gro&szlig;en Barriere befand.\nDie Sonne senkte sich &uuml;ber der W&uuml;ste, als Shen, Kennen und Akali ihre erste Anlaufstelle\nerreichten. Alte Statuen und seltsam anmutende Geb&auml;ude ragten aus den D&uuml;nen hervor.\nShen sprang auf den Kopf einer fast vollst&auml;ndig verschunkenen Statue. Er blickte sich um.\nWeit und breit war keine Menschenseele zu sehen. Sie waren umsonst hierher\ngekommen. Kassadin musste an dem zweiten Ort sein, den Shen berechnet hatte. Die\nSonne verschwand am Horizont und die Nacht brach &uuml;ber die W&uuml;ste herein. Shen\nwusste, was nun passieren w&uuml;rde. Er wies Kennen und Akali an, in einem alten Geb&auml;ude\nUnterschlupf zu suchen, um nicht von der grausamen K&auml;lte &uuml;berrascht zu werden. Es\nwar eine eisige Nacht. Nie h&auml;tte Akali sich tr&auml;umen lassen, dass an einem Ort, an dem\ntags&uuml;ber so die Sonne brannte, nachts eine derartige K&auml;lte vorherrschen k&ouml;nnte. Kennen\nseufzte. Sein Atem zeichnete sich in kleinen Rauchschwaden vor seinem Mund ab. Akali\nund Kennen zitterten vor K&auml;lte. Akali sogar ein wenig mehr. Sie trug wie Kennen und\nShen ihre Sommerkleidung, doch im Gegensatz zu den beiden M&auml;nnern war die ihre\nsehr sp&auml;rlich und bot kaum W&auml;rme. Sie blickte zu Shen. Dieser stand mitten im Raum\nund zittere kein bisschen. Es schien, als w&auml;re er im Stehen eingeschlafen, doch Akali\nwusste, dass er meditierte. Seit sie ihn kannte, hatte sie ihn oft meditieren gesehen.\n&Uuml;ber was er aber nachdachte, vermochte sie sich nicht auszumalen.\nDie Sonne schien durch die Eingangst&uuml;r und fiel in Shens Gesicht. Er &ouml;ffnete seine Augen\nund weckte seine Begleiter mit den Worten: &bdquo;Es ist Zeit!&ldquo;. Akali und Kennen wachten\ngemeinsam auf. Kennen hatte sich in der Nacht heimlich zu Akali gelegt, um es w&auml;rmer\nzu haben. Bevor Akali realisierte, dass er ihr zu nahe gekommen war, schlich er sich in\neinen anderen Teil des Raumes. Shen gab das Zeichen zum Abr&uuml;cken. Akali und Kennen\nfolgten ihrem Freund wieder hinaus in die W&uuml;ste. Ihr Ziel lag klar vor ihren Augen. Heute\nmussten sie Kassadin finden. Mira war unersetzbar, sollte Noxus jemals besiegt werden.\nDie drei Ninjas mussten so schnell wie m&ouml;glich tiefer in die W&uuml;ste vorsto&szlig;en. Solange die\nSonne noch nicht weit oben am Himmel stand, war es nicht zu hei&szlig;. Die Hitze war zwar\nunertr&auml;glich, doch im Vergleich zur Mittagshitze eher angenehm. Shen st&uuml;rmte wie wild\ntiefer in die W&uuml;ste vor. Akali und Kennen hatten M&uuml;he, mit ihm Schritt zu halten.\nSp&auml;ter am Tag stand die Sonne am h&ouml;chsten Punkt. Es war Mittag. Shen war auf einer\nhohen D&uuml;ne stehen geblieben. Kennen schleppte sich die D&uuml;ne gerade hoch, w&auml;hrend\nAkali in einem D&uuml;nental stand und ihren Begleiter anflehte, auf sie zu warten. Shen\ndrehte sich um und schrie: &bdquo;Beeile dich! Komm hier rauf, wir sind da!&ldquo;. Getrieben von\ndiesen Worten begann nun auch Akali mit dem Aufstieg auf die D&uuml;ne. Kennen kam als\nZweiter auf dem R&uuml;cken der D&uuml;ne an und brachte nur ein staunendes &bdquo;Wow!&ldquo; hervor.\nVor ihm lag eine gewaltige, im Sand versunkene Stadt. &Uuml;berall in der Stadt trieben\nseltsame Tiere ihr Unwesen. Sie sahen der Kreatur &auml;hnlich, die Malzahar auf den\nRichtfeldern beschworen hatte. Es waren tausende. Akali tauchte neben Shen und\nKennen auf. Auch sie erstaunte bei dem Anblick der Stadt. &bdquo;Kassadin!&ldquo;, schrie Shen und\nst&uuml;rmte in die Menge der Leerentiere. Kassadin stand in der Stadt, umzingelt von den\nden Leerenbegleitern. Shen zog seine Waffen und begann damit, sich durch die Reihen\nder Kreaturen zu metzeln. Nachdem Kennen und Akali realisierten, was vor sich ging,\nzogen auch sie ihre Waffen, um ihrem Freund zu helfen. Die drei Ninjas und Kassadin\nk&auml;mpften mehrere Stunden in der brennden Sonne der Shurima W&uuml;ste. Der Andrang aus\nLeerentieren schien nie enden zu wollen. Als sich die Sonne &uuml;ber der W&uuml;ste senkte und\nKassadin, Akali, Shen und Kennen merkten, dass kein Voidling mehr erschien, setzten sie\nsich ersch&ouml;pft zu Boden. Der Kampf hatte ihnen alles abverlangt. Um sie herum lag ein\nMeer aus toten Leerenbegleitern. Kassadin atmete tief ein und fragte anschlie&szlig;end die\ndrei Ninjas, was sie von ihm wollten. Shen erkl&auml;rte ihm alles. Er erz&auml;hlte von dem\nAbkommen der Leere und Noxus, von dem Kampf, der sich n&ouml;rdlich der gro&szlig;en Barriere\nabspielte, von der Entf&uuml;hrung von Mira durch Malzahar und schlie&szlig;lich von ihrem Plan\nund der Rolle, die Kassadin zu spielen hatte. Kassadin h&ouml;rte aufmerksam zu. Schon als\nShen ihm erz&auml;hlte, dass sich die Leere schon wieder in das irdische Schicksal einmischte,\nerkl&auml;rte er sich innerlich dazu bereit, den gro&szlig;en Schritt zu wagen. Er selbst war Teil der\nLeere, ohne ihr zu dienen. Dies erm&ouml;glichte ihm den Dimensionsschritt in die Leere. Er\nwar der Einzige, der ein Portal in die Leere &ouml;ffnen konnte, um so einen Angriff auf das\nschwarze Herz des Feindes auszuf&uuml;hren. Als er schlie&szlig;lich davon h&ouml;rte, dass Malzahar\nerneut ein junges M&auml;dchen entf&uuml;hrt hatte, packte ihn zus&auml;tzlich die Wut. Seine eigene\nTochter konnte Kassadin nicht retten, doch er w&uuml;rde es nicht zulassen, dass Mira etwas\nzustie&szlig;. Kassadin lie&szlig; die drei Ninjas von seinem Entschluss wissen, erkl&auml;rte jedoch, dass\nes wohl kl&uuml;ger w&auml;re, sich erst auszuruhen. Mit diesen Worten versank die Sonne am\nHorizont und die Nacht brach abermals &uuml;ber die Shurima W&uuml;ste herein.\nShen steckte seine Schwerter ein. Der Angriff w&uuml;rde heute beginnen, sie w&uuml;rden\nMalzahar finden, sie w&uuml;rden Mira befreien und sie w&uuml;rden Runeterra die Hoffnung\nzur&uuml;ckgeben. Kassadin hatte schon l&auml;ngst mit der Beschw&ouml;rung angefangen. Nicht mehr\nlange und das Portal zur Leere w&uuml;rde sich &ouml;ffnen. Akali und Kennen traten neben Shen.\nEr sah sie an und sie gaben ihm mit einem Nicken zu verstehen, dass sie bereit waren.\nShen versank in Gedanken. Er dachte an seinen Meister und an Zed. Obwohl Zed sich f&uuml;r\nden St&auml;rkeren hielt, war es doch Shen, der die gr&ouml;&szlig;te Macht auf Erden besa&szlig;: Die\nFreundschaft und die Liebe der Personen, die ihm wichtig waren. Ein Schrei von Kassadin\nriss ihn aus seinen Gedanken: &bdquo;Macht euch bereit! Das Portal &ouml;ffnet sich gleich. Ich wei&szlig;\nnicht, wie lange ich es offen halten kann, macht also bitte so schnell wie m&ouml;glich!&ldquo;. Shen\n&ouml;ffnete die Augen und sah ein gewaltiges, violettfarbenes Tor vor ihm. Die Welt dahinter\nsah karg und leblos aus. F&uuml;r einen Moment empfand Shen Mitleid f&uuml;r die Kreaturen\ndieser Welt, doch als Akali und Kennen losrannten, verdr&auml;ngte er diesen Gedanken und\nst&uuml;rmte durch das Portal in die Leere. Kassadin betrat die Leere als Letzter und sofort, als\ner die Leerenwelt betreten hatte, schloss sich das Portal hinter ihm. Sie waren nun da.\nVor ihnen erhob sich eine gewaltige, schwarze Festung. Auf der Spitze der Festung\nerkannte Kassadin seinen Erzfeind: Malzahar. Ebenso erblickte er ein junges M&auml;dchen\nmit t&uuml;rkisfarbenen Haaren. So hatte Shen Mira beschrieben. Die vier K&auml;mpfer drangen in\ndas Innere der Festung ein, fest entschlossen Mira zu befreien.\nDas Innere der Festung war wie ausgestorben. Es schien so, als h&auml;tten wirklich s&auml;mtliche\nBewohner dieser ungl&uuml;cklichen Dimension die Leere verlassen, um Runeterra ins\nVerderben zu st&uuml;rzen. Es dauerte nicht lange, bis Shen und Kassadin das gewaltige Tor\nerreichten, das zu Malzahars Beschw&ouml;rungskreis f&uuml;hrte. Kennen und Akali waren\nw&auml;hrend dem Sturm der Festung ein wenig zur&uuml;ckgefallen. Shen versuchte die T&uuml;r zu\n&ouml;ffnen, doch sie war fest verschlossen. Shen schlug mit aller Kraft auf die T&uuml;r ein, doch\nsie zeigte keinerlei Anzeichen von Schw&auml;che. Mira befand sich hinter dieser T&uuml;r und Shen\nkonnte sie nicht erreichen. Sein Ziel war so nah und doch so fern. Pl&ouml;tzlich stie&szlig; Kassadin\nden ver&auml;rgerten Ninja zur Seite und schrie: &bdquo;Ein einfaches Tor kann mich nicht aufhalten!\nHeute wirst du sterben, Malzahar!&ldquo;. Mit diesen Worten l&ouml;ste sich Kassadin in Luft auf\nund Shen h&ouml;rte, wie er auf der anderen Seite der T&uuml;r auftauchte, Malzahar anschrie und\nihn in einen Kampf verwickelte. Kennen und Akali erreichten schlie&szlig;lich ebenfalls die\nSackgasse. Shen gab ihnen zu verstehen, dass sie ihm helfen sollten, die T&uuml;r\naufzubrechen. Zusammen gingen die drei Ninjas in Stellung. Ein Jeder von ihnen zog\nseine Waffen und fokusierte das massive Holztor. Sie waren nicht so weit gekommen, um\nnun zu scheitern. Mit einem gewaltigen, gemeinsamen Angriff zertr&uuml;mmerten sie die\nT&uuml;r. Unter lautem Bersten zerbrach die T&uuml;r und Akali, Shen und Kennen konnten mit\neigenen Augen den Kampf zwischen den beiden Erzfeinden beobachten. Kassadin\nk&auml;mpfte mit gr&ouml;&szlig;ter Wut, denn er hatte vor, Malzahar endlich f&uuml;r das Verschwinden\nseiner Tochter zur Rechenschaft zu ziehen. Nicht weit entfernt von Shen hing Mira,\nfestgekettet und bewusstlos, an einer h&ouml;lzernen Wand.\nDer Kampf zwischen Malzahar und Kassadin ersch&uuml;tterte die Festung. Shen, Akali und\nKennen versuchten unterdessen, Mira loszuketten. Wie bereits aus der Liga bekannt,\nk&auml;mpfte Malzahar &uuml;berwiegend mit den Kr&auml;ften, die er von der Leere erhalten hatte.\nKassadin stattdessen versuchte Malzahar mit seiner Klinge zu treffen. Malzahar erkannte\ndies und blieb zu jeder Zeit auf Abstand. Kassadin versuchte mit Hilfe seines Kluftganges\nan Malzahar ranzukommen, doch dieser stoppte ihn, indem er seinen Leerengriff\neinsetzte. Kassadin wurde schwer verwundet und brach unter den Schmerzen\nzusammen. Als Malzahar zum finalen Schlag ansetzen wollte, unterbrach ihn eine\nhellblaue Luftklinge. Mira war endlich wieder frei. Von Zorn erf&uuml;llt stellte sie sich ihrem\nEntf&uuml;hrer gegen&uuml;ber. Die drei Ninjas hatten sie befreit und kurz darauf wachte sie aus\nihrer Bewusstlosigkeit auf. Shen, Kennen und Akali wollten Mira helfen, doch sie lehnte\ndies ab. Sie w&uuml;rde Malzahar alleine zur Rechenschaft ziehen. Getrieben von ihrem Zorn\nst&uuml;rmte Mira auf Malzahar zu, ihr Schwert fest in ihren H&auml;nden. Malzahar hatte gro&szlig;e\nProbleme damit, Miras Angriffen auszuweichen, doch es gelang ihm. Die drei Ninjas\nzerrten unterdessen den angeschlagenen Kassadin zur&uuml;ck in die G&auml;nge der Festung, um\nihn dort zu versorgen. Sie brauchten ihn. Nur er k&ouml;nnte sie wieder zur&uuml;ck nach\nRuneterra bringen. W&uuml;rde er hier sterben, so w&auml;ren sie f&uuml;r immer in der Leere gefangen,\nihre Mission w&auml;re gescheitert und Valoran w&uuml;rde f&uuml;r immer unter noxische Herrschaft\nfallen. Dies durfte niemals geschehen und so taten Kennen, Akali und Shen alles, was in\nihrer Macht stand, um Kassadin zu verarzten. Der Kampf zwischen Mira und Malzahar\ntobte immer heftiger. Malzahar wurde mit jedem Angriff, dem er auszuweichen hatte,\nimmer m&uuml;der, doch Mira schien dagegen immer mehr Kraft zu gewinnen. Mit jedem\nSchlag schien sie sich mehr und mehr in einen regelrechten Rausch zu k&auml;mpfen. Ihre\nKlinge schien sich immer mehr mit Energie zu f&uuml;llen und auch das Gl&uuml;hen in ihren Augen\nwurde immer kr&auml;ftiger. Nachdem Mira immer n&auml;her an ihren Feind herankam, war sie\nsich sicher, dass sie Malzahar besiegen w&uuml;rde. In ihrer Wut beschwor sie alle Kr&auml;fte, die\nin ihr schlummerten. Schlie&szlig;lich zeigten sich erneut ihre Fl&uuml;gel. Jetzt war der Zeitpunkt\ngekommen. Fest entschlossen und getrieben von ihrer Wut umschloss die den Griff ihres\nSchwertes mit beiden H&auml;nden. Ihre Fl&uuml;gel &ouml;ffneten sich zur vollen Gr&ouml;&szlig;e, als Mira\nausholte und mit all ihrer Kraft einen Angriff ausf&uuml;hrte, dessen Wucht alles dargewesene\n&uuml;berstieg, was Malzahar bis dahin kannte. Und es war das Letzte, was er jemals\nkennenlernen durfte, denn der Schwerthieb durchtrennte den Propheten der Leere.\nDoch nicht nur Malzahar sp&uuml;rte diese Energie. Der Turm, der sich hinter Malzahar in die\nH&ouml;he erhob wurde ebenso durchtrennt und st&uuml;rzte in sich zusammen. Malzahar fiel zu\nBoden und s&auml;mtliche Lebensenergie war aus ihm gewichen, noch bevor er &uuml;berhaupt\nden Boden ber&uuml;hrte. Mira hatte gewonnen. Schwer atmend steckte sie ihre Klinge ein.\nIhre Fl&uuml;gel l&ouml;sten sich in einen Schwarm aus Schmetterlingen auf und der t&uuml;rkisfarbene\nSchimmer in ihren Augen verschwand. Unsere Heldin ging in die Knie. Sie hatte all ihre\nKraft in diesen letzten Angriff gesetzt. Sie selbst wusste nicht, dass sie zu solch einer\ngewaltigen Tat f&auml;hig war. Mira wischte sich den Schwei&szlig; von der Stirn und erhob sich\nwieder. Obwohl sie gerade eben einen schweren Kampf hinter sich gebracht hatte, so\nhatte sie sich dennoch schnell genug erholt, um jetzt nach den drei geheimnisvollen\nNinjas zu suchen, die sie befreit hatten.\nAls Mira in die G&auml;nge von Malzahars Festung ging, sah sie ihre Retter. Die drei Ninjas\nsahen sie an. Der geheimnisvolle Magier, der zuerst gegen Malzahar gek&auml;mpft hatte,\nst&uuml;tzte sich auf Shen ab. Mira wollte sich vorstellen, doch Shen gab ihr zu verstehen,\ndass er und die anderen sie bereits kannten. Er stellte seine Gruppe vor. Nachdem Mira\njeden kennengelernt hatte, erkl&auml;rte Kassadin, dass es nun an der Zeit w&auml;re, die Leere zu\nverlassen und nach Runeterra zur&uuml;ckzukehren. Kassadin war schwer angeschlagen,\nversuchte jedoch mit seinen ihm gebliebenen Kraftreserven ein weiteres Portal zu\n&ouml;ffnen. In seinen Gedanken war er bei seiner Tochter. Malzahar war nun tot, doch gelang\nes Kassadin nicht, seine geliebte Tochter zu finden. Er sp&uuml;rte wie Gevatter Tod nach ihm\ngriff. Er w&uuml;rde nicht mehr nach Runeterra zur&uuml;ckkehren. Als sich das Portal komplett\nge&ouml;ffnet hatte, schritten Akali, Kennen und Shen hindurch. Einzig Mira blieb vor dem\nPortal stehen und blickte zur&uuml;ck. Sie schien Kassadins Schmerz zu sp&uuml;ren, dennoch\nfragte sie Kassadin, ob er nicht mitkommen wolle, doch dieser fing pl&ouml;tzlich an zu\nlachen. Mira wusste, dass diese Geste ein Nein darstellte. Kassadin kam auf Mira zu und\nstie&szlig; sie &uuml;berraschend in das Portal.\n\n**KAPITEL 5: DER ENGEL &Ouml;FFNET SEINE SCHWINGEN**\n_&bull;Einige Tage zuvor_\n\nJarvan, Xin Zhao und Varus betraten die vom Krieg gezeichnete Stadt. Jarvan blickte in\ndie Reihen der demacianischen und ionischen Soldaten. Sie alle hatten den Schrecken\nvon Noxus kennengelernt und dennoch waren sie alle bereit, die letzte Schlacht zu\nschlagen. Jarvan atmete tief ein, w&auml;hrend Xin Zhao ihm tr&ouml;stend die Hand auf die\nSchulter legte und ihm Mut zusprach: &bdquo;Du, mein alter Freund, bist jetzt der K&ouml;nig und\nder Anf&uuml;hrer des Widerstandes. Es wird Zeit. In ein paar Tagen wird die Welt von Noxus\nbefreit sein. Wir m&uuml;ssen Runeterra besch&uuml;tzen, ob mit oder ohne Mira.&ldquo;. Varus kniete\nvor Jarvan nieder. &bdquo;Die ionischen Truppen stehen bereit. Wir k&ouml;nnen noch heute\nausr&uuml;cken. Macht euch keine Sorgen. Die Ninjas werden eure Freundin schon retten.&ldquo;,\nsprach Varus zu Jarvan. Dieser wiederum gab Varus zu verstehen, dass er sich erheben\nsollte. Anschlie&szlig;end trat er n&auml;her an die Truppen heran. In seinen Augen war der\nKampfeswille erwacht. Er hatte sein Ziel vor Augen. Voller Mut schrie er in die Reihen\nder Armee, die willens war, Noxus zu vernichten: &bdquo;Demacianer! Heute stehe ich nicht als\neuer K&ouml;nig oder euer Anf&uuml;hrer vor euch. Ich stehe vor euch als euer Bruder. Noxus hat\nuns einen schweren Schlag versetzt und nun glauben sie, dass sie uns geschlagen haben.\nDoch sie vergessen eine Tatsache. Demacia wird niemals aufgeben! Meine Br&uuml;der,\nerheben wir erneut die Waffen und zeigen wir Noxus, dass sie uns eben nicht geschlagen\nhaben! Wir sind nicht alleine! Zusammen werden wir den Sieg erringen!&ldquo;. Nach seinen\nWorten erwachte das Feuer in den Herzen eines jeden Soldaten. Unter lautem Gebr&uuml;ll\nst&auml;mmten sie die demacianische Flagge hoch und zeigten so ihre Treue zur Krone und\nihre Bereitschaft, ein weiteres Mal in den Krieg zu ziehen. Das Banner von Demacia\nerhob sich mehrmals in den Reihen der Armee. Gut deutlich war das Symbol zu\nerkennen, welches das Wappentier darstellte: Den demacianischen Adler. Dieses Tier\nstarb zur Zeit der Runenkriege fast v&ouml;llig aus und wie durch ein Wunder tauchte in dem\nMoment ein Exemplar am Himmel auf. Er kreiste &uuml;ber der Armee, die ihre Kampfeslust\ndurch lautes Gebr&uuml;ll immer mehr anstachelte. Die Schreie des Adlers erf&uuml;llten die\nHerzen der Krieger mit Hoffnung auf eine bessere Welt und als die Armee\nlosmarschierte, landete der Adler auf der Schulter einer jungen Kriegerin. Jarvan kannte\nsie. Sie war eine der besten Sp&auml;herinnen von Demacia. Ihr Name war Quinn und der\ndemacianische Adler h&ouml;rte auf den Namen Valor. Ein treuer und liebevoller\nWeggef&auml;hrte. Javan schulterte seine gewaltige Lanze und f&uuml;hrte seine Truppen Richtung\nOsten - nach Noxus.\nNoch bevor an diesem Tag die Sonne unterging, erreichte die Armee aus ionischen und\ndemacianischen Soldaten die Grenze von Noxus. Vor ihnen lag die erste gr&ouml;&szlig;ere\nStreitmacht, der sie sich auf dem Marsch entgegenstellen mussten. Immer wieder\nbegegneten ihnen kleinere Sp&auml;hertrupps, die sie jedoch stets restlos ausl&ouml;schten. Nun\nwar die Zeit gekommen, um Noxus die erste gro&szlig;e Niederlage zuzuf&uuml;gen. Jarvan blickte\nhinter sich. Seine Armee war gewaltig, doch keimten in ihm Zweifel auf, ob sie gewinnen\nk&ouml;nnten. Die noxische Streitmacht reichte so weit er nur sehen konnte. Tiefer Nebel lag\n&uuml;ber dem Schlachtfeld und es begann zu regnen. Der Kampf in der Abendd&auml;mmerung\nsollte schwierig werden, doch Jarvan gab dennoch seinen Truppen den Befehl, sich auf\ndie Schlacht vorzubereiten. &Uuml;ber dem Schlachtfeld thronte eine Einrichtung: Die\nAkademie. Jener Ort, an dem alles begann. &bdquo;Von hier befreiten die Elitekrieger von\nNoxus das Kind der Leere und genau hier wird Noxus lernen, dass Runeterra eine freie\nWelt ist und auch immer sein wird!&ldquo;, sprach Jarvan zu sich selbst. Seine Armee hatte sich\nversammelt. Jarvan nahm eine der demacianischen Standarten. Varus stand neben ihm\nund beobachtete die noxischen Truppen, die im Angesicht der feindlichen Streitmacht\nhektisch versuchten, eine Formation anzunehmen. Jarvan hob die demacianische\nStandarte hoch in den, von der D&auml;mmerung rot erleuchteten, Himmel. Mit einem lauten\nSchrei befahl er der gemischten Armee aus Demacianern und der Ioniern den Angriff.\nVoller Rachedurst und voller Entschlossenheit st&uuml;rmten Jarvans M&auml;nner auf die noxische\nArmee zu. Diese war zwar zahlenm&auml;&szlig;ig &uuml;berlegen, doch k&auml;mpfte an diesem Tag jeder\nMann und jede Frau mit der Entschlossenheit von zehn Soldaten.\nDie Schlacht auf den Feldern unterhalb der Akademie dauerte bereits einen Tag und\nzwei N&auml;chte. Keine der beiden Parteien wollte aufgeben und gab keinen Meter Boden\nfrei. Als am zweiten Tag die Sonne aufging, erhob sich eine weitere gewaltige Armee aus\ndem Norden. Feljord war eingetroffen, um seinen Br&uuml;dern aus Demacia und Ionia zu\nhelfen. Die drei St&auml;mme des Nordens hatten sich vereint. Ezreal stand an der Spitze\neiner gewaltigen Armee. Hinter ihm die drei Schwestern, die zum Schutz ihrer Welt ihren\nalten Streit beigelegt hatten. Jede von ihnen hatte eigene Pl&auml;ne mit Runeterra, doch\nohne eine Welt konnte keine von ihnen ihren Plan verwirklichen. Die Ansprache, die\nEzreal in der gro&szlig;en Halle gehalten hatte, hatte sie nachdenklich gestimmt. Avarosa,\nWinterklaue und Frostw&auml;chter standen gemeinsam beieinander, um eine gr&ouml;&szlig;ere Gefahr\nzu besiegen. Ashe atmete ein. Mehr Zusammenhalt hatte es in der Geschichte von\nFreljord noch nie gegeben. Er herrschte zwar Krieg, doch Ashe versp&uuml;rte einen Funken\nHoffnung, dass eines Tages Frieden herrschen k&ouml;nnte. Sie blickte nach links und erkannte\nSejuani und Lissandra. Noch nie stand sie den beiden anderen Stammesf&uuml;hrerinnen so\nnah, ohne sie zu bek&auml;mpfen. &bdquo;Lasst uns unseren Feinden die Macht der drei St&auml;mme\nzeigen!&ldquo;, sprach Ashe, w&auml;hrend der Wind ihr die Haare ins Gesicht wehte. Sejuani blickte\nzuerst geschockt in die Augen von Ashe, doch begann dann laut zu lachen, als sie\nrealisiert hatte, dass sogar Ashe sich auf den Kampf freute. Lissandra l&auml;chelte nur stumm\nund wusste, dass Freljord nie wieder zu dem werden w&uuml;rde, wie es einmal war. Eine\nneue &Auml;ra hatte angebrochen und zum ersten Mal vergass sie ihre Pl&auml;ne, die Welt mit\nihrem Eis zu &uuml;berziehen. Ezreal, der einige Meter vor den Schwestern in seiner\nPulsfeuer-R&uuml;stung stand, gab schreiend den Befehl zum Angriff auf Noxus. Die noxischen\nSoldaten konnten ihren Augen nicht glauben und erstarrten zu Angst, als eine Welle aus\nnordischen Kriegern den H&uuml;gel herunterst&uuml;rmte. Die ganze Welt schien sich gegen ihre\nHerrschaft zu wehren. Einige noxische Krieger blickten verwirrt zu ihren Anf&uuml;hrer. Der\neinzige ehemalige Champion von Noxus, der neben Swain noch am Leben war, wusste\njedoch selbst nicht, was zu tun war. Vladimir war nie ein General gewesen, doch in der\ngro&szlig;en Not von Noxus wurde er dennoch in den Befehlsstab gerufen. Nun stand er den\ndrei gr&ouml;&szlig;ten Nationen neben Noxus alleine gegen&uuml;ber. Hilflos sah er mit an, wie die\nArmeen von Demacia, Ionia und Freljord in die ver&auml;ngstigten Reihen der Noxianern\nst&uuml;rmten und seine Truppen niedermetzelten. Die ganze Zeit sah es so aus, als w&auml;ren\nbeide Parteien gleich stark, doch nun verringerte sich die Zahl der Noxianer drastisch.\nWenige Minuten nach dem Auftauchen von Freljord stand Vladimir dem gegnerischen\nAnf&uuml;hrer gegen&uuml;ber. Obwohl Vladimir sich w&auml;hrend des Kampfes heimlich in Mitten\nseiner Truppen aufhielt, stand nun der neue K&ouml;nig von Demacia vor ihm und erhob sich\nzu seiner vollen Gr&ouml;&szlig;e. In einer Hand hielt er seine gewaltige Lanze und in der anderen\nHand erhob er ein zerfetztes Banner seines Landes in die Luft. Vladimirs Augen weiteten\nsich angsterf&uuml;llt, als Jarvan ausholte, um ihn niederzustrecken. Erstarrt vor Angst war es\nVladimir nicht m&ouml;glich, sich in irgendeiner Weise zu r&uuml;hren und so durchbohrte Jarvan\nseinen K&ouml;rper, um ihn anschlie&szlig;end ohne R&uuml;cksicht von sich wegzusto&szlig;en und dem Tod\nauf dem Schlachtfeld zu &uuml;berlassen.\nNachdem der letzte Noxianer der Streitmacht von Vladimir vernichtet oder in die Flucht\ngeschlagen worden war, versammelten sich Jarvan, Varus und Ezreal. Es war Zeit, den\nfinalen Angriff auf die Stadt Noxus vorzubereiten. Ezreal f&uuml;hrte die St&auml;mme von Freljord,\nVarus befehligte das ionische Herr und die demacianische Streitmacht folgte ihrem K&ouml;nig\nund so trafen sich die drei Anf&uuml;hrer zum Kriegsrat. Ezreal teilte Varus und Jarvan mit,\ndass es ihm gelungen war, neben Ionia und Freljord auch die Yordle zur Rebellion zu\nbewegen. Weiter sprach er &uuml;ber Heimerdingers Plan, vor Noxus zur Armee der Rebellen\nzu sto&szlig;en. Varus teilte mit, dass eine weitere ionische Flotte die Stadt vom Meer des\nBesch&uuml;tzers aus angreifen w&uuml;rde und dass er gro&szlig;e Hoffnungen in die drei Ninjas setzte,\ndenn er f&uuml;hlte, dass Mira f&uuml;r einen Sieg essenziell sei. Jarvan informierte schweren\nHerzens Ezreal &uuml;ber den Tod seiner ehemaligen Gef&auml;hrtin Riven. Ezreals Kopf senkte\nsich, doch er konnte sich nicht von seiner Trauer &uuml;bermannen lassen. Noch war die Zeit\nzum Trauern nicht gekommen. Die letzte Schlacht stand bevor und danach k&ouml;nnte man\ndie Gefallenen betrauern. Es waren schon zu viele gestorben und die drei Herresf&uuml;hrer\nfassten den Entschluss, Noxus ein f&uuml;r alle Mal von der Karte Valorans zu streichen und\nauch der Leere einen vernichtenden Schlag zu versetzen. Die Armeen des Guten\ncampierten die Nacht und machten sich am Morgen auf den Weg nach Osten. Sie\nmachten sich auf den Weg Richtung Noxus.\nAls die Sonne am Mittag am h&ouml;chsten Punkt stand, tauchte am Horizont die Stadt Noxus\nauf. Der Tag der letzten Schlacht war gekommen. Vor der Stadt wartete eine gewaltige\nArmee darauf, Jarvan und seine M&auml;nner und Frauen zur&uuml;ckzuwerfen und somit Valoran\nzu erobern. Doch anders als erwartet, waren es keine Noxianer, sondern die Armee\nbestand lediglich nur aus Kreaturen der Leere. An vorderster Stelle erhob sich Cho&acute;Gath\nmeterhoch in den Himmel. Jarvan stemmte erneut sein Banner in die H&ouml;he.\nProvozierend schrie er: &bdquo;Scheinbar hat der gro&szlig;e Cho&acute;Gath endlich den Mut, selbst in die\nSchlacht zu ziehen!&ldquo;. Cho&acute;Gath antwortete, sichtlich ge&auml;rgert, mit einem lauten Br&uuml;llen,\nworauf sich seine Truppen in Bewegung setzten. Jarvans Plan, den er in der Nacht mit\nEzreal und Varus entwickelt hatte, ging auf. Cho&acute;Gath griff an, ohne vorher Jarvans ganze\nSt&auml;rke zu erkennen. Als die Armeen von Cho&acute;Gath auf Jarvans Demacianer trafen,\nwurden sie von ionischen Bogensch&uuml;tzen unter der F&uuml;hrung von Varus umzingelt und\ndie Barbaren aus Feljord, gef&uuml;hrt von den drei Stammesschwestern und Ezreal, stie&szlig;en\nebenfalls zur Schlacht hinzu. Die Truppen der Leere waren umzingelt, doch hielten sie\ndennoch stand. Jedes einzelne Monster wurde nur erschaffen, um zu k&auml;mpfen. Jarvan\nwollte den Kampf schnell beenden und wies Xin Zhao und Quinn an, mit ihm zusammen\nCho&acute;Gath direkt anzugreifen. Die drei Demacianer st&uuml;rmten auf das riesige Monstrum\nzu. Cho&acute;Gath bemerkte den Angriff schnell und warf sich seinen Gegner entgegen. Unter\nden F&uuml;&szlig;en von Quinn &ouml;ffnete sich die Erde, als Cho&acute;Gath auf den Boden stampfte, doch\nbevor die demacianische Soldatin in die Tiefe st&uuml;rzte, eilte Valor ihr zur Hilfe und\nschleppte sie wieder auf festen Untergrund. Xin Zhao selbst hatte hingegen kein Gl&uuml;ck.\nWie einst Singed verschlang Cho&acute;Gath die demacianische Palastwache mit Haut und\nHaaren. Jarvan hatte erneut einen teuren Freund verloren. Voller Zorn umfasste er den\nGriff seiner Lanze und st&uuml;rmte auf Cho&acute;Gath zu. Dieser wiederrum festigte seinen Stand\nund bereite sich darauf vor, seinen Gegner mit seinen Stacheln aufzuspie&szlig;en. Quinn\nerkannte die Gefahr und stie&szlig; Jarvan im letzten Moment bei Seite, kurz bevor er von\neinem von Cho&acute;Gaths Stacheln getroffen wurde. Quinn konnte sich jedoch nicht mehr\nselbst in Sicherheit bringen und wurde von Cho&acute;Gaths Angriff durchbohrt. Jarvan, der\nvon Quinn umgesto&szlig;en wurde, erhob sich und blickte auf den Leichnam seiner Freundin.\nInnerhalb kurzer Zeit, zwei seiner Freunde zu verlieren, war zu viel f&uuml;r ihn. Jarvan lie&szlig;\nseine Waffe voller Trauer fallen. Er wollte nicht mehr k&auml;mpfen. Die Armeen des Guten\nmussten mit ansehen, wie ihr Anf&uuml;hrer den Mut verlor und ihr Kampfeswille litt\ndarunter. Da die Moral der Soldaten aus Demacia, Ionia und Freljord auf einem Tiefpunkt\nwaren, dauerte es nicht lange, bis die Kreaturen der Leere die Oberhand gewannen.\nGerade als alle Hoffnung verloren schien, tauchte die ionische Verst&auml;rkungsflotte auf\nund begann mit ihrer Belagerung der noxischen Hauptstadt. Doch nicht nur das. &Uuml;ber\nden Bergen tauchte ein gewaltiges Luftschiff auf. Es waren die Yordle, die mit ihren\nHextech-Apperaturen in den Kampf einschritten. Durch ihre technische &Uuml;berlegenheit\nwar es ein Leichtes, die flugf&auml;higen Leerenkreaturen auszubremsen. Es dauerte nicht\nlange und im Himmel befanden sich nur die Yordle-Maschinen mit ihren knatternden\nMotoren unter der F&uuml;hrung von Corki. Nun flogen sie Angriffe auf die Bodentruppen des\nFeindes. Cho&acute;Gath war das alles zu viel. Obwohl er mit seiner Gr&ouml;&szlig;e leicht immer wieder\neinige Flieger zerst&ouml;rt hatte, wollte er sich nun zur&uuml;ckziehen. Als er sich umdrehte,\n&ouml;ffnete sich vor ihm ein Portal der Leere. Er freute sich &uuml;ber die Verst&auml;rkung, doch was\ndurch das Portal schritt, waren keine Truppen, sondern sein Verderben. Zuerst betraten\nShen, Akali und Kennen das Schlachtfeld. Sie sicherten die Umgebung und kurz darauf\nbetrat Mira erneut Valoran. Jarvan blickte auf und erkannte seine alte Begleiterin. Mira\nwar von dem Entsetzen auf dem Schlachtfeld zu tiefst ersch&uuml;ttert. Sie versp&uuml;rte eine\ngro&szlig;e Trauer in sich. Getrieben von dieser Trauer und von dem Zorn auf Cho&acute;Gath und\nseinesgleichen, erwachte die Runenenergie in ihr erneut zum Leben. Ihre gewaltigen\nEngelsfl&uuml;gel erschienen in nie dagewesener Pracht. Cho&acute;Gath &ouml;ffnete seine Augen weit\nvor Angst. Er kannte die Energie. Es war pure Runenenergie. Es war genau die Kraft,\nwegen welcher er Runeterra beherrschen wollte. Nun hatte sie sich erhoben, um ihn zu\nrichten.\nMira hob mit ihren gewaltigen Schwingen ab und stieg zu Cho&acute;Gaths Augenh&ouml;he auf. Sie\nsah tief in seine verdorbenen Augen, bevor sie mit ihrer Klinge zum Schlag ausholte. Es\ngab nur sie und Cho&acute;Gath. Die Schlacht um sie herum interessierte sie nicht. Jarvan hatte\nden Kampf wieder aufgenommen und f&uuml;hrte die Armeen des Lichts mit den\nVerst&auml;rkungstruppen charismatisch an. Mira schlug mit all ihrer Kraft zu. Ihre\nt&uuml;rkisleuchtenden Augen waren nur auf Cho&acute;Gath gerichtet. Ihre gl&auml;nzende Klinge fuhr\nauf Cho&acute;Gath nieder, der den Hieb mit einem seiner zus&auml;tzlichen Arme abwehrte. Doch\nMira lie&szlig; nicht nach. Immer wieder schlug sie gewaltvoll zu. Jeder ihrer Schl&auml;ge schien\nst&auml;rker und energiereicher als der vorherige zu sein. Mit jedem Hieb, der auf ihn eintraf,\nmusste Cho&acute;Gath einen Schritt zur&uuml;ckweichen. Mira landete vor Cho&acute;Gath, umfasste ihr\nSchwert mit beiden H&auml;nden und schlug mit ihrer gesamten Runenenergie einen Spalt in\ndie Luft selbst. Jarvan hatte solche Luftschnitte schon mehrmals gesehen, doch dieser\nstellte alles dagewesene in den Schatten. Miras Luftschnitt hatte die gewohnte,\nt&uuml;rkisene Farbe, doch die geballte Macht versuchte zu entweichen. Immer wieder\nschlugen leuchtende Blitze aus dem Luftschnitt, w&auml;hrend er auf Cho&acute;Gath zuraste. Dieser\nkonnte sich im letzten Augenblick unter dem Angriff hinwegducken, doch musste er\ndabei seine hinteren Arme einb&uuml;sen, die der Windschitt erwischte und abtrennte.\nCho&acute;Gath wusste, dass er keine Chance hatte. W&auml;hrend er seinen Dienern befahl, Mira\nanzugreifen, zog er sich hinter die Mauern der noxischen Hauptstadt zur&uuml;ck. Mira selbst\nverfolgte ihn nicht. Sie schloss sich den Truppen von Jarvan an. Durch den neuen\nKampfeswillen, den Jarvan und seine Truppen gefasst hatten, war der Kampf gegen die\nArmeen der Leere ein Leichtes. Miras pure Runenenergie konnte von jedem einzelnen\nSoldat gesp&uuml;rt werden und jeder, der ihre Kraft vernahm, wusste, dass Runeterra einer\nbesseren Zukunft bevorstand. Ihre engelsgleiche Erscheinung ermutigte jeden Krieger,\negal von wo er stammte, f&uuml;r diese bessere Zukunft zu k&auml;mpfen. Seite an Seite k&auml;mpften\nsie mit Mira um den Sieg. Monster f&uuml;r Monster zwangen die Streiter des Guten in die\nKnie. Die Armee von Cho&acute;Gath sah anfangs noch endlos aus, doch nach mehreren\nStunden stand die Schlacht ihrem Ende bevor. Mira und Jarvan streckten die beiden\nletzten Kreaturen der Leere nieder. Jetzt stand nur noch die noxische Stadtmauer\nzwischen Mira und Cho&acute;Gath. Sie wusste nicht wieso, doch sie sp&uuml;rte einen gewaltigten\nHass gegen Cho&acute;Gath, der weit &uuml;ber ihren gewohnten Zorn hinausging. Dieses Monster\ngriff nicht die Bev&ouml;lkerung von Valoran an, sondern es versuchte, die Welt an sich zu\nzerst&ouml;ren. Mira war ein Teil dieser Welt. Die Runenenergie, die in ihr floss, war die selbe\nEnergie, aus welcher Runeterra bestand. Sie und die Welt waren eins. Mira steckte ihre\nKlinge weg, faltete ihre H&auml;nde und begann zu beten. Ihre Fl&uuml;gel &ouml;ffneten sich zur vollen\nGr&ouml;&szlig;e. Mira kapselte sich von den Ereignissen ab. Sie h&ouml;rte Jarvan nicht, der den Befehl\nzur Belagerung von Noxus gab. Sie vernahm Shen nicht, der sich nach ihrem\nWohlergehen erkundigte. Sie sp&uuml;rte Varus nicht, der ihr seine Hand auf die Schulter\nlegte, um ihr Mut zuzusprechen. Mira war komplett in ihren Gedanken versunken. Vor\nihrem geistigen Auge lag eine gro&szlig;e Kammer. Ihr gegen&uuml;ber stand eine geisterhafte\nErscheinung. Dieses Wesen leuchtete in einem t&uuml;rkisfarbenen Ton. Es blickte Mira tief in\ndie Augen. Mira selbst war wieder zu ihrer menschlichen Gestalt zur&uuml;ckgekehrt. Der\ngeisterhafte Engel sprach mit ruhiger Stimme zu Mira: &bdquo;Hallo. Ich wohne jetzt schon seit\nbeinahe achtzehn Jahren in deinem K&ouml;rper. Einst wurde ich hierher gebracht, um diese\nWelt von den Schrecken der Runenkriege zu heilen. Damals wollte ich dies nicht. Ich\nwollte frei sein. Mich k&uuml;mmerten die Wesen dieser Welt nicht. Doch ich habe dein Leben\nverfolgt. Ich habe dir immer mit meiner Macht geholfen, sofern ich es konnte. Mira, du\nhast mich inspiriert. Du kennst all diese Menschen nicht und doch gibst du alles, um\nihnen zu helfen. Ich werde es dir nun gleich tun. Ich werde dieser Welt helfen. Ein letztes\nMal muss ich dich um einen Gefallen bitten. Gib mir die Kontrolle &uuml;ber deinen K&ouml;rper.&ldquo;.\nDem astralen Engel rollte eine Tr&auml;ne &uuml;ber die Wange und Mira sp&uuml;rte, wie auch ihr eine\nTr&auml;ne aus dem linken Auge entwich. Gleichzeitig ber&uuml;hrten die beiden Tr&auml;nen den Boden\nund erzeugten kleine Wellen im Boden, fast so, als h&auml;tte man einen Stein in einen See\ngeworfen. Mira sp&uuml;rte, dass sie mit diesem Wesen verbunden war. Es musste der Geist\nsein, von dem der alter Beschw&ouml;rer in Demacia geredet hat. Dieser Engel war der Grund,\nwarum sie diese Kr&auml;fte hatte. Die Beschw&ouml;rer hatten ihm den Namen M.I.R.A. gegeben.\nMira kam auf den geisterhaften Engel zu, der ihre Bewegung identisch kopierte. Mit\njedem Schritt, den Mira tat, tat es ihr der Engel gleich. Als sie sich direkt\ngegen&uuml;berstanden, umarmte Mira den Engel und gab ihm so ihren K&ouml;rper preis. Mira\nerwachte aus ihrer Trance. Jarvans Armee k&auml;mpfte bereits in der noxischen Stadt. Mira\ngab sich ihrem geisterhaften Begleiter hin. Pure Runenmagie durchstr&ouml;mte sie. Eine\ngewaltige Schockwelle durchstie&szlig; ganz Valoran. Jedes Wesen sp&uuml;rte es. Mira\nverwandelte sich vollst&auml;ndig in den Geist. Ihre K&ouml;rper verlor jegliche Materie. Ihr\nkompletter K&ouml;rper bestand aus pulsierender Energie. Jeder Krieger in Noxus unterbrach\nden Kampf. Sie alle blickten in die Richtung, aus der die Energie kam. Sie konnten ihren\nAugen nicht trauen. Der Engel schoss mit wahnsinniger Geschwindigkeit auf die Stadt zu.\nEr ignorierte jeden feindlichen Soldaten und st&uuml;rmte stattdessen auf den Thronsaal zu.\nAls geisterhafte Erscheinung war es Mira nun m&ouml;glich, durch W&auml;nde zu schreiten und so\nstand sie wenige Augenblicke sp&auml;ter im Thronsaal von Swain. Neben Swain war nur noch\nCho&acute;Gath in dem Raum und das Portal zur Leere, welches von Swain ge&ouml;ffnet wurde.\nCho&acute;Gath und Swain beratschlagten ihre letzten, verzweifelten Bem&uuml;hungen, um die\nNiederlage abzuwenden. Schlie&szlig;lich bemerkte Swain den Eindringling und machte Cho\n&acute;Gath auf Mira aufmerksam.\nSwain und Cho&acute;Gath wollten sich dem Engel gemeinsam stellen. Es war ihre letzte\nChance, den Krieg zu gewinnen. Die beiden Anf&uuml;hrer stellten sich Mira gegen&uuml;ber. Mira,\ndie sich immer noch in geisterhafter Form befand, zog ihr Schwert. Ihre Klinge hatte sich\nmit ihrer Besitzerin ver&auml;ndert. Das eigentlich Schwert war kaum noch zu erkennen. Es\nhandelte sich eher um eine Flamme, die in einem hellen, t&uuml;rkisfarbenen Feuer brannte.\nSwain und Cho&acute;Gath griffen gemeinsam an, um Mira schnell und unkompliziert zu\nbesiegen, doch Miras Schnelligkeit war noch gewaltiger als gewohnt. Da sie sich\nvollkommen dem Geist in ihr hingegebenn hatte, verf&uuml;gte sie &uuml;ber all dessen Kr&auml;fte.\nMira bewegte sich so schnell, dass es f&uuml;r Swain und Cho&acute;Gath so aussah, als w&uuml;rde sich\nMira teleportieren. Cho&acute;Gath erkannte, dass er nie eine Chance haben w&uuml;rde und wollte\ndurch das Leerenportal fl&uuml;chten. Mira tauchte jedoch vor dem Portal auf und\nverhinderte Cho&acute;Gaths Flucht. Was nun geschah, lie&szlig; Cho&acute;Gaths Hoffnung auf einen Sieg\nkomplett verschwinden. Mira schnitt mit ihrem Schwert das Portal in zwei H&auml;lften. Die\npure Runenenergie, die durch ihre Klinge floss, st&ouml;rte die Pr&auml;sens des Portales so sehr,\ndass dieses kurz darauf zusammenbrach. Das war das erste Mal, dass jemand ein\ndauerhaft ge&ouml;ffnetes Leerenportal schloss. Nachdem Mira jede Flucht verhindert hatte,\nwar nun die Zeit gekommen, jene zu bestrafen, die Valoran und ganz Runeterra in den\nAbgrund gesto&szlig;en hatten. Zuerst widmete sich Mira dem Kind der Leere zu. Swain\nnutzte diese Chance und versuchte durch den Eingang des Thronsaals zu fliehen. Als er\ndie T&uuml;r &ouml;ffnete, blickte er in die Augen von Jarvan. Die Soldaten aus Demacia, Ionia,\nFreljord und die der Yordle hatten die Stadt komplett erobert. Swain war umstellt und\nJarvan richtete seine Lanze auf den &uuml;berraschten gro&szlig;en General. &bdquo;Swain, f&uuml;r deine\nVerbrechen gegen die Bewohner von Valoran und gegen das Leben selbst, wirst du\nhiermit festgenommen und einem demacianischen Gericht vorgef&uuml;hrt!&ldquo;, schrie Jarvan\nund wies seine Soldaten an, den besiegten Swain in Ketten zu legen.\nAls Jarvan das Innere des Thronsaals betrat, lag Cho&acute;Gath bereits besiegt auf dem\nBoden. Der geisterhafte Engel, der einst in Mira wohnte, hatte sich von Mira getrennt.\nMira selbst lag auf dem Boden und schlief. Der Geist blickte in Jarvans Augen und sprach:\n&bdquo;Junger K&ouml;nig. Ich werde daf&uuml;r sorgen, dass Runeterra eine zweite Chance erh&auml;lt. F&uuml;hre\ndein Volk in eine bessere Zukunft! Pass auf Mira auf!&ldquo;. Mit diesen Worten l&ouml;ste sich der\nGeist auf und stie&szlig; seine Energie tief in das Innere der Welt. &Uuml;berall in Runeterra\nsp&uuml;rten es die Lebewesen. Die Runenenergie kehrte zur&uuml;ck. Die L&auml;nder s&uuml;dlich der\ngro&szlig;en Barriere erholten sich von den Verw&uuml;stungen der Runenkriege. Alle Portale, die\nin die Leere f&uuml;hrten, schlossen sich und Runeterra bl&uuml;hte erneut in dem Glanz auf, den\nes vor dem ersten Runenkrieg aufwies. Der Geist hatte sein Schicksal erf&uuml;llt. Er hatte sich\ngeopfert, um Tausende zu retten. An der Stelle, an der der Geist gestanden hatte, bl&uuml;hte\neine wundersch&ouml;ne Blume, auf deren Bl&uuml;te ein kleiner t&uuml;rkisfarbener Schmetterling sa&szlig;.\nJarvan ging an der Blume vorbei, kniete neben Mira nieder und hob sie auf. Mira &ouml;ffnete\nblinzelnd ihre Augen, blickte in das Gesicht von Jarvan und fragte: &bdquo;Ich sp&uuml;re meine Kraft\nnicht mehr. Ist es vorbei?&ldquo;. Jarvan nickte und zeigte Mira die Blume des Geistes. Der\nSchmetterling hob ab, umflog Miras Gesicht und verschwand dann. Mira sp&uuml;rte, was der\nGeist getan hatte. Sie pfl&uuml;ckte die Blume und steckte sie sich in ihr Haar. Zusammen mit\nJarvan trat sie aus dem Thronsaal hervor und erkannte, dass die Welt wiedergeboren\nwurde. Runeterra erstrahlte in neuem Glanz. Jarvan legte seinen Arm um Mira und\nfl&uuml;sterte: &bdquo;Lass uns nach Hause gehen!&ldquo;.\n\nMitwirkende und &bdquo;Special Thanks&ldquo;\nAutor\nUrashiru\nFehlersuche\nUrashiru\nKaraliah\nVayunmay (ehemalig M&ouml;&Ouml;pMpNsTaA)\nTitelbild\nVayunmay (ehemalig M&ouml;&Ouml;pMpNsTaA)\nHerzlichen Dank an\nRiot Games (f&uuml;r dieses gro&szlig;artige Spiel und die Geschichte dahinter)\nVayunmay (ehemalig M&ouml;&Ouml;pMpNsTaA) (f&uuml;r deine moralische Unterst&uuml;tzung &hearts;)\nKaraliah (f&uuml;r deine Tipps und dein &bdquo;Fachwissen&ldquo; &uuml;ber die Champions)\nWeiter bedanken m&ouml;chte ich mich bei\nxInRagex (f&uuml;r dein offenes Ohr)\nAnimalyps (f&uuml;r dein offenes Ohr)\nVielen Dank, dass du diese Geschichte gelesen hast und ich hoffe, sie hat dir\nwenigstens ein bisschen gefallen.","replies":[{"poster":"Ranked in S9 lul","date":"2016-05-27T11:43:05.634+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Urashiru","date":"2016-05-27T14:06:08.220+0000","up_votes":2,"down_votes":0,"body":"Danke dir :) Wow in einer Stunde? Ich nehme mal an dass du echt schnell liest :D {{summoner:6}}","replies":[]}]},{"poster":"KAWAII BAAAKA","date":"2016-05-27T11:23:25.650+0000","up_votes":2,"down_votes":0,"body":"Das ist mit Abstand der grsste Forum Post den ich jemals gesehen habe O.O ..............\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Urashiru","date":"2016-05-27T14:06:38.413+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"zZjQhDaphne","date":"2016-05-27T16:53:27.628+0000","up_votes":1,"down_votes":0,"body":"Wow, einfach nur RESPEKT dafr! Eine tolle Geschichte :) {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Urashiru","date":"2016-05-27T17:56:00.025+0000","up_votes":1,"down_votes":0,"body":"Danke dir :)","replies":[]}]}]}