{"poster":"SmartenLasVegas","date":"2015-07-21T18:55:01.462+0000","title":"Anregungen für einen Lux-Championupdate","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Hallo, ich bin sehr gro&szlig;er Lux{{champion:99}}  Fan, aber leider ist sie doch im Spiel eher schwach. Gerade gegen die ganzen Tanks neuerdings ist sie machtlos. Sie wird selten gespielt und auch in der LCS ein nicht zu sehender Champion.\r\n\r\nGanz klar, sie ist sehr squischi und hat kaum Mobilit&auml;t. Daher w&uuml;rde ich vorschlagen, dass Schild von Lux so zu gestallten, dass man im Maximum des Bumerang erneut W dr&uuml;cken kann um sich an diese Stelle zu teleportieren. Lux h&auml;tte somit die M&ouml;glichkeit sich super neu zu positionieren, zb. sich hinter ihr Team zu stellen und es dabei noch zu buffen. Es w&uuml;rde Lux wahnsinnig mobil machen und den Spielspa&szlig; vergr&ouml;&szlig;ern ohne gro&szlig;artig an ihrem Typ etwas zu ver&auml;ndern.\r\n\r\nDie range des Bumerangs und die Cooldown-Zeit m&uuml;ssten jedoch angepasst werden.\r\n\r\nMit den besten Gr&uuml;&szlig;en\r\nSmarten Las Vegas","replies":[{"poster":"OrangeBubble","date":"2015-07-22T08:37:36.178+0000","up_votes":1,"down_votes":0,"body":"Ich wünsche mir einfach nur, dass ich wie bei anderen Mage mit E die Wave clearen kann. Das wird aber nie passieren, weil sie ihre Passive hat. :C\n\nGenerell finde ich es unlogisch, dass ein Long Range Laser Sniper so eine Passive hat. Sie muss in AttackRange rennen, um das Maximum von ihren DMG raus zu holen. Ihr Ult mag ihre massive proccen, aber einmal Passive geht flöten dann :P","replies":[{"poster":"Evenrider","date":"2015-07-22T08:48:00.445+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OrangeBubble,realm=EUW,application-id=Wj1wcocU,discussion-id=jFtqGzEn,comment-id=0003,timestamp=2015-07-22T08:37:36.178+0000)\n>\n> Ich wünsche mir einfach nur, dass ich wie bei anderen Mage mit E die Wave clearen kann. Das wird aber nie passieren, weil sie ihre Passive hat. :C\n> \n> Generell finde ich es unlogisch, dass ein Long Range Laser Sniper so eine Passive hat. Sie muss in AttackRange rennen, um das Maximum von ihren DMG raus zu holen. Ihr Ult mag ihre massive proccen, aber einmal Passive geht flöten dann :P\n\nIch glaube man hat ihr Absichtlich so eine Passive gegeben, genauso wie bei Ziggs, damit sie nicht durchgehend aus Reichweiten feuert, die kein Garen jemals zuvor gesehen hat.","replies":[{"poster":"OrangeBubble","date":"2015-07-22T09:57:15.484+0000","up_votes":1,"down_votes":0,"body":"Ja, ok das macht Sinn :/","replies":[]}]}]},{"poster":"hshtagniemehrcdu","date":"2015-07-21T21:16:39.684+0000","up_votes":1,"down_votes":0,"body":"Ihre Schwäche ist ihre Passive.\nWenn du sie nicht auslösen kannst, ist dein Poke nur halb so stark, und damit meilenweit hinter anderen Poke-Mages,\nund ist daher keine Alternative im Profi-Bereich.\nDas musst du ändern, dann wird man sie auch in der LCS sehen.\nAuch andere immobile Poke Champs aka Xerath, Kog werden gespielt.#\n\nEdit: Dein Change würde sie ABARTIG OP machen...","replies":[]},{"poster":"Stiv1234","date":"2015-07-21T19:27:09.830+0000","up_votes":1,"down_votes":0,"body":"Viiiiiiiel zu OP. Lux ist ein Magier mit sehr hoher Reichweite, ein Sniper sozusagen. Dass sie keine Mobility hat, ist ihre Kernschwäche und wenn du ihr die nimmst, musst du ihr woanders welche geben oder ihr ihre Stärken wegnehmen. Das wäre ungefähr so, als ob du LeBlanc AoE Schaden auf allen Fähigkeiten gibst und ihre Cooldowns halbierst.","replies":[]},{"poster":"MissGremlin","date":"2015-07-21T19:21:38.614+0000","up_votes":1,"down_votes":0,"body":"Finde die Idee echt gut, des würde mich als Lux Fan voll freuen {{champion:99}}","replies":[]}]}