{"poster":"Awsane","date":"2018-09-14T00:06:23.052+0000","title":"Frage zu Midlane Roams","subforum":"Level Up: Guides & Tipps","up_votes":2,"down_votes":0,"body":"Aloha\r\n\r\nIch habe eine Frage zu folgender Situation.\r\nIch spiele Midlane einen Controlmage wie Ori gegen nen Nahkampf Assassinen wie Akalie oder Fizz. Nun gewinne ich das early und habe nen CS lead und mein Gegner ist low und wird so dazu gezwungen Base zu gehen oder ich kille ihn sogar. Soweit so gut.\r\n\r\nMir ist es jetzt wirklich oft passiert, dass ich dann die Lange reinpushe und dann selber Base gehe. Mein Gegner kommt dadurch etwas fr&uuml;her auf die Lane pusht die Wave und geht roamen und bekommt selbst wenn ich Miss Pinge oft nen Erfolg, weil er zum Beispiel mit dem Jungler dann Botlane dived. Was dann stark das ganze Spiel oft snowballed, weil die dann den Turm und Drake nehmen.\r\n\r\nWas kann ich da besser machen, bzw wo ist da mein Fehler? Weil solche Situationen passieren mir nicht nur in Soloq sondern auch im Teamranked. ( Da sterben vllt nicht meine Leute aber die Gegner bekommen dann free nen Turm oder so )\r\n\r\nSoll ich die Lane nicht reinpuschen? Weil nur so k&ouml;nnte ich Base um zeitgleich mit meinem Gegner auf der Lane zu sein. Sollte ich gar nicht Base? Das ist ja oft der 1. Base sprich ich w&auml;re danach mMn sehr verwundbar ( wenig Mana und Itemnachteil) \r\n\r\nSoll ich versuchen sp&auml;t den roam zu folgen? Meiner Erfahrung nach ist man als Kontrolle N&auml;he im River auch mit nen Vorteil sehr verwundbar gegen Assassinen gerade wenn man wenig Vision hat ( durch das Base sind die waeds ja oft ausgelaufen, zudem Brauch man die ja auch vorher um save Druck machen zu k&ouml;nnen auf der Lane). Zudem wenn ich sp&auml;ter roame bin ich oft auch einfach zu sp&auml;t auf der anderen Lane und das play ist schon passiert.\r\n\r\nIch bin da gerade echt ratlos. Hoffe ihr k&ouml;nnt mir helfen. LG Awsane.","replies":[{"poster":"Flat is Just1ce","date":"2018-09-22T06:49:45.853+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Awsane,realm=EUW,application-id=vatevpvi,discussion-id=iZWAQ7pd,comment-id=,timestamp=2018-09-14T00:06:23.052+0000)\n>\n> Aloha\n> \n> Ich habe eine Frage zu folgender Situation.\n> Ich spiele Midlane einen Controlmage wie Ori gegen nen Nahkampf Assassinen wie Akalie oder Fizz. Nun gewinne ich das early und habe nen CS lead und mein Gegner ist low und wird so dazu gezwungen Base zu gehen oder ich kille ihn sogar. Soweit so gut.\n> \n> Mir ist es jetzt wirklich oft passiert, dass ich dann die Lange reinpushe und dann selber Base gehe. Mein Gegner kommt dadurch etwas früher auf die Lane pusht die Wave und geht roamen und bekommt selbst wenn ich Miss Pinge oft nen Erfolg, weil er zum Beispiel mit dem Jungler dann Botlane dived. Was dann stark das ganze Spiel oft snowballed, weil die dann den Turm und Drake nehmen.\n> \n> Was kann ich da besser machen, bzw wo ist da mein Fehler? \n\nIn der Solo-Q kannst du da relativ wenig machen außer vor dem Resetten einen Ward auf der Midlane zu platzieren damit du siehst ob der Midlaner Top oder Bot roamt, diese Lane anschließend spampingen und beten, dass diese dann nicht intet. \nIm Teamenviroment geht das alles natürlich etwas leichter und vor allem besser. Du platzierst weiterhin einen Ward in der Lane und sagst deinem Jungler, dass er around Midlane sein soll und das deine Lanes erstmal \"save\" spielen sollen während du nicht auf der Lane bist. Bist du dann wieder auf der Lane, dann pusht du natürlich erst einmal gegen und dann gibt es erst einmal grundlegende 4 Möglichkeiten (Ich geh mal davon aus, dass du sowas wie Wavemanagement verstanden und drauf hast):\n\nDie erste Möglichkeit ist, dass der gegnerische Midlaner geht mit dem gegnerischen Jungler Botlane ganken. In diesem Fall gehst du mit deinem Jungler im Gepäck Toplane ganken und nimmst den Tower oder Herald. \n\nZweitens der gegnerische Midlaner geht mit dem gegnerischen Jungler Toplane ganken. In diesem Fall gehst du mit deinem Jungler im Gepäck Botlane ganken und nimmst den Drake oder Tower.\n\nOb man den Drake/Herold oder den Tower nimmt muss man natürlich abwägen. Kommt halt immer auf euren Playstyle und eure Comb drauf an.\nHabt ihr nach dem Gank relativ wenig Sums und Ultis benutzt und der Gegner hat im Gegenzug alles geblowed, dann ist es häufig besser das neutrale Objekt zu nehmen, denn ihr könnt danach resetten und mit eurem Ulti/Sums-Vorteil die Lane einfach noch einmal ganken. So bekommt ihr zu dem eigentlichen Kills aus dem ersten Gank, dem neutralen Objekt und dem Tower weitere Kills aus dem zweiten Gank, den es unter Umständen gar nicht gegeben hätte, da sich die gegnerische Botlane/Toplane nach dem Towerverlust gar nicht so weit rausgetraut hätte. Dies Vorgehensweise empfiehlt sich meiner Meinung nach wenn man das Goldincome auf bestimmten Spieler/Positionen maximieren will ohne groß etwas zu riskieren.\nNimmt man zuerst den Tower, dann muss man halt ein besonders schnelles Tempo an den Tag legen und dieses auch bis zum Finish hochalten. Wenn einer in dieser Zeit in den Autopilotmodus geht, dann kann das Game ganz schnell mal weggeworfen werden, da dieser Playstyle sehr force-lastig sind und kleinste Fehler extrem einfach bestraft werden können.\n   \nDrittens der gegnerische Midlaner geht mit dem gegnerischen Jungler Toplane oder Botlane ganken. In diesem Fall pusht du mit deinem Jungler im Gepäck den Midlane Tower.\n \nViertens der gegnerische Midlaner nimmt die von dir gepushte Wave an und es passiert nichts.","replies":[]},{"poster":"MVP Bot","date":"2018-09-15T16:47:10.072+0000","up_votes":1,"down_votes":0,"body":"Es gibt verschiedene Möglichkeiten:\n\nVariante 1:\n1. Die Wave vor dem Cannonminion  so schnell wie möglich einpushen\n2. Schnellst möglich in die Base porten\n3. Zurück auf die Lane gehen\n\nHier wird der Gegner die 1. Wave unter dem Tower abfarmen, dannach gibt es 2 Möglichkeiten\n1. Er farmt die 2. Wave mit dem Cannonminion\n2. Er geht auch in die Base\n\nBei 1: Du verlierst nur 1-2 Minions, weil der Gegner länger brauch um die 2.Wave mit Cannonminion zu clearn. Außerdem tankt das gegnerische Cannonminion 7-8 Towershots\n\nIn beiden Fällen bist du, zuerst auf der Lane und kannst die Wave wieder unter den Tower pushen und dannach warden oder einen roam startem\n\n\n\nVariante 2:\n1. Der Gegner geht in die Base\n2. Du puscht so schnell wie möglich\n3. (Falls vorhanden, einen Ward auf die Lane stellen, möglichst nah am gegnerischen Tower. Tower darf das Ward nicht aufdecken)\n4. Du gehst auch schnellst möglich in die Base\n5. Du beobachstest deinen Gegner was er macht nach dem er die Wave eingepuscht hat. Durch das offensive Ward siehst du auf welche Seite er roamt.\n6. Deinen Mates durch Pings warnen\n7. Die Wave unter deinem Tower farmen\n\n8. Jetzt gibt es 2 Möglichkeiten:\n- Du kannst deinem Gegner folgen (Ich empehle den defensiven Weg duch deinen Jungle\n- Nächste Wave auch einpushen, damit der Gegner CS/XP verliert\n\n\nMan muss dann halt situationsbedingt handeln.","replies":[{"poster":"Awsane","date":"2018-09-15T17:00:37.880+0000","up_votes":1,"down_votes":0,"body":"Erstmal Danke. Die Kanone zu berücksichtigen hilft auf jeden Fall sehr.\n\nVariante 2 ist ja das was ich mache und womit ich Probleme habe, weil in meinem Games dieser eine Roam den Gegner sehr oft (vllt hatte ich auch einfach Pech) stark ins Rollen gebracht hat. Sprich mein laner roamt mit dem Jgler gemeinsam Bot und divt die oder im Teamranked forct meine Botlane vom Turm weg, sodass da der 1. Turmkill stattfindet. Das ist ja gerade das Scenario, was ich vermeiden will :D.\n\nIm Teamranked wissen meine Mates ja, dass der kommt, aber was sollen die denn bitte mache. Nen 4v2 können die einfach nicht gewinnen. Und for free den Turm aufgeben ist bestimmt auch nicht die richtige Idee.","replies":[]}]},{"poster":"Necromant","date":"2018-09-14T06:28:37.477+0000","up_votes":1,"down_votes":0,"body":"Wenn er früher als du auf die Lane kommst, dann solltest du den Deathtimer im Auge behalten, schauen wo kommt die nächste Wave (das erkennst du auch ganz gut daran, wo deine eigene nächste Wave aktuell ist) und musst dir die Fragen stellen, kann ich reinpushen in der Zeit UND schaff ich es wieder rechtzeitig auf die Lane? Wenn nicht, dann resette die Lane mitte wenn du kannst. Klar ist es schöner den Gegner weiter behind zu bekommen, indem du Ihn CS deniest durchs pushen aber das ist nicht immer sinnvoll, wenn du danach eigene Nachteile hast.\n\nZiel von dir als Controllmage ist es, pressure auf die Lane zu bringen aber auch einen Gank zu setup'en da du viel CC mitbringst, da ich Wavemanagement sehr wichtig. Willst du pressure bringen und deinen Gegner (in dem Bsp. Assasine) bisschen Farm denien, dann pushst du natürlich rein und er wird nicht alle Minions unterm Tower bekommen, aber obacht, du bist dann natürlich Gankanfällig. Willst du z.B. einen Gank setup'en dann spiel ne kurze Lane, das heißt, lass dich bisschen rein pushen aber so, das die Minions nicht unter deinem Tower enden.\nEine Möglichkeit wäre es auch, rein zu pushen und roamen zu gehen, imprinzip das gleiche was deine Akali gemacht hat, nur hast du als Ori den nachteil nicht ganz so flott unterwegs zu sein.\n\nIch bin selbst kein midlaner tbh, daher kann ich dir nur bedingt Tipps geben. Ich würde dir aber raten dich mal auf Youtube mit Stichpunkt Wavemanagement, Trading und Roaming zu befassen.","replies":[{"poster":"4 For Maggie","date":"2018-09-14T07:28:24.916+0000","up_votes":1,"down_votes":1,"body":">  nur hast du als Ori den nachteil nicht ganz so flott unterwegs zu sein.\n\nHat die neue Akali irgend einen Movementspeed Boost bekommen? Oder allgemein höheres Movement?\n\nAn sich wäre ich davon ausgegangen das Ori schneller ist weil sie, zumindest je nach Cooldown, ihren eigenen Speedbuff benutzen kann um das ablaufen der Strecke zu verkürzen. Einmal kann sie sich definitiv speeden und eventuell klappt es auch ein zweites Mal.","replies":[{"poster":"Necromant","date":"2018-09-14T07:32:04.794+0000","up_votes":1,"down_votes":0,"body":"Akali MVSP: 345 ( http://leagueoflegends.wikia.com/wiki/Akali )\nOri MVSP: 325 ( http://leagueoflegends.wikia.com/wiki/Orianna )\n\nUnd da wo sich Ori selbst speedbufft, kann Akali dashen ;)\nAssasins haben meist n höheres Lauftempo als Mages.","replies":[{"poster":"4 For Maggie","date":"2018-09-14T08:40:31.359+0000","up_votes":1,"down_votes":1,"body":"mhm mhm ich verstehe.\n\nStimmt, dieser eine neue Akali Skill kann auch benutzt werden um über eine Wand zu hüpfen was natürlich auch nochmal eine Verkürzung des Weges sein kann. Aber ich denke trotzdem das die beiden rein Speed technisch wenn dann fast gleich auf sind. Eine Akali wird ja auch eher über den Fluss kommen wenn die Botlane rein pusht oder sich mittig aufhält, da braucht sie nirgends drüber dashen weswegen das weg fallen würde. Und wenn eine Ori hinter dem Dragonpit her läuft kommt es fast auf's selbe raus .. Kann ja auch sein das die Akali sich verläuft","replies":[{"poster":"Necromant","date":"2018-09-14T08:43:56.140+0000","up_votes":1,"down_votes":0,"body":"Nächster Punkt ist auch, das ein Controllmage einem Assasine nicht einfach blind folgen kann. Könnte dazuführen das die Ori einfach in die Akali rein läuft und das will ne Ori nicht unbedingt.","replies":[{"poster":"4 For Maggie","date":"2018-09-14T09:03:50.253+0000","up_votes":1,"down_votes":1,"body":"Vielleicht lässt du die Ori einfach selbst entscheiden was sie will :o","replies":[{"poster":"Necromant","date":"2018-09-14T09:05:41.136+0000","up_votes":1,"down_votes":0,"body":"Nö :P ist einfach n Fakt das Assasins mobiler sind als die meisten Chars, sonst wären es keine Assasins :)","replies":[{"poster":"Awsane","date":"2018-09-14T09:37:21.431+0000","up_votes":1,"down_votes":0,"body":"Also wenn ich die Ori bin, laufe ich potentiell ungern einer Akalie hinterher, auch wenn ich nen Vorteil habe, einfach weil die das 1v1 im River viel einfacher gewinnt als ich, wenn sie mir da auflauert.\n\nZudem ist der Roam von Ori, gerade wenn er spät hinter nen Gegner kommt eher selten gut.\n\nDaher würde ich Necro einfach mal was das angeht zustimmen","replies":[]}]}]}]}]}]}]}]},{"poster":"angebah","date":"2018-09-14T07:10:28.472+0000","up_votes":1,"down_votes":1,"body":"ich denke eher das es dann an deinen team mates liegt , es wäre eine idee sich pre mates zu suchen mit denen du im ts bist oder skypest! denn wenn die bei einem missping oder einem call über ts unterm tower bleiben  kannst du die lane weiter pushen und bot misst nur wenig farm . Also am besten muss die bot lane save spielen oder du movest mit deinem laner auf die bot lane und kannst vielleicht noch den ein oder anderen kill holen\n\nWenn du bot lane mate brauchst kannst du auch mich gerne adden da ich eine stabile bot lane in meinem clan hab, ich heiße : Angxbah","replies":[{"poster":"Awsane","date":"2018-09-14T08:38:15.218+0000","up_votes":1,"down_votes":0,"body":"Ne danke. Ich habe ein Team und da haben wir auch ähnlich Probleme. Weil direkt der Jgler mitkommt. meine Leute sterben eher selten aber wir verlieren dann den Turm. Aber ealry können die kein 2v4 nehmen.","replies":[]}]}]}