{"poster":"Awsane","date":"2016-04-12T18:36:41.976+0000","title":"Darf man (grobe) Fahrlässigkeit reporten","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":2,"body":"Aloha\r\n\r\nich wollte fragen ob (grobe) Fahrl&auml;ssigkeit ein gerechtfertigter Report Grund ist\r\n\r\nich will jetzt garnicht irgendwelche Beispiele nennen, weil das ja immer Situationsbedingt ist\r\naber generell etwas wo jemand fahrl&auml;ssig handelt (ich meine jetzt aber nicht ingame fehler) sonder Sachen die um das Spiel drumm herum passieren \r\n(Champ selection als ein part und die Spielvorbereitung als Beispiel) und dabei einen Fehler macht der das ganze Team schon von Anfang an hart nach hinten bringt, bevor das Spiel &uuml;berhaupt angefangen hat\r\n\r\nweil wenn z.b. trotz dessen Spielt, dass man regelm&auml;&szlig;ige dc&acute;s hat und deswegen afk ist, bekommt man ja auch eine Sperre und das ist ja ein Ban aufgrund von Fahrl&auml;ssigen handeln mit der folge, das man nicht da ist\r\n\r\noder f&auml;llt sowas noch unter die bad Player also nicht reportw&uuml;rdig regel?\r\n\r\nLG Awsane","replies":[{"poster":"Doo ","date":"2016-04-12T20:51:58.239+0000","up_votes":1,"down_votes":0,"body":"Es kann jedem passieren das man mal in einem game dc's hat. Es gibt 1000 verschiedene Gründe warum so etwas passieren kann. \nEs ist reportwürdig wenn jemand mit Absicht AFK geht und es dann auch noch ankündigt. Aber es kann immer wieder passieren das jemand mal laggs und wirklich nichts dafür kann..","replies":[{"poster":"Knightofthedawn1","date":"2016-04-13T15:29:30.818+0000","up_votes":1,"down_votes":0,"body":"Naja,DC sollte man finde ich erstmal immer reporten.Ja,es kann viele Gründe geben,warum jemand nen DC hat.Deswegen sag ich auch immer denen,die sich über sowas mit Beleidigungen aufregen,das es vielleicht nen Grund dafür haben kann,wie zum Beispiel plötzliche Migräne.Jedoch reporte ich trotzdem solche Leute,denn man weis nie die Gründe warum so etwas passiert ist und wenn dann jemand sagt:\"sorry,have to go,my girls travails started.\"Wie kann ich da sicher sein das es stimmt?Er kann auch einfach nur plötzlich keine Lust auf LOL haben und hofft mit seiner Ausrede darauf nicht reported zu werden.","replies":[]}]},{"poster":"Knightofthedawn1","date":"2016-04-12T20:26:15.285+0000","up_votes":1,"down_votes":0,"body":"Naja,erstmal ist dein Beispiel nicht sonderlich präzise.Was genau du jetzt als Beispiel meinst,wird mir nicht ersichtlich.\n\nIch kann mir nur vorstellen das du sowas meinst wie wenn 3 AD Champs gepickt werden.\nGenau,man muss dann den dritten,der einen AD Champ picken will dazu zwingen AP zu spielen.Man wollte mich schin mehrfach dazu zwingen AP auf der Mid zu spielen aber warum muss ich der sein der den kürzeren ziehen muss?Nur weil es sowas wie ne Meta gibt...etwas was komplett sinnlos ist.\n\nBzw. kann ich mir vorstellen,das du Picks allgemein meinst die nicht in der Meta sind,bzw. in dieser Art so nicht gespielt werden.\nTut mir leid aber ich bin Zac Support (bzw. überall) Main mit ner eigentlich sehr guten Winrate (letzte Season 72%) aber wenn ich ihn ja schon picke handle ich ja,so wie ich das zumindest verstehe,fahrlässig.\n\nWas ich mir sonst noch vorstellen kann ist das falsche wählen von Summoner Spells,Masteries und Runen.\nAuch wenn Masteries aktuell so mit das wichtigste in LOL sind,glaube ich wohl kaum das es in deiner Elo dadurch entschieden wird das du Deathfire Touch anstatt Thunderloards hast.Jeder Spieler kann mal ausversehen die falschen Sachen haben.Ich weis nicht wer erst letztens in der NA LCS Ryze mit Grasp gespielt hat aber selbst da passiert sowas.\n\nFalls das jetzt nicht die Situationen waren,die du meintest,dann schreib sie nochmal genauer.","replies":[{"poster":"Awsane","date":"2016-04-12T22:56:29.625+0000","up_votes":1,"down_votes":0,"body":"aloha\nich hatte eher an Situationen gedacht, in  denen eine Person durch eine andere 3. Person direkt geschädigt wird\nz.b. indem eine Person in der dyn q. einer anderen Person die lane weg pickt, nichtmal unbedingt beabsichtigt, aber ich hatte in letzter zeit recht häufig leute dabei, die während des bannes und picken rausgetabt waren, reintabben wenn der Sound kommt und sich dann vertun in dem was ihre rolle ist oder bei anderen Sachen \n\noder aber wenn man vereinbarrt man swap, aber  der gegenpaart vergisst es und es kommt zu keinen tausch (bei dem dann ggf sogar beide falsche runen und masteries haben)\n\nwie gesagt ich spreche hier von unbeabsichtigten Sachen kein intentional troll\noder aber man einigt sich auf neue rollen und der jgler vergisst smite obwohl man es ihm im Chat noch sagt\n\nes geht mir um die Situation, dass einfach leute nicht aufpassen während dieser zeit und dadurch chaos entsteht, ob sowas Report würdig ist oder nicht\n\nwenn es jemand nur 1 mal macht isses ja nicht schlimm, kann ja jeden passieren, aber diejenigen denen das häufiger passiert (wenn es sie denn geben sollte)\n\nich hatte auch kein konkretes Beispiel in meinen letzten spielen oder so, die frage hat sich einfach aus einer Diskussion ergeben mit freunden die nicht geklärt wurde\n\nweil in den meisten ländern ist sowas ja strafbar (also Fahrlässigkeit, wenn es zu schaden kommt)\n\nnatürlich will ich hier auch nicht päpstlicher sein als der papst und das hier ist ein spiel das spass machen soll\nes geht mir nur darum, ob es im summener code einer strafe würdig wäre oder nicht ich weiss es nämlich nicht und würde es gerne wissen\n\nich will ja auch nicht einen bann für irgendwelche leute, allein eine Nachricht, dass das verhalten nicht in Ordnung wäre würde ja reichen (wenn es denn leute gibt denen sowas häufiger passiert und sowas überhaupt eine strafe ist)\n\ndenn im summener code ist sowas nicht direkt geklärt\nes steht halt drinnen, dass du deinen Mitspielern den spass am spiel nicht nehmen sollst\naber man selber für schlechtes spielen nicht reportet werden soll (was ja sinnvoll ist)\ndie frage ist eben \nist sowas (also nicht aufpassen und in der select etwas verdaddeln und damit einen spieler aus deinem Team ggf den spass am kompletten spiel zu rauben weil er auf was anderes geschikt wird als sonst so als bsp.) als schlechtes spielen zu werten\noder aber als fahrlässige Handlung (weil sehr einfach zu vermeiden)\n\nLG Awsane","replies":[{"poster":"Knightofthedawn1","date":"2016-04-13T15:09:07.161+0000","up_votes":1,"down_votes":0,"body":"Also erstmal kann ich es teilweise verstehen,dass man seine vom System zugewiesene Lane nicht spielen möchte.Vor Dynamic-Queue+ dam neuen Draft war es ja auch nie so das du dich auf eine Lane spezialisieren konntest,da du nie zu 100% Wahrscheinlichkeit eine von 2 Rollen bekommst sondern eventuell sogar deine Hass-Rolle.Das neuen Draft-System ist halt einfach komplett grütze.Du MUSST egal ob du Lust drauf hast oder nicht 2 Rollen wählen (gut,vorher musstest du auch mehr können aber da wurde ja nichts von nem System festgelegt worauf man sich dann beziehen kann von wegen \"das System sagt ich bin Top also bin ich Top\"<-hab ich schon par mal erlebt) und solltest du doch mal mehr als nur 2 Rollen wählen wollen kannst du nur 1 Rolle+Fill oder nur Fill wo du dann vielleicht deine Hass-Rolle spielen musst.Deswegen kann mich dieses System auch Kreuzweise.Es ist einfach komplett für'n Arsch und deswegen ist jemdand der Top zugewiesen bekommt nicht Top,weil das System das so sagt.\n\nIch glaube nicht das es dafür wirklich ne Strafe geben würde.Es ist immer noch unbeabsichtigt.Es kommt dabei auch keiner zu Schaden (wobei hier vielleicht die einzige Ausnahme wäre das du mit LOL Geld verdienst und bei nem Sieg verdienst du mehr und durch die \"Fahrlässigkeit\" verlierst du).Das einzige was du verlierst ist je nach Spielmodus LP oder sogar garnichts.Das wäre kein Grund jemanden zu reporten.Ansonsten könnte man ja auch dann sowas wie First Blood je nach Situation,zum Beispiel im Falle eines 1v1,als Fahrlässig bezeichen und dafür jemanden reporten.\n\nIch merke auch nochmal an:In vielen Situationen ist Fahrlässigkeit nicht Strafbar.Ich hatte mal nachgefragt,da ich bis vor kurzem noch häufig mit dem Bus gefahren bin und die meinten,wenn ich mal vergesse ne neue Monatskarte vorm oder am Ersten zu kaufen und deswegen einmal ausversehen schwarz fahre,dann sollte es kein Problem sein,denn ich erschleicht keine Leistung.Es war einfach nur Fahrlässigkeit.\n\nPS:Wer ne Niederlage,wegen falschen Masteries oder Summoners oder änliches,als schlechtes Spiel definiert sollte garnicht erst LOL spielen,denn ein schlechtes Spiel ist es eigentlich erst wenn einer nen dc hat,einer flamt oder jemand wirklich hart feedet,da er keine Ahnung vom Spiel hat.Auf deiner Elo sollte es nichtmal so extrem hart unmöglich sein ein Spiel zu spielen trotz falscher Summoner (Ich sag mal so:Ein Bronze spieler in deiner Elo sollte wohl schlechter sein als ein falscher Summoner und ich habe ein Spiel für meinen Plat Bruder gemacht das ich als Bronze gecarried habe)","replies":[]},{"poster":"xClyde","date":"2016-04-13T12:53:04.464+0000","up_votes":1,"down_votes":0,"body":"sehr theoretisch, wenn jemand vergisst dass er swappen wollte, dann zu reporten finde ich schon fast lustig...\nDas ist ein Spiel, auch das ranked ist ein Spiel :D","replies":[]}]}]},{"poster":"Im a Papaya","date":"2016-04-12T19:24:09.966+0000","up_votes":1,"down_votes":0,"body":"Niemand wird dafür gebannt ein schlechtes Spiel zu haben. Ein First time Kha zix der meint ein Late Game devourer On Hit-Bruiser zu sein und bis Minute 20 nur am Stacken ist hat zwar definitiv zu einer möglichen Niederlage beigetragen aber ist garantiert nicht Report würdig.","replies":[{"poster":"Awsane","date":"2016-04-12T19:57:24.755+0000","up_votes":1,"down_votes":1,"body":"das meine ich auch nicht mir geht es um fahrlässiges verhalten vor dem Spiel \nnicht ingame, sowas zählt für mich einfach als unglücklich gelaufen\nLG Awsane","replies":[{"poster":"Im a Papaya","date":"2016-04-12T21:26:37.337+0000","up_votes":1,"down_votes":0,"body":"\"In der Champion Select einen Fehler machen der das Team hart nach hinten bringt\" da gibts drei Dinge die mir einfallen:\n\n1. Einen Champ bannen den Jemand spielen wollte. \nWenn der Last Pick Top Lane Ekko spielen wollte und jemand eben diesen bannt ist das durchaus verständlich, denn das Risiko einen 58% Winrate Champ beim Gegner zu haben ist zu groß.\n2. Als Last Pick einen Champ picken der für ein Full AD Team sorgt.\nEinfach gesagt: Du kannst spielen was du willst, dafür ist ein Spiel schließlich da.\n3. Eine andere Lane **beanspruchen** ohne zu fragen.\nSowas passiert nun mal und ist garantiert Reportwürdig.\n\nWenn du ein konkretes Beispiel nennen würdest wäre es leichter zu sagen ob es reportwürdig ist oder nicht.","replies":[{"poster":"Awsane","date":"2016-04-12T22:59:07.069+0000","up_votes":1,"down_votes":0,"body":"ich habe  oben mal was hingeschrieben dazu","replies":[]},{"poster":"Knightofthedawn1","date":"2016-04-13T15:22:43.900+0000","up_votes":1,"down_votes":1,"body":"Ich bin mir gar nicht mal so sicher,ob das letzte wirklich Reportwürdig ist.Immerhin ist der neue Draft grütze.\nEntweder du pickst 2 Lanes und bekommst,je nach gewählten Lanes sehr wahrscheinlich immer nur eine (ich sag nur:willst du deine Lane dann pick als zwiete Lane Mid,es sei denn du bist Support,da bekommst du meist deine Rolle).Die Zufallsverteilung ist halt nicht in dem Fall 50:50.Sie wird durch die Spielernachfrage verschoben.Ich erinnere mich noch an Momente,wo ich 5 mal hintereinander nicht meine erstgewählte Rolle bekommen habe und wenn ich Support als zweites gewählt habe,wurde ich so oder so nur Support.\nAußerdem kannst du ja auch noch Fill wählen.Was wirst du da wohl nur?In den meisten Fällen Support.\nDieses System ist behindert.","replies":[]}]}]}]},{"poster":"JoseJalalapeno","date":"2016-04-12T21:09:06.045+0000","up_votes":1,"down_votes":0,"body":"Schlechte Vorbereitung kann auch ein falscher Summoner Spell sein? \nmanche bekommst du vielicht nichtmal mit, falsche Runen, falsche masteries (du siehst ja nur ingame den Keystone)\n\nDu müsstest wirklich konkrete Beispiele nennen. Fahrlässigkeit so wie ich as jetzt verstehe, meint in deinem Fall ingame dann einfach ein schlechtes Spiel.\n\nUnd ich hatte auch schon mal den komplett falschen Champ und Summoner. Hab im Blindpick etwas kooooomplett missverstanden, dachte ich bin Jungler und hatte dann\n {{champion:77}} +{{summoner:11}}  in der Midlane gegen {{champion:69}} \nDas Team meinte sogar der eigentliche Jungler soll mir den Jungle überlassen, was ich abgelehnt habe, da es mein Fehler war. Haben sogar gewonnen, da die Cass nicht wirklich gut war und mich gefeedet hat. \n\nSchlechtes Spiel passiert jedem mal, definitiv nicht reportwürdig. \nEinzig und allein absichtliches Feeden, aber das wird von so vielen behauptet, dass man auch da aufpassen muss","replies":[]},{"poster":"MrBubbllles","date":"2016-04-12T19:47:37.631+0000","up_votes":1,"down_votes":0,"body":"Ich verstehe nicht, warum jemand sofort nach REPORT schreit, nur weil jemand schlecht spielt... wenns ihm doch spass macht? Werde halt selber besser, und bekomm bessere Matchups... aber das Lol ein Teamplay ist, brauch Ich ja nicht erklären, da muss man dann halt mit leben wenn man Random nen Spiel sucht :)","replies":[{"poster":"Awsane","date":"2016-04-12T19:56:25.443+0000","up_votes":1,"down_votes":1,"body":"mir geht es hier nicht um ein schlechts Spiel oder um falsche itembuilds es geht mir um fahrlässiges handeln in der gamevorbereitung\nLG Awsane","replies":[]}]}]}