{"poster":"Awsane","date":"2018-12-22T14:42:39.670+0000","title":"Gibt es eine zuteilung welche Elo im Neuen System welcher Liga entspricht?","subforum":"Ligen & gewertete Spiele","embed":{"description":"Post with 0 votes and 9946 views.","url":"https://imgur.com/am8T1Mn","image":"https://i.imgur.com/am8T1Mn.jpg?fb"},"up_votes":1,"down_votes":0,"body":"Aloha\r\n\r\nda das Ligasystem &uuml;berarbeitet wurde ist die Grafik aus dem MMR- Megainfopost ja nicht mehr aktuell\r\n\r\nhttps://imgur.com/am8T1Mn\r\n\r\ngibt es f&uuml;r das neue System eigentlich eine &auml;quivalente Zuteilung? So eine &Uuml;bersicht zu haben w&auml;re echt cool.\r\n\r\nLG Awsane","replies":[{"poster":"ImTheFox115","date":"2018-12-22T16:00:02.948+0000","up_votes":1,"down_votes":2,"body":"1. ist das eigentlich relativ irrelevant \n2. kannst du einfach das frühere Bronze 5 als Iron 4 nehmen und dich dann hoch arbeiten mit den gleichen Abständen","replies":[{"poster":"Awsane","date":"2018-12-22T16:29:13.960+0000","up_votes":1,"down_votes":0,"body":"> ist das eigentlich relativ irrelevant \n\nNein ist es nicht, wenn man wissen möchte welche Liga welchen Skill relativ der Spieler zueinander darstellt. Was ja der Sinn einer Rangliste ist.\n\n\n> kannst du einfach das frühere Bronze 5 als Iron 4 nehmen und dich dann hoch arbeiten mit den gleichen Abständen\n\nbist du dir 100% sicher dass das so ist, weil es durchaus auch die Möglichkeit gibt, dass sie da die zahlen etwas angepasst haben. Wenn sie das einfach nur so verschoben haben ist die ganze Änderung eigentlich total Sinnlos, weil es gar nix ändert.","replies":[{"poster":"ImTheFox115","date":"2018-12-22T16:34:28.646+0000","up_votes":1,"down_votes":1,"body":"Iron 1-4\nBronze 5-8\nSilber 9-12\nGold 13-16\nPlat 17-20\nDia 21-24\n\nSo wird der relative Skill der Spieler zueinander dargestellt ok?\n\nDu wirst so wieso nicht hinter das MMR System blicken können, also ist so eine „Liste“ irrelevant, da sie dir NICHTS aussagt!","replies":[{"poster":"Awsane","date":"2018-12-22T16:37:50.810+0000","up_votes":1,"down_votes":0,"body":"ne eigentlich hätte ich gerne eine grafische Auftragung\n\nY-Achse - Anzahl der Spieler\nx-Achse -Elo der Spieler\n\ndann die Elogrenzen eingetragen\nund das jeweilige Integral (also die %- wie viele Spieler sich in dieser Elo befinden) zu jeder Liga\n\ndas wäre das beste, wobei die Ligagrenzen auf die MMR bezogen mit den %- der Spieler schonmal nen Anfang wäre","replies":[{"poster":"ImTheFox115","date":"2018-12-22T16:44:52.431+0000","up_votes":1,"down_votes":0,"body":"Aber was für verwertbare Rückschlüsse kannst du denn daraus ziehen? :oo","replies":[{"poster":"Awsane","date":"2018-12-22T16:54:56.215+0000","up_votes":1,"down_votes":0,"body":"also ich könnte Sigma 1 und 2 berechnen.\n\nDann kann ich viel genauer sagen, wie gut jemand wirklich ist, wenn ich seine Liga kenne und das viel besser eingrenzen im gesamten Kontext.\n\nWenn ich keine habe wo Bronze sich in den Top % der Rangliste befindet und nicht weiß wie viele Spieler in der Elo sind hat der Rang ans sich keinen Wert, das wäre so, als ob man im Fußball weiß man spielt Bezirksliga, weiß aber nicht welche Liga sich über und unter einen befindet und wie man sich beim aufstieg qualifiziert. Es hat momentan einfach 0 Aussagekraft.\n\nZudem kann man dann sehen ob sich der Skill der Spieler wie eine Gaußsche Normalverteilung verhält oder ob es Elospezifische Besonderheiten gibt.\n\nGerade an diesen Besonderheiten (extremspitzen) sofern vorhanden könnte man sogar von relativen Skill Rückschlüsse auf absoluten Skill und lernverhalten ziehen. Das ist gerade für mich, der sich für Sportpsychologie interessiert und auch coacht super interessant und relevant, weil dann könnte ich Spieler über und unter der Grenze fragen wie sie an das Spiel rangehen und Methoden zum climben entwickeln","replies":[{"poster":"ImTheFox115","date":"2018-12-22T17:03:22.222+0000","up_votes":1,"down_votes":0,"body":"Aber du musst doch nicht die genaue Zahl der Spielee in Bronze und Iron kennen, um irgendwen zu beraten...\n\nWenn du einen Bronze Spieler vor dir hast, weiß er genau, dass er schlechter als der Durchschnitt ist. \nUnd wenn du einen Plat hast, ist der natürlich überdurchschnittlich...\n\nWenn du Methoden zum climben von einem Spieler herausfinden möchtest ist immer die Antwort:“ Möglich viel zu gewinnen und mindestens 51%“...\n\nAußerdem wird sich die Anzahl der Spieler in den verschiedene Elos nicht in einer gaußschen Normalverteilung liegen, da Bronzespieler immernoch Bronze sind (denke ich, nicht sicher) und nicht nach Iron herabgestuft wurden...","replies":[{"poster":"Awsane","date":"2018-12-22T17:21:31.905+0000","up_votes":1,"down_votes":0,"body":"> Aber du musst doch nicht die genaue Zahl der Spielee in Bronze und Iron kennen, um irgendwen zu beraten...\n\nDoch ggf schon, es geht auch nicht um die absoluten Zahlen, die sind eher unwichtig, aber die relativen Zahlen sind super wichtig\n\n> Wenn du einen Bronze Spieler vor dir hast, weiß er genau, dass er schlechter als der Durchschnitt ist.\n\nNur wenn die Annahme stimmt, das 50% der Spieler über ihn sind, diese Annahme ist aber Momentan nicht bestätigt, darum geht es mir ja gerade.\n\n> Wenn du Methoden zum climben von einem Spieler herausfinden möchtest ist immer die Antwort:“ Möglich viel zu gewinnen und mindestens 51%“...\n\nDas ist ein Kreis Argument und wenig hilfreich, es geht hier um das wie, in kleinen Schritten und um ggf sogar Elospezifische Unterschiede im Verhalten\n\nJemand der von Bronze nach Silber aufsteigen möchte braucht ganz andere Hilfe , als jemand der von Platin nach Dia möchte, aber für beide zählt das mit den 51%\n\n> Außerdem wird sich die Anzahl der Spieler in den verschiedene Elos nicht in einer gaußschen Normalverteilung liegen, da Bronzespieler immernoch Bronze sind (denke ich, nicht sicher) und nicht nach Iron herabgestuft wurden...\n\nMir geht es hier um wissen und nicht um denken/vermuten, um eine Wissenschaftliche und möglichst genaue Ausarbeitung, dass ich die genauen Zahlen dafür gerne hätte ist denke ich klar. \n\nZu der Kurve, vllt nicht jetzt, aber das wird sich ja über die Zeit wieder Normalisieren. Der Prozess ist übrigends auch interessant weil man könnte damit berechnen wann innerhalb einer Season es am effektivsten ist Ranked zu spielen. (wobei das beim coachen nicht das Hauptanliegen ist, aber doch durchaus kurios und interessant, dass es da unterschiebe gibt)","replies":[{"poster":"ImTheFox115","date":"2018-12-22T18:06:24.204+0000","up_votes":1,"down_votes":0,"body":"Soo noch ein letztes Mal xD\n\nSagen wir, dass du wirklich die relativen Zahlen von Riot bekommen solltest. Wie würde das dein Coaching bereichern?\n\n Man hat eine MMR, diese wird nicht von der Anzahl der anderen Spieler beeinflusst!\nWas ändert es wann man Ranked spielt?\n\nDu nimmst das glaub ich ein bisschen zu ernst :p","replies":[{"poster":"Awsane","date":"2018-12-22T19:28:39.834+0000","up_votes":2,"down_votes":1,"body":"Ich würde gezielt Leute an der Grenze an relevanten Extrempunkten befragen (ich kenne genug aus jeder Elo) und dann versuchen die wichtigen Unterschiede die diese machen im Vergleich zu denen drunter ermitteln, und dieses Wissen, was dann wahrscheinlicher Relevanter ist als anderes Wissen \n\n(es geht hier um Zeit Effektivität, klar kann man besser in allem werden, aber einige Sachen haben mehr Einfluss als andere Skilltechnisch gerade wenn man climben will, aber man braucht ggf auch eine bestimmtes Mindset etc pp)\n\nan diejenigen weitergeben die ich coache und diese Elo erreichen wollen.\n\n> Du nimmst das glaub ich ein bisschen zu ernst :p\n\nIch interessiere mich dafür und ich finde eine im Grundsatz Wissenschaftliche Herangehensweise nicht falsch. Und alle mal besser als ein Coach der nur aus Gefühl und eigener Erfahrung aber ohne jegliches andere Theoretische Wissen dazu versucht zu arbeiten.","replies":[]}]}]}]}]}]}]}]}]}]}]}