{"poster":"Awsane","date":"2017-08-08T19:55:15.461+0000","title":"Welche Champs sind zum lernen einer lane besonders gut geeignet auf höheren Anforderungsniveau?","subforum":"Level Up: Guides & Tipps","up_votes":2,"down_votes":0,"body":"Aloha Titel ist die Frage\r\n\r\nes geht um die Frage, wenn man vor hat eine Lane zu lernen/verbessern welche Champs sind daf&uuml;r gut geeignet\r\n\r\ndabei soll der Champ m&ouml;glichst viele Aspekte der lane haben, die man meistern muss\r\n\r\nes soll nicht darum gehen Champs zu nennen die eine hohe Winrate haben oder Anf&auml;ngerfreundlich sind, sondern die f&uuml;r die Lane eine Herausforderung im lernen sind aber wenn man sie kann, dass man dann m&ouml;glichst viele Aspekte der Lane beherrscht.\r\n(zum Beispiel finde ich Annie f&uuml;r Spieler auf h&ouml;herer Elo f&uuml;r Midlane nicht mehr so gut um neue Aspekte zu lernen, weil der Champ keine Skillshots hat und das beherrschen dieser meiner Meinung nach f&uuml;r die Midlane sowohl im dodgen (und dazu muss man verstehen wie sie im werfen Funktionieren) als auch im werfen ein wichtiger Bestandteil ist. Das bedeutet nicht das ich Annie schwach finde oder das sie nicht stark ist, oder dass man sie nicht auf der elo spielen kann, man lernt nur nicht so viel auf ihr finde ich, ihr d&uuml;rft dennoch gerne Annie sagen wenn ihr das gut begr&uuml;ndet)\r\n\r\nZielgruppe sollen Platin+ Spieler sein, die die Basics sch&ouml;n k&ouml;nnen und denen man dann im Coaching bestimmte Champs raten kann auf denen sie neue  (Fortgeschrittene) Aspekte lernen sollen/k&ouml;nnen\r\n\r\njede Lane ist gefragt \r\n\r\nLG Awsane","replies":[{"poster":"Planloss","date":"2017-10-26T06:06:07.832+0000","up_votes":1,"down_votes":0,"body":"Ich möchte nicht den 1.000sten Lane Thread aufmachen, daher hänge ich mich hier mal frech an.\n\nIch habe schon vorab recherchiert. Kann es sein, dass die Wahl der Champions für die Lanes nur aufgrund der beiden Bosse zustande kam? Anders kann ich es mir nicht erklären. Eventuell auch wegen dem Abstand der Türme. Aber sonst könnte es ja wohl egal sein welche Champs auf welcher Lane sind. Man könnte ja auch Top und Bot Lane vertauschen. Einer wollte mal nach dem Motto \"weil es halt so ist\" anwroten, aber das zählt ja wohl nicht als rationale Erklärung. ^^","replies":[]},{"poster":"Adcisusel3ss","date":"2017-08-20T15:05:02.954+0000","up_votes":1,"down_votes":0,"body":"Für die Adc Position habe ich mir drei verschiedene Champs ausgesucht\n\nAls erstes hätte man da Caitlyn: Mit Caitlyn lernt man wie man zumindest im Regelfall gutes Traden durch Autohits und um sich so einen Lead auf der lane zu bearbeiten. Gleichzeitig bietet sie einem auch die Chance im momentanem Meta sehr klassische Powerspikes zu lernen und so sein Dmg-Potenzial besser einzuschätzen. Hierbei rede ich speziell nach dem ersten, zweiten und dritten Item.\n\nAls zweites hätte ich da Varus: Varus bietet einem Neuling auf der Rolle die Möglichkeit sehr schnell auf fehlende Mobilität und Repositionierungs Möglichkeiten Verzichten zu müssen. Dadurch wird besonders das Positioning des Adcs gefördert, da er zum Beispiel im Gegensatz zu Cait, Ashe und Jinx nicht die höchste Range hat. Gleichzeitig bietet er auch die Möglichkeit sich ein wenig mehr mit Utility Adcs zu beschäftigen.\n\nAls Nummer drei habe ich mich für Ashe entschieden: Ashe bietet mit einer Range von 600 eine relativ hohe Autohitrange, hat aber besonders pre Lvl6 einen Katastrophalen All In. Dadurch wird man wie bei Varus auch dazu gezwungen besonderes Augenmerk auf das Positioning zu haben, da man sich nur wenig Fehler leisten kann. Gleichzeitig aber bietet sie über ihre Passive welche mit ihren AAs slowt auch die Chance in das Kiten und Stuttersteppen als Adc herangeführt zu werden. Ich denke mit den dreien nimmt man das wichtigste mit was man als Adc benötigt.\n\nLG Nero","replies":[]},{"poster":"hshtagniemehrcdu","date":"2017-08-09T14:00:21.355+0000","up_votes":1,"down_votes":0,"body":"Grundsätzlich würde ich empfehlen, Assassins wie Zed/Talon zu spielen, um einschätze zu können, wann man reingehen kann und wann nicht;\nLong-Range wie Lux/Xerath für  Skillshots;\nUnd Control-Mages mit kurzer Reichweite wie Anivia/Viktor für besseres positioning.\nRoaming Mages wie TF/Galio für Map-Awareness.\n\n\n\nAllgemein sollte man, wenn man die Midlane-Rolle ernsthaft lernen will, jeden Midlane-Champ 3-4 mal zu spielen.\nDas hilft massiv, um Cooldowns/Schaden einzuschätzen und insbesondere dabei, vorauszusehen, wie der Gegner den Kampf spielen möchte, was wohl das wichtigste zum aufsteigen ist.","replies":[]},{"poster":"HHaie tabbian","date":"2017-08-09T08:45:15.750+0000","up_votes":1,"down_votes":0,"body":"Ich denke, es wäre am sinnvollsten, den Leuten zu raten, Champions zu spielen, die (noch) nicht in ihrem Championpool sind und meta sind. Ich will damit nicht sagen, dass manchmal auch Offmeta-picks hilfreich sein können, ich spiele zum Beispiel sehr gerne Viktor, aber bei meta-picks weiß man immerhin, dass sie im Prinzip stark genug sind.\nAlles andere ist doch sehr stark spielerabhängig. Wenn es ein Spieler ist, der passiv in der Lane spielt und nur auf Lategame spielt, wäre es vielleicht sinnvoll, mehr Fokus darauf zu legen, mit bestimmten Spielweisen und Champions eine frühe Lanedominanz aufzubauen. Oder jemand, der fast nur Assassinen spielt, sollte mal gucken, ob Control-Mages (mid) oder Tanks (jungle) nicht auch eine gute Option für ihn/sie wären.","replies":[]},{"poster":"MarCommander2211","date":"2017-08-09T04:23:42.342+0000","up_votes":1,"down_votes":0,"body":"Mit Rene oder Riven kannst du Animation Canceling lernen, mit Thresh oder Xerath bist du auf Skillshots angewiesen, deshalb kannst du mit ihnen deine Präzision verbessern. mit jedem ADC kannst du Positioning lernen und wenn du die Champs spielst, die dir Probleme bereiten, dann kannst du auch gegen sie besser spielen.","replies":[]},{"poster":"Lagging4Freedom","date":"2017-08-08T20:33:48.856+0000","up_votes":1,"down_votes":0,"body":"Versuchs mit Lategamechamps wie Gangplank oder Azir, um zu lernen wie man mit dauerhafter Gank-/Divebarkeit umgeht. Twisted Fate um CSen zu lernen und Roamen zu lernen (alternativ auch Ahri oder sowas).","replies":[{"poster":"Awsane","date":"2017-08-08T21:07:05.346+0000","up_votes":1,"down_votes":0,"body":"ok, ich denke für die einzelnen Aspekte sind das gute Champs\n\nes geht btw nicht um mich sondern ich sammel das um das dann unter Coaches zu diskutieren, weil wir als Coaches werden immer oft gefragt was man spielen soll (champ) und um dieses hier hat sich noch niemand so wirklich Gedanken gemacht, jedenfalls haben wir dazu nichts gefunden und die frage kam letztens auf\n\nwir haben selber schon Ideen welche champs geeignet sein könnten aber fragen für neuen Input kostet ja nix\n\nich finde die Kombination aus Late und roam btw ganz für midlane gut weil man dadurch late und early game power kennenlernt und ich denke 1 champ kann nicht alles abdecken sondern es muss immer eine Kombination aus champs sein","replies":[]}]}]}