{"poster":"Thr0ughGlass","date":"2017-07-27T15:41:17.186+0000","title":"Smite-Warnung als Jungler in der Championselect // Runen-Masteries-Warnung","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Gr&uuml;&szlig;e liebe Community,\n\nDer Titel sollte alles bereits zusammenfassen, was ich in dieser Diskussion ansprechen m&ouml;chte.\nZwar kamen zu diesem Thema bereits mehrere Diskussionen auf, dennoch m&ouml;chte ich auch nochmal meine Gedanken aufschreiben und euch an diesen teilhaben lassen.\n\nGeschichtsstunde: \nVor Kurzem erst habe ich mich von meiner lang und oft gespielten Mid-Lane verabschiedet und den Weg in den Jungle gefunden. Einige Spiele sp&auml;ter ist es nun tats&auml;chlich vorgekommen, dass ich nach 20+ Spielen auf die Top-Lane autofilled wurde. Da dies nat&uuml;rlich mehr oder minder &uuml;berraschend kam, dachte ich daran Runen, Masteries und die Summonerspells zu tauschen. Das Spiel anschlie&szlig;end f&uuml;hrte mich wieder in den Jungle, ich bekam wieder meinen gewohnten Champion, &auml;nderte Runen und Masteries, dennoch verga&szlig; ich in meiner Betriebsblindheit Smite einzupacken, was im Nachhinein in einer Katastrophe und einer Niederlage endete.\n\nLaut dem derzeitigen Standard auf den Live-Servern ist es Pflicht als Jungler Smite mitzunehmen, da sonst Jungle-Gegenst&auml;nde nicht erworben werden k&ouml;nnen und durch deren Wegfall auch die erworbenen Exp. deutlich niegriger ausfallen, was sich in vielerlei Hinsicht negativ auf das Spiel des eigenen Teams und nat&uuml;rlich auch auf einen selbst auswirkt.\nNun habe ich die Suchfunktion angestrengt und tats&auml;chlich den einen oder anderen Post gefunden, in dem um ein forciertes Smite gebeten wird, was die einfachste L&ouml;sung w&auml;re, dennoch nicht im Sinne des Spiels w&auml;re, wo doch grunds&auml;tzlich jeder erstmal das, was er will und wo er will und wie er will, spielen kann.\nStattdessen bietet ein Popup in der Championselect in den letzten Sekunden vor Spielstart deutlich mehr Potential.\n\nProcedere: \nIn den letzten **30 (?) Sekunden vor Matchbeginn** taucht ein einfaches **Popup** f&uuml;r Betriebsblinde und Pappnasen wie mich auf, welches einen an das **Pr&uuml;fen von Runen, Meisterschaften und Beschw&ouml;rerzauber** erinnert, welches mit einem einfachen H&auml;kchen in den Einstellungen oder vielleicht sogar in der Championauswahl an- und ausgestellt werden kann. So merkt auch eine Blimse wie ich, dass er was vergessen hat. :p\n\nIch denke, dass diese Idee durchaus realisierbar und verh&auml;ltnism&auml;&szlig;ig einfach zu implementieren ist und zus&auml;tzlich in kleiner Dosis zu einem guten Klima in der Kluft der Beschw&ouml;rer beitr&auml;gt. \nTeilt mir eure Gedanken mit!\n\nLiebe Gr&uuml;&szlig;e :)","replies":[{"poster":"Fleischbazooka","date":"2017-08-01T10:53:06.288+0000","up_votes":2,"down_votes":0,"body":"Der OP hat schon recht. Mit dem Einzug der Änderungen an den Jungle-Items und den damit verbunden Änderungen das Smite einfach _PFLICHT_ ist, sollte in der Jungle Rolle auch autom. Smite ausgewählt sein, weil es schlicht und ergreifend nicht anders gespielt werden kann. Vor ein paar Jahren hätte man noch so argumentieren können das Jungle ohne Smite ja möglich sei, das geht nun aber nicht mehr.\n\nViel schlimmer finde ich es im übrigen wenn man nach 100 Games auf einmal Jungle Autofill bekommt und sich auf einmal darauf einstellen muss. Da kann man schon mal die summs übersehen.\n\nEs ist ja auch nicht so, dass man als Laner erst einen Spell auswählen muss, durch den es einem erst erlaubt ist nach dem Lasthitten der Minions Gold zu erlangen.","replies":[]},{"poster":"Kaorî","date":"2017-07-27T18:53:25.537+0000","up_votes":2,"down_votes":0,"body":"Wäre ich dafür. Auch wenn ich kein Jungler bin, vegesse ich gerne mal, wenn in der Selection viel geschrieben wird, meine Masteries zu ändern.{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Oriius","date":"2017-07-28T11:17:42.726+0000","up_votes":1,"down_votes":0,"body":"Also ich sags mal so ..... vielleicht mag es ganz nett sein ... aber unaufmerksame leute sollten durchaus schon durch sowas in der Champselect bestraft werden und ohne warnmeldung ins game gehen. Ich persönlich vergesse das vielleicht auch ganz selten meine masteries zu ändern aber mache dann halt das beste draus und das kann sich sogar auszahlen. Runenseite kann ich nicht ändern da mir die viel zu teuer sind XD \n\nwer das aber vergisst smite zu picken usw soll damit leben ... ist zwar blöd fürs team aber vielleicht lernt man es anders nicht.","replies":[{"poster":"Thr0ughGlass","date":"2017-08-01T08:30:26.688+0000","up_votes":1,"down_votes":0,"body":"\"aber unaufmerksame leute sollten durchaus schon durch sowas in der Champselect bestraft werden und ohne warnmeldung ins game gehen.\"\n\nSofern es ein normales Spiel ist, kann ich die Argumentation durchaus nachvollziehen, da es hier quasi um nicht mehr als ein verlorenes Spiel und ein paar weniger IP geht, jedoch fürs ranked ist sowas in garantiert 99% aller Fälle tödlich.\n\n\"Ich persönlich vergesse das vielleicht auch ganz selten meine masteries zu ändern aber mache dann halt das beste draus und das kann sich sogar auszahlen. Runenseite kann ich nicht ändern da mir die viel zu teuer sind\"\n\nMasteries und Runen sind zwar auch sehr oft von großer Relevanz, jedoch ist ein Maokai auf AD statt AP/Tank durchaus zu verschmerzen, nicht aber das Fehlen von Smite im Jungle, was essentiell für die Jungle-Clear-Speed und die erhaltenen Erfahrungspunkte durch Jungle-Camps ist.\n\n\"wer das aber vergisst smite zu picken usw soll damit leben ... ist zwar blöd fürs team aber vielleicht lernt man es anders nicht.\nWer Smite nicht auswählt für den Jungle, MUSS derzeit damit leben.\"\n\nMachen wir uns nichts vor: Die Community in diesem Spiel (so wie leider in vielen anderen auch) ist großteils mit Leuten bestückt, die ihren Frust gerne an anderen Spielern auslassen. Ich kann absolut nachvollziehen, wenn man ein Spiel auch nur wie ein Spiel behandelt und so sollte es auch sein. Aber wenn es auf den Spielspaß geht, so wie es leider häufig der Fall ist, dann sollte man alles mögliche tun, um sowas zu verhindern oder zumindest die Spielerwut auf kleiner Flamme zu halten und ihnen keine Angriffspunkte zu geben. \n\nIch spiele seit Season 2 und es passiert mir immer wieder mal, dass ich am Ende mal vergesse die Beschwörerzauber zu wechseln. Das ist nur menschlich. Deshalb denke ich auch, dass es keinen großen Aufwand darstellt einen kleinen Gedankenanstoß von Seiten Riots zu implementieren, der dafür sorgt, dass solche Fehler nicht geschehen.","replies":[{"poster":"HyperionCH","date":"2017-08-01T08:51:50.838+0000","up_votes":1,"down_votes":0,"body":"Auf der anderen Seite:\n\nDas Game beginnt mit der Pick- und Banphase (und nicht \"erst\" ab Spielzeit 0:01).\n\nUnaufmerksamkeit in der CS wird deshalb genauso bestraft wie Unaufmerksamkeit in der Kluft (z.B. wenn man backportet und bereits im Shop ist, während man gerade angegriffen wird).","replies":[{"poster":"Thr0ughGlass","date":"2017-08-03T13:46:32.416+0000","up_votes":1,"down_votes":0,"body":"Und dennoch passiert es den Allerbesten, dass sie mal vergessen einen Zauber, Runen oder Meisterschaften zu wechseln. Falsche Runen und Meisterschaften sind bis zu einem gewissen Grad verschmerzbar, während ein fehlendes Smite im Jungle die sichere Niederlage bedeutet. Und die Betriebsblindheit erwähnte ich ja bereits.\nDesweiteren ist es nur ein kleine, einfach zu implementierende Hilfestellung und keine arge Designanpassung.","replies":[]}]}]}]},{"poster":"Kind Prow","date":"2017-07-27T18:27:47.601+0000","up_votes":1,"down_votes":0,"body":"Mag sein :>","replies":[]}]}