{"poster":"datbion","date":"2017-12-21T14:38:24.539+0000","title":"Deberian implementar el lenguaje inclusivo en el foro.","subforum":"Off-topic y temas personales","up_votes":5,"down_votes":43,"body":"Para los que no saben, el lenguaje inclusivo es una manera de escribir que incluye ambos géneros a la hora referirse a ambos géneros  cambiando las \"E\" por \"X\" \nUn ejemplo puede ser la seccion \"nuevos jugadores\" donde \"jugadores\" puede afectar la sensibilidad de algunas mujeres ya que solo habla del genero masculino. Para evitar dicha ofensa deberian cambiarlo a \"jugadorxs\"\nHay libros de reciente edición que utilizan la @ o la x con la intención de componer palabras sin marca de género; en papers académicos, sobre todo de ciencias sociales, hace años que circulan artículos con esos signos; hay casos de activistas por la diversidad sexual que reemplazan la o de su nombre por una x, y los ejemplos siguen y deberian continuarlo en este foro. \n\nDejando eso de lado me gustaria tambien que me hagan saber cuál de los siguientes temas les resulta mas urgente para debatir en el foro para mis proximos post\n1. Crear un grupo de contención para las mujeres que son agredidas en el foro \n2. Agregar en el cliente direcciones sobre violencia de genero para concientizar de esta manera a la comunidad.","replies":[{"poster":"Jınx","date":"2017-12-21T14:42:23.152+0000","up_votes":1,"down_votes":18,"body":"estoy deacuerdo, muchxs tenemos ese problema, a mi me agreden tambien x ser mujer aveces en el juego o simplemente por jugar con una mujer, osea el chap simplemente porque mi champ es mujer ya me agreden aca y en el juego tambien","replies":[{"poster":"TiToldero","date":"2017-12-21T15:01:58.332+0000","up_votes":5,"down_votes":1,"body":"Sos mujer y estas enamorada de jinx? COmo se le dice a eso??","replies":[{"poster":"bombastico","date":"2017-12-21T15:04:50.433+0000","up_votes":15,"down_votes":1,"body":"Carpintera.","replies":[{"poster":"Lince Salvaje","date":"2017-12-21T15:05:57.526+0000","up_votes":5,"down_votes":1,"body":"jajajajajajajajjajajaja\n xD{{sticker:sg-miss-fortune}} ","replies":[]},{"poster":"Raton Marycon","date":"2017-12-22T07:51:11.020+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-jinx}} aay quiero comer tortilla","replies":[]}]},{"poster":"Jınx","date":"2017-12-21T15:07:38.606+0000","up_votes":1,"down_votes":15,"body":"*(voy a ignorar a los mismos tontos de siempre)*\n\nsoy chico, quiese decir que por ser una chica en el juego (osea por usar jinx) entendes?\n\nno voy a responder mas porque no quiero desvirtuar el tema del creador","replies":[{"poster":"Lucio22","date":"2017-12-21T15:09:58.321+0000","up_votes":5,"down_votes":1,"body":"si te agreden porque \"jinx es mujer\", entonces estas mintiendo, ya que la mayoria de los champ que uso son mujeres (entre supp y adc) y no me joden. posiblemente sea algo que hagas y/o digas que hace que te quieran prender fuego en una plaza. yo se que si quiero...","replies":[{"poster":"Jınx","date":"2017-12-21T15:12:13.835+0000","up_votes":1,"down_votes":12,"body":"hay muchos jugadores que te discriminan x eso, x usar un champ mujer y piensan que porque el champ es mujer entonces es inferior, (solo por el echo de ser mujer) lo cual es erronio,  fijate que hay muchos casos asi, lee el post tambien y te vas a dar cuenta de lo que hablo","replies":[{"poster":"bombastico","date":"2017-12-21T15:23:35.719+0000","up_votes":5,"down_votes":1,"body":"Nop, eso no pasa. Muchos campeones han sido muy usados y han estado (Con su consecuente nerfeo) o están muy rotos y nadie ha molestado por su genero. Algunos ejemplos:  {{champion:84}} {{champion:131}} {{champion:114}} {{champion:28}} {{champion:40}} {{champion:39}} {{champion:81}} {{champion:55}} {{champion:7}} {{champion:142}}","replies":[{"poster":"Lïttlefinger","date":"2017-12-21T15:44:51.601+0000","up_votes":1,"down_votes":0,"body":"Ah re que hacia eve ahi jajaja nunca estuvo rota, nunca lo a a estar.","replies":[{"poster":"Lucio22","date":"2017-12-21T18:12:16.438+0000","up_votes":3,"down_votes":0,"body":"De hecho era el terror de la botlane como por la season 2 o 3","replies":[]},{"poster":"bombastico","date":"2017-12-21T18:34:12.353+0000","up_votes":1,"down_votes":0,"body":"Una vez tenia un stun que te lo pegaba al salir del invisible.","replies":[]}]},{"poster":"Raton Marycon","date":"2017-12-22T07:48:17.364+0000","up_votes":1,"down_votes":0,"body":"q te pasa con la rubia, {{champion:110}} ?! a va sorry con {{champion:81}} :c","replies":[]}]}]}]},{"poster":"TiToldero","date":"2017-12-21T15:33:34.650+0000","up_votes":4,"down_votes":0,"body":"A bien ahora me decis tonto?? Bien ahi insultandome.","replies":[{"poster":"Lucio22","date":"2017-12-21T15:38:34.504+0000","up_votes":2,"down_votes":0,"body":"es que esta bien que el lo haga, pero no que lo hagan los demas, no entendes su doble moral y su doble juicio?","replies":[]}]}]},{"poster":"Lïttlefinger","date":"2017-12-21T15:43:43.320+0000","up_votes":3,"down_votes":0,"body":"No es mujer, yo en el primer post que lo lei, decia algo de hacerse tatuajes de jinx, decia claramente cosas como \"enamorado\", \"loco\" etc etc etc.\n\nObviamente ya su trauma esta pasando facturas, y esta hasta repercutiendo en su sexualidad...","replies":[]}]},{"poster":"bombastico","date":"2017-12-21T14:51:43.660+0000","up_votes":6,"down_votes":1,"body":"La verdad creo que te victimizas mucho, vi tus otros post y nadie te agrede por el echo de ser mujer o ser \"main jinx\" es el hecho de  refregarles a todos tu fanatismo por ese campeón en contextos y post que no tienen relación con ese tema, pedir castigos absurdos por hablar mal de Jinx y hacer una especie de \"personaje\" con tu admiración hacia ese campeón.\n\nTécnicamente causas el mismo rechazo de cuando alguien golpea a tu casa y te dice \"¿Tienes un minutito para hablar de jesucrito? xD\n\nEdit: Contextualizando la situación no como el hecho de que el foro sea una casa, si no la molestia que genera que sin venir a cuento, alguien te refriegue en la cara el fanatismo de algo y te quiere obligar a estar de acuerdo con el.","replies":[{"poster":"datbion","date":"2017-12-21T14:53:07.475+0000","up_votes":1,"down_votes":10,"body":"El error esta en los que creen que el foro es su casa entonces, no de jinx.","replies":[{"poster":"bombastico","date":"2017-12-21T14:57:40.295+0000","up_votes":2,"down_votes":1,"body":"Claro si... puede ser (No).","replies":[{"poster":"Mazer Rakham","date":"2017-12-21T17:56:07.090+0000","up_votes":2,"down_votes":0,"body":"No sé vos, pero yo estoy empezando a creer que estos dos son la misma persona.","replies":[]}]}]},{"poster":"Raton Marycon","date":"2017-12-22T07:45:12.560+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-jinx}} amen","replies":[]}]}]},{"poster":"Tomyrex143","date":"2017-12-21T14:53:03.340+0000","up_votes":8,"down_votes":0,"body":"Respecto al lenguaje inclusivo, me parece totalmente innecesario. Es como decir \"Se le hay que decir presidenta si es mujer\". A ver, la definición dice como persona, no como hombre. Lo mismo pasa en el foro con el lenguaje inclusivo:\n\nDefinición de \"Jugador\"\n\nPersona que toma parte en un juego o en un deporte de equipo.\n\"el fútbol es un deporte en el que se enfrentan once jugadores por cada equipo\"\nPersona que se dedica asiduamente a un juego.\n\"es jugador de ajedrez; las reglas de este juego son complicadas para los no jugadores\"\n\nDefine por \"Persona\", no por género.\n\nRespecto al \"grupo de contención para mujeres agredidas en el foro\"...\nhttps://i.imgur.com/WNNvJkO.jpg\nNo creo que es necesario un grupo específico para mujeres agredidas en el foro, la agresión es mala, sin importar el género :S\n\nY las direcciones de violencia de genero...\nhttps://i.imgur.com/Q4IMzFv.jpg\nTe estás tomando demasiado en serio el lol, lo que no deja de ser \"Un juego\".\nSi te flammean, reportalos y listo, como una persona normal.\n\nSaludos..","replies":[{"poster":"Lucio22","date":"2017-12-21T14:59:06.041+0000","up_votes":2,"down_votes":0,"body":"en realidad, lo de presidente es peor, ya que es un TITULO y no se le puede cambiar el genero, como bombero o policia (realmente esta mal dicho presidenta y bombera). los otros titulos (conde, dondeza y esos) ya parten con la version femenina que NO es simplemente un anexo sino que son 2 palabras distintas, como se puede ver en king y queen","replies":[{"poster":"Tomyrex143","date":"2017-12-21T15:01:49.030+0000","up_votes":1,"down_votes":0,"body":"Sip, me molesta horriblemente que le cambien los nombres a los cargos por \"inclusión\", como el otro dia en un noticiero dijeron \"Hay X heridos y una mujer\" ...\nIgual, era un ejemplo claro, por el impacto que tuvo eso de presidente/a en Argentina","replies":[{"poster":"Lucio22","date":"2017-12-21T15:06:42.611+0000","up_votes":4,"down_votes":0,"body":"jajajajajajaja\n\nme recordaste a \"murieron 5 personas y un bolibiano\" jajajajaja re cronica\n\nse, de hecho a cristina se le decia \"presidenta\" como algo despectivo y quedo que todos le decian asi","replies":[{"poster":"Tomyrex143","date":"2017-12-21T15:08:19.619+0000","up_votes":1,"down_votes":0,"body":"Crónica, por favor JAJAJA\nSip, me sigue dando mucho odio que le sigan diciendo Ex-presidenta..  {{sticker:sg-ahri-3}}","replies":[{"poster":"Lucio22","date":"2017-12-21T15:13:08.795+0000","up_votes":2,"down_votes":0,"body":"seguramente lo decis en la calle y sos ultra k, pero realmente esta mal dicho, como mucho seria la ex presidente (si no queres agregar el señora)","replies":[]}]}]},{"poster":"Hnk Kenshiro","date":"2017-12-21T15:19:04.862+0000","up_votes":2,"down_votes":0,"body":"> \"Hay X heridos y una mujer\"\n\n\nxD","replies":[]}]}]}]},{"poster":"Defg45333","date":"2017-12-21T15:21:07.888+0000","up_votes":6,"down_votes":1,"body":"Yo no puedo creer que sigan insistiendo con eso, que manera de destruir nuestro idioma.\nYo voy a seguir hablando y escribiendo en español, si quiere puede escribir usted usando el @ o la x, pero deje de intentar que todos hagan lo mismo.\n\n\"jugadxr\" o \"jugad@r\" no significa nada, ninguna de las dos es una palabra, además dígame ¿como pronuncia eso?\n\nSobre las otras 2 propuestas...\n>1. Crear un grupo de contención para las mujeres que son agredidas en el foro\n\nClaro y los hombres agredidos se joden, además de que ¿un grupo de contención en un foro en internet?\nMejor vaya a un psicólogo si le causa tantos problemas lo que le puedan decir por internet, le va a ayudar más que un \"grupo de contención\".\n\n>2. Agregar en el cliente direcciones sobre violencia de genero para concientizar de esta manera a la comunidad. \n\nYo vengo a jugar al igual que la mayoría, realmente prefiero abrir el cliente y encontrarme con temas relacionados al juego, si quisiera informarme sobre la violencia de género, lo buscaría en Google, supongo que hay bastantes páginas tocando ese tema.\nPor cierto, ni las páginas, ni los folletos ni las marchas sirven para concientizar, es que el violento, sigue siendo violento hasta que lo metas de por vida en una celda, o directamente lo mates.","replies":[{"poster":"datbion","date":"2017-12-21T15:25:47.178+0000","up_votes":1,"down_votes":3,"body":"Los hombres componen la gran mayoría de la población total de league of legends. En cambio las mujeres se chocan  con un mundo en donde tienen que ocultar su identidad sexual solo por la costumbre de maltratarlas por su condición. \nSi las mujeres fueran mayoria y en ellas existiera comportamiento toxico hacia los hombres entonces otra seria la propuesta. Sin embargo actualmente eso no ocurre en el lol.","replies":[{"poster":"Lucio22","date":"2017-12-21T15:33:47.486+0000","up_votes":1,"down_votes":0,"body":"sin embargo, es sabido que un porcentaje de los abusos domesticos no denunciados (quiero decir la mayoria pero no estoy seguro) son sufridos por hombres porque la sociedad los quiere tanto y les da tantos privilegios que si una mujer te abusa sos un pelotudo. igual que con su \"modelo fuera de la realidad\" de la barbie, pero nadie se molesto en ver al ken, ni a todas las figuras de accion (termino maricon para no decir muñequitos, las cosas como son) que son tipos liefeldados que ni en pedo pueden ser realistas.\n\npor cierto, el termino liefeldados viene del dibujante liefeld, aca un ejemplo y decime si se lo puede llegar a considerar \"realista\":\nhttp://assets.sbnation.com/assets/1185172/warchild2.jpg","replies":[{"poster":"datbion","date":"2017-12-21T15:37:44.989+0000","up_votes":1,"down_votes":2,"body":"Si en un mundo dominado por el hombre no pueden protegerse de ustedes mismos, que culpa tienen las mujeres en esto? \nNo tiene logica ni sentido discutirlo.","replies":[{"poster":"Lucio22","date":"2017-12-21T15:43:02.679+0000","up_votes":2,"down_votes":0,"body":"entonces estas aceptando que tu preciado \"feminizmo\" en realidad no busca, como suelen decir, \"la igualdad entre los generos\" y si busca \"la ganancia de derechos para las mujeres siempre y cuando les convenga\", por lo que estaria bien llamarlo \"fenminazismo\"? \n\nporque eso es lo que estas implicando...\n\nalso, si segun vos un hombre no se puede proteger en un mundo de hombres deberia cagarse, como esperas que los que no somos machistas y somos defensores de la igualdad (que, como siempre digo, deberia llamarse \"igualismo\") te vayan a ayudar cuando pase algo? porque por frases asi es que se genera rencores y un \"bueno, si yo me tengo que cagar el resto tambien\". also, no es muy logico rechazar posibles aliados en una pelea por derechos contra el mundo, si es que tienen el mismo objetivo (cosa que no es asi, pese a lo que dicen), so...","replies":[{"poster":"datbion","date":"2017-12-21T15:45:41.345+0000","up_votes":1,"down_votes":2,"body":"Si necesitas ayuda agregame, hablamos y tratare de hacer lo que pueda. mas no puedo ofrecer. Yo no soy el feminismo lucio22. Soy solo una persona en un foro de lol.","replies":[{"poster":"Lucio22","date":"2017-12-21T15:51:25.051+0000","up_votes":2,"down_votes":0,"body":"no sos el feminismo, es mas que obvio que, por lo que decis y como \"argumentas\", sos un intento de fenminazi nomas. \n\nsi realmente queres ser util para las mujeres, se parte de la solucion e ignora a las \"feministas\" de hoy en dia, y volve a las raices, a la primer ola del feminismo (que era el posta)\n\neso, o educa bien a tus hijos/primos/hermanos menores o todo aquel pariente cercano que sea menor a vos, porque esa es la otra forma de cambiar realmente a una sociedad, los pibes","replies":[{"poster":"datbion","date":"2017-12-21T15:56:24.550+0000","up_votes":1,"down_votes":4,"body":"Los movimientos evolucionan en funcion del contexto. \nSi el feminismo actual encontro tener mayor impacto de este modo, entonces la culpa no es del feminismo, sino del contexto que siempre lo ignoro. \n\nPonele este ejemplo simple. \nTe hablo en voz baja y no escuchas, te hablo en tono normal y no me escuchas, te grito y recien ahi me escuchas, entonces despues no reclames que deberian volver a la epoca en donde te hablaban en voz baja. \nNo se si se entiende.\n\nPero básicamente eso fue lo que paso con el feminismo.","replies":[{"poster":"Lucio22","date":"2017-12-21T17:06:28.975+0000","up_votes":1,"down_votes":0,"body":"...\n\n\nClaaaaaaaaro, no se le dio bola antes al feminismo... por eso es que no se les dio el voto, no se les permitió ser iguales en más de una forma (porque tampoco voy a negar que sea un 1 a 1, pero más de una desigualdad fue impulsada por las mujeres, como el hecho de que el hombre paga en las citas)\n\nSeguí nomas, que el \"impacto\" que están teniendo las fenminazis es sólo cómico y representan un chiste (como las fenminazis que fueron a hablar EN LA ONU y dijeron que las agredian porque \"recibían varios mails al día diciendo que daban asco\"... Lo peor es que dan asco, no por apariencia sino por como son como personas)","replies":[{"poster":"datbion","date":"2017-12-21T17:12:19.748+0000","up_votes":1,"down_votes":1,"body":"El abuso verbal es una agresión. No me imagino que andes en la calle diciendole a la gente que te da asco, porque si fuera asi no estarías en el foro sino en un hospital.","replies":[{"poster":"Lucio22","date":"2017-12-21T18:08:21.720+0000","up_votes":1,"down_votes":0,"body":"...\n\nComo dije, no es un \"das asco\" por apariencia sino por como son, como una que se quejaba de un juego porque \"era machista ya que todos los personajes son masculinos\" pero después decís que sf era \"machista porque se le permite al jugador golpear a las mujeres\", siendo que esas hipotéticas mujeres maltratadas son peleadoras como los hombres (y que es de lo que se quejaba del otro juego). ESE tipo de \"gente\", que no puede defender una puta idea ni tiene un parámetro definido para \"pensar\" (verbo excesivo en el caso de las fenminazis) son los que dan asco.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Bizantine","date":"2017-12-21T19:48:12.685+0000","up_votes":2,"down_votes":0,"body":"¡Saludos para las unidades de:** carbono, oxígeno, fósforo, nitrógeno, calcio y hidrógeno**!","replies":[{"poster":"datbion","date":"2017-12-21T20:47:15.717+0000","up_votes":1,"down_votes":1,"body":"Que tenia que ver...?","replies":[{"poster":"Bizantine","date":"2017-12-21T21:46:22.443+0000","up_votes":4,"down_votes":0,"body":"Casi todo considerando la composicion química del ser humano. Me parece que también podría ser inclusivo en términos prácticos; aunque largo de por sí.","replies":[{"poster":"datbion","date":"2017-12-22T08:32:43.656+0000","up_votes":1,"down_votes":1,"body":"Es tratar de ridiculizar el tema a partir de mal interpretar lo leido de forma intencional.","replies":[{"poster":"Bizantine","date":"2017-12-22T20:06:30.404+0000","up_votes":1,"down_votes":0,"body":"De forma minimizada, sip {{champion:35}} , pero en el sentido de la falta de lo macro en tus nobles objetivos.  Ya sea en lo rescatable del tópico  y también  lo ignorado o no considerado de la realidad de **Las**/ o Sudamérica.","replies":[]}]}]}]}]},{"poster":"Crawlpaw","date":"2017-12-21T17:11:25.158+0000","up_votes":4,"down_votes":0,"body":"Y sigue pensando que la \"insultan\" y \"tratan mal\" porque es mujer. Las ideas no tienen género amiga y tus ideas son realmente estúpidas.\n\nSaludos.","replies":[{"poster":"datbion","date":"2017-12-21T17:15:24.107+0000","up_votes":1,"down_votes":4,"body":"Si mis ideas fueran entupides entonces podrian mejorarlas, sin embargo solo las insultan y no postean nada mas que spam sobre jinx y urf.","replies":[{"poster":"Raton Marycon","date":"2017-12-22T07:36:57.663+0000","up_votes":2,"down_votes":0,"body":"{{champion:222}} {{sticker:sg-ahri-3}}   {{champion:21}}{{champion:103}}{{champion:37}}  {{sticker:sg-ahri-2}}","replies":[]}]}]},{"poster":"WhiteMax","date":"2017-12-21T14:51:26.788+0000","up_votes":2,"down_votes":1,"body":"En las escuela cuando tu maestra decia \"vengan niños\" tu le decias \"no maestra, debe decir vengan niñas y niños, porque somos 2 generos, y diga primero niñas\" (?).","replies":[{"poster":"datbion","date":"2017-12-21T14:59:56.221+0000","up_votes":1,"down_votes":9,"body":"En los primeros años en la escuela te dicen que no se pueden restar numeros chicos con numeros grandes, pero a medida que vas adquiriendo avanzando en tus estudios luego te explican como restar numeros pequeños con numeros grandes. \nTambien existe otro tipo de problema y es que en la escuela te enseñan que las piramides se hicieron con esclavos arrastrando piedras talladas. y actualmente realmente no se sabe. \n\nHay que tener la mente abierta para adquirir conocimiento.","replies":[{"poster":"Lince Salvaje","date":"2017-12-21T15:04:36.041+0000","up_votes":1,"down_votes":0,"body":"asique no tenes idea de como se armaron....\ntenes acceso a internet y no te molestas en buscarlo o.0  biieeeeen","replies":[]}]}]}]}