{"poster":"datbion","date":"2017-05-31T15:09:15.845+0000","title":"Mi novia me dejo y no se que hacer.","subforum":"Off-topic y temas personales","up_votes":4,"down_votes":18,"body":"Buena la conoci hace 2 a&ntilde;os, nos quisimos mucho pero por la realidad que se vive en argentina actualmente, nos distanciamos. \r\nResulta que hace dos a&ntilde;os antes, le habia advertido sobre la compleja situacion que se venia de la mano del actual presidente. Ella me dijo que no me iba a hacer caso, que macri era la solucion y me acuso de kirchnerista, siendo que a mi la politica no me importa, por eso puedo ser totalmente objetiva a la hora de decir que cristina fue lo mejor que le paso a la argentina. \r\n\r\nAhora con todo lo que paso, ella dejo de hablarme porque se siente muy avergonzada de admitir que se equivoco a la hora de votar y que yo tenia razon. Cuando encerraron a milagro sala, la primer presa politica de argentina, ella se devasto y se arrepentida de votar a macri. \r\n\r\nMe mando a decir por sus amigas que iba a ser todo para remediar lo que hizo y me volveria a hablar cuando ganara cristina. \r\nPero ella no entiende que no necesita hacer nada porque la gente ya se dio cuenta de su error, y que cristina vuelve dentro de dos meses para que este gobierno que nos separo a todos los argentinos, vuelve a unirse para salir de nuestra crisis.","replies":[{"poster":"stos mens xdxd","date":"2017-05-31T15:29:30.296+0000","up_votes":3,"down_votes":0,"body":"a los chori.","replies":[]},{"poster":"ZyXEL 001","date":"2017-05-31T15:42:06.883+0000","up_votes":2,"down_votes":0,"body":"https://i.ytimg.com/vi/m2eFXFsXsOc/hqdefault.jpg","replies":[{"poster":"datbion","date":"2017-05-31T16:18:39.865+0000","up_votes":1,"down_votes":0,"body":"que significa?","replies":[]}]},{"poster":"Zabivaka","date":"2017-06-01T01:05:08.744+0000","up_votes":2,"down_votes":1,"body":"Entre a ver los comentarios de bardo y hay pura politica, que asco","replies":[]},{"poster":"DJ ALEXXX","date":"2017-05-31T21:07:14.252+0000","up_votes":1,"down_votes":0,"body":"Todavía no entiendo como la estupida politica de esta país pueda tener el poder de separar personas ya sea amigos,familiares o parejas\nRealmente lamentable la verdad.","replies":[{"poster":"Dildo de Moria","date":"2017-06-01T15:21:40.082+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=r3port my t3am,realm=LAS,application-id=J8qpiO2I,discussion-id=oaGeqglY,comment-id=0008,timestamp=2017-05-31T21:07:14.252+0000)\n>\n> Todavía no entiendo como la estupida politica de esta país pueda tener el poder de separar personas ya sea amigos,familiares o parejas\n> Realmente lamentable la verdad.\n\nLa terquedad de la gente, y no por \"votó a tal y por eso es ignorante\", simplemente que ven lo que los medios quieren que vean y piensan que esa es la verdad. Es muy fácil encontrar diferencias entre programas como TN y CN5 en lo que dicen o muestran pero siempre vas a suponer que lo que dice uno de esos 2 es más verídico que lo que dice el otro, y eso genera la ignorancia ya que es mejor conformarse con lo que queres oir y cerrarte con que es así y además de eso discutir sólo para escuchar un \"tenés razón\" o hacer sentir inútil al otro que de verdad buscar una verdad. \nEs increible que hasta el día de hoy halla gente que diga que Cristina no robó nada o que Macri está haciendo una política limpia aún cuando saltaron temas como los Panamá Papers o el tema del Correo con la deuda ridícula que el turro de Franco Macri sostenía y que Macri le \"perdonó\"","replies":[]}]},{"poster":"EpicHit","date":"2017-05-31T18:45:07.588+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"datbion","date":"2017-05-31T18:46:18.468+0000","up_votes":1,"down_votes":0,"body":"El post se trata de mi pareja.","replies":[]}]},{"poster":"CoosmeD","date":"2017-05-31T17:48:41.339+0000","up_votes":1,"down_votes":0,"body":"mira flaco yo no soy macrista ni kirchnerista, yo solo espero que no vuelva cristina ni alguien influenciado por los kirchner al gobierno, no tengo nada en contra de macri yo lo vote y no me arrepiento, preferi un \"cambio\" que otros 4 años mas de kirchnerismo. Salu2 ah y una cosa con cristina la argentina no era y tampoco iba a ser potencia,todos vivian de planes sociales las chicas se embarazaban solo para poder cobrar los planes sociales explicama como un pais con ese tipo de gente podria llegar a ser potencia?. gg salu2","replies":[{"poster":"datbion","date":"2017-05-31T18:16:04.993+0000","up_votes":1,"down_votes":1,"body":"Primero, soy mujer, asi que sere flaca. \nSegundo, este post no es de politica por favor, estoy hablando de mi pareja. \nY tercero, te doy al razon en algo. Antes las personas de bajos recursos podian vivir con planes sociales hasta encontrar trabajo, habian 5% de pobres. Ahora no pueden vivir de nada y hay 30% y en aumento. \n\nYo no soy kirchernista pero soy objetiva, veo los numeros y la realidad es que antes estabamos muchisimo mejor que ahora. \n\nEspero que pienses en la argentina antes de seguir votando a este empresario que lo unico que hizo fue agrandar la desigualidad social solo para enriquecerse.","replies":[{"poster":"Milanga De Soja","date":"2017-05-31T18:36:38.515+0000","up_votes":1,"down_votes":0,"body":"Entonces sos lesbiana?","replies":[{"poster":"datbion","date":"2017-05-31T18:45:16.149+0000","up_votes":1,"down_votes":0,"body":"Soy bisexual.","replies":[]}]}]}]},{"poster":"Rendel","date":"2017-05-31T18:25:58.693+0000","up_votes":1,"down_votes":0,"body":"\"por eso puedo ser totalmente objetiva a la hora de decir que cristina fue lo mejor que le paso a la argentina.\" Eso no es ser objetivo.\n\n\"La objetividad es la cualidad de lo objetivo, de tal forma que es perteneciente o relativo al objeto en sí mismo, con independencia de la propia manera de pensar o de sentir que pueda tener cualquier sujeto que lo observe o considere\"\n\nhttps://es.wikipedia.org/wiki/Objetividad","replies":[]},{"poster":"Rendel","date":"2017-05-31T18:24:14.006+0000","up_votes":1,"down_votes":0,"body":"Claaaaaro con las estadísticas totalmente verídicas que te daba el INDEC no?\n\nSiempre hubo pobres, pero el lindo gobierno pasado no te quería mostrar las estadísticas reales, que ahora te las muestren es otra cosa.\n\nPD: Este es alto trollpost","replies":[]},{"poster":"CoosmeD","date":"2017-05-31T15:39:23.585+0000","up_votes":1,"down_votes":0,"body":"no te la creo","replies":[{"poster":"datbion","date":"2017-05-31T16:16:34.747+0000","up_votes":1,"down_votes":3,"body":"Si, todavia hay macristas pero son muy poquitos. Despues de las elecciones va ser como despetar de una horrible pesadilla.\nEspero que esta vez aprendan a valorar el gobierno que tuvimos que casi fuimos potencia con cristina.","replies":[]}]},{"poster":"Kyousuke","date":"2017-05-31T15:21:39.488+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"datbion","date":"2017-05-31T15:27:18.049+0000","up_votes":1,"down_votes":4,"body":"Y si, la verdad es impensado que cristina no vaya a volver, pero mi novia se bajoneo mal. \nOsea, ella  le creyo a los medios hegemoticos y al darse cuenta de que todas las denuncias contra cristina eran falsas, le cayo como un balde de agua fria.","replies":[]}]}]}