{"poster":"FunnyTimeWithLee","date":"2019-07-10T23:30:13.092+0000","title":"Rek'Sai","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Rek'Sai has not been one of the most used champions for a long time. I'm not sure if it's because players don't like her abilities, or if it's because of what I think is an unfair game. RIOT has been spending a lot of time into buffing and nerfing champions that players actually use, and because of that, I think they completely forgot about Rek'Sai. Now that most champs have been buffed or nerfed multiple times, I tried to play Rek'Sai and it did not go well. Out of 10 games I only had about 2 decent games. I will say this now because it is true. Rek'Sai needs a hard buff. I was jungle against evelynn and one of her individual spike would do as much damage as Rek'Sai's ultimate. Saying this Rek'Sai's maxes Ultimate would do about 400 damage. Evelynn's ultimate did about 880 damage. Rek'Sai has unique abilities and such, so I believe she needs a buff ASAP so players who actually play her can have fun not anger and disappointment. Even a rework wouldn't be bad for this champion. {{champion:421}}\nCan anyone that joins this discussion please take 5 seconds of their time and just click on yes or no below in the poll please. Would be very much appreciated to get as many upvotes as possible. Thank you! &lt;3 \n\nAlso oops the poll is meant to say: Do you think Rek'Sai should be buffed?","replies":[{"poster":"Ornn","date":"2019-07-12T18:46:59.149+0000","up_votes":1,"down_votes":0,"body":"rek sai is a strong championa dn pros like to pick her from time to time. Whats not okey is she has 3 skins and shes a 5 year old champion","replies":[]},{"poster":"Lord Sesshomaru","date":"2019-07-11T04:06:02.811+0000","up_votes":1,"down_votes":0,"body":"Rek'Sai is in a strange place in my opinion.\n\nI think a lot of the problems I have playing her stem from the fact that so much of her time is locked up in animations.  It takes ages to change states between burrowing and unburrowing.  Also, compare her tunnelling to someone like Lee Or Yasuo.  Theirs happens instantly, hers goes through a lengthy bumbling animation.  Her ult is just straight up weird, it has a strange amount of time of doing nothing for an effect that doesn't actually achieve a lot.  Apparently it's dodge-able _(but I've never managed to achieve that feat)_. It's just a confusing ability.  Her old ult was much more strategic and useful.\n\nAlso, she's been in the game for a long time, and I still don't quite know what she's meant to be. Her kit is definitely based around damage.  But she isn't bursty (or smooth) enough, to compete with proper Assassins. She's not squishy, but she's definitely not a tank.  Nor does she have the in-battle sustain to be on the same level with the juggernaut bruisers like Darius or Volibear.\n\nShe's great in the jungle, but _(at least to me)_ seems to fall short in most other places.\n\nI don't really know what she needs.  I think considering the pace most games are played at now, _(with most champs who matter in this meta, achieving near permanent 500+ MS, and little-to-no cast times)_ she needs to be made smoother, and not spend 1/3rd of her time stuck between attacks and in animations.","replies":[]}]}