{"poster":"VeterenMantis","date":"2015-05-16T21:52:39.901+0000","title":"Good Job Riot!! *Congradulations*","subforum":"Gameplay","up_votes":77,"down_votes":14,"body":"Ashe is broken? Nope, Balanced. Her AA&#039;s were clunky Now, they are not. Wile she lacks an escape she has gained a Damage Steroid. Frost shot is a passive, How it should have been from the start. Ashe&#039;s Hawkshot I am very pleased with. Oh, Riot, Do you know how long I have wanted to harm people for getting mad at me for missing one single ECA, like it was on some Guide-Rail, or something This was a much needed change.\n\nHonestly, Riot, Some times I wonder why you make the decisions you do. This Ashe is my dream ADC. I don&#039;t know how you managed to find the butter zone for my favorite Marksman. \n\nPlease keep up the good work.","replies":[{"poster":"Biff Manly","date":"2015-05-16T22:16:45.485+0000","up_votes":15,"down_votes":4,"body":"New Ashe makes me sad when I'm playing *against* her. Perma slow and reliable crit damage. Also her W does insane damage early on. That thing packs a punch for such a wide-spread attack.","replies":[{"poster":"kunkudunk","date":"2015-05-17T04:54:46.628+0000","up_votes":14,"down_votes":1,"body":"Her w damage is literally the same as it was before the rework.....","replies":[{"poster":"Biff Manly","date":"2015-05-17T05:07:17.626+0000","up_votes":4,"down_votes":2,"body":"Well yeah. But now that she can slow you forever starting from level 1, it's much easier for her to land it.","replies":[{"poster":"MrRado","date":"2015-05-17T14:22:48.565+0000","up_votes":7,"down_votes":0,"body":"Actually its harder for her to land if you're hiding behind minions.\n\nBefore rework, if two volley arrows hit the same minion, 1 would do dmg and 1 would pass THROUGH the minion.\n\nAfter rework, enemies can be hit by more than 1 arrow now, but they still only take damage for 1.  \n\nGrab your Braums!","replies":[{"poster":"Z Statistic","date":"2015-05-17T19:05:55.762+0000","up_votes":2,"down_votes":0,"body":"There's more of them so they can slip in more easily. I've hit W's I never would have before the change because of this.","replies":[]}]},{"poster":"Wheatloaf","date":"2015-05-17T15:43:22.284+0000","up_votes":3,"down_votes":0,"body":"It's a 5% slow at level 1...","replies":[{"poster":"Bhargo","date":"2015-05-17T21:46:17.661+0000","up_votes":1,"down_votes":3,"body":"*that stacks 5 times and is applied by each arrow from volley","replies":[{"poster":"Wheatloaf","date":"2015-05-17T21:48:30.350+0000","up_votes":5,"down_votes":0,"body":"Pretty sure the slow doesn't stack, only her Q does... Otherwise a 35% slow at level 18 stacking 5 times is a little much.","replies":[]},{"poster":"junglerboy16","date":"2015-05-18T17:13:03.885+0000","up_votes":1,"down_votes":0,"body":"completely not true and not even close to anything anyone has said about her slow.","replies":[]}]}]},{"poster":"kunkudunk","date":"2015-05-17T05:12:00.992+0000","up_votes":4,"down_votes":2,"body":"Before it was at level two and she would have a free crit at level 1. Don't pretend that she is so much better now for having her perma slow one level earlier especially when it is a smaller slow. Previously her early game was dump your free crit on the enemy then lane happily until you have items unless they had a healing support. Ashe relied on not wasting her first crit on a minion to not get dove on once the enemy lane hit level two. Now no crit gimic and the slow is weaker even if it comes a level earlier.","replies":[]}]}]},{"poster":"Teemo x Katarina","date":"2015-05-17T02:02:04.991+0000","up_votes":2,"down_votes":6,"body":"Yeah, I do like new Ashe but her base dmg for lower levels needs to be decreased in my opinion. Also, permaslow is nice, but maybe add a cd for procs at early lvl that disappears later on? With her range, that perma slow (and W dmg) really wrecks early game.","replies":[{"poster":"Bombkirby","date":"2015-05-17T02:48:11.266+0000","up_votes":5,"down_votes":0,"body":"She's one of the slowest and easiest ADCs to all-in though. Immobile ADCs should be threatening but inexchange they are easily dived onto. Her stun is horrible in close range.","replies":[{"poster":"Rew711","date":"2015-05-17T03:18:10.417+0000","up_votes":1,"down_votes":0,"body":"She also has one ability that may show anywhere on the map, but its only for 2 seconds and the cool down for each of the 2 are over 10 seconds.\n\nHer W now only deals the one damage to a target.\n\nHer Q is a good thing... The bonus damage isn't much and it takes practice to do. It isn't hard to master but it does put her up there with Caitlin and Jinx.","replies":[]}]},{"poster":"Myozthirirn","date":"2015-05-17T04:08:19.055+0000","up_votes":1,"down_votes":0,"body":"It alredy got a cd early on that dissapears at latter levels. Its called attack speed","replies":[]},{"poster":"Alëk","date":"2015-05-17T18:14:22.526+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Teemo x Katarina,realm=NA,application-id=3ErqAdtq,discussion-id=yaRel92g,comment-id=00010000,timestamp=2015-05-17T02:02:04.991+0000)\n>\n> Yeah, I do like new Ashe but her base dmg for lower levels needs to be decreased in my opinion. Also, permaslow is nice, but maybe add a cd for procs at early lvl that disappears later on? With her range, that perma slow (and W dmg) really wrecks early game.\n\nhonestly that poke is the only good thing about ashe early game. Old ashe actually had a stronger early game between her old passive and the fact that her W actually hit the enemy more often. Now literally one minion standing in front of Ashe can block her entire W, which is stupid IMO. thats why i feel that they should leave it as is. I do feel that ashe on a coordinated team will become a monster.","replies":[]}]},{"poster":"SelflessTeammate","date":"2015-05-17T17:42:07.478+0000","up_votes":2,"down_votes":0,"body":"As a jungler main, I've never been kited so hard in my life (okay, Kalista, but whatever, I try not to talk about her if I can help it). Ganking her has become unbelievably difficult. She hits me, takes two steps back. Repeat until I'm dead.\n\nIt's really difficult to deal with. I'm not complaining at all, I like that it's more difficult.","replies":[]}]},{"poster":"SnowStrider","date":"2015-05-17T00:14:27.501+0000","up_votes":9,"down_votes":5,"body":"I feel like new Ashe could be toned down A BIT, but i thinks its lovely they removed her old passive which rewarded you for not attacking and eventually became useless late game and moved frostshot to her passive. I feel like she needs a small bop to her early game damage and some other aspects but otherwise i feel like Riot did an okay job.","replies":[{"poster":"Rinky Dinky","date":"2015-05-17T05:17:07.018+0000","up_votes":5,"down_votes":0,"body":"No, she needs the power she has right now.\n\nShe is one of the easiest champs to jump on in the game","replies":[]},{"poster":"Yosuke Apperu","date":"2015-05-17T03:10:35.540+0000","up_votes":4,"down_votes":1,"body":"after they bop some other ad carries first.. if not they better not dare touch ashe, she's actually viable now and her ult still doesnt scale with ad..","replies":[{"poster":"Devack The Holy","date":"2015-05-17T11:11:43.390+0000","up_votes":2,"down_votes":1,"body":"Indeed. Nerf Kalista first.","replies":[{"poster":"Yosuke Apperu","date":"2015-05-17T16:56:56.253+0000","up_votes":1,"down_votes":0,"body":"oh but vayne tumble between autos is balanced *sarcasm* I remember when people said kalista needed buffs and was so bad... i was like ARE THESE PEOPLE SERIOUS... sadly they were serious","replies":[]}]}]},{"poster":"kunkudunk","date":"2015-05-17T04:57:06.953+0000","up_votes":2,"down_votes":1,"body":"Ashe is beyond fine. There are still plenty of adcs who do more damage than her early. The issue is that many people run away once they are hit instead of trading back so they think that ashe is a huge threat since running away from her is hard. Really most adcs can just blow her up, just not as easily now as before.","replies":[]}]},{"poster":"Snake Town","date":"2015-05-17T03:07:45.748+0000","up_votes":6,"down_votes":1,"body":"Spelling OP","replies":[]},{"poster":"VDc0zCqe0w","date":"2015-05-17T09:17:21.812+0000","up_votes":3,"down_votes":0,"body":"people who say \"she got permaslow!!1!! broken!!1!!\" crack me up as hell: she always had it and it was actually way stronger before (now it takes alot to scale with levels)","replies":[]},{"poster":"yobhguod","date":"2015-05-17T03:14:16.764+0000","up_votes":1,"down_votes":7,"body":"Ashe is WAY too strong with yer constant passive slow. She effectively has a built in FM for late game which is seriously broken. It honestly needs to have a internal CD or something.","replies":[{"poster":"Anidan","date":"2015-05-17T03:42:04.895+0000","up_votes":4,"down_votes":0,"body":"She always had that late-game. She just had to toggle it before, and its cost was pretty hilariously low so it was practically passive against any enemy champions.\n\nThis is nothing new. All it means is her former Q finally no longer has mana upkeep. And that she no longer has a shit passive. And she finally has some sort of steroid. \n\nThank God for this change. I freaking love Ashe even more.","replies":[{"poster":"Myozthirirn","date":"2015-05-17T04:10:36.865+0000","up_votes":2,"down_votes":0,"body":"Gp and shaco got a perma slow, old ashe got permaslow... nunu too?...\nNot that exotic at all","replies":[{"poster":"Anidan","date":"2015-05-17T05:02:01.753+0000","up_votes":2,"down_votes":0,"body":"Yep. It really isn't. And the fact you could get an Ashe Q in a Can as an item (if you could afford to get it, and if you're snowballing it can help stay ahead quite a lot) means it REALLY wasn't exotic in the slightest.","replies":[]}]}]}]},{"poster":"metaworldpeace10","date":"2015-05-17T17:29:10.131+0000","up_votes":2,"down_votes":0,"body":"Ashe is fine. No nerfs or buffs needed. Maybe some small qol fixes, but other than that she is fine.","replies":[]},{"poster":"Silents429","date":"2015-05-17T17:22:19.628+0000","up_votes":2,"down_votes":0,"body":"I actually like her place, and think to anyone suggesting nerfs for her needs to calm the hell down.","replies":[]},{"poster":"Rootworth","date":"2015-05-16T22:01:27.118+0000","up_votes":3,"down_votes":2,"body":"I like the new Ashe too, but I didn't mind the old one. I did go 16-0-9 in a ranked game with her 4 months ago. And about her old AA's, going AS quints and glyphs really helps.","replies":[]},{"poster":"Ironhand","date":"2015-05-17T16:37:09.145+0000","up_votes":1,"down_votes":0,"body":"WHY DID THEY MAKE {{champion:14}} BALANCED AND THEN NERF HIM? HIS WINRATE IS ALMOST AS BAD AS {{champion:26}} 's!!!","replies":[]},{"poster":"My Desired Name","date":"2015-05-17T16:06:18.066+0000","up_votes":1,"down_votes":0,"body":"When I saw the title of this post I was expecting sarcasm..","replies":[]},{"poster":"Gallowgrim","date":"2015-05-17T15:47:00.006+0000","up_votes":1,"down_votes":0,"body":"Just gave 'new' {{champion:22}}  a field test.\n\nThat Woad Ashe skin I got as a ? Skin now no longer feels of dubious use. Hell of a lot of fun,plays *really* well but doesn't feel overbearing.\n\nGood work, Riot.","replies":[]},{"poster":"Extreme Troller","date":"2015-05-17T15:05:56.238+0000","up_votes":1,"down_votes":0,"body":"she's nerfed tho. surprise crit is always what make adc so good.","replies":[]},{"poster":"CoolKnightST","date":"2015-05-17T12:19:38.901+0000","up_votes":1,"down_votes":0,"body":"On te first day of lcs she will get nerfed. Her E gives perma vision over dragon & baron add the same time. She can stack slow (really broken with red buff). Her damage is minimal but ones she get's IE it basicly dubbles.\n\nI like her position but I fear she will be gutted in the near figure.","replies":[{"poster":"Faded Lich","date":"2015-05-18T12:59:18.083+0000","up_votes":1,"down_votes":1,"body":"1. How does she have perma vision? It's got a long enough recharge rate on the skill, a cool down in-between ammo uses and it's not a skill you have any viable reason to rush out the door when W and Q are both there, waiting to be skilled. Hell, with it being global now, why waste it checking something a proper ward can do anyway? Better off jungler hunting so your jungler can effectively ambush and/or counter jungle.\n\n2. She has ALWAYS been able to perma slow...ALWAYS.......even from level one...This is not new...People are just bad. l2p. -hands rose colour glasses-\n\n3. Once more not sure why people say this, her damage isn't really minimal. It isn't the highest ADC damage in the game sure, but people are acting like her damge is down right ignorable lol. a W+5 stack Q means you're going to have HP issues early game if you're not careful. o_o","replies":[]}]},{"poster":"Mandaari","date":"2015-05-17T10:02:17.243+0000","up_votes":1,"down_votes":0,"body":"I like a lot about the rework but I wouldn't say her AA issue is fixed. The missile is faster, which is nice, but it still has a clunky wind up animation.","replies":[]},{"poster":"JustBoneBrook","date":"2015-05-17T08:35:22.862+0000","up_votes":1,"down_votes":0,"body":"Well ashe is not op at all she lack escape and dont got alot of brust but she do have a really strong DSP.\n+1 good work on ashe like it (i just want her to have some ap scale on other skil than her ulti but that a other thing.)","replies":[]},{"poster":"EverTokki","date":"2015-05-17T08:33:54.168+0000","up_votes":1,"down_votes":0,"body":"I agree. I love it. Feels like she busted her coffin.\nrip old ashe. welcome, new ashe.","replies":[]},{"poster":"Virgin Ray","date":"2015-05-17T07:15:29.745+0000","up_votes":1,"down_votes":0,"body":"I am really looking forward to Varus changes","replies":[]},{"poster":"djjomon","date":"2015-05-16T22:25:09.451+0000","up_votes":1,"down_votes":0,"body":"Riot gets it right sometimes. On the first try though? That's amazing. Keep up the good work! Your player base applauds you","replies":[]},{"poster":"FantasySniper","date":"2015-05-17T17:53:39.274+0000","up_votes":1,"down_votes":1,"body":"They're gonna have to nerf her [Q], though.\n\nShe was viable before, but now she just got a bunch of straight up buffs in everything but her CC.","replies":[]},{"poster":"Douche Draven","date":"2015-05-17T09:26:51.606+0000","up_votes":1,"down_votes":1,"body":"So this is what it feels like to not main Varus","replies":[]},{"poster":"FluxBound","date":"2015-05-17T02:09:36.336+0000","up_votes":1,"down_votes":1,"body":"._. I can't tell if this is sarcastic hate or love. Since it's from the boards, I'm gonna guess sarcastic hate","replies":[]},{"poster":"Juggernaut Jesus","date":"2015-05-17T01:56:14.573+0000","up_votes":1,"down_votes":1,"body":"[Congratulations?](https://www.youtube.com/watch?v=3NuFVQk_CCs)","replies":[]},{"poster":"FattyPainBringer","date":"2015-05-17T09:22:01.966+0000","up_votes":1,"down_votes":2,"body":"*walks into the room and sees the great circle jerk of trolls. figures out what they are stroking about. laughs so hard i fall in the floor. then i find a chair and watch from a safe distance and laugh some more and hope to play against their almighty ashe in ranked*","replies":[]},{"poster":"CreationFlaw","date":"2015-05-17T01:52:53.642+0000","up_votes":1,"down_votes":2,"body":"\"Frost shot is a passive\"\nTbh, I don't really like never being able to escape because I can't catch her nor run from her because she's a LONG ranged ADC, not a medium ranged. Other then that, I'm pretty okay with it, but it's a little oppressive early game where she's supposed to be weak but nobody can hit her.","replies":[]},{"poster":"qetzel","date":"2015-05-17T00:09:03.361+0000","up_votes":3,"down_votes":12,"body":"Ashe is broken. Reworked champions always take a patch or two for their win rates to rise to their true amount. \n\nI will leave a prophecy so vague that it can't possibly not come true in the hopes that future generations will be able to avoid the horror.\n\nOn the day where the sun rises in the East, there shall be a great battle and one side shall be the victors.\n\nHopefully the future generations will interpret that as \"Ashe is going to cause trouble in a few weeks\".","replies":[{"poster":"Yosuke Apperu","date":"2015-05-17T03:12:04.169+0000","up_votes":1,"down_votes":3,"body":"Riven is still a thing tho... way more broken but yet no complaints about her \"a sword mirrors it's owner\" :3","replies":[]}]}]}