{"poster":"Ingratitud","date":"2018-10-29T22:10:00.852+0000","title":"¿Quién es esa artista del LOL? Es InuStar","subforum":"Creaciones de la comunidad","up_votes":10,"down_votes":0,"body":"[     ](https://i.imgur.com/ZGA7rbN.jpg?no_redirect)\n\n &emsp; &emsp; &emsp; &emsp; &emsp; &emsp; &emsp;Hola invocadores, hoy damos inicio al decimocuarto episodio de\n\n#&emsp; &emsp; &emsp; &emsp; &emsp; &emsp; &emsp; &emsp;&iquest;Qui&eacute;n es esa artista del LOL?\n\n\n&emsp; &emsp; &emsp; &emsp; &emsp; &emsp; &emsp;&emsp; &emsp; &emsp; &emsp; &emsp; &emsp; &emsp;Con ustedes **InuStar**\n\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/1mGu7z5.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/wlY4Ml3.jpg?no_redirect\n\n &emsp; &emsp; &emsp; &emsp; Por si perdieron el episodio anterior Isaki o quieren ver el resto de la serie\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect &emsp;&emsp;&emsp;&emsp;&emsp; &emsp; &emsp; [Isaki](https://boards.las.leagueoflegends.com/es/c/creaciones-de-la-comunidad/u821g7AK-quiaon-es-esa-artista-del-lol-es-isaki) &emsp;&emsp;&emsp; O &emsp;&emsp; [Verlos todos](https://boards.las.leagueoflegends.com/es/player/LAS/Ingratitud?content_type=discussion)\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect Para saber el motivo de la publicaci&oacute;n tard&iacute;a de la entrevista, [entra aqu&iacute; ](https://boards.las.leagueoflegends.com/es/c/off-topic-y-temas-personales/G4lhJWEN-este-vienes-no-hay-quiaon-es-esa-artista-del-lol)\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect Sin nada m&aacute;s que decir, conozcamos a nuestra invitada =)\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/ZWNaKDG.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n**Hola Inu, gracias por aceptar la invitaci&oacute;n &iquest;H&aacute;blame un poco sobre ti?**\n\n_Hola! Mi nombre es Jenifer, tengo 19 a&ntilde;os y actualmente estudio Ing. En Dise&ntilde;o Industrial. Soy de M&eacute;xico, estoy 100% segura que juego en LAN hahaha a veces los confundo la verdad. Me gustar&iacute;a hacer mucho m&aacute;s fanart de LoL porque aunque la gente puede llegar a ser t&oacute;xica a la hora de jugar, eso no evita que disfrute mucho de su comunidad, en especial cuando juegas con amigos, que para mi cuenta m&aacute;s! Parte de mi quisiera trabajar para Riot hahaha pero creo que ese sue&ntilde;ito est&aacute; muy lejos._  ;_;\n _GRAN parte de mi quiere hacer muchas cosas al mismo tiempo pero no se puede! Creo yo._\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/8LEmB5r.jpg?no_redirect \n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n**Siempre que uno crea una obra, sin importar el medio uno deja una parte de si en sus creaciones.**\n**&iquest;C&oacute;mo definir&iacute;as tu estilo en base a c&oacute;mo eres de persona? Y &iquest;Tambi&eacute;n como dejas que tus sentimientos influyan en tus creaciones?** \n\n_Si lo pones de esa forma, yo dir&iacute;a que es algo mixto, todav&iacute;a no siento que tenga un estilo definido por lo que he llegado a pensar al ver mis dibujos que veo artistas diferentes ah&iacute;, alguien muy especial para m&iacute; ha llegado a mencionar que se notan mis inspiraciones en mis dibujos y me hace muy feliz porque realmente eso intento, pero a la vez tener un estilo propio, lo cual en lo personal siento que todav&iacute;a me falta, como no puedo ver mi arte de una forma &ldquo;fresca&rdquo; no sabr&iacute;a qu&eacute; caracter&iacute;sticas de mi persona se plasman en mis ilustraciones personales o a mi estilo en general. Para la segunda pregunta vendr&iacute;an siendo los colores, en ocasiones hago mis ilustraciones muy coloridas y en otras pongo tonos c&aacute;lidos, aunque, si no me siento con humor no dibujo para nada, necesito las ganas para dibujar algo._\n\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/b029qK0.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n\n**Hay un trabajo tuyo que me cautivo. Por lo que te divid&iacute; en dos grandes pregunta InuStar.**\n\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://66.media.tumblr.com/7dd069c0b444de6c1b783a2a1e5960ac/tumblr_pg7h48VJj31wppvldo1_400.gif\n\n\n**&iquest;C&oacute;mo es el proceso para crear un trabajo como este? Desde tu herramientas que usas hasta la elaboraci&oacute;n propia del trabajo.**\n\n_Hahahaha, el proceso fue m&aacute;s simple y r&aacute;pido de lo que uno piensa, tuve la motivaci&oacute;n suficiente para terminarlo el mismo d&iacute;a que lo bocet&eacute;, actualmente utilizo Paint Tool Sai para dibujar a pesar de que tengo comprado el Clip Studio Paint (No he tenido tiempo de practicar), pasa que fue como una iluminaci&oacute;n divina la idea de ese dibujo, los efectos los hice con ayuda de Giphy  que ten&iacute;a esa opci&oacute;n de darle esos tonos; originalmente solo se iban a cambiar las im&aacute;genes de la &ldquo;ventana&rdquo; poco a poco pero me gust&oacute; como se vio el efecto que te daba la p&aacute;gina anterior mencionada por lo que as&iacute; qued&oacute; el trabajo final._\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  \n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n**&iquest;Qu&eacute; significa para ti? Veo que tu animaci&oacute;n tiene muchas referencias. Seria genial que pudieras contarnos m&aacute;s sobre ella.** \n\n_Cada semana realizo una encuesta en mi Twitter dando varios opciones de personajes para hacerles fanart, es algo que empec&eacute; a hacer hace no mucho para crear fanarts semanalmente, o al menos eso intento!, Madotsuki de Yume Nikki fue la ganadora de un fanart semanal, y es b&aacute;sicamente ella la del dibujo, lo que representa cada &lsquo;frame&rsquo; del Gif son solo algunos de los efectos que puedes conseguir en el juego, no quise dibujar todos porque no todos me llamaban la atenci&oacute;n y me daba flojera honestamente :p Me sorprende y alegra el impacto que tuvo ya que a muchos m&aacute;s de lo que yo pensaba les gust&oacute; el dibujo tomando en consideraci&oacute;n lo poco que me tard&eacute; en hacerlo, muchas gracias por su gran inter&eacute;s en ello! Me gusta mucho ese juego aunque soy muy floja y lenta con los fanarts as&iacute; espero internamente que no piensen que har&eacute; m&aacute;s fanarts de ello (de LoL si, obvio ;) )._\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/tJ4f70C.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n**Entiendo, gracias por compartirlo. Eso me abre una nueva interrogante, sobre tu origen &iquest;Por qu&eacute; empezaste a dibujar?** \n\n_Por qu&eacute; empec&eacute; a dibujar&hellip;. Cuando era muy chica compart&iacute;a el cuarto con mi hermana, y conviv&iacute;amos mucho haciendo varios dibujos, me toc&oacute; convivir cuando estaba en su etapa de otaku haha por lo que ella ya se hab&iacute;a interesado por el dibujo desde entonces, hac&iacute;amos muchas cosas que implicaba dise&ntilde;ar monitos o hacer tarjetas tipo Yugioh pero con personajes de Kingdom Hearts(un muy lindo recuerdo!) y sent&iacute; que yo tambi&eacute;n quer&iacute;a hacer lo mismo! Podr&iacute;a decir que mi hermana mayor es de mis primeras y grandes inspiraciones cuando se trata de dibujar, nunca me hab&iacute;a puesto a pensar en ese entonces que quer&iacute;a dedicarme a eso pero por alguna raz&oacute;n no he dejado de dibujar, desde que tengo memoria he estado rodeada de anime y videojuegos y el arte de los mismos es lo que me ha llamado la atenci&oacute;n sin saber realmente en su momento qu&eacute; eran, vaya, me gustaban mucho el arte de las tarjetas de Yugioh pero estaban en ingl&eacute;s y yo no sab&iacute;a ni para qu&eacute; eran!!_\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/39CUZ1k.jpg?no_redirect\n\n######  https://i.imgur.com/zY7yU50.jpg?no_redirect  _Never give up! _\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/xl4DnTL.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n**&iquest;Qu&eacute; te motivo a continuar? &iquest;Qu&eacute; te inspira a crear actualmente?**\n\n_Todo el arte que me rodeaba en ese entonces, recuerdo que me fascinaba el arte de Disgaea (Por lo que uno de mis alias viejos es Prinny), Persona, Metal Slug, Magical Drop, Animal Crossing, yo creo que har&iacute;a un pergamino enorme en cuanto a juegos  que me inspiraron y me inspiran hoy en d&iacute;a, algo que hizo ampliarme en cuanto a dibujar y dise&ntilde;ar personajes fue Homestuck, fui parte de una muy linda comunidad y grupo de Facebook que aprecio de todo coraz&oacute;n y siempre estar&eacute; agradecida de haberme unido, me hizo menos t&iacute;mida en cuanto a mis dibujos, me di&oacute; personas especiales que amo con todo mi coraz&oacute;n hasta este d&iacute;a y me abr&iacute;o muchas puertas, no tengo miedo de decir que me gusta Homestuck, es algo del que estoy orgullosa porque fue gran parte motivador para m&iacute; como artista. Ahora adem&aacute;s de eso, me inspiran los dem&aacute;s artistas y sus logros, como verlos y decir &ldquo;yo tambi&eacute;n quiero hacer eso!&rdquo; o &ldquo;yo quisiera lograr algo as&iacute; tambi&eacute;n&rdquo; me motivan mucho, puede que llegue a tener bajones y pensar que no lograr&eacute; algo as&iacute; pero eso no me ha detenido para seguir intent&aacute;ndolo y mejorar cada d&iacute;a que puedo, tambi&eacute;n dir&iacute;a que cierta persona super especial me motiva en saber c&oacute;mo puede reaccionar, siempre esperando que sea de forma positiva!!! Creo que me fui muy lejos haha, me inspiran muchos artistas pero no soy muy buena recordando los nombres en general, si pudiera decir unos en espec&iacute;fico seria a Xavier Houssin (M&aacute;s conocido por su arte de Dofus y Wakfu), George Kamitani (Odin Sphere, Muramasa), Takehito Harada (Disgaea) para mencionar a algunos._\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/Io1DTaA.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n**Ya veo InuStar. &iquest;Qu&eacute; tan importante crees que son tus seguidores o la comunidad que te rodea?** \n\n_MUCHO, valen mil cada uno de ellos, todo su apoyo de cualquier forma, monetaria o no, es muy importante para m&iacute;, su participaci&oacute;n significa mucho para m&iacute; por lo que a veces si me entristezco cuando pregunto algo o pido sugerencias y no recibo mucho a pesar de que se ve que muchos me siguen :&rsquo;) pero eso no significa que los que si participan aunque pocos, no importen, al contrario , me alegra porque se toman el tiempo de detener el scroll para ver la publicaci&oacute;n y pensar en una respuesta!!! Igual los que comparten para que mi arte llegue a m&aacute;s personas y poder expandirme!  Como me gusta mucho crear mercanc&iacute;a me es muy importante la opini&oacute;n de los dem&aacute;s para saber si les gusta o no lo que estoy creando o si es buena idea, a pesar de que lo que quisiera crear como mercanc&iacute;a sean cosas m&aacute;s originales que fanart, de igual forma lo tomo muy en cuenta, por eso me gusta mucho a ir a eventos aunque puede llegar a pasar que no vaya a muchos porque no me da el tiempo o la motivaci&oacute;n suficiente_ ~_~ _pero cuando voy es re-lindo que la gente te diga sin miedo que les gusta tu arte y que sigas as&iacute;! Es como si te dijeran los comentarios que dejan en tus dibujos, la sensaci&oacute;n es muy linda! Aunque no lo digo a menudo(o m&aacute;s bien, aunque no lo digo para nada), espero y sepa la gente que me sigue y apoya de cualquier forma que es muy v&aacute;lida para m&iacute; y les agradezco de coraz&oacute;n que lo hagan!_\n\n\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/RtuYnIV.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/JrDfr5D.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n\n **&iquest;C&oacute;mo es tu relaci&oacute;n con otros creadores/artista de la comunidad?**\n\n######  https://i.imgur.com/zY7yU50.jpg?no_redirect  _se toma su tiempo para responderla la pregunta_ \n\n_No sabr&iacute;a definir mi relaci&oacute;n con otros artistas en una sola palabra, es m&aacute;s bien un, me encuentro en las sombras casi porque quiero, &oacute;sea, no soy muy buena manteniendo una relaci&oacute;n (o conversaci&oacute;n en general) con muchas personas! Si conozco a varia gente que crea contenido para la comunidad de LoL pero puedo contarlos con una mano :&rsquo;) se podr&iacute;a decir que mi relaci&oacute;n seria &ldquo;neutral&rdquo; y &ldquo;casi escasa&rdquo;, y honestamente no me siento /tan/ mal al respecto o no me siento con la necesidad de hacerlo, pero tampoco estoy ahuyentando a la gente, espero y no me tengan miedo o algo porque diga que no me importa si me relaciono con los dem&aacute;s o no._\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/KM7pFsk.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n\n**Algo que me llamo la atenci&oacute;n es como te defines en las redes sociales:**\n**_Ilustradora digital y  estudiante Ing. Dise&ntilde;o Industrial_ **\n**&iquest;Puedes contarnos sobre tus planes para tu futuro? &iquest;C&oacute;mo es combinar tu arte con una carrera de una Ingenier&iacute;a de Dise&ntilde;o Industrial?**\n\nBueno lo que pasa es que b&aacute;sicamente el Dise&ntilde;o Industrial se trata de crear e innovar objetos que puedan dar soluciones a ciertos requerimientos espec&iacute;ficos que el p&uacute;blico pida (Aqu&iacute; te puedes ir por much&iacute;simos caminos como Dise&ntilde;ador Industrial, eres un impartidor de las tendencias, un artesano, etc.! Recomiendo una investigaci&oacute;n personal, no mucha gente conoce esta carrera y me gustar&iacute;a que m&aacute;s gente lo hiciera~). Para planes a futuro no tengo nada fijo, hay much&iacute;simas cosas que quisiera hacer pero es cuesti&oacute;n de organizaci&oacute;n y perseverancia. Me gustar&iacute;a mucho crear mi propia marca de art&iacute;culos/vestimenta/papeler&iacute;a porque es algo que disfruto hacer la verdad! Alg&uacute;n d&iacute;a~\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://66.media.tumblr.com/79fd8301308a1be8c0b41a0cc0b3ea14/tumblr_pbx83oQ9RP1wppvldo1_1280.png\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n**Entiendo. &iquest;C&oacute;mo es tu vida? El d&iacute;a a d&iacute;a &ldquo;normal&rdquo; de InuStar.**\n\n_Tomando en cuenta de que soy actualmente una estudiante dir&iacute;a que gran parte de mi d&iacute;a vendr&iacute;a siendo la escuela, despu&eacute;s ser&iacute;a afortunadamente comer y ya ver si quiero dibujar, ver videos o hacer tarea, aunque muchas veces me pongo a  hacer las tres al mismo tiempo lo cual es p&eacute;sima idea hahaha pero procuro hacer la tarea(HAGANLA), dir&iacute;a que juego League of Legends pero depende mucho de cuantas ganas tengo de jugar, no soy muy fan de jugar sola porque no me da la misma sensaci&oacute;n, pero de vez en cuando juego para que no se le olviden los controles porque se me va muy feo el rollo;; En pocas palabras, desayunar, ir a la escuela, comer, dibujar/escuchar videos de fondo/dormir._\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/iaMwxWI.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n**Interesante, en tu carpeta se ven muchos trabajos tuyos de &iacute;ndole variados. Tienes &iquest;Cartoons o Anime favoritos? &iquest;M&uacute;sica o Pel&iacute;culas que te fascinen? Y &iquest;Qu&eacute; otros videojuegos te gustan?**\n\n_Para responder Cartoons tendr&iacute;a que tomar en consideraci&oacute;n mi memoria porque tengo MUCHISIMOS de mi infancia que me gustan mucho aaaa pero si puedo decirte anime favorito! Ya que no he visto casi muchos, esos serian Jojo&rsquo;s Bizarre Adventure, Mononoke, Kaiba, Sakura CardCaptor, Hellsing, Space Dandy, etc. La m&uacute;sica es muy variada para m&iacute;, cuando quiero concentrarme me pongo el ost de Breath of the Wild o de Wind Waker, usualmente instrumentales vaya, para otro tipo de m&uacute;sica me gusta mucho el Rock, Pop, Clasico, Metal&hellip;preferir&iacute;a solo mencionar los grupos o canciones que oigo porque no es nada fijo realmente, me gustan muchas canciones de Imagine Dragons, pero tambi&eacute;n de AC/DC, varias canciones que tocaba antes en los Guitar Hero :P Obvio tengo una que otra de League of Legends, el remix de The boy Who Shattered Time (versi&oacute;n exclusiva para mi &hearts; que amo mucho), As We Fall y Legends Never Die. Uuuhhh Pel&iacute;culas&hellip;. Igual es una lista muy muy larga, as&iacute; que creo que mejor digo cuales son las que me acuerdo ahorita que me fascinan que ser&iacute;a Summer Wars, Paprika, Perfect Blue, Mulan, Book of Life, What we do in the Shadows, Spirited Away, Howl&rsquo;s moving castle, The Cat Returns, Fantastic Mr.Fox, Ace Attorney, Kung fu Panda, ETC. Creo que aqu&iacute; me perder&iacute;a de igual forma~ Ahora si, de videojuegos podr&iacute;a ser m&aacute;s especifica que los puntos anteriores y vendr&iacute;an siendo The Legend of Zelda, Ace Attorney, Castlevania, Kirby (Crystal Shards es mi favorito aunque Marx es mi personaje favorito y no sale ah&iacute; :P ), Harvest Moon, Stardew Valley, Dofus , Okami, Odin Sphere, Disgaea, No more Heroes, Hotline Miami, Muramasa: The Demon Blade, Ouendan, VA-11 Hall-A, A Hat in Time, Starbound, Bloodborne, Cuphead, Undertale, Cave Story, Dark Souls , y bueno, entre muchos ,muchos m&aacute;s~_ \n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/rhmTaAa.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/pL1fViW.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n**Ya que sacamos el tema de los videojuegos y  esta serie trata sobre artista del LOL. H&aacute;blanos de tu faceta como invocadora.\n&iquest;C&oacute;mo conociste el LOL? Desde cuando juegas?**\n\n_Oof, le&iacute; la pregunta y en mi cabeza sali&oacute; luego luego una persona en espec&iacute;fico, una persona que es muy especial para m&iacute;, que amo y aprecio con todo mi coraz&oacute;n, no les ha pasado cuando a esa persona especial le interesa mucho algo que no sabes de que va o m&aacute;s bien, no sabes por qu&eacute; le divierte tanto y le hace tan feliz? Pues eso me pas&oacute;, yo quer&iacute;a saber por qu&eacute; le gustaba tanto y poder compartirlo, interesarte tambi&eacute;n por el juego. Obvio esa persona ya ten&iacute;a experiencia desde hace mucho por lo que fue m&aacute;s divertido y lindo ir aprendiendo, as&iacute; fue b&aacute;sicamente como conoc&iacute; LOL. Llevo jugando&hellip;&hellip;..HAHA mi memoria no da para tanto pero estoy casi segura de que llevo jugando desde que sali&oacute; Ekko, o que no llevaba tanto desde que sali&oacute;, para mi fue como una revelaci&oacute;n ver su tr&aacute;iler, el momento en el que lo vi, no jugaba LOL pero yo sab&iacute;a que ese ser&iacute;a mi main, su video me encanto, su canci&oacute;n es de mis favoritas y me sigue dando la misma emoci&oacute;n que me dio la primera vez que lo vi, empec&eacute; usando a Tristana porque se me hace relinda y me gusta mucho, pero poco despu&eacute;s esa misma persona me regal&oacute; Ekko asi que oops :P_\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/Jang683.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n**&iquest;Cu&aacute;l son tus campeones favoritos? O &iquest;Rol favorito?**\n\n_EKKO Y JHIN &hearts; Bueno, me gustan muchos campeones (Tristana, Lulu, Soraka, Evelynn,etc.) pero definitivamente mis ultra favoritos los amo mucho gracias diosito por crearlos, seria Ekko y Jhin, Jhin es literalmente perfecci&oacute;n para m&iacute;, una mezcla de caracter&iacute;sticas que me encantan de un personaje junto con muchos factores m&aacute;s, y Ekko es un cari&ntilde;o que he tenido desde que lo vi :&rsquo;) Y &iquest;Rol favorito? Me es mas f&aacute;cil decir mi rol menos favorito, que ser&iacute;a Jungler, lo cual es ironico porque veo que usan a Ekko mas como jungler que como yo lo pongo, que es en Mid (No me peguen porfa! No s&eacute; mucho de campeones y sus l&iacute;neas aaa) Aunque ahora que lo pienso, si, me gusta mas ir Mid pero tambi&eacute;n Support, depende mucho de con qui&eacute;n ir Support, si voy con la persona anterior mencionada con gusto voy a supportearle, me encanta hacerlo aunque es un pro master y debo corretearle para que no sufra ning&uacute;n rasgu&ntilde;o!! Uso Support Soraka/Lulu y obvio Mid Ekko &hearts; Aunque es la l&iacute;nea que m&aacute;s piden al inicio._  T_T \n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/EXVlgYs.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n\n**Tambi&eacute;n  &iquest;Buffearias o nerfearias alguno? Y &iquest;Tiene alg&uacute;n shippeo dentro del juego?**\n\n_Perd&oacute;nenme la vida pero cuando mencionan esas dos palabras realmente no s&eacute; qu&eacute; significa, pero as&iacute; dici&eacute;ndolo sin referencia alguna, me gustar&iacute;a que nerfearan a Morgana, no s&eacute; porque siento que siempre ha sido muy op!!! Y Buff? Haha, pues Ekko y Jhin ;) (Si estoy en lo incorrecto con lo de buff y nerf me voy a ver muy mensa lo siento muchito)_\n\n_HAHAHAHA &iquest;Jhin y Yo cuenta como ship? Espero y si hehehe, realmente no shippeo a nadie en el juego, nunca me ha interesado hacerlo, a lo mejor las &uacute;nicas ships que son realmente canon las disfruto pero tampoco es como si me la pasara pensando quien se mirar&iacute;a lindo con quien (adem&aacute;s de que te lo mencion&eacute; antes hehe)._\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://66.media.tumblr.com/349aceb88c58d6e43ebcef1ea0f9f351/tumblr_p9mga4sDo91wppvldo1_1280.png\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n\n**Algo que nunca puedo dejar de preguntar. Si tuvieras la oportunidad de crear un aspecto para Riot Games.**\n**&iquest;Qu&eacute; campe&oacute;n y tem&aacute;tica seria?**\n\n_Ooh&hellip;&hellip; Al principio pens&eacute; que  era si cre&iacute; que preguntar&iacute;as si crear un campe&oacute;n y ya me estaba imaginando mil y un maneras en las que quisiera hacer un campe&oacute;n aunque entiendo que es un proceso dif&iacute;cil y largo! Pero veo que es de skin. Le dar&iacute;a otro aspecto a Jhin, y me gustar&iacute;a que fuera una tem&aacute;tica m&aacute;s sombr&iacute;a, con s&iacute;mbolos y colores oscuros , no tengo un nombre espec&iacute;fico para una tem&aacute;tica as&iacute; pero  con que se vea algo muy &eacute;l, todo bien por mi &hearts;_ \n\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/E774Sr7.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n\n# https://i.imgur.com/zY7yU50.jpg?no_redirect  &emsp; &emsp; &emsp; &emsp; Otros trabajos de InuStar\n\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect   https://i.imgur.com/GRkNBjI.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect   https://66.media.tumblr.com/04d7e8c2afabed73391fb16b90f69a62/tumblr_p4b837hacy1wppvldo1_1280.png\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/jwVzAmw.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://66.media.tumblr.com/419411b81206985bc05863f9e59e6ead/tumblr_p5hxijWJAk1wppvldo1_1280.png\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect   https://66.media.tumblr.com/8c40bd45c2151692e347b1ab2c3f7042/tumblr_pfqov8fVJh1wppvldo2_1280.png\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://66.media.tumblr.com/f8aa2a3e3f70fd35385222fafd6e00d0/tumblr_p9pjczyxMZ1wppvldo1_1280.png\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/mpGlbiX.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/jGQhgC5.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/memJZy0.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n**Y para acabar el post, &iquest;algo que quiera compartir InuStar ?**\n\n_S&eacute; un buen invocador y aunque la reputaci&oacute;n que tiene LoL de toxica no se vaya a quitar en mucho tiempo o nunca, no significa que no puedas hacer tu un cambio a un alrededor! Divi&eacute;rtete con tus amigos y recuerda que es solo un juego que une a la gente. Me divierto jugando vi&eacute;ndolo de esa manera y me alegra mucho que me hayan introducido a league of legends por tener una gran comunidad de creadores de contenido. Muchas gracias por la entrevista y si leyeron hasta ac&aacute; que lindo de tu parte se agradece mucho &hearts; Espero y les haya gustado!_ \n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/ZGA7rbN.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect    Si les gusto el arte de InuStar, dejo su redes sociales\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect       donde pueden ver más de su arte.\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  [Twitter](https://twitter.com/inustarart?fbclid=IwAR1qsjc1JiNBqvy0FGYzWrftCpjQwomMNX4-ailWnTwsoMBkeg15Iyl1ULA)    [Facebook](https://www.facebook.com/Inucakes/?tn-str=k*F)    [Tumblr](https://inustar.tumblr.com/)     [Instagram](https://www.instagram.com/inustarart/)\n\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect     Gracias InuStar por compartir tu arte y tiempo\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect     Y también a ustedes invocadores por entrar al post.\n\nhttps://i.imgur.com/zY7yU50.jpg?no_redirect  https://i.imgur.com/4xXAvUE.jpg?no_redirect\n\n> _Aviso: El viernes 2 de noviembre, coinciden el nuevo episodio de  &iquest;Qui&eacute;n es ese artista del LOL? y la tercera, ultima parte de Inktober 2018.\n> Debido a esto, es posible que solo un episodio sea publicado ese d&iacute;a y el otro dejada para posterior. A su vez que tambi&eacute;n hay un post especial en marcha XD._","replies":[{"poster":"StąrDust","date":"2018-10-29T22:31:45.519+0000","up_votes":2,"down_votes":0,"body":"Muy lindo el estilo de dibujo, me encanta.","replies":[]},{"poster":"JudioPobre2","date":"2018-10-30T00:03:07.861+0000","up_votes":1,"down_votes":6,"body":"esto es arte? hacer un par de mujeres de un juego(generalmente semidesnudas) para ganar fans adolecentes?\nencima es espantoso el estilo de dibujo, eso hacia yo cuando estudiaba y tenia un poco de tiempo libre, solo que no les hacia unas buenas tetas ni caderas, o porque no soy mujer tal vez tenga algo que ver tambien en el porque nunca tuve exito?\nla verdad no se, pero esto ya es cualquier cosa...\ny no quiero ofender a nadie, ya que es mi opinion, asi que se pueden ahorrar los negativos y los comentarios bardeandome por tenes un pensamiento distinto al de ustedes.","replies":[]}]}