{"poster":"Boldstriker","date":"2016-04-16T21:23:03.243+0000","title":"Cali di fps... *sigh*","subforum":"Aiuto e supporto","up_votes":5,"down_votes":1,"body":"Ciao a tutti,\r\nHo riscontrato da pi&ugrave; di 3 settimane a questa parte (circa) che il gioco tende ad avere dei valori di frame per secondo *molto* problematici, specie quando si tratta di teamfights.\r\n\r\nEseguo regolarmente pulizia dei dischi di memoria e deframmentazione (eseguo pulizie dettagliate con Ccleaner, in aggiunta), ho una macchina che risponde a questo nome e caratteristiche:\r\n**Samsung RF511**\r\nScheda video: Nvidia GeForce GT 540M (impostata per eseguire *tutti* i programmi del mio pc al posto della intel dedicata.).\r\n\r\nUltimamente mi ritrovo in accentuata difficolt&agrave; perch&eacute; durante le partite (di ogni genere, alcune pi&ugrave;, altre meno) ho dei pesanti cali di fps.\r\n\r\nE di questi problemi non ne ho mai avuti! :(\r\nHo scaricato Nvidia GeForce Experience, per tenere sempre aggiornati i driver della scheda video, e ho fatto ottimizzare le impostazioni grafiche di League of Legends dal suddetto, e mi ha impostato tutto al massimo livello: Ombre, dettagli ambiente, campione ed effetti.\r\n\r\nStasera ho fatto un paio di partite e ho notato che, anche impostando la grafica al livello &quot;Very Low&quot; ho *sempre* questi fastidiosi cali di fps.\r\n\r\nNon uso programmi per registrare, non tengo aperto Steam (anche se l&#039;ho sempre tenuto aperto ma non mi ha mai dato problemi), non sono connesso con Browsers, non uso &quot;programmi di terze parti&quot; di nessun genere... Eeeee che altro, io questi problemi non ne ho mai avuti :( e gioco dalla season 3.","replies":[{"poster":"MyDogHasAut1sm","date":"2016-04-17T19:12:14.628+0000","up_votes":2,"down_votes":0,"body":"https://support.riotgames.com/hc/it/articles/201752684\n\nil supporto della riot è stato l'unico che mi abbia effettivamente aiutato con gli fps, è immediato e facile da capire al contrario ~~della blizzard~~ di altri","replies":[]},{"poster":"Chroniicles","date":"2016-04-17T09:35:57.587+0000","up_votes":2,"down_votes":0,"body":"Non ricordo se te l'avessi già detto in un topic precedente, ma prova se disabilitando i suoni il problema sparisce.\nC'è da dire anche che è normale che col tempo i requisiti minimi cambino, il gioco viene continuamente aggiornato (e appesantito) e lo stesso hardwarw che prima ci permetreva di giocare bene risulti poi inadeguato","replies":[{"poster":"Yamero Senpai","date":"2016-04-17T14:48:28.745+0000","up_votes":2,"down_votes":0,"body":"io ho avuto un problema simile, giocavo in 1366x 1280 con 30 fps fissi e in teamfight 15 circa, dopo che ho messo a 1360x1280 e capped a 25 fps non ho avuto più problemi. Un altra cosa per l'OP, se giocavi a massimo e hai cambiato in minimo senza risultato, vai in costum ed apri task manager, vedi quanti cpu/gpu prende LoL, incaso fai double click e setti a massima priorità su LoL, ho avuto lo stesso problema\n\nEdit: rispondo a chroniicles inquanto è il post più rilevante così vedi pure il mio :^","replies":[]}]},{"poster":"Giovarco","date":"2016-04-17T17:30:44.885+0000","up_votes":2,"down_votes":1,"body":"Provato a bloccare gli fps a 30? Appesantisce meno la mia GT630M, soprattutto ora che inizia il caldo.","replies":[]},{"poster":"Skeltur","date":"2016-04-17T00:09:12.328+0000","up_votes":2,"down_votes":1,"body":"ti consiglio di scaricare razer cortex, è un programma che concentra le prestazioni del pc solo sul game, lo uso da due anni visto che il mio computer fa schifo :)\nComunque dai anche una controllata alle ventole, tante volte è soltanto la polvere, scarica uno di quei programmi per vedere la temperatura e vedi se si surriscalda","replies":[]},{"poster":"MustangFirestorm","date":"2016-04-20T10:52:50.562+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Boldstriker,realm=EUW,application-id=98NGV4Al,discussion-id=QXeOMztn,comment-id=,timestamp=2016-04-16T21:23:03.243+0000)\n>\n> Ciao a tutti,\n> Ho riscontrato da pi&amp;ugrave; di 3 settimane a questa parte (circa) che il gioco tende ad avere dei valori di frame per secondo *molto* problematici, specie quando si tratta di teamfights.\n> \n> Eseguo regolarmente pulizia dei dischi di memoria e deframmentazione (eseguo pulizie dettagliate con Ccleaner, in aggiunta), ho una macchina che risponde a questo nome e caratteristiche:\n> **Samsung RF511**\n> Scheda video: Nvidia GeForce GT 540M (impostata per eseguire *tutti* i programmi del mio pc al posto della intel dedicata.).\n> \n> Ultimamente mi ritrovo in accentuata difficolt&amp;agrave; perch&amp;eacute; durante le partite (di ogni genere, alcune pi&amp;ugrave;, altre meno) ho dei pesanti cali di fps.\n> \n> E di questi problemi non ne ho mai avuti! :(\n> Ho scaricato Nvidia GeForce Experience, per tenere sempre aggiornati i driver della scheda video, e ho fatto ottimizzare le impostazioni grafiche di League of Legends dal suddetto, e mi ha impostato tutto al massimo livello: Ombre, dettagli ambiente, campione ed effetti.\n> \n> Stasera ho fatto un paio di partite e ho notato che, anche impostando la grafica al livello &amp;quot;Very Low&amp;quot; ho *sempre* questi fastidiosi cali di fps.\n> \n> Non uso programmi per registrare, non tengo aperto Steam (anche se l&amp;#039;ho sempre tenuto aperto ma non mi ha mai dato problemi), non sono connesso con Browsers, non uso &amp;quot;programmi di terze parti&amp;quot; di nessun genere... Eeeee che altro, io questi problemi non ne ho mai avuti :( e gioco dalla season 3.\n\n\n\nStesso tuo problema.. e notebook samsung rc520 .. risolto semplicemente smontando e pulendo la ventola... ero arrivato ad un punto che in teamfight avevo gli fps a 04 .. ora dopo aver pulito ho gli fps fissi a 60 per tutto l'arco della partita","replies":[]},{"poster":"Boldstriker","date":"2016-04-17T12:55:44.482+0000","up_votes":1,"down_votes":0,"body":"Grazie a tutti per il supporto! ^^","replies":[]},{"poster":"BigPatata00","date":"2016-04-16T23:41:33.616+0000","up_votes":1,"down_votes":0,"body":"Io con la Nvidia 330(si, il mio portatile a febbraio raggiunge i 10 anni) ormai faccio 60 fps durante la lane con tutto disattivato e molto basso, nei fight se sto sui 30 è un miracolo, ma dopo 2-3 partite mi si surriscalda il pc e gioco con 3-10 fps massimo(\"gioco\").\nPoi magari è solo un periodo in cui hai cali di fps(sul pc nuovo faccio piu di 60 fps sempre, ma a giorni non si puo giocare per gli sbalzi), purtroppo non so neanche io perchè.\nSpera che non abbiano alzato i requisiti minimi altrimenti ti troveresti nella mia situazione(che fa schifo), _Good Luck!_","replies":[]}]}