{"poster":"Whitesse","date":"2016-05-30T03:34:42.023+0000","title":"(Petición / Sugerencia) Este no es dominion | Visión","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"El modo de juego &quot;Este no es dominion&quot; me encant&oacute;, tanto que en este fin de semana solo jugue ese modo de juego, ni normales, ni ranked, ni aram.\nVoy al punto, la &quot;problematica&quot; que encontr&eacute; en este modo de juego es que los personajes que se hacen invisibles sacan muchisimo provecho como {{champion:84}}  o {{champion:91}} , y se me ocurri&oacute; que para el pr&oacute;ximo evento se implemente un {{item:2043}} pero que solo haga visible a las unidades invisibles que pasen por la zona, NO que de visi&oacute;n de una zona, NO que desactive o revele trampas invisibles, sino que revele a los personajes invisibles.\n\nEl {{item:2047}} no es viable ya que si morís se te va el item y en un modo de juego que las peleas son constantes no te rinde.\nBye{{champion:17}}","replies":[{"poster":"Numerítos","date":"2016-05-30T03:44:45.862+0000","up_votes":1,"down_votes":0,"body":"estan estos dos tambien: {{item:3185}}  {{item:3187}}","replies":[{"poster":"fenakz","date":"2016-05-30T04:03:13.143+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Númeritos,realm=LAS,application-id=v7qsfXsE,discussion-id=wPzuTXPp,comment-id=0000,timestamp=2016-05-30T03:44:45.862+0000)\n>\n> estan estos dos tambien: {{item:3185}}  {{item:3187}}\n\nExactamente existe esos 2 items para revelar al enemigo . Tanto aram como este no es dominion","replies":[]}]},{"poster":"Truco","date":"2016-05-30T03:47:45.542+0000","up_votes":1,"down_votes":0,"body":"También seria buena idea añadir algo que permita a campeones como {{champion:64}} {{champion:55}} hacer jump ward, pienso que muchas de sus mecánicas de juego son perdidas por la inexistencia de los wards y mas en estos modos, no digo que metan wards en el modo, solo que estaria bien implementar algo nuevo que ayude en ese detalle.","replies":[]},{"poster":"Sonya Kyron","date":"2016-05-30T07:09:47.427+0000","up_votes":1,"down_votes":2,"body":"tan facil como apretar el 4, era matarlos... a demas tenias 6 bans...\nTe lo dice alguien con 92% de winrate en ese modo, te haces mucho problema y ganas poco.","replies":[{"poster":"Whitesse","date":"2016-05-30T23:43:31.712+0000","up_votes":1,"down_votes":0,"body":"Que tiene que ver ? Es solo un pink ward que revela los enemigos cercanos sin tener que banear a X campeón.\n\"te haces mucho problema y ganas poco.\" Si no queres ayudar de alguna forma al LoL y la comunidad no se que haces en los foros.","replies":[]}]}]}