{"poster":"Lord Sesshomaru","date":"2015-05-13T10:37:52.728+0000","title":"Champion mastery not working?","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"I was just wondering with the champion mastery, it is implied that once you reach crests 4/5 you will be rewarded with:\r\nCustom emote (what is this?)\r\nLoading screen badge \r\nAnnouncement banner \r\nRole tile \r\ni just reached crest 4 with Azir, but in the games afterward there was no loading screen badge, (i dont know what a custom emote and an announcement banner are, so i dont know if i have that but nothing seems different anywhere so i dont think so,) i do however have a new role title so the system has recognised that i am at crest 4, i just dont have any of the other stuff which is kinda disappointing as i was looking forward to what i saw in the &quot;champion mastery is live!&quot; page\r\nalso on that page it shows the crest actually in game above LB, Lee, Wukong and Xin&#039;s heads and yet i have never seen this on anyone even myself and even after i reached crest 4 \r\nso i was wondering are these things in the game yet or are they still coming or is it bugged?\r\nit seems weird to advertise them on the &quot;its live&quot; page if they arent in the game yet tho \r\ncould someone help me with this?\r\nthanks :)","replies":[{"poster":"DrBoxface","date":"2015-05-13T11:05:03.231+0000","up_votes":1,"down_votes":0,"body":"Mine took a day until I could use my custom emote for mastery. when I got it I couldn't use it, I think their needs to be a higher level cap though....{{champion:8}} ","replies":[]},{"poster":"TheEverydayWiz","date":"2015-05-13T10:41:29.165+0000","up_votes":1,"down_votes":0,"body":"It's once you get to max mastery i.e 5/5 levels.","replies":[{"poster":"GoldenTomat0","date":"2015-05-13T10:46:45.713+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheEverydayWiz,realm=OCE,application-id=Ntey9fRZ,discussion-id=AoI8NJIY,comment-id=0001,timestamp=2015-05-13T10:41:29.165+0000)\n>\n> It's once you get to max mastery i.e 5/5 levels.\n\nyou get the emote, badge, and announcement banner at rank 4. they just get better at rank 5.\n\napparently there are a few bugs and stuff to work out with champion mastery not working properly","replies":[]}]},{"poster":"FideiAngelus","date":"2015-05-13T10:40:54.521+0000","up_votes":1,"down_votes":0,"body":"Custom emote is when you're in game, you can press CTRL + 6 to show what mastery level you are (only you and your teammates can see it)\nLoading screen badge appears on the top left hand side in the loading screen IIRC\n\n[This is what it looks like](http://puu.sh/hLDQA/7961912b05.jpg)","replies":[]}]}