{"poster":"Lord Sesshomaru","date":"2017-04-03T01:45:18.291+0000","title":"Are Wolf's marks even worth going for anymore?","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Kindred has been my favourite jungler since her/their release, and she has been in some strong and weak spots in her life.\r\n\r\nThe main part of early game kindred is tracking wolfs marks through the jungle. But recently that seems like a less and less viable thing to do.\r\n\r\nShe isn&#039;t strong atm, and the champions who are strong (and popular), completely ruin her (Lee, Kha, Hec etc). So duelling it out with the enemy jungler is basically impossible for her in the early stages of the game.\r\n\r\nPlus with the new marking system introduced a patch or two ago (marks spawn more regularly and last for a shorter time), she spends most of her time chasing marks (that you know are gone even before you even go for them). And loses out on farming and ganking time.\r\n\r\nGetting the mark, recalling, and then returning to the jungle, is just enough time for the next mark to spawn (50 seconds), its not enough time to get a camp or two in between.\r\nAnd if you don&#039;t go for your marks as soon as they spawn, you don&#039;t have any  chance of getting them.\r\nIf the enemy jungler is even half competent, they **will** get your marks far before you do. (she has the lowest movement speed in the game, Lee has the highest, and she has to travel twice the distance to get to them. Do the maths.)\r\nIts just luck if the mark happens to spawn in a camp thats on the opposite side of the map to Lee.\r\n\r\nSo you are in a cycle of forever chasing marks (that most of the time are either gone, or have a 5/1 Lee Sin waiting next to them.) so not only do you miss tons of farm by wandering aimlessly in the jungle, but not getting the mark puts you further and further behind.\r\n\r\n_________\r\n\r\nSo my question is:\r\nIs it even worth going for Wolf&#039;s jungle marks anymore? (except scuttle and dragon)\r\nIs it better to just mark laners and spend your time ganking and farming instead? Completely ignoring the marks in the jungle.\r\n\r\nIf anyone who is really good with kindred, or is a higher elo, could give me some advice on this, that would be awesome.\r\n\r\nIm not slow going for my marks, I time when I get them, and I know what camps are the ones likely to be marked next, and time myself to be in at least the river when the next mark spawns. But every Kindred game for the last week, has been me just running into empty camps, or into Lee. I either die, or escape without a mark, recall/respawn, get back into the jungle seconds before the next mark comes up, and the whole process repeats.\r\n\r\nWhat should I be doing?\r\nThanks","replies":[{"poster":"Arkangyle","date":"2017-04-03T05:14:11.609+0000","up_votes":3,"down_votes":0,"body":"I take it more as an opportunistic approach. You can either get marks through getting the camps (which carries all the usual inherent risks but with the added bonus of rewarding the opposition for being more proactive in their counter-jungling), or through successful ganks.\n\nThe few Kindred games I've played, I've taken Wolf marks if and only if the opportunity presents itself, rather than going out of my way for it.\n\nIn itself it can be a kind of counter-jungling - if the enemy Lee thinks you're coming for it and is waiting for you, it gives you a really good opportunity to gank the opposite side of the map.","replies":[{"poster":"Lord Sesshomaru","date":"2017-04-03T10:23:31.543+0000","up_votes":1,"down_votes":0,"body":"Thats really good advice, thanks!\n\nShe still needs marks to be effective though, so if the opportunity doesn't arise, it does put you in a bit of a tight spot, that would be my only concern.","replies":[]}]},{"poster":"FatedSaviour","date":"2017-04-04T09:54:06.387+0000","up_votes":1,"down_votes":0,"body":"up until they removed smit buffs, kogmaw could do anything kin could do, better","replies":[]},{"poster":"Talon12","date":"2017-04-04T00:38:54.638+0000","up_votes":1,"down_votes":0,"body":"Mobies get you there fast enough","replies":[]},{"poster":"Knuuckles","date":"2017-04-03T10:12:58.858+0000","up_votes":1,"down_votes":0,"body":"The only way you can perform well on kindred is by obtaining marks and farming until you have core items almost any junlger is stronger than kindred until she has marks and bork","replies":[]}]}