{"poster":"Lord Sesshomaru","date":"2017-04-26T02:00:16.129+0000","title":"Sivir E Rakkan Q Interactions.","subforum":"Miscellaneous","up_votes":4,"down_votes":0,"body":"When Rakan fires Q at Sivir, her spellshiled blocks Rakan&#039;s Q, but it still returns to him with a heal. Which doesn&#039;t seem right seeming she successfully spell-shielded the ability, and the whole purpose of the ability is a heal.\n\nI can see this being ok with Morgana&#039;s shield, as that isn&#039;t an ability blocker, its a magic shield with an extra effect.\n\nBut what I don&#039;t see, is why Rakan&#039;s Q comes back with a heal, while Thresh&#039;s Q is completely shredded when it hits Sivir&#039;s shield, _(Thresh cant pull himself to her, it completely cancels all aspects of his Q)_ But Rakan&#039;s Q isn&#039;t canceled, only the damage is blocked.\n\nWhy does the shield act in different ways for both Thresh and Rakan?\nSurely have either Rakan&#039;s whole Q blocked (meaning it wont come back with a heal), or have it so Thresh&#039;s Q can still have its secondary effect (pulling himself to her)\n\nBut it makes no sense for it to work two different ways?\nThoughts?","replies":[{"poster":"Project Xayah","date":"2017-04-26T03:33:20.289+0000","up_votes":3,"down_votes":0,"body":"I think it's important to consider the differences in the abilities. Thresh's Death Sentence effectively has 2 abilities within it, one that can only be activated on a successful cast of the other. In order for Thresh to pull himself to the target, his Death Sentence would need to affect them (similarly to Lee Sin's Sonic Wave). Rakan's Gleaming Quill, on the other hand, simply needs to strike the target for the \"additional effect\" to trigger (Similarly to Dr Mundo's Infected Cleaver, though I don't know what interaction this has with spell shields).\n\nIt would probably be worth it to test out the interactions that other abilities with an aspect that benefits the caster on a successful hit will be fully blocked by spell shields, or blocked to the extent that applies to the individual with the spell shield. Other than Dr Mundo's Infected Cleaver (health back on hit), I can only think that Kha'Zix's Evolved Taste Their Fear (CDR on hit) would be applicable.\n\nIt would make sense for simplified clarity that they all just work the same, but the subtle differences between abilities can be enough to change their nature in a variety of aspects.","replies":[]},{"poster":"Ninox","date":"2017-04-29T09:31:34.875+0000","up_votes":2,"down_votes":0,"body":"Hmm, I just payed a game vs Siv and I didn't think it did come back with the heal, but I also wasn't really paying attention to that since I was just trying to bait out the shield. I shall have to investigate.","replies":[]},{"poster":"Essembie","date":"2017-04-30T11:12:12.891+0000","up_votes":1,"down_votes":0,"body":"doesnt leos work the same?","replies":[]},{"poster":"Mortis Ex","date":"2017-04-29T07:12:56.150+0000","up_votes":1,"down_votes":0,"body":"Well it is interesting, the Sivir ability description says blocks an enemy ability cast on Sivir, but it also effects aoe afaik, things like Malph R, Cho Q and both interactions with Vi R, it stops you from being picked up and slammed if youre the target and also stops the little bump if she hits you otw to target. \nMy interpretation is that Rakan needs to hit someone to get the heal but he didnt actually hit Siv due to the shield. But im not sure of the exact way the shield is coded. \nIf an Eve ults Siv but she shields it does Eve get the shield for hitting a champ with R? This should be pretty easy to test.","replies":[]},{"poster":"Roguestoney","date":"2017-04-26T02:42:14.066+0000","up_votes":1,"down_votes":0,"body":"I agree.","replies":[]}]}