{"poster":"Lord Sesshomaru","date":"2017-05-25T23:34:53.902+0000","title":"Noooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo!","subforum":"Miscellaneous","embed":{"description":"Welcome to Ask Riot! Let's talk Azir, old-patch game modes, and skins becoming champs. We looked at doing this recently for a series of internal playtests, because we wanted to experience first-hand whether things like pacing or counterplay felt very different a few years ago.","url":"http://nexus.leagueoflegends.com/2017/05/ask-riot-classic-mode/","image":"http://nexus.leagueoflegends.com/wp-content/uploads/2017/05/LOL_CMS_087_Social_1200.jpg"},"up_votes":2,"down_votes":0,"body":"http://cdn.smosh.com/sites/default/files/legacy.images/smosh-pit/092010/starwars-11.jpg\n\nThe dreaded day has arrived, my beloved....\nAs much as I wished it would not.\n\nYou were unique, and this cruel world hated you for it!\nI feel your skillcap dropping and your popularity rising, as the huddled masses eagerly grasp with greedy appendages at that which was once out of their reach! The thought brings sadness to my soul, and I pray it shall not be the case.\n\n&#039;counterplay&#039; they call it, as if justified!\nFor how can one condemn your existence, while demons such as Draven, Darius, Lee, and The Unforgiven roam free!\n\nYou have lost much my friend, passives, knockups, tower-taking, and now they continue to take!\n\nBe warned Wav3Break! greatness comes not from uniformity and compliance, the disease that has taken so many champions already. But rather from those who are difficult, different, and stand out on the edge where others fear to tread.\nI pray this is not lost on you, Azir&#039;s fate is in your hands now, do not fail him as others have failed their updated champions!\n\nWhatever happens, you shall not be forgotten Azir!\nI shall fight on, in whatever form you take, with the true emperor always in my heart!\n\n_**In brightest day, in blackest night.\nThe empire shall be reclaimed, as is your right!\nLet all those who would aid in evil&#039;s plight.\nBow their heads -- under Shurima&#039;s might!**_\n\n{{champion:268}}","replies":[{"poster":"Mozzie25","date":"2017-05-26T05:28:19.948+0000","up_votes":2,"down_votes":0,"body":"I feel you might be, being a tad melodramatic Sessh","replies":[{"poster":"Ninox","date":"2017-05-26T05:37:27.812+0000","up_votes":1,"down_votes":0,"body":"I wanna say I'd be the same but when they said they were gonna touch my Vel'Koz and my Zyra I was concerned but then pleasantly surprised in the end. \n\n@Sessh I think you should wait until you actually get to play the changed Azir before you get too deep into it, you never know, you might like the changes. Riot is pretty good at keeping the feel of champions well and truly intact with these small/mid scale changes while also making them much healthier and easy to balance in the long run.","replies":[{"poster":"Lord Sesshomaru","date":"2017-05-26T06:01:50.061+0000","up_votes":1,"down_votes":0,"body":"Oh for sure I will reserve judgement until I've played him of course. \nBut when you like something, it doesn't matter wether it's being replaced by something better or worse, it hurts to have it taken away!\nMost people would rather have a paintball gun than a teddy bear. But you'd still be sad if someone took away the teddy you had when you were a kid. :P haha\n\nMore so It's the principle I dislike. I agree with large scale updates of way outdated champs like Sion and Yorick, but changing them for 'balance' or 'popularity' reasons doesn't sit right with me. and once you change something once, theres no reason why you cant just change it again at any time (like what they did with Kog)\n\nthat being said though, I will approach the new Azir with only a small degree of prejudice, but mostly with an open mind :P\n\nI do NOT want him to be popular though! that was one thing that made Azir great, he was so underplayed and you had to work so hard to be good at him, so unlike other champs it actually felt like an accomplishment.\nIf he is easier to play and everyone is playing him, he wont feel like himself anymore. \n_(imagine if Urgot was the most popular champ, it just woudn't feel right)_","replies":[{"poster":"Mozzie25","date":"2017-05-26T06:47:57.677+0000","up_votes":1,"down_votes":0,"body":"I was mostly joking anyway :P. I'm still salty over the Quinn rework so I can't talk haha.","replies":[{"poster":"Lord Sesshomaru","date":"2017-05-26T08:21:39.419+0000","up_votes":2,"down_votes":0,"body":"I must admit, it was cool turning into a bird :P haha\nits a shame to see that gone :/","replies":[{"poster":"Mozzie25","date":"2017-05-26T08:36:15.637+0000","up_votes":1,"down_votes":0,"body":"I miss it so much. Screaming into lane at 1000 miles and hour and straight up murdering vaynes was so much fun","replies":[{"poster":"Ninox","date":"2017-05-26T10:42:46.229+0000","up_votes":3,"down_votes":0,"body":"KAKAW BITCH","replies":[{"poster":"Mozzie25","date":"2017-05-26T10:44:58.801+0000","up_votes":3,"down_votes":0,"body":"Why can't I upvote this twice","replies":[{"poster":"Lord Sesshomaru","date":"2017-05-26T11:51:58.592+0000","up_votes":2,"down_votes":0,"body":"Don't worry! i gotchu!","replies":[{"poster":"Mozzie25","date":"2017-05-26T12:13:17.938+0000","up_votes":2,"down_votes":0,"body":"Good guy Sessh","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Lord Sesshomaru","date":"2017-05-26T06:02:51.676+0000","up_votes":2,"down_votes":0,"body":"What can I say :P\nI love Azir a little too much xD","replies":[]}]},{"poster":"Fitzky","date":"2017-05-26T08:00:47.397+0000","up_votes":1,"down_votes":0,"body":"WHERE'S THE DAMN LEE REWORK???!!! LIKE AZIR IS A BIGGER PROBLEM OVER LEE SIN","replies":[{"poster":"Anonymous Alias","date":"2017-06-03T12:06:43.286+0000","up_votes":1,"down_votes":0,"body":"'Lee sin scales badly'\n\none shots the enemy adc who is 16/8 at 40 mins while being tanky with 3200hp and doing most damage by the end of the game.\n\nLee sin, to be accurate, is a early to mid game legend and falls off 'slightly' late game.\nSure he is high risk high reward but he has so much mobility for someone who is supposed to be tanky and he has a lot of burst damage. He can also close gaps easily and create gaps. \n\nA lee sin rework would be a great idea to make him more of a duelist or fighter rather than a bursty tank who has amazing playmaking potential.","replies":[]},{"poster":"Lord Sesshomaru","date":"2017-05-26T08:24:19.836+0000","up_votes":1,"down_votes":0,"body":"ikr!\nid love to see the statistics of people who have trouble with Azir vs people who have trouble with Lee.\n\nAlas, popularity wipes clean all sins! _(Just look at trump for proof)_\nSo Lee will likely remain unchanged and un-nerfed :(","replies":[{"poster":"Fitzky","date":"2017-05-26T09:33:02.671+0000","up_votes":1,"down_votes":0,"body":"Watch Diamond+ say \"Lee is weak lmao\" like the rest of the players aren't having a hard time","replies":[{"poster":"Lord Sesshomaru","date":"2017-05-26T10:16:51.521+0000","up_votes":1,"down_votes":0,"body":"I do love the logic of the game.\n97% of players are gold and below. The majority of those are in bronze or low silver.\n\n_\"Lets balance the game at plat level!\"_","replies":[{"poster":"Fitzky","date":"2017-05-26T10:54:07.535+0000","up_votes":1,"down_votes":0,"body":"It's good to know Riot made the right decision in giving you the Distinguished role, pretty much the only special boards member whose opinion echoes that of the player base {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Lord Sesshomaru","date":"2017-05-26T13:41:27.536+0000","up_votes":1,"down_votes":0,"body":"I appreciate the confidence haha thanks :)\n\nBut I think all of the coloured boards members are as much in love with this game as the rest of us, and each of them goes above and beyond to try and make this community a better place for everyone. _(of all of them, I'm sure I'm the one that does the least :S)_\n\nSo I think their beliefs and desires are very well aligned with those of the community! But a lot of their work goes unnoticed to many. \n\nI just happen to be loud, annoying and opinionated xD\n\nMy only goal is to improve the game I love, and ill express whatever view I think will accomplish that, even if just slightly. \n\nI am very proud to have a purple name, and I hope I haven't disappointed those who gave it to me! But it isn't a 'pledge of unwavering allegiance', nor would Riot want it to be! \nIf I feel that what Riot is doing is hurting this game, I wont hesitate to say so. Likewise if I think the community is wrong! And ill be the first to agree with either if I think their path offers the best for the game.\n\n\nThat is how I feel I can best serve the community. \nBy being a distinguished member that can be a little 'rough-around-the-edges' sometimes, that people can relate to, and discuss anything with.\n\n_(when people disagree with some of Riot's decisions for the game, it can for some people, feel like their voice isn't being heard. So I hope that seeing a purple name raising tough points occasionally that they can identify with, shows people that they aren't alone, even in touchy matters.)_\n\nThe coloured names _(Red included)_ are here for the community after all! ^^\n\nThats my philosophy anyway xD\nyou can always rely on me to speak my mind about the game :P\nmaybe thats one of the reasons why I was selected? ","replies":[]}]}]}]}]}]},{"poster":"LevvyLeviticus","date":"2017-05-26T05:44:07.470+0000","up_votes":1,"down_votes":0,"body":"well not i can tell my friend hes not the only good at azir","replies":[]},{"poster":"Nightjar","date":"2017-05-26T02:00:22.824+0000","up_votes":1,"down_votes":0,"body":"I feel that a good balance to azir would be to have azir work on an energy like system 'Sand' rather than mana. As stupid as this sounds this would actually keep azir's difficulty and shift him more towards battle-mage and short term control dps, rather than oppressive zone control and lategame teamfight control dps.\n\nImo Azir's problem is when put in the hands of pros, his dps and range make him really oppressive, and his lategame ranged dps and his ability to split a fight and then spear enemies with soliders makes him problematic to balance.\n\nGiving Azir 'Sand' could also make his combo's more risk-reward and make him have to toss up how he's going to position his soliders and allow you to give him back some of power and flexibility back. Having an energy type resource would mean that when and how he positions his soldiers becomes even more important, whilst also making him strong in lane.\n\nThen again I'm a silver (I feel bronze) player so I'm probably completely wrong in how to approach a minor rework.","replies":[{"poster":"Ninox","date":"2017-05-26T05:25:15.255+0000","up_votes":1,"down_votes":0,"body":"Honestly, in theory that sounds like a really good idea. I imagine Riot's concern with something like that is that there would still be far too large a gap between the average Azirs and the god tier ones. After all, if a champion is completely ineffective to begin with, why would you bother to continue learning him? For a huge number of people the answer would be just don't.\n\nSo I think the idea is to make him more accessible as well as more healthy which unfortunately means making him easier. Hopefully though, he will hit the mark of \"easy to learn, really hard to master but you'll be super dope when you do\" that some other more difficult champs like Ori and Xayah have hit. Really I think that's the ballpark they should be aiming for with most champions.","replies":[]}]}]}