{"poster":"Lord Sesshomaru","date":"2017-07-26T12:04:04.053+0000","title":"Wow.. O_O thats cool.","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"I really really like the new Urgot.\r\nNot just riding the hype train I swear.\r\n\r\nI will admit to not being a player of old Urgot, but as an Aurelion Sol main, I can appreciate someone who has to focus so hard on positioning. \r\n\r\nI think his W is too strong, and probably shouldn&#039;t work on towers, but its a really neat ability!\r\n\r\nI was keen to try him out, found myself really enjoying his kit, and the fact that you are a tank with a positioning focused playstyle is just plain fun!\r\nI was playing crabgot _(pretty nice skin)_ but the real selling point was when he pulled out a top-hat and just started dancing....\r\n\r\nYou...\r\n\r\n\r\nYou just can&#039;t upstage that...","replies":[{"poster":"Fitzky","date":"2017-07-27T03:31:07.475+0000","up_votes":2,"down_votes":1,"body":"A tanky ranged bruiser who shreds tanks, he won't be op for long....","replies":[{"poster":"Lord Sesshomaru","date":"2017-07-27T05:55:57.150+0000","up_votes":2,"down_votes":0,"body":"I hope so!\n\nPersonally I am fond of them nerfing champions into oblivion.\n\nIt means no one plays them, so you get to feel unique, and because you practice with them so much, it doesn't matter how weak or strong they are because you just get good with them anyway.\n\nPlus the feeling of accomplishment is so much stronger when you win a game with Aatrox or Azir than it is when you win with Darius or Master Yi.\n\nIt's why I get so annoyed with champs like Lee or Yas who are godlike when played by masters, but also damn good when played by complete knobs...","replies":[]}]},{"poster":"Maraudaur","date":"2017-07-27T01:39:18.538+0000","up_votes":2,"down_votes":0,"body":"Havent had a chance to try him yet! really need to get in some games today! {{champion:6}}","replies":[{"poster":"Lord Sesshomaru","date":"2017-07-27T05:50:52.985+0000","up_votes":1,"down_votes":0,"body":"Have fun!\nHopefully you're able to get him.\n\nIm really impressed with how fun he is to play :D\n\nIm guessing he is easier to play from the red side, because then its easier to see your front legs _(the ones you use most often)_ and if they are charged or not, but I've only played him from the blue side so far.\n\nthe top hat though... whoever did that, gets full marks!","replies":[]}]},{"poster":"Broken Scripts","date":"2017-07-27T15:43:47.090+0000","up_votes":1,"down_votes":0,"body":"I love his ult. I just laugh whenever someone gets mauled. Also, stealing kills with it.\n\nFeelsgood.","replies":[{"poster":"Lord Sesshomaru","date":"2017-07-27T23:51:53.824+0000","up_votes":1,"down_votes":0,"body":"If you ult someone while they are inhabited by Kayne.\n\nDo you get a double ;)","replies":[{"poster":"CHEESYLEEKS","date":"2017-08-04T00:23:41.666+0000","up_votes":1,"down_votes":0,"body":"🤔 What if tahm kench is super low and swallows a super low adc? 🤔","replies":[]}]}]},{"poster":"Klavinmour","date":"2017-07-26T14:35:14.959+0000","up_votes":1,"down_votes":0,"body":"I played old Urgot a lot, I'm surprised I don't have mastery with him, but whatever.\n\nI like new Urgot, I don't like the builds some people are doing, Ruunans really?","replies":[{"poster":"Lord Sesshomaru","date":"2017-07-26T19:17:56.053+0000","up_votes":1,"down_votes":0,"body":"Historically I have been a player of the old updated champs (Taric, Aatrox, Galio etc), but not this time. \n\nRuunans does seem like a strange buy...\nI went full tank, and somehow ended up with like 300 AD (which cant be healthy).","replies":[{"poster":"Klavinmour","date":"2017-07-26T19:35:33.012+0000","up_votes":1,"down_votes":0,"body":"His kit doesn't give him AD...\n\nI've been doing a bruiser build, Cleaver and Death's Dance primary with Mortal Reminder to hit harder, then building tank items.","replies":[{"poster":"Lord Sesshomaru","date":"2017-07-27T05:47:44.181+0000","up_votes":1,"down_votes":0,"body":"His kit doesn't, but all the tank items do now.\nFrozen Mallet, Black cleaver etc.\n\nbuild those two, have a little in runes, and then just straight up resistances and he gets like 4000 HP with 300 ad..","replies":[{"poster":"Klavinmour","date":"2017-07-27T08:16:51.416+0000","up_votes":1,"down_votes":0,"body":"Those are bruiser items though, not tank items. :P","replies":[{"poster":"Lord Sesshomaru","date":"2017-07-27T08:24:09.362+0000","up_votes":1,"down_votes":0,"body":"Anything that gives anyone the ability to have 4000 hp is a tank item in my book :P\n\nFrozen mallet gives 700 HP, thats pretty much double Deadmans HP\nadmittedly it doesn't have the armour, but its still 700 HP....\n\nthats a tank item in my books xD","replies":[]}]}]}]}]},{"poster":"CHEESYLEEKS","date":"2017-07-26T15:09:49.964+0000","up_votes":1,"down_votes":0,"body":"i played urgot to 250k m7\n\nim keen to try out my old build of {{item:3025}} {{item:3071}} {{item:3111}} {{item:3812}} {{item:3742}} {{item:3065}}","replies":[{"poster":"Klavinmour","date":"2017-07-26T15:24:28.982+0000","up_votes":1,"down_votes":0,"body":"That should work, but you are majorly over capping on CDR.\nThat build has 60% CDR the cap is 40 or 45.","replies":[{"poster":"Akkordian Zoeve","date":"2017-07-26T20:24:18.004+0000","up_votes":1,"down_votes":0,"body":"Just give it a few months, until the new runes come out, and then that won't be an issue (there's a rune that converts excessive CDR into AD/AP).","replies":[]}]}]}]},{"poster":"CHEESYLEEKS","date":"2017-07-26T12:59:31.642+0000","up_votes":1,"down_votes":0,"body":"> I think his W is too strong, and probably shouldn't work on towers\n\nmean while nasus press's r and can demolish your base in 15 seconds","replies":[{"poster":"Lord Sesshomaru","date":"2017-07-26T19:18:25.141+0000","up_votes":1,"down_votes":0,"body":"Yes... \n\nI have my doubts about the Nasus thing :S","replies":[{"poster":"CHEESYLEEKS","date":"2017-07-27T00:48:27.427+0000","up_votes":1,"down_votes":0,"body":"Late game 40% cdr 1 second q's for 15 secs\n\nShit gets real","replies":[{"poster":"Lord Sesshomaru","date":"2017-07-27T06:47:32.375+0000","up_votes":1,"down_votes":0,"body":"I don't even want to think about who came up with this....\n\nProbably the same person who gave Kat a 15 sec cooldown on her R not so long ago...","replies":[]}]}]}]}]}