{"poster":"Lord Sesshomaru","date":"2015-07-19T00:59:00.290+0000","title":"Proof that your Champion mastery Grade (A+ B- etc) has almost no effect on points earned.","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Just as the title said, it doest matter at all what grade you get, the only thing that matters is wining. which seems a little unfair seeming its about mastering that champion, if you want to focus on all or nothing winning then play ranked, but if you&#039;re trying to improve your play with a particular champ, winning shouldn&#039;t be a large factor in that, because you can play well and lose or play badly and win, e.g. in the gnar game shown i played so badly but we won because 4 of the enemy team AFK&#039;ed and so i got lots of &#039;mastery&#039; points for nothing. When Tryndamere the only person left on their team held us off for ages and he played awesome, yet he will have gotten almost no points because he lost. thats hardly fair &#039;mastery&#039; to me.\r\n\r\njust look at this picture, a game with tahm where i played well and got S- but lost and so got almost no points, and a game with gnar where i played so badly and got a C- but won and got far more points than when i played well with tahm.","replies":[{"poster":"Talon12","date":"2015-07-19T04:56:28.262+0000","up_votes":1,"down_votes":0,"body":"lol. whats your point, you got barely anything for that gnar game. I get more points than that for an average loss. When I did well and gt a win I get like 1.7k points... this is proving nothing but that the system works. You lose, so it will be reduced, but you won and did bad, so its still reduced.\n\nMy latest S+ yasuo game went for 1769 points","replies":[{"poster":"Lord Sesshomaru","date":"2015-07-19T09:43:31.695+0000","up_votes":1,"down_votes":0,"body":"my point is that a win/loss affects the points more than how well you did which seems wrong seeming 'mastering a champion' is more to do with how well you play that champ not if you won or lost,\n\nim glad to hear you're doing well with yasuo, i get similar results with yasuo as well but i already have him to level 5 so it doesnt matter..\nwhats your point?","replies":[{"poster":"Talon12","date":"2015-07-19T11:33:29.559+0000","up_votes":1,"down_votes":0,"body":"My point? my point is yasuo is #2 after leesin (#1) to master and play. the more points you have, the more experience you have with the most awesome wind samurai . Aslo, you only got slightly better points with gnar than the bard game, which shows its not that bad, because of your crud score you got crud points. Getting more points in a loss than in a win shows that it works, also, if you have mastered that champ to their max potential, you should be winning more games with them anyway, showing that you have mastered them, thus rewarding better points. Also, with that gnar game, you got about as many points for that win as you did the loss, thus proving that by doing badly in a win, you can reduce your points low enough to achieve such a standard as to thus decrease your win points to that of a typical loss standard.","replies":[{"poster":"Lord Sesshomaru","date":"2015-07-20T05:54:27.736+0000","up_votes":1,"down_votes":0,"body":"_#2 what after lee sin? #2 hardest to play? i doubt that, I've been playing yasuo almost every day since he came out, and i like to think i do ok, and i get the same number of points, so he cant be that hard. His difficulty rating is 100 only because you have to pre-plan your route through minions with your E so that you can get out again, and because your knockup cant be used at any time like malphites's or whatever, plus he requires actual teamwork. _\n\nand the getting slightly better points is the whole point I'm making, look at the title 'has almost NO EFFECT on points earned' which means no matter what rank you get it has minimal effect on points, \n\nalso what you refer to as a 'crud score' is just the BONUS points, you'll notice that when you finish a game your points will be above the 1000 mark but if you move your mouse over the circle that has your Score (A+ B- C+ etc) in it, those points will decrease to a lower number, that lower number is only the rank bonus, which is what I'm trying to show, that your rank, in this case S- and C- make so little difference to the points you earn. its the win or loss that is the bulk of the points. i have not shown the full points here, only the bonus points.\n\nalso mastering a champ to their max potential and that means you should be winning more, is flawed logic, because the enemy might have mastered their champ to the max potential as well, and who wins then? is the loser any less good at their champ just because the enemy was good with their own? \na bronze 5 could get an S+ in his game and a challenger pro can get a C- in hers, just because of how their game went, so does that mean the Bronze 5 is a better player than the pro because his score is higher?\n\n[edit]: dont ask me why that first part is in italics.. i dont do well with type xD","replies":[{"poster":"Talon12","date":"2015-07-20T09:05:37.984+0000","up_votes":1,"down_votes":0,"body":"please, tell me when you have mastered yasuo.\n\n(fyi faker hasn't even mastered yasuo yet)\n\nalso, im just saying winning and losing only affect about 50% of the result, the rest is your performance","replies":[{"poster":"Lord Sesshomaru","date":"2015-07-21T06:17:02.222+0000","up_votes":1,"down_votes":0,"body":"Also i forgot to mention that Yasuo is not a samurai, while yes he is absolutely awesome as you say! due to his expulsion he is technically a Ronin (masterless samurai) Samurai who lose the 'samurai' status by the death, fall from power or loss of favour of their master, become Ronin and are supposed to commit ritual suicide to regain their honour, those who chose not to however are disgraced and shamed for the rest of their life, and as samurai are sworn only to one master they can never regain the title of 'samurai' once becoming Ronin as samurai means 'to serve in attendance to nobility' they are still a servant class despite being of high status. the word Rurouni actually fits yasuo more, it is a fictitious term created for the manga Rurouni Kenshin, and means 'wandering samurai'","replies":[{"poster":"Talon12","date":"2015-07-21T07:58:48.651+0000","up_votes":1,"down_votes":0,"body":"SCREW IT ALL KENSHIN!\n\nHiten Mitsurugi Amakakeru Ryū No Hirameki","replies":[{"poster":"Lord Sesshomaru","date":"2015-07-21T09:08:37.730+0000","up_votes":1,"down_votes":0,"body":"^^^^^^^^^^^^^","replies":[]}]}]},{"poster":"Lord Sesshomaru","date":"2015-07-20T09:15:10.656+0000","up_votes":1,"down_votes":0,"body":"What about that tells you I've mastered yasuo?? i said \"i think i do ok\" thats a long haul from \"I'm the best in the world with yasuo\" i said he isn't the hardest to play, which is true, champs like Kalista are  more challenging, I'm definitely not saying yasuo is a no brain required champ, of course he isn't.\n\ni dont care what faker has or hasn't done, everyone treats the pro's like theyre gods or something, i enjoy playing the game not watching other people play it for me.\n\n50% that doesnt seem right, show me your source?","replies":[]}]}]}]}]}]},{"poster":"Alamo","date":"2015-07-21T08:21:18.995+0000","up_votes":1,"down_votes":0,"body":"u guys done with your intelligent banter?","replies":[]},{"poster":"Alamo","date":"2015-07-20T09:19:55.126+0000","up_votes":1,"down_votes":0,"body":"Yasuo has one of the highest skill caps in the game, don't say that \"kalista are more challenging\", because it isn't. Of course this is a matter of opinion but yasuo is one of the hardest champions to master in the game.","replies":[]}]}