{"poster":"Lord Sesshomaru","date":"2017-04-27T14:01:19.521+0000","title":"A Grave mistake!","subforum":"Miscellaneous","embed":{"description":"Imgur: The most awesome images on the Internet.","url":"http://imgur.com/a/OUkdV","image":"http://i.imgur.com/3euFpS2.jpg?fb"},"up_votes":2,"down_votes":2,"body":"When someone decided to give an ADC with 3000HP, the ability to have 400+ AD, 80% crit, 40% CDR and 150 armour, not to mention AoE autos.\n\n**They made a mistake.**\n\n\n______\n\nIf you want to make Graves a fighter instead of an ADC, thats great, but that damage has to go! On the other hand, if you want him to be an ADC, maybe he should have more appropriate HP and defences? One of his auto attacks deals literally over half my HP _(honestly, no exaggeration)_, and he has 2 of them...\nNot even our 20/4 Rengar could take him out. _(and thats when you know theres a problem)_\n\nI cant help but feel that Graves was a helluva&#039;lot more balanced before the ADC update?","replies":[{"poster":"I Stealth I","date":"2017-04-27T14:13:15.782+0000","up_votes":2,"down_votes":0,"body":"I'm a bit bothered by that attack speed..... Don't most crit items grant attack speed as well?\n\nBack on topic, yes it seems unfair that Graves is like a ranged juggernaut. Maybe we could balance him by not granting him True Grit? Or possibly just limit the amount of buckshot on a single target?","replies":[{"poster":"Lord Sesshomaru","date":"2017-04-27T23:37:11.228+0000","up_votes":1,"down_votes":0,"body":"I think graves is one of those champs like Jhin, his attack speed is pre-set because of his unique autos.\n\nYea the only other ranged typoe juggernauts (Gnar, Vlad etc) don't do anywhere near as much damage.\nYea i think that buckshot suggestion could help.","replies":[{"poster":"Talon12","date":"2017-04-28T09:34:39.337+0000","up_votes":1,"down_votes":0,"body":"His aa speed isnt preset, but it has a low cap rate, though that is not to say at max attackspeed cap his attacks per second is 3, only held in check (at 2.5) because of his reloading (which takes 1.1 sec at max aa speed), but his e reload disregards that anyway.\n\nAnd his auto's do 140-200% damage without even needing to crit, which in its own is a joke, then his q has a higher ad scale on it alone than yasuo in his entire kit.","replies":[]},{"poster":"Xenonfrenzy","date":"2017-04-28T02:53:15.132+0000","up_votes":1,"down_votes":0,"body":"i just realised, that ur account is only lvl 10.\nDo you only use this one for boards posts?","replies":[{"poster":"Lord Sesshomaru","date":"2017-04-28T08:55:28.215+0000","up_votes":1,"down_votes":0,"body":"Yea, haha I do have a main account xD\n\nIt used to be an account for helping friends level, and somehow became my boards account.","replies":[]}]}]}]},{"poster":"Azirious Mistake","date":"2017-04-28T09:58:34.050+0000","up_votes":1,"down_votes":0,"body":"Most ADCS will 1-shot a squishy with those stats, but he dies like anyone else when you blitz-pull him into your team, so if hes fed dont try to engage him 1 on 1, taking out a fed guy is a team effort.\n\nAlso if you think he is OP now, wait until next patch.","replies":[]},{"poster":"Fitzky","date":"2017-04-28T02:53:29.782+0000","up_votes":1,"down_votes":0,"body":"You can have my upvote solely on the use of a pun in the title","replies":[{"poster":"Lord Sesshomaru","date":"2017-04-28T08:56:16.558+0000","up_votes":1,"down_votes":0,"body":"hahah im glad someone noticed :P","replies":[]}]}]}