{"poster":"Lord Sesshomaru","date":"2015-01-09T05:03:47.040+0000","title":"Showing that RIOT does listen to us.","subforum":"Miscellaneous","up_votes":6,"down_votes":2,"body":"For all those people who say \"There is no point posting your opinions because RIOT never listens\" \r\nthis is a post i made a while ago:\r\nhttp://boards.oce.leagueoflegends.com/en/c/miscellaneous/n8qToFGN-azir-weird-mechanic-for-chasing-with-multiple-soldiers\r\nexplaining an issue i had with Azir and how the soldiers moved when there were multiple ones on the field.\r\nmaybe someone saw it, maybe its just a coincidence but the solution i mentioned has found its way onto the PBE\r\nas stated:\r\n\"Conquering sands: In the event of 3 or more soldiers; the closest soldier to the target location will now always be the 2nd/Middle soldier in the 1-2-3 format. This is changed from being ordered by age.\"\r\n\r\nit might make it into the patch or it might not, either way it has at least been considered and given a test run.\r\nRIOT may not have even seen my post, it might have been someone on another server who got noticed or someone in RIOT who had the same thought,\r\neither way it shows that the game isn't 100% perfect and even though we might think our opinions are insignificant, it might be the simplest thing that someone has overlooked, but if you don't say anything then how can it change.\r\nanyway I'm glad that this has been considered and hope it makes its way into the next patch.\r\nthanks RIOT :)","replies":[{"poster":"Slim Chaedi","date":"2015-01-10T01:39:48.863+0000","up_votes":2,"down_votes":0,"body":"Riot does listen, to the extent that even player creations can make their way into the game (e.g. Void Fizz). I think they could listen a bit more in OCE, but I suppose if you really think something needs rectifying you can post about it on the NA forums. Even if they weren't listening to you specifically though, I am sure that they are listening to the group of people bothered by Azir mechanics.\nAlso, WishfulJellyfish - why so rude?","replies":[{"poster":"Lord Sesshomaru","date":"2015-01-10T03:02:58.653+0000","up_votes":2,"down_votes":0,"body":"Yes i saw void fizz before and after it became part of the game, and was really impressed with the riot.\ni just wanted to let people know that riot does so much for us and they do definitely take note of what we say.","replies":[{"poster":"Slim Chaedi","date":"2015-01-10T03:07:16.327+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=Ntey9fRZ,discussion-id=0I3fymiF,comment-id=00010000,timestamp=2015-01-10T03:02:58.653+0000)\n>\n> Yes i saw void fizz before and after it became part of the game, and was really impressed with the riot.\n> i just wanted to let people know that riot does so much for us and they do definitely take note of what we say.\n\nI hate when people say stuff like \"UH RIOT NEVER LISTENS\", as its a ridiculous idea. Riot has to listen to feedback in order to keep the game going. If it was completely run by the company without taking any criticisms, the game wouldn't go in the direction that has made it such a highly played game. Probably wouldn't have grown far higher than its season one popularity.\nSucks that the first comment has to be from a stuck-up 5v5 teams challenger though :P. And they say toxicity is less common at the higher ELOs.","replies":[{"poster":"Lord Sesshomaru","date":"2015-01-10T07:16:47.926+0000","up_votes":1,"down_votes":0,"body":"hahaha yea oh well, he is probably only on the forums cos he got banned for toxicity in game. it does annoy me when ppl complain to riot because they haven't given their fave champ an ultimate skin or something like that, the way i see it, anything we get in this game is a bonus seeming we paid no initial price to play, therefore we cant complain about what we didn't get, we can only offer our suggestions and be grateful for the awesome stuff we do have, (which is lot) so i do my best to remind people of that, it's good that someone else thinks the same way haha","replies":[]}]}]}]},{"poster":"Twynko","date":"2015-01-10T00:10:44.776+0000","up_votes":1,"down_votes":3,"body":"TL;DR your level 9 and B*tching about riot.\nget that d1ldo out of your 4ss you %%%%1ng baby","replies":[{"poster":"Lord Sesshomaru","date":"2015-01-10T00:52:47.727+0000","up_votes":2,"down_votes":0,"body":"This is my smurf\nand I'm actually praising RIOT.....\nyou'd know that if you bothered to read it","replies":[{"poster":"Twynko","date":"2015-01-10T01:22:27.081+0000","up_votes":1,"down_votes":2,"body":"TL;DR uninstall","replies":[]}]}]}]}