{"poster":"Lord Sesshomaru","date":"2015-06-30T10:41:29.269+0000","title":"Lucian Ability preview in client is incorrect and misleading.","subforum":"Miscellaneous","up_votes":5,"down_votes":2,"body":"In the ability preview when you click on lucian on the campions page, it shows that his Dash breaks Nasus&#039;s slow when that feature was actuall removed, so now its very misleading as a slow removal is a very powerful feature (especially for an ADC) and if someone is deciding to spend their well earned IP or even real money on an adc but cant decide between lucian and another champ, and they pick lucian because of that feature, they will be disappointed, which isnt really fair. Its false advertising.","replies":[{"poster":"Klavinmour","date":"2015-06-30T15:09:26.741+0000","up_votes":2,"down_votes":4,"body":"Considering that you are in no way forced to use real money to buy champions \"false advertising\" is a moot point.\n\nBesides if you're only going to use in client information on deciding to buy a champ you are likely to be one of the people who play this game very casually.\nAnyone who's actually focused on play will go to youtube and look up videos on recent play for the champions they are interested in, and also look at the wiki for a numerical breakdown of abilities.","replies":[{"poster":"kJs","date":"2015-06-30T16:11:11.874+0000","up_votes":2,"down_votes":1,"body":"It's still a form of false/misinformation even if its free.\n\nI think Riot should regularly update these things. I feel like they don't do the job and let the community do them so that they don't have to pay for these knowledge services. \nIt should be a part of the client.","replies":[{"poster":"Klavinmour","date":"2015-06-30T17:17:55.935+0000","up_votes":2,"down_votes":0,"body":"In the five years I've been playing, I've yet to see them change the in client info unless if they do a major change.","replies":[]}]},{"poster":"Lord Sesshomaru","date":"2015-06-30T20:57:21.506+0000","up_votes":1,"down_votes":1,"body":"Are you saying casual players have less rights than non casual players? being misled is being misled regardless of who it is.","replies":[{"poster":"Klavinmour","date":"2015-07-01T02:49:35.086+0000","up_votes":1,"down_votes":0,"body":"No, I'm saying casual players don't care enough to care.\n\nThey don't pick a champ because of the background effects of an ability, they pick a champ because they think the abilities look cool and fun.\n\n\"Oooh this guy has a dash and can go through walls!\" they don't at all look at the underside to see \"Oh cool Lucian's dash removed movement impairing effects while Grave's dash doesn't, I guess for now Lucian would be a better pick so I don't get locked down as hard and can work to improve my mistakes while CCed\"\n\nBut then again what do I care? I already have all champions, and I have so much IP that I instantly get the new champions on release instead of waiting for their IP price to come down.","replies":[{"poster":"Lord Sesshomaru","date":"2015-07-01T04:22:06.265+0000","up_votes":1,"down_votes":0,"body":"Define casual players then? i see myself as casual because i don't put too much stress on ranked or winning, i just play to have some fun.\ni dont specifically put aside time to play, i will play if i have time and feel like it, but i care about the game and the champions, i dont 'dont care enough to care'\n\nit sounds like you view casual players as if they are toddlers or something??  people who play 'casually' are still players who enjoy the game, they might be really into it, but cant play much because they have other things in their lives, they might not play for a living or aspire to be in a LCS team or anything but that doesn't mean they don't care about the game.\n\nim not asking you to care, you commented by your own free will, i have all the champs and enough IP to buy new ones they day they come out too, but just because it doesn't affect me doesn't mean its right to have misleading info in the game, that might affect others who haven't played as long.","replies":[{"poster":"Klavinmour","date":"2015-07-01T04:46:55.127+0000","up_votes":1,"down_votes":0,"body":"Overall it's time and effort for Riot to change that information, hell they'd even have to go back and change Lucian's champion spotlight. Fuck knows he's changed a hell of a lot since release that everything said in the spotlight is out of date.\n\nIf you recall a little while ago when the new Card Skins were released someone mentioned that Syndra's particle effects should be different on the skin, a reply was made by someone from Riot stating that it would take too much time from the skin dev team, and not only delay the release of this skin but future skins as well.\n\nDon't you think if something as small as that can have such an impact on production of skins, then updating information in client (and the official youtube channel) would push back production in other areas quite a lot?\nLet's say you did update Lucian's profile, that could then cause a bug in the client, making profiles glitch out, champion portraits swap around (one of my favourite bugs, very amusing) then even more time will be taken from programming team, as well as I guess the media team who had to re-record the video for the client and the champion spotlight.\nPeople already complain that Riot doesn't \"focus their profits where it should count blah blah blah\" \"all that e$ports money just fattens their pockets and does nothing for the game gg\".\nThey want Riot to \"fix the client\" \"stop the updates from breaking the client\" \"huuurrrr durrrr every update ruins my client and it gets stuck at 33%\" \"huuurrrr it's ritos fault i laggggggggggg\". (which by the way I've never once seen any bugsplat or the update glitch happen on a well built custom PC that is properly maintained and has decent internet).\n\nThis game is always changing, information in the client on champion abilities can be out of date a week after the champion is released. Hell I'm pretty sure Azir's profile in client is out of date.\n\nHell overall it's just like the people complaining that they get scammed by skins because they can't view the skin in the client when they can easily go here http://www.lolking.net/models?champion=24&skin=4 and here https://www.youtube.com/watch?v=x9rxQnwZD8g \n\nUltimately it just boils down to the people being too lazy to fucking research anything on their own, and then complaining when they didn't fucking educate themselves.\nBut then again I am rather bias when it comes to such things, research is natural to me as I am a scientist, but my generation also never really had anything given to them from where I am from and we were forced to learn ourselves in school.","replies":[{"poster":"Lord Sesshomaru","date":"2015-07-01T06:35:54.214+0000","up_votes":1,"down_votes":1,"body":"Its time and effort to change anything anywhere, if we all had that attitude nothing would ever get done. and no the champion spotlight is different, it isn't part of the game, it is an extra that is independently published from the game itself.\n\nUpdating skin effects takes time yea, anyone who has done any form of design in that area knows its not just push a button and wham its a new effect, but having a less quality skin isn't misleading, its just not having something else.\n\nRiot employ many people and the skins team does not have anything to do with ability previews and whoever does that, so i highly doubt that it would slow down the production of skins in any way. The same way that a traffic cop stopping to give someone a ticket does not slow down a murder investigation conducted by a detective, they belong to the same 'company' but do not influence each others jobs by doing their own.\n\nits unlikely that it would cause a bug its just replacing a video file, or a link to a video on the internet, but if it did cause a bug then they would have to fix it, like most of the other bugs that occur, they hire people for that, and thats their job to deal with it.\n\nim glad your custom pc doesn't glitch during a patch, my mac i bought from the shop with no added parts or effort put into it at all doesn't glitch either, i don't get your point?\n\nalso no Azirs profile is accurate.\n\nits not about being lazy or researching, if you bought a game like Skyrim and when you looked at swords in the shop and your inventory they said the incorrect stats on them, you could easily go online and search it up, but shouldn't the game have the correct information on it? thats kind of the responsibility of the provider. \n\nYou as a scientist must understand, you wouldn't publish a paper and then find out that what you discovered was nonsense and then not tell anyone and just expect people who read that paper afterwards to search up the correct information (without actually knowing that the current info is incorrect)","replies":[{"poster":"Klavinmour","date":"2015-07-01T06:59:17.757+0000","up_votes":1,"down_votes":0,"body":">Its time and effort to change anything anywhere, if we all had that attitude nothing would ever get done.\n\nAs I said it's time and effort that takes away from time and effort on more important matters.\n\nElise, Evelynn, Jayce, Shyvana and more haven't had their recent (not so recent changes for Shyv) changes updated in their client info either.\nHell Elise had somewhat major changes in this patch and is finally fun to play again (so happy being able to play Elise again <3), Jayce was practically reworked. Don't you think the client info should tell you that Jayce's fourth ability \"his ult\" doesn't level up? It doesn't get points put into it?\n\nI never once said that the Skin Team works on Client Information or Code. I used the Skin Team's recent adventures as an example of how taking time to do something minor takes time away from other more important tasks.\n\nHell right now champion mastery doesn't work 100% of the time. Several occasions over the past couple of weeks in the end game stats mine and my friend's champion mastery wasn't calculated and added.\nDon't you think that should take priority to fix over insignificant information that can be looked up in greater detail within two seconds of using google?","replies":[{"poster":"Lord Sesshomaru","date":"2015-07-01T07:17:39.430+0000","up_votes":1,"down_votes":0,"body":"Yes i do think they should be updated, thanks for bringing them to my attention, I'm glad you feel the same\n\ni never said that this should take top priority, i never said anything of the sort, i was merely bringing it to the attention of riot incase they weren't aware of it, sure its not as important as some other things, like champion mastery, but it should be addressed at some point, because it is incorrect information, and in something where people have the possibility of spending real money on something (or a lot of time to accumulate IP) it should be advertised correctly, if you bought a car or something online through a respected and well known company and when it came to you it was missing a few things (that weren't essential but were still good) that were clearly advertised when you bought it you'd be dissapoined right? you'd expect a company like that to have correct information. \n\nsure you can look something up on google, but if you were a 'casual player' who doesnt know much about the game would you rather trust a random site for info, or the actual information present in the game itself?","replies":[{"poster":"Klavinmour","date":"2015-07-01T07:35:31.620+0000","up_votes":1,"down_votes":0,"body":"Because the LoL Wiki, Surrender@20 and constantly updating gameplay videos on youtube are \"random\" and \"untrust worthy\".\n\nAs I've said below, in the five years I've been playing this game I've only ever seen the in game client info updated on major changes such as near reworks and reworks.\n\nExample: Morgana's Tormented Soil used to have MR shred and do ridiculous damage, but is now significantly different to how it used to be.\n\nEven then it's rare that the changes are made. Karma essentially had two of her abilities reworked in her recent overhaul, yet her information is still as it was before hand.\n\nHell I'm surprised Sion's in client info got changed.","replies":[{"poster":"Lord Sesshomaru","date":"2015-07-01T08:31:42.555+0000","up_votes":1,"down_votes":0,"body":"I never said they weren't, but if you were starting out how would you know that? would you trust some external website over the actual stats shown in the place where you actually by the champion?\n\nregardless of wether you have seen it or not, it should change.\n\nIm not sure what your point about morgana is? it no longer says in the ability preview that it has MR shred and thats good because they updated it to show how she currently is, they have forgotten to change the icons tho to the new ones tho.\n\nKarma's information has changed? \nboth Morgana and karma's have been changed, for a \"scientist to whom research comes naturally' you haven't done much.","replies":[{"poster":"Klavinmour","date":"2015-07-01T08:40:33.281+0000","up_votes":1,"down_votes":0,"body":"No, Karma's hasn't changed.\n\nAnd considering I said in my post that Morgana's has changed you are once again not actually reading what I say.\n\nKarma's abilities read the exact same in client as they have for the past year, even though two patches ago her W and E were changed.","replies":[{"poster":"Lord Sesshomaru","date":"2015-07-01T09:34:03.160+0000","up_votes":1,"down_votes":0,"body":"Both morgana's Morgana's abilities in the ability preview accurately portray how her abilities behave in game, lucians does not.\n\nyou said: 'in the last 5 years you have seen the client updated only for reworks and large changes in kit' then underneath you say 'morgana's kit has changed significantly' so does that mean that you are saying that the game client HAS changed to accommodate these changes or are you saying that even though her kit has changed they HAVENT updated it?\n\ni dont know if karma's have remained the same or not over the past year, but it doesn't matter because they do not give misleading information about her abilities.","replies":[]}]}]}]}]}]},{"poster":"Klavinmour","date":"2015-07-01T06:41:26.546+0000","up_votes":1,"down_votes":0,"body":"You completely fucking missed the point I made and twisted it into bullshit.","replies":[{"poster":"Lord Sesshomaru","date":"2015-07-01T06:56:06.044+0000","up_votes":1,"down_votes":0,"body":"What did i twist? and how did i twist it??","replies":[]}]}]}]}]}]}]}]},{"poster":"Erøse","date":"2015-07-02T09:08:38.597+0000","up_votes":1,"down_votes":0,"body":"Thats why champion spotlight exist lol.","replies":[]},{"poster":"GnarGada","date":"2015-06-30T12:06:00.388+0000","up_votes":1,"down_votes":0,"body":"k lol","replies":[{"poster":"Lord Sesshomaru","date":"2015-06-30T13:12:41.966+0000","up_votes":1,"down_votes":0,"body":"glad you agree","replies":[]}]}]}