{"poster":"MrChinostyle","date":"2015-07-23T12:43:18.078+0000","title":"Die neue HUD ist schei***","subforum":"Champions & Gameplay","up_votes":3,"down_votes":16,"body":"Mute buttons - sind weg. \r\nUn&uuml;bersichtlich wie viel leben/mana/wer ultimates hat \r\nes ist vollkommen unausballanciert alles ist in eine ecke gequetscht\r\nkeine m&ouml;glichkeit die alte hud weiterhin zu benutzen - warum!? jedes andere unternehmen, und viele andere spiele erlauben spielern interfaces selbst zu positionieren oder w&uuml;rden diese nicht einfach so &auml;ndern ohne die m&ouml;glichkeit das alte weiterhin zu nutzen...\r\ntr&auml;nke sind bei vollem mana/leben ausgegraut, nicht m&ouml;glich healthpots und manapots voneinander zu unterscheiden\r\n\r\nin ranked ist die scoreanzeige viel zu &uuml;berdimensional, in dominion sieht man nicht mehr wie viele punkte jeder hat - die anzeige wie viel leben die nexen von beiden seiten haben ist vollkommen &uuml;berdemensioniert\r\n\r\nwarum etwas &auml;ndern was keiner &auml;nderrung bedarf? es gibt so viel verbesserungspotential - z.b. das man spieleinstellungen &auml;ndern kann ohne in einem spiel zu sein / tastenk&uuml;rzel etc &auml;ndern kann... wir warten immer noch auf eine 1v1 / 2v2 map... \r\n\r\ndie neue hud ist wiederlich, und den kunden das aufzuwingen ohne entscheidungsm&ouml;glichkeit ist absolut kundenunfreundlich.\r\n\r\nfinde die &auml;nderrung schrecklich, vorallem da wenn man mal normals / rankeds spielt nun jedesmal ein anderes interface hat...","replies":[{"poster":"Iron IV dude","date":"2015-07-23T13:31:07.053+0000","up_votes":4,"down_votes":2,"body":"Mute Button ist noch vorhanden. Die neue HUD ist rein ergonomisch das beste Update das Rito rausbringen könnte.\nIn rankeds ist derzeit doof gelaufen, dass nur die Map geupgraded ist.\nIst eine veränderung, damals hat auch jeder Hans und Franz (sorry Hans und sorry Franz, nicht persönlich nehmen!) geweint, weil die ja so viel schlechter wäre.\nHeute bekomme ich das grauen wenn ich die alte Map sehe.\n\nLass dich drauf ein, Rito hat sich schon gedanken darüber gemacht. Rito ist im übrigen bei weitem nicht der einzige Betrieb der eine neue, nicht wechselbare GUI einbringt.\n\nBlizzard (Diablo 3) hatte das gleiche Problem, ne Woche später kräht kein Hahn mehr danach... \n\nDia alte HUD ist halt eigentlich mega unübersichtlich und wurde vernünftig aufgeräumt. Du hast dich nur daran gewöhnt, aber das menschliche Hirn ist gar nicht so schlecht sich an neue Sachen zu gewöhnen.","replies":[{"poster":"MrChinostyle","date":"2015-07-23T13:38:36.615+0000","up_votes":1,"down_votes":4,"body":"warum kunden dazu zwingen sich umzugewöhnen?","replies":[{"poster":"Iron IV dude","date":"2015-07-23T14:55:35.756+0000","up_votes":3,"down_votes":0,"body":"Schonmal auf nem ergonomisch korrekten Arbeitsplatz gesessen? \nHatte die erste Wochen Rücken und Nackenschmerzen wie nie zuvor, danach jedoch nie wieder auch nur ein Problem und ich frage mich wie ich vorher nur arbeiten konnte.\n\nManchmal muss man andere wie Kinder behandeln. Und nicht immer ist das was man will auch das was man braucht.","replies":[]},{"poster":"NG Drakuboy","date":"2015-07-23T14:08:48.160+0000","up_votes":2,"down_votes":1,"body":"Wenns auf lange Sicht aus besser für dei Kunden ist, tut man sowas eben.","replies":[{"poster":"MrChinostyle","date":"2015-07-23T14:55:37.349+0000","up_votes":1,"down_votes":2,"body":"in wie fern wird es auf lange sicht besser für die kunden...? klar gibt es vorteile aber auch ganz klar nachteile / bugs / und es ist ganz einfach nicht notwendig\n\nwarum also es auf diese art und weise einführen... und wie soll es besser für mich sein wenn es den spielspaß verringert ","replies":[{"poster":"NG Drakuboy","date":"2015-07-23T16:41:02.302+0000","up_votes":2,"down_votes":1,"body":"Wenn Riot die alte Grafik von 2009 hätte würden viele nicht immernoch spielen, daher ist Optik ein großer Punkt, um die Spielerschaft nicht zu verlieren. Wenn LoL diese HUD von Anfang an hätte, hättest du nicht rumgeheult wie jetzt. Nach einer Woche haben eh die 20-30 Leute gequittet die damit gedroht haben, und gut ist.","replies":[{"poster":"gyyyr","date":"2015-07-23T23:36:11.402+0000","up_votes":2,"down_votes":1,"body":"Es ist ähnlich wie bei der einführung der neun SR. erst heulen mehrere 100 leute 3 wochen rum und drohen aufzuhören. nach diesen 3 wochen sind vileicht 20 leute tatsächlich gegangen und die anderen finden plötzlich doch das alte schlechter.","replies":[]},{"poster":"MrChinostyle","date":"2015-07-24T08:47:32.260+0000","up_votes":1,"down_votes":2,"body":"du glaubst das wenn die hud wie zum beispiel in wow modular wäre und jeder spieler es sich selbst verschieben, einrichten könnte wie er möchte das dann in 5 jahren viele spieler nicht mehr spielen werden, die bleiben würden, wenn dem kunden eine hud aufgezwungen wird?\n\ndu glaubst das ein spiel mit einem + an content, verschiedene huds, weniger erfolgreich sein wird?","replies":[{"poster":"4 R4nd0m N008","date":"2015-07-24T08:55:08.802+0000","up_votes":1,"down_votes":0,"body":"> du glaubst das wenn die hud wie zum beispiel in wow modular wäre und jeder spieler es sich selbst verschieben, einrichten könnte\n\nEs geht nicht um das eigenständige verschieben. Es geht um das generelle Design und Aussehen des HUDs. Das alte sah schlicht einfach aus wie Windows 95 und das neue wie Windows 7. Würde man für immer diese Win 95 Optik bei behalten, dann würde Riot auch Spieler verlieren, bzw. schwerer neue finden.","replies":[{"poster":"xXNobodiXx","date":"2015-07-25T06:42:02.471+0000","up_votes":1,"down_votes":0,"body":"Ich habe windos 8 und benutze windos 98 Optik da diese mier am besten gefällt alles einfach ohne schnörkel und klimbim.","replies":[]}]}]}]}]}]}]},{"poster":"JorgurFX95","date":"2015-07-30T17:13:59.019+0000","up_votes":1,"down_votes":1,"body":"Ich finde zwar den Mute Button nicht mehr, aber natürlich ist die Funktion noch da. Man kann immer noch all diese Dinge über die Kommandozeile ausführen. \n\n/ignore \"Spielername\" muted einen Spieler\n/ignore \"@Championname\" muted den Spieler eines Champs \n\nNichts einfacher als das. Aber interessant wäre trotzdem, wo ist denn der neue Mute Button?","replies":[{"poster":"Bergelmir32","date":"2015-07-30T17:17:29.733+0000","up_votes":1,"down_votes":0,"body":"Tap und dann auf das entsprechende Champion Portrait","replies":[]}]}]},{"poster":"Leberwurstfrau","date":"2015-07-23T12:47:08.807+0000","up_votes":3,"down_votes":1,"body":"Gibt es schon diverse andere Threads dazu! Die wesentlich ausführlicher die Vorteile bzw. Nachteile auflisten unter denen deine Meinung sicher gefragt ist. Aber bitte nicht 100 verschiedene Threads zum gleichem Thema.","replies":[{"poster":"MrChinostyle","date":"2015-07-23T13:00:11.009+0000","up_votes":1,"down_votes":2,"body":"es gibt auch diverse threads die dazu gelöscht wurden, es gab bereits diskussionen dazu auf den pbe servern die gelöscht /ignoriert wurden \n\ndas ein konzern den kunden ein veränderrung aufzwingt die vollkommen individualisierbar sein könnte/müsste, und wo eine einfache option sich zwischen der neuen / alten zu entscheiden eingefügt werden könnte und zur vollen zufriedenenheit sämtlicher kunden (die die neue mögen bzw die alte) führen würde - aber genau das nicht getan wird ist unglaublich kundenunfreundlich und ingorant.\n\nmöglichst alles damit zuspammen damit der negativ feedback groß genug wird das sie gezwungen sind auf die kundenwünsche einzugehen, oder aber hoffen das es in zukunft noch mehr, stärkere konkurrenz produkte gibt die riot zum umdenken zwingen....\n\nsie haben es über monate getestet, und schalten es life mit dutzenden von fehlern - warum?","replies":[{"poster":"4 R4nd0m N008","date":"2015-07-24T08:57:32.992+0000","up_votes":2,"down_votes":1,"body":"> das ein konzern den kunden ein veränderrung aufzwingt die vollkommen individualisierbar sein könnte/müsste, und wo eine einfache option sich zwischen der neuen / alten zu entscheiden eingefügt werden könnte\n\nDas Spiel ist auf ESports ausgerichtet. Wenn man das HUD frei wählen könnte hätten die Spieler mit dem neuen HUD mehr Informationen als die mit dem Alten. Dadurch wären sie wiederum im Vorteil gegenüber den anderen. Und genau das darf nicht passieren. Daher denke ich nicht, dass diese Option kommen wird.","replies":[]}]}]},{"poster":"Evenrider","date":"2015-07-25T10:54:07.702+0000","up_votes":1,"down_votes":0,"body":"Zum nun HUD:\nWarum ist es noch nicht in den Ranked Games?\nIch dreh momentan am Rad.... Hatte mich in den letzten Tagen und Nächten in Normals an das neue HUD gewöhnt und im Ranked dann der Shock, wo ist mein Shop....\nOder bin ich der einzige der im Ranked noch mit dem alten HUD spielt?","replies":[{"poster":"Careves","date":"2015-07-25T12:04:50.446+0000","up_votes":1,"down_votes":0,"body":"Haben sie gemacht damit an sich in den normals zuerst daran gewöhnen kann bevor man es dann auch in den Ranked hat. Alle haben noch das alte :)\nAlso soweit ich weiss :D","replies":[{"poster":"Evenrider","date":"2015-07-25T12:23:21.401+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Careves,realm=EUW,application-id=Wj1wcocU,discussion-id=ekag4KVH,comment-id=00020000,timestamp=2015-07-25T12:04:50.446+0000)\n>\n> Haben sie gemacht damit an sich in den normals zuerst daran gewöhnen kann bevor man es dann auch in den Ranked hat. Alle haben noch das alte :)\n> Also soweit ich weiss :D\n\n:( also kein Ranked bis sie switchen... wird ne lange Zeit.","replies":[]}]}]}]}