{"poster":"foischa Fuchzga","date":"2016-06-16T17:08:35.018+0000","title":"Konto wurde gesperrt.","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Servus Beschw&ouml;rer,\n\nhab seit heute einen ziemlich skurrilen Fall. Ich wollte mich heute im Client anmelden und habe die Meldung bekommen, dass mein Konto dauerhaft gesperrt wurde und dass mehr Informationen per E-Mail folgen. So jetzt habe ich Idiot allerdings 10 Minuten davor mein E-Mail Postfach aussortiert und muss die E-Mail vom Support, aufgrund der zahlreichen RP-K&auml;ufe wohl &uuml;bersehen und gel&ouml;scht haben :/.\n\n**Die Vorgeschichte:**\nWie schon erw&auml;hnt kaufe ich des &ouml;fteren RP (Wird aber denke ich keinen Einfluss auf das verfahren haben..).\nIch hatte 0 LP und habe in der Championauswahl, aufgrund eines Facebookvideos -.-, verpasst einen Champ zu bannen. Danach hatte ich dann logischer Weise -3 LP (Da man durch versuchten LP betruges gebannt wird dachte ich mir evtl., dass das System aufgrund der negativen Anzahl an LP einen Betrug im verdacht hatte und mich gebannt hat).\nRP Zahlungen sollten alle gedeckt gewesen sein.\nBin kein Flamer und habe auch in 4 Jahren erst ein einziges Mal (Aufgrund eines privaten Notfalls) ein Spiel verlassen m&uuml;ssen #Sorryteam :(.\nIch hatte außerdem noch nie irgendeine Sperrung oder sonstiges (Abgesehen von einer 3-Tages Sperrung vor 4 Jahren, weiß allerdings nicht mehr wegen was, war damals ein TOTALNOOB :D)\n\n**Nun mein erstes Problem: **\nWie finde ich &quot;schnell&quot; heraus warum mein Konto gesperrt wurde.\n\n**Zweites Problem:**\nMuss man nun wirklich warten bis das Ticket abgearbeitet wurde? Oder gibt es nicht doch eine m&ouml;glichkeit, beispielsweise duch einen Sofort-Chat oder eine Support-Hotline direkt mit RIOT in Kontakt zu treten?\n\n\nMit besten Gr&uuml;&szlig;en\n\n**Nachtrag:**\nÄhm möchte RIOT jetzt seiner Spieler verkraulen?\n\n**Originalnachricht:**\n> Hallo,\n> \n> dein Konto wurde dauerhaft gesperrt, nachdem unsere Disziplinarverfahren bereits zu mehrfachen Strafmaßnahmen geführt haben.\n> \n> Bitte melde dich bei deinem Client an, um deine Reformkarte mit den jüngsten Spielen zu sehen, die zu dieser Maßnahme geführt haben. Bei Riot Games ermuntern wir Spieler zwar dazu, sich zu bessern, entfernen aber stets Spieler aus unserem Spiel, die fortlaufend für negative Spielerlebnisse sorgen.\n> \n> Zu dieser Maßnahme kommt es erst, wenn wiederholte Strafmaßnahmen erfolgt sind, und wir werden die Sperre unter keinen Umständen aufheben.\n> \n> Obwohl dies das Ende des Weges ist, sind wir zuversichtlich, dass du mit etwas Abstand bei den nächsten von dir gespielten Spielen ein anderes Verhalten zeigen wirst.\n> \n> Alles Gute bei deinen künftigen Unternehmungen.\n> \n> Mit freundlichen Grüßen,\n> \n> Cazinal\n> \n> Player Support Riot Games\n\n\n\nSie haben mir leider nicht eine einzige meiner Fragen beantwortet.\n\nSoll das jetzt heißen das mein ca. 400€ teurer Account einfach mir nichts dir nichts für immer gelöscht wurde?","replies":[{"poster":"Megamaexx","date":"2016-06-16T21:48:03.143+0000","up_votes":1,"down_votes":0,"body":"Hmm, die Meldung klingt nach Feederbuster. Hattest du in letzter Zeit mal einen 14-Tage-Bann?","replies":[{"poster":"foischa Fuchzga","date":"2016-06-17T09:04:25.801+0000","up_votes":1,"down_votes":0,"body":"Nein, wie gesagt hatte kein ban bzw. sperre. Nur ne 5 min Strafe weil ich ja vergessen hatte nen champ zu bannen :/","replies":[]}]},{"poster":"EpicDieterBohlen","date":"2016-06-16T17:12:18.647+0000","up_votes":1,"down_votes":0,"body":"soweit ich weiß musst du auf den support warten. es könne sein, dass eine 0815 bot antwort auf dein support ticket antwortet, einfach nochmal drauf antworten, dann sollte ein richtiger supporter sich darum kümmern.\n ## PleaseUnban :(","replies":[{"poster":"foischa Fuchzga","date":"2016-06-16T18:34:45.864+0000","up_votes":1,"down_votes":0,"body":"Meinst du das die von mir erhaltenen Antwort (Nachtrag) so eine Bot-Nachricht ist? Hab auf jeden Fall mal zurückgeschrieben.","replies":[{"poster":"EpicDieterBohlen","date":"2016-06-16T18:55:17.134+0000","up_votes":1,"down_votes":0,"body":"ja die schicken realtiv häufig auf deine erste antwort eine bot antwort^","replies":[]}]}]},{"poster":"foischa Fuchzga","date":"2016-06-16T17:25:08.332+0000","up_votes":1,"down_votes":0,"body":"Oman :/.\n\nTrotzdem Danke für die schnelle Antwort","replies":[]},{"poster":"xBlitzlichTx","date":"2016-06-16T17:13:07.938+0000","up_votes":1,"down_votes":0,"body":"Hallo,\ndir wird wohl nichts anderes übrig bleiben als auf die Antwort auf dein Support Ticket zu warten. Einen Hilfe Chat bzw. eine Hotline ist nicht verfügbar.","replies":[]}]}