{"poster":"Gesteppie","date":"2015-12-22T09:43:13.190+0000","title":"Masteries","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Anyone else finding the new masteries a bit overwhelming and OverPowered?\r\n\r\nEspecially Thunderlords.\r\n\r\nI understand the remake from the old masteries, but I think Rito has just put too much power into the new ones.\r\n\r\nAnyone else feeling the same or care to discuss otherwise?","replies":[{"poster":"Olee","date":"2015-12-22T11:27:57.322+0000","up_votes":1,"down_votes":0,"body":"I think they're great. Sure there is a bit of a discrepancy in power with Thunderlord's in comparison to everything else. But personally, I feel like that's more Thunderlord's being balanced with everything else being unbalanced. But for real, they are amazing, they give the player so many more options and ways to play each champion.","replies":[{"poster":"Gesteppie","date":"2015-12-28T11:27:39.352+0000","up_votes":1,"down_votes":0,"body":"I'd have to agree and disagree on that one.\n\nYes they do give a lot more options for those who wish to deal damage, but me as a main support, I feel more hindered. I'm forced to take more damage over utility before I can reach the keystone utilities.\n\nI just wish they perhaps made a fourth row of masteries to give back some utility. Regardless of the fact they have better gold per 5 items in game, I still find myself being put behind in lane if my adc isn't doing so well, especially if I've taken relic so I'm not able to share that minion gold.\nI suppose that would be part of a balancing issue, but I'm still finding that the masteries give too much damage for everyone else and not enough for supports.","replies":[{"poster":"Olee","date":"2015-12-28T20:12:17.209+0000","up_votes":1,"down_votes":0,"body":"I suppose there aren't too many options for support, you kinda have three I guess. In saying that, they SHOULD be the only three you need in terms of different kinds of Support Champs. Tanks = Bond of Stone, Lane Bullies = Thunderlord's Decree and Enchanters/Healers/Buffers = Windspeaker's Blessing","replies":[]}]}]},{"poster":"BarryButcher","date":"2015-12-22T09:55:55.131+0000","up_votes":1,"down_votes":0,"body":"I did at the start. After a couple days I get wrapped my head around what they were trying to do with the new system.\n\nRiot wanted to get rid of the \"cookie cutter\" system. Such as, ADC's always take 21-9-0. Now you can change it up and bit without giving up a lot of power.\n\nI've gone from having 16 \"standard\" mastery pages to making customising for each champion. Granted sometimes I only change 1 mastery like Biscuits to Assassin or Spell Damage to Attack Speed but still.\n\nThey know Thunderlords is OP atm. I'm pretty sure every keystone except for Thunderlords and the shield/heal one are getting buffed next patch. But sadly the next patch isn't until January sometime, so enjoy your thunderlords.","replies":[{"poster":"Bookbash","date":"2015-12-23T01:15:15.067+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BarryButcher,realm=OCE,application-id=FjGAIbRv,discussion-id=1rkInWI9,comment-id=0000,timestamp=2015-12-22T09:55:55.131+0000)\n>\n> They know Thunderlords is OP atm. I'm pretty sure every keystone except for Thunderlords and the shield/heal one are getting buffed next patch. But sadly the next patch isn't until January sometime, so enjoy your thunderlords.\n\nThe shield/heal one already got nerfed. It was good in 5.22. Now it's just better to take thunderlords on champs like Morgana and Sona.","replies":[{"poster":"Gesteppie","date":"2015-12-28T11:33:18.686+0000","up_votes":1,"down_votes":0,"body":"And to even get to the sheild/heal one, you have to go through a bunch of damaging masteries, which if you're actually playing a support champion, can be quiet useless too you.","replies":[]}]}]},{"poster":"GigaPube","date":"2015-12-22T14:13:37.700+0000","up_votes":1,"down_votes":0,"body":"na they're not overpowered. everyone has a keystone, but it doesnt usually give much raw stats, they all have a unique gimmick. thunderlords is so popular because out of that and DFT people cant see DFT working so they think its weaker. thunderlords is literally one of the worst. its fitting though that it covers such a supposed broad range of champions that can use it, since more damage is always better, and it can be effective on anyone other than support, since its most \"common\" damage comes from damage per level.","replies":[{"poster":"Gesteppie","date":"2015-12-28T11:31:43.253+0000","up_votes":1,"down_votes":0,"body":"Yes that's what I thought to.\n\nBut that's also the problem. Thunderlord's is too \"broad\".\n\nThe new masteries were supposed to shake things up, and the keystones to give you that \"unique\" style of play. But if everyone has Thunderlord's, it doesn't really have that effect then does it? :(","replies":[]}]}]}