{"poster":"FLUMPN","date":"2019-09-25T18:55:25.331+0000","title":"Hextech-Truhen kaufen, welcher Sinn?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":2,"body":"Hi zusammen,\r\n\r\nkann mir jemand erklären warum man Hextech-Truhen mit Echtgeld kaufen sollte?\r\n\r\nMein Verständnis-Problem ist folgendes:\r\n\r\nWenn ich mir Kisten kaufe, hoffe ich wenigstens auf die Chance etwas gutes zu \"ziehen\". Wenn ich hier einen legendären o. ultimativen Skin ziehe, kann ich diesen sowieso nicht permanent aufwerten weil die Essenzen fehlen. Also was macht es für einen Sinn?\r\nVIelleicht kann mir jemand den Sinn dahinter näher erläutern. VIelen Dank.\r\n\r\nVG","replies":[{"poster":"Aymira","date":"2019-09-25T19:12:15.527+0000","up_votes":3,"down_votes":1,"body":"Man bekommt aus den Hextech Kisten Skinsplitter. Diese kann man, wenn man 3 von denen hat einfach zusammen schmeißen und bekommt dann einen Permanenten Skin, den man noch nicht hat.\n\nSkinsammler (so nenn ichs nun einfach mal) können so gezielt wenn sie alle herkömmlichen skins schon haben die Fehlenden bekommen, darunter zählen auch einige Skins die man nicht mehr kaufen kann, oder eben die Prestige Editionen, die man sich sonst erarbeiten müsste.\n\nDas macht die Sache nun nicht interessanter für dich, aber für manche Menschen, die halt zu viel Geld haben schon. °L°\n\nAndere Leute mögen auch einfach nur den Glücksfaktor und verfallen dann natürlich gleichzeitig in eine tiefe nie wieder aufhörende Sucht. *sarcasm off* (wobei es bei manchen vielleicht sogar wahr ist? Ich weiß nicht)","replies":[]},{"poster":"FLUMPN","date":"2019-09-25T20:43:39.812+0000","up_votes":1,"down_votes":0,"body":"@Aymira\n@Bananenschnder\n@Enderized\n\nDanke Euch allen für die Antworten und vor allem die ausführlichen Antworten. Das hat mir geholfen und etwas Licht ins dunkle gebracht :-)","replies":[]},{"poster":"Bananenschnder","date":"2019-09-25T19:23:40.803+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FLUMPN,realm=EUW,application-id=YnZkMR0R,discussion-id=RcA7uZgA,comment-id=,timestamp=2019-09-25T18:55:25.331+0000)\n>\n> Wenn ich hier einen legendären o. ultimativen Skin ziehe, kann ich diesen sowieso nicht permanent aufwerten weil die Essenzen fehlen.\n\nUltimative und mythische Skins werden automatisch freigeschaltet.\n\nLegendäre musst du mit ~1500 Essenzen aufwerten, die du aber wahrscheinlich auch kriegst, wenn du mehrere Kisten kaufst, indem du ungewollte Skins disentchantest. Außerdem kannst du mit viel Glück so Gemstones kriegen, um dir die Gemstone exklusives zu holen. Weiter können Legacy Skins (also die, die du nicht mehr kaufen kannst) und Prestige Skins droppen, die eigentlich nicht mehr erhältlich sind.\n\nIm Schnitt ist es außerdem \"günstiger\", Hextech Kisten zu holen als die Skins. Obwohl das nur relevant ist, wenn du vorhast mehrere Tausend Euro reinzustecken und irgendwann alle zu haben, anstatt einfach gezielt das zu kaufen, was du gerne hättest.","replies":[]},{"poster":"Enderized","date":"2019-09-25T19:17:43.370+0000","up_votes":1,"down_votes":0,"body":"Wenn du einen ultimativen Skin oder einen Mythischen Skin ziehst wird dieser automatisch freigeschaltet.","replies":[]}]}