{"poster":"Dirty Rat Abuser","date":"2017-03-29T10:15:59.908+0000","title":"Bronze Bot Lane sucht Team (aber spielen schon wie Gold) für FlexQ","subforum":"Clans & Teams","up_votes":2,"down_votes":5,"body":"Sind momentan Bronze 4, aber gewinnen immer unsere Lane. Haben auf jedenfall Potenzial.\r\n\r\nK&ouml;nnt mich ingame adden f&uuml;r Test games. Ts ist vorhanden","replies":[{"poster":"Maíko","date":"2017-03-29T11:46:50.122+0000","up_votes":2,"down_votes":0,"body":">aber spielen schon wie Gold\n\nIch glaube dir, dass du glaubst so gut wie ein Gold Spieler zu sein.\nAber du übersiehst du ein paar Dinge.\n\nSelbst wenn du in deiner ELO deine Lane gewinnst und gute Stats bekommst, sagt das absolut nichts darüber aus wie du dich in anderen ELOs schlagen würdest. Diese Scores erhältst du nämlich während du gegen andere Bronze Leute spielst.\nIn Gold wirst du teilweise für jeden Lasthit den du machen willst bestraft, deine Gegner werden dich viel härter unter Druck setzen als sie es jetzt in Bronze tun.\nEgal ob Farm, Obejective Control, Trading, Vision, oder Roaming....sie werden euren jetzigen Gegner in jedem einzelnen Aspekt weit überlegen sein.","replies":[{"poster":"Dirty Rat Abuser","date":"2017-05-15T08:59:25.461+0000","up_votes":1,"down_votes":1,"body":"In gold wird man teilweise für jeden lasthit, den man machen will bestraft und man wird stärker unter Druck gesetzt?\n\nLiegt eher daran, dass dein Autospacing und movement eher abnormal schlecht ist. Kommt mir eher so vor, dass Gold Spieler (so wie du) bereits überfordert sind die Minions zu last hitten. Die Aussasge, dass Gold Adcs in irgendeiner Weise pressure aufbauen ist mir noch nicht aufgefallen.","replies":[{"poster":"Maíko","date":"2017-05-15T14:35:43.074+0000","up_votes":1,"down_votes":0,"body":"Wow...du antwortest auf 2 Monate alte Posts :'D\n\n>In gold wird man teilweise für jeden lasthit, den man machen will bestraft und man wird stärker unter Druck gesetzt?\nLiegt eher daran, dass dein Autospacing und movement eher abnormal schlecht ist.\n\nVermutlich nicht das beste...bin auch kein Main ADC, eher so ein \"ich spiele einfach alles durch\"-Typ...aber für Gold 2 reicht es noch auf jeder Position aus^^\nMit Mid/Top würde ich vermutlich schneller climben...aber mir gehts eher um den Spielspaß als um den Rang.\n\n>Kommt mir eher so vor, dass Gold Spieler (so wie du) bereits überfordert sind die Minions zu last hitten.\n\nDas kann ich jetzt nicht behaupten. Eigentlich ist mein Farm ziemlich solide...aber das Skillmatchup verhuntze ich häufiger mal....Spiele zu aggresiv, mache missplays, warde zu wenig....da liegen meine größten Probleme.\nAber da ich eh fast nur Shooter spiele und eher phasenweise auf LoL zurück komme bin ich damit zufrieden^^\nEs gibt andere Spiele wo ich mehr Wert drauf lege meinen Rang zu halten/zu verbessern :D\n\n>Die Aussasge, dass Gold Adcs in irgendeiner Weise pressure aufbauen ist mir noch nicht aufgefallen.\n\nHier werden Bronze mit Gold Spielern verglichen. Natürlich werden Gold Spieler wesentlich mehr Druck aufbauen.\n\n________________________________________________________\n\nIch weiß nicht, warum du auf eine solche aggressive Weise schreibst:\n\n> dass dein Autospacing und movement eher abnormal schlecht ist. Kommt mir eher so vor, dass Gold Spieler (so wie du) bereits überfordert sind\n\nich habe dich mit keiner Silbe angegriffen.\nIch habe weder gesagt, dass du ein schlechter Spieler bist, noch dass du es in Gold nicht schaffen wirst.\nIch habe ausschließlich begründet, dass Scores die du in Bronze erzielst, nicht gleichzusetzen sind mit Scores, die du in Gold erzielen wirst.\n\n>Ich glaube dir, dass du glaubst so gut wie ein Gold Spieler zu sein.\nAber du übersiehst du ein paar Dinge.\n\nWenn du dich durch diesen Satz angegriffen fühlst, hast du ihn wohl falsch aufgenommen/gelesen.\nAuch hier, spreche ich mit keiner Silbe davon, dass du ein schlechter Spieler bist. Sondern nur davon, dass du in deiner Argumentation einige Sachen übersiehst....Womit ich auch recht habe.\n\nIch hoffe mal, dass du deine Anonymität im Internet nur etwas ausnutzen willst und nicht auch im echten Leben jeden angreifst, der eine Diskussion mit dir führt....ansonsten befürchte ich, dass du nicht weit kommen und dir viele Steine in den Weg legen wirst :|.","replies":[]}]}]},{"poster":"Patter1991","date":"2017-03-29T10:38:03.253+0000","up_votes":2,"down_votes":0,"body":"> (aber spielen schon wie Gold)\n\nDarum hast du also in B4 eine 21% Winrate...","replies":[]},{"poster":"Mi3zekatze","date":"2017-03-29T10:44:21.170+0000","up_votes":2,"down_votes":1,"body":"\"Wir spielen wie Gold\"\nIhr seid. Bronze. Mit. Einer. Sehr. Sehr. Schlechten Winrate! Wie zu Henker kommt ihr auf die Idee auch nur wie Bronze I zu spielen? Geschweige denn Gold?? \nDas ist absoluter Müll! Es ist einfach falsch. Punkt. Und du brauchst nicht lügen um hier Leute zu finden! Sag einfach die Wahrheit (ich bin Bronze) und du wirst Leute finden. Mit einem wie dir will keiner spielen der sich für Challenger erklärt!\n\nIch sage auch nicht ich bin eig. Master, für eine solche Selbstüberschätzung habe ich Genughirnzellen über ^^","replies":[{"poster":"Dirty Rat Abuser","date":"2017-05-15T08:33:45.728+0000","up_votes":1,"down_votes":0,"body":"Ähm deswegen stuckst du auch in Platin mit einer low Platin MMR, während ich dich mittlerweile fast eingeholt habe?\n\nMit deiner 50% winrate in deinen letzten 20 games wirst du auch nicht sehr viel weiter kommen :)","replies":[]},{"poster":"Valtyna","date":"2017-03-29T10:56:32.925+0000","up_votes":1,"down_votes":0,"body":"> Ich sage auch nicht ich bin eig. Master, für eine solche Selbstüberschätzung habe ich Genughirnzellen über ^^\n\nWieso schätzt du dann ein, das du genug Hirnzellen besitzt ? Ist das nicht auch eine \"Selbstüberschätzung\" xD ?\n\n{{champion:48}}","replies":[{"poster":"Mi3zekatze","date":"2017-03-29T11:11:53.371+0000","up_votes":1,"down_votes":0,"body":":/     :(     \\Oo/","replies":[{"poster":"DirtyJannaAbuser","date":"2017-03-29T14:26:33.311+0000","up_votes":1,"down_votes":0,"body":"Du bist gemein. :(","replies":[]}]}]}]},{"poster":"Ayka","date":"2017-03-30T10:17:48.305+0000","up_votes":1,"down_votes":0,"body":"(no offence!!)\n\nIch finde es einfach immer wieder erheiternd, wie viele (nicht alle) Bronze Spieler denken, nur weil sie die Lane gewinnen wären sie auf gold, ja auch nur silber niveau... xD es gibt Gründe wieso diese Leute noch Bronze sind, genauso wie es Gründe dafür gibt, wieso sie das Game verlieren obwohl sie doch so gut sind und die Lane gewonnen haben.. und das sind NICHT die Feedenden Randoms oder AFK oder welche Ausrede auch immer kommen mag. :)","replies":[{"poster":"Dirty Rat Abuser","date":"2017-05-15T08:37:10.975+0000","up_votes":1,"down_votes":0,"body":"(No offense!!)\n\nIch finde es ebenfalls erheiternd, wie viele eGirls sich auf low Platin/ Dia boosten lassen als Support main, nur um nächste Season wieder in Gold zu stucken mit einer negativen Winrate :)\n\nGold 4 mit 49% winrate ist quasi self explanatory I guess. ","replies":[{"poster":"Ayka","date":"2017-05-15T09:55:54.967+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Boosting eGrills,realm=EUW,application-id=ElKI1ocy,discussion-id=xGy1GujL,comment-id=00070000,timestamp=2017-05-15T08:37:10.975+0000)\n>\n> (No offense!!)\n> \n> Ich finde es ebenfalls erheiternd, wie viele eGirls sich auf low Platin/ Dia boosten lassen als Support main, nur um nächste Season wieder in Gold zu stucken mit einer negativen Winrate :)\n> \n> Gold 4 mit 49% winrate ist quasi self explanatory I guess.\n\nDer Witz an der Sache ist das ich genau das gleiche erheiternd finde xD \nNur leider bin ich weder Booster noch stucked:)\nSpiele Supp im ranked weil ich mit meinen Freund gerne bot spiele und er jinx Main ist. \nHatte nen Scheiß start in die season aber im moment läuft's super ^^ solltest du meine matchhistory mal angucken würdest du sehen das (abgesehen von den letzen 2 rankeds) ich 13 von 14 gewonnen Hab:) man sieht sich dann wieder wenn ich in Platin bin ^-^","replies":[]}]}]},{"poster":"Rena","date":"2017-03-29T10:20:31.412+0000","up_votes":1,"down_votes":0,"body":"(aber spielen schon wie Gold)\nDann würdet ihr schon Gold sein no offense.\nEs gibt Gold spieler die Leute für Geld auf Silber boosten.\nAber ja egal viel glück bei der Suche","replies":[{"poster":"Maíko","date":"2017-03-29T11:50:43.479+0000","up_votes":1,"down_votes":0,"body":">Es gibt Gold spieler die Leute für Geld auf Silber boosten.\n\nIch verstehe grad den Zusammenhang nicht :D","replies":[{"poster":"Rena","date":"2017-03-29T13:20:15.801+0000","up_votes":1,"down_votes":0,"body":"Es gibt Goldspieler die Leute auf Silber boosten also aus Bronze raus.\nHab es wegen seinem \"aber spielen schon wie Gold\" geschrieben","replies":[]}]}]},{"poster":"Bleedbane1","date":"2017-03-29T10:50:50.613+0000","up_votes":1,"down_votes":0,"body":"ihr müsst einen unterschied zwischen soloq und flex machen, mein smurf hier ist in solo plat 2 aber in flex wird er wahrscheinlich silber kommen da ich da niemals serious spiele also wenn ihr gegen gold leute in flexi gewinnt sagt das nichts aus;)\nviel erfolg bei der suche","replies":[]},{"poster":"Valtyna","date":"2017-03-29T10:17:50.125+0000","up_votes":1,"down_votes":0,"body":"Ich muss immer wieder schmunzeln :P\nViel Glück bei der Suche.\n\n{{champion:28}}","replies":[]}]}