{"poster":"Azterkzxc","date":"2016-01-25T01:24:41.087+0000","title":"¿Qué opinan de este champ que me inventé?","subforum":"Creaciones de la comunidad","up_votes":1,"down_votes":0,"body":"Bueno su nombre es Saken, es humano y tal vez un hermano perdido de Braum {{champion:201}} o de Garen {{champion:86}}, pero con la diferencia que se dedic&oacute; a hacer mal en vez del bien, entrenando su fuerza bruta para ser intocable a todo el que se le cruce y dando pu&ntilde;etazos a quien lo mire feo, un mat&oacute;n pero de familia que se averg&uuml;enza de &eacute;l.\r\n\r\nEn fin sus habilidades ser&iacute;an las siguientes:\r\n\r\nPasiva: &ldquo;Debilitamiento por Fatiga&rdquo;: Saken obtiene por sobre el 20% de vida 20% de armadura y 25% de resistencia m&aacute;gica adicionales pero 10% menos de regeneraci&oacute;n de vida, bajo el 20% de vida se restan 30% de armadura y 35% de resistencia m&aacute;gica,  pero se le suma 65% de regeneraci&oacute;n de vida y con m&aacute;s rapidez.\r\n\r\nQ: &ldquo;Knock-Out&rdquo;: Saken se abalanza sobre un enemigo que le da un golpe infligiendo da&ntilde;o m&aacute;gico y dej&aacute;ndolo inmovilizado por 1,5 segundos.\r\n\r\nW: &ldquo;La roca voladora&rdquo;: Saken lanza una roca que ralentiza al enemigo durante 2 segundos.\r\n\r\nE: &ldquo;Ignorar las leyes de la f&iacute;sica&rdquo;: Saken puede revertir su pasiva, manteniendo su porcentaje de armadura y resistencia m&aacute;gica adicionales pero sum&aacute;ndole el 65% de regeneraci&oacute;n de vida, sacrificando un 35% de su man&aacute; en el nivel que sea.\r\n\r\nR: &ldquo;&iexcl;La pelea se desata y todos vuelan por los aires!&rdquo;: Saken puede saltar dentro de un rango para romper el piso y hacer que enemigos y/o aliados dentro de ese rango salgan disparados en la direcci&oacute;n que mire Saken. Los enemigos sufren da&ntilde;o m&aacute;gico y los aliados reciben un escudo que los protege durante 4 segundos.\r\n\r\nB&aacute;sicamente ser&iacute;a viable para ser supp, no creo que pueda ser otra cosa, a no ser que se le a&ntilde;adiera da&ntilde;o m&aacute;gico a todas las habilidades (excepto la E) para ponerlo en top o mid con AP, cosa que ser&iacute;a bastante interesante pero preferir&iacute;a que solo sirviera de supp.\r\n\r\nY m&aacute;s adelante inventar&eacute; un dibujo de &eacute;l y todo lo dem&aacute;s, las stats como HP, Man&aacute;, regeneraciones de todo tipo, etc. Habr&iacute;a que hacer una simulaci&oacute;n para ver como ir&iacute;a una pelea normal, si es muy op o demasiado d&eacute;bil, en todo caso tengo programas con los cuales podr&iacute;a hacer una simulaci&oacute;n pero me tomar&iacute;a unos meses a no ser que esta idea le llegue a Rito y quieran intentar algo con las habilidades.\r\n\r\nY aunque no tenga claras las stats b&aacute;sicas del personaje igual me di la paja de hacerlas xD aqu&iacute; est&aacute;n:\r\n\r\nSTATS A NIVEL 1:\r\n\r\nVida: 600 (+95)\r\nRegeneraci&oacute;n de Vida: 7,50 (+0,80)\r\nMan&aacute;: 235 (+40)\r\nRegeneraci&oacute;n de Man&aacute;: 6 (+0,6)\r\nDa&ntilde;o de Ataque: 59 (+2,8) \r\nVelocidad de Ataque: 0.650 (+3,5%)\r\nVelocidad de movimiento: 345\r\nArmadura: 20 (+5)\r\nResistencia M&aacute;gica: 29 (+2)\r\nAlcance: 125 (Mel&eacute;)\r\n\r\nY eso, ojal&aacute; les haya gustado, si alguien sabe alguna forma de contactarse con Rito para dar ideas de champs nuevos y cosas as&iacute; p&oacute;nganlo en los comentarios, ser&iacute;a de mucha ayuda.\r\nY obviamente comenten si les gusta o si est&aacute; muy OP o no tiene gracia o haya algo que se le podr&iacute;a cambiar.","replies":[{"poster":"KarmaUnder","date":"2016-01-25T02:26:21.355+0000","up_votes":1,"down_votes":0,"body":"30% de armadura y 20% de mr ? eso no te parece roto... ? pero bueno sacando eso, riot hace campeones con mecanicas nuevas inovadoras, todo lo de ese champ parecen habilidades robadas a otros champs ya echos, pensa en una mecanica nueva antes de pensar un champ","replies":[]},{"poster":"SoloQ Beast","date":"2016-01-25T01:44:21.654+0000","up_votes":1,"down_votes":0,"body":"Se va a la mierda de roto en top le haces hydra y listo haces snowball facil","replies":[]},{"poster":"A Shot to Kill","date":"2016-01-25T01:37:06.052+0000","up_votes":1,"down_votes":0,"body":"El de la roca voladora es técnicamente lo mismo cuando Gnar se transforma a Mega Gnar y utiliza la Q . mas o menos bueno el post, pero los nombres de las habilidades son bastante largos, pero bueno si es tu primera vez es aceptable.","replies":[]}]}