{"poster":"Paroe","date":"2016-06-07T23:37:18.269+0000","title":"So now that the hoopla over malzahar is over (mostly. NA and EUW still have blind hate) can we...","subforum":"Gameplay","up_votes":3,"down_votes":7,"body":"... buff his laning and ultimate? \r\n\r\nI suggest re-tuning his E - malefic visions - to do  35/45/55/65/75+0.2AP per second over 4 seconds, or perhaps 15/20/25/30/35+0.1 AP per half second. what this does is allows interaction with thunderlords, which is frustratingly difficult to proc on him. It also makes M-pen malzahar MUCH more attractive, which is good as Mpen is much easier to balance for sustained damage.\r\n\r\nA second change id like to see is his ult pool do a base 50/55/60+0.1 to 75/80/85+0.2AP depending on the enemies missing health, maxing out at 50%HP. This change in particular alleviates the major problem of malzahars ult just not feeling like an ult, by adding  the damage onto either the pool or the channel (probably the pool...) it will actually do a tangable amount of damage, and not at most 21% max HP (which, if you ever played ANY traditional mage, your ult usually does more than 21% of their max health anyway if you have any amount of AP).","replies":[{"poster":"ChargeItDownMid","date":"2016-06-08T02:35:51.152+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Paroe","date":"2016-06-08T02:58:50.529+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=haaaaaaaalp,realm=NA,application-id=3ErqAdtq,discussion-id=sRZ022Lk,comment-id=0002,timestamp=2016-06-08T02:35:51.152+0000)\n>\n> Why? He doesn&#x27;t need buffs. He went from blatantly broken to slightly above average. His passive is absolutely amazing on a mid range mage and he is a competitive pick against anyone who isn&#x27;t god tier right now.\n\nIf thats the case you would see him in high ELOs globally. It is not the case. Koreans dont even have malzahar on the map. \nPre-rework malzahar wasnt broken either... he was a clearly defined anti-assassin who excelled at shutting down 1v1 all ins. \nPost rework malzahar is this weird secondary support who doesnt have kill potential on his own but can do a lot of damage over time.\n\nThe problem NA and EUW has with malzahar stems from his passive being blatantly overpowered to compensate for 500+2.0AP being removed from his kit in exchange for a weaker voidling that makes him a phenomal objective-based jungler with situational enable-type ganks, and a stout refusal to learn how to play against him. We accept yasuo's shield, why cant we accept malzahar?\n\nStronger changes to malzahar would definitely include the rework of his passive into something different. Like an spellsword and/or % increased movespeed scaling at levels 1, 6, 11, and 16 (5, 7, 9, 11%). But... his current passive is whats keeping him viable outside the jungle. He cant harass,  he cant gank, and *he cant kill on his own*. He lacks most of the power than made him malzahar to begin with. \n\nLane malzahar needs a little love. Theres no reason a leblanc should be out pushing me, or an ekko, or a zed. I AM malzahar. i was the poster child for farm lane.  The changes suggested in the opening post return a little of that feeling, and turn what feels like a useless and non-impactful ult into something that just feels better. Hell, lowering the %HP damage (nobody even LIKED the pool to begin with... it was a vision tool mostly. bush check) to give his ult some kind of base damage is a fantastic change, even if that base damage isnt much it will help feel impactful instead of how it currently is; a secondary support semi-hard CC.\nAlso, making Mpen more attractive is by and far the best way to keep malzahar feeling good without breaking him. Mpen builds get 400AP max if you dont get CDR, 330 if you do get CDR. While it makes you an off tank, it gives you 60 or so flat magic penetration which works extremely well for low damage abilities which hit multiple times. Incentivising Mpen is probably the best way for riot to handle future malzahar changes that look into removing his over powered passive.","replies":[]}]},{"poster":"SaltyKracka","date":"2016-06-08T01:58:32.531+0000","up_votes":1,"down_votes":3,"body":"Let's not buff the already OP champ any further.","replies":[{"poster":"Paroe","date":"2016-06-08T02:07:54.848+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=SaltyKracka,realm=NA,application-id=3ErqAdtq,discussion-id=sRZ022Lk,comment-id=0001,timestamp=2016-06-08T01:58:32.531+0000)\n>\n> Let&#x27;s not buff the already OP champ any further.\n\nBut hes not OP o.O Hes had one of the largest nerfs in the games history, and became an objective focused jungler in a jungle where objective control is paramount. \n\nAlso, his lane his bad compared to other mages. Even cass has a better lane than him; most of the meta mid laners easily break him. If it werent for his passive, malzahar would be dumpstered right now except in the jungle.","replies":[{"poster":"SaltyKracka","date":"2016-06-08T02:20:26.709+0000","up_votes":1,"down_votes":1,"body":"[Sure looks](http://champion.gg/champion/Malzahar/Middle) [OP](http://champion.gg/champion/Malzahar/Top) [to me.](http://champion.gg/champion/Malzahar/Jungle)","replies":[]}]}]},{"poster":"Realr","date":"2016-06-08T09:59:59.576+0000","up_votes":1,"down_votes":1,"body":"LMFAO\n\nMalzahar has a 57% win rate in Plat+ Ranked. That's the highest win rate for any mid laner. For comparison, Zed has a 46% win rate.\n\nMalzahar is literally the last person that needs a buff. If it's tough to proc thunderlord's on him then don't get thunderlord's as a keystone.\n\nAnyway, it's not blind hate, he's just not fun to play against and is currently very strong.","replies":[]},{"poster":"Paroe","date":"2016-06-08T01:57:23.306+0000","up_votes":1,"down_votes":1,"body":"Bump. \nIf youre gonna downvote, explain why instead of blindly hating like sheep.","replies":[]}]}