{"poster":"NoSwagNoKill","date":"2018-05-30T12:01:33.206+0000","title":"Verbindungsprobleme- Kennt jemand meine Daten?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Gr&uuml;eziiii\r\n\r\nich wurde heute aus mehreren Spielen ..gekickt&quot; obwohl mein Internet einwandfrei funktioniert.\r\nIch hatte auch loginprobleme -&gt; konnte mich einfach nicht einloggen.\r\n\r\nKann es sein dass jemand meine Daten kennt und sich bei mir immer einloggt?\r\n\r\nMFGG","replies":[{"poster":"Mjölnir Kind","date":"2018-05-30T12:05:52.984+0000","up_votes":2,"down_votes":0,"body":"League of Legends hat hin und wieder Probleme mit beschädigten Dateien oder nicht zugewiesenen Assets. Eine schlechte Leistung oder seltsame Gameplay-Probleme, vor allem nach einem neuen Patch oder eine Neuinstallation, können durch eine Reparatur behoben werden. Und so kannst du die Reparatur ausführen:\n\n1) Starte League of Legends\n2) Klicke in der oberen rechten Ecke des Anmeldebildschirms auf das Zahnradsymbol (neben der X-Schaltfläche)\n3) Klicke in den Optionen unter Fehlersuche auf „Komplettreparatur starten“\n\nAnmerkung: Dieser Prozess kann, abhängig von der Geschwindigkeit deines Computers und der Menge an Dateien, die repariert werden müssen, zwischen 5 und 30 Minuten dauern.","replies":[{"poster":"NoSwagNoKill","date":"2018-05-30T12:08:05.445+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Antwort. Werde ich machen.\nIst also nach deiner Meinung ein fremder Loginversuch komplett  auszuschließen?","replies":[{"poster":"Gin","date":"2018-05-30T12:09:49.261+0000","up_votes":2,"down_votes":0,"body":"Ja. Die von dir oben beschrieben \"Symptome\" deuten, aus meiner Sicht, in keinster Weise darauf hin dass da jemand anderes seine Finger im Spiel hat.","replies":[]}]}]},{"poster":"Gin","date":"2018-05-30T12:08:47.943+0000","up_votes":2,"down_votes":0,"body":"Nein, du wurdest nicht gehackt.\n\nWenn jemand anderes sich Zugriff auf deinen Account verschafft hat und auf diesem angemeldet ist, dann könntest du dich gar nicht erst einloggen und würdest die Meldung bekommen dass der Account bereits auf einem anderen Rechner angemeldet ist.\n\nWas deine Internetprobleme betrifft, erstelle bitte mal einen tracert damit wir das Problem versuchen können zu finden:\n\n> Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n> Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n> Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\n> https://www.pingplotter.com/download.html \n> Um ein Log zu erstellen, ladet das Programm bitte runter und stellt es dann folgendermaßen ein:\n> \n> Trace Interval: 1 second\n> Focus Time: all\n> Target Name: 185.40.65.1\n> Startet das Programm dann über den grünen Button oben links und lasst es laufen, während ihr im Spiel seid.\n> Wenn während des Spiels Probleme aufgetreten sind, ist das Log verwertbar und kann folgendermaßen im Forum geteilt werden:\n> \n> Edit -> Copy as Text\n> Geht nach [Pastebin.com](http://pastebin.com/)\n> Fügt das kopierte Log unter \"New Paste\" ein und klickt auf \"Create new Paste\"\n> Kopiert den Link zum Log auf Pastebin aus der Adressleiste und fügt diesen in euren Forenpost ein.\n\nAlternativ, solltest du WLAN verwenden, kannst du auch mal probieren ob ein Umstieg auf ein LAN-Kabel zu einer Verbesserung führt.","replies":[]}]}