{"poster":"Lord HiddenRich","date":"2019-03-16T14:21:48.035+0000","title":"¿cómo puede ser posible?","subforum":"Problemas Técnicos","up_votes":8,"down_votes":3,"body":"Creo que es la primera vez desde finales de 2014 que mi cuenta queda en cola de baja prioridad, realmente encuentro estúpido que por querer jugar una partida donde no te puedas conectar por quién sabe que motivo te den este castigo. \r\nEl día de hoy intenté jugar un ranked y me encuentro con la sorpresa de no poderme conectar a la partida, luego de cerca de 6 minutos se me conecta y veo la animación del surrender, claramente provocada por el remake. Un poco desconcertado volví a entrar a otra ranked y me encuentro con lo mismo.\r\n¿por qué deberia tener un castigo cuando la culpa no es mía?, ni siquiera me fuí afk o apagé el pc, solo me quedé esperando como la gente normal a que empezara la partida.\r\nPara esto propongo 2 soluciones:\r\n-La primera es que la partida simplemente no inicie hasta que los jugadores estén conectados, y luego de un cierto tiempo poner la opción a los otros jugadores de finalizar la espera para volver a la sala de espera. Así no hay partida y tampoco penalización por problemas de conexión en las que el usuario no tienen ningún tipo de responsabilidad.\r\n-La segunda es por si no quieren hacer la anterior porque es muy dificil y no tienen los recursos para hacerla, es nada más ni nada menos que poner más minutos antes para que se realize el remake, actualmente si te demoras más de 3 minutos en entrar los otros usuarios tienen la opción de reiniciar la partida, aquí la penalización está justificada porque la partida ya inició, podriamos cambiar los 3 minutos a 5 o 7, donde la conexión la lenta ya debería haber entrado a la partida o si no se puede conectar da la opción al jugador a quitar la pantalla de carga y volver a conectarse\r\nEstas no son las unicas opciones que se pueden tomar, solo las doy como sugerencias.\r\nEspero que hayan leído el post, y si fue así muchas gracias, ojalás haya sido de su agrado.\r\nMe despido con un gran abrazo, \"Un jugador más de la comunidad\".","replies":[{"poster":"Shenta2","date":"2019-03-16T15:00:32.392+0000","up_votes":4,"down_votes":0,"body":"Me encuentro en la misma problematica lo peor de todo es que luego para poder superar mi castigo empece a jugar con la penalizacion de leaverbooster y me sucede lo mismo.","replies":[]},{"poster":"Bazinga1233","date":"2019-03-16T20:01:55.189+0000","up_votes":2,"down_votes":0,"body":"La primera opción no sirve la gente se aprovecharía al ver la composición y se iría \"afk\"  y la segunda darias la oportunidad al team enemigo de tener mas ventaja","replies":[]},{"poster":"RodrigoG","date":"2019-03-16T17:46:06.529+0000","up_votes":2,"down_votes":1,"body":"Y todo el mundo tiene que perder tiempo porque tu pc anda mal?","replies":[]},{"poster":"Nikoratzu","date":"2019-03-16T18:05:31.249+0000","up_votes":1,"down_votes":0,"body":"Yo también tengo errores de conexión de vez en cuando pero con tres minutos me vasta para regresar a la partida","replies":[]},{"poster":"Słnged","date":"2019-03-16T18:03:03.582+0000","up_votes":1,"down_votes":0,"body":"En desacuerdo contigo. Poner más minutos para el remake representa ventaja absoluta para enemigo y esto aumenta conforme aumenta la división. Deberías contar con la información fe que las partidas tienen un tiempo límite de carga. Anda fijándote en la ruedita de carga si no gira de porque te conviene reiniciar la pantalla de carga","replies":[]},{"poster":"Zhearun","date":"2019-03-16T17:30:37.915+0000","up_votes":1,"down_votes":0,"body":"Antes que nada, debo decirte que si tuviste problemas en conectarte a una Ranked, lo **último** que debés hacer es **intentar a entrar a otra Ranked**. Si ya tuviste errores de conexión, no tenés que volver a intentar con otra Clasificatoria, podés usar una partida contra Bots o una personalizada para probar la conexión.\n\nAhora, con respecto a tus ideas:\n\n> #Que la partida no inicie a menos que todos los jugadores estén conectados.\nEsto **no** es posible porque el Cliente y las partidas **usan dos servidores distintos**. Quizás no tengas problema en abrir el launcher, chatear con amigos, mirar el historial y eso, pero sí tengas problemas al iniciar una partida. Esto es porque tener los jugadores conectados al Cliente ocupan procesamiento en los servidores, los cuales podrían estar usando los recursos de alguien que esté rankeando, por ello es que hay dos distintos. El problema es que estos dos servidores no se pueden _comunicar_ entre sí (por eso es que no hay un medidor de ping en el Cliente, cosa que incontables personas piden desde hace años), así que no hay manera de saber si te vas a poder o no conectar al servidor de las partidas a menos de que estés dentro de una. Por eso es que los matches **sí o sí** deben iniciar y no se pueden quedar en la pantalla de carga.\n\n[](https://.)\n\n> #Atrasar el contador de Remake.\nNo tiene mucho sentido esta propuesta, ya que para ese momento sería más sencillo simplemente usar la Rendición Temprana. Además que el Remake está diseñado para **no hacerte perder el tiempo en una partida perdida**. Obligarte a tener que quedarte mirando lejos siete minutos es mucho más que tres. También el sistema supone que, si no te pudiste conectar en menos de tres minutos, ya sos lo que se consideraría _un caso perdido_, porque realmente ninguna conexión tarda más que esto en cargar (sino, estaríamos 15 minutos mirando la pantalla de carga), así que es más fácil considerarte como que **no estás queriendo conectarte, sino que te fuiste AFK a propósito**.","replies":[]},{"poster":"Hnk Kenshiro","date":"2019-03-16T15:13:09.110+0000","up_votes":1,"down_votes":1,"body":"Si te surge algun problema con el cliente/internet lo más sano es hacer una prueba en una personalizada o normal antes de entrar a otra ranked :p","replies":[]},{"poster":"Kanja","date":"2019-03-16T21:14:15.084+0000","up_votes":1,"down_votes":2,"body":"¿Por qué ellos se tienen que bancar tu \"no culpa\"?\n\nJugá coop y ya fue.","replies":[]}]}