{"poster":"Zetryder","date":"2018-04-21T00:23:41.401+0000","title":"League of Legends ist am absterben!","subforum":"Champions & Gameplay","up_votes":5,"down_votes":16,"body":"Hallo, \r\n\r\nWie viele andere auch bin ich der Meinung, dass lol nicht mehr lange leben wird.\r\nGanz einfach aus dem Grund: LoL wird immer mehr Frustrierender.\r\n\r\nAm Anfang wollte ich es nicht glauben, aber mittlerweile merke ich es selber.\r\nPatch für Patch wird lol immer schlechter, frustrierender.\r\n\r\nEs ist einfach nicht mehr dass selbe, dass lol an dass ich mich erinnere hat mir spaß gemacht. selbst bei einer 7ner loosing streak.\r\n\r\nMittlerweile ist es nicht mal mehr möglich ein game zu carryen, weil dass spiel sich soo geändert hat.\r\nAnfang der season bei 30 games eine 75+% winrate, aber aus irgend einem grund verliere ich mittlerweile bei 10 games alle und wenns man gutläuft gewinne ich 2 davon.\r\nNicht nur mir geht es so, sondern auch ungefähr die hälfte meiner Freundschafts liste. Ich weiß ehrlich nicht was los ist momentan. \r\nEs wird immer frustrierender und frustrierender.\r\n\r\n_______________________________________________________________________________________________________________\r\n\r\nIch sage dass nicht alles weil ich low elo bin und in letzter zeit so viel verliere, nein:\r\n\r\nNB3: Will mit league aufhören, weil es kein spaß mehr macht. wenn ihr mir nicht glaubt guckt selber \r\nimaqttpie:hat gesagt er wolle auch mit league aufhören, weil es kein spaß macht. er spielt es lediglich weil er damit sein geld verdient\r\nTrick2G: Hat in einem Video gesagt, dass er mit league aufhören will und dass auch machen wird\r\nSolorenektononly: Spielt dass spiel nur wegen seinem yt channel, wird aber auch aufhören.\r\n.\r\n.\r\n.\r\n\r\nkönnte noch so viele bekannte high elo spieler aufzählen\r\n_______________________________________________________________________________________________________________\r\n\r\nIch finds einfach nur traurig was aus dem spiel geworden ist, es hat so viel spaß gemacht und aus irgend einem grund meinte rito lol komplett zu ändern.\r\nWenns so weiter geht wird lol komplett aussterben, und wenn ihr das nicht glauben wollt, guckt euch die Statistiken an ... einfach nur traurig.\r\n\r\n\r\nIch möchte mal hören wie ihr das alle sieht,was denkt ihr, wie waren eure erfahrungen bis jz und wie hat sie sich verändert","replies":[{"poster":"Zyzyx","date":"2018-04-21T06:30:56.586+0000","up_votes":7,"down_votes":2,"body":"Mal so rein aus Interesse....dieser \"\"one player can't win the game but one player can lose the game\"-Kram...hat das eigentlich mal irgendwer nachgewiesen? \nIch will gar nicht anzweifeln, dass dieses Statement der Wahrheit entspricht, aber ich will anzweifeln dass irgendetwas daran neu ist. Das war schon immer so. League war schon immer extrem Team-lastig und das geht nunmal damit einher, dass es primär auf das schwächste Glied in der Kette ankommt, nicht so sehr auf das stärkste. Das ist doch in keinster Weise neu. League funktioniert seit dem ersten Tag so. \n\nMeine Frage ist also...wenn Leute behaupten, dass wäre extremer geworden, kann das denn irgendwer belegen? Sollte ja nicht so schwer sein. Das würde sich z.B. in der Winratio von Smurfs niederschlagen (d.h. extrem überlegener Skill würde zu geringeren Winratios als früher führen). Alternativ könnte man sich die Korrelation zwischen der Winratio und den schlechtesten Stats im Team anschauen, auch da müsste man das auf jeden Fall sehen können. \nUnd ich hab jetzt zwar schon einige dutzend Threads zu dem Thema gelesen in denen dieser Satz stumpf immer und immer wieder wiederholt wird, aber einen tatsächlichen Beleg dafür hab noch nirgendwo gesehen. Es gibt doch haufenweise Daten-Nerds in der League-Community. Warum hat noch keiner diesen Effekt nachgewiesen? Oder hab ich das einfach nur verpasst?\n\nUnd als ob das noch nicht genug wäre, lese ich eigentlich auch nie wirklich, WARUM das ein aktuelles Problem sein soll. Da wird zwar mit Phrasen wie \"aktuelles Meta\" oder \"Balancing für pro play\" um sich geschmissen, aber so wirklich erklärt wird eigentlich nie, was genau denn nun zu diesem neuen Trend führt und warum.\n\nUnd, last but not least: Selbst wenn es so ist, ist es denn etwas schlechtes? League war schon immer ein Teamspiel und soll es auch sein. Einzelperformance ist sekundär, es geht um die Fähigkeit ein Team zum Sieg zu führen. Ist das denn wirklich sowas schlimmes oder haben sich manche Leute einfach nur das falsche Spiel ausgesucht?\n\nAschließend noch ein kleines Detail:\n\n>  aus irgend einem grund verliere ich mittlerweile bei 10 games alle und wenns man gutläuft gewinne ich 2 davon.\n\nDieser Kommentar spiegelt meiner Meinung nach sehr gut das Problem an den Diskussionen zu dem Thema wieder. Es wird einfach ein feuchter Dreck auf Fakten gegeben und sich einzig und allein auf ein durch Youtuber erzeugtes Bauchgefühl verlassen.\nUm konkret bei dir zu bleiben: Deine Winratio ist keinesfalls irgendwo zwischen 0 und 20% wie du zu denken scheinst, sondern bei satten 56%. Du könntest also gar nicht falscher mit deiner Einschätzung liegen. Selbst deine \"kürzliche\" Winratio liegt bei völlig normalen 46% und ist damit mehr als doppelt so hoch wie deine maximale Vermutung. \nAnders gesagt: Das von dir wahrgenommene Problem ist komplett imaginär und existiert faktisch nicht. Zumindest nicht für dich.","replies":[{"poster":"fokko1023","date":"2018-04-21T11:12:14.164+0000","up_votes":1,"down_votes":2,"body":"Ob es sich genau in Zahlen zeigt kann ich nicht sagen. ( Das wird Riot aber wohl prüfen können ) \nEs ist Aber etwas was viele Spieler so empfinden. \nIch hab schon immer viel Tanks jungle supports und adc,s gespielt. Mir mach das nicht so viel aus. \n\nEinige Dinge Warum hab ich in meinem Post schon genannt. \n\nAber es sind dinge wie Gold wird nun eher Global verteilt. \nDas macht es für den Spieler der in führung liegt schwerer alleine was zu machen. \nDas verlierende team kann nicht mehr so gut den focus nur auf einen gefeedeten legen. \nRoaming , jungle , tower , catch up exp , catch up gold , mehr gold auf supp und jgl , plays verhindern statt machen. \n\nDie sachen mit den Roaming mids stört mich Momentan am meisten. auch wenn ich das selber ausgenutzt habe um von silber nach plat zu kommen. Ekko q 3 autos wave weg dann bot towerdiven mit ult und wieder in die mitte ohne farm zu verlieren. Mein Gegner macht dann Entweder dasselbe wobei ich hier einfach im bush gewartet habe um ihn umzubringen. Oder er versucht mich mit seinem jungler zusammen im river zu erwischen aber naja das passierte eigentlich kaum. \n\nAll diese dinge tragen dazu bei. \nfür Solo Player oder auch streamer youtuber die den focus lieber nur auf sich hätten ist das bestimmt ein nachteil.\nAuch für die Playmaker die gerne agressiv gute plays machen wollen und den gegner zu fehlern zwingen wollen ist die Meta wohl nix. \nBei der diskussion um Janna waren auch viele der Meinung das sie deswegen so Stark ist weil sie Plays von Gegnern verhindert und sich allgemein sehr safe spielt. \n\nEs nervt die gegnerische botlane platt zu machen nur um dann von mid/jungle permanent angegriffen zu werden. Und dann kommt auch noch der Toplaner mit Tp wärend unserer mit ignite spielt. Der Gegnerische adc bekommt dann auch noch Global gold und catch up exp/gold.\nIst zwar eher selten aber machmal läuft es dann so.","replies":[{"poster":"Zyzyx","date":"2018-04-21T18:04:53.820+0000","up_votes":1,"down_votes":0,"body":"> Aber es sind dinge wie Gold wird nun eher Global verteilt.\n\nDas mag für Türme gelten, war aber z.B. früher im Bezug auf Drachen z.B. deutlich krasser. Da hat sich nicht wirklich soooo viel geändert. \n\n> Die sachen mit den Roaming mids stört mich Momentan am meisten.\n\nAuch das ist nichts neues. Midlaner haben schon immer geroamet und enstprechende Movement-Fähigkeiten die das einfacher machen (z.B. TF Ult, Kassa Ult und ähnliches) waren früher auch deutlich stärker. \n\n> All diese dinge tragen dazu bei.\n\nZwei Dinge...die in keinster Weise spezifisch für League zum jetzigen Zeitpunkt sind. \n\n> für Solo Player oder auch streamer youtuber die den focus lieber nur auf sich hätten ist das bestimmt ein nachteil.\n\nGut...denn diese Spieler haben sich eindeutig das falsche Spiel ausgesucht. Wer einen Ego-Trip braucht, ist in League verkehrt. Und das war auch schon immer so. \n\n> Auch für die Playmaker die gerne agressiv gute plays machen wollen und den gegner zu fehlern zwingen wollen ist die Meta wohl nix.\n\nDa ist es wieder, das Meta-Argument. WARUM ist das so? Was ist denn das Meta und warum und was daran spezifisch ist dafür verantwortlich dass aggressive Plays weniger bringen?","replies":[{"poster":"fokko1023","date":"2018-04-25T21:28:21.127+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=SPJ85U8rz0E","replies":[]}]}]},{"poster":"Zetryder","date":"2018-04-21T10:59:42.249+0000","up_votes":1,"down_votes":1,"body":"Meine winratio lag bei 78% bis vor ner Woche ^^. Und nein lol war noch nie so extrem teamabhängig. Sobald eine lane verliert ist das komplette Game over","replies":[{"poster":"Sirrkas","date":"2018-04-21T11:51:07.281+0000","up_votes":1,"down_votes":0,"body":"Daran wird sich nicht viel geändert haben. Ich erinnere mich zumindest daran, dass schon in Season 1 und 2 die selben Beschwerden kamen. Das eigene Team ist unfähig und man kann nicht alleine gewinnen. Klar kann man nicht oder zumindest nicht im Normalfall alleine gewinnen. Es ist schließlich ein 5vs5. Aber wenn eine Lane verliert, sind 1 bis 2 Gegner stark. Wenn die Aussage stimmen würde, dass es reicht, wenn eine Lane verliert, damit das Spiel verloren ist, würde das auch für die Gegner gelten. \n\nJetzt gewinnt in deinem Team etwa eure Midlane und eure Toplane verliert. Stimmt die Aussage, dass eine verlorene Lane zur Niederlage führt, würden jetzt beide Teams verlieren müssen. Wichtig ist nicht ob eine Lane bei euch verloren habt, sondern was ihr daraus macht. \n\nIn meiner Einstufung hatte ich etwa mal ein Match, bei dem ich meine Botlane als Support hart verloren habe. Eigentlich war das Spiel wirklich schon gelaufen, etwa bei Minute 12 oder 15 war unser Inhibitor gefallen. Das hat sich eigentlich nicht gelohnt weiterzuspielen. Aber statt zu gewinnen, haben die Gegner lieber 1vs5 gekämpft. Immer wieder sinnfrei in unsere Base rennen und versuchen Kills abzugreifen. Bis die gemerkt haben, dass sie so nicht gewinnen, waren wir denen im Teamfight schon mindestens ebenbürtig. Ab da war das Spiel entschieden, jeder Kampf war ein Sieg für uns und wir müssten nur noch die Midlane hinunterspazieren und den Nexus zerstören.\n\nDa ich Gold eingestuft wurde, war das wohl auch etwa im Bereich oberes Silber oder unteres Gold. Wenn meine Gegner da solche Fehler machen können, schaffen die das heute auch noch bei dir. \n\nAm Ende gewinnt man nicht, weil man früh einen Vorteil hat, sondern weil man den frühen Vorteil behält und weiter ausbaut. Wirft man den stattdessen weg, kann sich ganz fix das Blatt wenden.","replies":[{"poster":"Zetryder","date":"2018-04-21T12:27:32.924+0000","up_votes":1,"down_votes":3,"body":"Dass Problem in den Games war einfach dass die meisten unserer botlanes gestompt wurden und dennoch versucht haben den gegnerischen adc mit 7 kills zu töten was offensichtlich daneben ging. \n\nDann kommen die ganzen roams zu mid und die bot pusht nicht mal. Dann hat die mid auch automatisch verloren \n\nEs liegt definitiv nicht nur an andere, ich trage mein teil selbst dazu, aber meistens ist dass irgend ein random der feedet, anschließend den jungler flamet und das gesamte game nicht mehr ernst nimmt.\n\nes ist einfach nur frustrierend, erst eine 10er losing streak, dann 2 games gewonne, dann wieder 6 games verloren und dann nur 2 wins, und jz wieder eine 6er losing streak.\n\nich weiß  nicht ob es nur eine phase ist, aber ich habe zurzeit das gefühl man kann nicht wirklich gewinnen wenn eine lane im early gewinnt und der rest feedet","replies":[{"poster":"AI Marko","date":"2018-04-21T15:33:24.423+0000","up_votes":1,"down_votes":0,"body":"ist nur eine phase. es liegt glaubt einfach nur an deiner Einstellung klar kann es sein das du unlucky mate bekommst die komplett \"gut\" sind kappa. ich zum beispiel habe gerade eine gute phase und gewinnt eig fast jedes game und carry die games gerade auch stark solo.","replies":[{"poster":"Zetryder","date":"2018-04-21T22:09:19.420+0000","up_votes":2,"down_votes":2,"body":"Hoffen wir mal dass sich durch den nächsten Patch einiges ändert. Dadurch das das mana Reg extrem genervt wird wird dass wave clear um einiges schwieriger, Was wiederum heißt dass man nicht so schnell zum roamen kommt","replies":[]}]}]}]}]}]},{"poster":"XenesisCH","date":"2018-04-21T09:48:10.826+0000","up_votes":3,"down_votes":0,"body":"> Wenns so weiter geht wird lol komplett aussterben, und wenn ihr das nicht glauben wollt, guckt euch die Statistiken an ... einfach nur traurig.\n\nIch mag Statistiken, aber wenn du mir keine verlinkst, kann ich auch keine angucken {{sticker:cass-cry}}","replies":[]},{"poster":"Sirrkas","date":"2018-04-21T09:39:14.794+0000","up_votes":2,"down_votes":0,"body":">Wie viele andere auch bin ich der Meinung, dass lol nicht mehr lange leben wird.\nGanz einfach aus dem Grund: LoL wird immer mehr Frustrierender.\n\nDas höre ich schon seit Season 2, aber stattdessen ist LoL gewachsen. Ist vermutlich ein wenig wie mit Weltuntergangspropheten. Wenn man jedes Jahr vorhersagt, dass die Welt untergeht, wird irgendwann einer auch richtig liegen. \n\n>Anfang der season bei 30 games eine 75+% winrate, aber aus irgend einem grund verliere ich mittlerweile bei 10 games alle und wenns man gutläuft gewinne ich 2 davon.\nNicht nur mir geht es so, sondern auch ungefähr die hälfte meiner Freundschafts liste. Ich weiß ehrlich nicht was los ist momentan.\nEs wird immer frustrierender und frustrierender.\n\nDie Beschreibung klingt eher so, als wärst du von einer zu niedrigen Division in eine aufgestiegen, bei der du nicht mehr zuverlässig carrien kannst. Dadurch bist du absolut von deinem Team abhängig und früher oder später pendelt man sich bei einer 50 % Winrate ein und verbleibt auf seiner Division. Durch Zufall sind dann noch längere Win- und Losingstreaks möglich, aber das gleicht sich dann auch immer wieder aus, wenn man sein Niveau hält.\n\nEdit:\n\nWenn du wieder mehr gewinnen willst, gibt es dafür etwas das man tun kann. Wenn du nämlich anfängst an dir zu arbeiten und dich zu verbessern, bist du wieder stärker als deine aktuelle Division. Du wirst wieder in der Lage sein, mehr Spiele für dich zu entscheiden und steigst weiter auf, bis du eben den nächsten Bereich erreichst, an den du gehörst. Ich persönlich würde empfehlen, ab jetzt jedes Spiel ein paar {{item:2055}} zu erwerben und zu nutzen. Am besten hast du immer wenigstens eines aktiv, aber für den Anfang würde es reichen mal 1 bis 3 je Spiel zu erwerben und sinnvoll zu platzieren. \nIm early etwa in Fluß auf der eigenen Seite oder in einem nahen Tribush. Eventuell einen zum Drachen oder Baron mitnehmen um gegnerische Sicht dort zu räumen etc. ","replies":[{"poster":"Zetryder","date":"2018-04-21T11:23:01.761+0000","up_votes":1,"down_votes":0,"body":"Wir(ich und mein pre) gaben uns hochgespielt. Ich war jz auf diesem acc jede Season b1 weil ich nie die Motivation hatte rankeds zu spielen. \n\nDiese Season wollte ich dem noch mal ne Chance geben und wir haben uns bis in silver 2 hochgespielt. \n\nEs lief alles gut biss vor kurzem nur noch am verlieren, aber wirklich auch nur und ich kann nicht nachvollziehen warum. Klar man kann nicht alle gewinnen, aber von 21 games nur 3 gewonnen? Und dass lag ja nicht an den Control wards. Es gibt immer eine lane die auf die schei**e haut.\n\nEs kommt mir so vor alsob wir absichtlich das schwächere Team bekommen, Und Genau damit komme ich nicht klar.","replies":[{"poster":"Sirrkas","date":"2018-04-21T11:42:59.301+0000","up_votes":1,"down_votes":0,"body":">Es lief alles gut biss vor kurzem nur noch am verlieren, aber wirklich auch nur und ich kann nicht nachvollziehen warum. Klar man kann nicht alle gewinnen, aber von 21 games nur 3 gewonnen? Und dass lag ja nicht an den Control wards. Es gibt immer eine lane die auf die schei**e haut.\n\nLaut deinem [op.gg-Profil](http://euw.op.gg/summoner/userName=Zetryder) hast du von den letzten 20 Rankeds 6 gewonnen. Das sind also schon mal doppelt so viele Siege wie du angenommen hast. Von den letzten 32 hast du 12 gewonnen. Weiter geht op.gg bei dir in der Solo/Duorangliste nicht zurück. Schätze mal, da habt ihr mit Rankings wieder angefangen. Maximal sollte die Seite 30 Tage zurück gehen.\n\n>Es kommt mir so vor alsob wir absichtlich das schwächere Team bekommen, Und Genau damit komme ich nicht klar.\n\nMan kann mal kurzfristig Pech haben. Wenn ihr aber weiter so eine niedrige Winrate habt, wird es eher daran liegen, dass ihr einfach noch nicht auf dem entsprechenden Niveau seid, um in eurer aktuellen Division das Spiel so weit beeinflussen zu können, dass ihr gewinnt. \n\nBei dir sieht man zwar auch Niederlagen, bei denen du richtig gute KDAs hattest. Es kann sein, dass du die sogar als Challenger verloren hättest oder es kann auch sein, dass du deinen Vorteil in solchen Runden nicht richtig genutzt hast. \n\nBei deinem Lux-Spiel vor 3 Tagen, hattest du etwa sehr viele Kills und wenige Tode. Mit Abstand den meisten Schaden im Spiel gut gefarmt und einige Assists. Dein Partner hat aber scheinbar einfach nur kassiert. 4/12/10 mit Darius ist jetzt nichts wirklich gutes. Die anderen 3 hatten ähnlich viele Tode und alleine kann man eben nicht alles Schultern. Vielleicht konntest du das nicht gewinnen, vermutlich hätte sich etwas geändert, wenn du anders gehandelt hättest. Das kann man schlecht sagen. \n\nEs finden sich aber auch Spiele, bei denen du und dein Premade eher mäßige Leistungen erbracht hast und ihr gewonnen habt. Bei deinem BC-Spiel vor 8 Tagen, scheint die Zoe fast ganz alleine gewonnen zu haben. Quinn und Cho haben zumindest noch gut Championschaden gemacht. Ob ihr nützlich wart, lässt sich hier aber nicht auf op.gg erkennen.\n\nÄhnlich wie du hier über dein Team denkst, werden auch deine Teammates mal über dich gedacht haben. Bei deinem GP Spiel etwa mit 2/7/5 wird sich die Sivir sicher gedacht haben, warum sie gerade mit so einem Team gestraft wird.\n\n\nIch kann dir keinen Rat geben, wie du von jetzt auf gleich in Silber stompen kannst. Aber du kannst nach Sachen suchen, die du noch nicht wirklich beherrscht. Das kann Lanemanagement sein, Mapawareness, gute Orte für Wards oder vielleicht auch nur einen Weg zu finden, wie der Rest deines Teams vielleicht eher auf deine hoffentlich passenden Calls reagiert. \n\nVielleicht bist du auch zu sehr auf Kills fixiert und lässt dann das eigentliche Spielziel aus den Augen. Sogar im Goldbereich habe ich oft genug gesehen, wie 3 Leute lieber vergeblich einem Hecarim durch ihren Jungle folgen, in der Hoffnung den Kill zu machen, statt den ADC mit Support davon abzuhalten, den eigenen Botinhib und zugehörigen Turm zu zerstören. Manchmal ist es besser zu wissen, auf welchen Kill man verzichtet, um zu gewinnen.","replies":[{"poster":"Zetryder","date":"2018-04-21T13:43:24.416+0000","up_votes":1,"down_votes":1,"body":"Ich dachte am Anfang auch dass ich nur auf die k/d/a achte und dass es daran liegt.\n\nGestern hab ich versucht die kda zu ignorieren und bin geroamt um meiner bot aus der schei**e zu helfen, was an sich gut geklappt hat, der ez konnte für ne kurze Zeit auf sich selber aufpassen.\n\nNur haben wir dass Game wieder verloren weil Top und bot für sich gespielt haben. Ich hab versucht die Rolle des leaders an mich zu nehmen und habe calls gemacht die der toplaner und ap maplh supp für unwichtig hielten. Die wollten eher die sivir mit ga durch den halben Jungle verfolgen wobei die ran gestorben sind.\n\nVlt liegt dass ja nur an der Meta, vlt sind wir(mein pre und ich) noch nicht so ganz drin. Aber selbst wenn wir versuchen anderen zu helfen, fact ist wenn jemand nicht gut ist oder dass Spiel nicht ernst nimmt hat man auch keine Chance was zu machen.\n\nIch z.b. hab mich wieder an meiner alten Main Rolle versucht und habe zum größten Teil versagt(hatte in der Zeit nur Lee gespamt, Aber dadurch dass Trackers raus genommen wurde hab ich mich vom Jungle entfernt, weil ich gemerkt habe wie mein Team darunter gelitten hat. Lee ohne Trackers hat nicht mehr so viel Mobility) und bin dann zur Mitte gegangen, weil es zurzeit meine beste lane ist. Aber selbst auf solo carry Champs ist dass nicht mehr so einfach was zu machen, wenn eine oder 2 lanes am verlieren sind (wegen dem global gold). \n\nHoffen wir mal dass es nur vorüber gehend so ist, und dass ich wieder mein Spaß in lol finde","replies":[]}]}]}]},{"poster":"Asulia","date":"2018-04-21T05:06:53.788+0000","up_votes":2,"down_votes":1,"body":"Einen Faktor hast Du aber vergessen.\n\nDie Leute werden älter, entwickeln andere Interessen, bekommen Mann/Frau und Kind, eine andere Arbeit etc.\nUnd diese leute entwickeln durch andere Prioritäten im Leben, Ihre definition des \"Spaß machen\" anders, und dann heisst es halt, ja hat halt 6 Jahre Spass gemacht aber jetzt nicht mehr.\nDer einfachste Weg ist halt dann zu sagen, das Spiel hat sich so verändert , es macht kein Spass mehr statt sich selbst zu reflektieren und zu sagen eijo Ich bin halt älter.","replies":[]},{"poster":"Löwen Herz Pro","date":"2019-05-26T16:46:55.263+0000","up_votes":1,"down_votes":0,"body":"hallo liebe leute mir ist aufgefallen das ich baron nicht mehr alleine besiegen kann was vorher aber völlig normal war ich bin der meinung das legal of legans das sich natürlich ständig verändert hier ohne angaben aus gründen irgend was ändert am spiel selbst mit lvl 16 was fürher mit lvl 14 kein problem war wird zum mega problem baron kann ich nicht mehr alleine töten was hat es damit aufsich irgend was ist da faul und der hammer ist es ist nicht mehr möglich zu gewinnen alleine gegen den baron was ist da bitte los ?","replies":[]},{"poster":"Feedora","date":"2019-01-15T15:59:19.006+0000","up_votes":1,"down_votes":1,"body":"Hey!\nIch sehe das mittlerweile leider so ähnlich wie du... Ich liebe LoL seit ich Anfang Season 2 damit angefangen habe und ich habe es auch verkraftet, dass sie meine Mains gereworked haben, obwohl ich das super unnötig fand (old Seju und Vlad). Früher ging es um so viel mehr als jetzt. Jetzt kann man Gegner mit Level 3 oneshotten. Allgemein geht es nur noch darum, wer wen zuerst oneshottet. Drakes sind dafür nicht wirklich wichtig und auch sonst braucht es nicht viel Strategie. Hinzu kommt, dass die neuen Champ immer \"übertriebenere\" Skills haben. Der eine kann 3 Mal CCn, der andere kann mit einem Skill oneshotten, Skills klauen, ist untargetable, kriegt gefühlte 10k Leben wieder etc... Sollte Riot wirklich an einem MMORPG arbeiten, dann denke ich, dass es denen auch scheiß egal ist, ob die LoL jetzt gegen die Wand fahren. Ich meine, irgendwo muss es denen sogar so oder so egal sein, denn sonst würden sie ihrer Community zuhören und sich die Kritik der ganzen \"oldschool\" Spieler zu Herzen nehmen. Wir alle lieben das Spiel so wie es mal war und es gab keinen Grund da so viel daran zu ändern. Reverten kann man meiner Meinung nach immer. An WoW hat man bereits deutlich genug gesehen, wohin das führt, wenn man nie auf die Community hört und Sachen nicht wieder zurück ändert, wenn niemand damit zufrieden ist. Meiner Meinung nach wird alles immer mehr verschlimmbessert. Was mich auch tierisch nervt, ist, dass ich seit den neuen Changes immer gegen viel höhere Spieler geranked werde, wodurch ich nur noch zerstört werde und verliere. Klar, liegt daran, dass ich schlechter bin als die. Aber dann möchte ich doch auch bitte, ebenbürtige Gegner haben. So wird mir mittlerweile auch die letzte Motivation, mein jahrelanges Lieblingsspiel zu spielen, genommen. \nIch würde mir so sehr wünschen, dass die Entwickler mehr auf uns hören und LoL retten. Ich will kein neues Spiel, genauso wie etliche andere auch. So viele meiner Freunde haben bereits aufgehört zu spielen, weil es nicht mehr dasselbe ist, aber sie wären alle bereit zurückzukommen, wenn es sich wieder ändern würde - sie warten und hoffen alle darauf. \nDas macht mich einfach so traurig....","replies":[{"poster":"Sirrkas","date":"2019-01-15T16:28:16.955+0000","up_votes":1,"down_votes":0,"body":"> Früher ging es um so viel mehr als jetzt. \n\nDas kann deine Meinung sein, muss aber nicht zutreffen. Ich würde eher sagen, früher war alles chaotischer, weil die Leute in Season 2 eben noch nicht so viel über das Spiel im Schnitt wussten wie heute. \n\n>Jetzt kann man Gegner mit Level 3 oneshotten. \n\nDa hätte ich gerne Beispiele. Das klappt nämlich nicht. Wenn beide Seiten volle HP haben, kann da niemand jemanden oneshotten. Das sieht anders aus, wenn man bis dahin schon 2 mal gestorben ist und dein Gegner jetzt 2 Level über dir ist. Dann liegt es aber eher daran, dass man sich in so eine schlechte Lage manövriert hat. \n\n>Allgemein geht es nur noch darum, wer wen zuerst oneshottet. Drakes sind dafür nicht wirklich wichtig und auch sonst braucht es nicht viel Strategie. \n\nDas kannst du gerne so sehen, empfinde ich aber nicht so. \n\n>Der eine kann 3 Mal CCn,\n\nKann Leona doch auch. Und die ist schon älter. Nautilus passt da auch rein. \n\n>der andere kann mit einem Skill oneshotten,\n\nWer bitte?\n \nÜbrigens ging das früher auch schon. Nasus Q etwa, hatte schon immer das Potenzial hierfür. Veigar kommt auch in Frage, da er endlos AP stacken kann, dann haut sein W und R auch rein, egal welche Season. \n\n>Skills klauen\n\nDas ist neu, aber früher war das sicher so gut wie unmöglich umsetzbar. \n\n> ist untargetable\n\nFizz und Yi fallen mir da auf die schnelle ein. Können das auch schon lange. Gibt es übrigens als Zhonyas auch schon länger. \n\n>kriegt gefühlte 10k Leben wieder etc... \n\nNoch mal Yi, diesmal AP-Yi. Konnte den Fountainlaser tanken und sich dabei noch vollheilen. \n\n>Sollte Riot wirklich an einem MMORPG arbeiten, dann denke ich, dass es denen auch scheiß egal ist, ob die LoL jetzt gegen die Wand fahren. Ich meine, irgendwo muss es denen sogar so oder so egal sein, denn sonst würden sie ihrer Community zuhören und sich die Kritik der ganzen \"oldschool\" Spieler zu Herzen nehmen.\n\nRiot kümmert sich durchaus um das Spiel, schau dir etwa die ganzen Videos an, die Entwicklerposts etc. Aber nur weil jemand länger dabei ist, würde ich dem nicht gleich zugestehen, mehr Ahnung als das Entwicklerteam vom Spiel zu haben. Aus den ganzen Punkten die du aufgeführt hast, konnte ich ja auch problemlos schon andere Champions nennen, die genau das schon länger können. Aber die neuen sind ja die schlimmen. \n\n>An WoW hat man bereits deutlich genug gesehen, wohin das führt, wenn man nie auf die Community hört und Sachen nicht wieder zurück ändert, wenn niemand damit zufrieden ist. Meiner Meinung nach wird alles immer mehr verschlimmbessert. \n\nWas die Spieler wollen und was die bessere Option ist, gehen nicht unbedingt Hand in Hand. \n\nZudem habe ich vor einer Weile hier schon mal jemanden gesehen, der meinte, WoW wäre am Anfang perfekt gewesen und da gab es keine großen Macken, angeblich war das laut ihm bei LoL auch so. Hat nicht lange gedauert, bis sich jemand gemeldet hat, der das widerlegt hat. Wenn der Schurke im PvP PermaCC verteilen kann, ist das nicht gerade gut balanciert. \n\n>Was mich auch tierisch nervt, ist, dass ich seit den neuen Changes immer gegen viel höhere Spieler geranked werde, wodurch ich nur noch zerstört werde und verliere. Klar, liegt daran, dass ich schlechter bin als die. Aber dann möchte ich doch auch bitte, ebenbürtige Gegner haben. So wird mir mittlerweile auch die letzte Motivation, mein jahrelanges Lieblingsspiel zu spielen, genommen.\n\nIch schätze mal, du bist frustriert, weil du gerade viele Normals verloren hast? \n\nDie fairsten Matches wirst du in SoloQ finden können. \n\n>Ich würde mir so sehr wünschen, dass die Entwickler mehr auf uns hören und LoL retten. Ich will kein neues Spiel, genauso wie etliche andere auch. So viele meiner Freunde haben bereits aufgehört zu spielen, weil es nicht mehr dasselbe ist, aber sie wären alle bereit zurückzukommen, wenn es sich wieder ändern würde - sie warten und hoffen alle darauf.\nDas macht mich einfach so traurig....\n\nDie Realtität würde vermutlich anders aussehen. Sagen wir mal, Ende Season 2 wäre die letzte Änderung gewesen. Ihr hättet vermutlich alle bis Ende Season 3 aufgehört. Das Spiel würde irgendwann zu eintönig werden, weil sich gar nichts mehr ändert. \n\nKlar, wenn man an früher mitdenkt, war alles besser. Die Nostalgie erledigt das für einen. Wenn ich dann an Monstrositäten wie AP-Yi denke oder mir überlege, dass TF früher auf dem W den Teleport hatte, statt auf der Ult, möchte ich die Zeiten eigentlich nicht zurück.\n\nIch kann verstehen, wenn dir das Spiel keinen Spaß mehr macht. Vielleicht hast du einen Punkt erreicht, an dem du einfach mal eine Pause brauchst. Ein oder zwei Wochen was anderes machen könnten dann wohl helfen. Aber ich würde jetzt nicht einfach alles verdammen, nur weil es sich verändert hat. \n\nDu kannst auch gerne dich an früher erinnern und meinen, das wäre besser. Aber wenn wir den Gedanken mal weiterführen. Hat dir Age of Empires und Diablo 1 gefallen? Wenn ja, spielst du das heute noch so häufig, wie du es damals getan hast?","replies":[]}]},{"poster":"Pandeonor","date":"2018-04-21T06:13:05.541+0000","up_votes":1,"down_votes":0,"body":"Du bist gestiegen, verlierst jetzt und anstelle der anderen Sieler ist nun das Spiel selbst Schuld. Dazu kommt Spielmüdigkeit.\n\n\nDas mit der Anzahl der Spieler und den aufhörenden ist im groben schlicht nicht richtig, 99% der dazu zu lesenden Dinge sind durch frustrierte Spieler kolportierte falsche Informationen. Alles deutet darauf hin, das es LoL gut geht, mit Außnahme LoL NA.... aber die spielen weltweit keine Rolle.","replies":[{"poster":"Zetryder","date":"2018-04-21T11:08:26.329+0000","up_votes":1,"down_votes":1,"body":"Wenn's lol doch so gut geht, sag mir mal wieso s8 mit weniger Spieler denn je angefangen hat","replies":[{"poster":"D4RKEVA","date":"2018-04-21T11:27:52.634+0000","up_votes":1,"down_votes":0,"body":"Und woher hast du diese statistik?\n\nAußerdem ist die aussage schlecht getroffen\n\nSeason 2 z.B. waren nichtmal 1/10 der spieler da wie in season 7 und in season 8 sollen jetzt alle weg sein oder was?","replies":[{"poster":"Zetryder","date":"2018-04-21T15:31:00.455+0000","up_votes":1,"down_votes":0,"body":"Season und Season 8 nicht so viele wie Season 6","replies":[{"poster":"D4RKEVA","date":"2018-04-22T09:03:53.708+0000","up_votes":1,"down_votes":0,"body":"Woher hast du die zahlen?\n\nohne quelle glaubt dir das hier keiner","replies":[{"poster":"Zetryder","date":"2018-04-22T11:53:26.556+0000","up_votes":1,"down_votes":1,"body":"Such in diesem Thread und du wirst deine Zahlen finden","replies":[{"poster":"D4RKEVA","date":"2018-04-23T10:07:58.778+0000","up_votes":1,"down_votes":0,"body":"Keine Zahlen deinerseits\n\ndie einzigen zahlen die ich hier gefunden habe sind.\n\nSpieler im ranked, nach denen war season 6 etwas mehr ranked lastiger \n\nrankeds machen nicht alle spielerzahlen aus und ein minimaler abstieg lässt league nicht sterben sondern nur auf kurzfristigen hype reagieren\n\nIch hab auch 4 monate kaum gespielt wegen overwatch so wie viele andere","replies":[{"poster":"Zetryder","date":"2018-04-23T23:06:39.013+0000","up_votes":1,"down_votes":2,"body":"es ist trotzdem fakt dass s6 die erfolgreichste season ist, such im internet und du wirst 100 antworten finden","replies":[{"poster":"D4RKEVA","date":"2018-04-24T08:22:41.754+0000","up_votes":1,"down_votes":0,"body":"Du findest auch antworten in form von „die erde ist flach/eine scheibe“ ohne quellen oder mit fakten die unterstützbar sind muss man nicht darauf schließen\n\nVor allem ranked spieler =/= erfolgreichste season","replies":[{"poster":"Zetryder","date":"2018-04-25T14:00:02.872+0000","up_votes":1,"down_votes":0,"body":"da hast du wahrscheinlich deine infos her","replies":[{"poster":"D4RKEVA","date":"2018-04-26T12:04:34.368+0000","up_votes":1,"down_votes":0,"body":"Und damit hat diese „diskussion“ ein Ende.\n\nDu kannst weder Zahlen vorzeigen noch in irgendeiner weise eine normale oder eloquente antwort darbieten...","replies":[{"poster":"Zetryder","date":"2018-04-29T22:15:39.571+0000","up_votes":1,"down_votes":0,"body":"wieso ändert rito dann dass ranked systen xD weil natürlich alle so zufrieden sind, aber ja leute sehen nur dass was sie sehen wollen","replies":[]}]}]}]}]},{"poster":"Pandeonor","date":"2018-04-24T08:44:34.595+0000","up_votes":1,"down_votes":0,"body":"Ich habe im NA-Forum einen all-in-post erstellt:\nhttps://boards.na.leagueoflegends.com/en/c/general-discussion/mXbJtfdb-league-playerbase-fortnite-some-data-around-all-in-2018\n\nDort findest Du was es zu finden gibt.","replies":[]}]}]}]}]}]},{"poster":"Pandeonor","date":"2018-04-21T15:55:02.688+0000","up_votes":1,"down_votes":0,"body":"Na ja. \"Denn je\".\n\nIch kenne Deine Quelle nicht. Um das zu überprüfen bin ich einmal hierhin gegangen:\nhttp://euw.op.gg/statistics/tier/\n\nEingeranked EUW damit imho 21.4.2018: \t**1,966,644 (100%) **\n\n\n\nam 15.4.2015 (um nahe am gleichen Saisonpunkt zu sein): ** 1,770,814 (100%) **\nhttps://web.archive.org/web/20150410201812/http://euw.op.gg:80/statistics/tier/\n\nam 23.4.2016: **2,239,916 (100%) **\nhttps://web.archive.org/web/20160423013716/http://euw.op.gg:80/statistics/tier/\n\n4.5.2014: 1,661,956 (100%) \n\nFür 2017 steht keine Zahl zu Verfügung.\n\n\nWir liegen damit was ranked-Accounts angeht auf den EUW-Servern rd. 10% unter dem Wert des Peak-Jahres 2016 aber noch 10% über dem Wert 2015 (und den Jahren davor). Für diesen Vergleich spielen Smurfs auch keine Rolle, da sie in jedem Jahr zu finden sind.\n\n\nUnd das ist nur ein Wert. Ich kann Dir noch andere liefern wenn Du interessiert bist.","replies":[{"poster":"Zetryder","date":"2018-04-21T22:03:30.416+0000","up_votes":1,"down_votes":1,"body":"Genau dass meine Ich, es Hatt seine Gründe weshalb Season 6 die beste Season war. Und es Season für Season weniger Leute werden.\n\nNaja vielleicht wird Season 9 besser","replies":[{"poster":"Pandeonor","date":"2018-04-22T10:33:42.891+0000","up_votes":1,"down_votes":0,"body":"Das hat nichts damit zu tun. Das war ein Hype wie bei Overwatch oder nun Fortnite. Jeder Hype hat logischerweise einen Peak, da nichts (außer der Geldmenge) unendlich wachsen kann. Ab der Sättigung muss es erst einmal rückläufig werden. Ein Rückgang um lediglich rund 10% wie bei League kann man als _äußerst_ stabil bezeichnen. Andere Spiele verzeichnen bereits nach 2 Jahren nach dem Peak meist Rückgänge um 30-50%. Siehe Dota2, OW und andere. PUBG und Fortnite werden folgen.","replies":[]}]}]},{"poster":"fokko1023","date":"2018-04-21T11:29:18.056+0000","up_votes":1,"down_votes":0,"body":"Das liegt wohl an den vielen Großen änderungen. \nDie Spieler machen desgen mehr normals und steigen später ins ranked ein.\nwar zumindest die allgemeine meinung.","replies":[]}]}]},{"poster":"killer of death","date":"2018-04-25T13:51:40.225+0000","up_votes":1,"down_votes":0,"body":"Ich hab mal mit einem anderen Spieler mal gesprochen und der meinte,\ndass Riot sich mehr Zeit nehmen sollte um die Spielbalance wieder herzustellen.\nIch denke dies ist nicht der einzige Faktor, sondern man sollte auch mal auf die neuen Spieler schauen, \nwelche sich durch Gerüchte, Freunden oder Bekannte vermehrt haben, und denen die  Steuerung schwieriger Champs besser zeigen, \nso dass sie nicht einen Champion nehmen, den sie nicht spielen können.\nAußerdem denke ich, währe es besser das Riot sich mal die ganzen Gegenstände anschaut.{{sticker:slayer-pantheon-popcorn}} \n\nEs würde mich zusätzlich freuen, wenn bei meinem nächsten Jahresrückblick unter Freudestränen nicht immer meine schlechtesten Momente angezeigt werden, was mich auch sehr frustriert hat.{{sticker:slayer-jinx-unamused}} \n\nIch hoffe ich konnte helfen und wünsche dir noch alles gute {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Zetryder","date":"2018-04-25T14:02:15.512+0000","up_votes":1,"down_votes":0,"body":"ich hab mich mal n bisschen schlauer gemacht und dass erklärt alles was ich eig. mit diesem thread sagen wollte \n\nhttps://www.youtube.com/watch?v=JYwdtEGN-oQ","replies":[]}]},{"poster":"Master4never","date":"2018-04-22T08:38:59.566+0000","up_votes":1,"down_votes":0,"body":"So eine ähnliche Erfahrung meine ich auch gesammelt zu haben. Aber die bsp die du nennst sind zum Teil Ex-Profi und highelo Player. Weiß nicht ob es dir aufgefallen ist aber meistens spielen sie alleine und seltener in Gruppen (Verstehe mich nicht falsch sie tun es aber halt nicht immer).\n\nAber das ist genau das was Rito will: Ein team. Nicht einen einzigen High Elo freak (sorry wenn das beleidigend klingt so ist es nicht gemeint), der in der Lage ist als einziger zu carrien. Nein er soll das gesamte Team mitnehmen. Nicht für sich die Kills sammeln sondern auch mal welche abgeben (türlich nicht dem supporter). \n\nEin Erlebnis hat mir dahingehend die Augen geöffnet. Ich war mit drei Freunden in einem Match drin, wo eine gegnerische Evelyn als jngl total eskaliert ist. Sie stand irgendwann 21/3/0. Die Moral des Teams sank ziemlich schnell auch die von meinen Freunden, denn wir sterben wie die Fliegen. Aber besorgt hat es mich keinsewegs, da ihre Mitspieler eine normale bis negative kda hatten, aber nie nicht mehr als 3 kills. Sie hat alle Kills gesammelt obwohl sie damit im lategame als Evekyn nix anfangen kann. statt dem ADC und dem midlane ggf auch dem Toplane Kills zu geben nahm sie sich die selbst.\n\nMit dieser egoistischen Sichtweise hat sie das Spiel verloren. Obwohl wir weniger Teamkills hatten konnten wir dennoch das Spiel für uns gewinnen. Natürlich kann man sagen das die composition wichtig ist. Aber aus der Elo wo ich komme, spielt sowas keine wirklich tragende und große Rolle.\n\nDeshalb spiele ich immer mit Freunden zusammen, wenn ich ernsthaft gewinnen will. SoloQ fasse ich ohne meinen Freund schon gar nicht mehr an.\n\nRito hat es in meinen Augen also richtig gemacht, dass nicht immer der snowball gewinnt sondern das Team.\n\nIch hoffe ich konnte dir helfen, die Augen etwas zu öffnen und zeigen was Rito wirklich erreichen will.","replies":[]},{"poster":"Tempname2919","date":"2018-04-21T14:38:55.081+0000","up_votes":1,"down_votes":0,"body":"Ach, wieder jemand der meint das LoL stirbt^^\nMan, ist schön wie viele Wirtschaftsexperten wir so haben.\n\n> Wie viele andere auch bin ich der Meinung, dass lol nicht mehr lange leben wird.\nGanz einfach aus dem Grund: LoL wird immer mehr Frustrierender.\n\nWer sind denn die vielen Anderen? Deine Freundesliste? Wie viele sind da drauf, sicher nicht mehr als 200. Ist nicht sehr aussagekräftig, selbst wenn alle keinen Bock mehr hätten. Meinst du die Streamer? Zu denen komme ich gleich^^\n\n> Am Anfang wollte ich es nicht glauben, aber mittlerweile merke ich es selber.\nPatch für Patch wird lol immer schlechter, frustrierender.\n\n> Es ist einfach nicht mehr dass selbe, dass lol an dass ich mich erinnere hat mir spaß gemacht. selbst bei einer 7ner loosing streak.\n\nAlso dieses Argument gibt es schon immer. Jeder Patch wird schlechter. Riot Games zerstört das Spiel schon seit den letzten 9 Jahren. Und trotzdem existiert das Spiel noch, obwohl Riot noch nie etwas anderes gemacht hat als das Spiel zu \"zerstören\". Früher war ja immer alles besser und so^^\nUnd gut so das es \"nicht mehr das selbe\" ist. Ich glaube das wäre ein Grund warum ich aufhören würde, wenn LoL immer noch so wäre wie in Season 1.\n\n> Mittlerweile ist es nicht mal mehr möglich ein game zu carryen, weil dass spiel sich soo geändert hat.\nAnfang der season bei 30 games eine 75+% winrate, aber aus irgend einem grund verliere ich mittlerweile bei 10 games alle und wenns man gutläuft gewinne ich 2 davon.\nNicht nur mir geht es so, sondern auch ungefähr die hälfte meiner Freundschafts liste. Ich weiß ehrlich nicht was los ist momentan.\nEs wird immer frustrierender und frustrierender.\n\nGut so, dass man nicht mehr alle Games alleine carrien kann. Das ist nämlich teilweise sehr frustrierend wenn man gut spielt und dann der Toplaner im Gegnerteam alleine das Game gewinnt. Das kommt gelegentlich vor, aber ist halt nicht die Regel. War es früher btw. auch nicht, wenn ichs mir so recht überlege.\nAber ich finde es gut das es so sehr vom Team abhängt...so als Teamspiel :)\nUnd wie vorher schon angemerkt, ich finde deine Freundesliste nicht sehr aussagekräftig. Wenn es frustrierender wird, dann kann ich dagegen nix sagen, ist immerhin eine subjektive Wahrnehmung. Eine Pause könnte dir gut tun.\n\n> Ich sage dass nicht alles weil ich low elo bin und in letzter zeit so viel verliere, nein:\n\n> NB3: Will mit league aufhören, weil es kein spaß mehr macht. wenn ihr mir nicht glaubt guckt selber\nimaqttpie:hat gesagt er wolle auch mit league aufhören, weil es kein spaß macht. er spielt es lediglich weil er damit sein geld verdient\nTrick2G: Hat in einem Video gesagt, dass er mit league aufhören will und dass auch machen wird\nSolorenektononly: Spielt dass spiel nur wegen seinem yt channel, wird aber auch aufhören.\n.\n.\n.\n\n> könnte noch so viele bekannte high elo spieler aufzählen\n\nZwei Sachen dazu: \n\n1. Sie spielen trotzdem noch (zumindest einige, kenne den Solorenektononly nicht) und selbst wenn ein paar gehen, was dann? Trotzdem bleiben noch mehr als genug Streamer die das eben nicht so sehen. Sorry, aber die Streamer sind auch nur Einzelpersonen, selbst mit bis zu 2 Millionen Followern (kenne deren Zahlen nicht), nur weil ein Streamer aufhört werden noch lange nicht alle Follower aufhören.\n\n2. QT hats selbst gesagt, er spielt nicht aus Spaß sondern nur wegen dem Verdienst. Das ist der springende Punkt. Die Streamer spielen fast jeden Tag oder sogar jeden Tag für mehrere Stunden (ich glaube 8 Stunden streamen ist nicht sehr unüblich...manchmal sogar mehr) und dann spielen sie dabei ausschließlich LoL (oder fast ausschließlich), da wundert es mich nicht das sie keinen Bock mehr haben. Wenn ich jeden Tag 8h das selbe Spiel spielen würde, hätte ich auch schon lange aufgehört. Aber daran sind die Streamer selber Schuld. Dann sollten sie mal ab und zu ein wenig was anderes spielen.\nIch bezweifel das sie alle Zuschauer verlieren nur weil sie statt LoL mal 2-3 Runden Fortnite spielen. Ich meine, sie trauen sich ja auch zu sagen das sie ja angeblich mit LoL aufhören wollen. Also warum dann Angst haben, statt 8h LoL nur noch 4 zu spielen und die anderen 4h mal ein anderes Spiel? Verstehe ich nicht.\n\nAber wie gesagt, mich wundert es nicht, dass sie keinen Spaß mehr haben. Für sie ist es halt teilweise kein Spiel mehr, sondern Arbeit. Aber das unterscheidet sie zu uns. Für mich ist es weiterhin ein Spiel, wenn ich keine Lust habe, dann spiele ich eben etwas anderes. Momentan spiele ich neben LoL nämlich gerne Far Cry 5. Mich \"zwingt\" ja keiner LoL zu spielen (die Streamer wie gesagt, eigentlich auch nicht :D)\n\n> Ich finds einfach nur traurig was aus dem spiel geworden ist, es hat so viel spaß gemacht und aus irgend einem grund meinte rito lol komplett zu ändern.\n\nWie gesagt, seit Season 1 wird gesagt das es traurig ist was aus dem Spiel geworden ist. Früher war ja alles besser, viele denken das. Aber ich sehe darin nix negatives. Wie ich bereits erwähnt habe, würde ich das Spiel schon lange nicht mehr spielen, wenn Riot NIE etwas geändert hat. Ich begrüße die Änderungen. Jede Season habe ich eine andere Version von LoL, ist doch super.\n\n> Wenns so weiter geht wird lol komplett aussterben, und wenn ihr das nicht glauben wollt, guckt euch die Statistiken an ... einfach nur traurig.\n\nWie wäre es mit folgender Statistik: In 2016 war der Umsatz 1,8 Mrd. und 2017 2,1 Mrd. für mich sieht das ja ganz nach einem Anstieg aus.\nOder meinst du das LoL wirklich erst seit ca. 4 Monaten \"stirbt\"? Gut, dann können wir wohl wirklich nur auf die Zahlen 2018 warten, aber das dauert noch ein wenig. Aber ich sehe überhaupt kein sterben in LoL...nur halt die Champions und vor allem mich selbst sehe ich sterben :D\n\nEgal was für Statistiken du hast, ich bezweifel das sich darin ein wirkliches \"sterben\" aufzeigen lässt. Ansonsten bin ich mal gespannt, würde mich ja interessieren was für Statistiken du da hast. Würde mich darüber freuen, wenn du diese mit uns teilen würdest.\n\nGrüße\n{{sticker:katarina-love}}","replies":[{"poster":"Zetryder","date":"2018-04-21T15:29:36.378+0000","up_votes":1,"down_votes":1,"body":"1.Die Season hat mit weniger Spieler angefangen als durchschnittlich.\n\n2.klar spielen die dass weiter, viele verdienen deren Geld mit lol. Und ich meine wenn selbst Faker in seinen Streams fortnite spielt.. Dass muss dann was heißen.","replies":[{"poster":"Tempname2919","date":"2018-04-21T18:32:35.792+0000","up_votes":1,"down_votes":0,"body":"1. Da hat bereits jemand drauf geantwortet.\n\n2. Du wiederholst quasi das was ich bereits sagte mit deinem ersten Satz =/ Zu Faker: \"wenn selbst\"? Er ist auch nur ein Spieler. Und was muss das dann heißen? Das Fortnite momentan super gehyped ist? Wissen wir alle. Die Frage ist wie lange das so bleibt. Das wird sich in der Zukunft zeigen. Außerdem wird das Spiel nicht für das \"sterben\" von LoL sorgen. Dafür sind die Spiele viel zu unterschiedlich. Komplett verschiedene Genre.","replies":[]}]}]},{"poster":"BEAR IRL","date":"2018-04-21T16:33:09.108+0000","up_votes":1,"down_votes":0,"body":"naja der snowball effekt ist halt aktuell sehr stark bzw stärker als in den anderen seasons davor.\ndadurch das tower sehr viel schneller fallen und auch mehr gold geben ist das team was einmal vorn ist nur sehr schwer einzuholen bzw man kann dann oft nur auf fehler der gegner hoffen. das führt eben auch zu einem hohen tilt faktor bei den spielern so das viele schon bei min 10 innerlich aufgeben.\nauch die baron anspassung gefällt mir nich wirklich so oft erlebt das man baron jetzt easy in minute 20 macht und so das game einfach gewinnt z.t. kann man mit master yi den baron auch einfach zu 2. töten in minute 23 find ich persönlich eher unvorteilhaft. \nich verstehe das man das für das pro play anpassen musste aber für soloq find ich solche änderungen eher kiontraproduktiv","replies":[]},{"poster":"Megamaexx","date":"2018-04-21T08:44:46.545+0000","up_votes":1,"down_votes":0,"body":"Zuallererst, du sprichst von Statistiken, welche meinst du? Hast du einen Link oder mehrere für mich? \nZum Thema League ist am Sterben:\nDas wurde schon oft prophezeit, immer wieder gab es Leute, die aufgehört haben, aber LoL ist geblieben. Wobei es ganz gut sein könnte, dass LoL jetzt die Konkurrenz bekommen hat, die es brauchte. Fortnite polarisiert ziemlich gut und nach Jahren LoL kann das auch mal langweilig werden. Ich habe ja auch mein Hauptspiel gewechselt und spiele viel Monster Hunter World. \n\nEs ist sowieso sehr erstaunlich, wie lange es LoL geschafft hat, alte Spieler zu halten. Auch die Pros werden älter und sehnen sich nach Alternativen, aber es werden garantiert Neue nachrücken. Ob das auf Dauer ein sinkender Wert wird, wird sich zeigen.","replies":[]},{"poster":"manial fly","date":"2018-04-21T07:42:24.128+0000","up_votes":1,"down_votes":0,"body":"Ach das einzige Problem was LoL hat, ist das es ein Teamspiel ist aber ein großteil der Leute Solo spielt.\nWas meint ihr was dabei rumkommt wenn man 11 Leute die sich ned kennen auf nen Sportplatz stellt und sagt jetzt spielt mal ne Runde Fußball?\n\nAm extremsten fällt mir das immer auf der Botlane auf, ich hasse es mit Randoms auf die Botlane zu gehen. Derjenige muss ja nicht mal schlecht sein aber man hat einfach nicht die Möglichkeit zu gescheid zu kommunizieren. Hinzu kommt dann auch noch mangelndes Vertrauen. Wenn mir i.ein Random sagt ich soll mir ein bestimmtes Item kaufen, ich da aber keinen Sinm drin sehe, gehe ich weiter meinen Build. Es kann sein das der Random recht hat weil er schon mehr Spielerfahrung hat, es kann aber auch ein Anfänger sein der noch gar keine Ahnung hat. Ich denke ein Großteil geht grundsätzlich immer von letzterem aus.\nDas traurige ist, dass die Community schon so eine negative Grundeinstellung hat das konstruktive Hilfe oder eine normale Kommunukation im Chat gar nicht mehr möglich ist. I.wer fasst es dann wieder falsch auf und schwubb hat man zwei Leute im Team die sich gegenseitig beleidigen statt sich aufs Spiel zu konzentrieren.\n\nDes Weiteren kommt dann noch dazu dass einfach viele Spieler ihre Egoschiene fahren und am Ende die Besten Stats haben wollen und ne tolle Bewertung. Wenn das dann mal nicht so klappt wird halt geflamed oder getrollt. Ich meine warum ist den der Midlaner die beliebste Rolle und der Support die unbeliebteste? \nNatürlich ist es ein schönes Gefühl zu carrien und am Ende viele Kills zu haben, aber ein Rekkles schafft es im Lategame auch nur die Gegner allesamt weg zufegen weil er vier andere Leute im Team hat die ihm das überhaupt erst ermöglichen.\nWenn jeder die Möglichkeit hätte ein Spiel alleine zu carrien könnte man aus LoL ein 1v1 machen.\n\nDas ein Spieler allein ein Spiel komplett verlieren kann würd ich auch nicht so sagen. Wenn jemand relativ früh seinen Gegner feedet ist das alles nicht so dramatisch wenn dafür dir anderen Lanes gewinnen. Problematisch wirds nur wenn dass auch nicht der Fall ist. Dann wird dann nur schnell gesagt ja der und der ist schuld der steht 0/10. Klingt für mich dann so wie, weil der so schlecht gespielt habe konnte ich es mir nicht leisten unterdurschnittlich zu spielen.\n\nAm Besten würde das Spiel funktionieren wenn ausschließlich nur noch Premade Teams gegeneinander spielen würden. Man könnte gescheid kommunizieren und es gäbe kein toxisches Verhalten. Da dies aber aktuell so wie das Spiel läuft nicht möglich ist, muss jeder damit leben das man alleine niemals so gut wie ein Rekkles oder Faker sein wird und grundsätzlich aufgrund der Randoms immer ein paar Nachteile hat.","replies":[]},{"poster":"Basok","date":"2018-04-21T05:58:58.873+0000","up_votes":1,"down_votes":0,"body":"Viele Spiele werden mit der Zeit automatisch langweilig. Seit wie viele Seasons spielst du das Spiel? Ich habe zwischendurch eine Pause gemacht, weil mich das Game einfach nicht mehr packen konnte. \n\nIch bin Otto-Normal spieler und das Spiel entwickelt sich sehr schnell. Patches kommen rasch, wenn auch nicht immer gut! Spiel was anderes, probiere neues aus! Irgendwann kehrst du zu League wieder zurück und fängst von vorne an :)","replies":[]},{"poster":"manial fly","date":"2018-04-21T05:35:24.038+0000","up_votes":1,"down_votes":0,"body":"Ach ich hab nichts dagegen wenn die Community kleiner wird, dann reduziert sich hoffentlich auch die Menge an Flamern und co.","replies":[]},{"poster":"TwitchDerBugOfen","date":"2018-04-21T05:56:32.266+0000","up_votes":1,"down_votes":4,"body":"du hast mehr als recht, vor allem autofill versaut mir jetzt aktuell das gesamte spiel...2/3 games ein autofill ADC und adcs entscheiden nunmal signifikant...\n\nwar gerade dabei jenes Ticket zu verfassen: \n\nLiebes Support Team,\n\nich bitte euch ausdrücklich sämtliche Autofill-Fnktionen in Verbindung mit meinem Account und meinem Matchmaking zu entfernen! Es kann nicht sein dass ich aus 2/3 spielen einen Autofill ADC ertragen muss der das gesamte spiel verdirbt. Darüber hinaus kann es nicht sein, dass ich in der duoq 7/7 games second-role/autofill unter mir und meinem Premade ertragen muss, zur meistgespielten Zeit, viele davon sogar beide second-role.\n\nIhr wollt das Spiel competetive fair gestalten aber jedes Spiel ist einfach das mit weniger autofills bzw auf unwichtigeren Rollen das Autofill stark im Vorteil...\nIch warte herzlich gerne 5, wegen mir sogar 10 Minuten länger und muss dafür keinen Autofill fail+flame ertragen.\nFreue mich auf positives Feedback!\n\nBeste Grüße\nMichæl Jaxson\n\n..das mit den 7x fill hat wirklich gestimmt und war gestern, ermüdend ._.","replies":[{"poster":"Angel Ayume","date":"2018-04-21T09:28:39.086+0000","up_votes":2,"down_votes":1,"body":"Dir ist aber klar, dass deine Gegner mir denselben Problemen zu kämpfen haben oder? Oder glaubst du, dass nur in deinem Team autofilled Spieler sind und im Gegnerteam jeder seine Mainrolle bekommt?","replies":[{"poster":"TwitchDerBugOfen","date":"2018-04-21T13:40:37.881+0000","up_votes":1,"down_votes":2,"body":"du wirst lachen, aber wenn die autofill sind ist es i.d.r. höchstens top...das matchmaking ist einfach purer coinflip, komplett geistig behindert xD","replies":[{"poster":"Angel Ayume","date":"2018-04-21T18:35:43.676+0000","up_votes":1,"down_votes":0,"body":"Aber wir können das ja mal auseinander dröseln. \nDein Jax 14/5 Game\n\n* Kennen: Entweder Autofill oder hat seine Second Role gewechselt. Letzte Season war er Main Mid und Second Jgl. Zudem hat er Kennen nie gespielt\n* Nunu: Hat seine Main Role bekommen. Hat den Champ erst 4x in dieser Season gespielt. Ist RekSai Main. Letzte Season hat er Nunu nur 24x gespielt. \n* Zed: Wohl Zed Main, hat seine Main Role bekommen\n* Tristana: Hat seine Main Role bekommen. Hat den Champ aber sowohl diese als auch letzte Season fast nicht gespielt\n* Morgana: Hat mehr Spiele als Adc absolviert, hat letzte Season aber wohl mehr Support gespielt. Dennoch nur Second Role \n\n**Fazit** aus diesem Game: Gegner: 1 Autofill und 1 Second Role \nDein Team: 1 Autofill (Der Toplaner) und 1 Second Role (Der Support)\n\nDein Sejuani 9/6 Game \n\n* Cassiopeia: Main Midlane, hat Main Rolle bekommen \n* Jax: Main Midlane also Second Role\n* Morgana: Main Adc also eher Second Role\n* Twitch: Main Adc hat seine Main Rolle bekommen \n* Tryndamere: Main Top und Main Tryn, Lane bekommen \n\n**Fazit** aus diesem Game: Gegner 2 Second Role, kein Autofill\nDein Team: 1 Autofill (Support) 1 Second Role (Adc) \n\nDein Jax Game 6/8 \n\n* Tryndamere: Toplane und Tryndamere Main, Lane bekommen\n* Graves: Jungle Main aber kein Graves Main, Lane bekommen\n* Diana: Midlane Main und Diana Main, Lane bekommen\n* Jhin: Midlane Main, Second Role\n* Rakan: Support und Rakan Main, Lane bekommen\n\n**Fazit** aus diesem Game: Gegner 1 Second Role\nDein Team: 1 Second Role (Support)\n\nSo. Das sind deine letzten 3 Spiele. Wie du siehst, war es in allen Games völlig ausgeglichen. Zwar hatte der Gegner bei dem Seju Spiel keinen autofilled, dafür aber einen mehr dabei, der seine Second Role spielen musste.","replies":[]}]}]}]}]}