{"poster":"Coffgeister","date":"2017-02-03T10:22:13.013+0000","title":"Unusual Amount of Bots in ARAM","subforum":"Player Behaviour","up_votes":19,"down_votes":0,"body":"In the lat two days I have noticed an outrageous amount of bots in arams, What i mean by this is people using third party software to queue their sub level 30 accounts up to arams and then just run in and feed the entire game. This is clearly in order for them to level up without having to actually play. You can tell instantly because the player has no keystone mastery attached to there champion when the loading screen appears.\r\nthis is really making the game play suffer so please rito do something about it xx","replies":[{"poster":"Porsche 911","date":"2017-02-03T11:19:53.423+0000","up_votes":3,"down_votes":0,"body":"yes me too, i will upvote this so riot can see it","replies":[]},{"poster":"D3210210","date":"2017-02-04T03:56:17.166+0000","up_votes":2,"down_votes":0,"body":"This is also a problem in ARAMs at level 30.\n\nI have had a bot in ~90% oof games in the last week.\n\nI suspect that these accounts are worth more with IP/more champions/runes.\n\nDoes anyone know If RIOT has commented on this situation anywhere?\n\nIt's getting bad. \n\nI'm starting to just not want to play anymore because of the bad taste left in my mouth after sitting through yet another a depressing loss or disgusting victory.\nI've been playing this game since 2009/10 but this is making me want to just go play something else.","replies":[]},{"poster":"Main Line","date":"2017-02-03T21:06:45.247+0000","up_votes":2,"down_votes":0,"body":"This is also making news on the Reddit League of Legends forums (search OCE to see how many threads have been made on this issue in the past week).\n\nHow to spot the current bots:\n\nNO keystone and RANDOM summoner spells\nFirst purchases are tier 1 boots and 2 pots (despite that they have gold for other things)\nNames are usually three syllables or start with f{something}\nRun it down mid feeding\nRandomly throw their ultimates\nSome of them (such as fZotar) are pre-programmed to say \"Let's Push\" in chat.","replies":[{"poster":"JasonWazza","date":"2017-02-03T22:55:01.734+0000","up_votes":1,"down_votes":0,"body":"Nah not even just random syllables.\n\nhttps://oce.op.gg/summoner/userName=nid+spear+buffet\n\nThis is my smurf, play find the bot.\n\nAnswer: Any of them that have a name that is non-sensical, is a bot.","replies":[{"poster":"Main Line","date":"2017-02-04T00:17:49.075+0000","up_votes":1,"down_votes":0,"body":"In the game that you were Ekko, the entire enemy team were robots. But I think there may be two classes of botter at work: the nonsensical one and the three syllable one. I'm guessing the three syllable one has thought ahead a bit more about their marketing prospects at level 30.\n\nIt looks like its ridiculously prevalent pre-level 30.","replies":[{"poster":"JasonWazza","date":"2017-02-04T00:24:31.681+0000","up_votes":1,"down_votes":0,"body":"Yeah it is, playing with my buddy, and except for the last game 6-8 bots every game.","replies":[]}]}]}]},{"poster":"YummyYam","date":"2017-02-17T11:49:35.014+0000","up_votes":1,"down_votes":0,"body":"Here is a prove to abundance of bot programs in ARAM:\nhttp://imgur.com/a/xJ0fZ\n\nBelieve me, it leaves a bad taste in your mouth when you were queuing and expected to play with/against human players.","replies":[]},{"poster":"kappaeology","date":"2017-02-15T05:49:42.784+0000","up_votes":1,"down_votes":0,"body":"im level 30 i play aram alot and i have also encountered at least one bot every game","replies":[]},{"poster":"p e w d e k z","date":"2017-02-07T04:26:40.609+0000","up_votes":1,"down_votes":0,"body":"I remember playing ARAM all the time back in season 5 and i would consistently get into games where all of my teammates are bots and all of the enemies are bots. It was like playing a co-op where your champion is picked for you and your teammates were also bots. I really haven't played ARAM in ages and that is the reason why {{item:3070}}","replies":[]},{"poster":"SASA LELE","date":"2017-02-05T13:50:40.728+0000","up_votes":1,"down_votes":0,"body":"It's ridiculous. On several occasions recently, I've had a 5 man pre made team and the other team has been nothing but bots... (Not that I'm complaining, gg ez bahaha) but, it's definitely 90% are bots or even more than that and you're lucky to find a full team of no bots at all. Reporting does minimal because I can come back 3 matches later and still see that same bot loading into game once again to cause more havoc. Also had like a 4v1 the other night. Felt sorry for that guy. Even queuing alone is too dangerous.\n\nSomething defs needs to be done.","replies":[]},{"poster":"Main Line","date":"2017-02-03T21:14:55.399+0000","up_votes":1,"down_votes":0,"body":"[And the bots strike again this morning.](http://imgur.com/a/teX9l)","replies":[]},{"poster":"One the K","date":"2017-02-03T15:58:20.317+0000","up_votes":1,"down_votes":0,"body":"totally agree. I have been teamed up with 4 bots where the opposite have 5 human for over 5 times in the past 3 days. and it is not fun, it is not how you create a game. I would choose to wait for human player instead.","replies":[]},{"poster":"csajjj","date":"2017-02-03T14:19:16.227+0000","up_votes":1,"down_votes":0,"body":"F%$KING shocking how bad this is. Please permanently delete these accounts so that this doesn't continue to happen. I it ruining the player experience and it is happening so often. Seem like at least 50% of my arams atm.\nRIOT needs to put this issue as top priority.","replies":[]},{"poster":"JasonWazza","date":"2017-02-03T14:05:28.188+0000","up_votes":1,"down_votes":0,"body":"\"unusual\"","replies":[]},{"poster":"Project Xayah","date":"2017-02-03T11:34:37.089+0000","up_votes":1,"down_votes":0,"body":"Bots are a pretty big problem in pre-30 Coop VS AI and ARAM matches to begin with. With Ocean Week, and all the goodies that come along with it, it seems like botters have upped their \"game\" in order to try and grab some of those goodies (most likely to increase the potential sale value of the accounts). Best we (as players) can do is report any player that is or might be a bot (also helps to include the term \"bot\" in the report).\n\nIt's likely not going to do much, though. Even though Riot mostly says they're about improving the experience, bots seem to always get much further than they should be able to, and there's just too many of them for players (and maybe even Riot) to do much about.","replies":[]}]}