{"poster":"Wladimir Putitin","date":"2020-02-29T08:47:57.087+0000","title":"Idee: Neuer Modus","subforum":"Karten & Spielmodi","up_votes":3,"down_votes":4,"body":"**Hallo liebe Community und liebes Riot-Team,**\r\n\r\nIch bin ein casual Zocker, der eigentlich nur ARAM spielt und gelegentlich die featured modes.\r\nLeider muss ich feststellen, dass ich langsam das Interesse an LOL verliere, **da mir einfach die Abwechslung fehlt.**\r\nIch bin mir sicher, dass ich damit nicht alleine bin **(bitte eine Antwort mit \"Hier!\", wenn du das auch so siehst).\r\n**\r\nDeshalb möchte ich hier den Vorschlag unterbreiten, dass Ihr uns **einen neuen dauerhaften Spielmodus** gebt _(Gerne nur für Custom Games ohne Bots, wenn das zu viel Arbeit macht. Das verstehe ich.)_ \r\nUnd zwar stelle ich mir persönlich **einen Sandbox modus** vor, in dem man sich **seine Helden zusammenbasteln** kann. **In der Champion selection hat man sich seinen Champion auszusuchen**, beispielsweise Teemo.\r\n Dann gibt es, wenn das Spiel gestartet hat, **eine Phase in der sich jeder seinen Champion individualisieren kann.** \r\nIch denke da kann man **vielleicht eine Art zweiten Shop einsetzen**, bei dem man erst einen Champion anwählt und sich dann eine seiner Fähigkeiten nimmt, wobei nur eine Ultimate und nur eine Passive wählbar sind. \r\n(Vielleicht kann man da **verschidene Versionen in der Erstellung der Lobby aussuchen.** Beispielsweise **eine Version mit nur einer Fähigkeit aus der jeweiligen Hotkeysparte,** also eine Q-Fähigkeit, eine W-Fähigkeit usw. **Eine Version bei der nur die Ultimate und die Passive limitiert sind und eine Version ohne limit** für die Memes)\r\n{{sticker:galio-happy}}\r\n**Die Fähigkeiten kosten auch etwas**, vielleicht** eine neue Währung, die man im normalen Shop kaufen kann,** wenn man seine Fähigkeiten wechseln will. **So passiert das erst im Super-Lategame.**\r\nAuf die Art könnte sich jeder seine Lieblingsversion eines Champions erstellen und Ihr hättet neuen Input, welche Art Champions ihr in Zukunft noch bauen solltet.\r\nAchja, **kein Balancing nötig, weil es ein reiner Funmod ist und das Sandbox im vordergrund steht.**\r\nAußerdem könntet Ihr uns **eindlich ein dauerhaftes URF geben,** meinetwegen auch nur für Custom modi, aber dann auch für ARAM.\r\n\r\nVoller Inbrunst und Hoffnung,\r\nIch","replies":[{"poster":"crowley2018","date":"2020-02-29T12:31:09.150+0000","up_votes":2,"down_votes":0,"body":"Als Idee gut aber momentan nicht umsetzbar.\nDie bekommen ja schon den main shop nicht komplett hin, da wird ein zweiter nicht funktionieren.\nClash/sever sind auch in euw komplett instabil","replies":[{"poster":"Wladimir Putitin","date":"2020-02-29T13:08:18.923+0000","up_votes":1,"down_votes":0,"body":"gut das eine sind stabilitätsprobleme da ist ein anderes team mit beschäftigt.\nwas meinst du mit dem mainshop nicht hinbekommen? wie gesagt ich spiele nur aram und featured modes, gibts da probleme mit dem shop?","replies":[{"poster":"crowley2018","date":"2020-02-29T13:40:40.538+0000","up_votes":1,"down_votes":0,"body":"Ich meine die müssten einen komplett neuen shop mit hunderten verschiedenen Mechanics neu machen.\nglaube einfach nicht, dass Riot für noch einen neuen Modus kapazitäten hat. \nsonst keine schlechte Idee.","replies":[{"poster":"Wladimir Putitin","date":"2020-02-29T14:19:12.849+0000","up_votes":1,"down_votes":0,"body":"ich glaube das ist gar kein so großer aufwand.\ndas kriegen einzelne hobby modder bei dota 2 auch hin.\nder inhalt existiert ja schon, man muss ihn nur noch verfügbar machen und die champions mit freien fähigkeitsslots ausstatten\naber guter punkt. vielleicht gibt es ja einen programmierer, der hierzu was sagen kann.\nwäre es ein großer aufwand das in eine bestehende map zu implementieren?","replies":[]}]}]}]},{"poster":"Clit Eastwood","date":"2020-02-29T09:09:39.150+0000","up_votes":2,"down_votes":1,"body":"find das gar nicht schlecht!","replies":[]}]}